
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеОбязательныхПолей = Константы.ОбязательныеПоляЗаявки.Получить().Получить();	
	
	Если ЗначениеЗаполнено(ДанныеОбязательныхПолей) Тогда
		
		Для Каждого ДанныеПоля Из ДанныеОбязательныхПолей Цикл
			
			ОбязательноеПоле					 = ЭтотОбъект.ОбязательныеПоля.Добавить();
			ОбязательноеПоле.Поле				 = ДанныеПоля.Поле;
			ОбязательноеПоле.Обязательно		 = ДанныеПоля.Обязательно;
			ОбязательноеПоле.ПредставлениеПоля	 = ДанныеПоля.ПредставлениеПоля;
			
		КонецЦикла;
		
	Иначе
		
		СписокПолей = ПолучитьСписокПолей();
		
		Для Каждого Поле Из СписокПолей Цикл
			
			ОбязательноеПоле					 = ЭтотОбъект.ОбязательныеПоля.Добавить();
			ОбязательноеПоле.Поле				 = Поле.Значение;
			ОбязательноеПоле.ПредставлениеПоля	 = Поле.Представление;
			ОбязательноеПоле.Обязательно		 = Ложь;
			
		КонецЦикла;
		
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, сохраняет значение константы и закрывает форму.
//
Процедура Сохранить(Команда)
	
	ЗначениеКонстанты = Новый Массив;
	
	Для Каждого ДанныеПоля Из ЭтотОбъект.ОбязательныеПоля Цикл
		
		СтруктураДанныхПоля = Новый Структура;
		СтруктураДанныхПоля.Вставить("Поле"				, ДанныеПоля.Поле);
		СтруктураДанныхПоля.Вставить("Обязательно"		, ДанныеПоля.Обязательно);
		СтруктураДанныхПоля.Вставить("ПредставлениеПоля", ДанныеПоля.ПредставлениеПоля);
		
		ЗначениеКонстанты.Добавить(СтруктураДанныхПоля);
		
	КонецЦикла;
	
	СохранитьЗначениеКонстанты(ЗначениеКонстанты);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция, возвращает список полей.
//
Функция ПолучитьСписокПолей()
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Фамилия"				, "Фамилия");
	СписокПолей.Добавить("Имя"					, "Имя");
	СписокПолей.Добавить("Отчество"				, "Отчество");
	СписокПолей.Добавить("РекламныйИсточник"	, "Рекламный источник");
	СписокПолей.Добавить("КаналПривлечения"		, "Канал привлечения");
	СписокПолей.Добавить("НомерТелефона"		, "Номер телефона");
	СписокПолей.Добавить("АдресЭП"				, "Адрес электронной почты");
	СписокПолей.Добавить("ОсновнойМенеджер"		, "Куратор");
	СписокПолей.Добавить("СтруктурнаяЕдиница"	, "Клиника");
	
	Возврат СписокПолей;
	
КонецФункции	

&НаСервереБезКонтекста
// Процедура, сохраняет значение константы.
//
Процедура СохранитьЗначениеКонстанты(ЗначениеКонстанты)
	
	Константы.ОбязательныеПоляЗаявки.Установить(Новый ХранилищеЗначения(ЗначениеКонстанты));
	
КонецПроцедуры

#КонецОбласти
