
#Область СлужебныеПроцедурыИФункции

// Функция вернет остаток средств на подарочном сертификате
Функция ПолучитьОстатокСредствНаСертификате(СертификатНоменклатура,СерийныйНомер = Неопределено,СтруктурнаяЕдиница = Неопределено) Экспорт
	
	ЗапросВыборка = новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СертификатыОстатки.Сертификат,
	|	СУММА(СертификатыОстатки.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.Сертификаты.Остатки(
	|			,
	|			ВЫБОР
	|					КОГДА НЕ &СтруктурнаяЕдиница = НЕОПРЕДЕЛЕНО
	|							И НЕ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.Структурныеединицы.ПустаяСсылка)
	|						ТОГДА СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА НЕ &СерийныйНомер = НЕОПРЕДЕЛЕНО
	|							И НЕ &СерийныйНомер = ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|						ТОГДА СерийныйНомер = &СерийныйНомер
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И Сертификат = &Сертификат) КАК СертификатыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	СертификатыОстатки.Сертификат,
	|	СертификатыОстатки.СерийныйНомер,
	|	СертификатыОстатки.СтруктурнаяЕдиница");
	
	ЗапросВыборка.УстановитьПараметр("Сертификат"        ,СертификатНоменклатура);
	ЗапросВыборка.УстановитьПараметр("СерийныйНомер"     ,СерийныйНомер);
	ЗапросВыборка.УстановитьПараметр("СтруктурнаяЕдиница",СтруктурнаяЕдиница);
	
	Возврат ЗапросВыборка.Выполнить().Выгрузить().Итог("СуммаОстаток");
	
КонецФункции

#КонецОбласти