
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Номенклатура = Параметры.Номенклатура;
	Упаковка     = Номенклатура.УпаковкаПоумолчанию;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - обработчик нажатия кнопки ОК.
//
Процедура ОК(Команда)
	ТаблицаПраметров = Новый Структура;
	ТаблицаПраметров.Вставить("Количество", Количество);
	ТаблицаПраметров.Вставить("Упаковка", Упаковка);
	
	Закрыть(ПоместитьВоВременноеХранилище(ТаблицаПраметров));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработкаТабличныхЧастейКлиент.ВыбратьУпаковкуНоменклатуры(ДанныеВыбора, СтандартнаяОбработка, ЭтаФорма);
КонецПроцедуры

#КонецОбласти