///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////


#Область СлужебныйПрограммныйИнтерфейс

// Начать подключение системы взаимодействия.
//
// Параметры:
//   ОписаниеЗавершения - ОписаниеОповещения - оповещения, которые будет выполнено после закрытия формы подключения
// 											 с параметрами:
// 											 * Результат - Неопределено
// 											 * ДополнительныеПараметры - Неопределено
// 											                           - Структура.
//
Процедура ПоказатьПодключение(ОписаниеЗавершения = Неопределено) Экспорт
	ОбсужденияСлужебныйКлиент.ПоказатьПодключение(ОписаниеЗавершения);
КонецПроцедуры

// Начать отключение системы взаимодействия.
//
Процедура ПоказатьОтключение() Экспорт
	ОбсужденияСлужебныйКлиент.ПоказатьОтключение();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработка нажатия ссылки в поле HTML документа обсуждений
// Параметры:	Стандартные параметры события
//
Процедура ОбработатьНажатие(Форма, Элемент, ДанныеСобытия, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Если ДанныеСобытия.Свойство("Href") И ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
		Если Найти(ДанныеСобытия.Href, "Справочник.Пользователи")>0 Тогда
			//Представление = ПредставлениеНавигационнойСсылки(Сред(ДанныеСобытия.Href, Найти(ДанныеСобытия.Href, "e1cib/")));
			//Если НЕ ПустаяСтрока(Представление) Тогда
			//	ТекущееЗначение = Форма.СообщениеПользователя;
			//	ТекущееЗначение = ТекущееЗначение+?(НЕ ПустаяСтрока(ТекущееЗначение) И НЕ Прав(ТекущееЗначение, 1)=" ", " ", ""); 
			//	Форма.СообщениеПользователя = ТекущееЗначение+"@"+СтрЗаменить(Представление, " ", "_")+" ";
			//КонецЕсли;
		ИначеЕсли Прав(ДанныеСобытия.Href,12) = "/ПоказатьВсе" Тогда
			Форма.Обсуждение = ОбсужденияВызовСервера.ОбсужденияПоОбъекту(Форма.Объект);
		Иначе
			ПерейтиПоНавигационнойСсылке(ДанныеСобытия.Href);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

