
#Область СлужебныеПроцедурыИФункции

// Функция, выполняет возврат всех периодов работы.
//
Функция ПолучитьМассивПериодовРаботы(СтруктурнаяЕдиница = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПериодыРаботы.Ссылка КАК ПериодРаботы
	|ИЗ
	|	Справочник.ПериодыРаботы КАК ПериодыРаботы
	|ГДЕ
	|	НЕ ПериодыРаботы.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &СтруктурнаяЕдиница <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ПериодыРаботы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПериодРаботы");	
	
КонецФункции

#КонецОбласти