
#Область СлужебныеПроцедурыИФункции

// Изменяет элемент отбора динамического списка
//
// Параметры:
// Список         		- обрабатываемый динамический список,
// ИмяПоля        		- имя поля компоновки, отбор по которому нужно установить,
// ВидСравнения   		- вид сравнения отбора, по умолчанию - Равно,
// ПравоеЗначение 		- значение отбора,
// Установить     		- признак необходимости установить отбор
// РедактированиеОтбора	- признак замены значений в действующих полях отбора по их имени. Иначе (ложь) - накопление полей отбора.  						
//
Процедура ИзменитьЭлементОтбораСписка(Список,
									  ИмяПоля,
									  ПравоеЗначение = Неопределено,
									  Установить = Ложь,
									  ВидСравнения = Неопределено,
									  РодительГруппа = Неопределено,
									  РедактированиеОтбора = Истина) Экспорт
									  
	// РедактированиеОтбора установлено в ИСТИНА для того, чтобы редактировать существующие поля отбора.
	// В ином случае (ложь) поля отбора будут накапливаться.
	
	Если Установить Тогда
		УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения, РодительГруппа, РедактированиеОтбора);
	Иначе
		УдалитьЭлементОтбораСписка(Список, ИмяПоля);
	КонецЕсли;
	
КонецПроцедуры // ИзменитьЭлементОтбораСписка()

// Устанавливает диапазон дат для динамического списка
//
// Параметры:
//
// Список         			- обрабатываемый динамический список,
// ИмяПоляСДатой        		- имя поля компоновки, отбор по которому нужно установить,
// НачалоПериода   			- вид сравнения отбора, по умолчанию - Равно,
// КонецПериода 				- значение отбора,
// Установить     			- признак необходимости установить отбор,
// ВключаяГраницыИнтервала 	- признак включения границ интервала
//
Процедура УстановитьДиапазонДатДляСписка(Список, ИмяПоляСДатой, НачалоПериода, КонецПериода, Установить = Ложь, ВключаяГраницыИнтервала = Истина) Экспорт
	
	УдалитьГруппуОтбораСписка(Список.Отбор.Элементы, ИмяПоляСДатой);
	
	Если Установить Тогда
		УстановитьДиапазонДат(Список.Отбор.Элементы, ИмяПоляСДатой, НачалоПериода, КонецПериода, ВключаяГраницыИнтервала);
	КонецЕсли;
	
КонецПроцедуры // ИзменитьЭлементОтбораСписка()

// Устанавливает элемент отбор динамического списка
//
// Параметры:
// Список				- обрабатываемый динамический список,
// ИмяПоля				- имя поля компоновки, отбор по которому нужно установить,
// ВидСравнения			- вид сравнения отбора, по умолчанию - Равно,
// ПравоеЗначение 		- значение отбора
// РедактированиеОтбора	- признак замены значений в действующих полях отбора по их имени
//
Процедура УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения = Неопределено, РодительГруппа = Неопределено, РедактированиеОтбора = Ложь) Экспорт	
	
	КоллекцияЭлементов = Неопределено;
	Если ТипЗнч(Список) = Тип("ДинамическийСписок") Тогда
		КоллекцияЭлементов = Список.Отбор.Элементы;
	ИначеЕсли ТипЗнч(Список) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
		КоллекцияЭлементов = Список.Элементы;
    КонецЕсли; 
	
	УстановитьЭлементОтбораКоллекции(КоллекцияЭлементов, ИмяПоля, ПравоеЗначение, ВидСравнения, РодительГруппа, РедактированиеОтбора);	
КонецПроцедуры // УстановитьЭлементОтбораСписка()

// Процедура выполняет установку элемента отбора коллекции
//
Процедура УстановитьЭлементОтбораКоллекции(КоллекцияЭлементов, ИмяПоля, ПравоеЗначение, ВидСравнения = Неопределено, РодительГруппа = Неопределено, РедактированиеОтбора = Ложь)
	
	ЭлементОтбора = Неопределено;
	
	Если РедактированиеОтбора Тогда
		
		ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
		Для Каждого ЭлементОтбораПоиск Из КоллекцияЭлементов Цикл
			Если ТипЗнч(ЭлементОтбораПоиск) = Тип("ЭлементОтбораКомпоновкиДанных")
				И ЭлементОтбораПоиск.ЛевоеЗначение = ПолеКомпоновки Тогда
				
					ЭлементОтбора = ЭлементОтбораПоиск;
					Прервать;

			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЭлементОтбора = Неопределено Тогда		
		
		Если РодительГруппа <> Неопределено Тогда
			ЭлементОтбора = РодительГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Иначе
			ЭлементОтбора = КоллекцияЭлементов.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    КонецЕсли;	

	КонецЕсли;
	
	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ВидСравнения     = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
	ЭлементОтбора.Использование    = Истина;
	ЭлементОтбора.ПравоеЗначение   = ПравоеЗначение;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры // УстановитьЭлементОтбораСписка()

// Процедура выполняет установку элемента отбора коллекции
//
Процедура УстановитьДиапазонДат(КоллекцияЭлементов, ИмяПоляСДатой, НачалоПериода, КонецПериода, ВключаяГраницыИнтервала)
	
	// Добавим группу
	ГруппаОтбора = КоллекцияЭлементов.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.Использование = Истина;
	// ГруппаОтбора.Применение = ТипПримененияОтбораКомпоновкиДанных.Иерархия;
	ГруппаОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	// Теперь добавим элементы в группу	
	ЭлементОтбора_НачалоПериода = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора_НачалоПериода.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(ИмяПоляСДатой);
	ЭлементОтбора_НачалоПериода.Использование    = Истина; 
	ЭлементОтбора_НачалоПериода.ВидСравнения     = ?(ВключаяГраницыИнтервала = Истина, ВидСравненияКомпоновкиДанных.БольшеИлиРавно, ВидСравненияКомпоновкиДанных.Больше);
	ЭлементОтбора_НачалоПериода.ПравоеЗначение   = НачалоПериода;
	ЭлементОтбора_НачалоПериода.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ЭлементОтбора_КонецПериода = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора_КонецПериода.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(ИмяПоляСДатой);
	ЭлементОтбора_КонецПериода.Использование    = Истина;	
	ЭлементОтбора_КонецПериода.ВидСравнения     = ?(ВключаяГраницыИнтервала = Истина, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, ВидСравненияКомпоновкиДанных.Меньше);
	ЭлементОтбора_КонецПериода.ПравоеЗначение   = ?(КонецПериода = Дата(1,1,1), Дата(2999,1,1), КонецПериода);
	ЭлементОтбора_КонецПериода.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры // УстановитьЭлементОтбораСписка()

// Создать для списка ГруппаЭлементовОтбораКомпоновкиДанных
Функция СоздатьГруппуЭлементовОтбораКомпоновкиДанных(Список,ТипГруппы,РодительГруппа = Неопределено) Экспорт
	ЭлементОтбора = Неопределено;
	Если РодительГруппа <> Неопределено Тогда
		ЭлементОтбора = РодительГруппа.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	Иначе
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	КонецЕсли;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ТипГруппы     = ТипГруппы;
	Возврат ЭлементОтбора;
КонецФункции

// Процедура выполняет удаление элемента отбора коллекции
//
Процедура УдалитьЭлементОтбораКоллекции(КоллекцияЭлементов, ИмяПоля)
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для Каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			КоллекцияЭлементов.Удалить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // УдалитьЭлементОтбораСписка()

// Процедура выполняет удаление элемента отбора коллекции
//
Процедура УдалитьГруппуОтбораСписка(КоллекцияЭлементов, ИмяПоляСДатой)
	
	УдалитьГруппу = Ложь;
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоляСДатой);
	Для Каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда 
			Для Каждого ЭлементаГруппы Из ЭлементОтбора.Элементы Цикл 
				Если ТипЗнч(ЭлементаГруппы) = Тип("ЭлементОтбораКомпоновкиДанных")	И
					ЭлементаГруппы.ЛевоеЗначение = ПолеКомпоновки 					Тогда 
					УдалитьГруппу = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если УдалитьГруппу Тогда  
				КоллекцияЭлементов.Удалить(ЭлементОтбора);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;			
	
КонецПроцедуры // УдалитьЭлементОтбораСписка()

// Удаляет элемент отбора динамического списка
//
// Параметры:
// Список  - обрабатываемый динамический список,
// ИмяПоля - имя поля компоновки, отбор по которому нужно удалить
//
Процедура УдалитьЭлементОтбораСписка(Список, ИмяПоля) Экспорт

	КоллекцияЭлементов = Неопределено;
	Если ТипЗнч(Список) = Тип("ДинамическийСписок") Тогда
		КоллекцияЭлементов = Список.Отбор.Элементы;
	ИначеЕсли ТипЗнч(Список) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
		КоллекцияЭлементов = Список.Элементы;
	КонецЕсли;
	
	УдалитьЭлементОтбораКоллекции(КоллекцияЭлементов, ИмяПоля);
	
КонецПроцедуры // УдалитьЭлементОтбораСписка()

// Удаляет элемент группировки динамического списка
//
// Параметры:
// Список  - обрабатываемый динамический список,
// ИмяПоля - имя поля компоновки, группировку по которому нужно удалить
//
Процедура УдалитьЭлементГруппировкиСписка(Список, ИмяПоля) Экспорт
	
	УдалитьЭлементГруппировкиКоллекции(Список.Группировка.Элементы, ИмяПоля);
	
КонецПроцедуры // УдалитьЭлементГруппировкиСписка()

// Процедура выполняет удаление элемента группировки коллекции
//
Процедура УдалитьЭлементГруппировкиКоллекции(КоллекцияЭлементов, ИмяПоля)
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для Каждого ЭлементГруппировки Из КоллекцияЭлементов Цикл
		Если ТипЗнч(ЭлементГруппировки) = Тип("ПолеГруппировкиКомпоновкиДанных")
			И ЭлементГруппировки.Поле = ПолеКомпоновки Тогда
			КоллекцияЭлементов.Удалить(ЭлементГруппировки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // УдалитьЭлементГруппировкиСписка()

// Устанавливает элемент группировки динамического списка
//
// Параметры:
// Список			- обрабатываемый динамический список,
// ИмяПоля			- имя поля компоновки, группировку по которому нужно установить,
//
Процедура УстановитьЭлементГруппировкиСписка(Список, ИмяПоля) Экспорт
	
	УстановитьЭлементГруппировкиКоллекции(Список.Группировка.Элементы, ИмяПоля);
	
КонецПроцедуры // УстановитьЭлементГруппировкиСписка()

// Процедура выполняет установку элемента отбора коллекции
//
Процедура УстановитьЭлементГруппировкиКоллекции(КоллекцияЭлементов, ИмяПоля)
	
	ЭлементГруппировки = КоллекцияЭлементов.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ЭлементГруппировки.Поле 		 = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементГруппировки.Использование = Истина;
	
КонецПроцедуры // УстановитьЭлементОтбораСписка()

// Изменяет элемент группировки динамического списка
//
// Параметры:
// Список         - обрабатываемый динамический список,
// ИмяПоля        - имя поля компоновки, группировку по которому нужно установить,
// Установить     - признак необходимости установить группировку
//
Процедура ИзменитьЭлементГруппировкиСписка(Список, ИмяПоля, Установить = Ложь) Экспорт
	
	УдалитьЭлементГруппировкиСписка(Список, ИмяПоля);
	
	Если Установить Тогда
		УстановитьЭлементГруппировкиСписка(Список, ИмяПоля);
	КонецЕсли;
	
КонецПроцедуры // ИзменитьЭлементГруппировкиСписка()

////////////////////////////////////////////////////////////////////////////////
// РАБОТА С СКД

// Среди элементов полей СКД найти поле по имени.
//
Функция НайтиПолеСКДПоИмени(Элементы, Имя) Экспорт
	
	Для Каждого Элемент Из Элементы Цикл
		Если ВРЕГ(Строка(Элемент.Поле)) = ВРЕГ(Имя) Тогда
			Возврат Элемент;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции // НайтиПолеСКДПоИмени()

// Полное имя поля разделить по частям
//
Функция ИзПолногоИмениПоляПолучитьЧасти(ПолноеИмя) Экспорт

	масЧастей = Новый Массив;
	СтрИмя = ПолноеИмя;
	
	Пока Не ПустаяСтрока(СтрИмя) Цикл
		Если Лев(СтрИмя, 1) = "[" Тогда
			
			Поз = Найти(СтрИмя, "]");
			Если Поз = 0 Тогда
				масЧастей.Добавить(Сред(СтрИмя, 2));
				СтрИмя = "";
			Иначе
				масЧастей.Добавить(Сред(СтрИмя, 1, Поз));
				СтрИмя = Сред(СтрИмя, Поз + 2);
			КонецЕсли;
			
		Иначе
			
			Поз = Найти(СтрИмя, ".");
			Если Поз = 0 Тогда
				масЧастей.Добавить(СтрИмя);
				СтрИмя = "";
			Иначе
				масЧастей.Добавить(Лев(СтрИмя, Поз - 1));
				СтрИмя = Сред(СтрИмя, Поз + 1);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат масЧастей;

КонецФункции // ИзПолногоИмениПоляПолучитьЧасти()

Функция НайтиПолеСКДПоПолномуИмени(Элементы, ПолноеИмя) Экспорт

	масЧастейИмен = ИзПолногоИмениПоляПолучитьЧасти(ПолноеИмя);
	колЧастей = масЧастейИмен.Количество();
	
	текИмя = масЧастейИмен[0];
	Поле = НайтиПолеСКДПоИмени(Элементы, текИмя);
	Если Поле = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для Сч = 2 По колЧастей Цикл
		текИмя = текИмя +"." + масЧастейИмен[Сч-1];
		Поле = НайтиПолеСКДПоИмени(Поле.Элементы, текИмя);
		Если Поле = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Поле;

КонецФункции

// Функция - Добавить группа элементов отбора списка
// 
// Параметры:
//  Список					 - 	 - 
//  ТипГруппыЭлементовОтбора - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ДобавитьИлиПолучитьГруппаЭлементовОтбораСписка(Список, ТипГруппыЭлементовОтбора, Представление = Неопределено) Экспорт
	
	ГруппаОтбора = НайтиГруппуЭлементовОтбора(Список.Отбор.Элементы,ТипГруппыЭлементовОтбора, Представление);
	Если ГруппаОтбора = Неопределено Тогда
		ГруппаОтбора               = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы     = ТипГруппыЭлементовОтбора;
		ГруппаОтбора.Представление = Представление;
	КонецЕсли;

	Возврат ГруппаОтбора;
КонецФункции

// Функция - Найти группу элементов отбора
// 
// Параметры:
//  КоллекцияЭлементов		 - 	 - 
//  ТипГруппыЭлементовОтбора - 	 - 
//  ПредставлениеГруппы		 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
функция НайтиГруппуЭлементовОтбора(КоллекцияЭлементов, ТипГруппыЭлементовОтбора, ПредставлениеГруппы = Неопределено)
	
	Для Каждого ГруппаОтбора Из КоллекцияЭлементов Цикл
		Если ТипЗнч(ГруппаОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных")
			И ГруппаОтбора.ТипГруппы  = ТипГруппыЭлементовОтбора
			И (ГруппаОтбора.Представление = ПредставлениеГруппы ИЛИ ПредставлениеГруппы = Неопределено) Тогда
			
			Возврат ГруппаОтбора;	
		КонецЕсли;
	КонецЦикла;

КонецФункции 

#КонецОбласти
