
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест"
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Идентификатор", Идентификатор);
	Заголовок = НСтр("ru='Оборудование:';en='Equipment:'") + Символы.НПП  + Строка(Идентификатор);
	
	времПорт            	= Неопределено;
	времСервер          	= Неопределено;
	времЛогин        		= Неопределено;
	времКлюч	        	= Неопределено;
	времСтруктурнаяЕдиница 	= Неопределено;

	Параметры.ПараметрыОборудования.Свойство("Сервер"          		, времСервер);
	Параметры.ПараметрыОборудования.Свойство("Порт"            		, времПорт);
	Параметры.ПараметрыОборудования.Свойство("Логин"	     	 	, времЛогин);
	Параметры.ПараметрыОборудования.Свойство("Ключ"          		, времКлюч);
	Параметры.ПараметрыОборудования.Свойство("СтруктурнаяЕдиница"	, времСтруктурнаяЕдиница);
	
	Сервер          	= ?(времСервер	        = Неопределено,   "https://callapi.comagic.ru"	, времСервер);
	Порт            	= ?(времПорт            = Неопределено,   80			, времПорт);
	Логин        		= ?(времЛогин     		= Неопределено,   ""			, времЛогин);
	Ключ	          	= ?(времКлюч	        = Неопределено,   ""			, времКлюч);
	СтруктурнаяЕдиница 	= ?(времСтруктурнаяЕдиница = Неопределено, Неопределено	, времСтруктурнаяЕдиница);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрытьВыполнить()
	
	НовыеЗначениеПараметров = Новый Структура;
	НовыеЗначениеПараметров.Вставить("Сервер"          , Сервер);
	НовыеЗначениеПараметров.Вставить("Порт"            , Порт);
	НовыеЗначениеПараметров.Вставить("Логин" 		   , Логин);
	НовыеЗначениеПараметров.Вставить("Ключ"			   , Ключ);
	НовыеЗначениеПараметров.Вставить("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", Идентификатор);
	Результат.Вставить("ПараметрыОборудования", НовыеЗначениеПараметров);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестУстройства(Команда)
	
	ОчиститьСообщения();
	СообщениеОшибки  = "";
	
	Результат = IPТелефония.CoMagic_ТестированиеСервера(Сервер, Порт, Логин, Ключ, СообщениеОшибки);
	Если Результат Тогда
		ТекстСообщения = НСтр("ru='Тест успешно выполнен.';en='Test successfully completed.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		ТекстСообщения = НСтр("ru = 'Тест не пройден. Ошибка:" + Символы.ПС + " %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", СообщениеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИспользованиеТранслятора

&НаКлиенте
Процедура ИспользоватьРетрансляторПриИзменении(Элемент)
	
	ОписаниеОшибки   = "";
	ВыполненоУспешно = Ложь;
	Модифицированность = Истина;
			
	ДопПараметры = Новый Структура("operator_IP_telephony", "CoMagic");
	
	Если ИспользоватьРетранслятор Тогда 
		
		ВыполненоУспешно = ПодключитьВнешнююСистему(ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.IPТелефония"), ОписаниеОшибки, ДопПараметры);	
		
		Если ВыполненоУспешно Тогда			
			Токен = ПолучитьВнешнююСистему();
			АдресПубликации = СменитьПубликацию(Истина);
		ИначеЕсли ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Источники заявок: '; en = 'Sources of applications: '") + ОписаниеОшибки); 		
			ИспользоватьРетранслятор = Ложь;
		КонецЕсли;
		
	Иначе		
		
		ВыполненоУспешно = ОтключитьВнешнююСистему(ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.IPТелефония"), ОписаниеОшибки, ДопПараметры);
		
		Если ВыполненоУспешно Тогда  			
			Токен = ПолучитьВнешнююСистему();	
			АдресПубликации = СменитьПубликацию(Ложь);
		ИначеЕсли ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Источники заявок: '; en = 'Sources of applications: '") + ОписаниеОшибки); 		
			ИспользоватьРетранслятор = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Подключить внешнюю систему.
// 
Функция ПодключитьВнешнююСистему(ТипВнешнейСистемы, ОписаниеОшибки = Неопределено, ДополнительныеПараметры = Неопределено)
	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, ТипВнешнейСистемы, Ложь); 
	
	Если ЗначениеЗаполнено(ВнешняяСистема) Тогда
		Возврат ОбновитьВнешнююСистему(ВнешняяСистема, Истина, ОписаниеОшибки, ДополнительныеПараметры);
	КонецЕсли;
	
	Возврат СоздатьВнешнююСистему(ТипВнешнейСистемы, ОписаниеОшибки, ДополнительныеПараметры);
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Отключить внешнюю систему.
// 
Функция ОтключитьВнешнююСистему(ТипВнешнейСистемы, ОписаниеОшибки = Неопределено, ДополнительныеПараметры = Неопределено)
	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, ТипВнешнейСистемы, Ложь); 
	
	Если ЗначениеЗаполнено(ВнешняяСистема) Тогда 		
		Возврат ОбновитьВнешнююСистему(ВнешняяСистема, Ложь, ОписаниеОшибки, ДополнительныеПараметры);
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Создать внешнюю систему.
//
Функция СоздатьВнешнююСистему(ТипВнешнейСистемы, ОписаниеОшибки = Неопределено, ДополнительныеПараметры = Неопределено)
	
	ВнешняяСистема   = Справочники.ВнешниеСистемы.СоздатьВнешнююСистему(ТипВнешнейСистемы);
	УидСессии        = ЛичныйКабинет.УидТекущейСессии();	
	РезультатЗапроса = ЛичныйКабинет.СоздатьВнешнююСистемуВ_CRM(ВнешняяСистема, УидСессии,,, ДополнительныеПараметры);
	
	Если Не РезультатЗапроса.ВыполненоУспешно Тогда
		
		Справочники.ВнешниеСистемы.УстановитьСостояниеВнешнейСистеме(ВнешняяСистема, Ложь, Ложь);
		ОписаниеОшибки = РезультатЗапроса.ОписаниеОшибки;
	Иначе
		Справочники.ВнешниеСистемы.УстановитьСостояниеВнешнейСистеме(ВнешняяСистема, Истина, Истина);
		
	КонецЕсли;
	
	Возврат РезультатЗапроса.ВыполненоУспешно;
			
КонецФункции

&НаСервереБезКонтекста
// Функция, включает/отключает внешнюю систему.
//
Функция ОбновитьВнешнююСистему(ВнешняяСистема, Используется = Истина, ОписаниеОшибки = Неопределено, ДополнительныеПараметры = Неопределено)
	
	УидСессии        = ЛичныйКабинет.УидТекущейСессии();		
	РезультатЗапроса = ЛичныйКабинет.ОбновитьВнешнююСистемуВ_CRM(ВнешняяСистема, Используется, УидСессии,,, ДополнительныеПараметры);		
	
	Если РезультатЗапроса.ВыполненоУспешно Тогда		
		Справочники.ВнешниеСистемы.УстановитьСостояниеВнешнейСистеме(ВнешняяСистема, Используется, Используется);				
	Иначе	
		ОписаниеОшибки = РезультатЗапроса.ОписаниеОшибки;	
	КонецЕсли;
	
	Возврат РезультатЗапроса.ВыполненоУспешно;
		
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить внешнию систему
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьВнешнююСистему() 	
	Возврат Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(,Перечисления.ТипыВнешнихСистем.IPТелефония).КлючПриложения;
КонецФункции   

&НаСервере
// Процедура - Сменить публикацию
//
Функция СменитьПубликацию(Флаг = Ложь)
	
	АдресРетранслятора  = "http://cloud.stoma1c.ru/api";
	HTTPСервис = "/hs/Click2Call/comagic";			
	Токен = ?(ЗначениеЗаполнено(Токен), Токен, Ключ);	
	Если Флаг Тогда
		Возврат "" + АдресРетранслятора + HTTPСервис;
	Иначе 
		АдресПубликации = Константы.ВнешняяПубликацияАдрес.Получить();		
		АдресПубликации = СокрЛП(АдресПубликации);
		АдресПубликации = ?(СтрЗаканчиваетсяНа(АдресПубликации, "/"),  Лев(АдресПубликации, СтрДлина(АдресПубликации)-1), АдресПубликации);
		Возврат "" + АдресПубликации + HTTPСервис;
	КонецЕсли;		
	
КонецФункции

&НаСервереБезКонтекста
// Процедура, ПолучитьВнешнююСистему.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Функция ПроверитьПодключениеВнешнейСистемы(ТипВнешнейСистемы)
	
	Возврат ЗначениеЗаполнено(Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, ТипВнешнейСистемы));

КонецФункции

#КонецОбласти

#КонецОбласти