
#Область СлужебныйПрограммныйИнтерфейс

// Процедура, обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
		ЗаписьНабора.ТекстСообщения = УдалитьНедопустимыеСимволыСправа(ЗаписьНабора.ТекстСообщения);
	КонецЦикла;
	
КонецПроцедуры

// Процедура - При записи
//
// Параметры:
//  Отказ		 - 	 - 
//  Замещение	 - 	 - 
//
Процедура ПриЗаписи(Отказ, Замещение)

	// Включаем задание в области, если ранее было выключено
	Если ЗначениеЗаполнено(ЭтотОбъект) Тогда
		РегламентныеЗаданияСерверСтоматология.АктуализироватьЗаданиеОчереди(Метаданные.РегламентныеЗадания.ОбработкаSMSСообщений);
	КонецЕсли;
	
КонецПроцедуры      

#КонецОбласти
