
#Область ОбработчикиСобытий

&НаКлиенте
//
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = Новый Структура;
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда 
		Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.Прием") Тогда 
			ПараметрыОткрытия.Вставить("Сотрудник" , ВрачИзДокумента(ПараметрКоманды));
			ПараметрыОткрытия.Вставить("Контрагент", ПациентИзДокумента(ПараметрКоманды)); 
		ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.Событие") Тогда 
			ПараметрыОткрытия.Вставить("Сотрудник"                        , ВрачИзДокумента(ПараметрКоманды));
			ПараметрыОткрытия.Вставить("Контрагент"                       , ПациентИзДокумента(ПараметрКоманды)); 
			ПараметрыОткрытия.Вставить("ПеренесённаяПредварительнаяЗапись", ПараметрКоманды); 
			ПараметрыОткрытия.Вставить("ЗакрытьПриСозданииЗаписи"         , Истина);
			ПараметрыВыполненияКоманды.Источник.Закрыть();
		КонецЕсли;
	КонецЕсли;	
	ОткрытьФорму("Обработка.РабочийКалендарь.Форма.ФормаПредварительнойЗаписи", ПараметрыОткрытия, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры // ОбработкаКоманды()

&НаСервере
//
//
Функция ВрачИзДокумента(Документ)  
	
	Возврат ?(ТипЗнч(Документ) = Тип("ДокументСсылка.Прием"), Документ.Сотрудник, Документ.Врач);	
	
КонецФункции	

&НаСервере
//
//
Функция ПациентИзДокумента(Документ)  
	
	Возврат Документ.Контрагент;	
	
КонецФункции

#КонецОбласти
