
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВывестиОтчет();	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды "Сформировать"
//
Процедура Сформировать(Команда)
	ВывестиОтчет(НачалоПериода, КонецПериода);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, формирует отчет
//
Процедура ВывестиОтчет(НачалоПериода = Неопределено, КонецПериода = Неопределено)
	Отчеты.ПечатьФормы39.ВывестиПечатьФормы39(ТабличныйДокумент, НачалоПериода, КонецПериода);
КонецПроцедуры

#КонецОбласти

