&НаКлиенте
Перем ПараметрыОбработчика;
&НаКлиенте
Перем ПеременныеКлиента;
&НаСервере
Перем УстановитьКассовуюСмену;

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события формы "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Локальные переменные.
	ОтчетОбъект     = РеквизитФормыВЗначение("Отчет");
	ОтчетМетаданные = ОтчетОбъект.Метаданные();
	КлючОбъекта     = ОтчетМетаданные.ПолноеИмя();

	// Параметры формы.
	РежимРасшифровки    = (Параметры.Свойство("Расшифровка") И НЕ Параметры.Расшифровка = Неопределено);
	РежимВариантаОтчета = (ТипЗнч(КлючТекущегоВарианта) = Тип("Строка") И Не ПустаяСтрока(КлючТекущегоВарианта));	
	ПравоВывода         = ПравоДоступа("Вывод", Метаданные);
	
	ФормаПараметры = Новый Структура(
	"КлючНазначенияИспользования, КлючПользовательскихНастроек,
	|Расшифровка, СформироватьПриОткрытии, ТолькоПросмотр, Колонки,
	|ФиксированныеНастройки, Раздел, Подсистема, ПодсистемаПредставление");
	
	ЗаполнитьЗначенияСвойств(ФормаПараметры, Параметры);
	
	ФормаПараметры.Вставить("Отбор", Новый Соответствие);
	
	Если ТипЗнч(Параметры.Отбор) = Тип("Структура") Тогда
		
		Для Каждого КлючИЗначение Из Параметры.Отбор Цикл
			ФормаПараметры.Отбор.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла; 
		
		Параметры.Отбор.Очистить();
		
	КонецЕсли;
	Параметры.Свойство("Врач", Врач);	
	Если Параметры.Свойство("ОтборРасшифровки") И ТипЗнч(Параметры.ОтборРасшифровки) = Тип("Соответствие") Тогда
		
		Для Каждого КлючИЗначение Из Параметры.ОтборРасшифровки Цикл
			ФормаПараметры.Отбор.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла; 
		
	КонецЕсли;
	
	ВариантИнтерфейса = ТекущийВариантИнтерфейсаКлиентскогоПриложения();
	ФормаПараметры.Вставить("ВариантИнтерфейса", ВариантИнтерфейса);
	
	ФормаПараметры.Вставить("ЭтоМобильныйКлиент", ОбщегоНазначенияКлиентСервер.ЭтоМобильныйКлиент());

	НастройкиОтчета = ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию();
	НастройкиОтчета.Вставить("Контекстный", (Параметры.Свойство("Контекст") И ЗначениеЗаполнено(Параметры.Контекст)) ИЛИ (Параметры.Свойство("ОтборРасшифровки") И Параметры.ОтборРасшифровки.Количество()>0));
	
	Если Параметры.Свойство("СложныйАлгоритм") И Параметры.СложныйАлгоритм Тогда
		// Сложный алгоритм контекстного вызова отчета
		// Обработчик задан в модуле объекта отчета
		Попытка
			ОтчетОбъект.ПриКонтекстномОткрытии(Параметры.Контекст, Параметры.ПолеСвязи, ФормаПараметры.Отбор, Отказ);
			Если Отказ Тогда
				Возврат;
			КонецЕсли; 
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
		КонецПопытки;
		
		Если ИнформацияОбОшибке <> Неопределено Тогда
			ПоказатьОшибкиФормирования(ИнформацияОбОшибке);
		КонецЕсли;
		
	КонецЕсли; 
	
	ФормаПараметры.Вставить("Отбор", Новый ФиксированноеСоответствие(ФормаПараметры.Отбор));
	ФормаПараметры = Новый ФиксированнаяСтруктура(ФормаПараметры);
	
	МодифицироватьСхему(ОтчетОбъект.СхемаКомпоновкиДанных);
	АдресСхемы = ПоместитьВоВременноеХранилище(ОтчетОбъект.СхемаКомпоновкиДанных, УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	Отчет.КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	
	НастройкиОтчета.Вставить("ПолноеИмя", ОтчетМетаданные.ПолноеИмя());
	НастройкиОтчета.Вставить("ИмяОтчета", ОтчетМетаданные.Имя);
	НастройкиОтчета.Вставить("Наименование", СокрЛП(ОтчетМетаданные.Представление()));
	
	Если Параметры.Свойство("ДополнительнаяОбработкаСсылка") Тогда
		НастройкиОтчета.Вставить("ОтчетСсылка", Параметры.ДополнительнаяОбработкаСсылка);
	ИначеЕсли Параметры.Свойство("Отчет") Тогда
		НастройкиОтчета.Вставить("ОтчетСсылка", Параметры.Отчет);
	Иначе
		// ТипОтчетаСтрокой = ВариантыОтчетов.ТипОтчетаСтрокой(Параметры.Отчет);
		// Если ТипОтчетаСтрокой = Неопределено Тогда
			Информация      = ВариантыОтчетов.ИнформацияОбОтчете(КлючОбъекта, Истина);
			НастройкиОтчета.Вставить("ОтчетСсылка", Информация.Отчет);
		// КонецЕсли;
		
		// Информация = ВариантыОтчетов.СформироватьИнформациюОбОтчетеПоПолномуИмени(НастройкиОтчета.ПолноеИмя);
		// НастройкиОтчета.Вставить("ОтчетСсылка", Информация.Отчет);
	КонецЕсли; 
	
	НастройкиОтчета.Вставить("Внешний", ТипЗнч(НастройкиОтчета.ОтчетСсылка) = Тип("Строка") ИЛИ ТипЗнч(НастройкиОтчета.ОтчетСсылка) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки"));
	НастройкиОтчета.Вставить("Безопасный",  БезопасныйРежим() <> Ложь);
	НастройкиОтчета.Вставить("ИспользуетХранилищеВариантов", ОтчетОбъект.Метаданные().ХранилищеВариантов <> Неопределено);
	НастройкиОтчета.Вставить("ФормироватьНепосредственно", НастройкиОтчета.Внешний Или НастройкиОтчета.Безопасный ИЛИ 
	(Параметры.Свойство("ФормироватьНепосредственно") И Параметры.ФормироватьНепосредственно) ИЛИ Константы.ОтчетыФормироватьНепосредственно.Получить());	
	НастройкиОтчета.Вставить("АдресСхемы", АдресСхемы);
	НастройкиОтчета.Вставить("ПользовательскиеНастройки", Параметры.ПользовательскиеНастройки);	
	НастройкиОтчета.Вставить("ПредопределенныеВарианты", Новый СписокЗначений);
	
	Если НастройкиОтчета.Внешний И ОтчетОбъект.СхемаКомпоновкиДанных <> Неопределено Тогда
		
		Для Каждого ВариантОтчета Из ОтчетОбъект.СхемаКомпоновкиДанных.ВариантыНастроек Цикл
			НастройкиОтчета.ПредопределенныеВарианты.Добавить(ВариантОтчета.Имя, ВариантОтчета.Представление);
		КонецЦикла;
		
	КонецЕсли;
	
	// Приведение зависимых элементов формы к кондиции.
	ЗаполнитьКомандыВыбораВариантов();
	
	Если ТипЗнч(КлючТекущегоВарианта) = Тип("СправочникСсылка.ВариантыОтчетов") Тогда
		
		Если Элементы.Вариант.СписокВыбора.НайтиПоЗначению(КлючТекущегоВарианта) = Неопределено
			И Элементы.Вариант.СписокВыбора.Количество() > 0 Тогда
			
			КлючТекущегоВарианта = Элементы.Вариант.СписокВыбора[0].Значение;
		КонецЕсли; 
	Иначе
		ТекВариант = ПолучитьСсылку(НастройкиОтчета.ОтчетСсылка, КлючТекущегоВарианта);
		
		Если Элементы.Вариант.СписокВыбора.НайтиПоЗначению(ТекВариант) = Неопределено
			И Элементы.Вариант.СписокВыбора.Количество() > 0 Тогда
			
			ТекВариант = Элементы.Вариант.СписокВыбора[0].Значение;
			
			Если ТипЗнч(ТекВариант) = Тип("Строка") Тогда
				КлючТекущегоВарианта = ТекВариант;
			ИначеЕсли ТипЗнч(ТекВариант) = Тип("СправочникСсылка.ВариантыДополнительныхОтчетов") Тогда
				КлючТекущегоВарианта = ТекВариант.ИдентификаторКоманды;
			Иначе
				КлючТекущегоВарианта = ТекВариант.КлючВарианта;
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если ВариантыОтчетовПовтИсп.Параметры().ОтчетыСНастройками.Найти(НастройкиОтчета.ОтчетСсылка) <> Неопределено Тогда
		
		// ОтчетОбъект.ОпределитьНастройкиФормы(ЭтотОбъект, КлючТекущегоВарианта, НастройкиОтчета);
		СоответствиеПериодичностиПараметров = Новый Соответствие;
		
		Для Каждого КлючИЗначение Из НастройкиОтчета.СоответствиеПериодичностиПараметров Цикл
			
			ПолеКД = КлючИЗначение.Ключ;
			
			Если ТипЗнч(ПолеКД) = Тип("ПараметрКомпоновкиДанных") Тогда
				ПолеКД = Новый ПолеКомпоновкиДанных("ПараметрыДанных." + Строка(ПолеКД));
			КонецЕсли;
			
			СоответствиеПериодичностиПараметров.Вставить(ПолеКД, КлючИЗначение.Значение);
			
		КонецЦикла;
		
		НастройкиОтчета.Вставить("СоответствиеПериодичностиПараметров", СоответствиеПериодичностиПараметров);
		
	КонецЕсли;
		
	// Параметры по умолчанию
	Если НастройкиОтчета.Свойство("ВыводитьСуммуВыделенныхЯчеек") И Не НастройкиОтчета.ВыводитьСуммуВыделенныхЯчеек Тогда
		Элементы.АвтоСуммаГруппа.Видимость = Ложь;
		Элементы.ОтчетТабличныйДокумент.УстановитьДействие("ПриАктивизацииОбласти", "");
	КонецЕсли;
	
	// Тесная интеграция с подсистемами БСП.
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РассылкаОтчетов") Тогда
		
		Если НЕ НастройкиОтчета.Свойство("ВариантСсылка") Тогда
			Если Параметры.Свойство("Ключ") И ТипЗнч(Параметры.Ключ)=Тип("СправочникСсылка.ВариантыОтчетов") Тогда
				НастройкиОтчета.Вставить("ВариантСсылка", Параметры.Ключ);
			Иначе
				НастройкиОтчета.Вставить("ВариантСсылка", Справочники.ВариантыОтчетов.ПустаяСсылка());
			КонецЕсли; 
		КонецЕсли;
		МодульРассылкаОтчетов = ОбщегоНазначения.ОбщийМодуль("РассылкаОтчетов");
		МодульРассылкаОтчетов.ФормаОтчетаДобавитьКоманды(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	КонецЕсли;

	// События.
	ОтчетыПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	Если НастройкиОтчета.События.ПриСозданииНаСервере Тогда
		ОтчетОбъект.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	КонецЕсли;
	
	Если ФормаПараметры.ВариантИнтерфейса = ВариантИнтерфейсаКлиентскогоПриложения.Такси
		И Не ФормаПараметры.ЭтоМобильныйКлиент Тогда
		Элементы.ПредставлениеПериода.Шрифт = Новый Шрифт(Элементы.ПредставлениеПериода.Шрифт,, 13);
		Элементы.ПредставлениеПериода.ШрифтЗаголовка = Новый Шрифт(Элементы.ПредставлениеПериода.ШрифтЗаголовка,, 13);
	Иначе
		Элементы.ПредставлениеПериода.Шрифт = Новый Шрифт(Элементы.ПредставлениеПериода.Шрифт,, 9);
		Элементы.ПредставлениеПериода.ШрифтЗаголовка = Новый Шрифт(Элементы.ПредставлениеПериода.ШрифтЗаголовка,, 9);
	КонецЕсли;
	
	Если ФормаПараметры.ЭтоМобильныйКлиент Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Справка", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РаскрытьНаВесьЭкран", "Видимость", Ложь);
	КонецЕсли;
	
	СписокАвтоПолей.Очистить();
	Для каждого ТекПоле из Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы Цикл
		СписокАвтоПолей.Добавить(ТекПоле.Поле);
	КонецЦикла;
	
	СчетчикФормирований = 0;
		
	Если КлючОбъекта = "Отчет.КритическиеОстатки" Тогда
	    Элементы.Создать.Видимость = Истина;
	КонецЕсли;	 
	
	ЗаполнитьСписокВыбораРежимаНапоминания();
	
	// Макеты оформления
	Элементы.МакетОформления.СписокВыбора.Очистить();
	Элементы.МакетОформления.СписокВыбора.Добавить("", НСтр("ru = '<По умолчанию>'"));
	Для каждого Макет Из БиблиотекаМакетовОформленияКомпоновкиДанных Цикл
		Если Макет = БиблиотекаМакетовОформленияКомпоновкиДанных.МакетОформленияОтчетов Тогда
			ПредставленеиМакета = НСтр("ru = 'Лес'");
		ИначеЕсли Макет = БиблиотекаМакетовОформленияКомпоновкиДанных.Основной Тогда
			ПредставленеиМакета = НСтр("ru = 'Классический'");
		Иначе
			ПредставленеиМакета = Макет.Представление;
		КонецЕсли; 
		Элементы.МакетОформления.СписокВыбора.Добавить(Макет.Имя, ПредставленеиМакета);
	КонецЦикла;
	Элементы.МакетОформления.СписокВыбора.СортироватьПоПредставлению();
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик события "ПриОткрытии" формы
//
Процедура ПриОткрытии(Отказ)
	
	ПеременныеКлиента = Новый Структура;
	
	#Если ВебКлиент Тогда
		ПеременныеКлиента.Вставить("ИнтервалОжидания", 1);
	#Иначе
		ПеременныеКлиента.Вставить("ИнтервалОжидания", ?(ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая, 1, 0.2));
	#КонецЕсли 
	
	Если НастройкиОтчета.Контекстный ИЛИ ФормаПараметры.СформироватьПриОткрытии=Истина Тогда
		Если ПроверитьЗаполнениеПараметров() Тогда
			Сформировать();
		КонецЕсли; 
	КонецЕсли;   
		                                      
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(Результат, ПодчиненнаяФорма)
	
	РезультатОбработан = Ложь;
	
	// Приемка результата из стандартных форм.
	Если ТипЗнч(ПодчиненнаяФорма) = Тип("УправляемаяФорма") Тогда
		ИмяПодчиненнойФормы = ПодчиненнаяФорма.ИмяФормы;
		Если ИмяПодчиненнойФормы = "ХранилищеНастроек.ХранилищеВариантовОтчетов.Форма.НастройкиОтчета"
			Или ПодчиненнаяФорма.ОписаниеОповещенияОЗакрытии <> Неопределено Тогда
			РезультатОбработан = Истина; // См. ВсеНастройкиЗавершение.
		ИначеЕсли ТипЗнч(Результат) = Тип("Структура") Тогда
			ПозицияТочки = СтрДлина(ИмяПодчиненнойФормы);
			Пока КодСимвола(ИмяПодчиненнойФормы, ПозицияТочки) <> 46 Цикл // Не точка.
				ПозицияТочки = ПозицияТочки - 1;
			КонецЦикла;
			СуффиксФормыИсточника = ВРег(Сред(ИмяПодчиненнойФормы, ПозицияТочки + 1));
			Если СуффиксФормыИсточника = ВРег("ФормаНастроекОтчета")
				Или СуффиксФормыИсточника = ВРег("ФормаНастроек")
				Или СуффиксФормыИсточника = ВРег("ФормаВариантаОтчета")
				Или СуффиксФормыИсточника = ВРег("ФормаВарианта") Тогда
				Если Результат.Свойство("НастройкиКД") Тогда
					Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Результат.НастройкиКД);
					ПараметрПериод = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
					Если ПараметрПериод = Неопределено Или ТипЗнч(ПараметрПериод.Значение) <> Тип("СтандартныйПериод") Тогда 
						ПараметрПериод = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтПериод");
					КонецЕсли;
					
					Если ПараметрПериод <> Неопределено 
						И ТипЗнч(ПараметрПериод.Значение) = Тип("СтандартныйПериод") Тогда
						Период = ПараметрПериод.Значение;
					КонецЕсли;

					ОбновитьНастройкиНаФорме();
					ОтметитьНеактуальным(); 
				КонецЕсли; 
			КонецЕсли;
		ИначеЕсли ТипЗнч(Результат) = Тип("СправочникСсылка.ВариантыОтчетов") Тогда
			Вариант = Результат;
			Если Элементы.Вариант.СписокВыбора.НайтиПоЗначению(Вариант)=Неопределено Тогда
				// Новый вариант отчета
				Элементы.Вариант.СписокВыбора.Добавить(Вариант);
			КонецЕсли; 
			УстановитьТекущийВариант(Вариант);
			ОтметитьНеактуальным(); 
		КонецЕсли;
	КонецЕсли;
	
	// Механизмы расширения.
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РассылкаОтчетов") Тогда
		МодульРассылкаОтчетовКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РассылкаОтчетовКлиент");
		МодульРассылкаОтчетовКлиент.ФормаОтчетаОбработкаВыбора(ЭтотОбъект, Результат, ПодчиненнаяФорма, РезультатОбработан);
	КонецЕсли;
	ОтчетыКлиентПереопределяемый.ОбработкаВыбора(ЭтотОбъект, Результат, ПодчиненнаяФорма, РезультатОбработан);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОповещениеОбработано = Ложь;
	Если ИмяСобытия = ВариантыОтчетовКлиент.ИмяСобытияИзменениеВарианта() Тогда
		ОбновитьНастройкиНаФорме();
		ОтметитьНеактуальным(); 
		ОповещениеОбработано = Истина;
	КонецЕсли;
	ОтчетыКлиентПереопределяемый.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ОповещениеОбработано);
	
КонецПроцедуры

&НаСервере
// Процедура - При загрузке варианта на сервере
// 
// Параметры:
//  НовыеНастройкиКД - 	 - 
// 
Процедура ПриЗагрузкеВариантаНаСервере(НовыеНастройкиКД)
	
	ОчиститьНастройки();
	
	Если ТипЗнч(КлючТекущегоВарианта)=Тип("СправочникСсылка.ВариантыОтчетов") Тогда
		Вариант = КлючТекущегоВарианта;
		НастройкиОтчета.Вставить("ВариантСсылка", Вариант);
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Вариант, "КлючВарианта, Пользовательский");
		НастройкиОтчета.Вставить("КлючВарианта", ЗначенияРеквизитов.КлючВарианта);
		НастройкиОтчета.Вставить("ИДВариантаДляЗамера", ?(ЗначенияРеквизитов.Пользовательский=Истина, "Пользовательский", НастройкиОтчета.КлючВарианта));
	ИначеЕсли ТипЗнч(КлючТекущегоВарианта)=Тип("Строка") И ТипЗнч(НастройкиОтчета.ОтчетСсылка)=Тип("Строка") Тогда
		// Внешний отчет
		НастройкиОтчета.Вставить("ВариантСсылка", Справочники.ВариантыОтчетов.ПустаяСсылка());
		НастройкиОтчета.Вставить("КлючВарианта", КлючТекущегоВарианта);
		НастройкиОтчета.Вставить("ИДВариантаДляЗамера", НастройкиОтчета.КлючВарианта);
	ИначеЕсли ТипЗнч(КлючТекущегоВарианта)=Тип("Строка") Тогда
		// Дополнительный отчет
		Если Параметры.Свойство("ИдентификаторКоманды") И ЗначениеЗаполнено(Параметры.ИдентификаторКоманды) Тогда
			ДопВариант = ПолучитьСсылку(НастройкиОтчета.ОтчетСсылка, Параметры.ИдентификаторКоманды);
			НастройкиОтчета.Вставить("ВариантСсылка", ДопВариант);
			НастройкиОтчета.Вставить("КлючВарианта", Параметры.ИдентификаторКоманды);
		Иначе
			ДопВариант = ПолучитьСсылку(НастройкиОтчета.ОтчетСсылка, КлючТекущегоВарианта);
			НастройкиОтчета.Вставить("ВариантСсылка", ДопВариант);
			НастройкиОтчета.Вставить("КлючВарианта", КлючТекущегоВарианта);
		КонецЕсли;
		Если ТипЗнч(ДопВариант)=Тип("СправочникСсылка.ВариантыОтчетов") Тогда	
			ЗначениеРеквизитаПользовательский = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДопВариант, "Пользовательский");
			НастройкиОтчета.Вставить("ИДВариантаДляЗамера", ?(ЗначениеРеквизитаПользовательский=Истина, "Пользовательский", НастройкиОтчета.КлючВарианта));
		Иначе
			НастройкиОтчета.Вставить("ИДВариантаДляЗамера", НастройкиОтчета.КлючВарианта);
		КонецЕсли;
		Если ТипЗнч(ДопВариант)=Тип("СправочникСсылка.ВариантыОтчетов") Тогда
			Вариант = ДопВариант;
		КонецЕсли; 
	Иначе
		НастройкиОтчета.Вставить("ВариантСсылка", Справочники.ВариантыОтчетов.ПустаяСсылка());
		НастройкиОтчета.Вставить("КлючВарианта", КлючТекущегоВарианта);
		Если ЗначениеЗаполнено(КлючТекущегоВарианта) Тогда
			НастройкиОтчета.Вставить("ИДВариантаДляЗамера", НастройкиОтчета.КлючВарианта);
		Иначе
			НастройкиОтчета.Вставить("ИДВариантаДляЗамера", "Расшифровка");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиОтчета.ВариантСсылка) Тогда
		НастройкиОтчета.Вставить("ИдентификаторВарианта", Строка(НастройкиОтчета.ВариантСсылка.УникальныйИдентификатор()));
	Иначе
		НастройкиОтчета.Вставить("ИдентификаторВарианта", "");
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Вариант) Тогда
		ОтчетыСервер.ДобавитьОтчетВИсторию(Вариант);
	КонецЕсли; 
	
	НавигационнаяСсылка = НавигационнаяСсылкаВарианта(НастройкиОтчета);
	
	// Ничего не делать если отчет не на СКД и никаких настроек не загружено.
	РежимВариантаОтчета = (ТипЗнч(КлючТекущегоВарианта) = Тип("Строка") И Не ПустаяСтрока(КлючТекущегоВарианта));
	Если РежимВариантаОтчета И НЕ НовыеНастройкиКД = Неопределено Тогда
		
		// Вызов переопределяемого модуля.
		ОтчетыПереопределяемый.ПередЗагрузкойВариантаНаСервере(ЭтотОбъект, НовыеНастройкиКД);
		Если НастройкиОтчета.События.ПередЗагрузкойВариантаНаСервере Тогда
			ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
			Если НастройкиОтчета.События.ПередЗагрузкойВариантаНаСервере Тогда
				ОтчетОбъект.ПередЗагрузкойВариантаНаСервере(ЭтотОбъект, НовыеНастройкиКД);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиОтчета.ВариантСсылка) Тогда
		НастройкиОтчета.Вставить("НаименованиеВарианта", Строка(НастройкиОтчета.ВариантСсылка));
	ИначеЕсли НЕ НовыеНастройкиКД=Неопределено И НовыеНастройкиКД.ДополнительныеСвойства.Свойство("НаименованиеВарианта") Тогда 
		НастройкиОтчета.Вставить("НаименованиеВарианта", ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НовыеНастройкиКД.ДополнительныеСвойства, "НаименованиеВарианта"));
	Иначе
		НастройкиОтчета.Вставить("НаименованиеВарианта", ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства, "НаименованиеВарианта"));
	КонецЕсли;
	ОтчетНаименованиеТекущегоВарианта = НастройкиОтчета.НаименованиеВарианта;
	
	Если НЕ ЗначениеЗаполнено(НастройкиОтчета.НаименованиеВарианта) Тогда
		Схема = ПолучитьИзВременногоХранилища(НастройкиОтчета.АдресСхемы);
		ВариантОтчета = Схема.ВариантыНастроек.Найти(НастройкиОтчета.КлючВарианта);
		Если НЕ ВариантОтчета=Неопределено Тогда
			НастройкиОтчета.Вставить("НаименованиеВарианта", ВариантОтчета.Представление);
		КонецЕсли; 
	КонецЕсли; 

	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Если НЕ НовыеНастройкиКД = Неопределено Тогда
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройкиКД);
	ИначеЕсли ЗначениеЗаполнено(Вариант) И Вариант.Пользовательский Тогда
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Вариант.Настройки.Получить());
	ИначеЕсли ЗначениеЗаполнено(Вариант) Тогда
		Схема = ПолучитьИзВременногоХранилища(НастройкиОтчета.АдресСхемы);
		ВариантОтчета = Схема.ВариантыНастроек.Найти(НастройкиОтчета.КлючВарианта);
		Если ВариантОтчета=Неопределено Тогда
			УстановитьТекущийВариант(Элементы.Вариант.СписокВыбора[0].Значение);
			Возврат;
		КонецЕсли; 
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ВариантОтчета.Настройки);
	КонецЕсли;
	
	Если НЕ НастройкиОтчета.ПользовательскиеНастройки = Неопределено Тогда
		Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(НастройкиОтчета.ПользовательскиеНастройки);
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	КонецЕсли; 
	
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("НаименованиеВарианта", НастройкиОтчета.НаименованиеВарианта);
	
	// Модификация отчета для вывода расшифровок
	УстановитьПараметрыИОтборыРасшифровки(ОтчетОбъект);
	ВыбратьКолонкиРасшифровки();
	
	Если ПравоВывода Тогда
		Уникальность = НастройкиОтчета.ПолноеИмя;
		Если ЗначениеЗаполнено(КлючТекущегоВарианта) Тогда
			Уникальность = Уникальность + "/КлючВарианта." + КлючТекущегоВарианта;
		КонецЕсли;
		КлючСохраненияПоложенияОкна = Уникальность;
		НастройкиОтчета.Печать.Вставить("КлючПараметровПечати", Уникальность);
		НастройкиПечатиВосстановить();
	КонецЕсли;
		
	Если НЕ ПустаяСтрока(НастройкиОтчета.ИдентификаторВарианта) Тогда
		РазвернутьДоИзНастроек = ХранилищеСистемныхНастроек.Загрузить("РазвернутьДо", Строка(НастройкиОтчета.ИдентификаторВарианта));
	Иначе
		РазвернутьДоИзНастроек = Неопределено;
	КонецЕсли; 
	Если РазвернутьДоИзНастроек<>Неопределено Тогда
		РазвернутьДо = РазвернутьДоИзНастроек;
	ИначеЕсли Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Свойство("РазвернутьДо") Тогда
		РазвернутьДо = Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.РазвернутьДо;
	Иначе
		РазвернутьДо = "";
	КонецЕсли; 
	
	УстановитьКассовуюСмену = Истина;
	
	ПараметрСтруктурнаяЕдиница = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтруктурнаяЕдиница");
	Если ПараметрСтруктурнаяЕдиница <> Неопределено Тогда 			
		ПараметрСтруктурнаяЕдиница.Значение      = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
		ПараметрСтруктурнаяЕдиница.Использование = Истина;
	КонецЕсли;
	
	Если КлючОбъекта = "Отчет.ОплатыПоВрачу" И ЗначениеЗаполнено(Врач) Тогда
		
		Для Каждого ТекОтбор Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если Строка(ТекОтбор.ЛевоеЗначение) = "Врач" И Не ЗначениеЗаполнено(ТекОтбор.ПравоеЗначение) Тогда
				ТекОтбор.ПравоеЗначение = Врач;
				ТекОтбор.Использование = Истина;
			КонецЕсли;					
		КонецЦикла;

	КонецЕсли;
	
	Если КлючОбъекта = "Отчет.ОтчетПоВыручке" Тогда
		
		ФлагКасса = Ложь;
		СписокДоступныхКасс = Новый СписокЗначений;
		СписокДоступныхКасс.ЗагрузитьЗначения(Справочники.СтруктурныеЕдиницы.ПолучитьДоступныеКассы(
		ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница, 
		Пользователи.ТекущийПользователь()));
		
		Для Каждого ТекОтбор Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если Строка(ТекОтбор.ЛевоеЗначение) = "Касса" И Не ЗначениеЗаполнено(ТекОтбор.ПравоеЗначение) Тогда
				ТекОтбор.ПравоеЗначение = СписокДоступныхКасс;
				ТекОтбор.Использование = Истина;
				ФлагКасса = Истина;
			КонецЕсли;					
		КонецЦикла;
		
		Если НЕ ФлагКасса Тогда
			НовыйОтбор = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйОтбор.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Касса");
			НовыйОтбор.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
			НовыйОтбор.ПравоеЗначение	= СписокДоступныхКасс;
			НовыйОтбор.Использование	= Истина;
			
			Если СписокДоступныхКасс.Количество() > 0 Тогда
				ВыбраннаяКасса = СписокДоступныхКасс[0].Значение;
				Если ЗначениеЗаполнено(ВыбраннаяКасса) Тогда
					ПараметрКасса = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Касса");
					Если ПараметрКасса <> Неопределено Тогда 
						ПараметрКасса.Значение      = ВыбраннаяКасса;
						ПараметрКасса.Использование = Истина;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;    
		
	КонецЕсли; 

	НастройкиОтчета.Вставить("ЭтоОтчетСтоматология", ОтчетыСервер.ЭтоОтчетСтоматология(Строка(ОтчетОбъект)));
	
	ОбновитьНастройкиНаФорме();
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьНастройки()
	
	Если ФиксированныеНастройки=Неопределено Тогда
		ФиксированныеНастройки = Новый Структура;
		Для Каждого Элемент Из НастройкиОтчета Цикл
			ФиксированныеНастройки.Вставить(Элемент.Ключ);
		КонецЦикла;
		Возврат;
	КонецЕсли; 
	
	ЭлементыКУдалению = Новый Массив;
	Для Каждого Элемент Из НастройкиОтчета Цикл
		Если ФиксированныеНастройки.Свойство(Элемент.Ключ) Тогда
			Продолжить;
		КонецЕсли; 
		ЭлементыКУдалению.Добавить(Элемент.Ключ);
	КонецЦикла; 
	Для Каждого Ключ Из ЭлементыКУдалению Цикл
		НастройкиОтчета.Удалить(Ключ);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не РежимВариантаОтчета Тогда
		Возврат;
	КонецЕсли;
	
	ПользовательскиеНастройкиКД = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки;
	Для Каждого ПользовательскаяНастройкаКД Из ПользовательскиеНастройкиКД.Элементы Цикл
		Тип = ОтчетыКлиентСервер.ТипНастройкиСтрокой(ТипЗнч(ПользовательскаяНастройкаКД));
		
		Если Тип = "ЗначениеПараметраНастроек"
			И ТипЗнч(ПользовательскаяНастройкаКД.Значение) = Тип("СтандартныйПериод")
			И ПользовательскаяНастройкаКД.Использование Тогда
			
			ИдентификаторЭлемента = ОтчетыСервер.ПривестиИдентификаторКИмени(ПользовательскаяНастройкаКД.ИдентификаторПользовательскойНастройки);
			
			ПериодНачало    = Элементы.Найти(Тип + "_Начало_"    + ИдентификаторЭлемента);
			ПериодОкончание = Элементы.Найти(Тип + "_Окончание_" + ИдентификаторЭлемента);
			Если ПериодНачало = Неопределено Или ПериодОкончание = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Значение = ПользовательскаяНастройкаКД.Значение;
			Если ПериодНачало.АвтоОтметкаНезаполненного
				И Не ЗначениеЗаполнено(Значение.ДатаНачала)
				И Не ЗначениеЗаполнено(Значение.ДатаОкончания) Тогда
				ТекстОшибки = НСтр("ru = 'Не указан период'");
				ПутьКДанным = ПериодНачало.ПутьКДанным;
			ИначеЕсли Значение.ДатаНачала > Значение.ДатаОкончания Тогда
				ТекстОшибки = НСтр("ru = 'Конец периода должен быть больше начала'");
				ПутьКДанным = ПериодОкончание.ПутьКДанным;
			Иначе
				Продолжить;
			КонецЕсли;
			
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , ПутьКДанным);
			
		КонецЕсли;
		
	КонецЦикла;

	Если КлючОбъекта = "Отчет.ОтчетПоВыручкеКассовойСмены" Тогда
			
		ПользовательскаяНастройка = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КассоваяСмена");
		Если ПользовательскаяНастройка <> Неопределено Тогда
			
			ПараметрКассоваяСмена = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПользовательскаяНастройка.ИдентификаторПользовательскойНастройки);			
			Если ПараметрКассоваяСмена <> Неопределено Тогда
				
				ВыбраннаяКасса = Неопределено;
				ПараметрКасса = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Касса");
				Если ПараметрКасса <> Неопределено Тогда 
					ВыбраннаяКасса              = Справочники.Сотрудники.ПолучитьОсновнуюКассуДляСотрудника(ПараметрыСеанса.ТекущийПользователь);
					ПараметрКасса.Значение      = ВыбраннаяКасса;
					ПараметрКасса.Использование = Истина;
				КонецЕсли;
				
				КассоваяСмена = ПараметрКассоваяСмена.Значение;
				Если Не ЗначениеЗаполнено(КассоваяСмена) 
					Или Не КассоваяСменаСоответствуетВыбраннойКассе(КассоваяСмена, ВыбраннаяКасса) Тогда					
					КассоваяСмена = ПолучитьПоследнююКассовуюСмену(ВыбраннаяКасса);					
					ПользовательскаяНастройка.Значение = КассоваяСмена;				
				КонецЕсли;
				
				Если ЗначениеЗаполнено(КассоваяСмена) Тогда
					ОбновитьПериодОтчета("ИзКассовойСмены", КассоваяСмена);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перед закрытием
//
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
// Процедура - При закрытии
//
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ФоновоеЗаданиеИдентификатор <> Неопределено И НЕ ЗавершениеРаботы Тогда
		ФоновоеЗаданиеОтменить(ФоновоеЗаданиеИдентификатор);
		ФоновоеЗаданиеИдентификатор = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область Период

&НаКлиенте
Процедура ПредставлениеПериодаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрПериод = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтПериод");
	Если ПараметрПериод=Неопределено Тогда
		ПараметрПериод = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	КонецЕсли; 
	Если ПараметрПериод=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ПредставлениеПериодаНажатиеЗавершение", ЭтотОбъект);
	Если НастройкиОтчета.РежимПериода = ОтчетыКлиентСервер.РежимПериодаЗаПериод() Тогда
		Диалог = Новый ДиалогРедактированияСтандартногоПериода;
		Диалог.Период = Период;
		Диалог.Показать(Оповещение);
	ИначеЕсли НастройкиОтчета.РежимПериода = ОтчетыКлиентСервер.РежимПериодаНаДату() Тогда
		ПоказатьВводДаты(Оповещение, Период.ДатаОкончания, НСтр("ru = 'На дату'"), ЧастиДаты.Дата);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНажатиеЗавершение(НовыйПериод, ДополнительныеДанные) Экспорт
	
	Если НовыйПериод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(НовыйПериод) = Тип("СтандартныйПериод") Тогда
		Если НовыйПериод.ДатаНачала > НовыйПериод.ДатаОкончания Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Дата начала периода больше даты окончания'"));
			Возврат;
		КонецЕсли; 
		Период = НовыйПериод;
	ИначеЕсли ТипЗнч(НовыйПериод) = Тип("Дата") Тогда
		Период.ДатаНачала = '0001-01-01';
		Период.ДатаОкончания = НовыйПериод;
		Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	КонецЕсли; 
	
	Если КлючОбъекта = "Отчет.ОтчетПоВыручке"  Тогда
		
		Если ТипЗнч(НовыйПериод) = Тип("Дата") Тогда
			
			Период.ДатаНачала		= НачалоДня(НовыйПериод);
			Период.ДатаОкончания	= КонецДня(НовыйПериод);
			Период.Вариант			= ВариантСтандартногоПериода.ПроизвольныйПериод;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПериодПриИзмененииСервер();
	ОтметитьНеактуальным();
	
КонецПроцедуры

#КонецОбласти 

#Область СтрокаПоиска

&НаКлиенте
Процедура СтрокаОтбораАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ВРег(Текст)="СКД"
		ИЛИ ВРег(Текст)="IDDQD"
		ИЛИ ВРег(Текст)="GODMODE"
		ИЛИ ВРег(Текст)="GOD MODE" Тогда
		Возврат;
	КонецЕсли;
	
	ТекстДляПоиска = СокрЛП(Текст);
	ОдинСимвол = Лев(Текст, 1);
	ДваСимвола = Лев(Текст, 2);
	Если ДваСимвола=">=" ИЛИ ДваСимвола="<=" ИЛИ ДваСимвола="<>" Тогда
		ТекстДляПоиска = Сред(ТекстДляПоиска, 3);
		УправляющиеСимволы = ДваСимвола;
	ИначеЕсли ОдинСимвол="-" ИЛИ ОдинСимвол=">" ИЛИ ОдинСимвол="<" ИЛИ ОдинСимвол="=" Тогда
		ТекстДляПоиска = Сред(ТекстДляПоиска, 2);
		УправляющиеСимволы = ОдинСимвол;
	ИначеЕсли ОдинСимвол="""" Тогда
		Если Прав(Текст, 1)="""" Тогда
			ТекстДляПоиска = Сред(ТекстДляПоиска, 2, СтрДлина(ТекстДляПоиска)-2);
		Иначе
			ТекстДляПоиска = Сред(ТекстДляПоиска, 2);
		КонецЕсли; 
		УправляющиеСимволы = ОдинСимвол;
	КонецЕсли;
	
	Если УправляющиеСимволы="-" Тогда
		Элемент.ЦветТекста = WebЦвета.Красный;
	ИначеЕсли УправляющиеСимволы="""" Тогда
		Элемент.ЦветТекста = WebЦвета.Зеленый;
	ИначеЕсли Не ПустаяСтрока(УправляющиеСимволы) Тогда
		Элемент.ЦветТекста = WebЦвета.Синий;
	Иначе
		Элемент.ЦветТекста = Новый Цвет;
	КонецЕсли; 
	
	СписокВыбора = СформироватьСписокЭлементов(ТекстДляПоиска, УправляющиеСимволы);
	Если СписокВыбора.Количество()=0 И СтрДлина(Текст)>2 Тогда
		СписокВыбора.Добавить("", Новый ФорматированнаяСтрока(НСтр("ru = 'Совпадений не найдено'"),, WebЦвета.НейтральноСерый));
	КонецЕсли; 
	
	Если СписокВыбора.Количество()>0 Тогда
		ДанныеВыбора = СписокВыбора;
		СтандартнаяОбработка = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаОтбораОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ТипЗнч(ВыбранноеЗначение)=Тип("Структура") Тогда
		ОчиститьСтрокуОтбора();
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение.ВведенноеЗначение)=Тип("Число") Тогда
		Если Не ЗначениеЗаполнено(ВыбранноеЗначение.УправляющиеСимволы) Тогда
			ПоказатьУточняющееПодменюСтрокиОтбора(ВыбранноеЗначение, ">,<,>=,<=");
		Иначе
			ОбработатьВыборСтрокаОтбора(ВыбранноеЗначение);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение.ВведенноеЗначение)=Тип("Дата") Тогда
		Если Не ЗначениеЗаполнено(ВыбранноеЗначение.УправляющиеСимволы) Тогда
			ПоказатьУточняющееПодменюСтрокиОтбора(ВыбранноеЗначение, ">=,<=");
		Иначе
			ОбработатьВыборСтрокаОтбора(ВыбранноеЗначение);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение.ВведенноеЗначение)=Тип("Строка") 
		И ВыбранноеЗначение.Свойство("ИмяМетаданных") Тогда
		ТипЗначения = Тип(СтрЗаменить(ВыбранноеЗначение.ИмяМетаданных, ".", "Ссылка."));
		Поля = ПоляПоТипу(ТипЗначения);
		Если Поля.Количество()=1 Тогда
			ВыбранноеЗначение.Вставить("Поле", Поля[0]);
			ОбработатьВыборСтрокаОтбора(ВыбранноеЗначение);
		Иначе
			ПоказатьУточняющееПодменюСтрокиОтбора(ВыбранноеЗначение, Поля);
		КонецЕсли; 
	Иначе
		Поля = ПоляПоТипу(ТипЗнч(ВыбранноеЗначение.ВведенноеЗначение));
		Если Поля.Количество()=1 Тогда
			ВыбранноеЗначение.Вставить("Поле", Поля[0]);
			ОбработатьВыборСтрокаОтбора(ВыбранноеЗначение);
		Иначе
			ПоказатьУточняющееПодменюСтрокиОтбора(ВыбранноеЗначение, Поля);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьУточняющееПодменюСтрокиОтбора(ВыбранноеЗначение, Варианты)
	
	Подменю = Новый СписокЗначений;
	Если ВыбранноеЗначение.Свойство("Поле") Тогда
		// Выбор варианта сравнения
		ВариантыСравнения = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Варианты);
		Для Каждого ВариантСравнения Из ВариантыСравнения Цикл
			СтруктураЗначения = Новый Структура;
			Для Каждого КлючИЗначение Из ВыбранноеЗначение Цикл
				СтруктураЗначения.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЦикла;
			СтруктураЗначения.Вставить("УправляющиеСимволы", ВариантСравнения);
			Подменю.Добавить(СтруктураЗначения, ВыбранноеЗначение.Поле+" "+ВариантСравнения+" "+ВыбранноеЗначение.ВведенноеЗначение); 
		КонецЦикла;
	ИначеЕсли Не ВыбранноеЗначение.Свойство("ИмяМетаданных") Тогда
		// Выбор поля отбора
		Поля = Варианты;
		Для Каждого Поле Из Поля Цикл
			СтруктураЗначения = Новый Структура;
			Для Каждого КлючИЗначение Из ВыбранноеЗначение Цикл
				СтруктураЗначения.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЦикла;
			СтруктураЗначения.Вставить("Поле", Поле);
			Подменю.Добавить(СтруктураЗначения, Поле+" = "+ВыбранноеЗначение.ВведенноеЗначение); 
		КонецЦикла;
	Иначе
		// Выбор поля отбора из вложенных реквизитов
		Поля = Варианты;
		Для Каждого Поле Из Поля Цикл
			СтруктураЗначения = Новый Структура;
			Для Каждого КлючИЗначение Из ВыбранноеЗначение Цикл
				СтруктураЗначения.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЦикла;
			СтруктураЗначения.Вставить("Поле", Поле);
			Подменю.Добавить(СтруктураЗначения, Поле+" содержит "+ВыбранноеЗначение.ВведенноеЗначение); 
		КонецЦикла;
		
	КонецЕсли; 
	Описание = Новый ОписаниеОповещения("СтрокаОтбораВыборИзПодменю", ЭтотОбъект);
	ПоказатьВыборИзМеню(Описание, Подменю, Элементы.СтрокаОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаОтбораВыборИзПодменю(ВыбранноеЗначение, ДополнительныеДанные) Экспорт
	
	Если ВыбранноеЗначение=Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОбработатьВыборСтрокаОтбора(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборСтрокаОтбора(СтруктураПараметров)
	
	Если ТипЗнч(СтруктураПараметров)=Тип("ЭлементСпискаЗначений") Тогда
		СтруктураПараметров = СтруктураПараметров.Значение;
	КонецЕсли; 
	
	Значение = СтруктураПараметров.ВведенноеЗначение;
	
	Если СтруктураПараметров.Свойство("Поле") И Найти(СтруктураПараметров.Поле, "ДобавленноеПоле_")>0 Тогда
		НаложитьОтборПоДобавленномуПолю(СтруктураПараметров.Поле, Значение, СтруктураПараметров.УправляющиеСимволы);
	ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
		Если СтруктураПараметров.УправляющиеСимволы="-" Тогда
			Значение = -Значение;
		КонецЕсли;
		ВидСравненияФильтра = ВидСравненияИзСтроки(СтруктураПараметров.УправляющиеСимволы);
		Если ВидСравненияФильтра=ВидСравненияКомпоновкиДанных.Больше ИЛИ ВидСравненияФильтра=ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
			Значение = Новый Структура("ЗначениеОт, ЗначениеДо, ВключаяГраницы", Значение,, (ВидСравненияФильтра=ВидСравненияКомпоновкиДанных.БольшеИлиРавно));
		ИначеЕсли ВидСравненияФильтра=ВидСравненияКомпоновкиДанных.Меньше ИЛИ ВидСравненияФильтра=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
			Значение = Новый Структура("ЗначениеОт, ЗначениеДо, ВключаяГраницы",, Значение, (ВидСравненияФильтра=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно));
		КонецЕсли; 
		УстановитьЗначениеФильтра(
		СтруктураПараметров.Поле, 
		Значение, 
		ВидСравненияФильтра);
	ИначеЕсли ТипЗнч(Значение)=Тип("Дата") Тогда
		ВидСравненияФильтра = ВидСравненияИзСтроки(СтруктураПараметров.УправляющиеСимволы);
		Если ВидСравненияФильтра=ВидСравненияКомпоновкиДанных.Больше ИЛИ ВидСравненияФильтра=ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
			Значение = Новый СтандартныйПериод(Значение, '0001-01-01');
		ИначеЕсли ВидСравненияФильтра=ВидСравненияКомпоновкиДанных.Меньше ИЛИ ВидСравненияФильтра=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
			Значение = Новый СтандартныйПериод('0001-01-01', Значение);
		КонецЕсли; 
		УстановитьЗначениеФильтра(
		СтруктураПараметров.Поле, 
		Значение, 
		ВидСравненияФильтра);
	ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
		Реквизиты = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтруктураПараметров.Реквизиты);
		ДобавитьГруппуФильтров(
		СтруктураПараметров.Поле,
		Реквизиты, 
		Значение, 
		ВидСравненияКомпоновкиДанных.Содержит);
	Иначе
		Если СтруктураПараметров.Свойство("Поле") Тогда
			Поле = СтруктураПараметров.Поле;
		Иначе
			Поля = ПоляПоТипу(ТипЗнч(Значение));
			Поле = Поля[0];
		КонецЕсли;
		
		Если Найти(Поле, "ДобавленноеПоле_")>0 Тогда
			НаложитьОтборПоДобавленномуПолю(СтруктураПараметров.Поле, Значение, СтруктураПараметров.УправляющиеСимволы);
		Иначе
			Список = Новый СписокЗначений;
			Список.Добавить(Значение);
			УстановитьЗначениеФильтра(
			Поле, 
			Список, 
			?(СтруктураПараметров.УправляющиеСимволы="-",
			ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии,
			ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии));
		КонецЕсли; 
		
	КонецЕсли;
	
	ОчиститьСтрокуОтбора();
	ОтметитьНеактуальным();
	
КонецПроцедуры

&НаКлиенте
Функция ВидСравненияИзСтроки(Строка)
	
	Если Строка=">" Тогда
		Возврат ВидСравненияКомпоновкиДанных.Больше;
	ИначеЕсли Строка=">=" Тогда
		Возврат ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ИначеЕсли Строка="<" Тогда
		Возврат ВидСравненияКомпоновкиДанных.Меньше;
	ИначеЕсли Строка="<=" Тогда
		Возврат ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ИначеЕсли Строка="<>" Тогда
		Возврат ВидСравненияКомпоновкиДанных.НеРавно;
	Иначе
		Возврат ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Процедура СтрокаОтбораПриИзменении(Элемент)
	
	Если ВРег(СтрокаОтбора)="СКД"
		ИЛИ ВРег(СтрокаОтбора)="IDDQD"
		ИЛИ ВРег(СтрокаОтбора)="GODMODE"
		ИЛИ ВРег(СтрокаОтбора)="GOD MODE" Тогда
		ОчиститьСтрокуОтбора();
		РедактироватьСКД();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаОтбораРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РедактироватьСКД();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСтрокуОтбора()
	
	СтрокаОтбора = "";
	Элементы.СтрокаОтбора.ОбновитьТекстРедактирования();
	
КонецПроцедуры

#КонецОбласти

#Область ТабличныйДокумент

&НаКлиенте
Процедура ОтчетТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Данные = ПолучитьДанныеРасшифровки(Расшифровка);
	Если Данные=Неопределено ИЛИ НЕ Данные.Ресурс Тогда
		Возврат;
	КонецЕсли;
	ВыполнитьНестандартнуюРасшифровку(Расшифровка, Данные, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетТабличныйДокументОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ОтчетДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(НастройкиОтчета.АдресСхемы));
	Данные = ПолучитьДанныеРасшифровки(Расшифровка);
	Если Данные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Поле) Тогда
		ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных(Данные.Поле));
	КонецЕсли; 
	Если Данные.Значение=Неопределено И ЗначениеЗаполнено(Данные.Поле) Тогда
		Если НЕ ДоступноеПоле=Неопределено И ДоступноеПоле.Ресурс Тогда
			// Значение ресурса берем из табличного документа
			Для каждого Область Из ОтчетТабличныйДокумент.ВыделенныеОбласти Цикл
				Если НЕ ТипЗнч(Область)=Тип("ОбластьЯчеекТабличногоДокумента") Тогда
					Продолжить;
				КонецЕсли; 
				Представление = СтрЗаменить(Область.Текст, Символы.НПП, "");
				Если НЕ ПустаяСтрока(Представление) Тогда
					ДробныйРазделитель = НСтр("ru = ','");
					ТестДляПроверки = СтрЗаменить(Представление, ДробныйРазделитель, "");
					Если СтрЧислоВхождений(Представление, ДробныйРазделитель)<=1 И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ТестДляПроверки) Тогда
						Данные.Значение = Число(СтрЗаменить(Представление, " ", ""));
					КонецЕсли;             
				КонецЕсли; 
				Прервать;
			КонецЦикла; 
		КонецЕсли; 
	КонецЕсли; 
    
    ДоступныеДействия = Новый Массив;
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать);
	ДополнительныеДействия = Новый СписокЗначений;
	Если Данные.ЭтоСсылка Тогда
	    ДополнительныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение, НСтр("ru = 'Открыть'"));
	КонецЕсли; 
	Если ЗначениеЗаполнено(Данные.Поле) И НЕ ДоступноеПоле=Неопределено И НЕ ДоступноеПоле.Ресурс Тогда
		ДополнительныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать, НСтр("ru = 'Отфильтровать ""'")+Данные.Поле+" = "+Данные.Значение+"""");
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.Поле) И НЕ ДоступноеПоле=Неопределено И ДоступноеПоле.ТипЗначения.Типы().Количество()>0 Тогда
		ДополнительныеДействия.Добавить(СформироватьПодменюОформить(Данные.Поле, Данные.Значение), НСтр("ru = 'Оформить'"));
		ПодменюСортировка = Новый СписокЗначений;
		ПодменюСортировка.Добавить(НаправлениеСортировкиКомпоновкиДанных.Возр, Данные.Поле+НСтр("ru = ' по возрастанию'"),, БиблиотекаКартинок.СортироватьСписокПоВозрастанию); 
		ПодменюСортировка.Добавить(НаправлениеСортировкиКомпоновкиДанных.Убыв, Данные.Поле+НСтр("ru = ' по убыванию'"),, БиблиотекаКартинок.СортироватьСписокПоУбыванию); 
	    ДополнительныеДействия.Добавить(ПодменюСортировка, НСтр("ru = 'Сортировать'"));
	КонецЕсли;
	Если ДополнительныеДействия.Количество()=0 Тогда
		Возврат;
	КонецЕсли; 
	
	ДополнительныеПараметры = Новый Структура("Данные, Расшифровка, ОбработкаРасшифровки", Данные, Расшифровка, ОбработкаРасшифровки);
	Оповещение = Новый ОписаниеОповещения("ВыполнитьРасшифровку", ЭтотОбъект, ДополнительныеПараметры);
	ОбработкаРасшифровки.ПоказатьВыборДействия(Оповещение, Расшифровка, ДоступныеДействия, ДополнительныеДействия);
	
КонецПроцедуры

&НаСервере
Функция СформироватьПодменюОформить(Поле, Значение)
	
	ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных(Поле));
	Если ДоступноеПоле=Неопределено Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли; 
	ТипЗначения = ДоступноеПоле.ТипЗначения;
	СписокКоманд = Новый СписокЗначений;
	
	// Определенные разработчиком варианты оформления
	Если НастройкиОтчета.Свойство("ВариантыОформления") Тогда
		ВариантыОформления = НастройкиОтчета.ВариантыОформления.Получить(Поле);
		Если НЕ ВариантыОформления=Неопределено Тогда
			Для каждого ОписаниеОформления Из ВариантыОформления Цикл
				СписокКоманд.Добавить(ОписаниеОформления.Значение, ОписаниеОформления.Ключ);
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли; 
	
	// Пользовательские варианты оформления
	Для каждого Тип Из ТипЗначения.Типы() Цикл
		ТекСписок = ХранилищеСистемныхНастроек.Загрузить("БыстрыеНастройкиОформленияОтчетов", Строка(Тип));
		Если ТипЗнч(ТекСписок)=Тип("СписокЗначений") Тогда
			Для каждого Элемент Из ТекСписок Цикл
				СписокКоманд.Добавить(Элемент.Значение, Элемент.Представление);
			КонецЦикла; 
		КонецЕсли;
	КонецЦикла; 
	
	// Стандартные команды настройки оформления
	СписокКоманд.Добавить(
	"СписокБыстрыхНастроекОформления", 
	НСтр("ru = 'Редактировать список быстрых настроек'"),, 
	БиблиотекаКартинок.УсловноеОформлениеКомпоновкиДанных);
	СписокКоманд.Добавить(
	"РучнаяНастройкаОформления", 
	НСтр("ru = 'Ручная настройка оформления'"),, 
	БиблиотекаКартинок.ТабличныйДокументТолькоПросмотр);
	
	Возврат СписокКоманд;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеРасшифровки(Расшифровка)
	
	Если Не ТипЗнч(Расшифровка)=Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
		Возврат Неопределено;
	КонецЕсли; 
	Данные = ПолучитьИзВременногоХранилища(ОтчетДанныеРасшифровки);
	ЭлементРасшифровки = Данные.Элементы.Получить(Расшифровка);
	СтруктураВозврата = Новый Структура("Тип", ?(ТипЗнч(ЭлементРасшифровки)=Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка"), ТипГруппировка(), ТипРеквизит()));
	СтруктураВозврата.Вставить("Настройки", Данные.Настройки);
	СтруктураВозврата.Вставить("Отбор", ПолучитьОтборРекурсивно(ЭлементРасшифровки));
	Поля = ЭлементРасшифровки.ПолучитьПоля();
	Если Поля.Количество()=0 Тогда
		СтруктураВозврата.Вставить("Значение", Неопределено);
		СтруктураВозврата.Вставить("Поле", "");
	Иначе 
		СтруктураВозврата.Вставить("Значение", ?(Поля[0].Значение=Null, Неопределено, Поля[0].Значение));
		СтруктураВозврата.Вставить("Поле", Поля[0].Поле);
	КонецЕсли;
	СтруктураВозврата.Вставить("ЭтоСсылка", ОбщегоНазначения.ЭтоСсылка(ТипЗнч(СтруктураВозврата.Значение)));
	Если ЗначениеЗаполнено(СтруктураВозврата.Поле) Тогда
		ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных(СтруктураВозврата.Поле));
		Если ДоступноеПоле=Неопределено Тогда
			СтруктураВозврата.Вставить("ТипЗначения", Тип("Неопределено"));
			СтруктураВозврата.Вставить("Ресурс", Ложь);
		Иначе
			СтруктураВозврата.Вставить("ТипЗначения", ДоступноеПоле.ТипЗначения);
			СтруктураВозврата.Вставить("Ресурс", ДоступноеПоле.Ресурс);
		КонецЕсли; 
	Иначе
		СтруктураВозврата.Вставить("ТипЗначения", Тип("Неопределено"));
		СтруктураВозврата.Вставить("Ресурс", Ложь);
	КонецЕсли; 
	Возврат СтруктураВозврата;
   
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОтборРекурсивно(ЭлементРасшифровки, Результат = Неопределено)
	
	Если Результат=Неопределено Тогда
		Результат = Новый Соответствие;
	КонецЕсли; 
	Если ТипЗнч(ЭлементРасшифровки)=Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
		Поля = ЭлементРасшифровки.ПолучитьПоля();
		Для каждого Поле Из Поля Цикл
			Если Поле.Значение=Null Тогда
				Продолжить;
			КонецЕсли;
			Результат.Вставить(Поле.Поле, Поле.Значение);
		КонецЦикла; 
	КонецЕсли;
	Родители = ЭлементРасшифровки.ПолучитьРодителей();
	Для каждого Родитель Из Родители Цикл
		ПолучитьОтборРекурсивно(Родитель, Результат);
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьРасшифровку(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт
	
	Данные = ДополнительныеПараметры.Данные;
	Расшифровка = ДополнительныеПараметры.Расшифровка;
	
	Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда
		УстановитьЗначениеФильтра(Данные.Поле, Данные.Значение, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		ОтметитьНеактуальным();
	ИначеЕсли ВыполненноеДействие=ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
		ПоказатьЗначение(, Данные.Значение);
	ИначеЕсли ТипЗнч(ВыполненноеДействие)=Тип("НаправлениеСортировкиКомпоновкиДанных") Тогда
		ДобавитьСортировку(Данные.Поле, ВыполненноеДействие);
	ИначеЕсли ТипЗнч(ВыполненноеДействие)=Тип("Соответствие") 
		ИЛИ ТипЗнч(ВыполненноеДействие)=Тип("ФиксированноеСоответствие")
		ИЛИ ТипЗнч(ВыполненноеДействие)=Тип("Структура") Тогда
		ДобавитьОформление(Данные.Поле, ВыполненноеДействие);
	ИначеЕсли ВыполненноеДействие="РучнаяНастройкаОформления" Тогда
		СтруктураОткрытия = Новый Структура;
		СтруктураОткрытия.Вставить("АдресСхемы", НастройкиОтчета.АдресСхемы);
		СтруктураОткрытия.Вставить("АдресНастроек", ПоместитьВоВременноеХранилище(Отчет.КомпоновщикНастроек.Настройки, УникальныйИдентификатор));
		СтруктураОткрытия.Вставить("Поле", Данные.Поле);
		СтруктураОткрытия.Вставить("ТипЗначения", Данные.ТипЗначения);
		СтруктураОткрытия.Вставить("Значение", Данные.Значение);
		Оповещение = Новый ОписаниеОповещения("РучноеОформление", ЭтотОбъект, СтруктураОткрытия);
		ОткрытьФорму("ОбщаяФорма.ФормаОформления", СтруктураОткрытия, ЭтаФорма,,,, Оповещение);
	ИначеЕсли ВыполненноеДействие="СписокБыстрыхНастроекОформления" Тогда
		СтруктураОткрытия = Новый Структура;
		СтруктураОткрытия.Вставить("ТипЗначения", Данные.ТипЗначения);
		ОткрытьФорму("ОбщаяФорма.ФормаБыстрыхНастроекОформления", СтруктураОткрытия, ЭтаФорма);
	ИначеЕсли ВыполненноеДействие=ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать Тогда
		ДополнительныеПараметры.Вставить("НастройкиКД", ПараметрВыполненногоДействия);
		НастройкиОткрытия = ДополнительныеПараметры;
		ПодключитьОбработчикОжидания("ОткрытьФормуОтчета", 0.1, Истина);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтчета()
	
	Данные = НастройкиОткрытия.Данные;
	Расшифровка = НастройкиОткрытия.Расшифровка;
	СтандартнаяОбработка = Истина;
	ВыполнитьНестандартнуюРасшифровку(Расшифровка, Данные, СтандартнаяОбработка);
	Если СтандартнаяОбработка Тогда
		Расшифровка = Новый ОписаниеОбработкиРасшифровкиКомпоновкиДанных(ОтчетДанныеРасшифровки, НастройкиОткрытия.Расшифровка, НастройкиОткрытия.НастройкиКД); 
		СтруктураОткрытия = Новый Структура;
		СтруктураОткрытия.Вставить("Расшифровка", Расшифровка);
		СтруктураОткрытия.Вставить("СформироватьПриОткрытии", Истина);
		СтруктураОткрытия.Вставить("ПредставлениеВарианта", Строка(НастройкиОтчета.НаименованиеВарианта)+НСтр("ru = ' (Расшифровка)'"));
		ОткрытьФорму(НастройкиОтчета.ПолноеИмя+".Форма", СтруктураОткрытия,, Истина, Неопределено);
	КонецЕсли;
	НастройкиОткрытия = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНестандартнуюРасшифровку(Расшифровка, Данные, СтандартнаяОбработка = Истина)
	
	Если СтандартнаяОбработка Тогда
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Поле", Данные.Поле);
		Строки = НайтиВМассиве(НастройкиОтчета.ВариантыРасшифровки, СтруктураОтбора);
		СтруктураОтбора.Вставить("Поле", "");
		СтрокиОбщие = НайтиВМассиве(НастройкиОтчета.ВариантыРасшифровки, СтруктураОтбора);
		Для каждого Стр Из СтрокиОбщие Цикл
			Строки.Добавить(Стр);
		КонецЦикла; 
		Если Строки.Количество()=1 Тогда
			СтандартнаяОбработка = Ложь;
			ОткрытьОтчетРасшифровку(Расшифровка, Данные, Строки[0]);
		ИначеЕсли Строки.Количество()>1 Тогда
			СтандартнаяОбработка = Ложь;
			СписокВыбора = Новый СписокЗначений;
			Для каждого Стр Из Строки Цикл
				Если НЕ ПустаяСтрока(Стр.Заголовок) Тогда
					ЗаголовокПункта = Стр.Заголовок;
				ИначеЕсли ЗначениеЗаполнено(Стр.Вариант) Тогда
					ЗаголовокПункта = Строка(Стр.Вариант);
				Иначе
					ЗаголовокПункта = Строка(Вариант);
				КонецЕсли; 
				СписокВыбора.Добавить(Стр, ЗаголовокПункта);
			КонецЦикла;
			ДополнительныеДанные = Новый Структура;
			ДополнительныеДанные.Вставить("Данные", Данные);
			ДополнительныеДанные.Вставить("Расшифровка", Расшифровка);
			Оповещение = Новый ОписаниеОповещения("ВыполнитьНестандартнуюРасшифровкуЗавершение", ЭтотОбъект, ДополнительныеДанные);  
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНестандартнуюРасшифровкуЗавершение(Стр, ДополнительныеДанные) Экспорт
	
	Если Стр=Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОткрытьОтчетРасшифровку(ДополнительныеДанные.Расшифровка, ДополнительныеДанные.Данные, Стр);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетРасшифровку(Расшифровка, Данные, Стр)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыОткрытия.Вставить("Расшифровка", Истина);
	ПараметрыОткрытия.Вставить("ОтборРасшифровки", Данные.Отбор);
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтаФорма, Стр.Вариант, ПараметрыОткрытия);
	
КонецПроцедуры
 
&НаКлиенте
Процедура ДобавитьОформление(Поле, Оформление)
	
	ОтчетыКлиентСервер.ДобавитьУсловноеОформление(Отчет.КомпоновщикНастроек.Настройки, Поле, Оформление);
	ОтметитьНеактуальным();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСортировку(Поле, Направление)
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(Поле);
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	КУдалению = Новый Массив;
	Для каждого ЭлементСортировки Из Настройки.Порядок.Элементы Цикл
		Если ТипЗнч(ЭлементСортировки)=Тип("АвтоЭлементПорядкаКомпоновкиДанных") Тогда
			КУдалению.Добавить(ЭлементСортировки);
			Продолжить;
		КонецЕсли; 
		Если ЭлементСортировки.Поле=ПолеКомпоновки Тогда
			КУдалению.Добавить(ЭлементСортировки);
		КонецЕсли; 
	КонецЦикла; 
	Для каждого ЭлементСортировки Из КУдалению Цикл
		Настройки.Порядок.Элементы.Удалить(ЭлементСортировки);
	КонецЦикла;
	ЭлементСортировки = Настройки.Порядок.Элементы.Вставить(0, Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементСортировки.Использование = Истина;
	ЭлементСортировки.Поле = ПолеКомпоновки;
	ЭлементСортировки.ТипУпорядочивания = Направление;
	Настройки.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("СортироватьПоПоказателям", Ложь); 
	ОтметитьНеактуальным();
	
КонецПроцедуры

&НаКлиенте
Процедура РучноеОформление(АдресНастроек, ДополнительныеПараметры) Экспорт
	
	Если АдресНастроек=Неопределено ИЛИ НЕ ЭтоАдресВременногоХранилища(АдресНастроек) Тогда
		Возврат;
	КонецЕсли; 
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ПолучитьИзВременногоХранилища(АдресНастроек));
	ОтметитьНеактуальным();
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОтчетТабличныйДокументПриАктивизацииОбласти(Элемент)
	
	ПодключитьОбработчикОжидания("РассчитатьСуммуЯчеек", 0.2, Истина);
	
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура ВариантПриИзменении(Элемент)
	
	НастройкиОтчета.Вставить("ПользовательскиеНастройки", Неопределено);
	УстановитьТекущийВариант(Вариант);
	ОтметитьНеактуальным(); 
	
КонецПроцедуры

#Область Диаграммы

&НаКлиенте
Процедура ВидДиаграммыОчистка(Элемент, СтандартнаяОбработка)
	
	ВидДиаграммы = Неопределено;
	ПриИзмененииВидаДиаграммы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДиаграммыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПодключитьОбработчикОжидания("ВидДиаграммыНачалоВыбораЗадержка", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДиаграммыНачалоВыбораЗадержка()
	
	Меню = Новый СписокЗначений;
	Меню.Добавить(Неопределено, НСтр("ru = 'Не выводить'"),, БиблиотекаКартинок.Пустая);
	Меню.Добавить(ТипДиаграммы.График, НСтр("ru = 'Графики'"),, КартинкаДиаграммы(ТипДиаграммы.График));
	Меню.Добавить(ТипДиаграммы.Гистограмма, НСтр("ru = 'Обычные гистограммы'"),, КартинкаДиаграммы(ТипДиаграммы.Гистограмма));
	Меню.Добавить(ТипДиаграммы.ГистограммаГоризонтальная, НСтр("ru = 'Горизонт. гистограммы'"),, КартинкаДиаграммы(ТипДиаграммы.ГистограммаГоризонтальная));
	Меню.Добавить(ТипДиаграммы.Круговая, НСтр("ru = 'Круговые диаграммы'"),, КартинкаДиаграммы(ТипДиаграммы.Круговая));
	Меню.Добавить(ТипДиаграммы.Изометрическая, НСтр("ru = 'Изометрические диаграммы'"),, КартинкаДиаграммы(ТипДиаграммы.Изометрическая));
	Меню.Добавить("<Прочие>", НСтр("ru = 'Прочие'"),, КартинкаДиаграммы(ТипДиаграммы.Поверхность));
	Оповещение = Новый ОписаниеОповещения("ВидДиаграммыВыборГруппы", ЭтотОбъект);
	#Если ВебКлиент Тогда
		ПоказатьВыборИзМеню(Оповещение, Меню, Элементы.ВидДиаграммы);
	#Иначе
		ПоказатьВыборИзСписка(Оповещение, Меню, Элементы.ВидДиаграммы);
	#КонецЕсли 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДиаграммыВыборГруппы(Значение, ДополнительныеДанные) Экспорт
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Меню = Новый СписокЗначений;
	Если Значение.Значение = ТипДиаграммы.График Тогда
		Меню.Добавить(ТипДиаграммы.График, НСтр("ru = 'Обычный'"));
		Меню.Добавить(ТипДиаграммы.ГрафикПоШагам, НСтр("ru = 'По шагам'"));
		Меню.Добавить(ТипДиаграммы.ГрафикСНакоплением, НСтр("ru = 'С накоплением'"));
		Меню.Добавить(ТипДиаграммы.ГрафикСОбластями, НСтр("ru = 'С областями'"));
		Меню.Добавить(ТипДиаграммы.ГрафикСОбластямиИНакоплением, НСтр("ru = 'С областями и накоплением'"));
		Меню.Добавить(ТипДиаграммы.ГрафикСОбластямиНормированный, НСтр("ru = 'Нормированный'"));
	ИначеЕсли Значение.Значение = ТипДиаграммы.Гистограмма Тогда
		Меню.Добавить(ТипДиаграммы.Гистограмма, НСтр("ru = 'Обычная'"));
		Меню.Добавить(ТипДиаграммы.ГистограммаСНакоплением, НСтр("ru = 'С накоплением'"));
		Меню.Добавить(ТипДиаграммы.ГистограммаНормированная, НСтр("ru = 'Нормированная'"));
		Меню.Добавить(ТипДиаграммы.ГистограммаОбъемная, НСтр("ru = 'Объемная'"));
		Меню.Добавить(ТипДиаграммы.ГистограммаСНакоплениемОбъемная, НСтр("ru = 'Объемная с накоплением'"));
		Меню.Добавить(ТипДиаграммы.ГистограммаНормированнаяОбъемная, НСтр("ru = 'Объемная нормированная'"));
	ИначеЕсли Значение.Значение = ТипДиаграммы.ГистограммаГоризонтальная Тогда
		Меню.Добавить(ТипДиаграммы.ГистограммаГоризонтальная, НСтр("ru = 'Обычная'"));
		Меню.Добавить(ТипДиаграммы.ГистограммаСНакоплениемГоризонтальная, НСтр("ru = 'С накоплением'"));
		Меню.Добавить(ТипДиаграммы.ГистограммаНормированнаяГоризонтальная, НСтр("ru = 'Нормированная'"));
		Меню.Добавить(ТипДиаграммы.ГистограммаГоризонтальнаяОбъемная, НСтр("ru = 'Объемная'"));
		Меню.Добавить(ТипДиаграммы.ГистограммаСНакоплениемГоризонтальнаяОбъемная, НСтр("ru = 'Объемная с накоплением'"));
		Меню.Добавить(ТипДиаграммы.ГистограммаНормированнаяГоризонтальнаяОбъемная, НСтр("ru = 'Объемная нормированная'"));
	ИначеЕсли Значение.Значение = ТипДиаграммы.Круговая Тогда
		Меню.Добавить(ТипДиаграммы.Круговая, НСтр("ru = 'Обычная'"));
		Меню.Добавить(ТипДиаграммы.КруговаяОбъемная, НСтр("ru = 'Объемная'"));
	ИначеЕсли Значение.Значение = ТипДиаграммы.Изометрическая Тогда
		Меню.Добавить(ТипДиаграммы.Изометрическая, НСтр("ru = 'Обычная'"));
		Меню.Добавить(ТипДиаграммы.ИзометрическаяНепрерывная, НСтр("ru = 'Непрерывная'"));
		Меню.Добавить(ТипДиаграммы.ИзометрическаяЛента, НСтр("ru = 'Лента'"));
		Меню.Добавить(ТипДиаграммы.ИзометрическаяПирамида, НСтр("ru = 'Пирамида'"));
	ИначеЕсли Значение.Значение = "<Прочие>" Тогда
		Меню.Добавить(ТипДиаграммы.Водопад);
		Меню.Добавить(ТипДиаграммы.КаркаснаяПоверхность);
		Меню.Добавить(ТипДиаграммы.Поверхность);
		Меню.Добавить(ТипДиаграммы.ВыпуклаяПоверхность);
		Меню.Добавить(ТипДиаграммы.ВогнутаяПоверхность);
		Меню.Добавить(ТипДиаграммы.ЗатененнаяПоверхность);
		Меню.Добавить(ТипДиаграммы.Сотовая);
	Иначе
		ВидДиаграммыВыбор(Значение, Неопределено);
		Возврат;
	КонецЕсли;
	Для Каждого ЭлементСписка Из Меню Цикл
		ЭлементСписка.Картинка = КартинкаДиаграммы(ЭлементСписка.Значение);
	КонецЦикла; 
	Оповещение = Новый ОписаниеОповещения("ВидДиаграммыВыбор", ЭтотОбъект);
	#Если ВебКлиент Тогда
		ПоказатьВыборИзМеню(Оповещение, Меню, Элементы.ВидДиаграммы);
	#Иначе
		ПоказатьВыборИзСписка(Оповещение, Меню, Элементы.ВидДиаграммы);
	#КонецЕсли 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КартинкаДиаграммы(ВидДиаграммы)
	
	Если ВидДиаграммы=ТипДиаграммы.График Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_График;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ГрафикПоШагам Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ГрафикПоШагам;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ГрафикСНакоплением Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ГрафикСНакоплением;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ГрафикСОбластями Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ГрафикСОбластями;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ГрафикСОбластями Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ГрафикСОбластями;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ГрафикСОбластямиИНакоплением Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ГрафикСОбластямиИНакоплением;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ГрафикСОбластямиНормированный Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ГрафикСОбластямиНормированный;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.Гистограмма Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_Гистограмма;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ГистограммаСНакоплением Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ГистограммаСНакоплением;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ГистограммаНормированная Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ГистограммаНормированная
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ГистограммаОбъемная Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ГистограммаОбъемная;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ГистограммаСНакоплениемОбъемная Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ГистограммаСНакоплениемОбъемная;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ГистограммаНормированнаяОбъемная Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ГистограммаНормированнаяОбъемная;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ГистограммаГоризонтальная Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ГистограммаГоризонтальная;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ГистограммаСНакоплениемГоризонтальная Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ГистограммаСНакоплениемГоризонтальная;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ГистограммаНормированнаяГоризонтальная Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ГистограммаНормированнаяГоризонтальная;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ГистограммаГоризонтальнаяОбъемная Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ГистограммаГоризонтальнаяОбъемная;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ГистограммаСНакоплениемГоризонтальнаяОбъемная Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ГистограммаСНакоплениемГоризонтальнаяОбъемная;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ГистограммаНормированнаяГоризонтальнаяОбъемная Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ГистограммаНормированнаяГоризонтальнаяОбъемная;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.Круговая Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_Круговая;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.КруговаяОбъемная Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_КруговаяОбъемная;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.Изометрическая Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_Изометрическая;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ИзометрическаяНепрерывная Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ИзометрическаяНепрерывная;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ИзометрическаяЛента Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ИзометрическаяЛента;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ИзометрическаяПирамида Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ИзометрическаяПирамида;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.Водопад Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_Водопад;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.КаркаснаяПоверхность Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_КаркаснаяПоверхность;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.Поверхность Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_Поверхность;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ВыпуклаяПоверхность Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ВыпуклаяПоверхность;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ВогнутаяПоверхность Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ВогнутаяПоверхность;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.ЗатененнаяПоверхность Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_ЗатененнаяПоверхность;
	ИначеЕсли ВидДиаграммы=ТипДиаграммы.Сотовая Тогда
		Возврат БиблиотекаКартинок.ТипДиаграммы_Сотовая;
	Иначе
		Возврат Новый Картинка;
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Процедура ВидДиаграммыВыбор(Значение, ДополнительныеДанные) Экспорт
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ВидДиаграммы = Значение.Значение;
	ПриИзмененииВидаДиаграммы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииВидаДиаграммы()
	
	ЭлементСтруктуры = ЭлементСтуктурыДиаграмма(Отчет.КомпоновщикНастроек.Настройки.Структура, ЗначениеЗаполнено(ВидДиаграммы));
	Если Не ВидДиаграммы = Неопределено Тогда
		ЭлементСтруктуры.Использование = Истина;
		Параметр = ЭлементСтруктуры.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипДиаграммы"));
		Если Параметр = Неопределено ИЛИ НЕ Параметр.Использование Тогда
			Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипДиаграммы"));
		КонецЕсли; 
		Если Не Параметр = Неопределено Тогда
			Параметр.Значение = ВидДиаграммы;
			Параметр.Использование = Истина;
			ОтметитьНеактуальным();
		КонецЕсли;
	ИначеЕсли Не ЭлементСтруктуры = Неопределено Тогда 
		ЭлементСтруктуры.Использование = Ложь;
		ОтметитьНеактуальным();
	КонецЕсли; 
	ВидДиаграммыВыборСервер();
	
КонецПроцедуры

&НаСервере
Процедура ВидДиаграммыВыборСервер()
	
	УстановитьВидимостьИДоступность("ИзмененВидДиаграммы");
	Если НастройкиОтчета.ИзменятьЗначенияДиаграммы И НЕ ЗначениеЗаполнено(ДиаграммаЗначения) Тогда
		УстановитьЗначенияДиаграммыПоУмолчаниюРекурсивно(Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаТочкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();
	Для Каждого ЭлементВыбора Из ДоступныеТочки Цикл
		Элемент.СписокВыбора.Добавить(ЭлементВыбора.Значение, ЭлементВыбора.Представление);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаСерииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();
	Для Каждого ЭлементВыбора Из ДоступныеСерии Цикл
		Если Не ЗначениеЗаполнено(ДиаграммаСерии) И ЗначениеЗаполнено(ДиаграммаТочки) И ЭлементВыбора.Значение=ДиаграммаТочки Тогда
			Продолжить;
		КонецЕсли; 
		Элемент.СписокВыбора.Добавить(ЭлементВыбора.Значение, ЭлементВыбора.Представление);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаСерииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение="<Прочие>" Тогда
		СтандартнаяОбработка = Ложь;
		Оповещение = Новый ОписаниеОповещения("ДобавитьСерию", ЭтотОбъект);
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Режим", "ПоляГруппировки");
		СтруктураПараметров.Вставить("АдресСхемы", НастройкиОтчета.АдресСхемы);
		СтруктураПараметров.Вставить("АдресНастроек", ПоместитьВоВременноеХранилище(Отчет.КомпоновщикНастроек.Настройки, УникальныйИдентификатор));
		ОткрытьФорму("ОбщаяФорма.ФормаСпискаПолей", СтруктураПараметров, ЭтаФорма,,,, Оповещение);
	ИначеЕсли ВыбранноеЗначение=ДиаграммаТочки И ЗначениеЗаполнено(ДиаграммаСерии) Тогда
		ДиаграммаТочки = ДиаграммаСерии;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаТочкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = "<Прочие>" Тогда
		СтандартнаяОбработка = Ложь;
		Оповещение = Новый ОписаниеОповещения("ДобавитьТочку", ЭтотОбъект);
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Режим"		, "ПоляГруппировки");
		СтруктураПараметров.Вставить("АдресСхемы"	, НастройкиОтчета.АдресСхемы);
		СтруктураПараметров.Вставить("АдресНастроек", ПоместитьВоВременноеХранилище(Отчет.КомпоновщикНастроек.Настройки, УникальныйИдентификатор));
		ОткрытьФорму("ОбщаяФорма.ФормаСпискаПолей", СтруктураПараметров, ЭтаФорма,,,, Оповещение);
	ИначеЕсли ВыбранноеЗначение = ДиаграммаСерии И ЗначениеЗаполнено(ДиаграммаТочки) Тогда
		ДиаграммаСерии = ДиаграммаТочки;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаТочкиПриИзменении(Элемент)
	
	Если ДиаграммаТочки=ДиаграммаСерии Тогда
		ДиаграммаСерии = Неопределено;
	КонецЕсли; 
	ПриИзмененииНастроекДиаграммы();
	УстановитьВидимостьИДоступность("ИзмененаТочкаДиаграммы");
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаСерииПриИзменении(Элемент)
	
	Если НастройкиОтчета.ВыводитьТолькоТочки Тогда
		ДиаграммаТочки = ДиаграммаСерии;
	ИначеЕсли ДиаграммаСерии=ДиаграммаТочки Тогда
		ДиаграммаТочки = Неопределено;
	КонецЕсли;
	ПриИзмененииНастроекДиаграммы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаЗначенияПриИзменении(Элемент)
	
	ПриИзмененииНастроекДиаграммы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСерию(ПолноеИмя, ДополнительныеДанные) Экспорт
	
	Если ПолноеИмя=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ДоступныеСерии.НайтиПоЗначению(ПолноеИмя)=Неопределено Тогда
		ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных(ПолноеИмя));
		Если ДоступноеПоле=Неопределено Тогда
			Возврат;
		КонецЕсли;
		ДоступныеСерии.Вставить(ДоступныеСерии.Количество()-1, ПолноеИмя, ДоступноеПоле.Заголовок);
		Элементы.ДиаграммаСерии.СписокВыбора.Вставить(Элементы.ДиаграммаСерии.СписокВыбора.Количество()-1, ПолноеИмя, ДоступноеПоле.Заголовок);
	КонецЕсли; 
	ДиаграммаСерии = ПолноеИмя;
	ДиаграммаСерииПриИзменении(Элементы.ДиаграммаСерии);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТочку(ПолноеИмя, ДополнительныеДанные) Экспорт
	
	Если ПолноеИмя=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ДоступныеТочки.НайтиПоЗначению(ПолноеИмя)=Неопределено Тогда
		ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных(ПолноеИмя));
		Если ДоступноеПоле=Неопределено Тогда
			Возврат;
		КонецЕсли;
		ДоступныеТочки.Вставить(ДоступныеТочки.Количество()-1, ПолноеИмя, ДоступноеПоле.Заголовок);
		Элементы.ДиаграммаТочки.СписокВыбора.Вставить(Элементы.ДиаграммаТочки.СписокВыбора.Количество()-1, ПолноеИмя, ДоступноеПоле.Заголовок);
	КонецЕсли; 
	ДиаграммаТочки = ПолноеИмя;
	ДиаграммаТочкиПриИзменении(Элементы.ДиаграммаТочки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНастроекДиаграммы()
	
	Если Не ПроверитьСовместимостьДиаграммы() Тогда
		Возврат;
	КонецЕсли; 
	ОбновитьНастройкиДиаграммы();
	ОтметитьНеактуальным();
	
КонецПроцедуры

#КонецОбласти 

#Область Фильтры

&НаСервере
Функция СписокБыстрыхФильтров()
	
	ДобавленныеФильтры = СписокДобавленныхФильтров();
	Список = Новый СписокЗначений;
	Если НастройкиОтчета.Свойство("ДополнительныеФильтры") И ТипЗнч(НастройкиОтчета.ДополнительныеФильтры)=Тип("СписокЗначений") Тогда
		Для Каждого ОписаниеПоля Из НастройкиОтчета.ДополнительныеФильтры Цикл
			Если Не ДобавленныеФильтры.НайтиПоЗначению(ОписаниеПоля.Значение)=Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных(ОписаниеПоля.Значение));
			Если ДоступноеПоле=Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			Если ПустаяСтрока(ОписаниеПоля.Представление) Тогда
				ПредставлениеПоля = ДоступноеПоле.Заголовок;
			Иначе
				ПредставлениеПоля = ОписаниеПоля.Представление;
			КонецЕсли; 
			Список.Добавить(ОписаниеПоля.Значение, ПредставлениеПоля);
		КонецЦикла; 
	КонецЕсли;
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьФильтрЗавершение(Элемент, ДополнительныеДанные) Экспорт
	
	Если Элемент=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Если Элемент.Значение=Неопределено Тогда
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Тип", ТипФильтр());
		СтрокиПолей = СтрокиДерева(ПоляНастроек, СтруктураОтбора);
		СписокПолей = Новый СписокЗначений;
		Для Каждого СтрПоле Из СтрокиПолей Цикл
			СписокПолей.Добавить(СтрПоле.Поле);
		КонецЦикла; 
		Оповещение = Новый ОписаниеОповещения("ДобавитьФильтрПрочиеПоля", ЭтотОбъект);
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Режим", "ПоляОтбора");
		СтруктураПараметров.Вставить("СуществующийПоля", СписокПолей);
		СтруктураПараметров.Вставить("АдресСхемы", НастройкиОтчета.АдресСхемы);
		СтруктураПараметров.Вставить("АдресНастроек", ПоместитьВоВременноеХранилище(Отчет.КомпоновщикНастроек.Настройки, УникальныйИдентификатор));
		ОткрытьФорму("ОбщаяФорма.ФормаСпискаПолей", СтруктураПараметров, ЭтаФорма,,,, Оповещение);
	Иначе
		ДобавитьОписаниеФильтра(Элемент.Значение);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФильтрПрочиеПоля(Путь, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Путь) Тогда
		ДобавитьОписаниеФильтра(Путь);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область Группировки

&НаСервере
Функция СписокБыстрыхГруппировок()
	
	ДобавленныеГруппировки = СписокДобавленныхГруппировок();
	Список = Новый СписокЗначений;
	Если НастройкиОтчета.Свойство("ДополнительныеГруппировкиСтрок") И ТипЗнч(НастройкиОтчета.ДополнительныеГруппировкиСтрок)=Тип("СписокЗначений") Тогда
		Для Каждого ОписаниеПоля Из НастройкиОтчета.ДополнительныеГруппировкиСтрок Цикл
			Если Не ДобавленныеГруппировки.НайтиПоЗначению(ОписаниеПоля.Значение)=Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных(ОписаниеПоля.Значение));
			Если ДоступноеПоле=Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			Если ПустаяСтрока(ОписаниеПоля.Представление) Тогда
				ПредставлениеПоля = ДоступноеПоле.Заголовок;
			Иначе
				ПредставлениеПоля = ОписаниеПоля.Представление;
			КонецЕсли; 
			Список.Добавить(ОписаниеПоля.Значение, ПредставлениеПоля);
		КонецЦикла; 
	КонецЕсли;
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьСтрокуЗавершение(Элемент, ДополнительныеДанные) Экспорт
	
	Если Элемент=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не Элемент.Значение=Неопределено Тогда
		// Группировка
		ДобавитьГруппировкуРеквизит(Элемент.Значение); 
	Иначе
		СписокПолей = СписокДобавленныхГруппировок();
		Оповещение = Новый ОписаниеОповещения("ДобавитьСтрокуПрочиеПоля", ЭтотОбъект);
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Режим", "ПоляГруппировки");
		СтруктураПараметров.Вставить("СуществующийПоля", СписокПолей);
		СтруктураПараметров.Вставить("АдресСхемы", НастройкиОтчета.АдресСхемы);
		СтруктураПараметров.Вставить("АдресНастроек", ПоместитьВоВременноеХранилище(Отчет.КомпоновщикНастроек.Настройки, УникальныйИдентификатор));
		ОткрытьФорму("ОбщаяФорма.ФормаСпискаПолей", СтруктураПараметров, ЭтаФорма,,,, Оповещение);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуПрочиеПоля(ПолноеИмя, ИмяГруппировки) Экспорт
	
	Если ПолноеИмя=Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДобавитьГруппировкуРеквизит(ПолноеИмя); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеГруппировкиКолонокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элемент.СписокВыбора.Количество()>0 Тогда
		// Уже заполнено
		Возврат;
	КонецЕсли; 
	Список = СписокПолейГруппировок();
	Для Каждого ЭлементСписка Из Список Цикл
		Элемент.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление,, ЭлементСписка.Картинка);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеГруппировкиКолонокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение="<Прочие>" Тогда
		СтандартнаяОбработка = Ложь;
		Оповещение = Новый ОписаниеОповещения("ДобавитьГруппировкуКолонок", ЭтотОбъект);
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Режим", "ПоляГруппировки");
		СтруктураПараметров.Вставить("АдресСхемы", НастройкиОтчета.АдресСхемы);
		СтруктураПараметров.Вставить("АдресНастроек", ПоместитьВоВременноеХранилище(Отчет.КомпоновщикНастроек.Настройки, УникальныйИдентификатор));
		ОткрытьФорму("ОбщаяФорма.ФормаСпискаПолей", СтруктураПараметров, ЭтаФорма,,,, Оповещение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппировкуКолонок(ПолноеИмя, ДополнительныеДанные) Экспорт
	
	Если ПолноеИмя=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Элементы.ПолеГруппировкиКолонок.СписокВыбора.НайтиПоЗначению(ПолноеИмя)=Неопределено Тогда
		ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных(ПолноеИмя));
		Если ДоступноеПоле=Неопределено Тогда
			Возврат;
		КонецЕсли;
		Элементы.ПолеГруппировкиКолонок.СписокВыбора.Вставить(Элементы.ПолеГруппировкиКолонок.СписокВыбора.Количество()-1, ПолноеИмя, ДоступноеПоле.Заголовок);
	КонецЕсли; 
	ПолеГруппировкиКолонок = ПолноеИмя;
	ПриИзмененииГруппировкиКолонки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеГруппировкиКолонокПриИзменении(Элемент)
	
	ПриИзмененииГруппировкиКолонки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииГруппировкиКолонки()
	
	Если Не ПроверитьСовместимостьГруппировокКолонок() Тогда
		Возврат;
	КонецЕсли; 
	Если Не ПустаяСтрока(ПолеГруппировкиКолонок) Тогда
		СтрокаНастроек = СтрокаОписанияПоля(ТипГруппировка(), ПолеГруппировкиКолонок, ПоляНастроек);
		Если СтрокаНастроек=Неопределено Тогда
			СтрокаНастроек = СтрокаОписанияПоля(ТипРеквизит(), ПолеГруппировкиКолонок, ПоляНастроек);
		КонецЕсли; 
	Иначе
		СтрокаНастроек = Неопределено;
	КонецЕсли; 
	Обновлено = Ложь;
	Если Не СтрокаНастроек=Неопределено Тогда
		Для Каждого ОписаниеРеквизита Из СтрокаНастроек.Реквизиты Цикл
			ЭтаФорма[ОписаниеРеквизита.Ключ] = Ложь; 
		КонецЦикла; 
		ОбновитьГруппировкиИРеквизиты();
		Обновлено = Истина;
	КонецЕсли;
	Если Не ПустаяСтрока(ПолеГруппировкиКолонок) И ПолеГруппировкиКолонок=ПолеСравнения Тогда 
		ПолеСравнения = "";
		ПоказыватьАбсолютноеИзменение = Ложь;
		ПоказыватьОтносительноеИзменение = Ложь;
		ОбновитьГруппировкиИРеквизиты();
		Обновлено = Истина;
	КонецЕсли;
	Если Не Обновлено Тогда
		ОбновитьГруппировкиИРеквизиты(, Истина);
	КонецЕсли;
	
	УстановитьВидимостьИДоступность("ИзмененыГруппировки");
	ОтметитьНеактуальным(); 
	
КонецПроцедуры

&НаКлиенте
Процедура РежимРедактированияСтрокНажатие(Элемент)
	
	РежимРедактированияСтрок = НЕ РежимРедактированияСтрок;
	УстановитьВидимостьИДоступность("ИзмененРежимРедактирования");
	
КонецПроцедуры

#КонецОбласти 

#Область Колонки

&НаСервере
Функция СписокДополнительныхКолонок()
	
	Схема = ПолучитьИзВременногоХранилища(НастройкиОтчета.АдресСхемы);
	Список = Новый СписокЗначений;
	Для Каждого Показатель Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
		Если Не Показатель.Ресурс Тогда
			Продолжить;
		КонецЕсли;
		ИмяПоля = Строка(Показатель.Поле);
		Если Не СтрокаОписанияПоля(ТипПоказатель(), ИмяПоля, ПоляНастроек)=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если НастройкиОтчета.Свойство("ТолькоРесурсыОстатков") И НастройкиОтчета.ТолькоРесурсыОстатков Тогда
			ПолеСхемы = ОтчетыСервер.ПолеСхемы(Схема, ИмяПоля);
			Если Не ПолеСхемы=Неопределено И НЕ ПолеСхемы.Роль.ТипОстатка=ТипОстаткаКомпоновкиДанных.КонечныйОстаток Тогда
				Продолжить;
			КонецЕсли; 
		КонецЕсли; 
		Список.Добавить(ИмяПоля, Показатель.Заголовок);
	КонецЦикла;
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьКолонкуЗавершение(Элемент, ДополнительныеДанные) Экспорт
	
	Если Элемент=Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяЭлемента = ДобавитьОписаниеПоказателя(Элемент.Значение);
	Если Не ПустаяСтрока(ИмяЭлемента) Тогда
		ПриИзмененииПоказателя(ИмяЭлемента);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РежимРедактированияКолонокНажатие(Элемент)
	
	РежимРедактированияКолонок = НЕ РежимРедактированияКолонок;
	УстановитьВидимостьИДоступность("ИзмененРежимРедактирования");
	
КонецПроцедуры

#КонецОбласти 

#Область Сравнение

&НаКлиенте
Процедура ПолеСравненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элемент.СписокВыбора.Количество()>0 Тогда
		// Уже заполнено
		Возврат;
	КонецЕсли; 
	Список = СписокПолейГруппировок(Истина);
	Для Каждого ЭлементСписка Из Список Цикл
		Элемент.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление,, ЭлементСписка.Картинка);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеСравненияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение="<Прочие>" Тогда
		СтандартнаяОбработка = Ложь;
		Оповещение = Новый ОписаниеОповещения("ДобавитьПолеСравнения", ЭтотОбъект);
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Режим", "ПоляГруппировки");
		СтруктураПараметров.Вставить("АдресСхемы", НастройкиОтчета.АдресСхемы);
		СтруктураПараметров.Вставить("АдресНастроек", ПоместитьВоВременноеХранилище(Отчет.КомпоновщикНастроек.Настройки, УникальныйИдентификатор));
		ОткрытьФорму("ОбщаяФорма.ФормаСпискаПолей", СтруктураПараметров, ЭтаФорма,,,, Оповещение);
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ДобавитьПолеСравнения(ПолноеИмя, ДополнительныеДанные) Экспорт
	
	Если ПолноеИмя=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Элементы.ПолеСравнения.СписокВыбора.НайтиПоЗначению(ПолноеИмя)=Неопределено Тогда
		ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных(ПолноеИмя));
		Если ДоступноеПоле=Неопределено Тогда
			Возврат;
		КонецЕсли;
		Элементы.ПолеСравнения.СписокВыбора.Вставить(Элементы.ПолеСравнения.СписокВыбора.Количество()-1, ПолноеИмя, ДоступноеПоле.Заголовок);
	КонецЕсли;
	ПолеСравнения = ПолноеИмя;
	ПриИзмененииПоляСравнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеСравненияПриИзменении(Элемент)
	
	ПриИзмененииПоляСравнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПоляСравнения()
	
	Если Не ПроверитьСовместимостьГруппировокКолонок() Тогда
		ПоказыватьАбсолютноеИзменение = Ложь;
		ПоказыватьОтносительноеИзменение = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(ПолеСравнения)=Тип("ПеречислениеСсылка.Периодичность") Тогда
		ПоказыватьАбсолютноеИзменение = Ложь;
		ПоказыватьОтносительноеИзменение = Ложь;
	КонецЕсли;
	
	Если ТипЗнч(ПолеСравнения)=Тип("Строка") И НЕ ПустаяСтрока(ПолеСравнения) Тогда
		СтрокаНастроек = СтрокаОписанияПоля(ТипГруппировка(), ПолеСравнения, ПоляНастроек);
		Если СтрокаНастроек=Неопределено Тогда
			СтрокаНастроек = СтрокаОписанияПоля(ТипРеквизит(), ПолеСравнения, ПоляНастроек);
		КонецЕсли; 
	Иначе
		СтрокаНастроек = Неопределено;
	КонецЕсли; 
	Обновлено = Ложь;
	Если Не СтрокаНастроек=Неопределено Тогда
		Для Каждого ОписаниеРеквизита Из СтрокаНастроек.Реквизиты Цикл
			ЭтаФорма[ОписаниеРеквизита.Ключ] = Ложь; 
		КонецЦикла; 
		ОбновитьГруппировкиИРеквизиты();
		Обновлено = Истина;
	КонецЕсли;
	Если ТипЗнч(ПолеСравнения)=Тип("Строка") И НЕ ПустаяСтрока(ПолеСравнения) И ПолеГруппировкиКолонок=ПолеСравнения Тогда 
		ПолеГруппировкиКолонок = "";
		ОбновитьГруппировкиИРеквизиты();
		Обновлено = Истина;
	КонецЕсли;
	Если Не Обновлено Тогда
		ОбновитьГруппировкиИРеквизиты(, Истина);
	КонецЕсли; 
	
	УстановитьВидимостьИДоступность("ИзмененыПериодыСравнения");
	ОтметитьНеактуальным(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантСравненияПриИзменении(Элемент)
	
	ОтметитьНеактуальным(); 
	
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура СвернутьРазвернутьПанельНастроек(Элемент)
	
	НовоеЗначениеВидимость = НЕ Элементы.СтраницыНастройки.Видимость;
	
	Элементы.СтраницыНастройки.Видимость	= НовоеЗначениеВидимость;
	Элементы.ГруппаРазделитель.Видимость = Не НовоеЗначениеВидимость;
	Элементы.ПанельНастроек.Ширина = ?(НовоеЗначениеВидимость, 23, 0);
	
КонецПроцедуры

// Макет Макет Оформления
&НаКлиенте
Процедура МакетОформленияПриИзменении(Элемент)
	
	Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МакетОформления"));
	
	Если Параметр <> Неопределено Тогда
		Если ПустаяСтрока(МакетОформления) Тогда
			Параметр.Использование = Ложь;
		Иначе
			Параметр.Использование	= Истина;
			Параметр.Значение		= МакетОформления;
		КонецЕсли; 
	КонецЕсли; 
	
	МакетОформленияПриИзмененииСервер();
	ОтметитьНеактуальным();

КонецПроцедуры

&НаСервере
Процедура МакетОформленияПриИзмененииСервер()
	
	УстановитьПривилегированныйРежим(Истина);
	// Сохранение макета оформления по умолчанию для варианта
	Если НЕ ПустаяСтрока(НастройкиОтчета.ИдентификаторВарианта) Тогда
		ХранилищеСистемныхНастроек.Сохранить("МакетОформления", НастройкиОтчета.ИдентификаторВарианта, МакетОформления);
	КонецЕсли; 
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////// 
// Подключаемые

#Область ПараметрыИФильтры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура Подключаемый_ПараметрПриИзменении(Элемент)
	
	Стр = СтрокаОписанияПоИмениЭлемента(Элемент.Имя, ПоляНастроек);
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если Стр.НестандартныйОбработчик Тогда
		ВыполнитьНестандартнуюОбработку(Стр.ПолучитьИдентификатор(), Элемент.Имя);
	Иначе
		Значение = ЗначениеПоляФильтра(Стр);		
		Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда                                                			
			Значение = ?(Значение.Количество() > 0, Значение[0].Значение, Неопределено);
		КонецЕсли;                          
		Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Стр.Поле, Значение);  		
		
	КонецЕсли; 
	ОтметитьНеактуальным();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура Подключаемый_ПараметрПриИзменении_ДоступенСписокЗначений(Элемент)
	
	Стр = СтрокаОписанияПоИмениЭлемента(Элемент.Имя, ПоляНастроек);
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если Стр.НестандартныйОбработчик Тогда
		ВыполнитьНестандартнуюОбработку(Стр.ПолучитьИдентификатор(), Элемент.Имя);
	Иначе
		Значение = ЗначениеПоляФильтра(Стр);
		Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Стр.Поле, Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора".
//
Процедура Подключаемый_ПараметрНачалоВыбора_ДоступенСписокЗначений(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Стр = СтрокаОписанияПоИмениЭлемента(Элемент.Имя, ПоляНастроек);
	Если Стр=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Если Не Стр.ВидЭлемента="Поле" Тогда
		Возврат;
	КонецЕсли; 
	Если Стр.ДополнительныеПараметры.Свойство("БыстрыйВыбор") Тогда
		Возврат;
	КонецЕсли;
	Для Каждого ОписаниеРеквизита Из Стр.Реквизиты Цикл
		Значение = ЭтаФорма[ОписаниеРеквизита.Ключ];
		Если Не ЗначениеЗаполнено(Значение) Тогда
			ЭтаФорма[ОписаниеРеквизита.Ключ] = Неопределено;
		КонецЕсли; 
		Прервать;
	КонецЦикла; 
	Если Значение=Неопределено Тогда
		// Не выбран тип у многотипного фильтра
		Возврат;
	КонецЕсли;
	ИмяФормыВыбора = ОпределитьФормуВыбора(Значение, Элемент.ВыборГруппИЭлементов);
	Если ПустаяСтрока(ИмяФормыВыбора) Тогда
		Возврат;
	КонецЕсли; 
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("МножественныйВыбор"	, Истина);
	ПараметрыОткрытия.Вставить("РежимВыбора"		, Истина);
	ПараметрыОткрытия.Вставить("Отбор"				, Новый Структура);	
		
	Если КлючОбъекта = "Отчет.КонверсияЧленствПакетовУслугНовый" 
		И ТипЗнч(Значение) = Тип("СправочникСсылка.Номенклатура")
		И (Стр.Поле = "СегментНоменклатурыКонверсии" Или Стр.Поле = "СегментНоменклатуры") Тогда  
		
		СписокРазрешенныхТипов = Новый СписокЗначений;
		ПараметрыОткрытия.Вставить("СписокРазрешенныхТипов", СписокРазрешенныхТипов);   		
		
	КонецЕсли;
	
	Поле = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.ДоступныеПоляПараметров.НайтиПоле(Новый ПолеКомпоновкиДанных(Стр.Поле));
	ПараметрыВыбора = ОпределитьПараметрыВыбора(Поле);
	Если Не ПараметрыВыбора=Неопределено Тогда
		Если ТипЗнч(ПараметрыВыбора)=Тип("ФиксированныйМассив") Тогда
			МассивПараметров = Новый Массив(ПараметрыВыбора);
		ИначеЕсли ТипЗнч(ПараметрыВыбора)=Тип("ПараметрыВыбораКомпоновкиДанных") Тогда
			МассивПараметров = Новый Массив;
			Для Каждого Параметр Из ПараметрыВыбора Цикл
				МассивПараметров.Добавить(Параметр);
			КонецЦикла; 
		Иначе
			МассивПараметров = ПараметрыВыбора;
		КонецЕсли;
		Если ТипЗнч(МассивПараметров)=Тип("Массив") Тогда
			Если ТипЗнч(Элемент)=Тип("ПолеФормы") И Элемент.Вид=ВидПоляФормы.ПолеВвода Тогда
				Для Каждого Параметр Из Элемент.ПараметрыВыбора Цикл
					МассивПараметров.Добавить(Параметр);
				КонецЦикла; 
			КонецЕсли; 
			Для Каждого Параметр Из МассивПараметров Цикл
				Если Найти(Параметр.Имя, "Отбор.") = 0 Тогда
					Продолжить;
				КонецЕсли; 
				ИмяПоля = СтрЗаменить(Параметр.Имя, "Отбор.", "");
				Если Найти(ИмяПоля, ".") > 0 Тогда
					Продолжить;
				КонецЕсли;
				ПараметрыОткрытия.Отбор.Вставить(ИмяПоля, Параметр.Значение);
			КонецЦикла; 
		КонецЕсли; 
	КонецЕсли; 
	
	ОткрытьФорму(ИмяФормыВыбора, ПараметрыОткрытия, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ОбработкаВыбора".
//
Процедура Подключаемый_ПараметрОбработкаВыбора_ДоступенСписокЗначений(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Стр = СтрокаОписанияПоИмениЭлемента(Элемент.Имя, ПоляНастроек);
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТипЗнч(ВыбранноеЗначение)=Тип("Тип") Тогда 
		Если ВыбранноеЗначение=Тип("Строка") 
			ИЛИ ВыбранноеЗначение=Тип("Число") 
			ИЛИ ВыбранноеЗначение=Тип("Дата") 
			ИЛИ ВыбранноеЗначение=Тип("Булево") Тогда
			Возврат;
		КонецЕсли; 
		СтандартнаяОбработка = Ложь;
		Для Каждого ОписаниеРеквизита Из Стр.Реквизиты Цикл
			ЭтаФорма[ОписаниеРеквизита.Ключ] = Новый(ВыбранноеЗначение);
			Прервать;
		КонецЦикла; 
		Подключаемый_ПараметрНачалоВыбора_ДоступенСписокЗначений(Элемент, Неопределено, Истина);
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Если Стр.НестандартныйОбработчик Тогда
		ВыполнитьНестандартнуюОбработку(Стр.ПолучитьИдентификатор(), Элемент.Имя, ВыбранноеЗначение);
	Иначе
		ЗначениеОтбора = Новый СписокЗначений;
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
			Для Каждого ТекЭлемент Из ВыбранноеЗначение Цикл
				Если Не ЗначениеЗаполнено(ТекЭлемент) Тогда
					Продолжить;
				КонецЕсли;
				ЗначениеОтбора.Добавить(ТекЭлемент);
			КонецЦикла;
		Иначе
			ЗначениеОтбора.Добавить(ВыбранноеЗначение);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ЗначениеОтбора) Тогда
			Возврат;
		КонецЕсли;		
		
		ТекЗначениеПараметра = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(Стр.Поле)).Значение;
		Если НЕ ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") И НЕ ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
			Если ТекЗначениеПараметра.НайтиПоЗначению(ВыбранноеЗначение) = Неопределено Тогда
				ТекЗначениеПараметра.Добавить(ВыбранноеЗначение);
				Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Стр.Поле, ТекЗначениеПараметра);
			КонецЕсли;
		ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Или ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") Тогда
			Для Каждого Элемент Из ВыбранноеЗначение Цикл
				Если НЕ ТекЗначениеПараметра.НайтиПоЗначению(Элемент) = Неопределено Тогда
					Продолжить;
				КонецЕсли; 
				ТекЗначениеПараметра.Добавить(Элемент);
			КонецЦикла; 
			Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Стр.Поле, ТекЗначениеПараметра);
		Иначе
			Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Стр.Поле, ВыбранноеЗначение);
		КонецЕсли;   	
		
		Если Стр.ВидЭлемента = "Поле" Тогда
			ТекЗначениеПараметра = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(Стр.Поле)).Значение;
			Для Каждого ОписаниеРеквизита Из Стр.Реквизиты Цикл
				ЭтаФорма[ОписаниеРеквизита.Ключ] = Неопределено;
				
				// Если Стр.ДополнительныеПараметры.Свойство("АвтоОтметкаНезаполненного") 
				//	И Стр.ДополнительныеПараметры.АвтоОтметкаНезаполненного = Истина
				//	И ЗначениеЗаполнено(ТекЗначениеПараметра) Тогда
				//	
				//	ТекЭлемент = Элементы.Найти(ОписаниеРеквизита.Ключ);
				//	Если ТекЭлемент <> Неопределено Тогда
				//		ТекЭлемент.АвтоОтметкаНезаполненного	= Ложь;
				//		ТекЭлемент.ОтметкаНезаполненного		= Ложь;
				//	КонецЕсли;
				// КонецЕсли;
				
			КонецЦикла; 
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьОтображениеОтметокПараметров();
	ОтметитьНеактуальным(); 
	
КонецПроцедуры      

&НаСервере
// Процедура - обновляет отображение отметок параметров на форме.
//
Процедура ОбновитьОтображениеОтметокПараметров()
	
	Если НаложенныеПараметры.Количество() > 0 Тогда
		УдалитьПодчиненныеЭлементыНаложенныхПараметров();
	КонецЕсли;
	ЗаполнитьТаблицуНаложенныхПараметров();     	
	
	Если ФормаПараметры.ЭтоМобильныйКлиент Тогда
		ВысотаОтметкиФильтра = 0;
	КонецЕсли;
	
	Для Каждого Стр Из НаложенныеПараметры Цикл
		
		ИмяГруппы = ПолучитьИмяГруппы(Стр.Поле);
		
		Если ИмяГруппы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		  
		ГруппаСтрока = Элементы[ИмяГруппы];
	
		Если ПустаяСтрока(Стр.ИмяКнопки) Тогда
			Стр.ИмяКнопки = НовоеИмяОтметкиФильтра();
		КонецЕсли;
		
		Если СтрДлина(Стр.Заголовок) > 26 Тогда			
			ЗаголовокЭлемента = Лев(Стр.Заголовок, 22) + "...";
		Иначе
			ЗаголовокЭлемента = Стр.Заголовок;
		КонецЕсли; 
		ЗаголовокЭлемента = " " + ЗаголовокЭлемента;
		Если ФормаПараметры.ВариантИнтерфейса = ВариантИнтерфейсаКлиентскогоПриложения.Такси 
			И Не ФормаПараметры.ЭтоМобильныйКлиент Тогда
			ДлинаЭлемента = Окр(СтрДлина(ЗаголовокЭлемента)*0.8+4);
		Иначе
			ДлинаЭлемента = Окр(СтрДлина(ЗаголовокЭлемента)*0.85+4);
		КонецЕсли; 
			
		ЭлементыЗаголовка = Новый Массив;
		ЭлементыЗаголовка.Добавить(Новый ФорматированнаяСтрока(ЗаголовокЭлемента));
		ЭлементыЗаголовка.Добавить(Новый ФорматированнаяСтрока(БиблиотекаКартинок.ОчиститьДанные,,,, Стр.ИмяКнопки));
		
		ИмяКолонки		= СтрЗаменить(Стр.ИмяКнопки, " ", "");
		ЭлементОтметка	= Элементы.Добавить(ИмяКолонки, Тип("ДекорацияФормы"), ГруппаСтрока);

		ЭлементОтметка.Вид			= ВидДекорацииФормы.Надпись;
		ЭлементОтметка.Заголовок	= Новый ФорматированнаяСтрока(ЭлементыЗаголовка);
		
		Если Не Стр.Заголовок = ЗаголовокЭлемента Тогда
			ЭлементОтметка.Подсказка = Стр.Заголовок;
		КонецЕсли; 
		
		ЭлементОтметка.ГоризонтальноеПоложение		= ГоризонтальноеПоложениеЭлемента.Лево;
		ЭлементОтметка.ЦветФона						= ?(Стр.ПризнакИсключения, ЦветаСтиля.УдаленныйРеквизитФон, ЦветаСтиля.ЦветФонаПодсказки);
		ЭлементОтметка.Ширина						= 20;
		ЭлементОтметка.Высота						= 1;
		ЭлементОтметка.РастягиватьПоГоризонтали		= Ложь;
		ЭлементОтметка.ВертикальноеПоложение		= ВертикальноеПоложениеЭлемента.Центр;
		ЭлементОтметка.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
		
		ЭлементОтметка.УстановитьДействие("ОбработкаНавигационнойСсылки", "Подключаемый_УдалитьПараметрНажатие");
		
	КонецЦикла;
	
	Если Элементы.СтрокиОтметокФильтров.ПодчиненныеЭлементы.Количество() > 50 Тогда
		Элементы.ОтчетТабличныйДокумент.РастягиватьПоВертикали = Ложь;
	ИначеЕсли Не Элементы.ОтчетТабличныйДокумент.РастягиватьПоВертикали Тогда
		Элементы.ОтчетТабличныйДокумент.РастягиватьПоВертикали = Истина;
	КонецЕсли;
	
	Для Каждого Стр Из ПоляНастроек.ПолучитьЭлементы() Цикл
		Если Стр.ДополнительныеПараметры.Свойство("АвтоОтметкаНезаполненного") И Стр.ДополнительныеПараметры.АвтоОтметкаНезаполненного Тогда	
			ТекПараметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(Стр.Поле));
			Если ТекПараметр <> Неопределено Тогда
				ТекЗначениеПараметра = ТекПараметр.Значение;
				Для Каждого ОписаниеРеквизита Из Стр.Реквизиты Цикл
					ТекЭлемент = Элементы.Найти(ОписаниеРеквизита.Ключ);
					Если ТекЭлемент <> Неопределено 
						И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекЭлемент, "АвтоОтметкаНезаполненного")
						И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекЭлемент, "ОтметкаНезаполненного") Тогда
						
						ТекЭлемент.АвтоОтметкаНезаполненного = Не ЗначениеЗаполнено(ТекЗначениеПараметра);                                   
						ТекЭлемент.ОтметкаНезаполненного	 = Не ЗначениеЗаполнено(ТекЗначениеПараметра);
					КонецЕсли;				
				КонецЦикла; 
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
// Процедура изменяет реквизит формы по имени поля настройки.
//
Процедура ИзменитьРеквизитФормыПоИмениПоляНастроек(Имя, Значение)
	
	ЭлементыПолейНастроек = ПоляНастроек.ПолучитьЭлементы();
	Для Каждого ТекЭлемент Из ЭлементыПолейНастроек Цикл
		Если ТекЭлемент.Поле = Имя Тогда
			Для Каждого Стр Из ТекЭлемент.Реквизиты Цикл								
				Если ПроверитьНаличиеРеквизита(Стр.Ключ) Тогда   					
					ЭтотОбъект[Стр.Ключ] = Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;							
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Функция првоеряет наличие реквизита.
//
Функция ПроверитьНаличиеРеквизита(ИмяРеквизита)
	
	МассивРеквзитов  = ЭтотОбъект.ПолучитьРеквизиты();
	Для Каждого ТекРеквизит Из МассивРеквзитов Цикл
		Если ТекРеквизит.Имя = ИмяРеквизита Тогда
			Возврат Истина;
		КонецЕсли;		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура Подключаемый_ФильтрПриИзменении(Элемент)
	
	Стр = СтрокаОписанияПоИмениЭлемента(Элемент.Имя, ПоляНастроек);
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ОписаниеСтандартныйПериод = Новый ОписаниеТипов("СтандартныйПериод");  
	
	Если Стр.ТипЗначения = ОписаниеСтандартныйПериод Тогда  		
		Если Стр.Свойство("Поле")
			И ЗначениеЗаполнено(Стр.Поле) 
			И Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(Стр.Поле)) <> Неопределено Тогда
			
			Значение = ЗначениеПоляФильтра(Стр);
			Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Стр.Поле, Значение);
			Возврат;
		// Иначе
		//	Возврат;
		КонецЕсли;		
	КонецЕсли;  	
	
	Если Стр.НестандартныйОбработчик Тогда
		ВыполнитьНестандартнуюОбработку(Стр.ПолучитьИдентификатор(), Элемент.Имя);
	ИначеЕсли Найти(Стр.Поле, "ДобавленноеПоле_") > 0 Тогда
		Значение = ЗначениеПоляФильтра(Стр);
		НаложитьОтборПоДобавленномуПолю(Стр.Поле, Значение);
	Иначе
		Значение = ЗначениеПоляФильтра(Стр);
		Если Стр.ВидЭлемента = "Поле" И НЕ ЗначениеЗаполнено(Значение) Тогда
			Возврат;
		КонецЕсли;
		Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Стр.ДополнительныеПараметры, "СвязьПоПредставлению", Ложь) Тогда
			ИзменитьИспользованиеФильтра(Стр.Заголовок, Значение); 
		ИначеЕсли Стр.ВидЭлемента="Поле" Тогда
			ЗначениеОтбора = Новый СписокЗначений;
			ЗначениеОтбора.Добавить(Значение);
			УстановитьЗначениеФильтра(Стр.Поле, ЗначениеОтбора, ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии, Ложь);
		ИначеЕсли Стр.ВидЭлемента="Тумблер" Тогда
			УстановитьЗначениеФильтра(Стр.Поле, Значение, ВидСравненияКомпоновкиДанных.Равно, Ложь, Истина);
		Иначе
			УстановитьЗначениеФильтра(Стр.Поле, Значение, ВидСравненияКомпоновкиДанных.Равно, Ложь);
		КонецЕсли; 
		Если Стр.ВидЭлемента="Поле" Тогда
			Для Каждого ОписаниеРеквизита Из Стр.Реквизиты Цикл
				ЭтаФорма[ОписаниеРеквизита.Ключ] = Неопределено;
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли; 
	ОтметитьНеактуальным();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора".
//
Процедура Подключаемый_ФильтрНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Стр = СтрокаОписанияПоИмениЭлемента(Элемент.Имя, ПоляНастроек);
	Если Стр=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Если Не Стр.ВидЭлемента="Поле" Тогда
		Возврат;
	КонецЕсли; 
	Если Стр.ДополнительныеПараметры.Свойство("БыстрыйВыбор") Тогда
		Возврат;
	КонецЕсли;
	Для Каждого ОписаниеРеквизита Из Стр.Реквизиты Цикл
		Значение = ЭтаФорма[ОписаниеРеквизита.Ключ];
		Если Не ЗначениеЗаполнено(Значение) Тогда
			ЭтаФорма[ОписаниеРеквизита.Ключ] = Неопределено;
		КонецЕсли; 
		Прервать;
	КонецЦикла; 
	Если Значение=Неопределено Тогда
		// Не выбран тип у многотипного фильтра
		Возврат;
	КонецЕсли;
	ИмяФормыВыбора = ОпределитьФормуВыбора(Значение, Элемент.ВыборГруппИЭлементов);
	Если ПустаяСтрока(ИмяФормыВыбора) Тогда
		Возврат;
	КонецЕсли; 
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("Отбор", Новый Структура);
	Поле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(Стр.Поле));
	ПараметрыВыбора = ОпределитьПараметрыВыбора(Поле);
	
	// Убираем отбор по ролям в поле "Менеджер презентации".
	Если Поле <> Неопределено
		И ПараметрыВыбора <> Неопределено
		И Поле.Заголовок = "Менеджер презентации" Тогда
		
		ОтборРоли = ПараметрыВыбора.Найти("Отбор.РольПользователя");
		Если ОтборРоли <> Неопределено Тогда
			ПараметрыВыбора.Удалить(ОтборРоли);
		КонецЕсли;
	КонецЕсли;

	Если Не ПараметрыВыбора=Неопределено Тогда
		Если ТипЗнч(ПараметрыВыбора)=Тип("ФиксированныйМассив") Тогда
			МассивПараметров = Новый Массив(ПараметрыВыбора);
		ИначеЕсли ТипЗнч(ПараметрыВыбора)=Тип("ПараметрыВыбораКомпоновкиДанных") Тогда
			МассивПараметров = Новый Массив;
			Для Каждого Параметр Из ПараметрыВыбора Цикл
				МассивПараметров.Добавить(Параметр);
			КонецЦикла; 
		Иначе
			МассивПараметров = ПараметрыВыбора;
		КонецЕсли;
		Если ТипЗнч(МассивПараметров)=Тип("Массив") Тогда
			Если ТипЗнч(Элемент)=Тип("ПолеФормы") И Элемент.Вид=ВидПоляФормы.ПолеВвода Тогда
				Для Каждого Параметр Из Элемент.ПараметрыВыбора Цикл
					МассивПараметров.Добавить(Параметр);
				КонецЦикла; 
			КонецЕсли; 
			Для Каждого Параметр Из МассивПараметров Цикл
				Если Найти(Параметр.Имя, "Отбор.")=0 Тогда
					Продолжить;
				КонецЕсли; 
				ИмяПоля = СтрЗаменить(Параметр.Имя, "Отбор.", "");
				Если Найти(ИмяПоля, ".")>0 Тогда
					Продолжить;
				КонецЕсли;
				ПараметрыОткрытия.Отбор.Вставить(ИмяПоля, Параметр.Значение);
			КонецЦикла; 
		КонецЕсли; 
	КонецЕсли;
	
	Если ИмяФормыВыбора = "Справочник.Сотрудники.ФормаВыбора" Тогда
		
		Если (КлючОбъекта = "Отчет.ОказанныеУслугиПоАссистенту" ИЛИ КлючОбъекта = "Отчет.Продажи") И Стр.Поле = "Ассистент" Тогда    			
			ПараметрыОткрытия.Вставить("ЭтоАссистент", Истина);			          		
			ПараметрыОткрытия.Вставить("ОтборБезВрачей", Истина);
		Иначе 
			ПараметрыОткрытия.Вставить("БезОтбораПоРолям", Истина);			          	
		КонецЕсли;
		
		Для Каждого ЭлементОтбора Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтруктурнаяЕдиница") И ЗначениеЗаполнено(ЭлементОтбора.ПравоеЗначение) Тогда			
				ПараметрыОткрытия.Вставить("СтруктурнаяЕдиница", ЭлементОтбора.ПравоеЗначение);
				ПараметрыОткрытия.Вставить("ОтбиратьПоСтруктурнойЕдинице", Истина);
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		
	КонецЕсли;
	
	ОткрытьФорму(ИмяФормыВыбора, ПараметрыОткрытия, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ОбработкаВыбора".
//
Процедура Подключаемый_ФильтрОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Стр = СтрокаОписанияПоИмениЭлемента(Элемент.Имя, ПоляНастроек);
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТипЗнч(ВыбранноеЗначение)=Тип("Тип") Тогда 
		Если ВыбранноеЗначение=Тип("Строка") 
			ИЛИ ВыбранноеЗначение=Тип("Число") 
			ИЛИ ВыбранноеЗначение=Тип("Дата") 
			ИЛИ ВыбранноеЗначение=Тип("Булево") Тогда
			Возврат;
		КонецЕсли; 
		СтандартнаяОбработка = Ложь;
		Для Каждого ОписаниеРеквизита Из Стр.Реквизиты Цикл
			ЭтаФорма[ОписаниеРеквизита.Ключ] = Новый(ВыбранноеЗначение);
			Прервать;
		КонецЦикла; 
		Подключаемый_ФильтрНачалоВыбора(Элемент, Неопределено, Истина);
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Если Стр.НестандартныйОбработчик Тогда
		ВыполнитьНестандартнуюОбработку(Стр.ПолучитьИдентификатор(), Элемент.Имя, ВыбранноеЗначение);
	ИначеЕсли Найти(Стр.Поле, "ДобавленноеПоле_")>0 Тогда
		НаложитьОтборПоДобавленномуПолю(Стр.Поле, ВыбранноеЗначение);
	Иначе
		ЗначениеОтбора = Новый СписокЗначений;
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
			Для Каждого ТекЭлемент Из ВыбранноеЗначение Цикл
				Если Не ЗначениеЗаполнено(ТекЭлемент) Тогда
					Продолжить;
				КонецЕсли;
				ЗначениеОтбора.Добавить(ТекЭлемент);
			КонецЦикла;
		Иначе
			ЗначениеОтбора.Добавить(ВыбранноеЗначение);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ЗначениеОтбора) Тогда
			Возврат;
		КонецЕсли;
		УстановитьЗначениеФильтра(Стр.Поле, ЗначениеОтбора, ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии, Ложь); 
		Если Стр.ВидЭлемента="Поле" Тогда
			Для Каждого ОписаниеРеквизита Из Стр.Реквизиты Цикл
				ЭтаФорма[ОписаниеРеквизита.Ключ] = Неопределено;
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
	
	ОтметитьНеактуальным();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "ИерархияФильтраНажатие".
//
Процедура Подключаемый_ИерархияФильтраНажатие(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИмяЭлемента = СтрЗаменить(Элемент.Имя, "_Иерархия", "");
	Стр = СтрокаОписанияПоИмениЭлемента(ИмяЭлемента, ПоляНастроек);
	Если Стр=Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЭлементПоле = Элементы[ИмяЭлемента];
	Если ЭлементПоле.ВыборГруппИЭлементов=ГруппыИЭлементы.Элементы Тогда
		ЭлементПоле.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
		ЭлементПоле.ПодсказкаВвода = Стр.Заголовок+НСтр("ru = ' (группа)'");
		Элемент.Подсказка = НСтр("ru = 'Используется выбор групп. Нажмите для выбора элементов.'");
		Элемент.Картинка = БиблиотекаКартинок.РежимВыбораГрупп;
	Иначе
		ЭлементПоле.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
		ЭлементПоле.ПодсказкаВвода = Стр.Заголовок;
		Элемент.Подсказка = НСтр("ru = 'Используется выбор элементов. Нажмите для выбора групп.'");
		Элемент.Картинка = БиблиотекаКартинок.РежимВыбораЭлементов;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "ИерархияПараметраНажатие".
//
Процедура Подключаемый_ИерархияПараметраНажатие(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка	= Ложь;
	ИмяЭлемента				= СтрЗаменить(Элемент.Имя, "_Иерархия", "");
	Стр						= СтрокаОписанияПоИмениЭлемента(ИмяЭлемента, ПоляНастроек);
	
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементПоле = Элементы[ИмяЭлемента];
	
	Если ЭлементПоле.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы Тогда
		ЭлементПоле.ВыборГруппИЭлементов 	= ГруппыИЭлементы.Группы;
		ЭлементПоле.ПодсказкаВвода			= Стр.Заголовок+НСтр("ru = ' (группа)'");
		Элемент.Подсказка					= НСтр("ru = 'Используется выбор групп. Нажмите для выбора элементов.'");
		Элемент.Картинка					= БиблиотекаКартинок.РежимВыбораГрупп;
	Иначе
		ЭлементПоле.ВыборГруппИЭлементов	= ГруппыИЭлементы.Элементы;
		ЭлементПоле.ПодсказкаВвода			= Стр.Заголовок;
		Элемент.Подсказка					= НСтр("ru = 'Используется выбор элементов. Нажмите для выбора групп.'");
		Элемент.Картинка					= БиблиотекаКартинок.РежимВыбораЭлементов;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "УдалитьФильтрНажатие".
//
Процедура Подключаемый_УдалитьФильтрНажатие(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИмяКнопки = Элемент.Имя;
	Стр = СтрокаНаложенногоФильтра(ИмяКнопки);
	Если Стр=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	УдалитьФильтр(Стр.ПолучитьИдентификатор());
	ОтметитьНеактуальным();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "УдалитьПараметрНажатие".
//
Процедура Подключаемый_УдалитьПараметрНажатие(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	ИмяКнопки				= Элемент.Имя;
	Стр						= СтрокаНаложенногоПараметра(ИмяКнопки);
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	УдалитьПараметр(Стр.ПолучитьИдентификатор());
	ОтметитьНеактуальным();
	
КонецПроцедуры

#КонецОбласти 

#Область Группировки

&НаКлиенте
// Процедура - обрабтчик команды "".
//
Процедура Подключаемый_ИерархияГруппировкиНажатие(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	ПриИзмененииИерархииГруппировки(Элемент.Имя); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииИерархииГруппировки(ИмяЭлемента)
	
	СтандартнаяОбработка = Ложь;
	ИмяРеквизита = СтрЗаменить(ИмяЭлемента, "_Иерархия", "");
	Стр = СтрокаОписанияПоИмениЭлемента(ИмяРеквизита, ПоляНастроек);
	Если Стр=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ОписаниеРеквизита Из Стр.Реквизиты Цикл
		ЭтотОбъект[ОписаниеРеквизита.Ключ] = Истина;
	КонецЦикла; 
	
	Если Стр.ДополнительныеПараметры.Свойство("ТипГруппировки") Тогда  
		
		Если Стр.ДополнительныеПараметры.ТипГруппировки=ТипГруппировкиКомпоновкиДанных.Элементы Тогда
			Стр.ДополнительныеПараметры.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
		ИначеЕсли Стр.ДополнительныеПараметры.ТипГруппировки=ТипГруппировкиКомпоновкиДанных.Иерархия Тогда
			Стр.ДополнительныеПараметры.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.ТолькоИерархия;
		ИначеЕсли Стр.ДополнительныеПараметры.ТипГруппировки=ТипГруппировкиКомпоновкиДанных.ТолькоИерархия Тогда
			Стр.ДополнительныеПараметры.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
		КонецЕсли;
		
	КонецЕсли;
	
	Элемент = Элементы[ИмяЭлемента];
	УстановитьПредставлениеКнопкиИерархииГруппировки(Элемент, Стр);
	
	Если Стр.НестандартныйОбработчик Тогда
		ВыполнитьНестандартнуюОбработку(Стр.ПолучитьИдентификатор(), ИмяРеквизита);
	Иначе
		ОбновитьГруппировкиИРеквизиты(Истина);
		УстановитьВидимостьИДоступность("ИзмененыГруппировки");
	КонецЕсли;
	
	ОтметитьНеактуальным();
	
КонецПроцедуры   

&НаКлиенте
Процедура Подключаемый_ГруппировкаПриИзменении(Элемент)
	
	ПриИзмененииГруппировкиРеквизита(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РеквизитПриИзменении(Элемент)
	
	ПриИзмененииГруппировкиРеквизита(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииГруппировкиРеквизита(ИмяЭлемента)
	
	Стр = СтрокаОписанияПоИмениЭлемента(ИмяЭлемента, ПоляНастроек);
	Если Стр=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПриИзмененииГруппировкиРеквизитаСервер(Стр.ПолучитьИдентификатор(), ИмяЭлемента);
	
	ОтметитьНеактуальным();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииГруппировкиРеквизитаСервер(Идентификатор, ИмяЭлемента)
	
	Стр = ПоляНастроек.НайтиПоИдентификатору(Идентификатор);
	Если Не ПроверитьСовместимостьДиаграммы(Стр.Поле) ИЛИ НЕ ПроверитьСовместимостьГруппировокКолонок(Стр.Поле) Тогда
		Для Каждого ОписаниеРеквизита Из Стр.Реквизиты Цикл
			ЭтаФорма[ОписаниеРеквизита.Ключ] = Ложь;
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Для Каждого ОписаниеРеквизита Из Стр.Реквизиты Цикл
		Значение = ЭтаФорма[ОписаниеРеквизита.Ключ];
		Прервать;
	КонецЦикла; 
	
	Если Стр.Тип=ТипРеквизит() Тогда
		СтрРодитель = Стр.ПолучитьРодителя();
		СтрРодитель.Заголовок = ЗаголовокГруппыПолей(СтрРодитель);
		ОбновитьЗаголовокЭлемента(СтрРодитель);
		ИмяГруппировки = СтрЗаменить(СтрРодитель.ИмяГруппы, "_Группа", "");
		Если Значение И НЕ ЭтаФорма[ИмяГруппировки] Тогда
			// Отображать группировку если выбрано хотя бы одно поле
			ЭтаФорма[ИмяГруппировки] = Истина;
		ИначеЕсли Не Значение Тогда
			// Скрыть группировку, если не выбраны поля
			Если Не ЕстьВыводимыеПоля(Стр.ПолучитьРодителя()) Тогда
				ЭтаФорма[ИмяГруппировки] = Ложь;
			КонецЕсли; 
		КонецЕсли; 
	ИначеЕсли Стр.Тип=ТипГруппировка() Тогда
		Группа = Элементы[ИмяЭлемента+"_Реквизиты"];
		УстановитьПодчиненныеПоля(Стр, Значение);
	КонецЕсли; 
	
	Если Стр.НестандартныйОбработчик Тогда
		ВыполнитьНестандартнуюОбработку(Стр.ПолучитьИдентификатор(), ИмяЭлемента);
	Иначе
		Если Значение И ПолеГруппировкиКолонок=Стр.Поле Тогда
			ПолеГруппировкиКолонок = "";
			ОбновитьГруппировкиИРеквизиты();
		ИначеЕсли Значение И ПолеСравнения=Стр.Поле Тогда
			ПолеСравнения = "";
			ПоказыватьАбсолютноеИзменение = Ложь;
			ПоказыватьОтносительноеИзменение = Ложь;
			ОбновитьГруппировкиИРеквизиты();
		Иначе
			ОбновитьГруппировкиИРеквизиты(Истина);
		КонецЕсли; 
		УстановитьВидимостьИДоступность(?(Стр.Тип=ТипРеквизит(), "ИзмененыРеквизиты", "ИзмененыГруппировки"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СместитьВверх(Элемент)
	
	ИмяРеквизита = СтрЗаменить(Элемент.Имя, "СместитьВверх", "");
	Стр = СтрокаОписанияПоИмениЭлемента(ИмяРеквизита, ПоляНастроек);
	ИдентификаторСтроки = Стр.ПолучитьИдентификатор();
	
	Если Стр.Тип=ТипГруппировка() Тогда
		Если СместитьГруппировку(ИдентификаторСтроки, -1) Тогда
			ПриИзмененииГруппировкиРеквизита(ИмяРеквизита);
		КонецЕсли; 
	КонецЕсли; 
	
	Если Стр.Тип=ТипРеквизит() Тогда
		Если СместитьРеквизит(ИдентификаторСтроки, -1) Тогда
			ПриИзмененииГруппировкиРеквизита(ИмяРеквизита);
		КонецЕсли; 
	КонецЕсли;
	
	Если Стр.Тип=ТипПоказатель() ИЛИ Стр.Тип=ТипГруппаПоказателей() Тогда
		Если СместитьПоказатель(ИдентификаторСтроки, -1) Тогда
			ПриИзмененииПоказателя(ИмяРеквизита);
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СместитьВниз(Команда)
	
	ИмяРеквизита = СтрЗаменить(Команда.Имя, "СместитьВниз", "");
	Стр = СтрокаОписанияПоИмениЭлемента(ИмяРеквизита, ПоляНастроек);
	ИдентификаторСтроки = Стр.ПолучитьИдентификатор();
	
	Если Стр.Тип=ТипГруппировка() Тогда
		Если СместитьГруппировку(ИдентификаторСтроки, 1) Тогда
			ПриИзмененииГруппировкиРеквизита(ИмяРеквизита);
		КонецЕсли; 
	КонецЕсли; 
	
	Если Стр.Тип=ТипРеквизит() Тогда
		Если СместитьРеквизит(ИдентификаторСтроки, 1) Тогда
			ПриИзмененииГруппировкиРеквизита(ИмяРеквизита);
		КонецЕсли; 
	КонецЕсли;
	
	Если Стр.Тип=ТипПоказатель() ИЛИ Стр.Тип=ТипГруппаПоказателей() Тогда
		Если СместитьПоказатель(ИдентификаторСтроки, 1) Тогда
			ПриИзмененииПоказателя(ИмяРеквизита);
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Показатели

&НаКлиенте
Процедура Подключаемый_ПоказательПриИзменении(Элемент)
	
	ПриИзмененииПоказателя(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПоказателя(ИмяЭлемента)
	
	Стр = СтрокаОписанияПоИмениЭлемента(ИмяЭлемента, ПоляНастроек);
	Если Стр=Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПриИзмененииПоказателяСервер(Стр.ПолучитьИдентификатор(), ИмяЭлемента);
	ОтметитьНеактуальным();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПоказателяСервер(Идентификатор, ИмяЭлемента)
	
	Стр = ПоляНастроек.НайтиПоИдентификатору(Идентификатор);
	Если Стр.НестандартныйОбработчик Тогда
		ВыполнитьНестандартнуюОбработку(Стр.ПолучитьИдентификатор(), ИмяЭлемента);
	Иначе
		СтрРодитель = Стр.ПолучитьРодителя();
		Если Не СтрРодитель=Неопределено Тогда
			Для Каждого ОписаниеРеквизита Из Стр.Реквизиты Цикл
				Значение = ЭтаФорма[ОписаниеРеквизита.Ключ];
				Прервать;
			КонецЦикла; 
			ИмяГруппировки = СтрЗаменить(СтрРодитель.ИмяГруппы, "_Группа", "");
			Если Значение И НЕ ЭтаФорма[ИмяГруппировки] Тогда
				// Отображать группировку если выбрано хотя бы одно поле
				ЭтаФорма[ИмяГруппировки] = Истина;
			ИначеЕсли Не Значение Тогда
				// Скрыть группировку, если не выбраны поля
				Если Не ЕстьВыводимыеПоля(Стр.ПолучитьРодителя()) Тогда
					ЭтаФорма[ИмяГруппировки] = Ложь;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
		Если Не ПолеСравнения=Неопределено Тогда
			// Для режима сравнения можно использовать только один показатель
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Тип", ТипПоказатель());
			СтруктураОтбора.Вставить("Создан", Истина);
			Строки = СтрокиДерева(ПоляНастроек, СтруктураОтбора, Истина);
			Для Каждого СтрПоказатель Из Строки Цикл
				Для Каждого ОписаниеЭлемента Из СтрПоказатель.Реквизиты Цикл
					Если Не ИмяЭлемента=ОписаниеЭлемента.Ключ Тогда
						ЭтаФорма[ОписаниеЭлемента.Ключ] = Ложь;
					КонецЕсли; 
				КонецЦикла; 
			КонецЦикла; 
		КонецЕсли;
		Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
		ИзменитьПоказатели();
		УстановитьВидимостьИДоступность("ИзмененыПоказатели");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ГруппаПоказателейПриИзменении(Элемент)
	
	ПриИзмененииГруппыПоказателей(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииГруппыПоказателей(ИмяЭлемента)
	
	Стр = СтрокаОписанияПоИмениЭлемента(ИмяЭлемента, ПоляНастроек);
	Если Стр=Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПриИзмененииГруппыПоказателейСервер(Стр.ПолучитьИдентификатор(), ИмяЭлемента);
	ОтметитьНеактуальным();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииГруппыПоказателейСервер(Идентификатор, ИмяЭлемента)
	
	Стр = ПоляНастроек.НайтиПоИдентификатору(Идентификатор);
	Для Каждого ОписаниеРеквизита Из Стр.Реквизиты Цикл
		Значение = ЭтаФорма[ОписаниеРеквизита.Ключ];
		Прервать;
	КонецЦикла; 
	Для Каждого СтрПоля Из Стр.ПолучитьЭлементы() Цикл
		Если СтрПоля.Тип=ТипПоказатель() Тогда
			Для Каждого ОписаниеРеквизита Из СтрПоля.Реквизиты Цикл
				ЭтаФорма[ОписаниеРеквизита.Ключ] = Значение;
			КонецЦикла; 
		КонецЕсли; 
	КонецЦикла;
	
	Если Стр.НестандартныйОбработчик Тогда
		ВыполнитьНестандартнуюОбработку(Стр.ПолучитьИдентификатор(), ИмяЭлемента);
	Иначе
		Если Не ПолеСравнения=Неопределено И КоличествоПоказателей()>1 Тогда
			ПолеСравнения = Неопределено;
		КонецЕсли;
		Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
		ИзменитьПоказатели();
		УстановитьВидимостьИДоступность("ИзмененыПоказатели");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - Отправить по почте
// 
// Параметры:
//  Команда	 - 	 - 
// 
&НаКлиенте
Процедура ОтправитьПоПочте(Команда)
	
	ОтображениеСостояния = Элементы.ОтчетТабличныйДокумент.ОтображениеСостояния;
	Если ОтображениеСостояния.Видимость = Истина
		И ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность Тогда
		
		ТекстВопроса = НСтр("ru='Отчет не сформирован. Сформировать?';en='Report not formed. To form'");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтправитьПоЭлектроннойПочтеЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);
        Возврат;
		
	КонецЕсли;
	
	ОтправитьПоЭлектроннойПочтеФрагмент();

КонецПроцедуры

&НаКлиенте
// Процедура - Отправить по электронной почте завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ОтправитьПоЭлектроннойПочтеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьНепосредственно();
	
	ОтправитьПоЭлектроннойПочтеФрагмент();
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Отправить по электронной почте фрагмент
//
Процедура ОтправитьПоЭлектроннойПочтеФрагмент()
	
	ТабличныеДокументы = Новый СписокЗначений;
	ТабличныеДокументы.Добавить(ЭтаФорма.ОтчетТабличныйДокумент, ЭтаФорма.ОтчетНаименованиеТекущегоВарианта);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТабличныеДокументы", ТабличныеДокументы);
	ПараметрыФормы.Вставить("Тема"              , ЭтаФорма.ОтчетНаименованиеТекущегоВарианта);
	ПараметрыФормы.Вставить("Заголовок"         , СтрШаблон(НСтр("ru = 'Отправка отчета ""%1"" по почте'"),ЭтаФорма.ОтчетНаименованиеТекущегоВарианта));
	ПараметрыФормы.Вставить("МассивПолучателей" , ПолучитьМассивКонтрагентовИзРезультата()); 
	
	ОткрытьФорму("ОбщаяФорма.ОтправкаТабличныхДокументовПоПочте", ПараметрыФормы, , );
	
КонецПроцедуры

// Функция - Получить массив контрагентов из результата
// 
// Возвращаемое значение:
//   - 
// 
&НаСервере
Функция ПолучитьМассивКонтрагентовИзРезультата()
	
	МассивКонтрагентов = Новый Массив;
	МассивДанныхКонтрагентов = Новый Массив;
	
	Если ЗначениеЗаполнено(ОтчетДанныеРасшифровки) Тогда
		ДанныеРасшифровкиХранилища = ПолучитьИзВременногоХранилища(ОтчетДанныеРасшифровки);
		Если ДанныеРасшифровкиХранилища <> Неопределено Тогда
			Для Каждого ЭлементДанныеРасшифровкиХранилища Из ДанныеРасшифровкиХранилища.Элементы Цикл
				Если ТипЗнч(ЭлементДанныеРасшифровкиХранилища) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
					Для Каждого ЭлементПоля Из ЭлементДанныеРасшифровкиХранилища.ПолучитьПоля() Цикл
						Если СтрНайти(Строка(ЭлементПоля.Значение), "Объект не найден") = 0
							И ((ПравоДоступа("Просмотр", Метаданные.Справочники.Контрагенты) И ТипЗнч(ЭлементПоля.Значение) = Тип("СправочникСсылка.Контрагенты")) 
							ИЛИ (ПравоДоступа("Просмотр", Метаданные.Справочники.Сотрудники) И ТипЗнч(ЭлементПоля.Значение) =  Тип("СправочникСсылка.Сотрудники"))) 
							И ЭлементПоля.Значение.ЭтоГруппа = Ложь И МассивКонтрагентов.Найти(ЭлементПоля.Значение) = Неопределено Тогда
							Если ЗначениеЗаполнено(ЭлементПоля.Значение) Тогда
								МассивКонтрагентов.Добавить(ЭлементПоля.Значение);
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
	Возврат МассивКонтрагентов;
	
КонецФункции

&НаСервере
// Функция, возварщает массив контрагентов из результата для пушей.
//
Функция ПолучитьМассивКонтрагентовИзРезультатаДляПушей()
	
	МассивКонтрагентов = Новый Массив;	
	Если ЗначениеЗаполнено(ОтчетДанныеРасшифровки) Тогда
		ДанныеРасшифровкиХранилища = ПолучитьИзВременногоХранилища(ОтчетДанныеРасшифровки);
		Если  ДанныеРасшифровкиХранилища <> Неопределено Тогда
			Для Каждого ЭлементДанныеРасшифровкиХранилища Из ДанныеРасшифровкиХранилища.Элементы Цикл
				Если ТипЗнч(ЭлементДанныеРасшифровкиХранилища) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
					Для Каждого ЭлементПоля Из ЭлементДанныеРасшифровкиХранилища.ПолучитьПоля() Цикл
						
						Контрагент = ЭлементПоля.Значение;
						Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") И Контрагент.ЭтоГруппа = Ложь И МассивКонтрагентов.Найти(Контрагент) = Неопределено Тогда
							МассивКонтрагентов.Добавить(Контрагент);
						КонецЕсли;
						
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат МассивКонтрагентов;
	
КонецФункции

&НаКлиенте
// Процедура - Отчет скомпоновать результат
// 
// Параметры:
//  Команда	 - 	 - 
// 
Процедура ОтчетСкомпоноватьРезультат(Команда)
	
	Если Не ПроверитьЗаполнениеПараметров() Тогда
		Возврат;
	КонецЕсли;  
	
	Если КлючОбъекта = "Отчет.АнализОплатПоВрачам" Тогда 
		ПриИзмененииВидаДиаграммы();
	КонецЕсли;	
	
	ОчиститьСообщения();	
	Сформировать();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Настроить отчет
// 
// Параметры:
//  Команда	 - 	 - 
// 
Процедура НастроитьОтчет(Команда)
	
	РедактироватьСКД();
	
КонецПроцедуры

&НаКлиенте
Процедура РаскрытьНаВесьЭкран(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Заголовок", Заголовок);
	ПараметрыОткрытия.Вставить("Результат", АдресХранилищаРезультата());
	
	ОткрытьФорму("ОбщаяФорма.ФормаПредпросмотраОтчета", ПараметрыОткрытия, ЭтаФорма);
	ТекущийЭлемент = Элементы.СтрокаОтбора;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	
	Список = СписокБыстрыхГруппировок();
	Если НастройкиОтчета.РазрешитьДобавлениеПрочихГруппировокСтрок Тогда
		Список.Добавить(Неопределено, НСтр("ru = 'Прочие поля'"),, БиблиотекаКартинок.Выбрать);
	КонецЕсли;
	Если Список.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	Если Список.Количество() = 1 Тогда
		ДобавитьСтрокуЗавершение(Список[0], Неопределено);
	Иначе
		Оповещение = Новый ОписаниеОповещения("ДобавитьСтрокуЗавершение", ЭтотОбъект);
		ПоказатьВыборИзМеню(Оповещение, Список, Элементы.ДобавитьСтроку);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКолонку(Команда)
	
	Список = СписокДополнительныхКолонок();
	Если Список.Количество()=1 Тогда
		ДобавитьКолонкуЗавершение(Список[0], Неопределено);
	Иначе
		Оповещение = Новый ОписаниеОповещения("ДобавитьКолонкуЗавершение", ЭтотОбъект);
		ПоказатьВыборИзМеню(Оповещение, Список, Элементы.ДобавитьКолонку);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФильтр(Команда)
	
	Список = СписокБыстрыхФильтров();
	Если НастройкиОтчета.РазрешитьДобавлениеПрочихФильтров Тогда
		Список.Добавить(Неопределено, НСтр("ru = 'Прочее'"),, БиблиотекаКартинок.Выбрать);
	КонецЕсли; 
	Если Список.Количество()=1 Тогда
		ДобавитьФильтрЗавершение(Список[0], Неопределено);
	Иначе
		Оповещение = Новый ОписаниеОповещения("ДобавитьФильтрЗавершение", ЭтотОбъект);
		ПоказатьВыборИзМеню(Оповещение, Список, Элементы.ДобавитьФильтр);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик команды "СоздатьЗаказПоставщику".
//
Процедура СоздатьЗаказПоставщику(Команда)
		
	Обеспечить("ЗаказПоставщику");
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик команды "СоздатьЗаказПоставщикуВУпаковкахПоУмолчанию"
// 
Процедура СоздатьЗаказПоставщикуВУпаковкахПоУмолчанию(Команда)
	
	Обеспечить("ЗаказПоставщикуВУпакПоУмолчанию");	
	
КонецПроцедуры 

&НаКлиенте
// Процедура - Обработчик команды "СоздатьПеремещениеЗапасов".
//
Процедура СоздатьПеремещениеЗапасов(Команда)
	
	Обеспечить("ПеремещениеЗапасов");

КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик команды "СоздатьПеремещениеЗапасовВУпакПоУмолчанию".
//
Процедура СоздатьПеремещениеЗапасовВУпакПоУмолчанию(Команда)
	
	Обеспечить("ПеремещениеЗапасовВУпакПоУмолчанию");
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////// 
// Подключаемые

&НаКлиенте
Процедура Подключаемый_Команда(Команда)
	// Механизмы расширения
	ПостояннаяКоманда = ПостоянныеКоманды.НайтиПоЗначению(Команда.Имя);
	Если ПостояннаяКоманда <> Неопределено И ЗначениеЗаполнено(ПостояннаяКоманда.Представление) Тогда
		МассивПодстрок = СтрРазделить(ПостояннаяКоманда.Представление, ".");
		КлиентскийМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль(МассивПодстрок[0]);
		Обработчик = Новый ОписаниеОповещения(МассивПодстрок[1], КлиентскийМодуль, Команда);
		ВыполнитьОбработкуОповещения(Обработчик, ЭтотОбъект);
	Иначе
		ОтчетыКлиентПереопределяемый.ОбработчикКоманды(ЭтотОбъект, Команда, Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Константы

&НаКлиентеНаСервереБезКонтекста
Функция ТипФильтр()
	
	Возврат "Фильтр";	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипПараметр()
	
	Возврат "Параметр";	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипПоказатель()
	
	Возврат "Показатель";	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипГруппаПоказателей()
	
	Возврат "ГруппаПоказателей";	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипГруппировка()
	
	Возврат "Группировка";	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипРеквизит()
	
	Возврат "Реквизит";	
	
КонецФункции


#КонецОбласти 

#Область КонтекстныйВызовСервера

#КонецОбласти 

#Область Период

&НаСервере
Процедура ПериодПриИзмененииСервер()
	
	ОбновитьПредставлениеПериода();
	ОбновитьОтображениеОтметокФильтров();
	ОбновитьЗаголовокОтчета();
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Сохранение периода по умолчанию для варианта
	Если Не ПустаяСтрока(НастройкиОтчета.ИдентификаторВарианта) И НЕ НастройкиОтчета.РежимПериода="БезПериода" И НЕ НастройкиОтчета.Контекстный Тогда
		ХранилищеСистемныхНастроек.Сохранить("ПериодОтчета", НастройкиОтчета.ИдентификаторВарианта, Период);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить представление периода
// 
Процедура ОбновитьПредставлениеПериода()
	
	Если Не Элементы.ПредставлениеПериода.Видимость Тогда
		Возврат;
	КонецЕсли; 
	
	Если НастройкиОтчета.РежимПериода = "ЗаПериод" Тогда
		
		Если Не ЗначениеЗаполнено(Период.ДатаНачала) И НЕ ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
			ПредставлениеПериода = НСтр("ru = 'за все время'");
		ИначеЕсли Элементы.ПредставлениеПериода.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет Тогда
			ПредставлениеПериода = НСтр("ru = 'за '")+НРег(ПредставлениеПериода(Отчет.Период.ДатаНачала, КонецДня(Период.ДатаОкончания)));
		Иначе
			ПредставлениеПериода = НРег(ПредставлениеПериода(НачалоДня(Период.ДатаНачала), ?(ЗначениеЗаполнено(Период.ДатаОкончания), КонецДня(Период.ДатаОкончания), Период.ДатаОкончания)));
		КонецЕсли;
		
	ИначеЕсли НастройкиОтчета.РежимПериода = "НаДату" Тогда
		
		Если Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
			ПредставлениеПериода = НСтр("ru = 'актуальные данные'");
		Иначе
			ПредставлениеПериода = Формат(Период.ДатаОкончания, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ФормаИНастройки

&НаСервере
Процедура ОбновитьЗаголовокОтчета()
	
	Если Не ПустаяСтрока(НастройкиОтчета.НаименованиеВарианта) Тогда
		ЗаголовокОтчета = НастройкиОтчета.НаименованиеВарианта;
	Иначе
		ЗаголовокОтчета = НастройкиОтчета.Наименование;
	КонецЕсли;
	Если РежимРасшифровки Тогда
		ЗаголовокОтчета = ЗаголовокОтчета + " (" + НСтр("ru = 'Расшифровка'") + ")";
	КонецЕсли; 
	Заголовок = ЗаголовокОтчета;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступность(Событие = "")
	
	ПолнаяИнициализация			= ПустаяСтрока(Событие);
	ИзмененыГруппировки			= (Событие = "ИзмененыГруппировки"			ИЛИ ПустаяСтрока(Событие));
	ИзмененыПоказатели			= (Событие = "ИзмененыПоказатели"			ИЛИ ПустаяСтрока(Событие));
	ИзмененыПериодыСравнения	= (Событие = "ИзмененыПериодыСравнения" 	ИЛИ ПустаяСтрока(Событие));
	ИзмененРежимРедактирования	= (Событие = "ИзмененРежимРедактирования" 	ИЛИ ПустаяСтрока(Событие));
	ИзмененВидДиаграммы			= (Событие = "ИзмененВидДиаграммы"			ИЛИ ПустаяСтрока(Событие));
	ИзмененаТочкаДиаграммы		= (Событие = "ИзмененаТочкаДиаграммы"		ИЛИ ПустаяСтрока(Событие));
	
	Если ПолнаяИнициализация Тогда
		Элементы.Вариант.Видимость							= (Элементы.Вариант.СписокВыбора.Количество()>1) 
																	И НЕ РежимРасшифровки И НастройкиОтчета.ИспользуетХранилищеВариантов;
		Элементы.ГруппаСтроки.Видимость						= НастройкиОтчета.ПоказыватьГруппуСтрокиНаФормеОтчета;
		Элементы.ГруппаКолонки.Видимость					= НастройкиОтчета.ПоказыватьГруппуКолонкиНаФормеОтчета;
		Элементы.ГруппаПоказателиЭлементыИКнопки.Видимость	= НастройкиОтчета.ПоказыватьПоказателиНаФормеОтчета;
		Элементы.ГруппаКомандыПоказатели.Видимость			= НастройкиОтчета.ПоказыватьПоказателиНаФормеОтчета;
		Элементы.ПолеГруппировкиКолонок.Видимость			= НастройкиОтчета.ПоказыватьГруппировкиКолонокНаФормеОтчета
																	И НастройкиОтчета.ПоказыватьГруппуКолонкиНаФормеОтчета;
		Элементы.ГруппаСравнение.Видимость					= НастройкиОтчета.ИспользоватьСравнение И НастройкиОтчета.РежимПериода="ЗаПериод";
		Элементы.ЗаголовокПолеСравнения.Видимость			= Элементы.ГруппаСравнение.Видимость;
		Элементы.ГруппаФильтры.Видимость					= НастройкиОтчета.ПоказыватьГруппуФильтрыНаФормеОтчета;
		Элементы.ЗапомнитьНастройки.Видимость				= НЕ НастройкиОтчета.Контекстный И НастройкиОтчета.ИспользуетХранилищеВариантов;
		Элементы.ДобавитьФильтр.Видимость					= НастройкиОтчета.РазрешитьДобавлениеПрочихФильтров;
		
		// Диаграммы
		Элементы.ГруппаНастройкиДиаграмм.Видимость			= ?(КлючОбъекта = "Отчет.АнализОплатПоВрачам", Ложь,НастройкиОтчета.ПоказыватьНастройкиДиаграммыНаФормеОтчета);
		Элементы.ГруппаДиаграммыСерииИТочки.Видимость		= НЕ НастройкиОтчета.НестандартнаяДиаграмма;
		
		Элементы.ПредставлениеПериода.Видимость				= НЕ (НастройкиОтчета.РежимПериода="БезПериода");
		Элементы.ПредставлениеПериода.Заголовок				= ?(НастройкиОтчета.РежимПериода="НаДату", НСтр("ru = 'На дату'"), 	НСтр("ru = 'Период'"));
	КонецЕсли;
	
	Если ИзмененВидДиаграммы Тогда
		НастройкиОтчета.ВыводитьТолькоТочки     = (ВидДиаграммы = ТипДиаграммы.Круговая ИЛИ ВидДиаграммы = ТипДиаграммы.КруговаяОбъемная);
		Элементы.ДиаграммаТочки.Видимость		= ЗначениеЗаполнено(ВидДиаграммы);
		Элементы.ДиаграммаЗначения.Видимость	= ЗначениеЗаполнено(ВидДиаграммы) И НастройкиОтчета.ИзменятьЗначенияДиаграммы;
		Если Не НастройкиОтчета.ВыводитьТолькоТочки И ДиаграммаТочки = ДиаграммаСерии Тогда
			ДиаграммаТочки = Неопределено;
		КонецЕсли;
		Элементы.ДекорацияВидДиаграммыКартинка.Картинка = КартинкаДиаграммы(ВидДиаграммы);
	КонецЕсли;
	
	Если ИзмененВидДиаграммы ИЛИ ИзмененаТочкаДиаграммы Тогда
		Элементы.ДиаграммаСерии.Видимость			= ЗначениеЗаполнено(ВидДиаграммы) И НЕ НастройкиОтчета.ВыводитьТолькоТочки И ЗначениеЗаполнено(ДиаграммаТочки);
		Элементы.ДекорацияЗаголовокСерии.Видимость	= Элементы.ДиаграммаСерии.Видимость;
	КонецЕсли; 
	
	Если ИзмененыПоказатели ИЛИ ИзмененыПериодыСравнения Тогда
		КоличествоПоказателей = КоличествоПоказателей();
		Элементы.ГруппаВариантыСравнения.Видимость = ((КоличествоПоказателей = 1 ИЛИ НЕ НастройкиОтчета.ПоказыватьПоказателиНаФормеОтчета) И ТипЗнч(ПолеСравнения)=Тип("ПеречислениеСсылка.Периодичность") И НастройкиОтчета.ИспользоватьДополнительныеРежимыСравнения);
	КонецЕсли;
	
	Если ИзмененыПоказатели Тогда
		Элементы.ГруппаСравнение.Доступность = ((КоличествоПоказателей = 1 ИЛИ НЕ НастройкиОтчета.ПоказыватьПоказателиНаФормеОтчета));
		Элементы.ЗаголовокПолеСравнения.Доступность = Элементы.ГруппаСравнение.Доступность;
		Элементы.РежимРедактированияКолонок.Видимость = (КоличествоПоказателей > 1);
		Элементы.ДобавитьКолонку.Видимость = (КоличествоСкрытыхПоказателей() > 0);
		Элементы.ОтступПоказатели.Видимость = НЕ Элементы.ДобавитьКолонку.Видимость;
	КонецЕсли;
	
	Если ИзмененыГруппировки Тогда
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Тип", ТипГруппировка());
		СтруктураОтбора.Вставить("Создан", Истина);
		Строки = СтрокиДерева(ПоляНастроек, СтруктураОтбора);
		Элементы.РежимРедактированияСтрок.Видимость = (СтруктураОтбора.Количество()>1);
	КонецЕсли; 
	
	Если ИзмененРежимРедактирования Тогда
		ОбрабатываемыеТипы = Новый Массив;
		ОбрабатываемыеТипы.Добавить(ТипГруппировка());
		ОбрабатываемыеТипы.Добавить(ТипРеквизит());
		ОбрабатываемыеТипы.Добавить(ТипПоказатель());
		ОбрабатываемыеТипы.Добавить(ТипГруппаПоказателей());
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Тип", ОбрабатываемыеТипы);
		Строки = СтрокиДерева(ПоляНастроек, СтруктураОтбора, Истина);
		Для Каждого Стр Из Строки Цикл
			Если Стр.Тип=ТипГруппировка() ИЛИ Стр.Тип=ТипРеквизит() Тогда
				ГруппаКоманд = Элементы[СтрЗаменить(Стр.ИмяГруппы, "_Группа", "_ГруппаКоманды")];
				ГруппаКоманд.Видимость = РежимРедактированияСтрок;
			ИначеЕсли Стр.Тип=ТипПоказатель() ИЛИ Стр.Тип=ТипГруппаПоказателей() Тогда 
				ГруппаКоманд = Элементы[СтрЗаменить(Стр.ИмяГруппы, "_Группа", "_ГруппаКоманды")];
				ГруппаКоманд.Видимость = РежимРедактированияКолонок;
			КонецЕсли;
			ОбновитьЗаголовокЭлемента(Стр);
		КонецЦикла; 
		Элементы.РежимРедактированияСтрок.Картинка = ?(РежимРедактированияСтрок, БиблиотекаКартинок.РежимРедактированияСпискаЭлементовАктивно, БиблиотекаКартинок.РежимРедактированияСпискаЭлементов);
		Элементы.РежимРедактированияКолонок.Картинка = ?(РежимРедактированияКолонок, БиблиотекаКартинок.РежимРедактированияСпискаЭлементовАктивно, БиблиотекаКартинок.РежимРедактированияСпискаЭлементов);
	КонецЕсли;
	
	Если ПолнаяИнициализация Тогда
		
		Элементы.СтраницыНастройки.Видимость = 
		Элементы.Вариант.Видимость
		ИЛИ Элементы.ГруппаПараметрыЭлементы.ПодчиненныеЭлементы.Количество() > 0
		ИЛИ Элементы.ГруппаСтрокиЭлементы.ПодчиненныеЭлементы.Количество() > 0
		ИЛИ Элементы.ГруппаПоказателиЭлементы.ПодчиненныеЭлементы.Количество() > 0
		ИЛИ Элементы.ГруппаДополнительныеНастройки.ПодчиненныеЭлементы.Количество() > 0
		ИЛИ Элементы.ГруппаФильтрЭлементы.ПодчиненныеЭлементы.Количество() > 0
		ИЛИ Элементы.ГруппаСравнение.Видимость
		ИЛИ Элементы.ПолеГруппировкиКолонок.Видимость;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокЭлемента(Стр)
	
	Если Стр.Тип<>ТипГруппировка() И Стр.Тип<>ТипРеквизит() И Стр.Тип<>ТипПоказатель() И Стр.Тип<>ТипГруппаПоказателей() Тогда
		Возврат;
	КонецЕсли;
	Если Стр.Тип=ТипРеквизит() Тогда
		ШиринаЗаголовка = 23-?(РежимРедактированияСтрок, 7, 0);
	ИначеЕсли Стр.Тип=ТипГруппировка() Тогда 
		ШиринаЗаголовка = 28-?(РежимРедактированияСтрок, 7, 0)-?(Стр.ДополнительныеПараметры.Свойство("ТипГруппировки"), 4, 0);
	ИначеЕсли Стр.Тип=ТипПоказатель() И НЕ Стр.ПолучитьРодителя()=Неопределено Тогда
		ШиринаЗаголовка = 23-?(РежимРедактированияКолонок, 7, 0);
	Иначе
		ШиринаЗаголовка = 28-?(РежимРедактированияКолонок, 7, 0);
	КонецЕсли; 
	Для Каждого ОписаниеЭлемента Из Стр.Элементы Цикл
		Элемент = Элементы[ОписаниеЭлемента.Ключ];
		Если СтрДлина(Стр.Заголовок)<=ШиринаЗаголовка Тогда
			Элемент.Заголовок = Стр.Заголовок;
			Элемент.Подсказка = "";
		Иначе
			Элемент.Заголовок = Лев(Стр.Заголовок, ШиринаЗаголовка-2)+"...";
			Элемент.Подсказка = Стр.Заголовок;
		КонецЕсли; 
	КонецЦикла; 	
	
КонецПроцедуры

&НаСервере
Функция КоличествоПоказателей()
	
	КоличествоПоказателей = 0;
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Тип", ТипПоказатель());
	СтруктураОтбора.Вставить("Создан", Истина);
	Строки = СтрокиДерева(ПоляНастроек, СтруктураОтбора, Истина);
	Для Каждого Стр Из Строки Цикл
		Для Каждого ОписаниеЭлемента Из Стр.Элементы Цикл
			Если ЭтаФорма[ОписаниеЭлемента.Ключ] Тогда
				КоличествоПоказателей = КоличествоПоказателей+1;
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла;  
	Возврат КоличествоПоказателей;
	
КонецФункции

&НаСервере
Функция КоличествоСкрытыхПоказателей()
	
	Список = СписокДополнительныхКолонок();
	Возврат Список.Количество();
	
КонецФункции

&НаСервере
// Процедура - Заполнить команды выбора вариантов
// 
Процедура ЗаполнитьКомандыВыбораВариантов()
	
	Элементы.Вариант.СписокВыбора.Очистить();
	
	ТаблицаВариантовОтчета = ТаблицаВариантов(); 
	
	Для Каждого СтрокаТ Из ТаблицаВариантовОтчета Цикл
		Элементы.Вариант.СписокВыбора.Добавить(СтрокаТ.Ссылка, СтрокаТ.Наименование);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Функция - Таблица вариантов
// 
// Параметры:
//  ТолькоВидимые	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ТаблицаВариантов(ТолькоВидимые = Истина)
	
	Если ТипЗнч(НастройкиОтчета.ОтчетСсылка)=Тип("Строка") Тогда
		// Для внешних отчетов добавляются варианты из схемы
		Результат = Новый ТаблицаЗначений;
		Результат.Колонки.Добавить("Ссылка");
		Результат.Колонки.Добавить("КлючВарианта");
		Результат.Колонки.Добавить("Наименование");
		Для Каждого ЭлементСписка Из НастройкиОтчета.ПредопределенныеВарианты Цикл
			СтрокаТаблицы = Результат.Добавить();
			СтрокаТаблицы.Наименование = ЭлементСписка.Представление;
			СтрокаТаблицы.КлючВарианта = ЭлементСписка.Значение;
		КонецЦикла;
	ИначеЕсли ТолькоВидимые Тогда
		// Заполнение списка вариантов на форме
		ТекущийПользовательПараметр = Пользователи.ТекущийПользователь();
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Отчет", НастройкиОтчета.ОтчетСсылка);
		Запрос.Параметры.Вставить("ОтключенныеПредопределенныеВарианты"	, ОтчетыПовтИсп.ПредопределенныеВариантыНедоступныеПоФО());
		Запрос.Параметры.Вставить("ТекущийПользователь"					, ТекущийПользовательПараметр);
		Запрос.УстановитьПараметр("РольТекущегоПользователя"			, ТекущийПользовательПараметр.РольПользователя);
		Запрос.УстановитьПараметр("ДоступноАдминистрированиеОтчетов"	, (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("АдминистрированиеОтчетов")));
		Запрос.Параметры.Вставить("Контекстный"							, НастройкиОтчета.Контекстный);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВариантыОтчетов.Ссылка КАК Ссылка,
		|	ВариантыОтчетов.КлючВарианта КАК КлючВарианта,
		|	ВариантыОтчетов.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиВариантовОтчетов КАК ДоступныеВариантыОтчетовДляПользователя
		|		ПО (ДоступныеВариантыОтчетовДляПользователя.Вариант = ВариантыОтчетов.Ссылка)
		|			И (ДоступныеВариантыОтчетовДляПользователя.Подсистема = ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка))
		|			И (ДоступныеВариантыОтчетовДляПользователя.Пользователь ССЫЛКА Справочник.Сотрудники)
		|			И (ДоступныеВариантыОтчетовДляПользователя.Пользователь = &ТекущийПользователь)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиВариантовОтчетов КАК ДоступныеВариантыОтчетовДляРолейПользователей
		|		ПО (ДоступныеВариантыОтчетовДляРолейПользователей.Вариант = ВариантыОтчетов.Ссылка)
		|			И (ДоступныеВариантыОтчетовДляРолейПользователей.Подсистема = ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка))
		|			И (ДоступныеВариантыОтчетовДляРолейПользователей.Пользователь ССЫЛКА Перечисление.РольПользователя)
		|			И (ДоступныеВариантыОтчетовДляРолейПользователей.Пользователь = &РольТекущегоПользователя)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиВариантовОтчетов КАК ДоступныеВариантыОтчетовПоУмолчанию
		|		ПО (ДоступныеВариантыОтчетовПоУмолчанию.Вариант = ВариантыОтчетов.Ссылка)
		|			И (ДоступныеВариантыОтчетовПоУмолчанию.Подсистема = ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка))
		|			И (ДоступныеВариантыОтчетовПоУмолчанию.Пользователь В (ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка), НЕОПРЕДЕЛЕНО))
		|ГДЕ
		|	ВариантыОтчетов.Отчет = &Отчет
		|	И НЕ ВариантыОтчетов.ПометкаУдаления
		|	И НЕ ВариантыОтчетов.ПредопределенныйВариант В (&ОтключенныеПредопределенныеВарианты)
		|	И (ЕСТЬNULL(ВариантыОтчетов.ПредопределенныйВариант.Включен, ИСТИНА)
		|			ИЛИ &Контекстный)
		|	И (НЕ ВариантыОтчетов.ТолькоДляАвтора
		|			ИЛИ ВариантыОтчетов.Автор = &ТекущийПользователь
		|			ИЛИ ВариантыОтчетов.Автор = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))
		|	И ВЫБОР
		|			КОГДА &ДоступноАдминистрированиеОтчетов
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ДоступныеВариантыОтчетовДляПользователя.Вариант ЕСТЬ NULL
		|						ТОГДА ВЫБОР
		|								КОГДА ДоступныеВариантыОтчетовДляРолейПользователей.Вариант ЕСТЬ NULL
		|									ТОГДА ЕСТЬNULL(ДоступныеВариантыОтчетовПоУмолчанию.Видимость, ЛОЖЬ)
		|								ИНАЧЕ ДоступныеВариантыОтчетовДляРолейПользователей.Видимость
		|							КОНЕЦ
		|					ИНАЧЕ ДоступныеВариантыОтчетовДляПользователя.Видимость
		|				КОНЕЦ
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВариантыДополнительныхОтчетов.Ссылка,
		|	ВариантыДополнительныхОтчетов.ИдентификаторКоманды,
		|	ВариантыДополнительныхОтчетов.Наименование
		|ИЗ
		|	Справочник.ВариантыДополнительныхОтчетов КАК ВариантыДополнительныхОтчетов
		|ГДЕ
		|	ВариантыДополнительныхОтчетов.Отчет = &Отчет
		|	И НЕ ВариантыДополнительныхОтчетов.ПометкаУдаления
		|	И (НЕ ВариантыДополнительныхОтчетов.ТолькоДляАвтора
		|			ИЛИ ВариантыДополнительныхОтчетов.Автор = &ТекущийПользователь
		|			ИЛИ ВариантыДополнительныхОтчетов.Автор = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование,
		|	КлючВарианта";
		Результат = Запрос.Выполнить().Выгрузить();
	Иначе
		// Для получения настроек вариантов используется выборка предопределенных
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Отчет", НастройкиОтчета.ОтчетСсылка);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВариантыОтчетов.Ссылка КАК Ссылка,
		|	ВариантыОтчетов.КлючВарианта КАК КлючВарианта,
		|	ВариантыОтчетов.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
		|ГДЕ
		|	ВариантыОтчетов.Отчет = &Отчет
		|	И НЕ ВариантыОтчетов.ПометкаУдаления
		|	И НЕ ВариантыОтчетов.Пользовательский
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВариантыДополнительныхОтчетов.Ссылка,
		|	ВариантыДополнительныхОтчетов.ИдентификаторКоманды,
		|	ВариантыДополнительныхОтчетов.Наименование
		|ИЗ
		|	Справочник.ВариантыДополнительныхОтчетов КАК ВариантыДополнительныхОтчетов
		|ГДЕ
		|	ВариантыДополнительныхОтчетов.Отчет = &Отчет
		|	И НЕ ВариантыДополнительныхОтчетов.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование,
		|	КлючВарианта";
		Результат = Запрос.Выполнить().Выгрузить();
	КонецЕсли; 
	Результат.Свернуть("Ссылка, КлючВарианта, Наименование");
	Результат.Сортировать("Наименование Возр, КлючВарианта Возр");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура НастройкиПечатиСохранить()
	
	ЗаполнитьЗначенияСвойств(НастройкиОтчета.Печать, ОтчетТабличныйДокумент);
	
КонецПроцедуры

&НаСервере
Процедура НастройкиПечатиВосстановить()
	
	ЗаполнитьЗначенияСвойств(ОтчетТабличныйДокумент, НастройкиОтчета.Печать);
	
КонецПроцедуры

&НаСервере
Функция НавигационнаяСсылкаВарианта(НастройкиОтчета)
	
	Если Не ЗначениеЗаполнено(НастройкиОтчета.ВариантСсылка) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НастройкиОтчета.Контекстный Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипЗнч(НастройкиОтчета.ВариантСсылка) <> Тип("СправочникСсылка.ВариантыОтчетов")  
		И ТипЗнч(НастройкиОтчета.ВариантСсылка) <> Тип("СправочникСсылка.ВариантыДополнительныхОтчетов") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ПолучитьНавигационнуюСсылку(НастройкиОтчета.ВариантСсылка);
	
КонецФункции

#КонецОбласти

#Область ПроверкаСКД

&НаСервере
Процедура ПроверитьСовместомостьВарианта()
	
	ДополнительныеСвойства = Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	
	// Не более одной вложенной группировки для колонок таблицы
	КоличествоГруппировокКолонок = КоличествоГруппировокТаблицыРекурсивно(Отчет.КомпоновщикНастроек.Настройки.Структура);
	ЕстьСоставныеГруппировкиКолонок = ЕстьСоставныеГруппировкиКолонок(Отчет.КомпоновщикНастроек.Настройки.Структура);
	Если Не ДополнительныеСвойства.Свойство("Сравнение") И КоличествоГруппировокКолонок=2 Тогда
		// "Заводская" настройка
		КоличествоПоказателей = КоличествоПоказателейСКД();
		Если КоличествоПоказателей=1 Тогда
			// Можно использовать режим сравнения
			КоличествоГруппировокКолонок = КоличествоГруппировокКолонок-1;
		КонецЕсли; 
	ИначеЕсли ДополнительныеСвойства.Свойство("Сравнение") И ЗначениеЗаполнено(ДополнительныеСвойства.Сравнение) Тогда
		// Без учета группировки сравнения
		КоличествоГруппировокКолонок = КоличествоГруппировокКолонок-1;
	КонецЕсли; 
	Если КоличествоГруппировокКолонок>1 ИЛИ ЕстьСоставныеГруппировкиКолонок Тогда
		НастройкиОтчета.Вставить("ИспользоватьСравнение", Ложь);
		НастройкиОтчета.Вставить("ПоказыватьГруппировкиКолонокНаФормеОтчета", Ложь);
	КонецЕсли;
	
	// Отсутствуют вложенные настройки выбранных полей
	Если ЕстьВложенныеНастройкиВыбора() Тогда
		НастройкиОтчета.Вставить("ПоказыватьГруппуКолонкиНаФормеОтчета", Ложь);
	КонецЕсли;
	
	// Диаграммы
	Если Не ЭлементСтуктурыДиаграмма(Отчет.КомпоновщикНастроек.Настройки.Структура)=Неопределено Тогда
		НастройкиОтчета.Вставить("ЭтоДиаграмма", Истина);
	Иначе
		НастройкиОтчета.Вставить("ЭтоДиаграмма", Ложь);
	КонецЕсли; 
	НастройкиОтчета.Вставить("НестандартнаяДиаграмма", НестандартнаяДиаграмма(Отчет.КомпоновщикНастроек.Настройки));
	
	Если Отчет.КомпоновщикНастроек.Настройки.Структура.Количество()>1 Тогда
		КоличествоДиаграмм = 0;
		КоличествоГруппировок = 0;
		Для Каждого ЭлементСтруктуры Из Отчет.КомпоновщикНастроек.Настройки.Структура Цикл
			Если Не ЭлементСтруктуры.Использование Тогда
				Продолжить;
			КонецЕсли; 
			Если ТипЗнч(ЭлементСтруктуры)=Тип("ТаблицаКомпоновкиДанных") ИЛИ ТипЗнч(ЭлементСтруктуры)=Тип("ГруппировкаКомпоновкиДанных") Тогда
				КоличествоГруппировок = КоличествоГруппировок+1;
			ИначеЕсли ТипЗнч(ЭлементСтруктуры)=Тип("ДиаграммаКомпоновкиДанных") Тогда
				КоличествоДиаграмм = КоличествоДиаграмм+1;
			КонецЕсли; 
		КонецЦикла;
		Если КоличествоГруппировок>1 Тогда
			НастройкиОтчета.ПоказыватьГруппуСтрокиНаФормеОтчета = Ложь;
		КонецЕсли; 
		Если КоличествоДиаграмм>1 Тогда
			НастройкиОтчета.Вставить("НестандартнаяДиаграмма", Истина);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция КоличествоГруппировокТаблицыРекурсивно(Структура, Уровень = 0)
	
	Для Каждого ЭлементСтруктуры Из Структура Цикл
		Если ТипЗнч(ЭлементСтруктуры)=Тип("ГруппировкаКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(ЭлементСтруктуры)=Тип("ТаблицаКомпоновкиДанных") Тогда
			Уровень = Макс(Уровень, КоличествоГруппировокТаблицыРекурсивно(ЭлементСтруктуры.Колонки));
		КонецЕсли;
		Если ТипЗнч(ЭлементСтруктуры)=Тип("ГруппировкаТаблицыКомпоновкиДанных") Тогда
			Уровень = КоличествоГруппировокТаблицыРекурсивно(ЭлементСтруктуры.Структура, Уровень+1);
		КонецЕсли; 
	КонецЦикла; 
	Возврат Уровень;
	
КонецФункции

&НаСервере
// Функция - Есть вложенные настройки выбора
// 
// Параметры:
//  ЭлементыСтруктуры	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ЕстьВложенныеНастройкиВыбора(ЭлементыСтруктуры = Неопределено)
	
	Если ЭлементыСтруктуры = Неопределено Тогда
		ЭлементыСтруктуры = Отчет.КомпоновщикНастроек.Настройки.Структура;
	КонецЕсли; 
	
	Для Каждого Элемент Из ЭлементыСтруктуры Цикл
		
		Если Не ТипЗнч(Элемент) = Тип("ДиаграммаКомпоновкиДанных") Тогда
			
			ЭлементыВыбора = ?(ТипЗнч(Элемент) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных"), Элемент.Настройки.Выбор.Элементы, Элемент.Выбор.Элементы);     
			
			Для Каждого ЭлементВыбора Из ЭлементыВыбора Цикл
				
				Если Не ТипЗнч(ЭлементВыбора) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
					Возврат Истина;
				КонецЕсли; 
				
			КонецЦикла;
			
		КонецЕсли;
		
		Результат = Ложь;
		
		Если ТипЗнч(Элемент) = Тип("ГруппировкаКомпоновкиДанных")
			Или ТипЗнч(Элемент) = Тип("ГруппировкаТаблицыКомпоновкиДанных")
			Или ТипЗнч(Элемент) = Тип("ГруппировкаДиаграммыКомпоновкиДанных")
			Или ТипЗнч(Элемент) = Тип("НастройкиКомпоновкиДанных") Тогда
			
			Результат = Результат Или ЕстьВложенныеНастройкиВыбора(Элемент.Структура);
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("ТаблицаКомпоновкиДанных") Тогда
			
			Результат = Результат Или ЕстьВложенныеНастройкиВыбора(Элемент.Строки);
			Результат = Результат Или ЕстьВложенныеНастройкиВыбора(Элемент.Колонки);
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("ДиаграммаКомпоновкиДанных") Тогда
			
			Результат = Результат Или ЕстьВложенныеНастройкиВыбора(Элемент.Серии);
			Результат = Результат Или ЕстьВложенныеНастройкиВыбора(Элемент.Точки);
			
		КонецЕсли;
		
		Если Результат Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат Ложь;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭлементСтуктурыДиаграмма(ЭлементыСтруктуры, Создать = Ложь)
	
	Для Каждого ЭлементСтруктуры Из ЭлементыСтруктуры Цикл
		Если ТипЗнч(ЭлементСтруктуры) = Тип("ДиаграммаКомпоновкиДанных") Тогда
			Возврат ЭлементСтруктуры;
		КонецЕсли; 
	КонецЦикла;
	Если Создать Тогда
		ЭлементСтруктуры = ?(ЭлементыСтруктуры.Количество() > 0, ЭлементыСтруктуры.Вставить(0, Тип("ДиаграммаКомпоновкиДанных")), ЭлементыСтруктуры.Добавить(Тип("ДиаграммаКомпоновкиДанных")));
		ЭлементСтруктуры.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		Возврат ЭлементСтруктуры;
	КонецЕсли; 
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ЭлементСтуктурыГруппировкаТаблица(ЭлементыСтруктуры)
	
	Для Каждого ЭлементСтруктуры Из ЭлементыСтруктуры Цикл
		Если ТипЗнч(ЭлементСтруктуры)=Тип("ТаблицаКомпоновкиДанных") ИЛИ ТипЗнч(ЭлементСтруктуры)=Тип("ГруппировкаКомпоновкиДанных") Тогда
			Возврат ЭлементСтруктуры;
		КонецЕсли; 
	КонецЦикла;
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция НестандартнаяДиаграмма(Настройки)
	
	НастройкиОтчета.Вставить("ВыводитьТолькоТочки", Ложь);
	
	НастройкиОтчета.Вставить("ИзменятьЗначенияДиаграммы", Истина);
	
	ЭлементДиаграмма = ЭлементСтуктурыДиаграмма(Настройки.Структура);
	Если ЭлементДиаграмма=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЭлементДиаграмма.Выбор.Элементы.Количество()=1 И ТипЗнч(ЭлементДиаграмма.Выбор.Элементы[0])=Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
		НастройкиОтчета.Вставить("ИзменятьЗначенияДиаграммы", Ложь);
	Иначе
		ЭлементыВыбора = ЭлементДиаграмма.Выбор.Элементы;
		КоличествоЭлементовВыбора = 0;
		Для Каждого ЭлементВыбора Из ЭлементыВыбора Цикл
			Если ТипЗнч(ЭлементВыбора)=Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			Если ТипЗнч(ЭлементВыбора)=Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
				НастройкиОтчета.Вставить("ИзменятьЗначенияДиаграммы", Ложь);
				Прервать;
			КонецЕсли;
			КоличествоЭлементовВыбора = КоличествоЭлементовВыбора+1;
			Если КоличествоЭлементовВыбора>1 Тогда
				НастройкиОтчета.Вставить("ИзменятьЗначенияДиаграммы", Ложь);
				Прервать;
			КонецЕсли;
			ДоступноеПоле = Настройки.ДоступныеПоляВыбора.НайтиПоле(ЭлементВыбора.Поле);
			Если ДоступноеПоле=Неопределено ИЛИ НЕ ДоступноеПоле.Ресурс Тогда
				НастройкиОтчета.Вставить("ИзменятьЗначенияДиаграммы", Ложь);
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	
	Тип = ТипДиаграммыЭлементаСтруктуры(ЭлементДиаграмма);
	
	Если Тип=ТипДиаграммы.Круговая ИЛИ Тип=ТипДиаграммы.КруговаяОбъемная Тогда
		НастройкиОтчета.Вставить("ВыводитьТолькоТочки", Истина);
		Если ЭлементДиаграмма.Серии.Количество()>1 ИЛИ ЭлементДиаграмма.Точки.Количество()>1 Тогда
			Возврат Истина;
		КонецЕсли;
		Серии = ?(ЭлементДиаграмма.Серии.Количество()=0, ЭлементДиаграмма.Точки, ЭлементДиаграмма.Серии);
		Точки = ?(ЭлементДиаграмма.Точки.Количество()=0, ЭлементДиаграмма.Серии, ЭлементДиаграмма.Точки);
	ИначеЕсли ЭлементДиаграмма.Серии.Количество()>1 ИЛИ ЭлементДиаграмма.Точки.Количество()>1 Тогда
		Возврат Истина;
	Иначе
		Серии = ЭлементДиаграмма.Серии;
		Точки = ЭлементДиаграмма.Точки;
	КонецЕсли;
	
	Если Серии.Количество()=0 И Точки.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПоляСерий = ?(Серии.Количество()=0, Неопределено, Серии[0].ПоляГруппировки.Элементы);
	ПоляТочек = ?(Точки.Количество()=0, Неопределено, Точки[0].ПоляГруппировки.Элементы);
	
	Если Не ПоляСерий=Неопределено Тогда
		Если Не ПоляСерий.Количество()=1 Тогда
			Возврат Истина;
		КонецЕсли; 
		Если Не ТипЗнч(ПоляСерий[0])=Тип("ПолеГруппировкиКомпоновкиДанных") Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли; 
	Если Не ПоляТочек=Неопределено Тогда
		Если Не ПоляТочек.Количество()=1 Тогда
			Возврат Истина;
		КонецЕсли; 
		Если Не ТипЗнч(ПоляТочек[0])=Тип("ПолеГруппировкиКомпоновкиДанных") Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти 

#Область ИнициализаияСКД

&НаСервере
Процедура МодифицироватьСхему(СхемаКомпоновкиДанных)
	
	// Служебные модификации схемы
	ОтчетыСервер.СтандартизироватьСхему(СхемаКомпоновкиДанных);
	ОтчетыСервер.ДобавитьВычисляемыеПоля(СхемаКомпоновкиДанных);
	
	// Запрет непосредственного использования поля ДинамическийПериод 
	Поле = ОтчетыСервер.ПолеСхемы(СхемаКомпоновкиДанных, "ДинамическийПериод");
	Если Поле<>Неопределено И НЕ ДинамическийПериодВГруппировках() Тогда
		Ограничения = Поле.ОграничениеИспользования;
		Ограничения.Группировка = Истина;
		Ограничения.Поле = Истина;
		Ограничения.Порядок = Истина;
		Ограничения.Условие = Истина;
	КонецЕсли; 
	
	// Если Константы.УчетПоКомпании.Получить() Тогда
	// 	Для Каждого Набор Из СхемаКомпоновкиДанных.НаборыДанных Цикл
	// 		Поле = Набор.Поля.Найти("Организация");
	// 		Если Поле=Неопределено ИЛИ НЕ Тип(Поле)=Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") Тогда
	// 			Продолжить;
	// 		КонецЕсли;
	// 		Ограничения = Поле.ОграничениеИспользования;
	// 		Ограничения.Группировка = Истина;
	// 		Ограничения.Порядок = Истина;
	// 		Ограничения.Условие = Истина;
	// 		Ограничения = Поле.ОграничениеИспользованияРеквизитов;
	// 		Ограничения.Группировка = Истина;
	// 		Ограничения.Порядок = Истина;
	// 		Ограничения.Условие = Истина;
	// 	КонецЦикла; 
	// КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ДинамическийПериодВГруппировках(ЭлементыСтруктуры = Неопределено)
	
	Если ЭлементыСтруктуры=Неопределено Тогда
		ЭлементыСтруктуры = Отчет.КомпоновщикНастроек.Настройки.Структура;
	КонецЕсли; 
	Для Каждого Элемент Из ЭлементыСтруктуры Цикл
		Если ТипЗнч(Элемент)=Тип("ГруппировкаКомпоновкиДанных") 
			ИЛИ ТипЗнч(Элемент)=Тип("ГруппировкаТаблицыКомпоновкиДанных") 
			ИЛИ ТипЗнч(Элемент)=Тип("ГруппировкаДиаграммыКомпоновкиДанных") Тогда
			Для Каждого Поле Из Элемент.ПоляГруппировки.Элементы Цикл
				Если Строка(Поле.Поле)="ДинамическийПериод" Тогда
					Возврат Истина;
				КонецЕсли; 
			КонецЦикла; 
		ИначеЕсли ТипЗнч(Элемент)=Тип("ДиаграммаКомпоновкиДанных") Тогда
			Если ДинамическийПериодВГруппировках(Элемент.Точки) Тогда
				Возврат Истина;
			КонецЕсли;
			Если ДинамическийПериодВГруппировках(Элемент.Серии) Тогда
				Возврат Истина;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Элемент)=Тип("ТаблицаКомпоновкиДанных") Тогда
			Если ДинамическийПериодВГруппировках(Элемент.Строки) Тогда
				Возврат Истина;
			КонецЕсли;
			Если ДинамическийПериодВГруппировках(Элемент.Колонки) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
	Возврат Ложь;
	
КонецФункции

&НаСервере
// Процедура - Определить параметры отчета по умолчанию
// 
Процедура ОпределитьПараметрыОтчетаПоУмолчанию()
	
	// Сброс значений фиксированных полей формы перед разбором СКД
	ПолеГруппировкиКолонок = "";
	ПолеСравнения = Неопределено;
	ПоказыватьАбсолютноеИзменение = Ложь;
	ПоказыватьОтносительноеИзменение = Ложь;
	РежимРедактированияКолонок = Ложь;
	РежимРедактированияСтрок = Ложь;
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	ОтчетыСервер.ИнициализироватьНастройкиОтчета(НастройкиОтчета);
	
	ДополнительныеСвойства = Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	Для каждого Свойство Из ДополнительныеСвойства Цикл
		НастройкиОтчета.Вставить(Свойство.Ключ, Свойство.Значение);
	КонецЦикла; 
	
	НастройкиВариантов = Новый Соответствие;
	Для Каждого Итератор Из ТаблицаВариантов(Ложь) Цикл
		НастройкиВариантов[Итератор.КлючВарианта] = Новый Структура;
		ОтчетыСервер.ИнициализироватьНастройкиВарианта(НастройкиВариантов[Итератор.КлючВарианта]);
	КонецЦикла;
	Если НЕ НастройкиОтчета.Внешний
		И НастройкиОтчета.ЭтоОтчетСтоматология Тогда 
		ОтчетОбъект.ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов);
	КонецЕсли;	
	Ключ = НастройкиОтчета.КлючВарианта;
	Если НЕ НастройкиВариантов.Получить(Ключ)=Неопределено Тогда
		ОбъединитьНастройки(НастройкиОтчета, НастройкиВариантов[Ключ], Истина);
	Иначе
		СтруктураНастроек = Новый Структура;
		ОтчетыСервер.ИнициализироватьНастройкиВарианта(СтруктураНастроек);
		ОбъединитьНастройки(НастройкиОтчета, СтруктураНастроек, Ложь);
	КонецЕсли;
	
	Если НЕ НастройкиОтчета.Свойство("РежимПериода") Тогда
		НастройкиОтчета.Вставить("РежимПериода", ОтчетыСервер.РежимОтображенияПериода(ОтчетОбъект, НастройкиОтчета.КлючВарианта));
	КонецЕсли; 
	Если НЕ НастройкиОтчета.Свойство("ИспользоватьСравнение") Тогда
		НастройкиОтчета.Вставить("ИспользоватьСравнение", ПризнакИспользованияСравнения());
	КонецЕсли; 
	Если НЕ НастройкиОтчета.Свойство("ИспользоватьПериодичность") Тогда
		НастройкиОтчета.Вставить("ИспользоватьПериодичность", ПризнакИспользованияПериодичности(ОтчетОбъект));
	КонецЕсли; 
	
	ЭлементыПорядка = Отчет.КомпоновщикНастроек.Настройки.Порядок.Элементы;
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("СортироватьПоПоказателям", ПорядокНеЗадан(ЭлементыПорядка));

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыИОтборыРасшифровки(ОтчетОбъект)
	
	// Фиксированный отбор
	ПараметрыКД = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ОтборыКД = Отчет.КомпоновщикНастроек.Настройки.Отбор;
	ПараметрыПериодов = ОтчетыСервер.ПараметрыПериодовСКД(ОтчетОбъект);
	Обычный = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	
	// Восстановление периода из настроек
	Если НЕ ПустаяСтрока(НастройкиОтчета.ИдентификаторВарианта) И НЕ ПараметрыПериодов.Период = Неопределено И НастройкиОтчета.ПользовательскиеНастройки = Неопределено Тогда
		ПериодИзНастроек = ХранилищеСистемныхНастроек.Загрузить("ПериодОтчета", НастройкиОтчета.ИдентификаторВарианта + ?(НастройкиОтчета.Контекстный, "_Контекстный", ""));
		Если ПериодИзНастроек = Неопределено И НЕ ПустаяСтрока(НастройкиОтчета.КлючВарианта) Тогда
			ПериодИзНастроек = ХранилищеСистемныхНастроек.Загрузить("ПериодОтчета", Строка(НастройкиОтчета.КлючВарианта) + ?(НастройкиОтчета.Контекстный, "_Контекстный", ""));
		КонецЕсли; 
		Если ТипЗнч(ПериодИзНастроек) = Тип("СтандартныйПериод") Тогда
			Если ТипЗнч(ПараметрыПериодов.Период.Значение) = Тип("СтандартныйПериод") Тогда
				ПараметрыПериодов.Период.Значение = ПериодИзНастроек;
				ПараметрыПериодов.Период.Использование = Истина;
			ИначеЕсли ТипЗнч(ПараметрыПериодов.Период.Значение) = Тип("СтандартнаяДатаНачала") Тогда
				ПараметрыПериодов.Период.Значение = Новый СтандартнаяДатаНачала(ПериодИзНастроек.ДатаОкончания);
				ПараметрыПериодов.Период.Использование = Истина;
			ИначеЕсли ТипЗнч(ПараметрыПериодов.Период.Значение) = Тип("Дата") Тогда
				ПараметрыПериодов.Период.Значение = ПериодИзНастроек.ДатаОкончания;
				ПараметрыПериодов.Период.Использование = Истина;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	Для Каждого КлючИЗначение Из ФормаПараметры.Отбор Цикл
		Имя = КлючИЗначение.Ключ;
		Значение = КлючИЗначение.Значение;
		
		// Установка периода
		Если (Имя = "НачалоПериода" ИЛИ Имя = "КонецПериода") И НЕ ПараметрыПериодов.Период = Неопределено И ТипЗнч(ПараметрыПериодов.Период.Значение) = Тип("СтандартныйПериод") Тогда
			Если Имя = "НачалоПериода" Тогда
				ПараметрыПериодов.Период.Значение.ДатаНачала = Значение;
			ИначеЕсли Имя = "КонецПериода" Тогда
				ПараметрыПериодов.Период.Значение.ДатаОкончания = Значение;
			КонецЕсли;
			Если НЕ ПараметрыПериодов.Период.Использование Тогда
				ПараметрыПериодов.Период.Использование = Истина;
			КонецЕсли; 
			Продолжить;
		ИначеЕсли Имя = "КонецПериода" И НЕ ПараметрыПериодов.Период = Неопределено И ТипЗнч(ПараметрыПериодов.Период.Значение) = Тип("Дата") Тогда
			ПараметрыПериодов.Период.Значение = Значение;
			Если НЕ ПараметрыПериодов.Период.Использование Тогда
				ПараметрыПериодов.Период.Использование = Истина;
			КонецЕсли; 
			Продолжить;
		КонецЕсли; 
		
		Если ТипЗнч(Значение) = Тип("ФиксированныйМассив") Тогда
			Значение = Новый Массив(Значение);
		КонецЕсли;
		Если ТипЗнч(Значение) = Тип("Массив") Тогда
			Список = Новый СписокЗначений;
			Список.ЗагрузитьЗначения(Значение);
			Значение = Список;
		КонецЕсли;
		
		// Установка параметров
		ПараметрСхемы = ОтчетОбъект.СхемаКомпоновкиДанных.Параметры.Найти(Имя);
		ПараметрКД = ПараметрыКД.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(Имя));
		Если НЕ ПараметрСхемы = Неопределено И ПараметрСхемы.ОграничениеИспользования Тогда
			Продолжить;
		КонецЕсли; 
		Если ТипЗнч(ПараметрКД) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПараметрКД.Использование    = Истина;
			ПараметрКД.Значение         = Значение;
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Значение)=Тип("Структура") Тогда
			ВидСравненияКД = Значение.ВидСравнения;
			Значение = Значение.Значение;
		Иначе
			Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
				ВидСравненияКД = ВидСравненияКомпоновкиДанных.ВСписке;
			Иначе
				ВидСравненияКД = ВидСравненияКомпоновкиДанных.Равно;
			КонецЕсли;
		КонецЕсли;
		
		// Установка отборов
		ДоступноеПолеКД = ОтборыКД.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(Имя));
		Если ТипЗнч(ДоступноеПолеКД) = Тип("ДоступноеПолеОтбораКомпоновкиДанных") Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборыКД, Имя, Значение, ВидСравненияКД, , Истина, Обычный, "");
			Продолжить;
		КонецЕсли;
		
		// Фильтр не установлен
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось установить фиксированный отбор ""%1"".'"), Имя);
		ЗаписьЖурналаРегистрации(
		"ФормаОтчетаСтоматология.УстановитьПараметрыИОтборыРасшифровки",
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.Справочники.ВариантыОтчетов,
		НастройкиОтчета.ВариантСсылка,
		ТекстОшибки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВыбратьКолонкиРасшифровки()
	
	// Колонки расшифровки
	Если ЗначениеЗаполнено(ФормаПараметры.Колонки) Тогда
		Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
		Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		Если ТипЗнч(ФормаПараметры.Колонки)=Тип("Строка") Тогда
			МассивКолонок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ФормаПараметры.Колонки);
		Иначе
			МассивКолонок = ФормаПараметры.Колонки;
		КонецЕсли; 
		Для Каждого ИмяКолонки Из МассивКолонок Цикл
			Колонка = Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			Колонка.Поле = Новый ПолеКомпоновкиДанных(ИмяКолонки);
			Колонка.Использование = Истина;
		КонецЦикла;
		ФормаПараметры = Новый Структура(ФормаПараметры);
		ФормаПараметры.Вставить("Колонки", "");
		ФормаПараметры = Новый ФиксированнаяСтруктура(ФормаПараметры);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Определить параметры периодов СКД
// 
// Параметры:
//  ОтчетОбъект	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ОпределитьПараметрыПериодовСКД(ОтчетОбъект)
	
	ПараметрПериод = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтПериод");
	
	Если ПараметрПериод = Неопределено Тогда
		ПараметрПериод = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	КонецЕсли;
	
	ПараметрНачалоПериода       = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	ПараметрКонецПериода        = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	ПараметрДанныхПериодичность = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Периодичность");
	
	ПараметрСхемыКонецПериода = ОтчетОбъект.СхемаКомпоновкиДанных.Параметры.Найти("КонецПериода");
	ПараметрСхемыПериод       = ОтчетОбъект.СхемаКомпоновкиДанных.Параметры.Найти("СтПериод");
	
	Если ПараметрСхемыПериод = Неопределено Тогда
		ПараметрСхемыПериод = ОтчетОбъект.СхемаКомпоновкиДанных.Параметры.Найти("Период");
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("Период"         , ПараметрПериод);
	Результат.Вставить("НачалоПериода"  , ПараметрНачалоПериода);
	Результат.Вставить("КонецПериода"   , ПараметрКонецПериода);
	Результат.Вставить("Периодичность"  , ПараметрДанныхПериодичность);	
	Результат.Вставить("КонецПериодаСКД", ПараметрСхемыКонецПериода);
	Результат.Вставить("ПериодСКД"      , ПараметрСхемыПериод);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПризнакИспользованияСравнения()
	
	Если Не НастройкиОтчета.ИспользоватьСравнение Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПризнакИспользованияПериодичности(ОтчетОбъект)
	
	Если Не НастройкиОтчета.ИспользоватьСравнение Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если Не НастройкиОтчета.ИспользоватьСравнение Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если Не НастройкиОтчета.РежимПериода = "ЗаПериод" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыПериодов = ОпределитьПараметрыПериодовСКД(ОтчетОбъект);
	
	Если ПараметрыПериодов.Периодичность=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
// Функция - Режим отображения периода
// 
// Параметры:
//  ОтчетОбъект	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция РежимОтображенияПериода(ОтчетОбъект)
	
	ПараметрыПериодов = ОпределитьПараметрыПериодовСКД(ОтчетОбъект);
	
	Если ПараметрыПериодов.Период = Неопределено Тогда
		Возврат "БезПериода";
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыПериодов.Период.Значение) = Тип("СтандартныйПериод") Тогда
		
		Если ПараметрыПериодов.КонецПериода = Неопределено 
			Или ПараметрыПериодов.КонецПериодаСКД = Неопределено Тогда
			
			Возврат "ЗаПериод";
		КонецЕсли;
		
		Если ПараметрыПериодов.КонецПериодаСКД.ВключатьВДоступныеПоля 
			И Не ПустаяСтрока(ПараметрыПериодов.КонецПериода.ИдентификаторПользовательскойНастройки) 
			И ПараметрыПериодов.КонецПериода.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ Тогда
			
			Возврат "НаДату";		
		КонецЕсли;
		
		Возврат "ЗаПериод";
		
	ИначеЕсли ТипЗнч(ПараметрыПериодов.Период.Значение) = Тип("Дата") 
		Или ТипЗнч(ПараметрыПериодов.Период.Значение) = Тип("СтандартнаяДатаНачала") Тогда
		
		Если Не ПараметрыПериодов.ПериодСКД=Неопределено 
			И Не  ПараметрыПериодов.ПериодСКД.ОграничениеИспользования Тогда
			
			Возврат "НаДату";
		КонецЕсли; 
		
		Если ПараметрыПериодов.КонецПериода = Неопределено Тогда
			Возврат "БезПериода";
		КонецЕсли;
		
		Если ПараметрыПериодов.КонецПериодаСКД <> Неопределено 
			И Не ПараметрыПериодов.КонецПериодаСКД.ОграничениеИспользования Тогда
			
			Возврат "НаДату";
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат "БезПериода";
	
КонецФункции

&НаСервере
Функция ПорядокНеЗадан(ЭлементыПорядка)
	
	Если ЭлементыПорядка.Количество()=0 Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Если ЭлементыПорядка.Количество()=1 И ТипЗнч(ЭлементыПорядка[0])=Тип("АвтоЭлементПорядкаКомпоновкиДанных") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти 

#Область ФоновыеЗадания

&НаСервере
Функция ФоновоеЗаданиеЗапустить()
	
	ОбновитьДополнительныйСвойстваСКД();
	
	Если Отчет.КомпоновщикНастроек.Настройки.Структура.Количество()=0 Тогда
		ПоказатьОшибкиФормирования(НСтр("ru = 'Не выбрано ни одной группировки'"));
		Возврат Неопределено;
	КонецЕсли; 
	
	ДопСвойства = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;
	
	ФормированиеПриОткрытии = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопСвойства, "ФормированиеПриОткрытии", Ложь);
	Если Не ПроверитьЗаполнение() Тогда
		Если ФормированиеПриОткрытии Тогда
			ТекстОшибки = "";
			Сообщения = ПолучитьСообщенияПользователю(Истина);
			Для Каждого Сообщение Из Сообщения Цикл
				ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", ";" + Символы.ПС + Символы.ПС) + Сообщение.Текст;
			КонецЦикла;
			ПоказатьОшибкиФормирования(ТекстОшибки);
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	
	ОтчетТабличныйДокумент.Очистить();
	ОбновитьСортировку();
	ОбновитьПараметрыПериода();
	
	ОбновитьПараметрыПрочихПериодов();
	
	// Запуск фонового задания
	ДопСвойства.Вставить("КлючВарианта", КлючТекущегоВарианта);
	
	КомпоновщикНастроекНастройки = Отчет.КомпоновщикНастроек.Настройки;
		
	ПараметрыФормированияОтчета = Новый Структура;
	ПараметрыФормированияОтчета.Вставить("СсылкаВарианта",              НастройкиОтчета.ВариантСсылка);
	ПараметрыФормированияОтчета.Вставить("СсылкаОтчета",                НастройкиОтчета.ОтчетСсылка);
	ПараметрыФормированияОтчета.Вставить("КлючВарианта",                КлючТекущегоВарианта);
	ПараметрыФормированияОтчета.Вставить("НастройкиКД",                 Отчет.КомпоновщикНастроек.Настройки);
	ПараметрыФормированияОтчета.Вставить("ФиксированныеНастройкиКД",    Отчет.КомпоновщикНастроек.ФиксированныеНастройки);
	ПараметрыФормированияОтчета.Вставить("ПользовательскиеНастройкиКД", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);	
	
	ИнформацияОбОшибке = Неопределено;
	Попытка
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыВыполнения.ЗапуститьВФоне = Истина;
		
		РезультатФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(
			"ВариантыОтчетов.СформироватьОтчетВФоне",
			ПараметрыФормированияОтчета,
			ПараметрыВыполнения);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
	КонецПопытки;
	ДопСвойства.Удалить("КлючВарианта");
	Если ИнформацияОбОшибке <> Неопределено Тогда
		ПоказатьОшибкиФормирования(ПоляПредставлениеОшибки(ИнформацияОбОшибке));
		Возврат Неопределено;
	КонецЕсли;
	
	Если РезультатФоновогоЗадания.Статус = "Выполнено" Тогда
		
		ФоновоеЗаданиеЗагрузитьРезультат(РезультатФоновогоЗадания);
		
	ИначеЕсли РезультатФоновогоЗадания.Статус = "Ошибка" Тогда
		
		ПоказатьОшибкиФормирования(РезультатФоновогоЗадания);
		
	ИначеЕсли РезультатФоновогоЗадания.Статус = "Выполняется" Тогда
		
		ОтображениеСостояния = Элементы.ОтчетТабличныйДокумент.ОтображениеСостояния;
		ОтображениеСостояния.Видимость                      = Истина;
		ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
		ОтображениеСостояния.Картинка                       = БиблиотекаКартинок.ДлительнаяОперация48;
		ОтображениеСостояния.Текст                          = НСтр("ru = 'Отчет формируется...'");
		
	КонецЕсли;
	
	Возврат РезультатФоновогоЗадания;

КонецФункции

&НаСервереБезКонтекста
Процедура ФоновоеЗаданиеОтменить(ФоновоеЗаданиеИдентификатор)
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ФоновоеЗаданиеИдентификатор);
КонецПроцедуры

&НаСервере
Процедура ФоновоеЗаданиеЗагрузитьРезультат(РезультатФоновогоЗадания)
	
	Если НЕ ЭтоАдресВременногоХранилища(РезультатФоновогоЗадания.АдресРезультата) Тогда
		Возврат;
	КонецЕсли; 
	
	РезультатФормирования = ПолучитьИзВременногоХранилища(РезультатФоновогоЗадания.АдресРезультата);
	
	НастройкиПечатиСохранить();
	Если ТипЗнч(РезультатФормирования) = Тип("Структура")
		И РезультатФормирования.Свойство("ТабличныйДокумент")
		И ТипЗнч(РезультатФормирования.ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
		ОтчетТабличныйДокумент = РезультатФормирования.ТабличныйДокумент;
	Иначе
		ЗаписьЖурналаРегистрации("Форма отчета",УровеньЖурналаРегистрации.Ошибка,,,""+ЭтотОбъект.ПредставлениеТекущегоВарианта+ЭтотОбъект.ПредставлениеПериода,);
		ВОзврат;
	КонецЕсли;
	НастройкиПечатиВосстановить();
	
	Если ЗначениеЗаполнено(ОтчетДанныеРасшифровки) И ЭтоАдресВременногоХранилища(ОтчетДанныеРасшифровки) Тогда
		УдалитьИзВременногоХранилища(ОтчетДанныеРасшифровки);
	КонецЕсли;
	ОтчетДанныеРасшифровки = ПоместитьВоВременноеХранилище(РезультатФормирования.Расшифровка, УникальныйИдентификатор);
	
	ОтображениеСостояния = Элементы.ОтчетТабличныйДокумент.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Ложь;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	ОтображениеСостояния.Картинка                       = Новый Картинка;
	ОтображениеСостояния.Текст                          = "";
	
	УдалитьИзВременногоХранилища(РезультатФоновогоЗадания.АдресРезультата);

КонецПроцедуры

#КонецОбласти 

#Область ФормированиеОтчета

&НаКлиенте
Процедура ОтметитьНеактуальным()
	
	ОтображениеСостояния = Элементы.ОтчетТабличныйДокумент.ОтображениеСостояния;
	ОтображениеСостояния.Видимость = Истина;
	Если ФормаПараметры.ЭтоМобильныйКлиент Тогда
		ОтображениеСостояния.Текст = НСтр("ru = 'Отчет не сформирован. Нажмите ""Сформировать"" в заголовке формы для получения отчета.'");
	Иначе
		ОтображениеСостояния.Текст = НСтр("ru = 'Отчет не сформирован. Нажмите ""Сформировать"" (F5) для получения отчета.'");
	КонецЕсли;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Сформировать
// 
Процедура Сформировать()
	
	ЗаголовокОтчета = ОтчетыКлиентСервер.Заголовок(
	НастройкиОтчета.НаименованиеВарианта,
	НастройкиОтчета.РежимПериода,
	Период.ДатаНачала,
	Период.ДатаОкончания,
	ПредставлениеПериода);  
	
	Если КлючОбъекта = "Отчет.ОтчетПоВыручке" Тогда
		ПараметрКасса = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Касса"); 
		Касса = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ПараметрКасса.Значение, "Наименование");				
		ЗаголовокОтчета = Касса + ": " + ЗаголовокОтчета;
	КонецЕсли;
	
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("Заголовок", ЗаголовокОтчета);
	
	Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Новый ПользовательскиеНастройкиКомпоновкиДанных);
	
	Если НастройкиОтчета.ФормироватьНепосредственно Тогда
		СформироватьНепосредственно();
		ОперацииПослеФормирования();
	Иначе
		РезультатФоновогоЗадания = ФоновоеЗаданиеЗапустить();
		Если РезультатФоновогоЗадания = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		Если РезультатФоновогоЗадания.Статус = "Ошибка" Тогда
			ПоказатьОшибкиФормирования(РезультатФоновогоЗадания);
		ИначеЕсли РезультатФоновогоЗадания.Статус <> "Выполняется" Тогда 
			ОперацииПослеФормирования();
		Иначе
			Обработчик = Новый ОписаниеОповещения("ФоновоеЗаданиеВыполнено", ЭтотОбъект, Истина);
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
			ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатФоновогоЗадания, Обработчик, ПараметрыОжидания);
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ФоновоеЗаданиеВыполнено(Результат, ЗагрузитьРезультатФормированияОтчета) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если Результат.Статус = "Выполнено" Тогда 
		ФоновоеЗаданиеЗагрузитьРезультат(Результат);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПоказатьОшибкиФормирования(Результат);
	КонецЕсли;
	
	ОперацииПослеФормирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацииПослеФормирования()
	
	// Сворачивание группировок отчета
	Если Не РежимРасшифровки Тогда
		СвернутьГруппировки(); 
	КонецЕсли; 
		
	ОтображатьКоманды = ПолучитьМассивКонтрагентовИзРезультата().Количество() > 0;
		
КонецПроцедуры

&НаКлиенте
Процедура СвернутьГруппировки()
	
	КоличествоГруппировок = КоличествоГруппировокРекурсивно(Отчет.КомпоновщикНастроек.Настройки.Структура);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Тип", ТипГруппировка());
	Строки = СтрокиДерева(ПоляНастроек, СтруктураОтбора);
	РазвернутьГруппировок = 0;
	Для Каждого Стр Из Строки Цикл
		Если Стр.ДополнительныеПараметры.Свойство("Развернуть") И Стр.ДополнительныеПараметры.Развернуть Тогда
			РазвернутьГруппировок = РазвернутьГруппировок+1;
		Иначе
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	Если НастройкиОтчета.Свойство("УровеньГруппировкиСтрок") И ЗначениеЗаполнено(НастройкиОтчета.УровеньГруппировкиСтрок) Тогда
		КоличествоИтераций = КоличествоГруппировок.Строк-НастройкиОтчета.УровеньГруппировкиСтрок+1;
	Иначе
		КоличествоИтераций = КоличествоГруппировок.Строк-РазвернутьГруппировок;
	КонецЕсли; 
	Для ии = 1 По КоличествоИтераций Цикл
		ОтчетТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(КоличествоГруппировок.Строк-ии);
	КонецЦикла; 
	Если НастройкиОтчета.Свойство("УровеньГруппировкиКолонок") И ЗначениеЗаполнено(НастройкиОтчета.УровеньГруппировкиКолонок) Тогда
		КоличествоИтераций = КоличествоГруппировок.Колонок-НастройкиОтчета.УровеньГруппировкиКолонок+1;
	Иначе
		КоличествоИтераций = КоличествоГруппировок.Колонок;
	КонецЕсли; 
	Для ии = 1 По КоличествоИтераций Цикл
		ОтчетТабличныйДокумент.ПоказатьУровеньГруппировокКолонок(КоличествоГруппировок.Колонок-ии);
	КонецЦикла;
	
	Если НЕ НастройкиОтчета.Свойство("ФиксироватьКолонки") 
		ИЛИ НЕ ЗначениеЗаполнено(НастройкиОтчета.ФиксироватьКолонки) 
		ИЛИ ФормаПараметры.ЭтоМобильныйКлиент Тогда
		ОтчетТабличныйДокумент.ФиксацияСлева = 0;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция КоличествоГруппировокРекурсивно(Элементы, Результат = Неопределено, ТекущийУровень = 0, Строки = Истина)
	
	Если Результат = Неопределено Тогда
		Результат = Новый Структура("Строк, Колонок", 0, 0);
	КонецЕсли;
	
	Для Каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент)=Тип("ТаблицаКомпоновкиДанных") Тогда
			КоличествоГруппировокРекурсивно(Элемент.Строки, Результат, ТекущийУровень, Истина);
			КоличествоГруппировокРекурсивно(Элемент.Колонки, Результат, ТекущийУровень, Ложь);
		ИначеЕсли ТипЗнч(Элемент)=Тип("ГруппировкаТаблицыКомпоновкиДанных") ИЛИ ТипЗнч(Элемент)=Тип("ГруппировкаКомпоновкиДанных") Тогда
			Если Элемент.Структура.Количество()>0 Тогда
				КоличествоГруппировокРекурсивно(Элемент.Структура, Результат, ТекущийУровень+1, Строки);
			Иначе
				Если Строки И Результат.Строк<ТекущийУровень Тогда
					Результат.Строк = ТекущийУровень+1;
				ИначеЕсли Не Строки И Результат.Колонок<ТекущийУровень Тогда
					Результат.Колонок = ТекущийУровень+1;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СформироватьНепосредственно()
	
	ОбновитьДополнительныйСвойстваСКД();
	
	Если Отчет.КомпоновщикНастроек.Настройки.Структура.Количество() = 0 Тогда
		ПоказатьОшибкиФормирования(НСтр("ru = 'Не выбрано ни одной группировки'"));
		Возврат;
	КонецЕсли; 
	
	ДопСвойства = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;
	
	// Формирование отчета.
	ДопСвойства.Вставить("КлючВарианта", КлючТекущегоВарианта);
	НастройкиПечатиСохранить();
	ИнформацияОбОшибке = Неопределено;
	
	Попытка
		
		ОтчетТабличныйДокумент.Очистить();
		ОбновитьСортировку();
		ОбновитьПараметрыПериода();
		ОбновитьПараметрыПрочихПериодов();
		СкомпоноватьРезультат(РежимКомпоновкиРезультата.Фоновый);
		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
	КонецПопытки;
	
	ДопСвойства.Удалить("КлючВарианта");
	НастройкиПечатиВосстановить();
	
	Если ИнформацияОбОшибке <> Неопределено Тогда
		ПоказатьОшибкиФормирования(ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПоляПредставлениеОшибки(Знач ИнформацияОбОшибке)
	
	Результат = Новый Структура;
	КраткоеПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	ПодробноеПредставлениеОшибки = НСтр("ru = 'Ошибка при формировании:'") + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	Если ПустаяСтрока(КраткоеПредставлениеОшибки) Тогда
		КраткоеПредставлениеОшибки = ПодробноеПредставлениеОшибки;
	КонецЕсли;
	Результат.Вставить("КраткоеПредставлениеОшибки", КраткоеПредставлениеОшибки);
	Результат.Вставить("ПодробноеПредставлениеОшибки", ПодробноеПредставлениеОшибки);
	Возврат Результат;
	
КонецФункции 

&НаСервере
Процедура ПоказатьОшибкиФормирования(ИнформацияОбОшибке)
	
	Если ТипЗнч(ИнформацияОбОшибке) = Тип("ИнформацияОбОшибке") Тогда
		ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ПодробноеПредставлениеОшибки = НСтр("ru = 'Ошибка при формировании:'") + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		Если ПустаяСтрока(ОписаниеОшибки) Тогда
			ОписаниеОшибки = ПодробноеПредставлениеОшибки;
		КонецЕсли;
	Иначе
		ОписаниеОшибки = ИнформацияОбОшибке;
		ПодробноеПредставлениеОшибки = "";
	КонецЕсли;
	
	ОтображениеСостояния = Элементы.ОтчетТабличныйДокумент.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Истина;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	ОтображениеСостояния.Картинка                       = Новый Картинка;
	ОтображениеСостояния.Текст                          = ОписаниеОшибки;
	
	Если Не ПустаяСтрока(ПодробноеПредставлениеОшибки) Тогда
		Уровень = УровеньЖурналаРегистрации.Предупреждение;
		Если НастройкиОтчета.Свойство("ВариантСсылка") Тогда
			ВариантыОтчетов.ЗаписатьВЖурнал(Уровень, ПодробноеПредставлениеОшибки, НастройкиОтчета.ВариантСсылка);
		ИначеЕсли Параметры.Свойство("Ключ") Тогда
			ВариантыОтчетов.ЗаписатьВЖурнал(Уровень, ПодробноеПредставлениеОшибки, Параметры.Ключ);
		ИначеЕсли Параметры.Свойство("Отчет") Тогда
			ВариантыОтчетов.ЗаписатьВЖурнал(Уровень, ПодробноеПредставлениеОшибки, ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Параметры.Отчет));
		Иначе
			ВариантыОтчетов.ЗаписатьВЖурнал(Уровень, ПодробноеПредставлениеОшибки);
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СкопироватьСтруктуруРекурсивно(Источник, Приемник, СхемаКомпоновкиДанных, СкрытьСравнение = Ложь)
	
	Для Каждого ЭлементИсточник Из Источник Цикл
		Если ТипЗнч(ЭлементИсточник)=Тип("ГруппировкаКомпоновкиДанных") ИЛИ ТипЗнч(ЭлементИсточник)=Тип("ГруппировкаТаблицыКомпоновкиДанных") Тогда
			Если ТипЗнч(Приемник)=Тип("КоллекцияЭлементовСтруктурыТаблицыКомпоновкиДанных") Тогда
				ЭлементПриемник = Приемник.Добавить();
			Иначе
				ЭлементПриемник = Приемник.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			КонецЕсли; 
			ЭлементПриемник.Использование = ЭлементИсточник.Использование;
			СкопироватьВыборРекурсивно(ЭлементИсточник.Выбор.Элементы, ЭлементПриемник.Выбор.Элементы);
			Для Каждого ПолеИсточник Из ЭлементИсточник.ПоляГруппировки.Элементы Цикл
				ПолеПриемник = ЭлементПриемник.ПоляГруппировки.Элементы.Добавить(ТипЗнч(ПолеИсточник));
				Если ТипЗнч(ПолеИсточник)=Тип("ПолеГруппировкиКомпоновкиДанных") Тогда
					ПолеПриемник.Использование = ПолеИсточник.Использование;
					ПолеПриемник.Поле = ПолеИсточник.Поле;
					ПолеПриемник.ТипГруппировки = ПолеИсточник.ТипГруппировки;
					ПолеПриемник.ТипДополнения = ПолеИсточник.ТипДополнения;
					ПолеПриемник.НачалоПериода = ПолеИсточник.НачалоПериода;
					ПолеПриемник.КонецПериода = ПолеИсточник.КонецПериода;
					ПолеСхемы = ОтчетыСервер.ПолеСхемы(СхемаКомпоновкиДанных, ПолеИсточник.Поле);
					Если ТипЗнч(ПолеСхемы)=Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") И ПолеСхемы.Роль.НомерПериода>0 Тогда
						ЭлементПриемник.Использование = НЕ СкрытьСравнение;
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла; 
			Для Каждого ПорядокИсточник Из ЭлементИсточник.Порядок.Элементы Цикл
				ПорядокПриемник = ЭлементПриемник.Порядок.Элементы.Добавить(ТипЗнч(ПорядокИсточник));
				Если ТипЗнч(ПорядокИсточник)=Тип("ЭлементПорядкаКомпоновкиДанных") Тогда
					ПорядокПриемник.Использование = ПорядокИсточник.Использование;
					ПорядокПриемник.Поле = ПорядокИсточник.Поле;
					ПорядокПриемник.ТипУпорядочивания = ПорядокИсточник.ТипУпорядочивания;
				КонецЕсли; 
			КонецЦикла; 
			СкопироватьСтруктуруРекурсивно(ЭлементИсточник.Структура, ЭлементПриемник.Структура, СхемаКомпоновкиДанных, СкрытьСравнение);
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СкопироватьВыборРекурсивно(Источник, Приемник)
	
	Для Каждого ИсточникВыбор Из Источник Цикл
		ПриемникВыбор = Приемник.Добавить(ТипЗнч(ИсточникВыбор));
		ПриемникВыбор.Использование = ИсточникВыбор.Использование;
		Если ТипЗнч(ИсточникВыбор)=Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
			ПриемникВыбор.Поле = ИсточникВыбор.Поле;
			ПриемникВыбор.Заголовок = ИсточникВыбор.Заголовок;
		ИначеЕсли ТипЗнч(ИсточникВыбор)=Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			СкопироватьВыборРекурсивно(ИсточникВыбор.Элементы, ПриемникВыбор.Элементы);
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСортировку()
	
	// Сортировка по дате периодических группировок
	СхемаКД = ПолучитьИзВременногоХранилища(НастройкиОтчета.АдресСхемы);
	ОбновитьСортировкуРекурсивно(Отчет.КомпоновщикНастроек.Настройки.Структура, СхемаКД);
	
	// Автоматическая сортировка по показателям
	Если Не Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Свойство("СортироватьПоПоказателям") 
		ИЛИ НЕ Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.СортироватьПоПоказателям Тогда
		Возврат;
	КонецЕсли; 
	ЭлементыПорядка = Отчет.КомпоновщикНастроек.Настройки.Порядок.Элементы;
	КоличествоЭлементов = ЭлементыПорядка.Количество();
	Для ии = 1 По КоличествоЭлементов Цикл
		ЭлементПорядка = ЭлементыПорядка[КоличествоЭлементов - ии];
		Если Не ТипЗнч(ЭлементПорядка) = Тип("АвтоЭлементПорядкаКомпоновкиДанных") Тогда
			ЭлементыПорядка.Удалить(ЭлементПорядка);
		КонецЕсли; 
	КонецЦикла; 
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Тип", ТипПоказатель());
	СтруктураОтбора.Вставить("Создан", Истина);
	Строки = СтрокиДерева(ПоляНастроек, СтруктураОтбора, Истина);
	ИмяПоказателя = "";
	Для Каждого Стр Из Строки Цикл
		Для Каждого Реквизит Из Стр.Реквизиты Цикл
			Если ЭтаФорма[Реквизит.Ключ] Тогда
				ИмяПоказателя = Стр.Поле;
				Прервать;
			КонецЕсли; 
		КонецЦикла;
		Если Не ПустаяСтрока(ИмяПоказателя) Тогда
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	Если Не ПустаяСтрока(ИмяПоказателя) Тогда
		ЭлементПорядка = ЭлементыПорядка.Вставить(0, Тип("ЭлементПорядкаКомпоновкиДанных"));
		ЭлементПорядка.Использование = Истина;
		ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(ИмяПоказателя);
		ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	КонецЕсли;
	Если ЭлементыПорядка.Количество() = 0 Тогда
		ЭлементыПорядка.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить параметры периода
// 
Процедура ОбновитьПараметрыПериода()
	
	Если КлючОбъекта <> "Отчет.ОказанныеИОплаченныеУслуги" Тогда
		
		Настройки					    = Отчет.КомпоновщикНастроек.Настройки;
		ИменаПериодическихПараметров	= СтрРазделить("СтПериод,Период,КонецПериода", ",");
		
		Для Каждого ИмяПараметра Из ИменаПериодическихПараметров Цикл
			ПараметрПериод = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
			Если ПараметрПериод <> Неопределено Тогда
				Если ТипЗнч(ПараметрПериод.Значение) = Тип("СтандартныйПериод") Тогда
					ПараметрПериод.Значение = Период;
					Если Не ЗначениеЗаполнено(ПараметрПериод.Значение) Тогда
						ПараметрПериод.Использование = Ложь;
					КонецЕсли;
					
					ПараметрНачалоПериода = Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
					Если ПараметрНачалоПериода <> Неопределено Тогда
						ПараметрНачалоПериода.Значение = Период.ДатаНачала;
						ПараметрНачалоПериода.Значение = Дата(0001,01,01);
						Если Не ЗначениеЗаполнено(ПараметрНачалоПериода.Значение) Тогда
							ПараметрНачалоПериода.Использование = Ложь;
						КонецЕсли;
					КонецЕсли;
					ПараметрКонецПериода = Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
					Если ПараметрКонецПериода <> Неопределено Тогда
						ПараметрКонецПериода.Значение = Период.ДатаОкончания;						
						Если Не ЗначениеЗаполнено(ПараметрКонецПериода.Значение) Тогда
							ПараметрКонецПериода.Значение = Дата(3999,12,31);
						КонецЕсли;
					КонецЕсли;
					
					Если НастройкиОтчета.РежимПериода = ОтчетыКлиентСервер.РежимПериодаНаДату()
						И ПараметрПериод.Значение.ДатаНачала > ПараметрПериод.Значение.ДатаОкончания Тогда
						ПараметрПериод.Значение.ДатаНачала = '0001-01-01';
					КонецЕсли;
				ИначеЕсли ТипЗнч(ПараметрПериод.Значение) = Тип("СтандартнаяДатаНачала") Тогда
					ПараметрПериод.Значение.Вариант = ВариантСтандартнойДатыНачала.ПроизвольнаяДата;
					ПараметрПериод.Значение.Дата = Период.ДатаОкончания;
				ИначеЕсли ТипЗнч(ПараметрПериод.Значение) = Тип("Дата") Тогда
					ПараметрПериод.Значение = Период.ДатаОкончания;
					Если Не ЗначениеЗаполнено(ПараметрПериод.Значение) Тогда
						ПараметрПериод.Значение = Дата(3999,12,31);
					КонецЕсли;
					
				КонецЕсли;
				ПараметрПериод.Использование = ЗначениеЗаполнено(ПараметрПериод.Значение);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Настройки = Отчет.КомпоновщикНастроек.Настройки;
		
		ПараметрНачалоПериода = Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
		Если ПараметрНачалоПериода <> Неопределено Тогда
			ПараметрНачалоПериода.Использование = Ложь;
		КонецЕсли;
		
		ПараметрКонецПериода = Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
		Если ПараметрКонецПериода <> Неопределено Тогда
			ПараметрКонецПериода.Использование = Ложь;		
		КонецЕсли;	
		
		ПараметрПериод = Настройки.ПараметрыДанных.Элементы.Найти("Период");
		Если ПараметрПериод <> Неопределено Тогда
			Если ТипЗнч(ПараметрПериод.Значение) = Тип("СтандартныйПериод") Тогда
				ПараметрПериод.Значение = Период;
				Если Не ЗначениеЗаполнено(ПараметрПериод.Значение) Тогда
					ПараметрПериод.Использование = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить параметры прочих периодов.
// 
Процедура ОбновитьПараметрыПрочихПериодов()

	Настройки						= Отчет.КомпоновщикНастроек.Настройки;
	ИменаПериодическихПараметров	= СтрРазделить("СтПериод,Период,КонецПериода", ",");
	
	Для Каждого ТекущийПараметр Из Настройки.ПараметрыДанных.Элементы Цикл
		
		Если ИменаПериодическихПараметров.Найти(Строка(ТекущийПараметр.Параметр)) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ТекущийПараметр.Значение) <> Тип("СтандартныйПериод") Тогда
			Продолжить;
		КонецЕсли;
		
		// ищем начало и конец периода 		
		ПериодНачало = Настройки.ПараметрыДанных.Элементы.Найти("Начало" + СокрЛП(ТекущийПараметр.Параметр));
		Если ПериодНачало = Неопределено Тогда
			ПериодНачало = Настройки.ПараметрыДанных.Элементы.Найти(СокрЛП(ТекущийПараметр.Параметр) + "Начало");
		КонецЕсли;
		
		Если ПериодНачало <> Неопределено Тогда
			Если ТипЗнч(ПериодНачало.Значение) = Тип("Дата") Тогда
				 ПериодНачало.Значение		= ТекущийПараметр.Значение.ДатаНачала;
				 ПериодНачало.Использование = ЗначениеЗаполнено(ПериодНачало.Значение);     				 
			КонецЕсли;			
		КонецЕсли;
		
		ПериодКонец = Настройки.ПараметрыДанных.Элементы.Найти("Конец" + СокрЛП(ТекущийПараметр.Параметр));
		Если ПериодКонец = Неопределено Тогда
			ПериодКонец = Настройки.ПараметрыДанных.Элементы.Найти(СокрЛП(ТекущийПараметр.Параметр) + "Конец");
		КонецЕсли;
		Если ПериодКонец = Неопределено Тогда
			ПериодКонец = Настройки.ПараметрыДанных.Элементы.Найти("Окончание" + СокрЛП(ТекущийПараметр.Параметр));
		КонецЕсли;
		Если ПериодКонец = Неопределено Тогда
			ПериодКонец = Настройки.ПараметрыДанных.Элементы.Найти(СокрЛП(ТекущийПараметр.Параметр) + "Окончание");
		КонецЕсли;  
		
		Если ПериодКонец <> Неопределено Тогда
			Если ТипЗнч(ПериодКонец.Значение) = Тип("Дата") Тогда
				 ПериодКонец.Значение	   = ?(ЗначениеЗаполнено(ТекущийПараметр.Значение.ДатаОкончания), КонецДня(ТекущийПараметр.Значение.ДатаОкончания), Дата(3999,12,31));
				 ПериодКонец.Использование = ЗначениеЗаполнено(ПериодКонец.Значение);     				 
			КонецЕсли;			
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры    

&НаСервере
Процедура ОбновитьСортировкуРекурсивно(Структура, СхемаКД, ЭлементРодитель = Неопределено, ДополнениеУстановлено = Ложь)
	
	Для Каждого Элемент Из Структура Цикл
		
		Если ТипЗнч(Элемент)=Тип("ГруппировкаКомпоновкиДанных") 
			ИЛИ ТипЗнч(Элемент)=Тип("ГруппировкаТаблицыКомпоновкиДанных") 
			ИЛИ ТипЗнч(Элемент)=Тип("ГруппировкаДиаграммыКомпоновкиДанных") Тогда
			
			// Для вложенных элементов структуры всегда переопределяем настройки порядка
			Элемент.Порядок.Элементы.Очистить();
			
			// Сортируем по периодическим полям
			СписокПолей = Новый СписокЗначений;
			Для Каждого Поле Из Элемент.ПоляГруппировки.Элементы Цикл
				Если Не Поле.Использование Тогда
					Продолжить;
				КонецЕсли;
				Если ТипЗнч(Поле) = Тип("АвтоПолеГруппировкиКомпоновкиДанных") Тогда
					Продолжить;
				КонецЕсли;				
				ИмяПоля = Строка(Поле.Поле);
				Если Не ИмяПоля="ДинамическийПериод" И НЕ ИмяПоля="МесяцГода" И НЕ ИмяПоля="ДеньМесяцГода" И НЕ ИмяПоля="НеделяГода" Тогда
					// Динамический период всегда сортируем, остальные поля проверяем на периодичность
					ПолеСхемы = ОтчетыСервер.ПолеСхемы(СхемаКД, Поле.Поле);
					Если Не ТипЗнч(ПолеСхемы)=Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") Тогда
						Продолжить;
					КонецЕсли; 
					Если ПолеСхемы.Роль.НомерПериода=0 Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли; 
				ЭлементПорядка = Элемент.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
				ЭлементПорядка.Использование = Истина;
				ЭлементПорядка.Поле = Поле.Поле;
				ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
			КонецЦикла;
			Если Не ДополнениеУстановлено Тогда
				ДополнениеУстановлено = ОбновитьДополнениеГруппировки(Элемент, СхемаКД); 
			КонецЕсли; 
			
			// Для диаграмм выполняем сортировку по значениям показателей
			Если ТипЗнч(Элемент)=Тип("ГруппировкаДиаграммыКомпоновкиДанных") И ТипЗнч(ЭлементРодитель)=Тип("ДиаграммаКомпоновкиДанных") Тогда
				Тип = ТипДиаграммыЭлементаСтруктуры(ЭлементРодитель);
				Для Каждого ЭлементВыбор Из ЭлементРодитель.Выбор.Элементы Цикл
					Если ТипЗнч(ЭлементВыбор)=Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
						Продолжить;
					КонецЕсли; 
					ЭлементПорядка = Элемент.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
					ЭлементПорядка.Использование = Истина;
					ЭлементПорядка.Поле = ЭлементВыбор.Поле;
					Если Тип=ТипДиаграммы.ГистограммаГоризонтальная 
						ИЛИ Тип=ТипДиаграммы.ГистограммаГоризонтальнаяОбъемная 
						ИЛИ Тип=ТипДиаграммы.ГистограммаНормированнаяГоризонтальная 
						ИЛИ Тип=ТипДиаграммы.ГистограммаНормированнаяГоризонтальнаяОбъемная 
						ИЛИ Тип=ТипДиаграммы.ГистограммаСНакоплениемГоризонтальная 
						ИЛИ Тип=ТипДиаграммы.ГистограммаСНакоплениемГоризонтальнаяОбъемная Тогда
						ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
					Иначе
						ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли;
			
			ЭлементПорядка = Элемент.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
			ЭлементПорядка.Использование = Истина;
			ОбновитьСортировкуРекурсивно(Элемент.Структура, СхемаКД, Элемент, ДополнениеУстановлено);
			
		ИначеЕсли ТипЗнч(Элемент)=Тип("ДиаграммаКомпоновкиДанных") Тогда
			
			ОбновитьСортировкуРекурсивно(Элемент.Серии, СхемаКД, Элемент, ДополнениеУстановлено);
			ОбновитьСортировкуРекурсивно(Элемент.Точки, СхемаКД, Элемент, ДополнениеУстановлено);
			
		ИначеЕсли ТипЗнч(Элемент)=Тип("ТаблицаКомпоновкиДанных") Тогда
			
			ОбновитьСортировкуРекурсивно(Элемент.Строки, СхемаКД, Элемент, ДополнениеУстановлено);
			ОбновитьСортировкуРекурсивно(Элемент.Колонки, СхемаКД, Элемент, ДополнениеУстановлено);
			
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти 

#Область ПроцедурыСозданияРеквизитовНастроек

&НаСервере
Процедура ОбновитьНастройкиНаФорме()
	
	Отчет.КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	ВосставноитьДинамическиеПериодыРекурсивно(Отчет.КомпоновщикНастроек.Настройки.Структура);
	ИсправитьНастройкиВарианта();
	Элементы.ПолеГруппировкиКолонок.СписокВыбора.Очистить();
	Элементы.ПолеСравнения.СписокВыбора.Очистить();
	
	ОпределитьПараметрыОтчетаПоУмолчанию();
	ПроверитьСовместимостьВарианта();
	ОбновитьПериодНаФорме();
	
	ПоляНастроек.ПолучитьЭлементы().Очистить();
	
	ЗаполнитьОписанияПараметров();
	
	ЗаполнитьВариантыСравнения();
	ЗаполнитьВариантыГруппировкиКолонок();
	
	Если НастройкиОтчета.ПоказыватьНастройкиДиаграммыНаФормеОтчета Тогда
		ЗаполнитьВариантыСерийТочекЗначений();
		ОбновитьНастройкиДиаграммыНаФорме();
	КонецЕсли;
	Если НастройкиОтчета.ПоказыватьГруппуКолонкиНаФормеОтчета Тогда
		ДополнительныеСвойства = Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
		ДополнительныеСвойства.Свойство("ПоказыватьАбсолютноеИзменение", ПоказыватьАбсолютноеИзменение);
		ДополнительныеСвойства.Свойство("ПоказыватьОтносительноеИзменение", ПоказыватьОтносительноеИзменение);
		ЗаполнитьОписанияПоказателей();
	КонецЕсли; 
	Если НастройкиОтчета.ПоказыватьГруппуСтрокиНаФормеОтчета ИЛИ НастройкиОтчета.ПоказыватьГруппуКолонкиНаФормеОтчета Тогда
		ЗаполнитьОписанияГруппировок();
	КонецЕсли; 
	
	Если НастройкиОтчета.ПоказыватьГруппуФильтрыНаФормеОтчета Тогда
		ЗаполнитьОписанияФильтров();
	КонецЕсли;
	
	ВнестиИзмененияВРеквизитыНаФорме();
	УстановитьВидимостьИДоступность();
	
	Если НастройкиОтчета.ПрограммноеИзменениеФормыОтчета Тогда
		ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
		ОтчетОбъект.ОбновитьНастройкиНаФорме(НастройкиОтчета, Отчет.КомпоновщикНастроек.Настройки, ЭтаФорма);
	КонецЕсли;
	
	ОбновитьПредставлениеПериода();
	ОбновитьОтображениеОтметокФильтров();
	ОбновитьОтображениеОтметокПараметров();
	ОбновитьЗаголовокОтчета();
	// ОбновитьГруппировкиРазворачивания();
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьГруппировкиРазворачивания()
	
	Если НЕ Элементы.ГруппаСтроки.Видимость Тогда
		РазвернутьДо = "";
		Возврат;
	КонецЕсли;
	
	ДоступностьНастройки = Истина;
	Элементы.РазвернутьДо.СписокВыбора.Очистить();
	Элементы.РазвернутьДо.СписокВыбора.Добавить("", НСтр("ru = '<По умолчанию>'"));
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Тип", ТипГруппировка());
	Строки = СтрокиДерева(ПоляНастроек, СтруктураОтбора);
	Для каждого СтрокаГруппировки Из Строки Цикл
		ИмяРеквизита = ПервыйКлючСтруктуры(СтрокаГруппировки.Реквизиты);
		Если СтрокаГруппировки.ВидЭлемента<>"Флажок" ИЛИ ИмяРеквизита=Неопределено ИЛИ ЭтотОбъект[ИмяРеквизита]<>Истина Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаГруппировки.ДополнительныеПараметры.Свойство("ТипГруппировки") 
			И СтрокаГруппировки.ДополнительныеПараметры.ТипГруппировки<>ТипГруппировкиКомпоновкиДанных.Элементы Тогда
			ДоступностьНастройки = Ложь;
		КонецЕсли;
		Если СтрДлина(СтрокаГруппировки.Заголовок)>40 Тогда
			ЗаголовокГруппировки = Лев(СтрокаГруппировки.Заголовок, 40) + "...";
		Иначе
			ЗаголовокГруппировки = СтрокаГруппировки.Заголовок;
		КонецЕсли; 
		Если СтрокаГруппировки.ПолучитьЭлементы().Количество()=0 Тогда
			Элементы.РазвернутьДо.СписокВыбора.Добавить(СтрокаГруппировки.Поле, ЗаголовокГруппировки);
		Иначе
			ИмяПоля = "";
			Для каждого СтрокаПоля Из СтрокаГруппировки.ПолучитьЭлементы() Цикл
				ИмяРеквизита = ПервыйКлючСтруктуры(СтрокаПоля.Реквизиты);
				Если СтрокаПоля.ВидЭлемента<>"Флажок" ИЛИ ИмяРеквизита=Неопределено ИЛИ ЭтотОбъект[ИмяРеквизита]<>Истина Тогда
					Продолжить;
				КонецЕсли; 
				ИмяПоля = ""+?(ПустаяСтрока(ИмяПоля), "", ",")+СтрокаПоля.Поле;
			КонецЦикла;
			Если ПустаяСтрока(ИмяПоля) Тогда
				Продолжить;
			КонецЕсли; 
			Элементы.РазвернутьДо.СписокВыбора.Добавить(ИмяПоля, ЗаголовокГруппировки);
		КонецЕсли; 
	КонецЦикла;
	
	Элементы.РазвернутьДо.СписокВыбора.Добавить("*", НСтр("ru = '<Развернуть все>'"));
	
	Элементы.РазвернутьДо.Доступность = ДоступностьНастройки И Элементы.РазвернутьДо.СписокВыбора.Количество()>3;
	Если НЕ Элементы.РазвернутьДо.Доступность Тогда
		РазвернутьДо = "";
		Возврат;
	КонецЕсли; 
	
	Если Элементы.РазвернутьДо.СписокВыбора.НайтиПоЗначению(РазвернутьДо)=Неопределено Тогда
		РазвернутьДо = "";
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПервыйКлючСтруктуры(Структура)
	
	Для каждого Элемент Из Структура Цикл
		Возврат Элемент.Ключ;
	КонецЦикла;
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ПроверитьСовместимостьВарианта()
	
	ДополнительныеСвойства = Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	
	// Не более одной вложенной группировки для колонок таблицы
	КоличествоГруппировокКолонок = КоличествоГруппировокТаблицыРекурсивно(Отчет.КомпоновщикНастроек.Настройки.Структура);
	ЕстьСоставныеГруппировкиКолонок = ЕстьСоставныеГруппировкиКолонок(Отчет.КомпоновщикНастроек.Настройки.Структура);
	Если НЕ ДополнительныеСвойства.Свойство("Сравнение") И КоличествоГруппировокКолонок=2 Тогда
		// "Заводская" настройка
		КоличествоПоказателей = КоличествоПоказателейСКД();
		Если КоличествоПоказателей=1 Тогда
			// Можно использовать режим сравнения
			КоличествоГруппировокКолонок = КоличествоГруппировокКолонок-1;
		КонецЕсли; 
	ИначеЕсли ДополнительныеСвойства.Свойство("Сравнение") И ЗначениеЗаполнено(ДополнительныеСвойства.Сравнение) Тогда
		// Без учета группировки сравнения
		КоличествоГруппировокКолонок = КоличествоГруппировокКолонок-1;
	КонецЕсли; 
	Если КоличествоГруппировокКолонок>1 ИЛИ ЕстьСоставныеГруппировкиКолонок Тогда
		НастройкиОтчета.Вставить("ИспользоватьСравнение", Ложь);
		НастройкиОтчета.Вставить("ПоказыватьГруппировкиКолонокНаФормеОтчета", Ложь);
	КонецЕсли;
	
	// Отсутствуют вложенные настройки выбранных полей
	Если ЕстьВложенныеНастройкиВыбора() Тогда
		НастройкиОтчета.Вставить("ПоказыватьГруппуКолонкиНаФормеОтчета", Ложь);
	КонецЕсли;
	
	// Диаграммы
	Если НЕ ЭлементСтуктурыДиаграмма(Отчет.КомпоновщикНастроек.Настройки.Структура)=Неопределено Тогда
		НастройкиОтчета.Вставить("ЭтоДиаграмма", Истина);
	Иначе
		НастройкиОтчета.Вставить("ЭтоДиаграмма", Ложь);
	КонецЕсли; 
	НастройкиОтчета.Вставить("НестандартнаяДиаграмма", НестандартнаяДиаграмма(Отчет.КомпоновщикНастроек.Настройки));
	
	Если Отчет.КомпоновщикНастроек.Настройки.Структура.Количество()>1 Тогда
		КоличествоДиаграмм = 0;
		КоличествоГруппировок = 0;
		Для каждого ЭлементСтруктуры Из Отчет.КомпоновщикНастроек.Настройки.Структура Цикл
			Если НЕ ЭлементСтруктуры.Использование Тогда
				Продолжить;
			КонецЕсли; 
			Если ТипЗнч(ЭлементСтруктуры)=Тип("ТаблицаКомпоновкиДанных") ИЛИ ТипЗнч(ЭлементСтруктуры)=Тип("ГруппировкаКомпоновкиДанных") Тогда
				КоличествоГруппировок = КоличествоГруппировок+1;
			ИначеЕсли ТипЗнч(ЭлементСтруктуры)=Тип("ДиаграммаКомпоновкиДанных") Тогда
				КоличествоДиаграмм = КоличествоДиаграмм+1;
			КонецЕсли; 
		КонецЦикла;
		Если КоличествоГруппировок>1 Тогда
			НастройкиОтчета.ПоказыватьГруппуСтрокиНаФормеОтчета = Ложь;
		КонецЕсли; 
		Если КоличествоДиаграмм>1 Тогда
			НастройкиОтчета.Вставить("НестандартнаяДиаграмма", Истина);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиДиаграммыНаФорме()
	
	ДиаграммаСерии = Неопределено;
	ДиаграммаТочки = Неопределено;
	ДиаграммаЗначения = Неопределено;
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	ЭлементДиаграмма = ЭлементСтуктурыДиаграмма(Настройки.Структура);
	Если ЭлементДиаграмма=Неопределено Тогда
		ВидДиаграммы = Неопределено;
		Возврат;
	КонецЕсли; 
	
	ВидДиаграммы = ТипДиаграммыЭлементаСтруктуры(ЭлементДиаграмма);
	
	Если НастройкиОтчета.ИзменятьЗначенияДиаграммы Тогда
		Если ЭлементДиаграмма.Выбор.Элементы.Количество()=1 И ТипЗнч(ЭлементДиаграмма.Выбор.Элементы[0])=Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
			ЭлементыВыбора = Настройки.Выбор.Элементы;
		Иначе
			ЭлементыВыбора = ЭлементДиаграмма.Выбор.Элементы;
		КонецЕсли;
		Для Каждого ЭлементВыбора Из ЭлементыВыбора Цикл
			Если ТипЗнч(ЭлементВыбора)=Тип("АвтоВыбранноеПолеКомпоновкиДанных") ИЛИ ТипЗнч(ЭлементВыбора)=Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			ДоступноеПоле = Настройки.ДоступныеПоляВыбора.НайтиПоле(ЭлементВыбора.Поле);
			Если ДоступноеПоле=Неопределено ИЛИ НЕ ДоступноеПоле.Ресурс Тогда
				Продолжить;
			КонецЕсли;
			ДиаграммаЗначения = Строка(ЭлементВыбора.Поле);
		КонецЦикла; 
	КонецЕсли; 
	
	Если НастройкиОтчета.НестандартнаяДиаграмма Тогда
		Возврат;
	КонецЕсли; 
	
	ИмяСерии = ?(ЭлементДиаграмма.Серии.Количество()=0, "", Строка(ЭлементДиаграмма.Серии[0].ПоляГруппировки.Элементы[0].Поле));
	ИмяТочки = ?(ЭлементДиаграмма.Точки.Количество()=0, "", Строка(ЭлементДиаграмма.Точки[0].ПоляГруппировки.Элементы[0].Поле));
	Если ИмяТочки="ДинамическийПериод" Тогда
		ПараметрДанныхПериодичность = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Периодичность"));
		Если ПараметрДанныхПериодичность=Неопределено ИЛИ НЕ ПараметрДанныхПериодичность.Использование ИЛИ НЕ ЗначениеЗаполнено(ПараметрДанныхПериодичность.Значение) Тогда
			ИмяТочки = ОтчетыСервер.ПолучитьЗначениеПериодичности(Период.ДатаНачала, Период.ДатаОкончания);
		Иначе
			ИмяТочки = ПараметрДанныхПериодичность.Значение;
		КонецЕсли; 
	КонецЕсли;
	Если ПустаяСтрока(ИмяТочки) И НЕ ПустаяСтрока(ИмяСерии) Тогда
		ИмяТочки = ИмяСерии;
		ИмяСерии = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяТочки) Тогда
		Если ДоступныеТочки.НайтиПоЗначению(ИмяТочки)=Неопределено Тогда
			Если ТипЗнч(ИмяТочки)=Тип("ПеречислениеСсылка.Периодичность") Тогда
				ДоступныеТочки.Вставить(ДоступныеТочки.Количество()-1, ИмяТочки, Строка(ИмяТочки));
				Элементы.ДиаграммаТочки.СписокВыбора.Вставить(Элементы.ДиаграммаТочки.СписокВыбора.Количество()-1, ИмяТочки, Строка(ИмяТочки));
			Иначе
				ДоступноеПоле = Настройки.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных(ИмяТочки));
				Если Не ДоступноеПоле=Неопределено Тогда
					ДоступныеТочки.Вставить(ДоступныеТочки.Количество()-1, ИмяТочки, ДоступноеПоле.Заголовок);
					Элементы.ДиаграммаТочки.СписокВыбора.Вставить(Элементы.ДиаграммаТочки.СписокВыбора.Количество()-1, ИмяТочки, ДоступноеПоле.Заголовок);
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли; 
		ДиаграммаТочки = ИмяТочки;  
	КонецЕсли;
	Если ЗначениеЗаполнено(ИмяСерии) Тогда
		Если ДоступныеСерии.НайтиПоЗначению(ИмяСерии)=Неопределено Тогда
			ДоступноеПоле = Настройки.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных(ИмяСерии));
			Если Не ДоступноеПоле=Неопределено Тогда
				ДоступныеСерии.Вставить(ДоступныеСерии.Количество()-1, ИмяСерии, ДоступноеПоле.Заголовок);
				Элементы.ДиаграммаСерии.СписокВыбора.Вставить(Элементы.ДиаграммаСерии.СписокВыбора.Количество()-1, ИмяСерии, ДоступноеПоле.Заголовок);
			КонецЕсли;
		КонецЕсли;
		ДиаграммаСерии = ИмяСерии;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВариантыСерийТочекЗначений()
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	
	ДоступныеСерии.Очистить();
	ДоступныеТочки.Очистить();
	Элементы.ДиаграммаЗначения.СписокВыбора.Очистить();
	
	ДоступныеСерии.Добавить(Неопределено, НСтр("ru = 'Не использовать'"));
	ДоступныеТочки.Добавить(Неопределено, НСтр("ru = 'Не использовать'"));
	
	ПоляПериодичностиТочки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("ПериодГод,ПериодПолугодие,ПериодКвартал,ПериодМесяц,МесяцГода,ПериодНеделя,НеделяГода,ПериодДень,ДеньМесяца,ДеньНедели");
	ПоляПериодичностиСерии = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("ПериодГод,ПериодПолугодие,ПериодКвартал,ПериодМесяц");
	
	Для Каждого ИмяПоля Из ПоляПериодичностиТочки Цикл
		// группа периоды
		ПолеПериод = Настройки.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных("Периоды"));
		Если ПолеПериод <> Неопределено И ПолеПериод.Папка Тогда
			Для Каждого ЭлементПериода Из ПолеПериод.Элементы Цикл
				Если ДоступныеТочки.НайтиПоЗначению(ЭлементПериода.Поле) = Неопределено Тогда
					ДоступныеТочки.Добавить(ЭлементПериода.Поле, ЭлементПериода.Заголовок, Истина);
				КонецЕсли;
			КонецЦикла;			
		КонецЕсли; 		
		
		ДоступноеПоле = Настройки.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных(ИмяПоля));
		Если ДоступноеПоле = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ДоступныеТочки.НайтиПоЗначению(ИмяПоля) = Неопределено Тогда   
			ДоступныеТочки.Добавить(ИмяПоля, ДоступноеПоле.Заголовок, Истина);
		КонецЕсли;
	КонецЦикла; 
	
	Для Каждого ИмяПоля Из ПоляПериодичностиСерии Цикл
		ДоступноеПоле = Настройки.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных(ИмяПоля));
		Если ДоступноеПоле=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаголовокПоля = ДоступноеПоле.Заголовок;
		ДоступныеСерии.Добавить(ИмяПоля, ДоступноеПоле.Заголовок, Истина);
	КонецЦикла; 
	
	ДополнительныеГруппировкиКолонок = ?(НастройкиОтчета.Свойство("ДополнительныеГруппировкиКолонок"), НастройкиОтчета.ДополнительныеГруппировкиКолонок, Неопределено);
	Если ТипЗнч(ДополнительныеГруппировкиКолонок)=Тип("СписокЗначений") Тогда
		Для Каждого ОписаниеПоля Из ДополнительныеГруппировкиКолонок Цикл
			Если ПустаяСтрока(ОписаниеПоля.Представление) Тогда
				ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных(ОписаниеПоля.Значение));
				Если ДоступноеПоле=Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ПредставлениеПоля = ДоступноеПоле.Заголовок;
			Иначе
				ПредставлениеПоля = ОписаниеПоля.Представление;
			КонецЕсли;
			Если ДоступныеСерии.НайтиПоЗначению(ОписаниеПоля.Значение)=Неопределено Тогда
				ДоступныеСерии.Добавить(ОписаниеПоля.Значение, ПредставлениеПоля);
			КонецЕсли;
			Если ДоступныеТочки.НайтиПоЗначению(ОписаниеПоля.Значение)=Неопределено Тогда
				ДоступныеТочки.Добавить(ОписаниеПоля.Значение, ПредставлениеПоля);
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	Если НастройкиОтчета.РазрешитьДобавлениеПрочихГруппировокКолонок Тогда
		ДоступныеСерии.Добавить("<Прочие>", НСтр("ru = 'Прочее'"),, БиблиотекаКартинок.Выбрать);
		ДоступныеТочки.Добавить("<Прочие>", НСтр("ru = 'Прочее'"),, БиблиотекаКартинок.Выбрать);
	КонецЕсли;
	
	Для Каждого ЭлементВыбора Из ДоступныеТочки Цикл
		Элементы.ДиаграммаТочки.СписокВыбора.Добавить(ЭлементВыбора.Значение, ЭлементВыбора.Представление);
	КонецЦикла; 
	Для Каждого ЭлементВыбора Из ДоступныеСерии Цикл
		Элементы.ДиаграммаСерии.СписокВыбора.Добавить(ЭлементВыбора.Значение, ЭлементВыбора.Представление);
	КонецЦикла; 
	
	Для Каждого ДоступноеПоле Из Настройки.ДоступныеПоляВыбора.Элементы Цикл
		Если Не ДоступноеПоле.Ресурс Тогда
			Продолжить;
		КонецЕсли;
		Элементы.ДиаграммаЗначения.СписокВыбора.Добавить(Строка(ДоступноеПоле.Поле), ДоступноеПоле.Заголовок);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиДиаграммы()
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	ЭлементДиаграмма = ЭлементСтуктурыДиаграмма(Настройки.Структура, Истина);
	Если ЭлементДиаграмма=Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЭлементДиаграмма.Использование = ЗначениеЗаполнено(ВидДиаграммы);
	Если Не НастройкиОтчета.НестандартнаяДиаграмма Тогда
		ЭлементДиаграмма.Серии.Очистить();
		ЭлементДиаграмма.Точки.Очистить();
	КонецЕсли; 
	Если НастройкиОтчета.ИзменятьЗначенияДиаграммы Тогда
		ЭлементДиаграмма.Выбор.Элементы.Очистить();
	КонецЕсли; 
	
	Если ТипЗнч(ДиаграммаТочки)=Тип("ПеречислениеСсылка.Периодичность") Тогда
		ИмяГруппировкиТочки = "ДинамическийПериод";
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Периодичность", ДиаграммаТочки);
	Иначе
		ИмяГруппировкиТочки = ДиаграммаТочки;
	КонецЕсли; 
	Если Не НастройкиОтчета.НестандартнаяДиаграмма И ЗначениеЗаполнено(ДиаграммаТочки) Тогда
		Точка = ЭлементДиаграмма.Точки.Добавить();
		Поле = Точка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		Поле.Поле = Новый ПолеКомпоновкиДанных(ИмяГруппировкиТочки);
		Поле.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
		Поле.Использование = Истина;
		Точка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		Точка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
		Точка.Использование = Истина;
	КонецЕсли;
	Если Не НастройкиОтчета.НестандартнаяДиаграмма И НЕ НастройкиОтчета.ВыводитьТолькоТочки И ЗначениеЗаполнено(ДиаграммаТочки) И ЗначениеЗаполнено(ДиаграммаСерии) Тогда
		Серия = ЭлементДиаграмма.Серии.Добавить();
		Поле = Серия.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		Поле.Поле = Новый ПолеКомпоновкиДанных(ДиаграммаСерии);
		Поле.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
		Поле.Использование = Истина;
		Серия.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		Серия.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
		Серия.Использование = Истина;
	КонецЕсли; 
	Если НастройкиОтчета.ИзменятьЗначенияДиаграммы Тогда
		Если ЗначениеЗаполнено(ДиаграммаЗначения) Тогда
			ЭлементВыбор = ЭлементДиаграмма.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ЭлементВыбор.Использование = Истина;
			ЭлементВыбор.Поле = Новый ПолеКомпоновкиДанных(ДиаграммаЗначения);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ОбновитьДополнениеГруппировки(Группировка, Схема)
	
	Если Не Группировка.ПоляГруппировки.Элементы.Количество()=1 Тогда
		Возврат Ложь;
	КонецЕсли;
	ПолеГруппировки = Группировка.ПоляГруппировки.Элементы[0];
	ИмяПоля = Строка(ПолеГруппировки.Поле);
	Если ИмяПоля="ДинамическийПериод" Тогда
		ПараметрСхемыПериодичность = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Периодичность"));
		Если Не ПараметрСхемыПериодичность=Неопределено И ЗначениеЗаполнено(ПараметрСхемыПериодичность.Значение) Тогда
			ИмяПериодичности = ОбщегоНазначения.ИмяЗначенияПеречисления(ПараметрСхемыПериодичность.Значение);
			УстановитьТипДополнения(ПолеГруппировки, ТипДополненияПоИмениПоля(ИмяПериодичности));
		Иначе
			УстановитьТипДополнения(ПолеГруппировки, ТипДополненияПериодаКомпоновкиДанных.БезДополнения);
		КонецЕсли;
	ИначеЕсли ИмяПоля="МесяцГода" Тогда
		УстановитьТипДополнения(ПолеГруппировки, ТипДополненияПериодаКомпоновкиДанных.Месяц);
	ИначеЕсли ИмяПоля="ДеньИМесяцГода" Тогда
		УстановитьТипДополнения(ПолеГруппировки, ТипДополненияПериодаКомпоновкиДанных.День);
	Иначе
		ПолеСхемы = ОтчетыСервер.ПолеСхемы(Схема, ИмяПоля);
		Если Не ТипЗнч(ПолеСхемы)=Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") ИЛИ ПолеСхемы.Роль.НомерПериода=0 Тогда
			УстановитьТипДополнения(ПолеГруппировки, ТипДополненияПериодаКомпоновкиДанных.БезДополнения);
		Иначе
			УстановитьТипДополнения(ПолеГруппировки, ТипДополненияПоИмениПоля(ИмяПоля));
		КонецЕсли; 
	КонецЕсли;
	Возврат (ПолеГруппировки.ТипДополнения<>ТипДополненияПериодаКомпоновкиДанных.БезДополнения);
	
КонецФункции

&НаСервере
Процедура УстановитьТипДополнения(ПолеГруппировки, ТипДополнения)
	
	ПолеГруппировки.ТипДополнения = ТипДополнения;
	Если ПолеГруппировки.ТипДополнения=ТипДополненияПериодаКомпоновкиДанных.БезДополнения Тогда
		ПолеГруппировки.НачалоПериода = '0001-01-01';
		ПолеГруппировки.КонецПериода = '0001-01-01';
	Иначе
		ПолеГруппировки.НачалоПериода = Период.ДатаНачала;
		ПолеГруппировки.КонецПериода = ?(ЗначениеЗаполнено(Период.ДатаОкончания), КонецДня(Период.ДатаОкончания), Период.ДатаОкончания);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ТипДополненияПоИмениПоля(ИмяПоля)
	
	Если ИмяПоля="ПериодДень" ИЛИ ИмяПоля="День" Тогда
		Возврат ТипДополненияПериодаКомпоновкиДанных.День;
	ИначеЕсли ИмяПоля="ПериодНеделя" ИЛИ ИмяПоля="Неделя" Тогда
		Возврат ТипДополненияПериодаКомпоновкиДанных.Неделя;
	ИначеЕсли ИмяПоля="ПериодМесяц" ИЛИ ИмяПоля="Месяц" Тогда
		Возврат ТипДополненияПериодаКомпоновкиДанных.Месяц;
	ИначеЕсли ИмяПоля="ПериодКвартал" ИЛИ ИмяПоля="Квартал" Тогда
		Возврат ТипДополненияПериодаКомпоновкиДанных.Квартал;
	ИначеЕсли ИмяПоля="ПериодПолугодие" ИЛИ ИмяПоля="Полугодие" Тогда
		Возврат ТипДополненияПериодаКомпоновкиДанных.Полугодие;
	ИначеЕсли ИмяПоля="ПериодГод" ИЛИ ИмяПоля="Год" Тогда
		Возврат ТипДополненияПериодаКомпоновкиДанных.Год;
	КонецЕсли;
	Возврат ТипДополненияПериодаКомпоновкиДанных.БезДополнения;
	
КонецФункции

&НаСервере
// Процедура - Обновить период на форме
// 
Процедура ОбновитьПериодНаФорме()
	
	Если Не ПоляНастроек.ПолучитьЭлементы().Количество()=0 Тогда
		// Не первая загрузка варианта
		Возврат;
	КонецЕсли;
	
	ПараметрПериод = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтПериод");
	
	Если ПараметрПериод = Неопределено Тогда
		ПараметрПериод = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	КонецЕсли;
	
	Если ПараметрПериод = Неопределено 
		Или Не ПараметрПериод.Использование Тогда
		
		Период = Новый СтандартныйПериод;
		
	ИначеЕсли ТипЗнч(ПараметрПериод.Значение)=Тип("Дата") Тогда
		
		Период = Новый СтандартныйПериод('0001-01-01', ПараметрПериод.Значение);
		
	ИначеЕсли ТипЗнч(ПараметрПериод.Значение)=Тип("СтандартныйПериод") Тогда
		
		Период = ПараметрПериод.Значение;
		
	ИначеЕсли ТипЗнч(ПараметрПериод.Значение)=Тип("СтандартнаяДатаНачала") Тогда
		
		Период = Новый СтандартныйПериод('0001-01-01', ПараметрПериод.Значение.Дата);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УдалитьЭлементыРекурсивно(Группа, МассивЭлементов, МассивРеквизитов)
	
	Для Каждого Элемент Из Группа.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(Элемент)=Тип("ГруппаФормы") Тогда
			УдалитьЭлементыРекурсивно(Элемент, МассивЭлементов, МассивРеквизитов);
		ИначеЕсли ТипЗнч(Элемент)=Тип("КомандаФормы") Тогда
			Команды.Удалить(Команды.Найти(Элемент.ИмяКоманды));
		ИначеЕсли ТипЗнч(Элемент)=Тип("ПолеФормы") Тогда
			УдалитьЭлементыРекурсивно(Элемент.КонтекстноеМеню, МассивЭлементов, МассивРеквизитов);
			Позиция = Найти(Элемент.ПутьКДанным, ".");
			Если Позиция>0 Тогда
				ИмяРеквизита = Лев(Элемент.ПутьКДанным, Позиция-1);
			Иначе
				ИмяРеквизита = Элемент.ПутьКДанным;
			КонецЕсли;
			Если МассивРеквизитов.Найти(ИмяРеквизита)=Неопределено Тогда
				МассивРеквизитов.Добавить(ИмяРеквизита);
			КонецЕсли; 
		КонецЕсли;
		МассивЭлементов.Добавить(Элемент);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ВнестиИзмененияВРеквизитыНаФорме(ПолнаяЗамена = Истина)
	
	МассивУдаляемыхРеквизитов = Новый Массив;
	Если ПолнаяЗамена Тогда
		МассивУдаляемыхЭлементов = Новый Массив;
		УдалитьЭлементыРекурсивно(Элементы.ГруппаПараметрыЭлементы, МассивУдаляемыхЭлементов, МассивУдаляемыхРеквизитов);
		УдалитьЭлементыРекурсивно(Элементы.ГруппаСтрокиЭлементы, МассивУдаляемыхЭлементов, МассивУдаляемыхРеквизитов);
		УдалитьЭлементыРекурсивно(Элементы.ГруппаПоказателиЭлементы, МассивУдаляемыхЭлементов, МассивУдаляемыхРеквизитов);
		УдалитьЭлементыРекурсивно(Элементы.ГруппаФильтрЭлементы, МассивУдаляемыхЭлементов, МассивУдаляемыхРеквизитов);
		УдалитьЭлементыРекурсивно(Элементы.ГруппаДополнительныеНастройки, МассивУдаляемыхЭлементов, МассивУдаляемыхРеквизитов);
		Для Каждого Элемент Из МассивУдаляемыхЭлементов Цикл
			Элементы.Удалить(Элемент);
		КонецЦикла; 
	КонецЕсли; 
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	МассивИмен = Новый Массив;
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Создан", Ложь);
	СтруктураОтбора.Вставить("Скрыт", Ложь);
	Идентификаторы = ИдентификаторыСтрок(ПоляНастроек, СтруктураОтбора, Истина);
	Для Каждого Идентификатор Из Идентификаторы Цикл
		Стр = ПоляНастроек.НайтиПоИдентификатору(Идентификатор);
		Для Каждого Элемент Из Стр.Реквизиты Цикл
			Если Не МассивИмен.Найти(Элемент.Ключ)=Неопределено Тогда
				Продолжить;
			КонецЕсли;
			// Булевые фильтры отображаем с тремя состояниями 
			Если Стр.Тип=ТипФильтр() 
				И ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(Стр.ТипЗначения, Тип("Булево")) 
				И НЕ Стр.ВидЭлемента="Флажок" 
				И НЕ Стр.ВидЭлемента="Булево" Тогда
				ОписаниеТипов = Новый ОписаниеТипов("ПеречислениеСсылка.БулевоТриСостояния");
				МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(Элемент.Ключ, ОписаниеТипов,, Стр.Заголовок));
			Иначе
				МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(Элемент.Ключ, Стр.ТипЗначения,, Стр.Заголовок));
			КонецЕсли; 
			МассивИмен.Добавить(Элемент.Ключ);
		КонецЦикла; 
	КонецЦикла;
	
	Если МассивДобавляемыхРеквизитов.Количество()>0 ИЛИ МассивУдаляемыхРеквизитов.Количество()>0 Тогда
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов, МассивУдаляемыхРеквизитов);
	КонецЕсли; 
	
	Для Каждого Идентификатор Из Идентификаторы Цикл
		Стр = ПоляНастроек.НайтиПоИдентификатору(Идентификатор);
		Если Стр.Тип=ТипПоказатель() ИЛИ Стр.Тип=ТипГруппаПоказателей() Тогда
			ДобавитьЭлементГруппаПоказателейПоказатель(Стр);
		ИначеЕсли Стр.Тип=ТипГруппировка() Тогда
			ДобавитьЭлементГруппировка(Стр);
		ИначеЕсли Стр.Тип=ТипРеквизит() Тогда
			ДобавитьЭлементРеквизит(Стр);
		ИначеЕсли Стр.Тип=ТипПараметр() Тогда
			Если Стр.ВидЭлемента="Поле" Тогда
				Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.ДоступныеПараметры.НайтиПараметр(Новый  ПараметрКомпоновкиДанных(Стр.Поле));
				Если ЗначениеЗаполнено(Параметр.ДоступныеЗначения) Тогда
					ПараметрыВыбора = Параметр.ДоступныеЗначения;
				Иначе
					ПараметрыВыбора = Неопределено;  					
				КонецЕсли; 
			Иначе
				ПараметрыВыбора = Неопределено;
			КонецЕсли; 
			ОтчетыСервер.ДобавитьЭлементФильтр(Стр, ЭтаФорма, ПараметрыВыбора, Неопределено);
		ИначеЕсли Стр.Тип=ТипФильтр() Тогда
			СвязиПараметровВыбора = Неопределено;
			Если Стр.ВидЭлемента="Поле" Тогда
				Поле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(Стр.Поле));
				
				Если Поле = Неопределено Тогда
					ПараметрыВыбора = Неопределено;
				Иначе
					ПараметрыВыбора = ОпределитьПараметрыВыбора(Поле);
					СвязиПараметровВыбора = ОпределитьСвязиПараметровВыбора(Поле);   	
					Если Не ЗначениеЗаполнено(ПараметрыВыбора) 
						И ТипЗнч(Поле.ДоступныеЗначения) = Тип("СписокЗначений") И Поле.ДоступныеЗначения.Количество() > 0 Тогда
							
						ПараметрыВыбора = Поле.ДоступныеЗначения;						
					КонецЕсли;   
				КонецЕсли; 
				
				// Убираем отбор по ролям в поле "Менеджер презентации".
				Если Поле <> Неопределено
					И ПараметрыВыбора <> Неопределено
					И Поле.Заголовок = "Менеджер презентации" Тогда
					
					ОтборРоли = ПараметрыВыбора.Найти("Отбор.РольПользователя");
					Если ОтборРоли <> Неопределено Тогда
						ПараметрыВыбора.Удалить(ОтборРоли);
					КонецЕсли;
				КонецЕсли;
			
			Иначе
				ПараметрыВыбора = Неопределено;
			КонецЕсли; 
			
		
			ОтчетыСервер.ДобавитьЭлементФильтр(Стр, ЭтаФорма, ПараметрыВыбора, СвязиПараметровВыбора);
		КонецЕсли; 
		Стр.Создан = Истина;
	КонецЦикла;
	
	// Заполним значения фильтров и параметров
	Для Каждого Идентификатор Из Идентификаторы Цикл
		Стр = ПоляНастроек.НайтиПоИдентификатору(Идентификатор);
		Если Не Стр.Тип=ТипФильтр() И НЕ Стр.Тип=ТипПараметр() Тогда
			Продолжить;
		КонецЕсли;
		Если Стр.ВидЭлемента="Тумблер" И Стр.ТипЗначения.СодержитТип(Тип("Булево")) Тогда
			Для Каждого Реквизит Из Стр.Реквизиты Цикл
				Если Стр.ЗначениеПоУмолчанию=Истина Тогда
					ЭтаФорма[Реквизит.Ключ] = Перечисления.БулевоТриСостояния.Истина;
				ИначеЕсли Стр.ЗначениеПоУмолчанию=Ложь Тогда
					ЭтаФорма[Реквизит.Ключ] = Перечисления.БулевоТриСостояния.Ложь;
				Иначе
					ЭтаФорма[Реквизит.Ключ] = Перечисления.БулевоТриСостояния.НеИзменять;
				КонецЕсли; 
			КонецЦикла;
		ИначеЕсли Стр.ВидЭлемента="Флажок" Тогда
			Для Каждого Реквизит Из Стр.Реквизиты Цикл
				Если (ТипЗнч(Стр.ЗначениеПоУмолчанию)=Тип("СписокЗначений") 
					И НЕ Стр.ЗначениеПоУмолчанию.НайтиПоЗначению(Реквизит.Значение)=Неопределено)
					ИЛИ Стр.ЗначениеПоУмолчанию=Реквизит.Значение Тогда
					ЭтаФорма[Реквизит.Ключ] = Истина;
				Иначе
					ЭтаФорма[Реквизит.Ключ] = Ложь;
				КонецЕсли; 
			КонецЦикла;
		ИначеЕсли Стр.ВидЭлемента="Тумблер" И ЗначениеЗаполнено(Стр.ЗначениеПоУмолчанию) Тогда
			Для Каждого Реквизит Из Стр.Реквизиты Цикл
				ЭтаФорма[Реквизит.Ключ] = Стр.ЗначениеПоУмолчанию;
			КонецЦикла; 
		ИначеЕсли Не Стр.ВидЭлемента="Поле" ИЛИ Стр.Тип=ТипПараметр() Тогда
			Для Каждого Реквизит Из Стр.Реквизиты Цикл
				ЭтаФорма[Реквизит.Ключ] = Реквизит.Значение;
			КонецЦикла; 
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область ИсправлениеНастроек

&НаСервере
Процедура ВосставноитьДинамическиеПериодыРекурсивно(ЭлементыСтруктуры)
	
	Для Каждого Элемент Из ЭлементыСтруктуры Цикл
		Если ТипЗнч(Элемент)=Тип("ТаблицаКомпоновкиДанных") Тогда
			ВосставноитьДинамическиеПериодыРекурсивно(Элемент.Строки);
			ВосставноитьДинамическиеПериодыРекурсивно(Элемент.Колонки);
		ИначеЕсли ТипЗнч(Элемент)=Тип("ДиаграммаКомпоновкиДанных") Тогда
			ВосставноитьДинамическиеПериодыРекурсивно(Элемент.Серии);
			ВосставноитьДинамическиеПериодыРекурсивно(Элемент.Точки);
		ИначеЕсли ТипЗнч(Элемент)=Тип("ГруппировкаКомпоновкиДанных") 
			ИЛИ ТипЗнч(Элемент)=Тип("ГруппировкаТаблицыКомпоновкиДанных")
			ИЛИ ТипЗнч(Элемент)=Тип("ГруппировкаДиаграммыКомпоновкиДанных") Тогда
			Для Каждого Поле Из Элемент.ПоляГруппировки.Элементы Цикл
				Если ТипЗнч(Поле)=Тип("ПолеГруппировкиКомпоновкиДанных") Тогда
					Если Поле.Поле=Новый ПолеКомпоновкиДанных("ДинамическийПериод") Тогда
						Поле.Использование = Истина;
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла;
			ВосставноитьДинамическиеПериодыРекурсивно(Элемент.Структура);
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ИсправитьНастройкиВарианта()
	
	ИсправитьГруппировкиРекурсивно(Отчет.КомпоновщикНастроек.Настройки.Структура);
	
КонецПроцедуры

&НаСервере
Процедура ИсправитьГруппировкиРекурсивно(ЭлементыСтруктуры)
	
	Схема = ПолучитьИзВременногоХранилища(НастройкиОтчета.АдресСхемы);
	Для Каждого Элемент Из ЭлементыСтруктуры Цикл
		Если ТипЗнч(Элемент)=Тип("ТаблицаКомпоновкиДанных") Тогда
			ИсправитьГруппировкиРекурсивно(Элемент.Строки);
			ИсправитьГруппировкиРекурсивно(Элемент.Колонки);
		ИначеЕсли ТипЗнч(Элемент)=Тип("ДиаграммаКомпоновкиДанных") Тогда
			ИсправитьГруппировкиРекурсивно(Элемент.Серии);
			ИсправитьГруппировкиРекурсивно(Элемент.Точки);
		ИначеЕсли ТипЗнч(Элемент)=Тип("ГруппировкаКомпоновкиДанных") 
			ИЛИ ТипЗнч(Элемент)=Тип("ГруппировкаТаблицыКомпоновкиДанных")
			ИЛИ ТипЗнч(Элемент)=Тип("ГруппировкаДиаграммыКомпоновкиДанных") Тогда
			Если ЭтоПустаяГруппировка(Элемент, Отчет.КомпоновщикНастроек.Настройки) Тогда
				СкопироватьСтруктуруРекурсивно(Элемент.Структура, ЭлементыСтруктуры, Схема);
				ЭлементыСтруктуры.Удалить(Элемент);
				Продолжить;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоПустаяГруппировка(Группировка, Настройки)
	
	Если Группировка.ПоляГруппировки.Элементы.Количество()=0 Тогда
		// Детальные записи
		Возврат Ложь;
	КонецЕсли; 
	
	Для Каждого Поле Из Группировка.ПоляГруппировки.Элементы Цикл
		Если ТипЗнч(Поле)=Тип("АвтоПолеГруппировкиКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		Если Поле.Поле=Новый ПолеКомпоновкиДанных("ДинамическийПериод") Тогда
			Возврат Ложь;
		КонецЕсли; 
		ДоступноеПоле = Настройки.ДоступныеПоляГруппировок.НайтиПоле(Поле.Поле);
		Если Не ДоступноеПоле=Неопределено Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЦикла;
	Возврат Истина;
	
КонецФункции

#КонецОбласти 

#Область Группировки

&НаСервере
Процедура ЗаполнитьВариантыГруппировкиКолонок()
	
	Элементы.ПолеГруппировкиКолонок.СписокВыбора.Очистить();
	Элементы.ПолеГруппировкиКолонок.СписокВыбора.Добавить("", НСтр("ru = 'Не группировать'"));
	
	ДополнительныеГруппировкиКолонок = ?(НастройкиОтчета.Свойство("ДополнительныеГруппировкиКолонок"), НастройкиОтчета.ДополнительныеГруппировкиКолонок, Неопределено);
	Если ТипЗнч(ДополнительныеГруппировкиКолонок)=Тип("СписокЗначений") Тогда
		Для Каждого ОписаниеПоля Из ДополнительныеГруппировкиКолонок Цикл
			Если ПустаяСтрока(ОписаниеПоля.Представление) Тогда
				ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных(ОписаниеПоля.Значение));
				Если ДоступноеПоле=Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ПредставлениеПоля = ДоступноеПоле.Заголовок;
			Иначе
				ПредставлениеПоля = ОписаниеПоля.Представление;
			КонецЕсли; 
			Элементы.ПолеГруппировкиКолонок.СписокВыбора.Добавить(ОписаниеПоля.Значение, ПредставлениеПоля);
		КонецЦикла; 
	КонецЕсли; 
	
	Если НастройкиОтчета.РазрешитьДобавлениеПрочихГруппировокКолонок Тогда
		Элементы.ПолеГруппировкиКолонок.СписокВыбора.Добавить("<Прочие>", НСтр("ru = 'Прочее'"),, БиблиотекаКартинок.Выбрать);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ДобавитьОписаниеГруппировки(Путь, НестандартныйОбработчик = Ложь, ТипГруппировки = Неопределено)
	
	Поле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных(Путь));
	Если Поле=Неопределено Тогда
		Возврат "";
	КонецЕсли; 
	ИмяРеквизита = НовоеИмяРеквизита(ТипГруппировка());
	
	Стр = СтрокаОписанияПоля(ТипГруппировка(), Путь, ПоляНастроек);
	Если Стр=Неопределено Тогда
		ИндексВставки = ИндексВставкиГруппировки(Путь);
		Если ИндексВставки=Неопределено Тогда
			Стр = ПоляНастроек.ПолучитьЭлементы().Добавить();
		Иначе
			Стр = ПоляНастроек.ПолучитьЭлементы().Вставить(ИндексВставки);
		КонецЕсли; 
		Стр.Тип = ТипГруппировка();
		Стр.Поле = Путь;
	Иначе
		Если Стр.Создан Тогда
			Возврат "";
		КонецЕсли;
		Стр.Скрыт = Ложь;
	КонецЕсли;
	Стр.Заголовок = Поле.Заголовок;
	Стр.Реквизиты = Новый Структура(ИмяРеквизита, Истина);
	Стр.Элементы = Новый Структура;
	Стр.ВидЭлемента = "Флажок";
	Стр.ТипЗначения = Новый ОписаниеТипов("Булево");
	Стр.НестандартныйОбработчик = НестандартныйОбработчик;
	Стр.ДополнительныеПараметры = Новый Структура;
	Стр.ДополнительныеПараметры.Вставить("ТипГруппировки", ?(ТипГруппировки=Неопределено, ТипГруппировкиКомпоновкиДанных.Элементы, ТипГруппировки));
	ОпределитьНачальноеПоложение(Стр, Поле);
	
	ВнестиИзмененияВРеквизитыНаФорме(Ложь);
	Возврат ИмяРеквизита;
	
КонецФункции

&НаСервере
Функция ИндексВставкиГруппировки(ИмяПоля)
	
	Схема = ПолучитьИзВременногоХранилища(НастройкиОтчета.АдресСхемы);
	ПолеСхемы = ОтчетыСервер.ПолеСхемы(Схема, ИмяПоля);
	
	Индекс = Неопределено;
	// Проверка: группировки-периоды должны располагаться в порядке нумерации периодов
	Если ТипЗнч(ПолеСхемы)=Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") И ПолеСхемы.Роль.НомерПериода>0 Тогда
		Для Каждого Стр Из ПоляНастроек.ПолучитьЭлементы() Цикл
			Если Не Стр.Тип=ТипГруппировка() Тогда
				Продолжить;
			КонецЕсли; 
			Если ЗначениеЗаполнено(Стр.Поле) Тогда
				ПолеГруппировки = ОтчетыСервер.ПолеСхемы(Схема, Стр.Поле);
				Если ТипЗнч(ПолеГруппировки)=Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") И НЕ ПолеГруппировки.Роль.НомерПериода=0 И ПолеГруппировки.Роль.НомерПериода<ПолеСхемы.Роль.НомерПериода Тогда
					Индекс = ?(Индекс=Неопределено, ПоляНастроек.ПолучитьЭлементы().Индекс(Стр), Мин(Индекс, ПоляНастроек.ПолучитьЭлементы().Индекс(Стр)));
					Прервать;
				КонецЕсли;
			Иначе
				Для Каждого ПодСтр Из Стр.ПолучитьЭлементы() Цикл
					Если Не ПодСтр.Тип=ТипРеквизит() Тогда
						Продолжить;
					КонецЕсли; 
					ПолеГруппировки = ОтчетыСервер.ПолеСхемы(Схема, ПодСтр.Поле);
					Если ТипЗнч(ПолеГруппировки)=Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") И НЕ ПолеГруппировки.Роль.НомерПериода=0 И ПолеГруппировки.Роль.НомерПериода<ПолеСхемы.Роль.НомерПериода Тогда
						Индекс = ?(Индекс=Неопределено, ПоляНастроек.ПолучитьЭлементы().Индекс(Стр), Мин(Индекс, ПоляНастроек.ПолучитьЭлементы().Индекс(Стр)));
						Прервать;
					КонецЕсли;
				КонецЦикла; 
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	
	Возврат Индекс;
	
КонецФункции

&НаСервере
Функция ПроверитьСовместимостьГруппировокКолонок(ИмяПоляПроверки = "")
	
	Результат = Истина;
	
	Если Не ЗначениеЗаполнено(ПолеГруппировкиКолонок) И НЕ ЗначениеЗаполнено(ПолеСравнения) Тогда
		Возврат Результат;
	КонецЕсли; 
	
	Если ТипЗнч(ПолеСравнения)=Тип("ПеречислениеСсылка.Периодичность") Тогда
		СтрокаДлительностьПериода = ОбщегоНазначения.ИмяЗначенияПеречисления(ПолеСравнения);
		ИмяСравнения = "Период" + СтрокаДлительностьПериода;
	Иначе
		ИмяСравнения = ПолеСравнения;
	КонецЕсли;
	
	Схема = ПолучитьИзВременногоХранилища(НастройкиОтчета.АдресСхемы);
	Если ЗначениеЗаполнено(ПолеГруппировкиКолонок) Тогда
		ГруппировкаКолонокСхемы = ОтчетыСервер.ПолеСхемы(Схема, ПолеГруппировкиКолонок);
		ГруппировкаКолонокПериод = (ТипЗнч(ГруппировкаКолонокСхемы)=Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") И ГруппировкаКолонокСхемы.Роль.НомерПериода>0);
	Иначе
		ГруппировкаКолонокСхемы = Неопределено;
		ГруппировкаКолонокПериод = Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(ИмяСравнения) Тогда
		СравнениеСхемы = ОтчетыСервер.ПолеСхемы(Схема, ИмяСравнения);
		СравнениеПериод = (ТипЗнч(СравнениеСхемы)=Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") И СравнениеСхемы.Роль.НомерПериода>0);
	Иначе
		СравнениеСхемы = Неопределено;
		СравнениеПериод = Ложь;
	КонецЕсли; 	
	
	Если Не ГруппировкаКолонокПериод И НЕ СравнениеПериод Тогда
		Возврат Результат;
	КонецЕсли; 
	
	МассивПолей = Новый Массив;
	Если Не ПустаяСтрока(ИмяПоляПроверки) Тогда
		МассивПолей.Добавить(ИмяПоляПроверки);
	Иначе
		ПоляГруппировокРекурсивно(МассивПолей, Отчет.КомпоновщикНастроек.Настройки.Структура, Истина);
	КонецЕсли; 
	Для Каждого ИмяПоля Из МассивПолей Цикл
		Поле = ОтчетыСервер.ПолеСхемы(Схема, ИмяПоля);
		Если Не ТипЗнч(Поле)=Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		Если Поле.Роль.НомерПериода=0 Тогда
			Продолжить;
		КонецЕсли;
		Если (ГруппировкаКолонокПериод И НЕ ИмяПоля=ПолеГруппировкиКолонок) ИЛИ (СравнениеПериод И НЕ ИмяПоля=ИмяСравнения) Тогда
			Если Не ПустаяСтрока(ИмяПоляПроверки) Тогда
				Если ГруппировкаКолонокПериод И НЕ ИмяПоля=ПолеГруппировкиКолонок Тогда
					ОписаниеПоля = """"+?(ПустаяСтрока(ГруппировкаКолонокСхемы.Заголовок), ГруппировкаКолонокСхемы.Поле, ГруппировкаКолонокСхемы.Заголовок)+"""";
					ОписаниеПоля = ОписаниеПоля+НСтр("ru = ' в колонках отчета'");
				ИначеЕсли СравнениеПериод И НЕ ИмяПоля=ИмяСравнения Тогда
					ОписаниеПоля = """"+?(ПустаяСтрока(СравнениеСхемы.Заголовок), СравнениеСхемы.Поле, СравнениеСхемы.Заголовок)+"""";
					ОписаниеПоля = ОписаниеПоля+НСтр("ru = ' в колонках отчета'");
				КонецЕсли; 
			Иначе
				ОписаниеПоля = """"+?(ПустаяСтрока(Поле.Заголовок), Поле.Поле, Поле.Заголовок)+"""";
				ОписаниеПоля = ОписаниеПоля+НСтр("ru = ' в строках отчета'");
				Если ГруппировкаКолонокПериод И НЕ ИмяПоля=ПолеГруппировкиКолонок Тогда
					ПолеГруппировкиКолонок = Неопределено;
				КонецЕсли; 
				Если СравнениеПериод И НЕ ИмяПоля=ИмяСравнения Тогда
					ПолеСравнения = Неопределено;
				КонецЕсли;
			КонецЕсли; 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Запрещено использование в строках и колонках различных полей-периодов. Предварительно отключите поле %1'"),
			ОписаниеПоля));
			Результат = Ложь;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДобавитьОписаниеРеквизита(Путь, НестандартныйОбработчик = Ложь, ИдентификаторРодителя, ОбновлятьФорму = Истина)
	
	СтрРодитель = ПоляНастроек.НайтиПоИдентификатору(ИдентификаторРодителя);
	
	Если Не ПустаяСтрока(СтрРодитель.Поле) Тогда
		// Добавление вложенного реквизита для группировки
		ИмяПоля = СтрРодитель.Поле;
		СтрРодитель.Поле = "";
		ДобавитьОписаниеРеквизита(ИмяПоля, НестандартныйОбработчик, ИдентификаторРодителя, Ложь);
		// Для группировки с несколькими полями вид иерархии только по элементам
		Если СтрРодитель.ДополнительныеПараметры.Свойство("ТипГруппировки") И НЕ СтрРодитель.ДополнительныеПараметры.ТипГруппировки=ТипГруппировкиКомпоновкиДанных.Элементы Тогда
			СтрРодитель.ДополнительныеПараметры.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
		КонецЕсли; 
		// Отключаем возможность изменять вид иерархии группировки с несколькими полями
		Для Каждого ОписаниеЭлемента Из СтрРодитель.Элементы Цикл
			Если Не Элементы.Найти(ОписаниеЭлемента.Ключ+"_Иерархия")=Неопределено Тогда
				Элементы[ОписаниеЭлемента.Ключ+"_Иерархия"].Видимость = Ложь;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	Поле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных(Путь));
	Если Поле=Неопределено Тогда
		Возврат "";
	КонецЕсли; 
	ИмяРеквизита = НовоеИмяРеквизита(ТипРеквизит());
	
	Стр = СтрокаОписанияПоля(ТипРеквизит(), Путь, ПоляНастроек);
	Если Стр=Неопределено Тогда
		Стр = СтрРодитель.ПолучитьЭлементы().Добавить();
		Стр.Тип = ТипРеквизит();
		Стр.Поле = Путь;
	Иначе
		Если Стр.Создан Тогда
			Возврат "";
		КонецЕсли;
		Стр.Скрыт = Ложь;
	КонецЕсли;
	Стр.Заголовок = Поле.Заголовок;
	Стр.Реквизиты = Новый Структура(ИмяРеквизита, Истина);
	Стр.Элементы = Новый Структура;
	Стр.ВидЭлемента = "Флажок";
	Стр.ТипЗначения = Новый ОписаниеТипов("Булево");
	Стр.НестандартныйОбработчик = НестандартныйОбработчик;
	Стр.ДополнительныеПараметры = Новый Структура;
	Стр.ДополнительныеПараметры.Вставить("ТипГруппировки", ТипГруппировкиКомпоновкиДанных.Элементы);
	
	Если ОбновлятьФорму Тогда
		ВнестиИзмененияВРеквизитыНаФорме(Ложь);
	КонецЕсли;
	
	// Обновление заголовка группировки
	СтрРодитель.Заголовок = ЗаголовокГруппыПолей(СтрРодитель);
	ОбновитьЗаголовокЭлемента(СтрРодитель); 
	
	Возврат ИмяРеквизита;
	
КонецФункции

&НаСервере
Функция ЗаголовокГруппыПолей(СтрРодитель)
	
	ЗаголовокГруппировки = "";
	Для Каждого СтрРеквизита Из СтрРодитель.ПолучитьЭлементы() Цикл
		ЗаголовокГруппировки = ЗаголовокГруппировки+?(ПустаяСтрока(ЗаголовокГруппировки), "", ", ")+СтрРеквизита.Заголовок;
	КонецЦикла;
	Возврат ЗаголовокГруппировки;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОписанияГруппировок()
	
	ДобавитьОписанияГруппировокРекурсивно(Отчет.КомпоновщикНастроек.Настройки.Структура);
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(НастройкиОтчета.АдресСхемы);
	УдалитьНеиспользуемыеГруппировкиРекурсивно(Отчет.КомпоновщикНастроек.Настройки.Структура, СхемаКомпоновкиДанных);
	
	ДополнительныеСвойства = Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	Если ДополнительныеСвойства.Свойство("Сравнение") И ЗначениеЗаполнено(ДополнительныеСвойства.Сравнение) И НЕ ЗначениеЗаполнено(ПолеСравнения) Тогда
		ПолеСравнения = ДополнительныеСвойства.Сравнение;
		Если ДополнительныеСвойства.Свойство("ПоказыватьАбсолютноеИзменение") Тогда
			ПоказыватьАбсолютноеИзменение = ДополнительныеСвойства.ПоказыватьАбсолютноеИзменение;
		КонецЕсли; 
		Если ДополнительныеСвойства.Свойство("ПоказыватьОтносительноеИзменение") Тогда
			ПоказыватьОтносительноеИзменение = ДополнительныеСвойства.ПоказыватьОтносительноеИзменение;
		КонецЕсли; 
	КонецЕсли; 
	Если ДополнительныеСвойства.Свойство("ГруппировкаКолонок") И ЗначениеЗаполнено(ДополнительныеСвойства.ГруппировкаКолонок) И НЕ ЗначениеЗаполнено(ПолеГруппировкиКолонок) Тогда
		ПолеГруппировкиКолонок = ДополнительныеСвойства.ГруппировкаКолонок;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьНеиспользуемыеГруппировкиРекурсивно(Структура, СхемаКомпоновкиДанных)
	
	МассивКУдалению = Новый Массив;
	Для Каждого Элемент Из Структура Цикл
		Если ТипЗнч(Элемент)=Тип("ТаблицаКомпоновкиДанных") Тогда
			УдалитьНеиспользуемыеГруппировкиРекурсивно(Элемент.Строки, СхемаКомпоновкиДанных);
			УдалитьНеиспользуемыеГруппировкиРекурсивно(Элемент.Колонки, СхемаКомпоновкиДанных);
		ИначеЕсли ТипЗнч(Элемент)=Тип("ГруппировкаКомпоновкиДанных") ИЛИ ТипЗнч(Элемент)=Тип("ГруппировкаТаблицыКомпоновкиДанных") Тогда
			Если Не Элемент.Использование Тогда
				СкопироватьСтруктуруРекурсивно(Элемент.Структура, Структура, СхемаКомпоновкиДанных);
				МассивКУдалению.Добавить(Элемент);
				Продолжить;
			КонецЕсли;
			УдалитьНеиспользуемыеГруппировкиРекурсивно(Элемент.Структура, СхемаКомпоновкиДанных);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Элемент Из МассивКУдалению Цикл
		Структура.Удалить(Элемент);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОписанияГруппировокРекурсивно(ЭлементыСтруктуры, ЭтоСтрока = Истина)
	
	Для Каждого Элемент Из ЭлементыСтруктуры Цикл
		Если ТипЗнч(Элемент)=Тип("ТаблицаКомпоновкиДанных") Тогда
			ДобавитьОписанияГруппировокРекурсивно(Элемент.Строки);
			ДобавитьОписанияГруппировокРекурсивно(Элемент.Колонки, Ложь);
		ИначеЕсли ЭтоСтрока И (ТипЗнч(Элемент)=Тип("ГруппировкаКомпоновкиДанных") ИЛИ ТипЗнч(Элемент)=Тип("ГруппировкаТаблицыКомпоновкиДанных")) Тогда
			ИмяРеквизита = НовоеИмяРеквизита(ТипГруппировка());
			ЗаголовокГруппировки = Строка(Элемент.ПоляГруппировки);
			Если ПустаяСтрока(ЗаголовокГруппировки) Тогда
				ЗаголовокГруппировки = НСтр("ru = '<Детальные записи>'");
			КонецЕсли; 
			Стр = ДобавитьОписаниеНастройки(ПоляНастроек.ПолучитьЭлементы(), ТипГруппировка(), ИмяРеквизита, ЗаголовокГруппировки, Элемент);
			Если Стр=Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			Стр.Реквизиты.Вставить(ИмяРеквизита, Элемент.Использование);
			ОпределитьНачальноеПоложение(Стр, Элемент);
			Если Элемент.ПоляГруппировки.Элементы.Количество()=1 Тогда
				Поле = Элемент.ПоляГруппировки.Элементы[0];
				Стр.Поле = Строка(Поле.Поле);
				Стр.ДополнительныеПараметры.Вставить("ТипГруппировки", Поле.ТипГруппировки);
			Иначе
				// Добавление описаний отдельных полей группировкок, если их несколько
				Для Каждого Поле Из Элемент.ПоляГруппировки.Элементы Цикл
					Если ТипЗнч(Поле) = Тип("АвтоПолеГруппировкиКомпоновкиДанных") Тогда
						Продолжить;
					КонецЕсли;      					
					Путь = Строка(Поле.Поле);
					ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(Поле.Поле);
					Если ДоступноеПоле=Неопределено Тогда
						Продолжить;
					КонецЕсли;
					СтрРеквизит = ДобавитьОписаниеНастройки(Стр.ПолучитьЭлементы(), ТипРеквизит(), Путь, ДоступноеПоле.Заголовок);
					Если СтрРеквизит=Неопределено Тогда
						Продолжить;
					КонецЕсли; 
					ИмяРеквизита = НовоеИмяРеквизита(ТипРеквизит());
					СтрРеквизит.Реквизиты.Вставить(ИмяРеквизита, Поле.Использование И Элемент.Использование);
					СтрРеквизит.ДополнительныеПараметры.Вставить("ТипГруппировки", Поле.ТипГруппировки);  
					ОпределитьНачальноеПоложение(СтрРеквизит, ДоступноеПоле);
				КонецЦикла; 
			КонецЕсли;
			ДобавитьОписанияГруппировокРекурсивно(Элемент.Структура);
		ИначеЕсли Не ЭтоСтрока И ТипЗнч(Элемент)=Тип("ГруппировкаТаблицыКомпоновкиДанных") Тогда
			Если Не Элемент.ПоляГруппировки.Элементы.Количество()=1 Тогда
				ДобавитьОписанияГруппировокРекурсивно(Элемент.Структура, ЭтоСтрока);
				Продолжить;
			КонецЕсли;
			Поле = Элемент.ПоляГруппировки.Элементы[0];
			ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(Поле.Поле);
			ИмяПоля = Строка(Поле.Поле);
			ДополнительныеСвойства = Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
			Если Не ДополнительныеСвойства.Свойство("ГруппировкаКолонок") И НЕ ДополнительныеСвойства.Свойство("Сравнение") Тогда
				// базовая версия отчета
				Если ИмяПоля="ДинамическийПериод" Тогда
					КоличествоПоказателей = КоличествоПоказателейСКД(Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы);
					Если КоличествоПоказателей>1 Тогда
						ПолеСравнения = Неопределено;
						ПоказыватьАбсолютноеИзменение = Ложь;
						ПоказыватьОтносительноеИзменение = Ложь;
						Элемент.Использование = Ложь;
						Продолжить;
					Иначе
						ЗначениеСравнения = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Периодичность"));
						ПолеСравнения = ЗначениеСравнения.Значение;
					КонецЕсли; 
				Иначе
					Если ЗначениеЗаполнено(ПолеГруппировкиКолонок) И НЕ ЗначениеЗаполнено(ПолеСравнения) И НастройкиОтчета.ИспользоватьСравнение Тогда
						Если Элементы.ПолеСравнения.СписокВыбора.НайтиПоЗначению(ПолеГруппировкиКолонок)=Неопределено Тогда
							ДоступноеПолеГруппировки = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(ПолеГруппировкиКолонок);
							Элементы.ПолеСравнения.СписокВыбора.Вставить(Элементы.ПолеСравнения.СписокВыбора.Количество()-1, ПолеГруппировкиКолонок, ДоступноеПолеГруппировки.Заголовок); 
						КонецЕсли;
						ПолеСравнения = ПолеГруппировкиКолонок;
					КонецЕсли; 
					Если Элементы.ПолеГруппировкиКолонок.СписокВыбора.НайтиПоЗначению(ИмяПоля)=Неопределено И НЕ ДоступноеПоле=Неопределено Тогда
						Элементы.ПолеГруппировкиКолонок.СписокВыбора.Вставить(Элементы.ПолеГруппировкиКолонок.СписокВыбора.Количество()-1, ИмяПоля, ДоступноеПоле.Заголовок); 
					КонецЕсли;
					ПолеГруппировкиКолонок = ИмяПоля;
				КонецЕсли; 
			ИначеЕсли ДополнительныеСвойства.Свойство("ГруппировкаКолонок") И НРег(ИмяПоля)=НРег(ДополнительныеСвойства.ГруппировкаКолонок) Тогда
				// определили группировку колонок
				Если Элементы.ПолеГруппировкиКолонок.СписокВыбора.НайтиПоЗначению(ИмяПоля)=Неопределено И НЕ ДоступноеПоле=Неопределено Тогда
					Элементы.ПолеГруппировкиКолонок.СписокВыбора.Вставить(Элементы.ПолеГруппировкиКолонок.СписокВыбора.Количество()-1, ИмяПоля, ДоступноеПоле.Заголовок); 
				КонецЕсли;
				ПолеГруппировкиКолонок = ИмяПоля;
			ИначеЕсли ДополнительныеСвойства.Свойство("Сравнение") И НРег(ИмяПоля)=НРег(ДополнительныеСвойства.Сравнение) Тогда
				КоличествоПоказателей = КоличествоПоказателейСКД(Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы);
				Если КоличествоПоказателей>1 Тогда
					// отключение режима сравнения
					ДополнительныеСвойства.Удалить("Сравнение");
					ПолеСравнения = Неопределено;
					ПоказыватьАбсолютноеИзменение = Ложь;
					ПоказыватьОтносительноеИзменение = Ложь;
					Элемент.Использование = Ложь;
					Продолжить;
				Иначе
					// определили сравнение
					Если Элементы.ПолеСравнения.СписокВыбора.НайтиПоЗначению(ИмяПоля)=Неопределено И НЕ ДоступноеПоле=Неопределено Тогда
						Элементы.ПолеСравнения.СписокВыбора.Вставить(Элементы.ПолеСравнения.СписокВыбора.Количество()-1, ИмяПоля, ДоступноеПоле.Заголовок); 
					КонецЕсли;
					ПолеСравнения = ИмяПоля;
				КонецЕсли; 
			ИначеЕсли ДополнительныеСвойства.Свойство("Сравнение") И ИмяПоля="ДинамическийПериод" И ТипЗнч(ДополнительныеСвойства.Сравнение)=Тип("ПеречислениеСсылка.Периодичность") Тогда
				КоличествоПоказателей = КоличествоПоказателейСКД(Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы);
				Если КоличествоПоказателей>1 Тогда
					// отключение режима сравнения
					ДополнительныеСвойства.Удалить("Сравнение");
					ПолеСравнения = Неопределено;
					ПоказыватьАбсолютноеИзменение = Ложь;
					ПоказыватьОтносительноеИзменение = Ложь;
					Элемент.Использование = Ложь;
					Продолжить;
				Иначе
					// определили сравнение по периоду
					Если Элементы.ПолеСравнения.СписокВыбора.НайтиПоЗначению(ДополнительныеСвойства.Сравнение)=Неопределено Тогда
						Элементы.ПолеСравнения.СписокВыбора.Вставить(Элементы.ПолеСравнения.СписокВыбора.Количество()-1, ДополнительныеСвойства.Сравнение); 
					КонецЕсли;
					ПолеСравнения = ДополнительныеСвойства.Сравнение;
				КонецЕсли; 
			КонецЕсли; 
			ДобавитьОписанияГруппировокРекурсивно(Элемент.Структура, ЭтоСтрока);
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьНачальноеПоложение(Стр, Группировка)
	
	РазвернутьГруппировку = Ложь;
	МассивПолей = Новый Массив;
	Если ТипЗнч(Группировка)=Тип("ДоступноеПолеКомпоновкиДанных") Тогда
		МассивПолей.Добавить(Группировка);
	Иначе
		Для Каждого Поле Из Группировка.ПоляГруппировки.Элементы Цикл
			Если Не ТипЗнч(Поле)=Тип("ПолеГруппировкиКомпоновкиДанных") ИЛИ НЕ Поле.Использование Тогда
				Продолжить;
			КонецЕсли; 
			ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(Поле.Поле);
			Если ДоступноеПоле=Неопределено Тогда
				Продолжить;
			КонецЕсли;
			МассивПолей.Добавить(ДоступноеПоле);
		КонецЦикла;
	КонецЕсли; 
	
	Для Каждого ДоступноеПоле Из МассивПолей Цикл
		РазвернутьПоле = Истина;
		Для Каждого Тип Из ДоступноеПоле.ТипЗначения.Типы() Цикл
			Если Тип=Тип("СправочникСсылка.Валюты") ИЛИ 
				Тип=Тип("СправочникСсылка.СтруктурныеЕдиницы") ИЛИ 
				Тип=Тип("СправочникСсылка.Кассы") ИЛИ 
				Тип=Тип("СправочникСсылка.БанковскиеСчета") ИЛИ 
				Тип=Тип("СправочникСсылка.Организации") ИЛИ 
				Перечисления.ТипВсеСсылки().СодержитТип(Тип) Тогда
				Продолжить;
			Иначе
				РазвернутьПоле = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если РазвернутьПоле Тогда
			РазвернутьГруппировку = Истина;
			Продолжить;
		Иначе
			РазвернутьГруппировку = Ложь;
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	Стр.ДополнительныеПараметры.Вставить("Развернуть", РазвернутьГруппировку);
	
КонецПроцедуры

&НаСервере
Функция СместитьГруппировку(Идентификатор, Шаг)
	
	Стр = ПоляНастроек.НайтиПоИдентификатору(Идентификатор);
	Группа = Элементы[Стр.ИмяГруппы];
	ГруппаРеквизитов = Элементы[СтрЗаменить(Стр.ИмяГруппы, "_Группа", "_Реквизиты")];
	ИмяРеквизита = СтрЗаменить(Стр.ИмяГруппы, "_Группа", "");
	
	Индекс = ПоляНастроек.ПолучитьЭлементы().Индекс(Стр);
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Тип", ТипГруппировка());
	Строки = СтрокиДерева(ПоляНастроек, СтруктураОтбора);
	ИндексВМассиве = Строки.Найти(Стр);
	Если ИндексВМассиве+Шаг<0 ИЛИ ИндексВМассиве+Шаг>=Строки.Количество() Тогда
		// Перемещение не требуется
		Возврат Ложь;
	Иначе
		СтрСмещения = Строки[ИндексВМассиве+Шаг];
		Если СтрСмещения.ПолучитьЭлементы().Количество()>0 И Стр.ПолучитьЭлементы().Количество()=0 И ПроверитьВозможностьДобавленияГруппировки(Стр, СтрСмещения) Тогда
			// Перемещаем в группу полей
			Если Шаг<0 Тогда
				НоваяСтрока = СтрСмещения.ПолучитьЭлементы().Добавить();
			Иначе
				НоваяСтрока = СтрСмещения.ПолучитьЭлементы().Вставить(0);
			КонецЕсли; 
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			НоваяСтрока.Тип = ТипРеквизит();
			ПоляНастроек.ПолучитьЭлементы().Удалить(Стр);
			ГруппаСмещения = Элементы[СтрЗаменить(СтрСмещения.ИмяГруппы, "_Группа", "_Реквизиты")];
			Если Шаг<0 Тогда
				Элементы.Переместить(Группа, ГруппаСмещения); 
				Элементы.Переместить(ГруппаРеквизитов, ГруппаСмещения);
			Иначе
				Элементы.Переместить(Группа, ГруппаСмещения, ГруппаСмещения.ПодчиненныеЭлементы[0]); 
				Элементы.Переместить(ГруппаРеквизитов, ГруппаСмещения, ГруппаСмещения.ПодчиненныеЭлементы[0]);
			КонецЕсли;
			ДобавитьОтступ(ИмяРеквизита, Группа);
			КартинкаИерархияГруппировки = Элементы.Найти(ИмяРеквизита+"_Иерархия");
			Если Не КартинкаИерархияГруппировки=Неопределено Тогда
				Элементы.Удалить(КартинкаИерархияГруппировки);
			КонецЕсли; 
		ИначеЕсли ИндексВМассиве+Шаг=Строки.Количество()-1 Тогда
			// Добавление в конец
			ПоляНастроек.ПолучитьЭлементы().Сдвинуть(Индекс, ПоляНастроек.ПолучитьЭлементы().Количество()-Индекс-1); 
			Элементы.Переместить(Группа, Элементы.ГруппаСтрокиЭлементы); 
			Элементы.Переместить(ГруппаРеквизитов, Элементы.ГруппаСтрокиЭлементы);
		Иначе
			СтрСоСмещением = Строки[ИндексВМассиве+Шаг];
			ИндексВставки = ПоляНастроек.ПолучитьЭлементы().Индекс(СтрСоСмещением);
			ПоляНастроек.ПолучитьЭлементы().Сдвинуть(Индекс, ИндексВставки-Индекс);
			Если Шаг>0 Тогда
				СтрВставки = Строки[ИндексВМассиве+Шаг+1];
			Иначе
				СтрВставки = СтрСоСмещением;
			КонецЕсли; 
			Элементы.Переместить(Группа, Элементы.ГруппаСтрокиЭлементы, Элементы[СтрВставки.ИмяГруппы]); 
			Элементы.Переместить(ГруппаРеквизитов, Элементы.ГруппаСтрокиЭлементы, Элементы[СтрВставки.ИмяГруппы]); 
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПроверитьВозможностьДобавленияГруппировки(Стр, СтрГруппа)
	
	Схема = ПолучитьИзВременногоХранилища(НастройкиОтчета.АдресСхемы);
	
	// Группировки-периоды нельзя включать в группы с другими группировками
	ПолеСхемы = ОтчетыСервер.ПолеСхемы(Схема, Стр.Поле);
	Если ТипЗнч(ПолеСхемы)=Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") И ПолеСхемы.Роль.НомерПериода>0 Тогда
		Для Каждого ПодСтр Из СтрГруппа.ПолучитьЭлементы() Цикл
			ВложенноеПоле = ОтчетыСервер.ПолеСхемы(Схема, ПодСтр.Поле);
			Если ТипЗнч(ВложенноеПоле)=Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") И ВложенноеПоле.Роль.НомерПериода=0 Тогда
				Возврат Ложь;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция СместитьРеквизит(Идентификатор, Шаг)
	
	Стр = ПоляНастроек.НайтиПоИдентификатору(Идентификатор);
	Группа = Элементы[Стр.ИмяГруппы];
	ГруппаРеквизитов = Элементы[СтрЗаменить(Стр.ИмяГруппы, "_Группа", "_Реквизиты")];
	ИмяРеквизита = СтрЗаменить(Стр.ИмяГруппы, "_Группа", "");
	
	СтрокаРодитель = Стр.ПолучитьРодителя();
	Строки = СтрокаРодитель.ПолучитьЭлементы();
	Индекс = Строки.Индекс(Стр);
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Тип", ТипГруппировка());
	СтрокиГруппировки = СтрокиДерева(ПоляНастроек, СтруктураОтбора);
	ИндексГруппировки = СтрокиГруппировки.Найти(СтрокаРодитель);
	
	Если Индекс+Шаг<0 Тогда
		// Вынос из группы
		Если Строки.Количество()<=1 Тогда
			// Последнюю строку не выносим
			Возврат Ложь;
		КонецЕсли; 
		НоваяСтрока = ПоляНастроек.ПолучитьЭлементы().Вставить(ПоляНастроек.ПолучитьЭлементы().Индекс(СтрокаРодитель));
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		НоваяСтрока.Тип = ТипГруппировка();
		Строки.Удалить(Стр);
		СтрокаРодитель.Заголовок = ЗаголовокГруппыПолей(СтрокаРодитель);
		ОбновитьЗаголовокЭлемента(СтрокаРодитель);
		КартинкаОтступ = Элементы[СтрЗаменить(Стр.ИмяГруппы, "_Группа", "_Отступ")];
		Элементы.Удалить(КартинкаОтступ);
		ДобавитьПереключательИерархииГруппировки(Стр, ИмяРеквизита, Группа);
		Элементы.Переместить(Группа, Элементы.ГруппаСтрокиЭлементы, Элементы[СтрокаРодитель.ИмяГруппы]);
		Элементы.Переместить(ГруппаРеквизитов, Элементы.ГруппаСтрокиЭлементы, Элементы[СтрокаРодитель.ИмяГруппы]);
	ИначеЕсли Индекс+Шаг>=Строки.Количество() Тогда
		// Вынос из группы
		Если Строки.Количество()<=1 Тогда
			// Последнюю строку не выносим
			Возврат Ложь;
		КонецЕсли; 
		ИндексВставки = ПоляНастроек.ПолучитьЭлементы().Индекс(СтрокаРодитель)+1;
		ИндексВМассиве = СтрокиГруппировки.Найти(СтрокаРодитель)+1;
		Если ИндексВМассиве>=СтрокиГруппировки.Количество() Тогда
			НоваяСтрока = ПоляНастроек.ПолучитьЭлементы().Добавить();
		Иначе
			НоваяСтрока = ПоляНастроек.ПолучитьЭлементы().Вставить(ИндексВставки);
		КонецЕсли; 
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		НоваяСтрока.Тип = ТипГруппировка();
		Строки.Удалить(Стр);
		СтрокаРодитель.Заголовок = ЗаголовокГруппыПолей(СтрокаРодитель);
		ОбновитьЗаголовокЭлемента(СтрокаРодитель);
		КартинкаОтступ =Элементы[СтрЗаменить(Стр.ИмяГруппы, "_Группа", "_Отступ")];
		Элементы.Удалить(КартинкаОтступ);
		ДобавитьПереключательИерархииГруппировки(Стр, ИмяРеквизита, Группа);
		Если ИндексВМассиве>=СтрокиГруппировки.Количество() Тогда
			Элементы.Переместить(Группа, Элементы.ГруппаСтрокиЭлементы);
			Элементы.Переместить(ГруппаРеквизитов, Элементы.ГруппаСтрокиЭлементы);
		Иначе
			СтрокаВставки = ПоляНастроек.ПолучитьЭлементы().Получить(ИндексВставки+1);
			Элементы.Переместить(Группа, Элементы.ГруппаСтрокиЭлементы, Элементы[СтрокаВставки.ИмяГруппы]);
			Элементы.Переместить(ГруппаРеквизитов, Элементы.ГруппаСтрокиЭлементы, Элементы[СтрокаВставки.ИмяГруппы]);
		КонецЕсли; 
	ИначеЕсли Индекс+Шаг=Строки.Количество()-1 Тогда
		// Добавление в конец
		Строки.Сдвинуть(Индекс, СтрокаРодитель.ПолучитьЭлементы().Количество()-Индекс-1); 
		Элементы.Переместить(Группа, Группа.Родитель); 
		Элементы.Переместить(ГруппаРеквизитов, Группа.Родитель); 
	Иначе
		Если Шаг=-1 Тогда
			СтрВставки = Строки[Индекс-1];
		Иначе
			СтрВставки = Строки[Индекс+2];
		КонецЕсли;
		СтрокаРодитель.ПолучитьЭлементы().Сдвинуть(Индекс, Шаг);
		ГруппаВставки = Элементы[СтрВставки.ИмяГруппы];
		ГруппаКомандВставки = Элементы[СтрЗаменить(СтрВставки.ИмяГруппы, "_Группа", "_ГруппаКоманды")];
		Элементы.Переместить(Группа, Группа.Родитель, ГруппаВставки);
		Элементы.Переместить(ГруппаРеквизитов, Группа.Родитель, ГруппаВставки);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ДобавитьЭлементГруппировка(Стр)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Тип", ТипГруппировка());
	Строки = СтрокиДерева(ПоляНастроек, СтруктураОтбора);
	Если Строки.Количество()>0 И Строки.Найти(Стр)=Строки.Количество()-1 Тогда
		ИндексВставки = Неопределено;
	Иначе
		ИндексВставки = ПоляНастроек.ПолучитьЭлементы().Индекс(Строки[Строки.Найти(Стр)+1]);
	КонецЕсли; 
	
	Для Каждого Реквизит Из Стр.Реквизиты Цикл
		
		ИмяРеквизита = Реквизит.Ключ;
		
		Если ИндексВставки=Неопределено Тогда
			Группа = Элементы.Добавить(ИмяРеквизита+"_Группа", Тип("ГруппаФормы"), Элементы.ГруппаСтрокиЭлементы);
		Иначе
			ИмяГруппыВставки = ПоляНастроек.ПолучитьЭлементы().Получить(ИндексВставки).ИмяГруппы;
			Если Не ПустаяСтрока(ИмяГруппыВставки) Тогда
				Группа = Элементы.Вставить(ИмяРеквизита+"_Группа", Тип("ГруппаФормы"), Элементы.ГруппаСтрокиЭлементы, Элементы[ИмяГруппыВставки]);
			Иначе
				Группа = Элементы.Добавить(ИмяРеквизита+"_Группа", Тип("ГруппаФормы"), Элементы.ГруппаСтрокиЭлементы);
			КонецЕсли; 
		КонецЕсли; 
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
		Группа.ОтображатьЗаголовок = Ложь;
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		
		Элемент = Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), Группа);
		Элемент.Вид = ВидПоляФормы.ПолеФлажка;
		Элемент.ПутьКДанным = ИмяРеквизита;
		ОбновитьЗаголовокЭлемента(Стр); 
		Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ГруппировкаПриИзменении");
		Элемент.ВысотаЗаголовка = 1;
		
		ДекорацияОтступ = Элементы.Добавить(ИмяРеквизита+"Разделитель", Тип("ДекорацияФормы"), Группа); 
		ДекорацияОтступ.Вид = ВидДекорацииФормы.Надпись;
		ДекорацияОтступ.РастягиватьПоГоризонтали = Истина;
		ДекорацияОтступ.Ширина = 1;
		
		ЭтаФорма[ИмяРеквизита] = Реквизит.Значение;
		ДобавитьПереключательИерархииГруппировки(Стр, ИмяРеквизита, Группа);
		Стр.Элементы.Вставить(ИмяРеквизита, ИмяРеквизита);
		Стр.ИмяГруппы = Группа.Имя;
		
		ДобавитьКоманды(Стр, ИмяРеквизита, Группа);
		
		ГруппаРеквизиты = Элементы.Добавить(ИмяРеквизита+"_Реквизиты", Тип("ГруппаФормы"), Элементы.ГруппаСтрокиЭлементы);
		ГруппаРеквизиты.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаРеквизиты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаРеквизиты.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаРеквизиты.ОтображатьЗаголовок = Ложь;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементРеквизит(Стр)
	
	// Поиск группы реквизитов
	СтрРодителя = Стр.ПолучитьРодителя();
	Для Каждого ОписаниеРеквизита Из СтрРодителя.Реквизиты Цикл
		ГруппаРеквизитов = Элементы[ОписаниеРеквизита.Ключ+"_Реквизиты"];
	КонецЦикла; 
	Если Не ТипЗнч(ГруппаРеквизитов)=Тип("ГруппаФормы") Тогда
		Возврат;
	КонецЕсли; 
	// Добавление элементов реквизитов
	Для Каждого Реквизит Из Стр.Реквизиты Цикл
		
		ИмяРеквизита = Реквизит.Ключ;
		
		Группа = Элементы.Добавить(ИмяРеквизита+"_Группа", Тип("ГруппаФормы"), ГруппаРеквизитов);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
		Группа.ОтображатьЗаголовок = Ложь;
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		
		ДобавитьОтступ(ИмяРеквизита, Группа);
		
		Элемент = Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), Группа);
		Элемент.Вид = ВидПоляФормы.ПолеФлажка;
		Элемент.ПутьКДанным = ИмяРеквизита;
		Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		Элемент.ВысотаЗаголовка = 1;
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_РеквизитПриИзменении");
		
		ДекорацияОтступ = Элементы.Добавить(ИмяРеквизита+"Разделитель", Тип("ДекорацияФормы"), Группа); 
		ДекорацияОтступ.Вид = ВидДекорацииФормы.Надпись;
		ДекорацияОтступ.РастягиватьПоГоризонтали = Истина;
		ДекорацияОтступ.Ширина = 1;
		
		ЭтаФорма[ИмяРеквизита] = Реквизит.Значение;
		Стр.Элементы.Вставить(ИмяРеквизита, ИмяРеквизита);
		Стр.ИмяГруппы = Группа.Имя;
		
		ДобавитьКоманды(Стр, ИмяРеквизита, Группа);
		
		ГруппаРеквизиты = Элементы.Добавить(ИмяРеквизита+"_Реквизиты", Тип("ГруппаФормы"), Элементы.ГруппаСтрокиЭлементы);
		ГруппаРеквизиты.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаРеквизиты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаРеквизиты.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаРеквизиты.ОтображатьЗаголовок = Ложь;
		
		ОбновитьЗаголовокЭлемента(Стр); 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОтступ(ИмяРеквизита, Группа)
	
	Если Группа.ПодчиненныеЭлементы.Количество()>0 Тогда
		КартинкаОтступ = Элементы.Вставить(ИмяРеквизита+"_Отступ", Тип("ДекорацияФормы"), Группа, Группа.ПодчиненныеЭлементы[0]);
	Иначе
		КартинкаОтступ = Элементы.Добавить(ИмяРеквизита+"_Отступ", Тип("ДекорацияФормы"), Группа);
	КонецЕсли; 
	КартинкаОтступ.Вид = ВидДекорацииФормы.Картинка;
	КартинкаОтступ.РастягиватьПоГоризонтали = Ложь;
	КартинкаОтступ.РастягиватьПоВертикали = Ложь;
	КартинкаОтступ.Высота = 1;
	КартинкаОтступ.Ширина = 2;
	КартинкаОтступ.Картинка = БиблиотекаКартинок.КоннекторВерхПравоНиз;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПереключательИерархииГруппировки(Стр, ИмяРеквизита, Группа)
	
	Если ПустаяСтрока(Стр.Поле) Тогда
		Возврат;
	КонецЕсли; 
	ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных(Стр.Поле));
	Если ДоступноеПоле=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не ОтчетыСервер.ОписаниеТиповСодержитИерархическийТип(ДоступноеПоле.ТипЗначения) Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаКоманд = Элементы.Найти(ИмяРеквизита+"_ГруппаКоманды");
	Если ГруппаКоманд=Неопределено Тогда
		Кнопка = Элементы.Добавить(ИмяРеквизита+"_Иерархия", Тип("ДекорацияФормы"), Группа);
	Иначе
		Кнопка = Элементы.Вставить(ИмяРеквизита+"_Иерархия", Тип("ДекорацияФормы"), Группа, ГруппаКоманд);
	КонецЕсли; 
	Кнопка.Вид = ВидДекорацииФормы.Картинка;
	Кнопка.Гиперссылка = Истина;
	Кнопка.Ширина = 2;
	Кнопка.Высота = 1;
	Кнопка.РастягиватьПоГоризонтали = Ложь;
	Кнопка.РастягиватьПоВертикали = Ложь;
	Если Не Стр.ДополнительныеПараметры.Свойство("ТипГруппировки") Тогда
		Стр.ДополнительныеПараметры.Вставить("ТипГруппировки", ТипГруппировкиКомпоновкиДанных.Элементы);
	КонецЕсли;
	УстановитьПредставлениеКнопкиИерархииГруппировки(Кнопка, Стр);
	Кнопка.УстановитьДействие("Нажатие", "Подключаемый_ИерархияГруппировкиНажатие");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКоманды(Стр, ИмяРеквизита, Группа)
	
	ГруппаКоманд = Элементы.Добавить(ИмяРеквизита+"_ГруппаКоманды", Тип("ГруппаФормы"), Группа);
	ГруппаКоманд.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКоманд.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаКоманд.ОтображатьЗаголовок = Ложь;
	ГруппаКоманд.РастягиватьПоГоризонтали = Ложь;
	ГруппаКоманд.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	Если Стр.Тип=ТипПоказатель() ИЛИ Стр.Тип=ТипГруппаПоказателей() Тогда
		ГруппаКоманд.Видимость = РежимРедактированияКолонок;
	Иначе
		ГруппаКоманд.Видимость = РежимРедактированияСтрок;
	КонецЕсли; 
	
	Кнопка = Элементы.Добавить(ИмяРеквизита+"СместитьВверх", Тип("ДекорацияФормы"), ГруппаКоманд);
	Кнопка.Вид = ВидДекорацииФормы.Картинка;
	Кнопка.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
	Кнопка.Гиперссылка = Истина;
	Кнопка.Ширина = 1;
	Кнопка.Высота = 1;
	Кнопка.РастягиватьПоГоризонтали = Ложь;
	Кнопка.РастягиватьПоВертикали = Ложь;
	Кнопка.Картинка = БиблиотекаКартинок.СтрелкаВверхУзкая;
	Кнопка.УстановитьДействие("Нажатие", "Подключаемый_СместитьВверх");
	
	Кнопка = Элементы.Добавить(ИмяРеквизита+"СместитьВниз", Тип("ДекорацияФормы"), ГруппаКоманд);
	Кнопка.Вид = ВидДекорацииФормы.Картинка;
	Кнопка.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
	Кнопка.Гиперссылка = Истина;
	Кнопка.Ширина = 1;
	Кнопка.Высота = 1;
	Кнопка.РастягиватьПоГоризонтали = Ложь;
	Кнопка.РастягиватьПоВертикали = Ложь;
	Кнопка.Картинка = БиблиотекаКартинок.СтрелкаВнизУзкая;
	Кнопка.УстановитьДействие("Нажатие", "Подключаемый_СместитьВниз");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеКнопкиИерархииГруппировки(Кнопка, Стр)
	
	Если Стр.ДополнительныеПараметры.Свойство("ТипГруппировки") Тогда  
		
		Если Стр.ДополнительныеПараметры.ТипГруппировки=ТипГруппировкиКомпоновкиДанных.Элементы Тогда
			Кнопка.Картинка = БиблиотекаКартинок.РежимВыбораЭлементов;
			Кнопка.Подсказка = НСтр("ru = 'Отображать только элементы'");
		ИначеЕсли Стр.ДополнительныеПараметры.ТипГруппировки=ТипГруппировкиКомпоновкиДанных.ТолькоИерархия Тогда
			Кнопка.Картинка = БиблиотекаКартинок.РежимВыбораГрупп;
			Кнопка.Подсказка = НСтр("ru = 'Отображать только иерархию'");
		ИначеЕсли Стр.ДополнительныеПараметры.ТипГруппировки=ТипГруппировкиКомпоновкиДанных.Иерархия Тогда
			Кнопка.Картинка = БиблиотекаКартинок.РежимВыбораГруппИЭлементов;
			Кнопка.Подсказка = НСтр("ru = 'Отображать элементы и иерархию'");
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПодчиненныеПоля(СтрРодитель, Значение)
	
	Для Каждого Стр Из СтрРодитель.ПолучитьЭлементы() Цикл
		Если Не Стр.Создан Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ОписаниеРеквизита Из Стр.Реквизиты Цикл
			ЭтаФорма[ОписаниеРеквизита.Ключ] = Значение;
		КонецЦикла; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ЕстьВыводимыеПоля(СтрРодитель)
	
	Для Каждого Стр Из СтрРодитель.ПолучитьЭлементы() Цикл
		Если Не Стр.Создан Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ОписаниеРеквизита Из Стр.Реквизиты Цикл
			Если ЭтаФорма[ОписаниеРеквизита.Ключ] Тогда
				Возврат Истина;
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла;
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ОбновитьГруппировкиИРеквизиты(ТолькоГруппировкиСтрок = Ложь, ТолькоГруппировкиКолонок = Ложь)
	
	ТребуетсяТаблица = ТребуетсяТаблица();
	Структура = Отчет.КомпоновщикНастроек.Настройки.Структура;
	СуществующийЭлемент = ЭлементСтуктурыГруппировкаТаблица(Структура);
	Если ТолькоГруппировкиСтрок=ТолькоГруппировкиКолонок Тогда
		Если Не СуществующийЭлемент=Неопределено Тогда
			Структура.Удалить(СуществующийЭлемент);
		КонецЕсли; 
		СтруктураСтрок = Отчет.КомпоновщикНастроек.Настройки.Структура;
	ИначеЕсли ТолькоГруппировкиСтрок Тогда
		Если ТребуетсяТаблица И ТипЗнч(СуществующийЭлемент)=Тип("ТаблицаКомпоновкиДанных") Тогда
			СтруктураКолонок = СуществующийЭлемент.Колонки;
			СтруктураСтрок = СуществующийЭлемент.Строки;
			СтруктураСтрок.Очистить();
		Иначе
			ТолькоГруппировкиСтрок = Ложь;
			Если Не СуществующийЭлемент=Неопределено Тогда
				Структура.Удалить(СуществующийЭлемент);
			КонецЕсли; 
			СтруктураСтрок = Структура;
		КонецЕсли;
	ИначеЕсли ТолькоГруппировкиКолонок Тогда
		Структура = Отчет.КомпоновщикНастроек.Настройки.Структура;
		Если ТребуетсяТаблица И ТипЗнч(СуществующийЭлемент)=Тип("ТаблицаКомпоновкиДанных") Тогда
			СтруктураКолонок = СуществующийЭлемент.Колонки;
			СтруктураСтрок = СуществующийЭлемент.Строки;
			СтруктураКолонок.Очистить();
		Иначе
			ТолькоГруппировкиКолонок = Ложь;
			Если Не СуществующийЭлемент=Неопределено Тогда
				Структура.Удалить(СуществующийЭлемент);
			КонецЕсли; 
			СтруктураСтрок = Структура;
		КонецЕсли;
	КонецЕсли; 
	
	Если ТребуетсяТаблица И НЕ ТолькоГруппировкиСтрок И НЕ ТолькоГруппировкиКолонок Тогда
		ТаблицаКомпоновки = СтруктураСтрок.Добавить(Тип("ТаблицаКомпоновкиДанных"));
		СтруктураСтрок = ТаблицаКомпоновки.Строки;
		СтруктураКолонок = ТаблицаКомпоновки.Колонки;
	КонецЕсли;
	
	Если Не ТолькоГруппировкиСтрок Тогда
		Если Не ПустаяСтрока(ПолеГруппировкиКолонок) Тогда
			ДобавитьГруппировкуКолонки(СтруктураКолонок, ПолеГруппировкиКолонок); 
		КонецЕсли; 
		Если НастройкиОтчета.ИспользоватьСравнение И ЗначениеЗаполнено(ПолеСравнения) Тогда
			ДобавитьГруппировкуСравнения(СтруктураКолонок); 
		КонецЕсли; 
	КонецЕсли; 
	
	Если Не ТолькоГруппировкиКолонок Тогда
		Для Каждого Стр Из ПоляНастроек.ПолучитьЭлементы() Цикл
			Если Не Стр.Тип=ТипГруппировка() Тогда
				Продолжить;
			КонецЕсли;
			Для Каждого ОписаниеРеквизита Из Стр.Реквизиты Цикл
				Использование = ЭтаФорма[ОписаниеРеквизита.Ключ];
				Если Не Использование Тогда
					Продолжить;
				КонецЕсли; 
				Если ТребуетсяТаблица Тогда
					ТекущийЭлементСтруктуры = СтруктураСтрок.Добавить();
				Иначе
					ТекущийЭлементСтруктуры = СтруктураСтрок.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
				КонецЕсли; 
				ТекущийЭлементСтруктуры.Использование = Использование;
				ТекущийЭлементСтруктуры.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
				ТекущийЭлементСтруктуры.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
				СтруктураСтрок = ТекущийЭлементСтруктуры.Структура;
				
				Если Стр.ПолучитьЭлементы().Количество()=0 Тогда
					
					Если НРег(Стр.Заголовок) <> НРег("<Детальные записи>") Тогда    						
						Поле = ТекущийЭлементСтруктуры.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
						Поле.Поле	= Новый ПолеКомпоновкиДанных(Стр.Поле);
					Иначе
						Для каждого АвтоПоле из СписокАвтоПолей Цикл
							Поле = ТекущийЭлементСтруктуры.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
							Поле.Поле	= Новый ПолеКомпоновкиДанных(АвтоПоле.Значение);
						КонецЦикла;
					КонецЕсли;
					
					Поле.Использование = Использование;
					
					Если Стр.ДополнительныеПараметры.Свойство("ТипГруппировки") Тогда  
						Поле.ТипГруппировки = Стр.ДополнительныеПараметры.ТипГруппировки;
					КонецЕсли;
				Иначе
					Для Каждого СтрРеквизит Из Стр.ПолучитьЭлементы() Цикл
						
						Для Каждого ОписаниеПоля Из СтрРеквизит.Реквизиты Цикл
							
							Если Не ЭтаФорма[ОписаниеПоля.Ключ] Тогда			
								Продолжить;
							КонецЕсли; 
							
							Поле = ТекущийЭлементСтруктуры.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
							Поле.Поле          = Новый ПолеКомпоновкиДанных(СтрРеквизит.Поле);
							Поле.Использование = Использование;
							
							Если Стр.ДополнительныеПараметры.Свойство("ТипГруппировки") Тогда  
								Поле.ТипГруппировки = СтрРеквизит.ДополнительныеПараметры.ТипГруппировки;
							КонецЕсли;
							
						КонецЦикла; 
						
					КонецЦикла; 
					
				КонецЕсли;
				
				Если НРег(Стр.Заголовок) <> НРег("<Детальные записи>") Тогда    						
					Стр.Заголовок = Строка(ТекущийЭлементСтруктуры.ПоляГруппировки);
				Иначе
					Стр.Заголовок = НСтр("ru = '<Детальные записи>'");
				КонецЕсли;
				ОбновитьЗаголовокЭлемента(Стр);
				ОпределитьНачальноеПоложение(Стр, ТекущийЭлементСтруктуры);
			КонецЦикла; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ТребуетсяТаблица()
	
	Возврат Не ПустаяСтрока(ПолеГруппировкиКолонок) ИЛИ (НастройкиОтчета.ИспользоватьСравнение И ЗначениеЗаполнено(ПолеСравнения));
	
КонецФункции

&НаСервере
Процедура ДобавитьГруппировкуКолонки(СтруктураКолонок, ИмяПоля)
	
	ТекущийЭлементСтруктуры = СтруктураКолонок.Добавить();
	ТекущийЭлементСтруктуры.Использование = Истина;
	ТекущийЭлементСтруктуры.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	ТекущийЭлементСтруктуры.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	Поле = ТекущийЭлементСтруктуры.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	Поле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Поле.Использование = Истина;
	Поле.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
	СтруктураКолонок = ТекущийЭлементСтруктуры.Структура;
	
КонецПроцедуры

&НаСервере
Функция СписокПолейГруппировок(Сравнение = Ложь)
	
	СписокВыбора = Новый СписокЗначений;
	
	ТекущееКоличество = СписокВыбора.Количество();
	Для ии = 1 По ТекущееКоличество-1 Цикл
		Если ТипЗнч(СписокВыбора[ТекущееКоличество-ии].Значение)=Тип("ПеречислениеСсылка.Периодичность") Тогда
			Продолжить;
		КонецЕсли; 
		СписокВыбора.Удалить(ТекущееКоличество-ии);
	КонецЦикла;
	
	Если Не Сравнение ИЛИ НастройкиОтчета.ИспользоватьДополнительныеРежимыСравнения Тогда
		ДополнительныеГруппировкиКолонок = ?(НастройкиОтчета.Свойство("ДополнительныеГруппировкиКолонок"), НастройкиОтчета.ДополнительныеГруппировкиКолонок, Неопределено);
		Если ТипЗнч(ДополнительныеГруппировкиКолонок)=Тип("СписокЗначений") Тогда
			Для Каждого ОписаниеПоля Из ДополнительныеГруппировкиКолонок Цикл
				Если ПустаяСтрока(ОписаниеПоля.Представление) Тогда
					ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных(ОписаниеПоля.Значение));
					Если ДоступноеПоле=Неопределено Тогда
						Продолжить;
					КонецЕсли;
					ПредставлениеПоля = ДоступноеПоле.Заголовок;
				Иначе
					ПредставлениеПоля = ОписаниеПоля.Представление;
				КонецЕсли; 
				СписокВыбора.Добавить(ОписаниеПоля.Значение, ПредставлениеПоля);
			КонецЦикла; 
		КонецЕсли; 
	КонецЕсли; 
	
	Если (НастройкиОтчета.РазрешитьДобавлениеПрочихГруппировокКолонок И НЕ Сравнение) 
		ИЛИ (НастройкиОтчета.РазрешитьДобавлениеПрочихПолейСравнения И Сравнение) Тогда
		СписокВыбора.Добавить("<Прочие>", НСтр("ru = 'Прочее'"),, БиблиотекаКартинок.Выбрать);
	КонецЕсли; 
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Функция СписокДобавленныхГруппировок()
	
	СписокПолей = Новый СписокЗначений;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Тип", ТипГруппировка());
	СтрокиПолей = СтрокиДерева(ПоляНастроек, СтруктураОтбора);
	Для Каждого СтрПоле Из СтрокиПолей Цикл
		Пропустить = Истина;
		Для Каждого ОписаниеРеквизита Из СтрПоле.Реквизиты Цикл
			Если ЭтаФорма[ОписаниеРеквизита.Ключ] Тогда
				Пропустить = Ложь;
			КонецЕсли; 
		КонецЦикла; 
		Если Пропустить Тогда
			Продолжить;
		КонецЕсли; 
		СписокПолей.Добавить(СтрПоле.Поле);
	КонецЦикла;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Тип", ТипРеквизит());
	СтрокиПолей = СтрокиДерева(ПоляНастроек, СтруктураОтбора, Истина);
	Для Каждого СтрПоле Из СтрокиПолей Цикл
		СписокПолей.Добавить(СтрПоле.Поле);
	КонецЦикла;
	
	Возврат СписокПолей;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьГруппировкуРеквизит(Путь)
	
	Если Найти(Путь, ".")>0 Тогда
		ИмяРодителя = Лев(Путь, Найти(Путь, ".")-1);
		Стр = СтрокаОписанияПоля(ТипГруппировка(), ИмяРодителя, ПоляНастроек);
		СтрРеквизит = СтрокаОписанияПоля(ТипРеквизит(), ИмяРодителя, ПоляНастроек);
		Если Не Стр=Неопределено Тогда
			ИмяЭлемента = ДобавитьОписаниеРеквизита(Путь,, Стр.ПолучитьИдентификатор());
			Если Не ПустаяСтрока(ИмяЭлемента) Тогда
				ПриИзмененииГруппировкиРеквизита(ИмяЭлемента);
			КонецЕсли; 
			Возврат;
		ИначеЕсли Не СтрРеквизит=Неопределено Тогда
			ИмяЭлемента = ДобавитьОписаниеРеквизита(Путь,, СтрРеквизит.ПолучитьРодителя().ПолучитьИдентификатор());
			Если Не ПустаяСтрока(ИмяЭлемента) Тогда
				ПриИзмененииГруппировкиРеквизита(ИмяЭлемента);
			КонецЕсли; 
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	ИмяЭлемента = ДобавитьОписаниеГруппировки(Путь);
	Если Не ПустаяСтрока(ИмяЭлемента) Тогда
		ПриИзмененииГруппировкиРеквизита(ИмяЭлемента);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область Диаграммы

&НаСервере
Процедура УстановитьЗначенияДиаграммыПоУмолчаниюРекурсивно(ЭлементыВыбора)
	
	Для Каждого ЭлементВыбор Из ЭлементыВыбора Цикл
		Если ЗначениеЗаполнено(ДиаграммаЗначения) Тогда
			Прервать;
		КонецЕсли; 
		Если ТипЗнч(ЭлементВыбор) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			УстановитьЗначенияДиаграммыПоУмолчаниюРекурсивно(ЭлементВыбор.Элементы);
			Продолжить;
		КонецЕсли; 
		Если ТипЗнч(ЭлементВыбор) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли; 
		ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(ЭлементВыбор.Поле);
		Если Не ДоступноеПоле = Неопределено И ДоступноеПоле.Ресурс Тогда
			ДиаграммаЗначения = Строка(ЭлементВыбор.Поле);
			ОбновитьНастройкиДиаграммы();
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ТипДиаграммыЭлементаСтруктуры(ЭлементДиаграмма)
	
	Если Не ТипЗнч(ЭлементДиаграмма)=Тип("ДиаграммаКомпоновкиДанных") ИЛИ НЕ ЭлементДиаграмма.Использование Тогда
		Возврат Неопределено;
	КонецЕсли;
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	Параметр = ЭлементДиаграмма.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипДиаграммы"));
	Если Параметр=Неопределено ИЛИ НЕ Параметр.Использование Тогда
		Параметр = Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипДиаграммы"));
	КонецЕсли; 
	Если Не Параметр=Неопределено И Параметр.Использование Тогда
		Тип = Параметр.Значение;
	Иначе
		Тип = ТипДиаграммы.Гистограмма;
		Если Не Параметр=Неопределено Тогда
			Параметр.Значение = Тип;
			Параметр.Использование = Истина;
		КонецЕсли; 
	КонецЕсли;
	Возврат Тип;
	
КонецФункции

&НаСервере
Функция ПроверитьСовместимостьДиаграммы(ИмяПоляПроверки = "")
	
	Результат = Истина;
	
	Если Не ЗначениеЗаполнено(ВидДиаграммы) Тогда
		Возврат Результат;
	КонецЕсли; 
	
	Схема = ПолучитьИзВременногоХранилища(НастройкиОтчета.АдресСхемы);
	Если ЗначениеЗаполнено(ДиаграммаТочки) Тогда
		ПолеТочка = ОтчетыСервер.ПолеСхемы(Схема, ДиаграммаТочки);
		ТочкаПериод = (ТипЗнч(ПолеТочка)=Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") И ПолеТочка.Роль.НомерПериода>0);
		Если ЗначениеЗаполнено(ДиаграммаСерии) Тогда
			ПолеСерия = ОтчетыСервер.ПолеСхемы(Схема, ДиаграммаСерии);
			СерияПериод = (ТипЗнч(ПолеСерия)=Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") И ПолеСерия.Роль.НомерПериода>0);
		Иначе
			ПолеСерия = Неопределено;
			СерияПериод = Ложь;
		КонецЕсли; 	
	Иначе
		ПолеТочка = Неопределено;
		ТочкаПериод = Ложь;
		ПолеСерия = Неопределено;
		СерияПериод = Ложь;
	КонецЕсли;
	
	Если Не СерияПериод И НЕ ТочкаПериод Тогда
		Возврат Результат;
	КонецЕсли; 
	
	МассивПолей = Новый Массив;
	Если Не ПустаяСтрока(ИмяПоляПроверки) Тогда
		МассивПолей.Добавить(ИмяПоляПроверки);
	Иначе
		ПоляГруппировокРекурсивно(МассивПолей, Отчет.КомпоновщикНастроек.Настройки.Структура);
	КонецЕсли; 
	Для Каждого ИмяПоля Из МассивПолей Цикл
		Поле = ОтчетыСервер.ПолеСхемы(Схема, ИмяПоля);
		Если Не ТипЗнч(Поле)=Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		Если Поле.Роль.НомерПериода=0 Тогда
			Продолжить;
		КонецЕсли;
		Если (ТочкаПериод И НЕ ИмяПоля=ДиаграммаТочки) ИЛИ (СерияПериод И НЕ ИмяПоля=ДиаграммаСерии) Тогда
			Если Не ПустаяСтрока(ИмяПоляПроверки) Тогда
				Если ТочкаПериод И НЕ ИмяПоля=ДиаграммаТочки Тогда
					ОписаниеПоля = """"+?(ПустаяСтрока(ПолеТочка.Заголовок), ПолеТочка.Поле, ПолеТочка.Заголовок)+"""";
					ОписаниеПоля = ОписаниеПоля+НСтр("ru = ' в диаграмме'");
				ИначеЕсли СерияПериод И НЕ ИмяПоля=ДиаграммаСерии Тогда
					ОписаниеПоля = """"+?(ПустаяСтрока(ПолеСерия.Заголовок), ПолеСерия.Поле, ПолеСерия.Заголовок)+"""";
					ОписаниеПоля = ОписаниеПоля+НСтр("ru = ' в диаграмме'");
				КонецЕсли; 
			Иначе
				ОписаниеПоля = """"+?(ПустаяСтрока(Поле.Заголовок), Поле.Поле, Поле.Заголовок)+"""";
				ОписаниеПоля = ОписаниеПоля+НСтр("ru = ' в структуре отчета'");
				Если ТочкаПериод И НЕ ИмяПоля=ДиаграммаТочки Тогда
					ДиаграммаТочки = Неопределено;
				КонецЕсли; 
				Если СерияПериод И НЕ ИмяПоля=ДиаграммаСерии Тогда
					ДиаграммаСерии = Неопределено;
				КонецЕсли;
			КонецЕсли; 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Запрещено использование в отчете и диаграмме различных полей-периодов. Предварительно отключите поле %1'"),
			ОписаниеПоля));
			Результат = Ложь;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#Область Показатели

&НаСервере
Функция ДобавитьОписаниеПоказателя(Путь, НестандартныйОбработчик = Ложь, Знач ТипКолонки = "")
	
	Если ПустаяСтрока(ТипКолонки) Тогда
		ТипКолонки = ТипПоказатель();
	КонецЕсли; 
	ИмяРеквизита = НовоеИмяРеквизита(ТипКолонки);
	Стр = ДобавитьОписаниеНастройки(ПоляНастроек.ПолучитьЭлементы(), ТипКолонки, Путь);
	Стр.Реквизиты.Вставить(ИмяРеквизита, Истина);
	Стр.НестандартныйОбработчик = НестандартныйОбработчик;
	
	ВнестиИзмененияВРеквизитыНаФорме(Ложь);
	Возврат ИмяРеквизита;
	
КонецФункции

&НаСервере
// Процедура - Заполнить описания показателей
// 
// Параметры:
//  ЭлементыВыбор	 - 	 - 
//  СтрРодитель		 - 	 - 
// 
Процедура ЗаполнитьОписанияПоказателей(ЭлементыВыбор = Неопределено, СтрРодитель = Неопределено)
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	
	Если ЭлементыВыбор = Неопределено Тогда
		ЭлементыВыбор = Настройки.Выбор.Элементы;
	КонецЕсли;
	
	Если СтрРодитель = Неопределено Тогда
		СтрРодитель = ПоляНастроек;
	КонецЕсли; 
	
	Для Каждого Показатель Из ЭлементыВыбор Цикл
		
		Если ТипЗнч(Показатель) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Показатель) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			
			ИмяРеквизита = ТипГруппаПоказателей()+СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
			
			СтрГруппы = СтрРодитель.ПолучитьЭлементы().Добавить();
			
			СтрГруппы.Тип                     = ТипГруппаПоказателей();
			СтрГруппы.ВидЭлемента             = "Флажок";
			СтрГруппы.ТипЗначения             = Новый ОписаниеТипов("Булево");
			СтрГруппы.Заголовок               = Показатель.Заголовок;
			СтрГруппы.Реквизиты               = Новый Структура(ИмяРеквизита, Показатель.Использование);
			СтрГруппы.Элементы                = Новый Структура;
			СтрГруппы.ДополнительныеПараметры = Новый Структура;
			СтрГруппы.ДополнительныеПараметры.Вставить("Расположение", Показатель.Расположение);
			
			ЗаполнитьОписанияПоказателей(Показатель.Элементы, СтрГруппы);
			
			Продолжить;
			
		КонецЕсли; 
		
		ИмяПоля       = Строка(Показатель.Поле);
		ДоступноеПоле = Настройки.ДоступныеПоляВыбора.НайтиПоле(Показатель.Поле);
		
		Если ДоступноеПоле = Неопределено
			ИЛИ (Не КлючОбъекта = "Отчет.СписокКлиентов" и Не ДоступноеПоле.Ресурс) Тогда
			Продолжить;
		КонецЕсли; 
		
		ИмяРеквизита = НовоеИмяРеквизита(ТипПоказатель());
		
		Стр = СтрРодитель.ПолучитьЭлементы().Добавить();
		
		Стр.ДополнительныеПараметры = Новый Структура;
		Стр.Тип                     = ТипПоказатель();
		Стр.Реквизиты               = Новый Структура(ИмяРеквизита, Показатель.Использование);
		Стр.Элементы                = Новый Структура;
		Стр.Поле                    = ИмяПоля;
		Стр.ВидЭлемента             = "Флажок";
		Стр.ТипЗначения             = Новый ОписаниеТипов("Булево");
		Стр.Заголовок               = ?(ПустаяСтрока(Показатель.Заголовок), ДоступноеПоле.Заголовок, Показатель.Заголовок);
		Стр.ДополнительныеПараметры = Новый Структура;
		
		Если Показатель.Заголовок = " " Тогда
			Стр.ДополнительныеПараметры.Вставить("ПустойЗаголовок", Истина);
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементГруппаПоказателейПоказатель(Стр)
	
	Для Каждого Реквизит Из Стр.Реквизиты Цикл
		
		ИмяРеквизита = Реквизит.Ключ;
		
		Если Стр.ПолучитьРодителя()=Неопределено Тогда
			ГруппаРодителя = Элементы.ГруппаПоказателиЭлементы;
		Иначе
			СтрРодителя = Стр.ПолучитьРодителя();
			ГруппаРодителя = Элементы[СтрЗаменить(СтрРодителя.ИмяГруппы, "_Группа", "_Поля")];
		КонецЕсли; 
		
		Группа = Элементы.Добавить(ИмяРеквизита+"_Группа", Тип("ГруппаФормы"), ГруппаРодителя);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
		Группа.ОтображатьЗаголовок = Ложь;
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		
		Отступ = УровеньОтступа(Стр);
		Для ии = 1 По Отступ Цикл
			ДобавитьОтступ(ИмяРеквизита+ии, Группа);
		КонецЦикла; 
		
		Элемент = Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), Группа);
		Элемент.Вид = ВидПоляФормы.ПолеФлажка;
		Элемент.ПутьКДанным = ИмяРеквизита;
		Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		Если Стр.Тип=ТипГруппаПоказателей() Тогда
			Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ГруппаПоказателейПриИзменении");
			Если ПустаяСтрока(Стр.Заголовок) Тогда
				ЗаголовокГруппы = "";
				Для Каждого ПодСтр Из Стр.ПолучитьЭлементы() Цикл
					Если ПустаяСтрока(ПодСтр.Заголовок) Тогда
						Продолжить;
					КонецЕсли; 
					ПоказательВыбран = Ложь;
					Для Каждого ОписаниеРеквизита Из ПодСтр.Реквизиты Цикл
						Если ЭтотОбъект[ОписаниеРеквизита.Ключ] Тогда
							ПоказательВыбран = Истина;
						КонецЕсли; 
					КонецЦикла; 
					Если Не ПоказательВыбран Тогда
						Продолжить;
					КонецЕсли; 
					ЗаголовокГруппы = ЗаголовокГруппы+?(ПустаяСтрока(ЗаголовокГруппы), "", ", ")+ПодСтр.Заголовок;
				КонецЦикла;
				Если ПустаяСтрока(ЗаголовокГруппы) Тогда
					ЗаголовокГруппы = " ";
				КонецЕсли; 
				Стр.Заголовок = ЗаголовокГруппы;
			КонецЕсли; 
		Иначе
			Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПоказательПриИзменении");
		КонецЕсли; 
		ОбновитьЗаголовокЭлемента(Стр);
		Элемент.ВысотаЗаголовка = 1;
		
		ДекорацияОтступ = Элементы.Добавить(ИмяРеквизита+"Разделитель", Тип("ДекорацияФормы"), Группа); 
		ДекорацияОтступ.Вид = ВидДекорацииФормы.Надпись;
		ДекорацияОтступ.РастягиватьПоГоризонтали = Истина;
		ДекорацияОтступ.Ширина = 1;
		
		Если ЗначениеЗаполнено(Реквизит.Значение) Тогда
			ЭтаФорма[ИмяРеквизита] = Реквизит.Значение;
		КонецЕсли;
		Стр.Элементы.Вставить(ИмяРеквизита, ИмяРеквизита);
		Стр.ИмяГруппы = Группа.Имя;
		
		ДобавитьКоманды(Стр, ИмяРеквизита, Группа);
		
		Если Стр.Тип=ТипГруппаПоказателей() Тогда
			ГруппаРеквизиты = Элементы.Добавить(ИмяРеквизита+"_Поля", Тип("ГруппаФормы"), ГруппаРодителя);
			ГруппаРеквизиты.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаРеквизиты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаРеквизиты.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаРеквизиты.ОтображатьЗаголовок = Ложь;
		КонецЕсли; 
		
		Если Стр.Поле="Отступ" Тогда
			Группа.Видимость = Ложь;
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УровеньОтступа(Стр)
	
	Позиция = Стр;
	Результат = 0;
	Пока НЕ Позиция.ПолучитьРодителя()=Неопределено Цикл
		Результат = Результат+1;
		Позиция = Позиция.ПолучитьРодителя();
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ИзменитьПоказатели(ЭлементыВыбор = Неопределено, СтрРодитель = Неопределено)
	
	Если ЭлементыВыбор=Неопределено Тогда
		ЭлементыВыбор = Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы;
	КонецЕсли; 
	Если СтрРодитель=Неопределено Тогда
		СтрРодитель = ПоляНастроек;
	КонецЕсли; 
	
	Для Каждого Стр Из СтрРодитель.ПолучитьЭлементы() Цикл
		Если Не Стр.Создан Тогда
			Продолжить;
		КонецЕсли;
		Если Стр.Тип=ТипГруппаПоказателей() Тогда
			Для Каждого ОписаниеРеквизита Из Стр.Реквизиты Цикл
				Если Не ЭтаФорма[ОписаниеРеквизита.Ключ] Тогда
					Продолжить;
				КонецЕсли; 
				ГруппаПоказателей = ЭлементыВыбор.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
				ГруппаПоказателей.Заголовок = Стр.Заголовок;
				ГруппаПоказателей.Использование = Истина;
				Если Стр.ДополнительныеПараметры.Свойство("Расположение") Тогда
					ГруппаПоказателей.Расположение = Стр.ДополнительныеПараметры.Расположение;
				КонецЕсли; 
				ИзменитьПоказатели(ГруппаПоказателей.Элементы, Стр);
			КонецЦикла;
			Продолжить;
		КонецЕсли; 
		Если Не Стр.Тип=ТипПоказатель() Тогда
			Продолжить;
		КонецЕсли; 
		Для Каждого ОписаниеРеквизита Из Стр.Реквизиты Цикл
			Если Не ЭтаФорма[ОписаниеРеквизита.Ключ] Тогда
				Продолжить;
			КонецЕсли; 
			ПолеКД = Новый ПолеКомпоновкиДанных(Стр.Поле);
			ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(ПолеКД);
			ВыбранноеПоле = ЭлементыВыбор.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = ПолеКД;
			ВыбранноеПоле.Использование = Истина;
			Если ДоступноеПоле=Неопределено ИЛИ Стр.Заголовок<>ДоступноеПоле.Заголовок Тогда
				ВыбранноеПоле.Заголовок = Стр.Заголовок;
			КонецЕсли; 
			Если Стр.ДополнительныеПараметры.Свойство("ПустойЗаголовок") И Стр.ДополнительныеПараметры.ПустойЗаголовок Тогда
				ВыбранноеПоле.Заголовок = " ";
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СместитьПоказатель(Идентификатор, Шаг)
	
	Стр = ПоляНастроек.НайтиПоИдентификатору(Идентификатор);
	ЭтоГруппа = (Стр.Тип=ТипГруппаПоказателей());
	Группа = Элементы[Стр.ИмяГруппы];
	Если ЭтоГруппа Тогда
		ГруппаПоказателей = Элементы[СтрЗаменить(Стр.ИмяГруппы, "_Группа", "_Поля")];
	КонецЕсли; 
	
	Если Стр.ПолучитьРодителя()=Неопределено Тогда
		Индекс = ПоляНастроек.ПолучитьЭлементы().Индекс(Стр);
		СтруктураОтбора = Новый Структура;
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипПоказатель());
		МассивТипов.Добавить(ТипГруппаПоказателей());
		СтруктураОтбора.Вставить("Тип", МассивТипов);
		Строки = СтрокиДерева(ПоляНастроек, СтруктураОтбора);
		ИндексВМассиве = Строки.Найти(Стр);
		СтрокиРодителя = ПоляНастроек.ПолучитьЭлементы();
	Иначе
		Строки = Стр.ПолучитьРодителя().ПолучитьЭлементы();
		Индекс = Строки.Индекс(Стр);
		ИндексВМассиве = Индекс;
		СтрокиРодителя = Строки;
	КонецЕсли; 
	
	Если ИндексВМассиве+Шаг<0 ИЛИ ИндексВМассиве+Шаг>=Строки.Количество() Тогда
		// Перемещение не требуется
		Возврат Ложь;
	ИначеЕсли ИндексВМассиве+Шаг=Строки.Количество()-1 Тогда
		// Добавление в конец
		СтрокиРодителя.Сдвинуть(Индекс, Строки.Количество()-Индекс-1); 
		Элементы.Переместить(Группа, Группа.Родитель); 
		Если ЭтоГруппа Тогда
			Элементы.Переместить(ГруппаПоказателей, ГруппаПоказателей.Родитель);
		КонецЕсли; 
	Иначе
		СтрСоСмещением = Строки[ИндексВМассиве+Шаг];
		ИндексВставки = СтрокиРодителя.Индекс(СтрСоСмещением);
		СтрокиРодителя.Сдвинуть(Индекс, ИндексВставки-Индекс);
		Если Шаг>0 Тогда
			СтрВставки = Строки[ИндексВМассиве+Шаг+1];
		Иначе
			СтрВставки = СтрСоСмещением;
		КонецЕсли; 
		Элементы.Переместить(Группа, Группа.Родитель, Элементы[СтрВставки.ИмяГруппы]); 
		Если ЭтоГруппа Тогда
			Элементы.Переместить(ГруппаПоказателей, ГруппаПоказателей.Родитель, Элементы[СтрВставки.ИмяГруппы]); 
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти 

#Область Сравнение

&НаСервере
Процедура ЗаполнитьВариантыСравнения()
	
	Если Не НастройкиОтчета.ИспользоватьСравнение Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПолеСравнения.СписокВыбора.Очистить();
	Элементы.ПолеСравнения.СписокВыбора.Добавить(Неопределено, НСтр("ru = 'Не сравнивать'"));
	
	Если НастройкиОтчета.ИспользоватьПериодичность Тогда
		Элементы.ПолеСравнения.СписокВыбора.Добавить(Перечисления.Периодичность.День, НСтр("ru = 'Дни'"));
		Элементы.ПолеСравнения.СписокВыбора.Добавить(Перечисления.Периодичность.Неделя, НСтр("ru = 'Недели'"));
		Элементы.ПолеСравнения.СписокВыбора.Добавить(Перечисления.Периодичность.Месяц, НСтр("ru = 'Месяцы'"));
		Элементы.ПолеСравнения.СписокВыбора.Добавить(Перечисления.Периодичность.Квартал, НСтр("ru = 'Кварталы'"));
		Элементы.ПолеСравнения.СписокВыбора.Добавить(Перечисления.Периодичность.Полугодие, НСтр("ru = 'Полугодия'"));
		Элементы.ПолеСравнения.СписокВыбора.Добавить(Перечисления.Периодичность.Год, НСтр("ru = 'Годы'"));
	КонецЕсли;
	
	ДополнительныеГруппировкиКолонок = ?(НастройкиОтчета.Свойство("ДополнительныеГруппировкиКолонок"), НастройкиОтчета.ДополнительныеГруппировкиКолонок, Неопределено);
	Если ТипЗнч(ДополнительныеГруппировкиКолонок)=Тип("СписокЗначений") Тогда
		Для Каждого ОписаниеПоля Из ДополнительныеГруппировкиКолонок Цикл
			Если ПустаяСтрока(ОписаниеПоля.Представление) Тогда
				ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных(ОписаниеПоля.Значение));
				Если ДоступноеПоле=Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ПредставлениеПоля = ДоступноеПоле.Заголовок;
			Иначе
				ПредставлениеПоля = ОписаниеПоля.Представление;
			КонецЕсли; 
			Элементы.ПолеСравнения.СписокВыбора.Добавить(ОписаниеПоля.Значение, ПредставлениеПоля);
		КонецЦикла; 
	КонецЕсли;
	
	Если НастройкиОтчета.РазрешитьДобавлениеПрочихПолейСравнения Тогда
		Элементы.ПолеСравнения.СписокВыбора.Добавить("<Прочие>", НСтр("ru = 'Прочее'"),, БиблиотекаКартинок.Выбрать);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьГруппировкуСравнения(СтруктураКолонок)
	
	Если ТипЗнч(ПолеСравнения)=Тип("ПеречислениеСсылка.Периодичность") Тогда
		// Добавить группировку сравнения по периоду
		Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Периодичность", ПолеСравнения);
		ИмяПоля = "ДинамическийПериод";
		// Добавление разрешения на группировку по служебному полю ДинамическийПериод
		СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(НастройкиОтчета.АдресСхемы);
		Поле = ОтчетыСервер.ПолеСхемы(СхемаКомпоновкиДанных, ИмяПоля);
		Если Поле<>Неопределено И Поле.ОграничениеИспользования.Группировка Тогда
			Ограничения = Поле.ОграничениеИспользования;
			Ограничения.Группировка = Ложь;
			Ограничения.Поле = Ложь;
			Ограничения.Порядок = Ложь;
			ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, НастройкиОтчета.АдресСхемы);
		КонецЕсли; 
	Иначе
		ИмяПоля = ПолеСравнения;
	КонецЕсли; 
	
	ДобавитьГруппировкуКолонки(СтруктураКолонок, ИмяПоля);
	
КонецПроцедуры

#КонецОбласти

#Область Фильтры

&НаСервере
Процедура ДобавитьОписаниеФильтра(Путь, НестандартныйОбработчик = Ложь, УстановитьФильтр = Истина)
	
	Если КлючОбъекта = "Отчет.ОказанныеУслугиПоВрачу" Тогда
		Для Каждого ЭлементОтбора Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы ЦИкл		
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Путь) И ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
				Возврат;		
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	
	Стр = ДобавитьОписаниеНастройки(ПоляНастроек.ПолучитьЭлементы(), ТипФильтр(), Путь);
	Стр.НестандартныйОбработчик = НестандартныйОбработчик;

	ВнестиИзмененияВРеквизитыНаФорме(Ложь);
	
	Если Найти(Путь, "ДобавленноеПоле_")>0 Тогда
		// Используемые в отчете дополнительные поля
		Если Не Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Свойство("ДобавленныеПоля")
			ИЛИ ТипЗнч(Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ДобавленныеПоля)<>Тип("Массив") Тогда
			Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ДобавленныеПоля", Новый Массив);
		КонецЕсли;
		Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ДобавленныеПоля.Добавить(Путь);
	ИначеЕсли УстановитьФильтр Тогда
		УстановитьЗначениеФильтра(Стр.Поле, Неопределено,, Ложь, Истина)
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписанияФильтров()
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	Для Каждого ЭлементОтбора Из Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.РежимОтображения=РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
			Продолжить;
		КонецЕсли;
		Если Найти(ЭлементОтбора.ПредставлениеПользовательскойНастройки, "ДобавленноеПоле_")>0 Тогда
			// Добавленные поля обрабатываются отдельно
			Продолжить;
		КонецЕсли; 
		Если ЗначениеЗаполнено(ЭлементОтбора.Представление) Тогда
			// Предопределенный отбор с собственным представлением
			Значение = ЭлементОтбора.Использование;
			Стр = ПоляНастроек.ПолучитьЭлементы().Добавить();
			Стр.Тип = ТипФильтр();
			Стр.Поле = "";
			Стр.ТипЗначения = Новый ОписаниеТипов("Булево");
			Стр.Заголовок = ЭлементОтбора.Представление;
			Стр.ДополнительныеПараметры = Новый Структура;
			Стр.ДополнительныеПараметры.Вставить("СвязьПоПредставлению", Истина);
			Стр.ЗначениеПоУмолчанию = Значение;
			Стр.ВидЭлемента = "Булево";
			Идентификатор = НовоеИмяРеквизита(ТипФильтр());
			Стр.Элементы = Новый Структура;
			Стр.Реквизиты = Новый Структура;
			Стр.Реквизиты.Вставить(Идентификатор, Значение);
			ЭлементОтбора.ПредставлениеПользовательскойНастройки = НовоеИмяОтметкиФильтра();
		Иначе
			Если Не ТипЗнч(ЭлементОтбора)=Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли; 
			Если Не ТипЗнч(ЭлементОтбора.ЛевоеЗначение)=Тип("ПолеКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			ДобавитьОписаниеНастройки(
					ПоляНастроек.ПолучитьЭлементы(),
					ТипФильтр(), 
					Строка(ЭлементОтбора.ЛевоеЗначение), 
					?(ЗначениеЗаполнено(ЭлементОтбора.Представление), ЭлементОтбора.Представление, ЭлементОтбора.ПредставлениеПользовательскойНастройки),
					ЭлементОтбора);
		КонецЕсли; 
	КонецЦикла;
	
	// Добавленные поля
	Если Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Свойство("ДобавленныеПоля") Тогда
		Для Каждого Поле Из Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ДобавленныеПоля Цикл
			Если Поле="ДобавленноеПоле_Тег" ИЛИ
				Поле="ДобавленноеПоле_Сегмент" Тогда
				ДобавитьОписаниеНастройки(ПоляНастроек.ПолучитьЭлементы(), ТипФильтр(), Поле);
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьЭлементыИРеквизитыФильтра(Стр, ЭлементОтбора = Неопределено, ДоступноеПоле, РучноеДобавление)
	
	ТипЗначения = Стр.ТипЗначения;
	Если ТипЗначения.Типы().Количество()=0 Тогда
		// Некорректно задан тип
		ПоляНастроек.ПолучитьЭлементы().Удалить(Стр);
		Возврат;
	КонецЕсли;
	
	Идентификатор = НовоеИмяРеквизита(ТипФильтр());
	
	Стр.Элементы = Новый Структура;
	Стр.Реквизиты = Новый Структура;
	
	Значение = ?(НЕ ЭлементОтбора=Неопределено И ЭлементОтбора.Использование 
	И (ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно
	ИЛИ ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке
	ИЛИ ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии
	ИЛИ ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно
	ИЛИ ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно), 
	ЭлементОтбора.ПравоеЗначение, 
	Неопределено);
	Стр.ЗначениеПоУмолчанию = Значение;
	
	Если (ТипЗначения.СодержитТип(Тип("Дата")) ИЛИ ТипЗначения.СодержитТип(Тип("Число"))) И ТипЗначения.Типы().Количество()=1 Тогда
		// Ищем другие фильтры по этому полю
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Тип", ТипФильтр());
		СтруктураОтбора.Вставить("Поле", Стр.Поле);
		Идентификаторы = ИдентификаторыСтрок(ПоляНастроек, СтруктураОтбора);
		Если Идентификаторы.Количество()>1 Тогда
			Для ии = 1 По Идентификаторы.Количество()-1 Цикл
				ПоляНастроек.ПолучитьЭлементы().Удалить(Идентификаторы[1]);
			КонецЦикла;
			Стр = ПоляНастроек.НайтиПоИдентификатору(Идентификаторы[0]);
		КонецЕсли; 
	КонецЕсли; 
	
	Если ТипЗначения.Типы().Количество()>1 Тогда
		// Многотипный фильтр
		Стр.ВидЭлемента = "Поле";
		Стр.Реквизиты.Вставить(Идентификатор, Значение);
	ИначеЕсли ТипЗначения.СодержитТип(Тип("Строка")) Тогда
		// Строка
		Стр.ВидЭлемента = "Поле";
		Стр.Реквизиты.Вставить(Идентификатор, Значение);
	ИначеЕсли ТипЗначения.СодержитТип(Тип("Дата")) Тогда
		// Дата
		Стр.ВидЭлемента = "Период";
		
		Если ТипЗнч(Значение) = Тип("СтандартнаяДатаНачала") Тогда
			Значение = Значение.Дата;
		КонецЕсли;
		
		Если Не Стр.Реквизиты.Свойство(Идентификатор) Тогда
			Стр.Реквизиты.Вставить(Идентификатор, Новый СтандартныйПериод(ВариантСтандартногоПериода.ПроизвольныйПериод));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Значение) Тогда
			Стр.Реквизиты[Идентификатор] = Новый СтандартныйПериод;
		ИначеЕсли ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно Тогда
			Стр.Реквизиты[Идентификатор].ДатаНачала = Значение;
			Стр.Реквизиты[Идентификатор].ДатаОкончания = Значение;
		ИначеЕсли ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно 
			И Стр.Реквизиты[Идентификатор].ДатаНачала<Значение Тогда
			Стр.Реквизиты[Идентификатор].ДатаНачала = Значение;
		ИначеЕсли ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно 
			И Стр.Реквизиты[Идентификатор].ДатаОкончания>Значение Тогда
			Стр.Реквизиты[Идентификатор].ДатаОкончания = Значение;
		КонецЕсли; 
		Стр.ТипЗначения = Новый ОписаниеТипов("СтандартныйПериод");
	ИначеЕсли ТипЗначения.СодержитТип(Тип("Число")) Тогда
		// Число
		Стр.ВидЭлемента = "Пределы";
		Если Не Стр.Реквизиты.Свойство(Идентификатор+"От") Тогда
			Стр.Реквизиты.Вставить(Идентификатор+"От", 0);
		КонецЕсли; 
		Если Не Стр.Реквизиты.Свойство(Идентификатор+"До") Тогда
			Стр.Реквизиты.Вставить(Идентификатор+"До", 0);
		КонецЕсли;
		Если ЭлементОтбора=Неопределено ИЛИ ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно Тогда
			Стр.Реквизиты.Вставить(Идентификатор+"От", Значение);
			Стр.Реквизиты.Вставить(Идентификатор+"До", Значение);
		ИначеЕсли ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно 
			И (НЕ Стр.Реквизиты.Свойство(Идентификатор+"От")
			ИЛИ Стр.Реквизиты[Идентификатор+"От"]<?(Значение=Неопределено, 0, Значение)) Тогда
			Стр.Реквизиты.Вставить(Идентификатор+"От", ?(Значение=Неопределено, 0, Значение));
		ИначеЕсли ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно 
			И (НЕ Стр.Реквизиты.Свойство(Идентификатор+"До")
			ИЛИ Стр.Реквизиты[Идентификатор+"До"]>?(Значение=Неопределено, 0, Значение)) Тогда
			Стр.Реквизиты.Вставить(Идентификатор+"До", ?(Значение=Неопределено, 0, Значение));
		КонецЕсли;
	ИначеЕсли ТипЗначения.СодержитТип(Тип("Булево")) Тогда
		// Булево
		Стр.ВидЭлемента = "Тумблер";
		Значения = Новый СписокЗначений;
		Значения.Добавить(Перечисления.БулевоТриСостояния.НеИзменять, НСтр("ru = 'Все'"), Значение=Неопределено);
		Значения.Добавить(Перечисления.БулевоТриСостояния.Ложь, Формат(Ложь, ДоступноеПоле.ФорматРедактирования), Значение=Истина);
		Значения.Добавить(Перечисления.БулевоТриСостояния.Истина, Формат(Истина, ДоступноеПоле.ФорматРедактирования), Значение=Ложь);
		Стр.Реквизиты.Вставить(Идентификатор, Значения);
		Стр.ТипЗначения = Новый ОписаниеТипов("Булево,Неопределено");
	ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипЗначения.Типы().Получить(0)) Тогда
		// Ссылочный тип
		ПараметрыВыбора = ОпределитьПараметрыВыбора(ДоступноеПоле);
		КоличествоЭлементов = ОтчетыСервер.ОпределитьКоличествоЭлементов(ТипЗначения.Типы().Получить(0), ПараметрыВыбора);
		Если (КоличествоЭлементов=0 ИЛИ КоличествоЭлементов=1) И НЕ РучноеДобавление Тогда
			Возврат;
		КонецЕсли; 
		Если КоличествоЭлементов < 3 Тогда
			Значения = ОтчетыСервер.ПолучитьСписокЭлементов(ТипЗначения.Типы().Получить(0), ПараметрыВыбора);
			СтрокаЗаголовка = "";
			Для Каждого Элемент Из Значения Цикл
				СтрокаЗаголовка = СтрокаЗаголовка+Строка(Элемент);
			КонецЦикла;
			Если СтрДлина(СтрокаЗаголовка) <= 22 Тогда
				Стр.ВидЭлемента = "Тумблер";
				Стр.Реквизиты.Вставить(Идентификатор, Значения);
			Иначе
				Стр.ДополнительныеПараметры.Вставить("БыстрыйВыбор", Истина);
				Стр.ВидЭлемента = "Поле";
				Стр.Реквизиты.Вставить(Идентификатор, Значение);
			КонецЕсли; 
		Иначе
			Если КоличествоЭлементов <= 10 Тогда
				Стр.ДополнительныеПараметры.Вставить("БыстрыйВыбор", Истина);
			КонецЕсли; 
			Стр.ВидЭлемента = "Поле";
			Стр.Реквизиты.Вставить(Идентификатор, Значение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЗначениеПоляФильтра(Стр)
	
	Если Стр.ТипЗначения = Тип("СтандартныйПериод") Тогда
		Возврат Неопределено;
	ИначеЕсли (Стр.ВидЭлемента="Поле"
		ИЛИ Стр.ВидЭлемента="Период"
		ИЛИ Стр.ВидЭлемента="Булево") 
		И Стр.Реквизиты.Количество()>0 Тогда
		Для Каждого Реквизит Из Стр.Реквизиты Цикл
			Возврат ЭтаФорма[Реквизит.Ключ];
		КонецЦикла;
	ИначеЕсли Стр.ВидЭлемента = "Тумблер" Тогда
		Значения = Новый СписокЗначений;
		Для Каждого Реквизит Из Стр.Реквизиты Цикл
			ЗначениеРеквизита = ЭтаФорма[Реквизит.Ключ];
			Если Не ЗначениеЗаполнено(ЗначениеРеквизита) ИЛИ 
				ЗначениеРеквизита=ПредопределенноеЗначение("Перечисление.БулевоТриСостояния.НеИзменять") Тогда
				Продолжить;
			КонецЕсли;
			Если ТипЗнч(ЗначениеРеквизита)=Тип("ПеречислениеСсылка.БулевоТриСостояния") Тогда
				Значения.Добавить(?(
							ЗначениеРеквизита=ПредопределенноеЗначение("Перечисление.БулевоТриСостояния.Истина"), Истина,?(
							ЗначениеРеквизита=ПредопределенноеЗначение("Перечисление.БулевоТриСостояния.Ложь"), Ложь,
							Неопределено)));
			Иначе
				Значения.Добавить(ЗначениеРеквизита);
			КонецЕсли; 
		КонецЦикла;
		Если Значения.Количество()=0 Тогда
			Возврат Неопределено;
		Иначе
			Возврат Значения;
		КонецЕсли; 
	ИначеЕсли Стр.ВидЭлемента = "Пределы" 
		И Стр.Реквизиты.Количество()>1 Тогда
		Итерация = 1;
		Для Каждого Реквизит Из Стр.Реквизиты Цикл
			Если Итерация=1 Тогда
				ЗначениеОт = ЭтаФорма[Реквизит.Ключ];
			ИначеЕсли Итерация=2 Тогда
				ЗначениеДо = ЭтаФорма[Реквизит.Ключ];
			КонецЕсли; 
			Итерация = Итерация+1;
		КонецЦикла; 
		Если ЗначениеОт = 0 И ЗначениеДо = 0 Тогда
			Возврат Неопределено;
		Иначе
			Возврат Новый Структура("ЗначениеОт, ЗначениеДо", ?(ЗначениеОт=0, Неопределено, ЗначениеОт), ?(ЗначениеДо=0, Неопределено, ЗначениеДо));
		КонецЕсли;
	ИначеЕсли Стр.ВидЭлемента = "Флажок" Тогда
		Значения = Новый СписокЗначений;
		Для Каждого Реквизит Из Стр.Реквизиты Цикл
			Если ЭтаФорма[Реквизит.Ключ] Тогда
				Значения.Добавить(Реквизит.Значение);
			КонецЕсли; 
		КонецЦикла; 
		Если Значения.Количество()=0 Тогда
			Возврат Неопределено;
		Иначе
			Возврат Значения;
		КонецЕсли; 
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
КонецФункции

&НаСервере
Процедура ИзменитьИспользованиеФильтра(ПредставлениеОтбора, Значение)
	
	Если ПустаяСтрока(ПредставлениеОтбора) Тогда
		Возврат;
	КонецЕсли; 
	Для Каждого ЭлементОтбора Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Не ЭлементОтбора.Представление=ПредставлениеОтбора Тогда
			Продолжить;
		КонецЕсли; 		
		ЭлементОтбора.Использование = Значение;
		Прервать;
	КонецЦикла;
	ОбновитьОтображениеОтметокФильтров();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеФильтра(Поле, Значение, ВидСравнения = Неопределено, ОбновлятьВПанели = Истина, ЗаменитьЗначение = Ложь)
	
	НайденныеЭлементы = Новый Массив;
	ПолеКД = Новый ПолеКомпоновкиДанных(Поле);
	Для Каждого ЭлементОтбор Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		// Если ЭлементОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
		//	Продолжить;
		// КонецЕсли;
		Если Не ТипЗнч(ЭлементОтбор)=Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли; 
		Если ТипЗнч(ЭлементОтбор.ПравоеЗначение)=Тип("ПолеКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		Если Не ЭлементОтбор.ЛевоеЗначение=ПолеКД Тогда
			Продолжить;
		КонецЕсли;
		НайденныеЭлементы.Добавить(ЭлементОтбор);
	КонецЦикла;    	
	
	Если Значение = Неопределено Тогда
		Если КлючОбъекта = "Отчет.ПосещенияКлиентов" И Поле = "ПараметрыДанных.КоличествоПосещений" Тогда
			УстановитьЗначениеПараметровПоФильтру("КоличествоПосещений", 0, 0);
		Иначе
			Для Каждого ЭлементОтбор Из НайденныеЭлементы Цикл
				ЭлементОтбор.Использование = Ложь;
			КонецЦикла;
			Если НайденныеЭлементы.Количество() = 0 Тогда // И НЕ ЭлементОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный
				ЭлементОтбор = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбор.ЛевоеЗначение	= ПолеКД;
				ЭлементОтбор.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбор.Использование	= Ложь;
			КонецЕсли; 
		КонецЕсли;
	ИначеЕсли ТипЗнч(Значение) = Тип("Структура") Тогда
		ЗначениеОт = Значение.ЗначениеОт;
		ЗначениеДо = Значение.ЗначениеДо;
		Если КлючОбъекта = "Отчет.ПосещенияКлиентов" И Поле = "ПараметрыДанных.КоличествоПосещений" Тогда
			УстановитьЗначениеПараметровПоФильтру("КоличествоПосещений", ЗначениеОт, ЗначениеДо);
		Иначе					
			ИмяОтметки = НовоеИмяОтметкиФильтра();
			Для Каждого ЭлементОтбор Из НайденныеЭлементы Цикл
				Если Не ЗначениеОт=Неопределено И (ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Больше ИЛИ ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно) Тогда
					ЭлементОтбор.ПравоеЗначение = ЗначениеОт;
					ЭлементОтбор.Использование = Истина;
					ЭлементОтбор.ПредставлениеПользовательскойНастройки = ИмяОтметки;
					Если Значение.Свойство("ВключаяГраницы") И Значение.ВключаяГраницы Тогда
						ЭлементОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
					ИначеЕсли Значение.Свойство("ВключаяГраницы") И НЕ Значение.ВключаяГраницы Тогда
						ЭлементОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
					КонецЕсли; 
					ЗначениеОт = Неопределено;
					Продолжить;
				КонецЕсли; 
				Если Не ЗначениеДо=Неопределено И (ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Меньше ИЛИ ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно) Тогда
					ЭлементОтбор.ПравоеЗначение = ЗначениеДо;
					ЭлементОтбор.Использование = Истина;
					ЭлементОтбор.ПредставлениеПользовательскойНастройки = ИмяОтметки;
					Если Значение.Свойство("ВключаяГраницы") И Значение.ВключаяГраницы Тогда
						ЭлементОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
					ИначеЕсли Значение.Свойство("ВключаяГраницы") И НЕ Значение.ВключаяГраницы Тогда
						ЭлементОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
					КонецЕсли; 
					ЗначениеДо = Неопределено;
					Продолжить;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(ЗначениеОт) И (ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Больше ИЛИ ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно) Тогда
					// Не изменяем
					Продолжить;
				КонецЕсли; 
				Если Не ЗначениеЗаполнено(ЗначениеДо) И (ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Меньше ИЛИ ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно) Тогда
					// Не изменяем
					Продолжить;
				КонецЕсли; 
				Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(ЭлементОтбор);
			КонецЦикла;
			Если Не ЗначениеОт=Неопределено Тогда
				ЭлементОтбор = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбор.ЛевоеЗначение = ПолеКД;
				Если Значение.Свойство("ВключаяГраницы") И Значение.ВключаяГраницы Тогда
					ЭлементОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
				ИначеЕсли Значение.Свойство("ВключаяГраницы") И НЕ Значение.ВключаяГраницы Тогда
					ЭлементОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
				Иначе
					ЭлементОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
				КонецЕсли; 
				ЭлементОтбор.ПравоеЗначение = ЗначениеОт;
				ЭлементОтбор.Использование = Истина;
				ЭлементОтбор.ПредставлениеПользовательскойНастройки = ИмяОтметки;
			КонецЕсли; 
			Если Не ЗначениеДо=Неопределено Тогда
				ЭлементОтбор = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбор.ЛевоеЗначение = ПолеКД;
				Если Значение.Свойство("ВключаяГраницы") И Значение.ВключаяГраницы Тогда
					ЭлементОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
				ИначеЕсли Значение.Свойство("ВключаяГраницы") И НЕ Значение.ВключаяГраницы Тогда
					ЭлементОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
				Иначе
					ЭлементОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
				КонецЕсли; 
				ЭлементОтбор.ПравоеЗначение = ЗначениеДо;
				ЭлементОтбор.Использование = Истина;
				ЭлементОтбор.ПредставлениеПользовательскойНастройки = ИмяОтметки;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Значение) = Тип("СтандартныйПериод") Тогда
		ДатаНачала		= Значение.ДатаНачала;
		ДатаОкончания	= Значение.ДатаОкончания;
		УдалитьРанееДобавленныйОтбор(ПолеКД);
		Для Каждого ЭлементОтбор Из НайденныеЭлементы Цикл
			Если ЗначениеЗаполнено(ДатаНачала) 
				И (ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Больше
					ИЛИ ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно) Тогда
				ЭлементОтбор.ПравоеЗначение = ДатаНачала;
				ЭлементОтбор.Использование	= Истина;
				ЭлементОтбор.ПредставлениеПользовательскойНастройки = ИмяОтметки;
				ЗначениеОт = Неопределено;
				Продолжить;
			КонецЕсли; 
			Если ЗначениеЗаполнено(ДатаОкончания)
				И (ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Меньше
					ИЛИ ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно) Тогда
				ЭлементОтбор.ПравоеЗначение = ДатаОкончания;
				ЭлементОтбор.Использование	= Истина;
				ЭлементОтбор.ПредставлениеПользовательскойНастройки = ИмяОтметки;
				ЗначениеОт = Неопределено;
				Продолжить;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ДатаНачала)
				И (ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Больше
					ИЛИ ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно) Тогда
				// Не изменяем
				Продолжить;
			КонецЕсли; 
			Если Не ЗначениеЗаполнено(ДатаОкончания) 
				И (ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Меньше 
					ИЛИ ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно) Тогда
				// Не изменяем
				Продолжить;
			КонецЕсли; 
			Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(ЭлементОтбор);
		КонецЦикла;
		ИмяОтметки = НовоеИмяОтметкиФильтра();
		Если ЗначениеЗаполнено(ДатаНачала) Тогда
			ЭлементОтбор = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбор.ЛевоеЗначение	= ПолеКД;
			ЭлементОтбор.ВидСравнения	= ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
			ЭлементОтбор.ПравоеЗначение = НачалоДня(ДатаНачала);
			ЭлементОтбор.Использование	= Истина;
			ЭлементОтбор.ПредставлениеПользовательскойНастройки = ИмяОтметки;
		КонецЕсли; 
		Если ЗначениеЗаполнено(ДатаОкончания) Тогда
			ЭлементОтбор = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));			
			ЭлементОтбор.ЛевоеЗначение	= ПолеКД;
			ЭлементОтбор.ВидСравнения	= ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
			ЭлементОтбор.ПравоеЗначение = КонецДня(ДатаОкончания);
			ЭлементОтбор.Использование	= Истина;
			ЭлементОтбор.ПредставлениеПользовательскойНастройки = ИмяОтметки;
		КонецЕсли; 
	Иначе
		КоличествоЭлементов = НайденныеЭлементы.Количество();
		Если КоличествоЭлементов=0 ИЛИ ЗаменитьЗначение Тогда
			Если КоличествоЭлементов>0 Тогда
				Для ии = 0 По КоличествоЭлементов-1 Цикл
					Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(НайденныеЭлементы[ии]);
				КонецЦикла;
			КонецЕсли; 
			// Новый элемент отбора
			НайденныйЭлемент = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НайденныйЭлемент.ЛевоеЗначение = ПолеКД;
			НайденныйЭлемент.ВидСравнения = ВидСравнения;
			Если ТипЗнч(Значение)=Тип("СписокЗначений") 
				ИЛИ (НЕ ВидСравнения=ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии
				И НЕ ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии) Тогда
				НайденныйЭлемент.ПравоеЗначение = Значение;
			Иначе 
				НайденныйЭлемент.ПравоеЗначение = Новый СписокЗначений;
				НайденныйЭлемент.ПравоеЗначение.Добавить(Значение);
			КонецЕсли; 
			НайденныйЭлемент.Использование = Истина;
		Иначе
			Если ВидСравнения=ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии ИЛИ ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				// Оставим только первый элемент
				Для ии = 1 По КоличествоЭлементов-1 Цикл
					Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(НайденныеЭлементы[ии]);
				КонецЦикла;
			КонецЕсли; 
			НайденныйЭлемент = НайденныеЭлементы[0];
			Если Не ЗначениеЗаполнено(НайденныйЭлемент.ПравоеЗначение) 
				ИЛИ НЕ НайденныйЭлемент.Использование Тогда
				// Найденный элемент отбора пустой
				НайденныйЭлемент.ВидСравнения = ВидСравнения;
				Если (ВидСравнения=ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии 
					ИЛИ ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии)
					И НЕ ТипЗнч(Значение)=Тип("СписокЗначений") Тогда 
					НайденныйЭлемент.ПравоеЗначение = Новый СписокЗначений;
					НайденныйЭлемент.ПравоеЗначение.Добавить(Значение);
				Иначе
					НайденныйЭлемент.ПравоеЗначение = Значение;
				КонецЕсли; 
				НайденныйЭлемент.Использование = Истина;
			ИначеЕсли Не ВидСравнения=НайденныйЭлемент.ВидСравнения Тогда
				// Не совпадают виды сравнения найденного и добавляемого элементов
				Если (НайденныйЭлемент.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно И (ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке ИЛИ ВидСравнения=ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии))
					ИЛИ (НайденныйЭлемент.ВидСравнения=ВидСравненияКомпоновкиДанных.НеРавно И (ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСписке ИЛИ ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии)) Тогда
					// Объединение фильтров
					Если ТипЗнч(Значение)=Тип("СписокЗначений") Тогда
						ЗначениеФильтра = Значение;
					Иначе
						ЗначениеФильтра = Новый СписокЗначений;
						ЗначениеФильтра.Добавить(Значение);
					КонецЕсли; 
					ЗначениеФильтра.Добавить(НайденныйЭлемент.ПравоеЗначение);
					НайденныйЭлемент.ВидСравнения = ВидСравнения;
					НайденныйЭлемент.ПравоеЗначение = ЗначениеФильтра;
				ИначеЕсли (ВидСравнения=ВидСравненияКомпоновкиДанных.Равно И (НайденныйЭлемент.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке ИЛИ НайденныйЭлемент.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии))
					ИЛИ (ВидСравнения=ВидСравненияКомпоновкиДанных.НеРавно И (НайденныйЭлемент.ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСписке ИЛИ НайденныйЭлемент.ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии)) Тогда
					Если ТипЗнч(НайденныйЭлемент.ПравоеЗначение)=Тип("СписокЗначений") Тогда
						НайденныйЭлемент.ПравоеЗначение.Добавить(Значение);
					Иначе
						ТекущееЗначение = НайденныйЭлемент.ПравоеЗначение;
						НайденныйЭлемент.ПравоеЗначение = Новый СписокЗначений;
						НайденныйЭлемент.ПравоеЗначение.Добавить(ТекущееЗначение);
						НайденныйЭлемент.ПравоеЗначение.Добавить(Значение);
					КонецЕсли; 
				ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
					// Был ВСпискеПоИерархии, накладывается НеВСпискеПоИерархии
					Элемент = НайденныйЭлемент.ПравоеЗначение.НайтиПоЗначению(Значение);
				ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
					// Был НеВСпискеПоИерархии, накладывается ВСпискеПоИерархии
					НайденныйЭлемент.ВидСравнения = ВидСравнения;
					Если ТипЗнч(Значение)=Тип("СписокЗначений") Тогда
						НайденныйЭлемент.ПравоеЗначение = Значение;
					ИначеЕсли ТипЗнч(НайденныйЭлемент.ПравоеЗначение)=Тип("СписокЗначений") Тогда
						НайденныйЭлемент.ПравоеЗначение.Очистить();
						НайденныйЭлемент.ПравоеЗначение.Добавить(Значение);
					Иначе
						НайденныйЭлемент.ПравоеЗначение = Значение;
					КонецЕсли; 
					НайденныйЭлемент.Использование = Истина;
				Иначе
					// В других случаях добавляем новый отбор
					НайденныйЭлемент = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НайденныйЭлемент.ЛевоеЗначение	= ПолеКД;
					НайденныйЭлемент.ВидСравнения	= ВидСравнения;
					НайденныйЭлемент.ПравоеЗначение = Значение;
					НайденныйЭлемент.Использование	= Истина;
				КонецЕсли; 
			Иначе
				// Объединение найденного и добавляемого фильтров
				Если ТипЗнч(НайденныйЭлемент.ПравоеЗначение)=Тип("СписокЗначений") И НЕ ТипЗнч(Значение)=Тип("СписокЗначений") Тогда
					Если НайденныйЭлемент.ПравоеЗначение.НайтиПоЗначению(Значение)=Неопределено Тогда
						НайденныйЭлемент.ПравоеЗначение.Добавить(Значение);
					КонецЕсли;
				ИначеЕсли ТипЗнч(НайденныйЭлемент.ПравоеЗначение)=Тип("СписокЗначений") И ТипЗнч(Значение)=Тип("СписокЗначений") Тогда
					Для Каждого Элемент Из Значение Цикл
						Если Не НайденныйЭлемент.ПравоеЗначение.НайтиПоЗначению(Элемент.Значение)=Неопределено Тогда
							Продолжить;
						КонецЕсли; 
						НайденныйЭлемент.ПравоеЗначение.Добавить(Элемент.Значение);
					КонецЦикла; 
				Иначе
					НайденныйЭлемент.ПравоеЗначение = Значение;
				КонецЕсли; 
				НайденныйЭлемент.Использование = Истина;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(НайденныйЭлемент.ПравоеЗначение) Тогда
				Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(НайденныйЭлемент);
			КонецЕсли; 
		КонецЕсли;
		Если НайденныйЭлемент.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии
			ИЛИ НайденныйЭлемент.ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
			НайденныйЭлемент.ПредставлениеПользовательскойНастройки = "";
		КонецЕсли; 
		Если Не НайденныйЭлемент.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии
			И НЕ НайденныйЭлемент.ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии
			И ПустаяСтрока(НайденныйЭлемент.ПредставлениеПользовательскойНастройки) Тогда
			НайденныйЭлемент.ПредставлениеПользовательскойНастройки = НовоеИмяОтметкиФильтра();
		КонецЕсли; 
	КонецЕсли;
	
	Если ОбновлятьВПанели Тогда
		Если СтрокаОписанияПоля(ТипФильтр(), Поле, ПоляНастроек)=Неопределено Тогда
			ДобавитьОписаниеФильтра(Поле,, Ложь);
		КонецЕсли; 
		ОбновитьРеквизитыФильтровВПанели(Поле, Значение, ВидСравнения);
	КонецЕсли; 
	ОбновитьОтображениеОтметокФильтров();
	
КонецПроцедуры

// Процедура - удаляет ранее добавленный отбор СКД.
//
Процедура УдалитьРанееДобавленныйОтбор(ПолеКД)
	
	МассивУдаляемых = Новый Массив;
	Для Каждого ЭлементОтбор Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Не ТипЗнч(ЭлементОтбор) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли; 
		Если ТипЗнч(ЭлементОтбор.ПравоеЗначение) = Тип("ПолеКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		Если Не ЭлементОтбор.ЛевоеЗначение = ПолеКД Тогда
			Продолжить;
		КонецЕсли;
		МассивУдаляемых.Добавить(ЭлементОтбор);
	КонецЦикла;
	Для Каждого ЭлементМ Из МассивУдаляемых Цикл
		Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(ЭлементМ);
	КонецЦикла;
		  
КонецПроцедуры

// Процедура устанавливает параметр СКД по фильтру.
//
Процедура УстановитьЗначениеПараметровПоФильтру(Имя, ЗначениеОт, ЗначениеДо)
	
	Если ТипЗнч(ЗначениеОт) <> Тип("Число") Тогда
		ЗначениеОт = 0;
	КонецЕсли;
	Если ТипЗнч(ЗначениеДо) <> Тип("Число") Тогда
		ЗначениеДо = 0;
	КонецЕсли;
	
	ПараметрыСКД =  Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	Если ПараметрыСКД.Найти(Имя) <> Неопределено 
		И ПараметрыСКД.Найти("" + Имя + "От") <> Неопределено  
		И ПараметрыСКД.Найти("" + Имя + "До") <> Неопределено Тогда
		
		Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("" + Имя + "От", ЗначениеОт);
		Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("" + Имя + "До", ЗначениеДо);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьГруппуФильтров(Поле, Реквизиты, Значение, ВидСравнения)
	
	НайденныеЭлементы = Новый Массив;
	Представление = Поле+" содержит """+Значение+"""";
	Для Каждого ЭлементОтбор Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Не ТипЗнч(ЭлементОтбор)=Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли; 
		Если Не ЭлементОтбор.Представление=Представление Тогда
			Продолжить;
		КонецЕсли;
		НайденныеЭлементы.Добавить(ЭлементОтбор);
	КонецЦикла;
	
	Для Каждого ЭлементОтбор Из НайденныеЭлементы Цикл
		Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(ЭлементОтбор);
	КонецЦикла;
	
	ГруппаОтбор = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбор.ПредставлениеПользовательскойНастройки = НовоеИмяОтметкиФильтра();
	ГруппаОтбор.Представление = Представление;
	ГруппаОтбор.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Для Каждого Реквизит Из Реквизиты Цикл
		ЭлементОтбор = ГруппаОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле+"."+Реквизит);
		ЭлементОтбор.ВидСравнения = ВидСравнения;
		ЭлементОтбор.ПравоеЗначение = Значение;
		ЭлементОтбор.Использование = Истина;
	КонецЦикла; 
	
	ОбновитьОтображениеОтметокФильтров();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьФильтр(Идентификатор)
	
	СтрНаложенногоФильтра = НаложенныеФильтры.НайтиПоИдентификатору(Идентификатор);
	МассивКОтключению = Новый Массив;
	МассивКУдаленияю = Новый Массив;
	ПолеКД = Новый ПолеКомпоновкиДанных(СтрНаложенногоФильтра.Поле);
	Для Каждого ЭлементОтбор Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбор.ПредставлениеПользовательскойНастройки=СтрНаложенногоФильтра.ИмяКнопки Тогда
			Если Найти(ЭлементОтбор.ПредставлениеПользовательскойНастройки, "ДобавленноеПоле_")>0 Тогда
				МассивКУдаленияю.Добавить(ЭлементОтбор);
			Иначе
				МассивКОтключению.Добавить(ЭлементОтбор);
			КонецЕсли; 
			Если Не ПустаяСтрока(ЭлементОтбор.Представление) Тогда
				ОбновитьРеквизитыФильтровВПанелиПоПредставлению(ЭлементОтбор.Представление, Ложь);
			Иначе
				ОбновитьРеквизитыФильтровВПанели(СтрНаложенногоФильтра.Поле, СтрНаложенногоФильтра.Значение,, Истина);
			КонецЕсли; 
			Продолжить;
		КонецЕсли; 
		Если Не ТипЗнч(ЭлементОтбор)=Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли; 
		Если ТипЗнч(ЭлементОтбор.ПравоеЗначение)=Тип("ПолеКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		Если Не ЭлементОтбор.Использование Тогда
			Продолжить;
		КонецЕсли;
		Если Не ЭлементОтбор.ЛевоеЗначение=ПолеКД Тогда
			Продолжить;
		КонецЕсли;
		Если ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно
			ИЛИ ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
			МассивКОтключению.Добавить(ЭлементОтбор);
		ИначеЕсли ТипЗнч(ЭлементОтбор.ПравоеЗначение)=Тип("СписокЗначений") И ТипЗнч(СтрНаложенногоФильтра.Значение)=Тип("СписокЗначений") Тогда
			МассивКОтключению.Добавить(ЭлементОтбор);
		ИначеЕсли ТипЗнч(ЭлементОтбор.ПравоеЗначение)=Тип("СписокЗначений") Тогда 
			Элемент = ЭлементОтбор.ПравоеЗначение.НайтиПоЗначению(СтрНаложенногоФильтра.Значение);
			Если Не Элемент=Неопределено Тогда
				ЭлементОтбор.ПравоеЗначение.Удалить(Элемент);
				Если ЭлементОтбор.ПравоеЗначение.Количество()=0 Тогда
					МассивКОтключению.Добавить(ЭлементОтбор);
				КонецЕсли; 
			КонецЕсли;
		ИначеЕсли ЭлементОтбор.ПравоеЗначение=СтрНаложенногоФильтра.Значение Тогда
			МассивКОтключению.Добавить(ЭлементОтбор);
		КонецЕсли;
		// Сброс отоборов в панели настроек
		ОбновитьРеквизитыФильтровВПанели(СтрНаложенногоФильтра.Поле, СтрНаложенногоФильтра.Значение,, Истина);
	КонецЦикла; 
	Для Каждого ЭлементОтбор Из МассивКОтключению Цикл
		ЭлементОтбор.Использование = Ложь;
	КонецЦикла; 
	Для Каждого ЭлементОтбор Из МассивКУдаленияю Цикл
		Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(ЭлементОтбор);
	КонецЦикла; 
	
	ОбновитьОтображениеОтметокФильтров();
	
КонецПроцедуры

&НаСервере
// Процедура - удаляет параметр.
//
Процедура УдалитьПараметр(Идентификатор)
	
	СтрПараметра		= НаложенныеПараметры.НайтиПоИдентификатору(Идентификатор);
	МассивКОтключению	= Новый Массив;
	ПолеКД				= Новый ПолеКомпоновкиДанных(СтрПараметра.Поле);
	
	Для Каждого ЭлементПараметр Из Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		
		Если ЭлементПараметр.ПредставлениеПользовательскойНастройки = СтрПараметра.ИмяКнопки Тогда
			Если Найти(ЭлементПараметр.ПредставлениеПользовательскойНастройки, "ДобавленноеПоле_") = 0 Тогда
				МассивКОтключению.Добавить(ЭлементПараметр);
			КонецЕсли; 
			// Если Не ПустаяСтрока(ЭлементПараметр.Представление) Тогда
			//	ОбновитьРеквизитыФильтровВПанелиПоПредставлению(ЭлементОтбор.Представление, Ложь);
			// Иначе
			//	ОбновитьРеквизитыФильтровВПанели(СтрНаложенногоФильтра.Поле, СтрНаложенногоФильтра.Значение,, Истина);
			// КонецЕсли; 
			Продолжить;
		КонецЕсли; 
		Если Не ТипЗнч(ЭлементПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли; 
		Если Не ЭлементПараметр.Использование Тогда
			Продолжить;
		КонецЕсли;
		Если Не ТипЗнч(ЭлементПараметр.Значение) = Тип("СписокЗначений") Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ Строка(ЭлементПараметр.Параметр) = СтрПараметра.Поле Тогда
			Продолжить;
		КонецЕсли;
						
		Если ТипЗнч(ЭлементПараметр.Значение) = Тип("СписокЗначений") И ТипЗнч(СтрПараметра.Значение) = Тип("СписокЗначений") Тогда
			МассивКОтключению.Добавить(ЭлементПараметр);
		ИначеЕсли ТипЗнч(ЭлементПараметр.Значение) = Тип("СписокЗначений") Тогда 
			Элемент = ЭлементПараметр.Значение.НайтиПоЗначению(СтрПараметра.Значение);
			Если Не Элемент = Неопределено Тогда
				ЭлементПараметр.Значение.Удалить(Элемент);
				Если ЭлементПараметр.Значение.Количество() = 0 Тогда
					МассивКОтключению.Добавить(ЭлементПараметр);
				КонецЕсли; 
			КонецЕсли;
		ИначеЕсли ЭлементПараметр.Значение = СтрПараметра.Значение Тогда
			МассивКОтключению.Добавить(ЭлементПараметр);
		КонецЕсли;
	КонецЦикла; 
	
	Для Каждого ЭлементОтбор Из МассивКОтключению Цикл
		ЭлементПараметр.Использование = Ложь;
	КонецЦикла; 
			
	ОбновитьОтображениеОтметокПараметров();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыФильтровВПанелиПоПредставлению(Представление, Значение)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Тип", ТипФильтр());
	Строки = СтрокиДерева(ПоляНастроек, СтруктураОтбора);
	Для Каждого Стр Из Строки Цикл
		Если Не ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Стр.ДополнительныеПараметры, "СвязьПоПредставлению", Ложь) Тогда
			Продолжить;
		КонецЕсли;
		Если Не Стр.Заголовок=Представление Тогда
			Продолжить;
		КонецЕсли; 
		Для Каждого Реквизит Из Стр.Реквизиты Цикл
			ЭтаФорма[Реквизит.Ключ] = Значение;
		КонецЦикла; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыФильтровВПанели(Поле, Значение, ВидСравнения = Неопределено, Удаление = Ложь)
	
	Стр = СтрокаОписанияПоля(ТипФильтр(), Поле, ПоляНастроек);
	Если Стр=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Стр.НестандартныйОбработчик Тогда
		Если Стр.ВидЭлемента="Флажок" Тогда
			Для Каждого Реквизит Из Стр.Реквизиты Цикл
				Если Не Реквизит.Значение=Значение Тогда
					Продолжить;
				КонецЕсли; 
				НовоеЗначение = ?(Удаление, Неопределено, Значение);
				ЭтаФорма[Реквизит.Ключ] = НовоеЗначение;
			КонецЦикла; 
		Иначе
			Для Каждого Реквизит Из Стр.Реквизиты Цикл
				НовоеЗначение = ?(Удаление, Реквизит.Значение, Значение);
				ЭтаФорма[Реквизит.Ключ] = НовоеЗначение;
			КонецЦикла; 
		КонецЕсли; 
	ИначеЕсли Стр.ВидЭлемента="Флажок" ИЛИ Стр.ВидЭлемента="Булево" Тогда
		Для Каждого Реквизит Из Стр.Реквизиты Цикл
			Если Реквизит.Значение=Значение Тогда
				ЭтаФорма[Реквизит.Ключ] = НЕ Удаление;
			КонецЕсли; 
		КонецЦикла; 
	ИначеЕсли Стр.ВидЭлемента="Пределы" Тогда
		Если Удаление Тогда
			ЗначениеОт = 0;
			ЗначениеДо = 0;
		ИначеЕсли ТипЗнч(Значение)=Тип("Структура") Тогда 
			ЗначениеОт = Значение.ЗначениеОт; 
			ЗначениеДо = Значение.ЗначениеДо;
		ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.Больше ИЛИ ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
			ЗначениеОт = Значение; 
			ЗначениеДо = Неопределено;
		ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.Меньше ИЛИ ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
			ЗначениеОт = Неопределено; 
			ЗначениеДо = Значение;
		КонецЕсли;
		Итерация = 1;
		Для Каждого Реквизит Из Стр.Реквизиты Цикл
			Если Итерация=1 Тогда
				Если ЗначениеОт=Неопределено Тогда
					Итерация = Итерация+1;
					Продолжить;
				КонецЕсли;
				ЭтаФорма[Реквизит.Ключ] = ЗначениеОт;
			ИначеЕсли Итерация=2 Тогда
				Если ЗначениеДо=Неопределено Тогда
					Итерация = Итерация+1;
					Продолжить;
				КонецЕсли; 
				ЭтаФорма[Реквизит.Ключ] = ЗначениеДо;
			КонецЕсли; 
			Итерация = Итерация+1;
		КонецЦикла; 
	ИначеЕсли Стр.ВидЭлемента="Тумблер" Тогда
		Если Стр.ТипЗначения.Типы().Количество()=1 И Стр.ТипЗначения.Типы().Получить(0)=Тип("Булево") Тогда
			Если Удаление Тогда
				НовоеЗначение = ПредопределенноеЗначение("Перечисление.БулевоТриСостояния.НеИзменять");
			Иначе 
				НовоеЗначение = ВБулевоТриСостояния(Значение);
			КонецЕсли; 
		Иначе
			Если Удаление Тогда
				НовоеЗначение = Неопределено;
			Иначе 
				НовоеЗначение = Значение;
			КонецЕсли; 
		КонецЕсли; 
		Для Каждого Реквизит Из Стр.Реквизиты Цикл
			ЭтаФорма[Реквизит.Ключ] = НовоеЗначение;
		КонецЦикла; 
	ИначеЕсли Стр.ВидЭлемента="Период" Тогда
		Если Удаление Тогда
			НовоеЗначение = Новый СтандартныйПериод;
		ИначеЕсли ТипЗнч(Значение)=Тип("СтандартныйПериод") Тогда 
			НовоеЗначение = Значение;
		ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.Больше ИЛИ ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
			НовоеЗначение = Новый СтандартныйПериод(Значение, '0001-01-01');
		ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.Меньше ИЛИ ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
			НовоеЗначение = Новый СтандартныйПериод('0001-01-01', Значение);
		КонецЕсли; 
		Для Каждого Реквизит Из Стр.Реквизиты Цикл
			Если Не ЗначениеЗаполнено(НовоеЗначение) Тогда
				ЭтаФорма[Реквизит.Ключ] = НовоеЗначение;
			ИначеЕсли НовоеЗначение.ДатаНачала='0001-01-01' Тогда
				ЭтаФорма[Реквизит.Ключ].ДатаОкончания = НовоеЗначение.ДатаОкончания;
			ИначеЕсли НовоеЗначение.ДатаОкончания='0001-01-01' Тогда
				ЭтаФорма[Реквизит.Ключ].ДатаНачала = НовоеЗначение.ДатаНачала;
			Иначе
				ЭтаФорма[Реквизит.Ключ] = НовоеЗначение;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция СписокДобавленныхФильтров()
	
	СписокПолей = Новый СписокЗначений;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Тип", ТипФильтр());
	СтрокиПолей = СтрокиДерева(ПоляНастроек, СтруктураОтбора);
	Для Каждого СтрПоле Из СтрокиПолей Цикл
		СписокПолей.Добавить(СтрПоле.Поле);
	КонецЦикла;
	
	Возврат СписокПолей;
	
КонецФункции

#КонецОбласти

#Область Параметры

&НаКлиенте
Функция ПроверитьЗаполнениеПараметров()
	
	Результат = Истина;
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Тип", ТипПараметр());
	Строки = СтрокиДерева(ПоляНастроек, СтруктураОтбора);
	Для Каждого Стр Из Строки Цикл
		Если Не Стр.ДополнительныеПараметры.Свойство("АвтоОтметкаНезаполненного") ИЛИ НЕ Стр.ДополнительныеПараметры.АвтоОтметкаНезаполненного Тогда
			Продолжить;
		КонецЕсли;
		Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(Стр.Поле));
		Если Параметр=Неопределено Тогда
			Продолжить;
		КонецЕсли;   	
		 
		Если Не ЗначениеЗаполнено(Параметр.Значение) Тогда
			Результат = Ложь;
			ПредставлениеПараметра = ?(ЗначениеЗаполнено(Стр.Заголовок), Стр.Заголовок, Стр.Поле);
			Для Каждого Элемент Из Стр.Элементы Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Не заполнен обязательный параметр ""%1""",
				ПредставлениеПараметра),,
				Элемент.Ключ);
			КонецЦикла; 
		КонецЕсли; 
		
		// Если КлючОбъекта = "Отчет.ПланФактныйАнализПродаж" 
		//	И Стр.Поле = "СценарийПланирования" 
		//	И ЗначениеЗаполнено(Параметр.Значение) Тогда
		//	
		//	ЗначениеВременный = Неопределено;
		//	Если ТипЗнч(Параметр.Значение) = Тип("СправочникСсылка.СценарииПланирования") Тогда
		//		ЗначениеВременный = Параметр.Значение;
		//	ИначеЕсли ТипЗнч(Параметр.Значение) = Тип("СписокЗначений") Тогда
		//		ЗначениеВременный = Параметр.Значение[0].Значение;
		//	КонецЕсли;      
		//	
		//	Если ЗначениеЗаполнено(ЗначениеВременный) Тогда
		//		СтруктураДанных = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ЗначениеВременный, "ИзмерениеПланирования, Периодичность");
		//		Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ИзмерениеПланирования"		, СтруктураДанных.ИзмерениеПланирования);
		//		Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодичностьПланирования"	, СтруктураДанных.Периодичность);
		//		
		//		// УстановитьТипИерархииОбъектаПланирования(ЗначениеВременный);
		//	КонецЕсли;
		//	
		// КонецЕсли;

	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОписанияПараметров()
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	Для Каждого Параметр Из Настройки.ПараметрыДанных.Элементы Цикл
		Если Не ЗначениеЗаполнено(Параметр.ИдентификаторПользовательскойНастройки) 
			ИЛИ Параметр.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
			Продолжить;
		КонецЕсли;
		ИмяПараметра = Строка(Параметр.Параметр);
		Параметр.Использование = Истина;
		Если НРег(ИмяПараметра) = "период" 
			ИЛИ НРег(ИмяПараметра) = "стпериод" 
			ИЛИ НРег(ИмяПараметра) = "началопериода" 
			ИЛИ НРег(ИмяПараметра) = "конецпериода" 
			ИЛИ (НРег(ИмяПараметра) = "периодичность" И НастройкиОтчета.ИспользоватьПериодичность)
			ИЛИ НРег(ИмяПараметра) = "периодотчета"  
			ИЛИ НРег(ИмяПараметра) = "датаокончания" Тогда
			     
			Продолжить;
		КонецЕсли; 
		Стр = ДобавитьОписаниеНастройки(ПоляНастроек.ПолучитьЭлементы(), ТипПараметр(), ИмяПараметра, Параметр.ПредставлениеПользовательскойНастройки, Параметр);
		Если Стр = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьЭлементыИРеквизитыПараметра(Стр, Параметр = Неопределено, ДоступныйПараметр)
	
	ТипЗначения		= Стр.ТипЗначения;
	Идентификатор	= НовоеИмяРеквизита(ТипПараметр());
	
	Стр.Элементы	= Новый Структура;
	Стр.Реквизиты	= Новый Структура;
	
	Значение = ?(НЕ Параметр = Неопределено И Параметр.Использование, 
					Параметр.Значение, 
					Неопределено);
	
	Стр.ЗначениеПоУмолчанию = Значение;
	
	Если ТипЗначения.Типы().Количество()=0 Тогда
		// Неверно задан тип
		Возврат;
	ИначеЕсли ТипЗначения.Типы().Количество()>1 Тогда
		// Многотипный фильтр
		Стр.ВидЭлемента = "Поле";
		Стр.Реквизиты.Вставить(Идентификатор, Значение);
	ИначеЕсли ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ТипЗначения, Тип("Строка")) Тогда
		// Строка
		Стр.ВидЭлемента = "Поле";
		Стр.Реквизиты.Вставить(Идентификатор, Значение);
	ИначеЕсли ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ТипЗначения, Тип("Дата")) Тогда
		// Дата
		Стр.ВидЭлемента = "Поле";
		Стр.Реквизиты.Вставить(Идентификатор, Значение);
	ИначеЕсли ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ТипЗначения, Тип("СтандартныйПериод")) Тогда
		// Дата
		Стр.ВидЭлемента = "Период";
		Стр.Реквизиты.Вставить(Идентификатор, Значение);
	ИначеЕсли ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ТипЗначения, Тип("Число")) Тогда
		// Число
		Стр.ВидЭлемента = "Поле";
		Стр.Реквизиты.Вставить(Идентификатор, Значение);
	ИначеЕсли ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ТипЗначения, Тип("Булево")) Тогда
		// Булево
		Стр.ВидЭлемента = "Булево";
		Стр.Реквизиты.Вставить(Идентификатор, Значение);
	ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипЗначения.Типы().Получить(0)) Тогда
		// Ссылочный тип
		ПараметрыВыбора = ОпределитьПараметрыВыбора(ДоступныйПараметр);
		КоличествоЭлементов = ОтчетыСервер.ОпределитьКоличествоЭлементов(ТипЗначения.Типы().Получить(0), ПараметрыВыбора);
		Если КоличествоЭлементов = 0 Тогда
			// Ни одного объекта в БД
			Возврат;
		КонецЕсли; 
		Если КоличествоЭлементов < 3 Тогда
			Стр.ВидЭлемента = "Тумблер";
			Значения = ОтчетыСервер.ПолучитьСписокЭлементов(ТипЗначения.Типы().Получить(0), ПараметрыВыбора);
			Стр.Реквизиты.Вставить(Идентификатор, Значения);
		Иначе
			Если КоличествоЭлементов <= 10
				И Не Стр.Поле = "ВидСделки" Тогда
				Стр.ДополнительныеПараметры.Вставить("БыстрыйВыбор", Истина);
			КонецЕсли; 
			Стр.ВидЭлемента = "Поле";
			Стр.Реквизиты.Вставить(Идентификатор, Значение);
		КонецЕсли;
	Иначе
		// ХранилищеЗначения, УникальныйИдентификатор
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область НаложеныеФильтры

&НаСервере
Процедура ЗаполнитьТаблицуНаложенныхФильтров()
	
	НаложенныеФильтры.Очистить();
	СхемаКД = ПолучитьИзВременногоХранилища(НастройкиОтчета.АдресСхемы);
	
	Для Каждого ЭлементОтбор Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если Не ЭлементОтбор.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ПустаяСтрока(ЭлементОтбор.Представление) И ЭлементОтбор.РежимОтображения <> РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
			Стр = НаложенныеФильтры.Добавить();
			Стр.ИмяКнопки = ЭлементОтбор.ПредставлениеПользовательскойНастройки;
			Стр.Заголовок = ЭлементОтбор.Представление;
			Если ТипЗнч(ЭлементОтбор)=Тип("ГруппаЭлементовОтбораКомпоновкиДанных") И ЭлементОтбор.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе Тогда
				Стр.ПризнакИсключения = Истина;
			КонецЕсли; 
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ЭлементОтбор)=Тип("ГруппаЭлементовОтбораКомпоновкиДанных") И ЭлементОтбор.РежимОтображения <> РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
			Стр = НаложенныеФильтры.Добавить();
			Если ПустаяСтрока(ЭлементОтбор.ПредставлениеПользовательскойНастройки) Тогда
				ЭлементОтбор.ПредставлениеПользовательскойНастройки = НовоеИмяОтметкиФильтра();
			КонецЕсли; 
			Стр.ИмяКнопки = ЭлементОтбор.ПредставлениеПользовательскойНастройки;
			Стр.Заголовок = ЗаголовокГруппыОтбора(ЭлементОтбор);
			Если ЭлементОтбор.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе Тогда
				Стр.ПризнакИсключения = Истина;
			КонецЕсли; 
		КонецЕсли; 
		
		Если Не ТипЗнч(ЭлементОтбор)=Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ЭлементОтбор.ПравоеЗначение)=Тип("ПолеКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементОтбор.РежимОтображения=РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПоля = Строка(ЭлементОтбор.ЛевоеЗначение);
		ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(ЭлементОтбор.ЛевоеЗначение);
		
		Если ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно 
			ИЛИ ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Больше
			ИЛИ ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно
			ИЛИ ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Меньше Тогда
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Поле", ИмяПоля);
			СтрокиФильтров = НаложенныеФильтры.НайтиСтроки(СтруктураОтбора);
			Если СтрокиФильтров.Количество()=0 Тогда
				Стр = НаложенныеФильтры.Добавить();
				Если Не ДоступноеПоле=Неопределено И ДоступноеПоле.ТипЗначения.СодержитТип(Тип("Дата")) Тогда
					Стр.Значение = Новый СтандартныйПериод;
				Иначе
					Стр.Значение = Новый Структура("ЗначениеОт,ЗначениеДо", Неопределено, Неопределено);
				КонецЕсли; 
			Иначе
				Стр = СтрокиФильтров[0];
			КонецЕсли;
		Иначе
			Стр = НаложенныеФильтры.Добавить();
		КонецЕсли;
		
		Если Не ПустаяСтрока(ЭлементОтбор.ПредставлениеПользовательскойНастройки) Тогда
			Стр.ИмяКнопки = ЭлементОтбор.ПредставлениеПользовательскойНастройки;
		КонецЕсли;
		
		Стр.Поле = ИмяПоля;
		Если Не ПустаяСтрока(ЭлементОтбор.Представление) Тогда
			Стр.Заголовок = ЭлементОтбор.Представление;
		КонецЕсли; 
		Если ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.НеРавно ИЛИ 
			ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСписке ИЛИ 
			ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.НеВИерархии ИЛИ 
			ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
			Стр.ПризнакИсключения = Истина;
		КонецЕсли; 
		
		Если ФормаПараметры.ЭтоМобильныйКлиент Тогда
			КоличествоОбъединяемыхЭлементов = 5;
		Иначе
			КоличествоОбъединяемыхЭлементов = 10;
		КонецЕсли;
		
		Если ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно 
			ИЛИ ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Больше Тогда
			Если ТипЗнч(Стр.Значение)=Тип("СтандартныйПериод") Тогда
				Стр.Значение.ДатаНачала = НачалоДня(ЭлементОтбор.ПравоеЗначение);
			ИначеЕсли ТипЗнч(Стр.Значение)=Тип("Структура") Тогда
				Стр.Значение.ЗначениеОт = ?(Стр.Значение.ЗначениеОт=Неопределено, ЭлементОтбор.ПравоеЗначение, Макс(?(ЭлементОтбор.ПравоеЗначение = Неопределено, 0, ЭлементОтбор.ПравоеЗначение), Стр.Значение.ЗначениеОт));
			ИначеЕсли ТипЗнч(Стр.Значение)=Тип("Число") Тогда
				Стр.Значение = Новый Структура("ЗначениеОт, ЗначениеДо");
				Стр.Значение.ЗначениеОт = ?(Стр.Значение.ЗначениеОт=Неопределено, ЭлементОтбор.ПравоеЗначение, Макс(?(ЭлементОтбор.ПравоеЗначение = Неопределено, 0, ЭлементОтбор.ПравоеЗначение), Стр.Значение.ЗначениеОт));
			ИначеЕсли ТипЗнч(Стр.Значение)=Тип("Дата") Тогда
				Стр.Значение = Новый СтандартныйПериод;
				Стр.Значение.ДатаНачала = НачалоДня(ЭлементОтбор.ПравоеЗначение);
			КонецЕсли; 
		ИначеЕсли ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно 
			ИЛИ ЭлементОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Меньше Тогда
			Если ТипЗнч(Стр.Значение)=Тип("СтандартныйПериод") Тогда
				Стр.Значение.ДатаОкончания = ?(НЕ ЗначениеЗаполнено(ЭлементОтбор.ПравоеЗначение), ЭлементОтбор.ПравоеЗначение, ЭлементОтбор.ПравоеЗначение);
			ИначеЕсли ТипЗнч(Стр.Значение)=Тип("Структура") Тогда
				Стр.Значение.ЗначениеДо = ?(Стр.Значение.ЗначениеДо=Неопределено, ЭлементОтбор.ПравоеЗначение, Мин(?(ЭлементОтбор.ПравоеЗначение = Неопределено, 0, ЭлементОтбор.ПравоеЗначение), Стр.Значение.ЗначениеДо));
			ИначеЕсли ТипЗнч(Стр.Значение)=Тип("Число") Тогда
				Стр.Значение = Новый Структура("ЗначениеОт, ЗначениеДо");
				Стр.Значение.ЗначениеДо = ?(Стр.Значение.ЗначениеДо=Неопределено, ЭлементОтбор.ПравоеЗначение, Мин(?(ЭлементОтбор.ПравоеЗначение = Неопределено, 0, ЭлементОтбор.ПравоеЗначение), Стр.Значение.ЗначениеДо));
			ИначеЕсли ТипЗнч(Стр.Значение)=Тип("Дата") Тогда
				Стр.Значение = Новый СтандартныйПериод;
				Стр.Значение.ДатаОкончания = ?(НЕ ЗначениеЗаполнено(ЭлементОтбор.ПравоеЗначение), ЭлементОтбор.ПравоеЗначение, ЭлементОтбор.ПравоеЗначение);
			КонецЕсли; 
		ИначеЕсли ТипЗнч(ЭлементОтбор.ПравоеЗначение)=Тип("СписокЗначений") И ЭлементОтбор.ПравоеЗначение.Количество()<=10 Тогда
			Для Каждого ЭлементСписка Из ЭлементОтбор.ПравоеЗначение Цикл
				Если ЗначениеЗаполнено(Стр.Значение) Тогда
					НоваяСтрока = НаложенныеФильтры.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
					НоваяСтрока.Значение = ЭлементСписка.Значение;
					Стр = НоваяСтрока;
				Иначе
					
					Если ТипЗнч(ЭлементСписка.Значение) <> Тип("Массив") Тогда
						Стр.Значение = ЭлементСписка.Значение;
					Иначе
						НаложенныеФильтры.Удалить(Стр);	
					КонецЕсли;
					
				КонецЕсли;
				Если Не ПустаяСтрока(ЭлементОтбор.ПредставлениеПользовательскойНастройки) Тогда
					Индекс = ЭлементОтбор.ПравоеЗначение.Индекс(ЭлементСписка);
					Стр.ИмяКнопки = ЭлементОтбор.ПредставлениеПользовательскойНастройки+"_"+Формат(Индекс, "ЧГ=0");
				КонецЕсли;
			КонецЦикла;
		Иначе
			Стр.Значение = ЭлементОтбор.ПравоеЗначение;
		КонецЕсли;
		
	КонецЦикла;
	
	// Формирование заголовков отметок фильтров
	Для Каждого Стр Из НаложенныеФильтры Цикл
		
		Если Не ПустаяСтрока(Стр.Заголовок) Тогда
			Продолжить;
		КонецЕсли; 
		
		ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(Стр.Поле));
		Если ДоступноеПоле=Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		Стр.Заголовок = ДоступноеПоле.Заголовок;
		
		ЗаголовокФильтра = Стр.Заголовок;
		Префикс = "";
		
		Если ТипЗнч(Стр.Значение)=Тип("СтандартныйПериод") Тогда
			ПредставлениеЗначения = ПредставлениеПериода(Стр.Значение.ДатаНачала, Стр.Значение.ДатаОкончания);
			Префикс = ЗаголовокФильтра;
		ИначеЕсли ТипЗнч(Стр.Значение)=Тип("Структура") Тогда
			Если Не Стр.Значение.ЗначениеОт=Неопределено И НЕ Стр.Значение.ЗначениеДо=Неопределено Тогда
				ПредставлениеЗначения = НСтр("ru = 'от '")+Строка(Стр.Значение.ЗначениеОт) + НСтр("ru = ' до '") + Строка(Стр.Значение.ЗначениеДо);
			ИначеЕсли Не Стр.Значение.ЗначениеОт=Неопределено Тогда
				ПредставлениеЗначения = НСтр("ru = 'от '")+Строка(Стр.Значение.ЗначениеОт);
			ИначеЕсли Не Стр.Значение.ЗначениеДо=Неопределено Тогда
				ПредставлениеЗначения = НСтр("ru = 'до '")+Строка(Стр.Значение.ЗначениеДо);
			КонецЕсли; 
			Префикс = ЗаголовокФильтра;
		ИначеЕсли ТипЗнч(Стр.Значение)=Тип("СписокЗначений") Тогда
			ПредставлениеЗначения = Строка(Стр.Значение);
		ИначеЕсли Не ЗначениеЗаполнено(Стр.Значение) Тогда
			ПредставлениеЗначения = ЗаголовокФильтра+НСтр("ru = ': не указано'");
		ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Стр.Значение)) Тогда
			ПредставлениеЗначения = Строка(Стр.Значение);
		ИначеЕсли ТипЗнч(Стр.Значение)=Тип("Булево") ИЛИ ТипЗнч(Стр.Значение)=Тип("Дата") Тогда
			ПолеСхемы = ОтчетыСервер.ПолеСхемы(СхемаКД, Стр.Поле);
			Если ПолеСхемы = Неопределено Тогда
				Параметр = Неопределено;
			Иначе
				Параметр = ПолеСхемы.Оформление.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Формат"));
				Если Параметр=Неопределено ИЛИ НЕ ЗначениеЗаполнено(Параметр.Значение) Тогда
					Параметр = ПолеСхемы.ПараметрыРедактирования.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ФорматРедактирования"));
				КонецЕсли; 
			КонецЕсли;
			Если Параметр <> Неопределено
				И Параметр.Использование
				И ЗначениеЗаполнено(Параметр.Значение) Тогда
				ПредставлениеЗначения = Формат(Стр.Значение, Параметр.Значение);
				Префикс = "";
			Иначе
				ПредставлениеЗначения = Строка(Стр.Значение);
				Префикс = ЗаголовокФильтра;
			КонецЕсли; 
		Иначе
			ПредставлениеЗначения = Строка(Стр.Значение);
			Префикс = ЗаголовокФильтра;
		КонецЕсли;
		
		Стр.Заголовок = ?(ПустаяСтрока(Префикс), "", Префикс + ": ") + ПредставлениеЗначения;		
				
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗаголовокГруппыОтбора(Группа)
	
	Результат = "";
	Для Каждого Элемент Из Группа.Элементы Цикл
		Если Не ПустаяСтрока(Результат) И НЕ Группа.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе Тогда
			Результат = Результат+" "+ПредставлениеТипаГруппы(Группа.ТипГруппы)+" ";
		ИначеЕсли ПустаяСтрока(Результат) И Группа.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе Тогда
			Результат = ПредставлениеТипаГруппы(Группа.ТипГруппы)+" ";
		КонецЕсли; 
		Если ТипЗнч(Элемент.ЛевоеЗначение)=Тип("ПолеКомпоновкиДанных") Тогда
			ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Элемент.ЛевоеЗначение);
			Результат = Результат+?(ДоступноеПоле=Неопределено ИЛИ ПустаяСтрока(ДоступноеПоле.Заголовок), Строка(Элемент.ЛевоеЗначение), ДоступноеПоле.Заголовок);
		Иначе
			Результат = Результат+Строка(Элемент.ЛевоеЗначение);
		КонецЕсли; 
		Результат = Результат+ПредставлениеВидаСравнения(Элемент.ВидСравнения);
		Если Элемент.ВидСравнения<>ВидСравненияКомпоновкиДанных.Заполнено И Элемент.ВидСравнения<>ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
			Если ТипЗнч(Элемент.ПравоеЗначение)=Тип("ПолеКомпоновкиДанных") Тогда
				ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Элемент.ПравоеЗначение);
				Результат = Результат+?(ДоступноеПоле=Неопределено ИЛИ ПустаяСтрока(ДоступноеПоле.Заголовок), Строка(Элемент.ЛевоеЗначение), ДоступноеПоле.Заголовок);
			Иначе
				Результат = Результат+Строка(Элемент.ПравоеЗначение);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеТипаГруппы(Тип)
	
	Если Тип=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ Тогда
		Возврат НСтр("ru = 'И'");
	ИначеЕсли Тип=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли Тогда
		Возврат НСтр("ru = 'ИЛИ'");
	ИначеЕсли Тип=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе Тогда
		Возврат НСтр("ru = 'НЕ'");
	Иначе
		Возврат "";
	КонецЕсли; 	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеВидаСравнения(ВидСравнения)
	
	Если ВидСравнения=ВидСравненияКомпоновкиДанных.Больше Тогда
		Возврат ">";
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
		Возврат ">=";
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.ВИерархии Тогда
		Возврат НСтр("ru = ' в группе '");
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке Тогда
		Возврат НСтр("ru = ' в списке '");
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
		Возврат НСтр("ru = ' в списке групп '");
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.Заполнено Тогда
		Возврат НСтр("ru = ' заполнено'");
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.Меньше Тогда
		Возврат "<";
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
		Возврат "<=";
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.НачинаетсяС Тогда
		Возврат НСтр("ru = ' начинается с '");
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
		Возврат НСтр("ru = ' не в группе '");
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСписке Тогда
		Возврат НСтр("ru = ' не в списке '");
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
		Возврат НСтр("ru = ' не в списке групп '");
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
		Возврат НСтр("ru = ' не заполнено'");
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.НеНачинаетсяС Тогда
		Возврат НСтр("ru = ' не начинается с '");
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.НеПодобно Тогда
		Возврат НСтр("ru = ' не подобно '");
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.НеРавно Тогда
		Возврат "<>";
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.НеСодержит Тогда
		Возврат НСтр("ru = ' не содержит '");
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.Подобно Тогда
		Возврат НСтр("ru = ' подобно '");
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.Равно Тогда
		Возврат "=";
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.Содержит Тогда
		Возврат НСтр("ru = ' содержит '");
	Иначе
		Возврат "";
	КонецЕсли; 	
	
КонецФункции

&НаСервере
Процедура ОбновитьОтображениеОтметокФильтров()
	
	Если НаложенныеФильтры.Количество() > 0 Тогда
		УдалитьПодчиненныеЭлементы();
	КонецЕсли;
	ЗаполнитьТаблицуНаложенныхФильтров();
	
	Если Элементы.ПредставлениеПериода.Видимость Тогда
		Если ФормаПараметры.ВариантИнтерфейса=ВариантИнтерфейсаКлиентскогоПриложения.Такси Тогда
			Элементы.ПредставлениеПериода.Ширина = Окр(СтрДлина(ПредставлениеПериода)*0.75+4);
		Иначе
			Элементы.ПредставлениеПериода.Ширина = Окр(СтрДлина(ПредставлениеПериода)*0.8+4);
		КонецЕсли; 
		ТекущаяДлинаСтрокиОтметок = Элементы.ПредставлениеПериода.Ширина+СтрДлина(Элементы.ПредставлениеПериода.Заголовок)+1;
	Иначе
		ТекущаяДлинаСтрокиОтметок = 0;
	КонецЕсли; 
	
	Если ФормаПараметры.ЭтоМобильныйКлиент Тогда
		ВысотаОтметкиФильтра = 0;
	КонецЕсли;

	Для Каждого Стр Из НаложенныеФильтры Цикл
		
		ИмяГруппы = ПолучитьИмяГруппы(Стр.Поле);
		
		Если ИмяГруппы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		  
		ГруппаСтрока = Элементы[ИмяГруппы];
	
		Если ПустаяСтрока(Стр.ИмяКнопки) Тогда
			Стр.ИмяКнопки = НовоеИмяОтметкиФильтра();
		КонецЕсли;
		
		Если СтрДлина(Стр.Заголовок) > 26 Тогда			
			ЗаголовокЭлемента = Лев(Стр.Заголовок, 22) + "...";
		Иначе
			ЗаголовокЭлемента = Стр.Заголовок;
		КонецЕсли; 
		ЗаголовокЭлемента = " " + ЗаголовокЭлемента;
		Если ФормаПараметры.ВариантИнтерфейса = ВариантИнтерфейсаКлиентскогоПриложения.Такси 
			И Не ФормаПараметры.ЭтоМобильныйКлиент Тогда
			ДлинаЭлемента = Окр(СтрДлина(ЗаголовокЭлемента)*0.8 + 4);
		Иначе
			ДлинаЭлемента = Окр(СтрДлина(ЗаголовокЭлемента)*0.85 + 4);
		КонецЕсли; 
			
		ЭлементыЗаголовка = Новый Массив;
		ЭлементыЗаголовка.Добавить(Новый ФорматированнаяСтрока(ЗаголовокЭлемента));
		ЭлементыЗаголовка.Добавить(Новый ФорматированнаяСтрока(БиблиотекаКартинок.ОчиститьДанные,,,, Стр.ИмяКнопки));
		
		ИмяКолонки = СтрЗаменить(Стр.ИмяКнопки, " ", "");
		ЭлементОтметка = Элементы.Добавить(ИмяКолонки, Тип("ДекорацияФормы"), ГруппаСтрока);

		ЭлементОтметка.Вид = ВидДекорацииФормы.Надпись;
		ЭлементОтметка.Заголовок = Новый ФорматированнаяСтрока(ЭлементыЗаголовка);
		Если Не Стр.Заголовок=ЗаголовокЭлемента Тогда
			ЭлементОтметка.Подсказка = Стр.Заголовок;
		КонецЕсли; 
		ЭлементОтметка.ГоризонтальноеПоложение		= ГоризонтальноеПоложениеЭлемента.Лево;
		ЭлементОтметка.ЦветФона						= ?(Стр.ПризнакИсключения, ЦветаСтиля.УдаленныйРеквизитФон, ЦветаСтиля.ЦветФонаПодсказки);
		ЭлементОтметка.Ширина						= 20;
		ЭлементОтметка.Высота						= 1;
		ЭлементОтметка.РастягиватьПоГоризонтали		= Ложь;
		ЭлементОтметка.ВертикальноеПоложение		= ВертикальноеПоложениеЭлемента.Центр;
		ЭлементОтметка.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
		
		ЭлементОтметка.УстановитьДействие("ОбработкаНавигационнойСсылки", "Подключаемый_УдалитьФильтрНажатие");
		
		ТекущаяДлинаСтрокиОтметок = ТекущаяДлинаСтрокиОтметок+ДлинаЭлемента;
		
	КонецЦикла;
	
	Если Элементы.СтрокиОтметокФильтров.ПодчиненныеЭлементы.Количество()>50 Тогда
		Элементы.ОтчетТабличныйДокумент.РастягиватьПоВертикали = Ложь;
	ИначеЕсли Не Элементы.ОтчетТабличныйДокумент.РастягиватьПоВертикали Тогда
		Элементы.ОтчетТабличныйДокумент.РастягиватьПоВертикали = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПодчиненныеЭлементы()
	
	Для Каждого Стр Из НаложенныеФильтры Цикл
		
		ИмяГруппы = ПолучитьИмяГруппы(Стр.Поле);
		
		Если ИмяГруппы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ГруппаСтрока = Элементы[ИмяГруппы];
		
		МассивКУдалению = Новый Массив;
		Для Каждого Элемент Из ГруппаСтрока.ПодчиненныеЭлементы Цикл
			МассивКУдалению.Добавить(Элемент);
		КонецЦикла; 
		
		Для Каждого Элемент Из МассивКУдалению Цикл
			Элементы.Удалить(Элемент);
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьИмяГруппы(Поле)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Поле"       , Поле);
	СтруктураОтбора.Вставить("ВидЭлемента", "Поле");
	Идентификаторы = ИдентификаторыСтрок(ПоляНастроек, СтруктураОтбора, Истина);
	Для Каждого Идентификатор Из Идентификаторы Цикл
		Стр = ПоляНастроек.НайтиПоИдентификатору(Идентификатор);
		Если Стр = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		Возврат Стр.ИмяГруппыОтметкиФильтров;
	КонецЦикла;
	
КонецФункции

#КонецОбласти 


#Область НаложеныеПараметры

&НаСервере
Процедура ЗаполнитьТаблицуНаложенныхПараметров()
	
	НаложенныеПараметры.Очистить();
	СхемаКД = ПолучитьИзВременногоХранилища(НастройкиОтчета.АдресСхемы);
	
	Для Каждого ЭлементПараметр Из Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		
		Если Не ЭлементПараметр.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ПустаяСтрока(ЭлементПараметр.ПредставлениеПользовательскойНастройки) Тогда
			Стр = НаложенныеПараметры.Добавить();
			Стр.ИмяКнопки = ЭлементПараметр.ПредставлениеПользовательскойНастройки;
			Стр.Заголовок = ЭлементПараметр.ПредставлениеПользовательскойНастройки;			
			Продолжить;
		КонецЕсли; 		
		
		Если Не ТипЗнч(ЭлементПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ТипЗнч(ЭлементПараметр.Значение) = Тип("СписокЗначений") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЭлементПараметр.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементПараметр.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПоля	= Строка(ЭлементПараметр.Параметр); 		
		Стр		= НаложенныеПараметры.Добавить();
		
		Если Не ПустаяСтрока(ЭлементПараметр.ПредставлениеПользовательскойНастройки) Тогда
			Стр.ИмяКнопки = ЭлементПараметр.ПредставлениеПользовательскойНастройки;
			Стр.Заголовок = ЭлементПараметр.ПредставлениеПользовательскойНастройки;
		КонецЕсли;
		
		Стр.Поле = ИмяПоля;
						
		КоличествоОбъединяемыхЭлементов = ?(ФормаПараметры.ЭтоМобильныйКлиент, 5, 10);
		
		Если ТипЗнч(ЭлементПараметр.Значение) = Тип("СписокЗначений") И ЭлементПараметр.Значение.Количество() <= 10 Тогда
			Для Каждого ЭлементСписка Из ЭлементПараметр.Значение Цикл
				Если ЗначениеЗаполнено(Стр.Значение) Тогда
					НоваяСтрока = НаложенныеПараметры.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
					НоваяСтрока.Значение = ЭлементСписка.Значение;
					Стр = НоваяСтрока;
				Иначе
					Стр.Значение = ЭлементСписка.Значение;
				КонецЕсли;
				Если Не ПустаяСтрока(ЭлементПараметр.ПредставлениеПользовательскойНастройки) Тогда
					Индекс = ЭлементПараметр.Значение.Индекс(ЭлементСписка);
					Стр.ИмяКнопки = ЭлементПараметр.ПредставлениеПользовательскойНастройки + "_" + Формат(Индекс, "ЧГ=0");
				КонецЕсли;
			КонецЦикла;
		Иначе
			Стр.Значение = ЭлементПараметр.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	// Формирование заголовков отметок фильтров
	Для Каждого Стр Из НаложенныеПараметры Цикл
		
		Если Не ПустаяСтрока(Стр.Заголовок) Тогда
			Продолжить;
		КонецЕсли; 
		
		ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(Стр.Поле);
		Если ДоступноеПоле = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		Стр.Заголовок		= ДоступноеПоле.ПредставлениеПользовательскойНастройки; 		
		ЗаголовокФильтра	= Стр.Заголовок;
		Префикс				= "";                      
		
		// Если ТипЗнч(Стр.Значение)=Тип("СтандартныйПериод") Тогда
		//	ПредставлениеЗначения = ПредставлениеПериода(Стр.Значение.ДатаНачала, Стр.Значение.ДатаОкончания);
		//	Префикс = ЗаголовокФильтра;
		// ИначеЕсли ТипЗнч(Стр.Значение)=Тип("Структура") Тогда
		//	Если Не Стр.Значение.ЗначениеОт=Неопределено И НЕ Стр.Значение.ЗначениеДо=Неопределено Тогда
		//		ПредставлениеЗначения = НСтр("ru = 'от '")+Строка(Стр.Значение.ЗначениеОт) + НСтр("ru = ' до '") + Строка(Стр.Значение.ЗначениеДо);
		//	ИначеЕсли Не Стр.Значение.ЗначениеОт=Неопределено Тогда
		//		ПредставлениеЗначения = НСтр("ru = 'от '")+Строка(Стр.Значение.ЗначениеОт);
		//	ИначеЕсли Не Стр.Значение.ЗначениеДо=Неопределено Тогда
		//		ПредставлениеЗначения = НСтр("ru = 'до '")+Строка(Стр.Значение.ЗначениеДо);
		//	КонецЕсли; 
		//	Префикс = ЗаголовокФильтра;
		// ИначеЕсли ТипЗнч(Стр.Значение)=Тип("СписокЗначений") Тогда
		Если ТипЗнч(Стр.Значение) = Тип("СписокЗначений") Тогда
			ПредставлениеЗначения = Строка(Стр.Значение);
		// ИначеЕсли Не ЗначениеЗаполнено(Стр.Значение) Тогда
		//	ПредставлениеЗначения = ЗаголовокФильтра+НСтр("ru = ': не указано'");
		ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Стр.Значение)) Тогда
			ПредставлениеЗначения = Строка(Стр.Значение);
		// ИначеЕсли ТипЗнч(Стр.Значение)=Тип("Булево") ИЛИ ТипЗнч(Стр.Значение)=Тип("Дата") Тогда
		//	ПолеСхемы = ОтчетыСервер.ПолеСхемы(СхемаКД, Стр.Поле);
		//	Если ПолеСхемы = Неопределено Тогда
		//		Параметр = Неопределено;
		//	Иначе
		//		Параметр = ПолеСхемы.Оформление.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Формат"));
		//		Если Параметр=Неопределено ИЛИ НЕ ЗначениеЗаполнено(Параметр.Значение) Тогда
		//			Параметр = ПолеСхемы.ПараметрыРедактирования.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ФорматРедактирования"));
		//		КонецЕсли; 
		//	КонецЕсли;
		//	Если Параметр <> Неопределено
		//		И Параметр.Использование
		//		И ЗначениеЗаполнено(Параметр.Значение) Тогда
		//		ПредставлениеЗначения = Формат(Стр.Значение, Параметр.Значение);
		//		Префикс = "";
		//	Иначе
		//		ПредставлениеЗначения = Строка(Стр.Значение);
		//		Префикс = ЗаголовокФильтра;
		//	КонецЕсли; 
		Иначе
			ПредставлениеЗначения = Строка(Стр.Значение);
			Префикс = ЗаголовокФильтра;
		КонецЕсли;
		
		Стр.Заголовок = ?(ПустаяСтрока(Префикс), "", Префикс + ": ") + ПредставлениеЗначения;		
				
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПодчиненныеЭлементыНаложенныхПараметров()
	
	Для Каждого Стр Из НаложенныеПараметры Цикл
		
		ИмяГруппы = ПолучитьИмяГруппы(Стр.Поле);
		
		Если ИмяГруппы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ГруппаСтрока = Элементы[ИмяГруппы];
		
		МассивКУдалению = Новый Массив;
		Для Каждого Элемент Из ГруппаСтрока.ПодчиненныеЭлементы Цикл
			МассивКУдалению.Добавить(Элемент);
		КонецЦикла; 
		
		Для Каждого Элемент Из МассивКУдалению Цикл
			Элементы.Удалить(Элемент);
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

//&НаСервере
// Функция ЗаголовокГруппыОтбора(Группа)
//	
//	Результат = "";
//	Для Каждого Элемент Из Группа.Элементы Цикл
//		Если Не ПустаяСтрока(Результат) И НЕ Группа.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе Тогда
//			Результат = Результат+" "+ПредставлениеТипаГруппы(Группа.ТипГруппы)+" ";
//		ИначеЕсли ПустаяСтрока(Результат) И Группа.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе Тогда
//			Результат = ПредставлениеТипаГруппы(Группа.ТипГруппы)+" ";
//		КонецЕсли; 
//		Если ТипЗнч(Элемент.ЛевоеЗначение)=Тип("ПолеКомпоновкиДанных") Тогда
//			ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Элемент.ЛевоеЗначение);
//			Результат = Результат+?(ДоступноеПоле=Неопределено ИЛИ ПустаяСтрока(ДоступноеПоле.Заголовок), Строка(Элемент.ЛевоеЗначение), ДоступноеПоле.Заголовок);
//		Иначе
//			Результат = Результат+Строка(Элемент.ЛевоеЗначение);
//		КонецЕсли; 
//		Результат = Результат+ПредставлениеВидаСравнения(Элемент.ВидСравнения);
//		Если Элемент.ВидСравнения<>ВидСравненияКомпоновкиДанных.Заполнено И Элемент.ВидСравнения<>ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
//			Если ТипЗнч(Элемент.ПравоеЗначение)=Тип("ПолеКомпоновкиДанных") Тогда
//				ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Элемент.ПравоеЗначение);
//				Результат = Результат+?(ДоступноеПоле=Неопределено ИЛИ ПустаяСтрока(ДоступноеПоле.Заголовок), Строка(Элемент.ЛевоеЗначение), ДоступноеПоле.Заголовок);
//			Иначе
//				Результат = Результат+Строка(Элемент.ПравоеЗначение);
//			КонецЕсли; 
//		КонецЕсли; 
//	КонецЦикла;
//	Возврат Результат;
//	
// КонецФункции

//&НаСервереБезКонтекста
// Функция ПредставлениеТипаГруппы(Тип)
//	
//	Если Тип=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ Тогда
//		Возврат НСтр("ru = 'И'");
//	ИначеЕсли Тип=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли Тогда
//		Возврат НСтр("ru = 'ИЛИ'");
//	ИначеЕсли Тип=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе Тогда
//		Возврат НСтр("ru = 'НЕ'");
//	Иначе
//		Возврат "";
//	КонецЕсли; 	
//	
// КонецФункции

//&НаСервереБезКонтекста
// Функция ПредставлениеВидаСравнения(ВидСравнения)
//	
//	Если ВидСравнения=ВидСравненияКомпоновкиДанных.Больше Тогда
//		Возврат ">";
//	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
//		Возврат ">=";
//	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.ВИерархии Тогда
//		Возврат НСтр("ru = ' в группе '");
//	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке Тогда
//		Возврат НСтр("ru = ' в списке '");
//	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
//		Возврат НСтр("ru = ' в списке групп '");
//	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.Заполнено Тогда
//		Возврат НСтр("ru = ' заполнено'");
//	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.Меньше Тогда
//		Возврат "<";
//	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
//		Возврат "<=";
//	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.НачинаетсяС Тогда
//		Возврат НСтр("ru = ' начинается с '");
//	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
//		Возврат НСтр("ru = ' не в группе '");
//	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСписке Тогда
//		Возврат НСтр("ru = ' не в списке '");
//	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
//		Возврат НСтр("ru = ' не в списке групп '");
//	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
//		Возврат НСтр("ru = ' не заполнено'");
//	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.НеНачинаетсяС Тогда
//		Возврат НСтр("ru = ' не начинается с '");
//	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.НеПодобно Тогда
//		Возврат НСтр("ru = ' не подобно '");
//	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.НеРавно Тогда
//		Возврат "<>";
//	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.НеСодержит Тогда
//		Возврат НСтр("ru = ' не содержит '");
//	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.Подобно Тогда
//		Возврат НСтр("ru = ' подобно '");
//	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.Равно Тогда
//		Возврат "=";
//	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.Содержит Тогда
//		Возврат НСтр("ru = ' содержит '");
//	Иначе
//		Возврат "";
//	КонецЕсли; 	
//	
// КонецФункции

//&НаСервере
// Процедура ОбновитьОтображениеОтметокФильтров()
//	
//	Если НаложенныеФильтры.Количество() > 0 Тогда
//		УдалитьПодчиненныеЭлементы();
//	КонецЕсли;
//	ЗаполнитьТаблицуНаложенныхФильтров();
//	
//	Если Элементы.ПредставлениеПериода.Видимость Тогда
//		Если ФормаПараметры.ВариантИнтерфейса=ВариантИнтерфейсаКлиентскогоПриложения.Такси Тогда
//			Элементы.ПредставлениеПериода.Ширина = Окр(СтрДлина(ПредставлениеПериода)*0.75+4);
//		Иначе
//			Элементы.ПредставлениеПериода.Ширина = Окр(СтрДлина(ПредставлениеПериода)*0.8+4);
//		КонецЕсли; 
//		ТекущаяДлинаСтрокиОтметок = Элементы.ПредставлениеПериода.Ширина+СтрДлина(Элементы.ПредставлениеПериода.Заголовок)+1;
//	Иначе
//		ТекущаяДлинаСтрокиОтметок = 0;
//	КонецЕсли; 
//	
//	Если ФормаПараметры.ЭтоМобильныйКлиент Тогда
//		ВысотаОтметкиФильтра = 0;
//	КонецЕсли;

//	Для Каждого Стр Из НаложенныеФильтры Цикл
//		
//		ИмяГруппы = ПолучитьИмяГруппы(Стр.Поле);
//		
//		Если ИмяГруппы = Неопределено Тогда
//			Продолжить;
//		КонецЕсли;
//		  
//		ГруппаСтрока = Элементы[ИмяГруппы];
//	
//		Если ПустаяСтрока(Стр.ИмяКнопки) Тогда
//			Стр.ИмяКнопки = НовоеИмяОтметкиФильтра();
//		КонецЕсли;
//		
//		Если СтрДлина(Стр.Заголовок) > 26 Тогда			
//			ЗаголовокЭлемента = Лев(Стр.Заголовок, 22) + "...";
//		Иначе
//			ЗаголовокЭлемента = Стр.Заголовок;
//		КонецЕсли; 
//		ЗаголовокЭлемента = " " + ЗаголовокЭлемента;
//		Если ФормаПараметры.ВариантИнтерфейса = ВариантИнтерфейсаКлиентскогоПриложения.Такси 
//			И Не ФормаПараметры.ЭтоМобильныйКлиент Тогда
//			ДлинаЭлемента = Окр(СтрДлина(ЗаголовокЭлемента)*0.8 + 4);
//		Иначе
//			ДлинаЭлемента = Окр(СтрДлина(ЗаголовокЭлемента)*0.85 + 4);
//		КонецЕсли; 
//			
//		ЭлементыЗаголовка = Новый Массив;
//		ЭлементыЗаголовка.Добавить(Новый ФорматированнаяСтрока(ЗаголовокЭлемента));
//		ЭлементыЗаголовка.Добавить(Новый ФорматированнаяСтрока(БиблиотекаКартинок.ОчиститьДанные,,,, Стр.ИмяКнопки));
//		
//		ИмяКолонки = СтрЗаменить(Стр.ИмяКнопки, " ", "");
//		ЭлементОтметка = Элементы.Добавить(ИмяКолонки, Тип("ДекорацияФормы"), ГруппаСтрока);

//		ЭлементОтметка.Вид = ВидДекорацииФормы.Надпись;
//		ЭлементОтметка.Заголовок = Новый ФорматированнаяСтрока(ЭлементыЗаголовка);
//		Если Не Стр.Заголовок=ЗаголовокЭлемента Тогда
//			ЭлементОтметка.Подсказка = Стр.Заголовок;
//		КонецЕсли; 
//		ЭлементОтметка.ГоризонтальноеПоложение		= ГоризонтальноеПоложениеЭлемента.Лево;
//		ЭлементОтметка.ЦветФона						= ?(Стр.ПризнакИсключения, ЦветаСтиля.УдаленныйРеквизитФон, ЦветаСтиля.ЦветФонаПодсказки);
//		ЭлементОтметка.Ширина						= 20;
//		ЭлементОтметка.Высота						= 1;
//		ЭлементОтметка.РастягиватьПоГоризонтали		= Ложь;
//		ЭлементОтметка.ВертикальноеПоложение		= ВертикальноеПоложениеЭлемента.Центр;
//		ЭлементОтметка.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
//		
//		ЭлементОтметка.УстановитьДействие("ОбработкаНавигационнойСсылки", "Подключаемый_УдалитьФильтрНажатие");
//		
//		ТекущаяДлинаСтрокиОтметок = ТекущаяДлинаСтрокиОтметок+ДлинаЭлемента;
//		
//	КонецЦикла;
//	
//	Если Элементы.СтрокиОтметокФильтров.ПодчиненныеЭлементы.Количество()>50 Тогда
//		Элементы.ОтчетТабличныйДокумент.РастягиватьПоВертикали = Ложь;
//	ИначеЕсли Не Элементы.ОтчетТабличныйДокумент.РастягиватьПоВертикали Тогда
//		Элементы.ОтчетТабличныйДокумент.РастягиватьПоВертикали = Истина;
//	КонецЕсли;
//	
// КонецПроцедуры

//&НаСервере
// Процедура УдалитьПодчиненныеЭлементы()
//	
//	Для Каждого Стр Из НаложенныеФильтры Цикл
//		
//		ИмяГруппы = ПолучитьИмяГруппы(Стр.Поле);
//		
//		Если ИмяГруппы = Неопределено Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		ГруппаСтрока = Элементы[ИмяГруппы];
//		
//		МассивКУдалению = Новый Массив;
//		Для Каждого Элемент Из ГруппаСтрока.ПодчиненныеЭлементы Цикл
//			МассивКУдалению.Добавить(Элемент);
//		КонецЦикла; 
//		
//		Для Каждого Элемент Из МассивКУдалению Цикл
//			Элементы.Удалить(Элемент);
//		КонецЦикла;
//		
//	КонецЦикла;

// КонецПроцедуры

//&НаСервере
// Функция ПолучитьИмяГруппы(Поле)
//	
//	СтруктураОтбора = Новый Структура;
//	СтруктураОтбора.Вставить("Поле"       , Поле);
//	СтруктураОтбора.Вставить("ВидЭлемента", "Поле");
//	Идентификаторы = ИдентификаторыСтрок(ПоляНастроек, СтруктураОтбора, Истина);
//	Для Каждого Идентификатор Из Идентификаторы Цикл
//		Стр = ПоляНастроек.НайтиПоИдентификатору(Идентификатор);
//		Если Стр = Неопределено Тогда
//			Возврат Неопределено;
//		КонецЕсли;
//		Возврат Стр.ИмяГруппыОтметкиФильтров;
//	КонецЦикла;
//	
// КонецФункции

#КонецОбласти 

#Область СтрокаПоиска

&НаКлиенте
Функция СформироватьСписокЭлементов(Текст, УправляющиеСимволы)
	
	Если СтрДлина(Текст)>=3 
		И (ПустаяСтрока(УправляющиеСимволы) 
		ИЛИ УправляющиеСимволы="-" 
		ИЛИ УправляющиеСимволы="""") Тогда
		МассивТипов = Новый Массив;
		Если НастройкиОтчета.ПоляПоиска.Количество()=0 Тогда
			// Выполняем поиск по полям, присутсвующим в списке фильтров
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Тип", ТипФильтр());
			Строки = СтрокиДерева(ПоляНастроек, СтруктураОтбора);
			Для Каждого Стр Из Строки Цикл
				Поле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(Стр.Поле));
				Если Поле=Неопределено Тогда
					Продолжить;
				КонецЕсли; 
				Для Каждого Тип Из Поле.ТипЗначения.Типы() Цикл
					Если МассивТипов.Найти(Тип)=Неопределено Тогда
						МассивТипов.Добавить(Тип);
					КонецЕсли; 
				КонецЦикла; 
			КонецЦикла; 
		Иначе
			// Разработчиком отчета задан список полей для поиска данных\
			Для Каждого ИмяПоля Из НастройкиОтчета.ПоляПоиска Цикл
				ПолеОтбора = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(ИмяПоля));
				Если ПолеОтбора=Неопределено Тогда
					Продолжить;
				КонецЕсли; 
				Для Каждого Тип Из ПолеОтбора.ТипЗначения.Типы() Цикл
					Если МассивТипов.Найти(Тип)=Неопределено Тогда
						МассивТипов.Добавить(Тип);
					КонецЕсли; 
				КонецЦикла; 
			КонецЦикла; 
		КонецЕсли; 
		Результат = СформироватьСписокЭлементовСервер(Текст, МассивТипов, УправляющиеСимволы);
	Иначе
		Результат = Новый СписокЗначений;
	КонецЕсли; 
	
	Если Не УправляющиеСимволы="""" И ЭтоЧисло(Текст) Тогда
		Число = Число(СтрЗаменить(СтрЗаменить(СтрЗаменить(Текст, " ", ""), Символы.НПП, ""), ",", "."));
		// Обработка числовых полей в фильтрах
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Тип", ТипФильтр());
		Строки = СтрокиДерева(ПоляНастроек, СтруктураОтбора, Истина);
		Для Каждого СтрФильтр Из Строки Цикл
			Если Не СтрФильтр.ТипЗначения.СодержитТип(Тип("Число")) Тогда
				Продолжить;
			КонецЕсли;
			ДобавитьЭлементВыбораВСписок(Результат, СтрФильтр, Число, УправляющиеСимволы); 
		КонецЦикла; 
		// Добавление активных показателей
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Тип", ТипПоказатель());
		Строки = СтрокиДерева(ПоляНастроек, СтруктураОтбора, Истина);
		Для Каждого СтрПоказатель Из Строки Цикл
			Если Не СтрПоказатель.Создан Тогда
				Продолжить;
			КонецЕсли; 
			Для Каждого Реквизит Из СтрПоказатель.Реквизиты Цикл
				Если Не ЭтаФорма[Реквизит.Ключ] Тогда
					Продолжить;
				КонецЕсли; 
				ДобавитьЭлементВыбораВСписок(Результат, СтрПоказатель, Число, УправляющиеСимволы); 
			КонецЦикла; 
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьЭлементВыбораВСписок(Список, СтрПоля, Значение, УправляющиеСимволы)
	
	Для Каждого Элемент Из Список Цикл
		Если Не Элемент.Значение.Свойство("Поле") Тогда
			// Нечисловое поле
			Продолжить;
		КонецЕсли; 
		Если Элемент.Значение.Поле=СтрПоля.Поле Тогда
			// Поле уже добавлено в список выбора 
			Возврат;
		КонецЕсли; 
	КонецЦикла; 
	СтуктураЗначения = Новый Структура;
	СтуктураЗначения.Вставить("Поле", СтрПоля.Поле);
	СтуктураЗначения.Вставить("ВведенноеЗначение", Значение);
	СтуктураЗначения.Вставить("УправляющиеСимволы", УправляющиеСимволы);
	ЗаголовокПоля = СтрПоля.Заголовок;
	СтрРодитель = СтрПоля.ПолучитьРодителя();
	Если Не СтрРодитель=Неопределено И НЕ ПустаяСтрока(СтрРодитель.Заголовок) Тогда
		ЗаголовокПоля = ЗаголовокПоля+" ("+СтрРодитель.Заголовок+")";
	КонецЕсли; 
	Если ПустаяСтрока(ЗаголовокПоля) Тогда
		Поле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных(СтрПоля.Поле));
		Если Не Поле=Неопределено Тогда
			ЗаголовокПоля = Поле.Заголовок;
		КонецЕсли; 
	КонецЕсли;
	Если ПустаяСтрока(ЗаголовокПоля) Тогда
		ЗаголовокПоля = СтрПоля.Поле;
	КонецЕсли;
	Если Не ПустаяСтрока(УправляющиеСимволы) Тогда
		Список.Добавить(СтуктураЗначения, ЗаголовокПоля+" "+УправляющиеСимволы+" "+Строка(Значение));
	Иначе
		СтуктураЗначения.Вставить("УправляющиеСимволы", "=");
		Список.Добавить(СтуктураЗначения, ЗаголовокПоля+" = "+Строка(Значение));
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьСписокЭлементовСервер(Текст, МассивТипов, УправляющиеСимволы)
	
	Результат = Новый СписокЗначений;
	Если МассивТипов.Количество()=0 Тогда
		Возврат Результат;
	КонецЕсли; 
	
	ТекстЗапроса = "";
	Для Каждого Тип Из МассивТипов Цикл
		Если Не ОбщегоНазначения.ЭтоСсылка(Тип) Тогда
			Продолжить;
		КонецЕсли;
		ПустаяСсылка = Новый(Тип);
		ОбъектМетаданных = ПустаяСсылка.Метаданные();
		Если Не ОбщегоНазначения.ЭтоПеречисление(ОбъектМетаданных) Тогда
			Если Не ПустаяСтрока(ТекстЗапроса) Тогда
				ТекстЗапроса = ТекстЗапроса+Символы.ПС+"ОБЪЕДИНИТЬ ВСЕ"+Символы.ПС;
				ПараметрРазрешенные = "";
			Иначе
				ПараметрРазрешенные = "РАЗРЕШЕННЫЕ ";
			КонецЕсли;
			ТекстУсловия = "";
			ТекстПрочиеПоля = "";
			Для Каждого Поле Из ОбъектМетаданных.ВводПоСтроке Цикл
				ТекстУсловия = ТекстУсловия+
				?(ПустаяСтрока(ТекстУсловия), "", Символы.ПС+Символы.Таб+"ИЛИ ")+
				"Объект."+Поле.Имя+" ПОДОБНО ""%""+&Текст+""%""";
				Если Поле.Имя="Наименование" ИЛИ Поле.Имя="Номер" Тогда
					Продолжить;
				КонецЕсли;
				ТекстПрочиеПоля = ТекстПрочиеПоля+?(ПустаяСтрока(ТекстПрочиеПоля), """", "+"", ")+Поле.Имя+": ""+Объект."+Поле.Имя;
			КонецЦикла;
			Если ПустаяСтрока(ТекстУсловия) Тогда
				Продолжить;
			КонецЕсли; 
			ТекстЗапроса = ТекстЗапроса+
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"ВЫБРАТЬ %4ПЕРВЫЕ 5
			|	""%1"" КАК Тип,
			|	Объект.Ссылка,
			|	Объект.Представление,
			|   %3 КАК ПрочиеПоля
			|ИЗ
			|	%1 КАК Объект
			|ГДЕ
			|	%2
			|
			|СГРУППИРОВАТЬ ПО
			|	Объект.Ссылка,
			|	Объект.Представление
			|
			|ИМЕЮЩИЕ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Объект.Ссылка) < 5",
			ОбъектМетаданных.ПолноеИмя(),
			ТекстУсловия,
			?(ПустаяСтрока(ТекстПрочиеПоля), """""", ТекстПрочиеПоля),
			ПараметрРазрешенные);
			
		КонецЕсли; 
	КонецЦикла;
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		Возврат Результат;
	КонецЕсли; 
	ТекстЗапроса = ТекстЗапроса+Символы.ПС+"ИТОГИ ПО Тип";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Текст", Текст);
	ВыборкаТип = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТип.Следующий() Цикл
		Выборка = ВыборкаТип.Выбрать();	
		Пока Выборка.Следующий() Цикл
			Если УправляющиеСимволы="""" Тогда
				Продолжить;
			КонецЕсли; 
			Элемент = Новый Структура;
			Элемент.Вставить("ВведенноеЗначение", Выборка.Ссылка);
			Элемент.Вставить("УправляющиеСимволы", УправляющиеСимволы);
			Результат.Добавить(Элемент, СформироватьПредставлениеЭлементаСписка(Выборка, Текст));	
		КонецЦикла;
		Если Выборка.Количество()>1 ИЛИ (УправляющиеСимволы="""" И Выборка.Количество()>0) Тогда
			Реквизиты = "";
			ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ВыборкаТип.Тип);
			Для Каждого Поле Из ОбъектМетаданных.ВводПоСтроке Цикл
				Реквизиты = Реквизиты+?(ПустаяСтрока(Реквизиты), "", ",")+Поле.Имя;
			КонецЦикла;
			Элемент = Новый Структура;
			Элемент.Вставить("ИмяМетаданных", ВыборкаТип.Тип);
			Элемент.Вставить("Реквизиты", Реквизиты);
			Элемент.Вставить("ВведенноеЗначение", Текст);
			Элемент.Вставить("УправляющиеСимволы", УправляющиеСимволы);
			ПредставлениеТипа = Метаданные.НайтиПоПолномуИмени(ВыборкаТип.Тип).Представление();
			Представление = ПредставлениеТипа+НСтр("ru = ' содержит '")+Текст;
			Результат.Добавить(Элемент, Новый ФорматированнаяСтрока(Представление, 
			?(УправляющиеСимволы="""", Новый Шрифт, Новый Шрифт(Новый Шрифт,,, Истина))));
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьПредставлениеЭлементаСписка(Выборка, Текст)
	
	Представление = Выборка.Представление+?(ПустаяСтрока(Выборка.ПрочиеПоля), "", " ("+Выборка.ПрочиеПоля+")");
	Позиция = Найти(НРег(Представление), НРег(Текст));
	Если Позиция>0 Тогда
		ТекстДо = Лев(Представление, Позиция-1);
		ТекстЦентр = Сред(Представление, Позиция, СтрДлина(Текст));
		ТекстПосле = Сред(Представление, Позиция+СтрДлина(Текст));
		ВыделенныйТекст = Новый ФорматированнаяСтрока(ТекстЦентр, Новый Шрифт(Новый Шрифт,,, Истина), WebЦвета.ЗеленыйЛес);
		РезультатФункции = Новый ФорматированнаяСтрока(ТекстДо, ВыделенныйТекст, ТекстПосле);
	Иначе
		РезультатФункции = Представление;
	КонецЕсли; 
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция ПоляПоТипу(Тип)
	
	МассивПолей = ОсновныеПоляПоиска();
	РезультатФункции = Новый Массив;
	ДополнительныеПоля = Новый Массив;
	Если НастройкиОтчета.ПоляПоиска.Количество()=0 Тогда
		Если КешТиповПолей.Количество()=0 Тогда
			ОбновитьКешТиповПолей();
		КонецЕсли;
		Для Каждого Элемент Из КешТиповПолей Цикл
			Если Элемент.Значение.СодержитТип(Тип) Тогда
				Если Найти(Элемент.Представление, ".")>0 И МассивПолей.Найти(Элемент.Представление)=Неопределено Тогда
					ДополнительныеПоля.Добавить(Элемент.Представление);
				Иначе
					РезультатФункции.Добавить(Элемент.Представление);
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла;
	Иначе
		Для Каждого ИмяПоля Из НастройкиОтчета.ПоляПоиска Цикл
			ПолеОтбора = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(ИмяПоля));
			Если ПолеОтбора=Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			Если ПолеОтбора.ТипЗначения.СодержитТип(Тип) Тогда
				Если Найти(ИмяПоля, ".")>0 И МассивПолей.Найти(ИмяПоля)=Неопределено Тогда
					ДополнительныеПоля.Добавить(ИмяПоля);
				Иначе
					РезультатФункции.Добавить(ИмяПоля);
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	Если РезультатФункции.Количество()=0 Тогда
		Для Каждого Поле Из ДополнительныеПоля Цикл
			РезультатФункции.Добавить(Поле);
		КонецЦикла; 
	КонецЕсли; 
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Функция ОсновныеПоляПоиска()
	
	МассивПолей = Новый Массив;
	ПоляГруппировокРекурсивно(МассивПолей, Отчет.КомпоновщикНастроек.Настройки.Структура);
	ПоляФильтровРекурсивно(МассивПолей, Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы);
	Возврат МассивПолей;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПоляГруппировокРекурсивно(МассивПолей, ЭлементыСтруктуры, БезКолонок = Ложь)
	
	Для Каждого Элемент Из ЭлементыСтруктуры Цикл
		Если ТипЗнч(Элемент)=Тип("ТаблицаКомпоновкиДанных") Тогда
			ПоляГруппировокРекурсивно(МассивПолей, Элемент.Строки, БезКолонок);
			Если Не БезКолонок Тогда
				ПоляГруппировокРекурсивно(МассивПолей, Элемент.Колонки, БезКолонок);
			КонецЕсли; 
		ИначеЕсли ТипЗнч(Элемент)=Тип("ГруппировкаКомпоновкиДанных") ИЛИ ТипЗнч(Элемент)=Тип("ГруппировкаТаблицыКомпоновкиДанных") Тогда
			Для Каждого Поле Из Элемент.ПоляГруппировки.Элементы Цикл
				МассивПолей.Добавить(Строка(Поле.Поле));
			КонецЦикла; 
			ПоляГруппировокРекурсивно(МассивПолей, Элемент.Структура, БезКолонок);
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоляФильтровРекурсивно(МассивПолей, ЭлементыОтбора)
	
	Для Каждого Элемент Из ЭлементыОтбора Цикл
		Если ТипЗнч(Элемент)=Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ПоляФильтровРекурсивно(МассивПолей, Элемент.Элементы);
		ИначеЕсли ТипЗнч(Элемент)=Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			МассивПолей.Добавить(Строка(Элемент.ЛевоеЗначение));
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКешТиповПолей()
	
	КешТиповПолей.Очистить();
	// Первый уровень
	Для Каждого Поле Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.Элементы Цикл
		КешТиповПолей.Добавить(Поле.ТипЗначения, Строка(Поле.Поле));
	КонецЦикла;
	// Второй уровень
	Для Каждого Поле Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.Элементы Цикл
		Для Каждого ПодПоле Из Поле.Элементы Цикл
			Если ПодПоле.Папка Тогда
				Если Прав(Строка(ПодПоле.Поле), 5)=".Теги" Тогда
					Продолжить;
				КонецЕсли; 
				Для Каждого ПолеТЧ Из ПодПоле.Элементы Цикл
					КешТиповПолей.Добавить(ПолеТЧ.ТипЗначения, Строка(ПолеТЧ.Поле));
				КонецЦикла; 
			Иначе
				КешТиповПолей.Добавить(ПодПоле.ТипЗначения, Строка(ПодПоле.Поле));
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#Область ИзменениеВарианта

&НаКлиенте
Процедура РедактироватьСКД()
	
	Если Не НастройкиОтчета.РазрешитьРедактироватьСКД Тогда
		Состояние(НСтр("ru = 'Редактирование настроек данного отчета запрещено'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура(ФормаПараметры);
	ПараметрыФормы.Вставить("Вариант",                               Отчет.КомпоновщикНастроек.Настройки);
	ПараметрыФормы.Вставить("КлючВарианта",                          Строка(КлючТекущегоВарианта));
	ПараметрыФормы.Вставить("ПользовательскиеНастройки",             Новый ПользовательскиеНастройкиКомпоновкиДанных);
	ПараметрыФормы.Вставить("ПредставлениеВарианта",                 Строка(ОтчетНаименованиеТекущегоВарианта));
	ПараметрыФормы.Вставить("ПредставлениеПользовательскихНастроек", "");
	ПараметрыФормы.Вставить("АдресСхемы",                            НастройкиОтчета.АдресСхемы);
	
	ОткрытьФорму(НастройкиОтчета.ПолноеИмя + ".ФормаВарианта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти 

#Область НестандартныеОбработчики

&НаСервере
Процедура ВыполнитьНестандартнуюОбработку(ИдентификаторСтроки, ИмяЭлемента, Значение = Неопределено)
	
	Если Не НастройкиОтчета.ПрограммноеИзменениеФормыОтчета Тогда
		Возврат;
	КонецЕсли;
	Стр = ПоляНастроек.НайтиПоИдентификатору(ИдентификаторСтроки);
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	СтруктураЗначений = Новый Структура;
	Для Каждого Реквизит Из Стр.Реквизиты Цикл
		Если ЗначениеЗаполнено(Значение) Тогда
			СтруктураЗначений.Вставить(Реквизит.Ключ, Значение);
		Иначе
			СтруктураЗначений.Вставить(Реквизит.Ключ, ЭтаФорма[Реквизит.Ключ]);
		КонецЕсли; 
	КонецЦикла; 
	ОтчетОбъект.ПриИзмененииНестандартногоРеквизита(Стр.Тип, Стр.Поле, СтруктураЗначений, Отчет.КомпоновщикНастроек.Настройки, ЭтаФорма, ИмяЭлемента);
	
КонецПроцедуры

#КонецОбласти

#Область ДобавленныеПоля

&НаСервере
Процедура НаложитьОтборПоДобавленномуПолю(Поле, Значение, УправляющиеСимволы = "")
	
	// Тег
	Если Поле="ДобавленноеПоле_Тег" Тогда
		ПолеКонтрагент = ДоступноеПолеКонтрагент(Отчет.КомпоновщикНастроек.Настройки);
		Если ПолеКонтрагент=Неопределено Тогда
			Возврат;
		КонецЕсли;
		НовыйВидСравнения = ?(УправляющиеСимволы="-", ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии, ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии);
		Суффикс = ?(УправляющиеСимволы="-", "Не", "");
		НайденныйЭлемент = Неопределено;
		Для Каждого ЭлементОтбора Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если ЭлементОтбора.ПредставлениеПользовательскойНастройки=Поле+Суффикс Тогда
				НайденныйЭлемент = ЭлементОтбора;
				Прервать;
			КонецЕсли; 
		КонецЦикла;
		Если НайденныйЭлемент=Неопределено Тогда
			НайденныйЭлемент = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НайденныйЭлемент.Использование = Истина;
			НайденныйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Строка(ПолеКонтрагент.Поле)+".Теги.Тег");
			НайденныйЭлемент.ВидСравнения = НовыйВидСравнения;
			НайденныйЭлемент.ПравоеЗначение = Новый СписокЗначений;
			НайденныйЭлемент.ПредставлениеПользовательскойНастройки = Поле+Суффикс;
		КонецЕсли;
		Если ТипЗнч(НайденныйЭлемент.ПравоеЗначение)<>Тип("СписокЗначений") Тогда
			НайденныйЭлемент.ПравоеЗначение = Новый СписокЗначений;
		КонецЕсли;
		Если ЗначениеЗаполнено(Значение) И НайденныйЭлемент.ПравоеЗначение.НайтиПоЗначению(Значение)=Неопределено Тогда
			НайденныйЭлемент.ПравоеЗначение.Добавить(Значение);
		КонецЕсли; 
		НайденныйЭлемент.Использование = НайденныйЭлемент.ПравоеЗначение.Количество()>0;
		ОбновитьОтображениеОтметокФильтров();
		// Сегмент
		// ИначеЕсли Поле="ДобавленноеПоле_Сегмент" Тогда
		// 	ПолеКонтрагент = ДоступноеПолеКонтрагент(Отчет.КомпоновщикНастроек.Настройки);
		// 	Если ПолеКонтрагент=Неопределено Тогда
		// 		Возврат;
		// 	КонецЕсли; 
		// 	МассивСегментов = Справочники.Сегменты.ПолучитьСоставСегмента(Значение);
		// 	СписокКонтрагентов = Новый СписокЗначений;
		// 	СписокКонтрагентов.ЗагрузитьЗначения(МассивСегментов);
		// 	ГруппаОтборов = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		// 	ГруппаОтборов.Использование = Истина;
		// 	ГруппаОтборов.Представление = Строка(Значение);
		// 	ГруппаОтборов.ПредставлениеПользовательскойНастройки = "ДобавленноеПоле_"+СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
		// 	ГруппаОтборов.ТипГруппы = ?(УправляющиеСимволы="-", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		// 	ЭлементОтбора = ГруппаОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		// 	ЭлементОтбора.Использование = Истина;
		// 	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Строка(ПолеКонтрагент.Поле));
		// 	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		// 	ЭлементОтбора.ПравоеЗначение = СписокКонтрагентов;
		// 	ОбновитьОтображениеОтметокФильтров();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДоступноеПолеКонтрагент(Настройки)
	
	Поле = Настройки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Клиент"));
	Если Поле=Неопределено Тогда
		Поле = Настройки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Покупатель"));
	КонецЕсли;
	Если Поле=Неопределено Тогда
		Поле = Настройки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Поставщик"));
	КонецЕсли;
	Возврат Поле;
	
КонецФункции

#КонецОбласти 

#Область СуммаЯчеек

// Вычисляет сумму выделенных ячеек и возвращает ее представление.
// 
// Параметры:
//   ТабличныйДокумент - ТабличныйДокумент - Таблица, для которой вычисляет сумма ячеек.
//   ВыделенныеОбласти
//       - Неопределено - При вызове с клиента этот параметр будет определен автоматически.
//       - Массив - При вызове с сервера в этот параметр следует передавать области,
//           предварительно вычисленные на клиенте
//           при помощи функции ОтчетыКлиент.ВыделенныеОбласти(ТабличныйДокумент).
// 
// Возвращаемое значение: 
//   Строка - Представление суммы выделенных ячеек.
// 
// См. также:
//   ОтчетыКлиент.ВыделенныеОбласти().
// 
&НаКлиентеНаСервереБезКонтекста
Функция СуммаЯчеек(ТабличныйДокумент, ВыделенныеОбласти)
	
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число");
	
	Если ВыделенныеОбласти = Неопределено Тогда
		#Если Клиент Тогда
			ВыделенныеОбласти = ТабличныйДокумент.ВыделенныеОбласти;
		#Иначе
			Возврат НСтр("ru = 'Не указано значение параметра ""ВыделенныеОбласти"".'");
		#КонецЕсли
	КонецЕсли;
	
	#Если Клиент И Не ТолстыйКлиентОбычноеПриложение Тогда
		КоличествоВыделенныхОбластей = ВыделенныеОбласти.Количество();
		Если КоличествоВыделенныхОбластей = 0 Тогда
			Возврат ""; // Нет ни одного числа.
		ИначеЕсли КоличествоВыделенныхОбластей >= 100 Тогда
			Возврат "<"; // Нужен вызов сервера.
		КонецЕсли;
		КоличествоВыделенныхЯчеек = 0;
	#КонецЕсли
	
	Сумма = Неопределено;
	ПроверенныеЯчейки = Новый Соответствие;
	
	Для Каждого ВыделеннаяОбласть Из ВыделенныеОбласти Цикл
		#Если Клиент Тогда
			Если ТипЗнч(ВыделеннаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
				Продолжить;
			КонецЕсли;
		#КонецЕсли
		
		ВыделеннаяОбластьВерх = ВыделеннаяОбласть.Верх;
		ВыделеннаяОбластьНиз = ВыделеннаяОбласть.Низ;
		ВыделеннаяОбластьЛево = ВыделеннаяОбласть.Лево;
		ВыделеннаяОбластьПраво = ВыделеннаяОбласть.Право;
		
		Если ВыделеннаяОбластьВерх = 0 Тогда
			ВыделеннаяОбластьВерх = 1;
		КонецЕсли;
		
		Если ВыделеннаяОбластьНиз = 0 Тогда
			ВыделеннаяОбластьНиз = ТабличныйДокумент.ВысотаТаблицы;
		КонецЕсли;
		
		Если ВыделеннаяОбластьЛево = 0 Тогда
			ВыделеннаяОбластьЛево = 1;
		КонецЕсли;
		
		Если ВыделеннаяОбластьПраво = 0 Тогда
			ВыделеннаяОбластьПраво = ТабличныйДокумент.ШиринаТаблицы;
		КонецЕсли;
		
		Если ВыделеннаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Колонки Тогда
			ВыделеннаяОбластьВерх = ВыделеннаяОбласть.Низ;
			ВыделеннаяОбластьНиз = ТабличныйДокумент.ВысотаТаблицы;
		КонецЕсли;
		
		ВыделеннаяОбластьВысота = ВыделеннаяОбластьНиз   - ВыделеннаяОбластьВерх;
		ВыделеннаяОбластьШирина = ВыделеннаяОбластьПраво - ВыделеннаяОбластьЛево;
		
		#Если Клиент И Не ТолстыйКлиентОбычноеПриложение Тогда
			КоличествоВыделенныхЯчеек = КоличествоВыделенныхЯчеек + ВыделеннаяОбластьШирина * ВыделеннаяОбластьВысота;
			Если КоличествоВыделенныхЯчеек >= 1000 Тогда
				Возврат "<"; // Нужен вызов сервера.
			КонецЕсли;
		#КонецЕсли
		
		Для НомерКолонки = ВыделеннаяОбластьЛево По ВыделеннаяОбластьПраво Цикл
			Для НомерСтроки = ВыделеннаяОбластьВерх По ВыделеннаяОбластьНиз Цикл
				Ячейка = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
				Если ПроверенныеЯчейки.Получить(Ячейка.Имя) = Неопределено Тогда
					ПроверенныеЯчейки.Вставить(Ячейка.Имя, Истина);
				Иначе
					Продолжить;
				КонецЕсли;
				
				Если Ячейка.Видимость = Истина Тогда
					Если Ячейка.ТипОбласти <> ТипОбластиЯчеекТабличногоДокумента.Колонки
						И Ячейка.СодержитЗначение И ТипЗнч(Ячейка.Значение) = Тип("Число") Тогда
						Число = Ячейка.Значение;
					ИначеЕсли ЗначениеЗаполнено(Ячейка.Текст) Тогда
						Число = ОписаниеТиповЧисло.ПривестиЗначение(Ячейка.Текст);
					Иначе
						Продолжить;
					КонецЕсли;
					Если ТипЗнч(Число) = Тип("Число") Тогда
						Если Сумма = Неопределено Тогда
							Сумма = Число;
						Иначе
							Сумма = Сумма + Число;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если Сумма = Неопределено Тогда
		Возврат ""; // Нет ни одного числа.
	КонецЕсли;
	
	Возврат Формат(Сумма, "ЧН=0");
	
КонецФункции

&НаКлиенте
Процедура РассчитатьСуммуЯчеек()
	
	Если КоличествоВыделенныхЯчеек()>1 Тогда
		СуммаВыделенныхЯчеек = СуммаЯчеек(ОтчетТабличныйДокумент, Неопределено);
		Если СуммаВыделенныхЯчеек="<" Тогда
			СуммаВыделенныхЯчеек = РассчитатьСуммуЯчеекСервер(ОтчетТабличныйДокумент, ВыделенныеОбласти());
		КонецЕсли; 
		Если ПустаяСтрока(СуммаВыделенныхЯчеек) Тогда
			Элементы.СтрокаОтбора.ПодсказкаВвода = "";
		Иначе
			Элементы.СтрокаОтбора.ПодсказкаВвода = "Σ "+СуммаВыделенныхЯчеек;
		КонецЕсли; 
	Иначе
		Элементы.СтрокаОтбора.ПодсказкаВвода = "";
	КонецЕсли;
	
	Если ПустаяСтрока(Элементы.СтрокаОтбора.ПодсказкаВвода) Тогда
		Элементы.СтрокаОтбора.ПодсказкаВвода = Элементы.СтрокаОтбора.Подсказка;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ВыделенныеОбласти()
	
	ВыделенныеОбласти = Новый Массив;
	Для Каждого Область Из ОтчетТабличныйДокумент.ВыделенныеОбласти Цикл
		Если Не ТипЗнч(Область)=Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Продолжить;
		КонецЕсли;
		СтруктураПоложения = Новый Структура;
		СтруктураПоложения.Вставить("Верх", Область.Верх);
		СтруктураПоложения.Вставить("Низ", Область.Низ);
		СтруктураПоложения.Вставить("Лево", Область.Лево);
		СтруктураПоложения.Вставить("Право", Область.Право);
		СтруктураПоложения.Вставить("ТипОбласти", Область.ТипОбласти);
		ВыделенныеОбласти.Добавить(СтруктураПоложения);
	КонецЦикла;
	Возврат ВыделенныеОбласти;
	
КонецФункции

&НаСервереБезКонтекста
Функция РассчитатьСуммуЯчеекСервер(Знач ТабличныйДокумент, ВыделенныеОбласти)
	
	Возврат СуммаЯчеек(ТабличныйДокумент, ВыделенныеОбласти);
	
КонецФункции 

&НаКлиенте
Функция КоличествоВыделенныхЯчеек()
	
	Результат = 0;
	Для Каждого Область Из ОтчетТабличныйДокумент.ВыделенныеОбласти Цикл
		Если Не ТипЗнч(Область)=Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Продолжить;
		КонецЕсли; 
		Результат = Результат+(Область.Право-Область.Лево+1)*(Область.Низ-Область.Верх+1);
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#Область ОбщиеПроцедуры

&НаСервере
Функция ДобавитьОписаниеНастройки(ЭлементыДобавления, Тип, ИмяПоля, Представление = "", ЭлементСхемы = Неопределено)
	
	СуществующаяСтрока = СтрокаОписанияПоля(Тип, ИмяПоля, ПоляНастроек);
	Если Не СуществующаяСтрока=Неопределено Тогда
		Если СуществующаяСтрока.Создан Тогда
			Возврат Неопределено;
		КонецЕсли;
		СуществующаяСтрока.Скрыт = Ложь;
		Возврат СуществующаяСтрока;
	КонецЕсли;
	Если Тип=ТипФильтр() Тогда
		ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(ИмяПоля));
	ИначеЕсли Тип=ТипПараметр() Тогда
		ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.ДоступныеПараметры.НайтиПараметр(Новый ПараметрКомпоновкиДанных(ИмяПоля));
	ИначеЕсли Тип=ТипГруппировка() Тогда
		ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных(ИмяПоля));
	Иначе
		ДоступноеПоле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных(ИмяПоля));
	КонецЕсли; 
	Стр = ЭлементыДобавления.Добавить();
	Стр.Тип = Тип;
	Стр.Поле = ИмяПоля;
	Если Тип=ТипПараметр() ИЛИ Тип=ТипФильтр() Тогда
		Если ДоступноеПоле=Неопределено Тогда
			ЭлементыДобавления.Удалить(Стр);
			Возврат Неопределено;
		КонецЕсли; 
		Стр.ТипЗначения = ДоступноеПоле.ТипЗначения;
	Иначе
		Стр.ТипЗначения = Новый ОписаниеТипов("Булево");
	КонецЕсли; 
	Если ПустаяСтрока(Представление) Тогда
		Если ДоступноеПоле=Неопределено Тогда
			ЭлементыДобавления.Удалить(Стр);
			Возврат Неопределено;
		КонецЕсли; 
		Стр.Заголовок = ДоступноеПоле.Заголовок;
	Иначе
		Стр.Заголовок = Представление;
	КонецЕсли;
	Стр.ДополнительныеПараметры = Новый Структура;
	Стр.Реквизиты = Новый Структура;
	Стр.Элементы = Новый Структура;
	Если Тип=ТипФильтр() Тогда
		Если ДоступноеПоле=Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли; 
		ОпределитьЭлементыИРеквизитыФильтра(Стр, ЭлементСхемы, ДоступноеПоле, Ложь);
	ИначеЕсли Тип=ТипПараметр() Тогда
		Если ДоступноеПоле=Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли; 
		Стр.ДополнительныеПараметры.Вставить("АвтоОтметкаНезаполненного", ДоступноеПоле.ЗапрещатьНезаполненныеЗначения);
		Стр.ДополнительныеПараметры.Вставить("ДоступенСписокЗначений"	, ДоступноеПоле.ДоступенСписокЗначений);		
		ОпределитьЭлементыИРеквизитыПараметра(Стр, ЭлементСхемы, ДоступноеПоле);
	Иначе
		Стр.ВидЭлемента = "Флажок";
	КонецЕсли;
	
	Возврат Стр;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбъединитьНастройки(Приемник, Источник, Заменять = Неопределено)
	
	Для Каждого Элемент Из Источник Цикл
		Если Приемник.Свойство(Элемент.Ключ) Тогда
			ЭлементПриемника = Приемник[Элемент.Ключ];
			Если ТипЗнч(Элемент.Значение)=ТипЗнч(ЭлементПриемника) Тогда
				Если ТипЗнч(Элемент.Значение)=Тип("Массив") Тогда  
					Для Каждого ЗначениеИсточник Из Элемент.Значение Цикл
						ЭлементПриемника.Добавить(ЗначениеИсточник);
					КонецЦикла;
					Продолжить;
				ИначеЕсли ТипЗнч(Элемент.Значение)=Тип("Структура") ИЛИ ТипЗнч(Элемент.Значение)=Тип("Соответствие") Тогда  
					Для Каждого ЗначениеИсточник Из Элемент.Значение Цикл
						ЭлементПриемника.Вставить(ЗначениеИсточник.Ключ, ЗначениеИсточник.Значение);
					КонецЦикла;
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			Если Заменять = Ложь Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Приемник.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылку(Отчет, КлючВарианта)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВариантыОтчетов.Ссылка КАК Ссылка,
	|	ВариантыОтчетов.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|ГДЕ
	|	ВариантыОтчетов.Отчет = &Отчет
	|	И ВариантыОтчетов.КлючВарианта = &КлючВарианта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВариантыДополнительныхОтчетов.Ссылка,
	|	ВариантыДополнительныхОтчетов.ПометкаУдаления
	|ИЗ
	|	Справочник.ВариантыДополнительныхОтчетов КАК ВариантыДополнительныхОтчетов
	|ГДЕ
	|	ВариантыДополнительныхОтчетов.Отчет = &Отчет
	|	И ВариантыДополнительныхОтчетов.ИдентификаторКоманды = &КлючВарианта
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПометкаУдаления");
	Запрос.УстановитьПараметр("Отчет", Отчет);
	Запрос.УстановитьПараметр("КлючВарианта", КлючВарианта);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

&НаСервере
Функция ИдентификаторыСтрок(Дерево, СтруктураОтбора, ВключаяВложенные = Ложь)
	
	Результат = Новый Массив;
	Для Каждого Стр Из Дерево.ПолучитьЭлементы() Цикл
		Совпадает = Истина;
		Для Каждого Отбор Из СтруктураОтбора Цикл
			Если ТипЗнч(Отбор.Значение)=Тип("Массив") Тогда
				ЕстьСовпадение = Ложь;
				Для Каждого Значение Из Отбор.Значение Цикл
					Если Стр[Отбор.Ключ]=Значение  Тогда
						ЕстьСовпадение = Истина;
						Прервать;
					КонецЕсли; 
				КонецЦикла;
				Если Не ЕстьСовпадение Тогда
					Совпадает = Ложь;
					Прервать;
				КонецЕсли; 
			Иначе
				Если Не Стр[Отбор.Ключ]=Отбор.Значение  Тогда
					Совпадает = Ложь;
					Прервать;
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
		Если Совпадает Тогда
			Результат.Добавить(Стр.ПолучитьИдентификатор());
		КонецЕсли;
		Если ВключаяВложенные Тогда
			ВложенныеЭлементы = ИдентификаторыСтрок(Стр, СтруктураОтбора, Истина);
			Для Каждого ПодСтр Из ВложенныеЭлементы Цикл
				Результат.Добавить(ПодСтр);
			КонецЦикла; 
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция СтрокиДерева(Дерево, СтруктураОтбора, ВключаяВложенные = Ложь)
	
	Результат = Новый Массив;
	Для Каждого Стр Из Дерево.ПолучитьЭлементы() Цикл
		Совпадает = Истина;
		Для Каждого Отбор Из СтруктураОтбора Цикл
			Если ТипЗнч(Отбор.Значение)=Тип("Массив") Тогда
				ЕстьСовпадение = Ложь;
				Для Каждого Значение Из Отбор.Значение Цикл
					Если Стр[Отбор.Ключ]=Значение  Тогда
						ЕстьСовпадение = Истина;
						Прервать;
					КонецЕсли; 
				КонецЦикла;
				Если Не ЕстьСовпадение Тогда
					Совпадает = Ложь;
					Прервать;
				КонецЕсли; 
			Иначе
				Если Не Стр[Отбор.Ключ]=Отбор.Значение  Тогда
					Совпадает = Ложь;
					Прервать;
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
		Если Совпадает Тогда
			Результат.Добавить(Стр);
		КонецЕсли;
		Если ВключаяВложенные Тогда
			ВложенныеЭлементы = СтрокиДерева(Стр, СтруктураОтбора, Истина);
			Для Каждого ПодСтр Из ВложенныеЭлементы Цикл
				Результат.Добавить(ПодСтр);
			КонецЦикла; 
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Функция СтрокаНаложенногоФильтра(ИмяКнопки)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ИмяКнопки", ИмяКнопки);
	Строки = НаложенныеФильтры.НайтиСтроки(СтруктураПоиска);
	Если Строки.Количество()=0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Строки[0];
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Функция СтрокаНаложенногоПараметра(ИмяКнопки)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ИмяКнопки", ИмяКнопки);
	Строки = НаложенныеПараметры.НайтиСтроки(СтруктураПоиска);
	Если Строки.Количество()=0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Строки[0];
	КонецЕсли; 
	
КонецФункции      

&НаКлиентеНаСервереБезКонтекста
Функция СтрокаОписанияПоИмениЭлемента(ИмяЭлемента, ПоляНастроек)
	
	Для Каждого Стр Из ПоляНастроек.ПолучитьЭлементы() Цикл
		Для Каждого Элемент Из Стр.Элементы Цикл
			Если Элемент.Ключ = ИмяЭлемента Тогда
				Возврат Стр;
			КонецЕсли; 
		КонецЦикла; 
		ПодСтр = СтрокаОписанияПоИмениЭлемента(ИмяЭлемента, Стр);
		Если Не ПодСтр=Неопределено Тогда
			Возврат ПодСтр;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Неопределено; 
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтрокаОписанияПоля(Тип, Поле, ПоляНастроек)
	
	Для Каждого Стр Из ПоляНастроек.ПолучитьЭлементы() Цикл
		Если Стр.Тип=Тип И Стр.Поле=Поле Тогда
			Возврат Стр;
		КонецЕсли; 
		ПодСтр = СтрокаОписанияПоля(Тип, Поле, Стр);
		Если Не ПодСтр=Неопределено Тогда
			Возврат ПодСтр;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Неопределено; 
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьПараметрыВыбора(ДоступноеПоле)
	
	Если ДоступноеПоле = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ДоступноеПоле.ПолучитьПараметрыВыбора();
	КонецЕсли; 
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьСвязиПараметровВыбора(ДоступноеПоле)
	
	Если ДоступноеПоле=Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ДоступноеПоле.ПолучитьСвязиПараметровВыбора();
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Функция ЭтоЧисло(Текст)
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат Ложь;
	КонецЕсли; 
	Если СтрЧислоВхождений(Текст, ".")+СтрЧислоВхождений(Текст, ",")>1 Тогда
		Возврат Ложь;
	КонецЕсли; 
	Для ии = 1 По СтрДлина(Текст) Цикл
		Символ = Сред(Текст, ии, 1);
		Если Найти(" 0123456789.,"+Символы.НПП, Символ)>0 Тогда
			Продолжить;
		КонецЕсли;
		Возврат Ложь;
	КонецЦикла;
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ОбновитьДополнительныйСвойстваСКД()
	
	ДополнительныеСвойства = Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	
	ИменаПолей =
	"ИспользоватьСравнение
	|ФиксироватьКолонки";
	
	Свойства = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаПолей, Символы.ПС);
	Для каждого Свойство Из Свойства Цикл
		Если НЕ НастройкиОтчета.Свойство(Свойство) Тогда
			Продолжить;
		КонецЕсли; 
		ДополнительныеСвойства.Вставить(Свойство, НастройкиОтчета[Свойство]);
	КонецЦикла;
	
	Если НастройкиОтчета.РежимПериода = ОтчетыКлиентСервер.РежимПериодаНаДату() Тогда
		ДополнительныеСвойства.Вставить("Период", Период.ДатаОкончания);
	ИначеЕсли НастройкиОтчета.РежимПериода = ОтчетыКлиентСервер.РежимПериодаЗаПериод() Тогда
		ДополнительныеСвойства.Вставить("НачалоПериода", Период.ДатаНачала);
		ДополнительныеСвойства.Вставить("КонецПериода", Период.ДатаОкончания);
	КонецЕсли;
	ДополнительныеСвойства.Вставить("НеДобавлятьПериод", Истина);
	
	ДополнительныеСвойства.Вставить("РежимРасшифровки", РежимРасшифровки);
	ДополнительныеСвойства.Вставить("ГруппировкаКолонок", ПолеГруппировкиКолонок);
	ДополнительныеСвойства.Вставить("Сравнение", ПолеСравнения);
	ДополнительныеСвойства.Вставить("ПоказыватьАбсолютноеИзменение", ПоказыватьАбсолютноеИзменение);
	ДополнительныеСвойства.Вставить("ПоказыватьОтносительноеИзменение", ПоказыватьОтносительноеИзменение);
	
	// Если ЗначениеЗаполнено(РазвернутьДо) И Элементы.РазвернутьДо.Видимость Тогда
	//	ДополнительныеСвойства.Вставить("РазвернутьДо", РазвернутьДо);
	// КонецЕсли; 
	
	Если ДополнительныеСвойства.Свойство("Адрес") Тогда
		ДополнительныеСвойства.Удалить("Адрес");
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВБулевоТриСостояния(Значение)
	
	Если Значение=Истина Тогда 
		Возврат ПредопределенноеЗначение("Перечисление.БулевоТриСостояния.Истина");
	ИначеЕсли Значение=Ложь Тогда 
		Возврат ПредопределенноеЗначение("Перечисление.БулевоТриСостояния.Ложь");
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.БулевоТриСостояния.НеИзменять");
	КонецЕсли;
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция НайтиВМассиве(Массив, Отбор)
	
	Результат = Новый Массив;
	Для Каждого Элемент Из Массив Цикл
		Пропустить = Ложь;
		Для Каждого ЭлементОтбора Из Отбор Цикл
			Если Не Элемент[ЭлементОтбора.Ключ]=ЭлементОтбора.Значение Тогда
				Пропустить = Истина;
				Прервать;
			КонецЕсли;  
		КонецЦикла;
		Если Пропустить Тогда
			Продолжить;
		КонецЕсли;
		Результат.Добавить(Элемент);
	КонецЦикла;
	Возврат Результат;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ОпределитьФормуВыбора(Значение, ВыборГруппИЭлементов)
	
	Тип = ТипЗнч(Значение);
	Если Не ОбщегоНазначения.ЭтоСсылка(Тип) Тогда
		Возврат "";
	КонецЕсли; 
	ПолноеИмяТипа = ОбщегоНазначения.ИмяТаблицыПоСсылке(Новый(Тип));
	Если ВыборГруппИЭлементов=ГруппыИЭлементы.Группы Тогда
		Возврат ПолноеИмяТипа+".ФормаВыбораГруппы";
	Иначе
		Возврат ПолноеИмяТипа+".ФормаВыбора";
	КонецЕсли; 
	
КонецФункции

&НаСервере
Функция АдресХранилищаРезультата()
	
	Возврат ПоместитьВоВременноеХранилище(ОтчетТабличныйДокумент, УникальныйИдентификатор);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НовоеИмяОтметкиФильтра()
	
	Возврат НовоеИмяРеквизита("ОтметкаФильтра");	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НовоеИмяРеквизита(Тип)
	
	Возврат Тип + СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");	
	
КонецФункции 

&НаСервере
Функция КоличествоПоказателейСКД(ВыборЭлементы = Неопределено)
	
	Если ВыборЭлементы=Неопределено Тогда
		ВыборЭлементы = Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы;
	КонецЕсли; 
	КоличествоПоказателей = 0;
	Для Каждого Элемент Из ВыборЭлементы Цикл
		Если ТипЗнч(Элемент)=Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			КоличествоВложенных = КоличествоПоказателейСКД(Элемент.Элементы);
			КоличествоПоказателей = КоличествоПоказателей+КоличествоВложенных;
		ИначеЕсли ТипЗнч(Элемент)=Тип("ВыбранноеПолеКомпоновкиДанных") И Элемент.Использование Тогда
			КоличествоПоказателей = КоличествоПоказателей+1;
		КонецЕсли; 
	КонецЦикла;   
	Возврат КоличествоПоказателей;
	
КонецФункции

&НаСервере
Функция ЕстьСоставныеГруппировкиКолонок(Структура)
	
	Для Каждого Элемент Из Структура Цикл
		Если ТипЗнч(Элемент)=Тип("ТаблицаКомпоновкиДанных") Тогда
			Результат = ЕстьСоставныеГруппировкиКолонок(Элемент.Колонки);
			Если Результат Тогда
				Возврат Истина;
			КонецЕсли; 
		ИначеЕсли ТипЗнч(Элемент)=Тип("ГруппировкаТаблицыКомпоновкиДанных") Тогда
			КоличествоПолей = 0;
			Для Каждого Поле Из Элемент.ПоляГруппировки.Элементы Цикл
				Если Поле.Использование Тогда
					КоличествоПолей = КоличествоПолей+1;
				КонецЕсли; 
			КонецЦикла; 
			Если КоличествоПолей>1 Тогда
				Возврат Истина;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	Возврат Ложь;
	
КонецФункции

#КонецОбласти


&НаКлиенте
// Процедура инициирует заполнение документа
// 
Процедура Обеспечить(ВидОбеспечения)
	
	СтруктураЗаполнения = ОбеспечитьНаСервере(ВидОбеспечения);
	ГруппировкаНоменклатура = Ложь;
	
	МассивСкладов		= Новый Массив;
	
	Если СтруктураЗаполнения.Запасы.Количество() > 0 
		И (СтруктураЗаполнения.Запасы[0].Свойство("Склад") или СтруктураЗаполнения.Запасы[0].Свойство("Поставщик")) Тогда
		
		Для Каждого ЭлементМассива Из СтруктураЗаполнения.Запасы Цикл
			
			Если СтруктураЗаполнения.Запасы[0].Свойство("Склад") 
				И МассивСкладов.Найти(ЭлементМассива.Склад) = Неопределено
				И ЗначениеЗаполнено(ЭлементМассива.Склад) 
				И (ТипЗнч(ЭлементМассива.Склад) = Тип("СправочникСсылка.Склады") ИЛИ ТипЗнч(ЭлементМассива.Склад) = Тип("СправочникСсылка.Сотрудники")) Тогда
				МассивСкладов.Добавить(ЭлементМассива.Склад);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ЭлементМассива Из СтруктураЗаполнения.ЗапасыСгруппированы Цикл 
		Если ЭлементМассива.Свойство("Номенклатура") Тогда 
			ГруппировкаНоменклатура = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Если ГруппировкаНоменклатура Тогда
		МассивЗапасовПоСкладу = ВернутьЗапасыПоСкладу(МассивСкладов, СтруктураЗаполнения.ЗапасыСгруппированы, ВидОбеспечения);
		ПоставщикЗаполнения = ПолучитьПоставщикаЗаполнения(МассивЗапасовПоСкладу);
		Если МассивСкладов.Количество() > 1 Тогда
			ЗаполнитьДокумент(МассивЗапасовПоСкладу, СтруктураЗаполнения.ВидЦен, СтруктураЗаполнения.СтруктурнаяЕдиница, , ВидОбеспечения, ПоставщикЗаполнения);
		ИначеЕсли МассивСкладов.Количество() = 1 Тогда
			Если ТипЗнч(МассивСкладов[0]) = Тип("СправочникСсылка.Склады") Тогда
				ЗаполнитьДокумент(МассивЗапасовПоСкладу, СтруктураЗаполнения.ВидЦен, СтруктураЗаполнения.СтруктурнаяЕдиница, МассивСкладов[0], ВидОбеспечения, ПоставщикЗаполнения);		
			ИначеЕсли ТипЗнч(МассивСкладов[0]) = Тип("СправочникСсылка.Сотрудники") Тогда
				ЗаполнитьДокумент(МассивЗапасовПоСкладу, СтруктураЗаполнения.ВидЦен, СтруктураЗаполнения.СтруктурнаяЕдиница, Неопределено, ВидОбеспечения, ПоставщикЗаполнения);		
			КонецЕсли;
		ИначеЕсли МассивСкладов.Количество() = 0 Тогда	
			ЗаполнитьДокумент(МассивЗапасовПоСкладу, СтруктураЗаполнения.ВидЦен, СтруктураЗаполнения.СтруктурнаяЕдиница, , ВидОбеспечения, ПоставщикЗаполнения);
		КонецЕсли;	
	Иначе 
		ПоказатьПредупреждение(Неопределено, "Установите в настройках отчета группировку Номенклатура!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Функция - возвращает постащвика для заполнения документа
// 
Функция ПолучитьПоставщикаЗаполнения(МассивЗапасовПоСкладу)
	
	массивПоставщиков = Новый Массив;
	Для Каждого ЭлементМ Из МассивЗапасовПоСкладу Цикл
		Если ЭлементМ.Свойство("Поставщик")
			И МассивПоставщиков.Найти(ЭлементМ.Поставщик) = Неопределено
			И ЗначениеЗаполнено(ЭлементМ.Поставщик) 
			И ТипЗнч(ЭлементМ.Поставщик) = Тип("СправочникСсылка.Контрагенты") Тогда
			МассивПоставщиков.Добавить(ЭлементМ.Поставщик);
		КонецЕсли;  
		Если МассивПоставщиков.Количество() > 1 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ?(МассивПоставщиков.Количество() = 1, МассивПоставщиков[0], Неопределено);
	
КонецФункции

&НаСервере
// Функция возвращает структуру, необходимую для заполнения документа "ЗаказПоставщику"
// 
Функция ОбеспечитьНаСервере(ВидОбеспечения)
	
	ТаблицаКритическихОстатков = Новый ТаблицаЗначений;
	
	// Макет компоновки
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных, 
	Отчет.КомпоновщикНастроек.ПолучитьНастройки(), , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	// Компоновка данных
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

	// Вывод результата
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаКритическихОстатков = ПроцессорВывода.Вывести(ПроцессорКомпоновки); 
	
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("ВидЦен", 				Справочники.ВидыЦен.Закупочная);
	СтруктураЗаполнения.Вставить("Запасы",				ОбщегоНазначенияКлиентСерверСтоматология.КонвертироватьТаблицуВМассивСтруктур(ТаблицаКритическихОстатков));
	СтруктураЗаполнения.Вставить("ЗапасыСгруппированы", ОбщегоНазначенияКлиентСерверСтоматология.КонвертироватьТаблицуВМассивСтруктур(СвернутьТаблицуЗапасов(ТаблицаКритическихОстатков, ВидОбеспечения)));
	СтруктураЗаполнения.Вставить("СтруктурнаяЕдиница", 	ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	Возврат СтруктураЗаполнения;

КонецФункции

&НаСервере
// Функция группирует таблицу остатков
// 
Функция СвернутьТаблицуЗапасов(ТаблицаКритическихОстатков, ВидОбеспечения)
	
	Если ТаблицаКритическихОстатков.Колонки.Найти("Номенклатура") = Неопределено Тогда
		Возврат ТаблицаКритическихОстатков;
	Иначе	
		ТаблицаОстатков = ТаблицаКритическихОстатков.Скопировать(,);		
		Если ВидОбеспечения = "ЗаказПоставщику" ИЛИ ВидОбеспечения = "ПеремещениеЗапасов" Тогда 
			ТаблицаОстатков.Свернуть("Номенклатура, Партия", "Количество,КоличествоОстаток,КоличествоУпаковокКритическихОстатков,КоличествоУпаковокОбеспечения,КоличествоУпаковокОстатков,Обеспечение");	
		Иначе			
			Если ТаблицаОстатков.Колонки.Найти("Упаковка") = Неопределено Тогда 
				ТаблицаОстатков.Свернуть("Номенклатура, Партия", "Количество,КоличествоОстаток,КоличествоУпаковокКритическихОстатков,КоличествоУпаковокОбеспечения,КоличествоУпаковокОстатков,Обеспечение");	
			Иначе 
				ТаблицаОстатков.Свернуть("Номенклатура, Партия, Упаковка", "Количество,КоличествоОстаток,КоличествоУпаковокКритическихОстатков,КоличествоУпаковокОбеспечения,КоличествоУпаковокОстатков,Обеспечение");	
			КонецЕсли;	
		КонецЕсли;
		Возврат ТаблицаОстатков;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Функция возвращает массив запасов по выбранному складу
// 
Функция ВернутьЗапасыПоСкладу(МассивСкладов, МассивЗапасы, ВидОбеспечения)
	
	// МассивЗапасовПоСкладу = Новый Массив;
	// Для Каждого Склад Из МассивСкладов Цикл 
	// 	Для Каждого Запас Из МассивЗапасы Цикл
	// 		Если Запас.Склад = Склад Тогда 
	// 			МассивЗапасовПоСкладу.Добавить(Запас);		
	// 		КонецЕсли;
	// 	КонецЦикла;
	// КонецЦикла; 	
	
	Возврат ДобавитьСтавкуНДС(МассивЗапасы, ВидОбеспечения);	
	
КонецФункции

&НаСервереБезКонтекста
// Функция добавляет в массив ставку НДС
// 
Функция ДобавитьСтавкуНДС(МассивЗапасовПоСкладу, ВидОбеспечения)
	
	Для Каждого ЭлементМассива Из МассивЗапасовПоСкладу Цикл 
		Если ЗначениеЗаполнено(ЭлементМассива.Номенклатура) Тогда 
			ЭлементМассива.Вставить("СтавкаНДС", ЭлементМассива.Номенклатура.СтавкаНДС);                                                                          			
			Если ВидОбеспечения = "ЗаказПоставщику" ИЛИ ВидОбеспечения = "ПеремещениеЗапасов" Тогда
				// ничего не делаем
			Иначе 	
				ЭлементМассива.КоличествоУпаковокОбеспечения = ?(ЭлементМассива.Номенклатура.УпаковкаПоУмолчанию.Коэффициент = 0, ЭлементМассива.Обеспечение / 1, ЭлементМассива.Обеспечение / ЭлементМассива.Номенклатура.УпаковкаПоУмолчанию.Коэффициент);
				Если НЕ ЭлементМассива.Свойство("Упаковка") Тогда
					ЭлементМассива.Вставить("Упаковка", ЭлементМассива.Номенклатура.УпаковкаПоУмолчанию);
				Иначе 
					ЭлементМассива.Упаковка = ЭлементМассива.Номенклатура.УпаковкаПоУмолчанию;
				КонецЕсли;				
			КонецЕсли;	
		КонецЕсли;		
	КонецЦикла;	
	
	Возврат МассивЗапасовПоСкладу;
	
КонецФункции

&НаКлиенте
// Процедура заполняет документ
// 
Процедура ЗаполнитьДокумент(МассивЗапасы, ВидЦен, СтруктурнаяЕдиница, ВыбранныйСклад = Неопределено, ВидОбеспечения, ВыбранныйПоставщик = Неопределено)
	
	Если МассивЗапасы.Количество() > 0 Тогда
		
		ЗаполнитьПризнакИспользованияХарактеристик(МассивЗапасы);
		
		Если ВидОбеспечения = "ЗаказПоставщику" ИЛИ ВидОбеспечения = "ЗаказПоставщикуВУпакПоУмолчанию" Тогда
			// -----------------------------------------------СОЗДАЕМ ЗАКАЗ ПОСТАВЩИКУ---------------------------------------------------------
			ЗаказПокупателяФорма = ПолучитьФорму("Документ.ЗаказПоставщику.ФормаОбъекта");
			ЗаказПокупателяФорма.Объект.ВидЦен = ВидЦен;
			Если ВыбранныйСклад <> Неопределено Тогда
				ЗаказПокупателяФорма.Объект.Склад				= ВыбранныйСклад;
				ЗаказПокупателяФорма.Объект.СтруктурнаяЕдиница	= ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ВыбранныйСклад, "СтруктурнаяЕдиница");
			Иначе
				ЗаказПокупателяФорма.Объект.Склад				= ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка");
				ЗаказПокупателяФорма.Объект.СтруктурнаяЕдиница	= СтруктурнаяЕдиница;
			КонецЕсли;
			ЗаказПокупателяФорма.Объект.Контрагент				= ?(ВыбранныйПоставщик <> Неопределено, ВыбранныйПоставщик, ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));
			
			// ----------------------------------------
			Если МассивЗапасы.Количество() > 90 Тогда
				// Подключаем статус-бар				
				Коэфициент = 100/МассивЗапасы.Количество();
				Прогресс = Коэфициент;
				Для Каждого ЭлементМассива Из МассивЗапасы Цикл
					Состояние("Заполнение списка получателей!", ?(Цел(Прогресс) < 1, 1, Цел(Прогресс)), "Получение " + Строка(ЭлементМассива.Номенклатура) + "...", БиблиотекаКартинок.Информация32);				
					Если Не ЗначениеЗаполнено(ЭлементМассива.Номенклатура) ИЛИ ЭлементМассива.Обеспечение < 1 Тогда
						Продолжить;
					КонецЕсли;
					НоваяСтрока = ЗаказПокупателяФорма.Объект.Запасы.Добавить();
					НоваяСтрока.Номенклатура = ЭлементМассива.Номенклатура;
					НоваяСтрока.Партия       = ЭлементМассива.Партия;
					НоваяСтрока.ХарактеристикиИспользуются = ЭлементМассива.ХарактеристикиИспользуются;
					Если ЭлементМассива.КоличествоУпаковокОбеспечения = 0 ИЛИ НЕ ЭлементМассива.Свойство("Упаковка")Тогда
						НоваяСтрока.КоличествоУпаковок 	= ЭлементМассива.Обеспечение;
					Иначе 
						НоваяСтрока.КоличествоУпаковок 	= ЭлементМассива.КоличествоУпаковокОбеспечения;
						НоваяСтрока.Упаковка 			= ЭлементМассива.Упаковка;
					КонецЕсли;
					НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок;
					НоваяСтрока.СтавкаНДС 				= ЭлементМассива.СтавкаНДС;
					Прогресс = Прогресс + Коэфициент;
				КонецЦикла;
			Иначе
				Для Каждого ЭлементМассива Из МассивЗапасы Цикл
					Если Не ЗначениеЗаполнено(ЭлементМассива.Номенклатура) ИЛИ ЭлементМассива.Обеспечение < 1 Тогда
						Продолжить;
					КонецЕсли;
					НоваяСтрока = ЗаказПокупателяФорма.Объект.Запасы.Добавить();
					НоваяСтрока.Номенклатура = ЭлементМассива.Номенклатура;
					НоваяСтрока.Партия       = ЭлементМассива.Партия;
					НоваяСтрока.ХарактеристикиИспользуются = ЭлементМассива.ХарактеристикиИспользуются;
					Если ЭлементМассива.КоличествоУпаковокОбеспечения = 0 ИЛИ НЕ ЭлементМассива.Свойство("Упаковка")Тогда
						НоваяСтрока.КоличествоУпаковок 	= ЭлементМассива.Обеспечение;
					Иначе 
						НоваяСтрока.КоличествоУпаковок 	= ЭлементМассива.КоличествоУпаковокОбеспечения;
						НоваяСтрока.Упаковка 			= ЭлементМассива.Упаковка;
					КонецЕсли;
					НоваяСтрока.СтавкаНДС 				= ЭлементМассива.СтавкаНДС;
					НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок;
				КонецЦикла;
				
			КонецЕсли;
			ЦенообразованиеКлиент.ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ЗаказПокупателяФорма, "Запасы");			
			ЗаказПокупателяФорма.Открыть();
		Иначе
			// -----------------------------------------------СОЗДАЕМ ПЕРЕМЕЩЕНИЕ ЗАПАСОВ---------------------------------------------------------
			ПеремещениеЗапасовФорма = ПолучитьФорму("Документ.ПеремещениеЗапасов.ФормаОбъекта");
			Если ВыбранныйСклад <> Неопределено Тогда
				ПеремещениеЗапасовФорма.Объект.СкладПолучатель				= ВыбранныйСклад;
				ПеремещениеЗапасовФорма.Объект.СтруктурнаяЕдиницаПолучатель = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ВыбранныйСклад, "СтруктурнаяЕдиница");
			Иначе
				ПеремещениеЗапасовФорма.Объект.СкладПолучатель				= ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка");
				ПеремещениеЗапасовФорма.Объект.СтруктурнаяЕдиницаПолучатель = СтруктурнаяЕдиница;
			КонецЕсли;
			
			// ----------------------------------------
			Если МассивЗапасы.Количество() > 90 Тогда
				// Подключаем статус-бар
				Коэфициент = 100/МассивЗапасы.Количество();
				Прогресс = Коэфициент;
				Для Каждого ЭлементМассива Из МассивЗапасы Цикл
					Состояние("Заполнение списка получателей!", ?(Цел(Прогресс) < 1, 1, Цел(Прогресс)), "Получение " + Строка(ЭлементМассива.Номенклатура) + "...", БиблиотекаКартинок.Информация32);				
					Если Не ЗначениеЗаполнено(ЭлементМассива.Номенклатура) ИЛИ ЭлементМассива.Обеспечение < 1 Тогда
						Продолжить;
					КонецЕсли;
					НоваяСтрока = ПеремещениеЗапасовФорма.Объект.Запасы.Добавить();
					НоваяСтрока.Номенклатура = ЭлементМассива.Номенклатура;
					НоваяСтрока.Партия       = ЭлементМассива.Партия;
					НоваяСтрока.ХарактеристикиИспользуются = ЭлементМассива.ХарактеристикиИспользуются;
					Если ЭлементМассива.КоличествоУпаковокОбеспечения = 0 ИЛИ НЕ ЭлементМассива.Свойство("Упаковка")Тогда
						НоваяСтрока.КоличествоУпаковок 	= ЭлементМассива.Обеспечение;
					Иначе 
						НоваяСтрока.КоличествоУпаковок 	= ЭлементМассива.КоличествоУпаковокОбеспечения;
						НоваяСтрока.Упаковка 			= ЭлементМассива.Упаковка;
					КонецЕсли;
					НоваяСтрока.СтавкаНДС 				= ЭлементМассива.СтавкаНДС;
					Прогресс = Прогресс + Коэфициент;
				КонецЦикла;
			Иначе
				Для Каждого ЭлементМассива Из МассивЗапасы Цикл
					Если Не ЗначениеЗаполнено(ЭлементМассива.Номенклатура) ИЛИ ЭлементМассива.Обеспечение < 1 Тогда
						Продолжить;
					КонецЕсли;
					НоваяСтрока = ПеремещениеЗапасовФорма.Объект.Запасы.Добавить();
					НоваяСтрока.Номенклатура = ЭлементМассива.Номенклатура;
					НоваяСтрока.Партия       = ЭлементМассива.Партия;
					НоваяСтрока.ХарактеристикиИспользуются = ЭлементМассива.ХарактеристикиИспользуются;
					Если ЭлементМассива.КоличествоУпаковокОбеспечения = 0 ИЛИ НЕ ЭлементМассива.Свойство("Упаковка")Тогда
						НоваяСтрока.КоличествоУпаковок 	= ЭлементМассива.Обеспечение;
					Иначе 
						НоваяСтрока.КоличествоУпаковок 	= ЭлементМассива.КоличествоУпаковокОбеспечения;
						НоваяСтрока.Упаковка 			= ЭлементМассива.Упаковка;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			// ЦенообразованиеКлиент.ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ПеремещениеЗапасовФорма, "Запасы");			
			ПеремещениеЗапасовФорма.Открыть();			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, выполняет заполнения признака.
// 
Процедура ЗаполнитьПризнакИспользованияХарактеристик(МассивЗапасов)
	
	Для Каждого ЭлементМассива из МассивЗапасов Цикл
		Если ЗначениеЗаполнено(ЭлементМассива.Номенклатура) Тогда
			ЭлементМассива.Вставить("ХарактеристикиИспользуются", ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ЭлементМассива.Номенклатура, "ИспользоватьПартии"));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура, обновляет параметры ДатаНачала и ДатаКонца по кассовой смене.
//
Процедура ОбновитьПериодОтчета(ТипОбновления, КассоваяСмена = Неопределено)
	
	ИдентификаторПользовательскойНастройки = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период").ИдентификаторПользовательскойНастройки;
	Если ЗначениеЗаполнено(ИдентификаторПользовательскойНастройки) Тогда
		ПараметрПериод = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторПользовательскойНастройки);
	Иначе
		ПараметрПериод = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	КонецЕсли;
	
	ПараметрНачалоПериода = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	ПараметрКонецПериода  = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	
	Если ТипОбновления = "ИзКассовойСмены" Тогда
		
		НачалоКассовойСмены    = ?(ЗначениеЗаполнено(КассоваяСмена), КассоваяСмена.НачалоКассовойСмены, Дата(1,1,1));
		ОкончаниеКассовойСмены = ?(ЗначениеЗаполнено(КассоваяСмена) И ЗначениеЗаполнено(КассоваяСмена.ОкончаниеКассовойСмены), КассоваяСмена.ОкончаниеКассовойСмены, Дата(3999,12,31));
		
		ПараметрПериод.Значение.Вариант 	  = ВариантСтандартногоПериода.ПроизвольныйПериод;
		ПараметрПериод.Значение.ДатаНачала 	  = НачалоКассовойСмены;
		ПараметрПериод.Значение.ДатаОкончания = ОкончаниеКассовойСмены;
		ПараметрПериод.Значение               = Новый СтандартныйПериод(НачалоКассовойСмены, ОкончаниеКассовойСмены);		
		ПараметрНачалоПериода.Значение        = НачалоКассовойСмены;
		ПараметрКонецПериода.Значение         = ОкончаниеКассовойСмены;
		
		Период = Новый СтандартныйПериод(НачалоКассовойСмены, ОкончаниеКассовойСмены);
		
	Иначе
		
		НачалоКассовойСмены            = ПараметрПериод.Значение.ДатаНачала;
		ОкончаниеКассовойСмены         = ПараметрПериод.Значение.ДатаОкончания;

		ПараметрНачалоПериода.Значение = НачалоКассовойСмены;
		ПараметрКонецПериода.Значение  = ОкончаниеКассовойСмены;
		ПараметрПериод.Значение        = Новый СтандартныйПериод(НачалоКассовойСмены, ОкончаниеКассовойСмены);
		ПараметрПериод.Значение.Вариант 	  = ВариантСтандартногоПериода.ПроизвольныйПериод;
		ПараметрПериод.Значение.ДатаНачала 	  = НачалоКассовойСмены;
		ПараметрПериод.Значение.ДатаОкончания = ОкончаниеКассовойСмены;
	КонецЕсли;

	ПараметрПериод.Использование = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, кассовая смена соответствует выбранной кассе.
//
Функция КассоваяСменаСоответствуетВыбраннойКассе(КассоваяСмена, Касса)
	
	Возврат КассоваяСмена.Касса = Касса;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает последнюю кассовую смену.
//
Функция ПолучитьПоследнююКассовуюСмену(Касса)
	
	Возврат Документы.КассоваяСмена.ПолучитьПоследнююКассовуюСмену(Касса);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПривестиИдентификаторКИмени(Идентификатор)
	
	Возврат СтрЗаменить(Строка(Идентификатор), "-", "");
	
КонецФункции

&НаКлиенте
Процедура ПоказатьСписокОпераций(Команда)
	
	СписокВыбора = ОбновитьСписокОпераций();
	Оповещение 	 = Новый ОписаниеОповещения("ПоказатьСписокОперацийЗавершение", ЭтотОбъект);
	ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Элементы.ПоказатьСписокОпераций);

КонецПроцедуры

&НаСервереБезКонтекста
// Функция, ОбновитьСписокОпераций.
//
Функция ОбновитьСписокОпераций()
	
	СписокВыбора = Новый СписокЗначений();
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ДобавлениеИзменениеКлиентов") Тогда
		СписокВыбора.Добавить("ИзменитьКлиентов", "Изменить",, БиблиотекаКартинок.Изменить);	
	КонецЕсли;
	
	Если ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Справочники.СегментыКонтрагентов) Тогда
		СписокВыбора.Добавить("СоздатьСегментКлиентов", "Создать сегмент",, БиблиотекаКартинок.СоздатьЭлементСписка);	
	КонецЕсли;
	
	Если ПравоДоступа("Редактирование", Метаданные.Справочники.СегментыКонтрагентов) Тогда
		СписокВыбора.Добавить("ОбновитьСегмент", "Обновить сегмент",, БиблиотекаКартинок.Обновить);	
	КонецЕсли;
	
	СписокВыбора.Добавить("ОтправитьПоЭлектроннойПочтеКлиентамИзОтчета", "Отправить письмо",, БиблиотекаКартинок.ОтправитьEmail);
	
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ДобавлениеИзменениеSMSРассылки") Тогда
		СписокВыбора.Добавить("Отправить_SMS", "Отправить SMS",, БиблиотекаКартинок.ОтправитьSMS);	
	КонецЕсли;
	
	Возврат СписокВыбора;

КонецФункции

&НаКлиенте
// Процедура, обработчик команды завершение "ПоказатьСписокОпераций".
//
Процедура ПоказатьСписокОперацийЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПрверитьАктуальностьДанных(Результат.Значение);
	
КонецПроцедуры

&НаКлиенте
// Процедура, проверяет актуальность данных отчета.
//
Процедура ПрверитьАктуальностьДанных(ВыбранныйПараметр)
	
	ОтображениеСостояния = Элементы.ОтчетТабличныйДокумент.ОтображениеСостояния;
	Если ОтображениеСостояния.Видимость = Истина
		И ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность Тогда
		
		ТекстВопроса = НСтр("ru='Отчет не сформирован. Сформировать?';en='Report not formed. To form'");		
		
		ДопПараметр = Новый Структура("ВыбранныйПараметр", ВыбранныйПараметр);
		Оповещение = Новый ОписаниеОповещения("ПослеПроверкиНаАктуальностьДанных", ЭтотОбъект, ДопПараметр);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);
		Возврат;
	КонецЕсли;
	
	ОбработкаРезультатаВыбораОперации(ВыбранныйПараметр);
	
КонецПроцедуры

&НаКлиенте
// Процедура, завершение после "ПослеПроверкиНаАктуальность".
//
Процедура ПослеПроверкиНаАктуальностьДанных(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьНепосредственно();

	ОбработкаРезультатаВыбораОперации(ДополнительныеПараметры.ВыбранныйПараметр);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработка выбранного результата операции.
//
Процедура ОбработкаРезультатаВыбораОперации(ВыбранныйПараметр)
	
	Если ВыбранныйПараметр = "ИзменитьКлиентов" Тогда
		
		ИзменитьКлиентовИзОтчета();
		
	ИначеЕсли ВыбранныйПараметр = "СоздатьСегментКлиентов" Тогда
		
		СоздатьСегментКлиентовИзОтчета();
		
	ИначеЕсли ВыбранныйПараметр = "ОбновитьСегмент" Тогда
		
		ОбновитьСегментИзОтчета();
		
	ИначеЕсли ВыбранныйПараметр = "СоздатьЗадачиПоКлиентам" Тогда
		
		ЭтотОбъект.СоздатьЗадачу = Истина;
		ПоказатьВсплывающуюГруппу();
		
	ИначеЕсли ВыбранныйПараметр = "СоздатьСделкиПоКлиентам" Тогда
		
		ЭтотОбъект.СоздатьЗадачу = Ложь;
		ПоказатьВсплывающуюГруппу();
		
	ИначеЕсли ВыбранныйПараметр = "ОтправитьПоЭлектроннойПочтеКлиентамИзОтчета"  Тогда
		
		ПараметрыОткрытия = ОтправитьПоЭлектроннойПочтеКлиентамИзОтчетаНаСервере();
		Если ПараметрыОткрытия <> Неопределено Тогда
			ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", ПараметрыОткрытия);
		КонецЕсли;

	ИначеЕсли ВыбранныйПараметр = "Отправить_SMS"  Тогда
		
		МассивКлиентов  = ПолучитьМассивКонтрагентовИзРезультата();
		МассивТелефонов = Новый Массив;
		Если МассивКлиентов.Количество() > 0 Тогда
			
			МассивСтруктурПолучателей = Новый Массив;
			
			Для Каждого Клиент Из МассивКлиентов Цикл
				
				ТелефоныКлиента = ПолучитьНомераТелефоновКонтрагента(Клиент);
				Для Каждого Телефон Из ТелефоныКлиента Цикл 
					Если МассивТелефонов.Найти(Телефон) = Неопределено Тогда
						МассивСтруктурПолучателей.Добавить(Новый Структура("Получатель, НомерТелефона", Клиент, Телефон));
						МассивТелефонов.Добавить(Телефон);
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
			
			ПараметрыОткрытия = Новый Структура("Получатели", МассивСтруктурПолучателей);
			ОткрытьФорму("Документ.РассылкаСообщений.ФормаОбъекта", ПараметрыОткрытия);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоЭлектроннойПочте(Команда)
	ОтображениеСостояния = Элементы.ОтчетТабличныйДокумент.ОтображениеСостояния;
	Если ОтображениеСостояния.Видимость = Истина
		И ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность Тогда
		
		ТекстВопроса = НСтр("ru='Отчет не сформирован. Сформировать?';en='Report not formed. To form'");
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ОтправитьПоЭлектроннойПочтеЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);
        Возврат;
	КонецЕсли;
	
	ОтправитьПоЭлектроннойПочтеФрагмент();
КонецПроцедуры

// Процедура - Отправить по электронной почте клиентам из отчета
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура ОтправитьПоЭлектроннойПочтеКлиентамИзОтчета(Команда)
	
	ПараметрыОткрытия = ОтправитьПоЭлектроннойПочтеКлиентамИзОтчетаНаСервере();
	Если ПараметрыОткрытия <> Неопределено Тогда
	    ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", ПараметрыОткрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВычислитьСумму(Команда)
	СуммаВыделенныхЯчеек = ВычислитьСуммуСервер(ОтчетТабличныйДокумент, ВыделенныеОбласти());
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправкуОтчета(Команда)
	ОткрытьСправку(КлючОбъекта);
КонецПроцедуры

&НаКлиенте
// Процедура, открывает групповую обработку изменения клиентов.
//
Процедура ИзменитьКлиентовИзОтчета()
	
	МассивКонтрагентов = ПолучитьМассивКонтрагентовИзРезультата();
	Если МассивКонтрагентов.Количество() > 0 Тогда	
		ПараметрыФормы = Новый Структура("МассивОбъектов", МассивКонтрагентов);
		ОткрытьФорму("Обработка.ГрупповоеИзменениеОбъектов.Форма", ПараметрыФормы);
	Иначе
		ПоказатьПредупреждение(,НСтр("ru='В отчете не найдены пациенты!';en='No clients found in report!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, создает сегмент клиентов из отчета.
//
Процедура СоздатьСегментКлиентовИзОтчета()
	
	МассивКонтрагентовОбщий = ПолучитьМассивКонтрагентовИзРезультата();
	
	МассивКонтрагентов = Новый Массив;
	Для Каждого СтрокаМассива Из МассивКонтрагентовОбщий Цикл
		Если ТипЗнч(СтрокаМассива) = Тип("СправочникСсылка.Контрагенты") Тогда
			МассивКонтрагентов.Добавить(СтрокаМассива);
		КонецЕсли;
	КонецЦикла;
	Если МассивКонтрагентов.Количество() > 0 Тогда
		СозданныйСегмент = СформироватьСегментКлиентовИзОтчета(МассивКонтрагентов);
		ПоказатьЗначение(, СозданныйСегмент);
	Иначе
		ПоказатьПредупреждение(,НСтр("ru='В отчете не найдены пациенты!';en='No clients found in report!'"));
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Функция, созадает сегмент клиентов из отчета.
//
Функция СформироватьСегментКлиентовИзОтчета(МассивКлиентов)
	
	СпрОбъект = Справочники.СегментыКонтрагентов.СоздатьЭлемент();
	// СпрОбъект.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	СпрОбъект.СпособФормирования = Перечисления.СпособыФормированияСегментов.ФормироватьВручную;
	СпрОбъект.ДатаСоздания       = ТекущаяДатаСеанса();
	СпрОбъект.Наименование       = "Сегмент из отчета: " + НаименованиеОтчета;
	// СпрОбъект.Сотрудник          = ПараметрыСеанса.ТекущийПользователь;
	
	СпрОбъект.Записать();
	
	Сегменты.СформироватьПоМассиву(СпрОбъект.Ссылка, МассивКлиентов);
	
	Возврат СпрОбъект.Ссылка;
	
КонецФункции

&НаКлиенте
// Процедура, обновляет сегмент клиентов из отчета.
//
Процедура ОбновитьСегментИзОтчета()
	
	ПараметрыОкрытияФормы = Новый Структура("Отбор", Новый Структура("СпособФормирования, ПометкаУдаления", ПредопределенноеЗначение("Перечисление.СпособыФормированияСегментов.ФормироватьВручную"), Ложь));
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьСегментИзОтчетаЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.СегментыКонтрагентов.ФормаВыбора", ПараметрыОкрытияФормы,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события завершения.
//
Процедура ОбновитьСегментИзОтчетаЗавершение(Результат, Параметры) Экспорт
	
	Если Не Результат = Неопределено Тогда
		МассивКонтрагентов = ПолучитьМассивКонтрагентовИзРезультата();
		Если МассивКонтрагентов.Количество() > 0 Тогда
			ОбновленныйСегмент = ОбновитьСегментКлиентовИзОтчета(Результат, МассивКонтрагентов);
			ПоказатьЗначение(, ОбновленныйСегмент);
		Иначе
			ПоказатьПредупреждение(,НСтр("ru='В отчете не найдены пациенты!';en='No clients found in report!'"));
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция, обновляет сегмент клиентов из отчета.
//
Функция ОбновитьСегментКлиентовИзОтчета(Сегмент, МассивКлиентов)
	
    Сегменты.ОбновитьСегментПоМассиву(Сегмент, МассивКлиентов); 
	Возврат Сегмент;
	
КонецФункции

&НаСервере
// Функция - Получить номера телефонов контрагента
//
// Параметры:
//  Контрагент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьНомераТелефоновКонтрагента(Контрагент) 
	
	ТелефоныКонтрагента = Новый Массив;
	Если ЗначениеЗаполнено(Контрагент) И ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Отбор = Новый Структура("Вид, НеУчаствоватьВРассылке", Справочники.ВидыКонтактнойИнформации.ТелефонКлиента, Ложь);
		НайденныеСтроки = Контрагент.КонтактнаяИнформация.НайтиСтроки(Отбор);
		
		Для Каждого Контакт Из НайденныеСтроки Цикл
			Если ЗначениеЗаполнено(Контакт.НомерТелефона) Тогда
				ТелефоныКонтрагента.Добавить(Контакт.НомерТелефона);
			КонецЕсли;
		КонецЦикла;
				
	КонецЕсли;
	
	Возврат ТелефоныКонтрагента;
	
КонецФункции

&НаКлиенте
// Процедура - обработчик команды "СоздатьДокументПоЗапасам"
//
Процедура СоздатьДокументПоЗапасам(Команда)
	
	// Получим структуру данных
	СтруктураЗаполнения = ПолучитьСтруктуруДанных();
	ГруппировкаНоменклатура = Ложь;
	
	// Проверим, не убрал ли пользователь группировку "Номенклатура"
	Для Каждого ЭлементМассива Из СтруктураЗаполнения.МассивЗапасов Цикл 
		Если ЭлементМассива.Свойство("Номенклатура") Тогда 
			ГруппировкаНоменклатура = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;		
	
	Если ГруппировкаНоменклатура Тогда 		
		Если СтруктураЗаполнения.МассивСкладов.Количество() > 1 Тогда
			ЗаполнитьДокумент(СтруктураЗаполнения.МассивЗапасов, СтруктураЗаполнения.ВидЦен, СтруктураЗаполнения.СтруктурнаяЕдиница, , Команда.Имя);
		ИначеЕсли СтруктураЗаполнения.МассивСкладов.Количество() = 1 Тогда
			Если ТипЗнч(СтруктураЗаполнения.МассивСкладов[0]) = Тип("СправочникСсылка.Склады") Тогда 
				ЗаполнитьДокумент(СтруктураЗаполнения.МассивЗапасов, СтруктураЗаполнения.ВидЦен, СтруктураЗаполнения.СтруктурнаяЕдиница, СтруктураЗаполнения.МассивСкладов[0], Команда.Имя);		
			ИначеЕсли ТипЗнч(СтруктураЗаполнения.МассивСкладов[0]) = Тип("СправочникСсылка.Сотрудники") Тогда
				Склад = ПолучитьСкладПоСотруднику(СтруктураЗаполнения.СтруктурнаяЕдиница, СтруктураЗаполнения.МассивСкладов[0]);
				ЗаполнитьДокумент(СтруктураЗаполнения.МассивЗапасов, СтруктураЗаполнения.ВидЦен, СтруктураЗаполнения.СтруктурнаяЕдиница, ?(Склад = ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка"), Неопределено, Склад), Команда.Имя);		
			КонецЕсли;
		ИначеЕсли СтруктураЗаполнения.МассивСкладов.Количество() = 0 Тогда	
			ЗаполнитьДокумент(СтруктураЗаполнения.МассивЗапасов, СтруктураЗаполнения.ВидЦен, СтруктураЗаполнения.СтруктурнаяЕдиница, , Команда.Имя);
		КонецЕсли;	
	Иначе 
		ПоказатьВопрос(Неопределено, НСтр("ru='Установите в настройках отчета группировку Номенклатура!';en='Set the Nomenclature grouping in the report settings!'"), РежимДиалогаВопрос.ОК, , , НСтр("ru='Сообщение';en='Message'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, показать всплывающую группу "ГруппаВзаимодействиеЗадачаВсплывающая".
// Устанавливает видимость элементов группы, а так же показывает группу.
//
Процедура ПоказатьВсплывающуюГруппу()

	ЭтотОбъект.ТаблицаДействия.Очистить();
	ЭтотОбъект.ВзаимодействиеПараметры = Неопределено;
	
	Если ЭтотОбъект.СоздатьЗадачу Тогда
		
		// Подтягиваем первый вид задачи из списка.
		Если ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора.Количество() > 0 Тогда
			Взаимодействие = ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора[0];
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Пустая таблица видов взаимодействия';en='Nasty table species interactions'"));
			Возврат;
		КонецЕсли;
		
		// Заполняем произвольный реквизит формы.
		ЭтотОбъект.ВзаимодействиеПараметры = Новый Структура;
		ЭтотОбъект.ВзаимодействиеПараметры.Вставить("Взаимодействие"   , Взаимодействие.Значение.Взаимодействие);
		ЭтотОбъект.ВзаимодействиеПараметры.Вставить("ВидВзаимодействия", Взаимодействие.Значение.ВидВзаимодействия);
		ЭтотОбъект.ВзаимодействиеПараметры.Вставить("ТемаПоУмолчанию"  , Взаимодействие.Значение.ТемаПоУмолчанию);
		ЭтотОбъект.ВзаимодействиеПараметры.Вставить("Представление"    , Взаимодействие.Представление);
		ЭтотОбъект.ВзаимодействиеПараметры.Вставить("Картинка"         , Взаимодействие.Картинка);
		
		Элементы.ВыбратьВидЗадачиСделки.Заголовок 			= Взаимодействие.Значение.ВидВзаимодействия; 
		Элементы.ДекорацияВзаимодействиеИконка.Картинка     = ЭтотОбъект.ВзаимодействиеПараметры.Картинка;

		// Установить тему по умолчанию.
		ЭтотОбъект.ВзаимодействиеЗадачаТема  = ЭтотОбъект.ВзаимодействиеПараметры.ТемаПоУмолчанию;
		ЭтотОбъект.ВзаимодействиеОписание = "";

		// Установить дату взаимодействия.
		ЭтотОбъект.ВзаимодействиеЗадачаДата = ПолучитьОкругленноеВремяВзаимодействия();	
		ВзаимодействиеЗадачаДатаПриИзмененииНаСервере();

		// Обновить режим напоминания взаимодействия.
		РежимНапоминанияПоУмолчанию = ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора[0];		
		
		ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания    = РежимНапоминанияПоУмолчанию.Значение;
		Элементы.ВзаимодействиеЗадачаНапоминание.Заголовок = РежимНапоминанияПоУмолчанию.Представление;
		
		Элементы.ВзаимодействиеЗадачаПрочееТема.Видимость 	= Истина;
		Элементы.ВзаимодействиеЗадачаНапоминание.Видимость 	= Истина;
		Элементы.ГруппаВзаимодействиеВид.Видимость			= Истина;
		Элементы.ГруппаВзаимодействиеЗадачаДата.Видимость	= Истина;
		Элементы.ГруппаВидСделки.Видимость					= Ложь;
		
	Иначе
			
		Элементы.ВзаимодействиеЗадачаПрочееТема.Видимость 	= Ложь;
		Элементы.ВзаимодействиеЗадачаНапоминание.Видимость 	= Ложь;
		Элементы.ГруппаВзаимодействиеВид.Видимость			= Ложь;
		Элементы.ГруппаВзаимодействиеЗадачаДата.Видимость	= Ложь;	
		Элементы.ГруппаВидСделки.Видимость					= Истина;
		
		// Устанавливаем первый попавшийся вид сделки.
		МассивВидовСделок = ПолучитьВидыСделок();
		Если МассивВидовСделок.Количество() > 0 Тогда
			ЭтотОбъект.ВидСделки = МассивВидовСделок[0];
		КонецЕсли;
		
	КонецЕсли;
	
	// Меняем фокус, что бы скрыть вслывающую группу, изменить ее вид и корректно показать на форме.
	СменитьФокусЭлементаНаКлиенте();
	Элементы.ГруппаВзаимодействиеЗадачаВсплывающая.Показать();

КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПриИзмененииНа", на сервере.
//
Процедура ВзаимодействиеЗадачаДатаПриИзмененииНаСервере()
	
	ЗаполнитьСписокВыбораВремениЭлемента("ВзаимодействиеЗадачаВремя", ЭтотОбъект.ВзаимодействиеЗадачаДата);
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик обновления процентов табличной части "ТаблицаДействия".
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Процедура ЗаполнитьПроцентомСтрокиТЗ()
	
	КолвоЭлементов = ЭтотОбъект.ТаблицаДействия.Количество();
	
	Если КолвоЭлементов > 0 Тогда
		
		Процентов  		   = Цел(100/КолвоЭлементов);
		НедостающийПроцент = 100 - (Процентов*КолвоЭлементов);
		
		Для Каждого СтрокаТЗ Из ЭтотОбъект.ТаблицаДействия Цикл
			СтрокаТЗ.Пропорция = Процентов;
		КонецЦикла;
		
		ЭтотОбъект.ОстаточныйПроцентОтДеления = НедостающийПроцент;		

	КонецЕсли;
	
	СменитьФокусЭлементаНаСервере();
	Элементы.ГруппаВзаимодействиеЗадачаВсплывающая.Показать();
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить списки выбора времени окончания работы.
//
// Параметры:
//  ВремяНачала	 - 	 -
//  ЭлементФормы - 	 -
//
Процедура ЗаполнитьСписокВыбораВремениЭлемента(ИмяЭлементаФормы, Знач ДатаНачала)
	
	ЭлементФормы = Элементы[ИмяЭлементаФормы];
	
	ПериодРаботы = Новый Структура;
	ПериодРаботы.Вставить("ДатаНачала"   , НачалоДня(ДатаНачала));
	ПериодРаботы.Вставить("ДатаОкончания", НачалоДня(ДатаНачала) + 86400);
	
	МассивПериодов = Новый Массив;
	МассивПериодов.Добавить(ПериодРаботы);
	
	СписокВремени = РаботаСДиалогами.ВернутьСписокВремениДляНачалаРаботыСервер(МассивПериодов, Ложь, 30);
	
	ЭлементФормы.СписокВыбора.Очистить();
	
	Для Каждого Элемент Из СписокВремени Цикл
		
		Представление = ?(Минута(Элемент.Значение) = 0, Элемент.Представление, Новый ФорматированнаяСтрока(Элемент.Представление,, Новый Цвет(100, 100, 100)));
		ЭлементФормы.СписокВыбора.Добавить(Элемент.Значение, Представление);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить округленное время взаимодействия.
// 
// Возвращаемое значение:
//   - дата - округленное время взаимодействия. 
//
Функция ПолучитьОкругленноеВремяВзаимодействия()
	
	ВремяВстречи = ТекущаяДатаСеанса() + 86400; 		
	
	Возврат НачалоДня(ВремяВстречи) + Окр((ВремяВстречи - НачалоДня(ВремяВстречи)) / 1800) * 1800;
	
КонецФункции

&НаСервере
// Процедура, заполнить список выбора режима напоминания.
//
Процедура ЗаполнитьСписокВыбораРежимаНапоминания()
	
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Очистить();
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(-1	   , "не напоминать");
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(0     , "в момент события");
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(300   , "за 5 минут");
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(600   , "за 10 минут");
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(900   , "за 15 минут");
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(1800  , "за 30 минут");     
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(3600  , "за 1 час");
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(7200  , "за 2 часа");
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(86400 , "за 1 день");
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(172800, "за 2 дня");
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(604800, "за 1 неделю");
	
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания = -1;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает виды сделок.
//
Функция ПолучитьВидыСделок()
	
     Возврат Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок();
	 
КонецФункции

&НаКлиенте
// Процедура, ВопросПередСозданием.
//
Процедура ВопросПередСозданием()
	
	ЗаполнитьТаблицуКлиентов();

	КоличествоКлиентов = ЭтотОбъект.ТаблицаКлиентов.Количество();
	Если КоличествоКлиентов > 0 Тогда
		
		Шаблон = НСтр("ru = '; %1 клиенту;; %1 клиентам; %1 клиентам; %1 клиентам'; en = '; %1 client;;;; %1 clients'");
		КлиентовСтрокой = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(Шаблон, КоличествоКлиентов,, НСтр("ru='L=ru'; en='L=en'"));
		
		Если ЭтотОбъект.СоздатьЗадачу Тогда
			Вопрос = СтрШаблон(НСтр("ru='Создать ""задачи"" %1 из отчета? Эти изменения необратимы. Продолжить?';en='Create ""tasks"" %1 of report? These changes are irreversible. Continue?'"), КлиентовСтрокой);
		Иначе
			Вопрос = СтрШаблон(НСтр("ru='Создать ""сделки"" %1 из отчета? Эти изменения необратимы. Продолжить?';en='Create ""deals"" %1 of report? These changes are irreversible. Continue?'"), КлиентовСтрокой);
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбИзменении", ЭтотОбъект); 
		
		ПоказатьВопрос(Оповещение,
		Вопрос,
		РежимДиалогаВопрос.ДаНет,
		0, 
		КодВозвратаДиалога.Да, 
		НСтр("ru = 'Вопрос пользователю'; en = 'Question to user'")
		); 	
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='В отчете не найдены пациенты!';en='No clients found in report!'"));
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
// Процедура, ЗаполнитьТаблицуКлиентов.
//
Процедура ЗаполнитьТаблицуКлиентов()
	
	ЭтотОбъект.ТаблицаКлиентов.Загрузить(ПолучитьТаблицуЗначенийКонтрагентовИзРезультата());
	
КонецПроцедуры

&НаКлиенте
// Процедура, ПослеВопросаОбИзменении.
//
Процедура ПослеВопросаОбИзменении(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ВзаимодействиеСоздатьСервер();
		
	КонецЕсли;
	 
КонецПроцедуры

&НаСервере
// Процедура, ВзаимодействиеСоздатьСервер.
//
Процедура ВзаимодействиеСоздатьСервер()
	
	ТаблицаЗначенийКлиентов = ЭтотОбъект.ТаблицаКлиентов.Выгрузить();
	РаспределитьВПропорции(ТаблицаЗначенийКлиентов);
	СменитьФокусЭлементаНаСервере();
	
КонецПроцедуры

&НаСервере
// Процедура, распределяет сделки и задачи в пропорции.
//
Процедура РаспределитьВПропорции(Знач ТаблицаЗначенийКлиентов)
	
	КоличествоСотрудников = ЭтотОбъект.ТаблицаДействия.Количество();
	
	Если КоличествоСотрудников <= 0 Тогда		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не выбраны исполнители!';en='Not selected performers!'"));
		Возврат;	
	КонецЕсли;
	
	ТипЧисло = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(3));
	
	ТЗСотрудников = ЭтотОбъект.ТаблицаДействия.Выгрузить();
	ТЗСотрудников.Колонки.Добавить("КоличествоКлиентов"	, ТипЧисло);
	ТЗСотрудников.Колонки.Добавить("ПроцентТекущий"		, ТипЧисло);
	ТЗСотрудников.Колонки.Добавить("Дельта"				, ТипЧисло);
	
	ТЗКлиентовСотрудников = ТаблицаЗначенийКлиентов.Скопировать(,"Контрагент");
	ТЗКлиентовСотрудников.Колонки.Добавить("Сотрудник");
	
	НачатьТранзакцию();
	
	Для Каждого СтрокаТЗ Из ТЗКлиентовСотрудников Цикл
		
		ПриоритетныйСотрудник = Неопределено;
		ПриоритетныйПроцент   = 0;
		
		Для Каждого СтрокаСотрудников Из ТЗСотрудников Цикл
			
			Если СтрокаСотрудников.Дельта >= ПриоритетныйПроцент Тогда
				
				ПриоритетныйСотрудник = СтрокаСотрудников.Сотрудник;
				ПриоритетныйПроцент   = СтрокаСотрудников.Дельта;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЭтотОбъект.СоздатьЗадачу Тогда
			
			ОбъектЗадача = Задачи.Взаимодействие.СоздатьЗадачу();
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("Контрагент"                 , СтрокаТЗ.Контрагент);
			ДанныеЗаполнения.Вставить("ВидВзаимодействия"          , ЭтотОбъект.ВзаимодействиеПараметры.ВидВзаимодействия);
			ДанныеЗаполнения.Вставить("ВидВзаимодействияСправочник", ЭтотОбъект.ВзаимодействиеПараметры.Взаимодействие);
			ДанныеЗаполнения.Вставить("Исполнитель"                , ПриоритетныйСотрудник);
			ДанныеЗаполнения.Вставить("ЗадачаНазначеннаяДата"      , ЭтотОбъект.ВзаимодействиеЗадачаДата);
			ДанныеЗаполнения.Вставить("ЗадачаТема"                 , ЭтотОбъект.ВзаимодействиеЗадачаТема);
			ДанныеЗаполнения.Вставить("ЗадачаОписание"             , ЭтотОбъект.ВзаимодействиеОписание);
			ДанныеЗаполнения.Вставить("Сделка"                     , Справочники.Сделки.ПолучитьАктуальнуюСделкуКлиента(СтрокаТЗ.Контрагент));
			
			НоваяЗадача = Задачи.Взаимодействие.СоздатьЗадачу();
			НоваяЗадача.Заполнить(ДанныеЗаполнения);	
			
			Задачи.Взаимодействие.ЗаполнитьПараметрыНапоминания(НоваяЗадача, Новый Структура("ЗадачаРежимНапоминания", ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания));	
			
			НоваяЗадача.Записать();
		
		Иначе
			
			НоваяСделка   = Справочники.Сделки.СоздатьЭлемент();		
			ТаблицаЭтапов = Справочники.ВидыСделок.ПолучитьЭтапыПоВидуСделки(ЭтотОбъект.ВидСделки);
			
			ДанныеЗаполнения = Новый Структура();
			ДанныеЗаполнения.Вставить("Контрагент"	,СтрокаТЗ.Контрагент);
			ДанныеЗаполнения.Вставить("ВидСделки"	,ЭтотОбъект.ВидСделки);
			ДанныеЗаполнения.Вставить("ЭтапСделки"	,?(ТаблицаЭтапов.Количество()> 0, ТаблицаЭтапов[0].ЭтапСделки, Неопределено));
			ДанныеЗаполнения.Вставить("КаналПривлечения"  ,СтрокаТЗ.Контрагент.КаналПривлечения); 
			ДанныеЗаполнения.Вставить("ИсточникИнформации",СтрокаТЗ.Контрагент.ИсточникИнформации);
			ДанныеЗаполнения.Вставить("ИсточникИнформацииЗначение",СтрокаТЗ.Контрагент.ИсточникИнформацииЗначение);
			ДанныеЗаполнения.Вставить("Описание"    , ЭтотОбъект.ВзаимодействиеОписание); 
			ДанныеЗаполнения.Вставить("Менеджер"    , ПриоритетныйСотрудник);
			
			НоваяСделка.Заполнить(ДанныеЗаполнения);
			НоваяСделка.Записать();

		КонецЕсли;
		
		СтрокаТЗСотрудников = ТЗСотрудников.Найти(ПриоритетныйСотрудник);
		
		// Обновляем данные в таблице сотрудников.
		Если СтрокаТЗСотрудников <> Неопределено Тогда
			
			СтрокаТЗСотрудников.КоличествоКлиентов = СтрокаТЗСотрудников.КоличествоКлиентов + 1;
			СтрокаТЗСотрудников.ПроцентТекущий 	   = СтрокаТЗСотрудников.КоличествоКлиентов/ТЗСотрудников.Итог("КоличествоКлиентов")*100; 
			СтрокаТЗСотрудников.Дельта 		       = СтрокаТЗСотрудников.Пропорция - СтрокаТЗСотрудников.ПроцентТекущий;
			
		КонецЕсли;
		
		// Обновляем данные в таблице значений.
		Для Каждого СтрокаСотрудников Из ТЗСотрудников Цикл
			
			СтрокаСотрудников.ПроцентТекущий 	   = СтрокаСотрудников.КоличествоКлиентов/ТЗСотрудников.Итог("КоличествоКлиентов")*100; 
			СтрокаСотрудников.Дельта 		       = СтрокаСотрудников.Пропорция - СтрокаСотрудников.ПроцентТекущий;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();

КонецПроцедуры

&НаСервере
// Функция, возвращает таблицу значений контрагентов из отчета.
Функция ПолучитьТаблицуЗначенийКонтрагентовИзРезультата()
	
	ТаблицаКонтрагентов = Новый ТаблицаЗначений;
	ТаблицаКонтрагентов.Колонки.Добавить("Контрагент");
	
	Если ЗначениеЗаполнено(ОтчетДанныеРасшифровки) Тогда
		ДанныеРасшифровкиХранилища = ПолучитьИзВременногоХранилища(ОтчетДанныеРасшифровки);
		Для Каждого ЭлементДанныеРасшифровкиХранилища Из ДанныеРасшифровкиХранилища.Элементы Цикл
			Если ТипЗнч(ЭлементДанныеРасшифровкиХранилища) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
				Для Каждого ЭлементПоля Из ЭлементДанныеРасшифровкиХранилища.ПолучитьПоля() Цикл
					
					Если ТипЗнч(ЭлементПоля.Значение) = Тип("СправочникСсылка.Контрагенты")
						И ЭлементПоля.Значение.ЭтоГруппа = Ложь 
						И ТаблицаКонтрагентов.Найти(ЭлементПоля.Значение) = Неопределено Тогда
						
						НоваяСтрока = ТаблицаКонтрагентов.Добавить();
						НоваяСтрока.Контрагент = ЭлементПоля.Значение;
						
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	Возврат ТаблицаКонтрагентов;
	
КонецФункции

&НаКлиенте
// Процедура, сменяет текущий элемент формы на клиенте.
// Нужна для обновления видимости всплывающих групп.
//
Процедура СменитьФокусЭлементаНаКлиенте()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ПоказатьСписокОпераций;
	
КонецПроцедуры

&НаСервере
// Процедура, сменяет текущий элемент формы на сервере.
// Нужна для обновления видимости всплывающих групп.
//
Процедура СменитьФокусЭлементаНаСервере()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ПоказатьСписокОпераций;
	
КонецПроцедуры

// Функция - Отправить по электронной почте клиентам из отчета на сервере
// 
// Возвращаемое значение:
//   - 
//
&НаСервере
Функция ОтправитьПоЭлектроннойПочтеКлиентамИзОтчетаНаСервере()
	
	ДоступныеУчетныеЗаписи = ПолучитьСписокДоступныхУчетныхЗаписей();
	
	Если ДоступныеУчетныеЗаписи.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Для текущего пользователя не задана учетная запись электронной почты';en='For current user not set accounting record email of mail'"));
		Отказ = Истина;
		Возврат Неопределено;
	КонецЕсли;
	
	УчетнаяЗапись = ДоступныеУчетныеЗаписи[0].Ссылка;
		
	ИсходящееЭлектронноеПисьмо                = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
	ИсходящееЭлектронноеПисьмо.Автор 		  = ПараметрыСеанса.ТекущийПользователь;
	ИсходящееЭлектронноеПисьмо.Важность       = Перечисления.ВариантыВажностиЗадачи.Обычная;
	ИсходящееЭлектронноеПисьмо.Дата           = ТекущаяДатаСеанса();
	ИсходящееЭлектронноеПисьмо.ЕстьВложения   = Ложь;
	ИсходящееЭлектронноеПисьмо.Кодировка      = "utf-8";
	
	ИсходящееЭлектронноеПисьмо.УчетнаяЗапись = УчетнаяЗапись;
	ИсходящееЭлектронноеПисьмо.Тема          = "Рассылка";
	ИсходящееЭлектронноеПисьмо.ТипТекста     = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст;
	ИсходящееЭлектронноеПисьмо.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	ИсходящееЭлектронноеПисьмо.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ИсходящееЭлектронноеПисьмо.ОтправительПредставление = ?(ЗначениеЗаполнено(УчетнаяЗапись.ИмяПользователя), УчетнаяЗапись.ИмяПользователя + " <" + УчетнаяЗапись.АдресЭлектроннойПочты + ">", УчетнаяЗапись.АдресЭлектроннойПочты);
	
	МассивКонтрагентов = ПолучитьМассивКонтрагентовИзРезультата();
	
	Если МассивКонтрагентов.Количество() > 0 Тогда
				
		Для Каждого ЭлементМассива Из МассивКонтрагентов Цикл
			
			EmailКонтрагента = ПолучитьEmailКонтрагента(ЭлементМассива);
			Для Каждого Email Из EmailКонтрагента Цикл 
				
				НоваяСтрока = ИсходящееЭлектронноеПисьмо.ПолучателиПисьма.Добавить();

				НоваяСтрока.Контакт       = ЭлементМассива;
				НоваяСтрока.Адрес         = Email;
				НоваяСтрока.Представление = Строка(ЭлементМассива);
				ИсходящееЭлектронноеПисьмо.СписокПолучателейПисьма = ИсходящееЭлектронноеПисьмо.СписокПолучателейПисьма + "," + ЭлементМассива + " <" + Email + "> ";
	
			КонецЦикла;
			
		КонецЦикла;
		ИсходящееЭлектронноеПисьмо.Записать();
		ПараметрыОткрытия = Новый Структура("Ключ", ИсходящееЭлектронноеПисьмо.Ссылка);
		
	КонецЕсли;

	Возврат ПараметрыОткрытия;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает список доступных учетных записей.
//
Функция ПолучитьСписокДоступныхУчетныхЗаписей()
	
	ТЗУчетныеЗаписи = Справочники.УчетныеЗаписиЭлектроннойПочты.ВернутьУчетныеЗаписиЭлектроннойПочтыОбщиеИЛичные(ПараметрыСеанса.ТекущийПользователь, Ложь, Истина, Ложь, Истина);	
	Возврат ТЗУчетныеЗаписи.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить email контрагента
//
// Параметры:
//  Контрагент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьEmailКонтрагента(Контрагент) 
	
	EmailКонтрагента = Новый Массив;
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
			Отбор = Новый Структура("Вид, НеУчаствоватьВРассылке", Справочники.ВидыКонтактнойИнформации.EmailКлиента, Ложь);
		Иначе
			Отбор = Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонПользователя);
		КонецЕсли;
		НайденныеСтроки = Контрагент.КонтактнаяИнформация.НайтиСтроки(Отбор);
		
		Для Каждого Контакт Из НайденныеСтроки Цикл
			Если ЗначениеЗаполнено(Контакт.Представление) Тогда
				EmailКонтрагента.Добавить(Контакт.Представление);
			КонецЕсли;
		КонецЦикла;
				
	КонецЕсли;
	
	Возврат EmailКонтрагента;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, ЭтоНоменклатураГруппа.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Функция ЭтоНоменклатураГруппа(ЭлементОтбора)
	
	Возврат (ТипЗнч(ЭлементОтбора) = Тип("СправочникСсылка.Номенклатура") И ЭлементОтбора.ЭтоГруппа);

КонецФункции

&НаСервереБезКонтекста
Функция ВычислитьСуммуСервер(Знач ОтчетТабличныйДокумент, Знач ВыделенныеОбласти)
	Сумма = РассчитатьСуммуВыделенныхЯчеек(ОтчетТабличныйДокумент, ВыделенныеОбласти);
	Возврат Формат(Сумма, "ЧН=0");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РассчитатьСуммуВыделенныхЯчеек(ТабличныйДокумент, ВыделенныеОбласти)
	
	#Если Клиент Тогда
		ВыделенныеОбласти = ТабличныйДокумент.ВыделенныеОбласти;
	#КонецЕсли
	
	#Если Клиент И Не ТолстыйКлиентОбычноеПриложение Тогда
		КоличествоВыделенныхОбластей = ВыделенныеОбласти.Количество();
		Если КоличествоВыделенныхОбластей = 0 Тогда
			Возврат 0;
		ИначеЕсли КоличествоВыделенныхОбластей >= 100 Тогда
			Возврат Неопределено; // Нужен вызов сервера.
		КонецЕсли;
		КоличествоВыделенныхЯчеек = 0;
	#КонецЕсли
	
	Сумма = 0;
	ПроверенныеЯчейки = Новый Соответствие;
	
	Для Каждого ВыделеннаяОбласть Из ВыделенныеОбласти Цикл
		#Если Клиент Тогда
			Если ТипЗнч(ВыделеннаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
				Продолжить;
			КонецЕсли;
		#КонецЕсли
		
		ВыделеннаяОбластьВерх = ВыделеннаяОбласть.Верх;
		ВыделеннаяОбластьНиз = ВыделеннаяОбласть.Низ;
		ВыделеннаяОбластьЛево = ВыделеннаяОбласть.Лево;
		ВыделеннаяОбластьПраво = ВыделеннаяОбласть.Право;
		
		Если ВыделеннаяОбластьВерх = 0 Тогда
			ВыделеннаяОбластьВерх = 1;
		КонецЕсли;
		
		Если ВыделеннаяОбластьНиз = 0 Тогда
			ВыделеннаяОбластьНиз = ТабличныйДокумент.ВысотаТаблицы;
		КонецЕсли;
		
		Если ВыделеннаяОбластьЛево = 0 Тогда
			ВыделеннаяОбластьЛево = 1;
		КонецЕсли;
		
		Если ВыделеннаяОбластьПраво = 0 Тогда
			ВыделеннаяОбластьПраво = ТабличныйДокумент.ШиринаТаблицы;
		КонецЕсли;
		
		Если ВыделеннаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Колонки Тогда
			ВыделеннаяОбластьВерх = ВыделеннаяОбласть.Низ;
			ВыделеннаяОбластьНиз = ТабличныйДокумент.ВысотаТаблицы;
		КонецЕсли;
		
		ВыделеннаяОбластьВысота = ВыделеннаяОбластьНиз   - ВыделеннаяОбластьВерх;
		ВыделеннаяОбластьШирина = ВыделеннаяОбластьПраво - ВыделеннаяОбластьЛево;
		
		#Если Клиент И Не ТолстыйКлиентОбычноеПриложение Тогда
			КоличествоВыделенныхЯчеек = КоличествоВыделенныхЯчеек + ВыделеннаяОбластьШирина * ВыделеннаяОбластьВысота;
			Если КоличествоВыделенныхЯчеек >= 1000 Тогда
				Возврат Неопределено; // Нужен вызов сервера.
			КонецЕсли;
		#КонецЕсли
		
		Для НомерКолонки = ВыделеннаяОбластьЛево По ВыделеннаяОбластьПраво Цикл
			Для НомерСтроки = ВыделеннаяОбластьВерх По ВыделеннаяОбластьНиз Цикл
				Ячейка = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
				Если ПроверенныеЯчейки.Получить(Ячейка.Имя) = Неопределено Тогда
					ПроверенныеЯчейки.Вставить(Ячейка.Имя, Истина);
				Иначе
					Продолжить;
				КонецЕсли;
				
				Если Ячейка.Видимость = Истина Тогда
					Если Ячейка.СодержитЗначение И ТипЗнч(Ячейка.Значение) = Тип("Число") Тогда
						Сумма = Сумма + Ячейка.Значение;
					ИначеЕсли ЗначениеЗаполнено(Ячейка.Текст) Тогда
						Сумма = Сумма + СтрокаВЧисло(Ячейка.Текст);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Сумма;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтрокаВЧисло(ИсходнаяСтрока)
	// Превращает строку в число без вызова исключений. Стандартная функция преобразования
	//   Число() строго контролирует отсутствие каких-либо символов кроме числовых.
	
	Результат = 0;
	ЗнаковПослеЗапятой = -1;
	ЗнакОтрицательный = Ложь;
	Для НомерСимвола = 1 По СтрДлина(ИсходнаяСтрока) Цикл
		КодСимвола = КодСимвола(ИсходнаяСтрока, НомерСимвола);
		Если КодСимвола = 32 Или КодСимвола = 160 Тогда // Пробел или неразрывный пробел.
			// Пропуск (действие не требуется).
		ИначеЕсли КодСимвола = 45 Тогда // Минус
			Если Результат <> 0 Тогда
				Возврат 0;
			КонецЕсли;
			ЗнакОтрицательный = Истина;
		ИначеЕсли КодСимвола = 44 Или КодСимвола = 46 Тогда // Запятая или точка.
			ЗнаковПослеЗапятой = 0; // Запуск отсчета знаков после запятой.
		ИначеЕсли КодСимвола > 47 И КодСимвола < 58 Тогда // Число.
			Если ЗнаковПослеЗапятой <> -1 Тогда
				ЗнаковПослеЗапятой = ЗнаковПослеЗапятой + 1;
			КонецЕсли;
			Число = КодСимвола - 48;
			Результат = Результат * 10 + Число;
		Иначе
			Возврат 0;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗнаковПослеЗапятой > 0 Тогда
		Результат = Результат / Pow(10, ЗнаковПослеЗапятой);
	КонецЕсли;
	Если ЗнакОтрицательный Тогда
		Результат = -Результат;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
// Функция возвращает структуру, необходимую для заполнения документа "ЗаказПоставщику"
//
Функция ПолучитьСтруктуруДанных()
	
	ТаблицаКритическихОстатков = Новый ТаблицаЗначений;
	
	// Макет компоновки
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных, 
	Отчет.КомпоновщикНастроек.ПолучитьНастройки(), , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	// Компоновка данных
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

	// Вывод результата
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	// ПроцессорВывода.УстановитьОбъект(ТаблицаКритическихОстатков);
	ТаблицаКритическихОстатков = ПроцессорВывода.Вывести(ПроцессорКомпоновки); 
	
	// ТаблицаКритическихОстатков = ПолучитьТаблицуКритическихОстатков();
	
	// удаляем группы товаров из ТаблицаКритическихОстатков
	МассивУдалить = Новый Массив;
	Для каждого СтрокаТЗ из ТаблицаКритическихОстатков Цикл
		Если ЗначениеЗаполнено(СтрокаТЗ.Номенклатура) и СтрокаТЗ.Номенклатура.ЭтоГруппа тогда
			МассивУдалить.Добавить(СтрокаТЗ);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Строка из МассивУдалить Цикл
		ТаблицаКритическихОстатков.Удалить(Строка);
	КонецЦикла;
	
	// формируем структуру заполнения
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("ВидЦен", 				Справочники.ВидыЦен.Закупочная);
	СтруктураЗаполнения.Вставить("МассивСкладов",		ВернутьМассивСкладов(ТаблицаКритическихОстатков.Скопировать()));
	СтруктураЗаполнения.Вставить("МассивЗапасов", 		ОбщегоНазначенияКлиентСерверСтоматология.КонвертироватьТаблицуВМассивСтруктур(ТаблицаКритическихОстатков));
	СтруктураЗаполнения.Вставить("СтруктурнаяЕдиница", 	ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	Возврат СтруктураЗаполнения;

КонецФункции

&НаСервере
// Функция группирует таблицу остатков
//
Функция ПодготовимТаблицуЗапасов(ТаблицаКритическихОстатков)
	
	Если ТаблицаКритическихОстатков.Колонки.Найти("Номенклатура") <> Неопределено Тогда
		ТаблицаКритическихОстатков.Свернуть("Номенклатура", "Обеспечение, КоличествоУпаковокОбеспечения");		
		ТаблицаКритическихОстатков.Колонки.Добавить("Упаковка", 	Новый ОписаниеТипов("СправочникСсылка.УпаковкиНоменклатуры"));  // упаковка по умолчанию
		ТаблицаКритическихОстатков.Колонки.Добавить("СтавкаНДС", 	Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
		Для Каждого СтрокаТаблицы Из ТаблицаКритическихОстатков Цикл 
			Если ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) и НЕ СтрокаТаблицы.Номенклатура.ЭтоГруппа Тогда
				СтрокаТаблицы.Упаковка 						= СтрокаТаблицы.Номенклатура.УпаковкаПоУмолчанию;
				СтрокаТаблицы.КоличествоУпаковокОбеспечения = ?(СтрокаТаблицы.Номенклатура.УпаковкаПоУмолчанию.Коэффициент = 0, СтрокаТаблицы.Обеспечение / 1, СтрокаТаблицы.Обеспечение / СтрокаТаблицы.Номенклатура.УпаковкаПоУмолчанию.Коэффициент);
				СтрокаТаблицы.СтавкаНДС 					= СтрокаТаблицы.Номенклатура.СтавкаНДС;
			КонецЕсли;			
		КонецЦикла;
		
		Возврат ТаблицаКритическихОстатков;
	КонецЕсли;
	
КонецФункции

&НаСервере
// Функция возвращает массив складов
//
Функция ВернутьМассивСкладов(ТаблицаСкладов)

	МассивСкладов = Новый Массив;
	Если ТаблицаСкладов.Колонки.Найти("Склад") <> Неопределено Тогда
		ТаблицаСкладов.Свернуть("Склад");
		НайденнаяСтрока = ТаблицаСкладов.Найти(Неопределено);
		Если НайденнаяСтрока <> Неопределено Тогда 
			ТаблицаСкладов.Удалить(НайденнаяСтрока);
		КонецЕсли;	
		МассивСкладов = ТаблицаСкладов.ВыгрузитьКолонку("Склад");
	КонецЕсли;	
	
	Возврат МассивСкладов;
	
КонецФункции

&НаСервере
// Процедура выполняет получение настроек сотрудников
//
Функция ПолучитьСкладПоСотруднику(СтруктурнаяЕдиница, Сотрудник)
	
	Возврат ПользователиСтоматология.ПолучитьЗначениеПоУмолчаниюПользователя(Сотрудник, "Склад", СтруктурнаяЕдиница);	
			
КонецФункции

&НаСервере
// Функция возвращает элемент формы по имени поля настройки.
//
Функция НайтиЭлементФормыПоИмениПоляНастройки(Имя) 
	
	Элемент = Неопределено;
	
	Если ПоляНастроек = Неопределено Тогда
		Возврат Элемент;
	КонецЕсли;
	
	ЭлементыПолейНастроек = ПоляНастроек.ПолучитьЭлементы();
	Для Каждого ТекЭлемент Из ЭлементыПолейНастроек Цикл
		Если ТекЭлемент.Поле = Имя Тогда
			Для Каждого Стр Из ТекЭлемент.Реквизиты Цикл								
				Элемент = Элементы.Найти(Стр.Ключ);
			КонецЦикла;	
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Элемент;

КонецФункции

&НаКлиенте
Процедура ВыбратьВидЗадачиСделки(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыборВзаимодействиеЗадачаЗавершение", ЭтотОбъект);
	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора, Элементы.ВыбратьВидЗадачиСделки);

КонецПроцедуры

&НаКлиенте
// Процедура, обработка выбора результата завершение.
//
Процедура ВыборВзаимодействиеЗадачаЗавершение(Результат, ДопПараметры) Экспорт
	
	ЭтотОбъект.ВзаимодействиеПараметры = Неопределено;
	
	Если Результат <> Неопределено Тогда
		
		// Заполняем реквизит формы с произволным типом.
		ЭтотОбъект.ВзаимодействиеПараметры = Новый Структура;
		ЭтотОбъект.ВзаимодействиеПараметры.Вставить("Взаимодействие"   , Результат.Значение.Взаимодействие);
		ЭтотОбъект.ВзаимодействиеПараметры.Вставить("ВидВзаимодействия", Результат.Значение.ВидВзаимодействия);
		ЭтотОбъект.ВзаимодействиеПараметры.Вставить("ТемаПоУмолчанию"  , Результат.Значение.ТемаПоУмолчанию);
		ЭтотОбъект.ВзаимодействиеПараметры.Вставить("Представление"    , Результат.Представление);
		ЭтотОбъект.ВзаимодействиеПараметры.Вставить("Картинка"         , Результат.Картинка);
				
		Элементы.ВыбратьВидЗадачиСделки.Заголовок 			= Результат.Значение.ВидВзаимодействия; 
		Элементы.ДекорацияВзаимодействиеИконка.Картинка     = ЭтотОбъект.ВзаимодействиеПараметры.Картинка;
		
		// Установить тему по умолчанию.
		ЭтотОбъект.ВзаимодействиеЗадачаТема  = ЭтотОбъект.ВзаимодействиеПараметры.ТемаПоУмолчанию;
		ЭтотОбъект.ВзаимодействиеОписание = "";
		
		// Установить дату взаимодействия.
		ЭтотОбъект.ВзаимодействиеЗадачаДата = ПолучитьОкругленноеВремяВзаимодействия();	
		ВзаимодействиеЗадачаДатаПриИзмененииНаСервере();
		
		// Обновить режим напоминания взаимодействия.
		РежимНапоминанияПоУмолчанию = ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора[0];		
		
		ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания    = РежимНапоминанияПоУмолчанию.Значение;
		Элементы.ВзаимодействиеЗадачаНапоминание.Заголовок = РежимНапоминанияПоУмолчанию.Представление;

		СменитьФокусЭлементаНаКлиенте();
		Элементы.ГруппаВзаимодействиеЗадачаВсплывающая.Показать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВзаимодействиеЗадачаРежимНапоминания(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыборРежимаНапоминанияЗавершение", ЭтотОбъект);
	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора, Элементы.ВзаимодействиеЗадачаНапоминание);	

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды завершение "ВыборРежимаНапоминанияЗавершение".
//
Процедура ВыборРежимаНапоминанияЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания    = Результат.Значение;
		Элементы.ВзаимодействиеЗадачаНапоминание.Заголовок = Результат.Представление; 
		СменитьФокусЭлементаНаКлиенте();
		Элементы.ГруппаВзаимодействиеЗадачаВсплывающая.Показать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияДобавить(Команда)
	
	НоваяСтрока = ЭтотОбъект.ТаблицаДействия.Добавить();	
	Элементы.ТаблицаДействия.ТекущаяСтрока = ЭтотОбъект.ТаблицаДействия.Индекс(НоваяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ДействияУдалить(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаДействия.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		ЭтотОбъект.ТаблицаДействия.Удалить(ТекущиеДанные);
		ЗаполнитьПроцентомСтрокиТЗ();

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДействияПроцентПриИзменении(Элемент)
	
	СуммаПроцентов   = ЭтотОбъект.ТаблицаДействия.Итог("Пропорция");
	ОстатокПроцентов = 100 - СуммаПроцентов;
	
	ЭтотОбъект.ОстаточныйПроцентОтДеления = ОстатокПроцентов;
	СменитьФокусЭлементаНаКлиенте();
	Элементы.ГруппаВзаимодействиеЗадачаВсплывающая.Показать();

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДействияСотрудникПриИзменении(Элемент)
	
	ЗаполнитьПроцентомСтрокиТЗ();

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДействияСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	МассивСтрок = ЭтотОбъект.ТаблицаДействия.НайтиСтроки(Новый Структура("Сотрудник", ВыбранноеЗначение));
	Если МассивСтрок.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(, НСтр("ru='Этот сотрудник уже есть в списке.';en='This employee already there is in the list.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВзаимодействиеСоздать(Команда)
	
	// Проверяем процент между сотрудниками. Требуется что бы между исполнителями суммарно было 100%.
	Если ЭтотОбъект.ОстаточныйПроцентОтДеления > 0 Тогда
		ПоказатьПредупреждение(,СтрШаблон(НСтр("ru = 'Распределите %1 между исполнителями.'; en = 'Distribute %1 among the performers.'"), ЭтотОбъект.ОстаточныйПроцентОтДеления + "%"));
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.СоздатьЗадачу Тогда
		
		// Проверяем прозивольный реквизит формы, на заполненные значения.
		Если ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеПараметры) 
			И ЭтотОбъект.ВзаимодействиеПараметры.Свойство("ВидВзаимодействия")
			И ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеПараметры.ВидВзаимодействия)
			И ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеЗадачаТема)
			И ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеЗадачаДата) Тогда
			
			ВопросПередСозданием();
		Иначе
			ПоказатьПредупреждение(,НСтр("ru='Не заполнены данные взаимодействия!';en='Not populated with data interactions!'"));
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ВидСделки) Тогда
			ВопросПередСозданием();
		Иначе
			ПоказатьПредупреждение(,НСтр("ru='Не заполнены данные взаимодействия!';en='Not populated with data interactions!'"));
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 
