
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВариантыРасположенияСервераСЛК = Элементы.РасположениеСервера.СписокВыбора;
	ВариантыРасположенияСервераСЛК.Очистить();
	ВариантыРасположенияСервераСЛК.Добавить(Истина, ?(ОбщегоНазначения.ИнформационнаяБазаФайловая(), "Локально, на этом компьютере", "На сервере"));
	ВариантыРасположенияСервераСЛК.Добавить(Ложь, "Другой компьютер сети");
	
	ПроинициализироватьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура РасположениеСервераПриИзменении(Элемент)
	
	Если ЛокальныйСервер Тогда
		Хост = "localhost";
	Иначе
	    Хост = ЗащитаКлиентСервер.ПолучитьЗначениеИзСтрокиПараметровПодключения("host");
	КонецЕсли;
	
	УправлениеОтображениемЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Если проверка лицензии прошла успешно, автоматически закрываем форму
	Если Результат Тогда
		ПодключитьОбработчикОжидания("ЗакрытьФормуУспех", 1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРезультата = ЗащитаСервер.Запуск();
	ПроинициализироватьФорму(СтруктураРезультата);
	Если ТипЗнч(СтруктураРезультата) = Тип("Структура") и СтруктураРезультата.Свойство("РезультатПроверки") и СтруктураРезультата.РезультатПроверки = Ложь Тогда 
		
		ЗавершитьРаботуСистемы(Ложь);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПовторноПроверитьЛицензию(Команда)
	
	ПовторноПроверитьЛицензию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторноПроверитьЛицензию()
	
	Элементы.СтраницыПредупреждений.ТекущаяСтраница = Элементы.СтраницаДлительнойОперации;
	
	ПовторноПроверитьЛицензиюНаСервере();
	
	Если Результат Тогда
		ПодключитьОбработчикОжидания("ЗакрытьФормуУспех", 1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКЗагрузкеСЛК(Команда)
	
	// Открываем форму обновления СЛК
	СтруктураПараметров = Новый Структура("Результат, ТекстПредупреждения", Результат, ТекстПредупреждения);
	ОткрытьФорму("ОбщаяФорма.ОбновлениеСЛК", СтруктураПараметров,,,,, Новый ОписаниеОповещения("ПерейтиКЗагрузкеСЛКЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
	
КонецПроцедуры

// Процедура - Перейти к загрузке СЛКЗавершение
//
// Параметры:
//  Результат				 - 	 Результат Оповещения
//  ДополнительныеПараметры	 - 	 Параметры Оповещения 
//
&НаКлиенте
Процедура ПерейтиКЗагрузкеСЛКЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	РезультатУстановкиСЛК = Результат;
	#Если НЕ ВебКлиент Тогда
	Если ТипЗнч(РезультатУстановкиСЛК) = Тип("Булево") И РезультатУстановкиСЛК = Истина Тогда
		ЗапуститьСистему();	// Перезапускаем конфигурацию
		Закрыть();
	КонецЕсли;
	#КонецЕсли
	
	ПовторноПроверитьЛицензию();
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПовторноПроверитьЛицензиюНаСервере()
	
	СохранитьПараметрыСоединенияСЛК();
	СтруктураРезультата = ЗащитаСервер.Запуск();
	ПроинициализироватьФорму(СтруктураРезультата);
	
КонецПроцедуры

&НаСервере
Процедура ПроинициализироватьФорму(СтруктураПараметров = Неопределено)
	
	Если СтруктураПараметров = Неопределено Тогда
		СтруктураПараметров = Параметры;
		Если НЕ Параметры.Свойство("РезультатПроверки") Тогда
			СтруктураПараметров = ЗащитаСервер.Запуск();
		КонецЕсли;
	КонецЕсли;
	
	Результат = СтруктураПараметров.РезультатПроверки;
	ТекстПредупреждения = СтруктураПараметров.ТекстПредупреждения;
	ИнформацияДляТехПоддержки = ДополнитьОписаниеОшибки(ТекстПредупреждения);
	
	Хост = ЗащитаКлиентСервер.ПолучитьЗначениеИзСтрокиПараметровПодключения("host");
	Порт = ЗащитаКлиентСервер.ПолучитьЗначениеИзСтрокиПараметровПодключения("port");
	
	ЛокальныйСервер = (Хост = "localhost");
	
	УправлениеОтображениемЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьПараметрыСоединенияСЛК()
	
	ЗначениеКонстанты = "host="
						+ ?(ЗначениеЗаполнено(Хост), Хост, "localhost")
						+ ?(ЗначениеЗаполнено(Порт), ";port=" + Порт, "");
	
	Константы.ПараметрыСоединенияСЛК.Установить(ЗначениеКонстанты);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеОтображениемЭлементов()
	
	Страницы = Элементы.СтраницыПредупреждений;
	
	Если Результат = Истина Тогда
		Страницы.ТекущаяСтраница = Страницы.ПодчиненныеЭлементы.СтраницаУспешнойПроверки;
	ИначеЕсли ЗащитаКлиентСервер.ЭтоОшибкаОбОтсутствииСервера(ТекстПредупреждения) Тогда
		Страницы.ТекущаяСтраница = Страницы.ПодчиненныеЭлементы.СтраницаПредупрежденияОНеустановленномСервере;
	ИначеЕсли ЗащитаКлиентСервер.ЭтоОшибкаОНесоответствииВерсий(ТекстПредупреждения) Тогда
		Страницы.ТекущаяСтраница = Страницы.ПодчиненныеЭлементы.СтраницаПредупрежденияОНеобходимостиОбновления;
	Иначе
		Страницы.ТекущаяСтраница = Страницы.ПодчиненныеЭлементы.СтраницаОбщегоПредупреждения;
	КонецЕсли;
	
	Если Результат Тогда
		Элементы.ГруппаНастройкиПараметров.Видимость = Ложь;
		Элементы.ГруппаТехническойИнформации.Видимость = Ложь;
	Иначе
		Элементы.ГруппаПараметров.Доступность = НЕ ЛокальныйСервер;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуУспех()
	
	Закрыть(Истина);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//
// Функция ОпределитьВерсиюСервераСЛК
//
// Описание: Функция определяет текущую версию сервера СЛК
// Примечание: сейчас у Катрана предусмотрен только метод для получения версии внешней компоненты.
//             Версию сервера, по их же словам, можно определить только из текста ошибки о несоответствии версий.
//
// Возвращаемое значение: (Строка) версия сервера СЛК
//
Функция ОпределитьВерсиюСервераСЛК(Знач ТекстОшибкиСЛК)
	
	Если НЕ ЗащитаКлиентСервер.ЭтоОшибкаОНесоответствииВерсий(ТекстОшибкиСЛК) Тогда
		Возврат "";
	КонецЕсли;               
	
	ТекстОшибкиСЛК = СтрЗаменить(ТекстОшибкиСЛК, "Версия сервера ", "");
	НайденныйТекст = Найти(ТекстОшибкиСЛК, " не соответствует версии клиента");
	
	Возврат Лев(ТекстОшибкиСЛК, НайденныйТекст-1);
	
КонецФункции //ОпределитьВерсиюСервераСЛК
 
////////////////////////////////////////////////////////////////////////////////
//
// Функция ДополнитьОписаниеОшибки
//
// Описание: Дополняет переданное в качестве параметра описание ошибки
//			 дополнительными данными
//
//
// Параметры
//		ОписаниеОшибки - строка - текст, содержащий описание ошибки, которое необходимо дополнить
//
// Возвращаемое значение: Строка, содержащая дополненное описание ошибки
//
Функция ДополнитьОписаниеОшибки(Знач ОписаниеОшибки)
	
	СисИнфо = Новый СистемнаяИнформация;
	ВерсияСервераСЛК = ОпределитьВерсиюСервераСЛК(ОписаниеОшибки);
	
	ОписаниеОшибки = "Сообщение от сервера СЛК: " + ОписаниеОшибки;
	ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + Символы.ПС;
	ОписаниеОшибки = ОписаниеОшибки + "---------------------------------" + Символы.ПС;
	ОписаниеОшибки = ОписаниеОшибки + "Версия сервера СЛК: " + ВерсияСервераСЛК + Символы.ПС;
	ОписаниеОшибки = ОписаниеОшибки + "Версия внешней компоненты: " + ЗащитаСервер.Версия(Истина) + Символы.ПС;
	ОписаниеОшибки = ОписаниеОшибки + "Расположение сервера СЛК: " + ?(ЗащитаКлиентСервер.ПолучитьЗначениеИзСтрокиПараметровПодключения("host") = "localhost", "Локально", "Удалённо") + Символы.ПС;
	ОписаниеОшибки = ОписаниеОшибки + "Тип ИБ: " + ?(ОбщегоНазначения.ИнформационнаяБазаФайловая(), "Файловая", "Клиент-сервер") + Символы.ПС;
	ОписаниеОшибки = ОписаниеОшибки + "Версия платформы: " + СисИнфо.ВерсияПриложения + Символы.ПС;
	ОписаниеОшибки = ОписаниеОшибки + "Версия ОС: " + СисИнфо.ВерсияОС;
	
	Возврат ОписаниеОшибки;
	
КонецФункции //ДополнитьОписаниеОшибки

&НаКлиенте
Процедура СкопироватьВБуфер(Команда)
	ОбщегоНазначенияКлиент.УстановитьТекстВБуферОбмена(ИнформацияДляТехПоддержки);
	ПоказатьОповещениеПользователя("Текст скопирован в буфер обмена.");
КонецПроцедуры

#КонецОбласти
