
#Область ________________________________ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ___________________________________

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТипКанала"					, ТипКанала);		
	Параметры.Свойство("ИдентификаторДействия"		, ИдентификаторДействия);	
	Параметры.Свойство("ТекущаяСтруктурнаяЕдиница"	, ТекущаяСтруктурнаяЕдиница);
	Параметры.Свойство("ПараметрыДействия"			, ПараметрыДействия);
	Если Параметры.Свойство("МоделируемыеНастройкиКаналовУведомлений") Тогда 
		МоделируемыеНастройкиКаналовУведомлений.Загрузить(ПреобразоватьМассивСтруктурВТаблицуЗначений(Параметры.МоделируемыеНастройкиКаналовУведомлений));
	КонецЕсли;	
	Если Параметры.Свойство("ТаблицаВнешнихСистем") Тогда 
		ТаблицаВнешнихСистем.Загрузить(ПреобразоватьМассивСтруктурВТаблицуЗначений(Параметры.ТаблицаВнешнихСистем));
	КонецЕсли;	
	
	Элементы.ГруппаДляПолученияИнтервала_Шаблон_.ВертикальныйИнтервал = ?(МоделируемыеНастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия", ИдентификаторДействия)).Количество() > 9, ИнтервалМеждуЭлементамиФормы.Половинный, ИнтервалМеждуЭлементамиФормы.Одинарный);
	
	// Определяем родительские группы
	ГруппаРазмещенияНастроек		= Элементы.Найти("ГруппаНастройкиКаналовУведомлений");
	ГруппаРазмещенияНастроекШаблон 	= Элементы.Найти("ГруппаНастройкиКаналовУведомлений_Шаблон_");
	
	// Обновим текущие настройки
	Если НЕ ГруппаРазмещенияНастроек = Неопределено Тогда 
		// Очищаем родительские группы					
		ТриггерныеСобытия.УдалитьЭлементыГруппы(ЭтотОбъект, ГруппаРазмещенияНастроек);
		// Создаем элементы
		ТриггерныеСобытия.ОбновитьЭлементыНастроекКаналовУведомленийНаФормеСогласноШаблона(ЭтотОбъект, ГруппаРазмещенияНастроек, ГруппаРазмещенияНастроекШаблон);
		// Отключаем видимость у шаблона
		ГруппаРазмещенияНастроекШаблон.Видимость = Ложь;
		//Форма.УстановитьСвойстваЭлементамДействий();
	КонецЕсли;
	
	Если ТипКанала = "Push" Тогда 
		ЭтаФорма.Заголовок = Нстр("ru = 'Настройки Push уведомлений'; en = 'Push Notification Settings'");
	ИначеЕсли ТипКанала = "PushWallet" Тогда 
		ЭтаФорма.Заголовок = Нстр("ru = 'Настройки Push (Wallet) уведомлений'; en = 'Push (Wallet) Notification Settings'");	
	ИначеЕсли ТипКанала = "Messenger" Тогда 
		ЭтаФорма.Заголовок = Нстр("ru = 'Настройки уведомлений в мессенджер'; en = 'Notification settings in Messenger'");	
	ИначеЕсли ТипКанала = "SMS" Тогда 
		ЭтаФорма.Заголовок = Нстр("ru = 'Настройки уведомлений по SMS'; en = 'SMS Notification Settings'");			
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти

#Область ________________________________ОБРАБОТЧИКИ_КОМАНД_ФОРМЫ____________________________________

&НаКлиенте
// Процедура - Применить настройки каналов уведомлений
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПрименитьНастройкиКаналовУведомлений(Команда)
	
	СтруктураНастроек = Новый Структура();
	СтруктураНастроек.Вставить("ТипКанала"									, ТипКанала);
	СтруктураНастроек.Вставить("ИдентификаторДействия"						, ИдентификаторДействия);
	СтруктураНастроек.Вставить("МоделируемыеНастройкиКаналовУведомлений"	, ТаблицуЗначенийВМассивСтруктур(МоделируемыеНастройкиКаналовУведомлений, ИменаКолонокМоделируемойТаблицы()));
	
	Закрыть(СтруктураНастроек);
	
КонецПроцедуры

#КонецОбласти

#Область ____________________________ОБРАБОТКА_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ_______________________________

&НаКлиенте
// Процедура - Подключаемый отправка push поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ОтправкаPush_Поле_ПриИзменении(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, , "МоделируемыеНастройкиКаналовУведомлений");
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамАккаунтаСообщения(, СтруктураДанныеЭлемента.ИндексСтроки);
		ЭлементФормы = Элементы.Найти("ОтправкаPush_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки + 1));
		Если НЕ ЭлементФормы = Неопределено Тогда 			
			ЭтаФорма.ТекущийЭлемент = ЭлементФормы;		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый отправка push wallet поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ОтправкаPushWallet_Поле_ПриИзменении(Элемент)

	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, , "МоделируемыеНастройкиКаналовУведомлений");
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамАккаунтаСообщения(, СтруктураДанныеЭлемента.ИндексСтроки);
		ЭлементФормы = Элементы.Найти("ОтправкаPushWallet_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки + 1));
		Если НЕ ЭлементФормы = Неопределено Тогда 			
			ЭтаФорма.ТекущийЭлемент = ЭлементФормы;		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый отправка messenger поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ОтправкаMessenger_Поле_ПриИзменении(Элемент)

	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, , "МоделируемыеНастройкиКаналовУведомлений");
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамАккаунтаСообщения(, СтруктураДанныеЭлемента.ИндексСтроки);
		Если ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.АккаунтВнешнейСистемы) Тогда 
			Если СтруктураДанныеЭлемента.ДанныеЭлемента.СписокАккаунтовMessenger.НайтиПоЗначению(СтруктураДанныеЭлемента.ДанныеЭлемента.АккаунтВнешнейСистемы) = Неопределено Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = 'Указан не корректный аккаунт'; en = 'The specified account is not correct'"), ЭтотОбъект, "МоделируемыеНастройкиКаналовУведомлений[" + Строка(СтруктураДанныеЭлемента.ИндексСтроки) + "].АккаунтВнешнейСистемы");
			КонецЕсли;
		КонецЕсли;	
		ЭлементФормы = Элементы.Найти("АккаунтСообщенийМессенджера_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
		Если НЕ ЭлементФормы = Неопределено Тогда 			
			ЭтаФорма.ТекущийЭлемент = ЭлементФормы;		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый отправка SMS поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ОтправкаSMS_Поле_ПриИзменении(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, , "МоделируемыеНастройкиКаналовУведомлений");
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамАккаунтаСообщения(, СтруктураДанныеЭлемента.ИндексСтроки);
		ЭлементФормы = Элементы.Найти("АккаунтСообщений_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
		Если НЕ ЭлементФормы = Неопределено Тогда 			
			ЭтаФорма.ТекущийЭлемент = ЭлементФормы;		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый аккаунт сообщений мессенджера поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_АккаунтСообщенийМессенджера_Поле_ПриИзменении(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, , "МоделируемыеНастройкиКаналовУведомлений");
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамАккаунтаСообщения(, СтруктураДанныеЭлемента.ИндексСтроки);
		Если ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.АккаунтВнешнейСистемы) Тогда 
			ТипВнешнейСистемы = Неопределено;
			Для Каждого СтрокаВнешняяСистема Из ТаблицаВнешнихСистем Цикл 
				Если СтрокаВнешняяСистема.Ссылка = СтруктураДанныеЭлемента.ДанныеЭлемента.АккаунтВнешнейСистемы Тогда 
					ТипВнешнейСистемы = СтрокаВнешняяСистема.ТипВнешнейСистемы;
					Прервать;
				КонецЕсли;				
			КонецЦикла;	
			Если НЕ ЗначениеЗаполнено(ТипВнешнейСистемы) Тогда 
				ТипВнешнейСистемы = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтруктураДанныеЭлемента.ДанныеЭлемента.АккаунтВнешнейСистемы, "ТипВнешнейСистемы");
			КонецЕсли;
			Если ТипВнешнейСистемы = ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.Chat2Desk") Тогда 
				ЭлементФормы = Элементы.Найти("КаналСистемыСообщений_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
				Если НЕ ЭлементФормы = Неопределено Тогда 			
					ЭтаФорма.ТекущийЭлемент = ЭлементФормы;		
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый аккаунт сообщений поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_АккаунтСообщений_Поле_ПриИзменении(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, , "МоделируемыеНастройкиКаналовУведомлений");
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамАккаунтаСообщения(, СтруктураДанныеЭлемента.ИндексСтроки);
		Если ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.АккаунтСервисаРассылкиSMS) Тогда 		
			ЭлементФормы = Элементы.Найти("ОтправкаSMS_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки + 1));
			Если НЕ ЭлементФормы = Неопределено Тогда 			
				ЭтаФорма.ТекущийЭлемент = ЭлементФормы;		
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ______________________________СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ_________________________________

&НаСервере
// Функция - Преобразовать массив структур в таблицу значений
//
// Параметры:
//  МассивДанных - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПреобразоватьМассивСтруктурВТаблицуЗначений(МассивДанных)

	// Создадим структуру колонок с типами так как сменить тип колонки в ТЗ не получиться
	СтруктураКолонок = Новый Структура;
	
	Для Каждого ЭлементМассива Из МассивДанных Цикл
		// Ввиду того что массив может попасться разноколоночны нужно проверять не только первую строку.
		// А также, если типы отличаются в разных элементах массива, нужно иметь возможность получить читабельную ТЗ.
		Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
			ТипЗначенияКолонки = ТипЗнч(ЗначениеСтруктуры.Значение);
			Если НЕ СтруктураКолонок.Свойство(ЗначениеСтруктуры.Ключ) Тогда
				МассивДопустимыеТипы = Новый Массив;
				МассивДопустимыеТипы.Добавить(ТипЗначенияКолонки);
				СтруктураКолонок.Вставить(ЗначениеСтруктуры.Ключ, МассивДопустимыеТипы);
			Иначе
				СодержитТип = СтруктураКолонок[ЗначениеСтруктуры.Ключ].Найти(ТипЗначенияКолонки);
				Если СодержитТип = Неопределено Тогда
					СтруктураКолонок[ЗначениеСтруктуры.Ключ].Добавить(ТипЗначенияКолонки)
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Создадим ТЗ
	ТаблицаЗначенийДанные = Новый ТаблицаЗначений;
	
	// Добавим Колонки в ТЗ
	Для Каждого Колонка Из СтруктураКолонок Цикл
		ТаблицаЗначенийДанные.Колонки.Добавить(Колонка.Ключ, Новый ОписаниеТипов(Колонка.Значение));		
	КонецЦикла;
	
	// Теперь можно обработать нормально массив
	Для Каждого ЭлементМассива Из МассивДанных Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаЗначенийДанные.Добавить(), ЭлементМассива);
	КонецЦикла;
	
	Возврат ТаблицаЗначенийДанные;

КонецФункции

&НаСервере
// Процедура - Установить свойства элементам аккаунта сообщения
//
// Параметры:
//  ЭлементФормы					 - 	 - 
//  ИндексСтроки					 - 	 - 
//  ПараметрыОтображенияЭлементов	 - 	 - 
//
Процедура УстановитьСвойстваЭлементамАккаунтаСообщения(Знач ЭлементФормы = Неопределено, ИндексСтроки, Знач ПараметрыОтображенияЭлементов = Неопределено) Экспорт
	
	ПоискЭлемента = ?(ЭлементФормы = Неопределено, Истина, Ложь);
	ПараметрыОтображенияЭлементов = МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].ПараметрыОтрисовки;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ГруппаОтправкаMessenger_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;	
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ГруппаОтправкаMessenger_Индекс_" + Строка(ИндексСтроки) Тогда 		
			ЭлементФормы.Видимость = ТипКанала = "Messenger";
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ГруппаОтправкаSMS_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;	
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ГруппаОтправкаSMS_Индекс_" + Строка(ИндексСтроки) Тогда 		
			ЭлементФормы.Видимость = ТипКанала = "SMS";
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ОтправкаPush_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;			
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ОтправкаPush_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Видимость = ТипКанала = "Push";
			ЭлементФормы.Доступность = ПараметрыОтображенияЭлементов.ПараметрыРассылки.ОтправкаPush И (ПараметрыДействия.ВидАдресата = Перечисления.ВидыАдресатов.КонтрагентСобытия ИЛИ НЕ ЗначениеЗаполнено(ПараметрыДействия.ВидАдресата));
			ЭлементФормы.Заголовок = ?(ЭлементФормы.Доступность, Нстр("ru = 'Push уведомления'; en = 'Push notifications'"), Нстр("ru = 'Push уведомления (не доступно)'; en = 'Push notifications (not available)'"));
			ЭлементФормы.ЦветТекстаЗаголовка = ?(МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].ОтправкаPush, Новый Цвет(), Новый Цвет(153, 153, 153));
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;				
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ОтправкаPushWallet_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;			
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ОтправкаPushWallet_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Видимость = ТипКанала = "PushWallet";			
			ЭлементФормы.Доступность = ПараметрыОтображенияЭлементов.ПараметрыРассылки.ОтправкаPushWallet И (ПараметрыДействия.ВидАдресата = Перечисления.ВидыАдресатов.КонтрагентСобытия ИЛИ НЕ ЗначениеЗаполнено(ПараметрыДействия.ВидАдресата));
			ЭлементФормы.Заголовок = ?(ЭлементФормы.Доступность, Нстр("ru = 'Push (Wallet) уведомления'; en = 'Push (Wallet) notifications'"), Нстр("ru = 'Push (Wallet) уведомления (не доступно)'; en = 'Push (Wallet) notifications (not available)'"));
			ЭлементФормы.ЦветТекстаЗаголовка = ?(МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].ОтправкаPushWallet, Новый Цвет(), Новый Цвет(153, 153, 153));
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;				
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ОтправкаMessenger_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;			
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ОтправкаMessenger_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Видимость = ТипКанала = "Messenger";						
			ЭлементФормы.Доступность = ПараметрыОтображенияЭлементов.ПараметрыРассылки.ОтправкаMessenger И ПараметрыДействия.ВидАдресата <> Перечисления.ВидыАдресатов.СегментСотрудников;
			//ЭлементФормы.Заголовок = ?(ЭлементФормы.Доступность, Нстр("ru = 'Уведомления в мессенджер'; en = 'Notifications in messenger'"), Нстр("ru = 'Уведомления в мессенджер (не доступно)'; en = 'Notifications in messenger (not available)'"));
			ЭлементФормы.ЦветТекстаЗаголовка = ?(МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].ОтправкаMessenger, Новый Цвет(), Новый Цвет(153, 153, 153));
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;				
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ОтправкаSMS_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;			
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ОтправкаSMS_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Видимость = ТипКанала = "SMS";									
			ЭлементФормы.Доступность = ПараметрыОтображенияЭлементов.ПараметрыРассылки.ОтправкаSMS;
			ЭлементФормы.Заголовок = ?(ЭлементФормы.Доступность, Нстр("ru = 'Уведомления по sms'; en = 'SMS notifications'"), Нстр("ru = 'Уведомления по sms (не доступно)'; en = 'SMS notifications (not available)'"));
			ЭлементФормы.ЦветТекстаЗаголовка = ?(МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].ОтправкаSMS, Новый Цвет(), Новый Цвет(153, 153, 153));
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;				
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("СтруктурнаяЕдиница_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;		
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "СтруктурнаяЕдиница_Индекс_" + Строка(ИндексСтроки) Тогда
			Если ТипКанала = "Push" Тогда 
				ЭлементФормы.Доступность = МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].ОтправкаPush И ПараметрыОтображенияЭлементов.ПараметрыРассылки.ОтправкаPush;
			ИначеЕсли ТипКанала = "PushWallet" Тогда 
				ЭлементФормы.Доступность = МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].ОтправкаPushWallet И ПараметрыОтображенияЭлементов.ПараметрыРассылки.ОтправкаPushWallet;
			ИначеЕсли ТипКанала = "Messenger" Тогда 	
				ЭлементФормы.Доступность = МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].ОтправкаMessenger И ПараметрыОтображенияЭлементов.ПараметрыРассылки.ОтправкаMessenger;
			ИначеЕсли ТипКанала = "SMS" Тогда 
				ЭлементФормы.Доступность = МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].ОтправкаSMS И ПараметрыОтображенияЭлементов.ПараметрыРассылки.ОтправкаSMS;
			КонецЕсли;
			ЭлементФормы.ЦветТекста = ?(ЭлементФормы.Доступность И МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].СтруктурнаяЕдиница = ТекущаяСтруктурнаяЕдиница, Новый Цвет(28, 85, 174), Новый Цвет());
		КонецЕсли;	
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("АккаунтСообщенийМессенджера_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;		
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "АккаунтСообщенийМессенджера_Индекс_" + Строка(ИндексСтроки) Тогда 		
			ЭлементФормы.Доступность 		= МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].ОтправкаMessenger И ПараметрыОтображенияЭлементов.ПараметрыРассылки.ОтправкаMessenger;// Объект.Действия[ИндексСтроки].ОтправкаMessenger И ПараметрыОтображенияЭлементов.ПараметрыРассылки.ОтправкаMessenger;
			ТипВнешнейСистемы 				= Перечисления.ТипыВнешнихСистем.ПустаяСсылка(); 
			Если ЗначениеЗаполнено(МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].АккаунтВнешнейСистемы) Тогда 
				МассивСтрокВнешниСистем = ТаблицаВнешнихСистем.НайтиСтроки(Новый Структура("Ссылка", МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].АккаунтВнешнейСистемы));
				Если НЕ МассивСтрокВнешниСистем.Количество() = 0 Тогда 
					ТипВнешнейСистемы = МассивСтрокВнешниСистем[0].ТипВнешнейСистемы;
				Иначе 
					ТипВнешнейСистемы = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].АккаунтВнешнейСистемы, "ТипВнешнейСистемы");
				КонецЕсли;
			КонецЕсли;
			ЭлементФормы.Ширина = ?(ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Chat2Desk, 37, 87); 			
			ЭлементФормы.МаксимальнаяШирина = ?(ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Chat2Desk, 37, 87); 
			ЭлементФормы.ОтметкаНезаполненного = ЭлементФормы.Доступность И НЕ ЗначениеЗаполнено(МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].АккаунтВнешнейСистемы);
			ЭлементФормы.АвтоОтметкаНезаполненного = ЭлементФормы.Доступность И НЕ ЗначениеЗаполнено(МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].АккаунтВнешнейСистемы);				
			ЭлементФормы.СписокВыбора.Очистить();
			Для Каждого АккаунтСистемыОтправки Из МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].СписокАккаунтовMessenger Цикл 
				ЗаполнитьЗначенияСвойств(ЭлементФормы.СписокВыбора.Добавить(), АккаунтСистемыОтправки);
			КонецЦикла;	
			Если ЗначениеЗаполнено(МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].АккаунтВнешнейСистемы) Тогда
				ЭлементСписка = ЭлементФормы.СписокВыбора.НайтиПоЗначению(МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].АккаунтВнешнейСистемы);
				Если ЭлементСписка = Неопределено Тогда
					ЭлементФормы.СписокВыбора.Добавить(МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].АккаунтВнешнейСистемы, Новый ФорматированнаяСтрока("Аккаунт деактивирован (" + СокрЛП(Строка(МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].АккаунтВнешнейСистемы)) + ")", , Новый Цвет(255, 0, 0)), Истина);						
				Иначе
					ЭлементСписка.Пометка = Истина;
				КонецЕсли;	
			КонецЕсли;
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("АккаунтСообщений_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;		
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "АккаунтСообщений_Индекс_" + Строка(ИндексСтроки) Тогда 		
			ЭлементФормы.Доступность 				= МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].ОтправкаSMS И ПараметрыОтображенияЭлементов.ПараметрыРассылки.ОтправкаSMS;				
			ЭлементФормы.ОтметкаНезаполненного 		= ЭлементФормы.Доступность И НЕ ЗначениеЗаполнено(МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].АккаунтСервисаРассылкиSMS);
			ЭлементФормы.АвтоОтметкаНезаполненного 	= ЭлементФормы.Доступность И НЕ ЗначениеЗаполнено(МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].АккаунтСервисаРассылкиSMS);					
			ЭлементФормы.СписокВыбора.Очистить();
			Для Каждого АккаунтСистемыОтправки Из МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].СписокАккаунтовSMS Цикл 
				ЗаполнитьЗначенияСвойств(ЭлементФормы.СписокВыбора.Добавить(), АккаунтСистемыОтправки);						
			КонецЦикла;	
			Если ЗначениеЗаполнено(МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].АккаунтСервисаРассылкиSMS) Тогда
				ЭлементСписка = ЭлементФормы.СписокВыбора.НайтиПоЗначению(МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].АккаунтСервисаРассылкиSMS);
				Если ЭлементСписка = Неопределено Тогда
					ЭлементФормы.СписокВыбора.Добавить(МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].АккаунтСервисаРассылкиSMS, Новый ФорматированнаяСтрока("Аккаунт деактивирован (" + СокрЛП(Строка(МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].АккаунтСервисаРассылкиSMS)) + ")", , Новый Цвет(255, 0, 0)), Истина);						
				Иначе
					ЭлементСписка.Пометка = Истина;
				КонецЕсли;	
			КонецЕсли;
			ЭлементФормы.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СервисыРассылки");				
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("КаналСистемыСообщений_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;				
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "КаналСистемыСообщений_Индекс_" + Строка(ИндексСтроки) Тогда 				
			ЗаполнитьСписокКаналовСистемыСообщения(ЭлементФормы, ИндексСтроки, МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки]);
			ЭлементФормы.Доступность = МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки].ОтправкаMessenger И ПараметрыОтображенияЭлементов.ПараметрыРассылки.ОтправкаMessenger;				
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция - Имена колонок моделируемой таблицы
//
// Параметры:
//  КолонкиСКоллекциями	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИменаКолонокМоделируемойТаблицы(КолонкиСКоллекциями = Истина)
	
	Если КолонкиСКоллекциями Тогда 
		Возврат "ИдентификаторДействия, СтруктурнаяЕдиница, ОтправкаPush, ОтправкаPushWallet, ОтправкаMessenger, ОтправкаSMS, АккаунтВнешнейСистемы, АккаунтСервисаРассылкиSMS, КаналСистемыСообщений, СписокАккаунтовPush, СписокАккаунтовPushWallet, СписокАккаунтовMessenger, СписокАккаунтовSMS, ПредставлениеСтруктурнойЕдиницы";
	Иначе 
		Возврат "ИдентификаторДействия, СтруктурнаяЕдиница, ОтправкаPush, ОтправкаPushWallet, ОтправкаMessenger, ОтправкаSMS, АккаунтВнешнейСистемы, АккаунтСервисаРассылкиSMS, КаналСистемыСообщений, ПредставлениеСтруктурнойЕдиницы";
	КонецЕсли;	
	
КонецФункции

&НаСервере
// Процедура - Заполнить список каналов системы сообщения
//
Процедура ЗаполнитьСписокКаналовСистемыСообщения(ЭлементФормы, ИндексСтроки, СтрокаНастройкиКаналовУведомлений)
	
	Если НЕ ЭлементФормы = Неопределено Тогда 
		ЭлементФормы.Видимость = Ложь;		
		ЭлементФормы.СписокВыбора.Очистить();
		Если ЗначениеЗаполнено(СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы) И ТипЗнч(СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы) = Тип("СправочникСсылка.ВнешниеСистемы") Тогда 
			МассивСтрокВнешниСистем = ТаблицаВнешнихСистем.НайтиСтроки(Новый Структура("Ссылка", СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы));
			Если НЕ МассивСтрокВнешниСистем.Количество() = 0 Тогда 
				ТипВнешнейСистемы = МассивСтрокВнешниСистем[0].ТипВнешнейСистемы;
			Иначе 
				ТипВнешнейСистемы = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы, "ТипВнешнейСистемы");
			КонецЕсли;
			
			Если ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Chat2Desk Тогда 
				ЭлементФормы.Видимость = Истина;			
				МассивКаналов = МессенджерСтоматология.ПолучитьКаналыChat2Desk(СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы);
				Для Каждого ЭлементКанал Из МассивКаналов Цикл 
					ЭлементФормы.СписокВыбора.Добавить(ЭлементКанал.Значение, ЭлементКанал.Имя + " (" + Строка(ЭлементКанал.Значение) + ")", СтрокаНастройкиКаналовУведомлений.КаналСистемыСообщений = ЭлементКанал.Значение);
				КонецЦикла;
				Если ЗначениеЗаполнено(СтрокаНастройкиКаналовУведомлений.КаналСистемыСообщений) Тогда 
					ЭлементСпискаКанал = ЭлементФормы.СписокВыбора.НайтиПоЗначению(СтрокаНастройкиКаналовУведомлений.КаналСистемыСообщений);
					Если ЭлементСпискаКанал = Неопределено Тогда 
						ЭлементФормы.СписокВыбора.Добавить(СтрокаНастройкиКаналовУведомлений.КаналСистемыСообщений, Новый ФорматированнаяСтрока("Канал деактивирован (" + СтрокаНастройкиКаналовУведомлений.КаналСистемыСообщений + ")", , Новый Цвет(255, 0, 0)), Истина);
					КонецЕсли;
				КонецЕсли;
				Если ЭлементФормы.СписокВыбора.Количество() = 0 Тогда 
					ЭлементФормы.ПодсказкаВвода = НСтр("ru = 'Каналы сообщений не найдены'; en = 'Message channels are not found'");
				Иначе 
					ЭлементФормы.ПодсказкаВвода = НСтр("ru = 'Выберите канал сообщений'; en = 'Select a message channel'");
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - Инициализировать структуру параметров отрисовки
//
// Параметры:
//  Объект	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСтруктуруПараметровОтрисовки(ИнициализироватьМассивАккаунтовСистемыОтправки = Истина, ИндексСтроки = Неопределено) Экспорт
	
	ПараметрыОтрисовки = Новый Структура;
	
	// Подготовка сервисов рассылки сообщений.	
	СервисыРассылки = Новый Структура;
	СервисыРассылки.Вставить("Push"     	, Неопределено);
	СервисыРассылки.Вставить("PushWallet"   , Неопределено);
	СервисыРассылки.Вставить("Messenger"	, Неопределено);
	СервисыРассылки.Вставить("SMS"      	, Неопределено);
	
	//Если ИнициализироватьМассивАккаунтовСистемыОтправки Тогда
	//	ПараметрыОтрисовки.Вставить("МассивАккаунтовСистемыОтправкиСообщений", ТаблицаВнешнихСистем.Выгрузить().ВыгрузитьКолонку("Ссылка"));
	//Иначе 
	//	ПараметрыОтрисовки.Вставить("МассивАккаунтовСистемыОтправкиСообщений", Новый Массив);
	//КонецЕсли;

	СтрокаНастроекКаналов = Неопределено;
	Если НЕ ИндексСтроки = Неопределено Тогда
		СтрокаНастроекКаналов = МоделируемыеНастройкиКаналовУведомлений[ИндексСтроки];
	Иначе 
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("СтруктурнаяЕдиница"	, ТекущаяСтруктурнаяЕдиница);
		СтруктураПоиска.Вставить("ИдентификаторДействия", ИдентификаторДействия);
		МассивСтрокНастроекКаналов = МоделируемыеНастройкиКаналовУведомлений.НайтиСтроки(СтруктураПоиска);
		Если НЕ МассивСтрокНастроекКаналов.Количество() = 0 Тогда 
			СтрокаНастроекКаналов = МассивСтрокНастроекКаналов[0];
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ СтрокаНастроекКаналов = Неопределено Тогда 
		// Сервис Push-уведомлений
		Если НЕ СтрокаНастроекКаналов.СписокАккаунтовPush.Количество() = 0 Тогда 
			СервисыРассылки.Push = СтрокаНастроекКаналов.СписокАккаунтовPush[0].Значение; 
		КонецЕсли;
		// Сервис Push Wallet
		Если НЕ СтрокаНастроекКаналов.СписокАккаунтовPushWallet.Количество() = 0 Тогда 
			СервисыРассылки.PushWallet = СтрокаНастроекКаналов.СписокАккаунтовPushWallet[0].Значение; 
		КонецЕсли;
		// Сервисы мессенджера
		СервисыMessenger = Новый Структура;
		СервисыMessenger.Вставить("GreenApi", Справочники.ВнешниеСистемы.ПустаяСсылка());
		Для Каждого ЭлементСервисMessenger Из СтрокаНастроекКаналов.СписокАккаунтовMessenger Цикл
			МассивСтрокВнешнихСистем = ТаблицаВнешнихСистем.НайтиСтроки(Новый Структура("Ссылка", ЭлементСервисMessenger.Значение));
			Если НЕ МассивСтрокВнешнихСистем.Количество() = 0 Тогда 
				Если МассивСтрокВнешнихСистем[0].ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi Тогда 
					СервисыMessenger.Вставить("GreenApi", ЭлементСервисMessenger.Значение);
				КонецЕсли;				
			КонецЕсли;
			Если ЗначениеЗаполнено(СервисыMessenger.GreenApi) Тогда 
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		СервисыРассылки.Messenger 	= СервисыMessenger;
		ОтправкаMessenger 			= ЗначениеЗаполнено(СервисыРассылки.Messenger.GreenApi);
		// Сервис sms-рассылки
		Если НЕ СтрокаНастроекКаналов.СписокАккаунтовSMS.Количество() = 0 Тогда 		
			СервисыРассылки.SMS 		= СтрокаНастроекКаналов.СписокАккаунтовSMS[0].Значение;
		КонецЕсли;	
	Иначе 
		
#Область СТАРЫЙ_МЕХАНИЗМ_ОПРЕДЕЛНИЯ_СЕРВИСОВ_РАССЫЛКИ_2
		
		// Сервис Push-уведомлений.
		СервисыРассылки.Push = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.МобильноеПриложениеКлиента, Истина);
		
		// Сервис Push Wallet 	
		СервисыРассылки.PushWallet = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.Wallet);
		
		// Севисы мессенджера.
		СервисыMessenger = Новый Структура;
		СервисыMessenger.Вставить("GreenApi", Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.GreenApi, Истина));
		
		СервисыРассылки.Messenger = СервисыMessenger;
		
		ОтправкаMessenger = ЗначениеЗаполнено(СервисыРассылки.Messenger.GreenApi);
		
		// Сервис sms-рассылки.
		СервисыРассылки.SMS = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.СервисSMSРассылки;
		СервисыРассылки.SMS = ?(Не ЗначениеЗаполнено(СервисыРассылки.SMS), Константы.СервисSMSРассылкиПоУмолчанию.Получить(), СервисыРассылки.SMS);
		
#КонецОбласти
		
	КонецЕсли;				
	
	ПараметрыРассылки = Новый Структура;
	ПараметрыРассылки.Вставить("СервисыРассылки"  	, СервисыРассылки);
	ПараметрыРассылки.Вставить("ОтправкаPush"     	, ЗначениеЗаполнено(СервисыРассылки.Push));
	ПараметрыРассылки.Вставить("ОтправкаPushWallet" , ЗначениеЗаполнено(СервисыРассылки.PushWallet));
	ПараметрыРассылки.Вставить("ОтправкаMessenger"	, ОтправкаMessenger);
	ПараметрыРассылки.Вставить("ОтправкаSMS"      	, ЗначениеЗаполнено(СервисыРассылки.SMS));
	
	ПараметрыОтрисовки.Вставить("ПараметрыРассылки"	, ПараметрыРассылки);
	
	СтрокаНастроекКаналов.ПараметрыОтрисовки = ПараметрыОтрисовки;
	
	Возврат ПараметрыОтрисовки;
	
КонецФункции

#КонецОбласти









