
#Область СлужебныеПроцедурыИФункции

// Процедура - Загрузить
//
// Параметры:
//  ИмяНастройки				 - 	 - 
//  СписокВыбора				 - 	 - 
//  ФорматироватьПредставление	 - 	 - 
//
Процедура Загрузить(ИмяНастройки, СписокВыбора, ФорматироватьПредставление = Ложь)Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация();
	ИдентификаторКлиента = СистемнаяИнформация.ИдентификаторКлиента;			
	
	ИсторияПоиска = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(ИмяНастройки, ИдентификаторКлиента);
	Если ИсторияПоиска <> Неопределено Тогда
		Если ФорматироватьПредставление Тогда
			СписокВыбора.Очистить();
			ФормируемыйСписокВыбора = Новый СписокЗначений;			
			СпискиВыбораВызовСервера.ИнициализироватьПредставлениеСписка(ФормируемыйСписокВыбора, ИсторияПоиска);
			Для Каждого ЭлементСформированногоСписка Из ФормируемыйСписокВыбора Цикл 
				ЗаполнитьЗначенияСвойств(СписокВыбора.Добавить(), ЭлементСформированногоСписка);
			КонецЦикла;	
		Иначе
			СписокВыбора.ЗагрузитьЗначения(ИсторияПоиска);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Сохранить
//
// Параметры:
//  ИмяНастройки - 	 - 
//  СписокВыбора - 	 - 
//
Процедура Сохранить(ИмяНастройки, СписокВыбора) Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация();
	ИдентификаторКлиента = СистемнаяИнформация.ИдентификаторКлиента;			
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить(ИмяНастройки, ИдентификаторКлиента, СписокВыбора.ВыгрузитьЗначения());
	
КонецПроцедуры // Сохранить()

// Процедура - Обновить список выбора
//
// Параметры:
//  СписокВыбора				 - 	 - 
//  СтрокаПоиска				 - 	 - 
//  РазмерСпискаВыбора			 - 	 - 
//  ФорматироватьПредставление	 - 	 - 
//
Процедура ОбновитьСписокВыбора(СписокВыбора, СтрокаПоиска, РазмерСпискаВыбора = 1000, ФорматироватьПредставление = Ложь) Экспорт
	
	ЕстьВхождения = Ложь;
	МассивИдентификаторов = Новый Массив;
	Если ТипЗнч(СтрокаПоиска) = Тип("Строка") Тогда 
		Для Каждого ЭлементСписка Из СписокВыбора Цикл 
			Если СтрНайти(ЭлементСписка.Значение, СтрокаПоиска) <> 0 Тогда 
				ЕстьВхождения = Истина;
			КонецЕсли;
			Если СтрНайти(ВРег(СтрокаПоиска), ВРег(ЭлементСписка.Значение)) <> 0 И СтрокаПоиска <> ЭлементСписка.Значение Тогда
				МассивИдентификаторов.Добавить(ЭлементСписка.ПолучитьИдентификатор());
			КонецЕсли;	
		КонецЦикла;
		Для Каждого ИдентификаторЭлемента Из МассивИдентификаторов Цикл 
			СписокВыбора.Удалить(СписокВыбора.НайтиПоИдентификатору(ИдентификаторЭлемента));
		КонецЦикла;	
	КонецЕсли;
	
	// Удалим элемент из истории поиска если он там был
	НомерНайденногоЭлементаСписка = СписокВыбора.НайтиПоЗначению(СтрокаПоиска);
	Если ЕстьВхождения И НомерНайденногоЭлементаСписка = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Пока НомерНайденногоЭлементаСписка <> Неопределено Цикл
		СписокВыбора.Удалить(НомерНайденногоЭлементаСписка);
		НомерНайденногоЭлементаСписка = СписокВыбора.НайтиПоЗначению(СтрокаПоиска);
	КонецЦикла;
	
	
	// И поставим его на первое место
	Если ФорматироватьПредставление Тогда 
		МассивЗначений = Новый Массив;
		МассивЗначений.Добавить(СтрокаПоиска);
		ФормируемыйСписокВыбора = СписокВыбора.Скопировать();
		СпискиВыбораВызовСервера.ИнициализироватьПредставлениеСписка(ФормируемыйСписокВыбора, МассивЗначений);
		СписокВыбора.Очистить();		
		Для Каждого ЭлементСформированногоСписка Из ФормируемыйСписокВыбора Цикл 
			ЗаполнитьЗначенияСвойств(СписокВыбора.Добавить(), ЭлементСформированногоСписка);
		КонецЦикла;	
	Иначе 
		СписокВыбора.Вставить(0, СтрокаПоиска);
	КонецЕсли;
	Пока СписокВыбора.Количество() > РазмерСпискаВыбора Цикл
		СписокВыбора.Удалить(СписокВыбора.Количество() - 1);
	КонецЦикла;
	
КонецПроцедуры // ОбновитьСписокВыбора()

// Процедура - Авто подбор
//
// Параметры:
//  Элемент				 - 	 - 
//  Текст				 - 	 - 
//  ДанныеВыбора		 - 	 - 
//  Ожидание			 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура АвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	КоличествоНайденных = 0;
	Для каждого ЭлементСписка Из Элемент.СписокВыбора Цикл
		Если ЛЕВ(ВРег(ЭлементСписка.Значение),СтрДлина(СокрЛП(Текст))) = ВРег(СокрЛП(Текст)) Тогда
			ДанныеВыбора.Добавить(ЭлементСписка.Значение);
			КоличествоНайденных = КоличествоНайденных + 1;
			Если КоличествоНайденных > 7 Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // АвтоПодбор()

#КонецОбласти