
#Область СлужебныйПрограммныйИнтерфейс

// Процедура, подключает обработчик новых сообщений в системе взаимодействия.
//
Процедура ПодключитьОбработчикНовыхСообщений() Экспорт
	
	Попытка
		Обсуждение = ОбсужденияСистемыВзаимодействия.КлючОбсужденияЖурналаОповещений();	
		Если НЕ ЗначениеЗаполнено(Обсуждение) Тогда
			Возврат;
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикНовогоСообщения", ОбсужденияСистемыВзаимодействияКлиент);
		СистемаВзаимодействия.НачатьПодключениеОбработчикаНовыхСообщений(, Обсуждение, ОписаниеОповещения);
	Исключение
		Возврат;
	КонецПопытки;

КонецПроцедуры

// Процедура, создает обсуждение в система взаимодействия и подключает обработчик новых сообщений.
//
Процедура СоздатьОбсуждение() Экспорт
	
	Попытка
		Обсуждение = ОбсужденияСистемыВзаимодействияСлужебныйВызовСервера.СоздатьОбсуждениеЖурналОповещений();
		Если Обсуждение <> Неопределено Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикНовогоСообщения", ОбсужденияСистемыВзаимодействияКлиент);
			СистемаВзаимодействия.НачатьПодключениеОбработчикаНовыхСообщений(, Обсуждение, ОписаниеОповещения);
		КонецЕсли;
	Исключение 
		
	КонецПопытки;

КонецПроцедуры      

#КонецОбласти
