
#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиОжиданий

// Процедура обработчик вызова по таймеру(однократно) провреки состояния регистрационной анкеты продукта.
//
Процедура ОбработчикОжиданияОтложенногоВызоваПроверкиРегистрацииАнкетыПродукта() Экспорт
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено()
		ИЛИ СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске().Свойство("НеобходимоОбновлениеПараметровРаботыПрограммы") Тогда
		
		Возврат ;
		
	КонецЕсли;

	Ответ = ЛичныйКабинет.ПроверитьНеобходимостьОповещенияПользователяОСтатусеАнкеты();
	
	Если Ответ.СтатусАнкетыИзмен = Истина Тогда 
		
		Оповещение = Новый ОписаниеОповещения("ОповещениеОРегистрацииЗавершение", ЛичныйКабинетКлиент);
		
		ПоказатьОповещениеПользователя(
		"Регистрация программного продукта",
		Оповещение,
		Ответ.СтатусАнкетыОписание,
		БиблиотекаКартинок.Информация32,
		СтатусОповещенияПользователя.Важное,
		Новый УникальныйИдентификатор("6596e18a-bb2e-4d18-8adf-46488e67ea86"));
		
		//900
		ПодключитьОбработчикОжидания("ОбработчикОжиданияОтложенногоВызоваПроверкиРегистрацииАнкетыПродукта",3600, Истина);
			
	Иначе
		
		Если Ответ.ОжиданиеПодтвержденияАнкеты = Истина Тогда
			
			//900
			ПодключитьОбработчикОжидания("ОбработчикОжиданияОтложенногоВызоваПроверкиРегистрацииАнкетыПродукта",3600, Истина);
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

// Обработчик таймера оповещения о регистрации программного продукта.
//
Процедура ОбработчикОжиданияОповещенияОРегистрацииПрограммногопродукта() Экспорт
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено()
		ИЛИ СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске().Свойство("НеобходимоОбновлениеПараметровРаботыПрограммы") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОповеститьПользователя = ЛичныйКабинет.ПроверитьНеобходимостьОповещенияОРегистрацииПрограммногоПродукта();
	
	Если ОповеститьПользователя = Истина Тогда
		
		Оповещение = Новый ОписаниеОповещения("ОповещениеОРегистрацииЗавершение", ЛичныйКабинетКлиент);
		
		ПоказатьОповещениеПользователя(
		"Регистрация программного продукта",
		Оповещение,
		"Зарегистрируйтесь, чтобы получить больше возможностей",
		БиблиотекаКартинок.Информация32,
		СтатусОповещенияПользователя.Важное,
		Новый УникальныйИдентификатор("6596e18a-bb2e-4d18-8adf-46488e67ea75"));
		
		ПодключитьОбработчикОжидания("ОбработчикОжиданияОповещенияОРегистрацииПрограммногопродукта", 3600, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Обработчик таймера проверка необходимости пополнения баланса смс сервиса
//
Процедура ОбработчикОжиданияПроверкаНеобходимостиПополненияБалансаСмсСервиса() Экспорт
	
	Если (ОбщегоНазначенияПовтИсп.РазделениеВключено()
		И НЕ ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных())
		ИЛИ СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске().Свойство("НеобходимоОбновлениеПараметровРаботыПрограммы") Тогда
		
		Возврат ;
		
	КонецЕсли;
	
	ЛичныйКабинетКлиент.ПроверитьНеобходимостьПредложенияПополненияБалансаСмсСервисаHelix();
	
КонецПроцедуры

// Процедура - Обработчик таймера проверки возможности получения подарочной суммы
//
Процедура ОбработчикОжиданияПроверкаВозможностиПолученияПодарка() Экспорт
	
	Если (ОбщегоНазначенияПовтИсп.РазделениеВключено()
		И НЕ ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных())
		ИЛИ СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске().Свойство("НеобходимоОбновлениеПараметровРаботыПрограммы") Тогда
		
		Возврат ;
	КонецЕсли;
	
	ОповеститьПользователя = ЛичныйКабинет.ПроверитьНеобходимостьОповещенияОПолученииПодарка();
	
	Если ОповеститьПользователя = Истина Тогда
		
		Результат = Неопределено;
		
		Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
			
			НомерОбласти = ЛичныйКабинет.ПолучитьНомерОбласти();
			
			Если ЗначениеЗаполнено(НомерОбласти) Тогда
				Результат = ЛичныйКабинет.ПроверитьНаличиеПодарка(, НомерОбласти);
			КонецЕсли;
			
		Иначе
			
			РегистрационныйНомер = ЛичныйКабинет.ПолучитьРегистрационныйНомерПродукта();
			
			Если ЗначениеЗаполнено(РегистрационныйНомер) Тогда
				Результат = ЛичныйКабинет.ПроверитьНаличиеПодарка(РегистрационныйНомер);
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Результат)
			ИЛИ Результат.ВыполненоУспешно <> Истина
			ИЛИ Результат.ПараметрыРезультата.welcome_amount <> Истина Тогда
			
			Возврат;
		КонецЕсли;
		
		ПодарочнаяСумма = Результат.ПараметрыРезультата.sum;
		
		Оповещение = Новый ОписаниеОповещения("ОповещениеОРегистрацииЗавершение", ЛичныйКабинетКлиент);
		
		ПоказатьОповещениеПользователя(
		"Получение подарка",
		Оповещение,
		"Для вас есть подарок, " + ПодарочнаяСумма + " руб. на смс-баланс. Войдите в личный кабинет и заберите его",,
		СтатусОповещенияПользователя.Важное,
		Новый УникальныйИдентификатор("6596e18a-bb2e-4d18-8adf-46488e67ea70"));
		
		ПодключитьОбработчикОжидания("ОбработчикОжиданияПроверкаВозможностиПолученияПодарка", 3600, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Обработчик ожидания проверка наличия счетов для оплаты
//
Процедура ОбработчикОжиданияПроверкаНаличияСчетовДляОплаты() Экспорт
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено()
		ИЛИ СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске().Свойство("НеобходимоОбновлениеПараметровРаботыПрограммы") Тогда
		
		Возврат;		
	КонецЕсли;

	Если ЛичныйКабинет.ПроверитьРазрешениеПолученияСчетов() = Ложь Тогда		
		Возврат;		
	КонецЕсли;
	
	Попытка
		
		Результат = ЛичныйКабинет.ПолучитьДоговорыПользователяСИсториейСчетов(ЛичныйКабинет.УидТекущейСессии());
		
		Если Результат.ВыполненоУспешно = Истина Тогда
			
			МассивСтруктурДоговоров = Результат.ПараметрыРезультата.contracts;
			
			МассивСчетов = Новый Массив;
			Для Каждого СтруктураМассива Из МассивСтруктурДоговоров Цикл
				
				Для Каждого СчетНаОплату Из СтруктураМассива.invoices Цикл
					
					Если СчетНаОплату.type = "invoice"
						И СчетНаОплату.sum > СчетНаОплату.paid Тогда;
						
						МассивСчетов.Добавить(СчетНаОплату.presentation);
					КонецЕсли;	 
					
				КонецЦикла;
				
			КонецЦикла;
			
			Если МассивСчетов.Количество() = 1 Тогда
				
				Оповещение = Новый ОписаниеОповещения("ПерейтиВФормуЛичногоКабинета", ЛичныйКабинетКлиент);
				
				ПоказатьОповещениеПользователя(
				"Личный кабинет",
				Оповещение,
				МассивСчетов[0],
				БиблиотекаКартинок.НовоеЭлектронноеПисьмо32,
				СтатусОповещенияПользователя.Важное,
				Новый УникальныйИдентификатор("6596e18a-9b2e-4d18-8adf-46488e67e999"));
				
			ИначеЕсли МассивСчетов.Количество() > 1 Тогда
				
				Оповещение = Новый ОписаниеОповещения("ПерейтиВФормуЛичногоКабинета", ЛичныйКабинетКлиент);
				
				ПоказатьОповещениеПользователя(
				"Личный кабинет",
				Оповещение,
				"Поступило счетов на оплату: " + МассивСчетов.Количество(),
				БиблиотекаКартинок.НовоеЭлектронноеПисьмо32,
				СтатусОповещенияПользователя.Важное,
				Новый УникальныйИдентификатор("6596e18a-9b2e-4d18-8adf-46488e67e999"));
				
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации("ОбработчикОжиданияПроверкаНаличияСчетовДляОплаты",,"Ошибка обработки: " + ОписаниеОшибки(), ТекущаяДата(),Истина);
		
	КонецПопытки;
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияПроверкаНаличияСчетовДляОплаты" ,3600, Истина);
 
КонецПроцедуры

#КонецОбласти

#КонецОбласти