
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик при создании формы на сервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ТЗаголовок = Неопределено;
	Параметры.Свойство("Заголовок",ТЗаголовок);
	Если ЗначениеЗаполнено(Заголовок) Тогда
		Элементы.ДекорацияТексВопроса.Заголовок = ТЗаголовок;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Обработчик ответа "Да"
Процедура КомандаДа(Команда)
	 ЗаписатьНастройкуПользователя(БольшеНеСпрашивать);
     Закрыть(КодВозвратаДиалога.Да);
КонецПроцедуры

&НаКлиенте   
// Обработчик ответа "Нет"
Процедура КомандаНет(Команда)
	ЗаписатьНастройкуПользователя(БольшеНеСпрашивать);
	Закрыть(КодВозвратаДиалога.Нет);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Записать значений флажка
Процедура ЗаписатьНастройкуПользователя(БольшеНеСпрашивать)	
	Если БольшеНеСпрашивать Тогда
		НастройкаПользователя = РегистрыСведений.ЗначенияДополнительныхПравПользователя.СоздатьМенеджерЗаписи();
		НастройкаПользователя.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		НастройкаПользователя.Право        = ПланыВидовХарактеристик.ПраваПользователей.НеЗачислятьСдачуНаЛицевойСчет;
		НастройкаПользователя.Значение     = Истина;
		НастройкаПользователя.Записать();
	КонецЕсли;		
КонецПроцедуры

#КонецОбласти

