
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Установка отбора по типу полиса
Процедура ОтборТипПолисаПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ТипПолиса", ОтборТипПолиса, ЗначениеЗаполнено(ОтборТипПолиса));
КонецПроцедуры

&НаКлиенте
// Установка отбора по страховой компании
Процедура ОтборСтраховаяКомпанияПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтраховаяКомпания", ОтборСтраховаяКомпания, ЗначениеЗаполнено(ОтборСтраховаяКомпания));
КонецПроцедуры

&НаКлиенте
// Процедура - Импорт страховых пациентов
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ИмпортСтраховыхПациентов(Команда)
	
	ОткрытьФорму("Обработка.ИмпортСтраховыхПациентов.Форма",,ЭтаФорма,Ложь,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Контрагент") Тогда
		ОтборКонтрАгент = Параметры.Контрагент;
		Элементы.Контрагент.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте  
// Процедура - При открытии
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриОткрытии(Отказ)

	// ОтборСтруктурнаяЕдиницаПриИзменении(Элементы.ОтборСтруктурнаяЕдиница);
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", ОтборКонтрАгент, ЗначениеЗаполнено(ОтборКонтрАгент));

КонецПроцедуры

#КонецОбласти



