
#Область ОписаниеПеременных

&НаКлиенте
Перем УстановленАгент;

&НаКлиенте
Перем СертификатНайден;

&НаКлиенте
Перем ПутьДоАгента;

&НаКлиенте
Перем ИДИнформационнойБазы;

&НаКлиенте
Перем РасписаниеПоУмолчанию;

&НаКлиенте
Перем СтруктураНастройкиБэкапаИБ;  

#КонецОбласти

#Область ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
// + Процедура обработчик события при открытии формы.
Процедура 	ПриОткрытии(Отказ)
	
	// Проверяем, что эта база файловая, в противном случае - завершаем работу
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	Если НЕ Лев(СтрокаСоединения,5) = "File=" Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,"Сервис 1С Облачный архив используется только для резервного копирования файловых информационных баз");
		Возврат;
	КонецЕсли;
	
	// Проверяем на предмет соответствия минимальной версии платформы
	НаВозврат = МодульнаяПроверитьВерсиюПлатформы();
	Если НЕ НаВозврат = Истина Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НаВозврат);
	КонецЕсли;
	
	// Проверяем на предмет соответствия актуальной версии конфы
	НаВозврат = МодульнаяПроверитьНаАктуальнуюВерсиюКонфигурации();
	Если НЕ НаВозврат = Истина Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НаВозврат);
	КонецЕсли;
	
	// Проверяем на предмет соответствия актуальной версии обработки
	НаВозврат = МодульнаяПроверитьНаАктуальнуюВерсиюОбработки();
	Если НЕ НаВозврат = Истина Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НаВозврат);
	КонецЕсли;  
	
	// Проверяем на предмет соответствия актуальной версии агента
	НаВозврат = МодульнаяПроверитьНаАктуальнуюВерсиюАгента();
	Если НЕ НаВозврат = Истина Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НаВозврат);
	КонецЕсли; 			
	
	РасписаниеПоУмолчанию = Дата('00010101220000');
	
	Элементы.ГруппаАктивация.Видимость = Истина;
	Элементы.ОсновнаяПанель.Видимость = Ложь;
	
	// Проверяем установленность агента
	ПутьДоАгента = "";
	УстановленАгент = МодульнаяПроверитьУстановленностьАгента();
	Если НЕ УстановленАгент = Ложь Тогда
		ПутьДоАгента = УстановленАгент;
		УстановленАгент = Истина;
	КонецЕсли;
	
	Если УстановленАгент = Ложь Тогда
		ИнициализироватьЗакладкуЗагрузкиАгента();
		Возврат;
	КонецЕсли;	
	
	// Проверяем наличие сертификата сервиса
	СертификатНайден = МодульнаяПроверитьНаличиеСертификатаСервиса(ПутьДоАгента);
	
	Если УстановленАгент = Истина И НЕ СертификатНайден Тогда
		ИнициализироватьЗакладкуАктивацииПодписки();
		Возврат;
	КонецЕсли;
	
	// Если все прошло нормально, то открываем основную страницу
	ИнициализироватьГлавнуюСтраницу();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Страница СтраницаУстановкаАгента - группа Активация

&НаКлиенте
// + Обработчик нажатия на ссылку "Загрузить" закладки Агента
Процедура 	СсылкаЗагрузитьАгентаНажатие(Элемент)
	
	СсылкаНаАгент = МодульнаяПолучитьСсылкуНаАгента();
	
	ПерейтиПоНавигационнойСсылке(СсылкаНаАгент);	
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Страница СтраницаАктивацияПодписки - группа Активация

&НаКлиенте
// + Обработчик при измениии Номера итс на форме
Процедура 	АктивацияНомерИТСПриИзменении(Элемент)
	
	ОбновитьДоступностьПереходаСАктивацииПодписки();
	
КонецПроцедуры

&НаКлиенте
// + Обработчик при измениии Логина на форме
Процедура	АктивацияПочтовыйАдресПриИзменении(Элемент)
	
	ОбновитьДоступностьПереходаСАктивацииПодписки();
	
КонецПроцедуры

&НаКлиенте
// + Обработчик при измениии Кода доступа на форме
Процедура 	АктивацияКодДоступаПриИзменении(Элемент)
	
	ОбновитьДоступностьПереходаСАктивацииПодписки();
	
КонецПроцедуры

&НаКлиенте
// Обработчик при нажатии на кнопку высылки кода доступа
Процедура 	АктивацияПодпискиВыслатьКодДоступаНажатие(Элемент)

	СписокОшибок = ОбновитьДоступностьПереходаСАктивацииПодписки();
	
	ДопущенаОшибкаВвода = Ложь;
	Для каждого СтрокаОшибка из СписокОшибок Цикл
		Если СтрокаОшибка.Значение = "АктивацияКодДоступа" Тогда Продолжить; КонецЕсли;		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрокаОшибка.Представление;
		Сообщение.Поле = СтрокаОшибка.Значение;
		Сообщение.Сообщить();
		ДопущенаОшибкаВвода = Истина;
	КонецЦикла;

	Если ДопущенаОшибкаВвода Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удается выслать код доступа всвязи с допущенными ошибками ввода.";
		Сообщение.Поле = "АктивацияКодДоступа";
		Сообщение.Сообщить();
	Иначе
		ПоказатьПредупреждение(,"Код доступа будет выслан на указанный адрес email в течении нескольких минут.");
    КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Группа Навигация

&НаКлиенте
// + Обработчик нажатия на картинку навигации в БД
Процедура 	ОсновнаяНавигацияБазыНажатие(Элемент)
	
	Элементы.Основная.ТекущаяСтраница = Элементы.ОсновнаяБазы;	
	
КонецПроцедуры

&НаКлиенте 
// + Обработчик нажатия на картинку навигации в Расписание
Процедура 	РасписаниеНажатие(Элемент)
	
	Элементы.Основная.ТекущаяСтраница = Элементы.ОсновнаяРасписание;
	
КонецПроцедуры

&НаКлиенте
// + Обработчик нажатия на картику навигации в Журнал
Процедура 	ЖурналНажатие(Элемент)
	
	Элементы.Основная.ТекущаяСтраница = Элементы.ОсновнаяЖурнал;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Страница ОсновнаяГлавная - группа Основная панель

&НаКлиенте
// + Обработчик нажатия на ссылку Переактивация
Процедура 	ОсновнаяСсылкаПереактивацияНажатие(Элемент)
	
	СертификатНайден = Ложь;
	
	Элементы.СтраницыАктивации.ТекущаяСтраница = Элементы.СтраницаАктивацияПодписки;	
	Элементы.ГруппаАктивация.Видимость = Истина;
	Элементы.ОсновнаяПанель.Видимость = Ложь;
	
	ОбновитьДоступностьПереходаСАктивацииПодписки();
	
КонецПроцедуры

&НаКлиенте
// + Обработчик нажатия на ссылку "Включить"
Процедура 	ГлавнаяСсылкаВключитьНажатие(Элемент)
	
	Элементы.Основная.ТекущаяСтраница = Элементы.ОсновнаяБазы;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Страница ОсновнаяБазы - группа Основная панель

&НаКлиенте
// Процедура включает Текущую ИБ к резервному копированию
Процедура 	ФлажокБазаВключитьБэкапПриИзменении(Элемент)
	
	ПутьДоФайла = КаталогВременныхФайлов();
	Если Не Прав(ПутьДоФайла,1) = "\" Тогда ПутьДоФайла = ПутьДоФайла + "\"; КонецЕсли;
	
	Если БазыВключитьТекущуюБазуВБэкап = Ложь Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ФлажокБазаВключитьБэкапПриИзмененииФрагмент", ЭтотОбъект, Новый Структура("ПутьДоФайла", ПутьДоФайла)), "Вы уверены, что хотите отключить резервное копирование текущей информационной базы?",РежимДиалогаВопрос.ДаНетОтмена,60,КодВозвратаДиалога.Отмена,"Отключение резервного копирования базы",КодВозвратаДиалога.Отмена);
        Возврат;
	КонецЕсли;	
	
	ФлажокБазаВключитьБэкапПриИзмененииЗавершение();
КонецПроцедуры

&НаКлиенте
Процедура ФлажокБазаВключитьБэкапПриИзмененииФрагмент(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПутьДоФайла = ДополнительныеПараметры.ПутьДоФайла;

	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		БазыВключитьТекущуюБазуВБэкап = Истина;
	Иначе
		НачатьУдалениеФайлов(Новый ОписаниеОповещения("ФлажокБазаВключитьБэкапПриИзмененииЗавершение", ЭтотОбъект), "" + ПутьДоФайла,"" + ИДИнформационнойБазы + ".xml");
        Возврат;	
	КонецЕсли;
	
	ФлажокБазаВключитьБэкапПриИзмененииЗавершение(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ФлажокБазаВключитьБэкапПриИзмененииЗавершение(ДополнительныеПараметры = Неопределено) Экспорт
	
	Элементы.СтатусРезервноеКопированиеТекущейИБ.Видимость = НЕ БазыВключитьТекущуюБазуВБэкап;
	Элементы.ГлавнаяСсылкаВключить.Видимость = НЕ БазыВключитьТекущуюБазуВБэкап;

КонецПроцедуры

&НаКлиенте
// Событие перед началом изменения строки в таб части Баз
Процедура 	СписокБазПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	Если НЕ Элемент.ТекущиеДанные.ИДИнформационнойБазы = ИДИнформационнойБазы Тогда Отказ = Истина; КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
// + Обработчик команды нажатия "Далее" на закладке "Активация"
Процедура 	АктивацияВводПодпискиДалее(Команда)
	
	СписокОшибок = ОбновитьДоступностьПереходаСАктивацииПодписки();
	
	Если Элементы.АктивацияПодпискиДалее.Доступность Тогда
		// Устанавливаем изначальные настройки для бэкап агента, если они не установлены
		Ошибка = МодульнаяУстановитьНачальныеНастройкиАгента(ПутьДоАгента);		
		Если НЕ Ошибка.Результат Тогда
			Ошибка = МодульнаяАктивироватьПодпискуЧерезАгента(ПутьДоАгента,АктивацияПочтовыйАдрес,АктивацияКодДоступа);
			Если Не Ошибка.Результат Тогда
				ИнициализироватьГлавнуюСтраницу();
			Иначе
				Для каждого Стр из Ошибка.Ошибки Цикл
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Стр);	
				КонецЦикла;
			КонецЕсли;
		Иначе
			Для каждого Стр из Ошибка.Ошибки Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Стр);	
			КонецЦикла;
		КонецЕсли;
	Иначе
		Для каждого СтрокаОшибка из СписокОшибок Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрокаОшибка.Представление;
			Сообщение.Поле = СтрокаОшибка.Значение;
			Сообщение.Сообщить();
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// + Обработчик команды нажатия на кнопку "На главную"
Процедура 	ПерейтиНаГлавную(Команда)
	
	Элементы.Основная.ТекущаяСтраница = Элементы.ОсновнаяГлавная;	
	
КонецПроцедуры

&НаКлиенте
// Обработкчик команды нажатия на кнопку "Сохранить" 
Процедура СохранитьНастройку(Команда)

 	ПутьДоФайла = КаталогВременныхФайлов();
	
	Если Не Прав(ПутьДоФайла,1) = "\" Тогда		
		ПутьДоФайла = ПутьДоФайла + "\";		
	КонецЕсли;
	
	ИмяФайлаНастройки = "" + ПутьДоФайла + ИДИнформационнойБазы + ".xml"; 
	ФайлНастройки = Новый Файл(ИмяФайлаНастройки);
	НачатьУдалениеФайлов(Новый ОписаниеОповещения("СохранитьНастройкуПродолжение", ЭтотОбъект, Новый Структура("ИмяФайлаНастройки, ФайлНастройки", ИмяФайлаНастройки, ФайлНастройки)), "" + ПутьДоФайла,"" + ИДИнформационнойБазы + ".xml");
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкуПродолжение(ДополнительныеПараметры) Экспорт
	
	ИмяФайлаНастройки = ДополнительныеПараметры.ИмяФайлаНастройки;
	ФайлНастройки = ДополнительныеПараметры.ФайлНастройки;

	ФайлНастройки.НачатьПроверкуСуществования(Новый ОписаниеОповещения("СохранитьНастройкуПослеПроверкиСуществованияФайла", ЭтотОбъект, Новый Структура("ИмяФайлаНастройки", ИмяФайлаНастройки)));

КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкуПослеПроверкиСуществованияФайла(Существует, ДополнительныеПараметры) Экспорт
	
	ИмяФайлаНастройки = ДополнительныеПараметры.ИмяФайлаНастройки;

	Если НЕ Существует Тогда		
		ОбновитьСтруктуруНастроекПоЗначениямСФормы();
		МодульнаяЗаписатьИзСтруктурыВXML(ИмяФайлаНастройки,СтруктураНастройкиБэкапаИБ);					
	КонецЕсли; 
	
	НаВозврат = МодульнаяОбновитьРасписаниеАгентаПоНастройкеКопированияИБ(ИДИнформационнойБазы,ПутьДоАгента);	
	
	// Если ошибка
	Если НаВозврат.Результат = Ложь Тогда
		//	Сохранение расписания - запуск выполнения задания
		МодульнаяВнестиИзмененияВРегламентноеЗадание(БазыВключитьТекущуюБазуВБэкап,РасписаниеКопированияБД);
	Иначе
		Для каждого Стр из НаВозврат.Ошибки Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Стр);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// + Обработчик команды нажатия на кнопку "Далее" закладки "Установка агента"
Процедура 	УстановкаАгентаДалее(Команда)
	
	ИнициализироватьЗакладкуАктивацииПодписки();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
// + Процедура открывает закладку активации подписки
Процедура	ИнициализироватьЗакладкуАктивацииПодписки()
	
	Элементы.ОсновнаяПанель.Видимость = Ложь;
	Элементы.ГруппаАктивация.Видимость = Истина;
	Элементы.СтраницыАктивации.ТекущаяСтраница = Элементы.СтраницаАктивацияПодписки;
	
	ОбновитьДоступностьПереходаСАктивацииПодписки();
	
КонецПроцедуры 

&НаКлиенте
// + Процедура открывает закладку "Загрузка агента"
Процедура	ИнициализироватьЗакладкуЗагрузкиАгента()
	
	Элементы.ОсновнаяПанель.Видимость = Ложь;
	Элементы.ГруппаАктивация.Видимость = Истина;
	Элементы.СтраницыАктивации.ТекущаяСтраница = Элементы.СтраницаУстановкаАгента;
	
	ОбновитьДоступностьПереходаСЗагрузкиАгента();
	
КонецПроцедуры

&НаКлиенте
// Процедура обновляет доступность кнопки "Далее" на закладке загрузке агента и проверяет установленность агента
Процедура	ОбновитьДоступностьПереходаСЗагрузкиАгента()
	
	УстановленАгент = МодульнаяПроверитьУстановленностьАгента();
	
	Если УстановленАгент = Ложь Тогда
		ПодключитьОбработчикОжидания("ОбновитьДоступностьПереходаСЗагрузкиАгента",10);
	// Иначе В случае если агент установлен, то мы отключаем проверку, но надо включить, на случай если человек параллельно настройке снёс агента. В таком
	// Случае он возвращает на страничку загрузки агента
		// ПодключитьОбработчикОжидания("ОбновитьДоступностьПереходаСЗагрузкиАгента",60);
	Иначе
		ПутьДоАгента = УстановленАгент;
	КонецЕсли;
	
	Элементы.УстановкаАгентаДалее.Доступность = ?(УстановленАгент = Ложь,Ложь,Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура открывает главную страницу "Управление резервным копированием"
Процедура	ИнициализироватьГлавнуюСтраницу()
	
	Элементы.ГруппаАктивация.Видимость = Ложь;
	Элементы.ОсновнаяПанель.Видимость = Истина;	
	Элементы.Основная.ТекущаяСтраница = Элементы.ОсновнаяГлавная;
	
	// Получаем ID информационной базы	
	ИДИнформационнойБазы = ПолучитьИДИнформационнойБазы();
	
	// Подгружаем настройку из файла
	НаВозврат = МодульнаяПолучитьСтруктуруНастройкиКопированияИБ(ИДИнформационнойБазы);
	СтруктураНастройкиБэкапаИБ = НаВозврат.Результат;
	Для каждого Стр из НаВозврат.Предупреждение Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Стр);		
	КонецЦикла;
	// Заполняем значениями из настройки поля
	БазыВключитьТекущуюБазуВБэкап = ?(СтруктураНастройкиБэкапаИБ.Строки.DatabaseBackupConfiguration.Строки.useit.Значение = "1",Истина,Ложь);	
	Попытка
		РасписаниеКопированияБД = Дата("00010101" + СтрЗаменить(СтруктураНастройкиБэкапаИБ.Строки.DatabaseBackupConfiguration.Строки.Schedule.Строки.time.Значение,":",""));
		РасписаниеКопированияБД = РасписаниеКопированияБД + 4*3600;
	Исключение
		РасписаниеКопированияБД = РасписаниеПоУмолчанию;
	КонецПопытки;	
	ХранениеКоличествоДневныхКопий   = СтруктураНастройкиБэкапаИБ.Строки.DatabaseBackupConfiguration.Строки.RetentionRule.Строки.Daily.Значение;
	ХранениеКоличествоМесячныхКопий  = СтруктураНастройкиБэкапаИБ.Строки.DatabaseBackupConfiguration.Строки.RetentionRule.Строки.Monthly.Значение;
	ХранениеКоличествоНедельныхКопий = СтруктураНастройкиБэкапаИБ.Строки.DatabaseBackupConfiguration.Строки.RetentionRule.Строки.Weekly.Значение;	
	
	// Вынести в отдельную процедуру
	СписокБаз.Очистить();
	НСтр = СписокБаз.Добавить();
	НСтр.Наименование = СокрЛП(СтруктураНастройкиБэкапаИБ.Строки.DatabaseBackupConfiguration.Строки.Database.Строки.DBName.Значение);
	НСтр.ИДИнформационнойБазы = ИДИнформационнойБазы;
	НСтр.Время = РасписаниеКопированияБД;
	НСтр.Включено = БазыВключитьТекущуюБазуВБэкап;
	
	// Тут надо заполнить всеми базами с текущей машины.	
	
	Элементы.СтатусРезервноеКопированиеТекущейИБ.Видимость = НЕ БазыВключитьТекущуюБазуВБэкап;
	Элементы.ГлавнаяСсылкаВключить.Видимость = НЕ БазыВключитьТекущуюБазуВБэкап;
	
КонецПроцедуры

&НаКлиенте
// Функция возвращает ИД текущей информационной базы
Функция		ПолучитьИДИнформационнойБазы()
	// Нужно переделать хэщ
	
	СтрокаСоединения = МодульнаяПолучитьПутьКИнформационнойБазе();
	
	#Если НЕ ВебКлиент Тогда
		ИмяКомпьютера = ИмяКомпьютера();
	#Иначе 
		ИмяКомпьютера = "";
	#КонецЕсли
	
	Результат = "" + Лев(ИмяКомпьютера,50) + Прав(СтрокаСоединения,150);
	
	Хэш = ПолучитьФорму(СтрЗаменить(ЭтаФорма.ИмяФормы,".Форма.ФормаУправляемая",".Форма.ОбработкаХеш")).РасчетХЭШ(Результат);
		
	Возврат "DB-"+Хэш;
	
КонецФункции

&НаКлиенте
// + Процедура заполняет текущую настройку ИБ из значений с формы
Процедура	ОбновитьСтруктуруНастроекПоЗначениямСФормы()

	СтруктураНастройкиБэкапаИБ.Строки.DatabaseBackupConfiguration.Строки.useit.Значение = ?(БазыВключитьТекущуюБазуВБэкап,"1","0");
	СтруктураНастройкиБэкапаИБ.Строки.DatabaseBackupConfiguration.Строки.Schedule.Строки.time.Значение = Формат((РасписаниеКопированияБД+24*3600)-(4*3600),"ДФ=""ЧЧ:мм:сс""");
	СтруктураНастройкиБэкапаИБ.Строки.DatabaseBackupConfiguration.Строки.RetentionRule.Строки.Daily.Значение = ХранениеКоличествоДневныхКопий;	
	СтруктураНастройкиБэкапаИБ.Строки.DatabaseBackupConfiguration.Строки.RetentionRule.Строки.Weekly.Значение = ХранениеКоличествоНедельныхКопий;
	СтруктураНастройкиБэкапаИБ.Строки.DatabaseBackupConfiguration.Строки.RetentionRule.Строки.Monthly.Значение = ХранениеКоличествоМесячныхКопий;
	
	// Наименование БД
	Найдено = СписокБаз.НайтиСтроки(Новый Структура("ИДИнформационнойБазы",ИДИнформационнойБазы));
	Если НЕ Найдено.Количество() = 0 Тогда
		СтруктураНастройкиБэкапаИБ.Строки.DatabaseBackupConfiguration.Строки.Database.Строки.DBName.Значение = Найдено[0].Наименование;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Функция проверяет возможность перехода с закладки активации исходя из введенных данных в поля и возвращает список ошибок
Функция		ОбновитьДоступностьПереходаСАктивацииПодписки()
	
	// Нет проверки на запрещенные символы в логинах и кодах доступа	
	ВсеПоляВведеныВерно = Истина;
	
	СписокОшибок = Новый СписокЗначений;
	
	// Проверяем заполненность номера ИТС
	Если НЕ ЗначениеЗаполнено(АктивацияНомерИТС) Тогда
		
		Элементы.АктивацияНомерИТС.ЦветФона = Новый Цвет(255, 211, 183);
		Элементы.АктивацияНомерИТС.Подсказка = "Не введен номер ИТС";
		ВсеПоляВведеныВерно = Ложь;
		
		СписокОшибок.Добавить("АктивацияНомерИТС","Не заполнено поле ""Номер ИТС"".");
	Иначе
		Элементы.АктивацияНомерИТС.ЦветФона = Новый Цвет(235, 255, 225);
		Элементы.АктивацияНомерИТС.Подсказка = "";
	КонецЕсли;
	
	// Проверяем заполненность email
	Если ЗначениеЗаполнено(АктивацияПочтовыйАдрес) И НЕ Найти(АктивацияПочтовыйАдрес," ") = 0 Тогда
		Элементы.АктивацияПочтовыйАдрес.ЦветФона = Новый Цвет(255, 211, 183);
		Элементы.АктивацияПочтовыйАдрес.Подсказка = "Неверно введен логин, он не должен содержать пробелов.";
		СписокОшибок.Добавить("АктивацияПочтовыйАдрес","Неверно введен логин, он не должен содержать пробелов.");
		ВсеПоляВведеныВерно = Ложь;
	ИначеЕсли НЕ ЗначениеЗаполнено(АктивацияПочтовыйАдрес) Тогда
		Элементы.АктивацияПочтовыйАдрес.ЦветФона = Новый Цвет(255, 211, 183);
		Элементы.АктивацияПочтовыйАдрес.Подсказка = "Введите Ваш логин.";
		СписокОшибок.Добавить("АктивацияПочтовыйАдрес","Не заполнено поле ""Логин""");
		ВсеПоляВведеныВерно = Ложь; 
	Иначе		
		Элементы.АктивацияПочтовыйАдрес.ЦветФона = Новый Цвет(235, 255, 225);
		Элементы.АктивацияПочтовыйАдрес.Подсказка = "";
	КонецЕсли;
	
	//// Проверяем на вхождение символов в email
	// Если  Тогда
	//	// НеВерныеСимволы = "!#$%^&*()+=`~""""?/\|][}{";
	//	// ТекущееВведенное = Строка(АктивацияНомерИТС);
	//	// Пока НЕ ТекущееВведеное = "" Цикл
	//	//	Если СокрЛП(ТекущееВведенное) = 1
	//	//	ТекущийСимвол = Лев(ТекущееВведенное,1);
	//	//	ТекущееВведенное = Прав(ТекущееВведенное,Стрдлина(ТекущееВведенное) - 1);
	//	//	Сообщить(ТекущийСимвол);
	//	// КонецЦикла;
	// Иначе
	//	Элементы.АктивацияПочтовыйАдрес.ЦветФона = Новый Цвет(235, 255, 225);
	//	Элементы.АктивацияПочтовыйАдрес.Подсказка = "";
	// КонецЕсли;
	//
	
	Если ЗначениеЗаполнено(АктивацияКодДоступа) И НЕ Найти(АктивацияКодДоступа," ") = 0 Тогда
		Элементы.АктивацияКодДоступа.ЦветФона = Новый Цвет(255, 211, 183);
		Элементы.АктивацияКодДоступа.Подсказка = "Неверно введен Код доступа, он не должен содержать пробелов.";
		СписокОшибок.Добавить("АктивацияКодДоступа","Неверно введен Код доступа, он не должен содержать пробелов.");
		ВсеПоляВведеныВерно = Ложь;
	ИначеЕсли НЕ ЗначениеЗаполнено(АктивацияКодДоступа) Тогда
		Элементы.АктивацияКодДоступа.ЦветФона = Новый Цвет(255, 211, 183);
		Элементы.АктивацияКодДоступа.Подсказка = "Не введен код доступа";
		СписокОшибок.Добавить("АктивацияКодДоступа","Не заполнено поле ""Код доступа"".");
		ВсеПоляВведеныВерно = Ложь;
	Иначе
		Элементы.АктивацияКодДоступа.ЦветФона = Новый Цвет(235, 255, 225);
		Элементы.АктивацияКодДоступа.Подсказка = "";
	КонецЕсли;	
	
	Элементы.АктивацияПодпискиДалее.Доступность = ВсеПоляВведеныВерно;
	
	Возврат СписокОшибок;
	
КонецФункции

&НаСервере
// * Функция возвращает ложь в случае отсутствия установленного агента, или путь до агента
Функция		МодульнаяПроверитьУстановленностьАгента()
	
	МодульОбработки = РеквизитФормыВЗначение("Объект");
	Возврат МодульОбработки.ПроверитьУстановленностьАгента();
	
КонецФункции

&НаСервере
// * Процедура вносит изменения в расписание регламентного задания согласно установленному в полях
Процедура	МодульнаяВнестиИзмененияВРегламентноеЗадание(Использование,ВремяКопирования)
	
	МодульОбработки = РеквизитФормыВЗначение("Объект");
	МодульОбработки.ВнестиИзмененияВРегламентноеЗадание(Использование,ВремяКопирования);		
	
КонецПроцедуры

&НаСервере
// * Функция проверяет наличие выданных сертификатов для агента и возвращает ложь/истина по результату
Функция 	МодульнаяПроверитьНаличиеСертификатаСервиса(ПутьДоBackupAgent)
	
	МодульОбработки = РеквизитФормыВЗначение("Объект");
	Возврат МодульОбработки.ПроверитьНаличиеСертификатаСервиса(ПутьДоBackupAgent);	
	
КонецФункции

&НаСервере
// * Функция возвращает ссылку на агента для скачки
Функция		МодульнаяПолучитьСсылкуНаАгента()
	
	МодульОбработки = РеквизитФормыВЗначение("Объект");
	Возврат МодульОбработки.ПолучитьСсылкуНаАгента();	
	
КонецФункции

&НаСервере
// * Функция возвращает ошибку, если не удалось записать начальные настройки агента
Функция		МодульнаяУстановитьНачальныеНастройкиАгента(ПутьДоBackupAgent)
	
	МодульОбработки = РеквизитФормыВЗначение("Объект");
	Возврат МодульОбработки.УстановитьНачальныеНастройкиАгента(ПутьДоBackupAgent);		
	
КонецФункции

&НаСервере
// * Функция возвращает Ложь в случае отсуствия ошибок при активации сервиса по указанным данным с формы
Функция		МодульнаяАктивироватьПодпискуЧерезАгента(ПутьДоАгента,Логин,КодДоступа)
	
	МодульОбработки = РеквизитФормыВЗначение("Объект");
	Возврат МодульОбработки.АктивироватьПодпискуЧерезАгента(ПутьДоАгента,Логин,КодДоступа);	
	
КонецФункции

&НаСервере
// * Функция возвращает путь к информационной базе
Функция		МодульнаяПолучитьПутьКИнформационнойБазе()
	
	МодульОбработки = РеквизитФормыВЗначение("Объект");
	Возврат МодульОбработки.ПолучитьПутьКИнформационнойБазе();	
	
КонецФункции
 
&НаСервере
// * Функция возвращает настройку копирования БД по ИД, и ошибки с предупреждениями
Функция		МодульнаяПолучитьСтруктуруНастройкиКопированияИБ(ИДБД,ПутьКИБ = Неопределено,НаименованиеИБ = Неопределено,Расписание = Неопределено)
	
	МодульОбработки = РеквизитФормыВЗначение("Объект");
	Возврат МодульОбработки.ПолучитьСтруктуруНастройкиКопированияИБ(ИДБД,ПутьКИБ,НаименованиеИБ,Расписание);	
	
КонецФункции

&НаСервере
// * Функция возвращает да/нет в зависимости от обновления настройки через шедулера
Функция		МодульнаяОбновитьРасписаниеАгентаПоНастройкеКопированияИБ(ИДБД,ПутьДоBackupAgent)
	
	МодульОбработки = РеквизитФормыВЗначение("Объект");
	Возврат МодульОбработки.ОбновитьРасписаниеАгентаПоНастройкеКопированияИБ(ИДБД,ПутьДоBackupAgent);	
 		
КонецФункции

&НаСервере
// * Функция возвращает Истина, если версия пригодна для работы обработки, 
// И сообщение текстом, если не пригодна и какая минимальная
Функция		МодульнаяПроверитьВерсиюПлатформы()
	
	МодульОбработки = РеквизитФормыВЗначение("Объект");
	Возврат МодульОбработки.ПроверитьВерсиюПлатформы();	
 		
КонецФункции

&НаСервере
// * Функция возвращает Истина, если версия не отличается от актуальной или сообщение об отличии
Функция		МодульнаяПроверитьНаАктуальнуюВерсиюКонфигурации()
	
	МодульОбработки = РеквизитФормыВЗначение("Объект");
	Возврат МодульОбработки.ПроверитьНаАктуальнуюВерсиюКонфигурации();	
 		
КонецФункции

&НаСервере
// * Функция возвращает Истина, если версия не отличается от актуальной или сообщение об отличии
Функция		МодульнаяПроверитьНаАктуальнуюВерсиюОбработки()
	
	МодульОбработки = РеквизитФормыВЗначение("Объект");
	Возврат МодульОбработки.ПроверитьНаАктуальнуюВерсиюОбработки();	
 		
КонецФункции

&НаСервере
// * Функция возвращает Истина, если версия не отличается от актуальной или сообщение об отличии
Функция		МодульнаяПроверитьНаАктуальнуюВерсиюАгента()
	
	МодульОбработки = РеквизитФормыВЗначение("Объект");
	Возврат МодульОбработки.ПроверитьНаАктуальнуюВерсиюАгента();	
 		
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Работа с XML

&НаСервере    
// * Процедура записывает НЕ произвольный набор (формат) ключей структуры
Процедура	МодульнаяЗаписатьИзСтруктурыВXML(ПутьКФайлу,Структура)
	
	МодульОбработки = РеквизитФормыВЗначение("Объект");
	МодульОбработки.ЗаписатьИзСтруктурыВXML(ПутьКФайлу,Структура);	
	
КонецПроцедуры


#КонецОбласти
