#Область СлужебныеПроцедурыИФункции

// Функция - Получить представление даты по периодичности.
//
// Параметры:
//  Периодичность	 - 	 - 
//  Дата			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПредставлениеДатыПоПериодичности(Периодичность, Дата) Экспорт
	
	Если Периодичность = Перечисления.Периодичность.Час Тогда 
		Возврат Формат(Дата, "ДФ=ЧЧ:мм");
	ИначеЕсли Периодичность = Перечисления.Периодичность.День Тогда
		Возврат Формат(Дата, "ДФ='д ММММ'");
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		Возврат Формат(Дата, "ДФ='ММММ гггг'");
	ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
		Возврат Формат(Дата, "ДФ=гггг");
	КонецЕсли;	
	
КонецФункции 

#КонецОбласти
