
#Область ОбработчикиСобытий

// Процедура - Обработка команды
//
// Параметры:
//  ПараметрКоманды				 - 	 - 
//  ПараметрыВыполненияКоманды	 - 	 - 
//
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Номенклатура", ПараметрКоманды);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаОбластиЗубнойФормулы", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);	
	
КонецПроцедуры

#КонецОбласти