
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВРабочемКаталоге = Параметры.ВРабочемКаталоге;
	ВремяИзмененияНаСервере = Параметры.ВремяИзмененияНаСервере;
	Файл = Параметры.Файл;
	Сообщение = Параметры.Сообщение;
	Заголовок = Параметры.Заголовок;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьСуществующий(Команда)
	Закрыть(КодВозвратаДиалога.Да);
КонецПроцедуры

&НаКлиенте
Процедура Перезаписать(Команда)
	Закрыть(КодВозвратаДиалога.Нет);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКаталог(Команда)
	
	ФайловыеФункцииКлиент.ОткрытьПроводникСФайлом(Файл);
	
КонецПроцедуры

#КонецОбласти