
 #Область ОбработчикиКомандФормы
 
&НаКлиенте
// Процедура печати.
//
Процедура ДокументПечать(Команда)	
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "ОприходованиеЗапасов");	
	Структура.Вставить("МассивДокументов", Элементы.Список.ВыделенныеСтроки);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ОбработкаКоманды", УправлениеПечатьюКлиентСтоматология, Структура);									

	ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, ТекущийЭлемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()                           	
	Возврат Документы.ОприходованиеЗапасов.ПолучитьСписокПечатныхФорм();	
КонецФункции

#КонецОбласти