
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборПоСотруднику") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СотрудникиСегмента.Сегмент КАК Сегмент
			|ИЗ
			|	РегистрСведений.СотрудникиСегмента КАК СотрудникиСегмента
			|ГДЕ
			|	СотрудникиСегмента.Сотрудник = &Сотрудник
			|
			|СГРУППИРОВАТЬ ПО
			|	СотрудникиСегмента.Сегмент";
		Запрос.УстановитьПараметр("Сотрудник", Параметры.ОтборПоСотруднику);
		СписокСегментов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сегмент");
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение = СписокСегментов;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти