////////////////////////////////////////////////////////////////////////////////
// Подсистема "Работа с файлами".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Процедура, записать фотографию клиента в справочник.
//   Параметры:
//    ПолноеИмяФайла - строка, имя файла
//    КонтрагентОбъект - контрагент для записи фотографии
//  
Процедура ЗаписатьФотоКлиентаВСправочник(ПолноеИмяФайла, КонтрагентОбъект, ИдентификаторФормы = Неопределено) Экспорт
	
	ЭтоСсылкаНаСправочник = (ТипЗнч(КонтрагентОбъект) = Тип("СправочникСсылка.Контрагенты"));
	
	ФайлФото = Неопределено; // РаботаСФайламиВызовСервераСтоматология.ПроверкаСуществованияФайла(?(ЭтоСсылкаНаСправочник, КонтрагентОбъект, КонтрагентОбъект.Ссылка));
	
	Если ФайлФото <> Неопределено Тогда
		
		ФайлНаДиске = Новый Файл(ПолноеИмяФайла);
		Если НЕ ФайлНаДиске.Существует() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл не существует: " + Строка(ПолноеИмяФайла));
			Возврат;
		КонецЕсли;
		
		ИмяИРасширениеФайлаНаДиске 	= ФайлНаДиске.Имя;
		ВремяИзмененияВыбранное		= ТекущаяДата(); //ФайлНаДиске.ПолучитьВремяИзменения();
		
		ПараметрыВыполнения = Новый Структура;
		ПараметрыВыполнения.Вставить("ОбработчикРезультата", 		Неопределено);
		ПараметрыВыполнения.Вставить("ДанныеФайла",          		РаботаСФайламиСлужебныйВызовСервера.ДанныеФайла(ФайлФото.ФайлСсылка));
		ПараметрыВыполнения.Вставить("ИдентификаторФормы",   		ИдентификаторФормы);
		ПараметрыВыполнения.Вставить("ДиалогПолноеИмяФайла", 		ПолноеИмяФайла);
		ПараметрыВыполнения.Вставить("СоздатьНовуюВерсию",  		Ложь);
		ПараметрыВыполнения.Вставить("КомментарийКВерсии",   		"");
		ПараметрыВыполнения.Вставить("ИмяИРасширениеФайлаНаДиске",  ИмяИРасширениеФайлаНаДиске);
		ПараметрыВыполнения.Вставить("ВремяИзмененияВыбранное",     ВремяИзмененияВыбранное);
		ПараметрыВыполнения.Вставить("РасширениеФайлаНаДиске",      ФайлНаДиске.Расширение);
		ПараметрыВыполнения.Вставить("ФайлЗашифрован", 				Ложь);

		РаботаСФайламиСлужебныйКлиент.ОбновитьИзФайлаНаДискеПродолжение(ПараметрыВыполнения);
		
		Попытка
			Если ЭтоСсылкаНаСправочник Тогда
				РаботаСФайламиВызовСервераСтоматология.ЗаписатьФайлКартинкиКлиента(ФайлФото.ФайлСсылка, КонтрагентОбъект);
			Иначе
				КонтрагентОбъект.ФайлКартинки = ФайлФото.ФайлСсылка;
			КонецЕсли;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при добавлении фотографии клиента, так как недостаточно прав.");
		КонецПопытки;
	Иначе
	
		// Здесь создаем Файл ...
		Файл = Новый Файл(ПолноеИмяФайла);
		Если НЕ Файл.Существует() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл не существует: " + Строка(ПолноеИмяФайла));
			Возврат;
		КонецЕсли;
			
		ВремяИзменения = Файл.ПолучитьВремяИзменения();
		ВремяИзмененияУниверсальное = Файл.ПолучитьУниверсальноеВремяИзменения();
		
		ИмяСоздания = Файл.ИмяБезРасширения;
		
		// Поместим Файл в ВременноеХранилище
		АдресВременногоХранилищаФайла = "";
		
		ПомещаемыеФайлы = Новый Массив;
		Описание = Новый ОписаниеПередаваемогоФайла(Файл.ПолноеИмя, "");
		ПомещаемыеФайлы.Добавить(Описание);
		
		ПомещенныеФайлы = Новый Массив;
		
		Если НЕ ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы, , Ложь) Тогда		
			ВызватьИсключение
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка при помещении файла в хранилище: %1'"), Файл.ПолноеИмя);
		КонецЕсли;
		
		Если ПомещенныеФайлы.Количество() = 1 Тогда
			АдресВременногоХранилищаФайла = ПомещенныеФайлы[0].Хранение;
		КонецЕсли;
		
		АдресВременногоХранилищаТекста = "";
		
		// Создадим карточку Файла в БД
		СведенияОФайле								 = РаботаСФайламиКлиентСервер.СведенияОФайле("ФайлСВерсией");
		СведенияОФайле.ИмяБезРасширения				 = ИмяСоздания;
		СведенияОФайле.РасширениеБезТочки			 = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(Файл.Расширение);
		СведенияОФайле.ВремяИзменения				 = ВремяИзменения;
		СведенияОФайле.ВремяИзмененияУниверсальное	 = ВремяИзмененияУниверсальное;
		СведенияОФайле.Размер						 = Файл.Размер();
		СведенияОФайле.АдресВременногоХранилищаФайла = АдресВременногоХранилищаФайла;
		СведенияОФайле.АдресВременногоХранилищаТекста= АдресВременногоХранилищаТекста;
		
		Док = РаботаСФайламиСлужебныйВызовСервера.СоздатьФайлСВерсией(?(ЭтоСсылкаНаСправочник, КонтрагентОбъект, КонтрагентОбъект.Ссылка), СведенияОФайле);
		
		//КонтрагентОбъект.ФайлКартинки = Док;
		Попытка
			Если ЭтоСсылкаНаСправочник Тогда
				РаботаСФайламиВызовСервераСтоматология.ЗаписатьФайлКартинкиКлиента(Док, КонтрагентОбъект);
			Иначе
				КонтрагентОбъект.ФайлКартинки = Док;
			КонецЕсли;                
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при добавлении фотографии клиента, так как недостаточно прав.");
		КонецПопытки;
	КонецЕсли;                	
	 
КонецПроцедуры

// Процедура, записывает фотографию клиента в справочник.
//
Функция СохранитьФото(ПолноеИмяФайла, ВладелецФайла, ИдентификаторФормы = Неопределено, ПроверятьРазмерФайла = Ложь) Экспорт
	
	Файл = Новый Файл(ПолноеИмяФайла);
	Если Не Файл.Существует() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Файл не существует: ';en='File not exists:'") + Строка(ПолноеИмяФайла));
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПроверятьРазмерФайла И Файл.Размер() > 500 * 1024 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Размер фотографии превышает допустимый размер в 500Кб. Пожалуйста, уменьшите размер файла и повторите.';en='File size is over 500KB. Please reduce the file size and retry.'"));
		Возврат Неопределено;
	КонецЕсли;
	
	ВремяИзменения = Файл.ПолучитьВремяИзменения();
	ВремяИзмененияУниверсальное = Файл.ПолучитьУниверсальноеВремяИзменения();
	
	// Поместим Файл в ВременноеХранилище
	ПомещаемыеФайлы = Новый Массив;
	Описание = Новый ОписаниеПередаваемогоФайла(Файл.ПолноеИмя, "");
	ПомещаемыеФайлы.Добавить(Описание);
	
	ПомещенныеФайлы = Новый Массив;
	
	Если НЕ ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы, , Ложь) Тогда		
		ВызватьИсключение
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Ошибка при помещении файла в хранилище: %1';en='Mistake with putting file in repository: %1'"), Файл.ПолноеИмя);
	КонецЕсли;
	
	// Создадим карточку Файла в БД
	СведенияОФайле								  = РаботаСФайламиКлиентСервер.СведенияОФайле("ФайлСВерсией");
	СведенияОФайле.ИмяБезРасширения				  = Файл.ИмяБезРасширения;
	СведенияОФайле.РасширениеБезТочки			  = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(Файл.Расширение);
	СведенияОФайле.ВремяИзменения				  = ВремяИзменения;
	СведенияОФайле.ВремяИзмененияУниверсальное	  = ВремяИзмененияУниверсальное;
	СведенияОФайле.Размер						  = Файл.Размер();
	СведенияОФайле.АдресВременногоХранилищаФайла  = ?(ПомещенныеФайлы.Количество() = 1, ПомещенныеФайлы[0].Хранение, "");
	СведенияОФайле.АдресВременногоХранилищаТекста = "";
	
	Возврат РаботаСФайламиСлужебныйВызовСервера.СоздатьФайлСВерсией(ВладелецФайла, СведенияОФайле);
	 
КонецФункции

// Процедура, добавляет файл фото клиенту.
//
Процедура ЗаписатьФотоКлинета(ИмяФайлФото, Контрагент, ФормаВладелец, ФотоВыгруженоВPocketKey) Экспорт
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ФотоВыгруженоВPocketKey", ФотоВыгруженоВPocketKey);
	ДопПараметры.Вставить("Контрагент", Контрагент);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеДобавленияФото", ЭтотОбъект, ДопПараметры);
	
	ПараметрыДобавления = Новый Структура;
	ПараметрыДобавления.Вставить("ОбработчикРезультата"						, ОписаниеОповещения);
	ПараметрыДобавления.Вставить("ПолноеИмяФайла"							, ИмяФайлФото);
	ПараметрыДобавления.Вставить("ВладелецФайла"							, Контрагент);
	ПараметрыДобавления.Вставить("ФормаВладелец"							, ФормаВладелец);
	ПараметрыДобавления.Вставить("ИмяСоздаваемогоФайла"						, ИмяФайлФото);
	ПараметрыДобавления.Вставить("НеОткрыватьКарточкуПослеСозданияИзФайла"	, Истина);
	
	РаботаСФайламиСлужебныйКлиент.ДобавитьИзФайловойСистемыСРасширением(ПараметрыДобавления);	
	
КонецПроцедуры

// Процедура, устанавливает файл картинки после загрузки фото.
//
Процедура ПослеДобавленияФото(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.ФайлДобавлен = Истина Тогда		
		РаботаСФайламиВызовСервераСтоматология.УстановитьФотоКлиенту(Результат.ФайлСсылка, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

