
#Область СлужебныеПроцедурыИФункции

// Функция вернет день недели прописью
//
Функция ДеньНеделиПрописью(НомерДняНедели) Экспорт
	Если НомерДняНедели = 1 Тогда
		Возврат "Понедельник";
	ИначеЕсли НомерДняНедели = 2 Тогда
	    Возврат "Вторник";
	ИначеЕсли НомерДняНедели = 3 Тогда
	    Возврат "Среда";
	ИначеЕсли НомерДняНедели = 4 Тогда
	    Возврат "Четверг";
	ИначеЕсли НомерДняНедели = 5 Тогда
	    Возврат "Пятница";
	ИначеЕсли НомерДняНедели = 6 Тогда
	    Возврат "Суббота";
	ИначеЕсли НомерДняНедели = 7 Тогда
	    Возврат "Воскресенье";
    КонецЕсли;	
КонецФункции

// Получить представление времени с минутами в формате надстрочных символов 
//
Функция ПредставлениеВремениСНадстрочнымиСимволами(ДатаВремя, МассивНадстрочныхСимволов = Неопределено) Экспорт
	
	Возврат "" + Час(ДатаВремя) + ":" + ?(Минута(ДатаВремя) <= 9, "0" + Минута(ДатаВремя), Минута(ДатаВремя));
	
КонецФункции

// Представление ФИО
//
Функция ПредставлениеФИО(Сотрудник) Экспорт
	
	Если ЗначениеЗаполнено(Сотрудник.Фамилия) ИЛИ ЗначениеЗаполнено(Сотрудник.Имя) Тогда 
		Возврат ?(ЗначениеЗаполнено(Сотрудник.Фамилия), Сотрудник.Фамилия + " ","")
		+ ?(ЗначениеЗаполнено(Сотрудник.Имя),Лев(Сотрудник.Имя, 1) + ". ","")
		+ ?(ЗначениеЗаполнено(Сотрудник.Отчество),Лев(Сотрудник.Отчество, 1) + ". ", "");
	Иначе
		Возврат Сотрудник.Наименование;
	КонецЕсли;	
	
КонецФункции

// Получить представление интервалов времени
//
Функция ПредставлениеИнтервалаВремени(СписокИнтервала) Экспорт
	
	МассивНадстрочныхСимволов = Неопределено;
	СуммМинут                 = 0;
	Для Каждого ЭлементС ИЗ СписокИнтервала Цикл
		НачалоПредст           	= Формат(ЭлементС.Значение.НачалоРаботы		, "ДФ=HH:mm");
		КонецПредст            	= Формат(ЭлементС.Значение.ОкончаниеРаботы	, "ДФ=HH:mm");
		КоличествоМинут 		= Цел((ЭлементС.Значение.ОкончаниеРаботы - ЭлементС.Значение.НачалоРаботы) / 60);		
		ВремяИнтервала 			= ?(КоличествоМинут > 60, Строка(ОбщегоНазначенияКлиентСерверСтоматология.КонвертироватьМинутыВЧасы(КоличествоМинут)), Строка(КоличествоМинут) + " мин.");
		ЭлементС.Представление 	= НачалоПредст + "-" + КонецПредст + " (" + ВремяИнтервала + ")";
		СуммМинут              = СуммМинут + Цел((ЭлементС.Значение.ОкончаниеРаботы - ЭлементС.Значение.НачалоРаботы) / 60);	
	КонецЦикла;
	
	СуммаВремени  = ОбщегоНазначенияКлиентСерверСтоматология.КонвертироватьМинутыВЧасы(СуммМинут);
	Если ЗначениеЗаполнено(СуммаВремени) Тогда
	    Возврат Строка(СписокИнтервала);
	Иначе 	
		Возврат "";
	КонецЕсли;	
	
КонецФункции

// Получить представление интервалов времени
//
Функция ПолучитьПредставлениеСпискаИнтервалов(СписокИнтервала) Экспорт
	
	ПредставлениеСпискаИнтервалов = "";
	КоличествоИнтервалов = СписокИнтервала.Количество();
	Для Каждого ЭлементС ИЗ СписокИнтервала Цикл
		ТегПереносаСтроки 		= ?(СписокИнтервала.Индекс(ЭлементС) + 1 = КоличествоИнтервалов, "", "<br>");
		ПредставлениеСпискаИнтервалов = ПредставлениеСпискаИнтервалов + ЭлементС.Представление + ТегПереносаСтроки;                         
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПредставлениеСпискаИнтервалов) Тогда
	    Возврат ПредставлениеСпискаИнтервалов;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

#КонецОбласти
