
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере 
// Процедура, Обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("МедицинскаяКарта") Тогда
		Элементы.МедицинскаяКарта.Видимость      = Ложь;  
		Элементы.Список.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ПоСодержимому;   
		Элементы.Список.МаксимальнаяВысота       = 3;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
