
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Элементы.ИдентификаторДействия.Видимость = РольДоступна("ПолныеПрава");
		Элементы.СписокКонтекстноеМенюКнопкаПоказатьИдентификаторы.Видимость = НЕ Элементы.ИдентификаторДействия.Видимость;
	Иначе
		Элементы.ИдентификаторДействия.Видимость = РольДоступна("АдминистраторСистемы")	ИЛИ РольДоступна("Администрирование");
		Элементы.СписокКонтекстноеМенюКнопкаПоказатьИдентификаторы.Видимость = НЕ Элементы.ИдентификаторДействия.Видимость;		
	КонецЕсли;
	
	Элементы.Описание.Ширина = ?(Элементы.ИдентификаторДействия.Видимость, 29, 39);
	ИспользуетсяРасширениеМессенджер = ОбщегоНазначенияСтоматология.ИспользуетсяРасширение("Мессенджер");
	
КонецПроцедуры

&НаКлиенте
// Процедура - При открытии
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриОткрытии(Отказ)

	Если НЕ ЗначениеЗаполнено(ОтборПериод) Тогда 
		ОтборПериод.Вариант = ВариантСтандартногоПериода.ЭтаНеделя;
	КонецЕсли;
	УстановитьПериодНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Выбрать период планирования
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВыбратьПериодПланирования(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = ОтборПериод;
	Диалог.Показать(Новый ОписаниеОповещения("ОтборПериодаПланированииПриИзменении", ЭтаФорма)); 
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить фильтрацию по статусу запланировано
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ДобавитьФильтрациюПоСтатусуЗапланировано(Команда)
	
	ОбновитьСписокНаСервере("Запланировано");
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить фильтрацию по статусу зарегистрировано
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ДобавитьФильтрациюПоСтатусуЗарегистрировано(Команда)
	
	ОбновитьСписокНаСервере("Зарегистрировано");
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить фильтрацию по статусу отклонено
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ДобавитьФильтрациюПоСтатусуОтклонено(Команда)
	
	ОбновитьСписокНаСервере("Отклонено");
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить фильтрацию по статусу ошибка
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ДобавитьФильтрациюПоСтатусуОшибка(Команда)
	
	ОбновитьСписокНаСервере("ОшибкаРегистрации");
	
КонецПроцедуры

&НаКлиенте
// Процедура - Показать идентификаторы
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПоказатьИдентификаторы(Команда)
	
	Элементы.ИдентификаторДействия.Видимость = Истина;
	Элементы.Описание.Ширина = ?(Элементы.ИдентификаторДействия.Видимость, 29, 39);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - Отбор периода планировании при изменении
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ОтборПериодаПланированииПриИзменении(Результат, ДополнительныеПараметры) Экспорт 
	
	Если НЕ Результат = Неопределено Тогда
		
		ЭтоОчистка = Результат.ДатаНачала = Дата(1,1,1);
		
		Если Не ЗначениеЗаполнено(Результат.ДатаОкончания) Тогда
			Результат.ДатаОкончания = КонецМесяца(?(ЗначениеЗаполнено(Результат.ДатаНачала), Результат.ДатаНачала, ОбщегоНазначенияСтоматология.ТекущаяСервернаяДатаНаСервере()));		
		КонецЕсли;
		
		Если Год(Результат.ДатаОкончания) - Год(Результат.ДатаНачала) > 1 Тогда
			Результат.ДатаНачала = ДобавитьМесяц(Результат.ДатаОкончания, -12);	
		КонецЕсли;
		
		ОтборПериод = Результат;
		УстановитьПериодНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить список на сервере
//
// Параметры:
//  Статус	 - 	 - 
//
Процедура ОбновитьСписокНаСервере(Статус)
	
	Если Статус = "Запланировано" Тогда 
		ЭлементСписка = СписокСтатусов.НайтиПоЗначению(Перечисления.СтатусыРегистрацииСобытий[Статус]);
		Если ЭлементСписка = Неопределено Тогда 
			СписокСтатусов.Добавить(Перечисления.СтатусыРегистрацииСобытий[Статус]);
			Элементы.ГруппаКнопкиФильтр_Запланировано.ЦветФона 					= Новый Цвет(25, 116, 206);
			Элементы.ДобавитьФильтрациюПоСтатусуЗапланировано.ЦветТекста 		= Новый Цвет(255, 255, 255);
		Иначе 
			СписокСтатусов.Удалить(ЭлементСписка);
			Элементы.ГруппаКнопкиФильтр_Запланировано.ЦветФона 					= Новый Цвет(242, 242, 242);
			Элементы.ДобавитьФильтрациюПоСтатусуЗапланировано.ЦветТекста 		= Новый Цвет();		
		КонецЕсли;	
	ИначеЕсли Статус = "Зарегистрировано" Тогда
		ЭлементСписка = СписокСтатусов.НайтиПоЗначению(Перечисления.СтатусыРегистрацииСобытий[Статус]);
		Если ЭлементСписка = Неопределено Тогда 
			СписокСтатусов.Добавить(Перечисления.СтатусыРегистрацииСобытий[Статус]);
			Элементы.ГруппаКнопкиФильтр_Зарегистрировано.ЦветФона 				= Новый Цвет(25, 116, 206);
			Элементы.ДобавитьФильтрациюПоСтатусуЗарегистрировано.ЦветТекста 	= Новый Цвет(255, 255, 255);
		Иначе 
			СписокСтатусов.Удалить(ЭлементСписка);
			Элементы.ГруппаКнопкиФильтр_Зарегистрировано.ЦветФона 				= Новый Цвет(242, 242, 242);
			Элементы.ДобавитьФильтрациюПоСтатусуЗарегистрировано.ЦветТекста 	= Новый Цвет();		
		КонецЕсли;	
	ИначеЕсли Статус = "Отклонено" Тогда
		ЭлементСписка = СписокСтатусов.НайтиПоЗначению(Перечисления.СтатусыРегистрацииСобытий[Статус]);
		Если ЭлементСписка = Неопределено Тогда 
			СписокСтатусов.Добавить(Перечисления.СтатусыРегистрацииСобытий[Статус]);
			Элементы.ГруппаКнопкиФильтр_Отклонено.ЦветФона 						= Новый Цвет(25, 116, 206);
			Элементы.ДобавитьФильтрациюПоСтатусуОтклонено.ЦветТекста 			= Новый Цвет(255, 255, 255);
		Иначе 
			СписокСтатусов.Удалить(ЭлементСписка);
			Элементы.ГруппаКнопкиФильтр_Отклонено.ЦветФона 						= Новый Цвет(242, 242, 242);
			Элементы.ДобавитьФильтрациюПоСтатусуОтклонено.ЦветТекста 			= Новый Цвет();		
		КонецЕсли;	
	ИначеЕсли Статус = "ОшибкаРегистрации" Тогда
		ЭлементСписка = СписокСтатусов.НайтиПоЗначению(Перечисления.СтатусыРегистрацииСобытий[Статус]);
		Если ЭлементСписка = Неопределено Тогда 
			СписокСтатусов.Добавить(Перечисления.СтатусыРегистрацииСобытий[Статус]);
			Элементы.ГруппаКнопкиФильтр_Ошибка.ЦветФона 						= Новый Цвет(25, 116, 206);
			Элементы.ДобавитьФильтрациюПоСтатусуОшибка.ЦветТекста 				= Новый Цвет(255, 255, 255);
		Иначе 
			СписокСтатусов.Удалить(ЭлементСписка);
			Элементы.ГруппаКнопкиФильтр_Ошибка.ЦветФона 						= Новый Цвет(242, 242, 242);
			Элементы.ДобавитьФильтрациюПоСтатусуОшибка.ЦветТекста 				= Новый Цвет();		
		КонецЕсли;	
	КонецЕсли;
	
	Если СписокСтатусов.Количество() = 0 Тогда 
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Статус", СписокСтатусов.ВыгрузитьЗначения(), Истина, ВидСравненияКомпоновкиДанных.НеВСписке);
	Иначе 
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Статус", СписокСтатусов.ВыгрузитьЗначения(), Истина, ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Список выбор
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбраннаяСтрока		 - 	 - 
//  Поле				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда 
		Если Поле.Имя = "Контрагент" И ЗначениеЗаполнено(ТекущиеДанные.Контрагент) Тогда
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение( , ТекущиеДанные.Контрагент);
		ИначеЕсли Поле.Имя = "ОбъектСобытия" И ЗначениеЗаполнено(ТекущиеДанные.ОбъектСобытия) Тогда	
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение( , ТекущиеДанные.ОбъектСобытия);
		ИначеЕсли Поле.Имя = "ИсточникСобытия" И ЗначениеЗаполнено(ТекущиеДанные.ИсточникСобытия) Тогда	
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение( , ТекущиеДанные.ИсточникСобытия);			
		ИначеЕсли Поле.Имя = "Взаимодействие" И ЗначениеЗаполнено(ТекущиеДанные.Взаимодействие) Тогда	
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение( , ТекущиеДанные.Взаимодействие);
		ИначеЕсли Поле.Имя = "Взаимодействие" И ЗначениеЗаполнено(ТекущиеДанные.Сделка) Тогда	
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение( , ТекущиеДанные.Сделка);
		ИначеЕсли Поле.Имя = "Взаимодействие" И ЗначениеЗаполнено(ТекущиеДанные.SMSРассылка) Тогда	
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение( , ТекущиеДанные.SMSРассылка);				
		ИначеЕсли Поле.Имя = "Взаимодействие" И ЗначениеЗаполнено(ТекущиеДанные.ЭлектронноеПисьмоИсходящее) Тогда	
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение( , ТекущиеДанные.ЭлектронноеПисьмоИсходящее);
		ИначеЕсли Поле.Имя = "Взаимодействие" И ЗначениеЗаполнено(ТекущиеДанные.IDСообщения) Тогда
			Если НЕ ИспользуетсяРасширениеМессенджер Тогда 
				Возврат;
			КонецЕсли;
			ДанныеДиалога = ПолучитьДанныеДиалога(ТекущиеДанные.IDСообщения);
			
			Если НЕ ЗначениеЗаполнено(ДанныеДиалога.ИдКлиента) ИЛИ НЕ ЗначениеЗаполнено(ДанныеДиалога.ВнешняяСистема) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось получить данные диалога!");
				Возврат;
			КонецЕсли;
			
			ДанныеКаналаСтруктура = Новый Структура;
			ДанныеКаналаСтруктура.Вставить("ИдКлиента"		, ДанныеДиалога.ИдКлиента);
			ДанныеКаналаСтруктура.Вставить("ВнешняяСистема"	, ДанныеДиалога.ВнешняяСистема);
			Если ДанныеДиалога.Свойство("ДанныеПоследнегоСообщения") Тогда 
				ДанныеКаналаСтруктура.Вставить("ИдСообщения", ДанныеДиалога.ДанныеПоследнегоСообщения.ИдСообщения);
			КонецЕсли;	
			СтандартнаяОбработка = Ложь;
			
			ПараметрыОткрытия = Новый Структура("ДанныеКанала", ДанныеКаналаСтруктура);
			
			Оповестить("ОткрытьДиалог", ПараметрыОткрытия);
			ОткрытьФорму("Обработка.Мессенджер_Стоматология.Форма", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.Независимый);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить данные диалога
//
// Параметры:
//  ИдентификаторДиалога - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеДиалога(ИдентификаторДиалога)

	Возврат РегистрыСведений.Диалоги.ПолучитьДанныеДиалога(ИдентификаторДиалога, , Истина);
	
КонецФункции

&НаСервере
// Процедура - Установить период на сервере
//
Процедура УстановитьПериодНаСервере()
	
	ОтборыСписковКлиентСервер.УстановитьДиапазонДатДляСписка(Список, "Период", ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания, Истина);
	СформироватьТекстПериода();
	
КонецПроцедуры

&НаСервере
// Процедура - Сформировать текст периода
//
Процедура СформироватьТекстПериода()
	
	КомандаВыбораПериода = ЭтаФорма.Команды.Найти("УстановитьПериод");
	
	Если ОтборПериод.ДатаНачала = Дата(1,1,1) ИЛИ ОтборПериод.ДатаОкончания = Дата(1,1,1) Тогда 
		Элементы.УстановитьПериод.Заголовок = НСтр("ru = '< не указан >'; en = '< not specified >'");
		Если НЕ КомандаВыбораПериода = Неопределено Тогда 
			КомандаВыбораПериода.Подсказка = НСтр("ru = 'Щелкните для выбора периода'; en = 'Click to select a period.'");
		КонецЕсли;	
	Иначе
		Если ОтборПериод.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда 
			Элементы.УстановитьПериод.Заголовок = Формат(ОтборПериод.ДатаНачала, "ДФ=dd.MM.yy") + " - " + Формат(ОтборПериод.ДатаОкончания, "ДФ=dd.MM.yy");
		Иначе 
			Элементы.УстановитьПериод.Заголовок = Строка(ОтборПериод.Вариант);
		КонецЕсли;
		Если НЕ КомандаВыбораПериода = Неопределено Тогда 
			КомандаВыбораПериода.Подсказка = Элементы.УстановитьПериод.Заголовок;
		КонецЕсли;			
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
