
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция вернет основную специализацию сотрудника.
//
Функция ПолучитьОсновнуюСпециализациюСотрудника(Сотрудник, ТолькоПредопределенные = Истина, ДобавлятьСотруднику = Истина) Экспорт	
	
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
		 Возврат Неопределено;
	КонецЕсли;	 	
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	СотрудникиСпецилазацииСотрудника.Специализация КАК Специализация,
	|	ВЫБОР
	|		КОГДА СотрудникиСпецилазацииСотрудника.Основная
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ПриоритетОсновной
	|ИЗ
	|	Справочник.Сотрудники.СпецилазацииСотрудника КАК СотрудникиСпецилазацииСотрудника
	|ГДЕ
	|	СотрудникиСпецилазацииСотрудника.Ссылка = &Сотрудник
	|	И НЕ СотрудникиСпецилазацииСотрудника.Специализация = ЗНАЧЕНИЕ(Справочник.Специализации.ПустаяСсылка)
	|	И &УсловиеПредопределенных
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриоритетОсновной";
	
	Если ТолькоПредопределенные Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПредопределенных", "СотрудникиСпецилазацииСотрудника.Специализация.Предопределенный = ИСТИНА");
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПредопределенных", "ИСТИНА");
	КонецЕсли;
	
	ВыборкаОсновнойСпециализации = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаОсновнойСпециализации.Следующий() Тогда 
		Возврат ВыборкаОсновнойСпециализации.Специализация;
	Иначе
		Должность = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Сотрудник, "Должность");
		Если ЗначениеЗаполнено(Должность) Тогда
			Специализация = Справочники.Специализации.ИнициализироватьПредопределеннуюСпециализациюПоДолжности(Должность);
			Если ЗначениеЗаполнено(Сотрудник) И ТипЗнч(Сотрудник) = Тип("СправочникСсылка.Сотрудники") И ЗначениеЗаполнено(Специализация) И ДобавлятьСотруднику Тогда 
				Сотрудник_Объект = Сотрудник.ПолучитьОбъект();
				ЗаполнитьЗначенияСвойств(Сотрудник_Объект.СпецилазацииСотрудника.Добавить(), Новый Структура("Специализация, Основная", Специализация, Сотрудник_Объект.СпецилазацииСотрудника.Количество() <= 1));  
				Попытка
					ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Сотрудник_Объект);
				Исключение
					
				КонецПопытки;	
			КонецЕсли;
			Возврат Специализация;
		Иначе 
			Возврат Справочники.Специализации.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;

КонецФункции

// Функция - Получить массив сотрудников по специализации
//
// Параметры:
//  Специализация	 - 	 - 
//  ТолькоПоОсновным - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивСотрудниковПоСпециализации(Специализация, ТолькоПоОсновным = Ложь) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Специализация) Тогда
		 Возврат Новый Массив;
	КонецЕсли;	 	
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Специализация", Специализация);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И Сотрудники.ЭтоГруппа = ЛОЖЬ
	|	И Сотрудники.Служебный = ЛОЖЬ
	|	И Сотрудники.СпецилазацииСотрудника.Специализация = &Специализация
	|	И &УсловиеОсновные";
	
	Если ТолькоПоОсновным Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОсновные", "Сотрудники.СпецилазацииСотрудника.Основная = &Основная");
		Запрос.УстановитьПараметр("Основная", ТолькоПоОсновным);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеОсновные", "");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Функция - Проверить сотрудник является новым для структурной единицы.
//
// Параметры:
//  Сотрудник			 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПроверитьСотрудникЯвляетсяНовымДляСтруктурнойЕдиницы(Сотрудник, СтруктурнаяЕдиница = Неопределено) Экспорт	
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда			
		Возврат Ложь;			
	ИначеЕсли Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда 	
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;			
	КонецЕсли;	 	
	
	ДатаПриема = РегистрыСведений.НастройкиСотрудников.ПолучитьДатуПриемаСотрудника(Сотрудник, СтруктурнаяЕдиница);
	
	Возврат ?(ЗначениеЗаполнено(ДатаПриема), ТекущаяДатаСеанса() < ДобавитьМесяц(ДатаПриема, 3), Ложь);
	
КонецФункции

// Функция - Представление ФИОСотрудника
//
// Параметры:
//  Сотрудник	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПредставлениеФИОСотрудника(Сотрудник) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат НСтр("ru = '<Сотрудник не найден>'; en = 'Employee not found'");
	ИначеЕсли ТипЗнч(Сотрудник) = Тип("Строка") Тогда 
		Возврат Сотрудник;
	КонецЕсли;
	
	ДанныеСотрудника = ЗначенияРеквизитов(Сотрудник, "Фамилия, Имя, Отчество, Наименование"); 
	
	Фамилия          = ДанныеСотрудника.Фамилия; 
	ФамилияЗаполнена = ЗначениеЗаполнено(Фамилия); 
	Имя              = ДанныеСотрудника.Имя;
	ИмяЗаполнено     = ЗначениеЗаполнено(Имя); 
	
	Если ФамилияЗаполнена ИЛИ ИмяЗаполнено Тогда 
		
		Отчество = ДанныеСотрудника.Отчество;
		
		Возврат ?(ФамилияЗаполнена	, "" + ВРег(Лев(СокрЛП(Фамилия), 1)) + НРег(Сред(СокрЛП(Фамилия), 2)), "") + 
		?(ИмяЗаполнено, ?(НЕ ФамилияЗаполнена, ВРег(Лев(СокрЛП(Имя), 1)) + НРег(Сред(СокрЛП(Имя), 2)), Символ(160) + ВРег(Лев(СокрЛП(Имя), 1)) + "."), "") + 
		?(ЗначениеЗаполнено(Отчество), " " + Лев(СокрЛП(Отчество), 1) + ".", "");
		
	Иначе
		Возврат ДанныеСотрудника.Наименование;
	КонецЕсли;
	
КонецФункции

// Функция - Представление ФИОСотрудника по структуре данных.
//
// Параметры:
//  СтруктураСотрудник	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПредставлениеФИОСотрудникаПоСтруктуреДанных(СтруктураСотрудник) Экспорт
		
	Фамилия          = СтруктураСотрудник.Фамилия; 
	ФамилияЗаполнена = ЗначениеЗаполнено(Фамилия); 
	Имя              = СтруктураСотрудник.Имя;
	ИмяЗаполнено     = ЗначениеЗаполнено(Имя); 
	
	Если ФамилияЗаполнена ИЛИ ИмяЗаполнено Тогда 
		
		Отчество = СтруктураСотрудник.Отчество;
		
		Возврат ?(ФамилияЗаполнена, "" + Фамилия, "")
                  + ?(ИмяЗаполнено, " " + Лев(СокрЛП(Имя), 1) + ".", "")
                  + ?(ЗначениеЗаполнено(Отчество), " " + Лев(СокрЛП(Отчество), 1) + ".", "");
	Иначе
		Возврат СтруктураСотрудник.Наименование;
	КонецЕсли;	
	
КонецФункции

// Функция - Получить сокращенное наименование сотрудника
//
// Параметры:
//  СтруктураНаименованияСотрудника	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСокращенноеНаименованиеСотрудника(СтруктураНаименованияСотрудника = Неопределено, Сотрудник = Неопределено) Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если СтруктураНаименованияСотрудника = Неопределено Тогда
		Если Сотрудник = Неопределено Тогда 
			Возврат "";
		Иначе 
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	Сотрудники.Наименование КАК Наименование,
			               |	Сотрудники.Имя КАК Имя,
			               |	Сотрудники.Отчество КАК Отчество,
			               |	Сотрудники.Фамилия КАК Фамилия,
			               |	Сотрудники.НаименованиеСокращенное КАК НаименованиеСокращенное
			               |ИЗ
			               |	Справочник.Сотрудники КАК Сотрудники
			               |ГДЕ
			               |	Сотрудники.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Сотрудник);
			ВыборкаСотрудника = Запрос.Выполнить().Выбрать();
			Если ВыборкаСотрудника.Следующий() Тогда
				Если ЗначениеЗаполнено(СокрЛП(ВыборкаСотрудника.НаименованиеСокращенное)) Тогда 
					Возврат СокрЛП(ВыборкаСотрудника.НаименованиеСокращенное);
				Иначе 	
					СтруктураНаименованияСотрудника = Новый Структура;
					СтруктураНаименованияСотрудника.Вставить("Фамилия"		, ВыборкаСотрудника.Фамилия);
					СтруктураНаименованияСотрудника.Вставить("Имя"			, ВыборкаСотрудника.Имя);
					СтруктураНаименованияСотрудника.Вставить("Отчество"		, ВыборкаСотрудника.Отчество);
					СтруктураНаименованияСотрудника.Вставить("Наименование"	, ВыборкаСотрудника.Наименование);
					
					Возврат ПолучитьСокращенноеНаименованиеСотрудника(СтруктураНаименованияСотрудника);
				КонецЕсли;
			Иначе 
				Возврат Строка(Сотрудник);
			КонецЕсли;	
		КонецЕсли;
	Иначе 	
		ФамилияЗаполнена = ЗначениеЗаполнено(СтруктураНаименованияСотрудника.Фамилия); 
		ИмяЗаполнено     = ЗначениеЗаполнено(СтруктураНаименованияСотрудника.Имя); 
		
		Если ФамилияЗаполнена ИЛИ ИмяЗаполнено Тогда 
			ОтчествоЗаполнено = ЗначениеЗаполнено(СтруктураНаименованияСотрудника.Отчество);
			
			Возврат ?(ФамилияЗаполнена	, "" + ВРег(Лев(СокрЛП(СтруктураНаименованияСотрудника.Фамилия), 1)) + НРег(Сред(СокрЛП(СтруктураНаименованияСотрудника.Фамилия), 2)), "") + 
			?(ИмяЗаполнено		, ?(НЕ ФамилияЗаполнена, ВРег(Лев(СокрЛП(СтруктураНаименованияСотрудника.Имя), 1)) + НРег(Сред(СокрЛП(СтруктураНаименованияСотрудника.Имя), 2)), Символ(160) + ВРег(Лев(СокрЛП(СтруктураНаименованияСотрудника.Имя), 1)) + "."), "") + 
			?(ОтчествоЗаполнено	, Символ(160) + ВРег(Лев(СокрЛП(СтруктураНаименованияСотрудника.Отчество), 1)) + ".", "");
		Иначе
			Возврат СтруктураНаименованияСотрудника.Наименование;
		КонецЕсли;	
	КонецЕсли;

КонецФункции

// Функция - Получить представление сотрудника по настройке отображения.
//
Функция ПолучитьПредставлениеСотрудникаПоНастройкеОтображения(Сотрудник, ОтображениеСотрудника) Экспорт
		
	Представление = "";
	
	// Фамилия Имя Отчество.
	Если ОтображениеСотрудника = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеСотрудникаВариант1 Тогда
		
		Если ЗначениеЗаполнено(Сотрудник.Наименование) Тогда
		     Представление = Сотрудник.Наименование;
		Иначе
			 Представление = СокрЛП(Сотрудник.Фамилия) + ?(ЗначениеЗаполнено(Сотрудник.Имя) 
			 	И ЗначениеЗаполнено(Сотрудник.Фамилия), " " + СокрЛП(Сотрудник.Имя), СокрЛП(Сотрудник.Имя));
		 КонецЕсли;
		 
	// Фамилия Имя.
	ИначеЕсли ОтображениеСотрудника = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеСотрудникаВариант2 Тогда
		
		Представление = СокрЛП(Сотрудник.Фамилия) + ?(ЗначениеЗаполнено(Сотрудник.Имя) 
			И ЗначениеЗаполнено(Сотрудник.Фамилия), " " + СокрЛП(Сотрудник.Имя), СокрЛП(Сотрудник.Имя));
		
	// Фамилия И.О.
	ИначеЕсли ОтображениеСотрудника = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеСотрудникаВариант3
		И (ЗначениеЗаполнено(Сотрудник.Фамилия) ИЛИ ЗначениеЗаполнено(Сотрудник.Имя)) Тогда
		
		Представление = ?(ЗначениеЗаполнено(Сотрудник.Фамилия),
		Сотрудник.Фамилия + "","") + ?(ЗначениеЗаполнено(Сотрудник.Имя),
		" " + Лев(СокрЛП(Сотрудник.Имя), 1) + ".","") + ?(ЗначениеЗаполнено(Сотрудник.Отчество), " " 
			+ Лев(СокрЛП(Сотрудник.Отчество), 1) + ".", "");			
	// Имя.
	ИначеЕсли ОтображениеСотрудника = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеСотрудникаВариант4
		И ЗначениеЗаполнено(Сотрудник.Имя) Тогда
		
		Представление = СокрЛП(Сотрудник.Имя);
		
	// Представление в онлайн-записи.
	ИначеЕсли ОтображениеСотрудника = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеСотрудникаВариант5
		И ЗначениеЗаполнено(Сотрудник.ПредставлениеДляОнлайнЗаписи) Тогда
		
		Представление = СокрЛП(Сотрудник.ПредставлениеДляОнлайнЗаписи);
	Иначе
		Представление = СокрЛП(Сотрудник.Наименование);	
	КонецЕсли;
	
	Возврат Представление;

КонецФункции

// Функция - Получить места работы сотрудника
//
// Параметры:
//  Сотрудник					 - 	 - 
//  ТипВозвращаемыхДанных		 - 	 - 
//  ВыбраннаяСтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМестаРаботыСотрудника(Сотрудник
									, ТипВозвращаемыхДанных = "Список"
									, ВыбраннаяСтруктурнаяЕдиница = Неопределено
									, ДобавлятьТекущую = Ложь
									, ИспользоватьЗакешированноеЗначение = Истина) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда 
		Сотрудник = ПараметрыСеанса.ТекущийСотрудник;
	ИначеЕсли ТипЗнч(Сотрудник) = Тип("СправочникСсылка.Пользователи") Тогда
		Сотрудник = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Сотрудник,"Сотрудник");
	КонецЕсли;
	
	Если ИспользоватьЗакешированноеЗначение Тогда 
		ТаблицаКлиник = ОбщегоНазначенияПовтИспСтоматология.ПолучитьДоступныеКлиникиДляРаботыСотрудника(Сотрудник);
	Иначе 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Сотрудник"	, Сотрудник);
		Запрос.УстановитьПараметр("ТекущаяДата"	, ТекущаяДатаСеанса());		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница) КАК Представление
		|ИЗ
		|	Справочник.Сотрудники.ДоступныеСтруктурныеЕдиницы КАК СотрудникиДоступныеСтруктурныеЕдиницы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСотрудников КАК Сотрудники
		|		ПО СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница = Сотрудники.СтруктурнаяЕдиница
		|			И СотрудникиДоступныеСтруктурныеЕдиницы.Ссылка = Сотрудники.Сотрудник
		|ГДЕ
		|	СотрудникиДоступныеСтруктурныеЕдиницы.Ссылка = &Сотрудник
		|	И ВЫБОР
		|			КОГДА ЕСТЬNULL(Сотрудники.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Сотрудники.ДатаУвольнения > &ТекущаяДата
		|		КОНЕЦ
		|	И СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница.ПометкаУдаления = ЛОЖЬ
		|	И СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница.ЭтоГруппа = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница.Наименование";
		
		
		ТаблицаКлиник = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	Если ДобавлятьТекущую Тогда
		ТекущаяСтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
		Если ЗначениеЗаполнено(ТекущаяСтруктурнаяЕдиница) И ТаблицаКлиник.Найти(ТекущаяСтруктурнаяЕдиница, "СтруктурнаяЕдиница") = Неопределено Тогда
			Если ТипВозвращаемыхДанных = "Список" Тогда
				ТекущаяКлиникаПредставление = Строка(ТекущаяСтруктурнаяЕдиница);			
				ЗаполнитьЗначенияСвойств(ТаблицаКлиник.Добавить(), Новый Структура("СтруктурнаяЕдиница, Представление", ТекущаяСтруктурнаяЕдиница, ТекущаяКлиникаПредставление));
			Иначе 
				ЗаполнитьЗначенияСвойств(ТаблицаКлиник.Добавить(), Новый Структура("СтруктурнаяЕдиница, Представление", ТекущаяСтруктурнаяЕдиница, ""));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если ТипВозвращаемыхДанных = "Список" Тогда  
		СписокСтруктурныхЕдиниц = Новый СписокЗначений;
		Для Каждого СтрокаТаблицы Из ТаблицаКлиник Цикл 
			СписокСтруктурныхЕдиниц.Добавить(СтрокаТаблицы.СтруктурнаяЕдиница, СокрЛП(СтрокаТаблицы.Представление), СтрокаТаблицы.СтруктурнаяЕдиница = ?(ЗначениеЗаполнено(ВыбраннаяСтруктурнаяЕдиница), ВыбраннаяСтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница));			
		КонецЦикла;
		Возврат СписокСтруктурныхЕдиниц;
	Иначе 
		Возврат ТаблицаКлиник.ВыгрузитьКолонку("СтруктурнаяЕдиница");
	КонецЕсли;	

КонецФункции

// Функция - Получить служебного сотрудника
//
// Параметры:
//  Наименование - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСлужебногоСотрудника(Наименование = Неопределено) Экспорт
	
	// Служебные сотрудники:
	// <Не указан>
	// Служебный пользователь API (не удалять!)
	// Служебный Моби (не удалять!)
	// СоДоступ
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда 
		Наименование = "<Не указан>";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСлужебногоСотрудника", Наименование);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Служебный
	|	И Сотрудники.Наименование ПОДОБНО &НаименованиеСлужебногоСотрудника";
	
	ВыборкаСлужебного = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаСлужебного.Следующий() Тогда 
		Возврат ВыборкаСлужебного.Ссылка;
	Иначе 
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции	

// Функция, возвращает структуру контактной информации.
//
Функция ПолучитьКонтактнуюИнформацию(Сотрудник, ДобавитьКодСтраны = Ложь) Экспорт
	
	EmailСтроки = Сотрудник.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
	Email = Неопределено;
	Если EmailСтроки.Количество() > 0 Тогда
	  Email = EmailСтроки[0].АдресЭП;
	КонецЕсли;
	
	ТелефонСтроки = Сотрудник.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
	НомерТелефона = Неопределено;
	Если ТелефонСтроки.Количество() > 0 Тогда
		
		НомерТелефона = ТелефонСтроки[0].НомерТелефона;
		
		СписокПолей = Новый СписокЗначений;
		УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(НомерТелефона, СписокПолей); 
		НомерТелефона = ?(ДобавитьКодСтраны, СписокПолей[0].Значение, "") + СписокПолей[1].Значение + СписокПолей[2].Значение;
		
	КонецЕсли;
	
	Возврат Новый Структура("Email, Телефон", Email, НомерТелефона);
	
КонецФункции

// Процедура - Записать фото сотрудника
//
// Параметры:
//  Сотрудник	 - 	 - 
//  ФайлКартинки - 	 - 
//
Процедура ЗаписатьФотоСотрудника(Сотрудник, ФайлКартинки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	Сотрудник_Объект = Сотрудник.ПолучитьОбъект();
	Сотрудник_Объект.ФайлКартинки = ФайлКартинки;
	//Сотрудник_Объект.ОбменДанными.Загрузка = Истина;
	Попытка
		Сотрудник_Объект.Записать();
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры	

// Процедура - Удалить фото сотрудника
//
// Параметры:
//  Сотрудник	 - 	 - 
//
Процедура УдалитьФотоСотрудника(Сотрудник) Экспорт

	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Сотрудник_Объект = Сотрудник.ПолучитьОбъект();
	Сотрудник_Объект.ФайлКартинки = Неопределено;
	//Сотрудник_Объект.ОбменДанными.Загрузка = Истина;
	Попытка
		Сотрудник_Объект.Записать();
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

// Процедура - Обновить данные сотрудника
//
// Параметры:
//  Сотрудник		 - 	 - 
//  ДанныеСотрудника - 	 - 
//
Процедура ОбновитьДанныеСотрудника(Сотрудник, ДанныеСотрудника) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеСотрудника) ИЛИ НЕ ТипЗнч(ДанныеСотрудника) = Тип("Структура") Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	Сотрудник_Объект = Сотрудник.ПолучитьОбъект();
	ЗаполнитьЗначенияСвойств(Сотрудник_Объект, ДанныеСотрудника);
	Сотрудник_Объект.Наименование = СокрЛП(СокрЛП(Сотрудник_Объект.Фамилия) + ?(ЗначениеЗаполнено(Сотрудник_Объект.Имя),  
									" " + СокрЛП(Сотрудник_Объект.Имя) + ?(ЗначениеЗаполнено(Сотрудник_Объект.Отчество), 
									" " + СокрЛП(Сотрудник_Объект.Отчество), ""), ""));
	Попытка
		Сотрудник_Объект.Записать();
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

// Функция - Получить массив сотрудников с ролью пользователя
//
// Параметры:
//  РольПользователя - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивСотрудниковСРольюПользователя(РольПользователя) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РольПользователя", РольПользователя);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И Сотрудники.ЭтоГруппа = ЛОЖЬ
	|	И Сотрудники.Роль = &РольПользователя
	|	И Сотрудники.ЭтоПользовательИБ = ИСТИНА
	|	И Сотрудники.Служебный = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Пользователи.Сотрудник
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ПометкаУдаления = ЛОЖЬ
	|	И Пользователи.Недействителен = ЛОЖЬ
	|	И Пользователи.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И Пользователи.РольПользователя = &РольПользователя
	|	И Пользователи.ЭтоПользовательИБ = ИСТИНА";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции

// Функция - Получить сотрудника если к нему привязан выбранный контрагент.
//
Функция ПолучитьСотрудникаПоКонтагенту(Контрагент) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Контрагент = &Контрагент
	|	И НЕ Сотрудники.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Возврат Запрос.Выполнить().Выгрузить();		   	
	
КонецФункции

// Функция создает папки справочника "Сотрудники" по умолчанию.
//
Процедура ЗаполнитьПоУмолчанию() Экспорт
	
	// Создаем группы элементов в справочнике "Сотрудники"
	ИскомыйЭлемент = Справочники.Сотрудники.НайтиПоНаименованию("Руководство", Истина);
	Если ИскомыйЭлемент.Пустая() Тогда
		Руководство = Справочники.Сотрудники.СоздатьГруппу();
		Руководство.Наименование = "Руководство";
		Руководство.Записать();
	КонецЕсли;
	
	ИскомыйЭлемент = Справочники.Сотрудники.НайтиПоНаименованию("Врачи", Истина);
	Если ИскомыйЭлемент.Пустая() Тогда
		Врачи = Справочники.Сотрудники.СоздатьГруппу();
		Врачи.Наименование = "Врачи";
		Врачи.Записать();
	КонецЕсли;  
	
	ИскомыйЭлемент = Справочники.Сотрудники.НайтиПоНаименованию("Регистратура", Истина);
	Если ИскомыйЭлемент.Пустая() Тогда
		Регистратура = Справочники.Сотрудники.СоздатьГруппу();
		Регистратура.Наименование = "Регистратура";
		Регистратура.Записать();
	КонецЕсли;
	
	ИскомыйЭлемент = Справочники.Сотрудники.НайтиПоНаименованию("Уволенные сотрудники", Истина);
	Если ИскомыйЭлемент.Пустая() Тогда
		УволенныеСотрудники = Справочники.Сотрудники.СоздатьГруппу();
		УволенныеСотрудники.Наименование = "Уволенные сотрудники";
		УволенныеСотрудники.Записать();
	КонецЕсли; 
	
КонецПроцедуры

// Функция - Отбор сотрудников для приема
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСписокВрачейДляПриема(СтруктураПараметров) Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СправочникСотрудники.Ссылка КАК Сотрудник
		|ИЗ
		|	Справочник.Сотрудники КАК СправочникСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
		|		ПО СправочникСотрудники.Ссылка = НастройкиСотрудников.Сотрудник
		|			И (НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)
		|ГДЕ
		|	СправочникСотрудники.ЭтоГруппа = ЛОЖЬ
		|	И (СправочникСотрудники.Ссылка В
		|				(ВЫБРАТЬ
		|					СвязкаПомещениеСотрудник.Сотрудник
		|				ИЗ
		|					РегистрСведений.СвязкаПомещениеСотрудник КАК СвязкаПомещениеСотрудник
		|				ГДЕ
		|					СвязкаПомещениеСотрудник.Помещение.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)
		|			ИЛИ НЕ СправочникСотрудники.Ссылка В
		|					(ВЫБРАТЬ
		|						СвязкаПомещениеСотрудник.Сотрудник
		|					ИЗ
		|						РегистрСведений.СвязкаПомещениеСотрудник КАК СвязкаПомещениеСотрудник))
		|	И СправочникСотрудники.ПометкаУдаления = ЛОЖЬ
		|	И (НастройкиСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ НастройкиСотрудников.ДатаУвольнения > &Дата)
		|	И (НастройкиСотрудников.Сотрудник.Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.Врач)
		|			ИЛИ НастройкиСотрудников.Сотрудник.Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.ГлавныйВрач)
		|			ИЛИ &ЭтоАссистент)
		|	И СправочникСотрудники.Ссылка <> &Сотрудник
		|	И СправочникСотрудники.Служебный = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	СправочникСотрудники.Ссылка,
		|	СправочникСотрудники.Представление";
	
	Если СтруктураПараметров.Свойство("ЭтоАссистент") Тогда
		
		ТекстЗамены = "ИЛИ НастройкиСотрудников.Сотрудник.Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.Ассистент)";
		
	Иначе
		
		ТекстЗамены = "";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИЛИ &ЭтоАссистент", ТекстЗамены);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, СтруктураПараметров.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Дата"				, СтруктураПараметров.Дата);
	Запрос.УстановитьПараметр("Сотрудник"			, СтруктураПараметров.Сотрудник);
	
	ФиксированныйМассив = Новый ФиксированныйМассив(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник"));
	Возврат ФиксированныйМассив;
	
КонецФункции

#Область ЗагрузкаДанныхИзВнешнегоИсточника

//// Процедура - Добавить контакнтную информацию.
////
//// Параметры:
////  ЭлементСправочника	 - 	 - 
////  ПредставлениеКИ		 - 	 - 
////  ВидКИ				 - 	 - 
////
//Процедура ДобавитьКИ(ЭлементСправочника, ПредставлениеКИ, ВидКИ)
//	
//	ЗначениеКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(ПредставлениеКИ, ВидКИ);
//	УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ЭлементСправочника, ЗначениеКИ, ВидКИ, ВидКИ.Тип);
//	
//КонецПроцедуры

// Процедура - При определении значения по умолчанию.
//
// Параметры:
//  СправочникСсылка	 - 	 - 
//  ИмяРеквизита		 - 	 - 
//  ВходящиеДанные		 - 	 - 
//  СтрокаСопоставлена	 - 	 - 
//  ОбновлятьДанные		 - 	 - 
//  ЗначениеПоУмолчанию	 - 	 - 
//
Процедура ПриОпределенииЗначенияПоУмолчанию(СправочникСсылка, ИмяРеквизита, ВходящиеДанные, СтрокаСопоставлена, ОбновлятьДанные, ЗначениеПоУмолчанию)
	
	Если СтрокаСопоставлена 
		И НЕ ЗначениеЗаполнено(ВходящиеДанные) Тогда
		
		ЗначениеПоУмолчанию = СправочникСсылка[ИмяРеквизита];
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - При определении образцов загрузки данных.
//
// Параметры:
//  НастройкиЗагрузкиДанных	 - 	 - 
//  УникальныйИдентификатор	 - 	 - 
//
Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
	
КонецПроцедуры

// Процедура - Поля загрузки данных из внешнего источника.
//
// Параметры:
//  ТаблицаПолейЗагрузки	 - 	 - 
//  НастройкиЗагрузкиДанных	 - 	 - 
//
Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт
	
	//
	// Для группы полей действует правило: хотя бы одно поле в группе должно быть выбрано в колонках
	//
	
	ОписаниеТиповСтрока10 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(10));
	ОписаниеТиповСтрока11 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(11));
	ОписаниеТиповСтрока25 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25));
	ОписаниеТиповСтрока50 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100));
	ОписаниеТиповСтрока150 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
	ОписаниеТиповСтрока200 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(200));
	ОписаниеТиповСтрока1000 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000));
	ОписаниеТиповЧисло10_0 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло10_3 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(10, 3, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло15_2 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло15_3 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповДата = Новый ОписаниеТипов("Дата", , , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
	ОписаниеТиповПеречисление = Новый ОписаниеТипов("ПеречислениеСсылка.РольПользователя");

	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Сотрудник", "Сотрудник (наименование)", ОписаниеТиповСтрока100, ОписаниеТиповКолонка,,, Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "КодСинхронизации", "Код синхронизации", ОписаниеТиповСтрока100, ОписаниеТиповСтрока100);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Родитель", "Группа", ОписаниеТиповСтрока100, ОписаниеТиповКолонка,,,Истина);	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "РольПользователя", "Роль", ОписаниеТиповСтрока100, ОписаниеТиповПеречисление,,,Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Телефон", "Телефон", ОписаниеТиповСтрока100, ОписаниеТиповСтрока100);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "АдресЭП", "E-mail", ОписаниеТиповСтрока100, ОписаниеТиповСтрока100);	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "АдресФакт", "Адрес", ОписаниеТиповСтрока1000, ОписаниеТиповСтрока1000);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Должность", "Должность", ОписаниеТиповСтрока100, ОписаниеТиповСтрока100);	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ДатаРождения", "Дата рождения", ОписаниеТиповСтрока25, ОписаниеТиповДата);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Комментарий", "Комментарий", ОписаниеТиповСтрока200, ОписаниеТиповСтрока200);	
	
КонецПроцедуры

// Процедура - Сопоставить загружаемые данные из внешнего источника.
//
// Параметры:
//  ПараметрыСопоставления	 - 	 - 
//  АдресРезультата			 - 	 - 
//
Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ПараметрыСопоставления, АдресРезультата) Экспорт
	
	ТаблицаСопоставленияДанных	= ПараметрыСопоставления.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
	НастройкиЗагрузкиДанных		= ПараметрыСопоставления.НастройкиЗагрузкиДанных;
	ОбновлятьДанные				= НастройкиЗагрузкиДанных.ОбновлятьСуществующие;
	
	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		СтрокаТаблицыФормы.Сотрудник = Справочники.Сотрудники.НайтиПоНаименованию(СтрокаТаблицыФормы.Сотрудник_ВходящиеДанные, Истина);
		ЭтаСтрокаСопоставлена = ЗначениеЗаполнено(СтрокаТаблицыФормы.Сотрудник);
		
		// Родитель по наименованию
		ЗначениеПоУмолчанию = Справочники.Сотрудники.ПустаяСсылка();
		ПриОпределенииЗначенияПоУмолчанию(СтрокаТаблицыФормы.Сотрудник, "Родитель", СтрокаТаблицыФормы.Родитель_ВходящиеДанные, ЭтаСтрокаСопоставлена, ОбновлятьДанные, ЗначениеПоУмолчанию);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьРодителя("Сотрудники", СтрокаТаблицыФормы.Родитель, СтрокаТаблицыФормы.Родитель_ВходящиеДанные, ЗначениеПоУмолчанию);

		// Роль пользователя
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьРольПользователя(СтрокаТаблицыФормы.РольПользователя, СтрокаТаблицыФормы.РольПользователя_ВходящиеДанные, "");
		
		// КИ (адрес, почта, телефон)		
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.АдресФакт, СтрокаТаблицыФормы.АдресФакт_ВходящиеДанные);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.АдресЭП, СтрокаТаблицыФормы.АдресЭП_ВходящиеДанные);  
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.Телефон, СтрокаТаблицыФормы.Телефон_ВходящиеДанные);
		                              
		// ДатаРождения
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(СтрокаТаблицыФормы.ДатаРождения, СтрокаТаблицыФормы.ДатаРождения_ВходящиеДанные);
		
		// Комментарий
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.Комментарий, СтрокаТаблицыФормы.Комментарий_ВходящиеДанные);
		
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы);
		
		ЗагрузкаДанныхИзВнешнегоИсточника.ПрогрессСопоставленияДанных(ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицыФормы), РазмерТаблицыДанных);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаСопоставленияДанных, АдресРезультата);
	
КонецПроцедуры

// Процедура - Проверить корректность данных в строке таблицы.
//
// Параметры:
//  СтрокаТаблицыФормы			 - 	 - 
//  ПолноеИмяОбъектаЗаполнения	 - 	 - 
//
Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	СтрокаТаблицыФормы._СтрокаСопоставлена = ЗначениеЗаполнено(СтрокаТаблицыФормы.Сотрудник);
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	
	СтрокаТаблицыФормы[ИмяСлужебногоПоля] = СтрокаТаблицыФормы._СтрокаСопоставлена
											ИЛИ (НЕ СтрокаТаблицыФормы._СтрокаСопоставлена И НЕ ПустаяСтрока(СтрокаТаблицыФормы.Сотрудник_ВходящиеДанные));
	
КонецПроцедуры

// Процедура - Обработать подготовленные данные.
//
// Параметры:
//  СтруктураДанных				 - 	 - 
//  ФоновоеЗаданиеАдресХранилища - 	 - 
//
Процедура ОбработатьПодготовленныеДанные(СтруктураДанных, ФоновоеЗаданиеАдресХранилища = "") Экспорт
	
	НастройкиОбновленияСвойств	= СтруктураДанных.НастройкиЗагрузкиДанных.НастройкиОбновленияСвойств;
	ОбновлятьСуществующие		= СтруктураДанных.НастройкиЗагрузкиДанных.ОбновлятьСуществующие;
	СоздаватьЕслиНеСопоставлено = СтруктураДанных.НастройкиЗагрузкиДанных.СоздаватьЕслиНеСопоставлено;
	ТаблицаСопоставленияДанных	= СтруктураДанных.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
	КоличествоЗаписейТранзакции	= 0;
	ТранзакцияОткрыта			= Ложь;
	
	Попытка
		
		Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			Если НЕ ТранзакцияОткрыта 
				И КоличествоЗаписейТранзакции = 0 Тогда
				
				НачатьТранзакцию();
				ТранзакцияОткрыта = Истина;
				
			КонецЕсли;
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			
			СогласованноеСостояниеСтроки = (СтрокаТаблицы._СтрокаСопоставлена И ОбновлятьСуществующие) 
				ИЛИ (НЕ СтрокаТаблицы._СтрокаСопоставлена И СоздаватьЕслиНеСопоставлено);
			
			Если ЗагрузкаВПриложениеВозможна И СогласованноеСостояниеСтроки Тогда
				
				КоличествоЗаписейТранзакции = КоличествоЗаписейТранзакции + 1;
							
				Если СтрокаТаблицы._СтрокаСопоставлена Тогда
					
					ЭлементСправочника = СтрокаТаблицы.Сотрудник.ПолучитьОбъект();
					ЗаполнитьЗначенияСвойств(ЭлементСправочника, СтрокаТаблицы, НастройкиОбновленияСвойств.ИменаПолейОбновляемые, НастройкиОбновленияСвойств.ИменаПолейНеподлежащихОбновлению);
					
				Иначе
					
					ЭлементСправочника = Справочники.Сотрудники.СоздатьЭлемент();
					ЗаполнитьЗначенияСвойств(ЭлементСправочника, СтрокаТаблицы, , ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СтандартныеИменаПолейНеподлежащихОбновлению(СтруктураДанных.НастройкиЗагрузкиДанных));
					
					Если ЗначениеЗаполнено(СтрокаТаблицы.Родитель_ВходящиеДанные) Тогда  
						
						// Разбить строку на подстроки
						Группа = Неопределено;
						
						МассивСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(СтрокаТаблицы.Родитель_ВходящиеДанные, "|");
						РодительВерхнегоУровня = ?(ЗначениеЗаполнено(ЭлементСправочника.Родитель), ЭлементСправочника.Родитель, Неопределено);
						Для Каждого РодительНаименование Из МассивСлов Цикл
							
							Если ЗначениеЗаполнено(РодительНаименование) Тогда
								
								Группа = НайтиСоздатьГруппу(РодительНаименование, РодительВерхнегоУровня);
								РодительВерхнегоУровня = Группа;
								
							КонецЕсли;
							
						КонецЦикла;
						
						ЭлементСправочника.Родитель = Группа;
						
					КонецЕсли;
					
				КонецЕсли;
				 // Должность
				Если ЗначениеЗаполнено(СтрокаТаблицы.Должность_ВходящиеДанные) Тогда
					ЭлементСправочника.Должность = НайтиСоздатьДолжностьСотрудника(СтрокаТаблицы.Должность_ВходящиеДанные); 
				КонецЕсли;   
				
				// Код синхронизаци
				Если ЗначениеЗаполнено(СтрокаТаблицы.КодСинхронизации_ВходящиеДанные) Тогда
					ЭлементСправочника.КодСинхронизации = СтрокаТаблицы.КодСинхронизации_ВходящиеДанные;
				КонецЕсли;  
				
				// Роль
				Если ЗначениеЗаполнено(СтрокаТаблицы.РольПользователя_ВходящиеДанные) Тогда 
					
					ЭлементСправочника.Роль = СтрокаТаблицы.РольПользователя;
					
				КонецЕсли;	
				
				ФИО = СокрЛП(СтрокаТаблицы.Сотрудник_ВходящиеДанные);
				ЭлементСправочника.Наименование = ФИО;
				ФИО = ОбщегоНазначения.ВернутьФИОКлиента(ФИО);
				ЭлементСправочника.Фамилия 	= ФИО.Фамилия;
				ЭлементСправочника.Имя		= ФИО.Имя;
				ЭлементСправочника.Отчество = ФИО.Отчество;
				 
				// Заполняем данные по контактой информации
				ЗаполнениеКонтактнойИнформации(СтрокаТаблицы, ЭлементСправочника);
				
				ЭлементСправочника.Записать();  
												
			КонецЕсли;
			
			ИндексТекущейстроки = ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицы) + 1;
			ТекстПрогресса      = СтрШаблон(НСтр("ru ='Обработано %1 из %2 строк...'"), ИндексТекущейстроки, РазмерТаблицыДанных);
			ПроцентВыполнения   = Окр(ИндексТекущейстроки * 100 / РазмерТаблицыДанных);
			
			ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, ТекстПрогресса);
			
			Если ТранзакцияОткрыта
				И КоличествоЗаписейТранзакции > ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.МаксимумЗаписейВОднойТранзакции() Тогда
				
				ЗафиксироватьТранзакцию();
				ТранзакцияОткрыта = Ложь;
				КоличествоЗаписейТранзакции = 0;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТранзакцияОткрыта 
			И КоличествоЗаписейТранзакции > 0 Тогда
			
			ЗафиксироватьТранзакцию();
			ТранзакцияОткрыта = Ложь;
			
		КонецЕсли;
		
	Исключение
		
		ЗаписьЖурналаРегистрации(Нстр("ru='Загрузка данных'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Контрагенты, , ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры

// Функция возвращает список имен «ключевых» реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	
	Возврат Результат;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()

// Функция - Найти создать должность сотрудника.
//
// Параметры:
//  Должность	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция НайтиСоздатьДолжностьСотрудника(Должность);
	
	ИскДолжность = Справочники.Должности.НайтиПоНаименованию(Должность, Истина);
	Если ИскДолжность.Пустая() Тогда
		ИскДолжность = Справочники.Должности.СоздатьЭлемент();
		ИскДолжность.Наименование = Должность;
		ИскДолжность.Записать();
	КонецЕсли;
	
	Возврат ИскДолжность.Ссылка;
	
КонецФункции

// Процедура - Заполнение контактной информации.
//
// Параметры:
//  СтрокаТаблицы		 - 	 - 
//  ЭлементСправочника	 - 	 - 
//
Процедура ЗаполнениеКонтактнойИнформации(СтрокаТаблицы, ЭлементСправочника)
	
	Сотрудники_КонтактнаяИнформация = ЭлементСправочника.КонтактнаяИнформация;
	
	Если НЕ ПустаяСтрока(СтрокаТаблицы.АдресФакт) Тогда
		
		Объект_XDTO_Адрес = ПолучитьСтруктуру_XDTO(СтрокаТаблицы.АдресФакт, Перечисления.ТипыКонтактнойИнформации.Адрес);
		
		Если Объект_XDTO_Адрес <> Неопределено Тогда
			
			// Найти в КИ существующий Адрес
			Представление = Объект_XDTO_Адрес.Представление;
			
			НайденныеСтроки = Сотрудники_КонтактнаяИнформация.НайтиСтроки(Новый Структура("Представление, Тип", Представление, Перечисления.ТипыКонтактнойИнформации.Адрес));
			Если НайденныеСтроки.Количество() = 0 Тогда
				ЗаполнитьАдрес(ЭлементСправочника, Объект_XDTO_Адрес , Справочники.ВидыКонтактнойИнформации.АдресСотрудника);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтрокаТаблицы.Телефон) Тогда
		
		МассивТелефонов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаТаблицы.Телефон, ",",Истина, Истина);
		Для Каждого Телефон Из МассивТелефонов Цикл 
			
			СписокПолей = Новый СписокЗначений;
			УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(Телефон, СписокПолей);			
			
			Объект_XDTO_Телефон = ПолучитьСтруктуру_XDTO(СокрЛП(Телефон), Перечисления.ТипыКонтактнойИнформации.Телефон);
			
			Если Объект_XDTO_Телефон <> Неопределено Тогда
				
				// Найти в КИ существующий телефон
				НомерТелефона = Объект_XDTO_Телефон.Состав.Номер;
				НайденныеСтроки = Сотрудники_КонтактнаяИнформация.НайтиСтроки(Новый Структура("НомерТелефона, Тип", НомерТелефона, Перечисления.ТипыКонтактнойИнформации.Телефон));
				Если НайденныеСтроки.Количество() = 0 Тогда
					ЗаполнитьТелефон(ЭлементСправочника, Объект_XDTO_Телефон, Справочники.ВидыКонтактнойИнформации.ТелефонСотрудника);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;	
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтрокаТаблицы.АдресЭП) Тогда
		
		МассивАдресЭП = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаТаблицы.АдресЭП, ",",Истина, Истина);
		Для Каждого АдресЭП Из МассивАдресЭП Цикл 
			
			Объект_XDTO_Email = ПолучитьСтруктуру_XDTO(СокрЛП(АдресЭП), Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			
			Если Объект_XDTO_Email <> Неопределено  Тогда
				
				// Найти в КИ существующий АдресЭлектроннойПочты
				Представление = Объект_XDTO_Email.Представление;
				
				НайденныеСтроки = Сотрудники_КонтактнаяИнформация.НайтиСтроки(Новый Структура("Представление, Тип", Представление, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
				Если НайденныеСтроки.Количество() = 0 Тогда
					ЗаполнитьEmail(ЭлементСправочника, Объект_XDTO_Email, Справочники.ВидыКонтактнойИнформации.EmailПользователя);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;

КонецПроцедуры

// Функция - Получить структуру XDTO телефона
//
// Параметры:
//  Телефон	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтруктуру_XDTO(Представление, ТипКИ)
	
	Если НЕ ЗначениеЗаполнено(Представление) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Объект_XDTO = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOПоПредставлению(Представление, ТипКИ);
	Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда 
		Если НЕ ЗначениеЗаполнено(Объект_XDTO.Состав.Номер) Тогда 
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Объект_XDTO;
	
КонецФункции

// Процедура - Заполнить телефон 
//
// Параметры:
//  НовыйЭлемент		 - 	 - 
//  Объект_XDTO_Телефон	 - 	 - 
//
Процедура ЗаполнитьТелефон(НовыйЭлемент, Знач Объект_XDTO_Телефон, Знач ВидКИ)
	
	Если Объект_XDTO_Телефон = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	НоваяСтрока 						= НовыйЭлемент.КонтактнаяИнформация.Добавить();
	НоваяСтрока.Тип 					= Перечисления.ТипыКонтактнойИнформации.Телефон;
	НоваяСтрока.Вид 					= ВидКИ;
	НоваяСтрока.НомерТелефона 			= СокрЛП(Объект_XDTO_Телефон.Состав.КодСтраны) + СокрЛП(Объект_XDTO_Телефон.Состав.КодГорода) + СокрЛП(СтрЗаменить(Объект_XDTO_Телефон.Состав.Номер, "-", ""));
	НоваяСтрока.НомерТелефонаБезКодов 	= Объект_XDTO_Телефон.Состав.Номер;
	
	НоваяСтрока.ЗначенияПолей 			= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияXMLПоПредставлению(Объект_XDTO_Телефон.Представление,ВидКИ);
	НоваяСтрока.Значение 				= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Объект_XDTO_Телефон.Представление, ВидКИ);

	НоваяСтрока.Представление			= Объект_XDTO_Телефон.Представление;
	//НоваяСтрока.ЗначенияПолей			= УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(Объект_XDTO_Телефон);
	
КонецПроцедуры

// Процедура - Заполнить email 
//
// Параметры:
//  НовыйЭлемент		 - 	 - 
//  Объект_XDTO_Email	 - 	 - 
//
Процедура ЗаполнитьEmail(НовыйЭлемент, Знач Объект_XDTO_Email, Знач ВидКИ)
	
	Если Объект_XDTO_Email = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	НоваяСтрока 				= НовыйЭлемент.КонтактнаяИнформация.Добавить();
	НоваяСтрока.Тип 			= Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	НоваяСтрока.Вид 			= ВидКИ;
	НоваяСтрока.АдресЭП 		= Объект_XDTO_Email.Представление;
	НоваяСтрока.ЗначенияПолей 	= УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(Объект_XDTO_Email);
	НоваяСтрока.Значение 		= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Объект_XDTO_Email.Представление, ВидКИ);
	НоваяСтрока.Представление 	= НоваяСтрока.АдресЭП;
	
КонецПроцедуры

// Процедура - Заполнить адрес
//
// Параметры:
//  НовыйЭлемент		 - 	 - 
//  Объект_XDTO_Адрес	 - 	 - 
//  ВидКИ				 - 	 - 
//
Процедура ЗаполнитьАдрес(НовыйЭлемент, Знач Объект_XDTO_Адрес, Знач ВидКИ)
	
	Если Объект_XDTO_Адрес = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	НоваяСтрока 				= НовыйЭлемент.КонтактнаяИнформация.Добавить();
	НоваяСтрока.Тип 			= Перечисления.ТипыКонтактнойИнформации.Адрес;
	НоваяСтрока.Вид 			= ВидКИ;
	НоваяСтрока.Страна 			= ?(Объект_XDTO_Адрес.Состав.Страна = Неопределено, "", Объект_XDTO_Адрес.Состав.Страна);
	НоваяСтрока.Регион 			= ?(Объект_XDTO_Адрес.Состав.Состав.СубъектРФ = Неопределено, "", Объект_XDTO_Адрес.Состав.Состав.СубъектРФ);
	НоваяСтрока.Город 			= ?(Объект_XDTO_Адрес.Состав.Состав.Город = Неопределено, "", Объект_XDTO_Адрес.Состав.Состав.Город);
	НоваяСтрока.ЗначенияПолей 	= УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(Объект_XDTO_Адрес);
	НоваяСтрока.Значение 		= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Объект_XDTO_Адрес.Представление, ВидКИ);
	НоваяСтрока.Представление 	= Объект_XDTO_Адрес.Представление;
	
КонецПроцедуры

// Функция, находит или если не найдена группа, то создает ее.
//
// Параметры:
//  РодительНаименование	 - Строка 				- Наименование группы которую ищем. 
//  РодительВерхнегоУровня	 - СправочникСсылка 	- Ссылка на справочник родителя группы которую ищем.
//  ТипНоменклатуры			 - ПеречислениеСсылка 	- Перечисление типов номенклатуры. 
// 
// Возвращаемое значение:
//  Родитель - Ссылка на группу номенклатуры.
//
Функция НайтиСоздатьГруппу(РодительНаименование, РодительВерхнегоУровня = Неопределено)
	
	Родитель = Справочники.Сотрудники.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ЭтоГруппа = ИСТИНА
	|	И Сотрудники.Наименование = &Наименование
	|	И ВЫБОР
	|			КОГДА &РодительВерхнегоУровня <> НЕОПРЕДЕЛЕНО
	|				ТОГДА Сотрудники.Родитель = &РодительВерхнегоУровня
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Наименование"          , РодительНаименование);
	Запрос.УстановитьПараметр("РодительВерхнегоУровня", РодительВерхнегоУровня);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Родитель = Выборка.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Родитель) Тогда
		
		// Создать родителя
		РодительОбъект                 = Справочники.Сотрудники.СоздатьГруппу();
		РодительОбъект.Наименование    = РодительНаименование;
		Если ЗначениеЗаполнено(РодительВерхнегоУровня) Тогда 
			РодительОбъект.Родитель = РодительВерхнегоУровня;
		КонецЕсли;
		
		РодительОбъект.Записать();
		Родитель = РодительОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат Родитель;
	
КонецФункции

// Функция - Получить массив сотрудников по специализации
//
// Параметры:
//  Специализация	 - 	 - 
//  ТолькоПоОсновным - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивСотрудниковПоРолям(МассивРолей) Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивРолей", МассивРолей);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И Сотрудники.ЭтоГруппа = ЛОЖЬ
	|	И Сотрудники.Служебный = ЛОЖЬ
	|	И Сотрудники.Роль В (&МассивРолей)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Функция, возвращает массив сотрудников с отобором по ролям из сеанса ИБ.
//
Функция ПолучитьМассивСотрудниковПоРолямИзСеансаИБ(МассивРолей, ДобавитьТекущегоПользователя = Ложь) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(МассивРолей) Тогда
		Возврат Новый Массив;
	ИначеЕсли НЕ ТипЗнч(МассивРолей) = Тип("Массив") Тогда
		МассивРолей = Новый_Массив(МассивРолей);
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос( 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СоединенияИнформационнойБазы.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.СоединенияИнформационнойБазы КАК СоединенияИнформационнойБазы
	|ГДЕ
	|	СоединенияИнформационнойБазы.Пользователь.ПометкаУдаления = ЛОЖЬ
	|	И СоединенияИнформационнойБазы.Пользователь.ЭтоГруппа = ЛОЖЬ
	|	И СоединенияИнформационнойБазы.Пользователь.Служебный = ЛОЖЬ
	|	И СоединенияИнформационнойБазы.Пользователь.Роль В(&МассивРолей)
	|	И &УсловиеТекущийПользователь");
	
	Запрос.УстановитьПараметр("МассивРолей", МассивРолей);
	
	УсловиеТекущийПользователь = ?(ДобавитьТекущегоПользователя = Истина, "НЕ СоединенияИнформационнойБазы.Пользователь = &УсловиеТекущийПользователь", "ИСТИНА");		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеТекущийПользователь", УсловиеТекущийПользователь);
	Запрос.УстановитьПараметр("УсловиеТекущийПользователь", ПараметрыСеанса.ТекущийСотрудник);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
	Если ДобавитьТекущегоПользователя = Истина Тогда
		Результат.Добавить(ПараметрыСеанса.ТекущийСотрудник);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

 // Функция - Получить сотрудников структурной единицы.
//
// Параметры:
//  СтруктЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСотрудниковСтруктурнойЕдиницы(
	ОтборСтруктурнаяЕдиница, 
	ОтборРольПользователя = Неопределено, 
	ОтборДолжность        = Неопределено,
	ОтборНаДату           = Неопределено,
	ВернутьДетально       = Ложь) Экспорт
				
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиСотрудников.Сотрудник КАК Ссылка
	|ПОМЕСТИТЬ УволенныеСотрудники
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НастройкиСотрудников.СтруктурнаяЕдиница = &ОтборСтруктурнаяЕдиница
	|	И ВЫБОР
	|			КОГДА ЕСТЬNULL(НастройкиСотрудников.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА НастройкиСотрудников.ДатаУвольнения <= &ОтборНаДату
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СотрудникиМестаРаботы.Ссылка КАК Ссылка,
	|	СотрудникиМестаРаботы.Ссылка.Наименование КАК Наименование,
	|	СотрудникиМестаРаботы.Ссылка.Должность КАК Должность
	|ИЗ
	|	Справочник.Сотрудники.ДоступныеСтруктурныеЕдиницы КАК СотрудникиМестаРаботы
	|ГДЕ
	|	СотрудникиМестаРаботы.СтруктурнаяЕдиница = &ОтборСтруктурнаяЕдиница
	|	И НЕ СотрудникиМестаРаботы.Ссылка.ЭтоГруппа
	|	И НЕ СотрудникиМестаРаботы.Ссылка.ПометкаУдаления
	|	И НЕ СотрудникиМестаРаботы.Ссылка В
	|				(ВЫБРАТЬ
	|					УволенныеСотрудники.Ссылка
	|				ИЗ
	|					УволенныеСотрудники КАК УволенныеСотрудники)
	|	И &УсловиеРольПользователя
	|	И &УсловиеДолжность
	|
	|УПОРЯДОЧИТЬ ПО
	|	СотрудникиМестаРаботы.Ссылка.Наименование");
		
	Запрос.УстановитьПараметр("ОтборСтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница);	
	Запрос.УстановитьПараметр("ОтборРольПользователя"  , ОтборРольПользователя);
    Запрос.УстановитьПараметр("ОтборДолжность"         , ОтборДолжность);
    Запрос.УстановитьПараметр("ОтборНаДату"            , ?(ЗначениеЗаполнено(ОтборНаДату), НачалоДня(ОтборНаДату), НачалоДня(ТекущаяДата())));
		
	УсловиеРольПользователя = ?(ЗначениеЗаполнено(ОтборРольПользователя), "И СотрудникиМестаРаботы.Ссылка.Роль В (&ОтборРольПользователя)", "");
	Запрос.Текст            = СтрЗаменить(Запрос.Текст, "И &УсловиеРольПользователя", УсловиеРольПользователя);

	УсловиеДолжность        = ?(ЗначениеЗаполнено(ОтборДолжность), "И СотрудникиМестаРаботы.Ссылка.Должность В (&ОтборДолжность)", "");
	Запрос.Текст            = СтрЗаменить(Запрос.Текст, "И &УсловиеДолжность", УсловиеДолжность);
		
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если ВернутьДетально Тогда 
		Возврат РезультатЗапроса;
	Иначе 
		Возврат РезультатЗапроса.ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
КонецФункции

// Функция - Получить сотрудников для журнала записи
//
// Параметры:
//  ОтборСтруктурнаяЕдиница	 - 	 - 
//  ОтборРольПользователя	 - 	 - 
//  ОтборДолжность			 - 	 - 
//  ОтборНаДату				 - 	 - 
//  ОтборСпециализации		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСотрудниковДляЖурналаЗаписи(ОтборСтруктурнаяЕдиница, Настройки, ОтборРольПользователя = Неопределено, ОтборДолжность = Неопределено, ОтборНаДату = Неопределено, ОтборСпециализации = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СправочникСотрудники.Ссылка КАК Сотрудник,
	|	СправочникСотрудники.Должность КАК Должность
	|ПОМЕСТИТЬ ТаблицаСотрудников
	|ИЗ
	|	Справочник.Сотрудники КАК СправочникСотрудники
	|ГДЕ
	|	СправочникСотрудники.ПометкаУдаления = ЛОЖЬ
	|	И СправочникСотрудники.Служебный = ЛОЖЬ
	|	И &УсловиеДолжность
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникСотрудники.Ссылка,
	|	СправочникСотрудники.Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиСпецилазацииСотрудника.Ссылка КАК Сотрудник,
	|	МАКСИМУМ(СотрудникиСпецилазацииСотрудника.Специализация) КАК Специализация,
	|	МАКСИМУМ(СотрудникиСпецилазацииСотрудника.Основная) КАК Основная
	|ПОМЕСТИТЬ ТаблицаСпециализаций
	|ИЗ
	|	Справочник.Сотрудники.СпецилазацииСотрудника КАК СотрудникиСпецилазацииСотрудника
	|ГДЕ
	|	СотрудникиСпецилазацииСотрудника.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаСотрудников.Сотрудник КАК Сотрудник
	|			ИЗ
	|				ТаблицаСотрудников КАК ТаблицаСотрудников)
	|	И &УсловиеСпециализации1
	|	И СотрудникиСпецилазацииСотрудника.Специализация <> ЗНАЧЕНИЕ(Справочник.Специализации.ПустаяСсылка)
	|	И СотрудникиСпецилазацииСотрудника.Основная = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	СотрудникиСпецилазацииСотрудника.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СотрудникиСпецилазацииСотрудника.Ссылка,
	|	МАКСИМУМ(СотрудникиСпецилазацииСотрудника.Специализация),
	|	МАКСИМУМ(СотрудникиСпецилазацииСотрудника.Основная)
	|ИЗ
	|	Справочник.Сотрудники.СпецилазацииСотрудника КАК СотрудникиСпецилазацииСотрудника
	|ГДЕ
	|	СотрудникиСпецилазацииСотрудника.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаСотрудников.Сотрудник КАК Сотрудник
	|			ИЗ
	|				ТаблицаСотрудников КАК ТаблицаСотрудников)
	|	И &УсловиеСпециализации1
	|	И СотрудникиСпецилазацииСотрудника.Специализация <> ЗНАЧЕНИЕ(Справочник.Специализации.ПустаяСсылка)
	|	И СотрудникиСпецилазацииСотрудника.Основная = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	СотрудникиСпецилазацииСотрудника.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСотрудников.Сотрудник КАК Сотрудник,
	|	ТаблицаСотрудников.Должность КАК Должность,
	|	ЕСТЬNULL(ЕСТЬNULL(ТаблицаСпециализаций.Специализация, ТаблицаСпециализаций1.Специализация), ЗНАЧЕНИЕ(Справочник.Специализации.ПустаяСсылка)) КАК Специализация
	|ПОМЕСТИТЬ ТаблицаСотрудниковСпециализаций
	|ИЗ
	|	ТаблицаСотрудников КАК ТаблицаСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСпециализаций КАК ТаблицаСпециализаций
	|		ПО ТаблицаСотрудников.Сотрудник = ТаблицаСпециализаций.Сотрудник
	|			И (ТаблицаСпециализаций.Основная = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСпециализаций КАК ТаблицаСпециализаций1
	|		ПО ТаблицаСотрудников.Сотрудник = ТаблицаСпециализаций1.Сотрудник
	|			И (ТаблицаСпециализаций1.Основная = ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиСотрудников.Сотрудник КАК Сотрудник,
	|	НастройкиСотрудников.ДатаУвольнения КАК ДатаУвольнения
	|ПОМЕСТИТЬ ВТСотрудникиУволенные
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НастройкиСотрудников.Сотрудник В
	|			(ВЫБРАТЬ
	|				ТаблицаСотрудников.Сотрудник КАК Сотрудник
	|			ИЗ
	|				ТаблицаСотрудников КАК ТаблицаСотрудников)
	|	И НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	ТаблицаСотрудниковСпециализаций.Специализация.Наименование КАК СпециализацияНаименование,
	|	ТаблицаСотрудниковСпециализаций.Должность.Наименование КАК ДолжностьНаименование,
	|	ТаблицаСотрудниковСпециализаций.Сотрудник.Наименование КАК СотрудникНаименование
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиУволенные КАК ВТСотрудникиУволенные
	|		ПО Сотрудники.Сотрудник = ВТСотрудникиУволенные.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСотрудниковСпециализаций КАК ТаблицаСотрудниковСпециализаций
	|		ПО Сотрудники.Сотрудник = ТаблицаСотрудниковСпециализаций.Сотрудник
	|ГДЕ
	|	Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И &УсловиеСпециализации2
	|	И ВЫБОР
	|			КОГДА НЕ ТаблицаСотрудниковСпециализаций.Должность = ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
	|				ТОГДА ТаблицаСотрудниковСпециализаций.Должность.ОтображатьВЖурналеПредварительнойЗаписи = ИСТИНА
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И (ВТСотрудникиУволенные.ДатаУвольнения > &ОтборДатаВремяНачалаРаботы
	|			ИЛИ ЕСТЬNULL(ВТСотрудникиУволенные.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1))
	|
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.Сотрудник,
	|	ТаблицаСотрудниковСпециализаций.Специализация.Наименование,
	|	ТаблицаСотрудниковСпециализаций.Сотрудник.Наименование,
	|	ТаблицаСотрудниковСпециализаций.Должность.Наименование");			
	
	Если Настройки.ОтображениеСортировка = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеСортировкаВариант1 Тогда  
		// ФИО.
		Сортировка = "УПОРЯДОЧИТЬ ПО
	|	ТаблицаСотрудниковСпециализаций.Сотрудник.Наименование"; 
	ИначеЕсли Настройки.ОтображениеСортировка = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеСортировкаВариант2 Тогда 
		// Должность.
		Сортировка = "УПОРЯДОЧИТЬ ПО
	|	ТаблицаСотрудниковСпециализаций.Должность.Наименование,
	|	ТаблицаСотрудниковСпециализаций.Сотрудник.Наименование";
	Иначе
		// Осн. специализация.
		Сортировка = "УПОРЯДОЧИТЬ ПО
	|	ТаблицаСотрудниковСпециализаций.Специализация.Наименование,
	|	ТаблицаСотрудниковСпециализаций.Должность.Наименование,
	|	ТаблицаСотрудниковСпециализаций.Сотрудник.Наименование";		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + Символы.ПС + Сортировка;
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	 	  , ОтборСтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ОтборДолжность"       	  , ОтборДолжность);
	Запрос.УстановитьПараметр("ОтборСпециализации"   	  , ОтборСпециализации);
	Запрос.УстановитьПараметр("ОтборПоСпециализации"   	  , ЗначениеЗаполнено(ОтборСпециализации));
	Запрос.УстановитьПараметр("ОтборДатаВремяНачалаРаботы", ?(ЗначениеЗаполнено(ОтборНаДату), ОтборНаДату, Дата(1,1,1)));
	
	УсловиеДолжность        = ?(ЗначениеЗаполнено(ОтборДолжность), "И СправочникСотрудники.Должность В(&ОтборДолжность)", "");
	Запрос.Текст            = СтрЗаменить(Запрос.Текст, "И &УсловиеДолжность", УсловиеДолжность);

	Если ЗначениеЗаполнено(ОтборСпециализации) Тогда 
		Запрос.Текст        = СтрЗаменить(Запрос.Текст, "И &УсловиеСпециализации1", "И СотрудникиСпецилазацииСотрудника.Специализация В(&ОтборСпециализации)");
		Запрос.Текст        = СтрЗаменить(Запрос.Текст, "И &УсловиеСпециализации2", "И ТаблицаСотрудниковСпециализаций.Специализация В(&ОтборСпециализации)");
	Иначе 
		Запрос.Текст        = СтрЗаменить(Запрос.Текст, "И &УсловиеСпециализации1", "");
		Запрос.Текст        = СтрЗаменить(Запрос.Текст, "И &УсловиеСпециализации2", "");
	КонецЕсли;	

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции

#КонецОбласти  

#КонецОбласти  

#КонецЕсли
