
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем ПараметрыОбработкиПользователяИБ; // Параметры, заполняемые при обработке пользователя ИБ.
Перем ЭтоНовый; // Показывает, что был записан новый объект.
Перем НомерТелефонаДоЗписи; // Номер телефона до записи.
Перем МассивРабочихМестДоЗаписи; // массив рабочих мест до записи.
				
#Область ОбработчикиСобытий

// Процедура - Обработка проверки заполнения
//
// Параметры:
//  Отказ				 - 	 - 
//  ПроверяемыеРеквизиты - 	 - 
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	НомерТелефонаДоЗписи = Справочники.Сотрудники.ПолучитьКонтактнуюИнформацию(ЭтотОбъект.Ссылка).Телефон;
КонецПроцедуры

// Процедура, обработчик события "ПриКопировании"
//
Процедура ПриКопировании(ОбъектКопирования)
	
	Наименование = "";
	Если Не ЭтоГруппа Тогда
		ДатаРождения = неопределено;	
	КонецЕсли;
	
	КодСинхронизации = "";
	
КонецПроцедуры

// Процедура - Перед записью
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка ИЛИ ДополнительныеСвойства.Свойство("ЭтоИзменениеФорматаТелефонныхНомеров") ИЛИ ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовый = ЭтоНовый();
	
	НаименованиеСокращенное = Справочники.Сотрудники.ПолучитьСокращенноеНаименованиеСотрудника(Новый Структура("Фамилия, Имя, Отчество, Наименование", Фамилия, Имя, Отчество, Наименование));
	
	Если ДополнительныеСвойства.Свойство("ОписаниеПользователяИБ")
		И ТипЗнч(ДополнительныеСвойства.ОписаниеПользователяИБ) = Тип("Структура")
		И ДополнительныеСвойства.ОписаниеПользователяИБ.Свойство("УникальныйИдентификатор")
		И Строка(ДополнительныеСвойства.ОписаниеПользователяИБ.УникальныйИдентификатор) <> "00000000-0000-0000-0000-000000000000" Тогда
		
		ЭтоПользовательИБ = Истина;
		ИдентификаторПользователяИБ = ДополнительныеСвойства.ОписаниеПользователяИБ.УникальныйИдентификатор;
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("УстановитьЭтоПользовательИБ") 
		И ДополнительныеСвойства.УстановитьЭтоПользовательИБ = Истина Тогда
		
		ЭтоПользовательИБ = Истина;  
	КонецЕсли;
	
	Если Ссылка.Пустая() Тогда
		УстановитьСсылкуНового(Справочники.Сотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор));
	КонецЕсли;
	
	Если Ссылка.Наименование <> Наименование Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ФИОИзменилось", Истина);
	КонецЕсли;
	Если Ссылка.ФайлКартинки <> ФайлКартинки Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ФотоИзменилось", Истина);
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ПредставлениеДляОнлайнЗаписи) Тогда
		ЭтотОбъект.ПредставлениеДляОнлайнЗаписи = Фамилия + ?(ЗначениеЗаполнено(Фамилия), " ", "") + Имя;
		ЭтотОбъект.ПредставлениеДляОнлайнЗаписи = ?(ЗначениеЗаполнено(ЭтотОбъект.ПредставлениеДляОнлайнЗаписи), 
			ЭтотОбъект.ПредставлениеДляОнлайнЗаписи, Отчество);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка.Контрагент)
		И Найти(ТРег(ЭтотОбъект.Ссылка.Контрагент), "(Сотрудник)") <> 0
		И ЭтотОбъект.Ссылка.Контрагент <> Контрагент Тогда 
		
		СтарыйКонтрагент = ЭтотОбъект.Ссылка.Контрагент.ПолучитьОбъект();
		СтарыйКонтрагент.Наименование = СокрЛП(СтрЗаменить(СтарыйКонтрагент.Наименование, "(Сотрудник)",""));
		СтарыйКонтрагент.Записать();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) И Найти(ТРег(Контрагент.Наименование), "(Сотрудник)") = 0 Тогда
		НовыйКонтрагент = Контрагент.ПолучитьОбъект();
		НовыйКонтрагент.Наименование = НовыйКонтрагент.Наименование + " (Сотрудник)";
		НовыйКонтрагент.Записать();	 	
	КонецЕсли;
	
	// Снятие флага "Пользователь ИБ" и закрытие доступа сотруднику, есть поставили пометку удаления!
	Если ПометкаУдаления = Истина Тогда
		ЭтоПользовательИБ = Ложь;
		
		Пользователь = Справочники.Пользователи.ПолучитьПользователя(Ссылка);
		
		Если ЗначениеЗаполнено(Пользователь) Тогда
			
			ПользовательОбъект = Пользователь.ПолучитьОбъект();
			
			Если НЕ ПользовательОбъект = Неопределено Тогда
				
				ПользовательОбъект.ЭтоПользовательИБ = Ложь;
				
				НачатьТранзакцию();
				Попытка 
					ПользовательОбъект.Записать();
					ПользовательИнформационнойБазы = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ПользовательОбъект.ИдентификаторПользователяИБ);
					Если НЕ ПользовательИнформационнойБазы = Неопределено Тогда
						ПользовательИнформационнойБазы.АутентификацияСтандартная = Ложь;	
						ПользовательИнформационнойБазы.Записать();                              
					КонецЕсли;
					ЗафиксироватьТранзакцию();
				Исключение
					ОтменитьТранзакцию();					
					ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Ошибка закрытия доступа пользователя к ИБ при удалении сотрудника"
																			, УровеньЖурналаРегистрации.Ошибка
																			,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));					
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Ссылка.ПометкаУдаления <> ПометкаУдаления Тогда		
		ДополнительныеСвойства.Вставить("ПометкаУдаления", ПометкаУдаления);		
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из СпецилазацииСотрудника Цикл
		
		Если СтрокаТЧ.Специализация = Справочники.Специализации.ПустаяСсылка() Тогда
			СпецилазацииСотрудника.Удалить(СтрокаТЧ);	
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполнение доступных структурных единиц
	Если ДополнительныеСвойства.Свойство("ДоступныеСтруктурныеЕдиницы") Тогда
		
		ДоступныеСтруктурныеЕдиницы.Очистить();
		Для Каждого Элемент Из ДополнительныеСвойства.ДоступныеСтруктурныеЕдиницы Цикл
			НоваяСтрока = ДоступныеСтруктурныеЕдиницы.Добавить();
			НоваяСтрока.СтруктурнаяЕдиница = Элемент.СтруктурнаяЕдиница
		КонецЦикла;

	КонецЕсли;
	
	// Доступные журналы приемов.
	Если ДополнительныеСвойства.Свойство("ДоступныеЖурналыПриемов") Тогда
		
		ДоступныеСтруктурныеЕдиницыЖурналаЗаписи.Очистить();
		Для Каждого Элемент Из ДополнительныеСвойства.ДоступныеЖурналыПриемов Цикл
			НоваяСтрока = ДоступныеСтруктурныеЕдиницыЖурналаЗаписи.Добавить();
			НоваяСтрока.СтруктурнаяЕдиница = Элемент.СтруктурнаяЕдиница
		КонецЦикла;
		
	КонецЕсли;
	
	// Доступные кассы.
	Если ДополнительныеСвойства.Свойство("ДоступныеКассы") Тогда
		
		ДоступныеКассы.Очистить();
		Для Каждого Элемент Из ДополнительныеСвойства.ДоступныеКассы Цикл
			НоваяСтрока 		 = ДоступныеКассы.Добавить();
			НоваяСтрока.Касса    = Элемент.Касса;
			НоваяСтрока.Основная = Элемент.Основная;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

// Процедура - При записи
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка ИЛИ ДополнительныеСвойства.Свойство("ЭтоИзменениеФорматаТелефонныхНомеров") ИЛИ ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьНастройкиСотрудника();
	
	
	// Синхронизация с CRM
	Если Не ДополнительныеСвойства.Свойство("БлокироватьСинхронизациюСCRM") 
		И РегистрыСведений.КлючиВнешнихСистем.СотрудникЗарегистрированДляВнешнейСистемы(ЭтотОбъект.Ссылка,, Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(,Перечисления.ТипыВнешнихСистем.МобильноеПриложениеУправляющего)) Тогда
		
		СинхронизироватьДанныеСотрудникаCRM();
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Синхронизировать данные тренера с CRM
//
Процедура СинхронизироватьДанныеСотрудникаCRM()
	
	УстановитьПривилегированныйРежим(Истина);
	
	НомерТелефонаТекущий = Справочники.Сотрудники.ПолучитьКонтактнуюИнформацию(ЭтотОбъект.Ссылка).Телефон;
	
	Если ЗначениеЗаполнено(НомерТелефонаТекущий) Тогда
		
		Сотрудник = РегистрыСведений.КлючиВнешнихСистем.ПолучитьСотрудникаПоНомеруТелефона(НомерТелефонаТекущий);
		
		Если ЗначениеЗаполнено(Сотрудник) И Сотрудник <> ЭтотОбъект.Ссылка Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сотрудник с таким номером уже существует!");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ВнешняяСистема   = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.МобильноеПриложениеУправляющего);
	ДанныеОбновления = Новый Структура("НомерТелефона", НомерТелефонаТекущий);
	
	Если ДополнительныеСвойства.Свойство("ПометкаУдаления") Тогда
		ДанныеОбновления.Вставить("Использовать", НЕ ДополнительныеСвойства.ПометкаУдаления);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерТелефонаТекущий) ИЛИ ДополнительныеСвойства.Свойство("ПометкаУдаления") Тогда
		РегистрыСведений.КлючиВнешнихСистем.ОбновитьДанныеСотрудникаВнешнейСистемы(ВнешняяСистема, ЭтотОбъект.Ссылка, ДанныеОбновления);
	КонецЕсли;
		
	Если ВнешняяСистема.Используется  Тогда
		
		ФлагИспользованияЗаписи = ЗначениеЗаполнено(НомерТелефонаТекущий) И Не ПометкаУдаления;
		
		РезультатОбновления = ЛичныйКабинет.ОбновитьСписокСотрудниковВнешнейСистемыВ_CRM(ВнешняяСистема, ЛичныйКабинет.УидТекущейСессии(), ЭтотОбъект.Ссылка,, ФлагИспользованияЗаписи);
		
		Если РезультатОбновления.ВыполненоУспешно = Ложь Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОбновления.Описаниеошибки);
			
			Если ЗначениеЗаполнено(НомерТелефонаДоЗписи) Тогда
				
				ДанныеОбновления = Новый Структура("НомерТелефона",НомерТелефонаДоЗписи);
				РегистрыСведений.КлючиВнешнихСистем.ОбновитьДанныеСотрудникаВнешнейСистемы(ВнешняяСистема, ЭтотОбъект.Ссылка, ДанныеОбновления);
				
			КонецЕсли;
			
		ИначеЕсли Не ЗначениеЗаполнено(НомерТелефонаТекущий) Тогда
			РегистрыСведений.КлючиВнешнихСистем.УдалитьДанныеОКлючеВнешнейСистемы(ВнешняяСистема, ЭтотОбъект.Ссылка);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

// Процедура - Перед удалением
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Записать настройки сотрудника
//
Процедура ЗаписатьНастройкиСотрудника()
	
	МассивКлиникДо = Справочники.Сотрудники.ПолучитьМестаРаботыСотрудника(Ссылка, "Массив");
	
	Если ДополнительныеСвойства.Свойство("НастройкиСотрудников") Тогда
		НаборЗаписей = РегистрыСведений.НастройкиСотрудников.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сотрудник.Использование          = Истина;
		НаборЗаписей.Отбор.Сотрудник.Значение               = Ссылка;
		
		НастройкиСотрудниковСтруктурныеЕдиницы = ДополнительныеСвойства.НастройкиСотрудников.Скопировать();
		НастройкиСотрудниковСтруктурныеЕдиницы.Свернуть("СтруктурнаяЕдиница");
		Для Каждого НастройкаСтруктурныеЕдиницы из НастройкиСотрудниковСтруктурныеЕдиницы Цикл
			НоваяСтрока 				   	= НаборЗаписей.Добавить();
			НоваяСтрока.Сотрудник          	= НаборЗаписей.Отбор.Сотрудник.Значение;
			НоваяСтрока.СтруктурнаяЕдиница 	= НастройкаСтруктурныеЕдиницы.СтруктурнаяЕдиница;
			Для Каждого НастройкаТЗ из ДополнительныеСвойства.НастройкиСотрудников Цикл
				Если НастройкаТЗ.СтруктурнаяЕдиница = НоваяСтрока.СтруктурнаяЕдиница Тогда
					НоваяСтрока[НастройкаТЗ.Настройка]	= НастройкаТЗ.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("НастройкиСотрудников_new") Тогда
		НаборЗаписей = РегистрыСведений.НастройкиСотрудников.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сотрудник.Использование          = Истина;
		НаборЗаписей.Отбор.Сотрудник.Значение               = Ссылка;
		
		Для Каждого НастройкиСтруктурнойЕдиницы Из ДополнительныеСвойства.НастройкиСотрудников_new Цикл
			НоваяСтрока = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НастройкиСтруктурнойЕдиницы);
			
			НоваяСтрока.Сотрудник = НаборЗаписей.Отбор.Сотрудник.Значение;
			
		КонецЦикла;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	
	МассивКлиникПосле = Справочники.Сотрудники.ПолучитьМестаРаботыСотрудника(Ссылка, "Массив", , , Ложь);
	
	Если НЕ ОбщегоНазначения.КоллекцииИдентичны(МассивКлиникДо, МассивКлиникПосле) Тогда 
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
