
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если ЗапретРедактированияРеквизитовОбъектов.ПроверитьНаОбъектИмеютсяСсылкиВИБ(Параметры.Ссылка) Тогда
	//	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаНайденыСсылки;
	//Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСсылокНеНайдено;
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	
	Результат = Новый Массив;
	Результат.Добавить("ТипЗначения");
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти
