
#Область ОбработчикиСобытий

&НаКлиенте
// Процедура, обработчик команды 
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("КодВозвратаДиалога") И ПараметрКоманды = КодВозвратаДиалога.Да Тогда
		Записать = Истина;
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("КодВозвратаДиалога") И ПараметрКоманды = КодВозвратаДиалога.Нет Тогда
		Записать = Ложь;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Сотрудник", ПараметрКоманды);  
	Если ПараметрыВыполненияКоманды.Источник.Модифицированность Тогда	
		Если Записать = Неопределено Тогда
			//ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаКоманды", ЭтотОбъект), "Для продолжения операции необходимо записать объект."+Символы.ПС+"Записать?", РежимДиалогаВопрос.ДаНет);
			ПараметрыВопроса = Новый Структура("ПараметрКоманды, ПараметрыВыполненияКоманды", ПараметрКоманды, ПараметрыВыполненияКоманды);
   			ПоказатьВопрос(Новый ОписаниеОповещения("ВопросЗаписать_ОбработкаОтвета", ЭтотОбъект, ПараметрыВопроса), СтрШаблон(НСтр("ru='Для продолжения операции необходимо записать объект.%1Записать?';en='For continued operations is necessary writedown object %1WriteDown?'"), Символы.ПС), РежимДиалогаВопрос.ДаНет);
			Возврат;
		ИначеЕсли  Записать = Истина Тогда
			ПараметрыВыполненияКоманды.Источник.ЭтаФорма.Записать();
		Иначе			 			
			Возврат;
		КонецЕсли;		
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаНастройки", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура, "ВопросЗаписать_ОбработкаОтвета" 
//
Процедура ВопросЗаписать_ОбработкаОтвета(Ответ, ПараметрыВопроса) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрКоманды = ПараметрыВопроса.ПараметрКоманды;
		ПараметрыВыполненияКоманды = ПараметрыВопроса.ПараметрыВыполненияКоманды;
		
		ПараметрыВыполненияКоманды.Источник.ЭтаФорма.Записать();
		ПараметрыФормы = Новый Структура("Сотрудник", ПараметрКоманды);
		ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаНастройки", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
