#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ЕстьПроизводство = ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияМДЛП.Производство");
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	Для Каждого Элемент Из Перечисления.ОперацииОтгрузкиМДЛП Цикл
		Если Не ЕстьПроизводство
		   И (Элемент = ПередачаСобственнику Или Элемент = ПередачаСобственникуДляВыпуска) Тогда
			Продолжить;
		КонецЕсли;
		ДанныеВыбора.Добавить(Элемент);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
