
&НаКлиенте
Перем НомерДняНеделиДляУдаления;   // Перем - Номер дня недели для которого производится удаление
&НаКлиенте
Перем ПроверятьНеобхЗаписи;
&НаКлиенте                                                                                                 
Перем ЭтоОчистка;
// &НаКлиенте
// Перем ВремяРаботыСтруктурнойЕдиницы;

#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик при создании формы на сервере
// 
// 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоРедактирования = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ДобавлениеИзменениеГрафикаРаботыСотрудников"); 
	
	ОтборСтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	
	ОтборСотрудникДолжность = "Все";
	
	Элементы.ОткрытьСписокСотрудники.Заголовок	= "Все";
	Элементы.ОткрытьСписокДолжности.Заголовок	= "Все"; 
	Элементы.ОткрытьСписокРоли.Заголовок		= "Все";
	Элементы.ОткрытьСписокКлиник.Заголовок		= Строка(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
		
	// Получаем массив номеров рабочих дней недели для СЕ	
	ОбновитьМассивРабочихДнейВНеделе();
	
	// Добавим первую пустую неудаляемую строку интервала 
	ОтборИнтервалыРаботы.Добавить(Новый Структура("НачалоРаботы, ОкончаниеРаботы", Неопределено, Неопределено));
	
    Элементы.ГруппаПереклКлиника.Видимость = ПолучитьТаблицуКлиник().Количество() > 1;
	Элементы.ГрафикПериодовРаботыТабДок.КонтекстноеМеню.Доступность = ЕстьПравоРедактирования;
	Элементы.ГруппаОтбораИнтерваловРаботы.Видимость = ЕстьПравоРедактирования;
	
КонецПроцедуры

&НаКлиенте
// Обработчик открытия формы
// 
// 
Процедура ПриОткрытии(Отказ)
	
	Если Не ФлагОткрытия Тогда
		ПриОткрытииНаСервере();	
	КонецЕсли;
	ЗадатьПериодСменыНаФорме();

КонецПроцедуры

&НаКлиенте
// Обработчик оповещения формы о внешнем событии
// 
// 
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПРИ_ЗАПИСИ_СТРУКТУРНОЙ_ЕДИНИЦЫ" Тогда
		// Получаем массив номеров рабочих дней недели для СЕ	
		ОбновитьМассивРабочихДнейВНеделе();
		ОбновитьОтображениеПланирования(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик перед закрытием формы
// 
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда 
		Возврат;
	КонецЕсли;
	
	Если ПроверятьНеобхЗаписи = Истина И ПроверитьНеобходимостьФиксацииИзмененийВПлане() = Истина Тогда	
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаОЗаписиИзмененийОповещение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение,"Имеются несохраненные изменения графика работы. Записать изменения перед закрытием ?", РежимДиалогаВопрос.ДаНетОтмена);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Обработчик события "ПриЗагрузкеДанныхИзНастроекНаСервере".
// 
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ПриОткрытииНаСервере();
	ФлагОткрытия = Истина;
	
КонецПроцедуры      

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервереБезКонтекста
// Функция - Получить список сотрудников.
// 
// 
Функция ПолучитьСписокДолжностей(ВременныйСписокСотрудников = Неопределено)
	
	ТаблицаДолжностей = ПолучитьТаблицуДолжностей(ВременныйСписокСотрудников);
	ТаблицаДолжностей.Сортировать("КоличествоСотрудников Убыв",);
	СписокДолжностей = Новый СписокЗначений;
	
	// Заполнение списка сотрудников.
	Отступ = "    ";
	СписокДолжностей.Добавить("Все", "Все",,БиблиотекаКартинок.ПапкаНовая);	// Все.
	
	Для Каждого СтрокаДолжность Из ТаблицаДолжностей Цикл
		
		Если СтрокаДолжность.КоличествоСотрудников > 0 Тогда
			СписокДолжностей.Добавить(
			СтрокаДолжность.Должность,
			Отступ+Строка(СтрокаДолжность.Должность) + "(" + Строка(СтрокаДолжность.КоличествоСотрудников) + ")",,
			БиблиотекаКартинок.РеквизитКартинка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокДолжностей;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить список сотрудников.
// 
// 
Функция ПолучитьСписокРолей(ВременныйСписокСотрудников = Неопределено)
	
	ТаблицаРолей = ПолучитьТаблицуРолей(ВременныйСписокСотрудников);
	ТаблицаРолей.Сортировать("КоличествоСотрудников Убыв",);
	СписокРолей = Новый СписокЗначений;
	
	// Заполнение списка сотрудников.
	Отступ = "    ";
	СписокРолей.Добавить("Все", "Все",,БиблиотекаКартинок.ПапкаНовая);	// Все.
	
	Для Каждого СтрокаРоль Из ТаблицаРолей Цикл
		
		Если СтрокаРоль.КоличествоСотрудников > 0 Тогда
			СписокРолей.Добавить(
			СтрокаРоль.Роль,
			Отступ+Строка(СтрокаРоль.Роль) + "(" + Строка(СтрокаРоль.КоличествоСотрудников) + ")",,
			БиблиотекаКартинок.РеквизитКартинка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокРолей;
	
КонецФункции

&НаСервере
// Функция - Получить таблицу сотрудников.
// 
// Параметры:
//  ДатаВремяНачала						 - 	 -
//  ДатаВремяОкончания					 - 	 -
// 
// Возвращаемое значение:
//   -
// 
Функция ЗаполнитьСорудниковСогласноОтборов(ИсключаемыйОтбор = Неопределено, ВременныйСписокСотрудников = Неопределено, ЗаполнитьВеменнуюТаблицу = Ложь)
		
	Запрос = новый ЗАпрос;
	ЗАпрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|		ПО Сотрудники.Ссылка = НастройкиСотрудников.Сотрудник
	|ГДЕ
	|	НЕ Сотрудники.ЭтоГруппа
	|	И НЕ Сотрудники.ПометкаУдаления
	|	И НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Сотрудники.Должность = &Должность
	|	И Сотрудники.Роль = &Роль
	|	И Сотрудники.Ссылка В ИЕРАРХИИ(&Сотрудник)
	|	И ВЫБОР
	|			КОГДА &ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 31, 23, 59, 59)
	|					И НастройкиСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА НастройкиСотрудников.ДатаПриема <= &ДатаОкончания
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
	|					И НастройкиСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА НастройкиСотрудников.ДатаУвольнения >= &ДатаНачала
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";  
		
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, ОтборСтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ДатаНачала"		    , ОтборПериод.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"		, ОтборПериод.ДатаОкончания);
	
	Если ИсключаемыйОтбор <> ОтборСотрудник И ТипЗнч(ОтборСотрудник) = Тип("СправочникСсылка.Сотрудники") Тогда
		Запрос.УстановитьПараметр("Сотрудник", ОтборСотрудник);
		ОтборСотрдуникТекстом = Строка(ОтборСотрудник); 
	Иначе	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сотрудники.Ссылка В ИЕРАРХИИ(&Сотрудник)", "Истина"); 
		ОтборСотрдуникТекстом = "Все";
	КонецЕсли;
		
	Если ИсключаемыйОтбор <> ОтборСотрудникДолжность И ТипЗнч(ОтборСотрудникДолжность) = Тип("СправочникСсылка.Должности") Тогда
		Запрос.УстановитьПараметр("Должность", ОтборСотрудникДолжность);
		ОтборДолжностьТекстом = Строка(ОтборСотрудникДолжность); 
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сотрудники.Должность = &Должность", "Истина"); 
		ОтборДолжностьТекстом = "Все";
	КонецЕсли;
		
	Если ИсключаемыйОтбор <> ОтборСотрудникРоль И ТипЗнч(ОтборСотрудникРоль) = Тип("ПеречислениеСсылка.РольПользователя") Тогда
		Запрос.УстановитьПараметр("Роль", ОтборСотрудникРоль);
		ОтборРольТекстом = Строка(ОтборСотрудникРоль);
	Иначе	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сотрудники.Роль = &Роль", "Истина"); 
		ОтборРольТекстом = "Все";
	КонецЕсли;
	
	Если ЗаполнитьВеменнуюТаблицу = Истина Тогда
		ВременныйСписокСотрудников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");	
	Иначе
		СписокСотрудниковПоОтборам.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник")); 
		
		Элементы.ОткрытьСписокСотрудники.Заголовок 	= ОтборСотрдуникТекстом;	
		Элементы.ОтменитьОтборПоСотруднику.Видимость = Элементы.ОткрытьСписокСотрудники.Заголовок <> "Все";
		
		Элементы.ОткрытьСписокДолжности.Заголовок 	= ОтборДолжностьТекстом;
		Элементы.ОтменитьОтборПоДолжности.Видимость = Элементы.ОткрытьСписокДолжности.Заголовок <> "Все";
		
		Элементы.ОткрытьСписокРоли.Заголовок 	= ОтборРольТекстом;
		Элементы.ОтменитьОтборПоРоли.Видимость 	= Элементы.ОткрытьСписокРоли.Заголовок <> "Все";
	КонецЕсли;
	
КонецФункции 

&НаСервереБезКонтекста
// Функция - Получить таблицу сотрудников.
// 
// Параметры:
//  ДатаВремяНачала						 - 	 -
//  ДатаВремяОкончания					 - 	 -
// 
// Возвращаемое значение:
//   -
// 
Функция ПолучитьТаблицуДолжностей(ВременныйСписокСотрудников = Неопределено)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Сотрудники.Ссылка) КАК КоличествоСотрудников,
	|	Сотрудники.Должность КАК Должность
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В (&СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.Должность";
	
	Если Не ЗначениеЗаполнено(ВременныйСписокСотрудников) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сотрудники.Ссылка В (&СписокСотрудников)", "Истина");	
	Иначе
		Запрос.УстановитьПараметр("СписокСотрудников", ВременныйСписокСотрудников);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции 

&НаСервереБезКонтекста
// Функция - Получить таблицу сотрудников.
// 
// Параметры:
//  ДатаВремяНачала						 - 	 -
//  ДатаВремяОкончания					 - 	 -
// 
// Возвращаемое значение:
//   -
// 
Функция ПолучитьТаблицуРолей(ВременныйСписокСотрудников = Неопределено)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Сотрудники.Ссылка) КАК КоличествоСотрудников,
	|	Сотрудники.Роль КАК Роль
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В (&СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.Роль";
	
	Если Не ЗначениеЗаполнено(ВременныйСписокСотрудников) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сотрудники.Ссылка В (&СписокСотрудников)", "Истина");	
	Иначе
		Запрос.УстановитьПараметр("СписокСотрудников", ВременныйСписокСотрудников);	
	КонецЕсли;	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
// Процедура - Отбор по сотруднику.
// 
// 
Процедура ОтборГрафикПериодовРаботыПоСотруднику()
	
	ЗаполнитьСорудниковСогласноОтборов();
	
	// сначала все отобразим
	НомерСтрокиТабДок = 2;
	Пока НомерСтрокиТабДок <=  ГрафикПериодовРаботыТабДок.ВысотаТаблицы Цикл
		ГрафикПериодовРаботыТабДок.Область("R"+СтрЗаменить(НомерСтрокиТабДок,Символы.НПП,"")).Видимость = Истина;
		НомерСтрокиТабДок = НомерСтрокиТабДок + 1;
	КонецЦикла;
		
	НомерСтрокиТабДок = 2; 
	Пока НомерСтрокиТабДок <=  ГрафикПериодовРаботыТабДок.ВысотаТаблицы Цикл
		ИД_Сотрудник = ГрафикПериодовРаботыТабДок.Область("R"+СтрЗаменить(НомерСтрокиТабДок,Символы.НПП,"")+"C2").Текст;
		ТекСотрудник = НайтиСотрудникаПоИД(ИД_Сотрудник);
		
		Если СписокСотрудниковПоОтборам.НайтиПоЗначению(ТекСотрудник) = Неопределено Тогда
			ГрафикПериодовРаботыТабДок.Область("R"+СтрЗаменить(НомерСтрокиТабДок,Символы.НПП,"")).Видимость = Ложь;
		КонецЕсли; 
		
		НомерСтрокиТабДок = НомерСтрокиТабДок + 1;
	КонецЦикла;
	
КонецПроцедуры

#Область ВыборСалона

&НаСервере
// Функция - Получить список сотрудников.
// 
// 
Функция ПолучитьСписокКлиник()
	
	ТаблицаКлиник = ПолучитьТаблицуКлиник();
	СписокКлиник = Новый СписокЗначений;
	
	// Заполнение списка сотрудников.
	Для Каждого СтрокаКлиника Из ТаблицаКлиник Цикл
		Если ЗначениеЗаполнено(СтрокаКлиника.Клиника) Тогда    			
			СписокКлиник.Добавить(
			СтрокаКлиника.Клиника,
			Строка(СтрокаКлиника.Клиника) ,,
			БиблиотекаКартинок.РеквизитКартинка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокКлиник;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить таблицу клиник.
//
Функция ПолучитьТаблицуКлиник()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	//"ВЫБРАТЬ 
	//|	СотрудникиМестаРаботы.СтруктурнаяЕдиница КАК Салон
	//|ИЗ
	//|	Справочник.Сотрудники.МестаРаботы КАК СотрудникиМестаРаботы
	//|ГДЕ
	//|	СотрудникиМестаРаботы.Ссылка = &Пользователь
	//|	И СотрудникиМестаРаботы.СтруктурнаяЕдиница.ПометкаУдаления = ЛОЖЬ
	//|	И СотрудникиМестаРаботы.Ссылка.ЭтоГруппа = ЛОЖЬ
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	СотрудникиМестаРаботы.СтруктурнаяЕдиница";  
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиСотрудников.СтруктурнаяЕдиница КАК Клиника
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НЕ НастройкиСотрудников.СтруктурнаяЕдиница.Ссылка ЕСТЬ NULL
	|	И НастройкиСотрудников.Сотрудник = &Сотрудник
	|	И НЕ НастройкиСотрудников.СтруктурнаяЕдиница.ПометкаУдаления
	|	И НЕ НастройкиСотрудников.СтруктурнаяЕдиница.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.ТекущийПользователь.Сотрудник);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийТабличногоДокумента

&НаКлиенте
// Процедура - Обработка события "Выбор" табличного документа
// 
// 
Процедура ГрафикПериодовРаботыТабДокВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если ЕстьПравоРедактирования Тогда
		
		ИмяОбласти = Область.Имя;
		
		Позиция = СтрНайти(ИмяОбласти,"C");
		Позиция_Двоеточие = СтрНайти(ИмяОбласти,":");
		
		НомерКолонки = Сред(ИмяОбласти, Позиция+1, Позиция_Двоеточие-Позиция-1);
		
		// Если это первая колонка, то открыть его форму сотрудника,
		// в противном случае добавлять периоды 	
		Если НомерКолонки = "1" Тогда
			
			// сотрдуник
			НомерСтроки		= Сред(ИмяОбласти, 2, позиция - 2 );
			ИД_Сотрудника	= ГрафикПериодовРаботыТабДок.Область("R"+СтрЗаменить(НомерСтроки,Символы.НПП,"")+"C2").Текст;
			
			Сотрудник		= НайтиСотрудникаПоИД(ИД_Сотрудника); 
			
			Если Сотрудник <> Неопределено Тогда
				ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаЭлемента", Новый Структура("Ключ",Сотрудник));
			КонецЕсли;
			
		Иначе
			
			СтруктураДанныхОбласти = ПолучитьДанныеВыделеннойОбластиГрафикПериодовРаботыТабДок(ИмяОбласти);
			
			СтартоваяДата = СтруктураДанныхОбласти.ВыбПериод;
			Если Не ЗначениеЗаполнено(СтартоваяДата) Тогда
				Возврат;
			КонецЕсли;     	
			
			Сотрудник = СтруктураДанныхОбласти.Сотрудник;
			Если Не ЗначениеЗаполнено(Сотрудник) Тогда
				Возврат;
			КонецЕсли;   
			
			ПериодЗаполнения      = Новый СтандартныйПериод(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);        	
			ИнтервалыСформированы = ФормированиеИнтерваловЗавершено(Ложь);
			ИнтервалыРаботы		  = ОтборИнтервалыРаботы.Скопировать();
			Если НЕ ИнтервалыСформированы Тогда
				ИнтервалыРаботы.Очистить();
			КонецЕсли;      
			
			// Добавляем выбранные периоды если содержимое ячейки пустое или очищаем если содержимое есть
			ФлагНеобходимоОчиститьОбласть	= ПроверитьНеобходимостьОчисткиОбласти(СтруктураДанныхОбласти.Содержимое, ИнтервалыРаботы);
			
			ПриемыВходятВИнтервалыРабот		= ПроверитьПриемыВходятВИнтервалыРабот(Сотрудник, СтартоваяДата, ОтборСтруктурнаяЕдиница, ?(ФлагНеобходимоОчиститьОбласть, Новый СписокЗначений, ИнтервалыРаботы));   			
			
			// Проверяем на работу структурой единицы в выбранный интервал
			ВремяРаботыСтруктурнойЕдиницыДень = ВернутьВремяРаботыСтруктурнойЕдиницыПоДате(СтартоваяДата,ОтборСтруктурнаяЕдиница);
			
			Если ВремяРаботыСтруктурнойЕдиницыДень <> неопределено Тогда
				
				Для Каждого Интервал из ИнтервалыРаботы Цикл	
					
					// Корректируем интервал начало или конец если он выходит за рамки работы структурной 
					Если Интервал.Значение.НачалоРаботы    < ВремяРаботыСтруктурнойЕдиницыДень.НачалоРаботы Тогда
						Интервал.Значение.НачалоРаботы = ВремяРаботыСтруктурнойЕдиницыДень.НачалоРаботы;
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Скорректировано время начала работы на "+ Формат(СтартоваяДата, "ДЛФ = ДДММГГ") + " по времени работы клиники.");
					КонецЕсли;
					
					Если Интервал.Значение.ОкончаниеРаботы > ВремяРаботыСтруктурнойЕдиницыДень.ОкончаниеРаботы Тогда
						Интервал.Значение.ОкончаниеРаботы =  ВремяРаботыСтруктурнойЕдиницыДень.ОкончаниеРаботы ;
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Скорректировано время окончания работы на "+ Формат(СтартоваяДата, "ДЛФ = ДДММГГ") + " по времени работы клиники.");
					КонецЕсли;
					
				КонецЦикла;
				
				
			Иначе
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Клиника не работает "+ Формат(СтартоваяДата, "ДЛФ = ДДММГГ"));
				Возврат;
				
			КонецЕсли;  	
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("СтартоваяДата"				, СтартоваяДата);
			СтруктураПараметров.Вставить("ФлагНеобходимоОчиститьОбласть", ФлагНеобходимоОчиститьОбласть);
			СтруктураПараметров.Вставить("ИнтервалыРаботы"				, ИнтервалыРаботы);
			СтруктураПараметров.Вставить("Сотрудник"					, Сотрудник);
			
			Если НЕ ПриемыВходятВИнтервалыРабот Тогда
				Если ТипЗнч(ИнтервалыРаботы) = Тип("СписокЗначений") И ИнтервалыРаботы.Количество() > 0 Тогда
					Оповещение = Новый ОписаниеОповещения("ГрафикПериодовРаботыТабДокВыборПродолжить", ЭтотОбъект, СтруктураПараметров);
					ПоказатьВопрос(Оповещение, "У сотрудника " + Сотрудник + " " + Формат(СтартоваяДата, "ДЛФ = ДДММГГ")+ " запланированы приемы, не входящие в выбранные смены. Продолжить?", РежимДиалогаВопрос.ДаНетОтмена);			
					
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У сотрудника " + Сотрудник + " " + Формат(СтартоваяДата, "ДЛФ = ДДММГГ")+ " запланированы приемы. Удаление интервала невозможно.");			
				КонецЕсли;
			Иначе
				ГрафикПериодовРаботыТабДокВыборПродолжить(КодВозвратаДиалога.Да, СтруктураПараметров);
			КонецЕсли;	
			
			Отказ = истина;
			
		КонецЕсли;  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - график периодов работы продолжить
// 
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
// 
Процедура ГрафикПериодовРаботыТабДокВыборПродолжить(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТаблицуРезультатПланирования(Параметры.СтартоваяДата, ?(Параметры.ФлагНеобходимоОчиститьОбласть, Новый СписокЗначений, Параметры.ИнтервалыРаботы), Параметры.Сотрудник);
		//ПослеЗакрытияФормыСозданияОповещение(РезультатПланированияРазовый, Результат);
		ПослеЗакрытияФормыСозданияОповещение(РезультатПланированияРазовый,);
		МодифицированностьГрафикаРаботы = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Функция проверяет необходимость очищения значения в выбранной ячейке табличного документа "ГрафикПериодовРаботыТабДок"
// 
// 
Функция ПроверитьНеобходимостьОчисткиОбласти(Знач СодержимоеОбласти, Знач ИнтервалыРаботы)
	
	Результат = Истина;
	
	//Если ИнтервалыРаботы.Количество() = 1 Тогда
	//	Результат = Ложь;
	//КонецЕсли;
	
	СодержимоеОбласти = СтрЗаменить(СодержимоеОбласти," ","");
	СодержимоеОбласти = СтрЗаменить(СодержимоеОбласти,"*","");
	
	Если СтрЧислоВхождений(СодержимоеОбласти, Символы.ПС)+1 <> ИнтервалыРаботы.Количество() Тогда
		Результат = Ложь;		
	КонецЕсли;
	
	Для каждого СтрокаТЧ из ИнтервалыРаботы Цикл
		Если СтрНайти(СодержимоеОбласти, СокрЛП(Лев(СтрокаТЧ.Представление, СтрНайти(СтрокаТЧ.Представление,"(")-1))) = 0 тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	
	Возврат Результат;	
	
КонецФункции

&НаКлиенте
// Процедура - Подключаемый декорация формы удалить текущий интервал нажатие
// 
// Параметры:
//  Элемент	 - 	 - 
// 
Процедура Подключаемый_ДекорацияФормы_УдалитьТекущийИнтервал_Нажатие(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлемента(ЭтаФорма, Элемент);
	
	Если НЕ СтруктураДанныеЭлемента.ДанныеЭлемента = Неопределено Тогда
		Если ЭтаФорма[СтруктураДанныеЭлемента.ИмяТаблицы].Количество() = 1 Тогда 
			ЭтаФорма[СтруктураДанныеЭлемента.ИмяТаблицы][СтруктураДанныеЭлемента.ИндексСтроки].Значение = Новый Структура("НачалоРаботы, ОкончаниеРаботы", Неопределено, Неопределено);
			ЭтаФорма[СтруктураДанныеЭлемента.ИмяТаблицы][СтруктураДанныеЭлемента.ИндексСтроки].Представление = "";
		Иначе 
			ЭтаФорма[СтруктураДанныеЭлемента.ИмяТаблицы].Удалить(ЭтаФорма[СтруктураДанныеЭлемента.ИмяТаблицы][СтруктураДанныеЭлемента.ИндексСтроки]);
		КонецЕсли;	
		ОбновитьМенюОтбораИнтерваловРабот();
		ОбновитьОбщееВремяИнтервалов();		
		ОбновитьДекорациюУпраленияСохранениемШаблонов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Обработчик кнопки формирования плана занятий
// 
Процедура КомандаСформировать(Команда)	
	
	Если ПроверитьНеобходимостьФиксацииИзмененийВПлане() Тогда
		
		Если ПроверитьБуферФормированияНаПересечениеПериодов() Тогда
			ЗафиксироватьИзмененияВПланеЗанятий();			
			ПоказатьОповещениеПользователя(,,"График работы сохранен.", БиблиотекаКартинок.Информация32, СтатусОповещенияПользователя.Информация);
		КонецЕсли;
	Иначе
		ПоказатьОповещениеПользователя(,,"Изменений в графике работы не обнаружено.", БиблиотекаКартинок.Информация32, СтатусОповещенияПользователя.Информация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Показать список шаблонов.
// 
// Параметры:
//  Команда	 - 	 - 
// 
Процедура ПоказатьСписокШаблонов(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборШаблонаИзСписка", ЭтотОбъект);
	СписокПериодов     = ПолучитьСписокПериодовРаботы(ОтборСтруктурнаяЕдиница);
	Если СписокПериодов.Количество() > 10 Тогда
		мПараметры = Новый Структура();
		мПараметры.Вставить("ВариантОтображения","Период");
		мПараметры.Вставить("СтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница);
		ОткрытьФорму("Справочник.ПериодыРаботы.Форма.ФормаВыбораГрафикРаботы",мПараметры,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе 
		ПоказатьВыборИзМеню(ОписаниеОповещения, СписокПериодов, Элементы.ПоказатьСписокШаблонов);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбрать период планирования
// 
// Параметры:
//  Команда	 - 	 - 
// 
Процедура ВыбратьПериодПланирования(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = ОтборПериод;
	Диалог.Показать(Новый ОписаниеОповещения("ОтборПериодаПланированииПриИзменении", ЭтаФорма)); 

КонецПроцедуры

&НаКлиенте
// Процедура - Команда добавить интервал
// 
// Параметры:
//  Команда	 - 	 - 
// 
Процедура КомандаДобавитьИнтервал(Команда)
	
	ОтборИнтервалыРаботы.Добавить(Новый Структура("НачалоРаботы, ОкончаниеРаботы", Неопределено, Неопределено));
	ОбновитьМенюОтбораИнтерваловРабот();
	ОбновитьДекорациюУпраленияСохранениемШаблонов();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый выбор начала интервала
// 
// Параметры:
//  Команда	 - 	 - 
// 
Процедура Подключаемый_ВыборНачалаИнтервала(Команда)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлемента(ЭтаФорма, Команда);
	
	Если НЕ СтруктураДанныеЭлемента.ДанныеЭлемента = Неопределено Тогда 
		
		Шаг = 15; // в минутах		
		ИмяЭлемента = "Кнопка_ВыборНачалаИнтервала_" + СтруктураДанныеЭлемента.ИндексСтроки;
		СтруктураДанныеЭлемента.Вставить("ИмяЭлемента"			, ИмяЭлемента);			
		СтруктураДанныеЭлемента.Вставить("ЭтоНачалоИнтервала"	, Истина);
		
		ЭлементМассиваДней = Неопределено;
		
		Для Каждого ЭлементМ ИЗ ВремяРаботыСтруктурнойЕдиницы Цикл
				
			Если ЭлементМассиваДней = Неопределено Тогда 
				ЭлементМассиваДней = ЭлементМ;
			ИначеЕсли ЭлементМассиваДней.ДатаНачала > ЭлементМ.ДатаНачала Тогда // находим минимум
				ЭлементМассиваДней = ЭлементМ;
			КонецЕсли;
			
		КонецЦикла;			
		Если ЭлементМассиваДней <> Неопределено Тогда
			// Заполнить список интервалов времени
			МассивПериодов = Новый Массив;
			МассивПериодов.Добавить(ЭлементМассиваДней);
			НачинаяСВремени 		= ВернутьПоследнееУказанноеВремя(СтруктураДанныеЭлемента, Шаг);			
			СписокВермениРаботы  	= ОбщегоНазначенияКлиентСерверСтоматология.ВернутьСписокВремени(МассивПериодов, Истина, Шаг, , НачинаяСВремени);	
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыборВремениИзСписка", ЭтотОбъект, СтруктураДанныеЭлемента);
			
			Если СписокВермениРаботы.Количество() > 10 Тогда
				
				мПараметры = Новый Структура();				
				мПараметры.Вставить("ВариантОтображения", "НачалоПериода");
                мПараметры.Вставить("Таблица", СписокВермениРаботы);
				ОткрытьФорму("Справочник.ПериодыРаботы.Форма.ФормаВыбораГрафикРаботы", мПараметры,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				
			Иначе
			
			ЭтаФорма.ПоказатьВыборИзМеню(ОписаниеОповещения, СписокВермениРаботы, Элементы[ИмяЭлемента]);
			
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый выбор окончания интервала
// 
// Параметры:
//  Команда	 - 	 - 
// 
Процедура Подключаемый_ВыборОкончанияИнтервала(Команда)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлемента(ЭтаФорма, Команда);
	
	Если НЕ СтруктураДанныеЭлемента.ДанныеЭлемента = Неопределено Тогда 
		
		Шаг = 15; // в минутах
		ИмяЭлемента = "Кнопка_ВыборОкончанияИнтервала_" + СтруктураДанныеЭлемента.ИндексСтроки;
		СтруктураДанныеЭлемента.Вставить("ИмяЭлемента"			, ИмяЭлемента);			
		СтруктураДанныеЭлемента.Вставить("ЭтоНачалоИнтервала"	, Ложь);
		
		ЭлементМассиваДней = Неопределено;
		Для Каждого ЭлементМ ИЗ ВремяРаботыСтруктурнойЕдиницы Цикл
			
			Если ЭлементМассиваДней = Неопределено Тогда
				
				ЭлементМассиваДней = ЭлементМ; 
				
			ИначеЕсли ЭлементМассиваДней.ДатаОкончания < ЭлементМ.ДатаОкончания Тогда // находим минимум
									
				ЭлементМассиваДней = ЭлементМ;
				
			КонецЕсли;
				
		КонецЦикла;
		
		Если ЭлементМассиваДней <> Неопределено Тогда
			
			// Заполнить список интервалов времени
			МассивПериодов = Новый Массив();
			МассивПериодов.Добавить(ЭлементМассиваДней);
			НачинаяСВремени 		= ВернутьПоследнееУказанноеВремя(СтруктураДанныеЭлемента, Шаг);
			СписокВермениРаботы 	= ОбщегоНазначенияКлиентСерверСтоматология.ВернутьСписокВремени(МассивПериодов, Ложь, Шаг, , НачинаяСВремени);	
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыборВремениИзСписка", ЭтотОбъект, СтруктураДанныеЭлемента);
			Если СписокВермениРаботы.Количество() > 10 Тогда
				
				мПараметры = Новый Структура();				
				мПараметры.Вставить("ВариантОтображения", "КонецПериода");
				мПараметры.Вставить("Таблица", СписокВермениРаботы);
				ОткрытьФорму("Справочник.ПериодыРаботы.Форма.ФормаВыбораГрафикРаботы", мПараметры,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				
			Иначе
				ЭтаФорма.ПоказатьВыборИзМеню(ОписаниеОповещения, СписокВермениРаботы, Элементы[ИмяЭлемента]);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Распечатать график
// 
// 
Процедура КомандаГрафикПериодовРаботыРаспечатать(Команда)
	
	Если ПроверитьНеобходимостьФиксацииИзмененийВПлане() = Истина Тогда        
		
		Ответ = Неопределено;        
		
		ПоказатьВопрос(Новый ОписаниеОповещения("КомандаГрафикПериодовРаботыРаспечататьЗавершение", ЭтотОбъект), "Имеются несохраненные изменения." + Символы.ПС + "Печать графика работы сотрудников возможна только после записи." + Символы.ПС + "Данные будут записаны.",РежимДиалогаВопрос.ОКОтмена,,,"Планирование");   		
		
	Иначе 
		
		ПараметрКоманды = Новый Массив;   
		ПараметрКоманды.Добавить(Объект); 
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Обработка.ГрафикРаботыСотрудников", // Для вызова метода менеджера обработки "Печать".
		"ПланированиеГрафикаРаботыСотрудников",
		ПараметрКоманды,
		ЭтаФорма, // Форма владелец
		ПолучитьПараметрыПечати()); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаГрафикПериодовРаботыРаспечататьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		ЗафиксироватьИзмененияВПланеЗанятий();	
		
		ПараметрКоманды = Новый Массив;   
		ПараметрКоманды.Добавить(Объект); 
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Обработка.ГрафикРаботыСотрудников", // Для вызова метода менеджера обработки "Печать".
		"ПланированиеГрафикаРаботыСотрудников",
		ПараметрКоманды,
		ЭтаФорма, // Форма владелец
		ПолучитьПараметрыПечати()); 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Открыть список сотрудников.
// 
// 
Процедура ОткрытьСписокСотрудников(Команда)
	
	СписокСотрудниковПоОтборамКэш = Неопределено;
	
	ЗаполнитьСорудниковСогласноОтборов(ОтборСотрудник, СписокСотрудниковПоОтборамКэш, Истина);
	//Элементы.ОткрытьСписокСотрудники.Заголовок = "Все";
	Оповещение = Новый ОписаниеОповещения("ОткрытьСписокСотрудниковЗавершение",ЭтотОбъект);
	мПараметры = Новый Структура();
	мПараметры.Вставить("СтруктурнаяЕдиница"	, ОтборСтруктурнаяЕдиница);
	мПараметры.Вставить("ДатаНачала"			, ОтборПериод.ДатаНачала);
	мПараметры.Вставить("ДатаОкончания"			, ОтборПериод.ДатаОкончания);
	мПараметры.Вставить("СписокСотрудников"		, СписокСотрудниковПоОтборамКэш);
	
  	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаВыбораГрафикРаботы", мПараметры,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры 

&НаКлиенте
// Процедура - Открыть список сотрудников.
// 
// 
Процедура ОткрытьСписокДолжностей(Команда)
	
	ВременныйСписокСотрудников = Неопределено;
	
	ЗаполнитьСорудниковСогласноОтборов(ОтборСотрудникДолжность, ВременныйСписокСотрудников, Истина);	
	//Элементы.ОткрытьСписокДолжности.Заголовок = "Все";

	СписокЗначений = ПолучитьСписокДолжностей(ВременныйСписокСотрудников);
	Оповещение = Новый ОписаниеОповещения("ОткрытьСписокДолжностейЗавершение", ЭтотОбъект);

	Если СписокЗначений.Количество() > 20 Тогда	
		ОткрытьФорму("Справочник.Должности.Форма.ФормаВыбора",,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	Иначе			
		ПоказатьВыборИзМеню(Оповещение, СписокЗначений, ЭтаФорма.Элементы.ПереклДолжность);	
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
// Процедура - Открыть список сотрудников.
// 
// 
Процедура ОткрытьСписокРолей(Команда)
	
	ВременныйСписокСотрудников = Неопределено;
	
	ЗаполнитьСорудниковСогласноОтборов(ОтборСотрудникРоль, ВременныйСписокСотрудников, Истина);
	//Элементы.ОткрытьСписокДолжности.Заголовок = "Все";
	
	СписокЗначений = ПолучитьСписокРолей(ВременныйСписокСотрудников);

	Оповещение = Новый ОписаниеОповещения("ОткрытьСписокРолейЗавершение", ЭтотОбъект);
			
	ПоказатьВыборИзМеню(Оповещение, СписокЗначений, ЭтаФорма.Элементы.ПереклРоль);	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Отменить отбор по сотруднику.
// 
// 
Процедура ОтменитьОтборПоСотруднику(Команда)
	
	ОтборСотрудник = "Все";
	ОтборГрафикПериодовРаботыПоСотруднику();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Отменить отбор по сотруднику.
// 
// 
Процедура ОтменитьОтборПоДолжности(Команда)
	
	ОтборСотрудникДолжность = "Все";
	ОтборГрафикПериодовРаботыПоСотруднику();
	
КонецПроцедуры 

&НаКлиенте
// Процедура - Отменить отбор по сотруднику.
// 
// 
Процедура ОтменитьОтборПоРоли(Команда)
	
	ОтборСотрудникРоль = "Все";
	ОтборГрафикПериодовРаботыПоСотруднику();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Открыть список салонов.
// 
// 
Процедура ОткрытьСписокКлиник(Команда)
	
	СписокЗначений = ПолучитьСписокКлиник();  
	Оповещение = Новый ОписаниеОповещения("ОткрытьСписокКлиникЗавершение", ЭтотОбъект);
	Если СписокЗначений.Количество() > 5 Тогда
		
		СтруктураПараметров  =  Новый Структура;
		СтруктураПараметров.Вставить("ЭтоПользователь", Истина);
		СтруктураПараметров.Вставить("Ссылка", СписокЗначений.ВыгрузитьЗначения());  
		СтруктураПараметров.Вставить("ВидСравненияКомпоновкиДанных", ВидСравненияКомпоновкиДанных.ВСписке); 
		ОткрытьФорму("Справочник.СтруктурныеЕдиницы.Форма.ФормаВыбора",СтруктураПараметров,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
	Иначе
		
		ПоказатьВыборИзМеню(Оповещение, СписокЗначений, ЭтаФорма.Элементы.ПереклКлиника); 
		
	КонецЕсли;
	
КонецПроцедуры

#Область   ОбработчикиКонтекстногоМенюТабличногоДокумента

&НаКлиенте
// Процедура - Обработка команды "Заполнить по дням недели" табличного документа
// 
// 
Процедура КомандаГрафикПериодовРаботыТабДокЗаполнитьПоДнямНедели(Команда)
	
	ИмяОбласти = Элементы.ГрафикПериодовРаботыТабДок.ТекущаяОбласть.Имя; 
	
	СтруктураДанныхОбласти = ПолучитьДанныеВыделеннойОбластиГрафикПериодовРаботыТабДок(ИмяОбласти);

	СтартоваяДата = СтруктураДанныхОбласти.ВыбПериод;
	Если Не ЗначениеЗаполнено(СтартоваяДата) Тогда
		Возврат;
	КонецЕсли;     	

	Сотрудник = СтруктураДанныхОбласти.Сотрудник;
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат;
	КонецЕсли;   
	
	ПериодЗаполнения = Новый СтандартныйПериод(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);
	
	ИнтервалыСформированы = ФормированиеИнтерваловЗавершено(Ложь);
	
	ИнтервалыРаботы = ОтборИнтервалыРаботы.Скопировать();
	Если НЕ ИнтервалыСформированы Тогда
		ИнтервалыРаботы.Очистить();
	КонецЕсли;    	
	
	ПараметрыПланирования = Новый Структура;	
	ПараметрыПланирования.Вставить("ПериодЗаполнения"   , ПериодЗаполнения);
	ПараметрыПланирования.Вставить("СтартоваяДата"      , СтартоваяДата);
	ПараметрыПланирования.Вставить("Сотрудник"          , Сотрудник);
	ПараметрыПланирования.Вставить("ИнтервалыРаботы"	, ИнтервалыРаботы);
	ПараметрыПланирования.Вставить("РежимПланированияРабочихДней", 0);
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыСозданияОповещение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ГрафикРаботыСотрудников.Форма.ФормаСоздания", ПараметрыПланирования, ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка команды "Заполнить циклически" табличного документа
// 
// 
Процедура КомандаГрафикПериодовРаботыТабДокЗаполнитьЦиклически(Команда)
	
	ИмяОбласти = Элементы.ГрафикПериодовРаботыТабДок.ТекущаяОбласть.Имя; 
	
	СтруктураДанныхОбласти = ПолучитьДанныеВыделеннойОбластиГрафикПериодовРаботыТабДок (ИмяОбласти);

	СтартоваяДата = СтруктураДанныхОбласти.ВыбПериод;
	Если Не ЗначениеЗаполнено(СтартоваяДата) Тогда
		Возврат;
	КонецЕсли;     	

	Сотрудник = СтруктураДанныхОбласти.Сотрудник;
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат;
	КонецЕсли;   
	
	ПериодЗаполнения     = Новый СтандартныйПериод(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);
	ИнтервалыСформированы = ФормированиеИнтерваловЗавершено(Ложь);
	
	ИнтервалыРаботы = ОтборИнтервалыРаботы.Скопировать();
	Если НЕ ИнтервалыСформированы Тогда
		ИнтервалыРаботы.Очистить();
	КонецЕсли;      
	
	ПараметрыПланирования = Новый Структура;	
	ПараметрыПланирования.Вставить("ПериодЗаполнения"   , ПериодЗаполнения);
	ПараметрыПланирования.Вставить("СтартоваяДата"      , СтартоваяДата);
	ПараметрыПланирования.Вставить("Сотрудник"          , Сотрудник);
	ПараметрыПланирования.Вставить("ИнтервалыРаботы"	, ИнтервалыРаботы);
	ПараметрыПланирования.Вставить("РежимПланированияРабочихДней", 1);
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыСозданияОповещение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ГрафикРаботыСотрудников.Форма.ФормаСоздания",ПараметрыПланирования, ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка команды "Скопировать с предыдущего дня недели" табличного документа
// 
// 
Процедура КомандаГрафикПериодовРаботыТабДокСкопироватьДеньСПредыдущейНедели(Команда)
	
	ИмяОбласти = Элементы.ГрафикПериодовРаботыТабДок.ТекущаяОбласть.Имя; 
	СтруктураДанныхОбласти = ПолучитьДанныеВыделеннойОбластиГрафикПериодовРаботыТабДок (ИмяОбласти);

	СтартоваяДата = СтруктураДанныхОбласти.ВыбПериод;
	Если Не ЗначениеЗаполнено(СтартоваяДата) Тогда
		Возврат;
	КонецЕсли;     	

	Сотрудник = СтруктураДанныхОбласти.Сотрудник;
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат;
	КонецЕсли;   
	
	ОтборСотрудник =  Сотрудник;
	
	ЗаполнитьРезультатПланированияНаСервере(СтартоваяДата, "День");
	
	Если РезультатПланированияРазовый.Количество() > 0 Тогда 
		ПослеЗакрытияФормыСозданияОповещение(РезультатПланированияРазовый, Неопределено);
	КонецЕсли;    		
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка команды "Скопировать предыдущую неделю" табличного документа
// 
// 
Процедура КомандаГрафикПериодовРаботыТабДокСкопироватьПредыдущуюНеделю(Команда)
	
	ИмяОбласти = Элементы.ГрафикПериодовРаботыТабДок.ТекущаяОбласть.Имя; 
	СтруктураДанныхОбласти = ПолучитьДанныеВыделеннойОбластиГрафикПериодовРаботыТабДок (ИмяОбласти);
	
	СтартоваяДата = СтруктураДанныхОбласти.ВыбПериод;
	Если Не ЗначениеЗаполнено(СтартоваяДата) Тогда
		Возврат;
	КонецЕсли;     	
	
	Сотрудник = СтруктураДанныхОбласти.Сотрудник;
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат;
	КонецЕсли;   
	
	ОтборСотрудник =  Сотрудник;
	
	ЗаполнитьРезультатПланированияНаСервере(СтартоваяДата, "Неделя");
	
	Если РезультатПланированияРазовый.Количество() > 0 Тогда 
		ПослеЗакрытияФормыСозданияОповещение(РезультатПланированияРазовый, Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Обработка команды "Удалить выбранный" табличного документа
// 
// 
Процедура КомандаГрафикПеридовРаботыТабДокУдалитьВыбранные(Команда)
	
	НомерОперации = НомерПоследнейОперацииВОчередиБуфера() + 1;
	ИмяОбласти = Элементы.ГрафикПериодовРаботыТабДок.ТекущаяОбласть.Имя; 
	СтруктураДанныхОбласти = ПолучитьДанныеВыделеннойОбластиГрафикПериодовРаботыТабДок(ИмяОбласти);
	
	СтартоваяДата = СтруктураДанныхОбласти.ВыбПериод;
	Если Не ЗначениеЗаполнено(СтартоваяДата) Тогда
		Возврат;
	КонецЕсли;     	
	
	Сотрудник = СтруктураДанныхОбласти.Сотрудник;
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат;
	КонецЕсли;  
	
	МассивИзмененныхДней = новый Массив;
	СтрокаБуфера = СтрокаБуфераФомированияПоСотрудникуДате(Сотрудник, СтартоваяДата);
	
	Если СтрокаБуфера <> Неопределено Тогда
		Если СтрокаБуфера.Операция = "Создать" Тогда
			МассивИзмененныхДней.Добавить(СтартоваяДата);
			БуферФормирования.Удалить(СтрокаБуфера);
		Иначе    				
			Данные = ПроверитьНаличиеПриема(СтрокаБуфера.Сотрудник, СтрокаБуфера.Дата, СтрокаБуфера.ИнтервалыРаботы, ОтборСтруктурнаяЕдиница);
			Если НЕ ЗначениеЗаполнено(Данные) Тогда
				МассивИзмененныхДней.Добавить(СтартоваяДата);
				СтрокаБуфера.Операция              = "Удалить";
				СтрокаБуфера.НомерОчередиОперации  = НомерОперации;
			Иначе   					
				Интервал = Формат(СтрокаБуфера.Дата, "ДЛФ=DD") + " с " + Формат(Данные.НачалоРаботы, "ДФ=HH:мм") + " по " + Формат(Данные.ОкончаниеРаботы, "ДФ=HH:мм");
				Текст = "В интервале " + Интервал + " созданы приемы. Удаление интервала невозможно.";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
				Возврат;   					
			КонецЕсли;   				
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьОтображениеПланирования(Ложь, Сотрудник, МассивИзмененныхДней);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка команды "Удалить за период" табличного документа
//  удаляет расписание за выбранный день недели
//      
Процедура КомандаГрафикПериодовРаботыТабДокУдалитьЗаПериод(Команда)
	
	ИмяОбласти = Элементы.ГрафикПериодовРаботыТабДок.ТекущаяОбласть.Имя; 
	
	СтруктураДанныхОбласти = ПолучитьДанныеВыделеннойОбластиГрафикПериодовРаботыТабДок(ИмяОбласти);
	
	СтартоваяДата = СтруктураДанныхОбласти.ВыбПериод;
	Если Не ЗначениеЗаполнено(СтартоваяДата) Тогда
		Возврат;
	КонецЕсли;     	
	
	Сотрудник = СтруктураДанныхОбласти.Сотрудник;
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат;
	КонецЕсли;  
	
	МассивИзмененныхДней = Новый Массив;
	
	НомерДняНеделиДляУдаления = ДеньНедели(СтартоваяДата);
	НомерОперации             = НомерПоследнейОперацииВОчередиБуфера() + 1;
	Индекс                    = 0;
	
	БуферФормированияСотрудника = БуферФормирования.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник));
	
	Пока Индекс < БуферФормированияСотрудника.Количество() Цикл
		СтрокаБуфера = БуферФормированияСотрудника[Индекс]; 
		
		Если ДеньНедели(СтрокаБуфера.Дата) = НомерДняНеделиДляУдаления Тогда 
			
			Если СтрокаБуфера.Операция = "Создать" Тогда
				МассивИзмененныхДней.Добавить(СтрокаБуфера.Дата);
				БуферФормирования.Удалить(СтрокаБуфера);
				Индекс = Индекс + 1;
				Продолжить;
			Иначе
				Данные = ПроверитьНаличиеПриема(СтрокаБуфера.Сотрудник, СтрокаБуфера.Дата, СтрокаБуфера.ИнтервалыРаботы, ОтборСтруктурнаяЕдиница);
				Если НЕ ЗначениеЗаполнено(Данные) Тогда
					МассивИзмененныхДней.Добавить(СтрокаБуфера.Дата);
					СтрокаБуфера.Операция              = "Удалить";
					СтрокаБуфера.НомерОчередиОперации  = НомерОперации;    						
				Иначе
					Интервал = Формат(СтрокаБуфера.Дата, "ДЛФ=DD") + " с " + Формат(Данные.НачалоРаботы, "ДФ=HH:мм") + " по " + Формат(Данные.ОкончаниеРаботы, "ДФ=HH:мм");
					Текст = "В интервале " + Интервал + " созданы приемы. Удаление интервала невозможно.";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
				КонецЕсли;
			КонецЕсли;		
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	
	ОбновитьОтображениеПланирования(Ложь, Сотрудник, МассивИзмененныхДней);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка команды "Удалить все" табличного документа
//  удалаяет все расписание по сотруднику
//      
Процедура КомандаГрафикПериодовРаботыТабДокУдалитьВсе(Команда)
		
	ИмяОбласти = Элементы.ГрафикПериодовРаботыТабДок.ТекущаяОбласть.Имя; 
	СтруктураДанныхОбласти = ПолучитьДанныеВыделеннойОбластиГрафикПериодовРаботыТабДок (ИмяОбласти);
	
	СтартоваяДата = СтруктураДанныхОбласти.ВыбПериод;
	Если Не ЗначениеЗаполнено(СтартоваяДата) Тогда
		Возврат;
	КонецЕсли;     	
	
	Сотрудник = СтруктураДанныхОбласти.Сотрудник;
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат;
	КонецЕсли;  
	
	СтрокаБуфераОбразец = СтрокаБуфераФомированияПоСотрудникуДате(Сотрудник, СтартоваяДата);
	
	НомерОперации             = НомерПоследнейОперацииВОчередиБуфера() + 1;
	Индекс                    = 0;
	Пока Индекс < БуферФормирования.Количество() Цикл
		СтрокаБуфера = БуферФормирования[Индекс]; 
		// очищаем расписание по выбранному сотруднику
		Если СтрокаБуфера.Сотрудник = Сотрудник Тогда
			Если СтрокаБуфера.Операция = "Создать" Тогда
				БуферФормирования.Удалить(СтрокаБуфера);
				Продолжить;
			Иначе
				Данные = ПроверитьНаличиеПриема(СтрокаБуфера.Сотрудник, СтрокаБуфера.Дата, СтрокаБуфера.ИнтервалыРаботы, ОтборСтруктурнаяЕдиница);
				Если НЕ ЗначениеЗаполнено(Данные) Тогда
					СтрокаБуфера.Операция              = "Удалить";
					СтрокаБуфера.НомерОчередиОперации  = НомерОперации;
				Иначе
					Интервал = Формат(СтрокаБуфера.Дата, "ДЛФ=DD") + " с " + Формат(Данные.НачалоРаботы, "ДФ=HH:мм") + " по " + Формат(Данные.ОкончаниеРаботы, "ДФ=HH:мм");
					Текст = "В интервале " + Интервал + " созданы приемы. Удаление интервала невозможно.";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
				КонецЕсли;
			КонецЕсли;		
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла; 
	
	ОбновитьОтображениеПланирования(Ложь, Сотрудник);
	
КонецПроцедуры  

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура - заполнить таблицу значений РезультатПланирования.
// 
Процедура ЗаполнитьТаблицуРезультатПланирования(Знач ВыбПериод, Знач ИнтервалыРаботы, Знач Сотрудник)
	
	РезультатПланированияРазовый.Очистить();
	
	Если ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Больничный Тогда
	    ИнтервалыРаботыПредст = "Б";
		СуммаРабочегоВремени  = 0;
    ИначеЕсли ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Отпуск Тогда
	    ИнтервалыРаботыПредст = "О";
		СуммаРабочегоВремени  = 0;
	Иначе
		ИнтервалыРаботыПредст = ПредставлениеИнтервалаВремени(ИнтервалыРаботы);
		СуммаРабочегоВремени  = СуммаИнтерваловВМинутахНаСервере(ИнтервалыРаботы);
	КонецЕсли;
	
	НоваяСтрока                       = РезультатПланированияРазовый.Добавить();
	НоваяСтрока.Дата                  = ВыбПериод; 
	НоваяСтрока.ИнтервалыРаботы       = ИнтервалыРаботы;
	НоваяСтрока.ИнтервалыРаботыПредст = ИнтервалыРаботыПредст;
	НоваяСтрока.СуммаРабочегоВремени  = СуммаРабочегоВремени;
	НоваяСтрока.Сотрудник             = Сотрудник;
	НоваяСтрока.ТипРабочегоВремени    = ТипРабочегоВремени;
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить результат планирования на сервере
// 
// Параметры:
//  ДатаНачалаПериода	 - 	 - 
//  ДатаКонцаПериода	 - 	 - 
//  СтруктураПоиска		 - 	 - 
// 
Процедура ЗаполнитьРезультатПланированияНаСервере(Знач ВыбраннаяДата, Знач ПериодКопирования)
	
	День = 86400;
	РезультатПланированияРазовый.Очистить();
	СтруктураПоиска = ПолучитьПараметрыПоиска();
	
	// Определим период-источник
	Если ПериодКопирования = "День" Тогда
		ДатаНачалаПериодаИсточника 	= НачалоДня(ВыбраннаяДата - День*7);
		ДатаКонцаПериодаИсточника 	= КонецДня(ДатаНачалаПериодаИсточника);
	ИначеЕсли ПериодКопирования = "Неделя" Тогда
		ДатаНачалаПериодаИсточника 	= ОбщегоНазначенияКлиентСерверСтоматология.ДатаПоНомеруНедели(НеделяГода(ВыбраннаяДата) - 1, Год(ВыбраннаяДата));
		ДатаКонцаПериодаИсточника 	= КонецНедели(ДатаНачалаПериодаИсточника); 
	ИначеЕсли ПериодКопирования = "Месяц" Тогда 
		ДатаНачалаПериодаИсточника 	= НачалоМесяца(НачалоМесяца(ВыбраннаяДата)-1);
		ДатаКонцаПериодаИсточника 	= КонецМесяца(НачалоМесяца(ВыбраннаяДата)-1); 
	КонецЕсли;
	
	// Период-источник не пересекается с буфером
	Если ДатаНачалаПериодаИсточника < ОтборПериод.ДатаНачала И ДатаКонцаПериодаИсточника < ОтборПериод.ДатаНачала Тогда 
		ТаблицаЗанятий = ПолучитьДанныеВнеБуфера(ДатаНачалаПериодаИсточника, ДатаКонцаПериодаИсточника, СтруктураПоиска);
		// Период-источник пересекается с буфером
	ИначеЕсли ДатаНачалаПериодаИсточника < ОтборПериод.ДатаНачала И	ДатаКонцаПериодаИсточника > ОтборПериод.ДатаНачала Тогда 
		ТаблицаЗанятий = БуферФормирования.Выгрузить();
		ТаблицаЗанятий = ТаблицаЗанятий.СкопироватьКолонки();
		ТаблицаЗанятийВнеБуфера = ПолучитьДанныеВнеБуфера(ДатаНачалаПериодаИсточника, КонецДня(НачалоДня(ОтборПериод.ДатаНачала)-1), СтруктураПоиска);
		Для Каждого СтрокаТЗ Из ТаблицаЗанятийВнеБуфера Цикл 
			НоваяСтрока = ТаблицаЗанятий.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		КонецЦикла;
		// Дополним таблицу из буфера
		Для Каждого СтрокаТЗ Из БуферФормирования Цикл 
			НоваяСтрока = ТаблицаЗанятий.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		КонецЦикла;	
		// Период-источник находится в буфере
	ИначеЕсли ДатаНачалаПериодаИсточника >= ОтборПериод.ДатаНачала И ДатаКонцаПериодаИсточника <= ОтборПериод.ДатаОкончания Тогда 
		ТаблицаЗанятий = БуферФормирования.Выгрузить();
	КонецЕсли;	
	
	// Заполняем результат планирования	
	Если ПериодКопирования = "День" Тогда
		
		СтруктураПоиска.Вставить("Дата", ДатаНачалаПериодаИсточника);			
		МассивСтрок = ТаблицаЗанятий.НайтиСтроки(СтруктураПоиска); 
		Для Каждого ЭлементМассива Из МассивСтрок Цикл
			НоваяСтрока                     = РезультатПланированияРазовый.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
			НоваяСтрока.Дата 				= НачалоДня(ВыбраннаяДата);
		КонецЦикла;
		
	ИначеЕсли ПериодКопирования = "Неделя" Тогда 
		
		Пока ДатаНачалаПериодаИсточника < ДатаКонцаПериодаИсточника Цикл 
			Если НЕ (ДатаНачалаПериодаИсточника + День*7 < ОтборПериод.ДатаНачала ИЛИ ДатаНачалаПериодаИсточника + День*7 > ОтборПериод.ДатаОкончания) Тогда
				СтруктураПоиска.Вставить("Дата", ДатаНачалаПериодаИсточника);			
				МассивСтрок = ТаблицаЗанятий.НайтиСтроки(СтруктураПоиска); 
				Для Каждого ЭлементМассива Из МассивСтрок Цикл
					НоваяСтрока                     = РезультатПланированияРазовый.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
					НоваяСтрока.Дата 				= НоваяСтрока.Дата + День*7;
				КонецЦикла;
			КонецЕсли;
			ДатаНачалаПериодаИсточника = ДатаНачалаПериодаИсточника + День;
		КонецЦикла;
		
	ИначеЕсли ПериодКопирования = "Месяц" Тогда
		
		ДатаНачалаПериодаПриемника = ДобавитьМесяц(ДатаНачалаПериодаИсточника, 1);
		ДатаКонцаПериодаИсточника = КонецДня(ДобавитьМесяц(ДобавитьМесяц(ДатаКонцаПериодаИсточника, 1), -1));
		Пока ДатаНачалаПериодаИсточника < ДатаКонцаПериодаИсточника Цикл 
			
			Если ДеньНедели(ДатаНачалаПериодаПриемника) > ДеньНедели(ДатаНачалаПериодаИсточника) Тогда 
				ДатаНачалаПериодаИсточника = ДатаНачалаПериодаИсточника + День;
			ИначеЕсли ДеньНедели(ДатаНачалаПериодаПриемника) < ДеньНедели(ДатаНачалаПериодаИсточника) Тогда	
				ДатаНачалаПериодаПриемника = ДатаНачалаПериодаПриемника + День*(ДеньНедели(ДатаНачалаПериодаИсточника) - ДеньНедели(ДатаНачалаПериодаПриемника));
			КонецЕсли;
			
			Если ДеньНедели(ДатаНачалаПериодаПриемника) = ДеньНедели(ДатаНачалаПериодаИсточника) Тогда
				Если НЕ (ДобавитьМесяц(ДатаНачалаПериодаИсточника, 1) < ОтборПериод.ДатаНачала ИЛИ ДобавитьМесяц(ДатаНачалаПериодаИсточника, 1) > ОтборПериод.ДатаОкончания) Тогда
					СтруктураПоиска.Вставить("Дата", ДатаНачалаПериодаИсточника);			
					МассивСтрок = ТаблицаЗанятий.НайтиСтроки(СтруктураПоиска); 
					Для Каждого ЭлементМассива Из МассивСтрок Цикл
						Если НЕ ТакоеЗанятиеУжеЕсть(СтруктураПоиска, ДатаНачалаПериодаПриемника, ЭлементМассива) Тогда 
							НоваяСтрока                       = РезультатПланированияРазовый.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
							НоваяСтрока.Дата 				= ДатаНачалаПериодаПриемника;
							НоваяСтрока.ДатаВремяНачала 	= НачалоДня(ДатаНачалаПериодаПриемника) + Час(НоваяСтрока.ДатаВремяНачала)*60*60 + Минута(НоваяСтрока.ДатаВремяНачала)*60;
							НоваяСтрока.ДатаВремяОкончания 	= НачалоДня(ДатаНачалаПериодаПриемника) + Час(НоваяСтрока.ДатаВремяОкончания)*60*60 + Минута(НоваяСтрока.ДатаВремяОкончания)*60;
						КонецЕсли;						
					КонецЦикла;
				КонецЕсли;
				ДатаНачалаПериодаИсточника = ДатаНачалаПериодаИсточника + День;
				ДатаНачалаПериодаПриемника = ДатаНачалаПериодаПриемника + День;
			КонецЕсли;
			
			Если ДатаНачалаПериодаПриемника > КонецМесяца(ДатаНачалаПериодаПриемника) Тогда 
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - Получить параметры поиска
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьПараметрыПоиска()
	
	СтруктураПоиска = Новый Структура;
	
	Если ЗначениеЗаполнено(ОтборСотрудник) Тогда 
		СтруктураПоиска.Вставить("Сотрудник", ОтборСотрудник);
	КонецЕсли;
	
	Возврат СтруктураПоиска;
	
КонецФункции

&НаСервере
// Функция - Получить данные вне буфера
// 
// Параметры:
//  ДатаНачалаПериода	 - 	 - 
//  ДатаКонцаПериода	 - 	 - 
//  СтруктураПоиска		 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьДанныеВнеБуфера(Знач ДатаНачалаПериода, Знач ДатаКонцаПериода, Знач СтруктураПоиска)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремяРаботыСотрудниковПлан.ДатаВремяНачала КАК ДатаВремяНачала,
	|	ВремяРаботыСотрудниковПлан.ДатаВремяОкончания КАК ДатаВремяОкончания,
	|	ВремяРаботыСотрудниковПлан.Сотрудник КАК Сотрудник,
	|	ВремяРаботыСотрудниковПлан.Сотрудник.Должность КАК Должность,
	|	ВремяРаботыСотрудниковПлан.Минуты КАК КолМинут
	|ИЗ
	|	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
	|ГДЕ
	|	ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ВЫБОР
	|			КОГДА &Сотрудник <> НЕОПРЕДЕЛЕНО
	|					И &ГруппаСотрудников = ИСТИНА
	|				ТОГДА ВремяРаботыСотрудниковПлан.Сотрудник В ИЕРАРХИИ (&Сотрудник)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &Сотрудник <> НЕОПРЕДЕЛЕНО
	|					И &ГруппаСотрудников = ЛОЖЬ
	|				ТОГДА ВремяРаботыСотрудниковПлан.Сотрудник = &Сотрудник
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВремяРаботыСотрудниковПлан.ДатаВремяНачала >= &НачалоПериода
	|	И ВремяРаботыСотрудниковПлан.ДатаВремяОкончания <= &ОкончаниеПериода
	|	И ВремяРаботыСотрудниковПлан.ТипРабочегоВремени <> ЗНАЧЕНИЕ(Перечисление.ТипыРабочегоВремени.Отпуск)
	|	И ВремяРаботыСотрудниковПлан.ТипРабочегоВремени <> ЗНАЧЕНИЕ(Перечисление.ТипыРабочегоВремени.Больничный)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВремяРаботыСотрудниковПлан.МесяцОтбор,
	|	Сотрудник,
	|	Должность,
	|	ДатаВремяНачала");
	
	Запрос.УстановитьПараметр("НачалоПериода"    , НачалоДня(ДатаНачалаПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериода" , КонецДня(ДатаКонцаПериода));
	Запрос.УстановитьПараметр("ГруппаСотрудников", ?(СтруктураПоиска.Свойство("Сотрудник") И ЗначениеЗаполнено(СтруктураПоиска.Сотрудник) И СтруктураПоиска.Сотрудник.ЭтоГруппа, Истина, Ложь));
	Запрос.УстановитьПараметр("Сотрудник"        , ?(СтруктураПоиска.Свойство("Сотрудник") И ЗначениеЗаполнено(СтруктураПоиска.Сотрудник), СтруктураПоиска.Сотрудник, Неопределено));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница" , ОтборСтруктурнаяЕдиница);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТЗ_ВремяРаботыСотрудников = БуферФормирования.Выгрузить();
	ТЗ_ВремяРаботыСотрудников = ТЗ_ВремяРаботыСотрудников.СкопироватьКолонки();
	
	ТекДень            	= Неопределено;
	ПредДень           	= Неопределено;
	ТекСтрока_ТЗ    	= Неопределено;
	ПредСтрока_ТЗ   	= Неопределено;
	ПредставлениеИнтервала = "";
	
	Пока Выборка.Следующий() Цикл
		// Получаем дату тек. дня
		ТекДень = День(Выборка.ДатаВремяНачала);
		// Если тек дата не совпадает или указанные параметры
		// создаем новую строку бофуера, иначе считаем что это след. интервал в тот же день
		Если ТекДень <> ПредДень 
			ИЛИ ТекСтрока_ТЗ = Неопределено 
			ИЛИ ТекСтрока_ТЗ.Сотрудник <> Выборка.Сотрудник
			ИЛИ ТекСтрока_ТЗ.Должность <> Выборка.Должность Тогда
			// ИЛИ ТекСтрока_ТЗ.Помещение <> Выборка.Помещение Тогда
			
			ТекСтрока_ТЗ = ТЗ_ВремяРаботыСотрудников.Добавить();
			ЗаполнитьЗначенияСвойств(ТекСтрока_ТЗ, Выборка);
			ТекСтрока_ТЗ.ИдентификаторОбласти  = Новый УникальныйИдентификатор;
			ТекСтрока_ТЗ.Дата                  = Выборка.ДатаВремяНачала;
			ТекСтрока_ТЗ.СуммаРабочегоВремени  = Выборка.КолМинут;
		Иначе
			ТекСтрока_ТЗ.СуммаРабочегоВремени = ТекСтрока_ТЗ.СуммаРабочегоВремени + Выборка.КолМинут;
		КонецЕсли;
		
		// Переменная оптимизации. Кеширует массив данных на время серверного вызова
		МассивНадстрочныхСимволов = Неопределено;
		ПериодРаботы              = Новый Структура("НачалоРаботы, ОкончаниеРаботы,ВсегоМинут", Выборка.ДатаВремяНачала
		, Выборка.ДатаВремяОкончания
		, Выборка.КолМинут);	  
		НачалоПредст              = Формат(ПериодРаботы.НачалоРаботы	, "ДФ=HH:mm"); // Обработки.ПланированиеГрафикаРаботыСотрудников.ПредставлениеВремениСНадстрочнымиСимволами(ПериодРаботы.НачалоРаботы, МассивНадстрочныхСимволов);
		КонецПредст               = Формат(ПериодРаботы.ОкончаниеРаботы	, "ДФ=HH:mm"); // Обработки.ПланированиеГрафикаРаботыСотрудников.ПредставлениеВремениСНадстрочнымиСимволами(ПериодРаботы.ОкончаниеРаботы, МассивНадстрочныхСимволов);
		
		ВремяИнтервала 			= ?(Выборка.КолМинут > 60, Строка(ОбщегоНазначенияКлиентСерверСтоматология.КонвертироватьМинутыВЧасы(Выборка.КолМинут)), Строка(Выборка.КолМинут) + " мин.");
		
		ПредставлениеИнтервала = НачалоПредст + " - " + КонецПредст + " (" + ВремяИнтервала + ")";
		ТекСтрока_ТЗ.ИнтервалыРаботы.Добавить(ПериодРаботы, ПредставлениеИнтервала);
		ТекСтрока_ТЗ.ИнтервалыРаботыПредст = Обработки.ГрафикРаботыСотрудников.ПолучитьПредставлениеСпискаИнтервалов(ТекСтрока_ТЗ.ИнтервалыРаботы);
		
		ПредДень      = ТекДень;
		ПредСтрока_ТЗ = ТекСтрока_ТЗ;	  
	КонецЦикла;	 
	
	Возврат ТЗ_ВремяРаботыСотрудников;
	
КонецФункции

&НаСервере
// Функция - Такое занятие уже есть
// 
// Параметры:
//  СтруктураПоиска				 - 	 - 
//  ДатаНачалаПериодаПриемника	 - 	 - 
//  СтрокаИсточника				 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ТакоеЗанятиеУжеЕсть(Знач СтруктураПоиска, Знач ДатаНачалаПериодаПриемника, Знач СтрокаИсточника)
	
	Флаг = Ложь;
	ДатаНачалаПериодаИсточника = СтруктураПоиска.Дата;
	СтруктураПоиска.Вставить("Дата", ДатаНачалаПериодаПриемника);
	МассивСтрокПриемника = БуферФормирования.НайтиСтроки(СтруктураПоиска);
	Если МассивСтрокПриемника.Количество() > 0 Тогда 
		Для Каждого ЭлементМассива Из МассивСтрокПриемника Цикл 
			Если СтрокаИсточника.Сотрудник = ЭлементМассива.Сотрудник
				И Час(СтрокаИсточника.ДатаВремяНачала) = Час(ЭлементМассива.ДатаВремяНачала)
				И Минута(СтрокаИсточника.ДатаВремяНачала) = Минута(ЭлементМассива.ДатаВремяНачала)
				И Час(СтрокаИсточника.ДатаВремяОкончания) = Час(ЭлементМассива.ДатаВремяОкончания)
				И Минута(СтрокаИсточника.ДатаВремяОкончания) = Минута(ЭлементМассива.ДатаВремяОкончания) Тогда 
				
				Флаг = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Флаг;			
	
КонецФункции

&НаКлиенте         
// Функция проверяет буфер формирования на пересечение периодов
// 
Функция ПроверитьБуферФормированияНаПересечениеПериодов()
	
	// проверем список периодов на пересечение по времени
	Для каждого СтрокаБуфера из БуферФормирования Цикл
		Если (СтрокаБуфера.Операция = "" или СтрокаБуфера.Операция = "Создание") и СтрокаБуфера.ИнтервалыРаботы.Количество() > 0 Тогда
			ПервыйПериодВСписке = СтрокаБуфера.ИнтервалыРаботы[0].Значение;
			Для Каждого ИнтервалСписка ИЗ СтрокаБуфера.ИнтервалыРаботы Цикл
				Если СтрокаБуфера.ИнтервалыРаботы.Индекс(ИнтервалСписка) = 0 Тогда
					Продолжить;
				КонецЕсли;    				
				
				// приоритет отдан этому механизму выявления пересечения периодов
				Если Макс(ПервыйПериодВСписке.НачалоРаботы, ИнтервалСписка.Значение.НачалоРаботы) < Мин(ПервыйПериодВСписке.ОкончаниеРаботы, ИнтервалСписка.Значение.ОкончаниеРаботы) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для сотрудника " + СтрокаБуфера.Сотрудник + " " + Формат(СтрокаБуфера.Дата, "ДЛФ = ДДММГГГГ") + " обнаружено пересечение времени: с " + Формат(Макс(ПервыйПериодВСписке.НачалоРаботы, ИнтервалСписка.Значение.НачалоРаботы), "ДФ=HH:mm") + " по " + Формат(Мин(ПервыйПериодВСписке.ОкончаниеРаботы, ИнтервалСписка.Значение.ОкончаниеРаботы), "ДФ=HH:mm"), ЭтотОбъект);
					Возврат Ложь;	
					Прервать;
				КонецЕсли;   				
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#Область   ПечатьГрафика

&НаСервере
// Функция - Получает структуру параметров печати
// 
// 
Функция ПолучитьПараметрыПечати()

	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("ОтборСтруктурнаяЕдиница",ОтборСтруктурнаяЕдиница);
	СтруктураПараметров.Вставить("ОтборПериод",ОтборПериод);
	СтруктураПараметров.Вставить("ОтборСотрудникДолжность",ОтборСотрудникДолжность);
	
	МассивГрафикПериодовРаботы = новый Массив;
	
	НомерСтрокиТабДок = 2;
	Пока НомерСтрокиТабДок <= ГрафикПериодовРаботыТабДок.ВысотаТаблицы Цикл
		СтруктураСтроки = новый Структура;
		
		ИД_Сотрудник = ГрафикПериодовРаботыТабДок.Область("R"+СтрЗаменить(НомерСтрокиТабДок,Символы.НПП,"")+"C2").Текст;
		ТекСотрудник = НайтиСотрудникаПоИД(ИД_Сотрудник);
		
		СтруктураСтроки.Вставить("Сотрудник",ТекСотрудник);
		СтруктураСтроки.Вставить("Должность",ТекСотрудник.должность);
		ДатаПром = НачалоДня(ОтборПериод.ДатаНачала);
		Пока ДатаПром <= ОтборПериод.ДатаОкончания Цикл
			НомерКолонки = 5+(НачалоДня(ДатаПром) - НачалоДня(ОтборПериод.ДатаНачала))/(24*60*60);
			СтруктураСтроки.Вставить("Период"+СтрЗаменить(Формат(ДатаПром,"ДФ=dd.MM.yyyy"),".",""), ГрафикПериодовРаботыТабДок.Область(СтрЗаменить("R"+Строка(НомерСтрокиТабДок)+"C"+Строка(НомерКолонки)+":"+"R"+Строка(НомерСтрокиТабДок)+"C"+Строка(НомерКолонки),Символы.НПП,"")).Текст);		
			
			ДатаПром = ДатаПром+ 60*60*24;
			
		КонецЦикла;
		
		МассивГрафикПериодовРаботы.Добавить(СтруктураСтроки);
		НомерСтрокиТабДок = НомерСтрокиТабДок + 2;
	КонецЦикла;
	
	СтруктураПараметров.Вставить("ГрафикПериодовРаботы",МассивГрафикПериодовРаботы);
	
	Возврат СтруктураПараметров;
	
КонецФункции

#КонецОбласти

#Область ОткрытиеСохраниеСмен

&НаКлиенте
// Процедура - Декорация управления сохранением шаблонов нажатие
// 
// 
Процедура ДекорацияУправленияСохранениемШаблоновНажатие(Элемент)
	
	Если НЕ ФормированиеИнтерваловЗавершено() Тогда 
		Возврат;
	КонецЕсли;   
	
	Для каждого ИнтервалСписка из ОтборИнтервалыРаботы Цикл	
		СтруктураСравнения = СправочникСменСодержитИнтервал(ОтборСтруктурнаяЕдиница,ИнтервалСписка.Значение);
		
		Если СтруктураСравнения.ФлагНаличияСмены = Истина Тогда 
			ПометитьСнятьПометкуСменуСправочник (СтруктураСравнения.НайденнаяСмена);
		Иначе    			
			ДобавитьСменуВСправочник (ОтборСтруктурнаяЕдиница, ИнтервалСписка.Значение);  			
		КонецЕсли;
		
		ОбновитьДекорациюУпраленияСохранениемСмен(ОтборСтруктурнаяЕдиница, ИнтервалСписка.Значение);    		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура - Добавить смену в справочник смен
// 
// 
Процедура ДобавитьСменуВСправочник (СтруктурнаяЕдиница, ИнтервалСписка)
	
	ПериодРаботыНовый = Справочники.ПериодыРаботы.СоздатьЭлемент();
	
	ПериодРаботыНовый.СтруктурнаяЕдиница	= СтруктурнаяЕдиница;   
	ПериодРаботыНовый.НачалоСмены			= ИнтервалСписка.НачалоРаботы;
	ПериодРаботыНовый.ОкончаниеСмены		= ИнтервалСписка.ОкончаниеРаботы;
	ПериодРаботыНовый.Наименование			= Формат(ПериодРаботыНовый.НачалоСмены,"ДФ=ЧЧ:мм; ДП=00:00") + " - " + Формат(ПериодРаботыНовый.ОкончаниеСмены,"ДФ=ЧЧ:мм; ДП=23:59");
	
	ПериодРаботыНовый.Записать();
	
КонецПроцедуры

&НаСервере
// Процедура - Пометить/снять пометку удаления со смены
// 
// 
Процедура ПометитьСнятьПометкуСменуСправочник (ПериодРаботы)

	ПериодРаботыОбъект =  ПериодРаботы.получитьОбъект();
	ПериодРаботыОбъект.ПометкаУдаления = НЕ ПериодРаботыОбъект.ПометкаУдаления;
	ПериодРаботыОбъект.Записать();
	
Конецпроцедуры

&НаКлиенте
// Процедура - Обновить декорацию упраления сохранением смен
// 
// 
Процедура ОбновитьДекорациюУпраленияСохранениемСмен(СтруктурнаяЕдиница, ИнтервалСписка)
	
	Структура = СправочникСменСодержитИнтервал(СтруктурнаяЕдиница, ИнтервалСписка);	
	
	Если Структура.ФлагНаличияСмены и Структура.ПометкаУдаления Тогда
		Элементы.ДекорацияУправленияСохранениемШаблонов.Картинка = БиблиотекаКартинок.РейтингЗвездаЗаполненная;
		Элементы.ДекорацияУправленияСохранениемШаблонов.Подсказка = "Пометить на удаление смену в справочнике смен";
	Иначе 
		Элементы.ДекорацияУправленияСохранениемШаблонов.Картинка = БиблиотекаКартинок.РейтингЗвездаПустая;
		Элементы.ДекорацияУправленияСохранениемШаблонов.Подсказка = "Добавить смену в справочник смен";		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Список шаблонов содержит структуру интервалов
// 
// Возвращаемое значение:
//   - 
// 
Функция СправочникСменСодержитИнтервал(СтруктурнаяЕдиница, ИнтервалСписка)
	
	ФлагНаличияСмены		= Ложь;
	НайденнаяСмена			= Неопределено;
	ПометкаУдаления	        = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПериодыРаботы.Ссылка КАК ПериодРаботы,
	|	ПериодыРаботы.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.ПериодыРаботы КАК ПериодыРаботы
	|ГДЕ
	|	ПериодыРаботы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ПериодыРаботы.НачалоСмены = &НачалоСмены
	|	И ПериодыРаботы.ОкончаниеСмены = &ОкончаниеСмены";
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"		, СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("НачалоСмены"		 		, ИнтервалСписка.НачалоРаботы);
	Запрос.УстановитьПараметр("ОкончаниеСмены"			, ИнтервалСписка.ОкончаниеРаботы);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		ФлагНаличияСмены = Истина;   				
		НайденнаяСмена	= Результат[0].ПериодРаботы;
		ПометкаУдаления = Результат[0].ПометкаУдаления;
	КонецЕсли;
	   	
	Возврат Новый Структура("ФлагНаличияСмены, НайденнаяСмена, ПометкаУдаления", ФлагНаличияСмены, НайденнаяСмена, ПометкаУдаления);
	
КонецФункции

#КонецОбласти

#Область МетодыВизуализацииПланаИРаботаСБуферомФормирония

&НаСервере
// Сформировать план занятий на сервере
// 
Процедура ОбновитьОтображениеПланирования(ПерезаполнитьБуфер, Сотрудник = Неопределено, МассивИзмененныхДней = Неопределено)
	
	//Helix = ЗащитаСервер.СоздатьОбъект("Helix");
	//Helix.ОбновитьОтображениеПланирования(ПерезаполнитьБуфер, Сотрудник, МассивИзмененныхДней, ЭтаФорма); 
	
	СформироватьТекстПериода();
		
	// Заполняем буфер существующими занятиями
	Если ПерезаполнитьБуфер = Истина Тогда
		ЗаполнитьБуферСуществующимиДанными();
	КонецЕсли;
	               	
	БуферФормирования.Сортировать("Дата");
	
	ОбновитьСогласноБуфераФормирования(ПерезаполнитьБуфер, Сотрудник, МассивИзмененныхДней);
	
КонецПроцедуры

&НаСервере
// Процедура дополнения буфера новыми данными планирования
// 
Процедура ДополнитьБуферНовымиДаннымиПланирования(ТаблицаРезПланирования)
	
	Сотрудник				= Неопределено;
	МассивИзмененныхДней	= Новый Массив;
	 
	// Заполняем буфер новыми данными
	НомерОперации = НомерПоследнейОперацииВОчередиБуфераНаСервере() + 1;
	Для Каждого СтрокаРЗ ИЗ ТаблицаРезПланирования Цикл
		
		Сотрудник		= СтрокаРЗ.Сотрудник;			
		ФлагПроверки	= Истина;
		
		// проверем список периодов на пересечение по времени
		Если СтрокаРЗ.ИнтервалыРаботы.Количество() > 0 Тогда
			ПервыйПериодВСписке = СтрокаРЗ.ИнтервалыРаботы[0].Значение;
			Для Каждого ИнтервалСписка ИЗ СтрокаРЗ.ИнтервалыРаботы Цикл
				Если СтрокаРЗ.ИнтервалыРаботы.Индекс(ИнтервалСписка) = 0 Тогда
					Продолжить;
				КонецЕсли;    				
				
				// приоритет отдан этому механизму выявления пересечения периодов
				Если Макс(ПервыйПериодВСписке.НачалоРаботы, ИнтервалСписка.Значение.НачалоРаботы) < Мин(ПервыйПериодВСписке.ОкончаниеРаботы, ИнтервалСписка.Значение.ОкончаниеРаботы) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обнаружено пересечение времени: с " + Формат(Макс(ПервыйПериодВСписке.НачалоРаботы, ИнтервалСписка.Значение.НачалоРаботы), "ДФ=HH:mm") + " по " + Формат(Мин(ПервыйПериодВСписке.ОкончаниеРаботы, ИнтервалСписка.Значение.ОкончаниеРаботы), "ДФ=HH:mm"), ЭтотОбъект);
					ФлагПроверки = Ложь;	
					Прервать;
				КонецЕсли;   				
			КонецЦикла;	
		КонецЕсли;
		
		// проверка на дату увольнения и дату приема
		МассивДатыПриемаУвольнения = ТаблицаСотрудниковДатыПриемаУвольнения.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник));
		Если МассивДатыПриемаУвольнения.Количество() > 0 Тогда
			СтрокаМассиваДатыПриемаУвольнения = МассивДатыПриемаУвольнения[0];
			Если НЕ (ЗначениеЗаполнено(СтрокаМассиваДатыПриемаУвольнения.ДатаПриема) и СтрокаМассиваДатыПриемаУвольнения.ДатаПриема <= СтрокаРЗ.Дата или НЕ ЗначениеЗаполнено(СтрокаМассиваДатыПриемаУвольнения.ДатаПриема)) Тогда
				
				ФлагПроверки = Ложь;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка задания периодов работы: " + Строка(Формат(СтрокаРЗ.Дата,"ДЛФ=ДД.ММ.ГГ"))+" "+Строка(ОтборСтруктурнаяЕдиница)+" сотрудник " + Строка(Сотрудник) + " еще не принят на работу."
				+?(ЗначениеЗаполнено(СтрокаМассиваДатыПриемаУвольнения.ДатаПриема),"Дата приема на работу "+Строка(Формат(СтрокаМассиваДатыПриемаУвольнения.ДатаПриема,"ДЛФ=ДД.ММ.ГГ")),"")
				);
				
			КонецЕсли;   			
			
			Если  НЕ (ЗначениеЗаполнено(СтрокаМассиваДатыПриемаУвольнения.ДатаУвольнения) и СтрокаМассиваДатыПриемаУвольнения.ДатаУвольнения >= СтрокаРЗ.Дата  или НЕ ЗначениеЗаполнено(СтрокаМассиваДатыПриемаУвольнения.ДатаУвольнения))  Тогда 
				
				ФлагПроверки = Ложь;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка задания периодов работы: " + Строка(Формат(СтрокаРЗ.Дата,"ДЛФ=ДД.ММ.ГГ"))+" "+Строка(ОтборСтруктурнаяЕдиница)+" сотрудник " + Строка(Сотрудник) + " уже уволен."
				+?(ЗначениеЗаполнено(СтрокаМассиваДатыПриемаУвольнения.ДатаУвольнения),", дата увольнения "+Строка(Формат(СтрокаМассиваДатыПриемаУвольнения.ДатаУвольнения,"ДЛФ=ДД.ММ.ГГ")),"") );
				
			КонецЕсли;		
		КонецЕсли;
		
		// Проверка на наличие приемов
		ПриемыВходятВИнтервалыРабот = ПроверитьПриемыВходятВИнтервалыРабот(Сотрудник, СтрокаРЗ.Дата, ОтборСтруктурнаяЕдиница, СтрокаРЗ.ИнтервалыРаботы);   			
		Если Не ПриемыВходятВИнтервалыРабот Тогда 
			ФлагПроверки = Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У сотрудника " + Сотрудник + " " + Формат(СтрокаРЗ.Дата, "ДЛФ = ДДММГГ")+ " запланированы приемы, не входящие в выбранные смены.");			
		КонецЕсли;
		
		// Проверяем на работу структурой единицы в выбранный интервал
		ВремяРаботыСтруктурнойЕдиницыДень = ВернутьВремяРаботыСтруктурнойЕдиницыПоДате(СтрокаРЗ.Дата,ОтборСтруктурнаяЕдиница);
		
		Если ВремяРаботыСтруктурнойЕдиницыДень <> неопределено Тогда
			
			// Если интервал начало или конец выходит за рамки работы структурной единицы то 
			Для Каждого Интервал из СтрокаРЗ.ИнтервалыРаботы Цикл	
				
				// Корректируем интервал начало или конец если он выходит за рамки работы структурной 
				Если Интервал.Значение.НачалоРаботы    < ВремяРаботыСтруктурнойЕдиницыДень.НачалоРаботы Тогда
					Интервал.Значение.НачалоРаботы = ВремяРаботыСтруктурнойЕдиницыДень.НачалоРаботы;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Скорректировано время начала работы на "+ Формат(СтрокаРЗ.Дата, "ДЛФ = ДДММГГ") + " по времени работы клиники.");
				КонецЕсли;
				
				Если Интервал.Значение.ОкончаниеРаботы > ВремяРаботыСтруктурнойЕдиницыДень.ОкончаниеРаботы Тогда
					Интервал.Значение.ОкончаниеРаботы =  ВремяРаботыСтруктурнойЕдиницыДень.ОкончаниеРаботы ;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Скорректировано время окончания работы на "+ Формат(СтрокаРЗ.Дата, "ДЛФ = ДДММГГ") + " по времени работы клиники.");
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			ФлагПроверки = Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Клиника не работает "+ Формат(СтрокаРЗ.Дата, "ДЛФ = ДДММГГ"));
			
		КонецЕсли;

		
		Если СтрокаРЗ.Свойство("ТипРабочегоВремени")
			И СтрокаРЗ.ТипРабочегоВремени <> Перечисления.ТипыРабочегоВремени.Больничный 
			И СтрокаРЗ.ТипРабочегоВремени <> Перечисления.ТипыРабочегоВремени.Отпуск Тогда
			
			// Проверка на работу сотрудника в этот период в другом салоне
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ВремяРаботыСотрудниковПлан.ДатаВремяНачала КАК ВремяНачала,
			|	ВремяРаботыСотрудниковПлан.ДатаВремяОкончания КАК ВремяОкончания
			|ИЗ
			|	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
			|ГДЕ
			|	ВремяРаботыСотрудниковПлан.Сотрудник = &Сотрудник
			|	И ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница <> &СтруктурнаяЕдиница
			|	И НАЧАЛОПЕРИОДА(ВремяРаботыСотрудниковПлан.ДатаВремяНачала, ДЕНЬ) = &Дата";
			
			Запрос.УстановитьПараметр("Дата"				, СтрокаРЗ.Дата);
			Запрос.УстановитьПараметр("Сотрудник"			, Сотрудник);
			Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, ОтборСтруктурнаяЕдиница);
			
			Результат = Запрос.Выполнить().Выгрузить();
			
			Для Каждого СтрокаТЧ Из Результат Цикл
				Для Каждого СтрокаПериода из СтрокаРЗ.ИнтервалыРаботы Цикл
					СтрокаПериодаВремяНачала 	= СтрокаРЗ.Дата + (СтрокаПериода.Значение.НачалоРаботы - Дата(01, 01, 01));
					СтрокаПериодаВремяОкончания = СтрокаРЗ.Дата + (СтрокаПериода.Значение.ОкончаниеРаботы - Дата(01, 01, 01));
					Если (СтрокаПериодаВремяОкончания - СтрокаТЧ.ВремяНачала)*(СтрокаТЧ.ВремяОкончания - СтрокаПериодаВремяНачала) > 0 Тогда 
						ФлагПроверки = Ложь;
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сотрудник " + Сотрудник + " уже работает в этот период в другой клинике!");
						Прервать;           
					КонецЕсли;
				КонецЦикла;		
			КонецЦикла;     
			
		КонецЕсли;

		Если ФлагПроверки Тогда
			Если МассивИзмененныхДней.Найти(СтрокаРЗ.Дата) = Неопределено Тогда
				МассивИзмененныхДней.Добавить(СтрокаРЗ.Дата);
			КонецЕсли;
			
			Если ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Больничный Тогда
				 ИнтервалыРаботыПредст = "Б";
			ИначеЕсли ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Отпуск Тогда
                 ИнтервалыРаботыПредст = "О";
			Иначе
			     ИнтервалыРаботыПредст = Обработки.ГрафикРаботыСотрудников.ПолучитьПредставлениеСпискаИнтервалов(СтрокаРЗ.ИнтервалыРаботы);
			КонецЕсли;
			 
			// Ищем существующее рабочее время на указанную дату
			НайденныеСтроки = БуферФормирования.НайтиСтроки(Новый Структура("Дата, Сотрудник", СтрокаРЗ.Дата, СтрокаРЗ.Сотрудник));
			Для Каждого СтрокаБуфера ИЗ НайденныеСтроки Цикл
				// Если найден существующий интервал, помечаем его на удаление 
				// и скрываем для отображения
				Если НЕ ЗначениеЗаполнено(СтрокаБуфера.Операция) Тогда
					СтрокаБуфера.Операция              = "Удалить";
					СтрокаБуфера.НомерОчередиОперации  = НомерОперации;
					СтрокаБуфера.Скрыть                = Истина;
					// Если найден новый интервал, просто удаляем его, он будет заменен	
				ИначеЕсли СтрокаБуфера.Операция = "Создать" Тогда
					БуферФормирования.Удалить(СтрокаБуфера);
				КонецЕсли;
			КонецЦикла;
			
			НоваяСтрока                       = БуферФормирования.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРЗ);
			НоваяСтрока.ИнтервалыРаботыПредст = ИнтервалыРаботыПредст;
			НоваяСтрока.Должность             = НоваяСтрока.Сотрудник.Должность; 
			НоваяСтрока.ИдентификаторОбласти  = Новый УникальныйИдентификатор;
			НоваяСтрока.Операция              = "Создать";
			НоваяСтрока.НомерОчередиОперации  = НомерОперации;
		КонецЕсли;
		
	КонецЦикла;
	
	// Обновить визуализацию плана занятий
	ОбновитьОтображениеПланирования(Ложь, Сотрудник, МассивИзмененныхДней);

КонецПроцедуры

&НаКлиенте
// Вернет номер последней операции в очереди буфера
// 
Функция НомерПоследнейОперацииВОчередиБуфера()
	
	НомерОчередиОперации = 0;
	Для Каждого СтрокаТ ИЗ БуферФормирования Цикл
		Если СтрокаТ.НомерОчередиОперации > НомерОчередиОперации Тогда
			НомерОчередиОперации = СтрокаТ.НомерОчередиОперации;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат НомерОчередиОперации;
	
КонецФункции

&НаСервере
// Вернет номер последней операции в очереди буфера
// 
Функция НомерПоследнейОперацииВОчередиБуфераНаСервере()
	
	НомерОчередиОперации = 0;
	Для Каждого СтрокаТ ИЗ БуферФормирования Цикл
		Если СтрокаТ.НомерОчередиОперации > НомерОчередиОперации Тогда
			НомерОчередиОперации = СтрокаТ.НомерОчередиОперации;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат НомерОчередиОперации;
	
КонецФункции

&НаКлиенте
// Процедура - Обновить декорацию упраления сохранением шаблонов
// 
Процедура ОбновитьДекорациюУпраленияСохранениемШаблонов()
	
	Если СписокШаблоновСодержитСтруктуруИнтервалов().Успех Тогда 
		Элементы.ДекорацияУправленияСохранениемШаблонов.Картинка = БиблиотекаКартинок.РейтингЗвездаЗаполненная;
		Элементы.ДекорацияУправленияСохранениемШаблонов.Подсказка = "Удалить из списка шаблонов";
	Иначе 
		Элементы.ДекорацияУправленияСохранениемШаблонов.Картинка = БиблиотекаКартинок.РейтингЗвездаПустая;
		Элементы.ДекорацияУправленияСохранениемШаблонов.Подсказка = "Сохранить как шаблон в список";		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ФиксацияИзмененийВПлане

&НаКлиенте
// Функция вернет признак необходимости фиксации изменений в плане
// 
Функция ПроверитьНеобходимостьФиксацииИзмененийВПлане()
	
	СоздатьЗанятия  = БуферФормирования.НайтиСтроки(Новый Структура("Операция","Создать"));
	УдалитьЗанятия  = БуферФормирования.НайтиСтроки(Новый Структура("Операция","Удалить"));
	
	Возврат СоздатьЗанятия.Количество() > 0 ИЛИ УдалитьЗанятия.Количество() > 0;
	
КонецФункции

&НаСервере
// Зафиксировать изменения
// 
Процедура ЗафиксироватьИзмененияВПланеЗанятий()
	
	РегистрыСведений.ВремяРаботыСотрудниковПлан.ЗафиксироватьИзмененияВГрафикеСотрудников(ЭтотОбъект.ОтборСтруктурнаяЕдиница, ЭтотОбъект.БуферФормирования);
	ОбновитьОтображениеПланирования(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

// Процедура, формирует текст периода.
// 
Процедура СформироватьТекстПериода()
	
	КомандаВыбораПериода = Команды.Найти("ВыбратьПериодПланирования");
	
	Если ОтборПериод.ДатаНачала = Дата(1,1,1) ИЛИ ОтборПериод.ДатаОкончания = Дата(1,1,1) Тогда 
		Элементы.ВыбратьПериодПланирования.Заголовок = "< не указан >";
		Если НЕ КомандаВыбораПериода = Неопределено Тогда 
			КомандаВыбораПериода.Подсказка = "Щелкните для выбора периода планирования";
		КонецЕсли;	
	Иначе
		Элементы.ВыбратьПериодПланирования.Заголовок = Формат(ОтборПериод.ДатаНачала, "ДФ=dd.MM.yy") + " - " + Формат(ОтборПериод.ДатаОкончания, "ДФ=dd.MM.yy");
		Если НЕ КомандаВыбораПериода = Неопределено Тогда 
			КомандаВыбораПериода.Подсказка = Элементы.ВыбратьПериодПланирования.Заголовок;
		КонецЕсли;			
	КонецЕсли;	
	
КонецПроцедуры

// Процедура, обновляет таблицу значений ГрафикПериодовРаботыТабДок согласно БуфераФормирования.
//  
Процедура ОбновитьСогласноБуфераФормирования(ПерезаполнитьБуфер, Сотрудник = Неопределено, МассивИзменныхДней = Неопределено)
	
	// очищаем строки таблицы
	Если ПерезаполнитьБуфер Тогда
		
		// табличный документ
		// ШАПКА
		ГрафикПериодовРаботыТабДок.Очистить();
		Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ГрафикПериодовРаботы");
		ОбластьШапкаТаблицы_Заголовок	= Макет.ПолучитьОбласть("ШапкаТаблицы|Заголовок");
		ОбластьШапкаТаблицы_Период		= Макет.ПолучитьОбласть("ШапкаТаблицы|Период");
		ОбластьСтрока_Заголовок			= Макет.ПолучитьОбласть("Строка|Заголовок");
		ОбластьСтрока_Период			= Макет.ПолучитьОбласть("Строка|Период");
		
		ГрафикПериодовРаботыТабДок.Вывести(ОбластьШапкаТаблицы_Заголовок);
		ДатаПром = НачалоДня (ОтборПериод.ДатаНачала);
		Пока ДатаПром <= НачалоДня(ОтборПериод.ДатаОкончания) Цикл
			ОбластьШапкаТаблицы_Период.параметры.Период = Формат(ДатаПром,"ДФ=dd.MM.yy")+символы.ПС+ОбщегоНазначенияКлиентСерверСтоматология.ОпределитьДеньНедели(ДеньНедели(ДатаПром));	
			ГрафикПериодовРаботыТабДок.Присоединить(ОбластьШапкаТаблицы_Период);
			
			Если ДеньНедели(ДатаПром) = 6 Или ДеньНедели(ДатаПром) = 7 Тогда
				ГрафикПериодовРаботыТабДок.Область("R1C"+СтрЗаменить(4+1+(НачалоДня(ДатаПром)-НачалоДня(ОтборПериод.ДатаНачала))/(24*60*60), Символы.НПП, "")).ЦветФона = Новый Цвет(255, 192, 203);
			Иначе
				//ГрафикПериодовРаботыТабДок.Область("R1C"+СтрЗаменить(4+1+(НачалоДня(ДатаПром)-НачалоДня(ОтборПериод.ДатаНачала))/(24*60*60), Символы.НПП, "")).ЦветФона = Новый Цвет(242, 242, 242);
			КонецЕсли;
			
			ДатаПром = ДатаПром + 24*60*60;
		КонецЦикла;
		
		ГрафикПериодовРаботыТабДок.ФиксацияСлева	= 4;
		ГрафикПериодовРаботыТабДок.ФиксацияСверху	= 1;
		
		// Сначала получаем список сотруников согласно справочника сотрудники.
		// Т.к. в буфере хранятся только уже заданные в регистре сведений 	
		Запрос = новый ЗАпрос;
		ЗАпрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА Сотрудники.Должность = ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
		|			ТОГДА ""Без должности""
		|		ИНАЧЕ Сотрудники.Должность
		|	КОНЕЦ КАК Должность,
		|	НастройкиСотрудников.ДатаПриема КАК ДатаПриема,
		|	НастройкиСотрудников.ДатаУвольнения КАК ДатаУвольнения
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
		|		ПО Сотрудники.Ссылка = НастройкиСотрудников.Сотрудник
		|ГДЕ
		|	НЕ Сотрудники.ЭтоГруппа
		|	И НЕ Сотрудники.ПометкаУдаления
		|	И НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И ВЫБОР
		|			КОГДА &ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 31, 23, 59, 59)
		|					И НастройкиСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА НастройкиСотрудников.ДатаПриема <= &ДатаОкончания
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
		|					И НастройкиСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА НастройкиСотрудников.ДатаУвольнения >= &ДатаНачала
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Должность";  
		
				
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, ОтборСтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("ДатаНачала"			, ОтборПериод.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания"		, ОтборПериод.ДатаОкончания); 		
		
		ТаблицаСотрудников = Запрос.Выполнить().Выгрузить(); 
		
		// сохраняем в элементах формы для дальнейшенго контроля
		ТаблицаСотрудниковДатыПриемаУвольнения.Очистить(); 		
		
		КолВыведенныхСтрок = 2; // начинаем с 2 , т.к. первая строка это заголовок		
		Для Каждого СтрокаПериодРаботы Из ТаблицаСотрудников Цикл
						
			НоваяСтрокаТаблицыСотрудниковДатыПриемаУвольнения = ТаблицаСотрудниковДатыПриемаУвольнения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицыСотрудниковДатыПриемаУвольнения, СтрокаПериодРаботы);
			
			ОбластьСтрока_Заголовок.Параметры.Заполнить(СтрокаПериодРаботы);
			ОбластьСтрока_Заголовок.Параметры.ИД_Сотрудника = СтрокаПериодРаботы.Сотрудник.УникальныйИдентификатор();
			
			ГрафикПериодовРаботыТабДок.Вывести(ОбластьСтрока_Заголовок);	
			
			ДатаПром = НачалоДня(ОтборПериод.ДатаНачала);
			Пока ДатаПром <= НачалоДня(ОтборПериод.ДатаОкончания) Цикл
				ОбластьСтрока_Период.параметры.Период = "";	
				ГрафикПериодовРаботыТабДок.Присоединить(ОбластьСтрока_Период);
				
				НомерКолонкиОбластиТабДок = (НачалоДня(ДатаПром) - НачалоДня(ОтборПериод.ДатаНачала))/(24*60*60);
				
				Если ДеньНедели(ДатаПром) = 6 Или ДеньНедели(ДатаПром) = 7 Тогда 
					ИмяОбластиТабДок = СтрЗаменить("R" + КолВыведенныхСтрок + "C" + (5 + НомерКолонкиОбластиТабДок) + ":" + "R" + (КолВыведенныхСтрок + 1) + "C" + (5 + НомерКолонкиОбластиТабДок), Символы.НПП, ""); 
					ГрафикПериодовРаботыТабДок.Область(ИмяОбластиТабДок).ЦветФона = Новый Цвет(255, 192, 203);
				Иначе
					ИмяОбластиТабДок = СтрЗаменить("R" + КолВыведенныхСтрок + "C" + (5 + НомерКолонкиОбластиТабДок) + ":" + "R" + (КолВыведенныхСтрок + 1) + "C" + (5 + НомерКолонкиОбластиТабДок), Символы.НПП, "");
					ГрафикПериодовРаботыТабДок.Область(ИмяОбластиТабДок).ЦветФона = Новый Цвет;
				КонецЕсли;   
				
				Если (ЗначениеЗаполнено(СтрокаПериодРаботы.ДатаУвольнения) и ДатаПром > СтрокаПериодРаботы.ДатаУвольнения)
					или (ЗначениеЗаполнено(СтрокаПериодРаботы.ДатаПриема) и ДатаПром < СтрокаПериодРаботы.ДатаПриема) Тогда // сотрудник уволен или еще не принят
					ИмяОбластиТабДок = СтрЗаменить("R" + КолВыведенныхСтрок + "C" + (5 + НомерКолонкиОбластиТабДок) + ":" + "R" + (КолВыведенныхСтрок + 1) + "C" + (5 + НомерКолонкиОбластиТабДок), Символы.НПП, "");
					ГрафикПериодовРаботыТабДок.Область(ИмяОбластиТабДок).ЦветФона = Новый Цвет(242,242,242);
				КонецЕсли;    						
				
				ДатаПром = ДатаПром + 24*60*60;
			КонецЦикла; 
			
			КолВыведенныхСтрок = КолВыведенныхСтрок + 2; // высота области 2 строки
		КонецЦикла;
		
	КонецЕсли;   
	
	// массив сотрудников
	МассивСотрудников = Новый Массив;
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		МассивСотрудников.Добавить(Сотрудник);
	Иначе
		ВременнаяТаблица = БуферФормирования.Выгрузить(,"Сотрудник");
		ВременнаяТаблица.Свернуть("Сотрудник");
		МассивСотрудников = ВременнаяТаблица.ВыгрузитьКолонку("Сотрудник");	
	КонецЕсли;
	
	ФлагСотрудникЕстьБуфере = Ложь;
	Для Каждого СотрудникМ Из МассивСотрудников Цикл
		
		Если ЗначениеЗаполнено(Сотрудник) и СотрудникМ <> Сотрудник Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСтрокПериодыРаботы	= ТаблицаСотрудниковДатыПриемаУвольнения.НайтиСтроки(Новый Структура("Сотрудник", СотрудникМ));
		СтрокаПериодРаботы			= ?(МассивСтрокПериодыРаботы.Количество() > 0, МассивСтрокПериодыРаботы[0], Неопределено);
		
		ФлагСотрудникЕстьБуфере		= Истина;
		
		НомерСтрокиТабДок			= ПолучитьНомерСтрокиТабДок(СотрудникМ);
		
		// периоды
		МассивПериодовСотрудника = БуферФормирования.НайтиСтроки(Новый Структура("Сотрудник", СотрудникМ));
		
		Если Не ЗначениеЗаполнено(МассивИзменныхДней) Или (Тип(МассивИзменныхДней) = Тип("Массив") и МассивИзменныхДней.Количество() = 0) Тогда
			ДатаПром = НачалоДня(ОтборПериод.ДатаНачала);
			Пока ДатаПром <= КонецДня(ОтборПериод.ДатаОкончания) Цикл
				
				ИмяОбластиТабДок = ПолучитьИмяОбластиТабДокПоНомеруСтроки(НомерСтрокиТабДок, ДатаПром); // ПолучитьИмяОбластиТабДок(СтрокаБуфера.Сотрудник, ДатаПром);
				Если НЕ ПустаяСтрока(ИмяОбластиТабДок) Тогда
					ГрафикПериодовРаботыТабДок.Область(ИмяОбластиТабДок).Текст = "";
					
					МассивБуфера = БуферФормирования.НайтиСтроки(Новый Структура("Сотрудник, Дата",СотрудникМ, НачалоДня(ДатаПром))); // БуферФормирования
					Если МассивБуфера.Количество() > 0 Тогда
						СтрокаПериодов = "";
						Для Каждого СтрокаМассивБуфера Из МассивБуфера Цикл
							Если СтрокаМассивБуфера.Операция = "" Или СтрокаМассивБуфера.Операция = "Создать" Тогда
								
								Если СтрокаМассивБуфера.ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Больничный 
									Или СтрокаМассивБуфера.ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Отпуск Тогда 
									СтрокаПериодов = СтрокаМассивБуфера.ИнтервалыРаботыПредст;
								Иначе
									
									Для Каждого Период Из СтрокаМассивБуфера.ИнтервалыРаботы Цикл
										СтрокаПериодов = СтрокаПериодов 
										+ ?(ПустаяСтрока(СтрокаПериодов),"",Символы.ПС)
										+ Строка(Формат(Период.Значение.НачалоРаботы, "ДФ='ЧЧ:мм'") + " - " + Формат(Период.Значение.ОкончаниеРаботы, "ДФ='ЧЧ:мм'"))+?(СтрокаМассивБуфера.Операция="","","*");
									КонецЦикла;
									
								КонецЕсли;
								
							КонецЕсли;
							
							ГрафикПериодовРаботыТабДок.Область(ИмяОбластиТабДок).Текст   =  СтрокаПериодов;
							Если ((СтрокаМассивБуфера.ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Больничный
								Или СтрокаМассивБуфера.ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Отпуск)
								И СтрокаМассивБуфера.Операция <> "Удалить") Тогда
								
								ГрафикПериодовРаботыТабДок.Область(ИмяОбластиТабДок).ЦветФона = Новый Цвет(164, 209, 251);
								
							ИначеЕсли ДеньНедели(ДатаПром) = 6 Или ДеньНедели(ДатаПром) = 7 Тогда 
								ГрафикПериодовРаботыТабДок.Область(ИмяОбластиТабДок).ЦветФона = Новый Цвет(255, 192, 203);
								
							ИначеЕсли СтрокаПериодРаботы <> Неопределено 
								И ((ЗначениеЗаполнено(СтрокаПериодРаботы.ДатаУвольнения) и ДатаПром > СтрокаПериодРаботы.ДатаУвольнения)
								или (ЗначениеЗаполнено(СтрокаПериодРаботы.ДатаПриема) и ДатаПром < СтрокаПериодРаботы.ДатаПриема)) Тогда // сотрудник уволен или еще не принят
								
								ГрафикПериодовРаботыТабДок.Область(ИмяОбластиТабДок).ЦветФона = Новый Цвет(242,242,242);
							Иначе
								ГрафикПериодовРаботыТабДок.Область(ИмяОбластиТабДок).ЦветФона = Новый Цвет;
							КонецЕсли;
							
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
				Датапром = ДатаПром + 24*60*60;		
				
			КонецЦикла;
		ИначеЕсли Тип(МассивИзменныхДней)=Тип("Массив") Тогда
			
			// отрисовываем только переданные дни
			Для каждого ДеньИзменений из МассивИзменныхДней Цикл
				
				ИмяОбластиТабДок = ПолучитьИмяОбластиТабДок(СотрудникМ, ДеньИзменений); // СтрокаБуфера.Сотрудник
				Если НЕ ПустаяСтрока(ИмяОбластиТабДок) Тогда
					ГрафикПериодовРаботыТабДок.Область(ИмяОбластиТабДок).Текст = "";
					
					МассивБуфера = БуферФормирования.НайтиСтроки(Новый Структура ("Сотрудник, Дата", СотрудникМ, НачалоДня(ДеньИзменений))); // СтрокаБуфера.Сотрудник
					Если МассивБуфера.количество()>0 Тогда
						СтрокаПериодов = "";
						Для каждого СтрокаМассивБуфера из МассивБуфера Цикл
							Если СтрокаМассивБуфера.Операция = "" или СтрокаМассивБуфера.Операция = "Создать" Тогда
								
								Если СтрокаМассивБуфера.ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Больничный 
									Или СтрокаМассивБуфера.ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Отпуск Тогда
									СтрокаПериодов = СтрокаМассивБуфера.ИнтервалыРаботыПредст;
								Иначе
									
									Для каждого Период из СтрокаМассивБуфера.ИнтервалыРаботы Цикл
										СтрокаПериодов = СтрокаПериодов
										+ ?(ПустаяСтрока(СтрокаПериодов),"",Символы.ПС)
										+ Строка(Формат(Период.Значение.НачалоРаботы, "ДФ='ЧЧ:мм'") + " - " + Формат(Период.Значение.ОкончаниеРаботы, "ДФ='ЧЧ:мм'"))+?(СтрокаМассивБуфера.Операция="","","*");
									КонецЦикла;
								КонецЕсли;
								
							КонецЕсли;
							
							ГрафикПериодовРаботыТабДок.Область(ИмяОбластиТабДок).Текст = СтрокаПериодов;
							Если ((СтрокаМассивБуфера.ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Больничный
								Или СтрокаМассивБуфера.ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Отпуск)
								И СтрокаМассивБуфера.Операция <> "Удалить") Тогда
								
								ГрафикПериодовРаботыТабДок.Область(ИмяОбластиТабДок).ЦветФона = Новый Цвет(164, 209, 251);
							ИначеЕсли ДеньНедели(ДеньИзменений) = 6 Или ДеньНедели(ДеньИзменений) = 7 Тогда 
								ГрафикПериодовРаботыТабДок.Область(ИмяОбластиТабДок).ЦветФона = Новый Цвет(255, 192, 203);
							Иначе
								ГрафикПериодовРаботыТабДок.Область(ИмяОбластиТабДок).ЦветФона = Новый Цвет;
							КонецЕсли;
							
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Прервать; // прерывам чтобы выйти из цикла перебора буфера
		КонецЕсли;
		
	КонецЦикла;     
	
	// в случае отсутствия сотрудников в буфере
	Если НЕ ФлагСотрудникЕстьБуфере и ГрафикПериодовРаботыТабДок.ВысотаТаблицы > 1 Тогда
		
		НомерСтрокиТабДок = 2;// 1 строка это заголовок  таблицы		
		Пока НомерСтрокиТабДок <= ГрафикПериодовРаботыТабДок.ВысотаТаблицы Цикл
			Сотрудник = НайтиСотрудникаПоИД(ГрафикПериодовРаботыТабДок.Область("R"+СтрЗаменить(НомерСтрокиТабДок,символы.НПП,"")+"C2").Текст);
			// периоды
			Если Не ЗначениеЗаполнено(МассивИзменныхДней) или (Тип(МассивИзменныхДней)=Тип("Массив") и МассивИзменныхДней.Количество() = 0) Тогда
				
				ДатаПром = НачалоДня(ОтборПериод.ДатаНачала);
				Пока ДатаПром <= КонецДня(ОтборПериод.ДатаОкончания) Цикл
					НайденныеСтроки = БуферФормирования.НайтиСтроки(Новый Структура("Сотрудник, Дата", Сотрудник, ДатаПром));   
					Если НайденныеСтроки = Неопределено Тогда
						НомерКолонкиТабДок	= ПолучитьИмяКолонкиТабДок(ДатаПром);
						ИмяОбластиТабДок	= СтрЗаменить("R"+Строка(НомерСтрокиТабДок)+"C"+Строка(НомерКолонкиТабДок)+":"+"R"+Строка(НомерСтрокиТабДок+1)+"C"+Строка(НомерКолонкиТабДок),Символы.НПП,""); 
						ГрафикПериодовРаботыТабДок.Область(ИмяОбластиТабДок).Текст = "";
					КонецЕсли;
					
					Датапром = ДатаПром + 24*60*60;		
					
				КонецЦикла;
			ИначеЕсли Тип(МассивИзменныхДней) = Тип("Массив") Тогда
				
				// отрисовываем только переданные дни
				Для Каждого ДеньИзменений из МассивИзменныхДней Цикл
					
					НайденныеСтроки = БуферФормирования.НайтиСтроки(Новый Структура("Сотрудник, Дата", Сотрудник, ДеньИзменений));   
					Если НайденныеСтроки = Неопределено Тогда
						НомерКолонкиТабДок	= ПолучитьИмяКолонкиТабДок(ДеньИзменений);
						ИмяОбластиТабДок	= СтрЗаменить("R"+Строка(НомерСтрокиТабДок)+"C"+Строка(НомерКолонкиТабДок)+":"+"R"+Строка(НомерСтрокиТабДок)+"C"+Строка(НомерКолонкиТабДок),Символы.НПП,""); 
						
						ГрафикПериодовРаботыТабДок.Область(ИмяОбластиТабДок).Текст = "";
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			НомерСтрокиТабДок = НомерСтрокиТабДок + 2;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры   

// Процедура, заполняет буфер существующими записями.
// 
Процедура ЗаполнитьБуферСуществующимиДанными()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремяРаботыСотрудниковПлан.ДатаВремяНачала КАК ДатаВремяНачала,
	|	ВремяРаботыСотрудниковПлан.ДатаВремяОкончания КАК ДатаВремяОкончания,
	|	ВремяРаботыСотрудниковПлан.Сотрудник КАК Сотрудник,
	|	ВремяРаботыСотрудниковПлан.Сотрудник.Должность КАК Должность,
	|	ВремяРаботыСотрудниковПлан.Минуты КАК СуммаРабочегоВремени,
	|	ВремяРаботыСотрудниковПлан.ДатаВремяНачала КАК Дата,
	|	ВремяРаботыСотрудниковПлан.ТипРабочегоВремени КАК ТипРабочегоВремени
	|ИЗ
	|	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|		ПО ВремяРаботыСотрудниковПлан.Сотрудник.Ссылка = НастройкиСотрудников.Сотрудник.Ссылка
	|ГДЕ
	|	ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ВремяРаботыСотрудниковПлан.ДатаВремяНачала >= &НачалоПериода
	|	И ВремяРаботыСотрудниковПлан.ДатаВремяНачала <= &ОкончаниеПериода
	|	И НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВремяРаботыСотрудниковПлан.МесяцОтбор,
	|	Сотрудник,
	|	Должность,
	|	ДатаВремяНачала"
	);
	
	Запрос.УстановитьПараметр("НачалоПериода"      , НачалоДня(ОтборПериод.ДатаНачала));
	Запрос.УстановитьПараметр("ОкончаниеПериода"   , КонецДня(ОтборПериод.ДатаОкончания));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница" , ОтборСтруктурнаяЕдиница);
	
	//СписокРолейПользователя = Новый СписокЗначений;
	//СписокРолейПользователя.Добавить(Перечисления.РольПользователя.АдминистраторБазыДанных);
	//СписокРолейПользователя.Добавить(Перечисления.РольПользователя.ПустаяСсылка());
	
	//Запрос.УстановитьПараметр("СписокРолейПользователя" , СписокРолейПользователя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	БуферФормирования.Очистить();
	ТекДень            = Неопределено;
	ПредДень           = Неопределено;
	ТекСтрокаБуфера    = Неопределено;
	ПредСтрокаБуфера   = Неопределено;
	ПредставлениеИнтервала = "";
	
	Пока Выборка.Следующий() Цикл
		// Получаем дату тек. дня
		Если ЗначениеЗаполнено(Выборка.ДатаВремяНачала) Тогда
			ТекДень = День(Выборка.ДатаВремяНачала);
			// Если тек дата не совпадает или указанные параметры
			// создаем новую строку буфера, иначе считаем что это след. интервал в тот же день
			Если ТекДень <> ПредДень
				ИЛИ ТекСтрокаБуфера = Неопределено 
				ИЛИ ТекСтрокаБуфера.Сотрудник <> Выборка.Сотрудник
				ИЛИ ТекСтрокаБуфера.Должность <> Выборка.Должность Тогда
				
				ТекСтрокаБуфера = БуферФормирования.Добавить();
				ЗаполнитьЗначенияСвойств(ТекСтрокаБуфера, Выборка);
				ТекСтрокаБуфера.ИдентификаторОбласти  = Новый УникальныйИдентификатор;
				// ТекСтрокаБуфера.Дата                  = Выборка.ДатаВремяНачала;
				// ТекСтрокаБуфера.СуммаРабочегоВремени  = Выборка.КолМинут;
			Иначе
				ТекСтрокаБуфера.СуммаРабочегоВремени = ТекСтрокаБуфера.СуммаРабочегоВремени + Выборка.СуммаРабочегоВремени;
			КонецЕсли;
			
			// Переменная оптимизации. Кеширует массив данных на время серверного вызова
			МассивНадстрочныхСимволов = Неопределено;
			ПериодРаботы              = Новый Структура("НачалоРаботы, ОкончаниеРаботы, ВсегоМинут", Выборка.ДатаВремяНачала
			, Выборка.ДатаВремяОкончания
			, Выборка.СуммаРабочегоВремени);	
			
			НачалоПредст              = Формат(ПериодРаботы.НачалоРаботы	, "ДФ=HH:mm"); // Обработки.ПланированиеГрафикаРаботыСотрудников.ПредставлениеВремениСНадстрочнымиСимволами(ПериодРаботы.НачалоРаботы, МассивНадстрочныхСимволов);
			КонецПредст               = Формат(ПериодРаботы.ОкончаниеРаботы	, "ДФ=HH:mm"); // Обработки.ПланированиеГрафикаРаботыСотрудников.ПредставлениеВремениСНадстрочнымиСимволами(ПериодРаботы.ОкончаниеРаботы, МассивНадстрочныхСимволов);
			
			Если Выборка.ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Больничный Тогда
				ТекСтрокаБуфера.ИнтервалыРаботыПредст = "Б";
			ИначеЕсли Выборка.ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Отпуск Тогда
				ТекСтрокаБуфера.ИнтервалыРаботыПредст = "О";
			Иначе	
				ВремяИнтервала 			= ?(Выборка.СуммаРабочегоВремени > 60, Строка(ОбщегоНазначенияКлиентСерверСтоматология.КонвертироватьМинутыВЧасы(Выборка.СуммаРабочегоВремени)), Строка(Выборка.СуммаРабочегоВремени) + " мин.");
				
				ПредставлениеИнтервала = НачалоПредст + " - " + КонецПредст + " (" + ВремяИнтервала + ")";
				ТекСтрокаБуфера.ИнтервалыРаботы.Добавить(ПериодРаботы, ПредставлениеИнтервала);
				// ТекСтрокаБуфера.ИнтервалыРаботыПредст = Обработки.ПланированиеГрафикаРаботыСотрудников.ПолучитьПредставлениеСпискаИнтервалов(ТекСтрокаБуфера.ИнтервалыРаботы);
			КонецЕсли;
			ПредДень         = ТекДень;
			ПредСтрокаБуфера = ТекСтрокаБуфера;	
			ТекСтрокаБуфера.ТипРабочегоВремени = Выборка.ТипРабочегоВремени;
			
		КонецЕсли;
	КонецЦикла;	 
	
КонецПроцедуры

// Функция, возвращает номер строки табличного документа.
// 
Функция ПолучитьНомерСтрокиТабДок(Сотрудник)  
	
	Область		= ГрафикПериодовРаботыТабДок.НайтиТекст(Сотрудник.УникальныйИдентификатор(),, ГрафикПериодовРаботыТабДок.Область("C2"));
	Если Область <> Неопределено Тогда
		ИмяОбласти	= Область.Имя; 
		Позиция_Двоеточие = СтрНайти(ИмяОбласти,"C");
		
		НомерСтроки = Число(Сред(ИмяОбласти,2,Позиция_Двоеточие-2));
	Иначе
		НомерСтроки = Неопределено;
	КонецЕсли;
	 		
	Возврат НомерСтроки;
	
КонецФункции

// Функция, возвращает имя области по номеру строки и дате табличного документа.
// 
Функция ПолучитьИмяОбластиТабДокПоНомеруСтроки(НомерСтроки, ДатаПром)  
			  	
	НомерКолонки = 5 + (ДатаПром - НачалоДня(ОтборПериод.ДатаНачала)) / 86400; 
	
	Если НомерСтроки <> Неопределено Тогда
		Имя = "R" + СтрЗаменить(НомерСтроки,символы.НПП,"") + "C" + СтрЗаменить(НомерКолонки,символы.НПП,"") + ":"
		    + "R" + СтрЗаменить(НомерСтроки+1,символы.НПП,"") + "C" + СтрЗаменить(НомерКолонки,символы.НПП,""); 
	Иначе
		Имя = "";
	КонецЕсли;
	
	Возврат Имя;
	
КонецФункции

// Функция, возвращает имя области табличного документа.
// 
Функция ПолучитьИмяОбластиТабДок(Сотрудник, ДатаПром)  
	
	Область	= ГрафикПериодовРаботыТабДок.НайтиТекст(Сотрудник.УникальныйИдентификатор(),, ГрафикПериодовРаботыТабДок.Область("C2"));
	Если Область <> Неопределено Тогда
		ИмяОбласти	= Область.Имя; 
		Позиция_Двоеточие = СтрНайти(ИмяОбласти,"C");
		
		НомерСтроки = Число(Сред(ИмяОбласти,2,Позиция_Двоеточие-2));
	Иначе
		НомерСтроки = Неопределено;
	КонецЕсли;
	  	
	Область = ГрафикПериодовРаботыТабДок.НайтиТекст(Формат(ДатаПром,"ДФ=dd.MM.yy"),, ГрафикПериодовРаботыТабДок.Область("R1"));
	Если Область <> Неопределено Тогда
		ИмяОбласти = Область.Имя;
		Позиция_Двоеточие = СтрНайти(ИмяОбласти,"C");
		
		НомерКолонки = Сред(ИмяОбласти, Позиция_Двоеточие+1);
	Иначе
		НомерКолонки = Неопределено;
	КонецЕсли;
		
	Если НомерКолонки <> Неопределено и НомерСтроки <> Неопределено Тогда
		Имя = "R" + СтрЗаменить(НомерСтроки,символы.НПП,"") + "C" + СтрЗаменить(НомерКолонки,символы.НПП,"") + ":"
		    + "R" + СтрЗаменить(НомерСтроки+1,символы.НПП,"") + "C" + СтрЗаменить(НомерКолонки,символы.НПП,""); 
	Иначе
		Имя = "";
	КонецЕсли;
	
	Возврат Имя;
	
КонецФункции

// Функция, возвращает имя колонки табличного документа.
// 
Функция ПолучитьИмяКолонкиТабДок(ДатаПром)
			
	Область = ГрафикПериодовРаботыТабДок.НайтиТекст(Формат(ДатаПром,"ДФ=dd.MM.yy"),, ГрафикПериодовРаботыТабДок.Область("R1"));
	Если Область <> Неопределено Тогда
		ИмяОбласти = Область.Имя;
		Позиция = СтрНайти(ИмяОбласти,"C");
		
		НомерКолонки = Сред(ИмяОбласти,Позиция+1);
	Иначе
		НомерКолонки = Неопределено;
	КонецЕсли;	
	
	Возврат НомерКолонки;
	
КонецФункции

&НаСервере
// Обновить массив рабочих дней в неделе для текущей СЕ
// 
Процедура ОбновитьМассивРабочихДнейВНеделе()
	
	// Получаем массив номеров рабочих дней недели для СЕ	
	ВременныйМассив = Новый Массив;
	ПериодыРаботыСтруктурнойЕдиницы = ОбщегоНазначенияСтоматология.ВернутьПериодыРаботы(
															?(ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница), ОтборСтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница),
															ОтборПериод.ДатаНачала,
															Новый Структура("КолДней" , 7));	
							
	Если ПериодыРаботыСтруктурнойЕдиницы <> Неопределено Тогда
		ПериодыРаботыСтруктурнойЕдиницы.Сортировать("ДеньНедели");		
		Для Каждого СтрокаТ ИЗ ПериодыРаботыСтруктурнойЕдиницы Цикл
			ВременныйМассив.Добавить(ДеньНедели(СтрокаТ.ДеньНедели));
		КонецЦикла;
	КонецЕсли;		
	МасивРабочихДнейНедели = Новый ФиксированныйМассив(ВременныйМассив);
	
КонецПроцедуры

// Получить представлениеинтервалов времени
// 
Функция ПредставлениеИнтервалаВремени(СписокИнтервала)
	
	Возврат Обработки.ГрафикРаботыСотрудников.ПолучитьПредставлениеСпискаИнтервалов(СписокИнтервала);	
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить массив периодов работы.
// 
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьСписокПериодовРаботы(СтруктурнаяЕдиница)
	
	ИнтервалыВремени = Справочники.ПериодыРаботы.ПолучитьМассивПериодовРаботы(СтруктурнаяЕдиница); 
	СписокПериодов   = Новый СписокЗначений;
	
	Для Каждого Интервал Из ИнтервалыВремени Цикл
		
		ЗначениеПериода      = Новый Структура("НачалоРаботы, ОкончаниеРаботы", Интервал.НачалоСмены, Интервал.ОкончаниеСмены);
		ПредставлениеПериода = ОбщегоНазначенияКлиентСерверСтоматология.ПолучитьПредставлениеИнтервала(ЗначениеПериода);
		
		СписокВложение = Новый СписокЗначений;
		СписокВложение.Добавить(ЗначениеПериода, ПредставлениеПериода);
		//Структура = Новый Структура("Значение, Представление",ЗначениеПериода, ПредставлениеПериода);
		СписокПериодов.Добавить(СписокВложение, ПредставлениеПериода);	
		
	КонецЦикла;	
	СписокПериодов.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
	
	Если ИнтервалыВремени.Количество() = 0 Тогда
		 СписокПериодов.Добавить("Смены: ");
	КонецЕсли;
		
	СписокПериодов.Добавить("Отпуск");
	СписокПериодов.Добавить("Больничный");
	
	Возврат СписокПериодов;
	
КонецФункции

//&НаКлиенте
//// Вернуть сумму интервалов времени в минутах
//// 
//Функция СуммаИнтерваловВМинутах(СписокИнтервала)
//	
//	СуммМинут                 = 0;
//	Для Каждого ЭлементС ИЗ СписокИнтервала Цикл
//		СуммМинут = СуммМинут + Цел((ЭлементС.Значение.ОкончаниеРаботы - ЭлементС.Значение.НачалоРаботы) / 60);	
//	КонецЦикла;
//	
//	Возврат СуммМинут;
//	
//КонецФункции

&НаСервере
// Вернуть сумму интервалов времени в минутах
// 
Функция СуммаИнтерваловВМинутахНаСервере(СписокИнтервала)
	
	СуммМинут = 0;
	Для Каждого ЭлементС ИЗ СписокИнтервала Цикл
		СуммМинут = СуммМинут + Цел((ЭлементС.Значение.ОкончаниеРаботы - ЭлементС.Значение.НачалоРаботы) / 60);	
	КонецЦикла;
	
	Возврат СуммМинут;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Вернуть время работы структурной единицы
// 
// Возвращаемое значение:
//   - 
// 
Функция ВернутьВремяРаботыСтруктурнойЕдиницы(знач СтруктурнаяЕдиница = Неопределено)
	
	// МассивРабочихДнейСЕ = Справочники.СтруктурныеЕдиницы.РабочиеДниСтруктурнойЕдиницы(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	// 
	// Для Каждого ЭлементМ Из МассивРабочихДнейСЕ Цикл
	// 	
	// 	Если ЭлементМ.ДатаОкончания = Дата(0001,01,01,00,00,00) ИЛИ ЭлементМ.ДатаОкончания = Дата(0001,01,02,00,00,00) Тогда
	// 		ЭлементМ.ДатаОкончания = Дата(0001,01,01,23,59,59);
	// 	КонецЕсли;
	// 	
	// КонецЦикла;	
	// 
	// Возврат Новый ФиксированныйМассив(МассивРабочихДнейСЕ);
	
	Если СтруктурнаяЕдиница = Неопределено Тогда
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(Справочники.СтруктурныеЕдиницы.РабочиеДниСтруктурнойЕдиницы(СтруктурнаяЕдиница));
	
КонецФункции

&НаКлиенте
// Функция - Формирование интервалов завершено
// 
// Возвращаемое значение:
//   - 
// 
Функция ФормированиеИнтерваловЗавершено(СообщитьПользователю = Истина)
	
	ФормированиеИнтерваловЗавершено = Истина;
	
	Для Каждого ИнтервалСписка Из ОтборИнтервалыРаботы Цикл 
		Если ИнтервалСписка.Значение.НачалоРаботы = Неопределено ИЛИ ИнтервалСписка.Значение.ОкончаниеРаботы = Неопределено Тогда 
			ФормированиеИнтерваловЗавершено = Ложь;
			Если СообщитьПользователю Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Формирование интервалов работы на панели не завершено.", ЭтотОбъект);
			КонецЕсли;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ФормированиеИнтерваловЗавершено;
	
КонецФункции

// Функция - проверяет наличие Визита сотрудника
// 
// 
Функция ПроверитьНаличиеПриема(Знач Сотрудник, Знач Период, Знач СписокПериодов, Знач СтруктурнаяЕдиница = Неопределено)
	
	Запрос       = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументСобытиеУслуги.Ссылка КАК Ссылка,
	|	ДокументСобытиеУслуги.ДатаНачала КАК ДатаНачала,
	|	ДокументСобытиеУслуги.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	Документ.Событие.Услуги КАК ДокументСобытиеУслуги
	|ГДЕ
	|	ДокументСобытиеУслуги.Ссылка.Проведен
	|	И ВЫБОР
	|			КОГДА &СтруктурнаяЕдиница <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ДокументСобытиеУслуги.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НАЧАЛОПЕРИОДА(ДокументСобытиеУслуги.ДатаНачала, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
	|	И ДокументСобытиеУслуги.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|	И ВЫБОР
	|			КОГДА &Сотрудник <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ДокументСобытиеУслуги.Сотрудник = &Сотрудник
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";  
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);	
	Запрос.УстановитьПараметр("Сотрудник"         , ?(ЗначениеЗаполнено(Сотрудник), Сотрудник, Неопределено));
	Запрос.УстановитьПараметр("Период"            , Период);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	СтрокаСобытияЕстьВПериоде = Ложь;
	Пока Результат.Следующий() Цикл 
		
		Для Каждого ЭлементСписка Из СписокПериодов Цикл
			
			// Если существует визит, пересекающийся с заданным периодом
			Если (Результат.ДатаНачала >= ЭлементСписка.Значение.НачалоРаботы И Результат.ДатаНачала < ЭлементСписка.Значение.ОкончаниеРаботы)
				ИЛИ (Результат.ДатаНачала <= ЭлементСписка.Значение.НачалоРаботы И Результат.ДатаОкончания > ЭлементСписка.Значение.НачалоРаботы)
				ИЛИ (Результат.ДатаНачала >= Период + (ЭлементСписка.Значение.НачалоРаботы - Дата(1,1,1)) И Результат.ДатаНачала < Период + (ЭлементСписка.Значение.ОкончаниеРаботы - Дата(1,1,1)))
				ИЛИ (Результат.ДатаНачала <= Период + (ЭлементСписка.Значение.НачалоРаботы - Дата(1,1,1)) И Результат.ДатаОкончания > Период + (ЭлементСписка.Значение.НачалоРаботы - Дата(1,1,1))) Тогда
				
				СтруктураВозврата = Новый Структура("НачалоРаботы, ОкончаниеРаботы", ЭлементСписка.Значение.НачалоРаботы, ЭлементСписка.Значение.ОкончаниеРаботы);
				Возврат СтруктураВозврата;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Находит сотрудника по его ИД
// 
// 
Функция НайтиСотрудникаПоИД(Знач ИД_Сотрудника)
		
	Если ЭтоУникальныйИдентификатор(ИД_Сотрудника) Тогда
		Возврат Справочники.Сотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор(ИД_Сотрудника));
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Функция - Получает данные выделенной области табличного документа
// 
// 
Функция ПолучитьДанныеВыделеннойОбластиГрафикПериодовРаботыТабДок(ИмяОбласти)
	
	Позиция = СтрНайти(ИмяОбласти,"C");
	Позиция_Двоеточие = СтрНайти (Имяобласти,":");
	
	// период
	Попытка
		НомерКолонки = Число(Сред(ИмяОбласти,Позиция+1, Позиция_Двоеточие - Позиция - 1));
		Если НомерКолонки < 5 Тогда // даты начинаются с 3 колонки
			ВыбПериод =  Неопределено;
		КонецЕсли;
		
		ВыбПериод = НачалоДня(ОтборПериод.ДатаНачала) + (НомерКолонки-5)*24*60*60;
		
		Если ВыбПериод > отборПериод.ДатаОкончания Тогда
			ВыбПериод =  Неопределено;
		КонецЕсли;       		
	Исключение
		ВыбПериод =  Неопределено;
	КонецПопытки;
		
	// Сотрудник.
	НомерСтроки		= Сред(ИмяОбласти, 2, позиция - 2 );
	ИД_Сотрудника	= ГрафикПериодовРаботыТабДок.Область("R"+СтрЗаменить(НомерСтроки,Символы.НПП,"")+"C2").Текст;
	
	Сотрудник		= ?(ЭтоУникальныйИдентификатор(ИД_Сотрудника), НайтиСотрудникаПоИД(ИД_Сотрудника), ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка")); 
	
	// Содержимое ячейки.
	Содержимое = ГрафикПериодовРаботыТабДок.Область(ИмяОбласти).Текст;

	Возврат  Новый Структура("Сотрудник, ВыбПериод, Содержимое", Сотрудник, ВыбПериод, Содержимое);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Функция, проверяет является ли строка уникальным идентификатором.
//
Функция ЭтоУникальныйИдентификатор(Строка)	
	Возврат СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Строка);	
КонецФункции

&НаКлиенте
// Функция - Список шаблонов содержит структуру интервалов
// 
// Возвращаемое значение:
//   - 
// 
Функция СписокШаблоновСодержитСтруктуруИнтервалов()
	
	СписокШаблоновПуст 		= СписокШаблонов.Количество() = 0;
	ЕстьПопадание 			= Ложь;
	ИндексШаблона 			= Неопределено;
	Информация 				= "";
	ИнтервалыСформированы 	= Истина;
	СовпадаетПоКоличеству 	= Истина;
	МассивСовпавших 		= Новый Массив;
	
	// Проверим сформированы ли интервалы
	Если НЕ ФормированиеИнтерваловЗавершено(Ложь) Тогда 
		ИнтервалыСформированы = Ложь;
		Информация = "Формирование интервалов работы в панели не завершено. Сохранение шаблона не возможно.";
	КонецЕсли;
	
	// Начинаем сравнение
	Если НЕ СписокШаблоновПуст И ИнтервалыСформированы Тогда
		
		Для Каждого Шаблон Из СписокШаблонов Цикл
			
			// Проверяем на совпадение по количеству
			Если НЕ Шаблон.Значение.Количество() = ОтборИнтервалыРаботы.Количество() Тогда 
				СовпадаетПоКоличеству = Ложь;
				Продолжить;
			Иначе 
				СовпадаетПоКоличеству = Истина;
			КонецЕсли;
			
			// Дальше проверяем на совпадение
			Для Каждого ИнтервалШаблона Из Шаблон.Значение Цикл 
				
				ИнтервалСовпал = Ложь;
				Для Каждого ИнтервалСписка Из ОтборИнтервалыРаботы Цикл 
					Если ИнтервалСписка.Значение.НачалоРаботы = ИнтервалШаблона.Значение.НачалоРаботы И ИнтервалСписка.Значение.ОкончаниеРаботы = ИнтервалШаблона.Значение.ОкончаниеРаботы Тогда 
						ИнтервалСовпал = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если ИнтервалСовпал Тогда
					МассивСовпавших.Добавить(ИнтервалШаблона.Значение);
				Иначе
					МассивСовпавших.Очистить();
					Прервать;
				КонецЕсли;	
				
			КонецЦикла;
			
			Если МассивСовпавших.Количество() = Шаблон.Значение.Количество() Тогда 
				ЕстьПопадание = Истина;
				ИндексШаблона = СписокШаблонов.Индекс(Шаблон);
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Новый Структура("Успех, ИндексШаблона, Информация", ЕстьПопадание, ИндексШаблона, Информация);
	
КонецФункции

&НаКлиенте
// Функция - Вернуть последнее указанное время
// 
// Параметры:
//  ИндексСтроки - 	 - 
//  Шаг			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ВернутьПоследнееУказанноеВремя(Знач СтруктураДанныеЭлемента, Знач Шаг)
	
	Если СтруктураДанныеЭлемента.ЭтоНачалоИнтервала ИЛИ ОтборИнтервалыРаботы[СтруктураДанныеЭлемента.ИндексСтроки].Значение.НачалоРаботы = Неопределено Тогда 
		ИндексСтроки 		= СтруктураДанныеЭлемента.ИндексСтроки - 1;
	Иначе  
		ИндексСтроки 		= СтруктураДанныеЭлемента.ИндексСтроки;
	КонецЕсли;	
	ПоследнееУказанноеВремя = Неопределено;
	
	Пока ИндексСтроки >= 0 Цикл
		Если СтруктураДанныеЭлемента.ЭтоНачалоИнтервала Тогда
			Если НЕ ОтборИнтервалыРаботы[ИндексСтроки].Значение.ОкончаниеРаботы = Неопределено Тогда 
				ПоследнееУказанноеВремя = ОтборИнтервалыРаботы[ИндексСтроки].Значение.ОкончаниеРаботы;
				Прервать;
			ИначеЕсли НЕ ОтборИнтервалыРаботы[ИндексСтроки].Значение.НачалоРаботы = Неопределено Тогда	
				ПоследнееУказанноеВремя = ОтборИнтервалыРаботы[ИндексСтроки].Значение.НачалоРаботы;
				Прервать;
			КонецЕсли;
		Иначе
			Если ИндексСтроки = СтруктураДанныеЭлемента.ИндексСтроки И НЕ ОтборИнтервалыРаботы[ИндексСтроки].Значение.НачалоРаботы = Неопределено Тогда 
				ПоследнееУказанноеВремя = ОтборИнтервалыРаботы[ИндексСтроки].Значение.НачалоРаботы;
				Прервать;
			Иначе 	
				Если НЕ ОтборИнтервалыРаботы[ИндексСтроки].Значение.ОкончаниеРаботы = Неопределено Тогда	
					ПоследнееУказанноеВремя = ОтборИнтервалыРаботы[ИндексСтроки].Значение.ОкончаниеРаботы;
					Прервать;
				ИначеЕсли НЕ ОтборИнтервалыРаботы[ИндексСтроки].Значение.НачалоРаботы = Неопределено Тогда	
					ПоследнееУказанноеВремя = ОтборИнтервалыРаботы[ИндексСтроки].Значение.НачалоРаботы;
					Прервать;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		ИндексСтроки = ИндексСтроки - 1;		
	КонецЦикла;	
	
	Если НЕ ПоследнееУказанноеВремя = Неопределено Тогда 
		ПоследнееУказанноеВремя = ПоследнееУказанноеВремя + Шаг*60;
	КонецЕсли;	
	
	Возврат ПоследнееУказанноеВремя;	
	
КонецФункции

&НаКлиенте
// Процедура - Обновить общее время интервалов
// 
Процедура ОбновитьОбщееВремяИнтервалов()
	
	СуммаМинут 		= 0;
	Для Каждого Интервал Из ОтборИнтервалыРаботы Цикл 
		Если НЕ Интервал.Значение.НачалоРаботы = Неопределено И НЕ Интервал.Значение.ОкончаниеРаботы = Неопределено Тогда 
			КоличествоМинут = Цел((Интервал.Значение.ОкончаниеРаботы - Интервал.Значение.НачалоРаботы) / 60);
		Иначе 
			КоличествоМинут = 0;
		КонецЕсли;
		СуммаМинут = СуммаМинут + КоличествоМинут;	
	КонецЦикла;
	
	Если СуммаМинут = 0 Тогда 
		Элементы.ПоказатьСписокШаблонов.Заголовок = "Смены: ";
	Иначе 
		Часы  = Цел(СуммаМинут / 60);
		Минут = СуммаМинут - (Часы * 60);		
		Элементы.ПоказатьСписокШаблонов.Заголовок = "Смены: (" +  ?(Часы > 0 ,"" + Часы + " ч.","") + ?(Минут > 0 ,"" + Минут + " м.","") + ")";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Функция - находит строку в БуфереФормирования по сотруднику и дате
// 
// 
Функция СтрокаБуфераФомированияПоСотрудникуДате(Сотрудник, Дата)

	НайденныеСтроки = БуферФормирования.НайтиСтроки(Новый Структура("Сотрудник, Дата", Сотрудник, Дата));
	
	Возврат ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0], Неопределено);
	
КонецФункции

&НаСервере
// Процедура - Обновить меню отбора интервалов работ
// 
Процедура ОбновитьМенюОтбораИнтерваловРабот()
	   	
	Элементы.ГруппаДобавитьИнтервал.Видимость = Истина;
	
	РодительскаяГруппа = Элементы.ГруппаСписокИнтерваловРаботы;
	// Очистим группу
	УдаляемыеЭлементы = Новый Массив;
	
	Для Каждого ГруппаЭлементов Из РодительскаяГруппа.ПодчиненныеЭлементы Цикл
		УдаляемыеЭлементы.Добавить(ГруппаЭлементов);
	КонецЦикла;
	
	Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
	
	Если ОтборИнтервалыРаботы.Количество() = 0 Тогда 
		ДекорацияФормы_СписокИнтервалов_Пуст = Элементы.Добавить("ДекорацияФормы_СписокИнтервалов_Пуст", Тип("ДекорацияФормы"), РодительскаяГруппа);
		ДекорацияФормы_СписокИнтервалов_Пуст.Вид 									= ВидДекорацииФормы.Надпись;
		ДекорацияФормы_СписокИнтервалов_Пуст.Заголовок 								= "Список интервалов пуст";
		ДекорацияФормы_СписокИнтервалов_Пуст.АвтоМаксимальнаяШирина    				= Ложь;
		ДекорацияФормы_СписокИнтервалов_Пуст.Высота 								= 1;
		ДекорацияФормы_СписокИнтервалов_Пуст.МаксимальнаяШирина       				= 45;
		ДекорацияФормы_СписокИнтервалов_Пуст.ГоризонтальноеПоложение   				= ГоризонтальноеПоложениеЭлемента.Центр;
		ДекорацияФормы_СписокИнтервалов_Пуст.ГоризонтальноеПоложениеВГруппе 		= ГоризонтальноеПоложениеЭлемента.Центр;
		ДекорацияФормы_СписокИнтервалов_Пуст.ВертикальноеПоложение 					= ВертикальноеПоложениеЭлемента.Центр;
		ДекорацияФормы_СписокИнтервалов_Пуст.ВертикальноеПоложениеВГруппе			= ВертикальноеПоложениеЭлемента.Центр;		
		ДекорацияФормы_СписокИнтервалов_Пуст.РастягиватьПоГоризонтали  				= Истина;
		ДекорацияФормы_СписокИнтервалов_Пуст.ЦветТекста								= Новый Цвет(170, 170, 170);
		ДекорацияФормы_СписокИнтервалов_Пуст.Шрифт 									= Новый Шрифт("Arial", 11);		
	Иначе 	
		Для Каждого ЭлементСписка Из ОтборИнтервалыРаботы Цикл 
			
			ИндексИнтервала = ОтборИнтервалыРаботы.Индекс(ЭлементСписка);
			
			// Создаем группу для каждого интервала
			// --------------------------------------------------------------------------------------------		
			Группа_Интервал = Элементы.Добавить("Группа_Интервал_" + ИндексИнтервала, Тип("ГруппаФормы"), РодительскаяГруппа);
			Группа_Интервал.Вид 													= ВидГруппыФормы.ОбычнаяГруппа;
			Группа_Интервал.Заголовок 												= Группа_Интервал.Имя;
			Группа_Интервал.Отображение 											= ОтображениеОбычнойГруппы.Нет;
			Группа_Интервал.Группировка 											= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			Группа_Интервал.ОтображатьЗаголовок 									= Ложь;
			// Группа_Интервал.ЦветФона 												= ЦветаСтиля.ЦветФонаЗадач;
			Группа_Интервал.ГоризонтальныйИнтервал 									= ИнтервалМеждуЭлементамиФормы.Половинный;
			Группа_Интервал.ГоризонтальноеПоложениеВГруппе   						= ГоризонтальноеПоложениеЭлемента.Центр;
			Группа_Интервал.ГоризонтальноеПоложениеПодчиненных 						= ГоризонтальноеПоложениеЭлемента.Центр;
			Группа_Интервал.ВертикальноеПоложениеВГруппе 							= ВертикальноеПоложениеЭлемента.Центр;
			Группа_Интервал.ВертикальноеПоложениеПодчиненных						= ВертикальноеПоложениеЭлемента.Центр;		
			
			Если ЭтаФорма.Команды.Найти("Подключаемый_ВыборНачалаИнтервала_" + ИндексИнтервала) = Неопределено Тогда
				Команда 			= ЭтаФорма.Команды.Добавить("Подключаемый_ВыборНачалаИнтервала_" + ИндексИнтервала);
				Команда.Заголовок 	= "[...]";
				Команда.Подсказка 	= "Укажите начало интервала";
				Команда.Действие 	= "Подключаемый_ВыборНачалаИнтервала";
			КонецЕсли;
			
			КнопкаНачалаИнтервала = Элементы.Добавить("Кнопка_ВыборНачалаИнтервала_" + ИндексИнтервала, Тип("КнопкаФормы"), Группа_Интервал);
			КнопкаНачалаИнтервала.ИмяКоманды 										= "Подключаемый_ВыборНачалаИнтервала_" + ИндексИнтервала;
			КнопкаНачалаИнтервала.Заголовок 										= ?(ЭлементСписка.Значение.НачалоРаботы = Неопределено, "[...]", Формат(ЭлементСписка.Значение.НачалоРаботы, "ДФ=HH:mm"));
			КнопкаНачалаИнтервала.ОтображениеФигуры    								= ОтображениеФигурыКнопки.Нет;
			КнопкаНачалаИнтервала.Ширина 											= 4;
			КнопкаНачалаИнтервала.ЦветТекста 										= ЦветаСтиля.ТекстВторостепеннойНадписи;
			КнопкаНачалаИнтервала.Шрифт 											= Новый Шрифт("Arial", 11);
			КнопкаНачалаИнтервала.ГоризонтальноеПоложениеВГруппе 					= ГоризонтальноеПоложениеЭлемента.Центр;
			КнопкаНачалаИнтервала.ВертикальноеПоложениеВГруппе 						= ВертикальноеПоложениеЭлемента.Центр;
			КнопкаНачалаИнтервала.ЦветФона 											= Новый Цвет(240, 240, 240);
			
			// Декорация "-"				
			ДекорацияФормы_Дефис = Элементы.Добавить("ДекорацияФормы_Дефис_" + ИндексИнтервала, Тип("ДекорацияФормы"), Группа_Интервал);
			ДекорацияФормы_Дефис.Вид 												= ВидДекорацииФормы.Надпись;
			ДекорацияФормы_Дефис.Заголовок 											= "-";
			ДекорацияФормы_Дефис.Ширина 											= 1;
			ДекорацияФормы_Дефис.ЦветТекста											= ЦветаСтиля.ТекстВторостепеннойНадписи;			
			ДекорацияФормы_Дефис.ГоризонтальноеПоложение   							= ГоризонтальноеПоложениеЭлемента.Центр;
			ДекорацияФормы_Дефис.ГоризонтальноеПоложениеВГруппе 					= ГоризонтальноеПоложениеЭлемента.Центр;
			ДекорацияФормы_Дефис.ВертикальноеПоложение 								= ВертикальноеПоложениеЭлемента.Центр;
			ДекорацияФормы_Дефис.ВертикальноеПоложениеВГруппе						= ВертикальноеПоложениеЭлемента.Центр;		
			
			Если ЭтаФорма.Команды.Найти("Подключаемый_ВыборОкончанияИнтервала_" + ИндексИнтервала) = Неопределено Тогда
				Команда 			= ЭтаФорма.Команды.Добавить("Подключаемый_ВыборОкончанияИнтервала_" + ИндексИнтервала);
				Команда.Заголовок 	= "[...]";
				Команда.Подсказка 	= "Укажите окончание интервала";
				Команда.Действие 	= "Подключаемый_ВыборОкончанияИнтервала";
			КонецЕсли;
			
			КнопкаОкончанияИнтервала = Элементы.Добавить("Кнопка_ВыборОкончанияИнтервала_" + ИндексИнтервала, Тип("КнопкаФормы"), Группа_Интервал);
			КнопкаОкончанияИнтервала.ИмяКоманды 									= "Подключаемый_ВыборОкончанияИнтервала_" + ИндексИнтервала;
			КнопкаОкончанияИнтервала.Заголовок 										= ?(ЭлементСписка.Значение.ОкончаниеРаботы = Неопределено, "[...]", Формат(ЭлементСписка.Значение.ОкончаниеРаботы, "ДФ=HH:mm"));
			КнопкаОкончанияИнтервала.ОтображениеФигуры    							= ОтображениеФигурыКнопки.Нет;
			КнопкаОкончанияИнтервала.Ширина 										= 4;
			КнопкаОкончанияИнтервала.ЦветТекста 									= ЦветаСтиля.ТекстВторостепеннойНадписи;
			КнопкаОкончанияИнтервала.Шрифт 											= Новый Шрифт("Arial", 11);
			КнопкаОкончанияИнтервала.ГоризонтальноеПоложениеВГруппе 				= ГоризонтальноеПоложениеЭлемента.Центр;
			КнопкаОкончанияИнтервала.ВертикальноеПоложениеВГруппе 					= ВертикальноеПоложениеЭлемента.Центр;
			КнопкаОкончанияИнтервала.ЦветФона 										= Новый Цвет(240, 240, 240);
			
			// Декорация "х"				
			ДекорацияФормы_УдалениеИнтервала = Элементы.Добавить("ДекорацияФормы_УдалениеИнтервала_" + ИндексИнтервала, Тип("ДекорацияФормы"), Группа_Интервал);
			ДекорацияФормы_УдалениеИнтервала.Вид 									= ВидДекорацииФормы.Картинка;
			// ДекорацияФормы_УдалениеИнтервала.Заголовок 								= "-";
			ДекорацияФормы_УдалениеИнтервала.Ширина 								= 1;
			ДекорацияФормы_УдалениеИнтервала.Высота 								= 1;
			ДекорацияФормы_УдалениеИнтервала.ЦветТекста								= ЦветаСтиля.ТекстВторостепеннойНадписи;			
			ДекорацияФормы_УдалениеИнтервала.ГоризонтальноеПоложениеВГруппе 		= ГоризонтальноеПоложениеЭлемента.Центр;
			ДекорацияФормы_УдалениеИнтервала.ВертикальноеПоложениеВГруппе			= ВертикальноеПоложениеЭлемента.Центр;		
			ДекорацияФормы_УдалениеИнтервала.Картинка 								= БиблиотекаКартинок.УдалениеДанных16;
			ДекорацияФормы_УдалениеИнтервала.Гиперссылка 							= Истина;
			ДекорацияФормы_УдалениеИнтервала.РастягиватьПоГоризонтали	 			= Ложь;
			
			ДекорацияФормы_УдалениеИнтервала.УстановитьДействие("Нажатие", "Подключаемый_ДекорацияФормы_УдалитьТекущийИнтервал_Нажатие");
			
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

#Конецобласти

#Область ОбработчикиОповещенийАсинхронныхСобытий

&НаКлиенте
// Процедура - Открыть список заверщение Клиент.
// 
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
// 
Процедура ОткрытьСписокСотрудниковЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборСотрудник = Результат.Значение;
	ОтборГрафикПериодовРаботыПоСотруднику();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Открыть список заверщение Клиент.
// 
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
// 
Процедура ОткрытьСписокДолжностейЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборСотрудникДолжность = Результат.Значение;
	ОтборГрафикПериодовРаботыПоСотруднику();
	
КонецПроцедуры 

&НаКлиенте
// Процедура - Открыть список заверщение Клиент.
// 
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
// 
Процедура ОткрытьСписокРолейЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборСотрудникРоль = Результат.Значение;
	ОтборГрафикПериодовРаботыПоСотруднику();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Открыть список салонов заверщение
// 
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
// 
Процедура ОткрытьСписокКлиникЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПроверитьНеобходимостьФиксацииИзмененийВПлане() = Истина Тогда
		СтруктураПарметров = Новый Структура;
		СтруктураПарметров.Вставить("ИмяЭлемента"	, Элементы.ОтборПериод.Имя);		
		СтруктураПарметров.Вставить("КодДляОтката"	, Элементы.ОтборПериод.Имя + "= ОткатВыбранногоЗначения;");
		Оповещение   = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОФиксацииизменений", ЭтотОбъект, СтруктураПарметров);
		ПоказатьВопрос(Оповещение, "Имеются не сохраненные изменения, они будут потеряны. Продолжить ?", РежимДиалогаВопрос.ДаНет,,, "Планирование");
		Возврат;
	Иначе 
		ОтборСотрудникДолжность = "Все";
		Элементы.ОткрытьСписокСотрудники.Заголовок =  "Все";
		
		ВыбранноеЗначение		= ?(ТипЗнч(Результат) = Тип("СправочникСсылка.СтруктурныеЕдиницы"), Результат,Результат.Значение);
		ОтборСтруктурнаяЕдиница = ВыбранноеЗначение;
		
		Элементы.ОткрытьСписокКлиник.Заголовок = Строка(ВыбранноеЗначение);
		
		ВремяРаботыСтруктурнойЕдиницы = ВернутьВремяРаботыСтруктурнойЕдиницы(ОтборСтруктурнаяЕдиница);
		
		СписокПериодов = ПолучитьСписокПериодовРаботы(ОтборСтруктурнаяЕдиница);
		ЗадатьПериодСменыНаФорме();
		
		ОбновитьОтображениеПланирования(Истина);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Отбор периода планировании при изменении
// 
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
// 
Процедура ОтборПериодаПланированииПриИзменении(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		
		ЭтоОчистка = Результат.ДатаНачала = Дата(1,1,1);
		
		Если Не ЗначениеЗаполнено(Результат.ДатаОкончания) Тогда
			Результат.ДатаОкончания = КонецМесяца(?(ЗначениеЗаполнено(Результат.ДатаНачала), Результат.ДатаНачала, КонецМесяца(Результат.ДатаНачала)));		
		КонецЕсли;
		
		Если ДобавитьМесяц(Результат.ДатаНачала, 3) <  Результат.ДатаОкончания Тогда
			Результат.ДатаОкончания = ДобавитьМесяц(КонецМесяца(Результат.ДатаНачала), 2);	
		КонецЕсли;
		
		ОтборПериод = Результат;
		
		Если ПроверитьНеобходимостьФиксацииИзмененийВПлане() = Истина Тогда
			СтруктураПарметров = Новый Структура;
			Оповещение   = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОФиксацииизменений", ЭтотОбъект, СтруктураПарметров);
			ПоказатьВопрос(Оповещение,"Имеются не сохраненные изменения, они будут потеряны. Продолжить ?",РежимДиалогаВопрос.ДаНет,,,"Планирование");
			Возврат;
		Иначе 
			ОбновитьОтображениеПланирования(Истина);
		КонецЕсли;
		
		ОтборГрафикПериодовРаботыПоСотруднику();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - После закрытия формы создания оповещение
// 
// Параметры:
//  РезультатПланирования	 - 	 - 
//  ДопПараметры			 - 	 - 
// 
Процедура ПослеЗакрытияФормыСозданияОповещение(Результат, ДопПараметры) Экспорт
	
	НСтроки                = 0;
	ЗадаватьВопрос         = Истина;
	РезультатВопроса       = Неопределено;
	РезультатПланирования  = Неопределено;
	
	Если ТипЗнч(ДопПараметры) = Тип("Структура")
		И ДопПараметры.Свойство("РезВопроса") Тогда
		
		РезультатВопроса      = Результат;
		РезультатПланирования = ДопПараметры.РезультатПланирования;
		НСтроки               = ДопПараметры.НСтроки;		
		Если ЗначениеЗаполнено(РезультатВопроса) Тогда
			ЗадаватьВопрос = НЕ РезультатВопроса.ДляВсех;
		КонецЕсли;
	Иначе
		РезультатПланирования = Результат;
	КонецЕсли;
	
	// Не проверяем наложение новых рабочих периодов, на существующие интревалы
	Если РезультатПланирования <> Неопределено Тогда
		ДополнитьБуферНовымиДаннымиПланирования(РезультатПланирования);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор шаблона из списка
// 
// Параметры:
//  ВыбранныйЭлемент		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
// 
Процедура ВыборШаблонаИзСписка(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда 
		Возврат;
	Иначе
		ОтборИнтервалыРаботы.Очистить();
		
		Если ВыбранныйЭлемент.Значение = "Отпуск" 
			Или ВыбранныйЭлемент.Значение = "Больничный" Тогда
			
			Элементы.ГруппаСписокИнтерваловРаботы.Видимость = Ложь;
			Элементы.ГруппаДобавитьИнтервал.Видимость       = Ложь;	
			Элементы.ПоказатьСписокШаблонов.Заголовок       = ВыбранныйЭлемент.Значение;
			
			ТипРабочегоВремени = ?(ВыбранныйЭлемент.Значение = "Отпуск", ПредопределенноеЗначение("Перечисление.ТипыРабочегоВремени.Отпуск"), ПредопределенноеЗначение("Перечисление.ТипыРабочегоВремени.Больничный"));
			
		ИначеЕсли СокрЛП(ВыбранныйЭлемент.Значение) = "Смены:" Тогда
			
			Элементы.ГруппаСписокИнтерваловРаботы.Видимость = Истина;
			Элементы.ГруппаДобавитьИнтервал.Видимость       = Истина;	
			Элементы.ПоказатьСписокШаблонов.Заголовок       = ВыбранныйЭлемент.Значение;
			Если ОтборИнтервалыРаботы.Количество() = 0 Тогда
	            ОтборИнтервалыРаботы.Добавить(Новый Структура("НачалоРаботы, ОкончаниеРаботы", Неопределено, Неопределено));
			КонецЕсли;
			
			ОбновитьМенюОтбораИнтерваловРабот();
			ОбновитьОбщееВремяИнтервалов();		

			ТипРабочегоВремени = ПредопределенноеЗначение("Перечисление.ТипыРабочегоВремени.Рабочее");

		Иначе
			Для Каждого ЭлементСписка Из ВыбранныйЭлемент.Значение Цикл 
				ОтборИнтервалыРаботы.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
			КонецЦикла;	
			ОбновитьМенюОтбораИнтерваловРабот();
			ОбновитьОбщееВремяИнтервалов();		
			ОбновитьДекорациюУпраленияСохранениемСмен(ОтборСтруктурнаяЕдиница, ЭлементСписка.Значение);
			
			Элементы.ГруппаСписокИнтерваловРаботы.Видимость = Истина;
			Элементы.ГруппаДобавитьИнтервал.Видимость       = Истина;
			
			ТипРабочегоВремени = ПредопределенноеЗначение("Перечисление.ТипыРабочегоВремени.Рабочее");
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура - После вопроса о записи изменений оповещение
// 
// Параметры:
//  Ответ		 - 	 - 
//  ДопПараметры - 	 - 
// 
Процедура ПослеВопросаОЗаписиИзмененийОповещение(Ответ, ДопПараметры) Экспорт
	
	ПроверятьНеобхЗаписи = Ложь;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		КомандаСформировать(Неопределено);	
	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
		ПроверятьНеобхЗаписи = Истина;
		Возврат;
	КонецЕсли;
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
// Обработчик асинхронного вызова после диалога вопроса
// 
Процедура ПослеЗакрытияВопросаОФиксацииизменений(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Если ЭтоОчистка = Неопределено Тогда
			ЭтоОчистка = Ложь;
		КонецЕсли;
		
		Если ЭтоОчистка И Параметры.Свойство("ИмяЭлемента") И Параметры.ИмяЭлемента = "ОтборПериод" Тогда
			ЭтоОчистка = Ложь;
			БуферФормирования.Очистить();
		КонецЕсли;
		ОбновитьОтображениеПланирования(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор времени из списка
// 
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
// 
Процедура ВыборВремениИзСписка(ВыбранныйЭлемент, ДополнительныеПараметры = Неопределено) Экспорт
	
	Отказ = Ложь;
	
	Если ВыбранныйЭлемент = Неопределено Тогда 
		Возврат;
	Иначе
		// Запоминаем значение
		ЗначениеДоИзменения = ДополнительныеПараметры.ДанныеЭлемента.Значение;
		// Моделируем новое значение
		Если ДополнительныеПараметры.ЭтоНачалоИнтервала Тогда 
			ЗначениеПослеИзменения = Новый Структура("НачалоРаботы, ОкончаниеРаботы", ВыбранныйЭлемент.Значение, ЗначениеДоИзменения.ОкончаниеРаботы);
		Иначе 
			ЗначениеПослеИзменения = Новый Структура("НачалоРаботы, ОкончаниеРаботы", ЗначениеДоИзменения.НачалоРаботы, ВыбранныйЭлемент.Значение);
		КонецЕсли;
		// Производим проверку
		Если НЕ ЗначениеПослеИзменения.НачалоРаботы = Неопределено И НЕ ЗначениеПослеИзменения.ОкончаниеРаботы = Неопределено Тогда
			Если ЗначениеПослеИзменения.НачалоРаботы = ЗначениеПослеИзменения.ОкончаниеРаботы Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Время начала работы не может быть равно времени окончания работы!", ЭтотОбъект);
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			Если ЗначениеПослеИзменения.НачалоРаботы > ЗначениеПослеИзменения.ОкончаниеРаботы Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Время начала работы не может быть больше времени окончания работы!", ЭтотОбъект);
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			Для Каждого ИнтервалСписка ИЗ ЭтаФорма[ДополнительныеПараметры.ИмяТаблицы] Цикл
				ИндексИнтервала = ЭтаФорма[ДополнительныеПараметры.ИмяТаблицы].Индекс(ИнтервалСписка);
				Если ИндексИнтервала <> ДополнительныеПараметры.ИндексСтроки И 
					НЕ ИнтервалСписка.Значение.НачалоРаботы = Неопределено И НЕ ИнтервалСписка.Значение.ОкончаниеРаботы = Неопределено Тогда
					
					//  приоритет отдан этому механизму выявления пересечения периодов
					Если Макс(ЗначениеПослеИзменения.НачалоРаботы, ИнтервалСписка.Значение.НачалоРаботы) < Мин(ЗначениеПослеИзменения.ОкончаниеРаботы, ИнтервалСписка.Значение.ОкончаниеРаботы) Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обнаружено пересечение времени: с " + Формат(Макс(ЗначениеПослеИзменения.НачалоРаботы, ИнтервалСписка.Значение.НачалоРаботы), "ДФ=HH:mm") + " по " + Формат(Мин(ЗначениеПослеИзменения.ОкончаниеРаботы, ИнтервалСписка.Значение.ОкончаниеРаботы), "ДФ=HH:mm"), ЭтотОбъект);
						Отказ = Истина;	
						Прервать;
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;			
		Если НЕ Отказ Тогда 
			ДополнительныеПараметры.ДанныеЭлемента.Значение 		= ЗначениеПослеИзменения;
			ДополнительныеПараметры.ДанныеЭлемента.Представление 	= ОбщегоНазначенияКлиентСерверСтоматология.ПолучитьПредставлениеИнтервала(ДополнительныеПараметры.ДанныеЭлемента.Значение);
			Элементы[ДополнительныеПараметры.ИмяЭлемента].Заголовок = Формат(ВыбранныйЭлемент.Значение, "ДФ=HH:mm");
			Если ДополнительныеПараметры.ЭтоНачалоИнтервала И ДополнительныеПараметры.ДанныеЭлемента.Значение.ОкончаниеРаботы = Неопределено Тогда
				Подключаемый_ВыборОкончанияИнтервала(ЭтаФорма.Команды.Найти("Подключаемый_ВыборОкончанияИнтервала_" + ДополнительныеПараметры.ИндексСтроки));
			КонецЕсли;
			ОбновитьОбщееВремяИнтервалов();
			ОбновитьДекорациюУпраленияСохранениемШаблонов();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Конецобласти

&НаСервере
// Процедура отрисовывает форму планирования на сервере
// 
Процедура ПриОткрытииНаСервере()
	
	ПроверятьНеобхЗаписи 	= Истина;
	ЭтоОчистка 				= Ложь;
	
	Если НЕ ЗначениеЗаполнено(ОтборПериод) Тогда
		ОтборПериод.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
	КонецЕсли;
	
	ВремяРаботыСтруктурнойЕдиницы = ВернутьВремяРаботыСтруктурнойЕдиницы(ОтборСтруктурнаяЕдиница);
	
	ОбновитьОтображениеПланирования(Истина);	
	
	СписокПериодов = ПолучитьСписокПериодовРаботы(ОтборСтруктурнаяЕдиница);	 
		
	Если ОтборИнтервалыРаботы.Количество() = 0 Тогда
	    ОтборИнтервалыРаботы.Добавить(Новый Структура("НачалоРаботы, ОкончаниеРаботы", Неопределено, Неопределено));
    КонецЕсли;

	// Отобразим интервалы на форме
	ОбновитьМенюОтбораИнтерваловРабот();  
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьВремяРаботыСтруктурнойЕдиницыПоДате (Дата, СтруктурнаяЕдиница)
	
	Результат = Справочники.СтруктурныеЕдиницы.ВремяРаботыСтруктурнойЕдиницы(Дата, СтруктурнаяЕдиница,,Истина); 
	
	Если Результат <> Неопределено Тогда
		СтруктураРезультат = Новый Структура;
		СтруктураРезультат.Вставить("НачалоРаботы"   ,Результат.НачалоРаботы);
		СтруктураРезультат.Вставить("ОкончаниеРаботы",Результат.ОкончаниеРаботы);
		//СтруктураРезультат.Вставить("РабочийДень"    , РегистрыСведений.КалендарныеГрафики.ЭтоРабочийДень(Дата));
		Возврат СтруктураРезультат; 
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Процедура задает период смены на форме
// 
Процедура ЗадатьПериодСменыНаФорме()
	
	Если СписокПериодов.Количество() > 0 И СписокПериодов[0].Значение <> "Отпуск" И СписокПериодов[0].Значение <> "Больничный" Тогда
		ВыборШаблонаИзСписка(СписокПериодов[0], Неопределено);
	КонецЕсли;   
	
КонецПроцедуры     

&НаСервереБезКонтекста
// Функция - проверяет входят ли приемы в указанный интервал работ
// 
Функция ПроверитьПриемыВходятВИнтервалыРабот(Сотрудник, Дата, ОтборСтруктурнаяЕдиница, ИнтервалыРаботы) 
	
	Запрос = Новый Запрос( 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СобытиеУслуги.Ссылка КАК Ссылка,
	|	СобытиеУслуги.ДатаНачала КАК ДатаНачала,
	|	СобытиеУслуги.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	Документ.Событие.Услуги КАК СобытиеУслуги
	|ГДЕ
	|	СобытиеУслуги.Ссылка.Проведен
	|	И СобытиеУслуги.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|	И СобытиеУслуги.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И СобытиеУслуги.Сотрудник = &Сотрудник 
	|	И НАЧАЛОПЕРИОДА(СобытиеУслуги.Ссылка.Дата, ДЕНЬ) = &Дата");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, ОтборСтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Сотрудник"			, Сотрудник);
	Запрос.УстановитьПараметр("Дата"				, НачалоДня(Дата));
	
	ТаблицаПриемов = Запрос.Выполнить().Выгрузить();
	
	Флаг = Ложь; 	
	Для Каждого СтрокаТЗ Из ТаблицаПриемов Цикл
		
		Флаг = Ложь;   
		Для Каждого СтрокаПеридов Из ИнтервалыРаботы Цикл
			
			НачалоПериода	= СтрокаПеридов.Значение.НачалоРаботы;
			КонецПериода	= СтрокаПеридов.Значение.ОкончаниеРаботы;
			
			НачалоПериода	= НачалоДня(Дата) + Час(НачалоПериода)*60*60 + Минута(НачалоПериода)*60 + Секунда(НачалоПериода);
			КонецПериода	= НачалоДня(Дата) + Час(КонецПериода)*60*60	 + Минута(КонецПериода)*60  + Секунда(КонецПериода);
			
			// Если (Результат.ДатаНачала >= ЭлементСписка.Значение.НачалоРаботы И Результат.ДатаНачала < ЭлементСписка.Значение.ОкончаниеРаботы)
			// 	ИЛИ (Результат.ДатаНачала <= ЭлементСписка.Значение.НачалоРаботы И Результат.ДатаОкончания > ЭлементСписка.Значение.НачалоРаботы) Тогда
			
			Если СтрокаТЗ.ДатаНачала >= НачалоПериода и СтрокаТЗ.ДатаОкончания <= КонецПериода Тогда
				Флаг = Истина;			
			КонецЕсли;
			
			// уже есть период графика работ, в который входит прием.
			Если флаг Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;   
		
		Если Не Флаг Тогда
			Прервать;					
		КонецЕсли; 		
			
	КонецЦикла;
	
	Возврат	?(ТаблицаПриемов.Количество() > 0, Флаг, Истина);
	
КонецФункции

&НаКлиенте
// Процедура - Обработчик события "ПриАктивизацииОбласти".
//
Процедура ГрафикПериодовРаботыТабДокПриАктивизацииОбласти(Элемент)
	
	Если ЕстьПравоРедактирования Тогда
		ИмяОбласти = Элементы.ГрафикПериодовРаботыТабДок.ТекущаяОбласть.Имя; 
		
		Элементы.ГрафикПериодовРаботыТабДок.КонтекстноеМеню.ПодчиненныеЭлементы.ГрафикПериодовРаботыТабДокКонтекстноеМенюГруппаУдалить.ПодчиненныеЭлементы.ГрафикПериодовРаботыТабДокКонтекстноеМенюКомандаУдалитьВыбранные.Доступность = Истина;
		Элементы.ГрафикПериодовРаботыТабДок.КонтекстноеМеню.ПодчиненныеЭлементы.ГрафикПериодовРаботыТабДокКонтекстноеМенюГруппаУдалить.ПодчиненныеЭлементы.ГрафикПериодовРаботыТабДокКонтекстноеМенюКомандаУдалитьЗаПериод.Доступность = Истина;
		Элементы.ГрафикПериодовРаботыТабДок.КонтекстноеМеню.ПодчиненныеЭлементы.ГрафикПериодовРаботыТабДокКонтекстноеМенюГруппаСкопировать.Доступность = Истина;
		
		Элементы.ГрафикПериодовРаботыТабДок.КонтекстноеМеню.Доступность = НЕ ВыделенаНеКорректнаяОбласть(ИмяОбласти);
		
		ДанныеЯчейки = ПолучитьДанныеВыделеннойОбластиГрафикПериодовРаботыТабДок(ИмяОбласти);
		
		Если ДанныеЯчейки.ВыбПериод <> Неопределено Тогда
			
			ДнПрописью   = ДеньНеделиПрописью(ДеньНедели(ДанныеЯчейки.ВыбПериод), , Истина);
			
			Элементы.ГрафикПериодовРаботыТабДокКонтекстноеМенюКнопкаСкопироватьДеньСПредыдущейНедели.Заголовок = ДнПрописью;
			
			ИндексКартинки = ДеньНеделиПрописью(ДеньНедели(ДанныеЯчейки.ВыбПериод));
			
			//Элементы.ГрафикПериодовРаботыТабДокКонтекстноеМенюКнопкаСкопироватьДеньСПредыдущейНедели.Картинка = БиблиотекаКартинок[ИндексКартинки];
			//Элементы.ГрафикПериодовРаботыТабДокКонтекстноеМенюКомандаУдалитьЗаПериод.Картинка = БиблиотекаКартинок[ИндексКартинки];
			
			ДнПрописью = ДеньНеделиПрописью(ДеньНедели(ДанныеЯчейки.ВыбПериод), Истина);
			Элементы.ГрафикПериодовРаботыТабДокКонтекстноеМенюКомандаУдалитьЗаПериод.Заголовок = "По """ + ДнПрописью + """";
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Функция вернет день недеи прописью
// 
Функция ДеньНеделиПрописью(НомерДняНедели, ВСклонении1 = Ложь, ВСклонении2 = Ложь)
	
	Если НомерДняНедели = 1 Тогда
		Возврат ?(ВСклонении2, "Прошлый понедельник", ?(ВСклонении1 = Истина, "Понедельникам", "Понедельник"));
	ИначеЕсли НомерДняНедели = 2 Тогда
	    Возврат ?(ВСклонении2, "Прошлый вторник", ?(ВСклонении1 = Истина, "Вторникам", "Вторник"));
	ИначеЕсли НомерДняНедели = 3 Тогда
	    Возврат ?(ВСклонении2, "Прошлую среду", ?(ВСклонении1 = Истина, "Средам", "Среда"));
	ИначеЕсли НомерДняНедели = 4 Тогда
	    Возврат ?(ВСклонении2, "Прошлый четверг", ?(ВСклонении1 = Истина, "Четвергам", "Четверг"));
	ИначеЕсли НомерДняНедели = 5 Тогда
	    Возврат ?(ВСклонении2, "Прошлую пятницу", ?(ВСклонении1 = Истина, "Пятницам", "Пятница"));
	ИначеЕсли НомерДняНедели = 6 Тогда
	    Возврат ?(ВСклонении2, "Прошлую субботу", ?(ВСклонении1 = Истина, "Субботам", "Суббота"));
	ИначеЕсли НомерДняНедели = 7 Тогда
	    Возврат ?(ВСклонении2, "Прошлое воскресенье", ?(ВСклонении1 = Истина, "Воскресеньям", "Воскресенье"));
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Функция проверяет корректность выделенной области для доступности контекстного меню.
//
Функция ВыделенаНеКорректнаяОбласть(ИмяОбласти)
	
	Если НЕ ЗначениеЗаполнено(ИмяОбласти) Тогда
		Возврат Истина;
	КонецЕсли;
		
	Позиция_Двоеточие 	= СтрНайти(Имяобласти,":");
	
	ПерваяЧастьОбласти = Сред(ИмяОбласти, 1, Позиция_Двоеточие - 1);
	Позиция1Области    = СтрНайти(ПерваяЧастьОбласти, "C");      
	
	ВторояЧастьОбласти = Сред(ИмяОбласти, Позиция_Двоеточие + 1);
	Позиция2Области    = СтрНайти(ВторояЧастьОбласти, "C");   
	
	Попытка
		НомерКолонкиНачало = Число(Сред(ПерваяЧастьОбласти, Позиция1Области + 1));
		Если НомерКолонкиНачало = 1  Тогда
			Элементы.ГрафикПериодовРаботыТабДок.КонтекстноеМеню.ПодчиненныеЭлементы.ГрафикПериодовРаботыТабДокКонтекстноеМенюГруппаУдалить.ПодчиненныеЭлементы.ГрафикПериодовРаботыТабДокКонтекстноеМенюКомандаУдалитьВыбранные.Доступность = Ложь;
			Элементы.ГрафикПериодовРаботыТабДок.КонтекстноеМеню.ПодчиненныеЭлементы.ГрафикПериодовРаботыТабДокКонтекстноеМенюГруппаУдалить.ПодчиненныеЭлементы.ГрафикПериодовРаботыТабДокКонтекстноеМенюКомандаУдалитьЗаПериод.Доступность = Ложь;
			Элементы.ГрафикПериодовРаботыТабДок.КонтекстноеМеню.ПодчиненныеЭлементы.ГрафикПериодовРаботыТабДокКонтекстноеМенюГруппаСкопировать.Доступность = Ложь;
		КонецЕсли;
		
		Если НомерКолонкиНачало > 1 И НомерКолонкиНачало < 5 Тогда
			Возврат Истина;
		КонецЕсли;
	Исключение
		Возврат Истина;
	КонецПопытки;
	
	Попытка 
		НомерСтрокиНачало = Число(Сред(ПерваяЧастьОбласти, 2, Позиция1Области - 2));
		Если НомерСтрокиНачало <= 1 тогда
			Возврат Истина;
		КонецЕсли;
	Исключение
		Возврат Истина;
	КонецПопытки;
	
	Попытка
		НомерКолонкиКонец = Число(Сред(ВторояЧастьОбласти, Позиция2Области + 1));
	Исключение
		Возврат Истина;
	КонецПопытки;
	
	Попытка 
		НомерСтрокиКонец = Число(Сред(ВторояЧастьОбласти, 2, Позиция2Области - 2));
	Исключение
		Возврат Истина;
	КонецПопытки;
	
	//Если НомерКолонкиКонец - НомерКолонкиНачало > 0
	//	ИЛИ НомерСтрокиКонец - НомерСтрокиНачало > 1 Тогда
	//	
	//	Возврат Истина;
	//КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить сотрудников группы
//
// Параметры:
//  Группа	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСотрудниковГруппы(Группа) 

	Запрос = Новый Запрос;
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	Сотрудники.Ссылка КАК Ссылка
	 |ИЗ
	 |	Справочник.Сотрудники КАК Сотрудники
	 |ГДЕ
	 |	Сотрудники.Ссылка В ИЕРАРХИИ(&Группа)
	 |	И Сотрудники.ЭтоГруппа = ЛОЖЬ
	 |	И Сотрудники.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Группа", Группа);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
КонецФункции

#КонецОбласти