
#Область СлужебныеПроцедурыИФункции 

#Область МетодыGET

#Область book_services

// Функция возвращает список услуг, доступных для бронирования.
//
Функция book_services(СтруктурнаяЕдиница, datetime, staff_id, ДляЧатБота = Ложь) Экспорт

	СтруктураОшибки = Неопределено;
	
	ДатаСреза = ПолучитьИПроверитьДату(datetime, СтруктураОшибки);
	Сотрудник = ПолучитьСсылкуПоИдентификатору(staff_id, СтруктураОшибки, Истина, "Сотрудники", 1050);
	
	Если ЗначениеЗаполнено(СтруктураОшибки) Тогда
		Возврат СтруктураОшибки;
	КонецЕсли;
	
	ДатаСрезаЗаполнена = ЗначениеЗаполнено(ДатаСреза);
	ДатаСреза 		   = ПолучитьДатуСреза(ДатаСреза, ДатаСрезаЗаполнена);
	СотрудникПередан   = ЗначениеЗаполнено(Сотрудник);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыОбъектов.Объект КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА НастройкиСотрудников.ВидЦен = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЦен.Розничная)
	|		ИНАЧЕ НастройкиСотрудников.ВидЦен
	|	КОНЕЦ КАК ВидЦен
	|ПОМЕСТИТЬ ТаблицаРаботающиеСотрудникиСВидомЦен
	|ИЗ
	|	РегистрСведений.РеквизитыОбъектов КАК РеквизитыОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|		ПО РеквизитыОбъектов.Объект = НастройкиСотрудников.Сотрудник
	|ГДЕ
	|	НЕ РеквизитыОбъектов.Объект.ПометкаУдаления
	|	И РеквизитыОбъектов.Значение = ИСТИНА
	|	И РеквизитыОбъектов.Реквизит = ""ОнлайнЗаписьСотрудник""
	|	И РеквизитыОбъектов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И РеквизитыОбъектов.Объект ССЫЛКА Справочник.Сотрудники
	|	И НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И (ВЫРАЗИТЬ(РеквизитыОбъектов.Объект КАК Справочник.Сотрудники).Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.Врач)
	|			ИЛИ ВЫРАЗИТЬ(РеквизитыОбъектов.Объект КАК Справочник.Сотрудники).Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.ГлавныйВрач))
	|	И &УсловиеСотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыОбъектов.Объект КАК Номенклатура
	|ПОМЕСТИТЬ ВременнаяТаблицаДоступныхНоменклатур
	|ИЗ
	|	РегистрСведений.РеквизитыОбъектов КАК РеквизитыОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыНоменклатуры.СрезПоследних(&ДатаСреза, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК СтатусыНоменклатурыСрезПоследних
	|		ПО РеквизитыОбъектов.Объект = СтатусыНоменклатурыСрезПоследних.Номенклатура
	|ГДЕ
	|	РеквизитыОбъектов.Объект ССЫЛКА Справочник.Номенклатура
	|	И НЕ РеквизитыОбъектов.Объект.ПометкаУдаления
	|	И РеквизитыОбъектов.Объект.НормаВремени <> 0
	|	И НЕ РеквизитыОбъектов.Объект.ЭтоГруппа
	|	И РеквизитыОбъектов.Объект.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И РеквизитыОбъектов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И РеквизитыОбъектов.Значение = ИСТИНА
	|	И РеквизитыОбъектов.Реквизит = ""ОнлайнЗапись""
	|	И ЕСТЬNULL(СтатусыНоменклатурыСрезПоследних.ВПродаже, ИСТИНА) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.СтруктурнаяЕдиница <> &СтруктурнаяЕдиница КАК СетеваяЦена,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ПОМЕСТИТЬ ВременнаяТаблицаНоменклатура
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаСреза,
	|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И ВидЦен В
	|					(ВЫБРАТЬ
	|						ТаблицаРаботающиеСотрудникиСВидомЦен.ВидЦен
	|					ИЗ
	|						ТаблицаРаботающиеСотрудникиСВидомЦен)
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ВременнаяТаблицаДоступныхНоменклатур.Номенклатура
	|					ИЗ
	|						ВременнаяТаблицаДоступныхНоменклатур)) КАК ЦеныНоменклатурыСрезПоследних
	|ГДЕ
	|	ЦеныНоменклатурыСрезПоследних.Цена <> 0
	|	И НЕ ЦеныНоменклатурыСрезПоследних.Номенклатура.Бесплатно
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаДоступныхНоменклатур.Номенклатура,
	|	ЛОЖЬ,
	|	0
	|ИЗ
	|	ВременнаяТаблицаДоступныхНоменклатур КАК ВременнаяТаблицаДоступныхНоменклатур
	|ГДЕ
	|	ВременнаяТаблицаДоступныхНоменклатур.Номенклатура.Бесплатно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	УслугиСотрудника.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(УслугиСотрудника.Номенклатура.НаименованиеПолное КАК СТРОКА(300))) = """"
	|			ТОГДА УслугиСотрудника.Номенклатура.Наименование
	|		ИНАЧЕ ВЫРАЗИТЬ(УслугиСотрудника.Номенклатура.НаименованиеПолное КАК СТРОКА(300))
	|	КОНЕЦ КАК Наименование,
	|	ВЫБОР
	|		КОГДА УслугиСотрудника.НормаВремени <> 0
	|			ТОГДА УслугиСотрудника.НормаВремени
	|		ИНАЧЕ УслугиСотрудника.Номенклатура.НормаВремени
	|	КОНЕЦ КАК НормаВремениПоСотруднику,
	|	УслугиСотрудника.Номенклатура.НормаВремени КАК НормаВремени,
	|	ВЫБОР
	|		КОГДА НЕ УслугиСотрудника.Номенклатура.ГруппаОнлайнЗаписи.ПометкаУдаления
	|			ТОГДА УслугиСотрудника.Номенклатура.ГруппаОнлайнЗаписи
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Категория,
	|	УслугиСотрудника.Номенклатура.ГруппаОнлайнЗаписи.Наименование КАК КатегорияНаименование,
	|	УслугиСотрудника.Сотрудник КАК Сотрудник,
	|	ВЫРАЗИТЬ(УслугиСотрудника.Номенклатура.ОписаниеДляОнлайнЗаписи КАК СТРОКА(1000)) КАК Комментарий
	|ИЗ
	|	РегистрСведений.УслугиСотрудника КАК УслугиСотрудника
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРаботающиеСотрудникиСВидомЦен КАК ТаблицаРаботающиеСотрудникиСВидомЦен
	|		ПО УслугиСотрудника.Сотрудник = ТаблицаРаботающиеСотрудникиСВидомЦен.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНоменклатура КАК ВременнаяТаблицаНоменклатура
	|		ПО УслугиСотрудника.Номенклатура = ВременнаяТаблицаНоменклатура.Номенклатура
	|ГДЕ
	|	УслугиСотрудника.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И &УсловиеУслугиСотрудника
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА УслугиСотрудника.Номенклатура.ГруппаОнлайнЗаписи.ИндексСортировки = 0
	|				ИЛИ УслугиСотрудника.Номенклатура.ГруппаОнлайнЗаписи = ЗНАЧЕНИЕ(Справочник.ГруппыОнлайнЗаписи.ПустаяСсылка)
	|				ИЛИ УслугиСотрудника.Номенклатура.ГруппаОнлайнЗаписи.ПометкаУдаления
	|			ТОГДА 999999
	|		ИНАЧЕ УслугиСотрудника.Номенклатура.ГруппаОнлайнЗаписи.ИндексСортировки
	|	КОНЕЦ,
	|	УслугиСотрудника.Номенклатура.ГруппаОнлайнЗаписи.Наименование,
	|	ВЫБОР
	|		КОГДА УслугиСотрудника.Номенклатура.ИндексСортировки = 0
	|			ТОГДА 999999
	|		ИНАЧЕ УслугиСотрудника.Номенклатура.ИндексСортировки
	|	КОНЕЦ,
	|	УслугиСотрудника.Номенклатура.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРаботающиеСотрудникиСВидомЦен.Сотрудник КАК Сотрудник
	|ИЗ
	|	ТаблицаРаботающиеСотрудникиСВидомЦен КАК ТаблицаРаботающиеСотрудникиСВидомЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаНоменклатура.Номенклатура КАК Номенклатура,
	|	ВременнаяТаблицаНоменклатура.СетеваяЦена КАК СетеваяЦена,
	|	ВременнаяТаблицаНоменклатура.Цена КАК Цена
	|ИЗ
	|	ВременнаяТаблицаНоменклатура КАК ВременнаяТаблицаНоменклатура");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ДатаСреза"		  , ДатаСреза);
	Запрос.УстановитьПараметр("Сотрудник"		  , Сотрудник);
	
	УсловиеСотрудник = ?(СотрудникПередан, "И РеквизитыОбъектов.Объект = &Сотрудник", "");
	Запрос.Текст     = СтрЗаменить(Запрос.Текст, "И &УсловиеСотрудник", УсловиеСотрудник);
	
	УсловиеУслугиСотрудника = ?(СотрудникПередан, "И УслугиСотрудника.Сотрудник = &Сотрудник", "");
	Запрос.Текст     = СтрЗаменить(Запрос.Текст, "И &УсловиеУслугиСотрудника", УсловиеУслугиСотрудника);
	
	ПакетЗапросов 	   = Запрос.ВыполнитьПакет();
	ТаблицаУслуг 	   = ПакетЗапросов[3].Выгрузить();
	ТаблицаСотрудников = ПакетЗапросов[4].Выгрузить();
	ТаблицаВидовЦен    = ПакетЗапросов[5].Выгрузить();
	
	ТаблицаМаксИнтерваловСотрудников = РегистрыСведений.СвободныеИнтервалыСотрудников.ПолучитьМаксимальныйИнтервалПоСотрудникам(
		СтруктурнаяЕдиница,
		ТаблицаСотрудников.ВыгрузитьКолонку("Сотрудник"),
		?(ДатаСрезаЗаполнена, ДатаСреза, Неопределено));
		
	ТаблицаДобавленныхУслуг = Новый ТаблицаЗначений;
	ТаблицаДобавленныхУслуг.Колонки.Добавить("Номенклатура");
	ТаблицаДобавленныхУслуг.Колонки.Добавить("СтрокаНоменклатуры");
	
	Для Каждого СтрокаТЧ Из ТаблицаУслуг Цикл
		
		Если ТаблицаДобавленныхУслуг.НайтиСтроки(Новый Структура("Номенклатура", СтрокаТЧ.Номенклатура)).Количество() = 0 Тогда
			
			МассивСтрок = ТаблицаМаксИнтерваловСотрудников.НайтиСтроки(Новый Структура("Сотрудник", СтрокаТЧ.Сотрудник));
			
			Если МассивСтрок.Количество() > 0 И МассивСтрок[0].МаксимальнаяДлительность >= СтрокаТЧ.НормаВремениПоСотруднику Тогда
				
				НоваяСтрока = ТаблицаДобавленныхУслуг.Добавить();
				НоваяСтрока.Номенклатура 	   = СтрокаТЧ.Номенклатура;
				НоваяСтрока.СтрокаНоменклатуры = СтрокуТаблицыЗначенийВСтруктуру(СтрокаТЧ, "Номенклатура,Наименование,Категория,КатегорияНаименование,НормаВремени,НормаВремениПоСотруднику,Комментарий");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаОдновременныхУслуг 		  = Неопределено;
	
	МассивУслуг 	 = Новый Массив;
	ИндексСортировки = 0;
	Для Каждого СтрокаТЧ Из ТаблицаДобавленныхУслуг Цикл
		
		МассивОдновременныхУслуг = Новый Массив;
		МассивУслуг.Добавить(ПолучитьСтруктуруУслуги(СтрокаТЧ.СтрокаНоменклатуры, СотрудникПередан, ТаблицаВидовЦен, МассивОдновременныхУслуг, ИндексСортировки, ДляЧатБота));
		ИндексСортировки = ИндексСортировки + 1;
		
	КонецЦикла;
	
	Возврат Новый Структура("Parameters, Errors", МассивУслуг, ПолучитьСтруктуруВозвратаОшибки(,, Истина));
	
КонецФункции

// Функция, возвращает структуру услуги.
// 
Функция ПолучитьСтруктуруУслуги(СтрокаТЧ, СотрудникПередан, ТаблицаВидовЦен, МассивОдновременныхУслуг, ИндексСортировки, ДляЧатБота = Ложь)
	
	СтруктураЦен = ПолучитьЦеныНоменклатуры(СтрокаТЧ.Номенклатура, ТаблицаВидовЦен);
	
	ДанныеУслуги = Новый Структура;
	Если ДляЧатБота Тогда 
		ДанныеУслуги.Вставить("service"	, СтрокаТЧ.Номенклатура);
	КонецЕсли;		
	ДанныеУслуги.Вставить("id"		  		, Строка(СтрокаТЧ.Номенклатура.УникальныйИдентификатор()));
	ДанныеУслуги.Вставить("title"	  		, СтрокаТЧ.Наименование);
	ДанныеУслуги.Вставить("category"  		, ПолучитьСтруктуру_id_title(СтрокаТЧ.Категория, СтрокаТЧ.КатегорияНаименование, Истина));
	ДанныеУслуги.Вставить("price_min" 		, СтруктураЦен.МинимальнаяЦена);
	ДанныеУслуги.Вставить("price_max" 		, СтруктураЦен.МаксимальнаяЦена);
	ДанныеУслуги.Вставить("comment"   		, СтрокаТЧ.Комментарий);
	ДанныеУслуги.Вставить("active"	  		, Истина);
	ДанныеУслуги.Вставить("length"    		, ?(СотрудникПередан, СтрокаТЧ.НормаВремениПоСотруднику, СтрокаТЧ.НормаВремени));
	
	Если Не СотрудникПередан Тогда
		
		ДанныеУслуги.Вставить("ServicesAtSameTime", Новый Массив);
		
		Для Каждого ОдновременнаяУслуга Из МассивОдновременныхУслуг Цикл
			ДанныеУслуги.ServicesAtSameTime.Добавить(Строка(ОдновременнаяУслуга.УникальныйИдентификатор()));
		КонецЦикла;
		
	КонецЕсли;
	
	ДанныеУслуги.Вставить("sort_index", ИндексСортировки);
	
	Возврат ДанныеУслуги;
	
КонецФункции

#КонецОбласти

#Область book_staff

// Функция, возвращает список сотрудников доступных для бронирования.
// 
Функция book_staff(СтруктурнаяЕдиница, datetime, service_ids, service_id, БазовыйURL = "", ApiKey = "", ДляЧатБота = Ложь, ВнешняяСистема = Неопределено) Экспорт
	
	СтруктураОшибки = Неопределено;
	
	МассивУслуг = ПолучитьМассивУслугПоИдентификаторам(service_ids, service_id, СтруктураОшибки);
	ДатаСреза   = ПолучитьИПроверитьДату(datetime, СтруктураОшибки);
	
	Если ЗначениеЗаполнено(СтруктураОшибки) Тогда
		Возврат СтруктураОшибки;
	КонецЕсли;
	
	
	ДатаСрезаЗаполнена 			 = ЗначениеЗаполнено(ДатаСреза);
	ДатаСреза 		   			 = ПолучитьДатуСреза(ДатаСреза, ДатаСрезаЗаполнена, СтруктурнаяЕдиница);
	ПроверятьВремяДействияУслуги = МассивУслуг.Количество() = 1;
	
	Если МассивУслуг.Количество() > 1 Тогда
		ТаблицаСотрудников = ПолучитьСотрудниковСпособныхОказатьМассивУслуг(СтруктурнаяЕдиница, МассивУслуг, ДатаСреза);
	Иначе
		ТаблицаСотрудников = ПолучитьСотрудниковСНормойВремени(СтруктурнаяЕдиница, МассивУслуг, ДатаСреза);
	КонецЕсли;
	
	МассивСотрудников = Новый Массив;
	
	ТаблицаДоступныхДнейПоСотрудникам = Новый ТаблицаЗначений;
	ТаблицаДоступныхДнейПоСотрудникам.Колонки.Добавить("Сотрудник");
	ТаблицаДоступныхДнейПоСотрудникам.Колонки.Добавить("ДоступныйДень");
	ТаблицаДоступныхДнейПоСотрудникам.Колонки.Добавить("СтрокаСДаннымиСотрудника");
	
	Если ТаблицаСотрудников.Количество() > 0 Тогда
		
		ТаблицаИнтервалов = ПолучитьСвободныеИнтервалы(
			СтруктурнаяЕдиница, 
			ТаблицаСотрудников.ВыгрузитьКолонку("Сотрудник"),, 
			?(ДатаСрезаЗаполнена, ДатаСреза, Неопределено),,
			Не ДатаСрезаЗаполнена,
		    ВнешняяСистема);
		
		Для Каждого СтрокаТЧ Из ТаблицаИнтервалов Цикл
			
			СтрокаСДаннымиСотрудника = ТаблицаСотрудников.НайтиСтроки(Новый Структура("Сотрудник", СтрокаТЧ.Сотрудник))[0];
			МинНормаВремени 		 = СтрокаСДаннымиСотрудника.НормаВремени;
			
			Если СтрокаТЧ.Длительность >= МинНормаВремени
				И ТаблицаДоступныхДнейПоСотрудникам.НайтиСтроки(Новый Структура("Сотрудник, ДоступныйДень", СтрокаТЧ.Сотрудник, СтрокаТЧ.ДеньИнтервала)).Количество() = 0 
				И НачалоДня(ДатаСреза) <= НачалоДня(СтрокаТЧ.ДеньИнтервала) Тогда
				
				НоваяСтрока 			  			 = ТаблицаДоступныхДнейПоСотрудникам.Добавить();
				НоваяСтрока.Сотрудник 	  			 = СтрокаТЧ.Сотрудник;
				НоваяСтрока.ДоступныйДень 			 = СтрокаТЧ.ДеньИнтервала;
				НоваяСтрока.СтрокаСДаннымиСотрудника = СтрокаСДаннымиСотрудника;
			КонецЕсли;
			
		КонецЦикла;
		
		МассивДобавленныхСотрудников = Новый Массив;
		Для Каждого СтрокаТЗ Из ТаблицаДоступныхДнейПоСотрудникам Цикл
			
			Если МассивДобавленныхСотрудников.Найти(СтрокаТЗ.Сотрудник) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			МассивСтрокПоСотруднику   = ТаблицаДоступныхДнейПоСотрудникам.НайтиСтроки(Новый Структура("Сотрудник", СтрокаТЗ.Сотрудник));
			МассивДоступныхДней 	  = Новый Массив;
			КоличествоДобавленныхДней = 0;
			
			Для Каждого СтрокаДоступныйДень Из МассивСтрокПоСотруднику Цикл
				
				МассивДоступныхДней.Добавить(СтрокаДоступныйДень.ДоступныйДень);
				
				КоличествоДобавленныхДней = КоличествоДобавленныхДней + 1;
				
				Если КоличествоДобавленныхДней = 3 Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			МассивСотрудников.Добавить(ПолучитьСтруктуруСотрудника(СтруктурнаяЕдиница, СтрокаТЗ.СтрокаСДаннымиСотрудника, БазовыйURL, ApiKey, МассивДоступныхДней, ДляЧатБота));
			МассивДобавленныхСотрудников.Добавить(СтрокаТЗ.Сотрудник);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если МассивСотрудников.Количество() = 0 И МассивУслуг.Количество() > 1 Тогда
		Возврат ПолучитьСтруктуруВозвратаОшибки(1080);
	КонецЕсли;
	
	Возврат Новый Структура("Parameters, Errors", МассивСотрудников, ПолучитьСтруктуруВозвратаОшибки(,, Истина));
	
КонецФункции

// Функция, возвращает структуру сотрудника.
// 
Функция ПолучитьСтруктуруСотрудника(СтруктурнаяЕдиница, СтрокаТЧ, БазовыйURL = "", ApiKey = "", МассивДоступныхДней, ДляЧатБота = Ложь) Экспорт
	
	АдресКартинки = Неопределено;
	Если ЗначениеЗаполнено(СтрокаТЧ.РасширениеФото) Тогда
		АдресКартинки = "" + БазовыйURL + "/files/" + ApiKey + "/" + Строка(СтрокаТЧ.Сотрудник.УникальныйИдентификатор()) + "-" + Формат(СтрокаТЧ.РазмерФото, "ЧГ=") + "." + СтрокаТЧ.РасширениеФото;
	КонецЕсли;
	
	ДанныеСотрудника = Новый Структура;
	Если ДляЧатБота Тогда 
		ДанныеСотрудника.Вставить("staff"  		, СтрокаТЧ.Сотрудник);
	КонецЕсли;	
	ДанныеСотрудника.Вставить("id"  		  	, Строка(СтрокаТЧ.Сотрудник.УникальныйИдентификатор()));
	ДанныеСотрудника.Вставить("name" 		  	, СтрокаТЧ.Наименование);
	ДанныеСотрудника.Вставить("specialization"	, ПолучитьСтруктуру_id_title(СтрокаТЧ.Должность, СтрокаТЧ.ДолжностьНаименование, Истина));
	ДанныеСотрудника.Вставить("weight"        	, СтрокаТЧ.Вес);
	ДанныеСотрудника.Вставить("information"   	, ПолучитьЗначениеРеквизита(СтрокаТЧ.Сотрудник, "ОписаниеДляСайтаHTML"));
	ДанныеСотрудника.Вставить("avatar"        	, АдресКартинки);
	ДанныеСотрудника.Вставить("upcoming_dates"	, МассивДоступныхДней);
	
	
	ДанныеСотрудника.Вставить("ratings"       , Новый Массив);
	ДанныеСотрудника.Вставить("comments_count", 0);
			
	Возврат ДанныеСотрудника;
	
КонецФункции

#КонецОбласти

#Область book_dates

// Функция возвращает список дат, доступных для бронирования.
// 
Функция book_dates(СтруктурнаяЕдиница, start_date, end_date, service_ids, service_id, staff_id, ВнешняяСистема) Экспорт
	
	СтруктураОшибки = Неопределено;
	
	НачалоПериода = ПолучитьНачалоПериода(start_date, СтруктураОшибки, Истина, Истина);
	КонецПериода  = ПолучитьКонецПериода(end_date	, СтруктураОшибки, Истина);
	МассивУслуг	  = ПолучитьМассивУслугПоИдентификаторам(service_ids, service_id, СтруктураОшибки);
	Сотрудник 	  = ПолучитьСсылкуПоИдентификатору(staff_id, СтруктураОшибки, Истина, "Сотрудники", 1050);
	
	Если ЗначениеЗаполнено(СтруктураОшибки) Тогда
		Возврат СтруктураОшибки;
	КонецЕсли;
	
	ПроверятьВремяДействияУслуги = МассивУслуг.Количество() = 1;
	МассивДоступныхДней 		 = Новый Массив;
	ТаблицаСотрудников  		 = ПолучитьСотрудниковСНормойВремени2(СтруктурнаяЕдиница, Сотрудник, МассивУслуг, ТекущаяДатаСеанса());
	
	Если ТаблицаСотрудников.Количество() > 0 Тогда
		
		ВремТаблицаСотрудников = ТаблицаСотрудников.Скопировать(,"Сотрудник");
		ВремТаблицаСотрудников.Свернуть("Сотрудник");
		
		МассивСотрудников = ВремТаблицаСотрудников.ВыгрузитьКолонку("Сотрудник");
		ТаблицаИнтервалов = ПолучитьСвободныеИнтервалы(СтруктурнаяЕдиница, МассивСотрудников,, НачалоПериода, КонецПериода,, ВнешняяСистема);
		
		Если ПроверятьВремяДействияУслуги Тогда
			ДатаВПродажеДо = ПолучитьДатуОкончанияПродажиНоменклатуры(СтруктурнаяЕдиница, МассивУслуг[0]);
		КонецЕсли;
		
		Для Каждого СтрокаТЧ Из ТаблицаИнтервалов Цикл
			
			Если ПроверятьВремяДействияУслуги И ЗначениеЗаполнено(ДатаВПродажеДо) И НачалоДня(ДатаВПродажеДо) <= СтрокаТЧ.ДеньИнтервала Тогда
				Прервать;
			КонецЕсли;
			
			МассивСтрок = ТаблицаСотрудников.НайтиСтроки(Новый Структура("Сотрудник", СтрокаТЧ.Сотрудник));
			
			Если Не ЗначениеЗаполнено(МассивУслуг) ИЛИ МассивСтрок.Количество() = МассивУслуг.Количество() Тогда
				
				Если ЗначениеЗаполнено(МассивУслуг) Тогда
					
					МинНормаВремени = 0;
					Для Каждого НайденнаяСтрока Из МассивСтрок Цикл
						МинНормаВремени = МинНормаВремени + НайденнаяСтрока.НормаВремениПоСотруднику;
					КонецЦикла;
					
				Иначе
					МинНормаВремени = МассивСтрок[0].НормаВремениПоСотруднику;
				КонецЕсли;
				
				Если МассивДоступныхДней.Найти(СтрокаТЧ.ДеньИнтервала) = Неопределено
					И СтрокаТЧ.Длительность >= МинНормаВремени Тогда
					
					МассивДоступныхДней.Добавить(СтрокаТЧ.ДеньИнтервала);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Новый Структура("Parameters, Errors", МассивДоступныхДней, ПолучитьСтруктуруВозвратаОшибки(,, Истина));
	
КонецФункции

// Функция - Re book dates
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  start_date			 - 	 - 
//  end_date			 - 	 - 
//  service_ids			 - 	 - 
//  service_id			 - 	 - 
//  staff_id			 - 	 - 
//  ВнешняяСистема		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция re_book_dates(СтруктурнаяЕдиница
					, start_date
					, end_date
					, service_ids
					, service_id
					, staff_id
					, ВнешняяСистема					
					, reason_entry_id
					, duration = 0) Экспорт

	
	СтруктураОшибки = Неопределено;
	
	НачалоПериода 	= ПолучитьНачалоПериода(start_date, СтруктураОшибки, Истина, Истина);
	КонецПериода  	= ПолучитьКонецПериода(end_date	, СтруктураОшибки, Истина);
	МассивУслуг	  	= ПолучитьМассивУслугПоИдентификаторам(service_ids, service_id, СтруктураОшибки);
	Сотрудник 	  	= ПолучитьСсылкуПоИдентификатору(staff_id, СтруктураОшибки, Истина, "Сотрудники", 1050);
	ПричинаЗаписи	= ПолучитьСсылкуПоИдентификатору(reason_entry_id	, СтруктураОшибки	,		, "ПричиныЗаписи"	, 1130);
	Длительность	= duration;
	
	Если ЗначениеЗаполнено(СтруктураОшибки) Тогда
		Возврат СтруктураОшибки;
	КонецЕсли;
	
	ПроверятьВремяДействияУслуги = МассивУслуг.Количество() = 1;
	МассивДоступныхДней 		 = Новый Массив;
	ТаблицаСотрудников  		 = ПолучитьСотрудниковСНормойВремениДляПерезаписи(СтруктурнаяЕдиница, Сотрудник, МассивУслуг);
	
	Если ТаблицаСотрудников.Количество() > 0 Тогда
		
		ВремТаблицаСотрудников = ТаблицаСотрудников.Скопировать(,"Сотрудник");
		ВремТаблицаСотрудников.Свернуть("Сотрудник");
		
		МассивСотрудников = ВремТаблицаСотрудников.ВыгрузитьКолонку("Сотрудник");
		ТаблицаИнтервалов = ПолучитьСвободныеИнтервалы(СтруктурнаяЕдиница, МассивСотрудников,, НачалоПериода, КонецПериода,, ВнешняяСистема);
		
		Если ПроверятьВремяДействияУслуги Тогда
			ДатаВПродажеДо = ПолучитьДатуОкончанияПродажиНоменклатуры(СтруктурнаяЕдиница, МассивУслуг[0]);
		КонецЕсли;
		
		Для Каждого СтрокаТЧ Из ТаблицаИнтервалов Цикл
			
			Если ПроверятьВремяДействияУслуги И ЗначениеЗаполнено(ДатаВПродажеДо) И НачалоДня(ДатаВПродажеДо) <= СтрокаТЧ.ДеньИнтервала Тогда
				Прервать;
			КонецЕсли;
			
			МассивСтрок = ТаблицаСотрудников.НайтиСтроки(Новый Структура("Сотрудник", СтрокаТЧ.Сотрудник));
			
			Если Не ЗначениеЗаполнено(МассивУслуг) ИЛИ МассивСтрок.Количество() = МассивУслуг.Количество() Тогда
				
				Если ЗначениеЗаполнено(МассивУслуг) Тогда
					
					МинНормаВремени = 0;
					Для Каждого НайденнаяСтрока Из МассивСтрок Цикл
						МинНормаВремени = МинНормаВремени + НайденнаяСтрока.НормаВремениПоСотруднику;
					КонецЦикла;
				ИначеЕсли ЗначениеЗаполнено(Длительность) Тогда 
					МинНормаВремени = Длительность;
				Иначе
					МинНормаВремени = МассивСтрок[0].НормаВремениПоСотруднику;
				КонецЕсли;
				
				Если МассивДоступныхДней.Найти(СтрокаТЧ.ДеньИнтервала) = Неопределено
					И СтрокаТЧ.Длительность >= МинНормаВремени Тогда
					
					МассивДоступныхДней.Добавить(СтрокаТЧ.ДеньИнтервала);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Новый Структура("Parameters, Errors", МассивДоступныхДней, ПолучитьСтруктуруВозвратаОшибки(,, Истина));
	
КонецФункции

// Функция - Получить конец периода
//
// Параметры:
//  end_date			 - 	 - 
//  СтруктураОшибки		 - 	 - 
//  ОбязательныйПараметр - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКонецПериода(end_date, СтруктураОшибки, ОбязательныйПараметр = Ложь) Экспорт
	
	КонецПериода = Неопределено;
	
	Если ЗначениеЗаполнено(end_date) Тогда
		Если ТипЗнч(end_date) = Тип("Строка") Тогда 
			КонецПериода = ПолучитьДату(end_date);
		ИначеЕсли ТипЗнч(end_date) = Тип("Дата") Тогда 
			КонецПериода = end_date;
		Иначе 
			КонецПериода = Неопределено;
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(КонецПериода) Тогда
			СтруктураОшибки = ПолучитьСтруктуруВозвратаОшибки(1054);
		КонецЕсли;
		
	ИначеЕсли ОбязательныйПараметр Тогда
		СтруктураОшибки = ПолучитьСтруктуруВозвратаОшибки(1052);
	КонецЕсли;
	
	Возврат КонецПериода
	
КонецФункции

#КонецОбласти

#Область book_times

// Функция, возвращает список сеансов, доступных для бронирования.
// 
Функция book_times(СтруктурнаяЕдиница, datetime, service_ids, service_id, staff_id) Экспорт
	
	СтруктураОшибки = Неопределено;
	
	ДатаСреза	  	   = ПолучитьИПроверитьДату(datetime, СтруктураОшибки);
	ДатаСрезаЗаполнена = ЗначениеЗаполнено(ДатаСреза);
	МассивУслуг	  	   = ПолучитьМассивУслугПоИдентификаторам(service_ids, service_id, СтруктураОшибки);
	Сотрудник 	  	   = ПолучитьСсылкуПоИдентификатору(staff_id, СтруктураОшибки, Истина, "Сотрудники", 1050);
	
	Если ЗначениеЗаполнено(СтруктураОшибки) Тогда
		Возврат СтруктураОшибки;
	КонецЕсли;
	
	ПроверятьВремяДействияУслуги = МассивУслуг.Количество() = 1;
	МассивДоступныхСеансов 		 = Новый Массив;	
	ИнтервалОнлайнЗаписи = Константы.ИнтервалОнлайнЗаписи.Получить();
	Если ЗначениеЗаполнено(ИнтервалОнлайнЗаписи) Тогда
		Если ИнтервалОнлайнЗаписи = Перечисления.ИнтервалыВремениЗаписи.Минут5 Тогда
			ДлительностьСлота = 5 * 60;
		ИначеЕсли ИнтервалОнлайнЗаписи = Перечисления.ИнтервалыВремениЗаписи.Минут10 Тогда
			ДлительностьСлота = 10 * 60;
		ИначеЕсли ИнтервалОнлайнЗаписи = Перечисления.ИнтервалыВремениЗаписи.Минут15 Тогда
			ДлительностьСлота = 15 * 60;
		ИначеЕсли ИнтервалОнлайнЗаписи = Перечисления.ИнтервалыВремениЗаписи.Минут30 Тогда
			ДлительностьСлота = 30 * 60;
		ИначеЕсли ИнтервалОнлайнЗаписи = Перечисления.ИнтервалыВремениЗаписи.Минут60 Тогда
			ДлительностьСлота = 60 * 60;
		КонецЕсли;
	Иначе
		ДлительностьСлота = 10 * 60;
	КонецЕсли;

	НачалоПериода 	  	   = ПолучитьДатуСреза(ДатаСреза, ДатаСрезаЗаполнена);
	ТаблицаСотрудников 	   = ПолучитьСотрудниковСНормойВремени2(СтруктурнаяЕдиница, Сотрудник, МассивУслуг, ТекущаяДатаСеанса());
	СтруктураВремениРаботы = Справочники.СтруктурныеЕдиницы.ВремяРаботыСтруктурнойЕдиницы(НачалоПериода, СтруктурнаяЕдиница, ДеньНедели(НачалоПериода), Ложь);
	
	Если ТаблицаСотрудников.Количество() > 0 И СтруктураВремениРаботы <> Неопределено Тогда
		
		ИнтервалЗаписи 	  = Константы.ИнтервалМеждуЗаписями.Получить();
		МассивСотрудников = ТаблицаСотрудников.ВыгрузитьКолонку("Сотрудник");
		НачалоПериода 	  = ?(СтруктураВремениРаботы.НачалоРаботы > НачалоПериода, СтруктураВремениРаботы.НачалоРаботы, НачалоПериода);
		КонецПериода  	  = СтруктураВремениРаботы.ОкончаниеРаботы;
		
		ТаблицаИнтервалов = ПолучитьСвободныеИнтервалы(СтруктурнаяЕдиница, МассивСотрудников,, НачалоПериода, КонецПериода);
		
		Если ИнтервалЗаписи > 0 И ТаблицаИнтервалов.Количество() > 0 Тогда
			
			ТаблицаГрафикаРаботыСотрудников = РегистрыСведений.СвободныеИнтервалыСотрудников.ПолучитьГрафикРаботыСотрудников(
				ТаблицаИнтервалов.ВыгрузитьКолонку("Сотрудник"),
				СтруктурнаяЕдиница,,,
				ТаблицаИнтервалов.ВыгрузитьКолонку("ДеньИнтервала")
			);
			
		КонецЕсли;
		
		ТаблицаЗначенийСеансов = Новый ТаблицаЗначений;
		ТаблицаЗначенийСеансов.Колонки.Добавить("ВремяНачала");	
		ТаблицаЗначенийСеансов.Колонки.Добавить("Структура");
		
		Для Каждого СтрокаТЧ Из ТаблицаИнтервалов Цикл
			
			МассивСтрок = ТаблицаСотрудников.НайтиСтроки(Новый Структура("Сотрудник", СтрокаТЧ.Сотрудник));
			
			Если Не ЗначениеЗаполнено(МассивУслуг) ИЛИ МассивСтрок.Количество() = МассивУслуг.Количество() Тогда
				
				Если ЗначениеЗаполнено(МассивУслуг) Тогда
					
					МинНормаВремени = 0;
					Для Каждого НайденнаяСтрока Из МассивСтрок Цикл
						МинНормаВремени = МинНормаВремени + НайденнаяСтрока.НормаВремениПоСотруднику;
					КонецЦикла;
					
				Иначе
					МинНормаВремени = МассивСтрок[0].НормаВремениПоСотруднику;
				КонецЕсли;
				
				МинНормаВремени = МинНормаВремени * 60;
				
				Если ИнтервалЗаписи > 0 Тогда
					
					Если ТаблицаГрафикаРаботыСотрудников.НайтиСтроки(Новый Структура("Сотрудник, ДатаВремяНачала", 
							СтрокаТЧ.Сотрудник, СтрокаТЧ.ДатаВремяНачалаИнтервала)).Количество() = 0
						И СтрокаТЧ.ДатаВремяНачалаИнтервала + ИнтервалЗаписи * 60 > СтрокаТЧ.ДатаВремяНачала Тогда
						
						НоваяДатаВремяНачала 	 = СтрокаТЧ.ДатаВремяНачалаИнтервала + ИнтервалЗаписи * 60;
						СтрокаТЧ.Длительность	 = СтрокаТЧ.Длительность - (НоваяДатаВремяНачала - СтрокаТЧ.ДатаВремяНачала) / 60;
						СтрокаТЧ.ДатаВремяНачала = НоваяДатаВремяНачала;
					КонецЕсли;
					
					Если ТаблицаГрафикаРаботыСотрудников.НайтиСтроки(Новый Структура("Сотрудник, ДатаВремяОкончания", 
							СтрокаТЧ.Сотрудник, СтрокаТЧ.ДатаВремяОкончания)).Количество() = 0 Тогда
						СтрокаТЧ.ДатаВремяОкончания = СтрокаТЧ.ДатаВремяОкончания - ИнтервалЗаписи * 60;
						СтрокаТЧ.Длительность	 	= СтрокаТЧ.Длительность - ИнтервалЗаписи;
					КонецЕсли;
					
				КонецЕсли;
				
				Если СтрокаТЧ.Длительность * 60 < МинНормаВремени Тогда
					Продолжить;
				КонецЕсли;
				
				Если ПроверятьВремяДействияУслуги Тогда
					МассивИнтервалов = ПолучитьИнтервалыДоступныеДляЗаписиПоУслуге(МассивУслуг[0], СтрокаТЧ.ДатаВремяНачала,
						СтрокаТЧ.Длительность);
					ДатаВПродажеДо 	 = ПолучитьДатуОкончанияПродажиНоменклатуры(СтруктурнаяЕдиница, МассивУслуг[0]);
				Иначе
					МассивИнтервалов = Новый Массив;
					МассивИнтервалов.Добавить(СтрокаТЧ);
				КонецЕсли;
				
				Для Каждого Интервал Из МассивИнтервалов Цикл
					
					ВремяНачалаИнтервала = НачалоМинуты(Интервал.ДатаВремяНачала);
					
					ВремяОкончания = ВремяНачалаИнтервала + Интервал.Длительность * 60;
					ВремяОкончания = ?(ВремяОкончания > КонецПериода, КонецПериода, ВремяОкончания);
					
					Если ПроверятьВремяДействияУслуги И ЗначениеЗаполнено(ДатаВПродажеДо) И ВремяОкончания > ДатаВПродажеДо Тогда
						ВремяОкончания = ДатаВПродажеДо;
					КонецЕсли;
					
					ДлительностьОкна = ВремяОкончания - ВремяНачалаИнтервала;//Интервал.Длительность * 60;
					
					Если ДлительностьОкна >= МинНормаВремени
						И ТаблицаЗначенийСеансов.НайтиСтроки(Новый Структура("ВремяНачала", ВремяНачалаИнтервала)).Количество() = 0 Тогда
						
						ДобавитьСтруктурыСеансовВМассив(ВремяНачалаИнтервала, ДлительностьОкна, ДлительностьСлота, МинНормаВремени,
							ТаблицаЗначенийСеансов);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ТаблицаЗначенийСеансов.Сортировать("ВремяНачала Возр");
		МассивДоступныхСеансов = ТаблицаЗначенийСеансов.ВыгрузитьКолонку("Структура");
		
	КонецЕсли;
	
	Возврат Новый Структура("Parameters, Errors", МассивДоступныхСеансов, ПолучитьСтруктуруВозвратаОшибки(,, Истина));
	
КонецФункции

// Функция - Re book times
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  datetime			 - 	 - 
//  service_ids			 - 	 - 
//  service_id			 - 	 - 
//  staff_id			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция re_book_times(СтруктурнаяЕдиница
					, datetime
					, service_ids
					, service_id
					, staff_id
					, reason_entry_id
					, duration = 0) Экспорт
	
	СтруктураОшибки = Неопределено;
	
	ДатаСреза	  	   	= ПолучитьИПроверитьДату(datetime, СтруктураОшибки);
	ДатаСрезаЗаполнена 	= ЗначениеЗаполнено(ДатаСреза);
	МассивУслуг	  	   	= ПолучитьМассивУслугПоИдентификаторам(service_ids	, service_id		, СтруктураОшибки);
	Сотрудник 	  	   	= ПолучитьСсылкуПоИдентификатору(staff_id			, СтруктураОшибки	, Истина, "Сотрудники"		, 1050);
	ПричинаЗаписи		= ПолучитьСсылкуПоИдентификатору(reason_entry_id	, СтруктураОшибки	,		, "ПричиныЗаписи"	, 1130);
	Длительность		= duration;
	
	Если ЗначениеЗаполнено(СтруктураОшибки) Тогда
		Возврат СтруктураОшибки;
	КонецЕсли;
	
	ПроверятьВремяДействияУслуги = МассивУслуг.Количество() = 1;
	МассивДоступныхСеансов 		 = Новый Массив;	
	ИнтервалОнлайнЗаписи = Константы.ИнтервалОнлайнЗаписи.Получить();
	Если ЗначениеЗаполнено(ИнтервалОнлайнЗаписи) Тогда
		Если ИнтервалОнлайнЗаписи = Перечисления.ИнтервалыВремениЗаписи.Минут5 Тогда
			ДлительностьСлота = 5 * 60;
		ИначеЕсли ИнтервалОнлайнЗаписи = Перечисления.ИнтервалыВремениЗаписи.Минут10 Тогда
			ДлительностьСлота = 10 * 60;
		ИначеЕсли ИнтервалОнлайнЗаписи = Перечисления.ИнтервалыВремениЗаписи.Минут15 Тогда
			ДлительностьСлота = 15 * 60;
		ИначеЕсли ИнтервалОнлайнЗаписи = Перечисления.ИнтервалыВремениЗаписи.Минут30 Тогда
			ДлительностьСлота = 30 * 60;
		ИначеЕсли ИнтервалОнлайнЗаписи = Перечисления.ИнтервалыВремениЗаписи.Минут60 Тогда
			ДлительностьСлота = 60 * 60;
		КонецЕсли;
	Иначе
		ДлительностьСлота = 10 * 60;
	КонецЕсли;

	НачалоПериода 	  	   = ПолучитьДатуСреза(ДатаСреза, ДатаСрезаЗаполнена);
	ТаблицаСотрудников 	   = ПолучитьСотрудниковСНормойВремениДляПерезаписи(СтруктурнаяЕдиница, Сотрудник, МассивУслуг);
	СтруктураВремениРаботы = Справочники.СтруктурныеЕдиницы.ВремяРаботыСтруктурнойЕдиницы(НачалоПериода, СтруктурнаяЕдиница, ДеньНедели(НачалоПериода), Ложь);
	
	Если ТаблицаСотрудников.Количество() > 0 И СтруктураВремениРаботы <> Неопределено Тогда
		
		ИнтервалЗаписи 	  = Константы.ИнтервалМеждуЗаписями.Получить();
		МассивСотрудников = ТаблицаСотрудников.ВыгрузитьКолонку("Сотрудник");
		НачалоПериода 	  = ?(СтруктураВремениРаботы.НачалоРаботы > НачалоПериода, СтруктураВремениРаботы.НачалоРаботы, НачалоПериода);
		КонецПериода  	  = СтруктураВремениРаботы.ОкончаниеРаботы;
		
		ТаблицаИнтервалов = ПолучитьСвободныеИнтервалы(СтруктурнаяЕдиница, МассивСотрудников,, НачалоПериода, КонецПериода);
		
		Если ИнтервалЗаписи > 0 И ТаблицаИнтервалов.Количество() > 0 Тогда
			
			ТаблицаГрафикаРаботыСотрудников = РегистрыСведений.СвободныеИнтервалыСотрудников.ПолучитьГрафикРаботыСотрудников(
				ТаблицаИнтервалов.ВыгрузитьКолонку("Сотрудник"),
				СтруктурнаяЕдиница,,,
				ТаблицаИнтервалов.ВыгрузитьКолонку("ДеньИнтервала")
			);
			
		КонецЕсли;
		
		ТаблицаЗначенийСеансов = Новый ТаблицаЗначений;
		ТаблицаЗначенийСеансов.Колонки.Добавить("ВремяНачала");	
		ТаблицаЗначенийСеансов.Колонки.Добавить("Структура");
		
		Для Каждого СтрокаТЧ Из ТаблицаИнтервалов Цикл
			
			МассивСтрок = ТаблицаСотрудников.НайтиСтроки(Новый Структура("Сотрудник", СтрокаТЧ.Сотрудник));
			
			Если НЕ ЗначениеЗаполнено(МассивУслуг) ИЛИ МассивСтрок.Количество() = МассивУслуг.Количество() Тогда
				Если ЗначениеЗаполнено(МассивУслуг) Тогда
					МинНормаВремени = 0;
					Для Каждого НайденнаяСтрока Из МассивСтрок Цикл
						МинНормаВремени = МинНормаВремени + НайденнаяСтрока.НормаВремениПоСотруднику;
					КонецЦикла;
				ИначеЕсли ЗначениеЗаполнено(Длительность) Тогда 
					МинНормаВремени = Длительность;
				Иначе
					МинНормаВремени = МассивСтрок[0].НормаВремениПоСотруднику;
				КонецЕсли;
				
				МинНормаВремени = МинНормаВремени * 60;
				
				Если ИнтервалЗаписи > 0 Тогда
					
					Если ТаблицаГрафикаРаботыСотрудников.НайтиСтроки(Новый Структура("Сотрудник, ДатаВремяНачала", 
							СтрокаТЧ.Сотрудник, СтрокаТЧ.ДатаВремяНачалаИнтервала)).Количество() = 0
						И СтрокаТЧ.ДатаВремяНачалаИнтервала + ИнтервалЗаписи * 60 > СтрокаТЧ.ДатаВремяНачала Тогда
						
						НоваяДатаВремяНачала 	 = СтрокаТЧ.ДатаВремяНачалаИнтервала + ИнтервалЗаписи * 60;
						СтрокаТЧ.Длительность	 = СтрокаТЧ.Длительность - (НоваяДатаВремяНачала - СтрокаТЧ.ДатаВремяНачала) / 60;
						СтрокаТЧ.ДатаВремяНачала = НоваяДатаВремяНачала;
					КонецЕсли;
					
					Если ТаблицаГрафикаРаботыСотрудников.НайтиСтроки(Новый Структура("Сотрудник, ДатаВремяОкончания", 
							СтрокаТЧ.Сотрудник, СтрокаТЧ.ДатаВремяОкончания)).Количество() = 0 Тогда
						СтрокаТЧ.ДатаВремяОкончания = СтрокаТЧ.ДатаВремяОкончания - ИнтервалЗаписи * 60;
						СтрокаТЧ.Длительность	 	= СтрокаТЧ.Длительность - ИнтервалЗаписи;
					КонецЕсли;
					
				КонецЕсли;
				
				Если СтрокаТЧ.Длительность * 60 < МинНормаВремени Тогда
					Продолжить;
				КонецЕсли;
				
				Если ПроверятьВремяДействияУслуги Тогда
					МассивИнтервалов = ПолучитьИнтервалыДоступныеДляЗаписиПоУслуге(МассивУслуг[0], СтрокаТЧ.ДатаВремяНачала,
						СтрокаТЧ.Длительность);
					ДатаВПродажеДо 	 = ПолучитьДатуОкончанияПродажиНоменклатуры(СтруктурнаяЕдиница, МассивУслуг[0]);
				Иначе
					МассивИнтервалов = Новый Массив;
					МассивИнтервалов.Добавить(СтрокаТЧ);
				КонецЕсли;
				
				Для Каждого Интервал Из МассивИнтервалов Цикл
					
					ВремяНачалаИнтервала = НачалоМинуты(Интервал.ДатаВремяНачала);
					
					ВремяОкончания = ВремяНачалаИнтервала + Интервал.Длительность * 60;
					ВремяОкончания = ?(ВремяОкончания > КонецПериода, КонецПериода, ВремяОкончания);
					
					Если ПроверятьВремяДействияУслуги И ЗначениеЗаполнено(ДатаВПродажеДо) И ВремяОкончания > ДатаВПродажеДо Тогда
						ВремяОкончания = ДатаВПродажеДо;
					КонецЕсли;
					
					ДлительностьОкна = ВремяОкончания - ВремяНачалаИнтервала;//Интервал.Длительность * 60;
					
					Если ДлительностьОкна >= МинНормаВремени
						И ТаблицаЗначенийСеансов.НайтиСтроки(Новый Структура("ВремяНачала", ВремяНачалаИнтервала)).Количество() = 0 Тогда
						
						ДобавитьСтруктурыСеансовВМассив(ВремяНачалаИнтервала, ДлительностьОкна, ДлительностьСлота, МинНормаВремени,
							ТаблицаЗначенийСеансов);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ТаблицаЗначенийСеансов.Сортировать("ВремяНачала Возр");
		МассивДоступныхСеансов = ТаблицаЗначенийСеансов.ВыгрузитьКолонку("Структура");
		
	КонецЕсли;
	
	Возврат Новый Структура("Parameters, Errors", МассивДоступныхСеансов, ПолучитьСтруктуруВозвратаОшибки(,, Истина));
	
КонецФункции

// Функция, добавляет структуры сеансов в массив возврата.
// 
Процедура ДобавитьСтруктурыСеансовВМассив(
		ДатаВремяНачалаОкна,
		Знач ДлительностьОкна, 
		ДлительностьСлота, 
		МинНормаВремени, 
		ТаблицаЗначенийСеансов) Экспорт
	
	ДатаВремяПоследнегоСеанса = ДатаВремяНачалаОкна;
	ОстатокОтДеления 		  = (НачалоМинуты(ДатаВремяПоследнегоСеанса) - Дата(1,1,1)) % ДлительностьСлота;
	
	Если ОстатокОтДеления <> 0 Тогда
		ДатаВремяПоследнегоСеанса = ДатаВремяПоследнегоСеанса + (ДлительностьСлота - ОстатокОтДеления);
		ДлительностьОкна 		  = ДлительностьОкна - (ДлительностьСлота - ОстатокОтДеления);
	КонецЕсли;
	
	Пока ДлительностьОкна >= ДлительностьСлота Цикл
			
		ВремяНачалаСеанса = Формат(ДатаВремяПоследнегоСеанса, "ДФ=HH:mm");
		
		Если ТаблицаЗначенийСеансов.Найти(ВремяНачалаСеанса, "ВремяНачала") = Неопределено
			И ДлительностьОкна >= МинНормаВремени Тогда
			
			НоваяСтрока 			= ТаблицаЗначенийСеансов.Добавить();
			НоваяСтрока.ВремяНачала = ВремяНачалаСеанса;
			НоваяСтрока.Структура   = Новый Структура("time, seance_length, datetime", 
				ВремяНачалаСеанса, ДлительностьСлота / 60, НачалоМинуты(ДатаВремяПоследнегоСеанса));
			
		КонецЕсли;
		
		ДатаВремяПоследнегоСеанса = ДатаВремяПоследнегоСеанса + ДлительностьСлота;
		ДлительностьОкна   		  = ДлительностьОкна - ДлительностьСлота;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция - Получить дату окончания продажи номенклатуры
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  Номенклатура		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДатуОкончанияПродажиНоменклатуры(СтруктурнаяЕдиница, Номенклатура) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтатусыНоменклатурыСрезПоследних.Период КАК Период,
	|	СтатусыНоменклатурыСрезПоследних.ВПродаже КАК ВПродаже
	|ИЗ
	|	РегистрСведений.СтатусыНоменклатуры.СрезПоследних(
	|			,
	|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И Номенклатура = &Номенклатура) КАК СтатусыНоменклатурыСрезПоследних");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Номенклатура"	  , Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий() И Не Выборка.ВПродаже, Выборка.Период, Неопределено);
	
КонецФункции

#КонецОбласти

#Область client

// Функция возвращает информацию о клиенте.
//
Функция client(Контрагент) Экспорт
	
	МассивEmailСтрок = Контрагент.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
	
	ПолКлиента = Неопределено;
	Если Контрагент.ПолКлиента = Перечисления.ПолФизическогоЛица.Мужской Тогда
		ПолКлиента = "Мужской";
	ИначеЕсли Контрагент.ПолКлиента = Перечисления.ПолФизическогоЛица.Женский Тогда
		ПолКлиента = "Женский";
	КонецЕсли;
	
	ДанныеКлиента = Новый Структура;
	ДанныеКлиента.Вставить("full_name"	, Контрагент.Наименование);
	ДанныеКлиента.Вставить("name"		, Контрагент.Имя);
	ДанныеКлиента.Вставить("second_name", Контрагент.Отчество);
	ДанныеКлиента.Вставить("last_name"	, Контрагент.Фамилия);
	ДанныеКлиента.Вставить("birthday"	, ?(ЗначениеЗаполнено(Контрагент.ДатаРожденияКлиента), Формат(Контрагент.ДатаРожденияКлиента, "ДФ=dd.MM.yyyy"), Неопределено));
	ДанныеКлиента.Вставить("sex"		, ПолКлиента);
	ДанныеКлиента.Вставить("email"		, ?(МассивEmailСтрок.Количество() > 0, МассивEmailСтрок[0].АдресЭП, Неопределено));
	
	Возврат Новый Структура("Parameters, Errors", ДанныеКлиента, ПолучитьСтруктуруВозвратаОшибки(,, Истина));
	
КонецФункции

#КонецОбласти

#Область auth_types

// Функция - Auth types
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция auth_types(СтруктурнаяЕдиница) Экспорт
	
	МассивВариантовАвторизации	= Новый Массив;
	ДоступныеТипыАвторизации	= Константы.ДоступныеТипыАвторизации.Получить().Получить(); 		
	
	Если ТипЗнч(ДоступныеТипыАвторизации) = Тип("Структура") И ДоступныеТипыАвторизации.Свойство("СписокТиповАвторизации") Тогда
		
		Для Каждого ТипАвторизации Из ДоступныеТипыАвторизации.СписокТиповАвторизации Цикл
			Если ТипАвторизации.Пометка Тогда
				МассивВариантовАвторизации.Добавить(Новый Структура("type, title", ТипАвторизации.Значение, ТипАвторизации.Представление));	
			КонецЕсли;
		КонецЦикла;	
		
	Иначе
		
		ВнешняяСистема = ПолучитьВнешнююСистемуСПриоритетомПоСалону(Перечисления.ТипыВнешнихСистем.GreenApi, СтруктурнаяЕдиница);	
		Если ЗначениеЗаполнено(ВнешняяСистема) Тогда
			МассивВариантовАвторизации.Добавить(Новый Структура("type, title", "whats_app", "WhatsApp"));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Константы.СервисSMSРассылкиПоУмолчанию.Получить()) Тогда
			МассивВариантовАвторизации.Добавить(Новый Структура("type, title", "sms", "СМС"));
		КонецЕсли;
		
		УчетнаяЗаписьЭлПочты = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
		Если УчетнаяЗаписьЭлПочты.ИспользоватьДляОтправки = Истина Тогда
			МассивВариантовАвторизации.Добавить(Новый Структура("type, title", "email", "Email"));
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("Parameters, Errors", МассивВариантовАвторизации, ПолучитьСтруктуруВозвратаОшибки(,, Истина));
	
КонецФункции

// Функция - Получить внешние системы
//
// Параметры:
//  ТипСистемы	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьВнешнююСистемуСПриоритетомПоСалону(ТипСистемы, СтруктурнаяЕдиница) Экспорт // Если есть внешняя система с нужным салоном, то берем ее, иначе берем без салона
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВнешниеСистемы.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ВнешниеСистемы.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндексСортировки
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ПометкаУдаления = ЛОЖЬ
	|	И ВнешниеСистемы.Используется = ИСТИНА
	|	И ВнешниеСистемы.ТипВнешнейСистемы = &ТипСистемы
	|	И ВЫБОР
	|			КОГДА ВнешниеСистемы.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|				ТОГДА ВнешниеСистемы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИндексСортировки");
	
	Запрос.УстановитьПараметр("ТипСистемы"			, ТипСистемы);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);

	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область МетодыPOST

#Область auth

// Функция осуществляет авторизацию в системе
// 
Функция auth(ApiKey, НомерТелефона, КодПодтверждения, Имя, Фамилия, Отчество, ДатаРождения, email, СтруктурнаяЕдиница, ТипАвторизации = Неопределено) Экспорт		
	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(ApiKey);
	
	Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
		Возврат ПолучитьСтруктуруВозвратаОшибки(1064);
	КонецЕсли;
	
	НомерТелефона		 = ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(НомерТелефона);
	ТестовыйПользователь = ?(НомерТелефона = "70000000000", Истина, Ложь);
	
	Контрагент = ПолучитьКонтрагентаПоНомеруТелефона(НомерТелефона);
	
	СтруктураКлючаКлиента = РегистрыСведений.КлючиВнешнихСистем.ПолучитьПоследнююЗаписьОКлючеКлиента(ВнешняяСистема, НомерТелефона);
	СтатусКлюча 		  = ?(СтруктураКлючаКлиента <> Неопределено, СтруктураКлючаКлиента.Статус, Неопределено);
	
	Если СтатусКлюча = Перечисления.СтатусыКлючейВнешнихСистем.ОжиданиеПодтверждения
		И СтруктураКлючаКлиента.КодДействителенДо < ТекущаяДатаСеанса()
		И ЗначениеЗаполнено(КодПодтверждения) Тогда
		
		Возврат ПолучитьСтруктуруВозвратаОшибки(1068);
	КонецЕсли;
	
	ОтключитьПодтверждениеОнлайнЗаписи = (ВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ВиджетОнлайнЗаписи 
											И ВнешняяСистема.АвторизацияПоКодуБезСМС)
										ИЛИ ВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ПроДокторов;
	
	Если ОтключитьПодтверждениеОнлайнЗаписи
		ИЛИ (СтатусКлюча = Перечисления.СтатусыКлючейВнешнихСистем.ОжиданиеПодтверждения
		И ЗначениеЗаполнено(КодПодтверждения)) Тогда
		
		Если НЕ ОтключитьПодтверждениеОнлайнЗаписи
			И КодПодтверждения <> СокрЛП(СтруктураКлючаКлиента.КодПодтверждения) Тогда
			Возврат ПолучитьСтруктуруВозвратаОшибки(1065);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(email) И Не ДанныйEmailИспользуется(Контрагент, email) Тогда
			
			Попытка
				КонтрагентОбъект = Контрагент.ПолучитьОбъект();
				ЗаполнитьАдресЭлектроннойПочты(КонтрагентОбъект, email);
				КонтрагентОбъект.Записать();
				Контрагент = КонтрагентОбъект.Ссылка;
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
		Контрагент 		 = ?(ЗначениеЗаполнено(Контрагент), Контрагент, СоздатьКлиента(НомерТелефона, СтруктурнаяЕдиница, Фамилия, Имя, Отчество, email, ДатаРождения,, ВнешняяСистема));
		
		КодПодтверждения = ?(ОтключитьПодтверждениеОнлайнЗаписи, "", СтруктураКлючаКлиента.КодПодтверждения);
		UserToken 		 = ЗаписатьUserToken(?(ОтключитьПодтверждениеОнлайнЗаписи, ВнешняяСистема, СтруктураКлючаКлиента.ВнешняяСистема), НомерТелефона, Контрагент, КодПодтверждения);
		
		Возврат Новый Структура("Parameters, Errors", Новый Структура("UserToken", UserToken), ПолучитьСтруктуруВозвратаОшибки(,, Истина));
		
	Иначе
		
		Если ТестовыйПользователь Тогда
			НовыйКодПодтверждения = "123456";
		Иначе
			НовыйКодПодтверждения = СгенерироватьКодПодтверждения(ВнешняяСистема);
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.КлючиВнешнихСистем.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВнешняяСистема.Установить(ВнешняяСистема);
		НаборЗаписей.Отбор.НомерТелефона.Установить(НомерТелефона);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ВнешняяСистема 	  = ВнешняяСистема;
		НоваяЗапись.НомерТелефона  	  = НомерТелефона;
		НоваяЗапись.Клиент	 	  	  = Контрагент;
		НоваяЗапись.КодПодтверждения  = НовыйКодПодтверждения;
		НоваяЗапись.Статус 		      = Перечисления.СтатусыКлючейВнешнихСистем.ОжиданиеПодтверждения;
		НоваяЗапись.КодДействителенДо = ТекущаяДатаСеанса() + 3600;
		
		ТипАвторизацииМессенджер = ТипАвторизации <> Неопределено И НРег(ТипАвторизации) = "whats_app";
		ТипАвторизацииПочта      = ТипАвторизации <> Неопределено И НРег(ТипАвторизации) = "email";
		Сообщение				 = "Ваш код подтверждения: " + НовыйКодПодтверждения;
		
		Если Не ТестовыйПользователь Тогда		
			
			Если ТипАвторизацииМессенджер Тогда
				
				ОписаниеОшибки    = "";
				Контрагент = ?(ЗначениеЗаполнено(Контрагент), Контрагент, СоздатьКлиента(НомерТелефона, СтруктурнаяЕдиница, Фамилия, Имя, Отчество, email, ДатаРождения,, ВнешняяСистема));
				
				РезультатОтправки = ОтправитьСообщениеВМессенджер(Контрагент, НомерТелефона, Сообщение, СтруктурнаяЕдиница, ОписаниеОшибки);
				
				Если НЕ РезультатОтправки Тогда
					Возврат ПолучитьСтруктуруВозвратаОшибки(1120, ?(ЗначениеЗаполнено(ОписаниеОшибки), ОписаниеОшибки, ""));
				КонецЕсли;
				
			ИначеЕсли ТипАвторизацииПочта Тогда
				
				Если Не ЗначениеЗаполнено(email) Тогда //  И Не УправлениеЭлектроннойПочтой.ЭлектроннаяПочтаВведенаВерно(email)
					Возврат ПолучитьСтруктуруВозвратаОшибки(1128, "Не передана электронная почта");	
				КонецЕсли;
				
				УчетнаяЗаписьЭлПочты = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
				
				Если УчетнаяЗаписьЭлПочты.ИспользоватьДляОтправки = Ложь Тогда
					Возврат ПолучитьСтруктуруВозвратаОшибки(1128, "Не заполнена учетная запись");	
				КонецЕсли;
				
				ОписаниеОшибки    = "";
				РезультатОтправки = ОтправитьПисьмоНаПочту(Контрагент, email, Сообщение, СтруктурнаяЕдиница, УчетнаяЗаписьЭлПочты, ОписаниеОшибки);
				
				Если НЕ РезультатОтправки Тогда
					Возврат ПолучитьСтруктуруВозвратаОшибки(1128, ?(ЗначениеЗаполнено(ОписаниеОшибки), ОписаниеОшибки, ""));
				КонецЕсли;
				
			Иначе				
				
				ОписаниеОшибки = "";
				Результат = СоздатьИПровестиДокументSMSРассылка(Контрагент, НомерТелефона, Сообщение, ОписаниеОшибки, СтруктурнаяЕдиница);
				
				Если Не Результат Тогда
					Возврат ПолучитьСтруктуруВозвратаОшибки(1110, ОписаниеОшибки);
				КонецЕсли;			
				
			КонецЕсли;
			
		КонецЕсли;
		
		НаборЗаписей.Записать();
		
		Возврат Новый Структура("Parameters, Errors", Новый Структура("sent_SMS, confirmation_code", Истина, НовыйКодПодтверждения), ПолучитьСтруктуруВозвратаОшибки(,, Истина));
		
	КонецЕсли;
	
КонецФункции

// Функция генерирует случайное число от 1000 до 9999
// 
Функция СгенерироватьКодПодтверждения(ВнешняяСистема) Экспорт
	
	ГенераторСлучайныхЧисел  = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	НижняяГраница   = 1000;
	ВрехнаяяГраница = 9999;
	
	Возврат Формат(ГенераторСлучайныхЧисел.СлучайноеЧисло(НижняяГраница, ВрехнаяяГраница), "ЧГ=0");
	
КонецФункции

// Функция возвращает хеш строки
// 
Функция ПолучитьMD5(Текст) Экспорт
	
	ОбъектХеш = Новый ХешированиеДанных(ХешФункция.MD5);
	ОбъектХеш.Добавить(Текст);
	Возврат ОбъектХеш.ХешСумма;

КонецФункции

// Функция - Создать документ SMSРассылка и отправить SMS
//
Функция СоздатьИПровестиДокументSMSРассылка(Получатель, НомерТелефона, Содержание, ОписаниеОшибки, СтруктурнаяЕдиница) Экспорт
	
	Возврат Документы.РассылкаСообщений.СоздатьИПровестиДокументSMSРассылка(Получатель, НомерТелефона, Содержание, ОписаниеОшибки, РежимЗаписиДокумента.Проведение, СтруктурнаяЕдиница);
	
КонецФункции

// Функция - Данный email не используется
//
// Параметры:
//  Контрагент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ДанныйEmailИспользуется(Контрагент, email) Экспорт
	
	НаличиеТекущегоEmail = Ложь;
	Для Каждого КонтактнаяИнформация Из Контрагент.КонтактнаяИнформация Цикл							
		Если ЗначениеЗаполнено(Email) И КонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты И НРег(КонтактнаяИнформация.АдресЭП) = НРег(Email) Тогда					
			НаличиеТекущегоEmail = Истина;
		КонецЕсли;			
	КонецЦикла;
	
	Возврат НаличиеТекущегоEmail
	
КонецФункции

// Процедура, добаляет адрес электронногй почты в контактную информация клиента.
// 
Процедура ЗаполнитьАдресЭлектроннойПочты(НовыйЭлемент, Email) Экспорт
	
	Объект_XDTO_Email = ПолучитьСтруктуру_XDTO(Email, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	
	Если Объект_XDTO_Email = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока 			  = НовыйЭлемент.КонтактнаяИнформация.Добавить();
	НоваяСтрока.Тип 		  = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	НоваяСтрока.Вид 		  = Справочники.ВидыКонтактнойИнформации.EmailКлиента;
	НоваяСтрока.АдресЭП		  = Объект_XDTO_Email.Представление;
	НоваяСтрока.Представление = Объект_XDTO_Email.Представление;
	
КонецПроцедуры

// Функция - Отправить сообщение в мессенджер
//
// Параметры:
//  Контрагент		 - 	 - 
//  НомерТелефона	 - 	 - 
//  Сообщение		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОтправитьСообщениеВМессенджер(Контрагент, НомерТелефона, Содержание, СтруктурнаяЕдиница, ОписаниеОшибки) Экспорт
				
	ВнешняяСистемаМессенджера = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.GreenApi,,СтруктурнаяЕдиница);
	
	Если Не ЗначениеЗаполнено(ВнешняяСистемаМессенджера) Тогда
		ОписаниеОшибки = "Не найдена внешняя система";
		Возврат Ложь;
	КонецЕсли;
	
	ПолучателиСообщения = Новый Массив();
	ПолучателиСообщения.Добавить(Новый Структура("Получатель, НомерТелефона", Контрагент, НомерТелефона));
	
	ПараметрыРассылки = Новый Структура;
	ПараметрыРассылки.Вставить("Получатели"          , ПолучателиСообщения);
	ПараметрыРассылки.Вставить("Содержание"          , Содержание);
	ПараметрыРассылки.Вставить("СтруктурнаяЕдиница"  , СтруктурнаяЕдиница); 
	ПараметрыРассылки.Вставить("ВнешняяСистема"      , ВнешняяСистемаМессенджера);
	ПараметрыРассылки.Вставить("ОтправкаMessenger"	 , Истина);
	ПараметрыРассылки.Вставить("ИнициироватьОтправку", Истина);	
	ПараметрыРассылки.Вставить("ОтправитьНемедленно" , Истина);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Документы.РассылкаСообщений.СоздатьДокументРассылкаСообщений(ПараметрыРассылки, ОписаниеОшибки);
	
КонецФункции

// Функция - Отправить письмо на почту
//
// Параметры:
//  Контрагент			 - 	 - 
//  email				 - 	 - 
//  Сообщение			 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//  ОписаниеОшибки		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОтправитьПисьмоНаПочту(Контрагент, email, Сообщение, СтруктурнаяЕдиница, УчетнаяЗапись, ОписаниеОшибки) Экспорт
	
	СтруктураДокумента = Новый Структура();
	СтруктураДокумента.Вставить("Дата"						, ТекущаяДатаСеанса());
	СтруктураДокумента.Вставить("УчетнаяЗапись"				, УчетнаяЗапись);
	СтруктураДокумента.Вставить("ОтправительПредставление"	, УчетнаяЗапись.АдресЭлектроннойПочты);
	СтруктураДокумента.Вставить("Тема"						, "Ваш код подтверждения");
	СтруктураДокумента.Вставить("НазначениеЗадачи"			, "ОтправкаКодаПодтверждения");
	СтруктураДокумента.Вставить("Контрагент"				, Контрагент);
	СтруктураДокумента.Вставить("ТекстHTML"					, Сообщение);
	СтруктураДокумента.Вставить("СтруктурнаяЕдиница"		, СтруктурнаяЕдиница);
	СтруктураДокумента.Вставить("ТипТекста"					, Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
	СтруктураДокумента.Вставить("Важность"					, Перечисления.ВариантыВажностиЗадачи.Обычная);
	СтруктураДокумента.Вставить("ЕстьВложения"				, Ложь);
	СтруктураДокумента.Вставить("АвторДокумента"			, ПараметрыСеанса.ТекущийПользователь);
	
	СообщениеИсходящееОбъект	= Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(СообщениеИсходящееОбъект, СтруктураДокумента);
	
	НовыйПолучатель					= СообщениеИсходящееОбъект.ПолучателиПисьма.Добавить();
	НовыйПолучатель.Контакт			= Контрагент;
	НовыйПолучатель.Адрес			= email;
	НовыйПолучатель.Представление	= ?(ЗначениеЗаполнено(Контрагент), Строка(Контрагент), Неопределено);
		
	Результат = Документы.ЭлектронноеПисьмоИсходящее.ВыполнитьОтправкуПисьма(СообщениеИсходящееОбъект, ОписаниеОшибки);	
	
	Возврат Результат;
	
КонецФункции

// Функция, возвращает ПолФизическогоЛица по переданному числу.
//
Функция ПолучитьПолКлиента(sex) Экспорт
	
	Если sex = 1 Тогда	
		Возврат Перечисления.ПолФизическогоЛица.Мужской;
	ИначеЕсли sex = 2 Тогда
		Возврат Перечисления.ПолФизическогоЛица.Женский; 
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область book_record

// Функция осуществляет создание предварительной записи
//
Функция book_record(СтруктурнаяЕдиница
					, record_array
					, Клиент
					, ФИОКлиента
					, ИсточникИнформации
					, КомментарийЗаписи
					, ВнешняяСистема
					, НомерТелефона
					, ЗаКакоеВремяНапоминатьОЗаписи
					, ДополнительныеПараметры = Неопределено
					, email = Неопределено
					, birthday = Неопределено) Экспорт
	
	СтруктураОшибки = Неопределено;
	ТаблицаЗначенийЗаписи = ПолучитьТаблицуЗаписи(record_array, СтруктураОшибки);
	
	Если ЗначениеЗаполнено(СтруктураОшибки) Тогда
		Возврат СтруктураОшибки;			
	КонецЕсли;
	
	СтруктураОшибки = ПроверитьТаблицуЗаписи(ТаблицаЗначенийЗаписи, СтруктурнаяЕдиница);
	
	Если СтруктураОшибки <> Неопределено Тогда
		Возврат СтруктураОшибки;
	КонецЕсли;
	
	АвторДокумента 		= ?(ИсточникИнформации = "Чат-бот", Константы.СотрудникЧатБота.Получить(), Неопределено);
	ИсточникИнформации 	= ПолучитьРекламныйИсточник(ИсточникИнформации);
	СтруктураОшибки    	= ОбновитьИнформациюОКлиенте(Клиент, ФИОКлиента, ИсточникИнформации, email, birthday, СтруктурнаяЕдиница);
		
	Если СтруктураОшибки <> Неопределено Тогда
		Возврат СтруктураОшибки;
	КонецЕсли;
	                           
	Врач      	= ?(ТаблицаЗначенийЗаписи.Количество() <> 0, ТаблицаЗначенийЗаписи[0].Сотрудник, Неопределено);
	Заявка    	= ПолучитьЗаявку(Клиент, ФИОКлиента, ИсточникИнформации, СтруктурнаяЕдиница, ВнешняяСистема, НомерТелефона);	
	Сделка 		= Справочники.Сделки.ИнициализироватьПредопределеннуюСделку(Клиент, СтруктурнаяЕдиница, Врач, , , , Истина, 3);
	
	ОбъектСобытие = СформироватьСобытие(Клиент
										, ТаблицаЗначенийЗаписи
										, СтруктурнаяЕдиница
										, ВнешняяСистема
										, ИсточникИнформации
										, КомментарийЗаписи
										, Сделка
										, ЗаКакоеВремяНапоминатьОЗаписи);
										
	Если ЗначениеЗаполнено(АвторДокумента) Тогда 
		ОбъектСобытие.АвторДокумента = АвторДокумента;
	КонецЕсли;	
	ЕстьПараметрыСценария = ЗаписатьДополнительныеПараметры(ОбъектСобытие, ДополнительныеПараметры);										
		
	Попытка
		ОбъектСобытие.ДополнительныеСвойства.Вставить("ОбновлениеРабочегоСтола", Истина);
		ОбъектСобытие.ДополнительныеСвойства.Вставить("ДобавленаОнлайнЗапись", Истина);
		
		ОбъектСобытие.Записать(РежимЗаписиДокумента.Проведение);
		Событие = ОбъектСобытие.Ссылка;
		
		Если ЗначениеЗаполнено(ОбъектСобытие.ПеренесённаяПредварительнаяЗапись) Тогда 
			РегистрыСведений.МеткиКлиентов.ПеренестиМеткиОбъекта(ОбъектСобытие.ПеренесённаяПредварительнаяЗапись, Событие);
		КонецЕсли;	
	Исключение
		Возврат ПолучитьСтруктуруВозвратаОшибки(1000, ОписаниеОшибки());
	КонецПопытки;	
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Result"	  , Истина);
	СтруктураВозврата.Вставить("record_id", Строка(Событие.УникальныйИдентификатор()));
	СтруктураВозврата.Вставить("status"   , "Reserved");
	Если ЕстьПараметрыСценария Тогда 
		СтруктураВозврата.Вставить("record", Событие);
	КонецЕсли;	

	Возврат Новый Структура("Parameters, Errors", СтруктураВозврата, ПолучитьСтруктуруВозвратаОшибки(,, Истина));
		
КонецФункции

// Функция - Re book record
//
// Параметры:
//  СтруктурнаяЕдиница				 - 	 - 
//  record_array					 - 	 - 
//  Клиент							 - 	 - 
//  ФИОКлиента						 - 	 - 
//  ИсточникИнформации				 - 	 - 
//  КомментарийЗаписи				 - 	 - 
//  ВнешняяСистема					 - 	 - 
//  НомерТелефона					 - 	 - 
//  ЗаКакоеВремяНапоминатьОЗаписи	 - 	 - 
//  ДополнительныеПараметры			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция re_book_record(СтруктурнаяЕдиница
					, record_array
					, Клиент
					, ФИОКлиента
					, ИсточникИнформации
					, КомментарийЗаписи
					, ВнешняяСистема
					, НомерТелефона
					, ЗаКакоеВремяНапоминатьОЗаписи
					, ДополнительныеПараметры = Неопределено) Экспорт
	
	СтруктураОшибки = Неопределено;
	ТаблицаЗначенийЗаписи = ПолучитьТаблицуЗаписи(record_array, СтруктураОшибки);
	
	Если ЗначениеЗаполнено(СтруктураОшибки) Тогда
		Возврат СтруктураОшибки;			
	КонецЕсли;
	
	СтруктураОшибки = ПроверитьТаблицуЗаписи(ТаблицаЗначенийЗаписи, СтруктурнаяЕдиница);
	
	Если СтруктураОшибки <> Неопределено Тогда
		Возврат СтруктураОшибки;
	КонецЕсли;
	
	АвторДокумента 		= ?(ИсточникИнформации = "Чат-бот", Константы.СотрудникЧатБота.Получить(), Неопределено);	
	ИсточникИнформации 	= ПолучитьРекламныйИсточник(ИсточникИнформации);
	СтруктураОшибки    	= ОбновитьИнформациюОКлиенте(Клиент, ФИОКлиента, ИсточникИнформации);
		
	Если СтруктураОшибки <> Неопределено Тогда
		Возврат СтруктураОшибки;
	КонецЕсли;
	
	Врач      	= ?(ТаблицаЗначенийЗаписи.Количество() <> 0, ТаблицаЗначенийЗаписи[0].Сотрудник, Неопределено);
	Заявка 		= ПолучитьЗаявку(Клиент, ФИОКлиента, ИсточникИнформации, СтруктурнаяЕдиница, ВнешняяСистема, НомерТелефона);	
	Сделка 		= Справочники.Сделки.ИнициализироватьПредопределеннуюСделку(Клиент, СтруктурнаяЕдиница, Врач, , , , Истина, 3);
	
	ОбъектСобытие = СформироватьСобытие(Клиент
										, ТаблицаЗначенийЗаписи
										, СтруктурнаяЕдиница
										, ВнешняяСистема
										, ИсточникИнформации
										, КомментарийЗаписи
										, Сделка
										, ЗаКакоеВремяНапоминатьОЗаписи);
										
	Если ЗначениеЗаполнено(АвторДокумента) Тогда 
		ОбъектСобытие.АвторДокумента = АвторДокумента;
	КонецЕсли;											
	ЕстьПараметрыСценария = ЗаписатьДополнительныеПараметры(ОбъектСобытие, ДополнительныеПараметры);										
		
	Попытка
		ОбъектСобытие.ДополнительныеСвойства.Вставить("ОбновлениеРабочегоСтола", Истина);
		ОбъектСобытие.ДополнительныеСвойства.Вставить("ДобавленаОнлайнЗапись", Истина);
		
		ОбъектСобытие.Записать(РежимЗаписиДокумента.Проведение);
		Событие = ОбъектСобытие.Ссылка;
		
		Если ЗначениеЗаполнено(ОбъектСобытие.ПеренесённаяПредварительнаяЗапись) Тогда 
			РегистрыСведений.МеткиКлиентов.ПеренестиМеткиОбъекта(ОбъектСобытие.ПеренесённаяПредварительнаяЗапись, Событие);
		КонецЕсли;	
	Исключение
		Возврат ПолучитьСтруктуруВозвратаОшибки(1000, ОписаниеОшибки());
	КонецПопытки;	
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Result"	  , Истина);
	СтруктураВозврата.Вставить("record_id", Строка(Событие.УникальныйИдентификатор()));
	СтруктураВозврата.Вставить("status"   , "Reserved");
	Если ЕстьПараметрыСценария Тогда 
		СтруктураВозврата.Вставить("record", Событие);
	КонецЕсли;	

	Возврат Новый Структура("Parameters, Errors", СтруктураВозврата, ПолучитьСтруктуруВозвратаОшибки(,, Истина));
		
КонецФункции

// Функция - Записать дополнительные параметры
//
// Параметры:
//  ОбъектСобытие			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЗаписатьДополнительныеПараметры(ОбъектСобытие, ДополнительныеПараметры)

	ДиалогID 							= "";								
	СценарийЧатБота 					= Неопределено;
	ПеренесённаяПредварительнаяЗапись 	= Неопределено;
	
	ЕстьПараметрыСценария 				= НЕ ДополнительныеПараметры = Неопределено
											И ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
											И ДополнительныеПараметры.Свойство("СценарийЧатБота");
	Если ЕстьПараметрыСценария Тогда 
		СценарийЧатБота 				= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "СценарийЧатБота"	, Неопределено);
		ДиалогID 						= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ДиалогID"		, "");
		Если ДополнительныеПараметры.Свойство("ДанныеСценария") Тогда 
			ПеренесённаяПредварительнаяЗапись = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры.ДанныеСценария, "ПредварительнаяЗапись", Неопределено);
			Если НЕ ЗначениеЗаполнено(ПеренесённаяПредварительнаяЗапись) Тогда 
				ПеренесённаяПредварительнаяЗапись = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры.ДанныеСценария, "Запись", Неопределено);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПеренесённаяПредварительнаяЗапись) Тогда 
		ОбъектСобытие.ПеренесённаяПредварительнаяЗапись = ПеренесённаяПредварительнаяЗапись;	
	КонецЕсли;	
	ОбъектСобытие.ИдентификаторДиалога 	= ДиалогID;	
	
	Возврат ЕстьПараметрыСценария;
	
КонецФункции

Функция ПолучитьЗаявку(Клиент
					, ФИОКлиента = ""
					, ИсточникИнформации
					, СтруктурнаяЕдиница
					, ВнешняяСистема
					, НомерТелефона) Экспорт
	
	Попытка
		
		ДанныеЗаполнения = Новый Структура();
		ДанныеЗаполнения.Вставить("ДатаСоздания"      , ТекущаяДатаСеанса());
		ДанныеЗаполнения.Вставить("ОсновнойКлиент"    , Клиент);
		ДанныеЗаполнения.Вставить("РекламныйИсточник" , ИсточникИнформации);	
		ДанныеЗаполнения.Вставить("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
		ДанныеЗаполнения.Вставить("ВнешняяСистема"    , ВнешняяСистема); 
		//ДанныеЗаполнения.Вставить("Статус"            , Перечисления.СтатусыЗаявок.Принята);
		ДанныеЗаполнения.Вставить("НомерТелефона"     , НомерТелефона);
		
		Если ЗначениеЗаполнено(ФИОКлиента) Тогда 
			ФИО = ОбщегоНазначения.ВернутьФИОКлиента(ФИОКлиента);
			ДанныеЗаполнения.Вставить("Фамилия" , ФИО.Фамилия); 
			ДанныеЗаполнения.Вставить("Имя"     , ФИО.Имя); 
			ДанныеЗаполнения.Вставить("Отчество", ФИО.Отчество);
		ИначеЕсли ЗначениеЗаполнено(Клиент) Тогда 
			СтруктураФИО = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Клиент, "Фамилия, Имя, Отчество");
			ДанныеЗаполнения.Вставить("Фамилия" , СтруктураФИО.Фамилия); 
			ДанныеЗаполнения.Вставить("Имя"     , СтруктураФИО.Имя); 
			ДанныеЗаполнения.Вставить("Отчество", СтруктураФИО.Отчество);
		Иначе 	
			Наименование = Клиент.Наименование;
			Если ЗначениеЗаполнено(СокрЛП(Наименование)) Тогда 
				ФИО = ОбщегоНазначения.ВернутьФИОКлиента(Наименование);
				ДанныеЗаполнения.Вставить("Фамилия" , ФИО.Фамилия); 
				ДанныеЗаполнения.Вставить("Имя"     , ФИО.Имя); 
				ДанныеЗаполнения.Вставить("Отчество", ФИО.Отчество);
			КонецЕсли;
		КонецЕсли;
		
		ЗаявкаОбъект = Справочники.Заявки.ПолучитьЗаявкуПоНомеруТелефона(НомерТелефона);
		
		Если Не ЗначениеЗаполнено(ЗаявкаОбъект) Тогда
			ЗаявкаОбъект = Справочники.Заявки.СоздатьЭлемент();	
		КонецЕсли;

		ЗаявкаОбъект.Заполнить(ДанныеЗаполнения);
		ЗаявкаОбъект.Записать();
			
		Возврат ЗаявкаОбъект.Ссылка;
		
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции
																																	
#КонецОбласти

#КонецОбласти

#Область СБП

#Область redirect_sbp

// Функция - Redirect sbp
//
// Параметры:
//  acquiring_id - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция redirect_sbp(acquiring_id) Экспорт
	
	СтруктураОшибки			= "";
	ЭквайринговыйТерминал	= ПолучитьСсылкуПоИдентификатору(acquiring_id, СтруктураОшибки, Истина, "ЭквайринговыеТерминалы", 1014, Истина);	
	
	Если ЗначениеЗаполнено(СтруктураОшибки) Тогда
		Возврат "Acquiring terminal not found";
	КонецЕсли;
	
	Выборка = РегистрыСведений.СтатусыОплатыЗаказов.ПолучитьДанныеПоследнегоЗаказа(ЭквайринговыйТерминал);
	
	Если Выборка = Неопределено Тогда
		Возврат "Last actual order not found";	
	КонецЕсли;
	
	СтраницаПереходаКОплате =
	"<!DOCTYPE html>
	|<html>
	|  <meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"">
	|  <style>
	|    input[type=text],
	|    select {
	|      width: 100%;
	|      padding: 25px 20px;
	|      margin: 8px 0;
	|      display: inline-block;
	|      border: 1px solid #ccc;
	|      border-radius: 4px;
	|      box-sizing: border-box;
	|      font-size: 30px;
	|      font-family: Arial;
	|    }
	|
	|    table {
	|      border-spacing: 20px;
	|      text-align: left;
	|    }
	|
	|    input[type=submit] {
	|      width: 100%;
	|      background-color: #4CAF50;
	|      color: white;
	|      padding: 14px 20px;
	|      margin: 8px auto;
	|      border: none;
	|      border-radius: 50px;
	|      cursor: pointer;
	|      font-size: 51px;
	|      font-family: Arial;
	|    }
	|
	|    input[type=submit]:hover {
	|      background-color: #45a049;
	|    }
	|
	|    div {
	|      margin-top: 0px;
	|      border-radius: 5px;
	|      background-color: #f2f2f2;
	|      padding: 27px;
	|      font-size: 30px;
	|      font-family: Arial
	|    }
	|
	|    th {
	| 	 display: table-cell;
	| 	 vertical-align: inherit;
	| 	 font-weight: inherit;
	| 	 text-align: -internal-center;
	|	 }    
	|	
	|    body {
	|      background: #ececec;
	|    }
	|
	|    .OnCenter {
	|      text-align: center;
	|    }
	|  </style>
	|  <body>
	|    <div>
	|      <form action=""{СсылкаНаОплату}"">
	|        <label for=""client"" style=""font-size:30px;text-align:center;"">Платеж ожидает оплаты</label>
	|        <p class=""OnCenter"">
	|          <a href=""{СсылкаНаОплату}"">
	|            <img id='barcode' src=""https://api.qrserver.com/v1/create-qr-code/?data={СсылкаНаОплату}&amp;size=300x300"" width=""300"" height=""300"" text-align:center />
	|          </a>
	|          <br>
	|          <br>
	|          <input type=""text"" id=""client"" readonly=true value=""{Клиент}"">
	|          <input type=""text"" id=""client"" readonly=true value=""{Организация}"">
	|          {Запасы}
	|        <input type=""text"" id=""client"" readonly=true value=""{Сумма}"" style=""text-align: right"">
	|        <input type=""submit"" value=""Перейти к оплате"">
	|      </form>
	|    </div>
	|  </body>
	|</html>";
	
	СтраницаПереходаКОплате = СтрЗаменить(СтраницаПереходаКОплате, "{СсылкаНаОплату}"		, Выборка.СсылкаОплаты);	
	СтраницаПереходаКОплате = СтрЗаменить(СтраницаПереходаКОплате, "{Клиент}"				, Выборка.КонтрагентПредставление);
	СтраницаПереходаКОплате = СтрЗаменить(СтраницаПереходаКОплате, "{Организация}"			, СтрЗаменить(Выборка.ОрганизацияПредставление, """", "&quot;"));
	СтраницаПереходаКОплате = СтрЗаменить(СтраницаПереходаКОплате, "{Запасы}"				, ПолучитьПредставлениеТоварныхПозиций(Выборка));
	СтраницаПереходаКОплате = СтрЗаменить(СтраницаПереходаКОплате, "{Сумма}"				, Строка(Выборка.Сумма) + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти());
	
	Возврат СтраницаПереходаКОплате;
	
КонецФункции                                                                         

// Функция - Получить представление товарных позиций
//
// Параметры:
//  ПараметрыДанных	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПредставлениеТоварныхПозиций(ПараметрыДанных)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтатусыОплатыЗаказов.Основание КАК Основание
	|ПОМЕСТИТЬ ВтОснований
	|ИЗ
	|	РегистрСведений.СтатусыОплатыЗаказов КАК СтатусыОплатыЗаказов
	|ГДЕ
	|	СтатусыОплатыЗаказов.НомерЗаказа = &НомерЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияЗапасы.Номенклатура.Наименование КАК Номенклатура,
	|	РеализацияЗапасы.КоличествоУпаковок КАК Количество,
	|	РеализацияЗапасы.Цена КАК Цена,
	|	РеализацияЗапасы.СуммаАвтоматическойСкидкиНаценки + РеализацияЗапасы.СуммаРучнойСкидки КАК Скидка,
	|	РеализацияЗапасы.Сумма КАК Сумма
	|ИЗ
	|	Документ.Реализация.Запасы КАК РеализацияЗапасы
	|ГДЕ
	|	РеализацияЗапасы.Ссылка В
	|			(ВЫБРАТЬ
	|				ВтОснований.Основание
	|			ИЗ
	|				ВтОснований)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияУслуги.Номенклатура.Наименование,
	|	РеализацияУслуги.КоличествоУпаковок,
	|	РеализацияУслуги.Цена,
	|	РеализацияУслуги.СуммаАвтоматическойСкидкиНаценки + РеализацияУслуги.СуммаРучнойСкидки,
	|	РеализацияУслуги.Сумма
	|ИЗ
	|	Документ.Реализация.Услуги КАК РеализацияУслуги
	|ГДЕ
	|	РеализацияУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ВтОснований.Основание
	|			ИЗ
	|				ВтОснований)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемЗапасы.Номенклатура.Наименование,
	|	ПриемЗапасы.КоличествоУпаковок,
	|	ПриемЗапасы.Цена,
	|	ПриемЗапасы.СуммаАвтоматическойСкидкиНаценки + ПриемЗапасы.СуммаРучнойСкидки,
	|	ПриемЗапасы.Сумма
	|ИЗ
	|	Документ.Прием.Запасы КАК ПриемЗапасы
	|ГДЕ
	|	ПриемЗапасы.Ссылка В
	|			(ВЫБРАТЬ
	|				ВтОснований.Основание
	|			ИЗ
	|				ВтОснований)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемЛечение.Номенклатура.Наименование,
	|	ПриемЛечение.КоличествоУпаковок,
	|	ПриемЛечение.Цена,
	|	ПриемЛечение.СуммаАвтоматическойСкидкиНаценки + ПриемЛечение.СуммаРучнойСкидки,
	|	ПриемЛечение.Сумма
	|ИЗ
	|	Документ.Прием.Лечение КАК ПриемЛечение
	|ГДЕ
	|	ПриемЛечение.Ссылка В
	|			(ВЫБРАТЬ
	|				ВтОснований.Основание
	|			ИЗ
	|				ВтОснований)");
	
	Запрос.УстановитьПараметр("НомерЗаказа", ПараметрыДанных.НомерЗаказа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	Запасы = РезультатЗапроса.Выгрузить();
	
	ПредставлениеТаблицы = "<tr><th style=""font-weight:bold;"">Наименование</th><th style=""font-weight:bold;"">Кол.</th><th style=""font-weight:bold;"">Цена</th><th style=""font-weight:bold;"">Скидка</th><th style=""font-weight:bold;"">Сумма</th></tr>";
	
	Для Каждого СтрокаТЗ Из Запасы Цикл
		ПредставлениеТаблицы = ПредставлениеТаблицы + "<tr><th>"+СтрокаТЗ.Номенклатура+"</th>"+"<th>"+СтрокаТЗ.Количество+"</th>"+"<th>"+СтрокаТЗ.Цена+"</th>"+"<th>"+СтрокаТЗ.Скидка+"</th>"+"<th>"+СтрокаТЗ.Сумма+"</th></tr>";	
	КонецЦикла;
	
	Возврат "<table style=""width: 100%;"">" + ПредставлениеТаблицы + "</table>"; 
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область МетодыПроверкиПередаваемыхПараметров

// Функция проводит аутентификацию приложения
// 
Функция ПроверитьКлючПриложения(ApiKey, ВнешняяСистема = Неопределено, ТипВнешнейСистемы = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(ApiKey) Тогда
		Возврат ПолучитьСтруктуруВозвратаОшибки(1062);
	КонецЕсли;
	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(ApiKey, ТипВнешнейСистемы);
	Если НЕ ЗначениеЗаполнено(ВнешняяСистема) Тогда
		Возврат ПолучитьСтруктуруВозвратаОшибки(1063);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Функция проводит аутентификацию клиента
// 
Функция ПроверитьКлючКлиента(UserToken, Клиент, НомерТелефона = Неопределено, Пароль = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(UserToken) Тогда
		Возврат ПолучитьСтруктуруВозвратаОшибки(1066);
	КонецЕсли;
	
	СтруктураДанных = РегистрыСведений.КлючиВнешнихСистем.ПолучитьДанныеКлючаВнешнейСистемы(UserToken);
	
	Если СтруктураДанных = Неопределено Тогда
		Возврат ПолучитьСтруктуруВозвратаОшибки(1067);
	Иначе		
		Клиент 			= СтруктураДанных.Клиент;
		НомерТелефона	= СтруктураДанных.НомерТелефона;
		Пароль			= СтруктураДанных.Пароль;		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Функция проверяет введенную дату записи
//
Функция ПроверитьДатуЗаписи(ДатаЗаписи)
	
	Если НЕ ЗначениеЗаполнено(ДатаЗаписи) Тогда
		Возврат ПолучитьСтруктуруВозвратаОшибки(1061);
	КонецЕсли;
	
	Дата = ПолучитьДату(ДатаЗаписи);
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Возврат ПолучитьСтруктуруВозвратаОшибки(1054);
	КонецЕсли;
	
	Возврат Новый Структура("ДатаЗаписи", Дата);
	
КонецФункции

// Функция проверяет введенный ИДУслуги
//
Функция ПроверитьИДУслуги(ИДУслуги)
	
	Если НЕ ЗначениеЗаполнено(ИДУслуги) Тогда			
 		Возврат ПолучитьСтруктуруВозвратаОшибки(1051);
	КонецЕсли;
	
	Услуга = ПолучитьСсылкуОбъектаПоУИД(ИДУслуги, "Справочники", "Номенклатура");
	Если НЕ ЗначениеЗаполнено(Услуга) Тогда
		Возврат ПолучитьСтруктуруВозвратаОшибки(1051);
	КонецЕсли;
	
	Возврат Новый Структура("Услуга", Услуга);
	
КонецФункции

// Функция проверяет введенный ИДСотрудника
//
Функция ПроверитьИДСотрудника(ИДСотрудника)
	
	Если НЕ ЗначениеЗаполнено(ИДСотрудника) Тогда
		Возврат ПолучитьСтруктуруВозвратаОшибки(1050);
	КонецЕсли;
	
	Сотрудник = ПолучитьСсылкуОбъектаПоУИД(ИДСотрудника, "Справочники", "Сотрудники");
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат ПолучитьСтруктуруВозвратаОшибки(1050);
	КонецЕсли;
	
	Возврат Новый Структура("Сотрудник", Сотрудник);
	
КонецФункции

#КонецОбласти

// Функция, возвращает структуру с заголовками запроса в нижнем регистре.
//
Функция ПолучитьСоответствиеЗаголовков(Запрос)
	
	СоответствиеСЗаголовками = Новый Соответствие;
	
	Для Каждого Заголовок Из Запрос.Заголовки Цикл
		
		Если НРег(Заголовок.Ключ) = "connection" ИЛИ НРег(Заголовок.Ключ) = "host" ИЛИ НРег(Заголовок.Ключ) = "content-length" Тогда
			Продолжить;
		КонецЕсли;
		
		СоответствиеСЗаголовками.Вставить(НРег(Заголовок.Ключ), Заголовок.Значение);
		
	КонецЦикла;
	
	Возврат СоответствиеСЗаголовками;
	
КонецФункции

// Функция, возвращает ссылку по УИД.
//
Функция ПолучитьСсылкуОбъектаПоУИД(УИД, ВидОбъекта, ИмяОбъекта)
	
	Попытка
		Выполнить("ВидОбъекта = " + ВидОбъекта);
		Ссылка = ВидОбъекта[ИмяОбъекта].ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Ссылка = Неопределено;
		КонецЕсли;
	Исключение
		Ссылка = Неопределено;
	КонецПопытки;
	
	Возврат Ссылка;
	
КонецФункции

// Функция, возвращает HTTPОтвет. 
//
Функция ПолучитьHTTPОтвет(Ответ1с, КодОтвета = Неопределено)
	
	КодОтвета = ?(КодОтвета = Неопределено, 200, КодОтвета);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(ЗаписьJSON, Ответ1С);
	мОтвет = ЗаписьJSON.Закрыть();
	HTTPОтвет = Новый HTTPСервисОтвет(КодОтвета);
	HTTPОтвет.УстановитьТелоИзСтроки(мОтвет);
	HTTPОтвет.Заголовки["Content-Type"] = "application/json";
	
	Возврат HTTPОтвет;
	
КонецФункции

// Функция, возвращает структуру возврата ошибки. 
//
Функция ПолучитьСтруктуруВозвратаОшибки(КодОшибки = Неопределено, ОписаниеОшибки = "", ВернутьПустуюСтруктуру = Ложь)
	
	Если ВернутьПустуюСтруктуру Тогда
		Возврат Новый Структура("code, message", 0, "");
	КонецЕсли;
	
	СтруктураОшибки = Новый Структура("code, message", КодОшибки, ПолучитьОписаниеОшибки(КодОшибки, ОписаниеОшибки));
	Возврат Новый Структура("Parameters, Errors",, СтруктураОшибки);
	
КонецФункции

// Функция, возвращает описание ошибки по коду.
//
Функция ПолучитьОписаниеОшибки(КодОшибки, ДополнительноеОписание = "") Экспорт
	
	Если КодОшибки = 1000 Тогда
		Возврат "Ошибка работы с базой данных." + ДополнительноеОписание;		
	ИначеЕсли КодОшибки = 1040 Тогда
		Возврат "Не найден метод";
	ИначеЕсли КодОшибки = 1050 Тогда
		Возврат "Не найден сотрудник";
	ИначеЕсли КодОшибки = 1051 Тогда
		Возврат "Не найдена услуга";
	ИначеЕсли КодОшибки = 1052 Тогда
		Возврат "Не задан временной интервал";
	ИначеЕсли КодОшибки = 1053 Тогда
		Возврат "Не найдена предварительная запись";
	ИначеЕсли КодОшибки = 1054 Тогда
		Возврат "Неверный формат даты";
	ИначеЕсли КодОшибки = 1055 Тогда
		Возврат "Не найдена структурная единица";
	ИначеЕсли КодОшибки = 1056 Тогда
		Возврат "Не найдена предварительная запись";
	ИначеЕсли КодОшибки = 1057 Тогда
		Возврат "Не выбрана кассовая смена";
	ИначеЕсли КодОшибки = 1058 Тогда
		Возврат "Не найдена кассовая смена";
	ИначеЕсли КодОшибки = 1059 Тогда
		Возврат "Не задан номер чека";
	ИначеЕсли КодОшибки = 1060 Тогда
		Возврат "Неверная структура массива оплат";
	ИначеЕсли КодОшибки = 1061 Тогда
		Возврат "Не указано время начала приема";
	ИначеЕсли КодОшибки = 1062 Тогда
		Возврат "Не указан ключ авторизации";
	ИначеЕсли КодОшибки = 1063 Тогда
		Возврат "Неверный ключ авторизации";
	ИначеЕсли КодОшибки = 1064 Тогда
		Возврат "Не указан логин";
	ИначеЕсли КодОшибки = 1065 Тогда
		Возврат "Неверный код подтверждения";
	ИначеЕсли КодОшибки = 1066 Тогда
		Возврат "Не указан ключ клиента";
	ИначеЕсли КодОшибки = 1067 Тогда
		Возврат "Неверный ключ клиента";
	ИначеЕсли КодОшибки = 1068 Тогда
		Возврат "Код подтверждения не действителен";
	ИначеЕсли КодОшибки = 1071 Тогда
		Возврат "Не задан массив записи";	
	ИначеЕсли КодОшибки = 1080 Тогда
		Возврат "Не найдено сотрудников, способных оказать переданный массив услуг";	
	ИначеЕсли КодОшибки = 1100 Тогда
		Возврат "Не найден сотрудник, который может оказать выбранную услугу";
	ИначеЕсли КодОшибки = 1101 Тогда
		Возврат "Не найден сотрудник, который может оказать услугу в выбранное время";
	ИначеЕсли КодОшибки = 1102 Тогда
		Возврат "Сотрудник не работает в указанное время";
	ИначеЕсли КодОшибки = 1103 Тогда
		Возврат "Совпадает время услуг в переданном массиве";
	ИначеЕсли КодОшибки = 1106 Тогда
		Возврат "Нет сотрудников, способных оказать услугу " + ДополнительноеОписание;
	ИначеЕсли КодОшибки = 1110 Тогда
		Возврат "Не удалось отправить СМС-сообщение с кодом подтверждения";
	ИначеЕсли КодОшибки = 1111 Тогда
		Возврат "Остатка на лицевом счете клиента недостаточно для оплаты";
	ИначеЕсли КодОшибки = 1112 Тогда
		Возврат "Не удалось обновить информацию о клиенте" + ДополнительноеОписание;
	ИначеЕсли КодОшибки = 1113 Тогда
		Возврат "Визит недоступен для отмены";
	ИначеЕсли КодОшибки = 1114 Тогда
		Возврат "Массив переданных услуг нельзя оказывать одновременно";
	ИначеЕсли КодОшибки = 1115 Тогда
		Возврат ?(Не ЗначениеЗаполнено(ДополнительноеОписание), "Услуга недоступна для записи в выбранное время", ДополнительноеОписание);
	ИначеЕсли КодОшибки = 1116 Тогда
		Возврат "Параметр amount должен быть больше нуля";	
	ИначеЕсли КодОшибки = 1117 Тогда
		Возврат "Не найдена группа онлайн продажи";
	ИначеЕсли КодОшибки = 1118 Тогда
		Возврат "Строка поиска передана неверно";
	ИначеЕсли КодОшибки = 1119 Тогда
		Возврат "Строка поиска должна содержать хотя бы 3 символа";
	ИначеЕсли КодОшибки = 1120 Тогда
		Возврат "Не удалось отправить сообщение в мессенджер с кодом подтверждения по причине: " + ДополнительноеОписание;
	ИначеЕсли КодОшибки = 1121 Тогда
		Возврат "Неверный тип внешней системы.";
	ИначеЕсли КодОшибки = 1122 Тогда
		Возврат "Сумма визита больше, чем переданная сумма оплаты";
	ИначеЕсли КодОшибки = 1123 Тогда
		Возврат "Визит не требует предоплаты";
	ИначеЕсли КодОшибки = 1124 Тогда
		Возврат "Бонусный счет не найден";
	ИначеЕсли КодОшибки = 1125 Тогда
		Возврат "Передан неверный визит";
	ИначеЕсли КодОшибки = 1126 Тогда
		Возврат "Для использования предоплаты услуг необходимо включить соотвествующую настройку в структурной единице";
	ИначеЕсли КодОшибки = 1127 Тогда
		Возврат "Ошибка при записи в регистр Рекламные данные " + ДополнительноеОписание;
	ИначеЕсли КодОшибки = 1128 Тогда
		Возврат "Не удалось отправить письмо на почту с кодом подтверждения по причине: " + ДополнительноеОписание;
	ИначеЕсли КодОшибки = 1129 Тогда
		Возврат "Не найдено заказов по данному id";
	ИначеЕсли КодОшибки = 1130 Тогда
		Возврат "Не найдена причина записи";
	ИначеЕсли КодОшибки = 1131 Тогда
		Возврат "На данное время у сотрудника запланирован приём";						
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Функция, преобразует строку в дату.
//
Функция ПолучитьДату(СтроковаяДата)
	
	Попытка
		
		СтроковаяДата = СтрЗаменить(СтроковаяДата , "-","");
		СтроковаяДата = СтрЗаменить(СтроковаяДата , ":","");
		СтроковаяДата = СтрЗаменить(СтроковаяДата , "T","");
		СтроковаяДата = СтроковаяДата + "00";
		
		Возврат Дата(СтроковаяДата);
		
	Исключение
		Возврат Неопределено;		
	КонецПопытки;
	
КонецФункции

// Функция возвращает смены сотрудников, минимальную длительность услуги сотрудника
//
Функция ПолучитьГрафикРаботыСотрудников(МассивСотрудников,
										СтруктурнаяЕдиница,
										ДатаСреза = Неопределено,
										НачалоПериода = Неопределено,
										КонецПериода = Неопределено)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремяРаботыСотрудниковПлан.Сотрудник КАК Сотрудник,
	|	ВремяРаботыСотрудниковПлан.ДатаВремяНачала КАК ДатаВремяНачала,
	|	ВремяРаботыСотрудниковПлан.ДатаВремяОкончания КАК ДатаВремяОкончания
	|ИЗ
	|	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
	|ГДЕ
	|	ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ВремяРаботыСотрудниковПлан.Сотрудник В(&МассивСотрудников)
	|	И &УсловиеВремяСмены
	|	И &УсловиеМассивСотрудников
	|
	|СГРУППИРОВАТЬ ПО
	|	ВремяРаботыСотрудниковПлан.Сотрудник,
	|	ВремяРаботыСотрудниковПлан.ДатаВремяНачала,
	|	ВремяРаботыСотрудниковПлан.ДатаВремяОкончания");	
	
	Запрос.УстановитьПараметр("МассивСотрудников" , МассивСотрудников);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ДатаСреза"		  , ?(ЗначениеЗаполнено(ДатаСреза), ДатаСреза, ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("НачалоПериода"     , НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода"      , КонецПериода);
	
	
	Если ЗначениеЗаполнено(НачалоПериода)
		И ЗначениеЗаполнено(КонецПериода) Тогда
		
		УсловиеВремяСмены = "И ((ВремяРаботыСотрудниковПлан.ДатаВремяНачала >= &НачалоПериода
						    |И ВремяРаботыСотрудниковПлан.ДатаВремяНачала < &КонецПериода)
						    |ИЛИ (ВремяРаботыСотрудниковПлан.ДатаВремяОкончания > &НачалоПериода
						    |И ВремяРаботыСотрудниковПлан.ДатаВремяОкончания <= &КонецПериода)
							|ИЛИ (ВремяРаботыСотрудниковПлан.ДатаВремяНачала <= &НачалоПериода
						    |И ВремяРаботыСотрудниковПлан.ДатаВремяОкончания >= &КонецПериода))";
	Иначе
		
		УсловиеВремяСмены = "И ВремяРаботыСотрудниковПлан.ДатаВремяОкончания > &ДатаСреза"
			+ ?(ЗначениеЗаполнено(ДатаСреза), " И ВремяРаботыСотрудниковПлан.ДатаВремяНачала <= &ДатаСреза", "");
		
	КонецЕсли;
	Запрос.Текст             = СтрЗаменить(Запрос.Текст, "И &УсловиеВремяСмены", УсловиеВремяСмены);
	
	УсловиеМассивСотрудников = ?(ЗначениеЗаполнено(МассивСотрудников), "И ВремяРаботыСотрудниковПлан.Сотрудник В (&МассивСотрудников)", "");
	Запрос.Текст             = СтрЗаменить(Запрос.Текст, "И &УсловиеМассивСотрудников", УсловиеМассивСотрудников);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция, возвращает приемы сотрудников.
//
Функция ПолучитьПриемыСотрудников(МассивСотрудников, СтруктурнаяЕдиница, ДатаСреза = Неопределено, НачалоПериода = Неопределено, КонецПериода = Неопределено)
		
	Возврат Документы.Прием.ПолучитьПриемыИЗаписиСотрудников(
		СтруктурнаяЕдиница, 
		МассивСотрудников, 
		ДатаСреза, 
		НачалоПериода, 
		КонецПериода, 
		Перечисления.РольПользователя.Врач);
	
КонецФункции

// Функция - Получить минимальную норму времени услуг
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМинимальнуюНормуВремениУслуг()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА Номенклатура.НормаВремени > 0
	|				ТОГДА Номенклатура.НормаВремени
	|			ИНАЧЕ 30
	|		КОНЕЦ) КАК НормаВремени
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.НормаВремени, 30);
	
КонецФункции

// Функция, проверяет входит ли прием в смену.
//
Функция ПриемВходитВСмену(Прием, Смена)
	
	Если (Прием.ДатаНачала >= Смена.ДатаВремяНачала
		И Прием.ДатаНачала < Смена.ДатаВремяОкончания)
		ИЛИ (Прием.ДатаОкончания > Смена.ДатаВремяНачала
		И Прием.ДатаОкончания <= Смена.ДатаВремяОкончания) Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Функция, проверяет, накладывается ли время одной услуги в записи на другую
//
Функция ВремяУслугСовпадает(СтрокаУслуга1, СтрокаУслуга2)
	
	РазницаМеждуНачаломУслуги1ИУслуги2 = НачалоМинуты(СтрокаУслуга1.ДатаЗаписи) - НачалоМинуты(СтрокаУслуга2.ДатаЗаписи);
	
	Если (РазницаМеждуНачаломУслуги1ИУслуги2 > 0 И НачалоМинуты(СтрокаУслуга1.ДатаЗаписи) < НачалоМинуты(СтрокаУслуга2.ДатаЗаписи + СтрокаУслуга2.НормаВремени))
		ИЛИ (РазницаМеждуНачаломУслуги1ИУслуги2 < 0 И НачалоМинуты(СтрокаУслуга2.ДатаЗаписи) < НачалоМинуты(СтрокаУслуга1.ДатаЗаписи + СтрокаУслуга1.НормаВремени)) 
		ИЛИ (РазницаМеждуНачаломУслуги1ИУслуги2 = 0) Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Функция, определяет оказывает ли услугу сотрудник.
// 
Функция СотрудникОказываетУслугу(СтруктурнаяЕдиница, Сотрудник, Услуга)
	
	Возврат РегистрыСведений.УслугиСотрудника.УслугаДоступнаДляСотрудника(Услуга, Сотрудник, СтруктурнаяЕдиница);
	
КонецФункции

#Область РаботаСДаннымиКлиента

// Процедура - Создать нового клиента
//
// Параметры:
//  НомерТелефона	 - 	 - 
//
// Функция, создает элемент справочника "Контрагенты".
//
Функция СоздатьКлиента(Знач phone, 
					   СтруктурнаяЕдиница,
					   last_name,
					   name,
					   second_name = Неопределено,
					   email = Неопределено,
					   birthday = Неопределено,
					   sex = Неопределено,
					   ВнешняяСистема = Неопределено)
	
	КлиентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	Родитель 	 = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтруктурнаяЕдиница, "ГруппаКлиентов");
    Родитель	 = ?(ЗначениеЗаполнено(Родитель), Родитель, Справочники.Контрагенты.ПолучитьПапкуПоТипу(Перечисления.ТипыКонтрагентов.Клиенты));
	
	КлиентОбъект.Заполнить(Новый Структура("ТипКонтрагента, Родитель", Перечисления.ТипыКонтрагентов.Клиенты, Родитель));
	
	КлиентОбъект.Имя 		  		 = ?(ЗначениеЗаполнено(name), name, phone);
	КлиентОбъект.Фамилия 	  		 = last_name;
	КлиентОбъект.Отчество 	  		 = second_name;
	КлиентОбъект.Наименование 		 = КлиентОбъект.Фамилия + ?(ЗначениеЗаполнено(КлиентОбъект.Фамилия), " ", "") + КлиентОбъект.Имя + ?(ЗначениеЗаполнено(КлиентОбъект.Имя), " ", "") + КлиентОбъект.Отчество;
	КлиентОбъект.ПолКлиента 		 = ?(ЗначениеЗаполнено(sex), ПолучитьПолКлиента(sex), ПолучитьПолКлиентаПоФИО(name));
	
	Если ЗначениеЗаполнено(ВнешняяСистема) Тогда 
		КаналПривлечения = ПолучитьНаименованиеКаналаПривлечения(ВнешняяСистема);
		КлиентОбъект.КаналПривлечения = Справочники.КаналыПривлечения.ПолучитьКаналПривлечения(КаналПривлечения);
	КонецЕсли;
	
	Попытка
		Если ЗначениеЗаполнено(birthday) Тогда
			КлиентОбъект.ДатаРожденияКлиента = Дата(Сред(birthday,7), Сред(birthday,4,2), Сред(birthday,1,2)); 
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если ЗначениеЗаполнено(phone) Тогда
		ЗаполнитьТелефон(КлиентОбъект, phone);
	КонецЕсли;
	Если ЗначениеЗаполнено(email) Тогда
		ЗаполнитьАдресЭлектроннойПочты(КлиентОбъект, email);
	КонецЕсли;
	
	КлиентОбъект.Записать();
	
	Возврат КлиентОбъект.Ссылка;
	
КонецФункции

// Функция, определяет пол клиента по ФИО.
//
Функция ПолучитьПолКлиентаПоФИО(Имя, Фамилия = "", Отчество = "")
	
	Если ЗначениеЗаполнено(Имя) ИЛИ ЗначениеЗаполнено(Фамилия) ИЛИ ЗначениеЗаполнено(Отчество) Тогда
		ПолКлиента = ОбщегоНазначенияСтоматология.ОпределитьПолКлиента(Фамилия, Имя, Отчество);
		Если ПолКлиента = "Мужской" Тогда
			Возврат Перечисления.ПолФизическогоЛица.Мужской;
		ИначеЕсли ПолКлиента = "Женский" Тогда
			Возврат Перечисления.ПолФизическогоЛица.Женский;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Функция, возвращает структуру XDTO телефона.
// 
Функция ПолучитьСтруктуру_XDTO(Представление, ТипКИ)
	
	Если НЕ ЗначениеЗаполнено(Представление) Тогда
		Возврат Неопределено;
	КонецЕсли;	
		
	Объект_XDTO = УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияXDTOПоПредставлению(Представление, ТипКИ);
	Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда 
		Если НЕ ЗначениеЗаполнено(Объект_XDTO.Состав.Номер) Тогда 
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Объект_XDTO;
	
КонецФункции

// Процедура, добаляет телефон в контактную информация клиента.
// 
Процедура ЗаполнитьТелефон(НовыйЭлемент, НомерТелефона)
	
	Объект_XDTO_Телефон = ПолучитьСтруктуру_XDTO(НомерТелефона, Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	Если Объект_XDTO_Телефон = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	НоваяСтрока 						= НовыйЭлемент.КонтактнаяИнформация.Добавить();
	НоваяСтрока.Тип 					= Перечисления.ТипыКонтактнойИнформации.Телефон;
	НоваяСтрока.Вид 					= Справочники.ВидыКонтактнойИнформации.ТелефонКлиента;
	НоваяСтрока.НомерТелефона 			= СокрЛП(Объект_XDTO_Телефон.Состав.КодСтраны) + СокрЛП(Объект_XDTO_Телефон.Состав.КодГорода) + СокрЛП(Объект_XDTO_Телефон.Состав.Номер);
	НоваяСтрока.НомерТелефонаБезКодов	= Объект_XDTO_Телефон.Состав.Номер;
	НоваяСтрока.Представление		 	= Объект_XDTO_Телефон.Представление;
	НоваяСтрока.ЗначенияПолей		 	= УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(Объект_XDTO_Телефон);
	
КонецПроцедуры

// Функция, возвращает массив телефонов клиента.
//
Функция ПолучитьМассивТелефоновКлиента(Контрагент)
	
	МассивТелефонов = Новый Массив;
	
	Для Каждого СтрокаТЧ Из Контрагент.КонтактнаяИнформация Цикл
		Если СтрокаТЧ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			МассивТелефонов.Добавить(СтрокаТЧ.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивТелефонов;
	
КонецФункции

// Функция, возвращает наименование канала привлечения для внешней системы.
//
Функция ПолучитьНаименованиеКаналаПривлечения(ВнешняяСистема, СозданиеЗаявки = Ложь)
		
	Если ЗначениеЗаполнено(ВнешняяСистема) Тогда
		ТипВнешнейСистемы = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ВнешняяСистема, "ТипВнешнейСистемы");
		Если ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ПроДокторов Тогда
			Возврат "ПроДокторов";
		Иначе
			Возврат "Онлайн запись"; 
		КонецЕсли; 
	Иначе
		Возврат "Онлайн запись";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

// Функция, возвращает массив service_ids из параметров запроса.
// 
Функция ПолучитьМассив_service_ids(ПараметрыЗапроса)
	
	ТекстJSON = ПараметрыЗапроса.Получить("service_ids");
	
	Если ЗначениеЗаполнено(ТекстJSON) Тогда
		
		Попытка
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстJSON);
			ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);
			
			Возврат ПараметрыJSON.services_array;
			
		Исключение
			Возврат Неопределено;
		КонецПопытки;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции 

// Функция, сериализует json в массив.
// 
Функция ПолучитьМассивИзJson(МассивJson, ИмяПараметра)
	
	Если ЗначениеЗаполнено(МассивJson) Тогда
		
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(МассивJson);
			ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);
		Исключение
			Возврат Неопределено; 
		КонецПопытки;
		
		Возврат ?(ПараметрыJSON.Свойство(ИмяПараметра) И ТипЗнч(ПараметрыJSON[ИмяПараметра]) = Тип("Массив"), ПараметрыJSON[ИмяПараметра], Неопределено);
		
	Иначе
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
КонецФункции

// Функция - Получить и проверить дату
//
// Параметры:
//  datetime			 - 	 - 
//  СтруктураОшибки		 - 	 - 
//  ОбязательныйПараметр - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьИПроверитьДату(datetime, СтруктураОшибки, ОбязательныйПараметр = Ложь)
	
	Дата = Неопределено;
	
	Если ЗначениеЗаполнено(datetime) Тогда
		Если ТипЗнч(datetime) = Тип("Строка") Тогда 
			Дата = ПолучитьДату(datetime);
		ИначеЕсли ТипЗнч(datetime) = Тип("Дата") Тогда 
			Дата = datetime;
		Иначе 
			Дата = Неопределено;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Дата) Тогда
			СтруктураОшибки = ПолучитьСтруктуруВозвратаОшибки(1054);
		КонецЕсли;
		
	ИначеЕсли ОбязательныйПараметр Тогда
		Возврат ПолучитьСтруктуруВозвратаОшибки(1061);
	КонецЕсли;
	
	Возврат Дата;
	
КонецФункции

// Функция, проверяет переданное занятие.
//
Функция ПолучитьСсылкуПоИдентификатору(Идентификатор, СтруктураОшибки, ЭтоСправочник = Истина, ИмяОбъекта, КодОшибки, ОбязательныйПараметр = Ложь)
	
	Ссылка = Неопределено;
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		
		Ссылка = ПолучитьСсылкуОбъектаПоУИД(Идентификатор, ?(ЭтоСправочник, "Справочники", "Документы"), ИмяОбъекта);
		Если Ссылка = Неопределено Тогда
			СтруктураОшибки = ПолучитьСтруктуруВозвратаОшибки(КодОшибки);
		КонецЕсли;
		
	ИначеЕсли ОбязательныйПараметр Тогда
		СтруктураОшибки = ПолучитьСтруктуруВозвратаОшибки(КодОшибки);
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

// Функция, возвращает минимальную и максимальную цены номенклатуры.
// 
Функция ПолучитьЦеныНоменклатуры(Номенклатура, ТаблицаВидовЦен)
	
	МассивСтрок = ТаблицаВидовЦен.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
	
	Если МассивСтрок.Количество() = 0 Тогда
		МассивСтрок = ТаблицаВидовЦен.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
	КонецЕсли;
	
	МинимальнаяЦена  = ?(МассивСтрок.Количество() > 0, МассивСтрок[0].Цена, 0);
	МаксимальнаяЦена = ?(МассивСтрок.Количество() > 0, МассивСтрок[0].Цена, 0);
	
	Для Каждого СтрокаТЧ Из МассивСтрок Цикл
		МинимальнаяЦена  = ?(СтрокаТЧ.Цена < МинимальнаяЦена, СтрокаТЧ.Цена, МинимальнаяЦена);
		МаксимальнаяЦена = ?(СтрокаТЧ.Цена > МаксимальнаяЦена, СтрокаТЧ.Цена, МаксимальнаяЦена);
	КонецЦикла;
	
	Возврат Новый Структура("МинимальнаяЦена, МаксимальнаяЦена", МинимальнаяЦена, МаксимальнаяЦена);
	
КонецФункции

// Функция - Получить дату среза
//
// Параметры:
//  ДатаСреза			 - 	 - 
//  ДатаСрезаЗаполнена	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
функция ПолучитьДатуСреза(ДатаСреза, ДатаСрезаЗаполнена = Ложь, СтруктурнаяЕдиница = Неопределено)
	
	ПараметрыВремениРаботыСЕ = Справочники.СтруктурныеЕдиницы.ВремяРаботыСтруктурнойЕдиницы(ДатаСреза
																			, ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница)
																			,
																			, Ложь); 
																			
	Если ЗначениеЗаполнено(ПараметрыВремениРаботыСЕ) Тогда 
		Если ДатаСрезаЗаполнена Тогда
			Если ДатаСреза < ПараметрыВремениРаботыСЕ.НачалоРаботы Тогда 
				ДатаСреза = ПараметрыВремениРаботыСЕ.НачалоРаботы;
			ИначеЕсли ДатаСреза > ПараметрыВремениРаботыСЕ.ОкончаниеРаботы Тогда 
				ДатаСреза = НачалоДня(ДатаСреза) + 24*60*60;
				ПолучитьДатуСреза(ДатаСреза, ДатаСрезаЗаполнена, СтруктурнаяЕдиница);
				Возврат ДатаСреза;
			КонецЕсли;	
		Иначе 	
			Если ТекущаяДатаСеанса() < ПараметрыВремениРаботыСЕ.НачалоРаботы Тогда 
				ДатаСреза = ПараметрыВремениРаботыСЕ.НачалоРаботы;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	ВремяОграниченияНачалаОнлайнЗаписи = Константы.ВремяОграниченияНачалаОнлайнЗаписи.Получить();
	ВремяОграниченияНачалаОнлайнЗаписи = ВремяОграниченияНачалаОнлайнЗаписи * 60;
	ОнлайнЗаписьВозможнаНа       	   = ТекущаяДатаСеанса() + ВремяОграниченияНачалаОнлайнЗаписи;
	
	Если ДатаСрезаЗаполнена Тогда  			
		ДатаСреза = ?(ДатаСреза < ОнлайнЗаписьВозможнаНа, ОнлайнЗаписьВозможнаНа, ДатаСреза);  
	Иначе     		
		ДатаСреза = ОнлайнЗаписьВозможнаНа;
	КонецЕсли;
	
	Возврат ДатаСреза;
	
КонецФункции

// Функция - Получить структуру id title
//
// Параметры:
//  Ссылка									 - 	 - 
//  Наименование							 - 	 - 
//  ВернутьНеопределеноПриОтсутствииСсылки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтруктуру_id_title(Ссылка, Наименование, ВернутьНеопределеноПриОтсутствииСсылки = Ложь)
	
	Если ВернутьНеопределеноПриОтсутствииСсылки И Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Неопределено;
	Иначе
		
		СтруктураIdTitle = Новый Структура;
		СтруктураIdTitle.Вставить("id"   , ?(ЗначениеЗаполнено(Ссылка)      , Строка(Ссылка.УникальныйИдентификатор()), Неопределено));
		СтруктураIdTitle.Вставить("title", ?(ЗначениеЗаполнено(Наименование), Наименование                      	  , Неопределено));
		
		Возврат СтруктураIdTitle;
		
	КонецЕсли;
	
КонецФункции

// Функция - Получить массив услуг по идентификаторам
//
// Параметры:
//  service_ids		 - 	 - 
//  service_id		 - 	 - 
//  СтруктураОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивУслугПоИдентификаторам(service_ids, service_id, СтруктураОшибки)
	
	МассивУслуг = Новый Массив;
	
	Если ЗначениеЗаполнено(service_ids) Тогда
		МассивУслуг = ПолучитьМассивСсылокПоИдентификаторам(service_ids, СтруктураОшибки,, "Номенклатура", 1051);
	ИначеЕсли ЗначениеЗаполнено(service_id) Тогда
		МассивУслуг = ПолучитьМассивСсылокПоИдентификаторам(service_id , СтруктураОшибки,, "Номенклатура", 1051);
	КонецЕсли;
	
	Возврат МассивУслуг;
	
КонецФункции

// Функция, возвращает таблицу сотрудников с нормой времени для последовательного выполнения массива услуг.
// 
Функция ПолучитьСотрудниковСпособныхОказатьМассивУслуг(СтруктурнаяЕдиница, МассивУслуг, ДатаСреза)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыСотрудников.Объект КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА НастройкиСотрудников.ВидЦен = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЦен.Розничная)
	|		ИНАЧЕ НастройкиСотрудников.ВидЦен
	|	КОНЕЦ КАК ВидЦен,
	|	УслугиСотрудника.Номенклатура КАК Номенклатура,
	|	УслугиСотрудника.НормаВремени КАК НормаВремени
	|ПОМЕСТИТЬ ТаблицаСотрудниковИУслуг
	|ИЗ
	|	РегистрСведений.РеквизитыОбъектов КАК РеквизитыСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|		ПО РеквизитыСотрудников.СтруктурнаяЕдиница = НастройкиСотрудников.СтруктурнаяЕдиница
	|			И РеквизитыСотрудников.Объект = НастройкиСотрудников.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УслугиСотрудника КАК УслугиСотрудника
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыОбъектов КАК РеквизитыНоменклатуры
	|			ПО УслугиСотрудника.СтруктурнаяЕдиница = РеквизитыНоменклатуры.СтруктурнаяЕдиница
	|				И УслугиСотрудника.Номенклатура = РеквизитыНоменклатуры.Объект
	|				И (РеквизитыНоменклатуры.Реквизит = ""ОнлайнЗапись"")
	|		ПО РеквизитыСотрудников.Объект = УслугиСотрудника.Сотрудник
	|ГДЕ
	|	НЕ РеквизитыСотрудников.Объект.ЭтоГруппа
	|	И НЕ РеквизитыСотрудников.Объект.ПометкаУдаления
	|	И РеквизитыСотрудников.Значение = ИСТИНА
	|	И РеквизитыСотрудников.Реквизит = ""ОнлайнЗаписьСотрудник""
	|	И РеквизитыСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И РеквизитыСотрудников.Объект ССЫЛКА Справочник.Сотрудники
	|	И УслугиСотрудника.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И УслугиСотрудника.Номенклатура.НормаВремени > 0
	|	И УслугиСотрудника.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И РеквизитыНоменклатуры.Значение = ИСТИНА
	|	И УслугиСотрудника.Номенклатура В(&МассивУслуг)
	|	И (ВЫРАЗИТЬ(РеквизитыСотрудников.Объект КАК Справочник.Сотрудники).Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.Врач)
	|			ИЛИ ВЫРАЗИТЬ(РеквизитыСотрудников.Объект КАК Справочник.Сотрудники).Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.ГлавныйВрач))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСотрудниковИУслуг.Сотрудник КАК Сотрудник,
	|	ТаблицаСотрудниковИУслуг.Номенклатура КАК Номенклатура,
	|	ТаблицаСотрудниковИУслуг.НормаВремени КАК НормаВремени
	|ПОМЕСТИТЬ ТаблицаСотрудниковИУслуг2
	|ИЗ
	|	ТаблицаСотрудниковИУслуг КАК ТаблицаСотрудниковИУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаСреза, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ЦеныСрезПоследних
	|		ПО ТаблицаСотрудниковИУслуг.Номенклатура = ЦеныСрезПоследних.Номенклатура
	|			И ТаблицаСотрудниковИУслуг.ВидЦен = ЦеныСрезПоследних.ВидЦен
	|ГДЕ
	|	(ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) <> 0
	|			ИЛИ ТаблицаСотрудниковИУслуг.Номенклатура.Бесплатно)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСотрудниковИУслуг2.Сотрудник КАК Сотрудник,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаСотрудниковИУслуг2.Номенклатура) КАК КоличествоДоступныхНоменклатур,
	|	СУММА(ТаблицаСотрудниковИУслуг2.НормаВремени) КАК ОбщаяНормаВремени
	|ПОМЕСТИТЬ ТаблицаСотрудниковСОбщейНормойВремени
	|ИЗ
	|	ТаблицаСотрудниковИУслуг2 КАК ТаблицаСотрудниковИУслуг2
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСотрудниковИУслуг2.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСотрудников.Сотрудник КАК Сотрудник,
	|	ТаблицаСотрудников.Сотрудник.ПредставлениеДляОнлайнЗаписи КАК Наименование,
	|	ТаблицаСотрудников.Сотрудник.Должность КАК Должность,
	|	ТаблицаСотрудников.Сотрудник.Должность.Наименование КАК ДолжностьНаименование,
	|	ВЫРАЗИТЬ(ТаблицаСотрудников.Сотрудник.ОписаниеДляСайтаHTML КАК СТРОКА(1000)) КАК ОписаниеДляСайтаHTML,
	|	ТаблицаСотрудников.Сотрудник.APIВес КАК Вес,
	|	ТаблицаСотрудников.Сотрудник.ФайлКартинки.Расширение КАК РасширениеФото,
	|	ТаблицаСотрудников.Сотрудник.ФайлКартинки.Размер КАК РазмерФото,
	|	ТаблицаСотрудников.ОбщаяНормаВремени КАК НормаВремени
	|ИЗ
	|	ТаблицаСотрудниковСОбщейНормойВремени КАК ТаблицаСотрудников
	|ГДЕ
	|	ТаблицаСотрудников.КоличествоДоступныхНоменклатур = &КоличествоНоменклатур");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	 , СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ДатаСреза"         	 , ДатаСреза);
	Запрос.УстановитьПараметр("МассивУслуг" 	  	 , МассивУслуг);
	Запрос.УстановитьПараметр("КоличествоНоменклатур", МассивУслуг.Количество());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция, возвращает таблицу сотрудников с минимальной нормой времени.
// 
Функция ПолучитьСотрудниковСНормойВремени(СтруктурнаяЕдиница, МассивУслуг, ДатаСреза)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыСотрудников.Объект КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА НастройкиСотрудников.ВидЦен = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЦен.Розничная)
	|		ИНАЧЕ НастройкиСотрудников.ВидЦен
	|	КОНЕЦ КАК ВидЦен
	|ПОМЕСТИТЬ ТаблицаСотрудников
	|ИЗ
	|	РегистрСведений.РеквизитыОбъектов КАК РеквизитыСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|		ПО РеквизитыСотрудников.СтруктурнаяЕдиница = НастройкиСотрудников.СтруктурнаяЕдиница
	|			И РеквизитыСотрудников.Объект = НастройкиСотрудников.Сотрудник
	|ГДЕ
	|	НЕ РеквизитыСотрудников.Объект.ЭтоГруппа
	|	И НЕ РеквизитыСотрудников.Объект.ПометкаУдаления
	|	И РеквизитыСотрудников.Значение = ИСТИНА
	|	И РеквизитыСотрудников.Реквизит = ""ОнлайнЗаписьСотрудник""
	|	И РеквизитыСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И РеквизитыСотрудников.Объект ССЫЛКА Справочник.Сотрудники
	|	И (ВЫРАЗИТЬ(РеквизитыСотрудников.Объект КАК Справочник.Сотрудники).Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.Врач)
	|			ИЛИ ВЫРАЗИТЬ(РеквизитыСотрудников.Объект КАК Справочник.Сотрудники).Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.ГлавныйВрач))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаСотрудников.Сотрудник КАК Сотрудник,
	|	ТаблицаСотрудников.ВидЦен КАК ВидЦен,
	|	УслугиСотрудника.Номенклатура КАК Номенклатура,
	|	УслугиСотрудника.НормаВремени КАК НормаВремени
	|ПОМЕСТИТЬ ТаблицаУслуг
	|ИЗ
	|	ТаблицаСотрудников КАК ТаблицаСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УслугиСотрудника КАК УслугиСотрудника
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыОбъектов КАК РеквизитыНоменклатуры
	|			ПО УслугиСотрудника.СтруктурнаяЕдиница = РеквизитыНоменклатуры.СтруктурнаяЕдиница
	|				И УслугиСотрудника.Номенклатура = РеквизитыНоменклатуры.Объект
	|				И (РеквизитыНоменклатуры.Реквизит = ""ОнлайнЗапись"")
	|		ПО ТаблицаСотрудников.Сотрудник = УслугиСотрудника.Сотрудник
	|ГДЕ
	|	УслугиСотрудника.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И УслугиСотрудника.Номенклатура.НормаВремени > 0
	|	И УслугиСотрудника.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И РеквизитыНоменклатуры.Значение = ИСТИНА
	|	И НЕ УслугиСотрудника.Номенклатура.ПометкаУдаления
	|	И &УсловиеМассивУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаУслуг.Сотрудник КАК Сотрудник,
	|	ТаблицаУслуг.ВидЦен КАК ВидЦен,
	|	ТаблицаУслуг.Номенклатура КАК Номенклатура,
	|	ТаблицаУслуг.НормаВремени КАК НормаВремени
	|ПОМЕСТИТЬ ТабицаУслугВПродаже
	|ИЗ
	|	ТаблицаУслуг КАК ТаблицаУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыНоменклатуры.СрезПоследних(&ДатаСреза, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК СтатусыНоменклатурыСрезПоследних
	|		ПО ТаблицаУслуг.Номенклатура = СтатусыНоменклатурыСрезПоследних.Номенклатура
	|ГДЕ
	|	ЕСТЬNULL(СтатусыНоменклатурыСрезПоследних.ВПродаже, ИСТИНА) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУслуг.Сотрудник КАК Сотрудник,
	|	ТаблицаУслуг.Сотрудник.ПредставлениеДляОнлайнЗаписи КАК Наименование,
	|	ТаблицаУслуг.Сотрудник.Должность КАК Должность,
	|	ТаблицаУслуг.Сотрудник.Должность.Наименование КАК ДолжностьНаименование,
	|	ВЫРАЗИТЬ(ТаблицаУслуг.Сотрудник.ОписаниеДляСайтаHTML КАК СТРОКА(1000)) КАК ОписаниеДляСайтаHTML,
	|	ТаблицаУслуг.Сотрудник.APIВес КАК Вес,
	|	ТаблицаУслуг.Сотрудник.ФайлКартинки.Расширение КАК РасширениеФото,
	|	ТаблицаУслуг.Сотрудник.ФайлКартинки.Размер КАК РазмерФото,
	|	МИНИМУМ(ТаблицаУслуг.НормаВремени) КАК НормаВремени
	|ИЗ
	|	ТабицаУслугВПродаже КАК ТаблицаУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаСреза, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ЦеныСрезПоследних
	|		ПО ТаблицаУслуг.Номенклатура = ЦеныСрезПоследних.Номенклатура
	|			И ТаблицаУслуг.ВидЦен = ЦеныСрезПоследних.ВидЦен
	|ГДЕ
	|	(ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) <> 0
	|			ИЛИ ТаблицаУслуг.Номенклатура.Бесплатно)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУслуг.Сотрудник,
	|	ТаблицаУслуг.Сотрудник.ПредставлениеДляОнлайнЗаписи,
	|	ТаблицаУслуг.Сотрудник.Должность,
	|	ТаблицаУслуг.Сотрудник.Должность.Наименование,
	|	ВЫРАЗИТЬ(ТаблицаУслуг.Сотрудник.ОписаниеДляСайтаHTML КАК СТРОКА(1000)),
	|	ТаблицаУслуг.Сотрудник.APIВес,
	|	ТаблицаУслуг.Сотрудник.ФайлКартинки.Расширение,
	|	ТаблицаУслуг.Сотрудник.ФайлКартинки.Размер");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ДатаСреза"         , ДатаСреза);
	Запрос.УстановитьПараметр("МассивУслуг" 	  , МассивУслуг);
	
	УсловиеМассивУслуг = ?(ЗначениеЗаполнено(МассивУслуг), "И УслугиСотрудника.Номенклатура В(&МассивУслуг)", "");
	Запрос.Текст  	   = СтрЗаменить(Запрос.Текст, "И &УсловиеМассивУслуг", УсловиеМассивУслуг);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
                            
// Функция, возвращает таблицу сотрудников с минимальной нормой времени.
// 
Функция ПолучитьСотрудниковСНормойВремени2(СтруктурнаяЕдиница, Сотрудник, МассивУслуг, ДатаСреза)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыСотрудников.Объект КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА НастройкиСотрудников.ВидЦен = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЦен.Розничная)
	|		ИНАЧЕ НастройкиСотрудников.ВидЦен
	|	КОНЕЦ КАК ВидЦен
	|ПОМЕСТИТЬ ТаблицаСотрудников
	|ИЗ
	|	РегистрСведений.РеквизитыОбъектов КАК РеквизитыСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|		ПО РеквизитыСотрудников.СтруктурнаяЕдиница = НастройкиСотрудников.СтруктурнаяЕдиница
	|			И РеквизитыСотрудников.Объект = НастройкиСотрудников.Сотрудник
	|ГДЕ
	|	НЕ РеквизитыСотрудников.Объект.ЭтоГруппа
	|	И НЕ РеквизитыСотрудников.Объект.ПометкаУдаления
	|	И РеквизитыСотрудников.Значение = ИСТИНА
	|	И РеквизитыСотрудников.Реквизит = ""ОнлайнЗаписьСотрудник""
	|	И РеквизитыСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И РеквизитыСотрудников.Объект ССЫЛКА Справочник.Сотрудники
	|	И &УсловиеСотрудник
	|	И (ВЫРАЗИТЬ(РеквизитыСотрудников.Объект КАК Справочник.Сотрудники).Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.Врач)
	|			ИЛИ ВЫРАЗИТЬ(РеквизитыСотрудников.Объект КАК Справочник.Сотрудники).Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.ГлавныйВрач))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСотрудников.Сотрудник КАК Сотрудник,
	|	ТаблицаСотрудников.ВидЦен КАК ВидЦен,
	|	УслугиСотрудника.Номенклатура КАК Номенклатура,
	|	УслугиСотрудника.НормаВремени КАК НормаВремени
	|ПОМЕСТИТЬ ТаблицаУслуг
	|ИЗ
	|	ТаблицаСотрудников КАК ТаблицаСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УслугиСотрудника КАК УслугиСотрудника
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыОбъектов КАК РеквизитыНоменклатуры
	|			ПО УслугиСотрудника.СтруктурнаяЕдиница = РеквизитыНоменклатуры.СтруктурнаяЕдиница
	|				И УслугиСотрудника.Номенклатура = РеквизитыНоменклатуры.Объект
	|				И (РеквизитыНоменклатуры.Реквизит = ""ОнлайнЗапись"")
	|		ПО ТаблицаСотрудников.Сотрудник = УслугиСотрудника.Сотрудник
	|ГДЕ
	|	УслугиСотрудника.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И УслугиСотрудника.Номенклатура.НормаВремени > 0
	|	И УслугиСотрудника.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И РеквизитыНоменклатуры.Значение = ИСТИНА
	|	И &УсловиеМассивУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.ВидЦен КАК ВидЦен,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ПОМЕСТИТЬ ТаблицаЦен
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаСреза,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						ТаблицаУслуг.Номенклатура
	|					ИЗ
	|						ТаблицаУслуг)
	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ЦеныНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаУслуг.Сотрудник КАК Сотрудник,
	|	ТаблицаУслуг.Номенклатура КАК Номенклатура,
	|	ТаблицаУслуг.НормаВремени КАК НормаВремениПоСотруднику
	|ИЗ
	|	ТаблицаУслуг КАК ТаблицаУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЦен КАК ТаблицаЦен
	|		ПО ТаблицаУслуг.Номенклатура = ТаблицаЦен.Номенклатура
	|			И ТаблицаУслуг.ВидЦен = ТаблицаЦен.ВидЦен
	|ГДЕ
	|	(ЕСТЬNULL(ТаблицаЦен.Цена, 0) <> 0
	|			ИЛИ ТаблицаУслуг.Номенклатура.Бесплатно)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НормаВремениПоСотруднику");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ДатаСреза"         , ДатаСреза);
	Запрос.УстановитьПараметр("МассивУслуг" 	  , МассивУслуг);
	Запрос.УстановитьПараметр("МассивСотрудников" , Сотрудник);
	
	УсловиеСотрудник   = ?(ЗначениеЗаполнено(Сотрудник), " И РеквизитыСотрудников.Объект В (&МассивСотрудников) ", "");
	Запрос.Текст       = СтрЗаменить(Запрос.Текст, "И &УсловиеСотрудник", УсловиеСотрудник);
	
	УсловиеМассивУслуг = ?(ЗначениеЗаполнено(МассивУслуг), "И УслугиСотрудника.Номенклатура В(&МассивУслуг)", "");
	Запрос.Текст  	   = СтрЗаменить(Запрос.Текст, "И &УсловиеМассивУслуг", УсловиеМассивУслуг);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция - Получить сотрудников с нормой времени для перезаписи
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  Сотрудник			 - 	 - 
//  МассивУслуг			 - 	 - 
//  ДатаСреза			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСотрудниковСНормойВремениДляПерезаписи(СтруктурнаяЕдиница, Сотрудник, МассивУслуг, ДатаСреза = Неопределено)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	УслугиСотрудника.Сотрудник КАК Сотрудник,
	|	УслугиСотрудника.Номенклатура КАК Номенклатура,
	|	УслугиСотрудника.НормаВремени КАК НормаВремени
	|ПОМЕСТИТЬ ТаблицаУслугСотрудника
	|ИЗ
	|	РегистрСведений.УслугиСотрудника КАК УслугиСотрудника
	|ГДЕ
	|	&УсловиеСотрудник
	|	И УслугиСотрудника.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И &УсловиеМассивУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаУслугСотрудника.Сотрудник КАК Сотрудник,
	|	ТаблицаУслугСотрудника.Номенклатура КАК Номенклатура,
	|	ТаблицаУслугСотрудника.НормаВремени КАК НормаВремениПоСотруднику
	|ИЗ
	|	ТаблицаУслугСотрудника КАК ТаблицаУслугСотрудника
	|ГДЕ
	|	ТаблицаУслугСотрудника.Номенклатура.НормаВремени > 0
	|	И ТаблицаУслугСотрудника.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НормаВремениПоСотруднику");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);
	//Запрос.УстановитьПараметр("ДатаСреза"         	, ДатаСреза);
	Запрос.УстановитьПараметр("МассивУслуг" 	  	, МассивУслуг);
	Запрос.УстановитьПараметр("Сотрудник" 			, Сотрудник);
	
	УсловиеСотрудник   = ?(ЗначениеЗаполнено(Сотрудник), "УслугиСотрудника.Сотрудник = &Сотрудник", "ИСТИНА");
	Запрос.Текст       = СтрЗаменить(Запрос.Текст, "&УсловиеСотрудник", УсловиеСотрудник);
	
	УсловиеМассивУслуг = ?(ЗначениеЗаполнено(МассивУслуг), "И УслугиСотрудника.Номенклатура В(&МассивУслуг)", "");
	Запрос.Текст  	   = СтрЗаменить(Запрос.Текст, "И &УсловиеМассивУслуг", УсловиеМассивУслуг);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция, возвращает свободные интервалы сотрудников.
// 
Функция ПолучитьСвободныеИнтервалы(
		СтруктурнаяЕдиница, 
		МассивСотрудников, 
		ДлительностьЗаписи = Неопределено, 
		НачалоПериода = Неопределено, 
		КонецПериода = Неопределено, 
		ПолучитьИнтервалыПослеТекущейДаты = Ложь, 
		ВнешняяСистема = Неопределено)

		НачалоПериодаЗапрета	= Неопределено;	
		КонецПериодаЗапрета		= Неопределено;
		
		Если ЗначениеЗаполнено(ВнешняяСистема) Тогда
			
			ПараметрыВС = ВнешняяСистема.Параметры.Получить(); 	
			
			Если ПараметрыВС <> Неопределено И ПараметрыВС.Свойство("ЗапретОнлайнЗаписиС") И ПараметрыВС.Свойство("ЗапретОнлайнЗаписиПо")
				И ЗначениеЗаполнено(ПараметрыВС.ЗапретОнлайнЗаписиС) И ЗначениеЗаполнено(ПараметрыВС.ЗапретОнлайнЗаписиПо) Тогда
				
				НачалоПериодаЗапрета	= ПараметрыВС.ЗапретОнлайнЗаписиС; 
				КонецПериодаЗапрета 	= ПараметрыВС.ЗапретОнлайнЗаписиПо;
				
			КонецЕсли;
			
		КонецЕсли;
	
	Возврат РегистрыСведений.СвободныеИнтервалыСотрудников.ПолучитьСвободныеИнтервалы(
	СтруктурнаяЕдиница, 
	МассивСотрудников, 
	ДлительностьЗаписи, 
	НачалоПериода, 
	КонецПериода,, 
	ПолучитьИнтервалыПослеТекущейДаты,
	НачалоПериодаЗапрета,
	КонецПериодаЗапрета);
	
КонецФункции

// Функция, возвращает максимальную длительность, доступную для записи.
//
Функция МаксимальнаяДлительностьДоступнаяДляЗаписи(Номенклатура, ВремяНачала, Длительность, ОграниченияПоВремени = "")
	
	ДеньНедели 		   		 	= ДеньНедели(ВремяНачала);
	ЭтоПраздничныйДень 		 	= ОбщегоНазначения.ЭтоПраздничныйДень(ВремяНачала);
	ВремяОкончания 	   		 	= ВремяНачала + Длительность * 60;
	МаксимальнаяДлительность 	= 0;
	
	Возврат МаксимальнаяДлительность;
	
КонецФункции

// Функция, возвращает значение реквизита.
//
Функция ПолучитьЗначениеРеквизита(Ссылка, ИмяРеквизита)
	
	// Неопбходимо для оптимизации. Эта функция работает быстрее, чем получение значения через точку.
	Возврат ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Ссылка, ИмяРеквизита);
	
КонецФункции

// Функция, проверяет переданное занятие.
//
Функция ПолучитьМассивСсылокПоИдентификаторам(Идентификаторы, СтруктураОшибки, ЭтоСправочник = Истина, ИмяОбъекта, КодОшибки, ОбязательныйПараметр = Ложь)
	
	МассивИдентификаторов = ПреобразоватьКМассивуВходноеЗначение(Идентификаторы);
	МассивСсылок 		  = Новый Массив;
	
	Если МассивИдентификаторов.Количество() = 0 И ОбязательныйПараметр Тогда
		СтруктураОшибки = ПолучитьСтруктуруВозвратаОшибки(КодОшибки);
		Возврат Неопределено;
	КонецЕсли;
	
	Для Каждого Идентификатор Из МассивИдентификаторов Цикл
		Ссылка = ПолучитьСсылкуПоИдентификатору(Идентификатор, СтруктураОшибки, ЭтоСправочник, ИмяОбъекта, КодОшибки, ОбязательныйПараметр);
		Если ЗначениеЗаполнено(СтруктураОшибки) Тогда
			Возврат Неопределено;
		КонецЕсли;
		МассивСсылок.Добавить(Ссылка);
	КонецЦикла;
	
	Возврат МассивСсылок;
	
КонецФункции

// Функция - Преобразовать к массиву входное значение
//
// Параметры:
//  Значения - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПреобразоватьКМассивуВходноеЗначение(Значения)
	
	МассивЗначений = Новый Массив;
	
	Если ЗначениеЗаполнено(Значения) Тогда
		Если ТипЗнч(Значения) = Тип("Массив") Тогда
			МассивЗначений = Значения;
		Иначе
			МассивЗначений.Добавить(Значения);
		КонецЕсли;
	КонецЕсли;
	
	Возврат МассивЗначений;
	
КонецФункции

// Функция - Получить начало периода
//
// Параметры:
//  start_date				 - 	 - 
//  СтруктураОшибки			 - 	 - 
//  ОбязательныйПараметр	 - 	 - 
//  ИзменятьНачалоПериода	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьНачалоПериода(start_date, СтруктураОшибки, ОбязательныйПараметр = Ложь, ИзменятьНачалоПериода = Ложь)
	
	НачалоПериода = Неопределено;
	
	Если ЗначениеЗаполнено(start_date) Тогда
		Если ТипЗнч(start_date) = Тип("Строка") Тогда 
			НачалоПериода = ПолучитьДату(start_date);
		ИначеЕсли ТипЗнч(start_date) = Тип("Дата") Тогда 
			НачалоПериода = start_date;
		Иначе 
			НачалоПериода = Неопределено;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НачалоПериода) Тогда
			СтруктураОшибки = ПолучитьСтруктуруВозвратаОшибки(1054);
		КонецЕсли;
		
		Если ИзменятьНачалоПериода Тогда
			
			ВремяОграниченияНачалаОнлайнЗаписи = Константы.ВремяОграниченияНачалаОнлайнЗаписи.Получить();
			
			Если ЗначениеЗаполнено(ВремяОграниченияНачалаОнлайнЗаписи) Тогда
				
				ВремяОграниченияНачалаОнлайнЗаписи = ВремяОграниченияНачалаОнлайнЗаписи * 60;
				ОнлайнЗаписьВозможнаНа       	   = ТекущаяДатаСеанса() + ВремяОграниченияНачалаОнлайнЗаписи;
				
				Если НачалоМинуты(НачалоПериода) < НачалоМинуты(ОнлайнЗаписьВозможнаНа) Тогда
					НачалоПериода = ОнлайнЗаписьВозможнаНа;
				КонецЕсли;
				
			КонецЕсли;
		
			ТекущаяДатаСеанса = ТекущаяДатаСеанса();
			Если НачалоПериода < ТекущаяДатаСеанса Тогда
				НачалоПериода = ТекущаяДатаСеанса;
			ИначеЕсли НачалоДня(НачалоПериода) > НачалоДня(ТекущаяДатаСеанса) Тогда
				НачалоПериода = НачалоДня(НачалоПериода);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ОбязательныйПараметр Тогда
		СтруктураОшибки = ПолучитьСтруктуруВозвратаОшибки(1052);
	КонецЕсли;
	
	Возврат НачалоПериода
	
КонецФункции

// Функция, возвращает интервалы, доступные для записи.
//
Функция ПолучитьИнтервалыДоступныеДляЗаписиПоУслуге(Номенклатура, ВремяНачала, Длительность)
	
	ДеньНедели 		   = ДеньНедели(ВремяНачала);
	ЭтоПраздничныйДень = ОбщегоНазначения.ЭтоПраздничныйДень(ВремяНачала);
	ВремяОкончания 	   = ВремяНачала + Длительность * 60;
	МассивИнтервалов   = Новый Массив;
	
	МассивИнтервалов.Добавить(Новый Структура("ДатаВремяНачала, Длительность", ВремяНачала, Длительность));
	Возврат МассивИнтервалов;
		
КонецФункции

// Функция, возвращает контрагента по номеру телефона.
//
Функция ПолучитьКонтрагентаПоНомеруТелефона(НомерТелефона)
	
	Возврат Справочники.Контрагенты.ПолучитьКонтрагентаПоНомеруТелефона(НомерТелефона);
	
КонецФункции

// Функция, создает запись в регистре "КлючиВнешнихСистем".
//
Функция ЗаписатьUserToken(ВнешняяСистема, НомерТелефона, Клиент, КодПодтверждения = "", Пароль = Неопределено)
	
	УИД 	  = Новый УникальныйИдентификатор();
	UserToken = СтрЗаменить(Строка(ПолучитьMD5(Строка(УИД))), " ", "");
	
	НаборЗаписей = РегистрыСведений.КлючиВнешнихСистем.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВнешняяСистема.Установить(ВнешняяСистема);
	НаборЗаписей.Отбор.НомерТелефона.Установить(НомерТелефона);
	
	НоваяЗапись                  = НаборЗаписей.Добавить();
	НоваяЗапись.ВнешняяСистема 	 = ВнешняяСистема;
	НоваяЗапись.НомерТелефона  	 = НомерТелефона;
	НоваяЗапись.Клиент	 	  	 = Клиент;
	НоваяЗапись.КлючКлиента	 	 = UserToken;
	НоваяЗапись.КодПодтверждения = КодПодтверждения;
	НоваяЗапись.Статус 		     = Перечисления.СтатусыКлючейВнешнихСистем.Подтвержден;
	НоваяЗапись.Пароль			 = Пароль;
	
	НаборЗаписей.Записать();
	
	Возврат UserToken;
	
КонецФункции

// Функция, возвращает значение из структуры по ключу.
//
Функция ПолучитьЗначениеИзСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Если ТипЗнч(Структура) = Тип("Структура") Тогда
		Возврат ?(Структура.Свойство(Ключ), Структура[Ключ], ЗначениеПоУмолчанию);
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
КонецФункции

// Функция, возвращает параметры JSON из тела запроса.
//
Функция ПолучитьПараметрыJSON(Запрос)
	
	ТекстJSON  = Запрос.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	Возврат ПрочитатьJSON(ЧтениеJSON);
	
КонецФункции

// Функция - Получить таблицу записи
//
// Параметры:
//  record_array	 - 	 - 
//  СтруктураОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТаблицуЗаписи(record_array, СтруктураОшибки)
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("ДатаЗаписи");
	ТаблицаЗначений.Колонки.Добавить("Услуга");
	ТаблицаЗначений.Колонки.Добавить("Сотрудник");
	ТаблицаЗначений.Колонки.Добавить("ПричинаЗаписи", Новый ОписаниеТипов("СправочникСсылка.ПричиныЗаписи"));
	ТаблицаЗначений.Колонки.Добавить("Длительность"	, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный)));
	
	Если НЕ ЗначениеЗаполнено(record_array) Тогда
		СтруктураОшибки = ПолучитьСтруктуруВозвратаОшибки(1071);
		Возврат Неопределено;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из record_array Цикл
		
		datetime   		= ПолучитьЗначениеИзСтруктуры(СтрокаТЧ, "datetime");
		service_id 		= ПолучитьЗначениеИзСтруктуры(СтрокаТЧ, "service_id");
		staff_id   		= ПолучитьЗначениеИзСтруктуры(СтрокаТЧ, "staff_id");
		reason_entry 	= ПолучитьЗначениеИзСтруктуры(СтрокаТЧ, "reason_entry");
		duration 		= ПолучитьЗначениеИзСтруктуры(СтрокаТЧ, "duration", 0);
		
		НоваяСтрока = ТаблицаЗначений.Добавить();
		НоваяСтрока.ДатаЗаписи 		= ПолучитьИПроверитьДату(datetime, СтруктураОшибки, Истина);
		НоваяСтрока.Услуга	   		= ПолучитьСсылкуПоИдентификатору(service_id		, СтруктураОшибки,, "Номенклатура"	, 1051, Истина);
		
		Если ЗначениеЗаполнено(СтруктураОшибки) Тогда
			ОшибкаДанные = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураОшибки, "Errors", Неопределено);
			Если ЗначениеЗаполнено(ОшибкаДанные) Тогда 
				КодОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОшибкаДанные, "code", 0);
				Если КодОшибки = 1051 Тогда 
					Если ЗначениеЗаполнено(duration) Тогда
						СтруктураОшибки = Неопределено;
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		
		НоваяСтрока.Сотрудник  		= ПолучитьСсылкуПоИдентификатору(staff_id  		, СтруктураОшибки,, "Сотрудники"  	, 1050);
		НоваяСтрока.ПричинаЗаписи	= ПолучитьСсылкуПоИдентификатору(reason_entry	, СтруктураОшибки,, "ПричиныЗаписи"	, 1130);
		НоваяСтрока.Длительность	= duration;
		
		Если ЗначениеЗаполнено(СтруктураОшибки) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаЗначений.Сортировать("ДатаЗаписи Возр");
	Возврат ТаблицаЗначений;
	
КонецФункции

// Функция, проверяет таблицу значений записи.
// 
Функция ПроверитьТаблицуЗаписи(ТаблицаЗначенийЗаписи, СтруктурнаяЕдиница)
	
	МассивСотрудников = Новый Массив;
	НачалоПериода 	  = ТаблицаЗначенийЗаписи[0].ДатаЗаписи;
	КонецПериода  	  = КонецДня(ТаблицаЗначенийЗаписи[0].ДатаЗаписи);
	
	ТаблицаЗначенийЗаписи.Колонки.Добавить("НормаВремени", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗначенийЗаписи Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.Услуга) Тогда 
			Если ЗначениеЗаполнено(СтрокаТаблицы.Сотрудник) Тогда
				СтрокаТаблицы.НормаВремени 	= ПолучитьНормуВремениНоменклатуры(СтрокаТаблицы.Услуга, СтрокаТаблицы.Сотрудник, СтруктурнаяЕдиница);
			Иначе
				СтрокаТаблицы.НормаВремени 	= ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрокаТаблицы.Услуга, "НормаВремени") * 60;
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.ПричинаЗаписи) Тогда
			СтрокаТаблицы.НормаВремени 		= ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрокаТаблицы.ПричинаЗаписи, "НормаВремени") * 60;
		КонецЕсли;
	КонецЦикла;

	Для Индекс = 0 По ТаблицаЗначенийЗаписи.Количество() - 1 Цикл
		
		СтрокаТаблицы = ТаблицаЗначенийЗаписи[Индекс];
		
		Для Индекс2 = Индекс + 1 По ТаблицаЗначенийЗаписи.Количество() - 1 Цикл
			
			Если ВремяУслугСовпадает(СтрокаТаблицы, ТаблицаЗначенийЗаписи[Индекс2]) Тогда
				Возврат ПолучитьСтруктуруВозвратаОшибки(1103);
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивСотрудников.Найти(СтрокаТаблицы.Сотрудник) = Неопределено Тогда
			МассивСотрудников.Добавить(СтрокаТаблицы.Сотрудник);
		КонецЕсли;
		НачалоПериода = ?(СтрокаТаблицы.ДатаЗаписи < НачалоПериода, СтрокаТаблицы.ДатаЗаписи, НачалоПериода);
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Сотрудник) Тогда
			
			ИсключаемыеСотрудники = Новый Массив;
			
			Для Каждого СтрокаТЧ Из ТаблицаЗначенийЗаписи Цикл
				Если СтрокаТЧ <> СтрокаТаблицы И ВремяУслугСовпадает(СтрокаТаблицы, СтрокаТЧ) Тогда
					ИсключаемыеСотрудники.Добавить(СтрокаТЧ.Сотрудник);
				КонецЕсли;
			КонецЦикла;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.Услуга) Тогда 
				ТаблицаСотрудников = РегистрыСведений.УслугиСотрудника.ПолучитьСотрудниковОказывающихУслугу(СтруктурнаяЕдиница
																										, СтрокаТаблицы.Услуга
																										, ИсключаемыеСотрудники);
			Иначе 
				ТаблицаСотрудников = ПолучитьСотрудниковСНормойВремени(СтруктурнаяЕдиница
																		, Неопределено
																		, СтрокаТаблицы.ДатаЗаписи);
			КонецЕсли;	
			
			Если ТаблицаСотрудников.Количество() = 0 Тогда
				Возврат ПолучитьСтруктуруВозвратаОшибки(1106, ?(ЗначениеЗаполнено(СтрокаТаблицы.Услуга), СокрЛП(СтрокаТаблицы.Услуга), ""));
			КонецЕсли;
			
			ТаблицаИнтерваловСотрудников = ПолучитьСвободныеИнтервалы(
				СтруктурнаяЕдиница, 
				ТаблицаСотрудников.ВыгрузитьКолонку("Сотрудник"),, 
				СтрокаТаблицы.ДатаЗаписи);
			
			Для Каждого СтрокаИнтервала Из ТаблицаИнтерваловСотрудников Цикл
				
				НормаВремениСотрудника = ТаблицаСотрудников.НайтиСтроки(Новый Структура("Сотрудник", СтрокаИнтервала.Сотрудник))[0].НормаВремени;
				
				Если СтрокаИнтервала.Длительность >= НормаВремениСотрудника Тогда
					СтрокаТаблицы.Сотрудник = СтрокаИнтервала.Сотрудник;
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.Сотрудник) Тогда
				Возврат ПолучитьСтруктуруВозвратаОшибки(1106, ?(ЗначениеЗаполнено(СтрокаТаблицы.Услуга), СокрЛП(СтрокаТаблицы.Услуга), ""));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.Услуга) Тогда 
				СтрокаТаблицы.НормаВремени = ПолучитьНормуВремениНоменклатуры(СтрокаТаблицы.Услуга, СтрокаТаблицы.Сотрудник, СтруктурнаяЕдиница);
			КонецЕсли;	
			
		ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.Услуга) И НЕ СотрудникОказываетУслугу(СтруктурнаяЕдиница, СтрокаТаблицы.Сотрудник, СтрокаТаблицы.Услуга) Тогда
			Возврат ПолучитьСтруктуруВозвратаОшибки(1100);
		КонецЕсли;
		
		Если МассивСотрудников.Найти(СтрокаТаблицы.Сотрудник) = Неопределено Тогда
			МассивСотрудников.Добавить(СтрокаТаблицы.Сотрудник);
		КонецЕсли;
		
		НачалоПериода = ?(СтрокаТаблицы.ДатаЗаписи < НачалоПериода, СтрокаТаблицы.ДатаЗаписи, НачалоПериода);
		
	КонецЦикла;
	
	ТаблицаИнтервалов = ПолучитьСвободныеИнтервалы(СтруктурнаяЕдиница, МассивСотрудников,, НачалоПериода, КонецПериода);
		
	Для Каждого СтрокаТаблицы Из ТаблицаЗначенийЗаписи Цикл
		
		ДатаЗаписи    		= СтрокаТаблицы.ДатаЗаписи;
		Если ЗначениеЗаполнено(СтрокаТаблицы.Длительность) Тогда 
			ДатаОкончания 	= ДатаЗаписи + (СтрокаТаблицы.Длительность*60);	
		Иначе 	
			ДатаОкончания 	= ДатаЗаписи + СтрокаТаблицы.НормаВремени;
		КонецЕсли;	
		Сотрудник     		= СтрокаТаблицы.Сотрудник;
		
		ВозможностьЗаписи   = Ложь;
		ИнтервалыСотрудника = ТаблицаИнтервалов.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник));
		
		Для Каждого СтрокаТЧ Из ИнтервалыСотрудника Цикл
			
			Если СтрокаТЧ.ДатаВремяНачала <= ДатаЗаписи
				И СтрокаТЧ.ДатаВремяНачала + (СтрокаТЧ.Длительность * 60) >= ДатаОкончания Тогда
				
				ВозможностьЗаписи = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ВозможностьЗаписи Тогда
			ПриемыСотрудников = ПолучитьПриемыСотрудников(Сотрудник, СтруктурнаяЕдиница,, ДатаЗаписи, ДатаОкончания);
			Если ПриемыСотрудников.Количество() > 0 Тогда
				Возврат ПолучитьСтруктуруВозвратаОшибки(1131);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ВозможностьЗаписи Тогда
			Возврат ПолучитьСтруктуруВозвратаОшибки(1101);
		КонецЕсли;
				
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Функция, возвращает норму времени номенклатуры.
//
Функция ПолучитьНормуВремениНоменклатуры(Услуга, Сотрудник, СтруктурнаяЕдиница)
	
	Возврат РегистрыСведений.УслугиСотрудника.ПолучитьНормуВремениНоменклатуры(Услуга, Сотрудник, СтруктурнаяЕдиница) * 60;
	
КонецФункции

// Функция, формирует предварительную запись.
// 
Функция СформироватьСобытие(
		Клиент,
		ТаблицаЗначенийЗаписи,
		СтруктурнаяЕдиница,
		ВнешняяСистема,
		РекламныйИсточник,
		КомментарийЗаписи,
		Сделка,
		ЗаКакоеВремяНапоминатьОЗаписи)
		
	// Создание предварительной записи
	ОбъектСобытие = Документы.Событие.СоздатьДокумент();
	
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ОбъектСобытие,, 
		Новый Структура("СтруктурнаяЕдиница", СтруктурнаяЕдиница));
	ОбъектСобытие.ДатаСоздания 				= ТекущаяДатаСеанса();
	ОбъектСобытие.КартаКлиента 				= Справочники.Карты.ПолучитьКартуКлиента(Клиент);
	ОбъектСобытие.Контрагент   				= Клиент;
	ОбъектСобытие.Статус	   				= Перечисления.СтатусыСобытия.НеПодтверждена;
	ОбъектСобытие.ТипСобытия   				= Перечисления.ТипыСобытий.ПредварительнаяЗапись;
	ОбъектСобытие.Комментарий  				= КомментарийЗаписи;
	ОбъектСобытие.Сделка       				= Сделка;
	ОбъектСобытие.ВремяНапоминанияДоЗаписи 	= ?(ЗначениеЗаполнено(ЗаКакоеВремяНапоминатьОЗаписи), ЗаКакоеВремяНапоминатьОЗаписи, 0);
	ОбъектСобытие.ИсточникЗаписи 			= ПолучитьИсточникЗаписи(ВнешняяСистема);
	Дата = ТекущаяДатаСеанса(); 
		
	Счетчик = 0;
	Для Каждого СтрокаТаблицы Из ТаблицаЗначенийЗаписи Цикл
		
		ДатаЗаписи    	 = СтрокаТаблицы.ДатаЗаписи; 
		Если Счетчик = 0 Тогда
			Дата = ДатаЗаписи; 
		КонецЕсли;
		Счетчик 					= Счетчик + 1;
		Сотрудник    	 			= СтрокаТаблицы.Сотрудник;
		Услуга 	   	 	 			= СтрокаТаблицы.Услуга;		
		НормаВремени 	 			= СтрокаТаблицы.НормаВремени / 60;
		
		ВидЦенСотрудника = РегистрыСведений.НастройкиСотрудников.ПолучитьВидЦенСотрудника(СтруктурнаяЕдиница, Сотрудник);
		ВидЦенСотрудника = ?(ЗначениеЗаполнено(ВидЦенСотрудника), ВидЦенСотрудника, Справочники.ВидыЦен.Розничная);
		
		Если ЗначениеЗаполнено(Услуга) Тогда 
			СтруктураДанные = Новый Структура("ДатаОбработки, СтруктурнаяЕдиница, ВидЦен, Номенклатура", 
												ДатаЗаписи, СтруктурнаяЕдиница, ВидЦенСотрудника, Услуга);
			СтруктураДанные = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
		Иначе 
			СтруктураДанные = Новый Структура("Цена", 0);
		КонецЕсли;	
		
		НоваяСтрока 			  		= ОбъектСобытие.Услуги.Добавить();
		НоваяСтрока.Номенклатура  		= Услуга;
		НоваяСтрока.Цена          		= СтруктураДанные.Цена;
		НоваяСтрока.Сотрудник     		= Сотрудник;
		Если НЕ ЗначениеЗаполнено(ОбъектСобытие.Врач) Тогда 
			ОбъектСобытие.Врач 			= Сотрудник;
		КонецЕсли;	
		НоваяСтрока.НормаВремени  		= НормаВремени;
		НоваяСтрока.ДатаНачала	  		= ДатаЗаписи;
		Если ЗначениеЗаполнено(СтрокаТаблицы.Длительность) Тогда
			НоваяСтрока.ДатаОкончания 	= ДатаЗаписи + СтрокаТаблицы.Длительность*60;
		Иначе 	
			НоваяСтрока.ДатаОкончания 	= ДатаЗаписи + СтрокаТаблицы.НормаВремени;
		КонецЕсли;	
		НоваяСтрока.Помещение     		= РегистрыСведений.СвязкаПомещениеСотрудник.ПолучитьПомещениеСотрудникаПоУмолчанию(
			Сотрудник, СтруктурнаяЕдиница);
			
		Если ЗначениеЗаполнено(СтрокаТаблицы.ПричинаЗаписи) Тогда 
			НоваяСтрока.ПричинаЗаписи 	= СтрокаТаблицы.ПричинаЗаписи;	
		КонецЕсли;
		
		ОбъектСобытие.ВидЦен = ВидЦенСотрудника;
		
	КонецЦикла;
    ОбъектСобытие.Дата = Дата;
	МассивПолисов = Справочники.ПолисыМедицинскогоСтрахования.ПолучитьАктивныеПолисыКонтрагента(Клиент, ОбъектСобытие.Дата);
	Если МассивПолисов.Количество() > 0 Тогда
		ОбъектСобытие.ПолисМедСтрахования = МассивПолисов[0];	
	КонецЕсли;
	
	Возврат ОбъектСобытие;
	
КонецФункции

// Функция, возвращает источник записи по внешней системе.
//
Функция ПолучитьИсточникЗаписи(ВнешняяСистема) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ИсточникиЗаписей.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИсточникиЗаписей КАК ИсточникиЗаписей
	|ГДЕ
	|	НЕ ИсточникиЗаписей.ПометкаУдаления
	|	И ИсточникиЗаписей.ВнешняяСистема = &ВнешняяСистема");
	
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.ИсточникиЗаписей.СоздатьИсточникЗаписей(ВнешняяСистема);	
	КонецЕсли;	
	
КонецФункции	

// Функция, находит или создает рекламный источник.
//
Функция ПолучитьРекламныйИсточник(РекламныйИсточник)
	
	НаименованиеРекламногоИсточника 	= РаскодироватьСтроку(РекламныйИсточник, СпособКодированияСтроки.КодировкаURL);
	Если СтрЗаканчиваетсяНа(НаименованиеРекламногоИсточника, "/") Тогда
		НаименованиеРекламногоИсточника = Лев(НаименованиеРекламногоИсточника, СтрДлина(НаименованиеРекламногоИсточника) - 1);
	КонецЕсли;
	
	ИсточникИнформации = Неопределено;
	Если ЗначениеЗаполнено(НаименованиеРекламногоИсточника) Тогда
		ИсточникИнформации = Справочники.РекламныеИсточники.ПолучитьРекламныйИсточник(НаименованиеРекламногоИсточника);
		Если НЕ ЗначениеЗаполнено(ИсточникИнформации) Тогда
			ИсточникИнформации = Справочники.РекламныеИсточники.СоздатьРекламныйИсточник(НаименованиеРекламногоИсточника);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИсточникИнформации;
	
КонецФункции

// Функция, обновляет ФИО и Email клиента.
// 
Функция ОбновитьИнформациюОКлиенте(Клиент, ФИОКлиента, РекламныйИсточник, Email = Неопределено, birthday = Неопределено, СтруктурнаяЕдиница = Неопределено)
	
	ИмяСовпадаетСНомеромТелефона = Ложь;
	НеобходимостьЗаписиОбъекта	 = Ложь;
	НаличиеТекущегоEmail    	 = Ложь;
	
	ОбъектКлиент = Клиент.ПолучитьОбъект();
	
	НаименованиеКлиента = СтрЗаменить(СокрЛП(Клиент.Наименование), "+", "");
	Для Каждого КонтактнаяИнформация Из Клиент.КонтактнаяИнформация Цикл
		
		Если КонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон
			И СокрЛП(КонтактнаяИнформация.НомерТелефона) = НаименованиеКлиента Тогда
			
			ИмяСовпадаетСНомеромТелефона = Истина;
		ИначеЕсли ЗначениеЗаполнено(Email) И КонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты И НРег(КонтактнаяИнформация.АдресЭП) = НРег(Email) Тогда			
			НаличиеТекущегоEmail = Истина;	
		КонецЕсли;
			
	КонецЦикла;
	
	Если ИмяСовпадаетСНомеромТелефона Тогда
		
		ОбъектКлиент.Фамилия  = "";
		ОбъектКлиент.Имя 	  = "";
		ОбъектКлиент.Отчество = "";
		ОбъектКлиент.Наименование = ФИОКлиента;
		
		МассивПодстрок = СтрРазделить(ФИОКлиента, " ", Ложь);
		
		Если МассивПодстрок.Количество() = 1 Тогда
			ОбъектКлиент.Имя = МассивПодстрок[0];
		ИначеЕсли МассивПодстрок.Количество() > 0 Тогда
			ОбъектКлиент.Фамилия = МассивПодстрок[0];
		КонецЕсли;
		
		Если МассивПодстрок.Количество() > 1 Тогда
			ОбъектКлиент.Имя = МассивПодстрок[1];
		КонецЕсли;
		
		Если МассивПодстрок.Количество() > 2 Тогда
			ОбъектКлиент.Отчество = МассивПодстрок[2];
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ОбъектКлиент.ПолКлиента) Тогда
			ОбъектКлиент.ПолКлиента = ПолучитьПолКлиентаПоФИО(ОбъектКлиент.Имя, ОбъектКлиент.Фамилия, ОбъектКлиент.Отчество);
		КонецЕсли;
		
		НеобходимостьЗаписиОбъекта = Истина;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Клиент.ИсточникИнформации)
		И ЗначениеЗаполнено(РекламныйИсточник) Тогда
		
		ОбъектКлиент.ИсточникИнформации = РекламныйИсточник;
		НеобходимостьЗаписиОбъекта = Истина;
	КонецЕсли;
	
	Если Не НаличиеТекущегоEmail И ЗначениеЗаполнено(Email) Тогда
		ЗаполнитьАдресЭлектроннойПочты(ОбъектКлиент, Email);
		НеобходимостьЗаписиОбъекта = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(birthday) И Не ЗначениеЗаполнено(ОбъектКлиент.ДатаРожденияКлиента) Тогда			
		Попытка                                       
			ОбъектКлиент.ДатаРожденияКлиента = Дата(Сред(birthday,7), Сред(birthday,4,2), Сред(birthday,1,2));
			НеобходимостьЗаписиОбъекта = Истина;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктурнаяЕдиница) И Не ЗначениеЗаполнено(ОбъектКлиент.СтруктурнаяЕдиница) Тогда
		ОбъектКлиент.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
		НеобходимостьЗаписиОбъекта = Истина;
	КонецЕсли;
	
	Если НеобходимостьЗаписиОбъекта Тогда
		
		Попытка
			ОбъектКлиент.Записать();
		Исключение
			Возврат ПолучитьСтруктуруВозвратаОшибки(1112, ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Функция, возвращает двоичные данные фото.
// 
Функция ПолучитьФайлКартинки(ВерсияСсылка)
	
	Возврат РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаИДвоичныеДанные(ВерсияСсылка).ДвоичныеДанные;
	
КонецФункции

#КонецОбласти