#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПометкаУдаления Тогда
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	РегистраторыМДЛП.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РегистраторыМДЛП КАК РегистраторыМДЛП
		|ГДЕ
		|	РегистраторыМДЛП.СерийныйНомерМБ = &СерийныйНомерМБ
		|	И НЕ РегистраторыМДЛП.ПометкаУдаления
		|	И РегистраторыМДЛП.Ссылка <> &Ссылка
		|");
		Запрос.УстановитьПараметр("СерийныйНомерМБ", СерийныйНомерМБ);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Серийный номер МБ %1 уже указан для регистратора %2'"), СерийныйНомерМБ, Выборка.Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли