
#Область ОбработчикиСобытий

// Процедура - Перед записью
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Ссылка.Пустая() И Не ЭтотОбъект.Предопределенный
		И ЭтотОбъект.ВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты") Тогда
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Для данной сделки запрещено создание новых этапов.'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.Предопределенный И ЭтотОбъект.ВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты") Тогда
		Если ИзмененыДанныеЭтапа() Тогда 
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Для данной сделки этап заблокирован от изменения.'"));
			Возврат;
        КонецЕсли;
	КонецЕсли;
	          
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция - Изменены данные этапа
// 
// Возвращаемое значение:
//   - 
//
Функция ИзмененыДанныеЭтапа()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Этап", ЭтотОбъект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыСделок.ПометкаУдаления КАК ПометкаУдаления,
	|	ЭтапыСделок.Наименование КАК Наименование,
	|	ЭтапыСделок.ВидСделки КАК ВидСделки,
	|	ЭтапыСделок.НомерЭтапа КАК НомерЭтапа
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.Ссылка = &Этап";
	
	ВыборкаДанных = Запрос.Выполнить().Выбрать();
	Если ВыборкаДанных.Следующий() Тогда
		Если ЭтотОбъект.ВидСделки <> ВыборкаДанных.ВидСделки
			ИЛИ ЭтотОбъект.Наименование <> ВыборкаДанных.Наименование
			ИЛИ ЭтотОбъект.ПометкаУдаления <> ВыборкаДанных.ПометкаУдаления
			ИЛИ ЭтотОбъект.НомерЭтапа <> ВыборкаДанных.НомерЭтапа Тогда 
		
			Возврат Истина;
		Иначе 
			Возврат Ложь;
		КонецЕсли;	
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
