
#Область СлужебныйПрограммныйИнтерфейс

// Рассчитывает сумму в строке табличной части документа
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа,
//  ДокументОбъект       - объект редактируемого документа,
//                         "Без учета ручной скидки", сумма минус автоматические скидки;
//                         "Без учета скидок", сумма (Цена * Количество);
//
Процедура РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, СтруктураПараметров = Неопределено) Экспорт
	
	Если СтруктураПараметров = Неопределено Тогда
		СтруктураПараметров = Новый Структура();
	КонецЕсли;
	
	Если ТипЗнч(СтрокаТабличнойЧасти) = Тип("ДанныеФормыЭлементКоллекции") И СтрокаТабличнойЧасти.Свойство("КоличествоУпаковок")
		ИЛИ СтруктураПараметров.Свойство("ЕстьКолонкаКоличествоУпаковок") И СтруктураПараметров.ЕстьКолонкаКоличествоУпаковок Тогда
		Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.КоличествоУпаковок;
	ИначеЕсли ТипЗнч(СтрокаТабличнойЧасти) <> Тип("ДанныеФормыЭлементКоллекции") 
		И (ТипЗнч(СтрокаТабличнойЧасти) = Тип("ДокументТабличнаяЧастьСтрока.ВозвратОтПокупателя.Запасы") 
		ИЛИ ТипЗнч(СтрокаТабличнойЧасти) = Тип("ДокументТабличнаяЧастьСтрока.ВозвратОтПокупателя.Лечение")) Тогда 
		Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.КоличествоУпаковок;
	Иначе
		Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	
	СуммаСкидки = 0;                                    	
	
	// Для док.: "НарядЗаказ".
	Если ТипЗнч(СтрокаТабличнойЧасти) = Тип("ДанныеФормыЭлементКоллекции") И СтрокаТабличнойЧасти.Свойство("СуммаПродажи") Тогда
		
		Сумма       = СтрокаТабличнойЧасти.ЦенаПродажи * ?(СтрокаТабличнойЧасти.Свойство("КоличествоУпаковок"), СтрокаТабличнойЧасти.КоличествоУпаковок, СтрокаТабличнойЧасти.Количество);
		СуммаСкидки = СуммаСкидки + СтрокаТабличнойЧасти.СуммаАвтоматическойСкидкиНаценки;
		
		СтрокаТабличнойЧасти.СуммаПродажи = Сумма - СуммаСкидки;
		СтрокаТабличнойЧасти.ВсегоПродажи = СтрокаТабличнойЧасти.СуммаПродажи;  
		
		Если СтруктураПараметров.Свойство("ПорядокОкругления") И СтруктураПараметров.Свойство("ОкруглятьВБольшуюСторону") Тогда
			СтрокаТабличнойЧасти.СуммаПродажи = ОбщегоНазначенияКлиентСерверСтоматология.ОкруглитьЦену(СтрокаТабличнойЧасти.СуммаПродажи, СтруктураПараметров.ПорядокОкругления, СтруктураПараметров.ОкруглятьВБольшуюСторону);
		КонецЕсли;
		
	Иначе 
		Если ТипЗнч(СтрокаТабличнойЧасти) = Тип("ДанныеФормыЭлементКоллекции") И СтрокаТабличнойЧасти.Свойство("СуммаРучнойСкидки")
			ИЛИ СтруктураПараметров.Свойство("ЕстьКолонкаПроцентСкидкиНаценки") И СтруктураПараметров.ЕстьКолонкаПроцентСкидкиНаценки Тогда
			СуммаСкидки = СтрокаТабличнойЧасти.СуммаРучнойСкидки;
		КонецЕсли;
		
		Если ТипЗнч(СтрокаТабличнойЧасти) = Тип("ДанныеФормыЭлементКоллекции") И СтрокаТабличнойЧасти.Свойство("СуммаАвтоматическойСкидкиНаценки")
			ИЛИ СтруктураПараметров.Свойство("ЕстьКолонкаСуммаАвтоматическойСкидкиНаценки") И СтруктураПараметров.ЕстьКолонкаСуммаАвтоматическойСкидкиНаценки Тогда
			СуммаСкидки = СуммаСкидки + СтрокаТабличнойЧасти.СуммаАвтоматическойСкидкиНаценки;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.Сумма = Сумма - СуммаСкидки;
		Если СтруктураПараметров.Свойство("ПорядокОкругления") И СтруктураПараметров.Свойство("ОкруглятьВБольшуюСторону") Тогда
			СтрокаТабличнойЧасти.Сумма = ОбщегоНазначенияКлиентСерверСтоматология.ОкруглитьЦену(СтрокаТабличнойЧасти.Сумма, СтруктураПараметров.ПорядокОкругления, СтруктураПараметров.ОкруглятьВБольшуюСторону);
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры // РассчитатьСуммуТабЧасти()

// Процедура, пересчитывает процент ручной скидки
//
Процедура ПересчитатьПроцентРучнойСкидкиВСтрокеТЧ(ТекущаяСтрока, ИспользоватьКоличество = Ложь)  Экспорт
	
	Если ИспользоватьКоличество <> Истина Тогда
		Если ТекущаяСтрока.КоличествоУпаковок * ТекущаяСтрока.Цена <> 0 Тогда
			ТекущаяСтрока.ПроцентСкидкиНаценки = Окр(100*ТекущаяСтрока.СуммаРучнойСкидки / (ТекущаяСтрока.КоличествоУпаковок *ТекущаяСтрока.Цена), 2);
		Иначе
			ТекущаяСтрока.ПроцентСкидкиНаценки = 0;
		КонецЕсли;	
	Иначе
		Если ТекущаяСтрока.Количество * ТекущаяСтрока.Цена <> 0 Тогда
			ТекущаяСтрока.ПроцентСкидкиНаценки = Окр(100*ТекущаяСтрока.СуммаРучнойСкидки / (ТекущаяСтрока.Количество *ТекущаяСтрока.Цена), 2);
		Иначе
			ТекущаяСтрока.ПроцентСкидкиНаценки = 0;
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

// Процедура, пересчитывает сумму ручной скидки
//
Процедура ПересчитатьСуммуРучнойСкидкиВСтрокеТЧ(ТекущаяСтрока, ИспользоватьКоличество = Ложь)  Экспорт

	Если ИспользоватьКоличество <> Истина Тогда
		ТекущаяСтрока.СуммаРучнойСкидки = Окр(ТекущаяСтрока.КоличествоУпаковок * ТекущаяСтрока.Цена * ТекущаяСтрока.ПроцентСкидкиНаценки / 100, 2);
	Иначе
		ТекущаяСтрока.СуммаРучнойСкидки = Окр(ТекущаяСтрока.Количество * ТекущаяСтрока.Цена * ТекущаяСтрока.ПроцентСкидкиНаценки / 100, 2);
	КонецЕсли;

КонецПроцедуры

// Расчет, исходя из постоянной суммы
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа,
//  ДокументОбъект       - объект редактируемого документа.
//
Процедура РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти) Экспорт
	
	СтрокаТабличнойЧасти.СуммаНДС = Ценообразование.РассчитатьСуммуНДС(СтрокаТабличнойЧасти.Сумма, СтрокаТабличнойЧасти.СтавкаНДС);
	
КонецПроцедуры // РассчитатьСуммуНДСТабЧасти()

// Процедура, рассчитывает сумму колонки "Всего" в табличной части документа.
//  Параметры:
//   СтрокаТабличнойЧасти - текущая строка табличной части документа.
//
Процедура РассчитатьСуммуВКолонкеВсегоТабЧасти(СтрокаТабличнойЧасти, УчитыватьСуммуРасходов = Ложь) Экспорт 
	
	Сумма = СтрокаТабличнойЧасти.Сумма;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТабличнойЧасти, "Рекламация") 
		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Рекламация) Тогда
		Сумма = 0;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.Всего = Сумма;
	Если УчитыватьСуммуРасходов Тогда
				
		СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Всего + СтрокаТабличнойЧасти.СуммаРасходов;
	КонецЕсли;

КонецПроцедуры

// Процедура, рассчитывает цену по строке документа, при изменении колонки "Сумма"
//  Параметры:
//   СтрокаТабличнойЧасти - Текущая строка табличной части документа.
//
Процедура ПриИзмененииСуммыВТабличнойЧасти(СтрокаТабличнойЧасти) Экспорт
	
	
	// ИмяТабличнойЧасти = ОбщегоНазначения.ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку(СтрокаТабличнойЧасти);
	//
	// МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Если СтрокаТабличнойЧасти.Свойство("КоличествоУпаковок") Тогда
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.КоличествоУпаковок) Тогда
			СтрокаТабличнойЧасти.Цена = 0;
		Иначе
			
			// Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ПроцентСкидкиНаценки", МетаданныеДокумента,
			//				ИмяТабличнойЧасти) Тогда
			//	
			//	ПересчитыватьСкидку =
			//	УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),
			//									"ПриИзмененииСуммыПересчитыватьСкидку");
			//	
			//	Если ПересчитыватьСкидку Тогда
			//	
			//		Если (СтрокаТабличнойЧасти.Цена = 0) Или (СтрокаТабличнойЧасти.Количество = 0) Тогда
			//			СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 0;
			//			Если СтрокаТабличнойЧасти.Цена = 0 Тогда
			//				ОбщегоНазначения.СообщитьОбОшибке("Цена равна 0, после изменения суммы установлена нулевая скидка!");
			//			Иначе
			//				ОбщегоНазначения.СообщитьОбОшибке("Количество равно 0, после изменения суммы установлена нулевая скидка!");
			//			КонецЕсли;
			//		Иначе
			//			СуммаСоСкидками = СтрокаТабличнойЧасти.Сумма;
			//			СуммаБезСкидок  = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
			//			ПроцентСкидки   = 100 - (СуммаСоСкидками * 100) / СуммаБезСкидок;
			//			ПроцентАвтоматическихСкидок = 0;
			//			Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ПроцентАвтоматическихСкидок", МетаданныеДокумента,
			//									ИмяТабличнойЧасти) Тогда
			//				ПроцентАвтоматическихСкидок = СтрокаТабличнойЧасти.ПроцентАвтоматическихСкидок;
			//			КонецЕсли;
			//			СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = ПроцентСкидки - ПроцентАвтоматическихСкидок;
			//		КонецЕсли;
			//	Иначе
			//		Если СтрокаТабличнойЧасти.ПроцентСкидкиНаценки >= 100 Тогда
			//			СтрокаТабличнойЧасти.Цена = 0;
			//			ОбщегоНазначения.СообщитьОбОшибке("Скидка равна 100%, после изменения суммы установлена нулевая цена!");
			//		Иначе
			//			ПроцентАвтоматическихСкидок = 0;
			//			Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ПроцентАвтоматическихСкидок", МетаданныеДокумента,
			//									ИмяТабличнойЧасти) Тогда
			//				ПроцентАвтоматическихСкидок = СтрокаТабличнойЧасти.ПроцентАвтоматическихСкидок;
			//			КонецЕсли;
			//			СуммаБезСкидок  = СтрокаТабличнойЧасти.Сумма * 100/
			//			(100 - СтрокаТабличнойЧасти.ПроцентСкидкиНаценки - ПроцентАвтоматическихСкидок);
			//			СтрокаТабличнойЧасти.Цена = СуммаБезСкидок / СтрокаТабличнойЧасти.Количество;
			//		КонецЕсли;
			//	КонецЕсли;
			// Иначе
			СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.КоличествоУпаковок;
			// КонецЕсли;
		КонецЕсли;
		
	Иначе
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Количество) Тогда
			СтрокаТабличнойЧасти.Цена = 0;
		Иначе
			СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

// Процедура, выполняет выбор упаковки номенклатуры.
//  Параметры:
//   ДанныеВыбора - структура выбора;
//   СтандартнаяОбработка - признак выполнения стандартной обработки выбора.
//   ТекущаяСтрока - текущая строка табличной части, в которой осуществляется выбор значения.
//
Процедура ВыбратьУпаковкуНоменклатуры(ДанныеВыбора, СтандартнаяОбработка, ТекущаяСтрока, ИмяКолонкиНоменклатуры = "Номенклатура") Экспорт

	СтандартнаяОбработка = Ложь;

	Если ЗначениеЗаполнено(ТекущаяСтрока[ИмяКолонкиНоменклатуры]) Тогда
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.УпаковкиНоменклатуры.ПустаяСсылка"), "<без упаковки>");

		Если Не ОбщегоНазначенияСтоматология.ПроверитьИспользованиеУпаковокИПолучитьСписокДляВыбора(ТекущаяСтрока[ИмяКолонкиНоменклатуры], ДанныеВыбора) Тогда
			// Предупреждение(НСтр("ru = 'Для данной номенклатуры нет упаковок.'"));
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
  
// Процедура выполняет стандартные действия при изменении единицы цены
// в строке табличной части документа.
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа,
//  ДокументОбъект       - объект редактируемого документа
//
Процедура ПриИзмененииУпаковкиТабЧасти(СтрокаТабличнойЧасти, СтруктрураПараметров = Неопределено) Экспорт
 
	// Получим цену, если она есть.
	Если СтрокаТабличнойЧасти.Свойство("Цена") <> Неопределено и СтруктрураПараметров <> Неопределено Тогда
		СтруктрураПараметров.Вставить("Номенклатура", 		СтрокаТабличнойЧасти.Номенклатура);
		СтруктрураПараметров.Вставить("Упаковка", 			СтрокаТабличнойЧасти.Упаковка);			
		СтруктураДанные = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктрураПараметров);
		СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
	КонецЕсли;
	
	// Пересчитаем количество
	ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(СтрокаТабличнойЧасти);	
	
КонецПроцедуры // ПриИзмененииЕдиницыТабЧасти

// Процедура, рассчитывает количество ед. изм.
//  Параметры:
//   СтрокаТабличнойЧасти - строка табличной части.
//
Процедура ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(СтрокаТабличнойЧасти, СтруктрураПараметров = Неопределено) Экспорт
	
	СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.КоличествоУпаковок * ОбщегоНазначенияСтоматология.ВернутьКоэффициентУпаковки(СтрокаТабличнойЧасти.Упаковка);
	
	Если СтруктрураПараметров <> Неопределено Тогда
		Если СтруктрураПараметров.Свойство("РасчетДопКолонки", Истина) Тогда
			СтрокаТабличнойЧасти.КоличествоПоДаннымУчета =  СтрокаТабличнойЧасти.КоличествоУпаковокПоДаннымУчета * ОбщегоНазначенияСтоматология.ВернутьКоэффициентУпаковки(СтрокаТабличнойЧасти.Упаковка);
		КонецЕсли;		
	КонецЕсли;
	
	
КонецПроцедуры
       
// Функция выполняет добавление номенклатуры в ТЧ
//
Функция СШКОбработкаТабличнойЧасти(ТабличнаяЧасть, ДанныеШтрикодов, Контрагент = Неопределено, Карта = Неопределено, Документ = Неопределено, ТЧЗапасы = Неопределено, МассивНенайденныхШтрихкодов = Неопределено, ИдентификаторНовойСтрокиТЧ = Неопределено) Экспорт 
	
	Если ДанныеШтрикодов.Количество() > 0 Тогда
		ДанныеШтрихкода = ?(ТипЗнч(ДанныеШтрикодов) = Тип("Структура"), ДанныеШтрикодов, ДанныеШтрикодов[0]);		
		ДанныеПоШтрихкодам = ОбщегоНазначенияСтоматология.ВернутьНоменклатуруПоШтрихкоду(ДанныеШтрихкода.Штрихкод, МассивНенайденныхШтрихкодов = Неопределено);
		Если ДанныеПоШтрихкодам <> Неопределено Тогда
			Если ТипЗнч(ДанныеПоШтрихкодам.Объект) = Тип("СправочникСсылка.Номенклатура") Тогда
				Если ТабличнаяЧасть <> Неопределено и ОбщегоНазначенияСтоматология.ПроверитьТипНоменклатуры(Документ, ДанныеПоШтрихкодам.Объект) Тогда
					Отбор = ?(ТабличнаяЧасть.ТекущиеДанные <> Неопределено И ТабличнаяЧасть.ТекущиеДанные.Свойство("Партия"),
							Новый Структура("Номенклатура, Партия, Упаковка", ДанныеПоШтрихкодам.Объект, ДанныеПоШтрихкодам.Партия, ДанныеПоШтрихкодам.Упаковка),
							Новый Структура("Номенклатура, Упаковка", ДанныеПоШтрихкодам.Объект, ДанныеПоШтрихкодам.Упаковка));
					НайденноеЗначение = ТЧЗапасы.НайтиСтроки(Отбор);
					Если НайденноеЗначение.Количество() > 0 Тогда
						Если ТабличнаяЧасть.ТекущиеДанные.Свойство("КоличествоУпаковок") Тогда
							НайденноеЗначение[0].КоличествоУпаковок = НайденноеЗначение[0].КоличествоУпаковок + ?(ДанныеШтрихкода.Свойство("Количество"), ДанныеШтрихкода.Количество, 1);
						КонецЕсли;	
						ТабличнаяЧасть.ТекущаяСтрока = НайденноеЗначение[0].ПолучитьИдентификатор();
						ТабличнаяЧасть.Обновить();
						// Возврат Ложь;
						Возврат Истина;
					Иначе
						ТабличнаяЧасть.ДобавитьСтроку();
						ТабличнаяЧасть.ТекущиеДанные.Номенклатура = ДанныеПоШтрихкодам.Объект;
						Если ТабличнаяЧасть.ТекущиеДанные.Свойство("КоличествоУпаковок") Тогда
							ТабличнаяЧасть.ТекущиеДанные.КоличествоУпаковок = ?(ДанныеШтрихкода.Свойство("Количество"), ДанныеШтрихкода.Количество, 1);
						КонецЕсли;	
						ТабличнаяЧасть.ТекущиеДанные.Упаковка = ДанныеПоШтрихкодам.Упаковка;
						Если ТабличнаяЧасть.ТекущиеДанные.Свойство("Партия") Тогда
							ТабличнаяЧасть.ТекущиеДанные.Партия   = ДанныеПоШтрихкодам.Партия;
						КонецЕсли;
						ИдентификаторНовойСтрокиТЧ = ТабличнаяЧасть.ТекущиеДанные.ПолучитьИдентификатор();
						Возврат Истина;
					КонецЕсли;
				Иначе
					Возврат Ложь;
				КонецЕсли;
			ИначеЕсли  Контрагент <> Неопределено и Карта <> Неопределено Тогда
				Контрагент = ДанныеПоШтрихкодам.ВладелецКарты;
				Карта      = ДанныеПоШтрихкодам.Ссылка;
				Возврат Ложь;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Штрихкод "+ДанныеШтрихкода.Штрихкод+" присвоен карте клиента "+ДанныеПоШтрихкодам.Объект+"");
				Возврат Ложь;
			КонецЕсли;
		Иначе
			Если МассивНенайденныхШтрихкодов <> Неопределено Тогда
				МассивНенайденныхШтрихкодов.Добавить(ДанныеШтрихкода);
			КонецЕсли;			
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДинамическоеСозданиеМеню

// Процедура, создает динамические кнопки.
//
Процедура СоздатьМенюДокумента(Форма, СтруктураКнопок, ИмяЭлементаДляРазмещения) Экспорт
	
	масРеквизитов = Новый Массив;
	масРеквизитов.Добавить(Новый РеквизитФормы("_СписокПанелей", Новый ОписаниеТипов("СписокЗначений"), , "_СписокПанелей", Ложь));
	Форма.ИзменитьРеквизиты(масРеквизитов);
	
	Для Каждого Кнопка из СтруктураКнопок Цикл
		
		ИмяКнопки  = "_"+Кнопка.Ключ;	
		ИмяКоманды = "_"+Кнопка.Значение; 
		КомандаФормы  = Форма.Команды.Добавить(ИмяКоманды);
		КомандаФормы.Действие = "ПроцедураОбработкиНажатияМеню";
		
		ГруппаКнопки = Форма.Элементы.Добавить("Группа_Кнопки" + ИмяКнопки, Тип("ГруппаФормы"), Форма.Элементы[ИмяЭлементаДляРазмещения]);
		ГруппаКнопки.Вид 								= ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаКнопки.Отображение 						= ОтображениеОбычнойГруппы.Нет;
		ГруппаКнопки.Группировка 						= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ГруппаКнопки.ГоризонтальныйИнтервал				= ИнтервалМеждуЭлементамиФормы .Нет;
		ГруппаКнопки.ОтображатьЗаголовок 				= Ложь;
		ГруппаКнопки.ЦветФона 							= ?(Форма.Элементы[Кнопка.Значение].Видимость,Новый Цвет(242,242,242),Новый Цвет(255,255,255));
		ГруппаКнопки.ВертикальноеПоложениеВГруппе 		= ВертикальноеПоложениеЭлемента.Центр;
		ГруппаКнопки.ВертикальноеПоложениеПодчиненных 	= ВертикальноеПоложениеЭлемента.Центр;
		ГруппаКнопки.ГоризонтальноеПоложениеПодчиненных	= ГоризонтальноеПоложениеЭлемента.Центр;
		
		ДекорацияКнопка = Форма.Элементы.Добавить("Дек"+ИмяКнопки, Тип("ДекорацияФормы"), ГруппаКнопки);
		ДекорацияКнопка.Вид = ВидДекорацииФормы.Надпись;
		Если Кнопка.Ключ = "Номенклатура" Тогда
			ДекорацияКнопка.Заголовок = "Номенклатура";
		Иначе
			ДекорацияКнопка.Заголовок = Форма.Элементы[Кнопка.Значение].Заголовок;
		КонецЕсли;
		ДекорацияКнопка.Видимость = Форма.Элементы[Кнопка.Значение].Видимость;
		ДекорацияКнопка.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		ДекорацияКнопка.Шрифт = Новый Шрифт(Форма.Элементы["Дек"+ИмяКнопки].Шрифт,,11);
		
		НоваяКнопка = Форма.Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), ГруппаКнопки);
		Если Кнопка.Ключ = "Номенклатура" Тогда
			НоваяКнопка.Заголовок = "Номенклатура";
		Иначе
			НоваяКнопка.Заголовок = Форма.Элементы[Кнопка.Значение].Заголовок;
		КонецЕсли;
		НоваяКнопка.ИмяКоманды = ИмяКоманды;
		НоваяКнопка.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
		НоваяКнопка.Видимость = НЕ Форма.Элементы[Кнопка.Значение].Видимость;
		НоваяКнопка.ЦветТекста = Новый Цвет(51,102,187);	
		НоваяКнопка.Шрифт = Новый Шрифт(Форма.Элементы[ИмяКнопки].Шрифт,,11); 		
		Форма._СписокПанелей.Добавить(Кнопка.Значение, ИмяКнопки);
		
	КонецЦикла;
	
КонецПроцедуры  


// Процедура, выполняет обработку нажатия динамических кнопок.
//
Процедура ПроцедураОбработкиНажатияМеню(Форма, ЭлементИмя) Экспорт
	
	Для Каждого Панель из Форма._СписокПанелей Цикл
		
		Если Панель.Значение = Сред(ЭлементИмя,2) Тогда
			Форма.Элементы[Панель.Значение].Видимость = Истина;
			Форма.Элементы["Дек"+Панель.Представление].Видимость = Истина;
			Форма.Элементы[Панель.Представление].Видимость = Ложь;
			Форма.Элементы["Группа_Кнопки"+Панель.Представление].ЦветФона = Новый Цвет(242,242,242);			
		Иначе	
			Форма.Элементы[Панель.Значение].Видимость = Ложь;
			Форма.Элементы["Дек"+Панель.Представление].Видимость = Ложь;
			Форма.Элементы[Панель.Представление].Видимость = Истина;
			Форма.Элементы["Группа_Кнопки"+Панель.Представление].ЦветФона = Новый Цвет(255,255,255);			
		КонецЕсли;	
		
	КонецЦикла;
	
	ГруппаИнформацияПоОплате = Форма.Элементы.Найти("ГруппаИнформацияПоОплате");
	Если ГруппаИнформацияПоОплате <> Неопределено Тогда
		ГруппаИнформацияПоОплате.Видимость = Сред(ЭлементИмя,2) <> "ГруппаДополнительно";
	КонецЕсли;	
	
КонецПроцедуры

// Процедура, выполняет подсчет количества строк в таб.частях и выводит его в заголовок панели
//
Процедура ОбновитьЗаголовкиТабЧастей(Форма, ЧитатьДанныеИзФормы = Ложь) Экспорт
	
	Объект = ?(ЧитатьДанныеИзФормы, Форма, Форма.Объект);
	
	Для Каждого Панель Из Форма._СписокПанелей Цикл
		
		ИмяТабЧасти = Сред(Панель.Значение, 7);
		
		СтрокТабЧасти = "0";   		
		
		Если ИмяТабЧасти = "ЗапасыИУслуги" Тогда
			СтрокТабЧасти = Строка(Форма.Объект.Запасы.Количество());
		ИначеЕсли ИмяТабЧасти = "СхемаРассрочки" Тогда
			СтрокТабЧасти = Строка(Форма.СхемаРассрочки.ПолучитьЭлементы().Количество());
		ИначеЕсли ИмяТабЧасти = "Подарки" Тогда
			// СтрокТабЧасти = Строка(Форма.Объект.Подарки.Количество());
			Если ЧитатьДанныеИзФормы Или Объект.Свойство(ИмяТабЧасти) Тогда
				КоличествоИспользуемых = Объект[ИмяТабЧасти].НайтиСтроки(Новый Структура("Использование", Истина)).Количество();
				СтрокТабЧасти 		   = "" + КоличествоИспользуемых + Нстр("ru = ' из '; en = ' out of '") + Объект[ИмяТабЧасти].Количество();
			КонецЕсли;     
		ИначеЕсли ИмяТабЧасти = "СкидкиНаценки" Тогда
			// СтрокТабЧасти = Строка(Форма.Объект.СкидкиНаценки.Количество());
			Если ЧитатьДанныеИзФормы ИЛИ Объект.Свойство(ИмяТабЧасти) Тогда   			 
				КоличествоИспользуемых = Объект[ИмяТабЧасти].НайтиСтроки(Новый Структура("ПризнакОплатыБонусом, Использование", Ложь, Истина)).Количество();
				КоличествоВсего		   = Объект[ИмяТабЧасти].НайтиСтроки(Новый Структура("ПризнакОплатыБонусом", Ложь)).Количество();				
				СтрокТабЧасти = "" + КоличествоИспользуемых + Нстр("ru = ' из '; en = ' out of '") + КоличествоВсего;       				
			КонецЕсли;        
		ИначеЕсли ИмяТабЧасти = "ВыданныеАвансы" Тогда
			СтрокТабЧасти = Строка(Форма.Объект.ВыданныеАвансы.Количество());
		ИначеЕсли ИмяТабЧасти = "Авансы" Тогда
			Если Форма.Объект.Свойство("УчтенныеАвансы") Тогда
				СтрокТабЧасти = Строка(Форма.Объект.УчтенныеАвансы.Количество());
			Иначе
				СтрокТабЧасти = Строка(Форма.Объект.Авансы.Количество());
			КонецЕсли;	
		ИначеЕсли ИмяТабЧасти = "Запасы" Тогда
			СтрокТабЧасти = Строка(Форма.Объект.Запасы.Количество());
		ИначеЕсли ИмяТабЧасти = "Расшифровка" Тогда
			СтрокТабЧасти = Строка(Форма.Объект.РасшифровкаПлатежа.Количество());
		ИначеЕсли ИмяТабЧасти = "РасшифровкаСписания" Тогда
			СтрокТабЧасти = Строка(Форма.Объект.РасшифрокаСписания.Количество());
		ИначеЕсли ИмяТабЧасти = "Затраты" Тогда
			СтрокТабЧасти = Строка(Форма.Объект.Затраты.Количество());
		ИначеЕсли ИмяТабЧасти = "Расходы" Тогда
			СтрокТабЧасти = Строка(Форма.Объект.Расходы.Количество());
		ИначеЕсли ИмяТабЧасти = "ОказанныеУслуги" Тогда
			СтрокТабЧасти = Строка(Форма.Объект.ОказанныеУслуги.Количество());
		ИначеЕсли ИмяТабЧасти = "Оплаты" Тогда
			СтрокТабЧасти = Строка(Форма.Объект.Оплаты.Количество());
		ИначеЕсли ИмяТабЧасти = "СтруктурныеЕдиницы" Тогда
			ИмяТабЧасти = "ТаблицаСтруктурныеЕдиницыСкидки";
			СтрокТабЧасти = Форма[ИмяТабЧасти].Количество();
			
		ИначеЕсли ИмяТабЧасти = "Запись" Тогда			
			СтрокТабЧасти = Форма.ВернутьКоличествоУслуг();
			
		ИначеЕсли ИмяТабЧасти = "ОценкиИОтзывы" Тогда    			
			Продолжить;
			
		ИначеЕсли ИмяТабЧасти = "Переоценка" Тогда
			СтрокТабЧасти = ?(Форма.Объект.Свойство(ИмяТабЧасти), 
			"" + Форма.Объект[ИмяТабЧасти].НайтиСтроки(Новый Структура("Активность", Истина)).Количество() + 
			" из " + Форма.Объект[ИмяТабЧасти].Количество(), 0);      
		Иначе 	
			СтрокТабЧасти = ?(Форма.Объект.Свойство(ИмяТабЧасти), Форма.Объект[ИмяТабЧасти].Количество(), 0);
		КонецЕсли;
		
		ЗаголовокКнопки = Форма.Элементы[Панель.Представление].Заголовок;
		ЗаголовокКнопки = Сред(ЗаголовокКнопки, 1, ?(СтрНайти(ЗаголовокКнопки, " (") > 0, СтрНайти(ЗаголовокКнопки, " (") - 1, СтрДлина(ЗаголовокКнопки)));
		Форма.Элементы[Панель.Представление].Заголовок = ЗаголовокКнопки + ?(СтрокТабЧасти <> "0" И СтрокТабЧасти <> 0," ("+Строка(СтрокТабЧасти)+")", "");
		Форма.Элементы["Дек"+Панель.Представление].Заголовок = Форма.Элементы[Панель.Представление].Заголовок;
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСДеревьями

&НаСервере
// Процедура, выполянет создание дерева структурных единиц.
//
Процедура СоздатьДеревоСтруктурныхЕдиниц(
		Форма, 
		Реквизит, 
		ОбъектОграничения, 
		УстановитьВсеФлагиВИстину = Неопределено, 
		МассивСтруктурныхЕдиниц = Неопределено, 
		МассивДоступныхСтруктурныхЕдиниц = Неопределено, 
		СоответствиеИндексамКартинок = Неопределено,
		МассивКолонок = Неопределено,
		ОтображатьПервыйУровеньДерева = Ложь) Экспорт
	
	Если МассивСтруктурныхЕдиниц = Неопределено Тогда
		МассивСтруктурныхЕдиниц = Справочники.СтруктурныеЕдиницы.ВернутьМассивСтруктурныхЕдиниц();
	КонецЕсли;
	КоличествоСтруктурныхЕдиниц = МассивСтруктурныхЕдиниц.Количество();
	
	ЭлементДерево            = ?(МассивДоступныхСтруктурныхЕдиниц = Неопределено, Форма.ПодборСтруктурныеЕдиницы, Форма.ПодборМестаРаботыСотрудника);
	ПервыйУровеньДерева 	 = ЭлементДерево.ПолучитьЭлементы();
	ПервоначальноеЗаполнение = ПервыйУровеньДерева.Количество() = 0;
	
	Если ПервоначальноеЗаполнение Тогда
		
		ОтображатьПервыйУровеньДерева = ОтображатьПервыйУровеньДерева ИЛИ ТипЗнч(ОбъектОграничения) = Тип("СправочникСсылка.Сотрудники");
		
		ЗаполнитьДеревоСтруктурныхЕдиниц(МассивСтруктурныхЕдиниц, ЭлементДерево, Форма, 
		СоответствиеИндексамКартинок, ОтображатьПервыйУровеньДерева, ОбъектОграничения);
		
		Если МассивДоступныхСтруктурныхЕдиниц = Неопределено Тогда 
			МассивВыбранныхСтруктурныхЕдиниц = РегистрыСведений.РеквизитыОбъектов.ПолучитьСтруктурныеЕдиницыПоОбъекту(ОбъектОграничения, Реквизит);
		Иначе
			МассивВыбранныхСтруктурныхЕдиниц = МассивДоступныхСтруктурныхЕдиниц;
		КонецЕсли;
		
	Иначе
		
		ДанныеДерева 		   = ПервыйУровеньДерева[0].ПолучитьЭлементы();
		МассивСтрокДляУдаления = Новый Массив();
		
		ДобавленыеСтруктурныеЕдиницы = Новый Массив;
		Для Каждого СтрокаДерева Из ДанныеДерева Цикл
			
			Если МассивСтруктурныхЕдиниц.Найти(СтрокаДерева.СтруктурнаяЕдиница) = Неопределено Тогда
				МассивСтрокДляУдаления.Добавить(СтрокаДерева);
			Иначе
				ДобавленыеСтруктурныеЕдиницы.Добавить(СтрокаДерева.СтруктурнаяЕдиница);
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтрокаДляУдаления Из МассивСтрокДляУдаления Цикл
			ДанныеДерева.Удалить(СтрокаДляУдаления);		
		КонецЦикла;
		
		Если СоответствиеИндексамКартинок <> Неопределено
			И ТипЗнч(СоответствиеИндексамКартинок) = Тип("Соответствие") Тогда 
		
			Для Каждого СтруктурнаяЕдиница Из МассивСтруктурныхЕдиниц Цикл
				Если ДобавленыеСтруктурныеЕдиницы.Найти(СтруктурнаяЕдиница) = Неопределено Тогда
					НоваяСтрока 				   = ДанныеДерева.Вставить(0);
					НоваяСтрока.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
					
					Индекс 						   = СоответствиеИндексамКартинок.Получить(СтруктурнаяЕдиница);
					НоваяСтрока.ИндКартинки 	   = ?(Индекс = Неопределено, 1, Индекс);
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			
			Для Каждого СтруктурнаяЕдиница Из МассивСтруктурныхЕдиниц Цикл
				Если ДобавленыеСтруктурныеЕдиницы.Найти(СтруктурнаяЕдиница) = Неопределено Тогда
					НоваяСтрока 				   = ДанныеДерева.Вставить(0);
					НоваяСтрока.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
					НоваяСтрока.ИндКартинки 	   = 1;	
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		МассивВыбранныхСтруктурныхЕдиниц = Неопределено;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивКолонок) Тогда		
		Для Каждого  ЭлементМ Из МассивКолонок Цикл 
			УстановитьНачальноеСостояниеФлагов(ЭлементДерево.ПолучитьЭлементы(), МассивВыбранныхСтруктурныхЕдиниц, 
			КоличествоСтруктурныхЕдиниц, УстановитьВсеФлагиВИстину,, ЭлементМ);
		КонецЦикла;
	Иначе
		УстановитьНачальноеСостояниеФлагов(ЭлементДерево.ПолучитьЭлементы(), МассивВыбранныхСтруктурныхЕдиниц, 
		КоличествоСтруктурныхЕдиниц, УстановитьВсеФлагиВИстину);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
// Процедура, выполянет создание дерева структурных единиц.
//
Процедура СоздатьДеревоСтруктурныхЕдиницЖурналаПриемов(
		Форма, 
		Реквизит, 
		ОбъектОграничения, 
		УстановитьВсеФлагиВИстину = Неопределено, 
		МассивСтруктурныхЕдиниц = Неопределено, 
		МассивДоступныхСтруктурныхЕдиниц = Неопределено, 
		СоответствиеИндексамКартинок = Неопределено,
		МассивКолонок = Неопределено,
		ОтображатьПервыйУровеньДерева = Ложь) Экспорт
	
	Если МассивСтруктурныхЕдиниц = Неопределено Тогда
		МассивСтруктурныхЕдиниц = Справочники.СтруктурныеЕдиницы.ВернутьМассивСтруктурныхЕдиниц();
	КонецЕсли;
	КоличествоСтруктурныхЕдиниц = МассивСтруктурныхЕдиниц.Количество();
	
	ЭлементДерево            = Форма.ПодборЖурналыПриемовСотрудника;
	ПервыйУровеньДерева 	 = ЭлементДерево.ПолучитьЭлементы();
	ПервоначальноеЗаполнение = ПервыйУровеньДерева.Количество() = 0;
	
	Если ПервоначальноеЗаполнение Тогда
		
		ОтображатьПервыйУровеньДерева = ОтображатьПервыйУровеньДерева ИЛИ ТипЗнч(ОбъектОграничения) = Тип("СправочникСсылка.Сотрудники");
		
		ЗаполнитьДеревоСтруктурныхЕдиниц(МассивСтруктурныхЕдиниц, ЭлементДерево, Форма, 
		СоответствиеИндексамКартинок, ОтображатьПервыйУровеньДерева, ОбъектОграничения);
		
		МассивВыбранныхСтруктурныхЕдиниц = МассивДоступныхСтруктурныхЕдиниц;
		
	Иначе
		
		ДанныеДерева 		   = ПервыйУровеньДерева[0].ПолучитьЭлементы();
		МассивСтрокДляУдаления = Новый Массив();
		
		ДобавленыеСтруктурныеЕдиницы = Новый Массив;
		Для Каждого СтрокаДерева Из ДанныеДерева Цикл
			
			Если МассивСтруктурныхЕдиниц.Найти(СтрокаДерева.СтруктурнаяЕдиница) = Неопределено Тогда
				МассивСтрокДляУдаления.Добавить(СтрокаДерева);
			Иначе
				ДобавленыеСтруктурныеЕдиницы.Добавить(СтрокаДерева.СтруктурнаяЕдиница);
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтрокаДляУдаления Из МассивСтрокДляУдаления Цикл
			ДанныеДерева.Удалить(СтрокаДляУдаления);		
		КонецЦикла;
		
		Если СоответствиеИндексамКартинок <> Неопределено
			И ТипЗнч(СоответствиеИндексамКартинок) = Тип("Соответствие") Тогда
			
			Для Каждого СтруктурнаяЕдиница Из МассивСтруктурныхЕдиниц Цикл
				Если ДобавленыеСтруктурныеЕдиницы.Найти(СтруктурнаяЕдиница) = Неопределено Тогда
					НоваяСтрока 				   = ДанныеДерева.Вставить(0);
					НоваяСтрока.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
					
					Индекс 						   = СоответствиеИндексамКартинок.Получить(СтруктурнаяЕдиница);
					НоваяСтрока.ИндКартинки 	   = ?(Индекс = Неопределено, 1, Индекс);
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			
			Для Каждого СтруктурнаяЕдиница Из МассивСтруктурныхЕдиниц Цикл
				Если ДобавленыеСтруктурныеЕдиницы.Найти(СтруктурнаяЕдиница) = Неопределено Тогда
					НоваяСтрока 				   = ДанныеДерева.Вставить(0);
					НоваяСтрока.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
					НоваяСтрока.ИндКартинки 	   = 1;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;	
		
		МассивВыбранныхСтруктурныхЕдиниц = Неопределено;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивКолонок) Тогда		
		Для Каждого  ЭлементМ Из МассивКолонок Цикл 
			УстановитьНачальноеСостояниеФлагов(ЭлементДерево.ПолучитьЭлементы(), МассивВыбранныхСтруктурныхЕдиниц, КоличествоСтруктурныхЕдиниц, УстановитьВсеФлагиВИстину,, ЭлементМ);
		КонецЦикла;
	Иначе
		УстановитьНачальноеСостояниеФлагов(ЭлементДерево.ПолучитьЭлементы(), МассивВыбранныхСтруктурныхЕдиниц, КоличествоСтруктурныхЕдиниц, УстановитьВсеФлагиВИстину);
	КонецЕсли;
		
КонецПроцедуры

//&НаСервере
//// Процедура, выполянет создание дерева структурных единиц.
////
//Процедура СоздатьДеревоДоступныхКасс(
//		Форма, 
//		Реквизит, 
//		ОбъектОграничения, 
//		УстановитьВсеФлагиВИстину = Неопределено, 
//		МассивКасс = Неопределено, 
//		МассивДоступныхКасс = Неопределено, 
//		МассивСтруктурДанных = Неопределено,
//		МассивКолонок = Неопределено,
//		ОтображатьПервыйУровеньДерева = Ложь,
//		МассивДоступныхСтруктурныхЕдиниц = Неопределено) Экспорт
//	
//	Если МассивКасс = Неопределено Тогда
//		МассивКасс = Справочники.Кассы.ВернутьДоступныеКассы(МассивДоступныхСтруктурныхЕдиниц);
//	КонецЕсли;
//	КоличествоКасс = МассивКасс.Количество();
//	
//	ЭлементДерево            = Форма.ПодборДоступныеКассы;
//	ПервыйУровеньДерева 	 = ЭлементДерево.ПолучитьЭлементы();
//	ПервоначальноеЗаполнение = ПервыйУровеньДерева.Количество() = 0;
//	
//	Если ПервоначальноеЗаполнение Тогда
//		
//		ОтображатьПервыйУровеньДерева = ОтображатьПервыйУровеньДерева ИЛИ ТипЗнч(ОбъектОграничения) = Тип("СправочникСсылка.Сотрудники");
//		
//		ЗаполнитьДеревоСтруктурныхЕдиниц(МассивКасс, ЭлементДерево, Форма, МассивСтруктурДанных, ОтображатьПервыйУровеньДерева, ОбъектОграничения);
//		
//		Если МассивДоступныхКасс = Неопределено Тогда 
//			МассивВыбранныхСтруктурныхЕдиниц = РегистрыСведений.РеквизитыОбъектов.ПолучитьСтруктурныеЕдиницыПоОбъекту(ОбъектОграничения, Реквизит);
//		Иначе
//			МассивВыбранныхСтруктурныхЕдиниц = МассивДоступныхКасс;
//		КонецЕсли;
//		
//	Иначе
//		
//		ДанныеДерева 		   = ПервыйУровеньДерева[0].ПолучитьЭлементы();
//		МассивСтрокДляУдаления = Новый Массив();
//		
//		ДобавленыеСтруктурныеЕдиницы = Новый Массив;
//		
//		Для Каждого СтрокаДерева Из ДанныеДерева Цикл
//			
//			Если МассивКасс.Найти(СтрокаДерева.СтруктурнаяЕдиница) = Неопределено Тогда
//				МассивСтрокДляУдаления.Добавить(СтрокаДерева);
//			Иначе
//				ДобавленыеСтруктурныеЕдиницы.Добавить(СтрокаДерева.СтруктурнаяЕдиница);
//			КонецЕсли;
//			
//		КонецЦикла;
//		
//		Для Каждого СтрокаДляУдаления Из МассивСтрокДляУдаления Цикл
//			ДанныеДерева.Удалить(СтрокаДляУдаления);		
//		КонецЦикла;
//		
//		Для Каждого СтруктурнаяЕдиница Из МассивКасс Цикл
//			
//			Если ДобавленыеСтруктурныеЕдиницы.Найти(СтруктурнаяЕдиница) = Неопределено Тогда
//				НоваяСтрока 				   = ДанныеДерева.Добавить();
//				НоваяСтрока.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
//				НоваяСтрока.ИндКартинки 	   = 2;
//			КонецЕсли;	
//			
//		КонецЦикла;
//		
//		МассивВыбранныхСтруктурныхЕдиниц = Неопределено;
//		
//	КонецЕсли;
//	
//	Если ЗначениеЗаполнено(МассивКолонок) Тогда		
//		Для Каждого  ЭлементМ Из МассивКолонок Цикл 
//			УстановитьНачальноеСостояниеФлагов(ЭлементДерево.ПолучитьЭлементы(), МассивВыбранныхСтруктурныхЕдиниц, КоличествоКасс, УстановитьВсеФлагиВИстину,, ЭлементМ);
//		КонецЦикла;
//	Иначе
//		УстановитьНачальноеСостояниеФлагов(ЭлементДерево.ПолучитьЭлементы(), МассивВыбранныхСтруктурныхЕдиниц, КоличествоКасс, УстановитьВсеФлагиВИстину);
//	КонецЕсли;
//		
//КонецПроцедуры

// Процедура, заполняет дерево структурных единиц.
//
Процедура ЗаполнитьДеревоСтруктурныхЕдиниц(МассивСтруктурныхЕдиниц, ЭлементЗаполнения, Форма, 
	СоответствиеИндексамКартинок = Неопределено, ОтображатьПервыйУровеньДерева, ОбъектОграничения)
	
	Если МассивСтруктурныхЕдиниц.Количество() > 1 ИЛИ ОтображатьПервыйУровеньДерева Тогда
		
		НоваяСтрока              	   = ЭлементЗаполнения.ПолучитьЭлементы().Добавить();
		НоваяСтрока.СтруктурнаяЕдиница = "Все клиники";
		НоваяСтрока.ЭтоГруппа		   = Истина;
		
		Если СоответствиеИндексамКартинок <> Неопределено 
			И ТипЗнч(СоответствиеИндексамКартинок) = Тип("Соответствие") Тогда
			
			Для Каждого СтруктурнаяЕдиница Из МассивСтруктурныхЕдиниц Цикл	
				НоваяСтрокаГруппы              		 = НоваяСтрока.ПолучитьЭлементы().Добавить();
				НоваяСтрокаГруппы.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
				НоваяСтрокаГруппы.ЭтоГруппа			 = Ложь;
				
				Индекс 						  		 = СоответствиеИндексамКартинок.Получить(СтруктурнаяЕдиница);
				НоваяСтрокаГруппы.ИндКартинки 		 = ?(Индекс = Неопределено, 1, Индекс);	
			КонецЦикла;
			
		Иначе
			
			Для Каждого СтруктурнаяЕдиница Из МассивСтруктурныхЕдиниц Цикл	
				НоваяСтрокаГруппы              		 = НоваяСтрока.ПолучитьЭлементы().Добавить();
				НоваяСтрокаГруппы.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
				НоваяСтрокаГруппы.ЭтоГруппа			 = Ложь;
				НоваяСтрокаГруппы.ИндКартинки 		 = 1;	
			КонецЦикла;
			
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

// Функция, рекурсивно устанавливает флаги на группы.
//
Функция УстановитьНачальноеСостояниеФлагов(ДанныеДерева, МассивСтруктурныхЕдиниц, КоличествоСтруктурныхЕдиниц, 
	УстановитьЗначениеВсехФлагов = Неопределено, ДоступныеКассы = Ложь, НаименованиеКолонки = Неопределено) Экспорт
	
	КоличествоВыбранныхСтрок = 0;
	Колонка = ?(ЗначениеЗаполнено(НаименованиеКолонки), НаименованиеКолонки, "Выгружать");	
	Для Каждого УровеньДерева ИЗ ДанныеДерева Цикл
		
		Если УровеньДерева.ЭтоГруппа Тогда
			
			УровеньДерева[Колонка] = УстановитьНачальноеСостояниеФлагов(УровеньДерева.ПолучитьЭлементы(), МассивСтруктурныхЕдиниц, КоличествоСтруктурныхЕдиниц, УстановитьЗначениеВсехФлагов, ДоступныеКассы, НаименованиеКолонки);
			
		Иначе
			
			УстановитьФлагиВИстину = УстановитьЗначениеВсехФлагов = Истина;
			
			Если УстановитьЗначениеВсехФлагов = Ложь Тогда
				
				УровеньДерева[Колонка] = Ложь;	
				
			ИначеЕсли МассивСтруктурныхЕдиниц <> Неопределено ИЛИ УстановитьФлагиВИстину Тогда
				
				Если ДоступныеКассы = Истина Тогда
					УровеньДерева[Колонка]  = УстановитьФлагиВИстину ИЛИ МассивСтруктурныхЕдиниц.Найти(УровеньДерева.Касса) <> Неопределено;
				Иначе
					Если Колонка = "Выгружать" Тогда
						УровеньДерева[Колонка] = УстановитьФлагиВИстину ИЛИ МассивСтруктурныхЕдиниц.Найти(УровеньДерева.СтруктурнаяЕдиница) <> Неопределено;	
					КонецЕсли;	
				КонецЕсли;
				
			КонецЕсли;
			
			КоличествоВыбранныхСтрок = КоличествоВыбранныхСтрок + УровеньДерева[Колонка];
			
		КонецЕсли;
		
	КонецЦикла;
		
	Если КоличествоВыбранныхСтрок <> 0 И КоличествоВыбранныхСтрок = КоличествоСтруктурныхЕдиниц Тогда
		Возврат 1;
	ИначеЕсли КоличествоВыбранныхСтрок > 0 Тогда
		Возврат 2;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Процедура, обработчик события "ПриИзменении".
//
Процедура УстановитьФлагиНаСтруктурныеЕдиницы(Форма, ТипПодбора = "ПодборСтруктурныеЕдиницы", НаименованиеКолонки = Неопределено) Экспорт
	
	Если ТипПодбора = "ПодборСтруктурныеЕдиницы" Тогда
		ТекущиеДанные = Форма.Элементы.ПодборСтруктурныеЕдиницы.ТекущиеДанные;
	ИначеЕсли ТипПодбора = "ПодборМестаРаботыСотрудника" Тогда
		ТекущиеДанные = Форма.Элементы.ПодборМестаРаботыСотрудника.ТекущиеДанные;
	ИначеЕсли ТипПодбора = "ПодборЖурналыПриемовСотрудника" Тогда
		ТекущиеДанные = Форма.Элементы.ПодборЖурналыПриемовСотрудника.ТекущиеДанные;
	Иначе
		ТекущиеДанные = Форма.Элементы.ПодборДоступныеКассы.ТекущиеДанные;
	КонецЕсли;
	
	Колонка = ?(ЗначениеЗаполнено(НаименованиеКолонки), НаименованиеКолонки, "Выгружать"); 
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные[Колонка] = ?(ТекущиеДанные[Колонка] = 2, 0, ТекущиеДанные[Колонка]);
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		
		Для Каждого СтрокаДерева Из ТекущиеДанные.ПолучитьЭлементы() Цикл
			СтрокаДерева[Колонка] = ТекущиеДанные[Колонка];
		КонецЦикла;
		
	Иначе
		
		ГруппаСтруктурныхЕдиниц = ТекущиеДанные.ПолучитьРодителя();
		
		Если ГруппаСтруктурныхЕдиниц <> Неопределено Тогда
			
			МассивВыбранныхСтруктурныхЕдиниц = Новый Массив;
			ДоступныеКассы = (ТипПодбора = "ПодборДоступныеКассы");
			ЗаполнитьМассивВыбранныхСтруктурныхЕдиниц(ГруппаСтруктурныхЕдиниц.ПолучитьЭлементы(), МассивВыбранныхСтруктурныхЕдиниц, ДоступныеКассы, НаименованиеКолонки);
			КоличествоСтруктурныхЕдиниц = ГруппаСтруктурныхЕдиниц.ПолучитьЭлементы().Количество();
			
			Если МассивВыбранныхСтруктурныхЕдиниц.Количество() = КоличествоСтруктурныхЕдиниц Тогда
				ГруппаСтруктурныхЕдиниц[Колонка] = 1;
			ИначеЕсли МассивВыбранныхСтруктурныхЕдиниц.Количество() > 0 Тогда
				ГруппаСтруктурныхЕдиниц[Колонка] = 2;
			Иначе
				ГруппаСтруктурныхЕдиниц[Колонка] = 0;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Рекурсивный метод обхода дерева и выбора структурных единиц, установленных в Истину
//
Функция ЗаполнитьМассивВыбранныхСтруктурныхЕдиниц(ДанныеДерева, МассивВыбранныхСтруктурныхЕдиниц, ДоступныеКассы = Ложь, НаименованиеКолонки = Неопределено) Экспорт
	
	Колонка = ?(ЗначениеЗаполнено(НаименованиеКолонки), НаименованиеКолонки, "Выгружать"); 
	
	Для Каждого УровеньДерева ИЗ ДанныеДерева Цикл
		
		ЗаполнитьМассивВыбранныхСтруктурныхЕдиниц(УровеньДерева.ПолучитьЭлементы(), МассивВыбранныхСтруктурныхЕдиниц, ДоступныеКассы, НаименованиеКолонки);
		
		Если НЕ УровеньДерева.ЭтоГруппа
			И УровеньДерева[Колонка] Тогда
			
			Если ДоступныеКассы = Ложь Тогда 
				МассивВыбранныхСтруктурныхЕдиниц.Добавить(УровеньДерева.СтруктурнаяЕдиница);
			Иначе
				МассивВыбранныхСтруктурныхЕдиниц.Добавить(УровеньДерева.Касса);
			КонецЕсли;
			ЕстьДобавленныеЕлементы = Истина;

		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

&НаСервере
// Процедура, выполянет создание дерева доступных касс.
//
Процедура СоздатьДеревоДоступныхКасс(Форма, ОбъектОграничения, МассивКасс, МассивДоступныхКасс, 
	СоответствиеИндексамКартинок, ЗаполнитьПервыйУровеньДерева = Ложь) Экспорт
	
	ЭлементДерево            = Форма.ПодборДоступныеКассы;
	ПервыйУровеньДерева 	 = ЭлементДерево.ПолучитьЭлементы();
	ПервоначальноеЗаполнение = ПервыйУровеньДерева.Количество() = 0;
	
	Если ПервоначальноеЗаполнение Тогда
				
		ЗаполнитьДеревоКасс(МассивКасс, ЭлементДерево, Форма, ЗаполнитьПервыйУровеньДерева, СоответствиеИндексамКартинок);
		МассивВыбранныхКасс = МассивДоступныхКасс;
		
	Иначе
		
		ДанныеДерева = ПервыйУровеньДерева[0].ПолучитьЭлементы();
		
		ДобавленыеСтруктурныеЕдиницы = Новый Массив;
		
		Для Каждого СтрокаДерева Из ДанныеДерева Цикл
			
			Если МассивКасс.Найти(СтрокаДерева.Касса) = Неопределено Тогда
				ДанныеДерева.Удалить(СтрокаДерева);
			Иначе
				МассивДоступныхКасс.Добавить(СтрокаДерева.Касса);
			КонецЕсли;
			
		КонецЦикла;
		
		Если СоответствиеИндексамКартинок <> Неопределено
			И ТипЗнч(СоответствиеИндексамКартинок) = Тип("Соответствие") Тогда
			
			Для Каждого Касса Из МассивКасс Цикл	
				Если МассивДоступныхКасс.Найти(Касса) = Неопределено Тогда
					НоваяСтрока             	   = ДанныеДерева.Вставить(0);
					НоваяСтрока.Касса       	   = Касса;
					
					Индекс 						   = СоответствиеИндексамКартинок.Получить(Касса);
					НоваяСтрока.ИндКартинки 	   = ?(Индекс = Неопределено, 1, Индекс);
				КонецЕсли;	
			КонецЦикла;
			
		Иначе
			
			Для Каждого Касса Из МассивКасс Цикл
				Если МассивДоступныхКасс.Найти(Касса) = Неопределено Тогда
					НоваяСтрока 				   = ДанныеДерева.Вставить(0);
					НоваяСтрока.Касса	 		   = Касса;
					НоваяСтрока.ИндКартинки 	   = 1;	
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		МассивВыбранныхКасс = Неопределено;
		
	КонецЕсли;
	КоличествоКасс = МассивКасс.Количество();
	УстановитьНачальноеСостояниеФлагов(ЭлементДерево.ПолучитьЭлементы(), МассивВыбранныхКасс, КоличествоКасс,, Истина);
	
КонецПроцедуры

// Процедура, заполняет дерево касс.
//
Процедура ЗаполнитьДеревоКасс(МассивКасс, ЭлементЗаполнения, Форма, ЗаполнитьПервыйУровеньДерева = Ложь, СоответствиеИндексамКартинок = Неопределено)
	
	Если МассивКасс.Количество() > 0 Или ЗаполнитьПервыйУровеньДерева = Истина Тогда
		
		НоваяСтрока              	    = ЭлементЗаполнения.ПолучитьЭлементы().Добавить();
		НоваяСтрока.Касса               = "Все кассы";
		НоваяСтрока.ЭтоГруппа		    = Истина;
		
		Если СоответствиеИндексамКартинок <> Неопределено 
			И ТипЗнч(СоответствиеИндексамКартинок) = Тип("Соответствие") Тогда
			
			Для Каждого Касса Из МассивКасс Цикл
				
				НоваяСтрокаГруппы             = НоваяСтрока.ПолучитьЭлементы().Добавить();
				НоваяСтрокаГруппы.Касса       = Касса;
				НоваяСтрокаГруппы.ЭтоГруппа   = Ложь;
				
				Индекс 						  = СоответствиеИндексамКартинок.Получить(Касса);
				НоваяСтрокаГруппы.ИндКартинки = ?(Индекс = Неопределено, 1, Индекс);
				
			КонецЦикла;
			
		Иначе
			
			Для Каждого Касса Из МассивКасс Цикл
				
				НоваяСтрокаГруппы             = НоваяСтрока.ПолучитьЭлементы().Добавить();
				НоваяСтрокаГруппы.Касса       = Касса;
				НоваяСтрокаГруппы.ЭтоГруппа   = Ложь;
				НоваяСтрокаГруппы.ИндКартинки = 1;
				
			КонецЦикла;
			
		КонецЕсли;
		
		
	//	
	//ИначеЕсли МассивКасс.Количество() = 1 Тогда
	//	
	//	НоваяСтрокаГруппы              	= ЭлементЗаполнения.ПолучитьЭлементы().Добавить();
	//	НоваяСтрокаГруппы.Касса         = МассивКасс[0];
	//	НоваяСтрокаГруппы.ЭтоГруппа     = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, рекурсивно устанавливает флаги в дереве.
//
Процедура РекурсивноУстановитьФлагиВДереве(Дерево, ИмяКолонкиЭлемента, ИмяКолонкиФлага, ТаблицаИзмененныхЗначений) Экспорт
	
	ТекущиеДанные = Дерево.ТекущиеДанные;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		
		Если ТекущиеДанные[ИмяКолонкиФлага] = 2 Тогда
			ТекущиеДанные[ИмяКолонкиФлага] = 0;
		КонецЕсли; 
		
		УстановитьФлагиНаЭлементы(ТекущиеДанные, ИмяКолонкиЭлемента, ИмяКолонкиФлага, ТаблицаИзмененныхЗначений);
		УстановитьФлагиНаГруппы(ТекущиеДанные, Истина, ИмяКолонкиЭлемента, ИмяКолонкиФлага);
		
	Иначе
		
		Если ТекущиеДанные[ИмяКолонкиФлага] = 2 Тогда
			ТекущиеДанные[ИмяКолонкиФлага] = 0;
		КонецЕсли;
		
		ИзменитьВыбранныеРесурсы(ТекущиеДанные, ТаблицаИзмененныхЗначений, ИмяКолонкиЭлемента);
		УстановитьФлагиНаГруппы(ТекущиеДанные,, ИмяКолонкиЭлемента, ИмяКолонкиФлага);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет установку флагов на элменеты.
//
Процедура УстановитьФлагиНаЭлементы(ТекущиеДанные, ИмяКолонкиЭлемента, ИмяКолонкиФлага, ТаблицаИзмененныхЗначений)
	
	ДанныеДерева = ТекущиеДанные.ПолучитьЭлементы();
	Для Каждого СтрокаДерева Из ДанныеДерева Цикл
		
		СтрокаДерева[ИмяКолонкиФлага] = ТекущиеДанные[ИмяКолонкиФлага];
		
		Если СтрокаДерева.ЭтоГруппа Тогда
			УстановитьФлагиНаЭлементы(СтрокаДерева, ИмяКолонкиЭлемента, ИмяКолонкиФлага, ТаблицаИзмененныхЗначений);
		Иначе
			ИзменитьВыбранныеРесурсы(СтрокаДерева, ТаблицаИзмененныхЗначений, ИмяКолонкиЭлемента);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура, устанавливает флаги на группы.
//
Процедура УстановитьФлагиНаГруппы(ТекущиеДанные, ЭтоРодитель = Ложь, ИмяКолонкиЭлемента, ИмяКолонкиФлага)
	
	Если ЭтоРодитель Тогда
		Родитель = ТекущиеДанные;
	Иначе
		Родитель = ТекущиеДанные.ПолучитьРодителя();
	КонецЕсли;
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДерева = Родитель.ПолучитьЭлементы();
	
	КоличествоВыбранных = 0;
	Для Каждого СтрокаДерева Из ДанныеДерева Цикл
		Если СтрокаДерева[ИмяКолонкиФлага] = 1 Тогда
			КоличествоВыбранных = КоличествоВыбранных + 1;
		ИначеЕсли СтрокаДерева[ИмяКолонкиФлага] = 2 Тогда
			КоличествоВыбранных = -1;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоВыбранных = ДанныеДерева.Количество() Тогда
		Родитель[ИмяКолонкиФлага] = 1;
	ИначеЕсли КоличествоВыбранных = 0 Тогда
		Родитель[ИмяКолонкиФлага] = 0;
	Иначе
		Родитель[ИмяКолонкиФлага] = 2;
	КонецЕсли;		
	
	УстановитьФлагиНаГруппы(Родитель,, ИмяКолонкиЭлемента, ИмяКолонкиФлага);
	
КонецПроцедуры

&НаКлиенте
// Процедура, изменяет таблицу выбранных ресурсов.
//
Процедура ИзменитьВыбранныеРесурсы(СтрокаДерева, ТаблицаИзмененныхЗначений, ИмяКолонкиЭлемента)
	
	МассивСтрок = ТаблицаИзмененныхЗначений.НайтиСтроки(Новый Структура(ИмяКолонкиЭлемента, СтрокаДерева[ИмяКолонкиЭлемента]));
	
	Если МассивСтрок.Количество() > 0 Тогда
		МассивСтрок[0][ИмяКолонкиЭлемента] = СтрокаДерева[ИмяКолонкиЭлемента];
	Иначе
		НоваяСтрока = ТаблицаИзмененныхЗначений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, устанавливает флаги на группы при первоночальном построение дерева.
//
Процедура УстановитьНачальныеФлагиНаГруппы(Родитель, ИмяКолонки) Экспорт
	
	ДанныеДерева = Родитель.ПолучитьЭлементы();
	
	КоличествоВыбранных = 0;
	Для Каждого СтрокаДерева из ДанныеДерева Цикл
		
		Если СтрокаДерева.ЭтоГруппа Тогда
			УстановитьНачальныеФлагиНаГруппы(СтрокаДерева, ИмяКолонки);			
		КонецЕсли;
		
		Если КоличествоВыбранных <> -1 Тогда
			Если СтрокаДерева[ИмяКолонки] = 1 Тогда
				КоличествоВыбранных = КоличествоВыбранных + 1;
			ИначеЕсли СтрокаДерева[ИмяКолонки] = 2 Тогда
				КоличествоВыбранных = -1;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если КоличествоВыбранных = ДанныеДерева.Количество() Тогда
		Родитель[ИмяКолонки] = 1;
	ИначеЕсли КоличествоВыбранных = 0 Тогда
		Родитель[ИмяКолонки] = 0;
	Иначе
		Родитель[ИмяКолонки] = 2;
	КонецЕсли;			
	
КонецПроцедуры

#КонецОбласти

#Область ПодборНоменклатурыДинамическимСписком

&НаСервере
// Процедура, создает динамический список подбора номенклатур.
//
Процедура СоздатьДинамическийСписокПодбораНоменклатур(
		Форма,
		Знач Объект,
		ИмяЭлементаДляРазмещения,
		Знач МассивТипов           		= NULL,
		ОтображатьКоличество       		= Ложь,
		ОтображатьЦену             		= Истина,
		ПодборНеСкрывается         		= Ложь,
		ОтображатьСнятыеСПродажи   		= Ложь,
		ОтображатьАртикул				= Ложь,
		ПолучитьХарактеристикиПолиса	= Ложь) Экспорт  
		
		
	Если ИмяЭлементаДляРазмещения = "ГруппаПодборУслуги" Тогда
		ИмяДинамическогоСписка = "_ПодборНоменклатурУслуги";
	Иначе
		ИмяДинамическогоСписка = "_ПодборНоменклатур";
	КонецЕсли;
	
	УстановитьПараметрыДинамическогоСписка(
		Форма, 
		Объект, 
		МассивТипов, 
		ОтображатьКоличество, 
		ОтображатьСнятыеСПродажи,
		ИмяЭлементаДляРазмещения,
		ПолучитьХарактеристикиПолиса);
			
	Если ИмяЭлементаДляРазмещения = "ГруппаПодборУслуги" Тогда
		РеквизитФормы = Форма._ПодборНоменклатурУслуги;
	Иначе
		РеквизитФормы = Форма._ПодборНоменклатур;
	КонецЕсли;
		
	РеквизитФормы.ОсновнаяТаблица = "Справочник.Номенклатура";
	
	РеквизитФормы.УстановитьОбязательноеИспользование("Артикул"                          , Истина);
	РеквизитФормы.УстановитьОбязательноеИспользование("Родитель"                         , Истина);
	РеквизитФормы.УстановитьОбязательноеИспользование("ЕдиницаИзмерения"                 , Истина);
	РеквизитФормы.УстановитьОбязательноеИспользование("НормаВремени"                     , Истина);
	РеквизитФормы.УстановитьОбязательноеИспользование("Упаковка"                         , Истина);
	РеквизитФормы.УстановитьОбязательноеИспользование("ВидЦен"                           , Истина);
	РеквизитФормы.УстановитьОбязательноеИспользование("ИспользоватьПартии"               , Истина);
	РеквизитФормы.УстановитьОбязательноеИспользование("ЭтоСертификат"                    , Истина);
	РеквизитФормы.УстановитьОбязательноеИспользование("ВПродаже"                         , Истина); 	
	РеквизитФормы.УстановитьОбязательноеИспользование("Бесплатно"                        , Истина);  
	РеквизитФормы.УстановитьОбязательноеИспользование("ЭтоГруппа"                        , Истина); 
	РеквизитФормы.УстановитьОбязательноеИспользование("СкидкиЗапрещены"                  , Истина);
	
	// Если ПолучитьХарактеристикиПолиса Тогда
		РеквизитФормы.УстановитьОбязательноеИспользование("ПолисСогласование"             , Истина);
		РеквизитФормы.УстановитьОбязательноеИспользование("ПолисКоличество"				  , Истина);
		РеквизитФормы.УстановитьОбязательноеИспользование("ПолисКоличествоПриПревышении"  , Истина);
		РеквизитФормы.УстановитьОбязательноеИспользование("ПолисНеограничено"  			  , Истина);
		РеквизитФормы.УстановитьОбязательноеИспользование("КоличествоЗубов"  			  , Истина);
		РеквизитФормы.УстановитьОбязательноеИспользование("КоличествоВПриеме"  			  , Истина);
		РеквизитФормы.УстановитьОбязательноеИспользование("НаименованиеОграничения" 	  , Истина);

	// КонецЕсли;

	МассивПолей = Новый Массив;
	МассивПолей.Добавить("Номенклатура");
	
	РеквизитФормы.УстановитьОграниченияИспользованияВПорядке(МассивПолей);
	РеквизитФормы.ПолучениеПредставленийДляНевидимыхПолей = Истина;	
		
	Форма.Элементы[ИмяЭлементаДляРазмещения].ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	
	Если Не ПодборНеСкрывается
		И Не Объект.Ссылка.Пустая() Тогда
		
		Форма.Элементы[ИмяЭлементаДляРазмещения].Видимость = Ложь;
		
		Если ИмяЭлементаДляРазмещения = "ГруппаПодборУслуги" Тогда
			Если Не Форма.Элементы.Найти("УслугиСкрытьПодбор") = Неопределено Тогда				
				Форма.Элементы["УслугиСкрытьПодбор"].Пометка = Форма.Элементы[ИмяЭлементаДляРазмещения].Видимость;
			КонецЕсли;
		Иначе
			Если Не Форма.Элементы.Найти("ЗапасыСкрытьПодбор") = Неопределено Тогда				
				Форма.Элементы["ЗапасыСкрытьПодбор"].Пометка = Форма.Элементы[ИмяЭлементаДляРазмещения].Видимость;
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	
	Если ИмяЭлементаДляРазмещения = "ГруппаПодборУслуги" Тогда
		НаименованиеПодбора = "_ПодборНоменклатурУслуги";
	Иначе
		НаименованиеПодбора = "_ПодборНоменклатур";
	КонецЕсли;
	
	ДинамическийСписок = Форма.Элементы.Найти(ИмяДинамическогоСписка);
			
	Если ДинамическийСписок = Неопределено Тогда	
		ДинамическийСписок  = Форма.Элементы.Добавить(ИмяДинамическогоСписка, Тип("ТаблицаФормы"), Форма.Элементы[ИмяЭлементаДляРазмещения]);
		ДинамическийСписок.ПутьКДанным    			   = ИмяДинамическогоСписка;
	КонецЕсли;
	
	ДинамическийСписок.Видимость      			   = Истина;	
	ДинамическийСписок.ТолькоПросмотр 			   = Ложь;
	ДинамическийСписок.КартинкаСтрок  			   = БиблиотекаКартинок.ТерминалПодбор_Новый; // ТерминалПодбор
	ДинамическийСписок.ПутьКДаннымКартинкиСтроки   = НаименованиеПодбора + ".ИндКартинки";
	ДинамическийСписок.ПоложениеКоманднойПанели    = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	ДинамическийСписок.ИзменятьСоставСтрок         = Ложь;
	ДинамическийСписок.ПоложениеСтрокиПоиска       = ПоложениеСтрокиПоиска.Верх;
	ДинамическийСписок.ПоложениеСостоянияПросмотра = ПоложениеСостоянияПросмотра.Нет;
	ДинамическийСписок.ИзменятьПорядокСтрок        = Ложь;
	ДинамическийСписок.Шапка                       = Ложь;
	ДинамическийСписок.РежимВыделения              = РежимВыделенияТаблицы.Одиночный;
	ДинамическийСписок.ПоложениеУправленияПоиском  = ПоложениеУправленияПоиском.Нет;
	ДинамическийСписок.РастягиватьПоГоризонтали    = Ложь;
	ДинамическийСписок.ВертикальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.НеИспользовать;
	ДинамическийСписок.НачальноеОтображениеДерева  = НачальноеОтображениеДерева.РаскрыватьВерхнийУровень;
	ДинамическийСписок.УстановитьДействие("Выбор"  , ?(ИмяЭлементаДляРазмещения = "ГруппаПодборУслуги", "Подключаемый_ПодборУслугиВыбор", "Подключаемый_ПодборТоварыВыбор"));
		
	НовыйЭлемент = Форма.Элементы.Добавить(НаименованиеПодбора + "Подбор_Номенклатура", Тип("ПолеФормы"), ДинамическийСписок);
	НовыйЭлемент.Вид                    = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Ширина                 = 25;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.МаксимальнаяШирина 	= 30;
	НовыйЭлемент.ПутьКДанным 			= НаименованиеПодбора + ".Номенклатура";
	
	// Если ОтображатьАртикул Тогда // ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.Прием") 
		
	НовыйЭлемент = Форма.Элементы.Добавить(НаименованиеПодбора + "Артикул", Тип("ПолеФормы"), ДинамическийСписок);
	НовыйЭлемент.Вид		 			  = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 			  = НаименованиеПодбора + ".Артикул";
	НовыйЭлемент.АвтоМаксимальнаяШирина   = Ложь;
	НовыйЭлемент.Ширина 	 			  = 3;
	НовыйЭлемент.Заголовок   			  = НСтр("ru = 'Артикул'; en = 'Vendor code'");
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.Видимость = ОтображатьАртикул;
	
	ДинамическийСписок.РастягиватьПоГоризонтали    = Истина;
	ДинамическийСписок.АвтоМаксимальнаяШирина   = Истина;
	// ДинамическийСписок.МаксимальнаяШирина = 40;  // Ширина = 40;

	// КонецЕсли;

	// Если ОтображатьЦену Тогда
	НовыйЭлемент = Форма.Элементы.Добавить(НаименованиеПодбора + "Цена", Тип("ПолеФормы"), ДинамическийСписок);
	НовыйЭлемент.Вид		 			  = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 			  = НаименованиеПодбора + ".Цена";
	НовыйЭлемент.Формат 	 			  = "ЧДЦ=2; ЧН=0,00";  
	Если Объект <> Неопределено Тогда
		Ширина = ?(ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.Прием"), ?(ОтображатьКоличество, 4, 6), 7);
	Иначе 
		Ширина = 7;
	КонецЕсли;
	НовыйЭлемент.Ширина 	 			  = Ширина;
	НовыйЭлемент.АвтоМаксимальнаяШирина   = Ложь;
	НовыйЭлемент.МаксимальнаяШирина 	  = 12;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.Видимость = ОтображатьЦену;
	// КонецЕсли;
	
	// Если ОтображатьКоличество Тогда
	НовыйЭлемент = Форма.Элементы.Добавить(НаименованиеПодбора + "Количество", Тип("ПолеФормы"), ДинамическийСписок);
	НовыйЭлемент.Вид		 			  = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 			  = НаименованиеПодбора + ".Количество";
	НовыйЭлемент.АвтоМаксимальнаяШирина   = Ложь;
	НовыйЭлемент.Ширина 	 			  = 4;
	НовыйЭлемент.Заголовок   			  = НСтр("ru = 'Остаток'; en = 'Balance'");
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь; 
	НовыйЭлемент.Видимость = ОтображатьКоличество;
	// КонецЕсли;
	
		
КонецПроцедуры

&НаСервере
// Процедура, устанавливает параметры динамического списка.
//
Процедура УстановитьПараметрыДинамическогоСписка(
		Форма,
		Объект,
		МассивТипов,
		ОтображатьКоличество,
		ОтображатьСнятыеСПродажи = Истина,
		ИмяЭлементаДляРазмещения = "ГруппаПодборУслуги",
		ПолучитьХарактеристикиПолиса = Ложь)
		
	Если Объект <> Неопределено Тогда	
		
		ВидЦен  		   = ?(Объект.Ссылка.Метаданные().Реквизиты.Найти("ВидЦен")  			= Неопределено, Справочники.ВидыЦен.Розничная, Объект.ВидЦен);	
		СтруктурнаяЕдиница = ?(Объект.Ссылка.Метаданные().Реквизиты.Найти("СтруктурнаяЕдиница") = Неопределено, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница, Объект.СтруктурнаяЕдиница);
		Дата               = ТекущаяДатаСеанса();
		Для Каждого СтРеквизит Из Объект.Ссылка.Метаданные().СтандартныеРеквизиты Цикл
			Если СтРеквизит.Имя = "Дата" И ЗначениеЗаполнено(Объект.Дата) И НЕ Объект.Ссылка.Пустая() Тогда
				Дата = Объект.Дата;
			КонецЕсли;
		КонецЦикла;	
		Склад              = ?(Объект.Ссылка.Метаданные().Реквизиты.Найти("Склад") = Неопределено, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.ОсновнойСклад, Объект.Склад);
		
		СегментСотрудника  = Форма._ПодборСегментНоменклатуры;
		ОтброПоСегментам   = ЗначениеЗаполнено(СегментСотрудника); 
		
		ОтборДоговорПоПолисуМассив = Новый Массив;
		ОтборДоговорПоМедПолису    = Новый Массив;
		ВывестиДанныеПоДоговоруПолиса = Ложь;
		
	Иначе 
		
		МассивРеквизитовФормы = Форма.ПолучитьРеквизиты();
		МассивРеквизитов = Новый Массив;
		Для Каждого СтрокаМ Из МассивРеквизитовФормы Цикл
			МассивРеквизитов.Добавить(СтрокаМ.Имя);
		КонецЦикла;	
		
		СтруктурнаяЕдиница = ?(МассивРеквизитов.Найти("СтруктурнаяЕдиница") = Неопределено, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница, Форма.СтруктурнаяЕдиница);
		ВидЦен  		   = ?(МассивРеквизитов.Найти("ВидЦен")  			= Неопределено, ?(ЗначениеЗаполнено(СтруктурнаяЕдиница.ВидЦенРеализации), СтруктурнаяЕдиница.ВидЦенРеализации, Справочники.ВидыЦен.Розничная),?(ЗначениеЗаполнено(Форма.ВидЦенМатериалов), Форма.ВидЦенМатериалов, Неопределено)); 
		Дата               = ?(МассивРеквизитов.Найти("Дата") 			    = Неопределено, ТекущаяДатаСеанса(), Форма.Дата);
		Склад              = ?(МассивРеквизитов.Найти("Склад") 			    = Неопределено, ?(ЗначениеЗаполнено(СтруктурнаяЕдиница.ОсновнойСклад),СтруктурнаяЕдиница.ОсновнойСклад, Неопределено), Форма.Склад);
		
		// параметры формы выбора номенклатуры
		Сотрудник         = ?(МассивРеквизитов.Найти("Сотрудник")   = Неопределено, Неопределено, Форма.Сотрудник);
		СегментСотрудника = ?(МассивРеквизитов.Найти("ОтборСегмент")= Неопределено, Неопределено, Форма.ОтборСегмент);
		ОтброПоСегментам  = ЗначениеЗаполнено(СегментСотрудника);
		
		ОтборДоговорПоПолисуМассив    = Новый Массив;
		ОтборДоговорПоМедПолису       = Новый Массив;
		ВывестиДанныеПоДоговоруПолиса = Ложь;
		
	КонецЕсли;

	Если Форма.ИмяФормы = "Документ.Прием.Форма.ФормаДокумента" 
		ИЛИ Форма.ИмяФормы = "Документ.ПланЛечения.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.НарядЗаказ.Форма.ФормаДокумента" Тогда
		
		ДоговорПоПолису = Форма._ПодборДоговорПолиса;	
		ВывестиДанныеПоДоговоруПолиса = ЗначениеЗаполнено(ДоговорПоПолису);
		ПолисМедСтрахования = Объект.ПолисМедСтрахования;
		ВывестиДанныеПоПолису = ЗначениеЗаполнено(Объект.ПолисМедСтрахования);
		
		Если ПолучитьХарактеристикиПолиса И ВывестиДанныеПоДоговоруПолиса Тогда
			
			ОтборДоговорПоПолисуМассив.Добавить(ДоговорПоПолису);
			Если ЗначениеЗаполнено(ДоговорПоПолису.ВидЦен)
				И ИмяЭлементаДляРазмещения = "ГруппаПодборУслуги" Тогда
				ВидЦен = ДоговорПоПолису.ВидЦен	
			КонецЕсли;
			
		Иначе
			ОтборДоговорПоПолисуМассив.Добавить("Отсутствует");	
		КонецЕсли;
		
		Если ПолучитьХарактеристикиПолиса И ВывестиДанныеПоПолису Тогда
			ОтборДоговорПоМедПолису.Добавить("Отсутствует");		
		Иначе
			ОтборДоговорПоМедПолису.Добавить(ПолисМедСтрахования);	
		КонецЕсли;		
		
	Иначе
		ОтборДоговорПоПолисуМассив.Добавить("Отсутствует");	
		ОтборДоговорПоМедПолису.Добавить("Отсутствует");
	КонецЕсли;

	ОтборМассивТипов   = ЗначениеЗаполнено(МассивТипов);
	
	Если ИмяЭлементаДляРазмещения = "ГруппаПодборУслуги" Тогда
		РеквизитФормы = Форма._ПодборНоменклатурУслуги;
	Иначе
		РеквизитФормы = Форма._ПодборНоменклатур;  		
		СброситьТекущуюСтрокуВПодборе(МассивТипов, Форма); // Сбрасываем текущую строку для условного оформления на видимость групп.	
	КонецЕсли;
	
	ЭтоПрием = (Форма.ИмяФормы = "Документ.Прием.Форма.ФормаДокумента") И ИмяЭлементаДляРазмещения = "ГруппаПодборУслуги";
	
	Если Объект <> Неопределено Тогда
		Сотрудник = ?(Объект.Свойство("Сотрудник"), Объект.Сотрудник, Неопределено);
	КонецЕсли;
	
	РеквизитФормы.ТекстЗапроса = ПолучитьТекстЗапросаПодбора(
		ОтброПоСегментам, 
		ОтборМассивТипов,
		Сотрудник,
		?(ПолучитьХарактеристикиПолиса, ВывестиДанныеПоДоговоруПолиса, Ложь),
		ЭтоПрием);  
		
	РеквизитФормы.Параметры.УстановитьЗначениеПараметра("ОтображатьСнятыеСПродажи", ОтображатьСнятыеСПродажи);
	РеквизитФормы.Параметры.УстановитьЗначениеПараметра("ОтображатьКоличество"    , ОтображатьКоличество);
	РеквизитФормы.Параметры.УстановитьЗначениеПараметра("ОтборСтруктурнаяЕдиница" , СтруктурнаяЕдиница);
	РеквизитФормы.Параметры.УстановитьЗначениеПараметра("ОтборВидЦен"             , ВидЦен);    
	РеквизитФормы.Параметры.УстановитьЗначениеПараметра("ОтборНаДату"             , Дата);
	РеквизитФормы.Параметры.УстановитьЗначениеПараметра("ОтборСклад"              , Склад); 
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		РеквизитФормы.Параметры.УстановитьЗначениеПараметра("Сотрудник" , Сотрудник);
	КонецЕсли;

	Если ОтброПоСегментам Тогда
		РеквизитФормы.Параметры.УстановитьЗначениеПараметра("СегментСотрудника"   , СегментСотрудника);	
	КонецЕсли;
	
	РеквизитФормы.Параметры.УстановитьЗначениеПараметра("СсылкаДоговорПоПолису"   , ДоговорПоПолису);
	
	Если ОтборМассивТипов Тогда
		РеквизитФормы.Параметры.УстановитьЗначениеПараметра("ОтборМассивТипов"    , МассивТипов);
	КонецЕсли;
	
	СписокНеиспользуемыхГрупп = Справочники.Номенклатура.ПолучитьНеиспользуемыеГруппы(
		СтруктурнаяЕдиница,
		Дата,
		МассивТипов,
		СегментСотрудника,
		Сотрудник,
		?((ПолучитьХарактеристикиПолиса И ВывестиДанныеПоДоговоруПолиса), ДоговорПоПолису, Неопределено));
		
	УстановитьУсловноеОформлениеСписка(РеквизитФормы, СписокНеиспользуемыхГрупп, (ПолучитьХарактеристикиПолиса И ВывестиДанныеПоДоговоруПолиса));	
	
КонецПроцедуры

&НаСервере
// Процедура, сбрасывает текущую строку, на доступную группу.
// Это нужно что бы свернуть группы, перед условным оформлением на видимость, иначе пустой подбор.
//
Процедура СброситьТекущуюСтрокуВПодборе(Знач МассивТипов, Знач Форма)

	Если Форма.Элементы.Найти("_ПодборНоменклатур") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивТипов) Тогда 
		ВыбранныйТип = Перечисления.ТипыНоменклатуры.Запас;
		Для каждого ТипНоменклатуры Из МассивТипов Цикл
			
			Если ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
				ВыбранныйТип = ТипНоменклатуры;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК ГруппаНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ИСТИНА
		|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
		|	И Номенклатура.ТипНоменклатуры = &ТипНоменклатуры";
		Запрос.УстановитьПараметр("ТипНоменклатуры", ВыбранныйТип);
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаЗапроса.Следующий() Тогда
			Форма.Элементы._ПодборНоменклатур.ТекущаяСтрока =  ВыборкаЗапроса.ГруппаНоменклатуры;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Функция, получает реквизит формы. Если реквизит не существует, то будет возвращено Неопределено. Ошибки возникать не будет.
//
Функция ПолучитьРеквизитФормы(Форма, НаименованиеРеквизита)
	
	СтруктураПоиска = Новый Структура(НаименованиеРеквизита, Неопределено);
	
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, Форма);
	
	Возврат СтруктураПоиска[НаименованиеРеквизита];
	
КонецФункции

&НаСервере
// Функция, возвращает текст запроса.
//
Функция ПолучитьМассивОтбираемыхНоменклатур(Клиент, ОтброПоСегментам, Дата, СтруктурнаяЕдиница, СегментОрганизации, СегментСотрудника)
	
	Если Не ОтброПоСегментам Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатусыНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	СтатусыНоменклатурыСрезПоследних.ВПродаже КАК ВПродаже
		|ПОМЕСТИТЬ СтатусыНоменклатуры
		|ИЗ
		|	РегистрСведений.СтатусыНоменклатуры.СрезПоследних(&Дата, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК СтатусыНоменклатурыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СписокНоменклатуры.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК СписокНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтатусыНоменклатуры КАК СтатусыНоменклатуры
		|		ПО СписокНоменклатуры.Ссылка = СтатусыНоменклатуры.Номенклатура
		|ГДЕ
		|	НЕ СписокНоменклатуры.ПометкаУдаления
		|	И ЕСТЬNULL(СтатусыНоменклатуры.ВПродаже, ИСТИНА)");
		
	Иначе
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатусыНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	СтатусыНоменклатурыСрезПоследних.ВПродаже КАК ВПродаже
		|ПОМЕСТИТЬ СтатусыНоменклатуры
		|ИЗ
		|	РегистрСведений.СтатусыНоменклатуры.СрезПоследних(&Дата, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК СтатусыНоменклатурыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СегментОрганизации.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ТаблицаНоменклатуры
		|ИЗ
		|	РегистрСведений.НоменклатураСегмента КАК СегментОрганизации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК СегментСотрудника
		|		ПО СегментОрганизации.Номенклатура = СегментСотрудника.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтатусыНоменклатуры КАК СтатусыНоменклатуры
		|		ПО СегментОрганизации.Номенклатура = СтатусыНоменклатуры.Номенклатура
		|ГДЕ
		|	НЕ СегментОрганизации.Номенклатура.ПометкаУдаления
		|	И СегментОрганизации.Сегмент = &СегментОрганизации
		|	И СегментСотрудника.Сегмент = &СегментСотрудника
		|	И ЕСТЬNULL(СтатусыНоменклатуры.ВПродаже, ИСТИНА)");
		
		Запрос.УстановитьПараметр("СегментОрганизации", СегментОрганизации);
		Запрос.УстановитьПараметр("СегментСотрудника" , СегментСотрудника);
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата"              , Дата);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("КонтрагентСегмента", ?(ЗначениеЗаполнено(Клиент), Клиент, Неопределено));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
КонецФункции

&НаСервере
// Функция, возвращает текст запроса динамического списка.
//
Функция ПолучитьТекстЗапросаПодбора_Old(ОтброПоСегментам, ОтборМассивТипов, Сотрудник = Неопределено, ВывестиДанныеПоДоговоруПолиса = Ложь)
	
	ЗапросТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.ВидЦен КАК ВидЦен,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	МИНИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена
	|ПОМЕСТИТЬ ЦеныНоменклатуры
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ОтборНаДату,
	|			Актуальность = ИСТИНА
	|				И СтруктурнаяЕдиница = &ОтборСтруктурнаяЕдиница
	|				И Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				И ВЫБОР
	|					КОГДА &ОтборВидЦен <> НЕОПРЕДЕЛЕНО
	|						ТОГДА ВидЦен = &ОтборВидЦен
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И НЕ Номенклатура.Бесплатно) КАК ЦеныНоменклатурыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.ВидЦен,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	СтатусыНоменклатурыСрезПоследних.ВПродаже КАК ВПродаже
	|ПОМЕСТИТЬ СтатусыНоменклатуры
	|ИЗ
	|	РегистрСведений.СтатусыНоменклатуры.СрезПоследних(&ОтборНаДату, СтруктурнаяЕдиница = &ОтборСтруктурнаяЕдиница) КАК СтатусыНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапросЛечение.Номенклатура КАК ЛечениеНоменклатура,
	|	СУММА(ВложенныйЗапросЛечение.Количество) КАК ЛечениеКоличество
	|ПОМЕСТИТЬ ВТОказаноПоПолису
	|ИЗ
	|	Документ.Прием КАК Прием
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ПриемЛечение.Количество) КАК Количество,
	|			ПриемЛечение.Номенклатура КАК Номенклатура,
	|			ПриемЛечение.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.Прием.Лечение КАК ПриемЛечение
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПриемЛечение.Номенклатура,
	|			ПриемЛечение.Ссылка) КАК ВложенныйЗапросЛечение
	|		ПО Прием.Ссылка = ВложенныйЗапросЛечение.Ссылка
	|ГДЕ
	|	Прием.ПолисМедСтрахования В(&ПолисМедСтрахования)
	|	И НЕ ""Отсутствует"" В (&ПолисМедСтрахования)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапросЛечение.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоговорыКонтрагентовУслугиПоДоговору.Номенклатура КАК Номенклатура,
	|	ДоговорыКонтрагентовУслугиПоДоговору.Согласование КАК Согласование,
	|	ДоговорыКонтрагентовУслугиПоДоговору.Количество КАК Количество,
	|	ДоговорыКонтрагентовУслугиПоДоговору.КоличествоПриПревышении КАК КоличествоПриПревышении,
	|	ЕСТЬNULL(ДоговорыКонтрагентовОграничениеЗубов.КоличествоЗубов, 0) КАК КоличествоЗубов,
	|	ЕСТЬNULL(ДоговорыКонтрагентовОграничениеЗубов.КоличествоВПриеме, 0) КАК КоличествоВПриеме,
	|	ЕСТЬNULL(ДоговорыКонтрагентовОграничениеЗубов.НаименованиеОграничения, """") КАК НаименованиеОграничения
	|ПОМЕСТИТЬ ВТУслугиПоДоговору
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.УслугиПоДоговору КАК ДоговорыКонтрагентовУслугиПоДоговору
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ОграничениеЗубов КАК ДоговорыКонтрагентовОграничениеЗубов
	|		ПО ДоговорыКонтрагентовУслугиПоДоговору.Ссылка = ДоговорыКонтрагентовОграничениеЗубов.Ссылка
	|			И ДоговорыКонтрагентовУслугиПоДоговору.КлючСтроки = ДоговорыКонтрагентовОграничениеЗубов.КлючСтроки
	|ГДЕ
	|	ДоговорыКонтрагентовУслугиПоДоговору.Ссылка В(&СсылкаДоговорПоПолису)
	|	И НЕ ""Отсутствует"" В (&СсылкаДоговорПоПолису)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписокНоменклатуры.Артикул КАК Артикул,
	|	СписокНоменклатуры.Ссылка КАК Номенклатура,
	|	СписокНоменклатуры.Родитель КАК Родитель,
	|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА СписокНоменклатуры.ЭтоГруппа = ИСТИНА
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндКартинки,
	|	СписокНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СписокНоменклатуры.НормаВремени КАК НормаВремени,
	|	СписокНоменклатуры.УпаковкаПоУмолчанию КАК Упаковка,
	|	ЦеныНоменклатуры.ВидЦен КАК ВидЦен,
	|	СписокНоменклатуры.ИспользоватьПартии КАК ИспользоватьПартии,
	|	ВЫБОР
	|		КОГДА СписокНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоСертификат,
	|	СписокНоменклатуры.Наименование КАК Наименование,
	|	ЕСТЬNULL(СтатусыНоменклатуры.ВПродаже, ИСТИНА) КАК ВПродаже,
	|	ВТУслугиПоДоговору.Согласование КАК ПолисСогласование,
	|	ВТУслугиПоДоговору.Количество КАК ПолисКоличество,
	|	ВТУслугиПоДоговору.КоличествоПриПревышении КАК ПолисКоличествоПриПревышении,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТУслугиПоДоговору.Количество, НЕОПРЕДЕЛЕНО) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПолисНеограничено,
	|	ВТУслугиПоДоговору.КоличествоЗубов КАК КоличествоЗубов,
	|	ВТУслугиПоДоговору.КоличествоВПриеме КАК КоличествоВПриеме,
	|	ВТУслугиПоДоговору.НаименованиеОграничения КАК НаименованиеОграничения,
	|	СписокНоменклатуры.Бесплатно КАК Бесплатно,
	|	СписокНоменклатуры.ЭтоГруппа КАК ЭтоГруппа,
	|	СписокНоменклатуры.СкидкиЗапрещены КАК СкидкиЗапрещены
	|ИЗ
	|	Справочник.Номенклатура КАК СписокНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО СписокНоменклатуры.Ссылка = ЦеныНоменклатуры.Номенклатура
	|			И (&ОтборВидЦен = ЦеныНоменклатуры.ВидЦен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтатусыНоменклатуры КАК СтатусыНоменклатуры
	|		ПО СписокНоменклатуры.Ссылка = СтатусыНоменклатуры.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|				&ОтборНаДату,
	|				СтруктурнаяЕдиница = &ОтборСтруктурнаяЕдиница
	|					И ВЫБОР
	|						КОГДА НЕ &ОтборСклад = НЕОПРЕДЕЛЕНО
	|							ТОГДА Склад = &ОтборСклад
	|					КОНЕЦ
	|					И &ОтображатьКоличество) КАК ЗапасыОстатки
	|		ПО СписокНоменклатуры.Ссылка = ЗапасыОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОказаноПоПолису КАК ВТОказаноПоПолису
	|		ПО СписокНоменклатуры.Ссылка = ВТОказаноПоПолису.ЛечениеНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУслугиПоДоговору КАК ВТУслугиПоДоговору
	|		ПО СписокНоменклатуры.Ссылка = ВТУслугиПоДоговору.Номенклатура
	|ГДЕ
	|	НЕ СписокНоменклатуры.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &ОтображатьСнятыеСПродажи = ИСТИНА
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЕСТЬNULL(СтатусыНоменклатуры.ВПродаже, ИСТИНА)
	|		КОНЕЦ
	|	И &УсловиеСегментов
	|	И &УсловиеТипы
	|	И &УсловиеУслугиСотрудника
	|	И &УсловиеУслугиПоДоговору";
	
	// БЛОК - Условие сегментов
	
	УсловиеСегментов = 
	"И СписокНоменклатуры.Ссылка В
	|	(ВЫБРАТЬ
	|		НоменклатураСегмента.Номенклатура КАК Номенклатура
	|	ИЗ
	|		РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|	ГДЕ
	|		НоменклатураСегмента.Сегмент = &СегментСотрудника)";	
	
	ЗапросТекст = СтрЗаменить(ЗапросТекст, "И &УсловиеСегментов", ?(ОтброПоСегментам, УсловиеСегментов, ""));
	
	// БЛОК - Настройки подбора по полису
		
	УсловиеУслугиПоДоговору = 
	"И СписокНоменклатуры.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТУслугиПоДоговору.Номенклатура КАК Номенклатура
	|			ИЗ
	|				ВТУслугиПоДоговору КАК ВТУслугиПоДоговору)";
	ЗапросТекст = СтрЗаменить(ЗапросТекст, "И &УсловиеУслугиПоДоговору", ?(ВывестиДанныеПоДоговоруПолиса, УсловиеУслугиПоДоговору, ""));
	
	// БЛОК - Услуги сотрудника
	
	УсловиеУслугиСотрудника = "";
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		УсловиеУслугиСотрудника =  
		"И (СписокНоменклатуры.ТипНоменклатуры = Значение(Перечисление.ТипыНоменклатуры.Набор) Или СписокНоменклатуры.Ссылка В
		|(ВЫБРАТЬ
		|	УслугиСотрудника.Номенклатура
		|ИЗ
		|	РегистрСведений.УслугиСотрудника КАК УслугиСотрудника
		|ГДЕ
		|	УслугиСотрудника.Сотрудник = &Сотрудник
		|	И УслугиСотрудника.СтруктурнаяЕдиница = &ОтборСтруктурнаяЕдиница
		|	И НЕ УслугиСотрудника.Номенклатура.ПометкаУдаления))";

	КонецЕсли;

	ЗапросТекст = СтрЗаменить(ЗапросТекст, "И &УсловиеУслугиСотрудника", УсловиеУслугиСотрудника);

	УсловиеТипы 	 			 = ?(ОтборМассивТипов, "И СписокНоменклатуры.ТипНоменклатуры В (&ОтборМассивТипов)", "");
	ЗапросТекст 	 			 = СтрЗаменить(ЗапросТекст, "И &УсловиеТипы", УсловиеТипы);
		
	Возврат ЗапросТекст;
	
	
КонецФункции

&НаСервере
// Функция, возвращает текст запроса динамического списка.
//
Функция ПолучитьТекстЗапросаПодбора(ОтброПоСегментам, ОтборМассивТипов, Сотрудник = Неопределено, ВывестиДанныеПоДоговоруПолиса = Ложь, ЭтоПрием = Ложь)
	
	ЗапросТекст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоговорыКонтрагентовУслугиПоДоговору.Номенклатура КАК Номенклатура,
	|	ДоговорыКонтрагентовУслугиПоДоговору.Согласование КАК Согласование,
	|	ДоговорыКонтрагентовУслугиПоДоговору.Количество КАК Количество,
	|	ДоговорыКонтрагентовУслугиПоДоговору.КоличествоПриПревышении КАК КоличествоПриПревышении,
	|	ЕСТЬNULL(ДоговорыКонтрагентовОграничениеЗубов.КоличествоЗубов, 0) КАК КоличествоЗубов,
	|	ЕСТЬNULL(ДоговорыКонтрагентовОграничениеЗубов.КоличествоВПриеме, 0) КАК КоличествоВПриеме,
	|	ЕСТЬNULL(ДоговорыКонтрагентовОграничениеЗубов.НаименованиеОграничения, """") КАК НаименованиеОграничения
	|ПОМЕСТИТЬ ВТУслугиПоДоговору
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.УслугиПоДоговору КАК ДоговорыКонтрагентовУслугиПоДоговору
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ОграничениеЗубов КАК ДоговорыКонтрагентовОграничениеЗубов
	|		ПО ДоговорыКонтрагентовУслугиПоДоговору.Ссылка = ДоговорыКонтрагентовОграничениеЗубов.Ссылка
	|			И ДоговорыКонтрагентовУслугиПоДоговору.КлючСтроки = ДоговорыКонтрагентовОграничениеЗубов.КлючСтроки
	|ГДЕ
	|	ДоговорыКонтрагентовУслугиПоДоговору.Ссылка В(&СсылкаДоговорПоПолису)
	|	И НЕ ""Отсутствует"" В (&СсылкаДоговорПоПолису)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТНоменклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ПометкаУдаления = ЛОЖЬ
	|	И &УсловиеТипы
	|	И &УсловиеУслугиПоДоговору
	|	И &УсловиеУслугиСотрудника
	|	И &УсловиеСегментов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыНоменклатурыСрезПоследних.ВПродаже КАК ВПродаже,
	|	ВТНоменклатура.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ СтатусыНоменклатуры
	|ИЗ
	|	ВТНоменклатура КАК ВТНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыНоменклатуры.СрезПоследних(
	|				&ОтборНаДату,
	|				СтруктурнаяЕдиница = &ОтборСтруктурнаяЕдиница
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ВТНоменклатура.Ссылка КАК Ссылка
	|						ИЗ
	|							ВТНоменклатура КАК ВТНоменклатура)) КАК СтатусыНоменклатурыСрезПоследних
	|		ПО ВТНоменклатура.Ссылка = СтатусыНоменклатурыСрезПоследних.Номенклатура
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтображатьСнятыеСПродажи = ИСТИНА
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЕСТЬNULL(СтатусыНоменклатурыСрезПоследних.ВПродаже, ИСТИНА)
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.ВидЦен КАК ВидЦен,
	|	МИНИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
	|	СтатусыНоменклатуры.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ЦеныНоменклатуры
	|ИЗ
	|	СтатусыНоменклатуры КАК СтатусыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&ОтборНаДату,
	|				Актуальность = ИСТИНА
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							СтатусыНоменклатуры.Номенклатура КАК Номенклатура
	|						ИЗ
	|							СтатусыНоменклатуры)
	|					И СтруктурнаяЕдиница = &ОтборСтруктурнаяЕдиница
	|					И Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|					И ВЫБОР
	|						КОГДА &ОтборВидЦен <> НЕОПРЕДЕЛЕНО
	|							ТОГДА ВидЦен = &ОтборВидЦен
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И НЕ Номенклатура.Бесплатно) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО СтатусыНоменклатуры.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.ВидЦен,
	|	СтатусыНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК Количество,
	|	ЦеныНоменклатуры.ВидЦен КАК ВидЦен,
	|	ВТУслугиПоДоговору.Согласование КАК ПолисСогласование,
	|	ВТУслугиПоДоговору.Количество КАК ПолисКоличество,
	|	ВТУслугиПоДоговору.КоличествоПриПревышении КАК ПолисКоличествоПриПревышении,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТУслугиПоДоговору.Количество, НЕОПРЕДЕЛЕНО) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПолисНеограничено,
	|	ВТУслугиПоДоговору.КоличествоЗубов КАК КоличествоЗубов,
	|	ВТУслугиПоДоговору.КоличествоВПриеме КАК КоличествоВПриеме,
	|	ВТУслугиПоДоговору.НаименованиеОграничения КАК НаименованиеОграничения,
	|	СписокНоменклатуры.Артикул КАК Артикул,
	|	СписокНоменклатуры.Родитель КАК Родитель,
	|	ВЫБОР
	|		КОГДА СписокНоменклатуры.ЭтоГруппа = ИСТИНА
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндКартинки,
	|	СписокНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СписокНоменклатуры.НормаВремени КАК НормаВремени,
	|	СписокНоменклатуры.УпаковкаПоУмолчанию КАК УпаковкаПоУмолчанию,
	|	СписокНоменклатуры.ИспользоватьПартии КАК ИспользоватьПартии,
	|	ВЫБОР
	|		КОГДА СписокНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоСертификат,
	|	СписокНоменклатуры.Наименование КАК Наименование,
	|	СписокНоменклатуры.Бесплатно КАК Бесплатно,
	|	СписокНоменклатуры.ЭтоГруппа КАК ЭтоГруппа,
	|	СписокНоменклатуры.СкидкиЗапрещены КАК СкидкиЗапрещены,
	|	СписокНоменклатуры.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК СписокНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУслугиПоДоговору КАК ВТУслугиПоДоговору
	|		ПО СписокНоменклатуры.Ссылка = ВТУслугиПоДоговору.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|				&ОтборНаДату,
	|				СтруктурнаяЕдиница = &ОтборСтруктурнаяЕдиница
	|					И ВЫБОР
	|						КОГДА НЕ &ОтборСклад = НЕОПРЕДЕЛЕНО
	|							ТОГДА Склад = &ОтборСклад
	|					КОНЕЦ
	|					И &ОтображатьКоличество
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							СтатусыНоменклатуры.Номенклатура КАК Номенклатура
	|						ИЗ
	|							СтатусыНоменклатуры КАК СтатусыНоменклатуры)) КАК ЗапасыОстатки
	|		ПО СписокНоменклатуры.Ссылка = ЗапасыОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО СписокНоменклатуры.Ссылка = ЦеныНоменклатуры.Номенклатура
	|ГДЕ
	|	СписокНоменклатуры.Ссылка В
	|			(ВЫБРАТЬ
	|				ЦеныНоменклатуры.Номенклатура КАК НоменклатураСсылка
	|			ИЗ
	|				ЦеныНоменклатуры КАК ЦеныНоменклатуры)";
	
	// БЛОК - Условие сегментов
	
	УсловиеСегментов = 
	"И Номенклатура.Ссылка В
	|	(ВЫБРАТЬ
	|		НоменклатураСегмента.Номенклатура КАК Номенклатура
	|	ИЗ
	|		РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|	ГДЕ
	|		НоменклатураСегмента.Сегмент = &СегментСотрудника)";	
	
	ЗапросТекст = СтрЗаменить(ЗапросТекст, "И &УсловиеСегментов", ?(ОтброПоСегментам, УсловиеСегментов, ""));
	
	// БЛОК - Настройки подбора по полису
	
	УсловиеУслугиПоДоговору = 
	"И ВЫБОР КОГДА Номенклатура.ТипНоменклатуры = Значение(Перечисление.ТипыНоменклатуры.Услуга) Тогда Номенклатура.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТУслугиПоДоговору.Номенклатура КАК Номенклатура
	|			ИЗ
	|				ВТУслугиПоДоговору КАК ВТУслугиПоДоговору) ИНАЧЕ Истина КОНЕЦ";
	ЗапросТекст = СтрЗаменить(ЗапросТекст, "И &УсловиеУслугиПоДоговору", ?(ВывестиДанныеПоДоговоруПолиса, УсловиеУслугиПоДоговору, ""));
	
	// БЛОК - Услуги сотрудника
	
	УсловиеУслугиСотрудника = "";
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		
		Если ЭтоПрием Тогда 
			УсловиеУслугиСотрудника =  
			"И (Номенклатура.ТипНоменклатуры = Значение(Перечисление.ТипыНоменклатуры.Набор) Или Номенклатура.Ссылка В
			|(ВЫБРАТЬ
			|	УслугиСотрудника.Номенклатура
			|ИЗ
			|	РегистрСведений.УслугиСотрудника КАК УслугиСотрудника
			|ГДЕ
			|	УслугиСотрудника.Сотрудник = &Сотрудник
			|	И УслугиСотрудника.СтруктурнаяЕдиница = &ОтборСтруктурнаяЕдиница
			|	И НЕ УслугиСотрудника.Номенклатура.ПометкаУдаления))";
		Иначе 
			УсловиеУслугиСотрудника =  
			"И (Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
			| Или Номенклатура.Ссылка В
			|(ВЫБРАТЬ
			|	УслугиСотрудника.Номенклатура
			|ИЗ
			|	РегистрСведений.УслугиСотрудника КАК УслугиСотрудника
			|ГДЕ
			|	УслугиСотрудника.Сотрудник = &Сотрудник
			|	И УслугиСотрудника.СтруктурнаяЕдиница = &ОтборСтруктурнаяЕдиница
			|	И НЕ УслугиСотрудника.Номенклатура.ПометкаУдаления))";

		КонецЕсли;
		
	КонецЕсли;
	
	ЗапросТекст = СтрЗаменить(ЗапросТекст, "И &УсловиеУслугиСотрудника", УсловиеУслугиСотрудника);
	
	УсловиеТипы 	 			 = ?(ОтборМассивТипов, "И Номенклатура.ТипНоменклатуры В (&ОтборМассивТипов)", "И Истина");
	ЗапросТекст 	 			 = СтрЗаменить(ЗапросТекст, "И &УсловиеТипы", УсловиеТипы);
	
	Возврат ЗапросТекст;
		
КонецФункции

&НаСервере
// Процедура, выполняет установку условного оформления
//
Процедура УстановитьУсловноеОформлениеСписка(ПодборНоменклатур, СписокНеиспользуемыхГрупп, ИзменениеЦветаПоПолису = Ложь)
	
	ПодборНоменклатур.УсловноеОформление.Элементы.Очистить();
	// Перекраска слова "Бесплатно"	
	ЭлементУФ = ПодборНоменклатур.УсловноеОформление.Элементы.Добавить();  	
	
	ЭлементОтбора = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Бесплатно"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;                                              
	ЭлементОтбора.Использование = Истина;
	
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru= 'беспл.'; en = 'free'"));
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(190,160,30));
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Право);	
	
	ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Цена");
	ПолеОформления.Использование = Истина; 
	
	// Перекраска страховых услуг по согласованию
	Если ИзменениеЦветаПоПолису Тогда
	
		ЭлементУФ = ПодборНоменклатур.УсловноеОформление.Элементы.Добавить();  	
		
		ЭлементОтбора = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПолисСогласование"); 
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ТипыСогласованийУслугСтраховойКомпании.Всегда");                                              
		ЭлементОтбора.Использование = Истина;

		ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255,120,255));	
		
		ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Цена");
		ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Номенклатура");
		ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Артикул");
		ПолеОформления.Использование = Истина;
			
		// Перекраска страховых услуг по превышению количества
		
		ЭлементУФ = ПодборНоменклатур.УсловноеОформление.Элементы.Добавить();  	
		
		ЭлементОтбора = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПолисСогласование"); 
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ТипыСогласованийУслугСтраховойКомпании.ПриПревышении");                                              
		ЭлементОтбора.Использование = Истина;

		ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255,143,143));	
		
		ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Цена");
		ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Номенклатура");
		ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Артикул");
		ПолеОформления.Использование = Истина;

	КонецЕсли;
	
	///////
		
	ЭлементУФ = ПодборНоменклатур.УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоГруппа"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;                                              
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра("Текст", "");
	
	ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Цена");
	ПолеОформления.Использование = Истина;
	
	Если СписокНеиспользуемыхГрупп.Количество() > 0 Тогда
		ЭлементУФ = ПодборНоменклатур.УсловноеОформление.Элементы.Добавить();
		
		ЭлементУФ.Оформление.УстановитьЗначениеПараметра("Видимость" , Ложь);
		ЭлементУФ.Оформление.УстановитьЗначениеПараметра("Отображать" , Ложь);
		ЭлементУФ.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
		
		ЭлементОтбора = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение = СписокНеиспользуемыхГрупп; 
		ЭлементОтбора.Использование  = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обновляет количество номенклатуры
//
Процедура СкладПриИзмененииДинамическогоСпискаПодбор(Форма, Объект, МассивТипов, ОтображатьКоличество = Ложь, ИмяЭлементаДляРазмещения, ПолучитьХарактеристикиПолиса = Ложь) Экспорт
		
	УстановитьПараметрыДинамическогоСписка(Форма, Объект, МассивТипов, ОтображатьКоличество, , ИмяЭлементаДляРазмещения, ПолучитьХарактеристикиПолиса);		
	
КонецПроцедуры 

&НаСервере
// Процедура, выполянет установку параметров выбора номенклатуры.
//
Процедура УстановитьПараметрыВыбораНоменклатуры(Форма, МассивТипов) Экспорт 
	
	СегментСотрудника  = Форма._ПодборСегментНоменклатуры;
	
	Если ЗначениеЗаполнено(СегментСотрудника) Тогда
			
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	НоменклатураСегмента.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
		|ГДЕ
		|	НоменклатураСегмента.Сегмент = &СегментСотрудника");
		
		Запрос.УстановитьПараметр("СегментСотрудника" , СегментСотрудника);
		
		МассивНоменклатур = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
		
		Массив = Новый Массив;
		НовыйПараметр  = Новый ПараметрВыбора("Отбор.ТипНоменклатуры", МассивТипов);
		Массив.Добавить(НовыйПараметр);
		НовыйПараметр  = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивНоменклатур));
		Массив.Добавить(НовыйПараметр); 		
		Форма.Элементы.ЗапасыНоменклатура.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);	
	Иначе
		
		Массив = Новый Массив;
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипНоменклатуры", МассивТипов);
		Массив.Добавить(НовыйПараметр);
		Форма.Элементы.ЗапасыНоменклатура.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);
		
	КонецЕсли;  	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти