
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();

	Если Объект.РасписаниеРаботы.Количество() = 0 Тогда	
		Для а = 1 по 7 Цикл
			НоваяСтрока = Объект.РасписаниеРаботы.Добавить();
			НоваяСтрока.ДеньНедели = Дата("2001010"+Строка(а));			
		КонецЦикла;
	КонецЕсли;
		
	// Контактная информация
	// КонтактнаяИнформацияСервер.ПриСозданииПриЧтенииНаСервере(ЭтаФорма, Объект);
	
	УправлениеКонтактнойИнформациейСтоматология.ПриСозданииПриЧтенииНаСервере(ЭтотОбъект);
	
	Если НЕ РольДоступна("АдминистраторСистемы")
		И НЕ РольДоступна("Администрирование")
		И НЕ РольДоступна("ПолныеПрава") Тогда 
		
		Элементы.ТаблицаРасписаниеКнопкаЗаполнить.Доступность = Ложь;
	КонецЕсли;
	СоздатьМенюПереключения();
	
	РедактированиеКартинок            = ПравоДоступа("Редактирование", Метаданные.Справочники.СтруктурныеЕдиницы);
	Элементы.ПолеКартинки_7.Доступность = РедактированиеКартинок;
	Элементы.ДобавитьЛого.Доступность = РедактированиеКартинок; 
	
	Если Строка(Константы.СтранаУчета.Получить()) = "РОССИЯ" Тогда
		Элементы.ИспользоватьЯндексКарты.Видимость = Истина;
	КонецЕсли;
	Если Объект.ИспользоватьЯндексКарты Тогда
		Наименование = Ложь;
		ПолучитьНастройкиЯндексКарты(Наименование);
		ЭтотОбъект.УидСессии = ЛичныйКабинет.УидТекущейСессии();
	Иначе
		Элементы.ГруппаЯндексИдентификаторРубрики.Видимость  = Ложь;
	КонецЕсли;           	
	
	ЭтоЗаписьВЦРМ = Ложь;

	ОтобразитьКартинки();
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
    // Обработчик механизма "Свойства".
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, Объект, "СтраницаДополнительныеРеквизиты");	

КонецПроцедуры

&НаСервере
// Процедура обработчик события "ПередЗаписьюНаСервере"
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//// Обработчик подсистемы "Контактная информация"
	// УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, Отказ);
	//
	
	// КонтактнаяИнформация
	// КонтактнаяИнформацияСервер.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец КонтактнаяИнформация

	УправлениеКонтактнойИнформациейСтоматология.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	Если (Объект.ИспользоватьЯндексКарты Или Объект.Ссылка.ИспользоватьЯндексКарты <> Объект.ИспользоватьЯндексКарты) И ЭтаФорма.Модифицированность = Истина Тогда
		
		ЯндексУникальныйНеизменныйИдентификатор 	= СтрЗаменить(Строка(ЭтотОбъект.ЯндексНаименованиеОрганизации.УникальныйИдентификатор()), "-", "");
		
		ЯндексЧасыРаботы							= Справочники.СтруктурныеЕдиницы.ПолучитьПредставленияГрафикаРаботы(объект);
		ЯндексСтруктурнаяЕдиница					= Объект.Наименование;
		ЯндексДатаАктуализации 						= Строка(Формат(ТекущаяДатаСеанса(), "ДЛФ=D"));
		
		МассивТелефонов 							= ЭтаФорма.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
		МассивЭлПочты 								= ЭтаФорма.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)); 
		МассивАдресов 								= ЭтаФорма.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
		МассивСоциальныхСетей                       = ЭтаФорма.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.СоциальнаяСеть));
		МассивСайтов                                = ЭтаФорма.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.ВебСтраница));
	
		
		ПроверкаНаОбязательныеПоля = Ложь;
		Если Объект.ИспользоватьЯндексКарты Тогда
			Если Не ЗначениеЗаполнено(ЯндексЧасыРаботы) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На вкладке Основное не заполнено - Время работы");
				ПроверкаНаОбязательныеПоля = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(МассивТелефонов)
				И ЗначениеЗаполнено(МассивТелефонов[0].Значение) 
				И ЗначениеЗаполнено(МассивАдресов)
				И ЗначениеЗаполнено(МассивАдресов[0].Значение) 
				И ЗначениеЗаполнено(МассивСайтов)
				И ЗначениеЗаполнено(МассивСайтов[0].Значение) Тогда
				
				МассивАдресовФакт						= ДекодироватьИзJSON(МассивАдресов[0].Значение);
				ЯндексАдрес 							= МассивАдресовФакт.value;
				Если МассивАдресовФакт.Свойство("comment") Тогда
					ЯндексДополнительнаяИнформацияКАдресу 	= МассивАдресовФакт.comment;
				Иначе
					ЯндексДополнительнаяИнформацияКАдресу = "";
				КонецЕсли;
				Если МассивАдресовФакт.Свойство("city") Тогда
					ЯндексГород = МассивАдресовФакт.city;
				Иначе
					ЯндексГород = МассивАдресовФакт.area;	
				КонецЕсли;
				
				ЭтотОбъект.ЯндексНомерТелефона.Очистить();
				Для Каждого Элемент из МассивТелефонов Цикл
					Если ЗначениеЗаполнено(Элемент.Значение) Тогда
						МассивТелефоновЭл		= ДекодироватьИзJSON(Элемент.Значение);
						Стр = ЯндексНомерТелефона.Добавить();
						Стр.НомерТелефона 		= СтрРазделить(МассивТелефоновЭл.value, ",")[0];
						Если МассивТелефоновЭл.Свойство("comment") Тогда
							Стр.ЧейНомер		 	= МассивТелефоновЭл.comment;
						КонецЕсли;
						Если МассивТелефоновЭл.Свойство("extNumber") Тогда
							Стр.ДобавочныйНомер 	= МассивТелефоновЭл.extNumber;
						КонецЕсли;	
					КонецЕсли;
				КонецЦикла;
				ЯндексНомераТелефонов = ДанныеФормыВЗначение(ЯндексНомерТелефона, Тип("ТаблицаЗначений"));
				
				МассивСайтов 						= ДекодироватьИзJSON(МассивСайтов[0].Значение);
				ЯндексСайт 							= МассивСайтов.value;
				
				ЯндексКоординатыПоДолготе           = Объект.Долгота;
				ЯндексКоординатыПоШироте            = Объект.Широта;
				
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните обязательные поля - Телефон, фактический адрес и сайт");
				ПроверкаНаОбязательныеПоля = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(МассивАдресов) 
				И ЗначениеЗаполнено(МассивАдресов[1].Значение) Тогда
				
				МассивКороткихАдресов			= ДекодироватьИзJSON(МассивАдресов[1].Значение);
				ЯндексКороткийАдрес 			= МассивКороткихАдресов.value;
				
			Иначе
				ЯндексКороткийАдрес = "";
			КонецЕсли;
			
			ЭтотОбъект.ЯндексЭлектроннаяПочта.Очистить();
			Если ЗначениеЗаполнено(МассивЭлПочты) Тогда
				Для Каждого Элемент из МассивЭлПочты Цикл
					Если ЗначениеЗаполнено(Элемент.Значение) Тогда 
						МассивЭлПочтыЭЛ			= ДекодироватьИзJSON(Элемент.Значение);
						ЯндексЭлектроннаяПочта.Добавить(МассивЭлПочтыЭЛ.value);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			ЭтотОбъект.ЯндексСоциальныеСети.Очистить();
			Если ЗначениеЗаполнено(МассивСоциальныхСетей) Тогда
				Для Каждого Элемент из МассивСоциальныхСетей Цикл
					Если ЗначениеЗаполнено(Элемент.Значение) Тогда
						МассивСоциальныхСетейЭЛ	 = ДекодироватьИзJSON(Элемент.Значение);
						Если Лев(МассивСоциальныхСетейЭЛ.value, 7) = "http://" Или Лев(МассивСоциальныхСетейЭЛ.value, 8) = "https://" Тогда 
							ЯндексСоциальныеСети.Добавить(МассивСоциальныхСетейЭЛ.value);
						Иначе		 
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ссылка в соц. сетях. Указывается в нижнем регистре, полностью, включая http:// или https:// ");
							ПроверкаНаОбязательныеПоля = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЯндексСайт) И Не (Лев(ЯндексСайт, 7) = "http://" Или Лев(ЯндексСайт, 8) = "https://") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Основной сайт сети. Указывается в нижнем регистре, полностью, включая http:// или https:// ");
				ПроверкаНаОбязательныеПоля = Истина;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ЯндексКоординатыПоШироте) ИЛИ Не ЗначениеЗаполнено(ЯндексКоординатыПоДолготе) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо указать координаты");
				ПроверкаНаОбязательныеПоля = Истина;	
			КонецЕсли;

			Если Не ЗначениеЗаполнено(ЯндексИдентификаторРубрики) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо добавить от 1 до 3 рубрик");
				ПроверкаНаОбязательныеПоля = Истина;
			КонецЕсли;
		КонецЕсли;
		// Если ЗначениеЗаполнено(ЯндексКоординатыПоДолготе) 
		//	И ЗначениеЗаполнено(ЯндексКоординатыПоШироте) Тогда
		//	ПроверкаПОДолготе = ЯвляетсяЧислом(ЯндексКоординатыПоДолготе);
		//	ПроверкаПоШироте  = ЯвляетсяЧислом(ЯндексКоординатыПоШироте);
		//	Если ПроверкаПОДолготе = Истина И ПроверкаПоШироте = Истина Тогда
		//		ЧислоПоДолготе = Число(ЯндексКоординатыПоДолготе);
		//		ЧислоПоШироте  = Число(ЯндексКоординатыПоШироте);
		//		Если ЧислоПоДолготе > 180 
		//			Или ЧислоПоДолготе < -180 
		//			Или ЧислоПоШироте > 90 
		//			Или ЧислоПоШироте < -90 Тогда
		//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неверно заполнены координаты. Координаты по широте(значение от -90.0000000 до 90.0000000) и Координаты по долготе(значение от -180.0000000 до 180.0000000)");
		//			ПроверкаНаОбязательныеПоля = Истина;
		//		КонецЕсли;
		//	Иначе
		//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неверно заполнены координаты. Координаты по широте(значение от -90.0000000 до 90.0000000) и Координаты по долготе(значение от -180.0000000 до 180.0000000)");
		//		ПроверкаНаОбязательныеПоля = Истина;
		//	КонецЕсли;
		// Иначе	
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните обязательные поля: Координаты по широте(значение от -90.0000000 до 90.0000000) и Координаты по долготе(значение от -180.0000000 до 180.0000000)");
		//	ПроверкаНаОбязательныеПоля = Истина;
		// КонецЕсли;		
		
		Если ПроверкаНаОбязательныеПоля Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Настройки  = Новый Структура();
		
		Настройки .Вставить("Организация"						, Строка(ЭтотОбъект.ЯндексНаименованиеОрганизации.УникальныйИдентификатор()));
		Настройки .Вставить("УникальныйНеизменныйИдентификатор" , ЭтотОбъект.ЯндексУникальныйНеизменныйИдентификатор);
		Настройки .Вставить("Салон"								, Объект.Наименование);
		Настройки .Вставить("ОГРН"								, ЭтотОбъект.ЯндексНаименованиеОрганизации.ОГРН);
		Настройки .Вставить("ИНН"								, ЭтотОбъект.ЯндексНаименованиеОрганизации.ИНН);
		Настройки .Вставить("ЧасыРаботы"	 					, ЭтотОбъект.ЯндексЧасыРаботы);
		Настройки .Вставить("Страна"							, Строка(Константы.СтранаУчета.Получить()));
		Настройки .Вставить("ИспользоватьЯндексКарты"			, Объект.ИспользоватьЯндексКарты);
		Настройки .Вставить("Сайт"								, НРег(ЭтотОбъект.ЯндексСайт));
		Настройки .Вставить("ДополнительныйСайт"				, НРег(ЭтотОбъект.ЯндексДополнительныйСайт));
		Настройки .Вставить("КоординатыПоДолготе"				, ЭтотОбъект.ЯндексКоординатыПоДолготе);
		Настройки .Вставить("КоординатыПоШироте"				, ЭтотОбъект.ЯндексКоординатыПоШироте);
		Настройки .Вставить("ИдентификаторРубрики"	  			, ЭтотОбъект.ЯндексИдентификаторРубрики);
		Настройки .Вставить("ДатаАктуализации"	  				, ЭтотОбъект.ЯндексДатаАктуализации);
		Настройки .Вставить("Телефон"							, ЯндексНомераТелефонов);
		Настройки .Вставить("ЭлектроннаяПочта"					, ЭтотОбъект.ЯндексЭлектроннаяПочта);
		Настройки .Вставить("Адрес"								, ЭтотОбъект.ЯндексАдрес);
		Настройки .Вставить("Город"								, ЭтотОбъект.ЯндексГород);
		Настройки .Вставить("ДопАдрес"							, ЭтотОбъект.ЯндексДополнительнаяИнформацияКАдресу);
		Настройки .Вставить("КороткийАдрес"						, ЭтотОбъект.ЯндексКороткийАдрес);
		
		ЭтаФорма.ЯндексИНН 	= ЭтотОбъект.ЯндексНаименованиеОрганизации.ИНН;
		ЭтаФорма.ЯндексОГРН	= ЭтотОбъект.ЯндексНаименованиеОрганизации.ОГРН;
		
		ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(,Перечисления.ТипыВнешнихСистем.ЯндексКарты, ЛОжь); 
		
		Если НЕ ЗначениеЗаполнено(ВнешняяСистема) Тогда			
			ВнешняяСистема = Справочники.ВнешниеСистемы.СоздатьВнешнююСистему(Перечисления.ТипыВнешнихСистем.ЯндексКарты,,Истина);
		КонецЕсли;	
		ЯндексКлючВнешнейСистемы = НРег(ВнешняяСистема.КлючПриложения);
		ЯндексНомерОбласти = ЛичныйКабинет.ПолучитьНомерОбласти();
		
		Индекс = 0;
		Для Каждого СтрокаТ Из ЭтотОбъект.ФайлыКартинок Цикл
			ФайлКартинки  = ЭтотОбъект.ФайлыКартинок[Индекс].Значение;				
			БазовыйURL    =  "http://app.stoma1c.ru/api/hs/api";
			АдресКартинки = БазовыйURL + "/files/" + ВнешняяСистема.КлючПриложения + "/" + Строка(ФайлКартинки.УникальныйИдентификатор()) + "." + ФайлКартинки.Расширение;
			ЭтотОбъект.ФайлыКартинок[Индекс].Представление = АдресКартинки;
			Индекс = Индекс + 1; 				
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ФайлыКартинок) Тогда
			ЯндексСсылкаНаФото = БазовыйURL + "/files/" + ВнешняяСистема.КлючПриложения + "/gallery"; 
		Иначе	
			ЯндексСсылкаНаФото = "";
		КонецЕсли;
		
		Настройки.Вставить("СсылкаНаФото", НРег(ЯндексСсылкаНаФото));			
		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НастройкиЯндексКарты", Настройки);
		
		ЭтоЗаписьВЦРМ = Истина;
		
		РезультатЗапроса = ЛичныйКабинет.СоздатьВнешнююСистемуВ_CRM(ВнешняяСистема, ЭтотОбъект.УидСессии);
		
		Если НЕ РезультатЗапроса.ВыполненоУспешно Тогда
			ЗаписьЖурналаРегистрации("ЯндексКарты", УровеньЖурналаРегистрации.Ошибка,,,"Код ошибки: " + РезультатЗапроса.КодОшибки + " Описание ошибки: " + РезультатЗапроса.ОписаниеОшибки); 
		КонецЕсли; 		
		
	КонецЕсли;
	
	// Обработчик механизма "Свойства".
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

&НаСервере
// Процедура обработчик события "ПриСозданииНаСервере"
//
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьЛогоСЕВРезерви();
	
КонецПроцедуры

&НаСервере
// Процедура обработчик события "ПослеЗаписиНаСервере"
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьЛогоСЕВРезерви();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Значение" Тогда
		
		Если ЗначениеЗаполнено(Параметр) Тогда
            ПолучитьИдентификаторИзХранилища(Параметр);
        КонецЕсли;  
				
	КонецЕсли;

	Если ИмяСобытия = "Запись_Файл" Тогда
		
		Если Параметр.Свойство("ВладелецФайла") И Параметр.ВладелецФайла = Объект.Ссылка Тогда
			ОтобразитьКартинки();
		КонецЕсли;
		
	КонецЕсли;
	
	// Обработчик механизма "Свойства".
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьДополнительныеРеквизиты();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура обработчик команды "ЗаполнитьПоУмолчанию"
//
&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
			
	Режим = РежимДиалогаВопрос.ДаНет;
	Текст = "ru = ""Табличная часть будет очищена и заполнена по умолчанию, продолжить выполнение операции?""";
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоУмолчаниюЗавершение", ЭтотОбъект), НСтр(Текст), Режим, 0);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Заполнить по умолчанию завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ЗаполнитьПоУмолчаниюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Для Каждого СтрокаРасписание из Объект.РасписаниеРаботы Цикл
			СтрокаРасписание.НачалоРаботы    = Объект.ВремяНачалаРаботы;
			СтрокаРасписание.ОкончаниеРаботы = Объект.ВремяОкончанияРаботы;
			СтрокаРасписание.Активность = Истина;
		КонецЦикла;
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

// Проверка ввода времени работы стоматологии
//
&НаКлиенте
Процедура ВремяНачалаРаботыПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ВремяНачалаРаботы) И ЗначениеЗаполнено(Объект.ВремяОкончанияРаботы) Тогда
		
		Если Объект.ВремяОкончанияРаботы < Объект.ВремяНачалаРаботы Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неверно введено время работы стоматологии. Время окончания работы должно быть больше чем время начала работы.");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ВремяНачалаРаботыПриИзменении(Элемент)

// Создание списка значений веремени
//
&НаКлиенте
Процедура ВремяНачалаРаботыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МассивПериодов = Новый Массив;
	
	ПериодРаботы = Новый Структура("ДатаНачала, ДатаОкончания");
	ПериодРаботы.ДатаНачала = Дата("00010101000000");
	ПериодРаботы.ДатаОкончания = Дата("00010101235959");
	МассивПериодов.Добавить(ПериодРаботы);
	
	СписокВремени = РаботаСДиалогами.ВернутьСписокВремениДляНачалаРаботы(МассивПериодов,Ложь,30);
	
	НачальноеЗначение = СписокВремени.НайтиПоЗначению(Объект.ВремяНачалаРаботы);
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ВремяНачалаРаботыПослеВыбораИзСписка", ЭтотОбъект, Новый Структура("Элемент", Элемент)), СписокВремени, Элемент, НачальноеЗначение); 	

КонецПроцедуры

&НаКлиенте 
// Процедура - Время начала работы после выбора из списка
//
// Параметры:
//  ВыбранныйЭлемент		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВремяНачалаРаботыПослеВыбораИзСписка(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Объект.ВремяНачалаРаботы = ВыбранныйЭлемент.Значение;
		ВремяНачалаРаботыПриИзменении(Элемент);
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте 
// Проверка ввода времени работы стоматологии
//
Процедура ВремяОкончанияРаботыПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ВремяНачалаРаботы) И ЗначениеЗаполнено(Объект.ВремяОкончанияРаботы) Тогда
		
		Если Объект.ВремяОкончанияРаботы < Объект.ВремяНачалаРаботы Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неверно введено время работы стоматологии. Время окончания работы должно быть больше чем время начала работы.");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ВремяОкончанияРаботыПриИзменении(Элемент)

// Создание списка значений веремени
//
&НаКлиенте
Процедура ВремяОкончанияРаботыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МассивПериодов = Новый Массив;
	
	ПериодРаботы = Новый Структура("ДатаНачала, ДатаОкончания");
	Если ЗначениеЗаполнено(Объект.ВремяНачалаРаботы) тогда
		ПериодРаботы.ДатаНачала = Объект.ВремяНачалаРаботы;
	Иначе
		ПериодРаботы.ДатаНачала = Дата("00010101000000");
	КонецЕсли;
	ПериодРаботы.ДатаОкончания = Дата("00010101235959");
	МассивПериодов.Добавить(ПериодРаботы);
	
	СписокВремени = РаботаСДиалогами.ВернутьСписокВремениДляОкончанияРаботы(МассивПериодов,Ложь,30);
	
	НачальноеЗначение = СписокВремени.НайтиПоЗначению(Объект.ВремяНачалаРаботы);
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ВремяОкончанияРаботыПослеВыбораИзСписка", ЭтотОбъект, Новый Структура("Элемент", Элемент)), СписокВремени, Элемент, НачальноеЗначение); 	

КонецПроцедуры

&НаКлиенте
// Процедура - Время окончания работы после выбора из списка
//
// Параметры:
//  ВыбранныйЭлемент		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВремяОкончанияРаботыПослеВыбораИзСписка(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Объект.ВремяОкончанияРаботы = ВыбранныйЭлемент.Значение;
		ВремяОкончанияРаботыПриИзменении(Элемент);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ОсновнаяКассаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьВопрос(Новый ОписаниеОповещения("ОсновнаяКассаНачалоВыбораПослеВопроса", ЭтотОбъект),
		НСтр("ru = 'Необходимо записать структурную единицу, записать?'"), РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	Иначе
		СтандартнаяОбработка = Ложь;
		ЗначениеОтбора = Новый Структура("СтруктурнаяЕдиница", Объект.Ссылка);
		ПараметрыВыбораСписка = Новый Структура("Отбор", ЗначениеОтбора);				
		ОткрытьФорму("Справочник.Кассы.ФормаВыбора", ПараметрыВыбораСписка,,,,,Новый ОписаниеОповещения("ОсновнаяКассаНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Основная касса начало выбора после вопроса
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ОсновнаяКассаНачалоВыбораПослеВопроса(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Результат = ЭтаФорма.Записать();
		Если Результат Тогда                                                     								
			ЗначениеОтбора = Новый Структура("СтруктурнаяЕдиница", Объект.Ссылка);
			ПараметрыВыбораСписка = Новый Структура("Отбор", ЗначениеОтбора);				
			ОткрытьФорму("Справочник.Кассы.ФормаВыбора", ПараметрыВыбораСписка,,,,,Новый ОписаниеОповещения("ОсновнаяКассаНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
		КонецЕсли;			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОсновнаяКассаНачалоВыбораЗавершение"
//
Процедура ОсновнаяКассаНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Объект.ОсновнаяКасса = Результат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ОсновнойСкладНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьВопрос(Новый ОписаниеОповещения("ОсновнойСкладНачалоВыбораПослеВопроса", ЭтотОбъект),
		НСтр("ru = 'Необходимо записать структурную единицу, записать?'"), РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	Иначе
		СтандартнаяОбработка = Ложь;
		ЗначениеОтбора = Новый Структура("СтруктурнаяЕдиница", Объект.Ссылка);
		ПараметрыВыбораСписка = Новый Структура("Отбор", ЗначениеОтбора);				
		ОткрытьФорму("Справочник.Склады.ФормаВыбора", ПараметрыВыбораСписка,,,,,Новый ОписаниеОповещения("ОсновнойСкладНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Основной склад начало выбора после вопроса
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ОсновнойСкладНачалоВыбораПослеВопроса(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Результат = ЭтаФорма.Записать();
		Если Результат Тогда                                                     								
			ЗначениеОтбора = Новый Структура("СтруктурнаяЕдиница", Объект.Ссылка);
			ПараметрыВыбораСписка = Новый Структура("Отбор", ЗначениеОтбора);				
			ОткрытьФорму("Справочник.Склады.ФормаВыбора", ПараметрыВыбораСписка,,,,,Новый ОписаниеОповещения("ОсновнойСкладНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли;			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОсновнойСкладНачалоВыбораЗавершение"
//
Процедура ОсновнойСкладНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Объект.ОсновнойСклад = Результат;
	КонецЕсли;

КонецПроцедуры

//#Область КОНТАКТНАЯ_ИНФОРМАЦИЯ

//#Область КОНТАКТНАЯ_ИНФОРМАЦИЯ_УСТАРЕВШЕЕ

//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "КОНТАКТНАЯ ИНФОРМАЦИЯ"

//// Процедура, обработчик события "ПриИзменении" поля ввода "КонтактнаяИнформация".
//// Процедура назначается динамически действию элемента формы поле ввода
////
//&НаКлиенте
// Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
//	
//	УправлениеКонтактнойИнформациейКлиент.ПредставлениеПриИзменении(ЭтаФорма, Элемент);
//	
// КонецПроцедуры

//// Процедура, обработчик события "НачалоВыбора" поля ввода "КонтактнаяИнформация".
//// Процедура назначается динамически действию элемента формы поле ввода
////
//&НаКлиенте
// Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
//	
// КонецПроцедуры
//	
//#КонецОбласти

//&НаКлиенте
//// Процедура - Добавить контактную информацию
////
//// Параметры:
////  Команда	 - 	 - 
////
// Процедура ДобавитьКонтактнуюИнформацию(Команда)

//	КонтактнаяИнформацияКлиент.ДобавитьКонтактнуюИнформациюНажатие(ЭтаФорма, Элементы.КнопкаДобавитьКонтактнуюИнформацию);
//	
// КонецПроцедуры

//&НаСервере
//// Процедура - Добавить контактную информацию сервер
////
//// Параметры:
////  ДобавляемыйВид				 - 	 - 
////  УстановитьВыводВФормеВсегда	 - 	 - 
////
// Процедура ДобавитьКонтактнуюИнформациюСервер(ДобавляемыйВид, УстановитьВыводВФормеВсегда = Ложь) Экспорт
//	
//	КонтактнаяИнформацияСервер.ДобавитьКонтактнуюИнформацию(ЭтаФорма, Объект, ДобавляемыйВид, УстановитьВыводВФормеВсегда);
//	
// КонецПроцедуры

//&НаКлиенте
//// Процедура - Подключаемый действие КИНажатие
////
//// Параметры:
////  Элемент	 - 	 - 
////
// Процедура Подключаемый_ДействиеКИНажатие(Элемент)
//	
//	КонтактнаяИнформацияКлиент.ДействиеКИНажатие(ЭтаФорма, Элемент);
//	
// КонецПроцедуры

//&НаКлиенте
//// Процедура - Подключаемый представление КИПри изменении
////
//// Параметры:
////  Элемент	 - 	 - 
////
// Процедура Подключаемый_ПредставлениеКИПриИзменении(Элемент)
//	
//	КонтактнаяИнформацияКлиент.ПредставлениеКИПриИзменении(ЭтаФорма, Элемент);
//	
// КонецПроцедуры

//&НаКлиенте
//// Процедура - Подключаемый представление КИНачало выбора
////
//// Параметры:
////  Элемент				 - 	 - 
////  ДанныеВыбора		 - 	 - 
////  СтандартнаяОбработка - 	 - 
////
// Процедура Подключаемый_ПредставлениеКИНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	КонтактнаяИнформацияКлиент.ПредставлениеКИНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка);
//	
// КонецПроцедуры

//&НаКлиенте
//// Процедура - Подключаемый представление КИОчистка
////
//// Параметры:
////  Элемент				 - 	 - 
////  СтандартнаяОбработка - 	 - 
////
// Процедура Подключаемый_ПредставлениеКИОчистка(Элемент, СтандартнаяОбработка)
//	
//	КонтактнаяИнформацияКлиент.ПредставлениеКИОчистка(ЭтаФорма, Элемент, СтандартнаяОбработка);
//	
// КонецПроцедуры

//&НаКлиенте
//// Процедура - Подключаемый комментарий КИПри изменении
////
//// Параметры:
////  Элемент	 - 	 - 
////
// Процедура Подключаемый_КомментарийКИПриИзменении(Элемент)
//	
//	КонтактнаяИнформацияКлиент.КомментарийКИПриИзменении(ЭтаФорма, Элемент);
//	
// КонецПроцедуры

//#КонецОбласти

#Область КОНТАКТНАЯ_ИНФОРМАЦИЯ


&НаКлиенте
// Процедура - Добавить контактную информацию
// 
// Параметры:
//  Команда	 - 	 - 
// 
Процедура ДобавитьКонтактнуюИнформацию(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьКонтактнуюИнформациюВидВыбран", ЭтотОбъект);
	СписокДоступныхВидов = УправлениеКонтактнойИнформациейКлиентСерверСтоматология.СписокВидовДляДобавленияКонтактнойИнформации(ЭтаФорма.СвойстваВидовКонтактнойИнформации, ЭтаФорма.КонтактнаяИнформация);
	ЭтаФорма.ПоказатьВыборИзМеню(ОписаниеОповещения, СписокДоступныхВидов, Элементы.КнопкаДобавитьКонтактнуюИнформацию);
	
КонецПроцедуры     

&НаКлиенте
// Процедура - обработчик оповещения "ДобавитьКонтактнуюИнформациюВидВыбран".
//
Процедура ДобавитьКонтактнуюИнформациюВидВыбран(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("Вид", ВыбранныйЭлемент.Значение);
	
	НайденныеСтроки = ЭтаФорма.СвойстваВидовКонтактнойИнформации.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	СвойстваВида = НайденныеСтроки[0];
		
	ДобавитьКонтактнуюИнформациюСервер(ВыбранныйЭлемент.Значение);
	
КонецПроцедуры

&НаСервере
// Процедура - Добавить контактную информацию сервер
//
// Параметры:
//  ДобавляемыйВид				 - 	 - 
//  УстановитьВыводВФормеВсегда	 - 	 - 
//
Процедура ДобавитьКонтактнуюИнформациюСервер(ДобавляемыйВид, УстановитьВыводВФормеВсегда = Ложь) Экспорт
	
	УправлениеКонтактнойИнформациейСтоматология.ДобавитьКонтактнуюИнформацию(ЭтаФорма, Объект, ДобавляемыйВид, УстановитьВыводВФормеВсегда);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый действие КИНажатие
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ДействиеКИНажатие(Элемент)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ДействиеКИНажатие(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый представление КИПри изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ПредставлениеКИПриИзменении(Элемент)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ПредставлениеКИПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый представление КИНачало выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеВыбора		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура Подключаемый_ПредставлениеКИНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ПредставлениеКИНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый представление КИОчистка
//
// Параметры:
//  Элемент				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура Подключаемый_ПредставлениеКИОчистка(Элемент, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ПредставлениеКИОчистка(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый контактная информация авто подбор
//
// Параметры:
//  Элемент					 - 	 - 
//  Текст					 - 	 - 
//  ДанныеВыбора			 - 	 - 
//  ПараметрыПолученияДанных - 	 - 
//  Ожидание				 - 	 - 
//  СтандартнаяОбработка	 - 	 - 
//
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.АвтоПодбор(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый контактная информация обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый комментарий КИПри изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_КомментарийКИПриИзменении(Элемент)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.КомментарийКИПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый контактная информация выполнить команду
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Подключаемый_КонтактнаяИнформация_ВыполнитьКоманду(Команда)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ВыполнитьКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактироватьСоставСвойств(Команда)
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);

КонецПроцедуры

//&НаКлиенте
//// Процедура - Подключаемый контактная информация выполнить команду
////
//// Параметры:
////  Команда	 - 	 - 
////
// Процедура Подключаемый_КонтактнаяИнформация_ВыполнитьКоманду(Команда)
//	
//	КонтактнаяИнформацияКлиент.ВыполнитьКоманду(ЭтаФорма, Команда);
//	
// КонецПроцедуры

&НаКлиенте
// Процедура - Переключить страницу онлайн записи
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПереключитьСтраницуОнлайнЗаписи(Команда) 
	
	МассивИмен = СтрРазделить(ЭтаФорма.ТекущийЭлемент.Имя, "_");	
	Если МассивИмен.Количество()> 1 Тогда
		ОбновитьДанныеСсылкиНаОнлайнЗапись(МассивИмен[1]);
	КонецЕсли;
                                               
КонецПроцедуры

#КонецОбласти


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, создает меню переключения.
//
Процедура СоздатьМенюПереключения()
	        	
	СтруктураМеню = Новый Структура;
	СтруктураМеню.Вставить("Основное", "ГруппаОсновное");
	СтруктураМеню.Вставить("Контакты", "ГруппаКонтактнаяИнформация");
	СтруктураМеню.Вставить("Онлайн"  , "ГруппаОнлайн");
	СтруктураМеню.Вставить("Галерея", "ГруппаГалерея");
	
	ОбработкаТабличныхЧастейКлиент.СоздатьМенюДокумента(ЭтаФорма, СтруктураМеню, "ГруппаПереключательЗакладок");
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет обработку нажатия динамических кнопок
//
Процедура ПроцедураОбработкиНажатияМеню(Элемент)
	
	ОбработатьНажатиеМеню(Элемент.Имя);
	
КонецПроцедуры

&НаСервере
// Процедура, обрабатывает нажатие динамических кнопок
//
Процедура ОбработатьНажатиеМеню(ИмяЭлемента)
	
	ОбработкаТабличныхЧастейКлиент.ПроцедураОбработкиНажатияМеню(ЭтаФорма, ИмяЭлемента);
	
	Если ВРег(ИмяЭлемента) = ВРег("_ГруппаОнлайн") Тогда
		ЗаполнитьПоляУстановкиКода();
		УстановитьВидимостьПереключателя("0");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет поля установки кода для сайта.
//
Процедура ЗаполнитьПоляУстановкиКода()

	Если ЗначениеЗаполнено(Объект.УникальныйИдентификаторСтруктурнойЕдиницы) Тогда 
		УИДСтрокой = Объект.УникальныйИдентификаторСтруктурнойЕдиницы;
	Иначе
		УИДСтрокой = Строка(Объект.Ссылка.УникальныйИдентификатор());
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ОнлайнЗаписьПоСсылке) Тогда		
		ЭтотОбъект.ОнлайнЗаписьПоСсылке	= "https://reservi.ru/stoma1c/" + УИДСтрокой; 		
	КонецЕсли;
	
	УИДКлиникиРезерви = "";
	Попытка
		
		Соединение 		 = Новый HTTPСоединение("reservi.ru/4.0/?salons%5B%5D=" + УИДСтрокой + "&state=fastinit&ver=2.053",,,,,1, Новый ЗащищенноеСоединениеOpenSSL());
		
		ЗапросHTTP       = Новый HTTPЗапрос();
		РезультатЗапроса = Соединение.Получить(ЗапросHTTP);
		ТекстJSON		 = РезультатЗапроса.ПолучитьТелоКакСтроку();					
		
		Если ЗначениеЗаполнено(ТекстJSON) Тогда
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстJSON);
			ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON, Истина);
			
			data 			 = ПараметрыJSON.Получить("data");
			fastinit 		 = data.Получить("fastinit");
			
			Если ТипЗнч(fastinit) = Тип("Соответствие") И fastinit.Количество() > 0 Тогда
				ЭтотОбъект.УИДКлиникиРезерви = fastinit[УИДСтрокой].Получить("ID");
			КонецЕсли;
		КонецЕсли;
	
	Исключение   
	КонецПопытки;
	
	КодОнлайнЗаписи = "<script src=""//reservi.ru/4.0/" + ЭтотОбъект.УИДКлиникиРезерви + "/""></script>";	
	ЭтотОбъект.КодДляУстановкиОнлайнЗаписи = КодОнлайнЗаписи;

КонецПроцедуры

// Процедура - Скопировать в буфер
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура СкопироватьВБуфер(Команда)
	
	МассивПодстрок = СтрРазделить(ТекущийЭлемент.Имя, "_", Ложь);
	Если МассивПодстрок.Количество() > 1 Тогда
		ОбщегоНазначенияКлиент.УстановитьТекстВБуферОбмена(ЭтотОбъект[МассивПодстрок[1]]);
		ПоказатьОповещениеПользователя("Текст скопирован в буфер обмена.");		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Поле картинки нажатие
//
// Параметры:
//  Элемент				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
&НаКлиенте
Процедура ПолеКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Индекс 		 = ПолучитьИндексИмениЭлемента(Элемент.Имя);
	
	Если Индекс = 7 Тогда
		МассивФайловКартинок = ПолучитьВсеПодчиненныеФайлы(Объект.Ссылка, "ЛоготипМагазина");
		ФайлКартинки		 = ?(МассивФайловКартинок.Количество() > 0, МассивФайловКартинок[0], Неопределено);
	Иначе
		ФайлКартинки = ЭтотОбъект.ФайлыКартинок.Получить(Индекс - 1).Значение;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФайлКартинки) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьКартинку(ФайлКартинки);

КонецПроцедуры

&НаКлиенте
// Процедура, открывает картинку.
//
Процедура ОткрытьКартинку(ФайлКартинки)
	
	ДанныеФайла = ПолучитьДанныеФайла(ФайлКартинки); // ЭтаФорма.УникальныйИдентификатор);
	
	Если ДанныеФайла <> Неопределено Тогда 
		Попытка
			РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла); 
		Исключение  
			ЗаписатьВЖурналРегистрации("ОткрытиеЛоготипаВиджета");
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает данные файла.
//
Функция ПолучитьДанныеФайла(ФайлКартинки, УникальныйИдентификатор= неопределено)
	
	Возврат РаботаСФайламиВызовСервераСтоматология.ПолучитьДанныеФайлаКартинки(ФайлКартинки, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
// Получает все подчиненные файлы.
//
// Параметры:
//   ВладелецФайла - ЛюбаяСсылка - владелец файла.
//
// Возвращаемое значение:
//   Массив из СправочникСсылка.Файлы - массив файлов.
//
Функция ПолучитьВсеПодчиненныеФайлы(ВладелецФайла, Описание)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Файлы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла = &ВладелецФайла
	|	И НЕ Файлы.ПометкаУдаления
	|	И (ВЫРАЗИТЬ(Файлы.Описание КАК СТРОКА(100))) = &Описание");
	
	Запрос.УстановитьПараметр("ВладелецФайла", ВладелецФайла);
	Запрос.УстановитьПараметр("Описание"     , Описание);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Функция, вернет индекс имени элемента.
//
Функция ПолучитьИндексИмениЭлемента(Наименование)
	
	НомерСимвола = СтрНайти(Наименование, "_");
	Возврат ?(НомерСимвола > 0, Число(Прав(Наименование, СтрДлина(Наименование) - НомерСимвола)), Неопределено);
	
КонецФункции

// Процедура - Удалить картинку
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура УдалитьКартинку(Команда)
	
	Индекс = ПолучитьИндексИмениЭлемента(ЭтаФорма.ТекущийЭлемент.Имя);
	
	Если Индекс = 7 Тогда
		МассивФайловКартинок = ПолучитьВсеПодчиненныеФайлы(Объект.Ссылка, "ЛоготипМагазина");
		ФайлКартинки		 = ?(МассивФайловКартинок.Количество() > 0, МассивФайловКартинок[0], Неопределено);
	Иначе
		ФайлКартинки = ЭтотОбъект.ФайлыКартинок.Получить(Индекс - 1).Значение;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФайлКартинки) Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВопросОбУдаленииКартинкиЗавершение", ЭтотОбъект, ФайлКартинки);
	ПоказатьВопрос(Оповещение, "Вы действительно хотите удалить картинку?", РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

// Процедура - Вопрос об удалении картинки завершение
//
// Параметры:
//  Результат	 - 	 - 
//  ФайлКартинки - 	 - 
//
&НаКлиенте
Процедура ВопросОбУдаленииКартинкиЗавершение(Результат, ФайлКартинки) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВопросОбУдаленииКартинкиЗавершениеНаСервере(ФайлКартинки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Вопрос об удалении картинки завершение на сервере
//
// Параметры:
//  ФайлКартинки - 	 - 
//
Процедура ВопросОбУдаленииКартинкиЗавершениеНаСервере(ФайлКартинки)
	
	ФайлКартинкиОбъект = ФайлКартинки.ПолучитьОбъект();
	ФайлКартинкиОбъект.УстановитьПометкуУдаления(Истина);
	ОтобразитьКартинки();
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
// Процедура, отображает картинки номенклатуры.
//
Процедура ОтобразитьКартинки()
	
	ЭтотОбъект.ФайлыКартинок.Очистить();
	
	МассивФайловКартинок = ПолучитьВсеПодчиненныеФайлы(Объект.Ссылка, "КартинкаЯндексСалон");
	
	Для Индекс = 1 По 6 Цикл
		
		Если МассивФайловКартинок.Количество() >= Индекс Тогда
			ФайлКартинки = МассивФайловКартинок[Индекс - 1];
			ЭтотОбъект["АдресКартинки" + Индекс] = ПолучитьНавигационнуюСсылкуКартинки(ФайлКартинки, ЭтаФорма.УникальныйИдентификатор);
			ЭтотОбъект.ФайлыКартинок.Добавить(ФайлКартинки);
		КонецЕсли;
		
		Элементы["ПолеКартинки_" + Индекс].Видимость = МассивФайловКартинок.Количество() >= Индекс;
		
	КонецЦикла;
	
	Элементы.ГруппаКнопкиДобавитьКартинку.Видимость = (ЭтотОбъект.ФайлыКартинок.Количество() <= 5);
	
	ГруппаРодитель = ?(ЭтотОбъект.ФайлыКартинок.Количество() > 2, Элементы.ГруппаСтрокаСКартинками_2, Элементы.ГруппаСтрокаСКартинками_1);
	Элементы.Переместить(Элементы.ГруппаКнопкиДобавитьКартинку, ГруппаРодитель);

	МассивФайловКартинок = ПолучитьВсеПодчиненныеФайлы(Объект.Ссылка, "ЛоготипМагазина");
	МассивФайловКартинокЗаполнен = МассивФайловКартинок.Количество() > 0;
	Если МассивФайловКартинокЗаполнен Тогда
		ЭтотОбъект.ЛоготипМагазина = ПолучитьНавигационнуюСсылкуКартинки(МассивФайловКартинок[0], ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	Элементы.ПолеКартинки_7.Видимость	      = МассивФайловКартинокЗаполнен;
	Элементы.ГруппаДобавитьЛого.Видимость = НЕ МассивФайловКартинокЗаполнен;
	
КонецПроцедуры

// Процедура - Сохранить как
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура СохранитьКак(Команда)
	
	Индекс = ПолучитьИндексИмениЭлемента(ЭтаФорма.ТекущийЭлемент.Имя);
	
	Если Индекс = 7 Тогда
		МассивФайловКартинок = ПолучитьВсеПодчиненныеФайлы(Объект.Ссылка, "ЛоготипМагазина");
		ФайлКартинки		 = ?(МассивФайловКартинок.Количество() > 0, МассивФайловКартинок[0], Неопределено);
	Иначе
		ФайлКартинки = ЭтотОбъект.ФайлыКартинок.Получить(Индекс - 1).Значение;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФайлКартинки) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеФайла = ПолучитьДанныеФайла(ФайлКартинки, УникальныйИдентификатор);
	Если ДанныеФайла <> Неопределено Тогда 	
		РаботаСФайламиСлужебныйКлиент.СохранитьКак(Неопределено, ДанныеФайла, УникальныйИдентификатор);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
// Функция возвращает навигационную ссылку картинки
//
Функция ПолучитьНавигационнуюСсылкуКартинки(ФайлКартинки, ИдентификаторФормы)
	
	СсылкаНаДвоичныеДанные = РаботаСФайламиВызовСервераСтоматология.СсылкаНаДвоичныеДанныеФайла(ФайлКартинки, ИдентификаторФормы);
	Возврат ?(СсылкаНаДвоичныеДанные = Неопределено, "", СсылкаНаДвоичныеДанные);
	
КонецФункции

// Процедура - Добавить логотип
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура ДобавитьЛоготип(Команда)
	
	# Если НЕ ВебКлиент Тогда
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Оповещение = Новый ОписаниеОповещения("ВопросОЗаписиОбъектаЗавершение", ЭтотОбъект, Новый Структура("Описание", "ЛоготипМагазина"));
			ПоказатьВопрос(Оповещение, "Для продолжения операции необходимо записать элемент, записать?", РежимДиалогаВопрос.ДаНет);
		Иначе
			ВставитьИзФайлаОбработка("ЛоготипМагазина");
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения 
Процедура ВопросОЗаписиОбъектаЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВставитьИзФайлаОбработка(Параметры.Описание);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Вставить из файла обработка
//
// Параметры:
//  Описание - 	 - 
//
Процедура ВставитьИзФайлаОбработка(Описание)
	
	ИдентификаторФайла = Новый УникальныйИдентификатор;
	
	Фильтр = НСтр("ru = 'Все картинки (*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf)|*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf"
	+ "|Все файлы(*.*)|*.*"
	+ "|Формат bmp(*.bmp*;*.dib;*.rle)|*.bmp;*.dib;*.rle"
	+ "|Формат GIF(*.gif*)|*.gif"
	+ "|Формат JPEG(*.jpeg;*.jpg)|*.jpeg;*.jpg"
	+ "|Формат PNG(*.png*)|*.png"
	+ "|Формат TIFF(*.tif)|*.tif"
	+ "|Формат icon(*.ico)|*.ico"
	+ "|Формат метафайл(*.wmf;*.emf)|*.wmf;*.emf'");
	
	РаботаСФайламиКлиент.ДобавитьФайлы(Объект.Ссылка, ИдентификаторФайла, Фильтр,,, Описание);
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить записать параметры внешней системы
//
Процедура ЗаполнитьЛогоСЕВРезерви()
	
	Попытка
		Соединение = Новый HTTPСоединение("reservi.ru/4.0/",);
		
		УИД = СтрЗаменить(Объект.Ссылка.УникальныйИдентификатор(), "-", "");
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("salons[]", УИД);
		Заголовки.Вставить("Content-Type","application/json");
		Заголовки.Вставить("state", "fastinit");
		Заголовки.Вставить("ver", "2.053");
		Запрос = Новый HTTPЗапрос("https://reservi.ru/4.0/?salons%5B%5D=" + УИД + "&state=fastinit&ver=2.053");
		
		Результат = Соединение.Получить(Запрос);
		ТекстJSON  = Результат.ПолучитьТелоКакСтроку(); 
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстJSON);
		ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON, Истина );
		ИнфоОСТруктурнойЕдинице = Новый Соответствие;
		ИнфоОСТруктурнойЕдинице = ПараметрыJSON.Получить("data");
		ИнфоОСуществовании = Новый Соответствие;
		ИнфоОСуществовании = ИнфоОСТруктурнойЕдинице.Получить("fastinit");
		
		Если Тип(ИнфоОСуществовании) <> Тип("Массив") Или ИнфоОСуществовании.Количество() = 0  Тогда
			
			ИспользуемыеСтруктурныеЕдиницы = Новый Массив;
			ИспользуемыеСтруктурныеЕдиницы.Добавить(Объект.Ссылка);
			
			ВнешняяСистемаReservi		= Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.ВиджетОнлайнЗаписи);
			ПараметрыВнешнейСистемы 	= ВнешняяСистемаReservi.Параметры.Получить();
			МассивФайловКартинок 		= ПолучитьВсеПодчиненныеФайлы(Объект.Ссылка, "ЛоготипМагазина");
			ФайлКартинки		 		= ?(МассивФайловКартинок.Количество() > 0, МассивФайловКартинок[0], Неопределено);
			
			Если ЗначениеЗаполнено(ФайлКартинки) Тогда
				
				ЛичныйКабинет.РегистрацияСтруктурныхЕдиницВиджета(ИспользуемыеСтруктурныеЕдиницы);
				
			КонецЕсли;
			
		КонецЕсли;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ДобавитьКартинку".
//
Процедура ДобавитьКартинку(Команда)
	
	# Если НЕ ВебКлиент Тогда
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Оповещение = Новый ОписаниеОповещения("ВопросОЗаписиОбъектаЗавершение", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, "Для продолжения операции необходимо записать элемент, записать?", РежимДиалогаВопрос.ДаНет);
		Иначе
			ВставитьИзФайлаОбработка("КартинкаЯндексСалон");
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
// Процедура - удаляет выбранную рубрику.
//
Процедура УдалитьРубрику(Команда)										
	
	УдалитьЭлементыНаСервере(Команда.Имя);
	
КонецПроцедуры

&НаСервере
// Процедура - удаляет рубрику и перестраивает динамические элементы.
//
Процедура УдалитьЭлементыНаСервере(ИмяКоманды)
	
	ИндексСтроки = СтрРазделить(ИмяКоманды,"_")[1];
	ЯндексИдентификаторРубрики.Удалить(ИндексСтроки);
	УдалитьДинамическиеЭлементы(Элементы.ГруппаРубрики, Элементы.ГруппаРубрика_Шаблон);
	ПостроитьДинамическиеЭлементы();
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
// Процедура - включает и отключает использавание Яндекс карт.
//
Процедура ИспользоватьЯндексКартыПриИзменении(Элемент)
	
	Элементы.ГруппаЯндексИдентификаторРубрики.Видимость		= Объект.ИспользоватьЯндексКарты;
	Если Объект.ИспользоватьЯндексКарты Тогда
		Наименование = Истина;
		ЭтотОбъект.УидСессии = ЛичныйКабинет.УидТекущейСессии();
		ПолучитьНастройкиЯндексКарты(Наименование);
	КонецЕсли
	
КонецПроцедуры

&НаСервере
// Процедура - получает данные по Яндекс картам.
//
Процедура ПолучитьНастройкиЯндексКарты(Наименование)
	
	НастройкиЯндексКарты 							= Объект.Ссылка.НастройкиЯндексКарты.Получить();
	
	Если НастройкиЯндексКарты <> Неопределено Тогда
		
		УИДОрганизации = Новый УникальныйИдентификатор(?(ЗначениеЗаполнено(НастройкиЯндексКарты.Организация), НастройкиЯндексКарты.Организация, "00000000-0000-0000-0000-000000000000"));
		Организация = Справочники.Организации.ПолучитьСсылку(УИДОрганизации);
		ЭтотОбъект.ЯндексНаименованиеОрганизации = Организация;
		НастройкиЯндексКарты.Свойство("УникальныйНеизменныйИдентификатор"	, ЯндексУникальныйНеизменныйИдентификатор);
		НастройкиЯндексКарты.Свойство("Салон"								, ЯндексНаименованиеСалона);
		НастройкиЯндексКарты.Свойство("Страна"								, ЯндексСтрана);
		НастройкиЯндексКарты.Свойство("ОГРН"								, ЯндексОГРН);
		НастройкиЯндексКарты.Свойство("ИНН"									, ЯндексИНН);
		НастройкиЯндексКарты.Свойство("ДопАдрес"	   						, ЯндексДополнительнаяИнформацияКАдресу);
		НастройкиЯндексКарты.Свойство("Адрес"								, ЯндексАдрес);
		НастройкиЯндексКарты.Свойство("Сайт"								, ЯндексСайт);
		НастройкиЯндексКарты.Свойство("ДополнительныйСайт"					, ЯндексДополнительныйСайт);
		НастройкиЯндексКарты.Свойство("КоординатыПоДолготе"					, ЯндексКоординатыПоДолготе);
		НастройкиЯндексКарты.Свойство("КоординатыПоШироте"					, ЯндексКоординатыПоШироте);
		НастройкиЯндексКарты.Свойство("СсылкаНаФото"						, ЯндексСсылкаНаФото);
		НастройкиЯндексКарты.Свойство("ИдентификаторРубрики"				, ЯндексИдентификаторРубрики);
		НастройкиЯндексКарты.Свойство("ЧасыРаботы"							, ЯндексЧасыРаботы);
		НастройкиЯндексКарты.Свойство("ДатаАктуализации"					, ЯндексДатаАктуализации);
		НастройкиЯндексКарты.Свойство("КороткийАдрес"						, ЯндексКороткийАдрес);
		
		УдалитьДинамическиеЭлементы(Элементы.ГруппаРубрики, Элементы.ГруппаРубрика_Шаблон);
		ПостроитьДинамическиеЭлементы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - удаляет динамические элементы.
//
Процедура УдалитьДинамическиеЭлементы(ГруппаДляУдаления, ШаблонГруппы)
	
	МассивУдаляемых = Новый Массив;
	
	Для Каждого ЭлементГруппы Из ГруппаДляУдаления.ПодчиненныеЭлементы Цикл
		Если ЭлементГруппы <> ШаблонГруппы Тогда
			МассивУдаляемых.Добавить(ЭлементГруппы);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементФормы Из МассивУдаляемых Цикл
		Элементы.Удалить(ЭлементФормы);  
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура - создает динамические элементы.
//
Процедура ПостроитьДинамическиеЭлементы()
	
	Счетчик = 0;
	Для Каждого СтрокаТ Из ЯндексИдентификаторРубрики Цикл
		
		ГруппаФормы				 			= УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(ЭтаФорма, Элементы.ГруппаРубрика_Шаблон, Счетчик, Элементы.ГруппаРубрики);
		ДекорацияФормы			 			= УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(ЭтаФорма, Элементы.ДекорацияРубрика_Шаблон, Счетчик,, ГруппаФормы); 
		КнопкаФормы				 			= УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(ЭтаФорма, Элементы.УдалитьРубрику_Шаблон, Счетчик, ГруппаФормы); 
		Если СтрДлина(СтрокаТ.Представление) > 31 Тогда
			ДекорацияФормы.Ширина			= 17;
			// ДекорацияФормы.Высота			= 1;
		КонецЕсли;
		ДекорацияФормы.Заголовок 			= СтрокаТ.Представление;
		КнопкаФормы.Доступность				= ПравоДоступа("Редактирование", Метаданные.Справочники.СтруктурныеЕдиницы);

		Счетчик 							= Счетчик + 1;
		
	КонецЦикла;
	Элементы.КомандаПодобратьИдентификаторРубрики.Доступность = ПравоДоступа("Редактирование", Метаданные.Справочники.СтруктурныеЕдиницы);
	Если ЯндексИдентификаторРубрики.Количество() = 3 Тогда
		Элементы.КомандаПодобратьИдентификаторРубрики.Видимость = Ложь;
	Иначе
		Элементы.КомандаПодобратьИдентификаторРубрики.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - подбирает идентификаторы рубрик.
//
Процедура КомандаПодобратьИдентификаторРубрики(Команда)
	
	Если ЯндексИдентификаторРубрики.Количество() = 3 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя выбирать больше трех рубрик!");
	Иначе
		ОткрытьФорму("Справочник.СтруктурныеЕдиницы.Форма.ФормаВыбораИдентификатораРубрики");
	КонецЕсли;
	 
КонецПроцедуры

&НаСервере 
// Процедура - получает идентификатор рубрики из временного хранилища.
//
Процедура ПолучитьИдентификаторИзХранилища(АдресВХранилище)
	
	НастройкиЯндексКарты = Объект.Ссылка.НастройкиЯндексКарты.Получить();
	ЭтаФорма.Модифицированность = Истина;

	Для Счетчик = ЯндексИдентификаторРубрики.Количество() по 2 Цикл
		
		Если ЯндексИдентификаторРубрики.Количество() = Счетчик Тогда
			Стр 						= ЯндексИдентификаторРубрики.Добавить();
			Стр.Значение 				= АдресВХранилище;
			Стр.Представление           = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(АдресВХранилище, "_")[1];
			ИД 							= Стр.ПолучитьИдентификатор(); 
			УдалитьДинамическиеЭлементы(Элементы.ГруппаРубрики, Элементы.ГруппаРубрика_Шаблон);
			ПостроитьДинамическиеЭлементы();
			Возврат
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ЭтоЗаписьВЦРМ Тогда
		ОтправитьВЦРМ();
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура, - отправляет данные в CRM.
//
Процедура ОтправитьВЦРМ()
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("session"				, ЛичныйКабинет.УидТекущейСессии());
	ПараметрыЗапроса.Вставить("structuralunit"		, СтрЗаменить(Строка(Объект.Ссылка.УникальныйИдентификатор()), "-", ""));
	ПараметрыЗапроса.Вставить("name"				, Строка(Объект.Организация));
	ПараметрыЗапроса.Вставить("yandexadress"		, ЭтаФорма.ЯндексАдрес);
	ПараметрыЗапроса.Вставить("yandexaddadress"		, ЭтаФорма.ЯндексДополнительнаяИнформацияКАдресу);
	ПараметрыЗапроса.Вставить("yandexaddsite"		, НРег(ЭтаФорма.ЯндексДополнительныйСайт));
	ПараметрыЗапроса.Вставить("yandexinn"			, Объект.Организация.ИНН);
	ПараметрыЗапроса.Вставить("yandexdolgota"		, ЭтаФорма.ЯндексКоординатыПоДолготе);
	ПараметрыЗапроса.Вставить("yandexshirota"		, ЭтаФорма.ЯндексКоординатыПоШироте);
	ПараметрыЗапроса.Вставить("yandexsalon"			, ЭтаФорма.ЯндексСтруктурнаяЕдиница);
	ПараметрыЗапроса.Вставить("yandexogrn"			, Объект.Организация.ОГРН);
	ПараметрыЗапроса.Вставить("yandexsite"			, НРег(ЭтаФорма.ЯндексСайт));
	ПараметрыЗапроса.Вставить("yandexfoto"			, НРег(ЭтаФорма.ЯндексСсылкаНаФото));
	ПараметрыЗапроса.Вставить("yandexstrana"		, Строка(Константы.СтранаУчета.Получить()));
	ПараметрыЗапроса.Вставить("yandextime"			, ЭтаФорма.ЯндексЧасыРаботы);
	ПараметрыЗапроса.Вставить("yandexdata"			, ЭтаФорма.ЯндексДатаАктуализации);
	ПараметрыЗапроса.Вставить("yandexgorod"			, ЭтаФорма.ЯндексГород);
	ПараметрыЗапроса.Вставить("yandexstatus"		, Объект.ИспользоватьЯндексКарты);
	ПараметрыЗапроса.Вставить("yandexkey"			, ЭтаФорма.ЯндексКлючВнешнейСистемы);
	ПараметрыЗапроса.Вставить("yandexobl"			, ЭтаФорма.ЯндексНомерОбласти);
	ПараметрыЗапроса.Вставить("yandexstructura"		, ЭтаФорма.ЯндексСтруктурнаяЕдиница);
	ПараметрыЗапроса.Вставить("yandexshortadres"	, ЭтаФорма.ЯндексКороткийАдрес);
	ПараметрыЗапроса.Вставить("yandextip"			, "2");   // 0 - Салон красоты, 1 - Фитнес, 2 - Стоматология

	 
	МассивЯндексРубрик = Новый Массив;
	Для Каждого СтрокаТ Из ЯндексИдентификаторРубрики Цикл
		МассивЯндексРубрик.Добавить(СтрокаТ.Значение);	
	КонецЦикла;
	ПараметрыЗапроса.Вставить("yandexrubrika" , МассивЯндексРубрик);
	
	МассивКартинок = Новый Массив;
	Для Каждого СтрокаТ Из ЭтаФорма.ФайлыКартинок Цикл
		МассивКартинок.Добавить(СтрокаТ.Представление);	
	КонецЦикла;
	ПараметрыЗапроса.Вставить("yandexkartinki" , МассивКартинок);
	
	МассивТелефонов = Новый Массив;
	Для Каждого СтрокаТ Из ЯндексНомерТелефона Цикл
		
		СтруктураСтроки = Новый Структура("НомерТелефона, ДобавочныйНомер, ЧейНомер");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаТ);
		МассивТелефонов.Добавить(СтруктураСтроки);
		
	КонецЦикла;
		
	ПараметрыЗапроса.Вставить("yandextelsp"		, МассивТелефонов);
	
	МассивЯндексЭлПочты = Новый Массив;
	Для Каждого СтрокаТ Из ЯндексЭлектроннаяПочта Цикл
		МассивЯндексЭлПочты.Добавить(СтрокаТ.Значение);	
	КонецЦикла;
	ПараметрыЗапроса.Вставить("yandexmailsp" , МассивЯндексЭлПочты);
	
	МассивЯндексСоциальныеСети = Новый Массив;
	Для Каждого СтрокаТ Из ЯндексСоциальныеСети Цикл
		МассивЯндексСоциальныеСети.Добавить(СтрокаТ.Значение);	
	КонецЦикла;
	ПараметрыЗапроса.Вставить("yandexsitesp" , МассивЯндексСоциальныеСети);
	
	РезультатЗапроса = ЛичныйКабинет.ОтправитьДанныеЯндексКартыВCRM(ПараметрыЗапроса);
	
КонецПроцедуры	

&НаКлиенте
// Процедура - Онлайн запись по ссылке нажатие
//
// Параметры:
//  Элемент				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОнлайнЗаписьПоСсылкеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ЭтотОбъект.ОнлайнЗаписьПоСсылке) Тогда
		ПерейтиПоНавигационнойСсылке(ЭтотОбъект.ОнлайнЗаписьПоСсылке);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - Записать в журнал регистрации
//
// Параметры:
//  ИмяСобытия					 - 	 - 
//  УровеньЖурналаРегистрации	 - 	 - 
//
Процедура ЗаписатьВЖурналРегистрации(ИмяСобытия)
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка);	
КонецПроцедуры

&НаСервере
// Процедура - Обновить данные ссылки на онлайн запись
//
// Параметры:
//  ИндексЭлемента	 - 	 - 
//
Процедура ОбновитьДанныеСсылкиНаОнлайнЗапись(ИндексЭлемента)

	УстановитьВидимостьПереключателя(ИндексЭлемента);

	УИДДляСсылки = "";
	Если ИндексЭлемента = "1" Тогда
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект.УИДОрганизацииРезерви) Тогда
			Попытка
				
				org_id = ЛичныйКабинет.ПолучитьУИДИнформационнойБазы();
				
				ПараметрыЗапроса = Новый Структура("organizations", Новый_Массив(org_id));
				РезультатЗапроса = ЛичныйКабинет.ВыполнитьPOSTЗапросВReservi("get_org_id", ПараметрыЗапроса);
				
				ТекстJSON		 = РезультатЗапроса.ПолучитьТелоКакСтроку();					
				
				Если ЗначениеЗаполнено(ТекстJSON) Тогда
					
					ЧтениеJSON = Новый ЧтениеJSON;
					ЧтениеJSON.УстановитьСтроку(ТекстJSON);
					ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON, Истина);
					
					Если ЗначениеЗаполнено(ПараметрыJSON) И ТипЗнч(ПараметрыJSON) = Тип("Соответствие") Тогда
						ЭтотОбъект.УИДОрганизацииРезерви = ПараметрыJSON[org_id].Получить("ID");
					КонецЕсли;
					
				КонецЕсли;
			
			Исключение   	
			КонецПопытки;
		КонецЕсли;
		
		УИДДляСсылки = ЭтотОбъект.УИДОрганизацииРезерви;
		ЭтотОбъект.ОнлайнЗаписьПоСсылке	= "https://stoma1c.ru/widget-org/" + УИДДляСсылки;
		
	Иначе      
		
		Если ЗначениеЗаполнено(Объект.УникальныйИдентификаторСтруктурнойЕдиницы) Тогда 
			УИДСтрокой = Объект.УникальныйИдентификаторСтруктурнойЕдиницы;
		Иначе
			УИДСтрокой = Строка(Объект.Ссылка.УникальныйИдентификатор());
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ЭтотОбъект.УИДКлиникиРезерви) Тогда
			Попытка
				
				Соединение 		 = Новый HTTPСоединение("reservi.ru/4.0/?salons%5B%5D=" + УИДСтрокой + "&state=fastinit&ver=2.053",,,,,1, Новый ЗащищенноеСоединениеOpenSSL());
				ЗапросHTTP       = Новый HTTPЗапрос();
				РезультатЗапроса = Соединение.Получить(ЗапросHTTP);
				ТекстJSON		 = РезультатЗапроса.ПолучитьТелоКакСтроку();					
				
				Если ЗначениеЗаполнено(ТекстJSON) Тогда  
					
					ЧтениеJSON = Новый ЧтениеJSON;
					ЧтениеJSON.УстановитьСтроку(ТекстJSON);
					ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON, Истина);
					
					data 			 = ПараметрыJSON.Получить("data");
					fastinit 		 = data.Получить("fastinit");
					
					Если ТипЗнч(fastinit) = Тип("Соответствие") И fastinit.Количество() > 0 Тогда
						ЭтотОбъект.УИДКлиникиРезерви = fastinit[УИДСтрокой].Получить("ID");
					КонецЕсли;   
					
				КонецЕсли;
			
			Исключение   	
			КонецПопытки;
		КонецЕсли; 
		
		УИДДляСсылки = ЭтотОбъект.УИДКлиникиРезерви;
		ЭтотОбъект.ОнлайнЗаписьПоСсылке	= "https://reservi.ru/stoma1c/" + УИДСтрокой; 
	КонецЕсли;
	
	КодОнлайнЗаписи = "<script src=""//reservi.ru/4.0/" + УИДДляСсылки + "/""></script>";
	ЭтотОбъект.КодДляУстановкиОнлайнЗаписи = КодОнлайнЗаписи;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить видимость переключателя для отображения ссылок
//
// Параметры:
//  ИндексЭлемента	 - 	 - 
//
Процедура УстановитьВидимостьПереключателя(ИндексЭлемента)
	
	// Убираем выделение групп.
	Для каждого Группа Из Элементы.ГруппаПереключательСтруктурныхЕдиниц.ПодчиненныеЭлементы Цикл
		Группа.ЦветФона = Новый Цвет(242, 242, 242);
		Для каждого Кнопка Из Группа.ПодчиненныеЭлементы Цикл
			Кнопка.ЦветТекста = Новый Цвет(77, 77, 77);
		КонецЦикла;
	КонецЦикла;
	
	// Устанавливаем выделение выбранной группы метода авторизации.
	Элементы["ГруппаПереключатель_" + ИндексЭлемента].ЦветФона = Новый Цвет(25 , 116, 206);
	Элементы["ПереключитьСтраницуОнлайнЗаписи_" + ИндексЭлемента].ЦветТекста = Новый Цвет(255, 255, 255);   
	
КонецПроцедуры

&НаСервере
// Процедура, обновляет элементы дополнительных реквизитов.
//
Процедура ОбновитьДополнительныеРеквизиты()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры // ОбновитьЭлементыДополнительныхРеквизитов()

#КонецОбласти 
