
&НаКлиенте
Перем ОткатВыбранногоЗначения; // Перем - Будет содержать текст кода выполняющего откат выбранного значения в отборе
&НаКлиенте
Перем НомерДняНеделиДляУдаления; // Перем - Номер дня недели для которого производится удаление
&НаСервере
Перем СтартовыйИндексЦиклаПодбораНедельногоБуфера; // Перем - Переменная для оптимизации скорости работы цикла
&НаКлиенте
Перем ПроверятьНеобхЗаписи;
&НаКлиенте
Перем ЭтоОчистка;
&НаКлиенте
Перем ВремяРаботыСтруктурнойЕдиницы;
&НаКлиенте
Перем ИдТекущегоЭлементаHTML;
&НаКлиенте
Перем ДатаТекущегоЭлементаHTML;

#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик при создании формы на сервере
// 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.ОтборСтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	
	Элементы.ОткрытьСписокСалоны.Заголовок = Строка(ОтборСтруктурнаяЕдиница);
	
	Параметры.Свойство("ОтборСотрудник"				  , ЭтотОбъект.ОтборСотрудник);
	Параметры.Свойство("ПерейтиГрафикРаботыСотрудника", ЭтотОбъект.ПерейтиГрафикРаботыСотрудника);
	
	Элементы.ОтборСотрудник.Видимость = НЕ ЗначениеЗаполнено(ЭтотОбъект.ОтборСотрудник);
	Элементы.ПраваяКолонка.Заголовок  = ?(ЭтотОбъект.ПерейтиГрафикРаботыСотрудника, "Клиника", "Сотрудник");
	
	СформироватьЗаголовокГруппыОтборовИФормы();
	
	// Получаем массив номеров рабочих дней недели для СЕ	
    ОбновитьМассивРабочихДнейВНеделе();

	// Заполнение спсика быстрого выбора закешированными данными	
	ЗакешированныеЗначения = ХранилищеСистемныхНастроек.Загрузить("КешированиеВводимыхЗначений", "ИнтервалыВремени");
	Если ЗакешированныеЗначения <> Неопределено Тогда
		
		Для Каждого ЭлементМ ИЗ ЗакешированныеЗначения Цикл
			
			Если ЗначениеЗаполнено(ЭлементМ) Тогда
				
				ПредставлениеИнтервала = ПредставлениеИнтервалаВремени(ЭлементМ);
				Если ПредставлениеИнтервала = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				СписокШаблонов.Добавить(ЭлементМ, Новый ФорматированнаяСтрока(ПредставлениеИнтервала, Новый Шрифт("Arial",10)),, БиблиотекаКартинок.РейтингЗвездаЗаполненная);
				Элементы.ИнтервалыРаботыПредст.СписокВыбора.Добавить(ЭлементМ,Новый ФорматированнаяСтрока(ПредставлениеИнтервала, Новый Шрифт("Arial",10)));
				
				Если Элементы.ИнтервалыРаботыПредст.СписокВыбора.Количество() = 10 Тогда
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Добавим первую пустую неудаляемую строку интервала 
	ОтборИнтервалыРаботы.Добавить(Новый Структура("НачалоРаботы, ОкончаниеРаботы", Неопределено, Неопределено));
	// Отобразим интервалы на форме
	ОбновитьМенюОтбораИнтерваловРабот();
	Элементы.КомандаСвернуть.Пометка = Истина;    
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();

КонецПроцедуры

&НаКлиенте
// Обработчик открытия формы
// 
Процедура ПриОткрытии(Отказ)
	
	ПроверятьНеобхЗаписи 	= Истина;
	ЭтоОчистка 				= Ложь;
	Если НЕ ЗначениеЗаполнено(ОтборПериод) Тогда 
		ОтборПериод.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
	КонецЕсли;
	
	ИнформацияЭкрана = ПолучитьИнформациюЭкрановКлиента();
	
	Если ИнформацияЭкрана.Количество()>0 Тогда
		Для каждого Параметр из ИнформацияЭкрана Цикл
			Строка = РазрешениеЭкрана.Добавить();
			Строка.Ширина = Параметр.Ширина;
			Строка.Высота = Параметр.Высота;
		КонецЦикла;
	КонецЕсли;
	
	ВремяРаботыСтруктурнойЕдиницы = ВернутьВремяРаботыСтруктурнойЕдиницы(ОтборСтруктурнаяЕдиница);
	
	ОбновитьОтображениеПланирования(Истина);
	
	ПодключитьОбработчикОжидания("ПроверитьАктивныеОповещенияГрафикаРаботыСотрудников", 10);
	
КонецПроцедуры

&НаКлиенте
// Обработчик оповещения формы о внешнем событии
// 
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПРИ_ЗАПИСИ_СТРУКТУРНОЙ_ЕДИНИЦЫ" Тогда
		// Получаем массив номеров рабочих дней недели для СЕ
        ОбновитьМассивРабочихДнейВНеделе();
		ОбновитьОтображениеПланирования(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик перед закрытием формы
// 
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда 
		Возврат;
	КонецЕсли;
	
	Если ПроверятьНеобхЗаписи = Истина И ПроверитьНеобходимостьФиксацииИзмененийВПлане() = Истина Тогда	
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаОЗаписиИзмененийОповещение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение,"Имеются несохраненные изменения графика работы. Записать изменения ?", РежимДиалогаВопрос.ДаНетОтмена);
		ПроверятьНеобхЗаписи = Ложь;
		Отказ = Истина;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Обработка выбора для полей отборов
// 
Процедура ПараметрОтбораОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	// Делаем бэкап значения поля
	ОткатВыбранногоЗначения = ЭтаФорма[Элемент.Имя];
	ЭтотОбъект.ОтборСтруктурнаяЕдиница = ВыбранноеЗначение;
	
	Если ПерейтиГрафикРаботыСотрудника = Ложь Тогда 
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ОтборСтруктурнаяЕдиница) Тогда
			ЭтотОбъект.ОтборСотрудник = Неопределено;
			ОбновитьОтображениеПланирования(Истина);
		Иначе
			ДоступныДляВыбора = ПолучитьСотрудниковСтруктурнойЕдиницы(ЭтотОбъект.ОтборСтруктурнаяЕдиница);
			Если ДоступныДляВыбора.Найти(ЭтотОбъект.ОтборСотрудник) = Неопределено Тогда
				ЭтотОбъект.ОтборСотрудник = Неопределено;
			КонецЕсли; 
			ОбновитьОтображениеПланирования(Истина);
		КонецЕсли;
		
	Иначе
		ОбновитьОтображениеПланирования(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик при изменении для всех полей отбора
// 
Процедура ПараметрОтбораПриИзменении(Элемент)
	
	ОтборСтруктурнаяЕдиница = Неопределено;
	
	Если ЭтоОчистка И Элемент.Имя = "ОтборПериод" Тогда 
		Возврат;
	КонецЕсли;
	
	Если ПроверитьНеобходимостьФиксацииИзмененийВПлане() = Истина Тогда
		// КодДляОтката = Элемент.Имя + "= ОткатВыбранногоЗначения;";
		ЭтоОчистка = Ложь;
		СтруктураПарметров = Новый Структура;
		СтруктураПарметров.Вставить("ИмяЭлемента"	, Элемент.Имя);
		СтруктураПарметров.Вставить("КодДляОтката"	, Элемент.Имя + "= ОткатВыбранногоЗначения;");
		Оповещение   = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОФиксацииизменений", ЭтотОбъект, СтруктураПарметров);
		ПоказатьВопрос(Оповещение,"Имеются не сохраненные изменения, они будут потеряны. Продолжить ?",РежимДиалогаВопрос.ДаНет,,,"Планирование");
		Возврат;
	Иначе 	
		ОбновитьОтображениеПланирования(Истина);
	КонецЕсли;
	
	УстановитьДоступностьОтборуИнтервалыРаботы();
	
КонецПроцедуры

&НаКлиенте
// Обработчик начала выбора для поля период
Процедура ОтборПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Делаем бэкап значения поля
	ОткатВыбранногоЗначения = ЭтаФорма[Элемент.Имя];
	
КонецПроцедуры

&НаКлиенте
// Обработчик при изменении выбора СЕ
Процедура ОтборСтруктурнаяЕдиницаПриИзменении(Элемент)
	
	Если ПерейтиГрафикРаботыСотрудника = Ложь Тогда
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ОтборСтруктурнаяЕдиница) Тогда
			ЭтотОбъект.ОтборСотрудник = Неопределено;
			ОбновитьОтображениеПланирования(Истина);
		Иначе
			ДоступныДляВыбора = ПолучитьСотрудниковСтруктурнойЕдиницы(ЭтотОбъект.ОтборСтруктурнаяЕдиница);
			Если ДоступныДляВыбора.Найти(ЭтотОбъект.ОтборСотрудник) = Неопределено Тогда
				ЭтотОбъект.ОтборСотрудник = Неопределено;
				ОбновитьОтображениеПланирования(Истина);
			КонецЕсли; 
		КонецЕсли;
		
	Иначе
		ОбновитьОтображениеПланирования(Истина);
	КонецЕсли;
 
КонецПроцедуры

&НаКлиенте
// При очистки выбора СЕ
Процедура ОтборСтруктурнаяЕдиницаОчистка(Элемент, СтандартнаяОбработка)
	
	Если ПерейтиГрафикРаботыСотрудника = Ложь Тогда
	    ЭтотОбъект.ОтборСотрудник = Неопределено;
    КонецЕсли;	
	ОбновитьОтображениеПланирования(Истина);
	
КонецПроцедуры

&НаКлиенте
// Обработчик начала выбора сотрудника
Процедура ОтборСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь;
	 
	 Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ОтборСтруктурнаяЕдиница) Тогда
		ПоказатьПредупреждение(, "Для начала выберите клинику!");
		Возврат;
	 КонецЕсли;
		 	 
	 ДоступныДляВыбора = ПолучитьСотрудниковСтруктурнойЕдиницы(ЭтотОбъект.ОтборСтруктурнаяЕдиница);
	 ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", Новый Структура("Отбор", Новый Структура("Ссылка", ДоступныДляВыбора)), Элемент);		 
КонецПроцедуры

&НаКлиенте
// Процедура - Отбор сотрудник обработка выбора
// 
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
// 
Процедура ОтборСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОткатВыбранногоЗначения =  ЭтотОбъект.ОтборСотрудник; 
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		 ЭтотОбъект.ОтборСотрудник = ВыбранноеЗначение;
	 КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Обработчик перед удалением значения для полей отбора
Процедура ПараметрОтбораОчистка(Элемент, СтандартнаяОбработка)
	
	// Делаем бэкап значения поля
	ОткатВыбранногоЗначения = ЭтаФорма[Элемент.Имя];
	
	Если ПроверитьНеобходимостьФиксацииИзмененийВПлане() = Истина Тогда
		// КодДляОтката = Элемент.Имя + "= ОткатВыбранногоЗначения;";
		ЭтоОчистка = Истина;
		СтруктураПарметров = Новый Структура;
		СтруктураПарметров.Вставить("ИмяЭлемента"	, Элемент.Имя);		
		СтруктураПарметров.Вставить("КодДляОтката"	, Элемент.Имя + "= ОткатВыбранногоЗначения;");
		Оповещение   = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОФиксацииизменений", ЭтотОбъект, СтруктураПарметров);
		ПоказатьВопрос(Оповещение,"Имеются не сохраненные изменения, они будут потеряны. Продолжить ?",РежимДиалогаВопрос.ДаНет,,,"Планирование");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Отбор сотрудник авто подбор
// 
// Параметры:
//  Элемент					 - 	 - 
//  Текст					 - 	 - 
//  ДанныеВыбора			 - 	 - 
//  ПараметрыПолученияДанных - 	 - 
//  Ожидание				 - 	 - 
//  СтандартнаяОбработка	 - 	 - 
// 
Процедура ОтборСотрудникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ОтборСтруктурнаяЕдиница) Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	ДоступныДляВыбора = ПолучитьСотрудниковСтруктурнойЕдиницы(ЭтотОбъект.ОтборСтруктурнаяЕдиница);
	ПараметрыПолученияДанных.Отбор.Вставить("Ссылка", ДоступныДляВыбора);
КонецПроцедуры

&НаКлиенте
// Процедура - Интервалы работы предст начало выбора
// 
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеВыбора		 - 	 - 
//  СтандартнаяОбработка - 	 - 
// 
Процедура ИнтервалыРаботыПредстНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПарамФормы = Новый Структура("ДатаДня, ИнтервалыРаботы", Дата(2001,01,ДеньНедели(ОтборПериод.ДатаНачала)), ОтборИнтервалыРаботы);
	Оповещение = Новый ОписаниеОповещения("ИнтервалыРаботыПредст_ОкончаниеВыбора", ЭтотОбъект);// , Новый Структура("СтрокаДанных", СтрокаДанных));
	ОткрытьФорму("Обработка.ПланированиеИндивидуальногоГрафика.Форма.ФормаПодбораИнтерваловВремени", ПарамФормы, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Поле время окончание выбора
// 
// Параметры:
//  РезВыбора	 - 	 - 
//  ДопПараметры - 	 - 
// 
Процедура ИнтервалыРаботыПредст_ОкончаниеВыбора(РезВыбора, ДопПараметры) Экспорт	
	
	Если РезВыбора <> Неопределено Тогда
		ОтборИнтервалыРаботы  = РезВыбора;
		ИнтервалыРаботыПредст = ПредставлениеИнтервалавремени(РезВыбора); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Интервалы работы предст обработка выбора
// 
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
// 
Процедура ИнтервалыРаботыПредстОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ВыбранноеЗначение <> Неопределено Тогда
		ОтборИнтервалыРаботы  = ВыбранноеЗначение;
		ИнтервалыРаботыПредст = ПредставлениеИнтервалавремени(ВыбранноеЗначение); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Декорация управления сохранением шаблонов нажатие
// 
// Параметры:
//  Элемент	 - 	 - 
// 
Процедура ДекорацияУправленияСохранениемШаблоновНажатие(Элемент)

	СтруктураСравнения = СписокШаблоновСодержитСтруктуруИнтервалов();
	Если СтруктураСравнения.Успех Тогда 
		// Нажатие означает что необходимо удалить шаблон из списка
		СписокШаблонов.Удалить(СписокШаблонов[СтруктураСравнения.ИндексШаблона]);
		ОбновитьДекорациюУпраленияСохранениемШаблонов();
		СохранитьШаблоныВКеш(СписокШаблонов);		
	ИначеЕсли ЗначениеЗаполнено(СтруктураСравнения.Информация) Тогда
		// Попробывали сохранить - интервалы не заполнены
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураСравнения.Информация, ЭтотОбъект);
		Возврат;
	Иначе 
		// Сохраняем
		СписокШаблонов.Добавить(ОтборИнтервалыРаботы, , , БиблиотекаКартинок.РейтингЗвездаЗаполненная);
		ОбновитьДекорациюУпраленияСохранениемШаблонов();
		СохранитьШаблоныВКеш(СписокШаблонов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - Сохранить шаблоны в кеш
// 
// Параметры:
//  СписокШаблонов	 - 	 - 
// 
Процедура СохранитьШаблоныВКеш(СписокШаблонов)
	
	// Сохраняем список шаблонов
	ХранилищеСистемныхНастроек.Сохранить("КешированиеВводимыхЗначений", "ИнтервалыВремени", СписокШаблонов.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ДокументСформирован".
//
Процедура HTMLПанельПланированияДокументСформирован(Элемент)
	
	Если ЗначениеЗаполнено(ДатаТекущегоЭлементаHTML) Тогда
		
		МассивЭлементовHTML = Элемент.document.getElementsByClassName("ANCHOR_" + Формат(ДатаТекущегоЭлементаHTML,"ДФ='MMyy'"));
		
		Если ЗначениеЗаполнено(МассивЭлементовHTML) И МассивЭлементовHTML.length > 0 Тогда
			МассивЭлементовHTML[0].scrollIntoView();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиСобытийТабличногоДокументаТабДокументПланирования

&НаКлиенте
// Процедура - Проверить вхождение интервалов в график работы СЕ
// 
// Параметры:
//  ВыбраннаяДата	 - 	 - 
// 
Процедура ПроверитьВхождениеИнтерваловВГрафикРаботыСЕ(Знач ВыбраннаяДата)
	
	ВремяРаботыСтруктурнойЕдиницы = ВернутьВремяРаботыСтруктурнойЕдиницы(ОтборСтруктурнаяЕдиница);
	
	Для Каждого ЭлементМ ИЗ ВремяРаботыСтруктурнойЕдиницы Цикл
		Если ДеньНедели(ЭлементМ.ДеньНедели) = ДеньНедели(ВыбраннаяДата) Тогда

			ДатаНачалаРаботыСЕ 		= ЭлементМ.ДатаНачала;
			ДатаОкончанияРаботыСЕ 	= ?(ЭлементМ.ДатаОкончания < ЭлементМ.ДатаНачала, ЭлементМ.ДатаОкончания + 86400, ЭлементМ.ДатаОкончания);
			
			Прервать;
		КонецЕсли;	
	КонецЦикла;			
	
	СписокИнтервалов = Новый СписокЗначений;
	Для Каждого ЭлементПериод Из ОтборИнтервалыРаботы Цикл 
		Если НЕ (ЭлементПериод.Значение.НачалоРаботы < ДатаНачалаРаботыСЕ ИЛИ ЭлементПериод.Значение.ОкончаниеРаботы > ДатаОкончанияРаботыСЕ) Тогда 
        	СписокИнтервалов.Добавить(ЭлементПериод.Значение, ЭлементПериод.Представление);
		КонецЕсли;	
	КонецЦикла;
	
	Если СписокИнтервалов.Количество() = ОтборИнтервалыРаботы.Количество() Тогда 
		ЗаполнитьЭлементПланирования(ВыбраннаяДата, СписокИнтервалов);
	Иначе                                                                         
		Если СписокИнтервалов.Количество() = 0 Тогда 
			СообщениеТекст = "Выбраные интервал(ы) работы не входит(ят) в интервал работы структурной организации в указаный день.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеТекст, ЭтаФорма.КлючУникальности, "ИнтервалыРаботыПредст");
		Иначе                                                            
			СообщениеТекст = "Часть выбранных интервалов работы, указанных в шапке, не входят в интервал работы структурной организации в указаный день.";
			СообщениеТекст = СообщениеТекст + Символы.ПС + Символы.ПС;
			СообщениеТекст = СообщениеТекст + "Добавить только подходящие интервалы работ?";
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("ВыбраннаяДата"	, ВыбраннаяДата);
			СтруктураПараметров.Вставить("СписокИнтервалов"	, СписокИнтервалов);
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, СтруктураПараметров);
			ПоказатьВопрос(Оповещение, СообщениеТекст, РежимДиалогаВопрос.ОКОтмена);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - После закрытия вопроса
// 
// Параметры:
//  РезультатВыбора	 - 	 - 
//  Параметры		 - 	 - 
// 
Процедура ПослеЗакрытияВопроса(РезультатВыбора, ПараметрыЗаполнения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.ОК Тогда		
		ЗаполнитьЭлементПланирования(ПараметрыЗаполнения.ВыбраннаяДата, ПараметрыЗаполнения.СписокИнтервалов);		
	КонецЕсли;
	                             
КонецПроцедуры

&НаКлиенте
// Процедура - После закрытия формы создания оповещение
// 
// Параметры:
//  РезультатПланирования	 - 	 - 
//  ДопПараметры			 - 	 - 
// 
Процедура ПослеЗакрытияФормыСозданияОповещение(Результат, ДопПараметры) Экспорт
	
	НСтроки                = 0;
	ЗадаватьВопрос         = Истина;
	РезультатВопроса       = Неопределено;
	РезультатПланирования  = Неопределено;
	Если ТипЗнч(ДопПараметры) = Тип("Структура")
		И ДопПараметры.Свойство("РезВопроса") Тогда
		
		РезультатВопроса      = Результат;
		РезультатПланирования = ДопПараметры.РезультатПланирования;
		НСтроки               = ДопПараметры.НСтроки;		
		Если ЗначениеЗаполнено(РезультатВопроса) Тогда
			ЗадаватьВопрос = НЕ РезультатВопроса.ДляВсех;
		КонецЕсли;
	Иначе
		РезультатПланирования = Результат;
	КонецЕсли;
	
	Если РезультатПланирования <> Неопределено Тогда
		  		
		// Проверка наложения новых рабочих интервалов, на существующие интервалы
		Пока НСтроки < РезультатПланирования.Количество() Цикл
			
			СтрокаРЗ = РезультатПланирования[НСтроки];
			// Ищем существующее рабочее время на указанную дату
			НайденныеСтроки = БуферФормирования.НайтиСтроки(Новый Структура("Дата, Сотрудник, Операция", СтрокаРЗ.Дата, СтрокаРЗ.Сотрудник, ""));
			Если НайденныеСтроки.Количество() > 0 Тогда
				Для Каждого СтрокаБуфера ИЗ НайденныеСтроки Цикл   					
					Если РезультатВопроса <> Неопределено Тогда
						// Ответ Нет
						Если РезультатВопроса = Неопределено ИЛИ РезультатВопроса.Ответ = КодВозвратаДиалога.Нет Тогда
							РезультатПланирования.Удалить(НСтроки);
							НСтроки = НСтроки - 1;
							
							Если ЗадаватьВопрос = Истина Тогда
								РезультатВопроса = Неопределено;
							КонецЕсли;
							
							Продолжить;
						// Да	
						ИначеЕсли РезультатВопроса.Ответ = КодВозвратаДиалога.Да Тогда
							// Да, Для всех
							Если РезультатВопроса.ДляВсех = Истина Тогда
								НСтроки = РезультатПланирования.Количество();
							КонецЕсли;
							
							Прервать;
						КонецЕсли;
						
						Если ЗадаватьВопрос = Истина Тогда
							РезультатВопроса = Неопределено;
						КонецЕсли;
					Иначе	
						Если ЗадаватьВопрос = Истина Тогда
							// Если это существующее рабочее время, задать вопро о его замене
							ТВопроса = "Для сотрудника " + ПредставлениеЗначенияПараметраЗанятия(СтрокаБуфера, "Сотрудник") 
							+ " уже существует рабочее время на " + ПредставлениеЗначенияПараметраЗанятия(СтрокаБуфера, "ДатаВремяРаботы")
							+ Символы.ПС + Символы.ПС + "Заменить его?"; 
							
							ДопПараметры = Новый Структура("РезВопроса,НСтроки,РезультатПланирования", Истина, НСтроки,РезультатПланирования);
							Оповещение   = Новый ОписаниеОповещения("ПослеЗакрытияФормыСозданияОповещение", ЭтаФорма, ДопПараметры); 
							ОткрытьФорму("Обработка.ПланированиеИндивидуальногоГрафика.Форма.ФормаДиалогаВопроса",Новый Структура("Вопрос",ТВопроса),ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
							Возврат;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;	 	 
			КонецЕсли;
			
			НСтроки = НСтроки + 1;
		КонецЦикла;
		
		ФлагПроверки = Истина;
		Для Каждого СтрокаРЗ Из РезультатПланирования Цикл
			
			ВизитыВходятВИнтервалыРабот = ПроверитьВизитыВходятВИнтервалыРабот(СтрокаРЗ.Сотрудник, СтрокаРЗ.Дата, ОтборСтруктурнаяЕдиница, СтрокаРЗ.ИнтервалыРаботы);   			
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("РезультатПланирования" , РезультатПланирования);
			
			Если НЕ ВизитыВходятВИнтервалыРабот Тогда
				Если ТипЗнч(СтрокаРЗ.ИнтервалыРаботы) = Тип("СписокЗначений") И СтрокаРЗ.ИнтервалыРаботы.Количество() > 0 Тогда
					ФлагПроверки = Ложь;
					Оповещение = Новый ОписаниеОповещения("ГрафикПериодовРаботыТабДокВыборПродолжить", ЭтотОбъект, СтруктураПараметров);
					ПоказатьВопрос(Оповещение, "У сотрудника " + СтрокаРЗ.Сотрудник + " " + Формат(СтрокаРЗ.Дата, "ДЛФ = ДДММГГ")+ " запланированы визиты, не входящие в выбранные смены. Продолжить?", РежимДиалогаВопрос.ДаНетОтмена);			
				Иначе
					ФлагПроверки = Ложь;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У сотрудника " + СтрокаРЗ.Сотрудник + " " + Формат(СтрокаРЗ.Дата, "ДЛФ = ДДММГГ")+ " запланированы визиты. Удаление интервала невозможно.");			
				КонецЕсли;
			КонецЕсли;	

		КонецЦикла;
		
		Если ФлагПроверки Тогда
			ДополнитьБуферНовымиДаннымиПланирования(РезультатПланирования);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - график периодов работы продолжить
// 
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
// 
Процедура ГрафикПериодовРаботыТабДокВыборПродолжить(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ДополнитьБуферНовымиДаннымиПланирования(Параметры.РезультатПланирования, Ложь);
		// ПослеЗакрытияФормыСозданияОповещение(РезультатПланированияРазовый,);
		МодифицированностьГрафикаРаботы = Истина;
	КонецЕсли;
	
КонецПроцедуры    

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Команда скопировать предыдущую неделю
// 
// Параметры:
//  Команда	 - 	 - 
// 
Процедура КомандаСкопироватьПредыдущуюНеделю(Команда)
	
	Если ЗначениеЗаполнено(ИдТекущегоЭлементаHTML) Тогда
		СтартоваяДата = ПолучитьДатуВыделеннойОбласти(ИдТекущегоЭлементаHTML);
		
		ЗаполнитьРезультатПланированияНаСервере(СтартоваяДата, "Неделя");
		
		Если РезультатПланированияРазовый.Количество() > 0 Тогда 
			ПослеЗакрытияФормыСозданияОповещение(РезультатПланированияРазовый, Неопределено);
        КонецЕсли;
	КонецЕсли;	
	
	// Если Элементы.ТабДокументПланирования.ТекущаяОбласть <> Неопределено 
	// 	И ЗначениеЗаполнено(Элементы.ТабДокументПланирования.ТекущаяОбласть.Расшифровка) Тогда	
	// 	
	// 	СтартоваяДата = ПолучитьДатуВыделеннойОбласти(Элементы.ТабДокументПланирования.ТекущаяОбласть.Расшифровка);
	// 	
	// 	ЗаполнитьРезультатПланированияНаСервере(СтартоваяДата, "Неделя");
	// 	
	// 	Если РезультатПланированияРазовый.Количество() > 0 Тогда 
	// 		ПослеЗакрытияФормыСозданияОповещение(РезультатПланированияРазовый, Неопределено);
	//    КонецЕсли;
	// КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда скопировать день с предыдущей недели
// 
// Параметры:
//  Команда	 - 	 - 
// 
Процедура КомандаСкопироватьДеньСПредыдущейНедели(Команда)
	
	Если ЗначениеЗаполнено(ИдТекущегоЭлементаHTML) Тогда
		СтартоваяДата = ПолучитьДатуВыделеннойОбласти(ИдТекущегоЭлементаHTML);
		
		ЗаполнитьРезультатПланированияНаСервере(СтартоваяДата, "День");
		
		Если РезультатПланированияРазовый.Количество() > 0 Тогда 
			ПослеЗакрытияФормыСозданияОповещение(РезультатПланированияРазовый, Неопределено);
		КонецЕсли;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
// Пометить на удаление выбранные занятие 
// 
Процедура КомандаТабДокументУдалить(Команда)
	
	НомерОперации = НомерПоследнейОперацииВОчередиБуфера() + 1;
	
	Если ЗначениеЗаполнено(ИдТекущегоЭлементаHTML) Тогда 
		СтрокаБуфера = СтрокаБуфераФомированияПоИдентификатору(ИдТекущегоЭлементаHTML);
		
		Если СтрокаБуфера <> Неопределено Тогда
			Если СтрокаБуфера.Операция = "Создать" Тогда
				БуферФормирования.Удалить(СтрокаБуфера);
			Иначе
				
				Данные = ПроверитьНаличиеВизита(СтрокаБуфера.Сотрудник, СтрокаБуфера.Дата, СтрокаБуфера.ИнтервалыРаботы, ОтборСтруктурнаяЕдиница);
				Если Данные = Ложь Тогда
					
					СтрокаБуфера.Операция              = "Удалить";
					СтрокаБуфера.НомерОчередиОперации  = НомерОперации;
				Иначе
					
					Интервал = Формат(Данные.НачалоРаботы, "ДЛФ=DD") + " с " + Формат(Данные.НачалоРаботы, "ДФ=HH:мм") + " по " + Формат(Данные.ОкончаниеРаботы, "ДФ=HH:мм");
					Текст = "В интервале " + Интервал + " созданы визиты. Удаление интервала невозможно.";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		// Обновление отображения плана
		ОбновитьОтображениеПланирования(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Пометить на удаление за указный период
// 
Процедура КомандаТабДокументУдалитьЗаПериод(Команда)
	
	Если ЗначениеЗаполнено(ИдТекущегоЭлементаHTML) Тогда 
		СтрокаБуфераОбразец       = СтрокаБуфераФомированияПоИдентификатору(ИдТекущегоЭлементаHTML);
		НомерДняНеделиДляУдаления = ДеньНедели(СтрокаБуфераОбразец.Дата);
		НомерОперации             = НомерПоследнейОперацииВОчередиБуфера() + 1;
		Индекс                    = 0;
		Пока Индекс < БуферФормирования.Количество() Цикл
			СтрокаБуфера = БуферФормирования[Индекс]; 
			
			Если ДеньНедели(СтрокаБуфера.Дата) = НомерДняНеделиДляУдаления
				И СравнитьСтрокиБуфераФормирования(СтрокаБуфераОбразец, СтрокаБуфера) Тогда
				
				Если СтрокаБуфера.Операция = "Создать" Тогда
					БуферФормирования.Удалить(СтрокаБуфера);
					Продолжить;
				Иначе
					
					Данные = ПроверитьНаличиеВизита(СтрокаБуфера.Сотрудник, СтрокаБуфера.Дата, СтрокаБуфера.ИнтервалыРаботы, ОтборСтруктурнаяЕдиница);
					Если Данные = Ложь Тогда
						
						СтрокаБуфера.Операция              = "Удалить";
						СтрокаБуфера.НомерОчередиОперации  = НомерОперации;
						
					Иначе
						
						Интервал = Формат(Данные.НачалоРаботы, "ДЛФ=DD") + " с " + Формат(Данные.НачалоРаботы, "ДФ=HH:мм") + " по " + Формат(Данные.ОкончаниеРаботы, "ДФ=HH:мм");
						Текст = "В интервале " + Интервал + " созданы визиты. Удаление интервала невозможно.";
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
						
					КонецЕсли;

				КонецЕсли;		
			КонецЕсли;
			Индекс = Индекс + 1;
		КонецЦикла;
		// Обновление отображения плана
		ОбновитьОтображениеПланирования(Ложь);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Пометить на удаление все занятия
// 
Процедура КомандаТабДокументУдалитьВсе(Команда)
	
	Если ЗначениеЗаполнено(ИдТекущегоЭлементаHTML) Тогда 
		
		СтрокаБуфераОбразец       = СтрокаБуфераФомированияПоИдентификатору(ИдТекущегоЭлементаHTML);
		НомерОперации             = НомерПоследнейОперацииВОчередиБуфера() + 1;
		Индекс                    = 0;
		Пока Индекс < БуферФормирования.Количество() Цикл
			СтрокаБуфера = БуферФормирования[Индекс]; 
					
			Если СравнитьСтрокиБуфераФормирования(СтрокаБуфераОбразец, СтрокаБуфера) Тогда
				
				Если СтрокаБуфера.Операция = "Создать" Тогда
					БуферФормирования.Удалить(СтрокаБуфера);
					Продолжить;
				Иначе
					Данные = ПроверитьНаличиеВизита(СтрокаБуфера.Сотрудник, СтрокаБуфера.Дата, СтрокаБуфера.ИнтервалыРаботы, ОтборСтруктурнаяЕдиница);
					Если Данные = Ложь Тогда
						
						СтрокаБуфера.Операция              = "Удалить";
						СтрокаБуфера.НомерОчередиОперации  = НомерОперации;
						
					Иначе
						
						Интервал = Формат(Данные.НачалоРаботы, "ДЛФ=DD") + " с " + Формат(Данные.НачалоРаботы, "ДФ=HH:мм") + " по " + Формат(Данные.ОкончаниеРаботы, "ДФ=HH:мм");
						Текст = "В интервале " + Интервал + " созданы визиты. Удаление интервала невозможно.";
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
						
					КонецЕсли;

				КонецЕсли;		
			КонецЕсли;
			Индекс = Индекс + 1;
		КонецЦикла;
		// Обновление отображения плана
		ОбновитьОтображениеПланирования(Ложь);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Обработчик кнопки отмены последней операции
// 
Процедура КомандаОтменитьПоследнююОперацию(Команда)
	
	НомерОперации = НомерПоследнейОперацииВОчередиБуфера();
	Если НомерОперации > 0 Тогда
		
		НайденныеСтроки = БуферФормирования.НайтиСтроки(Новый Структура("НомерОчередиОперации",НомерОперации));
		Для Каждого СтрокаБуфера ИЗ НайденныеСтроки Цикл
			Если СтрокаБуфера.Операция = "Создать" Тогда				
				БуферФормирования.Удалить(СтрокаБуфера);
			ИначеЕсли СтрокаБуфера.Операция = "Удалить" Тогда	
				СтрокаБуфера.Операция             = "";
				СтрокаБуфера.НомерОчередиОперации = 0;
				СтрокаБуфера.Скрыть               = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		// Обновление отображения плана
		ОбновитьОтображениеПланирования(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда распечатать
// 
// Параметры:
//  Команда	 - 	 - 
// 
Процедура КомандаРаспечатать(Команда)
	
	Элементы.HTMLПанельПланирования.Документ.execCommand("print");
	
	// Элементы.HTMLПанельПланирования.Перейти("javascript:window.print()");
	
КонецПроцедуры

&НаКлиенте
// Обработчик кнопки формирования плана занятий
// 
Процедура КомандаСформировать(Команда)	
	
	Если ПроверитьНеобходимостьФиксацииИзмененийВПлане() Тогда
		ПоказатьОповещениеПользователя(,,"Сохранение изменений в графике работы", БиблиотекаКартинок.ДлительнаяОперация48, СтатусОповещенияПользователя.Информация);
		ЗафиксироватьИзмененияВГрафикеСотрудников();
	Иначе
		ПоказатьОповещениеПользователя(,,"Изменений в графике работы не обнаружено", БиблиотекаКартинок.ДлительнаяОперация48, СтатусОповещенияПользователя.Информация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик кнопки обновления графика
// 
Процедура КомандаОбновить(Команда)
	
	Если ПроверитьНеобходимостьФиксацииИзмененийВПлане() = Истина Тогда
		ЭтоОчистка = Ложь;		
		СтруктураПарметров = Новый Структура;
		СтруктураПарметров.Вставить("ИмяЭлемента"	, Элементы.ОтборПериод.Имя);		
		СтруктураПарметров.Вставить("КодДляОтката", "");
		Оповещение   = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОФиксацииизменений", ЭтотОбъект, СтруктураПарметров);
		ПоказатьВопрос(Оповещение,"Имеются не сохраненные изменения, они будут потеряны. Продолжить ?",РежимДиалогаВопрос.ДаНет,,,"Планирование");
		Возврат;
	КонецЕсли;
	
	ОбновитьОтображениеПланирования(Истина);

КонецПроцедуры

&НаКлиенте
// Процедура - Команда открыть мастер заполнения
// 
// Параметры:
//  Команда	 - 	 - 
// 
Процедура КомандаОткрытьМастерЗаполнения(Команда)
	
	// Если НЕ ФормированиеИнтерваловЗавершено() Тогда 
	// 	Возврат;
	// КонецЕсли;
	
	ИнтервалыСформированы = ФормированиеИнтерваловЗавершено(Ложь);
	
	ИнтервалыРаботы = ОтборИнтервалыРаботы.Скопировать();
	Если НЕ ИнтервалыСформированы Тогда                  							
		ИнтервалыРаботы.Очистить();
	КонецЕсли;
	
	ПериодЗаполнения     = Новый СтандартныйПериод(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);
	СтартоваяДата        = ОтборПериод.ДатаНачала;
	
	ПараметрыПланирования = Новый Структура;	
	ПараметрыПланирования.Вставить("ПериодЗаполнения"   , ПериодЗаполнения);
	ПараметрыПланирования.Вставить("СтартоваяДата"      , СтартоваяДата);
	ПараметрыПланирования.Вставить("Сотрудник"          , ОтборСотрудник);
	ПараметрыПланирования.Вставить("ИнтервалыРаботы"	, ИнтервалыРаботы);
		
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыСозданияОповещение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ПланированиеИндивидуальногоГрафика.Форма.ФормаСоздания",ПараметрыПланирования, ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			
		
КонецПроцедуры

&НаКлиенте
// Процедура - Команда развернуть
// 
// Параметры:
//  Команда	 - 	 - 
// 
Процедура КомандаРазвернуть(Команда)

	Элементы.КомандаРазвернуть.Пометка 						= Истина;
	Элементы.КомандаСвернуть.Пометка 						= Ложь;
	Элементы.ГруппаПанельОтборов.Видимость 					= Ложь;	
	Элементы.HTMLПанельПланирования.Ширина 					= 130;
	Элементы.HTMLПанельПланирования.Высота 					= 20;
	Элементы.HTMLПанельПланирования.АвтоМаксимальнаяШирина 	= Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда свернуть
// 
// Параметры:
//  Команда	 - 	 - 
// 
Процедура КомандаСвернуть(Команда)

	Элементы.КомандаРазвернуть.Пометка 						= Ложь;
	Элементы.КомандаСвернуть.Пометка 						= Истина;
	Элементы.ГруппаПанельОтборов.Видимость 					= Истина;	
	Элементы.HTMLПанельПланирования.Ширина 					= 50;
	Элементы.HTMLПанельПланирования.Высота 					= 10;
	Элементы.HTMLПанельПланирования.АвтоМаксимальнаяШирина 	= Ложь;
	Элементы.HTMLПанельПланирования.МаксимальнаяШирина 		= 98;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбрать период планирования
// 
// Параметры:
//  Команда	 - 	 - 
// 
Процедура ВыбратьПериодПланирования(Команда)
	
	// Делаем бэкап значения поля
	ОткатВыбранногоЗначения = ЭтаФорма.ТекущийЭлемент.Имя;
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = ОтборПериод;
	Диалог.Показать(Новый ОписаниеОповещения("ОтборПериодаПланированииПриИзменении", ЭтаФорма)); 
	
КонецПроцедуры

&НаКлиенте
// Процедура - Показать список шаблонов.
// 
// Параметры:
//  Команда	 - 	 - 
// 
Процедура ПоказатьСписокШаблонов(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборШаблонаИзСписка", ЭтотОбъект);
	СписокПериодов     = ПолучитьСписокПериодовРаботы(ЭтотОбъект.ОтборСтруктурнаяЕдиница);	
	
	ЭтаФорма.ПоказатьВыборИзМеню(ОписаниеОповещения, СписокПериодов, Элементы.ПоказатьСписокШаблонов);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор шаблона из списка
// 
// Параметры:
//  ВыбранныйЭлемент		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
// 
Процедура ВыборШаблонаИзСписка(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйЭлемент = Неопределено Тогда 
		Возврат;
	Иначе
		ОтборИнтервалыРаботы.Очистить();
		
		Если ВыбранныйЭлемент.Значение = "Отпуск" 
			Или ВыбранныйЭлемент.Значение = "Больничный" Тогда
			
			Элементы.ГруппаСписокИнтерваловРаботы.Видимость = Ложь;
			Элементы.ГруппаДобавитьИнтервал.Видимость       = Ложь;	
			Элементы.ПоказатьСписокШаблонов.Заголовок       = ВыбранныйЭлемент.Значение;
			
			ТипРабочегоВремени = ?(ВыбранныйЭлемент.Значение = "Отпуск", ПредопределенноеЗначение("Перечисление.ТипыРабочегоВремени.Отпуск"), ПредопределенноеЗначение("Перечисление.ТипыРабочегоВремени.Больничный"));
			
		ИначеЕсли СокрЛП(ВыбранныйЭлемент.Значение) = "Смены:" Тогда
			
			Элементы.ГруппаСписокИнтерваловРаботы.Видимость = Истина;
			Элементы.ГруппаДобавитьИнтервал.Видимость       = Истина;	
			Элементы.ПоказатьСписокШаблонов.Заголовок       = ВыбранныйЭлемент.Значение;
			Если ОтборИнтервалыРаботы.Количество() = 0 Тогда
	            ОтборИнтервалыРаботы.Добавить(Новый Структура("НачалоРаботы, ОкончаниеРаботы", Неопределено, Неопределено));
			КонецЕсли;
			
			ОбновитьМенюОтбораИнтерваловРабот();
			ОбновитьОбщееВремяИнтервалов();		

			ТипРабочегоВремени = ПредопределенноеЗначение("Перечисление.ТипыРабочегоВремени.Рабочее");

		Иначе
			
			Для Каждого ЭлементСписка Из ВыбранныйЭлемент.Значение Цикл 
				ОтборИнтервалыРаботы.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
			КонецЦикла;
			
			ОбновитьМенюОтбораИнтерваловРабот();
			ОбновитьОбщееВремяИнтервалов();		
			ОбновитьДекорациюУпраленияСохранениемШаблонов();
			
			Элементы.ГруппаСписокИнтерваловРаботы.Видимость = Истина;
			Элементы.ГруппаДобавитьИнтервал.Видимость       = Истина;
			
			ТипРабочегоВремени = ПредопределенноеЗначение("Перечисление.ТипыРабочегоВремени.Рабочее");

		КонецЕсли;
		
	КонецЕсли;
	УстановитьТекущийЭлемент();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда добавить интервал
// 
// Параметры:
//  Команда	 - 	 - 
// 
Процедура КомандаДобавитьИнтервал(Команда)

	ОтборИнтервалыРаботы.Добавить(Новый Структура("НачалоРаботы, ОкончаниеРаботы", Неопределено, Неопределено));
	ОбновитьМенюОтбораИнтерваловРабот();
	ОбновитьДекорациюУпраленияСохранениемШаблонов();
	УстановитьТекущийЭлемент();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый выбор начала интервала
// 
// Параметры:
//  Команда	 - 	 - 
// 
Процедура Подключаемый_ВыборНачалаИнтервала(Команда)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлемента(ЭтаФорма, Команда);
	
	Если НЕ СтруктураДанныеЭлемента.ДанныеЭлемента = Неопределено Тогда 
		
		Шаг = 30; // в минутах		
		ИмяЭлемента = "Кнопка_ВыборНачалаИнтервала_" + СтруктураДанныеЭлемента.ИндексСтроки;
		СтруктураДанныеЭлемента.Вставить("ИмяЭлемента"			, ИмяЭлемента);			
		СтруктураДанныеЭлемента.Вставить("ЭтоНачалоИнтервала"	, Истина);
		
		ЭлементМассиваДней = Неопределено;
		Для Каждого ЭлементМ ИЗ ВремяРаботыСтруктурнойЕдиницы Цикл
			
			Если ЭлементМассиваДней = Неопределено Тогда 
				ЭлементМассиваДней = ЭлементМ;
			ИначеЕсли ЭлементМассиваДней.ДатаНачала > ЭлементМ.ДатаНачала Тогда // находим минимум
				ЭлементМассиваДней = ЭлементМ;
			КонецЕсли;
			
		КонецЦикла;			
		Если ЭлементМассиваДней <> Неопределено Тогда
			// Заполнить список интервалов времени
			МассивПериодов = Новый Массив;
			МассивПериодов.Добавить(ЭлементМассиваДней);
			НачинаяСВремени 		= ВернутьПоследнееУказанноеВремя(СтруктураДанныеЭлемента, Шаг);			
			СписокВермениРаботы  	= ОбщегоНазначенияКлиентСерверСтоматология.ВернутьСписокВремени(МассивПериодов, Истина, Шаг);	
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыборВремениИзСписка", ЭтотОбъект, СтруктураДанныеЭлемента);
			ЭтаФорма.ПоказатьВыборИзМеню(ОписаниеОповещения, СписокВермениРаботы, Элементы[ИмяЭлемента]);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый выбор окончания интервала
// 
// Параметры:
//  Команда	 - 	 - 
// 
Процедура Подключаемый_ВыборОкончанияИнтервала(Команда)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлемента(ЭтаФорма, Команда);
	
	Если НЕ СтруктураДанныеЭлемента.ДанныеЭлемента = Неопределено Тогда 
		
		Шаг = 30; // в минутах
		ИмяЭлемента = "Кнопка_ВыборОкончанияИнтервала_" + СтруктураДанныеЭлемента.ИндексСтроки;
		СтруктураДанныеЭлемента.Вставить("ИмяЭлемента"			, ИмяЭлемента);			
		СтруктураДанныеЭлемента.Вставить("ЭтоНачалоИнтервала"	, Ложь);
		
		ЭлементМассиваДней = Неопределено;
		Для Каждого ЭлементМ ИЗ ВремяРаботыСтруктурнойЕдиницы Цикл
			
			Если ЭлементМассиваДней = Неопределено Тогда 
				ЭлементМассиваДней = ЭлементМ;
			ИначеЕсли ЭлементМассиваДней.ДатаОкончания < ЭлементМ.ДатаОкончания Тогда 
				ЭлементМассиваДней = ЭлементМ;
			КонецЕсли;
			
		КонецЦикла;			
		Если ЭлементМассиваДней <> Неопределено Тогда
			// Заполнить список интервалов времени
			МассивПериодов = Новый Массив;
			МассивПериодов.Добавить(ЭлементМассиваДней);
			НачинаяСВремени 		= ВернутьПоследнееУказанноеВремя(СтруктураДанныеЭлемента, Шаг);			
			СписокВермениРаботы 	= ОбщегоНазначенияКлиентСерверСтоматология.ВернутьСписокВремени(МассивПериодов, Истина, Шаг,);	
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыборВремениИзСписка", ЭтотОбъект, СтруктураДанныеЭлемента);
			ЭтаФорма.ПоказатьВыборИзМеню(ОписаниеОповещения, СписокВермениРаботы, Элементы[ИмяЭлемента]);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор времени из списка
// 
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
// 
Процедура ВыборВремениИзСписка(ВыбранныйЭлемент, ДополнительныеПараметры = Неопределено) Экспорт
	
	Отказ = Ложь;
	
	Если ВыбранныйЭлемент = Неопределено Тогда 
		Возврат;
	Иначе
		// Запоминаем значение
		ЗначениеДоИзменения = ДополнительныеПараметры.ДанныеЭлемента.Значение;
		// Моделируем новое значение
		Если ДополнительныеПараметры.ЭтоНачалоИнтервала Тогда 
			ЗначениеПослеИзменения = Новый Структура("НачалоРаботы, ОкончаниеРаботы", ВыбранныйЭлемент.Значение, ЗначениеДоИзменения.ОкончаниеРаботы);
		Иначе 
			ЗначениеПослеИзменения = Новый Структура("НачалоРаботы, ОкончаниеРаботы", ЗначениеДоИзменения.НачалоРаботы, ВыбранныйЭлемент.Значение);
		КонецЕсли;
		// Производим проверку
		Если НЕ ЗначениеПослеИзменения.НачалоРаботы = Неопределено И НЕ ЗначениеПослеИзменения.ОкончаниеРаботы = Неопределено Тогда
			Если ЗначениеПослеИзменения.НачалоРаботы = ЗначениеПослеИзменения.ОкончаниеРаботы Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю("Время начала работы не может быть равно времени окончания работы!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			Если ЗначениеПослеИзменения.НачалоРаботы > ЗначениеПослеИзменения.ОкончаниеРаботы Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю("Время начала работы не может быть больше времени окончания работы!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			Для Каждого ИнтервалСписка ИЗ ЭтаФорма[ДополнительныеПараметры.ИмяТаблицы] Цикл
				ИндексИнтервала = ЭтаФорма[ДополнительныеПараметры.ИмяТаблицы].Индекс(ИнтервалСписка);
				Если ИндексИнтервала <> ДополнительныеПараметры.ИндексСтроки И 
					НЕ ИнтервалСписка.Значение.НачалоРаботы = Неопределено И НЕ ИнтервалСписка.Значение.ОкончаниеРаботы = Неопределено Тогда
					
					// Я отдал приоритет этому механизму выявления пересечения периодов
					Если Макс(ЗначениеПослеИзменения.НачалоРаботы, ИнтервалСписка.Значение.НачалоРаботы) < Мин(ЗначениеПослеИзменения.ОкончаниеРаботы, ИнтервалСписка.Значение.ОкончаниеРаботы) Тогда
						ОбщегоНазначенияКлиент.СообщитьПользователю("Обнаружено пересечение времени: с " + Формат(Макс(ЗначениеПослеИзменения.НачалоРаботы, ИнтервалСписка.Значение.НачалоРаботы), "ДФ=HH:mm") + " по " + Формат(Мин(ЗначениеПослеИзменения.ОкончаниеРаботы, ИнтервалСписка.Значение.ОкончаниеРаботы), "ДФ=HH:mm"));
						Отказ = Истина;	
						Прервать;
					КонецЕсли; 	
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;			
		Если НЕ Отказ Тогда 
			ДополнительныеПараметры.ДанныеЭлемента.Значение 		= ЗначениеПослеИзменения;
			ДополнительныеПараметры.ДанныеЭлемента.Представление 	= ОбщегоНазначенияКлиентСерверСтоматология.ПолучитьПредставлениеИнтервала(ДополнительныеПараметры.ДанныеЭлемента.Значение);
			Элементы[ДополнительныеПараметры.ИмяЭлемента].Заголовок = Формат(ВыбранныйЭлемент.Значение, "ДФ=HH:mm");
			Если ДополнительныеПараметры.ЭтоНачалоИнтервала И ДополнительныеПараметры.ДанныеЭлемента.Значение.ОкончаниеРаботы = Неопределено Тогда
				Подключаемый_ВыборОкончанияИнтервала(ЭтаФорма.Команды.Найти("Подключаемый_ВыборОкончанияИнтервала_" + ДополнительныеПараметры.ИндексСтроки));
			Иначе 
				УстановитьТекущийЭлемент();
			КонецЕсли;
			ОбновитьОбщееВремяИнтервалов();
			ОбновитьДекорациюУпраленияСохранениемШаблонов();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить меню отбора интервалов работ
// 
Процедура ОбновитьМенюОтбораИнтерваловРабот()
	
	РодительскаяГруппа = Элементы.ГруппаСписокИнтерваловРаботы;
	// Очистим группу
	УдаляемыеЭлементы = Новый Массив;
	
	Для Каждого ГруппаЭлементов Из РодительскаяГруппа.ПодчиненныеЭлементы Цикл
		УдаляемыеЭлементы.Добавить(ГруппаЭлементов);
	КонецЦикла;
	
	Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
	
	Если ОтборИнтервалыРаботы.Количество() = 0 Тогда 
		ДекорацияФормы_СписокИнтервалов_Пуст = Элементы.Добавить("ДекорацияФормы_СписокИнтервалов_Пуст", Тип("ДекорацияФормы"), РодительскаяГруппа);
		ДекорацияФормы_СписокИнтервалов_Пуст.Вид 									= ВидДекорацииФормы.Надпись;
		ДекорацияФормы_СписокИнтервалов_Пуст.Заголовок 								= "Список интервалов пуст";
		ДекорацияФормы_СписокИнтервалов_Пуст.АвтоМаксимальнаяШирина    				= Ложь;
		ДекорацияФормы_СписокИнтервалов_Пуст.Высота 								= 1;
		ДекорацияФормы_СписокИнтервалов_Пуст.МаксимальнаяШирина       				= 45;
		ДекорацияФормы_СписокИнтервалов_Пуст.ГоризонтальноеПоложение   				= ГоризонтальноеПоложениеЭлемента.Центр;
		ДекорацияФормы_СписокИнтервалов_Пуст.ГоризонтальноеПоложениеВГруппе 		= ГоризонтальноеПоложениеЭлемента.Центр;
		ДекорацияФормы_СписокИнтервалов_Пуст.ВертикальноеПоложение 					= ВертикальноеПоложениеЭлемента.Центр;
		ДекорацияФормы_СписокИнтервалов_Пуст.ВертикальноеПоложениеВГруппе			= ВертикальноеПоложениеЭлемента.Центр;		
		ДекорацияФормы_СписокИнтервалов_Пуст.РастягиватьПоГоризонтали  				= Истина;
		ДекорацияФормы_СписокИнтервалов_Пуст.ЦветТекста								= Новый Цвет(170, 170, 170);
		ДекорацияФормы_СписокИнтервалов_Пуст.Шрифт 									= Новый Шрифт("Arial", 11);		
	Иначе 	
		Для Каждого ЭлементСписка Из ОтборИнтервалыРаботы Цикл 
			
			ИндексИнтервала = ОтборИнтервалыРаботы.Индекс(ЭлементСписка);
			
			// Создаем группу для каждого интервала
			// --------------------------------------------------------------------------------------------		
			Группа_Интервал = Элементы.Добавить("Группа_Интервал_" + ИндексИнтервала, Тип("ГруппаФормы"), РодительскаяГруппа);
			Группа_Интервал.Вид 													= ВидГруппыФормы.ОбычнаяГруппа;
			Группа_Интервал.Заголовок 												= Группа_Интервал.Имя;
			Группа_Интервал.Отображение 											= ОтображениеОбычнойГруппы.Нет;
			Группа_Интервал.Группировка 											= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			Группа_Интервал.ОтображатьЗаголовок 									= Ложь;
			// Группа_Интервал.ЦветФона 												= ЦветаСтиля.ЦветФонаЗадач;
			Группа_Интервал.ГоризонтальныйИнтервал 									= ИнтервалМеждуЭлементамиФормы.Половинный;
			Группа_Интервал.ГоризонтальноеПоложениеВГруппе   						= ГоризонтальноеПоложениеЭлемента.Центр;
			Группа_Интервал.ГоризонтальноеПоложениеПодчиненных 						= ГоризонтальноеПоложениеЭлемента.Центр;
			Группа_Интервал.ВертикальноеПоложениеВГруппе 							= ВертикальноеПоложениеЭлемента.Центр;
			Группа_Интервал.ВертикальноеПоложениеПодчиненных						= ВертикальноеПоложениеЭлемента.Центр;		
								
			Если ЭтаФорма.Команды.Найти("Подключаемый_ВыборНачалаИнтервала_" + ИндексИнтервала) = Неопределено Тогда
				Команда 			= ЭтаФорма.Команды.Добавить("Подключаемый_ВыборНачалаИнтервала_" + ИндексИнтервала);
				Команда.Заголовок 	= "[...]";
				Команда.Подсказка 	= "Укажите начало интервала";
				Команда.Действие 	= "Подключаемый_ВыборНачалаИнтервала";
			КонецЕсли;
			
			КнопкаНачалаИнтервала = Элементы.Добавить("Кнопка_ВыборНачалаИнтервала_" + ИндексИнтервала, Тип("КнопкаФормы"), Группа_Интервал);
			КнопкаНачалаИнтервала.ИмяКоманды 										= "Подключаемый_ВыборНачалаИнтервала_" + ИндексИнтервала;
			КнопкаНачалаИнтервала.Заголовок 										= ?(ЭлементСписка.Значение.НачалоРаботы = Неопределено, "[...]", Формат(ЭлементСписка.Значение.НачалоРаботы, "ДФ=HH:mm"));
			КнопкаНачалаИнтервала.ОтображениеФигуры    								= ОтображениеФигурыКнопки.Нет;
			КнопкаНачалаИнтервала.Ширина 											= 10;
			КнопкаНачалаИнтервала.ЦветТекста 										= ЦветаСтиля.ТекстВторостепеннойНадписи;
			КнопкаНачалаИнтервала.Шрифт 											= Новый Шрифт("Arial", 11);
			КнопкаНачалаИнтервала.ГоризонтальноеПоложениеВГруппе 					= ГоризонтальноеПоложениеЭлемента.Центр;
			КнопкаНачалаИнтервала.ВертикальноеПоложениеВГруппе 						= ВертикальноеПоложениеЭлемента.Центр;
			КнопкаНачалаИнтервала.ЦветФона 											= Новый Цвет(240, 240, 240);
			
			// Декорация "-"				
			ДекорацияФормы_Дефис = Элементы.Добавить("ДекорацияФормы_Дефис_" + ИндексИнтервала, Тип("ДекорацияФормы"), Группа_Интервал);
			ДекорацияФормы_Дефис.Вид 												= ВидДекорацииФормы.Надпись;
			ДекорацияФормы_Дефис.Заголовок 											= "-";
			ДекорацияФормы_Дефис.Ширина 											= 2;
			ДекорацияФормы_Дефис.ЦветТекста											= ЦветаСтиля.ТекстВторостепеннойНадписи;			
			ДекорацияФормы_Дефис.ГоризонтальноеПоложение   							= ГоризонтальноеПоложениеЭлемента.Центр;
			ДекорацияФормы_Дефис.ГоризонтальноеПоложениеВГруппе 					= ГоризонтальноеПоложениеЭлемента.Центр;
			ДекорацияФормы_Дефис.ВертикальноеПоложение 								= ВертикальноеПоложениеЭлемента.Центр;
			ДекорацияФормы_Дефис.ВертикальноеПоложениеВГруппе						= ВертикальноеПоложениеЭлемента.Центр;		
			
			Если ЭтаФорма.Команды.Найти("Подключаемый_ВыборОкончанияИнтервала_" + ИндексИнтервала) = Неопределено Тогда
				Команда 			= ЭтаФорма.Команды.Добавить("Подключаемый_ВыборОкончанияИнтервала_" + ИндексИнтервала);
				Команда.Заголовок 	= "[...]";
				Команда.Подсказка 	= "Укажите окончание интервала";
				Команда.Действие 	= "Подключаемый_ВыборОкончанияИнтервала";
			КонецЕсли;
			
			КнопкаОкончанияИнтервала = Элементы.Добавить("Кнопка_ВыборОкончанияИнтервала_" + ИндексИнтервала, Тип("КнопкаФормы"), Группа_Интервал);
			КнопкаОкончанияИнтервала.ИмяКоманды 									= "Подключаемый_ВыборОкончанияИнтервала_" + ИндексИнтервала;
			КнопкаОкончанияИнтервала.Заголовок 										= ?(ЭлементСписка.Значение.ОкончаниеРаботы = Неопределено, "[...]", Формат(ЭлементСписка.Значение.ОкончаниеРаботы, "ДФ=HH:mm"));
			КнопкаОкончанияИнтервала.ОтображениеФигуры    							= ОтображениеФигурыКнопки.Нет;
			КнопкаОкончанияИнтервала.Ширина 										= 10;
			КнопкаОкончанияИнтервала.ЦветТекста 									= ЦветаСтиля.ТекстВторостепеннойНадписи;
			КнопкаОкончанияИнтервала.Шрифт 											= Новый Шрифт("Arial", 11);
			КнопкаОкончанияИнтервала.ГоризонтальноеПоложениеВГруппе 				= ГоризонтальноеПоложениеЭлемента.Центр;
			КнопкаОкончанияИнтервала.ВертикальноеПоложениеВГруппе 					= ВертикальноеПоложениеЭлемента.Центр;
			КнопкаОкончанияИнтервала.ЦветФона 										= Новый Цвет(240, 240, 240);
			
			// Декорация "х"				
			ДекорацияФормы_УдалениеИнтервала = Элементы.Добавить("ДекорацияФормы_УдалениеИнтервала_" + ИндексИнтервала, Тип("ДекорацияФормы"), Группа_Интервал);
			ДекорацияФормы_УдалениеИнтервала.Вид 									= ВидДекорацииФормы.Картинка;
			// ДекорацияФормы_УдалениеИнтервала.Заголовок 								= "-";
			ДекорацияФормы_УдалениеИнтервала.Ширина 								= 1;
			ДекорацияФормы_УдалениеИнтервала.Высота 								= 1;
			ДекорацияФормы_УдалениеИнтервала.ЦветТекста								= ЦветаСтиля.ТекстВторостепеннойНадписи;			
			ДекорацияФормы_УдалениеИнтервала.ГоризонтальноеПоложениеВГруппе 		= ГоризонтальноеПоложениеЭлемента.Центр;
			ДекорацияФормы_УдалениеИнтервала.ВертикальноеПоложениеВГруппе			= ВертикальноеПоложениеЭлемента.Центр;		
			ДекорацияФормы_УдалениеИнтервала.Картинка 								= БиблиотекаКартинок.УдалениеДанных16;
			ДекорацияФормы_УдалениеИнтервала.Гиперссылка 							= Истина;
			ДекорацияФормы_УдалениеИнтервала.РастягиватьПоГоризонтали	 			= Ложь;
			
			ДекорацияФормы_УдалениеИнтервала.УстановитьДействие("Нажатие", "Подключаемый_ДекорацияФормы_УдалитьТекущийИнтервал_Нажатие");
			
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый декорация формы удалить текущий интервал нажатие
// 
// Параметры:
//  Элемент	 - 	 - 
// 
Процедура Подключаемый_ДекорацияФормы_УдалитьТекущийИнтервал_Нажатие(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлемента(ЭтаФорма, Элемент);
	
	Если НЕ СтруктураДанныеЭлемента.ДанныеЭлемента = Неопределено Тогда
		Если ЭтаФорма[СтруктураДанныеЭлемента.ИмяТаблицы].Количество() = 1 Тогда 
			ЭтаФорма[СтруктураДанныеЭлемента.ИмяТаблицы][СтруктураДанныеЭлемента.ИндексСтроки].Значение = Новый Структура("НачалоРаботы, ОкончаниеРаботы", Неопределено, Неопределено);
			ЭтаФорма[СтруктураДанныеЭлемента.ИмяТаблицы][СтруктураДанныеЭлемента.ИндексСтроки].Представление = "";
		Иначе 
			ЭтаФорма[СтруктураДанныеЭлемента.ИмяТаблицы].Удалить(ЭтаФорма[СтруктураДанныеЭлемента.ИмяТаблицы][СтруктураДанныеЭлемента.ИндексСтроки]);
		КонецЕсли;	
		ОбновитьМенюОтбораИнтерваловРабот();
		ОбновитьОбщееВремяИнтервалов();		
		ОбновитьДекорациюУпраленияСохранениемШаблонов();
		УстановитьТекущийЭлемент();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - Отбор периода планировании при изменении
// 
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
// 
Процедура ОтборПериодаПланированииПриИзменении(Результат, ДополнительныеПараметры) Экспорт 
	
	// Делаем бэкап значения поля
	ОткатВыбранногоЗначения = Элементы.ОтборПериод.Имя;
	
	Если НЕ Результат = Неопределено Тогда
		
		ЭтоОчистка = Результат.ДатаНачала = Дата(1,1,1);
		
		Если Не ЗначениеЗаполнено(Результат.ДатаОкончания) Тогда
			Результат.ДатаОкончания = КонецМесяца(?(ЗначениеЗаполнено(Результат.ДатаНачала), Результат.ДатаНачала, ОбщегоНазначенияСтоматология.ТекущаяСервернаяДатаНаСервере()));		
		КонецЕсли;
		
		Если Год(Результат.ДатаОкончания) - Год(Результат.ДатаНачала) > 1 Тогда
			Результат.ДатаНачала = ДобавитьМесяц(Результат.ДатаОкончания, -12);	
		КонецЕсли;
		
		ОтборПериод = Результат;
		
		Если ПроверитьНеобходимостьФиксацииИзмененийВПлане() = Истина Тогда
			СтруктураПарметров = Новый Структура;
			СтруктураПарметров.Вставить("ИмяЭлемента"	, Элементы.ОтборПериод.Имя);		
			СтруктураПарметров.Вставить("КодДляОтката"	, Элементы.ОтборПериод.Имя + "= ОткатВыбранногоЗначения;");
			Оповещение   = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОФиксацииизменений", ЭтотОбъект, СтруктураПарметров);
			ПоказатьВопрос(Оповещение,"Имеются не сохраненные изменения, они будут потеряны. Продолжить ?",РежимДиалогаВопрос.ДаНет,,,"Планирование");
			Возврат;
		Иначе 
			ОбновитьОтображениеПланирования(Истина);
		КонецЕсли;
		УстановитьДоступностьОтборуИнтервалыРаботы();
		УстановитьТекущийЭлемент();
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
// Процедура - После вопроса о записи изменений оповещение
// 
// Параметры:
//  Ответ		 - 	 - 
//  ДопПараметры - 	 - 
// 
Процедура ПослеВопросаОЗаписиИзмененийОповещение(Ответ, ДопПараметры) Экспорт
	
	ПроверятьНеобхЗаписи = Ложь;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		КомандаСформировать(Неопределено);	
	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
		ПроверятьНеобхЗаписи = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик асинхронного вызова после диалога вопроса
// 
Процедура ПослеЗакрытияВопросаОФиксацииизменений(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ЭтоОчистка И Параметры.Свойство("ИмяЭлемента") И Параметры.ИмяЭлемента = "ОтборПериод" Тогда
			ЭтоОчистка = Ложь;
			БуферФормирования.Очистить();
			УстановитьДоступностьОтборуИнтервалыРаботы();
		КонецЕсли;
		ОбновитьОтображениеПланирования(Истина);
	Иначе
		// Выполнить откат парамтера отбора, если П нажал Нет
		Если Параметры.Свойство("КодДляОтката") И ЗначениеЗаполнено(Параметры.КодДляОтката) Тогда
			Выполнить(Параметры.КодДляОтката);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить результат планирования на сервере
// 
// Параметры:
//  ДатаНачалаПериода	 - 	 - 
//  ДатаКонцаПериода	 - 	 - 
//  СтруктураПоиска		 - 	 - 
// 
Процедура ЗаполнитьРезультатПланированияНаСервере(Знач ВыбраннаяДата, Знач ПериодКопирования)
	
	День = 86400;
	РезультатПланированияРазовый.Очистить();
	СтруктураПоиска = ПолучитьПараметрыПоиска();
	
	// Определим период-источник
	Если ПериодКопирования = "День" Тогда
		ДатаНачалаПериодаИсточника 	= НачалоДня(ВыбраннаяДата - День*7);
		ДатаКонцаПериодаИсточника 	= КонецДня(ДатаНачалаПериодаИсточника);
	ИначеЕсли ПериодКопирования = "Неделя" Тогда
		ДатаНачалаПериодаИсточника 	= ОбщегоНазначенияКлиентСерверСтоматология.ДатаПоНомеруНедели(НеделяГода(ВыбраннаяДата) - 1, Год(ВыбраннаяДата));
		ДатаКонцаПериодаИсточника 	= КонецНедели(ДатаНачалаПериодаИсточника); 
	ИначеЕсли ПериодКопирования = "Месяц" Тогда 
		ДатаНачалаПериодаИсточника 	= НачалоМесяца(НачалоМесяца(ВыбраннаяДата)-1);
		ДатаКонцаПериодаИсточника 	= КонецМесяца(НачалоМесяца(ВыбраннаяДата)-1); 
	КонецЕсли;
	
	// Период-источник не пересекается с буфером
	Если ДатаНачалаПериодаИсточника < ОтборПериод.ДатаНачала И ДатаКонцаПериодаИсточника < ОтборПериод.ДатаНачала Тогда 
		ТаблицаЗанятий = ПолучитьДанныеВнеБуфера(ДатаНачалаПериодаИсточника, ДатаКонцаПериодаИсточника, СтруктураПоиска);
	// Период-источник пересекается с буфером
	ИначеЕсли ДатаНачалаПериодаИсточника < ОтборПериод.ДатаНачала И	ДатаКонцаПериодаИсточника > ОтборПериод.ДатаНачала Тогда 
		ТаблицаЗанятий = БуферФормирования.Выгрузить();
		ТаблицаЗанятий = ТаблицаЗанятий.СкопироватьКолонки();
		ТаблицаЗанятийВнеБуфера = ПолучитьДанныеВнеБуфера(ДатаНачалаПериодаИсточника, КонецДня(НачалоДня(ОтборПериод.ДатаНачала)-1), СтруктураПоиска);
		Для Каждого СтрокаТЗ Из ТаблицаЗанятийВнеБуфера Цикл 
			НоваяСтрока = ТаблицаЗанятий.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		КонецЦикла;
		// Дополним таблицу из буфера
		Для Каждого СтрокаТЗ Из БуферФормирования Цикл 
			НоваяСтрока = ТаблицаЗанятий.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		КонецЦикла;	
	// Период-источник находится в буфере
	ИначеЕсли ДатаНачалаПериодаИсточника >= ОтборПериод.ДатаНачала И ДатаКонцаПериодаИсточника <= ОтборПериод.ДатаОкончания Тогда 
		ТаблицаЗанятий = БуферФормирования.Выгрузить();
	КонецЕсли;	
		
	// Заполняем результат планирования	
	Если ПериодКопирования = "День" Тогда
		
		СтруктураПоиска.Вставить("Дата", ДатаНачалаПериодаИсточника);			
		МассивСтрок = ТаблицаЗанятий.НайтиСтроки(СтруктураПоиска); 
		Для Каждого ЭлементМассива Из МассивСтрок Цикл
			// Если НЕ ТакоеЗанятиеУжеЕсть(СтруктураПоиска, ДатаНачалаПериодаИсточника + День*7, ЭлементМассива) Тогда 
				НоваяСтрока                     = РезультатПланированияРазовый.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
				НоваяСтрока.Дата 				= НачалоДня(ВыбраннаяДата);
			// КонецЕсли;			
		КонецЦикла;
		
	ИначеЕсли ПериодКопирования = "Неделя" Тогда 
		
		Пока ДатаНачалаПериодаИсточника < ДатаКонцаПериодаИсточника Цикл 
			Если НЕ (ДатаНачалаПериодаИсточника + День*7 < ОтборПериод.ДатаНачала ИЛИ ДатаНачалаПериодаИсточника + День*7 > ОтборПериод.ДатаОкончания) Тогда
				СтруктураПоиска.Вставить("Дата", ДатаНачалаПериодаИсточника);			
				МассивСтрок = ТаблицаЗанятий.НайтиСтроки(СтруктураПоиска); 
				Для Каждого ЭлементМассива Из МассивСтрок Цикл
					// Если НЕ ТакоеЗанятиеУжеЕсть(СтруктураПоиска, ДатаНачалаПериодаИсточника + День*7, ЭлементМассива) Тогда 
						НоваяСтрока                     = РезультатПланированияРазовый.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
						НоваяСтрока.Дата 				= НоваяСтрока.Дата + День*7;
					// КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			ДатаНачалаПериодаИсточника = ДатаНачалаПериодаИсточника + День;
		КонецЦикла;
		
	ИначеЕсли ПериодКопирования = "Месяц" Тогда
		
		ДатаНачалаПериодаПриемника = ДобавитьМесяц(ДатаНачалаПериодаИсточника, 1);
		ДатаКонцаПериодаИсточника = КонецДня(ДобавитьМесяц(ДобавитьМесяц(ДатаКонцаПериодаИсточника, 1), -1));
		Пока ДатаНачалаПериодаИсточника < ДатаКонцаПериодаИсточника Цикл 
			
			Если ДеньНедели(ДатаНачалаПериодаПриемника) > ДеньНедели(ДатаНачалаПериодаИсточника) Тогда 
				ДатаНачалаПериодаИсточника = ДатаНачалаПериодаИсточника + День;
			ИначеЕсли ДеньНедели(ДатаНачалаПериодаПриемника) < ДеньНедели(ДатаНачалаПериодаИсточника) Тогда	
			    ДатаНачалаПериодаПриемника = ДатаНачалаПериодаПриемника + День*(ДеньНедели(ДатаНачалаПериодаИсточника) - ДеньНедели(ДатаНачалаПериодаПриемника));
			КонецЕсли;
			
			Если ДеньНедели(ДатаНачалаПериодаПриемника) = ДеньНедели(ДатаНачалаПериодаИсточника) Тогда
				Если НЕ (ДобавитьМесяц(ДатаНачалаПериодаИсточника, 1) < ОтборПериод.ДатаНачала ИЛИ ДобавитьМесяц(ДатаНачалаПериодаИсточника, 1) > ОтборПериод.ДатаОкончания) Тогда
					СтруктураПоиска.Вставить("Дата", ДатаНачалаПериодаИсточника);			
					МассивСтрок = ТаблицаЗанятий.НайтиСтроки(СтруктураПоиска); 
					Для Каждого ЭлементМассива Из МассивСтрок Цикл
						Если НЕ ТакоеЗанятиеУжеЕсть(СтруктураПоиска, ДатаНачалаПериодаПриемника, ЭлементМассива) Тогда 
							НоваяСтрока                       = РезультатПланированияРазовый.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
							НоваяСтрока.Дата 				= ДатаНачалаПериодаПриемника;
							НоваяСтрока.ДатаВремяНачала 	= НачалоДня(ДатаНачалаПериодаПриемника) + Час(НоваяСтрока.ДатаВремяНачала)*60*60 + Минута(НоваяСтрока.ДатаВремяНачала)*60;
							НоваяСтрока.ДатаВремяОкончания 	= НачалоДня(ДатаНачалаПериодаПриемника) + Час(НоваяСтрока.ДатаВремяОкончания)*60*60 + Минута(НоваяСтрока.ДатаВремяОкончания)*60;
						КонецЕсли;						
					КонецЦикла;
				КонецЕсли;
				ДатаНачалаПериодаИсточника = ДатаНачалаПериодаИсточника + День;
			    ДатаНачалаПериодаПриемника = ДатаНачалаПериодаПриемника + День;
			КонецЕсли;
			
			Если ДатаНачалаПериодаПриемника > КонецМесяца(ДатаНачалаПериодаПриемника) Тогда 
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Функция - Получить параметры поиска
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьПараметрыПоиска()
	
	СтруктураПоиска = Новый Структура;
	
	Если ЗначениеЗаполнено(ОтборСотрудник) Тогда 
		СтруктураПоиска.Вставить("Сотрудник", ОтборСотрудник);
	КонецЕсли;
	
	Возврат СтруктураПоиска;

КонецФункции

&НаСервере
// Функция - Получить данные вне буфера
// 
// Параметры:
//  ДатаНачалаПериода	 - 	 - 
//  ДатаКонцаПериода	 - 	 - 
//  СтруктураПоиска		 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьДанныеВнеБуфера(Знач ДатаНачалаПериода, Знач ДатаКонцаПериода, Знач СтруктураПоиска)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремяРаботыСотрудниковПлан.ДатаВремяНачала КАК ДатаВремяНачала,
	|	ВремяРаботыСотрудниковПлан.ДатаВремяОкончания КАК ДатаВремяОкончания,
	|	ВремяРаботыСотрудниковПлан.Сотрудник КАК Сотрудник,
	|	ВремяРаботыСотрудниковПлан.Сотрудник.Должность КАК Должность,
	|	ВремяРаботыСотрудниковПлан.Минуты КАК КолМинут
	|ИЗ
	|	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
	|ГДЕ
	|	ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ВЫБОР
	|			КОГДА &Сотрудник <> НЕОПРЕДЕЛЕНО
	|					И &ГруппаСотрудников = ИСТИНА
	|				ТОГДА ВремяРаботыСотрудниковПлан.Сотрудник В ИЕРАРХИИ (&Сотрудник)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &Сотрудник <> НЕОПРЕДЕЛЕНО
	|					И &ГруппаСотрудников = ЛОЖЬ
	|				ТОГДА ВремяРаботыСотрудниковПлан.Сотрудник = &Сотрудник
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВремяРаботыСотрудниковПлан.ДатаВремяНачала >= &НачалоПериода
	|	И ВремяРаботыСотрудниковПлан.ДатаВремяОкончания <= &ОкончаниеПериода
	|	И ВремяРаботыСотрудниковПлан.ТипРабочегоВремени <> ЗНАЧЕНИЕ(Перечисление.ТипыРабочегоВремени.Отпуск)
	|	И ВремяРаботыСотрудниковПлан.ТипРабочегоВремени <> ЗНАЧЕНИЕ(Перечисление.ТипыРабочегоВремени.Больничный)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВремяРаботыСотрудниковПлан.МесяцОтбор,
	|	Сотрудник,
	|	Должность,
	|	ДатаВремяНачала");
	
	Запрос.УстановитьПараметр("НачалоПериода"    , НачалоДня(ДатаНачалаПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериода" , КонецДня(ДатаКонцаПериода));
	Запрос.УстановитьПараметр("Помещение"        , ?(СтруктураПоиска.Свойство("Помещение") И ЗначениеЗаполнено(СтруктураПоиска.Помещение), СтруктураПоиска.Помещение, Неопределено));
	Запрос.УстановитьПараметр("ГруппаСотрудников", ?(СтруктураПоиска.Свойство("Сотрудник") И ЗначениеЗаполнено(СтруктураПоиска.Сотрудник) И СтруктураПоиска.Сотрудник.ЭтоГруппа, Истина, Ложь));
	Запрос.УстановитьПараметр("Сотрудник"        , ?(СтруктураПоиска.Свойство("Сотрудник") И ЗначениеЗаполнено(СтруктураПоиска.Сотрудник), СтруктураПоиска.Сотрудник, Неопределено));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница" , ОтборСтруктурнаяЕдиница);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТЗ_ВремяРаботыСотрудников = БуферФормирования.Выгрузить();
	ТЗ_ВремяРаботыСотрудников = ТЗ_ВремяРаботыСотрудников.СкопироватьКолонки();
	
	ТекДень            	= Неопределено;
	ПредДень           	= Неопределено;
	ТекСтрока_ТЗ    	= Неопределено;
	ПредСтрока_ТЗ   	= Неопределено;
	ПредставлениеИнтервала = "";
	
	Пока Выборка.Следующий() Цикл
		// Получаем дату тек. дня
		ТекДень = День(Выборка.ДатаВремяНачала);
		// Если тек дата не совпадает или указанные параметры
		// создаем новую строку бофуера, иначе считаем что это след. интервал в тот же день
		Если ТекДень <> ПредДень 
			ИЛИ ТекСтрока_ТЗ = Неопределено 
			ИЛИ ТекСтрока_ТЗ.Сотрудник <> Выборка.Сотрудник
			ИЛИ ТекСтрока_ТЗ.Должность <> Выборка.Должность
			ИЛИ ТекСтрока_ТЗ.Помещение <> Выборка.Помещение Тогда
			
			ТекСтрока_ТЗ = ТЗ_ВремяРаботыСотрудников.Добавить();
			ЗаполнитьЗначенияСвойств(ТекСтрока_ТЗ, Выборка);
			ТекСтрока_ТЗ.ИдентификаторОбласти  = Новый УникальныйИдентификатор;
			ТекСтрока_ТЗ.Дата                  = Выборка.ДатаВремяНачала;
			ТекСтрока_ТЗ.СуммаРабочегоВремени  = Выборка.КолМинут;
		Иначе
			ТекСтрока_ТЗ.СуммаРабочегоВремени = ТекСтрока_ТЗ.СуммаРабочегоВремени + Выборка.КолМинут;
		КонецЕсли;
		
		// Переменная оптимизации. Кеширует массив данных на время серверного вызова
		МассивНадстрочныхСимволов = Неопределено;
		ПериодРаботы              = Новый Структура("НачалоРаботы, ОкончаниеРаботы,ВсегоМинут", Выборка.ДатаВремяНачала
		, Выборка.ДатаВремяОкончания
		, Выборка.КолМинут);	  
		НачалоПредст              = Формат(ПериодРаботы.НачалоРаботы	, "ДФ=HH:mm"); 
		КонецПредст               = Формат(ПериодРаботы.ОкончаниеРаботы	, "ДФ=HH:mm"); 
		
		ВремяИнтервала 			= ?(Выборка.КолМинут > 60, Строка(ОбщегоНазначенияКлиентСерверСтоматология.КонвертироватьМинутыВЧасы(Выборка.КолМинут)), Строка(Выборка.КолМинут) + " мин.");
		
		ПредставлениеИнтервала = НачалоПредст + " - " + КонецПредст + " (" + ВремяИнтервала + ")";
		ТекСтрока_ТЗ.ИнтервалыРаботы.Добавить(ПериодРаботы, ПредставлениеИнтервала);
		ТекСтрока_ТЗ.ИнтервалыРаботыПредст = Обработки.ПланированиеИндивидуальногоГрафика.ПолучитьПредставлениеСпискаИнтервалов(ТекСтрока_ТЗ.ИнтервалыРаботы);
		
		ПредДень      = ТекДень;
		ПредСтрока_ТЗ = ТекСтрока_ТЗ;	  
	КонецЦикла;	 
	
	Возврат ТЗ_ВремяРаботыСотрудников;
	
КонецФункции

&НаСервере
// Функция - Такое занятие уже есть
// 
// Параметры:
//  СтруктураПоиска				 - 	 - 
//  ДатаНачалаПериодаПриемника	 - 	 - 
//  СтрокаИсточника				 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ТакоеЗанятиеУжеЕсть(Знач СтруктураПоиска, Знач ДатаНачалаПериодаПриемника, Знач СтрокаИсточника)
	
	Флаг = Ложь;
	ДатаНачалаПериодаИсточника = СтруктураПоиска.Дата;
	СтруктураПоиска.Вставить("Дата", ДатаНачалаПериодаПриемника);
	МассивСтрокПриемника = БуферФормирования.НайтиСтроки(СтруктураПоиска);
	Если МассивСтрокПриемника.Количество() > 0 Тогда 
		Для Каждого ЭлементМассива Из МассивСтрокПриемника Цикл 
			Если СтрокаИсточника.Сотрудник = ЭлементМассива.Сотрудник
				И Час(СтрокаИсточника.ДатаВремяНачала) = Час(ЭлементМассива.ДатаВремяНачала)
				И Минута(СтрокаИсточника.ДатаВремяНачала) = Минута(ЭлементМассива.ДатаВремяНачала)
				И Час(СтрокаИсточника.ДатаВремяОкончания) = Час(ЭлементМассива.ДатаВремяОкончания)
				И Минута(СтрокаИсточника.ДатаВремяОкончания) = Минута(ЭлементМассива.ДатаВремяОкончания) Тогда 
				
				Флаг = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Флаг;			
	
КонецФункции

#Область МетодыВизуализацииПланаИРаботаСБуферомФормирония

&НаСервере
// Сформировать план занятий на сервере
// 
Процедура ОбновитьОтображениеПланирования(ПерезаполнитьБуфер)
	
	СформироватьТекстПериода();
	
	// Вывод шапки с наименованием дней недели
	ЗаголовокТаблицы = ПолучитьШапкуHTML();
	
	Если НЕ ЗначениеЗаполнено(ОтборПериод.ДатаНачала) И НЕ ЗначениеЗаполнено(ОтборПериод.ДатаОкончания) Тогда
		HTMLПанельПланирования = ЗаголовокТаблицы + "</body></html>";
		Возврат;
	КонецЕсли;
	
	// Очищаем таблицу областей
	ПеречислениеОбластей.Очистить();
	
	// Заполняем буфер существующими занятиями
	Если ПерезаполнитьБуфер = Истина Тогда
		ЗаполнитьБуферСуществующимиДанными();
	КонецЕсли;
	
	БуферФормирования.Сортировать("Дата, Сотрудник");
	
	// Используем XML для конкатенации строк
	// Конкатенация строк является достаточно дорогой с точки зрения производительности операцией.
	// На небольших строках/циклах потери производительности незаметны, но на больших циклах (десятки тысяч) и/или
	// на больших объёмах (десятки мегабайт) это может привести к серьёзным падениям производительности.
	ТекстовыйПосторитель = Новый ЗаписьXML;
	ТекстовыйПосторитель.УстановитьСтроку();		
	
	// Выведем наименование месяца года
	ВывестиНаименованиеМесяцаПланирования(ТекстовыйПосторитель, ОтборПериод.ДатаНачала);
	ТекстовыйПосторитель.ЗаписатьБезОбработки("<div class='TABLE_PLANNING_CHART'>" + Символы.ПС);
	
	ТекДатаПозиции             = НачалоДня(ОтборПериод.ДатаНачала);
	ДеньНеделиТекСтрокиБуфера  = 0;
	ТекМесяцГода               = Месяц(ТекДатаПозиции);
	ДеньНеделиТекОбластиВывода = 1;
	ОбластьВывода              = Неопределено;
	БуферданныхНаНеделю        = Неопределено;
	ЗабитьПустымиОбластями     = Ложь;
	
	// Основной цикл последовательного заполнения месячного плана,
	// по схеме сверху вниз, слева направо. С многократным проходом
	// по недельной строке, если в один и тот же день более одного занятия
	Пока ТекДатаПозиции <= КонецДня(ОтборПериод.ДатаОкончания) Цикл
		
		// При окончании тек. месяца, добить заглушками
		// до конца недели и вывести заголовок периода отображения
		Пока ТекМесяцГода <> Месяц(ТекДатаПозиции) Цикл
			Если ДеньНеделиТекОбластиВывода = 1 Тогда
				ТекМесяцГода 			= Месяц(ТекДатаПозиции); 
				ЗабитьПустымиОбластями 	= Ложь;
				
				// Закроем таблицу предыдущего месяца
				ТекстовыйПосторитель.ЗаписатьБезОбработки(Символы.ПС + "</div>" + Символы.ПС);
				// Выведем наименование месяца года
				ВывестиНаименованиеМесяцаПланирования(ТекстовыйПосторитель, ТекДатаПозиции);
				// Открываем таблицу
				ТекстовыйПосторитель.ЗаписатьБезОбработки("<div class='TABLE_PLANNING_CHART'>" + Символы.ПС);
			Иначе
				ВывестиНевидимуюЗаглушкуДня(ТекстовыйПосторитель, Истина);
				
				ДеньНеделиТекОбластиВывода = ДеньНеделиТекОбластиВывода + 1;
				Если ДеньНеделиТекОбластиВывода > 7 Тогда
					// Закрываем строку недели
					ТекстовыйПосторитель.ЗаписатьБезОбработки(Символы.ПС + Символы.ПС + "</div>" + Символы.ПС);
					ДеньНеделиТекОбластиВывода = 1;
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		          
		// В начале каждой недели отбираем все занятия за текущую неделю
		Если ДеньНеделиТекОбластиВывода = 1 Тогда
			// Открываем строку недели
			ЗавершенВыводНедели = Ложь;
			ТекстовыйПосторитель.ЗаписатьБезОбработки(Символы.ПС + "<div class='WEEK'>");
			Если День(ТекДатаПозиции) = 1 Тогда 
			    БуферданныхНаНеделю = ЗанятияЗаНеделюИзБуфераДляОтображения(ТекДатаПозиции,КонецНедели(ТекДатаПозиции));	
			ИначеЕсли Месяц(КонецНедели(ТекДатаПозиции)) = ТекМесяцГода Тогда 
			    БуферданныхНаНеделю = ЗанятияЗаНеделюИзБуфераДляОтображения(НачалоНедели(ТекДатаПозиции),КонецНедели(ТекДатаПозиции));
			Иначе
				БуферданныхНаНеделю = ЗанятияЗаНеделюИзБуфераДляОтображения(НачалоНедели(ТекДатаПозиции),КонецМесяца(ТекДатаПозиции));
			КонецЕсли;	
		КонецЕсли;
		
		// Если в текущей неделе есть занятия выводим их в цикле
		// пока буфер на тек. неделю не иссякнет 
		Если БуферданныхНаНеделю.Количество() > 0 Тогда
			ВременноеХранениеТекПозицииДаты = ТекДатаПозиции;
			ЭтоПервыйПроход                 = Истина;
			Пока БуферданныхНаНеделю.Количество() > 0 Цикл
				
				ДеньНеделиТекСтрокиБуфера         = ДеньНедели(ТекДатаПозиции);		
				// Ищем подходящее по времени занятия для текущей позиции вывода
				СтрокаБуфераВЭтотДень = ПервоеВОчередиЗанятиеВЭтотДеньИЗБуфера(БуферданныхНаНеделю, ДеньНеделиТекОбластиВывода);
				// Если позиция текущего вывода дает возможность вывести занятие
				Если СтрокаБуфераВЭтотДень <> Неопределено Тогда
					
					РазрешитьИзменениеЦветаОбласти = Истина;
					ВнутренняяОбласть              = Неопределено;
					// В зависимости от вида операции над занятияем выбираем область макета
					Если СтрокаБуфераВЭтотДень.Операция = "" 
					  ИЛИ СтрокаБуфераВЭтотДень.Операция = "Создать" Тогда 
					  
						ВывестиРабочийДеньСотрудника(ТекстовыйПосторитель, СтрокаБуфераВЭтотДень, ТекДатаПозиции, ЭтоПервыйПроход, СтрокаБуфераВЭтотДень.ИдентификаторОбласти);
						                     
						Если ЭтоПервыйПроход = Истина Тогда
							ДобавитьВПеречислениеОбластей(ТекДатаПозиции, СтрокаБуфераВЭтотДень.ИдентификаторОбласти);
						КонецЕсли;
						
					// Удаление занятия	
					ИначеЕсли СтрокаБуфераВЭтотДень.Операция = "Удалить" Тогда
						
						ВывестиУдаленныйРабочийДеньСотрудника(ТекстовыйПосторитель, СтрокаБуфераВЭтотДень, ТекДатаПозиции, ЭтоПервыйПроход, СтрокаБуфераВЭтотДень.ИдентификаторОбласти);
						
						Если ЭтоПервыйПроход = Истина Тогда
							ДобавитьВПеречислениеОбластей(ТекДатаПозиции, СтрокаБуфераВЭтотДень.ИдентификаторОбласти);
						КонецЕсли;						
						РазрешитьИзменениеЦветаОбласти  = Ложь;
						
					КонецЕсли;
					
					// Строку данных из буфера на неделю вывели, теперь можно ее удалить
					БуферданныхНаНеделю.Удалить(БуферданныхНаНеделю.Найти(СтрокаБуфераВЭтотДень));
				// В этот день нет занятия	
				Иначе
					
					ЭтотДеньРабочий = МасивРабочихДнейНедели.Найти(ДеньНеделиТекОбластиВывода) <> Неопределено;
					// Этот день рабочий 
					Если ТекМесяцГода = Месяц(ТекДатаПозиции) И ДеньНеделиТекОбластиВывода = ДеньНеделиТекСтрокиБуфера И ЭтоПервыйПроход = Истина И ЭтотДеньРабочий = Истина Тогда
						
						// Добавить область в перечисление
						НовыйУИД = Новый УникальныйИдентификатор;
						ДобавитьВПеречислениеОбластей(ТекДатаПозиции, НовыйУИД);
						ВывестиРабочийНезанятыйДень(ТекстовыйПосторитель, ТекДатаПозиции, НовыйУИД);
						
					// Если это не рабочий день	
					ИначеЕсли ТекМесяцГода = Месяц(ТекДатаПозиции) И  ДеньНеделиТекОбластиВывода = ДеньНеделиТекСтрокиБуфера И ЭтотДеньРабочий = Ложь Тогда						
						ВывестиНеРабочийДень(ТекстовыйПосторитель, ТекДатаПозиции);						
					// Заглушка области	
					Иначе						
						ВывестиНевидимуюЗаглушкуДня(ТекстовыйПосторитель, ЭтоПервыйПроход);						
					КонецЕсли;
				КонецЕсли;	
				
				// Наращивание тек. даты на 24 часа
				Если ДеньНеделиТекОбластиВывода = ДеньНеделиТекСтрокиБуфера  Тогда
					ТекДатаПозиции = ТекДатаПозиции + (24 * 60 * 60);
				КонецЕсли;
				
				// Окончание тек. недели
				Если ДеньНеделиТекОбластиВывода = 7 Тогда
					Если НЕ ЗавершенВыводНедели Тогда 
						// Закрываем строку недели
						ТекстовыйПосторитель.ЗаписатьБезОбработки(Символы.ПС + Символы.ПС + "</div>" + Символы.ПС);
						ЗавершенВыводНедели = НЕ ЗавершенВыводНедели И НЕ БуферданныхНаНеделю.Количество() > 0;						
					КонецЕсли;	
					ДеньНеделиТекОбластиВывода    = 1;
					Если БуферданныхНаНеделю.Количество() > 0 Тогда
						ТекДатаПозиции = ВременноеХранениеТекПозицииДаты;
						ТекстовыйПосторитель.ЗаписатьБезОбработки(Символы.ПС + "<div class='WEEK'>");
					КонецЕсли;
					ЭтоПервыйПроход      = Ложь;
				Иначе
					Если НЕ ТекДатаПозиции <= КонецДня(ОтборПериод.ДатаОкончания) Тогда 
						Если НЕ ЗавершенВыводНедели И ДеньНеделиТекОбластиВывода = 7 Тогда				
							// Закрываем строку недели
							ТекстовыйПосторитель.ЗаписатьБезОбработки(Символы.ПС + Символы.ПС + "</div>" + Символы.ПС);
							ЗавершенВыводНедели = НЕ ЗавершенВыводНедели И НЕ БуферданныхНаНеделю.Количество() > 0;
						КонецЕсли;
					КонецЕсли;	
					ДеньНеделиТекОбластиВывода = ДеньНеделиТекОбластиВывода + 1;
				КонецЕсли;		 
			КонецЦикла;
			
			// Выставить данный флаг если это не первый проход
			// и оставшуюся справа область необходимо забить пустотой
			ЗабитьПустымиОбластями = ЭтоПервыйПроход = Ложь И ДеньНеделиТекОбластиВывода > 1;
			
		// Если в недельном буфере нет занятий, выводим пустые областя	
		Иначе
			                              
			ДеньНеделиТекСтрокиБуфера = ДеньНедели(ТекДатаПозиции);	
			ЭтотДеньРабочий     = МасивРабочихДнейНедели.Найти(ДеньНеделиТекОбластиВывода) <> Неопределено;
			// Этот день рабочий 
			Если ДеньНеделиТекОбластиВывода = ДеньНеделиТекСтрокиБуфера И ЗабитьПустымиОбластями = Ложь И ЭтотДеньРабочий = Истина Тогда
				// Добавить область в перечисление
				НовыйУИД = Новый УникальныйИдентификатор;
				ДобавитьВПеречислениеОбластей(ТекДатаПозиции, НовыйУИД);				
				ВывестиРабочийНезанятыйДень(ТекстовыйПосторитель, ТекДатаПозиции, НовыйУИД);				
			// Если это не рабочий день	
			ИначеЕсли ДеньНеделиТекОбластиВывода = ДеньНеделиТекСтрокиБуфера И ЭтотДеньРабочий = Ложь И ЗабитьПустымиОбластями = Ложь Тогда			
				ВывестиНеРабочийДень(ТекстовыйПосторитель, ТекДатаПозиции);			
			// Заглушка области	
			Иначе
				ВывестиНевидимуюЗаглушкуДня(ТекстовыйПосторитель, НЕ ЗабитьПустымиОбластями);			
			КонецЕсли;
			
			// Наращивание тек. даты на 24 часа
			Если ДеньНеделиТекОбластиВывода = ДеньНеделиТекСтрокиБуфера  Тогда
				ТекДатаПозиции = ТекДатаПозиции + (24 * 60 * 60);
			КонецЕсли;
			
			// Окончание тек. недели
			Если ДеньНеделиТекОбластиВывода = 7 Тогда
				Если НЕ ЗавершенВыводНедели Тогда				
					// Закрываем строку недели
					ТекстовыйПосторитель.ЗаписатьБезОбработки(Символы.ПС + Символы.ПС + "</div>" + Символы.ПС);
					ЗавершенВыводНедели = НЕ ЗавершенВыводНедели;
				КонецЕсли;
				ДеньНеделиТекОбластиВывода      = 1 ;
				ЗабитьПустымиОбластями = Ложь;
			Иначе
				ДеньНеделиТекОбластиВывода = ДеньНеделиТекОбластиВывода + 1;
				Если НЕ ТекДатаПозиции <= КонецДня(ОтборПериод.ДатаОкончания) Тогда 
					Если НЕ ЗавершенВыводНедели Тогда				
						// Закрываем строку недели
						ТекстовыйПосторитель.ЗаписатьБезОбработки(Символы.ПС + Символы.ПС + "</div>" + Символы.ПС);
						ЗавершенВыводНедели = НЕ ЗавершенВыводНедели;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;				
		КонецЕсли;
		
	КонецЦикла;
	
	// Закроем таблицу месяца
	ТекстовыйПосторитель.ЗаписатьБезОбработки("</div>");							
	
	// Получаем готовый HTML-документ
	HTMLПанельПланирования = ЗаголовокТаблицы + ТекстовыйПосторитель.Закрыть() + Символы.ПС + "</body></html>";
	
	// Очищаем построитель
	ТекстовыйПосторитель = Неопределено;
	
КонецПроцедуры

&НаСервере
// Заполнить буфер существующими записями занятий
// 
Процедура ЗаполнитьБуферСуществующимиДанными()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремяРаботыСотрудниковПлан.ДатаВремяНачала КАК ДатаВремяНачала,
	|	ВремяРаботыСотрудниковПлан.ДатаВремяОкончания КАК ДатаВремяОкончания,
	|	ВремяРаботыСотрудниковПлан.Сотрудник КАК Сотрудник,
	|	ВремяРаботыСотрудниковПлан.Сотрудник.Должность КАК Должность,
	|	ВремяРаботыСотрудниковПлан.Минуты КАК КолМинут,
	|	ВремяРаботыСотрудниковПлан.ТипРабочегоВремени КАК ТипРабочегоВремени
	|ИЗ
	|	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
	|ГДЕ
	|	ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ВЫБОР
	|			КОГДА &Сотрудник <> НЕОПРЕДЕЛЕНО
	|					И &ГруппаСотрудников = ИСТИНА
	|				ТОГДА ВремяРаботыСотрудниковПлан.Сотрудник В ИЕРАРХИИ (&Сотрудник)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &Сотрудник <> НЕОПРЕДЕЛЕНО
	|					И &ГруппаСотрудников = ЛОЖЬ
	|				ТОГДА ВремяРаботыСотрудниковПлан.Сотрудник = &Сотрудник
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВремяРаботыСотрудниковПлан.ДатаВремяНачала >= &НачалоПериода
	|	И ВремяРаботыСотрудниковПлан.ДатаВремяНачала <= &ОкончаниеПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВремяРаботыСотрудниковПлан.МесяцОтбор,
	|	Сотрудник,
	|	Должность,
	|	ДатаВремяНачала"
	);
	
	Запрос.УстановитьПараметр("НачалоПериода"      , НачалоДня(ОтборПериод.ДатаНачала));
	Запрос.УстановитьПараметр("ОкончаниеПериода"   , КонецДня(ОтборПериод.ДатаОкончания));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница" , ОтборСтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Сотрудник"          , ?(ЗначениеЗаполнено(ОтборСотрудник),ОтборСотрудник,Неопределено));
	Запрос.УстановитьПараметр("ГруппаСотрудников"  , ЗначениеЗаполнено(ОтборСотрудник) И ОтборСотрудник.ЭтоГруппа);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	БуферФормирования.Очистить();
	ТекДень            = Неопределено;
	ПредДень           = Неопределено;
	ТекСтрокаБуфера    = Неопределено;
	ПредСтрокаБуфера   = Неопределено;
	ПредставлениеИнтервала = "";
	
	Пока Выборка.Следующий() Цикл
		// Получаем дату тек. дня
		ТекДень = День(Выборка.ДатаВремяНачала);
		// Если тек дата не совпадает или указанные параметры
		// создаем новую строку бофуера, иначе считаем что это след. интервал в тот же день
		Если ТекДень <> ПредДень 
			ИЛИ ТекСтрокаБуфера = Неопределено 
			ИЛИ ТекСтрокаБуфера.Сотрудник <> Выборка.Сотрудник
			ИЛИ ТекСтрокаБуфера.Должность <> Выборка.Должность Тогда
			
			ТекСтрокаБуфера = БуферФормирования.Добавить();
			ЗаполнитьЗначенияСвойств(ТекСтрокаБуфера, Выборка);
			ТекСтрокаБуфера.ИдентификаторОбласти  = Новый УникальныйИдентификатор;
			ТекСтрокаБуфера.Дата                  = Выборка.ДатаВремяНачала;
			ТекСтрокаБуфера.СуммаРабочегоВремени  = Выборка.КолМинут;
		Иначе
			ТекСтрокаБуфера.СуммаРабочегоВремени = ТекСтрокаБуфера.СуммаРабочегоВремени + Выборка.КолМинут;
		КонецЕсли;
		
		// Переменная оптимизации. Кеширует массив данных на время серверного вызова
		МассивНадстрочныхСимволов = Неопределено;
		ПериодРаботы              = Новый Структура("НачалоРаботы, ОкончаниеРаботы,ВсегоМинут", Выборка.ДатаВремяНачала
		, Выборка.ДатаВремяОкончания
		, Выборка.КолМинут);	  
		НачалоПредст              = Формат(ПериодРаботы.НачалоРаботы	, "ДФ=HH:mm"); // Обработки.ПланированиеГрафикРаботыСотрудников.ПредставлениеВремениСНадстрочнымиСимволами(ПериодРаботы.НачалоРаботы, МассивНадстрочныхСимволов);
		КонецПредст               = Формат(ПериодРаботы.ОкончаниеРаботы	, "ДФ=HH:mm"); // Обработки.ПланированиеГрафикРаботыСотрудников.ПредставлениеВремениСНадстрочнымиСимволами(ПериодРаботы.ОкончаниеРаботы, МассивНадстрочныхСимволов);
		
		ВремяИнтервала 			= ?(Выборка.КолМинут > 60, Строка(ОбщегоНазначенияКлиентСерверСтоматология.КонвертироватьМинутыВЧасы(Выборка.КолМинут)), Строка(Выборка.КолМинут) + " мин.");
		
		ПредставлениеИнтервала = НачалоПредст + " - " + КонецПредст + " (" + ВремяИнтервала + ")";
		ТекСтрокаБуфера.ИнтервалыРаботы.Добавить(ПериодРаботы, ПредставлениеИнтервала);
		ТекСтрокаБуфера.ИнтервалыРаботыПредст = Обработки.ПланированиеИндивидуальногоГрафика.ПолучитьПредставлениеСпискаИнтервалов(ТекСтрокаБуфера.ИнтервалыРаботы);
		
		ПредДень         = ТекДень;
		ПредСтрокаБуфера = ТекСтрокаБуфера;	  
	КонецЦикла;	 	
	
	// заполняме таблицу уволенных 
	Запрос = новый ЗАпрос;
	ЗАпрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	Сотрудники.Должность КАК Должность,
	|	НастройкиСотрудников.ДатаПриема КАК ДатаПриема,
	|	НастройкиСотрудников.ДатаУвольнения КАК ДатаУвольнения
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|		ПО (НастройкиСотрудников.Сотрудник = Сотрудники.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО (Пользователи.Сотрудник = Сотрудники.Ссылка)
	|ГДЕ
	|	НЕ Сотрудники.ЭтоГруппа
	|	И НЕ Сотрудники.ПометкаУдаления
	|	И НЕ Пользователи.РольПользователя В (&СписокРолей)
	|	И НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудники.Наименование";  	
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, ОтборСтруктурнаяЕдиница);
	
	СписокРолей = Новый СписокЗначений;
	СписокРолей.Добавить(Перечисления.РольПользователя.АдминистраторБазыДанных);
	СписокРолей.Добавить(Перечисления.РольПользователя.ПустаяСсылка());	
	
	Запрос.УстановитьПараметр("СписокРолей"	, СписокРолей);  		
	
	ТаблицаСотрудников = Запрос.Выполнить().Выгрузить(); 
	
	// сохраняем в элементах формы для дальнейшенго контроля
	ТаблицаСотрудниковДатыПриемаУвольнения.Очистить(); 		
	
	Для Каждого СтрокаПериодРаботы Из ТаблицаСотрудников Цикл
		
		Если НЕ((ЗначениеЗаполнено(СтрокаПериодРаботы.ДатаПриема)
			и СтрокаПериодРаботы.ДатаПриема <= ОтборПериод.ДатаОкончания или НЕ ЗначениеЗаполнено(СтрокаПериодРаботы.ДатаПриема))
			и (ЗначениеЗаполнено(СтрокаПериодРаботы.ДатаУвольнения) и СтрокаПериодРаботы.ДатаУвольнения >= ОтборПериод.ДатаНачала или НЕ ЗначениеЗаполнено(СтрокаПериодРаботы.ДатаУвольнения)))  Тогда 
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрокаТаблицыСотрудниковДатыПриемаУвольнения = ТаблицаСотрудниковДатыПриемаУвольнения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицыСотрудниковДатыПриемаУвольнения, СтрокаПериодРаботы);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура дополнения буфера новыми данными планирования
// 
Процедура ДополнитьБуферНовымиДаннымиПланирования(ТаблицаРезПланирования, ПроверкаВизитов = Истина)
	
	// Заполняем буфер новыми данными
	НомерОперации = НомерПоследнейОперацииВОчередиБуфераНаСервере() + 1;
	Для Каждого СтрокаРЗ ИЗ ТаблицаРезПланирования Цикл
		
		ФлагПроверки	= Истина;
		ИнтервалыРаботыПредст = Обработки.ПланированиеИндивидуальногоГрафика.ПолучитьПредставлениеСпискаИнтервалов(СтрокаРЗ.ИнтервалыРаботы);
			
		// проверка на дату увольнения и дату приема
		МассивДатыПриемаУвольнения = ТаблицаСотрудниковДатыПриемаУвольнения.НайтиСтроки(Новый Структура("Сотрудник", СтрокаРЗ.Сотрудник));
		Если МассивДатыПриемаУвольнения.Количество() > 0 Тогда
			СтрокаМассиваДатыПриемаУвольнения = МассивДатыПриемаУвольнения[0];
			Если НЕ (ЗначениеЗаполнено(СтрокаМассиваДатыПриемаУвольнения.ДатаПриема) и СтрокаМассиваДатыПриемаУвольнения.ДатаПриема <= СтрокаРЗ.Дата или НЕ ЗначениеЗаполнено(СтрокаМассиваДатыПриемаУвольнения.ДатаПриема)) Тогда
				
				ФлагПроверки = Ложь;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка задания периодов работы: " + Строка(Формат(СтрокаРЗ.Дата,"ДЛФ=ДД.ММ.ГГ"))+" "+Строка(ОтборСтруктурнаяЕдиница)+" сотрудник " + Строка(СтрокаРЗ.Сотрудник) + " еще не принят на работу."
				+?(ЗначениеЗаполнено(СтрокаМассиваДатыПриемаУвольнения.ДатаПриема),"Дата приема на работу "+Строка(Формат(СтрокаМассиваДатыПриемаУвольнения.ДатаПриема,"ДЛФ=ДД.ММ.ГГ")),"")
				);
				
			КонецЕсли;   			
			
			Если  НЕ (ЗначениеЗаполнено(СтрокаМассиваДатыПриемаУвольнения.ДатаУвольнения) и СтрокаМассиваДатыПриемаУвольнения.ДатаУвольнения >= СтрокаРЗ.Дата  или НЕ ЗначениеЗаполнено(СтрокаМассиваДатыПриемаУвольнения.ДатаУвольнения))  Тогда 
				
				ФлагПроверки = Ложь;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка задания периодов работы: " + Строка(Формат(СтрокаРЗ.Дата,"ДЛФ=ДД.ММ.ГГ"))+" "+Строка(ОтборСтруктурнаяЕдиница)+" сотрудник " + Строка(СтрокаРЗ.Сотрудник) + " уже уволен."
				+?(ЗначениеЗаполнено(СтрокаМассиваДатыПриемаУвольнения.ДатаУвольнения),", дата увольнения "+Строка(Формат(СтрокаМассиваДатыПриемаУвольнения.ДатаУвольнения,"ДЛФ=ДД.ММ.ГГ")),"") );
				
			КонецЕсли;		
		КонецЕсли;       
		
		// проверка на наличие визитов
		Если ПроверкаВизитов Тогда
			ВизитыВходятВИнтервалыРабот = ПроверитьВизитыВходятВИнтервалыРабот(СтрокаРЗ.Сотрудник, СтрокаРЗ.Дата, ОтборСтруктурнаяЕдиница, СтрокаРЗ.ИнтервалыРаботы);   			
			Если Не ВизитыВходятВИнтервалыРабот Тогда 
				ФлагПроверки = Ложь;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У сотрудника " + СтрокаРЗ.Сотрудник + " " + Формат(СтрокаРЗ.Дата, "ДЛФ = ДДММГГ")+ " запланированы визиты, не входящие в выбранные смены.");			
			КонецЕсли;  
		КонецЕсли;
		
		Если (СтрокаРЗ.Свойство("ТипРабочегоВремени")
			И СтрокаРЗ.ТипРабочегоВремени <> Перечисления.ТипыРабочегоВремени.Больничный 
			И СтрокаРЗ.ТипРабочегоВремени <> Перечисления.ТипыРабочегоВремени.Отпуск)
			ИЛИ НЕ СтрокаРЗ.Свойство("ТипРабочегоВремени") Тогда
			
			// проверка на работу сотрудника в этот период в другом салоне
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ВремяРаботыСотрудниковПлан.ДатаВремяНачала КАК ВремяНачала,
			|	ВремяРаботыСотрудниковПлан.ДатаВремяОкончания КАК ВремяОкончания
			|ИЗ
			|	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
			|ГДЕ
			|	ВремяРаботыСотрудниковПлан.Сотрудник = &Сотрудник
			|	И ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница <> &СтруктурнаяЕдиница
			|	И НАЧАЛОПЕРИОДА(ВремяРаботыСотрудниковПлан.ДатаВремяНачала, ДЕНЬ) = &Дата";
			
			Запрос.УстановитьПараметр("Дата"				, СтрокаРЗ.Дата);
			Запрос.УстановитьПараметр("Сотрудник"			, СтрокаРЗ.Сотрудник);
			Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, ОтборСтруктурнаяЕдиница);
			
			Результат = Запрос.Выполнить().Выгрузить();
			
			Для Каждого СтрокаТЧ Из Результат Цикл
				Для Каждого СтрокаПериода из СтрокаРЗ.ИнтервалыРаботы Цикл
					СтрокаПериодаВремяНачала 	= СтрокаРЗ.Дата + (СтрокаПериода.Значение.НачалоРаботы - Дата(01, 01, 01));
					СтрокаПериодаВремяОкончания = СтрокаРЗ.Дата + (СтрокаПериода.Значение.ОкончаниеРаботы - Дата(01, 01, 01));
					Если (СтрокаПериодаВремяОкончания - СтрокаТЧ.ВремяНачала)*(СтрокаТЧ.ВремяОкончания - СтрокаПериодаВремяНачала) > 0 Тогда 
						ФлагПроверки = Ложь;
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сотрудник " + СтрокаРЗ.Сотрудник + " уже работает в этот период в другой клинике!");
						Прервать;           
					КонецЕсли;
				КонецЦикла;		
			КонецЦикла;     
			
		КонецЕсли;

		Если ФлагПроверки Тогда
			
			// Ищем существующее рабочее время на указанную дату
			НайденныеСтроки = БуферФормирования.НайтиСтроки(Новый Структура("Дата,Сотрудник",СтрокаРЗ.Дата, СтрокаРЗ.Сотрудник));
			Для Каждого СтрокаБуфера ИЗ НайденныеСтроки Цикл
				// Если найден существующий интервал, помечаем его на удаление 
				// и скрываем для отображения
				Если НЕ ЗначениеЗаполнено(СтрокаБуфера.Операция) Тогда
					СтрокаБуфера.Операция              = "Удалить";
					СтрокаБуфера.НомерОчередиОперации  = НомерОперации;
					СтрокаБуфера.Скрыть                = Истина;
					// Если найден новый интервал, просто удаляем его, он будет заменен	
				ИначеЕсли СтрокаБуфера.Операция = "Создать" Тогда
					БуферФормирования.Удалить(СтрокаБуфера);
				КонецЕсли;
			КонецЦикла;
			
			НоваяСтрока                       = БуферФормирования.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаРЗ);
			НоваяСтрока.ИнтервалыРаботыПредст = ИнтервалыРаботыПредст;
			НоваяСтрока.Должность             = НоваяСтрока.Сотрудник.Должность; 
			НоваяСтрока.ИдентификаторОбласти  = Новый УникальныйИдентификатор;
			НоваяСтрока.Операция              = "Создать";
			НоваяСтрока.НомерОчередиОперации  = НомерОперации;
		КонецЕсли;
		
	КонецЦикла;
	
	// Обновить визуализацию плана занятий
	ОбновитьОтображениеПланирования(Ложь);

КонецПроцедуры

&НаСервереБезКонтекста
// Функция - проверяет входят ли визиты в указанный интервал работ
// 
Функция ПроверитьВизитыВходятВИнтервалыРабот(Сотрудник, Дата, ОтборСтруктурнаяЕдиница, ИнтервалыРаботы) 
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                      |	СобытиеУслуги.Ссылка КАК Ссылка,
	                      |	СобытиеУслуги.ДатаНачала КАК ДатаНачала,
	                      |	СобытиеУслуги.ДатаОкончания КАК ДатаОкончания
	                      |ИЗ
	                      |	Документ.Событие.Услуги КАК СобытиеУслуги
	                      |ГДЕ
	                      |	СобытиеУслуги.Ссылка.Проведен = ИСТИНА
	                      |	И СобытиеУслуги.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	                      |	И СобытиеУслуги.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                      |	И (СобытиеУслуги.Сотрудник = &Сотрудник
	                      |			ИЛИ СобытиеУслуги.Ссылка.СсылкаНаПрием.Ассистент = &Сотрудник)
	                      |	И НАЧАЛОПЕРИОДА(СобытиеУслуги.Ссылка.Дата, ДЕНЬ) = &Дата");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, ОтборСтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Сотрудник"			, Сотрудник);
	Запрос.УстановитьПараметр("Дата"				, НачалоДня(Дата));
	
	ТаблицаПриемов = Запрос.Выполнить().Выгрузить();
	
	Флаг = Ложь; 	
	Для Каждого СтрокаТЗ Из ТаблицаПриемов Цикл
		
		Флаг = Ложь;   
		Для Каждого СтрокаПеридов Из ИнтервалыРаботы Цикл
			
			НачалоПериода	= СтрокаПеридов.Значение.НачалоРаботы;
			КонецПериода	= СтрокаПеридов.Значение.ОкончаниеРаботы;
			
			НачалоПериода	= НачалоДня(Дата) + Час(НачалоПериода)*60*60 + Минута(НачалоПериода)*60 + Секунда(НачалоПериода);
			КонецПериода	= НачалоДня(Дата) + Час(КонецПериода)*60*60	 + Минута(КонецПериода)*60  + Секунда(КонецПериода);
			
			Если СтрокаТЗ.ДатаНачала >= НачалоПериода и СтрокаТЗ.ДатаОкончания <= КонецПериода Тогда
				Флаг = Истина;			
			КонецЕсли;
			
			// уже есть период графика работ, в который входит визит.
			Если флаг Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;   
		
		Если Не Флаг Тогда
			Прервать;					
		КонецЕсли; 		
			
	КонецЦикла;
	
	Возврат	?(ТаблицаПриемов.Количество() > 0, Флаг, Истина);
	
КонецФункции


&НаКлиенте
// Вернет текстовое представление значения параметра занятия
// 
Функция ПредставлениеЗначенияПараметраЗанятия(СтрокаБуфера, ИмяПараметра)
	
	Представление = Неопределено;
	Если ИмяПараметра = "ИнтервалыРаботы" Тогда
		Представление = СтрокаБуфера.ИнтервалыРаботыПредст;	
	ИначеЕсли ИмяПараметра = "ДатаВремяРаботы" Тогда
		Представление = Формат(СтрокаБуфера.Дата,"ДФ='dd MMMM yyyy'") + Символы.ПС + Символы.ПС + " - " + СтрЗаменить(СтрокаБуфера.ИнтервалыРаботыПредст, "<br>", Символы.ПС + " - ");
	ИначеЕсли ИмяПараметра = "Сотрудник" Тогда
		Представление = ПредставлениеФИО(СтрокаБуфера.Сотрудник) + ?(СтрокаБуфера.Операция <> "","*","");
	Иначе	
		Представление = Строка(СтрокаБуфера[ИмяПараметра]);
	КонецЕсли;

	Возврат Представление;
	
КонецФункции

&НаСервере
// Вернет текстовое представление значения параметра занятия
// 
Функция ПредставлениеЗначенияПараметраЗанятияНаСервере(СтрокаБуфера, ИмяПараметра)
	
	Представление = Неопределено;
	Если ИмяПараметра = "ИнтервалыРаботы" Тогда
		Представление = СтрокаБуфера.ИнтервалыРаботыПредст;	
	ИначеЕсли ИмяПараметра = "ДатаВремяРаботы" Тогда
		Представление = Формат(СтрокаБуфера.Дата,"ДФ='dd MMMM yyyy'") + " " + СтрокаБуфера.ИнтервалыРаботыПредст;
	ИначеЕсли ИмяПараметра = "Сотрудник" Тогда
		Представление = ПредставлениеФИО(СтрокаБуфера.Сотрудник) + ?(СтрокаБуфера.Операция <> "","*","");
	Иначе	
		Представление = СокрЛП(Строка(СтрокаБуфера[ИмяПараметра]));
	КонецЕсли;

	Возврат Представление;
	
КонецФункции

&НаСервере
// Добавить опсиание области в перечисление областей
// 
Процедура ДобавитьВПеречислениеОбластей(Датаобласти, ИдентификаторОбласти)
	
	НоваяСтрока                      = ПеречислениеОбластей.Добавить();
	НоваяСтрока.ИдентификаторОбласти = ИдентификаторОбласти;
	НоваяСтрока.Дата                 = Датаобласти;
	
КонецПроцедуры

&НаСервере 
// Получить занятия из буфера на неделю
// 
Функция ЗанятияЗаНеделюИзБуфераДляОтображения(НачалоНедели, ОкончаниеНедели)
	
	ОтборЗанятий = Новый Массив;
	Индекс = ?(СтартовыйИндексЦиклаПодбораНедельногоБуфера <> Неопределено, СтартовыйИндексЦиклаПодбораНедельногоБуфера, 0);
	Пока Индекс < БуферФормирования.Количество() Цикл
		
		СтрокаТ = БуферФормирования[Индекс];
		// Т.к. занятия в буфере отсортированы по дате начала
		// имеем возможность прервать цикл
		Если  СтрокаТ.Дата > ОкончаниеНедели Тогда
			Прервать;
		КонецЕсли;	 
				
		Если СтрокаТ.Скрыть = Ложь И СтрокаТ.Дата >= НачалоНедели И СтрокаТ.Дата <= ОкончаниеНедели Тогда
			ОтборЗанятий.Добавить(СтрокаТ); 
		КонецЕсли;
			
		Индекс = Индекс + 1;
	КонецЦикла;
	
	СтартовыйИндексЦиклаПодбораНедельногоБуфера = Индекс;
	
	Возврат ОтборЗанятий;
КонецФункции

&НаСервере 
// Получить занятия из недельного буфера на указанный день
// 
Функция ПервоеВОчередиЗанятиеВЭтотДеньИЗБуфера(МассивЗанятий, НомерДня)
	
	Для Каждого ЭлементМ ИЗ МассивЗанятий Цикл
		Если ДеньНедели(ЭлементМ.Дата) = НомерДня Тогда
			Возврат ЭлементМ;  
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

&НаКлиенте
// Получить строку из буфера по УИ занятия
// 
Функция СтрокаБуфераФомированияПоИдентификатору(Знач ИдентификаторОбласти)
	
	ИдентификаторОбласти = ПолучитьИДЗанятия(ИдентификаторОбласти);
	НайденныеСтроки      = БуферФормирования.НайтиСтроки(Новый Структура("ИдентификаторОбласти",ИдентификаторОбласти));
	
	Возврат ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0], Неопределено);
	
КонецФункции

&НаКлиенте
// Вытащить ИД занятия из расшифровки 
// 
Функция ПолучитьИДЗанятия(Расшифровка)
	
	Если Лев(Расшифровка,1) = "+" Тогда
		Если Лев(Расшифровка,3) = "+Дн" Тогда		
			Возврат Прав(Расшифровка,СтрДлина(Расшифровка) - 3);
		Иначе
			Возврат Расшифровка;
		КонецЕсли;
	Иначе
		Возврат Расшифровка;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Получить описание области по ее идентификатору
// 
Функция ОписаниеОбласти(ИдентификаторОбласти)
	
	НайденныеСтроки = ПеречислениеОбластей.НайтиСтроки(Новый Структура("ИдентификаторОбласти", ИдентификаторОбласти));
	Возврат ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0], Неопределено);
	
КонецФункции

&НаКлиенте
// Вернет номер последней операции в очереди буфера
// 
Функция НомерПоследнейОперацииВОчередиБуфера()
	
	НомерОчередиОперации = 0;
	Для Каждого СтрокаТ ИЗ БуферФормирования Цикл
		Если СтрокаТ.НомерОчередиОперации > НомерОчередиОперации Тогда
			НомерОчередиОперации = СтрокаТ.НомерОчередиОперации;
		КонецЕсли;	
	КонецЦикла;
		
	Возврат НомерОчередиОперации;
	
КонецФункции

&НаСервере
// Вернет номер последней операции в очереди буфера
// 
Функция НомерПоследнейОперацииВОчередиБуфераНаСервере()
	
	НомерОчередиОперации = 0;
	Для Каждого СтрокаТ ИЗ БуферФормирования Цикл
		Если СтрокаТ.НомерОчередиОперации > НомерОчередиОперации Тогда
			НомерОчередиОперации = СтрокаТ.НомерОчередиОперации;
		КонецЕсли;	
	КонецЦикла;
		
	Возврат НомерОчередиОперации;
КонецФункции

&НаКлиенте
// Сравнить два занятия
// 
Функция СравнитьСтрокиБуфераФормирования(Строка1,Строка2)
	
	Если Строка1 = Неопределено Тогда 
		Возврат Истина;
	Иначе 	
		Возврат Строка1.Сотрудник = Строка2.Сотрудник И Строка1.ИнтервалыРаботыПредст = Строка2.ИнтервалыРаботыПредст;		
	КонецЕсли;
		 
КонецФункции

#КонецОбласти

#Область ФиксацияИзмененийВПлане

&НаКлиенте
// Функция вернет признак необходимости фиксации изменений в плане
// 
Функция ПроверитьНеобходимостьФиксацииИзмененийВПлане()
	
	СоздатьЗанятия  = БуферФормирования.НайтиСтроки(Новый Структура("Операция","Создать"));
	УдалитьЗанятия  = БуферФормирования.НайтиСтроки(Новый Структура("Операция","Удалить"));
	
	Возврат СоздатьЗанятия.Количество() > 0 ИЛИ УдалитьЗанятия.Количество() > 0;
	
КонецФункции

&НаСервере
// Зафиксировать изменения
// 
Процедура ЗафиксироватьИзмененияВГрафикеСотрудников()
	
	// РегистрыСведений.ВремяРаботыСотрудниковПлан.ЗафиксироватьИзмененияВГрафикеСотрудников(ЭтотОбъект.ОтборСтруктурнаяЕдиница, ЭтотОбъект.БуферФормирования);
	ЗафиксироватьИзмененияВГрафикеСотрудниковВРегистре(ЭтотОбъект.ОтборСтруктурнаяЕдиница, ЭтотОбъект.БуферФормирования);
	ОбновитьОтображениеПланирования(Ложь);
	
	ДобавитьОповещениеКлиента();
	
КонецПроцедуры

&НаСервере
// Процедура, добавляет оповещение клиента.
//
Процедура ДобавитьОповещениеКлиента()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущиеСеансы = ПолучитьСеансыИнформационнойБазы();
	НомерСеанса   = НомерСеансаИнформационнойБазы(); 
	Для Каждого ТекущийСанс Из ТекущиеСеансы Цикл
		Если НомерСеанса <> ТекущийСанс.НомерСеанса И ТекущийСанс.ИмяПриложения = "1CV8C" Тогда
			РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(ТекущийСанс.НомерСеанса,, "ОбновитьОтображениеПланирования");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура, проверяет активные оповещения графика работы сотрудников для текущего сеанса.
//
Процедура ПроверитьАктивныеОповещенияГрафикаРаботыСотрудников()
	
	ОповещенияКлиента = ПользователиСтоматология.ПолучитьАктивныеОповещенияКлиента();
	
	Если НЕ ТипЗнч(ОповещенияКлиента) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТЗ Из ОповещенияКлиента Цикл
		
		ЗавершитьОповещение = Истина;
		Если СтрокаТЗ.Ключ = "ОбновитьОтображениеПланирования" Тогда
			ОбновитьОтображениеПланирования(Истина);		
		КонецЕсли; 
		
		Если ЗавершитьОповещение Тогда
			ПользователиСтоматология.ЗавершитьОповещениеКлиента(СтрокаТЗ.ОбъектОповещения, СтрокаТЗ.СтруктурнаяЕдиница, СтрокаТЗ.Ключ);
		КонецЕсли;
		
	КонецЦикла;
	
	ПользователиСтоматология.ОчиститьУстаревшиеОповещенияКлиента(); 	
	
КонецПроцедуры
	 
#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

&НаСервере
// Процедура - Сформировать текст периода
// 
Процедура СформироватьТекстПериода()
	
	КомандаВыбораПериода = ЭтаФорма.Команды.Найти("ВыбратьПериодПланирования");
	
	Если ОтборПериод.ДатаНачала = Дата(1,1,1) ИЛИ ОтборПериод.ДатаОкончания = Дата(1,1,1) Тогда 
		Элементы.ВыбратьПериодПланирования.Заголовок = "< не указан >";
		Если НЕ КомандаВыбораПериода = Неопределено Тогда 
			КомандаВыбораПериода.Подсказка = "Щелкните для выбора периода планирования";
		КонецЕсли;	
	Иначе
		Если ОтборПериод.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда 
			Элементы.ВыбратьПериодПланирования.Заголовок = Формат(ОтборПериод.ДатаНачала, "ДФ=dd.MM.yy") + " - " + Формат(ОтборПериод.ДатаОкончания, "ДФ=dd.MM.yy");
		Иначе 
			Элементы.ВыбратьПериодПланирования.Заголовок = Строка(ОтборПериод.Вариант);
		КонецЕсли;
		Если НЕ КомандаВыбораПериода = Неопределено Тогда 
			КомандаВыбораПериода.Подсказка = Элементы.ВыбратьПериодПланирования.Заголовок;
		КонецЕсли;			
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Обновить массив рабочих дней в неделе для текущей СЕ
// 
Процедура ОбновитьМассивРабочихДнейВНеделе()
	
	// Получаем массив номеров рабочих дней недели для СЕ	
	ВременныйМассив		= Новый Массив;
	СтруктурнаяЕдиница	= ?(Не ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница), ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница, ОтборСтруктурнаяЕдиница);
	ДатаНачала = Дата(1,1,1);
	ПериодыРаботыСтруктурнойЕдиницы = ОбщегоНазначенияСтоматология.ВернутьПериодыРаботы(СтруктурнаяЕдиница, ДатаНачала, Новый Структура("КолДней" , 7));	
	Если ПериодыРаботыСтруктурнойЕдиницы <> Неопределено Тогда	
		ПериодыРаботыСтруктурнойЕдиницы.Сортировать("ДеньНедели");		
		Для Каждого СтрокаТ ИЗ ПериодыРаботыСтруктурнойЕдиницы Цикл
			ВременныйМассив.Добавить(ДеньНедели(СтрокаТ.ДеньНедели));
		КонецЦикла;
	КонецЕсли;		
	МасивРабочихДнейНедели = Новый ФиксированныйМассив(ВременныйМассив);

КонецПроцедуры

&НаКлиенте
// Функция вернет день недеи прописью
// 
Функция ДеньНеделиПрописью(НомерДняНедели, ВСклонении1 = Ложь, ВСклонении2 = Ложь)
	
	Если НомерДняНедели = 1 Тогда
		Возврат ?(ВСклонении2, "Прошлый понедельник", ?(ВСклонении1 = Истина, "Понедельникам", "Понедельник"));
	ИначеЕсли НомерДняНедели = 2 Тогда
	    Возврат ?(ВСклонении2, "Прошлый вторник", ?(ВСклонении1 = Истина, "Вторникам", "Вторник"));
	ИначеЕсли НомерДняНедели = 3 Тогда
	    Возврат ?(ВСклонении2, "Прошлую среду", ?(ВСклонении1 = Истина, "Средам", "Среда"));
	ИначеЕсли НомерДняНедели = 4 Тогда
	    Возврат ?(ВСклонении2, "Прошлый четверг", ?(ВСклонении1 = Истина, "Четвергам", "Четверг"));
	ИначеЕсли НомерДняНедели = 5 Тогда
	    Возврат ?(ВСклонении2, "Прошлую пятницу", ?(ВСклонении1 = Истина, "Пятницам", "Пятница"));
	ИначеЕсли НомерДняНедели = 6 Тогда
	    Возврат ?(ВСклонении2, "Прошлую субботу", ?(ВСклонении1 = Истина, "Субботам", "Суббота"));
	ИначеЕсли НомерДняНедели = 7 Тогда
	    Возврат ?(ВСклонении2, "Прошлое воскресенье", ?(ВСклонении1 = Истина, "Воскресеньям", "Воскресенье"));
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Получить представление ФИО струдника
// 
Функция ПредставлениеФИО(Сотрудник)	
	Возврат Обработки.ПланированиеИндивидуальногоГрафика.ПредставлениеФИО(Сотрудник) 	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить сотрудников структурной единицы
// 
// Параметры:
//  СтруктЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьСотрудниковСтруктурнойЕдиницы(СтруктЕдиница) 
	Возврат Справочники.СтруктурныеЕдиницы.ПолучитьСотрудниковСтруктурнойЕдиницы(СтруктЕдиница);	
КонецФункции 

&НаСервереБезКонтекста
// Получить представлениеинтервалов времени
// 
Функция ПредставлениеИнтервалавремени(СписокИнтервала)	
	
	Возврат Обработки.ПланированиеИндивидуальногоГрафика.ПолучитьПредставлениеСпискаИнтервалов(СписокИнтервала);	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Получить представление интервалов времени
//
Функция ПолучитьПредставлениеСпискаИнтервалов(СписокИнтервала)
	
	ПредставлениеСпискаИнтервалов = "";
	КоличествоИнтервалов = СписокИнтервала.Количество();
	Для Каждого ЭлементС ИЗ СписокИнтервала Цикл
		ТегПереносаСтроки 		= ?(СписокИнтервала.Индекс(ЭлементС) + 1 = КоличествоИнтервалов, "", "<br>");
		ПредставлениеСпискаИнтервалов = ПредставлениеСпискаИнтервалов + ЭлементС.Представление + ТегПереносаСтроки;                         
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПредставлениеСпискаИнтервалов) Тогда
	    Возврат ПредставлениеСпискаИнтервалов;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить массив периодов работы.
// 
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьСписокПериодовРаботы(СтруктурнаяЕдиница)
	
	ИнтервалыВремени = Справочники.ПериодыРаботы.ПолучитьМассивПериодовРаботы(СтруктурнаяЕдиница); 
	СписокПериодов   = Новый СписокЗначений;
	
	Для Каждого Интервал Из ИнтервалыВремени Цикл
		
		ЗначениеПериода      = Новый Структура("НачалоРаботы, ОкончаниеРаботы", Интервал.НачалоСмены, Интервал.ОкончаниеСмены);
		ПредставлениеПериода = ОбщегоНазначенияКлиентСерверСтоматология.ПолучитьПредставлениеИнтервала(ЗначениеПериода);
		
		СписокВложение = Новый СписокЗначений;
		СписокВложение.Добавить(ЗначениеПериода, ПредставлениеПериода);
		СписокПериодов.Добавить(СписокВложение, ПредставлениеПериода);	
				
	КонецЦикла;	
	
	СписокПериодов.Добавить("Отпуск");
	СписокПериодов.Добавить("Больничный");
	
	Возврат СписокПериодов;

КонецФункции

&НаСервере
// Процедура - Установить доступность отбору интервалы работы
// 
Процедура УстановитьДоступностьОтборуИнтервалыРаботы()
	
	Если ОтборПериод.ДатаНачала = Дата(1,1,1) Тогда 
		Элементы.ИнтервалыРаботыПредст.Доступность 		= Ложь;
		Элементы.ОтборСотрудник.Доступность 			= Ложь;
		Элементы.ОтборСтруктурнаяЕдиница.Доступность 	= Ложь;
	Иначе 
		Элементы.ИнтервалыРаботыПредст.Доступность 		= Истина;
		Элементы.ОтборСотрудник.Доступность 			= Истина;
		Элементы.ОтборСтруктурнаяЕдиница.Доступность 	= Истина;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
// Вернуть сумму интервалов времени в минутах
// 
Функция СуммаИнтерваловВМинутах(СписокИнтервала)
	
	СуммМинут                 = 0;
	Для Каждого ЭлементС ИЗ СписокИнтервала Цикл
		СуммМинут = СуммМинут + Цел((ЭлементС.Значение.ОкончаниеРаботы - ЭлементС.Значение.НачалоРаботы) / 60);	
	КонецЦикла;
	
	Возврат СуммМинут;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Вернуть время работы структурной единицы
// 
// Возвращаемое значение:
//   - 
// 
Функция ВернутьВремяРаботыСтруктурнойЕдиницы(знач ОтборСтруктурнаяЕдиница = Неопределено)
	
	СтруктурнаяЕдиница            = ?(Не ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница), ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница, ОтборСтруктурнаяЕдиница);
	Возврат Новый ФиксированныйМассив(РабочиеДниСтруктурнойЕдиницы(СтруктурнаяЕдиница));	

КонецФункции

&НаКлиенте
// Процедура - Заполнить элемент планирования
// 
// Параметры:
//  ВыбраннаяДата	 - 	 - 
//  СписокИнтервалов - 	 - 
// 
Процедура ЗаполнитьЭлементПланирования(ВыбраннаяДата, СписокИнтервалов)
	
	РезультатПланированияРазовый.Очистить();
	
	Если ТипРабочегоВремени = ПредопределенноеЗначение("Перечисление.ТипыРабочегоВремени.Больничный") Тогда
	    ИнтервалыРаботыПредст = "Больничный";
		СуммаРабочегоВремени  = 0;
    ИначеЕсли ТипРабочегоВремени = ПредопределенноеЗначение("Перечисление.ТипыРабочегоВремени.Отпуск") Тогда
	    ИнтервалыРаботыПредст = "Отпуск";
		СуммаРабочегоВремени  = 0;
	Иначе
		ИнтервалыРаботыПредст = ПолучитьПредставлениеСпискаИнтервалов(СписокИнтервалов);
		СуммаРабочегоВремени  = СуммаИнтерваловВМинутах(СписокИнтервалов);
	КонецЕсли;
	
	НоваяСтрока                       = РезультатПланированияРазовый.Добавить();
	НоваяСтрока.Дата                  = ВыбраннаяДата; 
	НоваяСтрока.ИнтервалыРаботы       = СписокИнтервалов;
	НоваяСтрока.ИнтервалыРаботыПредст = ИнтервалыРаботыПредст;
	НоваяСтрока.СуммаРабочегоВремени  = СуммаРабочегоВремени;
	НоваяСтрока.Сотрудник             = ОтборСотрудник;
	НоваяСтрока.ТипРабочегоВремени    = ТипРабочегоВремени;
	
	ПослеЗакрытияФормыСозданияОповещение(РезультатПланированияРазовый, Неопределено);
	
КонецПроцедуры

&НаКлиенте
// Функция - Получить дату выделенной области
// 
// Параметры:
//  Расшифровка	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьДатуВыделеннойОбласти(Знач Расшифровка)
	
	СтартоваяДата        = Неопределено;
	
	Если Лев(Расшифровка, 1) = "+" Тогда
		Если Лев(Расшифровка, 3) = "+Дн" Тогда			 
			ОписаниеОбл          = ОписаниеОбласти(Прав(Расшифровка,СтрДлина(Расшифровка) - 3));
			СтартоваяДата        = ОписаниеОбл.Дата;										
		КонецЕсли;	
	Иначе 
		СтрокаБуфера 	= СтрокаБуфераФомированияПоИдентификатору(Расшифровка);
		СтартоваяДата 	= СтрокаБуфера.Дата
	КонецЕсли;
	
	Возврат СтартоваяДата;
	
КонецФункции

&НаКлиенте
// Процедура - HTMLПанель планирования
// 
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеСобытия		 - 	 - 
//  СтандартнаяОбработка - 	 - 
// 
Процедура HTMLПанельПланирования(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	Попытка
		
		Если ДанныеСобытия <> Неопределено 
			И ЗначениеЗаполнено(HTMLПанельПланирования) Тогда
			
			propertyName = Элементы.HTMLПанельПланирования.Документ.getElementById("propertyName");
			ИдТекущегоЭлементаHTML = ДанныеСобытия.element.id;
			
			Если propertyName.innertext = "КОНТЕКСТНОЕ_МЕНЮ" Тогда  // обработка контекстного меню
				
				Если ЗначениеЗаполнено(ИдТекущегоЭлементаHTML) Тогда 
					
					СтартоваяДата 	= ПолучитьДатуВыделеннойОбласти(ИдТекущегоЭлементаHTML);
					ДатаТекущегоЭлементаHTML = СтартоваяДата;
					ДнПрописью 		= ДеньНеделиПрописью(ДеньНедели(СтартоваяДата), , Истина);
					Элементы.ТабДокументПланированияКонтекстноеМенюКнопкаСкопироватьДеньСПредыдущейНедели.Заголовок = ДнПрописью;
					Элементы.ТабДокументПланированияКонтекстноеМенюКнопкаСкопироватьДеньСПредыдущейНедели.Картинка = БиблиотекаКартинок[ДеньНеделиПрописью(ДеньНедели(СтартоваяДата))];
					Элементы.ТабДокументПланаЗанятийКонтекстноеМенюКомандаТабДокументУдалитьЗаПериод.Картинка 		= БиблиотекаКартинок[ДеньНеделиПрописью(ДеньНедели(СтартоваяДата))];
					
					СтрокаБуфера = СтрокаБуфераФомированияПоИдентификатору(ИдТекущегоЭлементаHTML);
					Если СтрокаБуфера <> Неопределено Тогда
						НомерДняНеделиДляУдаления = ДеньНедели(СтрокаБуфера.Дата);
						ДнПрописью                = ДеньНеделиПрописью(НомерДняНеделиДляУдаления, Истина);
						Элементы.ТабДокументПланаЗанятийКонтекстноеМенюКомандаТабДокументУдалитьЗаПериод.Заголовок = "По """ + ДнПрописью + """";
						Элементы.ТабДокументПланаЗанятийКонтекстноеМенюКомандаТабДокументУдалитьЗаПериод.Доступность = Истина;
						// Элементы.ТабДокументПланаЗанятийКонтекстноеМенюКомандаТабДокументУдалитьВсе.Доступность = Истина;						
					Иначе
						Элементы.ТабДокументПланаЗанятийКонтекстноеМенюКомандаТабДокументУдалитьЗаПериод.Заголовок = "За период";
						Элементы.ТабДокументПланаЗанятийКонтекстноеМенюКомандаТабДокументУдалитьЗаПериод.Доступность = Ложь;
						// Элементы.ТабДокументПланаЗанятийКонтекстноеМенюКомандаТабДокументУдалитьВсе.Доступность = Ложь;			
					КонецЕсли;
					
					Элементы.ТабДокументПланаЗанятийКонтекстноеМенюГруппаУдалить.Доступность 		= Истина;
					Элементы.ТабДокументПланированияКонтекстноеМенюГруппаСкопировать.Доступность 	= Истина;
				Иначе
					Элементы.ТабДокументПланаЗанятийКонтекстноеМенюГруппаУдалить.Доступность 		= Ложь;
					Элементы.ТабДокументПланированияКонтекстноеМенюГруппаСкопировать.Доступность 	= Ложь;		
				КонецЕсли;
				
				propertyName.innertext = "";
				
			Иначе 	
				
				Если ЗначениеЗаполнено(ИдТекущегоЭлементаHTML) Тогда
					Если Лев(ИдТекущегоЭлементаHTML, 1) = "+" Тогда // обработка добавления
						
						// Если НЕ ФормированиеИнтерваловЗавершено() Тогда 
						// 	Возврат;
						// КонецЕсли;
						
						ПериодЗаполнения     = Новый СтандартныйПериод(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);
						СтартоваяДата        = Неопределено;
						
						Если Лев(ИдТекущегоЭлементаHTML, 3) = "+Дн" Тогда
							
							ОписаниеОбл = ОписаниеОбласти(Прав(ИдТекущегоЭлементаHTML, СтрДлина(ИдТекущегоЭлементаHTML) - 3));		
							
							Если ОписаниеОбл <> Неопределено Тогда
								СтартоваяДата = ОписаниеОбл.Дата;
								ДатаТекущегоЭлементаHTML = СтартоваяДата;
							Иначе
								Возврат;
							КонецЕсли;
							
						КонецЕсли;	
						
						ИнтервалыСформированы = ФормированиеИнтерваловЗавершено(Ложь);
						
						// Если заполнены все отборы - заполним элемент разово без открытия формы создания
						Если ЗначениеЗаполнено(ОтборСотрудник) И ИнтервалыСформированы И ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда
							
							ПроверитьВхождениеИнтерваловВГрафикРаботыСЕ(СтартоваяДата);
							
							// иначе - откроем форму создания	
						Иначе
							
							ИнтервалыРаботы = ОтборИнтервалыРаботы.Скопировать();
							Если НЕ ИнтервалыСформированы Тогда
								ИнтервалыРаботы.Очистить();
							КонецЕсли;
							
							ПараметрыПланирования = Новый Структура;	
							ПараметрыПланирования.Вставить("ПериодЗаполнения"   , ПериодЗаполнения);
							ПараметрыПланирования.Вставить("СтартоваяДата"      , СтартоваяДата);
							ПараметрыПланирования.Вставить("Сотрудник"          , ОтборСотрудник);
							ПараметрыПланирования.Вставить("ИнтервалыРаботы"	, ИнтервалыРаботы);
							
							Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыСозданияОповещение", ЭтотОбъект);
							ОткрытьФорму("Обработка.ПланированиеИндивидуальногоГрафика.Форма.ФормаСоздания",ПараметрыПланирования, ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			
							
						КонецЕсли;
					Иначе 
						СтрокаБуфера = СтрокаБуфераФомированияПоИдентификатору(ИдТекущегоЭлементаHTML);
						Если СтрокаБуфера <> Неопределено Тогда 
							Если СтрНайти(ДанныеСобытия.Element.className, "STAFFER") > 0 Тогда  // обработка открытия сотрудника
								Если ЗначениеЗаполнено(СтрокаБуфера.Сотрудник) Тогда
									ПоказатьЗначение(,СтрокаБуфера.Сотрудник);
								КонецЕсли;
								// ИначеЕсли ДанныеСобытия.Element.className = "ROOM" Тогда // обработка открытия помещения
								// 	Если ЗначениеЗаполнено(СтрокаБуфера.Помещение) Тогда
								// 		ПоказатьЗначение(,СтрокаБуфера.Помещение);
								// 	КонецЕсли;
							КонецЕсли;
						КонецЕсли;		
					КонецЕсли;	 
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;	
		
	Исключение
	КОнецПопытки;
	
	// ЭтаФорма.ТекущийЭлемент = Элементы.ФормаКомандаСформировать;
	
КонецПроцедуры

#Конецобласти

&НаСервере
// Функция, возвращает шапку HTML документа
// 
Функция ПолучитьШапкуHTML()
	
	Текст = "<!DOCTYPE html PUBLIC '-//W3C//DTD HTML 5.0//EN' 'http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd'>
	|<html xmlns='http://www.w3.org/1999/xhtml'>
	|<meta http-equiv='X-UA-Compatible' content='IE=10' />
	|<meta content='text/html; charset=utf-8' http-equiv='Content-Type'></meta><link rel='stylesheet' type='text/css' href='__STYLE__'></link><meta name='GENERATOR' content='MSHTML 8.00.6001.18702'></meta><base href='v8config://v8cfgHelp/mdobject/id8d74233b-feb6-4170-918c-dfe5689c9b14/8eb4fad1-1fa6-403e-970f-2c12dbb43e23'></base>
	|<head>
	|<title></title>
	|	
	|<script type = 'text/javascript'>
	|	
	| document.oncontextmenu = function(e) {
	|  element = e.target;
	|  document.getElementById('propertyName').innertext = 'КОНТЕКСТНОЕ_МЕНЮ';
	|  element.click(); 
	|}
	|
	|</script>
	|
	|</head>
	|
	|<style type='text/css'>
	|
	|.CAP_TOP							{ display: block; 			position: fixed; z-index: 201; left: 0%; right: 0%; top: 0%; <!-- transform: translate; --> width: 100%; height: 1%; background: white;  }
	|.CAP_BOTTOM						{ display: block; 			position: fixed; z-index: 101; left: 0%; right: 0%; top: 5%; <!-- transform: translate(0%, 5%); --> width: 100%; height: 3px; background: red; border: 3px solid white; }
	|
	|.CAP_PLANNING_CHART				{ display: table; 			position: fixed; z-index: 201; left: 1%; right: 1%; top: 1%; transform: translate(-1%, 0%); width: 100%; background: white; border-spacing: 2px; font-family: Arial; color: #5A5A5A; font-weight: 400; font-size: calc(8px + 0.42vw); text-align: center; border-top:1px solid #9B9B9B; border-bottom:1px solid #9B9B9B; <!-- margin: 0px 25px 10px 0px; --> }
	|
	|.ROW_CAP_PLANNING_CHART			{ display: table-row; 		position: relative; background: white; min-height: 20px; box-sizing: border-box; text-align: center;}
	|.DAY_OF_THE_WEEK_IN_CAP			{ display: table-cell; 		position: relative; min-width: 100px; min-width: 100px; width: 14%;  max-width: 100px; font-size: calc(14px + 0.32vw); box-sizing: border-box; vertical-align: middle; text-align: center; }
	|
	|.MONTH_OF_THE_YEAR					{ display: inline-block; 	position: relative; width: 100%; box-sizing: border-box; transform: translate; margin: 1% 0% 1% 0%; padding: 17px 0px 10px 0px; vertical-align: top; text-align: left; font-size: calc(26px + 0.42vw); font-family: Arial; color: #7EC3BC; }
	|
	|.TABLE_PLANNING_CHART				{ display: table; 			position: relative; width: 100%; border-spacing: 2px; font-family: Arial; color: #5A5A5A; font-weight: 400; font-size: calc(8px + 0.42vw);}
	|.WEEK								{ display: table-row; 		position: relative; background: #F0F0F0; box-sizing: border-box; }
	|
	|.DAY_INVISIBLE						{ display: table-cell; 		position: relative; background: white; 	min-width: 100px; width: 14%; max-width: 100px; box-sizing: border-box; overflow-x: auto; vertical-align: top;}
	|.DAY_EMPTY							{ display: table-cell; 		position: relative; background: #F0F0F0; min-width: 100px; width: 14%; max-width: 100px; box-sizing: border-box; overflow-x: auto; vertical-align: top;}
	|.DAY_FILLED						{ display: table-cell; 		position: relative; background: #DEEDD7; min-width: 100px; width: 14%; max-width: 100px; box-sizing: border-box; overflow-x: auto; vertical-align: top;}
	|.DAY_WEEKEND						{ display: table-cell; 		position: relative; background: #FAF3F3; min-width: 100px; width: 14%; max-width: 100px; box-sizing: border-box; overflow-x: auto; vertical-align: top;}
	|
	|.BLOK_DAY_TABLE					{ display: block; 			position: relative; width: 100%; height: 100%; border-spacing: 0px; box-sizing: border-box; }
	|
	|.ROW_HAT_BLOK_OF_THE_DAY 			{ display: inline-block; 	position: relative; width: 100%; box-sizing: border-box; background: white; padding-bottom: 2px;}
	|.ROW_UNIT_BODY_OF_THE_DAY			{ display: inline-block;	position: relative; width: 100%; background: white; }
	|
	|.BLOK_DAY_ADD_INVISIBLE			{ display: inline-block; 	position: relative; vertical-align: middle; text-align: center; height: 20px; font-size: calc(12px + 0.52vw); width: 43%; background: white; box-sizing: border-box;}
	|.BLOK_DAY_ADD						{ display: inline-block; 	position: relative; vertical-align: middle; text-align: center; height: 20px; font-size: calc(12px + 0.52vw); width: 43%; background: #F0F0F0; box-sizing: border-box; cursor: pointer;}
	|.BLOK_DAY_ADD:hover {
	|	-o-transform: scaleX(-1);
	|	-ms-transform: scaleX(-1);
	|	-moz-transform: scaleX(-1);
	|	-webkit-transform: scaleX(-1);
	|	transform: scaleX(-1);
	|	transition: all 0.2s steps(5, end);
	|}
	|
	|.BLOK_DAY_ADD_WEEKEND				{ display: inline-block; 	position: relative; vertical-align: middle; text-align: center; height: 20px; color: #D1D1D1; font-size: calc(12px + 0.52vw); width: 43%; background: #FAF3F3; box-sizing: border-box;}
	|
	|.BLOK_NUMBER_OF_THE_DAY			{ display: inline-block; 	position: relative; vertical-align: middle; text-align: right; height: 20px; font-size: calc(12px + 0.52vw); width: 52%; background: white; box-sizing: border-box; cursor: default; padding-right: 4px;}
	|.BLOK_NUMBER_OF_THE_DAY_WEEKEND	{ display: inline-block; 	position: relative; vertical-align: middle; text-align: right; height: 20px; color: #D1D1D1; font-size: calc(12px + 0.52vw); width: 52%; background: white; box-sizing: border-box; cursor: default; padding-right: 4px;}
	|
	|.BLOCK_INVISIBLE					{ display: block; 			position: relative; width: 100%; min-height: 55px; height: auto; background: white; }
	|.BLOCK_EMPTY						{ display: block; 			position: relative; width: 100%; min-height: 55px; height: auto; background: #F0F0F0; }
	|.BLOCK_FILLED						{ display: block; 			position: relative; width: 100%; min-height: 55px; height: auto; background: #DEEDD7; }
	|.BLOCK_WEEKEND						{ display: block; 			position: relative; width: 100%; min-height: 55px; height: auto; background: #FAF3F3; }
	|
	|
	|.ROOM {
	|	display: block;
	|   white-space: nowrap;
	|	font-size: calc(8px + 0.37vw);
	|	text-decoration: none;
	|	text-align: left;
	|	width: 96%;
	|	cursor: default;
 	|  	overflow: hidden; 
 	|  	padding: 1% 1% 1% 2%;
	|   background: #FFDCB9;
 	|  	position: relative;
	|   }
	| 
	|	.ROOM:hover {	
	|	transform: translate(1px, 1px);
	|	text-shadow: 2px 3px 3px rgba(0,0,0,0.2);
	|	transition: .1s linear;
	|	}
	|		
	|   .ROOM::after {
	|   content: ''; 
	|   position: absolute; 
	|   right: 0; top: 0; 
	|   width: 17%; 
	|   height: 100%; 
	|   background: -moz-linear-gradient(left, rgba(241,241,216, 0.1), #FFDCB9 83%);
	|   background: -webkit-linear-gradient(left, rgba(241,241,216, 0.1), #FFDCB9 83%);
	|  	background: -o-linear-gradient(left, rgba(241,241,216, 0.1), #FFDCB9 83%);
	|   background: -ms-linear-gradient(left, rgba(241,241,216, 0.1), #FFDCB9 83%);
	|   background: linear-gradient(to right, rgba(241,241,216, 0.1), #FFDCB9 83%); }
	|
	|.ROOM_REMOTE {
	|	display: block;
	|   white-space: nowrap;
	|	font-size: calc(8px + 0.37vw);
	|	color: #8B8B8B;
	|	text-decoration: none;
	|	text-align: left;
	|	width: 97%;
	|	cursor: default;
 	|  	overflow: hidden; 
 	|  	padding: 1% 1% 1% 2%;
	|   background: #F2E6DA;
 	|  	position: relative; 
	|   }
	|   .ROOM_REMOTE::after {
	|   content: ''; 
	|   position: absolute; 
	|   right: 0; top: 0; 
	|   width: 17%; 
	|   height: 100%; 
	|   background: -moz-linear-gradient(left, rgba(241,241,216, 0.1), #F2E6DA 83%);
	|   background: -webkit-linear-gradient(left, rgba(241,241,216, 0.1), #F2E6DA 83%);
	|  	background: -o-linear-gradient(left, rgba(241,241,216, 0.1), #F2E6DA 83%);
	|   background: -ms-linear-gradient(left, rgba(241,241,216, 0.1), #F2E6DA 83%);
	|   background: linear-gradient(to right, rgba(241,241,216, 0.1), #F2E6DA 83%); }	
	|
	|.STAFFER {
	|	display: block;
	|   white-space: nowrap;
	|	font-size: calc(12px + 0.32vw);
	|	text-decoration: none;
	|	text-align: left;
	|	width: 96%;
	|	cursor: default;
 	|  	overflow: hidden; 
 	|  	padding: 1% 1% 1% 2%;
	|   background: #FFDCB9;
 	|  	position: relative;
 	|  	margin-bottom: 2px;
	|   }
	| 
	|	.STAFFER:hover {
	|	transform: translate(1px, 1px);
	|	text-shadow: 2px 3px 3px rgba(0,0,0,0.2);
	|	transition: .1s linear;
	|	}
	|		
	|   .STAFFER::after {
	|   content: ''; 
	|   position: absolute; 
	|   right: 0; top: 0; 
	|   width: 17%; 
	|   height: 100%; 
	|   background: -moz-linear-gradient(left, rgba(241,241,216, 0.1), #FFDCB9 83%);
	|   background: -webkit-linear-gradient(left, rgba(241,241,216, 0.1), #FFDCB9 83%);
	|  	background: -o-linear-gradient(left, rgba(241,241,216, 0.1), #FFDCB9 83%);
	|   background: -ms-linear-gradient(left, rgba(241,241,216, 0.1), #FFDCB9 83%);
	|   background: linear-gradient(to right, rgba(241,241,216, 0.1), #FFDCB9 83%); }
	|
	|.STAFFER_REMOTE {
	|	display: block;
	|   white-space: nowrap;
	|	font-size: calc(12px + 0.32vw);
	|	color: #8B8B8B;	
	|	text-decoration: line-through;		
	|	text-align: left;
	|	width: 97%;
	|	cursor: pointer;
	|   overflow: hidden; 
	|	padding: 0% 1% 1% 2%;
	|   position: relative; 
	|   }
	|   .STAFFER_REMOTE::after {
	|    content: ''; 
	|    position: absolute; 
	|    right: 0; top: 0; 
	|    width: 17%; 
	|    height: 100%; 
	|    background: -moz-linear-gradient(left, rgba(222,237,215, 0.1), #F0F0F0 83%);
	|    background: -webkit-linear-gradient(left, rgba(222,237,215, 0.1), #F0F0F0 83%);
	|    background: -o-linear-gradient(left, rgba(222,237,215, 0.1), #F0F0F0 83%);
	|    background: -ms-linear-gradient(left, rgba(222,237,215, 0.1), #F0F0F0 83%);
	|    background: linear-gradient(to right, rgba(222,237,215, 0.1), #F0F0F0 83%); }	
	|	
	|.INTERVALS_OF_WORK {
	|	display: block;
	|   white-space: nowrap;
	|	font-size: calc(8px + 0.32vw);
	|	text-align: left;
	|	width: 97%;
	|   overflow: hidden; 
	|   padding: 0% 1% 1% 2%;
	|   position: relative; 
	|   }
	|   .INTERVALS_OF_WORK::after {
	|    content: ''; 
	|    position: absolute; 
	|    right: 0; top: 0; 
	|    width: 17%; 
	|    height: 100%; 
	|    background: -moz-linear-gradient(left, rgba(222,237,215, 0.1), #DEEDD7 83%);
	|    background: -webkit-linear-gradient(left, rgba(222,237,215, 0.1), #DEEDD7 83%);
	|    background: -o-linear-gradient(left, rgba(222,237,215, 0.1), #DEEDD7 83%);
	|    background: -ms-linear-gradient(left, rgba(222,237,215, 0.1), #DEEDD7 83%);
	|    background: linear-gradient(to right, rgba(222,237,215, 0.1), #DEEDD7 83%); }	
	|	
	|.INTERVALS_OF_WORK_REMOTE {
	|	display: block;
	|   white-space: nowrap;
	|	font-size: calc(8px + 0.32vw);
	|	color: #8B8B8B;	
	|	text-decoration: line-through;	
	|	text-align: left;
	|	width: 97%;
	|   overflow: hidden; 
	|   padding: 0% 1% 1% 2%;
	|   position: relative; 
	|   }
	|   .INTERVALS_OF_WORK_REMOTE::after {
	|    content: ''; 
	|    position: absolute; 
	|    right: 0; top: 0; 
	|    width: 17%; 
	|    height: 100%; 
	|    background: -moz-linear-gradient(left, rgba(222,237,215, 0.1), #F0F0F0 83%);
	|    background: -webkit-linear-gradient(left, rgba(222,237,215, 0.1), #F0F0F0 83%);
	|    background: -o-linear-gradient(left, rgba(222,237,215, 0.1), #F0F0F0 83%);
	|    background: -ms-linear-gradient(left, rgba(222,237,215, 0.1), #F0F0F0 83%);
	|    background: linear-gradient(to right, rgba(222,237,215, 0.1), #F0F0F0 83%); }		
	|	
	|	
	|</style>
	|
	|<body style='OVERFLOW: auto; min-width: 600px; margin: 9px 0px 0px 0px;' onselectstart='return false'>
	|	
	|<div id='propertyName' style='display: none'></div>
	|	
	|<div class='CAP_TOP'></div>
	|
	|<div class='CAP_PLANNING_CHART'>
	|	<div class='ROW_CAP_PLANNING_CHART'>
	|		<div class='DAY_OF_THE_WEEK_IN_CAP'>Понедельник</div>
	|		<div class='DAY_OF_THE_WEEK_IN_CAP'>Вторник</div>
	|		<div class='DAY_OF_THE_WEEK_IN_CAP'>Среда</div>
	|		<div class='DAY_OF_THE_WEEK_IN_CAP'>Четверг</div>
	|		<div class='DAY_OF_THE_WEEK_IN_CAP'>Пятница</div>
	|		<div class='DAY_OF_THE_WEEK_IN_CAP' style = 'color: #E08A8A;'>Суббота</div>
	|		<div class='DAY_OF_THE_WEEK_IN_CAP' style = 'color: #E08A8A;'>Воскресенье</div>		
	|	</div>	
	|</div>";
	
	Если РазрешениеЭкрана.Количество() > 0 И РазрешениеЭкрана[0].Ширина < 1370 Тогда
		
		Текст = СтрЗаменить(Текст,
		".MONTH_OF_THE_YEAR					{ display: inline-block; 	position: relative; width: 100%; box-sizing: border-box; transform: translate; margin: 1% 0% 1% 0%; padding: 17px 0px 10px 0px; vertical-align: top; text-align: left; font-size: calc(26px + 0.42vw); font-family: Arial; color: #7EC3BC; }"
		,".MONTH_OF_THE_YEAR					{ display: inline-block; 	position: relative; width: 100%; box-sizing: border-box; transform: translate; margin: 1% 0% 1% 0%; padding: 17px 0px 10px 0px; vertical-align: top; text-align: left; font-size: calc(20px + 0.42vw); font-family: Arial; color: #7EC3BC; }");
		Текст = СтрЗаменить(Текст,
		".BLOK_DAY_ADD_INVISIBLE			{ display: inline-block; 	position: relative; vertical-align: middle; text-align: center; height: 20px; font-size: calc(12px + 0.52vw); width: 43%; background: white; box-sizing: border-box;}"
		,".BLOK_DAY_ADD_INVISIBLE			{ display: inline-block; 	position: relative; vertical-align: middle; text-align: center; height: 15px; font-size: calc(8px + 0.52vw); width: 43%; background: white; box-sizing: border-box;}");
		
		Текст = СтрЗаменить(Текст, 
		".BLOK_DAY_ADD						{ display: inline-block; 	position: relative; vertical-align: middle; text-align: center; height: 20px; font-size: calc(12px + 0.52vw); width: 43%; background: #F0F0F0; box-sizing: border-box; cursor: pointer;}"
		,".BLOK_DAY_ADD						{ display: inline-block; 	position: relative; vertical-align: middle; text-align: center; height: 15px; font-size: calc(8px + 0.52vw); width: 43%; background: #F0F0F0; box-sizing: border-box; cursor: pointer;}");
		
		Текст = СтрЗаменить(Текст, 
		".BLOK_DAY_ADD_WEEKEND				{ display: inline-block; 	position: relative; vertical-align: middle; text-align: center; height: 20px; color: #D1D1D1; font-size: calc(12px + 0.52vw); width: 43%; background: #FAF3F3; box-sizing: border-box;}"
		,".BLOK_DAY_ADD_WEEKEND				{ display: inline-block; 	position: relative; vertical-align: middle; text-align: center; height: 15px; color: #D1D1D1; font-size: calc(8px + 0.52vw); width: 43%; background: #FAF3F3; box-sizing: border-box;}");
		
		Текст = СтрЗаменить(Текст, 
		".BLOK_NUMBER_OF_THE_DAY			{ display: inline-block; 	position: relative; vertical-align: middle; text-align: right; height: 20px; font-size: calc(12px + 0.52vw); width: 52%; background: white; box-sizing: border-box; cursor: default; padding-right: 4px;}"
		,".BLOK_NUMBER_OF_THE_DAY			{ display: inline-block; 	position: relative; vertical-align: middle; text-align: right; height: 15px; font-size: calc(8px + 0.52vw); width: 52%; background: white; box-sizing: border-box; cursor: default; padding-right: 4px;}");
		
		Текст = СтрЗаменить(Текст, 
		".BLOK_NUMBER_OF_THE_DAY_WEEKEND	{ display: inline-block; 	position: relative; vertical-align: middle; text-align: right; height: 20px; color: #D1D1D1; font-size: calc(12px + 0.52vw); width: 52%; background: white; box-sizing: border-box; cursor: default; padding-right: 4px;}"
		,".BLOK_NUMBER_OF_THE_DAY_WEEKEND	{ display: inline-block; 	position: relative; vertical-align: middle; text-align: right; height: 15px; color: #D1D1D1; font-size: calc(10px + 0.52vw); width: 52%; background: white; box-sizing: border-box; cursor: default; padding-right: 4px;}");
		
		Текст = СтрЗаменить(Текст, 
		".BLOCK_INVISIBLE					{ display: block; 			position: relative; width: 100%; min-height: 55px; height: auto; background: white; }"
		,".BLOCK_INVISIBLE					{ display: block; 			position: relative; width: 100%; min-height: 35px; height: auto; background: white; }");
		
		Текст = СтрЗаменить(Текст, 
		".BLOCK_EMPTY						{ display: block; 			position: relative; width: 100%; min-height: 55px; height: auto; background: #F0F0F0; }"
		,".BLOCK_EMPTY						{ display: block; 			position: relative; width: 100%; min-height: 35px; height: auto; background: #F0F0F0; }");
		
		Текст = СтрЗаменить(Текст, 
		".BLOCK_FILLED						{ display: block; 			position: relative; width: 100%; min-height: 55px; height: auto; background: #DEEDD7; }"
		,".BLOCK_FILLED						{ display: block; 			position: relative; width: 100%; min-height: 35px; height: auto; background: #DEEDD7; }");
		
		Текст = СтрЗаменить(Текст, 
		".BLOCK_WEEKEND						{ display: block; 			position: relative; width: 100%; min-height: 55px; height: auto; background: #FAF3F3; }"
		,".BLOCK_WEEKEND					{ display: block; 			position: relative; width: 100%; min-height: 35px; height: auto; background: #FAF3F3; }");
		
	КонецЕсли;
	
	Возврат Текст + Символы.ПС;
	
КонецФункции

&НаСервере
// Процедура - Вывести наименование месяца планирования
// 
// Параметры:
//  ТелоТаблицы		 - 	 - 
//  ТекДатаПозиции	 - 	 - 
// 
Процедура ВывестиНаименованиеМесяцаПланирования(ТекстовыйПосторитель, Знач ТекДатаПозиции)
	
	ТекстовыйПосторитель.ЗаписатьБезОбработки(Символы.ПС + "<div class='MONTH_OF_THE_YEAR ANCHOR_" + Формат(ТекДатаПозиции,"ДФ='MMyy'") + "'>" + Формат(ТекДатаПозиции,"ДФ='MMММ yyyy'") + "</div>" + Символы.ПС + Символы.ПС);
				
КонецПроцедуры

&НаСервере
// Процедура - Вывести невидимую заглушку дня
// 
// Параметры:
//  ТелоТаблицы	 - 	 - 
// 
Процедура ВывестиНевидимуюЗаглушкуДня(ТекстовыйПосторитель, ЭтоПервыйПроход)
	
	ТелоТаблицы = "";			
	ТелоТаблицы = ТелоТаблицы + Символы.ПС + "
	|	<div class='DAY_INVISIBLE'>
	|		<div class='BLOK_DAY_TABLE'>";
	Если ЭтоПервыйПроход Тогда
		ТелоТаблицы = ТелоТаблицы + "		
		|			<div class='ROW_HAT_BLOK_OF_THE_DAY'>
		|				<div class='BLOK_DAY_ADD_INVISIBLE'></div>
		|				<div class='BLOK_NUMBER_OF_THE_DAY'></div>				
		|			</div>";
	КонецЕсли;
	ТелоТаблицы = ТелоТаблицы + "	
	|			<div class='ROW_UNIT_BODY_OF_THE_DAY'>
	|				<div class='BLOCK_INVISIBLE'></div>		
	|			</div>
	|		</div>
	|	</div>";	
	
	ТекстовыйПосторитель.ЗаписатьБезОбработки(ТелоТаблицы);									
	
КонецПроцедуры

&НаСервере
// Процедура - Вывести рабочий день сотрудника
// 
// Параметры:
//  ТелоТаблицы		 - 	 - 
//  ТекДатаПозиции	 - 	 - 
//  ЭтоПервыйПроход	 - 	 - 
// 
Процедура ВывестиРабочийДеньСотрудника(ТекстовыйПосторитель, СтрокаБуфераВЭтотДень, Знач ТекДатаПозиции, ЭтоПервыйПроход, ID)
	
	ТелоТаблицы = "";				
	ТелоТаблицы = ТелоТаблицы + Символы.ПС + "
	|	<div class='DAY_FILLED' id = '" + ID + "'>
	|		<div class='BLOK_DAY_TABLE' id = '" + ID + "'>";
	Если ЭтоПервыйПроход Тогда
		ТелоТаблицы = ТелоТаблицы + "		
		|			<div class='ROW_HAT_BLOK_OF_THE_DAY' id = '" + "+Дн" + ID + "'>
		|				<div class='BLOK_DAY_ADD' id = '" + "+Дн" + ID + "'>+</div>
		|				<div class='BLOK_NUMBER_OF_THE_DAY'>" + Строка(День(ТекДатаПозиции)) + "</div>				
		|			</div>";
	КонецЕсли;
	
	ПредставлениеРабочегоВремени = ?(
		СтрокаБуфераВЭтотДень.ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Больничный Или СтрокаБуфераВЭтотДень.ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Отпуск,
		ПредставлениеЗначенияПараметраЗанятияНаСервере(СтрокаБуфераВЭтотДень, "ТипРабочегоВремени"),
		ПредставлениеЗначенияПараметраЗанятияНаСервере(СтрокаБуфераВЭтотДень, "ИнтервалыРаботы")
	);
	
	ТелоТаблицы = ТелоТаблицы + "
	|			<div class='ROW_UNIT_BODY_OF_THE_DAY' id = '" + ID + "'>
	|				<div class='BLOCK_FILLED' id = '" + ID + "'>
	| 					" + ?(ЗначениеЗаполнено(ОтборСотрудник), "<div class = 'STAFFER'></div>", "<div class = 'STAFFER' id = '" + ID + "'>" + ПредставлениеЗначенияПараметраЗанятияНаСервере(СтрокаБуфераВЭтотДень, "Сотрудник") + "</div>") + "
	|					<div class = 'INTERVALS_OF_WORK' id = '" + ID + "'>" + ПредставлениеРабочегоВремени + "</div>						
	|				</div>		
	|			</div>
	|		</div>
	|	</div>";	
	
	ТекстовыйПосторитель.ЗаписатьБезОбработки(ТелоТаблицы);									
	
КонецПроцедуры

&НаСервере
// Процедура - Вывести удаленный рабочий день сотрудника
// 
// Параметры:
//  ТелоТаблицы				 - 	 - 
//  СтрокаБуфераВЭтотДень	 - 	 - 
//  ТекДатаПозиции			 - 	 - 
//  ЭтоПервыйПроход			 - 	 - 
// 
Процедура ВывестиУдаленныйРабочийДеньСотрудника(ТекстовыйПосторитель, СтрокаБуфераВЭтотДень, Знач ТекДатаПозиции, ЭтоПервыйПроход, ID)
	
	ТелоТаблицы = "";				
	ТелоТаблицы = ТелоТаблицы + Символы.ПС + "
	|	<div class='DAY_EMPTY' id = '" + ID + "'>
	|		<div class='BLOK_DAY_TABLE' id = '" + ID + "'>";
	Если ЭтоПервыйПроход Тогда
		ТелоТаблицы = ТелоТаблицы + "		
		|			<div class='ROW_HAT_BLOK_OF_THE_DAY' id = '" + "+Дн" + ID + "'>
		|				<div class='BLOK_DAY_ADD' id = '" + "+Дн" + ID + "'>+</div>
		|				<div class='BLOK_NUMBER_OF_THE_DAY'>" + Строка(День(ТекДатаПозиции)) + "</div>				
		|			</div>";
	КонецЕсли;
	ТелоТаблицы = ТелоТаблицы + "
	|			<div class='ROW_UNIT_BODY_OF_THE_DAY' id = '" + ID + "'>
	|				<div class='BLOCK_EMPTY' id = '" + ID + "'>
	| 					" + ?(ЗначениеЗаполнено(ОтборСотрудник), "<div class = 'STAFFER'></div>", "<div class = 'STAFFER_REMOTE' id = '" + ID + "'>" + ПредставлениеЗначенияПараметраЗанятияНаСервере(СтрокаБуфераВЭтотДень, "Сотрудник") + "</div>") + "
	|					<div class = 'INTERVALS_OF_WORK_REMOTE' id = '" + ID + "'>" + ПредставлениеЗначенияПараметраЗанятияНаСервере(СтрокаБуфераВЭтотДень, "ИнтервалыРаботы") + "</div>						
	|				</div>		
	|			</div>
	|		</div>
	|	</div>";	
	
	ТекстовыйПосторитель.ЗаписатьБезОбработки(ТелоТаблицы);									
	
КонецПроцедуры

&НаСервере
// Процедура - Вывести рабочий незанятый день
// 
// Параметры:
//  ТелоТаблицы		 - 	 - 
//  ТекДатаПозиции	 - 	 - 
// 
Процедура ВывестиРабочийНезанятыйДень(ТекстовыйПосторитель, Знач ТекДатаПозиции, ID)
	
	ТелоТаблицы = "";				
	ТелоТаблицы = ТелоТаблицы + Символы.ПС + "
	|	<div class='DAY_EMPTY' style = 'cursor: pointer;' id = '" + "+Дн" + ID + "'>
	|		<div class='BLOK_DAY_TABLE' id = '" + "+Дн" + ID + "'>
	|			<div class='ROW_HAT_BLOK_OF_THE_DAY' id = '" + "+Дн" + ID + "'>
	|				<div class='BLOK_DAY_ADD' id = '" + "+Дн" + ID + "'>+</div>
	|				<div class='BLOK_NUMBER_OF_THE_DAY'>" + Строка(День(ТекДатаПозиции)) + "</div>				
	|			</div>
	|			<div class='ROW_UNIT_BODY_OF_THE_DAY' id = '" + "+Дн" + ID + "'>
	|				<div class='BLOCK_EMPTY' id = '" + "+Дн" + ID + "'></div>		
	|			</div>
	|		</div>
	|	</div>";	
	
	ТекстовыйПосторитель.ЗаписатьБезОбработки(ТелоТаблицы);									
	
КонецПроцедуры

&НаСервере
// Процедура - Вывести не рабочий день
// 
// Параметры:
//  ТелоТаблицы		 - 	 - 
//  ТекДатаПозиции	 - 	 - 
// 
Процедура ВывестиНеРабочийДень(ТекстовыйПосторитель, Знач ТекДатаПозиции)
	
	ТелоТаблицы = "";				
	ТелоТаблицы = ТелоТаблицы + Символы.ПС + "
	|	<div class='DAY_WEEKEND'>
	|		<div class='BLOK_DAY_TABLE'>
	|			<div class='ROW_HAT_BLOK_OF_THE_DAY'>
	|				<div class='BLOK_DAY_ADD_WEEKEND'>+</div>
	|				<div class='BLOK_NUMBER_OF_THE_DAY_WEEKEND'>" + Строка(День(ТекДатаПозиции)) + "</div>				
	|			</div>
	|			<div class='ROW_UNIT_BODY_OF_THE_DAY'>
	|				<div class='BLOCK_WEEKEND'></div>		
	|			</div>
	|		</div>
	|	</div>";	
	
	ТекстовыйПосторитель.ЗаписатьБезОбработки(ТелоТаблицы);									
	
КонецПроцедуры

&НаКлиенте
// Функция - Формирование интервалов завершено
// 
// Возвращаемое значение:
//   - 
// 
Функция ФормированиеИнтерваловЗавершено(СообщитьПользователю = Истина)
	
	ФормированиеИнтерваловЗавершено = Истина;
	
	Для Каждого ИнтервалСписка Из ОтборИнтервалыРаботы Цикл 
		Если ИнтервалСписка.Значение.НачалоРаботы = Неопределено ИЛИ ИнтервалСписка.Значение.ОкончаниеРаботы = Неопределено Тогда 
			ФормированиеИнтерваловЗавершено = Ложь;
			Если СообщитьПользователю Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Формирование интервалов работы на панели не завершено.", ЭтотОбъект);
			КонецЕсли;
		    Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ФормированиеИнтерваловЗавершено;
	
КонецФункции

&НаСервере
// Процедура - Сформировать заголовок группы отборов
// 
Процедура СформироватьЗаголовокГруппыОтборовИФормы()
	
	Если ЗначениеЗаполнено(ОтборСотрудник) Тогда 
		Если ПерейтиГрафикРаботыСотрудника = Ложь Тогда
			ЭтаФорма.АвтоЗаголовок 	= Ложь;
			ЭтаФорма.Заголовок 		= "График работы сотрудника";
			Элементы.ПраваяКолонка.ОтображатьЗаголовок = Ложь;
		Иначе
			ЭтаФорма.АвтоЗаголовок 	= Ложь;
		КонецЕсли;
	Иначе 
		Элементы.ПраваяКолонка.ОтображатьЗаголовок = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обновить декорацию упраления сохранением шаблонов
// 
Процедура ОбновитьДекорациюУпраленияСохранениемШаблонов()
	
	Если СписокШаблоновСодержитСтруктуруИнтервалов().Успех Тогда 
		Элементы.ДекорацияУправленияСохранениемШаблонов.Картинка = БиблиотекаКартинок.РейтингЗвездаЗаполненная;
		Элементы.ДекорацияУправленияСохранениемШаблонов.Подсказка = "Удалить из списка шаблонов";
	Иначе 
		Элементы.ДекорацияУправленияСохранениемШаблонов.Картинка = БиблиотекаКартинок.РейтингЗвездаПустая;
		Элементы.ДекорацияУправленияСохранениемШаблонов.Подсказка = "Сохранить как шаблон в список";		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Функция - Список шаблонов содержит структуру интервалов
// 
// Возвращаемое значение:
//   - 
// 
Функция СписокШаблоновСодержитСтруктуруИнтервалов()
	
	СписокШаблоновПуст 		= СписокШаблонов.Количество() = 0;
	ЕстьПопадание 			= Ложь;
	ИндексШаблона 			= Неопределено;
	Информация 				= "";
	ИнтервалыСформированы 	= Истина;
	СовпадаетПоКоличеству 	= Истина;
	МассивСовпавших 		= Новый Массив;
	
	// Проверим сформированы ли интервалы
	Если НЕ ФормированиеИнтерваловЗавершено(Ложь) Тогда 
	// Для Каждого ИнтервалСписка Из ОтборИнтервалыРаботы Цикл 
	// 	Если ИнтервалСписка.Значение.НачалоРаботы = Неопределено ИЛИ ИнтервалСписка.Значение.ОкончаниеРаботы = Неопределено Тогда 
			ИнтервалыСформированы = Ложь;
			Информация = "Формирование интервалов работы в панели не завершено. Сохранение шаблона не возможно.";
	// 		Прервать;
	// 	КонецЕсли;
	// КонецЦикла;
	КонецЕсли;
	
	// Начинаем сравнение
	Если НЕ СписокШаблоновПуст И ИнтервалыСформированы Тогда
		
		Для Каждого Шаблон Из СписокШаблонов Цикл
			
			// Проверяем на совпадение по количеству
			Если НЕ Шаблон.Значение.Количество() = ОтборИнтервалыРаботы.Количество() Тогда 
				СовпадаетПоКоличеству = Ложь;
				Продолжить;
			Иначе 
				СовпадаетПоКоличеству = Истина;
			КонецЕсли;
			
			// Дальше проверяем на совпадение
			Для Каждого ИнтервалШаблона Из Шаблон.Значение Цикл 
				
				ИнтервалСовпал = Ложь;
				Для Каждого ИнтервалСписка Из ОтборИнтервалыРаботы Цикл 
					Если ИнтервалСписка.Значение.НачалоРаботы = ИнтервалШаблона.Значение.НачалоРаботы И ИнтервалСписка.Значение.ОкончаниеРаботы = ИнтервалШаблона.Значение.ОкончаниеРаботы Тогда 
						ИнтервалСовпал = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если ИнтервалСовпал Тогда
					МассивСовпавших.Добавить(ИнтервалШаблона.Значение);
				Иначе
					МассивСовпавших.Очистить();
					Прервать;
				КонецЕсли;	
				
			КонецЦикла;
			
			Если МассивСовпавших.Количество() = Шаблон.Значение.Количество() Тогда 
				ЕстьПопадание = Истина;
				ИндексШаблона = СписокШаблонов.Индекс(Шаблон);
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	Возврат Новый Структура("Успех, ИндексШаблона, Информация", ЕстьПопадание, ИндексШаблона, Информация);
	
КонецФункции

&НаКлиенте
// Процедура - Установить текущий элемент
// 
Процедура УстановитьТекущийЭлемент()
	
	Если Элементы.ОтборСотрудник.Видимость Тогда 
		ЭтаФорма.ТекущийЭлемент = Элементы.ОтборСотрудник;
	Иначе 
		ЭтаФорма.ТекущийЭлемент = Элементы.ФормаКомандаСформировать;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Функция - Вернуть последнее указанное время
// 
// Параметры:
//  ИндексСтроки - 	 - 
//  Шаг			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ВернутьПоследнееУказанноеВремя(Знач СтруктураДанныеЭлемента, Знач Шаг)
	
	Если СтруктураДанныеЭлемента.ЭтоНачалоИнтервала ИЛИ ОтборИнтервалыРаботы[СтруктураДанныеЭлемента.ИндексСтроки].Значение.НачалоРаботы = Неопределено Тогда 
		ИндексСтроки 		= СтруктураДанныеЭлемента.ИндексСтроки - 1;
	Иначе  
		ИндексСтроки 		= СтруктураДанныеЭлемента.ИндексСтроки;
	КонецЕсли;	
	ПоследнееУказанноеВремя = Неопределено;
	
	Пока ИндексСтроки >= 0 Цикл
		Если СтруктураДанныеЭлемента.ЭтоНачалоИнтервала Тогда
			Если НЕ ОтборИнтервалыРаботы[ИндексСтроки].Значение.ОкончаниеРаботы = Неопределено Тогда 
				ПоследнееУказанноеВремя = ОтборИнтервалыРаботы[ИндексСтроки].Значение.ОкончаниеРаботы;
				Прервать;
			ИначеЕсли НЕ ОтборИнтервалыРаботы[ИндексСтроки].Значение.НачалоРаботы = Неопределено Тогда	
				ПоследнееУказанноеВремя = ОтборИнтервалыРаботы[ИндексСтроки].Значение.НачалоРаботы;
				Прервать;
			КонецЕсли;
		Иначе
			Если ИндексСтроки = СтруктураДанныеЭлемента.ИндексСтроки И НЕ ОтборИнтервалыРаботы[ИндексСтроки].Значение.НачалоРаботы = Неопределено Тогда 
				ПоследнееУказанноеВремя = ОтборИнтервалыРаботы[ИндексСтроки].Значение.НачалоРаботы;
				Прервать;
			Иначе 	
				Если НЕ ОтборИнтервалыРаботы[ИндексСтроки].Значение.ОкончаниеРаботы = Неопределено Тогда	
					ПоследнееУказанноеВремя = ОтборИнтервалыРаботы[ИндексСтроки].Значение.ОкончаниеРаботы;
					Прервать;
				ИначеЕсли НЕ ОтборИнтервалыРаботы[ИндексСтроки].Значение.НачалоРаботы = Неопределено Тогда	
					ПоследнееУказанноеВремя = ОтборИнтервалыРаботы[ИндексСтроки].Значение.НачалоРаботы;
					Прервать;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		ИндексСтроки = ИндексСтроки - 1;		
	КонецЦикла;	
	
	Если НЕ ПоследнееУказанноеВремя = Неопределено Тогда 
		ПоследнееУказанноеВремя = ПоследнееУказанноеВремя + Шаг*60;
	КонецЕсли;	
		
	Возврат ПоследнееУказанноеВремя;	
	
КонецФункции

&НаКлиенте
// Процедура - Обновить общее время интервалов
// 
Процедура ОбновитьОбщееВремяИнтервалов()
	
	СуммаМинут 		= 0;
	Для Каждого Интервал Из ОтборИнтервалыРаботы Цикл 
		Если НЕ Интервал.Значение.НачалоРаботы = Неопределено И НЕ Интервал.Значение.ОкончаниеРаботы = Неопределено Тогда 
			КоличествоМинут = Цел((Интервал.Значение.ОкончаниеРаботы - Интервал.Значение.НачалоРаботы) / 60);
		Иначе 
			КоличествоМинут = 0;
		КонецЕсли;
		СуммаМинут = СуммаМинут + КоличествоМинут;	
	КонецЦикла;
	
	Если СуммаМинут = 0 Тогда 
		Элементы.ПоказатьСписокШаблонов.Заголовок = "Смены";
	Иначе 
		Часы  = Цел(СуммаМинут / 60);
		Минут = СуммаМинут - (Часы * 60);		
		Элементы.ПоказатьСписокШаблонов.Заголовок = "Смены (" +  ?(Часы > 0 ,"" + Часы + " ч.","") + ?(Минут > 0 ,"" + Минут + " м.","") + ")";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтруктурнаяЕдиницаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ОтборСотрудник) Тогда
		
		СтандартнаяОбработка = Ложь;
		МестаРаботы = ПолучитьМестаРаботы(ОтборСотрудник);
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(МестаРаботы);
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМестаРаботы(Сотрудник) 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СотрудникиМестаРаботы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|ИЗ
		|	Справочник.Сотрудники.МестаРаботы КАК СотрудникиМестаРаботы
		|ГДЕ
		|	СотрудникиМестаРаботы.Ссылка = &Ссылка
		|	И СотрудникиМестаРаботы.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И СотрудникиМестаРаботы.СтруктурнаяЕдиница.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Ссылка", Сотрудник);
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СтруктурнаяЕдиница");
	
	Возврат Результат;
	
КонецФункции

// Функция - проверяет наличие Визита сотрудника
// 
Функция ПроверитьНаличиеВизита(Знач Сотрудник, Знач Период, Знач СписокПериодов, Знач СтруктурнаяЕдиница = Неопределено)
	
	ЕстьЗаписи = Ложь;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Ссылка КАК Ссылка,
	               |	ВложенныйЗапрос.ДатаНачала КАК ДатаНачала,
	               |	ВложенныйЗапрос.ДатаОкончания КАК ДатаОкончания
	               |ИЗ
	               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |		ПриемЛечение.Ссылка КАК Ссылка,
	               |		НАЧАЛОПЕРИОДА(ПриемЛечение.Ссылка.ВремяНачалаПриема, МИНУТА) КАК ДатаНачала,
	               |		НАЧАЛОПЕРИОДА(ПриемЛечение.Ссылка.ВремяОкончанияПриема, МИНУТА) КАК ДатаОкончания
	               |	ИЗ
	               |		Документ.Прием.Лечение КАК ПриемЛечение
	               |	ГДЕ
	               |		ПриемЛечение.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |		И ПриемЛечение.Сотрудник = &Сотрудник
	               |		И ПриемЛечение.Ссылка.Проведен = ИСТИНА
	               |		И НАЧАЛОПЕРИОДА(ПриемЛечение.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |		СобытиеУслуги.Ссылка,
	               |		СобытиеУслуги.ДатаНачала,
	               |		СобытиеУслуги.ДатаОкончания
	               |	ИЗ
	               |		Документ.Событие.Услуги КАК СобытиеУслуги
	               |	ГДЕ
	               |		СобытиеУслуги.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |		И СобытиеУслуги.Сотрудник = &Сотрудник
	               |		И СобытиеУслуги.Ссылка.Проведен = ИСТИНА
	               |		И СобытиеУслуги.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемНеСостоялся)
	               |		И СобытиеУслуги.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	               |		И НАЧАЛОПЕРИОДА(СобытиеУслуги.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)) КАК ВложенныйЗапрос
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНачала,
	               |	ДатаОкончания";

	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);	
	Запрос.УстановитьПараметр("Сотрудник"         , ?(ЗначениеЗаполнено(Сотрудник), Сотрудник, Неопределено));
	Запрос.УстановитьПараметр("Период"            , Период);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	СтрокаСобытияЕстьВПериоде = Ложь;
	Пока Результат.Следующий() Цикл 
		
		Для Каждого ЭлементСписка Из СписокПериодов Цикл
			
			// Если существует визит, пересекающийся с заданным периодом
			Если (Результат.ДатаНачала >= ЭлементСписка.Значение.НачалоРаботы И Результат.ДатаНачала < ЭлементСписка.Значение.ОкончаниеРаботы)
			ИЛИ  (Результат.ДатаНачала <= ЭлементСписка.Значение.НачалоРаботы И Результат.ДатаОкончания > ЭлементСписка.Значение.НачалоРаботы) Тогда
			
			    СтруктураВозврата = Новый Структура("НачалоРаботы, ОкончаниеРаботы", ЭлементСписка.Значение.НачалоРаботы, ЭлементСписка.Значение.ОкончаниеРаботы);
				Возврат СтруктураВозврата;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат Ложь;
	
КонецФункции

// 
&НаКлиенте
Процедура ОткрытьСписокСалонов(Команда)
	
	СписокЗначений = ПолучитьСписокСтоматологий();
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьСписокСалоновЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, СписокЗначений, ЭтаФорма.Элементы.ПереклСтоматология);
	
КонецПроцедуры

&НаСервере
// Функция - Получить список сотрудников.
// 
// Возвращаемое значение:
//   -
// 
Функция ПолучитьСписокСтоматологий()
	
	ТаблицаСтоматологий = ПолучитьТаблицуСтоматологий();
	
	СписокСтоматологий = Новый СписокЗначений;
	
	// Заполнение списка сотрудников.
	
	Отступ = "    ";
	
	Для Каждого СтрокаСтома Из ТаблицаСтоматологий Цикл
		
		Если ЗначениеЗаполнено(СтрокаСтома.Стоматология) Тогда    			
			
			СписокСтоматологий.Добавить(
			СтрокаСтома.Стоматология,
			Отступ+Строка(СтрокаСтома.Стоматология) ,,
			БиблиотекаКартинок.Реквизит);
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	Возврат СписокСтоматологий;
	
КонецФункции

&НаСервере
// Функция - Получить таблицу салонов.
// 
// Параметры:
//  ДатаВремяНачала						 - 	 -
//  ДатаВремяОкончания					 - 	 -
// 
// Возвращаемое значение:
//   -
// 
Функция ПолучитьТаблицуСтоматологий()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Стоматология
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	СтруктурныеЕдиницы.ПометкаУдаления = ЛОЖЬ
	|	И СтруктурныеЕдиницы.ЭтоГруппа = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	СтруктурныеЕдиницы.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтруктурныеЕдиницы.Наименование");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте
// Процедура - Открыть список заверщение Клиент.
// 
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
// 
Процедура ОткрытьСписокСалоновЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранноеЗначение		= Результат.Значение;
	ОтборСтруктурнаяЕдиница = ВыбранноеЗначение;
	
	Элементы.ОткрытьСписокСалоны.Заголовок = Строка(ВыбранноеЗначение);
	
 	// Получаем массив номеров рабочих дней недели для СЕ	
    ОбновитьМассивРабочихДнейВНеделе();

	ВремяРаботыСтруктурнойЕдиницы = ВернутьВремяРаботыСтруктурнойЕдиницы(ОтборСтруктурнаяЕдиница);

	ОбновитьОтображениеПланирования(Истина);	

КонецПроцедуры

&НаСервереБезКонтекста
// Функция вернет массив рабочих дней недели СЕ, если выставлен флаг ДобавитьВремяРаботы
// будет возвращен массив структур с рабочим временем
Функция РабочиеДниСтруктурнойЕдиницы(СтруктурнаяЕдиница, ДобавитьВремяРаботы = Истина) 
	
  	  РабочиеДни = Новый Массив;
	  Для Каждого СтрокаТ ИЗ СтруктурнаяЕдиница.РасписаниеРаботы Цикл
		  Если СтрокаТ.Активность = Истина Тогда
			  Если ДобавитьВремяРаботы = Истина Тогда
				  РабочиеДни.Добавить(Новый Структура("ДеньНедели,ДатаНачала,ДатаОкончания", Дата(2001, 01, ДеньНедели(СтрокаТ.ДеньНедели)), СтрокаТ.НачалоРаботы, СтрокаТ.ОкончаниеРаботы));
			  Иначе
				  РабочиеДни.Добавить(Дата(2001, 01, ДеньНедели(СтрокаТ.ДеньНедели)));
			  КонецЕсли;
		  КонецЕсли;
		  // Выходим по достижению 7-й строки(воскресенье, отсекая строку выходного дня)
		  Если  СтруктурнаяЕдиница.РасписаниеРаботы.Индекс(СтрокаТ) = 6 Тогда
			  Прервать;
		  КонецЕсли;	  
	  КонецЦикла;	  
	  
	  Возврат РабочиеДни;	  
  КонецФункции
  
  // Процедура, изменяет график работы сотрудников.
// 
Процедура ЗафиксироватьИзмененияВГрафикеСотрудниковВРегистре(СтруктурнаяЕдиница, БуферФормирования)
	
	БуферФормирования.Сортировать("Сотрудник, Дата, Операция Убыв");
	МассивЗаполнения  = Новый Массив;
	НСтроки 	  	  = 0;
	МассивСотрудников = Новый Массив;
	НачалоПериода 	  = НачалоДня(ТекущаяДатаСеанса());
	КонецПериода  	  = Неопределено;
	
	Пока НСтроки < БуферФормирования.Количество() Цикл
		
		// Подготовка буфера фиксации данных в пределах текущего месяца и текущего сотрудника
		СтрокаБуфера     = БуферФормирования[НСтроки];
		СтрокаБуфераСлед = Неопределено;
		Если НСтроки < БуферФормирования.Количество() - 1 Тогда
			СтрокаБуфераСлед = БуферФормирования[НСтроки + 1];
		КонецЕсли;
		МесяцОтбора  = Дата(Год(СтрокаБуфера.Дата), Месяц(СтрокаБуфера.Дата), 01);
		
		МесяцОтбораСлед = Неопределено;
		Если НСтроки < БуферФормирования.Количество() - 1 Тогда
			МесяцОтбораСлед  = Дата(Год(СтрокаБуфераСлед.Дата), Месяц(СтрокаБуфераСлед.Дата), 01);
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаБуфера.Операция) Тогда
			
			МассивЗаполнения.Добавить(СтрокаБуфера);
			
			Если МассивСотрудников.Найти(СтрокаБуфера.Сотрудник) = Неопределено Тогда
				МассивСотрудников.Добавить(СтрокаБуфера.Сотрудник);
			КонецЕсли;
			
			НачалоПериода = ?(НачалоПериода > СтрокаБуфера.Дата, СтрокаБуфера.Дата, НачалоПериода);
			КонецПериода  = ?(Не ЗначениеЗаполнено(КонецПериода) ИЛИ КонецПериода < СтрокаБуфера.Дата, СтрокаБуфера.Дата, КонецПериода);
			
		КонецЕсли;
		
		// Как только текущий сотрудник не совпадает с предыдущим или достигнут предел буфера
		// переходим к операции фиксации набора изменений по пред. сотруднику
		Если (СтрокаБуфераСлед = Неопределено
			ИЛИ СтрокаБуфераСлед.Сотрудник <> СтрокаБуфера.Сотрудник
			ИЛИ МесяцОтбораСлед <> МесяцОтбора)
			И МассивЗаполнения.Количество() > 0 Тогда
			
			// Создаем набор записей для конкретного сотрудника + разрез доп. параметров
			НаборЗаписей = РегистрыСведений.ВремяРаботыСотрудниковПлан.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(СтруктурнаяЕдиница);
			НаборЗаписей.Отбор.МесяцОтбор.Установить(МесяцОтбора);
			НаборЗаписей.Отбор.Сотрудник.Установить(МассивЗаполнения[0].Сотрудник);
			
			НаборЗаписей.Прочитать();
			ВременнаяТаблица = НаборЗаписей.Выгрузить();
			
			Для Каждого ЭлементМ ИЗ МассивЗаполнения Цикл
				
				// Если на строке пометка удаления 
				// находим эти данные во временной таблице и удаляем
				Если ЭлементМ.Операция = "Удалить" Тогда
					// Необходимо пройти по всем интервалам рабочего времени в этот день
					
					Если ЭлементМ.Свойство("ТипРабочегоВремени")
						И (ЭлементМ.ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Больничный 
						Или ЭлементМ.ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Отпуск) Тогда
						
						НайденныеСтроки = ВременнаяТаблица.НайтиСтроки(Новый Структура("ДатаВремяНачала", ЭлементМ.Дата));
						Для Каждого СтрокаН ИЗ НайденныеСтроки Цикл
							ВременнаяТаблица.Удалить(СтрокаН);
						КонецЦикла;

					Иначе
						
						Для Каждого ИнтервалВ ИЗ ЭлементМ.ИнтервалыРаботы Цикл
							ДатаВремяНачала = ЗаменитьВремяВДате(ЭлементМ.Дата,ИнтервалВ.Значение.НачалоРаботы);
							НайденныеСтроки = ВременнаяТаблица.НайтиСтроки(Новый Структура("ДатаВремяНачала", ДатаВремяНачала));
							Для Каждого СтрокаН ИЗ НайденныеСтроки Цикл
								ВременнаяТаблица.Удалить(СтрокаН);
							КонецЦикла;
						КонецЦикла;
						
					КонецЕсли;

					// Добавляем новые записи	
				ИначеЕсли ЭлементМ.Операция = "Создать" Тогда
					
					Если ЭлементМ.Свойство("ТипРабочегоВремени") 
						И (ЭлементМ.ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Больничный
						Или ЭлементМ.ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Отпуск) Тогда
						
						НоваяСтрока                     = ВременнаяТаблица.Добавить();
						НоваяСтрока.СтруктурнаяЕдиница  = СтруктурнаяЕдиница;
						НоваяСтрока.МесяцОтбор          = МесяцОтбора;
						НоваяСтрока.Сотрудник           = ЭлементМ.Сотрудник;
						НоваяСтрока.ДатаВремяНачала     = ЭлементМ.Дата;
						НоваяСтрока.ДатаВремяОкончания  = ЭлементМ.Дата;
						НоваяСтрока.Минуты              = 0;
						НоваяСтрока.ТипРабочегоВремени  = ЭлементМ.ТипРабочегоВремени;
						
					Иначе
						
						Для Каждого ИнтервалВ ИЗ ЭлементМ.ИнтервалыРаботы Цикл
							НоваяСтрока                     = ВременнаяТаблица.Добавить();
							НоваяСтрока.СтруктурнаяЕдиница  = СтруктурнаяЕдиница;
							НоваяСтрока.МесяцОтбор          = МесяцОтбора;
							НоваяСтрока.Сотрудник           = ЭлементМ.Сотрудник;
							ИнтервалВ.Значение.НачалоРаботы 	= Дата(Год("00010101"), Месяц("00010101"), День("00010101"), Час(ИнтервалВ.Значение.НачалоРаботы), Минута(ИнтервалВ.Значение.НачалоРаботы), Секунда(ИнтервалВ.Значение.НачалоРаботы));
							ИнтервалВ.Значение.ОкончаниеРаботы  = Дата(Год("00010101"), Месяц("00010101"), День("00010101"), Час(ИнтервалВ.Значение.ОкончаниеРаботы), Минута(ИнтервалВ.Значение.ОкончаниеРаботы), Секунда(ИнтервалВ.Значение.ОкончаниеРаботы));
							НоваяСтрока.ДатаВремяНачала     = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ЭлементМ.Дата, ИнтервалВ.Значение.НачалоРаботы); 
							НоваяСтрока.ДатаВремяОкончания  = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ЭлементМ.Дата, ИнтервалВ.Значение.ОкончаниеРаботы); 
							НоваяСтрока.Минуты              = (НоваяСтрока.ДатаВремяОкончания - НоваяСтрока.ДатаВремяНачала) / 60;
							НоваяСтрока.ТипРабочегоВремени  = Перечисления.ТипыРабочегоВремени.Рабочее;  // Перечисление есть, но в регистре ещё нет
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			
			НаборЗаписей.Загрузить(ВременнаяТаблица);
			НаборЗаписей.Записать(Истина);
			
			МассивЗаполнения.Очистить();
			
		КонецЕсли;
		
		НСтроки = НСтроки + 1;
	КонецЦикла;
	
	// Если операция фиксации изменений прошла успешно, то очищаем пометки операций
	НСтроки = 0;
	Пока НСтроки < БуферФормирования.Количество() Цикл
		Если БуферФормирования[НСтроки].Операция = "Удалить" Тогда
			БуферФормирования.Удалить(БуферФормирования[НСтроки]);
			Продолжить;
		КонецЕсли;
		БуферФормирования[НСтроки].Операция             = Неопределено;
		БуферФормирования[НСтроки].НомерОчередиОперации = Неопределено;
		
		НСтроки = НСтроки + 1;
	КонецЦикла;
	
	РегистрыСведений.СвободныеИнтервалыСотрудников.СформироватьИнтервалыПоСотрудникам(СтруктурнаяЕдиница, МассивСотрудников, НачалоПериода, КонецДня(КонецПериода));
	
КонецПроцедуры

// Функция, изменяет время в дате.
// 
Функция ЗаменитьВремяВДате(Дата, ВрямяНов)
	
	Возврат НачалоДня(Дата) + ?(ВрямяНов <> Дата(0001,01,02,00,00,00), ВрямяНов - НачалоДня(ВрямяНов), 86400); 	
	
КонецФункции


#КонецОбласти
