
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьФормуПоТипуШаблона()
	
	Элементы.ОбъектМетаданных.Доступность = Объект.ТипШаблона = Перечисления.ТипыШаблонов.ФискальныйЧек;
	
КонецПроцедуры // ОбновитьФормуПоТипуШаблона()

&НаКлиенте
Процедура РедактироватьМакет(Команда)
		// проверим тип и объект
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "Для редактирования шаблона необходимо записать элемент!");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ТипШаблона) Тогда
		ПоказатьПредупреждение(, "Не указан тип шаблона!");
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыОткрытия.Вставить("АдресШаблона", АдресШаблона);
	
	Если Объект.ТипШаблона = ПредопределенноеЗначение("Перечисление.ТипыШаблонов.ЭтикеткаЦенник") Тогда
		ОткрытьФорму("Справочник.ХранилищеШаблонов.Форма.ФормаРедактированияШаблонаЭтикетокИЦенников", ПараметрыОткрытия, ЭтаФорма);
	ИначеЕсли Объект.ТипШаблона = ПредопределенноеЗначение("Перечисление.ТипыШаблонов.ПластиковаяКарта") Тогда
		ОткрытьФорму("Справочник.ХранилищеШаблонов.Форма.ФормаРедактированияШаблонаПластиковыхКарт", ПараметрыОткрытия, ЭтаФорма);
	ИначеЕсли Объект.ТипШаблона = ПредопределенноеЗначение("Перечисление.ТипыШаблонов.Сертификат") Тогда
		ОткрытьФорму("Справочник.ХранилищеШаблонов.Форма.ФормаРедактированияШаблонаСертификата", ПараметрыОткрытия, ЭтаФорма);	
	Иначе	
	КонецЕсли;
	
КонецПроцедуры // РедактироватьМакет()

&НаСервере
Процедура ЗаполнитьОбъектыМетаданных(КоллекцияМетаданных)
	
	Для Каждого МетаданныеОбъекта Из КоллекцияМетаданных Цикл
		Для Каждого Макет Из МетаданныеОбъекта.Макеты Цикл
			Если ВРег(Макет.Имя) = ВРег("ПоляШаблона") Тогда
				Элементы.ОбъектМетаданных.СписокВыбора.Добавить(МетаданныеОбъекта.ПолноеИмя(), МетаданныеОбъекта.Представление());
				прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Элементы.ОбъектМетаданных.СписокВыбора.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
	
КонецПроцедуры // ЗаполнитьМетоданные()

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.ТипШаблона = Перечисления.ТипыШаблонов.ЭтикеткаЦенник Тогда
		
	КонецЕсли;
	Если НЕ ПустаяСтрока(АдресШаблона) Тогда
		ТекущийОбъект.Шаблон = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресШаблона));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// подсистема запрета редактирования ключевых реквизитов объектов	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
	ЗаполнитьОбъектыМетаданных(Метаданные.Справочники);
	ЗаполнитьОбъектыМетаданных(Метаданные.Документы);
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ОбъектЗначениеКопирования = Параметры.ЗначениеКопирования.ПолучитьОбъект();
		АдресШаблона = ПоместитьВоВременноеХранилище(ОбъектЗначениеКопирования.Шаблон.Получить(), УникальныйИдентификатор);
	Иначе
		ЭлементОбъект = РеквизитФормыВЗначение("Объект", Тип("СправочникОбъект.ХранилищеШаблонов"));
		АдресШаблона = ПоместитьВоВременноеХранилище(ЭлементОбъект.Шаблон.Получить(), УникальныйИдентификатор);
	КонецЕсли;
	ОбновитьФормуПоТипуШаблона();
	
	 ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// подсистема запрета редактирования ключевых реквизитов объектов	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
КонецПроцедуры // ПослеЗаписиНаСервере()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзмененШаблон" Тогда
		АдресШаблона = Параметр;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры // ОбработкаОповещения()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипШаблонаПриИзменении(Элемент)
	
	Элементы.ОбъектМетаданных.Доступность = Объект.ТипШаблона = ПредопределенноеЗначение("Перечисление.ТипыШаблонов.ФискальныйЧек");
	Объект.ОбъектМетаданных = "";
	АдресШаблона = "";
	
КонецПроцедуры // ТипШаблонаПриИзменении()

&НаКлиенте
Процедура НаименованиеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Элементы.Наименование.СписокВыбора.Очистить();
	Если ЗначениеЗаполнено(Объект.ОбъектМетаданных) 
		И Элементы.ОбъектМетаданных.СписокВыбора.НайтиПоЗначению(Объект.ОбъектМетаданных) <> Неопределено
	Тогда
		СтрокаНаименования = Элементы.ОбъектМетаданных.СписокВыбора.НайтиПоЗначению(Объект.ОбъектМетаданных).Представление;
		Элементы.Наименование.СписокВыбора.Добавить("Чек " + СтрокаНаименования);
		Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	КонецЕсли;
	
КонецПроцедуры // НаименованиеНачалоВыбораИзСписка()

#КонецОбласти









