
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") Тогда
		
		НоменклатураВладелец  = Параметры.Отбор.Владелец;
		
		Если НЕ НоменклатураВладелец.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас 
			И НЕ НоменклатураВладелец.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал Тогда
			
			ТекстЗаголовка = НСтр("ru = 'Упаковки доступны только для запасов'");
			
			АвтоЗаголовок = Ложь;
			Заголовок     = ТекстЗаголовка;

			Элементы.Список.ТолькоПросмотр = Истина;
				
		ИНаче
			
			ТекстЗаголовка = НСтр("ru = 'Упаковки для: ""%Владелец%""'");
			ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%Владелец%", Строка(НоменклатураВладелец));

			АвтоЗаголовок = Ложь;
			Заголовок     = ТекстЗаголовка;
		
		КонецЕсли;
		
    КонецЕсли;

КонецПроцедуры

#КонецОбласти