
#Область СлужебныйПрограммныйИнтерфейс

// Функция - Сегмент содержит объект
//
// Параметры:
//  Сегмент	 - 	 - 
//  Объект	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СегментСодержитОбъект(Сегмент, Объект) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставСегментов.Сегмент КАК Сегмент
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК СоставСегментов
	|ГДЕ
	|	СоставСегментов.Номенклатура = &ОбъектСегмента
	|	И СоставСегментов.Сегмент = &Сегмент");

	Запрос.УстановитьПараметр("Сегмент"       , Сегмент);
	Запрос.УстановитьПараметр("ОбъектСегмента", Объект);

	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции


#КонецОбласти