
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	Попытка
		
		Если Не ЗначениеЗаполнено(Путь) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить путь к файлу.");
			Возврат;
			
		КонецЕсли;
		
		МассивСтрок = Новый Массив;
		Файл        = Новый ЧтениеТекста(Путь);
		Строка      = Файл.ПрочитатьСтроку();
		Если Строка = Неопределено Тогда
			 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неверный формат файла.");
			 Возврат;
		КонецЕсли;

		Строка = Файл.ПрочитатьСтроку();
		Если Строка = Неопределено Тогда
			 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неверный формат файла.");
			 Возврат;
		КонецЕсли;

		КоличествоСтрок = 0;
		Пока Строка <> Неопределено Цикл
			
			Строка = Файл.ПрочитатьСтроку();
			Если Строка <> Неопределено Тогда
				
				МассивСтрок.Добавить(Строка);
				КоличествоСтрок = КоличествоСтрок + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		Файл.Закрыть();
		
		КоличествоЗагруженныхУслуг = ЗагрузкаКлассификатораУслуг.ДобавитьДанныеВКлассификаторУслуг(МассивСтрок);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обработано строк: " + КоличествоСтрок + ", создано услуг: " + КоличествоЗагруженныхУслуг);
		
		Оповестить("ОбновленКлассификаторУслуг");
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Диалог выбора читаемого файла 
	ДиалогВыбораФайла=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = "Файл загрузки (*.txt)|*.txt";		
	ДиалогВыбораФайла.Заголовок						=	"Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогВыбораФайла.ИндексФильтра					=	0;
	ДиалогВыбораФайла.ПолноеИмяФайла				=	Путь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла	=	Истина;
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ВыборФайлаИмпортаНачалоВыбораЗавершение", ЭтотОбъект, Новый 
		Структура("ДиалогВыбораФайла", ДиалогВыбораФайла)));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборФайлаИмпортаНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		Путь = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
	ЧитаемыйФайл = Новый Файл(Путь);    
	ЧитаемыйФайл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ВыборФайлаИмпортаНачалоВыбораЗавершение1", 
		ЭтотОбъект, Новый Структура("ЧитаемыйФайл", ЧитаемыйФайл)));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаИмпортаНачалоВыбораЗавершение1(Существует, ДополнительныеПараметры) Экспорт
	
	ЧитаемыйФайл = ДополнительныеПараметры.ЧитаемыйФайл;
	
	Если НЕ Существует Тогда
		ПоказатьПредупреждение(Неопределено, "Выбранный файл не существует!");
		Возврат;
	ИначеЕсли ЧитаемыйФайл.ЭтоКаталог() Тогда
		ПоказатьПредупреждение(Неопределено, "Загрузка данных из папок невозможна! Необходимо выбрать файл.");
		Возврат;
	КонецЕсли; 
	
	
КонецПроцедуры

#КонецОбласти
