
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// Вставить содержимое обработчика.
	// ПараметрыФормы = Новый Структура("", );
	// ОткрытьФорму("РегистрСведений.ИсторияВызовов.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	ДополнительныеПараметры = Новый Структура;
	// ДополнительныеПараметры.Вставить("ОтборПериод"							, Новый СтандартныйПериод(ВариантСтандартногоПериода.Сегодня));
	// ДополнительныеПараметры.Вставить("ОтборТипЗвонка"						, 4);			
	ДополнительныеПараметры.Вставить("ОтобразитьПользовательскийВидФормы"	, Истина);		
	ОткрытьФорму("РегистрСведений.ИсторияВызовов.ФормаСписка", ДополнительныеПараметры, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти