
#Область СлужебныеПроцедурыИФункции

// Процедура, обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипРасчета = 1;
	Ответственный = ПараметрыСеанса.ТекущийПользователь;                                                               	
	
	СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КассаККМ           = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.ОсновнаяКасса;
	
	СистемаНалогообложения = Справочники.Организации.ПолучитьСистемуНалогообложения(СтруктурнаяЕдиница.Организация);
	
КонецПроцедуры

#КонецОбласти