#Область СлужебныеПроцедурыИФункции

// Функция, обработка POST запроса, который прилетает с сайта JivpSite.
Функция api_v1МетодPOST(Запрос)
		
	УстановитьПривилегированныйРежим(Истина);	
	
	БазовыйURL = Запрос.БазовыйURL;
	
	ТекстJSON = Запрос.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);	
	
	ТаблицаВнешнихСистем 	= Справочники.ВнешниеСистемы.ПолучитьВнешниеСистемы(Перечисления.ТипыВнешнихСистем.JivoSite);
	IDЗапроса 				= Сред(Запрос.ПараметрыURL.Получить("*"), 2);
	IDВнешнейСистемы 		= ?(ТаблицаВнешнихСистем.Количество() > 0, ТаблицаВнешнихСистем[0].Ссылка.КлючПриложения, Неопределено);
	
	Если IDЗапроса <> IDВнешнейСистемы Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Ответ1с = Новый Структура;
	
	Если ПараметрыJSON.event_name = "chat_accepted" Тогда
		
		Ответ1с.Вставить("result", "ok");
		Ответ1с.Вставить("enable_assign", Ложь);
		
		custom_data = Новый Массив;
		custom_data.Добавить(Новый Структура("title", "Потенциальный клиент"));
		Ответ1с.Вставить("custom_data", custom_data);		
		
		Заявка = Справочники.Заявки.ПолучитьЗаявкуПоНомеруJivoSite(Строка(ПараметрыJSON.visitor.number));
		
		Если ЗначениеЗаполнено(Заявка) Тогда
			
			ОсновнойКлиент = Заявка.ОсновнойКлиент;
			
			Если ЗначениеЗаполнено(ОсновнойКлиент) Тогда
				
				МассивТелефон = ОсновнойКлиент.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
				МассивАдресЭП = ОсновнойКлиент.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
				
				contact_info = Новый Структура();
				contact_info.Вставить("name",  ОсновнойКлиент.НаименованиеПолное);
				contact_info.Вставить("phone", ?(ЗначениеЗаполнено(МассивТелефон), МассивТелефон[0].НомерТелефона, Неопределено));
				contact_info.Вставить("email", ?(ЗначениеЗаполнено(МассивАдресЭП), МассивАдресЭП[0].АдресЭП, Неопределено));
				
				Ответ1с.Вставить("contact_info", contact_info);
				
			КонецЕсли;
			
		Иначе
			
			Заявка = СоздатьЗаявку(ПараметрыJSON);			
			
		КонецЕсли;
		
		НавигационнаяСсылкаЗаявки = ПолучитьНавигационнуюСсылку(Заявка);
		ВнешнийАдресс = Константы.ВнешняяПубликацияАдрес.Получить();
		
		Если ЗначениеЗаполнено(ВнешнийАдресс)
			И ЗначениеЗаполнено(НавигационнаяСсылкаЗаявки) Тогда
			
			Ответ1с.Вставить("crm_link", ВнешнийАдресс + "#" + НавигационнаяСсылкаЗаявки);	
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыJSON.event_name = "offline_message" Тогда
				
		Заявка = Справочники.Заявки.ПолучитьЗаявкуПоНомеруJivoSite(Строка(ПараметрыJSON.visitor.number));
		
		Если НЕ ЗначениеЗаполнено(Заявка) Тогда
			
			Заявка = СоздатьЗаявку(ПараметрыJSON);			
			
		КонецЕсли;
		
		Ошибка = "";
		МассивСообщений = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПараметрыJSON.message, Символы.ПС, Истина);
		
		Для Индекс = 0 По МассивСообщений.ВГраница() Цикл
					
			НоваяЗапись = РегистрыСведений.ЖурналСообщений.СоздатьМенеджерЗаписи();
			НоваяЗапись.ДатаСообщения 	= ТекущаяДатаСеанса()- 60 + Индекс; // Внутрення защита jivosite метода offline_message 1-2 минуты, защита от спама. Сообщения отправляются на почту.
			НоваяЗапись.Период 			= НоваяЗапись.ДатаСообщения;
			НоваяЗапись.ВнешняяСистема	= Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.JivoSite);
			НоваяЗапись.ИдОператора 	= 0;
			НоваяЗапись.ИдКлиента 		= Строка(Формат(ПараметрыJSON.visitor.number, "ЧГ="));
			НоваяЗапись.ТекстСообщения 	= МассивСообщений[Индекс];
			НоваяЗапись.Прочитано		= Истина;
			
			Попытка		   
				НоваяЗапись.Записать(); 			   
			Исключение			   
				Ошибка = ОписаниеОшибки();			   
			КонецПопытки;
		
		КонецЦикла;
				
		Ответ1с.Вставить("result", ?(ЗначениеЗаполнено(Ошибка), "FAILURE", "OK"));	   

	ИначеЕсли ПараметрыJSON.event_name = "chat_updated" Тогда 	
		
		Заявка = Справочники.Заявки.ПолучитьЗаявкуПоНомеруJivoSite(Строка(ПараметрыJSON.visitor.number));
		Клиент = ?(ЗначениеЗаполнено(Заявка), Заявка.ОсновнойКлиент, Неопределено);
		Если ЗначениеЗаполнено(Клиент) Тогда
			
			КлиентОбъект = Клиент.ПолучитьОбъект();
			
			// Запись ФИО клиента.
			Если КлиентОбъект.НаименованиеПолное <> ПараметрыJSON.visitor.name Тогда
				
				СтруктруаФИО = ОбщегоНазначения.ВернутьФИОКлиента(ПараметрыJSON.visitor.name);	
				
				КлиентОбъект.Фамилия  = ?(СтруктруаФИО.Свойство("Фамилия"), СтруктруаФИО.Фамилия, "");
				КлиентОбъект.Имя 	  = ?(СтруктруаФИО.Свойство("Имя"), СтруктруаФИО.Имя, "");
				КлиентОбъект.Отчество = ?(СтруктруаФИО.Свойство("Отчество"), СтруктруаФИО.Отчество, "");

				КлиентОбъект.ДополнительныеСвойства.Вставить("МодифицироватьНаименованиеКонтрагента");
	
			КонецЕсли;
			
			// Запись новых телефонов.
			МассивТелефонов = КлиентОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
			НомерТелефонаССайта = ?(Строка(Лев(ПараметрыJSON.visitor.phone, 1)) = "+",  Сред(ПараметрыJSON.visitor.phone, 2), ПараметрыJSON.visitor.phone);
			
			Для каждого ЭлементМассива Из МассивТелефонов Цикл
			
				ТакойТелефонЕсть = ?(ЭлементМассива.НомерТелефона = НомерТелефонаССайта, Истина, Ложь);
										
			КонецЦикла;
			
			Если ТакойТелефонЕсть = Ложь Тогда
				
				ВидКИ         = Справочники.ВидыКонтактнойИнформации.ТелефонКлиента; 
				ТипКИ         = Перечисления.ТипыКонтактнойИнформации.Телефон;
				ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияXDTOВXML(
								УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияXDTOПоПредставлению(ПараметрыJSON.visitor.phone, ВидКИ));	
		
				УправлениеКонтактнойИнформациейСтоматология.ЗаписатьКонтактнуюИнформациюСтоматология(КлиентОбъект, ЗначенияПолей, ВидКИ, ТипКИ);
				
			КонецЕсли;
			
			// Запись новых адресов электронных почт.
			Если ПараметрыJSON.visitor.Свойство("email") Тогда
				
				МассивПочт = КлиентОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
				
				ТакаяПочтаЕсть = Ложь;
				
				Для каждого ЭлементМассива Из МассивПочт Цикл
					
					ТакаяПочтаЕсть = ?(ЭлементМассива.АдресЭП = ПараметрыJSON.visitor.email, Истина, Ложь);
					
				КонецЦикла;
				
				Если ТакаяПочтаЕсть = Ложь Тогда
					
					ВидКИ       = Справочники.ВидыКонтактнойИнформации.EmailКлиента; 
					ТипКИ       = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;					
					Значение 	= УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияПоПредставлению(ПараметрыJSON.visitor.email, ВидКИ));

					УправлениеКонтактнойИнформациейСтоматология.ЗаписатьКонтактнуюИнформациюСтоматология(КлиентОбъект, Значение, ВидКИ, ТипКИ);
					
				КонецЕсли;
				
			КонецЕсли;
				
		   КлиентОбъект.Записать();
		
	   КонецЕсли;
	   
   ИначеЕсли ПараметрыJSON.event_name = "chat_finished" Тогда 		
	   
	   Ошибка = "";
	   МассивСообщений = ПараметрыJSON.chat.messages;
	   
	   Для каждого Сообщение Из МассивСообщений Цикл
		   
		   НоваяЗапись = РегистрыСведений.ЖурналСообщений.СоздатьМенеджерЗаписи();
		   НоваяЗапись.ДатаСообщения 	= Дата(1970,1,1,3,0,0) + Сообщение.timestamp;
		   НоваяЗапись.Период 			= НоваяЗапись.ДатаСообщения;
		   НоваяЗапись.ВнешняяСистема	= Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.JivoSite);
		   НоваяЗапись.ИдОператора 		= ?(Сообщение.Свойство("agent_id"), Строка(Формат(Сообщение.agent_id, "ЧГ=")), "0");
		   НоваяЗапись.ИдКлиента 		= Строка(Формат(ПараметрыJSON.visitor.number, "ЧГ="));
		   НоваяЗапись.ТекстСообщения 	= Сообщение.message;
		   НоваяЗапись.Прочитано		= Истина;
		   
		   Попытка		   
			   НоваяЗапись.Записать(); 			   
		   Исключение			   
			   Ошибка = ОписаниеОшибки();			   
		   КонецПопытки;	  
		   
	   КонецЦикла;
	   
	   Если НЕ ЗначениеЗаполнено(Ошибка) Тогда	   
		   Ответ1с.Вставить("result", "ok");	   
	   КонецЕсли;
	   
	КонецЕсли;
	
	Возврат ПолучитьHTTPОтвет(Ответ1с);	
	
КонецФункции

// Функция, возвращает HTTPОтвет. 
//
Функция ПолучитьHTTPОтвет(Ответ1с, КодОтвета = Неопределено)
	
	КодОтвета = ?(КодОтвета = Неопределено, 200, КодОтвета);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто);		
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);	
	ЗаписатьJSON(ЗаписьJSON, Ответ1С);
	
	КодОтвета = 200;
	Если ТипЗнч(Ответ1С) = Тип("Структура") и Ответ1С.Свойство("Error") и Ответ1С.Error > 0 Тогда
		КодОтвета = 400;
	КонецЕсли;          	
	
	мОтвет = ЗаписьJSON.Закрыть(); 		
	HTTPОтвет = Новый HTTPСервисОтвет(КодОтвета);
	HTTPОтвет.УстановитьТелоИзСтроки(мОтвет);
	HTTPОтвет.Заголовки["Content-Type"] = "application/json";	
	
	Возврат HTTPОтвет; 
	
КонецФункции

// Функция, возвращает новую созданную заявку.
Функция СоздатьЗаявку(Структура)
	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.JivoSite);
	НоваяЗаявка = Справочники.Заявки.СоздатьЭлемент();
	
	СтруктураЗаполнения = Новый Структура();
	СтруктруаФИО = ОбщегоНазначения.ВернутьФИОКлиента(Структура.visitor.name);

	СтруктураЗаполнения.Вставить("Фамилия"			, ?(СтруктруаФИО.Свойство("Фамилия")	, СтруктруаФИО.Фамилия	, Неопределено));
	СтруктураЗаполнения.Вставить("Имя"				, ?(СтруктруаФИО.Свойство("Имя")		, СтруктруаФИО.Имя		, Неопределено));
	СтруктураЗаполнения.Вставить("Отчество"			, ?(СтруктруаФИО.Свойство("Отчество")	, СтруктруаФИО.Отчество	, Неопределено));

	СтруктураЗаполнения.Вставить("НомерТелефона"	, ?(Структура.visitor.Свойство("phone")	, Структура.visitor.phone, Неопределено));
	СтруктураЗаполнения.Вставить("АдресЭП"			, ?(Структура.visitor.Свойство("email")	, Структура.visitor.email, Неопределено));

	СтруктураЗаполнения.Вставить("РекламнаяСсылка"	, ?(Структура.Свойство("page") И Структура.page.Свойство("url"), Структура.page.url, Неопределено)); 
	СтруктураЗаполнения.Вставить("ВнешняяСистема"	, ВнешняяСистема); 
	СтруктураЗаполнения.Вставить("КаналПривлеченияЗначение", Справочники.КаналыПривлечения.ЧатСКлиентом);
	
	Если ЗначениеЗаполнено(ВнешняяСистема) И ЗначениеЗаполнено(ВнешняяСистема.СтруктурнаяЕдиница) Тогда
		 СтруктураЗаполнения.Вставить("СтруктурнаяЕдиница", ВнешняяСистема.СтруктурнаяЕдиница); 
	КонецЕсли;
	
	МассивКлиентов = Новый Массив;
	КонтрагентыПоНомеруТелефона = Справочники.Контрагенты.ПроверитьНаДублированиеКлиентаКИ(, Перечисления.ТипыКонтактнойИнформации.Телефон, СтруктураЗаполнения.НомерТелефона);
	КонтрагентыПоНомеруАдресуЭП = Справочники.Контрагенты.ПроверитьНаДублированиеКлиентаКИ(, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, СтруктураЗаполнения.АдресЭП);
	
	Если ЗначениеЗаполнено(КонтрагентыПоНомеруТелефона) Тогда
		ОбщегоНазначения.ДобавитьВМассив(МассивКлиентов, КонтрагентыПоНомеруТелефона, Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонтрагентыПоНомеруАдресуЭП) Тогда
		ОбщегоНазначения.ДобавитьВМассив(МассивКлиентов, КонтрагентыПоНомеруАдресуЭП, Истина);
	КонецЕсли;
	
	Если МассивКлиентов.Количество()>0 Тогда

		СтруктураЗаполнения.Вставить("ОсновнойКлиент", МассивКлиентов[0].Ссылка);
		СтруктураЗаполнения.Вставить("Статус", Перечисления.СтатусыЗаявок.Принята);
		
	КонецЕсли;

	НоваяЗаявка.Заполнить(СтруктураЗаполнения);
	
	НоваяЗаявка.ДополнительныеСвойства.Вставить("ОнлайнЗаявка", Истина);
	
	Попытка	
		НоваяЗаявка.Записать();	
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	НоваяЗапись = РегистрыСведений.КонтактыМессенджеров.СоздатьМенеджерЗаписи();
	НоваяЗапись.ВнешняяСистема 		= ВнешняяСистема;
	НоваяЗапись.Идентификатор 		= Строка(Формат(Структура.visitor.number, "ЧГ="));
	НоваяЗапись.ОбъектИдентификации = НоваяЗаявка.Ссылка;
	НоваяЗапись.Записать();
	
	Возврат НоваяЗаявка;
	
КонецФункции

#КонецОбласти
