
#Область СлужебныеПроцедурыИФункции

// Сохраняет отредактированный файл в ИБ и снимает с него блокировку
Процедура ЗакончитьРедактирование(
	ПараметрКоманды, 
	ИдентификаторФормы, 
	Знач ХранитьВерсии = Неопределено,
	Знач РедактируетТекущийПользователь = Неопределено, 
	Знач Редактирует = Неопределено,
	Знач АвторТекущейВерсии = Неопределено) Экспорт
	
	Если ПараметрКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		
		МассивОбработанных = РаботаСФайламиКлиент.ЗакончитьРедактированиеПоСсылкам(
			ПараметрКоманды, 
			ИдентификаторФормы); 
			
		ОповеститьОбИзменении(Тип("СправочникСсылка.Файлы"));
		
		Для Каждого ФайлСсылка Из МассивОбработанных Цикл
			Оповестить("ЗаконченоРедактирование", ФайлСсылка);
			Оповестить("ДанныеФайлаИзменены", ФайлСсылка);
			Оповестить("ВерсияСохранена", ФайлСсылка);
		КонецЦикла;	
		
	Иначе	
		
		РедактированиеЗакончено = Ложь;
		
		РедактированиеЗакончено = РаботаСФайламиКлиент.ЗакончитьРедактирование(
			ПараметрКоманды, 
			ИдентификаторФормы,
			ХранитьВерсии,
			РедактируетТекущийПользователь,
			Редактирует,
			АвторТекущейВерсии); 
		
		Если РедактированиеЗакончено Тогда 
			Оповестить("ЗаконченоРедактирование", ПараметрКоманды);
			ОповеститьОбИзменении(ПараметрКоманды);
			Оповестить("ДанныеФайлаИзменены", ПараметрКоманды);
			Оповестить("ВерсияСохранена", ПараметрКоманды);
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

// Блокирует файл для редактирования и открывает его
Процедура Редактировать(ОбъектСсылка, УникальныйИдентификатор = Неопределено, РабочийКаталогВладельца = Неопределено) Экспорт
	
	Если ОбъектСсылка = Неопределено Тогда
		Возврат;
	КонецЕсли;	
		
	Если РаботаСФайламиКлиент.РедактироватьФайлПоСсылке(ОбъектСсылка, УникальныйИдентификатор, РабочийКаталогВладельца) Тогда
		ОповеститьОбИзменении(ОбъектСсылка);
		Оповестить("ДанныеФайлаИзменены", ОбъектСсылка);
		Оповестить("ФайлРедактировался", ОбъектСсылка);
	КонецЕсли;	
	
КонецПроцедуры

// Выполняет блокировку файла или нескольких файлов
// ПараметрКоманды - либо ссылка на файл, либо массив ссылок на файлы
Процедура Занять(ПараметрКоманды, УникальныйИдентификатор = Неопределено) Экспорт
	
	Если ПараметрКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		
		РаботаСФайламиКлиент.ЗанятьФайлыПоСсылкам(ПараметрКоманды);
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.Файлы"));
		Для Каждого ФайлСсылка Из ПараметрКоманды Цикл
			Оповестить("ДанныеФайлаИзменены", ФайлСсылка);
		КонецЦикла;	
		
	Иначе	
		
		Если РаботаСФайламиКлиент.ЗанятьФайлПоСсылке(ПараметрКоманды, УникальныйИдентификатор) Тогда 
			ОповеститьОбИзменении(ПараметрКоманды);
			Оповестить("ДанныеФайлаИзменены", ПараметрКоманды);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

// Освобождает занятый ранее файл
Процедура ОсвободитьФайл(
	ПараметрКоманды,
	Знач ХранитьВерсии = Неопределено,
	Знач РедактируетТекущийПользователь = Неопределено, 
	Знач Редактирует = Неопределено,
	УникальныйИдентификатор = Неопределено) Экспорт

	Если ПараметрКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		
		РаботаСФайламиКлиент.ОсвободитьФайлыПоСсылкам(ПараметрКоманды); 
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.Файлы"));		
		Для Каждого ФайлСсылка Из ПараметрКоманды Цикл
			Оповестить("ДанныеФайлаИзменены", ФайлСсылка);
		КонецЦикла;	
			
	Иначе	
		
		Если РаботаСФайламиКлиент.ОсвободитьФайл(
			ПараметрКоманды, 
			ХранитьВерсии,
			РедактируетТекущийПользователь,
			Редактирует,
			УникальныйИдентификатор) Тогда
			
			ОповеститьОбИзменении(ПараметрКоманды);
			Оповестить("ДанныеФайлаИзменены", ПараметрКоманды);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Открывает файл для просмотра
Процедура Открыть(ДанныеФайла) Экспорт
	
	РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
	Оповестить("ФайлОткрыт", ДанныеФайла.Ссылка);	
	
КонецПроцедуры

// Сохраняет файл в информационной базе, но не освобождает его
Процедура ОпубликоватьФайл(ПараметрКоманды, ИдентификаторФормы) Экспорт
	
	Если ПараметрКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		
		РаботаСФайламиКлиент.ОпубликоватьФайлыПоСсылкам(ПараметрКоманды, ИдентификаторФормы);
		
		Для Каждого ФайлСсылка Из ПараметрКоманды Цикл
			Оповестить("ДанныеФайлаИзменены", ФайлСсылка);				
			Оповестить("ВерсияСохранена", ФайлСсылка);
		КонецЦикла;	
			
	Иначе	
		
		Если РаботаСФайламиКлиент.ОпубликоватьФайл(ПараметрКоманды, ИдентификаторФормы) Тогда
			Оповестить("ДанныеФайлаИзменены", ПараметрКоманды);				
			Оповестить("ВерсияСохранена", ПараметрКоманды);
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

// Открывает каталог на локальном компьютере в котором размещен этот файл
Процедура ОткрытьКаталогФайла(ДанныеФайла) Экспорт
	
	РаботаСФайламиКлиент.КаталогФайла(ДанныеФайла);
	
КонецПроцедуры

// Сохраняет текущую версию файла в выбранный каталог на жестком или сетевом диске
Процедура СохранитьКак(ДанныеФайла) Экспорт
	
	РаботаСФайламиКлиент.СохранитьКак(ДанныеФайла);	
	
КонецПроцедуры

// Выбирает на  диске файл и создает из него новую версию
Процедура ОбновитьИзФайлаНаДиске(ДанныеФайла, ИдентификаторФормы) Экспорт
	
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("ОбновитьИзФайлаНаДискеЗавершение", ЭтотОбъект, Новый Структура("ДанныеФайла, ИдентификаторФормы", ДанныеФайла, ИдентификаторФормы)));
	
КонецПроцедуры

Процедура ОбновитьИзФайлаНаДискеЗавершение(Подключено, ДополнительныеПараметры) Экспорт
	
	ДанныеФайла = ДополнительныеПараметры.ДанныеФайла;
	ИдентификаторФормы = ДополнительныеПараметры.ИдентификаторФормы;
	
	РасширениеПодключено = Подключено;
	Если РасширениеПодключено Тогда
		
		Если РаботаСФайламиКлиент.ОбновитьИзФайлаНаДиске(ДанныеФайла, ИдентификаторФормы) Тогда	
			ОповеститьОбИзменении(ДанныеФайла.Ссылка);
			Оповестить("ДанныеФайлаИзменены", ДанныеФайла.Ссылка);
			Оповестить("ВерсияСохранена", ДанныеФайла.Ссылка);
		КонецЕсли;
		
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = 'Для выполнения данной операции вам нужно установить расширение работы с файлами.'"));
	КонецЕсли;

КонецПроцедуры

// Формирует электронную цифровую подпись
//
Процедура СформироватьПодписьФайла(Знач ДанныеФайла, Знач ДанныеПодписи, ОписаниеОповещения) Экспорт
	
	Если НЕ ДанныеФайла.Редактирует.Пустая() Тогда
		ПоказатьПредупреждение(,ФайловыеФункцииКлиентСервер.СтрокаСообщенияОНедопустимостиПодписанияЗанятогоФайла());
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Ложь);
		Возврат;
	КонецЕсли;
	
	Если ДанныеФайла.Зашифрован Тогда
		ПоказатьПредупреждение(,ФайловыеФункцииКлиентСервер.СтрокаСообщенияОНедопустимостиПодписанияЗашифрованногоФайла());
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Ложь);
		Возврат;
	КонецЕсли;
	
	ТолькоЛичные = Истина;
	МассивСтруктурСертификатов = ЭлектроннаяЦифроваяПодписьКлиент.ПолучитьМассивСтруктурСертификатов(ТолькоЛичные);
	ПараметрыФормы = Новый Структура("МассивСтруктурСертификатов, ОбъектСсылка", МассивСтруктурСертификатов, ДанныеФайла.Ссылка);
	
	ОткрытьФорму("ОбщаяФорма.УстановкаПодписиЭЦП", ПараметрыФормы,,,,, 
	Новый ОписаниеОповещения("СформироватьПодписьФайлаЗавершение", ЭтотОбъект, Новый Структура("ДанныеФайла, ОписаниеОповещения", ДанныеФайла, ОписаниеОповещения)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры

Процедура СформироватьПодписьФайлаЗавершение(СтруктураПараметровПодписи, ДополнительныеПараметры) Экспорт
	
	ДанныеФайла = ДополнительныеПараметры.ДанныеФайла;
	ОписаниеОповещения = ДополнительныеПараметры.ОписаниеОповещения;
	
	Если ТипЗнч(СтруктураПараметровПодписи) = Тип("Структура") Тогда
		
		СтруктураВозврата = РаботаСФайламиВызовСервера.ПолучитьДанныеФайлаИДвоичныеДанные(ДанныеФайла.Ссылка);
		
		МенеджерКриптографии = ЭлектроннаяЦифроваяПодписьКлиент.ПолучитьМенеджерКриптографии();
		
		ДанныеПодписи = ЭлектроннаяЦифроваяПодписьКлиент.СформироватьДанныеПодписи(
		МенеджерКриптографии, ДанныеФайла.Ссылка, 
		СтруктураВозврата.ДвоичныеДанные, СтруктураПараметровПодписи);
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Новый Структура("Результат,ДанныеФайла, ДанныеПодписки", Истина, ДанныеФайла, ДанныеПодписи));
		Возврат;
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, Ложь);

КонецПроцедуры

// Зашифровать файл
//
Процедура Зашифровать(Знач ДанныеФайла,
					Знач УникальныйИдентификатор,
					Знач МассивДанныхДляЗанесенияВБазу,
					Знач МассивОтпечатков, ОписаниеОповещения) Экспорт
	
	Если ДанныеФайла.Зашифрован Тогда
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Файл ""%1"" уже зашифрован.'"), Строка(ДанныеФайла.Ссылка));
		ПоказатьПредупреждение(,Текст);
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Ложь);
		Возврат;
	КонецЕсли;
	
	Если НЕ ДанныеФайла.Редактирует.Пустая() Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Нельзя зашифровать занятый файл.'"));
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Ложь);
		Возврат;
	КонецЕсли;
	
	МассивСтруктурСертификатов = ЭлектроннаяЦифроваяПодписьКлиент.ПолучитьМассивСтруктурСертификатов(Ложь);
	
	ОтпечатокЛичногоСертификатаДляШифрования = ФайловыеФункцииКлиентПовтИсп.ПолучитьПерсональныеНастройкиРаботыСФайлами().ОтпечатокЛичногоСертификатаДляШифрования;
	
	ДополнительныеПараметры = Новый Структура("ДанныеФайла, МассивДанныхДляЗанесенияВБазу, МассивОтпечатков, МассивСтруктурСертификатов, ОписаниеОповещения, УникальныйИдентификатор", 
						ДанныеФайла, МассивДанныхДляЗанесенияВБазу, МассивОтпечатков, МассивСтруктурСертификатов, ОписаниеОповещения, УникальныйИдентификатор);
						
	// Отпечаток сохраненный в ХранилищеНастроек мог устареть - сертификат могли уже удалить
	Если ОтпечатокЛичногоСертификатаДляШифрования <> Неопределено И НЕ ПустаяСтрока(ОтпечатокЛичногоСертификатаДляШифрования) Тогда
		
		Сертификат = ЭлектроннаяЦифроваяПодписьКлиент.ПолучитьСертификатПоОтпечатку(ОтпечатокЛичногоСертификатаДляШифрования, Истина); // ТолькоЛичные
		Если Сертификат = Неопределено Тогда		
			ОтпечатокЛичногоСертификатаДляШифрования = "";
		КонецЕсли;
		
	Иначе	
		
		МассивСтруктурЛичныхСертификатов = ЭлектроннаяЦифроваяПодписьКлиент.ПолучитьМассивСтруктурСертификатов(Истина); // ТолькоЛичные
		
		ПараметрыФормы = Новый Структура("МассивСтруктурСертификатов", МассивСтруктурЛичныхСертификатов);				
		ОткрытьФорму("ОбщаяФорма.ВыборСертификата", ПараметрыФормы,,,,, 
						Новый ОписаниеОповещения("ЗашифроватьПослеВыбораСертификата", ЭтотОбъект,ДополнительныеПараметры), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
        Возврат;	
		
	КонецЕсли;
	
	ЗашифроватьФрагмент(ДополнительныеПараметры);

КонецПроцедуры

Процедура ЗашифроватьПослеВыбораСертификата(СтруктураВозврата, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(СтруктураВозврата) = Тип("Структура") Тогда
		ОтпечатокЛичногоСертификатаДляШифрования = СтруктураВозврата.Отпечаток;
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ЭЦП", "ОтпечатокЛичногоСертификатаДляШифрования", ОтпечатокЛичногоСертификатаДляШифрования,,,Истина);
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = 'Не выбран персональный сертификат для шифрования.'"));
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещения, Ложь);
		Возврат;
		
	КонецЕсли;
	
	ЗашифроватьФрагмент(ДополнительныеПараметры);

КонецПроцедуры

Процедура ЗашифроватьФрагмент(ДополнительныеПараметры)
	
	ПараметрыФормы = Новый Структура("МассивСтруктурСертификатов, ФайлСсылка, ОтпечатокЛичногоСертификатаДляШифрования",
	ДополнительныеПараметры.МассивСтруктурСертификатов,
	ДополнительныеПараметры.ДанныеФайла.Ссылка,
	ДополнительныеПараметры.ОтпечатокЛичногоСертификатаДляШифрования);
	ОткрытьФорму("ОбщаяФорма.ВыборСертификатовШифрования", ПараметрыФормы,,,,, Новый ОписаниеОповещения("ЗашифроватьФрагментЗавершение", ЭтотОбъект, ДополнительныеПараметры), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

Процедура ЗашифроватьФрагментЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДанныеФайла = ДополнительныеПараметры.ДанныеФайла;
	МассивДанныхДляЗанесенияВБазу = ДополнительныеПараметры.МассивДанныхДляЗанесенияВБазу;
	МассивОтпечатков = ДополнительныеПараметры.МассивОтпечатков;
	ОписаниеОповещения = ДополнительныеПараметры.ОписаниеОповещения;
	УникальныйИдентификатор = ДополнительныеПараметры.УникальныйИдентификатор;
    	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		
		РезультатШифрования = РаботаСФайламиКлиент.Зашифровать(ДанныеФайла.Ссылка,
		Результат,
		УникальныйИдентификатор,
		ДанныеФайла,
		МассивДанныхДляЗанесенияВБазу,
		МассивОтпечатков);
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Новый Структура("Результат,МассивДанныхДляЗанесенияВБазу, ДанныеПодписки", РезультатШифрования, МассивДанныхДляЗанесенияВБазу, МассивОтпечатков));
		Возврат;								
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, Ложь);
	Возврат;

КонецПроцедуры

// Расшифровать файл
//
Функция Расшифровать(ДанныеФайла, УникальныйИдентификатор, 
	МассивДанныхДляЗанесенияВБазу) Экспорт
	
	Возврат РаботаСФайламиКлиент.Расшифровать(ДанныеФайла.Ссылка, УникальныйИдентификатор, 
		ДанныеФайла, МассивДанныхДляЗанесенияВБазу);
		
КонецФункции

// Добавить ЭЦП из файла
//
Процедура ДобавитьЭЦПИзФайла(ДанныеФайла, УникальныйИдентификатор = Неопределено, ОписаниеОповещения) Экспорт
	
	РасширениеПодключено = ПодключитьРасширениеРаботыСФайлами();
	Если РасширениеПодключено Тогда
		
		ОткрытьФорму("ОбщаяФорма.ДобавлениеПодписиИзФайла",,,,,, Новый ОписаниеОповещения("ДобавитьЭЦПИзФайлаПослеОткрытияФормы", ЭтотОбъект, Новый Структура("ДанныеФайла, ОписаниеОповещения, УникальныйИдентификатор", ДанныеФайла, ОписаниеОповещения, УникальныйИдентификатор)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Возврат;
		
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = 'Для выполнения данной операции вам нужно установить расширение работы с файлами.'"));
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Ложь);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьЭЦПИзФайлаПослеОткрытияФормы(МассивФайловПодписей, ДополнительныеПараметры) Экспорт
	
	ДанныеФайла = ДополнительныеПараметры.ДанныеФайла;
	ОписаниеОповещения = ДополнительныеПараметры.ОписаниеОповещения;
	УникальныйИдентификатор = ДополнительныеПараметры.УникальныйИдентификатор;
	  		
	Если ТипЗнч(МассивФайловПодписей) <> Тип("Массив") ИЛИ МассивФайловПодписей.Количество() = 0 Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Ложь);
		Возврат;	
	КонецЕсли;
	
	МассивДанныхДляЗанесенияВБазу = ФайловыеФункцииКлиент.СформироватьПодписиДляЗанесениюВБазу(ДанныеФайла.Ссылка, МассивФайловПодписей, УникальныйИдентификатор);
	
	Если МассивДанныхДляЗанесенияВБазу.Количество() > 0 Тогда
		РаботаСФайламиКлиент.ЗанестиИнформациюОПодписях(ДанныеФайла.Ссылка, ДанныеФайла.Владелец, МассивДанныхДляЗанесенияВБазу, УникальныйИдентификатор);
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, Истина);

КонецПроцедуры

// СохранитьКак вместе с ЭЦП
//
Процедура СохранитьВместеСЭЦП(ДанныеФайла, УникальныйИдентификатор) Экспорт
	
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("СохранитьВместеСЭЦППослеПодключенияРасширения", ЭтотОбъект, Новый Структура("ДанныеФайла, УникальныйИдентификатор", ДанныеФайла, УникальныйИдентификатор)));
	
КонецПроцедуры

// Процедура - Сохранить вместе СЭЦППосле подключения расширения
//
// Параметры:
//  Подключено				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура СохранитьВместеСЭЦППослеПодключенияРасширения(Подключено, ДополнительныеПараметры) Экспорт
	
	ДанныеФайла = ДополнительныеПараметры.ДанныеФайла;
	УникальныйИдентификатор = ДополнительныеПараметры.УникальныйИдентификатор;

	РасширениеПодключено = Подключено;
	Если РасширениеПодключено Тогда
		
		ПолноеИмяФайла = РаботаСФайламиКлиент.СохранитьКак(ДанныеФайла);
		
		Если ПолноеИмяФайла = "" Тогда
			Возврат; // пользователь нажал Отмена или это веб клиент без расширения
		КонецЕсли;
		
		Настройка = ЭлектроннаяЦифроваяПодписьКлиент.ПолучитьПерсональныеНастройкиРаботыСЭЦП().ДействияПриСохраненииСЭЦП;
		
		Если Настройка = "Спрашивать" Тогда
			ПараметрыФормы = Новый Структура("Объект, УникальныйИдентификатор", ДанныеФайла.ТекущаяВерсия, УникальныйИдентификатор);
			МассивСтруктурПодписей = Неопределено;
			
			ОткрытьФорму("ОбщаяФорма.ВыборПодписей", ПараметрыФормы,,,,, Новый ОписаниеОповещения("СохранитьВместеСЭЦПЗавершение", ЭтотОбъект, Новый Структура("ДанныеФайла, Настройка, ПолноеИмяФайла, УникальныйИдентификатор", ДанныеФайла, Настройка, ПолноеИмяФайла, УникальныйИдентификатор)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			Возврат;
		ИначеЕсли Настройка = "СохранятьВсеПодписи" Тогда
			МассивСтруктурПодписей = РаботаСФайламиВызовСервера.ПолучитьВсеПодписи(ДанныеФайла.Ссылка, УникальныйИдентификатор);
		КонецЕсли;
		
		Если ТипЗнч(МассивСтруктурПодписей) = Тип("Массив") И МассивСтруктурПодписей.Количество() > 0 Тогда
			ФайловыеФункцииКлиент.СохранитьПодписи(ДанныеФайла.Ссылка, ПолноеИмяФайла, УникальныйИдентификатор, МассивСтруктурПодписей);
		КонецЕсли;
		
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = 'Для выполнения данной операции вам нужно установить расширение работы с файлами.'"));
	КонецЕсли;

КонецПроцедуры

// Процедура - Сохранить вместе СЭЦПЗавершение
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура СохранитьВместеСЭЦПЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДанныеФайла = ДополнительныеПараметры.ДанныеФайла;
	Настройка = ДополнительныеПараметры.Настройка;
	ПолноеИмяФайла = ДополнительныеПараметры.ПолноеИмяФайла;
	УникальныйИдентификатор = ДополнительныеПараметры.УникальныйИдентификатор;
	
	МассивСтруктурПодписей = Результат;
	
	Если ТипЗнч(МассивСтруктурПодписей) = Тип("Массив") И МассивСтруктурПодписей.Количество() > 0 Тогда
		ФайловыеФункцииКлиент.СохранитьПодписи(ДанныеФайла.Ссылка, ПолноеИмяФайла, УникальныйИдентификатор, МассивСтруктурПодписей);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти