
#Область ОбработчикиКомандФормы

#Область ОплатитьПлатежнойКартой

&НаКлиенте
Процедура ОплатитьПлатежнойКартой(Команда)
	
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		
		// Выбор устройства ЭТ
		МенеджерОборудованияКлиент.ВыбратьУстройство("ЭквайринговыйТерминал",
		НСтр("ru='Выберите эквайринговый терминал'"), НСтр("ru='Эквайринговый терминал не подключен'"),Новый ОписаниеОповещения("ОплатитьПлатежнойКартойПослеВыбораЭТ",ЭтотОбъект));
		
	Иначе
		ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОплатитьПлатежнойКартойПослеВыбораЭТ(ИдентификаторУстройстваЭТ, ДопПараметры) Экспорт
	
	Если ИдентификаторУстройстваЭТ <> Неопределено Тогда
		// Выбор устройства ФР
		ПоддерживаемыеТипыВО = Новый Структура("ФискальныйРегистратор, ККТ",  "ФискальныйРегистратор", "ККТ");
		МенеджерОборудованияКлиент.ВыбратьУстройство(ПоддерживаемыеТипыВО,
		НСтр("ru='Выберите фискальный регистратор'"), НСтр("ru='Фискальный регистратор не подключен'"),Новый ОписаниеОповещения("ОплатитьПлатежнойКартойПослеВыбораФР",ЭтотОбъект,ИдентификаторУстройстваЭТ));
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОплатитьПлатежнойКартойПослеВыбораФР(ИдентификаторУстройстваФР, ИдентификаторУстройстваЭТ) Экспорт
	
	ОписаниеОшибки = "";	
	СуммаОперации  = 0;
	
	Если ИдентификаторУстройстваФР <> Неопределено Тогда
		
		// Подключение устройства ЭТ
		РезультатЭТ = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
		ИдентификаторУстройстваЭТ,
		ОписаниеОшибки);
		
		Если РезультатЭТ Тогда
			// Подключение устройства ФР
			РезультатФР = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
			ИдентификаторУстройстваФР,
			ОписаниеОшибки);
			
			Если РезультатФР Тогда
				
				// Предварительно авторизуем операцию 						
				ДопПараметры = Новый Структура("ИдентификаторУстройстваЭТ, ИдентификаторУстройстваФР, СуммаОперации", ИдентификаторУстройстваЭТ, ИдентификаторУстройстваФР, СуммаОперации);
				Оповещение   = Новый ОписаниеОповещения("ПослеОплатыПлатежнойКартой", ЭтаФорма, ДопПараметры); 
				ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ФормаАвторизацииЭТ",,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Иначе
				ТекстСообщения = НСтр("ru = 'При подключении фискального регистратора произошла ошибка:
				|""%ОписаниеОшибки%"".
				|Операция по карте не была выполнена.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		Иначе
			ТекстСообщения = НСтр("ru = 'При подключении эквайрингового терминала произошла ошибка:
			|""%ОписаниеОшибки%"".
			|Операция по карте не была выполнена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеОплатыПлатежнойКартой(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ВходныеПараметры  = Новый Массив();
		ВыходныеПараметры = Неопределено;
		
		ВходныеПараметры.Добавить(Результат.Сумма);
		ВходныеПараметры.Добавить(Результат.ДанныеКарты);
		
		// Выполнение операции на ЭТ
		РезультатЭТ = МенеджерОборудованияКлиент.ВыполнитьКоманду(ДополнительныеПараметры.ИдентификаторУстройстваЭТ,
		"AuthorizeSales",
		ВходныеПараметры,
		ВыходныеПараметры);
		
		Если Не РезультатЭТ Тогда
			ТекстСообщения = НСтр("ru = 'При выполнении операции возникла ошибка:
			|""%ОписаниеОшибки%"".
			|Оплата по карте не была произведена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,
			"%ОписаниеОшибки%",
			ВыходныеПараметры[1]);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Иначе
			Если Не ПустаяСтрока(ВыходныеПараметры[3][1]) Тогда
				глПодключаемоеОборудование.Вставить("ПоследнийСлипЧек", ВыходныеПараметры[3][1]);
			КонецЕсли;
			
			НомерКарты          = ВыходныеПараметры[0];
			НомерСсылкиОперации = ВыходныеПараметры[1]; 
			НомерЧека           = "";
			СтрокаСлипЧека      = ВыходныеПараметры[3][1];
			
			Если Не ПустаяСтрока(СтрокаСлипЧека) Тогда
				ВходныеПараметры = Новый Массив();
				ВходныеПараметры.Добавить(СтрокаСлипЧека);
				ВыходныеПараметры = Неопределено;
				
				РезультатФР = МенеджерОборудованияКлиент.ВыполнитьКоманду(ДополнительныеПараметры.ИдентификаторУстройстваФР,
				"PrintText",
				ВходныеПараметры,
				ВыходныеПараметры);
			КонецЕсли;
		КонецЕсли;
		
		Если РезультатЭТ И Не РезультатФР Тогда
			ОписаниеОшибкиФР = ВыходныеПараметры[1];
			
			ВходныеПараметры  = Новый Массив();
			ВыходныеПараметры = Неопределено;
			
			ВходныеПараметры.Добавить(ДополнительныеПараметры.СуммаОперации);
			ВходныеПараметры.Добавить(НомерСсылкиОперации);
			ВходныеПараметры.Добавить(НомерЧека);
			
			// Выполнение операции на ЭТ
			МенеджерОборудованияКлиент.ВыполнитьКоманду(ДополнительныеПараметры.ИдентификаторУстройстваЭТ,
			"EmergencyVoid",
			ВходныеПараметры,
			ВыходныеПараметры);
			
			ТекстСообщения = НСтр("ru = 'При печати слип-чека возникла ошибка:
			|""%ОписаниеОшибки%"".
			|Операция по карте была отменена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,
			"%ОписаниеОшибки%",
			ОписаниеОшибкиФР);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
	// Отключение устройства ФР
	МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
	ДополнительныеПараметры.ИдентификаторУстройстваФР);
	// Отключение устройства ЭТ
	МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
	ДополнительныеПараметры.ИдентификаторУстройстваЭТ);
	
КонецПроцедуры	

#КонецОбласти

#Область ОтменитьПлатежКартой

&НаКлиенте
Процедура ОтменитьПлатежПоКарте(Команда)

	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		
		// Выбор устройства ЭТ
		МенеджерОборудованияКлиент.ВыбратьУстройство("ЭквайринговыйТерминал",
		    НСтр("ru='Выберите эквайринговый терминал'"), НСтр("ru='Эквайринговый терминал не подключен'"),Новый ОписаниеОповещения("ОтменитьПлатежПоКартеПослеВыбораЭТ",ЭтотОбъект));
	Иначе
		ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ОтменитьПлатежПоКартеПослеВыбораЭТ(ИдентификаторУстройстваЭТ,ДопПараметры) Экспорт
	
	Если ИдентификаторУстройстваЭТ <> Неопределено Тогда
		
		// Выбор устройства ФР
		ПоддерживаемыеТипыВО = Новый Структура("ФискальныйРегистратор, ККТ",  "ФискальныйРегистратор", "ККТ");
		МенеджерОборудованияКлиент.ВыбратьУстройство(ПоддерживаемыеТипыВО,
		НСтр("ru='Выберите фискальный регистратор'"), НСтр("ru='Фискальный регистратор не подключен'"),,Новый ОписаниеОповещения("ОтменитьПлатежПоКартеПослеВыбораФР",ЭтотОбъект,ИдентификаторУстройстваЭТ));
		
	КонецЕсли;
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтменитьПлатежПоКартеПослеВыбораФР(ИдентификаторУстройстваФР, ИдентификаторУстройстваЭТ) Экспорт
	
	ОписаниеОшибки            = "";
	СуммаОперации       = 0;
	
	Если ИдентификаторУстройстваФР <> Неопределено Тогда
		
		// Подключение устройства ЭТ
		РезультатЭТ = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
		ИдентификаторУстройстваЭТ,
		ОписаниеОшибки);
		
		Если РезультатЭТ Тогда
			// Подключение устройства ФР
			РезультатФР = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
			ИдентификаторУстройстваФР,
			ОписаниеОшибки);
			
			Если РезультатФР Тогда
				// Предварительно авторизуем операцию 
				ДопПараметры = Новый Структура("ИдентификаторУстройстваЭТ, ИдентификаторУстройстваФР, СуммаОперации", ИдентификаторУстройстваЭТ, ИдентификаторУстройстваФР, СуммаОперации);
				Оповещение   = Новый ОписаниеОповещения("ОтменитьПлатежПоКартеПослеОткрытияФормыАвторизацииЭТ", ЭтаФорма, ДопПараметры); 
				ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ФормаАвторизацииЭТ",,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
			Иначе
				ТекстСообщения = НСтр("ru = 'При подключении фискального регистратора произошла ошибка:
				|""%ОписаниеОшибки%"".
				|Операция по карте не была выполнена.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		Иначе
			ТекстСообщения = НСтр("ru = 'При подключении эквайрингового терминала произошла ошибка:
			|""%ОписаниеОшибки%"".
			|Операция по карте не была выполнена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПлатежПоКартеПослеОткрытияФормыАвторизацииЭТ(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ВходныеПараметры  = Новый Массив();
		ВыходныеПараметры = Неопределено;
		
		ВходныеПараметры.Добавить(Результат.Сумма);
		ВходныеПараметры.Добавить(Результат.СсылочныйНомер);
		ВходныеПараметры.Добавить(Результат.НомерЧека);
		
		// Выполнение операции на ЭТ
		РезультатЭТ = МенеджерОборудованияКлиент.ВыполнитьКоманду(ДополнительныеПараметры.ИдентификаторУстройстваЭТ,
		"AuthorizeVoid",
		ВходныеПараметры,
		ВыходныеПараметры);
		
		Если Не РезультатЭТ Тогда
			ТекстСообщения = НСтр("ru = 'При выполнении операции возникла ошибка:
			|""%ОписаниеОшибки%"".
			|Отмена по карте не была произведена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,
			"%ОписаниеОшибки%",
			ВыходныеПараметры[1]);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Иначе
			Если Не ПустаяСтрока(ВыходныеПараметры[0][1]) Тогда
				глПодключаемоеОборудование.Вставить("ПоследнийСлипЧек", ВыходныеПараметры[0][1]);
			КонецЕсли;
			
			НомерКарты          = "";
			НомерСсылкиОперации = "";
			НомерЧека           = "";
			СтрокаСлипЧека      = ВыходныеПараметры[0][1];
			
			Если Не ПустаяСтрока(СтрокаСлипЧека) Тогда
				ВходныеПараметры = Новый Массив();
				ВходныеПараметры.Добавить(СтрокаСлипЧека);
				ВыходныеПараметры = Неопределено;
				
				РезультатФР = МенеджерОборудованияКлиент.ВыполнитьКоманду(ДополнительныеПараметры.ИдентификаторУстройстваФР,
				"PrintText",
				ВходныеПараметры,
				ВыходныеПараметры);
			КонецЕсли;
		КонецЕсли;
		
		Если РезультатЭТ И Не РезультатФР Тогда
			ОписаниеОшибкиФР = ВыходныеПараметры[1];
			
			ТекстСообщения = НСтр("ru = 'При печати слип-чека возникла ошибка:
			|""%ОписаниеОшибки%"".
			|Операция по карте была отменена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,
			"%ОписаниеОшибки%",
			ОписаниеОшибкиФР);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
	// Отключение устройства ФР
	МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
	ДополнительныеПараметры.ИдентификаторУстройстваФР);
	// Отключение устройства ЭТ
	МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
	ДополнительныеПараметры.ИдентификаторУстройстваЭТ);

КонецПроцедуры	
		
#КонецОбласти

#Область ВернутьПлатежПоКарте

&НаКлиенте
Процедура ВернутьПлатежПоКарте(Команда)

	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
				
		// Выбор устройства ЭТ
		МенеджерОборудованияКлиент.ВыбратьУстройство("ЭквайринговыйТерминал",
		    НСтр("ru='Выберите эквайринговый терминал'"), НСтр("ru='Эквайринговый терминал не подключен'"),Новый ОписаниеОповещения("ВернутьПлатежПоКартеПослеВыбораЭТ",ЭтотОбъект));

	Иначе
		ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВернутьПлатежПоКартеПослеВыбораЭТ(ИдентификаторУстройстваЭТ,ДопПараметры) Экспорт
	
	Если ИдентификаторУстройстваЭТ <> Неопределено Тогда
		
		// Выбор устройства ФР
		ПоддерживаемыеТипыВО = Новый Структура("ФискальныйРегистратор, ККТ",  "ФискальныйРегистратор", "ККТ");
		МенеджерОборудованияКлиент.ВыбратьУстройство(ПоддерживаемыеТипыВО,
		НСтр("ru='Выберите фискальный регистратор'"), НСтр("ru='Фискальный регистратор не подключен'"), Новый ОписаниеОповещения("ВернутьПлатежПоКартеПослеВыбораФР",ЭтотОбъект, ИдентификаторУстройстваЭТ));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьПлатежПоКартеПослеВыбораФР(ИдентификаторУстройстваФР,ИдентификаторУстройстваЭТ) Экспорт
	
	ОписаниеОшибки = "";
	
	СуммаОперации  = 0;
	
	Если ИдентификаторУстройстваФР <> Неопределено Тогда
		// Подключение устройства ЭТ
		РезультатЭТ = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
		ИдентификаторУстройстваЭТ,
		ОписаниеОшибки);
		
		Если РезультатЭТ Тогда
			// Подключение устройства ФР
			РезультатФР = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
			ИдентификаторУстройстваФР,
			ОписаниеОшибки);
			
			Если РезультатФР Тогда
				// Предварительно авторизуем операцию 
				
				ДопПараметры = Новый Структура("ИдентификаторУстройстваЭТ, ИдентификаторУстройстваФР, СуммаОперации", ИдентификаторУстройстваЭТ, ИдентификаторУстройстваФР, СуммаОперации);
				Оповещение   = Новый ОписаниеОповещения("ПослеВозвратаПлатежаИПослеВыполненияПереавторизации", ЭтаФорма, ДопПараметры); 
				ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ФормаАвторизацииЭТ",,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
				
			Иначе
				ТекстСообщения = НСтр("ru = 'При подключении фискального регистратора произошла ошибка:
				|""%ОписаниеОшибки%"".
				|Операция по карте не была выполнена.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		Иначе
			ТекстСообщения = НСтр("ru = 'При подключении эквайрингового терминала произошла ошибка:
			|""%ОписаниеОшибки%"".
			|Операция по карте не была выполнена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

	
#КонецОбласти

#Область ВыполнитьСверкуИтогов

&НаКлиенте
Процедура ВыполнитьСверкуИтогов(Команда)

	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		
		// Выбор устройства ЭТ
		МенеджерОборудованияКлиент.ВыбратьУстройство("ЭквайринговыйТерминал",
		    НСтр("ru='Выберите эквайринговый терминал'"), НСтр("ru='Эквайринговый терминал не подключен'"), Новый ОписаниеОповещения("ВыполнитьСверкуИтоговПослеВыбораЭТ",ЭтотОбъект));
	Иначе
		ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ВыполнитьСверкуИтоговПослеВыбораЭТ(ИдентификаторУстройстваЭТ,ДопПараметры) Экспорт
	
	Если ИдентификаторУстройстваЭТ <> Неопределено Тогда
		// Выбор устройства ФР
		ПоддерживаемыеТипыВО = Новый Структура("ФискальныйРегистратор, ККТ",  "ФискальныйРегистратор", "ККТ");
		МенеджерОборудованияКлиент.ВыбратьУстройство(ПоддерживаемыеТипыВО,
		НСтр("ru='Выберите фискальный регистратор'"), НСтр("ru='Фискальный регистратор не подключен'"),Новый ОписаниеОповещения("ВыполнитьСверкуИтоговПослеВыбораФР",ЭтотОбъект,ИдентификаторУстройстваЭТ));
		
КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСверкуИтоговПослеВыбораФР(ИдентификаторУстройстваФР,ИдентификаторУстройстваЭТ) Экспорт
	
	ОписаниеОшибки = "";
	СуммаОплаты = 0;
	
	Если ИдентификаторУстройстваФР <> Неопределено Тогда
			// Подключение устройства ЭТ
			РезультатЭТ = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
			ИдентификаторУстройстваЭТ,
			ОписаниеОшибки);
			
			Если РезультатЭТ Тогда
				// Подключение устройства ФР
				РезультатФР = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
				ИдентификаторУстройстваФР,
				ОписаниеОшибки);
				
				Если РезультатФР Тогда
					ВходныеПараметры  = Неопределено;
					ВыходныеПараметры = Неопределено;
					
					// Выполнение операции на ЭТ
					РезультатЭТ = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройстваЭТ,
					"Settlement",
					ВходныеПараметры,
					ВыходныеПараметры);
					
					Если Не РезультатЭТ Тогда
						ТекстСообщения = НСтр("ru = 'При выполнении операции возникла ошибка:
						|""%ОписаниеОшибки%"".
						|Операция сверки итогов не была проведена.'");
						ТекстСообщения = СтрЗаменить(ТекстСообщения,
						"%ОписаниеОшибки%",
						ВыходныеПараметры[1]);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Иначе
						Если Не ПустаяСтрока(ВыходныеПараметры[0][1]) Тогда
							глПодключаемоеОборудование.Вставить("ПоследнийСлипЧек", ВыходныеПараметры[0][1]);
						КонецЕсли;
						
						НомерКарты          = "";
						НомерСсылкиОперации = "";
						НомерЧека           = "";
						СтрокаСлипЧека      = ВыходныеПараметры[0][1];
						
						Если Не ПустаяСтрока(СтрокаСлипЧека) Тогда
							ВходныеПараметры = Новый Массив();
							ВходныеПараметры.Добавить(СтрокаСлипЧека);
							ВыходныеПараметры = Неопределено;
							
							РезультатФР = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройстваФР,
							"PrintText",
							ВходныеПараметры,
							ВыходныеПараметры);
							Если Не РезультатФР Тогда
								ТекстСообщения = НСтр("ru = 'При печати слип-чека возникла ошибка:
								|""%ОписаниеОшибки%"".'");
								ТекстСообщения = СтрЗаменить(ТекстСообщения,
								"%ОписаниеОшибки%",
								ВыходныеПараметры[1]);
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
							КонецЕсли;
						Иначе
							ТекстСообщения = НСтр("ru = 'Операция сверки итогов успешно выполнена'");
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
						КонецЕсли;
					КонецЕсли;
					
					// Отключение устройства ФР
					МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
					ИдентификаторУстройстваФР);
					// Отключение устройства ЭТ
					МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
					ИдентификаторУстройстваЭТ);
				Иначе
					ТекстСообщения = НСтр("ru = 'При подключении фискального регистратора произошла ошибка:
					|""%ОписаниеОшибки%"".
					|Операция сверки итогов не была проведена.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;
			Иначе
				ТекстСообщения = НСтр("ru = 'При подключении эквайрингового терминала произошла ошибка:
				|""%ОписаниеОшибки%"".
				|Операция сверки итогов не была проведена.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;

КонецПроцедуры
	
#КонецОбласти


#Область ВыполнитьПреавторизацию

&НаКлиенте
Процедура ВыполнитьПреавторизацию(Команда)

	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда

		ОписаниеОшибки = "";

		СуммаОперации  = 0;

		// Выбор устройства ЭТ
		МенеджерОборудованияКлиент.ВыбратьУстройство("ЭквайринговыйТерминал",
		    НСтр("ru='Выберите эквайринговый терминал'"), НСтр("ru='Эквайринговый терминал не подключен'"), Новый ОписаниеОповещения("ВыполнитьПреавторизациюПослеВыбораЭТ",ЭтотОбъект));

	Иначе
		ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыполнитьПреавторизациюПослеВыбораЭТ(ИдентификаторУстройстваЭТ, ДопПараметры) экспорт
	
	Если ИдентификаторУстройстваЭТ <> Неопределено Тогда
		// Выбор устройства ФР
		ПоддерживаемыеТипыВО = Новый Структура("ФискальныйРегистратор, ККТ",  "ФискальныйРегистратор", "ККТ");
		МенеджерОборудованияКлиент.ВыбратьУстройство(ПоддерживаемыеТипыВО,
		НСтр("ru='Выберите фискальный регистратор'"), НСтр("ru='Фискальный регистратор не подключен'"), Новый ОписаниеОповещения("ВыполнитьПреавторизациюПослеВыбораФР",ЭтотОбъект,ИдентификаторУстройстваЭТ));
		
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ВыполнитьПреавторизациюПослеВыбораФР(ИдентификаторУстройстваФР, ИдентификаторУстройстваЭТ) экспорт
	
	ОписаниеОшибки = "";
	
	СуммаОперации = 0;
	
	Если ИдентификаторУстройстваФР <> Неопределено Тогда
		// Подключение устройства ЭТ
		РезультатЭТ = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
		ИдентификаторУстройстваЭТ,
		ОписаниеОшибки);
		
		Если РезультатЭТ Тогда
			// Подключение устройства ФР
			РезультатФР = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
			ИдентификаторУстройстваФР,
			ОписаниеОшибки);
			
			Если РезультатФР Тогда
				// Предварительно авторизуем операцию 
				ДопПараметры = Новый Структура("ИдентификаторУстройстваЭТ, ИдентификаторУстройстваФР, СуммаОперации", ИдентификаторУстройстваЭТ, ИдентификаторУстройстваФР, СуммаОперации);
				Оповещение = Новый ОписаниеОповещения("ПослеВозвратаПлатежаИПослеВыполненияПереавторизации", ЭтаФорма, ДопПараметры); 
				ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ФормаАвторизацииЭТ",,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				
			Иначе
				ТекстСообщения = НСтр("ru = 'При подключении фискального регистратора произошла ошибка:
				|""%ОписаниеОшибки%"".
				|Операция по карте не была выполнена.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		Иначе
			ТекстСообщения = НСтр("ru = 'При подключении эквайрингового терминала произошла ошибка:
			|""%ОписаниеОшибки%"".
			|Операция по карте не была выполнена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВозвратаПлатежаИПослеВыполненияПереавторизации(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ВходныеПараметры  = Новый Массив();
		ВыходныеПараметры = Неопределено;
		
		ВходныеПараметры.Добавить(Результат.Сумма);
		ВходныеПараметры.Добавить(Результат.ДанныеКарты);
		
		// Выполнение операции на ЭТ
		РезультатЭТ = МенеджерОборудованияКлиент.ВыполнитьКоманду(ДополнительныеПараметры.ИдентификаторУстройстваЭТ,
		"AuthorizePreSales",
		ВходныеПараметры,
		ВыходныеПараметры);
		
		Если Не РезультатЭТ Тогда
			ТекстСообщения = НСтр("ru = 'При выполнении операции возникла ошибка:
			|""%ОписаниеОшибки%"".
			|Преавторизация по карте не была произведена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,
			"%ОписаниеОшибки%",
			ВыходныеПараметры[1]);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Иначе
			Если Не ПустаяСтрока(ВыходныеПараметры[3][1]) Тогда
				глПодключаемоеОборудование.Вставить("ПоследнийСлипЧек", ВыходныеПараметры[3][1]);
			КонецЕсли;
			
			НомерКарты          = ВыходныеПараметры[0];
			НомерСсылкиОперации = ВыходныеПараметры[1];
			НомерЧека           = ВыходныеПараметры[2];
			СтрокаСлипЧека      = ВыходныеПараметры[3][1];
			
			Если Не ПустаяСтрока(СтрокаСлипЧека) Тогда
				ВходныеПараметры = Новый Массив();
				ВходныеПараметры.Добавить(СтрокаСлипЧека);
				ВыходныеПараметры = Неопределено;
				
				РезультатФР = МенеджерОборудованияКлиент.ВыполнитьКоманду(ДополнительныеПараметры.ИдентификаторУстройстваФР,
				"PrintText",
				ВходныеПараметры,
				ВыходныеПараметры);
			КонецЕсли;
		КонецЕсли;
		
		Если РезультатЭТ И Не РезультатФР Тогда
			ОписаниеОшибкиФР = ВыходныеПараметры[1];
			
			ВходныеПараметры  = Новый Массив();
			ВыходныеПараметры = Неопределено;
			
			ВходныеПараметры.Добавить(ДополнительныеПараметры.СуммаОперации);
			ВходныеПараметры.Добавить(НомерСсылкиОперации);
			ВходныеПараметры.Добавить(НомерЧека);
			
			// Выполнение операции на ЭТ
			МенеджерОборудованияКлиент.ВыполнитьКоманду(ДополнительныеПараметры.ИдентификаторУстройстваЭТ,
			"EmergencyVoid",
			ВходныеПараметры,
			ВыходныеПараметры);
			
			ТекстСообщения = НСтр("ru = 'При печати слип-чека возникла ошибка:
			|""%ОписаниеОшибки%"".
			|Операция по карте была отменена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,
			"%ОписаниеОшибки%",
			ОписаниеОшибкиФР);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
	// Отключение устройства ФР
	МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
	ДополнительныеПараметры.ИдентификаторУстройстваФР);
	// Отключение устройства ЭТ
	МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
	ДополнительныеПараметры.ИдентификаторУстройстваЭТ); 	
	
КонецПроцедуры	

#КонецОбласти

#Область ЗавершитьПреавторизацию

&НаКлиенте
Процедура ЗавершитьПреавторизацию(Команда)

	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		
		// Выбор устройства ЭТ
		МенеджерОборудованияКлиент.ВыбратьУстройство("ЭквайринговыйТерминал",
		    НСтр("ru='Выберите эквайринговый терминал'"), НСтр("ru='Эквайринговый терминал не подключен'"), Новый ОписаниеОповещения("ЗавершитьПреавторизациюПослеВыбораЭТ",ЭтотОбъект));

	Иначе
		ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура ЗавершитьПреавторизациюПослеВыбораЭТ(ИдентификаторУстройстваЭТ,ДопПараметры) Экспорт

	Если ИдентификаторУстройстваЭТ <> Неопределено Тогда
		// Выбор устройства ФР
		ПоддерживаемыеТипыВО = Новый Структура("ФискальныйРегистратор, ККТ",  "ФискальныйРегистратор", "ККТ");
		МенеджерОборудованияКлиент.ВыбратьУстройство(ПоддерживаемыеТипыВО,
		НСтр("ru='Выберите фискальный регистратор'"), НСтр("ru='Фискальный регистратор не подключен'"), Новый ОписаниеОповещения("ЗавершитьПреавторизациюПослеВыбораФР",ЭтотОбъект,ИдентификаторУстройстваЭТ));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПреавторизациюПослеВыбораФР(ИдентификаторУстройстваФР,ИдентификаторУстройстваЭТ) Экспорт
	
	ОписаниеОшибки            = "";
	
	СуммаОперации       = 0;

	Если ИдентификаторУстройстваФР <> Неопределено Тогда
		// Подключение устройства ЭТ
		РезультатЭТ = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
		ИдентификаторУстройстваЭТ,
		ОписаниеОшибки);
		
		Если РезультатЭТ Тогда
			// Подключение устройства ФР
			РезультатФР = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
			ИдентификаторУстройстваФР,
			ОписаниеОшибки);
			
			Если РезультатФР Тогда
				
				ДопПараметры = Новый Структура("ИдентификаторУстройстваЭТ, ИдентификаторУстройстваФР, СуммаОперации", ИдентификаторУстройстваЭТ, ИдентификаторУстройстваФР, СуммаОперации);
				Оповещение = Новый ОписаниеОповещения("ЗавершитьПреавторизациюИОтменитьПреавторизациюПослеОткрытияФормыАвторизацииЭТ", ЭтаФорма, ДопПараметры); 
				ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ФормаАвторизацииЭТ",,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				
			Иначе
				ТекстСообщения = НСтр("ru = 'При подключении фискального регистратора произошла ошибка:
				|""%ОписаниеОшибки%"".
				|Операция по карте не была выполнена.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		Иначе
			ТекстСообщения = НСтр("ru = 'При подключении эквайрингового терминала произошла ошибка:
			|""%ОписаниеОшибки%"".
			|Операция по карте не была выполнена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
		
#КонецОбласти

#Область ОтменитьПреавторизацию

&НаКлиенте
Процедура ОтменитьПреавторизацию(Команда)
	
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		
		НомерКарты          = "";
		НомерСсылкиОперации = "";
		НомерЧека           = "";
		СтрокаСлипЧека      = "";
		
		// Выбор устройства ЭТ
		МенеджерОборудованияКлиент.ВыбратьУстройство("ЭквайринговыйТерминал",
		НСтр("ru='Выберите эквайринговый терминал'"), НСтр("ru='Эквайринговый терминал не подключен'"),Новый ОписаниеОповещения("ОтменитьПреавторизациюПослеВыбораЭТ",ЭтотОбъект));
		
	Иначе
		ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтменитьПреавторизациюПослеВыбораЭТ(ИдентификаторУстройстваЭТ,ДополнительныеПараметры) Экспорт
	
	
	Если ИдентификаторУстройстваЭТ <> Неопределено Тогда
		// Выбор устройства ФР
		ПоддерживаемыеТипыВО = Новый Структура("ФискальныйРегистратор, ККТ",  "ФискальныйРегистратор", "ККТ");
		МенеджерОборудованияКлиент.ВыбратьУстройство(ПоддерживаемыеТипыВО,
		НСтр("ru='Выберите фискальный регистратор'"), НСтр("ru='Фискальный регистратор не подключен'"),Новый ОписаниеОповещения("ОтменитьПреавторизациюПослеВыбораФР",ЭтотОбъект,ИдентификаторУстройстваЭТ));
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтменитьПреавторизациюПослеВыбораФР(ИдентификаторУстройстваФР,ИдентификаторУстройстваЭТ) Экспорт
	
	ОписаниеОшибки = "";
	
	СуммаОперации  = 0;
		
	Если ИдентификаторУстройстваФР <> Неопределено Тогда
				// Подключение устройства ЭТ
				РезультатЭТ = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
				                                                                                ИдентификаторУстройстваЭТ,
				                                                                                ОписаниеОшибки);

				Если РезультатЭТ Тогда
					// Подключение устройства ФР
					РезультатФР = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
					                                                                                ИдентификаторУстройстваФР,
					                                                                                ОписаниеОшибки);

					Если РезультатФР Тогда
						// Предварительно авторизуем операцию 
						 ДопПараметры = Новый Структура("ИдентификаторУстройстваЭТ, ИдентификаторУстройстваФР, СуммаОперации", ИдентификаторУстройстваЭТ, ИдентификаторУстройстваФР, СуммаОперации);
                         Оповещение   = Новый ОписаниеОповещения("ЗавершитьПреавторизациюИОтменитьПреавторизациюПослеОткрытияФормыАвторизацииЭТ", ЭтаФорма, ДопПараметры); 
						 ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ФормаАвторизацииЭТ",,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
					Иначе
						ТекстСообщения = НСтр("ru = 'При подключении фискального регистратора произошла ошибка:
						|""%ОписаниеОшибки%"".
						|Операция по карте не была выполнена.'");
						ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					КонецЕсли;
				Иначе
					ТекстСообщения = НСтр("ru = 'При подключении эквайрингового терминала произошла ошибка:
						|""%ОписаниеОшибки%"".
						|Операция по карте не была выполнена.'");
						ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;
			КонецЕсли;
		
КонецПроцедуры
	
&НаКлиенте
Процедура ЗавершитьПреавторизациюИОтменитьПреавторизациюПослеОткрытияФормыАвторизацииЭТ(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ВходныеПараметры  = Новый Массив();
		ВыходныеПараметры = Неопределено;
		
		ВходныеПараметры.Добавить(Результат.Сумма);
		ВходныеПараметры.Добавить(Результат.ДанныеКарты);
		ВходныеПараметры.Добавить(Результат.СсылочныйНомер);
		ВходныеПараметры.Добавить(Результат.НомерЧека);
		
		// Выполнение операции на ЭТ
		РезультатЭТ = МенеджерОборудованияКлиент.ВыполнитьКоманду(ДополнительныеПараметры.ИдентификаторУстройстваЭТ,
		"AuthorizeVoidPreSales",
		ВходныеПараметры,
		ВыходныеПараметры);
		
		Если Не РезультатЭТ Тогда
			ТекстСообщения = НСтр("ru = 'При выполнении операции возникла ошибка:
			|""%ОписаниеОшибки%"".
			|Преавторизация по карте не была отменена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,
			"%ОписаниеОшибки%",
			ВыходныеПараметры[1]);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Иначе
			Если Не ПустаяСтрока(ВыходныеПараметры[0][1]) Тогда
				глПодключаемоеОборудование.Вставить("ПоследнийСлипЧек", ВыходныеПараметры[0][1]);
			КонецЕсли;
			
			НомерКарты           = "";
			НомерСсылкиОперации  = "";
			НомерЧека            = "";
			СтрокаСлипЧека       = ВыходныеПараметры[0][1];
			
			Если Не ПустаяСтрока(СтрокаСлипЧека) Тогда
				ВходныеПараметры = Новый Массив();
				ВходныеПараметры.Добавить(СтрокаСлипЧека);
				ВыходныеПараметры = Неопределено;
				
				РезультатФР = МенеджерОборудованияКлиент.ВыполнитьКоманду(ДополнительныеПараметры.ИдентификаторУстройстваФР,
				"PrintText",
				ВходныеПараметры,
				ВыходныеПараметры);
			КонецЕсли;
		КонецЕсли;
		
		Если РезультатЭТ И Не РезультатФР Тогда
			ОписаниеОшибкиФР = ВыходныеПараметры[1];
			
			ВходныеПараметры  = Новый Массив();
			ВыходныеПараметры = Неопределено;
			
			ВходныеПараметры.Добавить(ДополнительныеПараметры.СуммаОперации);
			ВходныеПараметры.Добавить(НомерСсылкиОперации);
			ВходныеПараметры.Добавить(НомерЧека);
			
			// Выполнение операции на ЭТ
			МенеджерОборудованияКлиент.ВыполнитьКоманду(ДополнительныеПараметры.ИдентификаторУстройстваЭТ,
			"EmergencyVoid",
			ВходныеПараметры,
			ВыходныеПараметры);
			
			ТекстСообщения = НСтр("ru = 'При печати слип-чека возникла ошибка:
			|""%ОписаниеОшибки%"".
			|Операция по карте была отменена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,
			"%ОписаниеОшибки%",
			ОписаниеОшибкиФР);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
	// Отключение устройства ФР
	МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
	ДополнительныеПараметры.ИдентификаторУстройстваФР);
	// Отключение устройства ЭТ
	МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
	ДополнительныеПараметры.ИдентификаторУстройстваЭТ);  	
	
КонецПроцедуры
	
#КонецОбласти

#Область НапечататьПоследнийСлипЧек

&НаКлиенте
Процедура НапечататьПоследнийСлипЧек(Команда)

	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда

		// Выбор устройства ФР
		ПоддерживаемыеТипыВО = Новый Структура("ФискальныйРегистратор, ККТ",  "ФискальныйРегистратор", "ККТ");
		МенеджерОборудованияКлиент.ВыбратьУстройство(ПоддерживаемыеТипыВО,
			НСтр("ru='Выберите фискальный регистратор'"), НСтр("ru='Фискальный регистратор не подключен'"),Новый ОписаниеОповещения("НапечататьПоследнийСлипЧекПослеВыбораФР",ЭтотОбъект));
	Иначе
		ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НапечататьПоследнийСлипЧекПослеВыбораФР(ИдентификаторУстройстваФР, ДополнительныеПараметры) Экспорт
	
	ОписаниеОшибки            = "";

	Если ИдентификаторУстройстваФР <> Неопределено Тогда
			// Подключение устройства ФР
			РезультатФР = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
			                                                                                ИдентификаторУстройстваФР,
			                                                                                ОписаниеОшибки);

			Если РезультатФР Тогда
				Если Не ПустаяСтрока(глПодключаемоеОборудование.ПоследнийСлипЧек) Тогда
					ВходныеПараметры = Новый Массив();
					ВходныеПараметры.Добавить(глПодключаемоеОборудование.ПоследнийСлипЧек);
					ВыходныеПараметры = Неопределено;

					РезультатФР = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройстваФР,
					                                                          "PrintText",
					                                                          ВходныеПараметры,
					                                                          ВыходныеПараметры);
					Если Не РезультатФР Тогда
						ТекстСообщения = НСтр("ru = 'При печати слип-чека возникла ошибка:
						|""%ОписаниеОшибки%"".'");
						ТекстСообщения = СтрЗаменить(ТекстСообщения,
						                             "%ОписаниеОшибки%",
						                             ВыходныеПараметры[1]);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					КонецЕсли;
				КонецЕсли;

				// Отключение устройства ФР
				МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
				                                                                 ИдентификаторУстройстваФР);
			Иначе
				ТекстСообщения = НСтр("ru = 'При подключении фискального регистратора произошла ошибка:
				|""%ОписаниеОшибки%"".
				|Операция по карте не была выполнена.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#КонецОбласти