
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Заголовок = НСтр("ru = 'Настройки Sphinx Reader EH'; en = 'Sphinx Reader EH settings'");
	Параметры.Свойство("Идентификатор", Идентификатор);	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии"
//
Процедура ПриОткрытии(Отказ)
	
	ОбновитьИнформациюОДрайвере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "Нажатие"
//
Процедура ШаблоныМагнитныхКартНажатие(Элемент)
	
	ОткрытьФорму("Справочник.ШаблоныМагнитныхКарт.Форма.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик события команды "ЗаписатьИЗакрыть"
//
Процедура ЗаписатьИЗакрыть(Команда)
	
	Закрыть(КодВозвратаДиалога.ОК);
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет установку драйвера
//
Процедура УстановитьДрайвер(Команда)
	
	УстановитьДрайверВК();
	ОбновитьИнформациюОДрайвере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура, выполняет определение драйвера
//
Процедура ОбновитьИнформациюОДрайвере()
	
	 WSHShell = Новый COMОбъект("WScript.Shell");
	 Попытка
		 ВК = ""+ WshShell.RegRead("HKEY_LOCAL_MACHINE\SOFTWARE\Classes\AppID\spnxreader1c.DLL\AppID");
		 Драйвер = "Установлен";
		 Версия  = "1.0.0.1";
	 Исключение
		 Драйвер = "Не установлен";
		 Версия  = "Не определена";		 
	 КонецПопытки 
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет установку драйвера оборудования
//
Процедура УстановитьДрайверВК()
	
	#Если ВебКлиент Тогда
		// ОписаниеОповещенияПослеУстановкиВнешнейКомпоненты = Новый ОписаниеОповещения("ПослеУстановкиВнешнейКомпоненты", ЭтотОбъект);
		НачатьУстановкуВнешнейКомпоненты( , "Справочник.ДрайверыОборудования.Макет.SphinxReaderEH");
	#Иначе
		
	ВременныйКаталог = КаталогВременныхФайлов();

	// Получение макета с сервера
	СсылкаНаФайл = МенеджерОборудованияВызовСервера.ПолучитьМакетССервера("SphinxReaderEH");
	Результат = ПолучитьФайл(СсылкаНаФайл, ВременныйКаталог + "Model.zip", Ложь);
	ФайлМакета = Новый ЧтениеZipФайла();
	Архив = ВременныйКаталог + "Model.zip";
	ФайлМакета.Открыть(Архив);
	ВременныйКаталог = ВременныйКаталог + "Model\";
	Для Каждого ЭлементМакета Из ФайлМакета.Элементы Цикл	
		СоздатьКаталог(ВременныйКаталог);
		ФайлМакета.Извлечь(ЭлементМакета, КаталогПрограммы());				
	КонецЦикла;
	
	Попытка
		УдалитьФайлы(Архив);
	Исключение
	КонецПопытки;		
	
	ЗапуститьПриложение("regsvr32 """+КаталогПрограммы()+"\spnxreader1c.dll""");  
	
	#КонецЕсли 
	
КонецПроцедуры

#КонецОбласти
