////////////////////////////////////////////////////////////////////////////////
// Варианты отчетов - Форма отчета (переопределяемый)
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

#Область СлужебныйПрограммныйИнтерфейс

// В данной процедуре следует описать дополнительные зависимости объектов метаданных
//   конфигурации, которые будут использоваться для связи настроек отчетов.
//
// Параметры:
//   СвязиОбъектовМетаданных (ТаблицаЗначений)
//       |- ПодчиненныйРеквизит (Строка) Имя реквизита подчиненного объекта метаданных
//       |- ПодчиненныйТип      (Тип)    Тип подчиненного объекта метаданных
//       |- ВедущийТип          (Тип)    Тип ведущего объекта метаданных
//
Процедура ДополнитьСвязиОбъектовМетаданных(СвязиОбъектовМетаданных) Экспорт
	
КонецПроцедуры

// Вызывается в одноименном обработчике формы отчета после выполнения кода формы.
//
// Параметры:
//   ЭтаФорма (УправляемаяФорма)
//   Остальные параметры передаются из параметров обработчика "как есть",
//       см. события для "УправляемаяФорма" в справке.
//
Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	ИмяОтчета = СтрЗаменить(ЭтаФорма.КлючОбъекта, "Отчет.", "");
	Попытка
		Отчеты[ИмяОтчета].ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

// Вызывается в обработчике "ПриЗагрузкеВариантаНаСервере" формы отчета до выполнения кода формы.
//
// Параметры:
//   ЭтаФорма (УправляемаяФорма)
//   Остальные параметры передаются из параметров обработчика "как есть",
//       см. события для "Расширение управляемой формы для отчета" в справке.
//
Процедура ПередЗагрузкойВариантаНаСервере(ЭтаФорма, НовыеНастройкиКД) Экспорт
	
	Отчет = ЭтаФорма.Отчет;
	ИмяОтчета = СтрЗаменить(ЭтаФорма.КлючОбъекта, "Отчет.", "");
	Попытка
		Отчеты[ИмяОтчета].ПередЗагрузкойВариантаНаСервере(ЭтаФорма, НовыеНастройкиКД);
	Исключение
	КонецПопытки; 
	
КонецПроцедуры

// Вызывается в одноименном обработчике формы отчета после выполнения кода формы.
//
// Параметры:
//   ЭтаФорма (УправляемаяФорма)
//   Остальные параметры передаются из параметров обработчика "как есть",
//       см. события для "Расширение управляемой формы для отчета" в справке.
//
Процедура ПриЗагрузкеВариантаНаСервере(ЭтаФорма, НовыеНастройкиКД) Экспорт
	
	ИмяОтчета = СтрЗаменить(ЭтаФорма.КлючОбъекта, "Отчет.", "");	
	Попытка
		Отчеты[ИмяОтчета].ПриЗагрузкеВариантаНаСервере(ЭтаФорма, НовыеНастройкиКД);
	Исключение
	КонецПопытки; 
	
КонецПроцедуры

// Вызывается в обработчике "ПриЗагрузкеПользовательскихНастроекНаСервере"
//   формы отчета до выполнения кода формы.
//
// Параметры:
//   ЭтаФорма (УправляемаяФорма)
//   Остальные параметры передаются из параметров обработчика "как есть",
//       см. события для "Расширение управляемой формы для отчета" в справке.
//
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(ЭтаФорма, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ИмяОтчета = СтрЗаменить(ЭтаФорма.КлючОбъекта, "Отчет.", "");
	Попытка
		Отчеты[ИмяОтчета].ПередЗагрузкойПользовательскихНастроекНаСервере(ЭтаФорма, НовыеПользовательскиеНастройкиКД);
	Исключение
	КонецПопытки; 
	
КонецПроцедуры

// Вызывается в одноименном обработчике формы отчета после выполнения кода формы.
//
// Параметры:
//   ЭтаФорма (УправляемаяФорма)
//   Остальные параметры передаются из параметров обработчика "как есть",
//       см. события для "Расширение управляемой формы для отчета" в справке.
//
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, НовыеПользовательскиеНастройкиКД) Экспорт
	
    ИмяОтчета = СтрЗаменить(ЭтаФорма.КлючОбъекта, "Отчет.", "");
	Попытка
		Отчеты[ИмяОтчета].ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, НовыеПользовательскиеНастройкиКД);
	Исключение
	КонецПопытки; 
	
КонецПроцедуры

// Вызывается после перезаполнения панели быстрых настроек.
//
// Параметры:
//   ЭтаФорма (УправляемаяФорма)
//
Процедура ПослеЗаполненияПанелиБыстрыхНастроек(ЭтаФорма) Экспорт
	
	ИмяОтчета = СтрЗаменить(ЭтаФорма.КлючОбъекта, "Отчет.", "");
	Попытка
		Отчеты[ИмяОтчета].ПослеЗаполненияПанелиБыстрыхНастроек(ЭтаФорма);
	Исключение
	КонецПопытки; 
	
КонецПроцедуры

// Обработчик контекстного вызова сервера.
//
// Параметры:
//   ЭтаФорма  (УправляемаяФорма)
//   Ключ      (Строка)    Ключ операции, которую необходимо выполнить в контекстном вызове.
//   Параметры (Структура) Параметры вызова сервера.
//   Результат (Структура) Результат работы сервера, возвращается на клиент.
//
Процедура КонтекстныйВызовСервера(ЭтаФорма, Ключ, Параметры, Результат) Экспорт
	
	ИмяОтчета = СтрЗаменить(ЭтаФорма.КлючОбъекта, "Отчет.", "");
	Попытка
		Отчеты[ИмяОтчета].КонтекстныйВызовСервера(ЭтаФорма, Ключ, Параметры, Результат);
	Исключение
	КонецПопытки; 
	
КонецПроцедуры

#КонецОбласти
