
#Область ОбработчикиСобытийФормы

&НаСервере
// При создании формы на сервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрЕдиницаОтбор = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтрЕдиницаОтбор, ЗначениеЗаполнено(СтрЕдиницаОтбор));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля СтрЕдиницаОтбор
//
Процедура СтрЕдиницаОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтрЕдиницаОтбор, ЗначениеЗаполнено(СтрЕдиницаОтбор));
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля КонтрагентОтбор
//
Процедура КонтрагентОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", КонтрагентОтбор, ЗначениеЗаполнено(КонтрагентОтбор));
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля Статус
//
Процедура СтатусОтборПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(СтатусОтбор) Тогда
		Если СтатусОтбор = 1 Тогда
			ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Статус", Ложь, Истина);
		Иначе
			ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Статус", Истина, Истина);
		КонецЕсли;
	Иначе	
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Статус", Ложь, Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" 
//
Процедура ВрачОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Сотрудник", ВрачОтбор, ЗначениеЗаполнено(ВрачОтбор));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Врач отбор начало выбора.
//
Процедура ВрачОтборНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	мПараметрыВыбора = Новый Структура;
	мПараметрыВыбора.Вставить("СтруктурнаяЕдиница", ЭтотОбъект.СтрЕдиницаОтбор);
	мПараметрыВыбора.Вставить("ТекущаяСтрока"     , ЭтотОбъект.ВрачОтбор);
	мПараметрыВыбора.Вставить("ОтбиратьВрачей"    , Истина); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СотрудникНачалоВыбораЗавершение", ЭтаФорма);	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", мПараметрыВыбора,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" 
//
Процедура ЛабораторияОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Лаборатория", ЛабораторияОтбор, ЗначениеЗаполнено(ЛабораторияОтбор));
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ЛабораторияОтборНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗначениеОтбора = Новый Структура;
	ЗначениеОтбора.Вставить("ТипКонтрагента", ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Лаборатория"));
	ЗначениеОтбора.Вставить("ЭтоГруппа", Ложь);
	мПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
	ФормаВыбора = ПолучитьФорму("Справочник.Контрагенты.Форма.ФормаВыбора",мПараметрыВыбора, Элемент);
	ФормаВыбора.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
// При активации строки списка
//
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Если Не Элементы.Найти("СписокОплатитьДокумент") = Неопределено Тогда 
			Элементы.СписокОплатитьДокумент.Доступность = НЕ ТекущиеДанные.ПометкаУдаления; 		
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Обработчик кнопки проведения оплаты документа
//
Процедура ОплатитьДокумент(Команда)	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;	
	Если НЕ ТекущиеДанные = Неопределено Тогда		
		Если ТекущиеДанные.Проведен Тогда		
			ПараметрыОплаты = Новый Структура;
			ПараметрыОплаты.Вставить("ДатаПродажи"                       , ТекущиеДанные.Дата);
			ПараметрыОплаты.Вставить("СтруктурнаяЕдиница"                , ТекущиеДанные.СтруктурнаяЕдиница);			
			ПараметрыОплаты.Вставить("ВидОперации"                       , ПредопределенноеЗначение("Перечисление.ВидыОпераций.Продажа"));
			ПараметрыОплаты.Вставить("Контрагент"                        , ТекущиеДанные.Контрагент);
			ПараметрыОплаты.Вставить("ДокументыПродажи"                  , ТекущиеДанные.Ссылка);
			ПараметрыОплаты.Вставить("ЗакрытьФормуАвтоматически"         , Истина);
			ОткрытьФорму("Обработка.ПомощникПроведенияОплаты.Форма.ФормаОплаты", ПараметрыОплаты,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
			
		Иначе
			ПоказатьПредупреждение(, "Предварительно необходимо провести документ!");
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ОбработкаОповещения"
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПРОВЕДЕННО_ИЗМЕНЕНИЕ_ДОКУМЕНТА_АВАНСА" Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
		   Элементы.Список.Обновить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "ВнестиНаЛицевойСчет"
//
Процедура ВнестиНаЛицевойСчет(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;	
	Если НЕ ТекущиеДанные = Неопределено Тогда		
		Если ЗначениеЗаполнено(ТекущиеДанные.Контрагент) Тогда 
			ПараметрыФормы = Новый Структура("Контрагент", ТекущиеДанные.Контрагент);
			ОткрытьФорму("Обработка.ПомощникПроведенияОплаты.Форма.ДиалогВзносаНаЛицевойСчет", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе 
			ПоказатьПредупреждение(, "В документе не указан пациент!");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура печати.
//
Процедура ДокументПечать(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "НарядЗаказ");	
	Структура.Вставить("МассивДокументов", Элементы.Список.ВыделенныеСтроки);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораДокументаПечати", ЭтотОбъект, Структура);									

	ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, ТекущийЭлемент);

КонецПроцедуры

&НаКлиенте
// Процедура - Обработка выбора документа печати
//
Процедура ОбработкаВыбораДокументаПечати(Результат, Параметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если Результат.Значение = "ПФ_MXL_ГарантийныйТалон" 
		ИЛИ Результат.Значение = "ПФ_MXL_Квитанция" Тогда
		
		 Параметры.ИмяДокумента = "Прием";
		
	КонецЕсли;
	
	УправлениеПечатьюКлиентСтоматология.ОбработкаКоманды(Результат, Параметры);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция Получить список печатных форм.
//
Функция ПолучитьСписокПечати()
	Возврат Документы.НарядЗаказ.ПолучитьСписокПечатныхФорм();	
КонецФункции

&НаКлиенте
// Процедура - Сотрудник начало выбора продолжение завершение.
//
Процедура СотрудникНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда 
		ЭтотОбъект.ВрачОтбор = Результат;
		ВрачОтборПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
