
#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура обработчик команды УдалитьИзСегмента
//
Процедура УдалитьИзСегмента(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьИзСегментаЗавершение", ЭтотОбъект), "Вы хотите удалить текущего контрагента из сегмента """ + Элементы.Список.ТекущиеДанные.Сегмент + """ ?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзСегментаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Элементы.Список.ТекущиеДанные = Неопределено ИЛИ РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьКонтрагентаИзСегмента(Элементы.Список.ТекущиеДанные.Сегмент);
	ОбновитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
// Процедура обработчик команды ДобавитьВСегмент
//
Процедура ДобавитьВСегмент(Команда)
	
	ОткрытьФорму("Справочник.СегментыКонтрагентов.ФормаВыбора",,,,,, Новый ОписаниеОповещения("ДобавитьВСегментЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры   

&НаКлиенте 
// Процедура - Добавить в сегмент завершение
//
// Параметры:
//  Результат	 - Результат Оповещения
//  Параметры	 - Параметры Оповещения
//
Процедура ДобавитьВСегментЗавершение(Результат, Параметры)  Экспорт
	
	Сегмент = Результат;
	Если Сегмент <> Неопределено Тогда
		ДобавитьКонтрагентаВСегмент(Сегмент);
		ОбновитьВидимостьЭлементов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере" ФормыЭлемента
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("Контрагент", Параметры.Контрагент);
	
	ПеречислениеТипФормированияВРучную = Перечисления.СпособыФормированияСегментов.ФормироватьВручную;
	
КонецПроцедуры

&НаСервере
// Процедура удаление контрагент из сегмента
//
// Параметры:
//		Сегмент - Сегмент, с которого удалять контрагента
//
Процедура УдалитьКонтрагентаИзСегмента(Сегмент)
	
	МенеджерЗаписи = РегистрыСведений.КонтрагентыСегмента.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Сегмент = Сегмент;
	МенеджерЗаписи.Контрагент = Параметры.Контрагент;
	
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Удалить();
	
	МенеджерЗаписи.Записать();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
// Процедура добавление контрагент в сегмент
//
// Параметры:
//		Сегмент - Сегмент, в который добавить контрагента
//
Процедура ДобавитьКонтрагентаВСегмент(Сегмент)
	
	Если Сегмент.Пустая() Или Параметры.Контрагент.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.КонтрагентыСегмента.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Сегмент = Сегмент;
	МенеджерЗаписи.Контрагент = Параметры.Контрагент;
	
	МенеджерЗаписи.Записать();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "Выбор" табличного поля.
//
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбранныеДанные = Элемент.ТекущиеДанные;
	Если ВыбранныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("Ключ", Элемент.ТекущиеДанные.Сегмент);
	ФормаСегмента = ПолучитьФорму("Справочник.СегментыКонтрагентов.ФормаОбъекта", СтруктураПараметров);
	ФормаСегмента.Открыть();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "СписокПриАктивизацииСтроки" табличного поля.
//
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
// Процедура обновляет видимость и активность элементов формы.
//
Процедура ОбновитьВидимостьЭлементов()
	
	Элементы.ДобавитьВСегмент.Доступность = Истина;
	Элементы.УдалитьИзСегмента.Доступность = Истина;
	
	Если Элементы.Список.ТекущиеДанные = Неопределено тогда
		Элементы.УдалитьИзСегмента.Доступность = Ложь;
	КонецЕсли;	
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено И Элементы.Список.ТекущиеДанные.СегментСпособФормирования <> ПеречислениеТипФормированияВРучную тогда
		Элементы.УдалитьИзСегмента.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

