

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура печати.
//
Процедура ДокументПечать(Команда)	
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "ПеремещениеЗапасов");	
	Структура.Вставить("МассивДокументов", Элементы.Список.ВыделенныеСтроки);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ДокументПечатьОбработкаВыбора", ЭтотОбъект, Структура);									

	ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, ТекущийЭлемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура печати.
//
Процедура ДокументПечатьОбработкаВыбора(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Значение = "НакладнаяНаПеремещениеПоТипуЦен" Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ВидЦен", ВидЦенПоУмолчаниюДляПечати());
		СтруктураПараметров.Вставить("Перемещение", "Перемещение");
		ПараметрыОповещения = Новый Структура("Результат, Параметры", Результат, Параметры);
		ОткрытьФорму("ОбщаяФорма.ФормаЦены", СтруктураПараметров,,,,, Новый ОписаниеОповещения("ОбработкаВыборФорматаЦены", ЭтотОбъект, ПараметрыОповещения), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
					
	Иначе
		УправлениеПечатьюКлиентСтоматология.ОбработкаКоманды(Результат, Параметры);	
	КонецЕсли;
		
КонецПроцедуры

// Функция, получается вид цен
// 
&НаСервереБезКонтекста
Функция ВидЦенПоУмолчаниюДляПечати()
	Возврат Справочники.ВидыЦен.Закупочная;
КонецФункции

// Процедура - обработчик выбора формата цены для печати накладной по типу цен
//
&НаКлиенте
Процедура ОбработкаВыборФорматаЦены(Результат, ПереданныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Результат = КодВозвратаДиалога.Отмена Тогда 
		
		МассивДляПараметров = Новый Массив;
		МассивДляПараметров.Добавить(ПереданныеПараметры.Параметры.МассивДокументов);
		МассивДляПараметров.Добавить(Результат.ВидЦен);	
		ПереданныеПараметры.Параметры.МассивДокументов = МассивДляПараметров;
		
		УправлениеПечатьюКлиентСтоматология.ОбработкаКоманды(ПереданныеПараметры.Результат, ПереданныеПараметры.Параметры);
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
// Функция Получить список печатных форм.
//
Функция ПолучитьСписокПечати()                           	
	Возврат Документы.ПеремещениеЗапасов.ПолучитьСписокПечатныхФорм();	
КонецФункции

#КонецОбласти