
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("МассивДанныхФискальныхОпераций") Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементМ Из Параметры.МассивДанныхФискальныхОпераций Цикл
		НоваяСтрока = ТаблицаФискальныхОпераций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМ, "ИдентификаторЗаписи, ДанныеФискальнойОперации");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМ.ДанныеФискальнойОперации, "ОплатаПредоплата, ОплатаНаличные, ОплатаЭлектронно, ОплатаПостоплата, Сумма, НомерЧекаККМ, ЧекКоррекции");
		НоваяСтрока.Текст = ПолучитьПредставлениеЧека(ЭлементМ.ДанныеФискальнойОперации.ДанныеXML);
		Для Каждого ЭлементУчтенныеАвансы Из ЭлементМ.ДанныеФискальнойОперации.МассивУчтенныеАвансы Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаУчтенныеАвансы.Добавить(), ЭлементУчтенныеАвансы);
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - обработчик события "ПриАктивизацииСтроки".
//
Процедура ТаблицаФискальныхОперацийПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаФискальныхОпераций.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	
	ЭтотОбъект.Текст = ТекущаяСтрока.Текст;
	Элементы.ТаблицаУчтенныеАвансы.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторЗаписи", ТекущаяСтрока.ИдентификаторЗаписи);
	
КонецПроцедуры

&НаСервере
// Форматирует текст сообщения в формате XML.
//
Функция ФорматироватьXMLСПараметрами(ТекстСообщенияXML, ПараметрыФорматирования)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстСообщенияXML);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку(ПараметрыФорматирования);
	
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(ДокументDOM, ЗаписьXML);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

// Функция получает представление чека.
//
Функция ПолучитьПредставлениеЧека(ДанныеXML)
	
	ТекстСообщенияXML = ДанныеXML.Получить();
	Если ЗначениеЗаполнено(ТекстСообщенияXML) Тогда 
		ПараметрыФорматирования = Новый ПараметрыЗаписиXML("UTF-8", "1.0", Истина, Истина, "  ");
		ЭтотОбъект.ТекстXML.УстановитьТекст(ФорматироватьXMLСПараметрами(ТекстСообщенияXML, ПараметрыФорматирования));
		ОбщиеПараметры = МенеджерОборудованияВызовСервера.ЗагрузитьДанныеФискализацииИзXML(ТекстСообщенияXML);
		Возврат МенеджерОборудованияКлиентСервер.СформироватьТекстНефискальногоДокумента(0, ОбщиеПараметры, 46);		
	Иначе
		Возврат "";
	КонецЕсли;  
	
КонецФункции

&НаКлиенте
// Процедура - обработчик команды "ВыбратьФискальнуюОперацию".
//
Процедура ВыбратьФискальнуюОперацию(Команда)
	
	ТекущаяСтрока = Элементы.ТаблицаФискальныхОпераций.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ЧекКоррекции)  Тогда      			
		ТекстСообщения = НСтр("ru = 'По данному документу ранее была создана корректировка документом %1. 
		|Создание повторной корректировки не возможно.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
		ТекущаяСтрока.ЧекКоррекции);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения); 			
		Возврат;
	КонецЕсли;

	Закрыть(Новый Структура("ИдентификаторЗаписи, ДанныеФискальнойОперации", ТекущаяСтрока.ИдентификаторЗаписи, ТекущаяСтрока.ДанныеФискальнойОперации));
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "Выбор".
//
Процедура ТаблицаФискальныхОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьФискальнуюОперацию("");
	
КонецПроцедуры

#КонецОбласти