
#Область СлужебныеПроцедурыИФункции

// Получить текущие задачи для пользователя. Если не указать пользователя, берется пользователь
// текущего сеанса
Функция ПолучитьТекущиеЗадачиПользователяПоВремени(Пользователь = Неопределено, СтруктурнаяЕдиница = Неопределено) Экспорт
	
	Возврат Задачи.ЗадачаПользователей.ПолучитьТекущиеЗадачиДляПользователяПоВремени(Пользователь, СтруктурнаяЕдиница);

КонецФункции

// Функция, очищает устаревшие оповещения.
//
Процедура ОчиститьУстаревшиеОповещенияКлиента() Экспорт
	
	РегистрыСведений.ОповещениеМониторингКлиента.ОчиститьУстаревшиеОповещенияКлиента();

КонецПроцедуры

// Процедура, завершает оповещение клиента.
//
Процедура ЗавершитьОповещениеКлиента(ОбъектОповещения, СтруктурнаяЕдиница = Неопределено, Ключ) Экспорт
	
	РегистрыСведений.ОповещениеМониторингКлиента.ЗавершитьОповещениеКлиента(ОбъектОповещения, СтруктурнаяЕдиница, Ключ);

КонецПроцедуры

// Получить текущие задачи для пользователя по клиенту.
//
Функция ПолучитьТекущиеЗадачиПользователяПоПосещениюКлиента(Клиент, Пользователь = Неопределено, СтруктурнаяЕдиница = Неопределено) Экспорт
	
	Возврат Задачи.ЗадачаПользователей.ПолучитьТекущиеЗадачиДляПользователяПоПосещениюКлиента(Клиент, Пользователь, СтруктурнаяЕдиница);

КонецФункции

// Функция, получает текущие задачи для текущего пользователя.
//
Функция ПолучитьАктивныеОповещенияКлиента() Экспорт
	
	Возврат РегистрыСведений.ОповещениеМониторингКлиента.ПолучитьАктивныеОповещенияКлиента();

КонецФункции

// Функция возвращает значение по умолчанию для передаваемого пользователя и настройки.
//
// Параметры:
//  Пользователь       - текущий пользователь программы
//  Настройка          - признак, для которого возвращается значение по умолчанию
//  СтруктурнаяЕдиница - структурная единца.
//
// Возвращаемое значение:
//  Значение по умолчанию для настройки.
//
Функция ПолучитьЗначениеПоУмолчаниюПользователя(Знач Пользователь = Неопределено, Настройка, Знач СтруктурнаяЕдиница = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь"      , Пользователь);
	Запрос.УстановитьПараметр("Настройка"         , ПланыВидовХарактеристик.НастройкиПользователей[Настройка]);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РегистрЗначениеПрав.Значение
	               |ИЗ
	               |	РегистрСведений.НастройкиПользователей КАК РегистрЗначениеПрав
	               |ГДЕ
	               |	РегистрЗначениеПрав.Пользователь = &Пользователь
	               |	И РегистрЗначениеПрав.Настройка = &Настройка
	               |	И РегистрЗначениеПрав.СтруктурнаяЕдиница = &СтруктурнаяЕдиница";

	Выборка = Запрос.Выполнить().Выбрать();

	ПустоеЗначение = ПланыВидовХарактеристик.НастройкиПользователей[Настройка].ТипЗначения.ПривестиЗначение();

	Если Выборка.Количество() = 0 Тогда
		
		Возврат ПустоеЗначение;

	ИначеЕсли Выборка.Следующий() Тогда

		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Возврат ПустоеЗначение;
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;

	Иначе
		Возврат ПустоеЗначение;

	КонецЕсли;

КонецФункции // ПолучитьЗначениеПоУмолчаниюПользователя()

// Функция возвращает значение цвета по умолчанию для настройки и структурной единицы.
//
// Параметры:
//  Настройка          - признак, для которого возвращается значение по умолчанию
//  СтруктурнаяЕдиница - структурная единца.
//
// Возвращаемое значение:
//  Значение по умолчанию для настройки.
//
Функция ПолучитьЗначениеЦветаПоУмолчанию(Настройка, Знач СтруктурнаяЕдиница = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Настройка"         , ПланыВидовХарактеристик.НастройкиПользователей[Настройка]);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РегистрЗначениеПрав.Значение
	               |ИЗ
	               |	РегистрСведений.НастройкиПользователей КАК РегистрЗначениеПрав
	               |ГДЕ
	               |	РегистрЗначениеПрав.Настройка = &Настройка
	               |	И РегистрЗначениеПрав.СтруктурнаяЕдиница = &СтруктурнаяЕдиница";

	Выборка = Запрос.Выполнить().Выбрать();
	
	ПустоеЗначение = ПланыВидовХарактеристик.НастройкиПользователей[Настройка].ТипЗначения.ПривестиЗначение();

	Если Выборка.Количество() = 0 Тогда
		
		Возврат ПустоеЗначение;

	ИначеЕсли Выборка.Следующий() Тогда

		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Возврат ПустоеЗначение;
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;

	Иначе
		Возврат ПустоеЗначение;

	КонецЕсли;
	

КонецФункции
		
// Функция возвращает значение по умолчанию для передаваемого пользователя и настройки.
//
// Параметры:
//  Пользователь       - текущий пользователь программы
//  Настройка          - признак, для которого возвращается значение по умолчанию
//  СтруктурнаяЕдиница - структурная единца.
//
// Возвращаемое значение:
//  Значение по умолчанию для настройки.
//
Функция УстановитьЗначениеПоУмолчаниюПользователя(Знач Пользователь = Неопределено, Настройка, Знач СтруктурнаяЕдиница = Неопределено, Значение) Экспорт

	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь"      , Пользователь);
	Запрос.УстановитьПараметр("Настройка"         , ПланыВидовХарактеристик.НастройкиПользователей[Настройка]);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РегистрЗначениеПрав.Значение
	               |ИЗ
	               |	РегистрСведений.НастройкиПользователей КАК РегистрЗначениеПрав
	               |ГДЕ
	               |	РегистрЗначениеПрав.Пользователь = &Пользователь
	               |	И РегистрЗначениеПрав.Настройка = &Настройка
	               |	И РегистрЗначениеПрав.СтруктурнаяЕдиница = &СтруктурнаяЕдиница";

	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗаписьРегистра = РегистрыСведений.НастройкиПользователей.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Пользователь = Пользователь;
	ЗаписьРегистра.Настройка = ПланыВидовХарактеристик.НастройкиПользователей[Настройка];
	ЗаписьРегистра.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
	ЗаписьРегистра.Значение = Значение;
	ЗаписьРегистра.Записать();

КонецФункции // ПолучитьЗначениеПоУмолчаниюПользователя()

// Функция устанавливает значение цвета по умолчанию для настройки и структурной единицы.
//
// Параметры:
//  Настройка          - признак, для которого возвращается значение по умолчанию
//  СтруктурнаяЕдиница - структурная единца.
//
// Возвращаемое значение:
//  Значение по умолчанию для настройки.
//
Процедура УстановитьЗначениеЦветаПоУмолчанию(Настройка, Знач СтруктурнаяЕдиница = Неопределено, Значение) Экспорт

	Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	Набор = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
	Набор.Отбор.Настройка.Установить(ПланыВидовХарактеристик.НастройкиПользователей[Настройка]);
	Набор.Отбор.СтруктурнаяЕдиница.Установить(СтруктурнаяЕдиница);
	Набор.Прочитать(); 
	
	Для Каждого Запись Из Набор Цикл
		
		Запись.Значение 	= Значение;
		Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь; 
		
	КонецЦикла;
	
	Если Набор.Модифицированность() Тогда
		
		Набор.Записать();
		
	Иначе
		
		ЗаписьРегистра 						= РегистрыСведений.НастройкиПользователей.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Пользователь 		= ПараметрыСеанса.ТекущийПользователь;
		ЗаписьРегистра.Настройка 			= ПланыВидовХарактеристик.НастройкиПользователей[Настройка];
		ЗаписьРегистра.СтруктурнаяЕдиница 	= СтруктурнаяЕдиница;
		ЗаписьРегистра.Значение 			= Значение;
		ЗаписьРегистра.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает булево значение права текущего пользователя
//
Функция ПолучитьБулевоЗначениеПраваПользователя(Право, ЗначениеПоУмолчанию = Неопределено, Пользователь = Неопределено) Экспорт
	
	Список = ПользователиСтоматология.ПолучитьЗначенияПравПользователя(Право, Пользователь);
	
	Если Список.Количество() = 0 Тогда 
		Возврат ЗначениеПоУмолчанию;
	ИначеЕсли Список.Количество() > 1 И Список.Найти(Истина) <> Неопределено Тогда
		Возврат Истина;
	Иначе
		Возврат Список[0];
	КонецЕсли;
	
КонецФункции // ПолучитьЗначениеПраваПользователя()

// Функция возвращает список значений права, установленных для пользователя.
// Если количество значений меньше количество доступных ролей, то возвращается значение по умолчанию
//
// Параметры:
//  Право               - право, для которого определяются значения
//  ЗначениеПоУмолчанию - значение по умолчанию для передаваемого права (возвращается в случае
//                        отсутствия значений в регистре сведений)
//
// Возвращаемое значение:
//  Список всех значений, установленных наборам прав (ролям), доступных пользователю
//
Функция ПолучитьЗначенияПравПользователя(Право, Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	РегистрЗначениеПрав.Значение
	               |ИЗ
	               |	РегистрСведений.ЗначенияДополнительныхПравПользователя КАК РегистрЗначениеПрав
	               |ГДЕ
	               |	РегистрЗначениеПрав.Право = &ПравоПользователя
	               |	И РегистрЗначениеПрав.Пользователь В
	               |			(ВЫБРАТЬ
	               |				ПользователиГруппы.Ссылка КАК Ссылка
	               |			ИЗ
	               |				Справочник.ГруппыПользователей.Состав КАК ПользователиГруппы
	               |			ГДЕ
	               |				ПользователиГруппы.Пользователь = &Пользователь
	               |		
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |			ВЫБРАТЬ
	               |				ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)
	               |		
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |			ВЫБРАТЬ
	               |				&Пользователь)";
	Запрос.УстановитьПараметр("Пользователь"     , Пользователь);
	Запрос.УстановитьПараметр("ПравоПользователя", Право);				   
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат.ВыгрузитьКолонку("Значение");

КонецФункции // ПолучитьЗначенияПользователя()

// Функция возвращает значение выбранного права, установленного для пользователя.
// Если количество значений меньше количество доступных ролей, то возвращается значение по умолчанию
//
// Параметры:
//  Право               - право, для которого определяются значения
//
// Возвращаемое значение:
//  Булево значение, установленное в настройке дополнитеьных прав пользователя.
//
Функция ПолучитьЗначениеПраваПользователя(Настройка, Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Право = ПланыВидовХарактеристик.ПраваПользователей[Настройка];
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	РегистрЗначениеПрав.Значение
	               |ИЗ
	               |	РегистрСведений.ЗначенияДополнительныхПравПользователя КАК РегистрЗначениеПрав
	               |ГДЕ
	               |	РегистрЗначениеПрав.Право = &ПравоПользователя
	               |	И РегистрЗначениеПрав.Пользователь В
	               |			(ВЫБРАТЬ
	               |				ПользователиГруппы.Ссылка КАК Ссылка
	               |			ИЗ
	               |				Справочник.ГруппыПользователей.Состав КАК ПользователиГруппы
	               |			ГДЕ
	               |				ПользователиГруппы.Пользователь = &Пользователь
	               |		
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |			ВЫБРАТЬ
	               |				ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)
	               |		
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |			ВЫБРАТЬ
	               |				&Пользователь)";
	Запрос.УстановитьПараметр("Пользователь"     , Пользователь);
	Запрос.УстановитьПараметр("ПравоПользователя", Право);				   
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПустоеЗначение = ПланыВидовХарактеристик.ПраваПользователей[Настройка].ТипЗначения.ПривестиЗначение();

	Если Выборка.Количество() = 0 Тогда
		Возврат ПустоеЗначение;
	ИначеЕсли Выборка.Следующий() Тогда
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Возврат ПустоеЗначение;
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;
	Иначе
		Возврат ПустоеЗначение;
	КонецЕсли;
	
КонецФункции

// Процедура, определяет пользователя, под которым запущен сеанс и пытается
// найти соответсвие ему в справочнике Пользователи. Если соответствие
// не найдено - создается новый элемент. Параметр сеанса ТекущийПользователь
// устанавливается как ссылка на найденный (созданный) элемент справочника.
//
Процедура ОпределитьТекущегоПользователя(Знач ИмяПараметра, УстановленныеПараметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ИмяПараметра <> "ТекущийПользователь" И ИмяПараметра <> "ТекущийВнешнийПользователь" Тогда
		Возврат;
	КонецЕсли;
	
	ПользовательНеНайден = Ложь;
	СоздатьПользователя  = Ложь;
	
	Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() = 0 Тогда
		ПараметрыСеанса.ТекущийПользователь        = Справочники.Пользователи.ПустаяСсылка();
		ПараметрыСеанса.ТекущийВнешнийПользователь = Справочники.ВнешниеПользователи.ПустаяСсылка();
	Иначе
		ИдентификаторПользователяИБ = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
		
		Запрос = Новый Запрос;
		Запрос.Параметры.Вставить("ИдентификаторПользователяИБ ", ИдентификаторПользователяИБ);
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ";
		РезультатПользователи = Запрос.Выполнить();
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВнешниеПользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВнешниеПользователи КАК ВнешниеПользователи
		|ГДЕ
		|	ВнешниеПользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ";
		РезультатВнешниеПользователи = Запрос.Выполнить();
		
		Если НЕ РезультатВнешниеПользователи.Пустой() Тогда
			
			Выборка = РезультатВнешниеПользователи.Выбрать();
			Выборка.Следующий();
			ПараметрыСеанса.ТекущийПользователь        = Справочники.Пользователи.ПустаяСсылка();
			ПараметрыСеанса.ТекущийВнешнийПользователь = Выборка.Ссылка;
			
			Если НЕ ВнешниеПользователи.ИспользоватьВнешнихПользователей() Тогда
			
				ТекстСообщенияОбОшибке = НСтр("ru = 'Внешние пользователи отключены!'");
				ВызватьИсключение ТекстСообщенияОбОшибке;
			КонецЕсли;
		Иначе
			ПараметрыСеанса.ТекущийВнешнийПользователь = Справочники.ВнешниеПользователи.ПустаяСсылка();
			
			Если РезультатПользователи.Пустой() Тогда
				Если ЭтоПолноправныйПользовательИБ() Тогда
					
					ТекущийПользователь         = ПользователиИнформационнойБазы.ТекущийПользователь();
					ИмяПользователя             = ТекущийПользователь.Имя;
					ПолноеИмяПользователя       = ТекущийПользователь.ПолноеИмя;
					ИдентификаторПользователяИБ = ТекущийПользователь.УникальныйИдентификатор;
					ПользовательПоНаименованию  = СсылкаПользователяПоПолномуНаименованию(ПолноеИмяПользователя);
					
					Если ПользовательПоНаименованию = Неопределено Тогда
						ПользовательНеНайден = Истина;
						СоздатьПользователя  = Истина;
					Иначе
						ПараметрыСеанса.ТекущийПользователь = ПользовательПоНаименованию;
					КонецЕсли;
				Иначе
					ПользовательНеНайден = Истина;
				КонецЕсли;
			Иначе
				Выборка = РезультатПользователи.Выбрать();
				Выборка.Следующий();
				ПараметрыСеанса.ТекущийПользователь = Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	УстановленныеПараметры.Добавить(ИмяПараметра);
	
КонецПроцедуры

// Функция выполняет получение ссылки пользователя
//
Функция СсылкаПользователяПоПолномуНаименованию(ПолноеИмя)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.Пользователи КАК Пользователи
					|ГДЕ
					|	Пользователи.Наименование = &ПолноеИмя";
	Запрос.УстановитьПараметр("ПолноеИмя", ПолноеИмя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Пользователь = Выборка.Ссылка;
	
	Если ПользовательИБНеЗанят(Пользователь.ИдентификаторПользователяИБ) Тогда
		Возврат Пользователь;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Функция ЭтоПолноправныйПользовательИБ проверяет,
// является ли полноправным текущий пользователь ИБ или
// пользователь ИБ заданного пользователя (обычного или внешнего).
//
//  Полноправными считается:
// а) пользователь ИБ при пустом списке пользователей ИБ,
//    если основная роль не задана или ПолныеПрава,
// б) пользователь ИБ с ролью ПолныеПрава.
//
//
// Параметры:
//  Пользователь - Неопределено (проверяется текущий пользователь ИБ),
//                 Справочник.Пользователи, Справочник.ВнешниеПользователи
//                 (осуществляется поиск пользователя ИБ по уникальному
//                  идентификатору, заданному в реквизите ИдентификаторПользователяИБ,
//                  если пользователь ИБ не найден, возвращается Ложь).
//
// Возвращаемое значение:
//  Булево.
//
Функция ЭтоПолноправныйПользовательИБ(Пользователь = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(Пользователь) И Пользователь <> АвторизованныйПользователь() Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Пользователь, "ИдентификаторПользователяИБ"));
		Если ПользовательИБ = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	КонецЕсли;
	
	Если ПользовательИБ.УникальныйИдентификатор = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор Тогда
		
		Если ЗначениеЗаполнено(ПользовательИБ.Имя) Тогда
			
			Возврат РольДоступна("ПолныеПрава");
		Иначе
			// Если Метаданные.ОсновнаяРоль = Неопределено ИЛИ
			//	 Метаданные.ОсновнаяРоль = Метаданные.Роли.ПолныеПрава Тогда
			//	
			//	Возврат Истина;
			// Иначе
			//	Возврат Ложь;
			// КонецЕсли;
			
			// Авторизован пустой пользователь - список пользователей пуст,
			// если основная роль пустая - все права разрешены.
			Если Метаданные.ОсновныеРоли.Количество() = 0 ИЛИ
				(Метаданные.ОсновныеРоли.Количество() > 0 и Метаданные.ОсновныеРоли[0] = Метаданные.Роли.ПолныеПрава) Тогда
				Возврат Истина;
			Иначе
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Возврат ПользовательИБ.Роли.Содержит(Метаданные.Роли.ПолныеПрава);
	КонецЕсли;
	
КонецФункции

// Функция выполняет проверку занятости пользователя
//
Функция ПользовательИБНеЗанят(знач ИмяПользователя) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);
	
	Если ПользовательИБ = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПользовательПоИдентификаторуСуществует(ПользовательИБ.УникальныйИдентификатор) Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли
	
КонецФункции

// Функция АвторизованныйПользователь возвращает
// текущего пользователя сеанса.
// 
// Возвращаемое значение:
//  СправочникСсылка.Пользователи, СправочникСсылка.ВнешниеПользователи.
// 
Функция АвторизованныйПользователь() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Возврат ?(ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь), ПараметрыСеанса.ТекущийПользователь, ПараметрыСеанса.ТекущийВнешнийПользователь);
	Исключение
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

// Функция выполняет проверку существования пользователя по идентификатору
//
Функция ПользовательПоИдентификаторуСуществует(УникальныйИдентификатор, СсылкаНаТекущего = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИСТИНА КАК ЗначениеИстина
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.ИдентификаторПользователяИБ = &УникальныйИдентификатор
	               |	И Пользователи.Ссылка <> &СсылкаНаТекущего
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ 
	               |	ИСТИНА
	               |ИЗ
	               |	Справочник.ВнешниеПользователи КАК ВнешниеПользователи
	               |ГДЕ
	               |	ВнешниеПользователи.ИдентификаторПользователяИБ = &УникальныйИдентификатор
	               |	И ВнешниеПользователи.Ссылка <> &СсылкаНаТекущего";
	Запрос.УстановитьПараметр("СсылкаНаТекущего", СсылкаНаТекущего);
	Запрос.УстановитьПараметр("УникальныйИдентификатор", УникальныйИдентификатор);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

// Функция ПрочитатьПользователяИБ считывает свойства пользователя
// информационной базы по строковому или уникальному идентификатору.
//
// Параметры:
//  Идентификатор - Неопределено, Строка, УникальныйИдентификатор (идентификатор пользователя).
//  Свойства     - Структура:
//                 ПользовательИнфБазыУникальныйИдентификатор   - УникальныйИдентификатор
//                 ПользовательИнфБазыИмя                       - Строка
//                 ПользовательИнфБазыПолноеИмя                 - Строка
//
//                 ПользовательИнфБазыАутентификацияСтандартная - Булево
//                 ПользовательИнфБазыПоказыватьВСпискеВыбора   - Булево
//                 ПользовательИнфБазыПароль                    - Неопределено
//                 ПользовательИнфБазыСохраняемоеЗначениеПароля - Строка
//                 ПользовательИнфБазыПарольУстановлен          - Булево
//                 ПользовательИнфБазыЗапрещеноИзменятьПароль   - Булево
//
//                 ПользовательИнфБазыАутентификацияОС          - Булево
//                 ПользовательИнфБазыПользовательОС            - Строка
//
//                 ПользовательИнфБазыОсновнойИнтерфейс         - Строка (имя интерфейса из коллекции
//																			Метаданные.Интерфейсы)
//                 ПользовательИнфБазыРежимЗапуска              - Строка (значения: "Авто",
//																			"ОбычноеПриложение", "УправляемоеПриложение")
//                 ПользовательИнфБазыЯзык                      - Строка (имя языка из коллекции Метаданные.Языки)
//
//  Роли           - Массив значений типа Строка (имена ролей из коллекции Метаданные.Роли)
//  
//  ОписаниеОшибки - Строка, содержит описание ошибки, если чтение не удалось.
//
// Возвращаемое значение:
//  Булево,
//  если Истина - успех, иначе отказ, см. ОписаниеОшибки.
//
Функция ПрочитатьПользователяИБ(Знач Идентификатор, Свойства = Неопределено, Роли = Неопределено, ОписаниеОшибки = "", ПользовательИБ = Неопределено) Экспорт
	
	// Подготовка структур возвращаемых данных
	Свойства = Новый Структура;
	Свойства.Вставить("ПользовательИнфБазыУникальныйИдентификатор",   Новый УникальныйИдентификатор);
	Свойства.Вставить("ПользовательИнфБазыИмя",                       "");
	Свойства.Вставить("ПользовательИнфБазыПолноеИмя",                 "");
	Свойства.Вставить("ПользовательИнфБазыАутентификацияСтандартная", Ложь);
	Свойства.Вставить("ПользовательИнфБазыПоказыватьВСпискеВыбора",   Ложь);
	Свойства.Вставить("ПользовательИнфБазыПароль",                    Неопределено);
	Свойства.Вставить("ПользовательИнфБазыСохраняемоеЗначениеПароля", "");
	Свойства.Вставить("ПользовательИнфБазыПарольУстановлен",          Ложь);
	Свойства.Вставить("ПользовательИнфБазыЗапрещеноИзменятьПароль",   Ложь);
	Свойства.Вставить("ПользовательИнфБазыАутентификацияОС",          Ложь);
	Свойства.Вставить("ПользовательИнфБазыПользовательОС",            "");
	Свойства.Вставить("ПользовательИнфБазыОсновнойИнтерфейс",         ?(Метаданные.ОсновнойИнтерфейс = Неопределено, "", Метаданные.ОсновнойИнтерфейс.Имя));
	Свойства.Вставить("ПользовательИнфБазыРежимЗапуска",              "Авто");
	Свойства.Вставить("ПользовательИнфБазыЯзык",                      ?(Метаданные.ОсновнойЯзык = Неопределено, "", Метаданные.ОсновнойЯзык.Имя));
	
	Роли = Новый Массив;
	
	Если ТипЗнч(Идентификатор) = Тип("УникальныйИдентификатор") Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Идентификатор);
	ИначеЕсли ТипЗнч(Идентификатор) = Тип("Строка") Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Идентификатор);
	Иначе
		ПользовательИБ = Неопределено;
	КонецЕсли;
	
	Если ПользовательИБ = Неопределено Тогда
		ОписаниеОшибки = СтрЗаменить(НСтр("ru = 'Пользователь информационной базы ""%1""' не найден!"), "%1", Идентификатор);
		Возврат Ложь;
	КонецЕсли;
	
	Свойства.ПользовательИнфБазыУникальныйИдентификатор     = ПользовательИБ.УникальныйИдентификатор;
	Свойства.ПользовательИнфБазыИмя                         = ПользовательИБ.Имя;
	Свойства.ПользовательИнфБазыПолноеИмя                   = ПользовательИБ.ПолноеИмя;
	Свойства.ПользовательИнфБазыАутентификацияСтандартная   = ПользовательИБ.АутентификацияСтандартная;
	Свойства.ПользовательИнфБазыПоказыватьВСпискеВыбора     = ПользовательИБ.ПоказыватьВСпискеВыбора;
	Свойства.ПользовательИнфБазыСохраняемоеЗначениеПароля   = ПользовательИБ.СохраняемоеЗначениеПароля;
	Свойства.ПользовательИнфБазыПарольУстановлен            = ПользовательИБ.ПарольУстановлен;
	Свойства.ПользовательИнфБазыЗапрещеноИзменятьПароль     = ПользовательИБ.ЗапрещеноИзменятьПароль;
	Свойства.ПользовательИнфБазыАутентификацияОС            = ПользовательИБ.АутентификацияОС;
	Свойства.ПользовательИнфБазыПользовательОС              = ПользовательИБ.ПользовательОС;
	Свойства.ПользовательИнфБазыОсновнойИнтерфейс           = ?(ПользовательИБ.ОсновнойИнтерфейс = Неопределено, "", ПользовательИБ.ОсновнойИнтерфейс.Имя);
	Свойства.ПользовательИнфБазыРежимЗапуска                = ?(ПользовательИБ.РежимЗапуска = РежимЗапускаКлиентскогоПриложения.ОбычноеПриложение,
	                                                            "ОбычноеПриложение",
	                                                            ?(ПользовательИБ.РежимЗапуска = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение,
	                                                              "УправляемоеПриложение",
	                                                              "Авто"));
	Свойства.ПользовательИнфБазыЯзык                        = ?(ПользовательИБ.Язык = Неопределено, "", ПользовательИБ.Язык.Имя);
	
	Для каждого Роль Из ПользовательИБ.Роли Цикл
		Роли.Добавить(Роль.Имя);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Функция ЗаписатьПользователяИБ
// либо перезаписывает свойства пользователяИБ,
//      найденного по строковому или уникальному идентификатору,
// либо создает нового пользователяИБ, когда задано создать,
//      при этому, если пользовательИБ найден будет ошибка
//
// Параметры:
//  Идентификатор - Строка, УникальныйИдентификатор (идентификатор пользователя).
//  НовыеСвойства - Структура (свойство может быть не указано,
//                            тогда используется прочитанное или начальное значение)
//                 ПользовательИнфБазыИмя                       - Неопределено, Строка
//                 ПользовательИнфБазыПолноеИмя                 - Неопределено, Строка
//
//                 ПользовательИнфБазыАутентификацияСтандартная - Неопределено, Булево
//                 ПользовательИнфБазыПоказыватьВСпискеВыбора   - Неопределено, Булево
//                 ПользовательИнфБазыПароль                    - Неопределено, Строка
//                 ПользовательИнфБазыСохраняемоеЗначениеПароля - Неопределено, Строка
//                 ПользовательИнфБазыПарольУстановлен          - Неопределено, Булево
//                 ПользовательИнфБазыЗапрещеноИзменятьПароль   - Неопределено, Булево
//
//                 ПользовательИнфБазыАутентификацияОС          - Неопределено, Булево
//                 ПользовательИнфБазыПользовательОС            - Неопределено, Строка
//
//                 ПользовательИнфБазыОсновнойИнтерфейс         - Неопределено, Строка (имя интерфейса из коллекции
//																					Метаданные.Интерфейсы)
//                 ПользовательИнфБазыРежимЗапуска              - Неопределено, Строка (значения: "Авто",
//																					"ОбычноеПриложение", "УправляемоеПриложение")
//                 ПользовательИнфБазыЯзык                      - Неопределено, Строка (имя языка из коллекции
//																					Метаданные.Языки)
//
//  НовыеРоли      - Неопределено, Массив значений типа Строка (имена ролей из коллекции Метаданные.Роли)
//
//  ОписаниеОшибки - Строка, содержит описание ошибки, если чтение не удалось.
//
// Возвращаемое значение:
//  Булево,
//  если Истина - успех, иначе отказ, см. ОписаниеОшибки.
//
Функция ЗаписатьПользователяИБ(Знач Идентификатор, Знач НовыеСвойства, Знач НовыеРоли, Знач СоздатьНового = Ложь, ОписаниеОшибки = "") Экспорт
	
	ПользовательИБ = Неопределено;
	СтарыеСвойства = Неопределено;
	СтарыеРоли     = Неопределено;
	Свойства       = Неопределено;
	Роли           = Неопределено;
	
	ПредварительноеЧтение = ПрочитатьПользователяИБ(Идентификатор, СтарыеСвойства, СтарыеРоли, ОписаниеОшибки);
	
	Если НЕ ПрочитатьПользователяИБ(Идентификатор, Свойства, Роли, ОписаниеОшибки, ПользовательИБ) ИЛИ НЕ ПредварительноеЧтение Тогда
		
		Если СоздатьНового Тогда
			ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		Иначе
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли СоздатьНового Тогда
		ОписаниеОшибки = СтрЗаменить(НСтр("ru = 'Невозможно создать пользователя информационной базы ""%1""
		                                        |так как он уже существует!'"), "%1", Идентификатор);
		Возврат Ложь;
	КонецЕсли;
	
	// Подготовка новых значений свойств
	Для каждого КлючИЗначение Из Свойства Цикл
		Если НовыеСвойства.Свойство(КлючИЗначение.Ключ) И НовыеСвойства[КлючИЗначение.Ключ] <> Неопределено Тогда
			Свойства[КлючИЗначение.Ключ] = НовыеСвойства[КлючИЗначение.Ключ];
		КонецЕсли;
	КонецЦикла;
	
	Если НовыеРоли <> Неопределено Тогда
		Роли = НовыеРоли;
	КонецЕсли;
	
	// Установка новых значений свойств
	
	ПользовательИБ.Имя                         = Свойства.ПользовательИнфБазыИмя;
	ПользовательИБ.ПолноеИмя                   = Свойства.ПользовательИнфБазыПолноеИмя;
	ПользовательИБ.АутентификацияСтандартная   = Свойства.ПользовательИнфБазыАутентификацияСтандартная;
	ПользовательИБ.ПоказыватьВСпискеВыбора     = Свойства.ПользовательИнфБазыПоказыватьВСпискеВыбора;
	Если Свойства.ПользовательИнфБазыПароль <> Неопределено Тогда
		ПользовательИБ.Пароль                  = Свойства.ПользовательИнфБазыПароль;
	КонецЕсли;
	ПользовательИБ.ЗапрещеноИзменятьПароль     = Свойства.ПользовательИнфБазыЗапрещеноИзменятьПароль;
	ПользовательИБ.АутентификацияОС            = Свойства.ПользовательИнфБазыАутентификацияОС;
	ПользовательИБ.ПользовательОС              = Свойства.ПользовательИнфБазыПользовательОС;
	Если ЗначениеЗаполнено(Свойства.ПользовательИнфБазыОсновнойИнтерфейс) Тогда
	    ПользовательИБ.ОсновнойИнтерфейс       = Метаданные.Интерфейсы[Свойства.ПользовательИнфБазыОсновнойИнтерфейс];
	Иначе
	    ПользовательИБ.ОсновнойИнтерфейс       = Неопределено;
	КонецЕсли;
	Если ЗначениеЗаполнено(Свойства.ПользовательИнфБазыРежимЗапуска) Тогда
	    ПользовательИБ.РежимЗапуска            = РежимЗапускаКлиентскогоПриложения[Свойства.ПользовательИнфБазыРежимЗапуска];
	КонецЕсли;
	Если ЗначениеЗаполнено(Свойства.ПользовательИнфБазыЯзык) Тогда
	    ПользовательИБ.Язык                    = Метаданные.Языки[Свойства.ПользовательИнфБазыЯзык];
	Иначе
	    ПользовательИБ.Язык                    = Неопределено;
	КонецЕсли;
	
	ПользовательИБ.Роли.Очистить();
	Для каждого Роль Из Роли Цикл
		Если Не Метаданные.Роли.Найти(Роль)= Неопределено Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли[Роль]);   
		КонецЕсли;
	КонецЦикла;
	
	// Добавление роли ПолныеПрава, при попытке создать первого пользователя с пустым списком ролей
	Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() = 0 И
	     НЕ ПользовательИБ.Роли.Содержит(Метаданные.Роли.ПолныеПрава) Тогда
		
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
	КонецЕсли;
	
	// Попытка записи нового или измененного пользователяИБ
	Попытка
		ПользовательИБ.Записать();
		НовыеСвойства.ПользовательИнфБазыУникальныйИдентификатор = ПользовательИБ.УникальныйИдентификатор;
	Исключение
		ОписаниеОшибки = НСтр("ru = 'Ошибка при записи пользователя информационной базы:'") + Символы.ПС + ИнформацияОбОшибке().Причина.Описание;
		Возврат Ложь;
	КонецПопытки;
	
	ПользователиПереопределяемый.ПриЗаписиПользователяИнформационнойБазы(СтарыеСвойства, Свойства);
	
	Возврат Истина;
	
КонецФункции

// Функция - Создать служебного пользователя APIДля сотрудника
//
// Параметры:
//  Пользователь1с	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьСлужебногоПользователяAPIДляСотрудника(Пользователь1с) Экспорт
	
	СоздатьСлужебногоПользователяИСотрудника(Пользователь1с);

КонецФункции

// Функция, создает пользователя информационной базы и заполняет сотрудника.
//
Функция СоздатьСлужебногоПользователяИСотрудника(Пользователь1с = Неопределено)
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ПарольСлужебногоПользователя = СгенерироватьСлучайныйПароль();
	
	НачатьТранзакцию();
	
	Попытка
		
		мПользователь 								= ПользователиИнформационнойБазы.СоздатьПользователя();
		мПользователь.Имя       					= "ServiceUserAPI";
		мПользователь.ПолноеИмя 					= "Служебный пользователь API (не удалять!)";
		мПользователь.АутентификацияОС 				= Ложь;
		мПользователь.АутентификацияСтандартная 	= Истина;
		мПользователь.ЗапрещеноИзменятьПароль 		= Истина;
		мПользователь.ПоказыватьВСпискеВыбора 		= Ложь;
		мПользователь.Пароль 				     	= ПарольСлужебногоПользователя;
		мПользователь.Роли.Добавить(Метаданные.Роли.ЗапускВнешнегоСоединения);
		мПользователь.Роли.Добавить(Метаданные.Роли.УдаленныйДоступВнешнееПриложение);
		мПользователь.Записать();
		
		Пользователь1с 								= Справочники.Пользователи.СоздатьЭлемент();
		Пользователь1с.Наименование 				= "Служебный пользователь API (не удалять!)";
		Пользователь1с.ИдентификаторПользователяИБ 	= Новый УникальныйИдентификатор(мПользователь.УникальныйИдентификатор);
		Пользователь1с.Служебный    				= Истина;
		Пользователь1с.Записать();
		
		ЗафиксироватьТранзакцию();
		
		Возврат Пользователь1с.Ссылка;
		
	Исключение
		ОтменитьТранзакцию();	
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции

// Функция - Сгенерировать случайный пароль
// 
// Возвращаемое значение:
//   - 
//
Функция СгенерироватьСлучайныйПароль()
	
	МинимальнаяДлинаПароля = 30;	
	ПараметрыПароля = ПользователиСлужебный.ПараметрыПароля(МинимальнаяДлинаПароля, Истина);
	
	Возврат ПользователиСлужебный.СоздатьПароль(ПараметрыПароля);
		
КонецФункции

// Функция - Служебного пользователя API
// 
// Возвращаемое значение:
//   - 
//
Функция СлужебныйПользовательAPI() Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	мПользователь = ПользователиИнформационнойБазы.НайтиПоИмени("ServiceUserAPI");
	
	Если мПользователь <> Неопределено Тогда
		СлужебныйПользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", мПользователь.УникальныйИдентификатор);
		Возврат СлужебныйПользователь;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Функция - Создать служебного пользователя API
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьСлужебногоПользователяAPI() Экспорт
	
	Возврат СоздатьСлужебногоПользователяИСотрудника();
	
КонецФункции

// Функция - Получить пользователя по уникальному идентифкатору
//
// Параметры:
//  УидПользователя	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПользователяПоУникальномуИдентификатору(УидПользователя) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПользовательСистемный = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(УидПользователя);
		
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ПользовательСистемный;
	
КонецФункции

// Функция - Установить новый случайный пароль служебному пользователю API
// 
// Возвращаемое значение:
//   - 
//
Функция УстановитьНовыйСлучайныйПарольСлужебномуПользователюAPI(ИдентификаторПользователяИБ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	мПользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
	
	ПарольСлужебногоПользователя = СгенерироватьСлучайныйПароль();

	мПользователь.Пароль = ПарольСлужебногоПользователя;
	мПользователь.Роли.Очистить();
	мПользователь.Роли.Добавить(Метаданные.Роли.ЗапускВнешнегоСоединения);
	мПользователь.Роли.Добавить(Метаданные.Роли.УдаленныйДоступВнешнееПриложение);						
	мПользователь.Записать();

	ЛичныйКабинет.ЗаписатьРеквизитВДанныеРегистрационнойАнкеты("ПарольServiceUserAPI", ПарольСлужебногоПользователя);
	
	Возврат ПарольСлужебногоПользователя;
	
КонецФункции

// Получить текущие задачи для пользователя. Если не указать пользователя, берется пользователь
// текущего сеанса
Процедура ПеревестиОповещениеКлиентаНа10Сек(ОбъектОповещения, СтруктурнаяЕдиница = Неопределено, Ключ) Экспорт
	
	РегистрыСведений.ОповещениеМониторингКлиента.ПеревестиОповещениеКлиентаНа10Сек(ОбъектОповещения, СтруктурнаяЕдиница, Ключ);

КонецПроцедуры 

#КонецОбласти