
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	ЗащитаПерсональныхДанных.ДобавитьКомандуПечатиСогласияНаОбработкуПерсональныхДанных(КомандыПечати);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов                   

// СтандартныеПодсистемы.ШаблоныСообщений

// Вызывается при подготовке шаблонов сообщений и позволяет переопределить список реквизитов и вложений.
//
// Параметры:
//  Реквизиты               - ДеревоЗначений - список реквизитов шаблона.
//         ** Имя            - Строка - Уникальное имя общего реквизита.
//         ** Представление  - Строка - Представление общего реквизита.
//         ** Тип            - Тип    - Тип реквизита. По умолчанию строка.
//         ** Формат         - Строка - Формат вывода значения для чисел, дат, строк и булевых значений.
//  Вложения                - ТаблицаЗначений - печатные формы и вложения
//         ** Имя            - Строка - Уникальное имя вложения.
//         ** Представление  - Строка - Представление варианта.
//         ** ТипФайла       - Строка - Тип вложения, который соответствует расширению файла: "pdf", "png", "jpg", mxl"
//                                      и др.
//  ДополнительныеПараметры - Структура - дополнительные сведения о шаблоне сообщений.
//
Процедура ПриПодготовкеШаблонаСообщения(Реквизиты, Вложения, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

// Вызывается в момент создания сообщений по шаблону для заполнения значений реквизитов и вложений.
//
// Параметры:
//  Сообщение - Структура - структура с ключами:
//    * ЗначенияРеквизитов - Соответствие - список используемых в шаблоне реквизитов.
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * ЗначенияОбщихРеквизитов - Соответствие - список используемых в шаблоне общих реквизитов.
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * Вложения - Соответствие - значения реквизитов 
//      ** Ключ     - Строка - имя вложения в шаблоне;
//      ** Значение - ДвоичныеДанные, Строка - двоичные данные или адрес во временном хранилище вложения.
//  ПредметСообщения - ЛюбаяСсылка - ссылка на объект являющийся источником данных.
//  ДополнительныеПараметры - Структура -  Дополнительная информация о шаблоне сообщения.
//
Процедура ПриФормированииСообщения(Сообщение, ПредметСообщения, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

// Заполняет список получателей SMS при отправке сообщения сформированного по шаблону.
//
// Параметры:
//   Получатели - ТаблицаЗначений - список получателей .
//     * НомерТелефона - Строка - номер телефона, куда будет отправлено сообщение SMS;
//     * Представление - Строка - представление получателя сообщения SMS;
//     * Контакт       - Произвольный - контакт, которому принадлежит номер телефона.
//  ПредметСообщения - ЛюбаяСсылка - ссылка на объект, являющийся источником данных.
//                   - Структура  - структура описывающая параметры шаблона:
//    * Предмет               - ЛюбаяСсылка - ссылка на объект, являющийся источником данных;
//    * ВидСообщения - Строка - вид формируемого сообщения: "ЭлектроннаяПочта" или "СообщениеSMS";
//    * ПроизвольныеПараметры - Соответствие - заполненный список произвольных параметров;
//    * ОтправитьСразу - Булево - признак мгновенной отправки;
//    * ПараметрыСообщения - Структура - Дополнительные параметры сообщения.
//
Процедура ПриЗаполненииТелефоновПолучателейВСообщении(Получатели, ПредметСообщения) Экспорт
	
КонецПроцедуры

// Заполняет список получателей почты при отправке сообщения сформированного по шаблону.
//
// Параметры:
//   ПолучателиПисьма - ТаблицаЗначений - список получается письма.
//     * Адрес           - Строка - адрес электронной почты получателя;
//     * Представление   - Строка - представление получателя письма;
//     * Контакт         - Произвольный - контакт, которому принадлежит адрес электронной почты.
//  ПредметСообщения - ЛюбаяСсылка - ссылка на объект, являющийся источником данных.
//                   - Структура  - структура описывающая параметры шаблона:
//    * Предмет               - ЛюбаяСсылка - ссылка на объект, являющийся источником данных;
//    * ВидСообщения - Строка - вид формируемого сообщения: "ЭлектроннаяПочта" или "СообщениеSMS";
//    * ПроизвольныеПараметры - Соответствие - заполненный список произвольных параметров;
//    * ОтправитьСразу - Булево - признак мгновенной отправки письма;
//    * ПараметрыСообщения - Структура - Дополнительные параметры сообщения;
//    * ПреобразовыватьHTMLДляФорматированногоДокумента - Булево - признак преобразование HTML текста
//             сообщения содержащего картинки в тексте письма из-за особенностей вывода изображений
//             в форматированном документе;
//    * УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты - учетная запись для отправки письма.
//
Процедура ПриЗаполненииПочтыПолучателейВСообщении(ПолучателиПисьма, ПредметСообщения) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ШаблоныСообщений

#КонецОбласти

// Процедура, обработчик события "ОбработкаПолученияФормы"
//
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Параметры.Свойство("ЗначенияЗаполнения") 
			И Параметры.ЗначенияЗаполнения.Свойство("ТипКонтрагента") 
			И ТипЗнч(Параметры.ЗначенияЗаполнения.ТипКонтрагента) = Тип("ФиксированныйМассив")
			И Параметры.ЗначенияЗаполнения.ТипКонтрагента[0] = Перечисления.ТипыКонтрагентов.Клиенты Тогда
			
			ВыбраннаяФорма = "ФормаЭлементаКлиенты";
			
		ИначеЕсли Параметры.Свойство("ЗначенияЗаполнения") 
			И Параметры.ЗначенияЗаполнения.Свойство("ТипКонтрагента") 
			И НЕ Параметры.ЗначенияЗаполнения.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты Тогда
			
			ВыбраннаяФорма = "ФормаЭлемента";
			
		ИначеЕсли Параметры.Свойство("ЗначенияЗаполнения") И Параметры.ЗначенияЗаполнения.Свойство("Родитель") Тогда  
			Если НЕ Параметры.ЗначенияЗаполнения.Родитель.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты Тогда // Новый Элемент
				
				ВыбраннаяФорма = "ФормаЭлемента";
				
			ИначеЕсли Параметры.ЗначенияЗаполнения.Родитель.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты Тогда
				
				ВыбраннаяФорма = "ФормаЭлементаКлиенты";
				
			КонецЕсли;
		ИначеЕсли Параметры.Свойство("Ключ") Тогда // Существующий элемент
			
			// Статус = РегистрыСведений.СтатусыКонтрагентов.ПолучитьСтатусКлиента(Параметры.Ключ);
			Если Параметры.Ключ.Родитель.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты Тогда
				ВыбраннаяФорма = "ФормаЭлементаКлиенты"; 
			Иначе
				ВыбраннаяФорма = "ФормаЭлемента";
			КонецЕсли;
			
		ИначеЕсли Параметры.Свойство("ЗначениеКопирования")	Тогда
			Если Параметры.ЗначениеКопирования.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты Тогда
				ВыбраннаяФорма = "ФормаЭлементаКлиенты";		
			Иначе
				ВыбраннаяФорма = "ФормаЭлемента";	
			КонецЕсли;	
			
		Иначе
			ВыбраннаяФорма = "ФормаЭлементаКлиенты";
		КонецЕсли;
		
	ИначеЕсли ВидФормы = "ФормаВыбора" Тогда 
		
		// СтандартнаяОбработка = Ложь;
		// ВыбраннаяФорма = "ФормаВыбора";
		
	КонецЕсли;
	
КонецПроцедуры

// Функция создает папки справочника по умолчанию.
//
Процедура ЗаполнитьПоУмолчанию() Экспорт
	
	// Создаем группы элементов в справочнике "Контрагенты"
	ИскомыйЭлемент = Справочники.Контрагенты.НайтиПоНаименованию("Пациенты",Истина, Справочники.Контрагенты.ПустаяСсылка());
	Если ИскомыйЭлемент.Пустая() Тогда
		Клиенты                = Справочники.Контрагенты.СоздатьГруппу();
		Клиенты.Наименование   = "Пациенты";
		Клиенты.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты; 
		Клиенты.Автокоррекция  = 1;
		Клиенты.Записать();
	КонецЕсли;
	
	ИскомыйЭлемент = Справочники.Контрагенты.НайтиПоНаименованию("Поставщики",Истина, Справочники.Контрагенты.ПустаяСсылка());
	Если ИскомыйЭлемент.Пустая() Тогда
		Поставщики                = Справочники.Контрагенты.СоздатьГруппу();
		Поставщики.Наименование   = "Поставщики";
		Поставщики.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Поставщик;
		Поставщики.Записать();
	КонецЕсли;
	
	ИскомыйЭлемент = Справочники.Контрагенты.НайтиПоНаименованию("Страховые компании",Истина, Справочники.Контрагенты.ПустаяСсылка());
	Если ИскомыйЭлемент.Пустая() Тогда
		Страховые                 = Справочники.Контрагенты.СоздатьГруппу();
		Страховые.Наименование    = "Страховые компании";
		Страховые.ТипКонтрагента  = Перечисления.ТипыКонтрагентов.СтраховаяКомпания;
		Страховые.Записать();
	КонецЕсли;

КонецПроцедуры

// Функция определяет значения реквизитов выбранного контрагента.
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - Ссылка на контрагента
//
// Возвращаемое значение:
//	Структура - реквизиты выбранного контрагента
//
Функция ПолучитьРеквизитыКонтрагента(Контрагент) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Контрагенты.Наименование КАК Наименование,
	|	ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК Строка(1000)) КАК НаименованиеПолное,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	Контрагенты.КодПоОКПО КАК КодПоОКПО,
	|	Контрагенты.ЮрФизЛицо КАК ЮрФизЛицо,
	|	Контрагенты.ЗаконныйПредставитель.Наименование КАК ЗаконныйПредставитель
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент
	|");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Представление = Выборка.Наименование;
		Наименование = ?(Не ПустаяСтрока(Выборка.НаименованиеПолное), Выборка.НаименованиеПолное, Выборка.Наименование);
		ИНН = Выборка.ИНН;
		КПП = Выборка.КПП;
		КодПоОКПО = Выборка.КодПоОКПО;
		ЮрФизЛицо = Выборка.ЮрФизЛицо;
		ЗаконныйПредставитель = ?(ЗначениеЗаполнено(Выборка.ЗаконныйПредставитель), Выборка.ЗаконныйПредставитель, "") ;
	Иначе
		Представление = "";
		Наименование = "";
		ИНН = "";
		КПП = "";
		КодПоОКПО = "";
		ЮрФизЛицо = Перечисления.ЮрФизЛицо.ПустаяСсылка();
		ЗаконныйПредставитель = "";
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура("Представление, Наименование, ИНН, КПП, КодПоОКПО, ЮрФизЛицо, ЗаконныйПредставитель",
		Представление,
		Наименование,
		ИНН,
		КПП,
		КодПоОКПО,
		ЮрФизЛицо,
		ЗаконныйПредставитель
	);
	
	Возврат СтруктураРеквизитов;

КонецФункции // ПолучитьРеквизитыКонтрагента()

// Возвращает список реквизитов, которые разрешается редактировать
// с помощью обработки группового изменения объектов.
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	РедактируемыеРеквизиты = Новый Массив;
	
	// РедактируемыеРеквизиты.Добавить("СчетУчетаРасчетовСПокупателем");
	// РедактируемыеРеквизиты.Добавить("СчетУчетаАвансовПокупателя");
	// РедактируемыеРеквизиты.Добавить("СчетУчетаРасчетовСПоставщиком");
	// РедактируемыеРеквизиты.Добавить("СчетУчетаАвансовПоставщику");
	
	// РедактируемыеРеквизиты.Добавить("БанковскийСчетПоУмолчанию");
	РедактируемыеРеквизиты.Добавить("ДатаРегистрации");
	РедактируемыеРеквизиты.Добавить("ИсточникИнформации");
	РедактируемыеРеквизиты.Добавить("КлиентИсточникИнформации");
	РедактируемыеРеквизиты.Добавить("Комментарий");
	РедактируемыеРеквизиты.Добавить("НеУчаствоватьВРассылкеEmail");
	РедактируемыеРеквизиты.Добавить("НеУчаствоватьВРассылкеСообщений");	
	РедактируемыеРеквизиты.Добавить("СтруктурнаяЕдиница");
	РедактируемыеРеквизиты.Добавить("Куратор");
	РедактируемыеРеквизиты.Добавить("СоциальныйСтатус");
		
	Возврат РедактируемыеРеквизиты;
	
КонецФункции

// Функция проверяет на дубликат контрагента.
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - Ссылка на контрагента
//
// Возвращаемое значение:
//	Структура - реквизиты выбранного контрагента
//
Функция ПроверитьНаДублированиеКлиентаПоля(Контрагент, Поля) Экспорт
		
	МассивПолейДляПроверки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Поля, ";");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка <> &КонтрагентИсключение";
	Запрос.УстановитьПараметр("КонтрагентИсключение", Контрагент.Ссылка);
	Для Каждого ЭлементМассива Из МассивПолейДляПроверки Цикл
		Запрос.Текст = Запрос.Текст + "
			|	И Контрагенты." + ЭлементМассива + " = &" + ЭлементМассива;
		Запрос.УстановитьПараметр(ЭлементМассива, Контрагент[ЭлементМассива]);
	КонецЦикла;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции // ПроверитьНаДублированиеКлиента()

// Функция проверяет на дубликат контрагента по контактной информации.
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - Ссылка на контрагента
//
// Возвращаемое значение:
//	Структура - реквизиты выбранного контрагента
//
Функция ПроверитьНаДублированиеКлиентаКИ(Контрагент, ТипКИ, ЗначениеЭлемента) Экспорт
		
	Если НЕ ЗначениеЗаполнено(ЗначениеЭлемента) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда 
		// Уберём лишние символы из номера
		СтроковоеЗначение = УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(ЗначениеЭлемента);
		Если НЕ ЗначениеЗаполнено(СтроковоеЗначение) Тогда 
			Возврат Неопределено;
		КонецЕсли;
		Если СтрДлина(СтроковоеЗначение) = 11 Тогда
			РегиональныеНастройкиСЕ = Справочники.СтруктурныеЕдиницы.ВернутьРегиональныеНастройки();
			СтраныУчета = РегиональныеНастройкиСЕ.СтранаУчета;
			Если ЗначениеЗаполнено(СтраныУчета) Тогда 
				КодСтраныУчета = СтраныУчета.Код;
				Если ЗначениеЗаполнено(КодСтраныУчета) Тогда 
					Если КодСтраныУчета = "643" Тогда 
						Формат1 = "7" + Прав(СтроковоеЗначение, 10);
						Формат2 = "8" + Прав(СтроковоеЗначение, 10);
						Запрос.Текст = "ВЫБРАТЬ
						               |	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
						               |ИЗ
						               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
						               |ГДЕ
						               |	КонтрагентыКонтактнаяИнформация.Тип = &ТипЭлемента
						               |	И (КонтрагентыКонтактнаяИнформация.НомерТелефона ПОДОБНО &ЗначениеЭлементаФормат1
						               |			ИЛИ КонтрагентыКонтактнаяИнформация.НомерТелефона ПОДОБНО &ЗначениеЭлементаФормат2)
						               |	И КонтрагентыКонтактнаяИнформация.Ссылка <> &КонтрагентИсключение";
						
						Запрос.УстановитьПараметр("КонтрагентИсключение"	, Контрагент);
						Запрос.УстановитьПараметр("ТипЭлемента"				, ТипКИ);
						Запрос.УстановитьПараметр("ЗначениеЭлементаФормат1"	, Формат1);
						Запрос.УстановитьПараметр("ЗначениеЭлементаФормат2"	, Формат2);
						
						Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
						
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
		Запрос.Текст = "ВЫБРАТЬ
		               |	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		               |ГДЕ
		               |	КонтрагентыКонтактнаяИнформация.Тип = &ТипЭлемента
		               |	И КонтрагентыКонтактнаяИнформация.НомерТелефона ПОДОБНО &ЗначениеЭлемента
		               |	И КонтрагентыКонтактнаяИнформация.Ссылка <> &КонтрагентИсключение";
		
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда 
		СтроковоеЗначение = ЗначениеЭлемента;
		Запрос.Текст = "ВЫБРАТЬ
		               |	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		               |ГДЕ
		               |	КонтрагентыКонтактнаяИнформация.Тип = &ТипЭлемента
		               |	И КонтрагентыКонтактнаяИнформация.Представление ПОДОБНО &ЗначениеЭлемента
		               |	И КонтрагентыКонтактнаяИнформация.Ссылка <> &КонтрагентИсключение";
		
	Иначе
		Возврат Неопределено;	
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("КонтрагентИсключение"	, Контрагент);
	Запрос.УстановитьПараметр("ТипЭлемента"				, ТипКИ);
	Запрос.УстановитьПараметр("ЗначениеЭлемента"		, СтроковоеЗначение);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции // ПроверитьНаДублированиеКлиентаКИ()

// Функция, выполняющая отбор клиентов по заданным условиям
//
Функция ВернутьВсехКлиентовУчавствующихВРассылке() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Получатель,
		|	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКлиента)
		|	И КонтрагентыКонтактнаяИнформация.НомерТелефона <> """"
		|	И КонтрагентыКонтактнаяИнформация.Ссылка.ЭтоГруппа = ЛОЖЬ
		|	И КонтрагентыКонтактнаяИнформация.Ссылка.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты)
		|	И КонтрагентыКонтактнаяИнформация.Ссылка.НеУчаствоватьВРассылкеСообщений = ЛОЖЬ
		|	И НЕ КонтрагентыКонтактнаяИнформация.Ссылка.ПометкаУдаления";
		
	Таблица = Запрос.Выполнить().Выгрузить();
	МассивПолучателей 		= Таблица.ВыгрузитьКолонку("Получатель");
	МассивНомеровТелефонов 	= Таблица.ВыгрузитьКолонку("НомерТелефона");
	МассивНомеровИПолучателей = Новый Массив(2);
	МассивНомеровИПолучателей[0] = МассивПолучателей;
	МассивНомеровИПолучателей[1] = МассивНомеровТелефонов;
	Возврат МассивНомеровИПолучателей;
	
КонецФункции

// Функция, выполняющая првоерку на необходимость информирования менеджера о дне рождения контрагента
//
Функция ПроверитьНеобходимостьИнформированияПоДнюРожденияКонтрагента(Контрагент, Знач ТекущаяДата = Неопределено) Экспорт
	
	Результат = Новый Структура("Информировать, СообщениеИнформирования", Ложь, "");
	
	Если ТекущаяДата = Неопределено Тогда
		ТекущаяДата = ТекущаяДата();
	КонецЕсли;
	
	Если Контрагент.ДатаРожденияКлиента = Дата(1,1,1) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Месяц(ТекущаяДата - 2*24*60*60) = Месяц(Контрагент.ДатаРожденияКлиента)
			И День(ТекущаяДата - 2*24*60*60) = День(Контрагент.ДатаРожденияКлиента) Тогда
		Результат.Информировать = Истина;
		Результат.СообщениеИнформирования = "У пациента позавчера был день рождения!";
	ИначеЕсли Месяц(ТекущаяДата - 1*24*60*60) = Месяц(Контрагент.ДатаРожденияКлиента)
			И День(ТекущаяДата - 1*24*60*60) = День(Контрагент.ДатаРожденияКлиента) Тогда
		Результат.Информировать = Истина;
		Результат.СообщениеИнформирования = "У пациента вчера был день рождения!";
	ИначеЕсли Месяц(ТекущаяДата) = Месяц(Контрагент.ДатаРожденияКлиента)
			И День(ТекущаяДата) = День(Контрагент.ДатаРожденияКлиента) Тогда
		Результат.Информировать = Истина;
		Результат.СообщениеИнформирования = "У пациента сегодня день рождения!";
	ИначеЕсли Месяц(ТекущаяДата + 1*24*60*60) = Месяц(Контрагент.ДатаРожденияКлиента)
			И День(ТекущаяДата + 1*24*60*60) = День(Контрагент.ДатаРожденияКлиента) Тогда
		Результат.Информировать = Истина;
		Результат.СообщениеИнформирования = "У пациента завтра день рождения!";
	ИначеЕсли Месяц(ТекущаяДата + 2*24*60*60) = Месяц(Контрагент.ДатаРожденияКлиента)
			И День(ТекущаяДата + 2*24*60*60) = День(Контрагент.ДатаРожденияКлиента) Тогда
		Результат.Информировать = Истина;
		Результат.СообщениеИнформирования = "У пациента послезавтра день рождения!";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Добавление телефонного номера клиенту через форму
Процедура ДобавитьНомерТелефона(ФормаКлиента,НомерТелефона)Экспорт
	
    Элемент = ФормаКлиента.Элементы["__КИ_Поле1"];
	
	Отбор = Новый Структура("ИмяРеквизита", Элемент.Имя);
    СтрДанные = ФормаКлиента.__КИ_ОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);

	ЗначенияПолей = Новый СписокЗначений;
	ЗначенияПолей.Добавить("",     "КодСтраны");
	ЗначенияПолей.Добавить("",     "КодГорода");
	ЗначенияПолей.Добавить(НомерТелефона, "НомерТелефона");
	ЗначенияПолей.Добавить("",    "Добавочный");
	ЗначенияПолей.Добавить("",   "Комментарий");
	
	Результат = Новый Структура;
	Результат.Вставить("ЗначенияПолей", ЗначенияПолей);
	Результат.Вставить("Представление", НомерТелефона);

	ФормаКлиента[Элемент.Имя]  = Результат.Представление;
	
	Если СтрДанные.Количество() > 0 Тогда
         СтрДанные[0].ЗначенияПолей = Результат.ЗначенияПолей;
    КонецЕсли;

КонецПроцедуры

// Функция - Получить создать группу гостей
// 
Функция ПолучитьКонтрагентаПоНомеруТелефона(НомерТелефона) Экспорт
	
	Если СтрНайти(НомерТелефона, "+") = 0 Тогда
		
		Если Сред(НомерТелефона, 1, 1) = "8" Тогда
			НомерТелефона = "7" + Сред(НомерТелефона, 2); 
		КонецЕсли;
		НомерТелефона = "+" + НомерТелефона;
	Иначе
		Если Сред(НомерТелефона, 1, 2) = "+8" Тогда
			НомерТелефона = "+7" + Сред(НомерТелефона, 3); 
		КонецЕсли;
	КонецЕсли;
	
	МассивНомеровТелефонов = Новый Массив;
	МассивНомеровТелефонов.Добавить(НомерТелефона);
	МассивНомеровТелефонов.Добавить(СтрЗаменить(НомерТелефона, "+" , ""));
	МассивНомеровТелефонов.Добавить(СтрЗаменить(НомерТелефона, "+7", ""));
	МассивНомеровТелефонов.Добавить(СтрЗаменить(НомерТелефона, "+7", "8"));
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КонтрагентыКонтактнаяИнформация.Ссылка
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КонтрагентыКонтактнаяИнформация.НомерТелефона В (&МассивНомеровТелефонов)");
	
	Запрос.УстановитьПараметр("МассивНомеровТелефонов", МассивНомеровТелефонов);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Возврат ?(РезультатЗапроса.Следующий(), РезультатЗапроса.Ссылка, Неопределено);
	
КонецФункции

// Функция, возвращает контрагента по email.
//
Функция ПолучитьКонтрагентаПоEmail(Email) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И ВЫРАЗИТЬ(КонтрагентыКонтактнаяИнформация.Представление КАК СТРОКА(300)) В (&МассивEmail)";				   
	
	МассивEmail = Новый Массив;
	МассивEmail.Добавить(Email);
    МассивEmail.Добавить(НРег(Email));
    МассивEmail.Добавить(ВРег(Email));
	МассивEmail.Добавить(ТРег(Email));
	
	Запрос.УстановитьПараметр("МассивEmail", МассивEmail);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();
		
КонецФункции

// Функция возвращает номер телефона и адрес электронной почты
//
Функция ПолучитьКонтактныеДанныеКонтрагента(Контрагент) Экспорт
	
	КонтактныеДанные = Новый Структура("phone, Email");
	
	Для Каждого СтрокаТЧ Из Контрагент.КонтактнаяИнформация Цикл
		
		Если НЕ ЗначениеЗаполнено(КонтактныеДанные.phone)
			И ЗначениеЗаполнено(СтрокаТЧ.НомерТелефона) Тогда
			
			КонтактныеДанные.phone = СтрокаТЧ.НомерТелефона;
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(КонтактныеДанные.Email)
			И ЗначениеЗаполнено(СтрокаТЧ.АдресЭП) Тогда
			
			КонтактныеДанные.Email = СтрокаТЧ.АдресЭП;
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтактныеДанные.phone)
			И ЗначениеЗаполнено(КонтактныеДанные.Email) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КонтактныеДанные;
		
КонецФункции

// Функция возвращает видимость поля "Законный представитель" 
//
Функция ПолучитьВидимостьЗаконногоПредставителя(ДатаРожденияКлиента, НедееспособныйГражданин = Ложь) Экспорт
	
	Если НедееспособныйГражданин Тогда Возврат Истина; КонецЕсли;
	
	КоличествоЛет = 0;
	Лет = 0;
	Месяцев = 0;
	Дней = 0;
	ДатаР = ДатаРожденияКлиента;
	Високосный = 0;
	
	Если Не День(ДобавитьМесяц(ДатаР,12)) = День(ДатаР) Тогда
		Високосный = 1;
		ДатаР = ДатаР - 60*60*24;
	КонецЕсли;
	Пока ДатаР <= ТекущаяДатаСеанса() Цикл
		ДатаР = ДобавитьМесяц(ДатаР,1);
		Месяцев = Месяцев + 1;
	КонецЦикла;
	
	Месяцев = Месяцев-1;
	Лет = Цел(Месяцев/12);
	Месяцев = Месяцев-Лет*12;
	Дней = Цел((ТекущаяДатаСеанса() - ДобавитьМесяц(ДатаР,-1))/(60*60*24))-Високосный;
	КоличествоЛет = "Лет: "+Строка(Лет)+" Месяцев: "+Строка(Месяцев)+" Дней: "+Строка(Дней);
	
	Если Лет < 18 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		 
КонецФункции

// Функция - Получить массив номеров телефона контрагента
//
// Параметры:
//  Контрагент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивНомеровТелефонаКонтрагента(Контрагент) Экспорт 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
	|	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКлиента)
	|	И КонтрагентыКонтактнаяИнформация.НомерТелефона <> """"");
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерТелефона");
	
КонецФункции

// Функция - Получить статус
//
Функция ПолучитьСтатус(Контрагент, Период = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Период", ?(Период = Неопределено, ТекущаяДатаСеанса(), Период));
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыКонтрагентовСрезПоследних.Контрагент КАК Контрагент,
	|	СтатусыКонтрагентовСрезПоследних.Статус КАК Статус,
	|	СтатусыКонтрагентовСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.СтатусыКонтрагентов.СрезПоследних(&Период, Контрагент = &Контрагент) КАК СтатусыКонтрагентовСрезПоследних
	|ГДЕ
	|	СтатусыКонтрагентовСрезПоследних.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";
				   
	РезультатВыборка = Запрос.Выполнить().Выбрать();
	Если РезультатВыборка.Следующий() Тогда
		Возврат РезультатВыборка.Статус;
	Иначе
		Возврат Перечисления.СтатусыКонтрагентов.ПустаяСсылка();
	КонецЕсли; 
	
КонецФункции

// Процедура - Установить статус
//
Процедура УстановитьСтатус(Контрагент, Статус = Неопределено, НаДату = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Статус) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ПолучитьСтатус(Контрагент, НаДату) = Статус Тогда
		Возврат;
	КонецЕсли; 
	
	МенеджерЗаписи = РегистрыСведений.СтатусыКонтрагентов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Контрагент = Контрагент;
	МенеджерЗаписи.Статус = ?(ЗначениеЗаполнено(Статус), Статус, Перечисления.СтатусыКонтрагентов.ПустаяСсылка());
	МенеджерЗаписи.Период = ?(ЗначениеЗаполнено(НаДату), НаДату, ТекущаяДатаСеанса());
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Функция - Получить данные ФИОКонтрагента
//
// Параметры:
//  Контрагент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеФИОКонтрагента(Контрагент) Экспорт
	
	СтруктураФИО = Новый Структура;
	СтруктураФИО.Вставить("Фамилия"	, "");
	СтруктураФИО.Вставить("Имя"		, "");
	СтруктураФИО.Вставить("Отчество", "");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Имя КАК Имя,
	|	Контрагенты.Отчество КАК Отчество,
	|	Контрагенты.Фамилия КАК Фамилия
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент";
	
	ВыборкаФИО = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаФИО.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(СтруктураФИО, ВыборкаФИО);
	КонецЕсли; 
		
	Возврат СтруктураФИО;
	
КонецФункции

// Функция, получает информацию из табличных частей справочника и формирует структуру.  
//
Функция ПолучитьИнформациюКонтрагента(Контрагент) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
	|	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКлиента)
	|	И КонтрагентыКонтактнаяИнформация.НомерТелефона <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтрагентыКонтактнаяИнформация.АдресЭП КАК АдресЭП
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
	|	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКлиента)
	|	И КонтрагентыКонтактнаяИнформация.АдресЭП <> """"");
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	МассивТелефон 		= ПакетЗапросов[0].Выгрузить().ВыгрузитьКолонку("НомерТелефона");
	ТелефоныСтрокой		= СтроковыеФункцииКлиентСерверСтоматология.ПолучитьСтрокуИзМассиваПодстрок(МассивТелефон, ", ");
	
	МассивЕмайл 		= ПакетЗапросов[1].Выгрузить().ВыгрузитьКолонку("АдресЭП");
	АдресаЭПСтрокой		= СтроковыеФункцииКлиентСерверСтоматология.ПолучитьСтрокуИзМассиваПодстрок(МассивЕмайл, ", ");
		
	Структура = Новый Структура();
	Структура.Вставить("Контрагент"		, Контрагент);
	Структура.Вставить("Телефон"   		, ТелефоныСтрокой);
	Структура.Вставить("АдресЭП"   		, АдресаЭПСтрокой);
		
	Возврат Структура;
	
КонецФункции

// Функция - Получить email контрагента
//
// Параметры:
//  Контрагент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьEmailКонтрагента(Контрагент) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	КонтрагентыКонтактнаяИнформация.АдресЭП КАК АдресЭП
	               |ИЗ
	               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	               |ГДЕ
	               |	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
	               |	И КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	               |	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКлиента)
	               |	И КонтрагентыКонтактнаяИнформация.АдресЭП <> """"";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);    
	
	ВыборкаEmail = Запрос.Выполнить().Выбрать();
	Если ВыборкаEmail.Следующий() Тогда 
		Возврат СокрЛП(ВыборкаEmail.АдресЭП);
	Иначе 
	   	Возврат Null;
	КонецЕсли;
	
КонецФункции

// Функция, определяет, не запрещено ли обслуживание клиента.
//
Функция ОбслуживаниеКлиентаЗапрещено(Контрагент, СообщениеПользователю) Экспорт
	
	Если Контрагент.Теги.НайтиСтроки(Новый Структура("Тег", Справочники.Теги.ЗапретитьОбслуживание)).Количество() > 0 Тогда
		СообщениеПользователю = "Обслуживание клиента """ + СокрЛП(Контрагент) + """ запрещено!";
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Функция - Получить номер телефона для рассылки.
//
Функция ПолучитьНомерТелефонаДляРассылки(Контрагент, ВидКонтактнойИнформации) Экспорт
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("Вид"                   , ВидКонтактнойИнформации);
	ПараметрыПоиска.Вставить("НеУчаствоватьВРассылке", Ложь);
	
	НайденныеСтроки = Контрагент.КонтактнаяИнформация.НайтиСтроки(ПараметрыПоиска);
	НомерТелефона   = ?(ЗначениеЗаполнено(НайденныеСтроки), НайденныеСтроки[0].НомерТелефона, Неопределено);
	
	Возврат НомерТелефона;
	
КонецФункции

// Функция получения списка печатных форм.
//
Функция ПолучитьСписокПечатныхФорм() Экспорт
	
	Список = Новый СписокЗначений;
	Список.Добавить("ЗапланированныеПриемы", "Запланированные приемы", , БиблиотекаКартинок.Документ); 
	
	Возврат Список;
	
КонецФункции

 // Функция, получает информацию из табличных частей справочника и формирует структуру.  
//
Функция ПолучитьМассивТелефоновИEmailКонтрагента(Контрагент) Экспорт
	
	СтруктураВозврата = Новый Структура("Телефоны, Email", Новый Массив, Новый Массив);
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
	|	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКлиента)
	|	И КонтрагентыКонтактнаяИнформация.НомерТелефона <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтрагентыКонтактнаяИнформация.АдресЭП КАК АдресЭП
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
	|	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКлиента)
	|	И КонтрагентыКонтактнаяИнформация.АдресЭП <> """"");
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	МассивТелефонов 	= ПакетЗапросов[0].Выгрузить().ВыгрузитьКолонку("НомерТелефона");	
	МассивEmail 		= ПакетЗапросов[1].Выгрузить().ВыгрузитьКолонку("АдресЭП");
	
	СтруктураВозврата.Телефоны	= МассивТелефонов;
	СтруктураВозврата.Email		= МассивEmail;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#Область ЗагрузкаДанныхИзВнешнегоИсточника

// Процедура - При определении значения по умолчанию.
//
// Параметры:
//  СправочникСсылка	 - 	 - 
//  ИмяРеквизита		 - 	 - 
//  ВходящиеДанные		 - 	 - 
//  СтрокаСопоставлена	 - 	 - 
//  ОбновлятьДанные		 - 	 - 
//  ЗначениеПоУмолчанию	 - 	 - 
//
Процедура ПриОпределенииЗначенияПоУмолчанию(СправочникСсылка, ИмяРеквизита, ВходящиеДанные, СтрокаСопоставлена, ОбновлятьДанные, ЗначениеПоУмолчанию)
	
	Если СтрокаСопоставлена 
		И НЕ ЗначениеЗаполнено(ВходящиеДанные) Тогда
		
		ЗначениеПоУмолчанию = СправочникСсылка[ИмяРеквизита];
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - При определении образцов загрузки данных.
//
// Параметры:
//  НастройкиЗагрузкиДанных	 - 	 - 
//  УникальныйИдентификатор	 - 	 - 
//
Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
	
КонецПроцедуры

// Процедура - Поля загрузки данных из внешнего источника.
//
// Параметры:
//  ТаблицаПолейЗагрузки	 - 	 - 
//  НастройкиЗагрузкиДанных	 - 	 - 
//
Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт
	
	//
	// Для группы полей действует правило: хотя бы одно поле в группе должно быть выбрано в колонках
	//
	
	ОписаниеТиповСтрока10 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(10));
	ОписаниеТиповСтрока11 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(11));
	ОписаниеТиповСтрока25 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25));
	ОписаниеТиповСтрока50 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100));
	ОписаниеТиповСтрока150 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
	ОписаниеТиповСтрока200 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(200));
	ОписаниеТиповСтрока1000 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000));
	ОписаниеТиповЧисло10_0 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло10_3 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(10, 3, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло15_2 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло15_3 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповДата = Новый ОписаниеТипов("Дата", , , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	ОписаниеТиповДатаВремя = Новый ОписаниеТипов("Дата", , , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	
	ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
	
	ОписаниеТиповКонтрагенты = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	ОписаниеТиповТипыПолиса = Новый ОписаниеТипов("ПеречислениеСсылка.ТипыПолиса");
	ОписаниеТиповРекламныеИсточники = Новый ОписаниеТипов("СправочникСсылка.РекламныеИсточники");
	ОписаниеТиповВидыМедицинскихКарт = Новый ОписаниеТипов("СправочникСсылка.ВидыМедицинскихКарт");
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Родитель", "Группа", ОписаниеТиповСтрока100, ОписаниеТиповКонтрагенты,,,Истина);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "КонтрагентНаименование",	"Клиент (наименование)",	ОписаниеТиповСтрока100, ОписаниеТиповКонтрагенты, "Клиент", 1, Истина, Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Контрагент_КодСинхронизации", "Код синхронизации", ОписаниеТиповСтрока100, ОписаниеТиповСтрока100, "Клиент", 2, , Истина);
		
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "АдресФакт", "Адрес", ОписаниеТиповСтрока1000, ОписаниеТиповСтрока1000);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Телефон", "Телефон*", ОписаниеТиповСтрока100, ОписаниеТиповСтрока100);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "АдресЭП", "E-mail*", ОписаниеТиповСтрока100, ОписаниеТиповСтрока100);
	
	ОписаниеТиповПол = Новый ОписаниеТипов("ПеречислениеСсылка.ПолФизическогоЛица");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ПолКлиента",	"Пол клиента", ОписаниеТиповСтрока10, ОписаниеТиповПол);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Контрагент_ДатаРожденияКлиента", "Дата рождения", ОписаниеТиповСтрока25, ОписаниеТиповДата);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Контрагент_ДатаРегистрации", "Дата регистрации", ОписаниеТиповСтрока25, ОписаниеТиповДата);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ДокументУдостоверяющийЛичность",	"Паспорт (XXXX XXXXXX, кем выдан, ДД.ММ.ГГГГ)", ОписаниеТиповСтрока200, ОписаниеТиповСтрока200);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ИсточникИнформации", "Рекламный источник", ОписаниеТиповСтрока100, ОписаниеТиповРекламныеИсточники);
	
	// ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Теги", "Теги*", ОписаниеТиповСтрока200, ОписаниеТиповСтрока200);
	
	// ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Заметки", "Заметки*", ОписаниеТиповСтрока200, ОписаниеТиповСтрока200);
	// ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ДатаЗаметки", "Дата заметки", ОписаниеТиповСтрока25, ОписаниеТиповДата);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НомерКарты", "Номер амбулаторной карты", ОписаниеТиповСтрока200, ОписаниеТиповСтрока200);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ВидМедицинскойКарты", "Вид медицинской карты", ОписаниеТиповСтрока100, ОписаниеТиповВидыМедицинскихКарт);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ДатаРегистрацииМедКарты", "Дата регистрации мед. карты", ОписаниеТиповСтрока100, ОписаниеТиповДатаВремя);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ДатаЗавершенияМедКарты", "Дата закрытия мед. карты", ОписаниеТиповСтрока100, ОписаниеТиповДатаВремя);
	                              
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Комментарий", "Комментарий", ОписаниеТиповСтрока200, ОписаниеТиповСтрока200);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СтраховаяКомпания", "Страховая компания", ОписаниеТиповСтрока100, ОписаниеТиповКонтрагенты);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ТипПолиса", "Тип полиса", ОписаниеТиповСтрока100, ОписаниеТиповТипыПолиса);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СерияПолиса", "Серия полиса", ОписаниеТиповСтрока100, ОписаниеТиповСтрока100);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НомерПолиса", "Номер полиса", ОписаниеТиповСтрока100, ОписаниеТиповСтрока100);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НачалоДействияПолиса", "Начало действия полиса", ОписаниеТиповСтрока100, ОписаниеТиповДатаВремя);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "КонецДействияПолиса", "Конец действия полиса", ОписаниеТиповСтрока100, ОписаниеТиповДатаВремя);
	
КонецПроцедуры

// Процедура - Сопоставить загружаемые данные из внешнего источника.
//
// Параметры:
//  ПараметрыСопоставления	 - 	 - 
//  АдресРезультата			 - 	 - 
//
Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ПараметрыСопоставления, АдресРезультата) Экспорт
	
	ТаблицаСопоставленияДанных	= ПараметрыСопоставления.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
	НастройкиЗагрузкиДанных		= ПараметрыСопоставления.НастройкиЗагрузкиДанных;
	ОбновлятьДанные				= НастройкиЗагрузкиДанных.ОбновлятьСуществующие;
	
	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.Телефон, СтрокаТаблицыФормы.Телефон_ВходящиеДанные);
		Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Телефон) Тогда
			МассивТелефонов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаТаблицыФормы.Телефон, ",",Истина, Истина);
		КонецЕсли;
		
		// Контрагент 
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьКонтрагента(СтрокаТаблицыФормы.Клиент, СтрокаТаблицыФормы.Контрагент_КодСинхронизации, СтрокаТаблицыФормы.КонтрагентНаименование, МассивТелефонов, ПараметрыСопоставления.НастройкиЗагрузкиДанных.ПоискПоПолю);
		
		ЭтаСтрокаСопоставлена = ЗначениеЗаполнено(СтрокаТаблицыФормы.Клиент);
		
		// Родитель по наименованию
		ЗначениеПоУмолчанию = ПолучитьГруппуКлиенты();// Справочники.Контрагенты.ПустаяСсылка();
		ПриОпределенииЗначенияПоУмолчанию(СтрокаТаблицыФормы.Клиент, "Родитель", СтрокаТаблицыФормы.Родитель_ВходящиеДанные, ЭтаСтрокаСопоставлена, ОбновлятьДанные, ЗначениеПоУмолчанию);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьРодителя("Контрагенты", СтрокаТаблицыФормы.Родитель, СтрокаТаблицыФормы.Родитель_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// КИ (Юр. адрес, факт. адрес, адрес ЭП, телефон)
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.АдресФакт, СтрокаТаблицыФормы.АдресФакт_ВходящиеДанные);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.АдресЭП, СтрокаТаблицыФормы.АдресЭП_ВходящиеДанные);
		
		// Пол
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьПолФизическогоЛица(СтрокаТаблицыФормы.ПолКлиента, СтрокаТаблицыФормы.ПолКлиента_ВходящиеДанные);
		
		// ДатаРождения
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(СтрокаТаблицыФормы.Контрагент_ДатаРожденияКлиента, СтрокаТаблицыФормы.Контрагент_ДатаРожденияКлиента_ВходящиеДанные);
		
		// ДатаРегистрации
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(СтрокаТаблицыФормы.Контрагент_ДатаРегистрации, СтрокаТаблицыФормы.Контрагент_ДатаРегистрации_ВходящиеДанные);
		
		//// ДатаЗаметки
		// ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(СтрокаТаблицыФормы.ДатаЗаметки, СтрокаТаблицыФормы.ДатаЗаметки_ВходящиеДанные);
		
		// ДокументУдостоверяющийЛичность
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.ДокументУдостоверяющийЛичность, СтрокаТаблицыФормы.ДокументУдостоверяющийЛичность_ВходящиеДанные);
		
		// Комментарий
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.Комментарий, СтрокаТаблицыФормы.Комментарий_ВходящиеДанные);
		
		// Номер карты
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.НомерКарты, СтрокаТаблицыФормы.НомерКарты_ВходящиеДанные);
		
		// ВидМедицинскойКарты
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьВидМедицинскойКарты(СтрокаТаблицыФормы.ВидМедицинскойКарты, СтрокаТаблицыФормы.ВидМедицинскойКарты_ВходящиеДанные);
		
		// ДатаЗавершенияМедКарты
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(СтрокаТаблицыФормы.ДатаЗавершенияМедКарты, СтрокаТаблицыФормы.ДатаЗавершенияМедКарты_ВходящиеДанные);
		
		// Дата регистрации мед карты
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(СтрокаТаблицыФормы.ДатаРегистрацииМедКарты, СтрокаТаблицыФормы.ДатаРегистрацииМедКарты_ВходящиеДанные);
		
		
		// Полис страхования.
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьТипПолиса(СтрокаТаблицыФормы.ТипПолиса, СтрокаТаблицыФормы.ТипПолиса_ВходящиеДанные, Перечисления.ТипыПолиса.ДобровольноеМедицинскоеСтрахование);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(СтрокаТаблицыФормы.НачалоДействияПолиса, СтрокаТаблицыФормы.НачалоДействияПолиса_ВходящиеДанные);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(СтрокаТаблицыФормы.КонецДействияПолиса, СтрокаТаблицыФормы.КонецДействияПолиса_ВходящиеДанные);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.СерияПолиса, СтрокаТаблицыФормы.СерияПолиса_ВходящиеДанные);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.НомерПолиса, СтрокаТаблицыФормы.НомерПолиса_ВходящиеДанные);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьКонтрагента(СтрокаТаблицыФормы.СтраховаяКомпания,, СтрокаТаблицыФормы.СтраховаяКомпания_ВходящиеДанные,, 0);
		
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы);
		
		ЗагрузкаДанныхИзВнешнегоИсточника.ПрогрессСопоставленияДанных(ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицыФормы), РазмерТаблицыДанных);
		
	КонецЦикла;
	
	Если НастройкиЗагрузкиДанных.ПоискПоПолю = 0 Тогда // Сопоставляли по Наименованию
		ТаблицаСопоставленияДанных.Сортировать("КонтрагентНаименование");
	ИначеЕсли НастройкиЗагрузкиДанных.ПоискПоПолю = 1 Тогда // Сопоставляли по телефону

	Иначе  // по коду синхронизации
		ТаблицаСопоставленияДанных.Сортировать("Контрагент_КодСинхронизации");		
	КонецЕсли;	
	ПоместитьВоВременноеХранилище(ТаблицаСопоставленияДанных, АдресРезультата);
	
КонецПроцедуры

// Процедура - Проверить корректность данных в строке таблицы.
//
// Параметры:
//  СтрокаТаблицыФормы			 - 	 - 
//  ПолноеИмяОбъектаЗаполнения	 - 	 - 
//
Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	СтрокаТаблицыФормы._СтрокаСопоставлена = ЗначениеЗаполнено(СтрокаТаблицыФормы.Клиент);
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	
	СтрокаТаблицыФормы[ИмяСлужебногоПоля] = СтрокаТаблицыФормы._СтрокаСопоставлена
											ИЛИ (НЕ СтрокаТаблицыФормы._СтрокаСопоставлена И НЕ ПустаяСтрока(СтрокаТаблицыФормы.КонтрагентНаименование));
	
КонецПроцедуры

// Процедура - Обработать подготовленные данные.
//
// Параметры:
//  СтруктураДанных				 - 	 - 
//  ФоновоеЗаданиеАдресХранилища - 	 - 
//
Процедура ОбработатьПодготовленныеДанные(СтруктураДанных, ФоновоеЗаданиеАдресХранилища = "") Экспорт
	
	НастройкиОбновленияСвойств	= СтруктураДанных.НастройкиЗагрузкиДанных.НастройкиОбновленияСвойств;
	ОбновлятьСуществующие		= СтруктураДанных.НастройкиЗагрузкиДанных.ОбновлятьСуществующие;
	СоздаватьЕслиНеСопоставлено = СтруктураДанных.НастройкиЗагрузкиДанных.СоздаватьЕслиНеСопоставлено;
	ПоискПоПолю 				= СтруктураДанных.НастройкиЗагрузкиДанных.ПоискПоПолю;
	ТаблицаСопоставленияДанных	= СтруктураДанных.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
	КоличествоЗаписейТранзакции	= 0;
	ТранзакцияОткрыта			= Ложь;
	
	Попытка
		
		ЕстьДатаЗаметки = ТаблицаСопоставленияДанных.Колонки.Найти("ДатаЗаметки") <> Неопределено;
		Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			Если НЕ ТранзакцияОткрыта 
				И КоличествоЗаписейТранзакции = 0 Тогда
				
				НачатьТранзакцию();
				ТранзакцияОткрыта = Истина;
				
			КонецЕсли;
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			
			СогласованноеСостояниеСтроки = (СтрокаТаблицы._СтрокаСопоставлена И ОбновлятьСуществующие) 
				ИЛИ (НЕ СтрокаТаблицы._СтрокаСопоставлена И СоздаватьЕслиНеСопоставлено);
			
			Если ЗагрузкаВПриложениеВозможна И СогласованноеСостояниеСтроки Тогда
				
				КоличествоЗаписейТранзакции = КоличествоЗаписейТранзакции + 1;
				
				Если СтрокаТаблицы._СтрокаСопоставлена Тогда
					ЭлементСправочника = СтрокаТаблицы.Клиент.ПолучитьОбъект();
					ПолКлиентаДоЗаполнения = ЭлементСправочника.ПолКлиента;
					// ЗаполнитьЗначенияСвойств(ЭлементСправочника, СтрокаТаблицы, НастройкиОбновленияСвойств.ИменаПолейОбновляемые, НастройкиОбновленияСвойств.ИменаПолейНеподлежащихОбновлению);
					ЗаполнитьЗначенияСвойств(ЭлементСправочника, СтрокаТаблицы);
				Иначе
					ИндексТекущий = ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицы);
					Если ИндексТекущий > 0 Тогда 
						ПредыдущаяСтрока = ТаблицаСопоставленияДанных[ИндексТекущий - 1];
						Если ПоискПоПолю = 0 Тогда // Сопоставляли по Наименованию
							СоздаватьНовый = НЕ СокрЛП(СтрокаТаблицы.КонтрагентНаименование) = СокрЛП(ПредыдущаяСтрока.КонтрагентНаименование);  
						ИначеЕсли ПоискПоПолю = 1 Тогда // Сопоставляли по телефону
							СоздаватьНовый = Истина;
						Иначе  // по коду синхронизации
							СоздаватьНовый = НЕ СокрЛП(СтрокаТаблицы.Контрагент_КодСинхронизации) = СокрЛП(ПредыдущаяСтрока.Контрагент_КодСинхронизации);  
						КонецЕсли;	
					Иначе
						СоздаватьНовый 		= Истина;
						ПредыдущаяСтрока 	= Неопределено;
					КонецЕсли;
					
					Если СоздаватьНовый Тогда 
						ЭлементСправочника = Справочники.Контрагенты.СоздатьЭлемент();
						ЭлементСправочника.Заполнить(Новый Структура("ТекстЗаполнения, Родитель", СтрокаТаблицы.КонтрагентНаименование, СтрокаТаблицы.Родитель));
					Иначе 
						// ЭлементСправочника = ЭлементСправочника;
					КонецЕсли;	
					ЗаполнитьЗначенияСвойств(ЭлементСправочника, СтрокаТаблицы, , ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СтандартныеИменаПолейНеподлежащихОбновлению(СтруктураДанных.НастройкиЗагрузкиДанных));					
					
					// Если в excel файле указаны группы, туда и загружается.
					Если ЗначениеЗаполнено(СтрокаТаблицы.Родитель_ВходящиеДанные) Тогда  
						
						// Разбить строку на подстроки
						Группа = Неопределено;
						
						МассивСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(СтрокаТаблицы.Родитель_ВходящиеДанные, "|");
						РодительВерхнегоУровня = ?(ЗначениеЗаполнено(ЭлементСправочника.Родитель), ЭлементСправочника.Родитель, Неопределено);
						Для Каждого РодительНаименование Из МассивСлов Цикл
							
							Если ЗначениеЗаполнено(РодительНаименование) Тогда
								
								Группа = НайтиСоздатьГруппу(РодительНаименование, РодительВерхнегоУровня);
								РодительВерхнегоУровня = Группа;
								
							КонецЕсли;
							
						КонецЦикла;
						
						ЭлементСправочника.Родитель = Группа;
						
					КонецЕсли;
					
				КонецЕсли;
				
				// Код синхронизаци
				Если ЗначениеЗаполнено(СтрокаТаблицы.Контрагент_КодСинхронизации) Тогда
					ЭлементСправочника.КодСинхронизации = СтрокаТаблицы.Контрагент_КодСинхронизации;
				КонецЕсли;
				
				// Заполняем данные по контактой информации
				ЗаполнениеКонтактнойИнформации(СтрокаТаблицы, ЭлементСправочника);
				
				// Заполнение даты регистрации.
				Если ЗначениеЗаполнено(СтрокаТаблицы.Контрагент_ДатаРегистрации) Тогда
					ЭлементСправочника.ДатаРегистрации = СтрокаТаблицы.Контрагент_ДатаРегистрации;		
				КонецЕсли;
				
				// Дата рождения
				Если ЗначениеЗаполнено(СтрокаТаблицы.Контрагент_ДатаРожденияКлиента) Тогда
					ЭлементСправочника.ДатаРожденияКлиента = СтрокаТаблицы.Контрагент_ДатаРожденияКлиента;
				КонецЕсли;
							
				// Заполнение рекламного источника.			
				ЗаполнениеРекламногоИсточника(СтрокаТаблицы.ИсточникИнформации_ВходящиеДанные, ЭлементСправочника);
			
			//	// Заполнение таблицы Теги.
			//	ЗаполнениеТегов(СтрокаТаблицы.Теги_ВходящиеДанные, ЭлементСправочника);
				
				Если ЗначениеЗаполнено(СтрокаТаблицы.НомерКарты) Тогда
					
					Если ЗначениеЗаполнено(ЭлементСправочника.Ссылка) Тогда
						СсылкаНаКлиента = ЭлементСправочника.Ссылка;
					Иначе
						ЭлементСправочника.УстановитьСсылкуНового(Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор));		
						СсылкаНаКлиента = ЭлементСправочника.ПолучитьСсылкуНового();
					КонецЕсли;
					
					// Заполнение медицинской карты.
					МедКарта = ЗаполнитьМедицинскуюКарту(СтрокаТаблицы.НомерКарты, СтрокаТаблицы.ВидМедицинскойКарты, СтрокаТаблицы.ДатаРегистрацииМедКарты, СтрокаТаблицы.ДатаЗавершенияМедКарты, СсылкаНаКлиента, ЭлементСправочника.Наименование);
					ЭлементСправочника.ТекущаяМедицинскаяКарта = МедКарта;
					
				КонецЕсли;
				
				// При обновлении клиентов и при отсутствии данной колони в экселе перезатирает пол клиента на Неопределено.
				Если ПолКлиентаДоЗаполнения <> Неопределено Тогда
					Если ЭлементСправочника.ПолКлиента <> ПолКлиентаДоЗаполнения И НЕ ЗначениеЗаполнено(ЭлементСправочника.ПолКлиента) Тогда
						ЭлементСправочника.ПолКлиента = ПолКлиентаДоЗаполнения;
					КонецЕсли;
				КонецЕсли;
				
				// Запись нового клиента.
				ЭлементСправочника.Записать();					
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Клиент) Тогда 
					СтрокаТаблицы.Клиент = ЭлементСправочника.Ссылка;
				КонецЕсли;
				
			//	// Заполнение таблицы Заметки.
			//	ЗаполнениеЗаметок(СтрокаТаблицы, ЭлементСправочника.Ссылка, ЕстьДатаЗаметки);
							
				// Заполнение данных Паспорта	
				ЗаполнениеПаспортныхДанных(СтрокаТаблицы.ДокументУдостоверяющийЛичность, ЭлементСправочника.Ссылка);
				
				// Заполнение полисов страхования.
				СформироватьПолисыСтрахования(СтрокаТаблицы);

			КонецЕсли;
			
			ИндексТекущейстроки = ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицы) + 1;
			ТекстПрогресса      = СтрШаблон(НСтр("ru ='Обработано %1 из %2 строк...'"), ИндексТекущейстроки, РазмерТаблицыДанных);
			ПроцентВыполнения   = Окр(ИндексТекущейстроки * 100 / РазмерТаблицыДанных);
			
			ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, ТекстПрогресса);
			
			Если ТранзакцияОткрыта
				И КоличествоЗаписейТранзакции > ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.МаксимумЗаписейВОднойТранзакции() Тогда
				
				ЗафиксироватьТранзакцию();
				ТранзакцияОткрыта = Ложь;
				КоличествоЗаписейТранзакции = 0;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТранзакцияОткрыта 
			И КоличествоЗаписейТранзакции > 0 Тогда
			
			ЗафиксироватьТранзакцию();
			ТранзакцияОткрыта = Ложь;
			
		КонецЕсли;
		
	Исключение
		// Сообщить(ЭлементСправочника.Ссылка, ЭлементСправочника.КодСинхронизации);
		ЗаписьЖурналаРегистрации(Нстр("ru='Загрузка данных'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Контрагенты, , ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры

// Процедура - Заполнение паспортных данных.
//
// Параметры:
//  ДокументСтрокой			 - 	 - 
//  ЭлементСправочникаСсылка - 	 - 
//
Процедура ЗаполнениеПаспортныхДанных(ДокументСтрокой, ЭлементСправочникаСсылка)
	
	Если ЗначениеЗаполнено(ДокументСтрокой) Тогда
		МассивДанныхПаспорта = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ДокументСтрокой, ",");
		НомерСтрокиДанных = 1;
		Серия = "";
		Номер = "";
		КемВыдан = "";
		ДатаВыдачи = Дата(1,1,1);
		Для Каждого СтрокаДанных Из МассивДанныхПаспорта Цикл
			// Серия XXXX Код XXXXXX
			СтрокаДанных = СокрЛП(СтрокаДанных);
			Если НомерСтрокиДанных = 1 Тогда
				ПозицияПробела = Найти(СтрокаДанных, " ");
				Серия = Сред(СтрокаДанных, 1, ПозицияПробела);
				Если ЗначениеЗаполнено(Серия) Тогда 
					Номер = СтрЗаменить(СтрокаДанных, Серия, "");
				Иначе
					Номер = СтрокаДанных;
				КонецЕсли;	
				// Кем выдан
			ИначеЕсли НомерСтрокиДанных = 2 Тогда
				КемВыдан = СтрокаДанных;
				// Дата выдачи
			ИначеЕсли НомерСтрокиДанных = 3 Тогда
				ДатаВыдачи = ПривестиКТипуДата(СтрокаДанных);
				Если ДатаВыдачи = Неопределено Тогда					
					ДатаВыдачи = Дата(1,1,1);					
				КонецЕсли;
			КонецЕсли;
			НомерСтрокиДанных = НомерСтрокиДанных + 1;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Серия) ИЛИ ЗначениеЗаполнено(Номер) ИЛИ ЗначениеЗаполнено(КемВыдан) ИЛИ ЗначениеЗаполнено(ДатаВыдачи) Тогда
			
			НаборЗаписей = РегистрыСведений.ДокументыФизическихЛиц.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Физлицо.Установить(ЭлементСправочникаСсылка);
			ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ;
			НаборЗаписей.Отбор.ВидДокумента.Установить(ВидДокумента);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить(); 
			НаборЗаписей.Записать();
			СтрокаН = НаборЗаписей.Добавить();
			СтрокаН.Период = ТекущаяДата();
			СтрокаН.ВидДокумента = ВидДокумента;
			СтрокаН.Физлицо = ЭлементСправочникаСсылка; 
			СтрокаН.КемВыдан = КемВыдан;
			СтрокаН.Номер = Номер;
			СтрокаН.Серия = Серия;
			СтрокаН.ДатаВыдачи = ДатаВыдачи;
			СтрокаН.ЯвляетсяДокументомУдостоверяющимЛичность = Истина;
			// СтрокаН.Основной = Истина;
			СтрокаН.Представление = ""
			+ ВидДокумента
			+ ?(ЗначениеЗаполнено(Серия), Серия + " ", "")
			+ ?(ЗначениеЗаполнено(Номер), Номер + " ", "")
			+ ?(ЗначениеЗаполнено(КемВыдан), ", " + КемВыдан + " ", "")
			+ ?(ДатаВыдачи <> Дата(1,1,1), ", " + Строка(ДатаВыдачи) + " ", "");
			
			НаборЗаписей.Записать(Истина);		
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Процедура - Заполнение рекламного источника.
//
// Параметры:
//  РекламныйИсточникСтрокой - 	 - 
//  ЭлементСправочника		 - 	 - 
//
Процедура ЗаполнениеРекламногоИсточника(РекламныйИсточникСтрокой, ЭлементСправочника)
	
	РекламныйИсточникСтрокой = СокрЛП(РекламныйИсточникСтрокой);
	Если ЗначениеЗаполнено(РекламныйИсточникСтрокой) Тогда 
		
		РекламныйИсточникСсылка = Справочники.РекламныеИсточники.ПолучитьРекламныйИсточник(РекламныйИсточникСтрокой);
		
		Если ЗначениеЗаполнено(РекламныйИсточникСсылка) Тогда
			Если ЗначениеЗаполнено(ЭлементСправочника.ИсточникИнформации) И РекламныйИсточникСсылка.ПометкаУдаления Тогда
			Иначе 	
				ЭлементСправочника.ИсточникИнформации = РекламныйИсточникСсылка;
			КонецЕсли;	
		Иначе 	
			
			НовыйРекламныйИсточник = Справочники.РекламныеИсточники.СоздатьЭлемент();
			НовыйРекламныйИсточник.Наименование = РекламныйИсточникСтрокой;
			НовыйРекламныйИсточник.Записать();
			
			ЭлементСправочника.ИсточникИнформации = НовыйРекламныйИсточник.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Процедура - Заполнение тегов.
//
// Параметры:
//  ТегиСтрокой			 - 	 - 
//  ЭлементСправочника	 - 	 - 
//
Процедура ЗаполнениеТегов(ТегиСтрокой, ЭлементСправочника)
	
	Если ЗначениеЗаполнено(ТегиСтрокой) Тогда
		
		ЭлементСправочника.Теги.Очистить();
		МассивТеги = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТегиСтрокой, ",");
		
		Для Каждого Тег Из МассивТеги Цикл
			
			НайденныйТег = Справочники.Теги.НайтиПоНаименованию(Тег); 
			Если НЕ ЗначениеЗаполнено(НайденныйТег) Тогда
				
				НовыйТег = Справочники.Теги.СоздатьЭлемент();
				НовыйТег.Наименование = СокрЛП(Тег);
				Попытка
					НовыйТег.Записать();
					НайденныйТег = НовыйТег.Ссылка;
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при записи элемента справочника Теги. Строка: " + Тег + Символы.ПС + ОписаниеОшибки());	
				КонецПопытки;
			КонецЕсли;	
			
			СтрокаТег = ЭлементСправочника.Теги.Добавить();
			СтрокаТег.Тег = НайденныйТег;
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// Процедура - Заполнение заметок.
//
// Параметры:
//  ЗаметкиСтрокой			 - 	 - 
//  ЭлементСправочникаСсылка - 	 - 
//
Процедура ЗаполнениеЗаметок(СтрокаТаблицы, ЭлементСправочникаСсылка, ЕстьДатаЗаметки = Ложь)
	
	ЗаметкиСтрокой = СтрокаТаблицы.Заметки_ВходящиеДанные;
	Если ЗначениеЗаполнено(ЗаметкиСтрокой) Тогда
		МассивЗаметки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ЗаметкиСтрокой, ",");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Заметки.Объект КАК Объект,
		|	Заметки.АктивностьЗаметки КАК АктивностьЗаметки,
		|	Заметки.Автор КАК Автор,
		|	Заметки.ИД КАК ИД,
		|	Заметки.Заметка КАК Заметка,
		|	Заметки.Период КАК Период
		|ИЗ
		|	РегистрСведений.Заметки КАК Заметки
		|ГДЕ
		|	(ВЫРАЗИТЬ(Заметки.Объект КАК Справочник.Контрагенты)) = &Объект
		|	И ВЫРАЗИТЬ(Заметки.Заметка КАК СТРОКА(500)) В (&МассивЗаметки)";
		
		Запрос.УстановитьПараметр("МассивЗаметки", МассивЗаметки);
		Запрос.УстановитьПараметр("Объект"       , ЭлементСправочникаСсылка);
		
		ТаблицаЗаметкиКлиента = Запрос.Выполнить().Выгрузить();
		
		Для Каждого ТекстЗаметки Из МассивЗаметки Цикл
			
			СтруктураОтбора = Новый Структура();
			СтруктураОтбора.Вставить("Объект" , ЭлементСправочникаСсылка); 
			СтруктураОтбора.Вставить("Заметка", ТекстЗаметки); 
			
			Если ЕстьДатаЗаметки И ЗначениеЗаполнено(СтрокаТаблицы.ДатаЗаметки) Тогда 
				СтруктураПоиска = Новый Структура("Заметка, Период", ТекстЗаметки, СтрокаТаблицы.ДатаЗаметки);
			Иначе
				СтруктураПоиска = Новый Структура("Заметка", ТекстЗаметки);
			КонецЕсли;	
			НайденныеСтроки = ТаблицаЗаметкиКлиента.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() > 0 Тогда						
				СтруктураОтбора.Вставить("АктивностьЗаметки", НайденныеСтроки[0].АктивностьЗаметки); 
				СтруктураОтбора.Вставить("Автор"			, НайденныеСтроки[0].Автор); 
				СтруктураОтбора.Вставить("Период"			, НайденныеСтроки[0].Период); 
				СтруктураОтбора.Вставить("ИД"				, НайденныеСтроки[0].ИД);
			Иначе
				СтруктураОтбора.Вставить("АктивностьЗаметки", Истина);
				СтруктураОтбора.Вставить("Автор"			, ПараметрыСеанса.ТекущийПользователь);
				СтруктураОтбора.Вставить("Период"			, ?(ЕстьДатаЗаметки И ЗначениеЗаполнено(СтрокаТаблицы.ДатаЗаметки), СтрокаТаблицы.ДатаЗаметки, ?(ЗначениеЗаполнено(СтрокаТаблицы.Контрагент_ДатаРегистрации), СтрокаТаблицы.Контрагент_ДатаРегистрации, ТекущаяДатаСеанса())));
				СтруктураОтбора.Вставить("ИД"				, Новый УникальныйИдентификатор);					
			КонецЕсли;
			
			ОбъектРегистрСведенийЗаметка = РегистрыСведений.Заметки.СоздатьНаборЗаписей();
			ОбъектРегистрСведенийЗаметка.ОбменДанными.Загрузка = Истина;
			
			ОбъектРегистрСведенийЗаметка.Отбор.ИД.Установить(СтруктураОтбора.ИД);
			ЗаполнитьЗначенияСвойств(ОбъектРегистрСведенийЗаметка.Добавить(), СтруктураОтбора);
			ОбъектРегистрСведенийЗаметка.Записать(Истина);
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// Процедура - Заполнение номера карты.
//
// Параметры:
//  НомерКарты			 - 	 - 
//  ЭлементСправочника	 - 	 - 
//
Процедура ЗаполнениеНомераКарты(НомерКарты, ЭлементСправочника)
	
	Если ЗначениеЗаполнено(НомерКарты) Тогда
		
		КартаСсылка = Справочники.Карты.НайтиПоРеквизиту("КодКарты", НомерКарты);
		
		Если ЗначениеЗаполнено(КартаСсылка) Тогда
			КартаОбъект = КартаСсылка.ПолучитьОбъект();
		Иначе
			КартаОбъект = Справочники.Карты.СоздатьЭлемент();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(КартаОбъект.ВладелецКарты) Тогда
			КартаОбъект.ВладелецКарты = ЭлементСправочника.Ссылка; 
			КартаОбъект.КодКарты = НомерКарты; 
			КартаОбъект.ТипКода = Перечисления.ВидыКарт.Магнитная;
			Если КартаОбъект.ДатаОткрытия = Дата(1,1,1) Тогда
				КартаОбъект.ДатаОткрытия = ТекущаяДата();
			КонецЕсли;
		КонецЕсли;
		
		СтрокаНаименования = ?(ЗначениеЗаполнено(НомерКарты), НомерКарты + ", ", "") + ЭлементСправочника.Наименование + " (Магнитная)";
		КартаОбъект.Наименование = СтрокаНаименования;

		// ПараметрыСеанса.ОбменДаннымиЗагрузка = Истина;
		КартаОбъект.Записать();
		// ПараметрыСеанса.ОбменДаннымиЗагрузка = Ложь;
		
		Если Не ЗначениеЗаполнено(КартаОбъект.Ссылка) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при записи карты клиента " + ЭлементСправочника.Наименование + " № " + НомерКарты + Символы.ПС + ОписаниеОшибки());	 
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Процедура - Заполнение контактной информации.
//
// Параметры:
//  СтрокаТаблицы		 - 	 - 
//  ЭлементСправочника	 - 	 - 
//
Процедура ЗаполнениеКонтактнойИнформации(СтрокаТаблицы, ЭлементСправочника)
	
	Клиент_КонтактнаяИнформация = ЭлементСправочника.КонтактнаяИнформация;
	
	Если НЕ ПустаяСтрока(СтрокаТаблицы.АдресФакт) Тогда
		
		Объект_XDTO_Адрес = ПолучитьСтруктуру_XDTO(СтрокаТаблицы.АдресФакт, Перечисления.ТипыКонтактнойИнформации.Адрес);
		
		Если Объект_XDTO_Адрес <> Неопределено Тогда
			
			// Найти в КИ существующий Адрес
			Представление = Объект_XDTO_Адрес.Представление;
			
			НайденныеСтроки = Клиент_КонтактнаяИнформация.НайтиСтроки(Новый Структура("Представление, Тип", Представление, Перечисления.ТипыКонтактнойИнформации.Адрес));
			Если НайденныеСтроки.Количество() = 0 Тогда
				ЗаполнитьАдрес(ЭлементСправочника, Объект_XDTO_Адрес , Справочники.ВидыКонтактнойИнформации.АдресКлиента);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтрокаТаблицы.Телефон) Тогда  
				
		МассивТелефонов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаТаблицы.Телефон, ",",Истина, Истина);
		Для Каждого Телефон Из МассивТелефонов Цикл  
			
			СписокПолей = Новый СписокЗначений;
			УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(Телефон, СписокПолей);
			
			Объект_XDTO_Телефон = ПолучитьСтруктуру_XDTO(СокрЛП(Телефон), Перечисления.ТипыКонтактнойИнформации.Телефон);
			
			Если Объект_XDTO_Телефон <> Неопределено Тогда
				
				// Найти в КИ существующий телефон
				// НомерТелефона = Объект_XDTO_Телефон.Состав.Номер;
				НомерТелефона = Объект_XDTO_Телефон.Состав.КодСтраны + Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер;				
				НайденныеСтроки = Клиент_КонтактнаяИнформация.НайтиСтроки(Новый Структура("НомерТелефона, Тип", НомерТелефона, Перечисления.ТипыКонтактнойИнформации.Телефон));
				Если НайденныеСтроки.Количество() = 0 Тогда
					ЗаполнитьТелефон(ЭлементСправочника, Объект_XDTO_Телефон, Справочники.ВидыКонтактнойИнформации.ТелефонКлиента);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;	
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтрокаТаблицы.АдресЭП) Тогда
		
		МассивАдресЭП = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаТаблицы.АдресЭП, ",",Истина, Истина);
		Для Каждого АдресЭП Из МассивАдресЭП Цикл 
			
			Объект_XDTO_Email = ПолучитьСтруктуру_XDTO(СокрЛП(АдресЭП), Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			
			Если Объект_XDTO_Email <> Неопределено  Тогда
				
				// Найти в КИ существующий АдресЭлектроннойПочты
				Представление = Объект_XDTO_Email.Представление;
				
				НайденныеСтроки = Клиент_КонтактнаяИнформация.НайтиСтроки(Новый Структура("Представление, Тип", Представление, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
				Если НайденныеСтроки.Количество() = 0 Тогда
					ЗаполнитьEmail(ЭлементСправочника, Объект_XDTO_Email, Справочники.ВидыКонтактнойИнформации.EmailКлиента);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;

КонецПроцедуры

// Функция возвращает список имен «ключевых» реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	
	Возврат Результат;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()

// Функция - Получить структуру XDTO телефона
//
// Параметры:
//  Телефон	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтруктуру_XDTO(Представление, ТипКИ)
	
	Если НЕ ЗначениеЗаполнено(Представление) Тогда
		Возврат Неопределено;
	КонецЕсли;	
		Объект_XDTO = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOПоПредставлению(Представление, ТипКИ);
	Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда 
		Если НЕ ЗначениеЗаполнено(Объект_XDTO.Состав.Номер) Тогда 
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Объект_XDTO;
	
КонецФункции

// Процедура - Заполнить телефон 
//
// Параметры:
//  НовыйЭлемент		 - 	 - 
//  Объект_XDTO_Телефон	 - 	 - 
//
Процедура ЗаполнитьТелефон(НовыйЭлемент, Знач Объект_XDTO_Телефон, Знач ВидКИ)
	
	Если Объект_XDTO_Телефон = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока 						= НовыйЭлемент.КонтактнаяИнформация.Добавить();
	НоваяСтрока.Тип 					= Перечисления.ТипыКонтактнойИнформации.Телефон;
	НоваяСтрока.Вид 					= ВидКИ;
	НоваяСтрока.НомерТелефона 			= СокрЛП(Объект_XDTO_Телефон.Состав.КодСтраны) + СокрЛП(Объект_XDTO_Телефон.Состав.КодГорода) + СокрЛП(СтрЗаменить(Объект_XDTO_Телефон.Состав.Номер,"-",""));
	НоваяСтрока.НомерТелефонаБезКодов 	= Объект_XDTO_Телефон.Состав.Номер;
	
	НоваяСтрока.ЗначенияПолей 			= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияXMLПоПредставлению(Объект_XDTO_Телефон.Представление,ВидКИ);
	НоваяСтрока.Значение 				= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Объект_XDTO_Телефон.Представление, ВидКИ);

	НоваяСтрока.Представление			= Объект_XDTO_Телефон.Представление;
	// НоваяСтрока.ЗначенияПолей			= УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(Объект_XDTO_Телефон);
	
КонецПроцедуры

// Процедура - Заполнить email 
//
// Параметры:
//  НовыйЭлемент		 - 	 - 
//  Объект_XDTO_Email	 - 	 - 
//
Процедура ЗаполнитьEmail(НовыйЭлемент, Знач Объект_XDTO_Email, Знач ВидКИ)
	
	Если Объект_XDTO_Email = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	НоваяСтрока 				= НовыйЭлемент.КонтактнаяИнформация.Добавить();
	НоваяСтрока.Тип 			= Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	НоваяСтрока.Вид 			= ВидКИ;
	НоваяСтрока.АдресЭП 		= Объект_XDTO_Email.Представление;
	НоваяСтрока.ЗначенияПолей 	= УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(Объект_XDTO_Email);
	НоваяСтрока.Значение 		= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Объект_XDTO_Email.Представление, ВидКИ);
	НоваяСтрока.Представление 	= НоваяСтрока.АдресЭП;
	
КонецПроцедуры

// Процедура - Заполнить адрес
//
// Параметры:
//  НовыйЭлемент		 - 	 - 
//  Объект_XDTO_Адрес	 - 	 - 
//  ВидКИ				 - 	 - 
//
Процедура ЗаполнитьАдрес(НовыйЭлемент, Знач Объект_XDTO_Адрес, Знач ВидКИ)
	
	Если Объект_XDTO_Адрес = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	НоваяСтрока 				= НовыйЭлемент.КонтактнаяИнформация.Добавить();
	НоваяСтрока.Тип 			= Перечисления.ТипыКонтактнойИнформации.Адрес;
	НоваяСтрока.Вид 			= ВидКИ;
	НоваяСтрока.Страна 			= ?(Объект_XDTO_Адрес.Состав.Страна = Неопределено, "", Объект_XDTO_Адрес.Состав.Страна);
	Если 	НоваяСтрока.Страна = "Россия" Тогда 
		НоваяСтрока.Регион 			= ?(Объект_XDTO_Адрес.Состав.Состав.СубъектРФ = Неопределено, "", Объект_XDTO_Адрес.Состав.Состав.СубъектРФ);	
		НоваяСтрока.Город 			= ?(Объект_XDTO_Адрес.Состав.Состав.Город = Неопределено, "", Объект_XDTO_Адрес.Состав.Состав.Город);
		НоваяСтрока.ЗначенияПолей 	= УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(Объект_XDTO_Адрес);
		НоваяСтрока.Значение 		= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Объект_XDTO_Адрес.Представление, ВидКИ);
		НоваяСтрока.Представление 	= Объект_XDTO_Адрес.Представление;
	Иначе 
		НоваяСтрока.Представление 	= ?(Объект_XDTO_Адрес.Представление <> "", Объект_XDTO_Адрес.Представление, НоваяСтрока.Страна); 
	КонецЕсли;
	
КонецПроцедуры

// Функция приводит текстовый формат представления даты к типу дата, поддерживаемые маски ####.##.##., ##.##.####
//
Функция ПривестиКТипуДата(СтрПредст)
	
	Попытка 
		
		Если Найти(СтрПредст, ".") <> 0 Тогда 
			СписокЗн = СтрокаВСписок(СтрПредст, ".");
		Иначе
			СписокЗн = СтрокаВСписок(СтрПредст, "/");
		КонецЕсли;
		
		Если СписокЗн.Количество() = 0 Тогда
			Возврат Неопределено;
		Иначе
			
			Если СтрДлина(СписокЗн[0]) > 2 Тогда
				Возврат Дата(СписокЗн[0] + Формат(СписокЗн[1], "ЧЦ=2; ЧВН=") + Формат(СписокЗн[2], "ЧЦ=2; ЧВН="));
			Иначе
				Возврат Дата(Формат(СписокЗн[2], "ЧЦ=2; ЧВН=") + Формат(СписокЗн[1], "ЧЦ=2; ЧВН=") + СписокЗн[0]);
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		Возврат Неопределено;
	КонецПопытки;	
	
КонецФункции	

// Функция разбивает строку на подстроки в списке 
//
Функция СтрокаВСписок(Строка,Разделитель = ",")
	
	ПоследнийЭлементПуст = Ложь;
	Стр = Строка;
	Список = Новый СписокЗначений;
	
	ДлинаСтроки = СтрДлина(Разделитель) - 1;
	
	Пока СтрДлина(Стр) > 0 Цикл
		ИндексРезделителя = Найти(Стр, Разделитель);
		Если ИндексРезделителя > 0 Тогда
			ВрСтр = СокрЛП(Лев(Стр, ИндексРезделителя - 1));
			Стр = СокрЛП(Прав(Стр, СтрДлина(Стр) - ИндексРезделителя - ДлинаСтроки));
			Если СтрДлина(Стр) = 0 Тогда
				ПоследнийЭлементПуст = Истина;
			КонецЕсли;
		Иначе
			// Последняя
			ВрСтр = СокрЛП(Стр);
			Стр = "";
		КонецЕсли;
		
		Если (Лев(ВрСтр, 1) = """") И (Прав(ВрСтр, 1) = """") Тогда
			ВрСтр = Сред(ВрСтр, 2, СтрДлина(ВрСтр) - 2);
		КонецЕсли;
		
		Список.Добавить(ВрСтр);
		
	КонецЦикла;
	
	Если ПоследнийЭлементПуст Тогда
		Список.Добавить("");
	КонецЕсли;	
	
	Возврат(Список);
	
КонецФункции

// Функция, возвращает признак розничного покупателя.
//
Функция ЭтоРозничныйПокупатель(Клиент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Клиент.РозничныйПокупатель;	
	
КонецФункции

Функция ПолучитьГруппуКлиенты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ЭтоГруппа = ИСТИНА
	|	И Контрагенты.Наименование = ""Клиенты""";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

// Процедура, формирует полисы страхования.
//
Процедура СформироватьПолисыСтрахования(СтрокаТаблицы)
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.НомерПолиса) И ЗначениеЗаполнено(СтрокаТаблицы.СтраховаяКомпания) Тогда 
		ВыборкаСтраховыхПолисов = Справочники.ПолисыМедицинскогоСтрахования.Выбрать( , , Новый Структура("Контрагент", СтрокаТаблицы.Клиент));
		ПолноеСовпадение = Ложь;
		Пока ВыборкаСтраховыхПолисов.Следующий() Цикл
			Если ВыборкаСтраховыхПолисов.СтраховаяКомпания = СтрокаТаблицы.СтраховаяКомпания Тогда
				Если ВыборкаСтраховыхПолисов.НомерПолиса = СокрЛП(СтрокаТаблицы.НомерПолиса) Тогда 
					Если ЗначениеЗаполнено(СтрокаТаблицы.СерияПолиса) Тогда 
						Если ВыборкаСтраховыхПолисов.СерияПолиса = СокрЛП(СтрокаТаблицы.СерияПолиса) Тогда								 
							ПолноеСовпадение = Истина;
							ПолисДляОбновленияДанных = ВыборкаСтраховыхПолисов.ПолучитьОбъект();
							Прервать;
						КонецЕсли;
					Иначе 
						ПолноеСовпадение = Истина;
						ПолисДляОбновленияДанных = ВыборкаСтраховыхПолисов.ПолучитьОбъект();
						Прервать;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		Если НЕ ПолноеСовпадение Тогда 
			// Создаем полис медицинского страхования
			НовыйОбъектПМС = Справочники.ПолисыМедицинскогоСтрахования.СоздатьЭлемент();
			НовыйОбъектПМС.Контрагент 			= СтрокаТаблицы.Клиент;
			НовыйОбъектПМС.ТипПолиса 			= СтрокаТаблицы.ТипПолиса;
			НовыйОбъектПМС.СтраховаяКомпания 	= СтрокаТаблицы.СтраховаяКомпания;
			НовыйОбъектПМС.СерияПолиса 			= ?(ЗначениеЗаполнено(СтрокаТаблицы.СерияПолиса), СтрокаТаблицы.СерияПолиса, "");
			НовыйОбъектПМС.НомерПолиса 			= СтрокаТаблицы.НомерПолиса;
			НовыйОбъектПМС.ДанаНачала 			= СтрокаТаблицы.НачалоДействияПолиса;
			НовыйОбъектПМС.ДатаОкончания 		= СтрокаТаблицы.КонецДействияПолиса;
			Попытка
				НовыйОбъектПМС.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неудалось создать полис медицинского страхования для пациента: " + Строка(СтрокаТаблицы.Клиент));
			КонецПопытки;					
		КонецЕсли;
		
		Если ПолноеСовпадение = Истина И ПолисДляОбновленияДанных <> Неопределено Тогда 
			// Будем обновлять данные полиса. 
			Если ЗначениеЗаполнено(ПолисДляОбновленияДанных.ДанаНачала) = Ложь И ЗначениеЗаполнено(СтрокаТаблицы.НачалоДействияПолиса) = Истина Тогда
				ПолисДляОбновленияДанных.ДанаНачала = СтрокаТаблицы.НачалоДействияПолиса;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПолисДляОбновленияДанных.ДатаОкончания) = Ложь И ЗначениеЗаполнено(СтрокаТаблицы.КонецДействияПолиса) = Истина Тогда
				ПолисДляОбновленияДанных.ДатаОкончания = СтрокаТаблицы.КонецДействияПолиса;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПолисДляОбновленияДанных.ТипПолиса) = Ложь И ЗначениеЗаполнено(СтрокаТаблицы.ТипПолиса) = Истина Тогда
				ПолисДляОбновленияДанных.ТипПолиса = СтрокаТаблицы.ТипПолиса;
			КонецЕсли;							
			ПолисДляОбновленияДанных.Записать();
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

// Функция - Получить папку по типу контрагента
//
Функция ПолучитьПапкуПоТипу(ТипКонтрагента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("ТипКонтрагента"	, ТипКонтрагента);
	Запрос.Параметры.Вставить("Наименование"	, "%" + Строка(ТипКонтрагента) + "%");	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Контрагенты.Ссылка КАК Ссылка,
	               |	1 КАК Приоритет,
	               |	Контрагенты.ТипКонтрагента КАК ТипКонтрагента
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.ЭтоГруппа = ИСТИНА
	               |	И Контрагенты.ТипКонтрагента = &ТипКонтрагента
				   |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Контрагенты.Ссылка,
	               |	2,
	               |	Контрагенты.ТипКонтрагента
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.ЭтоГруппа = ИСТИНА
	               |	И Контрагенты.Наименование ПОДОБНО &Наименование
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приоритет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СоздатьРодителя 			= Ложь;	
	АктуализироватьРодителя 	= Ложь;
	ГруппаКонтрагентов 			= Неопределено;
	ГруппаКонтрагентов_Объект 	= Неопределено;

	Если Выборка.Следующий() Тогда
		ГруппаКонтрагентов = Выборка.Ссылка;
		Если НЕ ЗначениеЗаполнено(Выборка.ТипКонтрагента) Тогда 
			АктуализироватьРодителя = Истина;
		КонецЕсли;	
	Иначе
		СоздатьРодителя = Истина;
	КонецЕсли;
	
	Если СоздатьРодителя Тогда 
		ГруппаКонтрагентов_Объект 					= Справочники.Контрагенты.СоздатьГруппу();
	ИначеЕсли АктуализироватьРодителя Тогда      
		ГруппаКонтрагентов_Объект 					= ГруппаКонтрагентов.ПолучитьОбъект();
	КонецЕсли;
	
	Если НЕ ГруппаКонтрагентов_Объект = Неопределено Тогда 
		ГруппаКонтрагентов_Объект.Наименование 		= Строка(ТипКонтрагента);
		ГруппаКонтрагентов_Объект.ТипКонтрагента 	= ТипКонтрагента;
		// ГруппаКонтрагентов_Объект.Автокоррекция 	= 1;
		Попытка
			ГруппаКонтрагентов_Объект.Записать();
		Исключение
			
		КонецПопытки;	
		Возврат ГруппаКонтрагентов_Объект.Ссылка;
	Иначе 
		Возврат ГруппаКонтрагентов;
	КонецЕсли;
	
КонецФункции

// Процедура, заполнить медицинскую карту.
//
// Параметры:
//  НомерАмбулаторнойКарты	 - 	 - 
//  ВидМедицинскихКарт		 - 	 - 
//  ДатаЗавершения			 - 	 - 
//  НовыйЭлемент			 - 	 - 
//
Функция ЗаполнитьМедицинскуюКарту(НомерАмбулаторнойКарты, ВидМедицинскихКарт, ДатаРегистрацииМедКарты, ДатаЗавершения, НовыйЭлемент, НаименованиеКлиента)
	
	МедКарта = Справочники.МедицинскиеКарты.НайтиПоКоду(СокрЛП(НомерАмбулаторнойКарты));
	Если НЕ МедКарта.Пустая() Тогда
		Если МедКарта.ВладелецКарты <> НовыйЭлемент Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Мед. карта № "+СокрЛП(НомерАмбулаторнойКарты)+" принадлежит другому владельцу!");
			Возврат Неопределено;
		Иначе	
			МедКартаОбъект = МедКарта.ПолучитьОбъект();	
		КонецЕсли;	
	Иначе								
		
		МедКартаОбъект = Справочники.МедицинскиеКарты.СоздатьЭлемент();
		
	КонецЕсли;							
	
	МедКартаОбъект.Код					 = НомерАмбулаторнойКарты;
	МедКартаОбъект.ДатаРегистрации		 = ДатаРегистрацииМедКарты;			
	МедКартаОбъект.ДатаЗакрытия			 = ДатаЗавершения;
	МедКартаОбъект.ВидМедицинскойКарты	 = ?(ЗначениеЗаполнено(ВидМедицинскихКарт), ВидМедицинскихКарт, Справочники.ВидыМедицинскихКарт.ОсновнойВидМедицинскойКарты);		
	МедКартаОбъект.ВладелецКарты		 = НовыйЭлемент;
	МедКартаОбъект.ДополнительныеСвойства.Вставить("ВладелецКартыНаименование", НаименованиеКлиента);
	МедКартаОбъект.Записать();
 
	Справочники.МедицинскиеКарты.УстановитьМестоположениеМедицинскойКарты(МедКартаОбъект.Ссылка, Справочники.Местоположения.ВКлинике);
	
	Возврат МедКартаОбъект.Ссылка;
		
КонецФункции

// Функция, находит или если не найдена группа, то создает ее.
//
// Параметры:
//  РодительНаименование	 - Строка 				- Наименование группы которую ищем. 
//  РодительВерхнегоУровня	 - СправочникСсылка 	- Ссылка на справочник родителя группы которую ищем.
//  ТипНоменклатуры			 - ПеречислениеСсылка 	- Перечисление типов номенклатуры. 
// 
// Возвращаемое значение:
//  Родитель - Ссылка на группу номенклатуры.
//
Функция НайтиСоздатьГруппу(РодительНаименование, РодительВерхнегоУровня = Неопределено)
	
	Родитель = Справочники.Контрагенты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ЭтоГруппа = ИСТИНА
	|	И Контрагенты.Наименование = &Наименование
	|	И ВЫБОР
	|			КОГДА &РодительВерхнегоУровня <> НЕОПРЕДЕЛЕНО
	|				ТОГДА Контрагенты.Родитель = &РодительВерхнегоУровня
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Наименование"          , РодительНаименование);
	Запрос.УстановитьПараметр("РодительВерхнегоУровня", РодительВерхнегоУровня);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Родитель = Выборка.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Родитель) Тогда
		
		// Создать родителя
		РодительОбъект                 = Справочники.Контрагенты.СоздатьГруппу();
		РодительОбъект.Наименование    = РодительНаименование;
		Если ЗначениеЗаполнено(РодительВерхнегоУровня) Тогда 
			РодительОбъект.Родитель = РодительВерхнегоУровня;
		КонецЕсли;
		
		РодительОбъект.Записать();
		Родитель = РодительОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат Родитель;
	
КонецФункции

// Функция, создает клиента.
//
Функция СоздатьКлиента(Фамилия, Имя, Отчество = "", Телефон, Email, СтруктурнаяЕдиница = Неопределено, ДатаРождения, Пол = Неопределено, Адрес = Неопределено) Экспорт
	
	КлиентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	КлиентОбъект.Фамилия  			= Фамилия;
	КлиентОбъект.Имя      			= Имя;
	КлиентОбъект.Отчество 			= Отчество;
	КлиентОбъект.Наименование 		= КлиентОбъект.Фамилия + ?(ЗначениеЗаполнено(КлиентОбъект.Фамилия), " ", "") + КлиентОбъект.Имя + ?(ЗначениеЗаполнено(КлиентОбъект.Имя), " ", "") + КлиентОбъект.Отчество;
	КлиентОбъект.ТипКонтрагента 	= Перечисления.ТипыКонтрагентов.Клиенты;
	КлиентОбъект.ЮрФизЛицо 			= Перечисления.ЮрФизЛицо.ФизЛицо;
	КлиентОбъект.ДатаРегистрации 	= ТекущаяДатаСеанса();
	КлиентОбъект.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
	КлиентОбъект.Родитель 			= ПолучитьПапкуПоТипу(Перечисления.ТипыКонтрагентов.Клиенты);
	КлиентОбъект.ПолКлиента 		= ?(ЗначениеЗаполнено(Пол), Пол, ОбщегоНазначенияСтоматология.ОпределитьПолКлиента(Фамилия, Имя, Отчество));
	
	Попытка
		Если ЗначениеЗаполнено(ДатаРождения) Тогда
			КлиентОбъект.ДатаРожденияКлиента = Дата(Сред(ДатаРождения,1,4), Сред(ДатаРождения,6,2), Сред(ДатаРождения,9)); 
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Телефон) Тогда
		УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(Телефон, Новый СписокЗначений);
		ДобавитьНомерТелефонаВКонтактнуюИнформациюКлиента(КлиентОбъект, Телефон);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Email) Тогда
		ДобавитьEmailВКонтактнуюИнформациюКлиента(КлиентОбъект, Email);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Адрес) Тогда
		Результат = РаботаСАдресами.КонвертироватьАдресИзJSONВXML(Адрес, "", Перечисления.ТипыКонтактнойИнформации.Адрес);
		ЗаполнитьАдрес(КлиентОбъект, Результат, Справочники.ВидыКонтактнойИнформации.АдресКлиента);
	КонецЕсли;
	
	Попытка
		КлиентОбъект.Записать();
	Исключение
		Инф = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат КлиентОбъект.Ссылка;
	
КонецФункции

// Процедура, добавляет телефон в табличную часть "КонтактнаяИнформация".
//
Процедура ДобавитьНомерТелефонаВКонтактнуюИнформациюКлиента(КлиентОбъект, НомерТелефона) Экспорт
	
	ОбъектXDTOИнформации 					= УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOПоПредставлению(НомерТелефона, Справочники.ВидыКонтактнойИнформации.ТелефонКлиента);
	НоваяСтрока 							= КлиентОбъект.КонтактнаяИнформация.Добавить();				
	НоваяСтрока.Тип 						= Перечисления.ТипыКонтактнойИнформации.Телефон;
	НоваяСтрока.Вид 						= Справочники.ВидыКонтактнойИнформации.ТелефонКлиента;
	НоваяСтрока.НомерТелефона 				= "" + ОбъектXDTOИнформации.Состав.КодСтраны + ОбъектXDTOИнформации.Состав.КодГорода + ОбъектXDTOИнформации.Состав.Номер;
	НоваяСтрока.НомерТелефонаБезКодов 		= ОбъектXDTOИнформации.Состав.Номер; 
	НоваяСтрока.НомерТелефонаБезКодаСтраны 	= ОбъектXDTOИнформации.Состав.КодГорода + ОбъектXDTOИнформации.Состав.Номер;		
	НоваяСтрока.НомерТелефонаПоследниеЦифры	= Прав(СокрЛП(ОбъектXDTOИнформации.Состав.Номер), 4);
	НоваяСтрока.Представление 				= НомерТелефона; // ОбъектXDTOИнформации.Представление;
	НоваяСтрока.ЗначенияПолей 				= УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(ОбъектXDTOИнформации);
	
КонецПроцедуры

// Процедура, добавляет email в табличную часть "КонтактнаяИнформация".
//
Процедура ДобавитьEmailВКонтактнуюИнформациюКлиента(КлиентОбъект, АдресЭП) Экспорт
	
	ОбъектXDTOИнформации      = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOПоПредставлению(АдресЭП, Справочники.ВидыКонтактнойИнформации.EmailКлиента);
	НайденныеСтроки 		  = КлиентОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Справочники.ВидыКонтактнойИнформации.EmailКлиента));
	НоваяСтрока 			  = ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0], КлиентОбъект.КонтактнаяИнформация.Добавить());
	НоваяСтрока.Тип 		  = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	НоваяСтрока.Вид 		  = Справочники.ВидыКонтактнойИнформации.EmailКлиента;
	НоваяСтрока.АдресЭП 	  = АдресЭП;
	НоваяСтрока.ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(ОбъектXDTOИнформации);
	НоваяСтрока.Представление = ОбъектXDTOИнформации.Представление;
	
КонецПроцедуры

#КонецОбласти

#Область ИсторияВзаимодействий

// Функция, формирует таблицу истории взаимодействия клиента.
//
Функция ПолучитьИсториюВзаимодействияКлиента(ПараметрыДанных, РежимПодробно = Ложь, Фильтры = Неопределено) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|ПОМЕСТИТЬ ВТТелефоны
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
	|	И КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ОбъектыОтбора
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Заявки.Ссылка
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|ГДЕ
	|	Заявки.ОсновнойКлиент = &Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КонтактыМессенджеров.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ТаблицаИдентификаторовКонтактовМессенджеров
	|ИЗ
	|	РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
	|ГДЕ
	|	КонтактыМессенджеров.ОбъектИдентификации В
	|			(ВЫБРАТЬ
	|				ОбъектыОтбора.Ссылка КАК Ссылка
	|			ИЗ
	|				ОбъектыОтбора КАК ОбъектыОтбора)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТаблицаИдентификаторовКонтактовМессенджеров.Идентификатор КАК Идентификатор,
	|	ЕСТЬNULL(КонтактыМессенджеров.ФотоКлиента, """") КАК Фото
	|ПОМЕСТИТЬ ВтКонтактыМессенджеровИФото
	|ИЗ
	|	ТаблицаИдентификаторовКонтактовМессенджеров КАК ТаблицаИдентификаторовКонтактовМессенджеров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
	|		ПО ТаблицаИдентификаторовКонтактовМессенджеров.Идентификатор = КонтактыМессенджеров.Идентификатор
	|			И (КонтактыМессенджеров.ФотоКлиента <> """")
	|			И (КонтактыМессенджеров.Идентификатор В
	|				(ВЫБРАТЬ
	|					ТаблицаИдентификаторовКонтактовМессенджеров.Идентификатор КАК идентификатор
	|				ИЗ
	|					ТаблицаИдентификаторовКонтактовМессенджеров КАК ТаблицаИдентификаторовКонтактовМессенджеров))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Заметки.Сделка КАК Взаимодействие,
	|	Заметки.Период КАК Дата,
	|	""Заметка"" КАК ТипСобытия,
	|	ВЫБОР
	|		КОГДА Заметки.Закреплена = ИСТИНА
	|			ТОГДА ""Закреплено""
	|		ИНАЧЕ ""История""
	|	КОНЕЦ КАК ТипВзаимодействия,
	|	Заметки.Автор КАК Автор,
	|	NULL КАК Начало,
	|	NULL КАК Комментарий,
	|	Заметки.Закреплена КАК Статус,
	|	Заметки.ИД КАК ИдЗаметки,
	|	NULL КАК СтатусПисьма,
	|	ВЫБОР
	|		КОГДА Заметки.Закреплена = ИСТИНА
	|			ТОГДА 99
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Порядок,
	|	NULL КАК Сотрудник,
	|	NULL КАК СтруктурнаяЕдиница,
	|	NULL КАК ВидОсмотра,
	|	NULL КАК ПричинаНаправления,
	|	NULL КАК ТекстСообщения,
	|	Заметки.Заметка КАК Заметка,
	|	NULL КАК ПереходСЭтапа,
	|	NULL КАК ПереходНаЭтап,
	|	NULL КАК Длительность,
	|	NULL КАК Окончание,
	|	NULL КАК ФайлЗаписи,
	|	NULL КАК URLЗаписи,
	|	NULL КАК ВзаимодействиеИД
	|ИЗ
	|	РегистрСведений.Заметки КАК Заметки
	|ГДЕ
	|	(Заметки.Объект = &Контрагент
	|			ИЛИ Заметки.Объект = &Заявка)
	|	И &ВыводитьЗаметки
	|	И Заметки.Сделка = &Сделка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Событие.Ссылка,
	|	Событие.Дата,
	|	""Событие"",
	|	ВЫБОР
	|		КОГДА Событие.Дата > &ТекущаяДата
	|			ТОГДА ""Запланировано""
	|		ИНАЧЕ ""История""
	|	КОНЕЦ,
	|	Событие.АвторДокумента,
	|	NULL,
	|	NULL,
	|	Событие.Статус,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА Событие.Дата > &ТекущаяДата
	|			ТОГДА 9
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	Событие.Врач,
	|	Событие.СтруктурнаяЕдиница,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.Событие КАК Событие
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Прием КАК Прием
	|		ПО Событие.Ссылка = Прием.ДокументОснование
	|ГДЕ
	|	НЕ Событие.ПометкаУдаления
	|	И Событие.Проведен
	|	И Событие.Контрагент = &Контрагент
	|	И Прием.Ссылка ЕСТЬ NULL
	|	И (Событие.Сделка = &Сделка
	|			ИЛИ Событие.Врач = ВЫРАЗИТЬ(&Сделка КАК Справочник.Сделки).Врач
	|				И Событие.Дата >= &ТекущаяДата)
	|	И &ВыводитьСобытия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Прием.Ссылка,
	|	Прием.Дата,
	|	""Прием"",
	|	ВЫБОР
	|		КОГДА Прием.ВремяНачалаПриема = ДАТАВРЕМЯ(1, 1, 1)
	|					И Прием.Дата > &ТекущаяДата
	|				ИЛИ Прием.ВремяНачалаПриема > &ТекущаяДата
	|			ТОГДА ""Запланировано""
	|		ИНАЧЕ ""История""
	|	КОНЕЦ,
	|	Прием.АвторДокумента,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА Прием.ПометкаУдаления = ИСТИНА
	|			ТОГДА ""(Удален)""
	|		КОГДА Событие.Статус ЕСТЬ NULL
	|				И Прием.Проведен = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОкончен)
	|		КОГДА Событие.Статус ЕСТЬ NULL
	|				И Прием.Проведен = ЛОЖЬ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемНачат)
	|		ИНАЧЕ Событие.Статус
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА Прием.ВремяНачалаПриема = ДАТАВРЕМЯ(1, 1, 1)
	|					И Прием.Дата > &ТекущаяДата
	|				ИЛИ Прием.ВремяНачалаПриема > &ТекущаяДата
	|			ТОГДА 9
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	Прием.Сотрудник,
	|	Прием.СтруктурнаяЕдиница,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.Прием КАК Прием
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Событие КАК Событие
	|		ПО Прием.ДокументОснование = Событие.Ссылка
	|ГДЕ
	|	Прием.Контрагент = &Контрагент
	|	И (Прием.Сделка = &Сделка
	|			ИЛИ Прием.Ссылка = &СделкаПредыдущийПрием
	|			ИЛИ Прием.Сотрудник = ВЫРАЗИТЬ(&Сделка КАК Справочник.Сделки).Врач
	|				И Прием.Дата >= &ТекущаяДата)
	|	И &ВыводитьПриемы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПланЛечения.Ссылка,
	|	ПланЛечения.Дата,
	|	""ПланЛечения"",
	|	""История"",
	|	ПланЛечения.АвторДокумента,
	|	NULL,
	|	NULL,
	|	ПланЛечения.Статус,
	|	NULL,
	|	NULL,
	|	0,
	|	ПланЛечения.Сотрудник,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.ПланЛечения КАК ПланЛечения
	|ГДЕ
	|	НЕ ПланЛечения.ПометкаУдаления
	|	И ПланЛечения.Проведен
	|	И ПланЛечения.Контрагент = &Контрагент
	|	И &ВыводитьПланыЛечения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтатусыСообщений.РассылкаСообщений,
	|	ВЫБОР
	|		КОГДА СтатусыСообщений.ДатаОтправки = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА СтатусыСообщений.ДатаУстановкиСтатуса
	|		ИНАЧЕ СтатусыСообщений.ДатаОтправки
	|	КОНЕЦ,
	|	""SMS"",
	|	""История"",
	|	СтатусыСообщений.РассылкаСообщений.АвторДокумента,
	|	NULL,
	|	NULL,
	|	СтатусыСообщений.СтадияДоставки,
	|	NULL,
	|	NULL,
	|	0,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СтатусыСообщений.ТекстСообщения,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.СтатусыСообщений КАК СтатусыСообщений
	|ГДЕ
	|	СтатусыСообщений.Получатель = &Контрагент
	|	И &ВыводитьСообщения
	|	И (СтатусыСообщений.СервисРассылки ССЫЛКА Справочник.СервисыРассылки
	|			ИЛИ СтатусыСообщений.СервисРассылки ССЫЛКА Справочник.ВнешниеСистемы
	|				И СтатусыСообщений.СервисРассылки.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Wallet))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка,
	|	ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка.Дата,
	|	""Письмо"",
	|	""История"",
	|	ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка.Автор,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка.СтатусПисьма,
	|	0,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.ЭлектронноеПисьмоИсходящее.ПолучателиПисьма КАК ЭлектронноеПисьмоИсходящееПолучателиПисьма
	|ГДЕ
	|	&ВыводитьСообщения
	|	И НЕ ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка.ПометкаУдаления
	|	И ЭлектронноеПисьмоИсходящееПолучателиПисьма.Контакт = &Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка,
	|	Контрагенты.ДатаРегистрации,
	|	""ДатаРегистрацииКлиента"",
	|	""История"",
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент
	|	И &ВыводитьДатуРегистрации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗадачаПользователей.Ссылка,
	|	ВЫБОР
	|		КОГДА ЗадачаПользователей.Выполнена
	|			ТОГДА ЗадачаПользователей.ДатаИсполнения
	|		ИНАЧЕ ЗадачаПользователей.ЗадачаНазначеннаяДата
	|	КОНЕЦ,
	|	""Задача"",
	|	ВЫБОР
	|		КОГДА ЗадачаПользователей.Выполнена
	|			ТОГДА ""История""
	|		КОГДА ЗадачаПользователей.ЗадачаНазначеннаяДата < &ТекущаяДата
	|			ТОГДА ""Просроченно""
	|		ИНАЧЕ ""Запланировано""
	|	КОНЕЦ,
	|	ЗадачаПользователей.ЗадачаАвтор,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ЗадачаПользователей.Выполнена
	|			ТОГДА 0
	|		КОГДА ЗадачаПользователей.ЗадачаНазначеннаяДата < &ТекущаяДата
	|			ТОГДА 10
	|		ИНАЧЕ 9
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Задача.Взаимодействие КАК ЗадачаПользователей
	|ГДЕ
	|	ЗадачаПользователей.Контрагент = &Контрагент
	|	И &ВыводитьЗадачи
	|	И ЗадачаПользователей.Сделка = &Сделка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НарядЗаказ.Ссылка,
	|	НарядЗаказ.Дата,
	|	""НарядЗаказ"",
	|	ВЫБОР
	|		КОГДА НарядЗаказ.Дата = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ НарядЗаказ.Дата > &ТекущаяДата
	|			ТОГДА ""Запланировано""
	|		ИНАЧЕ ""История""
	|	КОНЕЦ,
	|	НарядЗаказ.АвторДокумента,
	|	NULL,
	|	NULL,
	|	НарядЗаказ.Статус,
	|	NULL,
	|	NULL,
	|	0,
	|	НарядЗаказ.Сотрудник,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.НарядЗаказ КАК НарядЗаказ
	|ГДЕ
	|	НарядЗаказ.ПометкаУдаления = ЛОЖЬ
	|	И &ВыводитьНарядЗаказы
	|	И НарядЗаказ.Контрагент = &Контрагент
	|	И НарядЗаказ.Проведен = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрофосмотрыСрезПоследних.Специализация.Представление,
	|	ПрофосмотрыСрезПоследних.ДатаЗапланированная,
	|	""Профосмотр"",
	|	ВЫБОР
	|		КОГДА ПрофосмотрыСрезПоследних.ДатаЗапланированная = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ПрофосмотрыСрезПоследних.ДатаЗапланированная > &ТекущаяДата
	|			ТОГДА ""Запланировано""
	|		ИНАЧЕ ""История""
	|	КОНЕЦ,
	|	NULL,
	|	ПрофосмотрыСрезПоследних.Период,
	|	ПрофосмотрыСрезПоследних.Комментарий,
	|	ПрофосмотрыСрезПоследних.Статус,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ПрофосмотрыСрезПоследних.ДатаЗапланированная = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ПрофосмотрыСрезПоследних.ДатаЗапланированная > &ТекущаяДата
	|			ТОГДА 9
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ПрофосмотрыСрезПоследних.Сотрудник,
	|	ПрофосмотрыСрезПоследних.СтруктурнаяЕдиница,
	|	ПрофосмотрыСрезПоследних.ВидОсмотра,
	|	ПрофосмотрыСрезПоследних.ПричинаНаправления,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.Профосмотры.СрезПоследних(
	|			,
	|			Контрагент = &Контрагент
	|				И Прием.Сделка = &ПрофосмотрСделка) КАК ПрофосмотрыСрезПоследних
	|ГДЕ
	|	ЛОЖЬ
	|	И ПрофосмотрыСрезПоследних.ДатаЗапланированная <= ДОБАВИТЬКДАТЕ(&ТекущаяДата, НЕДЕЛЯ, 1)
	|	И (ПрофосмотрыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.НапомнитьПозже)
	|			ИЛИ ПрофосмотрыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.Запланирован)
	|			ИЛИ ПрофосмотрыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.Отказался))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СделкиИсторияИзмененияЭтапов.Ссылка,
	|	СделкиИсторияИзмененияЭтапов.Дата,
	|	""СтатусСделки"",
	|	""История"",
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СделкиИсторияИзмененияЭтапов.ПереходСЭтапа,
	|	СделкиИсторияИзмененияЭтапов.ПереходНаЭтап,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Справочник.Сделки.ИсторияИзмененияЭтапов КАК СделкиИсторияИзмененияЭтапов
	|ГДЕ
	|	СделкиИсторияИзмененияЭтапов.Ссылка.Контрагент = &Контрагент
	|	И СделкиИсторияИзмененияЭтапов.Ссылка = &Сделка
	|	И &ВыводитьСделки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсторияВызовов.IDЗвонка,
	|	ИсторияВызовов.НачалоВызова,
	|	ВЫБОР
	|		КОГДА ИсторияВызовов.НаправлениеВызова = ЗНАЧЕНИЕ(Перечисление.ВариантыНаправленияВызова.Исходящий)
	|			ТОГДА ""ИсходящийЗвонок""
	|		КОГДА ИсторияВызовов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗвонка.Пропущен)
	|			ТОГДА ""ПропущенныйЗвонок""
	|		ИНАЧЕ ""ВходящийЗвонок""
	|	КОНЕЦ,
	|	""История"",
	|	ИсторияВызовов.Пользователь,
	|	ВЫБОР
	|		КОГДА ИсторияВызовов.НачалоРазговора <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ИсторияВызовов.НачалоРазговора
	|		ИНАЧЕ ИсторияВызовов.НачалоВызова
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВЫРАЗИТЬ(ИсторияВызовов.Заметка КАК СТРОКА(200)),
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ИсторияВызовов.НачалоРазговора <> ДАТАВРЕМЯ(1, 1, 1)
	|				И ИсторияВызовов.ОкончаниеЗвонка <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РАЗНОСТЬДАТ(ИсторияВызовов.НачалоРазговора, ИсторияВызовов.ОкончаниеЗвонка, СЕКУНДА)
	|		КОГДА ИсторияВызовов.НачалоВызова <> ДАТАВРЕМЯ(1, 1, 1)
	|				И ИсторияВызовов.ОкончаниеЗвонка <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РАЗНОСТЬДАТ(ИсторияВызовов.НачалоВызова, ИсторияВызовов.ОкончаниеЗвонка, СЕКУНДА)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ИсторияВызовов.ОкончаниеЗвонка,
	|	ИсторияВызовов.ФайлЗаписи,
	|	ИсторияВызовов.URLЗаписи,
	|	NULL
	|ИЗ
	|	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
	|ГДЕ
	|	ИсторияВызовов.НомерТелефона В(&МассивНомеровТелефонов)
	|	И &ВыводитьЗвонки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка,
	|	&ДатаРождения,
	|	""ДеньРожденияКлиента"",
	|	ВЫБОР
	|		КОГДА &ДатаРождения = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	|			ТОГДА ""История""
	|		ИНАЧЕ ""Запланировано""
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА &ДатаРождения = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	|			ТОГДА 0
	|		ИНАЧЕ 9
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент
	|	И &ДатаРождения >= НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	|	И &ДатаРождения < ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), НЕДЕЛЯ, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЖурналСообщений.ВнешняяСистема,
	|	ЖурналСообщений.ДатаСообщения,
	|	ВЫБОР
	|		КОГДА ЖурналСообщений.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.GreenApi)
	|			ТОГДА ""ДиалогWhatsApp""
	|		КОГДА ЖурналСообщений.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Telegram)
	|			ТОГДА ""ДиалогTelegram""
	|		КОГДА ЖурналСообщений.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Viber)
	|			ТОГДА ""ДиалогViber""
	|		КОГДА ЖурналСообщений.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.VkontakteApi)
	|			ТОГДА ""ДиалогVK""
	|		ИНАЧЕ ""Диалог""
	|	КОНЕЦ,
	|	""История"",
	|	ЖурналСообщений.ОператорСообщения,
	|	NULL,
	|	NULL,
	|	ЖурналСообщений.СлужебноеСообщение,
	|	NULL,
	|	NULL,
	|	0,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ЖурналСообщений.ТекстСообщения КАК СТРОКА(10))) = """"""""
	|			ТОГДА ""(Прикрепленный файл)""
	|		ИНАЧЕ ВЫРАЗИТЬ(ЖурналСообщений.ТекстСообщения КАК СТРОКА(1024))
	|	КОНЕЦ,
	|	ЖурналСообщений.ИдКлиента,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВтКонтактыМессенджеровИФото.Фото,
	|	ВЫБОР
	|		КОГДА ЖурналСообщений.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.JivoSite)
	|			ТОГДА ЖурналСообщений.ИдОператора
	|		КОГДА ЖурналСообщений.СообщениеОтКлиента
	|			ТОГДА ""0""
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|ИЗ
	|	РегистрСведений.ЖурналСообщений КАК ЖурналСообщений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтКонтактыМессенджеровИФото КАК ВтКонтактыМессенджеровИФото
	|		ПО ЖурналСообщений.ИдКлиента = ВтКонтактыМессенджеровИФото.Идентификатор
	|ГДЕ
	|	ЖурналСообщений.ИдКлиента В
	|			(ВЫБРАТЬ
	|				ВтКонтактыМессенджеровИФото.Идентификатор КАК Идентификатор
	|			ИЗ
	|				ВтКонтактыМессенджеровИФото КАК ВтКонтактыМессенджеровИФото)
	|	И ЖурналСообщений.ВнешняяСистема.ТипВнешнейСистемы В(&ТипыВнешнихСистемМессенджера)
	|	И ЖурналСообщений.ВнешняяСистема.СтруктурнаяЕдиница В(&СтруктурныеЕдиницы)
	|	И НЕ ЖурналСообщений.ОжиданиеСообщения
	|	И &ВыводитьСообщения
	|	И ЖурналСообщений.СлужебноеСообщение = ЛОЖЬ
	|	И ЖурналСообщений.ДатаСообщения МЕЖДУ &СделкаДатаНачала И &СделкаДатаОкончания
	|	И НЕ ЖурналСообщений.ИдСообщения В (&МассивИсключенияИдСообщения)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Заявки.Ссылка,
	|	ВЫБОР
	|		КОГДА Заявки.ДатаОбработки <> ДАТАВРЕМЯ(1, 1, 1)
	|				И НЕ Заявки.ДатаОбработки ЕСТЬ NULL
	|			ТОГДА Заявки.ДатаОбработки
	|		ИНАЧЕ Заявки.ДатаСоздания
	|	КОНЕЦ,
	|	""Обращение"",
	|	ВЫБОР
	|		КОГДА Заявки.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.Принята), ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.Отклонена))
	|			ТОГДА ""История""
	|		ИНАЧЕ ""Просроченно""
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	ВЫРАЗИТЬ(Заявки.Комментарий КАК СТРОКА(1024)),
	|	Заявки.Статус,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА Заявки.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.Принята), ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.Отклонена))
	|			ТОГДА 0
	|		ИНАЧЕ 10
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|ГДЕ
	|	Заявки.ПометкаУдаления = ЛОЖЬ
	|	И Заявки.ОсновнойКлиент = &Контрагент
	|	И ВЫРАЗИТЬ(&Сделка КАК Справочник.Сделки).Заявка = Заявки.Ссылка
	|	И &ВыводитьОбращения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок УБЫВ,
	|	Дата УБЫВ";
		
	//ВсеФильтрыОтключены = ВсеФильтрыОтключены(Фильтры);
	//
	//Если ВсеФильтрыОтключены Тогда
	//	Фильтры = Новый Структура();
	//КонецЕсли;
	
	ДатаРождения = ПараметрыДанных.ДатаРожденияКлиента;
	
	ТипыВнешнихСистемМессенджера = Справочники.ВнешниеСистемы.ПолучитьМассивТиповВнешнихСистемМессенджера();
	
	СтруктурныеЕдиницы = Справочники.Сотрудники.ПолучитьМестаРаботыСотрудника(ПараметрыСеанса.ТекущийСотрудник,"Массив");
	СтруктурныеЕдиницы.Добавить(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	СтруктурныеЕдиницы.Добавить(Справочники.СтруктурныеЕдиницы.ПустаяСсылка());

	Запрос.УстановитьПараметр("Контрагент"     , ПараметрыДанных.Контрагент);
	Запрос.УстановитьПараметр("ТекущаяДата"    , ТекущаяДатаСеанса());
	
	Если ПараметрыДанных.Свойство("Заявка") И ЗначениеЗаполнено(ПараметрыДанных.Заявка) Тогда 
		Запрос.УстановитьПараметр("Заявка", ПараметрыДанных.Заявка);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "(Заметки.Объект = &Контрагент
		|			ИЛИ Заметки.Объект = &Заявка)"	, "Заметки.Объект = &Контрагент");
	КонецЕсли;
	
	Если ПараметрыДанных.Свойство("Сделка") И ЗначениеЗаполнено(ПараметрыДанных.Сделка) Тогда 
		ПредыдущийПрием 		= РегистрыСведений.Профосмотры.ПолучитьПрошлыйПрием(ПараметрыДанных.Контрагент, , ПараметрыДанных.Сделка);
		
		Запрос.УстановитьПараметр("Сделка"						, ПараметрыДанных.Сделка);
		Запрос.УстановитьПараметр("ПрофосмотрСделка"			, ПараметрыДанных.Сделка); 
		Запрос.УстановитьПараметр("СделкаДатаНачала"			, ПараметрыДанных.СделкаДатаНачала);
		Запрос.УстановитьПараметр("СделкаДатаОкончания"			, ПараметрыДанных.СделкаДатаОкончания);
		Запрос.УстановитьПараметр("СделкаДатаОкончания"			, ПараметрыДанных.СделкаДатаОкончания); 
		Запрос.УстановитьПараметр("МассивИсключенияИдСообщения"	, ПолучитьМассивСообщенийИсключенияПоСделке(ПараметрыДанных.Контрагент, ПараметрыДанных.Сделка)); 
		Запрос.УстановитьПараметр("СделкаПредыдущийПрием"		, ПредыдущийПрием);
	
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "(Событие.Сделка = &Сделка
		|			ИЛИ Событие.Врач = ВЫРАЗИТЬ(&Сделка КАК Справочник.Сделки).Врач
		|				И Событие.Дата >= &ТекущаяДата)", "ИСТИНА");  
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "(Прием.Сделка = &Сделка
		|			ИЛИ Прием.Ссылка = &СделкаПредыдущийПрием
		|			ИЛИ Прием.Сотрудник = ВЫРАЗИТЬ(&Сделка КАК Справочник.Сделки).Врач
		|				И Прием.Дата >= &ТекущаяДата)"	, "ИСТИНА");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СделкиИсторияИзмененияЭтапов.Ссылка = &Сделка"								, "ИСТИНА");   
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Прием.Сделка = &ПрофосмотрСделка"												, "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЖурналСообщений.ДатаСообщения МЕЖДУ &СделкаДатаНачала И &СделкаДатаОкончания"	, "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Заметки.Сделка = &Сделка"														, "ИСТИНА"); 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НЕ ЖурналСообщений.ИдСообщения В (&МассивИсключенияИдСообщения)"				, "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗадачаПользователей.Сделка = &Сделка"											, "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫРАЗИТЬ(&Сделка КАК Справочник.Сделки).Заявка = Заявки.Ссылка"				, "ИСТИНА");
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипыВнешнихСистемМессенджера", ТипыВнешнихСистемМессенджера);
	Запрос.УстановитьПараметр("СтруктурныеЕдиницы"			, СтруктурныеЕдиницы);
	
	МассивНомеровТелефонов = IPТелефония.СформироватьМассивНомеровТелефоновПоКонтрагентуИлиТелефону(ПараметрыДанных.Контрагент); 
	
	Если ПараметрыДанных.Свойство("ВходящийНомерТелефона") Тогда
		МассивНомеровВходящих = IPТелефония.СформироватьМассивНомеровТелефоновПоКонтрагентуИлиТелефону(,ПараметрыДанных.ВходящийНомерТелефона);
		Для Каждого Элемент Из МассивНомеровВходящих Цикл
			Если МассивНомеровТелефонов.Найти(Элемент) = Неопределено Тогда
				МассивНомеровТелефонов.Добавить(Элемент);	                   
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Если год не высокосный, тогда передвигаем дату рождения на один день. 
	Если ЗначениеЗаполнено(ДатаРождения) и Месяц(ДатаРождения) = 2 и День(ДатаРождения) = 29 И НЕ ДеньГода(КонецГода(ТекущаяДатаСеанса())) = 366 Тогда
		ДатаРождения = ДатаРождения + 86400;		      
	КонецЕсли;
	
	ДатаРождения = Дата("" + Формат(ТекущаяДата(),"ДФ=yyyy; ДП=0001") + "" + Формат(ДатаРождения,"ДФ=MM; ДП=01") + "" + Формат(ДатаРождения,"ДФ=dd; ДП=01"));
	
	ВсеФильтрыОтключены = ВсеФильтрыОтключены(Фильтры);
		
	Запрос.УстановитьПараметр("ВыводитьСобытия"      	, ?(ВсеФильтрыОтключены = Ложь И Фильтры.Свойство("События")  		, Фильтры.События   	, Истина));
	Запрос.УстановитьПараметр("ВыводитьЗаметки"      	, ?(ВсеФильтрыОтключены = Ложь И Фильтры.Свойство("Заметки")    	, Фильтры.Заметки   	, Истина));
	Запрос.УстановитьПараметр("ВыводитьПриемы"       	, ?(ВсеФильтрыОтключены = Ложь И Фильтры.Свойство("Приемы")      	, Фильтры.Приемы     	, Истина));
	Запрос.УстановитьПараметр("ВыводитьОбращения"     	, ?(ВсеФильтрыОтключены = Ложь И Фильтры.Свойство("Обращения")    	, Фильтры.Обращения   	, Истина));
	Запрос.УстановитьПараметр("ВыводитьПланыЛечения"    , ?(ВсеФильтрыОтключены = Ложь И Фильтры.Свойство("ПланыЛечения")   , Фильтры.ПланыЛечения  , Истина));
	Запрос.УстановитьПараметр("ВыводитьНарядЗаказы"    	, ?(ВсеФильтрыОтключены = Ложь И Фильтры.Свойство("НарядЗаказы")    , Фильтры.НарядЗаказы   , Истина));
	Запрос.УстановитьПараметр("ВыводитьСообщения"       , ?(ВсеФильтрыОтключены = Ложь И Фильтры.Свойство("Сообщения")     	, Фильтры.Сообщения    	, Истина));
	Запрос.УстановитьПараметр("ВыводитьЗадачи"      	, ?(ВсеФильтрыОтключены = Ложь И Фильтры.Свойство("Задачи")			, Фильтры.Задачи		, Истина));
	Запрос.УстановитьПараметр("ВыводитьЗвонки"      	, ?(ВсеФильтрыОтключены = Ложь И Фильтры.Свойство("Звонки")			, Фильтры.Звонки		, Истина)); 
	Запрос.УстановитьПараметр("ВыводитьСделки"      	, ВсеФильтрыОтключены);
	Запрос.УстановитьПараметр("ВыводитьДатуРегистрации"	, ВсеФильтрыОтключены);                                              	 
	Запрос.УстановитьПараметр("МассивНомеровТелефонов"  , МассивНомеровТелефонов);
	Запрос.УстановитьПараметр("ДатаРождения"       	    , ДатаРождения);

	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

// Процедура, формирует историю взаимодействия с контрагентом.
//
Функция СформироватьИсториюВзаимодействияСКлиентом(ЭтаФорма, ПараметрыДанных, РежимПодробно = Ложь, ВыводитьВсе = Ложь, Фильтры) Экспорт 
	
	ТекстовыйПосторитель = Новый ЗаписьXML;
	ТекстовыйПосторитель.УстановитьСтроку();		
	
	ТекстHTML = 
	"<html>
	|<meta http-equiv='X-UA-Compatible' content='IE=8'
	|<head>
	|<title></title>
	|<style type='text/css'>
	|	.left_col   { background-color: #FFFFFF; vertical-align:top; padding-top: 5px;}
	|	.center_col { background-color: #F2F2F2; vertical-align:top; padding: 5px;  margin-left: 6px; padding-left: 10px; border-radius:10px 0px 0px 10px;}
	|	.right_col  { background-color: #F2F2F2; vertical-align:top; padding: 5px; border-radius:0px 10px 10px 0px; max-width: 200px;}                  
	|	.date		{ color: #1fa3ff; height: 20px; text-align: center;}
	|	a           { color: #333333; text-decoration: none; }
	|	a:hover     { text-decoration: underline}
	|	a.more		{ color: #1fa3ff; }
	|	.content	{ margin: 0px; width: 90%; display: inline-block;}    
	|	.author     { margin: 0px; white-space: nowrap; overflow: hidden; text-overflow: ellipsis; max-width: 120px;}
	| 	img         { margin-right: 8px;}
	| 	input       { margin: 0px; float: left; position: relative; top: -1px; cursor: pointer;}
	|	table       { font: 12px arial; height: auto; width: 100%;}
	|   .info       { text-align: center;}
	|	.leftstr 	{ margin: 2px; text-align: left;}
	|	.block_right { 
	|		padding: 10px; 
	|		float: right;
	|		max-width:400px;
	|		border-radius:10px 10px 0px 10px;
	|		border-color:gray;
	|		background-color:#DBF4FD;
	|		word-break:break-all;
	|   }
	|	.block_left { 
	|		padding: 10px;
	|		float: left;
	|		max-width:400px;
	|		border-radius:0px 10px 10px 10px;
	|		border-color:gray;
	|		background-color:#F2F6F9;
	|		word-break:break-all;
	|   }
	|</style>
	|</head>
	|<body>
	|<table cellpadding='0' cellspacing='0' align='center'>";
	
	ТекстовыйПосторитель.ЗаписатьБезОбработки(ТекстHTML);	
	
	ДатаРожденияКлиента    = ПараметрыДанных.ДатаРожденияКлиента;
	ДатаРегистрацииКлиента = ПараметрыДанных.ДатаРегистрацииКлиента;
	БлокЗапланированоВыведен = Ложь;
	ТекущаяДата = Неопределено;
	
	ТаблицаИсторииВзаимодействия = ЭтаФорма.ИсторияВзаимодействий;
	КоличествоСобытий = ТаблицаИсторииВзаимодействия.Количество();
	ИндексКонец  = ?(ВыводитьВсе ИЛИ КоличествоСобытий - 1 < 20, КоличествоСобытий - 1, 19);
	
	ТегДиалогаОткрыт = Ложь;
	КоличествоСообщенийБезРазрыва = 1;

	Для Индекс = 0 По ИндексКонец Цикл		
		СтрокаТЗ = ТаблицаИсторииВзаимодействия[Индекс];
		ДатаНачалоДня = НачалоДня(СтрокаТЗ.Дата);
		ЭтоБлокЗапланировано 	= СтрокаТЗ.ТипВзаимодействия = "Запланировано";
		ЭтоЗаметка				= СтрокаТЗ.ТипСобытия		 = "Заметка";
		ЦветФона = ?(ЭтоБлокЗапланировано, "#f5f5dc", "");
		
		Если СтрокаТЗ.ТипСобытия = "Заметка" Тогда
			ТекстовыйПосторитель.ЗаписатьБезОбработки(СформироватьБлокЗаметка(СтрокаТЗ));
		КонецЕсли;
		
		Если Не СтрНайти(СтрокаТЗ.ТипСобытия, "Диалог")
			И ТегДиалогаОткрыт Тогда
			
			ТегДиалогаОткрыт = Ложь;
			КоличествоСообщенийБезРазрыва = 1;
			
		КонецЕсли;
		
		Если ЭтоБлокЗапланировано И Не БлокЗапланированоВыведен  Тогда
			ВывестиБлокИнформация(ТекстовыйПосторитель, СтрокаТЗ.ТипВзаимодействия,,,,8);
			БлокЗапланированоВыведен = Истина;
		КонецЕсли;	
		
		Если НЕ ЭтоБлокЗапланировано И НЕ ЭтоЗаметка Тогда
			Если ТекущаяДата = Неопределено Или ТекущаяДата <> ДатаНачалоДня Тогда  // сменилась дата, выводим
				ВывестиДату(ТекстовыйПосторитель, ДатаНачалоДня);
				ТекущаяДата = ДатаНачалоДня;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаТЗ.ТипСобытия = "ДатаРегистрацииКлиента" Тогда
			ВывестиБлокИнформация(ТекстовыйПосторитель, "Пациент зарегистрирован", , 12, -8);
		КонецЕсли;
		
		Если СтрокаТЗ.ТипСобытия = "Событие" Тогда
			ВыводитьДату = ЭтоБлокЗапланировано И Не НачалоДня(ТекущаяДатаСеанса()) = НачалоДня(СтрокаТЗ.Дата);
			ТекстовыйПосторитель.ЗаписатьБезОбработки(СформироватьБлокПредварительнаяЗапись(СтрокаТЗ.Ссылка, СтрокаТЗ.Статус, ЦветФона, ВыводитьДату));	
		ИначеЕсли СтрокаТЗ.ТипСобытия = "Профосмотр" Тогда
			ВыводитьДату = ЭтоБлокЗапланировано И Не НачалоДня(ТекущаяДатаСеанса()) = НачалоДня(СтрокаТЗ.Дата);
			ТекстовыйПосторитель.ЗаписатьБезОбработки(СформироватьБлокПрофосмотр(СтрокаТЗ, СтрокаТЗ.Статус, ЦветФона, ВыводитьДату));
		ИначеЕсли СтрокаТЗ.ТипСобытия = "Прием" Тогда
			ВыводитьДату = ЭтоБлокЗапланировано И Не НачалоДня(ТекущаяДатаСеанса()) = НачалоДня(СтрокаТЗ.Дата);
			ТекстовыйПосторитель.ЗаписатьБезОбработки(СформироватьБлокПрием(СтрокаТЗ.Ссылка,СтрокаТЗ.Статус, ЦветФона, ВыводитьДату));
		ИначеЕсли СтрокаТЗ.ТипСобытия = "НарядЗаказ" Тогда
			ВыводитьДату = ЭтоБлокЗапланировано И Не НачалоДня(ТекущаяДатаСеанса()) = НачалоДня(СтрокаТЗ.Дата);
			ТекстовыйПосторитель.ЗаписатьБезОбработки(СформироватьБлокНарядЗаказ(СтрокаТЗ.Ссылка, СтрокаТЗ.Статус, ЦветФона, ВыводитьДату));
		ИначеЕсли СтрокаТЗ.ТипСобытия = "ПланЛечения" Тогда
			ВыводитьДату = ЭтоБлокЗапланировано И Не НачалоДня(ТекущаяДатаСеанса()) = НачалоДня(СтрокаТЗ.Дата);
			ТекстовыйПосторитель.ЗаписатьБезОбработки(СформироватьБлокПланЛечения(СтрокаТЗ.Ссылка, СтрокаТЗ.Статус, ЦветФона, ВыводитьДату));										
		ИначеЕсли СтрокаТЗ.ТипСобытия = "SMS" Тогда
			ТекстовыйПосторитель.ЗаписатьБезОбработки(СформироватьБлокSMS(СтрокаТЗ.Ссылка, СтрокаТЗ.Автор, СтрокаТЗ.Статус));			
		ИначеЕсли СтрокаТЗ.ТипСобытия = "Письмо" Тогда
			ТекстовыйПосторитель.ЗаписатьБезОбработки(СформироватьБлокПисьмо(СтрокаТЗ.Ссылка, СтрокаТЗ.Автор, СтрокаТЗ.Статус));						
		ИначеЕсли СтрокаТЗ.ТипСобытия = "Задача" Тогда
			ТекстовыйПосторитель.ЗаписатьБезОбработки(СформироватьБлокЗадача(СтрокаТЗ.Ссылка));					
		ИначеЕсли СтрНачинаетсяС(СтрокаТЗ.ТипСобытия, "Диалог") Тогда
			
			КоличествоСообщенийБезРазрыва = КоличествоСообщенийБезРазрыва + 1;
			
			СформированныйБлокДиалог = СформироватьБлокДиалог(СтрокаТЗ, ?(ТегДиалогаОткрыт = Ложь, Истина, Ложь));
			
			Если ТегДиалогаОткрыт = Ложь И ЗначениеЗаполнено(СформированныйБлокДиалог) Тогда
				
				Если СтрокаТЗ.ТипСобытия = "ДиалогTelegram" Тогда
					АдресКартинки = Base64Строка(БиблиотекаКартинок.Telegram16.ПолучитьДвоичныеДанные());
				ИначеЕсли СтрокаТЗ.ТипСобытия = "ДиалогVK" Тогда
					АдресКартинки = Base64Строка(БиблиотекаКартинок.Vk16.ПолучитьДвоичныеДанные());
				ИначеЕсли СтрокаТЗ.ТипСобытия = "ДиалогViber" Тогда
					АдресКартинки = Base64Строка(БиблиотекаКартинок.Viber16.ПолучитьДвоичныеДанные());
				ИначеЕсли СтрокаТЗ.ТипСобытия = "ДиалогWhatsApp" Тогда
					АдресКартинки = Base64Строка(БиблиотекаКартинок.Whatsapp16.ПолучитьДвоичныеДанные());
				КонецЕсли;
				
 				ТегДиалогаОткрыт = Истина;
				
				БлокДиалог =
				"<tr align='left' valign='top'>
				|<td rowspan= '{КоличествоСообщенийБезРазрыва}'>
				|<img alt='{Текст}' src='data:image/png;base64, {АдресКартинки}'/>
				|</td>";
				
				БлокДиалог = СтрЗаменить(БлокДиалог, "{АдресКартинки}"					, АдресКартинки);
				БлокДиалог = СтрЗаменить(БлокДиалог, "{КоличествоСообщенийБезРазрыва}"	, КоличествоСообщенийБезРазрыва);
				БлокДиалог = СтрЗаменить(БлокДиалог, "{Текст}"							, Нстр("ru = 'Диалог'; en = 'Dialog'"));
				
				ТекстовыйПосторитель.ЗаписатьБезОбработки(БлокДиалог);
				
			КонецЕсли;
			
			ТекстовыйПосторитель.ЗаписатьБезОбработки(СформированныйБлокДиалог);
			
		КонецЕсли;
		
		ТекстовыйПосторитель.ЗаписатьБезОбработки(Символы.ПС + ДобавитьПустуюСтроку());					
		
	КонецЦикла;
	
	Если КоличествоСобытий > 20 И НЕ ВыводитьВсе Тогда
		ВывестиБлокПоказатьЕще(ТекстовыйПосторитель, "Показать еще (" + Строка(КоличествоСобытий - 20) + ")");		
	КонецЕсли;
	
	ТекстовыйПосторитель.ЗаписатьБезОбработки("</table>
	|</body>
	|</head>
	|</html>");							
	
	ИсторияВзаимодействия = ТекстовыйПосторитель.Закрыть();		
	// Очищаем построитель
	ТекстовыйПосторитель = Неопределено;
	
	Возврат ИсторияВзаимодействия;
	
КонецФункции

// Процедура, выводит блок информации.
//
Процедура ВывестиБлокИнформация(ТекстовыйПосторитель, Текст, ЦветФона = "#ffffff", РазмерШрифта = 16, ОтступСверху = 0, ОтступСнизу = 0)
	
	БлокИнформация =   
	"<tr style='background-color: {ЦветФона};'>
	|<td colspan='3'>
	|<p class='info' style='color: #1fa3ff; font: {РазмерШрифта}px arial; margin: {ОтступСверху}px 0px {ОтступСнизу}px 0px;'>{Текст}</p>
	|</td>	                               
	|</tr>";
	
	БлокИнформация = СтрЗаменить(БлокИнформация, "{ЦветФона}"    , ЦветФона);
	БлокИнформация = СтрЗаменить(БлокИнформация, "{РазмерШрифта}", РазмерШрифта);
	БлокИнформация = СтрЗаменить(БлокИнформация, "{ОтступСверху}", ОтступСверху);
	БлокИнформация = СтрЗаменить(БлокИнформация, "{ОтступСнизу}" , ОтступСнизу);
	БлокИнформация = СтрЗаменить(БлокИнформация, "{Текст}"       , Текст);
	
	ТекстовыйПосторитель.ЗаписатьБезОбработки(БлокИнформация);									
	
КонецПроцедуры

// Функция, формирует блок визит.
//
Функция СформироватьБлокПланЛечения(ПланЛечения, Статус, ЦветФона = "", Запланировано = Ложь)
	
	ТекстHTML = 
	"<tr>
	|<td align='right' class='left_col' style='background-color: inherit;'>
	|<img alt='Прием' src='data:image/png;base64, {Картинка}'/>
	|</td>
	|<td class='center_col'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|<p class='content'><a href='{Ссылка}' title='Открыть план лечения'>{Представление}</a>({Статус}) Сумма: {Сумма} Оплачено: {Оплачено}</p>";
	
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Ссылка}"        , ПолучитьНавигационнуюСсылку(ПланЛечения));
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Представление}" , ПолучитьПредставлениеПланаЛечения(ПланЛечения, Статус, Запланировано));
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Картинка}"		 , Base64Строка(БиблиотекаКартинок.PNG_ПланЛечения_16х16.ПолучитьДвоичныеДанные()));
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Статус}"		 , ПланЛечения.Статус);
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Оплачено}"		 , "" + ПланЛечения.СуммаОплачено + ОбщегоНазначенияСтоматология.ПолучитьСимвольноеПредставлениеВалюты());
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Сумма}"		 , "" + ПланЛечения.СуммаДокумента + ОбщегоНазначенияСтоматология.ПолучитьСимвольноеПредставлениеВалюты());
	
	ВремЗапасы = ПланЛечения.Лечение.Выгрузить().Скопировать(); 
	ВремЗапасы.Свернуть("Номенклатура");                 
	
	Для Каждого Номенклатура Из ВремЗапасы.ВыгрузитьКолонку("Номенклатура") Цикл
		
		Шаблон = "<p class='content' title='{Номенклатура}'>{Номенклатура}</p>";
		ТекстHTML = ТекстHTML + Символы.ПС + СтрЗаменить(Шаблон, "{Номенклатура}", Строка(Номенклатура));			 	
		
	КонецЦикла;
	
	
	ТекстHTML = ТекстHTML + 
	"</td>
	|<td class='right_col' align='right'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|";
	
	УстановитьПривилегированныйРежим(Истина);
	
	СотрудникHTML = ""; 		
	
	СотрудникHTML = "<p class='author' title='{Сотрудник}'>{Сотрудник}</p>";
	СотрудникHTML = СтрЗаменить(СотрудникHTML, "{Сотрудник}", ПредставлениеФИОСотрудника(ПланЛечения.Сотрудник));			
	
	ТекстHTML = ТекстHTML + СотрудникHTML + Символы.ПС;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТекстHTML + "</td>" + Символы.ПС + "</tr>";
	
КонецФункции

// Функция, возвращает представление визита.
//
Функция ПолучитьПредставлениеПланаЛечения(ПланЛечения, СтатусВизита, Запланировано = Ложь)
	
	Представление = "";
		
	Состояние = "";
	Если ПланЛечения.ПометкаУдаления Тогда
		Состояние = НСтр("ru='(удален)'");
	ИначеЕсли НЕ ПланЛечения.Проведен Тогда
		Состояние = НСтр("ru='(не проведен)'");
	КонецЕсли;
	
	Статус = "План лечения";
	ДатаДокумента = Формат(ПланЛечения.Дата, "ДЛФ=DD") + " в " + Формат(ПланЛечения.Дата, "ДФ=HH:мм");
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru='%1 %2 %3'"),
	Статус,
	ДатаДокумента,
	Состояние);
	
	Возврат Представление;
	
КонецФункции

// Функция - Сформировать блок задача
//
// Параметры:
//  СтрокаТЗ - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьБлокЗадача(Задача)
	
	ЦветФона = "";
	ШаблонЗадача = 
	"<tr valign='middle'>
	|<td class='left_col' td align='right'>
	|<img alt='Задача' src='data:image/png;base64, {Картинка}'/>
	|</td>
	|<td class='center_col' style='vertical-align: middle;" + ?(ЗначениеЗаполнено(ЦветФона), " background-color: " + ЦветФона + ";'", "'") + ">
	|<input {Чекнут} title='{ДопОписание}' type='checkbox' class='task' id='{УИд}'/>
	|<p class='content'><a href='{Ссылка}' title='Открыть задачу'>{Дата} {Представление}{ДопИнформация}.</a> {Описание}</p>
	|</td>
	|<td class='right_col' align='right'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|<p title='{Автор}' class='author'>{Автор}</p>
	|</td>
	|</tr>";
	
	УИд = Задача.УникальныйИдентификатор();
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{Описание}" 	  , ?(ЗначениеЗаполнено(Задача.ЗадачаОписание), Задача.ЗадачаОписание, ""));
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{Тема}"     	  , Задача.ЗадачаТема);
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{Дата}"     	  , ?(Задача.Выполнена, "", Формат(Задача.ЗадачаНазначеннаяДата, "ДФ='d MMMM'") + ","));
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{Автор}"    	  , Справочники.Сотрудники.ПредставлениеФИОСотрудника(Задача.ЗадачаАвтор));
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{Представление}", Строка(Задача.Ссылка));
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{Ссылка}"       , ПолучитьНавигационнуюСсылку(Задача));
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{ДопОписание}"  , ?(Задача.Выполнена, "", "Отметить как выполнено"));
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{Чекнут}"   	  , ?(Задача.Выполнена, "checked disabled", ""));
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{УИд}"     	  , УИд);
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{Картинка}"	  , Base64Строка(БиблиотекаКартинок.PNG_ЗадачаНовый_16х16.ПолучитьДвоичныеДанные()));  	
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{ДопИнформация}", ?(Не Задача.Выполнена И Задача.ЗадачаНазначеннаяДата < ТекущаяДатаСеанса(), " <span style='color: red;'>(Просрочена)</span>", ""));
	
	Возврат ШаблонЗадача;	

КонецФункции

// Функция - Сформировать блок заметка
//
// Параметры:
//  СтрокаТЗ - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьБлокЗаметка(СтрокаТЗ)
	
	ЦветФона = "";
	ШаблонЗаметка = 
	"<tr>
	|<td align='right' class='left_col' style='background-color: inherit;'>
	|<img alt='Заметка' src='data:image/png;base64, {КартинкаЗаметки}'/>
	|</td>
	|<td class='center_col'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|<p class='content'><a href= '{Ссылка}' class='note' title='Открыть заметку' id='{ИдЗаметки}'>{ТекстЗаметки}</a>
	|<img alt='Заметка' src='data:image/png;base64, {КартинкаКарандаша}'/>
	|</p>
	|</td>
	|	<td class='right_col' align='right'>
	|		<p title='{ПодсказкаДаты}' class='author'>{АвторДокумента}</p>
	|		<a class='reference' style='background:' href=''</a>
	|	</td>
	//|	<td style='vertical-align: top;'>
	//|		<img id='{Уид}' class='{Стиль}' src='{Картинка}' title='{Подсказка}'/>
	//|	</td>
	|</tr>";
	// Уид = СтрокаТЗ.ИдЗаметки;		
	Уид = СтрокаТЗ.ПолучитьИдентификатор();
	
	Если ЗначениеЗаполнено(СтрокаТЗ.Ссылка) Тогда
		ТекстЗаметки = ?(СтрДлина(СтрокаТЗ.Ссылка) > 200, Лев(СтрокаТЗ.Ссылка, 200) + "...", СтрокаТЗ.Ссылка);
	Иначе
		ТекстЗаметки = "...";
	КонецЕсли;	                             
	
	ШаблонЗаметка = СтрЗаменить(ШаблонЗаметка, "{КартинкаЗаметки}"       , Base64Строка(БиблиотекаКартинок.PNG_ЗаметкаКарточка_16х16.ПолучитьДвоичныеДанные()));
	ШаблонЗаметка = СтрЗаменить(ШаблонЗаметка, "{КартинкаКарандаша}"     , Base64Строка(БиблиотекаКартинок.PNG_Редактировать_16х16.ПолучитьДвоичныеДанные()));
	ШаблонЗаметка = СтрЗаменить(ШаблонЗаметка, "{ТекстЗаметки}"          , ТекстЗаметки);
	ШаблонЗаметка = СтрЗаменить(ШаблонЗаметка, "{АвторДокумента}"        , СтрокаТЗ.Автор);
	ШаблонЗаметка = СтрЗаменить(ШаблонЗаметка, "{ИдЗаметки}"             , Уид);
	ШаблонЗаметка = СтрЗаменить(ШаблонЗаметка, "{ПодсказкаДаты}"         , Формат(СтрокаТЗ.Дата, "ДФ='dd.MM.yyyy HH:mm'"));		
	ШаблонЗаметка = СтрЗаменить(ШаблонЗаметка, "{КартинкаРедактирования}", Base64Строка(БиблиотекаКартинок.PNG_Редактировать_16х16.ПолучитьДвоичныеДанные()));
	ШаблонЗаметка = СтрЗаменить(ШаблонЗаметка, "{Заголовок}"     		 , Нстр("ru='Редактировать заметку';en='Edit note'"));
	ШаблонЗаметка = СтрЗаменить(ШаблонЗаметка, "{Заметка}"	     		 , Нстр("ru='Заметка';en='Note'"));	
	
	// СобытиеЗакреплено = (СтрокаТЗ.ТипВзаимодействия = "Закреплен");
	// ВывестиСкрепку(ШаблонЗаметка, СобытиеЗакреплено, Уид);
	
	Возврат ШаблонЗаметка;	
	
КонецФункции

// Процедура - Вывести скрепку.
//
// Параметры:
//  ТекстHTML			 - 	 - 
//  СобытиеЗакреплено	 - 	 - 
//  Уид					 - 	 - 
//
Процедура ВывестиСкрепку(ТекстHTML, СобытиеЗакреплено, Уид)
	
	// Не работает пока.
	// Если СобытиеЗакреплено Тогда		
	//	// БиблиотекаКартинок.ОткрепитьСобытие
	//	АдресКартинки = Base64Строка(БиблиотекаКартинок.ОткрепитьСобытие.ПолучитьДвоичныеДанные());
	//	КлассСтиля    = "clip on"; 
	//	Подсказка     = Нстр("ru='Открепить';en='Unpin'");	
	// Иначе
	//	// БиблиотекаКартинок.ЗакрепитьСобытие
	//	АдресКартинки = Base64Строка(БиблиотекаКартинок.ЗакрепитьСобытие.ПолучитьДвоичныеДанные());
	//	КлассСтиля    = "clip off";
	//	Подсказка     = Нстр("ru='Закрепить';en='ToFasten'");			
	// КонецЕсли;

	// ТекстHTML = СтрЗаменить(ТекстHTML, "{Уид}"      , Уид); 
	// ТекстHTML = СтрЗаменить(ТекстHTML, "{Стиль}"    , КлассСтиля); 
	// ТекстHTML = СтрЗаменить(ТекстHTML, "{Подсказка}", Подсказка);
	// ТекстHTML = СтрЗаменить(ТекстHTML, "{Картинка}" , АдресКартинки);
	
КонецПроцедуры

// Функция, формирует блок sms.
//
Функция СформироватьБлокSMS(ДокументSMSРассылки, Автор, Статус)
	
	ШаблонSMS = 
	"<tr>
	|<td align='right' class='left_col'>
	|<img alt='SMS' src='data:image/png;base64, {Картинка}'/>
	|</td>
	|<td class='center_col'>
	|<p class='content'>
	|<a href='{Ссылка}' title='Открыть сообщение'>{Прдставление}.</a>
	|{ТекстSMS}</p>
	|</td>
	|<td class='right_col' align='right' title='{АвторДокумента}'>{АвторДокумента}</td>
	|</tr>";
	
	ШаблонSMS = СтрЗаменить(ШаблонSMS, "{Прдставление}"  , ПолучитьПредставлениеИсходящегоСообщения(ДокументSMSРассылки, "SMS"));
	ШаблонSMS = СтрЗаменить(ШаблонSMS, "{ТекстSMS}"      , ДокументSMSРассылки.Содержание);
	// ШаблонSMS = СтрЗаменить(ШаблонSMS, "{Статус}"        , Статус);
	ШаблонSMS = СтрЗаменить(ШаблонSMS, "{АвторДокумента}", Автор);
	ШаблонSMS = СтрЗаменить(ШаблонSMS, "{Ссылка}"        , ПолучитьНавигационнуюСсылку(ДокументSMSРассылки));
	ШаблонSMS = СтрЗаменить(ШаблонSMS, "{Картинка}"		 , Base64Строка(БиблиотекаКартинок.PNG_ПациентыСообщениеОбсуждение_16х16.ПолучитьДвоичныеДанные()));

	Возврат ШаблонSMS;	
	
КонецФункции

// Функция, формирует блок sms.
//
Функция СформироватьБлокПисьмо(ДокументSMSРассылки, Автор, Статус)
	
	ШаблонПисьмо = 
	"<tr>
	|<td align='right' class='left_col'>
	|<img alt='Письмо' src='data:image/png;base64, {Картинка}'/>
	|</td>
	|<td class='center_col'>
	|<p class='content'>
	|<a href='{Ссылка}' title='Открыть письмо'>{Прдставление}.</a>
	|{ТекстПисьмо}</p>
	|</td>
	|<td class='right_col' align='right' title='{АвторДокумента}'>{АвторДокумента}</td>
	|</tr>";
	
	ШаблонПисьмо = СтрЗаменить(ШаблонПисьмо, "{Прдставление}"  , ПолучитьПредставлениеИсходящегоСообщения(ДокументSMSРассылки, "Письмо"));
	ШаблонПисьмо = СтрЗаменить(ШаблонПисьмо, "{ТекстПисьмо}"      , ДокументSMSРассылки.ТекстHTML);
	// ШаблонSMS = СтрЗаменить(ШаблонSMS, "{Статус}"        , Статус);
	ШаблонПисьмо = СтрЗаменить(ШаблонПисьмо, "{АвторДокумента}", Автор);
	ШаблонПисьмо = СтрЗаменить(ШаблонПисьмо, "{Ссылка}"        , ПолучитьНавигационнуюСсылку(ДокументSMSРассылки));
	ШаблонПисьмо = СтрЗаменить(ШаблонПисьмо, "{Картинка}"	   , Base64Строка(БиблиотекаКартинок.PNG_Письмо_16х16.ПолучитьДвоичныеДанные()));

	Возврат ШаблонПисьмо;	
	
КонецФункции

// Функция, возвращает представление документа sms рассылки.
//
Функция ПолучитьПредставлениеИсходящегоСообщения(SMSРассылка, ТиСообщения)

	Представление = "";
	
	Представление = ТиСообщения;
	
	Если SMSРассылка.Ссылка.Пустая() Тогда
		Представление = Представление + " (создание)";
	КонецЕсли;
	
	Состояние = "";
	Если SMSРассылка.ПометкаУдаления Тогда
		Состояние = НСтр("ru='(удален)'");
	ИначеЕсли НЕ SMSРассылка.Проведен Тогда
		Состояние = НСтр("ru='(не проведен)'");
	КонецЕсли;
	
	ДатаДокумента = "в " + Формат(SMSРассылка.Дата, "ДФ=HH:мм");
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru='%1 %2 %3'"),
	Представление,
	ДатаДокумента,
	Состояние);
	
	Возврат СокрЛП(Представление);
	
КонецФункции

// Процедура, выводит блок дата.
//
Процедура ВывестиДату(ТекстовыйПосторитель, Дата)
	
	ТекстHTML = ТекстовыйПосторитель.Закрыть();
	
	ШаблонДаты = 
	"<tr>
	|<td colspan='3'>
	|<p class='date'>{Дата}</p>
	|</td>	
	|</tr>";
	
	Индекс   = СтрНайти(ТекстHTML, "<tr>", НаправлениеПоиска.СКонца);
	ДатаHTML = СтрЗаменить(ШаблонДаты, "{Дата}", ПолучитьПредставлениеДаты(Дата));
	Если Индекс > 0 Тогда
		ТекстHTML = Сред(ТекстHTML, 1, Индекс - 1) + СокрЛП(ДатаHTML); // заменяем последнюю пустую строку на дату, иначе получаем лишнюю строку
	Иначе
		ТекстHTML = ТекстHTML + ДатаHTML;
	КонецЕсли;
	
	ТекстовыйПосторитель = Новый ЗаписьXML;
	ТекстовыйПосторитель.УстановитьСтроку();			
	ТекстовыйПосторитель.ЗаписатьБезОбработки(ТекстHTML);									
	
КонецПроцедуры

// Функция, формирует блок визит.
//
Функция СформироватьБлокПредварительнаяЗапись(Запись, Статус, ЦветФона = "", Запланировано = Ложь)
	
	Если Запись.Статус = Перечисления.СтатусыСобытия.ПриемОтменен Тогда
		ЦветФона = "#f7a1a1"; 
	КонецЕсли;
	
	ТекстHTML = 
	"<tr>
	|<td align='right' class='left_col' style='background-color: inherit;'>
	|<img alt='Визит' src='data:image/png;base64, {Картинка}'/>
	|</td>
	|<td class='center_col'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|<p class='content'><a href='{Ссылка}' title='Открыть предварительную запись'>{Представление}</a></p>";
	
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Ссылка}"        , ПолучитьНавигационнуюСсылку(Запись));
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Представление}" , ПолучитьПредставлениеПредварительнойЗаписи(Запись, Запись.Статус, Запланировано));
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Картинка}"		 , Base64Строка(БиблиотекаКартинок.PNG_КалендарьПредварительнаяЗапись_16х16.ПолучитьДвоичныеДанные()));
		
	ВремЗапасы = Запись.Услуги.Выгрузить().Скопировать(); 
	ВремЗапасы.Свернуть("Номенклатура");                 
	
	Для Каждого Номенклатура Из ВремЗапасы.ВыгрузитьКолонку("Номенклатура") Цикл
		
		Шаблон = "<p class='content' title='{Номенклатура}'>{Номенклатура}</p>";
		ТекстHTML = ТекстHTML + Символы.ПС + СтрЗаменить(Шаблон, "{Номенклатура}", Строка(Номенклатура));			 	
		
	КонецЦикла;
	
	ТекстHTML = ТекстHTML + 
	"</td>
	|<td class='right_col' align='right'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|";
	
	УстановитьПривилегированныйРежим(Истина);
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СобытиеУслуги.Сотрудник КАК Сотрудник,
	|	СобытиеУслуги.Сотрудник.Должность КАК СотрудникДолжность
	|ИЗ
	|	Документ.Событие.Услуги КАК СобытиеУслуги   	
	|ГДЕ
	|	СобытиеУслуги.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	СотрудникДолжность");
	
	Запрос.УстановитьПараметр("Ссылка", Запись);
	ВыборкаПоДолжностям = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Пока ВыборкаПоДолжностям.Следующий() Цикл
		
		СотрудникHTML = "";	
		
		УровеньСотрудник = ВыборкаПоДолжностям.Выбрать();		
		Пока УровеньСотрудник.Следующий() Цикл
			СотрудникHTML = СотрудникHTML + "<p class='author' title='{Сотрудник}'>{Сотрудник}</p>";
			СотрудникHTML = СтрЗаменить(СотрудникHTML, "{Сотрудник}", Запись.АвторДокумента);
		КонецЦикла;
		
		ТекстHTML = ТекстHTML + СотрудникHTML + Символы.ПС;
		
	КонецЦикла;
	
	ТекстHTML = ТекстHTML + "<a class='reference' style='background: {НавигационнаяСсылкаЦвет}' href='{НавигационнаяСсылка}' title='{НавигационнаяСсылкаПодсказка}'>{НавигационнаяСсылкаПредставление}</a>";
	
	ФормированиеБлокаВзаимодействияУстановитьЗначенияНавигационнойСсылки(ТекстHTML, Запись.Сделка, Запись);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТекстHTML + "</td>" + Символы.ПС + "</tr>";
	
КонецФункции

// Функция, формирует блок визит.
//
Функция СформироватьБлокПрофосмотр(СтрокаТЗ, Статус, ЦветФона = "", Запланировано = Ложь)
	
	ТекстHTML = 
	"<tr>
	|<td align='right' class='left_col' style='background-color: inherit;'>
	|<img alt='Визит' src='data:image/svg+xml;base64, {Картинка}'/>
	|</td>
	|<td class='center_col'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|<p class='content'><a href='{Ссылка}' class='profs' title='Открыть профосмотр' id='{ИдПрофосмотра}'> {Представление}</a> {Описание}</p>";
	
	Уид = СтрокаТЗ.ПолучитьИдентификатор();
	
	ПредставлениеДаты = ?(Запланировано,  ПолучитьПредставлениеДаты(СтрокаТЗ.Дата) + ", ", ""); 
	
	
	ТекстHTML = СтрЗаменить(ТекстHTML, "{ИдПрофосмотра}" 	, Уид);
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Представление}" 	, ПредставлениеДаты + Строка(СтрокаТЗ.ВидОсмотра) + " (" + СтрокаТЗ.Статус + "). ");
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Описание}" 		, СтрокаТЗ.ПричинаНаправления);
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Картинка}"		 	, Base64Строка(БиблиотекаКартинок.Профосмотр16х16.ПолучитьДвоичныеДанные()));
	
	ТекстHTML = ТекстHTML + 
	"</td>
	|<td class='right_col' align='right'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|";
	
	СотрудникHTML = ""; 		
	
	СотрудникHTML = "<p class='author' title='{Сотрудник}'>{Сотрудник}</p>";
	СотрудникHTML = СтрЗаменить(СотрудникHTML, "{Сотрудник}", ПредставлениеФИОСотрудника(СтрокаТЗ.Сотрудник));
	
	ТекстHTML = ТекстHTML + СотрудникHTML + Символы.ПС;
	
	Возврат ТекстHTML + "</td>" + Символы.ПС + "</tr>";
	
КонецФункции

// Функция, формирует блок визит.
//
Функция СформироватьБлокПрием(Прием, Статус, ЦветФона = "", Запланировано = Ложь)
	
	Если ЗначениеЗаполнено(Прием.ПолисМедСтрахования) Тогда	
		ЦветФона = "#c3eefa";		
	КонецЕсли;
	
	ТекстHTML = 
	"<tr>
	|<td align='right' class='left_col' style='background-color: inherit;'>
	|<img alt='Прием' src='data:image/png;base64, {Картинка}'/>
	|</td>
	|<td class='center_col'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|<p class='content'><a href='{Ссылка}' title='Открыть прием'>{Представление}</a>Сумма: {Сумма} Оплачено: {Оплачено}</p>";
	
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Ссылка}"        , ПолучитьНавигационнуюСсылку(Прием));
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Представление}" , ПолучитьПредставлениеПриема(Прием, Статус, Запланировано));
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Картинка}"		 , Base64Строка(БиблиотекаКартинок.PNG_СтетоскопПриемВрача_16х16.ПолучитьДвоичныеДанные()));
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Оплачено}"		 , "" + Прием.СуммаОплачено + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольноеПредставлениеВалюты());
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Сумма}"		 , "" + Прием.СуммаДокумента + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольноеПредставлениеВалюты());
	
	ТаблицаЗапасов 		= Прием.Лечение.Выгрузить().Скопировать(); 
	ВремТаблицаЗапасов 	= ТаблицаЗапасов.Скопировать();
	ВремТаблицаЗапасов.Свернуть("Номенклатура");
	
	Для Каждого Номенклатура Из ВремТаблицаЗапасов.ВыгрузитьКолонку("Номенклатура") Цикл
		
		МассивСтрокТаблицы  = ТаблицаЗапасов.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура)); 
		КоличествоСтрок    	= МассивСтрокТаблицы.Количество();
		СтрокаЗубов = "Зубы: ";
		
		Для Счетчик = 0 По КоличествоСтрок - 1 Цикл 	
			
			Если Счетчик <> КоличествоСтрок - 1 Тогда                // Это не последний элемент.
				СтрокаЗубов = СтрокаЗубов + МассивСтрокТаблицы[Счетчик].Зуб + ", "; 
			Иначе 
				СтрокаЗубов = СтрокаЗубов + МассивСтрокТаблицы[Счетчик].Зуб;	 
			КонецЕсли; 
			
		КонецЦикла;
		
		ОбщаяСтрокаНоменклатуры = СтрокаЗубов + " - " + Строка(Номенклатура);
	
		Шаблон = "<p class='content' title='{Номенклатура}'>{Номенклатура}</p>";
		ТекстHTML = ТекстHTML + Символы.ПС + СтрЗаменить(Шаблон, "{Номенклатура}"	, ОбщаяСтрокаНоменклатуры);			 	
				
	КонецЦикла;
		
	ТекстHTML = ТекстHTML + 
	"</td>
	|<td class='right_col' align='right'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|";
	
	УстановитьПривилегированныйРежим(Истина);
	
	СотрудникHTML = ""; 		
	
	СотрудникHTML = "<p class='author' title='{Сотрудник}'>{Сотрудник}</p>";
	СотрудникHTML = СтрЗаменить(СотрудникHTML, "{Сотрудник}", ПредставлениеФИОСотрудника(Прием.Сотрудник));
	Если ЗначениеЗаполнено(Прием.Ассистент) Тогда
		СотрудникHTML = СотрудникHTML + "<p class='author' title='{Ассистент}'>{Ассистент}</p>";
		СотрудникHTML = СтрЗаменить(СотрудникHTML, "{Ассистент}", ПредставлениеФИОСотрудника(Прием.Ассистент));
	КонецЕсли;			
	
	ТекстHTML = ТекстHTML + СотрудникHTML + Символы.ПС;
	
	
	ТекстHTML = ТекстHTML + "<a class='reference' style='background: {НавигационнаяСсылкаЦвет}' href='{НавигационнаяСсылка}' title='{НавигационнаяСсылкаПодсказка}'>{НавигационнаяСсылкаПредставление}</a>";
	
	ФормированиеБлокаВзаимодействияУстановитьЗначенияНавигационнойСсылки(ТекстHTML, Прием.Сделка, Прием);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТекстHTML + "</td>" + Символы.ПС + "</tr>";
	
КонецФункции 

// Функция, формирует блок визит.
//
Функция СформироватьБлокНарядЗаказ(НарядЗаказ, Статус, ЦветФона = "", Запланировано = Ложь)
	
	ТекстHTML = 
	"<tr>
	|<td align='right' class='left_col' style='background-color: inherit;'>
	|<img alt='Прием' src='data:image/svg+xml;base64, {Картинка}'/>      
	|</td>
	|<td class='center_col'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|<p class='content'><a href='{Ссылка}' title='Открыть наряд заказ'>{Представление}</a>Сумма: {Сумма}</p>";
	
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Ссылка}"        , ПолучитьНавигационнуюСсылку(НарядЗаказ));
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Представление}" , ПолучитьПредставлениеНарядЗаказа(НарядЗаказ, Статус, Запланировано));
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Картинка}"		 , Base64Строка(БиблиотекаКартинок.НарядЗаказ16х16.ПолучитьДвоичныеДанные()));
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Сумма}"		 , "" + НарядЗаказ.СуммаДокумента + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольноеПредставлениеВалюты());
	
	ВремЗапасы = НарядЗаказ.Запасы.Выгрузить().Скопировать(); 
	ВремЗапасы.Свернуть("Номенклатура");                 
	
	Для Каждого Номенклатура Из ВремЗапасы.ВыгрузитьКолонку("Номенклатура") Цикл
		
		Шаблон = "<p class='content' title='{Номенклатура}'>{Номенклатура}</p>";
		ТекстHTML = ТекстHTML + Символы.ПС + СтрЗаменить(Шаблон, "{Номенклатура}", Строка(Номенклатура));			 	
		
	КонецЦикла;
	
	ТекстHTML = ТекстHTML + 
	"</td>
	|<td class='right_col' align='right'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|";
	
	УстановитьПривилегированныйРежим(Истина);
	
	СотрудникHTML = ""; 		
	
	СотрудникHTML = "<p class='author' title='{Сотрудник}'>{Сотрудник}</p>";
	СотрудникHTML = СтрЗаменить(СотрудникHTML, "{Сотрудник}", ПредставлениеФИОСотрудника(НарядЗаказ.Сотрудник));			
	
	ТекстHTML = ТекстHTML + СотрудникHTML + Символы.ПС;
		
	ТекстHTML = ТекстHTML + "<a class='reference' style='background: {НавигационнаяСсылкаЦвет}' href='{НавигационнаяСсылка}' title='{НавигационнаяСсылкаПодсказка}'>{НавигационнаяСсылкаПредставление}</a>";
	
	ФормированиеБлокаВзаимодействияУстановитьЗначенияНавигационнойСсылки(ТекстHTML, ,НарядЗаказ);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТекстHTML + "</td>" + Символы.ПС + "</tr>";
	
КонецФункции

// Функция, формирует блок диалог.
//
Функция СформироватьБлокДиалог(СтрокаТЗ, ТегДиалогаОткрыт)
	
	Если СтрокаТЗ.ВзаимодействиеИд = "0" Тогда
		// Сообщение от клиента.
		ШаблонДиалог = "
		|<tr>
		|	<td colspan='2' width=585px>
		|		<div style='float: right; color:gray'>{ДатаСообщения}</div>
		|		<div class='block_right'>
		|			<div><p class='leftstr'>{ТекстСообщения}</p></div>	
		|		</div>
		|	</td>
		|</tr>";
				
	Иначе
		// Сообщение от менеджера.
		ШаблонДиалог = "
		|<tr>
		|	<td colspan='2' width=585px>
		|		<div style='float: left; color:gray'>{ДатаСообщения}</div>
		|		<div class='block_left'><p class='leftstr'>{ТекстСообщения}</p></div>
		|	</td>
		|</tr>";
		
	КонецЕсли;
	
	Если ТегДиалогаОткрыт Тогда
		ШаблонДиалог =  ШаблонДиалог + "
		|<tr>
		|<td colspan='3' style='height: 8px;'>
		|</td>	
		|</tr>";
	
	КонецЕсли;

	Уид = СтрокаТЗ.ПолучитьИдентификатор();
	
	// Посимвольно очищаем строку от недопустимых символов с конца,
	// на случай если в конец попала половина составного символа. Татарой.
	
	ТекстСодержания = ?(СтрокаТЗ.ТекстСообщения = "", СтрокаТЗ.Ссылка.Содержание, СтрокаТЗ.ТекстСообщения);  
	
	ДлинаСтрокиРезультат = СтрДлина(ТекстСодержания);
	ПоследнийСимвол = "";
	
	Пока Не ЗначениеЗаполнено(ПоследнийСимвол) Цикл
		
		Если ДлинаСтрокиРезультат = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ПоследнийСимвол = ОбщегоНазначенияКлиентСерверСтоматология.УдалитьНедопустимыеСимволыXMLРабочая(Сред(ТекстСодержания, ДлинаСтрокиРезультат, 1));
		
		Если ЗначениеЗаполнено(ПоследнийСимвол) Тогда
			Прервать;
		КонецЕсли;
		
		ДлинаСтрокиРезультат = ДлинаСтрокиРезультат - 1;
		
	КонецЦикла;
	
	ТекстСообщения = Лев(ТекстСодержания, ДлинаСтрокиРезультат);
	
	Сообщение =  ?(ЗначениеЗаполнено(ТекстСообщения), ТекстСообщения, "...");
	ШаблонДиалог = СтрЗаменить(ШаблонДиалог, "{ТекстСообщения}"	, Сообщение);
	ШаблонДиалог = СтрЗаменить(ШаблонДиалог, "{ДатаСообщения}"	, Формат(СтрокаТЗ.Дата, "ДФ=HH:mm"));
	
	Возврат ШаблонДиалог;		
	
КонецФункции

// Процедура - Сформировать блок взаимодействия получить значения навигационной ссылки.
//
// Параметры:
//  Задача					 - 	 - 
//  ТипЗадачи				 - 	 - 
//  ДопДанныеПодсказка		 - 	 - 
//  ДопДанныеПредставление	 - 	 - 
//  ДопДанныеЦвет			 - 	 - 
//  НавигационнаяСсылка		 - 	 - 
//  ЦветФона				 - 	 - 
//
Процедура ФормированиеБлокаВзаимодействияУстановитьЗначенияНавигационнойСсылки(ШаблонБлока, СделкаВзаимодействия = Неопределено, ОбъектВзаимодействия = Неопределено)
	
	// Если передана сделка взаимодействия.
	Если ЗначениеЗаполнено(СделкаВзаимодействия) И ТипЗнч(СделкаВзаимодействия) = Тип("СправочникСсылка.Сделки") Тогда
		ДанныеСделки 		= ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(СделкаВзаимодействия, "Наименование, Код, ВидСделки, ЭтапСделки, Врач");
		ВидСделки 			= ДанныеСделки.ВидСделки;
		Врач 				= ДанныеСделки.Врач;
		
		НаименованиеСделки 	= Справочники.Сделки.ИнициализироватьСокращенноеНаименованиеСделки(ДанныеСделки, Истина, , Истина);
		
		Если НЕ ЗначениеЗаполнено(НаименованиеСделки) Тогда 
			НаименованиеСделки = ?(ЗначениеЗаполнено(ДанныеСделки.Наименование), ДанныеСделки.Наименование, Справочники.Сделки.СоздатьНаименованиеСделки(СделкаВзаимодействия));
			НаименованиеСделки = СокрЛП(НаименованиеСделки) + " " + Справочники.Сделки.ПолучитьСокращенноеНаименованиеВрача(, ДанныеСделки.Врач); 
		КонецЕсли;	
		НавигационнаяСсылкаПредставление = НаименованиеСделки;
		НавигационнаяСсылкаПодсказка     = НавигационнаяСсылкаПредставление;
		НавигационнаяСсылкаЦвет          = ПолучитьЦветДляСделки(, ДанныеСделки.ЭтапСделки);
		НавигационнаяСсылка              = ПолучитьНавигационнуюСсылку(СделкаВзаимодействия);  
	ИначеЕсли ЗначениеЗаполнено(ОбъектВзаимодействия) Тогда 
		Если ОбщегоНазначенияСтоматология.ЕстьРеквизитОбъекта("Сделка", , ОбъектВзаимодействия) Тогда
			Сделка = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ОбъектВзаимодействия, "Сделка");
			Если ЗначениеЗаполнено(Сделка) Тогда 
				ДанныеСделки 		= ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(Сделка, "Наименование, Код, ВидСделки, ЭтапСделки, Врач");
				ВидСделки 			= ДанныеСделки.ВидСделки;
				Врач 				= ДанныеСделки.Врач;
				
				НаименованиеСделки 	= Справочники.Сделки.ИнициализироватьСокращенноеНаименованиеСделки(ДанныеСделки, Истина, , Истина);
				
				Если НЕ ЗначениеЗаполнено(НаименованиеСделки) Тогда 
					НаименованиеСделки = ?(ЗначениеЗаполнено(ДанныеСделки.Наименование), ДанныеСделки.Наименование, Справочники.Сделки.СоздатьНаименованиеСделки(Сделка));
					НаименованиеСделки = СокрЛП(НаименованиеСделки) + " " + Справочники.Сделки.ПолучитьСокращенноеНаименованиеВрача(, ДанныеСделки.Врач); 
				КонецЕсли;	
				НавигационнаяСсылкаПредставление = НаименованиеСделки;
				НавигационнаяСсылкаПодсказка     = НавигационнаяСсылкаПредставление;
				НавигационнаяСсылкаЦвет          = "rgb(236, 236, 159)";
				НавигационнаяСсылка              = ПолучитьНавигационнуюСсылку(Сделка);  
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ШаблонБлока = СтрЗаменить(ШаблонБлока, "{НавигационнаяСсылкаПредставление}", НавигационнаяСсылкаПредставление);
	ШаблонБлока = СтрЗаменить(ШаблонБлока, "{НавигационнаяСсылкаПодсказка}"    , НавигационнаяСсылкаПодсказка);
	ШаблонБлока = СтрЗаменить(ШаблонБлока, "{НавигационнаяСсылкаЦвет}"         , НавигационнаяСсылкаЦвет);
	ШаблонБлока = СтрЗаменить(ШаблонБлока, "{НавигационнаяСсылка}"             , НавигационнаяСсылка);	
		
КонецПроцедуры

// Функция - Получить цвет для бизнес процесса.
//
// Параметры:
//  БизнесПроцесс	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЦветДляСделки(Сделка = Неопределено, ЭтапСделки = Неопределено)
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Сделка) И НЕ ЗначениеЗаполнено(ЭтапСделки) Тогда
		Возврат "";
	КонецЕсли;
	
	ЦветЭтапа = "";
	Если НЕ ЗначениеЗаполнено(ЭтапСделки) Тогда 
		ЭтапСделки 	= ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Сделка, "ЭтапСделки");
		Если ЗначениеЗаполнено(ЭтапСделки) Тогда
			Если ЭтапСделки = Справочники.ЭтапыСделок.Успех Тогда 
				ЦветЭтапа = Новый Цвет(72, 193, 123);
			ИначеЕсли ЭтапСделки = Справочники.ЭтапыСделок.Отказ Тогда 
				ЦветЭтапа = Новый Цвет(246, 110, 110);
			Иначе 	
				ЦветЭтапа 	= ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ЭтапСделки, "ЦветЭтапа");
			КонецЕсли;	
		Иначе 
			ЦветЭтапа 	= "";
		КонецЕсли;	
	Иначе 
		Если ЭтапСделки = Справочники.ЭтапыСделок.Успех Тогда 
			ЦветЭтапа = Новый Цвет(72, 193, 123);
		ИначеЕсли ЭтапСделки = Справочники.ЭтапыСделок.Отказ Тогда 
			ЦветЭтапа = Новый Цвет(246, 110, 110);
		Иначе 	
			ЦветЭтапа 	= ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ЭтапСделки, "ЦветЭтапа");
		КонецЕсли;	
	КонецЕсли;	
	Цвет      		= ?(ТипЗнч(ЦветЭтапа) = Тип("Цвет"), ЦветЭтапа, ?(ТипЗнч(ЦветЭтапа) = Тип("Строка") И ЗначениеЗаполнено(ЦветЭтапа), ЗначениеИзСтрокиВнутр(ЦветЭтапа), Неопределено));	
		
	Возврат ?(Цвет <> Неопределено, СтрШаблон("rgb(%1,%2,%3)", Цвет.Красный, Цвет.Зеленый, Цвет.Синий), "");
	
КонецФункции

// Функция, выводит пустую строку.
//
Функция ДобавитьПустуюСтроку(ЦветФона = "")
	
	Возврат 
	"<tr" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|<td colspan='3' style='height: 8px;'>
	|</td>	
	|</tr>";
	
КонецФункции

// Функция, формирует блок показать еще.
//
Функция ВывестиБлокПоказатьЕще(ТекстовыйПосторитель, Текст)
	
	БлокИнформация =   
	"<tr>
	|<td colspan='3'>
	|<p class='info' style='color: #1fa3ff; font: 16px arial;'><a style='color: #1fa3ff;' id='more' href=''>{Текст}</a></p>
	|</td>	                               
	|</tr>";
	
	БлокИнформация = СтрЗаменить(БлокИнформация, "{Текст}", Текст);	
	ТекстовыйПосторитель.ЗаписатьБезОбработки(БлокИнформация);									
	
КонецФункции

// Функция, проверяет отключены ли все фильтры.
//
Функция ВсеФильтрыОтключены(Фильтры)
	
	Для Каждого Фильтр Из Фильтры Цикл
		Если Фильтр.Значение = Истина Тогда
			Возврат Ложь;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Функция - Получить представление даты
//
// Параметры:
//  Период	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПредставлениеДаты(Период)
	
	Если НачалоДня(ТекущаяДатаСеанса()) = НачалоДня(Период) Тогда
		
		Дата = "Сегодня";
		
	ИначеЕсли НачалоДня(НачалоДня(ТекущаяДатаСеанса())-1) = НачалоДня(Период) Тогда
		
		Дата = "Вчера";
		
	ИначеЕсли НачалоДня(КонецДня(ТекущаяДатаСеанса())+1) = НачалоДня(Период) Тогда
		
		Дата = "Завтра";
		
	Иначе
		
		Дата = Формат(Период, "ДЛФ=DD");
		
	КонецЕсли;
	
	Возврат Дата;

КонецФункции

// Функция, возвращает представление визита.
//
Функция ПолучитьПредставлениеПредварительнойЗаписи(Событие, СтатусЗаписи, Запланировано = Ложь)
	
	Представление = "";
		
	Состояние = "";
	Если Событие.ПометкаУдаления Тогда
		Состояние = НСтр("ru='(удален)'");
	ИначеЕсли НЕ Событие.Проведен Тогда
		Состояние = НСтр("ru='(не проведен)'");
	КонецЕсли;
	
	Статус = "Предварительная запись";
	
	ДатаДокумента = "на " + Формат(Событие.Дата, "ДФ=HH:мм") + ?(Запланировано, ", " + Формат(Событие.Дата, "ДЛФ=DD"), "") + " {Статус}";
	
	Если СтатусЗаписи = Перечисления.СтатусыСобытия.ПриемОтменен
		Или СтатусЗаписи = Перечисления.СтатусыСобытия.ПриемНеСостоялся Тогда 
		ДатаДокумента = СтрЗаменить(ДатаДокумента, "{Статус}", "<span style='color: red;'>(" + СокрЛП(Строка(СтатусЗаписи)) + ")</span>");	
	Иначе
		ДатаДокумента = СтрЗаменить(ДатаДокумента, "{Статус}", "(" + СокрЛП(Строка(СтатусЗаписи)) + ")");
	КонецЕсли;
	
	СтруктураДатаНачалаИДатаОкончания = Документы.Событие.ПолучитьПродолжительностьСобытия(Событие);
	
	ВремяСобытияВМинутах = "";
	
	Если ЗначениеЗаполнено(СтруктураДатаНачалаИДатаОкончания) 
		И ЗначениеЗаполнено(СтруктураДатаНачалаИДатаОкончания.ДатаНачала) 
		И ЗначениеЗаполнено(СтруктураДатаНачалаИДатаОкончания.ДатаОкончания) Тогда
		
		ВремяСобытияВМинутах = Строка(Окр(((СтруктураДатаНачалаИДатаОкончания.ДатаОкончания - СтруктураДатаНачалаИДатаОкончания.ДатаНачала)/60), 0, РежимОкругления.Окр15как20)) + " " + "мин.";
		
	КонецЕсли;
		
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru='%1 %2 %3 %4'"),
	Статус,
	ВремяСобытияВМинутах,
	ДатаДокумента,
	Состояние);
	
	Возврат Представление;
	
КонецФункции

// Функция, возвращает представление визита.
//
Функция ПолучитьПредставлениеПриема(Прием, СтатусВизита, Запланировано = Ложь)
	
	Представление = "";
		
	Состояние = "";
	Если Прием.ПометкаУдаления Тогда
		Состояние = НСтр("ru='(удален)'");
	ИначеЕсли НЕ Прием.Проведен Тогда
		Состояние = НСтр("ru='(не проведен)'");
	КонецЕсли;
	
	ВремяПриемаВМинутах = "";

	Если ЗначениеЗаполнено(Прием.ВремяНачалаПриема) И ЗначениеЗаполнено(Прием.ВремяОкончанияПриема) Тогда 	
		ВремяПриемаВМинутах = Строка(Окр((Прием.ВремяОкончанияПриема - Прием.ВремяНачалаПриема)/60, 0, РежимОкругления.Окр15как20)) + " " + "мин.";	
	КонецЕсли;
	
	Статус = "Прием";
	ДатаДокумента = "в " + Формат(Прием.ВремяНачалаПриема, "ДФ=HH:мм") + ?(Запланировано, ", " + Формат(Прием.ВремяНачалаПриема, "ДЛФ=DD"), "");
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru='%1 %2 %3 %4'"),
	Статус,
	ВремяПриемаВМинутах,
	ДатаДокумента,
	Состояние);
	
	Возврат Представление;
	
КонецФункции 

// Функция, возвращает представление визита.
//
Функция ПолучитьПредставлениеНарядЗаказа(НарядЗаказ, Статус, Запланировано = Ложь)
	
	Представление = "";
		
	Состояние = "";
	Если НарядЗаказ.ПометкаУдаления Тогда
		Состояние = НСтр("ru='(удален)'");
	ИначеЕсли НЕ НарядЗаказ.Проведен Тогда
		Состояние = НСтр("ru='(не проведен)'");
	КонецЕсли;
	
	ПредставлениеНарядЗаказа = "Наряд заказ";
	ДатаДокумента = Формат(НарядЗаказ.Дата, "ДФ=HH:мм") + ?(Запланировано, ", " + Формат(НарядЗаказ.Дата, "ДЛФ=DD"), "");
	
	Статус = ?(Статус = "Нет", "(Открыт) ", "(Закрыт) "); 
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru='%1 %2 %3'"),
	ПредставлениеНарядЗаказа,
	ДатаДокумента,
	Статус);
	
	Возврат Представление;
	
КонецФункции

// Функция - Представление ФИОСотрудника
//
// Параметры:
//  Сотрудник	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПредставлениеФИОСотрудника(Сотрудник) 
	
	УстановитьПривилегированныйРежим(Истина);
	Если ЗначениеЗаполнено(Сотрудник.Фамилия) ИЛИ ЗначениеЗаполнено(Сотрудник.Имя) Тогда 
		Возврат ?(ЗначениеЗаполнено(Сотрудник.Фамилия), Сотрудник.Фамилия + "","")
		+ ?(ЗначениеЗаполнено(Сотрудник.Имя)," " + Лев(СокрЛП(Сотрудник.Имя), 1) + ".","")
		+ ?(ЗначениеЗаполнено(Сотрудник.Отчество)," " + Лев(СокрЛП(Сотрудник.Отчество), 1) + ".", "");
	Иначе
		Возврат Сотрудник.Наименование;
	КонецЕсли;	
	
КонецФункции

// Функция, возвращает структуру контактной информации.
//
Функция ПолучитьКонтактнуюИнформациюКлиента(Клиент, ДобавитьКодСтраны = Ложь) Экспорт
	
	EmailСтроки = Клиент.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
	Email = Неопределено;
	Если EmailСтроки.Количество() > 0 Тогда
	  Email = EmailСтроки[0].АдресЭП;
	КонецЕсли;
	
	ТелефонСтроки = Клиент.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
	НомерТелефона = Неопределено;
	Если ТелефонСтроки.Количество() > 0 Тогда
		
		НомерТелефона = ТелефонСтроки[0].НомерТелефона;
		
		СписокПолей = Новый СписокЗначений;
		УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(НомерТелефона, СписокПолей); 
		НомерТелефона = ?(ДобавитьКодСтраны, СписокПолей[0].Значение, "") + СписокПолей[1].Значение + СписокПолей[2].Значение;
		
	КонецЕсли;
	
	Возврат Новый Структура("Email, Телефон", Email, НомерТелефона);
	
КонецФункции

// Представление ФИО
//
Функция ПредставлениеФИОКонтрагента(Контаргент, ДобавитьТелефон = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(Контаргент.Фамилия) ИЛИ ЗначениеЗаполнено(Контаргент.Имя) Тогда 
		Возврат ?(ЗначениеЗаполнено(Контаргент.Фамилия), Контаргент.Фамилия + "","")
		+ ?(ЗначениеЗаполнено(Контаргент.Имя)," " + Лев(Контаргент.Имя, 1) + ".","")
		+ ?(ЗначениеЗаполнено(Контаргент.Отчество)," " + Лев(Контаргент.Отчество, 1) + ".", "")
		+ ?(ДобавитьТелефон и ЗначениеЗаполнено(Контаргент.Телефон),", "+Контаргент.Телефон, "");
	Иначе
		Возврат Контаргент.Наименование;
	КонецЕсли;	
	
КонецФункции

// Функция - возвращает массив сообщений для исключения основного запроса.
// 
// Возвращаемое значение:
//   Массив 
//
Функция ПолучитьМассивСообщенийИсключенияПоСделке(Контрагент, Сделка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|ПОМЕСТИТЬ ВТТелефоны
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
	|	И КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ОбъектыОтбора
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Заявки.Ссылка
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|ГДЕ
	|	Заявки.ОсновнойКлиент = &Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КонтактыМессенджеров.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ТаблицаИдентификаторовКонтактовМессенджеров
	|ИЗ
	|	РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
	|ГДЕ
	|	КонтактыМессенджеров.ОбъектИдентификации В
	|			(ВЫБРАТЬ
	|				ОбъектыОтбора.Ссылка КАК Ссылка
	|			ИЗ
	|				ОбъектыОтбора КАК ОбъектыОтбора)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Событие.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТОбъектыТриггерныхСобытийИсключения
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.ПометкаУдаления = ЛОЖЬ
	|	И Событие.Сделка <> &Сделка
	|	И Событие.Контрагент = &Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Прием.Ссылка
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.ПометкаУдаления = ЛОЖЬ
	|	И Прием.Сделка <> &Сделка
	|	И Прием.Контрагент = &Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Сделки.Ссылка
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.ПометкаУдаления = ЛОЖЬ
	|	И Сделки.Ссылка <> &Сделка
	|	И Сделки.Контрагент = &Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналРегистрацииТриггерныхСобытий.SMSРассылка КАК SMSРассылка,
	|	ЖурналРегистрацииТриггерныхСобытий.IDСообщения КАК IDСообщения,
	|	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ВТПредварительныеСообщения
	|ИЗ
	|	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
	|ГДЕ
	|	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия В
	|			(ВЫБРАТЬ
	|				ВТОбъектыТриггерныхСобытийИсключения.Ссылка КАК Ссылка
	|			ИЗ
	|				ВТОбъектыТриггерныхСобытийИсключения КАК ВТОбъектыТриггерныхСобытийИсключения)
	|	И (ЖурналРегистрацииТриггерныхСобытий.SMSРассылка <> ЗНАЧЕНИЕ(Документ.РассылкаСообщений.ПустаяСсылка)
	|			ИЛИ ЖурналРегистрацииТриггерныхСобытий.IDСообщения <> """")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыСообщений.IDСообщения КАК ИДСообщения
	|ПОМЕСТИТЬ ВТИдСообщенийПоСделке
	|ИЗ
	|	РегистрСведений.СтатусыСообщений КАК СтатусыСообщений
	|ГДЕ
	|	(СтатусыСообщений.РассылкаСообщений, СтатусыСообщений.Получатель) В
	|			(ВЫБРАТЬ
	|				ВТПредварительныеСообщения.SMSРассылка КАК SMSРассылка,
	|				ВТПредварительныеСообщения.Контрагент КАК Контрагент
	|			ИЗ
	|				ВТПредварительныеСообщения КАК ВТПредварительныеСообщения
	|			ГДЕ
	|				ВТПредварительныеСообщения.SMSРассылка <> ЗНАЧЕНИЕ(Документ.РассылкаСообщений.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЖурналСообщений.ИдСообщения
	|ИЗ
	|	РегистрСведений.ЖурналСообщений КАК ЖурналСообщений
	|ГДЕ
	|	ЖурналСообщений.ИдДиалога В
	|			(ВЫБРАТЬ
	|				ВТПредварительныеСообщения.IDСообщения КАК IDСообщения
	|			ИЗ
	|				ВТПредварительныеСообщения КАК ВТПредварительныеСообщения
	|			ГДЕ
	|				ВТПредварительныеСообщения.IDСообщения <> """")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналСообщений.ИдСообщения КАК ИдСообщения
	|ИЗ
	|	РегистрСведений.ЖурналСообщений КАК ЖурналСообщений
	|ГДЕ
	|	ЖурналСообщений.ИдСообщения В
	|			(ВЫБРАТЬ
	|				ВТИдСообщенийПоСделке.ИДСообщения КАК ИДСообщения
	|			ИЗ
	|				ВТИдСообщенийПоСделке КАК ВТИдСообщенийПоСделке)
	|	И ЖурналСообщений.ИдКлиента В
	|			(ВЫБРАТЬ
	|				ТаблицаИдентификаторовКонтактовМессенджеров.Идентификатор КАК Идентификатор
	|			ИЗ
	|				ТаблицаИдентификаторовКонтактовМессенджеров КАК ТаблицаИдентификаторовКонтактовМессенджеров)
	|	И ЖурналСообщений.СлужебноеСообщение = ЛОЖЬ
	|	И ЖурналСообщений.ОжиданиеСообщения = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Контрагент"				, Контрагент);
	Запрос.УстановитьПараметр("Сделка"					, Сделка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИдСообщения");
	
КонецФункции

#КонецОбласти

#Область РаботаСФИО

// Функция раскладывает ФИО в структуру.
//
// Параметры:
//	 ФИО - строка - наименование.
//
// Возвращаемое значение:
//	 Структура - со свойствами: 
//     * Фамилия  - Строка
//     * Имя      - Строка
//     * Отчество - Строка
//
Функция ФамилияИмяОтчество(Знач ФИО) Экспорт
	
	СтруктураФИО = Новый Структура("Фамилия, Имя, Отчество");
	
	МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ФИО, " ");
	
	Если МассивПодстрок.Количество() > 0 Тогда
		СтруктураФИО.Вставить("Фамилия", МассивПодстрок[0]);
		Если МассивПодстрок.Количество() > 1 Тогда
			СтруктураФИО.Вставить("Имя", МассивПодстрок[1]);
		КонецЕсли;
		Если МассивПодстрок.Количество() > 2 Тогда
			Отчество = "";
			Для Шаг = 2 По МассивПодстрок.Количество()-1 Цикл
				Отчество = Отчество + МассивПодстрок[Шаг] + " ";
			КонецЦикла;
			СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(Отчество, 1);
			СтруктураФИО.Вставить("Отчество", Отчество);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураФИО;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли 
