
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты;

	Если ЭтоГруппа Тогда	
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
			И ДанныеЗаполнения.Свойство("Родитель") 
			И ЗначениеЗаполнено(ДанныеЗаполнения.Родитель) Тогда
		
			ТипКонтрагента = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ДанныеЗаполнения.Родитель, "ТипКонтрагента", "ТипКонтрагента");
		КонецЕсли;
		
		Если ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты Тогда
			Автокоррекция = 1;
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Родитель") 
			И ЗначениеЗаполнено(ДанныеЗаполнения.Родитель)  Тогда
		Родитель = ДанныеЗаполнения.Родитель;
		ТипКонтрагента = Родитель.ТипКонтрагента;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ТипКонтрагента") Тогда
		
		ТипКонтрагента = ДанныеЗаполнения.ТипКонтрагента;
		Если ТипЗнч(ДанныеЗаполнения.ТипКонтрагента) = Тип("ФиксированныйМассив") Тогда
			
			Родитель = Справочники.Контрагенты.ПолучитьПапкуПоТипу(ДанныеЗаполнения.ТипКонтрагента[0]);
			
		Иначе
			
			Если ДанныеЗаполнения.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты Тогда
				Родитель = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтруктурнаяЕдиница, "ГруппаКлиентов");
				Если Не ЗначениеЗаполнено(Родитель) Или Родитель.ПолучитьОбъект() = Неопределено Тогда
					Родитель = Справочники.Контрагенты.ПолучитьПапкуПоТипу(ДанныеЗаполнения.ТипКонтрагента);
				КонецЕсли;	
			Иначе
			    Родитель = Справочники.Контрагенты.ПолучитьПапкуПоТипу(ДанныеЗаполнения.ТипКонтрагента);
			КонецЕсли;

		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ТекущийРодитель") Тогда
        Родитель = ДанныеЗаполнения.ТекущийРодитель;
	Иначе
		Родитель = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтруктурнаяЕдиница, "ГруппаКлиентов");
		Если Не ЗначениеЗаполнено(Родитель) Или Родитель.ПолучитьОбъект() = Неопределено Тогда
			Родитель = Справочники.Контрагенты.ПолучитьПапкуПоТипу(Перечисления.ТипыКонтрагентов.Клиенты);
		КонецЕсли;
		ТипКонтрагента = Родитель.ТипКонтрагента;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ДатаРегистрации) Тогда
		ДатаРегистрации = ТекущаяДата();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СотрудникРегистрации) Тогда
		СотрудникРегистрации = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	// Заполнение реквизитов документа по умолчанию
	Если НЕ ОбщегоНазначения.ОбъектЯвляетсяГруппой(ЭтотОбъект) Тогда
		ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	КонецЕсли; 
	
	// Получаем тип контрагента по его родителю
	ТипКонтрагента = ?(ЗначениеЗаполнено(Родитель.ТипКонтрагента), Родитель.ТипКонтрагента, Перечисления.ТипыКонтрагентов.Клиенты);   
	
	Если ДанныеЗаполнения <> Неопределено И ДанныеЗаполнения.Свойство("ТекстЗаполнения") = Истина И ЗначениеЗаполнено(ДанныеЗаполнения.ТекстЗаполнения) Тогда
		ТекстЗаполнения = ДанныеЗаполнения.ТекстЗаполнения;
	КонецЕсли;
	
	Если ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты Тогда 
		Если НЕ ЗначениеЗаполнено(ТекстЗаполнения) И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ТекстЗаполнения") И ЗначениеЗаполнено(ДанныеЗаполнения.ТекстЗаполнения) Тогда 
			ТекстЗаполнения = ДанныеЗаполнения.ТекстЗаполнения;
		КонецЕсли; 
		Если НЕ ЗначениеЗаполнено(ТекстЗаполнения) И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("СтруктураФИО") Тогда // И ЗначениеЗаполнено(ДанныеЗаполнения.ТекстЗаполнения) Тогда 
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.СтруктураФИО);
			ОпределитьПол = Истина;
			// Если есть текст для заполнения - получаем ФИО и пол клиента
		ИначеЕсли ЗначениеЗаполнено(ТекстЗаполнения) Тогда 
			
			Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ДобавитьНомерТелефона") И ДанныеЗаполнения.ДобавитьНомерТелефона И СтрРазделить(ТекстЗаполнения, " ", Ложь).Количество() = 1 Тогда
				Имя			= ТекстЗаполнения;
			Иначе
				ФИО 		= ОбщегоНазначения.ВернутьФИОКлиента(ТекстЗаполнения);
				Фамилия 	= ФИО.Фамилия;
				Имя			= ФИО.Имя;
				Отчество 	= ФИО.Отчество;
			КонецЕсли;
		КонецЕсли;
		// Заполняем пол клиента, если он не был заполнен ранее
		Если НЕ ЗначениеЗаполнено(ПолКлиента)Тогда
			ПолКлиентаСтрокой = ОбщегоНазначенияКлиентСерверСтоматология.ОпределитьПолКлиента(Фамилия, Имя, Отчество);
			Если ПолКлиентаСтрокой = "Мужской" Тогда
				ПолКлиента = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской");
			ИначеЕсли ПолКлиентаСтрокой = "Женский" Тогда
				ПолКлиента = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Женский");
			КонецЕсли;
		КонецЕсли;		
		ЭтотОбъект.Наименование = Фамилия + ?(ЗначениеЗаполнено(Фамилия), " ", "") + Имя + ?(ЗначениеЗаполнено(Имя), " ", "") + Отчество;
		ЭтотОбъект.НаименованиеПолное = ЭтотОбъект.Наименование;
		
	ИначеЕсли ЗначениеЗаполнено(ТекстЗаполнения) Тогда
		ЭтотОбъект.Наименование = ТекстЗаполнения;
	КонецЕсли;
	
КонецПроцедуры
  
// Обработчик события ПриКопировании
//
Процедура ПриКопировании(ОбъектКопирования)
	
	Наименование       = "";
	
	Если НЕ ЭтоГруппа Тогда
		НаименованиеПолное = "";
		БанковскийСчетПоУмолчанию = Неопределено;
		ИНН = "";
		КПП = "";
		КодПоОКПО ="";
		ДатаРожденияКлиента = Неопределено;  
		ПолКлиента = неопределено;
		ДатаРегистрации = Неопределено;
		СотрудникРегистрации = "";
		Телефон = "";
		СтруктурнаяЕдиница = Неопределено;
		КодСинхронизации   = "";
	КонецЕсли;
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

// Процедура - Обработка проверки заполнения
//
// Параметры:
//  Отказ				 - 	 - 
//  ПроверяемыеРеквизиты - 	 - 
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка ИЛИ ДополнительныеСвойства.Свойство("ЭтоИзменениеФорматаТелефонныхНомеров") Тогда
		Возврат;
	КонецЕсли;	
		
	Если НЕ ЭтоГруппа И ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты Тогда 
		ХранилищеСтруктураОбязательныеПоля = Константы.ОбязательныеПоляКлиенты.Получить();
		СтруктураОбязательныеПоля = ХранилищеСтруктураОбязательныеПоля.Получить();	
		Если СтруктураОбязательныеПоля <> Неопределено Тогда
			Если СтруктураОбязательныеПоля.Свойство("Пол") И СтруктураОбязательныеПоля.Пол Тогда 
				ПроверяемыеРеквизиты.Добавить("ПолКлиента");
			КонецЕсли;
		КонецЕсли;  
	КонецЕсли;
	
	Если ЭтотОбъект.ЭтоГруппа = Ложь И ЭтотОбъект.ТипКонтрагента = Перечисления.ТипыКонтрагентов.СтраховаяКомпания И Не ЗначениеЗаполнено(КраткоеНаименование) Тогда 
		ТекстСообщения = НСтр("ru = 'Не заполнено Сокращенное наименование.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, , , Отказ);
	КонецЕсли;
	
	Если ЭтотОбъект.ТипКонтрагента <> Перечисления.ТипыКонтрагентов.Клиенты Тогда
		
		СтруктураДляПроверкиИННиКПП = Новый Структура;
		СтруктураДляПроверкиИННиКПП.Вставить("ИНН",								   ЭтотОбъект.ИНН);
		СтруктураДляПроверкиИННиКПП.Вставить("КПП",								   ЭтотОбъект.КПП);
		СтруктураДляПроверкиИННиКПП.Вставить("ОКПО",							   ЭтотОбъект.КодПоОКПО);
		СтруктураДляПроверкиИННиКПП.Вставить("ЭтоЮрЛицо", 						   ЭтотОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо);
		СтруктураДляПроверкиИННиКПП.Вставить("ПроверитьИНН",					   Истина);
		СтруктураДляПроверкиИННиКПП.Вставить("ПроверитьКПП",					   Истина);
		СтруктураДляПроверкиИННиКПП.Вставить("ПроверитьОКПО",					   Истина);
		
		ВозвращеннаяСтруктура = ПроверкаКонтрагентовКлиентСервер.ПроверитьКорректностьИННКПП(СтруктураДляПроверкиИННиКПП);
		
		Если ЗначениеЗаполнено(ВозвращеннаяСтруктура.НадписьПоясненияНекорректногоИНН) Тогда	
			ОбщегоНазначения.СообщитьПользователю(ВозвращеннаяСтруктура.НадписьПоясненияНекорректногоИНН, Ссылка,"Объект.ИНН",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВозвращеннаяСтруктура.НадписьПоясненияНекорректногоКПП) Тогда
			ОбщегоНазначения.СообщитьПользователю(ВозвращеннаяСтруктура.НадписьПоясненияНекорректногоКПП, Ссылка,"Объект.КПП",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВозвращеннаяСтруктура.НадписьПоясненияНекорректногоОКПО) Тогда
			ОбщегоНазначения.СообщитьПользователю(ВозвращеннаяСтруктура.НадписьПоясненияНекорректногоОКПО, Ссылка,"Объект.КодПоОКПО",, Отказ);
		КонецЕсли;
	
	КонецЕсли;
		
КонецПроцедуры

// Обработчик события "ПередЗаписью" объекта на сервере
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка ИЛИ ДополнительныеСвойства.Свойство("ЭтоИзменениеФорматаТелефонныхНомеров") Тогда
		Возврат;
	
	ИначеЕсли НЕ ЭтоГруппа И Родитель.Пустая() Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Создание элементов в корне запрещено!';en='Creature items fundamentally prohibited!'"));
		Отказ = Истина;
		Возврат;
		
	ИначеЕсли ЭтоГруппа И Предопределенный И ЗначениеЗаполнено(Родитель) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Перемещать предопределенные группы запрещено!';en='Move predefined groups prohibited!'"));
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	Если ЭтоГруппа И Не Родитель.Пустая() Тогда
		ТипКонтрагента = Родитель.ТипКонтрагента;
	КонецЕсли;	                              
	
	Если Наименование = "" Тогда
		Наименование = Фамилия + ?(ЗначениеЗаполнено(Фамилия), " ", "") + Имя + ?(ЗначениеЗаполнено(Имя), " ", "") + Отчество;
	КонецЕсли;   
	
	Если НаименованиеПолное <> Наименование 
		И ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты 
		И Не ЭтоГруппа Тогда  
		
		НаименованиеПолное = Наименование;
	КонецЕсли;
	
	СтарыйТелефон = Телефон;
	
	// Обновим телефон	
	ПараметрыОтбора = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	СтрокиТелефон = КонтактнаяИнформация.НайтиСтроки(ПараметрыОтбора);
	
	Если ЗначениеЗаполнено(СтрокиТелефон) Тогда
		
		МассивНомеров = Новый Массив;
		
		Для Каждого СтрокаКИ Из СтрокиТелефон Цикл
			МассивНомеров.Добавить(СтрокаКИ.Представление);
		КонецЦикла;
		
		Телефон = СтрСоединить(МассивНомеров, ",");
		
	КонецЕсли;
	
	//------------------------------
	ОткорректироватьФИО();
	
	Если Не Родитель.Пустая() И Не ЗначениеЗаполнено(ТипКонтрагента) Тогда
		ТипКонтрагента = Родитель.ТипКонтрагента;
	КонецЕсли;
	
	Если Ссылка.ПометкаУдаления <> ЭтотОбъект.ПометкаУдаления Тогда // Изменился статус пометки
		Если Ссылка.ПометкаУдаления Тогда // пометка была - сняли
			// <действия при снятии пометки>
		Иначе
			// <действия при установке пометки>
			ПроизвестиОчисткуВсехСсылокНаУдаляемыйОбъект();			
		КонецЕсли;
	КонецЕсли;

	// Сгенерируем пациенту медкарту 
	Если Константы.АвтоматическиСоздаватьМедКарту.Получить() 
		И Ссылка.Пустая() 
		И не ЗначениеЗаполнено(ТекущаяМедицинскаяКарта)  
		И НЕ ЭтотОбъект.ЭтоГруппа 
		И НЕ ЭтотОбъект.Родитель.Пустая() Тогда
		
		Если ЭтотОбъект.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты Тогда 
			
			// Установим ссылку еще не записанному пациенту
			СсылкаНового = ПолучитьСсылкуНового();
			Если СсылкаНового.Пустая() Тогда
				ЭтотОбъект.УстановитьСсылкуНового(Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор));
				СсылкаНового = ПолучитьСсылкуНового();
			КонецЕсли;
			
			МедКартаОбъект = Справочники.МедицинскиеКарты.СоздатьЭлемент();
			МедКартаОбъект.ВладелецКарты = СсылкаНового;
			МедКартаОбъект.ВидМедицинскойКарты = Справочники.ВидыМедицинскихКарт.ОсновнойВидМедицинскойКарты;
			МедКартаОбъект.ДополнительныеСвойства.Вставить("ВладелецКартыНаименование", Наименование);
			МедКартаОбъект.Записать();
			Справочники.МедицинскиеКарты.УстановитьМестоположениеМедицинскойКарты(МедКартаОбъект.Ссылка, Справочники.Местоположения.ВКлинике);
			ТекущаяМедицинскаяКарта = МедКартаОбъект.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаРожденияКлиента) и ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты Тогда
		Возраст = Год(Дата(01, 01, 01) + (ТекущаяДата() - ДатаРожденияКлиента)) - 1;
		Если Возраст > 13 Тогда
			ТипЗубнойФормулы = 2;
		Иначе
			ТипЗубнойФормулы = 1;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - При записи
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ЭтоНовый = ПолучитьЗначениеИзСтруктуры(ЭтотОбъект.ДополнительныеСвойства, "ЭтоНовый", Ложь);
	ЗаписьИзОбращения = ПолучитьЗначениеИзСтруктуры(ЭтотОбъект.ДополнительныеСвойства, "Заявка");
	ЭтоПациент = (НЕ ЭтотОбъект.ЭтоГруппа И ЭтотОбъект.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты);
	
	Если ЭтотОбъект.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты
		И ЗначениеЗаполнено(Телефон)
		И ЗаписьИзОбращения = Неопределено Тогда
		
		АктуализироватьЗаявку(ЭтоНовый);
		
	КонецЕсли;
	 
	АктуализироватьДанныеКонтрагента = Ложь;
	
	Если ЭтоПациент Тогда
				
		Если ДополнительныеСвойства.Свойство("Статус") Тогда
			Справочники.Контрагенты.УстановитьСтатус(Ссылка, ДополнительныеСвойства.Статус);
		ИначеЕсли НЕ ЗначениеЗаполнено(Справочники.Контрагенты.ПолучитьСтатус(Ссылка)) Тогда
			Справочники.Контрагенты.УстановитьСтатус(Ссылка, Перечисления.СтатусыКонтрагентов.Потенциальный);
		КонецЕсли;
		
		Если НЕ ЭтотОбъект.ПометкаУдаления Тогда 
			АктуализироватьДанныеКонтрагента = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ИзмененныеТелефоны") Тогда
		ОбновитьДанныеКонтактовМессенджеров(ЭтотОбъект.Ссылка, ЭтотОбъект.ДополнительныеСвойства.ИзмененныеТелефоны);
		ОбновитьДанныеОбращений(ЭтотОбъект.Ссылка, ЭтотОбъект.ДополнительныеСвойства.ИзмененныеТелефоны);
	КонецЕсли;
	
	Если ЭтоНовый ИЛИ ЭтотОбъект.ДополнительныеСвойства.Свойство("ИзмененныеТелефоны") Тогда
		ОбновитьДанныеИсторииВызовов();
		
		// Обновим контактную информацию в регистре КонтрагентыСведенияДляСписка.
		// Если это новый пациент, то дописываем статус.
		Если АктуализироватьДанныеКонтрагента Тогда
			ОбновленныеКонтактныеДанные = Справочники.Контрагенты.ПолучитьИнформациюКонтрагента(Ссылка);
			Если ЭтоНовый Тогда
				ОбновленныеКонтактныеДанные.Вставить("Статус", Перечисления.СтатусыКонтрагентов.Потенциальный); 
			КонецЕсли;
			РегистрыСведений.КонтрагентыСведенияДляСписка.АктуализироватьНеобходимыеДанныеВСведенияхДляСписка(Ссылка, ОбновленныеКонтактныеДанные);		
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура, обновляет данные контактов мессенджеров.
//
Процедура ОбновитьДанныеКонтактовМессенджеров(Контрагент, ДанныеТелефонов)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НомераДоИзменения	 = Новый Массив;
	НомераПослеИзменения = Новый Массив;
	
	Для Каждого ЭлементСписка Из ДанныеТелефонов Цикл
		
		ДанныеТелефона = ЭлементСписка.Значение;
		
		Если ЗначениеЗаполнено(ДанныеТелефона.НомерТелефона) Тогда
			Если НомераДоИзменения.Найти(ДанныеТелефона.НомерТелефона) = Неопределено Тогда
				НомераДоИзменения.Добавить(ДанныеТелефона.НомерТелефона);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеТелефона.ИзмененныйНомер) Тогда
			Если НомераПослеИзменения.Найти(ДанныеТелефона.ИзмененныйНомер) = Неопределено Тогда
				НомераПослеИзменения.Добавить(ДанныеТелефона.ИзмененныйНомер);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ЭлементСписка Из ДанныеТелефонов Цикл
		
		ДанныеТелефона = ЭлементСписка.Значение;
		
		Если ДанныеТелефона.ИзмененныйНомер = ДанныеТелефона.НомерТелефона Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДанныеТелефона.НомерТелефона) Тогда
			
			Если НомераДоИзменения.Найти(ДанныеТелефона.ИзмененныйНомер) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			// Восстанавливаем контакты по ранее удаленному номеру.
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КонтактыМессенджеров.ВнешняяСистема КАК ВнешняяСистема,
			|	КонтактыМессенджеров.Идентификатор КАК Идентификатор,
			|	КонтактыМессенджеров.ОбъектИдентификации КАК ОбъектИдентификации,
			|	КонтактыМессенджеров.ИдПоследнегоДиалога КАК ИдПоследнегоДиалога,
			|	КонтактыМессенджеров.НомерМессенджера КАК НомерМессенджера,
			|	КонтактыМессенджеров.ФотоКлиента КАК ФотоКлиента,
			|	КонтактыМессенджеров.НаименованиеКлиента КАК НаименованиеКлиента,
			|	КонтактыМессенджеров.Оператор КАК Оператор,
			|	КонтактыМессенджеров.НеИспользовать КАК НеИспользовать,
			|	ЛОЖЬ КАК НеУчаствоватьВРассылке,
			|	КонтактыМессенджеров.ЭтоГруппа КАК ЭтоГруппа
			|ИЗ
			|	РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
			|ГДЕ
			|	КонтактыМессенджеров.ОбъектИдентификации ССЫЛКА Справочник.Контрагенты
			|	И КонтактыМессенджеров.ОбъектИдентификации = &ОбъектИдентификации
			|	И КонтактыМессенджеров.НомерМессенджера В (&НомерМессенджера, ""+"" + &НомерМессенджера)
			|	И КонтактыМессенджеров.НеУчаствоватьВРассылке
			|	И КонтактыМессенджеров.ВнешняяСистема.Используется
			|	И НЕ КонтактыМессенджеров.ВнешняяСистема.ПометкаУдаления
			|	И КонтактыМессенджеров.ВнешняяСистема.ТипВнешнейСистемы В(&ТипыВнешнихСистем)");
			
			Запрос.УстановитьПараметр("ОбъектИдентификации"	, Контрагент);
			Запрос.УстановитьПараметр("НомерМессенджера"	, ДанныеТелефона.ИзмененныйНомер);
			Запрос.УстановитьПараметр("ТипыВнешнихСистем"	, Справочники.ВнешниеСистемы.ПолучитьТипыВнешнихСистемМессенджераОтправитьПервым());
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = РегистрыСведений.КонтактыМессенджеров.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ВнешняяСистема.Установить(Выборка.ВнешняяСистема);
				НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.Идентификатор);
				
				ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
				
				НаборЗаписей.Записать();
				
			КонецЦикла;
			
			Продолжить;
			
		КонецЕсли;
		
		Если НомераПослеИзменения.Найти(ДанныеТелефона.НомерТелефона) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактыМессенджеров.ВнешняяСистема КАК ВнешняяСистема,
		|	КонтактыМессенджеров.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
		|ГДЕ
		|	КонтактыМессенджеров.ОбъектИдентификации ССЫЛКА Справочник.Контрагенты
		|	И (ВЫРАЗИТЬ(КонтактыМессенджеров.ОбъектИдентификации КАК Справочник.Контрагенты)) = &ОбъектИдентификации
		|	И КонтактыМессенджеров.НомерМессенджера В (&НомерМессенджера, ""+"" + &НомерМессенджера)
		|	И КонтактыМессенджеров.ВнешняяСистема.Используется
		|	И НЕ КонтактыМессенджеров.ВнешняяСистема.ПометкаУдаления
		|	И КонтактыМессенджеров.ВнешняяСистема.ТипВнешнейСистемы В(&ТипыВнешнихСистем)");
		
		Запрос.УстановитьПараметр("ОбъектИдентификации"	, Контрагент);
		Запрос.УстановитьПараметр("НомерМессенджера"	, ДанныеТелефона.НомерТелефона);
		Запрос.УстановитьПараметр("ТипыВнешнихСистем"	, Справочники.ВнешниеСистемы.ПолучитьТипыВнешнихСистемМессенджераОтправитьПервым());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			МенеджерЗаписи					 = РегистрыСведений.КонтактыМессенджеров.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Идентификатор	 = Выборка.Идентификатор;
			МенеджерЗаписи.ВнешняяСистема	 = Выборка.ВнешняяСистема;
			
			МенеджерЗаписи.Прочитать();
			
			Если МенеджерЗаписи.Выбран() Тогда
				
				Если ЗначениеЗаполнено(ДанныеТелефона.ИзмененныйНомер) Тогда
					МенеджерЗаписи.НомерМессенджера			 = ДанныеТелефона.ИзмененныйНомер;
					МенеджерЗаписи.Идентификатор			 = СтрЗаменить(МенеджерЗаписи.Идентификатор, ДанныеТелефона.НомерТелефона, ДанныеТелефона.ИзмененныйНомер);
					МенеджерЗаписи.НеУчаствоватьВРассылке	 = Ложь;
				Иначе
					МенеджерЗаписи.НеУчаствоватьВРассылке = Истина;
				КонецЕсли;
				
				Попытка
					МенеджерЗаписи.Записать();
				Исключение
					ОписаниеОшибки = ОписаниеОшибки();
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура, обновляет данные контактов в обращениях.
//
Процедура ОбновитьДанныеОбращений(Пациент, ДанныеТелефонов)
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
		МассивЗаявок = Справочники.Заявки.ПолучитьМассивЗаявокКонтрагента(Пациент);
		
		УстановитьПривилегированныйРежим(Истина);
		
		Если МассивЗаявок.Количество() > 0 Тогда
			Для Каждого ЭлементСписка Из ДанныеТелефонов Цикл
				
				ДанныеТелефона = ЭлементСписка.Значение;
				
				Если Не ЗначениеЗаполнено(ДанныеТелефона.НомерТелефона)
					Или ДанныеТелефона.ИзмененныйНомер = ДанныеТелефона.НомерТелефона Тогда
					
					Продолжить;
				КонецЕсли;
				
				Для Каждого Заявка Из МассивЗаявок Цикл
					
					ЗаявкаОбъект = Заявка.ПолучитьОбъект();
					
					ТабличнаяЧастьДок = ЗаявкаОбъект.КонтактнаяИнформация;
					
					МассивИзменяемыхСтрок = ТабличнаяЧастьДок.НайтиСтроки(Новый Структура("НомерТелефона", ДанныеТелефона.НомерТелефона));
					
					Для Каждого ЭлМассива Из МассивИзменяемыхСтрок Цикл
						ТабличнаяЧастьДок.Удалить(ЭлМассива);
					КонецЦикла;
					
					СписокПолейКИ = Новый СписокЗначений;
					УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(ДанныеТелефона.ИзмененныйНомер, СписокПолейКИ);
					
					ОбъектXDTOИнформации 					= УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияXDTOПоПредставлению(ДанныеТелефона.ИзмененныйНомер, Справочники.ВидыКонтактнойИнформации.ТелефонКлиента);			
					НоваяСтрока 							= ЗаявкаОбъект.КонтактнаяИнформация.Добавить();				
					НоваяСтрока.Тип 						= Перечисления.ТипыКонтактнойИнформации.Телефон;
					НоваяСтрока.Вид 						= Справочники.ВидыКонтактнойИнформации.ТелефонКлиента;
					НоваяСтрока.НомерТелефона 				= "" + ОбъектXDTOИнформации.Состав.КодСтраны + ОбъектXDTOИнформации.Состав.КодГорода + ОбъектXDTOИнформации.Состав.Номер;
					НоваяСтрока.НомерТелефонаБезКодов 		= ОбъектXDTOИнформации.Состав.Номер;
					НоваяСтрока.НомерТелефонаБезКодаСтраны 	= ОбъектXDTOИнформации.Состав.КодГорода + ОбъектXDTOИнформации.Состав.Номер;		
					НоваяСтрока.НомерТелефонаПоследниеЦифры	= Прав(СокрЛП(ОбъектXDTOИнформации.Состав.Номер), 4);			
					НоваяСтрока.Представление 				= ДанныеТелефона.ИзмененныйНомер; // ОбъектXDTOИнформации.Представление;
					НоваяСтрока.ЗначенияПолей 				= УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияXDTOВXML(ОбъектXDTOИнформации);
					
					Попытка
						ЗаявкаОбъект.Записать();
					Исключение
					КонецПопытки;
					
				КонецЦикла;
			КонецЦикла;
		КонецЕсли; 
		
	#КонецЕсли
	
КонецПроцедуры

// Процедура, обновляет данные контактов в звонках.
//
Процедура ОбновитьДанныеИсторииВызовов()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|ПОМЕСТИТЬ ВТТелефоны
	|ИЗ
	|	(ВЫБРАТЬ
	|		КонтрагентыКонтактнаяИнформация.НомерТелефона
	|	ИЗ
	|		Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|	ГДЕ
	|		КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
	|		И КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)) КАК КонтактнаяИнформация
	|;                                      
	|//////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияЗвонков.IDЗвонка,
	|	ИсторияЗвонков.ОборудованиеТелефонии
	|ИЗ
	|	РегистрСведений.ИсторияВызовов КАК ИсторияЗвонков
	|ГДЕ
	|	ИсторияЗвонков.НомерТелефона В
	|			(ВЫБРАТЬ
	|				ВТТелефоны.НомерТелефона
	|			ИЗ
	|				ВТТелефоны)
	|	И ИсторияЗвонков.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";

	Запрос.УстановитьПараметр("Контрагент"                  ,  ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ИсторияВызовов.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.ОборудованиеТелефонии.Значение 		= РезультатЗапроса.ОборудованиеТелефонии;
		НаборЗаписей.Отбор.ОборудованиеТелефонии.Использование 	= Истина;
		НаборЗаписей.Отбор.IDЗвонка.Значение 					= РезультатЗапроса.IDЗвонка;
		НаборЗаписей.Отбор.IDЗвонка.Использование 				= Истина;
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда 
			Запись 				= НаборЗаписей[0];
			Запись.Контрагент 	= ЭтотОбъект.Ссылка;    
			НачатьТранзакцию();
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать(Истина);
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

// Процедура, корректирует ФИО контрагента согласно значению автокоррекции его группы.
//
Процедура ОткорректироватьФИО()
	
	Если Не ЭтоГруппа И ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты Тогда
		
		АвтокоррекцияРодителя = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Родитель, "Автокоррекция", "Автокоррекция");
		
		Фамилия	 = УдалитьНедопустимыеСимволыСправа(СокрЛП(Фамилия));
		Имя		 = УдалитьНедопустимыеСимволыСправа(СокрЛП(Имя));
		Отчество = УдалитьНедопустимыеСимволыСправа(СокрЛП(Отчество));
		
		Если Автокоррекция = 2 Тогда
			
			Наименование		 = ВРег(СокрЛП(Наименование));
			НаименованиеПолное	 = ВРег(СокрЛП(НаименованиеПолное));
			Фамилия				 = ВРег(Фамилия);
			Имя					 = ВРег(Имя);
			Отчество			 = ВРег(Отчество);
			
		ИначеЕсли Автокоррекция = 1 Тогда			
			
			Фамилия				 = ТРег(Фамилия);
			Имя					 = ТРег(Имя);
			Отчество			 = ТРег(Отчество);
			Наименование		 = ТРег(СокрЛП(Наименование));
			НаименованиеПолное	 = ТРег(СокрЛП(НаименованиеПолное));			
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры	

// ===========================ПРОЦЕДУРЫ, ОТВЕЧАЮЩИЕ ЗА УДАЛЕНИЕ ЗАПИСЕЙ В РЕГИСТРЕ И УСТАНОВКУ ПОМЕТКИ УДАЛЕНИЯ=================================

// Процедура инициирует очистку всех ссылок на удаляемый объект
//
Процедура ПроизвестиОчисткуВсехСсылокНаУдаляемыйОбъект()
		
	УстановитьПривилегированныйРежим(Истина);
	
	УдалитьСтатусыКонтрагента();
	УдалитьМеткиКонтрагента();
	УдалитьПрофосмотрыКонтрагента();
	УдалитьРодственныеСвязиКонтрагента();
	ПометитьНаУдалениеДисконтныеКартыКонтрагента();
	ПометитьНаУдалениеПолисыМСКонтрагента();
	ПометитьНаУдалениеМедицинскиеКартыКонтрагента();
	
	УстановитьПривилегированныйРежим(Ложь);
			
КонецПроцедуры
	
// Процедура удаляет из регистра сведений статусы клиента
//
Процедура УдалитьСтатусыКонтрагента()
	
	НаборЗаписей = РегистрыСведений.СтатусыКонтрагентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Записать();	
		
КонецПроцедуры	

// Процедура удаляет из регистра сведений метки клиента
//
Процедура УдалитьМеткиКонтрагента()
	
	НаборЗаписей = РегистрыСведений.МеткиКлиентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Клиент.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Записать();	
			
КонецПроцедуры	

// Процедура удаляет из регистра сведений профосмотры клиента
//
Процедура УдалитьПрофосмотрыКонтрагента()
	
	НаборЗаписей = РегистрыСведений.Профосмотры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Записать();	
			
КонецПроцедуры	

// Процедура удаляет из регистра сведений родственные связи клиента
//
Процедура УдалитьРодственныеСвязиКонтрагента()
	
	НаборЗаписей = РегистрыСведений.РодственныеСвязи.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Записать();	
	
	НаборЗаписей = РегистрыСведений.РодственныеСвязи.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Родственник.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Записать();
	
КонецПроцедуры	

// Процедура помечает на удаление дисконтные карты клиента
//
Процедура ПометитьНаУдалениеДисконтныеКартыКонтрагента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Карты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Карты КАК Карты
	               |ГДЕ
	               |	НЕ Карты.ПометкаУдаления
	               |	И Карты.ВладелецКарты = &ВладелецКарты";
				   
	Запрос.УстановитьПараметр("ВладелецКарты", ЭтотОбъект.Ссылка);			   
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Карта Из Результат Цикл
		КартаОбъект = Карта.Ссылка.ПолучитьОбъект();
		КартаОбъект.ПометкаУдаления = Истина;
		Попытка
			КартаОбъект.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать объект " + "" + Строка(КартаОбъект) + "");
		КонецПопытки;		
	КонецЦикла;	
			
КонецПроцедуры	

// Процедура помечает на удаление полисы медицинского страхования клиента
//
Процедура ПометитьНаУдалениеПолисыМСКонтрагента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПолисыМедицинскогоСтрахования.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ПолисыМедицинскогоСтрахования КАК ПолисыМедицинскогоСтрахования
	               |ГДЕ
	               |	НЕ ПолисыМедицинскогоСтрахования.ПометкаУдаления
	               |	И ПолисыМедицинскогоСтрахования.Контрагент = &Контрагент";
				   
	Запрос.УстановитьПараметр("Контрагент", ЭтотОбъект.Ссылка);			   
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Полис Из Результат Цикл
		ПолисОбъект = Полис.Ссылка.ПолучитьОбъект();
		ПолисОбъект.ПометкаУдаления = Истина;
		Попытка
			ПолисОбъект.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать объект " + "" + Строка(ПолисОбъект) + "");
		КонецПопытки;		
	КонецЦикла;	
			
КонецПроцедуры	

// Процедура помечает на удаление полисы медицинского страхования клиента
//
Процедура ПометитьНаУдалениеМедицинскиеКартыКонтрагента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МедицинскиеКарты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.МедицинскиеКарты КАК МедицинскиеКарты
	               |ГДЕ
	               |	НЕ МедицинскиеКарты.ПометкаУдаления
	               |	И МедицинскиеКарты.ВладелецКарты = &ВладелецКарты";
				   
	Запрос.УстановитьПараметр("ВладелецКарты", ЭтотОбъект.Ссылка);			   
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого МедицинскаяКарта Из Результат Цикл
		МедицинскаяКартаОбъект = МедицинскаяКарта.Ссылка.ПолучитьОбъект();
		МедицинскаяКартаОбъект.ПометкаУдаления = Истина;
		Попытка
			МедицинскаяКартаОбъект.Записать();
			УдалитьМестонахождениеМедицинскихКартКонтрагента(МедицинскаяКартаОбъект.Ссылка);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать объект " + "" + Строка(МедицинскаяКартаОбъект) + "");
		КонецПопытки;		
	КонецЦикла;	
			
КонецПроцедуры	

// Процедура удаляет из регистра сведений местонахождение медицинских карт клиента
//
Процедура УдалитьМестонахождениеМедицинскихКартКонтрагента(МедицинскаяКартаКлиента)
	
	НаборЗаписей = РегистрыСведений.МестонахождениеМедицинскихКарт.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.МедицинскаяКарта.Установить(МедицинскаяКартаКлиента);
	НаборЗаписей.Записать();	
	
КонецПроцедуры	

Функция ПолучитьЗначениеИзСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Возврат ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеИзСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
	
КонецФункции

// Процедура дополняет обращение новыми данными
//
Процедура АктуализироватьЗаявку(ЭтоНовый)
	
	ОбращенияПациента = Справочники.Заявки.ПолучитьЗаявкуПоНомеруТелефона(СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Телефон, ","));
	Если Не ЗначениеЗаполнено(ОбращенияПациента) И ЭтоНовый Тогда
		Заявка = Справочники.Заявки.СоздатьВходящуюЗаявку(,,,ЭтотОбъект.Фамилия, ЭтотОбъект.Имя,ЭтотОбъект.Отчество,ЭтотОбъект.Телефон,,,,,,,,,ЭтотОбъект.Ссылка,ЭтотОбъект.СтруктурнаяЕдиница,,,,,,Перечисления.СтатусыЗаявок.Принята);	
	ИначеЕсли Не ОбращенияПациента = Справочники.Заявки.ПустаяСсылка() И Не ЗначениеЗаполнено(ОбращенияПациента.ОсновнойКлиент) Тогда
		
		ОбращениеОбъект = ОбращенияПациента.ПолучитьОбъект();
		
		ОбращениеОбъект.ОсновнойКлиент  = ЭтотОбъект.Ссылка;
		ОбращениеОбъект.Фамилия 		= ЭтотОбъект.Фамилия;
		ОбращениеОбъект.Имя				= ЭтотОбъект.Имя;
		ОбращениеОбъект.Отчество 		= ЭтотОбъект.Отчество;
		ОбращениеОбъект.Наименование 	= СокрЛП(ЭтотОбъект.Фамилия + ?(ЗначениеЗаполнено(ЭтотОбъект.Фамилия), " ", "") + ЭтотОбъект.Имя + ?(ЗначениеЗаполнено(ЭтотОбъект.Имя), " ", "") + ЭтотОбъект.Отчество);
		
		Попытка
			ОбращениеОбъект.Записать();
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры   

// ============================================================================================================================================

#КонецОбласти 
