
#Область СлужебныйПрограммныйИнтерфейс

#Область СОБЫТИЯ_ФОРМЫ

// Обработчик для события формы ПриСозданииНаСервере.
// Вызывается из модуля формы объекта-владельца КИ при внедрении подсистемы.
// 
// Параметры:
//    Форма                - УправляемаяФорма - Форма объекта-владельца, предназначенная для вывода контактной.
//                           Информации.
//    Объект               - Произвольный - Объект-владелец контактной информации.
//    ПоложениеЗаголовкаКИ - ПоложениеЗаголовкаЭлементаФормы - Может принимать значения
//                                                             ПоложениеЗаголовкаЭлементаФормы.Лево  или
//                                                             ПоложениеЗаголовкаЭлементаФормы.Верх (по умолчанию).
// 
Процедура ПриСозданииНаСервере(Форма, Объект, ДополнительныеПараметры = Неопределено, УдалитьПоложениеЗаголовкаКИ = "",
	Знач УдалитьИсключаемыеВиды = Неопределено, УдалитьОтложеннаяИнициализация = Ложь) Экспорт
	
	ТипПомещения = Неопределено;
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		
		ДополнительныеПараметры.Свойство("ТипПомещения", ТипПомещения);
		ОтложеннаяИнициализация  = ?(ДополнительныеПараметры.Свойство("ОтложеннаяИнициализация"), ДополнительныеПараметры.ОтложеннаяИнициализация, Ложь);
		ПоложениеЗаголовкаКИ     = ?(ДополнительныеПараметры.Свойство("ПоложениеЗаголовкаКИ"), ДополнительныеПараметры.ПоложениеЗаголовкаКИ, "");
		ИсключаемыеВиды          = ?(ДополнительныеПараметры.Свойство("ИсключаемыеВиды"), ДополнительныеПараметры.ИсключаемыеВиды, Неопределено);
		СкрываемыеВиды           = ?(ДополнительныеПараметры.Свойство("СкрываемыеВиды"), ДополнительныеПараметры.СкрываемыеВиды, Неопределено);
		ИмяЭлементаДляРазмещения = ?(ДополнительныеПараметры.Свойство("ИмяЭлементаДляРазмещения"), ДополнительныеПараметры.ИмяЭлементаДляРазмещения, "ГруппаКонтактнаяИнформация");
		ОбработкаНавигационнойСсылки = ?(ДополнительныеПараметры.Свойство("ОбработкаНавигационнойСсылки"), ДополнительныеПараметры.ОбработкаНавигационнойСсылки, Ложь);
	Иначе
		ИмяЭлементаДляРазмещения = ?(ДополнительныеПараметры = Неопределено, "ГруппаКонтактнаяИнформация", ДополнительныеПараметры);
		ОтложеннаяИнициализация  = УдалитьОтложеннаяИнициализация;
		ИсключаемыеВиды          = УдалитьИсключаемыеВиды;
		СкрываемыеВиды           = Неопределено;
		ПоложениеЗаголовкаКИ     = УдалитьПоложениеЗаголовкаКИ;
		ОбработкаНавигационнойСсылки = Ложь;
	КонецЕсли;
	
	Если ИсключаемыеВиды = Неопределено Тогда
		ИсключаемыеВиды = Новый Массив;
	КонецЕсли;
	
	Если СкрываемыеВиды = Неопределено Тогда
		СкрываемыеВиды = Новый Массив;
	КонецЕсли;
	
	ДобавляемыеРеквизиты = Новый Массив;
	ПроверитьНаличиеРеквизитовКонтактнойИнформации(Форма, ДобавляемыеРеквизиты);
	
	// Кэширование часто используемых значений
	СсылкаНаОбъект             = Объект.Ссылка;
	МетаданныеОбъекта          = СсылкаНаОбъект.Метаданные();
	ПолноеИмяОбъектаМетаданных = МетаданныеОбъекта.ПолноеИмя();
	ИмяОбъекта                 = МетаданныеОбъекта.Имя;
	ЭтоОсновнойЯзык = ТекущийЯзык() = Метаданные.ОсновнойЯзык;
	
	ГруппаВидовКонтактнойИнформации  = ГруппаВидовКонтактнойИнформацииОбъекта(ПолноеИмяОбъектаМетаданных);
	ИспользуетсяКонтактнаяИнформация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГруппаВидовКонтактнойИнформации, "Используется");
	
	Если ИспользуетсяКонтактнаяИнформация = Ложь Тогда
		
		ПараметрыВыводаКонтактнойИнформации = Новый Структура();
		ПараметрыВыводаКонтактнойИнформации.Вставить("ИмяЭлементаДляРазмещения", ИмяЭлементаДляРазмещения);
		ПараметрыВыводаКонтактнойИнформации.Вставить("ПоложениеЗаголовкаКИ", ПоложениеЗаголовкаКИ);
		ПараметрыВыводаКонтактнойИнформации.Вставить("ОтложеннаяИнициализация", ОтложеннаяИнициализация);
		ПараметрыВыводаКонтактнойИнформации.Вставить("ИсключаемыеВиды", ИсключаемыеВиды);
		ПараметрыВыводаКонтактнойИнформации.Вставить("СкрываемыеВиды", СкрываемыеВиды);
		ПараметрыВыводаКонтактнойИнформации.Вставить("СсылкаНаОбъект", СсылкаНаОбъект);
		
		СкрытьКонтактнуюИнформацию(Форма, ДобавляемыеРеквизиты, ПараметрыВыводаКонтактнойИнформации);
		
		Возврат;
	КонецЕсли;
	
	СодержитДействуетС 							= УправлениеКонтактнойИнформациейСлужебныйПовтИсп.КонтактнаяИнформацияОбъектаСодержитКолонкуДействуетС(СсылкаНаОбъект);
	РеквизитыОбъекта           					= МетаданныеОбъекта.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты;
	ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти = (РеквизитыОбъекта.Найти("ИдентификаторСтрокиТабличнойЧасти") <> Неопределено);
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Объект)) Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Представление,
		|	КонтактнаяИнформация.НомерСтроки КАК НомерСтроки,
		|	КонтактнаяИнформация.Вид КАК Вид, 
		|	ЕСТЬNULL(ВидыКонтактнойИнформации.ХранитьИсториюИзменений, ЛОЖЬ) КАК ХранитьИсториюИзменений,
		|	КонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
		|	КонтактнаяИнформация.Значение КАК Значение,
		|	"""" КАК ДействуетС,
		|	0 КАК ИдентификаторСтрокиТабличнойЧасти,
		|	ЛОЖЬ КАК ЭтоИсторическаяКонтактнаяИнформация
		|ИЗ
		|	&ПолноеИмяОбъектаМетаданных.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|			ПО (КонтактнаяИнформация.Вид = ВидыКонтактнойИнформации.Ссылка)
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &Ссылка УПОРЯДОЧИТЬ ПО Вид, ДействуетС";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных);
		
		Если ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "0 КАК ИдентификаторСтрокиТабличнойЧасти",
			"ЕСТЬNULL(КонтактнаяИнформация.ИдентификаторСтрокиТабличнойЧасти, 0) КАК ИдентификаторСтрокиТабличнойЧасти");
		КонецЕсли;
		
		Если СодержитДействуетС Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """"" КАК ДействуетС", "КонтактнаяИнформация.ДействуетС КАК ДействуетС");
		КонецЕсли;
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
		КонтактнаяИнформация = Запрос.Выполнить().Выгрузить();
	Иначе
		КонтактнаяИнформация = Объект.КонтактнаяИнформация.Выгрузить();
		
		Если СодержитДействуетС Тогда
			ТипБулево = Новый ОписаниеТипов("Булево");
			КонтактнаяИнформация.Колонки.Добавить("ХранитьИсториюИзменений", ТипБулево);
			КонтактнаяИнформация.Колонки.Добавить("ЭтоИсторическаяКонтактнаяИнформация", ТипБулево);
			КонтактнаяИнформация.Сортировать("Вид, ДействуетС");
			Для каждого СтрокаКонтактнойИнформации Из КонтактнаяИнформация Цикл
				СтрокаКонтактнойИнформации.ХранитьИсториюИзменений = СтрокаКонтактнойИнформации.Вид.ХранитьИсториюИзменений;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если СодержитДействуетС Тогда
		ПредыдущийВид = Неопределено;
		Для каждого СтрокаКонтактнойИнформации Из КонтактнаяИнформация Цикл
			Если СтрокаКонтактнойИнформации.ХранитьИсториюИзменений
				И (ПредыдущийВид = Неопределено ИЛИ ПредыдущийВид <> СтрокаКонтактнойИнформации.Вид) Тогда
				Отбор = Новый Структура("Вид", СтрокаКонтактнойИнформации.Вид);
				НайденныеСтроки = КонтактнаяИнформация.НайтиСтроки(Отбор);
				ПоследняяДата = НайденныеСтроки.Получить(НайденныеСтроки.Количество() - 1).ДействуетС;
				Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					Если НайденнаяСтрока.ДействуетС < ПоследняяДата Тогда
						НайденнаяСтрока.ЭтоИсторическаяКонтактнаяИнформация = Истина;
					КонецЕсли;
				КонецЦикла;
				ПредыдущийВид = СтрокаКонтактнойИнформации.Вид;
			КонецЕсли;
		КонецЦикла;
		ЕстьИсторическаяИнформация = Истина;
	Иначе
		ЕстьИсторическаяИнформация = Ложь;
	КонецЕсли;
	
	ТекстЗапроса = СформироватьТекстЗапроса(ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти, ЕстьИсторическаяИнформация, ЭтоОсновнойЯзык);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТаблицаКонтактнойИнформации", КонтактнаяИнформация);
	Запрос.УстановитьПараметр("ГруппаВидовКИ", ГруппаВидовКонтактнойИнформации);
	Запрос.УстановитьПараметр("Владелец", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("СкрываемыеВиды", СкрываемыеВиды);
	Если Не ЭтоОсновнойЯзык Тогда
		Запрос.УстановитьПараметр("ЭтоОсновнойЯзык", ЭтоОсновнойЯзык);
		Запрос.УстановитьПараметр("КодЯзыка", ТекущийЯзык().КодЯзыка);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	КонтактнаяИнформация = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией).Строки;
	УстановитьПривилегированныйРежим(Ложь);
	
	КонвертацияКонтактнойИнформацииВJSON(КонтактнаяИнформация);
	
	КонтактнаяИнформация.Сортировать("РеквизитДопУпорядочивания, НомерСтроки");
	СоздатьРеквизитыКонтактнойИнформации(Форма, ДобавляемыеРеквизиты, ИмяОбъекта, ИсключаемыеВиды, КонтактнаяИнформация, ОтложеннаяИнициализация, ОбработкаНавигационнойСсылки);
	
	ПараметрыКонтактнойИнформации = ПараметрыВыводаКонтактнойИнформации(Форма, ИмяЭлементаДляРазмещения, ПоложениеЗаголовкаКИ,
		ОтложеннаяИнициализация, ИсключаемыеВиды, СкрываемыеВиды);
	ПараметрыКонтактнойИнформации.Владелец                     = СсылкаНаОбъект;
	ПараметрыКонтактнойИнформации.ПараметрыАдреса.ТипПомещения = ТипПомещения;
	ПараметрыКонтактнойИнформации.ОбработкаНавигационнойСсылки = ОбработкаНавигационнойСсылки;
	
	Отбор = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	КоличествоАдресов = КонтактнаяИнформация.НайтиСтроки(Отбор).Количество();
	
	// Создадим элементы на форме и заполним значения реквизитов.
	СозданныеЭлементы = ОбщегоНазначения.СкопироватьРекурсивно(ИсключаемыеВиды);
	ПредыдущийВид = Неопределено;
	
	// Создадим элементы на форме и заполним значения реквизитов.
	Родитель = ?(ПустаяСтрока(ИмяЭлементаДляРазмещения), Форма, Форма.Элементы[ИмяЭлементаДляРазмещения]);
	
	// Создаем группы для контактной информации.
	ГруппаКомпоновки = Группа("ГруппаКомпоновкиКонтактнойИнформации",
	Форма, Родитель, ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная, 5, ИмяЭлементаДляРазмещения);
	ГруппаЗаголовков = Группа("ГруппаЗаголовковКонтактнойИнформации",
	Форма, ГруппаКомпоновки, ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, 4, ИмяЭлементаДляРазмещения);
	ГруппаПолейВвода = Группа("ГруппаПолейВводаКонтактнойИнформации",
	Форма, ГруппаКомпоновки, ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, 4, ИмяЭлементаДляРазмещения);
	ГруппаДействий = Группа("ГруппаДействийКонтактнойИнформации",
	Форма, ГруппаКомпоновки, ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, 4, ИмяЭлементаДляРазмещения);
	ГруппаДействий.Видимость = Ложь;
	
	ЗаголовокСлева = ЗаголовокСлева(Форма.ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения].ПоложениеЗаголовка);
	СтатусКонтекстногоМеню = 0;
	ПредыдущийЭлемент = Неопределено;
	
	Для Каждого СтрокаКИ Из КонтактнаяИнформация Цикл
		
		ДанныеВидаКонтактнойИнформации = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаКИ);
		
		Если СтрокаКИ.ЭтоРеквизитТабличнойЧасти Тогда
			СоздатьЭлементыТабличнойЧасти(Форма, ИмяОбъекта, ИмяЭлементаДляРазмещения, СтрокаКИ, ДанныеВидаКонтактнойИнформации);
			Продолжить;
		КонецЕсли;
		
		Если СтрокаКИ.ПометкаУдаления И ПустаяСтрока(СтрокаКИ.ЗначенияПолей) И ПустаяСтрока(СтрокаКИ.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		ИндексЭлемента     = СозданныеЭлементы.Найти(СтрокаКИ.Вид);
		СтатическийЭлемент = ИндексЭлемента <> Неопределено;
		ЭтоНовыйВидКИ      = (СтрокаКИ.Вид <> ПредыдущийВид);
		
		Если ОтложеннаяИнициализация Тогда
			ДобавитьРеквизитВОписание(Форма, СтрокаКИ, ДанныеВидаКонтактнойИнформации, ЭтоНовыйВидКИ,, 
				СтатическийЭлемент, ИмяЭлементаДляРазмещения);
			Если СтатическийЭлемент Тогда
				СозданныеЭлементы.Удалить(ИндексЭлемента);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		ДобавитьРеквизитВОписание(Форма, СтрокаКИ, ДанныеВидаКонтактнойИнформации, ЭтоНовыйВидКИ,, 
			НЕ СтрокаКИ.ЭтоИсторическаяКонтактнаяИнформация, ИмяЭлементаДляРазмещения);
		
		Если СтатическийЭлемент Тогда
			СозданныеЭлементы.Удалить(ИндексЭлемента);
		Иначе
			СледующаяСтрока = ?(СозданныеЭлементы.Количество() = 0, Неопределено,
				ОпределитьСледующуюСтроку(Форма, КонтактнаяИнформация, СтрокаКИ));
			
			Если НЕ СтрокаКИ.ЭтоИсторическаяКонтактнаяИнформация Тогда
				ДобавитьСтрокуКонтактнойИнформации(Форма, СтрокаКИ, ИмяЭлементаДляРазмещения, ЭтоНовыйВидКИ, КоличествоАдресов, СледующаяСтрока);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ СтрокаКИ.ЭтоИсторическаяКонтактнаяИнформация  Тогда
			ПредыдущийВид = СтрокаКИ.Вид;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьКонтекстноеМеню(Форма, ИмяЭлементаДляРазмещения);
	
	Если Не ОтложеннаяИнициализация
		И Форма.ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения].СписокДобавляемыхЭлементов.Количество() > 0 Тогда
		ДобавитьКнопкуДополнительногоПоляКонтактнойИнформации(Форма, ИмяЭлементаДляРазмещения);		
	Иначе 
		ДобавитьПояснениеПоСбросуНастроекФормы(Форма, ИмяЭлементаДляРазмещения, ОтложеннаяИнициализация);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - При создании при чтении на сервере
//
// Параметры:
//  Форма			 - УправляемаяФорма	 - 
//  ВладелецКИ		 - ЛюбаяСсылка	 - владелец контактной информации
//
Процедура ПриСозданииПриЧтенииНаСервере(Форма, Объект = Неопределено) Экспорт
	
	Если Объект = Неопределено Тогда
		Объект = Форма.Объект;
	КонецЕсли;
	
	ВладелецКИСсылка = Объект.Ссылка;
	ВладелецКИОбъект = Объект;		
	
	МетаданныеВладельца = ВладелецКИСсылка.Метаданные();
	
	// Определение вспомогательной информации
	ПолноеИмяОбъектаМетаданных = МетаданныеВладельца.ПолноеИмя();	
	Если ТипЗнч(ВладелецКИСсылка) = Тип("СправочникСсылка.Контрагенты")
		И ((ЗначениеЗаполнено(ВладелецКИСсылка) И ВладелецКИСсылка.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты) ИЛИ (НЕ ЗначениеЗаполнено(ВладелецКИСсылка) И ВладелецКИОбъект.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты)) Тогда 
		ГруппаВидовКИ = Справочники.ВидыКонтактнойИнформации.СправочникКлиенты;
	ИначеЕсли ТипЗнч(ВладелецКИСсылка) = Тип("СправочникСсылка.Заявки") Тогда 
		ГруппаВидовКИ = Справочники.ВидыКонтактнойИнформации.СправочникКлиенты;		
	Иначе 	
		ПолноеИмяОбъектаМетаданных = ВладелецКИСсылка.Метаданные().ПолноеИмя();
		ГруппаВидовКИ = Справочники.ВидыКонтактнойИнформации[СтрЗаменить(ПолноеИмяОбъектаМетаданных, ".", "")];
	КонецЕсли;
	ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти = 
		МетаданныеВладельца.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.Найти("ИдентификаторСтрокиТабличнойЧасти") <> Неопределено;

	// Создание таблиц-реквизитов формы, если отсутствуют
	ДобавитьРеквизитыФормыКонтактнойИнформации(Форма, Объект, ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти);
	
	// Кэширование информации о доступных видах контактной информации в созданной таблице
	ПрочитатьСвойстваВидовКонтактнойИнформации(Форма, ГруппаВидовКИ, ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти);
	
	// Чтение имеющейся контактной информации объекта в созданную таблицу для отображения
	ЗаполнитьТаблицуКонтактнойИнформации(Форма, Объект, ?(Форма.Параметры.Свойство("ЗначенияЗаполнения"), Форма.Параметры.ЗначенияЗаполнения, Неопределено));
	
	Если НЕ ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти Тогда
		// Однократная подготовка элементов и команд формы
		ИнициализироватьФорму(Форма);
	КонецЕсли;
	
	// Пересоздание элементов формы по информации из таблицы для отображения
	ОбновитьЭлементыКонтактнойИнформации(Форма, ВладелецКИСсылка, ВладелецКИОбъект);
	
КонецПроцедуры
	
// Процедура - При создании при чтении на сервере
//
// Параметры:
//  Форма			 - УправляемаяФорма	 - 
//  ВладелецКИ		 - ЛюбаяСсылка	 - владелец контактной информации
//
Процедура ПриСозданииПриЧтенииНаСервереСделки(Форма, Объект = Неопределено) Экспорт
	
	Если Объект = Неопределено Тогда
		ОбъектКИ = Форма.Объект;
	Иначе
		Если НЕ Справочники.ТипВсеСсылки().Типы().Найти(ТипЗнч(Объект)) = Неопределено И ЗначениеЗаполнено(Объект) Тогда
			ОбъектКИ = Объект.ПолучитьОбъект();
		Иначе
			ОбъектКИ = Объект;
		КонецЕсли;
	КонецЕсли;
	
	ВладелецКИСсылка = ОбъектКИ.Ссылка;
	ВладелецКИОбъект = ОбъектКИ;
	
	МетаданныеВладельца = ВладелецКИСсылка.Метаданные();
	
	// Определение вспомогательной информации
	ПолноеИмяОбъектаМетаданных = МетаданныеВладельца.ПолноеИмя();
	Если ТипЗнч(ВладелецКИСсылка) = Тип("СправочникСсылка.Контрагенты")	И ((ЗначениеЗаполнено(ВладелецКИСсылка) И ВладелецКИСсылка.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты)
			ИЛИ (НЕ ЗначениеЗаполнено(ВладелецКИСсылка) И (Не ЗначениеЗаполнено(ВладелецКИОбъект.ТипКонтрагента) ИЛИ ВладелецКИОбъект.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты))) Тогда 
		ГруппаВидовКИ = Справочники.ВидыКонтактнойИнформации.СправочникКлиенты;
	Иначе
		ПолноеИмяОбъектаМетаданных = ВладелецКИСсылка.Метаданные().ПолноеИмя();
		ГруппаВидовКИ = Справочники.ВидыКонтактнойИнформации[СтрЗаменить(ПолноеИмяОбъектаМетаданных, ".", "")];
	КонецЕсли;
	ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти = 
		МетаданныеВладельца.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.Найти("ИдентификаторСтрокиТабличнойЧасти") <> Неопределено;

	// Создание таблиц-реквизитов формы, если отсутствуют
	ДобавитьРеквизитыФормыКонтактнойИнформации(Форма, ОбъектКИ, ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти);
	
	// Кэширование информации о доступных видах контактной информации в созданной таблице
	ПрочитатьСвойстваВидовКонтактнойИнформации(Форма, ГруппаВидовКИ, ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти);
	
	// На форме сделок адрес не выводим
	УдалитьАдресИзОбязательныхПолей(Форма.СвойстваВидовКонтактнойИнформации);
	
	// Чтение имеющейся контактной информации объекта в созданную таблицу для отображения
	ЗаполнитьТаблицуКонтактнойИнформации(Форма, ОбъектКИ, ?(Форма.Параметры.Свойство("ЗначенияЗаполнения"), Форма.Параметры.ЗначенияЗаполнения, Неопределено));
	
	Если НЕ ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти Тогда
		// Однократная подготовка элементов и команд формы
		ИнициализироватьФорму(Форма);
	КонецЕсли;
	
	// Пересоздание элементов формы по информации из таблицы для отображения
	ОбновитьЭлементыКонтактнойИнформации(Форма, ВладелецКИСсылка, ВладелецКИОбъект);
	
КонецПроцедуры

// Обработчик для события формы ПриЧтенииНаСервере.
// Вызывается из модуля формы объекта-владельца КИ при внедрении подсистемы.
// 
// Параметры:
//    Форма  - УправляемаяФорма - Форма объекта-владельца, предназначенная для вывода контактной информации.
//    Объект - Произвольный - Объект-владелец контактной информации.
// 
Процедура ПриЧтенииНаСервере(Форма, Объект, ИмяЭлементаДляРазмещения = "ГруппаКонтактнаяИнформация") Экспорт
	
	СписокРеквизитовФормы = Форма.ПолучитьРеквизиты();
	
	ПервыйЗапуск = Истина;
	Для Каждого Реквизит Из СписокРеквизитовФормы Цикл
		Если Реквизит.Имя = "ПараметрыКонтактнойИнформации" И ТипЗнч(Форма.ПараметрыКонтактнойИнформации) = Тип("Структура") Тогда
			ПервыйЗапуск = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПервыйЗапуск Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = ПараметрыКонтактнойИнформацииФормы(Форма.ПараметрыКонтактнойИнформации, ИмяЭлементаДляРазмещения);
	
	СсылкаНаОбъект = Объект.Ссылка;
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	ПолноеИмяОбъектаМетаданных = МетаданныеОбъекта.ПолноеИмя();
	ИмяГруппыВидовКИ = СтрЗаменить(ПолноеИмяОбъектаМетаданных, ".", "");
	ГруппаВидовКИ = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени(ИмяГруппыВидовКИ);
	ИмяЭлементаДляРазмещения = Параметры.ГруппаДляРазмещения;
	
	ПоложениеЗаголовкаКИ = ?(ЗначениеЗаполнено(Параметры.ПоложениеЗаголовка), ПредопределенноеЗначение(Параметры.ПоложениеЗаголовка), "");
	ВыполненаОтложеннаяИнициализация = Параметры.ВыполненаОтложеннаяИнициализация;
	ОтложеннаяИнициализация = Параметры.ОтложеннаяИнициализация И Не ВыполненаОтложеннаяИнициализация;
	
	ИспользуетсяКонтактнаяИнформация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГруппаВидовКИ, "Используется");
	Если ИспользуетсяКонтактнаяИнформация = Ложь Тогда
		МассивУдаляемыхРеквизитов = Параметры.ДобавленныеРеквизиты;
	Иначе
		УдалитьКомандыИЭлементыФормы(Форма, ИмяЭлементаДляРазмещения);
		
		МассивУдаляемыхРеквизитов = Новый Массив;
		ИмяОбъекта = Объект.Ссылка.Метаданные().Имя;
		
		СтатическиеРеквизиты = ОбщегоНазначения.СкопироватьРекурсивно(Параметры.ИсключаемыеВиды);
		ИменаТабличныхЧастейПоВидамКИ = Неопределено;
		
		Отбор = Новый Структура("ИмяЭлементаДляРазмещения", ИмяЭлементаДляРазмещения);
		КонтактнаяИнформацияОписаниеДополнительныхРеквизитов = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
		Для Каждого РеквизитФормы Из КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
			
			Если РеквизитФормы.ЭтоРеквизитТабличнойЧасти Тогда
				
				Если ИменаТабличныхЧастейПоВидамКИ = Неопределено Тогда
					Отбор = Новый Структура("ЭтоРеквизитТабличнойЧасти", Истина);
					ВидыКИТабличнойЧасти = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Выгрузить(Отбор, "Вид");
					ИменаТабличныхЧастейПоВидамКИ = ИменаТабличныхЧастейПоВидамКИ(ВидыКИТабличнойЧасти, ИмяОбъекта);
				КонецЕсли;
				
				ИмяТабличнойЧасти = ИменаТабличныхЧастейПоВидамКИ[РеквизитФормы.Вид];
				МассивУдаляемыхРеквизитов.Добавить("Объект." + ИмяТабличнойЧасти + "." + РеквизитФормы.ИмяРеквизита);
				МассивУдаляемыхРеквизитов.Добавить("Объект." + ИмяТабличнойЧасти + "." + РеквизитФормы.ИмяРеквизита + "Значение");
				
			ИначеЕсли НЕ РеквизитФормы.Свойство("ЭтоИсторическаяКонтактнаяИнформация")
				ИЛИ НЕ РеквизитФормы.ЭтоИсторическаяКонтактнаяИнформация Тогда
				
				Индекс = СтатическиеРеквизиты.Найти(РеквизитФормы.Вид);
				
				Если Индекс = Неопределено Тогда // Реквизит создается динамически.
					Если Не ОтложеннаяИнициализация И ЗначениеЗаполнено(РеквизитФормы.ИмяРеквизита) Тогда
						МассивУдаляемыхРеквизитов.Добавить(РеквизитФормы.ИмяРеквизита);
					КонецЕсли;
				Иначе
					СтатическиеРеквизиты.Удалить(Индекс);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		Для Каждого РеквизитФормы Из КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
			Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Удалить(РеквизитФормы);
		КонецЦикла;
	КонецЕсли;
	Форма.ИзменитьРеквизиты(, МассивУдаляемыхРеквизитов);
	
	ДополнительныеПараметры = УправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
	ДополнительныеПараметры.ИмяЭлементаДляРазмещения = ИмяЭлементаДляРазмещения;
	ДополнительныеПараметры.ПоложениеЗаголовкаКИ = ПоложениеЗаголовкаКИ;
	ДополнительныеПараметры.ИсключаемыеВиды = Параметры.ИсключаемыеВиды;
	ДополнительныеПараметры.СкрываемыеВиды = Параметры.СкрываемыеВиды;
	ДополнительныеПараметры.ОтложеннаяИнициализация = ОтложеннаяИнициализация;
	ПриСозданииНаСервере(Форма, Объект, ДополнительныеПараметры);
	
	Параметры = ПараметрыКонтактнойИнформацииФормы(Форма.ПараметрыКонтактнойИнформации, ИмяЭлементаДляРазмещения);
	Параметры.ВыполненаОтложеннаяИнициализация = ВыполненаОтложеннаяИнициализация;
	
КонецПроцедуры

// Процедура - Обработка проверки заполнения на сервере
//
// Параметры:
//  Форма	 - 	 - 
//  Отказ	 - 	 - 
//
Процедура ОбработкаПроверкиЗаполненияНаСервере(Форма, Отказ) Экспорт
	
	ПараметрыСеанса.ИнтерактивнаяПроверкаЗаполненияКонтактнойИнформации = Истина;
	
	ЕстьОшибки = Ложь;
	Отбор = Новый Структура("Вид");
	
	Для Каждого СтрокаТаблицы Из Форма.КонтактнаяИнформация Цикл
		
		Отбор.Вид = СтрокаТаблицы.Вид;
		НайденныеСтроки = Форма.СвойстваВидовКонтактнойИнформации.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СвойстваВида = НайденныеСтроки[0];
		Индекс = Форма.КонтактнаяИнформация.Индекс(СтрокаТаблицы);
		ИмяРеквизита = "КонтактнаяИнформация["+Индекс+"].Представление";
		
		Если СвойстваВида.ОбязательноеЗаполнение И ПустаяСтрока(СтрокаТаблицы.Представление)
			И Не ЕстьДругиеЗаполненныеСтрокиВидаКИ(Форма, СтрокаТаблицы, СтрокаТаблицы.Вид) Тогда
			// И нет других строк с данными для видов КИ с множественными значениями.
			
			ЕстьОшибки = Истина;
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Вид контактной информации ""%1"" не заполнен.'"), СвойстваВида.ПредставлениеВида),,, ИмяРеквизита);
			
		ИначеЕсли НЕ ПустаяСтрока(СтрокаТаблицы.Представление) И СвойстваВида.ПроверятьКорректность Тогда
			
			РезультатПроверки = УправлениеКонтактнойИнформацией.ПроверитьКонтактнуюИнформацию(СтрокаТаблицы.Представление, СтрокаТаблицы.Значение, СтрокаТаблицы.Вид, СтрокаТаблицы.Тип, ИмяРеквизита);
			ЕстьОшибки = РезультатПроверки <> 0;

			Если СтрокаТаблицы.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
				Результат = УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ПреобразоватьНомерДляОтправкиSMS(СтрокаТаблицы.Представление);
				Если Не Результат.НомерКорректен Тогда
					ЕстьОшибки = Истина;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.СообщениеОбОшибке,,, ИмяРеквизита);
				КонецЕсли;
			Иначе
				// Остальные типы контактной информации не проверяем
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик для события формы ОбработкаПроверкиЗаполненияНаСервере.
// Вызывается из модуля формы объекта-владельца КИ при внедрении подсистемы.
// 
// Параметры:
//    Форма  - УправляемаяФорма - Форма объекта-владельца, предназначенная для вывода контактной информации.
//    Объект - Произвольный - Объект-владелец контактной информации.
// 
Процедура ОбработкаПроверкиЗаполненияНаСервереСтоматология(Форма, Объект, Отказ) Экспорт
	
	ПараметрыСеанса.ИнтерактивнаяПроверкаЗаполненияКонтактнойИнформации = Истина;
	
	ИмяОбъекта = Объект.Ссылка.Метаданные().Имя;
	УровеньОшибок = 0;
	ПредыдущийВид = Неопределено;
	
	ИменаТабличныхЧастейПоВидамКИ = Неопределено;
	
	Для Каждого СтрокаТаблицы Из Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
		
		ВидИнформации = СтрокаТаблицы.Вид;
		ТипИнформации = СтрокаТаблицы.Тип;
		Комментарий   = СтрокаТаблицы.Комментарий;
		ИмяРеквизита  = СтрокаТаблицы.ИмяРеквизита;
		СвойствоВидаИнформации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидИнформации, "ОбязательноеЗаполнение, ВидРедактирования");
		ОбязательноеЗаполнение = СвойствоВидаИнформации.ОбязательноеЗаполнение;
		
		Если СтрокаТаблицы.ЭтоРеквизитТабличнойЧасти Тогда
			
			Если ИменаТабличныхЧастейПоВидамКИ = Неопределено Тогда
				Отбор = Новый Структура("ЭтоРеквизитТабличнойЧасти", Истина);
				ВидыКИТабличнойЧасти = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Выгрузить(Отбор , "Вид");
				ИменаТабличныхЧастейПоВидамКИ = ИменаТабличныхЧастейПоВидамКИ(ВидыКИТабличнойЧасти, ИмяОбъекта);
			КонецЕсли;
			
			ИмяТабличнойЧасти = ИменаТабличныхЧастейПоВидамКИ[ВидИнформации];
			ТабличнаяЧастьФормы = Форма.Объект[ИмяТабличнойЧасти];
			
			Для Каждого СтрокаТабличнойЧастиФормы Из ТабличнаяЧастьФормы Цикл
				
				Представление = СтрокаТабличнойЧастиФормы[ИмяРеквизита];
				Поле = "Объект." + ИмяТабличнойЧасти + "[" + (СтрокаТабличнойЧастиФормы.НомерСтроки - 1) + "]." + ИмяРеквизита;
				
				Если ОбязательноеЗаполнение И ПустаяСтрока(Представление) И Не ВидИнформации.ПометкаУдаления Тогда
					
					ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Поле ""%1"" не заполнено.'"), ВидИнформации.Наименование),,Поле);
					ТекущийУровеньОшибок = 2;
					
				Иначе
					
					Значение = СтрокаТабличнойЧастиФормы[ИмяРеквизита + "Значение"];
					
					ТекущийУровеньОшибок = ПроверитьЗаполнениеКонтактнойИнформации(Представление, Значение, ВидИнформации,
						ТипИнформации, ИмяРеквизита, , Поле);
					
					СтрокаТабличнойЧастиФормы[ИмяРеквизита] = Представление;
					СтрокаТабличнойЧастиФормы[ИмяРеквизита + "Значение"] = Значение;
					
				КонецЕсли;
				
				УровеньОшибок = ?(ТекущийУровеньОшибок > УровеньОшибок, ТекущийУровеньОшибок, УровеньОшибок);
				
			КонецЦикла;
			
		Иначе
			
			ЭлементФормы = Форма.Элементы.Найти(ИмяРеквизита);
			Если ЭлементФормы = Неопределено Или ВидИнформации.ПометкаУдаления Тогда
				Продолжить; // Элемент не был создан. Не была вызвана отложенная инициализация.
			КонецЕсли;
			
			Если (СвойствоВидаИнформации.ВидРедактирования = "Диалог"
				Или ТипИнформации = Перечисления.ТипыКонтактнойИнформации.ВебСтраница)
				И Не УправлениеКонтактнойИнформациейКлиентСервер.КонтактнаяИнформацияЗаполнена(Строка(Форма[ИмяРеквизита])) Тогда
				Представление = "";
			Иначе
				Представление = Форма[ИмяРеквизита];
			КонецЕсли;
			
			Если ВидИнформации <> ПредыдущийВид И ОбязательноеЗаполнение И ПустаяСтрока(Представление)
				И Не ЕстьДругиеЗаполненныеСтрокКИДанногоВида(Форма, СтрокаТаблицы, ВидИнформации) Тогда
				// И нет других строк с данными для видов КИ с множественными значениями.
				
				ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Поле ""%1"" не заполнено.'"), ВидИнформации.Наименование),,, ИмяРеквизита);
				ТекущийУровеньОшибок = 2;
				
			Иначе
				
				ТекущийУровеньОшибок = ПроверитьЗаполнениеКонтактнойИнформации(Представление, СтрокаТаблицы.Значение,
					ВидИнформации, ТипИнформации, ИмяРеквизита, Комментарий);
				
			КонецЕсли;
			
			УровеньОшибок = ?(ТекущийУровеньОшибок > УровеньОшибок, ТекущийУровеньОшибок, УровеньОшибок);
			
		КонецЕсли;
		
		ПредыдущийВид = ВидИнформации;
		
	КонецЦикла;
	
	Если УровеньОшибок <> 0 Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Перед записью на сервере
//
// Параметры:
//  Форма			 - 	 - 
//  ТекущийОбъект	 - 	 - 
//
Процедура ПередЗаписьюНаСервере(Форма, ТекущийОбъект) Экспорт
	
	ТекущийОбъект.КонтактнаяИнформация.Очистить();               
	СтруктураДополнительныхРеквизитовСтоматология = Новый Структура;
	
	Для Каждого ДанныеКИ Из Форма.КонтактнаяИнформация Цикл
		Если ТипЗнч(Форма.КонтактнаяИнформация) = Тип("ДанныеФормыКоллекция") Тогда 
			Если ДанныеКИ.Свойство("НеУчаствоватьВРассылке") Тогда 
				СтруктураДополнительныхРеквизитовСтоматология.Вставить("НеУчаствоватьВРассылке", ДанныеКИ.НеУчаствоватьВРассылке);
			КонецЕсли;
		КонецЕсли;	
		Если Форма.ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти Тогда
			ЗаписатьКонтактнуюИнформациюСтоматология(ТекущийОбъект, ДанныеКИ.Значение, ДанныеКИ.Вид, ДанныеКИ.Тип, ДанныеКИ.ИдентификаторСтрокиТабличнойЧасти, , СтруктураДополнительныхРеквизитовСтоматология);
		Иначе
			ЗаписатьКонтактнуюИнформациюСтоматология(ТекущийОбъект, ДанныеКИ.Значение, ДанныеКИ.Вид, ДанныеКИ.Тип, , , СтруктураДополнительныхРеквизитовСтоматология);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Обработчик для события формы ПередЗаписьюНаСервере.
// Вызывается из модуля формы объекта-владельца КИ при внедрении подсистемы.
// 
// Параметры:
//    Форма  - УправляемаяФорма - Форма объекта-владельца, предназначенная для вывода контактной информации.
//    Объект - Произвольный - Объект-владелец контактной информации.
// 
Процедура ПередЗаписьюНаСервереСтоматология(Форма, Объект, Отказ = Ложь) Экспорт
	
	Объект.КонтактнаяИнформация.Очистить();
	ИмяОбъекта = Объект.Ссылка.Метаданные().Имя;
	ПредыдущийВид = Неопределено;
	
	ИменаТабличныхЧастейПоВидамКИ = Неопределено;
	
	Для Каждого СтрокаТаблицы Из Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
		
		ВидИнформации = СтрокаТаблицы.Вид;
		ТипИнформации = СтрокаТаблицы.Тип;
		ИмяРеквизита  = СтрокаТаблицы.ИмяРеквизита;
		ОбязательноеЗаполнение = ВидИнформации.ОбязательноеЗаполнение;
		
		Если НЕ Форма.Элементы.Найти(СтрокаТаблицы.ИмяРеквизита) = Неопределено Тогда
				Элемент = Форма.Элементы[СтрокаТаблицы.ИмяРеквизита];
				Если Элемент.Вид = ВидПоляФормы.ПолеНадписи И Элемент.Гиперссылка Тогда
					Если ПустаяСтрока(СтрокаТаблицы.Представление)
						ИЛИ СтрокаТаблицы.Представление = УправлениеКонтактнойИнформациейКлиентСервер.ТекстПустогоАдресаВВидеГиперссылки() Тогда
							Продолжить;
					КонецЕсли;
				КонецЕсли;
		КонецЕсли;
		
		Если СтрокаТаблицы.ЭтоРеквизитТабличнойЧасти Тогда
			
			Если ИменаТабличныхЧастейПоВидамКИ = Неопределено Тогда
				Отбор = Новый Структура("ЭтоРеквизитТабличнойЧасти", Истина);
				ВидыКИТабличнойЧасти = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Выгрузить(Отбор, "Вид");
				ИменаТабличныхЧастейПоВидамКИ = ИменаТабличныхЧастейПоВидамКИ(ВидыКИТабличнойЧасти, ИмяОбъекта);
			КонецЕсли;
			
			ИмяТабличнойЧасти = ИменаТабличныхЧастейПоВидамКИ[ВидИнформации];
			ТабличнаяЧастьФормы = Форма.Объект[ИмяТабличнойЧасти];
			Для Каждого СтрокаТабличнойЧастиФормы Из ТабличнаяЧастьФормы Цикл
				
				ИдентификаторСтроки = СтрокаТабличнойЧастиФормы.ПолучитьИдентификатор();
				СтрокаТабличнойЧастиФормы.ИдентификаторСтрокиТабличнойЧасти = ИдентификаторСтроки;
				
				СтрокаТабличнойЧасти = Объект[ИмяТабличнойЧасти][СтрокаТабличнойЧастиФормы.НомерСтроки - 1];
				СтрокаТабличнойЧасти.ИдентификаторСтрокиТабличнойЧасти = ИдентификаторСтроки;
				
				ЗначенияПолей = СтрокаТабличнойЧастиФормы[ИмяРеквизита + "ЗначенияПолей"];
				
				ЗаписатьКонтактнуюИнформацию(Объект, ЗначенияПолей, ВидИнформации, ТипИнформации, ИдентификаторСтроки);
				
			КонецЦикла;

		Иначе
			ДействуетС = ?(СтрокаТаблицы.Свойство("ДействуетС"), СтрокаТаблицы.ДействуетС, Неопределено);
			ЗаписатьКонтактнуюИнформацию(Объект, СтрокаТаблицы.ЗначенияПолей, ВидИнформации, ТипИнформации,, ДействуетС);
		КонецЕсли;
		
		ПредыдущийВид = ВидИнформации;
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик для события формы ПослеЗаписиНаСервере.
// Вызывается из модуля формы объекта-владельца КИ при внедрении подсистемы.
// 
// Параметры:
//    Форма  - УправляемаяФорма - Форма объекта-владельца, предназначенная для вывода контактной информации.
//    Объект - Произвольный - Объект-владелец контактной информации.
// 
Процедура ПослеЗаписиНаСервере(Форма, Объект) Экспорт
	
	ИмяОбъекта = Объект.Ссылка.Метаданные().Имя;
	
	// Только для контактной информации в составе табличной части
	Отбор = Новый Структура("ЭтоРеквизитТабличнойЧасти", Истина);
	СтрокиТабличнойЧасти = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Выгрузить(Отбор);
	ИменаТабличныхЧастейПоВидамКИ = ИменаТабличныхЧастейПоВидамКИ(СтрокиТабличнойЧасти, ИмяОбъекта);
	
	Для Каждого СтрокаТаблицы Из СтрокиТабличнойЧасти Цикл
			ВидИнформации = СтрокаТаблицы.Вид;
			ИмяРеквизита = СтрокаТаблицы.ИмяРеквизита;
			ТабличнаяЧастьФормы = Форма.Объект[ИменаТабличныхЧастейПоВидамКИ[ВидИнформации]];
			
			Для Каждого СтрокаТабличнойЧастиФормы Из ТабличнаяЧастьФормы Цикл
				
				Отбор = Новый Структура;
				Отбор.Вставить("Вид", ВидИнформации);
				Отбор.Вставить("ИдентификаторСтрокиТабличнойЧасти", СтрокаТабличнойЧастиФормы.ИдентификаторСтрокиТабличнойЧасти);
				НайденныеСтроки = Объект.КонтактнаяИнформация.НайтиСтроки(Отбор);
				
				Если НайденныеСтроки.Количество() = 1 Тогда
					
					СтрокаКИ = НайденныеСтроки[0];
					СтрокаТабличнойЧастиФормы[ИмяРеквизита] = СтрокаКИ.Представление;
					СтрокаТабличнойЧастиФормы[ИмяРеквизита + "ЗначенияПолей"] = СтрокаКИ.ЗначенияПолей;
					
				КонецЕсли;
			КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

//////////////////////////////////////////////////////////////////////////////// 
// Чтение контактной информации другими подсистемами.

// Заполняет контактную информацию в объектах.
// 
// Параметры:
//    ДанныеЗаполнения - ТаблицаЗначений - описывает объекты для для заполнения. Содержит колонки:
//        * Приемник    - Произвольный - ссылка или объект, в котором нужно заполнить КИ.
//        * ВидКИ       - СправочникСсылка.ВидыКонтактнойИнформации  - вид контактной информации, заполняемый в
//                                                                     приемнике.
//        * СтруктураКИ - СписокЗначений, Строка, Структура - данные значений полей контактной информации.
//        * КлючСтроки  - Структура - фильтр для поиска строки в табличной части, где Ключ - имя колонки в табличной
//                                    части, Значение - значение отбора.
// 
Процедура ЗаполнитьКонтактнуюИнформациюОбъектов(ДанныеЗаполнения, Дата = Неопределено) Экспорт
	
	ПредыдущийПриемник = Неопределено;
	ДанныеЗаполнения.Сортировать("Приемник, ВидКИ");
	
	Для Каждого СтрокаЗаполнения Из ДанныеЗаполнения Цикл
		
		Приемник = СтрокаЗаполнения.Приемник;
		Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Приемник)) Тогда
			Приемник = Приемник.ПолучитьОбъект();
		КонецЕсли;
		
		Если ПредыдущийПриемник <> Неопределено И ПредыдущийПриемник <> Приемник Тогда
			Если ПредыдущийПриемник.Ссылка = Приемник.Ссылка Тогда
				Приемник = ПредыдущийПриемник;
			Иначе
				ПредыдущийПриемник.Записать();
			КонецЕсли;
		КонецЕсли;
		
		ВидКИ = СтрокаЗаполнения.ВидКИ;
		ИмяОбъектаПриемника = Приемник.Метаданные().Имя;
		ИмяТабличнойЧасти = ИмяТабличнойЧастиПоВидуКИ(ВидКИ, ИмяОбъектаПриемника);
		
		Если ПустаяСтрока(ИмяТабличнойЧасти) Тогда
			ЗаполнитьКонтактнуюИнформациюТабличнойЧасти(Приемник, ВидКИ, СтрокаЗаполнения.СтруктураКИ, Дата);
		Иначе
			Если ТипЗнч(СтрокаЗаполнения.КлючСтроки) <> Тип("Структура") Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаЗаполнения.КлючСтроки.Свойство("НомерСтроки") Тогда
				КоличествоСтрокТабличнойЧасти = Приемник[ИмяТабличнойЧасти].Количество();
				НомерСтроки = СтрокаЗаполнения.КлючСтроки.НомерСтроки;
				Если НомерСтроки > 0 И НомерСтроки <= КоличествоСтрокТабличнойЧасти Тогда
					СтрокаТабличнойЧасти = Приемник[ИмяТабличнойЧасти][НомерСтроки - 1];
					ЗаполнитьКонтактнуюИнформациюТабличнойЧасти(Приемник, ВидКИ, СтрокаЗаполнения.СтруктураКИ, СтрокаТабличнойЧасти, Дата);
				КонецЕсли;
			Иначе
				СтрокиТабличнойЧасти = Приемник[ИмяТабличнойЧасти].НайтиСтроки(СтрокаЗаполнения.КлючСтроки);
				Для каждого СтрокаТабличнойЧасти Из СтрокиТабличнойЧасти Цикл
					ЗаполнитьКонтактнуюИнформациюТабличнойЧасти(Приемник, ВидКИ, СтрокаЗаполнения.СтруктураКИ, СтрокаТабличнойЧасти, Дата);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		ПредыдущийПриемник = Приемник;
		
	КонецЦикла;
	
	Если ПредыдущийПриемник <> Неопределено Тогда
		ПредыдущийПриемник.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Заполняет контактную информацию объекта.
// 
// Параметры:
//    Приемник    - Произвольный - ссылка или объект, в котором нужно заполнить КИ.
//    ВидКИ       - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации, заполняемый в приемнике.
//    СтруктураКИ - Структура - заполненная структура контактной информации.
//    КлючСтроки  - Структура  - отбор для поиска строки в табличной части, Ключ - Имя колонки в табличной части,
//                               значение - значение отбора.
// 
Процедура ЗаполнитьКонтактнуюИнформациюОбъекта(Приемник, ВидКИ, СтруктураКИ, КлючСтроки = Неопределено, Дата = Неопределено) Экспорт
	
	ДанныеЗаполнения = Новый ТаблицаЗначений;
	ДанныеЗаполнения.Колонки.Добавить("Приемник");
	ДанныеЗаполнения.Колонки.Добавить("ВидКИ");
	ДанныеЗаполнения.Колонки.Добавить("СтруктураКИ");
	ДанныеЗаполнения.Колонки.Добавить("КлючСтроки");
	
	СтрокаЗаполнения = ДанныеЗаполнения.Добавить();
	СтрокаЗаполнения.Приемник = Приемник;
	СтрокаЗаполнения.ВидКИ = ВидКИ;
	СтрокаЗаполнения.СтруктураКИ = СтруктураКИ;
	СтрокаЗаполнения.КлючСтроки = КлючСтроки;
	
	ЗаполнитьКонтактнуюИнформациюОбъектов(ДанныеЗаполнения, Дата);
	
КонецПроцедуры

// Записывает контактную информацию из XML в поля табличной части Контактная информация объекта.
//
// Параметры:
//    Объект - ЛюбаяСсылка -  ссылка на объект конфигурации, содержащий табличную часть контактная информация.
//    Значение - Строка - контактная информация в внутреннем формате JSON.
//    ВидИнформации - Справочник.ВидыКонтактнойИнформация - ссылка на вид контактной информации.
//    ТипИнформации - Перечисление.ТипыКонтактнойИнформация - тип контактной информации.
//    ИдентификаторСтроки - Число - идентификатор строки табличной части.
//    Дата - Дата - Дата, с которой действует запись контактной информации,
//                  используется при хранении истории изменения контактной информации.
Процедура ЗаписатьКонтактнуюИнформациюСтоматология(Объект, Знач Значение, ВидИнформации, ТипИнформации, ИдентификаторСтроки = 0, Дата = Неопределено, СтруктураДополнительныхРеквизитовСтоматология = Неопределено) Экспорт
	
	Если ПустаяСтрока(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Если УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВXML(Значение) Тогда
		ОбъектКИ = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияВСтруктуруJSON(Значение, ТипИнформации);
	Иначе
		ОбъектКИ = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(Значение, ТипИнформации);
	КонецЕсли;
	
	Если Не УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияЗаполнена(ОбъектКИ) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураДополнительныхРеквизитовСтоматология <> Неопределено
		И ТипЗнч(СтруктураДополнительныхРеквизитовСтоматология) = Тип("Структура")
		И СтруктураДополнительныхРеквизитовСтоматология.Свойство("Комментарий") И ОбъектКИ.Свойство("comment") Тогда
		
		ОбъектКИ.comment = СтруктураДополнительныхРеквизитовСтоматология.Комментарий;
	КонецЕсли;
	
	НоваяСтрока = Объект.КонтактнаяИнформация.Добавить();
	НоваяСтрока.Представление = ОбъектКИ.Value;
	НоваяСтрока.Значение      = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(ОбъектКИ);
	НоваяСтрока.ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияИзJSONВXML(ОбъектКИ, ТипИнформации);
	НоваяСтрока.Вид           = ВидИнформации;
	НоваяСтрока.Тип           = ТипИнформации;
	
	Если СтруктураДополнительныхРеквизитовСтоматология <> Неопределено Тогда 
		Если ТипЗнч(СтруктураДополнительныхРеквизитовСтоматология) = Тип("Структура") Тогда 
			Если СтруктураДополнительныхРеквизитовСтоматология.Свойство("НеУчаствоватьВРассылке") Тогда 
				НоваяСтрока.НеУчаствоватьВРассылке = СтруктураДополнительныхРеквизитовСтоматология.НеУчаствоватьВРассылке;				
			КонецЕсли;
			Если СтруктураДополнительныхРеквизитовСтоматология.Свойство("ДобавитьНомерДляПриложенияКлиента") И СтруктураДополнительныхРеквизитовСтоматология.ДобавитьНомерДляПриложенияКлиента = ИСТИНА Тогда 
				Если СтруктураДополнительныхРеквизитовСтоматология.Свойство("ТолькоДляПриложенияКлиента") И СтруктураДополнительныхРеквизитовСтоматология.ТолькоДляПриложенияКлиента = ИСТИНА Тогда
					НоваяСтрока.Вид = Справочники.ВидыКонтактнойИнформации.МобильноеПриложениеКлиента;
					НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.МобильноеПриложение;
				Иначе 	
					НоваяСтрокаПриложениеКлиента = Объект.КонтактнаяИнформация.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаПриложениеКлиента, НоваяСтрока);
					НоваяСтрокаПриложениеКлиента.Вид = Справочники.ВидыКонтактнойИнформации.МобильноеПриложениеКлиента;
					НоваяСтрокаПриложениеКлиента.Тип = Перечисления.ТипыКонтактнойИнформации.МобильноеПриложение;
					
					// Заполнение дополнительных реквизитов ТЧ.
					УправлениеКонтактнойИнформациейСлужебныйСтоматология.ЗаполнитьТехническиеПоляКонтактнойИнформации(НоваяСтрокаПриложениеКлиента, ОбъектКИ, ТипИнформации);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Дата) 
		И УправлениеКонтактнойИнформациейСлужебныйПовтИсп.КонтактнаяИнформацияОбъектаСодержитКолонкуДействуетС(Объект.Ссылка) Тогда
			НоваяСтрока.ДействуетС  = Дата;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторСтроки) Тогда
		НоваяСтрока.ИдентификаторСтрокиТабличнойЧасти = ИдентификаторСтроки;
	КонецЕсли;
	
	// Заполнение дополнительных реквизитов ТЧ.
	УправлениеКонтактнойИнформациейСлужебныйСтоматология.ЗаполнитьТехническиеПоляКонтактнойИнформации(НоваяСтрока, ОбъектКИ, ТипИнформации);
	
КонецПроцедуры

// Записывает контактную информацию из XML в поля табличной части Контактная информация объекта.
// 
// Параметры:
//    Объект - ЛюбаяСсылка - номер телефона или факса.
//    ЗначенияПолей - Строка - контактная информация в формате XML.
//    ВидИнформации - Справочник.ВидыКонтактнойИнформация - ссылка на вид контактной информации.
//    ТипИнформации - Перечисление.ТипыКонтактнойИнформация - тип контактной информации.
//    ИдентификаторСтроки - Число - идентификатор строки табличной части.
//    Дата - Дата - Дата с которой действует запись контактной информации,
//                  используется при хранение истории изменения контактной информации.
Процедура ЗаписатьКонтактнуюИнформацию(Объект, ЗначенияПолей, ВидИнформации, ТипИнформации, ИдентификаторСтроки = 0, Дата = Неопределено, НеУчаствоватьВРассылке = Неопределено) Экспорт
	
	ОбъектКИ = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзXML(ЗначенияПолей, ВидИнформации);
	
	Если Не УправлениеКонтактнойИнформациейСлужебныйСтоматология.XDTOКонтактнаяИнформацияЗаполнена(ОбъектКИ) Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Объект.КонтактнаяИнформация.Добавить();
	НоваяСтрока.Представление = ОбъектКИ.Представление;
	НоваяСтрока.ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(ОбъектКИ);
	НоваяСтрока.Вид           = ВидИнформации;
	НоваяСтрока.Тип           = ТипИнформации;
	Если ЗначениеЗаполнено(Дата) Тогда
		НоваяСтрока.ДействуетС    = Дата;
	КонецЕсли;
	
	Если НеУчаствоватьВРассылке <> Неопределено Тогда
		НоваяСтрока.НеУчаствоватьВРассылке = НеУчаствоватьВРассылке;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторСтроки) Тогда
		НоваяСтрока.ИдентификаторСтрокиТабличнойЧасти = ИдентификаторСтроки;
	КонецЕсли;
	
	// Заполнение дополнительных реквизитов ТЧ.
	Если ТипИнформации = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		ЗаполнитьРеквизитыТабличнойЧастиДляАдресаЭлектроннойПочты(НоваяСтрока, ОбъектКИ);
		
	ИначеЕсли ТипИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		ЗаполнитьРеквизитыТабличнойЧастиДляАдреса(НоваяСтрока, ОбъектКИ);
		
	ИначеЕсли ТипИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		ЗаполнитьРеквизитыТабличнойЧастиДляТелефона(НоваяСтрока, ОбъектКИ);
		
	ИначеЕсли ТипИнформации = Перечисления.ТипыКонтактнойИнформации.Факс Тогда
		ЗаполнитьРеквизитыТабличнойЧастиДляТелефона(НоваяСтрока, ОбъектКИ);
		
	ИначеЕсли ТипИнформации = Перечисления.ТипыКонтактнойИнформации.СоциальнаяСеть Тогда
		ЗаполнитьРеквизитыТабличнойЧастиДляСоциальнойСети(НоваяСтрока, ОбъектКИ);
		
	КонецЕсли;
	
КонецПроцедуры

// Проверяет контактную информацию и перезаполняет значение полей
// 
Функция ПроверитьЗаполнениеКонтактнойИнформации(Представление, Значение, ВидИнформации, ТипИнформации,
	ИмяРеквизита, Комментарий = Неопределено, ПутьКРеквизиту = "")
	
	Если ПустаяСтрока(Значение) Тогда
		
		Если ПустаяСтрока(Представление) Тогда
			Возврат 0;
		КонецЕсли;
		
		ВидРедактирования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидИнформации, "ВидРедактирования");
		Если ВидРедактирования = "Диалог" И СтрСравнить(Представление, УправлениеКонтактнойИнформациейКлиентСервер.ТекстПустогоАдресаВВидеГиперссылки()) = 0 Тогда
			Возврат 0;
		КонецЕсли;
		
		КонтактнаяИнформация = УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияПоПредставлению(Представление, ВидИнформации);
		Значение = ?(ТипЗнч(КонтактнаяИнформация) = Тип("Структура"), УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(КонтактнаяИнформация), "");
		
	ИначеЕсли УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВXML(Значение) Тогда
		
		Значение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(Значение, ВидИнформации);
		
	КонецЕсли;
	
	// Проверка
	Если ТипИнформации = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		УровеньОшибок = ОшибкиЗаполненияЭлектроннойПочты(Значение, ВидИнформации, ИмяРеквизита, ПутьКРеквизиту);
	ИначеЕсли ТипИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		УровеньОшибок = ОшибкиЗаполненияАдреса(Значение, ВидИнформации, ИмяРеквизита, ПутьКРеквизиту);
	ИначеЕсли ТипИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		УровеньОшибок = ОшибкиЗаполненияТелефона(Значение, ВидИнформации, ИмяРеквизита);
	ИначеЕсли ТипИнформации = Перечисления.ТипыКонтактнойИнформации.Факс Тогда
		УровеньОшибок = ОшибкиЗаполненияТелефона(Значение, ВидИнформации, ИмяРеквизита);
	ИначеЕсли ТипИнформации = Перечисления.ТипыКонтактнойИнформации.ВебСтраница Тогда
		УровеньОшибок = ОшибкиЗаполненияВебСтраницы(Значение, ВидИнформации, ИмяРеквизита);
	Иначе
		// Другое (прочее) не проверяем.
		УровеньОшибок = 0;
	КонецЕсли;
	
	Возврат УровеньОшибок;
	
КонецФункции

// Проверяет контактную информацию электронной почты и сообщает об ошибках. 
// 
// Параметры:
//     Источник      - ОбъектXDTO - контактная информацией.
//     ВидИнформации - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации с настройками проверки.
//     ИмяРеквизита  - Строка - необязательно имя реквизита для привязки сообщения об ошибке.
// 
// Возвращаемое значение:
//     Число - уровень ошибок: 0 - нет, 1 - неблокирующие, 2 - блокирующие.
// 
Функция ОшибкиЗаполненияЭлектроннойПочты(Знач АдресЭП, ВидИнформации, Знач ИмяРеквизита = "", ПолеРеквизита = "")
	
	Если Не ВидИнформации.ПроверятьКорректность Тогда
		Возврат 0;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АдресЭП) Тогда
		Возврат 0;
	КонецЕсли;
	
	СтрокаОшибки = "";
	АдресЭлектроннаяПочта = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(АдресЭП, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	
	Попытка
		Результат = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(АдресЭлектроннаяПочта.Value);
		Если Результат.Количество() > 1 Тогда
			
			СтрокаОшибки = НСтр("ru = 'Допускается ввод только одного адреса электронной почты'");
			
		КонецЕсли;
	Исключение
		СтрокаОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Если Не ПустаяСтрока(СтрокаОшибки) Тогда
		ВывестиСообщениеПользователю(СтрокаОшибки, ИмяРеквизита, ПолеРеквизита);
		УровеньОшибки = ?(ВидИнформации.ПроверятьКорректность, 2, 1);
	Иначе
		УровеньОшибки = 0;
	КонецЕсли;
	
	Возврат УровеньОшибки;
	
КонецФункции

// Проверяет контактную информацию адреса и сообщает об ошибках. Возвращает флаг наличия ошибок.
//
// Параметры:
//     Источник      - ОбъектXDTO - контактная информацией.
//     ВидИнформации - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации с настройками проверки.
//     ИмяРеквизита  - Строка - необязательно имя реквизита для привязки сообщения об ошибке.
//
// Возвращаемое значение:
//     Число - уровень ошибок: 0 - нет, 1 - неблокирующие, 2 - блокирующие.
//
Функция ОшибкиЗаполненияАдреса(Источник, ВидИнформации, ИмяРеквизита = "", ПолеРеквизита = "")
	
	Если Не ВидИнформации.ПроверятьКорректность Тогда
		Возврат 0;
	КонецЕсли;
	ЕстьОшибки = Ложь;
	
	Если НЕ УправлениеКонтактнойИнформациейСлужебный.ЭтоНациональныйАдрес(Источник) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если Метаданные.Обработки.Найти("РасширенныйВводКонтактнойИнформации") <> Неопределено Тогда
		СписокОшибок = Обработки["РасширенныйВводКонтактнойИнформации"].ОшибкиЗаполненияАдресаXDTO(Источник, ВидИнформации);
		Для Каждого Элемент Из СписокОшибок Цикл
			ВывестиСообщениеПользователю(Элемент.Представление, ИмяРеквизита, ПолеРеквизита);
			ЕстьОшибки = Истина;
		КонецЦикла;
	КонецЕсли;
	
	Если ЕстьОшибки И ВидИнформации.ПроверятьКорректность Тогда
		Возврат 2;
	ИначеЕсли ЕстьОшибки Тогда
		Возврат 1;
	КонецЕсли;
	
	Возврат 0;
КонецФункции

// Проверяет контактную информацию телефона и сообщает об ошибках. Возвращает флаг наличия ошибок.
//
// Параметры:
//     Источник      - ОбъектXDTO - контактная информацией.
//     ВидИнформации - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации с настройками проверки.
//     ИмяРеквизита  - Строка - необязательно имя реквизита для привязки сообщения об ошибке.
//
// Возвращаемое значение:
//     Число - уровень ошибок: 0 - нет, 1 - неблокирующие, 2 - блокирующие.
//
Функция ОшибкиЗаполненияТелефона(Источник, ВидИнформации, ИмяРеквизита = "")
	Возврат 0;
КонецФункции

// Проверяет контактную информацию веб страницы и сообщает об ошибках. Возвращает флаг наличия ошибок.
//
// Параметры:
//     Источник      - ОбъектXDTO - контактная информацией.
//     ВидИнформации - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации с настройками проверки.
//     ИмяРеквизита  - Строка - необязательно имя реквизита для привязки сообщения об ошибке.
//
// Возвращаемое значение:
//     Число - уровень ошибок: 0 - нет, 1 - неблокирующие, 2 - блокирующие.
//
Функция ОшибкиЗаполненияВебСтраницы(Источник, ВидИнформации, ИмяРеквизита = "")
	Возврат 0;
КонецФункции

// Процедура - Вывести сообщение пользователю
//
// Параметры:
//  ТекстСообщения	 - 	 - 
//  ИмяРеквизита	 - 	 - 
//  ПолеРеквизита	 - 	 - 
//
Процедура ВывестиСообщениеПользователю(ТекстСообщения, ИмяРеквизита, ПолеРеквизита)
	
	ИмяРеквизита = ?(ПустаяСтрока(ПолеРеквизита), ИмяРеквизита, "");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, ПолеРеквизита, ИмяРеквизита);
	
КонецПроцедуры

// Процедура устанавливает настройку вида контактной информации "ВыводитьВФормеВсегда"
//
// Параметры:
//  ВидКонтактнойИнформации	 - СправочникСсылка.ВидыКонтактнойИнформации	 - вид для которого устанавливается настройка
//  Включить				 - булево	 - значение настройки
//
Процедура УстановитьФлагВыводитьВФормеВсегда(ВидКонтактнойИнформации, Включить = Истина) Экспорт
	
	НаборЗаписей = РегистрыСведений.НастройкиВидовКонтактнойИнформации.СоздатьНаборЗаписей();
	
	// Прочитаем набор записей.
	НаборЗаписей.Отбор.Вид.Установить(ВидКонтактнойИнформации);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		ЗаписьНабора = НаборЗаписей.Добавить();
	ИначеЕсли НаборЗаписей[0].ВыводитьВФормеВсегда = Включить Тогда
		Возврат; // Настройка уже есть, дополнительных действий не требуется
	Иначе
		ЗаписьНабора = НаборЗаписей[0];
	КонецЕсли;
	
	ЗаписьНабора.Вид = ВидКонтактнойИнформации;
	ЗаписьНабора.ВыводитьВФормеВсегда = Включить;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Проверяет контактную информацию
//
// Параметры:
//  Представление - Строка - Строка  - представления. Используется, если невозможно определить представление из параметра.
//                    ЗначенияПолей (отсутствие поля "Представление").
//  ЗначенияПолей - Строка, Структура, Соответствие, СписокЗначений - описание полей контактной информации.
//  ВидИнформации - СправочникСсылка.ВидыКонтактнойИнформации - 
//  Используется для определения типа, если его невозможно вычислить по полю ЗначенияПолей.
//  ТипИнформации - ПеречислениеСсылка.ТипыКонтактнойИнформации - Тип контактной информации
//  ИмяРеквизита - Строка - Имя реквизита на форме
//  Комментарий - Строка - Комментарий
//  ПутьКРеквизиту - Строка - Путь к реквизиту.
// 
// Возвращаемое значение:
//  Число - уровень ошибок, 0 - ошибки отсутствуют.
//
Функция ПроверитьКонтактнуюИнформацию(Представление, ЗначенияПолей, ВидИнформации, ТипИнформации,
	ИмяРеквизита, Комментарий = Неопределено, ПутьКРеквизиту = "") Экспорт
	
	ТекстСериализации = ?(ПустаяСтрока(ЗначенияПолей), Представление, ЗначенияПолей);
	
	ОбъектКИ = УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияИзXML(ТекстСериализации, ВидИнформации);
	Если Комментарий <> Неопределено Тогда
		ОбъектКИ.Комментарий = Комментарий;
	КонецЕсли;
	ОбъектКИ.Представление = Представление;
	
	Если ПустаяСтрока(Представление) И ПустаяСтрока(ОбъектКИ.Комментарий) Тогда
		Возврат 0;
	КонецЕсли;
	
	// Проверка
	Если ТипИнформации = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		УровеньОшибок = ОшибкиЗаполненияЭлектроннойПочты(ОбъектКИ, ВидИнформации, ИмяРеквизита, ПутьКРеквизиту);
	ИначеЕсли ТипИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		УровеньОшибок = ОшибкиЗаполненияАдреса(ОбъектКИ.Состав, ВидИнформации, ИмяРеквизита);
	ИначеЕсли ТипИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		УровеньОшибок = ОшибкиЗаполненияТелефона(ОбъектКИ, ВидИнформации, ИмяРеквизита);
	ИначеЕсли ТипИнформации = Перечисления.ТипыКонтактнойИнформации.Факс Тогда
		УровеньОшибок = ОшибкиЗаполненияТелефона(ОбъектКИ, ВидИнформации, ИмяРеквизита);
	// ИначеЕсли ТипИнформации = Перечисления.ТипыКонтактнойИнформации.ВебСтраница Тогда
	//	УровеньОшибок = ОшибкиЗаполненияВебСтраницы(ОбъектКИ, ВидИнформации, ИмяРеквизита);
	Иначе
		// Другое (прочее) не проверяем.
		УровеньОшибок = 0;
	КонецЕсли;
	
	Возврат УровеньОшибок;
	
КонецФункции

// Сравнивает два экземпляра контактной информации.
//
// Параметры:
//    Данные1 - ОбъектXTDO - объект с контактной информацией.
//            - Строка     - контактная информация в формате XML.
//            - Структура  - описание контактной информацию. Ожидаются поля:
//                 * ЗначенияПолей - Строка, Структура, СписокЗначений, Соответствие - поля контактной информации.
//                 * Представление - Строка - Представление. Используется в случае, если не удалось вычислить 
//                                            представление из ЗначенияПолей (отсутствие в них поля Представление).
//                 * Комментарий - Строка - комментарий. Используется в случае, если не удалось вычислить  комментарий
//                                          из ЗначенияПолей.
//                 * ВидКонтактнойИнформации - СправочникСсылка.ВидыКонтактнойИнформации, 
//				   ПеречислениеСсылка.ТипыКонтактнойИнформации, Структура
//                                             Используется в случае, если не удалось вычислить  тип из ЗначенияПолей.
//    Данные2 - ОбъектXTDO, Строка, Структура - аналогично Данные1.
//
// Возвращаемое значение:
//     ТаблицаЗначений: - таблица отличающихся полей со следующими колонками:
//        * Путь      - Строка - XPath, идентифицирующий различающееся значение. Значение "ТипКонтактнойИнформации"
//                               означает, что переданные экземпляры контактной информации различаются типом.
//        * Описание  - Строка - описание отличающегося реквизита в терминах предметной области.
//        * Значение1 - Строка - значение, соответствующая объекту, переданному в параметре Данные1.
//        * Значение2 - Строка - значение, соответствующая объекту, переданному в параметре Данные2.
//
Функция РазличияКонтактнойИнформации(Знач Данные1, Знач Данные2) Экспорт
	Возврат УправлениеКонтактнойИнформациейСлужебный.РазличияКонтактнойИнформации(Данные1, Данные2);
КонецФункции

// Возвращает сведения об адресах в виде структуру частей адреса и кодов КЛАДР
//
// Параметры:
//   Адреса                  - Массив - XDTO объекты или строки XML контактной информации
//   ДополнительныеПараметры - Структура - параметры контактной информации. 
//       * БезПредставлений - Булево - Если Истина, то поле представления адреса будет отсутствовать.
//       * КодыКЛАДР - Булево - Если Истина, то возвращает структуру с кодами КЛАДР по всем частям адреса
//       * ПолныеНаименованияСокращений - Булево - Если Истина, то возвращает полное наименование адресных объектов
//       * НаименованиеВключаетСокращение - Булево - Если Истина, то поля содержат сокращениям в наименованиях адресных объектов.
// Возвращаемое значение:
//   Массив - содержит массив структур, содержимое структуры см. описание функции СведенияОбАдресе.
//
Функция СведенияОбАдресах(Адреса, ДополнительныеПараметры = Неопределено) Экспорт
	Возврат УправлениеКонтактнойИнформациейСлужебныйСтоматология.СведенияОбАдресахВВидеСтруктуры(Адреса, ДополнительныеПараметры);
КонецФункции

// Возвращает сведения об адресах в виде структуру частей адреса и кодов КЛАДР
// 
// Параметры:
//   Адрес                  - Строка, ОбъектXDTO - XDTO объект или строка XML контактной информации
//   ДополнительныеПараметры - Структура - параметры контактной информации. 
//       * БезПредставлений - Булево - Если Истина, то поле представления адреса будет отсутствовать.
//       * КодыКЛАДР - Булево - Если Истина, то возвращает структуру с кодами КЛАДР по всем частям адреса
//       * ПолныеНаименованияСокращений - Булево - Если Истина, то возвращает полное наименование адресных объектов
//       * НаименованиеВключаетСокращение - Булево - Если Истина, то поля содержат сокращениям в наименованиях адресных объектов.
// Возвращаемое значение:
//   Структура - набор пар ключ-значение. Состав свойств для адреса:
//        * Страна           - Строка - текстовое представление страны.
//        * КодСтраны        - Строка - код страны по ОКСМ.
//        * Индекс           - Строка - почтовый индекс.
//        * КодРегиона       - Строка - код региона РФ.
//        * Регион           - Строка - текстовое представление региона РФ.
//        * РегионСокращение - Строка - сокращение региона.
//        * Округ            - Строка - текстовое представление округа.
//        * ОкругСокращение  - Строка - сокращение округа.
//        * Район            - Строка - текстовое представление района.
//        * РайонСокращение  - Строка - сокращение района.
//        * Город            - Строка - текстовое представление города
//        * ГородСокращение  - Строка - сокращение города.
//        * ВнутригородскойРайон - Строка - текстовое представление внутригородского района
//        * ВнутригородскойРайонСокращение  - Строка - сокращение внутригородского района.
//        * НаселенныйПункт  - Строка - текстовое представление населенного пункта.
//        * НаселенныйПунктСокращение - Строка - сокращение населенного пункта.
//        * Улица            - Строка - текстовое представление улицы.
//        * УлицаСокращение  - Строка - сокращение улицы.
//        * ДополнительнаяТерритория - Строка - текстовое представление дополнительной территории.
//        * ДополнительнаяТерриторияСокращение - Строка - сокращение дополнительной территории.
//        * ЭлементДополнительнойТерритории - Строка - текстовое представление элемента дополнительной территории.
//        * ЭлементДополнительнойТерриторииСокращение - Строка - сокращение элемента дополнительной территории.
//        * Здание - Структура - структура с информацией о здании адреса
//            ** ТипЗдания - Строка  - тип объекта адресации адреса РФ согласно приказу ФНС ММВ-7-1/525 от 31.08.2011.
//            ** Номер - Строка  - текстовое представление номера дома (только для адресов РФ).
//        * Корпуса - Массив - содержит структуры(поля структуры: ТипКорпуса, Номер) с перечнем корпусов адреса.
//        * Помещения - Массив - содержит структуры(поля структуры: ТипПомещения, Номер) с перечнем помещений адреса.
//        * КодыКЛАДР           - Структура - Коды КЛАДР, если установлен параметр КодыКЛАДР.
//           ** Регион          - Строка    - код КЛАДР региона.
//           ** Район           - Строка    - код КЛАДР район.
//           ** Город           - Строка    - код КЛАДР города.
//           ** НаселенныйПункт - Строка    - код КЛАДР населенного пункта.
//           ** Улица           - Строка    - код КЛАДР улица.
//        * ДополнительныеКоды  - Структура - Коды ОКТМО, ОКТМО, ОКАТО, КодИФНСФЛ, КодИФНСЮЛ, КодУчасткаИФНСФЛ, КодУчасткаИФНСЮЛ.
Функция СведенияОбАдресе(Адрес, ДополнительныеПараметры = Неопределено) Экспорт
	
	Возврат УправлениеКонтактнойИнформациейСлужебныйСтоматология.СведенияОбАдресеВВидеСтруктуры(Адрес, ДополнительныеПараметры);
	
КонецФункции

// Проверяет на наличие в форме заполненных строк КИ того же вида (за исключением текущей).
// 
Функция ЕстьДругиеЗаполненныеСтрокКИДанногоВида(Знач Форма, Знач ПроверяемаяСтрока, Знач ВидКонтактнойИнформации)
	
	ВсеСтрокиЭтогоВида = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(
		Новый Структура("Вид", ВидКонтактнойИнформации));
	
	Для Каждого СтрокаВида Из ВсеСтрокиЭтогоВида Цикл
		
		Если СтрокаВида <> ПроверяемаяСтрока Тогда
			Представление = Форма[СтрокаВида.ИмяРеквизита];
			Если Не ПустаяСтрока(Представление) Тогда 
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Процедура - Создать элементы табличной части
//
// Параметры:
//  Форма							 - 	 - 
//  ИмяОбъекта						 - 	 - 
//  ИмяЭлементаДляРазмещения		 - 	 - 
//  СтрокаКонтактнойИнформации		 - 	 - 
//  ДанныеВидаКонтактнойИнформации	 - 	 - 
//
Процедура СоздатьЭлементыТабличнойЧасти(Знач Форма, Знач ИмяОбъекта, ИмяЭлементаДляРазмещения, 
	Знач СтрокаКонтактнойИнформации, Знач ДанныеВидаКонтактнойИнформации)
	
	ВидыКонтактнойИнформацииТЧ = Новый Массив;
	Для Каждого СтрокаТабличнойЧасти Из СтрокаКонтактнойИнформации.Строки Цикл
		ВидыКонтактнойИнформацииТЧ.Добавить(СтрокаТабличнойЧасти.Вид);
	КонецЦикла;
	ДанныеВидовКонтактнойИнформацииТЧ = УправлениеКонтактнойИнформациейСлужебный.ДанныеВидовКонтактнойИнформации(
		ВидыКонтактнойИнформацииТЧ);
	
	ИмяВидаКонтактнойИнформации = ДанныеВидаКонтактнойИнформации.ИмяПредопределенногоВида;
	Если ПустаяСтрока(ИмяВидаКонтактнойИнформации) Тогда
		ИмяВидаКонтактнойИнформации = ДанныеВидаКонтактнойИнформации.ИмяПредопределенныхДанных;
	КонецЕсли;
	Позиция = СтрНайти(ИмяВидаКонтактнойИнформации, ИмяОбъекта);
	ИмяТабличнойЧасти = Сред(ИмяВидаКонтактнойИнформации, Позиция + СтрДлина(ИмяОбъекта));
	ПредыдущийВидТЧ = Неопределено;
	
	Для Каждого СтрокаТабличнойЧасти Из СтрокаКонтактнойИнформации.Строки Цикл
		
		ВидКонтактнойИнформацииТЧ = СтрокаТабличнойЧасти.Вид;
		Если ВидКонтактнойИнформацииТЧ <> ПредыдущийВидТЧ Тогда
			
			ГруппаТабличнойЧасти = Форма.Элементы[ИмяТабличнойЧасти + "ГруппаКонтактнаяИнформация"];
			
			Элемент = Форма.Элементы.Добавить(СтрокаТабличнойЧасти.ИмяРеквизита, Тип("ПолеФормы"), ГруппаТабличнойЧасти);
			Элемент.Вид = ВидПоляФормы.ПолеВвода;
			Элемент.ПутьКДанным = "Объект." + ИмяТабличнойЧасти + "." + СтрокаТабличнойЧасти.ИмяРеквизита;
			
			Если ДляТипаКонтактнойИнформацииДоступноРедактированиеВДиалоге(СтрокаТабличнойЧасти.Тип) Тогда
				Элемент.КнопкаВыбора = Не СтрокаТабличнойЧасти.ПометкаУдаления;
				Если ВидКонтактнойИнформацииТЧ.ВидРедактирования = "Диалог" Тогда
					Элемент.РедактированиеТекста = Ложь;
				КонецЕсли;
				
				Элемент.УстановитьДействие("НачалоВыбора", "Подключаемый_КонтактнаяИнформацияНачалоВыбора");
			КонецЕсли;
			Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_КонтактнаяИнформацияПриИзменении");
			
			Если СтрокаТабличнойЧасти.ПометкаУдаления Тогда
				Элемент.Шрифт = ШрифтыСтиля.ЗаголовокУдаленногоРеквизитаШрифт;
				Элемент.РедактированиеТекста = Ложь;
			КонецЕсли;
			
			Если ВидКонтактнойИнформацииТЧ.ОбязательноеЗаполнение Тогда
				Элемент.АвтоОтметкаНезаполненного = Не СтрокаТабличнойЧасти.ПометкаУдаления;
			КонецЕсли;
			
			ПараметрыКонтактнойИнформацииЭлемента = Форма.ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения]; // см. ПараметрыВыводаКонтактнойИнформации
			ПараметрыКонтактнойИнформацииЭлемента.ДобавленныеЭлементы.Добавить(СтрокаТабличнойЧасти.ИмяРеквизита, 2, Ложь);
			
			ДобавитьРеквизитВОписание(Форма, СтрокаТабличнойЧасти, ДанныеВидовКонтактнойИнформацииТЧ, Ложь, Истина,, ИмяЭлементаДляРазмещения);
			ПредыдущийВидТЧ = ВидКонтактнойИнформацииТЧ;
			
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторСтрокиТабличнойЧасти", СтрокаТабличнойЧасти.ИдентификаторСтрокиТабличнойЧасти);
		
		СтрокиТаблицы = Форма.Объект[ИмяТабличнойЧасти].НайтиСтроки(Отбор);
		
		Если СтрокиТаблицы.Количество() = 1 Тогда
			СтрокаТаблицы = СтрокиТаблицы[0];
			СтрокаТаблицы[СтрокаТабличнойЧасти.ИмяРеквизита]                   = СтрокаТабличнойЧасти.Представление;
			СтрокаТаблицы[СтрокаТабличнойЧасти.ИмяРеквизита + "Значение"]      = СтрокаТабличнойЧасти.Значение;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы.

// Устанавливает свойства вида контактной информации.
//
// Параметры:
//    Параметры - Структура - содержит структуру с полями:
//        * Вид - СправочникСсылка.ВидыКонтактнойИнформации, Строка   - Ссылка на вид контактной информации или
//                                                                      идентификатор предопределенного элемента.
//        * Тип - ПеречислениеСсылка.ТипыКонтактнойИнформации - Тип контактной информации или его
//                                                                      идентификатор.
//        * Подсказка - Строка                                        - Подсказка к виду контактной информации.
//        * Порядок - Число, Неопределено                             - Порядок вида контактной информации, положение в
//                                                                      списке относительно других элементов:
//                                                                          Неопределено - не переназначать;
//                                                                          0            - назначить автоматически;
//                                                                          Число > 0    - назначить указанный порядок.
//        * МожноИзменятьСпособРедактирования - Булево                - Истина, если есть возможность изменять способ
//                                                                      редактирования только в диалоге, Ложь - иначе.
//        * РедактированиеТолькоВДиалоге - Булево                     - Истина, если редактировать только в диалоге,
//                                                                      Ложь - иначе.
//        * ОбязательноеЗаполнение                                    - Булево - Истина, если требуется обязательное
//                                                                      заполнение поля, Ложь - иначе.
//        * РазрешитьВводНесколькихЗначений - Булево                  - Признак возможности использования дополнительных
//                                                                      полей ввода для данного вида.
//        * ЗапретитьРедактированиеПользователем - Булево             - Признак недоступности редактирования
//                                                                      пользователем свойства вида контактной
//                                                                      информации.
//        * Используется - Булево -                                     Признак использования вида контактной информации
//                                                                      Значение по умолчанию Истина.
//        * НастройкиПроверки - Структура, Неопределено               - Настройки проверки вида контактной информации.
//            Для типа Адрес - Структура, содержащая поля:
//                * АдресТолькоРоссийский        - Булево - Истина, если возможен ввод только российских адресов.
//                * ПроверятьКорректность        - Булево - Истина, если требуется запрещать пользователю записывать
//                                                          некорректный адрес (только если АдресТолькоРоссийский = Истина).
//                * ПроверятьПоФИАС              - Булево - Истина, если требуется проверка адреса по ФИАС, иначе
//                                                          проверка по КЛАДР (только если АдресТолькоРоссийский = Истина
//                                                          и ПроверятьКорректность = Истина).
//                * ЗапрещатьВводНекорректного   - Булево - Устарел. Все переданные значения игнорируются.
//                                                          Для запрета пользователю записывать некорректные адреса,
//                                                          следует использовать параметр ПроверятьКорректность.
//                * СкрыватьНеактуальныеАдреса   - Булево - Истина, если не требуется показывать неактуальные адреса при
//                                                          вводе (только если АдресТолькоРоссийский = Истина).
//                * ВключатьСтрануВПредставление - Булево - Истина, если требуется включать наименование страны в
//                                                          представление адреса.
//            Для типа АдресЭлектроннойПочты - Структура, содержащая поля:
//                * ПроверятьКорректность        - Булево - Истина, если требуется запрещать пользователю записывать
//                                                          некорректный адрес электронной почты.
//                * ЗапрещатьВводНекорректного   - Булево - Устарел. Все переданные значения игнорируются.
//                                                          Для запрета пользователю записывать некорректные адреса,
//                                                          следует использовать параметр ПроверятьКорректность.
//            Для остальных типов или для задания настроек по умолчанию используется Неопределено.
//
// Примечание:
//
//    При использовании параметра Порядок следует внимательно следить за уникальностью назначаемого значения. Если
//    после выполнения обновления значения порядка окажутся неуникальными в пределах группы, то настройка порядка
//    пользователем будет невозможна.
//    В общем случае рекомендуется не использовать этот параметр (порядок не изменится), либо заполнять его значением
//    0 (порядок будет назначен автоматически в подсистеме "Настройка порядка элементов" при выполнении процедуры).
//    Для размещения видов КИ в определенной последовательности относительно друг друга без явного размещения в начале
//    списка достаточно вызывать данную процедуру в нужной последовательности для каждого вида КИ с указанием
//    порядка 0. Если добавляется предопределенный вид КИ к уже существующим в ИБ, не рекомендуется назначать порядок
//    в явном виде.
// 
Процедура УстановитьСвойстваВидаКонтактнойИнформации(Параметры) Экспорт
	
	Если ТипЗнч(Параметры.Вид) = Тип("Строка") Тогда
		Объект = Справочники.ВидыКонтактнойИнформации[Параметры.Вид].ПолучитьОбъект();
	Иначе
		Объект = Параметры.Вид.ПолучитьОбъект();
	КонецЕсли;
	
	Объект.Тип                                  = Параметры.Тип;
	Объект.Подсказка                            = Параметры.Подсказка;
	Объект.Наименование 						= ?(ЗначениеЗаполнено(Параметры.Наименование), Параметры.Наименование, Объект.Наименование);
	Объект.МожноИзменятьСпособРедактирования    = Параметры.МожноИзменятьСпособРедактирования;
	Объект.РедактированиеТолькоВДиалоге         = Параметры.РедактированиеТолькоВДиалоге;
	Объект.ОбязательноеЗаполнение               = Параметры.ОбязательноеЗаполнение;
	Объект.РазрешитьВводНесколькихЗначений      = Параметры.РазрешитьВводНесколькихЗначений;
	Объект.ЗапретитьРедактированиеПользователем = Параметры.ЗапретитьРедактированиеПользователем;
	Объект.Используется                         = Параметры.Используется;
	Объект.ВыводитьПоУмолчанию                  = Параметры.ВыводитьПоУмолчанию;	
	Объект.ХранитьИсториюИзменений              = Параметры.ХранитьИсториюИзменений;
	Объект.МногострочноеПоле                    = Параметры.МногострочноеПоле;
	
	НастройкиПроверки = Параметры.НастройкиПроверки;
	ПроверятьНастройки = ТипЗнч(НастройкиПроверки) = Тип("Структура");
	
	Если ПроверятьНастройки И Параметры.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		ЗаполнитьЗначенияСвойств(Объект, НастройкиПроверки);
	ИначеЕсли ПроверятьНастройки И Параметры.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		УстановитьЗначенияРеквизитовПроверки(Объект, НастройкиПроверки);
	Иначе
		УстановитьЗначенияРеквизитовПроверки(Объект);
	КонецЕсли;
	
	Результат = УправлениеКонтактнойИнформациейСлужебный.ПроверитьПараметрыВидаКонтактнойИнформации(Объект);
	
	Если Результат.ЕстьОшибки Тогда
		ВызватьИсключение Результат.ТекстОшибки;
	КонецЕсли;
	
	Если Параметры.Порядок <> Неопределено Тогда
		Объект.РеквизитДопУпорядочивания = Параметры.Порядок;
	КонецЕсли;
	
	Объект.Записать();
	
КонецПроцедуры

// Возвращает структуру параметров вида контактной информации для определенного типа.
// 
// Параметры:
//    Тип - ПеречислениеСсылка.ТипыКонтактнойИнформации, Строка - тип контактной информации для
//                                                                заполнения свойства НастройкиПроверки.
// 
// Возвращаемое значение:
//    Структура - содержит структуру с полями:
//        * Вид - СправочникСсылка.ВидыКонтактнойИнформации, Строка   - Ссылка на вид контактной информации или
//                                                                      идентификатор предопределенного элемента.
//        * Тип - ПеречислениеСсылка.ТипыКонтактнойИнформации - Тип контактной информации или его
//                                                                      идентификатор.
//        * Подсказка - Строка                                        - Подсказка к виду контактной информации.
//        * Порядок - Число, Неопределено                             - Порядок вида контактной информации, положение в
//                                                                      списке относительно других элементов:
//                                                                          Неопределено - не переназначать;
//                                                                          0            - назначить автоматически;
//                                                                          Число > 0    - назначить указанный порядок.
//        * МожноИзменятьСпособРедактирования - Булево                - Истина, если есть возможность изменять способ
//                                                                      редактирования только в диалоге, Ложь - иначе.
//        * РедактированиеТолькоВДиалоге - Булево                     - Истина, если редактировать только в диалоге,
//                                                                      Ложь - иначе.
//        * ОбязательноеЗаполнение                                    - Булево - Истина, если требуется обязательное
//                                                                      заполнение поля, Ложь - иначе.
//        * РазрешитьВводНесколькихЗначений - Булево                  - Признак возможности использования дополнительных
//                                                                      полей ввода для данного вида.
//        * ЗапретитьРедактированиеПользователем - Булево             - Признак недоступности редактирования
//                                                                      пользователем свойства вида контактной
//                                                                      информации.
//        * Используется - Булево -                                     Признак использования вида контактной информации
//                                                                      Значение по умолчанию Истина.
//        * НастройкиПроверки - Структура, Неопределено               - Настройки проверки вида контактной информации.
//            Для типа Адрес - Структура, содержащая поля:
//                * АдресТолькоРоссийский        - Булево - Истина, если возможен ввод только российских адресов.
//                * ПроверятьКорректность        - Булево - Истина, если требуется запрещать пользователю записывать
//                                                          некорректный адрес (только если АдресТолькоРоссийский = Истина).
//                * ПроверятьПоФИАС              - Булево - Истина, если требуется проверка адреса по ФИАС, иначе
//                                                          проверка по КЛАДР (только если АдресТолькоРоссийский = Истина
//                                                          и ПроверятьКорректность = Истина).
//                * СкрыватьНеактуальныеАдреса   - Булево - Истина, если не требуется показывать неактуальные адреса при
//                                                          вводе (только если АдресТолькоРоссийский = Истина).
//                * ВключатьСтрануВПредставление - Булево - Истина, если требуется включать наименование страны в
//                                                          представление адреса.
//            Для типа АдресЭлектроннойПочты - Структура, содержащая поля:
//                * ПроверятьКорректность        - Булево - Истина, если требуется запрещать пользователю записывать
//                                                          некорректный адрес электронной почты.
//            Для остальных типов или для задания настроек по умолчанию используется Неопределено.
//
Функция ПараметрыВидаКонтактнойИнформации(Тип = Неопределено) Экспорт
	
	Если ТипЗнч(Тип) = Тип("Строка") Тогда
		УстанавливаемыйТип = Перечисления.ТипыКонтактнойИнформации[Тип];
	Иначе
		УстанавливаемыйТип = Тип;
	КонецЕсли;
	
	ПараметрыВида = Новый Структура;
	ПараметрыВида.Вставить("Вид");
	ПараметрыВида.Вставить("Тип", УстанавливаемыйТип);
	ПараметрыВида.Вставить("Подсказка");
	ПараметрыВида.Вставить("Наименование");
	ПараметрыВида.Вставить("Порядок");
	ПараметрыВида.Вставить("МожноИзменятьСпособРедактирования"		, Ложь);
	ПараметрыВида.Вставить("РедактированиеТолькоВДиалоге"			, Ложь);
	ПараметрыВида.Вставить("ОбязательноеЗаполнение"					, Ложь);
	ПараметрыВида.Вставить("РазрешитьВводНесколькихЗначений"		, Ложь);
	ПараметрыВида.Вставить("ЗапретитьРедактированиеПользователем"	, Ложь);
	ПараметрыВида.Вставить("ХранитьИсториюИзменений"				, Ложь);
	ПараметрыВида.Вставить("Используется"							, Истина);
	ПараметрыВида.Вставить("ВыводитьПоУмолчанию"					, Ложь);	
	ПараметрыВида.Вставить("МногострочноеПоле"						, Ложь);
	
	Если УстанавливаемыйТип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		НастройкиПроверки = Новый Структура;
		НастройкиПроверки.Вставить("АдресТолькоРоссийский"			, Ложь);
		НастройкиПроверки.Вставить("ПроверятьКорректность"			, Ложь);
		НастройкиПроверки.Вставить("ПроверятьПоФИАС"				, Ложь);
		НастройкиПроверки.Вставить("СкрыватьНеактуальныеАдреса"		, Ложь);
		НастройкиПроверки.Вставить("ВключатьСтрануВПредставление"	, Ложь);
		НастройкиПроверки.Вставить("УказыватьОКТМО"					, Ложь);
	ИначеЕсли УстанавливаемыйТип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		НастройкиПроверки = Новый Структура;
		НастройкиПроверки.Вставить("ПроверятьКорректность"			, Ложь);
	ИначеЕсли УстанавливаемыйТип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		НастройкиПроверки = Новый Структура;
		НастройкиПроверки.Вставить("ПроверятьКорректность"			, Ложь);		
		НастройкиПроверки.Вставить("ТелефонCДобавочнымНомером"		, Истина);
	Иначе
		НастройкиПроверки = Неопределено;
	КонецЕсли;
	
	ПараметрыВида.Вставить("НастройкиПроверки", НастройкиПроверки);
	
	Возврат ПараметрыВида;
	
КонецФункции

// Обновляет представление в поле агрегате ВидДляСписка для вывода в контактной информации
//  в динамических списках и отчетах.
//
// Параметры:
//  Объект - ОбъектСсылка - ссылка на объект конфигурации, содержащий табличную часть контактная информация.
//
Процедура ОбновитьКонтактнуюИнформациюДляСписков(Объект = Неопределено) Экспорт
	
	Если Объект = Неопределено Тогда
		УправлениеКонтактнойИнформациейСлужебный.ОбновитьКонтактнуюИнформациюДляСписков();
	Иначе
		Если Объект.Метаданные().ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.Найти("ВидДляСписка") <> Неопределено Тогда
			УправлениеКонтактнойИнформациейСлужебный.ОбновитьКонтактнуюИнформациюДляСписковДляОбъекта(Объект);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Выполняет отложенное обновление контактной информации для списков
//
// Параметры:
//  Параметры	 - Структура - Параметры обработчика обновления
//  РазмерПорции - Число -  Необязательный параметр размер порции обрабатываемых данных за один запуск.
//
Процедура ОбновитьКонтактнуюИнформациюДляСписковОтложенно(Параметры, РазмерПорции = 1000) Экспорт
	
	ОбъектыСВидомДляСписка = Неопределено;
	Параметры.Свойство("ОбъектыСВидомДляСписка", ОбъектыСВидомДляСписка);
	
	Если Параметры.ПрогрессВыполнения.ВсегоОбъектов = 0 Тогда
		// расчет количества
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыКонтактнойИнформации.Ссылка,
		|	ВидыКонтактнойИнформации.ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|ГДЕ
		|	ВидыКонтактнойИнформации.ЭтоГруппа = ИСТИНА";
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ОбъектыСВидомДляСписка = Новый Массив;
		ТекстЗапроса = "";
		Разделитель = "";
		
		ШаблонЗапроса = "ВЫБРАТЬ
					| КОЛИЧЕСТВО(ТаблицаСКонтактнойИнформацией.Ссылка) КАК Количество,
					| ТИПЗНАЧЕНИЯ(ТаблицаСКонтактнойИнформацией.Ссылка) КАК Ссылка
					|ИЗ
					| %1.%2 КАК ТаблицаСКонтактнойИнформацией
					| СГРУППИРОВАТЬ ПО
					|	ТИПЗНАЧЕНИЯ(ТаблицаСКонтактнойИнформацией.Ссылка)";
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если СтрНачинаетсяС(ВыборкаДетальныеЗаписи.ИмяПредопределенныхДанных, "Справочник") Тогда
				ИмяОбъекта = Сред(ВыборкаДетальныеЗаписи.ИмяПредопределенныхДанных, 11);
				
				Если Метаданные.Справочники.Найти(ИмяОбъекта) <> Неопределено Тогда
					ТЧ_КонтактнаяИнформация = Метаданные.Справочники[ИмяОбъекта].ТабличныеЧасти.КонтактнаяИнформация;
					Если ТЧ_КонтактнаяИнформация.Реквизиты.Найти("ВидДляСписка") <> Неопределено Тогда
						ТекстЗапроса = ТекстЗапроса + Разделитель + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗапроса, "Справочник", ИмяОбъекта);
						Разделитель = " ОБЪЕДИНИТЬ ВСЕ ";
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли СтрНачинаетсяС(ВыборкаДетальныеЗаписи.ИмяПредопределенныхДанных, "Документ") Тогда
				ИмяОбъекта = Сред(ВыборкаДетальныеЗаписи.ИмяПредопределенныхДанных, 9);
				
				Если Метаданные.Документы.Найти(ИмяОбъекта) <> Неопределено Тогда
					ТЧ_КонтактнаяИнформация = Метаданные.Документы[ИмяОбъекта].ТабличныеЧасти.КонтактнаяИнформация;
					Если ТЧ_КонтактнаяИнформация.Реквизиты.Найти("ВидДляСписка") <> Неопределено Тогда
						ТекстЗапроса = ТекстЗапроса + Разделитель + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗапроса, "Документ", ИмяОбъекта);
						Разделитель = " ОБЪЕДИНИТЬ ВСЕ ";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ПустаяСтрока(ТекстЗапроса) Тогда
			Параметры.ОбработкаЗавершена = Ложь;
			Возврат;
		КонецЕсли;
		Запрос = Новый Запрос(ТекстЗапроса);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Количество = 0;
		ОбъектыСВидомДляСписка = Новый Массив;
		Пока РезультатЗапроса.Следующий() Цикл
			Количество = Количество + РезультатЗапроса.Количество;
			ОбъектыСВидомДляСписка.Добавить(РезультатЗапроса.Ссылка);
		КонецЦикла;
		Параметры.ПрогрессВыполнения.ВсегоОбъектов = Количество;
		Параметры.Вставить("ОбъектыСВидомДляСписка", ОбъектыСВидомДляСписка);
	КонецЕсли;
	
	Если ОбъектыСВидомДляСписка = Неопределено ИЛИ ОбъектыСВидомДляСписка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяОбъектаСВидомДляСписка = Метаданные.НайтиПоТипу(ОбъектыСВидомДляСписка.Получить(0)).ПолноеИмя();
	ТекстЗапроса = " ВЫБРАТЬ ПЕРВЫЕ " + Формат(РазмерПорции, "ЧГ=0") + "
	|	КонтактнаяИнформация.Ссылка КАК Ссылка
	|ИЗ
	|	" + ПолноеИмяОбъектаСВидомДляСписка + ".КонтактнаяИнформация КАК КонтактнаяИнформация
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтактнаяИнформация.Ссылка
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА КонтактнаяИнформация.ВидДляСписка = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПустаяСсылка)
	|				ТОГДА 0
	|				ИНАЧЕ 1
	|		КОНЕЦ) = 0";
		
	Запрос = Новый Запрос(ТекстЗапроса);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Количество = РезультатЗапроса.Количество();
	Если Количество > 0 Тогда
		Пока РезультатЗапроса.Следующий() Цикл
			Объект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
			ОбновитьКонтактнуюИнформациюДляСписков(Объект);
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект);
		КонецЦикла;
		Если Количество < 1000 Тогда
			ОбъектыСВидомДляСписка.Удалить(0);
		КонецЕсли;
		Параметры.ПрогрессВыполнения.ОбработаноОбъектов = Параметры.ПрогрессВыполнения.ОбработаноОбъектов + Количество;
	Иначе
		ОбъектыСВидомДляСписка.Удалить(0);
	КонецЕсли;

	Если ОбъектыСВидомДляСписка.Количество() > 0 Тогда
		Параметры.ОбработкаЗавершена = Ложь;
	КонецЕсли;
	
	Параметры.Вставить("ОбъектыСВидомДляСписка", ОбъектыСВидомДляСписка);
	
КонецПроцедуры

// Обработчик подписки события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполненияКонтактнойИнформации(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	ОбработкаЗаполненияКонтактнойИнформацииОбъекта(Источник, ДанныеЗаполнения);
	
КонецПроцедуры

// Обработчик подписки события "ПередЗаписью" для обновления контактной информации для списков.
//
Процедура ОбработкаОбновленияКонтактнойИнформации(Объект, Отказ) Экспорт
	
	Если Объект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьКонтактнуюИнформациюДляСписков(Объект);

КонецПроцедуры

// Обработчик подписки события "ОбработкаЗаполнения" для документов.
//
Процедура ОбработкаЗаполненияКонтактнойИнформацииДокумента(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	ОбработкаЗаполненияКонтактнойИнформацииОбъекта(Источник, ДанныеЗаполнения);
	
КонецПроцедуры

// Выполняет отложенную инициализацию реквизитов и элементов контактной информации
//
// Параметры:
//    Форма                - УправляемаяФорма - Форма объекта-владельца, предназначенная для вывода контактной.
//                           Информации.
//    Объект               - Произвольный - Объект-владелец контактной информации.
//
Процедура ВыполнитьОтложеннуюИнициализацию(Форма, Объект) Экспорт
	
	КонтактнаяИнформацияЗаглушка = Форма.Элементы.Найти("КонтактнаяИнформацияЗаглушка"); // временный элемент
	Если КонтактнаяИнформацияЗаглушка <> Неопределено Тогда
		Форма.Элементы.Удалить(КонтактнаяИнформацияЗаглушка);
	КонецЕсли;
	
	КонтактнаяИнформацияОписаниеДополнительныхРеквизитов = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Выгрузить(, "Вид, Представление, ЗначенияПолей, Комментарий");
	Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Очистить();
	ИмяЭлементаДляРазмещения = Форма.ПараметрыКонтактнойИнформации.ГруппаДляРазмещения;
	ПоложениеЗаголовкаКИ = Форма.ПараметрыКонтактнойИнформации.ПоложениеЗаголовка;
	ПоложениеЗаголовкаКИ = ?(ЗначениеЗаполнено(ПоложениеЗаголовкаКИ), ПоложениеЗаголовкаЭлементаФормы[ПоложениеЗаголовкаКИ], ПоложениеЗаголовкаЭлементаФормы.Верх);
	ПриСозданииНаСервере(Форма, Объект, ИмяЭлементаДляРазмещения, ПоложениеЗаголовкаКИ, Форма.ПараметрыКонтактнойИнформации.ИсключаемыеВиды);
	
	Для Каждого ВидКонтактнойИнформации Из Форма.ПараметрыКонтактнойИнформации.ИсключаемыеВиды Цикл
		
		Отбор = Новый Структура("Вид", ВидКонтактнойИнформации);
		МассивСтрок = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
		
		Если МассивСтрок.Количество() > 0 Тогда
			СохраненноеЗначение = КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор)[0];
			ТекущееЗначение = МассивСтрок[0];
			ЗаполнитьЗначенияСвойств(ТекущееЗначение, СохраненноеЗначение);
			Форма[ТекущееЗначение.ИмяРеквизита] = СохраненноеЗначение.Представление;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Форма.Элементы.Найти("ПустаяДекорацияКонтактнаяИнформация") <> Неопределено
		И Форма.Элементы.ГруппаПолейВводаКонтактнойИнформации.ПодчиненныеЭлементы.Количество() > 0 Тогда
		Форма.Элементы.ПустаяДекорацияКонтактнаяИнформация.Видимость = Ложь;
	КонецЕсли;
	
	Форма.ПараметрыКонтактнойИнформации.ВыполненаОтложеннаяИнициализация = Истина;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////// 
// Обратная совместимость.

//  Возвращает значения всей контактной информации определенного вида для объекта-владельца.
// 
//  Параметры:
//      Ссылка                  - ЛюбаяСсылка - ссылка на объект-владелец контактной информации (организация,
//                                              контрагент, партнер и т.д.).
//      ВидКонтактнойИнформации - СправочникСсылка.ВидыКонтактнойИнформации - параметры обработки.
// 
//  Возвращаемое значение:
//      Таблица значений -информация. Колонками: 
//          * НомерСтроки     - Число     - номер строки дополнительной табличной части объекта-владельца.
//          * Представление   - Строка    - представление КИ, введенное пользователем.
//          * СтруктураПолей  - Структура - пары ключ-значение данных информации.
// 
Функция ТаблицаКонтактнойИнформацииОбъекта(Ссылка, ВидКонтактнойИнформации, Дата = Неопределено) Экспорт
	
	МетаданныеОбъекта = Ссылка.Метаданные();
	
	Запрос = Новый Запрос;
	Если МетаданныеОбъекта.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.Найти("ДействуетС") <> Неопределено Тогда
		ДействуетС = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());
		ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("ВЫБРАТЬ РАЗРЕШЕННЫЕ 
			|	КонтактнаяИнформация.Ссылка КАК Объект,
			|	КонтактнаяИнформация.Вид КАК Вид,
			|	МАКСИМУМ(КонтактнаяИнформация.ДействуетС) КАК ДействуетС
			|ПОМЕСТИТЬ СрезКонтактнойИнформации
			|ИЗ
			|	%1.КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.Ссылка = &Ссылка
			|	И КонтактнаяИнформация.ДействуетС <= &ДействуетС
			|	И КонтактнаяИнформация.Вид <> ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПустаяСсылка)
			|	И КонтактнаяИнформация.Вид = &Вид
			|
			|СГРУППИРОВАТЬ ПО
			|	КонтактнаяИнформация.Вид,
			|	КонтактнаяИнформация.Ссылка
			|;
			|
			|//////////////////////////////////////////////////////////////////////////////// 
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КонтактнаяИнформация.ИдентификаторСтрокиТабличнойЧасти КАК НомерСтроки,
			|	КонтактнаяИнформация.Представление КАК Представление,
			|	КонтактнаяИнформация.ЗначенияПолей
			|ИЗ
			|	СрезКонтактнойИнформации КАК СрезКонтактнойИнформации
			|		ЛЕВОЕ СОЕДИНЕНИЕ %1.КонтактнаяИнформация КАК КонтактнаяИнформация
			|		ПО СрезКонтактнойИнформации.Вид = КонтактнаяИнформация.Вид
			|			И СрезКонтактнойИнформации.ДействуетС = КонтактнаяИнформация.ДействуетС
			|			И СрезКонтактнойИнформации.Объект = КонтактнаяИнформация.Ссылка 
			|УПОРЯДОЧИТЬ ПО 
			| КонтактнаяИнформация.ИдентификаторСтрокиТабличнойЧасти", МетаданныеОбъекта.ПолноеИмя());
		
			Запрос.УстановитьПараметр("ДействуетС", ДействуетС);
	Иначе
		ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("ВЫБРАТЬ 
		|	КонтактнаяИнформация.ИдентификаторСтрокиТабличнойЧасти КАК НомерСтроки,
		|	КонтактнаяИнформация.Представление                     КАК Представление,
		|	КонтактнаяИнформация.ЗначенияПолей                     КАК ЗначенияПолей
		|ИЗ
		|	%1.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &Ссылка
		|	И КонтактнаяИнформация.Вид = &Вид
		|УПОРЯДОЧИТЬ ПО 
		| КонтактнаяИнформация.ИдентификаторСтрокиТабличнойЧасти", МетаданныеОбъекта.ПолноеИмя());
	
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Вид", ВидКонтактнойИнформации);
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("НомерСтроки");
	Результат.Колонки.Добавить("Представление");
	Результат.Колонки.Добавить("СтруктураПолей");
	Результат.Индексы.Добавить("НомерСтроки");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаДанных = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанных, Выборка, "НомерСтроки, Представление");
		СтрокаДанных.СтруктураПолей = ПредыдущаяСтруктураКонтактнойИнформацииXML(
			Выборка.ЗначенияПолей, ВидКонтактнойИнформации);
	КонецЦикла;
	
	Возврат  Результат;
КонецФункции

// Преобразует данные формата XML в предыдущий формат контактной информации.
// 
// Параметры:
//    Данные                 - Строка - XML контактной информации.
//    СокращенныйСоставПолей - Булево - если Ложь, то из состава полей будут исключены
//                                      поля, отсутствующие в версиях БСП младше 2.1.3.
// 
// Возвращаемое значение:
//    Строка  - набор пар ключ-значение, разделенных переносом строки.
// 
Функция ПредыдущийФорматКонтактнойИнформацииXML(Знач Данные, Знач СокращенныйСоставПолей = Ложь) Экспорт
	
	Если УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВXML(Данные) Тогда
		СтарыйФормат = УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияВСтаруюСтруктуру(Данные, СокращенныйСоставПолей);
		Возврат УправлениеКонтактнойИнформациейКлиентСервер.ПреобразоватьСписокПолейВСтроку(
			СтарыйФормат.ЗначенияПолей, Ложь);
	КонецЕсли;
	
	Возврат Данные;
КонецФункции

// Преобразует данные нового формата XML контактной информации в структуру старого формата.
// 
// Параметры:
//   Данные                  - Строка - XML контактной информации или пары ключ-значение.
//   ВидКонтактнойИнформации - СправочникСсылка.ВидыКонтактнойИнформации, Структура - параметры контактной информации. 
// 
// Возвращаемое значение:
//   Структура - набор пар ключ-значение. Состав свойств для адреса:
//        ** Страна           - Строка - текстовое представление страны.
//        ** КодСтраны        - Строка - код страны по ОКСМ.
//        ** Индекс           - Строка - почтовый индекс (только для адресов РФ).
//        ** Регион           - Строка - текстовое представление региона РФ (только для адресов РФ).
//        ** КодРегиона       - Строка - код региона РФ (только для адресов РФ).
//        ** РегионСокращение - Строка - сокращение региона (если СтарыйСоставПолей = Ложь).
//        ** Район            - Строка - текстовое представление района (только для адресов РФ).
//        ** РайонСокращение  - Строка - сокращение района (если СтарыйСоставПолей = Ложь).
//        ** Город            - Строка - текстовое представление города (только для адресов РФ).
//        ** ГородСокращение  - Строка - сокращение города (только для адресов РФ).
//        ** НаселенныйПункт  - Строка - текстовое представление населенного пункта (только для адресов РФ).
//        ** НаселенныйПунктСокращение - Строка - сокращение населенного пункта (если СтарыйСоставПолей = Ложь).
//        ** Улица            - Строка - текстовое представление улицы (только для адресов РФ).
//        ** УлицаСокращение  - Строка - сокращение улицы (если СтарыйСоставПолей = Ложь).
//        ** ТипДома          - Строка - см. ТипыОбъектовАдресацииАдресаРФ().
//        ** Дом              - Строка - текстовое представление дома (только для адресов РФ).
//        ** ТипКорпуса       - Строка - см. ТипыОбъектовАдресацииАдресаРФ().
//        ** Корпус           - Строка - текстовое представление корпуса (только для адресов РФ).
//        ** ТипКвартиры      - Строка - см. ТипыОбъектовАдресацииАдресаРФ().
//        ** Квартира         - Строка - текстовое представление квартиры (только для адресов РФ).
//       Состав свойств для телефона:
//        ** КодСтраны        - Строка - код страны. Например, +7.
//        ** КодГорода        - Строка - код города. Например, 495.
//        ** НомерТелефона    - Строка - номер телефона.
//        ** Добавочный       - Строка - добавочный номер телефона.
// 
Функция ПредыдущаяСтруктураКонтактнойИнформацииXML(Знач Данные, Знач ВидКонтактнойИнформации = Неопределено) Экспорт
	
	Если УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВXML(Данные) Тогда
		// Новый формат КИ
		Возврат УправлениеКонтактнойИнформациейКлиентСервер.СтруктураЗначенийПолей(
			ПредыдущийФорматКонтактнойИнформацииXML(Данные));
		
	ИначеЕсли ПустаяСтрока(Данные) И ВидКонтактнойИнформации <> Неопределено Тогда
		// Генерируем по виду
		Возврат УправлениеКонтактнойИнформациейКлиентСервер.СтруктураКонтактнойИнформацииПоТипу(
			ВидКонтактнойИнформации.Тип);
		
	КонецЕсли;
	
	// Возвращаем полную структуру для данного вида с заполненными полями.
	Возврат УправлениеКонтактнойИнформациейКлиентСервер.СтруктураЗначенийПолей(Данные, ВидКонтактнойИнформации);
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////// 
// Форматирование телефонных номеров.

// Процедура - Преобразовать номер телефона
//
// Параметры:
//  Представление		 - 	 - 
//  СписокПолей			 - 	 - 
//  Касса				 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//
Процедура ПреобразоватьНомерТелефона(Представление, СписокПолей, Касса = Неопределено, СтруктурнаяЕдиница = Неопределено, КомментарийВПредставлении = Истина) Экспорт
	
	СтруктураРезультата = ОбщегоНазначенияСтоматология.ВернутьНастройкиПараметровУчета();
	СтруктураРезультата.Вставить("ПравильныйНомер"			, Истина);
	СтруктураРезультата.Вставить("КомментарийВПредставлении", КомментарийВПредставлении);		
	
	Если ЗначениеЗаполнено(Касса) и СтруктураРезультата.Код = "643" Тогда // РФ.
		СтруктураРезультата.ФорматТелНомера = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Касса, "ФорматТелефонногоНомераДляОтправкиЭлектронныхЧековККМ");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураРезультата.СтранаУчета) Тогда		
		Если СтруктураРезультата.Код = "643" Тогда	// Для РОССИЙСКОЙ ФЕДЕРАЦИИ	
			ПреобразоватьДля_РФ(Представление, СписокПолей, СтруктураРезультата, ЗначениеЗаполнено(Касса));			
		ИначеЕсли СтруктураРезультата.Код = "804" Тогда // Для Украины
			ПреобразоватьДля_Украины(Представление, СписокПолей, СтруктураРезультата);
		ИначеЕсли СтруктураРезультата.Код = "112" Тогда // Для Беларуси
			ПреобразоватьДля_Беларуси(Представление, СписокПолей, СтруктураРезультата);
		ИначеЕсли СтруктураРезультата.Код = "051" Тогда // Для Армении
			ПреобразоватьДля_Армении(Представление, СписокПолей, СтруктураРезультата);
		ИначеЕсли СтруктураРезультата.Код = "031" Тогда // Для Азербайджана
			ПреобразоватьДля_Азербайджана(Представление, СписокПолей, СтруктураРезультата);
		ИначеЕсли СтруктураРезультата.Код = "398" Тогда // Для Казахстана
			ПреобразоватьДля_Казахстана(Представление, СписокПолей, СтруктураРезультата);
		ИначеЕсли СтруктураРезультата.Код = "784" Тогда // Для ОБЪЕДИНЕННЫЕ АРАБСКИЕ ЭМИРАТЫ
			ПреобразоватьДля_ОбъединенныеАрабскиеЭмираты(Представление, СписокПолей, СтруктураРезультата);
		ИначеЕсли СтруктураРезультата.Код = "616" Тогда // Для Польши
			ПреобразоватьДля_Польши(Представление, СписокПолей, СтруктураРезультата);
		Иначе 
			ЗаполнитьПоляВЗаписиПоПредставлениюТелефон(Представление, СписокПолей, СтруктураРезультата);
		КонецЕсли;
	Иначе 
		ЗаполнитьПоляВЗаписиПоПредставлениюТелефон(Представление, СписокПолей, СтруктураРезультата);		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Преобразовать для РОССИЙСКОЙ ФЕДЕРАЦИИ
//
// Параметры:
//  Представление		 - 	 - 
//  СписокПолей			 - 	 - 
//  СтруктураРезультата	 - 	 - 
//
Процедура ПреобразоватьДля_РФ(Представление, СписокПолей, СтруктураРезультата, ДляЧековККМ = Ложь)
	
	ТелефонПредставление = СокрЛП(Представление);	
	// СписокПолей   = "";
	КодСтраны     = "";
	КодГорода     = "";
	НомерТелефона = "";
	Добавочный    = "";
	Комментарий   = "";
	
	// Вычислим код страны
	// Если Лев(Представление, 1) = "7" Тогда
	//	КодСтраны = "+7";
	// ИначеЕсли Лев(Представление, 1) = "8" Тогда
	//	КодСтраны = "8";
	Если Не ДляЧековККМ Тогда
		
		Если СтруктураРезультата.ФорматТелНомера = 0 ИЛИ СтруктураРезультата.ФорматТелНомера = 4 Тогда 
			КодСтраны = "+7";
		ИначеЕсли СтруктураРезультата.ФорматТелНомера = 1 Тогда 
			КодСтраны = "8";
		КонецЕсли;	
		
		// Уберем код страны, если есть для правильного анализа
		Если Найти(ТелефонПредставление, "+7 (") <> 0 Тогда 
			ТелефонПредставление = Сред(ТелефонПредставление, 3);
		ИначеЕсли Найти(ТелефонПредставление, "8 (") <> 0 Тогда 	
			ТелефонПредставление = Сред(ТелефонПредставление, 2);		
		ИначеЕсли Лев(ТелефонПредставление, 1) = "0" Тогда
			ТелефонПредставление = Сред(ТелефонПредставление, 2);	
		КонецЕсли;
		
	Иначе
		
		Если СтруктураРезультата.ФорматТелНомера = 0 ИЛИ СтруктураРезультата.ФорматТелНомера = 4 Тогда 
			КодСтраны = "+7";
		ИначеЕсли СтруктураРезультата.ФорматТелНомера = 1 Тогда 
			КодСтраны = "8";
		ИначеЕсли СтруктураРезультата.ФорматТелНомера = 2 Тогда 
			КодСтраны = "7";
		ИначеЕсли СтруктураРезультата.ФорматТелНомера = 3 Тогда 
			КодСтраны = "";
		КонецЕсли;	
		
		// Уберем код страны, если есть для правильного анализа
		Если Найти(ТелефонПредставление, "+7 (") <> 0 Тогда 
			ТелефонПредставление = Сред(ТелефонПредставление, 3);
		ИначеЕсли Найти(ТелефонПредставление, "8 (") <> 0 или Найти(ТелефонПредставление, "7 (") <> 0 Тогда 	
			ТелефонПредставление = Сред(ТелефонПредставление, 2);
		ИначеЕсли Лев(ТелефонПредставление, 1) = "0" Тогда
			ТелефонПредставление = Сред(ТелефонПредставление, 2);	
		КонецЕсли;    
		
	КонецЕсли;   	
	
	// Оставим одни лишь цифры
	НомерТелефона_ТолькоЦифры = УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(ТелефонПредставление);
	
	Если СтрДлина(НомерТелефона_ТолькоЦифры) = 6 ИЛИ СтрДлина(НомерТелефона_ТолькоЦифры) = 7 Тогда 
		ПравильныйНомер = Истина;
	ИначеЕсли СтрДлина(НомерТелефона_ТолькоЦифры) = 10 Тогда
		ПравильныйНомер = Истина;
	ИначеЕсли СтрДлина(НомерТелефона_ТолькоЦифры) = 11 Тогда
		Если Лев(НомерТелефона_ТолькоЦифры, 1) = "7" ИЛИ Лев(НомерТелефона_ТолькоЦифры, 1) = "8" Тогда 
			НомерТелефона_ТолькоЦифры = Сред(НомерТелефона_ТолькоЦифры, 2, 10);
			ПравильныйНомер = Истина;
		Иначе 
			ПравильныйНомер = Ложь;
		КонецЕсли;
	Иначе 
		ПравильныйНомер = Ложь;
	КонецЕсли;
	
	Если ПравильныйНомер Тогда
		Если СтрДлина(НомерТелефона_ТолькоЦифры) = 6 ИЛИ СтрДлина(НомерТелефона_ТолькоЦифры) = 7 Тогда
			НомерТелефона = НомерТелефона_ТолькоЦифры;
		Иначе 			
			МассивКодов = ВернутьМассивТрехЗначныхКодовДляРФ();
			Если МассивКодов.Найти(Сред(НомерТелефона_ТолькоЦифры, 1, 3)) = Неопределено Тогда
				Если Лев(НомерТелефона_ТолькоЦифры, 1) = "9" Тогда // это мобильный
					КодГорода 		= Сред(НомерТелефона_ТолькоЦифры, 1, 3);
					НомерТелефона 	= Сред(НомерТелефона_ТолькоЦифры, 4, 7);
				Иначе 						                       // это 4-х значный код города
					КодГорода 		= Сред(НомерТелефона_ТолькоЦифры, 1, 4);
					НомерТелефона 	= Сред(НомерТелефона_ТолькоЦифры, 5, 6);
				КонецЕсли;
			Иначе                                                  // это 3-х значный код города
				КодГорода 		= Сред(НомерТелефона_ТолькоЦифры, 1, 3);
				НомерТелефона 	= Сред(НомерТелефона_ТолькоЦифры, 4, 7);
			КонецЕсли;
		КонецЕсли;
		// ----------------------Проверим комментарий--------------------------
		Поз = Найти(ТелефонПредставление, ", ");
		Если Поз <> 0 Тогда
			// вырежем комментарий
			Комментарий = СокрЛП(Сред(ТелефонПредставление, Поз + 2));
		КонецЕсли;	
		// ---------------------Поправим представление-------------------------
		Представление = СокрЛП(КодСтраны);				
		Представление = Представление + ?(ПустаяСтрока(Представление), "", " ") + "(" + СокрЛП(КодГорода) + ")";				
		Если Не ПустаяСтрока(НомерТелефона) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", " ") + ?(ПравильныйНомер = Ложь, СокрЛП(НомерТелефона), ПривестиНомерТелефонаКЧитаемомуВиду(НомерТелефона, СтруктураРезультата.ФорматТелНомера));
		КонецЕсли;				
		Если НЕ ПустаяСтрока(Добавочный) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", ", ") + "доб. " + СокрЛП(Добавочный);
		КонецЕсли;				
		Если СтруктураРезультата.Свойство("КомментарийВПредставлении") И НЕ СтруктураРезультата.КомментарийВПредставлении Тогда 
			// ---------------------------
		Иначе 	
			Если НЕ ПустаяСтрока(Комментарий) Тогда
				Представление = Представление + ?(ПустаяСтрока(Представление), "", ", ") + СокрЛП(Комментарий);
			КонецЕсли;
		КонецЕсли;
		// --------------------------------------------------------------------
				
		// ЗначенияРеквизитов = Новый Структура;
		// ЗначенияРеквизитов.Вставить("КодСтраны", ?(КодСтраны = "8", КодСтраны, ВернутьТелефонТолькоЦифрами(КодСтраны)));
		// ЗначенияРеквизитов.Вставить("КодГорода", КодГорода);
		// ЗначенияРеквизитов.Вставить("НомерТелефона", НомерТелефона);
		// ЗначенияРеквизитов.Вставить("Добавочный",Добавочный);
		// ЗначенияРеквизитов.Вставить("Комментарий",Комментарий);
		//
		//
		// СписокПолей = УправлениеКонтактнойИнформацией.СписокПолейПоЗначениюРеквизитов(ЗначенияРеквизитов);		
		
		СписокПолей.Добавить(?(КодСтраны = "8" или ДляЧековККМ, КодСтраны, УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(КодСтраны)), "КОДСТРАНЫ");
		СписокПолей.Добавить(КодГорода		, "КОДГОРОДА");
		СписокПолей.Добавить(НомерТелефона	, "НОМЕРТЕЛЕФОНА");
		СписокПолей.Добавить(Добавочный		, "ДОБАВОЧНЫЙ");
		СписокПолей.Добавить(Представление	, "ПРЕДСТАВЛЕНИЕ");		
		СписокПолей.Добавить(Комментарий	, "КОММЕНТАРИЙ");
		
	Иначе
		СтруктураРезультата.ПравильныйНомер = Ложь;	
		Если СтруктураРезультата.Свойство("ФорматТелНомера") Тогда
			СтруктураРезультата.ФорматТелНомера = КодСтраны;
		Иначе
			СтруктураРезультата.Вставить("ФорматТелНомера", КодСтраны);	
		КонецЕсли;
		ЗаполнитьПоляВЗаписиПоПредставлениюТелефон(Представление, СписокПолей, СтруктураРезультата);
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Преобразовать для украины
//
// Параметры:
//  Представление		 - 	 - 
//  СписокПолей			 - 	 - 
//  СтруктураРезультата	 - 	 - 
//
Процедура ПреобразоватьДля_Украины(Представление, СписокПолей, СтруктураРезультата)
	
	ТелефонПредставление = СокрЛП(Представление);	
	// СписокПолей = "";
	КодСтраны     = "";
	КодГорода     = "";
	НомерТелефона = "";
	Добавочный    = "";
	Комментарий   = "";
	
	// Вычислим код страны
	КодСтраны = "+38";
	
	// Уберем код страны, если есть для правильного анализа
	Если Найти(ТелефонПредставление, КодСтраны + "(") <> 0 Тогда 
		ТелефонПредставление = Сред(ТелефонПредставление, 4);
	КонецЕсли;
	
	// Оставим одни лишь цифры
	НомерТелефона_ТолькоЦифры = УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(ТелефонПредставление);
	
	Если СтрДлина(НомерТелефона_ТолькоЦифры) = 9 Тогда
		Если Лев(НомерТелефона_ТолькоЦифры, 1) <> "0" Тогда 
			НомерТелефона_ТолькоЦифры = "0" + НомерТелефона_ТолькоЦифры;
			ПравильныйНомер = Истина;
		Иначе 
			ПравильныйНомер = Ложь;
		КонецЕсли;	
	ИначеЕсли СтрДлина(НомерТелефона_ТолькоЦифры) = 10 Тогда
		Если Лев(НомерТелефона_ТолькоЦифры, 1) = "0" Тогда
			ПравильныйНомер = Истина;
		Иначе 
			ПравильныйНомер = Ложь;
		КонецЕсли;	
	ИначеЕсли СтрДлина(НомерТелефона_ТолькоЦифры) = 11 Тогда
		Если Сред(НомерТелефона_ТолькоЦифры, 2, 1) = "0" Тогда 
			НомерТелефона_ТолькоЦифры = Сред(НомерТелефона_ТолькоЦифры, 2, 10);
			ПравильныйНомер = Истина;
		Иначе 
			ПравильныйНомер = Ложь;
		КонецЕсли;
	ИначеЕсли СтрДлина(НомерТелефона_ТолькоЦифры) = 12 Тогда
		Если Сред(НомерТелефона_ТолькоЦифры, 1, 2) = "38" Тогда 
			НомерТелефона_ТолькоЦифры = Сред(НомерТелефона_ТолькоЦифры, 3, 10);
			ПравильныйНомер = Истина;
		Иначе 
			ПравильныйНомер = Ложь;
		КонецЕсли;	
	Иначе 
		ПравильныйНомер = Ложь;
	КонецЕсли;
	
	Если ПравильныйНомер Тогда 
		МассивКодов = ВернутьМассивМобильныхТрехЗначныхКодовДляУкраины();
		Если МассивКодов.Найти(Сред(НомерТелефона_ТолькоЦифры, 1, 3)) = Неопределено Тогда
			КодГорода 		= Сред(НомерТелефона_ТолькоЦифры, 1, 3);
			НомерТелефона 	= Сред(НомерТелефона_ТолькоЦифры, 4, 7);
		Иначе                                                  // это мобильный
			КодГорода 		= Сред(НомерТелефона_ТолькоЦифры, 1, 3);
			НомерТелефона 	= Сред(НомерТелефона_ТолькоЦифры, 4, 7);
		КонецЕсли;
		// ----------------------Проверим комментарий--------------------------
		Поз = Найти(ТелефонПредставление, ", ");
		Если Поз <> 0 Тогда
			// вырежем комментарий
			Комментарий = СокрЛП(Сред(ТелефонПредставление, Поз + 2));
		КонецЕсли;	
		// ------------------- Поправим представление ------------------------
		Представление = СокрЛП(КодСтраны);				
		Представление = Представление + ?(ПустаяСтрока(Представление), "", " ") + "(" + СокрЛП(КодГорода) + ")";				
		Если Не ПустаяСтрока(НомерТелефона) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", " ") + СокрЛП(НомерТелефона);
		КонецЕсли;				
		Если НЕ ПустаяСтрока(Добавочный) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", ", ") + "доб. " + СокрЛП(Добавочный);
		КонецЕсли;				
		Если НЕ ПустаяСтрока(Комментарий) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", ", ") + СокрЛП(Комментарий);
		КонецЕсли;
		// --------------------------------------------------------------------
				
		
		// ЗначенияРеквизитов = Новый Структура;
		// ЗначенияРеквизитов.Вставить("КодСтраны", ВернутьТелефонТолькоЦифрами(КодСтраны));
		// ЗначенияРеквизитов.Вставить("КодГорода", КодГорода);
		// ЗначенияРеквизитов.Вставить("НомерТелефона", НомерТелефона);
		// ЗначенияРеквизитов.Вставить("Добавочный",Добавочный);
		// ЗначенияРеквизитов.Вставить("Комментарий",Комментарий);
		//
		//
		// СписокПолей = УправлениеКонтактнойИнформацией.СписокПолейПоЗначениюРеквизитов(ЗначенияРеквизитов);		
		
		СписокПолей.Добавить(?(КодСтраны = "8", КодСтраны, УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(КодСтраны)), "КОДСТРАНЫ");
		СписокПолей.Добавить(КодГорода		, "КОДГОРОДА");
		СписокПолей.Добавить(НомерТелефона	, "НОМЕРТЕЛЕФОНА");
		СписокПолей.Добавить(Добавочный		, "ДОБАВОЧНЫЙ");
		СписокПолей.Добавить(Представление	, "ПРЕДСТАВЛЕНИЕ");		
		СписокПолей.Добавить(Комментарий	, "КОММЕНТАРИЙ");
		
	Иначе
		СтруктураРезультата.ПравильныйНомер = Ложь;		
		ЗаполнитьПоляВЗаписиПоПредставлениюТелефон(Представление, СписокПолей, СтруктураРезультата);
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Преобразовать для беларуси
//
// Параметры:
//  Представление		 - 	 - 
//  СписокПолей			 - 	 - 
//  СтруктураРезультата	 - 	 - 
//
Процедура ПреобразоватьДля_Беларуси(Представление, СписокПолей, СтруктураРезультата)
	
	ТелефонПредставление = СокрЛП(Представление);	
	// СписокПолей = "";
	КодСтраны     = "";
	КодГорода     = "";
	НомерТелефона = "";
	Добавочный    = "";
	Комментарий   = "";
	
	// Вычислим код страны
	КодСтраны = СтруктураРезультата.ФорматТелНомера;
	Если Не ЗначениеЗаполнено(КодСтраны) Тогда
		КодСтраны = "+375";
	КонецЕсли;
	
	// Уберем код страны, если есть для правильного анализа
	Если Найти(ТелефонПредставление, КодСтраны + "(") <> 0 Тогда 
		ТелефонПредставление = Сред(ТелефонПредставление, 5);
	КонецЕсли;
	
	// Оставим одни лишь цифры
	НомерТелефона_ТолькоЦифры = УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(ТелефонПредставление);
	
	Если СтрДлина(НомерТелефона_ТолькоЦифры) = 9 Тогда
		Если Лев(НомерТелефона_ТолькоЦифры, 1) <> "0" Тогда 
			ПравильныйНомер = Истина;
		Иначе 
			ПравильныйНомер = Ложь;
		КонецЕсли;	
	ИначеЕсли СтрДлина(НомерТелефона_ТолькоЦифры) = 10 Тогда
		Если Лев(НомерТелефона_ТолькоЦифры, 1) = "0" Тогда
			НомерТелефона_ТолькоЦифры = Сред(НомерТелефона_ТолькоЦифры, 2, 9);
			ПравильныйНомер = Истина;
		Иначе 
			ПравильныйНомер = Ложь;
		КонецЕсли;	
	ИначеЕсли СтрДлина(НомерТелефона_ТолькоЦифры) = 12 Тогда
		Если Сред(НомерТелефона_ТолькоЦифры, 1, 3) = "375" Тогда 
			НомерТелефона_ТолькоЦифры = Сред(НомерТелефона_ТолькоЦифры, 4, 10);
			ПравильныйНомер = Истина;
		Иначе 
			ПравильныйНомер = Ложь;
		КонецЕсли;	
	Иначе 
		ПравильныйНомер = Ложь;
	КонецЕсли;
	
	Если ПравильныйНомер Тогда 
		МассивКодов = ВернутьМассивМобильныхДвухЗначныхКодовДляБеларуси();
		Если МассивКодов.Найти(Сред(НомерТелефона_ТолькоЦифры, 1, 2)) = Неопределено Тогда
			КодГорода 		= Сред(НомерТелефона_ТолькоЦифры, 1, 2);
			НомерТелефона 	= Сред(НомерТелефона_ТолькоЦифры, 3, 7);
		Иначе                                                  // это мобильный
			КодГорода 		= Сред(НомерТелефона_ТолькоЦифры, 1, 2);
			НомерТелефона 	= Сред(НомерТелефона_ТолькоЦифры, 3, 7);
		КонецЕсли;
		// ----------------------Проверим комментарий--------------------------
		Поз = Найти(ТелефонПредставление, ", ");
		Если Поз <> 0 Тогда
			// вырежем комментарий
			Комментарий = СокрЛП(Сред(ТелефонПредставление, Поз + 2));
		КонецЕсли;	
		// ------------------- Поправим представление ------------------------
		Представление = СокрЛП(КодСтраны);				
		Представление = Представление + ?(ПустаяСтрока(Представление), "", " ") + "(" + СокрЛП(КодГорода) + ")";				
		Если Не ПустаяСтрока(НомерТелефона) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", " ") + СокрЛП(НомерТелефона);
		КонецЕсли;				
		Если НЕ ПустаяСтрока(Добавочный) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", ", ") + "доб. " + СокрЛП(Добавочный);
		КонецЕсли;				
		Если НЕ ПустаяСтрока(Комментарий) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", ", ") + СокрЛП(Комментарий);
		КонецЕсли;
		// --------------------------------------------------------------------
					
		СписокПолей.Добавить(?(КодСтраны = "+375", КодСтраны, УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(КодСтраны)), "КОДСТРАНЫ");
		СписокПолей.Добавить(КодГорода		, "КОДГОРОДА");
		СписокПолей.Добавить(НомерТелефона	, "НОМЕРТЕЛЕФОНА");
		СписокПолей.Добавить(Добавочный		, "ДОБАВОЧНЫЙ");
		СписокПолей.Добавить(Представление	, "ПРЕДСТАВЛЕНИЕ");		
		СписокПолей.Добавить(Комментарий	, "КОММЕНТАРИЙ");
		
	Иначе
		СтруктураРезультата.ПравильныйНомер = Ложь;		
		ЗаполнитьПоляВЗаписиПоПредставлениюТелефон(Представление, СписокПолей, СтруктураРезультата);
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Преобразовать для армении
//
// Параметры:
//  Представление		 - 	 - 
//  СписокПолей			 - 	 - 
//  СтруктураРезультата	 - 	 - 
//
Процедура ПреобразоватьДля_Армении(Представление, СписокПолей, СтруктураРезультата)
	
	ТелефонПредставление = СокрЛП(Представление);	
	// СписокПолей = "";
	КодСтраны     = "";
	КодГорода     = "";
	НомерТелефона = "";
	Добавочный    = "";
	Комментарий   = "";
	
	// Вычислим код страны
	КодСтраны = СтруктураРезультата.ФорматТелНомера;
	Если Не ЗначениеЗаполнено(КодСтраны) Тогда
		КодСтраны = "+374";
	КонецЕсли;
	
	// Уберем код страны, если есть для правильного анализа
	Если Найти(ТелефонПредставление, КодСтраны + "(") <> 0 Тогда 
		ТелефонПредставление = Сред(ТелефонПредставление, 5);
	КонецЕсли;
	
	// Оставим одни лишь цифры
	НомерТелефона_ТолькоЦифры = УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(ТелефонПредставление);
	
	Если СтрДлина(НомерТелефона_ТолькоЦифры) = 8 Тогда
		Если Лев(НомерТелефона_ТолькоЦифры, 1) <> "0" Тогда 
			ПравильныйНомер = Истина;
		Иначе 
			ПравильныйНомер = Ложь;
		КонецЕсли;	
	ИначеЕсли СтрДлина(НомерТелефона_ТолькоЦифры) = 9 Тогда
		Если Лев(НомерТелефона_ТолькоЦифры, 1) = "0" Тогда
			НомерТелефона_ТолькоЦифры = Сред(НомерТелефона_ТолькоЦифры, 2, 8);
			ПравильныйНомер = Истина;
		Иначе 
			ПравильныйНомер = Ложь;
		КонецЕсли;	
	ИначеЕсли СтрДлина(НомерТелефона_ТолькоЦифры) = 11 Тогда
		Если Сред(НомерТелефона_ТолькоЦифры, 1, 3) = "374" Тогда 
			НомерТелефона_ТолькоЦифры = Сред(НомерТелефона_ТолькоЦифры, 4, 8);
			ПравильныйНомер = Истина;
		Иначе 
			ПравильныйНомер = Ложь;
		КонецЕсли;	
	Иначе 
		ПравильныйНомер = Ложь;
	КонецЕсли;
	
	Если ПравильныйНомер Тогда 
		МассивКодов = ВернутьМассивМобильныхДвухЗначныхКодовДляАрмении();
		Если МассивКодов.Найти(Сред(НомерТелефона_ТолькоЦифры, 1, 2)) = Неопределено Тогда
			КодГорода 		= Сред(НомерТелефона_ТолькоЦифры, 1, 2);
			НомерТелефона 	= Сред(НомерТелефона_ТолькоЦифры, 3, 7);
		Иначе                                                  // это мобильный
			КодГорода 		= Сред(НомерТелефона_ТолькоЦифры, 1, 2);
			НомерТелефона 	= Сред(НомерТелефона_ТолькоЦифры, 3, 7);
		КонецЕсли;
		// ----------------------Проверим комментарий--------------------------
		Поз = Найти(ТелефонПредставление, ", ");
		Если Поз <> 0 Тогда
			// вырежем комментарий
			Комментарий = СокрЛП(Сред(ТелефонПредставление, Поз + 2));
		КонецЕсли;	
		// ------------------- Поправим представление ------------------------
		Представление = СокрЛП(КодСтраны);				
		Представление = Представление + ?(ПустаяСтрока(Представление), "", " ") + "(" + СокрЛП(КодГорода) + ")";				
		Если Не ПустаяСтрока(НомерТелефона) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", " ") + СокрЛП(НомерТелефона);
		КонецЕсли;				
		Если НЕ ПустаяСтрока(Добавочный) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", ", ") + "доб. " + СокрЛП(Добавочный);
		КонецЕсли;				
		Если НЕ ПустаяСтрока(Комментарий) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", ", ") + СокрЛП(Комментарий);
		КонецЕсли;
		// --------------------------------------------------------------------
					
		СписокПолей.Добавить(?(КодСтраны = "+374", КодСтраны, УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(КодСтраны)), "КОДСТРАНЫ");
		СписокПолей.Добавить(КодГорода		, "КОДГОРОДА");
		СписокПолей.Добавить(НомерТелефона	, "НОМЕРТЕЛЕФОНА");
		СписокПолей.Добавить(Добавочный		, "ДОБАВОЧНЫЙ");
		СписокПолей.Добавить(Представление	, "ПРЕДСТАВЛЕНИЕ");		
		СписокПолей.Добавить(Комментарий	, "КОММЕНТАРИЙ");
		
	Иначе
		СтруктураРезультата.ПравильныйНомер = Ложь;		
		ЗаполнитьПоляВЗаписиПоПредставлениюТелефон(Представление, СписокПолей, СтруктураРезультата);
	КонецЕсли;		
	
КонецПроцедуры

// Процедура - Преобразовать для азербайджан
//
// Параметры:
//  Представление		 - 	 - 
//  СписокПолей			 - 	 - 
//  СтруктураРезультата	 - 	 - 
//
Процедура ПреобразоватьДля_Азербайджана(Представление, СписокПолей, СтруктураРезультата)
	
	ТелефонПредставление = СокрЛП(Представление);	
	// СписокПолей = "";
	КодСтраны     = "";
	КодГорода     = "";
	НомерТелефона = "";
	Добавочный    = "";
	Комментарий   = "";
	
	// Вычислим код страны
	КодСтраны = СтруктураРезультата.ФорматТелНомера;
	Если Не ЗначениеЗаполнено(КодСтраны) Тогда
		КодСтраны = "+994";
	КонецЕсли;
	
	// ----------------------Проверим комментарий--------------------------
	Поз = Найти(ТелефонПредставление, ", ");
	Если Поз <> 0 Тогда
		// Вырежем комментарий
		Комментарий 			= СокрЛП(Сред(ТелефонПредставление, Поз + 2));
		ТелефонПредставление 	= СтрЗаменить(ТелефонПредставление, Комментарий, "");
	КонецЕсли;	
	
	// Оставим одни лишь цифры
	НомерТелефона_ТолькоЦифры = УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(ТелефонПредставление);
	// Отсекаем лидирующие нули
	НомерТелефона_ТолькоЦифры = СтрЗаменить(СокрЛ(СтрЗаменить(НомерТелефона_ТолькоЦифры, "0", " ")), " ", "0");
	
	ПравильныйНомер = Ложь;	
	// Уберем код страны, если есть для правильного анализа
	НомерТелефонаБезКодаСтраны = НомерТелефона_ТолькоЦифры;
	Если СтрДлина(НомерТелефона_ТолькоЦифры) > 8 Тогда 
		Если СтрНайти(Лев(НомерТелефона_ТолькоЦифры, 3), "994") <> 0 Тогда 
			НомерТелефонаБезКодаСтраны = Сред(НомерТелефона_ТолькоЦифры, СтрНайти(Лев(НомерТелефона_ТолькоЦифры, 3), "994") + 3, 8);
			ПравильныйНомер = Истина;			
		КонецЕсли;
	КонецЕсли;
	
	Если СтрДлина(НомерТелефонаБезКодаСтраны) = 8 Тогда
		МассивКодовОператоров = ВернутьМассивМобильныхДвухЗначныхКодовДляАзербайджана();
		Если МассивКодовОператоров.Найти(Сред(НомерТелефонаБезКодаСтраны, 1, 2)) <> Неопределено Тогда
			КодГорода 		= Сред(НомерТелефонаБезКодаСтраны, 1, 2);
			НомерТелефона 	= Сред(НомерТелефонаБезКодаСтраны, 3, 6);
		ИначеЕсли Лев(НомерТелефонаБезКодаСтраны, 4) = "1864" Тогда // Это Сумгаит! 
			КодГорода 		= Сред(НомерТелефонаБезКодаСтраны, 1, 4);
			НомерТелефона 	= Сред(НомерТелефонаБезКодаСтраны, 5, 4);
		Иначе 
			КодГорода 		= Сред(НомерТелефонаБезКодаСтраны, 1, 3);
			НомерТелефона 	= Сред(НомерТелефонаБезКодаСтраны, 4, 5);
		КонецЕсли;
		ПравильныйНомер = Истина;
	Иначе 
		ПравильныйНомер = Ложь;	
	КонецЕсли;
	
	Если ПравильныйНомер Тогда 
		// ------------------- Поправим представление ------------------------
		Представление = СокрЛП(КодСтраны);				
		Представление = Представление + ?(ПустаяСтрока(Представление), "", " ") + "(" + СокрЛП(КодГорода) + ")";				
		Если Не ПустаяСтрока(НомерТелефона) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", " ") + СокрЛП(НомерТелефона);
		КонецЕсли;				
		Если НЕ ПустаяСтрока(Добавочный) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", ", ") + "доб. " + СокрЛП(Добавочный);
		КонецЕсли;				
		Если НЕ ПустаяСтрока(Комментарий) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", ", ") + СокрЛП(Комментарий);
		КонецЕсли;
		// --------------------------------------------------------------------
					
		СписокПолей.Добавить(?(КодСтраны = "994", КодСтраны, УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(КодСтраны)), "КОДСТРАНЫ");
		СписокПолей.Добавить(КодГорода		, "КОДГОРОДА");
		СписокПолей.Добавить(НомерТелефона	, "НОМЕРТЕЛЕФОНА");
		СписокПолей.Добавить(Добавочный		, "ДОБАВОЧНЫЙ");
		СписокПолей.Добавить(Представление	, "ПРЕДСТАВЛЕНИЕ");		
		СписокПолей.Добавить(Комментарий	, "КОММЕНТАРИЙ");
		
	Иначе
		СтруктураРезультата.ПравильныйНомер = Ложь;		
		ЗаполнитьПоляВЗаписиПоПредставлениюТелефон(Представление, СписокПолей, СтруктураРезультата);
	КонецЕсли;		
	
КонецПроцедуры

// Процедура - Преобразовать для казахстана
//
// Параметры:
//  Представление		 - 	 - 
//  СписокПолей			 - 	 - 
//  СтруктураРезультата	 - 	 - 
//
Процедура ПреобразоватьДля_Казахстана(Представление, СписокПолей, СтруктураРезультата)
	
	ТелефонПредставление = СокрЛП(Представление);	
	// СписокПолей = "";
	КодСтраны     = "";
	КодГорода     = "";
	НомерТелефона = "";
	Добавочный    = "";
	Комментарий   = "";
	
	// Вычислим код страны
	КодСтраны = "+7";
	
	// Уберем код страны, если есть для правильного анализа
	Если Найти(ТелефонПредставление, КодСтраны + "(") <> 0 Тогда 
		ТелефонПредставление = Сред(ТелефонПредставление, 3);
	КонецЕсли;
	
	// Оставим одни лишь цифры
	НомерТелефона_ТолькоЦифры = УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(ТелефонПредставление);
	
	Если СтрДлина(НомерТелефона_ТолькоЦифры) = 10 Тогда
		Если Лев(НомерТелефона_ТолькоЦифры, 1) <> "0" Тогда 
			ПравильныйНомер = Истина;
		Иначе 
			ПравильныйНомер = Ложь;
		КонецЕсли;		
	ИначеЕсли СтрДлина(НомерТелефона_ТолькоЦифры) = 11 Тогда
		Если Сред(НомерТелефона_ТолькоЦифры, 2, 1) = "0"
			ИЛИ Сред(НомерТелефона_ТолькоЦифры, 1, 1) = "7" Тогда 
			НомерТелефона_ТолькоЦифры = Сред(НомерТелефона_ТолькоЦифры, 2, 10);
			ПравильныйНомер = Истина;
		Иначе 
			ПравильныйНомер = Ложь;
		КонецЕсли;	
	Иначе 
		ПравильныйНомер = Ложь;
	КонецЕсли;
	
	Если ПравильныйНомер Тогда 
		МассивКодов = ВернутьМассивМобильныхТрехЗначныхКодовДляКазахстана();
		Если МассивКодов.Найти(Сред(НомерТелефона_ТолькоЦифры, 1, 3)) = Неопределено Тогда
			КодГорода 		= Сред(НомерТелефона_ТолькоЦифры, 1, 3);
			НомерТелефона 	= Сред(НомерТелефона_ТолькоЦифры, 4, 7);
		Иначе                                                  // это мобильный
			КодГорода 		= Сред(НомерТелефона_ТолькоЦифры, 1, 3);
			НомерТелефона 	= Сред(НомерТелефона_ТолькоЦифры, 4, 7);
		КонецЕсли;
		// ----------------------Проверим комментарий--------------------------
		Поз = Найти(ТелефонПредставление, ", ");
		Если Поз <> 0 Тогда
			// вырежем комментарий
			Комментарий = СокрЛП(Сред(ТелефонПредставление, Поз + 2));
		КонецЕсли;	
		// ------------------- Поправим представление ------------------------
		Представление = СокрЛП(КодСтраны);				
		Представление = Представление + ?(ПустаяСтрока(Представление), "", " ") + "(" + СокрЛП(КодГорода) + ")";				
		Если Не ПустаяСтрока(НомерТелефона) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", " ") + СокрЛП(НомерТелефона);
		КонецЕсли;				
		Если НЕ ПустаяСтрока(Добавочный) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", ", ") + "доб. " + СокрЛП(Добавочный);
		КонецЕсли;				
		Если НЕ ПустаяСтрока(Комментарий) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", ", ") + СокрЛП(Комментарий);
		КонецЕсли;
		// --------------------------------------------------------------------
				
		
		СписокПолей.Добавить(?(КодСтраны = "+7", КодСтраны, УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(КодСтраны)), "КОДСТРАНЫ");
		СписокПолей.Добавить(КодГорода		, "КОДГОРОДА");
		СписокПолей.Добавить(НомерТелефона	, "НОМЕРТЕЛЕФОНА");
		СписокПолей.Добавить(Добавочный		, "ДОБАВОЧНЫЙ");
		СписокПолей.Добавить(Представление	, "ПРЕДСТАВЛЕНИЕ");		
		СписокПолей.Добавить(Комментарий	, "КОММЕНТАРИЙ");
		
	Иначе
		СтруктураРезультата.ПравильныйНомер = Ложь;		
		ЗаполнитьПоляВЗаписиПоПредставлениюТелефон(Представление, СписокПолей, СтруктураРезультата);
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Преобразовать для объединенные арабские эмираты
//
// Параметры:
//  Представление		 - 	 - 
//  СписокПолей			 - 	 - 
//  СтруктураРезультата	 - 	 - 
//
Процедура ПреобразоватьДля_ОбъединенныеАрабскиеЭмираты(Представление, СписокПолей, СтруктураРезультата)
	
	ТелефонПредставление = СокрЛП(Представление);	
	// СписокПолей = "";
	КодСтраны     = "";
	КодГорода     = "";
	НомерТелефона = "";
	Добавочный    = "";
	Комментарий   = "";
	
	// Вычислим код страны
	ВнутреннийФормат = СтруктураРезультата.ФорматТелНомера = 0;
	Если Не ЗначениеЗаполнено(КодСтраны) Тогда
		КодСтраны = "+971";
	КонецЕсли;
	
	// ----------------------Проверим комментарий--------------------------
	Поз = Найти(ТелефонПредставление, ", ");
	Если Поз <> 0 Тогда
		// Вырежем комментарий
		Комментарий 			= СокрЛП(Сред(ТелефонПредставление, Поз + 2));
		ТелефонПредставление 	= СтрЗаменить(ТелефонПредставление, Комментарий, "");
	КонецЕсли;	
	
	// Оставим одни лишь цифры
	НомерТелефона_ТолькоЦифры = УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(ТелефонПредставление);
	// Отсекаем лидирующие нули
	НомерТелефона_ТолькоЦифры = СтрЗаменить(СокрЛ(СтрЗаменить(НомерТелефона_ТолькоЦифры, "0", " ")), " ", "0");
	
	ПравильныйНомер = Ложь;	
	// Уберем код страны, если есть для правильного анализа
	НомерТелефонаБезКодаСтраны = НомерТелефона_ТолькоЦифры;
	Если СтрДлина(НомерТелефона_ТолькоЦифры) > 9 Тогда 
		Если СтрНайти(Лев(НомерТелефона_ТолькоЦифры, 3), "971") <> 0 Тогда 
			НомерТелефонаБезКодаСтраны = Сред(НомерТелефона_ТолькоЦифры, СтрНайти(Лев(НомерТелефона_ТолькоЦифры, 3), "971") + 3);
			// Отсекаем лидирующие нули
			НомерТелефонаБезКодаСтраны = СтрЗаменить(СокрЛ(СтрЗаменить(НомерТелефонаБезКодаСтраны, "0", " ")), " ", "0");			
			ПравильныйНомер = Истина;			
		КонецЕсли;
	КонецЕсли;
	
	Если СтрДлина(НомерТелефонаБезКодаСтраны) = 9 Тогда
		МассивКодовОператоров = ВернутьМассивМобильныхКодовДляОАЭ();
		Если МассивКодовОператоров.Найти(Сред(НомерТелефонаБезКодаСтраны, 1, 2)) <> Неопределено Тогда
			КодГорода 		= ?(ВнутреннийФормат, "0", "") + Сред(НомерТелефонаБезКодаСтраны, 1, 2);
			НомерТелефона 	= Сред(НомерТелефонаБезКодаСтраны, 3, 7);
			ПравильныйНомер = Истина;			
		Иначе 
			ПравильныйНомер = Ложь;	
		КонецЕсли;
	ИначеЕсли СтрДлина(НомерТелефонаБезКодаСтраны) = 8 Тогда
		КодГорода 		= ?(ВнутреннийФормат, "0", "") + Сред(НомерТелефонаБезКодаСтраны, 1, 1);
		НомерТелефона 	= Сред(НомерТелефонаБезКодаСтраны, 2, 7);
		ПравильныйНомер = Истина;		
	Иначе 
		ПравильныйНомер = Ложь;	
	КонецЕсли;
	
	Если ПравильныйНомер Тогда 
		// ------------------- Поправим представление ------------------------
		Представление = СокрЛП(КодСтраны);				
		Представление = Представление + ?(ПустаяСтрока(Представление), "", " ") + "(" + СокрЛП(КодГорода) + ")";				
		Если Не ПустаяСтрока(НомерТелефона) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", " ") + Лев(СокрЛП(НомерТелефона), 3) + " " + Сред(СокрЛП(НомерТелефона), 4);
		КонецЕсли;				
		Если НЕ ПустаяСтрока(Добавочный) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", ", ") + "доб. " + СокрЛП(Добавочный);
		КонецЕсли;				
		Если НЕ ПустаяСтрока(Комментарий) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", ", ") + СокрЛП(Комментарий);
		КонецЕсли;
		// --------------------------------------------------------------------
					
		СписокПолей.Добавить(?(КодСтраны = "971", КодСтраны, УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(КодСтраны)), "КОДСТРАНЫ");
		СписокПолей.Добавить(КодГорода		, "КОДГОРОДА");
		СписокПолей.Добавить(НомерТелефона	, "НОМЕРТЕЛЕФОНА");
		СписокПолей.Добавить(Добавочный		, "ДОБАВОЧНЫЙ");
		СписокПолей.Добавить(Представление	, "ПРЕДСТАВЛЕНИЕ");		
		СписокПолей.Добавить(Комментарий	, "КОММЕНТАРИЙ");
		
	Иначе
		СтруктураРезультата.ПравильныйНомер = Ложь;		
		ЗаполнитьПоляВЗаписиПоПредставлениюТелефон(Представление, СписокПолей, СтруктураРезультата);
	КонецЕсли;		
	
КонецПроцедуры

//
//
Процедура ПреобразоватьДля_Польши(Представление, СписокПолей, СтруктураРезультата)
	
	ТелефонПредставление = СокрЛП(Представление);	
	// СписокПолей = "";
	КодСтраны     = "";
	КодГорода     = "";
	НомерТелефона = "";
	Добавочный    = "";
	Комментарий   = "";
	
	// Вычислим код страны
	КодСтраны = "+48";
	
	// Уберем код страны, если есть для правильного анализа
	Если Найти(ТелефонПредставление, КодСтраны + "(") <> 0 Тогда 
		ТелефонПредставление = Сред(ТелефонПредставление, 4);
	КонецЕсли;
	
	// Оставим одни лишь цифры
	НомерТелефона_ТолькоЦифры = УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(ТелефонПредставление);
	
	Если СтрДлина(НомерТелефона_ТолькоЦифры) = 9 Тогда
		Если Лев(НомерТелефона_ТолькоЦифры, 1) <> "0" Тогда 
			НомерТелефона_ТолькоЦифры = НомерТелефона_ТолькоЦифры;
			ПравильныйНомер = Истина;
		Иначе 
			ПравильныйНомер = Ложь;
		КонецЕсли;		
	ИначеЕсли СтрДлина(НомерТелефона_ТолькоЦифры) = 11 Тогда
		Если Сред(НомерТелефона_ТолькоЦифры, 1, 2) = "48" Тогда 
			НомерТелефона_ТолькоЦифры = Сред(НомерТелефона_ТолькоЦифры, 3, 9);
			ПравильныйНомер = Истина;
		Иначе 
			ПравильныйНомер = Ложь;
		КонецЕсли;
	ИначеЕсли СтрДлина(НомерТелефона_ТолькоЦифры) = 12 Тогда
		Если Сред(НомерТелефона_ТолькоЦифры, 1, 1) = "0" Тогда
			НомерТелефона_ТолькоЦифры = Сред(НомерТелефона_ТолькоЦифры, 4, 9);
			ПравильныйНомер = Истина;
		Иначе
			ПравильныйНомер = Ложь;
		КонецЕсли;
	Иначе 
		ПравильныйНомер = Ложь;
	КонецЕсли;
	
	Если ПравильныйНомер Тогда 
		МассивКодов = ВернутьМассивМобильныхКодовДляПольши();
		Если МассивКодов.Найти(Сред(НомерТелефона_ТолькоЦифры, 1, 3)) = Неопределено Тогда
			КодГорода 		= Сред(НомерТелефона_ТолькоЦифры, 1, 4);
			НомерТелефона 	= Сред(НомерТелефона_ТолькоЦифры, 5, 5);
		Иначе // это мобильный
			КодГорода 		= Сред(НомерТелефона_ТолькоЦифры, 1, 4);
			НомерТелефона 	= Сред(НомерТелефона_ТолькоЦифры, 5, 5);
		КонецЕсли;
		// ----------------------Проверим комментарий--------------------------
		Поз = Найти(ТелефонПредставление, ", ");
		Если Поз <> 0 Тогда
			// вырежем комментарий
			Комментарий = СокрЛП(Сред(ТелефонПредставление, Поз + 2));
		КонецЕсли;	
		// ------------------- Поправим представление ------------------------
		Представление = СокрЛП(КодСтраны);				
		Представление = Представление + ?(ПустаяСтрока(Представление), "", " ") + "(" + СокрЛП(КодГорода) + ")";				
		Если Не ПустаяСтрока(НомерТелефона) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", " ") + СокрЛП(НомерТелефона);
		КонецЕсли;				
		Если НЕ ПустаяСтрока(Добавочный) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", ", ") + "доб. " + СокрЛП(Добавочный);
		КонецЕсли;				
		Если НЕ ПустаяСтрока(Комментарий) Тогда
			Представление = Представление + ?(ПустаяСтрока(Представление), "", ", ") + СокрЛП(Комментарий);
		КонецЕсли;
		// --------------------------------------------------------------------
				
		СписокПолей.Добавить(?(КодСтраны = "48", КодСтраны, УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(КодСтраны)), "КОДСТРАНЫ");
		СписокПолей.Добавить(КодГорода		, "КОДГОРОДА");
		СписокПолей.Добавить(НомерТелефона	, "НОМЕРТЕЛЕФОНА");
		СписокПолей.Добавить(Добавочный		, "ДОБАВОЧНЫЙ");
		СписокПолей.Добавить(Представление	, "ПРЕДСТАВЛЕНИЕ");		
		СписокПолей.Добавить(Комментарий	, "КОММЕНТАРИЙ");
		
	Иначе
		СтруктураРезультата.ПравильныйНомер = Ложь;
		ЗаполнитьПоляВЗаписиПоПредставлениюТелефон(Представление, СписокПолей, СтруктураРезультата);
	КонецЕсли;
	
КонецПроцедуры

// Функция - Привести номер телефона к читаемому виду.
// 
// Параметры:
//  НомерТелефона	 - 	 - 
//  ФорматТелНомера	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПривестиНомерТелефонаКЧитаемомуВиду(НомерТелефона, ФорматТелНомера)
	
	НомерТелефона = СокрЛП(НомерТелефона);
	Если ФорматТелНомера = 1 ИЛИ ФорматТелНомера = 3 ИЛИ ФорматТелНомера = 4 Тогда 
		ПерваяЧастьНомера = Лев(НомерТелефона, ?(СтрДлина(НомерТелефона) = 7, 3, 2));
		ВтораяЧастьНомера = Сред(НомерТелефона, ?(СтрДлина(НомерТелефона) = 7, 4, 3), 2);	
		ТретьяЧастьНомера = Прав(НомерТелефона, 2);
		
		Возврат ПерваяЧастьНомера + "-" + ВтораяЧастьНомера + "-" + ТретьяЧастьНомера; 
	Иначе 
		Возврат НомерТелефона;		
	КонецЕсли;
	
КонецФункции

// По полю Представление заполнить остальные поля в записи для телефона
// 
Процедура ЗаполнитьПоляВЗаписиПоПредставлениюТелефон(Представление, СписокПолей, СтруктураРезультата)
	
	текСтр = СокрЛП(Представление);
	КодГорода     = "";
	НомерТелефона = "";
	Добавочный    = "";
	Комментарий   = "";
	КодСтраны = СтруктураРезультата.ФорматТелНомера;
			
	// вырежем добавочный номер с комментарием
	ПозДоб = Найти(ВРЕГ(текСтр), "ДОБ.");
	Если ПозДоб <> 0 Тогда
		ДобавочныйСКомментарием = СокрЛП(Сред(текСтр, ПозДоб+4));
		
		текСтр = СокрЛП(Лев(текСтр, ПозДоб-1));
		
		Если Прав(текСтр, 1) = "," Тогда
			текСтр = Лев(текСтр, СтрДлина(текСтр)-1);
		КонецЕсли;
		
		ПозДоб = Найти(ВРЕГ(ДобавочныйСКомментарием), ", ");
		
		Если ПозДоб <> 0 Тогда
			Добавочный = СокрЛП(Лев(ДобавочныйСКомментарием, ПозДоб-1));
			Комментарий = СокрЛП(Сред(ДобавочныйСКомментарием, ПозДоб+2));
		Иначе
			Добавочный = ДобавочныйСКомментарием;
		КонецЕсли;
		
	КонецЕсли;
	
	// вырежем код города
	Поз = Найти(текСтр, "(");
	Если Поз <> 0 Тогда
		
		Если Не ЗначениеЗаполнено(КодСтраны) Тогда
			КодСтраны = СокрЛП(Лев(текСтр, Поз-1));
		КонецЕсли;
		текСтр = СокрЛП(Сред(текСтр, Поз+1));
		Поз = Найти(текСтр, ")");
		
		Если Поз <> 0 Тогда
			КодГорода = СокрЛП(Лев(текСтр, Поз-1));
			текСтр = СокрЛП(Сред(текСтр, Поз+1));
		КонецЕсли;
	КонецЕсли;
	
	Поз = Найти(текСтр, ", ");
	// Если добавочного номера нет - ориентируемся по номеру телефона и комментарию
	Если ПозДоб = 0 И Поз <> 0 Тогда
		// вырежем комментарий
		НомерТелефона = СокрЛП(Лев(текСтр, Поз-1));
		Комментарий = СокрЛП(Сред(текСтр, Поз+2));
	Иначе
		// все оставшееся это номер
		НомерТелефона = текСтр;
	КонецЕсли;	
	
	// Оставим одни лишь цифры
	НомерТелефона = УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ВернутьТелефонТолькоЦифрами(НомерТелефона);
	
	// Беларусь, временная мера.
	Если СтруктураРезультата.Код = "112" Тогда
		Если Лев(НомерТелефона, 3) = "375" Тогда
			НомерТелефона = Сред(НомерТелефона, 4);
		КонецЕсли;		
	КонецЕсли;
	
	// Поправим представление
	ПредставлениеКИ = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(КодСтраны, КодГорода, НомерТелефона, Добавочный, Комментарий);
		
	СписокПолей.Добавить(?(КодСтраны = "8", КодСтраны, УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ВернутьТелефонТолькоЦифрами(КодСтраны)), "КОДСТРАНЫ");
	СписокПолей.Добавить(КодГорода		, "КОДГОРОДА");
	СписокПолей.Добавить(НомерТелефона	, "НОМЕРТЕЛЕФОНА");
	СписокПолей.Добавить(Добавочный		, "ДОБАВОЧНЫЙ");
	СписокПолей.Добавить(ПредставлениеКИ, "ПРЕДСТАВЛЕНИЕ");		
	СписокПолей.Добавить(Комментарий	, "КОММЕНТАРИЙ");
	
	СписокПолей.Добавить(СтруктураРезультата.ПравильныйНомер, "ПРАВИЛЬНЫЙНОМЕР");
			
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////// 
// Обновление информационной базы.

// Получить значения определенного типа контактной информации у объекта.
// 
// Параметры
//    Ссылка- ЛюбаяСсылка - ссылка на объект-владелец контактной информации (организация, контрагент, партнер и т.д.)
//    ТипКонтактнойИнформации - ПеречислениеСсылка.ТипыКонтактнойИнформации.
// 
// Возвращаемое значение:
//    ТаблицаЗначений - колонки 
//        * Значение - строка - строковое представление значения
//        * Вид      - строка - представление вида контактной информации.
// 
Функция ЗначенияКонтактнойИнформацииОбъекта(Ссылка, ТипКонтактнойИнформации) Экспорт
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Ссылка);
	
	КонтактнаяИнформацияОбъекта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивОбъектов, ТипКонтактнойИнформации);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("КонтактнаяИнформацияОбъекта", КонтактнаяИнформацияОбъекта);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформацияОбъекта.Представление,
	|	КонтактнаяИнформацияОбъекта.Вид
	|ПОМЕСТИТЬ ВТКонтактнаяИнформацияОбъекта
	|ИЗ
	|	&КонтактнаяИнформацияОбъекта КАК КонтактнаяИнформацияОбъекта
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 
	|ВЫБРАТЬ
	|	КонтактнаяИнформацияОбъекта.Представление КАК Значение,
	|	ПРЕДСТАВЛЕНИЕ(КонтактнаяИнформацияОбъекта.Вид) КАК Вид
	|ИЗ
	|	ВТКонтактнаяИнформацияОбъекта КАК КонтактнаяИнформацияОбъекта";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Добавляет (удаляет) поле ввода или комментарий на форму, обновляя данные.
// Вызывается из модуля формы объекта-владельца КИ при внедрении подсистемы.
// 
// Параметры:
//    Форма     - УправляемаяФорма - Форма объекта-владельца, предназначенная для вывода контактной информации.
//    Объект    - Произвольный - Объект-владелец контактной информации.
//    Результат - Произвольный - Необязательный служебный реквизит, полученный из предыдущего обработчика события.
// 
// Возвращаемое значение:
//    Неопределено
// 
Функция ОбновитьКонтактнуюИнформацию(Форма, Объект, Результат = Неопределено) Экспорт

	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Результат.Свойство("ЭтоДобавлениеКомментария") Тогда
		ИзменитьКомментарий(Форма, Результат.ИмяРеквизита, Результат.ЭтоДобавлениеКомментария, Результат.ИмяЭлементаДляРазмещения);
	ИначеЕсли Результат.Свойство("ДобавляемыйВид") Тогда
		ДобавитьСтрокуКонтактнойИнформации(Форма, Результат, Результат.ИмяЭлементаДляРазмещения);
	ИначеЕсли Результат.Свойство("ПоменятьМестамиЭлементы") Тогда
		ЗначениеПервогоЭлемента = Форма[Результат.ПервыйЭлемент];
		Форма[Результат.ПервыйЭлемент] = Форма[Результат.ВторойЭлемент];
		Форма[Результат.ВторойЭлемент] = ЗначениеПервогоЭлемента ;
		
		// перемещение комментариев если они есть
		Отбор = Новый Структура("ИмяРеквизита", Результат.ПервыйЭлемент);
		ОписаниеКонтактнойИнформации = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов;
		НайденнаяСтрокаПервыйЭлемент = ОписаниеКонтактнойИнформации.НайтиСтроки(Отбор)[0];
		Отбор = Новый Структура("ИмяРеквизита", Результат.ВторойЭлемент);
		НайденнаяСтрокаВторойЭлемент = ОписаниеКонтактнойИнформации.НайтиСтроки(Отбор)[0];
		Если ЗначениеЗаполнено(НайденнаяСтрокаПервыйЭлемент.Комментарий)
			И ЗначениеЗаполнено(НайденнаяСтрокаВторойЭлемент.Комментарий) Тогда
				КомментарийПервыйЭлемент = НайденнаяСтрокаПервыйЭлемент.Комментарий;
				НайденнаяСтрокаПервыйЭлемент.Комментарий = НайденнаяСтрокаВторойЭлемент.Комментарий;
				НайденнаяСтрокаВторойЭлемент.Комментарий = КомментарийПервыйЭлемент;
				Если Форма.Элементы.Найти("Комментарий" + Результат.ПервыйЭлемент) <> Неопределено Тогда
					Форма.Элементы["Комментарий" + Результат.ПервыйЭлемент].Заголовок = НайденнаяСтрокаПервыйЭлемент.Комментарий;
				КонецЕсли;
				Если Форма.Элементы.Найти("Комментарий" + Результат.ВторойЭлемент) <> Неопределено Тогда
					Форма.Элементы["Комментарий" + Результат.ВторойЭлемент].Заголовок = НайденнаяСтрокаВторойЭлемент.Комментарий;
				КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(НайденнаяСтрокаПервыйЭлемент.Комментарий)
			ИЛИ ЗначениеЗаполнено(НайденнаяСтрокаВторойЭлемент.Комментарий) Тогда
				КомментарийПервыйЭлемент = НайденнаяСтрокаПервыйЭлемент.Комментарий;
				НайденнаяСтрокаПервыйЭлемент.Комментарий = НайденнаяСтрокаВторойЭлемент.Комментарий;
				НайденнаяСтрокаВторойЭлемент.Комментарий = КомментарийПервыйЭлемент;
				
				ИзменитьКомментарий(Форма, Результат.ПервыйЭлемент, ЗначениеЗаполнено(НайденнаяСтрокаПервыйЭлемент.Комментарий), Результат.ИмяЭлементаДляРазмещения);
				ИзменитьКомментарий(Форма, Результат.ВторойЭлемент, ЗначениеЗаполнено(НайденнаяСтрокаВторойЭлемент.Комментарий), Результат.ИмяЭлементаДляРазмещения);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Процедура обновляет элементы формы в соответствии с данными в реквизите-таблице
//
// Параметры:
//  Форма	 - УправляемаяФорма	 - форма-владелец контактной информации
//
Процедура ОбновитьЭлементыКонтактнойИнформации(Форма, Знач ВладелецКИ, Знач ВладелецКИОбъект) Экспорт
	
	ПараметрыСвойствПолейКИ = ПолучитьПараметрыСвойствПолейКИ(Форма.ИмяФормы, ВладелецКИ, ВладелецКИОбъект);
	
	ЭтоФормаКлиенты 	= Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлементаКлиенты";
	ЭтоФормаОбращения 	= Форма.ИмяФормы = "Справочник.Заявки.Форма.ФормаЭлемента";
	ЭтоФормаВоронки     = Форма.ИмяФормы = "Справочник.Сделки.Форма.ФормаЭлемента"; 
	
	КомандыДобавления = Форма.Элементы.Найти("КнопкаДобавитьКонтактнуюИнформацию");
	Если КомандыДобавления <> Неопределено Тогда
		КомандыДобавления.Видимость = УправлениеКонтактнойИнформациейКлиентСерверСтоматология.СписокВидовДляДобавленияКонтактнойИнформации(Форма.СвойстваВидовКонтактнойИнформации, Форма.КонтактнаяИнформация).Количество() > 0;
	КонецЕсли;
	
	Если Форма.ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти Тогда
		ИдентификаторыСтрокТабличнойЧасти = Форма.ИдентификаторыСтрокТабличнойЧасти.Выгрузить().ВыгрузитьКолонку("Значение");
	Иначе
		ИдентификаторыСтрокТабличнойЧасти = Новый Массив;
		ИдентификаторыСтрокТабличнойЧасти.Добавить(0);
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	УдаляемыеЭлементы = Новый Массив;
	
	Если Форма.ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти Тогда
		Для каждого ИдентификаторСтроки Из ИдентификаторыСтрокТабличнойЧасти Цикл
			ГруппаЗначения = Элементы.Найти("КонтактнаяИнформация" + ИдентификаторСтроки + "ЗначенияКонтактнойИнформации");
			Если ГруппаЗначения = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Для каждого Элемент Из ГруппаЗначения.ПодчиненныеЭлементы Цикл
				УдаляемыеЭлементы.Добавить(Элемент);
			КонецЦикла;
		КонецЦикла;
		ИнициализироватьФорму(Форма);
		
		Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
			Элементы.Удалить(УдаляемыйЭлемент);
		КонецЦикла;
	Иначе
		Для Каждого ГруппаЭлементов Из Элементы.КонтактнаяИнформация.ПодчиненныеЭлементы Цикл
			УдаляемыеЭлементы.Добавить(ГруппаЭлементов);
		КонецЦикла;
		// ШиринаПоляКомментария = 9;
		// Если УдаляемыеЭлементы.Количество() > 0 Тогда
		//	Для каждого ЭлементКИ Из УдаляемыеЭлементы[0].ПодчиненныеЭлементы Цикл
		//		Если СтрНачинаетсяС(ЭлементКИ.Имя, "ВидКИ_") Тогда
		//			
		//			ШиринаПоляВида = ЭлементКИ.Ширина;
		//			Прервать;
		//			
		//		КонецЕсли;		
		//	КонецЦикла;
		//	// ШиринаПоляВида = Элементы["ВидКИ_0"].Ширина;
		//	
		// КонецЕсли;			
		Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
			Элементы.Удалить(УдаляемыйЭлемент);
		КонецЦикла;
	КонецЕсли;
	
	Отбор = Новый Структура("Вид");
	
	
	РеквизитСписокТелефонов = ОбщегоНазначенияКлиентСерверСтоматология.НайтиВМассивеСтруктур(Форма.ПолучитьРеквизиты(), "Имя", "СписокТелефоновДляWhatsApp");
	Если Не РеквизитСписокТелефонов = Неопределено Тогда
		СписокТелефоновДляWhatsApp = Форма.СписокТелефоновДляWhatsApp;
	Иначе
		СписокТелефоновДляWhatsApp = Неопределено;
	КонецЕсли;
	
	ДоступенПереходВМессенджер = ОбщегоНазначенияСтоматология.ИспользуетсяРасширение("Мессенджер") 
									И Справочники.ВнешниеСистемы.СуществуютДоступныеВнешниеСистемыМессенджераДляОтправкиПервым(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница) 
									И ((ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.Контрагенты") 
										И ВладелецКИОбъект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиенты"))
										ИЛИ ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.Заявки"))
									И (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ИспользованиеМессенджера"));
									
	ДоступнаОтправкаПоПочте = ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.Контрагенты") И ВладелецКИОбъект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиенты") И
	Справочники.УчетныеЗаписиЭлектроннойПочты.СуществуютУчетныеЗаписиЭлектроннойПочтыОбщиеИЛичные(ПараметрыСеанса.ТекущийПользователь, Истина,Истина,Истина);
	
								
	Для Каждого ДанныеКИ Из Форма.КонтактнаяИнформация Цикл
		
		ИндексКИ = Форма.КонтактнаяИнформация.Индекс(ДанныеКИ);
		Отбор.Вид = ДанныеКИ.Вид;
		НайденныеСтроки = Форма.СвойстваВидовКонтактнойИнформации.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоТелефонМессенджера = Ложь;
		ВыводитьКнопкуМессенджера = ДоступенПереходВМессенджер И ДанныеКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
		ВыводитьКнопкуПочты       = ДоступнаОтправкаПоПочте    И ДанныеКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты");
		
		Если ДанныеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И СписокТелефоновДляWhatsApp <> Неопределено Тогда
			
			ПредставлениеНомераТелефона = ДанныеКИ.Представление;
			ПредставлениеНомераТелефона = СтрЗаменить(ПредставлениеНомераТелефона, " ", "");
			ПредставлениеНомераТелефона = СтрЗаменить(ПредставлениеНомераТелефона, "(", "");
			ПредставлениеНомераТелефона = СтрЗаменить(ПредставлениеНомераТелефона, ")", "");
			ПредставлениеНомераТелефона = СтрЗаменить(ПредставлениеНомераТелефона, "+", "");
			
			ЭтоТелефонМессенджера = Не СписокТелефоновДляWhatsApp.НайтиПоЗначению(ПредставлениеНомераТелефона) = Неопределено;
						
		КонецЕсли;	
		
		СвойстваВида 			= НайденныеСтроки[0];
		ДоступенВводКомментария = ДляТипаКонтактнойИнформацииДоступенВводКомментария(ДанныеКИ.Тип);
		ДоступенЗвонок          = (ДанныеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон)
		И Справочники.ТелефонныеАппараты.ПроверитьВозможностьЗвонкаНаДанномПК();
		 
		// Создаем группу
		// --------------------------------------------------------------------------------------------		
		ГруппаЗначениеКИ 									= Элементы.Добавить("КИ_" + ИндексКИ, Тип("ГруппаФормы"), Элементы.КонтактнаяИнформация);
		ГруппаЗначениеКИ.Вид 								= ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаЗначениеКИ.Заголовок 							= ДанныеКИ.Вид;
		ГруппаЗначениеКИ.Отображение 						= ОтображениеОбычнойГруппы.Нет;
		ГруппаЗначениеКИ.Группировка 						= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ГруппаЗначениеКИ.ОтображатьЗаголовок 				= Ложь;
		ГруппаЗначениеКИ.ВертикальноеПоложениеПодчиненных 	= ВертикальноеПоложениеЭлемента.Центр;
		//ГруппаЗначениеКИ.ГоризонтальныйИнтервал             = ИнтервалМеждуЭлементамиФормы.Одинарный; 
		// ГруппаЗначениеКИ.ГоризонтальноеПоложениеВГруппе     = ГоризонтальноеПоложениеЭлемента.Лево;
		// ГруппаЗначениеКИ.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Лево;
		// ГруппаЗначениеКИ.СквозноеВыравнивание 				= СквозноеВыравнивание.Использовать;
		// ГруппаЗначениеКИ.ВыравниваниеЭлементовИЗаголовков 	= ВыравниваниеЭлементовИЗаголовков.ЭлементыПравоЗаголовкиЛево;
		
		// Создаем картинку
		// --------------------------------------------------------------------------------------------		
		ДекорацияДействие = Элементы.Добавить("ДействиеКИ_" + ИндексКИ, Тип("ДекорацияФормы"), ГруппаЗначениеКИ);
		ДекорацияДействие.Вид						 	= ВидДекорацииФормы.Картинка;
		ДекорацияДействие.Картинка					 	= КартинкаДействияПоТипуКонтактнойИнформации(ДанныеКИ.Тип, ЭтоТелефонМессенджера);
		ДекорацияДействие.АвтоМаксимальнаяШирина	 	= Ложь;
		ДекорацияДействие.РастягиватьПоГоризонтали	 	= Ложь;
		ДекорацияДействие.Ширина					 	= 2;
		ДекорацияДействие.Высота					 	= 1;
		Если ДоступенЗвонок	И ТипЗнч(ВладелецКИ) <> Тип("СправочникСсылка.СтруктурныеЕдиницы") Тогда
			ДекорацияДействие.Гиперссылка = Истина;
			ДекорацияДействие.УстановитьДействие("Нажатие", "Подключаемый_ДействиеКИНажатие");
			ДекорацияДействие.Подсказка = "Позвонить";
			ДекорацияДействие.ОтображениеПодсказки = ОтображениеПодсказки.Всплывающая;
		КонецЕсли;	
		
		Если (ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.Контрагенты") И ВладелецКИОбъект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиенты")) Тогда 
			//ИЛИ ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.Заявки")Тогда  
			Если ДанныеКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") 
				ИЛИ ДанныеКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты")
				ИЛИ ДанныеКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.МобильноеПриложение") Тогда
				
				ЭлементФормы 			 				= Элементы.Добавить("РазрешитьЗапретитьРассылку_" + ИндексКИ, Тип("ДекорацияФормы"), ГруппаЗначениеКИ);	
				ЭлементФормы.Вид		 				= ВидДекорацииФормы.Картинка;
				ЭлементФормы.Гиперссылка 				= Истина;
				ЭлементФормы.УстановитьДействие("Нажатие", "Подключаемый_ОбработкаНажатияДинамическойКнопкиЗапрещенияРассылки");
				ЭлементФормы.АвтоМаксимальнаяШирина	    = Ложь;
				ЭлементФормы.РастягиватьПоГоризонтали	= Ложь;
				ЭлементФормы.Ширина	     				= 2;
				ЭлементФормы.Высота		 				= 1;
				НеУчаствоватьВРассылке   				= Форма.КонтактнаяИнформация[ИндексКИ].НеУчаствоватьВРассылке;
				ЭлементФормы.Картинка    				= ПолучитьКартинкуКнопкиЗапретаОповещения(НеУчаствоватьВРассылке);
				ЭлементФормы.Подсказка   				= ПолучитьПодсказкуКнопкиЗапретаОповещения(НеУчаствоватьВРассылке);
				ЭлементФормы.ОтображениеПодсказки 		= ОтображениеПодсказки.Всплывающая;
			Иначе
				ЭлементФормы 			 				= Элементы.Добавить("РазрешитьЗапретитьРассылкуПустая_" + ИндексКИ, Тип("ДекорацияФормы"), ГруппаЗначениеКИ);	
				ЭлементФормы.Вид		 				= ВидДекорацииФормы.Картинка;
				ЭлементФормы.Ширина      				= 2;
				ЭлементФормы.Высота					  	= 1;
				ЭлементФормы.АвтоМаксимальнаяШирина	  	= Ложь;
				ЭлементФормы.РастягиватьПоГоризонтали 	= Ложь;
			КонецЕсли;
			
		КонецЕсли; 

		// Создаем надпись
		// --------------------------------------------------------------------------------------------		
		ПолеВид = Элементы.Добавить("ВидКИ_" + ИндексКИ, Тип("ПолеФормы"), ГруппаЗначениеКИ);
		ПолеВид.Вид 									= ВидПоляФормы.ПолеНадписи;
		ПолеВид.ПутьКДанным 							= "КонтактнаяИнформация[" + ИндексКИ + "].Вид";
		Если ЭтоФормаКлиенты ИЛИ ЭтоФормаОбращения Тогда
			ПолеВид.ПоложениеЗаголовка 						= ПоложениеЗаголовкаЭлементаФормы.Право;
			ПолеВид.ЦветТекстаЗаголовка                     = Новый Цвет(255,255,255);
			Если ЭтоФормаОбращения Тогда 
				//ПолеВид.Заголовок 							= "а1111";
				ПолеВид.ШрифтЗаголовка 						= Новый Шрифт(, 9);	
			КонецЕсли;	
		Иначе 
			ПолеВид.ПоложениеЗаголовка 						= ПоложениеЗаголовкаЭлементаФормы.Нет;
		КонецЕсли;
		ПолеВид.Ширина 									= ПараметрыСвойствПолейКИ.Надпись_МаксимальнаяШирина;
		Если ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.СтруктурныеЕдиницы") ИЛИ ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.Организации") Тогда
			ПолеВид.АвтоМаксимальнаяШирина 					= Ложь;
			ПолеВид.РастягиватьПоГоризонтали 				= Ложь;
			ПолеВид.МаксимальнаяШирина 						= ПараметрыСвойствПолейКИ.Надпись_МаксимальнаяШирина;
			ПолеВид.Ширина                   				= ПараметрыСвойствПолейКИ.Надпись_МаксимальнаяШирина;
		Иначе 	
			ПолеВид.АвтоМаксимальнаяШирина 					= Ложь;
			ПолеВид.РастягиватьПоГоризонтали 				= Ложь;
			ПолеВид.МаксимальнаяШирина                      = ?(ЭтоФормаКлиенты, 7, ПараметрыСвойствПолейКИ.Надпись_МаксимальнаяШирина); 		
			ОтнимаемаяШирина = ?(ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.Контрагенты"), 2, 3);
			ПолеВид.Ширина                   				= ПараметрыСвойствПолейКИ.Надпись_МаксимальнаяШирина - ОтнимаемаяШирина; // -3
		КонецЕсли;
		ПолеВид.ВертикальноеПоложение 						= ВертикальноеПоложениеЭлемента.Центр;
		
		// Создаем надпись для растягивания.
		Если НЕ ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.Организации") Тогда
			НадписьРастягивания = Элементы.Добавить("НадписьРастягивания_" + ИндексКИ, Тип("ДекорацияФормы"), ГруппаЗначениеКИ);
			НадписьРастягивания.ЦветФона = Новый Цвет(255,255,255); 					
		КонецЕсли;
		
		ДоступноРедактированиеВДиалоге = ДляТипаКонтактнойИнформацииДоступноРедактированиеВДиалоге(ДанныеКИ.Тип);
		
		// Создаем представление
		// --------------------------------------------------------------------------------------------		
		ПолеПредставление = Элементы.Добавить("ПредставлениеКИ_" + ИндексКИ, Тип("ПолеФормы"), ГруппаЗначениеКИ);
		ПолеПредставление.Вид 						= ВидПоляФормы.ПолеВвода;
		ПолеПредставление.ПутьКДанным 				= "КонтактнаяИнформация[" + ИндексКИ + "].Представление";
		ПолеПредставление.ТолькоПросмотр 			= ПараметрыСвойствПолейКИ.ТолькоПросмотр И ЗначениеЗаполнено(ДанныеКИ.ЗначенияПолей);
		ПолеПредставление.ПоложениеЗаголовка        = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		ПолеПредставление.КнопкаВыбора 				= ДоступноРедактированиеВДиалоге;
		ПолеПредставление.Подсказка 				= СвойстваВида.Подсказка;
		ПолеПредставление.АвтоОтметкаНезаполненного = СвойстваВида.ОбязательноеЗаполнение;
		ПолеПредставление.ВертикальноеПоложение 	= ВертикальноеПоложениеЭлемента.Центр;
		
		ПолеПредставление.АвтоМаксимальнаяШирина  = Ложь;
		ПолеПредставление.МаксимальнаяШирина      = ?(ДоступенВводКомментария, ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_СКомм, ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_БезКомм);
		ПолеПредставление.ШиринаВыпадающегоСписка = 40;
		
		ПолеПредставление.УстановитьДействие("ПриИзменении", "Подключаемый_ПредставлениеКИПриИзменении");
		ПолеПредставление.УстановитьДействие("Очистка", "Подключаемый_ПредставлениеКИОчистка");
		Если СвойстваВида.ВидРедактирования = "Диалог" И ДанныеКИ.Тип <> Перечисления.ТипыКонтактнойИнформации.ВебСтраница Тогда
			ПолеПредставление.РедактированиеТекста = Ложь;
			ПолеПредставление.ЦветФона = ЦветаСтиля.КонтактнаяИнформацияСРедактированиемВДиалогеЦвет;
		КонецЕсли;		
		Если СвойстваВида.МногострочноеПоле ИЛИ СвойстваВида.ВидПоляДругое = "МногострочноеШирокое"Тогда
			ПолеПредставление.МногострочныйРежим 	= Истина;
			ПолеПредставление.Высота 				= 2;
			ПолеПредставление.РастягиватьПоВертикали = Ложь;
		КонецЕсли;
		Если ДанныеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
			ПолеПредставление.УстановитьДействие("Автоподбор", "Подключаемый_КонтактнаяИнформацияАвтоподбор");
			ПолеПредставление.УстановитьДействие("ОбработкаВыбора", "Подключаемый_КонтактнаяИнформацияОбработкаВыбора");
		КонецЕсли;		
		Если ДоступноРедактированиеВДиалоге Тогда
			ПолеПредставление.УстановитьДействие("НачалоВыбора", "Подключаемый_ПредставлениеКИНачалоВыбора");
		КонецЕсли;
		
		// Создаем поле для комментария
		// --------------------------------------------------------------------------------------------
		Если ДоступенВводКомментария Тогда  			
			
			ПолеКомментарий = Элементы.Добавить("КомментарийКИ_" + ИндексКИ, Тип("ПолеФормы"), ГруппаЗначениеКИ);
			ПолеКомментарий.Вид 						= ВидПоляФормы.ПолеВвода;
			ПолеКомментарий.ПутьКДанным 				= "КонтактнаяИнформация[" + ИндексКИ + "].Комментарий";
			ПолеКомментарий.ТолькоПросмотр 				= ПараметрыСвойствПолейКИ.ТолькоПросмотр И ЗначениеЗаполнено(ДанныеКИ.ЗначенияПолей);						
			ПолеКомментарий.ПоложениеЗаголовка 			= ПоложениеЗаголовкаЭлементаФормы.Нет;
			ПолеКомментарий.ПропускатьПриВводе 			= Истина;
			ПолеКомментарий.ПодсказкаВвода 				= НСтр("ru='Прим.';en='Note'");
			ПолеКомментарий.АвтоМаксимальнаяШирина 		= Ложь;
			ПолеКомментарий.МаксимальнаяШирина          = ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина;	
			ПолеКомментарий.ВертикальноеПоложение 		= ВертикальноеПоложениеЭлемента.Центр;
			
			ПолеКомментарий.УстановитьДействие("ПриИзменении", "Подключаемый_КомментарийКИПриИзменении");
			
			// При доступности только одной кнопки для комментария телефона или почты
			Если ЭтоФормаВоронки И (НЕ (ДоступенЗвонок И ВыводитьКнопкуМессенджера) И (ДоступенЗвонок ИЛИ ВыводитьКнопкуМессенджера) 
				ИЛИ ВыводитьКнопкуПочты) Тогда 
				ПолеКомментарий.РастягиватьПоГоризонтали    = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		// Переход в чат при доступности мессенджера и при наличии доступных внешних систем для отправки первым
		Если ВыводитьКнопкуМессенджера Тогда  
			
			ДобавитьДекорациюГиперссылки(Форма,
			"ПерейтиКДиалогу_" + ИндексКИ,"Подключаемый_ПерейтиКДиалогу",
			БиблиотекаКартинок.Чат,
			НСтр("ru='Перейти к чату WhatsApp';en='Go to WhatsApp chat'"),
			ГруппаЗначениеКИ
			);				
			
		КонецЕсли;

		Если ВыводитьКнопкуПочты Тогда
			
			ДобавитьДекорациюГиперссылки(Форма,
			"ОтправитьПоПочте_" + ИндексКИ,"Подключаемый_ОтправитьПоПочте",
			БиблиотекаКартинок.ПисьмоСиняя,
			НСтр("ru='Отправить письмо клиенту по почте';en='Send a letter to the client by mail'"),
			ГруппаЗначениеКИ
			);		
		КонецЕсли;

		// Установка ширины поля комментария по кнопкам мессенджера и звонка
		ПолеКомментарий = Элементы.Найти("КомментарийКИ_" + ИндексКИ);
		Если ПолеКомментарий <> Неопределено И ДанныеКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
			
			Если ДоступенЗвонок И (ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.СтруктурныеЕдиницы") ИЛИ ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.Организации")) Тогда
				ПолеКомментарий.МаксимальнаяШирина = ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина - 3;
			ИначеЕсли ДоступенЗвонок И ВыводитьКнопкуМессенджера Тогда
				ПолеКомментарий.МаксимальнаяШирина = ?(ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.Заявки"), 
				ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина - 5,
				?(ЭтоФормаВоронки,ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина - 7,
				ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина - 8));
			ИначеЕсли ДоступенЗвонок ИЛИ ВыводитьКнопкуМессенджера Тогда 
				ПолеКомментарий.МаксимальнаяШирина = ?(ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.Заявки") ,
				ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина - 3,
				ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина - 4);
			КонецЕсли;
		ИначеЕсли ПолеКомментарий <> Неопределено И ВыводитьКнопкуПочты Тогда
			ПолеКомментарий.МаксимальнаяШирина = ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина - 4;
			
		КонецЕсли;
		
		// Команды контекстного меню: показать адрес в Яндекс.Карты или GoogleMaps
		Если ДанныеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
			
			ДобавитьКомандуКонтекстногоМеню(Форма,
			"КонтекстноеМенюКартаЯндекс_" + ИндексКИ,
			БиблиотекаКартинок.ЯндексКарты,
			НСтр("ru = 'Адрес на Яндекс.Картах'"),
			НСтр("ru = 'Показывает адрес на картах Яндекс.Карты'"),
			ПолеПредставление
			);
			ДобавитьКомандуКонтекстногоМеню(Форма,
			"КонтекстноеМенюКартаGoogle_" + ИндексКИ,
			БиблиотекаКартинок.GoogleMaps,
			НСтр("ru = 'Адрес на Google Maps'"),
			НСтр("ru = 'Показывает адрес на карте Google Maps'"),
			ПолеПредставление
			);
			
		ИначеЕсли ДоступенЗвонок Тогда
			
			ДобавитьДекорациюГиперссылки(Форма,
			"ПозвонитьПоIPТелефонии_" + ИндексКИ,"Подключаемый_КонтактнаяИнформация_ВыполнитьКоманду",
			БиблиотекаКартинок.ЗвонокИсходящийСиняя,
			НСтр("ru='Позвонить клиенту по IP-телефонии';en='Call to the client by IP telephony'"),
			ГруппаЗначениеКИ
			);				
			
		КонецЕсли;
		
	КонецЦикла;
	
	УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ЗаполнитьСписокВыбораАдресов(Форма);
	
КонецПроцедуры

// Процедура добавляет поля ввода вида контактной информации на форму
//
// Параметры:
//  Форма						 - УправляемаяФорма	 - форма-владелец контактной информации
//  ДобавляемыйВид				 - СправочникСсылка.ВидыКонтактнойИнформации	 - вид для добавления
//  УстановитьВыводВФормеВсегда	 - Булево	 - признак установки настройки "ВыводитьВФормеВсегда"
//
Процедура ДобавитьКонтактнуюИнформацию(Форма, Знач Объект, ДобавляемыйВид, УстановитьВыводВФормеВсегда = Ложь) Экспорт
	
	// Если УстановитьВыводВФормеВсегда Тогда
	//	УстановитьФлагВыводитьВФормеВсегда(ДобавляемыйВид);
	//	НайденныеСтроки = Форма.СвойстваВидовКонтактнойИнформации.НайтиСтроки(Новый Структура("Вид", ДобавляемыйВид));
	//	Если НайденныеСтроки.Количество() > 0 Тогда
	//		НайденныеСтроки[0].ВыводитьВФормеВсегда = Истина;
	//	КонецЕсли;
	// КонецЕсли;
	
	ВладелецКИСсылка = Объект.Ссылка;
	ВладелецКИОбъект = Объект;		
	
	КоличествоЭлементовКоллекции = Форма.КонтактнаяИнформация.Количество();
	ИндексВставки = КоличествоЭлементовКоллекции;
	
	Для ОбратныйИндекс = 1 По КоличествоЭлементовКоллекции Цикл
		ТекущийИндекс = КоличествоЭлементовКоллекции - ОбратныйИндекс;
		Если Форма.КонтактнаяИнформация[ТекущийИндекс].Вид = ДобавляемыйВид Тогда
			ИндексВставки = ТекущийИндекс+1;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеКИ = Форма.КонтактнаяИнформация.Вставить(ИндексВставки);
	ДанныеКИ.Вид = ДобавляемыйВид;
	ДанныеКИ.Тип = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДобавляемыйВид, "Тип");
	
	ОбновитьЭлементыКонтактнойИнформации(Форма, ВладелецКИСсылка, ВладелецКИОбъект);
	Форма.ТекущийЭлемент = Форма.Элементы["ПредставлениеКИ_" + ИндексВставки];
	
КонецПроцедуры

// Процедура заполняет значение контактной информации на форме
//
// Параметры:
//  Форма						 - УправляемаяФорма	 - форма-владелец контактной информации
//  ЗаполняемыйВид				 - СправочникСсылка.ВидыКонтактнойИнформации	 - вид для которого заполняется значение
//  ДанныеЗаполнения			 - Структура	 - данные для заполнения, обязательные поля: Представление, Комментарий, ЗначенияПолей
//  ДобавлятьЕслиНет			 - Булево	 - признак необходимости добавления вида на форму, если такого еще нет
//  УстановитьВыводВФормеВсегда	 - Булево	 - признак установки настройки вида в случае добавления вида на форму
//
Процедура ЗаполнитьЗначениеКонтактнойИнформации(Форма, ЗаполняемыйВид, ДанныеЗаполнения, ДобавлятьЕслиНет = Ложь, УстановитьВыводВФормеВсегда = Ложь) Экспорт
	
	Отбор = Новый Структура("Вид", ЗаполняемыйВид);
	НайденныеСтроки = Форма.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		СтрокаКЗаполнению = НайденныеСтроки[0];
		
	ИначеЕсли ДобавлятьЕслиНет Тогда
		
		ДобавитьКонтактнуюИнформацию(Форма, ЗаполняемыйВид, УстановитьВыводВФормеВсегда);
		НайденныеСтроки = Форма.КонтактнаяИнформация.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаКЗаполнению = НайденныеСтроки[0];
		Иначе
			Возврат;
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтрокаКЗаполнению, ДанныеЗаполнения, "Представление,Комментарий,ЗначенияПолей");
	
	СтрокаКЗаполнению.Тип = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаполняемыйВид, "Тип");
	
КонецПроцедуры

// Функция - Для типа контактной информации доступен ввод комментария
//
// Параметры:
//  ТипКИ	 - ПеречислениеСсылка.ТипыКонтактнойИнформации	 - тип для которого проверяется доступность ввода комментария
// 
// Возвращаемое значение:
//  Булево - признак наличия поля комментария на форме
//
Функция ДляТипаКонтактнойИнформацииДоступенВводКомментария(ТипКИ) Экспорт
	
	Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Адрес Или ТипКИ = Перечисления.ТипыКонтактнойИнформации.Другое Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

// Функция - Картинка действия по типу контактной информации
//
// Параметры:
//  ТипКИ	 - ПеречислениеСсылка.ТипыКонтактнойИнформации	 - тип для которого получается картинка
// 
// Возвращаемое значение:
//  Картинка - пиктограмма для отображения
//
Функция КартинкаДействияПоТипуКонтактнойИнформации(ТипКИ, ЭтоТелефонМессенджера = Ложь) Экспорт
	
	Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		Если ЭтоТелефонМессенджера = Истина Тогда
			КартинкаДействия = БиблиотекаКартинок.Whatsapp16;
		Иначе
			КартинкаДействия = БиблиотекаКартинок.КонтактнаяИнформацияТелефон;
		КонецЕсли;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		КартинкаДействия = БиблиотекаКартинок.КонтактнаяИнформацияЕмэйл;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		КартинкаДействия = БиблиотекаКартинок.КонтактнаяИнформацияАдрес;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Факс Тогда
		КартинкаДействия = БиблиотекаКартинок.КонтактнаяИнформацияФакс;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Skype Тогда
		КартинкаДействия = БиблиотекаКартинок.КонтактнаяИнформацияСкайп;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.СоциальнаяСеть Тогда
		КартинкаДействия = БиблиотекаКартинок.КонтактнаяИнформацияВебСтраница;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.ВебСтраница Тогда
		КартинкаДействия = БиблиотекаКартинок.КонтактнаяИнформацияВебСтраница;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.КороткийАдрес Тогда
		КартинкаДействия = БиблиотекаКартинок.КонтактнаяИнформацияАдрес;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.МобильноеПриложение Тогда
		КартинкаДействия = БиблиотекаКартинок.МобильноеПриложение; 
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.ЯндексКарты Тогда
		КартинкаДействия = БиблиотекаКартинок.Яндекс;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.ЯндексОтзывы Тогда
		КартинкаДействия = БиблиотекаКартинок.Яндекс;
	Иначе
		КартинкаДействия = БиблиотекаКартинок.Пустая;
	КонецЕсли;
	
	Возврат КартинкаДействия;
	
КонецФункции

// Функция проверяет корректность адреса электронной почты
//
// Параметры:
//  ОбъектКИ	 - ОбъектXDTO	 - объект XDTO контактной информации
//  ИмяРеквизита - строка	 - имя реквизита формы, с которым будет связано сообщение об ошибке
// 
// Возвращаемое значение:
//  Булево - признак корректности
//
Функция ЭлектроннаяПочтаКорректна(ОбъектКИ, Знач ИмяРеквизита = "") Экспорт
	
	СтрокаОшибки = "";
	
	АдресЭП = ОбъектКИ.Состав;
	ПространствоИмен = УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ПространствоИмен();
	Если АдресЭП <> Неопределено И АдресЭП.Тип() = ФабрикаXDTO.Тип(ПространствоИмен, "ЭлектроннаяПочта") Тогда
		Попытка
			Результат = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(АдресЭП.Значение);
			Если Результат.Количество() > 1 Тогда
				
				СтрокаОшибки = Нстр("ru = 'Допускается ввод только одного адреса электронной почты'");
				
			КонецЕсли;
		Исключение
			СтрокаОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	КонецЕсли;
	
	Если Не ПустаяСтрока(СтрокаОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаОшибки,,ИмяРеквизита);
	КонецЕсли;
	
	Возврат ПустаяСтрока(СтрокаОшибки);
	
КонецФункции

// Функция возвращает таблицу типов контактной информации в порядке по умолчанию
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Стандартный порядок типов контактной информации для отображения в интерфейсе
//
Функция ПорядокТиповКИ() Экспорт
	
	ПорядокТиповКИ = Новый ТаблицаЗначений;
	ПорядокТиповКИ.Колонки.Добавить("Тип", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"));
	ПорядокТиповКИ.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	СтрокаТипов.Порядок = 1;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	СтрокаТипов.Порядок = 2;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	СтрокаТипов.Порядок = 3;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.КороткийАдрес;
	СтрокаТипов.Порядок = 4;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.Факс;
	СтрокаТипов.Порядок = 5;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.Skype;
	СтрокаТипов.Порядок = 6;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.СоциальнаяСеть;
	СтрокаТипов.Порядок = 7;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
	СтрокаТипов.Порядок = 8;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.МобильноеПриложение;
	СтрокаТипов.Порядок = 9;
	   
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.ЯндексКарты;
	СтрокаТипов.Порядок = 10;

    СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.ЯндексОтзывы;
	СтрокаТипов.Порядок = 11; 
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
	СтрокаТипов.Порядок = 12;     
	
	Возврат ПорядокТиповКИ;
	
КонецФункции

// Устанавливает доступность элементов контактной информации на форме
// 
// Параметры:
//    Форма - УправляемаяФорма - передаваемая форма.
//    Элементы - Соответствие -  Список видов контактной информации, для которых устанавливается доступ
//        ** Ключ     - ОбъектМетаданных - Подсистема, в которой размещается отчет или вариант отчета.
//        ** Значение - Булево           - Если ЛОЖЬ, то элемент доступен только для просмотра.
// 
Процедура УстановитьДоступностьЭлементовКонтактнойИнформации(Форма, Элементы, ИмяЭлементаДляРазмещения) Экспорт
	Для каждого Элемент Из Элементы Цикл
		
		Отбор = Новый Структура("Вид", Элемент.Ключ);
		НайденныеСтроки = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
		Если НайденныеСтроки <> Неопределено Тогда
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				ЭлементКИ = Форма.Элементы[НайденнаяСтрока.ИмяРеквизита];
				ЭлементКИ.ТолькоПросмотр = НЕ Элемент.Значение;
			КонецЦикла;
			// Если у элемента только просмотр, то удаляем возможность добавления этого элемента на форму.
			Если НЕ Элемент.Значение Тогда
				Для каждого ЭлементКонтекстногоМеню Из Форма.ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения].СписокДобавляемыхЭлементов Цикл
					Если ЭлементКонтекстногоМеню.Значение.Ссылка = Элемент.Ключ Тогда
						Форма.ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения].СписокДобавляемыхЭлементов.Удалить(ЭлементКонтекстногоМеню);
						Продолжить;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Форма.Элементы.Найти("КонтактнаяИнформацияДобавитьПолеВвода") <> Неопределено
		И Форма.ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения].СписокДобавляемыхЭлементов.Количество() = 0 Тогда
		// Делаем кнопку Добавить недоступной, т.к. контекстное меню пустое. 
		Форма.Элементы.КонтактнаяИнформацияДобавитьПолеВвода.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Дополняет список колонки для загрузки данных колонками контактной информации
//
// Параметры:
//  МетаданныеСправочника	 - ОбъектМетаданных - Метаданные справочника
//  ИнформацияПоКолонкам	 - ТаблицаЗначение - колонки макета.
//
Процедура КолонкиДляЗагрузкиДанных(МетаданныеСправочника, ИнформацияПоКолонкам) Экспорт
	
	Если МетаданныеСправочника.ТабличныеЧасти.Найти("КонтактнаяИнформация") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Позиция = ИнформацияПоКолонкам.Количество() + 1;
	
	ВидыКонтактнойИнформации = ВидыКонтактнойИнформацияОбъекта(Справочники[МетаданныеСправочника.Имя].ПустаяСсылка());
	
	Для каждого ВидКонтактнойИнформации Из ВидыКонтактнойИнформации Цикл
		ИмяКолонки = "КонтактнаяИнформация_" + СтандартныеПодсистемыКлиентСервер.ПреобразоватьСтрокуВДопустимоеНаименованиеКолонки(ВидКонтактнойИнформации.Наименование);
		Если ИнформацияПоКолонкам.Найти(ИмяКолонки, "ИмяКолонки") = Неопределено Тогда
			СтрокаИнфоПроКолонки = ИнформацияПоКолонкам.Добавить();
			СтрокаИнфоПроКолонки.ИмяКолонки = ИмяКолонки;
			СтрокаИнфоПроКолонки.ПредставлениеКолонки = ВидКонтактнойИнформации.Представление;
			СтрокаИнфоПроКолонки.ТипКолонки = Новый ОписаниеТипов("Строка");
			СтрокаИнфоПроКолонки.ОбязательнаДляЗаполнения = Ложь;
			СтрокаИнфоПроКолонки.Позиция = Позиция;
			СтрокаИнфоПроКолонки.Группа = НСтр("ru='Контактная информация';en='Contact information'");
			СтрокаИнфоПроКолонки.Видимость = Истина;
			СтрокаИнфоПроКолонки.Примечание = ВидКонтактнойИнформации.Подсказка;
			СтрокаИнфоПроКолонки.Ширина = 30;
			Позиция = Позиция + 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Инициализировать форму
//
// Параметры:
//  Форма	 - 	 - 
//
Процедура ИнициализироватьФорму(Форма)
	
	// Элементы = Форма.Элементы;
	//
	// Если НЕ Форма.ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти Тогда
	//	
	//	Если Элементы.Найти("ЗначенияКонтактнойИнформации") <> Неопределено Тогда
	//		Возврат;
	//	КонецЕсли;
	//	
	//	ГруппаЗначенийКИ = Элементы.Добавить("ЗначенияКонтактнойИнформации", Тип("ГруппаФормы"), Элементы.КонтактнаяИнформация);
	//	ГруппаЗначенийКИ.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//	ГруппаЗначенийКИ.Заголовок = НСтр("ru='Значения контактной информации'");
	//	ГруппаЗначенийКИ.Отображение = ОтображениеОбычнойГруппы.Нет;
	//	ГруппаЗначенийКИ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	//	ГруппаЗначенийКИ.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	//	ГруппаЗначенийКИ.ОтображатьЗаголовок = Ложь;
	//	
	//	Если КонтактнаяИнформацияУНФКлиентСервер.СписокВидовДляДобавленияКонтактнойИнформации(Форма).Количество() = 0 Тогда
	//		Возврат;
	//	КонецЕсли;
	//	
	//	ИмяКоманды = "ДобавитьПолеКонтактнойИнформации";
	//	Команда = Форма.Команды.Добавить(ИмяКоманды);
	//	Команда.Заголовок = НСтр("ru='+ телефон, адрес'");
	//	Команда.Действие = "Подключаемый_КонтактнаяИнформацияСтоматологияВыполнитьКоманду";
	//	
	//	Кнопка = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элементы.КонтактнаяИнформация);
	//	Кнопка.ИмяКоманды = ИмяКоманды;
	//	Кнопка.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
	//	Кнопка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	// Иначе
	//	
	//	Для каждого Идентификатор Из Форма.ИдентификаторыСтрокТабличнойЧасти Цикл
	//		
	//		ГруппаЗначенийКИНаименование = "КонтактнаяИнформация" + Идентификатор.Значение + "ЗначенияКонтактнойИнформации";
	//		
	//		ГруппаЗначенийКИ = Элементы.Найти(ГруппаЗначенийКИНаименование);
	//		
	//		Если ГруппаЗначенийКИ <> Неопределено Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		ГруппаЗначенийКИ = Элементы.Добавить(ГруппаЗначенийКИНаименование, Тип("ГруппаФормы"), Элементы["КонтактнаяИнформация" + Идентификатор.Значение]);
	//		ГруппаЗначенийКИ.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//		ГруппаЗначенийКИ.Заголовок = НСтр("ru='Значения контактной информации'");
	//		ГруппаЗначенийКИ.Отображение = ОтображениеОбычнойГруппы.Нет;
	//		ГруппаЗначенийКИ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	//		ГруппаЗначенийКИ.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	//		ГруппаЗначенийКИ.ОтображатьЗаголовок = Ложь;
	//		
	//		Если КонтактнаяИнформацияУНФКлиентСервер.СписокВидовДляДобавленияКонтактнойИнформации(Форма).Количество() = 0 Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		ИмяКоманды = "ДобавитьПолеКонтактнойИнформации_" + Идентификатор.Значение;
	//		Команда = Форма.Команды.Добавить(ИмяКоманды);
	//		Команда.Заголовок = НСтр("ru='+ телефон, адрес'");
	//		Команда.Действие = "Подключаемый_КонтактнаяИнформацияСтоматологияВыполнитьКоманду";
	//		
	//		ГруппаДобавитьКИ = Элементы.Добавить("Группа" + ИмяКоманды, Тип("ГруппаФормы"), Элементы["КонтактнаяИнформация" + Идентификатор.Значение]);
	//		ГруппаДобавитьКИ.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//		ГруппаДобавитьКИ.Заголовок = НСтр("ru='Значения контактной информации'");
	//		ГруппаДобавитьКИ.Отображение = ОтображениеОбычнойГруппы.Нет;
	//		ГруппаДобавитьКИ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	//		ГруппаДобавитьКИ.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	//		ГруппаДобавитьКИ.ОтображатьЗаголовок = Ложь;
	//		ГруппаДобавитьКИ.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	//		
	//		Кнопка = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ГруппаДобавитьКИ);
	//		Кнопка.ИмяКоманды = ИмяКоманды;
	//		Кнопка.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
	//		Кнопка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	//	КонецЦикла;
	//	
	// КонецЕсли;
	
КонецПроцедуры

// Процедура - Добавить команду контекстного меню
//
// Параметры:
//  Форма		 - 	 - 
//  ИмяКоманды	 - 	 - 
//  Картинка	 - 	 - 
//  Заголовок	 - 	 - 
//  Подсказка	 - 	 - 
//  ПолеВладелец - 	 - 
//
Процедура ДобавитьДекорациюГиперссылки(Форма,ИмяДекорации, ИмяОбработчикаНажатия, Картинка, Подсказка, ГруппаДействий)
	
	ЭлементФормы 			 				  = Форма.Элементы.Добавить(ИмяДекорации, Тип("ДекорацияФормы"), ГруппаДействий);	
	ЭлементФормы.Вид		 				  = ВидДекорацииФормы.Картинка;
	ЭлементФормы.Гиперссылка 				  = Истина;
	ЭлементФормы.УстановитьДействие("Нажатие", ИмяОбработчикаНажатия);
	ЭлементФормы.АвтоМаксимальнаяШирина	      = Ложь;
	ЭлементФормы.РастягиватьПоГоризонтали	  = Ложь;
	ЭлементФормы.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	ЭлементФормы.Ширина	     				  = 2;
	ЭлементФормы.Высота		 				  = 1;
	ЭлементФормы.Картинка    				  = Картинка;
	ЭлементФормы.Подсказка   				  = Подсказка;
	ЭлементФормы.ОтображениеПодсказки 	   	  = ОтображениеПодсказки.Всплывающая;
	
КонецПроцедуры 


// Виды контактной информация объекта
//
// Параметры:
//  ВладелецКонтактнойИнформации - Ссылка на владельца контактной информации.
//                                 Объект владельца контактной информации.
//                                 ДанныеФормыСтруктура (по типу объекта владельца свойств).
// Возвращаемое значение:
//  ТаблицаЗначений -  виды контактной информации.
//
Функция ВидыКонтактнойИнформацияОбъекта(ВладелецКонтактнойИнформации) Экспорт
	
	Если ТипЗнч(ВладелецКонтактнойИнформации) = Тип("ДанныеФормыСтруктура") Тогда
		ТипСсылки = ТипЗнч(ВладелецКонтактнойИнформации.Ссылка)
		
	ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ВладелецКонтактнойИнформации)) Тогда
		ТипСсылки = ТипЗнч(ВладелецКонтактнойИнформации);
	Иначе
		ТипСсылки = ТипЗнч(ВладелецКонтактнойИнформации.Ссылка)
	КонецЕсли;
	
	МетаданныеСправочника = Метаданные.НайтиПоТипу(ТипСсылки);
	ПолноеИмяОбъектаМетаданных = МетаданныеСправочника.ПолноеИмя();
	ИмяГруппыВидовКИ = СтрЗаменить(ПолноеИмяОбъектаМетаданных, ".", "");
	ГруппаВидовКИ = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ВидыКонтактнойИнформации.Ссылка КАК Ссылка,
		|	ВидыКонтактнойИнформации.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|ГДЕ
		|	ВидыКонтактнойИнформации.ЭтоГруппа = ИСТИНА
		|	И ВидыКонтактнойИнформации.ПометкаУдаления = ЛОЖЬ
		|	И ВидыКонтактнойИнформации.Используется = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл 
		Если СтрСравнить(РезультатЗапроса.ИмяПредопределенныхДанных, ИмяГруппыВидовКИ) = 0 Тогда
			ГруппаВидовКИ = РезультатЗапроса.Ссылка;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ГруппаВидовКИ) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка,
	|	ВидыКонтактнойИнформации.Представление,
	|	ВидыКонтактнойИнформации.Подсказка,
	|	ВидыКонтактнойИнформации.Наименование,
	|	ВидыКонтактнойИнформации.РазрешитьВводНесколькихЗначений,
	|	ВидыКонтактнойИнформации.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	|	ВидыКонтактнойИнформации.Тип
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.Родитель = &ГруппаВидовКИ
	|	И ВидыКонтактнойИнформации.ПометкаУдаления = ЛОЖЬ
	|	И ВидыКонтактнойИнформации.Используется = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеквизитДопУпорядочивания";
	
	Запрос.УстановитьПараметр("ГруппаВидовКИ", ГруппаВидовКИ);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса;
	
КонецФункции

// Проверяет адрес на соответствие требованиям к адресной информации.
//
// Параметры:
//   АдресВXML					 - Строка -  строка XML контактной информации.
//   ПараметрыПроверки	 - Структура, СправочникСсылка.ВидыКонтактнойИнформации - флаги проверки адреса.
//          АдресТолькоРоссийский - Булево - Адрес должен быть только Российским. По умолчанию ИСТИНА.
//          ФорматАдреса - Строка - По какому классификатору проверять "КЛАДР" или "ФИАС". По умолчанию "КЛАДР".
// Возвращаемое значение:
//   Структура - содержит структуру с полями:
//        * Результат - Строка - результат проверки: "Корректный", "НеПроверен", "СодержитОшибки".
//        * СписокОшибок - СписокЗначений - Информация о ошибках.
Функция ПроверитьАдрес(Знач АдресВXML, ПараметрыПроверки = Неопределено) Экспорт
	
	Возврат УправлениеКонтактнойИнформациейСлужебныйСтоматология.ПроверитьАдресВXML(АдресВXML, ПараметрыПроверки);
	
КонецФункции

// Преобразует все входящие форматы контактной информации в XML.
//
// Параметры:
//    ЗначенияПолей - Строка, Структура, Соответствие, СписокЗначений - описание полей контактной информации.
//    Представление - Строка  - представления. Используется, если невозможно определить представление из параметра.
//                    ЗначенияПолей (отсутствие поля "Представление").
//    ОжидаемыйВид  - СправочникСсылка.ВидыКонтактнойИнформации, ПеречислениеСсылка.ТипыКонтактнойИнформации - 
//                    Используется для определения типа, если его невозможно вычислить по полю ЗначенияПолей.
//
// Возвращаемое значение:
//     Строка  - XML данные контактной информации.
//
Функция КонтактнаяИнформацияВXML(Знач ЗначенияПолей, Знач Представление = "", Знач ОжидаемыйВид = Неопределено) Экспорт
	
	Результат = УправлениеКонтактнойИнформациейСлужебныйСтоматология.ПривестиКонтактнуюИнформациюXML(Новый Структура(
		"ЗначенияПолей, Представление, ВидКонтактнойИнформации",
		ЗначенияПолей, Представление, ОжидаемыйВид));
	Возврат Результат.ДанныеXML;
	
КонецФункции
 
// Возвращает соответствующее значение перечисления "ТипыКонтактнойИнформации" по строке XML.
//
// Параметры:
//    XMLСтрока - Строка - контактная информацию.
//
// Возвращаемое значение:
//    ПеречислениеСсылка.ТипыКонтактнойИнформации - соответствующий тип.
//
Функция ТипКонтактнойИнформации(Знач XMLСтрока) Экспорт
	Возврат УправлениеКонтактнойИнформациейСлужебный.ТипКонтактнойИнформации(XMLСтрока);
КонецФункции

// Разбирает представление контактной информации и возвращает строку XML.
// Для почтовых адресов корректный разбор не гарантируется.
//
//  Параметры:
//      Представление - Строка  - строковое представление контактной информации, выводимое пользователю.
//      ОжидаемыйВид  - СправочникСсылка.ВидыКонтактнойИнформации, ПеречислениеСсылка.ТипыКонтактнойИнформации, Структура.
//
// Возвращаемое значение:
//      Строка - контактная информация в XML.
//
Функция КонтактнаяИнформацияXMLПоПредставлению(Представление, ОжидаемыйВид) Экспорт
	
	Возврат УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияXDTOВXML(
		УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияXDTOПоПредставлению(Представление, ОжидаемыйВид));
		
КонецФункции

// Получает представление контактной информации (адреса, телефона, электронной почты и т.п.).
//
// Параметры:
//    XMLСтрока               - ОбъектXDTO, Строка - объект или XML контактной информации.
//    ВидКонтактнойИнформации - Структура - дополнительные параметры формирования представления для адресов:
//      * ВключатьСтрануВПредставление - Булево - в представление будет включена страна адреса;
//      * ФорматАдреса                 - Строка - если указано "КЛАДР", то в представление адреса 
//                                                не включаются округ и внутригородской район.
//
// Возвращаемое значение:
//    Строка - представление контактной информации.
//
Функция ПредставлениеКонтактнойИнформации(Знач XMLСтрока, Знач ВидКонтактнойИнформации = Неопределено) Экспорт
	
	Возврат УправлениеКонтактнойИнформациейСлужебный.ПредставлениеКонтактнойИнформации(XMLСтрока, ВидКонтактнойИнформации);
	
КонецФункции

// Получает комментарий для контактной информации.
//
// Параметры:
//   XMLСтрока - ОбъектXDTO, Строка - объект или XML контактной информации.
//
// Возвращаемое значение:
//   Строка
//
Функция КомментарийКонтактнойИнформации(XMLСтрока) Экспорт
	
	ЭтоСтрока = ТипЗнч(XMLСтрока) = Тип("Строка");
	Если ЭтоСтрока И Не УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВXML(XMLСтрока) Тогда
		// Предыдущий формат значений полей, комментарий отсутствует.
		Возврат "";
	КонецЕсли;
	
	ОбъектXDTO = ?(ЭтоСтрока, УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзXML(XMLСтрока), XMLСтрока);
	Возврат ОбъектXDTO.Комментарий;
	
КонецФункции

// Получает комментарий для контактной информации.
//
// Параметры:
//   XMLСтрока   - ОбъектXDTO, Строка - объект или XML контактной информации. 
//   Комментарий - Строка - новое значение комментария.
//
//
Процедура УстановитьКомментарийКонтактнойИнформации(XMLСтрока, Знач Комментарий) Экспорт
	
	ЭтоСтрока = ТипЗнч(XMLСтрока) = Тип("Строка");
	Если ЭтоСтрока И Не УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВXML(XMLСтрока) Тогда
		// Предыдущий формат значений полей, комментарий отсутствует.
		Возврат;
	КонецЕсли;
	
	ОбъектXDTO = ?(ЭтоСтрока, УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзXML(XMLСтрока), XMLСтрока);
	ОбъектXDTO.Комментарий = Комментарий;
	Если ЭтоСтрока Тогда
		XMLСтрока = УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияXDTOВXML(ОбъектXDTO);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает информацию о стране адреса.
// Если переданная строка не содержит информации об адресе, то будет вызвано исключение.
//
// Параметры:
//    XMLСтрока - Строка - XML контактной информации.
//
// Возвращаемое значение:
//    Структура - описание страны адреса. Содержит поля:
//        * Ссылка             - СправочникСсылка.СтраныМира, Неопределено - соответствующий элемент страны мира.
//        * Наименование       - Строка - часть описания страны.
//        * Код                - Строка - часть описания страны.
//        * НаименованиеПолное - Строка - часть описания страны.
//        * КодАльфа2          - Строка - часть описания страны.
//        * КодАльфа3          - Строка - часть описания страны.
//
// Если передана пустая строка, то возвращается пустая структура.
// Если страна не найдена в справочнике, то но найдена в классификаторе, то поле "Ссылка" результата не заполнено.
// Если страна не найдена ни в адресе, ни в классификаторе, то будет заполнено только поле "Наименование".
//
Функция СтранаАдресаКонтактнойИнформации(Знач XMLСтрока) Экспорт
	
	Результат = Новый Структура("Ссылка, Код, Наименование, НаименованиеПолное, КодАльфа2, КодАльфа3");
	Если ПустаяСтрока(XMLСтрока) Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Читаем наименование страны
	ПространствоИмен = УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ПространствоИмен();
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLСтрока);
	XDTOАдрес = ФабрикаXDTO.ПрочитатьXML(Чтение, ФабрикаXDTO.Тип(ПространствоИмен, "КонтактнаяИнформация"));
	Адрес = XDTOАдрес.Состав;
	Если Адрес = Неопределено Или Адрес.Тип() <> ФабрикаXDTO.Тип(ПространствоИмен, "Адрес") Тогда
		ВызватьИсключение НСтр("ru='Невозможно определить страну, ожидается адрес.';en='Unable to determine country expected address.'");
	КонецЕсли;
	
	Результат.Наименование = СокрЛП(Адрес.Страна);
	ДанныеСтраны = Справочники.СтраныМира.ДанныеСтраныМира(, Результат.Наименование);
	Возврат ?(ДанныеСтраны = Неопределено, Результат, ДанныеСтраны);
КонецФункции

// Возвращает наименование субъекта РФ для адреса или пустую строку, если субъект не определен.
// Если переданная строка не содержит информации об адресе, то будет вызвано исключение.
//
// Параметры:
//    XMLСтрока - Строка - XML контактной информации.
//
// Возвращаемое значение:
//    Строка - наименование
//
Функция РегионАдресаКонтактнойИнформации(Знач XMLСтрока) Экспорт
	
	Если ПустаяСтрока(XMLСтрока) Тогда
		Возврат "";
	КонецЕсли;
	
	ПространствоИмен = УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ПространствоИмен();
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLСтрока);
	XDTOАдрес = ФабрикаXDTO.ПрочитатьXML(Чтение, ФабрикаXDTO.Тип(ПространствоИмен, "КонтактнаяИнформация"));
	Адрес = XDTOАдрес.Состав;
	Если Адрес = Неопределено Или Адрес.Тип() <> ФабрикаXDTO.Тип(ПространствоИмен, "Адрес") Тогда
		ВызватьИсключение НСтр("ru='Невозможно определить субъекта РФ, ожидается адрес.';en='Cannot determine the subject RF expected address.'");
	КонецЕсли;
	
	АдресРФ = УправлениеКонтактнойИнформациейСлужебныйСтоматология.РоссийскийАдрес(Адрес);
	Возврат ?(АдресРФ = Неопределено, "", СокрЛП(АдресРФ.СубъектРФ));
	
КонецФункции

// Возвращает наименование города для адреса РФ или пустую строку для иностранного адреса.
// Если переданная строка не содержит информации об адресе, то будет вызвано исключение.
//
// Параметры:
//    XMLСтрока - Строка - XML контактной информации.
//
// Возвращаемое значение:
//    Строка - наименование
//
Функция ГородАдресаКонтактнойИнформации(Знач XMLСтрока) Экспорт
	
	Если ПустаяСтрока(XMLСтрока) Тогда
		Возврат "";
	КонецЕсли;
	
	ПространствоИмен = УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ПространствоИмен();
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLСтрока);
	XDTOАдрес = ФабрикаXDTO.ПрочитатьXML(Чтение, ФабрикаXDTO.Тип(ПространствоИмен, "КонтактнаяИнформация"));
	Адрес = XDTOАдрес.Состав;
	Если Адрес = Неопределено Или Адрес.Тип() <> ФабрикаXDTO.Тип(ПространствоИмен, "Адрес") Тогда
		ВызватьИсключение НСтр("ru='Невозможно определить город, ожидается адрес.';en='Unable to determine city expected address.'");
	КонецЕсли;
	
	АдресРФ = УправлениеКонтактнойИнформациейСлужебныйСтоматология.РоссийскийАдрес(Адрес);
	Возврат ?(АдресРФ = Неопределено, "", СокрЛП(АдресРФ.Город));
	
КонецФункции

// Возвращает домен сетевого адреса для веб-ссылки или адреса электронной почты.
//
// Параметры:
//    XMLСтрока - Строка - XML контактной информации.
//
// Возвращаемое значение:
//    Строка - требуемое значение.
//
Функция ДоменАдресаКонтактнойИнформации(Знач XMLСтрока) Экспорт
	Если ПустаяСтрока(XMLСтрока) Тогда
		Возврат "";
	КонецЕсли;
	
	ПространствоИмен = УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ПространствоИмен();
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLСтрока);
	XDTOАдрес = ФабрикаXDTO.ПрочитатьXML(Чтение, ФабрикаXDTO.Тип(ПространствоИмен, "КонтактнаяИнформация"));
	Состав = XDTOАдрес.Состав;
	Если Состав <> Неопределено Тогда
		Тип = Состав.Тип();
		Если Тип = ФабрикаXDTO.Тип(ПространствоИмен, "ВебСайт") Тогда
			ДоменАдреса = СокрЛП(Состав.Значение);
			Позиция = СтрНайти(ДоменАдреса, ":// ");
			Если Позиция > 0 Тогда
				ДоменАдреса = Сред(ДоменАдреса, Позиция + 3);
			КонецЕсли;
			Позиция = СтрНайти(ДоменАдреса, "/");
			Возврат ?(Позиция = 0, ДоменАдреса, Лев(ДоменАдреса, Позиция - 1));
			
		ИначеЕсли Тип = ФабрикаXDTO.Тип(ПространствоИмен, "ЭлектроннаяПочта") Тогда
			ДоменАдреса = СокрЛП(Состав.Значение);
			Позиция = СтрНайти(ДоменАдреса, "@");
			Возврат ?(Позиция = 0, ДоменАдреса, Сред(ДоменАдреса, Позиция + 1));
			
		КонецЕсли;
	КонецЕсли;
	
	ВызватьИсключение НСтр("ru='Невозможно определить домен, ожидается электронная почта или веб-ссылка.';en='Unable to determine the domain the expected electronic postoffice or web link.'");	
КонецФункции

// Возвращает строку с номером телефона без кода и дополнительного номера.
//
// Параметры:
//    XMLСтрока - Строка - XML контактной информации.
//
// Возвращаемое значение:
//    Строка - требуемое значение.
//
Функция НомерТелефонаКонтактнойИнформации(Знач XMLСтрока) Экспорт
	Если ПустаяСтрока(XMLСтрока) Тогда
		Возврат "";
	КонецЕсли;
	
	ПространствоИмен = УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ПространствоИмен();
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLСтрока);
	XDTOАдрес = ФабрикаXDTO.ПрочитатьXML(Чтение, ФабрикаXDTO.Тип(ПространствоИмен, "КонтактнаяИнформация"));
	Состав = XDTOАдрес.Состав;
	Если Состав <> Неопределено Тогда
		Тип = Состав.Тип();
		Если Тип = ФабрикаXDTO.Тип(ПространствоИмен, "НомерТелефона") Тогда
			Возврат СокрЛП(Состав.Номер);
			
		ИначеЕсли Тип = ФабрикаXDTO.Тип(ПространствоИмен, "НомерФакса") Тогда
			Возврат СокрЛП(Состав.Номер);
			
		КонецЕсли;
	КонецЕсли;
	
	ВызватьИсключение НСтр("ru='Невозможно определить номер, ожидается телефона или факс.';en='Unable to determine number expected phone or fax.'");
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////////////

// Определяет данные страны по справочнику стран или классификатору ОКСМ.
//
// Параметры:
//    КодСтраны    - Строка, Число - код ОКСМ страны. Если не указано, то поиск по коду не производится.
//    Наименование - Строка - Наименование страны. Если не указано, то поиск по наименованию не производится.
//
// Возвращаемое значение:
//    Структура - описание страны. Содержит поля:
//        * Ссылка             - СправочникСсылка.СтраныМира, Неопределено - соответствующий элемент страны мира.
//        * Наименование       - Строка - часть описания страны.
//        * Код                - Строка - часть описания страны.
//        * НаименованиеПолное - Строка - часть описания страны.
//        * КодАльфа2          - Строка - часть описания страны.
//        * КодАльфа3          - Строка - часть описания страны.
//    Неопределено - страна не найдена ни в адресе, ни в классификаторе.
//
Функция ДанныеСтраныМира(Знач КодСтраны = Неопределено, Знач Наименование = Неопределено) Экспорт
	Возврат Справочники.СтраныМира.ДанныеСтраныМира(КодСтраны, Наименование);
КонецФункции

// Определяет данные страны по классификатору ОКСМ.
//
// Параметры:
// Параметры:
//    Код - Строка, Число - код ОКСМ страны.
//    ТипКода - Строка - Варианты: КодСтраны (по умолчанию), Альфа2, Альфа3.
//
// Возвращаемое значение:
//    Структура - описание страны. Содержит поля:
//        * Наименование       - Строка - часть описания страны.
//        * Код                - Строка - часть описания страны.
//        * НаименованиеПолное - Строка - часть описания страны.
//        * КодАльфа2          - Строка - часть описания страны.
//        * КодАльфа3          - Строка - часть описания страны.
//    Неопределено - страна не найдена в классификаторе.
//
Функция ДанныеКлассификатораСтранМираПоКоду(Знач Код, Знач ТипКода = "КодСтраны") Экспорт
	Возврат Справочники.СтраныМира.ДанныеКлассификатораСтранМираПоКоду(Код, ТипКода);
КонецФункции

// Определяет данные страны по классификатору ОКСМ.
//
// Параметры:
//    Наименование - Строка - наименование страны.
//
// Возвращаемое значение:
//    Структура - описание страны. Содержит поля:
//        * Наименование       - Строка - часть описания страны.
//        * Код                - Строка - часть описания страны.
//        * НаименованиеПолное - Строка - часть описания страны.
//        * КодАльфа2          - Строка - часть описания страны.
//        * КодАльфа3          - Строка - часть описания страны.
//    Неопределено - страна не найдена в классификаторе.
//
Функция ДанныеКлассификатораСтранМираПоНаименованию(Знач Наименование) Экспорт
	Возврат Справочники.СтраныМира.ДанныеКлассификатораСтранМираПоНаименованию(Наименование);
КонецФункции

// Получить значение определенного вида контактной информации у объекта.
//
// Параметры:
//     Ссылка                  - ЛюбаяСсылка - ссылка на объект-владелец контактной информации (организация,
//                                             контрагент, партнер и т.д.).
//     ВидКонтактнойИнформации - СправочникСсылка.ВидыКонтактнойИнформации - параметры обработки.
//
// Возвращаемое значение:
//     Строка - строковое представление значения.
//
Функция КонтактнаяИнформацияОбъекта(Ссылка, ВидКонтактнойИнформации, Дата = Неопределено) Экспорт
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Ссылка);
	
	КонтактнаяИнформацияОбъекта = КонтактнаяИнформацияОбъектов(МассивОбъектов,, ВидКонтактнойИнформации, Дата);
	
	Если КонтактнаяИнформацияОбъекта.Количество() > 0 Тогда
		Возврат КонтактнаяИнформацияОбъекта[0].Представление;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Предназначена для создания временной таблицы с контактной информацией нескольких объектов.
//
// Параметры:
//    МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - для формирования.
//    МассивОбъектов - Массив - владельцы контактной информации, все элементы должны быть одного типа.
//    ТипыКИ         - Массив - необязательный, используется если не задан все типы.
//    ВидыКИ         - Массив - необязательный, используется если не задан все виды.
//    Дата           - Дата   - необязательный, дата с которой действует запись контактной информации,
//                              используется при хранении истории изменения контактной информации.
//                              Если владелец хранит историю изменений, то при несоответствии параметра
//                              дате будет вызвано исключение.
//
// В менеджере создается временная таблица ВТКонтактнаяИнформация с полями:
//    * Объект        - Ссылка - владелец КИ.
//    * Вид           - СправочникСсылка.ВидыКонтактнойИнформации
//    * Тип           - ПеречислениеСсылка.ТипыКонтактнойИнформации
//    * ЗначенияПолей - Строка - данные значений полей.
//    * Представление - Строка - представление КИ.
//
Процедура СоздатьВТКонтактнаяИнформация(МенеджерВременныхТаблиц, МассивОбъектов, ТипыКИ = Неопределено, ВидыКИ = Неопределено, Дата = Неопределено) Экспорт
	
	Если ТипЗнч(МассивОбъектов) = Тип("Массив") И МассивОбъектов.Количество() > 0 Тогда
		Ссылка = МассивОбъектов.Получить(0);
	Иначе
		ВызватьИсключение НСтр("ru='Неверное значение для массива владельцев контактной информации.';en='Invalid value for array owners contact information.'");
	КонецЕсли;
	
	МетаданныеОбъекта = Ссылка.Метаданные();
	Если МетаданныеОбъекта.ТабличныеЧасти.Найти("КонтактнаяИнформация") = Неопределено Тогда
		ВызватьИсключение  МетаданныеОбъекта.Имя + " " + НСтр("ru='не содержит контактную информацию.';en='does not contain contact information.'");
	КонецЕсли;
	
	Если МетаданныеОбъекта.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.Найти("ДействуетС") <> Неопределено Тогда
		Если ТипЗнч(Дата) <> Тип("Дата") Тогда
			Дата = ТекущаяДатаСеанса();
		КонецЕсли;

		УсловияОтбора = ?(ВидыКИ = Неопределено, "", " КонтактнаяИнформация.Вид В (&ВидыКИ)");
		Если ПустаяСтрока(УсловияОтбора) Тогда
			УсловиеИ = "";
		Иначе
			УсловиеИ = " И ";
		КонецЕсли;
		УсловияОтбора = УсловияОтбора + ?(ТипыКИ = Неопределено, "", УсловиеИ + " КонтактнаяИнформация.Тип В (&ТипыКИ)");
		Если НЕ ПустаяСтрока(УсловияОтбора) Тогда
			УсловияОтбора = " ГДЕ " + УсловияОтбора;
		КонецЕсли;
			
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	КонтактнаяИнформация.Ссылка КАК Объект,
				|	КонтактнаяИнформация.Вид КАК Вид,
				|	МАКСИМУМ(КонтактнаяИнформация.ДействуетС) КАК ДействуетС
				|ПОМЕСТИТЬ СрезКонтактнойИнформации
				|ИЗ
				|	" + МетаданныеОбъекта.ПолноеИмя() + ".КонтактнаяИнформация КАК КонтактнаяИнформация
				|ГДЕ
				|	КонтактнаяИнформация.Ссылка В (&МассивОбъектов)
				|	И КонтактнаяИнформация.ДействуетС <= &ДействуетС
				|	И КонтактнаяИнформация.Вид <> ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПустаяСсылка)
				|
				|СГРУППИРОВАТЬ ПО
				|	КонтактнаяИнформация.Вид, КонтактнаяИнформация.Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	КонтактнаяИнформация.Ссылка КАК Объект,
				|	КонтактнаяИнформация.Вид КАК Вид,
				|	КонтактнаяИнформация.Тип КАК Тип,
				|	КонтактнаяИнформация.ДействуетС КАК ДействуетС,
				|	КонтактнаяИнформация.Представление КАК Представление,
				|	КонтактнаяИнформация.ЗначенияПолей
				|ПОМЕСТИТЬ ВТКонтактнаяИнформация
				|ИЗ
				|	СрезКонтактнойИнформации КАК СрезКонтактнойИнформации
				|		ЛЕВОЕ СОЕДИНЕНИЕ " + МетаданныеОбъекта.ПолноеИмя() + ".КонтактнаяИнформация КАК КонтактнаяИнформация
				|		ПО СрезКонтактнойИнформации.Вид = КонтактнаяИнформация.Вид
				|			И СрезКонтактнойИнформации.ДействуетС = КонтактнаяИнформация.ДействуетС
				|			И СрезКонтактнойИнформации.Объект = КонтактнаяИнформация.Ссылка " + УсловияОтбора);
				
				Запрос.УстановитьПараметр("ДействуетС", Дата);
	Иначе
		Дата = "";
		Запрос = Новый Запрос("
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КонтактнаяИнформация.Ссылка КАК Объект,
			|	КонтактнаяИнформация.Вид КАК Вид,
			|	КонтактнаяИнформация.Тип КАК Тип,
			|	КонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей, " + Дата + "
			|	КонтактнаяИнформация.Представление КАК Представление
			|ПОМЕСТИТЬ ВТКонтактнаяИнформация
			|ИЗ
			|	" + МетаданныеОбъекта.ПолноеИмя() + ".КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.Ссылка В (&МассивОбъектов)
			|	И КонтактнаяИнформация.Вид <> ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПустаяСсылка)
			|	" + ?(ТипыКИ = Неопределено, "", "И КонтактнаяИнформация.Тип В (&ТипыКИ)") + "
			|	" + ?(ВидыКИ = Неопределено, "", "И КонтактнаяИнформация.Вид В (&ВидыКИ)") + "
			|");
			
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ТипыКИ", ТипыКИ);
	Запрос.УстановитьПараметр("ВидыКИ", ВидыКИ);
	
	Запрос.Выполнить();
КонецПроцедуры

// Предназначена для получения контактной информации для нескольких объектов.
//
// Параметры:
//    МассивОбъектов - Массив - владельцы контактной информации, все элементы должны быть одного типа.
//    ТипыКИ         - Массив - необязательный, используется если не задан все типы.
//    ВидыКИ         - Массив -  необязательный, используется если не задан все виды.
//    Дата           - Дата   - необязательный, дата с которой действует запись контактной информации,
//                              используется при хранении истории изменения контактной информации.
//                              Если владелец хранит историю изменений, то при несоответствии параметра
//                              дате будет вызвано исключение.
//
// Возвращаемое значение
//    Таблица значений - результат. Колонки:
//        * Объект        - Ссылка - владелец КИ.
//        * Вид           - СправочникСсылка.ВидыКонтактнойИнформации
//        * Тип           - ПеречислениеСсылка.ТипыКонтактнойИнформации
//        * ЗначенияПолей - Строка - данные значений полей.
//        * Представление - Строка - представление КИ.
//        * ДействуетС    - Дата   - Дата с которой действует запись контактной информации,
//                                   поле присутствует только для владельцев контактной
//                                   информации которые хранят историю изменений.
//
Функция КонтактнаяИнформацияОбъектов(МассивОбъектов, ТипыКИ = Неопределено, ВидыКИ = Неопределено, Дата = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ТипЗнч(МассивОбъектов) = Тип("Массив") И МассивОбъектов.Количество() > 0 Тогда
		Ссылка = МассивОбъектов.Получить(0);
	Иначе
		ВызватьИсключение НСтр("ru='Неверное значение для массива владельцев контактной информации.';en='Invalid value for array owners contact information.'");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТКонтактнаяИнформация(Запрос.МенеджерВременныхТаблиц, МассивОбъектов, ТипыКИ, ВидыКИ, Дата);
	
	Если ТипЗнч(Дата) = Тип("Дата") Тогда
		ДействуетС = " КонтактнаяИнформация.ДействуетС КАК ДействуетС, ";
	Иначе
		ДействуетС = "";
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект КАК Объект,
		|	КонтактнаяИнформация.Вид КАК Вид,
		|	КонтактнаяИнформация.Тип КАК Тип,
		|	КонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей, " + ДействуетС + "
		|	КонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	ВТКонтактнаяИнформация КАК КонтактнаяИнформация";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Процедура - Установить значения реквизитов проверки
//
// Параметры:
//  Объект				 - 	 - 
//  НастройкиПроверки	 - 	 - 
//
Процедура УстановитьЗначенияРеквизитовПроверки(Объект, НастройкиПроверки = Неопределено)
	
	Объект.ПроверятьКорректность = ?(НастройкиПроверки = Неопределено, Ложь, НастройкиПроверки.ПроверятьКорректность);
	Если Объект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		Объект.ПроверятьПоФИАС       = ?(НастройкиПроверки = Неопределено, Ложь, НастройкиПроверки.ПроверятьПоФИАС);
	КонецЕсли;
	
	Объект.АдресТолькоРоссийский = Ложь;
	Объект.ВключатьСтрануВПредставление = Ложь;
	Объект.СкрыватьНеактуальныеАдреса = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//////////////////////////////////////////////////////////////////////////////// 
// Инициализация элементов на форме объект-владельца контактной информации.

// Процедура - Добавить описание элемента
//
// Параметры:
//  Форма		 - 	 - 
//  ИмяЭлемента	 - 	 - 
//  Приоритет	 - 	 - 
//  ЭтоКоманда	 - 	 - 
//
Процедура ДобавитьОписаниеЭлемента(Форма, ИмяЭлемента, Приоритет, ЭтоКоманда = Ложь, ИмяЭлементаДляРазмещения = Неопределено)
	
	// Форма.ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяЭлемента, Приоритет, ЭтоКоманда);
	Если НЕ ИмяЭлементаДляРазмещения = Неопределено Тогда 
		ПараметрыКонтактнойИнформацииЭлемента = Форма.ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения]; // см. ПараметрыВыводаКонтактнойИнформации
		ПараметрыКонтактнойИнформацииЭлемента.ДобавленныеЭлементы.Добавить(ИмяЭлемента, Приоритет, Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Добавить строку контактной информации
//
// Параметры:
//  Форма				 - 	 - 
//  Результат			 - 	 - 
//  ЭтоНовыйВидКИ		 - 	 - 
//  КоличествоАдресов	 - 	 - 
//  СледующаяСтрока		 - 	 - 
//
Процедура ДобавитьСтрокуКонтактнойИнформации(Форма, Результат, ИмяЭлементаДляРазмещения, ЭтоНовыйВидКИ = Ложь, КоличествоАдресов = Неопределено, СледующаяСтрока = Неопределено)
	
	ДобавлениеНовогоЗначения = ТипЗнч(Результат) = Тип("Структура");
	
	Если ДобавлениеНовогоЗначения Тогда
		Результат.Свойство("ИмяЭлементаДляРазмещения", ИмяЭлементаДляРазмещения);		
		ДобавляемыйВид = Результат.ДобавляемыйВид;
		Если ТипЗнч(ДобавляемыйВид)= Тип("СправочникСсылка.ВидыКонтактнойИнформации") Тогда
			// ИнформацияОВидеКИ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДобавляемыйВид, "Тип, Наименование, РедактированиеТолькоВДиалоге, Подсказка, МногострочноеПоле");
			ИнформацияОВидеКИ = ПрочитатьСвойстваВидаКонтактнойИнформации_ДляСовместимости(ДобавляемыйВид);
		Иначе
			Если ТипЗнч(ДобавляемыйВид) = Тип("Структура") И ДобавляемыйВид.Свойство("Ссылка") Тогда
				ИнформацияОВидеКИ = ПрочитатьСвойстваВидаКонтактнойИнформации_ДляСовместимости(ДобавляемыйВид.Ссылка);
				Для Каждого КлючИЗначение ИЗ ДобавляемыйВид Цикл 
					ИнформацияОВидеКИ.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
				КонецЦикла;	
			Иначе 	
				ИнформацияОВидеКИ = ДобавляемыйВид;
			КонецЕсли;	
			ДобавляемыйВид    = ДобавляемыйВид.Ссылка;
		КонецЕсли;
	Иначе
		ИнформацияОВидеКИ = Результат;
		ДобавляемыйВид    = Результат.Вид;
	КонецЕсли;
	
	ТаблицаКонтактнойИнформации = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов;
	ОтборПоВиду = Новый Структура("Вид, ЭтоИсторическаяКонтактнаяИнформация", ДобавляемыйВид, Ложь);
	
	Если ДобавлениеНовогоЗначения Тогда
		
		НайденныеСтроки = ТаблицаКонтактнойИнформации.НайтиСтроки(ОтборПоВиду);
		
		КоличествоСтрокВида = НайденныеСтроки.Количество();
		Если КоличествоСтрокВида > 0 Тогда
			ПоследняяСтрока = НайденныеСтроки.Получить(КоличествоСтрокВида - 1);
			ИндексДобавляемойСтроки = ТаблицаКонтактнойИнформации.Индекс(ПоследняяСтрока) + 1;
		Иначе
			ИндексДобавляемойСтроки = 0;
		КонецЕсли;
		
		ЭтоПоследняяСтрока = Ложь;
		Если ИндексДобавляемойСтроки = ТаблицаКонтактнойИнформации.Количество() Тогда
			ЭтоПоследняяСтрока = Истина;
		Иначе
			ИмяСледующегоРеквизита = ТаблицаКонтактнойИнформации[ИндексДобавляемойСтроки].ИмяРеквизита;
		КонецЕсли;
		
		НоваяСтрока  = ТаблицаКонтактнойИнформации.Вставить(ИндексДобавляемойСтроки);
		ИмяРеквизита = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1%2%3",
			"КонтактнаяИнформацияПоле",
			СтрЗаменить(ДобавляемыйВид.УникальныйИдентификатор(), "-", "x"),
			КоличествоСтрокВида + 1);
		НоваяСтрока.ИмяРеквизита              = ИмяРеквизита;
		НоваяСтрока.Вид                       = ДобавляемыйВид;
		НоваяСтрока.Тип                       = ИнформацияОВидеКИ.Тип;
		НоваяСтрока.ИмяЭлементаДляРазмещения  = ИмяЭлементаДляРазмещения;
		НоваяСтрока.ЭтоРеквизитТабличнойЧасти = Ложь;
		
		ПараметрыКонтактнойИнформации = ПараметрыКонтактнойИнформацииФормы(Форма.ПараметрыКонтактнойИнформации, ИмяЭлементаДляРазмещения);
		ОбработкаНавигационнойСсылки = ПараметрыКонтактнойИнформации.ОбработкаНавигационнойСсылки;
		
		Если ОбработкаНавигационнойСсылки = Истина Тогда
			ОписаниеТипаРеквизита = Новый ОписаниеТипов("ФорматированнаяСтрока");
		Иначе
			ОписаниеТипаРеквизита = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500));
		КонецЕсли;
		
		МассивДобавляемыхРеквизитов = Новый Массив;
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизита, ОписаниеТипаРеквизита,, ИнформацияОВидеКИ.Наименование, Истина));
		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		ЕстьКомментарий = Ложь;
		ОбязательноеЗаполнение = Ложь;
	Иначе
		ЭтоПоследняяСтрока = СледующаяСтрока = Неопределено;
		Если Не ЭтоПоследняяСтрока Тогда
			ИмяСледующегоРеквизита = СледующаяСтрока.ИмяРеквизита;
		КонецЕсли;
		ИмяРеквизита = ИнформацияОВидеКИ.ИмяРеквизита;
		ЕстьКомментарий = ЗначениеЗаполнено(ИнформацияОВидеКИ.Комментарий);
		ОбязательноеЗаполнение = ИнформацияОВидеКИ.ОбязательноеЗаполнение;
	КонецЕсли;
	
	ЗаголовокСлева = ЗаголовокСлева(Форма.ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения].ПоложениеЗаголовка);
	
	// Отрисовка на форме
	Если ЗаголовокСлева Тогда
		ГруппаЗаголовков = Форма.Элементы.ГруппаЗаголовковКонтактнойИнформации;
		Заголовок = Заголовок(Форма, ИнформацияОВидеКИ, ИмяРеквизита, ГруппаЗаголовков, ЭтоНовыйВидКИ, ИмяЭлементаДляРазмещения);
		
		Если Не ЭтоПоследняяСтрока Тогда
			СледующийЗаголовок = Форма.Элементы["Заголовок" + ИмяСледующегоРеквизита];
			Форма.Элементы.Переместить(Заголовок, ГруппаЗаголовков, СледующийЗаголовок);
			
			Если ЕстьКомментарий Тогда
		
				ИмяЗаглушки = "ЗаглушкаЗаголовка" + ИмяРеквизита;
				Заглушка = Форма.Элементы.Добавить(ИмяЗаглушки, Тип("ДекорацияФормы"), ГруппаЗаголовков);
				ПараметрыКонтактнойИнформации = ПараметрыКонтактнойИнформацииФормы(Форма.ПараметрыКонтактнойИнформации, ИмяЭлементаДляРазмещения);
				ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяЗаглушки, 2);				
				Форма.Элементы.Переместить(Заглушка, ГруппаЗаголовков, СледующийЗаголовок);
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ГруппаПолейВвода = Форма.Элементы.ГруппаПолейВводаКонтактнойИнформации;
	ГруппаПолейВводаГоризонтальная = Группа("ГруппаПолейВводаКонтактнойИнформацииГоризонтальная_" + ИмяРеквизита,
	Форма, ГруппаПолейВвода, ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная, 3, ИмяЭлементаДляРазмещения);
	
	// ГруппаСтроки = СоздатьГруппуКнопкиДобавленияКонтакта("Группа" + ИмяРеквизита, Форма, ДобавляемыйВид.Наименование, ИмяЭлементаДляРазмещения);
	//
	// Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
	//	ГруппаСтроки.ОтображатьЗаголовок = Истина;
	// КонецЕсли;
	
	Родитель = Родитель(Форма, ИмяЭлементаДляРазмещения);
	// Если Не ЭтоПоследняяСтрока Тогда
	//	Если СледующаяСтрока = Неопределено Тогда
	//		ИмяСледующейГруппы = "Группа" + ПоследняяСтрока.ИмяРеквизита;
	//		Если Форма.Элементы.Найти(ИмяСледующейГруппы) <> Неопределено Тогда
	//			ИндексСледующейГруппы = Родитель.ПодчиненныеЭлементы.Индекс(Форма.Элементы[ИмяСледующейГруппы]) + 1;
	//			СледующаяГруппа = Родитель.ПодчиненныеЭлементы.Получить(ИндексСледующейГруппы);
	//		КонецЕсли;
	//	Иначе
	//		ИмяГруппы = "Группа" + СледующаяСтрока.ИмяРеквизита;
	//		Если Форма.Элементы.Найти(ИмяГруппы) <> Неопределено Тогда
	//			СледующаяГруппа = Форма.Элементы[ИмяГруппы];
	//		КонецЕсли;
	//	КонецЕсли;
	//	Форма.Элементы.Переместить(ГруппаСтроки, Родитель, СледующаяГруппа);
	// ИначеЕсли ДобавлениеНовогоЗначения Тогда
	//	СледующаяГруппа = Форма.Элементы[Результат.ИмяКоманды].Родитель;
	//	Форма.Элементы.Переместить(ГруппаСтроки, Родитель, СледующаяГруппа);
	// КонецЕсли;
	
	// Обработка ситуации, когда на форме выводится одновременно множественная динамическая и статическая контактная информация.
	ИмяСледующейГруппыТекущегоВида = "Группа" + ИмяРеквизита;
	Если Форма.Элементы.Найти(ИмяСледующейГруппыТекущегоВида) <> Неопределено Тогда
		
		Отбор = Новый Структура("ИмяРеквизита", ИмяРеквизита);
		НайденныеСтрокиТекущегоВида = ТаблицаКонтактнойИнформации.НайтиСтроки(Отбор);
		Если НайденныеСтрокиТекущегоВида.Количество() > 0 Тогда
			ТекущийВид = НайденныеСтрокиТекущегоВида[0].Вид;
		КонецЕсли;
		
		ИндексПредыдущейГруппыВида = Родитель.ПодчиненныеЭлементы.Индекс(Форма.Элементы[ИмяСледующейГруппыТекущегоВида]) - 1;
		Если ИндексПредыдущейГруппыВида >= 0 Тогда
			ПредыдущаяГруппаВида = Родитель.ПодчиненныеЭлементы.Получить(ИндексПредыдущейГруппыВида);
			
			Если ПредыдущаяГруппаВида <> Неопределено Тогда
			
			Отбор = Новый Структура("ИмяРеквизита", СтрЗаменить(ПредыдущаяГруппаВида.Имя, "Группа", ""));
			НайденныеСтрокиПредыдущегоВида = ТаблицаКонтактнойИнформации.НайтиСтроки(Отбор);
			Если НайденныеСтрокиПредыдущегоВида.Количество() > 0 Тогда
				ПредыдущийВид = НайденныеСтрокиПредыдущегоВида[0].Вид;
			КонецЕсли;
			
			Если ТекущийВид <> ПредыдущийВид Тогда
				ЭтоНовыйВидКИ = Истина;
			КонецЕсли;
			КонецЕсли;
		Иначе
			ЭтоНовыйВидКИ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ПолеВвода = СоздатьПолеВвода(Форма, ГруппаПолейВводаГоризонтальная, ИнформацияОВидеКИ, ИмяРеквизита, ИмяЭлементаДляРазмещения, ЭтоНовыйВидКИ, ОбязательноеЗаполнение);
	
	Если Не ЭтоПоследняяСтрока Тогда
		Если СледующаяСтрока = Неопределено Тогда       // ГруппаПолейВводаКонтактнойИнформацииГоризонтальная_КонтактнаяИнформацияПоле
			ИмяСледующегоЭлемента = "ГруппаПолейВводаКонтактнойИнформацииГоризонтальная_" + ПоследняяСтрока.ИмяРеквизита;
			Если Форма.Элементы.Найти(ИмяСледующегоЭлемента) <> Неопределено Тогда
				ИндексСледующегоЭлемента = ГруппаПолейВвода.ПодчиненныеЭлементы.Индекс(Форма.Элементы[ИмяСледующегоЭлемента]) + 1;
				СледующийЭлемент = ГруппаПолейВвода.ПодчиненныеЭлементы.Получить(ИндексСледующегоЭлемента);
			КонецЕсли;

			// ИмяСледующегоЭлемента = ПоследняяСтрока.ИмяРеквизита;
			// Если ЗначениеЗаполнено(ПоследняяСтрока.Комментарий) Тогда
			//	ИмяСледующегоЭлемента = "Комментарий" + ИмяСледующегоЭлемента;
			// КонецЕсли;
			// ИндексСледующегоЭлемента = ГруппаПолейВвода.ПодчиненныеЭлементы.Индекс(Форма.Элементы[ИмяСледующегоЭлемента]) + 1;
			// СледующийЭлемент = ГруппаПолейВвода.ПодчиненныеЭлементы.Получить(ИндексСледующегоЭлемента);
		Иначе
			ИмяГруппы = "ГруппаПолейВводаКонтактнойИнформацииГоризонтальная_" + СледующаяСтрока.ИмяРеквизита;
			Если Форма.Элементы.Найти(ИмяГруппы) <> Неопределено Тогда
				СледующийЭлемент = Форма.Элементы[ИмяГруппы];
			КонецЕсли;
			
			// СледующийЭлемент = Форма.Элементы[СледующаяСтрока.ИмяРеквизита];
		КонецЕсли;
		Форма.Элементы.Переместить(ГруппаПолейВводаГоризонтальная, ГруппаПолейВвода, СледующийЭлемент);
	КонецЕсли;
	
	//// ----------------------------------------------------------
	//
	//// Отрисовка на форме
	// ГруппаСтроки = Группа("Группа" + ИмяРеквизита, Форма, ДобавляемыйВид.Наименование, ИмяЭлементаДляРазмещения);
	//
	// Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
	//	ГруппаСтроки.ОтображатьЗаголовок = Истина;
	// КонецЕсли;
	//
	// Если Не ЭтоПоследняяСтрока Тогда
	//	Если СледующаяСтрока = Неопределено Тогда
	//		ИмяСледующейГруппы = "Группа" + ПоследняяСтрока.ИмяРеквизита;
	//		Если Форма.Элементы.Найти(ИмяСледующейГруппы) <> Неопределено Тогда
	//			ИндексСледующейГруппы = Родитель.ПодчиненныеЭлементы.Индекс(Форма.Элементы[ИмяСледующейГруппы]) + 1;
	//			СледующаяГруппа = Родитель.ПодчиненныеЭлементы.Получить(ИндексСледующейГруппы);
	//		КонецЕсли;
	//	Иначе
	//		ИмяГруппы = "Группа" + СледующаяСтрока.ИмяРеквизита;
	//		Если Форма.Элементы.Найти(ИмяГруппы) <> Неопределено Тогда
	//			СледующаяГруппа = Форма.Элементы[ИмяГруппы];
	//		КонецЕсли;
	//	КонецЕсли;
	//	Форма.Элементы.Переместить(ГруппаСтроки, Родитель, СледующаяГруппа);
	// ИначеЕсли ДобавлениеНовогоЗначения Тогда
	//	СледующаяГруппа = Форма.Элементы[Результат.ИмяКоманды].Родитель;
	//	Форма.Элементы.Переместить(ГруппаСтроки, Родитель, СледующаяГруппа);
	// КонецЕсли;
	//
	//// ----------------------------------------------------------
	
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		ПолеВвода.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	ГруппаДействий = Форма.Элементы.ГруппаДействийКонтактнойИнформации;
	Если КоличествоАдресов = Неопределено Тогда
		ОтборПоТипу = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
		КоличествоАдресов = ТаблицаКонтактнойИнформации.НайтиСтроки(ОтборПоТипу).Количество();
	КонецЕсли;
	
	ИмяДействия = "Команда" + ИмяСледующегоРеквизита;
	ИмяЗаглушки = "ДекорацияВерх" + ИмяСледующегоРеквизита;
	
	Если Форма.Элементы.Найти(ИмяЗаглушки) <> Неопределено Тогда
		ИмяСледующегоДействия = ИмяЗаглушки;
	ИначеЕсли Форма.Элементы.Найти(ИмяДействия) <> Неопределено Тогда
		ИмяСледующегоДействия = ИмяДействия;
	Иначе
		ИмяСледующегоДействия = "ЗаглушкаДействия" + ИмяСледующегоРеквизита;
	КонецЕсли;
		
	// Если ЕстьКомментарий Тогда
	//	ПолеВвода.РасширеннаяПодсказка.Заголовок              = ИнформацияОВидеКИ.Комментарий;
	//	ПолеВвода.РасширеннаяПодсказка.АвтоМаксимальнаяШирина = Ложь;
	//	ПолеВвода.РасширеннаяПодсказка.МаксимальнаяШирина     = ПолеВвода.Ширина;
	//	ПолеВвода.РасширеннаяПодсказка.Ширина                 = ПолеВвода.Ширина;
	// КонецЕсли;
	
	// Выводим комментарий
	Если ЕстьКомментарий Тогда
		ИмяКомментария = "Комментарий" + ИмяРеквизита;
		Комментарий = Комментарий(Форма, Результат.Комментарий, ИмяКомментария, ГруппаПолейВвода, ИмяЭлементаДляРазмещения);
		Если Не ЭтоПоследняяСтрока Тогда
			Если ЗначениеЗаполнено(ПоследняяСтрока) Тогда
				ИмяСледующегоЭлемента = ПоследняяСтрока.ИмяРеквизита;
				
				Если ЗначениеЗаполнено(ПоследняяСтрока.Комментарий) Тогда
					ИмяСледующегоЭлемента = "Комментарий" + ИмяСледующегоЭлемента;
				КонецЕсли;
				
				ИндексСледующегоЭлемента = ГруппаПолейВвода.ПодчиненныеЭлементы.Индекс(Форма.Элементы[ИмяСледующегоЭлемента]) + 1;
				СледующийЭлемент = ГруппаПолейВвода.ПодчиненныеЭлементы.Получить(ИндексСледующегоЭлемента);
			Иначе
				Если СледующаяСтрока <> Неопределено Тогда
					СледующийЭлемент = Форма.Элементы[СледующаяСтрока.ИмяРеквизита];
				Иначе
					СледующийЭлемент = Неопределено;
				КонецЕсли;
			КонецЕсли;
			Форма.Элементы.Переместить(Комментарий, ГруппаПолейВвода, СледующийЭлемент);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЭтоПоследняяСтрока Тогда
		СледующееДействие = Форма.Элементы.Найти(ИмяСледующегоДействия);
	Иначе
		СледующееДействие = Неопределено;
	КонецЕсли;
	
	Если КоличествоАдресов = Неопределено Тогда
		ОтборПоТипу = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
		КоличествоАдресов = ТаблицаКонтактнойИнформации.НайтиСтроки(ОтборПоТипу).Количество();
	КонецЕсли;
	
	СоздатьДействие(Форма, ИнформацияОВидеКИ, ИмяРеквизита, ГруппаДействий, КоличествоАдресов, ЕстьКомментарий, ИмяЭлементаДляРазмещения, СледующееДействие);
	
	Если Не ЭтоНовыйВидКИ Тогда
		Если ТаблицаКонтактнойИнформации.Количество() > 1 И ТаблицаКонтактнойИнформации[0].Свойство("ЭтоИсторическаяКонтактнаяИнформация") Тогда
			ПунктКонтекстногоМенюПеремещения(ПолеВвода, Форма, 1, ИмяЭлементаДляРазмещения);
			НайденныеСтроки = ТаблицаКонтактнойИнформации.НайтиСтроки(ОтборПоВиду);
			Если НайденныеСтроки.Количество() > 1 Тогда
				ПредыдущаяСтрока = НайденныеСтроки.Получить(НайденныеСтроки.Количество() - 2);
				ПунктКонтекстногоМенюПеремещения(Форма.Элементы[ПредыдущаяСтрока.ИмяРеквизита], Форма, - 1, ИмяЭлементаДляРазмещения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ДобавлениеНовогоЗначения Тогда
		Форма.ТекущийЭлемент = Форма.Элементы[ИмяРеквизита];
		Если ИнформацияОВидеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес
			И ИнформацияОВидеКИ.ВидРедактирования = "Диалог" Тогда
			Результат.Вставить("ЭлементФормыАдреса", ИмяРеквизита);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Создать реквизиты контактной информации
//
// Параметры:
//  Форма						 - 	 - 
//  ДобавляемыеРеквизиты		 - 	 - 
//  ИмяОбъекта					 - 	 - 
//  ИсключаемыеВиды				 - 	 - 
//  КонтактнаяИнформация		 - 	 - 
//  ОтложеннаяИнициализация		 - 	 - 
//  ОбработкаНавигационнойСсылки - 	 - 
//
Процедура СоздатьРеквизитыКонтактнойИнформации(Знач Форма, Знач ДобавляемыеРеквизиты, Знач ИмяОбъекта, Знач ИсключаемыеВиды,
	Знач КонтактнаяИнформация, Знач ОтложеннаяИнициализация, Знач ОбработкаНавигационнойСсылки)
	
	Строка1500           = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1500));
	ФорматированнаяСтрока = Новый ОписаниеТипов("ФорматированнаяСтрока");
	
	СозданныеРеквизиты = ОбщегоНазначения.СкопироватьРекурсивно(ИсключаемыеВиды);
	ПредыдущийВид      = Неопределено;
	ПорядковыйНомер    = 1;
	
	Для Каждого ОбъектКонтактнойИнформации Из КонтактнаяИнформация Цикл
		
		Если ОбъектКонтактнойИнформации.ПометкаУдаления И ПустаяСтрока(ОбъектКонтактнойИнформации.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбъектКонтактнойИнформации.ЭтоРеквизитТабличнойЧасти Тогда
			
			ИмяВидаКИ = ОбъектКонтактнойИнформации.ИмяПредопределенногоВида;
			Позиция = СтрНайти(ИмяВидаКИ, ИмяОбъекта);
			ИмяТабличнойЧасти = Сред(ИмяВидаКИ, Позиция + СтрДлина(ИмяОбъекта));
			
			ПредыдущийВид = Неопределено;
			ИмяРеквизита = "";
			
			ОбъектКонтактнойИнформации.Строки.Сортировать("РеквизитДопУпорядочивания");
			
			Для Каждого СтрокаКИ Из ОбъектКонтактнойИнформации.Строки Цикл
				
				ТекущийВид = СтрокаКИ.Вид;
				Если ТекущийВид <> ПредыдущийВид Тогда
					
					ИмяРеквизита = "КонтактнаяИнформацияПоле" + ИмяТабличнойЧасти + СтрЗаменить(ТекущийВид.УникальныйИдентификатор(), "-", "x")
						+ ОбъектКонтактнойИнформации.Строки.Индекс(СтрокаКИ);
					ПутьРеквизитов = "Объект." + ИмяТабличнойЧасти;
					
					ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяРеквизита, Строка1500, ПутьРеквизитов, СтрокаКИ.Наименование, Истина));
					ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяРеквизита + "Значение", Новый ОписаниеТипов("Строка"), ПутьРеквизитов,, Истина));
					ПредыдущийВид = ТекущийВид;
					
				КонецЕсли;
				
				СтрокаКИ.ИмяРеквизита = ИмяРеквизита;
				
			КонецЦикла;
			
		Иначе
			
			Если ОбъектКонтактнойИнформации.ЭтоИсторическаяКонтактнаяИнформация Тогда
				СкорректироватьКонтактнуюИнформацию(Форма, ОбъектКонтактнойИнформации);
				Продолжить;
			КонецЕсли;
			
			ТекущийВид = ОбъектКонтактнойИнформации.Вид;
			
			Если ТекущийВид <> ПредыдущийВид Тогда
				ПредыдущийВид = ТекущийВид;
				ПорядковыйНомер = 1;
			Иначе
				ПорядковыйНомер = ПорядковыйНомер + 1;
			КонецЕсли;
			
			Индекс = СозданныеРеквизиты.Найти(ТекущийВид);
			Если Индекс = Неопределено Тогда
				ОбъектКонтактнойИнформации.ИмяРеквизита = "КонтактнаяИнформацияПоле" + СтрЗаменить(ТекущийВид.УникальныйИдентификатор(), "-", "x")
					+ ПорядковыйНомер;
				Если Не ОтложеннаяИнициализация Тогда
					
					ТипРеквизита = Строка1500;
					Если ОбъектКонтактнойИнформации.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница И ОбработкаНавигационнойСсылки Тогда
						ТипРеквизита = ФорматированнаяСтрока;
					КонецЕсли;
					
					ДобавляемыеРеквизиты.Добавить(
						Новый РеквизитФормы(ОбъектКонтактнойИнформации.ИмяРеквизита, ТипРеквизита,, ОбъектКонтактнойИнформации.Наименование, Истина));
				КонецЕсли;
			Иначе
				ОбъектКонтактнойИнформации.ИмяРеквизита = "КонтактнаяИнформацияПоле" + ОбъектКонтактнойИнформации.ИмяПредопределенногоВида;
				СозданныеРеквизиты.Удалить(Индекс);
			КонецЕсли;
			
			СкорректироватьКонтактнуюИнформацию(Форма, ОбъектКонтактнойИнформации);
		КонецЕсли;
	КонецЦикла;
	
	// Добавим новые реквизиты
	Если ДобавляемыеРеквизиты.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	КонецЕсли;

КонецПроцедуры

// Процедура - Удалить описание элемента
//
// Параметры:
//  Форма		 - 	 - 
//  ИмяЭлемента	 - 	 - 
//
Процедура УдалитьОписаниеЭлемента(Форма, ИмяЭлемента, ИмяЭлементаДляРазмещения)
	
	ДобавленныеЭлементы = Форма.ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения].ДобавленныеЭлементы;
	НайденнаяСтрока = ДобавленныеЭлементы.НайтиПоЗначению(ИмяЭлемента);
	ДобавленныеЭлементы.Удалить(НайденнаяСтрока);
	
КонецПроцедуры

// Процедура, УдалитьАдресИзОбязательныхПолей.
//
Процедура УдалитьАдресИзОбязательныхПолей(СвойстваВидовКонтактнойИнформации)
	
	НайденныеСтроки = СвойстваВидовКонтактнойИнформации.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
	
	Если НайденныеСтроки.Количество() > 0 Тогда		
		НайденныеСтроки[0].ВыводитьВФормеВсегда = Ложь;		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Скрыть контактную информацию
//
// Параметры:
//  Форма				 - 	 - 
//  ДобавляемыеРеквизиты - 	 - 
//  ПараметрыВывода		 - 	 - 
//
Процедура СкрытьКонтактнуюИнформацию(Знач Форма, Знач ДобавляемыеРеквизиты, ПараметрыВывода)
	
	Если ДобавляемыеРеквизиты.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	КонецЕсли;
	ДобавленныеРеквизиты = Новый Массив;
	Для Каждого ДобавляемыйРеквизит Из ДобавляемыеРеквизиты Цикл
		Если ПустаяСтрока(ДобавляемыйРеквизит.Путь) Тогда
			ДобавленныеРеквизиты.Добавить(ДобавляемыйРеквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыКонтактнойИнформации = ПараметрыВыводаКонтактнойИнформации(Форма, ПараметрыВывода.ИмяЭлементаДляРазмещения,
		ПараметрыВывода.ПоложениеЗаголовкаКИ, ПараметрыВывода.ОтложеннаяИнициализация,
		ПараметрыВывода.ИсключаемыеВиды, ПараметрыВывода.СкрываемыеВиды);
		
	ПараметрыКонтактнойИнформации.ДобавленныеРеквизиты = ДобавленныеРеквизиты;
	ПараметрыКонтактнойИнформации.Владелец             = ПараметрыВывода.СсылкаНаОбъект;
	
	Если Не ПустаяСтрока(ПараметрыВывода.ИмяЭлементаДляРазмещения) Тогда
		Форма.Элементы[ПараметрыВывода.ИмяЭлементаДляРазмещения].Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Скорректировать контактную информацию
//
// Параметры:
//  Форма	 - 	 - 
//  СтрокаКИ - 	 - 
//
Процедура СкорректироватьКонтактнуюИнформацию(Форма, СтрокаКИ)
	
	РезультатПреобразования = Новый Структура;
	
	Если ПустаяСтрока(СтрокаКИ.Значение) Тогда
		
		Если ПустаяСтрока(СтрокаКИ.Представление) И ЗначениеЗаполнено(СтрокаКИ.ЗначенияПолей) Тогда
			СтрокаКИ.Представление = УправлениеКонтактнойИнформациейСлужебный.ПредставлениеКонтактнойИнформации(СтрокаКИ.ЗначенияПолей, СтрокаКИ.Вид);
		КонецЕсли;
		
		Результат = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзXML(СтрокаКИ.ЗначенияПолей, СтрокаКИ.Вид, РезультатПреобразования, СтрокаКИ.Представление);
		СтрокаКИ.Комментарий = ?(ЗначениеЗаполнено(Результат.Комментарий), Результат.Комментарий, "");
		
		Если РезультатПреобразования.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
			
		Если Не РезультатПреобразования.Свойство("СведенияИсправлены") ИЛИ РезультатПреобразования.СведенияИсправлены = Ложь Тогда
			Возврат;
		КонецЕсли;
		
		Если РезультатПреобразования.СведенияИсправлены Тогда
			СтрокаКИ.ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(Результат);
		КонецЕсли;

		Если РезультатПреобразования.Свойство("ТекстОшибки") Тогда
			ОбщегоНазначения.СообщитьПользователю(РезультатПреобразования.ТекстОшибки, , СтрокаКИ.ИмяРеквизита);
		КонецЕсли;
		
		Форма.Модифицированность = Истина;
	Иначе
		СтрокаКИ.Комментарий = УправлениеКонтактнойИнформацией.КомментарийКонтактнойИнформации(СтрокаКИ.Значение);
		Если ПустаяСтрока(СтрокаКИ.Представление) Тогда
			СтрокаКИ.Представление = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(СтрокаКИ.Значение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Добавить кнопку дополнительного поля контактной информации
//
// Параметры:
//  Форма					 - 	 - 
//  ИмяЭлементаДляРазмещения - 	 - 
//
Процедура ДобавитьКнопкуДополнительногоПоляКонтактнойИнформации(Знач Форма, Знач ИмяЭлементаДляРазмещения)
	
	Описание = НСтр("ru = 'Добавить дополнительное поле контактной информации'");
	ГруппаКоманды             = СоздатьГруппуКнопкиДобавленияКонтакта("ГруппаКонтактнаяИнформацияДобавитьПолеВвода" + ИмяЭлементаДляРазмещения, Форма, Описание, ИмяЭлементаДляРазмещения);
	ГруппаКоманды.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	
	ИмяКоманды          = "КонтактнаяИнформацияДобавитьПолеВвода" + ИмяЭлементаДляРазмещения;
	Команда             = Форма.Команды.Добавить(ИмяКоманды);
	Команда.Подсказка   = Описание;
	Команда.Отображение = ОтображениеКнопки.Текст;
	Команда.Картинка    = БиблиотекаКартинок.ДобавитьЭлементСписка;
	Команда.Действие    = "Подключаемый_КонтактнаяИнформацияВыполнитьКоманду";
	
	ПараметрыКонтактнойИнформацииЭлемента = Форма.ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения]; // см. ПараметрыВыводаКонтактнойИнформации
	ПараметрыКонтактнойИнформацииЭлемента.ДобавленныеЭлементы.Добавить(ИмяКоманды, 9, Истина);
	
	Кнопка             = Форма.Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"), Форма.Элементы.КомандыДобавленияКонтактнойИнформации);
	Кнопка.Доступность = НЕ Форма.Элементы[ИмяЭлементаДляРазмещения].ТолькоПросмотр;
	Кнопка.Заголовок   = НСтр("ru = '+ Добавить контакт'");
	Кнопка.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;	
	Команда.ИзменяетСохраняемыеДанные = Истина;
	Кнопка.ИмяКоманды                 = ИмяКоманды;
	Если Форма.ИмяФормы = "Справочник.Сотрудники.Форма.ФормаЭлемента" Тогда
		Кнопка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	КонецЕсли;	
	ПараметрыКонтактнойИнформацииЭлемента.ДобавленныеЭлементы.Добавить(ИмяКоманды, 2, Ложь);

КонецПроцедуры

// Процедура - Добавить пояснение по сбросу настроек формы
//
// Параметры:
//  Форма					 - 	 - 
//  ИмяЭлементаДляРазмещения - 	 - 
//  ОтложеннаяИнициализация	 - 	 - 
//
Процедура ДобавитьПояснениеПоСбросуНастроекФормы(Знач Форма, Знач ИмяЭлементаДляРазмещения, Знач ОтложеннаяИнициализация)
	
	ГруппаДляРазмещения = Форма.Элементы[ИмяЭлементаДляРазмещения];
	// Если отложенная инициализация и на странице нет элементов, то платформа скрывает страницу,
	// поэтому надо создавать временный элемент, который при переходе на страницу удаляется.
	Если ОтложеннаяИнициализация
		И ГруппаДляРазмещения.Вид = ВидГруппыФормы.Страница 
		И Форма.Элементы.Найти("КонтактнаяИнформацияЗаглушка") = Неопределено Тогда
		
		ГруппаСтраниц = ГруппаДляРазмещения.Родитель; // ГруппаФормы
		ЗаголовокСтраницы = ?(ЗначениеЗаполнено(ГруппаДляРазмещения.Заголовок), ГруппаДляРазмещения.Заголовок, ГруппаДляРазмещения.Имя);
		ЗаголовокГруппыСтраниц = ?(ЗначениеЗаполнено(ГруппаСтраниц.Заголовок), ГруппаСтраниц.Заголовок, ГруппаСтраниц.Имя);
		
		ПредупреждениеОРазмещении = НСтр("ru = 'Для отображения контактной информации необходимо разместить группу ""%1"" не первым элементом (после любой другой группы) в группе ""%2"" (меню Еще - Изменить форму).'");
		ПредупреждениеОРазмещении = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПредупреждениеОРазмещении,
		ЗаголовокСтраницы, ЗаголовокГруппыСтраниц);
		ТекстПодсказки = НСтр("ru = 'Также можно установить стандартные настройки формы:
		|   • в меню Еще выбрать пункт Изменить форму...;
		|   • в открывшейся форме ""Настройка формы"" в меню Еще выбрать пункт ""Установить стандартные настройки"".'");
		
		Декорация = Форма.Элементы.Добавить("КонтактнаяИнформацияЗаглушка", Тип("ДекорацияФормы"), ГруппаДляРазмещения);
		Декорация.Заголовок              = ПредупреждениеОРазмещении;
		Декорация.ОтображениеПодсказки   = ОтображениеПодсказки.Кнопка;
		Декорация.Подсказка              = ТекстПодсказки;
		Декорация.ЦветТекста             = ЦветаСтиля.ПоясняющийОшибкуТекст;
		Декорация.АвтоМаксимальнаяВысота = Ложь;
	КонецЕсли;

КонецПроцедуры

// Процедура - Конвертация контактной информации ВJSON
//
// Параметры:
//  КонтактнаяИнформация - 	 - 
//
Процедура КонвертацияКонтактнойИнформацииВJSON(КонтактнаяИнформация)
	
	// Конвертация
	Для Каждого СтрокаКИ Из КонтактнаяИнформация Цикл
		Если ПустаяСтрока(СтрокаКИ.Значение) Тогда
			Если ЗначениеЗаполнено(СтрокаКИ.ЗначенияПолей) Тогда
				КонтактнаяИнформацияПоПолям = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияВСтруктуруJSON(СтрокаКИ.ЗначенияПолей,
				СтрокаКИ.Тип, СтрокаКИ.Представление, Ложь);
				СтрокаКИ.Значение = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(КонтактнаяИнформацияПоПолям);
			ИначеЕсли ЗначениеЗаполнено(СтрокаКИ.Представление) Тогда
				Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон ИЛИ СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Факс Тогда
					ЗначенияПолей = Новый СписокЗначений;
					УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(СтрокаКИ.Представление, ЗначенияПолей);
					СтрокаКИ.Значение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(СтрокаКИ.Представление, СтрокаКИ.Тип);
				Иначе 	
					СтрокаКИ.Значение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(СтрокаКИ.Представление, СтрокаКИ.Тип);
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Возвращает параметры контактной информации на форме
// 
// Параметры:
// 	ПараметрыКонтактнойИнформации - см. ПараметрыВыводаКонтактнойИнформации
// 	ИмяЭлементаДляРазмещения - Строка, Неопределено - 
// 	
// Возвращаемое значение:
//  см. ПараметрыВыводаКонтактнойИнформации
// 	
Функция ПараметрыКонтактнойИнформацииФормы(ПараметрыКонтактнойИнформации, ИмяЭлементаДляРазмещения)
	
	Если НЕ ЗначениеЗаполнено(ИмяЭлементаДляРазмещения) ИЛИ НЕ ПараметрыКонтактнойИнформации.Свойство(ИмяЭлементаДляРазмещения) Тогда
		Для каждого ПерваяЗапись Из ПараметрыКонтактнойИнформации Цикл
			Возврат ПерваяЗапись.Значение;
		КонецЦикла;
		Возврат ПараметрыКонтактнойИнформации;
	КонецЕсли;
	
	Возврат ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения];
	
КонецФункции

// Функция - Создать поле ввода
//
// Параметры:
//  Форма					 - 	 - 
//  Родитель				 - 	 - 
//  ИнформацияОВидеКИ		 - 	 - 
//  ИмяРеквизита			 - 	 - 
//  ИмяЭлементаДляРазмещения - 	 - 
//  ЭтоНовыйВидКИ			 - 	 - 
//  ОбязательноеЗаполнение	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьПолеВвода(Форма, Родитель, ИнформацияОВидеКИ, ИмяРеквизита, ИмяЭлементаДляРазмещения,ЭтоНовыйВидКИ = Ложь, ОбязательноеЗаполнение = Ложь)
	
	ПараметрыКонтактнойИнформации = ПараметрыКонтактнойИнформацииФормы(Форма.ПараметрыКонтактнойИнформации, ИмяЭлементаДляРазмещения);
	ОбработкаНавигационнойСсылки = ПараметрыКонтактнойИнформации.ОбработкаНавигационнойСсылки;
	
	// Создаем картинку
	// --------------------------------------------------------------------------------------------		
	ДекорацияДействие = Форма.Элементы.Добавить("ИконкаКИ_" + ИмяРеквизита, Тип("ДекорацияФормы"), Родитель);
	ДекорацияДействие.Вид						 = ВидДекорацииФормы.Картинка;
	ДекорацияДействие.Картинка					 = КартинкаДействияПоТипуКонтактнойИнформации(ИнформацияОВидеКИ.Тип);
	ДекорацияДействие.АвтоМаксимальнаяШирина	 = Ложь;
	ДекорацияДействие.РастягиватьПоГоризонтали	 = Ложь;
	ДекорацияДействие.Ширина					 = 2;
	ДекорацияДействие.Высота					 = 1;
	
	Если ИнформацияОВидеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон
		И Справочники.ТелефонныеАппараты.ПроверитьВозможностьЗвонкаНаДанномПК() Тогда
		
		ДекорацияДействие.Гиперссылка = Истина;
		ДекорацияДействие.УстановитьДействие("Нажатие", "Подключаемый_ДействиеКИНажатие");
		ДекорацияДействие.Подсказка = "Позвонить";
		ДекорацияДействие.ОтображениеПодсказки = ОтображениеПодсказки.Всплывающая;
		
	КонецЕсли;
	
	// Создаем надпись
	// --------------------------------------------------------------------------------------------		
	ДекорацияНадпись = Форма.Элементы.Добавить("ВидКИ_" + ИмяРеквизита, Тип("ДекорацияФормы"), Родитель);
	ДекорацияНадпись.Ширина 				= 6;
	ДекорацияНадпись.АвтоМаксимальнаяШирина = Ложь;
	ДекорацияНадпись.Заголовок				= ИнформацияОВидеКИ.Наименование;
	
	
	ЗаголовокСлева = ЗаголовокСлева(ПараметрыКонтактнойИнформации.ПоложениеЗаголовка);
	Элемент = Форма.Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), Родитель); // РасширениеПоляФормыДляПоляВвода, РасширениеПоляФормыДляПоляНадписи
	Элемент.ПутьКДанным = ИмяРеквизита;
	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	Если ИнформацияОВидеКИ.ВидРедактирования = "Диалог" И ИнформацияОВидеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		Элемент.Вид = ВидПоляФормы.ПолеНадписи;
		Элемент.Гиперссылка = Истина;
		Элемент.УстановитьДействие("Нажатие", "Подключаемый_КонтактнаяИнформацияПриНажатии");
		Если ПустаяСтрока(Форма[ИмяРеквизита]) Тогда
			Форма[ИмяРеквизита] = УправлениеКонтактнойИнформациейКлиентСервер.ТекстПустогоАдресаВВидеГиперссылки();
		КонецЕсли;
		
	ИначеЕсли ИнформацияОВидеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница И ОбработкаНавигационнойСсылки Тогда
		
		Элемент.Вид = ВидПоляФормы.ПолеНадписи;
		Элемент.УстановитьДействие("ОбработкаНавигационнойСсылки", "Подключаемый_КонтактнаяИнформацияОбработкаНавигационнойСсылки");
		
		Если ТипЗнч(ИнформацияОВидеКИ) <> Тип("Структура") И УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВJSON(ИнформацияОВидеКИ.Значение) Тогда
			КонтактнаяИнформация = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(ИнформацияОВидеКИ.Значение, Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
			АдресСайта    = КонтактнаяИнформация.value;
			Представление = ?(КонтактнаяИнформация.Свойство("name") И ЗначениеЗаполнено(КонтактнаяИнформация.name), КонтактнаяИнформация.name, ИнформацияОВидеКИ.Представление);
		Иначе
			АдресСайта = "";
			Представление = УправлениеКонтактнойИнформациейКлиентСервер.ТекстПустогоАдресаВВидеГиперссылки();
		КонецЕсли;
		
		Форма[ИмяРеквизита] = УправлениеКонтактнойИнформациейКлиентСервер.АдресСайта(Представление, АдресСайта);
	Иначе
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Если ИнформацияОВидеКИ.ВидРедактирования = "Диалог" Тогда
			Элемент.РедактированиеТекста = Ложь;
		КонецЕсли;
		Элемент.УстановитьДействие("Очистка",         "Подключаемый_КонтактнаяИнформацияОчистка");
		
		Если ИнформацияОВидеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
			Элемент.УстановитьДействие("Автоподбор",      "Подключаемый_КонтактнаяИнформацияАвтоподбор");
			Элемент.УстановитьДействие("ОбработкаВыбора", "Подключаемый_КонтактнаяИнформацияОбработкаВыбора");
		КонецЕсли;
		Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
			Элемент.МногострочныйРежим = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Элемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	Элемент.РастягиватьПоГоризонтали = Ложь;
	Элемент.РастягиватьПоВертикали = Ложь;
	
	// Элемент.ВысотаЗаголовка = ?(ОбщегоНазначения.ЭтоМобильныйКлиент(), 1, 2);
	//
	// Если ИнформацияОВидеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
	//	Если ИнформацияОВидеКИ.ВидРедактирования = "ПолеВвода" Тогда
	//		Элемент.Ширина = 72;
	//	Иначе
	//		Элемент.Ширина = 70;
	//	КонецЕсли;
	//	
	// ИначеЕсли ИнформацияОВидеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Другое Тогда
	//	Если ИнформацияОВидеКИ.ВидПоляДругое = "МногострочноеШирокое" Тогда
	//		Элемент.Высота = 3;
	//		Элемент.Ширина = 70;
	//		Элемент.МногострочныйРежим = Истина;
	//	ИначеЕсли ИнформацияОВидеКИ.ВидПоляДругое = "ОднострочноеШирокое" Тогда
	//		Элемент.Высота = 1;
	//		Элемент.Ширина = 70;
	//		Элемент.МногострочныйРежим = Ложь;
	//	Иначе // ОднострочноеУзкое
	//		Элемент.Высота = 1;
	//		Элемент.Ширина = 35;
	//		Элемент.МногострочныйРежим = Ложь;
	//	КонецЕсли;
	// Иначе
	//	Элемент.Ширина = 35;
	// КонецЕсли;
	//
	// Если Не ЭтоНовыйВидКИ Тогда
	//	Элемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	//	Элемент.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветФонаФормы;
	// КонецЕсли;
	//
	// Элемент.ПоложениеЗаголовка = ?(ЗаголовокСлева, ПоложениеЗаголовкаЭлементаФормы.Лево, ПоложениеЗаголовкаЭлементаФормы.Верх);
	// Если ЗаголовокСлева Тогда
	//	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	// Иначе
	//	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	// КонецЕсли;
	
	ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяРеквизита, 2, Ложь);
	
	// Устанавливаем свойства поля ввода.
	Если ИнформацияОВидеКИ.Тип <> Перечисления.ТипыКонтактнойИнформации.Другое И Не ИнформацияОВидеКИ.ПометкаУдаления Тогда
		// Ввод комментария через контекстное меню.
		ИмяКоманды = "КонтекстноеМеню" + ИмяРеквизита;
		Кнопка = Форма.Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"), Элемент.КонтекстноеМеню);
		Кнопка.Заголовок = НСтр("ru = 'Ввести комментарий'");
		Команда = Форма.Команды.Добавить(ИмяКоманды);
		Команда.Подсказка = НСтр("ru = 'Ввести комментарий'");
		Команда.Картинка = БиблиотекаКартинок.Комментарий;
		Команда.Действие = "Подключаемый_КонтактнаяИнформацияВыполнитьКоманду";
		Команда.ИзменяетСохраняемыеДанные = Истина;
		Кнопка.ИмяКоманды = ИмяКоманды;
		
		ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 1);
		ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 9, Истина);
	КонецЕсли;
	
	Если ИнформацияОВидеКИ.ХранитьИсториюИзменений И Не ИнформацияОВидеКИ.ПометкаУдаления Тогда
		// Вывод истории контактной информации через контекстное меню.
		ИмяКоманды = "КонтекстноеМенюИстория" + ИмяРеквизита;
		Кнопка = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элемент.КонтекстноеМеню);
		Кнопка.Заголовок = НСтр("ru = 'История изменений...'");
		Команда = Форма.Команды.Добавить(ИмяКоманды);
		Команда.Картинка = БиблиотекаКартинок.ИсторияИзменений;
		Команда.Подсказка = НСтр("ru = 'Показывает историю изменения контактной информации'");
		Команда.Действие = "Подключаемый_КонтактнаяИнформацияВыполнитьКоманду";
		Команда.ИзменяетСохраняемыеДанные = Ложь;
		Кнопка.ИмяКоманды = ИмяКоманды;
		
		ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 1);
		ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 9, Истина);
	КонецЕсли;
	
	Если ИнформацияОВидеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		ГруппаРазделительКарты = Форма.Элементы.Добавить("ПодменюРазделительКонтекстКарты" + ИмяРеквизита, Тип("ГруппаФормы"), Элемент.КонтекстноеМеню);
		ГруппаРазделительКарты.Вид = ВидГруппыФормы.ГруппаКнопок;
		
		ИмяКоманды = "КонтекстноеМенюКартаЯндекс" + ИмяРеквизита;
		Кнопка = Форма.Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"), ГруппаРазделительКарты);
		Кнопка.Заголовок = НСтр("ru = 'Адрес на Яндекс.Картах'");
		Команда = Форма.Команды.Добавить(ИмяКоманды);
		Команда.Картинка = БиблиотекаКартинок.ЯндексКарты;
		Команда.Подсказка = НСтр("ru = 'Показывает адрес на картах Яндекс.Карты'");
		Команда.Действие = "Подключаемый_КонтактнаяИнформацияВыполнитьКоманду";
		Кнопка.ИмяКоманды = ИмяКоманды;
		
		ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 1);
		ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 9, Истина);
		
		ИмяКоманды = "КонтекстноеМенюКартаGoogle" + ИмяРеквизита;
		Кнопка = Форма.Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"), ГруппаРазделительКарты);
		Кнопка.Заголовок = НСтр("ru = 'Адрес на Google Maps'");
		Команда = Форма.Команды.Добавить(ИмяКоманды);
		Команда.Картинка = БиблиотекаКартинок.GoogleMaps;
		Команда.Подсказка = НСтр("ru = 'Показывает адрес на карте Google Maps'");
		Команда.Действие = "Подключаемый_КонтактнаяИнформацияВыполнитьКоманду";
		Кнопка.ИмяКоманды = ИмяКоманды;
		
		ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 1);
		ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 9, Истина);
		
		ГруппКнопокРазделитель = Форма.Элементы.Добавить("ПодменюРазделительКарты" + ИмяРеквизита, Тип("ГруппаФормы"), Элемент.КонтекстноеМеню);
		ГруппКнопокРазделитель.Вид = ВидГруппыФормы.ГруппаКнопок;
		
		Если Не ИнформацияОВидеКИ.ПометкаУдаления Тогда
			// Заполнить
			ГруппаПодменюАдреса = Форма.Элементы.Добавить("КонтекстноеПодменюКопироватьАдреса" + ИмяРеквизита, Тип("ГруппаФормы"), ГруппКнопокРазделитель);
			ГруппаПодменюАдреса.Вид = ВидГруппыФормы.Подменю;
			ГруппаПодменюАдреса.Отображение = ОтображениеКнопки.Текст;
			ГруппаПодменюАдреса.Заголовок = НСтр("ru = 'Заполнить'");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбязательноеЗаполнение И ЭтоНовыйВидКИ И Элемент.Вид = ВидПоляФормы.ПолеВвода Тогда
		Элемент.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	// Редактирование в диалоге
	Если ДляТипаКонтактнойИнформацииДоступноРедактированиеВДиалоге(ИнформацияОВидеКИ.Тип)
		И Элемент.Вид = ВидПоляФормы.ПолеВвода Тогда
		
		ДоступенВыбор = Не ИнформацияОВидеКИ.ПометкаУдаления И ИнформацияОВидеКИ.ВидРедактирования <> "ПолеВвода";
		Элемент.КнопкаВыбора = ДоступенВыбор;
		Если ДоступенВыбор Тогда
			Элемент.УстановитьДействие("НачалоВыбора", "Подключаемый_КонтактнаяИнформацияНачалоВыбора");
		КонецЕсли;
		
	КонецЕсли;
	Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_КонтактнаяИнформацияПриИзменении");
	
	Если ИнформацияОВидеКИ.ПометкаУдаления Тогда
		
		Элемент.ШрифтЗаголовка = ШрифтыСтиля.ЗаголовокУдаленногоРеквизитаШрифт;
		Если Не ИнформацияОВидеКИ.ВидРедактирования = "Диалог" Тогда
			Элемент.КнопкаОчистки        = Истина;
			Элемент.РедактированиеТекста = Ложь;
		Иначе
			Элемент.ТолькоПросмотр       = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Элемент;
	
КонецФункции

// Функция - Заголовок
//
// Параметры:
//  Форма				 - 	 - 
//  ИнформацияОВидеКИ	 - 	 - 
//  ИмяРеквизита		 - 	 - 
//  ГруппаЗаголовков	 - 	 - 
//  ЭтоНовыйВидКИ		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Заголовок(Форма, ИнформацияОВидеКИ, ИмяРеквизита, ГруппаЗаголовков, ЭтоНовыйВидКИ = Ложь, ИмяЭлементаДляРазмещения)
	
	ИмяЗаголовка = "Заголовок" + ИмяРеквизита;
	Элемент = Форма.Элементы.Добавить(ИмяЗаголовка, Тип("ДекорацияФормы"), ГруппаЗаголовков);
	Элемент.Заголовок = ?(ЭтоНовыйВидКИ, ИнформацияОВидеКИ.Наименование + ":", "");
	
	Если ИнформацияОВидеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Другое Тогда
		Элемент.Высота = ?(ИнформацияОВидеКИ.МногострочноеПоле, 5, 1);
		Элемент.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Верх;
	Иначе
		Элемент.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Центр;
	КонецЕсли;
	
	ДобавитьОписаниеЭлемента(Форма, ИмяЗаголовка, 2, , ИмяЭлементаДляРазмещения);
	
	Возврат Элемент;
	
КонецФункции

// Функция - Заголовок слева
//
// Параметры:
//  ПоложениеЗаголовкаКИ - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЗаголовокСлева(Знач ПоложениеЗаголовкаКИ = Неопределено)
	
	Если ЗначениеЗаполнено(ПоложениеЗаголовкаКИ) Тогда
		Если ТипЗнч(ПоложениеЗаголовкаКИ) = Тип("Строка") Тогда 
			ПоложениеЗаголовкаКИ = ПоложениеЗаголовкаЭлементаФормы[ПоложениеЗаголовкаКИ];
		Иначе 	
			ПоложениеЗаголовкаКИ = ПредопределенноеЗначение(ПоложениеЗаголовкаКИ);
		КонецЕсли;	
	Иначе
		ПоложениеЗаголовкаКИ = ПоложениеЗаголовкаЭлементаФормы.Верх;
	КонецЕсли;
	
	Возврат (ПоложениеЗаголовкаКИ = ПоложениеЗаголовкаЭлементаФормы.Лево);
	
КонецФункции

// Процедура - Изменить комментарий
//
// Параметры:
//  Форма					 - 	 - 
//  ИмяРеквизита			 - 	 - 
//  ЭтоДобавлениеКомментария - 	 - 
//
Процедура ИзменитьКомментарий(Форма, ИмяРеквизита, ЭтоДобавлениеКомментария, ИмяЭлементаДляРазмещения)
	
	Если Форма.ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения].ДобавленныеЭлементы.НайтиПоЗначению(ИмяРеквизита) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеКонтактнойИнформации = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов;
	
	Отбор = Новый Структура("ИмяРеквизита", ИмяРеквизита);
	НайденнаяСтрока = ОписаниеКонтактнойИнформации.НайтиСтроки(Отбор)[0];
	ИмяКомментария = "Комментарий" + ИмяРеквизита;
	
	Если ЭтоДобавлениеКомментария И Форма.Элементы.Найти(ИмяКомментария) <> Неопределено Тогда
		// Комментарий уже существует, просто обновим его
		Форма.Элементы[ИмяКомментария].Заголовок = НайденнаяСтрока.Комментарий;
		Возврат;
	КонецЕсли;
	
	// Заголовок и поле ввода
	ЗаголовокЭлемента = Форма.Элементы.Найти("Заголовок" + ИмяРеквизита);
	ЗаголовокСлева = ЗаголовокСлева(Форма.ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения].ПоложениеЗаголовка);
	
	Если ЭтоДобавлениеКомментария Тогда
		ПолеВвода = Форма.Элементы.Найти(ИмяРеквизита);
		
		ГруппаПолейВвода = Форма.Элементы.ГруппаПолейВводаКонтактнойИнформации;
		
		ТекущийЭлемент = ?(ГруппаПолейВвода.ПодчиненныеЭлементы.Найти(ПолеВвода.Имя) = Неопределено, ПолеВвода.Родитель, ПолеВвода);
		ИндексТекущегоЭлемента = ГруппаПолейВвода.ПодчиненныеЭлементы.Индекс(ТекущийЭлемент);
		СледующийЭлемент = ГруппаПолейВвода.ПодчиненныеЭлементы.Получить(ИндексТекущегоЭлемента + 1);
		
		Комментарий = Комментарий(Форма, НайденнаяСтрока.Комментарий, ИмяКомментария, ГруппаПолейВвода, ИмяЭлементаДляРазмещения);
		Форма.Элементы.Переместить(Комментарий, ГруппаПолейВвода, СледующийЭлемент);
		Если ЗаголовокСлева Тогда
			
			ГруппаЗаголовков = Форма.Элементы.ГруппаЗаголовковКонтактнойИнформации;
			ИндексЗаголовка = ГруппаЗаголовков.ПодчиненныеЭлементы.Индекс(ЗаголовокЭлемента);
			СледующийЗаголовок = ГруппаЗаголовков.ПодчиненныеЭлементы.Получить(ИндексЗаголовка + 1);
			
			ИмяЗаглушки = "ЗаглушкаЗаголовка" + ИмяРеквизита;
			Заглушка = Форма.Элементы.Добавить(ИмяЗаглушки, Тип("ДекорацияФормы"), ГруппаЗаголовков);
			Форма.Элементы.Переместить(Заглушка, ГруппаЗаголовков, СледующийЗаголовок);
			ДобавитьОписаниеЭлемента(Форма, ИмяЗаглушки, 2, , ИмяЭлементаДляРазмещения);
		КонецЕсли;
	Иначе
		Комментарий = Форма.Элементы[ИмяКомментария];
		Форма.Элементы.Удалить(Комментарий);
		УдалитьОписаниеЭлемента(Форма, ИмяКомментария, ИмяЭлементаДляРазмещения);
		
		Если ЗаголовокСлева Тогда
			
			ЗаголовокЭлемента.Высота = 1;
			
			ИмяЗаглушки = "ЗаглушкаЗаголовка" + ИмяРеквизита;
			ЗаглушкаЗаголовка = Форма.Элементы[ИмяЗаглушки];
			Форма.Элементы.Удалить(ЗаглушкаЗаголовка);
			УдалитьОписаниеЭлемента(Форма, ИмяЗаглушки, ИмяЭлементаДляРазмещения);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Действие
	ГруппаДействий = Форма.Элементы.ГруппаДействийКонтактнойИнформации;
	ИмяЗаглушкиДействия = "ЗаглушкаДействия" + ИмяРеквизита;
	ЗаглушкаДействия = Форма.Элементы.Найти(ИмяЗаглушкиДействия);
	
	Если ЭтоДобавлениеКомментария Тогда
		
		Если ЗаглушкаДействия = Неопределено Тогда
			
			ЗаглушкаДействия = Форма.Элементы.Добавить(ИмяЗаглушкиДействия, Тип("ДекорацияФормы"), ГруппаДействий);
			ЗаглушкаДействия.Высота = 1;
			Действие = Форма.Элементы["Команда" + ИмяРеквизита];
			ИндексКоманды = ГруппаДействий.ПодчиненныеЭлементы.Индекс(Действие);
			СледующийЭлемент = ГруппаДействий.ПодчиненныеЭлементы.Получить(ИндексКоманды + 1);
			Если ЗаглушкаДействия <> СледующийЭлемент Тогда
				Форма.Элементы.Переместить(ЗаглушкаДействия, ГруппаДействий, СледующийЭлемент);
			КонецЕсли;
			ДобавитьОписаниеЭлемента(Форма, ИмяЗаглушкиДействия, 2, , ИмяЭлементаДляРазмещения);
			
		Иначе
			
			ЗаглушкаДействия.Высота = 2;
			
		КонецЕсли;
		
	Иначе
		
		Если ЗаглушкаДействия.Высота = 1 Тогда
			
			Форма.Элементы.Удалить(ЗаглушкаДействия);
			УдалитьОписаниеЭлемента(Форма, ИмяЗаглушкиДействия, ИмяЭлементаДляРазмещения);
			
		Иначе
			
			ЗаглушкаДействия.Высота = 1;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает доступно ли редактирование в диалоге по типу контактной информации.
//
// Параметры:
//    Тип - ПеречислениеСсылка.ТипыКонтактнойИнформации - тип контактной информации.
//
// Возвращаемое значение:
//    Булево - доступно или нет редактирование в диалоге.
//
Функция ДляТипаКонтактнойИнформацииДоступноРедактированиеВДиалоге(Тип)

	Если Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		Возврат Истина;
	ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		Возврат Истина;
	ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.Факс Тогда
		Возврат Истина;
	ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.МобильноеПриложение Тогда
		Возврат Истина;	
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Процедура - Создать действие
//
// Параметры:
//  Форма					 - 	 - 
//  ВидКонтактнойИнформации	 - 	 - 
//  ИмяРеквизита			 - 	 - 
//  ГруппаДействий			 - 	 - 
//  КоличествоАдресов		 - 	 - 
//  ЕстьКомментарий			 - 	 - 
//  ИмяЭлементаДляРазмещения - 	 - 
//
Процедура СоздатьДействие(Форма, ВидКонтактнойИнформации, ИмяРеквизита, ГруппаДействий, КоличествоАдресов, ЕстьКомментарий = Ложь, ИмяЭлементаДляРазмещения = "ГруппаКонтактнаяИнформация", СледующееДействие = Неопределено)
	
	ПараметрыКонтактнойИнформации = ПараметрыКонтактнойИнформацииФормы(Форма.ПараметрыКонтактнойИнформации, ИмяЭлементаДляРазмещения);
	ОбработкаНавигационнойСсылки = ПараметрыКонтактнойИнформации.ОбработкаНавигационнойСсылки;
	
	Тип = ВидКонтактнойИнформации.Тип;
	СоздаватьДействиеДляТипа = Новый Соответствие();
	Если Не ОбработкаНавигационнойСсылки Тогда
		СоздаватьДействиеДляТипа.Вставить(Перечисления.ТипыКонтактнойИнформации.ВебСтраница, Истина);
	КонецЕсли;
	
	СоздаватьДействиеДляТипа.Вставить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Истина);
	СоздаватьДействиеДляТипа.Вставить(Перечисления.ТипыКонтактнойИнформации.Телефон, Истина);
	СоздаватьДействиеДляТипа.Вставить(Перечисления.ТипыКонтактнойИнформации.Адрес, ?(КоличествоАдресов > 1, Истина, Ложь));
	// СоздаватьДействиеДляТипа.Вставить(Перечисления.ТипыКонтактнойИнформации.Skype, Истина);
	
	Если Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
			МодульРаботаСПочтовымиСообщениями = ОбщегоНазначения.ОбщийМодуль("РаботаСПочтовымиСообщениями");
			Если НЕ МодульРаботаСПочтовымиСообщениями.ДоступнаОтправкаПисем() Тогда
				СоздаватьДействиеДляТипа[Тип] = Ложь;
			КонецЕсли;
		Иначе
			СоздаватьДействиеДляТипа[Тип] = Ложь;
		КонецЕсли;
	ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.Адрес И ВидКонтактнойИнформации.ВидРедактирования = "Диалог" Тогда
		СоздаватьДействиеДляТипа[Тип] = Ложь;
	КонецЕсли;
	
	Если СоздаватьДействиеДляТипа[Тип] = Истина Тогда
		
		Если Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
			ГруппаПодменюВерхнийУровень = Форма.Элементы.Добавить("КоманднаяПанель" + ИмяРеквизита, Тип("ГруппаФормы"), ГруппаДействий);
			ГруппаПодменюВерхнийУровень.Вид = ВидГруппыФормы.КоманднаяПанель;
			
			ГруппаПодменю = Форма.Элементы.Добавить("Подменю" + ИмяРеквизита, Тип("ГруппаФормы"), ГруппаПодменюВерхнийУровень);
			ГруппаПодменю.Заголовок = НСтр("ru = 'Контактная информация'");
			ГруппаПодменю.Вид = ВидГруппыФормы.Подменю;
			ГруппаПодменю.Картинка = БиблиотекаКартинок.МенюДополнительныеФункции;
			ГруппаПодменю.Отображение = ОтображениеКнопки.Картинка;
			ГруппаПодменю.РастягиватьПоГоризонтали = Ложь;
			
			
			Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
				ГруппаДействий.ОтображатьЗаголовок = Истина;
				
				ГруппаПодменюВерхнийУровень.РастягиватьПоГоризонтали = Ложь;
				ГруппаПодменюВерхнийУровень.Ширина = 5;
				ГруппаПодменюВерхнийУровень.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
				ГруппаПодменюВерхнийУровень.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
			КонецЕсли;
		
		Иначе
			ГруппаПодменю = ГруппаДействий;
			
			// Есть действие
			ИмяКоманды = "Команда" + ИмяРеквизита;
			Команда = Форма.Команды.Добавить(ИмяКоманды);
			
			ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 9, Истина);
			Команда.Отображение = ОтображениеКнопки.Текст;
			Команда.Действие = "Подключаемый_КонтактнаяИнформацияВыполнитьКоманду";
			
			Элемент = Форма.Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"), ГруппаПодменю);
			
			Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
				Элемент.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
				Элемент.Ширина = 5;
			КонецЕсли;
			
			ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 2);
			Элемент.ИмяКоманды = ИмяКоманды;
		КонецЕсли;
		
		Если Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
			
			Если Не ВидКонтактнойИнформации.ПометкаУдаления Тогда
				// Ввод комментария через контекстное меню.
				ИмяКоманды = "КонтекстноеМенюПодменю" + ИмяРеквизита;
				Кнопка = Форма.Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"), ГруппаПодменю);
				Кнопка.Заголовок = НСтр("ru = 'Ввести комментарий'");
				Команда = Форма.Команды.Добавить(ИмяКоманды);
				Команда.Подсказка = НСтр("ru = 'Ввести комментарий'");
				Команда.Картинка = БиблиотекаКартинок.Комментарий;
				Команда.Действие = "Подключаемый_КонтактнаяИнформацияВыполнитьКоманду";
				Команда.ИзменяетСохраняемыеДанные = Истина;
				Кнопка.ИмяКоманды = ИмяКоманды;
				
				ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 1);
				ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 9, Истина);
			КонецЕсли;
			
			// История изменений 
			Если ВидКонтактнойИнформации.ХранитьИсториюИзменений И Не ВидКонтактнойИнформации.ПометкаУдаления Тогда
				
				ИмяКоманды = "КонтекстноеМенюПодменюИстория" + ИмяРеквизита;
				Кнопка = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ГруппаПодменю);
				Кнопка.Заголовок = НСтр("ru = 'История изменений...'");
				Команда = Форма.Команды.Добавить(ИмяКоманды);
				Команда.Картинка = БиблиотекаКартинок.ИсторияИзменений;
				Команда.Подсказка = НСтр("ru = 'Показывает историю изменения контактной информации'");
				Команда.Действие = "Подключаемый_КонтактнаяИнформацияВыполнитьКоманду";
				Команда.ИзменяетСохраняемыеДанные = Ложь;
				Кнопка.ИмяКоманды = ИмяКоманды;
				
				ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 1);
				ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 9, Истина);
			КонецЕсли;
			
			// Устанавливаем свойства поля ввода.
			ГруппаРазделитель = Форма.Элементы.Добавить("ПодменюРазделительАдрес" + ИмяРеквизита, Тип("ГруппаФормы"), ГруппаПодменю);
			ГруппаРазделитель.Вид = ВидГруппыФормы.ГруппаКнопок;
			
			ИмяКоманды = "КартаЯндексМеню" + ИмяРеквизита;
			Кнопка = Форма.Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"), ГруппаРазделитель);
			Кнопка.Заголовок = НСтр("ru = 'Адрес на Яндекс.Картах'");
			Команда = Форма.Команды.Добавить(ИмяКоманды);
			Команда.Картинка = БиблиотекаКартинок.ЯндексКарты;
			Команда.Подсказка = НСтр("ru = 'Показывает адрес на картах Яндекс.Карты'");
			Команда.Действие = "Подключаемый_КонтактнаяИнформацияВыполнитьКоманду";
			Кнопка.ИмяКоманды = ИмяКоманды;
			
			ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 1);
			ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 9, Истина);
			
			ИмяКоманды = "КартаGoogleМеню" + ИмяРеквизита;
			Кнопка = Форма.Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"), ГруппаРазделитель);
			Кнопка.Заголовок = НСтр("ru = 'Адрес на Google Maps'");
			Команда = Форма.Команды.Добавить(ИмяКоманды);
			Команда.Картинка = БиблиотекаКартинок.GoogleMaps;
			Команда.Подсказка = НСтр("ru = 'Показывает адрес на карте Google Maps'");
			Команда.Действие = "Подключаемый_КонтактнаяИнформацияВыполнитьКоманду";
			Кнопка.ИмяКоманды = ИмяКоманды;
			
			ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 1);
			ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 9, Истина);
			
			Если Не ВидКонтактнойИнформации.ПометкаУдаления Тогда
				
				ГруппаРазделитель = Форма.Элементы.Добавить("ПодменюРазделитель" + ИмяРеквизита, Тип("ГруппаФормы"), ГруппаРазделитель);
				ГруппаРазделитель.Вид = ВидГруппыФормы.ГруппаКнопок;
				
				ГруппаПодменюАдреса = Форма.Элементы.Добавить("ПодменюКопироватьАдреса" + ИмяРеквизита, Тип("ГруппаФормы"), ГруппаРазделитель);
				ГруппаПодменюАдреса.Вид = ВидГруппыФормы.Подменю;
				ГруппаПодменюАдреса.Отображение = ОтображениеКнопки.Текст;
				ГруппаПодменюАдреса.Заголовок = НСтр("ru = 'Заполнить'");
			
			КонецЕсли;
			
		ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			
			Элемент.Заголовок = НСтр("ru = 'Написать письмо'");
			Команда.Подсказка = НСтр("ru = 'Написать письмо'");
			Команда.Картинка = БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо;
			
		ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница Тогда
			
			Элемент.Заголовок = НСтр("ru = 'Перейти'");
			Команда.Подсказка = НСтр("ru = 'Перейти по ссылке'");
			Команда.Картинка = БиблиотекаКартинок.КонтактнаяИнформацияПерейтиПоСсылке;
			
		ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			Если Форма.ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения].МожноОтправлятьSMS Тогда
				Элемент.Заголовок = НСтр("ru = 'Позвонить или отправить SMS'");
				Команда.Подсказка = НСтр("ru = 'Позвонить или отправить SMS'");
				Команда.Картинка = БиблиотекаКартинок.ПозвонитьИлиОтправитьSMS;
			Иначе
				Элемент.Заголовок = НСтр("ru = 'Позвонить'");
				Команда.Подсказка = НСтр("ru = 'Позвонить по телефону'");
				Команда.Картинка = БиблиотекаКартинок.Позвонить;
			КонецЕсли;
			
		ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.Skype Тогда
			Элемент.Заголовок = НСтр("ru = 'Skype'");
			Команда.Подсказка = НСтр("ru = 'Skype'");
			Команда.Картинка = БиблиотекаКартинок.Skype;
		КонецЕсли;
		
		Если ЕстьКомментарий Тогда
			ИмяЗаглушкиДействия = "ЗаглушкаДействия" + ИмяРеквизита;
			ЗаглушкаДействия = Форма.Элементы.Добавить(ИмяЗаглушкиДействия, Тип("ДекорацияФормы"), ГруппаДействий);
			ЗаглушкаДействия.Высота = 1;
			ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяЗаглушкиДействия, 2);	
			Если СледующееДействие <> Неопределено Тогда
				Форма.Элементы.Переместить(ЗаглушкаДействия, ГруппаДействий, СледующееДействие);
			КонецЕсли;
		КонецЕсли;		
	Иначе
		// Действия нет, ставим заглушку.
		ИмяЗаглушкиДействия = "ЗаглушкаДействия" + ИмяРеквизита;
		Элемент = Форма.Элементы.Добавить(ИмяЗаглушкиДействия, Тип("ДекорацияФормы"), ГруппаДействий);
		ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяЗаглушкиДействия, 2);	
		Если ЕстьКомментарий Тогда
			Элемент.Высота = 2;
		ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.Другое Тогда
			Элемент.Высота = ?(ВидКонтактнойИнформации.МногострочноеПоле, 5, 1);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Функция - Комментарий
//
// Параметры:
//  Форма				 - 	 - 
//  Комментарий			 - 	 - 
//  ИмяКомментария		 - 	 - 
//  ГруппаДляРазмещения	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Комментарий(Форма, Комментарий, ИмяКомментария, ГруппаДляРазмещения, ИмяЭлементаДляРазмещения)
	
	Элемент = Форма.Элементы.Добавить(ИмяКомментария, Тип("ДекорацияФормы"), ГруппаДляРазмещения);
	Элемент.Заголовок = Комментарий;
	
	Элемент.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
	
	Элемент.РастягиватьПоГоризонтали = Истина;
	Элемент.РастягиватьПоВертикали  = Ложь;
	Элемент.ВертикальноеПоложение  = ВертикальноеПоложениеЭлемента.Верх;
	
	Элемент.Высота = 1;
	
	ДобавитьОписаниеЭлемента(Форма, ИмяКомментария, 2, , ИмяЭлементаДляРазмещения);
	
	Возврат Элемент;
	
КонецФункции

// Функция - Действие
//
// Параметры:
//  Форма					 - 	 - 
//  ВидКонтактнойИнформации	 - 	 - 
//  ИмяРеквизита			 - 	 - 
//  ГруппаДействий			 - 	 - 
//  КоличествоАдресов		 - 	 - 
//  ЕстьКомментарий			 - 	 - 
//  СледующееДействие		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Действие(Форма, ВидКонтактнойИнформации, ИмяРеквизита, ГруппаДействий, КоличествоАдресов, ЕстьКомментарий = Ложь, СледующееДействие = Неопределено)
	
	Тип = ВидКонтактнойИнформации.Тип;
	СоздаватьДействиеДляТипа = Новый Соответствие();
	// СоздаватьДействиеДляТипа.Вставить(Перечисления.ТипыКонтактнойИнформации.ВебСтраница, Истина);
	СоздаватьДействиеДляТипа.Вставить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Истина);
	СоздаватьДействиеДляТипа.Вставить(Перечисления.ТипыКонтактнойИнформации.Телефон, Истина);
	СоздаватьДействиеДляТипа.Вставить(Перечисления.ТипыКонтактнойИнформации.Адрес, ?(КоличествоАдресов > 1, Истина, Ложь));
	// СоздаватьДействиеДляТипа.Вставить(Перечисления.ТипыКонтактнойИнформации.Skype, Истина);
	
	Если Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
			МодульРаботаСПочтовымиСообщениями = ОбщегоНазначения.ОбщийМодуль("РаботаСПочтовымиСообщениями");
			Если НЕ МодульРаботаСПочтовымиСообщениями.ДоступнаОтправкаПисем() Тогда
				СоздаватьДействиеДляТипа[Тип] = Ложь;
			КонецЕсли;
		Иначе
			СоздаватьДействиеДляТипа[Тип] = Ложь;
		КонецЕсли;
		
	ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		СоздаватьДействиеДляТипа[Тип] = Истина;
	ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда // И ВидКонтактнойИнформации.РедактированиеТолькоВДиалоге Тогда
		СоздаватьДействиеДляТипа[Тип] = Ложь;
	КонецЕсли;
	
	Если СоздаватьДействиеДляТипа[Тип] = Истина Тогда
		
		// Есть действие
		ИмяКоманды = "Команда" + ИмяРеквизита;
		Команда = Форма.Команды.Добавить(ИмяКоманды);
		ДобавитьОписаниеЭлемента(Форма, ИмяКоманды, 9, Истина);
		Команда.Отображение = ОтображениеКнопки.Картинка;
		Команда.Действие = "Подключаемый_КонтактнаяИнформацияВыполнитьКоманду";
		
		Элемент = Форма.Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"), ГруппаДействий);
		ДобавитьОписаниеЭлемента(Форма, ИмяКоманды, 2, Элемент);
		Элемент.ИмяКоманды = ИмяКоманды;
		
		Если Тип = Перечисления.ТипыКонтактнойИнформации.Адрес 
				И НЕ ВидКонтактнойИнформации.РедактированиеТолькоВДиалоге Тогда
			
			Элемент.Заголовок = НСтр("ru='Заполнить';en='Fill'");
			Команда.Подсказка = НСтр("ru='Заполнить адрес из другого поля';en='Fill address from other fields'");
			Команда.Картинка = БиблиотекаКартинок.ПереместитьВлево;
			Команда.ИзменяетСохраняемыеДанные = Истина;
			
		// ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница Тогда
		//	
		//	Элемент.Заголовок = НСтр("ru='Перейти';en='GoTo'");
		//	Команда.Подсказка = НСтр("ru='Перейти по ссылке';en='GoTo by reference'");
		//	Команда.Картинка = БиблиотекаКартинок.КонтактнаяИнформацияПерейтиПоСсылке;
			
		ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			
			Элемент.Заголовок = НСтр("ru='Написать письмо';en='Write letter'");
			Команда.Подсказка = НСтр("ru='Написать письмо';en='Write letter'");
			Команда.Картинка = БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо;
			
		ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			
			Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ОтправкаSMS") Тогда
				Элемент.Заголовок = НСтр("ru='Позвонить или отправить SMS';en='Call or tosend SMS'");
				Команда.Подсказка = НСтр("ru='Позвонить или отправить SMS';en='Call or tosend SMS'");
				Команда.Картинка = БиблиотекаКартинок.ПозвонитьИлиОтправитьSMS;
			Иначе
				Элемент.Заголовок = НСтр("ru='Позвонить';en='Call'");
				Команда.Подсказка = НСтр("ru='Позвонить по телефону';en='Call by phone'");
				Команда.Картинка = БиблиотекаКартинок.Позвонить;
			КонецЕсли;
			
		// ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.Skype Тогда
		//	Элемент.Заголовок = НСтр("ru='Skype';en='Skype'");
		//	Команда.Подсказка = НСтр("ru='Skype';en='Skype'");
		//	Команда.Картинка = БиблиотекаКартинок.Skype;
		КонецЕсли;
		
		Если ЕстьКомментарий Тогда
			
			ИмяЗаглушкиДействия = "ЗаглушкаДействия" + ИмяРеквизита;
			ЗаглушкаДействия = Форма.Элементы.Добавить(ИмяЗаглушкиДействия, Тип("ДекорацияФормы"), ГруппаДействий);
			ЗаглушкаДействия.Высота = 1;
			ДобавитьОписаниеЭлемента(Форма, ИмяЗаглушкиДействия, 2);
			
			Если СледующееДействие <> Неопределено Тогда
				Форма.Элементы.Переместить(ЗаглушкаДействия, ГруппаДействий, СледующееДействие);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		// Действия нет, ставим заглушку.
		ИмяЗаглушкиДействия = "ЗаглушкаДействия" + ИмяРеквизита;
		Элемент = Форма.Элементы.Добавить(ИмяЗаглушкиДействия, Тип("ДекорацияФормы"), ГруппаДействий);
		ДобавитьОписаниеЭлемента(Форма, ИмяЗаглушкиДействия, 2);
		Если ЕстьКомментарий Тогда
			Элемент.Высота = 2;
		ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.Другое Тогда
			Элемент.Высота = ?(ВидКонтактнойИнформации.МногострочноеПоле, 5, 1);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Элемент;
	
КонецФункции

// Убирает разделители в номере телефона.
// 
// Параметры:
//    НомерТелефона - Строка - номер телефона или факса.
// 
// Возвращаемое значение:
//     Строка - номер телефона или факса без разделителей.
// 
Функция УбратьРазделителиВНомерТелефона(Знач НомерТелефона)
	
	Поз = СтрНайти(НомерТелефона, ",");
	Если Поз <> 0 Тогда
		НомерТелефона = Лев(НомерТелефона, Поз-1);
	КонецЕсли;
	
	НомерТелефона = СтрЗаменить(НомерТелефона, "-", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, " ", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, "+", "");
	
	Возврат НомерТелефона;
	
КонецФункции

// Возвращает имя табличной части документа по виду контактной информации.
// 
// Параметры:
//    ВидКИ      - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации.
//    ИмяОбъекта - Строка - полное имя объекта метаданного.
// 
// Возвращаемое значение:
//    Строка - имя табличной части или пустая строка, если табличной части нет.
// 
Функция ИмяТабличнойЧастиПоВидуКИ(ВидКИ, ИмяОбъекта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ВидыКонтактнойИнформации.Родитель.ИмяПредопределенныхДанных КАК ИмяВидаКонтактнойИнформации
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|ГДЕ
		|	ВидыКонтактнойИнформации.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВидКИ);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат Сред(РезультатЗапроса.ИмяВидаКонтактнойИнформации, 
			СтрНайти(РезультатЗапроса.ИмяВидаКонтактнойИнформации, ИмяОбъекта) + СтрДлина(ИмяОбъекта));
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Функция - Группа
//
// Параметры:
//  ИмяГруппы		 - 	 - 
//  Форма			 - 	 - 
//  Родитель		 - 	 - 
//  Группировка		 - 	 - 
//  ПорядокУдаления	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьГруппуКнопкиДобавленияКонтакта(ИмяГруппы, Форма, Заголовок, ИмяЭлементаДляРазмещения)
	
	Группа = Форма.Элементы.Найти(ИмяГруппы);
	
	Если Группа = Неопределено Тогда
		Родитель = Родитель(Форма, ИмяЭлементаДляРазмещения);
		Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
			Родитель.ШрифтЗаголовка = ШрифтыСтиля.ВажнаяНадписьШрифт;
		КонецЕсли;
		Группа = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Родитель);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Заголовок = Заголовок;
		Группа.ОтображатьЗаголовок = Ложь;
		Группа.РазрешитьИзменениеСостава = Ложь;
		Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ПараметрыКонтактнойИнформации = ПараметрыКонтактнойИнформацииФормы(Форма.ПараметрыКонтактнойИнформации, ИмяЭлементаДляРазмещения);
		ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяГруппы, 5);
	КонецЕсли;
	
	Возврат Группа;
	
КонецФункции

// Функция - Группа
//
// Параметры:
//  ИмяГруппы		 - 	 - 
//  Форма			 - 	 - 
//  Родитель		 - 	 - 
//  Группировка		 - 	 - 
//  ПорядокУдаления	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Группа(ИмяГруппы, Форма, Родитель, Группировка, ПорядокУдаления, ИмяЭлементаДляРазмещения) 
	
	Группа = Форма.Элементы.Найти(ИмяГруппы);
	
	Если Группа = Неопределено Тогда
		Группа = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Родитель);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.ОтображатьЗаголовок = Ложь;
		Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
		Группа.Группировка = Группировка;
		ПараметрыКонтактнойИнформацииЭлемента = Форма.ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения]; // см. ПараметрыВыводаКонтактнойИнформации
		ПараметрыКонтактнойИнформацииЭлемента.ДобавленныеЭлементы.Добавить(ИмяГруппы, ПорядокУдаления, Ложь);
	КонецЕсли;
	
	Возврат Группа;
	
КонецФункции

// Функция - Родитель
//
// Параметры:
//  Форма					 - 	 - 
//  ИмяЭлементаДляРазмещения - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Родитель(Форма, ИмяЭлементаДляРазмещения)
	
	Возврат ?(ПустаяСтрока(ИмяЭлементаДляРазмещения), Форма, Форма.Элементы[ИмяЭлементаДляРазмещения])
	
КонецФункции

// Процедура - Проверить наличие реквизитов контактной информации
//
// Параметры:
//  Форма						 - 	 - 
//  МассивДобавляемыхРеквизитов	 - 	 - 
//
Процедура ПроверитьНаличиеРеквизитовКонтактнойИнформации(Форма, МассивДобавляемыхРеквизитов)
	
	СписокРеквизитовФормы = Форма.ПолучитьРеквизиты();
	
	СоздатьПараметрыКонтактнойИнформации = Истина;
	СоздатьТаблицуКонтактнойИнформации = Истина;
	Для Каждого Реквизит Из СписокРеквизитовФормы Цикл
		Если Реквизит.Имя = "ПараметрыКонтактнойИнформации" Тогда
			СоздатьПараметрыКонтактнойИнформации = Ложь;
		ИначеЕсли Реквизит.Имя = "КонтактнаяИнформацияОписаниеДополнительныхРеквизитов" Тогда
			СоздатьТаблицуКонтактнойИнформации = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Строка500 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500));
	ИмяОписания = "КонтактнаяИнформацияОписаниеДополнительныхРеквизитов";
	Если СоздатьТаблицуКонтактнойИнформации Тогда
		// Создадим таблицу значений
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяОписания, Новый ОписаниеТипов("ТаблицаЗначений")));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ИмяРеквизита", Строка500, ИмяОписания));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Вид", Новый ОписаниеТипов("СправочникСсылка.ВидыКонтактнойИнформации"), ИмяОписания));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Тип", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"), ИмяОписания));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЗначенияПолей", Новый ОписаниеТипов("СписокЗначений, Строка"), ИмяОписания));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Значение", Новый ОписаниеТипов("Строка"), ИмяОписания));		
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Представление", Строка500, ИмяОписания));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Комментарий", Новый ОписаниеТипов("Строка"), ИмяОписания));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЭтоРеквизитТабличнойЧасти", Новый ОписаниеТипов("Булево"), ИмяОписания));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЭтоИсторическаяКонтактнаяИнформация", Новый ОписаниеТипов("Булево"), ИмяОписания));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ДействуетС", Новый ОписаниеТипов("Дата"), ИмяОписания));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ХранитьИсториюИзменений", Новый ОписаниеТипов("Булево"), ИмяОписания));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ИмяЭлементаДляРазмещения", Строка500, ИмяОписания));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("МеждународныйФорматАдреса", Новый ОписаниеТипов("Булево"), ИмяОписания));		
	Иначе
		РеквизитыТаблицы = Форма.ПолучитьРеквизиты("КонтактнаяИнформацияОписаниеДополнительныхРеквизитов");
		РеквизитыДляСоздания = Новый Соответствие;
		РеквизитыДляСоздания.Вставить("ИмяЭлементаДляРазмещения",            Истина);
		РеквизитыДляСоздания.Вставить("ХранитьИсториюИзменений",             Истина);
		РеквизитыДляСоздания.Вставить("ДействуетС",                          Истина);
		РеквизитыДляСоздания.Вставить("ЭтоИсторическаяКонтактнаяИнформация", Истина);
		РеквизитыДляСоздания.Вставить("Значение",                            Истина);
		РеквизитыДляСоздания.Вставить("МеждународныйФорматАдреса",           Истина);
		
		Для Каждого Реквизит Из РеквизитыТаблицы Цикл
			Если РеквизитыДляСоздания[Реквизит.Имя] <> Неопределено Тогда
				РеквизитыДляСоздания[Реквизит.Имя] = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Если РеквизитыДляСоздания["Значение"] Тогда
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Значение", Новый ОписаниеТипов("Строка"), ИмяОписания));
		КонецЕсли;
		
		Если РеквизитыДляСоздания["МеждународныйФорматАдреса"] Тогда
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("МеждународныйФорматАдреса", Новый ОписаниеТипов("Булево"), ИмяОписания));
		КонецЕсли;
		
		Если РеквизитыДляСоздания["ИмяЭлементаДляРазмещения"] Тогда
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ИмяЭлементаДляРазмещения", Строка500, ИмяОписания));
		КонецЕсли;
		
		Если РеквизитыДляСоздания["ХранитьИсториюИзменений"] Тогда
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ХранитьИсториюИзменений", Новый ОписаниеТипов("Булево"), ИмяОписания));
		КонецЕсли;
		
		Если РеквизитыДляСоздания["ДействуетС"] Тогда
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ДействуетС", Новый ОписаниеТипов("Дата"), ИмяОписания));
		КонецЕсли;
		
		Если РеквизитыДляСоздания["ЭтоИсторическаяКонтактнаяИнформация"] Тогда
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЭтоИсторическаяКонтактнаяИнформация", Новый ОписаниеТипов("Булево"), ИмяОписания));
		КонецЕсли;
		
	КонецЕсли;
	
	Если СоздатьПараметрыКонтактнойИнформации Тогда
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПараметрыКонтактнойИнформации", Новый ОписаниеТипов()));
	КонецЕсли;
	
КонецПроцедуры

// Функция - Определить следующую строку
//
// Параметры:
//  Форма				 - 	 - 
//  КонтактнаяИнформация - 	 - 
//  СтрокаКИ			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОпределитьСледующуюСтроку(Форма, КонтактнаяИнформация, СтрокаКИ)
	
	Позиция = КонтактнаяИнформация.Индекс(СтрокаКИ) + 1;
	Пока Позиция < КонтактнаяИнформация.Количество() Цикл
		СледующаяСтрока = КонтактнаяИнформация.Получить(Позиция);
		Если СледующаяСтрока = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		Если Форма.Элементы.Найти(СледующаяСтрока.ИмяРеквизита) <> Неопределено Тогда
			Возврат СледующаяСтрока;
		КонецЕсли;
		Позиция = Позиция + 1;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Определяет значение положения заголовка. Для поддержки локализованных конфигураций.
// 
// Параметры:
//  ПоложениеЗаголовкаКИ - Строка - положение заголовка в текстовом представление на языке локализации.
// 
// Возвращаемое значение:
//  Строка - положение заголовка.
// 
Функция ЗначениеПоложенияЗаголовкаКИ(ПоложениеЗаголовкаКИ)
	
	Если СтрСравнить(Строка(ПоложениеЗаголовкаЭлементаФормы.Лево), ПоложениеЗаголовкаКИ) = 0 Тогда
		Возврат "Лево";
	ИначеЕсли СтрСравнить(Строка(ПоложениеЗаголовкаЭлементаФормы.Верх), ПоложениеЗаголовкаКИ) = 0 Тогда
		Возврат "Верх";
	ИначеЕсли СтрСравнить(Строка(ПоложениеЗаголовкаЭлементаФормы.Низ), ПоложениеЗаголовкаКИ) = 0 Тогда
		Возврат "Низ";
	ИначеЕсли СтрСравнить(Строка(ПоложениеЗаголовкаЭлементаФормы.Право), ПоложениеЗаголовкаКИ) = 0 Тогда
		Возврат "Право";
	ИначеЕсли СтрСравнить(Строка(ПоложениеЗаголовкаЭлементаФормы.Нет), ПоложениеЗаголовкаКИ) = 0 Тогда
		Возврат "Нет";
	ИначеЕсли СтрСравнить(Строка(ПоложениеЗаголовкаЭлементаФормы.Авто), ПоложениеЗаголовкаКИ) = 0 Тогда
		Возврат "Авто";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Процедура - Удалить команды и элементы формы
//
// Параметры:
//  Форма	 - 	 - 
//
Процедура УдалитьКомандыИЭлементыФормы(Форма, ИмяЭлементаДляРазмещения)
	
	ДобавленныеЭлементы = Форма.ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения].ДобавленныеЭлементы;
	ДобавленныеЭлементы.СортироватьПоПредставлению();
	
	Для Каждого УдаляемыйЭлемент Из ДобавленныеЭлементы Цикл
		
		Если Форма.Команды.Найти(УдаляемыйЭлемент.Значение) <> Неопределено Тогда
			Форма.Команды.Удалить(Форма.Команды[УдаляемыйЭлемент.Значение]);
		КонецЕсли;
		
		Если Форма.Элементы.Найти(УдаляемыйЭлемент.Значение) <> Неопределено Тогда
			Форма.Элементы.Удалить(Форма.Элементы[УдаляемыйЭлемент.Значение]);
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

// Процедура - Добавить реквизит в описание
//
// Параметры:
//  Форма							 - 	 - 
//  СтрокаКонтактнойИнформации		 - 	 - 
//  ДанныеВидаКонтактнойИнформации	 - 	 - 
//  ЭтоНовыйВидКИ					 - 	 - 
//  ЭтоРеквизитТабличнойЧасти		 - 	 - 
//  ЗаполнятьЗначениеРеквизита		 - 	 - 
//  ИмяЭлементаДляРазмещения		 - 	 - 
//
Процедура ДобавитьРеквизитВОписание(Форма, СтрокаКонтактнойИнформации, ДанныеВидаКонтактнойИнформации, ЭтоНовыйВидКИ,
	ЭтоРеквизитТабличнойЧасти = Ложь, ЗаполнятьЗначениеРеквизита = Истина, ИмяЭлементаДляРазмещения = "ГруппаКонтактнаяИнформация")
	
	ТаблицаОписанияДополнительныхРеквизитов = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов; // ТаблицаЗначений
	НоваяСтрока = ТаблицаОписанияДополнительныхРеквизитов.Добавить();
	НоваяСтрока.ИмяРеквизита  = СтрокаКонтактнойИнформации.ИмяРеквизита;
	НоваяСтрока.Вид           = СтрокаКонтактнойИнформации.Вид;
	НоваяСтрока.Тип           = СтрокаКонтактнойИнформации.Тип;
	НоваяСтрока.ИмяЭлементаДляРазмещения  = ИмяЭлементаДляРазмещения;
	НоваяСтрока.ЭтоРеквизитТабличнойЧасти = ЭтоРеквизитТабличнойЧасти;
	
	Если НоваяСтрока.Свойство("ЭтоИсторическаяКонтактнаяИнформация") Тогда
		НоваяСтрока.ЭтоИсторическаяКонтактнаяИнформация = СтрокаКонтактнойИнформации.ЭтоИсторическаяКонтактнаяИнформация;
	КонецЕсли;
	
	Если НоваяСтрока.Свойство("ДействуетС") Тогда
		НоваяСтрока.ДействуетС = СтрокаКонтактнойИнформации.ДействуетС;
	КонецЕсли;
	
	Если НоваяСтрока.Свойство("ХранитьИсториюИзменений") Тогда
		НоваяСтрока.ХранитьИсториюИзменений = СтрокаКонтактнойИнформации.ХранитьИсториюИзменений;
	КонецЕсли;
	
	Если НоваяСтрока.Свойство("МеждународныйФорматАдреса") Тогда
		НоваяСтрока.МеждународныйФорматАдреса = СтрокаКонтактнойИнформации.МеждународныйФорматАдреса;
	КонецЕсли;
	
	НоваяСтрока.Значение      = СтрокаКонтактнойИнформации.Значение;
	НоваяСтрока.Представление = СтрокаКонтактнойИнформации.Представление;
	НоваяСтрока.Комментарий   = СтрокаКонтактнойИнформации.Комментарий;
	
	Если ЗаполнятьЗначениеРеквизита И Не ЭтоРеквизитТабличнойЧасти Тогда
		
		Если Форма.Элементы.Найти(СтрокаКонтактнойИнформации.ИмяРеквизита) <> Неопределено 
			И Форма.Элементы[СтрокаКонтактнойИнформации.ИмяРеквизита].Вид = ВидПоляФормы.ПолеНадписи Тогда
			ЭтоПолеНадписи = Истина;
		Иначе
			ЭтоПолеНадписи = Ложь;
		КонецЕсли;
		
		Если СтрокаКонтактнойИнформации.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес
			И (СтрокаКонтактнойИнформации.ВидРедактирования = "Диалог" ИЛИ ЭтоПолеНадписи)
			И ПустаяСтрока(СтрокаКонтактнойИнформации.Представление) Тогда
			Форма[СтрокаКонтактнойИнформации.ИмяРеквизита] = УправлениеКонтактнойИнформациейКлиентСервер.ТекстПустогоАдресаВВидеГиперссылки();
		Иначе
			Форма[СтрокаКонтактнойИнформации.ИмяРеквизита] = СтрокаКонтактнойИнформации.Представление;
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеВидаКонтактнойИнформации.Вставить("Ссылка", СтрокаКонтактнойИнформации.Вид);
	
	Если ЭтоНовыйВидКИ И ДанныеВидаКонтактнойИнформации.РазрешитьВводНесколькихЗначений И Не ЭтоРеквизитТабличнойЧасти И Не ДанныеВидаКонтактнойИнформации.ПометкаУдаления Тогда
		ПараметрыКонтактнойИнформации = ПараметрыКонтактнойИнформацииФормы(Форма.ПараметрыКонтактнойИнформации, ИмяЭлементаДляРазмещения);
		Вид = СтрокаКонтактнойИнформации.Вид; // СправочникСсылка.ВидыКонтактнойИнформации
		ПараметрыКонтактнойИнформации.СписокДобавляемыхЭлементов.Добавить(ДанныеВидаКонтактнойИнформации, Строка(Вид),, УправлениеКонтактнойИнформациейКлиентСерверСтоматология.КартинкаДействияПоТипуКонтактнойИнформации(СтрокаКонтактнойИнформации.Тип));
	КонецЕсли;
	
КонецПроцедуры

// Возвращает имена табличных частей документа по виду контактной информации.
//
// Параметры:
//    ТаблицаВидовКонтактнойИнформации - ТаблицаЗначений - Список видов контактной информации.
//     * Вид - СправочникСсылка.ВидыКонтактнойИнформации - Вид контактной информации.
//    ИмяОбъекта                       - Строка - полное имя объекта метаданного.
//
// Возвращаемое значение:
//    Соответствие - имена табличных части или пустая строка, если табличной части нет.
//
Функция ИменаТабличныхЧастейПоВидамКИ(ТаблицаВидовКонтактнойИнформации, ИмяОбъекта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Вид КАК ВидКИ
	|ПОМЕСТИТЬ ВидыКИ
	|ИЗ
	|	&ТаблицаВидовКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВидыКонтактнойИнформации.Родитель.ИмяПредопределенногоВида <> """"
	|		ТОГДА ВидыКонтактнойИнформации.Родитель.ИмяПредопределенногоВида
	|		ИНАЧЕ ВидыКонтактнойИнформации.Родитель.ИмяПредопределенныхДанных
	|	КОНЕЦ КАК ИмяТабличнойЧасти,
	|	ВидыКИ.ВидКИ КАК ВидКонтактнойИнформации
	|ИЗ
	|	ВидыКИ КАК ВидыКИ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|		ПО ВидыКИ.ВидКИ = ВидыКонтактнойИнформации.Ссылка";
	
	Запрос.УстановитьПараметр("ТаблицаВидовКонтактнойИнформации", ТаблицаВидовКонтактнойИнформации);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Соответствие;
	Пока РезультатЗапроса.Следующий() Цикл
		
		Если ЗначениеЗаполнено(РезультатЗапроса.ИмяТабличнойЧасти) Тогда
			ИмяТабличнойЧасти = Сред(РезультатЗапроса.ИмяТабличнойЧасти, СтрНайти(РезультатЗапроса.ИмяТабличнойЧасти, ИмяОбъекта) + СтрДлина(ИмяОбъекта));
		Иначе
			ИмяТабличнойЧасти = "";
		КонецЕсли;
		
		Результат.Вставить(РезультатЗапроса.ВидКонтактнойИнформации, ИмяТабличнойЧасти);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Процедура - Пункт контекстного меню перемещения
//
// Параметры:
//  ПредыдущийЭлемент	 - 	 - 
//  Форма				 - 	 - 
//  Направление			 - 	 - 
//
Процедура ПунктКонтекстногоМенюПеремещения(ПредыдущийЭлемент, Форма, Направление, ИмяЭлементаДляРазмещения)
	
	Если Направление > 0 Тогда
		ИмяКоманды = "КонтекстноеМенюВверх" + ПредыдущийЭлемент.Имя;
	Иначе
		ИмяКоманды = "КонтекстноеМенюВниз" + ПредыдущийЭлемент.Имя;
	КонецЕсли;
	Команда = Форма.Команды.Добавить(ИмяКоманды);
	Кнопка = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ПредыдущийЭлемент.КонтекстноеМеню);
	
	Команда.Действие = "Подключаемый_КонтактнаяИнформацияВыполнитьКоманду";
	Если Направление > 0 Тогда 
		ТекстКоманды = НСтр("ru = 'Переместить вверх'");
		Кнопка.Картинка = БиблиотекаКартинок.ПереместитьВверх;
	Иначе
		ТекстКоманды = НСтр("ru = 'Переместить вниз'");
		Кнопка.Картинка = БиблиотекаКартинок.ПереместитьВниз;
	КонецЕсли;
	Кнопка.Заголовок = ТекстКоманды;
	Команда.Подсказка = ТекстКоманды;
	Кнопка.ИмяКоманды = ИмяКоманды;
	Команда.ИзменяетСохраняемыеДанные = Истина;
	Кнопка.Доступность = Истина;
	ДобавитьОписаниеЭлемента(Форма, ИмяКоманды, 1, , ИмяЭлементаДляРазмещения);
	ДобавитьОписаниеЭлемента(Форма, ИмяКоманды, 9, Истина, ИмяЭлементаДляРазмещения);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////// 
// Заполнение дополнительных реквизитов табличной части "Контактная информация".

// Заполняет дополнительные реквизиты табличной части "Контактная информация" для адреса.
// 
// Параметры:
//    СтрокаТабличнойЧасти - СтрокаТабличнойЧасти - заполняемая строка табличной части "Контактная информация".
//    Источник             - ОбъектXDTO  - контактная информация.
// 
Процедура ЗаполнитьРеквизитыТабличнойЧастиДляАдреса(СтрокаТабличнойЧасти, Источник)
	
	// Умолчания
	СтрокаТабличнойЧасти.Страна = "";
	СтрокаТабличнойЧасти.Регион = "";
	СтрокаТабличнойЧасти.Город  = "";
	
	Адрес = Источник.Состав;
	
	ПространствоИмен = УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ПространствоИмен();
	ЭтоАдрес = ТипЗнч(Адрес) = Тип("ОбъектXDTO") И Адрес.Тип() = ФабрикаXDTO.Тип(ПространствоИмен, "Адрес");
	Если ЭтоАдрес И Адрес.Состав <> Неопределено Тогда 
		СтрокаТабличнойЧасти.Страна = Адрес.Страна;
		АдресРФ = УправлениеКонтактнойИнформациейСлужебныйСтоматология.РоссийскийАдрес(Адрес);
		Если АдресРФ <> Неопределено Тогда
			// Российский адрес
			СтрокаТабличнойЧасти.Регион = АдресРФ.СубъектРФ;
			СтрокаТабличнойЧасти.Город  = АдресРФ.Город;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет дополнительные реквизиты табличной части "Контактная информация" для адреса электронной почты.
// 
// Параметры:
//    СтрокаТабличнойЧасти - СтрокаТабличнойЧасти - заполняемая строка табличной части "Контактная информация".
//    Источник             - ОбъектXDTO  - контактная информация.
// 
Процедура ЗаполнитьРеквизитыТабличнойЧастиДляАдресаЭлектроннойПочты(СтрокаТабличнойЧасти, Источник)
	
	Результат = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(СтрокаТабличнойЧасти.Представление, Ложь);
	
	Если Результат.Количество() > 0 Тогда
		СтрокаТабличнойЧасти.АдресЭП = Результат[0].Адрес;
		
		Поз = СтрНайти(СтрокаТабличнойЧасти.АдресЭП, "@");
		Если Поз <> 0 Тогда
			СтрокаТабличнойЧасти.ДоменноеИмяСервера = Сред(СтрокаТабличнойЧасти.АдресЭП, Поз+1);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет дополнительные реквизиты табличной части "Контактная информация" для телефона и факса.
// 
// Параметры:
//    СтрокаТабличнойЧасти - СтрокаТабличнойЧасти - заполняемая строка табличной части "Контактная информация".
//    Источник             - ОбъектXDTO  - контактная информация.
// 
Процедура ЗаполнитьРеквизитыТабличнойЧастиДляТелефона(СтрокаТабличнойЧасти, Источник)
	
	// Умолчания
	СтрокаТабличнойЧасти.НомерТелефонаБезКодов = "";
	СтрокаТабличнойЧасти.НомерТелефона         = "";
	
	Телефон = Источник.Состав;
	ПространствоИмен = УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ПространствоИмен();
	Если Телефон <> Неопределено И Телефон.Тип() = ФабрикаXDTO.Тип(ПространствоИмен, "НомерТелефона") Тогда
		КодСтраны     = Телефон.КодСтраны;
		КодГорода     = Телефон.КодГорода;
		НомерТелефона = Телефон.Номер;
		
		Если СтрНачинаетсяС(КодСтраны, "+") Тогда
			КодСтраны = Сред(КодСтраны, 2);
		КонецЕсли;
		
		Поз = СтрНайти(НомерТелефона, ",");
		Если Поз <> 0 Тогда
			НомерТелефона = Лев(НомерТелефона, Поз-1);
		КонецЕсли;
		
		Поз = СтрНайти(НомерТелефона, Символы.ПС);
		Если Поз <> 0 Тогда
			НомерТелефона = Лев(НомерТелефона, Поз-1);
		КонецЕсли;
		
		СтрокаТабличнойЧасти.НомерТелефонаБезКодов = УбратьРазделителиВНомерТелефона(НомерТелефона);
		СтрокаТабличнойЧасти.НомерТелефона         = УбратьРазделителиВНомерТелефона(Строка(КодСтраны) + КодГорода + НомерТелефона);
	КонецЕсли;
	
КонецПроцедуры

//// Заполняет дополнительные реквизиты табличной части "Контактная информация" для телефона и факса.
//// 
//// Параметры:
////    СтрокаТабличнойЧасти - СтрокаТабличнойЧасти - заполняемая строка табличной части "Контактная информация".
////    Источник             - ОбъектXDTO  - контактная информация.
//// 
Процедура ЗаполнитьРеквизитыТабличнойЧастиДляСоциальнойСети(СтрокаТабличнойЧасти, Источник)
	
	// Умолчания
	СтрокаТабличнойЧасти.ДоменноеИмяСервера = "";
	
	АдресСтраницы = Источник.Состав;
	ПространствоИмен = УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ПространствоИмен();
	Если АдресСтраницы <> Неопределено И АдресСтраницы.Тип() = ФабрикаXDTO.Тип(ПространствоИмен, "СоциальнаяСеть") Тогда
		АдресСтрокой = АдресСтраницы.Значение;
		
		// Удалим протокол
		АдресСервера = Прав(АдресСтрокой, СтрДлина(АдресСтрокой) - СтрНайти(АдресСтрокой, ":// ") );
		Поз = СтрНайти(АдресСервера, "/");
		// Удалим путь
		АдресСервера = ?(Поз = 0, АдресСервера, Лев(АдресСервера,  Поз-1));
		
		СтрокаТабличнойЧасти.ДоменноеИмяСервера = АдресСервера;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет контактную информацию в табличной части "Контактная информация" приемника.
// 
// Параметры:
//        * Приемник    - Произвольный - Объект, в котором нужно заполнить КИ.
//        * ВидКИ       - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации, заполняемый в
//                                                                    приемнике.
//        * СтруктураКИ - СписокЗначений, Строка, Структура - данные значений полей контактной информации.
//        * СтрокаТабличнойЧасти - СтрокаТабличнойЧасти, Неопределено - данные приемника, если контактная информация
//                                 заполняется для строки.
//                                                                      Неопределено, если контактная информация
//                                                                      заполняется для приемника.
//        * Дата         - Дата - Дата с который действует контактная информация. Используется только
//                                если у вида КИ установлен флаг ХранитьИсториюИзменений.
// 
Процедура ЗаполнитьКонтактнуюИнформациюТабличнойЧасти(Приемник, ВидКИ, СтруктураКИ, СтрокаТабличнойЧасти = Неопределено, Дата = Неопределено)
	
	ПараметрыОтбора = Новый Структура;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		ДанныеЗаполнения = Приемник;
	Иначе
		ДанныеЗаполнения = СтрокаТабличнойЧасти;
		ПараметрыОтбора.Вставить("ИдентификаторСтрокиТабличнойЧасти", СтрокаТабличнойЧасти.ИдентификаторСтрокиТабличнойЧасти);
	КонецЕсли;
	
	ПараметрыОтбора.Вставить("Вид", ВидКИ);
	НайденныеСтрокиКИ = Приемник.КонтактнаяИнформация.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтрокиКИ.Количество() = 0 Тогда
		СтрокаКИ = Приемник.КонтактнаяИнформация.Добавить();
		Если СтрокаТабличнойЧасти <> Неопределено Тогда
			СтрокаКИ.ИдентификаторСтрокиТабличнойЧасти = СтрокаТабличнойЧасти.ИдентификаторСтрокиТабличнойЧасти;
		КонецЕсли;
	Иначе
		СтрокаКИ = НайденныеСтрокиКИ[0];
	КонецЕсли;
	
	// Из любого понимаемого - в XML.
	ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(СтруктураКИ, , ВидКИ);
	Представление = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(ЗначенияПолей);
	
	СтрокаКИ.Тип           = ВидКИ.Тип;
	СтрокаКИ.Вид           = ВидКИ;
	СтрокаКИ.Представление = Представление;
	СтрокаКИ.ЗначенияПолей = ЗначенияПолей;
	
	Если ВидКИ.ХранитьИсториюИзменений Тогда
		СтрокаКИ.ДействуетС = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());
	КонецЕсли;
	
	ЗаполнитьДополнительныеРеквизитыКонтактнойИнформации(СтрокаКИ, Представление, ЗначенияПолей);
КонецПроцедуры

// Заполняет дополнительные реквизиты строки табличной части "Контактная информация".
// 
// Параметры:
//    СтрокаКИ      - СтрокаТабличнойЧасти - строка "Контактная информация".
//    Представление - Строка                     - представление значения.
//    ЗначенияПолей - СписокЗначений, ОбъектXTDO - значения полей.
// 
Процедура ЗаполнитьДополнительныеРеквизитыКонтактнойИнформации(СтрокаКИ, Представление, ЗначенияПолей)
	
	Если ТипЗнч(ЗначенияПолей) = Тип("ОбъектXDTO") Тогда
		ОбъектКИ = ЗначенияПолей;
	Иначе
		ОбъектКИ = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзXML(ЗначенияПолей, СтрокаКИ.Вид);
	КонецЕсли;
	
	ТипИнформации = СтрокаКИ.Тип;

	Если ТипИнформации = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		ЗаполнитьРеквизитыТабличнойЧастиДляАдресаЭлектроннойПочты(СтрокаКИ, ОбъектКИ);
		
	ИначеЕсли ТипИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		ЗаполнитьРеквизитыТабличнойЧастиДляАдреса(СтрокаКИ, ОбъектКИ);
		
	ИначеЕсли ТипИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		ЗаполнитьРеквизитыТабличнойЧастиДляТелефона(СтрокаКИ, ОбъектКИ);
		
	ИначеЕсли ТипИнформации = Перечисления.ТипыКонтактнойИнформации.Факс Тогда
		ЗаполнитьРеквизитыТабличнойЧастиДляТелефона(СтрокаКИ, ОбъектКИ);
		
	ИначеЕсли ТипИнформации = Перечисления.ТипыКонтактнойИнформации.СоциальнаяСеть Тогда
		ЗаполнитьРеквизитыТабличнойЧастиДляСоциальнойСети(СтрокаКИ, ОбъектКИ);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Обработка заполнения контактной информации объекта
//
// Параметры:
//  Объект			 - 	 - 
//  ДанныеЗаполнения - 	 - 
//
Процедура ОбработкаЗаполненияКонтактнойИнформацииОбъекта(Объект, Знач ДанныеЗаполнения) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	// Наименование, если есть в объекте-приемнике.
	Наименование = Неопределено;
	Если ДанныеЗаполнения.Свойство("Наименование", Наименование)
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Наименование") Тогда
		Объект.Наименование = Наименование;
	КонецЕсли;
	
	// Таблица контактной информации, заполняется только если КИ не находится в другой ТЧ.
	КонтактнаяИнформация = Неопределено;
	Если ДанныеЗаполнения.Свойство("КонтактнаяИнформация", КонтактнаяИнформация) 
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "КонтактнаяИнформация") Тогда
		
		Если ТипЗнч(КонтактнаяИнформация) = Тип("ТаблицаЗначений") Тогда
			КолонкиТаблицы = КонтактнаяИнформация.Колонки;
		ИначеЕсли ТипЗнч(КонтактнаяИнформация) = Тип("Массив") Тогда
			КонтактнаяИнформацияТЗ = МассивСтруктурВТаблицуЗначенийСтоматология(КонтактнаяИнформация);
			КолонкиТаблицы = КонтактнаяИнформацияТЗ.Колонки;
		Иначе
			ТаблицаКонтактнаяИнформация = КонтактнаяИнформация.ВыгрузитьКолонки(); // ТаблицаЗначений
			КолонкиТаблицы = ТаблицаКонтактнаяИнформация.Колонки;
		КонецЕсли;
		
		Если КолонкиТаблицы.Найти("ИдентификаторСтрокиТабличнойЧасти") = Неопределено Тогда
			
			Для Каждого СтрокаКИ Из КонтактнаяИнформация Цикл
				Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда 
					МассивСтрок = Объект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип, Вид, ЗначенияПолей", СтрокаКИ.Тип, СтрокаКИ.Вид, СтрокаКИ.ЗначенияПолей));
				ИначеЕсли СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда 
					МассивСтрок = Объект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип, Вид, АдресЭП", СтрокаКИ.Тип, СтрокаКИ.Вид, СтрокаКИ.АдресЭП));
				ИначеЕсли СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.МобильноеПриложение ИЛИ СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда 
					МассивСтрок = Объект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип, Вид, НомерТелефонаБезКодаСтраны", СтрокаКИ.Тип, СтрокаКИ.Вид, СтрокаКИ.НомерТелефонаБезКодаСтраны));			
				Иначе 
					МассивСтрок = Объект.КонтактнаяИнформация.НайтиСтроки(СтрокаКИ);			
				КонецЕсли;
				
				Если МассивСтрок.Количество() = 0 Тогда
					НоваяСтрокаКИ = Объект.КонтактнаяИнформация.Добавить();					
					ЗаполнитьЗначенияСвойств(НоваяСтрокаКИ, СтрокаКИ, , "ЗначенияПолей");
					НоваяСтрокаКИ.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(СтрокаКИ.ЗначенияПолей, СтрокаКИ.Представление, СтрокаКИ.Вид);					
				КонецЕсли;	
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Добавить реквизиты формы контактной информации
//
// Параметры:
//  Форма	 - 	 - 
//
Процедура ДобавитьРеквизитыФормыКонтактнойИнформации(Форма, Объект, ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти)
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	СписокРеквизитовФормы = Форма.ПолучитьРеквизиты();
	
	СоздатьТаблицуКонтактнаяИнформация = Истина;
	СоздатьТаблицуСвойстваВидовКонтактнойИнформации = Истина;
	
	Для Каждого Реквизит Из СписокРеквизитовФормы Цикл
		Если Реквизит.Имя = "КонтактнаяИнформация" Тогда
			СоздатьТаблицуКонтактнаяИнформация = Ложь;
		ИначеЕсли Реквизит.Имя = "СвойстваВидовКонтактнойИнформации" Тогда
			СоздатьТаблицуСвойстваВидовКонтактнойИнформации = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	ОписаниеСтрока = Новый ОписаниеТипов("Строка");
	ОписаниеБулево = Новый ОписаниеТипов("Булево");
	
	Если СоздатьТаблицуКонтактнаяИнформация Тогда
		
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти", ОписаниеБулево));
		
		ИмяТаблицы = "КонтактнаяИнформация";
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений"),,, Истина));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Вид", Новый ОписаниеТипов("СправочникСсылка.ВидыКонтактнойИнформации"), ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Тип", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"), ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Представление", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500)), ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Комментарий", ОписаниеСтрока, ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЗначенияПолей", ОписаниеСтрока, ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Значение", Новый ОписаниеТипов("Строка"), ИмяТаблицы));
		Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.Контрагенты") ИЛИ ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.Заявки") Тогда 
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("НеУчаствоватьВРассылке", ОписаниеБулево, ИмяТаблицы));	
		КонецЕсли;
		Если ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти Тогда
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ИдентификаторСтрокиТабличнойЧасти", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 0, ДопустимыйЗнак.Неотрицательный)), ИмяТаблицы));
		КонецЕсли;
		
	КонецЕсли;
	
	Если СоздатьТаблицуСвойстваВидовКонтактнойИнформации Тогда
		
		ИмяТаблицы = "СвойстваВидовКонтактнойИнформации";
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений"),,, Истина));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Вид", Новый ОписаниеТипов("СправочникСсылка.ВидыКонтактнойИнформации"), ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПредставлениеВида", ОписаниеСтрока, ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Тип", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"), ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВыводитьВФормеВсегда", ОписаниеБулево, ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("РазрешитьВводНесколькихЗначений", ОписаниеБулево, ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ОбязательноеЗаполнение", ОписаниеБулево, ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Подсказка", ОписаниеСтрока, ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПроверятьКорректность", ОписаниеБулево, ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВидРедактирования", ОписаниеСтрока, ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВидПоляДругое", ОписаниеСтрока, ИмяТаблицы));		
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("РедактированиеТолькоВДиалоге", ОписаниеБулево, ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("МногострочноеПоле", ОписаниеБулево, ИмяТаблицы));
		
	КонецЕсли;
	
	Если МассивДобавляемыхРеквизитов.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Прочитать свойства видов контактной информации
//
// Параметры:
//  Форма			 - 	 - 
//  ГруппаВидовКИ	 - 	 - 
//
Процедура ПрочитатьСвойстваВидовКонтактнойИнформации(Форма, ГруппаВидовКИ, ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти)
		И ОбщегоНазначенияСтоматология.ЕстьРеквизитОбъекта("ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти",, Форма) Тогда
		
		Форма.ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти = ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПорядокТиповКИ.Тип КАК Тип,
		|	ПорядокТиповКИ.Порядок КАК Порядок
		|ПОМЕСТИТЬ втПорядокТипов
		|ИЗ
		|	&ПорядокТиповКИ КАК ПорядокТиповКИ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыКонтактнойИнформации.Ссылка КАК Вид,
		|	ПРЕДСТАВЛЕНИЕ(ВидыКонтактнойИнформации.Ссылка) КАК ПредставлениеВида,
		|	ВидыКонтактнойИнформации.Тип КАК Тип,
		|	ЕСТЬNULL(НастройкиВидовКонтактнойИнформации.ВыводитьВФормеВсегда, ЛОЖЬ) КАК ВыводитьВФормеВсегда,
		|	ВидыКонтактнойИнформации.РазрешитьВводНесколькихЗначений КАК РазрешитьВводНесколькихЗначений,
		|	ВидыКонтактнойИнформации.ОбязательноеЗаполнение КАК ОбязательноеЗаполнение,
		|	ВидыКонтактнойИнформации.Тип КАК Подсказка,
		|	ВидыКонтактнойИнформации.ПроверятьКорректность КАК ПроверятьКорректность,
		|	ВидыКонтактнойИнформации.ВидРедактирования = ""Диалог"" КАК РедактированиеТолькоВДиалоге,
		|	ВидыКонтактнойИнформации.ВидРедактирования КАК ВидРедактирования,
		|	ВидыКонтактнойИнформации.ВидПоляДругое КАК ВидПоляДругое,
		|	ЛОЖЬ КАК МногострочноеПоле
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПорядокТипов КАК втПорядокТипов
		|		ПО ВидыКонтактнойИнформации.Тип = втПорядокТипов.Тип
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиВидовКонтактнойИнформации КАК НастройкиВидовКонтактнойИнформации
		|		ПО ВидыКонтактнойИнформации.Ссылка = НастройкиВидовКонтактнойИнформации.Вид
		|ГДЕ
		|	ВидыКонтактнойИнформации.ПометкаУдаления = ЛОЖЬ
		|	И (ВидыКонтактнойИнформации.Родитель = &ГруппаВидовКИ
		|			ИЛИ ВидыКонтактнойИнформации.Родитель.Родитель = &ГруппаВидовКИ)
		|	И НЕ ВидыКонтактнойИнформации.ЭтоГруппа
		|	И ВидыКонтактнойИнформации.Используется = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	втПорядокТипов.Порядок,
		|	ВидыКонтактнойИнформации.РеквизитДопУпорядочивания";
	
	Запрос.УстановитьПараметр("ПорядокТиповКИ", ПорядокТиповКИ());
	Запрос.УстановитьПараметр("ГруппаВидовКИ", ГруппаВидовКИ);
	
	ТаблицаСвойств = Запрос.Выполнить().Выгрузить();
		
	Если Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлементаКлиенты"
		И НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда

		СтруктураОтбора = Новый Структура("Вид, Тип", Справочники.ВидыКонтактнойИнформации.АдресКлиента, Перечисления.ТипыКонтактнойИнформации.Адрес);
		МассивНайденныхСтрок = ТаблицаСвойств.НайтиСтроки(СтруктураОтбора);
		
		Если ЗначениеЗаполнено(МассивНайденныхСтрок) Тогда
			МассивНайденныхСтрок[0].ВыводитьВФормеВсегда = Истина;		
		КонецЕсли;
		
	КонецЕсли;
	
	Форма.СвойстваВидовКонтактнойИнформации.Загрузить(ТаблицаСвойств);
	
КонецПроцедуры

// Процедура - Прочитать свойства видов контактной информации. Устаревшее.
//
// Параметры:
//  Форма			 - 	 - 
//  ГруппаВидовКИ	 - 	 - 
//
Процедура ПрочитатьСвойстваВидовКонтактнойИнформации_ДляСовместимости(Форма, ГруппаВидовКИ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПорядокТиповКИ.Тип КАК Тип,
		|	ПорядокТиповКИ.Порядок КАК Порядок
		|ПОМЕСТИТЬ втПорядокТипов
		|ИЗ
		|	&ПорядокТиповКИ КАК ПорядокТиповКИ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыКонтактнойИнформации.Ссылка КАК Вид,
		|	ПРЕДСТАВЛЕНИЕ(ВидыКонтактнойИнформации.Ссылка) КАК ПредставлениеВида,
		|	ВидыКонтактнойИнформации.Тип КАК Тип,
		|	ЕСТЬNULL(НастройкиВидовКонтактнойИнформации.ВыводитьВФормеВсегда, ЛОЖЬ) КАК ВыводитьВФормеВсегда,
		|	ВидыКонтактнойИнформации.РазрешитьВводНесколькихЗначений КАК РазрешитьВводНесколькихЗначений,
		|	ВидыКонтактнойИнформации.ОбязательноеЗаполнение КАК ОбязательноеЗаполнение,
		|	"""" КАК Подсказка,
		|	ВидыКонтактнойИнформации.ПроверятьКорректность КАК ПроверятьКорректность,
		|	ВидыКонтактнойИнформации.ВидРедактирования КАК ВидРедактирования,
		|	ВидыКонтактнойИнформации.ВидРедактирования = ""Диалог"" КАК РедактированиеТолькоВДиалоге,
		|	ВидыКонтактнойИнформации.ВидПоляДругое КАК ВидПоляДругое,
		|	ЛОЖЬ КАК МногострочноеПоле
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПорядокТипов КАК втПорядокТипов
		|		ПО ВидыКонтактнойИнформации.Тип = втПорядокТипов.Тип
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиВидовКонтактнойИнформации КАК НастройкиВидовКонтактнойИнформации
		|		ПО ВидыКонтактнойИнформации.Ссылка = НастройкиВидовКонтактнойИнформации.Вид
		|ГДЕ
		|	ВидыКонтактнойИнформации.ПометкаУдаления = ЛОЖЬ
		|	И ВидыКонтактнойИнформации.Родитель = &ГруппаВидовКИ
		|	И ВидыКонтактнойИнформации.Используется
		|
		|УПОРЯДОЧИТЬ ПО
		|	втПорядокТипов.Порядок,
		|	ВидыКонтактнойИнформации.РеквизитДопУпорядочивания";
	
	Запрос.УстановитьПараметр("ПорядокТиповКИ", ПорядокТиповКИ());
	Запрос.УстановитьПараметр("ГруппаВидовКИ", ГруппаВидовКИ);
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ТаблицаСвойств = Запрос.Выполнить().Выгрузить();
	Форма.СвойстваВидовКонтактнойИнформации.Загрузить(ТаблицаСвойств);
		
КонецПроцедуры

// Функция - Прочитать свойства вида контактной информации для совместимости
//
// Параметры:
//  ВидКИ	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПрочитатьСвойстваВидаКонтактнойИнформации_ДляСовместимости(ВидКИ) Экспорт
	
	СвойстваВидаКИ = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыКонтактнойИнформации.Ссылка КАК Вид,
		|	ПРЕДСТАВЛЕНИЕ(ВидыКонтактнойИнформации.Ссылка) КАК ПредставлениеВида,
		|	ВидыКонтактнойИнформации.Наименование КАК Наименование,
		|	ВидыКонтактнойИнформации.Тип КАК Тип,
		|	ЕСТЬNULL(НастройкиВидовКонтактнойИнформации.ВыводитьВФормеВсегда, ЛОЖЬ) КАК ВыводитьВФормеВсегда,
		|	ВидыКонтактнойИнформации.РазрешитьВводНесколькихЗначений КАК РазрешитьВводНесколькихЗначений,
		|	ВидыКонтактнойИнформации.ОбязательноеЗаполнение КАК ОбязательноеЗаполнение,
		|	"""" КАК Подсказка,
		|	ВидыКонтактнойИнформации.ПроверятьКорректность КАК ПроверятьКорректность,
		|	ВидыКонтактнойИнформации.ВидРедактирования КАК ВидРедактирования,
		|	ВидыКонтактнойИнформации.ВидРедактирования = ""Диалог"" КАК РедактированиеТолькоВДиалоге,
		|	ВидыКонтактнойИнформации.ВидПоляДругое КАК ВидПоляДругое,
		|	ЛОЖЬ КАК МногострочноеПоле
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиВидовКонтактнойИнформации КАК НастройкиВидовКонтактнойИнформации
		|		ПО ВидыКонтактнойИнформации.Ссылка = НастройкиВидовКонтактнойИнформации.Вид
		|ГДЕ
		|	ВидыКонтактнойИнформации.ПометкаУдаления = ЛОЖЬ
		|	И ВидыКонтактнойИнформации.Ссылка = &ВидКИ
		|	И ВидыКонтактнойИнформации.Используется
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВидыКонтактнойИнформации.Ссылка,
		|	"""",
		|	NULL,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка),
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	"""",
		|	ЛОЖЬ,
		|	NULL,
		|	ЛОЖЬ,
		|	NULL,
		|	ЛОЖЬ
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации";
	
	Запрос.УстановитьПараметр("ВидКИ", ВидКИ);
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ТаблицаСвойств = Запрос.Выполнить().Выгрузить();
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаСвойств[0]);
	
КонецФункции

// Процедура - Заполнить таблицу контактной информации
//
// Параметры:
//  Форма		 - 	 - 
//  ВладелецКИ	 - 	 - 
//
Процедура ЗаполнитьТаблицуКонтактнойИнформации(Форма, Объект, ПараметрыНовогоНомера = Неопределено)
	
	Форма.КонтактнаяИнформация.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорядокТипов.Тип КАК Тип,
	|	ПорядокТипов.Порядок КАК Порядок
	|ПОМЕСТИТЬ втПорядокТипов
	|ИЗ
	|	&ПорядокТипов КАК ПорядокТипов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК ИдентификаторСтрокиТабличнойЧасти
	|ПОМЕСТИТЬ втИдентификаторыСтрокТабличнойЧасти
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка КАК Вид,
	|	ВидыКонтактнойИнформации.Тип КАК Тип,
	|	ВидыКонтактнойИнформации.РеквизитДопУпорядочивания КАК ПорядокВидов,
	|	втПорядокТипов.Порядок КАК ПорядокТипов,
	|	втИдентификаторыСтрокТабличнойЧасти.ИдентификаторСтрокиТабличнойЧасти КАК ИдентификаторСтрокиТабличнойЧасти
	|ПОМЕСТИТЬ втВсегдаВыводимыеВиды
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПорядокТипов КАК втПорядокТипов
	|		ПО ВидыКонтактнойИнформации.Тип = втПорядокТипов.Тип,
	|	втИдентификаторыСтрокТабличнойЧасти КАК втИдентификаторыСтрокТабличнойЧасти
	|ГДЕ
	|	ВидыКонтактнойИнформации.Ссылка В(&ВсегдаВыводимыеВиды)
	|	И ВидыКонтактнойИнформации.Используется
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Вид"
	+ ОбщегоНазначения.РазделительПакетаЗапросов();
	
	Если Форма.ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти Тогда
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"ВЫБРАТЬ
			|	0 КАК ИдентификаторСтрокиТабличнойЧасти
			|ПОМЕСТИТЬ втИдентификаторыСтрокТабличнойЧасти
			|;",
			"ВЫБРАТЬ
			|	ИдентификаторыСтрокТабличнойЧасти.Значение КАК ИдентификаторСтрокиТабличнойЧасти
			|ПОМЕСТИТЬ втИдентификаторыСтрокТабличнойЧасти
			|ИЗ &ИдентификаторыСтрокТабличнойЧасти КАК ИдентификаторыСтрокТабличнойЧасти
			|;"
		);
		Запрос.УстановитьПараметр("ИдентификаторыСтрокТабличнойЧасти", Форма.ИдентификаторыСтрокТабличнойЧасти.Выгрузить());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ЗапросТекст = "
		|ВЫБРАТЬ
		|	ВладелецКонтактнаяИнформация.Вид КАК Вид,
		|	ВладелецКонтактнаяИнформация.Тип КАК Тип,
		|	ВладелецКонтактнаяИнформация.Представление КАК Представление,
		|	ВладелецКонтактнаяИнформация.Значение КАК Значение,
		|	ВладелецКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
		|	0 КАК ИдентификаторСтрокиТабличнойЧасти,
		|	ВладелецКонтактнаяИнформация.Вид.РеквизитДопУпорядочивания КАК ПорядокВидов,
		|	втПорядокТипов.Порядок КАК ПорядокТипов,
		|	&НеУчаствоватьВРассылке КАК НеУчаствоватьВРассылке		
		|ПОМЕСТИТЬ втДанныеКИ
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК ВладелецКонтактнаяИнформация
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПорядокТипов КАК втПорядокТипов
		|		ПО ВладелецКонтактнаяИнформация.Тип = втПорядокТипов.Тип
		|ГДЕ
		|	ВладелецКонтактнаяИнформация.Ссылка = &ВладелецКИ
		|	И ВладелецКонтактнаяИнформация.Вид <> ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПустаяСсылка)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Вид";
		
		Если Форма.ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти Тогда
			ЗапросТекст = СтрЗаменить(ЗапросТекст, "0 КАК ИдентификаторСтрокиТабличнойЧасти",
				"ЕСТЬNULL(ВладелецКонтактнаяИнформация.ИдентификаторСтрокиТабличнойЧасти, 0) КАК ИдентификаторСтрокиТабличнойЧасти");
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + ЗапросТекст;
		
	Иначе
		Запрос.Текст = Запрос.Текст + "
		|ВЫБРАТЬ
		|	ТаблицаКИ.Вид,
		|	ТаблицаКИ.Тип,
		|	ТаблицаКИ.Представление,
		|	ТаблицаКИ.Значение,
		|	ТаблицаКИ.ЗначенияПолей
		|ПОМЕСТИТЬ втТаблицаКИ
		|ИЗ
		|	&ТаблицаКИ КАК ТаблицаКИ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВладелецКонтактнаяИнформация.Вид КАК Вид,
		|	ВладелецКонтактнаяИнформация.Тип КАК Тип,
		|	ВладелецКонтактнаяИнформация.Представление КАК Представление,
		|	ВладелецКонтактнаяИнформация.Значение КАК Значение,
		|	ВладелецКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
		|	0 КАК ИдентификаторСтрокиТабличнойЧасти,
		|	ВладелецКонтактнаяИнформация.Вид.РеквизитДопУпорядочивания КАК ПорядокВидов,
		|	втПорядокТипов.Порядок КАК ПорядокТипов,
		|	ЛОЖЬ КАК НеУчаствоватьВРассылке				
		|ПОМЕСТИТЬ втДанныеКИ
		|ИЗ
		|	втТаблицаКИ КАК ВладелецКонтактнаяИнформация
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПорядокТипов КАК втПорядокТипов
		|		ПО ВладелецКонтактнаяИнформация.Тип = втПорядокТипов.Тип
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Вид";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() + "
	|ВЫБРАТЬ
	|	ЕСТЬNULL(втДанныеКИ.Вид, втВсегдаВыводимыеВиды.Вид) КАК Вид,
	|	ЕСТЬNULL(втДанныеКИ.Тип, втВсегдаВыводимыеВиды.Тип) КАК Тип,
	|	ЕСТЬNULL(втДанныеКИ.Представление, """") КАК Представление,
	|	ЕСТЬNULL(втДанныеКИ.Значение, """") КАК Значение,
	|	ЕСТЬNULL(втДанныеКИ.ЗначенияПолей, """") КАК ЗначенияПолей,
	|	ЕСТЬNULL(втДанныеКИ.ИдентификаторСтрокиТабличнойЧасти, втВсегдаВыводимыеВиды.ИдентификаторСтрокиТабличнойЧасти) КАК ИдентификаторСтрокиТабличнойЧасти,
	|	ЕСТЬNULL(втДанныеКИ.ПорядокТипов, втВсегдаВыводимыеВиды.ПорядокТипов) КАК ПорядокТипов,
	|	ЕСТЬNULL(втДанныеКИ.ПорядокВидов, втВсегдаВыводимыеВиды.ПорядокВидов) КАК ПорядокВидов,
	|	ЕСТЬNULL(втДанныеКИ.НеУчаствоватьВРассылке, ЛОЖЬ) КАК НеУчаствоватьВРассылке
	|ИЗ
	|	втВсегдаВыводимыеВиды КАК втВсегдаВыводимыеВиды
	|		ПОЛНОЕ СОЕДИНЕНИЕ втДанныеКИ КАК втДанныеКИ
	|		ПО втВсегдаВыводимыеВиды.Вид = втДанныеКИ.Вид
	|			И втВсегдаВыводимыеВиды.ИдентификаторСтрокиТабличнойЧасти = втДанныеКИ.ИдентификаторСтрокиТабличнойЧасти
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИдентификаторСтрокиТабличнойЧасти,
	|	ПорядокТипов,
	|	ПорядокВидов";
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.Контрагенты", Объект.Ссылка.Метаданные().ПолноеИмя());
		Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.Контрагенты")
			ИЛИ ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.Заявки") Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НеУчаствоватьВРассылке", "ВладелецКонтактнаяИнформация.НеУчаствоватьВРассылке");
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НеУчаствоватьВРассылке", "ЛОЖЬ");
		КонецЕсли;	
	Иначе
		Запрос.УстановитьПараметр("ТаблицаКИ", Объект.КонтактнаяИнформация.Выгрузить(,"Вид,Тип,Представление,Значение,ЗначенияПолей"));
	КонецЕсли;
	
	ВсегдаВыводимыеВиды = Форма.СвойстваВидовКонтактнойИнформации.Выгрузить(Новый Структура("ВыводитьВФормеВсегда", Истина), "Вид");
	
	Запрос.УстановитьПараметр("ВладелецКИ",		Объект.Ссылка);
	Запрос.УстановитьПараметр("ПорядокТипов",	ПорядокТиповКИ());
	Запрос.УстановитьПараметр("ВсегдаВыводимыеВиды", ВсегдаВыводимыеВиды);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Форма.КонтактнаяИнформация.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		// Конвертация
		Если ПустаяСтрока(Выборка.Значение) Тогда
			Если ЗначениеЗаполнено(Выборка.ЗначенияПолей) Тогда
				// НоваяСтрока.Значение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(Выборка.ЗначенияПолей, Выборка.Тип);
				КонтактнаяИнформацияПоПолям = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияВСтруктуруJSON(Выборка.ЗначенияПолей, Выборка.Тип, Выборка.Представление, Ложь);
				НоваяСтрока.Значение = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(КонтактнаяИнформацияПоПолям);				
			ИначеЕсли ЗначениеЗаполнено(Выборка.Представление) Тогда
				Если Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон ИЛИ Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.Факс Тогда
					ЗначенияПолей = Новый СписокЗначений;
					УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(Выборка.Представление, ЗначенияПолей);
					НоваяСтрока.Значение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Выборка.Представление, Выборка.Тип);
				Иначе 	
					НоваяСтрока.Значение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Выборка.Представление, Выборка.Тип);
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока.Комментарий = УправлениеКонтактнойИнформацией.КомментарийКонтактнойИнформации(НоваяСтрока.Значение);
	КонецЦикла;
	
	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		Если НЕ ПараметрыНовогоНомера = Неопределено Тогда 
			Если ПараметрыНовогоНомера.Свойство("ДобавитьНомерТелефона") И ПараметрыНовогоНомера.Свойство("НомерТелефона") Тогда
				НоваяСтрока = Неопределено;
				МассивСтрокИмеющейсяКИ 		= Форма.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
				Если НЕ МассивСтрокИмеющейсяКИ.Количество() = 0 Тогда 
					Для Каждого СтрокаМассива Из МассивСтрокИмеющейсяКИ Цикл 
						Если НЕ ЗначениеЗаполнено(СтрокаМассива.ЗначенияПолей) И НЕ ЗначениеЗаполнено(СтрокаМассива.Представление) Тогда
							НоваяСтрока 	= СтрокаМассива;
							Прервать;
						КонецЕсли;
					КонецЦикла;	
				КонецЕсли;
				Если НоваяСтрока = Неопределено Тогда 
					НоваяСтрока 			= Форма.КонтактнаяИнформация.Добавить();
					НоваяСтрока.Вид 		= ?(Объект.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты, Справочники.ВидыКонтактнойИнформации.ТелефонКлиента, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);				
				КонецЕсли;
				НоваяСтрока.Тип 			= Перечисления.ТипыКонтактнойИнформации.Телефон;
				Если НЕ ЗначениеЗаполнено(НоваяСтрока.Вид) Тогда 
					НоваяСтрока.Вид 		= ?(Объект.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты, Справочники.ВидыКонтактнойИнформации.ТелефонКлиента, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);				
				КонецЕсли;	
				НоваяСтрока.Представление 	= ПараметрыНовогоНомера.НомерТелефона;
				НоваяСтрока.ЗначенияПолей 	= УправлениеКонтактнойИнформациейСлужебныйВызовСервераСтоматология.КонтактнаяИнформацияXMLПоПредставлению(НоваяСтрока.Представление, НоваяСтрока.Вид);
				НоваяСтрока.Значение 		= УправлениеКонтактнойИнформациейСлужебныйВызовСервераСтоматология.КонтактнаяИнформацияПоПредставлению(НоваяСтрока.Представление, НоваяСтрока.Вид);			
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Обновить контекстное меню
//
// Параметры:
//  Форма					 - 	 - 
//  ИмяЭлементаДляРазмещения - 	 - 
//
Процедура ОбновитьКонтекстноеМеню(Форма, ИмяЭлементаДляРазмещения)
	
	ПараметрыКонтактнойИнформации = Форма.ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения];  // см. ПараметрыВыводаКонтактнойИнформации
	ВсеСтроки = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов;
	НайденныеСтроки = ВсеСтроки.НайтиСтроки( 
		Новый Структура("Тип, ЭтоРеквизитТабличнойЧасти", Перечисления.ТипыКонтактнойИнформации.Адрес, Ложь));
		
	ОбщееКоличествоКоманд = 0;
	Для Каждого СтрокаКИ Из ВсеСтроки Цикл
		
		Если ОбщееКоличествоКоманд > 50 Тогда // Ограничение для большого количества адресов на форме
			Прервать;
		КонецЕсли;
		
		Если СтрокаКИ.Тип <> Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
			Продолжить;
		КонецЕсли;
		
		ПодменюКопироватьАдреса = Форма.Элементы.Найти("ПодменюКопироватьАдреса" + СтрокаКИ.ИмяРеквизита);
		КонтекстноеПодменюКопироватьАдреса = Форма.Элементы.Найти("КонтекстноеПодменюКопироватьАдреса" + СтрокаКИ.ИмяРеквизита);
		Если ПодменюКопироватьАдреса <> Неопределено И КонтекстноеПодменюКопироватьАдреса = Неопределено Тогда
			Продолжить;
		КонецЕсли;
			
		КоличествоКомандВПодменю = 0;
		СписокАдресовВПодменю = Новый Соответствие();
		СписокАдресовВПодменю.Вставить(ВРег(СтрокаКИ.Представление), Истина);
		
		Для Каждого Адрес Из НайденныеСтроки Цикл
			
			Если КоличествоКомандВПодменю > 7 Тогда // Ограничение для большого количества адресов на форме
				Прервать;
			КонецЕсли;
			
			Если Адрес.ЭтоИсторическаяКонтактнаяИнформация Или Адрес.ИмяРеквизита = СтрокаКИ.ИмяРеквизита Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяКоманды = "МенюПодменюАдрес" + СтрокаКИ.ИмяРеквизита + "_" + Адрес.ИмяРеквизита;
			Команда = Форма.Команды.Найти(ИмяКоманды);
			Если Команда = Неопределено Тогда
				Команда = Форма.Команды.Добавить(ИмяКоманды);
				Команда.Подсказка = НСтр("ru = 'Скопировать адрес'");
				Команда.Действие = "Подключаемый_КонтактнаяИнформацияВыполнитьКоманду";
				Команда.ИзменяетСохраняемыеДанные = Истина;
				
				ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 9, Истина);
				КоличествоКомандВПодменю = КоличествоКомандВПодменю + 1;
			КонецЕсли;
			
			ПредставлениеАдреса = ?(СтрокаКИ.МеждународныйФорматАдреса,
				СтроковыеФункции.СтрокаЛатиницей(Адрес.Представление), Адрес.Представление);
			
			Если СписокАдресовВПодменю[ВРег(Адрес.Представление)] <> Неопределено Тогда
				ПредставлениеАдреса = "";
			Иначе
				СписокАдресовВПодменю.Вставить(ВРег(Адрес.Представление), Истина);
			КонецЕсли;
			
			Если ПодменюКопироватьАдреса <> Неопределено Тогда
				ДобавитьКнопкуСкопироватьАдрес(Форма, ИмяКоманды, 
					ПредставлениеАдреса, ПараметрыКонтактнойИнформации, ПодменюКопироватьАдреса);
				КонецЕсли;
				
			Если КонтекстноеПодменюКопироватьАдреса <> Неопределено Тогда
				ДобавитьКнопкуСкопироватьАдрес(Форма, ИмяКоманды, 
					ПредставлениеАдреса, ПараметрыКонтактнойИнформации, КонтекстноеПодменюКопироватьАдреса);
			КонецЕсли;
			
		КонецЦикла;
		ОбщееКоличествоКоманд = ОбщееКоличествоКоманд + КоличествоКомандВПодменю;
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Добавить кнопку скопировать адрес
//
// Параметры:
//  Форма							 - 	 - 
//  ИмяКоманды						 - 	 - 
//  ЗаголовокЭлемента				 - 	 - 
//  ПараметрыКонтактнойИнформации	 - 	 - 
//  Подменю							 - 	 - 
//
Процедура ДобавитьКнопкуСкопироватьАдрес(Форма, ИмяКоманды, ЗаголовокЭлемента, ПараметрыКонтактнойИнформации, Подменю)
	
	ИмяЭлемента = Подменю.Имя + "_" + ИмяКоманды;
	Кнопка = Форма.Элементы.Найти(ИмяЭлемента);
	Если Кнопка = Неопределено Тогда
		Кнопка = Форма.Элементы.Добавить(ИмяЭлемента, Тип("КнопкаФормы"), Подменю);
		Кнопка.ИмяКоманды = ИмяКоманды;
		ДобавленныеЭлементы = ПараметрыКонтактнойИнформации.ДобавленныеЭлементы; // СписокЗначений
		ДобавленныеЭлементы.Добавить(ИмяЭлемента, 1);
	КонецЕсли;
	Кнопка.Заголовок = ЗаголовокЭлемента;
	Кнопка.Видимость = ЗначениеЗаполнено(ЗаголовокЭлемента);

КонецПроцедуры

// Функция - Есть другие заполненные строки вида КИ
//
// Параметры:
//  Форма					 - 	 - 
//  ПроверяемаяСтрока		 - 	 - 
//  ВидКонтактнойИнформации	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЕстьДругиеЗаполненныеСтрокиВидаКИ(Знач Форма, Знач ПроверяемаяСтрока, Знач ВидКонтактнойИнформации)
	
	ВсеСтрокиЭтогоВида = Форма.КонтактнаяИнформация.НайтиСтроки(
		Новый Структура("Вид", ВидКонтактнойИнформации));
	
	Для Каждого СтрокаВида Из ВсеСтрокиЭтогоВида Цикл
		
		Если СтрокаВида <> ПроверяемаяСтрока И Не ПустаяСтрока(СтрокаВида.Представление) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Процедура - Добавить команду контекстного меню
//
// Параметры:
//  Форма		 - 	 - 
//  ИмяКоманды	 - 	 - 
//  Картинка	 - 	 - 
//  Заголовок	 - 	 - 
//  Подсказка	 - 	 - 
//  ПолеВладелец - 	 - 
//
Процедура ДобавитьКомандуКонтекстногоМеню(Форма, ИмяКоманды, Картинка, Заголовок, Подсказка, ПолеВладелец)
	
	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		Команда = Форма.Команды.Добавить(ИмяКоманды);
		Команда.Картинка = Картинка;
		Команда.Заголовок = Заголовок;
		Команда.Подсказка = Подсказка;
		Команда.Действие = "Подключаемый_КонтактнаяИнформация_ВыполнитьКоманду";
	КонецЕсли;
	
	Кнопка = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ПолеВладелец.КонтекстноеМеню);
	Кнопка.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

// Функция - Получить параметры свойств полей КИ
//
// Параметры:
//  ВладелецКИ	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПараметрыСвойствПолейКИ(Знач ИмяФормы, Знач ВладелецКИ, Знач ВладелецКИОбъект)
	
	ПараметрыСвойствПолейКИ = Новый Структура("Надпись_МаксимальнаяШирина, Представление_МаксимальнаяШирина_БезКомм, Представление_МаксимальнаяШирина_СКомм, Комментарий_МаксимальнаяШирина, ТолькоПросмотр");
	ПараметрыСвойствПолейКИ.ТолькоПросмотр = Ложь;
	
	ЭтоКлиент = Ложь;
	ЭтоКонтрагент = Ложь;
	
	Если ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.Контрагенты") Тогда 
		
		Если НЕ ЗначениеЗаполнено(ВладелецКИ) Тогда 
			ВладелецКИ = ВладелецКИОбъект;
		КонецЕсли;	
		Если ЗначениеЗаполнено(ВладелецКИ.ТипКонтрагента) Тогда 
			Если ВладелецКИ.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты Тогда 
				ЭтоКлиент = Истина;
			Иначе 
				ЭтоКонтрагент = Истина;
			КонецЕсли;
		ИначеЕсли ВладелецКИ.Родитель.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты Тогда 
			ЭтоКлиент = Истина;
		Иначе 
			ЭтоКонтрагент = Истина;
		КонецЕсли;

		Если РольДоступна(Метаданные.Роли.ПолныеПрава) ИЛИ РольДоступна(Метаданные.Роли.ДобавлениеИзменениеКлиентов) ИЛИ НЕ ЗначениеЗаполнено(ВладелецКИОбъект.Ссылка) Тогда
			КИ_ТолькоПросмотр = Ложь;
		ИначеЕсли РольДоступна(Метаданные.Роли.ИзменениеСвоихКлиентовКуратором) Тогда 
			Если ПараметрыСеанса.ТекущийПользователь = ВладелецКИОбъект.Куратор Тогда 
				КИ_ТолькоПросмотр = Ложь;
			Иначе 
				КИ_ТолькоПросмотр = Истина;
			КонецЕсли;			
		ИначеЕсли РольДоступна(Метаданные.Роли.ДобавлениеКлиентов) Тогда
			КИ_ТолькоПросмотр = Истина;
		Иначе 
			КИ_ТолькоПросмотр = Ложь;
		КонецЕсли;	
		
		Если ЭтоКлиент Тогда // Это не потенциальный клиент
			Если СтрЗаменить(ИмяФормы, "Справочник.Контрагенты.Форма.", "") = "ФормаЭлементаКлиента" Тогда
				// "ФормаЭлементаКлиентыНовая" Тогда 
				ПараметрыСвойствПолейКИ.Надпись_МаксимальнаяШирина 					= 9;
				ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_БезКомм 	= 39;
				ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_СКомм 		= 25;
				ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина 				= 15;
				ПараметрыСвойствПолейКИ.ТолькоПросмотр 								= КИ_ТолькоПросмотр;
			ИначеЕсли СтрЗаменить(ИмяФормы, "Справочник.Контрагенты.Форма.", "") = "ФормаЭлементаКлиенты" Тогда
				// "ФормаЭлементаПотенциальныйКлиентНовая" Тогда	
				ПараметрыСвойствПолейКИ.Надпись_МаксимальнаяШирина 					= 9;
				ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_БезКомм 	= 60;
				ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_СКомм 		= 36;
				ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина 				= 13;
				ПараметрыСвойствПолейКИ.ТолькоПросмотр 								= КИ_ТолькоПросмотр;
			ИначеЕсли ИмяФормы = "Справочник.Сделки.Форма.ФормаЭлемента" Тогда
				ПараметрыСвойствПолейКИ.Надпись_МаксимальнаяШирина 					= 7;
				ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_БезКомм 	= 60;
				ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_СКомм 		= 33;
				ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина 				= 14;
				ПараметрыСвойствПолейКИ.ТолькоПросмотр 								= КИ_ТолькоПросмотр;
			Иначе 
				ПараметрыСвойствПолейКИ.Надпись_МаксимальнаяШирина 					= 9;
				ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_БезКомм 	= 60;
				ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_СКомм 		= 36;
				ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина 				= 13;
				ПараметрыСвойствПолейКИ.ТолькоПросмотр 								= КИ_ТолькоПросмотр;				
			КонецЕсли;	
		Иначе // Это контрагент	
			ПараметрыСвойствПолейКИ.Надпись_МаксимальнаяШирина 					= 10;
			ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_БезКомм 	= 66;
			ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_СКомм 		= 45;
			ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина 				= 19;
			ПараметрыСвойствПолейКИ.ТолькоПросмотр 								= КИ_ТолькоПросмотр;				
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.Заявки") Тогда	
		
		ПараметрыСвойствПолейКИ.Надпись_МаксимальнаяШирина 					= 10;
		ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_БезКомм 	= 60;
		ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_СКомм 		= 32;
		ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина 				= 12;
		
	ИначеЕсли ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.Сотрудники") Тогда	
		
		ПараметрыСвойствПолейКИ.Надпись_МаксимальнаяШирина 					= 6;
		ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_БезКомм 	= 40;
		ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_СКомм 		= 30;
		ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина 				= 8;
		
	ИначеЕсли ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.СтруктурныеЕдиницы") 
		Или ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.ВнешниеСистемы") Тогда	

		ПараметрыСвойствПолейКИ.Надпись_МаксимальнаяШирина 					= 13;
		ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_БезКомм 	= 63;
		ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_СКомм 		= 36;
		ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина 				= 15;

	ИначеЕсли ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.Организации") Тогда	
		
		ПараметрыСвойствПолейКИ.Надпись_МаксимальнаяШирина 					= 13;
		ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_БезКомм 	= 43;
		ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_СКомм 		= 33;
		ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина 				= 8;
		
	КонецЕсли;
	
	Возврат ПараметрыСвойствПолейКИ;
		
КонецФункции

// Функция - Параметры вывода контактной информации
//
// Параметры:
//  Форма					 - 	 - 
//  ИмяЭлементаДляРазмещения - 	 - 
//  ПоложениеЗаголовкаКИ	 - 	 - 
//  ОтложеннаяИнициализация	 - 	 - 
//  ИсключаемыеВиды			 - 	 - 
//  СкрываемыеВиды			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПараметрыВыводаКонтактнойИнформации(Форма, ИмяЭлементаДляРазмещения, ПоложениеЗаголовкаКИ, ОтложеннаяИнициализация, ИсключаемыеВиды, СкрываемыеВиды)
	
	Если ТипЗнч(Форма.ПараметрыКонтактнойИнформации) <> Тип("Структура") Тогда
		Форма.ПараметрыКонтактнойИнформации = Новый Структура;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ОтправкаSMS") Тогда
		МожноОтправлятьSMS = Истина;
	Иначе
		МожноОтправлятьSMS = Ложь;
	КонецЕсли;
	
	ПараметрыКонтактнойИнформации = Новый Структура;
	ПараметрыКонтактнойИнформации.Вставить("ГруппаДляРазмещения",              ИмяЭлементаДляРазмещения);
	ПараметрыКонтактнойИнформации.Вставить("ПоложениеЗаголовка",               ЗначениеПоложенияЗаголовкаКИ(ПоложениеЗаголовкаКИ));
	ПараметрыКонтактнойИнформации.Вставить("ДобавленныеРеквизиты",             Новый СписокЗначений); 
	ПараметрыКонтактнойИнформации.Вставить("ОтложеннаяИнициализация",          ОтложеннаяИнициализация);
	ПараметрыКонтактнойИнформации.Вставить("ИсключаемыеВиды",                  ИсключаемыеВиды);
	ПараметрыКонтактнойИнформации.Вставить("ВыполненаОтложеннаяИнициализация", Ложь);
	ПараметрыКонтактнойИнформации.Вставить("ДобавленныеЭлементы",              Новый СписокЗначений);
	ПараметрыКонтактнойИнформации.Вставить("СписокДобавляемыхЭлементов",       Новый СписокЗначений);
	ПараметрыКонтактнойИнформации.Вставить("МожноОтправлятьSMS",               МожноОтправлятьSMS);
	ПараметрыКонтактнойИнформации.Вставить("Владелец",                         Неопределено);
	ПараметрыКонтактнойИнформации.Вставить("ОбработкаНавигационнойСсылки",     Ложь);
	ПараметрыКонтактнойИнформации.Вставить("СкрываемыеВиды",                   СкрываемыеВиды);
	
	ПараметрыАдреса = Новый Структура("ТипПомещения, Страна, Индекс", "Квартира");
	ПараметрыКонтактнойИнформации.Вставить("ПараметрыАдреса", ПараметрыАдреса);
	
	Форма.ПараметрыКонтактнойИнформации.Вставить(ИмяЭлементаДляРазмещения, ПараметрыКонтактнойИнформации);
	Возврат Форма.ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения];
	
КонецФункции

// Функция - Группа видов контактной информации объекта
//
// Параметры:
//  ПолноеИмяОбъектаМетаданных	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ГруппаВидовКонтактнойИнформацииОбъекта(Знач ПолноеИмяОбъектаМетаданных)
	
	Возврат УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени(СтрЗаменить(ПолноеИмяОбъектаМетаданных, ".", ""));
	
КонецФункции

// Функция - Сформировать текст запроса
//
// Параметры:
//  ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти - 	 - 
//  ТекстЗапросаИсторическаяИнформация			 - 	 - 
//  ЭтоОсновнойЯзык								 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьТекстЗапроса(Знач ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти, Знач ТекстЗапросаИсторическаяИнформация, Знач ЭтоОсновнойЯзык)
	
	Если ЭтоОсновнойЯзык Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление               КАК Представление,
		|	КонтактнаяИнформация.Значение                    КАК Значение,
		|	КонтактнаяИнформация.ЗначенияПолей               КАК ЗначенияПолей,
		|	КонтактнаяИнформация.НомерСтроки                 КАК НомерСтроки,
		|	&ДействуетС                                      КАК ДействуетС,
		|	&ЭтоИсторическаяКонтактнаяИнформация             КАК ЭтоИсторическаяКонтактнаяИнформация,
		|	КонтактнаяИнформация.Вид                         КАК Вид,
		|	&ИдентификаторСтрокиТабличнойЧасти               КАК ИдентификаторСтрокиТабличнойЧасти
		|ПОМЕСТИТЬ КонтактнаяИнформация
		|ИЗ
		|	&ТаблицаКонтактнойИнформации КАК КонтактнаяИнформация
		|		
		|ИНДЕКСИРОВАТЬ ПО
		|	Вид
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыКонтактнойИнформации.Ссылка                       КАК Вид,
		|	ВЫБОР
		|		КОГДА ВидыКонтактнойИнформации.ИмяПредопределенногоВида <> """"
		|			ТОГДА ВидыКонтактнойИнформации.ИмяПредопределенногоВида
		|		ИНАЧЕ ВидыКонтактнойИнформации.ИмяПредопределенныхДанных
		|	КОНЕЦ КАК ИмяПредопределенногоВида,
		|	ВидыКонтактнойИнформации.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
		|	ВидыКонтактнойИнформации.Тип                          КАК Тип,
		|	ВидыКонтактнойИнформации.ОбязательноеЗаполнение       КАК ОбязательноеЗаполнение,
		|	ЛОЖЬ            									  КАК МногострочноеПоле,
		|	""""                    							  КАК Подсказка,
		|	ВидыКонтактнойИнформации.Наименование                 КАК Наименование,		
		|	ВидыКонтактнойИнформации.ВидПоляДругое                КАК ВидПоляДругое,
		|	ВидыКонтактнойИнформации.РазрешитьВводНесколькихЗначений КАК РазрешитьВводНесколькихЗначений,
		|	ВидыКонтактнойИнформации.ХранитьИсториюИзменений      КАК ХранитьИсториюИзменений,
		|	ВидыКонтактнойИнформации.ВидРедактирования = ""Диалог"" КАК РедактированиеТолькоВДиалоге,		
		|	ВидыКонтактнойИнформации.ВидРедактирования            КАК ВидРедактирования,
		|	ЕСТЬNULL(НастройкиВидовКонтактнойИнформации.ВыводитьВФормеВсегда, ЛОЖЬ) КАК ВыводитьВФормеВсегда,			
		|	ВидыКонтактнойИнформации.ЭтоГруппа                    КАК ЭтоРеквизитТабличнойЧасти,
		|	ВидыКонтактнойИнформации.РеквизитДопУпорядочивания    КАК РеквизитДопУпорядочивания,
		|	ВидыКонтактнойИнформации.МеждународныйФорматАдреса    КАК МеждународныйФорматАдреса,
		|	ЕСТЬNULL(КонтактнаяИнформация.ЭтоИсторическаяКонтактнаяИнформация, ЛОЖЬ)    КАК ЭтоИсторическаяКонтактнаяИнформация,
		|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """")    КАК Представление,
		|	ЕСТЬNULL(КонтактнаяИнформация.ЗначенияПолей, """")    КАК ЗначенияПолей,
		|	ЕСТЬNULL(КонтактнаяИнформация.Значение, """")         КАК Значение,
		|	ЕСТЬNULL(КонтактнаяИнформация.ДействуетС, 0)          КАК ДействуетС,
		|	ЕСТЬNULL(КонтактнаяИнформация.НомерСтроки, 0)         КАК НомерСтроки,
		|	0 КАК ИдентификаторСтрокиТабличнойЧасти,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(200))                        КАК ИмяРеквизита,
		|	ВидыКонтактнойИнформации.ПометкаУдаления              КАК ПометкаУдаления,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА)                             КАК Комментарий
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|		ЛЕВОЕ СОЕДИНЕНИЕ КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО ВидыКонтактнойИнформации.Ссылка = КонтактнаяИнформация.Вид
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиВидовКонтактнойИнформации КАК НастройкиВидовКонтактнойИнформации
		|		ПО ВидыКонтактнойИнформации.Ссылка = НастройкиВидовКонтактнойИнформации.Вид				
		|ГДЕ
		|	НЕ ВидыКонтактнойИнформации.ПометкаУдаления		
		|	И ВидыКонтактнойИнформации.Используется
		|	И ЕСТЬNULL(ВидыКонтактнойИнформации.Родитель.Используется, ИСТИНА)
		|	И (ВидыКонтактнойИнформации.Родитель = &ГруппаВидовКИ
		|		ИЛИ ВидыКонтактнойИнформации.Родитель.Родитель = &ГруппаВидовКИ)
		|	И ВидыКонтактнойИнформации.Ссылка НЕ В (&СкрываемыеВиды)
		|УПОРЯДОЧИТЬ ПО
		|	ВидыКонтактнойИнформации.Ссылка ИЕРАРХИЯ";
		
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Представление,
		|	КонтактнаяИнформация.Значение КАК Значение,
		|	КонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
		|	КонтактнаяИнформация.НомерСтроки КАК НомерСтроки,
		|	&ДействуетС КАК ДействуетС,
		|	&ЭтоИсторическаяКонтактнаяИнформация КАК ЭтоИсторическаяКонтактнаяИнформация,
		|	КонтактнаяИнформация.Вид КАК Вид,
		|	&ИдентификаторСтрокиТабличнойЧасти КАК ИдентификаторСтрокиТабличнойЧасти
		|ПОМЕСТИТЬ КонтактнаяИнформация
		|ИЗ
		|	&ТаблицаКонтактнойИнформации КАК КонтактнаяИнформация
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Вид
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыКонтактнойИнформации.Ссылка КАК Вид,
		|	ВЫБОР
		|		КОГДА ВидыКонтактнойИнформации.ИмяПредопределенногоВида <> """"
		|			ТОГДА ВидыКонтактнойИнформации.ИмяПредопределенногоВида
		|		ИНАЧЕ ВидыКонтактнойИнформации.ИмяПредопределенныхДанных
		|	КОНЕЦ КАК ИмяПредопределенногоВида,
		|	ВидыКонтактнойИнформации.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
		|	ВидыКонтактнойИнформации.Тип КАК Тип,
		|	ВидыКонтактнойИнформации.ОбязательноеЗаполнение КАК ОбязательноеЗаполнение,
		|	ЛОЖЬ КАК МногострочноеПоле,
		|	"""" КАК Подсказка,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ВидыКонтактнойИнформацииПредставления.Наименование, ВидыКонтактнойИнформации.Наименование) КАК СТРОКА(150)) КАК Наименование,
		|	ВидыКонтактнойИнформации.ВидПоляДругое КАК ВидПоляДругое,
		|	ВидыКонтактнойИнформации.РазрешитьВводНесколькихЗначений КАК РазрешитьВводНесколькихЗначений,
		|	ВидыКонтактнойИнформации.ХранитьИсториюИзменений КАК ХранитьИсториюИзменений,
		|	ВидыКонтактнойИнформации.ВидРедактирования = ""Диалог"" КАК РедактированиеТолькоВДиалоге,
		|	ВидыКонтактнойИнформации.ВидРедактирования КАК ВидРедактирования,
		|	ЕСТЬNULL(НастройкиВидовКонтактнойИнформации.ВыводитьВФормеВсегда, ЛОЖЬ) КАК ВыводитьВФормеВсегда,
		|	ВидыКонтактнойИнформации.ЭтоГруппа КАК ЭтоРеквизитТабличнойЧасти,
		|	ВидыКонтактнойИнформации.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
		|	ВидыКонтактнойИнформации.МеждународныйФорматАдреса КАК МеждународныйФорматАдреса,
		|	ЕСТЬNULL(КонтактнаяИнформация.ЭтоИсторическаяКонтактнаяИнформация, ЛОЖЬ) КАК ЭтоИсторическаяКонтактнаяИнформация,
		|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК Представление,
		|	ЕСТЬNULL(КонтактнаяИнформация.ЗначенияПолей, """") КАК ЗначенияПолей,
		|	ЕСТЬNULL(КонтактнаяИнформация.Значение, """") КАК Значение,
		|	ЕСТЬNULL(КонтактнаяИнформация.ДействуетС, 0) КАК ДействуетС,
		|	ЕСТЬNULL(КонтактнаяИнформация.НомерСтроки, 0) КАК НомерСтроки,
		|	0 КАК ИдентификаторСтрокиТабличнойЧасти,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(200)) КАК ИмяРеквизита,
		|	ВидыКонтактнойИнформации.ПометкаУдаления КАК ПометкаУдаления,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК Комментарий
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|		ЛЕВОЕ СОЕДИНЕНИЕ КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО ВидыКонтактнойИнформации.Ссылка = КонтактнаяИнформация.Вид
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыКонтактнойИнформации.Представления КАК ВидыКонтактнойИнформацииПредставления
		|		ПО (ВидыКонтактнойИнформацииПредставления.Ссылка = ВидыКонтактнойИнформации.Ссылка)
		|			И (ВидыКонтактнойИнформацииПредставления.КодЯзыка = &КодЯзыка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиВидовКонтактнойИнформации КАК НастройкиВидовКонтактнойИнформации
		|		ПО ВидыКонтактнойИнформации.Ссылка = НастройкиВидовКонтактнойИнформации.Вид
		|ГДЕ
		|	НЕ ВидыКонтактнойИнформации.ПометкаУдаления
		|	И ВидыКонтактнойИнформации.Используется
		|	И ЕСТЬNULL(ВидыКонтактнойИнформации.Родитель.Используется, ИСТИНА)
		|	И (ВидыКонтактнойИнформации.Родитель = &ГруппаВидовКИ
		|			ИЛИ ВидыКонтактнойИнформации.Родитель.Родитель = &ГруппаВидовКИ)
		|	И НЕ ВидыКонтактнойИнформации.Ссылка В (&СкрываемыеВиды)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыКонтактнойИнформации.Ссылка ИЕРАРХИЯ";

	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИдентификаторСтрокиТабличнойЧасти",
		?(ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти,
		"ЕСТЬNULL(КонтактнаяИнформация.ИдентификаторСтрокиТабличнойЧасти, 0)",
		"0"));
	
	Если ТекстЗапросаИсторическаяИнформация Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДействуетС", "КонтактнаяИнформация.ДействуетС");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоИсторическаяКонтактнаяИнформация", "КонтактнаяИнформация.ЭтоИсторическаяКонтактнаяИнформация");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДействуетС", "0");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоИсторическаяКонтактнаяИнформация", "ЛОЖЬ");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция - Получить картинку
//
// Параметры:
//  Флаг - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКартинкуКнопкиЗапретаОповещения(Флаг)
	
	Возврат ?(Флаг, БиблиотекаКартинок.РассылкаЗапрещена, БиблиотекаКартинок.РассылкаРазрешена);
	
КонецФункции

// Функция - Получить подсказку
//
// Параметры:
//  Флаг - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПодсказкуКнопкиЗапретаОповещения(Флаг)
	
	Возврат ?(Флаг, "Рассылка запрещена", "Рассылка разрешена");
	
КонецФункции

// Функция - Вернуть массив мобильных двух значных кодов для азербайджана
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьМассивМобильныхДвухЗначныхКодовДляАзербайджана()
	
	Массив = Новый Массив;
	// гор.
	Массив.Добавить("12");	
	Массив.Добавить("22");
	// Моб.
	Массив.Добавить("40");	
	Массив.Добавить("50");
	Массив.Добавить("51");
	Массив.Добавить("55");
	Массив.Добавить("60");	
	Массив.Добавить("70");
	Массив.Добавить("77");
	
	Возврат Массив;
	
КонецФункции

// Функция - Вернуть массив мобильных двух значных кодов для армении
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьМассивМобильныхДвухЗначныхКодовДляАрмении()
	
	Массив = Новый Массив;
	Массив.Добавить("91");
	Массив.Добавить("99");
	Массив.Добавить("43");
	Массив.Добавить("77");
	Массив.Добавить("93");
	Массив.Добавить("94");
	Массив.Добавить("98");
	Массив.Добавить("55");
	Массив.Добавить("95");
	Массив.Добавить("60");
	
	Возврат Массив;
	
КонецФункции

// Функция - Вернуть массив мобильных двух значных кодов для беларуси.
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьМассивМобильныхДвухЗначныхКодовДляБеларуси()
	
	Массив = Новый Массив;
	Массив.Добавить("24");
	Массив.Добавить("25");
	Массив.Добавить("29");
	Массив.Добавить("33");
	Массив.Добавить("44");
	
	Возврат Массив;
	
КонецФункции

// Функция - Вернуть массив мобильных кодов для ОАЭ
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьМассивМобильныхКодовДляОАЭ()
	
	Массив = Новый Массив;
	Массив.Добавить("50");
	Массив.Добавить("52");
	Массив.Добавить("55");
	Массив.Добавить("56");	
	
	Возврат Массив;
	
КонецФункции

// Функция - Вернуть массив мобильных трех значных кодов для казахстана
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьМассивМобильныхТрехЗначныхКодовДляКазахстана()
	
	Массив = Новый Массив;
	Массив.Добавить("610");
	Массив.Добавить("620");
	Массив.Добавить("630");
	Массив.Добавить("640");
	Массив.Добавить("650");
	Массив.Добавить("660");
	Массив.Добавить("670");
	Массив.Добавить("700");
	Массив.Добавить("701");
	Массив.Добавить("702");
	
	Возврат Массив;
	
КонецФункции

// Функция - Вернуть массив мобильных трех значных кодов для украины.
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьМассивМобильныхТрехЗначныхКодовДляУкраины()
	
	Массив = Новый Массив;
	Массив.Добавить("039");
	Массив.Добавить("050");
	Массив.Добавить("063");
	Массив.Добавить("066");
	Массив.Добавить("067");
	Массив.Добавить("068");
	Массив.Добавить("091");
	Массив.Добавить("092");
	Массив.Добавить("093");
	Массив.Добавить("094");
	Массив.Добавить("095");
	Массив.Добавить("096");
	Массив.Добавить("097");
	Массив.Добавить("098");
	Массив.Добавить("099");
	Массив.Добавить("090");
	
	Возврат Массив;
	
КонецФункции

// Функция - Вернуть массив трех значных кодов для РФ.
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьМассивТрехЗначныхКодовДляРФ()
	
	Массив = Новый Массив;
	
	Массив.Добавить("342");
	Массив.Добавить("343");
	Массив.Добавить("347");
	Массив.Добавить("351");
	Массив.Добавить("383");
	Массив.Добавить("391");
	Массив.Добавить("423");
	Массив.Добавить("473");
	Массив.Добавить("495");
	Массив.Добавить("498");
	Массив.Добавить("499");
	Массив.Добавить("812");
	Массив.Добавить("831");
	Массив.Добавить("843");
	Массив.Добавить("846");
	Массив.Добавить("861");
	Массив.Добавить("863");
	
	Возврат Массив;
	
КонецФункции

// Функция - Вернуть массив мобильных кодов для Польши.
//
Функция ВернутьМассивМобильныхКодовДляПольши()
	
	Массив = Новый Массив;
	
	Массив.Добавить("45");
	Массив.Добавить("50");
	Массив.Добавить("51");
	Массив.Добавить("53");
	Массив.Добавить("57");
	Массив.Добавить("60");
	Массив.Добавить("66");
	Массив.Добавить("69");
	Массив.Добавить("72");
	Массив.Добавить("73");
	Массив.Добавить("78");
	Массив.Добавить("79");
	Массив.Добавить("88");
	
	Возврат Массив;

КонецФункции

//
//
Функция ВернутьТелефонТолькоЦифрами(Строка) Экспорт
	
  СтрокаЧисел = "";

   Для Индекс = 1 По СтрДлина(Строка) Цикл
   
      Символ = Сред(Строка, Индекс, 1); // Перебираем все сиволы из нашей строки

      Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда // Код нуля - 48, код 9-ки - 57
         СтрокаЧисел = СтрокаЧисел + Символ;
      КонецЕсли;
   
   КонецЦикла;

   Возврат СтрокаЧисел;	
	
	
КонецФункции

// Проверяет мобильный или городской номер телефона
//
Функция ЭтоГородскойРФ(Строка) Экспорт
	
	Если СтрДлина(Строка) = 11 Тогда
		Возврат ?(Сред(Строка, 2, 1) = "9", Ложь, Истина);		
	Иначе
		Возврат ?(Сред(Строка, 5, 1) = "9", Ложь, Истина);
	КонецЕсли;
		
КонецФункции

#КонецОбласти
