
#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
// Процедура обрабатывает событие начала выбора из списка в поле периода регистрации
// Процедура исполняется только на клиенте
//
Процедура ВыбратьПериодИзСпискаПредставлений(ЭтаФорма, Элемент, Период, ПериодПредставление, НачальноеЗначение = Неопределено) Экспорт

	СтандартнаяОбработка = Ложь;
	
	Если НачальноеЗначение = Неопределено Тогда
		НачальноеЗначение = Период;
	КонецЕсли;
	
	СписокВыбора = Новый СписокЗначений;
	
	ДатаВыборкаМесяца = ?(Год(НачальноеЗначение) <> 1, Дата(Год(НачальноеЗначение) - 1, 12, 01), Дата(01, 01, 02));
	
	Для а = 1 по 13 + ?(Год(НачальноеЗначение) <> 1, 1, 0) Цикл
		Если Год(ДатаВыборкаМесяца) <> Год(НачальноеЗначение) Тогда
			СписокВыбора.Добавить(ДатаВыборкаМесяца, Формат(ДатаВыборкаМесяца, "ДФ='yyyy'") + " г. ...");
		Иначе 
			СписокВыбора.Добавить(ДатаВыборкаМесяца, Формат(ДатаВыборкаМесяца, "ДФ='MMMM yyyy'") + " г.");
		КонецЕсли;
		
		ДатаВыборкаМесяца = ДобавитьМесяц(ДатаВыборкаМесяца, 1);
	КонецЦикла;
	
	ВыбранныйЭлемент = ЭтаФорма.ВыбратьИзСписка(СписокВыбора, Элемент, СписокВыбора.НайтиПоЗначению(Период));
	
	Если ВыбранныйЭлемент = Неопределено Тогда
	ИначеЕсли Год(ВыбранныйЭлемент.Значение) = Год(НачальноеЗначение) Тогда
		Период = ВыбранныйЭлемент.Значение;
		ПериодПредставление  = ВыбранныйЭлемент.Представление;
	ИначеЕсли Год(ВыбранныйЭлемент.Значение) <> Год(НачальноеЗначение) Тогда
		ВыбратьПериодИзСпискаПредставлений(ЭтаФорма, Элемент, Период, ПериодПредставление, ВыбранныйЭлемент.Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Функция возвращает интервалы времени
// 
//  Параметры
//   МассивПериодов - структура, периоды, между которыми необходимо возвратить интервалы
//   Интервал - число, интервал в минутах
//   Формат - строка, представление интервала
//
// Возвращаемое значение:
//   СписокЗначений, список времени с интервалом.
//
Функция ВернутьСписокВремени(МассивПериодов, ДатаНачала, Интервал = 15, Формат = "ДФ=ЧЧ:мм") Экспорт

	СписокВремени = Новый СписокЗначений;
	
	Для Каждого Период Из МассивПериодов Цикл
		Если ДатаНачала Тогда
			Счетчик = 0;
		Иначе
			Счетчик = 1;
		КонецЕсли;
		Период.ДатаНачала = НачалоЧаса(Период.ДатаНачала) + Цел (Минута(Период.ДатаНачала) / 15) * 15 * 60;
		Пока Период.ДатаНачала + Интервал * 60 * Счетчик <= Период.ДатаОкончания Цикл
			Время = Период.ДатаНачала + Интервал * 60 * Счетчик;
			Если СписокВремени.НайтиПоЗначению(Время) = Неопределено Тогда
				Если не ЗначениеЗаполнено(Время) Тогда
					СписокВремени.Добавить(Время, "00:00");
				Иначе
					СписокВремени.Добавить(Время, Формат(Время, Формат));
				КонецЕсли;
			КонецЕсли;			
			Счетчик = Счетчик + 1;
		КонецЦикла;
		Если Период.ДатаОкончания = Дата(01,01,01,23,59,59) и не ДатаНачала Тогда
			СписокВремени.Добавить(Период.ДатаНачала + Интервал * 60 * Счетчик, "24:00");
		КонецЕсли;
	КонецЦикла;

	Возврат СписокВремени; 
	
КонецФункции

&НаКлиенте
// Функция возвращает интервалы времени
// 
//  Параметры
//   МассивПериодов - структура, периоды, между которыми необходимо возвратить интервалы
//   Интервал - число, интервал в минутах
//   Формат - строка, представление интервала
//
// Возвращаемое значение:
//   СписокЗначений, список времени с интервалом.
//
Функция ВернутьСписокВремениДляНачалаРаботы(МассивПериодов, ДатаНачала, Интервал = 15, Формат = "ДФ=ЧЧ:мм") Экспорт

	СписокВремени = Новый СписокЗначений;
	
	Для Каждого Период Из МассивПериодов Цикл
		Если ДатаНачала Тогда
			Счетчик = 0;
		Иначе
			Счетчик = 1;
		КонецЕсли;
		Период.ДатаНачала = НачалоЧаса(Период.ДатаНачала) + Цел (Минута(Период.ДатаНачала) / 15) * 15 * 60;
		Время = Период.ДатаНачала;
		Пока Период.ДатаНачала + Интервал * 60 * Счетчик <= Период.ДатаОкончания Цикл
			Если СписокВремени.НайтиПоЗначению(Время) = Неопределено Тогда
				Если не ЗначениеЗаполнено(Время) Тогда
					СписокВремени.Добавить(Время, "00:00");
				Иначе
					СписокВремени.Добавить(Время, Формат(Время, Формат));
				КонецЕсли;
			КонецЕсли;
			Время = Период.ДатаНачала + Интервал * 60 * Счетчик;			
			Счетчик = Счетчик + 1;
		КонецЦикла;
	КонецЦикла;

	Возврат СписокВремени; 
	
КонецФункции

&НаСервере
// Функция возвращает интервалы времени на сервере.
// 
//  Параметры
//   МассивПериодов - структура, периоды, между которыми необходимо возвратить интервалы
//   Интервал - число, интервал в минутах
//   Формат - строка, представление интервала
//
// Возвращаемое значение:
//   СписокЗначений, список времени с интервалом.
//
Функция ВернутьСписокВремениДляНачалаРаботыСервер(МассивПериодов, УчитыватьДатуНачала, Интервал = 15, Формат = "ДФ=ЧЧ:мм; ДП=00:00") Экспорт

	СписокВремени = Новый СписокЗначений;
	
	Для Каждого Период Из МассивПериодов Цикл
		
		Счетчик = ?(УчитыватьДатуНачала, 0, 1);
		
		Период.ДатаНачала = НачалоЧаса(Период.ДатаНачала) + Цел (Минута(Период.ДатаНачала) / 15) * 15 * 60;
		
		Время = Период.ДатаНачала;
		
		Пока Период.ДатаНачала + Интервал * 60 * Счетчик <= Период.ДатаОкончания Цикл
			
			Если СписокВремени.НайтиПоЗначению(Время) = Неопределено Тогда
				СписокВремени.Добавить(Время, Формат(Время, Формат));
			КонецЕсли;
			
			Время = Период.ДатаНачала + Интервал * 60 * Счетчик;			
			
			Счетчик = Счетчик + 1;
			
		КонецЦикла;
		
	КонецЦикла;

	Возврат СписокВремени; 
	
КонецФункции

&НаКлиенте
// Функция возвращает интервалы времени
// 
//  Параметры
//   МассивПериодов - структура, периоды, между которыми необходимо возвратить интервалы
//   Интервал - число, интервал в минутах
//   Формат - строка, представление интервала
//
// Возвращаемое значение:
//   СписокЗначений, список времени с интервалом.
//
Функция ВернутьСписокВремениДляОкончанияРаботы(МассивПериодов, ДатаНачала, Интервал = 15, Формат = "ДФ=ЧЧ:мм") Экспорт

	СписокВремени = Новый СписокЗначений;
	
	Для Каждого Период Из МассивПериодов Цикл
		Если ДатаНачала Тогда
			Счетчик = 0;
		Иначе
			Счетчик = 1;
		КонецЕсли;
		Период.ДатаНачала = НачалоЧаса(Период.ДатаНачала) + Цел (Минута(Период.ДатаНачала) / 15) * 15 * 60;
		Пока Период.ДатаНачала + Интервал * 60 * Счетчик <= Период.ДатаОкончания Цикл
			Время = Период.ДатаНачала + Интервал * 60 * Счетчик;
			Если СписокВремени.НайтиПоЗначению(Время) = Неопределено Тогда
				Если не ЗначениеЗаполнено(Время) Тогда
					СписокВремени.Добавить(Время, "00:00");
				Иначе
					СписокВремени.Добавить(Время, Формат(Время, Формат));
				КонецЕсли;
			КонецЕсли;			
			Счетчик = Счетчик + 1;
		КонецЦикла;
		Если Период.ДатаОкончания = Дата(01,01,01,23,59,59) и не ДатаНачала Тогда
			СписокВремени.Добавить(Дата(01,01,01,23,59,59), "24:00");
		КонецЕсли;
	КонецЦикла;

	Возврат СписокВремени; 
	
КонецФункции

&НаСервере
// Функция возвращает интервалы времени на сервере.
// 
//  Параметры
//   МассивПериодов - структура, периоды, между которыми необходимо возвратить интервалы
//   Интервал - число, интервал в минутах
//   Формат - строка, представление интервала
//
// Возвращаемое значение:
//   СписокЗначений, список времени с интервалом.
//
Функция ВернутьСписокВремениДляОкончанияРаботыСервер(МассивПериодов, УчитыватьДатуНачала, Интервал = 15, Формат = "ДФ=ЧЧ:мм; ДП=00:00") Экспорт

	СписокВремени = Новый СписокЗначений;
	
	Для Каждого Период Из МассивПериодов Цикл
		
		а = ?(УчитыватьДатуНачала, 0, 1);
		
		Время = НачалоЧаса(Период.ДатаНачала) + Цел (Минута(Период.ДатаНачала) / 15) * 15 * 60;
				
		Пока Время <= Период.ДатаОкончания Цикл
			
			Если СписокВремени.НайтиПоЗначению(Время) = Неопределено Тогда
				СписокВремени.Добавить(Время, Формат(Время, Формат));
			КонецЕсли;
			
			Время = Время + Интервал * 60;
			
		КонецЦикла;
		
	КонецЦикла;

	Возврат СписокВремени; 
	
КонецФункции

&НаСервере
// Процедура устанавливает доступность элементов форм документа,
// в зависимости от настроек прав пользователя
Процедура УстановитьДоступностьЭлементовФормДокументаПоПравамПользователя(ДокументФорма, ДокументОбъект, ТабличныеПоля = Неопределено) Экспорт
	
	// Если ОбщегоНазначения.УстановитьДоступностьФормыПоПравуПользователя(ЭтаФорма, ЭтотОбъект) Тогда
	//	ДокументФорма.УстановитьДоступностьЭлементовФормДокумента();
	// КонецЕсли;
	
	Если ТабличныеПоля = Неопределено Тогда
		ТабличныеПоля = Новый Структура("Запасы,ВозвращенныеЗапасы,Услуги,Расходы,ТаблицаЛечение,ТаблицаТовары");
	КонецЕсли;
	
	// Проверим перебором табличные поля формы документа
	Для Каждого ТекущееТабличноеПоле Из ТабличныеПоля Цикл
		
		ТабличноеПоле = ДокументФорма.Элементы.Найти(ТекущееТабличноеПоле.Ключ);
		Если ТабличноеПоле = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Колонка = ДокументФорма.Элементы.Найти("" + ТекущееТабличноеПоле.Ключ + "Цена");
		Если Колонка <> Неопределено Тогда
			Значение = НЕ Колонка.Доступность ИЛИ ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.ИзменятьЦены, Ложь);
			Колонка.ТолькоПросмотр =  Значение;
		КонецЕсли;
		
		Колонка =ДокументФорма.Элементы.Найти("" + ТекущееТабличноеПоле.Ключ + "Сумма");
		Если Колонка <> Неопределено Тогда
			Значение = НЕ Колонка.Доступность ИЛИ ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.ИзменятьЦены, Ложь);
			Колонка.ТолькоПросмотр =  Значение;
		КонецЕсли;
		
		Колонка = ДокументФорма.Элементы.Найти("" + ТекущееТабличноеПоле.Ключ + "ПроцентСкидкиНаценки");
		Если Колонка <> Неопределено Тогда
   			Значение = НЕ Колонка.Доступность ИЛИ ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.ИзменятьРучнуюСкидку, Ложь);
			Колонка.ТолькоПросмотр = Значение;
		КонецЕсли;
		
		Колонка = ДокументФорма.Элементы.Найти("" + ТекущееТабличноеПоле.Ключ + "СуммаРучнойСкидки");
		Если Колонка <> Неопределено Тогда
   			Значение = НЕ Колонка.Доступность ИЛИ ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.ИзменятьРучнуюСкидку, Ложь);
			Колонка.ТолькоПросмотр = Значение;
		КонецЕсли;
		
		Колонка = ДокументФорма.Элементы.Найти("" + ТекущееТабличноеПоле.Ключ + "СтатьяРасходов");
		Если Колонка <> Неопределено Тогда
   			Значение = ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.ОбязательноеЗаполнениеСтатьиЗатратВПоступленииЗапасов, Ложь);
			Колонка.АвтоОтметкаНезаполненного = Значение;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // УстановитьДоступностьЭлементовФормДокумента()

&НаСервере
// Процедура - Установить состояние объекта.
//
// Параметры:
//  ФормаОбъекта - 	 - 
//  Удален		 - 	 - 
//  Проведен	 - 	 - 
//  ПробитНаФР	 - 	 - 
//
Процедура УстановитьСостояниеОбъекта(
	  ФормаОбъекта
	, Удален
	, Проведен = Неопределено
	, ПробитНаФР = Неопределено
	, ИзмененияПослеОплаты = Неопределено) Экспорт
		
	Если Удален = Истина Тогда
		
		ФормаОбъекта.Элементы.СостояниеОбъекта.Видимость = Истина;
		Если ФормаОбъекта.ИмяФормы = "Справочник.ВариантыОтчетов.Форма.ФормаЭлемента" Тогда
			ФормаОбъекта.Элементы.СостояниеОбъекта.Заголовок = НСтр("ru= 'Вариант отчета удален';en= 'Deleted'");
		Иначе 	
			ФормаОбъекта.Элементы.СостояниеОбъекта.Заголовок = НСтр("ru= 'Удален';en= 'Deleted'");
		КонецЕсли;	
		ФормаОбъекта.Элементы.СостояниеОбъекта.ЦветФона = Новый Цвет(255,182,193);
		
	ИначеЕсли ПробитНаФР = Истина Тогда
		
		ФормаОбъекта.Элементы.СостояниеОбъекта.Видимость = Истина;	

		Если ИзмененияПослеОплаты = Истина Тогда
			Заголовок = НСтр("ru= 'Пробит на ФР, редактирование документа заблокировано. Изменения после пробития на ФР.';
			| en= 'Stamped ticket on FR, document editing is blocked. Changes after breaking through to FR'");
			ФормаОбъекта.Элементы.СостояниеОбъекта.ЦветТекста = Цветастиля.ПоясняющийОшибкуТекст; 				
		Иначе 
			Заголовок = НСтр("ru= 'Пробит на ФР, редактирование документа заблокировано.';en= 'Stamped ticket on FR, document editing is blocked.'");				
		КонецЕсли;
		
		ФормаОбъекта.Элементы.СостояниеОбъекта.Заголовок = Заголовок;
		ФормаОбъекта.Элементы.СостояниеОбъекта.ЦветФона = Новый Цвет(255,250,205);
		
	ИначеЕсли Проведен <> Неопределено И Проведен = Ложь Тогда
		
		ФормаОбъекта.Элементы.СостояниеОбъекта.Видимость = Истина;
		ФормаОбъекта.Элементы.СостояниеОбъекта.Заголовок = НСтр("ru= 'Черновик'; en = 'Draft'");
		ФормаОбъекта.Элементы.СостояниеОбъекта.ЦветФона = Новый Цвет(235,235,235);	
		
	Иначе 
		Если ФормаОбъекта.ИмяФормы = "Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаДокумента" Тогда 
			ФормаОбъекта.Элементы.СостояниеОбъекта.Видимость = Истина;
			ФормаОбъекта.Элементы.СостояниеОбъекта.Заголовок = НСтр("ru= 'Отправлено'; en = 'Sent'");
			ФормаОбъекта.Элементы.СостояниеОбъекта.ЦветФона = Новый Цвет(228, 241, 215);
		Иначе 	
			ФормаОбъекта.Элементы.СостояниеОбъекта.Видимость = Ложь;		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	 


#КонецОбласти