		
#Область ОбработчикиСобытий		
		
/////////////////////////////// МЕТОДЫ РЕГИСТРАЦИИ ПРОГРАММНОГО ПРОДУКТА//////////////////////////////////////////

// Отправить запрос на RemoteAccessService для регистрации новой анкеты.
// Результат - код ответа и тектс описания резкльтата
Функция ЗарегистрироватьАнкетуПродукта(ПараметрыРегистрации,ОписаниеРезультатаОперции) Экспорт
	ОписаниеРезультатаОперции = Новый Структура("КодСостояния,АнкетаСтатус,ПодробноеОписание");
	Попытка				
		Прокси               = ПолучитьWSПроксиRemoteAccessService();
		ПараметрыПодключения = ПолучитьПараметрыПодключенияRemoteAccessService();
		// Получаем тип параметра, который передается в вызываемый метод.
		ТипWSПараметра       = Прокси.ФабрикаXDTO.Тип(ПараметрыПодключения.NamespaceXDTOWorksheet, "DataWorksheet");
		WSПараметр           = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);
		ЗаполнитьЗначенияСвойств(WSПараметр,ПараметрыРегистрации);		
		// Отправить запрос на регистрацию анкет
		Результат                                    = Прокси.SendWorksheet(WSПараметр);
		ОписаниеРезультатаОперции.КодСостояния       = Результат.StateCode;
		ОписаниеРезультатаОперции.АнкетаСтатус       = Результат.StateDescription;
		ОписаниеРезультатаОперции.ПодробноеОписание  = Результат.DetailedDescription;
		// Запись в журнал регистрации
	    ЗаписьЖурналаРегистрации("Web-сервис регистрация анкет", УровеньЖурналаРегистрации.Информация, , , "Регистрации анкеты. Код состояния:" + ОписаниеРезультатаОперции.КодСостояния + ",описание:" + Результат.DetailedDescription);
		Возврат Истина;
	Исключение
		// Запись в журнал регистрации
	    ЗаписьЖурналаРегистрации("Web-сервис регистрация анкет", УровеньЖурналаРегистрации.Ошибка, , , "Вызов функции>>ЗарегистрироватьАнкетуПродукта" + Символы.ПС + "Исключение:" + ОписаниеОшибки());
		ОписаниеРезультатаОперции.КодСостояния       = 100;
		ОписаниеРезультатаОперции.ПодробноеОписание  = ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;
КонецФункции

// Получить статус анкеты продукта
Функция ПолучитьСтатусАнкетыПродукта(РегистрационныйНомер) Экспорт
    ОписаниеРезультатаОперции = Новый Структура("КодСостояния,АнкетаСтатус,ПодробноеОписание,ДатаОкончанияПоддержки,СостояниеПоддержки");
	Попытка		
		// Получить WS-прокси
		Прокси                                             = ПолучитьWSПроксиRemoteAccessService();
		// Отправить запрос на регистрацию анкет
		Результат                                          = Прокси.GetStateWorksheet(РегистрационныйНомер,Метаданные.Имя);
		ОписаниеРезультатаОперции.КодСостояния             = Результат.StateCode;
		ОписаниеРезультатаОперции.АнкетаСтатус             = Результат.StateDescription;
		ОписаниеРезультатаОперции.ПодробноеОписание        = Результат.DetailedDescription;
		ОписаниеРезультатаОперции.ДатаОкончанияПоддержки   = Результат.EndSupportDate;
		ОписаниеРезультатаОперции.СостояниеПоддержки       = Результат.SupportDescription;
		Возврат ОписаниеРезультатаОперции;
	Исключение
		// Запись в журнал регистрации
	    ЗаписьЖурналаРегистрации("Web-сервис регистрация анкет", УровеньЖурналаРегистрации.Ошибка, , , "Вызов функции>>ПолучитьСтатусАнкетыПродукта" + Символы.ПС + "Исключение:" + ОписаниеОшибки());
		ОписаниеРезультатаОперции.КодСостояния       = 100;
		ОписаниеРезультатаОперции.ПодробноеОписание  = ОписаниеОшибки();
		Возврат ОписаниеРезультатаОперции;
	КонецПопытки;	
КонецФункции

// Функция позволяет восстановить данные анкеты по паролю авторизации 
Функция ВосстановитьДанныеАнкетыПродукта(РегистрационныйНомер,ПарольВосстанволения) Экспорт
    ОписаниеРезультатаОперции = Новый Структура("КодСостояния,АнкетаДанные,ПодробноеОписание");
	Попытка				
		// Получить WS-прокси
		Прокси                                       = ПолучитьWSПроксиRemoteAccessService();
		// Отправить запрос на регистрацию анкет
		DataWorksheetXDTO                            = Неопределено;
		Результат                                    = Прокси.GetWorksheet(РегистрационныйНомер,Метаданные.Имя,ПарольВосстанволения,DataWorksheetXDTO);
		ОписаниеРезультатаОперции.КодСостояния       = Результат.StateCode;
		ОписаниеРезультатаОперции.ПодробноеОписание  = Результат.DetailedDescription;
		Если ОписаниеРезультатаОперции.КодСостояния  = 401 Тогда
			// Подготовка структуры данных анкеты
			АнкетаДанные                                 = ПолучитьПустуюСтруктуруДанныхАнкетыДляХраненияНаКлиенте();
			АнкетаДанные.ОрганизацияНаименование         = DataWorksheetXDTO.OrganizationName;
			АнкетаДанные.ОрганизацииАдрес                = DataWorksheetXDTO.OrganizationAddress;
			АнкетаДанные.ОрганизацияТелефон              = DataWorksheetXDTO.OrganizationPhone;
			АнкетаДанные.ОрганизацияПочта                = DataWorksheetXDTO.OrganizationMail;
			АнкетаДанные.ПроудктРегистрационныйНомер     = DataWorksheetXDTO.ProductRegistrationNumber;
			АнкетаДанные.ПродуктДатаПриобретения         = DataWorksheetXDTO.ProductPurchaseDate;
			АнкетаДанные.ПродуктГдеПриобреталось         = DataWorksheetXDTO.ProductPurchasePlace;
			АнкетаДанные.ДвоичныеДанныеФайлаАнкеты       = DataWorksheetXDTO.ProductProfilePicture;
			АнкетаДанные.АнкетаПарольВосстановления      = DataWorksheetXDTO.PasswordRecovety;
			// Получить состояние анкеты
			СостояниеАнкеты                             = ПолучитьСтатусАнкетыПродукта(РегистрационныйНомер);
			АнкетаДанные.АнкетаЗарегистрирована         = СостояниеАнкеты.КодСостояния >= 301 И СостояниеАнкеты.КодСостояния <= 305; 
			АнкетаДанные.АнкетаПодтверждена             = СостояниеАнкеты.КодСостояния = 303 ИЛИ СостояниеАнкеты.КодСостояния = 304 ИЛИ СостояниеАнкеты.КодСостояния = 305;
			АнкетаДанные.АнкетаОтправитель              = Неопределено;
			АнкетаДанные.АнкетаСтатус                   = СостояниеАнкеты.АнкетаСтатус;
			АнкетаДанные.АнкетаСтатусПодробно           = СостояниеАнкеты.ПодробноеОписание;
			АнкетаДанные.АнкетаСостояниеПоддержки       = СостояниеАнкеты.СостояниеПоддержки;
			АнкетаДанные.АнкетаДатаОкончанияПоддержки   = СостояниеАнкеты.ДатаОкончанияПоддержки;
			АнкетаДанные.АнкетаПоследнийКодСостояния    = СостояниеАнкеты.КодСостояния;
					
			ОписаниеРезультатаОперции.АнкетаДанные      = АнкетаДанные;
		КонецЕсли;
		// Запись в журнал регистрации
	    ЗаписьЖурналаРегистрации("Web-сервис восста анкет", УровеньЖурналаРегистрации.Информация, , , "Регистрации анкеты. Код состояния:" + ОписаниеРезультатаОперции.КодСостояния + ",описание:" + Результат.DetailedDescription);
		Возврат ОписаниеРезультатаОперции;
	Исключение
		// Запись в журнал регистрации
	    ЗаписьЖурналаРегистрации("Web-сервис регистрация анкет", УровеньЖурналаРегистрации.Ошибка, , , "Вызов функции>>ЗарегистрироватьАнкетуПродукта" + Символы.ПС + "Исключение:" + ОписаниеОшибки());
		ОписаниеРезультатаОперции.КодСостояния       = 100;
		ОписаниеРезультатаОперции.ПодробноеОписание  = ОписаниеОшибки();
		Возврат ОписаниеРезультатаОперции;
	КонецПопытки;	
КонецФункции

// Обновление данных регистрационной анкеты в веб-сервиса
Процедура ОбновитьДанныеАнкетыПродуктаСВебСервиса() Экспорт
	 ДанныеАнкеты = ПолучитьДанныеРегистрационнойАнкеты();
	 Попытка		
		// Получить WS-прокси
		Прокси                                             = ПолучитьWSПроксиRemoteAccessService();
		// Отправить запрос на регистрацию анкет
		Результат                                          = Прокси.GetStateWorksheet(ДанныеАнкеты.ПроудктРегистрационныйНомер,Метаданные.Имя);
		ДанныеАнкеты.АнкетаПодтверждена                    = Результат.StateCode = 303 ИЛИ Результат.StateCode = 304 ИЛИ Результат.StateCode = 305;
		ДанныеАнкеты.АнкетаСтатус                          = Результат.StateDescription;
		ДанныеАнкеты.АнкетаСтатусПодробно                  = Результат.DetailedDescription;
		ДанныеАнкеты.АнкетаДатаОкончанияПоддержки          = Результат.EndSupportDate;
		ДанныеАнкеты.АнкетаСостояниеПоддержки              = Результат.SupportDescription;
		ДанныеАнкеты.АнкетаПоследнийКодСостояния           = Результат.StateCode;
		ЗаписатьДанныеРегистрационнойАнкеты(ДанныеАнкеты);
	Исключение
		// Запись в журнал регистрации
	    ЗаписьЖурналаРегистрации("Web-сервис обновление данных", УровеньЖурналаРегистрации.Ошибка, , , "Вызов функции>>ОбновитьДанныеАнкетыПродуктаСВебСервиса" + Символы.ПС + "Исключение:" + ОписаниеОшибки());
	КонецПопытки;	
КонецПроцедуры

// Функция вернет пустую структру данных передаваемых 
// в RemoteAccessService для регистрвции новой анкеты
Функция ПолучитьПустуюСтруктуруДанныхРегистрацииАнкеты() Экспорт
	ПарамтерыРегистрации = Новый Структура;
	ПарамтерыРегистрации.Вставить("OrganizationName"          ,Неопределено);
	ПарамтерыРегистрации.Вставить("OrganizationAddress"       ,Неопределено);
	ПарамтерыРегистрации.Вставить("OrganizationPhone"         ,Неопределено);
	ПарамтерыРегистрации.Вставить("OrganizationMail"          ,Неопределено);
	ПарамтерыРегистрации.Вставить("ProductName"               ,Метаданные.Имя);
	ПарамтерыРегистрации.Вставить("ProductRegistrationNumber" ,Неопределено);
	ПарамтерыРегистрации.Вставить("ProductPurchaseDate"       ,Неопределено);
	ПарамтерыРегистрации.Вставить("ProductPurchasePlace"      ,Неопределено);
	ПарамтерыРегистрации.Вставить("ProductProfilePicture"     ,Неопределено);	
	ПарамтерыРегистрации.Вставить("PasswordRecovety"          ,Неопределено);
	Возврат ПарамтерыРегистрации;	   
КонецФункции

// Функция вернет структуру данных анкеты продукта 
Функция ПолучитьДанныеРегистрационнойАнкеты() Экспорт
	СсылкаНаХранилище = Константы.РегистрацияПрограммногоПродуктаДанные.Получить();
	Если  СсылкаНаХранилище <> Неопределено Тогда
		Возврат СсылкаНаХранилище.Получить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

// Процедура запишит структуру данных анкеты продукта
// в хранилище данных
Процедура ЗаписатьДанныеРегистрационнойАнкеты(СтруктураДанных) Экспорт
	Константы.РегистрацияПрограммногоПродуктаДанные.Установить(Новый ХранилищеЗначения(СтруктураДанных));
КонецПроцедуры

// Получить структуру данных хранения анкеты на клиенте
Функция ПолучитьПустуюСтруктуруДанныхАнкетыДляХраненияНаКлиенте() Экспорт
	ДанныеАнкеты = Новый Структура; 	
	ДанныеАнкеты.Вставить("ОрганизацияНаименование"       ,Неопределено);
	ДанныеАнкеты.Вставить("ОрганизацииАдрес"              ,Неопределено);
	ДанныеАнкеты.Вставить("ОрганизацияТелефон"            ,Неопределено);
    ДанныеАнкеты.Вставить("ОрганизацияПочта"              ,Неопределено);
    ДанныеАнкеты.Вставить("ПроудктРегистрационныйНомер"   ,Неопределено);
	ДанныеАнкеты.Вставить("ПродуктДатаПриобретения"       ,Неопределено);
	ДанныеАнкеты.Вставить("ПродуктГдеПриобреталось"       ,Неопределено);
	ДанныеАнкеты.Вставить("ДвоичныеДанныеФайлаАнкеты"     ,Неопределено);
	ДанныеАнкеты.Вставить("АнкетаЗарегистрирована"        ,Неопределено);
    ДанныеАнкеты.Вставить("АнкетаПодтверждена"            ,Неопределено);
	ДанныеАнкеты.Вставить("АнкетаОтправитель"             ,Неопределено);
	ДанныеАнкеты.Вставить("АнкетаСтатус"                  ,Неопределено);
	ДанныеАнкеты.Вставить("АнкетаСтатусПодробно"          ,Неопределено);
	ДанныеАнкеты.Вставить("АнкетаДатаОкончанияПоддержки"  ,Неопределено);
	ДанныеАнкеты.Вставить("АнкетаСостояниеПоддержки"      ,Неопределено);
	ДанныеАнкеты.Вставить("АнкетаПоследнийКодСостояния"   ,Неопределено);
    ДанныеАнкеты.Вставить("АнкетаПарольВосстановления"    ,Неопределено);	
	Возврат ДанныеАнкеты; 
КонецФункции


///////////////////////////////// МЕТОДЫ ПОЛУЧЕНИЯ ОБНОВЛЕНИЯ КОНФИГУРАЦИИ///////////////////////////////////////


// Проверить наличие обновлений на веб сервере
Функция ПроверитьНаличиеОбновлений()Экспорт	
	ДанныеРезультата = Новый Структура("КодСостояния,ОписаниеСостояния,ВерсияОбновления,ВерсияДляОбновления,ДатаРелиза,Размерфайла");
	Попытка				
		// Получить WS-прокси
		Прокси                             = ПолучитьWSПроксиRemoteAccessService();
		// Обращение к сервису
		UpdateDescription                  = Неопределено;
		Результат                          = Прокси.CheckForUpdatesConfiguration(Метаданные.Имя,Метаданные.Версия,UpdateDescription);
		// Получаем результат
		ДанныеРезультата.КодСостояния      = Результат.StateCode;
		ДанныеРезультата.ОписаниеСостояния = Результат.StateDescription;
		Если Результат.StateCode = 501 Тогда
			ДанныеРезультата.ВерсияОбновления    = UpdateDescription.VersionUpdate;
			ДанныеРезультата.ВерсияДляОбновления = UpdateDescription.ForVersion;
			ДанныеРезультата.ДатаРелиза          = UpdateDescription.DateRelease;
			ДанныеРезультата.Размерфайла         = UpdateDescription.SizeFileUpdate;
		КонецЕсли;
	Исключение
		ДанныеРезультата.КодСостояния      = 100;
		ДанныеРезультата.ОписаниеСостояния = ОписаниеОшибки();
    КонецПопытки; 
    Возврат ДанныеРезультата;	
КонецФункции

// Получить данные обновления на веб сервере
Функция ПолучитьСсылкуНаОбновления() Экспорт
	
	ДанныеРезультата = Новый Структура("КодСостояния,ОписаниеСостояния,Ссылка,РазмерФайла,ВерсияОбновления,ВерсияДляОбновления,ДатаРелиза");
    // Получить данные рег. анкеты продукта
	ДанныеАнкеты = ПолучитьДанныеРегистрационнойАнкеты();
	Если ДанныеАнкеты = Неопределено Тогда
		ДанныеРезультата.КодСостояния      = 300;
		ДанныеРезультата.ОписаниеСостояния = "Продукт не зарегистрирован. Заполните регистрационную анкету, либо обратитесь в техническую поддержку.";
		Возврат ДанныеРезультата;
	КонецЕсли;	
	// Попытка получения обновления
	Попытка				
		// Получить WS-прокси
		Прокси                             = ПолучитьWSПроксиRemoteAccessService();
		// Обращение к сервису
		UpdateDescription                  = Неопределено;
		Результат                          = Прокси.GetLinkUpdateConfiguration(ДанныеАнкеты.ПроудктРегистрационныйНомер,ДанныеАнкеты.ОрганизацияНаименование, Метаданные.Имя,Метаданные.Версия,UpdateDescription);  
	    ДанныеРезультата.КодСостояния      = Результат.StateCode;
		ДанныеРезультата.ОписаниеСостояния = Результат.StateDescription;
		// Получаем результат
		Если UpdateDescription <> Неопределено Тогда
			ДанныеРезультата.Ссылка              = UpdateDescription.LinkFileUpdate;
			ДанныеРезультата.ВерсияОбновления    = UpdateDescription.VersionUpdate;
            ДанныеРезультата.ВерсияДляОбновления = UpdateDescription.ForVersion;   
            ДанныеРезультата.ДатаРелиза          = UpdateDescription.DateRelease;
			ДанныеРезультата.РазмерФайла         = UpdateDescription.SizeFileUpdate;
		КонецЕсли;
	Исключение
		ДанныеРезультата.КодСостояния      = 100;
		ДанныеРезультата.ОписаниеСостояния = ОписаниеОшибки();
    КонецПопытки; 
    Возврат ДанныеРезультата;		
КонецФункции

//////////////////////////////////// ОБЩИЕ МЕТОДЫ МЕХАНИЗМА ВЕБ-СЕРВИСА//////////////////////////////////////

// Процедура выполняет операции проверки стутса регистрационной 
// анкеты при запуске системы. 
Процедура ПриНачалеРаботыСистемы(ОповеститьОбИзмененииСтатусаАнкеты) Экспорт
	
	ОповеститьОбИзмененииСтатусаАнкеты = Ложь;
	// Операция доступна только для пользователей с полными правами
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		Возврат;
	КонецЕсли;
	Попытка
		ДанныеАнкеты = ПолучитьДанныеРегистрационнойАнкеты();
		Если ДанныеАнкеты <> Неопределено Тогда
			АнкетаПодтверждена          = Неопределено;
			АнкетаЗарегистрирована      = Неопределено;
			ОрганизацияНаименование     = Неопределено;
			ПроудктРегистрационныйНомер = Неопределено;
			АнкетаПоследнийКодСостояния = Неопределено;
			ИдентификаторПользователя   = Неопределено;
			ДанныеАнкеты.Свойство("ОрганизацияНаименование"       ,ОрганизацияНаименование);
			ДанныеАнкеты.Свойство("ПроудктРегистрационныйНомер"   ,ПроудктРегистрационныйНомер);
			ДанныеАнкеты.Свойство("АнкетаПодтверждена"            ,АнкетаПодтверждена);
			ДанныеАнкеты.Свойство("АнкетаЗарегистрирована"        ,АнкетаЗарегистрирована);
			ДанныеАнкеты.Свойство("АнкетаПоследнийКодСостояния"   ,АнкетаПоследнийКодСостояния);
			ДанныеАнкеты.Свойство("АнкетаОтправитель"             ,ИдентификаторПользователя);
			// Выполнять операцию только если совпадает текущий пользователь и пользователь 
			// зарегистрировавший анкету
			Если ИдентификаторПользователя = Неопределено 
				ИЛИ НЕ ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.ПолучитьСсылку(ИдентификаторПользователя) Тогда
				Возврат;
			КонецЕсли;
			// Если анкета зарегистрирована, но не подтверждена
			Если АнкетаЗарегистрирована И НЕ АнкетаПодтверждена Тогда
				// Получаем статус анкеты на данный момент
				ОписаниеСтатуса = ПолучитьСтатусАнкетыПродукта(ПроудктРегистрационныйНомер);
				Если ОписаниеСтатуса.КодСостояния <> АнкетаПоследнийКодСостояния Тогда
					Если ОписаниеСтатуса.КодСостояния >= 302 И ОписаниеСтатуса.КодСостояния <= 305 Тогда					
						ДанныеАнкеты.АнкетаСтатус                 = ОписаниеСтатуса.АнкетаСтатус;  
						ДанныеАнкеты.АнкетаСтатусПодробно         = ОписаниеСтатуса.ПодробноеОписание;  
						ДанныеАнкеты.АнкетаПодтверждена           = ОписаниеСтатуса.КодСостояния = 303;
						ДанныеАнкеты.АнкетаДатаОкончанияПоддержки = ОписаниеСтатуса.ДатаОкончанияПоддержки;
						ДанныеАнкеты.АнкетаСостояниеПоддержки     = ОписаниеСтатуса.СостояниеПоддержки;
						ДанныеАнкеты.АнкетаПоследнийКодСостояния  = ОписаниеСтатуса.КодСостояния;
						ЗаписатьДанныеРегистрационнойАнкеты(ДанныеАнкеты);
						ОповеститьОбИзмененииСтатусаАнкеты = Истина;
					КонецЕсли;
				КонецЕсли;
				// Запись в журнал регистрации
				Если Цел(ОписаниеСтатуса.КодСостояния/100) > 1 Тогда
					ЗаписьЖурналаРегистрации("Web-сервис регистрация анкет", УровеньЖурналаРегистрации.Информация, , , "Получено состояние анкеты. Код:" + ОписаниеСтатуса.КодСостояния + ", описание:" + ОписаниеСтатуса.ПодробноеОписание);
				Иначе
					ЗаписьЖурналаРегистрации("Web-сервис регистрация анкет", УровеньЖурналаРегистрации.Ошибка, , , "Получено состояние анкеты. Вызвано исключение код:" + ОписаниеСтатуса.КодСостояния + ",описание:" +  ОписаниеСтатуса.ПодробноеОписание);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Исключение
		// Запись в журнал регистрации
	    ЗаписьЖурналаРегистрации("Web-сервис регистрация анкет", УровеньЖурналаРегистрации.Ошибка, , , "Вызов функции>>ПриНачалеРаботыСистемы" + Символы.ПС + "Исключение:" + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

// Проверить необходимость оповещения пользователя при отсутствии регистрации программного продукта
Процедура ОповеститьОРегистрацииПрограммногоПродукта(ОповеститьПользователя) Экспорт	
	ОповеститьПользователя = Ложь;
	// Операция доступна только для пользователей с полными правами
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		Возврат;
	КонецЕсли;
	// Если установлена отсрочка
	ДатаСледующегоОповещения = Константы.РегистрацияПрограммногоПродуктаДатаСледующегоНапоминания.Получить();
	Если ЗначениеЗаполнено(ДатаСледующегоОповещения) И НачалоДня(ТекущаяДата()) < ДатаСледующегоОповещения Тогда
		Возврат;
	КонецЕсли;
    // анкета не зарегистрирована
	ДанныеАнкеты = ПолучитьДанныеРегистрационнойАнкеты();
	Если ДанныеАнкеты = Неопределено ИЛИ НЕ ДанныеАнкеты.АнкетаЗарегистрирована Тогда
		ОповеститьПользователя = Истина;
	КонецЕсли;	
КонецПроцедуры

// Получить прокси веб-сервиса
Функция ПолучитьWSПроксиRemoteAccessService() Экспорт
	ПараметрыПодключения = ПолучитьПараметрыПодключенияRemoteAccessService();
	Определение          = Новый WSОпределения(ПараметрыПодключения.WebServiceURL,ПараметрыПодключения.Username,ПараметрыПодключения.Password);
	// Создаем прокси для обращения к внешнему веб-сервису, передаем в функцию URI пространства имен, имя сервиса и порта.
	Прокси               = Новый WSПрокси(Определение,ПараметрыПодключения.NamespaceWebService, ПараметрыПодключения.WebServiceName, ПараметрыПодключения.WebServicePort);	
	Прокси.Пользователь  = ПараметрыПодключения.Username;
	Прокси.Пароль        = ПараметрыПодключения.Password;	
	Возврат Прокси;
КонецФункции

// Функция вернет пакет параметров необходимых для
// взаимодействия с веб-сервисом регистрации RemoteAccessService
Функция ПолучитьПараметрыПодключенияRemoteAccessService()
	// Http://localhost/Doc/ws/x_RemoteAccessService?wsdl
	// Http://95.163.137.45/taskman/ws/x_RemoteAccessService?wsdl
	ПарамтерыПодключения = Новый Структура;
	ПарамтерыПодключения.Вставить("WebServiceURL"          ,"http://95.163.137.45/taskman/ws/x_RemoteAccessService?wsdl");
	ПарамтерыПодключения.Вставить("WebServiceName"         ,"x_RemoteAccessService");
	ПарамтерыПодключения.Вставить("WebServicePort"         ,"x_RemoteAccessServiceSoap");
	ПарамтерыПодключения.Вставить("NamespaceWebService"    ,"http://TaskMan/WebService");
	ПарамтерыПодключения.Вставить("NamespaceXDTOWorksheet" ,"http://TaskMan/WebService/Worksheet");
	ПарамтерыПодключения.Вставить("NamespaceXDTOUpdate"    ,"http://TaskMan/WebService/UpdateConfiguration");
	ПарамтерыПодключения.Вставить("Username"               ,"wsdl");
    ПарамтерыПодключения.Вставить("Password"               ,"wsdl");
	Возврат ПарамтерыПодключения; 
КонецФункции

#КонецОбласти