
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ШАПКИ_ФОРМЫ

&НаКлиенте
// Процедура, обработчик события "ОтборСтатусПриИзменении".
//
Процедура ОтборСтатусПриИзменении(Элемент)

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Закрыт", ЭтотОбъект.ОтборСтатус = "Закрыт", ЗначениеЗаполнено(ЭтотОбъект.ОтборСтатус));
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОтборВидБонусногоСчетаПриИзменении".
//
Процедура ОтборВидБонусногоСчетаПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ВидБонусногоСчета", ОтборВидБонусногоСчета, ЗначениеЗаполнено(ОтборВидБонусногоСчета));
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОтборИменнойПриИзменении".
//
Процедура ОтборИменнойПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Именной", ЭтотОбъект.ОтборТипСчета = "Именной", ЗначениеЗаполнено(ЭтотОбъект.ОтборТипСчета));
	
	Если ЭтотОбъект.ОтборТипСчета = "Именной" Тогда
		
		Элементы.ОтборВладелец.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		
	ИначеЕсли ЭтотОбъект.ОтборТипСчета = "НаПредъявителя" Тогда
		
		Элементы.ОтборВладелец.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Карты");

	Иначе
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Контрагенты"));
		Массив.Добавить(Тип("СправочникСсылка.Карты"));
		Элементы.ОтборВладелец.ОграничениеТипа = Новый ОписаниеТипов(Массив);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОтборКонтрагентПриИзменении".
//
Процедура ОтборВладелецПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ВладелецБонусногоСчета", ЭтотОбъект.ОтборВладелец, ЗначениеЗаполнено(ЭтотОбъект.ОтборВладелец));
	
КонецПроцедуры

&НаСервере
// Процедура, "При создании на сервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
