
#Область ОписаниеПеременных

&НаКлиенте
Перем Документ;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, "При создании на сервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Заголовок= "Введите текст!";
	Список = Элементы.КомандаformatBlock.СписокВыбора;
	Список.Добавить("<p>", "Обычный");
	Список.Добавить("<h1>", "Заголовок 1");
	Список.Добавить("<h2>", "Заголовок 2");
	Список.Добавить("<h3>", "Заголовок 3");
	Список.Добавить("<h4>", "Заголовок 4");
	Список.Добавить("<h5>", "Заголовок 5");
	Список.Добавить("<h6>", "Заголовок 6");
	Список.Добавить("<pre>", "Форматированный");
	Список.Добавить("<address>", "Адрес");
	ТекЭлемент = Список.НайтиПоИдентификатору(0);
	СтилиТекста = ТекЭлемент.Значение;

	// Заполнение списка шрифтов
	Список = Элементы.КомандаFontName.СписокВыбора;
	Список.Добавить("Arial");
	Список.Добавить("Arial Black");
	Список.Добавить("Arial Narrow");
	Список.Добавить("Comic Sans MS");
	Список.Добавить("Courier New");
	Список.Добавить("System");
	Список.Добавить("Tahoma");
	Список.Добавить("Times New Roman");
	Список.Добавить("Verdana");
	Список.Добавить("Wingdings");
	ТекЭлемент = Список.НайтиПоИдентификатору(0);
    ИмяШрифта = ТекЭлемент.Значение;
	
	// Заполнение списка размеров
	Список = Элементы.КомандаFontSize.СписокВыбора;
	Для Ном = 1 По 14 Цикл
		Список.Добавить(Ном);
	КонецЦикла;
	ТекЭлемент = Список.НайтиПоИдентификатору(2);
	РазмерыШрифта = ТекЭлемент.Значение;
	
	// Заполнение списка выбора даты
	// Для примера будет показываться тек. дата
	ТекДата = ТекущаяДата();
	Список = Элементы.ПредставлениеДаты.СписокВыбора;
	Список.Добавить("{Дата ДФ=dd.MM.yyyy}", Формат(ТекДата, "ДФ=dd.MM.yyyy"));
	Список.Добавить("{Дата ДФ=dd.MM.yy}", 	Формат(ТекДата, "ДФ=dd.MM.yy"));
	Список.Добавить("{Дата ДЛФ=DD}", 		Формат(ТекДата, "ДЛФ=DD"));
	Список.Добавить("{Дата ДЛФ=DT}", 		Формат(ТекДата, "ДЛФ=DT"));
	Список.Добавить("{Дата ДЛФ=DDT}",		Формат(ТекДата, "ДЛФ=DDT"));
	Список.Добавить("{Дата ДФ=ММММ}",		"Название месяца");
	список.Добавить("{Дата ДФ=дддд}",		"День недели");
	Список.Добавить("{Дата ДЛФ=T}",			"Время");
	
	Документ = Элементы.ПолеHTMLДокумента.Документ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ТекстHTML = Документ.Body.innerHTML;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолеHTMLДокументаДокументСформирован(Элемент)
	
	Документ = Элемент.Документ;
	Документ.Body.innerHTML = Объект.ТекстHTML;
	Документ.Body.ContentEditable = "true";
	Документ.Body.scroll = "auto";
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLДокументаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ПоказатьРежимыКнопок();
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьКоманду(Кнопка)
	
	Команда = Сред(Кнопка.Имя, 8);
	Если Документ.queryCommandSupported(Команда) Тогда
		Документ.execCommand(Команда, Ложь);
		ПоказатьРежимыКнопок();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРежимыКнопок()
	
	Для каждого Группа Из Элементы.КоманднаяПанельКнопок.ПодчиненныеЭлементы Цикл
		
		Если ТипЗнч(Группа) = тип("ДекорацияФормы") Тогда Продолжить; КонецЕсли;
		
		Если Группа = Элементы.ГруппаПанельКнопокМеню Тогда
			Для каждого ГруппаЕще Из Элементы.ГруппаЕщеМеню.ПодчиненныеЭлементы Цикл
				Для каждого Кнопка Из ГруппаЕще.ПодчиненныеЭлементы Цикл
			        Если ТипЗнч(Кнопка) = тип("КнопкаФормы") Тогда
						Команда = Сред(Кнопка.Имя, 8);
						Если Документ.queryCommandSupported(Команда) Тогда
							Попытка
								Кнопка.Пометка = Документ.queryCommandState(Команда);
							Исключение
							КонецПопытки;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;	
			КонецЦикла;
			
		Иначе
			
			Для каждого Кнопка Из Группа.ПодчиненныеЭлементы Цикл
		        Если ТипЗнч(Кнопка) = тип("КнопкаФормы") Тогда
					Команда = Сред(Кнопка.Имя, 8);
					Если Документ.queryCommandSupported(Команда) Тогда
						Попытка
							Кнопка.Пометка = Документ.queryCommandState(Команда);
						Исключение
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуСписка(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Команда = Сред(Элемент.Имя, 8);
	Если Документ.queryCommandSupported(Команда) Тогда
		Список = Элемент.СписокВыбора;
		Документ.execCommand(Команда, Истина, ВыбранноеЗначение);
		ПоказатьРежимыКнопок();
	КонецЕсли;
	ЭтаФорма.ТекущийЭлемент = Элементы.ПолеHTMLДокумента;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Вставить гиперссылку завершение
//
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
//
Процедура ВставитьГиперссылкуЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Документ.selection.createRange().text = Результат;
	КонецЕсли;
	ПоказатьРежимыКнопок();

КонецПроцедуры

&НаКлиенте
// Процедура - После выбора Цвета
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВыборЦветаЗавершение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		Кнопка = Сред(ДополнительныеПараметры.Имя, 8);
		Если Документ.queryCommandSupported(Кнопка) Тогда
			Документ.execCommand(Кнопка, Ложь, "" + ПеревестиИз10(РезультатВыбора.Красный) + ПеревестиИз10(РезультатВыбора.Зеленый) + ПеревестиИз10(РезультатВыбора.Синий));
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли; 	

	ПоказатьРежимыКнопок();
	
КонецПроцедуры

&НаКлиенте
Функция ПеревестиИз10(Знач Значение = 0)
	
	Значение = Число(Значение);
	Если Значение <= 0 Тогда
		Возврат "00";
	КонецЕсли;
	
	Значение = Цел(Значение);
	Результат = "";
	
	Пока Значение > 0 Цикл
		Результат = Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ",Значение%16+1,1) + Результат;
		Значение = Цел(Значение/16);
	КонецЦикла;
	
	Если СтрДлина(Результат) = 1 Тогда
		Результат = "0" + Результат;
	КонецЕсли; 
  
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВставитьТекстВПолеHTML(Текст)
	
	Если НЕ ЗначениеЗаполнено(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	// вставляем текст в поле HTML документа
	Документ.selection.createRange().text = Текст;
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ПолеHTMLДокумента;
	
КонецПроцедуры 

#КонецОбласти   

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВставитьДату(Команда)
	
	ВставитьТекстВПолеHTML(ВидПредставленияДаты);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьПредставлениеАдресата(Команда)
	
	ВставитьТекстВПолеHTML(ВидПредставленияАдресата);
	
КонецПроцедуры

&НаКлиенте  
// Процедура выбора цвета.
//
Процедура ВыборЦвета(Команда)
	
	ОткрытьФорму("Обработка.ВыборWebЦвета.Форма",,,,,,
	Новый ОписаниеОповещения("ВыборЦветаЗавершение", ЭтотОбъект, Команда), 
	РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьГиперссылку(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ВыборГиперссылки",,,,,,
	Новый ОписаниеОповещения("ВставитьГиперссылкуЗавершение", ЭтотОбъект), 
	РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

#КонецОбласти