////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Подсистема "Контактная информация".
// 
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Возвращает имя события для регистрации в журнале событий контактной информации
//
Функция СобытиеЖурналаРегистрации() Экспорт
	Возврат НСтр("ru='Контактная информация'");
КонецФункции

// Определяет наличие доступности подсистемы АдресныйКлассификатор и наличие записей о регионах в регистре сведений
// АдресныеОбъекты.
//
Функция АдресныйКлассификаторДоступен() Экспорт
	ЕстьКлассификатор = ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.АдресныйКлассификатор");
	Если ЕстьКлассификатор И НЕ ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		МодульАдресныйКлассификаторСлужебный = ОбщегоНазначения.ОбщийМодуль("АдресныйКлассификаторСлужебный");
		ЕстьКлассификатор = МодульАдресныйКлассификаторСлужебный.ПроверитьНачальноеЗаполнение();
	КонецЕсли;
	
	Возврат ЕстьКлассификатор;
КонецФункции

// Функция - Начать преобразование формата телефонных номеров
//
// Параметры:
//  ПараметрыСообщения	 - 	 - 
//
Функция НачатьПреобразованиеФорматаТелефонныхНомеров(УникальныйИдентификатор, ПараметрыПреобразования = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ПараметрыПреобразования) = Тип("Структура") И ПараметрыПреобразования.Свойство("СтранаУчета") И ЗначениеЗаполнено(ПараметрыПреобразования.СтранаУчета) Тогда
		СтранаУчета = ПараметрыПреобразования.СтранаУчета;
		ПараметрыПроцедуры = ПараметрыПреобразования;		
	Иначе
		РегиональныеНастройкиСЕ = Справочники.СтруктурныеЕдиницы.ВернутьРегиональныеНастройки();
		СтранаУчета = РегиональныеНастройкиСЕ.СтранаУчета;
		ПараметрыПроцедуры = Новый Структура;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтранаУчета) И (СтранаУчета.Код = "643" ИЛИ СтранаУчета.Код = "784") Тогда
		
		УникальныйИдентификаторФормы = Новый УникальныйИдентификатор(УникальныйИдентификатор);
		
		ОбщийМодульДлительныеОперации = ОбщегоНазначения.ОбщийМодуль("ДлительныеОперации");
		Если ОбщийМодульДлительныеОперации = Неопределено Тогда 
			Возврат Неопределено;
		КонецЕсли;
		
		Результат = ОбщийМодульДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификаторФормы,
																			"УправлениеКонтактнойИнформациейСлужебныйПовтИспСтоматология.ПреобразоватьФорматТелефонныхНомеров",
																			ПараметрыПроцедуры,
																			НСтр("ru='Преобразование формата телефонных номеров';en='Convert phone numbers'"));
		Возврат Результат;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// В фоне отправляет электронный чек через настроенного поставщика услуги, при возникновении ошибки записываются данные ошибки.
// 
// Параметры:
//  ПараметрыСообщения - Структура.Структура. Со свойствами
//       Адресат - Строка, номер телефона или адреса электроннной почты.
//       ТипРассылки -Перечисления.ТипыРассылкиЭлектронного чека
//       ПараметрыСообщения - Структура. Структура сообщения зависит от типа рассылки
//  АдресРезультата - Хранилище сохраняющее результаты выполнения
// 
Процедура ПреобразоватьФорматТелефонныхНомеров(ПараметрыЗадания, АдресРезультата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Индекс = 0;
	ПараметрыПреобразования = Новый Структура();
	СтруктураРезультата 	= Справочники.СтруктурныеЕдиницы.ВернутьРегиональныеНастройки();	
	Если ПараметрыЗадания.Свойство("СтруктурнаяЕдиница") Тогда 
		ПараметрыПреобразования.Вставить("СтруктурнаяЕдиница"	, ПараметрыЗадания.СтруктурнаяЕдиница);
	Иначе 
		ПараметрыПреобразования.Вставить("СтруктурнаяЕдиница"	, Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
	КонецЕсли;
	Если ПараметрыЗадания.Свойство("СтранаУчета") И ЗначениеЗаполнено(ПараметрыЗадания.СтранаУчета) Тогда 
		ПараметрыПреобразования.Вставить("СтранаУчета"			, ПараметрыЗадания.СтранаУчета);
		ПараметрыПреобразования.Вставить("Код"					, ПараметрыЗадания.СтранаУчета.Код);
	Иначе 
		ПараметрыПреобразования.Вставить("СтранаУчета"			, СтруктураРезультата.СтранаУчета);
		ПараметрыПреобразования.Вставить("Код"					, СтруктураРезультата.Код);
	КонецЕсли;	
	Если ПараметрыЗадания.Свойство("ФорматТелефонныхНомеров") Тогда 
		ПараметрыПреобразования.Вставить("ФорматТелНомера"		, ПараметрыЗадания.ФорматТелефонныхНомеров);
	Иначе 
		ПараметрыПреобразования.Вставить("ФорматТелНомера"		, СтруктураРезультата.ФорматТелНомера);
	КонецЕсли;	
	
	КоличествоОбъектов = ПолучитьОбщееКоличествоОбъектов(ПараметрыПреобразования);
	
	ПреобразоватьТелефонныеНомераКонтрагентов(КоличествоОбъектов, Индекс, ПараметрыПреобразования);
	
	ПреобразоватьТелефонныеНомераСотрудников(КоличествоОбъектов, Индекс, ПараметрыПреобразования);
	
	ПреобразоватьТелефонныеНомераСтруктурныхЕдиниц(КоличествоОбъектов, Индекс, ПараметрыПреобразования);
	
	ПреобразоватьТелефонныеНомераОрганизаций(КоличествоОбъектов, Индекс, ПараметрыПреобразования);
		
КонецПроцедуры

// Функция - Получить общее количество объектов
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьОбщееКоличествоОбъектов(ПараметрыПреобразования)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ  	
	|	СотрудникиМестаРаботы.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ТаблицаСотрудниковРаботающихВДругихСЕ
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК СотрудникиМестаРаботы
	|ГДЕ
	|	СотрудникиМестаРаботы.СтруктурнаяЕдиница <> &СтруктурнаяЕдиница
	|;  		
	|////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СотрудникиМестаРаботы.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ТаблицаСотрудниковРаботающихВПереданнойСЕ
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК СотрудникиМестаРаботы
	|ГДЕ
	|	СотрудникиМестаРаботы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И НЕ СотрудникиМестаРаботы.Сотрудник В
	|				(ВЫБРАТЬ
	|					ТаблицаСотрудниковРаботающихВДругихСЕ.Сотрудник
	|				ИЗ
	|					ТаблицаСотрудниковРаботающихВДругихСЕ)
	|; 
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ВложенныйЗапрос.КоличествоОбъектов) КАК КоличествоОбъектов
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КонтрагентыКонтактнаяИнформация.Ссылка) КАК КоличествоОбъектов
	|	ИЗ
	|		Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|	ГДЕ
	|		НЕ КонтрагентыКонтактнаяИнформация.Ссылка.ЭтоГруппа
	|		И КонтрагентыКонтактнаяИнформация.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|		И НЕ КонтрагентыКонтактнаяИнформация.Ссылка.ПометкаУдаления
	|		И (КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|				ИЛИ КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Факс))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СотрудникиКонтактнаяИнформация.Ссылка)
	|	ИЗ
	|		Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
	|	ГДЕ
	|		НЕ СотрудникиКонтактнаяИнформация.Ссылка.ЭтоГруппа
	|		И НЕ СотрудникиКонтактнаяИнформация.Ссылка.ПометкаУдаления
	//|		И СотрудникиКонтактнаяИнформация.Ссылка.Служебный = ЛОЖЬ
	|		И СотрудникиКонтактнаяИнформация.Ссылка В
	|				(ВЫБРАТЬ
	|					ТаблицаСотрудниковРаботающихВПереданнойСЕ.Сотрудник
	|				ИЗ
	|					ТаблицаСотрудниковРаботающихВПереданнойСЕ)
	|		И (СотрудникиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|				ИЛИ СотрудникиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Факс))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка)
	|	ИЗ
	|		Справочник.СтруктурныеЕдиницы.КонтактнаяИнформация КАК СтруктурныеЕдиницыКонтактнаяИнформация
	|	ГДЕ
	|		НЕ СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка.ЭтоГруппа
	|		И НЕ СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка.ПометкаУдаления
	|		И СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка = &СтруктурнаяЕдиница
	|		И (СтруктурныеЕдиницыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|				ИЛИ СтруктурныеЕдиницыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Факс))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОрганизацииКонтактнаяИнформация.Ссылка)
	|	ИЗ
	|		Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|	ГДЕ
	|		НЕ ОрганизацииКонтактнаяИнформация.Ссылка.ПометкаУдаления
	|		И &УсловиеОрганизация
	|		И (ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|				ИЛИ ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Факс))) КАК ВложенныйЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СотрудникиКонтактнаяИнформация.Ссылка)
	|ИЗ
	|	Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
	|ГДЕ
	|	НЕ СотрудникиКонтактнаяИнформация.Ссылка.ЭтоГруппа
	|	И НЕ СотрудникиКонтактнаяИнформация.Ссылка.ПометкаУдаления
	|	И СотрудникиКонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаСотрудниковРаботающихВПереданнойСЕ.Сотрудник
	|			ИЗ
	|				ТаблицаСотрудниковРаботающихВПереданнойСЕ)
	// |	И СотрудникиКонтактнаяИнформация.Ссылка.Служебный = ЛОЖЬ
	|	И (СотрудникиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|			ИЛИ СотрудникиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Факс))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка)
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы.КонтактнаяИнформация КАК СтруктурныеЕдиницыКонтактнаяИнформация
	|ГДЕ
	|	НЕ СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка.ЭтоГруппа
	|	И НЕ СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка.ПометкаУдаления
	|	И СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка = &СтруктурнаяЕдиница
	|	И (СтруктурныеЕдиницыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|			ИЛИ СтруктурныеЕдиницыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Факс))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОрганизацииКонтактнаяИнформация.Ссылка)
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|ГДЕ
	|	НЕ ОрганизацииКонтактнаяИнформация.Ссылка.ПометкаУдаления
	|	И &УсловиеОрганизация
	|	И (ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|			ИЛИ ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Факс))";
	
	Если ЗначениеЗаполнено(ПараметрыПреобразования.СтруктурнаяЕдиница) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОрганизация", "ЛОЖЬ");
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ПараметрыПреобразования.СтруктурнаяЕдиница);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СотрудникиМестаРаботы.СтруктурнаяЕдиница <> &СтруктурнаяЕдиница"	, "ЛОЖЬ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СотрудникиМестаРаботы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница"	, "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КонтрагентыКонтактнаяИнформация.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка = &СтруктурнаяЕдиница", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОрганизация", "ИСТИНА");
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить();	
	Возврат ?(Результат.Количество() = 0, 0, Результат[0].КоличествоОбъектов);
	
КонецФункции

// Процедура - Преобразовать телефонные номера контрагентов
//
Процедура ПреобразоватьТелефонныеНомераКонтрагентов(КоличествоОбъектов, Индекс, СтруктураРезультата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	КонтрагентыКонтактнаяИнформация.Ссылка КАК Контрагент
	               |ИЗ
	               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	               |ГДЕ
	               |	НЕ КонтрагентыКонтактнаяИнформация.Ссылка.ЭтоГруппа
	               |	И НЕ КонтрагентыКонтактнаяИнформация.Ссылка.ПометкаУдаления
	               |	И КонтрагентыКонтактнаяИнформация.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |	И (КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |			ИЛИ КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Факс))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтрагентыКонтактнаяИнформация.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КонтрагентыКонтактнаяИнформация.Ссылка.Наименование";
	
	Если ЗначениеЗаполнено(СтруктураРезультата.СтруктурнаяЕдиница) Тогда 
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктураРезультата.СтруктурнаяЕдиница);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КонтрагентыКонтактнаяИнформация.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "ИСТИНА");
	КонецЕсли;
	
	ВыборкаСсылка 		= Запрос.Выполнить().Выбрать();
	Пока ВыборкаСсылка.Следующий() Цикл
		Индекс = Индекс + 1;	
		Прогресс = Цел(100 * Индекс / КоличествоОбъектов);
		ДлительныеОперации.СообщитьПрогресс(Прогресс, НСтр("ru='Преобразование формата телефонных номеров...';en='Convert phone numbers...'"), Новый Структура("ТипОбъекта, НаименованиеОбъекта", "Контрагент", Строка(ВыборкаСсылка.Контрагент)));
		ОтредактироватьФорматТелефонаОбъекта(ВыборкаСсылка.Контрагент, Истина, СтруктураРезультата);		
	КонецЦикла;	
	
КонецПроцедуры

// Процедура - Преобразовать телефонные номера сотрудников
//
Процедура ПреобразоватьТелефонныеНомераСотрудников(КоличествоОбъектов, Индекс, СтруктураРезультата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//|	СотрудникиМестаРаботы.Сотрудник КАК Сотрудник
	//|ПОМЕСТИТЬ ТаблицаСотрудниковРаботающихВПереданнойСЕ
	//|ИЗ
	//|	РегистрСведений.НастройкиСотрудников КАК СотрудникиМестаРаботы
	//|ГДЕ
	//|	СотрудникиМестаРаботы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	//|	И НЕ СотрудникиМестаРаботы.Сотрудник В
	//|				(ВЫБРАТЬ
	//|					ТаблицаСотрудниковРаботающихВДругихСЕ.Сотрудник
	//|				ИЗ
	//|					ТаблицаСотрудниковРаботающихВДругихСЕ)
	//|; 
	//|////////////////////////////////////////////////////////////////////////////////   	
	
	               |	СотрудникиМестаРаботы.Сотрудник КАК Сотрудник
	               |ПОМЕСТИТЬ ТаблицаСотрудниковРаботающихВДругихСЕ
	               |ИЗ
	               |	РегистрСведений.НастройкиСотрудников КАК СотрудникиМестаРаботы
	               |ГДЕ
	               |	СотрудникиМестаРаботы.СтруктурнаяЕдиница <> &СтруктурнаяЕдиница
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	СотрудникиМестаРаботы.Сотрудник КАК Сотрудник
	               |ПОМЕСТИТЬ ТаблицаСотрудниковРаботающихВПереданнойСЕ
	               |ИЗ
	               |	РегистрСведений.НастройкиСотрудников КАК СотрудникиМестаРаботы
	               |ГДЕ
	               |	СотрудникиМестаРаботы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |	И НЕ СотрудникиМестаРаботы.Сотрудник В
	               |				(ВЫБРАТЬ
	               |					ТаблицаСотрудниковРаботающихВДругихСЕ.Сотрудник
	               |				ИЗ
	               |					ТаблицаСотрудниковРаботающихВДругихСЕ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	СотрудникиКонтактнаяИнформация.Ссылка КАК Сотрудник
	               |ИЗ
	               |	Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
	               |ГДЕ
	               |	НЕ СотрудникиКонтактнаяИнформация.Ссылка.ЭтоГруппа
	               |	И НЕ СотрудникиКонтактнаяИнформация.Ссылка.ПометкаУдаления
	               //|	И СотрудникиКонтактнаяИнформация.Ссылка.Служебный = ЛОЖЬ
	               |	И СотрудникиКонтактнаяИнформация.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ТаблицаСотрудниковРаботающихВПереданнойСЕ.Сотрудник
	               |			ИЗ
	               |				ТаблицаСотрудниковРаботающихВПереданнойСЕ)
	               |	И (СотрудникиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |			ИЛИ СотрудникиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Факс))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СотрудникиКонтактнаяИнформация.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СотрудникиКонтактнаяИнформация.Ссылка.Наименование";
	
	Если ЗначениеЗаполнено(СтруктураРезультата.СтруктурнаяЕдиница) Тогда 
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктураРезультата.СтруктурнаяЕдиница);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СотрудникиМестаРаботы.СтруктурнаяЕдиница <> &СтруктурнаяЕдиница"	, "ЛОЖЬ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СотрудникиМестаРаботы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница"	, "ИСТИНА");
	КонецЕсли;
	
	ВыборкаСсылка = Запрос.Выполнить().Выбрать();
	Пока ВыборкаСсылка.Следующий() Цикл
		Индекс = Индекс + 1;	
		Прогресс = Цел(100 * Индекс / КоличествоОбъектов);
		ДлительныеОперации.СообщитьПрогресс(Прогресс, НСтр("ru='Преобразование формата телефонных номеров...';en='Convert phone numbers...'"), Новый Структура("ТипОбъекта, НаименованиеОбъекта", "Сотрудник", Строка(ВыборкаСсылка.Сотрудник)));		
		ОтредактироватьФорматТелефонаОбъекта(ВыборкаСсылка.Сотрудник, , СтруктураРезультата);		
	КонецЦикла;	
	
КонецПроцедуры

// Процедура - Преобразовать телефонные номера структурных единиц
//
Процедура ПреобразоватьТелефонныеНомераСтруктурныхЕдиниц(КоличествоОбъектов, Индекс, СтруктураРезультата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка КАК СтруктурнаяЕдиница
	               |ИЗ
	               |	Справочник.СтруктурныеЕдиницы.КонтактнаяИнформация КАК СтруктурныеЕдиницыКонтактнаяИнформация
	               |ГДЕ
	               |	НЕ СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка.ЭтоГруппа
	               |	И НЕ СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка.ПометкаУдаления
	               |	И СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка = &СтруктурнаяЕдиница
	               |	И (СтруктурныеЕдиницыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |			ИЛИ СтруктурныеЕдиницыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Факс))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка.Наименование";
	
	Если ЗначениеЗаполнено(СтруктураРезультата.СтруктурнаяЕдиница) Тогда 
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктураРезультата.СтруктурнаяЕдиница);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка = &СтруктурнаяЕдиница", "ИСТИНА");
	КонецЕсли;
	
	ВыборкаСсылка = Запрос.Выполнить().Выбрать();
	Пока ВыборкаСсылка.Следующий() Цикл 
		Индекс = Индекс + 1;	
		Прогресс = Цел(100 * Индекс / КоличествоОбъектов);
		ДлительныеОперации.СообщитьПрогресс(Прогресс, НСтр("ru='Преобразование формата телефонных номеров...';en='Convert phone numbers...'"), Новый Структура("ТипОбъекта, НаименованиеОбъекта", "Структурная единица", Строка(ВыборкаСсылка.СтруктурнаяЕдиница)));				
		ОтредактироватьФорматТелефонаОбъекта(ВыборкаСсылка.СтруктурнаяЕдиница, , СтруктураРезультата);		
	КонецЦикла;	
	
КонецПроцедуры

// Процедура - Преобразовать телефонные номера организаций
//
Процедура ПреобразоватьТелефонныеНомераОрганизаций(КоличествоОбъектов, Индекс, СтруктураРезультата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ОрганизацииКонтактнаяИнформация.Ссылка КАК Организация
	               |ИЗ
	               |	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	               |ГДЕ
	               |	НЕ ОрганизацииКонтактнаяИнформация.Ссылка.ПометкаУдаления
	               |	И &УсловиеОрганизация
	               |	И (ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |			ИЛИ ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Факс))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОрганизацииКонтактнаяИнформация.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОрганизацииКонтактнаяИнформация.Ссылка.Наименование";
	
	Если ЗначениеЗаполнено(СтруктураРезультата.СтруктурнаяЕдиница) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОрганизация", "ЛОЖЬ");
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОрганизация", "ИСТИНА");
	КонецЕсли;
	
	ВыборкаСсылка = Запрос.Выполнить().Выбрать();
	Пока ВыборкаСсылка.Следующий() Цикл 
		Индекс = Индекс + 1;	
		Прогресс = Цел(100 * Индекс / КоличествоОбъектов);
		ДлительныеОперации.СообщитьПрогресс(Прогресс, НСтр("ru='Преобразование формата телефонных номеров...';en='Convert phone numbers...'"), Новый Структура("ТипОбъекта, НаименованиеОбъекта", "Организация", Строка(ВыборкаСсылка.Организация)));						
		ОтредактироватьФорматТелефонаОбъекта(ВыборкаСсылка.Организация, , СтруктураРезультата);		
	КонецЦикла;	
	
КонецПроцедуры

// Процедура - Отредактировать формат телефона объекта
//
// Параметры:
//  Ссылка					 - 	 - 
//  ЗаполнитьРеквизитОбъекта - 	 - 
//
Процедура ОтредактироватьФорматТелефонаОбъекта(Ссылка, Знач ЗаполнитьРеквизитОбъекта = Ложь, СтруктураРезультата)
	
	ПростоТелефон 							= "";
	ПредставлениеТелефона 					= "";
	РеквизитОбъектаТелефон 					= "";
	НеобходимоЗаписатьОбъект 				= Ложь;
	
	ОбъектКИ 								= Ссылка.ПолучитьОбъект();
	
	Для Каждого СтрокаКИ Из ОбъектКИ.КонтактнаяИнформация Цикл 
		Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон ИЛИ СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Факс Тогда 
			Объект_XDTO_Телефон = ПолучитьСтруктуру_XDTO(СтрокаКИ, СтруктураРезультата);
			Если Объект_XDTO_Телефон = Неопределено Тогда
				Продолжить;
			Иначе
			    НеобходимоЗаписатьОбъект = Истина;
			КонецЕсли;	
			// Заполняем телефон
			СтрокаКИ.НомерТелефона 					= СокрЛП(Объект_XDTO_Телефон.Состав.КодСтраны) + СокрЛП(Объект_XDTO_Телефон.Состав.КодГорода) + СокрЛП(Объект_XDTO_Телефон.Состав.Номер);
			СтрокаКИ.НомерТелефонаБезКодов 			= СокрЛП(Объект_XDTO_Телефон.Состав.Номер);
			СтрокаКИ.НомерТелефонаБезКодаСтраны 	= СокрЛП(Объект_XDTO_Телефон.Состав.КодГорода) + СокрЛП(Объект_XDTO_Телефон.Состав.Номер);
			СтрокаКИ.НомерТелефонаПоследниеЦифры 	= Прав(СокрЛП(Объект_XDTO_Телефон.Состав.Номер), 4);			
			СтрокаКИ.Представление					= СокрЛП(Объект_XDTO_Телефон.Представление);
			СтрокаКИ.ЗначенияПолей					= УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(Объект_XDTO_Телефон);
			Если ЗаполнитьРеквизитОбъекта Тогда 
				Если НЕ ЗначениеЗаполнено(ПредставлениеТелефона) Тогда 
					ПредставлениеТелефона 	= СтрокаКИ.Представление;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(ПростоТелефон) Тогда 
					ПростоТелефон 			= СтрокаКИ.НомерТелефона;
				КонецЕсли;					
				Если НЕ ЗначениеЗаполнено(РеквизитОбъектаТелефон) И СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И (СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКлиента ИЛИ СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента) Тогда 
					РеквизитОбъектаТелефон 	= СтрокаКИ.Представление;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если ЗаполнитьРеквизитОбъекта И НеобходимоЗаписатьОбъект Тогда
		Если ЗначениеЗаполнено(РеквизитОбъектаТелефон) Тогда 
			ОбъектКИ.Телефон 				= РеквизитОбъектаТелефон;
		Иначе 
			ОбъектКИ.Телефон 				= ПредставлениеТелефона;
		КонецЕсли;
	КонецЕсли;
	Если НеобходимоЗаписатьОбъект Тогда 
		Попытка
			ОбъектКИ.ДополнительныеСвойства.Вставить("ЭтоИзменениеФорматаТелефонныхНомеров", Истина);
			ОбъектКИ.Записать();
			Если ЗаполнитьРеквизитОбъекта И ЗначениеЗаполнено(ПростоТелефон) Тогда 
				МенеджерЗаписи = РегистрыСведений.КонтрагентыСведенияДляСписка.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Контрагент = ОбъектКИ.Ссылка;
				МенеджерЗаписи.Прочитать();
				МенеджерЗаписи.Телефон = ПростоТелефон;
				МенеджерЗаписи.Записать();
			КонецЕсли;
		Исключение
			
		КонецПопытки;	
	КонецЕсли;
	
КонецПроцедуры

// Функция - Получить структуру XDTO телефона
//
// Параметры:
//  Телефон	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтруктуру_XDTO(СтрокаКИ, СтруктураРезультата)
	
	Объект_XDTO = Неопределено;
	Если ЗначениеЗаполнено(СтрокаКИ.ЗначенияПолей) Тогда 
		Объект_XDTO = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзXML(СтрокаКИ.ЗначенияПолей, СтрокаКИ.Тип);
	ИначеЕсли ЗначениеЗаполнено(СтрокаКИ.НомерТелефона) И СтрДлина(СокрЛП(СтрокаКИ.НомерТелефона)) > 9 Тогда
		НомерТелефона = СтрокаКИ.НомерТелефона;
	ИначеЕсли ЗначениеЗаполнено(СтрокаКИ.Представление) Тогда
		НомерТелефона = СтрокаКИ.Представление;
	Иначе 	
		Возврат Неопределено;
	КонецЕсли;	
	
	Если Объект_XDTO = Неопределено Тогда
		Объект_XDTO = УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияXDTOПоПредставлению(НомерТелефона, Перечисления.ТипыКонтактнойИнформации.Телефон);
	Иначе
		Если СтруктураРезультата.Код = "643" Тогда
			Если (СтруктураРезультата.ФорматТелНомера = 0 ИЛИ СтруктураРезультата.ФорматТелНомера = 4) И Объект_XDTO.Состав.КодСтраны <> "7" Тогда
				Если ЗначениеЗаполнено(СтрокаКИ.НомерТелефона) И СтрДлина(СокрЛП(СтрокаКИ.НомерТелефона)) > 9 Тогда
					НомерТелефона = СтрокаКИ.НомерТелефона;
				ИначеЕсли ЗначениеЗаполнено(СтрокаКИ.Представление) Тогда
					НомерТелефона = СтрокаКИ.Представление;
				Иначе 	
					Возврат Неопределено;					
				КонецЕсли;
				Комментарий = Объект_XDTO.Комментарий;
				Добавочный = Объект_XDTO.Состав.Добавочный;
				Объект_XDTO = УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияXDTOПоПредставлению(НомерТелефона, Перечисления.ТипыКонтактнойИнформации.Телефон);
				Объект_XDTO.Комментарий = Комментарий;				
				Объект_XDTO.Состав.Добавочный = Добавочный;
				
				//Объект_XDTO.Представление = "";
				//Объект_XDTO.Состав.КодСтраны = "7";
				//ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(Объект_XDTO);
				//Объект_XDTO = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзXML(ЗначенияПолей, СтрокаКИ.Тип);
			ИначеЕсли СтруктураРезультата.ФорматТелНомера = 1 И Объект_XDTO.Состав.КодСтраны <> "8" Тогда 
				Если ЗначениеЗаполнено(СтрокаКИ.НомерТелефона) И СтрДлина(СокрЛП(СтрокаКИ.НомерТелефона)) > 9 Тогда
					НомерТелефона = СтрокаКИ.НомерТелефона;
				ИначеЕсли ЗначениеЗаполнено(СтрокаКИ.Представление) Тогда
					НомерТелефона = СтрокаКИ.Представление;
				Иначе 	
					Возврат Неопределено;					
				КонецЕсли;
				Комментарий = Объект_XDTO.Комментарий;
				Добавочный = Объект_XDTO.Состав.Добавочный;				
				Объект_XDTO = УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияXDTOПоПредставлению(НомерТелефона, Перечисления.ТипыКонтактнойИнформации.Телефон);				
				Объект_XDTO.Комментарий = Комментарий;				
				Объект_XDTO.Состав.Добавочный = Добавочный;
				
				//Объект_XDTO.Представление = "";				
				//Объект_XDTO.Состав.КодСтраны = "8";			
				//ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(Объект_XDTO);
				//Объект_XDTO = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзXML(ЗначенияПолей, СтрокаКИ.Тип);
			ИначеЕсли (СтруктураРезультата.ФорматТелНомера = 0 ИЛИ СтруктураРезультата.ФорматТелНомера = 4) И Объект_XDTO.Состав.КодСтраны = "7" Тогда	
				Если ЗначениеЗаполнено(СтрокаКИ.НомерТелефона) И СтрДлина(СокрЛП(СтрокаКИ.НомерТелефона)) > 9 Тогда
					НомерТелефона = СтрокаКИ.НомерТелефона;
				ИначеЕсли ЗначениеЗаполнено(СтрокаКИ.Представление) Тогда
					НомерТелефона = СтрокаКИ.Представление;
				Иначе 	
					Возврат Неопределено;					
				КонецЕсли;
				Комментарий = Объект_XDTO.Комментарий;
				Добавочный = Объект_XDTO.Состав.Добавочный;
				Объект_XDTO = УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияXDTOПоПредставлению(НомерТелефона, Перечисления.ТипыКонтактнойИнформации.Телефон);
				Объект_XDTO.Комментарий = Комментарий;				
				Объект_XDTO.Состав.Добавочный = Добавочный;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Объект_XDTO.Состав.Номер) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Объект_XDTO;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Поставщики преобразований
//

// Преобразование для списка значений, оставляя из него только последние значения пар ключ-значение
//
// Возвращаемое значение:
//     ПреобразованиеXSL  - подготовленный объект
//
Функция XSLT_УникальныеПоПредставлениюВСписке() Экспорт
	
	Преобразователь = Новый ПреобразованиеXSL;
	Преобразователь.ЗагрузитьИзСтроки("
		|<xsl:stylesheet version=""1.0"" xmlns:xsl=""http://www.w3.org/1999/XSL/Transform""
		|  xmlns:tns=""http://v8.1c.ru/8.1/data/core""
		|>
		|<xsl:output method=""xml"" omit-xml-declaration=""yes"" indent=""yes"" encoding=""utf-8""/>
		|
		|  <xsl:template match=""node() | @*"">
		|    <xsl:copy>
		|      <xsl:apply-templates select=""node() | @*"" />
		|    </xsl:copy>
		|  </xsl:template>
		|
		|  <xsl:template match=""//tns:ValueListType/tns:item"">
		|    <xsl:variable name=""presentation"" select=""string(tns:presentation)"" />
		|    <xsl:if test=""0=count(following-sibling::tns:item[tns:presentation=$presentation])"" >
		|      <xsl:copy-of select=""."" />
		|    </xsl:if>
		|  </xsl:template>
		|
		|</xsl:stylesheet>
		|");
		
	Возврат Преобразователь;
Конецфункции

// Преобразование для сравнения двух строк XML.
//
// Возвращаемое значение:
//     ПреобразованиеXSL  - подготовленный объект.
//
Функция XSLT_ТаблицаЗначенийРазличияXML() Экспорт
	Преобразователь = Новый ПреобразованиеXSL;
	
	// Пространство имен должно быть пустым!
	Преобразователь.ЗагрузитьИзСтроки("
		|<xsl:stylesheet version=""1.0""
		|  xmlns:xsl=""http://www.w3.org/1999/XSL/Transform""
		|  xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""
		|  xmlns:xs=""http://www.w3.org/2001/XMLSchema""
		|
		|  xmlns:str=""http://exslt.org/strings""
		|  xmlns:exsl=""http://exslt.org/common""
		|
		|  extension-element-prefixes=""str exsl""
		|>
		|<xsl:output method=""xml"" omit-xml-declaration=""yes"" indent=""yes"" encoding=""utf-8""/>
		|" + XSLT_ШаблоныСтроковыхФункций() + "
		|" + XSLT_ШаблоныФункцийXPath() + "
		|
		|  <!-- parce tree elements to xpath-value -->
		|  <xsl:template match=""node()"" mode=""action"">
		|    
		|    <xsl:variable name=""text"">
		|      <xsl:call-template name=""str-trim-all"">
		|        <xsl:with-param name=""str"" select=""text()"" />
		|      </xsl:call-template>
		|    </xsl:variable>
		|
		|    <xsl:if test=""$text!=''"">
		|      <xsl:element name=""item"">
		|        <xsl:attribute name=""path"">
		|          <xsl:variable name=""tmp-path"">
		|            <xsl:call-template name=""build-path"" />
		|          </xsl:variable>
		|          <xsl:value-of select=""substring($tmp-path, 6)"" /> <!-- pass '/dn/f' or '/dn/s' -->
		|        </xsl:attribute>
		|        <xsl:attribute name=""value"">
		|          <xsl:value-of select=""text()"" />
		|        </xsl:attribute>
		|      </xsl:element>
		|    </xsl:if>
		|
		|    <xsl:apply-templates select=""@* | node()"" mode=""action""/>
		|  </xsl:template>
		|
		|  <!-- parce tree attributes to xpath-value -->
		|  <xsl:template match=""@*"" mode=""action"">
		|    <xsl:element name=""item"">
		|      <xsl:attribute name=""path"">
		|          <xsl:variable name=""tmp-path"">
		|            <xsl:call-template name=""build-path"" />
		|          </xsl:variable>
		|          <xsl:value-of select=""substring($tmp-path, 6)"" /> <!-- pass '/dn/f' or '/dn/s' -->
		|      </xsl:attribute>
		|      <xsl:attribute name=""value"">
		|        <xsl:value-of select=""."" />
		|      </xsl:attribute>
		|    </xsl:element>
		|  </xsl:template>
		|
		|  <!-- main -->
		|  <xsl:variable name=""dummy"">
		|    <xsl:element name=""first"">
		|      <xsl:apply-templates select=""/dn/f"" mode=""action"" />
		|    </xsl:element> 
		|    <xsl:element name=""second"">
		|      <xsl:apply-templates select=""/dn/s"" mode=""action"" />
		|    </xsl:element>
		|  </xsl:variable>
		|  <xsl:variable name=""dummy-nodeset"" select=""exsl:node-set($dummy)"" />
		|  <xsl:variable name=""first-items"" select=""$dummy-nodeset/first/item"" />
		|  <xsl:variable name=""second-items"" select=""$dummy-nodeset/second/item"" />
		|
		|  <xsl:template match=""/"">
		|    
		|    <!-- first vs second -->
		|    <xsl:variable name=""first-second"">
		|      <xsl:for-each select=""$first-items"">
		|        <xsl:call-template name=""compare"">
		|          <xsl:with-param name=""check"" select=""$second-items"" />
		|        </xsl:call-template>
		|      </xsl:for-each>
		|    </xsl:variable>
		|    <xsl:variable name=""first-second-nodeset"" select=""exsl:node-set($first-second)"" />
		|
		|    <!-- second vs first without doubles -->
		|    <xsl:variable name=""doubles"" select=""$first-second-nodeset/item"" />
		|    <xsl:variable name=""second-first"">
		|      <xsl:for-each select=""$second-items"">
		|        <xsl:call-template name=""compare"">
		|          <xsl:with-param name=""check"" select=""$first-items"" />
		|          <xsl:with-param name=""doubles"" select=""$doubles"" />
		|        </xsl:call-template>
		|      </xsl:for-each>
		|    </xsl:variable>
		|      
		|    <!-- result -->
		|    <ValueTable xmlns=""http://v8.1c.ru/8.1/data/core"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xsi:type=""ValueTable"">
		|      <column>
		|        <Name xsi:type=""xs:string"">Путь</Name>
		|        <ValueType>
		|           <Type>xs:string</Type>
		|           <StringQualifiers><Length>0</Length><AllowedLength>Variable</AllowedLength></StringQualifiers>
		|        </ValueType>
		|      </column>
		|      <column>
		|        <Name xsi:type=""xs:string"">Значение1</Name>
		|        <ValueType>
		|           <Type>xs:string</Type>
		|           <StringQualifiers><Length>0</Length><AllowedLength>Variable</AllowedLength></StringQualifiers>
		|        </ValueType>
		|      </column>
		|      <column>
		|        <Name xsi:type=""xs:string"">Значение2</Name>
		|        <ValueType>
		|           <Type>xs:string</Type>
		|           <StringQualifiers><Length>0</Length><AllowedLength>Variable</AllowedLength></StringQualifiers>
		|        </ValueType>
		|      </column>
		|
		|      <xsl:for-each select=""$first-second-nodeset/item | exsl:node-set($second-first)/item"">
		|        <xsl:element name=""row"">
		|           <xsl:element name=""Value"">
		|             <xsl:value-of select=""@path""/>
		|           </xsl:element>
		|           <xsl:element name=""Value"">
		|             <xsl:value-of select=""@value1""/>
		|           </xsl:element>
		|           <xsl:element name=""Value"">
		|             <xsl:value-of select=""@value2""/>
		|           </xsl:element>
		|        </xsl:element>
		|      </xsl:for-each>
		|
		|    </ValueTable>
		|
		|  </xsl:template>
		|  <!-- /main -->
		|
		|  <!-- compare sub -->
		|  <xsl:template name=""compare"">
		|    <xsl:param name=""check"" />
		|    <xsl:param name=""doubles"" select=""/.."" />
		|    
		|    <xsl:variable name=""path""  select=""@path""/>
		|    <xsl:variable name=""value"" select=""@value""/>
		|    <xsl:variable name=""diff""  select=""$check[@path=$path]""/>
		|    <xsl:choose>
		|      <xsl:when test=""count($diff)=0"">
		|        <xsl:if test=""count($doubles[@path=$path and @value1='' and @value2=$value])=0"">
		|          <xsl:element name=""item"">
		|            <xsl:attribute name=""path"">   <xsl:value-of select=""$path""/> </xsl:attribute>
		|            <xsl:attribute name=""value1""> <xsl:value-of select=""$value""/> </xsl:attribute>
		|            <xsl:attribute name=""value2"" />
		|          </xsl:element>
		|        </xsl:if>
		|      </xsl:when>
		|      <xsl:otherwise>
		|
		|        <xsl:for-each select=""$diff[@value!=$value]"">
		|            <xsl:variable name=""diff-value"" select=""@value""/>
		|            <xsl:if test=""count($doubles[@path=$path and @value1=$diff-value and @value2=$value])=0"">
		|              <xsl:element name=""item"">
		|                <xsl:attribute name=""path"">   <xsl:value-of select=""$path""/>  </xsl:attribute>
		|                <xsl:attribute name=""value1""> <xsl:value-of select=""$value""/> </xsl:attribute>
		|                <xsl:attribute name=""value2""> <xsl:value-of select=""@value""/> </xsl:attribute>
		|              </xsl:element>
		|            </xsl:if>
		|        </xsl:for-each>
		|      </xsl:otherwise>
		|    </xsl:choose>
		|  </xsl:template>
		|  
		|</xsl:stylesheet>
		|");
		
	Возврат Преобразователь;
КонецФункции

// Преобразование для текста с парами Ключ=Значение, разделенных переносами строк (см формат адреса) в XML.
// В случае повторных ключей все включаются в результат, но при десериализации будет использован 
// последний (особенность работы сериализатора платформы).
//
// Возвращаемое значение:
//     ПреобразованиеXSL  - подготовленный объект.
//
Функция XSLT_СтрокаКлючЗначениеВСтруктуру() Экспорт
	Преобразователь = Новый ПреобразованиеXSL;
	Преобразователь.ЗагрузитьИзСтроки("
		|<xsl:stylesheet version=""1.0""
		|  xmlns:xsl=""http://www.w3.org/1999/XSL/Transform""
		|  xmlns:str=""http://exslt.org/strings""
		|  extension-element-prefixes=""str""
		|>
		|<xsl:output method=""xml"" omit-xml-declaration=""yes"" indent=""yes"" encoding=""utf-8""/>
		|" + XSLT_ШаблоныСтроковыхФункций() + "
		|
		|  <xsl:template match=""ExternalParamNode"">
		|
		|    <xsl:variable name=""source"">
		|      <xsl:call-template name=""str-replace-all"">
		|        <xsl:with-param name=""str"" select=""."" />
		|        <xsl:with-param name=""search-for"" select=""'&#10;&#09;'"" />
		|        <xsl:with-param name=""replace-by"" select=""'&#13;'"" />
		|      </xsl:call-template>
		|    </xsl:variable>
		|
		|    <Structure xmlns=""http://v8.1c.ru/8.1/data/core"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" xsi:type=""Structure"">
		|
		|     <xsl:for-each select=""str:tokenize($source, '&#10;')"" >
		|       <xsl:if test=""contains(., '=')"">
		|
		|         <xsl:element name=""Property"">
		|           <xsl:attribute name=""name"" >
		|             <xsl:call-template name=""str-trim-all"">
		|               <xsl:with-param name=""str"" select=""substring-before(., '=')"" />
		|             </xsl:call-template>
		|           </xsl:attribute>
		|
		|           <Value xsi:type=""xs:string"">
		|             <xsl:call-template name=""str-replace-all"">
		|               <xsl:with-param name=""str"" select=""substring-after(., '=')"" />
		|               <xsl:with-param name=""search-for"" select=""'&#13;'"" />
		|               <xsl:with-param name=""replace-by"" select=""'&#10;'"" />
		|             </xsl:call-template>
		|           </Value>
		|
		|         </xsl:element>
		|
		|       </xsl:if>
		|     </xsl:for-each>
		|
		|    </Structure>
		|
		|  </xsl:template>
		|
		|</xsl:stylesheet>
		|");

	Возврат Преобразователь;
КонецФункции

// Преобразование для текста с парами Ключ=Значение, разделенных переносами строк (см формат адреса) в XML.
// В случае повторных ключей все включаются в результат
//
// Возвращаемое значение:
//     ПреобразованиеXSL  - подготовленный объект
//
Функция XSLT_СтрокаКлючЗначениеВСписокЗначений() Экспорт
	Преобразователь = Новый ПреобразованиеXSL;
	Преобразователь.ЗагрузитьИзСтроки("
		|<xsl:stylesheet version=""1.0""
		|  xmlns:xsl=""http://www.w3.org/1999/XSL/Transform""
		|  xmlns:str=""http://exslt.org/strings""
		|  extension-element-prefixes=""str""
		|>
		|<xsl:output method=""xml"" omit-xml-declaration=""yes"" indent=""yes"" encoding=""utf-8""/>
		|" + XSLT_ШаблоныСтроковыхФункций() + "
		|
		|  <xsl:template match=""ExternalParamNode"">
		|
		|    <xsl:variable name=""source"">
		|      <xsl:call-template name=""str-replace-all"">
		|        <xsl:with-param name=""str"" select=""."" />
		|        <xsl:with-param name=""search-for"" select=""'&#10;&#09;'"" />
		|        <xsl:with-param name=""replace-by"" select=""'&#13;'"" />
		|      </xsl:call-template>
		|    </xsl:variable>
		|
		|    <ValueListType xmlns=""http://v8.1c.ru/8.1/data/core"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" xsi:type=""ValueListType"">
		|    <valueType/>
		|
		|      <xsl:for-each select=""str:tokenize($source, '&#10;')"" >
		|        <xsl:if test=""contains(., '=')"">
		|
		|          <item>
		|            <value xsi:type=""xs:string"">
		|              <xsl:call-template name=""str-replace-all"">
		|                <xsl:with-param name=""str"" select=""substring-after(., '=')"" />
		|                <xsl:with-param name=""search-for"" select=""'&#13;'"" />
		|                <xsl:with-param name=""replace-by"" select=""'&#10;'"" />
		|              </xsl:call-template>
		|            </value>
		|            <presentation>
		|              <xsl:call-template name=""str-trim-left"">
		|                <xsl:with-param name=""str"" select=""substring-before(., '=')"" />
		|              </xsl:call-template>
		|            </presentation>
		|          </item>
		|
		|        </xsl:if>
		|      </xsl:for-each>
		|
		|    </ValueListType >
		|
		|  </xsl:template>
		|
		|</xsl:stylesheet>
		|");

	Возврат Преобразователь;
КонецФункции

// Преобразование для списка значений в строку пар ключ=значение, разделенных переносом строки
//
// Возвращаемое значение:
//     ПреобразованиеXSL  - подготовленный объект
//
Функция XSLT_СписокЗначенийВСтрокуКлючЗначение() Экспорт
	Преобразователь = Новый ПреобразованиеXSL;
	Преобразователь.ЗагрузитьИзСтроки("
		|<xsl:stylesheet version=""1.0"" xmlns:xsl=""http://www.w3.org/1999/XSL/Transform""
		|  xmlns:tns=""http://v8.1c.ru/8.1/data/core""
		|>
		|<xsl:output method=""text"" encoding=""utf-8""/>
		|" + XSLT_ШаблоныСтроковыхФункций() + "
		|  
		|  <xsl:template match=""/"">
		|    <xsl:apply-templates select=""//tns:ValueListType/tns:item"" />
		|  </xsl:template>
		|  
		|  <xsl:template match=""//tns:ValueListType/tns:item"">
		|
		|    <xsl:call-template name=""str-trim-all"">
		|      <xsl:with-param name=""str"" select=""tns:presentation"" />
		|    </xsl:call-template>
		|    <xsl:text/>=<xsl:text/>
		|
		|    <xsl:call-template name=""str-replace-all"">
		|      <xsl:with-param name=""str"" select=""tns:value"" />
		|      <xsl:with-param name=""search-for"" select=""'&#10;'"" />
		|      <xsl:with-param name=""replace-by"" select=""'&#10;&#09;'"" />
		|    </xsl:call-template>
		|
		|    <xsl:if test=""position()!=last()"">
		|      <xsl:text/>
		|        <xsl:value-of select=""'&#10;'""/>
		|      <xsl:text/>
		|    </xsl:if>
		|  </xsl:template>
		|
		|</xsl:stylesheet>
		|");
	Возврат Преобразователь;
КонецФункции

// Преобразование для структуры в строку пар ключ=значение, разделенных переносом строки
//
// Возвращаемое значение:
//     ПреобразованиеXSL  - подготовленный объект
//
Функция XSLT_СтруктураВСтрокуКлючЗначение() Экспорт
	Преобразователь = Новый ПреобразованиеXSL;
	Преобразователь.ЗагрузитьИзСтроки("
		|<xsl:stylesheet version=""1.0"" xmlns:xsl=""http://www.w3.org/1999/XSL/Transform""
		|  xmlns:tns=""http://v8.1c.ru/8.1/data/core""
		|>
		|<xsl:output method=""text"" encoding=""utf-8""/>
		|" + XSLT_ШаблоныСтроковыхФункций() + "
		|
		|  <xsl:template match=""/"">
		|    <xsl:apply-templates select=""//tns:Structure/tns:Property"" />
		|  </xsl:template>
		|
		|  <xsl:template match=""//tns:Property"">
		|
		|    <xsl:value-of select=""@name"" />
		|    <xsl:text/>=<xsl:text/>
		|
		|    <xsl:call-template name=""str-replace-all"">
		|      <xsl:with-param name=""str"" select=""tns:Value"" />
		|      <xsl:with-param name=""search-for"" select=""'&#10;'"" />
		|      <xsl:with-param name=""replace-by"" select=""'&#10;&#09;'"" />
		|    </xsl:call-template>
		|
		|    <xsl:if test=""position()!=last()"">
		|      <xsl:text/>
		|        <xsl:value-of select=""'&#10;'""/>
		|      <xsl:text/>
		|    </xsl:if>
		|  </xsl:template>
		|</xsl:stylesheet>
		|");
	Возврат Преобразователь;
КонецФункции

// Преобразование для списка значений в структуру. Представление преобразуется в ключ.
//
// Возвращаемое значение:
//     ПреобразованиеXSL  - подготовленный объект.
//
Функция XSLT_СписокЗначенийВСтруктуру() Экспорт
	Преобразователь = Новый ПреобразованиеXSL;
	Преобразователь.ЗагрузитьИзСтроки("
		|<xsl:stylesheet version=""1.0"" xmlns:xsl=""http://www.w3.org/1999/XSL/Transform""
		|  xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""
		|  xmlns:tns=""http://v8.1c.ru/8.1/data/core""
		|  xmlns=""http://v8.1c.ru/8.1/data/core""
		|>
		|<xsl:output method=""xml"" omit-xml-declaration=""yes"" indent=""yes"" encoding=""utf-8""/>
		|" + XSLT_ШаблоныСтроковыхФункций() + "
		|
		|  <xsl:template match=""/"">
		|    <Structure xmlns=""http://v8.1c.ru/8.1/data/core"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" xsi:type=""Structure"">
		|      <xsl:apply-templates select=""//tns:ValueListType/tns:item"" />
		|    </Structure >
		|  </xsl:template>
		|
		|  <xsl:template match=""//tns:ValueListType/tns:item"">
		|    <xsl:element name=""Property"">
		|      <xsl:attribute name=""name"">
		|        <xsl:call-template name=""str-trim-all"">
		|          <xsl:with-param name=""str"" select=""tns:presentation"" />
		|        </xsl:call-template>
		|      </xsl:attribute>
		|
		|      <xsl:element name=""Value"">
		|        <xsl:attribute name=""xsi:type"">
		|          <xsl:value-of select=""tns:value/@xsi:type""/>  
		|        </xsl:attribute>
		|        <xsl:value-of select=""tns:value""/>  
		|      </xsl:element>
		|
		|    </xsl:element>
		|</xsl:template>
		|
		|</xsl:stylesheet>
		|");
	Возврат Преобразователь;
КонецФункции

// Преобразование для структуры в список значений. Ключ преобразуется в представление.
//
// Возвращаемое значение:
//     ПреобразованиеXSL  - подготовленный объект
//
Функция XSLT_СтруктураВСписокЗначений() Экспорт
	Преобразователь = Новый ПреобразованиеXSL;
	Преобразователь.ЗагрузитьИзСтроки("
		|<xsl:stylesheet version=""1.0"" xmlns:xsl=""http://www.w3.org/1999/XSL/Transform""
		|  xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""
		|  xmlns:tns=""http://v8.1c.ru/8.1/data/core""
		|  xmlns=""http://v8.1c.ru/8.1/data/core""
		|>
		|<xsl:output method=""xml"" omit-xml-declaration=""yes"" indent=""yes"" encoding=""utf-8""/>
		|" + XSLT_ШаблоныСтроковыхФункций() + "
		|
		|  <xsl:template match=""/"">
		|    <ValueListType xmlns=""http://v8.1c.ru/8.1/data/core"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" xsi:type=""ValueListType"">
		|      <valueType/>
		|        <xsl:apply-templates select=""//tns:Structure/tns:Property"" />
		|    </ValueListType>
		|  </xsl:template>
		|
		|  <xsl:template match=""//tns:Property"">
		|    <item>
		|      <value xsi:type=""xs:string"">
		|        <xsl:value-of select=""tns:Value"" />
		|      </value>
		|      <presentation>
		|        <xsl:value-of select=""@name"" />
		|      </presentation>
		|    </item>
		|  </xsl:template>
		|
		|</xsl:stylesheet>
		|");
	Возврат Преобразователь;
КонецФункции

// Преобразование для соответствия в структуру. Ключ преобразуется в ключ, значение - в значение.
//
// Возвращаемое значение:
//     ПреобразованиеXSL  - подготовленный объект.
//
Функция XSLT_СоответствиеВСтруктуру() Экспорт
	Преобразователь = Новый ПреобразованиеXSL;
	Преобразователь.ЗагрузитьИзСтроки("
		|<xsl:stylesheet version=""1.0"" xmlns:xsl=""http://www.w3.org/1999/XSL/Transform""
		|  xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""
		|  xmlns:tns=""http://v8.1c.ru/8.1/data/core""
		|  xmlns=""http://v8.1c.ru/8.1/data/core""
		|>
		|<xsl:output method=""xml"" omit-xml-declaration=""yes"" indent=""yes"" encoding=""utf-8""/>
		|" + XSLT_ШаблоныСтроковыхФункций() + "
		|
		|  <xsl:template match=""/"">
		|    <Structure xmlns=""http://v8.1c.ru/8.1/data/core"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" xsi:type=""Structure"">
		|      <xsl:apply-templates select=""//tns:Map/tns:pair"" />
		|    </Structure >
		|  </xsl:template>
		|  
		|  <xsl:template match=""//tns:Map/tns:pair"">
		|  <xsl:element name=""Property"">
		|    <xsl:attribute name=""name"">
		|      <xsl:call-template name=""str-trim-all"">
		|        <xsl:with-param name=""str"" select=""tns:Key"" />
		|      </xsl:call-template>
		|    </xsl:attribute>
		|  
		|    <xsl:element name=""Value"">
		|      <xsl:attribute name=""xsi:type"">
		|        <xsl:value-of select=""tns:Value/@xsi:type""/>  
		|      </xsl:attribute>
		|        <xsl:value-of select=""tns:Value""/>  
		|      </xsl:element>
		|  
		|    </xsl:element>
		|  </xsl:template>
		|
		|</xsl:stylesheet>
		|");
	Возврат Преобразователь;
КонецФункции

// Убирает описание <?xml...> для включения внутрь другого XML.
//
// Возвращаемое значение:
//     ПреобразованиеXSL  - подготовленный объект.
//
Функция XSLT_УдалитьОписаниеXML() Экспорт
	Преобразователь = Новый ПреобразованиеXSL;
	Преобразователь.ЗагрузитьИзСтроки("
		|<xsl:stylesheet version=""1.0"" xmlns:xsl=""http://www.w3.org/1999/XSL/Transform"">
		|<xsl:output method=""xml"" omit-xml-declaration=""yes"" indent=""yes"" encoding=""utf-8""/>
		|  <xsl:template match=""node() | @*"">
		|    <xsl:copy>
		|      <xsl:apply-templates select=""node() | @*"" />
		|    </xsl:copy>
		|  </xsl:template>
		|</xsl:stylesheet>
		|");
	Возврат Преобразователь;
КонецФункции

// Преобразование для контактной информации в виде XML (см пакет XDTO КонтактнаяИнформация) в перечисление
// ТипКонтактнойИнформации.
//
// Возвращаемое значение:
//     ПреобразованиеXSL  - подготовленный объект.
//
Функция XSLT_ТипКонтактнойИнформацииПоСтрокеXML() Экспорт
	Преобразователь = Новый ПреобразованиеXSL;
	Преобразователь.ЗагрузитьИзСтроки("
		|<xsl:stylesheet version=""1.0"" xmlns:xsl=""http://www.w3.org/1999/XSL/Transform""
		|  xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""
		|  xmlns:ci=""http://www.v8.1c.ru/ssl/contactinfo""
		|>
		|  <xsl:output method=""xml"" omit-xml-declaration=""yes"" indent=""yes"" encoding=""utf-8""/>
		|
		|  <xsl:template match=""/"">
		|    <EnumRef.ТипыКонтактнойИнформации xmlns=""http://v8.1c.ru/8.1/data/enterprise/current-config"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" xsi:type=""EnumRef.ТипыКонтактнойИнформации"">
		|      <xsl:call-template name=""enum-by-type"" >
		|        <xsl:with-param name=""type"" select=""ci:КонтактнаяИнформация/ci:Состав/@xsi:type"" />
		|      </xsl:call-template>
		|    </EnumRef.ТипыКонтактнойИнформации>
		|  </xsl:template>
		|
		|  <xsl:template name=""enum-by-type"">
		|    <xsl:param name=""type"" />
		|    <xsl:choose>
		|      <xsl:when test=""$type='Адрес'"">
		|        <xsl:text>Адрес</xsl:text>
		|      </xsl:when>
		|      <xsl:when test=""$type='НомерТелефона'"">
		|        <xsl:text>Телефон</xsl:text>
		|      </xsl:when>
		|      <xsl:when test=""$type='НомерФакса'"">
		|        <xsl:text>Факс</xsl:text>
		|      </xsl:when>
		|      <xsl:when test=""$type='ЭлектроннаяПочта'"">
		|        <xsl:text>АдресЭлектроннойПочты</xsl:text>
		|      </xsl:when>
		|      <xsl:when test=""$type='ВебСайт'"">
		|        <xsl:text>ВебСтраница</xsl:text>
		|      </xsl:when>
		|      <xsl:when test=""$type='Прочее'"">
		|        <xsl:text>Другое</xsl:text>
		|      </xsl:when>
		|    </xsl:choose>
		|  </xsl:template>
		|
		|</xsl:stylesheet>
		|");
	Возврат Преобразователь;
КонецФункции

// Преобразование для таблицы различий XML в зависимости от типа контактной информации.
//
// Параметры:
//    ТипКонтактнойИнформации - Строка, ПеречислениеСсылка.ТипыКонтактнойИнформации - имя или значение перечисления.
//
// Возвращаемое значение:
//     ПреобразованиеXSL  - подготовленный объект.
//
Функция XSLT_ИнтерпретацияРазличияXMLКонтактнойИнформации(Знач ТипКонтактнойИнформации) Экспорт
	
	Если ТипЗнч(ТипКонтактнойИнформации) <> Тип("Строка") Тогда
		ТипКонтактнойИнформации = ТипКонтактнойИнформации.Метаданные().Имя;
	КонецЕсли;
	
	Преобразователь = Новый ПреобразованиеXSL;
	Преобразователь.ЗагрузитьИзСтроки("
		|<xsl:stylesheet version=""1.0"" xmlns:xsl=""http://www.w3.org/1999/XSL/Transform""
		|  xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""
		|  xmlns:ci=""http://www.v8.1c.ru/ssl/contactinfo""
		|>
		|<xsl:output method=""xml"" omit-xml-declaration=""yes"" indent=""yes"" encoding=""utf-8""/>
		|  <xsl:param name=""target-type"" select=""'" + ТипКонтактнойИнформации + "'""/>
		|
		|  <xsl:template match=""/"">
		|    <xsl:choose>
		|      <xsl:when test=""$target-type='Адрес'"">
		|         <xsl:apply-templates select=""."" mode=""action-address""/>
		|      </xsl:when>
		|      <xsl:otherwise>
		|         <xsl:apply-templates select=""."" mode=""action-copy""/>
		|      </xsl:otherwise>
		|    </xsl:choose>
		|  </xsl:template>
		|
		|  <xsl:template match=""node() | @*"" mode=""action-copy"">
		|    <xsl:copy>
		|      <xsl:apply-templates select=""node() | @*"" mode=""action-copy""/>
		|    </xsl:copy>
		|  </xsl:template>
		|
		|  <xsl:template match=""node() | @*"" mode=""action-address"">
		|    <xsl:copy>
		|      <xsl:apply-templates select=""node() | @*"" mode=""action-address""/>
		|    </xsl:copy>
		|  </xsl:template>
		|
		|</xsl:stylesheet>
		|");
	Возврат Преобразователь;
КонецФункции

// Преобразует сериализованную структуру в контактную информацию в виде XML
//
// Возвращаемое значение:
//     ПреобразованиеXSL  - подготовленный объект
//
Функция XSLT_СтруктураВАдрес() Экспорт
	
	КодыДопАдрЭл = Новый ТекстовыйДокумент;
	Для Каждого ДопАдрЭл Из УправлениеКонтактнойИнформациейКлиентСервер.ТипыОбъектовАдресацииАдресаРФ() Цикл
		КодыДопАдрЭл.ДобавитьСтроку("<data:item data:title=""" + ДопАдрЭл.Наименование + """>" + ДопАдрЭл.Код + "</data:item>");
	КонецЦикла;
	
	КодыРегионов = Новый ТекстовыйДокумент;
	ВсеРегионы = УправлениеКонтактнойИнформациейСлужебный.ВсеРегионы();
	Если ВсеРегионы <> Неопределено Тогда
		Для Каждого Строка Из ВсеРегионы Цикл
			КодыРегионов.ДобавитьСтроку("<data:item data:code=""" + Формат(Строка.Код, "ЧН=; ЧГ=") + """>" + Строка.Представление + "</data:item>");
		КонецЦикла;
	КонецЕсли;
	
	Преобразователь = Новый ПреобразованиеXSL;
	Преобразователь.ЗагрузитьИзСтроки("
		|<xsl:stylesheet version=""1.0"" xmlns:xsl=""http://www.w3.org/1999/XSL/Transform""
		|  xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""
		|  xmlns:xs=""http://www.w3.org/2001/XMLSchema""
		|  xmlns:tns=""http://v8.1c.ru/8.1/data/core""
		|  xmlns=""http://www.v8.1c.ru/ssl/contactinfo"" 
		|
		|  xmlns:data=""http://www.v8.1c.ru/ssl/contactinfo""
		|
		|  xmlns:exsl=""http://exslt.org/common""
		|  extension-element-prefixes=""exsl""
		|  exclude-result-prefixes=""data tns""
		|>
		|<xsl:output method=""xml"" omit-xml-declaration=""yes"" indent=""yes"" encoding=""utf-8""/>
		|  " + XSLT_ШаблоныСтроковыхФункций() + "
		|  
		|  <xsl:variable name=""local-country"">РОССИЯ</xsl:variable>
		|
		|  <xsl:variable name=""presentation"" select=""tns:Structure/tns:Property[@name='Представление']/tns:Value/text()"" />
		|  
		|  <xsl:template match=""/"">
		|    <КонтактнаяИнформация>
		|
		|      <xsl:attribute name=""Представление"">
		|        <xsl:value-of select=""$presentation""/>
		|      </xsl:attribute> 
		|      <xsl:element name=""Комментарий"">
		|       <xsl:value-of select=""tns:Structure/tns:Property[@name='Комментарий']/tns:Value/text()""/>
		|      </xsl:element>
		|
		|      <xsl:element name=""Состав"">
		|        <xsl:attribute name=""xsi:type"">Адрес</xsl:attribute>
		|        <xsl:variable name=""country"" select=""tns:Structure/tns:Property[@name='Страна']/tns:Value/text()""></xsl:variable>
		|        <xsl:variable name=""country-upper"">
		|          <xsl:call-template name=""str-upper"">
		|            <xsl:with-param name=""str"" select=""$country"" />
		|          </xsl:call-template>
		|        </xsl:variable>
		|
		|        <xsl:attribute name=""Страна"">
		|          <xsl:choose>
		|            <xsl:when test=""0=count($country)"">
		|              <xsl:value-of select=""$local-country"" />
		|            </xsl:when>
		|            <xsl:otherwise>
		|              <xsl:value-of select=""$country"" />
		|            </xsl:otherwise> 
		|          </xsl:choose>
		|        </xsl:attribute>
		|
		|        <xsl:choose>
		|          <xsl:when test=""0=count($country)"">
		|            <xsl:apply-templates select=""/"" mode=""domestic"" />
		|          </xsl:when>
		|          <xsl:when test=""$country-upper=$local-country"">
		|            <xsl:apply-templates select=""/"" mode=""domestic"" />
		|          </xsl:when>
		|          <xsl:otherwise>
		|            <xsl:apply-templates select=""/"" mode=""foreign"" />
		|          </xsl:otherwise> 
		|        </xsl:choose>
		|
		|      </xsl:element>
		|    </КонтактнаяИнформация>
		|  </xsl:template>
		|  
		|  <xsl:template match=""/"" mode=""foreign"">
		|    <xsl:element name=""Состав"">
		|      <xsl:attribute name=""xsi:type"">xs:string</xsl:attribute>
		|
		|      <xsl:variable name=""value"" select=""tns:Structure/tns:Property[@name='Значение']/tns:Value/text()"" />        
		|      <xsl:choose>
		|        <xsl:when test=""0=count($value)"">
		|          <xsl:value-of select=""$presentation"" />
		|        </xsl:when>
		|        <xsl:otherwise>
		|          <xsl:value-of select=""$value"" />
		|        </xsl:otherwise> 
		|      </xsl:choose>
		|    
		|    </xsl:element>
		|  </xsl:template>
		|  
		|  <xsl:template match=""/"" mode=""domestic"">
		|    <xsl:element name=""Состав"">
		|      <xsl:attribute name=""xsi:type"">АдресРФ</xsl:attribute>
		|    
		|      <xsl:element name=""СубъектРФ"">
		|        <xsl:variable name=""value"" select=""tns:Structure/tns:Property[@name='Регион']/tns:Value/text()"" />
		|
		|        <xsl:choose>
		|          <xsl:when test=""0=count($value)"">
		|            <xsl:variable name=""regioncode"" select=""tns:Structure/tns:Property[@name='КодРегиона']/tns:Value/text()""/>
		|            <xsl:variable name=""regiontitle"" select=""$enum-regioncode-nodes/data:item[@data:code=number($regioncode)]"" />
		|              <xsl:if test=""0!=count($regiontitle)"">
		|                <xsl:value-of select=""$regiontitle""/>
		|              </xsl:if>
		|          </xsl:when>
		|          <xsl:otherwise>
		|            <xsl:value-of select=""$value"" />
		|          </xsl:otherwise> 
		|        </xsl:choose>
		|
		|      </xsl:element>
		|   
		|      <xsl:element name=""СвРайМО"">
		|        <xsl:element name=""Район"">
		|          <xsl:value-of select=""tns:Structure/tns:Property[@name='Район']/tns:Value/text()""/>
		|        </xsl:element>
		|      </xsl:element>
		|  
		|      <xsl:element name=""Город"">
		|        <xsl:value-of select=""tns:Structure/tns:Property[@name='Город']/tns:Value/text()""/>
		|      </xsl:element>
		|    
		|      <xsl:element name=""НаселПункт"">
		|        <xsl:value-of select=""tns:Structure/tns:Property[@name='НаселенныйПункт']/tns:Value/text()""/>
		|      </xsl:element>
		|
		|      <xsl:element name=""Улица"">
		|        <xsl:value-of select=""tns:Structure/tns:Property[@name='Улица']/tns:Value/text()""/>
		|      </xsl:element>
		|
		|      <xsl:variable name=""index"" select=""tns:Structure/tns:Property[@name='Индекс']/tns:Value/text()"" />
		|      <xsl:if test=""0!=count($index)"">
		|        <xsl:element name=""ДопАдрЭл"">
		|          <xsl:attribute name=""ТипАдрЭл"">" + УправлениеКонтактнойИнформациейКлиентСервер.КодСериализацииПочтовогоИндекса() + "</xsl:attribute>
		|          <xsl:attribute name=""Значение""><xsl:value-of select=""$index""/></xsl:attribute>
		|        </xsl:element>
		|      </xsl:if>
		|
		|      <xsl:call-template name=""add-elem-number"">
		|        <xsl:with-param name=""source"" select=""tns:Structure/tns:Property[@name='ТипДома']/tns:Value/text()"" />
		|        <xsl:with-param name=""defsrc"" select=""'Дом'"" />
		|        <xsl:with-param name=""value""  select=""tns:Structure/tns:Property[@name='Дом']/tns:Value/text()"" />
		|      </xsl:call-template>
		|
		|      <xsl:call-template name=""add-elem-number"">
		|        <xsl:with-param name=""source"" select=""tns:Structure/tns:Property[@name='ТипКорпуса']/tns:Value/text()"" />
		|        <xsl:with-param name=""defsrc"" select=""'Корпус'"" />
		|        <xsl:with-param name=""value""  select=""tns:Structure/tns:Property[@name='Корпус']/tns:Value/text()"" />
		|      </xsl:call-template>
		|
		|      <xsl:call-template name=""add-elem-number"">
		|        <xsl:with-param name=""source"" select=""tns:Structure/tns:Property[@name='ТипКвартиры']/tns:Value/text()"" />
		|        <xsl:with-param name=""defsrc"" select=""'Квартира'"" />
		|        <xsl:with-param name=""value""  select=""tns:Structure/tns:Property[@name='Квартира']/tns:Value/text()"" />
		|      </xsl:call-template>
		|    
		|    </xsl:element>
		|  </xsl:template>
		|
		|  <xsl:param name=""enum-codevalue"">
		|" + КодыДопАдрЭл.ПолучитьТекст() + "
		|  </xsl:param>
		|  <xsl:variable name=""enum-codevalue-nodes"" select=""exsl:node-set($enum-codevalue)"" />
		|
		|  <xsl:param name=""enum-regioncode"">
		|" + КодыРегионов.ПолучитьТекст() + "
		|  </xsl:param>
		|  <xsl:variable name=""enum-regioncode-nodes"" select=""exsl:node-set($enum-regioncode)"" />
		|  
		|  <xsl:template name=""add-elem-number"">
		|    <xsl:param name=""source"" />
		|    <xsl:param name=""defsrc"" />
		|    <xsl:param name=""value"" />
		|
		|    <xsl:if test=""0!=count($value)"">
		|
		|      <xsl:choose>
		|        <xsl:when test=""0!=count($source)"">
		|          <xsl:variable name=""type-code"" select=""$enum-codevalue-nodes/data:item[@data:title=$source]"" />
		|          <xsl:element name=""ДопАдрЭл"">
		|            <xsl:element name=""Номер"">
		|              <xsl:attribute name=""Тип""><xsl:value-of select=""$type-code"" /></xsl:attribute>
		|              <xsl:attribute name=""Значение""><xsl:value-of select=""$value""/></xsl:attribute>
		|            </xsl:element>
		|          </xsl:element>
		|
		|        </xsl:when>
		|        <xsl:otherwise>
		|          <xsl:variable name=""type-code"" select=""$enum-codevalue-nodes/data:item[@data:title=$defsrc]"" />
		|          <xsl:element name=""ДопАдрЭл"">
		|            <xsl:element name=""Номер"">
		|              <xsl:attribute name=""Тип""><xsl:value-of select=""$type-code"" /></xsl:attribute>
		|              <xsl:attribute name=""Значение""><xsl:value-of select=""$value""/></xsl:attribute>
		|            </xsl:element>
		|          </xsl:element>
		|
		|        </xsl:otherwise>
		|      </xsl:choose>
		|
		|    </xsl:if>
		|  
		|  </xsl:template>
		|  
		|</xsl:stylesheet>
		|");
	Возврат Преобразователь;
КонецФункции

// Возвращает преобразователь XSL для конвертации структуры в контактную информацию в виде XML.
//
// Возвращаемое значение:
//     ПреобразованиеXSL  - подготовленный объект.
//
Функция XSLT_ПреобразованиеXSL() Экспорт
	
	КодыДополнительныхАдресныхЭлементов = Новый ТекстовыйДокумент;
	Для Каждого ДополнительныйАдресныйЭлемент Из УправлениеКонтактнойИнформациейКлиентСервер.ТипыОбъектовАдресацииАдресаРФ() Цикл
		КодыДополнительныхАдресныхЭлементов.ДобавитьСтроку("<data:item data:title=""" + ДополнительныйАдресныйЭлемент.Наименование + """>" + ДополнительныйАдресныйЭлемент.Код + "</data:item>");
	КонецЦикла;
	
	КодыРегионов = Новый ТекстовыйДокумент;
	ВсеРегионы = УправлениеКонтактнойИнформациейСлужебный.ВсеРегионы();
	Если ВсеРегионы <> Неопределено Тогда
		Для Каждого Строка Из ВсеРегионы Цикл
			КодыРегионов.ДобавитьСтроку("<data:item data:code=""" + Формат(Строка.КодСубъектаРФ, "ЧН=; ЧГ=") + """>" 
				+ Строка.Представление + "</data:item>");
		КонецЦикла;
	КонецЕсли;
	
	Преобразователь = Новый ПреобразованиеXSL;
	Преобразователь.ЗагрузитьИзСтроки("
		|<xsl:stylesheet version=""1.0"" xmlns:xsl=""http://www.w3.org/1999/XSL/Transform""
		|  xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""
		|  xmlns:xs=""http://www.w3.org/2001/XMLSchema""
		|  xmlns:tns=""http://v8.1c.ru/8.1/data/core""
		|  xmlns=""http://www.v8.1c.ru/ssl/contactinfo"" 
		|
		|  xmlns:data=""http://www.v8.1c.ru/ssl/contactinfo""
		|
		|  xmlns:exsl=""http://exslt.org/common""
		|  extension-element-prefixes=""exsl""
		|  exclude-result-prefixes=""data tns""
		|>
		|<xsl:output method=""xml"" omit-xml-declaration=""yes"" indent=""yes"" encoding=""utf-8""/>
		|  " + XSLT_ШаблоныСтроковыхФункций() + "
		|  
		|  <xsl:variable name=""local-country"">РОССИЯ</xsl:variable>
		|
		|  <xsl:variable name=""presentation"" select=""tns:Structure/tns:Property[@name='Представление']/tns:Value/text()"" />
		|  
		|  <xsl:template match=""/"">
		|    <КонтактнаяИнформация>
		|
		|      <xsl:attribute name=""Представление"">
		|        <xsl:value-of select=""$presentation""/>
		|      </xsl:attribute> 
		|      <xsl:element name=""Комментарий"">
		|       <xsl:value-of select=""tns:Structure/tns:Property[@name='Комментарий']/tns:Value/text()""/>
		|      </xsl:element>
		|
		|      <xsl:element name=""Состав"">
		|        <xsl:attribute name=""xsi:type"">Адрес</xsl:attribute>
		|        <xsl:variable name=""country"" select=""tns:Structure/tns:Property[@name='Страна']/tns:Value/text()""></xsl:variable>
		|        <xsl:variable name=""country-upper"">
		|          <xsl:call-template name=""str-upper"">
		|            <xsl:with-param name=""str"" select=""$country"" />
		|          </xsl:call-template>
		|        </xsl:variable>
		|
		|        <xsl:attribute name=""Страна"">
		|          <xsl:choose>
		|            <xsl:when test=""0=count($country)"">
		|              <xsl:value-of select=""$local-country"" />
		|            </xsl:when>
		|            <xsl:otherwise>
		|              <xsl:value-of select=""$country"" />
		|            </xsl:otherwise> 
		|          </xsl:choose>
		|        </xsl:attribute>
		|
		|        <xsl:choose>
		|          <xsl:when test=""0=count($country)"">
		|            <xsl:apply-templates select=""/"" mode=""domestic"" />
		|          </xsl:when>
		|          <xsl:when test=""$country-upper=$local-country"">
		|            <xsl:apply-templates select=""/"" mode=""domestic"" />
		|          </xsl:when>
		|          <xsl:otherwise>
		|            <xsl:apply-templates select=""/"" mode=""foreign"" />
		|          </xsl:otherwise> 
		|        </xsl:choose>
		|
		|      </xsl:element>
		|    </КонтактнаяИнформация>
		|  </xsl:template>
		|  
		|  <xsl:template match=""/"" mode=""foreign"">
		|    <xsl:element name=""Состав"">
		|      <xsl:attribute name=""xsi:type"">xs:string</xsl:attribute>
		|
		|      <xsl:variable name=""value"" select=""tns:Structure/tns:Property[@name='Значение']/tns:Value/text()"" />        
		|      <xsl:choose>
		|        <xsl:when test=""0=count($value)"">
		|          <xsl:value-of select=""$presentation"" />
		|        </xsl:when>
		|        <xsl:otherwise>
		|          <xsl:value-of select=""$value"" />
		|        </xsl:otherwise> 
		|      </xsl:choose>
		|    
		|    </xsl:element>
		|  </xsl:template>
		|  
		|  <xsl:template match=""/"" mode=""domestic"">
		|    <xsl:element name=""Состав"">
		|      <xsl:attribute name=""xsi:type"">АдресРФ</xsl:attribute>
		|    
		|      <xsl:element name=""СубъектРФ"">
		|        <xsl:variable name=""value"" select=""tns:Structure/tns:Property[@name='Регион']/tns:Value/text()"" />
		|
		|        <xsl:choose>
		|          <xsl:when test=""0=count($value)"">
		|            <xsl:variable name=""regioncode"" select=""tns:Structure/tns:Property[@name='КодРегиона']/tns:Value/text()""/>
		|            <xsl:variable name=""regiontitle"" select=""$enum-regioncode-nodes/data:item[@data:code=number($regioncode)]"" />
		|              <xsl:if test=""0!=count($regiontitle)"">
		|                <xsl:value-of select=""$regiontitle""/>
		|              </xsl:if>
		|          </xsl:when>
		|          <xsl:otherwise>
		|            <xsl:value-of select=""$value"" />
		|          </xsl:otherwise> 
		|        </xsl:choose>
		|
		|      </xsl:element>
		|   
		|      <xsl:element name=""Округ"">
		|        <xsl:value-of select=""tns:Structure/tns:Property[@name='Округ']/tns:Value/text()""/>
		|      </xsl:element>
		|
		|      <xsl:element name=""СвРайМО"">
		|        <xsl:element name=""Район"">
		|          <xsl:value-of select=""tns:Structure/tns:Property[@name='Район']/tns:Value/text()""/>
		|        </xsl:element>
		|      </xsl:element>
		|  
		|      <xsl:element name=""Город"">
		|        <xsl:value-of select=""tns:Structure/tns:Property[@name='Город']/tns:Value/text()""/>
		|      </xsl:element>
		|    
		|      <xsl:element name=""ВнутригРайон"">
		|        <xsl:value-of select=""tns:Structure/tns:Property[@name='ВнутригРайон']/tns:Value/text()""/>
		|      </xsl:element>
		|
		|      <xsl:element name=""НаселПункт"">
		|        <xsl:value-of select=""tns:Structure/tns:Property[@name='НаселенныйПункт']/tns:Value/text()""/>
		|      </xsl:element>
		|
		|      <xsl:element name=""Улица"">
		|        <xsl:value-of select=""tns:Structure/tns:Property[@name='Улица']/tns:Value/text()""/>
		|      </xsl:element>
		|
		|      <xsl:variable name=""index"" select=""tns:Structure/tns:Property[@name='Индекс']/tns:Value/text()"" />
		|      <xsl:if test=""0!=count($index)"">
		|        <xsl:element name=""ДопАдрЭл"">
		|          <xsl:attribute name=""ТипАдрЭл"">" + УправлениеКонтактнойИнформациейКлиентСервер.КодСериализацииПочтовогоИндекса() + "</xsl:attribute>
		|          <xsl:attribute name=""Значение""><xsl:value-of select=""$index""/></xsl:attribute>
		|        </xsl:element>
		|      </xsl:if>
		|
		|      <xsl:call-template name=""add-elem-number"">
		|        <xsl:with-param name=""source"" select=""tns:Structure/tns:Property[@name='ТипДома']/tns:Value/text()"" />
		|        <xsl:with-param name=""defsrc"" select=""'Дом'"" />
		|        <xsl:with-param name=""value""  select=""tns:Structure/tns:Property[@name='Дом']/tns:Value/text()"" />
		|      </xsl:call-template>
		|
		|      <xsl:call-template name=""add-elem-number"">
		|        <xsl:with-param name=""source"" select=""tns:Structure/tns:Property[@name='ТипКорпуса']/tns:Value/text()"" />
		|        <xsl:with-param name=""defsrc"" select=""'Корпус'"" />
		|        <xsl:with-param name=""value""  select=""tns:Structure/tns:Property[@name='Корпус']/tns:Value/text()"" />
		|      </xsl:call-template>
		|
		|      <xsl:call-template name=""add-elem-number"">
		|        <xsl:with-param name=""source"" select=""tns:Structure/tns:Property[@name='ТипКвартиры']/tns:Value/text()"" />
		|        <xsl:with-param name=""defsrc"" select=""'Квартира'"" />
		|        <xsl:with-param name=""value""  select=""tns:Structure/tns:Property[@name='Квартира']/tns:Value/text()"" />
		|      </xsl:call-template>
		|    
		|    </xsl:element>
		|  </xsl:template>
		|
		|  <xsl:param name=""enum-codevalue"">
		|" + КодыДополнительныхАдресныхЭлементов.ПолучитьТекст() + "
		|  </xsl:param>
		|  <xsl:variable name=""enum-codevalue-nodes"" select=""exsl:node-set($enum-codevalue)"" />
		|
		|  <xsl:param name=""enum-regioncode"">
		|" + КодыРегионов.ПолучитьТекст() + "
		|  </xsl:param>
		|  <xsl:variable name=""enum-regioncode-nodes"" select=""exsl:node-set($enum-regioncode)"" />
		|  
		|  <xsl:template name=""add-elem-number"">
		|    <xsl:param name=""source"" />
		|    <xsl:param name=""defsrc"" />
		|    <xsl:param name=""value"" />
		|
		|    <xsl:if test=""0!=count($value)"">
		|
		|      <xsl:choose>
		|        <xsl:when test=""0!=count($source)"">
		|          <xsl:variable name=""type-code"" select=""$enum-codevalue-nodes/data:item[@data:title=$source]"" />
		|          <xsl:element name=""ДопАдрЭл"">
		|            <xsl:element name=""Номер"">
		|              <xsl:attribute name=""Тип""><xsl:value-of select=""$type-code"" /></xsl:attribute>
		|              <xsl:attribute name=""Значение""><xsl:value-of select=""$value""/></xsl:attribute>
		|            </xsl:element>
		|          </xsl:element>
		|
		|        </xsl:when>
		|        <xsl:otherwise>
		|          <xsl:variable name=""type-code"" select=""$enum-codevalue-nodes/data:item[@data:title=$defsrc]"" />
		|          <xsl:element name=""ДопАдрЭл"">
		|            <xsl:element name=""Номер"">
		|              <xsl:attribute name=""Тип""><xsl:value-of select=""$type-code"" /></xsl:attribute>
		|              <xsl:attribute name=""Значение""><xsl:value-of select=""$value""/></xsl:attribute>
		|            </xsl:element>
		|          </xsl:element>
		|
		|        </xsl:otherwise>
		|      </xsl:choose>
		|
		|    </xsl:if>
		|  
		|  </xsl:template>
		|  
		|</xsl:stylesheet>
		|");
	Возврат Преобразователь;
КонецФункции

// Преобразует сериализованную структуру в контактную информацию в виде XML.
//
// Возвращаемое значение:
//     ПреобразованиеXSL  - подготовленный объект.
//
Функция XSLT_СтруктураВАдресЭлектроннойПочты() Экспорт
	Возврат XSLT_СтруктураВСтроковыйСостав("ЭлектроннаяПочта");
КонецФункции

// Преобразует сериализованную структуру в контактную информацию в виде XML.
//
// Возвращаемое значение:
//     ПреобразованиеXSL  - подготовленный объект.
//
Функция XSLT_СтруктураВВебСтраницу() Экспорт
	Возврат XSLT_СтруктураВСтроковыйСостав("ВебСайт");
КонецФункции

// Преобразует сериализованную структуру в контактную информацию в виде XML.
//
Функция XSLT_СтруктураВТелефон() Экспорт
	Возврат XSLT_СтруктураВТелефонФакс("НомерТелефона");
КонецФункции

// Преобразует сериализованную структуру в контактную информацию в виде XML.
//
// Возвращаемое значение:
//     ПреобразованиеXSL  - подготовленный объект.
//
Функция XSLT_СтруктураВФакс() Экспорт
	Возврат XSLT_СтруктураВТелефонФакс("НомерФакса");
КонецФункции

// Преобразует сериализованную структуру в контактную информацию в виде XML.
//
// Возвращаемое значение:
//     ПреобразованиеXSL  - подготовленный объект.
//
Функция XSLT_СтруктураВДругое() Экспорт
	Возврат XSLT_СтруктураВСтроковыйСостав("Прочее");
КонецФункции

// Общее преобразование сериализованной структуры в контактную информацию в виде XML простого типа.
//
// Возвращаемое значение:
//     ПреобразованиеXSL  - подготовленный объект.
//
Функция XSLT_СтруктураВСтроковыйСостав(Знач ИмяXDTOТипа)
	Преобразователь = Новый ПреобразованиеXSL;
	Преобразователь.ЗагрузитьИзСтроки("
		|<xsl:stylesheet version=""1.0"" xmlns:xsl=""http://www.w3.org/1999/XSL/Transform""
		|  xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""
		|  xmlns:tns=""http://v8.1c.ru/8.1/data/core""
		|  xmlns=""http://www.v8.1c.ru/ssl/contactinfo"" 
		|>
		|<xsl:output method=""xml"" omit-xml-declaration=""yes"" indent=""yes"" encoding=""utf-8""/>
		|
		|<xsl:template match=""/"">
		|  
		|  <xsl:element name=""КонтактнаяИнформация"">
		|  
		|  <xsl:attribute name=""Представление"">
		|    <xsl:value-of select=""tns:Structure/tns:Property[@name='Представление']/tns:Value/text()""/>
		|  </xsl:attribute> 
		|  <xsl:element name=""Комментарий"">
		|    <xsl:value-of select=""tns:Structure/tns:Property[@name='Комментарий']/tns:Value/text()""/>
		|  </xsl:element>
		|  
		|  <xsl:element name=""Состав"">
		|    <xsl:attribute name=""xsi:type"">" + ИмяXDTOТипа + "</xsl:attribute>
		|    <xsl:attribute name=""Значение"">
		|    <xsl:choose>
		|      <xsl:when test=""0=count(tns:Structure/tns:Property[@name='Значение'])"">
		|      <xsl:value-of select=""tns:Structure/tns:Property[@name='Представление']/tns:Value/text()""/>
		|      </xsl:when>
		|      <xsl:otherwise>
		|      <xsl:value-of select=""tns:Structure/tns:Property[@name='Значение']/tns:Value/text()""/>
		|      </xsl:otherwise>
		|    </xsl:choose>
		|    </xsl:attribute>
		|    
		|  </xsl:element>
		|  </xsl:element>
		|  
		|</xsl:template>
		|</xsl:stylesheet>
		|");
	Возврат Преобразователь;
КонецФункции

// Общее преобразование для телефона и факса.
//
// Возвращаемое значение:
//     ПреобразованиеXSL  - подготовленный объект.
//
Функция XSLT_СтруктураВТелефонФакс(Знач ИмяXDTOТипа)
	Преобразователь = Новый ПреобразованиеXSL;
	Преобразователь.ЗагрузитьИзСтроки("
		|<xsl:stylesheet version=""1.0"" xmlns:xsl=""http://www.w3.org/1999/XSL/Transform""
		|  xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""
		|  xmlns:tns=""http://v8.1c.ru/8.1/data/core""
		|  xmlns=""http://www.v8.1c.ru/ssl/contactinfo"" 
		|>
		|<xsl:output method=""xml"" omit-xml-declaration=""yes"" indent=""yes"" encoding=""utf-8""/>
		|  <xsl:template match=""/"">
		|
		|    <xsl:element name=""КонтактнаяИнформация"">
		|
		|      <xsl:attribute name=""Представление"">
		|        <xsl:value-of select=""tns:Structure/tns:Property[@name='Представление']/tns:Value/text()""/>
		|      </xsl:attribute> 
		|      <xsl:element name=""Комментарий"">
		|        <xsl:value-of select=""tns:Structure/tns:Property[@name='Комментарий']/tns:Value/text()""/>
		|      </xsl:element>
		|      <xsl:element name=""Состав"">
		|        <xsl:attribute name=""xsi:type"">" + ИмяXDTOТипа + "</xsl:attribute>
		|
		|        <xsl:attribute name=""КодСтраны"">
		|          <xsl:value-of select=""tns:Structure/tns:Property[@name='КодСтраны']/tns:Value/text()""/>
		|        </xsl:attribute> 
		|        <xsl:attribute name=""КодГорода"">
		|          <xsl:value-of select=""tns:Structure/tns:Property[@name='КодГорода']/tns:Value/text()""/>
		|        </xsl:attribute> 
		|        <xsl:attribute name=""Номер"">
		|          <xsl:value-of select=""tns:Structure/tns:Property[@name='НомерТелефона']/tns:Value/text()""/>
		|        </xsl:attribute> 
		|        <xsl:attribute name=""Добавочный"">
		|          <xsl:value-of select=""tns:Structure/tns:Property[@name='Добавочный']/tns:Value/text()""/>
		|        </xsl:attribute> 
		|
		|      </xsl:element>
		|    </xsl:element>
		|
		|  </xsl:template>
		|</xsl:stylesheet>
		|");
	Возврат Преобразователь;
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Библиотечные методы для XSL транформаций. Предназначено для имитации <xsl:include href="..."/>
//

// Фрагмент XSL с процедурами для обработки строк.
//
// Возвращаемое значение:
//     Строка - фрагмент XML для использования в преобразовании.
//
Функция XSLT_ШаблоныСтроковыхФункций()
	Возврат "
		|<!-- string functions -->
		|
		|  <xsl:template name=""str-trim-left"">
		|    <xsl:param name=""str"" />
		|    <xsl:variable name=""head"" select=""substring($str, 1, 1)""/>
		|    <xsl:variable name=""tail"" select=""substring($str, 2)""/>
		|    <xsl:choose>
		|      <xsl:when test=""(string-length($str) > 0) and (string-length(normalize-space($head)) = 0)"">
		|        <xsl:call-template name=""str-trim-left"">
		|          <xsl:with-param name=""str"" select=""$tail""/>
		|        </xsl:call-template>
		|      </xsl:when>
		|      <xsl:otherwise>
		|        <xsl:value-of select=""$str""/>
		|      </xsl:otherwise>
		|    </xsl:choose>
		|  </xsl:template>
		|
		|  <xsl:template name=""str-trim-right"">
		|    <xsl:param name=""str"" />
		|    <xsl:variable name=""head"" select=""substring($str, 1, string-length($str) - 1)""/>
		|    <xsl:variable name=""tail"" select=""substring($str, string-length($str))""/>
		|    <xsl:choose>
		|      <xsl:when test=""(string-length($str) > 0) and (string-length(normalize-space($tail)) = 0)"">
		|        <xsl:call-template name=""str-trim-right"">
		|          <xsl:with-param name=""str"" select=""$head""/>
		|        </xsl:call-template>
		|      </xsl:when>
		|      <xsl:otherwise>
		|        <xsl:value-of select=""$str""/>
		|      </xsl:otherwise>
		|    </xsl:choose>
		|  </xsl:template>
		|
		|  <xsl:template name=""str-trim-all"">
		|    <xsl:param name=""str"" />
		|      <xsl:call-template name=""str-trim-right"">
		|        <xsl:with-param name=""str"">
		|          <xsl:call-template name=""str-trim-left"">
		|            <xsl:with-param name=""str"" select=""$str""/>
		|          </xsl:call-template>
		|      </xsl:with-param>
		|    </xsl:call-template>
		|  </xsl:template>
		|
		|  <xsl:template name=""str-replace-all"">
		|    <xsl:param name=""str"" />
		|    <xsl:param name=""search-for"" />
		|    <xsl:param name=""replace-by"" />
		|    <xsl:choose>
		|      <xsl:when test=""contains($str, $search-for)"">
		|        <xsl:value-of select=""substring-before($str, $search-for)"" />
		|        <xsl:value-of select=""$replace-by"" />
		|        <xsl:call-template name=""str-replace-all"">
		|          <xsl:with-param name=""str"" select=""substring-after($str, $search-for)"" />
		|          <xsl:with-param name=""search-for"" select=""$search-for"" />
		|          <xsl:with-param name=""replace-by"" select=""$replace-by"" />
		|        </xsl:call-template>
		|      </xsl:when>
		|      <xsl:otherwise>
		|        <xsl:value-of select=""$str"" />
		|      </xsl:otherwise>
		|    </xsl:choose>
		|  </xsl:template>
		|
		|  <xsl:param name=""alpha-low"" select=""'абвгдеёжзийклмнопрстуфхцчшщыъьэюяabcdefghijklmnopqrstuvwxyz'"" />
		|  <xsl:param name=""alpha-up""  select=""'АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЫЪЬЭЮЯABCDEFGHIJKLMNOPQRSTUVWXYZ'"" />
		|
		|  <xsl:template name=""str-upper"">
		|    <xsl:param name=""str"" />
		|    <xsl:value-of select=""translate($str, $alpha-low, $alpha-up)""/>
		|  </xsl:template>
		|
		|  <xsl:template name=""str-lower"">
		|    <xsl:param name=""str"" />
		|    <xsl:value-of select=""translate($str, alpha-up, $alpha-low)"" />
		|  </xsl:template>
		|
		|<!-- /string functions -->
		|";
КонецФункции

// Фрагмент XSL с процедурами для работы с xpath.
//
// Возвращаемое значение:
//     Строка - фрагмент XML для использования в преобразовании.
//
Функция XSLT_ШаблоныФункцийXPath()
	Возврат "
		|<!-- path functions -->
		|
		|  <xsl:template name=""build-path"">
		|  <xsl:variable name=""node"" select="".""/>
		|
		|    <xsl:for-each select=""$node | $node/ancestor-or-self::node()[..]"">
		|      <xsl:choose>
		|        <!-- element -->
		|        <xsl:when test=""self::*"">
		|            <xsl:value-of select=""'/'""/>
		|            <xsl:value-of select=""name()""/>
		|            <xsl:variable name=""thisPosition"" select=""count(preceding-sibling::*[name(current()) = name()])""/>
		|            <xsl:variable name=""numFollowing"" select=""count(following-sibling::*[name(current()) = name()])""/>
		|            <xsl:if test=""$thisPosition + $numFollowing > 0"">
		|              <xsl:value-of select=""concat('[', $thisPosition +1, ']')""/>
		|            </xsl:if>
		|        </xsl:when>
		|        <xsl:otherwise>
		|          <!-- not element -->
		|          <xsl:choose>
		|            <!-- attribute -->
		|            <xsl:when test=""count(. | ../@*) = count(../@*)"">
		|                <xsl:value-of select=""'/'""/>
		|                <xsl:value-of select=""concat('@',name())""/>
		|            </xsl:when>
		|            <!-- text- -->
		|            <xsl:when test=""self::text()"">
		|                <xsl:value-of select=""'/'""/>
		|                <xsl:value-of select=""'text()'""/>
		|                <xsl:variable name=""thisPosition"" select=""count(preceding-sibling::text())""/>
		|                <xsl:variable name=""numFollowing"" select=""count(following-sibling::text())""/>
		|                <xsl:if test=""$thisPosition + $numFollowing > 0""> 
		|                  <xsl:value-of select=""concat('[', $thisPosition +1, ']')""/>
		|                </xsl:if>
		|            </xsl:when>
		|            <!-- processing instruction -->
		|            <xsl:when test=""self::processing-instruction()"">
		|                <xsl:value-of select=""'/'""/>
		|                <xsl:value-of select=""'processing-instruction()'""/>
		|                <xsl:variable name=""thisPosition"" select=""count(preceding-sibling::processing-instruction())""/>
		|                <xsl:variable name=""numFollowing"" select=""count(following-sibling::processing-instruction())""/>
		|                <xsl:if test=""$thisPosition + $numFollowing > 0"">
		|                  <xsl:value-of select=""concat('[', $thisPosition +1, ']')""/>
		|                </xsl:if>
		|            </xsl:when>
		|            <!-- comment -->
		|            <xsl:when test=""self::comment()"">
		|                <xsl:value-of select=""'/'""/>
		|                <xsl:value-of select=""'comment()'""/>
		|                <xsl:variable name=""thisPosition"" select=""count(preceding-sibling::comment())""/>
		|                <xsl:variable name=""numFollowing"" select=""count(following-sibling::comment())""/>
		|                <xsl:if test=""$thisPosition + $numFollowing > 0"">
		|                  <xsl:value-of select=""concat('[', $thisPosition +1, ']')""/>
		|                </xsl:if>
		|            </xsl:when>
		|            <!-- namespace -->
		|            <xsl:when test=""count(. | ../namespace::*) = count(../namespace::*)"">
		|              <xsl:variable name=""ap"">'</xsl:variable>
		|              <xsl:value-of select=""'/'""/>
		|                <xsl:value-of select=""concat('namespace::*','[local-name() = ', $ap, local-name(), $ap, ']')""/>
		|            </xsl:when>
		|          </xsl:choose>
		|        </xsl:otherwise>
		|      </xsl:choose>
		|    </xsl:for-each>
		|
		|  </xsl:template>
		|
		|<!-- /path functions -->
		|";
КонецФункции

#КонецОбласти
