
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	НастроитьВидимостьОтметкиСинхронизироватьСGoogle();
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
		
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрОповещения = Новый Структура;
	ПараметрОповещения.Вставить("Календарь", Объект.Ссылка);
	ПараметрОповещения.Вставить("Наименование", Объект.Наименование);
	ПараметрОповещения.Вставить("ВладелецКалендаря", Объект.ВладелецКалендаря);
	
	Оповестить("Запись_КалендарьСотрудника", ПараметрОповещения, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВладелецКалендаряПриИзменении(Элемент)
		
	Объект.Пользователь = ПолучитьПользователяПоСотруднику(Объект.ВладелецКалендаря);
	Объект.Наименование = Строка(Объект.ВладелецКалендаря);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьВидимостьОтметкиСинхронизироватьСGoogle()
	
	Элементы.СинхронизироватьСGoogle.Видимость = РегистрыСведений.СеансовыеДанныеGoogle.ОбластьДоступаGoogleКалендарьВключена();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПользователяПоСотруднику(Сотрудник);
	
	Если ЗначениеЗаполнено(Сотрудник.ИдентификаторПользователяИБ) Тогда	
		Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", 
			Новый УникальныйИдентификатор(Сотрудник.ИдентификаторПользователяИБ));
	Иначе
		Пользователь = Справочники.Пользователи.ПустаяСсылка();	
	КонецЕсли;

	Возврат Пользователь;
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеГуглКалендаря()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Событие.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|	И НЕ Событие.ПометкаУдаления
	|	И Событие.Врач = &Врач
	|	И Событие.Дата > &ТекДата");
	
	Запрос.УстановитьПараметр("Врач", Объект.ВладелецКалендаря);
	Запрос.УстановитьПараметр("ТекДата", НачалоМесяца(ТекущаяДатаСеанса()));
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		СобытиеОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект(); 
 		ОбменСGoogle.ПриЗаписиИсточникаЗаписиКалендаря(СобытиеОбъект);  
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеGoogle(Команда)
	ОбновитьДанныеГуглКалендаря();
КонецПроцедуры

#КонецОбласти
