
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик создания формы
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Касса", ЭтотОбъект.Касса);
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Касса) Тогда
		Элементы.ПодтвердитьЗакрытиеСмены.Доступность = Ложь;
	Иначе
		Организация = ЭтотОбъект.Касса.СтруктурнаяЕдиница.Организация;
	КонецЕсли;
	
	ФормироватьВыемкуИзКассы     = ЭтотОбъект.Касса.АвтСдачаВыемкиПриЗакрытииСмены;
	ФормироватьПоступлениеВыемки = ЭтотОбъект.Касса.ЗавершатьАвтоматическиОперацииВемкиВнесения;
	
	Элементы.ГруппаВыемка.Доступность = ФормироватьВыемкуИзКассы;
	Если ФормироватьВыемкуИзКассы = Истина Тогда
		ЭтотОбъект.СуммаВыемки = ДенежныеСредстваСервер.ПолучитьОстаткоДенежныхСредств(ТекущаяДатаСеанса(), ЭтотОбъект.Касса);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Выполнить закрытие кассовой смены
Процедура ПодтвердитьЗакрытиеСмены(Команда)
	
	// Проверка возможности выполнения выемки
	Если ФормироватьВыемкуИзКассы Тогда
		
		ОстатокВКассе = ДенежныеСредстваСервер.ПолучитьОстаткоДенежныхСредств(ОбщегоНазначенияКлиент.ДатаСеанса(), ЭтотОбъект.Касса);		
		
		Если Не ЭтотОбъект.СуммаВыемки = 0 И ЭтотОбъект.СуммаВыемки > ОстатокВКассе Тогда			
			ПоказатьПредупреждение(, НСтр("ru='Остаток средств в кассе меньше запрошенной выемки!';en='Remainder funds in checkout counter less requested notches!'"));
			Возврат;
		КонецЕсли;
		
		Если ФормироватьПоступлениеВыемки Тогда
			
			Если НЕ ЗначениеЗаполнено(ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ЭтотОбъект.Касса, "КассаДляСдачиВыручки")) Тогда								
				ПоказатьПредупреждение( , НСтр("ru='В операционной кассе не указана касса поступления выручки!';en='In operating checkout counter is not indicated cashbox revenue!'"));
				Возврат;
			КонецЕсли; 
			
			Если НЕ ЗначениеЗаполнено(ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ЭтотОбъект.Касса, "ВыемкаИзКассы")) Тогда
				ПоказатьПредупреждение( , НСтр("ru='В операционной кассе не указан способ выемки выручки!';en='The cashier does not indicate the method of withdrawal of proceeds!'"));
				Возврат;
			КонецЕсли;
			
		КонецЕсли;    
	КонецЕсли;
	
	//1
    // Выполнение сверки итогов на эквайринговом терминале
	Если ВыполнитьСверкуИтоговНаЭквайринге(ЭтотОбъект.Касса) = Истина Тогда
		МенеджерОборудованияКлиент.ВыполнитьСверкуИтоговЭквайринг(ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ЭтотОбъект.Касса,"ЭквайринговыйТерминал"), ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;	
	
	// 2. Формируем документы кассовой смены.
	ОписаниеОшибки = "";
	РозничныеПродажи.ЗакрытьКассовуюСмену(ЭтотОбъект.Касса, ОписаниеОшибки);		
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		
		ТекстСообщения = НСтр("ru='При закрытии смены произошла ошибка."
		"""%ОписаниеОшибки%"""
		"Отчет на фискальном регистраторе не сформирован.';en='With closing shifts happened mistake."
		"%ОписаниеОшибки%"""
		"Report on the fiscal registrar not formed.'");
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
		
	КонецЕсли;	
	
	// 2. Формирование выемки из кассы. 
	Если ФормироватьВыемкуИзКассы И ЭтотОбъект.СуммаВыемки > 0 Тогда
	     Инкассация();
	КонецЕсли;

	// 3. Закрываем смену на ФР.	
	ИдентификаторУстройства = МенеджерОборудованияВызовСервера.ПолучитьИдентификаторФискальногоРегистратораДляКассы(ЭтотОбъект.Касса);		
	Если ЗначениеЗаполнено(ИдентификаторУстройства) Тогда		
		
		ПараметрыОперации = Новый Структура("Организация, Касса", ЭтотОбъект.Организация, ЭтотОбъект.Касса);
		
		Оповещение = Новый ОписаниеОповещения("ПечатьФискальногоОтчетаЗавершение", ЭтотОбъект);
		МенеджерОборудованияКлиент.НачатьЗакрытиеСменыНаФискальномУстройстве(Оповещение, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройства);
		
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
// Процедура, закрытие кассовой смены завршение.
//
Процедура ПечатьФискальногоОтчетаЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Оповестить("ОбновитьФормуУправленияКассовойСменой");
	
	Если РезультатВыполнения.Результат Тогда		
		
		//  в случае успеха списываем материалы
		ТекущаяКассоваяСмена = РозничныеПродажи.ПолучитьСостояниеКассовойСмены(ЭтотОбъект.Касса);
		
		Если ТекущаяКассоваяСмена <> Неопределено Тогда      		
			ОписаниеОшибки = "";
			РозничныеПродажи.СформироватьСписаниеМатериалов(ТекущаяКассоваяСмена.КассоваяСмена, ОписаниеОшибки);  
			
			Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				ТекстСообщения = СтрШаблон("Ошибка при формировании списания материалов. Дополнительное описание: %1", ОписаниеОшибки);
				ПоказатьПредупреждение(, ТекстСообщения);
			КонецЕсли;
			
		КонецЕсли;		
		
		Если НЕ (ФормироватьВыемкуИзКассы И ЭтотОбъект.СуммаВыемки > 0) Тогда
		    ЭтаФорма.Закрыть(Истина);
		КонецЕсли;	
		
	Иначе
	
		ТекстСообщения = НСтр("ru='При закрытии смены на фискальном регистраторе произошла ошибка."
		"""%ОписаниеОшибки%"""
		"Отчет на фискальном регистраторе не сформирован.';en='With closing shifts on the fiscal registrar happened mistake."
		"""%ОписаниеОшибки%"""
		"Report on the fiscal registrar not formed.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);		
		
	КонецЕсли;
	
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения выемки из кассы.
//
Процедура ИнкассацияНаФискальномУстройствеЗавершение(РезультатВыполнения, Параметры) Экспорт
		
	Если РезультатВыполнения.Результат Тогда		
		
		// Если чек пробился, то возвращаем номер чека ккм в документ (по умолчанию 88888888).
		НомерЧека = 88888888;
		РозничныеПродажи.ЗаписатьНомерЧекаВДокумент(РезультатВыполнения.Документ, НомерЧека);		
		ЭтаФорма.Закрыть(Истина);                                                                                		
		
	Иначе
		
		ТекстСообщения = НСтр("ru='При выполнении операции выимке денег произошла ошибка."
		"Чек не напечатан на фискальном устройстве."
		"Дополнительное описание: %ДополнительноеОписание%';en='With the execution of operations the deduction of money money happened mistake."
		"Check not printedby on fiscal device."
		"Additional description: %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);		
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Отмена операции
Процедура Отмена(Команда)
	
	ЭтаФорма.Закрыть(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция - Выполнить сверку итогов на эквайринге
// 
// Возвращаемое значение:
//   - 
//
Функция ВыполнитьСверкуИтоговНаЭквайринге(Касса)	
		
	Если ЗначениеЗаполнено(Касса.ЭквайринговыйТерминал)
		И ЗначениеЗаполнено(Касса.ЭквайринговыйТерминал.ПодключаемоеОборудование)
		И  Касса.ЭквайринговыйТерминал.ИспользоватьБезПодключенияОборудования = Ложь Тогда
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Процедура - Инкассация
//
&НаКлиенте
Процедура Инкассация()   
	
	ОписаниеОшибки  = Неопределено;                  
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Касса", ЭтотОбъект.Касса);
	СтруктураДанных.Вставить("СуммаДокумента", ЭтотОбъект.СуммаВыемки);
	
	РезультатВыемки = РозничныеПродажи.СформироватьВыемкуИзКассы(СтруктураДанных, ОписаниеОшибки);
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ТекстСообщения = НСтр("ru = 'При выемке денег произошла ошибка.										
		|Дополнительное описание: %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		ДокументВыемки = РезультатВыемки.ДокВыемки;				
		
		Если ЗначениеЗаполнено(ДокументВыемки) Тогда	
			
			// 2. Выполняем команду выемки на ФР
			ИдентификаторУстройстваФР = МенеджерОборудованияВызовСервера.ПолучитьИдентификаторФискальногоРегистратораДляКассы(ЭтотОбъект.Касса);
			ПараметрыОперации = Новый Структура("ТипИнкассации, Сумма, Документ, Организация, Касса", 0, ЭтотОбъект.СуммаВыемки, ДокументВыемки, ЭтотОбъект.Организация, ЭтотОбъект.Касса);
			ОповещениеПриЗавершении = Новый ОписаниеОповещения("ИнкассацияНаФискальномУстройствеЗавершение", ЭтотОбъект);
			
			МенеджерОборудованияКлиент.НачатьИнкассациюНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройстваФР);				
			
		КонецЕсли;								
	КонецЕсли;						
	
КонецПроцедуры

#КонецОбласти
