
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Ключ.СтруктурнаяЕдиница) Тогда
		Запись.СтруктурнаяЕдиница = Параметры.Ключ.СтруктурнаяЕдиница;
	ИначеЕсли Параметры.Свойство("СтруктурнаяЕдиница") Тогда
		Запись.СтруктурнаяЕдиница = Параметры.СтруктурнаяЕдиница;
	Иначе
		Запись.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	Если Параметры.ЗначенияЗаполнения.Свойство("СтруктурнаяЕдиница") 
	 И Параметры.ЗначенияЗаполнения.Свойство("Склад") 
	 И Параметры.ЗначенияЗаполнения.Свойство("Номенклатура") Тогда
		Запись.СтруктурнаяЕдиница = Параметры.ЗначенияЗаполнения.СтруктурнаяЕдиница;
		Запись.Склад = Параметры.ЗначенияЗаполнения.Склад;
		Запись.Номенклатура = Параметры.ЗначенияЗаполнения.Номенклатура;
		Если Параметры.ЗначенияЗаполнения.Свойство("Партия") Тогда
			Запись.Партия = Параметры.ЗначенияЗаполнения.Партия;
		КонецЕсли;
		ЭтаФорма.Элементы.Номенклатура.Видимость = Истина;
	КонецЕсли;
	Если Параметры.Свойство("Номенклатура") И Параметры.Свойство("Склад") Тогда
		Запись.Номенклатура = Параметры.Номенклатура;
		Если Параметры.Свойство("Партия") Тогда
			Запись.Партия = Параметры.Партия;
		КонецЕсли;
		ЭтаФорма.Элементы.Номенклатура.Видимость = Истина;
		Запись.Склад = Параметры.Склад;
	КонецЕсли;
	Если (ЗначениеЗаполнено(Параметры.Ключ.Номенклатура) И ЗначениеЗаполнено(Параметры.Ключ.Склад)) ИЛИ Параметры.Свойство("УстановкаКритОстатков")
	 ИЛИ Параметры.Свойство("ДобавлениеНового") Тогда
		ЭтаФорма.Элементы.Номенклатура.Видимость = Истина;
	КонецЕсли;
	Если Параметры.Свойство("СпрНоменклатура") Тогда
		Запись.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
		Запись.Номенклатура = Параметры.СпрНоменклатура;
		ЭтаФорма.Элементы.Номенклатура.Видимость = Истина;
	КонецЕсли;

	Если НЕ Параметры.Ключ.Номенклатура.Пустая() И НЕ Параметры.Ключ.Склад.Пустая() Тогда
		ПризнакКомандаИзменить = Истина;
	КонецЕсли;
	
	Если Не ПроверитьГруппу(Запись.Номенклатура) Тогда	
		Если Запись.Номенклатура.ИспользоватьПартии Тогда
			Элементы.Партия.Видимость = Истина;
		КонецЕсли;
	Иначе 
		Запись.Номенклатура = Неопределено;
		Модифицированность = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='В номенклатуре была указана группа. Пожалуйста, укажите единицу номенклатуры';en='The group was indicated in the nomenclature. Please indicate unit of nomenclature'"));
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПередЗаписьюНаСервере".
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КритическиеОстатки.Номенклатура,
	                      |	КритическиеОстатки.Склад
	                      |ИЗ
	                      |	РегистрСведений.КритическиеОстатки КАК КритическиеОстатки
	                      |ГДЕ
	                      |	КритическиеОстатки.Номенклатура = &Номенклатура
	                      |	И КритическиеОстатки.Склад = &Склад
	                      |	И КритическиеОстатки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                      |	И КритическиеОстатки.Партия = &Партия");
	
	Запрос.УстановитьПараметр("Номенклатура"      	, ТекущийОбъект.Номенклатура);
	Запрос.УстановитьПараметр("Партия"				, ТекущийОбъект.Партия);
	Запрос.УстановитьПараметр("Склад"             	, ТекущийОбъект.Склад);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, ТекущийОбъект.СтруктурнаяЕдиница);
	
	Если НЕ Запрос.Выполнить().Пустой() и НЕ ПризнакКомандаИзменить Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Для данного склада критический остаток по выбранной номенклатуре уже существует.';en='For this warehouse critical the remainder for the selected nomenclature already exists.'"));
	КонецЕсли;
	
	Если ТипЗнч(Запись.Склад) = Тип("СправочникСсылка.Сотрудники") Тогда
		ЗапросСотрудник = Новый Запрос;
		ЗапросСотрудник.Текст = "ВЫБРАТЬ
		                        |	Сотрудники.Ссылка КАК Сотрудник
		                        |ИЗ
		                        |	Справочник.Сотрудники КАК Сотрудники
		                        |ГДЕ
		                        |	Сотрудники.МестаРаботы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		                        |	И Сотрудники.Ссылка = &Сотрудник";
		ЗапросСотрудник.УстановитьПараметр("СтруктурнаяЕдиница",Запись.СтруктурнаяЕдиница);
		ЗапросСотрудник.УстановитьПараметр("Сотрудник",Запись.Склад);
		Результат = ЗапросСотрудник.Выполнить().Выгрузить();
		
		Если Результат.Количество() = 0 Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выбранный сотрудник не работает в данной структурной единице.';en='Selected employee does not work in this structural unit.'"));
		КонецЕсли;
	КонецЕсли;
	
	ЭтаФорма.Прочитать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "Создание" поля "Упаковка".
//
Процедура УпаковкаСоздание(Элемент, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Номенклатура не заполнена';en='Nomenclature is not filled'"));		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Создание списка значений для быстрого выбора упаковки номенклатуры.
//
Процедура УпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// вставка параметра для отбора упаковок по номенклатуре
	Номенклатура = Новый Структура;
	Номенклатура.Вставить("Номенклатура", Запись.Номенклатура);
	// процедура формирования списка
	ОбработкаТабличныхЧастейКлиент.ВыбратьУпаковкуНоменклатуры(ДанныеВыбора, СтандартнаяОбработка, Номенклатура);
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора" поля "Номенклатура".
//
Процедура НоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Параметр = Новый Структура("ЭтоЗапас", Истина);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора", Параметр,,,,, Новый ОписаниеОповещения("НоменклатураНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора" поля "Партия".
//
Процедура ПартияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		
		ПараметрыВыбора = Новый Структура;	
		ПараметрыВыбора.Вставить("Номенклатура"      , Запись.Номенклатура);
		ПараметрыВыбора.Вставить("Склад"             , Запись.Склад);
		ПараметрыВыбора.Вставить("СтруктурнаяЕдиница", Запись.СтруктурнаяЕдиница);
		ПараметрыВыбора.Вставить("Дата"              , ТекущаяДата());
		ПараметрыВыбора.Вставить("МножественныйВыбор", Ложь);
		ПараметрыВыбора.Вставить("ОтборРежимОтбора"  , 2);
		
		ОткрытьФорму("Справочник.ПартииНоменклатуры.ФормаВыбора", ПараметрыВыбора,,,,, Новый ОписаниеОповещения("ПартияНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);		
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды "ЗаписатьИЗакрыть".
//
Процедура ЗаписатьИЗакрыть(Команда)
	
	ФормаЗаписана = Истина;
	ЭтаФорма.Записать();
	ЭтаФорма.Закрыть(Новый Структура("ФормаЗаписана", ЭтотОбъект.ФормаЗаписана));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Скрыть показать дополнительно
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СкрытьПоказатьДополнительно(Команда)
	
	Элементы.ГруппаДополнительно.Видимость = НЕ Элементы.ГруппаДополнительно.Видимость;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НоменклатураНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ВыбранныйЭлемент = Результат;
	
	Если ЗначениеЗаполнено(ВыбранныйЭлемент) И НЕ ПроверитьГруппу(ВыбранныйЭлемент) Тогда
		Запись.Номенклатура = ВыбранныйЭлемент;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПартияНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено и Результат.Количество() <> 0 Тогда
		Запись.Партия = Результат[0];
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
// Функция, обработчик события "ПроверитьГруппу".
//
Функция ПроверитьГруппу(Ссылка)
	
	Возврат Ссылка.ЭтоГруппа;	
	
КонецФункции


#КонецОбласти
