
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборСтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница, ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница));
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборСтруктурнаяЕдиницаПриИзменении(Элемент)
	
	//ЭлементОтбора = Неопределено;
	//Для Каждого ЭлементСпискаОтбора Из Список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
	//	Если ЭлементСпискаОтбора.Представление = "ОтборСтруктурнаяЕдиница" Тогда
	//		ЭлементОтбора = ЭлементСпискаОтбора;
	//	КонецЕсли;
	//КонецЦикла;
	//ЭлементОтбора.ПравоеЗначение = ОтборСтруктурнаяЕдиница;
	//ЭлементОтбора.Использование = ?(ОтборСтруктурнаяЕдиница.Пустая(), Ложь, Истина);	
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница, ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница));
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура - Установить условное оформление.
//
Процедура УстановитьУсловноеОформление()

	Список.УсловноеОформление.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда
		ЭлементУФ = Список.УсловноеОформление.Элементы.Добавить();
		
		ЭлементУФ.Оформление.УстановитьЗначениеПараметра("Видимость" , Ложь);
		ЭлементУФ.Оформление.УстановитьЗначениеПараметра("Отображать" , Ложь);
		ЭлементУФ.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
		
		ЭлементОтбора                = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СтруктурнаяЕдиница");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.ПравоеЗначение = ОтборСтруктурнаяЕдиница; 
		ЭлементОтбора.Использование  = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

