
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	ДвоичныеДанныеОбработки = РеквизитФормыВЗначение("Объект").ХранилищеОбработки.Получить();
	
	ЗаполнитьИнформациюПоСервису(Объект.Ссылка.Пустая());
	
	СтранаУчета = Константы.СтранаУчета.Получить();
	Если ЗначениеЗаполнено(СтранаУчета) Тогда
		КодСтраны = СтранаУчета.Код;
		Если КодСтраны = "398" Тогда   // сервис рассылки только для Казахстана
			Элементы.SMSСервис.СписокВыбора.Добавить(Перечисления.СервисыSMSРассылки.SMSC_KZ);
		КонецЕсли;
	КонецЕсли;

	ПолучитьБалансПоСервису();
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры	
	
// Процедура - При записи на сервере
//
// Параметры:
//  Отказ			 - 	 - 
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
КонецПроцедуры

// Процедура - При чтении на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
КонецПроцедуры

&НаКлиенте
// Процедура - При открытии
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриОткрытии(Отказ)
	
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("ПодключениеРаботыСФайлами", ЭтотОбъект));
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
// Процедура - обработчик события ПередЗаписьюНаСервере формы.
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ДвоичныеДанныеОбработки <> Неопределено Тогда
		ТекущийОбъект.ХранилищеОбработки = Новый ХранилищеЗначения(ДвоичныеДанныеОбработки , Новый СжатиеДанных(9));
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы.
//
Процедура УстановитьВидимостьДоступность()
	
	Элементы.КомандаСохранитьОбработку.Доступность = Объект.SMSСервис.Пустая();
	
	Если НЕ (Объект.ПодписьОдобрена
		И ЗначениеЗаполнено(Объект.Подпись))
		И СервисSMSрассылкиОбслуживается(Объект.Ссылка) Тогда
		
		ОбновитьИнформациюОМодерацииПодписиСервисаСМС();
	КонецЕсли;
	Элементы.Подпись.Ширина 					= ?(Объект.ПодписьОдобрена, 38, 41);
	Элементы.Версия.Видимость                   = Истина;
	Элементы.ГруппаРегистрацииПодписи.Видимость = Истина; 	
	Элементы.Информация.МаксимальнаяВысота      = 5; 
	Элементы.ДекорацияПодписьОдобрена.Видимость = Объект.ПодписьОдобрена;
	Элементы.ДекорацияЗаглушка.Видимость        = Ложь;
	Элементы.Регистрация.Видимость              = Ложь;
	Элементы.СсылкаНаСайт.Видимость             = Истина;

	Элементы.ГруппаРегистрацииПодписи.Видимость = (Объект.SMSСервис = Перечисления.СервисыSMSРассылки.HelixSMS);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события элемента формы "СсылкаНаСайт"
//
Процедура СсылкаНаСайтНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПослеЗапускаПриложения", ЭтотОбъект);
	НачатьЗапускПриложения(Оповещение, СсылкаНаСайт);
	
КонецПроцедуры

&НаКлиенте
// Процедура - SMSСервис при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура SMSСервисПриИзменении(Элемент)
	
	Если Объект.SMSСервис.Пустая() И ДвоичныеДанныеОбработки = Неопределено Тогда
		ЗагрузитьОбработку(Неопределено);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьИнформациюПоСервису(Истина);
	ПолучитьБалансПоСервису();
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	ЗаполнитьИнформациюПоСервису(Истина);
	ПолучитьБалансПоСервису();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка события ОбработкаНавигационнойСсылки
//
Процедура ДекорацияРегистрацииПодписиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СервисSMS", Объект.Ссылка);
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПовторитьПопытку" Тогда
		СтруктураПараметров.Вставить("НеСоздаватьНовуюПодпись", Истина);
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ЛичныйКабинет.Форма.ФормаПолученияПодписиСервисаСМС", СтруктураПараметров);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды "ЗагрузитьОбработку"
//
Процедура ЗагрузитьОбработку(Команда)
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.Фильтр = "Внешние обработки|*.epf";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите файл'");
	
	ПомещаемыеФайлы = Новый Массив;
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьОбработкуПослеВыбораПути", ЭтотОбъект);
	НачатьПомещениеФайлов(Оповещение, ПомещаемыеФайлы, ДиалогОткрытияФайла, Истина);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СохранитьОбработку"
//
Процедура СохранитьОбработку(Команда)
	
	Если ЗначениеЗаполнено(Объект.SMSСервис) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Встроенный сервис не может быть сохранен в обработку!");
		Возврат;
	КонецЕсли;
		
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогОткрытияФайла.Фильтр = "Внешние обработки|*.epf";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите файл'");
	ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.ИмяОбработки;
	
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("СохранитьОбработкуПослеВыбораПути", ЭтотОбъект, Новый Структура("ДиалогОткрытияФайла", ДиалогОткрытияФайла)));
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ОбновитьБаланс"
//
Процедура ОбновитьБаланс(Команда)
	
	ПолучитьБалансПоСервису();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Пополнить баланс
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПополнитьБаланс(Команда)
	
	ОткрытьФорму("Справочник.СервисыРассылки.Форма.ФормаЗапросаПополненияБалансаСмсСервиса",,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, считывает и заполняет информацию о обработке
//
Процедура ЗаполнитьИнформациюПоСервису(ИзменитьНаименование = Ложь)
	
	ОбъектДокумент = РеквизитФормыВЗначение("Объект");
	ОбъектДокумент.ХранилищеОбработки = Новый ХранилищеЗначения(ДвоичныеДанныеОбработки);

	РегистрационныеДанные 		= Справочники.СервисыРассылки.СведенияОСервисеSMS(ОбъектДокумент);
	Если РегистрационныеДанные.Наименование = "Ошибка" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РегистрационныеДанные.Информация);
		Возврат;
	КонецЕсли;
	
	Версия						= РегистрационныеДанные.Версия;
	Информация					= РегистрационныеДанные.Информация;
	СсылкаНаСайт				= РегистрационныеДанные.СсылкаНаСайт;
	СсылкаНаСайтПредставление	= РегистрационныеДанные.СсылкаНаСайтПредставление;
	Если ИзменитьНаименование = Истина Тогда
		Объект.ИмяОбработки = Строка(РегистрационныеДанные.Наименование);
		Объект.Наименование = Объект.ИмяОбработки + ", логин - " + ?(ЗначениеЗаполнено(Объект.Пользователь), Объект.Пользователь, "(не указано)");
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
// Процедура, считывает и заполняет информацию о обработке
//
Процедура ПолучитьБалансПоСервису()
	
	Если ЗначениеЗаполнено(Объект.Пользователь) И ЗначениеЗаполнено(Объект.Пароль)
			И (Объект.SMSСервис.Пустая() = Ложь ИЛИ Объект.SMSСервис.Пустая() = Истина И ДвоичныеДанныеОбработки <> Неопределено) Тогда
	
		ОбъектДокумент = РеквизитФормыВЗначение("Объект");
		ОбъектДокумент.ХранилищеОбработки = Новый ХранилищеЗначения(ДвоичныеДанныеОбработки);

		Результат = Справочники.СервисыРассылки.ПолучитьБалансАккаунтаSMS(ОбъектДокумент);
		БалансSMS = "Баланс: " + ?(Результат.Ошибка <> Истина, Строка(Результат.Баланс) + " " + НРег(Результат.Валюта), Результат.ОписаниеОшибки);
		
		Элементы.ПополнитьБаланс.Доступность = (Результат.Ошибка <> Истина);
	Иначе
		БалансSMS = "Баланс: " + "Недоступно";
		Элементы.ПополнитьБаланс.Доступность = Ложь;		
	КонецЕсли;
	
	Элементы.БалансSMS.Подсказка = БалансSMS;
	
КонецПроцедуры

&НаСервере
// Процедура, сохраняет файл в хранилище значения по пути к файлу
//
Процедура СохранитьОбработкуНаСервере(ПолноеИмяФайла)
	
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбработкаСервиса = ОбъектЗначение.ХранилищеОбработки.Получить();
	Если ОбработкаСервиса = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обработка пустая и не может быть сохранена!");
		Возврат;
	КонецЕсли;
	
	ОбработкаСервиса.Записать(ПолноеИмяФайла);
	
КонецПроцедуры

&НаСервере
// Функция - Сервисы SMSрассылки обслуживается
// 
// Возвращаемое значение:
//   - 
//
Функция СервисSMSрассылкиОбслуживается(СервисSMSрассылки)
	
	УидСессии 			 = ЛичныйКабинет.УидТекущейСессии();
	РегистрационныйНомер = ЛичныйКабинет.ПолучитьРегистрационныйНомерПродукта();
	
	Если НЕ ЗначениеЗаполнено(СервисSMSрассылки)
		ИЛИ СервисSMSрассылки.ПометкаУдаления
		ИЛИ НЕ ЗначениеЗаполнено(УидСессии)
		ИЛИ НЕ ЗначениеЗаполнено(РегистрационныйНомер) Тогда
		
		Возврат Ложь;
		
	Иначе
		
		ТекущаяРегистрацияПродукта = ЛичныйКабинет.ДанныеПоСостояниюАнкетыПродукта(РегистрационныйНомер);
		// Если регистрация не подтверждена
		Если ТекущаяРегистрацияПродукта.ВыполненоуСпешно <> Истина
			ИЛИ ТекущаяРегистрацияПродукта.СтатусРегистрацииКод <> 304 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = ЛичныйКабинет.ПолучитьДоговорыПользователя(УидСессии);
	
	Если Результат.ВыполненоУспешно <> Истина Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МассивСтруктурДоговоров = Результат.ПараметрыРезультата.contracts;
	
	Для Каждого СтруктураМассива Из МассивСтруктурДоговоров Цикл
		
		Если СтруктураМассива.login = СервисSMSрассылки.Пользователь Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
// Процедура - Обновить информацию о модерации подписи сервиса СМС
//
Процедура ОбновитьИнформациюОМодерацииПодписиСервисаСМС()
	
	ЭтотОбъект.ОбновитьИнформациюОМодерацииПодписи = Справочники.СервисыРассылки.ОбновитьИнформациюОМодерацииПодписиСервисаСМС(Объект.Ссылка, ЭтаФорма);
	
КонецПроцедуры

#Область ОбработчикиОповещенийАсинхронныхСобытий

&НаКлиенте
// Процедура - Загрузить обработку завершение 2
// Завершение помещения файлов
// Параметры:
//  ПомещенныеФайлы			 - 	 Помещенные файлы
//  ДополнительныеПараметры	 - 	 Параметры оповещения 
//
Процедура ЗагрузитьОбработкуПослеВыбораПути(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
		
	Если ПомещенныеФайлы <> Неопределено и ПомещенныеФайлы.Количество() <> 0 Тогда
		
		ДвоичныеДанныеОбработки = ПолучитьИзВременногоХранилища(ПомещенныеФайлы[0].Хранение);
		ЗаполнитьИнформациюПоСервису(Истина);
		ПолучитьБалансПоСервису();
		
		УстановитьВидимостьДоступность();
		Модифицированность = Истина;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Сохранить обработку завершение
// Завершение Диалога открытия файла
// Параметры:
//  ВыбранныеФайлы			 - 	 Выбранные файлы 
//  ДополнительныеПараметры	 - 	 Параметры Оповещения
//
Процедура СохранитьОбработкуПослеВыбораПути(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогОткрытияФайла = ДополнительныеПараметры.ДиалогОткрытияФайла;
	
	Если (ВыбранныеФайлы <> Неопределено) = Истина Тогда
		СохранитьОбработкуНаСервере(ДиалогОткрытияФайла.ПолноеИмяФайла);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура заглушка, т.к. НачатьЗапускПриложения требуется наличие обработчика оповещения.
Процедура ПослеЗапускаПриложения(ВыбранныйЭлемент, Параметры) Экспорт
	
	Заглушка = 0;   // для прохождения сертификации
	
КонецПроцедуры

&НаКлиенте
// Процедура заглушка, т.к. НачатьЗапускПриложения требуется наличие обработчика оповещения.
Процедура ПодключениеРаботыСФайлами(Подключено, Параметры) Экспорт

	Заглушка = 0; 	// для прохождения сертификации
	
КонецПроцедуры

// Процедура - Пароль при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	
	ПолучитьБалансПоСервису();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти


