#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимРаботы = Новый ФиксированнаяСтруктура(ОбщегоНазначенияПовтИсп.РежимРаботыПрограммы());

	Элементы.ВыгрузитьДанныеДляПереходаВСервис.Видимость = РежимРаботы.ЭтоАдминистраторСистемы И РежимРаботы.Локальный;
	Элементы.ЗагрузитьДанныеИзСервиса.Видимость = РежимРаботы.ЭтоАдминистраторСистемы И РежимРаботы.Локальный;
	Элементы.ВыгрузитьДанныеВЛокальнуюВерсию.Видимость = РежимРаботы.ЭтоАдминистраторПрограммы И РежимРаботы.МодельСервиса;
	Элементы.АвтономнаяРабота.Видимость = РежимРаботы.МодельСервиса;
	Элементы.АвтономнаяРабота_Локально.Видимость = РежимРаботы.Автономный;	
	
КонецПроцедуры

#КонецОбласти