
#Область СлужебныеПроцедурыИФункции 

// Функция - Добавить обновить запись о форме
//
// Параметры:
//  Сотрудник			 - СправочникСсылка.Сотрудники - Сотрудник, который открыл или закрыл форму
//  НаименованиеФормы	 - Строка	 - Наименование формы, с которой работают (Например: РабочийКалендарь.ФормаПредварительнойЗаписи)
//  ДатаОткрытия		 - ДатаВремя - Время открытия или закрытия формы
// 
// Возвращаемое значение:
//   - 
//
Функция ДобавитьОбновитьЗаписьОФорме(Сотрудник, ИмяФормы, ДатаОткрытия = Неопределено, ОткрытиеФормы = Ложь) Экспорт

	НаборЗаписей = РегистрыСведений.ОткрытыеФормы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сотрудник.Значение	   = Сотрудник;
	НаборЗаписей.Отбор.Сотрудник.Использование = Истина;
	НаборЗаписей.Отбор.ИмяФормы.Значение 	   = ИмяФормы;
	НаборЗаписей.Отбор.ИмяФормы.Использование  = Истина;
	
	НаборЗаписей.Прочитать();
	
	Запись = Неопределено;
	Если НаборЗаписей.Количество() > 0 Тогда
		Запись = НаборЗаписей[0];
	ИначеЕсли НаборЗаписей.Количество() = 0 И ОткрытиеФормы = Истина Тогда 
		Запись = НаборЗаписей.Добавить();
	КонецЕсли;
	
	Если Запись <> Неопределено Тогда
		
		Если ОткрытиеФормы = Истина Тогда
			
			Запись.Сотрудник 		 = Сотрудник;
			Запись.ИмяФормы 		 = ИмяФормы;
			Запись.ДатаОткрытия 	 = ?(ЗначениеЗаполнено(ДатаОткрытия), ДатаОткрытия, ТекущаяДатаСеанса()); 
					
		ИначеЕсли ОткрытиеФормы = Ложь Тогда 
			
			НаборЗаписей.Удалить(Запись);
			
		КонецЕсли;
		
		НаборЗаписей.Записать(Истина);

	КонецЕсли;
	
КонецФункции     

#КонецОбласти