

#Область СлужебныйПрограммныйИнтерфейс

// Процедура, логирует http запросы.
//
Процедура ЛогироватьЗапрос(
		HTTPЗапрос,
		ДатаЛога,
		UIDЗапроса,
		Тип,   						   
		HTTPШаблон,						   
		Статус = Неопределено,
		ВремяВыполнения = Неопределено,
		ВнешнееПриложение = Неопределено,
		ApiKey = Неопределено,						   
		ОтветJSON = Неопределено,
		КодСостояния = Неопределено,
		UserToken = Неопределено,
		КодОтвета = Неопределено,
		НомерЭвотор = Неопределено,
		Исходящий = Ложь,
		Объект = Неопределено) Экспорт
		
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("Заголовки"       , HTTPЗапрос.Заголовки);
	Если Исходящий = Ложь Тогда
		ДанныеЗапроса.Вставить("ПараметрыURL"    , HTTPЗапрос.ПараметрыURL);
		ДанныеЗапроса.Вставить("ПараметрыЗапроса", HTTPЗапрос.ПараметрыЗапроса);
	Иначе
		ДанныеЗапроса.Вставить("АдресРесурса"    , HTTPЗапрос.АдресРесурса);
	КонецЕсли;
	
	ДанныеЗапроса.Вставить("ТелоЗапроса"     , HTTPЗапрос.ПолучитьТелоКакСтроку());
	ДанныеЗапроса.Вставить("ОтветJSON"       , ОтветJSON);
	
	МенеджерЗаписи                  = РегистрыСведений.ЖурналЗапросов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период           = ДатаЛога;
	МенеджерЗаписи.UIDЗапроса       = UIDЗапроса;
	МенеджерЗаписи.Статус           = Статус;
	МенеджерЗаписи.Тип              = Тип;
	МенеджерЗаписи.ApiKey           = ApiKey;
	МенеджерЗаписи.ВнешнееПриложение= ВнешнееПриложение;
	Если Исходящий = Ложь Тогда
		МенеджерЗаписи.БазовыйURL       = HTTPЗапрос.БазовыйURL;	
		МенеджерЗаписи.ОтносительныйURL = HTTPЗапрос.ОтносительныйURL;	
		МенеджерЗаписи.HTTPМетод        = HTTPЗапрос.HTTPМетод;
	Иначе
		МенеджерЗаписи.БазовыйURL       = HTTPЗапрос.АдресРесурса;	
	КонецЕсли;

	МенеджерЗаписи.HTTPШаблон       = HTTPШаблон;	
	МенеджерЗаписи.ВремяВыполнения  = ВремяВыполнения;	
	МенеджерЗаписи.ПараметрыЗапроса = Новый ХранилищеЗначения(ДанныеЗапроса);		
	МенеджерЗаписи.КодСостояния     = КодСостояния;
	МенеджерЗаписи.UserToken        = UserToken;
	МенеджерЗаписи.КодОтвета        = КодОтвета;
	МенеджерЗаписи.НомерЭвотор      = НомерЭвотор;
	МенеджерЗаписи.Исходящий        = Исходящий;
	Если Объект <> Неопределено Тогда
		МенеджерЗаписи.Объект = Объект;
	КонецЕсли;
	
	МенеджерЗаписи.Записать(Истина); 
	
КонецПроцедуры

#КонецОбласти