
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Создать входящую заявку.
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьВходящуюЗаявку(
	communication_id  		 	= Неопределено,
	communication_type		 	= Неопределено,
	ДатаЗаявки        		 	= Неопределено, 
	Фамилия           		 	= Неопределено,
	Имя               		 	= Неопределено, 
	Отчество          		 	= Неопределено, 
	НомерТелефона     		 	= Неопределено, 
	АдресЭП           		 	= Неопределено, 
	РекламныйИсточник 		 	= Неопределено,
	РекламнаяПлощадка 		 	= Неопределено, 
	РекламнаяСсылка   		 	= Неопределено, 
	Комментарий       		 	= Неопределено, 
	ПараметрыUTM      		 	= Неопределено,
	ВнешняяСистема    			= Неопределено,
	ОписаниеОшибки    			= "",
	ОсновнойКлиент    			= Неопределено,
	СтруктурнаяЕдиница			= Неопределено,
	КлиентИзВиджетаЛК 			= Неопределено,
	ДополнительныеПараметры		= Неопределено,
	КонтактнаяИнформацияСоцСеть = Неопределено,
	НаименованиеЗаявки          = Неопределено,
	КаналПривлеченияЗначение	= Неопределено,
	Статус						= Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	СтруктурЗаполнения = Новый Структура;
	СтруктурЗаполнения.Вставить("ДатаСоздания"      			, ?(ЗначениеЗаполнено(ДатаЗаявки), ДатаЗаявки, ТекущаяДатаСеанса()));	
	СтруктурЗаполнения.Вставить("Фамилия"           			, Фамилия);	
	СтруктурЗаполнения.Вставить("Имя"               			, Имя);	
	СтруктурЗаполнения.Вставить("Отчество"          			, Отчество);	
	СтруктурЗаполнения.Вставить("НомерТелефона"    				, НомерТелефона);
	СтруктурЗаполнения.Вставить("АдресЭП"           			, АдресЭП);	
	СтруктурЗаполнения.Вставить("РекламныйИсточник" 			, РекламныйИсточник);
	СтруктурЗаполнения.Вставить("РекламнаяПлощадка"	 			, РекламнаяПлощадка);// КаналПривлечения
	СтруктурЗаполнения.Вставить("РекламнаяСсылка"   			, РекламнаяСсылка);	
	СтруктурЗаполнения.Вставить("Комментарий"       			, Комментарий);	
	СтруктурЗаполнения.Вставить("ПараметрыUTM"      			, ПараметрыUTM);
	СтруктурЗаполнения.Вставить("communication_id"  			, communication_id);	
	СтруктурЗаполнения.Вставить("communication_type"			, communication_type);	
	СтруктурЗаполнения.Вставить("ВнешняяСистема"    			, ВнешняяСистема);	
	СтруктурЗаполнения.Вставить("СтруктурнаяЕдиница"			, СтруктурнаяЕдиница);	
	СтруктурЗаполнения.Вставить("ОсновнойКлиент"				, ОсновнойКлиент);
	СтруктурЗаполнения.Вставить("КонтактнаяИнформацияСоцСеть"	, КонтактнаяИнформацияСоцСеть);
	СтруктурЗаполнения.Вставить("КаналПривлеченияЗначение"		, КаналПривлеченияЗначение);
	СтруктурЗаполнения.Вставить("Статус"						, Статус);

	// Создание новой заявки.
	НоваяЗаявка = Справочники.Заявки.СоздатьЭлемент();
	
	НоваяЗаявка.Заполнить(СтруктурЗаполнения);
	НоваяЗаявка.Наименование = НаименованиеЗаявки;	
	НоваяЗаявка.КлиентИзВиджетаЛК = КлиентИзВиджетаЛК;
	НоваяЗаявка.ДополнительныеСвойства.Вставить("ЭтоНовый", Истина);
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Для Каждого КлючИЗначение Из ДополнительныеПараметры Цикл
			Если ТипЗнч(КлючИЗначение) = Тип("КлючИЗначение") Тогда
				НоваяЗаявка.ДополнительныеСвойства.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			Иначе
				НоваяЗаявка.ДополнительныеСвойства.Вставить(КлючИЗначение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(КлиентИзВиджетаЛК) Тогда
		НоваяЗаявка.КонтактнаяИнформация.Загрузить(КлиентИзВиджетаЛК.КонтактнаяИнформация.Выгрузить());
		НоваяЗаявка.НомерТелефона = КлиентИзВиджетаЛК.Телефон;
	КонецЕсли;
	
	Попытка
		НоваяЗаявка.Записать();
	Исключение
		ОписаниеОшибки = НСтр("ru= 'Не удалось создать заявку! ';en= 'Failed to create a request! '") + ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;
		
	Если НоваяЗаявка.ДополнительныеСвойства.Свойство("ЭтоНовый") И НоваяЗаявка.Статус = Перечисления.СтатусыЗаявок.Принята Тогда
		Сообщение = "Статус: Новое обращение -> " + Строка(НоваяЗаявка.Статус);
		Если ЗначениеЗаполнено(ПараметрыСеанса.ТекущийСотрудник) Тогда
			Сообщение = Сообщение + Символы.ПС + "Сотрудник: " + Строка(ПараметрыСеанса.ТекущийСотрудник);
		КонецЕсли;
		ОбсужденияСервер.ДобавитьСообщение(Сообщение, НоваяЗаявка.Ссылка,, Истина);
	КонецЕсли;
	
	Возврат НоваяЗаявка.Ссылка;
	
КонецФункции	

// Функция - Создатьзаявку.
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьЗаявку(СтруктураПараметров) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	

	// Создание новой заявки.
	НоваяЗаявка = Справочники.Заявки.СоздатьЭлемент();
	НоваяЗаявка.Заполнить(СтруктураПараметров);
	НоваяЗаявка.ДополнительныеСвойства.Вставить("ЭтоНовый"	  , Истина);
	НоваяЗаявка.ДополнительныеСвойства.Вставить("ОнлайнЗаявка", Истина);  
	
	Попытка
		НоваяЗаявка.Записать();
	Исключение
		ОписаниеОшибки = НСтр("ru= 'Не удалось создать заявку! ';en= 'Failed to create a request! '") + ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;
		
	Возврат НоваяЗаявка.Ссылка;
	
КонецФункции	

Функция СоздатьНовуюЗаявку(ДанныеГенерации, ВключитьБизнесЛогику = Ложь, ВернутьОбъект = Ложь) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если ТипЗнч(ДанныеГенерации) = Тип("Структура") Тогда 
		
		Если ДанныеГенерации.Свойство("СсылкаНовойЗаявки") И ОбщегоНазначения.СсылкаСуществует(ДанныеГенерации.СсылкаНовойЗаявки) Тогда
			Возврат ДанныеГенерации.СсылкаНовойЗаявки;
		КонецЕсли;
		
		НоваяЗаявка = СоздатьЭлемент();
		НоваяЗаявка.Заполнить(ДанныеГенерации);    //НоваяЗаявка.КаналПривлечения  ДанныеГенерации.КаналПривлечения
		Если ДанныеГенерации.Свойство("СформироватьНаименование") Тогда 
			НоваяЗаявка.АктуализироватьНаименованиеОбращения(Истина);
		КонецЕсли;
		Если ЗначениеЗаполнено(НоваяЗаявка.ОсновнойКлиент) И НЕ ЗначениеЗаполнено(НоваяЗаявка.КонтактнаяИнформация) Тогда 
			НоваяЗаявка.КонтактнаяИнформация.Загрузить(НоваяЗаявка.ОсновнойКлиент.КонтактнаяИнформация.Выгрузить());
		КонецЕсли;	
		Если ДанныеГенерации.Свойство("СсылкаНовойЗаявки") Тогда 
			НоваяЗаявка.УстановитьСсылкуНового(ДанныеГенерации.СсылкаНовойЗаявки);
		КонецЕсли;
		Если ДанныеГенерации.Свойство("ИнтерактивнаяЗапись") Тогда 
			НоваяЗаявка.ДополнительныеСвойства.Вставить("ИнтерактивнаяЗапись", Истина);
		КонецЕсли;
		НоваяЗаявка.ДополнительныеСвойства.Вставить("ЭтоНовый", Истина);
		
		Попытка
			НоваяЗаявка.ОбменДанными.Загрузка = НЕ ВключитьБизнесЛогику;			
			НоваяЗаявка.Записать();
			Если ВернутьОбъект Тогда 
				Возврат НоваяЗаявка;
			Иначе 	
				Возврат НоваяЗаявка.Ссылка;
			КонецЕсли;	
		Исключение
			МетаданныеСправочника 		= Метаданные.Справочники.Заявки;
			ПредставлениеСправочника 	= МетаданныеСправочника.Представление();
			
			ОбъектИнициации = Неопределено;
			ДанныеГенерации.Свойство("ОбъектИнициации", ОбъектИнициации);
			// Сформируем комментарий
			Если ОбъектИнициации = Неопределено Тогда 
				ШаблонКомментария = НСтр("ru = 'Не удалось создать новое обращение
				|по причине: %1'");
				Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонКомментария,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));				
			Иначе
				ПредставлениеОбъекта = СокрЛП(Строка(ОбъектИнициации));
				Если ТипЗнч(ОбъектИнициации) = Тип("ДокументСсылка.Прием") Тогда 
					ШаблонКомментария = НСтр("ru = 'При записи приема: %1, не удалось создать новое обращение
					|по причине: %2'");
				Иначе 
					ШаблонКомментария = НСтр("ru = 'При записи объекта: %1, не удалось создать новое обращение
					|по причине: %2'");
				КонецЕсли;	
				Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонКомментария,
				ПредставлениеОбъекта,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));				
			КонецЕсли;	
			
			// Запишем в журнал
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Создание заявки'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			МетаданныеСправочника,,
			Комментарий);
			
			ВызватьИсключение Комментарий;
		КонецПопытки;	
	КонецЕсли;	
	
	Возврат Неопределено;
	
КонецФункции

// Функция - Создать заявку по входу гостевого клиента
//
// Параметры:
//  Гость				 - 	 - 
//  ДатаПрохода			 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//  РекламныйИсточник	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьЗаявкуПоВходуГостевогоКлиента(Гость, ДатаПрохода, СтруктурнаяЕдиница = Неопределено, РекламныйИсточник, ОсновнойМенеджер = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если СуществуюЗаявкиПоКлиенту(Гость, СтруктурнаяЕдиница, Истина) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("ДатаСоздания"					, ДатаПрохода);
	СтруктураЗаполнения.Вставить("Фамилия"						, Гость.Фамилия);
	СтруктураЗаполнения.Вставить("Имя"							, Гость.Имя);
	СтруктураЗаполнения.Вставить("Отчество"						, Гость.Отчество);
	//СтруктураЗаполнения.Вставить("РекламнаяПлощадка"			, Справочники.КаналыПривлечения.ГостевойВизит);
	СтруктураЗаполнения.Вставить("РекламныйИсточник"			, Справочники.РекламныеИсточники.ДругойПациент);
	СтруктураЗаполнения.Вставить("ИсточникИнформацииЗначение"	, РекламныйИсточник);
	СтруктураЗаполнения.Вставить("СтруктурнаяЕдиница"			, ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница));
	СтруктураЗаполнения.Вставить("ОсновнойКлиент"				, Гость);
	СтруктураЗаполнения.Вставить("ОсновнойМенеджер"				, ?(ЗначениеЗаполнено(ОсновнойМенеджер), ОсновнойМенеджер, ПараметрыСеанса.ТекущийСотрудник));
	СтруктураЗаполнения.Вставить("Статус"						, Перечисления.СтатусыЗаявок.НеОбработана);
	СтруктураЗаполнения.Вставить("Комментарий"					, НСтр("ru = 'Создана автоматически при посещения клиники в качестве гостя.'; en = 'Created automatically when visiting the clinic as a guest.'"));
	
	// Создание новой заявки.
	НоваяЗаявка = Справочники.Заявки.СоздатьЭлемент();
	НоваяЗаявка.Заполнить(СтруктураЗаполнения);	
	
	НоваяЗаявка.КонтактнаяИнформация.Загрузить(Гость.КонтактнаяИнформация.Выгрузить());
	
	НоваяЗаявка.ДополнительныеСвойства.Вставить("ЭтоНовый", Истина);	
	
	Попытка
		НоваяЗаявка.Записать();
	Исключение
		ОписаниеОшибки = НСтр("ru= 'Не удалось создать заявку! ';en= 'Failed to create a request! '") + ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;
		
	Возврат НоваяЗаявка.Ссылка;
	
КонецФункции

// Функция - Существую заявки по клиенту
//
// Параметры:
//  Контрагент				 - 	 - 
//  СтруктурнаяЕдиница		 - 	 - 
//  АнализироватьОтклоненные - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СуществуюЗаявкиПоКлиенту(Контрагент, СтруктурнаяЕдиница = Неопределено, АнализироватьОтклоненные = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Заявки.Ссылка КАК Заявка,
	               |	Заявки.ДатаСоздания КАК ДатаСоздания,
	               |	Заявки.Статус КАК Статус
	               |ПОМЕСТИТЬ ТаблицаЗаявокКлиента
	               |ИЗ
	               |	Справочник.Заявки КАК Заявки
	               |ГДЕ
	               |	Заявки.ОсновнойКлиент = &ОсновнойКлиент
	               |	И Заявки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаЗаявокКлиента.Заявка КАК Заявка
	               |ИЗ
	               |	ТаблицаЗаявокКлиента КАК ТаблицаЗаявокКлиента
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &АнализироватьОтклоненные
	               |				ТОГДА ВЫБОР
	               |						КОГДА ТаблицаЗаявокКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.Отклонена)
	               |							ТОГДА ТаблицаЗаявокКлиента.ДатаСоздания < ДОБАВИТЬКДАТЕ(&ТекущаяДата, ГОД, -1)
	               |						ИНАЧЕ ИСТИНА
	               |					КОНЕЦ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ОсновнойКлиент"			, Контрагент);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"		, ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница));
	Запрос.УстановитьПараметр("ТекущаяДата"				, ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("АнализироватьОтклоненные", АнализироватьОтклоненные);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

// Функция, создает потенциального клиента по заявке.
//
Функция СоздатьПотенциальногоКлиентаПоВходящейЗаявке(Заявка, ОписаниеОшибки) Экспорт
		
	НовыйКлиент = Справочники.Контрагенты.СоздатьЭлемент();	
	
	НовыйКлиент.Фамилия             		= Заявка.Фамилия;
	НовыйКлиент.Имя                 		= Заявка.Имя;
	НовыйКлиент.Отчество            		= Заявка.Отчество;
	НовыйКлиент.ТипКонтрагента      		= Перечисления.ТипыКонтрагентов.Клиенты;
	НовыйКлиент.ЮрФизЛицо           		= Перечисления.ЮрФизЛицо.ФизЛицо;
	НовыйКлиент.ДатаРегистрации     		= ТекущаяДатаСеанса();
	
	ПолСтрокой = ОбщегоНазначенияКлиентСерверСтоматология.ОпределитьПолКлиента(НовыйКлиент.Фамилия, НовыйКлиент.Имя, НовыйКлиент.Отчество);
	Если ПолСтрокой = "Мужской" Тогда
		НовыйКлиент.ПолКлиента = Перечисления.ПолФизическогоЛица.Мужской;
	ИначеЕсли ПолСтрокой = "Женский" Тогда
		НовыйКлиент.ПолКлиента = Перечисления.ПолФизическогоЛица.Женский;
	КонецЕсли;
	
	ИскомыйЭлемент = Справочники.Контрагенты.НайтиПоНаименованию("Пациенты", Истина);
	Если ИскомыйЭлемент.Пустая() Тогда
		Клиенты = Справочники.Контрагенты.СоздатьГруппу();
		Клиенты.Наименование = "Пациенты";
		Клиенты.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты;
		Клиенты.Автокоррекция = 1;
		Клиенты.Записать();
	КонецЕсли;
	
	НовыйКлиент.Родитель            		= Справочники.Контрагенты.НайтиПоНаименованию("Пациенты", Истина);
	НовыйКлиент.КаналПривлечения 			= Заявка.КаналПривлечения;
	НовыйКлиент.КаналПривлеченияЗначение	= Заявка.КаналПривлеченияЗначение;
	НовыйКлиент.ИсточникИнформации 			= Заявка.РекламныйИсточник;
	НовыйКлиент.КлиентИсточникИнформации 	= Заявка.ИсточникИнформацииЗначение;
	НовыйКлиент.СотрудникРегистрации	 	= ПараметрыСеанса.ТекущийСотрудник;
	НовыйКлиент.СтруктурнаяЕдиница			= ?(ЗначениеЗаполнено(Заявка.СтруктурнаяЕдиница), Заявка.СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	НовыйКлиент.Куратор 					= ?(ТипЗнч(Заявка.ОсновнойМенеджер) = Тип("СправочникСсылка.Сотрудники"), ?(ЗначениеЗаполнено(Заявка.ОсновнойМенеджер), Заявка.ОсновнойМенеджер, ПараметрыСеанса.ТекущийСотрудник), ПараметрыСеанса.ТекущийПользователь);
	
	// Заполним КИ клиента.
	НовыйКлиент.КонтактнаяИнформация.Загрузить(Заявка.КонтактнаяИнформация.Выгрузить());
	
	Если ТипЗнч(Заявка) = Тип("СправочникОбъект.Заявки") Тогда 
		НовыйКлиент.ДополнительныеСвойства.Вставить("Заявка", Заявка.Ссылка);
	ИначеЕсли ТипЗнч(Заявка) = Тип("СправочникСсылка.Заявки") Тогда 
		НовыйКлиент.ДополнительныеСвойства.Вставить("Заявка", Заявка);
	КонецЕсли;
	
	Попытка
		НовыйКлиент.Записать();
	Исключение
		ОписаниеОшибки = НСтр("ru= 'Не удалось создать клиента! ';en= 'Failed to create client! '") + ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;
	
	РегистрыСведений.СтатусыКонтрагентов.УстановитьСтатусПациенту(НовыйКлиент.Ссылка, Перечисления.СтатусыКонтрагентов.Потенциальный);
		
	//РегистрыСведений.КонтактыМессенджеров.СменитьОбъектИдентификацииПриСозданииКлиента(?(ТипЗнч(Заявка) = Тип("СправочникОбъект.Заявки"), Заявка.Ссылка, Заявка), НовыйКлиент.Ссылка);
	
	Возврат НовыйКлиент.Ссылка;
	
КонецФункции

// Функция - Получить необработанные заявки.
//
// Возвращаемое значение:
//   -
//
Функция ПолучитьНеОбработанныеЗаявки(Пользователь = Неопределено, Сообщение = "") Экспорт
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Заявки.Ссылка КАК Ссылка,
	|	Заявки.ИмяКлиента КАК ИмяКлиента,
	|	Заявки.РекламныйИсточник КАК РекламныйИсточник
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|ГДЕ
	|	Заявки.ПометкаУдаления = ЛОЖЬ
	|	И НЕ Заявки.Статус В(ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.Принята), ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.Отклонена))
	|	И ВЫБОР
	|			КОГДА &ТекущийПользователь <> НЕОПРЕДЕЛЕНО
	|				ТОГДА Заявки.ОсновнойМенеджер = &ТекущийПользователь
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ");
	
	Запрос.УстановитьПараметр("ТекущийПользователь", ?(ЗначениеЗаполнено(Пользователь), Пользователь, Неопределено));
	
	МассивНеобработанныхзаявок     = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	КоличествоНеобработанныхЗаявок = МассивНеобработанныхЗаявок.Количество();
	
	Если КоличествоНеобработанныхЗаявок > 0 Тогда
		
		ПредставлениеЗаявок = СтрокаСЧислом(НСтр("ru = '; необработанная заявка; ; необработанных заявки; необработанных заявок; необработанных заявки'; en = '; untreated request;;;; untreated requests'"),
									КоличествоНеобработанныхЗаявок,
									ВидЧисловогоЗначения.Количественное,
									НСтр("ru='L=ru'; en='L=en'"));
		Сообщение           = Нстр("ru = 'У вас '; en = 'You have '") + КоличествоНеобработанныхЗаявок + " " + ПредставлениеЗаявок;
		
	КонецЕсли;
	
	Возврат МассивНеобработанныхЗаявок;
	
КонецФункции

// Функция - Получить заявку по номеру телефона.
//
// Параметры:
//  НомерТелефона	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЗаявкуПоНомеруТелефона(Знач НомерТелефона, МассивСтатусов = Неопределено, СтруктурнаяЕдиница = Неопределено, ИскатьПоВсемКлиникам = Ложь) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если ТипЗнч(НомерТелефона) = Тип("Массив") Тогда 
		МассивНомеровТелефонов = НомерТелефона;
	Иначе 	
		МассивНомеровТелефонов = Новый Массив;
		Если ТипЗнч(НомерТелефона) = Тип("Строка") Тогда 
			МассивНомеровТелефонов.Добавить(НомерТелефона);
			МассивНомеровТелефонов.Добавить(ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(НомерТелефона, Ложь));
			МассивНомеровТелефонов.Добавить(ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(НомерТелефона, Истина));
			
			ОбъектXDTOИнформации = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOПоПредставлению(НомерТелефона, Справочники.ВидыКонтактнойИнформации.ТелефонКлиента);
			
			НомерТелефона = "+7" + ОбъектXDTOИнформации.Состав.КодГорода + ОбъектXDTOИнформации.Состав.Номер;
			МассивНомеровТелефонов.Добавить(НомерТелефона);
			НомерТелефона = "+8" + ОбъектXDTOИнформации.Состав.КодГорода + ОбъектXDTOИнформации.Состав.Номер;
			МассивНомеровТелефонов.Добавить(НомерТелефона);	
		ИначеЕсли ТипЗнч(НомерТелефона) = Тип("Массив") Тогда
			Для Каждого НомерТелефонаЭлемент Из НомерТелефона Цикл 
				МассивНомеровТелефонов.Добавить(НомерТелефонаЭлемент);
				ЗначенияПолей = Новый СписокЗначений;
				УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(НомерТелефонаЭлемент, ЗначенияПолей);
				Если МассивНомеровТелефонов.Найти(НомерТелефонаЭлемент) = Неопределено Тогда 
					МассивНомеровТелефонов.Добавить(НомерТелефонаЭлемент);
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Заявки.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА Заявки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.Отклонена)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СортировкаПоСтатусу,
	|	ВЫБОР
	|		КОГДА Заявки.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СортировкаПоСтруктурнойЕдинице
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|ГДЕ
	|	(Заявки.КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|				И Заявки.КонтактнаяИнформация.НомерТелефона В (&МассивНомеровТелефонов)
	|			ИЛИ ВЫРАЗИТЬ(Заявки.КонтактнаяИнформация.Представление КАК СТРОКА(200)) В (&МассивНомеровТелефонов))
	|	И &УсловиеСтатусы
	|	И &УсловиеСтруктурнаяЕдиница
	|
	|УПОРЯДОЧИТЬ ПО
	|	СортировкаПоСтруктурнойЕдинице,
	|	СортировкаПоСтатусу,
	|	Заявки.ДатаСоздания УБЫВ");
	
	Запрос.УстановитьПараметр("МассивНомеровТелефонов", МассивНомеровТелефонов);
	Если ЗначениеЗаполнено(МассивСтатусов) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтатусы", "Заявки.Статус В(&МассивСтатусов)");
		Запрос.УстановитьПараметр("МассивСтатусов", МассивСтатусов);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтатусы", "ИСТИНА");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктурнаяЕдиница) ИЛИ СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка() Тогда
		МассивСтруктурныхЕдиниц = Новый Массив;
		МассивСтруктурныхЕдиниц.Добавить(СтруктурнаяЕдиница);
		Если МассивСтруктурныхЕдиниц.Найти(Справочники.СтруктурныеЕдиницы.ПустаяСсылка()) = Неопределено Тогда 
			МассивСтруктурныхЕдиниц.Добавить(Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
		КонецЕсли;	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", "Заявки.СтруктурнаяЕдиница В(&МассивСтруктурныхЕдиниц)");
		Запрос.УстановитьПараметр("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", "ИСТИНА");
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.Ссылка;
	ИначеЕсли ЗначениеЗаполнено(МассивСтруктурныхЕдиниц) И ИскатьПоВсемКлиникам Тогда
		МассивСтатусов = Новый Массив;
		МассивСтатусов.Добавить(Перечисления.СтатусыЗаявок.НеОбработана);
		МассивСтатусов.Добавить(Перечисления.СтатусыЗаявок.ОтвеченныйДиалог);
		МассивСтатусов.Добавить(Перечисления.СтатусыЗаявок.ОтвеченныйЗвонок);
		МассивСтатусов.Добавить(Перечисления.СтатусыЗаявок.Перезвонить);
		МассивСтатусов.Добавить(Перечисления.СтатусыЗаявок.ПропущенныйЗвонок);
		МассивСтатусов.Добавить(Перечисления.СтатусыЗаявок.Отклонена);
		
		Возврат ПолучитьЗаявкуПоНомеруТелефона(МассивНомеровТелефонов, МассивСтатусов); 
	КонецЕсли;
	
	Возврат Справочники.Заявки.ПустаяСсылка();

КонецФункции

// Функция - Получить массив сотрудников для оповещения о новых заявках.
//
// Возвращаемое значение:
//   -
//
Функция ПолучитьСотрудниковДляОповещенияОНовыхЗаявках() Экспорт
	
	МассивРолей = Новый Массив;
	МассивРолей.Добавить(Перечисления.РольПользователя.АдминистраторБазыДанных);
	МассивРолей.Добавить(Перечисления.РольПользователя.Директор);
	МассивРолей.Добавить(Перечисления.РольПользователя.МенеджерОтделаПродаж);
	МассивРолей.Добавить(Перечисления.РольПользователя.РуководительОтделаПродаж);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.РольПользователя КАК РольПользователя
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И Сотрудники.РольПользователя В(&МассивРолей)");
	
	Запрос.УстановитьПараметр("МассивРолей", МассивРолей);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Процедура - Актуализировать основного клиента заявки.
//
// Параметры:
//  Заявка			 - 	 - 
//  Контрагент	 - 	 - 
//
Процедура АктуализироватьОсновногоКлиентаЗаявки(Заявка, Контрагент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Заявка.ОсновнойКлиент <> Контрагент Тогда 
		
		ЗаявкаОбъект 				= Заявка.ПолучитьОбъект();
		ЗаявкаОбъект.ОсновнойКлиент = Контрагент;
		ЗаявкаОбъект.Статус         = Перечисления.СтатусыЗаявок.Принята;
		
		Попытка
			ЗаявкаОбъект.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось актуализировать заявку!'; en = 'Failed to update the application!'") + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Функция - Получить заявку контрагента
//
// Параметры:
//  Контрагент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЗаявкуКонтрагента(Контрагент, МассивСтатусов = Неопределено, СтруктурнаяЕдиница = Неопределено, ИскатьПоВсемКлиникам = Ложь) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Заявки.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА Заявки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.Отклонена)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СортировкаПоСтатусу,
	|	ВЫБОР
	|		КОГДА Заявки.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СортировкаПоСтруктурнойЕдинице
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|ГДЕ
	|	НЕ Заявки.ПометкаУдаления
	|	И Заявки.ОсновнойКлиент = &Контрагент
	|	И &УсловиеСтатусы
	|	И &УсловиеСтруктурнаяЕдиница
	|
	|УПОРЯДОЧИТЬ ПО
	|	СортировкаПоСтруктурнойЕдинице,
	|	СортировкаПоСтатусу,
	|	Заявки.ДатаСоздания УБЫВ");
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Если ЗначениеЗаполнено(МассивСтатусов) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтатусы", "Заявки.Статус В(&МассивСтатусов)");
		Запрос.УстановитьПараметр("МассивСтатусов", МассивСтатусов);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтатусы", "ИСТИНА");
	КонецЕсли;
	
	МассивСтруктурныхЕдиниц = Неопределено;
	Если ЗначениеЗаполнено(СтруктурнаяЕдиница) ИЛИ СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка() Тогда
		МассивСтруктурныхЕдиниц = Новый Массив;
		МассивСтруктурныхЕдиниц.Добавить(СтруктурнаяЕдиница);
		Если МассивСтруктурныхЕдиниц.Найти(Справочники.СтруктурныеЕдиницы.ПустаяСсылка()) = Неопределено Тогда 
			МассивСтруктурныхЕдиниц.Добавить(Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
		КонецЕсли;	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", "Заявки.СтруктурнаяЕдиница В(&МассивСтруктурныхЕдиниц)");
		Запрос.УстановитьПараметр("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", "ИСТИНА");
	КонецЕсли;	
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	ИначеЕсли ЗначениеЗаполнено(МассивСтруктурныхЕдиниц) И ИскатьПоВсемКлиникам Тогда
		МассивСтатусов = Новый Массив;
		МассивСтатусов.Добавить(Перечисления.СтатусыЗаявок.НеОбработана);
		МассивСтатусов.Добавить(Перечисления.СтатусыЗаявок.ОтвеченныйДиалог);
		МассивСтатусов.Добавить(Перечисления.СтатусыЗаявок.ОтвеченныйЗвонок);
		МассивСтатусов.Добавить(Перечисления.СтатусыЗаявок.Перезвонить);
		МассивСтатусов.Добавить(Перечисления.СтатусыЗаявок.ПропущенныйЗвонок);
		МассивСтатусов.Добавить(Перечисления.СтатусыЗаявок.Отклонена);
		
		Возврат ПолучитьЗаявкуКонтрагента(Контрагент, МассивСтатусов); 
	КонецЕсли;	
	
	Возврат Неопределено;
	
КонецФункции

// Функция, возвращает заявку по номеру JivoSite
//
Функция ПолучитьЗаявкуПоНомеруJivoSite(НомерДживоСайта) Экспорт 

	Если НЕ ЗначениеЗаполнено(НомерДживоСайта) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.JivoSite);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактыМессенджеров.ОбъектИдентификации КАК ОбъектИдентификации
	|ИЗ
	|	РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
	|ГДЕ
	|	КонтактыМессенджеров.Идентификатор = &Идентификатор
	|	И КонтактыМессенджеров.ВнешняяСистема = &ВнешняяСистема");
	Запрос.УстановитьПараметр("Идентификатор", НомерДживоСайта);
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка[0], Неопределено);	

КонецФункции

// Функция, возвращает актульные заявки контрагента.
//
Функция ПолучитьМассивАктуальныхЗаявокКонтрагента(ТекстПоиска = "", Контрагент = Неопределено) Экспорт 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Заявки.Ссылка КАК Заявка
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Сделки.Ссылка КАК Ссылка
	|		ИЗ
	|			Справочник.Сделки КАК Сделки
	|		ГДЕ
	|			НЕ Сделки.ПометкаУдаления
	|			И Сделки.Контрагент = &ОсновнойКлиент) КАК ВложенныйЗапрос
	|		ПО Заявки.Ссылка = ВложенныйЗапрос.Ссылка.Заявка
	|ГДЕ
	|	Заявки.ОсновнойКлиент = &ОсновнойКлиент
	|	И Заявки.ОсновнойКлиент.Наименование ПОДОБНО &Текст
	|	И НЕ Заявки.ПометкаУдаления
	|	И НЕ Заявки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.Отклонена)
	|	И ВложенныйЗапрос.Ссылка.Заявка ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заявки.ДатаСоздания УБЫВ");
	
	Запрос.УстановитьПараметр("ОсновнойКлиент", Контрагент);
	Запрос.УстановитьПараметр("Текст"         , "%" + ТекстПоиска + "%");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заявка");	
	
КонецФункции	

// Функция, возвращает заявки контрагента.
//
Функция ПолучитьМассивЗаявокКонтрагента(Контрагент = Неопределено) Экспорт 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Заявки.Ссылка КАК Заявка
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|ГДЕ
	|	Заявки.ОсновнойКлиент = &ОсновнойКлиент
	|	И НЕ Заявки.ПометкаУдаления
	|	И НЕ Заявки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.Отклонена)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заявки.ДатаСоздания УБЫВ");
	
	Запрос.УстановитьПараметр("ОсновнойКлиент", Контрагент);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заявка");	
	
КонецФункции

&НаСервере
// Функция, формирует таблицу истории взаимодействия.
//
Функция ПолучитьИсториюВзаимодействияЗаявки(ПараметрыДанных, РежимПодробно = Ложь, Фильтры = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|ПОМЕСТИТЬ ВТТелефоны
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаявкиКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|	ИЗ
	|		Справочник.Заявки.КонтактнаяИнформация КАК ЗаявкиКонтактнаяИнформация
	|	ГДЕ
	|		ЗаявкиКонтактнаяИнформация.Ссылка = &Заявка
	|		И ЗаявкиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КонтрагентыКонтактнаяИнформация.НомерТелефона
	|	ИЗ
	|		Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|	ГДЕ
	|		&ВыводИнформацииКлиента
	|		И КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
	|		И КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)) КАК КонтактнаяИнформация
	|
	| ОБЪЕДИНИТЬ
	|
	| ВЫБРАТЬ
	| 	Заявки.ВходящийНомерТелефона КАК НомерТелефона
	| ИЗ
	|	Справочник.Заявки КАК Заявки
	|
	|
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КонтактыМессенджеров.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ТаблицаИдентификаторовКонтактовМессенджеров
	|ИЗ
	|	РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
	|ГДЕ
	|	КонтактыМессенджеров.ОбъектИдентификации = &Заявка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТаблицаИдентификаторовКонтактовМессенджеров.Идентификатор КАК Идентификатор,
	|	ЕСТЬNULL(КонтактыМессенджеров.ФотоКлиента, """") КАК ФотоКлиента
	|ПОМЕСТИТЬ ВтКонтактыМессенджеровИФото
	|ИЗ
	|	ТаблицаИдентификаторовКонтактовМессенджеров КАК ТаблицаИдентификаторовКонтактовМессенджеров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
	|		ПО ТаблицаИдентификаторовКонтактовМессенджеров.Идентификатор = КонтактыМессенджеров.Идентификатор
	|			И (КонтактыМессенджеров.ФотоКлиента <> """")
	|			И (КонтактыМессенджеров.Идентификатор В
	|				(ВЫБРАТЬ
	|					ТаблицаИдентификаторовКонтактовМессенджеров.Идентификатор КАК идентификатор
	|				ИЗ
	|					ТаблицаИдентификаторовКонтактовМессенджеров КАК ТаблицаИдентификаторовКонтактовМессенджеров))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Заявки.Ссылка КАК Взаимодействие,
	|	Заявки.ДатаСоздания КАК Дата,
	|	""ДатаРегистрацииЗаявки"" КАК ТипСобытия,
	|	NULL КАК ТипВзаимодействия,
	|	NULL КАК Автор,
	|	NULL КАК АвторПредставление,
	|	NULL КАК Заметка,
	|	NULL КАК Длительность,
	|	NULL КАК Начало,
	|	NULL КАК Окончание,
	|	NULL КАК Статус,
	|	NULL КАК ВзаимодействиеИД,
	|	""Заметка"" КАК ТипЗадачи,
	|	NULL КАК URLЗаписи,
	|	NULL КАК ФайлЗаписи,
	|	NULL КАК ТекстСообщения,
	|	NULL КАК Сделка,
	|	NULL КАК ИДЗаметки,
	|	0 КАК Порядок
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|ГДЕ
	|	Заявки.Ссылка = &Заявка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка,
	|	&ДатаРожденияКлиента,
	|	""ДеньРожденияКлиента"",
	|	ВЫБОР
	|		КОГДА &ДатаРожденияКлиента = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	|			ТОГДА ""История""
	|		ИНАЧЕ ""Запланировано""
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА &ДатаРожденияКлиента = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	|			ТОГДА 0
	|		ИНАЧЕ 9
	|	КОНЕЦ
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	&ВыводИнформацииКлиента
	|	И Контрагенты.Ссылка = &Контрагент
	|	И &ДатаРожденияКлиента >= НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	|	И &ДатаРожденияКлиента < ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), НЕДЕЛЯ, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка,
	|	НАЧАЛОПЕРИОДА(Контрагенты.ДатаРегистрации, ДЕНЬ),
	|	""ДатаРегистрацииКлиента"",
	|	""История"",
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	&ВыводИнформацииКлиента
	|	И Контрагенты.Ссылка = &Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтатусыСообщений.РассылкаСообщений,
	|	ВЫБОР
	|		КОГДА СтатусыСообщений.ДатаОтправки = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА СтатусыСообщений.ДатаУстановкиСтатуса
	|		ИНАЧЕ СтатусыСообщений.ДатаОтправки
	|	КОНЕЦ,
	|	""SMS"",
	|	""История"",
	|	СтатусыСообщений.РассылкаСообщений.АвторДокумента,
	|	СтатусыСообщений.РассылкаСообщений.АвторДокумента.Наименование,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СтатусыСообщений.СтадияДоставки,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СтатусыСообщений.ТекстСообщения,
	|	СтатусыСообщений.РассылкаСообщений.ДокументОснование,
	|	NULL,
	|	0
	|ИЗ
	|	РегистрСведений.СтатусыСообщений КАК СтатусыСообщений
	|ГДЕ
	|	СтатусыСообщений.IDСообщения <> """"
	|	И (СтатусыСообщений.СервисРассылки ССЫЛКА Справочник.СервисыРассылки
	|			ИЛИ СтатусыСообщений.СервисРассылки ССЫЛКА Справочник.ВнешниеСистемы
	|				И СтатусыСообщений.СервисРассылки.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Wallet))
	|	И СтатусыСообщений.Получатель В(&ОбъектыОтбора)
	|	И СтатусыСообщений.РассылкаСообщений.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И &ВыводитьСообщения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка,
	|	ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка.Дата,
	|	""Письмо"",
	|	""История"",
	|	ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка.Автор,
	|	ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка.Автор.Наименование,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка.СтатусПисьма,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0
	|ИЗ
	|	Документ.ЭлектронноеПисьмоИсходящее.ПолучателиПисьма КАК ЭлектронноеПисьмоИсходящееПолучателиПисьма
	|ГДЕ
	|	НЕ ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка.ПометкаУдаления
	|	И ЭлектронноеПисьмоИсходящееПолучателиПисьма.Контакт В(&ОбъектыОтбора)
	|	И ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И &ВыводитьСообщения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	Заметки.Период,
	|	""Заметка"",
	|	ВЫБОР
	|		КОГДА Заметки.Закреплена = ИСТИНА
	|			ТОГДА ""Закреплено""
	|		ИНАЧЕ ""История""
	|	КОНЕЦ,
	|	Заметки.Автор,
	|	Заметки.Автор.НаименованиеСокращенное,
	|	ВЫРАЗИТЬ(Заметки.Заметка КАК СТРОКА(1000)),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	Заметки.Сделка,
	|	Заметки.ИД,
	|	ВЫБОР
	|		КОГДА Заметки.Закреплена = ИСТИНА
	|			ТОГДА 99
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрСведений.Заметки КАК Заметки
	|ГДЕ
	|	Заметки.Объект В(&ОбъектыОтбора)
	|	И Заметки.АктивностьЗаметки
	|	И &ВыводитьЗаметки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсторияЗвонков.IDЗвонка,
	|	ИсторияЗвонков.НачалоВызова,
	|	ВЫБОР
	|		КОГДА ИсторияЗвонков.ИсходящийЗвонок = ИСТИНА
	|			ТОГДА ""ИсходящийЗвонок""
	|		КОГДА ИсторияЗвонков.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗвонка.Пропущен)
	|			ТОГДА ""ПропущенныйЗвонок""
	|		ИНАЧЕ ""ВходящийЗвонок""
	|	КОНЕЦ,
	|	""История"",
	|	ИсторияЗвонков.Пользователь,
	|	ИсторияЗвонков.Пользователь.НаименованиеСокращенное,
	|	ВЫРАЗИТЬ(ИсторияЗвонков.Заметка КАК СТРОКА(200)),
	|	ВЫБОР
	|		КОГДА ИсторияЗвонков.НачалоРазговора <> ДАТАВРЕМЯ(1, 1, 1)
	|				И ИсторияЗвонков.ОкончаниеЗвонка <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РАЗНОСТЬДАТ(ИсторияЗвонков.НачалоРазговора, ИсторияЗвонков.ОкончаниеЗвонка, СЕКУНДА)
	|		КОГДА ИсторияЗвонков.НачалоВызова <> ДАТАВРЕМЯ(1, 1, 1)
	|				И ИсторияЗвонков.ОкончаниеЗвонка <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РАЗНОСТЬДАТ(ИсторияЗвонков.НачалоВызова, ИсторияЗвонков.ОкончаниеЗвонка, СЕКУНДА)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсторияЗвонков.НачалоРазговора <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ИсторияЗвонков.НачалоРазговора
	|		ИНАЧЕ ИсторияЗвонков.НачалоВызова
	|	КОНЕЦ,
	|	ИсторияЗвонков.ОкончаниеЗвонка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ИсторияЗвонков.URLЗаписи,
	|	ИсторияЗвонков.ФайлЗаписи,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0
	|ИЗ
	|	РегистрСведений.ИсторияВызовов КАК ИсторияЗвонков
	|ГДЕ
	|	ИсторияЗвонков.НомерТелефона В
	|			(ВЫБРАТЬ
	|				ВТТелефоны.НомерТелефона
	|			ИЗ
	|				ВТТелефоны)
	|	И &ВыводитьЗвонки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗадачаВзаимодействие.Ссылка,
	|	ВЫБОР
	|		КОГДА ЗадачаВзаимодействие.Выполнена
	|			ТОГДА ЗадачаВзаимодействие.ДатаИсполнения
	|		ИНАЧЕ ЗадачаВзаимодействие.ЗадачаНазначеннаяДата
	|	КОНЕЦ,
	|	""Задача"",
	|	ВЫБОР
	|		КОГДА ЗадачаВзаимодействие.Выполнена
	|			ТОГДА ""История""
	|		КОГДА ЗадачаВзаимодействие.ЗадачаНазначеннаяДата < &ТекущаяДата
	|			ТОГДА ""Просроченно""
	|		ИНАЧЕ ""Запланировано""
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗадачаВзаимодействие.Выполнена
	|			ТОГДА ЗадачаВзаимодействие.ИсполнительФактический
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЗадачаВзаимодействие.Исполнитель ССЫЛКА Справочник.Сотрудники
	|					ТОГДА ЗадачаВзаимодействие.Исполнитель
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗадачаВзаимодействие.Выполнена
	|			ТОГДА ЗадачаВзаимодействие.ИсполнительФактический.НаименованиеСокращенное
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЗадачаВзаимодействие.Исполнитель ССЫЛКА Справочник.Сотрудники
	|					ТОГДА ЗадачаВзаимодействие.Исполнитель.НаименованиеСокращенное
	|				ИНАЧЕ ЗадачаВзаимодействие.Исполнитель.Наименование
	|			КОНЕЦ
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	""Взаимодействие"",
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЗадачаВзаимодействие.Сделка,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ЗадачаВзаимодействие.Выполнена
	|			ТОГДА 0
	|		КОГДА ЗадачаВзаимодействие.ЗадачаНазначеннаяДата < &ТекущаяДата
	|			ТОГДА 10
	|		ИНАЧЕ 9
	|	КОНЕЦ
	|ИЗ
	|	Задача.Взаимодействие КАК ЗадачаВзаимодействие
	|ГДЕ
	|	НЕ ЗадачаВзаимодействие.ПометкаУдаления
	|	И ЗадачаВзаимодействие.ЗадачаПредмет В(&ОбъектыОтбора)
	|	И ЗадачаВзаимодействие.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И &ВыводитьЗадачи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЖурналСообщений.ВнешняяСистема,
	|	ЖурналСообщений.ДатаСообщения,
	|	ВЫБОР
	|		КОГДА ЖурналСообщений.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.JivoSite)
	|			ТОГДА ""ДиалогJivoSite""
	|		КОГДА ЖурналСообщений.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.CoMagic)
	|			ТОГДА ""ДиалогCoMagic""
	|		КОГДА ЖурналСообщений.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Roistat)
	|			ТОГДА ""ДиалогRoistat""
	|		КОГДА ЖурналСообщений.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.GreenApi)
	|			ТОГДА ""ДиалогGreenApi""
	|		КОГДА ЖурналСообщений.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Chat2Desk)
	|			ТОГДА ""ДиалогChat2Desk""
	|		КОГДА ЖурналСообщений.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.VkontakteApi)
	|			ТОГДА ""ДиалогVkApi""
	|		КОГДА ЖурналСообщений.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Viber)
	|			ТОГДА ""ДиалогViber""
	|		КОГДА ЖурналСообщений.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Telegram)
	|			ТОГДА ""ДиалогTelegram""
	|		ИНАЧЕ ""Диалог""
	|	КОНЕЦ,
	|	""История"",
	|	ЖурналСообщений.ОператорСообщения,
	|	NULL,
	|	ЖурналСообщений.ИдКлиента,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЖурналСообщений.СлужебноеСообщение,
	|	ВЫБОР
	|		КОГДА ЖурналСообщений.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.JivoSite)
	|			ТОГДА ЖурналСообщений.ИдОператора
	|		КОГДА ЖурналСообщений.СообщениеОтКлиента
	|			ТОГДА ""0""
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	NULL,
	|	ВтКонтактыМессенджеровИФото.ФотоКлиента,
	|	NULL,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ЖурналСообщений.ТекстСообщения КАК СТРОКА(10))) = """"
	|			ТОГДА ""(Прикрепленный файл)""
	|		ИНАЧЕ ВЫРАЗИТЬ(ЖурналСообщений.ТекстСообщения КАК СТРОКА(1024))
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	0
	|ИЗ
	|	РегистрСведений.ЖурналСообщений КАК ЖурналСообщений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтКонтактыМессенджеровИФото КАК ВтКонтактыМессенджеровИФото
	|		ПО ЖурналСообщений.ИдКлиента = ВтКонтактыМессенджеровИФото.Идентификатор
	|ГДЕ
	|	ЖурналСообщений.ИдКлиента В
	|			(ВЫБРАТЬ
	|				ВтКонтактыМессенджеровИФото.Идентификатор
	|			ИЗ
	|				ВтКонтактыМессенджеровИФото)
	|	И ЖурналСообщений.ВнешняяСистема В(&ВнешняяСистема)
	|	И НЕ ЖурналСообщений.ОжиданиеСообщения
	|	И &ВыводитьСообщения
	|	И ЖурналСообщений.СлужебноеСообщение = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок УБЫВ,
	|	Дата УБЫВ");
	
	ДатаРождения = Неопределено;
	Фильтры		 = ?(Фильтры = Неопределено, Новый Структура, Фильтры);
	
	ОбъектыОтбора = Новый Массив;
	ОбъектыОтбора.Добавить(ПараметрыДанных.Ссылка);
	
	Если ЗначениеЗаполнено(ПараметрыДанных.ОсновнойКлиент) Тогда
		
		ОбъектыОтбора.Добавить(ПараметрыДанных.ОсновнойКлиент);
		
		СтруктураОбъект = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ПараметрыДанных.ОсновнойКлиент, "ДатаРожденияКлиента, ДатаРегистрации");
		ДатаРождения	= СтруктураОбъект.ДатаРожденияКлиента;
		ПараметрыДанных.Вставить("ДатаРожденияКлиента" , СтруктураОбъект.ДатаРожденияКлиента);

		// Если год не высокосный, тогда передвигаем дату рождения на один день. 
		Если ЗначениеЗаполнено(ДатаРождения) 
			И Месяц(ДатаРождения) = 2 
			И День(ДатаРождения) = 29 
			И Не ДеньГода(КонецГода(ТекущаяДатаСеанса())) = 366 Тогда
			
			ДатаРождения = ДатаРождения + 86400;		
		КонецЕсли;
		
		ДатаРождения = Дата("" + Формат(ТекущаяДата(),"ДФ=yyyy; ДП=0001") + "" + Формат(ДатаРождения,"ДФ=MM; ДП=01") + "" + Формат(ДатаРождения,"ДФ=dd; ДП=01"));
		
		ПараметрыДанных.Вставить("ДатаРегистрацииКлиента", СтруктураОбъект.ДатаРегистрации);

	КонецЕсли;
		
	МассивВнешнихСистем = Новый Массив;
	Если ЗначениеЗаполнено(ПараметрыДанных.ВнешняяСистема) Тогда
		МассивВнешнихСистем.Добавить(ПараметрыДанных.ВнешняяСистема);	
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(МассивВнешнихСистем) Тогда
		МассивВнешнихСистем.Добавить(Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.JivoSite));	
	КонецЕсли;
	
	ВсеФильтрыОтключены = ВсеФильтрыОтключены(Фильтры);
	
	Запрос.УстановитьПараметр("Заявка"                  , ПараметрыДанных.Ссылка);
	Запрос.УстановитьПараметр("Контрагент"              , ПараметрыДанных.ОсновнойКлиент);
	Запрос.УстановитьПараметр("ДатаРожденияКлиента"     , ДатаРождения);
	Запрос.УстановитьПараметр("ВыводИнформацииКлиента"  , ЗначениеЗаполнено(ПараметрыДанных.ОсновнойКлиент));
	Запрос.УстановитьПараметр("ОбъектыОтбора"           , ОбъектыОтбора);
	Запрос.УстановитьПараметр("ТекущаяДата"             , ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	    , ПараметрыДанных.ТекущаяСтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ВнешняяСистема"	  	    , МассивВнешнихСистем);
	
	Запрос.УстановитьПараметр("ВыводитьЗадачи"          , ?(ВсеФильтрыОтключены = Ложь И Фильтры.Свойство("Задачи")			, Фильтры.Задачи	, Истина));
	Запрос.УстановитьПараметр("ВыводитьЗаметки"      	, ?(ВсеФильтрыОтключены = Ложь И Фильтры.Свойство("Заметки")    	, Фильтры.Заметки 	, Истина));
	Запрос.УстановитьПараметр("ВыводитьСообщения"       , ?(ВсеФильтрыОтключены = Ложь И Фильтры.Свойство("Сообщения")     	, Фильтры.Сообщения , Истина));
	Запрос.УстановитьПараметр("ВыводитьЗвонки"      	, ?(ВсеФильтрыОтключены = Ложь И Фильтры.Свойство("Звонки")			, Фильтры.Звонки	, Истина));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
// Функция, проверяет отключены ли все фильтры.
//
Функция ВсеФильтрыОтключены(Фильтры)
	
	Для Каждого Фильтр Из Фильтры Цикл
		Если Фильтр.Значение = Истина Тогда
			Возврат Ложь;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Функция, возвращает цвет, соответствующий статусу заявки.
//
Функция ПолучитьЦветСтатусаЗаявки(Статус) Экспорт
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.НеОбработана") Тогда
		Цвет = Новый Цвет(0, 185, 97);
		
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ПропущенныйЗвонок") Тогда
		Цвет = Новый Цвет(253, 176, 81);
		
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ОтвеченныйЗвонок") Тогда
		Цвет = Новый Цвет(163, 212, 155);
		
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ОтвеченныйДиалог") Тогда
		Цвет = Новый Цвет(163, 212, 155);
		
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Перезвонить") Тогда
		Цвет = Новый Цвет(255, 238, 149);
		
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Принята") Тогда
		Цвет = Новый Цвет(47, 182, 68);
		
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Отклонена") Тогда
		Цвет = Новый Цвет(241, 23, 22);
		
	Иначе
		Цвет = Новый Цвет(242, 242, 242);
		
	КонецЕсли;
	
	Возврат Цвет;
	
КонецФункции

#КонецОбласти

#КонецЕсли
