
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Сделка"					, ЭтотОбъект.Сделка);
	Параметры.Свойство("Контрагент"				, ЭтотОбъект.Контрагент);
	Параметры.Свойство("ИмяЗавершающегоЭтапа"	, ЭтотОбъект.ИмяЗавершающегоЭтапа);
	
	Если Параметры.Свойство("ИдентификаторСделки") Тогда
		ЭтотОбъект.Сделка	 = Справочники.Сделки.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметры.ИдентификаторСделки));
		ПолучатьКлиента		 = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Сделка) Тогда
		// Закешируем данные сделки
		ИменаПолей = "ВидСделки, ЭтапСделки, ЭтапОтказа, РезультатСделки, ПричинаОтказа, Наименование" + ?(ПолучатьКлиента = Истина, ", Контрагент", "");
		СтруктураОсновныхРеквизитов = ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(ЭтотОбъект.Сделка, ИменаПолей);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураОсновныхРеквизитов);
		ЭтаФорма.Заголовок = СтруктураОсновныхРеквизитов.Наименование;		
	КонецЕсли;
	
	ЭтоПервичныйПовторныйПациент = ВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты");
	
	Если ИмяЗавершающегоЭтапа = "Успех" Тогда 
		Элементы.ГруппаУспешноОтказ.Видимость  = Ложь;
		Элементы.ГруппаПричинаОтказа.Видимость = Ложь;
		Элементы.ГруппаРеализация.Видимость    = Истина;
	ИначеЕсли ИмяЗавершающегоЭтапа = "Отказ" Тогда 
		Элементы.ГруппаУспешноОтказ.Видимость  = Ложь;
		Элементы.ГруппаПричинаОтказа.Видимость = Истина;
		Элементы.ГруппаРеализация.Видимость    = Ложь;
		УправлениеИнтерфейсамиСервер.ЗаполнитьТаблицуПричинОтказов(ЭтаФорма, ВидСделки, ПричиныПредопределены);
	Иначе
		СтруктураНаименований = Справочники.ВидыСделок.ПолучитьНаименованияЗавершающихЭтаповСделки(ЭтотОбъект.Сделка);
		Элементы.РезультатСделкиУспешно.Заголовок 	= СтруктураНаименований.НаименованиеЭтапаУспех;
		Элементы.РезультатСделкиОтказ.Заголовок 	= СтруктураНаименований.НаименованиеЭтапаОтказ;
	КонецЕсли;
	
	//ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Процедура, обработчик события "СписокПричинОтказаВыбор".
//
Процедура СписокПричинОтказаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РезультатЗакрытия = СписокПричинОтказаВыборНаСервере(ВыбраннаяСтрока);
	ЭтаФорма.Закрыть(РезультатЗакрытия);

КонецПроцедуры

&НаСервере
// Процедура, продолжение обработчика события на сервере "СписокПричинОтказаВыбор".
//
Функция СписокПричинОтказаВыборНаСервере(ВыбраннаяСтрока)
		
	ПредставлениеВыбранногоЗначения = ЭтотОбъект.ПричиныОтказов[ВыбраннаяСтрока].Значение;
	РезультатФормы = Новый Структура();
	РезультатФормы.Вставить("РезультатСделки"	, Перечисления.РезультатыСделок.Отказ);
	РезультатФормы.Вставить("ПричинаОтказа"		, ПредставлениеВыбранногоЗначения);
	РезультатФормы.Вставить("ЭтапСделки"		, Справочники.ЭтапыСделок.Отказ);
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ЭтапОтказа) Тогда
		РезультатФормы.Вставить("ЭтапОтказа", ЭтотОбъект.ЭтапСделки);
	КонецЕсли;
	
	Возврат РезультатФормы;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды "РезультатСделкиУспешно".
//
Процедура РезультатСделкиУспешно(Команда)
	
	Элементы.ГруппаУспешноОтказ.Видимость  = Ложь;
	Элементы.ГруппаПричинаОтказа.Видимость = Ложь;
	Элементы.ГруппаРеализация.Видимость    = Истина;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "РезультатСделкиОтказ".
//
Процедура РезультатСделкиОтказ(Команда)
	
	Элементы.ГруппаУспешноОтказ.Видимость  = Ложь;
	Элементы.ГруппаПричинаОтказа.Видимость = Истина;
	Элементы.ГруппаРеализация.Видимость    = Ложь;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события команды "ВыбратьРеализацию".
//
Процедура ВыбратьРеализацию(Команда)
		
	НовоеОповещение = Новый ОписаниеОповещения("ВыбратьПриемЗавершение", ЭтотОбъект);
	
	МассивСделок = Новый Массив();
	МассивСделок.Добавить(ЭтотОбъект.Сделка);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Контрагент"			, ЭтотОбъект.Контрагент);
	ПараметрыФормы.Вставить("ВключатьПакетИЧленство", Истина);
	ПараметрыФормы.Вставить("РеализацияБезСделки"	, Истина);
	ПараметрыФормы.Вставить("МассивСделок"			, МассивСделок);
	
	ОткрытьФорму("Документ.Прием.ФормаВыбора",ПараметрыФормы,,,,,НовоеОповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура, ВыбратьПриемЗавершение.
//
Процедура ВыбратьПриемЗавершение(Результат, ДопПараметры) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;		
	КонецЕсли;
	
	РезультатЗакрытия = РезультатСделкиУспешноНаСервере(Результат);
	ЭтаФорма.Закрыть(РезультатЗакрытия);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события команды "СоздатьРеализацию".
//
Процедура СоздатьРеализацию(Команда)
	
	Структура = Новый Структура();
	Структура.Вставить("Контрагент"			, ЭтотОбъект.Контрагент);
	Структура.Вставить("Сделка"	   			, ЭтотОбъект.Сделка);
	ПараметрыФормы  = Новый Структура("ЗначенияЗаполнения", Структура);	
	НовоеОповещение = Новый ОписаниеОповещения("СоздатьПриемЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.Прием.Форма.ФормаДокумента",ПараметрыФормы,,,,,НовоеОповещение);
	
КонецПроцедуры

&НаКлиенте
// Процедура, СоздатьПриемЗавершение.
//
Процедура СоздатьПриемЗавершение(Результат, ДопПараметры) Экспорт
	
	Прием = ПолучитьПоследнююПриемПоСделке(ЭтотОбъект.Сделка);
	РезультатЗакрытия = Неопределено;
	Если ЗначениеЗаполнено(Прием) Тогда
		РезультатЗакрытия = РезультатСделкиУспешноНаСервере(Прием);
	КонецЕсли;
	
	ЭтаФорма.Закрыть(РезультатЗакрытия);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, продолжение обработчика события на сервере "РезультатСделкиУспешно".
//
Функция РезультатСделкиУспешноНаСервере(Прием = Неопределено)
	
	Результат = Новый Структура();
	Результат.Вставить("РезультатСделки"	, Перечисления.РезультатыСделок.Успех);
	Результат.Вставить("ЭтапУспеха"			, ЭтотОбъект.ЭтапСделки);
	Результат.Вставить("ЭтапСделки"			, Справочники.ЭтапыСделок.Успех);
	Результат.Вставить("ПричинаОтказа"		, Неопределено);
	Результат.Вставить("Прием"				, Прием);
	
	Возврат Результат;	

КонецФункции

&НаСервере
// Процедура, заполняет список значений формы "ПричиныОтказов".
//
Процедура ЗаполнитьПричиныОтказа()
	
	ЭтотОбъект.ПричиныОтказов.Очистить();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПричиныОтказов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПричиныОтказов КАК ПричиныОтказов
	|ГДЕ
	|	НЕ ПричиныОтказов.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПричиныОтказов.Наименование");
	
	ЭтотОбъект.ПричиныОтказов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, ПолучитьПоследнююПриемПоСделке.
//
Функция ПолучитьПоследнююПриемПоСделке(Сделка)
	
	Если НЕ ЗначениеЗаполнено(Сделка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Прием.Ссылка КАК Продажа
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Сделка = &Сделка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Прием.Дата УБЫВ";
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗначениеВозврата = ?( Выборка.Следующий(), Выборка.Продажа, Неопределено);
	
	Возврат ЗначениеВозврата;
		
КонецФункции

#КонецОбласти