#Область СлужебныйПрограммныйИнтерфейс

// Активизирует обработчик ожидания, проверяющий текущие напоминания пользователя.
//
Процедура ПослеНачалаРаботыСистемы() Экспорт
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиентаПриЗапуске();
	Если НЕ ПараметрыРаботыКлиента.ДоступноИспользованиеРазделенныхДанных Тогда
		Возврат;
	КонецЕсли;
	
	////Если НЕ ОбщегоНазначения.ПолучитьЗначениеКонстанты("РежимОтладки")  Тогда 
	//	ПодключитьОбработчикОжидания("ПроверитьТекущиеНапоминания", 60, Истина); // Через 60 секунд после запуска клиента.
	//Иначе
	//	//Николаева
		ПодключитьОбработчикОжидания("ПроверитьТекущиеНапоминанияВзаимодействий", 5, Истина); // Через 60 секунд после запуска клиента.
	//КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
