
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
	Если Параметры.Свойство("ПолисМедСтрахования") Тогда
		ЭтотОбъект.СтраховаяКомпания 	= Параметры.ПолисМедСтрахования.СтраховаяКомпания;
		ЭтотОбъект.Договор 				= Параметры.ПолисМедСтрахования.Договор;
	Иначе
		Параметры.Свойство("СтраховаяКомпания"	, ЭтотОбъект.СтраховаяКомпания); 
		Параметры.Свойство("Договор"			, ЭтотОбъект.Договор); 
	КонецЕсли; 
	
	Параметры.Свойство("Номенклатура"		, ЭтотОбъект.Номенклатура); 
	Параметры.Свойство("ОстатокУслуг"		, ЭтотОбъект.ОстатокУслуг);
	Параметры.Свойство("СтатусСогласования"	, ЭтотОбъект.СтатусСогласования);
	Параметры.Свойство("Зуб"				, ЭтотОбъект.Зуб);
	Параметры.Свойство("Контрагент"			, ЭтотОбъект.Контрагент);
	Параметры.Свойство("Комментарий"		, ЭтотОбъект.Комментарий);
	
	ТаблицаИнформацияПоНоменклатуре = ПолучитьИнформациюПоНоменклатуре(Параметры.Номенклатура, ЭтотОбъект.Договор);
	Для каждого СтрокаТаблицы Из ТаблицаИнформацияПоНоменклатуре Цикл 
		ЭтотОбъект.ОписаниеОграничения = ПолучитьПредставлениеОграниченияЗуба(СтрокаТаблицы);
	КонецЦикла; 
	
	УстановитьСовйстваЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды формы "Добавить".
//
Процедура Добавить(Команда)
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("СтатусСогласования"			, ЭтотОбъект.СтатусСогласования);	
	СтруктураВозврата.Вставить("КомментарийСогласования"	, ЭтотОбъект.Комментарий);	
    ЭтаФорма.Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды формы "ИзменитьСтатусСогласования".
//
Процедура ИзменитьСтатусСогласования(Команда)
	
	НеактивныеЭлементы = Новый Массив;
	НеактивныеЭлементы.Добавить(Элементы.ГруппаСтатусОжидает);
	НеактивныеЭлементы.Добавить(Элементы.ГруппаСтатусСогласован);
	НеактивныеЭлементы.Добавить(Элементы.ГруппаСтатусОтказ);
	
	Если ТекущийЭлемент.Имя = "УстановитьСтатусОжидает" Тогда
		
		ЭтотОбъект.СтатусСогласования = ПредопределенноеЗначение("Перечисление.СтатусыСогласованияСтраховыхУслуг.ОжидаетСогласования");
		АктивныйЭлемент = Элементы.ГруппаСтатусОжидает;
		
	ИначеЕсли ТекущийЭлемент.Имя = "УстановитьСтатусСогласован" Тогда
		
		ЭтотОбъект.СтатусСогласования = ПредопределенноеЗначение("Перечисление.СтатусыСогласованияСтраховыхУслуг.Согласован");
		АктивныйЭлемент = Элементы.ГруппаСтатусСогласован;
		
	ИначеЕсли ТекущийЭлемент.Имя = "УстановитьСтатусОтказ" Тогда
		
		ЭтотОбъект.СтатусСогласования = ПредопределенноеЗначение("Перечисление.СтатусыСогласованияСтраховыхУслуг.Отказ");
		АктивныйЭлемент = Элементы.ГруппаСтатусОтказ;
		
	КонецЕсли;
	
	ИндексЭлемента = НеактивныеЭлементы.Найти(АктивныйЭлемент);
	Если ИндексЭлемента <> Неопределено Тогда
		НеактивныеЭлементы.Удалить(ИндексЭлемента);
	КонецЕсли;
	
	ИзменитьАктивностьПереключателяФормы(АктивныйЭлемент, НеактивныеЭлементы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Функция - Получить информацию по номенклатуре.
//
Функция ПолучитьИнформациюПоНоменклатуре(знач Номенклатура, знач Договор)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДоговорыКонтрагентовУслугиПоДоговору.Номенклатура КАК Номенклатура,
	|	ДоговорыКонтрагентовУслугиПоДоговору.Согласование КАК Согласование,
	|	ДоговорыКонтрагентовУслугиПоДоговору.Количество КАК Количество,
	|	ДоговорыКонтрагентовУслугиПоДоговору.КоличествоПриПревышении КАК КоличествоПриПревышении,
	|	ДоговорыКонтрагентовУслугиПоДоговору.КлючСтроки КАК КлючСтроки,
	|	ЕСТЬNULL(ДоговорыКонтрагентовОграничениеЗубов.КоличествоЗубов, 0) КАК КоличествоЗубов,
	|	ЕСТЬNULL(ДоговорыКонтрагентовОграничениеЗубов.КоличествоВПриеме, 0) КАК КоличествоВПриеме,
	|	ЕСТЬNULL(ДоговорыКонтрагентовОграничениеЗубов.НаименованиеОграничения, """") КАК НаименованиеОграничения
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.УслугиПоДоговору КАК ДоговорыКонтрагентовУслугиПоДоговору
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ОграничениеЗубов КАК ДоговорыКонтрагентовОграничениеЗубов
	|		ПО ДоговорыКонтрагентовУслугиПоДоговору.Ссылка = ДоговорыКонтрагентовОграничениеЗубов.Ссылка
	|			И ДоговорыКонтрагентовУслугиПоДоговору.КлючСтроки = ДоговорыКонтрагентовОграничениеЗубов.КлючСтроки
	|ГДЕ
	|	ДоговорыКонтрагентовУслугиПоДоговору.Номенклатура = &Номенклатура
	|	И ДоговорыКонтрагентовУслугиПоДоговору.Ссылка = &Договор";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Договор", Договор);
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

&НаСервере
// Функция - возвращает наименование ограничения зубов в приеме.
//
Функция ПолучитьПредставлениеОграниченияЗуба(СтрокаТаблицы)
	
	СтрокаСЧисломЗубов = СтрокаСЧислом(";%1 зуб;;%1 зуба;%1 зубов;%1 зуба", СтрокаТаблицы.КоличествоЗубов, ВидЧисловогоЗначения.Количественное, "L=ru"); 
	
	Если СтрокаТаблицы.КоличествоВПриеме > 0 Тогда    
		СтрокаСЧисломПриемы	= СтрШаблон(", но не более %1 в приеме", СтрокаТаблицы.КоличествоВПриеме);
	Иначе
		СтрокаСЧисломПриемы = "";
	КонецЕсли;
				
	Количество = ?(СтрокаТаблицы.Количество > 0, СтрокаТаблицы.Количество, "Неограничено");
	
	Если СтрокаТаблицы.Согласование = Перечисления.ТипыСогласованийУслугСтраховойКомпании.ПриПревышении Тогда
		СогласованиеСтрока = СтрШаблон("%1, услуг %2", СтрокаТаблицы.Согласование, СтрокаТаблицы.КоличествоПриПревышении);	
	Иначе
		СогласованиеСтрока = Строка(СтрокаТаблицы.Согласование);
	КонецЕсли;

	Если СтрокаТаблицы.КоличествоЗубов > 0 Тогда
		
		Возврат СтрШаблон("%1 
						|на %2%3
						|не более услуг: %4
						|требует согласования: %5", СтрокаТаблицы.НаименованиеОграничения, СтрокаСЧисломЗубов, СтрокаСЧисломПриемы, Количество, СогласованиеСтрока);
	Иначе		
		
		Возврат СтрШаблон("%1 
						|не более услуг: %2
						|требует согласования: %3", СтрокаТаблицы.НаименованиеОграничения, Количество, СогласованиеСтрока);
		
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
// Процедура, изменяет видимость групп переключателей.
//
Процедура ИзменитьАктивностьПереключателяФормы(АктивныйЭлемент = Неопределено, НеактивныйЭлемент = Неопределено, Активировать = Истина)
	
	УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(АктивныйЭлемент, НеактивныйЭлемент, Активировать, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
// Процедура, изменяет видимость групп переключателей.
//
Процедура ИзменитьАктивностьПереключателяФормыНаСервере(АктивныйЭлемент = Неопределено, НеактивныйЭлемент = Неопределено, Активировать = Истина)
	
	УправлениеИнтерфейсамиСервер.ИзменитьАктивностьПереключателяФормы(АктивныйЭлемент, НеактивныйЭлемент, Активировать, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
// Процедура, устанавливает активность тумблеров.
//
Процедура УстановитьАктивностьТумблеров()
	
	НеактивныеЭлементы = Новый Массив;
	НеактивныеЭлементы.Добавить(Элементы.ГруппаСтатусОжидает);
	НеактивныеЭлементы.Добавить(Элементы.ГруппаСтатусСогласован);
	НеактивныеЭлементы.Добавить(Элементы.ГруппаСтатусОтказ);

	Если ЭтотОбъект.СтатусСогласования = Перечисления.СтатусыСогласованияСтраховыхУслуг.Согласован Тогда
		АктивныйЭлемент = Элементы.ГруппаСтатусСогласован;
	ИначеЕсли ЭтотОбъект.СтатусСогласования = Перечисления.СтатусыСогласованияСтраховыхУслуг.Отказ Тогда
		АктивныйЭлемент = Элементы.ГруппаСтатусОтказ;
	Иначе
		АктивныйЭлемент = Элементы.ГруппаСтатусОжидает;
		ЭтотОбъект.СтатусСогласования = Перечисления.СтатусыСогласованияСтраховыхУслуг.ОжидаетСогласования;		
	КонецЕсли;
	
	ИндексЭлемента = НеактивныеЭлементы.Найти(АктивныйЭлемент);
	Если ИндексЭлемента <> Неопределено Тогда
		НеактивныеЭлементы.Удалить(ИндексЭлемента);
	КонецЕсли;
	
	ИзменитьАктивностьПереключателяФормыНаСервере(АктивныйЭлемент, НеактивныеЭлементы);
		
КонецПроцедуры

&НаСервере
// Процедура - Установить совйства элементов формы.
//
Процедура УстановитьСовйстваЭлементовФормы()
		
	РольСогласованиеСтраховыхУслуг = РольДоступна("СогласованиеСтраховыхУслуг");
	
	Элементы.ГруппаВыборИнтервалаЗаписи.Доступность = РольСогласованиеСтраховыхУслуг;
	
	Если (Параметры.Свойство("РежимРедактировать")
		И Параметры.РежимРедактировать = Истина)
		И НЕ РольСогласованиеСтраховыхУслуг Тогда
		
		Элементы.ГруппаФормаКнопкаДобавить.Доступность 	= Ложь;
		Элементы.ГруппаФормаКнопкаДобавить.ЦветФона 	= ЦветаСтиля.ЦветРамки;
		
	КонецЕсли; 	
	
	УстановитьАктивностьТумблеров();

КонецПроцедуры

#КонецОбласти