
#Область ОбработчикиСобытий

// Процедура, обработчик события "ОбработкаПроверкиЗаполнения".
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка дублирования номеров
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВнутреннийНомер", ВнутреннийНомер);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТелефонныеАппараты.Ссылка
	|ИЗ
	|	Справочник.ТелефонныеАппараты КАК ТелефонныеАппараты
	|ГДЕ
	|	ТелефонныеАппараты.ПометкаУдаления = ЛОЖЬ
	|	И ТелефонныеАппараты.Ссылка <> &Ссылка
	|	И ТелефонныеАппараты.ВнутреннийНомер = &ВнутреннийНомер";
	ДублированиеПоВнутреннимНомерам = Запрос.Выполнить().Выгрузить();
	Если ДублированиеПоВнутреннимНомерам.Количество() > 0 Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Номер телефона уже используется в '; en = 'The phone number is already in use'") + ДублированиеПоВнутреннимНомерам[0].Ссылка);
	КонецЕсли;	
	
	// Проверка дублирования рабочих мест и сотрудников
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	СписокОбъектов = ОбъектыПривязки.ВыгрузитьКолонку("Объект");
	Если СписокОбъектов.Количество() > 0 
		И ТипЗнч(СписокОбъектов[0]) = Тип("СправочникСсылка.РабочиеМеста") Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СписокОбъектов", СписокОбъектов);	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТелефонныеАппараты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТелефонныеАппараты КАК ТелефонныеАппараты
	|ГДЕ
	|	ТелефонныеАппараты.ПометкаУдаления = ЛОЖЬ
	|	И ТелефонныеАппараты.Ссылка <> &Ссылка
	|	И ТелефонныеАппараты.ОбъектыПривязки.Объект В(&СписокОбъектов)";
	ДублированиеПоРабочимМестам = Запрос.Выполнить().Выгрузить();
	Если ДублированиеПоРабочимМестам.Количество() > 0 Тогда
		Отказ = Истина;
		Текст = ?(ПривязанКСотрудникам, НСтр("ru = 'Сотрудник уже указан в '; en = 'The employee is already indicated in '"), НСтр("ru = 'Рабочее место уже указано в '; en = 'The workplace is already indicated in '"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст + ДублированиеПоРабочимМестам[0].Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти