
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Дата"              , Дата);
	Параметры.Свойство("Клиент"            , Клиент);
	Параметры.Свойство("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Параметры.Свойство("Документ"          , ВозвратОтПокупателя);
	Параметры.Свойство("Реализация"        , Реализация);
	
	ЗаполнитьДеревоВозвратов();
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "ПриИзменении."
//
Процедура НоменклатураПриИзменении(Элемент)
		
	ОбновитьВидимостьДерева();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "АвтоПодбор".
//
Процедура НоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Фильтр = Текст;
	WSHShell = Новый COMОбъект("WScript.Shell");
	WSHShell.SendKeys("{Right}"); 
	ОбновитьВидимостьДерева();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаВозвратов

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ТаблицаВозвратовФлагПриИзменении(Элемент)
	
	Если Элементы.ТаблицаВозвратов.ТекущиеДанные.Флаг = 2 Тогда
		Элементы.ТаблицаВозвратов.ТекущиеДанные.Флаг = 0;
	КонецЕсли;
	
	Если Элементы.ТаблицаВозвратов.ТекущиеДанные.ЭтоГруппа Тогда
		СтрокаРодитель = ТаблицаВозвратов.НайтиПоИдентификатору(Элементы.ТаблицаВозвратов.ТекущиеДанные.ПолучитьИдентификатор()).ПолучитьЭлементы();
		Для Каждого СтрокаТЧ из СтрокаРодитель Цикл
			СтрокаТЧ.Флаг = Элементы.ТаблицаВозвратов.ТекущиеДанные.Флаг;
		КонецЦикла;
		СнятьФлаги(ТаблицаВозвратов.НайтиПоИдентификатору(Элементы.ТаблицаВозвратов.ТекущиеДанные.ПолучитьИдентификатор()));
	Иначе
		СтрокаРодитель = ТаблицаВозвратов.НайтиПоИдентификатору(Элементы.ТаблицаВозвратов.ТекущиеДанные.ПолучитьИдентификатор()).ПолучитьРодителя();
		СнятьФлаги(СтрокаРодитель);		
		КоличествоФлагов = 0;
		Для Каждого СтрокаТЧ из СтрокаРодитель.ПолучитьЭлементы() Цикл
			Если СтрокаТЧ.Флаг Тогда
				 КоличествоФлагов = КоличествоФлагов + 1;
			КонецЕсли;			
		КонецЦикла;
		Если КоличествоФлагов = 0 Тогда
			СтрокаРодитель.Флаг = 0;
		ИначеЕсли  КоличествоФлагов = СтрокаРодитель.ПолучитьЭлементы().Количество() Тогда
			СтрокаРодитель.Флаг = 1;
		Иначе
			СтрокаРодитель.Флаг = 2;
		КонецЕсли; 		
	КонецЕсли;     	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "Выбор".
//
Процедура ТаблицаВозвратовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТаблицаВозвратовДокументПродажи" Тогда
		ПоказатьЗначение(, Элементы.ТаблицаВозвратов.ТекущиеДанные.ДокументПродажи);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура Выбрать(Команда)
	
	МассивСтрокВыбраннойНоменклатуры 	= Новый Массив;
//	МассивСкидок						= Новый Массив; 
	ДокументОснования = Неопределено;
	
	Для Каждого СтрокаРодитель Из ТаблицаВозвратов.ПолучитьЭлементы() Цикл
		
		Если СтрокаРодитель.Флаг = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаДерево из СтрокаРодитель.ПолучитьЭлементы() Цикл
			
			Если СтрокаДерево.Флаг = 1 И Не СтрокаДерево.Видимость Тогда
				
				Структура = Новый Структура("ОснованиеВозврата, Номенклатура, Партия, Упаковка, Количество,
											|КоличествоУпаковок, Цена, Сумма, Всего, Сотрудник,
											|СуммаРучнойСкидки, СуммаАвтоматическойСкидкиНаценки, Склад, 
											|КлючСтроки, СтавкаНДС, СуммаНДС, ТипНоменклатуры");
				ЗаполнитьЗначенияСвойств(Структура, СтрокаДерево);			
				Структура.ОснованиеВозврата = СтрокаДерево.ДокументПродажи;				
				ДокументОснования = СтрокаДерево.ДокументПродажи;
				МассивСтрокВыбраннойНоменклатуры.Добавить(Структура);								

				//НайденныеСтроки = ТаблицаСкидок.НайтиСтроки(Новый Структура("КлючСтроки", СтрокаДерево.КлючСтроки));
				//
				//Для Каждого СтрокаМ Из НайденныеСтроки Цикл
				//	Структура = Новый Структура("КлючСтроки, НоменклатураСкидки, СкидкаНаценка, Сумма, ПризнакОплатыБонусом, БонусныйСчет");
				//	ЗаполнитьЗначенияСвойств(Структура, СтрокаМ);
				//	МассивСкидок.Добавить(Структура);
				//КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура("МассивСтрокВыбраннойНоменклатуры, ДокументОснования",
										 МассивСтрокВыбраннойНоменклатуры, ДокументОснования);
	ЭтаФорма.Закрыть(СтруктураВозврата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура, снимает флаги в дереве.
//
Процедура СнятьФлаги(СтрокаРодитель)
	
	Для Каждого СтрокаТВ из ТаблицаВозвратов.ПолучитьЭлементы() Цикл
		Если СтрокаТВ = СтрокаРодитель Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТВ.Флаг = 0;
		Для Каждого СтрокаДерево из СтрокаТВ.ПолучитьЭлементы() Цикл
			СтрокаДерево.Флаг = 0;
		КонецЦикла;		
	КонецЦикла;  
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет заполнение дерева возвратов.
//
Процедура ЗаполнитьДеревоВозвратов()
	
	ДанныеВозврата = Документы.ВозвратОтПокупателя.ПолучитьОбъединеннуюТаблицуДанныхВозврата(СтруктурнаяЕдиница, Клиент,, Дата, Реализация, ВозвратОтПокупателя);
	
	ДанныеВозвратаГруппировка = ДанныеВозврата.Скопировать();
	ДанныеВозвратаГруппировка.Свернуть("ДокументПродажи, ДокументПродажиПредставление","Сумма");
				
	ТаблицаВозвратов.ПолучитьЭлементы().Очистить();
	Для Каждого СтрокаВозвратаГруппировки ИЗ ДанныеВозвратаГруппировка Цикл
		
		Если СтрокаВозвратаГруппировки.Сумма <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРодитель = ТаблицаВозвратов.ПолучитьЭлементы().Добавить();
		СтрокаРодитель.ДокументПродажи = СтрокаВозвратаГруппировки.ДокументПродажи;
		СтрокаРодитель.НаименованиеДокументПродажи = СтрокаВозвратаГруппировки.ДокументПродажиПредставление;
		СтрокаРодитель.ЭтоГруппа = Истина;
		СтрокаРодитель.Картинка = 5;

		Для Каждого СтрокаВозврата ИЗ ДанныеВозврата.НайтиСтроки(Новый Структура("ДокументПродажи", СтрокаВозвратаГруппировки.ДокументПродажи)) Цикл

			СтрокаДерева = СтрокаРодитель.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаВозврата); 			
			СтрокаДерева.Картинка = 2;
						
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет обработку дерева.
//
Процедура ОбновитьВидимостьДерева()
	
	Для Каждого СтрокаРодитель из ТаблицаВозвратов.ПолучитьЭлементы() Цикл
		КоличествоФлагов = 0;
		Для Каждого СтрокаДерева из СтрокаРодитель.ПолучитьЭлементы() Цикл
			Если Фильтр = "" Тогда
				СтрокаДерева.Видимость = Ложь;
				Продолжить;
			КонецЕсли;
			Если СтрЧислоВхождений(НРег(СтрокаДерева.Номенклатура), НРег(Фильтр)) = 0 Тогда
				СтрокаДерева.Видимость = Истина;
				КоличествоФлагов = КоличествоФлагов + 1;
			Иначе
				СтрокаДерева.Видимость = Ложь;
			КонецЕсли;  			 
		КонецЦикла;
		Если КоличествоФлагов = СтрокаРодитель.ПолучитьЭлементы().Количество() Тогда
			СтрокаРодитель.Видимость = Истина;
		Иначе
			СтрокаРодитель.Видимость = Ложь;
		КонецЕсли;		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
