
#Область ОбработчикиСобытий

// Процедура - Перед записью.
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПередЗаписью(Отказ)
	
	Если Не ЗначениеЗаполнено(ЦветФона) Тогда
		ЦветФона = ЗначениеВСтрокуВнутр(Новый Цвет()); 
	КонецЕсли;
	
	Если ЦветФона <> ЭтотОбъект.Ссылка.ЦветФона Тогда
		
		ЦветТекста = ОбщегоНазначенияВызовСервера.ПолучитьЦветТекстаПоЦветуФона(ЗначениеИзСтрокиВнутр(ЦветФона));
		
		Если ЦветТекста = Новый Цвет(64, 64, 64) 
			Или ЦветТекста = Новый Цвет(128, 128, 128) Тогда
			
			ЦветТекстаБелый = Ложь;	
		Иначе
			ЦветТекстаБелый = Истина;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти
