
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере" ФормыЭлемента
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("Сотрудник", Параметры.Сотрудник); 
	ТекущийСотрудник = Параметры.Сотрудник;
	
	ПеречислениеТипФормированияВРучную = Перечисления.СпособыФормированияСегментов.ФормироватьВручную;
	
КонецПроцедуры

&НаКлиенте
// Процедура - При открытии
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура обработчик команды УдалитьИзСегмента
//
Процедура УдалитьИзСегмента(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьИзСегментаЗавершение", ЭтотОбъект), "Вы хотите удалить текущего сотрудника из сегмента """ + Элементы.Список.ТекущиеДанные.Сегмент + """ ?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Удалить из сегмента завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура УдалитьИзСегментаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Элементы.Список.ТекущиеДанные = Неопределено ИЛИ РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьСотрудникаИзСегмента(Элементы.Список.ТекущиеДанные.Сегмент);
	ОбновитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
// Процедура обработчик команды ДобавитьВСегмент
//
Процедура ДобавитьВСегмент(Команда)
	
	ПараметрыОткрытия = Новый Структура("Отбор", Новый Структура("СпособФормирования", ПеречислениеТипФормированияВРучную));
	Оповещение = Новый ОписаниеОповещения("ДобавитьВСегментЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.СегментыСотрудников.ФормаВыбора",
	ПараметрыОткрытия,,,,,
	Оповещение, 
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
// Процедура - После добавления сегмента
//
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
//
Процедура ДобавитьВСегментЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ДобавитьСотрудникаВСегмент(Результат);
		ОбновитьВидимостьЭлементов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура - Удалить сотрудника из сегмента
//
// Параметры:
//  Сегмент	 - 	 - 
//
Процедура УдалитьСотрудникаИзСегмента(Сегмент)
	
	Если Не ЗначениеЗаполнено(ТекущийСотрудник) Тогда
		Возврат;
	КонецЕсли;	
		
	РегистрыСведений.СотрудникиСегмента.УдалитьСотрудникаИзСегмента(Сегмент, ТекущийСотрудник);
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
// Процедура - Добавить сотрудника в сегмент
//
// Параметры:
//  Сегмент	 - 	 - 
//
Процедура ДобавитьСотрудникаВСегмент(Сегмент)
	
	Если Сегмент.Пустая() Или Не ЗначениеЗаполнено(ТекущийСотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СотрудникиСегмента.ДобавитьСотрудникаВСегмент(Сегмент, ТекущийСотрудник);
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработчик события "Выбор" табличного поля.
//
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбранныеДанные = Элемент.ТекущиеДанные;
	Если ВыбранныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("Ключ", Элемент.ТекущиеДанные.Сегмент);
	ФормаСегмента = ПолучитьФорму("Справочник.СегментыСотрудников.ФормаОбъекта", СтруктураПараметров);
	ФормаСегмента.Открыть();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "СписокПриАктивизацииСтроки" табличного поля.
//
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
// Процедура обновляет видимость и активность элементов формы.
//
Процедура ОбновитьВидимостьЭлементов()
	
	Элементы.ДобавитьВСегмент.Доступность = Истина;
	Элементы.УдалитьИзСегмента.Доступность = Истина;
	
	Если Элементы.Список.ТекущиеДанные = Неопределено тогда
		Элементы.УдалитьИзСегмента.Доступность = Ложь;
	КонецЕсли;	
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено И Элементы.Список.ТекущиеДанные.СегментСпособФормирования <> ПеречислениеТипФормированияВРучную тогда
		Элементы.УдалитьИзСегмента.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


