
&НаКлиенте
Перем ТекущееПолеВводаСерииСертификата;
&НаКлиенте
Перем ВнесеноПередРедактированием;
&НаКлиенте                                               
Перем ТекущееПолеВВодаСуммыОплаты;
&НаКлиенте
Перем ПредПолеВВодаСуммыОплаты;
&НаКлиенте
Перем ТекущееПолеВводаСБП;

#Область ОбработчикиСобытийФормы

&НаСервере
// Создание формы на сервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		                 
	ПараметрДокументыПродажи = Неопределено;
	ЗакрытьЗанятияБезЗапроса = Неопределено;
	Параметры.Свойство("Контрагент"               , ЭтотОбъект.Контрагент); 
	Параметры.Свойство("ВидОперации"              , ЭтотОбъект.ВидОперации);
	Параметры.Свойство("ДатаПродажи"              , ЭтотОбъект.ДатаПродажи);
	Параметры.Свойство("ДокументыПродажи"         , ПараметрДокументыПродажи);
    Параметры.Свойство("ОткрытиеИзФормыСписка"    , ОткрытиеИзФормыСписка);
	Параметры.Свойство("ЗакрытьФормуАвтоматически", ПараметрФормыЗакрыватьФормуПослеОплаты);
	
	ЭтотОбъект.ДатаПродажи               = ?(НЕ ЗначениеЗаполнено(ДатаПродажи),ТекущаяДатаСеанса(),ДатаПродажи);
	ЭтотОбъект.СтруктурнаяЕдиница        = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;	
	ЭтотОбъект.Сотрудник                 = ПараметрыСеанса.ТекущийСотрудник;
	ЭтотОбъект.ЗакрыватьФормуПослеОплаты = Параметры.Свойство("ЗакрытьФормуАвтоматически") ИЛИ ПараметрДокументыПродажи <> Неопределено;
	НеЗачислятьСдачуНаЛицевойСчет        = ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.НеЗачислятьСдачуНаЛицевойСчет, Ложь);
    УчитыватьАвансыВРазрезеДокументов    = Константы.УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов.Получить();
	РежимЗачисленияСдачи                 = Константы.ЗачислениеСдачиОтОплаты.Получить();

	// Подготовка массива документов для оплаты
	Если НЕ ПараметрДокументыПродажи = Неопределено Тогда
		Если ТипЗнч(ПараметрДокументыПродажи) = Тип("Массив") Тогда
			ДокументыЗадолженности.ЗагрузитьЗначения(ПараметрДокументыПродажи);
		Иначе
			ДокументыЗадолженности.Добавить(ПараметрДокументыПродажи);
			ДокументАванса = ПараметрДокументыПродажи;
			ЭтоВзносАванса = (ТипЗнч(ПараметрДокументыПродажи) = Тип("ДокументСсылка.НарядЗаказ") 
				Или ТипЗнч(ПараметрДокументыПродажи) = Тип("ДокументСсылка.ПланЛечения"));
		КонецЕсли;	 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументыЗадолженности) 
		И ТипЗнч(ДокументыЗадолженности[0].Значение) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
		ЭтотОбъект.ЭтоВозвратВДеньПродажи = НачалоДня(ДокументыЗадолженности[0].Значение.ДокументОснования.Дата) = НачалоДня(ТекущаяДатаСеанса());		
	КонецЕсли;	
	ЭтаФорма.Заголовок = ?(ЭтотОбъект.ВидОперации = Перечисления.ВидыОпераций.Продажа, "Оплата", "Возврат") 
					   + ?(ЗначениеЗаполнено(ЭтотОбъект.Контрагент), " пациента: " + ЭтотОбъект.Контрагент, "");	
	
	// Инициализация состояния формы
	ОбновитьФормуСервер("ПРИ_ЗАПУСКЕ", Истина);	
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();

	 		
КонецПроцедуры

&НаКлиенте
// Обработчик при открытии формы на клиенте.
//
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ТекущаяКасса)  Тогда
			
		Описание = "Оплата невозможна! Кассы доступные для текущего сотрудника недоступны на текущем рабочем месте.";
		ПоказатьОповещениеПользователя("Оплата",,Описание, БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное); 			

	КонецЕсли;

	Если ПечатьКопииЧекаКоличество = 0 Тогда 
		ПечатьКопииЧекаКоличество = 1;
	КонецЕсли;	
	
	УстановитьДоступностьЦветФонаОплатить();
	УстановитьАвтоВводСуммДляАвансов();	
	УстановитьКоличествоОбъектовПечатиПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ОбработкаОповещения".
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Работа с внешним оборудованием
	Если Источник = "ВнешнееОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "TracksData" Тогда
			
			ДанныеКарты = МенеджерОборудованияКлиент.ОбработатьДанныеМагнитнойКарты(Параметр);		   		   
			Если ЗначениеЗаполнено(ДанныеКарты.ТипДанных) Тогда
				ОбработатьДанныеСВнешнегоУстройстваСчитывания(ДанныеКарты);
			Иначе
				ПоказатьОповещениеПользователя("Оплата",,"Данная карта не зарегистрирован! Код: " + ДанныеКарты.КодШифра, БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное); 			
			КонецЕсли;
			
		КонецЕсли;		
	КонецЕсли;
	Если Источник = "ВнешнееОборудование" И ВводДоступен() Тогда
		
		Если ИмяСобытия = "ScanData" Тогда
			
			ДанныеШтрихКода = МенеджерОборудованияКлиент.ОбработатьДанныеШтрихКода(Параметр);	
			Если ЗначениеЗаполнено(ДанныеШтрихКода.ТипДанных) Тогда			
				ОбработатьДанныеСВнешнегоУстройстваСчитывания(ДанныеШтрихКода);		
			Иначе
				ПоказатьОповещениеПользователя("Оплата",,"Данный штрих-код не зарегистрирован! Код: " + ДанныеШтрихКода.КодШифра, БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное); 
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "СБП_УспешнаяОплата" ИЛИ ИмяСобытия = "СБП_ВозвратОплаты" Тогда
		ОбсужденияСистемыВзаимодействияКлиент.ОбработкаОповещенияОбУспешностиОплатыСБП(ЭтаФорма, Параметр, ИмяСобытия = "СБП_ВозвратОплаты");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Функция обрабатывает код карты, полученный от внешнего оборудования.
// 
Процедура ОбработатьДанныеСВнешнегоУстройстваСчитывания(СтруктураДанных) 
	
	Если СтруктураДанных.ТипДанных = "СЕРТИФИКАТ_НА_СУММУ" Тогда 	
		
		ОбработатьДанныеШтрихкодаСертификата(СтруктураДанных, Истина);
		
	Иначе 	
		
	    ПоказатьОповещениеПользователя("Оплата",,"Штрихкод не принадлежит сертификату на сумму средств!", БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное); 

	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
// Процедура - Обработать данные штрихкода сертификата.
// 
// Параметры:
//  СтруктураДанных	 - 	 - 
// 
Процедура ОбработатьДанныеШтрихкодаСертификата(СтруктураДанных, ВводСоСканера)
	
	ДанныеСертифиаката = ПолучитьДанныеСертификата(
		СтруктураДанных.Сертификат, 
		СтруктураДанных.ПартияСертификата, 
		ВводСоСканера, 
		СтруктурнаяЕдиница, 
		Контрагент);
		
	ДобавитьВыбранныйСертификатВВидыОплат(ДанныеСертифиаката);
	
КонецПроцедуры

&НаКлиенте
// Реинициализация формы, сброс всех выбранных параметров.
Процедура ОбновитьФорму(Режим = "", ОчиститьРеквизитыОплаты = Ложь, ИдентификаторТЗЗадолженностей = Неопределено)
	
	ОбновитьФормуСервер(Режим, ОчиститьРеквизитыОплаты, ИдентификаторТЗЗадолженностей);
	
КонецПроцедуры	

&НаСервере
// Реинициализация формы, сброс всех выбранных параметров.
Процедура ОбновитьФормуСервер(Режим = "", ОчиститьРеквизитыОплаты = Ложь, ИдентификаторТЗЗадолженностей = Неопределено)
	
	// Процедуры подготовки формы
	Если Режим = "ПРИ_ЗАПУСКЕ" Тогда   
		
		ПодготовкаТаблицыЗадолженностей();
		
		Если ЗначениеЗаполнено(ЭтотОбъект.Контрагент) Тогда
			
			КонтактнаяИнформация = ПолучитьКонтактнуюИнформациюКлиента(ЭтотОбъект.Контрагент);
			
			ЭтотОбъект.ЧекККТКонтактыКлиентаПочта   = КонтактнаяИнформация.Email;
			ЭтотОбъект.ЧекККТКонтактыКлиентаТелефон = КонтактнаяИнформация.Телефон;
			
		КонецЕсли; 
		
		ОбновитьСписокНаправленийКВрачам();
		
		ЭтотОбъект.ЧекПечатать = ?(ЗначениеЗаполнено(Этотобъект.ТекущаяКасса), Не ОбщегоНазначения.ПолучитьЗначениеРеквизита(Этотобъект.ТекущаяКасса, "ПриоритетЭлектронногоЧека"), Истина); 
		
		РасставитьПриоритетПечатиЧека();
		
	ИначеЕсли Режим = "ОБНОВИТЬ_ТАБЛИЦУ_ЗАДОЛЖЕННОСТЕЙ" Тогда
		
		ПодготовкаТаблицыЗадолженностей();
		
	ИначеЕсли Режим = "ОБНОВИТЬ_ВИДЫ_ОПЛАТ" Тогда
		
		УстановитьВидыОплатСервер();
		
	КонецЕсли;	
	
	Если НЕ Режим = "ОБНОВИТЬ_ВИДЫ_ОПЛАТ" Тогда
		
		Если ОчиститьРеквизитыОплаты Тогда
			
			ОчиститьВнесенныеВидыОплат();
			ЭтотОбъект.ОплатаВнесено = 0;
			ЭтотОбъект.ОплатаСдача   = 0;	
			
		КонецЕсли;
		
		УстановитьВидыОплатСервер(Режим = "ПРИ_ЗАПУСКЕ");
		
	КонецЕсли;
	
	УстановитьВидимостьЭлементов();	
	
	ПересчитатьСуммуКоплате();  
	
КонецПроцедуры

&НаСервере
// Функция, возвращает структуру контактной информации.
//
Функция ПолучитьКонтактнуюИнформациюКлиента(Клиент, ДобавитьКодСтраны = Ложь)
	
	EmailСтроки = Клиент.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
	Email = Неопределено;
	Если EmailСтроки.Количество() > 0 Тогда
	  Email = EmailСтроки[0].АдресЭП;
	КонецЕсли;
	
	ТелефонСтроки = Клиент.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
	НомерТелефона = Неопределено;
	Если ТелефонСтроки.Количество() > 0 Тогда
		
		НомерТелефона = ТелефонСтроки[0].НомерТелефона;
		
		СписокПолей = Новый СписокЗначений;
		УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(НомерТелефона, СписокПолей); 
		НомерТелефона = ?(ДобавитьКодСтраны, СписокПолей[0].Значение, "") + СписокПолей[1].Значение + СписокПолей[2].Значение;
		
	КонецЕсли;
	
	Возврат Новый Структура("Email, Телефон", Email, НомерТелефона);
	
КонецФункции

&НаСервере
// Процедура установки видимости и доступности элементов. 
// 
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.ГруппаПлательщик.Видимость               = Не ЗначениеЗаполнено(Контрагент);	
	Элементы.ПечатьКопииЧекаКоличество.Доступность	  = ПечатьКопииЧека;	
	Элементы.ПечатьКвитанций_Количество.Доступность   = ПечатьКвитанции;
	
	Если ВидОперации = Перечисления.ВидыОпераций.Возврат Тогда
		Элементы.ПечатьАктаОвыполненыхРаботах.Видимость = Ложь;
		Элементы.ПечатьКвитанции.Видимость              = Ложь;
		Элементы.ПечатьКвитанций_Количество.Видимость   = Ложь;
	КонецЕсли;

КонецПроцедуры

// Процедура - Пересчитать сумму коплате.
// 
&НаСервере
Процедура ПересчитатьСуммуКоплате()
	
	ЭтотОбъект.ОплатаСумма = 0;
	Для Каждого СтрокаТ ИЗ ЭтотОбъект.ТаблицаЗадолженностей Цикл				                          
		
		ЭтотОбъект.ОплатаСумма  = ЭтотОбъект.ОплатаСумма + ?(СтрокаТ.ПризнакВыбора, СтрокаТ.Задолженность, 0);		
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// При изменении выбора контрагента.
//
Процедура КонтрагентПриИзменении(Элемент)
	
    ОбновитьФорму("ОБНОВИТЬ_ТАБЛИЦУ_ЗАДОЛЖЕННОСТЕЙ",Истина);
	
КонецПроцедуры

// Процедура - Процедура обработки нажатия меню.
// 
// Параметры:
//  Элемент	 - 	 - 
// 
&НаКлиенте
Процедура ПриИзмененииВыбораКассыОплаты(Элемент)
	
	ТекущееПолеВводаСерииСертификата	= Неопределено;
	ТекущееПолеВВодаСуммыОплаты			= Неопределено;
	ПредПолеВВодаСуммыОплаты			= Неопределено;	
	
	ПриИзмененииВыбораКассыОплатыСервер(Элемент.Имя);
   	УстановитьДоступностьЦветФонаОплатить();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Чек печатать при изменении.
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ЧекПечататьПриИзменении(Элемент)
		
	Если ЭтотОбъект.ЧекПечатать = Ложь Тогда
		
		Если ЗначениеЗаполнено (ЭтотОбъект.ЧекККТКонтактыКлиентаПочта) Тогда
			
			Элементы.ГруппаКонтактыКлиентаПочта.Видимость 			= Истина;
			Элементы.КонтактыКлиентаИспользоватьПочту.Видимость 	= Ложь;
			ЭтотОбъект.ЧекККТОтправлятьЧекНаЭлПочту 				= Истина;
			
		ИначеЕсли ЗначениеЗаполнено (ЭтотОбъект.ЧекККТКонтактыКлиентаТелефон) Тогда
			
			Элементы.ГруппаКонтактыКлиентаТелефон.Видимость			= Истина;
			Элементы.КонтактыКлиентаИспользоватьТелефон.Видимость 	= Ложь;
			ЭтотОбъект.ЧекККТОтправлятьЧекНаТелефон 				= Истина;
		Иначе 
			ЭтотОбъект.ЧекПечатать = Истина;   			
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Нужно указать почту или телефон пациента для отправки электронного чека.';
															|en='You must specify the patient''s mail or phone number to send an electronic receipt.'"));	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиКонтактнойИнформацииКлиента

// Процедура - Контакты клиента использвоать телефон
// 
// Параметры:
//  Команда	 - 	 - 
// 
&НаКлиенте
Процедура КонтактыКлиентаИспользоватьТелефон(Команда)
	
	Элементы.ГруппаКонтактыКлиентаТелефон.Видимость       = Истина;
	Элементы.КонтактыКлиентаИспользоватьТелефон.Видимость = Ложь;
	
	ЭтотОбъект.ЧекККТОтправлятьЧекНаТелефон = Истина;
	
КонецПроцедуры

// Процедура - Контакты клиента удалить телефон
// 
// Параметры:
//  Команда	 - 	 - 
// 
&НаКлиенте
Процедура КонтактыКлиентаУдалитьТелефон(Команда)
	
	Элементы.ГруппаКонтактыКлиентаТелефон.Видимость       = Ложь;
	Элементы.КонтактыКлиентаИспользоватьТелефон.Видимость = Истина;
	
	ЭтотОбъект.ЧекККТОтправлятьЧекНаТелефон = Ложь;
	
	Если ЭтотОбъект.ЧекПечатать = Ложь И ЗначениеЗаполнено (ЭтотОбъект.ЧекККТКонтактыКлиентаПочта) Тогда
			
		Элементы.ГруппаКонтактыКлиентаПочта.Видимость 			= Истина;
		Элементы.КонтактыКлиентаИспользоватьПочту.Видимость 	= Ложь;
		ЭтотОбъект.ЧекККТОтправлятьЧекНаЭлПочту 				= Истина; 
		
	ИначеЕсли ЭтотОбъект.ЧекПечатать = Ложь Тогда
		
		ЭтотОбъект.ЧекПечатать = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Нужно указать почту или телефон пациента для отправки электронного чека.';
															|en='You must specify the patient''s mail or phone number to send an electronic receipt.'"));
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Контакты клиента использвоать почту
// 
// Параметры:
//  Команда	 - 	 - 
// 
&НаКлиенте
Процедура КонтактыКлиентаИспользоватьПочту(Команда)
	
	Элементы.ГруппаКонтактыКлиентаПочта.Видимость       = Истина;
	Элементы.КонтактыКлиентаИспользоватьПочту.Видимость = Ложь;
	
	ПодключитьОбработчикОжидания("УстановитьФокусПоляКонтактыКлиентаПочтаТаймер", 0.1, Истина);
	
	ЭтотОбъект.ЧекККТОтправлятьЧекНаЭлПочту = Истина;
	
КонецПроцедуры

// Процедура - Установить фокус поля контакты клиента почта таймер
// 
&НаКлиенте
Процедура УстановитьФокусПоляКонтактыКлиентаПочтаТаймер()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.КонтактыКлиентаПочта;
	
КонецПроцедуры

// Процедура - Контакты клиента удалить почту
// 
// Параметры:
//  Команда	 - 	 - 
// 
&НаКлиенте
Процедура КонтактыКлиентаУдалитьПочту(Команда)
	
	Элементы.ГруппаКонтактыКлиентаПочта.Видимость       = Ложь;
	Элементы.КонтактыКлиентаИспользоватьПочту.Видимость = Истина;

	ЭтотОбъект.ЧекККТОтправлятьЧекНаЭлПочту = Ложь;
	
	Если ЭтотОбъект.ЧекПечатать = Ложь И ЗначениеЗаполнено (ЭтотОбъект.ЧекККТКонтактыКлиентаТелефон) Тогда
		
		Элементы.ГруппаКонтактыКлиентаТелефон.Видимость			= Истина;
		Элементы.КонтактыКлиентаИспользоватьТелефон.Видимость 	= Ложь;
		ЭтотОбъект.ЧекККТОтправлятьЧекНаТелефон 				= Истина; 
		
	ИначеЕсли ЭтотОбъект.ЧекПечатать = Ложь Тогда
		
		ЭтотОбъект.ЧекПечатать = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Нужно указать почту или телефон пациента для отправки электронного чека.';
															|en='You must specify the patient''s mail or phone number to send an electronic receipt.'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Контакты клиента телефон при изменении.
// 
// Параметры:
//  Элемент	 - 	 - 
// 
Процедура КонтактыКлиентаТелефонПриИзменении(Элемент)
	
	КонтактыКлиентаТелефонПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
// Процедура - Контакты клиента телефон при изменении на сервере.
// 
// Параметры:
//  Элемент	 - 	 - 
// 
Процедура КонтактыКлиентаТелефонПриИзмененииСервер()
	
	СписокПолей = Новый СписокЗначений;
	УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(ЭтотОбъект.ЧекККТКонтактыКлиентаТелефон, СписокПолей); 
	ЭтотОбъект.ЧекККТКонтактыКлиентаТелефон = СписокПолей[1].Значение + СписокПолей[2].Значение;

КонецПроцедуры

#КонецОбласти

&НаКлиенте
// Печать копии чека.
//
Процедура ПечатьКопииЧекаПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СелекторВыбораКасс

#Область КонструкторСелектораКасс

// Процедура - Построить динаимческую таблицу задолженностей
// 
&НаСервере
Процедура ПостроитьДинамическиеЭлементыВыбораКасс()
	
	УдалитьДинамическиеЭлементыВыбораКасс();
			
	Индекс = 1;
	Пока Индекс < ЭтотОбъект.ДоступныеКассы.Количество()  Цикл

		ДанныеПоКассе =  ЭтотОбъект.ДоступныеКассы[Индекс];
		ПостроитьЭлементыВыбораКассы(ДанныеПоКассе, Индекс);
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Если ЭтотОбъект.ДоступныеКассы.Количество() > 0 Тогда
		
        УстановитьСостояниеКнопкиВыбораКассы(Элементы.ГруппаКассаОплатыКнопка_0, Элементы.КассаОплаты_0);
		ЭтотОбъект.ТекущаяКассаИспользуетсяККТ = ЭтотОбъект.ТекущаяКасса.ВнешнееОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
		
	Иначе
		
		Элементы.КассаОплаты_0.Заголовок = "Нет доступных касс у сотрудника";
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Установить состояние кнопки выбора кассы
// 
// Параметры:
//  ГруппаКнопки - 	 - 
//  КнопкаВыбора - 	 - 
// 
&НаСервере
Процедура УстановитьСостояниеКнопкиВыбораКассы(ГруппаКнопки, КнопкаВыбора)
	
	ИндексДанных = ИндексСтрокиДанныхПоИмениЭлемента(ГруппаКнопки.Имя);
	
	ДанныеКассы       = ЭтотОбъект.ДоступныеКассы[ИндексДанных];	
	ЭтоВыбраннаяКасса = ДанныеКассы.Касса = ЭтотОбъект.ТекущаяКасса;	
	
	ГруппаКнопки.ЦветФона = ?(ЭтоВыбраннаяКасса, ЦветаСтиля["ЦветАктивности"], Новый Цвет(255,255,255));
	
	КнопкаВыбора.Доступность = НЕ ЭтоВыбраннаяКасса И (ДанныеКассы.КассаДоступна ИЛИ ДанныеКассы.ИспользуетсяОнлайн);
	КнопкаВыбора.ЦветТекста  = ?(ЭтоВыбраннаяКасса, WebЦвета.Черный, Новый Цвет(51,102,187));	
	КнопкаВыбора.Заголовок   = ДанныеКассы.Касса.Наименование;
	
КонецПроцедуры

&НаСервере
// Процедура - Удалить динаимеческие элементы состав занятия
// 
// Параметры:
//  ИндексПервогоЭлемента	 - 	 - 
// 
Процедура УдалитьДинамическиеЭлементыВыбораКасс()
	
	ОсновнаяГруппа = ВыборКассРодительскаяГруппа();
	
	// Все оставльные
	Индекс = ОсновнаяГруппа.ПодчиненныеЭлементы.Количество() - 1;
	Пока Индекс > 0  Цикл
		
		Элементы.Удалить(ОсновнаяГруппа.ПодчиненныеЭлементы[Индекс]);
		
		Индекс = Индекс - 1;
		
	КонецЦикла;	
	
КонецПроцедуры

// Процедура - Построить строку динаимческой таблицы задолженностей
// 
// Параметры:
//  СтрокаТ	 - 	 - 
// 
&НаСервере
Процедура ПостроитьЭлементыВыбораКассы(ДанныеКассы, ИндексДанных)

	НомерСтрокиДан   = ИндексДанных;	
	ОсновнаяГруппа   = ВыборКассРодительскаяГруппа();
		
	ПодгруппаСтроки = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(
	ЭтаФорма,
	Элементы.ГруппаКассаОплаты_0,
	НомерСтрокиДан,
	ОсновнаяГруппа);
	
	ПодгруппаКнопки = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(
	ЭтаФорма,
	Элементы.ГруппаКассаОплатыКнопка_0,
	НомерСтрокиДан,
	ПодгруппаСтроки);
	
	КнопкаВыбораКассы = УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(
	ЭтаФорма,
	Элементы.КассаОплаты_0,
	НомерСтрокиДан,
	ПодгруппаКнопки,,
	ДанныеКассы.Касса.Наименование);	
	
	УстановитьСостояниеКнопкиВыбораКассы(ПодгруппаКнопки, КнопкаВыбораКассы);
	
КонецПроцедуры

// Функция - Выбор касс родительская группа
// 
// Возвращаемое значение:
//   - 
// 
&НаСервере
Функция ВыборКассРодительскаяГруппа()
	
	Возврат Элементы.ГруппаВыборКассыДляОплаты;
	
КонецФункции

#КонецОбласти

&НаСервере
// Процедура - Обновить выбор доступных касс
// 
// Параметры:
//  ДокументДляОплаты		 - 	 - 
//  КассыДляВсехДокументов	 - 	 - 
// 
Процедура ОбновитьВыборДоступныхКасс(ДокументДляОплаты = Неопределено, КассыДляВсехДокументов = Неопределено)
	
	ЭтотОбъект.ТекущаяКасса = Неопределено;
	
	// Настройка кассы оплаты
	ВременныйМассив = РозничныеПродажи.ПолучитьКассыДоступныеДляОплаты(
		КассыДляВсехДокументов,
		ПараметрыСеанса.РабочееМестоКлиента,
		Ложь);	                                                           
	
	ЭтотОбъект.ДоступныеКассы.Очистить();
	
	врДоступныеКассы = Новый Массив;
	
	// Оставляем только те кассы, которые доступны для документов оплаты
	Если ЗначениеЗаполнено(КассыДляВсехДокументов) Тогда
		
		врДоступныеКассы = Новый Массив;
		Для Каждого ЭлементМ ИЗ ВременныйМассив Цикл
			Если НЕ КассыДляВсехДокументов.Найти(ЭлементМ.Касса) = Неопределено Тогда
				врДоступныеКассы.Добавить(ЭлементМ);
			КонецЕсли;	
		КонецЦикла;		
		
	Иначе
		
		врДоступныеКассы = ВременныйМассив;
		
	КонецЕсли;
	
	ОбновитьДоступныеКассыДляСсылокИСбп(врДоступныеКассы);
	
	// Последовательность касс уже упорядоченна по приоритету в функции: Справочники.Кассы.ПолучитьКассыДляОплаты.
	Если врДоступныеКассы.Количество() > 0 И ДокументДляОплаты <> Неопределено Тогда
						
		Для Каждого ЭлементМ ИЗ врДоступныеКассы Цикл
			
			Если ЭлементМ.КассаДоступна = Истина ИЛИ ЭлементМ.ИспользуетсяОнлайн = Истина Тогда
				
				ЭтотОбъект.ТекущаяКасса = ЭлементМ.Касса;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;					
			
	КонецЕсли;
	
	Для Каждого ЭлементМ ИЗ врДоступныеКассы Цикл 
		
		НоваяСтрока = ЭтотОбъект.ДоступныеКассы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМ);
		
	КонецЦикла;
	
	ПостроитьДинамическиеЭлементыВыбораКасс();

КонецПроцедуры

&НаСервере
// Обновить таблицу задолженностей без перезагрузки ее элементов
Процедура ПриИзмененииВыбораКассыОплатыСервер(ЭлементИмя)
		
	Индекс = 0;
	
	Для Каждого СтрокаТ ИЗ ЭтотОбъект.ДоступныеКассы Цикл
		
		Если ЭлементИмя = "КассаОплаты_" + Индекс Тогда
			
			ЭтаФорма.Элементы["КассаОплаты_" + Индекс].Доступность     = Ложь;
			ЭтаФорма.Элементы["КассаОплаты_" + Индекс].ЦветТекста      = WebЦвета.Черный;
			ЭтаФорма.Элементы["ГруппаКассаОплатыКнопка_" + Индекс].ЦветФона = ЦветаСтиля["ЦветАктивности"]; 
			
			ЭтотОбъект.ТекущаяКасса = СтрокаТ.Касса;
			
		Иначе	
			
			ЭтаФорма.Элементы["КассаОплаты_" + Индекс].Доступность           = СтрокаТ.КассаДоступна ИЛИ СтрокаТ.ИспользуетсяОнлайн;
			ЭтаФорма.Элементы["КассаОплаты_" + Индекс].ЦветТекста            = Новый Цвет(51,102,187);
			ЭтаФорма.Элементы["ГруппаКассаОплатыКнопка_" + Индекс].ЦветФона  = Новый Цвет(255,255,255);
			
		КонецЕсли;
		
		Индекс = Индекс + 1;
		                 
	КонецЦикла; 
	
	ОчиститьВнесенныеВидыОплат();
	ЭтотОбъект.ОплатаВнесено   = 0;
	ЭтотОбъект.ОплатаСдача     = 0;		
	ЭтотОбъект.ОплатаСумма     = 0;
	
	ЭтотОбъект.ТекущаяКассаИспользуетсяККТ = ЭтотОбъект.ТекущаяКасса.ВнешнееОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	ЭтотОбъект.ПечатьКопииЧека             = ЭтотОбъект.ТекущаяКасса.ПечатьКопииЧеков;
	ЭтотОбъект.ПечатьКопииЧекаКоличество   = ЭтотОбъект.ТекущаяКасса.ПечатьКопииЧековКоличество;
	ЭтотОбъект.ЧекПечатать				   = Не ЭтотОбъект.ТекущаяКасса.ПриоритетЭлектронногоЧека;
	
	РасставитьПриоритетПечатиЧека();
	
	Для Каждого СтрокаТ ИЗ ЭтотОбъект.ТаблицаЗадолженностей Цикл
		
		ОплатаЗаблокирована          = (ЭтотОбъект.ТекущаяКасса.СтруктурнаяЕдиница <> СтрокаТ.СтруктурнаяЕдиница); 
		СтрокаТ.ОплатаЗаблокирована  = ОплатаЗаблокирована;
		
		Если ОплатаЗаблокирована = Истина Тогда
			СтрокаТ.ОписаниеБлокировки = "Не выбрана касса для оплаты!";
		Иначе
			СтрокаТ.ОписаниеБлокировки = Неопределено;
		КонецЕсли;
		
		Если ОплатаЗаблокирована Тогда
			СтрокаТ.ПризнакВыбора = Ложь;
		ИначеЕсли СтрокаТ.ПризнакВыбора Тогда		
			СтрокаТ.ПризнакВыбора = НЕ ОплатаЗаблокирована;
		КонецЕсли;
		
		Если НЕ ОплатаЗаблокирована Тогда
			
			Если СтрокаТ.ПризнакВыбора = Истина 
				И СтрокаТ.ОплатаЗаблокирована = Ложь Тогда
				
				ЭтотОбъект.ОплатаСумма = ЭтотОбъект.ОплатаСумма + СтрокаТ.Задолженность;
				
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	УстановитьВидыОплатСервер(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ТаблицаЗадолженностей

#Область КонструкторДинамическойТаблицыЗадолженности

// Процедура - Построить динаимческую таблицу задолженностей
// 
&НаСервере
Процедура ПостроитьДинамическуюТаблицуЗадолженностей()
	
	УдалитьДинамическиеЭлементыТаблицыЗадолженности();
			
	Индекс = 1;
	Пока Индекс < ЭтотОбъект.ТаблицаЗадолженностей.Количество()  Цикл

		СтрокаТ = ЭтотОбъект.ТаблицаЗадолженностей[Индекс];
		ПостроитьСтрокуДинамическойТаблицыЗадолженностей(СтрокаТ);
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Если ЭтотОбъект.ТаблицаЗадолженностей.Количество() > 0 Тогда
		
		Элементы.ЗадолженностьДатаСтрока_0.Заголовок = ЭтотОбъект.ТаблицаЗадолженностей[0].Группировка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Удалить динаимеческие элементы состав занятия
// 
// Параметры:
//  ИндексПервогоЭлемента	 - 	 - 
// 
Процедура УдалитьДинамическиеЭлементыТаблицыЗадолженности()
	
	ОсновнаяГруппа = ЗадолженностьРодительскаяГруппаФормы();
	
	// Все оставльные
	Индекс = ОсновнаяГруппа.ПодчиненныеЭлементы.Количество() - 1;
	Пока Индекс > 0  Цикл
		
		Элементы.Удалить(ОсновнаяГруппа.ПодчиненныеЭлементы[Индекс]);
		
		Индекс = Индекс - 1;
		
	КонецЦикла;	
	
КонецПроцедуры

// Процедура - Построить строку динаимческой таблицы задолженностей
// 
// Параметры:
//  СтрокаТ	 - 	 - 
// 
&НаСервере
Процедура ПостроитьСтрокуДинамическойТаблицыЗадолженностей(СтрокаТ)

	НомерСтрокиДан   = ЭтотОбъект.ТаблицаЗадолженностей.Индекс(СтрокаТ);	
	ОсновнаяГруппа   = ЗадолженностьРодительскаяГруппаФормы();
		
	ПодгруппаСтроки = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(
	ЭтаФорма,
	Элементы.ГруппаЗадолженностьСтрока_0,
	НомерСтрокиДан,
	ОсновнаяГруппа);
	
	УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(
	ЭтаФорма,
	Элементы.ДекорацияЗадолженностьСмещениеСлеваСтрока_0, 
	НомерСтрокиДан,
	Тип("ДекорацияФормы"),
	ПодгруппаСтроки);

	// Поле выбора
	УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(
	ЭтаФорма,
	Элементы.ЗадолженностьВыборСтрока_0, 
	НомерСтрокиДан,
	Тип("ПолеФормы"), 
	ПодгруппаСтроки,
	"ТаблицаЗадолженностей[" + НомерСтрокиДан +"].ПризнакВыбора");
	
	// Кнопка расшифровки
	ПодгруппаКнопки = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(
	ЭтаФорма,
	Элементы.ГруппаЗадолженностьКнопкаСтрока_0,
	НомерСтрокиДан,
	ПодгруппаСтроки);
	
	УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(
	ЭтаФорма,
	Элементы.ЗадолженностьДатаСтрока_0,
	НомерСтрокиДан,
	ПодгруппаКнопки,
	"ТаблицаЗадолженностейРасшифровкаНажатие",
	СтрокаТ.Группировка);	
	
	УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(
	ЭтаФорма,
	Элементы.ЗадолженностьРасшифровкаСтрока_0, 
	НомерСтрокиДан,
	Тип("ПолеФормы"), 
	ПодгруппаСтроки,
	"ТаблицаЗадолженностей[" + НомерСтрокиДан +"].Представление");

	УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(
	ЭтаФорма,
	Элементы.ЗадолженностьЗадолженностьСтрока_0, 
	НомерСтрокиДан,
	Тип("ПолеФормы"), 
	ПодгруппаСтроки,
	"ТаблицаЗадолженностей[" + НомерСтрокиДан +"].Задолженность");
	
КонецПроцедуры

// Функция - Виды оплат родительская группа формы
// 
// Возвращаемое значение:
//   - 
// 
&НаСервере
Функция ЗадолженностьРодительскаяГруппаФормы()
	
	Возврат Элементы.ГруппаДинамическаяТабЗадолженностей;
	
КонецФункции
 
#КонецОбласти

#Область ОбработчикиСобытийТаюблицы

// Процедура - Задолженность установить снять галочки при изменении
// 
// Параметры:
//  Элемент	 - 	 - 
// 
&НаКлиенте
Процедура ЗадолженностьУстановитьСнятьГалочкиПриИзменении(Элемент)
	
	// Установка состояния флажков
	ОплатаСумма = 0;	
	ВыбранХотябыОдин = Ложь;
	
	Для Каждого СтрокаТ ИЗ ЭтотОбъект.ТаблицаЗадолженностей Цикл
		
		Если СтрокаТ.ОплатаЗаблокирована = Ложь Тогда
			
			СтрокаТ.ПризнакВыбора = ЭтотОбъект.ЗадолженностьУстановитьСнятьГалочки;
			ВыбранХотябыОдин      = СтрокаТ.ПризнакВыбора;
			
		Иначе
			
			СтрокаТ.ПризнакВыбора = Ложь;
			ПоказатьОповещениеПользователя("Оплата",,СтрокаТ.ОписаниеБлокировки,БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное);
			
		КонецЕсли;
		
		КолВыбДок = ПолучитьВыбранныеДокументыЗадолженности().Количество();
		
		Если ЭтотОбъект.ВидНалогаОплачиваемыхДокументов <> СтрокаТ.ВидНалога
			И КолВыбДок > 1 Тогда
			
			ПоказатьОповещениеПользователя(
			"Оплата",,
			"Нельзя оплатить одним чеком два документа с разными видами налогообложения!", 
			БиблиотекаКартинок.Предупреждение32,
			СтатусОповещенияПользователя.Важное);
			
			СтрокаТ.ПризнакВыбора = Ложь;
			Продолжить;
			
		ИначеЕсли КолВыбДок = 1 Тогда
			
			ЭтотОбъект.ВидНалогаОплачиваемыхДокументов = СтрокаТ.ВидНалога;
			
		КонецЕсли;

		
	КонецЦикла;
	
	Если ВыбранХотябыОдин = Ложь Тогда
		ЭтотОбъект.ЗадолженностьУстановитьСнятьГалочки = Ложь;
	КонецЕсли;
	
    ОбновитьФорму(,Истина);
	УстановитьАвтоВводСуммДляАвансов();
	
КонецПроцедуры

// Процедура - Задолженность выбор строка при изменении
// 
// Параметры:
//  Элемент	 - 	 - 
// 
&НаКлиенте
Процедура ЗадолженностьВыборСтрока_ПриИзменении(Элемент)
	
	ТекущиеДанные = СтрокаДанныхПоИмениЭлемента(Элемент.Имя, "ТаблицаЗадолженностей"); 
	
	Если ТекущиеДанные.ОплатаЗаблокирована = Истина Тогда
		
		 ТекущиеДанные.ПризнакВыбора = Ложь;
		 ПоказатьОповещениеПользователя("Оплата",,ТекущиеДанные.ОписаниеБлокировки,БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное);
		 Возврат;
		 
	КонецЕсли;
	
	КолВыбДок = ПолучитьВыбранныеДокументыЗадолженности().Количество();
	
	Если ЭтотОбъект.ВидНалогаОплачиваемыхДокументов <> ТекущиеДанные.ВидНалога
		И КолВыбДок > 1 Тогда
		
		ПоказатьОповещениеПользователя(
		"Оплата",,
		"Нельзя оплатить одним чеком два документа с разными видами налогообложения!", 
		БиблиотекаКартинок.Предупреждение32,
		СтатусОповещенияПользователя.Важное);
		
		ТекущиеДанные.ПризнакВыбора = Ложь;
		Возврат;
		
	ИначеЕсли КолВыбДок = 1 Тогда
		
		ЭтотОбъект.ВидНалогаОплачиваемыхДокументов = ТекущиеДанные.ВидНалога;
		
	КонецЕсли;

	Идентификатор = Неопределено;	
	ОбновитьФорму(,Истина, Идентификатор);
	УстановитьАвтоВводСуммДляАвансов();

КонецПроцедуры

// Процедура - Таблица задолженностей расшифровка нажатие
// 
// Параметры:
//  Элемент	 - 	 - 
// 
&НаКлиенте
Процедура ТаблицаЗадолженностейРасшифровкаНажатие(Элемент)
	
	ТекущиеДанные = СтрокаДанныхПоИмениЭлемента(Элемент.Имя, "ТаблицаЗадолженностей");
	
	Если НЕ ТекущиеДанные = Неопределено 
		И ЗначениеЗаполнено(ТекущиеДанные.ДокументЗадолженности) Тогда
		
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(ТекущиеДанные.ДокументЗадолженности));
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаСервере
// Функция - Получить источник данных по продажам для таблицы задолженностей
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьИсточникДанныхПоПродажамДляТаблицыЗадолженностей()
	
	// Получаем таблицу задолженностей	
	ЗапросПоЗадолженности = Новый Запрос;
	Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Организация КАК Организация,
	|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации КАК ДокументЗадолженности,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации ССЫЛКА Документ.Прием
	|			ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации КАК Документ.Прием).СуммаДокумента
	|		ИНАЧЕ ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации КАК Документ.Реализация).СуммаДокумента
	|	КОНЕЦ КАК СуммаДокумента,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации ССЫЛКА Документ.Прием
	|			ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации КАК Документ.Прием).ВидНалога
	|		ИНАЧЕ ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации КАК Документ.Реализация).ВидНалога
	|	КОНЕЦ КАК ВидНалога,
	|	СУММА(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаКонечныйОстаток) * -1 КАК Задолженность,
	|	СУММА(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаПриход) КАК Оплачено
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(
	|			,
	|			&КонецПериода,
	|			Авто,
	|			,
	|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И (НЕ ДокументРеализации = НЕОПРЕДЕЛЕНО
	|					ИЛИ НЕ ДокументАванса = НЕОПРЕДЕЛЕНО)
	|				И Контрагент = &Контрагент) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты
	|ГДЕ
	|	НЕ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации.Дата ЕСТЬ NULL
	|	И ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаКонечныйОстаток < 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Организация,
	|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СтруктурнаяЕдиница,
	|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации ССЫЛКА Документ.Прием
	|			ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации КАК Документ.Прием).СуммаДокумента
	|		ИНАЧЕ ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации КАК Документ.Реализация).СуммаДокумента
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации ССЫЛКА Документ.Прием
	|			ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации КАК Документ.Прием).ВидНалога
	|		ИНАЧЕ ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации КАК Документ.Реализация).ВидНалога
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументЗадолженности";	 
	 
	ЗапросПоЗадолженности.УстановитьПараметр("КонецПериода"      , ?(ТекущаяДатаСеанса() > ЭтотОбъект.ДатаПродажи, ТекущаяДатаСеанса(), ЭтотОбъект.ДатаПродажи));
	ЗапросПоЗадолженности.УстановитьПараметр("Контрагент"        , Контрагент);
	ЗапросПоЗадолженности.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	ЗапросПоЗадолженности.Текст = Текст;
	
	Возврат ЗапросПоЗадолженности.Выполнить();
	
КонецФункции

&НаСервере
// Функция - Получить источник данных по взносам аванса для таблицы задолженностей
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьИсточникДанныхВзносАвансаДляТаблицыЗадолженностей()
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ДокументАванса) = Тип("ДокументСсылка.ПланЛечения") Тогда
				
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПланЛечения.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ПланЛечения.Ссылка КАК ДокументЗадолженности,
		|	ПланЛечения.СуммаДокумента КАК СуммаДокумента,
		|	ЕСТЬNULL(ПланЛечения.ВидНалога, ЗНАЧЕНИЕ(Перечисление.ВидыНалогов.ПустаяСсылка)) КАК ВидНалога,
		|	ПланЛечения.СуммаОплачено КАК Оплачено,
		|	ПланЛечения.СуммаДокумента - ПланЛечения.СуммаОплачено КАК Задолженность
		|ИЗ
		|	Документ.ПланЛечения КАК ПланЛечения
		|ГДЕ
		|	ПланЛечения.Ссылка = &ДокументАванса";
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НарядЗаказ.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	НарядЗаказ.Ссылка КАК ДокументЗадолженности,
		|	НарядЗаказ.СуммаДокумента КАК СуммаДокумента,
		|	ЕСТЬNULL(НарядЗаказ.ВидНалога, ЗНАЧЕНИЕ(Перечисление.ВидыНалогов.ПустаяСсылка)) КАК ВидНалога,
		|	ВЫБОР
		|		КОГДА &УчитыватьАвансыВРазрезеДокументов = ИСТИНА
		|			ТОГДА НарядЗаказ.СуммаОплаченоПродажи
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Оплачено,
		|	ВЫБОР
		|		КОГДА &УчитыватьАвансыВРазрезеДокументов = ИСТИНА
		|			ТОГДА НарядЗаказ.СуммаПродажи - НарядЗаказ.СуммаОплаченоПродажи
		|		ИНАЧЕ НарядЗаказ.СуммаПродажи
		|	КОНЕЦ КАК Задолженность
		|ИЗ
		|	Документ.НарядЗаказ КАК НарядЗаказ
		|ГДЕ
		|	НарядЗаказ.Ссылка = &ДокументАванса";

	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса; 
	НарядЗаказУвеличиваетЗадолженность = Константы.НарядЗаказУвеличиваетЗадолженность.Получить();
	Запрос.УстановитьПараметр("ДокументАванса"                    , ДокументАванса);	
	// Запрос.УстановитьПараметр("НарядЗаказУвеличиваетЗадолженность", НарядЗаказУвеличиваетЗадолженность);
	Запрос.УстановитьПараметр("УчитыватьАвансыВРазрезеДокументов" , УчитыватьАвансыВРазрезеДокументов);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

&НаСервере
// Процедура подготовки таблицы задолженностей для возвратов
// 
Функция ПолучитьИсточникДанныхПоВозвратамДляТаблицыЗадолженностей()
	
	ДокументВозврата = Неопределено;
	Если ЗначениеЗаполнено(ДокументыЗадолженности) 
		И ТипЗнч(ДокументыЗадолженности[0].Значение) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
		
		ДокументВозврата = ДокументыЗадолженности[0].Значение;
	КонецЕсли;
	
	ЗапросПоЗадолженности = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратОтПокупателя.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВозвратОтПокупателя.Ссылка КАК ДокументЗадолженности,
	|	ВозвратОтПокупателя.СуммаДокумента КАК СуммаДокумента,
	|	ВозвратОтПокупателя.СуммаОплачено КАК Оплачено,
	|	ВозвратОтПокупателя.ВидНалога КАК ВидНалога,
	|	ВозвратОтПокупателя.СуммаДокумента - ВозвратОтПокупателя.СуммаОплачено КАК Задолженность
	|ИЗ
	|	Документ.ВозвратОтПокупателя КАК ВозвратОтПокупателя
	|ГДЕ
	|	ВозвратОтПокупателя.Ссылка = &ДокументВозврата");
	  
    ЗапросПоЗадолженности.УстановитьПараметр("ДокументВозврата"  , ДокументВозврата);

	Возврат ЗапросПоЗадолженности.Выполнить();
	
КонецФункции

&НаСервере
// Процедура подготовки таблицы задолженностей
Процедура ПодготовкаТаблицыЗадолженностей()
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Контрагент) Тогда
		
		ОплатаСумма           = 0;
		ВыборкаЗадолженностей = Неопределено;
		
		// В зависимости от типа операции получаем исходные данные
		Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОпераций.Продажа Тогда
			
			Если ЭтоВзносАванса = Истина Тогда
				ЗапросПоЗадолженности = ПолучитьИсточникДанныхВзносАвансаДляТаблицыЗадолженностей();
			Иначе
			    ЗапросПоЗадолженности = ПолучитьИсточникДанныхПоПродажамДляТаблицыЗадолженностей();
			КонецЕсли;

		ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ВидыОпераций.Возврат Тогда
			ЗапросПоЗадолженности = ПолучитьИсточникДанныхПоВозвратамДляТаблицыЗадолженностей();
		КонецЕсли;
		
		// добавить данные по планам лечения и по наряд-заказам 
		Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОпераций.Продажа Тогда
			МассивДокументовЗадолженности = ЗапросПоЗадолженности.Выгрузить().ВыгрузитьКолонку("ДокументЗадолженности");
			МассивДокументовЗадолженностиПриемы = Новый Массив;
			Если МассивДокументовЗадолженности.Количество() <> 0 Тогда 
				
				Для Каждого ДокументЗадолженности Из МассивДокументовЗадолженности Цикл 
					Если ТипЗнч(ДокументЗадолженности) = Тип("ДокументСсылка.Прием") Тогда
						МассивДокументовЗадолженностиПриемы.Добавить(ДокументЗадолженности);
					КонецЕсли;
				КонецЦикла;
				Если МассивДокументовЗадолженностиПриемы.Количество() > 0 Тогда
			    	ДобавитьДанныеПоПланамЛечения(МассивДокументовЗадолженностиПриемы);
			   		ДобавитьДанныеПоНарядЗаказам(МассивДокументовЗадолженностиПриемы);
				КонецЕсли; 
			КонецЕсли;   
		 КонецЕсли;
		 
		// Подготовка касс оплаты.	
		МассивДоступныхКасс	= Справочники.Кассы.ПолучитьКассыДляОплаты(СтруктурнаяЕдиница, Организация);
		//МассивДоступныхКасс = Кассы.ВыгрузитьКолонку("Касса");  
		//Если НЕ МассивДокументовЗадолженностиПриемы = Неопределено Тогда
		//	ДокументыЗадолженности.ЗагрузитьЗначения(МассивДокументовЗадолженностиПриемы);
		//КонецЕсли;
		ОбновитьВыборДоступныхКасс(?(ДокументыЗадолженности.Количество() > 0, ДокументыЗадолженности[0].Значение, Неопределено), МассивДоступныхКасс);
		
		ВыборкаЗадолженностей = ЗапросПоЗадолженности.Выбрать();
		ЭтотОбъект.ТаблицаЗадолженностей.Очистить();
		ВидНалогообложенияУстановлен = Ложь;
		ВыборкаЗадолженностей = ЗапросПоЗадолженности.Выбрать();

		Пока ВыборкаЗадолженностей.Следующий() Цикл 
			
			// Подготовка суммы задолженности
			ДокументСумма               = 0;
			ЗадолженностьСумма          = 0;
			ОплаченоСумма               = 0;
			
			ДокументСумма      = ВыборкаЗадолженностей.СуммаДокумента;
			ЗадолженностьСумма = ВыборкаЗадолженностей.Задолженность;
			ОплаченоСумма      = ВыборкаЗадолженностей.Оплачено;
			
			Если ЗадолженностьСумма > 0 Тогда
				
				// Получаем доступные кассы для это СЕ
				ОплатаЗаблокирована = (ЭтотОбъект.ТекущаяКасса.СтруктурнаяЕдиница <> ВыборкаЗадолженностей.СтруктурнаяЕдиница);
				
				НайденныеСтрокиПоПланамЛечения = ТаблицаАвансыПоПланамЛечения.НайтиСтроки(Новый Структура("Прием", ВыборкаЗадолженностей.ДокументЗадолженности));
				СписокПлановЛечения = Новый СписокЗначений;
				Для Каждого СтрокаТЧ Из НайденныеСтрокиПоПланамЛечения Цикл
					 СписокПлановЛечения.Добавить(СтрокаТЧ.ПланЛечения);
				КонецЦикла;
				
				НайденныеСтрокиПоНарядЗаказам = ТаблицаАвансыПоНарядЗаказам.НайтиСтроки(Новый Структура("Прием", ВыборкаЗадолженностей.ДокументЗадолженности));
				СписокНарядЗаказов = Новый СписокЗначений;
				Для Каждого СтрокаТЧ Из НайденныеСтрокиПоНарядЗаказам Цикл
					 СписокНарядЗаказов.Добавить(СтрокаТЧ.НарядЗаказ);
				КонецЦикла;
		
				НоваяСтрокаВрУровня = ЭтотОбъект.ТаблицаЗадолженностей.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрокаВрУровня, ВыборкаЗадолженностей);
				НоваяСтрокаВрУровня.Группировка    = ФормированиеПечатныхФорм.СформироватьПредставлениеДокумента(ВыборкаЗадолженностей.ДокументЗадолженности,, Истина);
				НоваяСтрокаВрУровня.СуммаДокумента = ДокументСумма;
				НоваяСтрокаВрУровня.Задолженность  = ЗадолженностьСумма;
				НоваяСтрокаВрУровня.Оплачено       = ОплаченоСумма;
				НоваяСтрокаВрУровня.ВидНалога      = ВыборкаЗадолженностей.ВидНалога;
				
				НоваяСтрокаВрУровня.ПланыЛечения = СписокПлановЛечения; 
				НоваяСтрокаВрУровня.НарядЗаказы  = СписокНарядЗаказов;
				
				// Подготовка представления
				Представление = "";
				
				// для наряд заказа это тч запасы и услуги
				Если ЗначениеЗаполнено(ДокументАванса) Тогда
					ТабличнаяЧастьДокумента = ?(ТипЗнч(ДокументАванса) = Тип("ДокументСсылка.ПланЛечения"), 
						ВыборкаЗадолженностей.ДокументЗадолженности.Лечение, ВыборкаЗадолженностей.ДокументЗадолженности.Запасы);
					Для Каждого СтрокаТ Из ТабличнаяЧастьДокумента Цикл
						Представление = Представление + Строка(СтрокаТ.Номенклатура) + ", ";
					КонецЦикла;
					
				ИначеЕсли (ТипЗнч(ВыборкаЗадолженностей.ДокументЗадолженности) = Тип("ДокументСсылка.Прием") 
					Или ТипЗнч(ВыборкаЗадолженностей.ДокументЗадолженности) = Тип("ДокументСсылка.ВозвратОтПокупателя")) Тогда 
					Для Каждого СтрокаТ Из ВыборкаЗадолженностей.ДокументЗадолженности.Лечение Цикл
						Представление = Представление + Строка(СтрокаТ.Номенклатура) + ", ";
					КонецЦикла;
					Для Каждого СтрокаТ Из ВыборкаЗадолженностей.ДокументЗадолженности.Запасы Цикл
						Представление = Представление + Строка(СтрокаТ.Номенклатура) + ", ";
					КонецЦикла;
				Иначе
					Для Каждого СтрокаТ Из ВыборкаЗадолженностей.ДокументЗадолженности.Запасы Цикл
						Представление = Представление + Строка(СтрокаТ.Номенклатура) + ", ";
					КонецЦикла;
				КонецЕсли;
	
				Если СтрДлина(Представление) > 2 Тогда 
					Представление = Лев(Представление, СтрДлина(Представление) - 2); 
				КонецЕсли;
				
				РазрешитьВыборПоУмолчанию = НЕ ОплатаЗаблокирована И (ДокументыЗадолженности.Количество() = 0 
					Или ДокументыЗадолженности.НайтиПоЗначению(ВыборкаЗадолженностей.ДокументЗадолженности) <> Неопределено); 
				
				Если РазрешитьВыборПоУмолчанию = Истина 
					И ВидНалогообложенияУстановлен = Ложь Тогда
					
					ЭтотОбъект.ВидНалогаОплачиваемыхДокументов = ВыборкаЗадолженностей.ВидНалога;
					ВидНалогообложенияУстановлен = Истина;
					
				КонецЕсли;
				
				Если РазрешитьВыборПоУмолчанию = Истина 
					И ЭтотОбъект.ВидНалогаОплачиваемыхДокументов <> ВыборкаЗадолженностей.ВидНалога Тогда
					
					РазрешитьВыборПоУмолчанию = Ложь;
				КонецЕсли;      
				
				НоваяСтрокаВрУровня.Представление        = Представление;
				НоваяСтрокаВрУровня.ПризнакВыбора        = РазрешитьВыборПоУмолчанию;
				НоваяСтрокаВрУровня.ОплатаЗаблокирована  = ОплатаЗаблокирована; 
				
				Если ОплатаЗаблокирована = Истина Тогда
					НоваяСтрокаВрУровня.ОписаниеБлокировки = "Не выбрана касса для оплаты!";
				Иначе
					НоваяСтрокаВрУровня.ОписаниеБлокировки = Неопределено;
				КонецЕсли;
				
				// Если это оплата долга				
				Если РазрешитьВыборПоУмолчанию Тогда
					ЭтотОбъект.ОплатаСумма  = ЭтотОбъект.ОплатаСумма + НоваяСтрокаВрУровня.Задолженность;
				КонецЕсли;	
				
			КонецЕсли;
		КонецЦикла;		
		
		ПостроитьДинамическуюТаблицуЗадолженностей();
		
	КонецЕсли;
	
	Элементы.ДекорацияЗаголовокНетЗадолженности.Видимость = НЕ ЭтотОбъект.ТаблицаЗадолженностей.Количество() > 0;
	Элементы.ГруппаТаблицаЗадолженностей.Видимость        = ЭтотОбъект.ТаблицаЗадолженностей.Количество() > 0;
	Элементы.ГруппаОплата.Видимость                       = ЭтотОбъект.ТаблицаЗадолженностей.Количество() > 0;
	
КонецПроцедуры

//YS ДобавитьДанныеПоПланамЛечения и ДобавитьДанныеПоНарядЗаказам переписать в один запрос

// Процедура - Добавить данные по планам лечения
// 
&НаСервере
Процедура ДобавитьДанныеПоПланамЛечения(МассивДокументовЗадолженности)
			
	Для Каждого ДокументЗадолженности Из МассивДокументовЗадолженности Цикл
			
		МассивПлановЛечения = Новый Массив;
		Для Каждого СтрокаПриема Из ДокументЗадолженности.Лечение Цикл
			
			Если ЗначениеЗаполнено(СтрокаПриема.ДокументАванса)
				И МассивПлановЛечения.Найти(СтрокаПриема.ДокументАванса) = Неопределено 
				И ТипЗнч(СтрокаПриема.ДокументАванса) = Тип("ДокументСсылка.ПланЛечения") Тогда
				МассивПлановЛечения.Добавить(СтрокаПриема.ДокументАванса);				 
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивПлановЛечения.Количество() <> 0 Тогда
					
			Результат = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ПолучитьСуммуОстаткаАвансаПоДокументу(
				ДокументЗадолженности, МассивПлановЛечения);
			
			Для Каждого СтрокаТЧ Из Результат Цикл
				
				НоваяСтрока = ТаблицаАвансыПоПланамЛечения.Добавить();
				
				НоваяСтрока.Прием                          = ДокументЗадолженности;
				НоваяСтрока.ПланЛечения                    = СтрокаТЧ.ДокументАванса;
	            НоваяСтрока.СуммаАванса                    = СтрокаТЧ.СуммаОстатокАванса;
				НоваяСтрока.СуммаДоступнаяДляОплатыАвансом = СтрокаТЧ.СуммаДоступнаяДляОплатыАвансом;
				
			КонецЦикла;
	
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

// Процедура - Добавить данные по наряд-заказам
// 
&НаСервере
Процедура ДобавитьДанныеПоНарядЗаказам(МассивДокументовЗадолженности)
			
	Для Каждого ДокументЗадолженности Из МассивДокументовЗадолженности Цикл
			
		МассивНарядЗаказов  = Новый Массив;

		Для Каждого СтрокаПриема Из ДокументЗадолженности.Лечение Цикл
			
			Если ЗначениеЗаполнено(СтрокаПриема.ДокументАванса)
				И МассивНарядЗаказов.Найти(СтрокаПриема.ДокументАванса) = Неопределено 
				И ТипЗнч(СтрокаПриема.ДокументАванса) = Тип("ДокументСсылка.НарядЗаказ") Тогда
				МассивНарядЗаказов.Добавить(СтрокаПриема.ДокументАванса);				 
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтрокаПриема Из ДокументЗадолженности.Запасы Цикл
			
			Если ЗначениеЗаполнено(СтрокаПриема.ДокументАванса)
				И МассивНарядЗаказов.Найти(СтрокаПриема.ДокументАванса) = Неопределено 
				И ТипЗнч(СтрокаПриема.ДокументАванса) = Тип("ДокументСсылка.НарядЗаказ") Тогда
				МассивНарядЗаказов.Добавить(СтрокаПриема.ДокументАванса);				 
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивНарядЗаказов.Количество() <> 0 Тогда
					
			Результат = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ПолучитьСуммуОстаткаАвансаПоДокументу(
				ДокументЗадолженности, МассивНарядЗаказов);
			
			Для Каждого СтрокаТЧ Из Результат Цикл
				
				НоваяСтрока = ТаблицаАвансыПоНарядЗаказам.Добавить();
				
				НоваяСтрока.Прием                          = ДокументЗадолженности;
				НоваяСтрока.НарядЗаказ                     = СтрокаТЧ.ДокументАванса;
	            НоваяСтрока.СуммаАванса                    = СтрокаТЧ.СуммаОстатокАванса;
				НоваяСтрока.СуммаДоступнаяДляОплатыАвансом = СтрокаТЧ.СуммаДоступнаяДляОплатыАвансом;
				
			КонецЦикла;
	
		КонецЕсли; 
		
		
		МассивПлановЛечения = Новый Массив;    //для схемы План лечения - Аванс, План лечения -Наряд заказ, Наряд заказ - Прием
		
		Для Каждого НарядЗаказСсылка Из МассивНарядЗаказов Цикл
			Для Каждого СтрокаНарядЗаказ Из НарядЗаказСсылка.Запасы Цикл
				Если ЗначениеЗаполнено(СтрокаНарядЗаказ.ПланЛечения)
					И ТипЗнч(СтрокаНарядЗаказ.ПланЛечения) = Тип("ДокументСсылка.ПланЛечения") 
					И МассивПлановЛечения.Найти(СтрокаНарядЗаказ.ПланЛечения) = Неопределено 
					И ТаблицаАвансыПоПланамЛечения.НайтиСтроки(Новый Структура("ПланЛечения", СтрокаНарядЗаказ.ПланЛечения)).Количество() = 0 
					Тогда
					МассивПлановЛечения.Добавить(СтрокаНарядЗаказ.ПланЛечения);				 
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла; 
		

		
		Если МассивПлановЛечения.Количество() <> 0 Тогда
					
			Результат = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ПолучитьСуммуОстаткаАвансаПоДокументу(
				ДокументЗадолженности, МассивПлановЛечения);
			
			Для Каждого СтрокаТЧ Из Результат Цикл
				
				НоваяСтрока = ТаблицаАвансыПоПланамЛечения.Добавить();
				
				НоваяСтрока.Прием                          = ДокументЗадолженности;
				НоваяСтрока.ПланЛечения                    = СтрокаТЧ.ДокументАванса;
	            НоваяСтрока.СуммаАванса                    = СтрокаТЧ.СуммаОстатокАванса;
				НоваяСтрока.СуммаДоступнаяДляОплатыАвансом = СтрокаТЧ.СуммаДоступнаяДляОплатыАвансом;
				
			КонецЦикла;
	
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
// Получить оплачиваемые документы
Функция ПолучитьВыбранныеДокументыЗадолженности()
	
	МассивДокументов = Новый Массив;	
	Для Каждого СтрокаТ ИЗ ЭтотОбъект.ТаблицаЗадолженностей Цикл
		Если СтрокаТ.ПризнакВыбора Тогда
			МассивДокументов.Добавить(СтрокаТ.ДокументЗадолженности);
		КонецЕсли;
	КонецЦикла;
		
    Возврат МассивДокументов;	
	
КонецФункции

&НаСервере
// Получить оплачиваемые документы
Функция ПолучитьДокументыЗадолженностиСервер(ТолькоВыбранные, ТипДокумента = Неопределено)
	
	МассивДокументов = Новый Массив;
	Для Каждого СтрокаТ ИЗ ЭтотОбъект.ТаблицаЗадолженностей Цикл
		
		Если ТипДокумента <> Неопределено 
			И ТипДокумента <> ТипЗнч(СтрокаТ.ДокументЗадолженности) Тогда
			Продолжить;
		КонецЕсли;	
		
		Если НЕ ТолькоВыбранные ИЛИ СтрокаТ.ПризнакВыбора Тогда
			МассивДокументов.Добавить(СтрокаТ.ДокументЗадолженности);
		КонецЕсли;
		
	КонецЦикла;	
		
    Возврат МассивДокументов;	
	
КонецФункции

&НаСервере
// Получить выбранные строки дерева задолженности
Функция ПолучитьВыбранныеСтрокиДереваЗадолженностиСервер()
	
	МассивСтрок = Новый Массив;	
	Для Каждого СтрокаТ ИЗ ЭтотОбъект.ТаблицаЗадолженностей Цикл
		Если СтрокаТ.ПризнакВыбора Тогда
			МассивСтрок.Добавить(СтрокаТ);
		КонецЕсли;
	КонецЦикла;	
		
	Возврат МассивСтрок;	
КонецФункции

#Конецобласти

#Область ТаблицаВыбораОплаты

#Область УстановкаВидовОплат

&НаСервере
// Процедура - устанавливает виды оплат на странице "Оплата"
// 
Процедура УстановитьВидыОплатСервер(ОчищатьДеревоОплат = Ложь)
		
	ФРИспользуется				 = РозничныеПродажи.ПроверитьИспользованиеФРвКассе(ТекущаяКасса);
	ЭквайринговыйТерминал        = Справочники.ЭквайринговыеТерминалы.ПолучитьЭквайринговыйТерминалПоУмолчанию(ТекущаяКасса);
	
	МассивНайденныхСтрок		 = ЭтотОбъект.ДоступныеКассы.НайтиСтроки(Новый Структура("Касса", ЭтотОбъект.ТекущаяКасса));
    ТекСтрокаКассы				 = ?(МассивНайденныхСтрок.Количество() > 0, МассивНайденныхСтрок[0], Неопределено); 
	ОплатаТолькоПоСсылкам		 = ТекСтрокаКассы <> Неопределено И ТекСтрокаКассы.ИспользуетсяОнлайн = Истина И ТекСтрокаКассы.КассаДоступна = Ложь;	
	
	ПересчитатьСуммуКоплате();
		
	МассивСертификатов = НайтиВсеСтрокиСертифкатовВДеревеДоступныхВидовОплатСервер();
	
	Если ОчищатьДеревоОплат = Истина Тогда
		
		ЭтотОбъект.ВидыОплат.ПолучитьЭлементы().Очистить();
		ЭтотОбъект.ОплатаВнесено = 0;
		ЭтотОбъект.ОплатаСдача   = 0;

	КонецЕсли;

	Если ЭтотОбъект.ОплатаСумма = 0 Тогда
		
		ЭтотОбъект.ВидыОплат.ПолучитьЭлементы().Очистить();
		Элементы.ГруппаОплата.Видимость = Ложь;
		Возврат;
		
	Иначе	
		
		Элементы.ГруппаОплата.Видимость = Истина;
		
	КонецЕсли;

	Если Справочники.Кассы.ПолучитьПризнакИспользованияВидаОплатыПоКассе(ТекущаяКасса, Перечисления.ТипыДенежныхСредств.Наличные) 
		И Не ОплатаТолькоПоСсылкам Тогда
			
		УстановитьВидОплатыНаличными();
		
	КонецЕсли;		
	
	Если НЕ ЭквайринговыйТерминал.Пустая()
		И Справочники.Кассы.ПолучитьПризнакИспользованияВидаОплатыПоКассе(ТекущаяКасса, Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта) 
		И Не ОплатаТолькоПоСсылкам Тогда 
		
		УстановитьВидОплатыПлатежнойКартой();
		
	КонецЕсли;
	
	Если ТекСтрокаКассы <> Неопределено И ТекСтрокаКассы.ИспользуетсяОнлайн = Истина Тогда 			
		УстановитьВидОплатыСБП_И_СсылокНаОплату();		
	КонецЕсли;
	
	Если Справочники.Кассы.ПолучитьПризнакИспользованияВидаОплатыПоКассе(ТекущаяКасса, Перечисления.ТипыДенежныхСредств.ЛицевойСчет) 
		И Не ОплатаТолькоПоСсылкам Тогда 		
		
		Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОпераций.Продажа Тогда
			
			УстановитьВидОплатыЛицевымСчетомДляОплаты();
			
		Иначе
			
			УстановитьВидОплатыЛицевымСчетомДляВозврата();
			
		КонецЕсли;
		
	КонецЕсли;	
		
	Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОпераций.Продажа
		И Справочники.Кассы.ПолучитьПризнакИспользованияВидаОплатыПоКассе(ТекущаяКасса, Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат) 
		И Не ОплатаТолькоПоСсылкам Тогда
				
		Для Каждого СтрокаВидаОплаты ИЗ МассивСертификатов Цикл
			
			УстановитьВидОплатыПодарочнымСертификатом(
			     ПолучитьДанныеСертификата(
				   СтрокаВидаОплаты.Сертификат, 
				   СтрокаВидаОплаты.СертификатПартия,
				   СтрокаВидаОплаты.СертификатПодтвержден,
				   СтруктурнаяЕдиница,
				   Контрагент));
				   
		КонецЦикла;
		
		УстановитьКнопкуДобавленияНовогоСертификата();

	КонецЕсли;
	
	// установить вид оплаты авансом
	Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОпераций.Продажа
		И Справочники.Кассы.ПолучитьПризнакИспользованияВидаОплатыПоКассе(ТекущаяКасса, Перечисления.ТипыДенежныхСредств.Аванс)
		И УчитыватьАвансыВРазрезеДокументов = Ложь 
		И Не ОплатаТолькоПоСсылкам Тогда
			
		УстановитьВидОплатыАвансом();
		
	КонецЕсли;

	СписокИндексовСтрок.Очистить();
	Для Каждого СтрокаТЧ Из ТаблицаЗадолженностей Цикл
		Если СтрокаТЧ.ПризнакВыбора = Истина И СтрокаТЧ.ПланыЛечения.Количество() <> 0 Тогда
			
			Для Каждого ЭлементСписка Из СтрокаТЧ.ПланыЛечения Цикл
				НайденныеСтроки = ТаблицаАвансыПоПланамЛечения.НайтиСтроки(Новый Структура("Прием, ПланЛечения", СтрокаТЧ.ДокументЗадолженности, ЭлементСписка.Значение));
				Если НайденныеСтроки.Количество() <> 0 Тогда
					УстановитьВидОплатыАвансомПоДокументу(НайденныеСтроки, 1);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Если СтрокаТЧ.ПризнакВыбора = Истина И СтрокаТЧ.НарядЗаказы.Количество() <> 0 Тогда
			
			Для Каждого ЭлементСписка Из СтрокаТЧ.НарядЗаказы Цикл
				НайденныеСтроки = ТаблицаАвансыПоНарядЗаказам.НайтиСтроки(Новый Структура("Прием, НарядЗаказ", СтрокаТЧ.ДокументЗадолженности, ЭлементСписка.Значение));
				Если НайденныеСтроки.Количество() <> 0 Тогда
					УстановитьВидОплатыАвансомПоДокументу(НайденныеСтроки, 2);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
				
	КонецЦикла;
	
	Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОпераций.Продажа
 		И Справочники.Кассы.ПолучитьПризнакИспользованияВидаОплатыПоКассе(ТекущаяКасса, Перечисления.ТипыДенежныхСредств.БонусныйСчет)
		И ЭтоВзносАванса = Ложь 
		И Не ОплатаТолькоПоСсылкам Тогда 		
		
		УстановитьВидОплатыБонуснымСчетом();		
	КонецЕсли;

	СтрокаДерева = ЭтотОбъект.ВидыОплат.ПолучитьЭлементы();
	Если СтрокаДерева.Количество() = 0 
		ИЛИ (СтрокаДерева.Количество() > 0 И СтрокаДерева[0].ПолучитьЭлементы().Количество() > 0) Тогда
		СтрокаДерева.Вставить(0).Представление = "Заглушка";
	КонецЕсли;
	
	// Если ЭтотОбъект.ВидыОплат.ПолучитьЭлементы()[0].ПолучитьЭлементы().Количество() > 0 Тогда
	//	ЭтотОбъект.ВидыОплат.ПолучитьЭлементы().Вставить(0).Представление = "Заглушка";
	// КонецЕсли;
		
	СоздатьДинамическуюТаблицуДоступныхВидовОплат();
	
КонецПроцедуры

&НаСервере
// Процедура - Установить вид оплаты наличными
// 
Процедура УстановитьВидОплатыНаличными()
	
	СущВидыОплат = НайтиВДеревеДоступныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.Наличные);	
	Если НЕ ЗначениеЗаполнено(СущВидыОплат) Тогда
		
		ДеревоОплаты                         = ВидыОплат.ПолучитьЭлементы();
		
		ЭлементДерева                        = ДеревоОплаты.Добавить();
		ЭлементДерева.Представление          = "Наличные";
		ЭлементДерева.НаименованиеВидаОплаты = "Наличные";
		ЭлементДерева.ТипДенежныхСредств     = Перечисления.ТипыДенежныхСредств.Наличные;
		ЭлементДерева.МаксСуммаСписания      = -1;
		
		ЭлементДерева.Контрагент             = ЭтотОбъект.Контрагент;
		ЭлементДерева.КассаОплаты            = ЭтотОбъект.ТекущаяКасса;

	КонецЕсли;
		
КонецПроцедуры

&НаСервере
// Процедура - Установить вид оплаты платежной картой
// 
Процедура УстановитьВидОплатыПлатежнойКартой()
	
	СущВидыОплат = НайтиВДеревеДоступныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта);	
	Если НЕ ЗначениеЗаполнено(СущВидыОплат) Тогда
		
		ДеревоОплаты                         = ВидыОплат.ПолучитьЭлементы();
		
		ЭлементДерева                        = ДеревоОплаты.Добавить();
		ЭлементДерева.Представление          = "Платежная карта";
		ЭлементДерева.НаименованиеВидаОплаты = "Платежная карта";
		ЭлементДерева.ТипДенежныхСредств     = Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта; 	
		ЭлементДерева.МаксСуммаСписания      = -1;
		
		ЭлементДерева.Контрагент             = ЭтотОбъект.Контрагент;
		ЭлементДерева.КассаОплаты            = ЭтотОбъект.ТекущаяКасса;

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить вид оплаты лицевым счетом
// 
Процедура УстановитьВидОплатыЛицевымСчетомДляОплаты()
	
    ЭтоПродажа   = ЭтотОбъект.ВидОперации = Перечисления.ВидыОпераций.Продажа;	
    ДеревоОплаты = ВидыОплат.ПолучитьЭлементы();
    
    // Получаем виды лицевых счетов и их баланс
    // Если это единая сеть брать для всех СЕ	
   	Если Константы.РежимРаботыСетиСтоматологий.Получить() = Перечисления.РежимРаботыСетиСтоматологий.ЕдинаяСеть Тогда
		ОстаткиНаЛС = РегистрыНакопления.ДенежныеСредстваНаЛицевыхСчетах.ПолучитьОстаткиНаЛицевыхСчетахКонтрагента(Контрагент, ТекущаяДатаСеанса(), , , , , Истина);			
	Иначе	
		ОстаткиНаЛС = РегистрыНакопления.ДенежныеСредстваНаЛицевыхСчетах.ПолучитьОстаткиНаЛицевыхСчетахКонтрагента(Контрагент, ТекущаяДатаСеанса(), , СтруктурнаяЕдиница, , , Истина);		
	КонецЕсли;

    СуммаОстаткаНаЛС = ?(ТипЗнч(ОстаткиНаЛС) = Тип("Число"), ОстаткиНаЛС, ОстаткиНаЛС.Итог("СуммаОстаток"));		
    
    Если СуммаОстаткаНаЛС > 0 Тогда 		
    	
    	СущВидыОплатВерхУр = НайтиВДеревеДоступныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.ЛицевойСчет);		
    	
    	Если НЕ ЗначениеЗаполнено(СущВидыОплатВерхУр) Тогда
    		
    		ЭлементДереваЛС                    = ЭтотОбъект.ВидыОплат.ПолучитьЭлементы().Добавить();
    		ЭлементДереваЛС.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ЛицевойСчет; 
    		ЭлементДереваЛС.Представление      = "Лицевые счета";
    		ЭлементДереваЛС.ВидЛицевогоСчета   = Справочники.ВидыЛицевыхСчетов.ПустаяСсылка();
    		ЭлементДереваЛС.СертификатПартия   = Справочники.ПартииНоменклатуры.ПустаяСсылка();
    		
    	Иначе
    		ЭлементДереваЛС = СущВидыОплатВерхУр[0];
    	КонецЕсли;
 
    	ОбщаяСуммаПоСчетам = 0;		
    	
    	Для Каждого СтрокаТЧ Из ОстаткиНаЛС Цикл	
    		
    		Если ЭтоПродажа = Ложь 
    			Или СтрокаТЧ.СуммаОстаток <> 0 Тогда
    			
    			Наименование = ?(ЗначениеЗаполнено(СтрокаТЧ.ВидСчета), СтрокаТЧ.ВидСчета.Наименование, "Общий");
				
    			ДопустимыйОстатокДляОплаты = 0;
				Если ЭтоПродажа = Истина Тогда
					
					ОплачиваемыеДокументы = ПолучитьДокументыЗадолженностиСервер(Истина);					
					ДопустимыйОстатокДляОплаты = СтрокаТЧ.СуммаОстаток;
					Если СтрокаТЧ.ВидСчета.ОграничиватьСуммуСписанияСоСчета
						И ЗначениеЗаполнено(СтрокаТЧ.ЛицевойСчет.ПроцентОграниченияСуммыСписанияСоСчета) Тогда
						
						ДопустимыйОстатокДляОплаты = (СтрокаТЧ.ВидСчета.ПроцентОграниченияСуммыСписанияСоСчета / 100) * ДопустимыйОстатокДляОплаты;
						
					КонецЕсли;
					
				КонецЕсли;	
				
    			// Получаем уже выбранную сумма по данному виду счета
    			СуммаИспользовано  = СуммаВнесенныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.ЛицевойСчет, СтрокаТЧ.ВидСчета,,,,СтрокаТЧ.Контрагент);			
    			СущВидыОплатНижнУр = НайтиВДеревеДоступныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.ЛицевойСчет, СтрокаТЧ.ВидСчета,,,,,,,,, СтрокаТЧ.Контрагент);
    			
    			Если НЕ ЗначениеЗаполнено(СущВидыОплатНижнУр) Тогда
    				НоваяСтрока = ЭлементДереваЛС.ПолучитьЭлементы().Добавить();
    				НоваяСтрока.СертификатПартия   = Справочники.ПартииНоменклатуры.ПустаяСсылка();

    			Иначе
    				НоваяСтрока = СущВидыОплатНижнУр[0];
    			КонецЕсли;

    			НоваяСтрока.ВидЛицевогоСчета             = СтрокаТЧ.ВидСчета;
    			НоваяСтрока.Контрагент	        	     = СтрокаТЧ.Контрагент;
    			НоваяСтрока.ТипДенежныхСредств           = Перечисления.ТипыДенежныхСредств.ЛицевойСчет; 
    			НоваяСтрока.МаксСуммаСписания            = ДопустимыйОстатокДляОплаты;
    			НоваяСтрока.ОстатокСредств               = СтрокаТЧ.СуммаОстаток - СуммаИспользовано;			
    			НоваяСтрока.НаименованиеВидаОплаты       = Наименование;
    			НоваяСтрока.Представление                = "" + Наименование + ?(Контрагент <> СтрокаТЧ.Контрагент, " [" + СтрокаТЧ.Контрагент 
					+ ", " + РегистрыСведений.РодственныеСвязи.ОпределитьРодство(Контрагент, СтрокаТЧ.Контрагент) + "]", "") 
					+ " (" + Формат(НоваяСтрока.ОстатокСредств,"ЧДЦ=2; ЧН=0,00") + ")";					
    			НоваяСтрока.КассаОплаты                  = ЭтотОбъект.ТекущаяКасса;
    				
    			ОбщаяСуммаПоСчетам = ОбщаяСуммаПоСчетам + НоваяСтрока.ОстатокСредств;
    			
    		КонецЕсли;
    		
    	КонецЦикла;		
    	
    	// Установка заголовка лицевым счетам
    	ЭлементДереваЛС.ОстатокСредств  = ОбщаяСуммаПоСчетам;
    		
    КонецЕсли;
	
КонецПроцедуры	

&НаСервере
// Процедура - Установить вид оплаты лицевым счетом
// 
Процедура УстановитьВидОплатыЛицевымСчетомДляВозврата()
		
	ДеревоОплаты = ВидыОплат.ПолучитьЭлементы();
			
	Если Константы.РежимРаботыСетиСтоматологий.Получить() = Перечисления.РежимРаботыСетиСтоматологий.ЕдинаяСеть Тогда
		ОстаткиНаЛС = РегистрыНакопления.ДенежныеСредстваНаЛицевыхСчетах.ПолучитьОстаткиНаЛицевыхСчетахКонтрагента(Контрагент, ТекущаяДатаСеанса(), , , , , Истина);			
	Иначе	
		ОстаткиНаЛС = РегистрыНакопления.ДенежныеСредстваНаЛицевыхСчетах.ПолучитьОстаткиНаЛицевыхСчетахКонтрагента(Контрагент, ТекущаяДатаСеанса(), , СтруктурнаяЕдиница, , , Истина);		
	КонецЕсли;

    СуммаОстаткаНаЛС = ?(ТипЗнч(ОстаткиНаЛС) = Тип("Число"), ОстаткиНаЛС, ОстаткиНаЛС.Итог("СуммаОстаток"));
		
	СущВидыОплатВерхУр = НайтиВДеревеДоступныхВидовОплатСервер(
							Перечисления.ТипыДенежныхСредств.ЛицевойСчет,
							Справочники.ВидыЛицевыхСчетов.ПустаяСсылка());		
	
	Если НЕ ЗначениеЗаполнено(СущВидыОплатВерхУр) Тогда
		
		ЭлементДереваЛС                    = ЭтотОбъект.ВидыОплат.ПолучитьЭлементы().Добавить();
		ЭлементДереваЛС.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ЛицевойСчет; 
		ЭлементДереваЛС.Представление      = "Лицевые счета";  
		
	Иначе
		ЭлементДереваЛС = СущВидыОплатВерхУр[0];
	КонецЕсли;
	
	ОбщаяСуммаПоСчетам = 0;		
	
	Если ТипЗнч(ОстаткиНаЛС) = Тип("ТаблицаЗначений") Тогда
			
		Для Каждого СтрокаТЧ ИЗ ОстаткиНаЛС Цикл
			
			Наименование = ?(ЗначениеЗаполнено(СтрокаТЧ.ВидСчета), СтрокаТЧ.ВидСчета.Наименование, "Общий");

			// Получаем уже выбранную сумма по данному виду счета
			СуммаИспользовано = СуммаВнесенныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.ЛицевойСчет, СтрокаТЧ.ВидСчета);
			
			СущВидыОплатНижнУр = НайтиВДеревеДоступныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.ЛицевойСчет, СтрокаТЧ.ВидСчета,,,,,,,,,СтрокаТЧ.Контрагент);
			
			Если НЕ ЗначениеЗаполнено(СущВидыОплатНижнУр) Тогда
				НоваяСтрока = ЭлементДереваЛС.ПолучитьЭлементы().Добавить();
			Иначе
				НоваяСтрока = СущВидыОплатНижнУр[0];
			КонецЕсли;
			
			НоваяСтрока.ВидЛицевогоСчета             = СтрокаТЧ.ВидСчета;
			НоваяСтрока.Контрагент	        	     = СтрокаТЧ.Контрагент;
			НоваяСтрока.ТипДенежныхСредств           = Перечисления.ТипыДенежныхСредств.ЛицевойСчет; 
			
			НоваяСтрока.МаксСуммаСписания            = -1;
			НоваяСтрока.ОстатокСредств               = СтрокаТЧ.СуммаОстаток + СуммаИспользовано;
			
			НоваяСтрока.НаименованиеВидаОплаты       = Наименование;
			НоваяСтрока.Представление                = "" + Наименование + ?(Контрагент <> СтрокаТЧ.Контрагент, 
			" [" + СтрокаТЧ.Контрагент + ", " + РегистрыСведений.РодственныеСвязи.ОпределитьРодство(СтрокаТЧ.Контрагент, Контрагент) + "]", "");					
			
			НоваяСтрока.Контрагент                   = ЭтотОбъект.Контрагент;
			НоваяСтрока.КассаОплаты                  = ЭтотОбъект.ТекущаяКасса;
			
		КонецЦикла;		
		
	КонецЕсли;
		
КонецПроцедуры	

&НаСервере
// Процедура - Установить вид оплаты аванс
// 
Процедура УстановитьВидОплатыАвансом()
	
	ОстатокАванса = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ПолучитьОстатокАвансаПоКонтрагенту(Контрагент, ТекущаяДатаСеанса(), СтруктурнаяЕдиница);
			
	Если ЗначениеЗаполнено(ОстатокАванса) Тогда
		
		СущВидыОплатВерхУр = НайтиВДеревеДоступныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.Аванс,,,,,,,, "Авансы");		
    	
    	Если НЕ ЗначениеЗаполнено(СущВидыОплатВерхУр) Тогда
    		
    		ЭлементДереваЛС                    = ЭтотОбъект.ВидыОплат.ПолучитьЭлементы().Добавить();
    		ЭлементДереваЛС.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Аванс; 
    		ЭлементДереваЛС.Представление      = "Авансы";
    		    		
    	Иначе
    		ЭлементДереваЛС = СущВидыОплатВерхУр[0];
    	КонецЕсли;

		СуммаИспользовано = СуммаВнесенныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.Аванс);
		
		СуществВидыОплат = НайтиВДеревеДоступныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.Аванс);
		
		Если НЕ ЗначениеЗаполнено(СуществВидыОплат) Тогда
			ЭлементДерева = ЭлементДереваЛС.ПолучитьЭлементы().Добавить();
		Иначе
			ЭлементДерева = СуществВидыОплат[0];
		КонецЕсли;
			
		ЭлементДерева.ТипДенежныхСредств      = Перечисления.ТипыДенежныхСредств.Аванс;	
		ЭлементДерева.ОстатокСредств          = ОстатокАванса - СуммаИспользовано;
		ЭлементДерева.МаксСуммаСписания       = ЭлементДерева.ОстатокСредств;
		ЭлементДерева.Контрагент	          = Контрагент;
		ЭлементДерева.Представление           = "Аванс (" + Формат(ЭлементДерева.ОстатокСредств, "ЧДЦ=2; ЧН=0,00") + ")" ;	
		ЭлементДерева.КассаОплаты             = ЭтотОбъект.ТекущаяКасса;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция, устанавливает вид оплаты бонусным счетом.
//
Процедура УстановитьВидОплатыБонуснымСчетом()
	
	МассивДокументов = ПолучитьДокументыЗадолженностиСервер(Истина);
	
	ОстаткиБонусныхСчетов = РегистрыНакопления.БонусныеСчета.ПолучитьОстаткиНаБонусныхСчетахКонтрагента(
								ЭтотОбъект.Контрагент, 
								ПолучитьМассивНачисленныхБонусныхСчетов(МассивДокументов));
	
	Если ОстаткиБонусныхСчетов.Количество() > 0
		И ОстаткиБонусныхСчетов.Итог("Сумма") > 0 Тогда
		
		СущВидыОплатВерхУр = НайтиВДеревеДоступныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.БонусныйСчет,,,,,,,, "Бонусные счета");		
    	
    	Если НЕ ЗначениеЗаполнено(СущВидыОплатВерхУр) Тогда
    		
    		ЭлементДереваЛС                    = ЭтотОбъект.ВидыОплат.ПолучитьЭлементы().Добавить();
    		ЭлементДереваЛС.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.БонусныйСчет; 
    		ЭлементДереваЛС.Представление      = "Бонусные счета";
    		    		
    	Иначе
    		ЭлементДереваЛС = СущВидыОплатВерхУр[0];
    	КонецЕсли;
		
		Для Каждого СтрокаТЧ Из ОстаткиБонусныхСчетов Цикл
			
			БонусныйСчет 			   = СтрокаТЧ.БонусныйСчет;
			ДопустимыйОстатокДляОплаты = УправлениеМаркетинговымиАкциями.ПолучитьСуммуДоступнуюДляОплатыБонуснымСчетомВМассивеРеализацийПриемов(
												МассивДокументов,
												БонусныйСчет);
			 
			Если ДопустимыйОстатокДляОплаты > 0 Тогда
				
				Наименование 			 = Справочники.БонусныеСчета.ПолучитьПредставлениеБонусногоСчета(БонусныйСчет);
				ПредставлениеКонтрагента = ?(Контрагент <> СтрокаТЧ.Контрагент, 
												" [" 
												+ СтрокаТЧ.Контрагент 
												+ ", " 
												+ РегистрыСведений.РодственныеСвязи.ОпределитьРодство(СтрокаТЧ.Контрагент, Контрагент) + "]"
												, "");
				
				// Получаем уже выбранную сумма по данному виду счета
				СуммаИспользовано  = СуммаВнесенныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.БонусныйСчет,,,, СтрокаТЧ.БонусныйСчет);			
    			СущВидыОплатНижнУр = НайтиВДеревеДоступныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.БонусныйСчет,,,,,,,,, СтрокаТЧ.БонусныйСчет);
				
    			Если НЕ ЗначениеЗаполнено(СущВидыОплатНижнУр) Тогда
    				НоваяСтрока = ЭлементДереваЛС.ПолучитьЭлементы().Добавить();
    				НоваяСтрока.СертификатПартия   = Справочники.ПартииНоменклатуры.ПустаяСсылка();

    			Иначе
    				НоваяСтрока = СущВидыОплатНижнУр[0];
    			КонецЕсли;
			
				НоваяСтрока.БонусныйСчет	             = СтрокаТЧ.БонусныйСчет;
				НоваяСтрока.МаксСуммаСписания     		 = ДопустимыйОстатокДляОплаты;
				НоваяСтрока.Контрагент	        	     = СтрокаТЧ.Контрагент;
				НоваяСтрока.ТипДенежныхСредств           = Перечисления.ТипыДенежныхСредств.БонусныйСчет; 
				НоваяСтрока.ОстатокСредств               = СтрокаТЧ.Сумма - СуммаИспользовано;	
				НоваяСтрока.Представление                = Наименование 
															+ ПредставлениеКонтрагента
															+ " (" 
															+ Формат(НоваяСтрока.ОстатокСредств, "ЧДЦ=2; ЧН=0,00") + ")";				
				НоваяСтрока.КассаОплаты                  = ЭтотОбъект.ТекущаяКасса;

			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;		
		
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - возвращает таблицу начисленных бонусных счетов по маркетинговой акции.
//
Функция ПолучитьМассивНачисленныхБонусныхСчетов(МассивДокументов)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БонусныеСчетаОбороты.БонусныйСчет КАК БонусныйСчет,
	|	ЕСТЬNULL(СУММА(БонусныеСчетаОбороты.СуммаПриход), 0) КАК Сумма,
	|	БонусныеСчетаОбороты.БонусныйСчет.ВладелецБонусногоСчета КАК ВладелецБонусногоСчета,
	|	БонусныеСчетаОбороты.БонусныйСчет.ВидБонусногоСчета КАК ВидБонусногоСчета,
	|	БонусныеСчетаОбороты.БонусныйСчет.ВидБонусногоСчета.Наименование КАК Наименование
	|ИЗ
	|	РегистрНакопления.БонусныеСчета.Обороты(, , Регистратор, ) КАК БонусныеСчетаОбороты
	|ГДЕ
	|	БонусныеСчетаОбороты.Регистратор В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	БонусныеСчетаОбороты.БонусныйСчет,
	|	БонусныеСчетаОбороты.БонусныйСчет.ВладелецБонусногоСчета,
	|	БонусныеСчетаОбороты.БонусныйСчет.ВидБонусногоСчета,
	|	БонусныеСчетаОбороты.БонусныйСчет.ВидБонусногоСчета.Наименование");
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции 

&НаСервере
// Процедура - Установить вид оплаты аванс
// 
Процедура УстановитьВидОплатыАвансомПоДокументу(НайденныеСтроки, ТипАванса)
	
	ЭтоАвансПоПлануЛечения 	  = (ТипАванса = 1);
	ЭтоАвансПоНарядЗаказу 	  = (ТипАванса = 2);
		
	Если ЭтоАвансПоПлануЛечения Тогда
		
		ДокументАванса				 = НайденныеСтроки[0].ПланЛечения;
		ПредставлениеДокументаАванса = ФормированиеПечатныхФорм.СформироватьПредставлениеДокумента(ДокументАванса);
		
	ИначеЕсли ЭтоАвансПоНарядЗаказу Тогда
		
		ДокументАванса				 = НайденныеСтроки[0].НарядЗаказ;
		ПредставлениеДокументаАванса = ФормированиеПечатныхФорм.СформироватьПредставлениеДокумента(ДокументАванса);

	КонецЕсли;
	
	СущВидыОплатВерхУр = НайтиВДеревеДоступныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.Аванс,,,,,,,, "Авансы");		
	
	Если НЕ ЗначениеЗаполнено(СущВидыОплатВерхУр) Тогда
		
		ЭлементДереваЛС                    = ЭтотОбъект.ВидыОплат.ПолучитьЭлементы().Добавить();
		ЭлементДереваЛС.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Аванс; 
		ЭлементДереваЛС.Представление      = "Авансы";
		
	Иначе
		ЭлементДереваЛС = СущВидыОплатВерхУр[0];
	КонецЕсли;

	СуществВидыОплат = НайтиВДеревеДоступныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.Аванс,,,,,,, ДокументАванса);
	
	Если НЕ ЗначениеЗаполнено(СуществВидыОплат) Тогда
		ЭлементДерева = ЭлементДереваЛС.ПолучитьЭлементы().Добавить();
	Иначе
		ЭлементДерева = СуществВидыОплат[0];
	КонецЕсли;
	
	ОстатокАванса = НайденныеСтроки[0].СуммаАванса; 
	
	// найти сумму возможной оплаты по приему
	Прием = НайденныеСтроки[0].Прием;
	
	Для Каждого СтрокаТЧ Из Прием.Лечение Цикл
		
		Если ЗначениеЗаполнено(СтрокаТЧ.ДокументАванса) И СтрокаТЧ.ДокументАванса = ДокументАванса Тогда			
			ОстатокАванса = ОстатокАванса + СтрокаТЧ.Всего;		
		КонецЕсли;
		
	КонецЦикла;
	
	ЭлементДерева.ТипДенежныхСредств      = Перечисления.ТипыДенежныхСредств.Аванс;	
	ЭлементДерева.ОстатокСредств          = НайденныеСтроки[0].СуммаДоступнаяДляОплатыАвансом;
	ЭлементДерева.МаксСуммаСписания       = ЭлементДерева.ОстатокСредств;
	ЭлементДерева.Контрагент	          = Контрагент;
	ЭлементДерева.Представление           = ПредставлениеДокументаАванса + " (" + Формат(НайденныеСтроки[0].СуммаДоступнаяДляОплатыАвансом, "ЧДЦ=2; ЧН=0,00") + ")" ;	
	ЭлементДерева.ДокументАванса          = ДокументАванса; 
	ЭлементДерева.КассаОплаты             = ЭтотОбъект.ТекущаяКасса;		
	ИндексСтрокиВидОплатыАвансу           = ЭтотОбъект.ВидыОплат.ПолучитьЭлементы().Индекс(ЭлементДерева);
	
	СписокИндексовСтрок.Добавить(ИндексСтрокиВидОплатыАвансу);

КонецПроцедуры

&НаСервере
// Процедура - Установить вид оплаты подарочным сертификатом
// 
функция УстановитьВидОплатыПодарочнымСертификатом(ДанныеСертификата)
	
	ДобавлениеСертификата = Ложь;
	
	ВерхнийУровень = НайтиВВерхнемУровнеДереваДоступныхВидовОплат(Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат);
	
	СтрокаСертификата = НайтиВДеревеДоступныхВидовОплатСервер(
	Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат,
	,,
	ДанныеСертификата.Партия,,
	Истина);
	
	Если СтрокаСертификата = Неопределено Тогда
		
		СтрокаСертификата = НайтиВДеревеДоступныхВидовОплатСервер(
		Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат,,,,
		ВерхнийУровень,,
		Истина);
		
		ДобавлениеСертификата = Истина;
		
	КонецЕсли;
	
	Если СтрокаСертификата = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОплачиваемыеДокументы = ПолучитьДокументыЗадолженностиСервер(Истина);
	
	ДопустимыйОстатокДляОплаты = ДанныеСертификата.ОстатокСуммы;

	СуммаИспользовано = СуммаВнесенныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат,,, ДанныеСертификата.Партия);
	
	СтрокаСертификата.ТипДенежныхСредств           = Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат; 
	СтрокаСертификата.Сертификат                   = ДанныеСертификата.Сертификат;
	СтрокаСертификата.СертификатПартия             = ДанныеСертификата.Партия;
	
	СтрокаСертификата.ОстатокСредств               = ДанныеСертификата.ОстатокСуммы - СуммаИспользовано;
	СтрокаСертификата.МаксСуммаСписания            = ДопустимыйОстатокДляОплаты;
	
	СтрокаСертификата.НаименованиеВидаОплаты       = ДанныеСертификата.Представление;
	СтрокаСертификата.Представление                = ДанныеСертификата.Представление + " (" + Формат(СтрокаСертификата.ОстатокСредств,"ЧДЦ=2; ЧН=0,00") + ")";					
	СтрокаСертификата.СертификатПодтвержден        = ДанныеСертификата.Подтвержден;
	
	СтрокаСертификата.Контрагент                   = ЭтотОбъект.Контрагент;
	СтрокаСертификата.КассаОплаты                  = ЭтотОбъект.ТекущаяКасса;
	
	Если ДобавлениеСертификата = Истина Тогда
		
		СуммаОжидаемогоПлатежа     = ЭтотОбъект.ОплатаСумма - ЭтотОбъект.ОплатаВнесено;			
		СтрокаСертификата.Внесено  = ?(СтрокаСертификата.МаксСуммаСписания > СуммаОжидаемогоПлатежа, СуммаОжидаемогоПлатежа, СтрокаСертификата.МаксСуммаСписания);
				
	КонецЕсли;
	
	Возврат СтрокаСертификата.ПолучитьИдентификатор();
	
КонецФункции

&НаСервере
// Процедура - Установить кнопку добавления сертифката
// 
Процедура УстановитьКнопкуДобавленияНовогоСертификата()
	
	ВерхнийУровень = НайтиВВерхнемУровнеДереваДоступныхВидовОплат(Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат);
	
	Если ВерхнийУровень = Неопределено Тогда
		
		ДеревоОплаты                     = ВидыОплат.ПолучитьЭлементы();
		ЭлементДерева                    = ДеревоОплаты.Добавить();
		ЭлементДерева.Представление      = "Подарочные сертификаты";
		ЭлементДерева.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат;
		ЭлементДерева.ВидЛицевогоСчета   = Справочники.ВидыЛицевыхСчетов.ПустаяСсылка();
		ЭлементДерева.СертификатПартия	 = Справочники.ПартииНоменклатуры.ПустаяСсылка();
		ВерхнийУровень                   = ЭлементДерева;
		
	Иначе	
		
		ВерхнийУровень                   = ВерхнийУровень;
		
	КонецЕсли;
	
	СуществВидыОплат = НайтиВДеревеДоступныхВидовОплатСервер(
	Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат,,,
	Справочники.ПартииНоменклатуры.ПустаяСсылка(),
	ВерхнийУровень);
	
	Если НЕ ЗначениеЗаполнено(СуществВидыОплат) Тогда
		ЭлементДерева = ВерхнийУровень.ПолучитьЭлементы().Добавить();
		ЭлементДерева.ВидЛицевогоСчета = Справочники.ВидыЛицевыхСчетов.ПустаяСсылка();
		ЭлементДерева.СертификатПартия = Справочники.ПартииНоменклатуры.ПустаяСсылка();
	Иначе
		ЭлементДерева = СуществВидыОплат[0];
	КонецЕсли;
	
    ЭлементДерева.Представление      = "Добавить сертификат";	
	ЭлементДерева.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат; 
	
	Если СуществВидыОплат.Количество() > 1 Тогда
		
		ВерхнийУровень.ПолучитьЭлементы().Удалить(СуществВидыОплат[1]);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработать данные штрихкода сертификата
// 
// Параметры:
//  СтруктураДанных	 - 	 - 
// 
Процедура ДобавитьВыбранныйСертификатВВидыОплат(ДанныеСертифиаката)
	
	Если ДанныеСертифиаката.Использовать = Ложь Тогда
		
		ПоказатьОповещениеПользователя("Оплата",,ДанныеСертифиаката.ОписаниеПроверки, БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное); 
		Возврат;
		
	КонецЕсли;
	
	ИдСтроки = УстановитьВидОплатыПодарочнымСертификатом(ДанныеСертифиаката);
	
	ОплатаСуммаПриИзменении(ЭтотОбъект.ВидыОплат.НайтиПоИдентификатору(ИдСтроки));
								
КонецПроцедуры

&НаСервере
// Процедура - Установить вид оплаты СБП
//
Процедура УстановитьВидОплатыСБП_И_СсылокНаОплату()
	
	ВнешняяСистема			= Неопределено;
	ЭтоВозврат				= ЭтотОбъект.ВидОперации = Перечисления.ВидыОпераций.Возврат;
	
	Если ЭтоВозврат Тогда
		
		Если ЗначениеЗаполнено(ДокументыЗадолженности) И ТипЗнч(ДокументыЗадолженности[0].Значение) = Тип("ДокументСсылка.ВозвратОтПокупателя")Тогда
			ТаблицаЭТ = РегистрыСведений.СтатусыОплатыЗаказов.ПолучитьТаблицуСЭквайрингомДляВозврата(ДокументыЗадолженности[0].Значение);
		Иначе
			ТаблицаЭТ = Новый ТаблицаЗначений;	
		КонецЕсли;
		
	Иначе
		ТаблицаЭТ = Справочники.ЭквайринговыеТерминалы.ПолучитьЭквайринговыеТерминалыСБП_И_СсылокНаОплату(ЭтотОбъект.ТекущаяКасса, ЭтотОбъект.СтруктурнаяЕдиница);			
	КонецЕсли;

	Если ТаблицаЭТ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	СущВидыОплатВерхУр = НайтиВДеревеДоступныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.СистемаБыстрыхПлатежей,,,,,,,,,,, Справочники.ЭквайринговыеТерминалы.ПустаяСсылка());
	
	Если НЕ ЗначениеЗаполнено(СущВидыОплатВерхУр) Тогда
		
		ЭлементДереваЭТ                    = ЭтотОбъект.ВидыОплат.ПолучитьЭлементы().Добавить();
		ЭлементДереваЭТ.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.СистемаБыстрыхПлатежей; 
		ЭлементДереваЭТ.Представление      = НСтр("ru = 'Система быстрых платежей и ссылки на оплату'; en = 'Fast payment system and payment links'");  
		
	Иначе
		ЭлементДереваЭТ = СущВидыОплатВерхУр[0];
	КонецЕсли;
		
	Для Каждого СтрокаТ ИЗ ТаблицаЭТ Цикл
				
		СущВидыОплатНижнУр = НайтиВДеревеДоступныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.СистемаБыстрыхПлатежей,,,,,,,,,,, СтрокаТ.ЭквайринговыйТерминал);
		
		НоваяСтрока = ?(ЗначениеЗаполнено(СущВидыОплатНижнУр), СущВидыОплатНижнУр[0], ЭлементДереваЭТ.ПолучитьЭлементы().Добавить());
		
		НоваяСтрока.ЭквайринговыйТерминал  = СтрокаТ.ЭквайринговыйТерминал;
		НоваяСтрока.Контрагент	           = ЭтотОбъект.Контрагент;
		НоваяСтрока.КассаОплаты            = ЭтотОбъект.ТекущаяКасса;
		НоваяСтрока.ТипДенежныхСредств     = Перечисления.ТипыДенежныхСредств.СистемаБыстрыхПлатежей;
		НоваяСтрока.МаксСуммаСписания      = ?(ЭтоВозврат, СтрокаТ.Сумма, -1);
		НоваяСтрока.НаименованиеВидаОплаты = СтрокаТ.Наименование;
		НоваяСтрока.Представление		   = СтрокаТ.Наименование;
				
	КонецЦикла;
				
КонецПроцедуры

#КонецОбласти

#Область КонструкторДинамическойТаблицыДоступныхВидовОплат

// Процедура - Построить динаимческую таблицу задолженностей
// 
&НаСервере
Процедура СоздатьДинамическуюТаблицуДоступныхВидовОплат()
	
	УдалитьДинамическиеЭлементыТаблицыДоступныхВидовОплат();
			
	ОсновнаяГруппа = ВидыОплатРодительскаяГруппаФормы();

	Для Каждого ВидОплатыВрУр ИЗ ЭтотОбъект.ВидыОплат.ПолучитьЭлементы() Цикл
		
		НомерСтрокиВрУр = ЭтотОбъект.ВидыОплат.ПолучитьЭлементы().Индекс(ВидОплатыВрУр);	
			
		Если ВидОплатыВрУр.ПолучитьЭлементы().Количество() = 0 Тогда
			
			Если НомерСтрокиВрУр = 0 Тогда
				
				Если ВидОплатыВрУр.Представление = "Заглушка" Тогда
					
					Элементы.ГруппаВидыОплатЗаголовокГруппировки_0.Видимость = Ложь;
                    Продолжить;
					
				Иначе
					
					Элементы.ГруппаВидыОплатЗаголовокГруппировки_0.Видимость = Истина;
					 
				 КонецЕсли;
				
				Если ВидОплатыВрУр.Внесено = 0 Тогда
					
					Элементы.ДекорацияНаименованиеГруппировкиВидовОплат_0.Видимость = Ложь;
					Элементы.КнопкаВидыОплатаНаименованиеСтрока_0.Заголовок         = ВидОплатыВрУр.Представление;
					Элементы.ПолеВидыОплатВводСуммыСтрока_0.Видимость               = Ложь;
					Элементы.КнопкаВидыОплатПредставлениеСуммыСтрока_0.Видимость    = Ложь;
					Элементы.КнопкаВидыОплатПрименитьСуммуСтрока_0.Видимость       = Ложь;
					Элементы.КнопкаВидыОплатУдалитьСуммуСтрока_0.Видимость          = Ложь;
					Элементы.ПолеВводаСерииСертификата_0.Видимость                  = Ложь;
					Элементы.ПолеВыбораВидаЛицевогоСчета_0.Видимость                = Ложь;

				КонецЕсли;
				
			Иначе
				
				СоздатьСтрокуДинамическойТаблицыДоступныхВидовОплат(
				ОсновнаяГруппа,
				ВидОплатыВрУр.ПолучитьИдентификатор(),
				НомерСтрокиВрУр, 
				-1,
				ВидОплатыВрУр.Представление,
				Неопределено,
				ВидОплатыВрУр.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПустаяСсылка(),
				Ложь);
		
			КонецЕсли;
			
		Иначе
					
			ГруппаГруппировкиСтрок = СоздатьГруппировкуВидовОплат(ОсновнаяГруппа, НомерСтрокиВрУр, ВидОплатыВрУр.Представление);
	
			Для Каждого ВидОплатыНижУр ИЗ ВидОплатыВрУр.ПолучитьЭлементы() Цикл
				
				НомерСтрокиНижУр = ВидОплатыВрУр.ПолучитьЭлементы().Индекс(ВидОплатыНижУр);	
				
				Картинка = ?(ЗначениеЗаполнено(ВидОплатыНижУр.ЭквайринговыйТерминал), ПолучитьКартинкуСоответствияТипуШлюза(ВидОплатыНижУр.ЭквайринговыйТерминал), Неопределено);				
				
				СоздатьСтрокуДинамическойТаблицыДоступныхВидовОплат(
				ГруппаГруппировкиСтрок,
				ВидОплатыНижУр.ПолучитьИдентификатор(),
				"" + НомерСтрокиВрУр,
				НомерСтрокиНижУр,
				ВидОплатыНижУр.Представление,
				ВидОплатыВрУр.Представление,,,
				Картинка);
												
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура - Удалить динаимеческие элементы состав занятия
// 
// Параметры:
//  ИндексПервогоЭлемента	 - 	 - 
// 
Процедура УдалитьДинамическиеЭлементыТаблицыДоступныхВидовОплат()
	
	ОсновнаяГруппа = ВидыОплатРодительскаяГруппаФормы();
	
	// Все оставльные
	Индекс = ОсновнаяГруппа.ПодчиненныеЭлементы.Количество() - 1;
	Пока Индекс > 0  Цикл
		
		Элементы.Удалить(ОсновнаяГруппа.ПодчиненныеЭлементы[Индекс]);		
		Индекс = Индекс - 1;
		
	КонецЦикла;	
	
КонецПроцедуры

// Функция - Создать группировку видов оплат
// 
// Возвращаемое значение:
//   - 
// 
&НаСервере
Функция СоздатьГруппировкуВидовОплат(ОсновнаяГруппа, НомерСтрокиДан, ЗаголовокГруппы)
	
	ГруппаГруппировкиВерхняя = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(
	ЭтаФорма,
	Элементы.ГруппаВидыОплатЗаголовокГруппировки_0,
	НомерСтрокиДан,
	ОсновнаяГруппа);
	
	ДекорацияЗаголовка =  УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(
	ЭтаФорма,
	Элементы.ДекорацияНаименованиеГруппировкиВидовОплат_0, 
	НомерСтрокиДан,
	Тип("ДекорацияФормы"),
	ГруппаГруппировкиВерхняя);
	
	ДекорацияЗаголовка.Заголовок = ЗаголовокГруппы;
	ДекорацияЗаголовка.Видимость = Истина;
	
	ГруппаГруппировкиНижняя = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(
	ЭтаФорма,
	Элементы.ГруппаВидыОплатГруппировка_0,
	НомерСтрокиДан,
	ГруппаГруппировкиВерхняя);

	Возврат ГруппаГруппировкиНижняя;
	
КонецФункции

// Процедура - Построить строку динаимческой таблицы задолженностей
// 
// Параметры:
//  СтрокаТ	 - 	 - 
// 
&НаСервере
Процедура СоздатьСтрокуДинамическойТаблицыДоступныхВидовОплат(ОсновнаяГруппа, ИдСтрокиДанных, НомерСтрокиДанВерхУр, НомерСтрокиДанНижУр, Заголовок, ЗаголовокГруппы, ВыводитьЗаглушку = Ложь, ФлагДоступность = Неопределено, Картинка = Неопределено)

	НомерСтрокиДан = "" + НомерСтрокиДанВерхУр + ?(НомерСтрокиДанНижУр > -1, "x" + НомерСтрокиДанНижУр, "");
		    
	ПодгруппаСтрокиВертикальная = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(
	ЭтаФорма,
	Элементы.ГруппаВидыОплатГруппировкаВертикальная_0,
	НомерСтрокиДан,
	ОсновнаяГруппа);
	
	ПодгруппаСтрокиВертикальная.Доступность = ?(ФлагДоступность <> Неопределено И ФлагДоступность, Ложь, ПодгруппаСтрокиВертикальная.Доступность);
	
	ПодгруппаСтроки = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(
	ЭтаФорма,
	Элементы.ГруппаВидыОплатСтрока_0,
	НомерСтрокиДан,
	ПодгруппаСтрокиВертикальная);
	
	Если ВыводитьЗаглушку Тогда
		
		Заглушка = УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(
		ЭтаФорма,
		Элементы.ДекорацияЗаглушка_0, 
		НомерСтрокиДан,
		ТипЗнч(Элементы.ДекорацияЗаглушка_0),
		ПодгруппаСтроки);
		
		Заглушка.Видимость = Истина;
		
	КонецЕсли;
	
	УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(
	ЭтаФорма,
	Элементы.КнопкаВидыОплатаНаименованиеСтрока_0, 
	НомерСтрокиДан,
	ПодгруппаСтроки,
	"ОбработчикНажатияВидыОплатВыбор",
	Заголовок,,,
	Картинка);
	
	ПодгруппаРедактированияСуммы = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(
	ЭтаФорма,
	Элементы.ГруппаВидыОплатСуммаСтрока_0,
	НомерСтрокиДан,
	ПодгруппаСтроки);
	
	ПодгруппаРедактированияДатыОплаты = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(
	ЭтаФорма,
	Элементы.ГруппаВидыОплатДатаОплатыСтрока_0,
	НомерСтрокиДан,
	ПодгруппаСтроки);
	
	// Сумма оплаты
    СоздатьГруппуСуммыВнесеннойОплаты(ПодгруппаРедактированияСуммы, ИдСтрокиДанных, НомерСтрокиДанВерхУр, НомерСтрокиДанНижУр, Заглушка);
	
КонецПроцедуры

// Процедура - Построить группу суммы внесенной оплаты
// 
// Параметры:
//  РодительскаяГруппа	 - 	 - 
//  НомерСтрокиДанВерхУр - 	 - 
//  НомерСтрокиДанНижУр	 - 	 - 
// 
&НаСервере
Процедура СоздатьГруппуСуммыВнесеннойОплаты(РодительскаяГруппа, ИдСтрокиДанных, НомерСтрокиДанВерхУр, НомерСтрокиДанНижУр, ДекорацияЗаглушка = Неопределено)
	
	НомерСтрокиДан = "" + НомерСтрокиДанВерхУр + ?(НомерСтрокиДанНижУр > -1, "x" + НомерСтрокиДанНижУр, "");
	СтрокаДанных   = ЭтотОбъект.ВидыОплат.НайтиПоИдентификатору(ИдСтрокиДанных);
	
	Если СтрокаДанных.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат Тогда
		
		ПолеВводаСерииСертификатаИлиВидаЛС = УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(
		ЭтаФорма,
		Элементы.ПолеВводаСерииСертификата_0, 
		НомерСтрокиДан,
		Тип("ПолеФормы"), 
		РодительскаяГруппа,
		"ВидыОплат[" + НомерСтрокиДанВерхУр +"]" + ?(НомерСтрокиДанНижУр > -1, "[" + НомерСтрокиДанНижУр + "]", "") + ".ВводСерииСертификата");
		
		ПолеВводаСерииСертификатаИлиВидаЛС.Видимость = Истина;
		
	Иначе
		
		ПолеВводаСерииСертификатаИлиВидаЛС = УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(
		ЭтаФорма,
		Элементы.ПолеВыбораВидаЛицевогоСчета_0, 
		НомерСтрокиДан,
		Тип("ПолеФормы"), 
		РодительскаяГруппа,
		"ВидыОплат[" + НомерСтрокиДанВерхУр +"]" + ?(НомерСтрокиДанНижУр > -1, "[" + НомерСтрокиДанНижУр + "]", "") + ".ВыборВидаЛицевогоСчета");

		ПолеВводаСерииСертификатаИлиВидаЛС.Видимость = Истина;
		
	КонецЕсли;

	ПолеВводаСерииСертификатаИлиВидаЛС.Видимость = Ложь;
		
	ПолеВводаОплаты = УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(
	ЭтаФорма,
	Элементы.ПолеВидыОплатВводСуммыСтрока_0, 
	НомерСтрокиДан,
	Тип("ПолеФормы"), 
	РодительскаяГруппа,
	"ВидыОплат[" + НомерСтрокиДанВерхУр +"]" + ?(НомерСтрокиДанНижУр > -1, "[" + НомерСтрокиДанНижУр + "]", "") + ".Внесено");
	
	ПолеВводаОплаты.Видимость = Ложь;
	ПолеВводаОплаты.ТолькоПросмотр = СтрокаДанных.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПустаяСсылка();
	
	КнопкаПредставления =  УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(
	ЭтаФорма,
	Элементы.КнопкаВидыОплатПредставлениеСуммыСтрока_0, 
	НомерСтрокиДан,
	РодительскаяГруппа);
	
	КнопкаПрименить =  УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(
	ЭтаФорма,
	Элементы.КнопкаВидыОплатПрименитьСуммуСтрока_0, 
	НомерСтрокиДан,
	РодительскаяГруппа);
	
	КнопкаУдалить =  УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(
	ЭтаФорма,
	Элементы.КнопкаВидыОплатУдалитьСуммуСтрока_0, 
	НомерСтрокиДан,
	РодительскаяГруппа);
	
	СтрокаДанных = ЭтотОбъект.ВидыОплат.ПолучитьЭлементы()[Число(НомерСтрокиДанВерхУр)];
	Если Число(НомерСтрокиДанНижУр) > -1 Тогда
		СтрокаДанных = СтрокаДанных.ПолучитьЭлементы()[Число(НомерСтрокиДанНижУр)];
	КонецЕсли;
	
	Если СтрокаДанных.Внесено > 0 Тогда
		
		КнопкаПредставления.Заголовок = Формат(СтрокаДанных.Внесено,"ЧДЦ=2");
		КнопкаПредставления.Видимость = Истина;
		КнопкаПрименить.Видимость     = Ложь;
		КнопкаУдалить.Видимость       = Истина;
		
	Иначе
		
	    КнопкаПредставления.Заголовок =  "0,00";
		КнопкаПредставления.Видимость = Ложь;
		КнопкаПрименить.Видимость     = Ложь;
		КнопкаУдалить.Видимость       = Ложь;
		
		Если ДекорацияЗаглушка <> Неопределено Тогда
			ДекорацияЗаглушка.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

// Функция - Виды оплат родительская группа формы
// 
// Возвращаемое значение:
//   - 
// 
&НаСервере
Функция ВидыОплатРодительскаяГруппаФормы()
	
	Возврат Элементы.ГруппаДинамическаяТабДоступныхВидовОплат;
	
КонецФункции

// Функция - Виды оплат строка кнопка наименования вида оплат
// 
// Параметры:
//  ПрефиксИмени - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
&НаКлиенте
Функция ВидыОплатСтрокаКнопкаНаименованияВидаОплат(ПрефиксИмени)
	
   ИмяПоляРодителя = "КнопкаВидыОплатаНаименованиеСтрока_";
   
   Возврат ЭтаФорма.Элементы.Найти(ИмяПоляРодителя + ПрефиксИмени);
   
КонецФункции  

// Функция - Получить поле ввода суммы
// 
// Параметры:
//  ПрефиксИмени - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
&НаКлиенте
Функция ВидыОплатСтрокаПолеВводаСуммы(ПрефиксИмени)
	
   ИмяПоляРодителя = "ПолеВидыОплатВводСуммыСтрока_";
   
   Возврат ЭтаФорма.Элементы.Найти(ИмяПоляРодителя + ПрефиксИмени);
   
КонецФункции  

// Функция - Виды оплат строка поле ввода серии сертификата
// 
// Параметры:
//  ПрефиксИмени - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
&НаКлиенте
Функция ВидыОплатСтрокаПолеВводаСерииСертификата(ПрефиксИмени)
	
   ИмяПоляРодителя = "ПолеВводаСерииСертификата_";
   
   Возврат ЭтаФорма.Элементы.Найти(ИмяПоляРодителя + ПрефиксИмени);
   
КонецФункции

// Функция - Виды оплат строка поле выбора вида лицевого счета
// 
// Параметры:
//  ПрефиксИмени - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
&НаКлиенте
Функция ВидыОплатСтрокаПолеВыбораВидаЛицевогоСчета(ПрефиксИмени)
	
   ИмяПоляРодителя = "ПолеВыбораВидаЛицевогоСчета_";
   
   Возврат ЭтаФорма.Элементы.Найти(ИмяПоляРодителя + ПрефиксИмени);
   
КонецФункции

// Функция - Получить кнопку представления суммы
// 
// Параметры:
//  ПрефиксИмени - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
&НаКлиенте
Функция ВидыОплатСтрокаКнопкаПредставленияСуммы(ПрефиксИмени)
	
	ИмяПоляРодителя = "КнопкаВидыОплатПредставлениеСуммыСтрока_";
	
	Возврат ЭтаФорма.Элементы.Найти(ИмяПоляРодителя + ПрефиксИмени);
	
КонецФункции

// Функция - Получить кнопку применения редактирования суммы
// 
// Параметры:
//  ПрефиксИмени - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
&НаКлиенте
Функция ВидыОплатСтрокаКнопкаПримененияРедактированияСуммы(ПрефиксИмени)
	
	ИмяПоляРодителя = "КнопкаВидыОплатПрименитьСуммуСтрока_";
   
   Возврат ЭтаФорма.Элементы.Найти(ИмяПоляРодителя + ПрефиксИмени);
	
КонецФункции

// Функция - Получить кнопку удаления суммы
// 
// Параметры:
//  ПрефиксИмени - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
&НаКлиенте
Функция ВидыОплатСтрокаКнопкаУдаленияСуммы(ПрефиксИмени)
	
   ИмяПоляРодителя = "КнопкаВидыОплатУдалитьСуммуСтрока_";
   
   Возврат ЭтаФорма.Элементы.Найти(ИмяПоляРодителя + ПрефиксИмени);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиДинамическихЭлементов

&НаКлиенте
// Процедура - обработчик события "Выбор" поля формы "ВидыОплат"
// 
Процедура ОбработчикНажатияВидыОплатВыбор(Элемент, ВыбраннаяСтрока = Неопределено, Поле = Неопределено, СтандартнаяОбработка)
	
	ЭтоПродажа = ЭтотОбъект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.Продажа");
	
	СтрокаВыбраннойОплаты = СтрокаДанныхДереваПоИмениЭлемента(Элемент.Имя, "ВидыОплат");
	МассивСтрокСВнесеннойОплатой = ПолучитьСтрокиСВнесеннойОплатой();
	
	Если НЕ ВозможенСмешанныйТипОплаты(СтрокаВыбраннойОплаты) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Смешанный тип оплаты 
		|недоступен для оплаты через систему быстрых платежей или ссылок на оплату");
		Возврат;
	КонецЕсли;
	
	Если СтрокаВыбраннойОплаты.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ПодарочныйСертификат")
		И НЕ ЗначениеЗаполнено(СтрокаВыбраннойОплаты.Сертификат) Тогда
		
		НачатьВводСерииСертификата(Элемент);
		
	ИначеЕсли СтрокаВыбраннойОплаты.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ЛицевойСчет")
		И НЕ ЗначениеЗаполнено(СтрокаВыбраннойОплаты.ВидЛицевогоСчета) Тогда
	
		НачатьВводВидаЛицевогоСчета(Элемент);
				
	ИначеЕсли СтрокаВыбраннойОплаты.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ПустаяСсылка") Тогда
		
		ПроверитьВозможностьОплатыВКредит(Элемент);
		
	ИначеЕсли СтрокаВыбраннойОплаты.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.СистемаБыстрыхПлатежей") Тогда
		
		ПроверитьВозможностьОплатыСБП(СтрокаВыбраннойОплаты, Элемент);
		
	ИначеЕсли СтрокаВыбраннойОплаты.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Аванс") Тогда
		
		Если НЕ УчитыватьАвансыВРазрезеДокументов Тогда
			Для Каждого ЭлементМ ИЗ ТаблицаЗадолженностей Цикл
				Если НЕ ТипЗнч(ЭлементМ.ДокументЗадолженности) = Тип("ДокументСсылка.Прием") и НЕ ТипЗнч(ЭлементМ.ДокументЗадолженности) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
					Предупреждение("Авансы используются только для оплаты приемов!");
					Возврат;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;               
		ВводСуммыОплаты(Элемент);
		
	Иначе
		
		ВводСуммыОплаты(Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
// Функция - Возможен смешанный тип оплаты
//
// Параметры:
//  СтрокаВыбраннойОплаты	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВозможенСмешанныйТипОплаты(СтрокаВыбраннойОплаты)
	
	МассивСтрокНеСовместимыхСБП = ПолучитьСтрокиСВнесеннойОплатой(ТДСНедоступныеДляСмешОплатыПоСБП());
	МассивИмеющихсяСБП = ПолучитьСтрокиСВнесеннойОплатой(ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.СистемаБыстрыхПлатежей"));
	
	// СП - Смешанные платежи
	Возврат СтрокаВыбраннойОплаты.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.БонусныйСчет") // При вводе бонусов разрешены СП
	ИЛИ
	СтрокаВыбраннойОплаты.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.СистемаБыстрыхПлатежей") 
	И (МассивИмеющихсяСБП.Количество() = 0 ИЛИ СтрокаВыбраннойОплаты.ЭквайринговыйТерминал = МассивИмеющихсяСБП[0].ЭквайринговыйТерминал) // Для СБП разрешены СП по бон. счетам 
	И МассивСтрокНеСовместимыхСБП.Количество() = 0 		
	ИЛИ СтрокаВыбраннойОплаты.ТипДенежныхСредств <> ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.СистемаБыстрыхПлатежей") И МассивИмеющихсяСБП.Количество() = 0
	
КонецФункции

&НаСервереБезКонтекста
Функция ТДСНедоступныеДляСмешОплатыПоСБП()
	
	МассивТДС = Новый Массив;
	
	МассивТДС.Добавить(Перечисления.ТипыДенежныхСредств.Аванс);
	МассивТДС.Добавить(Перечисления.ТипыДенежныхСредств.Безналичные);
	МассивТДС.Добавить(Перечисления.ТипыДенежныхСредств.ЛицевойСчет);
	МассивТДС.Добавить(Перечисления.ТипыДенежныхСредств.Наличные);
	МассивТДС.Добавить(Перечисления.ТипыДенежныхСредств.ПереводыВПути);
	МассивТДС.Добавить(Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта);
	МассивТДС.Добавить(Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат);
	
	Возврат МассивТДС;
	
КонецФункции


&НаКлиенте
// Процедура, проверяет возможность оплаты в кредит.
//
Процедура ПроверитьВозможностьОплатыВКредит(Элемент)
	
	ОплатаРазрешена       = Истина;
	СтрокаВыбраннойОплаты = СтрокаДанныхДереваПоИмениЭлемента(Элемент.Имя, "ВидыОплат");
	
	ПараметрыПроверки = ?(СтрокаВыбраннойОплаты <> Неопределено, Новый Структура("Внесено", СтрокаВыбраннойОплаты.Внесено), Неопределено);
	
	ОписаниеОграничения = ПроверитьВозможностьОплатыВКредитНаСервере(ПараметрыПроверки);
	 
	 Если ЗначениеЗаполнено(ОписаниеОграничения) Тогда
		 
		 ПоказатьОповещениеПользователя(
			 "Оплата",,
			 ОписаниеОграничения, 
			 БиблиотекаКартинок.Предупреждение32,
			 СтатусОповещенияПользователя.Важное);
		 
	 Иначе
		 
		 ВводСуммыОплаты(Элемент);
		 
	 КонецЕсли;	
	 
 КонецПроцедуры
 
 &НаСервере
 // Процедура, проверяет возможность оплаты в кредит на сервере.
//
 Функция ПроверитьВозможностьОплатыВКредитНаСервере(СтрокаВыбраннойОплаты)
	 
	 ОплатаРазрешена = Истина;
	 
	 Если ОплатаВнесено <> 0 Тогда
		 
		 Если СтрокаВыбраннойОплаты <> Неопределено Тогда
			 
			 ОплатаРазрешена = (СтрокаВыбраннойОплаты.Внесено = ОплатаВнесено);  			
		 Иначе
			 ОплатаРазрешена = Ложь;
		 КонецЕсли;	
		 
	 КонецЕсли;	
	 
	 Если ОплатаРазрешена = Ложь Тогда
		 
		 Возврат "Нельзя оплатить в кредит документ, если он был оплачен другим видом оплаты!";
		 
	 КонецЕсли;
	 
	 ДокументУжеПробит  = Ложь;
	 ДокументУжеОплачен = Ложь;
	 
	 Для Каждого СтрокаТЧ Из ТаблицаЗадолженностей Цикл
		 
		 Если СтрокаТЧ.ПризнакВыбора = Истина Тогда
			 
			 ДокументЗадолженности = СтрокаТЧ.ДокументЗадолженности;
			 
			 Если СтрокаТЧ.Оплачено <> 0 Тогда
				 ДокументУжеОплачен = Истина;
			 ИначеЕсли ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("НомерЧекаККМ", ДокументЗадолженности.Метаданные()) И ЗначениеЗаполнено(ДокументЗадолженности.НомерЧекаККМ) Тогда 
				 ДокументУжеПробит = Истина;		 
			 КонецЕсли;
			 
			 ОплатаРазрешена = НЕ (ДокументУжеОплачен Или ДокументУжеПробит);
			 
			 Если Не ОплатаРазрешена Тогда
				 Прервать;
			 КОнецЕсли;
			 
		 КонецЕсли;	
		 
	 КонецЦикла; 
	 
	 Если ОплатаРазрешена = Ложь Тогда
		 
		 Возврат
		 ?(ДокументУжеОплачен, 
		 СтрШаблон("Нельзя оплатить в кредит документы, которые были частично оплачены!
		 		   |%1", Строка(ДокументЗадолженности)), 
		 СтрШаблон("Документ %1 уже пробит на фискальном регистраторе", Строка(ДокументЗадолженности)));		 
		 
	 КонецЕсли;	
	 
 КонецФункции

// Процедура - Ввод суммы оплаты
// 
&НаКлиенте
Процедура ВводСуммыОплаты(Элемент)
	
	ЭтоПродажа = ЭтотОбъект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.Продажа");
	
	СтрокаВыбраннойОплаты = СтрокаДанныхДереваПоИмениЭлемента(Элемент.Имя, "ВидыОплат");
	ЭтоПолеАванса	      = ЗначениеЗаполнено(СтрокаВыбраннойОплаты.ДокументАванса);
	
	ПрефиксПоля  = ИндексСтрокиДанныхДереваПоИмениЭлемента(Элемент.Имя);
	ПолеРедСуммы = ВидыОплатСтрокаПолеВводаСуммы(ПрефиксПоля);
	
	Заглушка = Элементы.Найти("ДекорацияЗаглушка_" + ПрефиксПоля);
	
	Если Заглушка <> Неопределено Тогда
		Заглушка.Видимость = Истина;	
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("ОбработчикТаймераКонтроляПотериФокусаПоляВводаСуммы");
	
	Если ТекущееПолеВВодаСуммыОплаты = ПолеРедСуммы И Не ЭтоПолеАванса Тогда
		ЗавершитьРедактированиеПоляВводаСуммы(ПолеРедСуммы);
		Возврат;
	КонецЕсли;
	
	Если ПредПолеВВодаСуммыОплаты <> Неопределено Тогда	
		ЗавершитьРедактированиеПоляВводаСуммы(ПредПолеВВодаСуммыОплаты);		
	КонецЕсли;
	
	СуммаОжидаемогоПлатежа                = ЭтотОбъект.ОплатаСумма -  ЭтотОбъект.ОплатаВнесено;
	ОграничениеСуммыТипаДенежныхСредств   = Неопределено;
	СуммаПодтвержденногоПлатежа           = 0;
	ОплачиваемыеДокументы                 = ПолучитьВыбранныеДокументыЗадолженности();
	
	Если ОплачиваемыеДокументы.Количество() = 0  Тогда 				
		ПоказатьОповещениеПользователя("Оплата",,"Выберите оплачиваемые документы.", БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное); 			
		Возврат
	КонецЕсли;	
	
	Если ОплатаВнесено >= ОплатаСумма
		И СтрокаВыбраннойОплаты.Внесено = 0 Тогда 
		ПоказатьОповещениеПользователя("Оплата",,"Сумма оплаты полностью покрывает сумму документа. Новый вид оплаты не может быть добавлен.", БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное); 			
		Возврат
	КонецЕсли;		
					
	НачатьРедактированияПоляВводаСуммы(ПолеРедСуммы);
		
КонецПроцедуры

// Процедура - Обработчик нажатия кнопка представление суммы
// 
// Параметры:
//  Элемент	 - 	 - 
// 
&НаКлиенте
Процедура ОбработчикНажатияКнопкаПредставлениеСуммы(Элемент)
	
	ПрефиксПоля = ИндексСтрокиДанныхДереваПоИмениЭлемента(Элемент.Имя);

	ПолеРедСуммы = ВидыОплатСтрокаПолеВводаСуммы(ПрефиксПоля);

	НачатьРедактированияПоляВводаСуммы(ПолеРедСуммы);

КонецПроцедуры

// Процедура - Обработчик нажатия кнопка представление суммы
// 
// Параметры:
//  Элемент	 - 	 - 
// 
&НаКлиенте
Процедура ОбработчикНажатияКнопкаПрименитьРедактированиеСуммы(Элемент)

	ПрефиксПоля = ИндексСтрокиДанныхДереваПоИмениЭлемента(Элемент.Имя);
	
	ПолеВвода = ВидыОплатСтрокаПолеВводаСуммы(ПрефиксПоля);
	
	ТекущиеДанные = СтрокаДанныхДереваПоИмениЭлемента(Элемент.Имя, "ВидыОплат");
	
	Если ТекущиеДанные.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ПодарочныйСертификат") Тогда
		ЗавершитьВводСерииСертификата(ПолеВвода);
	ИначеЕсли ТекущиеДанные.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ЛицевойСчет") Тогда
		ЗавершитьВводВидаЛицевогоСчета(ПолеВвода);	
	Иначе	
		ЗавершитьРедактированиеПоляВводаСуммы(ПолеВвода);
	КонецЕсли;

КонецПроцедуры

// Процедура - Обработчик нажатия кнопка удалить сумму
// 
// Параметры:
//  Элемент	 - 	 - 
// 
&НаКлиенте
Процедура ОбработчикНажатияКнопкаУдалитьСумму(Элемент)

	ПрефиксПоля = ИндексСтрокиДанныхДереваПоИмениЭлемента(Элемент.Имя);
	
	ТекущиеДанные = СтрокаДанныхДереваПоИмениЭлемента(Элемент.Имя, "ВидыОплат");
	ТекущиеДанные.Внесено             = 0;
    ТекущиеДанные.ОплачиваемаяСумма   = 0;
	ТекущиеДанные.ВводСерииСертификата = Неопределено;
    ТекущиеДанные.Сертификат           = Неопределено;	
    ТекущиеДанные.СертификатПартия     = Неопределено;
	
	ПолеВвода = ВидыОплатСтрокаПолеВводаСуммы(ПрефиксПоля);
	
	ЗавершитьРедактированиеПоляВводаСуммы(ПолеВвода);
			
КонецПроцедуры

&НаКлиенте
// Процедура - Проверить возможность оплаты СБП
//
Процедура ПроверитьВозможностьОплатыСБП(СтрокаВыбраннойОплаты, Элемент)
	
	ЭтоВозврат = ЭтотОбъект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.Возврат");
	ПрефиксПоля = ИндексСтрокиДанныхДереваПоИмениЭлемента(Элемент.Имя);
	ПолеРедСуммы = ВидыОплатСтрокаПолеВводаСуммы(ПрефиксПоля);
	
	Если Не ЗначениеЗаполнено(СтрокаВыбраннойОплаты.Контрагент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Клиент не заполнен");
		Возврат;
	КонецЕсли;
		
	Если ЭтотОбъект.ОплатаСумма = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма для оплаты равна нулю");
		Возврат;
	КонецЕсли;          
		
	СтруктураПараметров = ПолучитьПараметрыДляПроверки(СтрокаВыбраннойОплаты.ЭквайринговыйТерминал);
	
	Если СтруктураПараметров.МассивЗадолженностей.Количество() = 0 И Не ЭтоВозврат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет выбранных документов задолженности");
		Возврат;
	КонецЕсли;
			
	Если СтруктураПараметров.СсылкаСформированаПоДругомуШлюзу Тогда 		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураПараметров.ОписаниеОшибки);
		Возврат;				
	КонецЕсли;
	
	Если ЭтоВозврат Тогда
		СтрокаВыбраннойОплаты.Внесено = СтрокаВыбраннойОплаты.МаксСуммаСписания;
		ЗавершитьРедактированиеПоляВводаСуммы(ПолеРедСуммы);	
	ИначеЕсли СтруктураПараметров.СсылкаПолучена Тогда	
		ОткрытьФормуСБП(СтруктураПараметров);		
	Иначе
		ВводСуммыОплаты(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - Получить параметры для проверки
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПараметрыДляПроверки(СбпЭквайринговыйТерминал)
	
	ДокументыЗадолженности = Новый Массив;
	Для Каждого СтрокаТЧ из ТаблицаЗадолженностей Цикл
		Если СтрокаТЧ.ПризнакВыбора Тогда
			ДокументыЗадолженности.Добавить(СтрокаТЧ.ДокументЗадолженности);
		КонецЕсли;		
	КонецЦикла;
	
	Выборка			= РегистрыСведений.СтатусыОплатыЗаказов.ПолучитьСсылкуНаОплату(ДокументыЗадолженности, СбпЭквайринговыйТерминал);
	СсылкаПолучена	= Выборка <> Неопределено;			
	СсылкаСформированаПоДругомуШлюзу = СсылкаПолучена И Выборка.СсылкаЭТ <> СбпЭквайринговыйТерминал;
	
	ОписаниеОшибки	= "";
	Если СсылкаСформированаПоДругомуШлюзу Тогда
		ОписаниеОшибки = СтрШаблон("Ссылка уже сформирована по эквайринговому терминалу: %1, для продажи: %2. 
		|Необходимо либо отменить существующую ссылку либо выбрать другую продажу", Выборка.ЭквайринговыйТерминал, Выборка.Основание);
	КонецЕсли;
			
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("МассивЗадолженностей"				, ПолучитьМассивВыбранныхЗадолженностей());
	СтруктураПараметров.Вставить("ТипБанка"							, ОбщегоНазначения.ПолучитьЗначениеРеквизита(СбпЭквайринговыйТерминал, "ТипБанка"));	
	СтруктураПараметров.Вставить("СсылкаСформированаПоДругомуШлюзу"	, СсылкаСформированаПоДругомуШлюзу);
	СтруктураПараметров.Вставить("ОписаниеОшибки"                   , ОписаниеОшибки);
	СтруктураПараметров.Вставить("СсылкаПолучена"                   , СсылкаПолучена);
	СтруктураПараметров.Вставить("НомерЗаказа"                   	, ?(СсылкаПолучена, Выборка.НомерЗаказа, Неопределено));
	  
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере
// Функция - Получить массив выбранных задолженностей
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивВыбранныхЗадолженностей()
	
	МассивСтрок = ПолучитьВыбранныеСтрокиДереваЗадолженностиСервер();
	
	МассивЗадолженностей = Новый Массив;
	Для Каждого СтрокаТЧ из МассивСтрок Цикл
					
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ДокументЗадолженности", СтрокаТЧ.ДокументЗадолженности);
		СтруктураПараметров.Вставить("Задолженность"		, СтрокаТЧ.Задолженность);
		СтруктураПараметров.Вставить("Оплачено"				, СтрокаТЧ.Оплачено);
		СтруктураПараметров.Вставить("СуммаДокумента"		, СтрокаТЧ.СуммаДокумента);
		
		МассивЗадолженностей.Добавить(СтруктураПараметров);		
		
	КонецЦикла;
	
	Возврат МассивЗадолженностей;
	
КонецФункции

&НаКлиенте
// Процедура - Открыть форму СБП
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
//
Процедура ОткрытьФормуСБП(СтруктураПараметров)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораСБП", ЭтотОбъект, СтруктураПараметров);
	ОткрытьФорму("Обработка.ПомощникПроведенияОплаты.Форма.ФормаОтправкиПлатежейСБП", СтруктураПараметров,,,,, ОписаниеОповещения);	
КонецПроцедуры

&НаКлиенте
// Процедура - После выбора СБП
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПослеВыбораСБП(Результат, ДополнительныеПараметры) Экспорт	
	
	РезультатПолучен = Результат <> Неопределено;
		
	Если РезультатПолучен И Результат.ОбновитьИнформациюОСсылкахНаОплату И Не Результат.ОтменаСсылки И ЭтаФорма.Открыта() Тогда
		
		ПреобразоватьДокументыРеализацииПослеОплатыПоСБП(ДополнительныеПараметры);
	
		ЭтаФорма.Закрыть(Новый Структура("ОперацияВыполнена, ОплатаВыполнена", Истина, Истина));	
		
	ИначеЕсли ТекущееПолеВводаСБП <> Неопределено Тогда	
		
		ОбработчикНажатияКнопкаУдалитьСумму(ТекущееПолеВводаСБП);
		
	КонецЕсли;
				
КонецПроцедуры

&НаСервере
// Процедура - Преобразовать документы реализации после оплаты по СБП
//
// Параметры:
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПреобразоватьДокументыРеализацииПослеОплатыПоСБП(ДополнительныеПараметры)

	МассивСтрокОплатыБонусами = ПолучитьСтрокиСВнесеннойОплатойСервер(Перечисления.ТипыДенежныхСредств.БонусныйСчет);
	Если МассивСтрокОплатыБонусами.Количество() = 0 Тогда // При смешанной оплате бонусными счетами
		Возврат;
	КонецЕсли; 
	
	МассивЗадолженностей      = ДополнительныеПараметры.МассивЗадолженностей;
	СуммаОплаты               = ДополнительныеПараметры.СуммаОплаты;
	МассивСтрокОплатыБонусами = ОбщегоНазначенияКлиентСерверСтоматология.КонвертироватьТаблицуВМассивСтруктур(МассивСтрокОплатыБонусами,"Контрагент,ОплачиваемаяСумма,БонусныйСчет");	
	
	МассивРедактируемыхРеализаций = Новый Массив;
	
	//Главный цикл перебора оплачиваемых документов
	Для Каждого СтрокаЗадолженности ИЗ МассивЗадолженностей Цикл			
		Если СтрокаЗадолженности.Задолженность > 0 Тогда			
			
			ДокументЗадолженности = СтрокаЗадолженности.ДокументЗадолженности;
			РеализацияОбъект      = ДокументЗадолженности.ПолучитьОбъект();	
			
			ИмяТЧ = ВернутьИмяТабличнойЧастиДляНачисленияБонусов(РеализацияОбъект);
			 
			Если ИмяТЧ = "" Тогда
				Продолжить;		
			КонецЕсли; 
			
			// Списание суммы, оплачиваемой по СБП 
			ОстатокЗадолженности  = ?(СтрокаЗадолженности.Задолженность > СуммаОплаты, СтрокаЗадолженности.Задолженность - СуммаОплаты, 0);
			СуммаОплаты           = ?(СтрокаЗадолженности.Задолженность < СуммаОплаты, СуммаОплаты - СтрокаЗадолженности.Задолженность, 0);

			Если ОстатокЗадолженности > 0 И СуммаОплаты = 0 Тогда 
				//Цикл перебора видов оплаты
				Для Каждого СтрокаОплаты ИЗ МассивСтрокОплатыБонусами Цикл				
						
					//Если вид оплаты содержит средства для оплаты
					Если ОстатокЗадолженности > 0 
						И СтрокаОплаты.ОплачиваемаяСумма > 0 Тогда					
						
						ОстатокСуммыПлатежа  = ?(СтрокаОплаты.ОплачиваемаяСумма >= ОстатокЗадолженности, ОстатокЗадолженности, СтрокаОплаты.ОплачиваемаяСумма);
						
						СуммаДоступнаяДляОплатыБонуснымСчетом = УправлениеМаркетинговымиАкциями.ПолучитьСуммуДоступнуюДляОплатыБонуснымСчетомВРеализацииПриеме(ДокументЗадолженности, СтрокаОплаты.БонусныйСчет);
						ДоступноКОплате = ?(ОстатокСуммыПлатежа > СуммаДоступнаяДляОплатыБонуснымСчетом, СуммаДоступнаяДляОплатыБонуснымСчетом, ОстатокСуммыПлатежа);
						
						СтрокаТЧ 					  = РеализацияОбъект.СкидкиНаценки.Добавить();
						СтрокаТЧ.БонусныйСчет  		  = СтрокаОплаты.БонусныйСчет;
						СтрокаТЧ.Использование 		  = Истина;
						СтрокаТЧ.КлючСтроки	   		  = РеализацияОбъект[ИмяТЧ][0].КлючСтроки;
						СтрокаТЧ.Контрагент	   		  = СтрокаОплаты.Контрагент;
						СтрокаТЧ.НоменклатураСкидки   = РеализацияОбъект[ИмяТЧ][0].Номенклатура;
						СтрокаТЧ.ПризнакОплатыБонусом = Истина;
						СтрокаТЧ.Сумма				  = ДоступноКОплате;
						
						Обработки.ПомощникПроведенияОплаты.ПересчитатьМаркетинговыеАкцииСтарая(РеализацияОбъект);							
						
						ОстатокЗадолженности           = ОстатокЗадолженности - ДоступноКОплате;
						СтрокаОплаты.ОплачиваемаяСумма = СтрокаОплаты.ОплачиваемаяСумма - ДоступноКОплате;	
						
					КонецЕсли;		
				КонецЦикла;
				
				МассивРедактируемыхРеализаций.Добавить(РеализацияОбъект);
			КонецЕсли;
			
		КонецЕсли;	
	КонецЦикла;

	Счетчик = 0;	
	//Проведение созданных документов
	Для Каждого ДокРеализации Из МассивРедактируемыхРеализаций Цикл
				
		ДокРеализации.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
		ДокРеализации.Записать(РежимЗаписиДокумента.Проведение);
		
		//Подмена значения в массиве на ссылку
		МассивРедактируемыхРеализаций[Счетчик] = ДокРеализации.Ссылка;
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Функция - Завершить ввод суммы оплаты СБП
//
// Параметры:
//  СтрокаДанных - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Процедура ЗавершитьВводСуммыОплатыСБП(СтрокаВыбраннойОплаты)
	
	СтрокиОплатСБонусныхСчетов = ПолучитьСтрокиСВнесеннойОплатой(ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.БонусныйСчет"));
	СуммаОплаченнаяБонусами = 0;     
	
	Для Каждого СтрокаБонуса Из СтрокиОплатСБонусныхСчетов Цикл
		 СуммаОплаченнаяБонусами = СуммаОплаченнаяБонусами + СтрокаБонуса.Внесено; 
	 КонецЦикла;
	 
	Если СтрокаВыбраннойОплаты.Внесено = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внесенная сумма должна быть больше нуля");
		Возврат;
	КонецЕсли;	
	
	// СтрокаВыбраннойОплаты.Внесено = ?(СтрокаВыбраннойОплаты.Внесено > ЭтотОбъект.ОплатаСумма, ЭтотОбъект.ОплатаСумма, СтрокаВыбраннойОплаты.Внесено);
	
	СтруктураПараметров = ПолучитьПараметрыДляПроверки(СтрокаВыбраннойОплаты.ЭквайринговыйТерминал);
	
	СтруктураПараметров.Вставить("КассаОплаты"				, СтрокаВыбраннойОплаты.КассаОплаты);
	СтруктураПараметров.Вставить("Контрагент"				, СтрокаВыбраннойОплаты.Контрагент);
	СтруктураПараметров.Вставить("СтруктурнаяЕдиница"		, ЭтотОбъект.СтруктурнаяЕдиница);
	СтруктураПараметров.Вставить("Организация"				, ЭтотОбъект.Организация);
	СтруктураПараметров.Вставить("ЭквайринговыйТерминал"	, СтрокаВыбраннойОплаты.ЭквайринговыйТерминал);
	СтруктураПараметров.Вставить("СуммаОплаты"				, СтрокаВыбраннойОплаты.Внесено);
	
	ОткрытьФормуСБП(СтруктураПараметров);
	
КонецПроцедуры

#Область РедактированиеВводаСуммы

// Процедура - Активизировать поле ввод суммы оплаты
// 
// Параметры:
//  ПрефиксПоля	 - 	 - 
// 
&НаКлиенте
Процедура НачатьРедактированияПоляВводаСуммы(ПолеВвода)
	
	ОтключитьОбработчикОжидания("ОбработчикТаймераКонтроляПотериФокусаПоляВводаСуммы");
		
	Если ПредПолеВВодаСуммыОплаты <> Неопределено Тогда		
		ЗавершитьРедактированиеПоляВводаСуммы(ПредПолеВВодаСуммыОплаты);		
	КонецЕсли;

	ТекущиеДанные = СтрокаДанныхДереваПоИмениЭлемента(ПолеВвода.Имя, "ВидыОплат");
	
	СуммаОжидаемогоПлатежа = ЭтотОбъект.ОплатаСумма -  ЭтотОбъект.ОплатаВнесено;

	Если ТекущиеДанные.МаксСуммаСписания = - 1 Тогда
		СуммаДоступнаяДляВнесения = СуммаОжидаемогоПлатежа;
	Иначе
		СуммаДоступнаяДляВнесения  = ?(ТекущиеДанные.МаксСуммаСписания > СуммаОжидаемогоПлатежа, СуммаОжидаемогоПлатежа, ТекущиеДанные.МаксСуммаСписания);
	КонецЕсли;
	
	Если ТекущиеДанные.Внесено = 0 Тогда	
		ТекущиеДанные.Внесено = СуммаДоступнаяДляВнесения;
	КонецЕсли;
	
	ТекущееПолеВВодаСуммыОплаты           = ПолеВвода;	
	ТекущееПолеВВодаСуммыОплаты.Видимость = Истина;

	ПрефиксПоля = ИндексСтрокиДанныхДереваПоИмениЭлемента(ПолеВвода.Имя);
	
	КнопкаПредСуммы = ВидыОплатСтрокаКнопкаПредставленияСуммы(ПрефиксПоля);
    КнопкаПредСуммы.Видимость = Ложь;
	
	КнопкаПримененияСуммы           = ВидыОплатСтрокаКнопкаПримененияРедактированияСуммы(ПрефиксПоля);
	КнопкаПримененияСуммы.Видимость = Истина;

	КнопкаУдаленияСуммы           = ВидыОплатСтрокаКнопкаУдаленияСуммы(ПрефиксПоля);
	КнопкаУдаленияСуммы.Видимость = Ложь;

	ВнесеноПередРедактированием = ТекущиеДанные.Внесено;
	
	ПодключитьОбработчикОжидания("ОбработчикТаймераКонтроляПотериФокусаПоляВводаСуммы",0.1, Истина);
		 
КонецПроцедуры

// Процедура - Завершить редактирования поля ввода суммы
// 
// Параметры:
//  ПолеВвода	 - 	 - 
// 
&НаКлиенте
Процедура ЗавершитьРедактированиеПоляВводаСуммы(ПолеВвода)
	
	Если ПолеВвода = Неопределено ИЛИ ЭтотОбъект.ВидыОплат.ПолучитьЭлементы().Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("ОбработчикТаймераКонтроляПотериФокусаПоляВводаСуммы");
	
	ПолеВвода.Видимость = Ложь;
	
	ПрефиксПоля = ИндексСтрокиДанныхДереваПоИмениЭлемента(ПолеВвода.Имя);
	
	КнопкаПредСуммы = ВидыОплатСтрокаКнопкаПредставленияСуммы(ПрефиксПоля);
	
	ТекущиеДанные = СтрокаДанныхДереваПоИмениЭлемента(ПолеВвода.Имя, "ВидыОплат");
	
	Если ТекущиеДанные.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.СистемаБыстрыхПлатежей") Тогда
		ТекущееПолеВводаСБП = ПолеВвода;
	КонецЕсли;
		
	ОплатаСуммаПриИзменении(ТекущиеДанные);
	
	Если ТекущиеДанные.Внесено > 0 Тогда
		
		КнопкаПредСуммы.Заголовок     = Формат(ТекущиеДанные.Внесено,"ЧДЦ=2");
		КнопкаПредСуммы.Видимость     = Истина;
		
		КнопкаПрименияСуммы           = ВидыОплатСтрокаКнопкаПримененияРедактированияСуммы(ПрефиксПоля);
		КнопкаПрименияСуммы.Видимость = Ложь;
		
		КнопкаУдаленияСуммы           = ВидыОплатСтрокаКнопкаУдаленияСуммы(ПрефиксПоля);
		КнопкаУдаленияСуммы.Видимость = Истина;
		
	Иначе
		
		КнопкаПредСуммы.Заголовок     = "0,00";
		КнопкаПредСуммы.Видимость     = Ложь;
		
		КнопкаПрименияСуммы           = ВидыОплатСтрокаКнопкаПримененияРедактированияСуммы(ПрефиксПоля);
		КнопкаПрименияСуммы.Видимость = Ложь;
		
		КнопкаУдаленияСуммы           = ВидыОплатСтрокаКнопкаУдаленияСуммы(ПрефиксПоля);
		КнопкаУдаленияСуммы.Видимость = Ложь;

	КонецЕсли;
	
	Если ТекущееПолеВВодаСуммыОплаты = ПредПолеВВодаСуммыОплаты Тогда
		ТекущееПолеВВодаСуммыОплаты = Неопределено;
	КонецЕсли;
	
	ПредПолеВВодаСуммыОплаты = Неопределено;
	
	ЭтаФорма.ТекущийЭлемент = Элементы.Оплатить;
	
КонецПроцедуры

&НаКлиенте
// При изменении значения суммы оплаты  
Процедура ОплатаСуммаПриИзменении(ТекущиеДанные)
	
	ВнесеноПослеРедактирования = ТекущиеДанные.Внесено;
	Разница                    = ВнесеноПослеРедактирования - ?(ВнесеноПередРедактированием <> Неопределено, ВнесеноПередРедактированием, 0);			
	
	Если ТекущиеДанные.МаксСуммаСписания <> -1
		И  ТекущиеДанные.Внесено > ТекущиеДанные.МаксСуммаСписания Тогда	
		
		Если ТекущиеДанные.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ЛицевойСчет") Тогда				
			
			ТекстСообщения = "Счет ограничен суммой списания, не более: " + ТекущиеДанные.МаксСуммаСписания + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти(); 				
			ПоказатьОповещениеПользователя("Оплата",,ТекстСообщения, БиблиотекаКартинок.Ошибка32, СтатусОповещенияПользователя.Важное); 
			
		КонецЕсли;	
		
		ТекущиеДанные.Внесено = ТекущиеДанные.Внесено - Разница;
		
	КонецЕсли;
	
	РассчитатьРазмерОплаты(ТекущиеДанные);
	
	ОбновитьФорму("ОБНОВИТЬ_ВИДЫ_ОПЛАТ");	
  
КонецПроцедуры

&НаКлиенте
// Процедура - производит расчет размера оплаты вновь добавляемой или изменяемой строки табличной части "Оплата".
// 
Процедура РассчитатьРазмерОплаты(ТекущиеДанные)
		
	СтрокаОплаты             = ТекущиеДанные;
	СуммаОжидаемогоПлатежа   = ЭтотОбъект.ОплатаСумма - ЭтотОбъект.ОплатаВнесено;	
	
	ЭтотОбъект.ОплатаВнесено = СуммаВнесенныхВидовОплат();	
	УстановитьДоступностьЦветФонаОплатить();

	// РАСЧЕТ СУММЫ СДАЧИ
	Разность = ОплатаВнесено - ОплатаСумма;
	
	Если Разность > 0 Тогда 
		
		Если ТекущиеДанные.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные") Тогда
			
			ЭтотОбъект.ОплатаСдача = Разность;			
			
		Иначе
		
			ТекущиеДанные.Внесено = ТекущиеДанные.Внесено - Разность;
			ЭтотОбъект.ОплатаВнесено = СуммаВнесенныхВидовОплат();	
			
		КонецЕсли;
		
	Иначе
		
		ЭтотОбъект.ОплатаСдача = 0;
		
	КонецЕсли;
	
	ТекущиеДанные.ОплачиваемаяСумма = ТекущиеДанные.Внесено - ЭтотОбъект.ОплатаСдача;
	
КонецПроцедуры

// Процедура - Обработчик таймера контроля потери фокуса поля ввода суммы
// 
&НаКлиенте
Процедура ОбработчикТаймераКонтроляПотериФокусаПоляВводаСуммы()
	
	Если ТекущееПолеВВодаСуммыОплаты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Первое срабатываение
	Если ПредПолеВВодаСуммыОплаты = Неопределено Тогда
		
		ПредПолеВВодаСуммыОплаты = ТекущееПолеВВодаСуммыОплаты;
		ЭтаФорма.ТекущийЭлемент  = ТекущееПолеВВодаСуммыОплаты;
	
	КонецЕсли;
	
	// Поле все еще в фокусе ввода
	Если ПредПолеВВодаСуммыОплаты <> Неопределено 
		И ПредПолеВВодаСуммыОплаты.Видимость = Истина 
		И ЭтаФорма.ТекущийЭлемент = ПредПолеВВодаСуммыОплаты Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикТаймераКонтроляПотериФокусаПоляВводаСуммы",0.2, Истина);
		
    // Поле перестало быть в фокусе ввода
	ИначеЕсли ПредПолеВВодаСуммыОплаты <> Неопределено 
		И ПредПолеВВодаСуммыОплаты.Видимость = Истина Тогда
		
		ЗавершитьРедактированиеПоляВводаСуммы(ПредПолеВВодаСуммыОплаты);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РедактированиеВводаСерииСертификата

// Процедура - Начать ввод серии сертификата
// 
&НаКлиенте
Процедура НачатьВводСерииСертификата(Элемент)
	
	СтрокаВыбраннойОплаты = СтрокаДанныхДереваПоИмениЭлемента(Элемент.Имя, "ВидыОплат");
	
	Если ЭтотОбъект.ОплатаВнесено >= ЭтотОбъект.ОплатаСумма
		И СтрокаВыбраннойОплаты.Внесено = 0 Тогда 
		ПоказатьОповещениеПользователя("Оплата",,"Сумма оплаты полностью покрывает сумму документа. Новый вид оплаты не может быть добавлен.", БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное); 			
		Возврат
	КонецЕсли;		
	
	ПрефиксПоля    = ИндексСтрокиДанныхДереваПоИмениЭлемента(Элемент.Имя);
	ПолеВводаСерии = ВидыОплатСтрокаПолеВводаСерииСертификата(ПрефиксПоля);
			
	ПолеВводаСерии.Видимость = Истина;
	
	ВидыОплатСтрокаКнопкаНаименованияВидаОплат(ПрефиксПоля).Видимость         = Ложь;	
	ВидыОплатСтрокаКнопкаПредставленияСуммы(ПрефиксПоля).Видимость            = Ложь;	
	ВидыОплатСтрокаКнопкаПримененияРедактированияСуммы(ПрефиксПоля).Видимость = Истина;
    ВидыОплатСтрокаКнопкаУдаленияСуммы(ПрефиксПоля).Видимость                 = Истина;

	ТекущееПолеВводаСерииСертификата = ПолеВводаСерии;
	
	ПодключитьОбработчикОжидания("НачатьРедактированиеПоляСерииСертификата",0.1, Истина);
		
КонецПроцедуры

// Процедура - Начать редактирование поля серии сертификата
// 
&НаКлиенте
Процедура НачатьРедактированиеПоляСерииСертификата() 
	
	ЭтаФорма.ТекущийЭлемент = ТекущееПолеВводаСерииСертификата;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения ввода серии сертификата.
//
Процедура ЗавершитьВводСерииСертификата(Элемент, ЭтоУдаление = Ложь)
	
	ПрефиксПоля = ИндексСтрокиДанныхДереваПоИмениЭлемента(Элемент.Имя);
	
	ТекущиеДанные = СтрокаДанныхДереваПоИмениЭлемента(Элемент.Имя, "ВидыОплат");
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СертификатПартия) Тогда
		
		ВидыОплатСтрокаКнопкаНаименованияВидаОплат(ПрефиксПоля).Видимость         = Истина;	
		ВидыОплатСтрокаКнопкаПредставленияСуммы(ПрефиксПоля).Видимость            = Истина;	
		ВидыОплатСтрокаКнопкаПримененияРедактированияСуммы(ПрефиксПоля).Видимость = Ложь;
		ВидыОплатСтрокаКнопкаУдаленияСуммы(ПрефиксПоля).Видимость                 = Истина;
		
		ОплатаСуммаПриИзменении(ТекущиеДанные);

	Иначе
		
		Если ЭтоУдаление = Истина Тогда
			
			ТекущиеДанные.ВводСерииСертификата = Неопределено;
			ВидыОплатСтрокаПолеВводаСерииСертификата(ПрефиксПоля).Видимость           = Ложь;
			ВидыОплатСтрокаКнопкаНаименованияВидаОплат(ПрефиксПоля).Видимость         = Истина;	
			ВидыОплатСтрокаКнопкаПредставленияСуммы(ПрефиксПоля).Видимость            = Ложь;	
			ВидыОплатСтрокаКнопкаПримененияРедактированияСуммы(ПрефиксПоля).Видимость = Ложь;
			ВидыОплатСтрокаКнопкаУдаленияСуммы(ПрефиксПоля).Видимость                 = Ложь;
			
			ОплатаСуммаПриИзменении(ТекущиеДанные);

		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ПолеВводаСерииСертификата_ПриИзменении(Элемент)
	
	ТекущиеДанные   = СтрокаДанныхДереваПоИмениЭлемента(Элемент.Имя, "ВидыОплат");	
	СписокУточнения = ПолучитьСписокСертификатовПоСерии(ТекущиеДанные.ВводСерииСертификата, Контрагент, СтруктурнаяЕдиница);
	
	Если СписокУточнения.Количество() > 1 Тогда
		
		Если ТекущееПолеВводаСерииСертификата = Неопределено Тогда
			ТекущееПолеВводаСерииСертификата = Элемент;
			ПодключитьОбработчикОжидания("ПоказатьВыборСертификатаИзСписка", 0.1, Истина);
		Иначе
			
			ДопПараметры = Новый Структура("Элемент", Элемент);
			Оповещение   = Новый ОписаниеОповещения("ВыборСертификатаЗавершение", ЭтотОбъект, ДопПараметры);
			ПоказатьВыборИзМеню(Оповещение, СписокУточнения, Элемент);
			
			ТекущееПолеВводаСерииСертификата = Неопределено;
			
		КонецЕсли;
		
		Возврат;
		
	ИначеЕсли СписокУточнения.Количество() > 0 Тогда
		ВыполнитьОбработкуОповещения(Новый ОписаниеОповещения("ВыборСертификатаЗавершение",ЭтотОбъект, Новый Структура("Элемент", Элемент)), СписокУточнения[0]);
	Иначе
		Элемент.ЦветРамки = WebЦвета.Красный;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик ожидания.
//
Процедура ПоказатьВыборСертификатаИзСписка()
	
	Если ТекущееПолеВводаСерииСертификата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолеВводаСерииСертификата_ПриИзменении(ТекущееПолеВводаСерииСертификата);
	
КонецПроцедуры

&НаКлиенте
// Функция, возвращает список доступных для выбора сертификатов.
//
Функция ПолучитьСписокСертификатовПоСерии(СерияСертификата, Контрагент, СтруктурнаяЕдиница)
	
	ДанныеСертификата               = ПолучитьСертификат(СерияСертификата, Ложь, Контрагент, СтруктурнаяЕдиница);
	МассивСертификатовДляИсключения = ПолучитьСертификатыПроданныеВОплачиваемыхДокументах(ДокументыЗадолженности.ВыгрузитьЗначения(), СерияСертификата, Контрагент, СтруктурнаяЕдиница);

	Счетчик = 0;
	Для Каждого ЭлементМассива Из ДанныеСертификата Цикл
		
		Если МассивСертификатовДляИсключения.Найти(ЭлементМассива.Сертификат) <> Неопределено Тогда
			ДанныеСертификата.Удалить(Счетчик);
			Счетчик = Счетчик + 1;
            Продолжить;
		КонецЕсли;
		
		Использован = ПроверитьИспользованиеСертификата(ЭлементМассива.Сертификат, ЭлементМассива.Партия);
		Если Использован = Истина Тогда
			ДанныеСертификата.Удалить(Счетчик);
		КонецЕсли;
			
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
	СписокУточнения = Новый СписокЗначений;
	
	Если Не ЗначениеЗаполнено(ДанныеСертификата) Тогда
		ПоказатьОповещениеПользователя("Оплата",, "Сертификат не найден", БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное);
	Иначе
		Для Каждого ЭлементМ ИЗ ДанныеСертификата Цикл
			Если ЭлементМ.Использовать Тогда
				СписокУточнения.Добавить(ЭлементМ, ЭлементМ.Представление);
			Иначе
				ПоказатьОповещениеПользователя("Оплата",, ЭлементМ.ОписаниеПроверки, БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокУточнения;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает найденные сертификаты.
//
Функция ПолучитьСертификат(ШтрихкодСерияСертифката, ВводСоСканера, Контрагент, СтруктурнаяЕдиница)
	
	ДанныеСертификатов = ЛицевыеСчетаИСертификатыСервер.ПолучитьДанныеВсехСертификатовПоШтрихкодуИлиСерииПроверитьПригодность(
		ШтрихкодСерияСертифката,
		ВводСоСканера,
		Контрагент,
		СтруктурнаяЕдиница);
	
	Возврат ДанныеСертификатов;
	
КонецФункции

&НаСервере
// Функция - Проверить использование сертификата
//
Функция ПроверитьИспользованиеСертификата(Сертификат, Партия)
	
	СтрокаСертификата = НайтиВДеревеДоступныхВидовОплатСервер(
		Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат,
		,,
		Партия,,
		Истина);
	
	Если СтрокаСертификата <> Неопределено И СтрокаСертификата.Внесено > 0 Тогда
		 Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает сертификаты, проданные в оплачевыемых документах.
//
Функция ПолучитьСертификатыПроданныеВОплачиваемыхДокументах(Знач МассивДокументов, СерияСертификата, Контрагент, СтруктурнаяЕдиница)
	
	Если МассивДокументов.Количество() > 0 Тогда
			
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СертификатыОбороты.Сертификат КАК Сертификат
		|ИЗ
		|	РегистрНакопления.Сертификаты.Обороты(
		|			,
		|			,
		|			Авто,
		|			СерийныйНомер = &СерийныйНомер
		|				И Контрагент = &Контрагент
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК СертификатыОбороты
		|ГДЕ
		|	СертификатыОбороты.Регистратор В(&МассивРегистраторов)
		|	И СертификатыОбороты.СуммаПриход > 0";
		Запрос.УстановитьПараметр("МассивРегистраторов", МассивДокументов);
		Запрос.УстановитьПараметр("СерийныйНомер"      , СерияСертификата);
		Запрос.УстановитьПараметр("Контрагент"         , Контрагент);
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница" , СтруктурнаяЕдиница);

		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сертификат");

	Иначе
		Возврат Новый Массив;
	КонецЕсли;
	
КонецФункции

// Процедура - Уточнить выбор сертификата завершение
// 
&НаКлиенте
Процедура ВыборСертификатаЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		НайденныйУзел = НайтиВДеревеДоступныхВидовОплат(ЭтотОбъект.ВидыОплат, ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ПодарочныйСертификат"),,
			Результат.Значение.Партия);
		
		Если ЗначениеЗаполнено(НайденныйУзел) Тогда		
			ПоказатьОповещениеПользователя("Оплата",,"Данный сертифкат уже добавлен в виды оплат!", БиблиотекаКартинок.Предупреждение32,
				СтатусОповещенияПользователя.Важное);
			ДопПараметры.Элемент.ЦветРамки = WebЦвета.Красный;
			Возврат;		
		КонецЕсли;        		
		
		ДобавитьВыбранныйСертификатВВидыОплат(Результат.Значение);
		
		ЗавершитьВводСерииСертификата(ДопПараметры.Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВводВидаЛицевогоСчета

// Процедура - Начать ввод вида лицевого счета
// 
// Параметры:
//  Элемент	 - 	 - 
// 
&НаКлиенте
Процедура НачатьВводВидаЛицевогоСчета(Элемент)
	
	ПрефиксПоля    = ИндексСтрокиДанныхДереваПоИмениЭлемента(Элемент.Имя);
	ПолеВводаСерии = ВидыОплатСтрокаПолеВыбораВидаЛицевогоСчета(ПрефиксПоля);
			
	ПолеВводаСерии.Видимость = Истина;
	
	ВидыОплатСтрокаКнопкаНаименованияВидаОплат(ПрефиксПоля).Видимость         = Ложь;	
	ВидыОплатСтрокаКнопкаПредставленияСуммы(ПрефиксПоля).Видимость            = Ложь;	
	ВидыОплатСтрокаКнопкаПримененияРедактированияСуммы(ПрефиксПоля).Видимость = Истина;
    ВидыОплатСтрокаКнопкаУдаленияСуммы(ПрефиксПоля).Видимость                 = Истина;

	Попытка
		Если ПолеВводаСерии.ПодсказкаВвода = "Выберите вид лицевого счета" Тогда
			МассивОтбораВременный = Новый Массив;
			ОрганизацияОтбора = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ТекущаяКасса, "Организация");
			МассивОтбораВременный.Добавить(Новый ПараметрВыбора("Отбор.Организация"	, ОрганизацияОтбора)); 
			МассивОтбораВременный.Добавить(Новый ПараметрВыбора("Отбор.Ссылка"	    , ПолучитьМассивНеИспользуемыхВидовЛицевыхСчет(ОрганизацияОтбора))); 
			ПолеВводаСерии.ПараметрыВыбора = Новый ФиксированныйМассив(МассивОтбораВременный);
		КонецЕсли;   
	Исключение КонецПопытки;
	
	ТекущееПолеВводаСерииСертификата = ПолеВводаСерии;
	
КонецПроцедуры

&НаСервере
// Функция возвращает массив используемых видов лицевых счетов.
//
Функция ПолучитьМассивНеИспользуемыхВидовЛицевыхСчет(Организация)
	
	МассивИспользуемыхВидовЛицевыхСчетов = Новый Массив;
	
	Для Каждого СтрокаВерхУровня Из ЭтотОбъект.ВидыОплат.ПолучитьЭлементы() Цикл 		
		Если СтрокаВерхУровня.ТипДенежныхСредств <> ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ЛицевойСчет") Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Строка Из СтрокаВерхУровня.ПолучитьЭлементы() Цикл
			Если ЗначениеЗаполнено(Строка.ЛицевойСчет) Тогда
				МассивИспользуемыхВидовЛицевыхСчетов.Добавить(ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Строка.ЛицевойСчет, "ВидЛицевогоСчета"));
			КонецЕсли;			
		КонецЦикла;   		
	КонецЦикла;
	        	
	Возврат ПолучитьМассивВидовЛицевыхСчетов(Организация, МассивИспользуемыхВидовЛицевыхСчетов);
	
КонецФункции 

&НаСервере
// Функция возвращает массив видоы лицевых счетов.
//
Функция ПолучитьМассивВидовЛицевыхСчетов(Организация, МассивИсключения)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЛицевыхСчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыЛицевыхСчетов КАК ВидыЛицевыхСчетов
	|ГДЕ
	|	ВидыЛицевыхСчетов.ПометкаУдаления = ЛОЖЬ
	|	И ВидыЛицевыхСчетов.Внешний = ЛОЖЬ
	|	И НЕ ВидыЛицевыхСчетов.Ссылка В (&МассивИсключения)
	|	И (ВидыЛицевыхСчетов.НеВестиУчетВРазрезеОрганизаций
	|			ИЛИ ВидыЛицевыхСчетов.Организация = &Организация)");
	
	Запрос.УстановитьПараметр("МассивИсключения", МассивИсключения);
	Запрос.УстановитьПараметр("Организация"		, Организация);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Процедура - Завершить ввод вида лицевого счета
// 
// Параметры:
//  Элемент	 - 	 - 
// 
&НаКлиенте
Процедура ЗавершитьВводВидаЛицевогоСчета(Элемент)
	
	ПрефиксПоля = ИндексСтрокиДанныхДереваПоИмениЭлемента(Элемент.Имя);

	ТекущиеДанные = СтрокаДанныхДереваПоИмениЭлемента(Элемент.Имя, "ВидыОплат");
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ВыборВидаЛицевогоСчета) Тогда
		
		ВидыОплатСтрокаКнопкаНаименованияВидаОплат(ПрефиксПоля).Видимость         = Истина;	
		ВидыОплатСтрокаКнопкаПредставленияСуммы(ПрефиксПоля).Видимость            = Истина;	
		ВидыОплатСтрокаКнопкаПримененияРедактированияСуммы(ПрефиксПоля).Видимость = Ложь;
		ВидыОплатСтрокаКнопкаУдаленияСуммы(ПрефиксПоля).Видимость                 = Истина;
		
		ЛицевойСчетКонтрагента = ВернутьЛицевойСчетКонтрагента(
									ЭтотОбъект.Контрагент,
									ТекущиеДанные.ВыборВидаЛицевогоСчета,
									ТекущаяКасса);

		Если ЛицевойСчетКонтрагента = Неопределено Тогда
			ТекущиеДанные.ЛицевойСчет = СоздатьЛицевойСчетКлиента(
											ЭтотОбъект.Контрагент,
											ТекущиеДанные.ВыборВидаЛицевогоСчета, 
											ТекущаяКасса);
		Иначе
			ТекущиеДанные.ЛицевойСчет = ЛицевойСчетКонтрагента;										
		КонецЕсли;
		

		ТекущиеДанные.Представление = ПолучитьПредставлениеЛицевогоСчета(ТекущиеДанные.ЛицевойСчет);					
						
		СуммаОжидаемогоПлатежа     = ЭтотОбъект.ОплатаСумма -  ЭтотОбъект.ОплатаВнесено;			
		ТекущиеДанные.Внесено      = СуммаОжидаемогоПлатежа;
		ТекущиеДанные.Контрагент   = ЭтотОбъект.Контрагент;
		ТекущиеДанные.КассаОплаты  = ЭтотОбъект.ТекущаяКасса;

	Иначе
		
		ТекущиеДанные.ВводСерииСертификата = Неопределено;
		ВидыОплатСтрокаПолеВыбораВидаЛицевогоСчета(ПрефиксПоля).Видимость         = Ложь;
		ВидыОплатСтрокаКнопкаНаименованияВидаОплат(ПрефиксПоля).Видимость         = Истина;	
		ВидыОплатСтрокаКнопкаПредставленияСуммы(ПрефиксПоля).Видимость            = Ложь;	
		ВидыОплатСтрокаКнопкаПримененияРедактированияСуммы(ПрефиксПоля).Видимость = Ложь;
		ВидыОплатСтрокаКнопкаУдаленияСуммы(ПрефиксПоля).Видимость                 = Ложь;

	КонецЕсли;
	
	ОплатаСуммаПриИзменении(ТекущиеДанные);
		
КонецПроцедуры

// Функция - Создать лицевой счет клиента
// 
// Параметры:
//  Контрагент		 - 	 - 
//  ВидЛицевогоСчета - 	 - 
//  Касса			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
&НаСервереБезКонтекста
Функция СоздатьЛицевойСчетКлиента(Контрагент, ВидЛицевогоСчета, Касса)
	
	Возврат Неопределено;
		
КонецФункции
									
// Функция - Создать лицевой счет клиента
//
// Параметры:
//  Контрагент		 - 	 - 
//  ВидЛицевогоСчета - 	 - 
//  Касса			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаСервереБезКонтекста
Функция ВернутьЛицевойСчетКонтрагента(Контрагент, ВидЛицевогоСчета, Касса)
	
	Возврат Неопределено;
	
КонецФункции								

&НаСервереБезКонтекста
// Функция возвращает представление лице. счета.
//
Функция ПолучитьПредставлениеЛицевогоСчета(ЛицевойСчет)
	
	Возврат ""; 
	
КонецФункции

#КонецОбласти

#КонецОбласти

&НаСервере
// Функция рекурсивного поиска в дереве доступных видов оплаты
Функция НайтиВВерхнемУровнеДереваДоступныхВидовОплат(ТипДенежныхСредств)
	
	ДочерниеЭлементы = ВидыОплат.ПолучитьЭлементы();	
	Для Каждого Элемент ИЗ ДочерниеЭлементы Цикл	
		
		Если Элемент.ТипДенежныхСредств = ТипДенежныхСредств Тогда			
			Возврат Элемент;
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецФункции

&НаСервере
// Функция - Найти все сертифкаты в дереве доступных видов оплат сервер
// 
// Возвращаемое значение:
//   - 
// 
Функция НайтиВсеСтрокиСертифкатовВДеревеДоступныхВидовОплатСервер()
	
	СтрокиСертификатов = НайтиВВерхнемУровнеДереваДоступныхВидовОплат(Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат);
	МассивСертификатов = Новый Массив;
	
	Если СтрокиСертификатов <> Неопределено Тогда
		
		Для Каждого СтрокаТ ИЗ СтрокиСертификатов.ПолучитьЭлементы() Цикл
			
			Если ЗначениеЗаполнено(СтрокаТ.СертификатПартия) Тогда
				МассивСертификатов.Добавить(СтрокаТ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

    Возврат МассивСертификатов;
	
КонецФункции

&НаКлиенте
// Функция рекурсивного поиска в дереве доступных видов оплаты
Функция НайтиВДеревеДоступныхВидовОплат(	
	ТипДенСредств,
	ЛицевойСчет = Неопределено,								 
	ЭквайрингНомерПлатежнойКарты = Неопределено,
	Сертификат = Неопределено)
	
	МассивСтрок = Новый Массив;
	
	Для Каждого ЭлементВерхУр ИЗ ЭтотОбъект.ВидыОплат.ПолучитьЭлементы() Цикл	
		
		Если ЭлементВерхУр.ТипДенежныхСредств <> ТипДенСредств Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если ЛицевойСчет = Неопределено 
			И ЭквайрингНомерПлатежнойКарты = Неопределено
			И Сертификат = Неопределено Тогда
			
			МассивСтрок.Добавить(ЭлементВерхУр);
			Продолжить;
			
		КонецЕсли;
		
		Если ЛицевойСчет <> Неопределено 
			И ЭлементВерхУр.ЛицевойСчет = ЛицевойСчет Тогда
			
			МассивСтрок.Добавить(ЭлементВерхУр);
			Продолжить;
			
		КонецЕсли;
		
		Если ЭквайрингНомерПлатежнойКарты <> Неопределено 
			И ЭлементВерхУр.ЭквайрингНомерПлатежнойКарты = ЭквайрингНомерПлатежнойКарты Тогда
			
			МассивСтрок.Добавить(ЭлементВерхУр);
			Продолжить;
			
		КонецЕсли;
		
		Если Сертификат <> Неопределено 
			И ЭлементВерхУр.Сертификат = Сертификат Тогда
			
			МассивСтрок.Добавить(ЭлементВерхУр);
			Продолжить;
			
		КонецЕсли;
		
		Для Каждого ЭлементНизУр ИЗ ЭлементВерхУр.ПолучитьЭлементы() Цикл	
			
			Если ЭлементНизУр.ТипДенежныхСредств <> ТипДенСредств Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Если ЛицевойСчет = Неопределено 
				И ЭквайрингНомерПлатежнойКарты = Неопределено
				И Сертификат = Неопределено Тогда
				
				МассивСтрок.Добавить(ЭлементНизУр);
				Продолжить;
				
			КонецЕсли;

			Если ЛицевойСчет <> Неопределено 
				И ЭлементНизУр.ЛицевойСчет = ЛицевойСчет Тогда
				
				МассивСтрок.Добавить(ЭлементНизУр);
				Продолжить;
				
			КонецЕсли;
			
			Если ЭквайрингНомерПлатежнойКарты <> Неопределено 
				И ЭлементНизУр.ЭквайрингНомерПлатежнойКарты = ЭквайрингНомерПлатежнойКарты Тогда
				
				МассивСтрок.Добавить(ЭлементНизУр);
				Продолжить;
				
			КонецЕсли;
			
			Если Сертификат <> Неопределено 
				И ЭлементНизУр.Сертификат = Сертификат Тогда
				
				МассивСтрок.Добавить(ЭлементНизУр);
				Продолжить;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат МассивСтрок;

КонецФункции

&НаСервере
// Функция рекурсивного поиска в дереве доступных видов оплаты
Функция НайтиВДеревеДоступныхВидовОплатСервер(	
		ТипДенСредств,
		ВидЛицевогоСчета = Неопределено,								 
		ЭквайрингНомерПлатежнойКарты = Неопределено,
		СертификатПартия = Неопределено,
		ИсточникДанных = Неопределено,
		ПервуюСтроку = Ложь,
		ПоследнююСтроку = Ложь,
		ДокументАванса = Неопределено,
		Представление = Неопределено,
		БонусныйСчет = Неопределено,
		Пациент = Неопределено,
		ЭквайринговыйТерминал = Неопределено)
	
	Если ИсточникДанных = Неопределено Тогда
		ИсточникДанных = ЭтотОбъект.ВидыОплат;
	КонецЕсли;
	
	МассивСтрок = Новый Массив;
	
	Для Каждого ЭлементВерхУр ИЗ ИсточникДанных.ПолучитьЭлементы() Цикл	
				
		Если ЭлементВерхУр.ТипДенежныхСредств <> ТипДенСредств Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если ТипДенСредств = Перечисления.ТипыДенежныхСредств.Аванс
			И Представление <> Неопределено 
			И ЭлементВерхУр.Представление = Представление Тогда
			
			МассивСтрок.Добавить(ЭлементВерхУр);
			Прервать;

		КонецЕсли;
		
		Если ТипДенСредств = Перечисления.ТипыДенежныхСредств.БонусныйСчет
			И Представление <> Неопределено 
			И ЭлементВерхУр.Представление = Представление Тогда
			
			МассивСтрок.Добавить(ЭлементВерхУр);
			Прервать;

		КонецЕсли;

		Если ВидЛицевогоСчета = Неопределено 
			И ЭквайрингНомерПлатежнойКарты = Неопределено
			И СертификатПартия = Неопределено
			И ЭквайринговыйТерминал = Неопределено
			И ТипДенСредств <> Перечисления.ТипыДенежныхСредств.Аванс
			И ТипДенСредств <> Перечисления.ТипыДенежныхСредств.БонусныйСчет Тогда
			
			МассивСтрок.Добавить(ЭлементВерхУр);
			Продолжить;
			
		КонецЕсли;
	
		Если БонусныйСчет <> Неопределено И ЭлементВерхУр.БонусныйСчет = БонусныйСчет Тогда
			
			МассивСтрок.Добавить(ЭлементВерхУр);
			Продолжить;
			
		КонецЕсли;
		
		Если ВидЛицевогоСчета <> Неопределено И ЭлементВерхУр.ВидЛицевогоСчета = ВидЛицевогоСчета 
			ИЛИ ВидЛицевогоСчета = Справочники.ВидыЛицевыхСчетов.ПустаяСсылка() И ЭлементВерхУр.ВидЛицевогоСчета = Неопределено Тогда
			
			МассивСтрок.Добавить(ЭлементВерхУр);
			Продолжить;
			
		КонецЕсли;

		Если ЭквайрингНомерПлатежнойКарты <> Неопределено 
			И ЭлементВерхУр.ЭквайрингНомерПлатежнойКарты = ЭквайрингНомерПлатежнойКарты Тогда
			
			МассивСтрок.Добавить(ЭлементВерхУр);
			Продолжить;
			
		КонецЕсли;
		
		Если СертификатПартия <> Неопределено 
			И ?(ЭлементВерхУр.СертификатПартия = Неопределено, Справочники.ПартииНоменклатуры.ПустаяСсылка(), ЭлементВерхУр.СертификатПартия) = СертификатПартия Тогда
			
			МассивСтрок.Добавить(ЭлементВерхУр);
			Продолжить;
			
		КонецЕсли;
		
		Если ЭквайринговыйТерминал <> Неопределено 
			И ЭлементВерхУр.ЭквайринговыйТерминал = ЭквайринговыйТерминал Тогда
			
			МассивСтрок.Добавить(ЭлементВерхУр);
			Продолжить;
			
		КонецЕсли;
		
		Для Каждого ЭлементНизУр ИЗ ЭлементВерхУр.ПолучитьЭлементы() Цикл	
			
			Если ЭлементНизУр.ТипДенежныхСредств <> ТипДенСредств Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Если ВидЛицевогоСчета = Неопределено 
				И ЭквайрингНомерПлатежнойКарты = Неопределено
				И СертификатПартия = Неопределено 
				И БонусныйСчет = Неопределено 
				И ДокументАванса = Неопределено 
				И ЭквайринговыйТерминал = Неопределено Тогда
				
				МассивСтрок.Добавить(ЭлементНизУр);
				Продолжить;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДокументАванса) И ЭлементНизУр.ДокументАванса = ДокументАванса Тогда
				
				МассивСтрок.Добавить(ЭлементНизУр);
				Продолжить;
				
			КонецЕсли;

			Если БонусныйСчет <> Неопределено И ЭлементНизУр.БонусныйСчет = БонусныйСчет Тогда
				
				МассивСтрок.Добавить(ЭлементНизУр);
				Продолжить;
				
			КонецЕсли;
			
			Если ВидЛицевогоСчета <> Неопределено И ЭлементНизУр.ВидЛицевогоСчета = ВидЛицевогоСчета И (Пациент <> Неопределено И ЭлементНизУр.Контрагент = Пациент)
				ИЛИ ВидЛицевогоСчета = Справочники.ВидыЛицевыхСчетов.ПустаяСсылка() И ЭлементВерхУр.ВидЛицевогоСчета = Неопределено Тогда
				
				МассивСтрок.Добавить(ЭлементНизУр);
				Продолжить;
				
			КонецЕсли;
			
			Если ЭквайрингНомерПлатежнойКарты <> Неопределено 
				И ЭлементНизУр.ЭквайрингНомерПлатежнойКарты = ЭквайрингНомерПлатежнойКарты Тогда
				
				МассивСтрок.Добавить(ЭлементНизУр);
				Продолжить;
				
			КонецЕсли;
			
			Если СертификатПартия <> Неопределено 
				И ЭлементНизУр.СертификатПартия = СертификатПартия Тогда
				
				МассивСтрок.Добавить(ЭлементНизУр);
				Продолжить;
				
			КонецЕсли;
			
			Если ЭквайринговыйТерминал <> Неопределено 
				И ЭлементНизУр.ЭквайринговыйТерминал = ЭквайринговыйТерминал Тогда
				
				МассивСтрок.Добавить(ЭлементНизУр);
				Продолжить;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ПервуюСтроку = Истина Тогда
		Если МассивСтрок.Количество() > 0 Тогда
			Возврат МассивСтрок[0];
		Иначе
			Возврат Неопределено;
		КонецЕсли;		
	ИначеЕсли ПоследнююСтроку = Истина Тогда
		Если МассивСтрок.Количество() > 0 Тогда
			Возврат МассивСтрок[МассивСтрок.Количество() - 1];
		Иначе
			Возврат Неопределено;
		КонецЕсли;		
	Иначе	
		Возврат МассивСтрок;
	КонецЕсли;

КонецФункции

&НаКлиенте
// Функция рекурсивного поиска в дереве доступных видов оплаты
// 
Функция СуммаВнесенныхВидовОплат(
	ТипДенСредств = Неопределено,
	ЛицевойСчет = Неопределено,
	ЭквайрингНомерПлатежнойКарты = Неопределено,
	СертификатПартия = Неопределено)
	
	МассивСтрок = ПолучитьСтрокиСВнесеннойОплатой(ТипДенСредств, ЛицевойСчет, ЭквайрингНомерПлатежнойКарты, СертификатПартия);
	
	Сумма = 0;
	Для Каждого СтрокаОплаты ИЗ МассивСтрок Цикл			
		Сумма = Сумма + СтрокаОплаты.Внесено;		
	КонецЦикла;
	
	Возврат Сумма;
	
КонецФункции

&НаСервере
// Функция рекурсивного поиска в дереве доступных видов оплаты
// 
Функция СуммаВнесенныхВидовОплатСервер(
	ТипДенСредств = Неопределено,
	ЛицевойСчет = Неопределено,
	ЭквайрингНомерПлатежнойКарты = Неопределено,
	СертификатПартия = Неопределено,
	БонусныйСчет = Неопределено,
	Пациент = Неопределено)
	
	МассивСтрок = ПолучитьСтрокиСВнесеннойОплатойСервер(ТипДенСредств, ЛицевойСчет, ЭквайрингНомерПлатежнойКарты, СертификатПартия, БонусныйСчет, Пациент);
	
	Сумма = 0;
	Для Каждого СтрокаОплаты ИЗ МассивСтрок Цикл		
		Сумма = Сумма + СтрокаОплаты.Внесено;	
	КонецЦикла;
	
	Возврат Сумма;
	
КонецФункции

&НаСервере
// Функция рекурсивного поиска в дереве доступных видов оплаты
Процедура ОчиститьВнесенныеВидыОплат()
	
	Для Каждого ЭлементВерхУр ИЗ ЭтотОбъект.ВидыОплат.ПолучитьЭлементы() Цикл	
		
		ЭлементВерхУр.Внесено           = 0;
		ЭлементВерхУр.ОплачиваемаяСумма = 0;
			
		Для Каждого ЭлементНизУр ИЗ ЭлементВерхУр.ПолучитьЭлементы() Цикл	
			
			ЭлементНизУр.Внесено           = 0;		
			ЭлементНизУр.ОплачиваемаяСумма = 0;

		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
//Функция рекурсивного поиска в дереве доступных видов оплаты
Функция ПолучитьСтрокиСВнесеннойОплатой(
	ТипДенСредств					= Неопределено,
	ЛицевойСчет						= Неопределено,								 
	ЭквайрингНомерПлатежнойКарты	= Неопределено,
	СертификатПартия				= Неопределено)
		
	МассивСтрок = Новый Массив;

	Если ТипЗнч(ТипДенСредств) = Тип("ПеречислениеСсылка.ТипыДенежныхСредств") Тогда	
		МассивТиповДенСредств = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипДенСредств);
	Иначе
		МассивТиповДенСредств = ТипДенСредств;
	КонецЕсли;
	
	Для Каждого ЭлементВерхУр ИЗ ЭтотОбъект.ВидыОплат.ПолучитьЭлементы() Цикл	
		
		Если ЭлементВерхУр.Внесено > 0 Тогда
				
			Если МассивТиповДенСредств <> Неопределено 
				И МассивТиповДенСредств.Найти(ЭлементВерхУр.ТипДенежныхСредств) = Неопределено Тогда				
				Продолжить;
			КонецЕсли;	
			
			Если ЛицевойСчет <> Неопределено  			
				И ЭлементВерхУр.ЛицевойСчет <> ЛицевойСчет Тогда											
				Продолжить;
			КонецЕсли;
			
			Если ЭквайрингНомерПлатежнойКарты <> Неопределено  				
				И ЭлементВерхУр.ЭквайрингНомерПлатежнойКарты <> ЭквайрингНомерПлатежнойКарты Тогда													
				Продолжить;
			КонецЕсли;
			
			Если СертификатПартия <> Неопределено 				
				И ЭлементВерхУр.СертификатПартия <> СертификатПартия Тогда												
				Продолжить;
			КонецЕсли;
			
			МассивСтрок.Добавить(ЭлементВерхУр);
							
		КонецЕсли;
		
		Для Каждого ЭлементНизУр ИЗ ЭлементВерхУр.ПолучитьЭлементы() Цикл
			
			Если ЭлементНизУр.Внесено > 0 Тогда
				
				Если МассивТиповДенСредств <> Неопределено 
					И МассивТиповДенСредств.Найти(ЭлементНизУр.ТипДенежныхСредств) = Неопределено Тогда				
					Продолжить;
				КонецЕсли;	
				
				Если ЛицевойСчет <> Неопределено  			
					И ЭлементНизУр.ЛицевойСчет <> ЛицевойСчет Тогда											
					Продолжить;
				КонецЕсли;
				
				Если ЭквайрингНомерПлатежнойКарты <> Неопределено  				
					И ЭлементНизУр.ЭквайрингНомерПлатежнойКарты <> ЭквайрингНомерПлатежнойКарты Тогда													
					Продолжить;
				КонецЕсли;
				
				Если СертификатПартия <> Неопределено 				
					И ЭлементНизУр.СертификатПартия <> СертификатПартия Тогда												
					Продолжить;
				КонецЕсли;
				
				МассивСтрок.Добавить(ЭлементНизУр);
							
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат МассивСтрок;
	
КонецФункции

&НаСервере
// Функция рекурсивного поиска в дереве доступных видов оплаты
Функция ПолучитьСтрокиСВнесеннойОплатойСервер(
	ТипДенСредств = Неопределено,
	ВидЛицевогоСчета = Неопределено,								 
	ЭквайрингНомерПлатежнойКарты = Неопределено,
	СертификатПартия = Неопределено,
	БонусныйСчет = Неопределено,
	Пациент = Неопределено)
		
	МассивСтрок = Новый Массив;
	
	Для Каждого ЭлементВерхУр Из ЭтотОбъект.ВидыОплат.ПолучитьЭлементы() Цикл	
		
		Если ЭлементВерхУр.Внесено > 0 Тогда
				
			Если ТипДенСредств <> Неопределено 
				И ЭлементВерхУр.ТипДенежныхСредств <> ТипДенСредств Тогда				
				Продолжить;
			КонецЕсли;	
			
			Если ВидЛицевогоСчета <> Неопределено  			
				И ЭлементВерхУр.ВидЛицевогоСчета <> ВидЛицевогоСчета Тогда											
				Продолжить;
			КонецЕсли;
			
			Если ЭквайрингНомерПлатежнойКарты <> Неопределено  				
				И ЭлементВерхУр.ЭквайрингНомерПлатежнойКарты <> ЭквайрингНомерПлатежнойКарты Тогда													
				Продолжить;
			КонецЕсли;
			
			Если СертификатПартия <> Неопределено 				
				И ЭлементВерхУр.СертификатПартия <> СертификатПартия Тогда												
				Продолжить;
			КонецЕсли;
			
			Если БонусныйСчет <> Неопределено 				
				И ЭлементВерхУр.БонусныйСчет <> БонусныйСчет Тогда												
				Продолжить;
			КонецЕсли;
			
			Если Пациент <> Неопределено И ЭлементВерхУр.Контрагент <> Пациент Тогда 
				Продолжить;
			КонецЕсли;

			МассивСтрок.Добавить(ЭлементВерхУр);
							
		КонецЕсли;
		
		Для Каждого ЭлементНизУр ИЗ ЭлементВерхУр.ПолучитьЭлементы() Цикл	
			
			Если ЭлементНизУр.Внесено > 0 Тогда
				
				Если ТипДенСредств <> Неопределено 
					И ЭлементНизУр.ТипДенежныхСредств <> ТипДенСредств Тогда				
					Продолжить;
				КонецЕсли;	
				
				Если ВидЛицевогоСчета <> Неопределено  			
					И ЭлементНизУр.ВидЛицевогоСчета <> ВидЛицевогоСчета Тогда											
					Продолжить;
				КонецЕсли;
				
				Если ЭквайрингНомерПлатежнойКарты <> Неопределено  				
					И ЭлементНизУр.ЭквайрингНомерПлатежнойКарты <> ЭквайрингНомерПлатежнойКарты Тогда													
					Продолжить;
				КонецЕсли;
				
				Если СертификатПартия <> Неопределено 				
					И ЭлементНизУр.СертификатПартия <> СертификатПартия Тогда												
					Продолжить;
				КонецЕсли;
				
				Если БонусныйСчет <> Неопределено  			
					И ЭлементНизУр.БонусныйСчет <> БонусныйСчет Тогда											
					Продолжить;
				КонецЕсли;
				
				Если Пациент <> Неопределено И ЭлементНизУр.Контрагент <> Пациент Тогда 
					Продолжить;
				КонецЕсли;

				МассивСтрок.Добавить(ЭлементНизУр);
							
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат МассивСтрок;
	
КонецФункции

&НаКлиенте
// Функция - Существуюет оплата проведенная по карте
// 
// Возвращаемое значение:
//   - 
// 
Функция ВыполнятьОперациюПоПлатежнойКарте()
	
	Для Каждого СтрокаТ ИЗ ЭтотОбъект.ВидыОплат.ПолучитьЭлементы() Цикл
		
		Если СтрокаТ.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ПлатежнаяКарта") 
			И СтрокаТ.Внесено > 0   Тогда
			
			Возврат Истина;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

#КонецОбласти

#Область ПроведениеОплаты

&НаКлиенте
// Обработчик проведения оплаты по подготовленным данным
Процедура Оплатить(Команда)
	
	Если ПредПолеВВодаСуммыОплаты <> Неопределено Тогда
	    ЗавершитьРедактированиеПоляВводаСуммы(ПредПолеВВодаСуммыОплаты);		
	КонецЕсли;
		
	СообщениеПользователю               = "";
	ТребуетсяПодтверждениеПользователя  = Ложь;
	ОперацияРазрешена                   = Ложь;
	ОперацияОплатыПроведеноУспешно      = Ложь;
	ДанныефискальныхЧеков               = Неопределено;
	ДанныеПлатежаПоКарте                = Неопределено;
	МассивДокОплаты                     = Новый Массив;
	ОшибкаПечатиЧека 					= "";
	ЭтоВозврат = ЭтотОбъект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.Возврат");
	
	СтавкаНДСОрганизации		= ОбщегоНазначенияСтоматология.ПолучитьСтавкуНДС(СтруктурнаяЕдиница);
	СтавкаНДСОрганизацииАванс	= ОбщегоНазначенияСтоматология.ПолучитьСтавкуНДСАванс(СтруктурнаяЕдиница);

	Если ТаблицаЗадолженностейИзменена() = Истина Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ТаблицаЗадолженностейИзмененаЗавершение", ЭтотОбъект);
		ПоказатьПредупреждение(ОписаниеОповещения, НСтр("ru = 'Задолженность пациента изменилась. Форма оплаты будет обновлена.'"));
		Возврат;		
	КонецЕсли;
	
	МассивСтрок = ПолучитьСтрокиСВнесеннойОплатой(ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.СистемаБыстрыхПлатежей"));
	
	Если МассивСтрок.Количество() > 0 Тогда
		
		ТекВыбраннаяСтрока = МассивСтрок[0]; 
		
		Если ЭтоВозврат Тогда
			
			Если ЗначениеЗаполнено(ДокументыЗадолженности) И ТипЗнч(ДокументыЗадолженности[0].Значение) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
				
				СтруктураПараметров = Новый Структура();
				СтруктураПараметров.Вставить("ЭквайринговыйТерминал", ТекВыбраннаяСтрока.ЭквайринговыйТерминал);
				СтруктураПараметров.Вставить("КассаОплаты"			, ТекВыбраннаяСтрока.КассаОплаты);
				СтруктураПараметров.Вставить("Контрагент"			, ТекВыбраннаяСтрока.Контрагент);
				СтруктураПараметров.Вставить("СуммаВозвратаВРублях"	, ТекВыбраннаяСтрока.Внесено);
				СтруктураПараметров.Вставить("ВозвратОтПокупателя"	, ДокументыЗадолженности[0].Значение);
				СтруктураПараметров.Вставить("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);
				
				РезультатОперации = СсылкиНаОплатуИСБП.СформироватьВозвратПоСБП(СтруктураПараметров);
				
				Если Не РезультатОперации.ВыполненоУспешно Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.ОписаниеОшибки);
				Иначе
					ПоказатьОповещениеПользователя("Система быстрых платежей",, "Заказ передан в банк для обработки возврата и через некоторое время будет сформирован в системе 1с");
					ЭтаФорма.Закрыть(Новый Структура("ОперацияВыполнена, ОплатаВыполнена, ТребуетсяВыполнитьОплатуВозвратаРеализации", Истина, Истина, Ложь));
				КонецЕсли;
				
				Возврат;
				
			Иначе
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Невозможно сформировать возврат через СБП по данному документу");
				Возврат;	
				
			КонецЕсли;
			
		Иначе 
			
			ЗавершитьВводСуммыОплатыСБП(ТекВыбраннаяСтрока);
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтотОбъект.ТекущаяКассаИспользуетсяККТ Тогда
		
		ВыполнятьОперациюНаФискальнике  = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ТекущаяКасса, "ИспользоватьБезПодключенияОборудования") = Ложь; 
		
	Иначе
		
		ВыполнятьОперациюНаФискальнике  = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ТекущаяКасса, "ИспользоватьБезПодключенияОборудования") = Ложь
		И (ЭтотОбъект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.Продажа") 
		ИЛИ ЭтотОбъект.ЭтоВозвратВДеньПродажи = Истина);
		
	КонецЕсли;
	
	// Проверка возможности выполнения операции оплаты
	Если ОплатаПодготовкаПроверкаВозможностиСервер(СообщениеПользователю, ТребуетсяПодтверждениеПользователя) Тогда		
		
		// Выполнить контроль кассовой смены
		ОписаниеОшибки   					= Неопределено;
		ПараметрыИспользованияКассовойСмены = Новый Структура("ВыполнятьОперациюНаФискальнике", ВыполнятьОперациюНаФискальнике);
		РозничныеПродажиКлиент.ВыполнитьКонтрольИспользованияКассовойСмены(ЭтотОбъект, ЭтотОбъект.ТекущаяКасса, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки);
				
	// Необходимо выполнить запрос на подтверждение пользователя
	ИначеЕсли ТребуетсяПодтверждениеПользователя Тогда		
		
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаПользователяНаВопрос", ЭтотОбъект, Новый Структура("ВыполнятьОперациюНаФискальнике", ВыполнятьОперациюНаФискальнике));
		ПоказатьВопрос(Оповещение, СообщениеПользователю, РежимДиалогаВопрос.ДаНетОтмена);
		
	// Операция оплаты запрещена
	Иначе			
		
		ОперацияРазрешена = Ложь;
	    ПоказатьОповещениеПользователя("Оплата",,СообщениеПользователю, БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное); 

	КонецЕсли;
	
КонецПроцедуры

&Насервере
// Процедура - проверяет таблицу задолженности.
//   
Функция ТаблицаЗадолженностейИзменена()
	
	Флаг = Ложь;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Контрагент) Тогда
		
		// В зависимости от типа операции получаем исходные данные
		Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОпераций.Продажа Тогда
			
			Если ЭтоВзносАванса = Истина Тогда
				ЗапросПоЗадолженности = ПолучитьИсточникДанныхВзносАвансаДляТаблицыЗадолженностей();
			Иначе
			    ЗапросПоЗадолженности = ПолучитьИсточникДанныхПоПродажамДляТаблицыЗадолженностей();
			КонецЕсли;

		ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ВидыОпераций.Возврат Тогда
			ЗапросПоЗадолженности = ПолучитьИсточникДанныхПоВозвратамДляТаблицыЗадолженностей();
		КонецЕсли;
		
		ТаблицаЗадолженностейОбновленная = ЗапросПоЗадолженности.Выгрузить();
		
		МассивВыбранныхЗадолженностей = ТаблицаЗадолженностей.НайтиСтроки(Новый Структура("ПризнакВыбора", Истина));
		Для Каждого ЭлементМ Из МассивВыбранныхЗадолженностей Цикл 
			МассивВрем = ТаблицаЗадолженностейОбновленная.НайтиСтроки(Новый Структура("ДокументЗадолженности", ЭлементМ.ДокументЗадолженности));
			Если МассивВрем.Количество() = 0 Тогда
				Флаг = Истина;
				Прервать;
			КонецЕсли;
			СуммаЗадолженности = 0;
			Для Каждого ЭлементМВрем Из МассивВрем Цикл
				СуммаЗадолженности = СуммаЗадолженности + ЭлементМВрем.Задолженность;
			КонецЦикла;
			Если СуммаЗадолженности <> ЭлементМ.Задолженность Тогда
				Флаг = Истина;
				Прервать;
			КонецЕсли;				
		КонецЦикла;		

	КонецЕсли;	 	
	
	Возврат Флаг;
	
КонецФункции     

&НаКлиенте
// Процедура - обработчик оповщения "ТаблицаЗадолженностейИзмененаЗавершение".
//
Процедура ТаблицаЗадолженностейИзмененаЗавершение(ДополнительныеПараметры) Экспорт 
	
	ОбновитьФорму("ОБНОВИТЬ_ТАБЛИЦУ_ЗАДОЛЖЕННОСТЕЙ");
	
КонецПроцедуры

&НаКлиенте
// Процедура - После ответа пользователя на вопрос
// 
// Параметры:
//  Результат				 - 	 - 
//  дополнительныеПараметры	 - 	 - 
// 
Процедура ПослеОтветаПользователяНаВопрос(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда			
		
		ОписаниеОшибки   					= Неопределено;
		РозничныеПродажиКлиент.ВыполнитьКонтрольИспользованияКассовойСмены(ЭтотОбъект, ЭтотОбъект.ТекущаяКасса, ДополнительныеПараметры, ОписаниеОшибки);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Процедура выполняет проверку возможности пробития чека.
// 
Функция ОплатаПодготовкаПроверкаВозможностиСервер(СообщениеПользователю, ЗапросПодтверждения)
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ТекущаяКасса) Тогда
		
		СообщениеПользователю = "Не выбрана касса для оплаты!";
		ЗапросПодтверждения   = Ложь;
		Возврат Ложь; 	
		
	КонецЕсли;
	
	Если ЭтотОбъект.ОплатаСумма = 0 Тогда
		
		СообщениеПользователю = "Нет оплачиваемых документов!";
		ЗапросПодтверждения   = Ложь;
		Возврат Ложь; 
		
	КонецЕсли;
					
	Если ОплатаВнесено = 0  Тогда		
		
		СообщениеПользователю = "Не указана оплачиваемая сумма!";
		ЗапросПодтверждения   = Ложь;
		Возврат Ложь; 
		
	ИначеЕсли ОплатаВнесено < ОплатаСумма  Тогда		
		
		СообщениеПользователю = "Сумма внесенной оплаты меньше суммы требуемой. Продолжить?";
		ЗапросПодтверждения   = Истина;
		Возврат Ложь; 		
		
	КонецЕсли;	     
	
		// проверка на сегмент в настройках кассы
	ВходитВСегмент = ПринадлежностьКСекциям(СообщениеПользователю);
	Если Не ВходитВСегмент Тогда
		Возврат Ложь;
	КонецЕсли;  
	
	Возврат Истина;
	
КонецФункции

&НаСервере
// Обработчик проведения оплаты по подготовленным данным на сервере
Функция ОперацияОплатыСервер(ОписаниеОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивДокОплаты = Неопределено; 
	НомераЧековККМ  = Неопределено;
	НомерВходящегоДокумента = "";
	
	// ПОДГОТОВКА И ПРОВЕДЕНИЕ ДОКУМЕНТОВ ПОСТУПЛЕНИЯ ДС
	
	// Получить выбранные строки документа задолженности
	МассивОплачиваемыхСтрок = ПолучитьВыбранныеСтрокиДереваЗадолженностиСервер();
	
	МассивСтрокДереваОплата = ПолучитьСтрокиСВнесеннойОплатойСервер();
	МассивСтрокДереваОплата = ОбщегоНазначенияКлиентСерверСтоматология.КонвертироватьТаблицуВМассивСтруктур(
	МассивСтрокДереваОплата,
	"Контрагент,КассаОплаты,ТипДенежныхСредств,НаименованиеВидаОплаты,
	 |ОплачиваемаяСумма,ВидЛицевогоСчета,Сертификат,СертификатПартия,ЭквайрингНомерПлатежнойКарты,
	 |ЭквайрингСсылочныйНомер,ЭквайрингКодАвторизации,НомерЧекаЭТ, ДокументАванса, СертификатСерийныйНомер, ЭквайрингВидПлатежнойКарты, БонусныйСчет");
	
	РасшифровкаОплатВозвр = Неопределено;
	// Вызов функции формирования документов оплаты
	ID_Транзакции = Новый УникальныйИдентификатор;
	МассивДокОплаты = Обработки.ПомощникПроведенияОплаты.СоздатьДокументыОплатыПоТаблицеВидовОплат(
		ЭтотОбъект.Контрагент,
		ЭтотОбъект.ВидОперации,
		ЭтотОбъект.ТекущаяКасса,
		МассивСтрокДереваОплата, 
		МассивОплачиваемыхСтрок,
		РасшифровкаОплатВозвр,
		ОписаниеОшибки,
		ID_Транзакции);
	
	ЭтотОбъект.РасшифровкаОплатыПоДокументам = Новый ФиксированныйМассив(РасшифровкаОплатВозвр);
	
	Счетчик = 0;
	// Проведение созданных документов
	Для Каждого ДокОплаты ИЗ МассивДокОплаты Цикл
		
		ДокОплаты.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
		ДокОплаты.Записать(РежимЗаписиДокумента.Проведение);
		
		// Подмена значения в массиве на ссылку
		МассивДокОплаты[Счетчик] = ДокОплаты.Ссылка;
		Счетчик                  = Счетчик + 1;
		
	КонецЦикла;
		
	Возврат МассивДокОплаты;	
	
КонецФункции

&НаКлиенте
// Процедура - Завершающий этап операции оплаты
//
Процедура ЗавершающийЭтапОперацииОплаты(
	ОплатаЗавершенаУспешно, 
	ДанныеФискальныхЧеков,
	ДанныеПлатежаПоКарте,
	МассивДокОплаты)
		
	Если ОплатаЗавершенаУспешно = Истина Тогда
		
		МассивОплат = Новый Массив;
		Для Каждого СтрокаТ ИЗ ЭтотОбъект.ВидыОплат.ПолучитьЭлементы() Цикл
			Если СтрокаТ.Внесено > 0 Тогда
				МассивОплат.Добавить(Новый Структура("ТипДенежныхСредств, ДокументАванса, ЛицевойСчет, БонусныйСчет, Внесено",
								СтрокаТ.ТипДенежныхСредств, СтрокаТ.ДокументАванса, СтрокаТ.ВидЛицевогоСчета,  СтрокаТ.БонусныйСчет, СтрокаТ.Внесено));
			КонецЕсли;
			Для Каждого СтрокаТ ИЗ СтрокаТ.ПолучитьЭлементы() Цикл
				Если СтрокаТ.Внесено > 0 Тогда
					МассивОплат.Добавить(Новый Структура("ТипДенежныхСредств, ДокументАванса, ЛицевойСчет, БонусныйСчет, Внесено", 
								СтрокаТ.ТипДенежныхСредств, СтрокаТ.ДокументАванса, СтрокаТ.ВидЛицевогоСчета, СтрокаТ.БонусныйСчет, СтрокаТ.Внесено));
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
			
		ДанныеПоКартеУжеЗаписаны = Ложь;
		Если ЗначениеЗаполнено(ДанныеФискальныхЧеков)
			И (ЗначениеЗаполнено(ДанныеФискальныхЧеков.НомерФискальногоЧека) 
			ИЛИ ЗначениеЗаполнено(ДанныеФискальныхЧеков.НомерНеФискальногоЧека)) Тогда
				
			РежимЗаписи_ = РежимЗаписиДокумента.Запись;	
			
			// Номер чека получен успешно, дописать его в документы оплаты
			ЗаписатьДокументы(
				ТекущаяКассаИспользуетсяККТ,
				МассивДокОплаты,
				РежимЗаписи_,
				ТекущаяКасса,
				ДанныеФискальныхЧеков, 
				ДанныеПлатежаПоКарте,
				МассивОплат);
			
			ДанныеПоКартеУжеЗаписаны = Истина;
						
		КонецЕсли;
		
		Если ДанныеПоКартеУжеЗаписаны = Ложь
			И ЗначениеЗаполнено(ДанныеПлатежаПоКарте) Тогда
			
			ЗаписатьДокументы(
				ТекущаяКассаИспользуетсяККТ,
				МассивДокОплаты, 
				РежимЗаписиДокумента.Запись,
				ТекущаяКасса, 
				ДанныеФискальныхЧеков,
				ДанныеПлатежаПоКарте,
				МассивОплат);
		КонецЕсли;
		
		// Завершение операции оповещение д. списоков, закрытие/обновление формы
		ОповеститьОбИзменении(ПредопределенноеЗначение("Документ.Прием.ПустаяСсылка"));
		ОповеститьОбИзменении(ПредопределенноеЗначение("Документ.Реализация.ПустаяСсылка"));
		ОповеститьОбИзменении(ПредопределенноеЗначение("Документ.ПланЛечения.ПустаяСсылка"));
		Оповестить("ПРОВЕДЕНА_ОПЛАТА_ДОКУМЕНТА");
		Если ЭтоВзносАванса Тогда
			Оповестить("ПРОВЕДЕННО_ИЗМЕНЕНИЕ_ДОКУМЕНТА_АВАНСА");
		КонецЕсли;	
		Если ПараметрФормыЗакрыватьФормуПослеОплаты Тогда
			Закрыть(Новый Структура("ОперацияВыполнена",Истина));
		Иначе			
			
			ДокументыЗадолженности.Очистить();
			ОбновитьФорму("ОБНОВИТЬ_ТАБЛИЦУ_ЗАДОЛЖЕННОСТЕЙ",Истина);

		КонецЕсли;   
		
	Иначе
				
		// При печати чека произошла ошибка, отменить проведение документов оплаты
		Если ЗначениеЗаполнено(МассивДокОплаты) Тогда
			
			МассивОплат = Новый Массив;
						
			ЗаписатьДокументы(
				ТекущаяКассаИспользуетсяККТ, 
				МассивДокОплаты, 
				РежимЗаписиДокумента.ОтменаПроведения);	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Функция - Выполнить операцию по платежной карте
// 
// Параметры:
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ВыполнитьОперациюПоПлатежнойКарте(ОписаниеОшибки = Неопределено)
	
	СтрокиОплаты  = ПолучитьСтрокиСВнесеннойОплатой(ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ПлатежнаяКарта"));
	ДанныеПлатежа = Неопределено;
	
	Если ЗначениеЗаполнено(СтрокиОплаты) Тогда
		
		ФрПодключен = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ТекущаяКасса, "ИспользоватьБезПодключенияОборудования") = Ложь;
		
		Если ЗначениеЗаполнено(ЭквайринговыйТерминал) 
			И ФрПодключен = Истина 
			И ЭквайринговыйТерминалПодключен(ЭквайринговыйТерминал) Тогда		
						
			СсылкаНаобрудованиеФР = ПолучитьФРКассы(ТекущаяКасса);
			Если НЕ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.Возврат") Тогда
				ДанныеПлатежа = МенеджерОборудованияКлиент.ВыполнитьПоступлениеПлатежаЭквайринг(ЭквайринговыйТерминал, СсылкаНаобрудованиеФР, ЭтаФорма.УникальныйИдентификатор, СтрокиОплаты[0].Внесено, ОписаниеОшибки); 			
			Иначе
				ДанныеПлатежа = МенеджерОборудованияКлиент.ВыполнитьВозвратПлатежаЭквайринг(ЭквайринговыйТерминал, СсылкаНаобрудованиеФР, ЭтаФорма.УникальныйИдентификатор, СтрокиОплаты[0].Внесено, ОписаниеОшибки); 
			КонецЕсли;
			
		Иначе
			Возврат Новый Структура("НомерКарты,СсылочныйНомер,НомерЧека,КодАвторизации", СтрокиОплаты[0].ЭквайрингНомерПлатежнойКарты, СтрокиОплаты[0].ЭквайрингСсылочныйНомер, СтрокиОплаты[0].НомерЧекаЭТ, СтрокиОплаты[0].ЭквайрингКодАвторизации);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеПлатежа;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, определяет, что это терминал LifePay.
// 
Функция ЭквайринговыйТерминалПодключен(ЭквайринговыйТерминал)
	
	Возврат Не ЭквайринговыйТерминал.ИспользоватьБезПодключенияОборудования
		И Не ЭквайринговыйТерминал.ПодключаемоеОборудование.ДрайверОборудования.ИмяПредопределенныхДанных = "ДрайверLifePayЭквайринговыеТерминалы";
	
	КонецФункции
	
#Область ПечатьЧекаККМиКопииЧека

&НаКлиенте
// Процедура - Формирование чека ФРПосле оплаты
// 
// Параметры:
//  МассивДокОплаты	 - 	 - 
//  МассивОплат		 - 	 - 
// 
Функция ФормированиеЧекаФРФиксацияОплаты(ОписаниеОшибки, МассивДокументовОплаты = Неопределено, БезОплаты = Ложь)
	
	Если МассивДокументовОплаты = Неопределено Тогда
		МассивДокументовОплаты = Новый Массив;
	КонецЕсли;
	
	ОперацияПроведенаУспешно = Ложь;
	ДанныеФискальныхЧеков    = Неопределено;
	
	Если ИспользоватьСтаруюСистемуФормированияДляФРдляККТ(ЭтотОбъект.ТекущаяКасса) = Ложь Тогда
		ФормированиеЧека = ПодготовитьПараметрыФискальногоЧекаОплатыПродажиДляККТ(, МассивДокументовОплаты);
	Иначе
		ФормированиеЧека = ПодготовитьПараметрыФискальногоЧекаОплатыПродажиДляФР(МассивДокументовОплаты);
	КонецЕсли;
	
	Если ФормированиеЧека.Результат Тогда
		
		ИдентификаторУстройстваФР = МенеджерОборудованияВызовСервера.ПолучитьИдентификаторФискальногоРегистратораДляКассы(ЭтотОбъект.ТекущаяКасса);
		
		Если ИдентификаторУстройстваФР <> Неопределено Тогда
						
			Если ФормированиеЧека.Свойство("ФискальныйЧек") Тогда
				
				Контекст = Новый Структура();
				Контекст.Вставить("ТипЧека", Истина);	
				
				Оповещение            = Новый ОписаниеОповещения("ПробитьЧекЗавершение"            , ЭтотОбъект, Контекст);
				ПослеОткрытияЧека     = Новый ОписаниеОповещения("ПечатьЧека_ПослеОткрытияЧека"    , ЭтотОбъект, Контекст);
				ПослеОшибкиПечатиЧека = Новый ОписаниеОповещения("ПечатьЧека_ПослеОшибкиПечатиЧека", ЭтотОбъект, Контекст);
				
				ОбщиеПараметры = ФормированиеЧека.ФискальныйЧек;
				МенеджерОборудованияКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(Оповещение, УникальныйИдентификатор, ОбщиеПараметры, ИдентификаторУстройстваФР, , ПослеОткрытияЧека, ПослеОшибкиПечатиЧека);		
				
				Если ЗначениеЗаполнено(ОшибкаПечатиЧека) Тогда
					Возврат Неопределено; 
				КонецЕсли;
				
			КонецЕсли;	
			
			// Если был фискальный чек, то нефискальный чек напечатается после завершения фискального.
			Если ФормированиеЧека.Свойство("НефискальныйЧек") 
				И НЕ ЗначениеЗаполнено(ОшибкаПечатиЧека) Тогда
				
				ТекстЧека  = ФормированиеЧека.НефискальныйЧек;
				Контекст   = Новый Структура();
				Контекст.Вставить("ТипЧека", Ложь);
				Оповещение = Новый ОписаниеОповещения("ПробитьЧекЗавершение", ЭтотОбъект, Контекст);
				МенеджерОборудованияКлиент.НачатьПечатьТекста(Оповещение, УникальныйИдентификатор, ТекстЧека, ИдентификаторУстройстваФР);
				
				Если ЗначениеЗаполнено(ОшибкаПечатиЧека) Тогда
					Возврат Неопределено; 
				КонецЕсли;   
				
			КонецЕсли;			
			
		Иначе
			
			ОписаниеОшибки = НСтр("ru = 'Ошибка получения идентификатора устройства.' ; en = 'Error getting the device ID'");// ФормированиеЧека.ОписаниеОшибки;
			ТекстСообщения = НСтр("ru='При проведение оплаты произошла ошибка."
			"Дополнительное описание: %ДополнительноеОписание%';en='With holding payment happened mistake. Additional description: %ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	Иначе
		
		ОписаниеОшибки = ФормированиеЧека.ОписаниеОшибки;
		ТекстСообщения = НСтр("ru='При проведение оплаты произошла ошибка."
		"Дополнительное описание: %ДополнительноеОписание%';en='With holding payment happened mistake. Additional description: %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ДрайверОборудования = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ИдентификаторУстройстваФР, "ДрайверОборудования"); 
	
	// Печать копии чека(не фискальный)
	Если ЗначениеЗаполнено(НомерФискальногоЧека) 
		И ПечатьКопииЧека = Истина Тогда
			
		ПечатьКопииЧека(ИдентификаторУстройстваФР);
		
	КонецЕсли;
	
	ДанныеВозврата = Новый Структура;  	
	ДанныеВозврата.Вставить("НомерФискальногоЧека"			, ЭтотОбъект.НомерФискальногоЧека);
	ДанныеВозврата.Вставить("НомерНеФискальногоЧека"		, ЭтотОбъект.НомерНефискальногоЧека);
	ДанныеВозврата.Вставить("НомерВходящегоДокумента"		, ЭтотОбъект.НомерВходящегоДокумента);
	ДанныеВозврата.Вставить("ИдентификаторФискальнойЗаписи"	, ЭтотОбъект.ИдентификаторФискальнойЗаписи);
		
	НомерФискальногоЧека			= 0;
	НомерНефискальногоЧека			= 0;
	ИдентификаторФискальнойЗаписи	= Неопределено;
	ОшибкаПечатиЧека				= "";

	Возврат ДанныеВозврата;
	
КонецФункции

#Область ОбработчикиПроцессаПечатиЧека

&НаКлиенте
// Процедура, обработчик описания оповещения.
// 
Процедура ПечатьЧека_ПослеОткрытияЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	ШапкаЧека = ПараметрыВыполнения.ВходныеПараметры;
	
	Если ПараметрыВыполнения.НомерСмены <> 0 Тогда
		ШапкаЧека.НомерСмены = ПараметрыВыполнения.НомерСмены;
	КонецЕсли;
	
	Если ПараметрыВыполнения.НомерЧека <> 0 Тогда
		ШапкаЧека.НомерЧека = ПараметрыВыполнения.НомерЧека;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ПараметрыВыполнения.ОповещениеПродолжения, ПараметрыВыполнения);
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик оповещения.
// 
Процедура ПечатьЧека_ПослеОшибкиПечатиЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт

	ШапкаЧека = ПараметрыВыполнения.ВходныеПараметры;
	ШапкаЧека.НомерЧека = ШапкаЧека.НомерЧека + 1000000;

КонецПроцедуры

&НаКлиенте
// Процедура, завершение пробития чека на ФР.
// 
Процедура ПробитьЧекЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		
		// Установить полученное значение номера чека реквизиту документа.
		Если РезультатВыполнения.ВыходныеПараметры <> Неопределено Тогда
			Если Параметры.ТипЧека Тогда
				Если РезультатВыполнения.Свойство("ИдентификаторУстройства")
					И ЗначениеЗаполнено(РезультатВыполнения.ИдентификаторУстройства)
					И ТипЗнч(РезультатВыполнения.ИдентификаторУстройства) = Тип("СправочникСсылка.ПодключаемоеОборудование")
					И ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(РезультатВыполнения.ИдентификаторУстройства, "ТипОборудования")
						= ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ККТ") Тогда
					
					НомерФискальногоЧека = РезультатВыполнения.ВыходныеПараметры[1];
				Иначе
					НомерФискальногоЧека = РезультатВыполнения.ДополнительныеПараметры.НомерЧека;	
				КонецЕсли;
			Иначе
				НомерНефискальногоЧека = РезультатВыполнения.ВыходныеПараметры[1];
			КонецЕсли;	
			Если РезультатВыполнения.ВыходныеПараметры.Количество() = 8 Тогда
				НомерВходящегоДокумента = РезультатВыполнения.ВыходныеПараметры[7];	
			КонецЕсли;  
			// Если ФискальныеОперации не был записан - произошла ошибка при записи.
			Если РезультатВыполнения.ВыходныеПараметры.Количество() > 8 Тогда
				ПараметрыФискализации = РезультатВыполнения.ВыходныеПараметры[8];
				ИдентификаторФискальнойЗаписи = ПараметрыФискализации.ИдентификаторФискальнойЗаписи;
				Если НЕ ПараметрыФискализации.ОперацияЗаписана Тогда
					МенеджерОборудованияВызовСервера.ЗаписатьФискальнуюОперацию(ПараметрыФискализации);
				КонецЕсли;
				Если НЕ ПустаяСтрока(ПараметрыФискализации.ЧекКоррекцииСторно)
					И НЕ ПараметрыФискализации.ЧекКоррекцииСторно.ОперацияЗаписана Тогда
					МенеджерОборудованияВызовСервера.ЗаписатьФискальнуюОперацию(ПараметрыФискализации.ЧекКоррекцииСторно);
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;
		
	Иначе 		
		
		ТекстСообщения = НСтр("ru='При печати чека произошла ошибка.
								|Чек не напечатан на фискальном регистраторе.
								|Дополнительное описание:
								|%ДополнительноеОписание%';en='With print check happened mistake.
								|Check not printedby on fiscal registrar.
								|Additional description:
								|%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ОшибкаПечатиЧека = РезультатВыполнения.ОписаниеОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПодготовкаДанныхЧека

&НаСервере
// Функция - Подготовить параметры чека на печать.
// 
// Возвращаемое значение:
//   - 
//
Функция ПодготовитьПараметрыФискальногоЧекаОплатыПродажиДляККТ(БезОплаты = Ложь, МассивДокументовОплаты = Неопределено)
	
	Если МассивДокументовОплаты = Неопределено Тогда
		МассивДокументовОплаты = Новый Массив;	
	КонецЕсли;	
	
	ВсеДокументы = ПолучитьДокументыЗадолженностиСервер(Истина);
	ВидНалога    = ?(ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("ВидНалога"		, ВсеДокументы[0].Метаданные()), ВсеДокументы[0].ВидНалога, Неопределено);
	Организация  = ?(ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("Организация"	, ВсеДокументы[0].Метаданные()), ВсеДокументы[0].Организация, ВсеДокументы[0].СтруктурнаяЕдиница.Организация);

	ПараметрыЧека = МенеджерОборудованияВызовСервера.ПустаяСтруктураПараметровЧека();	
	
	ПараметрыЧека.ВидОперации             = ЭтотОбъект.ВидОперации;
	ПараметрыЧека.СтруктурнаяЕдиница      = СтруктурнаяЕдиница;
	ПараметрыЧека.Организация             = Организация;
	ПараметрыЧека.Сотрудник               = Сотрудник;
	ПараметрыЧека.Клиент                  = Контрагент;
	ПараметрыЧека.Дата                    = ДатаПродажи;
	ПараметрыЧека.Касса                   = ТекущаяКасса;
	ПараметрыЧека.Количество              = 1;	
	ПараметрыЧека.СуммаОплачено           = ?(БезОплаты = Ложь, ЭтотОбъект.ОплатаВнесено - ЭтотОбъект.ОплатаСдача, 0);
	ПараметрыЧека.ВыводитьЧекНаБумагу     = ЭтотОбъект.ЧекПечатать;
    ПараметрыЧека.ЭлектроннаяПочтаКлиента = ?(ЭтотОбъект.ЧекККТОтправлятьЧекНаЭлПочту, ЭтотОбъект.ЧекККТКонтактыКлиентаПочта  , Неопределено);
	ПараметрыЧека.НомерТелефонаКлиента    = ?(ЭтотОбъект.ЧекККТОтправлятьЧекНаТелефон, ЭтотОбъект.ЧекККТКонтактыКлиентаТелефон, Неопределено);

	ПараметрыЧека.МассивПараметровТовары  = ПолучитьМассивТоваровФискальногоЧекаОплатыПродажиДляККТ(); 		
	
	АвансПоДокументамОплаты = 0; 
	ПараметрыЧека.МассивПараметровОплаты  = ?(БезОплаты = Ложь, ПолучитьМассивОплатФискальногоЧекаОплатыПродажи(АвансПоДокументамОплаты), Неопределено);
	// включаем только авансы фактической оплаты (убраны предоплаты)
		
	СуммаКОплатеПоТаблицеТоваров = 0;
	Для Каждого ЭлементМ Из ПараметрыЧека.МассивПараметровТовары Цикл
		 СуммаКОплатеПоТаблицеТоваров = СуммаКОплатеПоТаблицеТоваров + ЭлементМ.СтоимостьСоСкидкой;
	 КонецЦикла;
	 
	 ПараметрыЧека.СуммаКОплате = СуммаКОплатеПоТаблицеТоваров;      
	
	Если АвансПоДокументамОплаты > 0 Тогда
		ПараметрыЧека.МассивПараметровОплаты.Вставить(0, Новый Структура("ТипОплаты,Сумма", Перечисления.ТипыДенежныхСредств.Аванс, АвансПоДокументамОплаты));	
	КонецЕсли;

	ПараметрыЧека.ВидНалога              = ВидНалога; 
	ПараметрыЧека.ТипЧека                = ?(ЭтотОбъект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.Продажа") = Истина, 0, 1);
	
	ПараметрыЧека.МассивДокументовОснований = ОбщегоНазначенияСтоматология.ДобавитьВМассив(МассивДокументовОплаты, ВсеДокументы, Истина);
	
	// Если массив оплат пуст, возвращаем структуру без фискальных и нефискальных чеков.
	// Чек могут оплатить на счет в "1С:Отель", в таком случае ничего пробивать не надо.
	Если НЕ ПараметрыЧека.МассивПараметровОплаты = Неопределено
		И ПараметрыЧека.МассивПараметровОплаты.Количество() = 0 Тогда
		ФормированиеЧека = Новый Структура("Результат", Истина);		
	Иначе	
		ФормированиеЧека = МенеджерОборудованияВызовСервера.ПодготовитьДанныеДляПробитияФискальногоЧекаККТ(ПараметрыЧека);	
	КонецЕсли;
	
	Возврат ФормированиеЧека;
	
КонецФункции

&НаСервере
// Функция, возвращает массив товаров на печать
//
Функция ПолучитьМассивТоваровФискальногоЧекаОплатыПродажиДляККТ()
	
	МассивТоваров = Новый Массив;
			
	Для Каждого СтрокаТЧ Из ТаблицаЗадолженностей Цикл
		
		Если Не СтрокаТЧ.ПризнакВыбора Тогда
			Продолжить;
		КонецЕсли;	
		          				
		Если ТипЗнч(СтрокаТЧ.ДокументЗадолженности) = Тип("ДокументСсылка.НарядЗаказ")
			ИЛИ ТипЗнч(СтрокаТЧ.ДокументЗадолженности) = Тип("ДокументСсылка.ПланЛечения") Тогда
			// Это Аванс.	
			
			СтрокаТовара = МенеджерОборудованияВызовСервера.ПустаяСтруктураСтрокиТоваровЧека();
			
			СтрокаТовара.Номенклатура           = Неопределено;
			СтрокаТовара.Наименование           = НСтр("ru = 'Аванс от:'") + " " + Контрагент;
			СтрокаТовара.СтоимостьБезСкидки     = ОплатаВнесено;
			СтрокаТовара.СуммаСкидки            = 0;
			СтрокаТовара.СтоимостьСоСкидкой     = ОплатаВнесено;
			СтрокаТовара.Количество             = 1;
			СтрокаТовара.СтавкаНДС              = СтавкаНДСОрганизацииАванс;
			СтрокаТовара.СуммаНДС               = Ценообразование.РассчитатьСуммуНДС(ОплатаВнесено, СтавкаНДСОрганизацииАванс);
			СтрокаТовара.НомерСекции            = 2;
			СтрокаТовара.Штрихкод               = null;
			СтрокаТовара.СуммаОплачено			= ОплатаВнесено;
			СтрокаТовара.ЭтоОплатаКредита       = Ложь;  
		
			МассивТоваров.Добавить(СтрокаТовара);
			
		Иначе
			
			Если ПолучитьСуммуОплатыПоДокументуЗадолженности(СтрокаТЧ.ДокументЗадолженности) = 0 Тогда
				Продолжить;
			КонецЕсли;

			МассивТоваровДокумента = Обработки.ПомощникПроведенияОплаты.ПолучитьМассивПараметровТоваровККТ(
																			СтрокаТЧ.ДокументЗадолженности,
																			СтрокаТЧ.Оплачено,
																			ПолучитьСуммуОплатыПоДокументуЗадолженности(СтрокаТЧ.ДокументЗадолженности),
																			ЭтотОбъект.ТекущаяКасса);
																			
			ОбщегоНазначенияСтоматология.ДобавитьВМассив(МассивТоваров, МассивТоваровДокумента);																			
		КонецЕсли;
		
	КонецЦикла;
	
	// УпорядочитьПоДате(МассивТоваров);
	
	Возврат МассивТоваров;
	
КонецФункции

// Функция - Подготовить параметры чека на печать.
// 
// Возвращаемое значение:
//   - 
//
&НаСервере
Функция ПодготовитьПараметрыФискальногоЧекаОплатыПродажиДляФР(МассивДокументовОплаты = Неопределено)
	
	Если МассивДокументовОплаты = Неопределено Тогда
		МассивДокументовОплаты = Новый Массив;
	КонецЕсли;
	
	ВсеДокументы = ПолучитьДокументыЗадолженностиСервер(Истина);
	ВидНалога    = ?(ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("ВидНалога"		, ВсеДокументы[0].Метаданные()), ВсеДокументы[0].ВидНалога, Неопределено);
	Организация  = ?(ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("Организация"	, ВсеДокументы[0].Метаданные()), ВсеДокументы[0].Организация, ВсеДокументы[0].СтруктурнаяЕдиница.Организация);

	ПараметрыЧека = МенеджерОборудованияВызовСервера.ПустаяСтруктураПараметровЧека();
	
	ПараметрыЧека.ВидОперации            = ЭтотОбъект.ВидОперации;
	ПараметрыЧека.СтруктурнаяЕдиница     = СтруктурнаяЕдиница;
	ПараметрыЧека.Организация            = Организация;
	ПараметрыЧека.Сотрудник              = Сотрудник;
	ПараметрыЧека.Клиент                 = Контрагент;
	ПараметрыЧека.Дата                   = ДатаПродажи;
	ПараметрыЧека.Касса                  = ТекущаяКасса;
	ПараметрыЧека.Количество             = 1;
	// ПараметрыЧека.СуммаКОплате           = ЭтотОбъект.ОплатаСумма;
	ПараметрыЧека.СуммаОплачено          = ЭтотОбъект.ОплатаВнесено - ЭтотОбъект.ОплатаСдача;
	ПараметрыЧека.СтоимостьБезСкидки     = ЭтотОбъект.ОплатаВнесено - ЭтотОбъект.ОплатаСдача;
	
	// ККТ-ые пар-ы
	ПараметрыЧека.ВидНалога              = ВидНалога; 	
	ПараметрыЧека.ВыводитьЧекНаБумагу    = Этотобъект.ЧекПечатать;
    ПараметрыЧека.ЭлектроннаяПочтаКлиента = ?(ЭтотОбъект.ЧекККТОтправлятьЧекНаЭлПочту, ЭтотОбъект.ЧекККТКонтактыКлиентаПочта, Неопределено);
	ПараметрыЧека.НомерТелефонаКлиента    = ?(ЭтотОбъект.ЧекККТОтправлятьЧекНаТелефон, ЭтотОбъект.ЧекККТКонтактыКлиентаТелефон, Неопределено);

	ПараметрыЧека.МассивПараметровТовары = ПолучитьМассивТоваровФискальногоЧекаОплатыПродажиДляФР();
	АвансПоДокументамОплаты = 0;
	ПараметрыЧека.МассивПараметровОплаты = ПолучитьМассивОплатФискальногоЧекаОплатыПродажи(АвансПоДокументамОплаты);	
	
	Если АвансПоДокументамОплаты > 0 Тогда
		ПараметрыЧека.МассивПараметровОплаты.Вставить(0, Новый Структура("ТипОплаты,Сумма", Перечисления.ТипыДенежныхСредств.Аванс, АвансПоДокументамОплаты));	
	КонецЕсли;   
	
	ПараметрыЧека.СуммаКОплате           = ЭтотОбъект.ОплатаВнесено - ЭтотОбъект.ОплатаСдача;
	
	Если ЭтотОбъект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.Продажа")
		или ЭтотОбъект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаОтКлиента") Тогда    		
		ПараметрыЧека.Наименование = НСтр("ru='Оплата от:';en='Payment from:'") + " " + Контрагент;
		ПараметрыЧека.ТипЧека = 0;		
	Иначе		
		ПараметрыЧека.Наименование = НСтр("ru='Возврат оплаты:';en='Refund payment:'") + " " + Контрагент;	
		ПараметрыЧека.ТипЧека = 1;
	КонецЕсли;	
	
	ПараметрыЧека.МассивДокументовОснований = ОбщегоНазначенияСтоматология.ДобавитьВМассив(МассивДокументовОплаты, ВсеДокументы, Истина);
	
   	ФормированиеЧека = МенеджерОборудованияВызовСервера.ПодготовитьДанныеДляПробитияФискальногоИНеФискальногоЧекаФР(ПараметрыЧека);	

	Возврат ФормированиеЧека;
	
КонецФункции

&НаСервере
// Функция, возвращает массив товаров на печать
//
Функция ПолучитьМассивТоваровФискальногоЧекаОплатыПродажиДляФР()
		
	МассивТоваров = Новый Массив;
	Для Каждого СтрокаТЧ Из ТаблицаЗадолженностей Цикл
		
		ДокументЗадолженности = СтрокаТЧ.ДокументЗадолженности; 		
		
		Организация      = ?(ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("Организация", ДокументЗадолженности.Метаданные()),
								ДокументЗадолженности.Организация,
								ДокументЗадолженности.СтруктурнаяЕдиница.Организация);
	    СуммаВключаетНДС = Истина; 
		
		Если Не СтрокаТЧ.ПризнакВыбора Тогда
			Продолжить;
		КонецЕсли;	
		
		Если ПолучитьСуммуОплатыПоДокументуЗадолженности(СтрокаТЧ.ДокументЗадолженности) = 0 Тогда
			Продолжить;
		КонецЕсли; 
					
			СтрокаТовара = МенеджерОборудованияВызовСервера.ПустаяСтруктураСтрокиТоваровЧека();
			
			СтрокаТовара.Номенклатура           = Справочники.Номенклатура.ПустаяСсылка();
			СтрокаТовара.Наименование           = "" + ДокументЗадолженности.Метаданные().Имя + " №:" 
													+ ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(ДокументЗадолженности.Номер, СтруктурнаяЕдиница.Организация.Префикс)
													+ НСтр("ru = ' - Оплата'; en = ' -Payment'");
			СтрокаТовара.СтоимостьБезСкидки     = ОплатаВнесено - ОплатаСдача; // ОплаченоПоДок - СтрокаТЧ.Оплачено;
			СтрокаТовара.СтоимостьСоСкидкой     = ОплатаВнесено - ОплатаСдача; // ОплаченоПоДок - СтрокаТЧ.Оплачено;
			СтрокаТовара.СуммаСкидки            = 0;
			СтрокаТовара.Количество             = 1;
			СтрокаТовара.ЭтоОплатаКредита       = Ложь;// ВыполняетсяПостоплатаРеализации(ДокументЗадолженности, СтрокаТЧ.Оплачено = 0);
			СтрокаТовара.СуммаВключаетНДС		= СуммаВключаетНДС;
			
			Если ЗначениеЗаполнено(Организация) Тогда
				СтрокаТовара.СтавкаНДС			= ?(Организация.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая, Организация.СтавкаНДС, Перечисления.СтавкиНДС.БезНДС);
				СтрокаТовара.СуммаНДС  			= Цел(Ценообразование.РассчитатьСуммуНДС(СтрокаТовара.СтоимостьБезСкидки , СтрокаТовара.СтавкаНДС));
			КонецЕсли;
			
			МассивТоваров.Добавить(СтрокаТовара);	
		
	КонецЦикла;
	
	Возврат МассивТоваров;
	
КонецФункции

// Функция - Получить массив оплат на печать
// 
// Возвращаемое значение:
//   - 
// 
&НаСервере
Функция ПолучитьМассивОплатФискальногоЧекаОплатыПродажи(Аванс = 0)
	
	МассивСтрокДереваОплата = ПолучитьСтрокиСВнесеннойОплатойСервер();
	
	МассивОплат = Новый Массив;		
	Для Каждого СтрокаТ ИЗ МассивСтрокДереваОплата Цикл	
		
		Если СтрокаТ.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.БонусныйСчет Тогда
			Продолжить;
		КонецЕсли;

		Если СтрокаТ.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ЛицевойСчет  // свернуть все авансы
			ИЛИ СтрокаТ.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Аванс
			ИЛИ СтрокаТ.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат Тогда
			Аванс = Аванс + СтрокаТ.ОплачиваемаяСумма;
		Иначе
			ПараметрыТипаОплаты = МенеджерОборудованияВызовСервера.ПустаяСтруктураСтрокиПлатежаЧека();
			ПараметрыТипаОплаты.ТипОплаты = СтрокаТ.ТипДенежныхСредств;
			ПараметрыТипаОплаты.Сумма     = СтрокаТ.ОплачиваемаяСумма;		
			МассивОплат.Добавить(ПараметрыТипаОплаты);
		КонецЕсли;
		
	КонецЦикла;	

	Возврат МассивОплат;	
КонецФункции

// Функция - Получить сумму оплаты по документу задолженности
// 
// Возвращаемое значение:
//   - 
// 
&НаСервере
Функция ПолучитьСуммуОплатыПоДокументуЗадолженности(ДокументЗадолженности)
	
	Если ЭтотОбъект.РасшифровкаОплатыПоДокументам <> Неопределено Тогда
		
	    СтрокаОплаты = ОбщегоНазначенияКлиентСерверСтоматология.НайтиВМассивеСтруктур(ЭтотОбъект.РасшифровкаОплатыПоДокументам,"ДокументЗадолженности",ДокументЗадолженности);
		
		Если СтрокаОплаты <> Неопределено Тогда
			Возврат СтрокаОплаты.СуммаОплаты;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти

// Процедура - Печать копии чека
// 
&НаКлиенте
Процедура ПечатьКопииЧека(ИдентификаторУстройстваФР)
	
	ФормированиеЧека = ПодготовитьПараметрыНеФискальногоЧекаНаПечать();
	
	ТекстЧека  = ФормированиеЧека.ДанныеЧека;
	Контекст   = Новый Структура();
	Контекст.Вставить("ТипЧека", Ложь);
	Оповещение = Новый ОписаниеОповещения("ПробитьЧекЗавершение", ЭтотОбъект, Контекст);
	
	Для а = 1 По ПечатьКопииЧекаКоличество Цикл	
		МенеджерОборудованияКлиент.НачатьПечатьТекста(Оповещение, УникальныйИдентификатор, ТекстЧека, ИдентификаторУстройстваФР);			
	КонецЦикла;
	
КонецПроцедуры

// Функция - Подготовить параметры чека на печать
// 
// Возвращаемое значение:
//   - 
// 
&НаСервере
Функция ПодготовитьПараметрыНеФискальногоЧекаНаПечать()
	
	ПараметрыЧека = МенеджерОборудованияВызовСервера.ПустаяСтруктураПараметровЧека();
	
	ПараметрыЧека.СтруктурнаяЕдиница     = СтруктурнаяЕдиница;
	ПараметрыЧека.Организация            = Организация;
	ПараметрыЧека.Сотрудник              = Сотрудник;
	ПараметрыЧека.Клиент                 = Контрагент;
	ПараметрыЧека.Дата                   = ДатаПродажи;
	ПараметрыЧека.Количество             = 1;
	ПараметрыЧека.Касса                  = ТекущаяКасса;	
	ПараметрыЧека.МассивПараметровОплаты = ПолучитьМассивОплатФискальногоЧекаОплатыПродажи();	
	ПараметрыЧека.МассивПараметровТовары = ПолучитьМассивТоваровФискальногоЧекаОплатыПродажиДляККТ(); 
	ПараметрыЧека.ТипЧека                = ?(ЭтотОбъект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.Продажа") = Истина, 0, 1);
		
	ФормированиеЧека = МенеджерОборудованияВызовСервера.ПодготовитьДанныеДляПробитияНеФискальногоЧека(ПараметрыЧека);	

	Возврат ФормированиеЧека;
	
КонецФункции

#КонецОбласти

#Область ПечатьПречека

&НаКлиенте
// Обработчик команды печати пречека
Процедура Пречек(Команда)
	
	МассивДокументов = Новый Массив();
	Для Каждого СтрокаТЧ из ТаблицаЗадолженностей Цикл
		Если СтрокаТЧ.ПризнакВыбора Тогда
			МассивДокументов.Добавить(СтрокаТЧ.ДокументЗадолженности);
		КонецЕсли;
	КонецЦикла;

	МассивСтрокДереваОплата = ПолучитьСтрокиСВнесеннойОплатой();
	
	МассивОплат = Новый Массив();
	Для Каждого СтрокаТЧ Из МассивСтрокДереваОплата Цикл
		
		СтруктураОплат = Новый Структура("ТипДенежныхРедств, Внесено", СтрокаТЧ.ТипДенежныхСредств, СтрокаТЧ.ОплачиваемаяСумма);
		МассивОплат.Добавить(СтруктураОплат);   
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивДокументов) Тогда
		МенеджерОборудованияКлиент.ПечатьПречека(МассивДокументов, МассивОплат, ?(Команда = "ПриПробитииЧека", Истина, Ложь));
	Иначе
		ПоказатьОповещениеПользователя("Печать пречека",, "Не выбраны документы для печати!", БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное);
	КонецЕсли;
	
КонецПроцедуры  

#КонецОбласти

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
// Функция вернет идентификатор строки данных по имени элемента
Функция ИндексСтрокиДанныхПоИмениЭлемента(ИмяЭлемента)
	
	НомерСимвола = Найти(ИмяЭлемента,"_");
	Если НомерСимвола > 0 Тогда
		
		стрИд = Число(Прав(ИмяЭлемента,СтрДлина(ИмяЭлемента) - НомерСимвола)); 
		
		Возврат Число(стрИд);
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Функция вернет идентификатор строки данных по имени элемента
Функция СтрокаДанныхПоИмениЭлемента(ИмяЭлемента, ИмяТаблицы)

	Возврат ЭтотОбъект[ИмяТаблицы][ИндексСтрокиДанныхПоИмениЭлемента(ИмяЭлемента)];
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Функция вернет идентификатор строки данных по имени элемента
Функция ИндексСтрокиДанныхДереваПоИмениЭлемента(ИмяЭлемента)
	
	НомерСимвола = Найти(ИмяЭлемента,"_");
	Если НомерСимвола > 0 Тогда
		
		стрИд = Прав(ИмяЭлемента,СтрДлина(ИмяЭлемента) - НомерСимвола); 
		
		Возврат стрИд;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Функция вернет идентификатор строки данных по имени элемента
Функция СтрокаДанныхДереваПоИмениЭлемента(ИмяЭлемента, ИмяТаблицы)

	ИндексСтрокой = ИндексСтрокиДанныхДереваПоИмениЭлемента(ИмяЭлемента);
	
	Если СтрНайти(ИндексСтрокой,"x") > 0 Тогда
		
		НомерСимвола = Найти(ИндексСтрокой,"x");
		ид1          = Лев(ИндексСтрокой, НомерСимвола - 1);
        ид2          = Прав(ИндексСтрокой, СтрДлина(ИндексСтрокой) - НомерСимвола); 

		Возврат ЭтотОбъект[ИмяТаблицы].ПолучитьЭлементы()[Число(ид1)].ПолучитьЭлементы()[Число(ид2)];
		
	Иначе
		
		Возврат ЭтотОбъект[ИмяТаблицы].ПолучитьЭлементы()[Число(ИндексСтрокой)]
		
	КонецЕсли;
			
КонецФункции

&НаСервереБезКонтекста
// Получает ссылки на внешнее оборудование.
// 
Функция ПолучитьФРКассы(ТекущаяКасса)	
	ФискальныйРегистратор = ?(ЗначениеЗаполнено(ТекущаяКасса)
	И ЗначениеЗаполнено(ТекущаяКасса.ВнешнееОборудование),
	ТекущаяКасса.ВнешнееОборудование.Ссылка,
	Справочники.ПодключаемоеОборудование.ПустаяСсылка());
	
	Возврат ФискальныйРегистратор;
КонецФункции 

&НаСервереБезКонтекста
// Процедура - "ЗаписатьДокументы".
//
Процедура ЗаписатьДокументы(
	ТекущаяКассаИспользуетсяККТ,
		МассивДокументов, 
		РежимЗаписи_, 
		ТекущаяКасса			= Неопределено,
		НомерЧекаККМ			= Неопределено,
		ДанныеПлатежаПоКарте	= Неопределено,
		МассивОплат				= Неопределено)
		
	ПараметрыСеанса.ОбменДаннымиВключен = Истина;
	
	Для Каждого ДокСсылка Из МассивДокументов Цикл
		
		ФлагИсключения = Ложь;
		Попытка 
			ЗаписатьДокумент(
					ТекущаяКассаИспользуетсяККТ,
					ДокСсылка,
					РежимЗаписи_, 
					ТекущаяКасса,
					НомерЧекаККМ,
					ДанныеПлатежаПоКарте,
					Ложь,
					МассивОплат);
		Исключение
			ФлагИсключения = Истина;
		КонецПопытки;
		
		Если ФлагИсключения Тогда 
			Попытка 
				ЗаписатьДокумент(
						ТекущаяКассаИспользуетсяККТ,
						ДокСсылка,
						РежимЗаписи_, 
						ТекущаяКасса,
						НомерЧекаККМ,
						ДанныеПлатежаПоКарте,
						Истина,
						МассивОплат);
			Исключение
				ТекстСообщения = "Не удалось записать результат фискализации в %1" +
										?(ЗначениеЗаполнено(НомерЧекаККМ), "Номер чека: %2", "") + 
										?(ЗначениеЗаполнено(ДанныеПлатежаПоКарте),
										"Данные эквайринга: № платежной карты - %3, ссылочный Номер - %4. код авторизации - %5, номер чека - %6", "") +
										"Описание ошибки: %7";
				ТекстСообщения = СтрШаблон(ТекстСообщения,
										ДокСсылка,
										НомерЧекаККМ,
										?(ЗначениеЗаполнено(ДанныеПлатежаПоКарте), ДанныеПлатежаПоКарте.НомерКарты		, ""),
										?(ЗначениеЗаполнено(ДанныеПлатежаПоКарте), ДанныеПлатежаПоКарте.СсылочныйНомер	, ""),
										?(ЗначениеЗаполнено(ДанныеПлатежаПоКарте), ДанныеПлатежаПоКарте.КодАвторизации	, ""),
										?(ЗначениеЗаполнено(ДанныеПлатежаПоКарте), ДанныеПлатежаПоКарте.НомерЧека		, ""),
										ОписаниеОшибки());			
				ЗаписьЖурналаРегистрации("Оплата", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;        		
				
	КонецЦикла; 

КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - записывает документ.
//
Процедура ЗаписатьДокумент(
	ТекущаяКассаИспользуетсяККТ,
	ДокСсылка,
	РежимЗаписи, 
	ТекущаяКасса				= Неопределено,
	НомерЧекаККМ				= Неопределено,
	ДанныеПлатежаПоКарте		= Неопределено,
	ПрочитатьДокумент			= Ложь,
	МассивОплат					= Неопределено)
	
	ДокОбъект = ДокСсылка.ПолучитьОбъект();
	Если ПрочитатьДокумент Тогда
		ДокОбъект.Прочитать();
	КонецЕсли;        
	
	Если НомерЧекаККМ <> Неопределено Тогда
		
		Если ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("НомерЧекаККМ", ДокСсылка.Метаданные()) = Истина Тогда
			Если ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("ТипДенежныхСредств", ДокСсылка.Метаданные())
				ИЛИ ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
				ДокОбъект.НомерЧекаККМ = НомерЧекаККМ.НомерФискальногоЧека;		
			Иначе
				ДокОбъект.НомерЧекаККМ = НомерЧекаККМ.НомерНеФискальногоЧека;
			КонецЕсли;
		КонецЕсли;		
		
		// записываем идентификатор фискальной записи в учтенные авансы
		Если (ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.Прием") Или ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ВозвратОтПокупателя"))
			И НомерЧекаККМ.Свойство("ИдентификаторФискальнойЗаписи")
			И ЗначениеЗаполнено(НомерЧекаККМ.ИдентификаторФискальнойЗаписи)
			И ЗначениеЗаполнено(МассивОплат) Тогда			
			
			ИмяТабличнойЧасти = "УчтенныеАвансы";
			
			МассивСтрокУчтенныеАвансы = Новый Массив;
			
			Для Каждого СтрокаТ ИЗ МассивОплат Цикл
				
				//Если НЕ ЗначениеЗаполнено(СтрокаТ.ДокументАванса) Тогда					
				//	Продолжить;
				//КонецЕсли;
				
				ИскомыйАванс = СтрокаТ.ДокументАванса;
				
				МассивСтрок = ДокОбъект[ИмяТабличнойЧасти].НайтиСтроки(Новый Структура("ДокументАванса, СуммаАванса", ИскомыйАванс, СтрокаТ.Внесено));
				
				Если МассивСтрок.Количество() = 1 И НачалоДня(МассивСтрок[0].ДатаПлатежа) = НачалоДня(ТекущаяДатаСеанса()) Тогда
					МассивСтрокУчтенныеАвансы.Добавить(МассивСтрок[0]);
				ИначеЕсли МассивСтрок.Количество() > 1 Тогда
					ДатаПлатежаМаксимум = МассивСтрок[0].ДатаПлатежа;
					Для Каждого ЭлементМ Из МассивСтрок Цикл
						Если ЭлементМ.ДатаПлатежа > ДатаПлатежаМаксимум Тогда
							ДатаПлатежаМаксимум = ЭлементМ.ДатаПлатежа;
						КонецЕсли;						 
					КонецЦикла;
					МассивСтрокДата = ДокОбъект.УчтенныеАвансы.НайтиСтроки(Новый Структура("ДокументАванса, СуммаАванса, ДатаПлатежа", ИскомыйАванс, СтрокаТ.Внесено, ДатаПлатежаМаксимум));
					МассивСтрокУчтенныеАвансы.Добавить(МассивСтрокДата[0]);
				КонецЕсли;
				
				Для Каждого ЭлементМ Из МассивСтрокУчтенныеАвансы Цикл
					ЭлементМ.ИдентификаторФискальнойЗаписи = НомерЧекаККМ.ИдентификаторФискальнойЗаписи;
					ЭлементМ.НомерЧекаККМ = ?(НомерЧекаККМ.Свойство("НомерФискальногоЧека"), НомерЧекаККМ.НомерФискальногоЧека, "");
				КонецЦикла;   
				
			КонецЦикла;
			
			Если МассивСтрокУчтенныеАвансы.Количество() > 0 Тогда
				ДокОбъект.ДополнительныеСвойства.Вставить("НеПолучатьРазрешениеЗаписиПоПравам"		, Истина);
				ДокОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных"	, Истина);
				
				ДокОбъект.Записать(РежимЗаписи);
			КонецЕсли;
			
		КонецЕсли;  
	КонецЕсли;                                                                
	
	Если (ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств")
		Или ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.СписаниеДенежныхСредств"))
		И ЗначениеЗаполнено(ДанныеПлатежаПоКарте) Тогда
		
		ДокОбъект.ЭквайрингНомерПлатежнойКарты = ДанныеПлатежаПоКарте.НомерКарты;
		ДокОбъект.ЭквайрингСсылочныйНомер      = ДанныеПлатежаПоКарте.СсылочныйНомер;
		ДокОбъект.ЭквайрингКодАвторизации      = ДанныеПлатежаПоКарте.КодАвторизации;
		ДокОбъект.ЭквайрингНомерЧека           = ДанныеПлатежаПоКарте.НомерЧека;   		
	КонецЕсли;
	
	Если (ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.Реализация") Или ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.Прием"))
		И Обработки.ПомощникПроведенияОплаты.ПроверитьНеобходимостьПерепроведенияРеализацииПослеОплатыСтарая(ДокСсылка) = Истина Тогда		
		
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;	
	
	ДокОбъект.ДополнительныеСвойства.Вставить("НеПолучатьРазрешениеЗаписиПоПравам"	 , Истина);
	ДокОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
	ДокОбъект.Записать(РежимЗаписи); 
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - Записать в документ номер чека ФР
// 
// Параметры:
//  Документ	 - 	 - 
//  НомерЧекаФР	 - 	 - 
// 
Процедура ЗаписатьВДокументНомерЧекаФР(ДокументСсылка, НомерЧекаФР)
	
	ДокОбъект              = ДокументСсылка.ПолучитьОбъект();
	ДокОбъект.НомерЧекаККМ = НомерЧекаФР;
	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	
КонецПроцедуры

// Функция - Использовать старую систему формирования для ф рдля ККТ
// 
// Возвращаемое значение:
//   - 
// 
&НаСервереБезКонтекста
Функция ИспользоватьСтаруюСистемуФормированияДляФРдляККТ(Касса)	
	Возврат Справочники.Кассы.ИспользоватьСтаруюСистемуФормированияДляФРдляККТ(Касса);	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить данные сертификата
// 
// Параметры:
//  Сертификат			 - 	 - 
//  ПартияСертификата	 - 	 - 
//  ВводСоСканера		 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
функция ПолучитьДанныеСертификата(Сертификат, ПартияСертификата, ВводСоСканера, СтруктурнаяЕдиница, Контрагент)

	ДанныеСертифиаката = ЛицевыеСчетаИСертификатыСервер.ПолучитьДанныеСертификата(Сертификат, ПартияСертификата, СтруктурнаяЕдиница, Контрагент);
	ДанныеСертифиаката = ЛицевыеСчетаИСертификатыСервер.ВыполнитьПроверкуДанныхСертификата(ДанныеСертифиаката, ВводСоСканера);
	
	Возврат ДанныеСертифиаката;
	
КонецФункции

&НаКлиенте
// Процедура устанавливает цвет фона и доступность "Оплатить" в зависимости от внесенной суммы
// 
Процедура УстановитьДоступностьЦветФонаОплатить() 
	
	Элементы.Оплатить.Доступность = (ЭтотОбъект.ОплатаВнесено <> 0);
	ЦветВажного   = ПолучитьЦветаСтиля("ЦветВажного");
	ЦветНавигации = ПолучитьЦветаСтиля("ЦветАктивности");
	Элементы.ГруппаОплатить.ЦветФона = ?(ЭтотОбъект.ОплатаВнесено = 0, ЦветНавигации, ЦветВажного);
	Элементы.Оплатить.ЦветТекста     = ?(ЭтотОбъект.ОплатаВнесено = 0, WebЦвета.Черный, WebЦвета.Белый);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦветаСтиля(Имя)
	
	Возврат ЦветаСтиля[Имя];
	
КонецФункции

&НаКлиенте
// Процедура - Установить авто ввод сумм для авансов
//
Процедура УстановитьАвтоВводСуммДляАвансов()   	
	
	Если ЭтотОбъект.ВидыОплат.ПолучитьЭлементы().Количество() <> 0
		И СписокИндексовСтрок.Количество() <> 0 
		И ЭтоВзносАванса = Ложь Тогда			
		
		Элементы.ГруппаТаблицаЗадолженностей.ТолькоПросмотр = Истина;
		Для Каждого ИндексСтроки Из СписокИндексовСтрок Цикл
			
			КнопкаВидыОплатаНаименованиеСтрока     = Элементы.Найти("КнопкаВидыОплатаНаименованиеСтрока_" + Строка(ИндексСтроки));
			Если КнопкаВидыОплатаНаименованиеСтрока <> Неопределено Тогда
				ОбработчикНажатияВидыОплатВыбор(КнопкаВидыОплатаНаименованиеСтрока,,, Ложь);
				ПолеВидыОплатВводСуммыСтрока = Элементы.Найти("ПолеВидыОплатВводСуммыСтрока_" + Строка(ИндексСтроки));
				Если ПолеВидыОплатВводСуммыСтрока <> Неопределено Тогда
					ЗавершитьРедактированиеПоляВводаСуммы(ПолеВидыОплатВводСуммыСтрока)
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Вернуть имя табличной части для начисления бонусов
//
// Параметры:
//  РеализацияОбъект - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьИмяТабличнойЧастиДляНачисленияБонусов(РеализацияОбъект) 

	Если ОбщегоНазначенияСтоматология.ЕстьТабличнаяЧастьДокумента("Запасы", РеализацияОбъект.Ссылка.Метаданные())
		И РеализацияОбъект.Запасы.Количество() > 0 Тогда
		Возврат "Запасы";
	ИначеЕсли ОбщегоНазначенияСтоматология.ЕстьТабличнаяЧастьДокумента("Лечение", РеализацияОбъект.Ссылка.Метаданные())
		И РеализацияОбъект.Лечение.Количество() > 0 Тогда
		Возврат "Лечение";
	ИначеЕсли ОбщегоНазначенияСтоматология.ЕстьТабличнаяЧастьДокумента("Услуги", РеализацияОбъект.Ссылка.Метаданные())
		И РеализацияОбъект.Услуги.Количество() > 0 Тогда
		Возврат "Услуги";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

#Область ОбработчикиОповещенийАсинхронныхСобытий

&НаКлиенте
// Процедура, обработчик оповещения.
// 
Процедура ОбработкаИсключительнойСитуацииПечатиЧекаНаФРЗавершение(ОтветФормы, ДопПараметры) Экспорт
	
	ДанныефискальныхЧеков = Новый Структура("НомерФискальногоЧека, НомерНеФискальногоЧека", ОтветФормы, ОтветФормы);
	
	Если ОтветФормы <> Неопределено Тогда
		
		Если ТипЗнч(ОтветФормы) = Тип("Число") Тогда								
			ЗавершающийЭтапОперацииОплаты(Истина, ДанныефискальныхЧеков, ДопПараметры.ДанныеПлатежаПоКарте, ДопПараметры.МассивДокОплаты);		
		ИначеЕсли ТипЗнч(ОтветФормы) = Тип("Строка") И	ОтветФормы = "ПРОБИТЬ_ЧЕК" Тогда
			ПослеКонтроляИспользованияКассовойСмены(ДопПараметры.ИспользованиеКассовойСменыРазрешено, ДопПараметры.ПараметрыИспользованияКассовойСмены, ДопПараметры.ОписаниеОшибки, Истина, ДопПараметры.МассивДокОплаты, ДопПараметры.ДанныеПлатежаПоКарте);
		Иначе
			ЗавершающийЭтапОперацииОплаты(Ложь, ДанныефискальныхЧеков, ДопПараметры.ДанныеПлатежаПоКарте, ДопПараметры.МассивДокОплаты);
		КонецЕсли;
		
	Иначе		
		ЗавершающийЭтапОперацииОплаты(Ложь, ДанныефискальныхЧеков, ДопПараметры.ДанныеПлатежаПоКарте, ДопПараметры.МассивДокОплаты);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - После контроля использования кассовой смены
// 
// Параметры:
//  ИспользованиеКассовойСменыРазрешено	 - 	 - 
//  ПараметрыИспользованияКассовойСмены	 - 	 - 
//  ОписаниеОшибки						 - 	 - 
// 
Процедура ПослеКонтроляИспользованияКассовойСмены(
	ИспользованиеКассовойСменыРазрешено,
	ПараметрыИспользованияКассовойСмены,
	ОписаниеОшибки,
	ПовторноеПробитие = Ложь, 
	МассивДокОплаты = Неопределено,
	ДанныеПлатежаПоКарте = Неопределено) Экспорт 
	
	Если ТипЗнч(ОписаниеОшибки) <> Тип("Строка") Тогда
		ОписаниеОшибки = "";
	КонецЕсли;	
	
	Если ИспользованиеКассовойСменыРазрешено = Ложь Тогда
		ПоказатьОповещениеПользователя("Оплата",, "Оплата запрещена: " + ОписаниеОшибки, БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное); 
		Возврат;
	КонецЕсли;
	
	ОперацияРазрешена 					= ИспользованиеКассовойСменыРазрешено;
	ОперацияОплатыПроведеноУспешно      = Ложь;
	ОшибкаПриОплатеПлатежнойКартой		= Ложь;
	
	// Операция оплаты разрешена
	Если ОперацияРазрешена И Не ПовторноеПробитие Тогда	
		
		ОписаниеОшибки                 = Неопределено;	
		
		МассивДокОплаты = ОперацияОплатыСервер(ОписаниеОшибки);
		
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			
			ОперацияОплатыПроведеноУспешно = Ложь; 
			
		Иначе     		
			
			ОперацияОплатыПроведеноУспешно = Истина;
			ОписаниеОшибки                 = Неопределено;
			
			СтрокиОплатыСертификатом       = ПолучитьСтрокиСВнесеннойОплатой(ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ПодарочныйСертификат"));
			СтрокиОплатыЛицевымСчетом      = ПолучитьСтрокиСВнесеннойОплатой(ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ЛицевойСчет"));
			СтрокиБезОплаты				   = ПолучитьСтрокиСВнесеннойОплатой(ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ПустаяСсылка"));
			
			БезОплаты					   = ЗначениеЗаполнено(СтрокиБезОплаты);
			ВнесенаОплатаСертификатом      = ЗначениеЗаполнено(СтрокиОплатыСертификатом);
			ВнесенаОплатаЛицевымСчетом     = ЗначениеЗаполнено(СтрокиОплатыЛицевымСчетом);
			НеПробиватьЧек                 = ЭтоВзносАванса = Истина И (ВнесенаОплатаЛицевымСчетом = Истина Или ВнесенаОплатаСертификатом = Истина);			
			
			Если ОперацияОплатыПроведеноУспешно = Истина 
				И ВыполнятьОперациюПоПлатежнойКарте() = Истина Тогда				
				
				ДанныеПлатежаПоКарте           = ВыполнитьОперациюПоПлатежнойКарте(ОписаниеОшибки);
				ОперацияОплатыПроведеноУспешно = НЕ ЗначениеЗаполнено(ОписаниеОшибки) И ЗначениеЗаполнено(ДанныеПлатежаПоКарте);
				ОшибкаПриОплатеПлатежнойКартой = НЕ ОперацияОплатыПроведеноУспешно;
			КонецЕсли;
			
			Если ПараметрыИспользованияКассовойСмены.ВыполнятьОперациюНаФискальнике = Истина 
				И ОперацияОплатыПроведеноУспешно = Истина Тогда				
				
				Если ОперацияОплатыПроведеноУспешно = Истина Тогда
					
					Если НЕ НеПробиватьЧек Тогда
						
						ДанныефискальныхЧеков          = ФормированиеЧекаФРФиксацияОплаты(ОписаниеОшибки, МассивДокОплаты, БезОплаты);
						ОперацияОплатыПроведеноУспешно = НЕ ЗначениеЗаполнено(ОписаниеОшибки) И ЗначениеЗаполнено(ДанныефискальныхЧеков);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;   
	Иначе 
		
		ДанныефискальныхЧеков          = ФормированиеЧекаФРФиксацияОплаты(ОписаниеОшибки);								
		ОперацияОплатыПроведеноУспешно = НЕ ЗначениеЗаполнено(ОписаниеОшибки) И ЗначениеЗаполнено(ДанныефискальныхЧеков);
		
	КонецЕсли;	
		
	ПослеКонтроляИспользованияКассовойСменыПродолжение(
		ОперацияОплатыПроведеноУспешно, 
		НеПробиватьЧек, 
		ОшибкаПриОплатеПлатежнойКартой, 
		ДанныефискальныхЧеков, 
		ДанныеПлатежаПоКарте, 
		МассивДокОплаты, 
		ИспользованиеКассовойСменыРазрешено, 
		ПараметрыИспользованияКассовойСмены, 
		ОписаниеОшибки);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После контроля использования кассовой смены продолжение
//
Процедура ПослеКонтроляИспользованияКассовойСменыПродолжение(
		ОперацияОплатыПроведеноУспешно,
		НеПробиватьЧек, 
		ОшибкаПриОплатеПлатежнойКартой,
		ДанныефискальныхЧеков,
		ДанныеПлатежаПоКарте,
		МассивДокОплаты, 
		ИспользованиеКассовойСменыРазрешено,
		ПараметрыИспользованияКассовойСмены,
		ОписаниеОшибки)

		Если ОперацияОплатыПроведеноУспешно = Истина Тогда
			
			Если ОплатаСдача > 0 И Не НеЗачислятьСдачуНаЛицевойСчет Тогда
				
				Заголовок = ?(РежимЗачисленияСдачи = 0, "Зачислить сдачу на лицевой счет?", "Зачислить сдачу в счет аванса?");
				
				ДопПараметры = Новый Структура;
				ДопПараметры.Вставить("ОперацияОплатыПроведеноУспешно"	, ОперацияОплатыПроведеноУспешно);
				ДопПараметры.Вставить("ДанныефискальныхЧеков"			, ДанныефискальныхЧеков);
				ДопПараметры.Вставить("ДанныеПлатежаПоКарте"			, ДанныеПлатежаПоКарте);
				ДопПараметры.Вставить("МассивДокОплаты"					, МассивДокОплаты);
				ДопПараметры.Вставить("РежимЗачисленияСдачи"			, РежимЗачисленияСдачи);  			
				
				Оповещение = Новый ОписаниеОповещения("ПослеВопросаОЗачисленииСдачиНаЛицСчет", ЭтотОбъект, ДопПараметры);		
				
				ОткрытьФорму("Обработка.ПомощникПроведенияОплаты.Форма.ФормаВопросОЗачисленииСдачи", 
					Новый Структура("Заголовок", Заголовок),,,,,
					Оповещение, 
					РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);		
			Иначе						
				ЗавершающийЭтапОперацииОплаты(
					ОперацияОплатыПроведеноУспешно, 
					ДанныефискальныхЧеков, 
					ДанныеПлатежаПоКарте,
					МассивДокОплаты);
					
			КонецЕсли;
			
			Если ПечатьКвитанции
				И НЕ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.Возврат") Тогда
				МассивОплачиваемыхДокументов = ПолучитьВыбранныеДокументыЗадолженности();
				Для К = 1 По ПечатьКвитанций_Количество Цикл			
					Если МассивОплачиваемыхДокументов.Количество() > 0 Тогда
						СтруктураОплаты = Новый Структура;
						СтруктураОплаты.Вставить("ID_Транзакции", ID_Транзакции);
						УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.Прием", "ПФ_MXL_Квитанция", МассивОплачиваемыхДокументов, Неопределено);			
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ПечатьАктаОвыполненыхРаботах
				И НЕ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.Возврат") Тогда
				
				УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Прием", "ПФ_MXL_АктОВыполненныхРаботах", 
				ПолучитьВыбранныеДокументыЗадолженности(), Неопределено, Неопределено);		
			КонецЕсли;     
			
		ИначеЕсли Не ОшибкаПриОплатеПлатежнойКартой Тогда 
			
			ДопПараметры = Новый Структура("ИспользованиеКассовойСменыРазрешено, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки, ДанныеПлатежаПоКарте, МассивДокОплаты", 
			ИспользованиеКассовойСменыРазрешено, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки, ДанныеПлатежаПоКарте, МассивДокОплаты);
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИсключительнойСитуацииПечатиЧекаНаФРЗавершение", ЭтотОбъект, ДопПараметры);
			ОткрытьФорму("Обработка.ПомощникПроведенияОплаты.Форма.ОбработкаИсключительнойСитуацииПечатиЧекаНаФР", 
			Новый Структура("ДокументПродажиСсылка, Касса", Неопределено, ТекущаяКасса),,,,,
			ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		Иначе
			
			ЗавершающийЭтапОперацииОплаты(ОперацияОплатыПроведеноУспешно, ДанныефискальныхЧеков, ДанныеПлатежаПоКарте, МассивДокОплаты);	
			
		КонецЕсли; 

КонецПроцедуры

#КонецОбласти

///////////////////////////////////////////// РАБОТА С НАПРАВЛЕНИЯМИ К ВРАЧАМ ////////////////////////////////

&НаСервере
// Процедура обновляет список направлений созданных на основании документов задолженности
Процедура ОбновитьСписокНаправленийКВрачам()
	
	// Очищаем ранее созданные элементы
	Пока Элементы.ГруппаНеОбработанныеНаправленияКВрачам.ПодчиненныеЭлементы.Количество()>0 Цикл		
		Элементы.Удалить(Элементы.ГруппаНеОбработанныеНаправленияКВрачам.ПодчиненныеЭлементы[0]);		
	КонецЦикла; 
	Пока Элементы.ГруппаНеОбработанныеПовторныеПриемы.ПодчиненныеЭлементы.Количество()>0 Цикл		
		Элементы.Удалить(Элементы.ГруппаНеОбработанныеПовторныеПриемы.ПодчиненныеЭлементы[0]);		
	КонецЦикла;
	СписокНаправленийКВрачам.Очистить();
	
	ОтборДокументы      = ПолучитьДокументыЗадолженностиСервер(Ложь);	
	ЗапросВыборка       = Новый Запрос;
	ЗапросВыборка.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВложенныйЗапрос.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(ВложенныйЗапрос.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Сотрудник,
	|	ЕСТЬNULL(ВложенныйЗапрос.ФИО, """") КАК ФИО,
	|	ВложенныйЗапрос.ВидОсмотра КАК ВидОсмотра,
	|	ВложенныйЗапрос.ДатаЗапланированная КАК ДатаЗапланированная,
	|	ВложенныйЗапрос.Статус КАК Статус,
	|	ВложенныйЗапрос.ПредварительнаяЗапись КАК ПредварительнаяЗапись,
	|	ВложенныйЗапрос.ДокументСсылка КАК ДокументСсылка,
	|	ВложенныйЗапрос.ПричинаНаправления КАК ПричинаНаправления,
	|	ВложенныйЗапрос.Специализация КАК Специализация,
	|	ВложенныйЗапрос.СпециализацияПредставление КАК СпециализацияПредставление
	|ИЗ
	|	(ВЫБРАТЬ
	|		Профосмотры.Период КАК Период,
	|		Профосмотры.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		Профосмотры.Контрагент КАК Контрагент,
	|		Профосмотры.Сотрудник КАК Сотрудник,
	|		Профосмотры.ВидОсмотра КАК ВидОсмотра,
	|		Профосмотры.ДатаЗапланированная КАК ДатаЗапланированная,
	|		Профосмотры.Статус КАК Статус,
	|		Профосмотры.ПредварительнаяЗапись КАК ПредварительнаяЗапись,
	|		Профосмотры.Прием КАК ДокументСсылка,
	|		Профосмотры.ПричинаНаправления КАК ПричинаНаправления,
	|		Профосмотры.Специализация КАК Специализация,
	|		Профосмотры.Специализация.Представление КАК СпециализацияПредставление,
	|		ВЫБОР
	|			КОГДА Профосмотры.Сотрудник.НаименованиеСокращенное = """"
	|				ТОГДА Профосмотры.Сотрудник.Наименование
	|			ИНАЧЕ Профосмотры.Сотрудник.НаименованиеСокращенное
	|		КОНЕЦ КАК ФИО
	|	ИЗ
	|		РегистрСведений.Профосмотры КАК Профосмотры
	|	ГДЕ
	|		Профосмотры.Прием = &ОтборДокумент
	|		И Профосмотры.Специализация <> ЗНАЧЕНИЕ(Справочник.Специализации.ПустаяСсылка)) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.ВидОсмотра = ЗНАЧЕНИЕ(Перечисление.ВидыОсмотров.Направление)
	|	И ВложенныйЗапрос.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.Запланирован)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.СтруктурнаяЕдиница,
	|	ВложенныйЗапрос.Контрагент,
	|	ВложенныйЗапрос.Сотрудник,
	|	ВложенныйЗапрос.ФИО,
	|	ВложенныйЗапрос.ВидОсмотра,
	|	ВложенныйЗапрос.ДатаЗапланированная,
	|	ВложенныйЗапрос.Статус,
	|	ВложенныйЗапрос.ПредварительнаяЗапись,
	|	ВложенныйЗапрос.ДокументСсылка,
	|	ВложенныйЗапрос.ПричинаНаправления,
	|	ВложенныйЗапрос.Специализация,
	|	ВложенныйЗапрос.СпециализацияПредставление
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПрофосмотрыСрезПоследних.Период КАК Период,
	|		ПрофосмотрыСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ПрофосмотрыСрезПоследних.Контрагент КАК Контрагент,
	|		ПрофосмотрыСрезПоследних.Сотрудник КАК Сотрудник,
	|		ПрофосмотрыСрезПоследних.ВидОсмотра КАК ВидОсмотра,
	|		ПрофосмотрыСрезПоследних.ДатаЗапланированная КАК ДатаЗапланированная,
	|		ПрофосмотрыСрезПоследних.Статус КАК Статус,
	|		ПрофосмотрыСрезПоследних.ПредварительнаяЗапись КАК ПредварительнаяЗапись,
	|		ПрофосмотрыСрезПоследних.Прием КАК ДокументСсылка,
	|		ПрофосмотрыСрезПоследних.ПричинаНаправления КАК ПричинаНаправления,
	|		ЗНАЧЕНИЕ(Справочник.Специализации.ПустаяСсылка) КАК Специализация,
	|		"""" КАК СпециализацияПредставление,
	|		ВЫБОР
	|			КОГДА ПрофосмотрыСрезПоследних.Сотрудник.НаименованиеСокращенное = """"
	|				ТОГДА ПрофосмотрыСрезПоследних.Сотрудник.Наименование
	|			ИНАЧЕ ПрофосмотрыСрезПоследних.Сотрудник.НаименованиеСокращенное
	|		КОНЕЦ КАК ФИО
	|	ИЗ
	|		РегистрСведений.Профосмотры.СрезПоследних(
	|				,
	|				Прием = &ОтборДокумент
	|					И ВидОсмотра = ЗНАЧЕНИЕ(Перечисление.ВидыОсмотров.ПовторныйПрием)
	|					И Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.Запланирован)) КАК ПрофосмотрыСрезПоследних) КАК ВложенныйЗапрос";	
	
	Для Каждого ЭлементМ ИЗ ОтборДокументы Цикл 		
		// Выполнение запроса отдельно по каждому документу НЕОБХОДИМО
		// потому, что отбор производиться по реквизиту Прием, а не по измерению!, из-за
		// чего не удается произвести отбор по массиву документов
		ЗапросВыборка.УстановитьПараметр("ОтборДокумент", ЭлементМ);            
		РезВыборки             = ЗапросВыборка.Выполнить().Выгрузить();
		Для Каждого СтрокаТ ИЗ РезВыборки Цикл
			// Заполняем буферную таблицу 			
			НоваяСтрока = СписокНаправленийКВрачам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТ); 
		КонецЦикла; 	
	КонецЦикла;  
    МассивПовторныхприемов = СписокНаправленийКВрачам.НайтиСтроки(Новый Структура("ВидОсмотра", Перечисления.ВидыОсмотров.ПовторныйПрием)); 
	МассивНаправлений      = СписокНаправленийКВрачам.НайтиСтроки(Новый Структура("ВидОсмотра", Перечисления.ВидыОсмотров.Направление));

	// Создание основных группировок
	Если МассивНаправлений.Количество() > 0 Тогда
		// Размещение группировок
		ГруппаЛевая_Направления                         = Элементы.Добавить("ГруппаНЛ_" + Строка(1),Тип("ГруппаФормы"), Элементы.ГруппаНеОбработанныеНаправленияКВрачам);
		ГруппаЛевая_Направления.Вид                     = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаЛевая_Направления.Отображение             = ОтображениеОбычнойГруппы.Нет;
		ГруппаЛевая_Направления.ОтображатьЗаголовок     = Ложь;  
		ГруппаЛевая_Направления.ВертикальныйИнтервал    = ИнтервалМеждуЭлементамиФормы.Полуторный;
		ГруппаЛевая_Направления.Группировка             = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаЛевая_Направления.Ширина                  = 30;
		
		ГруппаПравая_Направления                        = Элементы.Добавить("ГруппаНП_" + Строка(1),Тип("ГруппаФормы"), Элементы.ГруппаНеОбработанныеНаправленияКВрачам);
		ГруппаПравая_Направления.Вид                    = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаПравая_Направления.Отображение            = ОтображениеОбычнойГруппы.Нет;
		ГруппаПравая_Направления.ОтображатьЗаголовок    = Ложь;  
		ГруппаПравая_Направления.Группировка            = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаПравая_Направления.РастягиватьПоВертикали = Истина;
		
	КонецЕсли; 
	
	Если МассивПовторныхприемов.Количество() > 0 Тогда
		// Размещение группировок
		ГруппаЛевая_ПовтПрием                           = Элементы.Добавить("ГруппаПовторныеПприемыЛев_" + Строка(1),Тип("ГруппаФормы"), Элементы.ГруппаНеОбработанныеПовторныеПриемы);
		ГруппаЛевая_ПовтПрием.Вид                       = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаЛевая_ПовтПрием.Отображение               = ОтображениеОбычнойГруппы.Нет;
		ГруппаЛевая_ПовтПрием.ОтображатьЗаголовок       = Ложь;  
		ГруппаЛевая_ПовтПрием.ВертикальныйИнтервал      = ИнтервалМеждуЭлементамиФормы.Полуторный;
		ГруппаЛевая_ПовтПрием.Группировка               = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаЛевая_ПовтПрием.Ширина                    = 30;
		
		ГруппаПравая_ПовтПрием                          = Элементы.Добавить("ГруппаПовторныеПприемыПрав_" + Строка(1),Тип("ГруппаФормы"), Элементы.ГруппаНеОбработанныеПовторныеПриемы);
		ГруппаПравая_ПовтПрием.Вид                      = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаПравая_ПовтПрием.Отображение              = ОтображениеОбычнойГруппы.Нет;
		ГруппаПравая_ПовтПрием.ОтображатьЗаголовок      = Ложь;  
		ГруппаПравая_ПовтПрием.Группировка              = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаПравая_ПовтПрием.РастягиватьПоВертикали   = Истина;
			
	КонецЕсли; 

	// Создание декораций отображения
	Идентификатор = 0;
	Для Каждого СтрокаТ ИЗ СписокНаправленийКВрачам Цикл   
		
		ГруппаЛевая  = ?(СтрокаТ.ВидОсмотра = Перечисления.ВидыОсмотров.ПовторныйПрием, ГруппаЛевая_ПовтПрием, ГруппаЛевая_Направления); 
		ГруппаПравая = ?(СтрокаТ.ВидОсмотра = Перечисления.ВидыОсмотров.ПовторныйПрием, ГруппаПравая_ПовтПрием, ГруппаПравая_Направления);  
		фИОВрача = "";
		Если СтрокаТ.ВидОсмотра = Перечисления.ВидыОсмотров.ПовторныйПрием Тогда
			ДатаЗапланированная = Формат(СтрокаТ.ДатаЗапланированная, "ДЛФ=DD");
			фИОВрача = СтрокаТ.ФИО + " на " + Лев(ДатаЗапланированная, СтрДлина(ДатаЗапланированная) - 2) +".";
		Иначе 
			фИОВрача = ?(ЗначениеЗаполнено(СтрокаТ.ФИО), СтрокаТ.ФИО, СтрокаТ.СпециализацияПредставление);
		КонецЕсли;
		
		// Декорация заголовка
		НовыйДек                              = Элементы.Добавить("ДекорацияН_"+Строка(Идентификатор),Тип("ДекорацияФормы"), ГруппаЛевая);
		НовыйДек.Вид                          = ВидДекорацииФормы.Надпись;
		НовыйДек.Гиперссылка                  = Ложь;
		НовыйДек.Заголовок                    = ?(СтрокаТ.ВидОсмотра = Перечисления.ВидыОсмотров.ПовторныйПрием, "Повторный прием к ", "Направление к ") + фИОВрача; 
		НовыйДек.Шрифт 					      = Новый Шрифт(НовыйДек.Шрифт, , 9);
		НовыйДек.МаксимальнаяШирина           = 35;
		НовыйДек.Ширина                       = 35;  
		
		ГруппаКнопок                          = Элементы.Добавить("ГруппаКнопок_" + Строка(Идентификатор), Тип("ГруппаФормы"), ГруппаПравая);
		ГруппаКнопок.Вид                      = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаКнопок.Отображение              = ОтображениеОбычнойГруппы.Нет;
		ГруппаКнопок.ОтображатьЗаголовок      = Ложь;
		ГруппаКнопок.Группировка              = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
		
		// Декорация "Записать"
		НовыйДек = Элементы.Добавить("ДекорацияЗ_"+Строка(Идентификатор),Тип("ДекорацияФормы"), ГруппаКнопок);
		НовыйДек.Вид                          = ВидДекорацииФормы.Надпись;
		НовыйДек.Гиперссылка                  = Истина;
		НовыйДек.РастягиватьПоГоризонтали     = Истина;  
		НовыйДек.УстановитьДействие("Нажатие", "ОбработчикНажатияДекорацийНаправленийЗаписать");
		НовыйДек.ГоризонтальноеПоложение      = ГоризонтальноеПоложениеЭлемента.Право;
		НовыйДек.Шрифт 					      = Новый Шрифт(НовыйДек.Шрифт, , 9);
		НовыйДек.Заголовок                    = "Записать";
		НовыйДек.ЦветТекста                   = WebЦвета.Синий; 
		НовыйДек.Высота                       = 1;
		
		// Декорация "Позже"
		НовыйДек = Элементы.Добавить("ДекорацияП_"+Строка(Идентификатор),Тип("ДекорацияФормы"), ГруппаКнопок);
		НовыйДек.Вид                          = ВидДекорацииФормы.Надпись;
		НовыйДек.Гиперссылка                  = Истина;
		НовыйДек.РастягиватьПоГоризонтали     = Истина;
		НовыйДек.УстановитьДействие("Нажатие", "ОбработчикНажатияДекорацийНаправленийПозже");
		НовыйДек.ГоризонтальноеПоложение      = ГоризонтальноеПоложениеЭлемента.Право;  
		НовыйДек.Шрифт 					      = Новый Шрифт(НовыйДек.Шрифт, , 9);
		НовыйДек.Заголовок                    = "Позже";
		НовыйДек.ЦветТекста                   = WebЦвета.Золотой; 
		НовыйДек.Высота                       = 1;
		
		// Декорация "Отказ"
		НовыйДек = Элементы.Добавить("ДекорацияО_"+Строка(Идентификатор),Тип("ДекорацияФормы"), ГруппаКнопок);
		НовыйДек.Вид                          = ВидДекорацииФормы.Надпись;
		НовыйДек.Гиперссылка                  = Истина;
		НовыйДек.РастягиватьПоГоризонтали     = Истина;
		НовыйДек.УстановитьДействие("Нажатие", "ОбработчикНажатияДекорацийНаправленийОтказ");
		НовыйДек.ГоризонтальноеПоложение      = ГоризонтальноеПоложениеЭлемента.Право;   
		НовыйДек.Шрифт 					      = Новый Шрифт(НовыйДек.Шрифт, , 9);
		НовыйДек.Заголовок                    = "Отказ";
		НовыйДек.ЦветТекста                   = WebЦвета.Красный;
		НовыйДек.Высота                       = 1;
		
		Идентификатор = Идентификатор + 1;
		
	КонецЦикла; 

	// Элементы.ГруппаОбщееПоОплате.Доступность = НЕ Элементы.ГруппаНеОбработанныеНаправленияКВрачам.ПодчиненныеЭлементы.Количество() > 0;
	
КонецПроцедуры

&НаКлиенте
// Обработчик нажатия 
Процедура ОбработчикНажатияДекорацийНаправленийЗаписать(Элемент)
	
	НомерСтроки = Число(СтрЗаменить(Элемент.Имя,"ДекорацияЗ_",""));
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент"              , СписокНаправленийКВрачам[НомерСтроки].Контрагент);
	ПараметрыФормы.Вставить("Сотрудник"               , СписокНаправленийКВрачам[НомерСтроки].Сотрудник); 
	ПараметрыФормы.Вставить("ОтборПоСотруднику"       , СписокНаправленийКВрачам[НомерСтроки].Сотрудник);
	ПараметрыФормы.Вставить("Дата"                    , СписокНаправленийКВрачам[НомерСтроки].ДатаЗапланированная);
	ПараметрыФормы.Вставить("СпециализацияВрача"      , СписокНаправленийКВрачам[НомерСтроки].Специализация); 
	ПараметрыФормы.Вставить("ЗакрытьПриСозданииЗаписи", Истина);
	
	ИмяФормыПланировщика = ОбщегоНазначенияКлиент.ПолучитьИмяФормыПланировщика(ПараметрыФормы, "ФормаПредварительнойЗаписи");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикНажатияЗаписиНаПриемЗавершение", ЭтотОбъект, Новый Структура("НомерСтроки", НомерСтроки));
	ОткрытьФорму(ИмяФормыПланировщика, ПараметрыФормы,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры  

&НаКлиенте
// Процедура - Обработчик нажатия записи на прием завершение
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
 Процедура ОбработчикНажатияЗаписиНаПриемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	 
	 Если Результат = Неопределено Тогда
	     Возврат;
	 КонецЕсли;	 
	 НомерСтроки = ДополнительныеПараметры.НомерСтроки; 
	 Статус      = ПредопределенноеЗначение("Перечисление.СтатусыПрофосмотров.Согласился");
	 СписокНаправленийКВрачам[НомерСтроки].ПредварительнаяЗапись = Результат;
	 Если СписокНаправленийКВрачам[НомерСтроки].ПредварительнаяЗапись <> Неопределено Тогда   	 
		 СоздатьЗаписиВРегистреПрофосмотры(НомерСтроки, Статус); 
		 ОбновитьСписокНаправленийКВрачам();
	 КонецЕсли;  
	 
 КонецПроцедуры 
 
 &НаСервере
// Процедура, Обработчик события "СоздатьЗаписиВРегистреПрофосмотры".
//
Процедура СоздатьЗаписиВРегистреПрофосмотры(НомерСтроки, Статус)
	
	НаборЗаписей                                        = РегистрыСведений.Профосмотры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Значение                  = СписокНаправленийКВрачам[НомерСтроки].Период; 
	НаборЗаписей.Отбор.Период.Использование             = Истина;
	НаборЗаписей.Отбор.СтруктурнаяЕдиница.Значение      = СписокНаправленийКВрачам[НомерСтроки].СтруктурнаяЕдиница;
	НаборЗаписей.Отбор.СтруктурнаяЕдиница.Использование = Истина;
	НаборЗаписей.Отбор.Контрагент.Значение              = СписокНаправленийКВрачам[НомерСтроки].Контрагент; 
	НаборЗаписей.Отбор.Контрагент.Использование         = Истина; 
	Если ЗначениеЗаполнено(СписокНаправленийКВрачам[НомерСтроки].Сотрудник) Тогда
		НаборЗаписей.Отбор.Сотрудник.Значение           = СписокНаправленийКВрачам[НомерСтроки].Сотрудник;   
		НаборЗаписей.Отбор.Сотрудник.Использование      = Истина;
	КонецЕсли;
	НаборЗаписей.Отбор.ВидОсмотра.Значение              = СписокНаправленийКВрачам[НомерСтроки].ВидОсмотра;
	НаборЗаписей.Отбор.ВидОсмотра.Использование         = Истина;
	НаборЗаписей.Прочитать(); 
	
	Если НаборЗаписей.Количество() > 0 Тогда 	
		НоваяЗапись        = НаборЗаписей[0];
		НоваяЗапись.Статус = Статус;
		Если ЗначениеЗаполнено(СписокНаправленийКВрачам[НомерСтроки].ПредварительнаяЗапись) Тогда			
			 СтруктураДлительности = Документы.Событие.ПолучитьПродолжительностьСобытия(СписокНаправленийКВрачам[НомерСтроки].ПредварительнаяЗапись);
			 НоваяЗапись.ПредварительнаяЗапись = СписокНаправленийКВрачам[НомерСтроки].ПредварительнаяЗапись;
			 НоваяЗапись.ДатаЗапланированная   = СтруктураДлительности.ДатаНачала;
			 НоваяЗапись.Длительность          = СтруктураДлительности.Длительность; 
			 Если Не ЗначениеЗаполнено(НаборЗаписей[0].Сотрудник) Тогда  
				НоваяЗапись.Сотрудник = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СписокНаправленийКВрачам[НомерСтроки].ПредварительнаяЗапись, "Врач"); 
			 КонецЕсли;			 
		КонецЕсли; 	
		НаборЗаписей.Записать();	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Обработчик нажатия 
Процедура ОбработчикНажатияДекорацийНаправленийПозже(Элемент)
	
	НомерСтроки = Число(СтрЗаменить(Элемент.Имя, "ДекорацияП_",""));
	
	Статус = ПредопределенноеЗначение("Перечисление.СтатусыПрофосмотров.НапомнитьПозже");
	СоздатьЗаписиВРегистреПрофосмотры(НомерСтроки, Статус); 
	ОбновитьСписокНаправленийКВрачам();
	
КонецПроцедуры

&НаКлиенте
// Обработчик нажатия 
Процедура ОбработчикНажатияДекорацийНаправленийОтказ(Элемент)
	
	НомерСтроки = Число(СтрЗаменить(Элемент.Имя, "ДекорацияО_",""));
	Статус = ПредопределенноеЗначение("Перечисление.СтатусыПрофосмотров.Отказался");
	СоздатьЗаписиВРегистреПрофосмотры(НомерСтроки, Статус); 
	ОбновитьСписокНаправленийКВрачам();
	
КонецПроцедуры  

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	// Если была запись в регистр профосмотры, перезеаполнить список не закрытых осмотров
	Если ТипЗнч(НовыйОбъект) = Тип("РегистрСведенийКлючЗаписи.Профосмотры") Тогда
	    ОбновитьСписокНаправленийКВрачам();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура установки количества печатаемых объектов по умолчанию 
//
Процедура УстановитьКоличествоОбъектовПечатиПоУмолчанию()
	
	Если ПечатьКвитанций_Количество = 0 Тогда 
		ПечатьКвитанций_Количество = 1;
	КонецЕсли;
	Если ПечатьКопииЧекаКоличество = 0 Тогда 
		ПечатьКопииЧекаКоличество = 1;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьКвитанцииПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

#Область ЗачислениеСдачиНаЛицевойСчет

&НаКлиенте
// Процедура - обработчик оповещения "ПослеВопросаОЗачисленииСдачиНаЛицСчет".
//
Процедура ПослеВопросаОЗачисленииСдачиНаЛицСчет(Результат, ДопПараметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОперацияЗачисленияСдачиНаЛицевойСчет(Контрагент, ОплатаСдача, ДопПараметры.РежимЗачисленияСдачи);		
	КонецЕсли;
	
	ЗавершающийЭтапОперацииОплаты(
		ДопПараметры.ОперацияОплатыПроведеноУспешно, 
		ДопПараметры.ДанныефискальныхЧеков, 
		ДопПараметры.ДанныеПлатежаПоКарте,
		ДопПараметры.МассивДокОплаты);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Зачисление сдачи на лицевой счет
//
// Параметры:
//  Контрагент		 - 	 - 
//  СуммаЗачисления	 - 	 - 
//
Процедура ОперацияЗачисленияСдачиНаЛицевойСчет(Контрагент, СуммаЗачисления, РежимЗачисленияСдачи)
	
	Если РежимЗачисленияСдачи = 0 Тогда
		ДокСсылка = ЗачислениеСдачиНаЛицевойСчет(ID_Транзакции, Контрагент, ОплатаСдача, ЭтотОбъект.ТекущаяКасса);
	Иначе
		ДокСсылка = ЗачислениеСдачиАвансовымПлатежом(ID_Транзакции, Контрагент, ОплатаСдача, ЭтотОбъект.ТекущаяКасса);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокСсылка) Тогда
		ПоказатьПредупреждение(, "Не удалось зачислить сдачу!"); 
		Возврат;
	КонецЕсли;
			
	Если ЗначениеЗаполнено(ДокСсылка) 
		И НЕ ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ТекущаяКасса, "ИспользоватьБезПодключенияОборудования") Тогда
		
		Если ИспользоватьСтаруюСистемуФормированияДляФРдляККТ(ЭтотОбъект.ТекущаяКасса) = Ложь Тогда
			ПараметрыЧека = ПодготовитьПараметрыФискальногоЧекаВзносаСдачиНаЛицСчетДляККТ(СуммаЗачисления, ДокСсылка);  		
		Иначе
			ПараметрыЧека = ПодготовитьПараметрыФискальногоЧекаВзносаСдачиНаЛицСчетДляФР(СуммаЗачисления, ДокСсылка); 
		КонецЕсли;
		
		Если ПараметрыЧека.Результат Тогда
			
			ИдентификаторУстройстваФР = МенеджерОборудованияВызовСервера.ПолучитьИдентификаторФискальногоРегистратораДляКассы(ТекущаяКасса);
					
			Если ПараметрыЧека.Свойство("ФискальныйЧек") Тогда		
				
				Контекст = Новый Структура();
				Контекст.Вставить("ТипЧека", Истина);			
				Оповещение            = Новый ОписаниеОповещения("ПробитьЧекЗавершение"            , ЭтотОбъект, Контекст);
				ПослеОткрытияЧека     = Новый ОписаниеОповещения("ПечатьЧека_ПослеОткрытияЧека"    , ЭтотОбъект, Контекст);
				ПослеОшибкиПечатиЧека = Новый ОписаниеОповещения("ПечатьЧека_ПослеОшибкиПечатиЧека", ЭтотОбъект, Контекст);
				
				ОбщиеПараметры = ПараметрыЧека.ФискальныйЧек;
				МенеджерОборудованияКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(Оповещение, 
																					УникальныйИдентификатор,
																					ОбщиеПараметры,
																					ИдентификаторУстройстваФР, , 
																					ПослеОткрытияЧека,
																					ПослеОшибкиПечатиЧека);		
				
			КонецЕсли;
			
			// Если был фискальный чек, то нефискальный чек напечатается после завершения фискального.
			Если ПараметрыЧека.Свойство("НефискальныйЧек") Тогда
				
				ТекстЧека  = ПараметрыЧека.НефискальныйЧек;
				Контекст   = Новый Структура();
				Контекст.Вставить("ТипЧека", Ложь);
				Оповещение = Новый ОписаниеОповещения("ПробитьЧекЗавершение", ЭтотОбъект, Контекст);
				МенеджерОборудованияКлиент.НачатьПечатьТекста(Оповещение, УникальныйИдентификатор, ТекстЧека, ИдентификаторУстройстваФР);
				
			КонецЕсли;				
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Фискализация взноса на ЛС. ';en='Fiscalization contribution on drugs.'") + ПараметрыЧека.ОписаниеОшибки);
		
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(НомерФискальногоЧека) 
			ИЛИ ЗначениеЗаполнено(НомерНефискальногоЧека) Тогда 					
			
			ЗаписатьВДокументНомерЧекаФР(ДокСсылка, ?(ЗначениеЗаполнено(НомерФискальногоЧека), НомерФискальногоЧека, НомерНефискальногоЧека));		 
			НомерФискальногоЧека   = 0;
			НомерНефискальногоЧека = 0;			
			
		КонецЕсли;
		
	КонецЕсли; 
	 
КонецПроцедуры

// Функция - Подготовить параметры чека на печать
// 
// Возвращаемое значение:
//   - 
//
&НаСервере
Функция ПодготовитьПараметрыФискальногоЧекаВзносаСдачиНаЛицСчетДляККТ(СуммаВзноса, ДокументСсылка)
	
	ПараметрыЧека = МенеджерОборудованияВызовСервера.ПустаяСтруктураПараметровЧека();
	ВидНалога 	  = ?(ЗначениеЗаполнено(ЭтотОбъект.Организация.СистемаНалогообложенияДляАвансов), ЭтотОбъект.Организация.СистемаНалогообложенияДляАвансов, ЭтотОбъект.Организация.СистемаНалогообложения);
	
	ПараметрыЧека.ВидОперации             = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет;
	ПараметрыЧека.СтруктурнаяЕдиница      = ЭтотОбъект.СтруктурнаяЕдиница;
	ПараметрыЧека.Организация             = ЭтотОбъект.Организация;
	ПараметрыЧека.Сотрудник               = ЭтотОбъект.Сотрудник;
	ПараметрыЧека.Клиент                  = ЭтотОбъект.Контрагент;
	ПараметрыЧека.Дата                    = ЭтотОбъект.ДатаПродажи;
	ПараметрыЧека.Касса                   = ЭтотОбъект.ТекущаяКасса;	
	ПараметрыЧека.Количество              = 1;	
	ПараметрыЧека.СуммаКОплате            = СуммаВзноса;
	ПараметрыЧека.СуммаОплачено           = СуммаВзноса;
	
	ПараметрыЧека.МассивПараметровОплаты  = ПолучитьМассивОплатФискальногоЧекаВзносаСдачиНаЛицСчетДляККТ(СуммаВзноса);	
	ПараметрыЧека.МассивПараметровТовары  = ПолучитьМассивТоваровФискальногоЧекаВзносаСдачиНаЛицСчетДляККТ(СуммаВзноса, ДокументСсылка); 
	
	ПараметрыЧека.ТипЧека                 = 0;
	ПараметрыЧека.ВидНалога               = ВидНалога;	
	ПараметрыЧека.ВыводитьЧекНаБумагу     = ЭтотОбъект.ЧекПечатать;
    ПараметрыЧека.ЭлектроннаяПочтаКлиента = ?(ЭтотОбъект.ЧекККТОтправлятьЧекНаЭлПочту, ЭтотОбъект.ЧекККТКонтактыКлиентаПочта, Неопределено);
	ПараметрыЧека.НомерТелефонаКлиента    = ?(ЭтотОбъект.ЧекККТОтправлятьЧекНаТелефон, ЭтотОбъект.ЧекККТКонтактыКлиентаТелефон, Неопределено);
	
	МассивДокументовОплаты = Новый Массив;
	МассивДокументовОплаты.Добавить(ДокументСсылка);
	
	ПараметрыЧека.МассивДокументовОснований = МассивДокументовОплаты;
	
	ФормированиеЧека = МенеджерОборудованияВызовСервера.ПодготовитьДанныеДляПробитияФискальногоЧекаККТ(ПараметрыЧека);	

	Возврат ФормированиеЧека;
	
КонецФункции

&НаСервере
// Функция, возвращает массив товаров на печать
//
Функция ПолучитьМассивТоваровФискальногоЧекаВзносаСдачиНаЛицСчетДляККТ(СуммаВзноса, ДокументСсылка)
	
	МассивТоваров = Новый Массив;
	
	СтрокаТовара = МенеджерОборудованияВызовСервера.ПустаяСтруктураСтрокиТоваровЧека();
	
	Наименование = ?(ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ДокументСсылка, "ВидОперации") = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет,
					НСтр("ru = 'Взнос на лицевой счет от:'"), НСтр("ru = 'Аванс от:'"));
								
	СтрокаТовара.Наименование           = МенеджерОборудованияВызовСервера.ПолучитьСловоСУчетомЯзыка(Наименование) + " " + Контрагент;
	СтрокаТовара.СтоимостьБезСкидки     = СуммаВзноса;
	СтрокаТовара.СтавкаНДС              = МенеджерОборудованияВызовСервера.ПолучитьНДСПриВзносеНаЛицевойСчет(ЭтотОбъект.Организация);	
	СтрокаТовара.СуммаНДС               = Ценообразование.РассчитатьСуммуНДС(СуммаВзноса, СтрокаТовара.СтавкаНДС);

	МассивТоваров.Добавить(СтрокаТовара);
	
	Возврат МассивТоваров;
	
КонецФункции

// Функция - Получить массив оплат на печать
// 
// Возвращаемое значение:
//   - 
//
&НаСервере
Функция ПолучитьМассивОплатФискальногоЧекаВзносаСдачиНаЛицСчетДляККТ(СуммаВзноса)
	
	МассивОплат = Новый Массив;		
	
	ПараметрыТипаОплаты = МенеджерОборудованияВызовСервера.ПустаяСтруктураСтрокиПлатежаЧека();
	
	ПараметрыТипаОплаты.ТипОплаты = Перечисления.ТипыДенежныхСредств.Наличные;
	ПараметрыТипаОплаты.Сумма     = СуммаВзноса;
	
	МассивОплат.Добавить(ПараметрыТипаОплаты);	
	
	Возврат МассивОплат;
	
КонецФункции

// Функция - Подготовить параметры чека на печать
// 
// Возвращаемое значение:
//   - 
//
&НаСервере
Функция ПодготовитьПараметрыФискальногоЧекаВзносаСдачиНаЛицСчетДляФР(СуммаВзноса, ДокументСсылка)
	
	ПараметрыЧека = МенеджерОборудованияВызовСервера.ПустаяСтруктураПараметровЧека();
	ВидНалога 	  = ?(ЗначениеЗаполнено(Организация.СистемаНалогообложенияДляАвансов), ЭтотОбъект.Организация.СистемаНалогообложенияДляАвансов, ЭтотОбъект.Организация.СистемаНалогообложения);
	
	ПараметрыЧека.ВидОперации            = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет;
	ПараметрыЧека.СтруктурнаяЕдиница     = ЭтотОбъект.СтруктурнаяЕдиница;
	ПараметрыЧека.Организация            = ЭтотОбъект.Организация;
	ПараметрыЧека.Сотрудник              = ЭтотОбъект.Сотрудник;
	ПараметрыЧека.Клиент                 = ЭтотОбъект.Контрагент;
	ПараметрыЧека.Дата                   = ЭтотОбъект.ДатаПродажи;
	ПараметрыЧека.Касса                  = ЭтотОбъект.ТекущаяКасса;	
	ПараметрыЧека.Наименование           = НСтр("ru='Оплата от:';en='Payment from:'") + " " + Контрагент;
    ПараметрыЧека.СтоимостьБезСкидки     = СуммаВзноса;
    ПараметрыЧека.Количество             = 1;
	ПараметрыЧека.ТипОплаты              = Перечисления.ТипыДенежныхСредств.Наличные;		
	ПараметрыЧека.ВидНалога              = ВидНалога;		
	ПараметрыЧека.СуммаКОплате           = СуммаВзноса;
	ПараметрыЧека.СуммаОплачено          = СуммаВзноса;

	// ККТ микс
	ПараметрыЧека.МассивПараметровОплаты  = ПолучитьМассивОплатФискальногоЧекаВзносаСдачиНаЛицСчетДляККТ(СуммаВзноса);	
	ПараметрыЧека.МассивПараметровТовары  = ПолучитьМассивТоваровФискальногоЧекаВзносаСдачиНаЛицСчетДляККТ(СуммаВзноса, ДокументСсылка); 
	
	ПараметрыЧека.ТипЧека                 = 0;
	ПараметрыЧека.ВыводитьЧекНаБумагу     = Этотобъект.ЧекПечатать;
    ПараметрыЧека.ЭлектроннаяПочтаКлиента = ?(ЭтотОбъект.ЧекККТОтправлятьЧекНаЭлПочту, ЭтотОбъект.ЧекККТКонтактыКлиентаПочта, Неопределено);
	ПараметрыЧека.НомерТелефонаКлиента    = ?(ЭтотОбъект.ЧекККТОтправлятьЧекНаТелефон, ЭтотОбъект.ЧекККТКонтактыКлиентаТелефон, Неопределено);
	
	МассивДокументовОплаты = Новый Массив;
	МассивДокументовОплаты.Добавить(ДокументСсылка);
	
	ПараметрыЧека.МассивДокументовОснований = МассивДокументовОплаты;
	
	ФормированиеЧека = МенеджерОборудованияВызовСервера.ПодготовитьДанныеДляПробитияФискальногоИНеФискальногоЧекаФР(ПараметрыЧека);	

	Возврат ФормированиеЧека;
	
КонецФункции

&НаСервереБезКонтекста
// Функция зачисления сдачи на лицевой счет контрагента.
//
Функция ЗачислениеСдачиНаЛицевойСчет(ID_Транзакции, Контрагент, СуммаЗачисления, Касса)
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ID_Транзакции"         , ID_Транзакции);	
	ПараметрыЗаполнения.Вставить("Контрагент"            , Контрагент);
	ПараметрыЗаполнения.Вставить("ТипДенежныхСредств"    , Перечисления.ТипыДенежныхСредств.Наличные);
	ПараметрыЗаполнения.Вставить("ВидОперации"           , Перечисления.ВидыОпераций.ВзносНаЛицевойСчет);
	ПараметрыЗаполнения.Вставить("ЛицевойСчетКонтрагента", Справочники.ВидыЛицевыхСчетов.ОсновнойЛицевойСчет);
	ПараметрыЗаполнения.Вставить("СуммаДокумента"        , СуммаЗачисления);
	ПараметрыЗаполнения.Вставить("Касса"       		     , Касса);
	ПараметрыЗаполнения.Вставить("Комментарий"			 , НСтр("ru = 'Зачисление сдачи'; en = 'Crediting change'"));
	
	ДокОбъект = Документы.ПоступлениеДенежныхСредств.СоздатьДокумент();
	ДокОбъект.Заполнить(ПараметрыЗаполнения);
	ДокОбъект.ID_Транзакции = ID_Транзакции;
	
	Если ДокОбъект.ПроверитьЗаполнение() Тогда
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Возврат Неопределено;
		КонецПопытки;		
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
	Возврат ДокОбъект.Ссылка;
	
КонецФункции

&НаСервереБезКонтекста
// Функция зачисления сдачи на лицевой счет контрагента.
//
Функция ЗачислениеСдачиАвансовымПлатежом(ID_Транзакции, Контрагент, СуммаЗачисления, Касса)
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ID_Транзакции"         , ID_Транзакции);	
	ПараметрыЗаполнения.Вставить("Контрагент"            , Контрагент);
	ПараметрыЗаполнения.Вставить("ТипДенежныхСредств"    , Перечисления.ТипыДенежныхСредств.Наличные);
	ПараметрыЗаполнения.Вставить("ВидОперации"           , Перечисления.ВидыОпераций.ОплатаОтКлиента);
	ПараметрыЗаполнения.Вставить("СуммаДокумента"        , СуммаЗачисления);  
	ПараметрыЗаполнения.Вставить("Касса"       		     , Касса);
	ПараметрыЗаполнения.Вставить("Комментарий"			 , НСтр("ru = 'Зачисление сдачи'; en = 'Crediting change'"));
	
	ДокОбъект = Документы.ПоступлениеДенежныхСредств.СоздатьДокумент();
	ДокОбъект.Заполнить(ПараметрыЗаполнения);
	Если ДокОбъект.РасшифровкаПлатежа.Количество() = 0 Тогда
		НоваяСтрока          = ДокОбъект.РасшифровкаПлатежа.Добавить();
		НоваяСтрока.ЭтоАванс = Истина;
		НоваяСтрока.Сумма    = СуммаЗачисления; 	
	КонецЕсли;
	ДокОбъект.ID_Транзакции = ID_Транзакции;
	Если ДокОбъект.ПроверитьЗаполнение() Тогда
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
	Возврат ДокОбъект.Ссылка;
	
КонецФункции

&НаСервере
// Процедура - Расставить приоритет печати чека
//
Процедура РасставитьПриоритетПечатиЧека()

	Если ЭтотОбъект.ЧекПечатать = Истина Тогда
		Элементы.ГруппаКонтактыКлиентаТелефон.Видимость			= Ложь;
		Элементы.КонтактыКлиентаИспользоватьТелефон.Видимость 	= Истина;
		ЭтотОбъект.ЧекККТОтправлятьЧекНаТелефон 				= Ложь;
		
		Элементы.ГруппаКонтактыКлиентаПочта.Видимость 			= Ложь;
		Элементы.КонтактыКлиентаИспользоватьПочту.Видимость 	= Истина;
		ЭтотОбъект.ЧекККТОтправлятьЧекНаЭлПочту 				= Ложь;
	Иначе
		Если ЗначениеЗаполнено (ЭтотОбъект.ЧекККТКонтактыКлиентаПочта) Тогда
			
			Элементы.ГруппаКонтактыКлиентаПочта.Видимость 			= Истина;
			Элементы.КонтактыКлиентаИспользоватьПочту.Видимость 	= Ложь;
			ЭтотОбъект.ЧекККТОтправлятьЧекНаЭлПочту 				= Истина;
			
		ИначеЕсли ЗначениеЗаполнено (ЭтотОбъект.ЧекККТКонтактыКлиентаТелефон) Тогда
			
			Элементы.ГруппаКонтактыКлиентаТелефон.Видимость			= Истина;
			Элементы.КонтактыКлиентаИспользоватьТелефон.Видимость 	= Ложь;
			ЭтотОбъект.ЧекККТОтправлятьЧекНаТелефон 				= Истина;
		Иначе 
			ЭтотОбъект.ЧекПечатать = Истина; 
			
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Нужно указать почту или телефон пациента для отправки электронного чека.';
															|en='You must specify the patient''s mail or phone number to send an electronic receipt.'"));  
		КонецЕсли;                                            
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
// Процедура - Обновить доступные кассы
//
// Параметры:
//  врДоступныеКассы - 	 - 
//
Процедура ОбновитьДоступныеКассыДляСсылокИСбп(врДоступныеКассы)
	
	ТаблицаКасс = Справочники.Кассы.ПолучитьКассыСсылокНаОплатуИСбп(СтруктурнаяЕдиница);
	
	Для Каждого СтрокаТЗ Из ТаблицаКасс Цикл
		
		НайденнаяСтрока = ОбщегоНазначенияКлиентСерверСтоматология.НайтиВМассивеСтруктур(врДоступныеКассы, "Касса", СтрокаТЗ.Касса);
		
		Если НайденнаяСтрока = Неопределено Тогда
			СтруктураДанных = Новый Структура("ИспользуетсяОнлайн,Касса,КассаДоступна,ФРИспользуется");
			ЗаполнитьЗначенияСвойств(СтруктураДанных, СтрокаТЗ); 
			врДоступныеКассы.Добавить(СтруктураДанных);
		Иначе
			НайденнаяСтрока.ИспользуетсяОнлайн = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	врДоступныеКассы = ОтсортироватьМассивСтруктур(врДоступныеКассы);
	
КонецПроцедуры

&НаСервере
// Функция - Отсортировать массив структур
//
// Параметры:
//  МассивСтруктур	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОтсортироватьМассивСтруктур(МассивСтруктур)
	
	ТаблицаКасс = Новый ТаблицаЗначений;
	ТаблицаКасс.Колонки.Добавить("ИспользуетсяОнлайн");
	ТаблицаКасс.Колонки.Добавить("Касса");
	ТаблицаКасс.Колонки.Добавить("КассаДоступна");
	ТаблицаКасс.Колонки.Добавить("ФРИспользуется");
		
	Для Каждого Строка Из МассивСтруктур Цикл
		НоваяСтрока = ТаблицаКасс.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	ТаблицаКасс.Сортировать("ФРИспользуется Убыв, КассаДоступна Убыв");  
	
	МассивСтруктурВозврат = Новый Массив;
	
	Для Каждого Строка Из ТаблицаКасс Цикл
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("ИспользуетсяОнлайн"	, Строка.ИспользуетсяОнлайн);
		СтруктураСтроки.Вставить("Касса"				, Строка.Касса);
		СтруктураСтроки.Вставить("КассаДоступна"		, Строка.КассаДоступна);
		СтруктураСтроки.Вставить("ФРИспользуется"		, Строка.ФРИспользуется);
		МассивСтруктурВозврат.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат МассивСтруктурВозврат;
	
КонецФункции

&НаСервере
// Функция - Получить картинку соответствия типу шлюза
//
// Параметры:
//  ЭквайринговыйТерминал	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКартинкуСоответствияТипуШлюза(ЭквайринговыйТерминал)
	
	ТипШлюза = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭквайринговыйТерминал, "ТипБанка"); 
	
	Если ТипШлюза = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипШлюза = Перечисления.ПлатежныеШлюзы.СБПАльфаБанк ИЛИ ТипШлюза = Перечисления.ПлатежныеШлюзы.СБПРайффайзенБанк 
		ИЛИ ТипШлюза = Перечисления.ПлатежныеШлюзы.СБПТинькофф ИЛИ ТипШлюза = Перечисления.ПлатежныеШлюзы.СБПСбербанк 
		ИЛИ ТипШлюза = Перечисления.ПлатежныеШлюзы.СБПСДМ Тогда
		Возврат БиблиотекаКартинок.СсылкиНаОплату_СБП_32;
	ИначеЕсли ТипШлюза = Перечисления.ПлатежныеШлюзы.Сбербанк ИЛИ ТипШлюза = Перечисления.ПлатежныеШлюзы.СбербанкПлатиQR Тогда
		Возврат БиблиотекаКартинок.СсылкиНаОплату_СберБанк_32;
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

&НаСервере
// Функция, проверяет принадлежность номенклатуры к секцииям кассы ККМ.
// 
Функция ПринадлежностьКСекциям(СообщениеПользователю)
	
	Если Не ТекущаяКасса.БлокироватьПечатьЧека 
		Или (ТекущаяКасса.БлокироватьПечатьЧека И ТекущаяКасса.Секции.Количество() = 0) Тогда
		
		Возврат Истина;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияЗапасы.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТаблицаНоменклатур
	|ИЗ
	|	Документ.Реализация.Запасы КАК РеализацияЗапасы
	|ГДЕ
	|	РеализацияЗапасы.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемЗапасы.Номенклатура
	|ИЗ
	|	Документ.Прием.Запасы КАК ПриемЗапасы
	|ГДЕ
	|	ПриемЗапасы.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемЛечение.Номенклатура
	|ИЗ
	|	Документ.Прием.Лечение КАК ПриемЛечение
	|ГДЕ
	|	ПриемЛечение.Ссылка В(&МассивДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураСегмента.Сегмент КАК Сегмент,
	|	НоменклатураСегмента.Номенклатура КАК ОбъектСегмента
	|ПОМЕСТИТЬ ТаблицаСегментов
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|ГДЕ
	|	НоменклатураСегмента.Номенклатура В
	|			(ВЫБРАТЬ
	|				ТаблицаНоменклатур.Номенклатура
	|			ИЗ
	|				ТаблицаНоменклатур)
	|	И НоменклатураСегмента.Сегмент В(&СекцииКассы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНоменклатур.Номенклатура КАК Номенклатура
	|ИЗ
	|	ТаблицаНоменклатур КАК ТаблицаНоменклатур
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСегментов КАК ТаблицаСегментов
	|		ПО ТаблицаНоменклатур.Номенклатура = ТаблицаСегментов.ОбъектСегмента
	|ГДЕ
	|	ТаблицаСегментов.Сегмент ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНоменклатур.Номенклатура";   
	
	Запрос.УстановитьПараметр("МассивДокументов", ПолучитьДокументыЗадолженностиСервер(Истина));
	Запрос.УстановитьПараметр("СекцииКассы"		, ТекущаяКасса.Секции.ВыгрузитьКолонку("СегментНоменклатуры"));
	
	Результат = Запрос.Выполнить().Выгрузить();
	СтрокаСписокНоменклатур = "";
	Для Каждого СтрокаТЗ Из Результат Цикл
		СтрокаСписокНоменклатур  = СтрокаСписокНоменклатур + ?(ПустаяСтрока(СтрокаСписокНоменклатур), "", ", ") + СокрЛП(СтрокаТЗ.Номенклатура);		
	КонецЦикла;
	
	Если Результат.Количество() > 0 Тогда
		СообщениеПользователю = СтрШаблон(Нстр("ru='Проведение и оплата чека невозможна, поскольку в чеке имеется номенклатура [%1]"
", не входящая ни в одну из секций текущей кассы ККМ.';en='Holding and payment check not is possible because the"
"check contains nomenclature [%1] which is not included in any of the sections of the current ticketoffice KKM.'"), СтрокаСписокНоменклатур);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеПользователю);
		
		Возврат Ложь;     		
	КонецЕсли;
	
	Возврат Результат.Количество() = 0;
	
КонецФункции

#КонецОбласти

#КонецОбласти

