
#Область СлужебныйПрограммныйИнтерфейс

// Функция осуществляет закрытие ранее открытого чека.
//
Функция ЗакрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаОплат, ВыходныеПараметры) Экспорт

	Результат = Истина;
	СтрокаЛога = "";

	СуммаНаличнойОплаты     = 0;
	СуммаБезналичнойОплаты1 = 0;
	СуммаБезналичнойОплаты2 = 0;
	СуммаАвансом		    = 0;

	Для ИндексОплаты = 0 По ТаблицаОплат.Количество() - 1 Цикл
		Если ТаблицаОплат[ИндексОплаты].ТипОплаты = Перечисления.ТипыОплатыККТ.Наличные Тогда
			СуммаНаличнойОплаты = СуммаНаличнойОплаты + ТаблицаОплат[ИндексОплаты].Сумма;
		ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = Перечисления.ТипыОплатыККТ.Электронно Тогда
			СуммаБезналичнойОплаты1 = СуммаБезналичнойОплаты1 + ТаблицаОплат[ИндексОплаты].Сумма;
		ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = Перечисления.ТипыОплатыККТ.Предоплата Тогда
			СуммаАвансом = СуммаАвансом + ТаблицаОплат[ИндексОплаты].Сумма;   
		Иначе
			СуммаБезналичнойОплаты2 = СуммаБезналичнойОплаты2 + ТаблицаОплат[ИндексОплаты].Сумма;
		КонецЕсли;
	КонецЦикла;
	
	ЭтоУкраина = Справочники.СтруктурныеЕдиницы.ВернутьРегиональныеНастройки().Код = "804";
	
	Если Не ПараметрыПодключения.ЧекОткрыт Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Чек не был открыт';en='Check not was isopen'"));
		Результат = Ложь;
	Иначе
		Если ПараметрыПодключения.ФискальныйЧек Тогда
			СтрокаЛога = СтрокаЛога + ПолучитьСловоСУчетомЯзыка("ИТОГО", ЭтоУкраина) + ": " + Формат(ПараметрыПодключения.ИтогЧека, "ЧЦ=15; ЧДЦ=2; ЧН=0; ЧГ=0") + Символы.ПС;
			СтрокаЛога = СтрокаЛога + НСтр("ru='Оплачено наличными'; en='Cash'") + ": "      + СуммаНаличнойОплаты + Символы.ПС;
			СтрокаЛога = СтрокаЛога + НСтр("ru='Оплачено безналичными 1';en='Paid cashless 1'") + ": " + СуммаБезналичнойОплаты1 + Символы.ПС;
			СтрокаЛога = СтрокаЛога + НСтр("ru='Оплачено безналичными 2';en='Paid cashless 2'") + ": " + СуммаБезналичнойОплаты2 + Символы.ПС;
			СтрокаЛога = СтрокаЛога + НСтр("ru='Оплачено авансом';en='Paid in advanced'") + ": " + СуммаАвансом + Символы.ПС;
			//СтрокаЛога = СтрокаЛога + НСтр("ru='Сдача';en='Surrender'") + ": "
			//                        + Строка(СуммаНаличнойОплаты
			//                               + СуммаБезналичнойОплаты1
			//                               + СуммаБезналичнойОплаты2
			//                               - ПараметрыПодключения.ИтогЧека) + Символы.ПС;
		КонецЕсли;
		СтрокаЛога = СтрокаЛога + "===== "
		                        + ?(ПараметрыПодключения.ФискальныйЧек,
		                            НСтр("ru='Закрытие фискального чека';en='Closing fiscal check'"),
		                            НСтр("ru='Закрытие нефискального чека';en='Closing nonfiscal check'"))
		                        + " =====" + Символы.ПС;
		ПараметрыПодключения.ЧекОткрыт = Ложь;
		
		ТабДок = Параметры.ТабличныйДокумент;
		Макет  = Параметры.Макет;
		ОблИтого         = Макет.ПолучитьОбласть("ИнформацияИтого");
		ОблИтого1        = Макет.ПолучитьОбласть("ИнформацияИтого1");
		ОблИтогоОпл      = Макет.ПолучитьОбласть("ИнформацияИтогоОплата");
		ОблПодвал        = Макет.ПолучитьОбласть("Подвал");
		
		ОблИтого.Параметры.Всего = Формат(ПараметрыПодключения.ИтогЧека, "ЧЦ=15; ЧДЦ=2; ЧН=0; ЧГ=0");
		ТабДок.Вывести(ОблИтого);
		
		Для ИндексОплаты = 0 По ТаблицаОплат.Количество() - 1 Цикл
			Если ТаблицаОплат[ИндексОплаты].Сумма > 0 Тогда
				ОблИтогоОпл.Параметры.ОплатаНал = ТаблицаОплат[ИндексОплаты].Сумма;
				ВидОблаты = НСтр("ru='Безналичная оплата'; en='Card'; uk ='Безготівковий розрахунок'");
				Если ТаблицаОплат[ИндексОплаты].ТипОплаты = Перечисления.ТипыОплатыККТ.Наличные Тогда
					ВидОблаты = НСтр("ru='Наличная оплата'; en='Cash'; uk ='Готівка'");
				ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = Перечисления.ТипыОплатыККТ.Электронно Тогда
					ВидОблаты = НСтр("ru='Платежная карта'; en='Card'; uk ='Платіжна картка'");
				ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = Перечисления.ТипыОплатыККТ.Предоплата Тогда
					ВидОблаты = НСтр("ru='Авансом'; en='Advanced'; uk ='Авансом'");
				КонецЕсли;	
				//ВидОблаты = ПолучитьСловоСУчетомЯзыка(ВидОблаты, ЭтоУкраина);
				
				ОблИтогоОпл.Параметры.Оплата = ВидОблаты + ":";
				ТабДок.Вывести(ОблИтогоОпл);
			КонецЕсли;
		КонецЦикла;		
		//ОблИтого.Параметры.ОплатаНал    = СуммаНаличнойОплаты + СуммаБезналичнойОплаты1 + СуммаБезналичнойОплаты2;
		//ОблИтого.Параметры.ОплатаБезНал = СуммаБезналичнойОплаты1;
		//ОблИтого1.Параметры.СуммаСдачи = СуммаНаличнойОплаты + СуммаБезналичнойОплаты1 + СуммаБезналичнойОплаты2 - ПараметрыПодключения.ИтогЧека;
		//ТабДок.Вывести(ОблИтого1);
		
		Для Каждого СтрокаПодвала Из Параметры.ТаблицаПодвалЧека Цикл
			ОблПодвал.Параметры.ТекстПодвала = СокрЛП(СтрокаПодвала);   
			Попытка
				ОблПодвал.Области.Подвал.ГоризонтальноеПоложение = ?(СтрНайти(СтрокаПодвала, МенеджерОборудованияВызовСервера.ПолучитьСловоСУчетомЯзыка("ФИО: ")) <> 0, ГоризонтальноеПоложение.Лево, ГоризонтальноеПоложение.Центр);
			Исключение КонецПопытки;
			ТабДок.Вывести(ОблПодвал);
		КонецЦикла;
		
		ТабДок.ПолеСверху = 0.5;
		ТабДок.ПолеСнизу  = 0.5;
		ТабДок.ПолеСлева  = 0.1;
		ТабДок.ПолеСправа = 0.1;
		ТабДок.РазмерКолонтитулаСверху = 0.5;
		ТабДок.РазмерКолонтитулаСнизу = 0.5;	
			
	КонецЕсли;

	ПараметрыПодключения.СтрокаЛога = ПараметрыПодключения.СтрокаЛога + СтрокаЛога;
	Возврат Результат;

КонецФункции

// Функция осуществляет печать фискальной строки.
//
Функция НапечататьФискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения,
                                   Наименование, Количество, Цена, ПроцентСкидки, Сумма,
                                   НомерСекции, СтавкаНДС, ВыходныеПараметры, СуммаВключаетНДС = Истина, СуммаНДС = 0)  Экспорт
								   
								   // процент скидки предаваемый в параметрах не исп

	Результат  = ПараметрыПодключения.ЧекОткрыт;
	СтрокаЛога = "";

	Если Не ПараметрыПодключения.ЧекОткрыт Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Чек не был открыт';en='Check not was isopen'"));

	Иначе
		
		ТабДок = Параметры.ТабличныйДокумент;
		Макет  = Параметры.Макет;
		
		ОблТовара        = Макет.ПолучитьОбласть("ИнформацияОТоваре");
		ОблСумма         = Макет.ПолучитьОбласть("ИнформацияПоСумме");
		ОблСкидка        = Макет.ПолучитьОбласть("ИнформацияПоСкидке");    
		
		//Если Параметры.Свойство("ОтображатьЛоготип") И Параметры.ОтображатьЛоготип 
		//	И Параметры.Свойство("ЛоготипОрганизации") И ЗначениеЗаполнено(Параметры.ЛоготипОрганизации)
		//	И Параметры.Свойство("ТабличныйДокумент") И Параметры.Свойство("Макет") Тогда 
		//	
		//	МенеджерОборудованияВызовСервера.ВывестиОбластьЛоготипа(Параметры.ТабличныйДокумент, Параметры.Макет, Параметры);
		//КонецЕсли;             
		
		ЭтоУкраина  = Справочники.СтруктурныеЕдиницы.ВернутьРегиональныеНастройки().Код = "804";
		ФорматЧисла = "ЧЦ=15; ЧДЦ=2; ЧН=0; ЧГ=0";
		
		// Печать строки чека
		СтрокаЛога = ".............................." + Символы.ПС;
		СтрокаЛога = СтрокаЛога + Наименование + Символы.ПС;
		СтрокаЛога = СтрокаЛога + Строка(Количество) + " * " + Строка(Цена) + " = " + Формат(Количество*Цена, ФорматЧисла) + Символы.ПС;

		СкидкаНаценка = Сумма - ?(СуммаВключаетНДС, 0, СуммаНДС) - Цена*Количество;
		
		Если Цена > 0 Тогда
			ПроцентСкидки = Окр(СкидкаНаценка * -1/(Цена*Количество) * 100, 1, РежимОкругления.Окр15как20);		
		Иначе
			ПроцентСкидки = 0;
		КонецЕсли;
		Если СкидкаНаценка < 0 Тогда		
			СтрокаЛога = СтрокаЛога + ПолучитьСловоСУчетомЯзыка("Скидка", ЭтоУкраина) + ": " + Формат(-СкидкаНаценка, ФорматЧисла)
			           + " (" + ПроцентСкидки + "%)" + Символы.ПС;
		ИначеЕсли СкидкаНаценка > 0 Тогда		   
			СтрокаЛога = СтрокаЛога + ПолучитьСловоСУчетомЯзыка("Наценка", ЭтоУкраина) + ": " + Формат(СкидкаНаценка, ФорматЧисла)
			           + " (" + ПроцентСкидки + "%)" + Символы.ПС;
		КонецЕсли;
		СтрокаЛога = СтрокаЛога + ПолучитьСловоСУчетомЯзыка("Отдел", ЭтоУкраина) + ": №" + НомерСекции + Символы.ПС;
		Если ЗначениеЗаполнено(СтавкаНДС) и СтавкаНДС > 0 Тогда
			СтрокаЛога = СтрокаЛога + ПолучитьСловоСУчетомЯзыка("НДС", ЭтоУкраина) + ": " + Формат(СуммаНДС, ФорматЧисла) + 
					" (" + СтавкаНДС + "%)" + Символы.ПС;
		КонецЕсли;
		СтрокаЛога = СтрокаЛога + ".............................." + Символы.ПС;
		ПараметрыПодключения.ИтогЧека = ПараметрыПодключения.ИтогЧека + Сумма;
		
		//////////////////////////////////////
		ОблТовара.Параметры.Товар = СокрЛП(Наименование);
		ТабДок.Вывести(ОблТовара);
		ОблСумма.Параметры.ТекстСуммы = Строка(Количество) + " * " + Формат(Цена, ФорматЧисла) + " = " + Формат(Количество*Цена, ФорматЧисла);
		ТабДок.Вывести(ОблСумма);
		
		//СкидкаНаценка = Цена*Количество / СкидкаНаценка  * -1;
		
		Если СкидкаНаценка < 0 Тогда
			ОблСкидка.Параметры.ТекстСкидки = ПолучитьСловоСУчетомЯзыка("Скидка", ЭтоУкраина) + ": " + Формат(-СкидкаНаценка, ФорматЧисла)
			           + " (" + ПроцентСкидки + "%)" + Символы.ПС;
			ТабДок.Вывести(ОблСкидка);
		ИначеЕсли СкидкаНаценка > 0 Тогда
			ОблСкидка.Параметры.ТекстСкидки = ПолучитьСловоСУчетомЯзыка("Наценка", ЭтоУкраина) + ": " + Формат(СкидкаНаценка, ФорматЧисла)
					   + " (" + ПроцентСкидки + "%)" + Символы.ПС;
			ТабДок.Вывести(ОблСкидка);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтавкаНДС) и СтавкаНДС > 0 Тогда
			ОблСумма.Параметры.ТекстСуммы = ПолучитьСловоСУчетомЯзыка("НДС", ЭтоУкраина) + ": " + Формат(СуммаНДС, ФорматЧисла) + 
					" (" + СтавкаНДС + "%)" + Символы.ПС ;
			ТабДок.Вывести(ОблСумма);
		КонецЕсли;    	
		
	КонецЕсли;

	ПараметрыПодключения.СтрокаЛога = ПараметрыПодключения.СтрокаЛога + СтрокаЛога;
	Возврат Результат;

КонецФункции

// Процедура, выводит область логотипа.
//
Процедура ВывестиОбластьЛоготипа(ТабДок, Макет, Параметры) Экспорт
	
	Возврат; // разобраться Диана
	
	////ТабДок = Параметры.ТабличныйДокумент;
	////Макет  = Параметры.Макет;
	////
	//ОбластьЛоготипОрганизации = Неопределено;
	//Попытка
	//	ОбластьЛоготипОрганизации = Макет.ПолучитьОбласть("ОбластьЛоготипОрганизации");
	//Исключение КонецПопытки;
	//
	//Если ОбластьЛоготипОрганизации = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(Параметры.ЛоготипОрганизации);
	//
	//Логотип = ОбластьЛоготипОрганизации.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	//Логотип.Высота 		   = 30;
	//Логотип.Ширина 		   = 59;
	//Логотип.ГраницаСверху  = Ложь;
	//Логотип.ГраницаСнизу   = Ложь;
	//Логотип.ГраницаСлева   = Ложь;
	//Логотип.ГраницаСправа  = Ложь;
	//Логотип.РазмерКартинки = РазмерКартинки.Пропорционально;
	//
	//Если ЗначениеЗаполнено(ДанныеФайла.ТекущаяВерсия.Том) Тогда
	//	
	//	ПолныйПуть = ФайловыеФункцииСлужебный.ПолныйПутьТома(ДанныеФайла.ТекущаяВерсия.Том) + ДанныеФайла.ТекущаяВерсия.ПутьКФайлу; 
	//	Попытка
	//		Логотип.Картинка = Новый Картинка(Новый ДвоичныеДанные(ПолныйПуть));
	//	Исключение
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось получить картинку логотипа!';en='Not succeeded receive picture logo!'"));
	//	КонецПопытки;
	//	
	//Иначе
	//	//Логотип.Картинка 	 = Новый Картинка(РаботаСФайламиСлужебныйВызовСервера.ПолучитьХранилищеФайлаИзИнформационнойБазы(ДанныеФайла.Версия).Получить());
	//	ДвоичныеДанныеЛоготипа = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаИДвоичныеДанные(ДанныеФайла.Версия).ДвоичныеДанные;
	//	Если ЗначениеЗаполнено(ДвоичныеДанныеЛоготипа) Тогда 
	//		Логотип.Картинка = Новый Картинка(ДвоичныеДанныеЛоготипа);
	//	КонецЕсли;
	//КонецЕсли;
	//
	//ТабДок.Вывести(ОбластьЛоготипОрганизации);
	
КонецПроцедуры             

// Функция возвращает слово с учетом языка.
//
Функция ПолучитьСловоСУчетомЯзыка(Слово, ЭтоУкраина)
	
	Возврат МенеджерОборудованияВызовСервера.ПолучитьСловоСУчетомЯзыка(Слово, ЭтоУкраина);
	
КонецФункции

// Функция осуществляет печать нефискальной строки.
//
Функция НапечататьНефискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения, СтрокаТекста, ВыходныеПараметры) Экспорт

	Результат = Истина;

	ТабДок = Параметры.ТабличныйДокумент;
	Макет  = Параметры.Макет;
	
	ОблТовара = Макет.ПолучитьОбласть("ИнформацияОТоваре");
	
	ОблТовара.Параметры.Товар = СтрокаТекста;
	
	ТабДок.Вывести(ОблТовара);

	
	ПараметрыПодключения.СтрокаЛога = ПараметрыПодключения.СтрокаЛога + СтрокаТекста + Символы.ПС;

	Возврат Результат;

КонецФункции

// Функция осуществляет открытие нового чека.
//
Функция ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ЧекВозврата, ФискальныйЧек, ВыходныеПараметры) Экспорт

	Результат  = Истина;
	СтрокаЛога = "";
	ЭтоУкраина = Справочники.СтруктурныеЕдиницы.ВернутьРегиональныеНастройки().Код = "804";

	мНомерСмены = 1;
	//мНомерЧека  = ?(Параметры.Свойство("ПоследнийНомерЧека"), Параметры.ПоследнийНомерЧека + 1, 1);
	
	Если ФискальныйЧек Тогда
		УстановитьПривилегированныйРежим(Истина);
		Попытка
			
			ОбъектПодклОборудования = Параметры.Идентификатор.ПолучитьОбъект();
			НастройкиДо = ОбъектПодклОборудования.Параметры.Получить();
			Если ТипЗнч(НастройкиДо) = Тип("Структура") И НастройкиДо.Свойство("ПоследнийНомерЧека") Тогда
				НастройкиДо.ПоследнийНомерЧека = НастройкиДо.ПоследнийНомерЧека + 1;
			Иначе
				Если Не ТипЗнч(НастройкиДо) = Тип("Структура") Тогда
					НастройкиДо = Новый Структура;
				КонецЕсли;				
				НастройкиДо.Вставить("ПоследнийНомерЧека", 1);
			КонецЕсли;
			ОбъектПодклОборудования.Параметры = Новый ХранилищеЗначения(НастройкиДо);
			
			мНомерЧека  = НастройкиДо.ПоследнийНомерЧека;
			
			ОбъектПодклОборудования.Записать();      		
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Ошибка наращивания номера чека для %1. Описание ошибки: %2'"), Параметры.Идентификатор, ОписаниеОшибки));
		КонецПопытки;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	Если ЭтоУкраина Тогда
		Макет = Справочники.ДрайверыОборудования.ПолучитьМакет("ЧекWinPrint_UA");
	Иначе
		Макет = Справочники.ДрайверыОборудования.ПолучитьМакет("ЧекWinPrint");
	КонецЕсли;
	
	//ОблРазделение = МенеджерОборудованияСервер.ПолучитьОбластьМакета("Разделение");
	
	Если ФискальныйЧек Тогда
		
		Если Параметры.Свойство("ОтображатьЛоготип") И Параметры.ОтображатьЛоготип 
			И Параметры.Свойство("ЛоготипОрганизации") И ЗначениеЗаполнено(Параметры.ЛоготипОрганизации) Тогда 
			
			ВывестиОбластьЛоготипа(ТабДок, Макет, Параметры);
		КонецЕсли;              
		
		ОблРазделение    = Макет.ПолучитьОбласть("Разделение");
		ОблЗаголовка     = Макет.ПолучитьОбласть("Заголовок");
		ОблДопИнформации = Макет.ПолучитьОбласть("ДопИнформация");
		                 		
		СтрокаЛога = СтрокаЛога + "===== " + ?(ЧекВозврата, ПолучитьСловоСУчетомЯзыка("Открытие чека возврата", ЭтоУкраина), ПолучитьСловоСУчетомЯзыка("Открытие чека продажи", ЭтоУкраина)) + " =====" + Символы.ПС;
		
		СтрокаЛога = СтрокаЛога + "=====" + ?(ФискальныйЧек, "== " + ПолучитьСловоСУчетомЯзыка("Фискальный режим", ЭтоУкраина), " " + ПолучитьСловоСУчетомЯзыка("Нефискальный режим", ЭтоУкраина)) + "=====" + Символы.ПС;
		
		СтрокаЛога = СтрокаЛога + ПолучитьСловоСУчетомЯзыка("Кассир", ЭтоУкраина) + ": " + ОбщегоНазначенияСтоматология.ТекущийПользователь() + Символы.ПС; 
		
		СтрокаЛога = СтрокаЛога + НСтр("ru='№ чека';en='№ check'")   + ": " + Формат(мНомерЧека,  "ЧЦ=4; ЧН=0; ЧВН=")
		+ "    "
		+ "№" + ПолучитьСловоСУчетомЯзыка("смены", ЭтоУкраина) + ": " + Формат(мНомерСмены, "ЧЦ=4; ЧН=0; ЧВН=") + Символы.ПС;
		
		НомерСмены = мНомерСмены;
		НомерЧека  = мНомерЧека;
		
		// Заполнение выходных параметров
		ВыходныеПараметры.Добавить(НомерСмены);
		ВыходныеПараметры.Добавить(НомерЧека);
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(ТекущаяДатаСеанса());
		
		ПараметрыПодключения.Вставить("ФискальныйЧек", ФискальныйЧек);
		ПараметрыПодключения.Вставить("ЧекОткрыт"    , Истина);
		ПараметрыПодключения.Вставить("ИтогЧека"     , 0);
		
		ПараметрыПодключения.СтрокаЛога = ПараметрыПодключения.СтрокаЛога + СтрокаЛога;
		
		// заполняем шапку таблицы
		Для Каждого СтрокаШапки Из Параметры.ТаблицаШапкаЧека Цикл
			ОблЗаголовка.Параметры.ТекстЗаголовка = СокрЛП(СтрокаШапки);
			ТабДок.Вывести(ОблЗаголовка);
		КонецЦикла;
		ОблДопИнформации.Параметры.ТекстДопИнформации = ПолучитьСловоСУчетомЯзыка("Кассир", ЭтоУкраина) + ": " + ОбщегоНазначенияСтоматология.ТекущийПользователь();
		ТабДок.Вывести(ОблДопИнформации);
		
		Если ПользователиСлужебныйПовтИсп.ЯзыкИнтерфейсаАнглийский() Тогда
			ДопИнфКНомеруЧека = Параметры.Префикс + "/" + Формат(ТекущаяДата(),"ДФ=yyyy") + "/";
		Иначе
			ДопИнфКНомеруЧека = "";
		КонецЕсли;
		
		ОблДопИнформации.Параметры.ТекстДопИнформации = СтрШаблон(НСтр("ru='%2 №: %1';en='%2 # %1'"), 
																	ДопИнфКНомеруЧека + Формат(мНомерЧека, "ЧЦ=4; ЧВН=; ЧГ=0"),
																	?(ПользователиСлужебныйПовтИсп.ЯзыкИнтерфейсаАнглийский(), ?(ЧекВозврата, "Credit note", "Invoice"), "Чек"));
																	
		//ОблДопИнформации.Параметры.ТекстДопИнформации = "Чек №: " + Формат(НомерЧека, "ЧЦ=11; ЧВН=; ЧГ=0");
		ТабДок.Вывести(ОблДопИнформации);
		
		ОблДопИнформации.Параметры.ТекстДопИнформации = Формат(ТекущаяДата(),"ДЛФ=DT");
		ТабДок.Вывести(ОблДопИнформации);
		ТабДок.Вывести(ОблРазделение);
	Иначе
		// Заполнение выходных параметров
		ВыходныеПараметры.Добавить(мНомерСмены);
		ВыходныеПараметры.Добавить(мНомерЧека);
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(ТекущаяДатаСеанса());  
	КонецЕсли;
	
	Параметры.Вставить("ТабличныйДокумент"	, ТабДок);
	Параметры.Вставить("Макет"				, Макет);
	
	Возврат Результат;

КонецФункции

// Функция получает последний номер чека.
//
Функция ПолучитьПоследнийНомерЧека(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка    
		ОбъектПодклОборудования = Параметры.Идентификатор.ПолучитьОбъект();
		Настройки = ОбъектПодклОборудования.Параметры.Получить();
		Возврат Настройки.ПоследнийНомерЧека;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Ошибка чтения номера чека для %1. Описание ошибки: %2'"), Параметры.Идентификатор, ОписаниеОшибки));
		Возврат Неопределено;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции        

#КонецОбласти
