
#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - обработчик события "Выбор" элемента формы "Список".
//
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповеститьОВыборе(Элементы.Список.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
// Процедура печати.
//
Процедура ДокументПечать(Команда)	
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "НачислениеЗарплаты");	
	Структура.Вставить("МассивДокументов", Элементы.Список.ВыделенныеСтроки);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ОбработкаКоманды", УправлениеПечатьюКлиентСтоматология, Структура);									
	
	ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, ТекущийЭлемент);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()                           	
	Возврат Документы.НачислениеЗарплаты.ПолучитьСписокПечатныхФорм();	
КонецФункции

#КонецОбласти