
&НаКлиенте
Перем ИскомыйКлиент;

#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик создания формы на сервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	РежимРаботыЕдинаяСеть 					= Константы.РежимРаботыСетиСтоматологий.Получить() = Перечисления.РежимРаботыСетиСтоматологий.ЕдинаяСеть; 
	ИспользоватьБезПодключенияОборудования 	= ?(ЗначениеЗаполнено(Объект.Касса), Объект.Касса.ИспользоватьБезПодключенияОборудования, Ложь);	
	ККТ                                     = Объект.Касса.ВнешнееОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
		
	// Элементы.ГруппаРасшифровка.Ширина             = ?(Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта, 134, 140);
	// Элементы.ГруппаРасшифровкаДинамические.Ширина = ?(Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта, 134, 140);
	СтруктураМеню = Новый Структура;
	СтруктураМеню.Вставить("Расшифровка"  , "ГруппаРасшифровка");	
	СтруктураМеню.Вставить("Дополнительно", "ГруппаДополнительно");	
	
	ОбработкаТабличныхЧастейКлиент.СоздатьМенюДокумента(ЭтаФорма, СтруктураМеню, "ГруппаПереключательЗакладок");
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
	ЭтотОбъект.ЗаблокироватьРедактирование = ЗначениеЗаполнено(Объект.НомерЧекаККМ);
	
	СоздатьЭлементыРасшифровкиПлатежа();
	УстановитьВидимость();
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
	Если Объект.ПометкаУдаления = Истина Тогда
		Элементы.ГруппаСостояниеОбъекта.Видимость = Истина;	
		РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления, Объект.Проведен);		
	КонецЕсли;
	
	НастройкаШириныЭлементовФормы();	

КонецПроцедуры

// Процедура - При чтении на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления, Объект.Проведен);
	
	Если Объект.ПометкаУдаления = Истина Тогда
		Элементы.ГруппаСостояниеОбъекта.Видимость = Истина;	
	Иначе
		Элементы.ГруппаСостояниеОбъекта.Видимость = Ложь;	
	КонецЕсли; 
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

// Процедура - После записи на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления, Объект.Проведен);
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет обработку нажатия динамических кнопок.
//
Процедура ПроцедураОбработкиНажатияМеню(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ПроцедураОбработкиНажатияМеню(ЭтаФорма, Элемент.Имя);	
		
КонецПроцедуры

&НаКлиенте
// Обработчик после записи формы на клиенте
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьВидимость(); 
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВзносНаЛицевойСчет") Тогда
		Оповестить("ПРОВЕДЕН_ВЗНОС_НА_ЛИЦЕВОЙ_СЧЕТ");
	КонецЕсли;
	// Оповестить динамические списки
	МассивТипов = Новый Массив;
	Для Каждого СтрокаТ ИЗ Объект.РасшифровкаПлатежа Цикл
		Если ЗначениеЗаполнено(СтрокаТ.ДокументОснования) И МассивТипов.Найти(ТипЗнч(СтрокаТ.ДокументОснования)) = Неопределено Тогда
			ОповеститьОбИзменении(СтрокаТ.ДокументОснования);
			МассивТипов.Добавить(ТипЗнч(СтрокаТ.ДокументОснования));
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПередЗакрытием" формы
//
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	// Прверить наопминания для клиентов
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		ПроверитьТекущиеНапоминанияПоПосещениямСтоматология(Объект.Контрагент);
	КонецЕсли;			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОсновныхЭлементовУправления

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "Дата".
//
Процедура ДатаПриИзменении(Элемент)

	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "Статья".
//
Процедура СтатьяПриИзменении(Элемент)	
	
	Для Каждого СтрокаТЧ Из Объект.РасшифровкаПлатежа Цикл	
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Статья) ИЛИ Объект.СтатьяВТаблице = Ложь Тогда 
			СтрокаТЧ.Статья = Объект.Статья;
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаОтКлиента") Тогда
		СоздатьЭлементыРасшифровкиПлатежа();
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
// Обработчик изменения типа денежных средств
//
Процедура ТипДенежныхСредствПриИзменении(Элемент)
    УстановитьВидимость();
	НастройкаШириныЭлементовФормы();	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора" поля Касса.
//
Процедура КассаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	мПараметрыВыбора = Новый Структура;
	мПараметрыВыбора.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("КассаНачалоВыбораЗавершение", ЭтотОбъект); 
	ОткрытьФорму("Справочник.Кассы.ФормаВыбора", мПараметрыВыбора,,,,,ОписаниеОповещения , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Касса начало выбора завершение
//
// Параметры:
//  ВыбранноеЗначение		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура КассаНачалоВыбораЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда 
		Объект.Касса = ВыбранноеЗначение;
		ККТ = ОпределитьТипОборудования(Объект.Касса);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля Касса.
//
Процедура КассаПриИзменении(Элемент)
	
	ККТ = ОпределитьТипОборудования(Объект.Касса);
		
КонецПроцедуры

 &НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "ВидОперации".
//
Процедура ВидОперацииПриИзменении(Элемент)
	
	ВидОперацииПриИзмененииСервер();
	НастройкаШириныЭлементовФормы();
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаОтСтраховойКомпании") Тогда
		
	//	Элементы.КассоваяСменаТекущая.МаксимальнаяШирина	 = 61;
	//	Элементы.СтруктурнаяЕдиница.МаксимальнаяШирина		 = 61;
	//	Элементы.Комментарий.МаксимальнаяШирина				 = 61;
	//	Элементы.Номер.МаксимальнаяШирина					 = 32;
	//	Элементы.НомерВходящегоДокумента.МаксимальнаяШирина	 = 30;
	//	Элементы.ДатаВходящегоДокумента.МаксимальнаяШирина	 = 25;
		
	Иначе
		
	//	Элементы.КассоваяСменаТекущая.МаксимальнаяШирина	 = 56;
	//	Элементы.СтруктурнаяЕдиница.МаксимальнаяШирина		 = 56;
	//	Элементы.Комментарий.МаксимальнаяШирина				 = 56;
	//	Элементы.Номер.МаксимальнаяШирина					 = 27;
	//	Элементы.НомерВходящегоДокумента.МаксимальнаяШирина	 = 24;
	//	Элементы.ДатаВходящегоДокумента.МаксимальнаяШирина	 = 26;
		
		СоздатьЭлементыРасшифровкиПлатежа();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора" поля "ВидОперации".
//
Процедура ВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущаяОперация = Объект.ВидОперации;
КонецПроцедуры

&НаСервере
// Процедура - обработчик события на сервере "ПриИзменении" поля "ВидОперации".
//
Процедура ВидОперацииПриИзмененииСервер()
		
	Если ТекущаяОперация <> Объект.ВидОперации Тогда	
		Если Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОтПодотчетника Тогда
			Объект.БанковскийСчет              = Неопределено;
			Объект.БанковскийСчетКонтрагента   = Неопределено;
			Объект.Касса	                   = Неопределено;	
			Если НЕ (Объект.ВидОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента
				ИЛИ Объект.ВидОперации  = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет) Тогда
				Объект.Контрагент                   = Неопределено;
				Объект.ЛицевойСчетКонтрагента       = Неопределено;
				Объект.ЭквайрингВидПлатежнойКарты   = Неопределено;
				Объект.ЭквайрингНомерПлатежнойКарты = Неопределено;
			КонецЕсли;
		КонецЕсли;
		Объект.Статья = Справочники.СтатьиДоходовИРасходов.ПолучитьСтатьюПоУмолчаниюДляОперации(Объект.ВидОперации);
		Для Каждого ЭлементТЧ Из Объект.РасшифровкаПлатежа Цикл 
			ЭлементТЧ.Статья = Объект.Статья;		
		КонецЦикла;
		// Пересчет суммы коммии банка
		Если Объект.ВидОперации = Перечисления.ВидыОпераций.ПоступлениеОтЭквайера Тогда
			ПроцентКомиссии                    = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.ЭквайрингТерминал, "ПроцентКомиссии");
			Объект.ЭквайрингСуммаКомиссииБанка = (Объект.СуммаДокумента * ПроцентКомиссии) / (100 - ПроцентКомиссии);
		ИначеЕсли Объект.ЭквайрингСуммаКомиссииБанка <> 0 Тогда
			Объект.ЭквайрингСуммаКомиссииБанка = 0;
		КонецЕсли;	
		
		// Зачищаем таблицу расшифровки
		Объект.РасшифровкаПлатежа.Очистить();	
		СтрокаТаблицы        = Объект.РасшифровкаПлатежа.Добавить();
		СтрокаТаблицы.Сумма  = Объект.СуммаДокумента;	
		СтрокаТаблицы.Статья = Объект.Статья;
		
	КонецЕсли;	
	УстановитьВидимость();
	УстановитьДоступностьПечатиЧека();
	
КонецПроцедуры // ВидОперацииПриИзмененииСервер()

&НаКлиенте
// Перед началом выбора контрагента
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВзносУчредителя")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратНалога") Тогда
		
		СтруктураПараметры = Новый Структура;
				
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора",СтруктураПараметры,,,,, Новый ОписаниеОповещения("КонтрагентНачалоВыбораЗавершение", ЭтотОбъект));
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОплатыОтПоставщика")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратЗайма") Тогда
		
		СтруктураПараметры = Новый Структура;
		Массив = Новый Массив;
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Поставщик"));
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиенты"));
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.КорпоративныеКонтрагенты"));
		
		СтруктураПараметры = Новый Структура("Отбор", Новый Структура("ТипКонтрагента", Новый ФиксированныйМассив(Массив)));	
		
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора",СтруктураПараметры,,,,, Новый ОписаниеОповещения("КонтрагентНачалоВыбораЗавершение", ЭтотОбъект));
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОтПодотчетника") Тогда
		
		ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора",,,,,, Новый ОписаниеОповещения("КонтрагентНачалоВыбораЗавершение", ЭтотОбъект));
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаОтСтраховойКомпании") Тогда
		
		СтруктураПараметры = Новый Структура;
		Массив = Новый Массив;
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.СтраховаяКомпания"));
		
		СтруктураПараметры = Новый Структура("Отбор", Новый Структура("ТипКонтрагента", Новый ФиксированныйМассив(Массив)));	
		
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора",СтруктураПараметры,,,,, Новый ОписаниеОповещения("КонтрагентНачалоВыбораЗавершение", ЭтотОбъект));
	
	Иначе	
		
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораКлиенты",,,,,, Новый ОписаниеОповещения("КонтрагентНачалоВыбораЗавершение", ЭтотОбъект));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.Контрагент = Результат;
		КонтрагентПриИзмененииСервер();
		ТекущийКонтрагент = Результат;		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поля контрагент
//
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииСервер();
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		ПроверитьТекущиеНапоминанияПоПосещениямСтоматология(Объект.Контрагент);
    КонецЕсли;	
КонецПроцедуры

&НаСервере
// При изменении контрагента, сервер
Процедура КонтрагентПриИзмененииСервер()
	
	Если ТекущийКонтрагент <> Объект.Контрагент Тогда
		Объект.БанковскийСчетКонтрагента    = Неопределено;
		// Объект.ЛицевойСчетКонтрагента       = Неопределено;
		Объект.ЭквайрингВидПлатежнойКарты   = Неопределено;
		Объект.ЭквайрингНомерПлатежнойКарты = Неопределено;
		Объект.Договор                      = Неопределено;
		// Установка банковского счета контрагента по умолчанию(при указанных условиях)
		Если Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные
			И НЕ Объект.ВидОперации    = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет	
			И ЗначениеЗаполнено(Объект.Контрагент) Тогда	
			Объект.БанковскийСчетКонтрагента = Объект.Контрагент.БанковскийСчетПоУмолчанию;
		КонецЕсли; 
		ОбновитьИнформациюПоОстаткамЛСиЗадолженностям();
		Элементы.Договор.Видимость = ЗначениеЗаполнено(Объект.Контрагент) 
			И ?(ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Контрагенты") 
			И Объект.Контрагент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты, Ложь, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора"
//
Процедура КонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = "СоздатьНовогоКлиента" Тогда
		ДобавитьИВыбратьКонтрагента();
		ВыбранноеЗначение = Объект.Контрагент;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "АвтоПодбор"
//
Процедура КонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ДанныеВыбора         = ОбщегоНазначенияСтоматология.НайтиКонтрагентовПоСтроке(Текст, 10, Истина, Истина,,,,ПолучитьТипыКонтрагентовПоВидуОперации(Объект.ВидОперации, Объект.ТипДенежныхСредств));
	ИскомыйКлиент        = Текст;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОкончаниеВводаТекста"
//
Процедура КонтрагентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ДанныеВыбора         = ОбщегоНазначенияСтоматология.НайтиКонтрагентовПоСтроке(Текст, , Истина, Истина,,,,ПолучитьТипыКонтрагентовПоВидуОперации(Объект.ВидОперации, Объект.ТипДенежныхСредств));
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Контрагент это клиент
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьТипыКонтрагентовПоВидуОперации(ВидОперации, ТипДенежныхСредств)
	
	Массив = Новый Массив;
	
	Если ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыОтПоставщика 
		Или ВидОперации = Перечисления.ВидыОпераций.ОплатаПоставщику Тогда
		
		 Массив.Добавить(Перечисления.ТипыКонтрагентов.Поставщик);
		 
	ИначеЕсли ВидОперации = Перечисления.ВидыОпераций.ВозвратЗайма Тогда
		
    	 Массив.Добавить(Перечисления.ТипыКонтрагентов.Поставщик);
		 Массив.Добавить(Перечисления.ТипыКонтрагентов.Клиенты);
		 Массив.Добавить(Перечисления.ТипыКонтрагентов.КорпоративныеКонтрагенты);
		 
	ИначеЕсли ВидОперации = Перечисления.ВидыОпераций.ОплатаОтСтраховойКомпании Тогда
		 Массив.Добавить(Перечисления.ТипыКонтрагентов.СтраховаяКомпания);
	Иначе
		
		Массив.Добавить(Перечисления.ТипыКонтрагентов.Клиенты);
		
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик события "ДобавитьИВыбратьКонтрагента"
//
Процедура ДобавитьИВыбратьКонтрагента()

	ПараметрыОткрытия = Новый Структура;
	ГруппаКлиентов    = ВернутьГруппуКлиентов();  
	ПараметрыОткрытия.Вставить("Родитель", ГруппаКлиентов);
	ПараметрыОткрытия.Вставить("ТекстЗаполнения", ИскомыйКлиент);  
	ПараметрыЗаполнения = Новый Структура("Основание", ПараметрыОткрытия);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьИВыбратьКонтрагентаЗавершение", ЭтаФорма);
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаЭлементаКлиенты", ПараметрыЗаполнения,,,,,ОписаниеОповещения);
	
КонецПроцедуры 

&НаКлиенте
// Процедура - Добавить и выбрать контрагента завершение
// 
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
// 
Процедура ДобавитьИВыбратьКонтрагентаЗавершение(Результат, Параметры) Экспорт
	
	Если Не Результат.Пустая() Тогда
		Объект.Контрагент = Результат;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
// Функция возвращает группу клиентов
//
Функция ВернутьГруппуКлиентов()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиПользователей.Значение
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Пользователь = &Пользователь
	|	И НастройкиПользователей.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И НастройкиПользователей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяГруппаКонтрагентов)");
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	Иначе 
		Возврат Справочники.Контрагенты.ПолучитьПапкуПоТипу(Перечисления.ТипыКонтрагентов.Клиенты);
	КонецЕсли;
	
КонецФункции

&НаСервере
// Обновить информацию остатка лицевого счета клиента и задолженности 
Процедура ОбновитьИнформациюПоОстаткамЛСиЗадолженностям()
	
	Долг 					= РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ПолучитьОстатокПоВзаиморасчетамСконтрагентом(Объект.Контрагент,, Объект.СтруктурнаяЕдиница);	
	Если РежимРаботыЕдинаяСеть Тогда
		ОстатокЛицевогоСчета 	= РегистрыНакопления.ДенежныеСредстваНаЛицевыхСчетах.ПолучитьОстаткиНаЛицевыхСчетахКонтрагента(Объект.Контрагент, ТекущаяДатаСеанса(),,,, Истина);	
	Иначе
		ОстатокЛицевогоСчета 	= РегистрыНакопления.ДенежныеСредстваНаЛицевыхСчетах.ПолучитьОстаткиНаЛицевыхСчетахКонтрагента(Объект.Контрагент, ТекущаяДатаСеанса(),, Объект.СтруктурнаяЕдиница,, Истина);	
	КонецЕсли;
	// Декорация задолженности контрагента
	Элементы.ДекорацияЗадолженностьСумма.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
	Если Долг > 0 Тогда
		Элементы.ДекорацияЗадолженностьСумма.Заголовок  = "Долг пациента:";
		Элементы.ДекорацияДолг.Заголовок                = Формат(Долг, "ЧЦ=15; ЧДЦ=2; ЧН=") + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
		Элементы.ДекорацияЗадолженностьСумма.ЦветТекста = WebЦвета.Красный;
		Элементы.ДекорацияДолг.ЦветТекста               = WebЦвета.Красный;		
	ИначеЕсли Долг < 0 Тогда
		Элементы.ДекорацияЗадолженностьСумма.Заголовок  = "Наш долг перед пациентом:";
		Элементы.ДекорацияДолг.Заголовок                = Формат(-Долг, "ЧЦ=15; ЧДЦ=2; ЧН=") + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
		Элементы.ДекорацияЗадолженностьСумма.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
		Элементы.ДекорацияДолг.ЦветТекста               = ЦветаСтиля.ПоясняющийТекст;
	Иначе
		Элементы.ДекорацияЗадолженностьСумма.Заголовок  = "Нет задолженности.";
		Элементы.ДекорацияДолг.Заголовок                = "";
		Элементы.ДекорацияЗадолженностьСумма.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
		Элементы.ДекорацияДолг.ЦветТекста               = ЦветаСтиля.ПоясняющийТекст;				
	КонецЕсли;
	// Декорация остатка лицевого счета
	Элементы.ДекорацияОстаткиНаЛицевыхсчетах.Заголовок = "Лицевой счет:";
	Элементы.ДекорацияОстатокЛицевогоСчета.Заголовок = Формат(ОстатокЛицевогоСчета, "ЧЦ=15; ЧДЦ=2; ЧН=") + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
	Если ОстатокЛицевогоСчета < 0 Тогда
		Элементы.ДекорацияОстаткиНаЛицевыхсчетах.ЦветТекста = WebЦвета.Красный;
		Элементы.ДекорацияОстатокЛицевогоСчета.ЦветТекста = WebЦвета.Красный;
	Иначе
		Элементы.ДекорацияОстаткиНаЛицевыхсчетах.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
		Элементы.ДекорацияОстатокЛицевогоСчета.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Обработчик запуска формы расшифровки задолженности контрагента
Процедура КомандаРасшифровкаЗадолженности(Команда)
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПараметрыФормы = Новый Структура("Контрагент",Объект.Контрагент);
		ОткрытьФорму("Отчет.ВзаиморасчетыПодробно.Форма.ФормаОтчета", ПараметрыФормы);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Обработчик запуска формы расшифровки лицевых счетов контрагента
Процедура КомандаРасшифровкаОстатковНаЛС(Команда)
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
		ОтборРасшифровки = Новый Соответствие;
		ОтборРасшифровки.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыОткрытия.Вставить("ОтборРасшифровки", ОтборРасшифровки);
		Вариант =  СсылкаВариантаОтчета("ПерейтиЛицевыеСчета", "Основной");
		ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтаФорма, Вариант, ПараметрыОткрытия);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
// Обработчик при начале выбора банковского счета зачисления средств 
Процедура БанковскийСчетЗачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ОткрытьФорму("Справочник.БанковскиеСчета.ФормаВыбора", 
	Новый Структура("Владелец", ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.СтруктурнаяЕдиница, "Организация")),,,,, 
	Новый ОписаниеОповещения("БанковскийСчетЗачисленияНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

// Процедура - Банковский счет зачисления начало выбора завершение
// Завершение немодального открытия окна формы - Справочник Банковские счета ФормаВыбора
// Параметры:
//  Результат	 - 	 Результат Оповещения 
//  Параметры	 - 	 Параметры Оповещения  
//
&НаКлиенте
Процедура БанковскийСчетЗачисленияНачалоВыбораЗавершение(Результат, Параметры)  Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Объект.БанковскийСчет = Результат;	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработчик при начале выбора банковского счета списания средств
Процедура БанковскийСчетСписанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РеквизитВладельца = Неопределено;
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
	    РеквизитВладельца = Объект.Контрагент;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоступлениеИзБанка") Тогда
		РеквизитВладельца = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.СтруктурнаяЕдиница, "Организация");
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(РеквизитВладельца) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОткрытьФорму("Справочник.БанковскиеСчета.ФормаВыбора", 
		Новый Структура("Владелец", РеквизитВладельца),,,,, 
		Новый ОписаниеОповещения("БанковскийСчетСписанияНачалоВыбораЗавершение", ЭтотОбъект), 
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

	КонецЕсли;
	
КонецПроцедуры

// Процедура - Банковский счет списания начало выбора завершение
// Завершение немодального открытия окна формы - Справочник Банковские счета - ФормаВыбора
// Параметры:
//  Результат	 - 	 Результат Оповещения 
//  Параметры	 - 	 Параметры Оповещения  
//
&НаКлиенте
Процедура БанковскийСчетСписанияНачалоВыбораЗавершение(Результат, Параметры)  Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.БанковскийСчетКонтрагента = Результат;	
	КонецЕсли;  
	
КонецПроцедуры

 &НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "СуммаДокумента".
//
Процедура СуммаДокументаПриИзменении(Элемент)
	Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда		
		СтрокаТаблицы       = Объект.РасшифровкаПлатежа[0];
		СтрокаТаблицы.Сумма = Объект.СуммаДокумента;		
	КонецЕсли;
	// Пересчет суммы коммии банка
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоступлениеОтЭквайера") Тогда
		ПроцентКомиссии                    = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.ЭквайрингТерминал,"ПроцентКомиссии");
	    Объект.ЭквайрингСуммаКомиссииБанка = (Объект.СуммаДокумента * ПроцентКомиссии) / (100 - ПроцентКомиссии);
	КонецЕсли;	
КонецПроцедуры // СуммаДокументаПриИзменении()

&НаКлиенте
// Процедура, обработчик события "ПриНачалеРедактирования" таблицы "РасшифровкаПлатежа".
//
Процедура РасшифровкаПлатежаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)	
	Если НоваяСтрока = Истина Тогда
		Если Объект.СтатьяВТаблице = Ложь Тогда
			Элемент.ТекущиеДанные.Статья = Объект.Статья;
		Иначе
			Элемент.ТекущиеДанные.Статья = ПолучитьПредопределеннуюСтатьюДляОперации(Объект.ВидОперации,Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратЗаработнойПлаты")
	   И НоваяСтрока = Истина Тогда
		Элемент.ТекущиеДанные.ДокументОснования = Объект.ВозвратВыплатыЗПДокументОснования;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработчик при окончании редактирования ТЧ 
Процедура РасшифровкаПлатежаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если Элемент.ТекущийЭлемент = Элементы.РасшифровкаПлатежаСумма Тогда
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("Сумма");
	КонецЕсли;                                                           
	// Проверка соответсвия статьи расходов
	ТекущиеДанные         = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Если ТекущиеДанные <> НЕопределено Тогда
		СтатьяРасходов = ПолучитьПредопределеннуюСтатьюДляОперации(Объект.ВидОперации,НЕ ЗначениеЗаполнено(ТекущиеДанные.ДокументОснования));
		МестоХраненияСтатьи = ?(НЕ Объект.СтатьяВТаблице, Объект, ТекущиеДанные); 
		Если ЗначениеЗаполнено(СтатьяРасходов) И (НЕ ЗначениеЗаполнено(МестоХраненияСтатьи.Статья) ИЛИ СтатьяРасходов <> МестоХраненияСтатьи.Статья) Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("РасшифровкаПлатежаПриОкончанииРедактированияЗавершение", ЭтотОбъект, Новый Структура("МестоХраненияСтатьи, СтатьяРасходов", МестоХраненияСтатьи, СтатьяРасходов));
			ПоказатьВопрос(ОписаниеОповещения, "Статья расходов не соответсвует виду операции, сменить статью?",РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Процедура - Расшифровка платежа при окончании редактирования завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура РасшифровкаПлатежаПриОкончанииРедактированияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	МестоХраненияСтатьи = ДополнительныеПараметры.МестоХраненияСтатьи;
	СтатьяРасходов = ДополнительныеПараметры.СтатьяРасходов;
	
	Если НЕ ЗначениеЗаполнено(МестоХраненияСтатьи.Статья) ИЛИ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		МестоХраненияСтатьи.Статья = СтатьяРасходов; 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "РасшифровкаПлатежаПослеУдаления" таблицы "РасшифровкаПлатежа"
//
Процедура РасшифровкаПлатежаПослеУдаления(Элемент)
	
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("Сумма");
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора" поля "РасшифровкаПлатежаЗаказПоступление".
//
Процедура РасшифровкаПлатежаЗаказРеализацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	ПараметрыФормы       = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент"         ,Объект.Контрагент);
	ПараметрыФормы.Вставить("ВидОперации"        ,Объект.ВидОперации);
	ПараметрыФормы.Вставить("СтруктурнаяЕдиница" ,Объект.СтруктурнаяЕдиница);
	ПараметрыФормы.Вставить("КотрольКонтрагента" ,ЗначениеЗаполнено(Объект.Контрагент));
	
	ОткрытьФорму("ОбщаяФорма.ВыборДокументаРасчетов",ПараметрыФормы,Элемент);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ОбработкаВыбора" поля "РасшифровкаПлатежаЗаказПоступление".
//
Процедура РасшифровкаПлатежаЗаказРеализацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ОбработатьВыбранноеЗначение(ВыбранноеЗначение, Элемент.Имя);

КонецПроцедуры

&НаКлиенте
// Процедура - Обработать выбранное значение на сервере.
//
Процедура ОбработатьВыбранноеЗначение(Знач ВыбранноеЗначение, Знач ИмяЭлемента)
	
	Если ВыбранноеЗначение <> Неопределено Тогда 
		Счетчик = 0;
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
			Для Каждого ЭлементМ ИЗ ВыбранноеЗначение Цикл
				ДобавитьИзменитьСтрокуРасшифровкуПлатежа(Счетчик, ИмяЭлемента, ЭлементМ);
			КонецЦикла;
		Иначе
			ДобавитьИзменитьСтрокуРасшифровкуПлатежа(Счетчик, ИмяЭлемента, ВыбранноеЗначение);
		КонецЕсли; 
		// Подсчет суммы документа
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("Сумма");
		Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаОтСтраховойКомпании") Тогда
			ОчиститьЭлементыРасшифровки();
			СоздатьЭлементыРасшифровкиПлатежа(); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить изменить строку расшифровку платежа.
//
Процедура ДобавитьИзменитьСтрокуРасшифровкуПлатежа(Счетчик, Знач ИмяЭлемента, Знач ЗначениеВыбора)
		
	РазрешитьДобавление = Истина;
	// Проверка существования строки с выбранными данными
	Для Каждого СтрокаТ ИЗ Объект.РасшифровкаПлатежа Цикл 
		
		Если ТипЗнч(ЗначениеВыбора) = Тип("ДокументСсылка.НачислениеЗарплаты") Тогда
			
			СтрокаТ.Сумма       = ЗначениеВыбора.СуммаДокумента; 
			РазрешитьДобавление = Ложь;
			Счетчик = Счетчик + 1;
			Прервать;
			
		КонецЕсли;
		
		Если СтрокаТ.ДокументОснования = ЗначениеВыбора.ДокументОснования 
			И СтрокаТ.ДокументАванса = ЗначениеВыбора.ДокументАванса Тогда
			
			СтрокаТ.Сумма       = ЗначениеВыбора.СуммаДокумента; 
			РазрешитьДобавление = Ложь;
			Счетчик = Счетчик + 1;
			Прервать;
			
		КонецЕсли;	
	КонецЦикла;
	// Если добавление данных в строку разрешено
	Если РазрешитьДобавление = Истина Тогда
		
		ОбрабатываемаяСтрока = Неопределено;
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаОтСтраховойКомпании") Тогда
			ОбрабатываемаяСтрока = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
		Иначе
			ОбрабатываемаяСтрока = Объект.РасшифровкаПлатежа[ПолучитьИндексСтроки(ИмяЭлемента)];
		КонецЕсли;	
		
		Если НЕ (Счетчик = 0 ИЛИ НЕ ЗначениеЗаполнено(ОбрабатываемаяСтрока.ДокументОснования) И НЕ ОбрабатываемаяСтрока.ЭтоАванс) Тогда 
			ПустыеСтроки = Объект.РасшифровкаПлатежа.НайтиСтроки(Новый Структура("ДокументОснования,Сумма",Неопределено,0));
			Если ПустыеСтроки.Количество() <> 0 Тогда
				ОбрабатываемаяСтрока = ПустыеСтроки[0];
			Иначе
				ОбрабатываемаяСтрока = Объект.РасшифровкаПлатежа.Добавить(); 
			КонецЕсли;
     
			
		КонецЕсли;	
		
		ОбрабатываемаяСтрока.ДокументОснования = ЗначениеВыбора.ДокументОснования;
		ОбрабатываемаяСтрока.ДокументАванса    = ЗначениеВыбора.ДокументАванса;
		ОбрабатываемаяСтрока.Сумма             = ЗначениеВыбора.Задолженность;
		
		Счетчик = Счетчик + 1;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработчик вызова заполнения/добавления данных в таблицу расшифровки
//
Процедура ОбщийОбработчикЗаполненияПоАкту(Команда)
	
	ПараметрыОткрытия = Новый Структура("Контрагент, Проведен", Объект.Контрагент, Истина);
	ОткрытьФорму("Документ.АктОказанияУслуг.ФормаВыбора", ПараметрыОткрытия,,,,, 
	Новый ОписаниеОповещения("ОбщийОбработчикЗаполненияПоАктуЗавершение", ЭтотОбъект, Команда), 
	РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

// Процедура - Общий обработчик заполнения по акту завершение
// Завершение немодального открытия окна формы - Документ Акт оказания услуг - ФормаВыбора
// Параметры:
//  Результат	 - 	 Результат Оповещения 
//  Параметры	 - 	 Параметры Оповещения  
//   
&НаКлиенте
Процедура ОбщийОбработчикЗаполненияПоАктуЗавершение(Результат, Параметры)  Экспорт
	
	Команда = Параметры;

	Если ЗначениеЗаполнено(Результат) Тогда
		Если Команда.Имя = "ДобавитьПоАктуВсемиПриемами" Тогда
			ЗаполнитьТаблицуРасшифровкиПоАктуОказанияуслуг(Результат,Ложь,Ложь);
		ИначеЕсли Команда.Имя = "ДобавитьПоАктуТолькоНеОплаченными" Тогда
			ЗаполнитьТаблицуРасшифровкиПоАктуОказанияуслуг(Результат,Ложь,Истина);
		ИначеЕсли Команда.Имя = "ЗаполнитьПоАктуВсемиПриемами" Тогда			
			ЗаполнитьТаблицуРасшифровкиПоАктуОказанияуслуг(Результат,Истина,Ложь);
		ИначеЕсли Команда.Имя = "ЗаполнитьПоАктуТолькоНеОплаченными" Тогда
			ЗаполнитьТаблицуРасшифровкиПоАктуОказанияуслуг(Результат,Истина,Истина);
		КонецЕсли;
	КонецЕсли;	
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("Сумма");

КонецПроцедуры

&НаСервере
// Процедура заполняет таблицу расшифровки по указанным параметрам
//
Процедура ЗаполнитьТаблицуРасшифровкиПоАктуОказанияуслуг(АктЗаполнения,Перезаполнить,ТолькоНеОплаченные)
	
	Если Перезаполнить Тогда
	     Объект.РасшифровкаПлатежа.Очистить();
    КонецЕсли;	
	Для Каждого СтрокаТЧ ИЗ АктЗаполнения.ОказанныеУслуги Цикл	
		Если НЕ ТолькоНеОплаченные ИЛИ СтрокаТЧ.ДокументОснования.СуммаОплачено < СтрокаТЧ.ДокументОснования.СуммаДокумента Тогда
			НоваяСтрока = Объект.РасшифровкаПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "ВТаблице".
//
Процедура ВТаблицеПриИзменении(Элемент)	
	
	Элементы.Статья.Доступность = НЕ Объект.СтатьяВТаблице;
	Элементы.РасшифровкаПлатежаСтатья.Видимость = Объект.СтатьяВТаблице;
	
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаОтСтраховойКомпании") Тогда
		
		СоздатьЭлементыРасшифровкиПлатежа();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОкончаниеВводаТекста".
//
Процедура РасшифровкаПлатежаДинамическиеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ТекущиеДанные = Объект.РасшифровкаПлатежа[ПолучитьИндексСтроки(Элемент.Имя)];
	СтатьяРасходов = ПолучитьПредопределеннуюСтатьюДляОперации(Объект.ВидОперации, НЕ ЗначениеЗаполнено(ТекущиеДанные.ДокументОснования));
	МестоХраненияСтатьи = ?(НЕ Объект.СтатьяВТаблице, Объект, ТекущиеДанные); 

	Если ЗначениеЗаполнено(СтатьяРасходов) И (НЕ ЗначениеЗаполнено(МестоХраненияСтатьи.Статья) ИЛИ СтатьяРасходов <> МестоХраненияСтатьи.Статья) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("РасшифровкаПлатежаПриОкончанииРедактированияЗавершение", ЭтотОбъект, Новый Структура("МестоХраненияСтатьи, СтатьяРасходов", МестоХраненияСтатьи, СтатьяРасходов));
		ПоказатьВопрос(ОписаниеОповещения, "Статья расходов не соответсвует виду операции, сменить статью?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура РасшифровкаПлатежаСуммаПриИзменении()
	
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
// При изменении выборя документа начисления ЗП
Процедура ВыплатаЗПДокументОснованияПриИзменении(Элемент)
	Объект.ВозвратВыплатыЗПМесяц = НачалоМесяца(ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.ВозвратВыплатыЗПДокументОснования,"ДатаНачалаПериода"));
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора".
//
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещение = Новый ОписаниеОповещения("ДоговорНачалоВыбораЗавершение", ЭтаФорма); 
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", Новый Структура("Отбор", Новый Структура("Контрагент", Объект.Контрагент))
		,,,,, ОписаниеОповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Декорация разблокировать документ нажатие
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ДекорацияРазблокироватьДокументНажатие(Элемент)
	ЭтотОбъект.ЗаблокироватьРедактирование = Ложь;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
// Процедура - Декорация отмена оплаты нажатие
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ДекорацияОтменаОплатыНажатие(Элемент)
	
	СуществующийДокСписания = ПолучитьСсылкуДокументаСписанияПоОтменеОшибочнойОплаты(Объект.Ссылка);
	Оповещение = Новый ОписаниеОповещения("ПослеЗаписиДокОтменыОплаты", ЭтотОбъект);
	Если НЕ ЗначениеЗаполнено(СуществующийДокСписания) Тогда  	
		ОткрытьФорму("Документ.СписаниеДенежныхСредств.ФормаОбъекта", Новый Структура("Основание", Объект.Ссылка),,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму("Документ.СписаниеДенежныхСредств.ФормаОбъекта", Новый Структура("Ключ", СуществующийДокСписания),,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыФискализацииДокумента

&НаКлиенте
// Процедура печати чека на фискальном регистраторе.
//
Процедура НапечататьЧек(Команда)
	
	Если ЗначениеЗаполнено(Объект.НомерЧекаККМ) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Документ уже пробит на фискальном регистраторе! Номер чека:';en='Document already stamped on the fiscal registrar! Room check:'") + Объект.НомерЧекаККМ);
		Возврат;
	КонецЕсли;
	
	Если Объект.Проведен = Ложь 
		ИЛИ ЭтаФорма.Модифицированность = Истина Тогда
		
		ПоказатьПредупреждение(, НСтр("ru='Предварительно документ необходимо провести.';en='Pre document is necessary conduct.'"));
		Возврат;
	КонецЕсли;
	
	// Проверяем ставку НДС.
	СтавкаНДС = ОбщегоНазначенияСтоматология.ПолучитьСтавкуНДС(Объект.СтруктурнаяЕдиница);			
	Если Не ЗначениеЗаполнено(СтавкаНДС) Тогда
		ПоказатьПредупреждение(, "Заполните ставку НДС в организации и повторите операцию оплаты.");
		ОткрытьФорму("Справочник.Организации.Форма.ФормаЭлемента", 
					Новый Структура("Ключ", ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.СтруктурнаяЕдиница, "Организация")));
		Возврат;	
	КонецЕсли;  
	
	ВидНалога = Неопределено;
	
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВзносНаЛицевойСчет") 
		И Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратСЛицевогоСчета")
		И Объект.Статья <> ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.ВозвратСЛицевогоСчета")
		И Объект.Статья <> ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.ВозвратАвансаКлиенту")
		И Объект.Статья <> ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.ВзносНалицевойСчет")
		И Объект.Статья <> ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.ВзносАвансаОтКлиента") Тогда
		
		Для Каждого СтрокаТЧ из Объект.РасшифровкаПлатежа Цикл
			Если ТипЗнч(СтрокаТЧ.ДокументОснования) = Тип("ДокументСсылка.Реализация")
				Или ТипЗнч(СтрокаТЧ.ДокументОснования) = Тип("ДокументСсылка.Прием") Тогда
				
				Если ВидНалога = Неопределено Тогда
					ВидНалога = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТЧ.ДокументОснования, "ВидНалога");
				ИначеЕсли НЕ ВидНалога = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТЧ.ДокументОснования, "ВидНалога") Тогда
					ТекстСообщения = "В одном документе, пробиваемом в ККТ с передачей данных, может пробиваться номенклатура, использующая один режим налогообложения (ЕНВД, УСХН, ПСН).";
					ПоказатьПредупреждение(, ТекстСообщения);
					Возврат;										
				КонецЕсли;
				
			КонецЕсли;			
		КонецЦикла;	
	Иначе
		ВидНалога = ОбщегоНазначенияСтоматология.ПолучитьВидНалогаАванс(Объект.СтруктурнаяЕдиница);
	КонецЕсли;

	// Выполнить контроль кассовой смены
	ОписаниеОшибки					= Неопределено;
	ВыполнятьОперациюНаФискальнике  = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.Касса, "ИспользоватьБезПодключенияОборудования") = Ложь; 
	ПараметрыИспользованияКассовойСмены = Новый Структура("ВыполнятьОперациюНаФискальнике", ВыполнятьОперациюНаФискальнике);
	РозничныеПродажиКлиент.ВыполнитьКонтрольИспользованияКассовойСмены(ЭтотОбъект, Объект.Касса, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки);
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ОчиститьЧекККМ".
//
Процедура ОчиститьЧекККМ(Команда)
		
	Если НЕ Объект.Ссылка.Пустая()
		И Объект.НомерЧекаККМ = 99999999 Тогда
		
		Объект.НомерЧекаККМ = 0;
		ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения выемки из кассы.
// 
Процедура ИнкассацияНаФискальномУстройствеЗавершение(РезультатВыполнения, Параметры) Экспорт
		
	Если РезультатВыполнения.Результат Тогда		
		// Если чек пробился, то возвращаем номер чека ккм в документ (по умолчанию 88888888).
		Объект.НомерЧекаККМ = 88888888;
		ЭтаФорма.Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));	
		//УстановитьСостояниеЭлементовФормы();                                                                                  		
	Иначе
		ТекстСообщения = НСтр("ru = 'При выполнении операции произошла ошибка.
			                        |Чек не напечатан на фискальном устройстве.
			                        |Дополнительное описание: %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - После контроля использования кассовой смены
//
// Параметры:
//  ИспользованиеКассовойСменыРазрешено	 - 	 - 
//  ПараметрыИспользованияКассовойСмены	 - 	 - 
//  ОписаниеОшибки						 - 	 - 
//
Процедура ПослеКонтроляИспользованияКассовойСмены(ИспользованиеКассовойСменыРазрешено, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки) Экспорт 
	
	Если ИспользованиеКассовойСменыРазрешено = Ложь Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Поступление денежных средств'; en = 'Cash inflow'"),,
										НСтр("ru = 'Операция запрещена: '; en = 'Operation is prohibited: '") + ОписаниеОшибки, 
										БиблиотекаКартинок.Предупреждение32,
										СтатусОповещенияПользователя.Важное); 
		Возврат;
	КонецЕсли;
	
	Если ПараметрыИспользованияКассовойСмены.Свойство("ВыполнятьОперациюНаФискальнике") 
		И ПараметрыИспользованияКассовойСмены.ВыполнятьОперациюНаФискальнике Тогда
		
		Если КассаИспользуетсяККТ(Объект.Касса) = Истина Тогда
			Если Не ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				ПараметрыФормы	= Новый Структура("Клиент, Касса", Объект.Контрагент, Объект.Касса);
				Оповещение		= Новый ОписаниеОповещения("НапечататьЧекЗавершение", ЭтотОбъект);
				ОткрытьФорму("Обработка.ПомощникПроведенияОплаты.Форма.ФормаФормированиеЧека", 
					ПараметрыФормы,
					ЭтаФорма,,,,
					Оповещение, 
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
					
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ВыполнитьОперациюНаЭТиНапечататьЧекФР();
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
 // Процедура - Напечатать чек завершение
//
 // Параметры:
 // Результат	 - 	 - 
 // ДопПараметры - 	 - 
//      
Процедура НапечататьЧекЗавершение(Результат, ДопПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ВыполнитьОперациюНаЭТиНапечататьЧекФР(Результат);
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
// Процедура - Напечатать чек обработка
// Завершение процедуры Напечатать чек ответ.
//
Процедура ВыполнитьОперациюНаЭТиНапечататьЧекФР(ДопПараметры = Неопределено)
	
	Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
		ПечататьЧек		= ?(ДопПараметры.Свойство("Печать"), ДопПараметры.Печать		  , Ложь);
		ПочтаКлиента	= ?(ДопПараметры.Свойство("ПокупательEmail"), ДопПараметры.ПокупательEmail, Неопределено);
		ТелефонКлиента	= ?(ДопПараметры.Свойство("ПокупательНомер"), ДопПараметры.ПокупательНомер, Неопределено);
	Иначе
		ПечататьЧек		= Истина;
		ПочтаКлиента	= Неопределено;
		ТелефонКлиента	= Неопределено;
	КонецЕсли;

	ДанныеЭквайринга = Неопределено;
	
	Если Не ЗначениеЗаполнено(Объект.НомерВходящегоДокумента)
		И ВыполнятьОперациюНаЭТ(Объект.ТипДенежныхСредств, Объект.ВидОперации, Объект.Касса, Объект.ЭквайрингТерминал) = Истина Тогда		
		ОписаниеОшибки = "";
		ДанныеЭквайринга = ВыполнитьОперациюНаЭТ(ОписаниеОшибки);
		Если НЕ ЗначениеЗаполнено(ДанныеЭквайринга) ИЛИ ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			Возврат;
		КонецЕсли; 	
	КонецЕсли;	    
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоступлениеИзКассыПредприятия") Тогда
		
		СтатусФР = РозничныеПродажи.ПроверитьИспользованиеФРвКассе(Объект.Касса);		
		
		Если СтатусФР Тогда
			
			// 2. Выполняем команду поступления денег на ФР 
			ДокументОснование = Новый Массив;
			ДокументОснование.Добавить(Объект.Ссылка);			
			ИдентификаторУстройстваФР = МенеджерОборудованияВызовСервера.ПолучитьИдентификаторФискальногоРегистратораДляКассы(Объект.Касса);
			ПараметрыОперации = Новый Структура("ТипИнкассации, Сумма, ДокументОснование, Документ, Касса, Сотрудник",
			1, Объект.СуммаДокумента, ДокументОснование, Объект.Ссылка, Объект.Касса, Объект.АвторДокумента);
			ОповещениеПриЗавершении = Новый ОписаниеОповещения("ИнкассацияНаФискальномУстройствеЗавершение", ЭтотОбъект);
			МенеджерОборудованияКлиент.НачатьИнкассациюНаФискальномУстройстве(
			ОповещениеПриЗавершении, 
			УникальныйИдентификатор, 
			ПараметрыОперации, 
			ИдентификаторУстройстваФР);			
			
		КонецЕсли;	
		
	Иначе
		
		Если ИспользоватьСтаруюСистемуФормированияДляФРдляККТ(Объект.Касса) = Ложь Тогда
			ФормированиеЧека = ПодготовитьПараметрыЧекаДляККТ(ПочтаКлиента, ТелефонКлиента, ПечататьЧек);  		
		Иначе
			ФормированиеЧека = ПодготовитьПараметрыЧекаДляФР(ПочтаКлиента, ТелефонКлиента, ПечататьЧек); 
		КонецЕсли;
		
		Если ФормированиеЧека.Результат Тогда
			
			ИдентификаторУстройстваФР = МенеджерОборудованияВызовСервера.ПолучитьИдентификаторФискальногоРегистратораДляКассы(Объект.Касса);
			
			Если ФормированиеЧека.Свойство("ФискальныйЧек") Тогда		
				
				Контекст = Новый Структура();
				Контекст.Вставить("ТипЧека", Истина);			
				Оповещение            = Новый ОписаниеОповещения("ПробитьЧекЗавершение"            , ЭтотОбъект, Контекст);
				ПослеОткрытияЧека     = Новый ОписаниеОповещения("ПечатьЧека_ПослеОткрытияЧека"    , ЭтотОбъект, Контекст);
				ПослеОшибкиПечатиЧека = Новый ОписаниеОповещения("ПечатьЧека_ПослеОшибкиПечатиЧека", ЭтотОбъект, Контекст);
				
				ОбщиеПараметры = ФормированиеЧека.ФискальныйЧек;
				МенеджерОборудованияКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(Оповещение, УникальныйИдентификатор, ОбщиеПараметры, ИдентификаторУстройстваФР, , ПослеОткрытияЧека, ПослеОшибкиПечатиЧека);		
				
			КонецЕсли;			
			
			Если ФормированиеЧека.Свойство("НефискальныйЧек") Тогда
				
				ТекстЧека  = ФормированиеЧека.НефискальныйЧек;
				Контекст   = Новый Структура();
				Контекст.Вставить("ТипЧека", Ложь);
				Оповещение = Новый ОписаниеОповещения("ПробитьЧекЗавершение", ЭтотОбъект, Контекст);
				МенеджерОборудованияКлиент.НачатьПечатьТекста(Оповещение, УникальныйИдентификатор, ТекстЧека, ИдентификаторУстройстваФР);
				
			КонецЕсли;		
			
		Иначе
			
			ОписаниеОшибки = ФормированиеЧека.ОписаниеОшибки;
			ТекстСообщения = НСтр("ru='При проведение оплаты произошла ошибка.
			|Дополнительное описание: %ДополнительноеОписание%';
			|en='With holding payment happened mistake.
			|Additional description: %ДополнительноеОписание%'");
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);			
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НомерФискальногоЧека)
			ИЛИ ЗначениеЗаполнено(НомерНефискальногоЧека) Тогда
			
			Объект.НомерЧекаККМ = ?(ЗначениеЗаполнено(НомерФискальногоЧека), НомерФискальногоЧека, НомерНеФискальногоЧека);
			
			Если ЗначениеЗаполнено(НомерВходящегоДокумента) Тогда
				Объект.НомерВходящегоДокумента = НомерВходящегоДокумента;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеЭквайринга) 
				И ТипЗнч(ДанныеЭквайринга) = Тип("Структура") Тогда
				
				Объект.ЭквайрингСсылочныйНомер      = ДанныеЭквайринга.СсылочныйНомер;
				Объект.ЭквайрингКодАвторизации      = ДанныеЭквайринга.КодАвторизации;
				Объект.ЭквайрингНомерЧека           = ДанныеЭквайринга.НомерЧека;
				Объект.ЭквайрингНомерПлатежнойКарты = ДанныеЭквайринга.НомерКарты;
				
			КонецЕсли;  			
			
			// перезаписываем кассовую смену по факту пробития на ФР.
			Попытка
				Объект.КассоваяСмена = РозничныеПродажи.ПолучитьТекущуюОткрытуюКассовуюСмену(Объект.Касса);
			Исключение
			КонецПопытки;
			
			ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));	
			
			УстановитьВидимость();
			
		КонецЕсли; 
	КонецЕсли;
		
КонецПроцедуры	

&НаКлиенте
// Процедура - Выполинть операцию на ЭТ
//
Функция ВыполнитьОперациюНаЭТ(ОписаниеОшибки)
	
	//ЭТКассы = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.Касса, "ЭквайринговыйТерминал");
	ФРКассы = ПолучитьСсылкиНаОборудованиеФР();
		
	Возврат МенеджерОборудованияКлиент.ВыполнитьПоступлениеПлатежаЭквайринг(Объект.ЭквайрингТерминал, ФРКассы, ЭтаФорма.УникальныйИдентификатор, Объект.СуммаДокумента, ОписаниеОшибки);
	
КонецФункции  

&НаСервереБезКонтекста
// Функция - Выполнять операцию на ЭТ
//
// Параметры:
//  ТипДенежныхСредств	 - 	 - 
//  ВидОперации			 - 	 - 
//  Касса				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВыполнятьОперациюНаЭТ(ТипДенежныхСредств, ВидОперации, Касса, ТекущийЭТ)
	
	Разрешено = Ложь;
	Если ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта
		И (ВидОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента
		ИЛИ ВидОперации = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет) Тогда 
		
		//ЭТКассы = Справочники.ЭквайринговыеТерминалы.ПолучитьЭквайринговыйТерминалПоУмолчанию(Касса);
		Если ЗначениеЗаполнено(ТекущийЭТ) 
			И ЗначениеЗаполнено(ТекущийЭТ.ПодключаемоеОборудование)
			И ТекущийЭТ.ИспользоватьБезПодключенияОборудования = Ложь Тогда

			Разрешено = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Разрешено;
	
КонецФункции

&НаКлиенте
// Процедура, завершение пробития чека на ФР.
//
Процедура ПробитьЧекЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда		
		// Установить полученное значение номера чека реквизиту документа.
		Если РезультатВыполнения.ВыходныеПараметры <> Неопределено Тогда
			// Объект.НомерСменыККМ = РезультатВыполнения.ВыходныеПараметры[0];
			Если Параметры.ТипЧека Тогда
				  			
				НомерФискальногоЧека = РезультатВыполнения.ВыходныеПараметры[1];
				// ПодключенаКассаLifePay = ПодключенаКассаLifePay(Объект.Касса);
				// Если ПодключенаКассаLifePay = Истина Тогда
				//	НомерВходящегоДокумента = РезультатВыполнения.ВыходныеПараметры[7];
				// ИначеЕсли ПодключенаКассаCloudKassir(Объект.Касса) Тогда
				//	НомерВходящегоДокумента = РезультатВыполнения.ВыходныеПараметры[7];
				// ИначеЕсли ОбщегоНазначения.ПодключенаКассаЭвотор(Объект.Касса) Тогда
				//	НомерФискализацииЭвотор = РезультатВыполнения.ВыходныеПараметры[7];
				// КонецЕсли;  
				
				// запись номера с префиксом (для Топ Стречинга)
				// СтруктураДанныхПрефикса = ПолучитьПризнакЗаписыватьНомерЧекаСПрефиксомВНомерВходящегоДокумента(Объект.Касса); 
				// Если СтруктураДанныхПрефикса.ЗаписыватьНомерЧекаСПрефиксомВНомерВходящегоДокумента Тогда // и Префикс <> ""   					
				//	Объект.НомерВходящегоДокумента = "" + СтруктураДанныхПрефикса.Префикс + "" + НомерФискальногоЧека; 
				// КонецЕсли; 
				// ----------------------------------------------
				
				// Если ФискальныеОперации не был записан - произошла ошибка при записи.
				Если РезультатВыполнения.ВыходныеПараметры.Количество() > 8 Тогда
					ПараметрыФискализации = РезультатВыполнения.ВыходныеПараметры[8];
					Если НЕ ПараметрыФискализации.ОперацияЗаписана Тогда
						МенеджерОборудованияВызовСервера.ЗаписатьФискальнуюОперацию(ПараметрыФискализации);
					КонецЕсли;
					Если НЕ ПустаяСтрока(ПараметрыФискализации.ЧекКоррекцииСторно)
						И НЕ ПараметрыФискализации.ЧекКоррекцииСторно.ОперацияЗаписана Тогда
						МенеджерОборудованияВызовСервера.ЗаписатьФискальнуюОперацию(ПараметрыФискализации.ЧекКоррекцииСторно);
					КонецЕсли;
					Если ОбщегоНазначения.ПолучитьЗначениеКонстанты("КассовыйСерверИспользуется") = Истина Тогда
						ЗаписатьПризнакПробитияЧекаВОчередиКассовогоСервера(Объект.Ссылка, ПараметрыФискализации.НомерЧекаККТ)
					КонецЕсли;
				КонецЕсли;       

			Иначе
				НомерНефискальногоЧека = РезультатВыполнения.ВыходныеПараметры[1];
			КонецЕсли;			
		КонецЕсли;
		
	Иначе 		
		ТекстСообщения = НСтр("ru='При печати чека произошла ошибка.
		|Чек не напечатан на фискальном регистраторе.
		|Дополнительное описание:
		|%ДополнительноеОписание%';
		|en='With print check happened mistake.
		|Check not printedby on fiscal registrar.
		|Additional description:
		|%ДополнительноеОписание%'");
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);                                         		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик описания оповещения.
//
Процедура ПечатьЧека_ПослеОткрытияЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	ШапкаЧека = ПараметрыВыполнения.ВходныеПараметры;
	
	Если ПараметрыВыполнения.НомерСмены <> 0 Тогда
		ШапкаЧека.НомерСмены = ПараметрыВыполнения.НомерСмены;
	КонецЕсли;
	
	Если ПараметрыВыполнения.НомерЧека <> 0 Тогда
		ШапкаЧека.НомерЧека = ПараметрыВыполнения.НомерЧека;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ПараметрыВыполнения.ОповещениеПродолжения, ПараметрыВыполнения);
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ПечатьЧека_ПослеОшибкиПечатиЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт

	ШапкаЧека = ПараметрыВыполнения.ВходныеПараметры;
	ШапкаЧека.НомерЧека = ШапкаЧека.НомерЧека + 1000000;

КонецПроцедуры
	
&НаСервереБезКонтекста
 // Функция - Использовать старую систему формирования для ф рдля ККТ
 //
 // Возвращаемое значение:
 //  - 
 //
Функция ИспользоватьСтаруюСистемуФормированияДляФРдляККТ(Касса)	
	
	Возврат Справочники.Кассы.ИспользоватьСтаруюСистемуФормированияДляФРдляККТ(Касса);	
	
КонецФункции

&НаСервере
// Функция - подготавливает параметры чека ККТ.
//
Функция ПодготовитьПараметрыЧекаДляККТ(ПочтаКлиента, ТелефонКлиента, ПечататьЧек)
		
	МассивДокументовОплаты = Новый Массив;
	МассивДокументовОплаты.Добавить(Объект.Ссылка);
	Для Каждого СтрокаТЧ Из Объект.РасшифровкаПлатежа Цикл
		Если СтрокаТЧ.Сумма <> 0 И ЗначениеЗаполнено(СтрокаТЧ.ДокументОснования) Тогда
			МассивДокументовОплаты.Добавить(СтрокаТЧ.ДокументОснования);
		КонецЕсли;
	КонецЦикла;

	ПараметрыЧека = МенеджерОборудованияВызовСервера.ПустаяСтруктураПараметровЧека();
	
	ОперацияАванса = Ложь;
	Для Каждого СтрокаТЧ Из Объект.РасшифровкаПлатежа Цикл
		Если СтрокаТЧ.ЭтоАванс
			Или СтрокаТЧ.Статья = Справочники.СтатьиДоходовИРасходов.ВзносАвансаОтКлиента
			Или СтрокаТЧ.Статья = Справочники.СтатьиДоходовИРасходов.ВзносНалицевойСчет Тогда
			
			ОперацияАванса = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыЧека.ВидОперации             = ?(ОперацияАванса, Перечисления.ВидыОпераций.ВзносНаЛицевойСчет, Перечисления.ВидыОпераций.Продажа);
	ПараметрыЧека.СтруктурнаяЕдиница      = Объект.СтруктурнаяЕдиница;
	ПараметрыЧека.Организация             = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.СтруктурнаяЕдиница, "Организация");
	ПараметрыЧека.Сотрудник               = Объект.Сотрудник;
	ПараметрыЧека.Клиент                  = Объект.Контрагент;
	ПараметрыЧека.Дата                    = ТекущаяДатаСеанса();
	ПараметрыЧека.Касса                   = Объект.Касса;
	ПараметрыЧека.Количество              = 1;		
	ПараметрыЧека.СуммаОплачено           = Объект.СуммаДокумента;
	ПараметрыЧека.ВидНалога               = ВидНалога; 
	ПараметрыЧека.ТипЧека                 = 0;
	ПараметрыЧека.ВыводитьЧекНаБумагу     = ПечататьЧек;
	ПараметрыЧека.ЭлектроннаяПочтаКлиента = ПочтаКлиента;
	ПараметрыЧека.НомерТелефонаКлиента    = ТелефонКлиента;
	
	ПараметрыЧека.МассивПараметровТовары  = ПолучитьМассивТоваровФискальногоЧекаОплатыПродажиДляККТ();	
	ПараметрыЧека.МассивПараметровОплаты  = ПолучитьМассивОплатФискальногоЧекаОплатыПродажи();	
	
	СуммаКОплатеПоТаблицеТоваров = 0;
	Для Каждого ЭлементМ Из ПараметрыЧека.МассивПараметровТовары Цикл
		СуммаКОплатеПоТаблицеТоваров = СуммаКОплатеПоТаблицеТоваров + ЭлементМ.СтоимостьСоСкидкой;
	КонецЦикла;
	
	ПараметрыЧека.СуммаКОплате = СуммаКОплатеПоТаблицеТоваров;  
	
	ПараметрыЧека.МассивДокументовОснований = МассивДокументовОплаты;
	
	ФормированиеЧека = МенеджерОборудованияВызовСервера.ПодготовитьДанныеДляПробитияФискальногоЧекаККТ(ПараметрыЧека);	

	Возврат ФормированиеЧека;

КонецФункции

&НаСервере
// Функция - подготавливает параметры чека ФР.
//
Функция ПодготовитьПараметрыЧекаДляФР(ПочтаКлиента, ТелефонКлиента, ПечататьЧек)
		
	МассивДокументовОплаты = Новый Массив;
	МассивДокументовОплаты.Добавить(Объект.Ссылка);
	Для Каждого СтрокаТЧ Из Объект.РасшифровкаПлатежа Цикл
		Если СтрокаТЧ.Сумма <> 0 И ЗначениеЗаполнено(СтрокаТЧ.ДокументОснования) Тогда
			МассивДокументовОплаты.Добавить(СтрокаТЧ.ДокументОснования);
		КонецЕсли;
	КонецЦикла;

	ПараметрыЧека = МенеджерОборудованияВызовСервера.ПустаяСтруктураПараметровЧека();
	
	ПараметрыЧека.ВидОперации             = Перечисления.ВидыОпераций.Продажа;
	ПараметрыЧека.СтруктурнаяЕдиница      = Объект.СтруктурнаяЕдиница;
	ПараметрыЧека.Организация             = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.СтруктурнаяЕдиница, "Организация");
	ПараметрыЧека.Сотрудник               = Объект.Сотрудник;
	ПараметрыЧека.Клиент                  = Объект.Контрагент;
	ПараметрыЧека.Дата                    = ТекущаяДатаСеанса();
	ПараметрыЧека.Касса                   = Объект.Касса;
	ПараметрыЧека.Количество              = 1;		
	ПараметрыЧека.СуммаОплачено           = Объект.СуммаДокумента;
	ПараметрыЧека.СтоимостьБезСкидки      = Объект.СуммаДокумента;		
	ПараметрыЧека.ТипЧека                 = 0;
	
	// ККТ-ые пар-ы
	ПараметрыЧека.ВидНалога               = ВидНалога; 	
	ПараметрыЧека.ВыводитьЧекНаБумагу     = ПечататьЧек;
	ПараметрыЧека.ЭлектроннаяПочтаКлиента = ПочтаКлиента;
	ПараметрыЧека.НомерТелефонаКлиента    = ТелефонКлиента;
	
	ПараметрыЧека.СуммаКОплате 			  = Объект.СуммаДокумента;  
	
	ПараметрыЧека.МассивДокументовОснований = МассивДокументовОплаты;
	
	ФормированиеЧека = МенеджерОборудованияВызовСервера.ПодготовитьДанныеДляПробитияФискальногоЧекаККТ(ПараметрыЧека);	

	Возврат ФормированиеЧека;

КонецФункции

&НаСервере
// Функция возвращает массив товаров для ККТ.
//
Функция ПолучитьМассивТоваровФискальногоЧекаОплатыПродажиДляККТ() 
	
	МассивТоваров = Новый Массив;
	Для Каждого СтрокаТЧ Из Объект.РасшифровкаПлатежа Цикл
		Если СтрокаТЧ.ЭтоАванс
			Или СтрокаТЧ.Статья = Справочники.СтатьиДоходовИРасходов.ВзносАвансаОтКлиента
			Или СтрокаТЧ.Статья = Справочники.СтатьиДоходовИРасходов.ВзносНалицевойСчет Тогда
			
			МассивТоваров.Добавить(СформироватьПозициюАвансаЧека(СтрокаТЧ.Статья, СтрокаТЧ.Сумма));
		Иначе			
			МассивТоваровДокумента = ПолучитьМассивПараметровТовары(СтрокаТЧ.ДокументОснования, СтрокаТЧ.Сумма);
			ОбщегоНазначенияСтоматология.ДобавитьВМассив(МассивТоваров, МассивТоваровДокумента);																			
		КонецЕсли;		
	КонецЦикла; 

	Возврат МассивТоваров;
	
КонецФункции

&НаСервере
// Функция - Получить массив оплат на печать
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивОплатФискальногоЧекаОплатыПродажи()
	
	МассивОплат = Новый Массив;		
	
	ПараметрыТипаОплаты = МенеджерОборудованияВызовСервера.ПустаяСтруктураСтрокиПлатежаЧека();
	ПараметрыТипаОплаты.ТипОплаты = Объект.ТипДенежныхСредств;
	ПараметрыТипаОплаты.Сумма     = Объект.СуммаДокумента;
	
	МассивОплат.Добавить(ПараметрыТипаОплаты);	
	
	Возврат МассивОплат;
	
КонецФункции

&НаСервере
// Функция, возвращает сформированную строку чека.
//
Функция СформироватьПозициюАвансаЧека(Статья, Сумма)
	
	НомерСекции = 2;  	
	Наименование = ?(Статья = Справочники.СтатьиДоходовИРасходов.ВзносНаЛицевойСчет,
					НСтр("ru = 'Взнос на лицевой счет:'"), НСтр("ru = 'Взнос Аванса:'"));
								
	ПозицияЧека = МенеджерОборудованияВызовСервера.ПустаяСтруктураСтрокиТоваровЧека();
	
	ПозицияЧека.Наименование		= Наименование + " " + Объект.Контрагент;
	ПозицияЧека.Количество			= 1; 
	ПозицияЧека.СтоимостьБезСкидки  = Сумма;
	ПозицияЧека.СуммаСкидки         = 0;
	ПозицияЧека.СтоимостьСоСкидкой	= Сумма;	
	ПозицияЧека.СтавкаНДС 			= МенеджерОборудованияВызовСервера.ПолучитьНДСПриВзносеНаЛицевойСчет(Объект.СтруктурнаяЕдиница.Организация);
	ПозицияЧека.СуммаНДС     		= Ценообразование.РассчитатьСуммуНДС(Сумма, ПозицияЧека.СтавкаНДС);
	ПозицияЧека.НомерСекции 		= НомерСекции;
	ПозицияЧека.Штрихкод 			= null;
	ПозицияЧека.СуммаОплачено       = ?(ПозицияЧека.СтоимостьСоСкидкой > Сумма, Сумма, ПозицияЧека.СтоимостьСоСкидкой);
	ПозицияЧека.ЭтоОплатаКредита    = Ложь;

	Возврат ПозицияЧека;	
	
КонецФункции

&НаСервере
// Функция - возвращает массив параметров товаров.
//
Функция ПолучитьМассивПараметровТовары(ДокументОснования, Сумма)
	
	ОплаченоПоДокументу = 0;
	Если ЗначениеЗаполнено(ДокументОснования) Тогда
		Если ТипЗнч(ДокументОснования) = Тип("ДокументСсылка.НарядЗаказ") Тогда
			ОплаченоПоДокументу = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ДокументОснования, "СуммаОплаченоПродажи") - Сумма;
		ИначеЕсли ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("СуммаОплачено", ДокументОснования.Метаданные()) = Истина Тогда 
			ОплаченоПоДокументу = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ДокументОснования, "СуммаОплачено") - Сумма;
		КонецЕсли;
	КонецЕсли;
	
	МассивТоваровДокумента = Обработки.ПомощникПроведенияОплаты.ПолучитьМассивПараметровТоваровККТ(
																	ДокументОснования,
																	ОплаченоПоДокументу,
																	Сумма,
																	Объект.Касса);
																	
	Возврат МассивТоваровДокумента;
		
КонецФункции

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

&НаСервереБезКонтекста  
// Функция, Получить данные даты при изменении.
//
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	РазностьДат = ДвиженияДокументовСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением);
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", РазностьДат);
			
	Возврат СтруктураДанные;
	
КонецФункции  

&НаКлиенте
// Процедура - Договор начало выбора завершение
//
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
// 
Процедура ДоговорНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.Договор = Результат;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура НастройкаШириныЭлементовФормы()
	
	Если Объект.ВидОперации = Перечисления.ВидыОпераций.ПоступлениеОтЭквайера Тогда
		
		Элементы.КоманднаяПанельЗаглушкаВыравнивание.МаксимальнаяШирина = 71;
		Элементы.ДекорацияОповещениеБлокировки.МаксимальнаяШирина		= 118;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ОплатаОтСтраховойКомпании Тогда
		
		Элементы.КоманднаяПанельЗаглушкаВыравнивание.МаксимальнаяШирина = 69;
		Элементы.ДекорацияОповещениеБлокировки.МаксимальнаяШирина		= 116;
	Иначе
		Элементы.КоманднаяПанельЗаглушкаВыравнивание.МаксимальнаяШирина = 65;
		Элементы.ДекорацияОповещениеБлокировки.МаксимальнаяШирина 		= 114;
	КонецЕсли;
	
	Элементы.Статья.МаксимальнаяШирина = ?(Элементы.ВТаблице.Видимость, 34, 46);
	
КонецПроцедуры

&НаКлиенте
// Процедура, команда добавления динамической строки расшифровки платежа.
//
Процедура ДобавитьСтрокуРасшифровки(Команда)
	
	НоваяСтрока = Объект.РасшифровкаПлатежа.Добавить();
	// НоваяСтрока.КлючСтроки	 = Новый УникальныйИдентификатор;
	
	СоздатьСтрокуЭлементовРасшифровки(Объект.РасшифровкаПлатежа.Количество() - 1);
	
КонецПроцедуры

&НаКлиенте
// Процедура, команда удаления динамической строки расшифровки платежа.
//
Процедура УдалитьСтрокуРасшифровки(Команда)
	
	ИндексСтроки = ПолучитьИндексСтроки(ЭтаФорма.ТекущийЭлемент.Имя);
	УдалитьЭлементыРасшифровкиПлатежа(ИндексСтроки);
	
	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
		ДобавитьСтрокуРасшифровки(Неопределено);
	КонецЕсли;
	
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("Сумма");
	
КонецПроцедуры

&НаСервере
// Получает ссылки на внешнее оборудование.
//
Функция ПолучитьСсылкиНаОборудованиеФР()
	
	Возврат ?(ЗначениеЗаполнено(Объект.Касса) И ЗначениеЗаполнено(Объект.Касса.ВнешнееОборудование),
				Объект.Касса.ВнешнееОборудование.Ссылка,
				Справочники.ПодключаемоеОборудование.ПустаяСсылка());
	
КонецФункции // ПолучитьСсылкиНаОборудование

&НаСервере
// Процедура - устанавливает видимость реквизитов в зависимости от хозяйственной операции.
//
Процедура УстановитьВидимость()
	
	// ЭтаФорма.ТолькоПросмотр = ЗначениеЗаполнено(Объект.НомерЧекаККМ); 
	// Элементы.ГруппаБлокировкаДокумента.Видимость =  ЗначениеЗаполнено(Объект.НомерЧекаККМ);
	
	// Установка первой части заголовка по типу операции
	Если Объект.ВидОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента Тогда
		ЭтаФорма.Заголовок = "Оплата от пациента";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет Тогда
		ЭтаФорма.Заголовок = "Взнос на лицевой счет";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыОтПоставщика Тогда
		ЭтаФорма.Заголовок = "Возврат от поставщика";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ПоступлениеИзБанка Тогда
		ЭтаФорма.Заголовок = "Поступление из банка";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ПоступлениеИзКассы Тогда
		ЭтаФорма.Заголовок = "Поступление из кассы";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОтПодотчетника Тогда
		ЭтаФорма.Заголовок = "Возврат от подотчетника";		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыКлиенту Тогда
		ЭтаФорма.Заголовок = "Возврат оплаты клиенту";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ОплатаОтСтраховойКомпании Тогда		
		ЭтаФорма.Заголовок = "Оплата от страховой компании";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратНалога Тогда		
		ЭтаФорма.Заголовок = "Возврат налога";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ПоступлениеОтЭквайера Тогда
		ЭтаФорма.Заголовок = "Поступление от эквайера";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратЗайма Тогда
		ЭтаФорма.Заголовок = "Получение, возврат займа";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ВводОстатков Тогда		
		ЭтаФорма.Заголовок = "Ввод начальных остатков";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратЗайма Тогда		
		ЭтаФорма.Заголовок = "Получение, возврат займа";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ВзносУчредителя Тогда		
		ЭтаФорма.Заголовок = "Взнос учредителя";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратЗаработнойПлаты Тогда	
		ЭтаФорма.Заголовок = "Возврат заработной платы";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ПрочееПоступление Тогда	
		ЭтаФорма.Заголовок = "Прочее поступление";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ПоступлениеРозничнойВыручкиИзОперационнойКассы Тогда
		ЭтаФорма.Заголовок = "Поступление розничной выручки из операционной кассы";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ПоступлениеИзКассыПредприятия Тогда
		ЭтаФорма.Заголовок = "Поступление из кассы предприятия";
	КонецЕсли;
	
	// Изменение состава списка выбора операции и установка втрой части заголовка по виду денежных средств
	Элементы.ВидОперации.СписокВыбора.Очистить();
	Если Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда		
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ОплатаОтКлиента);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВзносНаЛицевойСчет);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ПоступлениеИзБанка);
        Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВозвратОплатыОтПоставщика);
        Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВозвратОтПодотчетника);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ОплатаОтСтраховойКомпании);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВозвратЗайма);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВозвратЗаработнойПлаты);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВводОстатков);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВзносУчредителя);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ПрочееПоступление);		
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ПоступлениеРозничнойВыручкиИзОперационнойКассы);		
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ПоступлениеИзКассыПредприятия);		
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " наличными средствами";		
	ИначеЕсли Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные Тогда	
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ОплатаОтКлиента);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВзносНаЛицевойСчет);
        Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВозвратОплатыОтПоставщика);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ОплатаОтСтраховойКомпании);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ПоступлениеОтЭквайера);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВозвратНалога);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВозвратЗайма);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВозвратЗаработнойПлаты);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВводОстатков);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВзносУчредителя);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ПоступлениеИзКассы);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ПрочееПоступление);
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " безналичными средствами";
	ИначеЕсли Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта Тогда		
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ОплатаОтКлиента);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВзносНаЛицевойСчет);
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " платежной картой";
	ИначеЕсли Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ЛицевойСчет Тогда	
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВозвратОплатыКлиенту);
        Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ПрочееПоступление);
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " на лицевой счет";
	КонецЕсли;	
	
	ЭтаФорма.ТолькоПросмотр                      = ЭтотОбъект.ЗаблокироватьРедактирование; 	
	Элементы.ГруппаБлокировкаДокумента.Видимость = ЭтотОбъект.ЗаблокироватьРедактирование;
	Элементы.ГруппаОтменаПробития.Видимость      = Ложь;
	Элементы.Очистить_Чек.Доступность 			 = РольДоступна("ПолныеПрава") И Объект.НомерЧекаККМ = 99999999;
	Элементы.Очистить_Чек.Видимость				 = ЭтаФорма.ТолькоПросмотр;
	Элементы.ДекорацияОповещениеБлокировки.МаксимальнаяШирина = 111;
	
	Если (Объект.ВидОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента 
		ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ОплатаОтСтраховойКомпании) Тогда
		
		СуществующийДокСписания = ПолучитьСсылкуДокументаСписанияПоОтменеОшибочнойОплаты(Объект.Ссылка);
		
		Если ЗначениеЗаполнено(СуществующийДокСписания) 
			ИЛИ НачалоДня(Объект.Дата) = НачалоДня(ТекущаяДата()) 
			ИЛИ НЕ ЗначениеЗаполнено(Объект.НомерЧекаККМ) Тогда
			
			Элементы.ГруппаОтменаПробития.Видимость = Истина;
			Элементы.ДекорацияОповещениеБлокировки.МаксимальнаяШирина = 90;
			
			Если НЕ ЗначениеЗаполнено(СуществующийДокСписания) Тогда
				Элементы.ДекорацияОтменаОплаты.Заголовок = НСтр("ru = 'Отменить'; en = 'Cancel'");
			Иначе
				Элементы.ДекорацияОтменаОплаты.Заголовок = НСтр("ru = 'Отменен: '; en = 'Canceled: '") + СуществующийДокСписания;
				Элементы.ДекорацияОповещениеБлокировки.МаксимальнаяШирина = 64;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;

	Если Элементы.ВидОперации.СписокВыбора.НайтиПоЗначению(Объект.ВидОперации) = Неопределено Тогда		
		Объект.ВидОперации = Неопределено;
		ЭтаФорма.Заголовок = "Поступление денежных средств";
		
		СтрокаТаблицыРасшифровки = Элементы.Найти("Основание_0");
		Если НЕ СтрокаТаблицыРасшифровки = Неопределено И Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда
			СтрокаТаблицыРасшифровки.МаксимальнаяШирина = 90;		
		КонецЕсли;
		
	КонецЕсли;	
	Если Объект.Ссылка.Пустая() Тогда
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " (создание)";
	КонецЕсли;		
	Если ЗначениеЗаполнено(Объект.КассоваяСмена) Тогда
		Элементы.КассоваяСменаТекущая.Видимость = Истина;
		мНомер                           = ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Объект.КассоваяСмена.Номер, "");		
		КассоваяСменаТекущая = "Кассовая смена № " + ?(Найти(мНомер, "-") > 0, мНомер, "00"+мНомер) + " от " + Формат(Объект.КассоваяСмена.Дата,"ДФ=dd.MM.yyyy");
	Иначе
		Элементы.КассоваяСменаТекущая.Видимость = Ложь;
	КонецЕсли;
	
	// Установка состояния элементов формы
	УправлениеИнтерфейсамиСервер.УстановкаСостоянийЭлементовФормы(ЭтаФорма,Объект);
	// Установка банковского счета контрагента по умолчанию(при указанных условиях)
	Если Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные
		И НЕ Объект.ВидОперации     = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет	
		И НЕ ЗначениеЗаполнено(Объект.БанковскийСчетКонтрагента) 
		И ЗначениеЗаполнено(Объект.Контрагент) Тогда	
		Объект.БанковскийСчетКонтрагента = Объект.Контрагент.БанковскийСчетПоУмолчанию;
	ИначеЕсли (Объект.ВидОперации = Перечисления.ВидыОпераций.ПоступлениеИзБанка ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ПоступлениеИзКассы)
		И НЕ ЗначениеЗаполнено(Объект.БанковскийСчетКонтрагента) Тогда
		Объект.БанковскийСчетКонтрагента = Объект.СтруктурнаяЕдиница.Организация.БанковскийСчетПоУмолчанию;
	КонецЕсли;    
	Если Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные
		И НЕ ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда	
		Объект.БанковскийСчет = Объект.СтруктурнаяЕдиница.Организация.БанковскийСчетПоУмолчанию;
	КонецЕсли; 	
	Элементы.РасшифровкаПлатежаСтатья.Видимость = Объект.СтатьяВТаблице;

	УстановитьДоступностьПечатиЧека();
	ОбновитьИнформациюПоОстаткамЛСиЗадолженностям();
	Если ЗначениеЗаполнено(Объект.НомерЧекаККМ) Тогда
		Элементы.СтруктурнаяЕдиница.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ОбновитьОтображениеРасшифровки();
	Элементы.Договор.Видимость = ЗначениеЗаполнено(Объект.Контрагент) 
		И ?(ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Контрагенты") 
		И Объект.Контрагент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты, Ложь, Истина);  
		
	Если ВыполнятьОперациюНаЭТ(Объект.ТипДенежныхСредств, Объект.ВидОперации, Объект.Касса, Объект.ЭквайрингТерминал) = Истина Тогда
		Элементы.НапечататьЧек.Заголовок = Нстр("ru = 'Пробить на ФР и ЭТ'; en = 'Punch on FR and AT'");
	Иначе
		Элементы.НапечататьЧек.Заголовок = Нстр("ru = 'Пробить на ФР'; en = 'Punch on FR'");
	КонецЕсли;
		
КонецПроцедуры 

&НаСервере
// Процедура - устанавливает доступность кнопки "НапечататьЧек".
//
Процедура УстановитьДоступностьПечатиЧека()
	
	Разрешено = Ложь;
	ТекстОшибки   = "";
	Если НЕ ЗначениеЗаполнено(Объект.НомерЧекаККМ) Тогда
		Если Объект.ВидОперации  = Перечисления.ВидыОпераций.ОплатаОтКлиента
		 ИЛИ Объект.ВидОперации  = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет
		 ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ПоступлениеИзКассыПредприятия
		 ИЛИ (Объект.ВидОперации  = Перечисления.ВидыОпераций.ОплатаОтСтраховойКомпании
		   И (Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные  
		 ИЛИ  Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта)) Тогда
			Разрешено = Истина;
		ИначеЕсли Объект.ВидОперации  = Перечисления.ВидыОпераций.ВозвратОплатыКлиенту Тогда		
			Разрешено = Ложь;
			Для Каждого СтрокаТЧ ИЗ Объект.РасшифровкаПлатежа Цикл			
				Если ЗначениеЗаполнено(СтрокаТЧ.ДокументОснования) И НЕ НачалоДня(СтрокаТЧ.ДокументОснования.Дата) = НачалоДня(Объект.Дата) Тогда
					Разрешено = Ложь;
					Прервать;
				Иначе
					Разрешено = Истина;
				КонецЕсли;	
			КонецЦикла;
		Иначе
			Разрешено = Ложь;
		КонецЕсли;     
	КонецЕсли;
	
	Если Разрешено Тогда
		
		РозничныеПродажи.СменаОткрыта(Объект.КассоваяСмена, ТекущаяДата(), ТекстОшибки);

		Если ((СокрЛП(ТекстОшибки) = "Кассовая смена закрыта") ИЛИ (СокрЛП(ТекстОшибки) = "Кассовая смена не открыта")) ИЛИ (Лев(ТекстОшибки, 33) = "С момента открытия кассовой смены") Тогда
			Разрешено = Ложь;	
		КонецЕсли;	

	КонецЕсли;
	
	Элементы.НапечататьЧек.Доступность = Разрешено;

КонецПроцедуры 

&НаСервереБезконтекста
// Функция вернет предопределенную статью для данного вида операции
Функция ПолучитьПредопределеннуюСтатьюДляОперации(ВидОперации,ЭтоАванс)
	Возврат Справочники.СтатьиДоходовИРасходов.ПолучитьСтатьюПоУмолчаниюДляОперации(ВидОперации,ЭтоАванс);	
КонецФункции

&НаСервереБезКонтекста
// Функция проверяет использует ли касса ККТ.
//
Функция КассаИспользуетсяККТ(Касса)
	
	Возврат Справочники.Кассы.КассаИспользуетсяККТ(Касса);
		
КонецФункции

&НаСервереБезконтекста
// Функция, возвращает признак ККТ
//
Функция ОпределитьТипОборудования(Касса)
	
	Возврат Касса.ВнешнееОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;	
	
КонецФункции

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура РасшифровкаПлатежаПриИзменении(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура СтруктурнаяЕдиницаПриИзменении(Элемент)
	
	ОбновитьИнформациюПоОстаткамЛСиЗадолженностям();
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "АвтоПодбор"
//
Процедура СтруктурнаяЕдиницаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьДоступныеСтруктурныеЕдиницы(Текст);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция возвращает доступные структурные единицы
//
Функция ПолучитьДоступныеСтруктурныеЕдиницы(СтрокаПоиска)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	СтруктурныеЕдиницы.Ссылка В(&МассивСсылок)
	|	И &УсловиеСтрокаПоиска");
	
	Запрос.УстановитьПараметр("МассивСсылок", ОбщегоНазначенияСтоматология.ДоступныеСтруктурныеЕдиницы());
	Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СтрокаПоиска + "%");
	
	УсловиеСтрокаПоиска = ?(СтрДлина(СтрокаПоиска) >= 2, "И СтруктурныеЕдиницы.Наименование ПОДОБНО &СтрокаПоиска", "");
	Запрос.Текст		= СтрЗаменить(Запрос.Текст, "И &УсловиеСтрокаПоиска", УсловиеСтрокаПоиска);
	
    МассивСтруктурныхЕдиниц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
    
    СписокСтруктурныхЕдиниц = Новый СписокЗначений;
    СписокСтруктурныхЕдиниц.ЗагрузитьЗначения(МассивСтруктурныхЕдиниц);
	
	Возврат СписокСтруктурныхЕдиниц;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора".
//
Процедура СтруктурнаяЕдиницаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЭтоПользователь"			   , Истина);
	СтруктураПараметров.Вставить("Ссылка"					   , ОбщегоНазначенияСтоматология.ДоступныеСтруктурныеЕдиницы()); 
	СтруктураПараметров.Вставить("ВидСравненияКомпоновкиДанных", ВидСравненияКомпоновкиДанных.ВСписке);
	
	ОткрытьФорму("Справочник.СтруктурныеЕдиницы.ФормаВыбора", СтруктураПараметров, Элементы.СтруктурнаяЕдиница);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора".
//
Процедура СтруктурнаяЕдиницаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение  <> Объект.СтруктурнаяЕдиница Тогда
		
		Объект.Касса 			  = Неопределено;
		Объект.БанковскийСчет 	  = Неопределено;
		Объект.ЭквайрингТерминал  = Неопределено;
		Объект.СтруктурнаяЕдиница = ВыбранноеЗначение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, создает строку элементов расшифровки платежа.
//
Процедура СоздатьСтрокуЭлементовРасшифровки(Индекс)
	
	ИспользоватьАвансы = Константы.УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов.Получить() И Объект.ВидОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента;
	
	ГруппаНовыхЭл                         = Элементы.Добавить("СтрокаРасшифровки_" + Индекс, Тип("ГруппаФормы"), Элементы.ГруппаСтрокиРасшифровки);
	ГруппаНовыхЭл.Вид                     = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаНовыхЭл.Группировка             = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	ГруппаНовыхЭл.Отображение             = ОтображениеОбычнойГруппы.Нет;
	ГруппаНовыхЭл.Ширина				  = 114; //?(Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта, 134, 140);
	ГруппаНовыхЭл.ОтображатьЗаголовок     = Ложь;
	ГруппаНовыхЭл.РастягиватьПоГоризонтали = Неопределено;
	
	ДекорацияНомерСтроки				  = Элементы.Добавить("ДекорацияНомер_" + Индекс, Тип("ДекорацияФормы"), ГруппаНовыхЭл);
	ДекорацияНомерСтроки.Заголовок        = Индекс + 1;
	ДекорацияНомерСтроки.Ширина			  = 2;
	
	ШиринаДопПолей = 0;
	
	Если Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратЗаработнойПлаты Тогда
		
		ПолеСотрудник					  		= Элементы.Добавить("Сотрудник_" + Индекс, Тип("ПолеФормы"), ГруппаНовыхЭл);
		ПолеСотрудник.Вид				 		= ВидПоляФормы.ПолеВвода;
		ПолеСотрудник.РастягиватьПоГоризонтали	= Неопределено;
		ПолеСотрудник.АвтоМаксимальнаяШирина   	= Ложь;
		ПолеСотрудник.Ширина  					= 0;
		ПолеСотрудник.МаксимальнаяШирина  		= 25;
		ПолеСотрудник.ПутьКДанным		  		= "Объект.РасшифровкаПлатежа[" + Индекс +"].Сотрудник";
		ПолеСотрудник.ПоложениеЗаголовка  		= ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеСотрудник.ПодсказкаВвода	  		= "Сотрудник";
		ШиринаДопПолей							= ШиринаДопПолей + ПолеСотрудник.МаксимальнаяШирина; 
		
		Объект.РасшифровкаПлатежа[Индекс].ДокументОснования = Объект.ВозвратВыплатыЗПДокументОснования;
		
	КонецЕсли;	
	
	ПолеДокумент                          = Элементы.Добавить("Основание_" + Индекс, Тип("ПолеФормы"), ГруппаНовыхЭл);
	ПолеДокумент.Вид                      = ВидПоляФормы.ПолеВвода;
	ПолеДокумент.ПоложениеЗаголовка       = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеДокумент.АвтоМаксимальнаяШирина   = Ложь;
	ПолеДокумент.РастягиватьПоГоризонтали = Неопределено;
	ПолеДокумент.ПодсказкаВвода			  = "Основание";
	ПолеДокумент.КнопкаВыпадающегоСписка  = Ложь; 
	ПолеДокумент.КнопкаОткрытия			  = Истина;
	ПолеДокумент.КнопкаВыбора			  = Истина;	
	ПолеДокумент.ИсторияВыбораПриВводе    = ИсторияВыбораПриВводе.НеИспользовать;
	ПолеДокумент.РежимВыбораИзСписка 	  = Ложь;
	ПолеДокумент.ПутьКДанным              = "Объект.РасшифровкаПлатежа[" + Индекс +"].ДокументОснования";
	ПолеДокумент.УстановитьДействие("НачалоВыбора"	 , "РасшифровкаПлатежаЗаказРеализацияНачалоВыбора");
	ПолеДокумент.УстановитьДействие("ОбработкаВыбора", "РасшифровкаПлатежаЗаказРеализацияОбработкаВыбора");
	
	МаксимальнаяШиринаПолеДокумента = ?(Объект.ВидОперации = Перечисления.ВидыОпераций.ПоступлениеОтЭквайера, 97, 90);	
	ПолеДокумент.МаксимальнаяШирина = МаксимальнаяШиринаПолеДокумента;  // МаксимальнаяШирина корректируется ниже!	

		
	Если ИспользоватьАвансы Тогда
		
		ПолеАванс						  		= Элементы.Добавить("ДокументАванса_" + Индекс, Тип("ПолеФормы"), ГруппаНовыхЭл);
		ПолеАванс.Вид					  		= ВидПоляФормы.ПолеВвода;
		ПолеАванс.ПоложениеЗаголовка	  		= ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеАванс.РастягиватьПоГоризонтали		= Неопределено;
		ПолеАванс.Ширина  						= 0;
		ПолеАванс.АвтоМаксимальнаяШирина   		= Ложь;
		ПолеАванс.МаксимальнаяШирина	  		= 25;
		ПолеАванс.ПутьКДанным			  		= "Объект.РасшифровкаПлатежа[" + Индекс +"].ДокументАванса";
		ПолеАванс.ПодсказкаВвода		  		= "Документ аванса";
		// ПолеАванс.УстановитьДействие("ОкончаниеВводаТекста", "РасшифровкаПлатежаДинамическиеОкончаниеВводаТекста");
		ШиринаДопПолей							= ШиринаДопПолей + ПолеАванс.МаксимальнаяШирина;
		
	КонецЕсли;	
	
	Если Объект.СтатьяВТаблице Тогда
		
		ПолеСтатья						  		= Элементы.Добавить("Статья_" + Индекс, Тип("ПолеФормы"), ГруппаНовыхЭл);
		ПолеСтатья.Вид					  		= ВидПоляФормы.ПолеВвода;
		ПолеСтатья.ПутьКДанным			  		= "Объект.РасшифровкаПлатежа[" + Индекс + "].Статья";
		ПолеСтатья.РастягиватьПоГоризонтали		= Неопределено;
		ПолеСтатья.Ширина  						= 0;
		ПолеСтатья.АвтоМаксимальнаяШирина   	= Ложь;
		ПолеСтатья.МаксимальнаяШирина			= 25;
		ПолеСтатья.ПодсказкаВвода		  		= "Статья дохода";
		ПолеСтатья.ПоложениеЗаголовка	  		= ПоложениеЗаголовкаЭлементаФормы.Нет;
		ШиринаДопПолей							= ШиринаДопПолей + ПолеСтатья.МаксимальнаяШирина;
		
		Объект.РасшифровкаПлатежа[Индекс].Статья = Объект.Статья;
		
	Иначе
		
		Объект.РасшифровкаПлатежа[Индекс].Статья = ПолучитьПредопределеннуюСтатьюДляОперации(Объект.ВидОперации, Ложь);
		
	КонецЕсли;
		
	КоррекцияШирины = ШиринаДопПолей / 25;
	ПолеДокумент.МаксимальнаяШирина = ПолеДокумент.МаксимальнаяШирина - ШиринаДопПолей - ?(КоррекцияШирины >= 1, (КоррекцияШирины * 2), 1);
		
	ПолеСумма                      		  = Элементы.Добавить("Сумма_" + Индекс, Тип("ПолеФормы"), ГруппаНовыхЭл);
	ПолеСумма.Вид                  		  = ВидПоляФормы.ПолеВвода;
	ПолеСумма.Ширина					  = 13;
	ПолеСумма.ПоложениеЗаголовка   		  = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеСумма.ПутьКДанным          		  = "Объект.РасшифровкаПлатежа[" + Индекс +"].Сумма";
	ПолеСумма.ПодсказкаВвода			  = "Сумма";
	ПолеСумма.УстановитьДействие("ПриИзменении", "РасшифровкаПлатежаСуммаПриИзменении");
	
	Если ИспользоватьАвансы Тогда
		ПолеСумма.УстановитьДействие("ОкончаниеВводаТекста"		, "РасшифровкаПлатежаДинамическиеОкончаниеВводаТекста");
		// ПолеДокумент.УстановитьДействие("ОкончаниеВводаТекста"	, "РасшифровкаПлатежаДинамическиеОкончаниеВводаТекста");	
	КонецЕсли;
	
	КнопкаУдаления                  	  = Элементы.Добавить("УдалитьСтроку_" + Индекс, Тип("КнопкаФормы"), ГруппаНовыхЭл);
	КнопкаУдаления.Отображение     	      = ОтображениеКнопки.Картинка;
	КнопкаУдаления.Картинка				  = БиблиотекаКартинок.ОчиститьДанные;
	КнопкаУдаления.ОтображениеФигуры 	  = ОтображениеФигурыКнопки.Нет;
	КнопкаУдаления.ИмяКоманды      	      = "УдалитьСтрокуРасшифровки";
	
КонецПроцедуры

&НаСервере
// Процедура, создает динамические элементы расшифровки платежа.
//
Процедура СоздатьЭлементыРасшифровкиПлатежа()
	
	ОчиститьЭлементыРасшифровки();
	Индекс = 0;
	Для Каждого СтрокаТЧ Из Объект.РасшифровкаПлатежа Цикл
		
		СоздатьСтрокуЭлементовРасшифровки(Индекс);
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
		НоваяСтрока = Объект.РасшифровкаПлатежа.Добавить();	
		СоздатьСтрокуЭлементовРасшифровки(0);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, удаляет динамическую строку расшифровки платежа.
//
Процедура УдалитьЭлементыРасшифровкиПлатежа(ИндексСтроки)
	
	СтрокаДанных = Объект.РасшифровкаПлатежа[ИндексСтроки];	
	
	Если СтрокаДанных <> Неопределено Тогда 		
		
		Индекс = 0;
		Для Каждого СтрокаТЧ Из Объект.РасшифровкаПлатежа Цикл
			Если Элементы.Найти("СтрокаРасшифровки_" + Индекс) <> Неопределено Тогда
				Элементы.Удалить(Элементы["СтрокаРасшифровки_" + Индекс]);	
			КонецЕсли;
			Индекс = Индекс + 1;              
		КонецЦикла;				
		Объект.РасшифровкаПлатежа.Удалить(СтрокаДанных);		
		СоздатьЭлементыРасшифровкиПлатежа();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Процедура, удаляет динамически созданные элементы расшифровки платежа.
//
Процедура ОчиститьЭлементыРасшифровки()
	
	Количество = Элементы.ГруппаСтрокиРасшифровки.ПодчиненныеЭлементы.Количество();
	Если Количество = 0 Тогда Возврат;
	КонецЕсли;
	
	Для Индекс = 0 По Количество - 1 Цикл
		Элементы.Удалить(Элементы.Найти("СтрокаРасшифровки_" + Индекс));
	КонецЦикла;	
		
КонецПроцедуры

&НаСервере
// Процедура, устанавливает видимость элементов в зависимости от вида операции.
//
Процедура ОбновитьОтображениеРасшифровки()
	
	ВидыОпераций = Перечисления.ВидыОпераций;
	
	Если Объект.ВидОперации = ВидыОпераций.ВзносНаЛицевойСчет Или Объект.ВидОперации = ВидыОпераций.ПоступлениеИзБанка
		Или Объект.ВидОперации = ВидыОпераций.ВозвратЗайма Или Объект.ВидОперации = ВидыОпераций.ВводОстатков
		Или Объект.ВидОперации = ВидыОпераций.ВзносУчредителя Или Объект.ВидОперации = ВидыОпераций.ПрочееПоступление Тогда
		
		Элементы.ГруппаРасшифровкаПлатежа.Видимость			 = Ложь;
		Элементы.ГруппаРасшифровкаДинамические.Видимость = Ложь;
		
		Элементы.ГруппаРасшифровка.Видимость   = Ложь;
		Элементы.ГруппаДополнительно.Видимость = Истина;
		Элементы._Расшифровка.Видимость  = Ложь;
		Элементы.Дек_Расшифровка.Видимость = Ложь;
		Элементы._Дополнительно.Видимость = Ложь;
		Элементы.Дек_Дополнительно.Видимость = Истина;
		Возврат;
		
	КонецЕсли;	

	Элементы.ГруппаРасшифровка.Видимость   = Истина;
	Элементы.ГруппаДополнительно.Видимость = Ложь;
	Элементы._Расшифровка.Видимость  = Ложь;
	Элементы.Дек_Расшифровка.Видимость = Истина;
	Элементы._Дополнительно.Видимость = Истина;
	Элементы.Дек_Дополнительно.Видимость = Ложь;
		
	Если Объект.ВидОперации = ВидыОпераций.ОплатаОтСтраховойКомпании Тогда
		Элементы.ГруппаРасшифровкаПлатежа.Видимость			 = Истина;
		Элементы.КоманднаяПанельЗаглушкаВыравнивание.МаксимальнаяШирина = 0;
		Элементы.ГруппаРасшифровкаДинамические.Видимость = Ложь;
	Иначе
		Элементы.ГруппаРасшифровкаПлатежа.Видимость			 = Ложь;
		Элементы.ГруппаРасшифровкаДинамические.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает идентификатор строки данных по имени элемента.
//
Функция ПолучитьИндексСтроки(ИмяЭлемента)
	
	НомерСимвола = Найти(ИмяЭлемента,"_");
	Возврат Число(Прав(ИмяЭлемента,СтрДлина(ИмяЭлемента) - НомерСимвола)); 
	
КонецФункции

&НаСервере
// Функция возвращает ссылку на отчет
//
Функция СсылкаВариантаОтчета(ИмяОтчета, КлючВарианта)
	
	Отчет = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Отчет." + ИмяОтчета);
	Возврат ВариантыОтчетов.ВариантОтчета(Отчет, КлючВарианта);
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить ссылку документа списания по отмене ошибочной оплаты
//
// Параметры:
//  СылкаПоступления - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСсылкуДокументаСписанияПоОтменеОшибочнойОплаты(СылкаПоступления)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СписаниеДенежныхСредств.РасшифровкаПлатежа КАК СписаниеДенежныхСредствРасшифровкаПлатежа
	|ГДЕ
	|	СписаниеДенежныхСредствРасшифровкаПлатежа.ОснованиеДополнительное = &Основание
	|	И СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОшибочнойОплатыКлиенту)
	|	И СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА");
	
	Запрос.УстановитьПараметр("Основание", СылкаПоступления);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписиДокОтменыОплаты(Результат, Допараметры) Экспорт
	УстановитьВидимость();
КонецПроцедуры

&НаСервереБезКонтекста
// Функция Записать признак пробития чека в очереди кассового сервера.
//
Процедура ЗаписатьПризнакПробитияЧекаВОчередиКассовогоСервера(ДокументОплаты, НомерЧекаККТ)

	РегистрыСведений.ОчередьКассовогоСервера.ЗаписатьПризнакПробитияЧекаВручную(ДокументОплаты, НомерЧекаККТ);	
	
КонецПроцедуры

#КонецОбласти
