
&НаКлиенте
Перем ПредПолеВводаСуммыОплаты;
&НаКлиенте
Перем ТекущееПолеВводаСуммыОплаты;
&НаКлиенте
Перем ТекущееПолеВводаСБП;

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидЛицевогоСчета                       		= Справочники.ВидыЛицевыхСчетов.ОсновнойЛицевойСчет;
	
	Параметры.Свойство("Касса", Касса);	
	Если Не ЗначениеЗаполнено(Касса) Тогда
		Касса = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.ОсновнаяКасса;    		
	КонецЕсли;
	
	Если Параметры.Свойство("Контрагент") Тогда 		
		ЭтаФорма.Контрагент = Параметры.Контрагент; 		
	КонецЕсли;
	
	ИспользоватьБезПодключенияОборудования 		= ?(ЗначениеЗаполнено(Касса), Касса.ИспользоватьБезПодключенияОборудования, Ложь);	
	СостояниеКассовойСмены              		= РозничныеПродажи.ПолучитьСостояниеКассовойСмены(Касса);
	КассоваяСмена                       		= ?(СостояниеКассовойСмены <> Неопределено,  СостояниеКассовойСмены.КассоваяСмена, Неопределено);   	
	ЭквайринговыйТерминал                  		= Справочники.ЭквайринговыеТерминалы.ПолучитьЭквайринговыйТерминалПоУмолчанию(Касса);
	ИспользоватьБезПодключенияОборудования_ЭТ   = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ЭквайринговыйТерминал, "ИспользоватьБезПодключенияОборудования");
	ФискальныйРегистратор                  		= ПолучитьСсылкиНаОборудование(Касса);
	СтруктурнаяЕдиница                          = Касса.СтруктурнаяЕдиница;
	Организация                                 = СтруктурнаяЕдиница.Организация;
	ККТ                                         = ФискальныйРегистратор.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Сотрудник                                   = ПараметрыСеанса.ТекущийПользователь.Сотрудник;
	ПроизошлаОшибкаПечатиЧека              		= Ложь;
	Элементы.ГруппаПараметрыПечати.Видимость 	= Истина;
	
	//
	// Настройка кассы оплаты.
	
	МассивДоступныхКасс = РозничныеПродажи.ПолучитьКассыДоступныеДляОплаты(Справочники.Кассы.ПолучитьКассыДляОплаты(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница), ПараметрыСеанса.РабочееМестоКлиента, Ложь);
	ОбновитьДоступныеКассыДляСсылокИСбп(МассивДоступныхКасс);
	
	// Последовательность касс уже упорядоченна по приоритету в функции: Справочники.Кассы.ПолучитьКассыДляОплаты.		
	Если МассивДоступныхКасс.Количество() > 0 Тогда
		ЭтотОбъект.Касса = МассивДоступныхКасс[0].Касса; 
	Иначе		
		Элементы.ГруппаВыборКассыДляОплаты.Видимость = Истина;
		// Доступна одна касса.  	
	КонецЕсли;
	
	Для Каждого ЭлементМассива Из МассивДоступныхКасс Цикл
		НоваяСтрока = ЭтотОбъект.ДоступныеКассы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
		Новаястрока.ИспользоватьБезПодключенияОборудования = НЕ ЭлементМассива.ФРИспользуется;
	КонецЦикла;
	
	ЭтотОбъект.ТекущаяКассаИспользуетсяККТ = ЭтотОбъект.Касса.ВнешнееОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ; 
	
	ПостроитьДинамическиеЭлементы("Касса");
	УстановитьВидыОплатСервер();
	РасставитьПриоритетПечатиЧека();
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Контрагент) Тогда
		
		КонтактнаяИнформация = МенеджерОборудованияВызовСервера.ПолучитьКонтактнуюИнформацию(ЭтотОбъект.Контрагент,, ЭтотОбъект.Касса);
		
		ЭтотОбъект.ЧекККТПочта   = КонтактнаяИнформация.Email;
		ЭтотОбъект.ЧекККТТелефон = КонтактнаяИнформация.Телефон;
		
	КонецЕсли;    
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии"
//
Процедура ПриОткрытии(Отказ)
	
#Область _______________________________________________________СТАРЫЙ_МЕХАНИЗМ_________________________________________________________

	// ТекущаяСмена = ПолучитьСостояниеКассовойСменыНаСервереБезКонтекста(Касса);	
	// Если НЕ ТекущаяСмена.СменаОткрыта Тогда
	//	Если НЕ ИспользоватьБезПодключенияОборудования Тогда 
	//		Если Вопрос("Окрыть кассовую смену?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
	//			Отказ = Истина;
	//			Возврат;
	//		Иначе 
	//			ОбщегоНазначенияКлиентСтоматология.ОткрытьКассовуюСмену(Касса, УникальныйИдентификатор);
	//			Если ЗначениеЗаполнено(Контрагент) Тогда 
	//				Элементы.Контрагент.ТолькоПросмотр = Истина;
	//				ЭтаФорма.ТекущийЭлемент = Элементы.Сумма;
	//			Иначе
	//				Элементы.Контрагент.ТолькоПросмотр = Ложь;		
	//				ЭтаФорма.ТекущийЭлемент = Элементы.Контрагент;
	//			КонецЕсли;			
	//		КонецЕсли;
	//	Иначе 
	//		ОбщегоНазначенияКлиентСтоматология.ОткрытьКассовуюСмену(Касса, УникальныйИдентификатор);
	//		ПоказатьОповещениеПользователя("Сообщение:", , "Кассовая смена открыта", БиблиотекаКартинок.Информация32);			
	//		Если ЗначениеЗаполнено(Контрагент) Тогда 
	//			Элементы.Контрагент.ТолькоПросмотр = Истина;
	//			ЭтаФорма.ТекущийЭлемент = Элементы.Сумма;
	//		Иначе
	//			Элементы.Контрагент.ТолькоПросмотр = Ложь;		
	//			ЭтаФорма.ТекущийЭлемент = Элементы.Контрагент;
	//		КонецЕсли;			
	//	КонецЕсли;	
	// ИначеЕсли КонецДня(ТекущаяСмена.ДатаИзмененияСтатуса) < ТекущаяДата() Тогда
	//	Если НЕ ИспользоватьБезПодключенияОборудования Тогда 		
	//		Если Вопрос("Закрыть кассовую смену?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
	//			Отказ = Истина;
	//			Возврат;
	//		Иначе 
	//			ОбщегоНазначенияКлиентСтоматология.ЗакрытьКассовуюСмену(Касса, УникальныйИдентификатор);
	//			Оповестить("ОбновитьФормыПослеСнятияZОтчета");
	//			Отказ = Истина;
	//		КонецЕсли;
	//	Иначе 
	//		ОбщегоНазначенияКлиентСтоматология.ЗакрытьКассовуюСмену(Касса, УникальныйИдентификатор);
	//		ПоказатьОповещениеПользователя("Сообщение:", , "Кассовая смена закрыта", БиблиотекаКартинок.Информация32);							
	//		Оповестить("ОбновитьФормыПослеСнятияZОтчета");
	//		Отказ = Истина;
	//	КонецЕсли;
	// Иначе  		
	//	Если ЗначениеЗаполнено(Контрагент) Тогда 
	//		Элементы.Контрагент.ТолькоПросмотр = Истина;
	//		ЭтаФорма.ТекущийЭлемент = Элементы.Сумма;
	//	Иначе
	//		Элементы.Контрагент.ТолькоПросмотр = Ложь;		
	//		ЭтаФорма.ТекущийЭлемент = Элементы.Контрагент;
	//	КонецЕсли;	
	// КонецЕсли;

#КонецОбласти

	ТекстОшибки     = "";	
	ОткрытьФорму    = Истина;
	Если (КассоваяСмена <> Неопределено) 
		и (НЕ РозничныеПродажи.СменаОткрыта(КассоваяСмена, ТекущаяДата(), ТекстОшибки)) Тогда  						
		// Задаем вопрос об открытии кассы.
		Если ((СокрЛП(ТекстОшибки) = "Кассовая смена закрыта") ИЛИ (СокрЛП(ТекстОшибки) = "Кассовая смена не открыта")) Тогда
			Если НЕ ИспользоватьБезПодключенияОборудования Тогда 
				ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОбОткрытииКассовойСмены", ЭтотОбъект, Новый Структура("ОткрытьФорму,ТекстОшибка", ОткрытьФорму,ТекстОшибки)), "Кассовая смена не открыта. Открыть смену?", РежимДиалогаВопрос.ДаНет, 0);
				Возврат;
			ИначеЕсли ЗначениеЗаполнено(Касса) Тогда 
				ОбщегоНазначенияКлиентСтоматология.ОткрытьКассовуюСмену(Касса, УникальныйИдентификатор, ОткрытьФорму);
				СостояниеКассовойСмены = РозничныеПродажи.ПолучитьСостояниеКассовойСмены(Касса);
				ПоказатьОповещениеПользователя("Сообщение:", , "Кассовая смена открыта", БиблиотекаКартинок.Информация32);								
			КонецЕсли;		
		ИначеЕсли (Лев(ТекстОшибки, 33) = "С момента открытия кассовой смены") Тогда
			
			// Задаем запрос о закрытии кассы.
			Если НЕ ИспользоватьБезПодключенияОборудования Тогда
				ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОЗакрытииКассовойСмены", ЭтотОбъект, Новый Структура("ОткрытьФорму", ОткрытьФорму)), "" + ТекстОшибки + ". Закрыть смену?", РежимДиалогаВопрос.ДаНет, 0);
				Возврат;
			ИначеЕсли ЗначениеЗаполнено(Касса) Тогда 
				ОбщегоНазначенияКлиентСтоматология.ЗакрытьКассовуюСмену(Касса, УникальныйИдентификатор);
				СостояниеКассовойСмены = РозничныеПродажи.ПолучитьСостояниеКассовойСмены(Касса);				
				ОбщегоНазначенияКлиентСтоматология.ОткрытьКассовуюСмену(Касса, УникальныйИдентификатор, ОткрытьФорму);
				СостояниеКассовойСмены = РозничныеПродажи.ПолучитьСостояниеКассовойСмены(Касса);
				ПоказатьОповещениеПользователя("Сообщение:", , "Кассовая смена открыта", БиблиотекаКартинок.Информация32);				
			КонецЕсли;
			
		КонецЕсли;		
		
		Если НЕ ОткрытьФорму Тогда
			Отказ = Истина;
		КонецЕсли; 
		
	КонецЕсли;

	ПечатьКвитанцииПриИзменении(Неопределено);	
	
КонецПроцедуры

&НаКлиенте 
// Процедура - После вопроса об открытии кассовой смены
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПослеВопросаОбОткрытииКассовойСмены(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ОткрытьФорму = ДополнительныеПараметры.ОткрытьФорму;
	ТекстОшибки = ДополнительныеПараметры.ТекстОшибки;
	
	Если (РезультатВопроса = КодВозвратаДиалога.Да)
		И (ЗначениеЗаполнено(Касса)) Тогда  				
		ОбщегоНазначенияКлиентСтоматология.ОткрытьКассовуюСмену(Касса, УникальныйИдентификатор, ОткрытьФорму);
		СостояниеКассовойСмены = РозничныеПродажи.ПолучитьСостояниеКассовойСмены(Касса);
	Иначе
		Закрыть();
		Возврат;
	КонецЕсли;
	
	Если НЕ ОткрытьФорму Тогда
		Закрыть();
		Возврат;
	КонецЕсли; 
	
	ПечатьКвитанцииПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После вопроса о закрытии кассовой смены
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПослеВопросаОЗакрытииКассовойСмены(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если (РезультатВопроса = КодВозвратаДиалога.Да)
		И (ЗначениеЗаполнено(Касса))  Тогда
		ОбщегоНазначенияКлиентСтоматология.ЗакрытьКассовуюСмену(Касса, УникальныйИдентификатор);
	КонецЕсли;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка оповещения.
// 
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СБП_УспешнаяОплата" Тогда		
		ОбсужденияСистемыВзаимодействияКлиент.ОбработкаОповещенияОбУспешностиОплатыСБП(ЭтаФорма, Параметр);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыФункции

&НаКлиенте
// Процедура, обработчик нажатия кнопки "Наличные"
//
Процедура Наличные(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		ЭтаФорма.Заголовок                        = "Взнос на лицевой счет наличными";
		Элементы.Контрагент .ТолькоПросмотр       = Истина;
		Элементы.Сумма.ТолькоПросмотр             = Истина;
		Элементы.ВидЛицевогоСчета.ТолькоПросмотр  = Истина;
		Элементы.Наличными.Видимость              = Ложь;
		Элементы.ПлатежнойКартой.Видимость        = Ложь;
		Элементы.Внести.Видимость                 = Истина;
		ЭтаФорма.ТекущийЭлемент                   = Элементы.Внести;
		ТипДенежныхСредств                        = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные");
		Элементы.ГруппаПараметрыПечати.Видимость  = Истина;
		ПечатьКвитанцииПриИзменении(Неопределено);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик нажатия кнопки "ПлатежнаяКарта"
//
Процедура ПлатежнаяКарта(Команда)
	
	Если ПроверитьЗаполнение() Тогда 
		ЭтаФорма.Заголовок                        = "Взнос на лицевой счет платежной картой";
		Элементы.Контрагент .ТолькоПросмотр       = Истина;
		Элементы.Сумма.ТолькоПросмотр             = Истина;
		Элементы.ВидЛицевогоСчета.ТолькоПросмотр  = Истина;	
		Элементы.Наличными.Видимость              = Ложь;
		Элементы.ПлатежнойКартой.Видимость        = Ложь;
		Элементы.Внести.Видимость                 = Истина;
		ЭтаФорма.ТекущийЭлемент                   = Элементы.Внести;
		ТипДенежныхСредств                        = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ПлатежнаяКарта");
		Элементы.ГруппаПараметрыПечати.Видимость  = Ложь;	
		ПечатьКвитанции = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик нажатия кнопки "Отмена"
//
Процедура Отмена(Команда)
	
	Если ЗначениеЗаполнено(ТипДенежныхСредств) Тогда
		ЭтаФорма.Заголовок                        = "Взнос на лицевой счет";
		Элементы.Сумма.ТолькоПросмотр             = Ложь;
		Элементы.ВидЛицевогоСчета.ТолькоПросмотр  = Ложь;		
		Элементы.Наличными.Видимость              = Истина;
		Элементы.ПлатежнойКартой.Видимость        = Истина;
		Элементы.Внести.Видимость                 = Ложь;
		ТипДенежныхСредств                        = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ПустаяСсылка");
		Элементы.ГруппаПараметрыПечати.Видимость  = Ложь;
	Иначе 
		ЭтаФорма.Закрыть();	
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
// Процедура, обработчик нажатия кнопки "Внести"
//
Процедура ВнестиНаЛС(Команда)
	
	МассивСтрок = ПолучитьСтрокиСВнесеннойОплатой(ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.СистемаБыстрыхПлатежей"));
	Если МассивСтрок.Количество() > 0 Тогда
		ЗавершитьВводСуммыОплатыСБП(МассивСтрок[0]);
	ИначеЕсли ПроверитьЗаполнение() Тогда 
		Оплатить();     
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик нажатия кнопки "Внести".
//
Процедура Оплатить()
	
	ОписаниеОшибки             		    = Неопределено;
	ПараметрыИспользованияКассовойСмены = Новый Структура();
	РозничныеПродажиКлиент.ВыполнитьКонтрольИспользованияКассовойСмены(ЭтотОбъект, ЭтотОбъект.Касса, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки);
	
КонецПроцедуры

#Область ОбработчикиРаботыСКассовойСменой

&НаКлиенте
// Процедура - После контроля использования кассовой смены.
//
Процедура ПослеКонтроляИспользованияКассовойСмены(ИспользованиеКассовойСменыРазрешено, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки) Экспорт
	
	Если ИспользованиеКассовойСменыРазрешено = Ложь Тогда
		ПоказатьПредупреждение(, Нстр("ru='Оплата запрещена: ';en='Payment is prohibited:'") + ОписаниеОшибки);
		Возврат;
	КонецЕсли;

	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("Контрагент"           , Контрагент);
	СтруктураЗаполнения.Вставить("Сумма"                , Сумма);
	СтруктураЗаполнения.Вставить("ВидЛицевогоСчета"     , ВидЛицевогоСчета);
	СтруктураЗаполнения.Вставить("ТипДенежныхСредств"   , ТипДенежныхСредств);
	СтруктураЗаполнения.Вставить("ЭквайринговыйТерминал", ЭквайринговыйТерминал);
	СтруктураЗаполнения.Вставить("Касса"			    , Касса);
	СтруктураЗаполнения.Вставить("ЭквайрингВидПлатежнойКарты", ВидКарты);	
	
	ДокументыОплаты = ОперацияОплатыСервер(СтруктураЗаполнения, ОписаниеОшибки);
	
	ПроведениеДокументовОтменено = Ложь;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда          
		
		ОтменитьПроведениеДокументов(ДокументыОплаты);
		
		ПоказатьПредупреждение(, ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	Если ВыполнятьОперациюПоПлатежнойКарте() = Истина Тогда
		
		ДанныеПлатежаПоКарте = ВыполнитьОперациюПоПлатежнойКарте(ОписаниеОшибки);
		
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда			
			ОтменитьПроведениеДокументов(ДокументыОплаты);
			ПроведениеДокументовОтменено = Истина;
			ПоказатьПредупреждение(, ОписаниеОшибки);
			Возврат;			
		КонецЕсли;
		
	КонецЕсли;
		
	Если НЕ ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ЭтотОбъект.Касса, "ИспользоватьБезПодключенияОборудования")
		И ДокументыОплаты.МассивДокОплаты.Количество() > 0 Тогда
		
		Если ЭтотОбъект.ТекущаяКассаИспользуетсяККТ Тогда
			ПараметрыЧека = ПодготовитьПараметрыФискальногоЧекаВзносаНаЛицСчетДляККТ(ДокументыОплаты.МассивДокОплаты);      
		Иначе
			ПараметрыЧека = ПодготовитьПараметрыФискальногоЧекаВзносаНаЛицСчетДляФР(ДокументыОплаты.МассивДокОплаты); 
		КонецЕсли;
		
		Если ПараметрыЧека.Результат Тогда
			
			ИдентификаторУстройстваФР = МенеджерОборудованияВызовСервера.ПолучитьИдентификаторФискальногоРегистратораДляКассы(ЭтотОбъект.Касса);
			
			Если ПараметрыЧека.Свойство("ФискальныйЧек") Тогда    
				
				Контекст = Новый Структура();
				Контекст.Вставить("ТипЧека", Истина);      
				Оповещение            = Новый ОписаниеОповещения("ПробитьЧекЗавершение"            , ЭтотОбъект, Контекст);
				ПослеОткрытияЧека     = Новый ОписаниеОповещения("ПечатьЧека_ПослеОткрытияЧека"    , ЭтотОбъект, Контекст);
				ПослеОшибкиПечатиЧека = Новый ОписаниеОповещения("ПечатьЧека_ПослеОшибкиПечатиЧека", ЭтотОбъект, Контекст);
				
				ОбщиеПараметры = ПараметрыЧека.ФискальныйЧек;
				МенеджерОборудованияКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(Оповещение, УникальныйИдентификатор, ОбщиеПараметры, ИдентификаторУстройстваФР, , ПослеОткрытияЧека, ПослеОшибкиПечатиЧека);    
				
			КонецЕсли;
			
			// Если был фискальный чек, то нефискальный чек напечатается после завершения фискального.
			Если ПараметрыЧека.Свойство("НефискальныйЧек") Тогда
				
				ТекстЧека  = ПараметрыЧека.НефискальныйЧек;
				Контекст   = Новый Структура();
				Контекст.Вставить("ТипЧека", Ложь);
				Оповещение = Новый ОписаниеОповещения("ПробитьЧекЗавершение", ЭтотОбъект, Контекст);
				
				МенеджерОборудованияКлиент.НачатьПечатьТекста(Оповещение, УникальныйИдентификатор, ТекстЧека, ИдентификаторУстройстваФР);
				
			КонецЕсли;        
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Ошибка Фискализации взноса на ЛС: ';en='Mistake Fiscalization contribution on drugs:'") +  ПараметрыЧека.ОписаниеОшибки);
			ОтменитьПроведениеДокументов(ДокументыОплаты);
			ПроведениеДокументовОтменено = Истина;
			
			Возврат;
			
		КонецЕсли;    
		
		Если ЗначениеЗаполнено(НомерНеФискальногоЧека) 
			ИЛИ ЗначениеЗаполнено(НомерФискальногоЧека)  Тогда
			
			ПрописатьНомерФискальногоЧекаИПлатежнойКарты(
				ДокументыОплаты.МассивДокОплаты, 
				НомерФискальногоЧека, 
				ДанныеПлатежаПоКарте);
			
			ВыполненоУспешно = Истина;
			
		Иначе
			
			// При печати чека произошла ошибка, отменить проведение документов оплаты
			ОписаниеОшибки = Нстр("ru='Ошибка пробития чека на ФР';en='Mistake penetration check on ph'");
			ПоказатьПредупреждение(, ОписаниеОшибки);
			ОтменитьПроведениеДокументов(ДокументыОплаты);
			ПроведениеДокументовОтменено = Истина;
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ПроведениеДокументовОтменено Тогда  
		СуммаВзноса = 0;
		СуммаВзноса = СуммаВзноса + ПолучитьСуммуВзноса(ДокументыОплаты.МассивДокОплаты); 
		СуммаВзноса = СуммаВзноса + ПолучитьСуммуВзноса(ДокументыОплаты.МассивДокОплатыСертификатом);
		 
		Структура = Новый Структура;
		Структура.Вставить("СуммаВзноса",СуммаВзноса); 
       	Оповестить("ПРОВЕДЕН_ВЗНОС_НА_ЛИЦЕВОЙ_СЧЕТ", Структура, Контрагент);
		
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСуммуВзноса(МассивДокументовОплаты)
	
	СуммаВзноса = 0;
	
	Для Каждого ДокументОплаты Из МассивДокументовОплаты  Цикл 
		
		СуммаДокумента_ = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ДокументОплаты, "СуммаДокумента"); 
		СуммаДокумента = ?(СуммаДокумента_<>Неопределено, СуммаДокумента_, 0);		
		СуммаВзноса = СуммаВзноса + СуммаДокумента;
			
	КонецЦикла;	  
	
	Возврат СуммаВзноса;

КонецФункции 
	
&НаСервере
// Функция - Подготовить параметры чека на печать.
// 
Функция ПодготовитьПараметрыФискальногоЧекаВзносаНаЛицСчетДляККТ(МассивДокументовОплаты = Неопределено)
	
	Если МассивДокументовОплаты = Неопределено Тогда
		МассивДокументовОплаты = Новый Массив;
	КонецЕсли;
	
	ПараметрыЧека 	= МенеджерОборудованияВызовСервера.ПустаяСтруктураПараметровЧека();
	ПараметрыОплаты	= ПолучитьМассивОплатФискальногоЧекаВзносаНаЛицСчетДляККТ();
	ВидНалога 	  	= ?(ЗначениеЗаполнено(ЭтотОбъект.Организация.СистемаНалогообложенияДляАвансов),  
							ЭтотОбъект.Организация.СистемаНалогообложенияДляАвансов, 
							ЭтотОбъект.Организация.СистемаНалогообложения);

	ПараметрыЧека.ВидОперации             = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет;
	ПараметрыЧека.СтруктурнаяЕдиница      = ЭтотОбъект.СтруктурнаяЕдиница;
	ПараметрыЧека.Организация             = ЭтотОбъект.Организация;
	ПараметрыЧека.Сотрудник               = ЭтотОбъект.Сотрудник;
	ПараметрыЧека.Клиент                  = ЭтотОбъект.Контрагент;
	ПараметрыЧека.Дата                    = ТекущаяДатаСеанса();
	ПараметрыЧека.Касса                   = ЭтотОбъект.Касса;  
	ПараметрыЧека.Количество              = 1;  
	ПараметрыЧека.СуммаКОплате            = ПараметрыОплаты.СуммаВзноса;
	ПараметрыЧека.СуммаОплачено           = ПараметрыОплаты.СуммаВзноса;
	ПараметрыЧека.ТипЧека                 = 0;
	ПараметрыЧека.ВидНалога               = ВидНалога;
	ПараметрыЧека.ВыводитьЧекНаБумагу     = Этотобъект.ЧекПечатать;
	ПараметрыЧека.ЭлектроннаяПочтаКлиента = ?(ЭтотОбъект.ЧекККОтправитьНаПочту	, ЭтотОбъект.ЧекККТПочта	, Неопределено);
	ПараметрыЧека.НомерТелефонаКлиента    = ?(ЭтотОбъект.ЧекККОтправитьНаТелефон, ЭтотОбъект.ЧекККТТелефон	, Неопределено);
	
	ПараметрыЧека.МассивПараметровОплаты = ПараметрыОплаты.МассивОплат;  
	ПараметрыЧека.МассивПараметровТовары = ПолучитьМассивТоваровФискальногоЧекаВзносаСдачиНаЛицСчетДляККТ(ПараметрыОплаты.СуммаВзноса);   	
	
	ПараметрыЧека.МассивДокументовОснований = МассивДокументовОплаты; 
	
	ФормированиеЧека = МенеджерОборудованияВызовСервера.ПодготовитьДанныеДляПробитияФискальногоЧекаККТ(ПараметрыЧека);  
	
	Возврат ФормированиеЧека;
	
КонецФункции

&НаСервере
// Функция - Получить массив оплат на печать.
// 
Функция ПолучитьМассивОплатФискальногоЧекаВзносаНаЛицСчетДляККТ()
	
	МассивСтрокДереваОплата = ПолучитьСтрокиСВнесеннойОплатойСервер();
	МассивОплат = Новый Массив;    
	
	СуммаВзноса = 0;
	Для Каждого СтрокаОплаты Из МассивСтрокДереваОплата Цикл 
		// Если СтрокаОплаты.ТипДенежныхСредств <> Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат Тогда
			ПараметрыТипаОплаты = МенеджерОборудованияВызовСервера.ПустаяСтруктураСтрокиПлатежаЧека();
			ПараметрыТипаОплаты.ТипОплаты = СтрокаОплаты.ТипДенежныхСредств;
			ПараметрыТипаОплаты.Сумма     = СтрокаОплаты.Внесено;
			СуммаВзноса = СуммаВзноса + ПараметрыТипаОплаты.Сумма;
			МассивОплат.Добавить(ПараметрыТипаОплаты);
		// КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("МассивОплат, СуммаВзноса", МассивОплат, СуммаВзноса);
	
КонецФункции    

&НаСервере
// Функция, возвращает массив товаров на печать.
//
Функция ПолучитьМассивТоваровФискальногоЧекаВзносаСдачиНаЛицСчетДляККТ(СуммаВзноса)
	
	МассивТоваров = Новый Массив;
	
	СтрокаТовара = МенеджерОборудованияВызовСервера.ПустаяСтруктураСтрокиТоваровЧека();
	
	СтрокаТовара.Наименование           = МенеджерОборудованияВызовСервера.ПолучитьСловоСУчетомЯзыка("Взнос на лицевой счет");
	СтрокаТовара.СтоимостьБезСкидки     = СуммаВзноса;
	СтрокаТовара.СтавкаНДС              = МенеджерОборудованияВызовСервера.ПолучитьНДСПриВзносеНаЛицевойСчет(ЭтотОбъект.Организация);
	СтрокаТовара.СуммаНДС               = Ценообразование.РассчитатьСуммуНДС(ЭтотОбъект.Сумма, СтрокаТовара.СтавкаНДС);
	 	
	МассивТоваров.Добавить(СтрокаТовара);
	
	Возврат МассивТоваров;
	
КонецФункции

&НаСервере
// Функция - Подготовить параметры чека на печать.
// 
Функция ПодготовитьПараметрыФискальногоЧекаВзносаНаЛицСчетДляФР(МассивДокументовОплаты = Неопределено)
	
	Если МассивДокументовОплаты= Неопределено Тогда
		МассивДокументовОплаты = Новый Массив;
	КонецЕсли;		
	
	ПараметрыЧека 	= МенеджерОборудованияВызовСервера.ПустаяСтруктураПараметровЧека();
	ПараметрыОплаты	= ПолучитьМассивОплатФискальногоЧекаВзносаНаЛицСчетДляККТ();
	ВидНалога 	  	= ?(ЗначениеЗаполнено(ЭтотОбъект.Организация.СистемаНалогообложенияДляАвансов), 
							ЭтотОбъект.Организация.СистемаНалогообложенияДляАвансов,  
							ЭтотОбъект.Организация.СистемаНалогообложения);
	
	ПараметрыЧека.ВидОперации            = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет;
	ПараметрыЧека.СтруктурнаяЕдиница     = ЭтотОбъект.СтруктурнаяЕдиница;
	ПараметрыЧека.Организация            = ЭтотОбъект.Организация;
	ПараметрыЧека.Сотрудник              = ЭтотОбъект.Сотрудник;
	ПараметрыЧека.Клиент                 = ЭтотОбъект.Контрагент;
	ПараметрыЧека.Дата                   = ТекущаяДатаСеанса();
	ПараметрыЧека.Касса                  = ЭтотОбъект.Касса;  
	ПараметрыЧека.Наименование           = МенеджерОборудованияВызовСервера.ПолучитьСловоСУчетомЯзыка("Оплата от:") + " " + Контрагент;
	ПараметрыЧека.СтоимостьБезСкидки     = ПараметрыОплаты.СуммаВзноса;
	ПараметрыЧека.Количество             = 1;
	ПараметрыЧека.ТипЧека                = 0;
	// ПараметрыЧека.ТипОплаты              = Перечисления.ТипыДенежныхСредств.Наличные;
	ПараметрыЧека.ВидНалога               = ВидНалога;
	
	ПараметрыЧека.СуммаКОплате           = ПараметрыОплаты.СуммаВзноса;
	ПараметрыЧека.СуммаОплачено          = ПараметрыОплаты.СуммаВзноса;
	
	// ККТ микс
	ПараметрыЧека.МассивПараметровОплаты  = ПараметрыОплаты.МассивОплат;  
	ПараметрыЧека.МассивПараметровТовары  = ПолучитьМассивТоваровФискальногоЧекаВзносаСдачиНаЛицСчетДляККТ(ПараметрыОплаты.СуммаВзноса); 
	
	ПараметрыЧека.ТипЧека                 = 0;
	ПараметрыЧека.ВыводитьЧекНаБумагу     = ЭтотОбъект.ЧекПечатать;
	ПараметрыЧека.ЭлектроннаяПочтаКлиента = ?(ЭтотОбъект.ЧекККОтправитьНаПочту	, ЭтотОбъект.ЧекККТПочта	, Неопределено);
	ПараметрыЧека.НомерТелефонаКлиента    = ?(ЭтотОбъект.ЧекККОтправитьНаТелефон, ЭтотОбъект.ЧекККТТелефон	, Неопределено);
	
	ПараметрыЧека.МассивДокументовОснований = МассивДокументовОплаты;
	
	ФормированиеЧека = МенеджерОборудованияВызовСервера.ПодготовитьДанныеДляПробитияФискальногоИНеФискальногоЧекаФР(ПараметрыЧека);  
	
	Возврат ФормированиеЧека;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик описания оповещения.
//
Процедура ПечатьЧека_ПослеОткрытияЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	ШапкаЧека = ПараметрыВыполнения.ВходныеПараметры;
	
	Если ПараметрыВыполнения.НомерСмены <> 0 Тогда
		ШапкаЧека.НомерСмены = ПараметрыВыполнения.НомерСмены;
	КонецЕсли;
	
	Если ПараметрыВыполнения.НомерЧека <> 0 Тогда
		ШапкаЧека.НомерЧека = ПараметрыВыполнения.НомерЧека;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ПараметрыВыполнения.ОповещениеПродолжения, ПараметрыВыполнения);
	
КонецПроцедуры

&НаКлиенте
// Процедура, завершение пробития чека на ФР.
//
Процедура ПробитьЧекЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		// Установить полученное значение номера чека реквизиту документа.
		Если РезультатВыполнения.ВыходныеПараметры <> Неопределено Тогда
			// Объект.НомерСменыККМ = РезультатВыполнения.ВыходныеПараметры[0];
			Если Параметры.ТипЧека Тогда
				// Серж
				// НомерФискальногоЧека = РезультатВыполнения.ВыходныеПараметры[1];
				Попытка
					НомерФискальногоЧека = РезультатВыполнения.ВыходныеПараметры[1];
				Исключение
					
					Попытка
						НомерФискальногоЧека = РезультатВыполнения.ДополнительныеПараметры.НомерЧека; // для Марии 301. Возможно, нужно изменить в обработчике структуру возвращаемых параметров
					Исключение
						
					КонецПопытки;
					
				КонецПопытки;
				
				// Подключена = ОбщегоНазначения.ПодключенаКассаЭвотор(ЭтотОбъект.Касса);
				// Если Подключена И РезультатВыполнения.ВыходныеПараметры.Количество() > 7 Тогда
				//	НомерФискализацииЭвотор = РезультатВыполнения.ВыходныеПараметры[7]; 
				// КонецЕсли;

			Иначе
				// Серж
				// НомерНефискальногоЧека = РезультатВыполнения.ВыходныеПараметры[1];
				Попытка
					НомерНефискальногоЧека = РезультатВыполнения.ВыходныеПараметры[1];
				Исключение
					
					Попытка
						НомерНефискальногоЧека = РезультатВыполнения.ДополнительныеПараметры.НомерЧека; // для Марии 301. Возможно, нужно изменить в обработчике структуру возвращаемых параметров
					Исключение
						
					КонецПопытки;
					
				КонецПопытки;
				//...Серж
			КонецЕсли;      
			
			// Если ФискальныеОперации не был записан - произошла ошибка при записи.
			Если РезультатВыполнения.ВыходныеПараметры.Количество() > 8 Тогда
				ПараметрыФискализации = РезультатВыполнения.ВыходныеПараметры[8];
				Если НЕ ПараметрыФискализации.ОперацияЗаписана Тогда
					МенеджерОборудованияВызовСервера.ЗаписатьФискальнуюОперацию(ПараметрыФискализации);
				КонецЕсли;
				Если НЕ ПустаяСтрока(ПараметрыФискализации.ЧекКоррекцииСторно)
					И НЕ ПараметрыФискализации.ЧекКоррекцииСторно.ОперацияЗаписана Тогда
					МенеджерОборудованияВызовСервера.ЗаписатьФискальнуюОперацию(ПараметрыФискализации.ЧекКоррекцииСторно);
				КонецЕсли;
			КонецЕсли;  

		КонецЕсли;
		
	Иначе     
		ТекстСообщения = НСтр("ru='При печати чека произошла ошибка.
		|Чек не напечатан на фискальном регистраторе.
		|Дополнительное описание:
		|%ДополнительноеОписание%';en='With print check happened mistake.
		|Check not printedby on fiscal registrar.
		|Additional description:
		|%ДополнительноеОписание%'");
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);                                             
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ПечатьЧека_ПослеОшибкиПечатиЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	ШапкаЧека = ПараметрыВыполнения.ВходныеПараметры;
	ШапкаЧека.НомерЧека = ШапкаЧека.НомерЧека + 1000000;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, устанавливает номер фискального чека и платежной карты.
//
Процедура ПрописатьНомерФискальногоЧекаИПлатежнойКарты(
	МассивДокументов, 
	НомерЧека, 
	ДанныеПлатежаПоКарте); 
		
	Для Каждого ДокументОплаты Из МассивДокументов Цикл
		
		ДокументОбъект              = ДокументОплаты.ПолучитьОбъект();
		ДокументОбъект.НомерЧекаККМ = НомерЧека;

		Если ЗначениеЗаполнено(ДанныеПлатежаПоКарте) Тогда
			
			ДокументОбъект.ЭквайрингНомерПлатежнойКарты = ДанныеПлатежаПоКарте.НомерКарты;
			ДокументОбъект.ЭквайрингСсылочныйНомер      = ДанныеПлатежаПоКарте.СсылочныйНомер;
			ДокументОбъект.ЭквайрингНомерЧека           = ДанныеПлатежаПоКарте.НомерЧека;
			
		КонецЕсли;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, отменяет проведение документов оплаты.
//
Процедура ОтменитьПроведениеДокументов(СтруктураОплаты)
	
	Для Каждого Документ Из СтруктураОплаты.МассивДокОплаты Цикл
		ДокументОбъект  = Документ.ПолучитьОбъект();
		ДокументОбъект.ДополнительныеСвойства.Вставить("НеПолучатьРазрешениеЗаписиПоПравам", Истина);
		ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;
	
	Для Каждого Документ Из СтруктураОплаты.МассивДокОплатыСертификатом Цикл
		ДокументОбъект  = Документ.ПолучитьОбъект();
		ДокументОбъект.ДополнительныеСвойства.Вставить("НеПолучатьРазрешениеЗаписиПоПравам", Истина);
		ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
// Функция - Существуюет оплата проведенная по карте.
// 
Функция ВыполнятьОперациюПоПлатежнойКарте()
	
	Для Каждого СтрокаТ ИЗ ЭтотОбъект.ВидыОплат.ПолучитьЭлементы() Цикл  		
		Если СтрокаТ.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ПлатежнаяКарта") 
			И СтрокаТ.Внесено > 0 Тогда   			
			Возврат Истина;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
// Функция - Выполнить операцию по платежной карте.
//
Функция ВыполнитьОперациюПоПлатежнойКарте(ОписаниеОшибки = Неопределено)
	
	СтрокиОплаты  = ПолучитьСтрокиСВнесеннойОплатой(ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ПлатежнаяКарта"));
	ДанныеПлатежа = Неопределено;
	
	Если ЗначениеЗаполнено(СтрокиОплаты) Тогда
		
		ФрПодключен = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Касса                , "ИспользоватьБезПодключенияОборудования") = Ложь;
		ЭтПодклчюен = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ЭквайринговыйТерминал, "ИспользоватьБезПодключенияОборудования") = Ложь;
		
		Если ЗначениеЗаполнено(ЭквайринговыйТерминал) И ФрПодключен И ЭтПодклчюен Тогда    
			
			СсылкаНаобрудованиеФР = ПолучитьФРКассы(Касса);
			ДанныеПлатежа         = МенеджерОборудованияКлиент.ВыполнитьПоступлениеПлатежаЭквайринг(
																	ЭквайринговыйТерминал, 
																	СсылкаНаобрудованиеФР, 
																	ЭтаФорма.УникальныйИдентификатор,
																	СтрокиОплаты[0].Внесено,
																	ОписаниеОшибки);       
			
		Иначе
			Возврат Новый Структура("НомерКарты, СсылочныйНомер, НомерЧека", Неопределено, Неопределено, Неопределено);
		КонецЕсли;
		
	Конецесли;
	
	Возврат ДанныеПлатежа;
	
КонецФункции

&НаСервереБезКонтекста
// Получает ссылки на внешнее оборудование.
//
Функция ПолучитьФРКассы(Касса)  
	
	ФискальныйРегистратор = ?(ЗначениеЗаполнено(Касса) И ЗначениеЗаполнено(Касса.ВнешнееОборудование),
								Касса.ВнешнееОборудование.Ссылка,
								Справочники.ПодключаемоеОборудование.ПустаяСсылка());
	
	Возврат ФискальныйРегистратор;
	
КонецФункции 

#КонецОбласти

&НаСервере
// Функция выполняет создание и проведение документа ПоступлениеДС
//
Функция ОперацияОплатыСервер(СтруктураЗаполнения, ОписаниеОшибки)  
	
	МассивДокОплаты				= Новый Массив;
	МассивДокОплатыСертификатом = Новый Массив;
	
	МассивСтрокДереваОплата = ПолучитьСтрокиСВнесеннойОплатойСервер();
	
	МассивСтрокДереваОплата = ОбщегоНазначенияКлиентСерверСтоматология.КонвертироватьТаблицуВМассивСтруктур(
																				МассивСтрокДереваОплата,
																				"ТипДенежныхСредств,Внесено,Сертификат,ЛицевойСчет,");
	
	Для Каждого ВидОплаты Из МассивСтрокДереваОплата Цикл 
		
		СтруктураЗаполнения = Новый Структура;
		СтруктураЗаполнения.Вставить("СтруктурнаяЕдиница"    	 , ЭтотОбъект.СтруктурнаяЕдиница);
		СтруктураЗаполнения.Вставить("Контрагент"                , ЭтотОбъект.Контрагент);
		СтруктураЗаполнения.Вставить("Касса"                 	 , ЭтотОбъект.Касса);
		СтруктураЗаполнения.Вставить("Сумма"                 	 , ВидОплаты.Внесено);
		СтруктураЗаполнения.Вставить("ВидЛицевогоСчета"      	 , ЭтотОбъект.ВидЛицевогоСчета);
		// СтруктураЗаполнения.Вставить("ЛицевойСчетКонтрагента", ЭтотОбъект.ЛицевойСчетКонтрагента);
		СтруктураЗаполнения.Вставить("ЭквайринговыйТерминал" 	 , ЭтотОбъект.ЭквайринговыйТерминал);
		СтруктураЗаполнения.Вставить("ЭквайрингВидПлатежнойКарты", "");
		СтруктураЗаполнения.Вставить("ТипДенежныхСредств"   	 , ВидОплаты.ТипДенежныхСредств);
		
		ДокументСсылка = СоздатьДокументПоступления(СтруктураЗаполнения, ОписаниеОшибки);
		
		Если ЗначениеЗаполнено(ДокументСсылка) Тогда
			МассивДокОплаты.Добавить(ДокументСсылка);			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый Структура("МассивДокОплаты, МассивДокОплатыСертификатом", МассивДокОплаты, МассивДокОплатыСертификатом);	
	
КонецФункции
			
&НаСервереБезКонтекста
// Функция выполняет создание и проведение документа ПоступлениеДС.
//
Функция СоздатьДокументПоступления(СтруктураЗаполнения, ОписаниеОшибки) 
			
	Попытка            		
		ДокументПоступления 					    = Документы.ПоступлениеДенежныхСредств.СоздатьДокумент();
		
		ДокументПоступления.Дата               		= ТекущаяДатаСеанса();	
		ДокументПоступления.ВидОперации 			= Перечисления.ВидыОпераций.ВзносНаЛицевойСчет;
		ДокументПоступления.Статья                  = Справочники.СтатьиДоходовИРасходов.НайтиПоРеквизиту("ПоУмолчаниюДляОперации", ДокументПоступления.ВидОперации);	
		ДокументПоступления.Контрагент 				= СтруктураЗаполнения.Контрагент;
		ДокументПоступления.ЛицевойСчетКонтрагента 	= СтруктураЗаполнения.ВидЛицевогоСчета;
		Если НЕ ЗначениеЗаполнено(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница) Тогда 
			ВызватьИсключение "Не установлена текущая структурная единица!" + Символы.ПС;	
		КонецЕсли;	
		ДокументПоступления.СтруктурнаяЕдиница 		= ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
		Если НЕ ЗначениеЗаполнено(СтруктураЗаполнения.Касса) Тогда 
			ВызватьИсключение "Не установлена основная касса!" + Символы.ПС;	
		КонецЕсли;	
		ДокументПоступления.Касса              		= СтруктураЗаполнения.Касса;
		ДокументПоступления.СуммаДокумента 			= СтруктураЗаполнения.Сумма;
		ДокументПоступления.АвторДокумента 			= ПараметрыСеанса.ТекущийПользователь;
		
		Если СтруктураЗаполнения.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта Тогда 
			ДокументПоступления.ЭквайрингТерминал = СтруктураЗаполнения.ЭквайринговыйТерминал;
			ДокументПоступления.ЭквайрингВидПлатежнойКарты = СтруктураЗаполнения.ЭквайрингВидПлатежнойКарты;
			
			Если НЕ ЗначениеЗаполнено(ДокументПоступления.ЭквайрингТерминал) Тогда 
				ВызватьИсключение "Не установлен текущий эквайринговый терминал!" + Символы.ПС;	
			КонецЕсли;
			
			ДокументПоступления.ТипДенежныхСредств 		= СтруктураЗаполнения.ТипДенежныхСредств;
		ИначеЕсли СтруктураЗаполнения.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда 
			ДокументПоступления.ТипДенежныхСредств 		= СтруктураЗаполнения.ТипДенежныхСредств;
		КонецЕсли;
		
		ДокументПоступления.Записать(РежимЗаписиДокумента.Проведение);
		
		Возврат ДокументПоступления.Ссылка;		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();		
	КонецПопытки;
	
КонецФункции	

&НаСервереБезКонтекста
// Получает ссылки на внешнее оборудование.
//
Функция ПолучитьСсылкиНаОборудование(Касса)	
	
	Возврат ?(ЗначениеЗаполнено(Касса) И ЗначениеЗаполнено(Касса.ВнешнееОборудование),
	Касса.ВнешнееОборудование.Ссылка,
	Справочники.ПодключаемоеОборудование.ПустаяСсылка());		
	
КонецФункции // ПолучитьСсылкиНаОборудование

&НаКлиенте
// Процедура - обработчик события "ПриИзменении"
//
Процедура ПечатьКвитанцииПриИзменении(Элемент)
	
	Элементы.ПечатьКвитанций_Количество.Доступность = ПечатьКвитанции;
	Если ПечатьКвитанций_Количество = 0 И ПечатьКвитанции Тогда 
		ПечатьКвитанций_Количество = 1;
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура - Установить вид оплаты наличными.
//
Процедура УстановитьВидОплатыНаличными()
	
	СущВидыОплат = НайтиВДеревеДоступныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.Наличные);	
	Если НЕ ЗначениеЗаполнено(СущВидыОплат) Тогда
		
		ДеревоОплаты                         = ВидыОплат.ПолучитьЭлементы();
		
		ЭлементДерева                        = ДеревоОплаты.Добавить();
		ЭлементДерева.Представление          = НСтр("ru = 'Наличные'; en = 'Cash'");
		ЭлементДерева.НаименованиеВидаОплаты = "Наличные";
		ЭлементДерева.ТипДенежныхСредств     = Перечисления.ТипыДенежныхСредств.Наличные;
		ЭлементДерева.МаксСуммаСписания      = -1;
		
		ЭлементДерева.Контрагент             = ЭтотОбъект.Контрагент;
		ЭлементДерева.КассаОплаты            = ЭтотОбъект.Касса;
		
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
// Функция рекурсивного поиска в дереве доступных видов оплаты.
//
Функция НайтиВДеревеДоступныхВидовОплатСервер(	
	ТипДенСредств,
	ЛицевойСчет = Неопределено,								 
	ЭквайрингНомерПлатежнойКарты = Неопределено,
	ИсточникДанных = Неопределено,
	ПервуюСтроку = Ложь,
	ПоследнююСтроку = Ложь,
	ЭквайринговыйТерминал = Неопределено)
	
	Если ИсточникДанных = Неопределено Тогда
		ИсточникДанных = ЭтотОбъект.ВидыОплат;
	КонецЕсли;
	
	МассивСтрок = Новый Массив;
	
	Для Каждого ЭлементВерхУр ИЗ ИсточникДанных.ПолучитьЭлементы() Цикл	
		
		Если ЭлементВерхУр.ТипДенежныхСредств <> ТипДенСредств Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если ЛицевойСчет = Неопределено 
			И ЭквайрингНомерПлатежнойКарты = Неопределено 
			И ЭквайринговыйТерминал = Неопределено Тогда
			
			МассивСтрок.Добавить(ЭлементВерхУр);
			Продолжить;
			
		КонецЕсли;
		
		Если ЛицевойСчет <> Неопределено 
			И ЭлементВерхУр.ЛицевойСчет = ЛицевойСчет Тогда
			
			МассивСтрок.Добавить(ЭлементВерхУр);
			Продолжить;
			
		КонецЕсли;
		
		Если ЭквайрингНомерПлатежнойКарты <> Неопределено 
			И ЭлементВерхУр.ЭквайрингНомерПлатежнойКарты = ЭквайрингНомерПлатежнойКарты Тогда
			
			МассивСтрок.Добавить(ЭлементВерхУр);
			Продолжить;
			
		КонецЕсли;
		
		Если ЭквайринговыйТерминал <> Неопределено 
			И ЭлементВерхУр.ЭквайринговыйТерминал = ЭквайринговыйТерминал Тогда
			
			МассивСтрок.Добавить(ЭлементВерхУр);
			Продолжить;
			
		КонецЕсли;
		
		Для Каждого ЭлементНизУр ИЗ ЭлементВерхУр.ПолучитьЭлементы() Цикл	
			
			Если ЭлементНизУр.ТипДенежныхСредств <> ТипДенСредств Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Если ЛицевойСчет = Неопределено 
				И ЭквайрингНомерПлатежнойКарты = Неопределено
				И ЭквайринговыйТерминал = Неопределено Тогда
				
				МассивСтрок.Добавить(ЭлементНизУр);
				Продолжить;
				
			КонецЕсли;
			
			Если ЛицевойСчет <> Неопределено 
				И ЭлементНизУр.ЛицевойСчет = ЛицевойСчет Тогда
				
				МассивСтрок.Добавить(ЭлементНизУр);
				Продолжить;
				
			КонецЕсли;
			
			Если ЭквайрингНомерПлатежнойКарты <> Неопределено 
				И ЭлементНизУр.ЭквайрингНомерПлатежнойКарты = ЭквайрингНомерПлатежнойКарты Тогда
				
				МассивСтрок.Добавить(ЭлементНизУр);
				Продолжить;
				
			КонецЕсли;
			
			Если ЭквайринговыйТерминал <> Неопределено 
				И ЭлементНизУр.ЭквайринговыйТерминал = ЭквайринговыйТерминал Тогда
				
				МассивСтрок.Добавить(ЭлементНизУр);
				Продолжить;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ПервуюСтроку = Истина Тогда
		Если МассивСтрок.Количество() > 0 Тогда
			Возврат МассивСтрок[0];
		Иначе
			Возврат Неопределено;
		КонецЕсли;		
	ИначеЕсли ПоследнююСтроку = Истина Тогда
		Если МассивСтрок.Количество() > 0 Тогда
			Возврат МассивСтрок[МассивСтрок.Количество() - 1];
		Иначе
			Возврат Неопределено;
		КонецЕсли;		
	Иначе	
		Возврат МассивСтрок;
	КонецЕсли;
	
КонецФункции

&НаСервере
// Процедура - Установить вид оплаты платежной картой.
//
Процедура УстановитьВидОплатыПлатежнойКартой()
	
	СцщВидыОплат = НайтиВДеревеДоступныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта);	
	Если НЕ ЗначениеЗаполнено(СцщВидыОплат) Тогда
		
		ДеревоОплаты                         = ВидыОплат.ПолучитьЭлементы();
		
		ЭлементДерева                        = ДеревоОплаты.Добавить();
		ЭлементДерева.Представление          = "Платежная карта";
		ЭлементДерева.НаименованиеВидаОплаты = "Платежная карта";
		ЭлементДерева.ТипДенежныхСредств     = Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта; 	
		ЭлементДерева.МаксСуммаСписания      = -1;
		
		ЭлементДерева.Контрагент             = ЭтотОбъект.Контрагент;
		ЭлементДерева.КассаОплаты            = ЭтотОбъект.Касса;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикНажатияВидыОплатВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаВыбраннойОплаты = СтрокаДанныхДереваПоИменеиЭлемента(Элемент.Имя, "ВидыОплат");
	МассивСтрокСВнесеннойОплатой = ПолучитьСтрокиСВнесеннойОплатой();
	
	Если ОбщегоНазначенияКлиентСерверСтоматология.НайтиВМассивеСтруктур(МассивСтрокСВнесеннойОплатой, "ТипДенежныхСредств", ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.СистемаБыстрыхПлатежей")) <> Неопределено
		ИЛИ СтрокаВыбраннойОплаты.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.СистемаБыстрыхПлатежей") И МассивСтрокСВнесеннойОплатой.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Смешанный тип оплаты недоступен для оплаты через систему быстрых платежей или ссылок на оплату");
		Возврат;
	КонецЕсли;
	
	Если СтрокаВыбраннойОплаты.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.СистемаБыстрыхПлатежей") Тогда		
		ПроверитьВозможностьОплатыСБП(СтрокаВыбраннойОплаты, Элемент); 
	Иначе		
		ВводСуммыОплаты(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик нажатия кнопка представление суммы.
//
Процедура ОбработчикНажатияКнопкаПредставлениеСуммы(Элемент)
	
	ПрефиксПоля = ИндексСтрокиДанныхДерваПоИменеиЭлемента(Элемент.Имя);
	
	ПолеРедСуммы = ВидыОплатСтрокаПолеВводаСуммы(ПрефиксПоля);
	
	НачатьРедактированияПоляВводаСуммы(ПолеРедСуммы);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик нажатия кнопка представление суммы.
//
Процедура ОбработчикНажатияКнопкаПрмиенитьРедактированиеСуммы(Элемент)
	
	ПрефиксПоля = ИндексСтрокиДанныхДерваПоИменеиЭлемента(Элемент.Имя);	
	ПолеВвода = ВидыОплатСтрокаПолеВводаСуммы(ПрефиксПоля);
		
	ЗавершитьРедактированияПоляВводаСуммы(ПолеВвода);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик нажатия кнопка удалить сумму.
//
Процедура ОбработчикНажатияКнопкаУдалитьСумму(Элемент)
	
	ПрефиксПоля = ИндексСтрокиДанныхДерваПоИменеиЭлемента(Элемент.Имя);
	
	ТекущиеДанные = СтрокаДанныхДереваПоИменеиЭлемента(Элемент.Имя, "ВидыОплат");
	ТекущиеДанные.Внесено             = 0;
	ТекущиеДанные.ОплачиваемаяСумма   = 0;
	
	ПолеВвода = ВидыОплатСтрокаПолеВводаСуммы(ПрефиксПоля);
			
	ЗавершитьРедактированияПоляВводаСуммы(ПолеВвода);
		
КонецПроцедуры

&НаКлиенте
// Функция вернет идентификатор строки данных по имени элемента.
//
Функция СтрокаДанныхДереваПоИменеиЭлемента(ИмяЭлемента, ИмяТаблицы)
	
	ИндексСтрокой = ИндексСтрокиДанныхДерваПоИменеиЭлемента(ИмяЭлемента);
	
	Если СтрНайти(ИндексСтрокой,"x") > 0 Тогда
		
		НомерСимвола = Найти(ИндексСтрокой,"x");
		ид1          = Лев(ИндексСтрокой, НомерСимвола - 1);
		ид2          = Прав(ИндексСтрокой, СтрДлина(ИндексСтрокой) - НомерСимвола); 
		
		Возврат  ЭтотОбъект[ИмяТаблицы].ПолучитьЭлементы()[Число(ид1)].ПолучитьЭлементы()[Число(ид2)];
		
	Иначе
		
		Возврат  ЭтотОбъект[ИмяТаблицы].ПолучитьЭлементы()[Число(ИндексСтрокой)]
		
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Функция вернет идентификатор строки данных по имени элемента.
//
Функция ИндексСтрокиДанныхДерваПоИменеиЭлемента(ИмяЭлемента)
	
	НомерСимвола = Найти(ИмяЭлемента,"_");
	Если НомерСимвола > 0 Тогда
		
		стрИд = Прав(ИмяЭлемента,СтрДлина(ИмяЭлемента) - НомерСимвола); 
		
		Возврат стрИд;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Процедура - Ввод суммы оплаты.
//
Процедура ВводСуммыОплаты(Элемент)
	
	СтрокаВыбраннойОплаты = СтрокаДанныхДереваПоИменеиЭлемента(Элемент.Имя, "ВидыОплат");
	
	ПрефиксПоля  = ИндексСтрокиДанныхДерваПоИменеиЭлемента(Элемент.Имя);
	ПолеРедСуммы = ВидыОплатСтрокаПолеВводаСуммы(ПрефиксПоля);
	
	ОтключитьОбработчикОжидания("ОбработчикТаймераКонтроляПотериФокусаПоляВводаСуммы");
	
	Если ТекущееПолеВВодаСуммыОплаты = ПолеРедСуммы Тогда
		ЗавершитьРедактированияПоляВводаСуммы(ПолеРедСуммы);
		Возврат;
	КонецЕсли;
	
	Если ПредПолеВВодаСуммыОплаты <> Неопределено Тогда	
		ЗавершитьРедактированияПоляВводаСуммы(ПредПолеВВодаСуммыОплаты);		
	КонецЕсли;			
	
	НачатьРедактированияПоляВводаСуммы(ПолеРедСуммы);
	
КонецПроцедуры

&НаКлиенте
// Функция - Получить поле ввода суммы.
//
Функция ВидыОплатСтрокаПолеВводаСуммы(ПрефиксИмени)
	
	ИмяПоляРодителья = "ПолеВидыОплатВводСуммыСтрока_";
	
	Возврат ЭтаФорма.Элементы.Найти(ИмяПоляРодителья + ПрефиксИмени);
	
КонецФункции 

&НаКлиенте
// Процедура - Обработчик таймера контроля потери фокуса поля ввода суммы.
//
Процедура ОбработчикТаймераКонтроляПотериФокусаПоляВводаСуммы()
	
	Если ТекущееПолеВВодаСуммыОплаты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Первое срабатываение
	Если ПредПолеВВодаСуммыОплаты = Неопределено Тогда
		
		ПредПолеВВодаСуммыОплаты = ТекущееПолеВВодаСуммыОплаты;
		ЭтаФорма.ТекущийЭлемент  = ТекущееПолеВВодаСуммыОплаты;
		
	КонецЕсли;
	
	// Поле все еще в фокусе ввода
	Если ПредПолеВВодаСуммыОплаты <> Неопределено 
		И ПредПолеВВодаСуммыОплаты.Видимость = Истина 
		И ЭтаФорма.ТекущийЭлемент = ПредПолеВВодаСуммыОплаты Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикТаймераКонтроляПотериФокусаПоляВводаСуммы",0.2, Истина);
		
		// Поле перестало быть в фокусе ввода
	ИначеЕсли ПредПолеВВодаСуммыОплаты <> Неопределено 
		И ПредПолеВВодаСуммыОплаты.Видимость = Истина Тогда
		
		ЗавершитьРедактированияПоляВводаСуммы(ПредПолеВВодаСуммыОплаты);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Завершить редактирования поля ввода суммы.
//
Процедура ЗавершитьРедактированияПоляВводаСуммы(ПолеВвода)
	
	ОтключитьОбработчикОжидания("ОбработчикТаймераКонтроляПотериФокусаПоляВводаСуммы");	
	ПрефиксПоля			= ИндексСтрокиДанныхДерваПоИменеиЭлемента(ПолеВвода.Имя);
	КнопкаПредСуммы		= ВидыОплатСтрокаКнопкаПредставленияСуммы(ПрефиксПоля);	
	ТекущиеДанные		= СтрокаДанныхДереваПоИменеиЭлемента(ПолеВвода.Имя, "ВидыОплат");	
	
	Если ТекущиеДанные.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.СистемаБыстрыхПлатежей") Тогда
		ТекущееПолеВводаСБП = ПолеВвода;
	КонецЕсли;
	
	ПолеВвода.Видимость = Ложь;
	
	Если ТекущиеДанные.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.СистемаБыстрыхПлатежей") Тогда
		ТекущееПолеВводаСБП = ПолеВвода;
	КонецЕсли;
	
	Если ТекущиеДанные.Внесено > 0 Тогда
		
		КнопкаПредСуммы.Заголовок     = Формат(ТекущиеДанные.Внесено,"ЧДЦ=2");
		КнопкаПредСуммы.Видимость     = Истина;
		
		КнопкаПрименияСуммы           = ВидыОплатСтрокаКнопкаПримененияРедактированияСуммы(ПрефиксПоля);
		КнопкаПрименияСуммы.Видимость = Ложь;
		
		КнопкаУдаленияСуммы           = ВидыОплатСтрокаКнопкаУдаленияСуммы(ПрефиксПоля);
		КнопкаУдаленияСуммы.Видимость = Истина;
		
	Иначе
		
		КнопкаПредСуммы.Заголовок     = "0,00";
		КнопкаПредСуммы.Видимость     = Ложь;
		
		КнопкаПрименияСуммы           = ВидыОплатСтрокаКнопкаПримененияРедактированияСуммы(ПрефиксПоля);
		КнопкаПрименияСуммы.Видимость = Ложь;
		
		КнопкаУдаленияСуммы           = ВидыОплатСтрокаКнопкаУдаленияСуммы(ПрефиксПоля);
		КнопкаУдаленияСуммы.Видимость = Ложь;
		
	КонецЕсли;
	
	Если ТекущееПолеВВодаСуммыОплаты = ПредПолеВВодаСуммыОплаты Тогда
		ТекущееПолеВВодаСуммыОплаты = Неопределено;
	КонецЕсли;
	
	ПредПолеВВодаСуммыОплаты = Неопределено;
	
	ЭтаФорма.ТекущийЭлемент = Элементы.Внести;
					
КонецПроцедуры 

&НаСервере
// Функция, рекурсивного поиска в дереве доступных видов оплаты.
//
Функция ПолучитьСтрокиСВнесеннойОплатойСервер(
	ТипДенСредств					= Неопределено,
	ЛицевойСчет						= Неопределено,								 
	ЭквайрингНомерПлатежнойКарты	= Неопределено,
	СертификатПартия				= Неопределено)
	
	МассивСтрок = Новый Массив;
	
	Для Каждого ЭлементВерхУр ИЗ ЭтотОбъект.ВидыОплат.ПолучитьЭлементы() Цикл	
		
		Если ЭлементВерхУр.Внесено > 0 Тогда
			
			Если ТипДенСредств <> Неопределено И ЭлементВерхУр.ТипДенежныхСредств <> ТипДенСредств
				ИЛИ ЛицевойСчет <> Неопределено И ЭлементВерхУр.ЛицевойСчет <> ЛицевойСчет
				ИЛИ ЭквайрингНомерПлатежнойКарты <> Неопределено И ЭлементВерхУр.ЭквайрингНомерПлатежнойКарты <> ЭквайрингНомерПлатежнойКарты
				ИЛИ СертификатПартия <> Неопределено И ЭлементВерхУр.СертификатПартия <> СертификатПартия Тогда
				
				Продолжить;
			КонецЕсли;
			
			МассивСтрок.Добавить(Новый Структура("ТипДенежныхСредств, Внесено", ЭлементВерхУр.ТипДенежныхСредств, ЭлементВерхУр.Внесено));
			
		КонецЕсли;
		
		Для Каждого ЭлементНизУр ИЗ ЭлементВерхУр.ПолучитьЭлементы() Цикл	
			
			Если ЭлементНизУр.Внесено > 0 Тогда
				
				Если ТипДенСредств <> Неопределено И ЭлементНизУр.ТипДенежныхСредств <> ТипДенСредств
					ИЛИ ЛицевойСчет <> Неопределено И ЭлементНизУр.ЛицевойСчет <> ЛицевойСчет
					ИЛИ ЭквайрингНомерПлатежнойКарты <> Неопределено И ЭлементНизУр.ЭквайрингНомерПлатежнойКарты <> ЭквайрингНомерПлатежнойКарты
					ИЛИ СертификатПартия <> Неопределено И ЭлементНизУр.СертификатПартия <> СертификатПартия Тогда
					
					Продолжить;
				КонецЕсли;
				
				МассивСтрок.Добавить(Новый Структура("ТипДенежныхСредств, Внесено", ЭлементВерхУр.ТипДенежныхСредств, ЭлементВерхУр.Внесено));
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат МассивСтрок;
	
КонецФункции

&НаКлиенте
// Функция, рекурсивного поиска в дереве доступных видов оплаты.
//
Функция ПолучитьСтрокиСВнесеннойОплатой(
	ТипДенСредств = Неопределено,
	ЛицевойСчет = Неопределено,								 
	ЭквайрингНомерПлатежнойКарты = Неопределено,
	СертификатПартия = Неопределено)
	
	МассивСтрок = Новый Массив;
	
	Для Каждого ЭлементВерхУр ИЗ ЭтотОбъект.ВидыОплат.ПолучитьЭлементы() Цикл	
		
		Если ЭлементВерхУр.Внесено > 0 Тогда
			
			Если ТипДенСредств <> Неопределено 
				И ЭлементВерхУр.ТипДенежныхСредств <> ТипДенСредств Тогда				
				Продолжить;
			КонецЕсли;	
			
			Если ЛицевойСчет <> Неопределено  			
				И ЭлементВерхУр.ЛицевойСчет <> ЛицевойСчет Тогда											
				Продолжить;
			КонецЕсли;
			
			Если ЭквайрингНомерПлатежнойКарты <> Неопределено  				
				И ЭлементВерхУр.ЭквайрингНомерПлатежнойКарты <> ЭквайрингНомерПлатежнойКарты Тогда													
				Продолжить;
			КонецЕсли;
			
			Если СертификатПартия <> Неопределено 				
				И ЭлементВерхУр.СертификатПартия <> СертификатПартия Тогда												
				Продолжить;
			КонецЕсли;
			
			МассивСтрок.Добавить(ЭлементВерхУр);
			
		КонецЕсли;
		
		Для Каждого ЭлементНизУр ИЗ ЭлементВерхУр.ПолучитьЭлементы() Цикл	
			
			Если ЭлементНизУр.Внесено > 0 Тогда
				
				Если ТипДенСредств <> Неопределено 
					И ЭлементНизУр.ТипДенежныхСредств <> ТипДенСредств Тогда				
					Продолжить;
				КонецЕсли;	
				
				Если ЛицевойСчет <> Неопределено  			
					И ЭлементНизУр.ЛицевойСчет <> ЛицевойСчет Тогда											
					Продолжить;
				КонецЕсли;
				
				Если ЭквайрингНомерПлатежнойКарты <> Неопределено  				
					И ЭлементНизУр.ЭквайрингНомерПлатежнойКарты <> ЭквайрингНомерПлатежнойКарты Тогда													
					Продолжить;
				КонецЕсли;
				
				Если СертификатПартия <> Неопределено 				
					И ЭлементНизУр.СертификатПартия <> СертификатПартия Тогда												
					Продолжить;
				КонецЕсли;
				
				МассивСтрок.Добавить(ЭлементНизУр);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат МассивСтрок;
	
КонецФункции

&НаКлиенте
// Функция - Получить кнопку представления суммы.
//
Функция ВидыОплатСтрокаКнопкаПредставленияСуммы(ПрефиксИмени)
	
	ИмяПоляРодителья = "КнопкаВидыОплатПредставлениеСуммыСтрока_";
	
	Возврат ЭтаФорма.Элементы.Найти(ИмяПоляРодителья + ПрефиксИмени);
	
КонецФункции

&НаКлиенте
// Функция - Получить кнопку применения редактирования суммы.
//
Функция ВидыОплатСтрокаКнопкаПримененияРедактированияСуммы(ПрефиксИмени)
	
	ИмяПоляРодителья = "КнопкаВидыОплатПрименитьеСуммуСтрока_";
	
	Возврат ЭтаФорма.Элементы.Найти(ИмяПоляРодителья + ПрефиксИмени);
	
КонецФункции

&НаКлиенте
// Процедура - Активизировать поле ввод суммы оплаты.
//
Процедура НачатьРедактированияПоляВводаСуммы(ПолеВвода)
	
	ОтключитьОбработчикОжидания("ОбработчикТаймераКонтроляПотериФокусаПоляВводаСуммы");
	
	Если ПредПолеВВодаСуммыОплаты <> Неопределено Тогда		
		ЗавершитьРедактированияПоляВводаСуммы(ПредПолеВВодаСуммыОплаты);		
	КонецЕсли;
	
	ТекущиеДанные = СтрокаДанныхДереваПоИменеиЭлемента(ПолеВвода.Имя, "ВидыОплат");
	
	ТекущееПолеВВодаСуммыОплаты           = ПолеВвода;	
	ТекущееПолеВВодаСуммыОплаты.Видимость = Истина;
	
	ПрефиксПоля = ИндексСтрокиДанныхДерваПоИменеиЭлемента(ПолеВвода.Имя);
	
	КнопкаПредСуммы = ВидыОплатСтрокаКнопкаПредставленияСуммы(ПрефиксПоля);
	КнопкаПредСуммы.Видимость = Ложь;
	
	КнопкаПрименияСуммы           = ВидыОплатСтрокаКнопкаПримененияРедактированияСуммы(ПрефиксПоля);
	КнопкаПрименияСуммы.Видимость = Истина;
	
	КнопкаУдаленияСуммы           = ВидыОплатСтрокаКнопкаУдаленияСуммы(ПрефиксПоля);
	КнопкаУдаленияСуммы.Видимость = Ложь;
	
	ВнесеноПередРедактированием = ТекущиеДанные.Внесено;
	
	ПодключитьОбработчикОжидания("ОбработчикТаймераКонтроляПотериФокусаПоляВводаСуммы",0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
// Функция - Получить кнопку удаления суммы.
//
Функция ВидыОплатСтрокаКнопкаУдаленияСуммы(ПрефиксИмени)
	
	ИмяПоляРодителья = "КнопкаВидыОплатУдалитьСуммуСтрока_";
	
	Возврат ЭтаФорма.Элементы.Найти(ИмяПоляРодителья + ПрефиксИмени);
	
КонецФункции

&НаСервере
// Процедура - устанавливает виды оплат на странице "Оплата".
//
Процедура УстановитьВидыОплатСервер(ОчищатьДеревоОплат = Ложь)
	
	ЭквайринговыйТерминал = Справочники.ЭквайринговыеТерминалы.ПолучитьЭквайринговыйТерминалПоУмолчанию(Касса);
	
	Если ОчищатьДеревоОплат = Истина Тогда
		
		ЭтотОбъект.ВидыОплат.ПолучитьЭлементы().Очистить();
		ЭтотОбъект.Сумма = 0;   		
	КонецЕсли;
		
	Если Справочники.Кассы.ПолучитьПризнакИспользованияВидаОплатыПоКассе(Касса, Перечисления.ТипыДенежныхСредств.Наличные) Тогда
		
		УстановитьВидОплатыНаличными();  		
	КонецЕсли;		
	
	Если НЕ ЭквайринговыйТерминал.Пустая()
		И Справочники.Кассы.ПолучитьПризнакИспользованияВидаОплатыПоКассе(Касса, Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта) Тогда 
		
		УстановитьВидОплатыПлатежнойКартой();
	КонецЕсли;	   	
	
	УстановитьВидОплатыСБП_И_СсылокНаОплату();
	
	ЭлементыДерева = ЭтотОбъект.ВидыОплат.ПолучитьЭлементы();
	Если ЭлементыДерева.Количество() > 0 Тогда
		Элементы.ГруппаОплата.Видимость = Истина;
		Элементы.ГруппаНетДоступныхВидовОплат.Видимость = Ложь;
		Если ЭлементыДерева[0].ПолучитьЭлементы().Количество() > 0 Тогда
			ЭлементыДерева.Вставить(0).Представление = "Заглушка";
		КонецЕсли;
	Иначе
		Элементы.ГруппаОплата.Видимость = Ложь;
		Элементы.ГруппаНетДоступныхВидовОплат.Видимость = Истина;
	КонецЕсли;
	
	СоздатьДинаимческуюТаблицуДоступныхВидовОплат();
	
КонецПроцедуры

&НаСервере
// Процедура - Построить динаимческую таблицу задолженностей.
//
Процедура СоздатьДинаимческуюТаблицуДоступныхВидовОплат()
	
	УдалитьДинаимеческиеЭлементыТаблицыДоступныхВидовОплат();
	
	ОсновнаяГруппа = ВидыОплатРодительскаяГруппаФормы();
	
	Для Каждого ВидОплатыВрУр ИЗ ЭтотОбъект.ВидыОплат.ПолучитьЭлементы() Цикл
		
		НомерСтрокиВрУр = ЭтотОбъект.ВидыОплат.ПолучитьЭлементы().Индекс(ВидОплатыВрУр);	
		
		Если ВидОплатыВрУр.ПолучитьЭлементы().Количество() = 0 Тогда
			
			Если НомерСтрокиВрУр = 0 Тогда
				
				Если ВидОплатыВрУр.Представление = "Заглушка" Тогда
					
					Элементы.ГруппаВидыОплатЗаголовокГруппировки_0.Видимость = Ложь;
					Продолжить;
					
				Иначе
					
					Элементы.ГруппаВидыОплатЗаголовокГруппировки_0.Видимость = Истина;
					
				КонецЕсли;
				
				Если ВидОплатыВрУр.Внесено = 0 Тогда
					
					Элементы.ДекорацияНаименованиеГруппировкиВидовОплат_0.Видимость = Ложь;
					Элементы.КнопкаВидыОплатаНаименованиеСтрока_0.Заголовок         = ВидОплатыВрУр.Представление;
					Элементы.ПолеВидыОплатВводСуммыСтрока_0.Видимость               = Ложь;
					Элементы.КнопкаВидыОплатПредставлениеСуммыСтрока_0.Видимость    = Ложь;
					Элементы.КнопкаВидыОплатПрименитьеСуммуСтрока_0.Видимость       = Ложь;
					Элементы.КнопкаВидыОплатУдалитьСуммуСтрока_0.Видимость          = Ложь;
					Элементы.ПолеВыбораВидаЛицевогоСчета_0.Видимость                = Ложь;
					
				КонецЕсли;
				
			Иначе
				
				СоздатьСтрокуДинаимческойТаблицыДоступныхВидовОплат(
				ОсновнаяГруппа,
				ВидОплатыВрУр.ПолучитьИдентификатор(),
				НомерСтрокиВрУр, 
				-1,
				ВидОплатыВрУр.Представление,
				Неопределено);
				
			КонецЕсли;
			
		Иначе
						
			ГруппаГруппировкиСтрок = СоздатьГруппировкуВидовОплат(ОсновнаяГруппа, НомерСтрокиВрУр, ВидОплатыВрУр.Представление);
						
			Для Каждого ВидОплатыНижУр ИЗ ВидОплатыВрУр.ПолучитьЭлементы() Цикл
				
				НомерСтрокиНижУр = ВидОплатыВрУр.ПолучитьЭлементы().Индекс(ВидОплатыНижУр);					
				
				Картинка = ?(ЗначениеЗаполнено(ВидОплатыНижУр.ЭквайринговыйТерминал), ПолучитьКартинкуСоответствияТипуШлюза(ВидОплатыНижУр.ЭквайринговыйТерминал), Неопределено);
				
				
				СоздатьСтрокуДинаимческойТаблицыДоступныхВидовОплат(
				ГруппаГруппировкиСтрок,
				ВидОплатыНижУр.ПолучитьИдентификатор(),
				"" + НомерСтрокиВрУр,
				НомерСтрокиНижУр,
				ВидОплатыНижУр.Представление,
				ВидОплатыВрУр.Представление,
				Картинка);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Функция - Создать группировку видов оплат.
// 
Функция СоздатьГруппировкуВидовОплат(ОсновнаяГруппа, НомерСтрокиДан, ЗаголовокГруппы)
	
	ГруппаГруппировкиВерхняя = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(
	ЭтаФорма,
	Элементы.ГруппаВидыОплатЗаголовокГруппировки_0,
	НомерСтрокиДан,
	ОсновнаяГруппа);
	
	ДекорацияЗаголовка =  УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(
	ЭтаФорма,
	Элементы.ДекорацияНаименованиеГруппировкиВидовОплат_0, 
	НомерСтрокиДан,
	Тип("ДекорацияФормы"),
	ГруппаГруппировкиВерхняя);
	
	ДекорацияЗаголовка.Заголовок = ЗаголовокГруппы;
	ДекорацияЗаголовка.Видимость = Истина;
	
	ГруппаГруппировкиНижняя = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(
	ЭтаФорма,
	Элементы.ГруппаВидыОплатГруппировка_0,
	НомерСтрокиДан,
	ГруппаГруппировкиВерхняя);
	
	Возврат ГруппаГруппировкиНижняя;
	
КонецФункции

&НаСервере
// Процедура - Удалить динаимеческие элементы состав занятия.
//
Процедура УдалитьДинаимеческиеЭлементыТаблицыДоступныхВидовОплат()
	
	ОснованаяГруппа = ВидыОплатРодительскаяГруппаФормы();
	
	Индекс = ОснованаяГруппа.ПодчиненныеЭлементы.Количество() - 1;
	Пока Индекс > 0  Цикл
		
		Элементы.Удалить(ОснованаяГруппа.ПодчиненныеЭлементы[Индекс]);		
		Индекс = Индекс - 1;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
// Функция - Виды оплат родительская группа формы.
// 
Функция ВидыОплатРодительскаяГруппаФормы()
	
	Возврат Элементы.ГруппаДинамическаяТабДоступныхВидовОплат;
	
КонецФункции

&НаСервере
// Процедура - Построить строку динаимческой таблицы задолженностей.
//
Процедура СоздатьСтрокуДинаимческойТаблицыДоступныхВидовОплат(ОсновнаяГруппа, ИдСтрокиДанных, НомерСтрокиДанВерхУр, НомерСтрокиДанНижУр, Заголовок, ЗаголовокГруппы, Картинка = Неопределено)
	
	НомерСтрокиДан = "" + НомерСтрокиДанВерхУр + ?(НомерСтрокиДанНижУр > -1, "x" + НомерСтрокиДанНижУр, "");
	
	ПодгуппаСтроки = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(
	ЭтаФорма,
	Элементы.ГруппаВидыОплатСтрока_0,
	НомерСтрокиДан,
	ОсновнаяГруппа);
	
	УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(
	ЭтаФорма,
	Элементы.КнопкаВидыОплатаНаименованиеСтрока_0, 
	НомерСтрокиДан,
	ПодгуппаСтроки,
	"ОбработчикНажатияВидыОплатВыбор",
	Заголовок,,,
	Картинка);
	
	ПодгуппаРедактирванияСуммы = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(
	ЭтаФорма,
	Элементы.ГруппаВидыОплатСуммаСтрока_0,
	НомерСтрокиДан,
	ПодгуппаСтроки);
	
	// Сумма оплаты
	СоздатьГруппуСуммыВнесеннойОплаты(ПодгуппаРедактирванияСуммы, ИдСтрокиДанных, НомерСтрокиДанВерхУр, НомерСтрокиДанНижУр);
	
КонецПроцедуры

&НаСервере
// Процедура - Построить группу суммы внесенной оплаты.
//
Процедура СоздатьГруппуСуммыВнесеннойОплаты(РодительскаяГруппа, ИдСтрокиДанных, НомерСтрокиДанВерхУр, НомерСтрокиДанНижУр)
	
	НомерСтрокиДан = "" + НомерСтрокиДанВерхУр + ?(НомерСтрокиДанНижУр > -1, "x" + НомерСтрокиДанНижУр, "");
	СтрокаДанных   = ЭтотОбъект.ВидыОплат.НайтиПоИдентификатору(ИдСтрокиДанных);
	
	Если СтрокаДанных.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные ИЛИ СтрокаДанных.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта  Тогда
				
		ПолеВводаСерииСертификатаИлиВидаЛС = УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(
		ЭтаФорма,
		Элементы.ПолеВыбораВидаЛицевогоСчета_0, 
		НомерСтрокиДан,
		Тип("ПолеФормы"), 
		РодительскаяГруппа,
		"ВидыОплат[" + НомерСтрокиДанВерхУр +"]" + ?(НомерСтрокиДанНижУр > -1, "[" + НомерСтрокиДанНижУр + "]", "") + ".ВыборВидаЛицевогоСчета");
		
		ПолеВводаСерииСертификатаИлиВидаЛС.Видимость = Истина;
		
	КонецЕсли;
	
	Если ПолеВводаСерииСертификатаИлиВидаЛС <> Неопределено Тогда 
		ПолеВводаСерииСертификатаИлиВидаЛС.Видимость = Ложь;         
	КонецЕсли;
	
	ПолеВводаОплаты = УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(
	ЭтаФорма,
	Элементы.ПолеВидыОплатВводСуммыСтрока_0, 
	НомерСтрокиДан,
	Тип("ПолеФормы"), 
	РодительскаяГруппа,
	"ВидыОплат[" + НомерСтрокиДанВерхУр +"]" + ?(НомерСтрокиДанНижУр > -1, "[" + НомерСтрокиДанНижУр + "]", "") + ".Внесено");
	
	ПолеВводаОплаты.Видимость = Ложь;
	
	КнопкаПредставления =  УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(
	ЭтаФорма,
	Элементы.КнопкаВидыОплатПредставлениеСуммыСтрока_0, 
	НомерСтрокиДан,
	РодительскаяГруппа);
	
	КнопкаПрименить =  УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(
	ЭтаФорма,
	Элементы.КнопкаВидыОплатПрименитьеСуммуСтрока_0, 
	НомерСтрокиДан,
	РодительскаяГруппа);
	
	КнопкаУдалить =  УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(
	ЭтаФорма,
	Элементы.КнопкаВидыОплатУдалитьСуммуСтрока_0, 
	НомерСтрокиДан,
	РодительскаяГруппа);
	
	СтрокаДанны = ЭтотОбъект.ВидыОплат.ПолучитьЭлементы()[Число(НомерСтрокиДанВерхУр)];
	Если Число(НомерСтрокиДанНижУр) > -1 Тогда
		СтрокаДанны = СтрокаДанны.ПолучитьЭлементы()[Число(НомерСтрокиДанНижУр)];
	КонецЕсли;
	
	Если СтрокаДанны.Внесено > 0 Тогда
		
		КнопкаПредставления.Заголовок = Формат(СтрокаДанны.Внесено,"ЧДЦ=2");
		КнопкаПредставления.Видимость = Истина;
		КнопкаПрименить.Видимость     = Ложь;
		КнопкаУдалить.Видимость       = Истина;
		
	Иначе
		
		КнопкаПредставления.Заголовок =  "0,00";
		КнопкаПредставления.Видимость = Ложь;
		КнопкаПрименить.Видимость     = Ложь;
		КнопкаУдалить.Видимость       = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - При изменении выбора кассы оплаты
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПриИзмененииВыбораКассыОплаты(Команда)
	
	Если Элементы.Найти(Команда.Имя).Заголовок = Строка(Касса) Тогда 
		Возврат;	
	КонецЕсли;  	
	
	ПриИзмененииВыбораСервер(Команда.Имя); // отрисовка выбранной кассы оплаты
	УстановитьВидыОплатСервер(Истина);	
	РасставитьПриоритетПечатиЧека();
	
	// ОбновитьФорму("ОБНОВИТЬ_ТАБЛИЦУ_ОПЛАТ", Истина);
	
	ПредПолеВводаСуммыОплаты = Неопределено;

	
КонецПроцедуры

&НаСервере
// Обновить таблицу задолженностей без перезагрузки ее элементов.
//
Процедура ПриИзмененииВыбораСервер(ЭлементИмя)
	
	Индекс = 0;
	
	Если СтрНайти(ЭлементИмя, "КассаОплаты") > 0 Тогда
		
		Для Каждого СтрокаТ ИЗ ДоступныеКассы Цикл
			
			Если ЭлементИмя = "КассаОплаты_" + Индекс Тогда
				
				ЭтаФорма.Элементы["КассаОплаты_" + Индекс].Доступность     = Истина;
				ЭтаФорма.Элементы["КассаОплаты_" + Индекс].ЦветТекста      = Новый Цвет(77,77,77); // Новый Цвет(51,102,187); 
				ЭтаФорма.Элементы["КассаОплаты_" + Индекс].Шрифт           = Новый Шрифт(ЭтаФорма.Элементы["КассаОплаты_" + Индекс].Шрифт,,11);
				ЭтаФорма.Элементы["ГруппаКассаОплатыКнопка_" + Индекс].ЦветФона  = Новый Цвет(242,242,242);   
				
				ЭтотОбъект.Касса = СтрокаТ.Касса;
				
			Иначе
				Если СтрокаТ.КассаДоступна Тогда
					ЭтаФорма.Элементы["КассаОплаты_" + Индекс].Доступность     = Истина;
					ЭтаФорма.Элементы["КассаОплаты_" + Индекс].ЦветТекста      = Новый Цвет(51,102,187);
					ЭтаФорма.Элементы["КассаОплаты_" + Индекс].Шрифт           = Новый Шрифт(ЭтаФорма.Элементы["КассаОплаты_" + Индекс].Шрифт,,11);
					ЭтаФорма.Элементы["ГруппаКассаОплатыКнопка_" + Индекс].ЦветФона  = Новый Цвет(255,255,255);
				КонецЕсли;
			КонецЕсли;
			
			Индекс = Индекс + 1;
			
		КонецЦикла;
				
	КонецЕсли;
	
	СостояниеКассовойСмены                 = РозничныеПродажи.ПолучитьСостояниеКассовойСмены(ЭтотОбъект.Касса);
	ЭтотОбъект.КассоваяСмена               = ?(СостояниеКассовойСмены <> Неопределено, СостояниеКассовойСмены.КассоваяСмена, Неопределено);
	
	ЭтотОбъект.Организация 				   = ЭтотОбъект.Касса.СтруктурнаяЕдиница.Организация;  
	ЭквайринговыйТерминал                  = Справочники.ЭквайринговыеТерминалы.ПолучитьЭквайринговыйТерминалПоУмолчанию(ЭтотОбъект.Касса);
	ЭтотОбъект.ТекущаяКассаИспользуетсяККТ = ЭтотОбъект.Касса.ВнешнееОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ 
	
КонецПроцедуры 

//&НаКлиенте
//// Реинициализация формы, сброс всех выбранных параметров
// Процедура ОбновитьФорму(Режим = "",ОчиститьРеквизитыОплаты = Ложь)
//	
//	// ОбновитьФормуСервер(Режим,ОчиститьРеквизитыОплаты);
//	 // ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы.ВидыОплат,ВидыОплат,Истина); 
// КонецПроцедуры	
 
&НаСервере
// Процедура - Построить динаимческую таблицу задолженностей.
//
Процедура ПостроитьДинамическиеЭлементы(ТипЭлемента)
	
	УдалитьДинамическиеЭлементы(ТипЭлемента);
	
	Индекс = 1;
	
	Если ТипЭлемента = "Касса" Тогда 
		
		// по 4 кассы в одной строке
		КолКассВСтроке				= 4;
		КолВыведенныхВСтрокуКасс	= 1;
		НомерСтрокиКассы			= 0;
		ФлагНоваяСтрока				= Ложь;
		
		Пока Индекс < ЭтотОбъект.ДоступныеКассы.Количество() Цикл
			
			ДанныеПоКассе = ЭтотОбъект.ДоступныеКассы[Индекс];
			ПостроитьЭлементыВыбораКассы(ДанныеПоКассе, Индекс, НомерСтрокиКассы, ФлагНоваяСтрока);
			ФлагНоваяСтрока = Ложь;
			
			Индекс = Индекс + 1;
			КолВыведенныхВСтрокуКасс = КолВыведенныхВСтрокуКасс + 1;
			Если КолВыведенныхВСтрокуКасс = КолКассВСтроке Тогда
				КолВыведенныхВСтрокуКасс	= 0;
				НомерСтрокиКассы			= НомерСтрокиКассы + 1; 
				ФлагНоваяСтрока				= Истина;
			КонецЕсли;			
			
		КонецЦикла;
		
		Если ЭтотОбъект.ДоступныеКассы.Количество() > 0 Тогда
			
			УстановитьСостояниеКнопкиВыбораКассы(Элементы.ГруппаКассаОплатыКнопка_0, Элементы.КассаОплаты_0);
			
		Иначе
			
			Элементы.КассаОплаты_0.Заголовок = "Нет доступных касс";
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Удалить динаимеческие элементы состав занятия.
//
Процедура УдалитьДинамическиеЭлементы(ТипЭлемента)
	
	ОснованаяГруппа = РодительскаяГруппа(ТипЭлемента);
	
	Индекс = ОснованаяГруппа.ПодчиненныеЭлементы.Количество() - 1;
	Пока Индекс > 0  Цикл
		
		Элементы.Удалить(ОснованаяГруппа.ПодчиненныеЭлементы[Индекс]);
		
		Индекс = Индекс - 1;
		
	КонецЦикла;  
	
КонецПроцедуры

&НаСервере
// Процедура - Построить строку динамической таблицы задолженностей.
//
Процедура ПостроитьЭлементыВыбораКассы(ДаныеКассы, ИндексДанных, НомерСтроки = 0, ФлагНоваяСтрока)
	
	НомерСтрокиДан   = ИндексДанных;  
	ОсновнаяГруппа   = РодительскаяГруппа("Касса");
	
	Если ФлагНоваяСтрока Тогда
		
		ПодгруппаНовойСтроки = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(
		ЭтаФорма,
		Элементы.Найти("ГруппаКассаОплатыСтроки_" + Строка(НомерСтроки - 1)), 
		НомерСтроки,
		ОсновнаяГруппа);
		
		ПодгруппаСтроки = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(
		ЭтаФорма,
		Элементы.Найти("ГруппаКассаОплаты_0"), 
		НомерСтрокиДан,
		ПодгруппаНовойСтроки); 
		
	Иначе
		
		ГруппаСтроки = Элементы.Найти("ГруппаКассаОплатыСтроки_" + Строка(НомерСтроки));

		ПодгруппаСтроки = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(
		ЭтаФорма,
		Элементы.Найти("ГруппаКассаОплаты_0"), 
		НомерСтрокиДан,
		ГруппаСтроки);  
		
	КонецЕсли;
	
	ПодгруппаКнопки = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(
	ЭтаФорма,
	Элементы.Найти("ГруппаКассаОплатыКнопка_0"), 
	НомерСтрокиДан,
	ПодгруппаСтроки);
	
	КнопкаВыбораКассы = УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(
	ЭтаФорма,
	Элементы.Найти("КассаОплаты_0"),  
	НомерСтрокиДан,
	ПодгруппаКнопки,,
	ДаныеКассы.Касса.Наименование);   	
	
	УстановитьСостояниеКнопкиВыбораКассы(ПодгруппаКнопки, КнопкаВыбораКассы);
	
КонецПроцедуры

&НаСервере
// Процедура - Установить состояние кнопки выбора кассы.
//
Процедура УстановитьСостояниеКнопкиВыбораКассы(ГруппаКнопки, КнопкаВыбора)
	
	ИндексДанных = ИндексСтрокиДанныхПоИмениЭлемента(ГруппаКнопки.Имя);
	
	ДанныеКассы       = ЭтотОбъект.ДоступныеКассы[ИндексДанных];  
	ЭтоВыбраннаяКасса = ДанныеКассы.Касса = ЭтотОбъект.Касса;  
	
	КнопкаВыбора.Доступность = НЕ ЭтоВыбраннаяКасса И ДанныеКассы.КассаДоступна;
	ГруппаКнопки.ЦветФона    = ?(ЭтоВыбраннаяКасса, Новый Цвет(242, 242, 242), Новый Цвет(255, 255, 255));// Новый Цвет(242, 242, 242) 	
	КнопкаВыбора.ЦветТекста  = ?(ЭтоВыбраннаяКасса,  Новый Цвет(77, 77, 77), Новый Цвет(51, 102, 187));  
	КнопкаВыбора.Шрифт       = ?(ЭтоВыбраннаяКасса, Новый Шрифт(КнопкаВыбора.Шрифт, , 11), Новый Шрифт(КнопкаВыбора.Шрифт, , 11)); 	
	КнопкаВыбора.Заголовок   = ДанныеКассы.Касса.Наименование;
	КнопкаВыбора.Вид         = ВидКнопкиФормы.ОбычнаяКнопка;
	
КонецПроцедуры

&НаСервере
// Функция - Выбор касс родительская группа.
// 
Функция РодительскаяГруппа(ТипЭлемента)
	
	Возврат ?(ТипЭлемента = "Касса", Элементы.ГруппаВыборКассыДляОплаты, Элементы.ГруппаВыборСтруктурнойЕдиницы);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Функция вернет идентификатор строки данных по имени элемента.
//
Функция ИндексСтрокиДанныхПоИмениЭлемента(ИмяЭлемента)
	
	НомерСимвола = Найти(ИмяЭлемента,"_");
	Если НомерСимвола > 0 Тогда
		
		стрИд = Число(Прав(ИмяЭлемента,СтрДлина(ИмяЭлемента) - НомерСимвола)); 
		
		Возврат Число(стрИд);
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте  
// Процедура нажатия использования телефона.
//
Процедура КонтактыКлиентаИспользоватьТелефон(Команда)
	
	Элементы.ГруппаКонтактыКлиентаТелефон.Видимость       = Истина;
	Элементы.КонтактыКлиентаИспользоватьТелефон.Видимость = Ложь;
	
	ЭтотОбъект.ЧекККОтправитьНаТелефон = Истина;
КонецПроцедуры

&НаКлиенте        
// Процедура нажатия использования почты.
//
Процедура КонтактыКлиентаИспользоватьПочту(Команда)
	
	Элементы.ГруппаКонтактыКлиентаПочта.Видимость       = Истина;
	Элементы.КонтактыКлиентаИспользоватьПочту.Видимость = Ложь;
	
	ПодключитьОбработчикОжидания("УстановитьФокусПоляКонтактыКлиентаПочтаТаймер", 0.1, Истина);
	
	ЭтотОбъект.ЧекККОтправитьНаПочту = Истина;

КонецПроцедуры     

&НаКлиенте
// Процедура - Установить фокус поля контакты клиента почта таймер.
//
Процедура УстановитьФокусПоляКонтактыКлиентаПочтаТаймер()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.КонтактыКлиентаПочта;
	
КонецПроцедуры

&НаСервере
// Процедура - Расставить приоритет печати чека
//
Процедура РасставитьПриоритетПечатиЧека()
	
		Если ЗначениеЗаполнено(Этотобъект.Касса) Тогда
		ПриоритетЭлектронногоЧека = Этотобъект.Касса.ПриоритетЭлектронногоЧека; //0 - выключен, 1 -  Email, Телефон, 2 - Email. 	 
	КонецЕсли;
	
	ЭтотОбъект.ЧекПечатать = ПриоритетЭлектронногоЧека = 0; 
	
	Если ПриоритетЭлектронногоЧека = 0 Тогда                                        //0 - выключен.
		
		Элементы.ГруппаКонтактыКлиентаТелефон.Видимость			= Ложь;
		Элементы.КонтактыКлиентаИспользоватьТелефон.Видимость 	= Истина;
		ЭтотОбъект.ЧекККОтправитьНаТелефон 						= Ложь;
		
		Элементы.ГруппаКонтактыКлиентаПочта.Видимость 			= Ложь;
		Элементы.КонтактыКлиентаИспользоватьПочту.Видимость 	= Истина;
		ЭтотОбъект.ЧекККОтправитьНаПочту 						= Ложь;
		
	ИначеЕсли ПриоритетЭлектронногоЧека = 1 Тогда                                  	//1 -  Email, Телефон. 
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ЧекККТПочта) Тогда         
			
			Элементы.ГруппаКонтактыКлиентаПочта.Видимость 			= Истина;
			Элементы.КонтактыКлиентаИспользоватьПочту.Видимость 	= Ложь;
			ЭтотОбъект.ЧекККОтправитьНаПочту 						= Истина;
			
		ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.ЧекККТТелефон) Тогда
			
			Элементы.ГруппаКонтактыКлиентаТелефон.Видимость			= Истина;
			Элементы.КонтактыКлиентаИспользоватьТелефон.Видимость 	= Ложь;
			ЭтотОбъект.ЧекККОтправитьНаТелефон 						= Истина;
		Иначе 
			ЭтотОбъект.ЧекПечатать = Истина; 
		КонецЕсли;
		
	ИначеЕсли ПриоритетЭлектронногоЧека = 2 Тогда                                    //2 - Email.
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ЧекККТПочта) Тогда	
			Элементы.ГруппаКонтактыКлиентаПочта.Видимость 			= Истина;
			Элементы.КонтактыКлиентаИспользоватьПочту.Видимость 	= Ложь;
			ЭтотОбъект.ЧекККОтправитьНаПочту 						= Истина;
		Иначе 
			ЭтотОбъект.ЧекПечатать = Истина; 
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Процедура скрывает поле почты.
//
Процедура КонтактыКлиентаУдалитьПочту(Команда)
	
	Элементы.ГруппаКонтактыКлиентаПочта.Видимость       = Ложь;
	Элементы.КонтактыКлиентаИспользоватьПочту.Видимость = Истина;
	
	ЭтотОбъект.ЧекККОтправитьНаПочту = Ложь;

КонецПроцедуры

&НаКлиенте   
// Процедура скрывает поле телефон.
//
Процедура КонтактыКлиентаУдалитьТелефон(Команда) 
	
	Элементы.ГруппаКонтактыКлиентаТелефон.Видимость       = Ложь;
	Элементы.КонтактыКлиентаИспользоватьТелефон.Видимость = Истина;
	
	ЭтотОбъект.ЧекККОтправитьНаТелефон = Ложь;

КонецПроцедуры

#Область Ссылки_и_СБП

&НаСервере
// Процедура - Установить вид оплаты СБП
//
Процедура УстановитьВидОплатыСБП_И_СсылокНаОплату()
	
	ТаблицаЭТ = Справочники.ЭквайринговыеТерминалы.ПолучитьЭквайринговыеТерминалыСБП_И_СсылокНаОплату(ЭтотОбъект.Касса, ЭтотОбъект.СтруктурнаяЕдиница, Истина);	
	
	Если ТаблицаЭТ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	СущВидыОплатВерхУр = НайтиВДеревеДоступныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.СистемаБыстрыхПлатежей,,,,,, Справочники.ЭквайринговыеТерминалы.ПустаяСсылка());
	
	Если НЕ ЗначениеЗаполнено(СущВидыОплатВерхУр) Тогда
		
		ЭлементДереваЭТ                    = ЭтотОбъект.ВидыОплат.ПолучитьЭлементы().Добавить();
		ЭлементДереваЭТ.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.СистемаБыстрыхПлатежей; 
		ЭлементДереваЭТ.Представление      = НСтр("ru = 'Система быстрых платежей и ссылки на оплату'; en = 'Fast payment system and payment links'");  
		
	Иначе
		ЭлементДереваЭТ = СущВидыОплатВерхУр[0];
	КонецЕсли;
		
	Для Каждого СтрокаТ ИЗ ТаблицаЭТ Цикл
				
		СущВидыОплатНижнУр = НайтиВДеревеДоступныхВидовОплатСервер(Перечисления.ТипыДенежныхСредств.СистемаБыстрыхПлатежей,,,,,, СтрокаТ.ЭквайринговыйТерминал);
		
		НоваяСтрока = ?(ЗначениеЗаполнено(СущВидыОплатНижнУр), СущВидыОплатНижнУр[0], ЭлементДереваЭТ.ПолучитьЭлементы().Добавить());
		
		НоваяСтрока.ЭквайринговыйТерминал  = СтрокаТ.ЭквайринговыйТерминал;
		НоваяСтрока.Контрагент	           = ЭтотОбъект.Контрагент;
		НоваяСтрока.КассаОплаты            = ЭтотОбъект.Касса;
		НоваяСтрока.ТипДенежныхСредств     = Перечисления.ТипыДенежныхСредств.СистемаБыстрыхПлатежей;
		НоваяСтрока.МаксСуммаСписания      = -1;
		НоваяСтрока.НаименованиеВидаОплаты = СтрокаТ.Наименование;
		НоваяСтрока.Представление		   = СтрокаТ.Наименование;
				
	КонецЦикла;
			
КонецПроцедуры

&НаСервере
// Функция - Получить картинку соответствия типу шлюза
//
// Параметры:
//  ЭквайринговыйТерминал	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКартинкуСоответствияТипуШлюза(ЭквайринговыйТерминал)
	
	ТипШлюза = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭквайринговыйТерминал, "ТипБанка"); 
	
	Если ТипШлюза = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипШлюза = Перечисления.ПлатежныеШлюзы.СБПАльфаБанк ИЛИ ТипШлюза = Перечисления.ПлатежныеШлюзы.СБПРайффайзенБанк 
		ИЛИ ТипШлюза = Перечисления.ПлатежныеШлюзы.СБПТинькофф ИЛИ ТипШлюза = Перечисления.ПлатежныеШлюзы.СБПСбербанк 
		ИЛИ ТипШлюза = Перечисления.ПлатежныеШлюзы.СБПСДМ Тогда
		Возврат БиблиотекаКартинок.СсылкиНаОплату_СБП_32;
	ИначеЕсли ТипШлюза = Перечисления.ПлатежныеШлюзы.Сбербанк ИЛИ ТипШлюза = Перечисления.ПлатежныеШлюзы.СбербанкПлатиQR Тогда
		Возврат БиблиотекаКартинок.СсылкиНаОплату_СберБанк_32;
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Процедура - Проверить возможность оплаты СБП
//
Процедура ПроверитьВозможностьОплатыСБП(СтрокаВыбраннойОплаты, Элемент)
	
	Если Не ЗначениеЗаполнено(СтрокаВыбраннойОплаты.Контрагент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Клиент не заполнен");
		Возврат;
	КонецЕсли;
	
	Если СуммаВнесенныхВидовОплатСервер() <> 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Смешанный тип оплаты недоступен для оплаты через систему быстрых платежей или ссылок на оплату");
		Возврат;		
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ЭтотОбъект.Касса) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Не указана касса, оплата невозможна!';en='Not indicated cashbox payment impossible!'"));  
		Возврат;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ЭтотОбъект.ВидЛицевогоСчета) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Не указан вид лицевой счета который будет создан!';en='Not specified view facial accounts which willbe created by!'"));
		Возврат;
				
	КонецЕсли;
	
	СтруктураПараметров = ПолучитьПараметрыДляПроверки(СтрокаВыбраннойОплаты.ЭквайринговыйТерминал);
		
	Если СтруктураПараметров.СсылкаСформированаПоДругомуШлюзу Тогда 		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураПараметров.ОписаниеОшибки);
		Возврат;				
	КонецЕсли;
	
	Если СтруктураПараметров.СсылкаПолучена Тогда	
		ОткрытьФормуСБП(СтруктураПараметров);		
	Иначе		
		ВводСуммыОплаты(Элемент);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - Получить параметры для проверки
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПараметрыДляПроверки(СбпЭквайринговыйТерминал)
	
	ДокументыЗадолженности = Новый Массив;
	ДокументыЗадолженности.Добавить(ВидЛицевогоСчета);
	
	Выборка			= РегистрыСведений.СтатусыОплатыЗаказов.ПолучитьСсылкуНаОплату(ДокументыЗадолженности, СбпЭквайринговыйТерминал);
	СсылкаПолучена	= Выборка <> Неопределено;			
	СсылкаСформированаПоДругомуШлюзу = СсылкаПолучена И Выборка.СсылкаЭТ <> СбпЭквайринговыйТерминал;
	
	ОписаниеОшибки	= "";
	Если СсылкаСформированаПоДругомуШлюзу Тогда
		ОписаниеОшибки = СтрШаблон("Ссылка уже сформирована по эквайринговому терминалу: %1. Необходимо отменить существующую ссылку", Выборка.ЭквайринговыйТерминал);
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ТипБанка"							, ОбщегоНазначения.ПолучитьЗначениеРеквизита(СбпЭквайринговыйТерминал, "ТипБанка"));	
	СтруктураПараметров.Вставить("СсылкаСформированаПоДругомуШлюзу"	, СсылкаСформированаПоДругомуШлюзу);
	СтруктураПараметров.Вставить("ОписаниеОшибки"                   , ОписаниеОшибки);
	СтруктураПараметров.Вставить("СсылкаПолучена"                   , СсылкаПолучена);
	СтруктураПараметров.Вставить("НомерЗаказа"                   	, ?(СсылкаПолучена, Выборка.НомерЗаказа, Неопределено));
	  
	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиенте
// Процедура - Открыть форму СБП
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
//
Процедура ОткрытьФормуСБП(СтруктураПараметров)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораСБП", ЭтотОбъект, СтруктураПараметров);
	ОткрытьФорму("Обработка.ПомощникПроведенияОплаты.Форма.ФормаОтправкиПлатежейСБП", СтруктураПараметров,,,,, ОписаниеОповещения);	
КонецПроцедуры

&НаКлиенте
// Процедура - После выбора СБП
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПослеВыбораСБП(Результат, ДополнительныеПараметры) Экспорт	
	
	Если Результат <> Неопределено И Результат.ОбновитьИнформациюОСсылкахНаОплату И Не Результат.ОтменаСсылки И ЭтаФорма.Открыта() Тогда
		
		ЭтаФорма.Закрыть();	
		
	ИначеЕсли ТекущееПолеВводаСБП <> Неопределено Тогда
		
		ТекущееПолеВводаСуммыОплаты = Неопределено;
		ОбработчикНажатияКнопкаУдалитьСумму(ТекущееПолеВводаСБП);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Функция - Завершить ввод суммы оплаты СБП
//
// Параметры:
//  СтрокаДанных - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Процедура ЗавершитьВводСуммыОплатыСБП(СтрокаВыбраннойОплаты)
	
	Если СтрокаВыбраннойОплаты.Внесено = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внесенная сумма должна быть больше нуля");
		Возврат;
	КонецЕсли;
		
	СтруктураПараметров = ПолучитьПараметрыДляПроверки(СтрокаВыбраннойОплаты.ЭквайринговыйТерминал);
	
	МассивЗадолженностей = Новый Массив;
	МассивЗадолженностей.Добавить(Новый Структура("ДокументЗадолженности, Задолженность", ВидЛицевогоСчета, СтрокаВыбраннойОплаты.Внесено));
	
	СтруктураПараметров.Вставить("МассивЗадолженностей"		, МассивЗадолженностей);
	СтруктураПараметров.Вставить("КассаОплаты"				, СтрокаВыбраннойОплаты.КассаОплаты);
	СтруктураПараметров.Вставить("Контрагент"				, СтрокаВыбраннойОплаты.Контрагент);
	СтруктураПараметров.Вставить("СтруктурнаяЕдиница"		, ЭтотОбъект.СтруктурнаяЕдиница);
	СтруктураПараметров.Вставить("Организация"				, ЭтотОбъект.Организация);
	СтруктураПараметров.Вставить("ЭквайринговыйТерминал"	, СтрокаВыбраннойОплаты.ЭквайринговыйТерминал);
	СтруктураПараметров.Вставить("СуммаОплаты"				, СтрокаВыбраннойОплаты.Внесено);	
	
	ОткрытьФормуСБП(СтруктураПараметров);
	
КонецПроцедуры

&НаСервере
// Функция рекурсивного поиска в дереве доступных видов оплаты.
// 
Функция СуммаВнесенныхВидовОплатСервер(
	ТипДенСредств = Неопределено,
	ЛицевойСчет = Неопределено,
	ЭквайрингНомерПлатежнойКарты = Неопределено,
	СертификатПартия = Неопределено)
	
	МассивСтрок =  ПолучитьСтрокиСВнесеннойОплатойСервер(ТипДенСредств, ЛицевойСчет, ЭквайрингНомерПлатежнойКарты, СертификатПартия);
	
	ВремСумма = 0;
	Для Каждого СтрокаОплаты ИЗ МассивСтрок Цикл		
		ВремСумма = ВремСумма + СтрокаОплаты.Внесено;	
	КонецЦикла;
	
	Возврат ВремСумма;
	
КонецФункции

&НаСервере
// Процедура - Обновить доступные кассы
//
// Параметры:
//  врДоступныеКассы - 	 - 
//
Процедура ОбновитьДоступныеКассыДляСсылокИСбп(врДоступныеКассы)
	
	ТаблицаКасс = Справочники.Кассы.ПолучитьКассыСсылокНаОплатуИСбп(СтруктурнаяЕдиница);
	
	Для Каждого СтрокаТЗ Из ТаблицаКасс Цикл
		
		НайденнаяСтрока = ОбщегоНазначенияКлиентСерверСтоматология.НайтиВМассивеСтруктур(врДоступныеКассы, "Касса", СтрокаТЗ.Касса);
		
		Если НайденнаяСтрока = Неопределено Тогда
			СтруктураДанных = Новый Структура("ИспользуетсяОнлайн,Касса,КассаДоступна,ФРИспользуется");
			ЗаполнитьЗначенияСвойств(СтруктураДанных, СтрокаТЗ); 
			врДоступныеКассы.Добавить(СтруктураДанных);
		Иначе
			НайденнаяСтрока.ИспользуетсяОнлайн = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	врДоступныеКассы = ОтсортироватьМассивСтруктур(врДоступныеКассы);
	
КонецПроцедуры

&НаСервере
// Функция - Отсортировать массив структур
//
// Параметры:
//  МассивСтруктур	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОтсортироватьМассивСтруктур(МассивСтруктур)
	
	ТаблицаКасс = Новый ТаблицаЗначений;
	ТаблицаКасс.Колонки.Добавить("ИспользуетсяОнлайн");
	ТаблицаКасс.Колонки.Добавить("Касса");
	ТаблицаКасс.Колонки.Добавить("КассаДоступна");
	ТаблицаКасс.Колонки.Добавить("ФРИспользуется");
		
	Для Каждого Строка Из МассивСтруктур Цикл
		НоваяСтрока = ТаблицаКасс.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	ТаблицаКасс.Сортировать("ФРИспользуется Убыв, КассаДоступна Убыв");  
	
	МассивСтруктурВозврат = Новый Массив;
	
	Для Каждого Строка Из ТаблицаКасс Цикл
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("ИспользуетсяОнлайн"	, Строка.ИспользуетсяОнлайн);
		СтруктураСтроки.Вставить("Касса"				, Строка.Касса);
		СтруктураСтроки.Вставить("КассаДоступна"		, Строка.КассаДоступна);
		СтруктураСтроки.Вставить("ФРИспользуется"		, Строка.ФРИспользуется);
		МассивСтруктурВозврат.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат МассивСтруктурВозврат;
	
КонецФункции

#КонецОбласти

#КонецОбласти
