 
#Область СлужебныеПроцедурыИФункции 
 
// Обновить индекс поиска
//
&НаКлиенте
Процедура ОбновитьИндексВыполнить()
	
	Состояние(НСтр("ru = 'Идет обновление полнотекстового индекса...
					|Пожалуйста, подождите.'"));
	ОбновитьИндексСервер();
	ОбновитьСтатус();
	Состояние(НСтр("ru = 'Обновление полнотекстового индекса завершено.'"));
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИндексСервер()
	ПолнотекстовыйПоиск.ОбновитьИндекс(Ложь, Ложь);
КонецПроцедуры

// Очистить индекс
//
&НаСервере
Процедура ОчиститьИндексСервер() 
	ПолнотекстовыйПоиск.ОчиститьИндекс();
КонецПроцедуры	

// Очистить индекс
&НаКлиенте
Процедура ОчиститьИндексВыполнить()
	ОчиститьИндексСервер();	
	ОбновитьСтатус();
КонецПроцедуры

// Обновить статус - доступность кнопок, дата актуальности индекса.
&НаСервере
Процедура ОбновитьСтатус()
	РазрешитьПолнотекстовыйПоиск = ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить;
	Если РазрешитьПолнотекстовыйПоиск Тогда
		ДатаАктуальностиИндекса = ПолнотекстовыйПоиск.ДатаАктуальности();
		ИндексАктуален = ПолнотекстовыйПоиск.ИндексАктуален();
	КонецЕсли;	
	
	СтатусИндекса = "";
	
	Если РазрешитьПолнотекстовыйПоиск Тогда
		Если ИндексАктуален Тогда
			СтатусИндекса = НСтр("ru = 'Обновление индекса не требуется'");
		Иначе
			СтатусИндекса = НСтр("ru = 'Требуется обновление индекса'");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Установить режим полнотекстового поиска 
&НаСервереБезКонтекста
Процедура УстановитьПолнотекстовыйПоискРазрешен(Разрешен) 
	Если Разрешен Тогда
		ПолнотекстовыйПоиск.УстановитьРежимПолнотекстовогоПоиска(РежимПолнотекстовогоПоиска.Разрешить);
		Константы.ИспользоватьПолнотекстовыйПоиск.Установить(Истина);
	Иначе
		ПолнотекстовыйПоиск.УстановитьРежимПолнотекстовогоПоиска(РежимПолнотекстовогоПоиска.Запретить);
		Константы.ИспользоватьПолнотекстовыйПоиск.Установить(Ложь);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РазрешитьПолнотекстовыйПоискПриИзменении(Элемент)
	Попытка
		УстановитьПолнотекстовыйПоискРазрешен(РазрешитьПолнотекстовыйПоиск);
		ОбновитьИнтерфейс();
	Исключение
		РазрешитьПолнотекстовыйПоиск = НЕ РазрешитьПолнотекстовыйПоиск;
		Инфо = ИнформацияОбОшибке();
		ПоказатьПредупреждение(,Инфо.Описание + "." + Символы.ВК + НСтр("ru = 'Вероятно, запущено регламентное задание обновления индекса. Попробуйте еще раз некоторое время спустя.'"));
	КонецПопытки;
	
	ОбновитьСтатус();
КонецПроцедуры

#КонецОбласти

 #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСтатус();
КонецПроцедуры

#КонецОбласти
