
#Область ОписаниеПеременных

&НаКлиенте
Перем Документ;   

#КонецОбласти

#Область ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура, обработчки события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработкиСтоматология.ПриСозданииНаСервере(ЭтаФорма);	
	
	ЭтоНовыйДокумент = Объект.Ссылка.Пустая();
	ПисьмоОтправлено = ?(ЭтоНовыйДокумент, Ложь, (Объект.СтатусПисьма = Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Отправлено));
	
	Если ЭтоНовыйДокумент Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
			
			Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;	
			
		КонецЕсли;
		
		Если Параметры.Свойство("ЗначенияЗаполнения") И Параметры.ЗначенияЗаполнения.Свойство("ШаблонПисьма") Тогда
			
			ВыбранныйШаблон = Параметры.ЗначенияЗаполнения.ШаблонПисьма;
			Объект.ТекстHTML = ВыбранныйШаблон.ТекстHTML;
			
		КонецЕсли;
		
		 // Необходимо для отправки с формы клиента
		 Если Параметры.Свойство("Получатель") И Параметры.Свойство("АдресЭП") 
		   И ЗначениеЗаполнено(Параметры.Получатель) И ЗначениеЗаполнено(Параметры.АдресЭП) Тогда
		   
		   Получатель               = Объект.ПолучателиПисьма.Добавить();
		   Получатель.Адрес         = Параметры.АдресЭП; 
		   Получатель.Контакт       = Параметры.Получатель;
		   Получатель.Представление = Параметры.Получатель.Наименование;
		   
		   СформироватьПредставленияКонтактов(); 
		   
		 КонецЕсли;
		
		ОбработатьИзменяемыеЗначения();
		
	КонецЕсли;
	
	// Формирует переключатель закладок
	СтруктураМеню = Новый Структура;
	СтруктураМеню.Вставить("Письмо"  , "ГруппаПисьмо");
	СтруктураМеню.Вставить("Шаблоны" , "ГруппаШаблоны");
	СтруктураМеню.Вставить("Свойства", "ГруппаСвойства");
	
	ОбработкаТабличныхЧастейКлиент.СоздатьМенюДокумента(ЭтаФорма, СтруктураМеню, "ГруппаПереключательЗакладок");
	
	#Область Обработка_вложений_письма
	
	Если ЭтоНовыйДокумент Тогда
		
		ПереноситьВложения = Ложь;
		Если Параметры.Свойство("ПереноситьВложения") Тогда
			ПереноситьВложения = Параметры.ПереноситьВложения;
		КонецЕсли;
		
		Если ПереноситьВложения Тогда
			ПеренестиВложенияИзДругогоПисьма(Объект.Предмет);
		ИначеЕсли Параметры.Свойство("ЗначенияЗаполнения") И Параметры.ЗначенияЗаполнения.Свойство("Вложения") Тогда
			// Заполняем переданные вложения
			ТаблицаВложений = ДанныеФормыВЗначение(Вложения, Тип("ТаблицаЗначений"));
			Для Каждого ПереданноеВложение Из Параметры.ЗначенияЗаполнения.Вложения Цикл
				СтрокаВложения 						= ТаблицаВложений.Добавить();
				СтрокаВложения.ИмяФайла 			= ПереданноеВложение.Представление;
				СтрокаВложения.ИмяФайлаНаКомпьютере = ПереданноеВложение.Значение;
				Расширение = ФайловыеФункцииКлиентСервер.ПолучитьРасширениеФайла(СтрокаВложения.ИмяФайла);
				СтрокаВложения.ИндексКартинки 		= РаботаСФайламиСлужебныйКлиентСервер.ПолучитьИндексПиктограммыФайла(Расширение);
				СтрокаВложения.Расположение 		= 4;	// из временного хранилища
			КонецЦикла;
			ЗначениеВДанныеФормы(ТаблицаВложений, Вложения);
		КонецЕсли;
		
	Иначе
		
		ПолучитьВложенияПисьма();
		
	КонецЕсли;
	
	#КонецОбласти //Область Обработка_вложений_письма
	
	
	УстановитьСписокВыбораДоступныхУчетныхЗаписей();
	// Сохранение вводимых значений
	СохранениеВводимыхЗначений.ЗаполнитьСписокВыбора(ЭтаФорма, ЭлементыДляСохранения(), ЭтаФорма.ИмяФормы);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Документ = Элементы.ПолеHTMLДокумента.Документ;
	Объект.ТекстHTML = ?(Документ.body.innerHTML = "", "&nbsp;", Документ.body.innerHTML);
	Объект.Текст	 =   Документ.body.innerText;
	
	// Операции с вложениями
	#Если Не ВебКлиент Тогда
	Для Каждого Стр Из Вложения Цикл
		Если Стр.Расположение = 2 Тогда
			Данные = Новый ДвоичныеДанные(Стр.ИмяФайлаНаКомпьютере);
			Стр.ИмяФайлаНаКомпьютере = ПоместитьВоВременноеХранилище(Данные, "");
			Стр.Расположение = 4;
		КонецЕсли;
	КонецЦикла;
	#КонецЕсли

	Объект.ЕстьВложения = (Вложения.Количество() <> 0);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Если письмо адресуется только одному получателю, и он в поле "Кому" - пишем его в реквизит Предмет
	КоличествоПолучателей = ТекущийОбъект.ПолучателиПисьма.Количество();
	КоличествоПолучателейКопий = ТекущийОбъект.ПолучателиКопий.Количество() + ТекущийОбъект.ПолучателиСкрытыхКопий.Количество();
		
	Если КоличествоПолучателей = 1 И КоличествоПолучателейКопий = 0 Тогда
		ТекущийОбъект.Предмет = Объект.ПолучателиПисьма[0].Контакт;
	Иначе
		ТекущийОбъект.Предмет = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ТекстHTML) Тогда
		Объект.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
	Иначе
		Объект.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗаписатьВложения();
	Оповестить("ИзмененоЭлектронноеПисьмо", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Заголовок= "Введите текст!";
	Список = Элементы.КомандаformatBlock.СписокВыбора;
	Список.Добавить("<p>", "Обычный");
	Список.Добавить("<h1>", "Заголовок 1");
	Список.Добавить("<h2>", "Заголовок 2");
	Список.Добавить("<h3>", "Заголовок 3");
	Список.Добавить("<h4>", "Заголовок 4");
	Список.Добавить("<h5>", "Заголовок 5");
	Список.Добавить("<h6>", "Заголовок 6");
	Список.Добавить("<pre>", "Форматированный");
	Список.Добавить("<address>", "Адрес");
	ТекЭлемент = Список.НайтиПоИдентификатору(0);
	СтилиТекста = ТекЭлемент.Значение;

	// Заполнение списка шрифтов
	Список = Элементы.КомандаFontName.СписокВыбора;
	Список.Добавить("Arial");
	Список.Добавить("Arial Black");
	Список.Добавить("Arial Narrow");
	Список.Добавить("Comic Sans MS");
	Список.Добавить("Courier New");
	Список.Добавить("System");
	Список.Добавить("Tahoma");
	Список.Добавить("Times New Roman");
	Список.Добавить("Verdana");
	Список.Добавить("Wingdings");
	ТекЭлемент = Список.НайтиПоИдентификатору(0);
    ИмяШрифта = ТекЭлемент.Значение;
	
	// *** Установка видимости элементов
	УстановитьВидимостьЭлементов();
	
	// Заполнение списка размеров
	Список = Элементы.КомандаFontSize.СписокВыбора;
	Для Ном = 1 По 14 Цикл
		Список.Добавить(Ном);
	КонецЦикла;
	ТекЭлемент = Список.НайтиПоИдентификатору(2);
	РазмерыШрифта = ТекЭлемент.Значение;
	
	Документ = Элементы.ПолеHTMLДокумента.Документ;
	
	Если Объект.ПолучателиПисьма.Количество() > 0 Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Тема;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
// Процедура, выполняет обработку нажатия динамических кнопок.
//
Процедура ПроцедураОбработкиНажатияМеню(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ПроцедураОбработкиНажатияМеню(ЭтаФорма, Элемент.Имя);	
		
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВыполнить()
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	Отказ = Ложь;
	
	ОписаниеОшибки = "";
	
	Если Объект.ПолучателиПисьма.Количество() > 1 И ИндивидуальнаяОтправка Тогда
		СтруктураПараметров = Новый Структура("Ключ", Объект.Ссылка);
		Результат = Неопределено;
		ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаИндивидуальнойОтправки", СтруктураПараметров, ЭтаФорма,,,, 
					Новый ОписаниеОповещения("ОтправитьВыполнитьЗавершение", ЭтотОбъект, ОписаниеОшибки), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
        Возврат;
	Иначе
		Результат = ВыполнитьОтправкуНаСервере(ОписаниеОшибки);
	КонецЕсли;                                                                     
	
	ОтправитьВыполнитьЗавершение(Результат, ОписаниеОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВыполнитьЗавершение(Результат, ОписаниеОшибки)
	
	Модифицированность = Ложь;
	
	Если Результат = Истина Тогда
		Оповестить("ВыполненаОтправкаПисьма", Объект.Ссылка);
		Закрыть();
	Иначе
		Если ОписаниеОшибки <> "" Тогда
			ПоказатьПредупреждение(,ОписаниеОшибки);
		КонецЕсли; 
	КонецЕсли;
	
	СохранениеВводимыхЗначений();

КонецПроцедуры

&НаКлиенте
Процедура КнопкаДополнительноВыполнить()
		
	Текст = Новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку("Создано:    " + Объект.Дата);
	Текст.ДобавитьСтроку("Отправлено: " + Объект.ДатаОтправления);
	Текст.ДобавитьСтроку("");
	Текст.ДобавитьСтроку("");
	Текст.ДобавитьСтроку("-------------------------------------------------");
	Текст.ДобавитьСтроку("Идентификатор сообщения:  " + Объект.ИдентификаторСообщения);
	Текст.ДобавитьСтроку("Идентификатор основания:  " + Объект.ИдентификаторОснования);
	Текст.ДобавитьСтроку("Идентификаторы оснований: " + ПолучитьПредставлениеИдентификаторовОснований(Объект.ИдентификаторыОснований));
	Текст.Показать();

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеОтправителяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Объект.УчетнаяЗапись = ВыбранноеЗначение;
	ЭлементСписка = Элемент.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
	Если ЭлементСписка <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Объект.ОтправительПредставление = ЭлементСписка.Представление;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLДокументаДокументСформирован(Элемент)
	
	Документ = Элемент.Документ;
	Документ.Body.innerHTML = Объект.ТекстHTML;
	Документ.Body.scroll = "auto";
	
	Если НЕ ПисьмоОтправлено Тогда
		Документ.Body.ContentEditable = "true";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLДокументаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ПоказатьРежимыКнопок();
	Модифицированность = НЕ ПисьмоОтправлено;
	
КонецПроцедуры

//&НаКлиенте
//Процедура СписокПолучателейПисьмаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	
//	РедактироватьСписокПолучателей("Кому");	
//	
//КонецПроцедуры

&НаКлиенте
Процедура СписокПолучателейКопийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РедактироватьСписокПолучателей("Копии");	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПолучателейСкрытыхКопийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РедактироватьСписокПолучателей("Скрытые");	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокШаблоновВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ ПисьмоОтправлено Тогда
		ПриВыбореШаблона(ВыбраннаяСтрока, СтандартнаяОбработка);
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокШаблоновПриАктивизацииСтроки(Элемент)
	
	Документ = Элементы.ПолеПредпросмотраШаблона.Документ;
	
	Если Документ.readyState = "complete" Тогда
		Документ.body.innerHTML = ПолучитьТекстHTMLШаблона(Элемент.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриВыбореШаблона(ВыбранныйШаблонПисьма, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранныйШаблонПисьма) <> Тип("СправочникСсылка.ШаблоныЭлектронныхПисем") Тогда
		
		Возврат;
		
	ИначеЕсли ВыбранныйШаблонПисьма.ЭтоГруппа Тогда
		
		СтандартнаяОбработка = Истина;
		Объект.ТекстHTML = "";
		
	Иначе
		
		СтандартнаяОбработка = Ложь;
		ВыбранныйШаблон = ВыбранныйШаблонПисьма;
		Объект.ТекстHTML = ВыбранныйШаблонПисьма.ТекстHTML;
		
		ОбработатьИзменяемыеЗначения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеПредпросмотраШаблонаДокументСформирован(Элемент)
	
	Документ = Элементы.ПолеПредпросмотраШаблона.Документ;
	Документ.body.innerHTML = ПолучитьТекстHTMLШаблона(Элементы.СписокШаблонов.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияПриАктивизацииСтроки(Элемент)
	
	ВыбраноВложение = Элемент.ТекущиеДанные <> Неопределено;
	
	// Элементы командной панели
	Элементы.ВложенияОткрытьВложение.Доступность = ВыбраноВложение;
	Элементы.ВложенияУдалитьВложение.Доступность = ?(ПисьмоОтправлено, Ложь, ВыбраноВложение);
	
	// Элементы контекстного меню
	Элементы.КонтекстноеМенюОткрытьВложение.Доступность = ВыбраноВложение;
	Элементы.КонтекстноеМенюУдалитьВложение.Доступность = ?(ПисьмоОтправлено, Ложь, ВыбраноВложение);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////
// ОПЕРАЦИИ С ВЛОЖЕНИЯМИ ПИСЬМА

&НаСервере
// Процедура записывает вложения письма в зависимости от их расположения
//
Процедура ЗаписатьВложения()
	
	Для Каждого Стр Из Вложения Цикл
		
		Размер = 0;
		ИмяФайла = Стр.ИмяФайла;
		Письмо = Объект.Ссылка;
		
		Если Стр.Расположение = 4 Тогда
			// из временного хранилища
			Стр.Ссылка = УправлениеЭлектроннойПочтой.ЗаписатьВложениеЭлектронногоПисьмаИзВременногоХранилища(Письмо, Стр.ИмяФайлаНаКомпьютере, ИмяФайла, Размер);
			
		ИначеЕсли Стр.Расположение = 3 Тогда
			// из файла на сервере
			
		ИначеЕсли Стр.Расположение = 1 Тогда
			// из двоичных данных другого вложения
			
			Если ПереноситьВложения Тогда
				РаботаСФайламиВызовСервера.СкопироватьФайлВПриложенных(Стр.Ссылка, Объект.Ссылка);
			КонецЕсли;
			
		ИначеЕсли Стр.Расположение = 0 Тогда
			// перезаписать вложение
			
		КонецЕсли;
		
		Стр.Расположение = 0;
		
	КонецЦикла;	
	
	// Удалим удаленные вложения
	Для Каждого УдаленноеВложение Из УдаленныеВложения Цикл
		ОбъектВложение = УдаленноеВложение.Значение.ПолучитьОбъект();
		ОбъектВложение.Удалить();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура получает все вложения данного письма
//
Процедура ПолучитьВложенияПисьма()
	
	табВложения = УправлениеЭлектроннойПочтой.ПолучитьВложенияЭлектронногоПисьма(Объект.Ссылка);
	
	Вложения.Очистить();
	Для Каждого Стр Из табВложения Цикл
		новСтр = Вложения.Добавить();
		новСтр.Ссылка         = Стр.Ссылка;
		новСтр.ИмяФайла       = Стр.ИмяФайла;
		новСтр.ИндексКартинки = Стр.ИндексКартинки;
		новСтр.Размер         = Стр.Размер;
		новСтр.Расположение   = 0;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура копирует все вложения из указанного письма
//
Процедура ПеренестиВложенияИзДругогоПисьма(ПисьмоОснование)
	
	Если ТипЗнч(ПисьмоОснование) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее")
		ИЛИ ТипЗнч(ПисьмоОснование) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
		
		ПересылаемыеВложения = УправлениеЭлектроннойПочтой.ПолучитьВложенияЭлектронногоПисьма(ПисьмоОснование);
		
		ТаблицаВложений = ДанныеФормыВЗначение(Вложения, Тип("ТаблицаЗначений"));
		
		Для Каждого СтрокаПересылаемогоВложения Из ПересылаемыеВложения Цикл
			СтрокаВложения = ТаблицаВложений.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВложения, СтрокаПересылаемогоВложения);
			СтрокаВложения.Расположение = 1;	// из двоичных данных другого вложения
		КонецЦикла;
		
		ЗначениеВДанныеФормы(ТаблицаВложений, Вложения);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВложенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	ДобавитьВложениеВыполнить();

КонецПроцедуры

&НаКлиенте
Процедура ВложенияПередУдалением(Элемент, Отказ)
	
	УдалитьВложениеВыполнить();
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВложениеВыполнить()
	
	Если ПисьмоОтправлено Тогда
		Возврат;
	КонецЕсли;
	
	#Если Не ВебКлиент Тогда
		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.МножественныйВыбор = Истина;
		Диалог.Показать(Новый ОписаниеОповещения("ДобавитьВложениеВыполнитьЗавершение1", ЭтотОбъект, Новый Структура("Диалог", Диалог)));
		
	#Иначе

		Адрес = "";
		ВыбранныйФайл = "";
		НачатьПомещениеФайла(Новый ОписаниеОповещения("ДобавитьВложениеВыполнитьЗавершение", ЭтотОбъект, Новый Структура("Адрес, ВыбранныйФайл", Адрес, ВыбранныйФайл)), Адрес, , Истина, УникальныйИдентификатор);
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВложениеВыполнитьЗавершение1(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	
	Если Не (ВыбранныеФайлы <> Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыбранныйФайл Из Диалог.ВыбранныеФайлы Цикл
		новСтр = Вложения.Добавить();
		новСтр.Расположение = 2;
		новСтр.ИмяФайлаНаКомпьютере = ВыбранныйФайл;
		
		ИмяФайла   = "";
		Расширение = "";
		ФайловыеФункцииКлиентСервер.ПолучитьКаталогИИмяФайла(ВыбранныйФайл, "", ИмяФайла);
		новСтр.ИмяФайла = ИмяФайла;
		
		Расширение = ФайловыеФункцииКлиентСервер.ПолучитьРасширениеФайла(ИмяФайла);
		новСтр.ИндексКартинки = ФайловыеФункцииКлиентСервер.ПолучитьИндексПиктограммыФайла(Расширение);
	КонецЦикла;
	
	Записать();

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВложениеВыполнитьЗавершение(Результат, Адрес, ВыбранныйФайл, ДополнительныеПараметры) Экспорт
	
	Адрес = ДополнительныеПараметры.Адрес;
	
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;
	
	новСтр = Вложения.Добавить();
	новСтр.Расположение = 4;
	новСтр.ИмяФайлаНаКомпьютере = Адрес;
	новСтр.ИмяФайла = ВыбранныйФайл;
	
	Расширение = ФайловыеФункцииКлиентСервер.ПолучитьРасширениеФайла(ВыбранныйФайл);
	новСтр.ИндексКартинки = РаботаСФайламиСлужебныйКлиентСервер.ПолучитьИндексПиктограммыФайла(Расширение);
	
	ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура УдалитьВложениеВыполнить()

	ДобавитьВложениеВСписокУдаленных();
	
	текДанные = Элементы.Вложения.ТекущиеДанные;
	Если текДанные <> Неопределено Тогда
		Индекс = Вложения.Индекс(текДанные);
		Вложения.Удалить(Индекс);

		ОбновитьОтображениеДанных();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВложениеВСписокУдаленных()

	текДанные = Элементы.Вложения.ТекущиеДанные;
	Если (текДанные <> Неопределено) И (текДанные.Расположение = 0) Тогда
		УдаленныеВложения.Добавить(текДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВложениеВыполнить()
	
	текДанные = Элементы.Вложения.ТекущиеДанные;
	Если текДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если (текДанные.Расположение = 0) ИЛИ (текДанные.Расположение = 1) Тогда
		УправлениеЭлектроннойПочтойКлиент.ОткрытьВложение(текДанные.Ссылка);
		
	ИначеЕсли текДанные.Расположение = 2 Тогда
		#Если Не ВебКлиент Тогда
			ЗапуститьПриложение("""" + текДанные.ИмяФайлаНаКомпьютере + """");
		#КонецЕсли
		
	ИначеЕсли текДанные.Расположение = 4 Тогда
		
		#Если ВебКлиент Тогда
			
			НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("ОткрытьВложениеВыполнитьЗавершение", ЭтотОбъект));
            Возврат;	
			
		#КонецЕсли	
		
		#Если Не ВебКлиент Тогда
			ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(текДанные.ИмяФайлаНаКомпьютере);
			ДвоичныеДанныеФайла.Записать(КаталогВременныхФайлов() + текДанные.ИмяФайла);
			ЗапуститьПриложение("""" + КаталогВременныхФайлов() + текДанные.ИмяФайла + """");		
		#КонецЕсли
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Открыть вложение выполнить завершение
//
// Параметры:
//  Подключено				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ОткрытьВложениеВыполнитьЗавершение(Подключено, ДополнительныеПараметры) Экспорт
		
	Если Не Подключено Тогда
		
		Возврат
		
	КонецЕсли;	

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// РАБОТА С ПОЛЯМИ ПОЛУЧАТЕЛЕЙ

&НаКлиенте
Процедура СписокПолучателейПисьмаПриИзменении(Элемент)
	
	ПреобразоватьИменаПолучателей(Объект.СписокПолучателейПисьма, "ПолучателиПисьма");
	
	УправлениеВидимостьюПоляРассылки(Объект.ПолучателиПисьма.Количество());
	
КонецПроцедуры

&НаКлиенте                              
Процедура СписокПолучателейКопийПриИзменении(Элемент)
	
	ПреобразоватьИменаПолучателей(Объект.СписокПолучателейКопий, "ПолучателиКопий");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПолучателейСкрытыхКопийПриИзменении(Элемент)
	
	ПреобразоватьИменаПолучателей(Объект.СписокПолучателейСкрытыхКопий, "ПолучателиСкрытыхКопий");
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Подобрать контакты выполнить
//
Процедура ПодобратьКонтактыВыполнить()

	РедактироватьСписокПолучателей();

КонецПроцедуры

&НаКлиенте 
// Процедура - Подобрать контакты выполнить завершение
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПодобратьКонтактыВыполнитьЗавершение() 
	
	СписокПолучателейПисьмаПриИзменении(Неопределено);
	СписокПолучателейКопийПриИзменении(Неопределено);
	СписокПолучателейСкрытыхКопийПриИзменении(Неопределено);

КонецПроцедуры

#КонецОбласти    

#Область СлужебныеПроцедурыИФункции
     
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Процедура УправлениеВидимостьюПоляРассылки(КоличествоПолучателей)
	
	Элементы.ГруппаРассылки.Видимость = КоличествоПолучателей > 1;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКонтактПоАдресу(Адрес)
	
	Для Каждого Элемент Из СоответствияАдресовИКонтактов Цикл
		Если Элемент.Представление = Адрес Тогда
			Возврат Элемент.Значение;
		КонецЕсли;
	КонецЦикла;

	Контакт = Адрес;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбъектСКонтактнойИнформацией.Ссылка
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК ОбъектСКонтактнойИнформацией
	|ГДЕ
	|	ОбъектСКонтактнойИнформацией.АдресЭП = &АдресЭП
	|	И ОбъектСКонтактнойИнформацией.Тип = &Тип";
	
	Запрос.УстановитьПараметр("АдресЭП", Адрес);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Контакт = Выборка.Ссылка;
	КонецЕсли;
	
	СоответствияАдресовИКонтактов.Добавить(Контакт, Адрес);
	Возврат Контакт;
	
КонецФункции

&НаКлиенте
Функция ПолучитьПредставлениеИдентификаторовОснований(Знач Идентификаторы)

	Идентификаторы = СтрЗаменить(Идентификаторы, "<",  " ");
	Идентификаторы = СтрЗаменить(Идентификаторы, ">",  " ");
	Идентификаторы = СтрЗаменить(Идентификаторы, "  ", " ");
	Идентификаторы = СокрЛП(СтрЗаменить(Идентификаторы, "  ", " "));
	Идентификаторы = СтрЗаменить(Идентификаторы, " ", Символы.ПС + "                          ");
	
	Возврат Идентификаторы;

КонецФункции

&НаСервере
Процедура ПреобразоватьИменаПолучателей(СтрокаИмен, ИмяТаблицы)
	
	табПолучатели = Объект[ИмяТаблицы];

	табПолучатели.Очистить();
	Если ПустаяСтрока(СтрокаИмен) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПереданныхАдресов  = СтрЗаменить(СтрокаИмен, ",", ";");
	МассивПодстрокКОбработке = СтрРазделить(СокрЛП(СтрокаПереданныхАдресов), ";", Ложь);

	Для Каждого Элемент Из МассивПодстрокКОбработке Цикл 
		
		Попытка
			
			Результат = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(Элемент);
			Если Результат.Количество() = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			новСтр               = табПолучатели.Добавить();
			новСтр.Адрес         = Результат[0].Адрес;
			новСтр.Представление = Результат[0].Представление;
			новСтр.Контакт       = ПолучитьКонтактПоАдресу(Результат[0].Адрес);  
			
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Письмо не может быть отправлено клиенту " + Элемент + " по причине: " + Символы.ПС + ОписаниеОшибки());
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСписокПолучателей(ГруппаАдресов = "Кому")
	
	// Промежуточно сохраняем текст письма
	Объект.ТекстHTML = Элементы.ПолеHTMLДокумента.Документ.body.innerHTML;
	
	// Получим список адресатов
	соотвТабЧастей = Новый Соответствие;
	соотвТабЧастей.Вставить("Кому",    Объект.ПолучателиПисьма);
	соотвТабЧастей.Вставить("Копии",   Объект.ПолучателиКопий);
	соотвТабЧастей.Вставить("Скрытые", Объект.ПолучателиСкрытыхКопий);
	соотвТабЧастей.Вставить("Ответ",   Объект.ПолучателиОтвета);
	
	СписокВыбранных = Новый СписокЗначений;
	Для Каждого ТабЧасть Из соотвТабЧастей Цикл
		СписокВыбранных.Добавить(УправлениеЭлектроннойПочтойКлиент.ТаблицуКонтактовВМассив(ТабЧасть.Значение), ТабЧасть.Ключ);
	КонецЦикла;

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("УчетнаяЗапись",   Объект.УчетнаяЗапись);
	ПараметрыОткрытия.Вставить("СписокВыбранных", СписокВыбранных);
	ПараметрыОткрытия.Вставить("Предмет",         Объект.Предмет);
	ПараметрыОткрытия.Вставить("ГруппаАдресов",   ГруппаАдресов);
	ПараметрыОткрытия.Вставить("ТолькоПросмотр",  ПисьмоОтправлено);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактироватьСписокПолучателейЗавершение", ЭтотОбъект, Новый Структура(" соотвТабЧастей",соотвТабЧастей));
	ОткрытьФорму("ОбщаяФорма.АдреснаяКнига", ПараметрыОткрытия,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСписокПолучателейЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	соотвТабЧастей = ДополнительныеПараметры.соотвТабЧастей;
		
	Если (ТипЗнч(Результат) = Тип("Массив")) ИЛИ (ТипЗнч(Результат) = Тип("Соответствие")) Тогда
		
		// Заполним адресатов
		ЗаполнитьПодобранныхПолучателей(соотвТабЧастей, Результат);
		
		// Сформируем представления контактов
		СформироватьПредставленияКонтактов();
		
		Модифицированность = Истина;

	Иначе
		// Проверить корректность вводимых данных
		ПодобратьКонтактыВыполнитьЗавершение();
        // Сформируем представления контактов
		СформироватьПредставленияКонтактов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодобранныхПолучателей(соотвТабЧастей, Результат)

	Для Каждого ТабЧасть Из соотвТабЧастей Цикл
		ТабЧасть.Значение.Очистить();
	КонецЦикла;
	
	Для Каждого Элемент Из Результат Цикл
		
		ТабЧасть = соотвТабЧастей.Получить(Элемент.Группа);
		Если ТабЧасть = Неопределено Тогда
			ТабЧасть = Объект.ПолучателиПисьма;
		КонецЕсли;
		Попытка
			
			Результат = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(Элемент.Адрес);
			Если Результат.Количество() = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			новСтр               = ТабЧасть.Добавить();
			новСтр.Адрес         = Элемент.Адрес;
			новСтр.Представление = Элемент.Представление;
			новСтр.Контакт       = ПолучитьКонтактПоАдресу(Результат[0].Адрес);  
			
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Письмо не может быть отправлено клиенту " + Элемент.Контакт + " по причине: " + Символы.ПС + ОписаниеОшибки());
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПредставленияКонтактов()

	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	ОбъектДокумента.СформироватьПредставленияКонтактов();
	ЗначениеВРеквизитФормы(ОбъектДокумента, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	Если ПисьмоОтправлено Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		
		Элементы.Отправить.Доступность = Ложь;
		Элементы.ГруппаКнопокРедактораHTML.Доступность = Ложь;
		
		// Кнопки управления вложениями
		Элементы.ВложенияДобавитьВложение.Доступность = Ложь;
		Элементы.КоманднаяПанельДобавитьВложение.Доступность = Ложь;
		
		Элементы.КонтекстноеМенюДобавитьВложение.Доступность = Ложь;
		Элементы.КонтекстноеМенюУдалитьВложение.Доступность = Ложь;
		// ****
		
	КонецЕсли;
	
	УправлениеВидимостьюПоляРассылки(Объект.ПолучателиПисьма.Количество());
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьОтправкуНаСервере(ОписаниеОшибки)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Результат = Документы.ЭлектронноеПисьмоИсходящее.ВыполнитьОтправкуПисьма(ТекущийОбъект, ОписаниеОшибки);
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	
	Возврат Результат;

КонецФункции
     
&НаСервереБезКонтекста
Функция ПолучитьТекстHTMLШаблона(ШаблонСсылка)
	
	Если ТипЗнч(ШаблонСсылка) <> Тип("СправочникСсылка.ШаблоныЭлектронныхПисем") Тогда
		Возврат "";
	ИначеЕсли ШаблонСсылка.ЭтоГруппа Тогда
		Возврат "";
	Иначе
		Возврат ШаблонСсылка.ТекстHTML;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьКоманду(Кнопка)
	
	Команда = Сред(Кнопка.Имя, 8);
	Если Документ.queryCommandSupported(Команда) Тогда
		Документ.execCommand(Команда, Ложь);
		ПоказатьРежимыКнопок();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПисьмо(Команда)
	
	ТекстВопроса = ?(Объект.ПометкаУдаления,
					"Вы действительно хотите снять пометку удаления у письма?",
					"Вы действительно хотите пометить письмо на удаление?");
	
	ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьПисьмоЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Удалить письмо завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура УдалитьПисьмоЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Если НЕ Объект.Ссылка.Пустая() Тогда
			УстановитьПометкуУдаления(Объект.Ссылка);
		КонецЕсли;
		
		Оповестить("ИзмененоЭлектронноеПисьмо");
		
		Прочитать(); // Обновляем данные на форме
		
		// Если письмо было удалено - закрываем форму
		Если Объект.ПометкаУдаления Тогда
			Модифицированность = Ложь;
			Закрыть();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПометкуУдаления(ПисьмоСсылка)
	
	ПисьмоОбъект = ПисьмоСсылка.ПолучитьОбъект();
	ПисьмоОбъект.ПометкаУдаления = НЕ ПисьмоОбъект.ПометкаУдаления;
	ПисьмоОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРежимыКнопок()
	
	Если ПисьмоОтправлено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Группа Из Элементы.КоманднаяПанельКнопок.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(Группа) = Тип("ДекорацияФормы") Тогда Продолжить; КонецЕсли;
		
		Для каждого Кнопка Из Группа.ПодчиненныеЭлементы Цикл
	        Если ТипЗнч(Кнопка) = тип("КнопкаФормы") Тогда
				
				Команда = Сред(Кнопка.Имя, 8);
				Если Документ.queryCommandSupported(Команда) Тогда
					Попытка
						Кнопка.Пометка = Документ.queryCommandState(Команда);
					Исключение
					КонецПопытки;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуСписка(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Команда = Сред(Элемент.Имя, 8);
	Если Документ.queryCommandSupported(Команда) Тогда
		Список = Элемент.СписокВыбора;
		Документ.execCommand(Команда, Истина, ВыбранноеЗначение);
		ПоказатьРежимыКнопок();
	КонецЕсли;
	ЭтаФорма.ТекущийЭлемент = Элементы.ПолеHTMLДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьГиперссылку(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ВыборГиперссылки",,,,,, Новый ОписаниеОповещения("ОткрытьФормуГиперссылкиЗавершение", ЭтаФорма));
	
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьФормуГиперссылкиЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Документ.execCommand("CreateLink", Ложь, Результат);
	КонецЕсли;
	ПоказатьРежимыКнопок();
	
КонецПроцедуры	
	
&НаКлиенте
Процедура ВыборЦвета(Команда)
	
    Параметры = Новый Структура("Команда", Команда);
	ОткрытьФорму("Обработка.ВыборWebЦвета.Форма",,,,,,Новый ОписаниеОповещения("ОткрытьФормуВыбораЦвета", ЭтаФорма,Параметры));
		
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьФормуВыбораЦвета(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Кнопка = Сред(Параметры.Команда.Имя, 8);
		Если Документ.queryCommandSupported(Кнопка) Тогда
			Документ.execCommand(Кнопка, Ложь, "" + ПеревестиИз10(Результат.Красный) + ПеревестиИз10(Результат.Зеленый) + ПеревестиИз10(Результат.Синий));
		КонецЕсли;
	КонецЕсли;
	ПоказатьРежимыКнопок();

КонецПроцедуры	
	
&НаКлиенте
Функция ПеревестиИз10(Знач Значение = 0)
	
	Значение = Число(Значение);
	Если Значение <= 0 Тогда
		Возврат "00";
	КонецЕсли;
	
	Значение = Цел(Значение);
	Результат = "";
	
	Пока Значение > 0 Цикл
		Результат = Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ",Значение%16+1,1) + Результат;
		Значение = Цел(Значение/16);
	КонецЦикла;
	
	Если СтрДлина(Результат) = 1 Тогда
		Результат = "0" + Результат;
	КонецЕсли; 
  
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбработатьИзменяемыеЗначения()
	
	Получатель = Справочники.Контрагенты.ПустаяСсылка();
	
	Если Объект.ПолучателиПисьма.Количество() > 0 Тогда
		
		Если ТипЗнч(Объект.ПолучателиПисьма[0].Контакт) = Тип("СправочникСсылка.Контрагенты") Тогда
			Получатель = Объект.ПолучателиПисьма[0].Контакт;
		КонецЕсли;
		
	КонецЕсли;
	
	МенеджерПочтыСервер.ОбработатьИзменяемыеЗначенияВПисьме(Объект.ТекстHTML, Получатель);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокВыбораДоступныхУчетныхЗаписей()
	
	ТЗУчетныеЗаписи = Справочники.УчетныеЗаписиЭлектроннойПочты.ВернутьУчетныеЗаписиЭлектроннойПочтыОбщиеИЛичные(ПараметрыСеанса.ТекущийПользователь, Ложь, Истина, Ложь, Ложь);	
	
	Для Каждого СтрокаТЗ Из ТЗУчетныеЗаписи Цикл
		
		УчетнаяЗапись = СтрокаТЗ.Ссылка;
		ПредставлениеУчетнойЗаписи = ?(ЗначениеЗаполнено(СтрокаТЗ.ИмяПользователя),
									   СтрокаТЗ.ИмяПользователя + " <" + СтрокаТЗ.АдресЭлектроннойПочты + ">",
									   СтрокаТЗ.АдресЭлектроннойПочты);
		
		Элементы.ОтправительПредставление.СписокВыбора.Добавить(УчетнаяЗапись, ПредставлениеУчетнойЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Обработчик создания нового взаимодействия "Встреча"
//
Процедура ЗапланироватьВстречу(Команда)
	
	СоздатьНовоеВзаимодействие(ПредопределенноеЗначение("Справочник.ВидыВзаимодействий.Встреча"));
		
КонецПроцедуры

&НаКлиенте
// Обработчик создания нового взаимодействия "Телефонный звонок исходящий"
//
Процедура ЗапланироватьТелефонныйЗвонок(Команда)

   СоздатьНовоеВзаимодействие(ПредопределенноеЗначение("Справочник.ВидыВзаимодействий.ЗвонокИсходящий"));
		
КонецПроцедуры

&НаКлиенте
// Создать новое взаимодействие на основании данного существующего
//
Процедура СоздатьНовоеВзаимодействие(ВидОперацииВзаимодействия)
	
	// Если документ модифицирован необходимо его предварительно записать
	Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьНовоеВзаимодействиеПослеВопроса", ЭтотОбъект, Новый Структура("ВидОперацииВзаимодействия", ВидОперацииВзаимодействия));
		ПоказатьВопрос(ОписаниеОповещения, "Документ должен быть записан! Записать?", РежимДиалогаВопрос.ДаНет);
        Возврат;
		
	КонецЕсли;
	
	// Открываем форму нового взаимодействия
	СоздатьНовоеВзаимодействиеЗавершение(ВидОперацииВзаимодействия); 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовоеВзаимодействиеПослеВопроса(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если КодВозвратаДиалога.Да = РезультатВопроса Тогда
		Если НЕ Записать() Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	СоздатьНовоеВзаимодействиеЗавершение(ДополнительныеПараметры.ВидОперацииВзаимодействия);

КонецПроцедуры

&НаКлиенте
// Процедура - Создать новое взаимодействие фрагмент
//
// Параметры:
//  ВидОперацииВзаимодействия	 - 	 - 
//
Процедура СоздатьНовоеВзаимодействиеЗавершение(Знач ВидВзаимодействия)
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ВидВзаимодействияСправочник", ВидВзаимодействия);
	ДанныеЗаполнения.Вставить("ЗадачаТема"			 ,Объект.Тема);

	ОткрытьФорму("Задача.Взаимодействие.ФормаОбъекта",Новый Структура("Основание", ДанныеЗаполнения));
	
КонецПроцедуры
	
&НаСервере
Процедура СохранениеВводимыхЗначений() 
	СохранениеВводимыхЗначений.ОбновитьСпискиВыбора(ЭтаФорма, ЭлементыДляСохранения(), ЭтаФорма.ИмяФормы);
КонецПроцедуры

&НаСервере
// Веренет таблицу сохраняемых элементов
//
Функция ЭлементыДляСохранения()                     
	
	СохраняемыеЭлементы = Новый Структура("СписокПолучателейПисьма", Объект.СписокПолучателейПисьма);  		
		
	Возврат СохранениеВводимыхЗначений.СформироватьТаблицуСохраненяемыхЭлементов(СохраняемыеЭлементы);
	
КонецФункции

&НаКлиенте
// Обработчик открытия формы кэш списка вводимых значений 
//
Процедура Подключаемый_ОбработчикКэшЛист(Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОповещения = Новый Структура("Элемент", Элемент);
	ПараметрыФормы = Новый Структура("ИдентификаторПоля", ЭтаФорма.ИмяФормы + "." + Элемент.Имя); 
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияСохраняемыхЗначений", ПараметрыФормы,,,,,Новый ОписаниеОповещения("ПослеВыбораСохраняемыхЗначений", ЭтаФорма,ПараметрыОповещения));
			
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораСохраняемыхЗначений(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.СписокПолучателейПисьма = Результат;
	ОбновитьСписокВыбораЭлемента(Параметры.Элемент, ЭтаФорма); 
	СписокПолучателейПисьмаПриИзменении(Неопределено);
	
КонецПроцедуры	
	
&НаКлиенте
// Процедура обновит список выбора элемента 
//
Процедура ОбновитьСписокВыбораЭлемента(Элемент,Форма)
	
	СписокИсторииВвода = СохранениеВводимыхЗначений.ПолучитьСписокЗначенийИсторииВвода(Форма.ИмяФормы + "." + Элемент.Имя);
	
	Если СписокИсторииВвода <> Неопределено Тогда
		
		СписокВыбора               = Элемент.СписокВыбора;		
		Элемент.КнопкаСпискаВыбора = ?(СписокИсторииВвода.Количество() > 0, Истина, Ложь);
		Элемент.КнопкаВыбора       =  ?(СписокИсторииВвода.Количество() > 0, Истина, Ложь);
		
		СписокВыбора.Очистить();
		Для Каждого ЭлементСпискаИсторииВыбора Из СписокИсторииВвода Цикл
			
			НовыйЭлемент          = СписокВыбора.Добавить();
			НовыйЭлемент.Значение = ЭлементСпискаИсторииВыбора.Значение;
			
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

 #КонецОбласти
