#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Функция - Получить описания триггеров
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьОписанияТриггеров() Экспорт 
	
	СписокОписаний = Новый СписокЗначений;
	
	СписокОписаний.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентРегистрация,
							Нстр("ru = 'Триггер срабатывает один раз в момент или после регистрации пациента.'; en = 'The trigger is triggered once during or after the client's registration.'"));	
	СписокОписаний.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентПотенциальныйНеСталНовым, 
							Нстр("ru = 'Триггер срабатывает один раз спустя заданное количество дней, если потенциальный пациент не повысил свой статус до нового или постоянного пациента клиники.'; en = 'The trigger is triggered once after the specified number of days, if the potential customer has not upgraded their status to a clinic client or clinic member.'"));
	СписокОписаний.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентНепосещениеКлиники, 
							Нстр("ru = 'Триггер анализирует непосещение пациентов за указанные период (в днях). Регистрация события происходит по типу ""день в день"". Для анализа выбираются посещения, в основании у которых должны быть указаны, либо активные ЧПУ на текущий момент, либо реализации по клиенту.'; en = 'The trigger analyzes non-attendance of clients for the specified period (in days). The event is registered using the ""day-to-day"" type. For the analysis, we select the sessions that should be based on either the active NC at the moment, or implementations for the client.'"));	
	СписокОписаний.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаявкаНеОбработана, 
							Нстр("ru = 'Триггер срабатывает один раз спустя заданное количество часов/минут, если заявка не была обработана. Заявки поступившие в нерабочее время триггер отработает на следующий день.'; en = 'The trigger is triggered once after the specified number of hours, if the request has not been processed. Applications received after business hours trigger will work the next day.'"));									
	СписокОписаний.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаСменаЭтапа,
							Нстр("ru = 'Триггер срабатывает один раз в момент смены этапа или спустя заданное количество дней.'; en = 'The trigger is triggered once when the stage changes or after a specified number of days.'"));	
	СписокОписаний.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе, 
							Нстр("ru = 'Триггер срабатывает один раз для каждой сделки в момент отсутствия смены этапа в течении определенного времени.'; en = 'The trigger is triggered once for each trade when there is no stage change for a certain time.'"));		
	СписокОписаний.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЛистОжиданияВыписаноНаправление, 
							Нстр("ru = 'Триггер срабатывает для всех направлений со статусом ""Запланировано"" или ""Напомнить позже"", по которым нет предварительной записи на приём. В направлении должен быть указан врач. Например: Если в условиях триггера указано ""после события через 2 дня"" - тогда триггер сработает для всех направлений к указанным врачам через 2 после выписки направления, если пациент не записался на приём.'; en = 'Trigger is triggered for all referrals with the status ""Scheduled"" for which there is no prior appointment. The referral must have a physician listed. For example: If the trigger conditions specify ""After event in 2 days"" - then the trigger will be triggered for all referrals to the specified doctors 2 days after the referral is issued, if the patient has not made an appointment.'"));
	СписокОписаний.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЛистОжиданияОчередьНаЗапись, 
							Нстр("ru = 'Триггер срабатывает для всех пациентов в очереди на запись со статусом ""Запланировано"" или ""Напомнить позже"", по которым нет предварительной записи на приём. Также должен быть указан врач. Например: Если в условиях триггера указано ""до события за 2 дня"" - тогда триггер сработает для всех пациентов в очереди за 2 дня до даты запланированной, если отсутствует запись на приём.'; en = 'The trigger is triggered for all patients in the appointment queue with the status ""Scheduled"" for which there is no appointment. The doctor must also be specified. For example: If the trigger conditions specify ""2 days before event"". - then the trigger will trigger for all patients in the queue 2 days before the scheduled date if there is no appointment.'"));
	СписокОписаний.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЛистОжиданияПрофосмотр, 
							Нстр("ru = 'Триггер срабатывает для всех пациентов с запланированным профосмотром, по которым нет предварительной записи на приём. Например: Если в условиях триггера указано ""до события за 7 дней"" - тогда триггер сработает для всех пациентов, у которых запланирован профосмотр через 7 дней и отсутствует запись на приём.'; en = 'Trigger is triggered for all patients with scheduled exams that do not have an appointment. For example: If the trigger conditions are ""7 days before the event"". - then the trigger is triggered for all patients who are scheduled for an exam in 7 days and do not have an appointment.'"));
	СписокОписаний.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаСотрудникомКлиники, 
							Нстр("ru = 'Триггер регистрирует событие при смене статуса сотрудником клиники в уже существующей предварительной записи. Регистрация происходит в разрезе пациента и предварительной записи. Таким образом, для пациента и его предварительной записи, триггер будет регистрировать событие только один раз. Последующие изменения статуса для предварительной записи регистрироваться триггером не будут. Для этого нужно создать другой триггер и указать ему соответствующий статус предварительной записи, для которого должна происходить регистрация события.'; en = 'Trigger registers an event when a status change occurs in an existing appointment. The event is logged in terms of the patient and the appointment. Thus, for a patient and his appointment, the trigger will log the event only once. Subsequent status changes for the preregistration will not be logged by the trigger. To do this, you must create another trigger and specify the appropriate status of the appointment for which the event is to be logged.'"));
	СписокОписаний.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаПациентом, 
							Нстр("ru = 'Триггер регистрирует событие при смене статуса пациентом, посредством внешних систем в уже существующей предварительной записи. Регистрация происходит в разрезе пациента и предварительной записи. Таким образом, для пациента и его предварительной записи, триггер будет регистрировать событие только один раз. Последующие изменения статуса для предварительной записи регистрироваться триггером не будут. Для этого нужно создать другой триггер и указать ему соответствующий статус предварительной записи, для которого должна происходить регистрация события.'; en = 'Trigger registers an event when a status change occurs in an existing appointment. The event is logged in terms of the patient and the appointment. Thus, for a patient and his appointment, the trigger will log the event only once. Subsequent status changes for the preregistration will not be logged by the trigger. To do this, you must create another trigger and specify the appropriate status of the appointment for which the event is to be logged.'"));							
	СписокОписаний.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеПереносДатыВремени, 
							Нстр("ru = 'Триггер регистрирует событие только при первом переносе даты и времени начала в уже существующем групповом занятии. При последующих переносах даты и времени начала в групповом занятии регистрация события происходить не будет. Также групповое занятие должно быть в статусе ""Запланировано"".'; en = 'The trigger registers the event only when the start date and time are moved for the first time in an existing group activity. Subsequent postponements of the start date and time in the group session will not register the event. Also, the group lesson should have the status ""Scheduled"".'"));
	СписокОписаний.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеЗаменаИнструктора, 
							Нстр("ru = 'Триггер регистрирует событие только при первой замене инструктора в уже существующем групповом занятии. При последующих изменениях инструктора в групповом занятии регистрация события происходить не будет. Также групповое занятие должно быть в статусе ""Запланировано"".'; en = 'The trigger registers the event only when the instructor is replaced for the first time in an existing group session. Subsequent changes to the instructor in the group session will not register the event. Also, the group lesson should have the status ""Scheduled"".'"));
	СписокОписаний.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема, 
							Нстр("ru = 'Триггер срабатывает в момент начала приема.'; en = 'The trigger is triggered when the class starts.'"));
	СписокОписаний.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеСписаниеУслугиКлиентПрибыл, 
							Нстр("ru = 'Триггер срабатывает в момент списания услуги, если клиент прибыл.'; en = 'The trigger is triggered when the service is debited, if the client has arrived.'"));
	СписокОписаний.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеСписаниеУслугиПоНеявке, 
							Нстр("ru = 'Триггер срабатывает в момент списания услуги, если услуга списана по неявке клиента.'; en = 'The trigger is triggered when the service is debited, if the service is debited due to the client's non-appearance.'"));
	СписокОписаний.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеПроведеноКлиентПрибыл, 
							Нстр("ru = 'Триггер срабатывает после окончания занятия для каждого клиента в случае его посещения. Триггер можно использовать для отправки сообщения клиенту с просьбой оценить качество предоставленных услуг.'; en = 'The trigger is triggered after the end of the lesson for each client in case of his visit. A trigger can be used to send a message to a client asking him to rate the quality of the services provided.'"));
	
	Возврат СписокОписаний;
	
КонецФункции	

// Функция - Получить таблицу всех вариантов условий триггерных событий
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий() Экспорт
	
	ТаблицуВсехВариантовУсловийТриггерныхСобытий = Новый ТаблицаЗначений;
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("ВариантыУсловийТриггерныхСобытий"				, Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыУсловийТриггерныхСобытий"));
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("ВиртуальнаяГруппаСобытий"						, Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(128)));
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("ПредставлениеВиртуальнойГруппыСобытий"			, Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(128)));	
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("ПорядковыйНомерВиртуальнойГруппыСобытий" 		, Новый ОписаниеТипов("Число", Новый КвалификаторыСтроки(2)));	
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("СписокМоментовАктивации"							, Новый ОписаниеТипов("СписокЗначений"));
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("СписокВидовПериодаАктивации"						, Новый ОписаниеТипов("СписокЗначений"));	
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("БазовыйВариант"									, Новый ОписаниеТипов("Булево")); // Для добавляемых триггеров - присваивать "Ложь"
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("ГибридныйВариантИнициацииТриггера" 				, Новый ОписаниеТипов("Булево")); // Истина - срабатывает и по подписке на событие, и по регламенту. Ложь - только по регламенту.
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("ИспользуетсяПараметрСобытия" 					, Новый ОписаниеТипов("Булево"));
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("ОбязательноеЗаполнениеПараметраСобытия" 			, Новый ОписаниеТипов("Булево"));	
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("МинимальноеЗначениеПараметраСобытия" 			, Новый ОписаниеТипов("Число", Новый КвалификаторыСтроки(1)));
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("ИмяЭлементаПараметраСобытия"						, Новый ОписаниеТипов("Строка")); // Смотрим на нужный элемент на форме триггера
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("ИспользуетсяТипАктивацииЧленстваПакетаУслуг"		, Новый ОписаниеТипов("Булево"));
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("ИспользуетсяОтборПоСтруктурнойЕдинице" 			, Новый ОписаниеТипов("Булево"));		
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("ИспользуетсяОтборПоИсточникамЗаписи" 			, Новый ОписаниеТипов("Булево"));	
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("ИспользуетсяОтборПоСегментуУслуг" 				, Новый ОписаниеТипов("Булево"));
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("ИспользуетсяОтборПоВидуСделки" 					, Новый ОписаниеТипов("Булево"));
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("ИспользуетсяОтборПоВидуЛицевогоСчета"			, Новый ОписаниеТипов("Булево"));
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("ИспользуетсяОтборПоВидуБонусногоСчета"			, Новый ОписаниеТипов("Булево"));					
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("ОбязательноеЗаполнениеСегментаУслуг"				, Новый ОписаниеТипов("Булево"));
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("РазрешенаРаботаСоСделками"						, Новый ОписаниеТипов("Булево"));
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("РазрешенаРаботаСЧатБотом"						, Новый ОписаниеТипов("Булево"));	
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("ДопустимыйВидСделки"								, Новый ОписаниеТипов("СправочникСсылка.ВидыСделок"));
	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Колонки.Добавить("СписокДопустимыхЗавершающихЭтаповСделок"			, Новый ОписаниеТипов("СписокЗначений"));
	
	ОписаниеТипаВариантыМоментовАктивацииТриггерныхСобытий 	= Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыМоментовАктивацииТриггерныхСобытий");
	ОписаниеВидаПериодаСобытия 								= Новый ОписаниеТипов("ПеречислениеСсылка.Периодичность");
	ОписаниеЗавершающихЭтаповСделок							= Новый ОписаниеТипов("СправочникСсылка.ЭтапыСделок");
	
	
#Область ___________________________СОБЫТИЯ_ПО_КЛИЕНТАМ_____________________________

	// ПациентРегистрация
	СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоПациентам");	
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия);
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия);
	
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Час);
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Минута);
	
	СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентРегистрация);
	СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Истина);
	СтруктураПараметровТриггера.Вставить("РазрешенаРаботаСоСделками"						, Истина);
	СтруктураПараметровТриггера.Вставить("ДопустимыйВидСделки"								, Справочники.ВидыСделок.НовыеПациенты);
	
	ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);
	
	// ПациентДеньРождения
	СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоПациентам");	
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия);
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия, "В день события");
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия);
	
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	
	СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентДеньРождения);
	
	ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);
	
	// ПациентОкончаниеСрокаДействияСтраховогоПолиса
	СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоПациентам");	
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия);
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия, "В день события");
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия);
	
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	
	СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентОкончаниеСрокаДействияСтраховогоПолиса);
	
	ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);
	
#КонецОбласти

#Область ____________________________СОБЫТИЯ_ПО_КАРТАМ______________________________

	//// Установка карты Wallet новому клиенту	
	//СписокМоментовАктивации 				= Новый СписокЗначений;
	//СписокМоментовАктивации.ТипЗначения 	= ОписаниеТипаВариантыМоментовАктивацииТриггерныхСобытий;	
	//СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия);
	//СписокВидовПериодаАктивации				= Новый СписокЗначений;
	//СписокВидовПериодаАктивации.ТипЗначения = ОписаниеВидаПериодаСобытия;
	//СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	//СписокДопустимыхЗавершающихЭтаповСделок = Новый СписокЗначений;
	//СписокДопустимыхЗавершающихЭтаповСделок.ТипЗначения = ОписаниеЗавершающихЭтаповСделок;
	//СписокДопустимыхЗавершающихЭтаповСделок.Добавить(Справочники.ЭтапыСделок.Успех);
	//
	//СтруктураПараметровТриггера = Новый Структура;
	//СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.КартыУстановкаКартыWalletНовомуКлиенту);
	//СтруктураПараметровТриггера.Вставить("ВиртуальнаяГруппаСобытий"							, "СобытияПоКартам");
	//СтруктураПараметровТриггера.Вставить("СписокМоментовАктивации"							, СписокМоментовАктивации);
	//СтруктураПараметровТриггера.Вставить("СписокВидовПериодаАктивации"						, СписокВидовПериодаАктивации);	
	//СтруктураПараметровТриггера.Вставить("БазовыйВариант"									, Ложь);
	//СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Истина);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяПараметрСобытия"						, Ложь);
	//СтруктураПараметровТриггера.Вставить("ОбязательноеЗаполнениеПараметраСобытия"			, Ложь);
	//СтруктураПараметровТриггера.Вставить("МинимальноеЗначениеПараметраСобытия"				, 0);
	//СтруктураПараметровТриггера.Вставить("ИмяЭлементаПараметраСобытия"						, "ПараметрСобытия");
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяТипАктивацииЧленстваПакетаУслуг"		, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСтруктурнойЕдинице"			, Ложь);		
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоИсточникамЗаписи"				, Ложь);	
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСегментуУслуг"					, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуСделки"					, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуЛицевогоСчета"				, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуБонусногоСчета"			, Ложь);		
	//СтруктураПараметровТриггера.Вставить("ОбязательноеЗаполнениеСегментаУслуг"				, Ложь);
	//СтруктураПараметровТриггера.Вставить("РазрешенаРаботаСоСделками"						, Истина);
	//СтруктураПараметровТриггера.Вставить("ДопустимыйТипСделки"								, Перечисления.ТипыСделок.Продажа);
	//СтруктураПараметровТриггера.Вставить("СписокДопустимыхЗавершающихЭтаповСделок"			, СписокДопустимыхЗавершающихЭтаповСделок);
	//
	//ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);

#КонецОбласти

#Область _______________________СОБЫТИЯ_ПО_ЛИЦЕВЫМ_СЧЕТАМ___________________________

	// ЛицевойСчетВзнос
	СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоЛицевымСчетам");	
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия);

	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Час);
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Минута);
	
	СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетВзнос);
	СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Истина);
	СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуЛицевогоСчета"				, Истина);	
	
	ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);

	// ЛицевойСчетСписание
	СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоЛицевымСчетам");	
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия);

	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Час);
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Минута);
	
	СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетСписание);
	СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Истина);
	СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуЛицевогоСчета"				, Истина);	
	
	ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);
	
	//// ЛицевойСчетКритическийОстатокСредств
	//СписокМоментовАктивации 			= Новый СписокЗначений;
	//СписокМоментовАктивации.ТипЗначения = ОписаниеТипаВариантыМоментовАктивацииТриггерныхСобытий;	
	//СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия);
	//СписокВидовПериодаАктивации			= Новый СписокЗначений;
	//СписокВидовПериодаАктивации.ТипЗначения = ОписаниеВидаПериодаСобытия;
	//СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	//СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Час);
	//СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Минута);
	//СписокДопустимыхЗавершающихЭтаповСделок = Новый СписокЗначений;
	//СписокДопустимыхЗавершающихЭтаповСделок.ТипЗначения = ОписаниеЗавершающихЭтаповСделок;
	//
	//СтруктураПараметровТриггера = Новый Структура;
	//СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетКритическийОстатокСредств);
	//СтруктураПараметровТриггера.Вставить("ВиртуальнаяГруппаСобытий"							, "СобытияПоЛицевымСчетам");
	//СтруктураПараметровТриггера.Вставить("СписокМоментовАктивации"							, СписокМоментовАктивации);
	//СтруктураПараметровТриггера.Вставить("СписокВидовПериодаАктивации"						, СписокВидовПериодаАктивации);	
	//СтруктураПараметровТриггера.Вставить("БазовыйВариант"									, Ложь);
	//СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Истина);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяПараметрСобытия"						, Истина);
	//СтруктураПараметровТриггера.Вставить("ОбязательноеЗаполнениеПараметраСобытия"			, Истина);
	//СтруктураПараметровТриггера.Вставить("МинимальноеЗначениеПараметраСобытия"				, 0);
	//СтруктураПараметровТриггера.Вставить("ИмяЭлементаПараметраСобытия"						, "ПараметрСобытия");
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяТипАктивацииЧленстваПакетаУслуг"		, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСтруктурнойЕдинице"			, Ложь);		
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоИсточникамЗаписи"				, Ложь);	
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСегментуУслуг"					, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуСделки"					, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуЛицевогоСчета"				, Истина);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуБонусногоСчета"			, Ложь);		
	//СтруктураПараметровТриггера.Вставить("ОбязательноеЗаполнениеСегментаУслуг"				, Ложь);
	//СтруктураПараметровТриггера.Вставить("РазрешенаРаботаСоСделками"						, Ложь);
	//СтруктураПараметровТриггера.Вставить("ДопустимыйТипСделки"								, Перечисления.ТипыСделок.ПустаяСсылка());
	//СтруктураПараметровТриггера.Вставить("СписокДопустимыхЗавершающихЭтаповСделок"			, СписокДопустимыхЗавершающихЭтаповСделок);
	//
	//ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);

	//// ЛицевойСчетОкончаниеСрокаДействия
	//СписокМоментовАктивации 			= Новый СписокЗначений;
	//СписокМоментовАктивации.ТипЗначения = ОписаниеТипаВариантыМоментовАктивацииТриггерныхСобытий;	
	//СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия);
	//СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия, "В день события");
	//СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия);
	//СписокВидовПериодаАктивации			= Новый СписокЗначений;
	//СписокВидовПериодаАктивации.ТипЗначения = ОписаниеВидаПериодаСобытия;
	//СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	//СписокДопустимыхЗавершающихЭтаповСделок = Новый СписокЗначений;
	//СписокДопустимыхЗавершающихЭтаповСделок.ТипЗначения = ОписаниеЗавершающихЭтаповСделок;
	//
	//СтруктураПараметровТриггера = Новый Структура;
	//СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетОкончаниеСрокаДействия);
	//СтруктураПараметровТриггера.Вставить("ВиртуальнаяГруппаСобытий"							, "СобытияПоЛицевымСчетам");
	//СтруктураПараметровТриггера.Вставить("СписокМоментовАктивации"							, СписокМоментовАктивации);
	//СтруктураПараметровТриггера.Вставить("СписокВидовПериодаАктивации"						, СписокВидовПериодаАктивации);	
	//СтруктураПараметровТриггера.Вставить("БазовыйВариант"									, Ложь);
	//СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяПараметрСобытия"						, Ложь);
	//СтруктураПараметровТриггера.Вставить("ОбязательноеЗаполнениеПараметраСобытия"			, Ложь);
	//СтруктураПараметровТриггера.Вставить("МинимальноеЗначениеПараметраСобытия"				, 0);
	//СтруктураПараметровТриггера.Вставить("ИмяЭлементаПараметраСобытия"						, "ПараметрСобытия");
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяТипАктивацииЧленстваПакетаУслуг"		, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСтруктурнойЕдинице"			, Ложь);		
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоИсточникамЗаписи"				, Ложь);	
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСегментуУслуг"					, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуСделки"					, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуЛицевогоСчета"				, Истина);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуБонусногоСчета"			, Ложь);		
	//СтруктураПараметровТриггера.Вставить("ОбязательноеЗаполнениеСегментаУслуг"				, Ложь);
	//СтруктураПараметровТриггера.Вставить("РазрешенаРаботаСоСделками"						, Ложь);
	//СтруктураПараметровТриггера.Вставить("ДопустимыйТипСделки"								, Перечисления.ТипыСделок.ПустаяСсылка());
	//СтруктураПараметровТриггера.Вставить("СписокДопустимыхЗавершающихЭтаповСделок"			, СписокДопустимыхЗавершающихЭтаповСделок);
	//
	//ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);
	//
#КонецОбласти

#Область _______________________СОБЫТИЯ_ПО_БОНУСНЫМ_СЧЕТАМ__________________________

	//// БонусныйСчетНачисление
	//СписокМоментовАктивации 			= Новый СписокЗначений;
	//СписокМоментовАктивации.ТипЗначения = ОписаниеТипаВариантыМоментовАктивацииТриггерныхСобытий;	
	//СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия);
	//СписокВидовПериодаАктивации			= Новый СписокЗначений;
	//СписокВидовПериодаАктивации.ТипЗначения = ОписаниеВидаПериодаСобытия;
	//СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	//СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Час);
	//СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Минута);
	//СписокДопустимыхЗавершающихЭтаповСделок = Новый СписокЗначений;
	//СписокДопустимыхЗавершающихЭтаповСделок.ТипЗначения = ОписаниеЗавершающихЭтаповСделок;
	//
	//СтруктураПараметровТриггера = Новый Структура;
	//СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.БонусныйСчетНачисление);
	//СтруктураПараметровТриггера.Вставить("ВиртуальнаяГруппаСобытий"							, "СобытияПоБонуснымСчетам");
	//СтруктураПараметровТриггера.Вставить("СписокМоментовАктивации"							, СписокМоментовАктивации);
	//СтруктураПараметровТриггера.Вставить("СписокВидовПериодаАктивации"						, СписокВидовПериодаАктивации);	
	//СтруктураПараметровТриггера.Вставить("БазовыйВариант"									, Ложь);
	//СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Истина);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяПараметрСобытия"						, Ложь);
	//СтруктураПараметровТриггера.Вставить("ОбязательноеЗаполнениеПараметраСобытия"			, Ложь);
	//СтруктураПараметровТриггера.Вставить("МинимальноеЗначениеПараметраСобытия"				, 0);
	//СтруктураПараметровТриггера.Вставить("ИмяЭлементаПараметраСобытия"						, "ПараметрСобытия");
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяТипАктивацииЧленстваПакетаУслуг"		, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСтруктурнойЕдинице"			, Ложь);		
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоИсточникамЗаписи"				, Ложь);	
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСегментуУслуг"					, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуСделки"					, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуЛицевогоСчета"				, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуБонусногоСчета"			, Истина);				
	//СтруктураПараметровТриггера.Вставить("ОбязательноеЗаполнениеСегментаУслуг"				, Ложь);
	//СтруктураПараметровТриггера.Вставить("РазрешенаРаботаСоСделками"						, Ложь);
	//СтруктураПараметровТриггера.Вставить("ДопустимыйТипСделки"								, Перечисления.ТипыСделок.ПустаяСсылка());
	//СтруктураПараметровТриггера.Вставить("СписокДопустимыхЗавершающихЭтаповСделок"			, СписокДопустимыхЗавершающихЭтаповСделок);
	//
	//ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);

	//// БонусныйСчетСписание
	//СписокМоментовАктивации 			= Новый СписокЗначений;
	//СписокМоментовАктивации.ТипЗначения = ОписаниеТипаВариантыМоментовАктивацииТриггерныхСобытий;	
	//СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия);
	//СписокВидовПериодаАктивации			= Новый СписокЗначений;
	//СписокВидовПериодаАктивации.ТипЗначения = ОписаниеВидаПериодаСобытия;
	//СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	//СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Час);
	//СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Минута);
	//СписокДопустимыхЗавершающихЭтаповСделок = Новый СписокЗначений;
	//СписокДопустимыхЗавершающихЭтаповСделок.ТипЗначения = ОписаниеЗавершающихЭтаповСделок;
	//
	//СтруктураПараметровТриггера = Новый Структура;
	//СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.БонусныйСчетСписание);
	//СтруктураПараметровТриггера.Вставить("ВиртуальнаяГруппаСобытий"							, "СобытияПоБонуснымСчетам");
	//СтруктураПараметровТриггера.Вставить("СписокМоментовАктивации"							, СписокМоментовАктивации);
	//СтруктураПараметровТриггера.Вставить("СписокВидовПериодаАктивации"						, СписокВидовПериодаАктивации);	
	//СтруктураПараметровТриггера.Вставить("БазовыйВариант"									, Ложь);
	//СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Истина);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяПараметрСобытия"						, Ложь);
	//СтруктураПараметровТриггера.Вставить("ОбязательноеЗаполнениеПараметраСобытия"			, Ложь);
	//СтруктураПараметровТриггера.Вставить("МинимальноеЗначениеПараметраСобытия"				, 0);
	//СтруктураПараметровТриггера.Вставить("ИмяЭлементаПараметраСобытия"						, "ПараметрСобытия");
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяТипАктивацииЧленстваПакетаУслуг"		, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСтруктурнойЕдинице"			, Ложь);		
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоИсточникамЗаписи"				, Ложь);	
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСегментуУслуг"					, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуСделки"					, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуЛицевогоСчета"				, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуБонусногоСчета"			, Истина);					
	//СтруктураПараметровТриггера.Вставить("ОбязательноеЗаполнениеСегментаУслуг"				, Ложь);
	//СтруктураПараметровТриггера.Вставить("РазрешенаРаботаСоСделками"						, Ложь);
	//СтруктураПараметровТриггера.Вставить("ДопустимыйТипСделки"								, Перечисления.ТипыСделок.ПустаяСсылка());
	//СтруктураПараметровТриггера.Вставить("СписокДопустимыхЗавершающихЭтаповСделок"			, СписокДопустимыхЗавершающихЭтаповСделок);
	//
	//ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);
	//
	//// БонусныйСчетОкончаниеСрокаДействия
	//СписокМоментовАктивации 			= Новый СписокЗначений;
	//СписокМоментовАктивации.ТипЗначения = ОписаниеТипаВариантыМоментовАктивацииТриггерныхСобытий;	
	//СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия);
	//СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия, "В день события");
	//СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия);
	//СписокВидовПериодаАктивации			= Новый СписокЗначений;
	//СписокВидовПериодаАктивации.ТипЗначения = ОписаниеВидаПериодаСобытия;
	//СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	//СписокДопустимыхЗавершающихЭтаповСделок = Новый СписокЗначений;
	//СписокДопустимыхЗавершающихЭтаповСделок.ТипЗначения = ОписаниеЗавершающихЭтаповСделок;
	//
	//СтруктураПараметровТриггера = Новый Структура;
	//СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.БонусныйСчетОкончаниеСрокаДействия);
	//СтруктураПараметровТриггера.Вставить("ВиртуальнаяГруппаСобытий"							, "СобытияПоБонуснымСчетам");
	//СтруктураПараметровТриггера.Вставить("СписокМоментовАктивации"							, СписокМоментовАктивации);
	//СтруктураПараметровТриггера.Вставить("СписокВидовПериодаАктивации"						, СписокВидовПериодаАктивации);	
	//СтруктураПараметровТриггера.Вставить("БазовыйВариант"									, Ложь);
	//СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяПараметрСобытия"						, Ложь);
	//СтруктураПараметровТриггера.Вставить("ОбязательноеЗаполнениеПараметраСобытия"			, Ложь);
	//СтруктураПараметровТриггера.Вставить("МинимальноеЗначениеПараметраСобытия"				, 0);
	//СтруктураПараметровТриггера.Вставить("ИмяЭлементаПараметраСобытия"						, "ПараметрСобытия");
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяТипАктивацииЧленстваПакетаУслуг"		, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСтруктурнойЕдинице"			, Ложь);		
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоИсточникамЗаписи"				, Ложь);	
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСегментуУслуг"					, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуСделки"					, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуЛицевогоСчета"				, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуБонусногоСчета"			, Истина);					
	//СтруктураПараметровТриггера.Вставить("ОбязательноеЗаполнениеСегментаУслуг"				, Ложь);
	//СтруктураПараметровТриггера.Вставить("РазрешенаРаботаСоСделками"						, Ложь);
	//СтруктураПараметровТриггера.Вставить("ДопустимыйТипСделки"								, Перечисления.ТипыСделок.ПустаяСсылка());
	//СтруктураПараметровТриггера.Вставить("СписокДопустимыхЗавершающихЭтаповСделок"			, СписокДопустимыхЗавершающихЭтаповСделок);
	//
	//ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);
	
#КонецОбласти

#Область ___________________________СОБЫТИЯ_ПО_ЗАЯВКАМ______________________________

	// ЗаявкаНеОбработана
	СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоЗаявкам");	
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия);

	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Час);
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Минута);
	
	СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий", Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаявкаНеОбработана);
	
	ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);

#КонецОбласти

#Область ___________________________СОБЫТИЯ_ПО_СДЕЛКАМ______________________________

	//// Смена этапа	
	//СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоВоронкам");	
	//СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия);
	//СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия);

	//СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	//СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Час);
	//СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Минута);
	//
	//СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаСменаЭтапа);
	//СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Истина);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуСделки"					, Истина);
	//
	//ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);

	//// Задержка на этапе	
	//СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоВоронкам");	
	//СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия);

	//СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);	
	//СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Час);
	//СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Минута);

	//СтруктураПараметровТриггера.СписокДопустимыхЗавершающихЭтаповСделок.Добавить(Справочники.ЭтапыСделок.Отказ);
	//
	//СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуСделки"					, Истина);
	//СтруктураПараметровТриггера.Вставить("РазрешенаРаботаСоСделками"						, Истина);
	//
	//ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);
	
#КонецОбласти

#Область __________________________СОБЫТИЯ_ПО_ПРОДАЖАМ______________________________

	//// Продажа
	//СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоПродажам");	
	//СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия);

	//СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	//СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Час);
	//СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Минута);

	//СтруктураПараметровТриггера.СписокДопустимыхЗавершающихЭтаповСделок.Добавить(Справочники.ЭтапыСделок.Успех);
	//
	//СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.Продажа);
	//СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Истина);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСегментуЧленстваПакетаУслуг"	, Истина);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСегментуУслуг"					, Истина);
	//СтруктураПараметровТриггера.Вставить("РазрешенаРаботаСоСделками"						, Истина);
	//
	//ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);

	//// ПродажаОплатаПолная
	//СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоПродажам");	
	//СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия);

	//СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	//СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Час);
	//СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Минута);
	//
	//СтруктураПараметровТриггера.СписокДопустимыхЗавершающихЭтаповСделок.Добавить(Справочники.ЭтапыСделок.Успех);
	//
	//СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.ПродажаОплатаПолная);
	//СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Истина);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСегментуЧленстваПакетаУслуг"	, Истина);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСегментуУслуг"					, Истина);
	//СтруктураПараметровТриггера.Вставить("РазрешенаРаботаСоСделками"						, Истина);
	//
	//ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);
	//
	//// ПродажаОплатаЧастичная
	//СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоПродажам");	
	//СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия);

	//СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	//СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Час);
	//СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Минута);

	//СтруктураПараметровТриггера.СписокДопустимыхЗавершающихЭтаповСделок.Добавить(Справочники.ЭтапыСделок.Успех);
	//
	//СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.ПродажаОплатаЧастичная);
	//СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Истина);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСегментуЧленстваПакетаУслуг"	, Истина);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСегментуУслуг"					, Истина);
	//СтруктураПараметровТриггера.Вставить("РазрешенаРаботаСоСделками"						, Истина);
	//
	//ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);
	//
	//// ПродажаНеОплаченаПолностью
	//СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоПродажам");	
	//СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия);

	//СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);

	//СтруктураПараметровТриггера.СписокДопустимыхЗавершающихЭтаповСделок.Добавить(Справочники.ЭтапыСделок.Отказ);
	//
	//СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.ПродажаНеОплаченаПолностью);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСегментуЧленстваПакетаУслуг"	, Истина);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСегментуУслуг"					, Истина);
	//СтруктураПараметровТриггера.Вставить("РазрешенаРаботаСоСделками"						, Истина);
	//
	//ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);
	
#КонецОбласти

#Область _______________________СОБЫТИЯ_ПО_ЗАДОЛЖЕННОСТЯМ___________________________

	//// ПродажаПлатежПоРассрочке
	//СписокМоментовАктивации 			= Новый СписокЗначений;
	//СписокМоментовАктивации.ТипЗначения = ОписаниеТипаВариантыМоментовАктивацииТриггерныхСобытий;	
	//СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия);
	//СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия, "В день события");
	//СписокВидовПериодаАктивации			= Новый СписокЗначений;
	//СписокВидовПериодаАктивации.ТипЗначения = ОписаниеВидаПериодаСобытия;
	//СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	//СписокДопустимыхЗавершающихЭтаповСделок = Новый СписокЗначений;
	//СписокДопустимыхЗавершающихЭтаповСделок.ТипЗначения = ОписаниеЗавершающихЭтаповСделок;
	//
	//СтруктураПараметровТриггера = Новый Структура;
	//СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.ПродажаПлатежПоРассрочке);
	//СтруктураПараметровТриггера.Вставить("ВиртуальнаяГруппаСобытий"							, "СобытияПоЗадолженностям");
	//СтруктураПараметровТриггера.Вставить("СписокМоментовАктивации"							, СписокМоментовАктивации);
	//СтруктураПараметровТриггера.Вставить("СписокВидовПериодаАктивации"						, СписокВидовПериодаАктивации);	
	//СтруктураПараметровТриггера.Вставить("БазовыйВариант"									, Истина);
	//СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяПараметрСобытия"						, Ложь);
	//СтруктураПараметровТриггера.Вставить("ОбязательноеЗаполнениеПараметраСобытия"			, Ложь);
	//СтруктураПараметровТриггера.Вставить("МинимальноеЗначениеПараметраСобытия"				, 0);
	//СтруктураПараметровТриггера.Вставить("ИмяЭлементаПараметраСобытия"						, "ПараметрСобытия");
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяТипАктивацииЧленстваПакетаУслуг"		, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСтруктурнойЕдинице"			, Ложь);		
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоИсточникамЗаписи"				, Ложь);	
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСегментуУслуг"					, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуСделки"					, Ложь);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуЛицевогоСчета"				, Ложь);					
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуБонусногоСчета"			, Ложь);		
	//СтруктураПараметровТриггера.Вставить("ОбязательноеЗаполнениеСегментаУслуг"				, Ложь);
	//СтруктураПараметровТриггера.Вставить("РазрешенаРаботаСоСделками"						, Ложь);
	//СтруктураПараметровТриггера.Вставить("ДопустимыйТипСделки"								, Перечисления.ТипыСделок.ПустаяСсылка());
	//СтруктураПараметровТриггера.Вставить("СписокДопустимыхЗавершающихЭтаповСделок"			, СписокДопустимыхЗавершающихЭтаповСделок);
	//
	//ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);
	
#КонецОбласти

#Область _______________________СОБЫТИЯ_ПО_ЛИСТУ_ОЖИДАНИЯ___________________________

	// ЛистОжиданияВыписаноНаправление
	СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоЛистуОжидания");	
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия);

	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	
	СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий", Перечисления.ВариантыУсловийТриггерныхСобытий.ЛистОжиданияВыписаноНаправление);
	
	ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);

	// ЛистОжиданияОчередьНаЗапись	
	СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоЛистуОжидания");	
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия);
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия, "В день события");

	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	
	СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий", Перечисления.ВариантыУсловийТриггерныхСобытий.ЛистОжиданияОчередьНаЗапись);
	
	ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);

	// ЛистОжиданияПрофосмотр	
	СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоЛистуОжидания");	
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия);
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия, "В день события");

	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	
	СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий", Перечисления.ВариантыУсловийТриггерныхСобытий.ЛистОжиданияПрофосмотр);
	
	ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);

#КонецОбласти

#Область __________________________СОБЫТИЯ_ПО_ЗАПИСЯМ_______________________________

	// ЗаписьСозданиеЗаписиНаПрием
	СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоЗаписям");	
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия);
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия);

	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Час);
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Минута);
	
	СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСозданиеЗаписиНаПрием);
	СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Истина);
	СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоИсточникамЗаписи"				, Истина);
	
	ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);
	
	// ЗаписьСменаСтатусаСотрудникомКлиники
	СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоЗаписям");	
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия);

	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Час);
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Минута);
	
	СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаСотрудникомКлиники);
	СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Истина);
	СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоИсточникамЗаписи"				, Истина);	
	
	ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);
	
	// ЗаписьСменаСтатусаПациентом
	СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоЗаписям");	
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия);

	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Час);
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Минута);
	
	СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаПациентом);
	СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Истина);
	СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоИсточникамЗаписи"				, Истина);	
	
	ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);
	
	// ЗаписьНачалоПриема
	СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоЗаписям");	
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия);
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия, "В момент события (погрешность в пределах 5 минут)");
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия);

	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Час);
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Минута);
	
	СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема);
	СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоИсточникамЗаписи"				, Истина);		
	
	ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);
		
#КонецОбласти

#Область __________________________СОБЫТИЯ_ПО_ПРИЕМАМ_______________________________

	//// ПриемЗавершенПродолжаетЛечение
	//СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоПриемам");	
	//СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия);
	//СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия);

	//СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	//СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Час);
	//СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Минута);
	//
	//СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершенПродолжаетЛечение);
	//СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Истина);
	//СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСегментуУслуг"					, Истина);

	//ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);

	// ПриемЗавершен
	СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоПриемам");	
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия);
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия);

	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Час);
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Минута);
	
	СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершен);
	СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Истина);
	СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСегментуУслуг"					, Истина);

	ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);
	
#КонецОбласти

#Область _______________________СОБЫТИЯ_ПО_ПЛАНАМ_ЛЕЧЕНИЯ___________________________

	// ЗаписьСозданиеЗаписиНаПрием
	СтруктураПараметровТриггера = ИнициализироватьСтруктуруПараметровТриггера("СобытияПоПланамЛечения");	
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия);
	СтруктураПараметровТриггера.СписокМоментовАктивации.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия);

	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.День);
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Час);
	СтруктураПараметровТриггера.СписокВидовПериодаАктивации.Добавить(Перечисления.Периодичность.Минута);
	
	СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.ПланЛеченияСозданиеПланаЛечения);
	СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Истина);
	СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСегментуУслуг"					, Истина);
	СтруктураПараметровТриггера.Вставить("РазрешенаРаботаСоСделками"						, Истина);
	СтруктураПараметровТриггера.Вставить("РазрешенаРаботаСЧатБотом"							, Ложь);
	
	ЗаполнитьЗначенияСвойств(ТаблицуВсехВариантовУсловийТриггерныхСобытий.Добавить(), СтруктураПараметровТриггера);
		
#КонецОбласти

	ТаблицуВсехВариантовУсловийТриггерныхСобытий.Сортировать("ПорядковыйНомерВиртуальнойГруппыСобытий");
	
	Возврат ТаблицуВсехВариантовУсловийТриггерныхСобытий;
	
КонецФункции	

// Функция - Инициализировать структуру параметров триггера
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСтруктуруПараметровТриггера(ВиртуальнаяГруппаСобытий = "")

	СтруктураПараметровТриггера = Новый Структура;
	СтруктураПараметровТриггера.Вставить("ВариантыУсловийТриггерныхСобытий"					, Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка());
	СтруктураПараметровТриггера.Вставить("ВиртуальнаяГруппаСобытий"							, ВиртуальнаяГруппаСобытий);
	СтруктураПараметровТриггера.Вставить("ПредставлениеВиртуальнойГруппыСобытий"			, СформироватьПредставлениеВиртуальнойГруппы(ВиртуальнаяГруппаСобытий));
	СтруктураПараметровТриггера.Вставить("ПорядковыйНомерВиртуальнойГруппыСобытий"			, ОпределитьПорядковыйНомерВиртуальнойГруппы(ВиртуальнаяГруппаСобытий));		
	СписокМоментовАктивации 							= Новый СписокЗначений;
	СписокМоментовАктивации.ТипЗначения 				= Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыМоментовАктивацииТриггерныхСобытий");		
	СтруктураПараметровТриггера.Вставить("СписокМоментовАктивации"							, СписокМоментовАктивации);
	СписокВидовПериодаАктивации							= Новый СписокЗначений;
	СписокВидовПериодаАктивации.ТипЗначения 			= Новый ОписаниеТипов("ПеречислениеСсылка.Периодичность");	
	СтруктураПараметровТриггера.Вставить("СписокВидовПериодаАктивации"						, СписокВидовПериодаАктивации);	
	СтруктураПараметровТриггера.Вставить("БазовыйВариант"									, Истина);
	СтруктураПараметровТриггера.Вставить("ГибридныйВариантИнициацииТриггера"				, Ложь);
	СтруктураПараметровТриггера.Вставить("ИспользуетсяПараметрСобытия"						, Ложь);
	СтруктураПараметровТриггера.Вставить("ОбязательноеЗаполнениеПараметраСобытия"			, Ложь);
	СтруктураПараметровТриггера.Вставить("МинимальноеЗначениеПараметраСобытия"				, 0);
	СтруктураПараметровТриггера.Вставить("ИмяЭлементаПараметраСобытия"						, "ПараметрСобытия");
	СтруктураПараметровТриггера.Вставить("ИспользуетсяТипАктивацииЧленстваПакетаУслуг"		, Ложь);
	СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСтруктурнойЕдинице"			, Ложь);		
	СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоИсточникамЗаписи"				, Ложь);	
	СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоСегментуУслуг"					, Ложь);
	СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуСделки"					, Ложь);		
	СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуЛицевогоСчета"				, Ложь);
	СтруктураПараметровТриггера.Вставить("ИспользуетсяОтборПоВидуБонусногоСчета"			, Ложь);	
	СтруктураПараметровТриггера.Вставить("ОбязательноеЗаполнениеСегментаУслуг"				, Ложь);
	СтруктураПараметровТриггера.Вставить("РазрешенаРаботаСоСделками"						, Ложь);
	СтруктураПараметровТриггера.Вставить("РазрешенаРаботаСЧатБотом"							, Истина);
	СтруктураПараметровТриггера.Вставить("ДопустимыйВидСделки"								, Справочники.ВидыСделок.ПустаяСсылка());
	СписокДопустимыхЗавершающихЭтаповСделок 			= Новый СписокЗначений;
	СписокДопустимыхЗавершающихЭтаповСделок.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЭтапыСделок");
	СтруктураПараметровТриггера.Вставить("СписокДопустимыхЗавершающихЭтаповСделок"			, СписокДопустимыхЗавершающихЭтаповСделок);

	Возврат СтруктураПараметровТриггера;
	
КонецФункции

// Функция - Сформировать представление виртуальной группы
//
// Параметры:
//  ВиртуальнаяГруппаСобытий - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьПредставлениеВиртуальнойГруппы(ВиртуальнаяГруппаСобытий = "")
	
	ПредставлениеВиртуальнойГруппы = "";
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(ВиртуальнаяГруппаСобытий)) Тогда 
		Возврат ПредставлениеВиртуальнойГруппы;
	КонецЕсли;
	
	Если СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоПациентам" Тогда 
		ПредставлениеВиртуальнойГруппы = "Пациенты";	
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоКартам" Тогда
		ПредставлениеВиртуальнойГруппы = "Карты";
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоЗаявкам" Тогда
		ПредставлениеВиртуальнойГруппы = "Заявки";	
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоВоронкам" Тогда
		ПредставлениеВиртуальнойГруппы = "Сделки";	
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоЛистуОжидания" Тогда
		ПредставлениеВиртуальнойГруппы = "Планирование приёмов (лист ожидания)";	
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоЗаписям" Тогда
		ПредставлениеВиртуальнойГруппы = "Записи на приём";	
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоПриемам" Тогда
		ПредставлениеВиртуальнойГруппы = "Приёмы";
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоПланамЛечения" Тогда
		ПредставлениеВиртуальнойГруппы = "Планы лечения";		
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоПродажам" Тогда
		ПредставлениеВиртуальнойГруппы = "Продажи";
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоЗадолженностям" Тогда
		ПредставлениеВиртуальнойГруппы = "Задолженности";	
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоЛицевымСчетам" Тогда
		ПредставлениеВиртуальнойГруппы = "Лицевые счета";	
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоБонуснымСчетам" Тогда
		ПредставлениеВиртуальнойГруппы = "Бонусные счета";	
	Иначе 
		ПредставлениеВиртуальнойГруппы = "Другое";	
	КонецЕсли;
	
	Возврат ПредставлениеВиртуальнойГруппы;
	
КонецФункции

// Функция - Определить порядковый номер виртуальной группы
//
// Параметры:
//  ВиртуальнаяГруппаСобытий - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОпределитьПорядковыйНомерВиртуальнойГруппы(ВиртуальнаяГруппаСобытий = "")
	
	ПорядковыйНомерВиртуальнойГруппы = 0;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(ВиртуальнаяГруппаСобытий)) Тогда 
		Возврат ПорядковыйНомерВиртуальнойГруппы;
	КонецЕсли;
	
	Если СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоПациентам" Тогда 
		ПорядковыйНомерВиртуальнойГруппы = 1;	
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоКартам" Тогда
		ПорядковыйНомерВиртуальнойГруппы = 2;
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоЗаявкам" Тогда
		ПорядковыйНомерВиртуальнойГруппы = 3;	
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоВоронкам" Тогда
		ПорядковыйНомерВиртуальнойГруппы = 4;	
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоЛистуОжидания" Тогда
		ПорядковыйНомерВиртуальнойГруппы = 5;	
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоЗаписям" Тогда
		ПорядковыйНомерВиртуальнойГруппы = 6;	
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоПриемам" Тогда
		ПорядковыйНомерВиртуальнойГруппы = 7;
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоПланамЛечения" Тогда
		ПорядковыйНомерВиртуальнойГруппы = 8;			
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоПродажам" Тогда
		ПорядковыйНомерВиртуальнойГруппы = 9;
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоЗадолженностям" Тогда
		ПорядковыйНомерВиртуальнойГруппы = 10;	
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоЛицевымСчетам" Тогда
		ПорядковыйНомерВиртуальнойГруппы = 11;	
	ИначеЕсли СокрЛП(ВиртуальнаяГруппаСобытий) = "СобытияПоБонуснымСчетам" Тогда
		ПорядковыйНомерВиртуальнойГруппы = 12;	
	Иначе 
		ПорядковыйНомерВиртуальнойГруппы = 99;	
	КонецЕсли;
	
	Возврат ПорядковыйНомерВиртуальнойГруппы;
	
КонецФункции

// Функция - Получить массив триггеров
//
// Параметры:
//  ВиртуальнаяГруппаСобытий			 - 	 - 
//  ГибридныйВариантИнициацииТриггера	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивТриггеров(ВиртуальнаяГруппаСобытий = "", ГибридныйВариантИнициацииТриггера = Неопределено) Экспорт 
	
	ТаблицуВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	Если ЗначениеЗаполнено(ВиртуальнаяГруппаСобытий) Тогда
		Если ГибридныйВариантИнициацииТриггера <> Неопределено Тогда 
			Возврат ТаблицуВсехВариантовУсловийТриггерныхСобытий.Скопировать(Новый Структура("ВиртуальнаяГруппаСобытий, ГибридныйВариантИнициацииТриггера", ВиртуальнаяГруппаСобытий, ГибридныйВариантИнициацииТриггера), "ВариантыУсловийТриггерныхСобытий").ВыгрузитьКолонку("ВариантыУсловийТриггерныхСобытий");
		Иначе 
			Возврат ТаблицуВсехВариантовУсловийТриггерныхСобытий.Скопировать(Новый Структура("ВиртуальнаяГруппаСобытий", ВиртуальнаяГруппаСобытий), "ВариантыУсловийТриггерныхСобытий").ВыгрузитьКолонку("ВариантыУсловийТриггерныхСобытий");
		КонецЕсли;	
	Иначе
		Если ГибридныйВариантИнициацииТриггера <> Неопределено Тогда 
			Возврат ТаблицуВсехВариантовУсловийТриггерныхСобытий.Скопировать(Новый Структура("ГибридныйВариантИнициацииТриггера", ГибридныйВариантИнициацииТриггера), "ВариантыУсловийТриггерныхСобытий").ВыгрузитьКолонку("ВариантыУсловийТриггерныхСобытий");
		Иначе 
			Возврат ТаблицуВсехВариантовУсловийТриггерныхСобытий.ВыгрузитьКолонку("ВариантыУсловийТриггерныхСобытий");
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции

// Процедура - Исключить не регламентные варианты триггерных событий
//
// Параметры:
//  МассивГибридныхТриггеров - 	 - 
//
Процедура ИсключитьНеРегламентныеВариантыТриггерныхСобытий(МассивГибридныхТриггеров) Экспорт
	
	МассивВариантовТриггерныхСобытий = ВариантыСрабатываемыеИсключительноПоПодписке();
	
	Для Каждого ВариантТриггерныхСобытий Из МассивВариантовТриггерныхСобытий Цикл 
		ИндексЭлемента = МассивГибридныхТриггеров.Найти(ВариантТриггерныхСобытий);
		Если ИндексЭлемента <> Неопределено Тогда 
			МассивГибридныхТриггеров.Удалить(ИндексЭлемента); // Это не совсем гибридный триггер. Он инициируется пока исключительно по подписке. 
		КонецЕсли;		
	КонецЦикла;
	
	//ИндексЭлемента = МассивГибридныхТриггеров.Найти(Перечисления.ВариантыУсловийТриггерныхСобытий.КартыУстановкаКартыWalletНовомуКлиенту);
	//Если ИндексЭлемента <> Неопределено Тогда 
	//	МассивГибридныхТриггеров.Удалить(ИндексЭлемента); // Это не совсем гибридный триггер. Он инициируется пока исключительно по подписке. 
	//КонецЕсли;		
	//ИндексЭлемента = МассивГибридныхТриггеров.Найти(Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетВзнос);
	//Если ИндексЭлемента <> Неопределено Тогда 
	//	МассивГибридныхТриггеров.Удалить(ИндексЭлемента); // Это не совсем гибридный триггер. Он инициируется пока исключительно по подписке. 
	//КонецЕсли;	
	//ИндексЭлемента = МассивГибридныхТриггеров.Найти(Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетСписание);
	//Если ИндексЭлемента <> Неопределено Тогда 
	//	МассивГибридныхТриггеров.Удалить(ИндексЭлемента); // Это не совсем гибридный триггер. Он инициируется пока исключительно по подписке. 
	//КонецЕсли;		
	//ИндексЭлемента = МассивГибридныхТриггеров.Найти(Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетКритическийОстатокСредств);
	//Если ИндексЭлемента <> Неопределено Тогда 
	//	МассивГибридныхТриггеров.Удалить(ИндексЭлемента); // Это не совсем гибридный триггер. Он инициируется пока исключительно по подписке. 
	//КонецЕсли;	
	//ИндексЭлемента = МассивГибридныхТриггеров.Найти(Перечисления.ВариантыУсловийТриггерныхСобытий.Продажа);
	//Если ИндексЭлемента <> Неопределено Тогда 
	//	МассивГибридныхТриггеров.Удалить(ИндексЭлемента); // Это не совсем гибридный триггер. Он инициируется пока исключительно по подписке. 
	//КонецЕсли;
	//ИндексЭлемента = МассивГибридныхТриггеров.Найти(Перечисления.ВариантыУсловийТриггерныхСобытий.ПродажаОплатаПолная);
	//Если ИндексЭлемента <> Неопределено Тогда 
	//	МассивГибридныхТриггеров.Удалить(ИндексЭлемента); // Это не совсем гибридный триггер. Он инициируется пока исключительно по подписке. 
	//КонецЕсли;
	//ИндексЭлемента = МассивГибридныхТриггеров.Найти(Перечисления.ВариантыУсловийТриггерныхСобытий.ПродажаОплатаЧастичная);
	//Если ИндексЭлемента <> Неопределено Тогда 
	//	МассивГибридныхТриггеров.Удалить(ИндексЭлемента); // Это не совсем гибридный триггер. Он инициируется пока исключительно по подписке. 
	//КонецЕсли;
	
КонецПроцедуры

// Функция - Варианты срабатываемые исключительно по подписке
// 
// Возвращаемое значение:
//   - 
//
Функция ВариантыСрабатываемыеИсключительноПоПодписке() Экспорт
	
	МассивВариантовТриггерныхСобытий = Новый Массив;
	
	МассивВариантовТриггерныхСобытий.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.КартыУстановкаКартыWalletНовомуКлиенту);
	МассивВариантовТриггерныхСобытий.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетВзнос);
	МассивВариантовТриггерныхСобытий.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетСписание);
	МассивВариантовТриггерныхСобытий.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетКритическийОстатокСредств);
	МассивВариантовТриггерныхСобытий.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.Продажа);
	МассивВариантовТриггерныхСобытий.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ПродажаОплатаПолная);
	МассивВариантовТриггерныхСобытий.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ПродажаОплатаЧастичная);
	МассивВариантовТриггерныхСобытий.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаСотрудникомКлиники);
	МассивВариантовТриггерныхСобытий.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаПациентом);	
	МассивВариантовТриггерныхСобытий.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеПереносДатыВремени);
	МассивВариантовТриггерныхСобытий.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеЗаменаИнструктора);
	
	Возврат МассивВариантовТриггерныхСобытий;
	
КонецФункции

// Процедура - Инициализировать виртуальную группу событий
//
// Параметры:
//  ВиртуальнаяГруппаСобытий		 - 	 - 
//  ВариантУсловияТриггерногоСобытия - 	 - 
//
Процедура ИнициализироватьВиртуальнуюГруппуСобытий(ВиртуальнаяГруппаСобытий, ВариантУсловияТриггерногоСобытия, ЭлементГруппы = Неопределено) Экспорт
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	Если НЕ ЭлементГруппы = Неопределено Тогда
		МассивНеАктуальныхГрупп = Новый Массив;
		Для Каждого ЭлементКоллекции Из ЭлементГруппы.СписокВыбора Цикл 
			Если ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВиртуальнаяГруппаСобытий", ЭлементКоллекции.Значение)).Количество() = 0 Тогда 
				МассивНеАктуальныхГрупп.Добавить(ЭлементКоллекции);
			КонецЕсли;	
		КонецЦикла;
		Для Каждого ЭлементКоллекции Из МассивНеАктуальныхГрупп Цикл 
			ЭлементГруппы.СписокВыбора.Удалить(ЭлементКоллекции);
		КонецЦикла;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВариантУсловияТриггерногоСобытия) Тогда 
		Возврат;
	КонецЕсли;
	
	СтрокаВариантУсловияТриггерногоСобытия = ТаблицаВсехВариантовУсловийТриггерныхСобытий.Найти(ВариантУсловияТриггерногоСобытия, "ВариантыУсловийТриггерныхСобытий");
	Если СтрокаВариантУсловияТриггерногоСобытия = Неопределено Тогда 
		Возврат;
	Иначе 
		ВиртуальнаяГруппаСобытий = СтрокаВариантУсловияТриггерногоСобытия.ВиртуальнаяГруппаСобытий;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Инициализировать список триггеров
//
// Параметры:
//  СписокВыбора					 - 	 - 
//  ВиртуальнаяГруппаСобытий		 - 	 - 
//  ВариантУсловияТриггерногоСобытия - 	 - 
//
Процедура ИнициализироватьСписокТриггеров(СписокВыбора, ВиртуальнаяГруппаСобытий = "", ВариантУсловияТриггерногоСобытия = Неопределено, ТаблицаАктуализацииТриггеров = Неопределено, ИнициализироватьТаблицу = Ложь) Экспорт
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	Если ИнициализироватьТаблицу И ТаблицаАктуализацииТриггеров <> Неопределено Тогда
		ТаблицаЗначенийПараметровАктуализации = ТаблицаАктуализацииТриггеров.Выгрузить();
		Для Каждого СтрокаТаблицаВсеТриггеры Из ТаблицаВсехВариантовУсловийТриггерныхСобытий Цикл 
			СтрокаПараметровАктуализации = ТаблицаЗначенийПараметровАктуализации.Найти(СтрокаТаблицаВсеТриггеры.ВариантыУсловийТриггерныхСобытий, "ВариантУсловияТриггерногоСобытия");
			Если СтрокаПараметровАктуализации = Неопределено Тогда 
				СтрокаПараметровАктуализации 									= ТаблицаЗначенийПараметровАктуализации.Добавить();
				СтрокаПараметровАктуализации.ВариантУсловияТриггерногоСобытия 	= СтрокаТаблицаВсеТриггеры.ВариантыУсловийТриггерныхСобытий;
			КонецЕсли;	
			СтрокаПараметровАктуализации.ДатаДобавления 					= ?(СтрокаТаблицаВсеТриггеры.БазовыйВариант, Дата(1, 1, 1), ?(ЗначениеЗаполнено(СтрокаПараметровАктуализации.ДатаДобавления), СтрокаПараметровАктуализации.ДатаДобавления, НачалоДня(ТекущаяДатаСеанса())));
			СтрокаПараметровАктуализации.Новый 								= ?(НачалоДня(ТекущаяДатаСеанса()) < СтрокаПараметровАктуализации.ДатаДобавления + 3 * 86400, Истина, Ложь);
		КонецЦикла;
		ТаблицаАктуализацииТриггеров.Загрузить(ТаблицаЗначенийПараметровАктуализации);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВариантУсловияТриггерногоСобытия) Тогда 
		ВариантУсловияТриггерногоСобытия 		= Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
	КонецЕсли;
	
	КартинкаВыбранное 							= БиблиотекаКартинок.РассылкаРазрешена;
	КартинкаПустая 								= БиблиотекаКартинок.Пустая;
	
	СписокВыбора.Очистить();
	Если ЗначениеЗаполнено(ВиртуальнаяГруппаСобытий) Тогда 
		КоллекцияВариантовУсловийТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВиртуальнаяГруппаСобытий", ВиртуальнаяГруппаСобытий));
	Иначе 
		КоллекцияВариантовУсловийТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий;
	КонецЕсли;
	
	ЕстьНовыеТриггеры = Ложь;
	Если ТаблицаАктуализацииТриггеров <> Неопределено Тогда 
		Если ТаблицаАктуализацииТриггеров.НайтиСтроки(Новый Структура("Новый", Истина)).Количество() <> 0 Тогда 
			ЕстьНовыеТриггеры = Истина;
		КонецЕсли;	
	КонецЕсли;

	Для Каждого ЭлементКоллекции Из КоллекцияВариантовУсловийТриггерныхСобытий Цикл 
		НовыйЭлементСписка 							= СписокВыбора.Добавить();
		НовыйЭлементСписка.Значение 				= ЭлементКоллекции.ВариантыУсловийТриггерныхСобытий;
		Если ЕстьНовыеТриггеры Тогда //И НЕ ВариантУсловияТриггерногоСобытия = ЭлементКоллекции.ВариантыУсловийТриггерныхСобытий Тогда
			Если ТаблицаАктуализацииТриггеров.НайтиСтроки(Новый Структура("ВариантУсловияТриггерногоСобытия, Новый", ЭлементКоллекции.ВариантыУсловийТриггерныхСобытий, Истина)).Количество() <> 0 Тогда 
				МассивСтрок = Новый Массив;
				МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Строка(ЭлементКоллекции.ВариантыУсловийТриггерныхСобытий) + "  "));
				МассивСтрок.Добавить(Новый ФорматированнаяСтрока("(Новинка)", Новый Шрифт("Arial", , Истина), Новый Цвет(0, 112, 210)));
				НовыйЭлементСписка.Представление 	= Новый ФорматированнаяСтрока(МассивСтрок);
			КонецЕсли;
		КонецЕсли;	
		НовыйЭлементСписка.Пометка 					= ВариантУсловияТриггерногоСобытия = ЭлементКоллекции.ВариантыУсловийТриггерныхСобытий;
		НовыйЭлементСписка.Картинка 				= ?(ВариантУсловияТриггерногоСобытия = ЭлементКоллекции.ВариантыУсловийТриггерныхСобытий, КартинкаВыбранное, КартинкаПустая);
	КонецЦикла;	
	
КонецПроцедуры

// Процедура - Инициализировать список моментов активации
//
// Параметры:
//  СписокВыбора					 - 	 - 
//  ВариантУсловияТриггерногоСобытия - 	 - 
//  МоментАктивации					 - 	 - 
//
Процедура ИнициализироватьСписокМоментовАктивации(СписокВыбора, ВариантУсловияТриггерногоСобытия = Неопределено, МоментАктивации) Экспорт 
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	Если НЕ ЗначениеЗаполнено(ВариантУсловияТриггерногоСобытия) Тогда 
		ВариантУсловияТриггерногоСобытия 		= Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
	КонецЕсли;
	
	СписокВыбора.Очистить();
	
	КоллекцияВариантовУсловийТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий", ВариантУсловияТриггерногоСобытия));
	
	Если КоллекцияВариантовУсловийТриггерныхСобытий.Количество() <> 0 Тогда 
		Для Каждого ЭлементКоллекции Из КоллекцияВариантовУсловийТриггерныхСобытий[0].СписокМоментовАктивации Цикл
			НовыйЭлементСписка 						= СписокВыбора.Добавить();
			НовыйЭлементСписка.Значение 			= ЭлементКоллекции.Значение;
			НовыйЭлементСписка.Представление 		= ЭлементКоллекции.Представление;
			НовыйЭлементСписка.Пометка 				= МоментАктивации = ЭлементКоллекции.Значение;
		КонецЦикла;	
	Иначе 
		СписокВыбора.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия		, , МоментАктивации = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия);
		СписокВыбора.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия, , МоментАктивации = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия);
		СписокВыбора.Добавить(Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия	, , МоментАктивации = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия);		
	КонецЕсли;

КонецПроцедуры

// Процедура - Инициализировать список структурных единиц
//
// Параметры:
//  СписокВыбора					 - 	 - 
//  ВариантУсловияТриггерногоСобытия - 	 - 
//  СтруктурнаяЕдиница				 - 	 - 
//
Процедура ИнициализироватьСписокСтруктурныхЕдиниц(СписокВыбора, ВариантУсловияТриггерногоСобытия = Неопределено, СтруктурнаяЕдиница) Экспорт
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	Если НЕ ЗначениеЗаполнено(ВариантУсловияТриггерногоСобытия) Тогда 
		ВариантУсловияТриггерногоСобытия 		= Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
	КонецЕсли;
	
	СписокВыбора.Очистить();
	КоллекцияВариантовУсловийТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий, ИспользуетсяОтборПоСтруктурнойЕдинице", ВариантУсловияТриггерногоСобытия, Истина));
	
	Если КоллекцияВариантовУсловийТриггерныхСобытий.Количество() <> 0 ИЛИ ВариантУсловияТриггерногоСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СтруктурныеЕдиницы.Ссылка КАК Ссылка,
		               |	СтруктурныеЕдиницы.Представление КАК Представление
		               |ИЗ
		               |	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		               |ГДЕ
		               |	СтруктурныеЕдиницы.ПометкаУдаления = ЛОЖЬ
		               |	И СтруктурныеЕдиницы.ЭтоГруппа = ЛОЖЬ";
		
		ТаблицаСтруктурныхЕдиниц = Запрос.Выполнить().Выгрузить();
		
		СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ПустаяСсылка(), "Проданных в любой клинике", Справочники.СтруктурныеЕдиницы.ПустаяСсылка() = СтруктурнаяЕдиница);
		Для Каждого СтрокаТЗ Из ТаблицаСтруктурныхЕдиниц Цикл 
			СписокВыбора.Добавить(СтрокаТЗ.Ссылка, "Проданных в """ + СокрЛП(СтрокаТЗ.Представление) + """", СтрокаТЗ.Ссылка = СтруктурнаяЕдиница);
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Инициализировать список видов периода событий
//
// Параметры:
//  СписокВыбора					 - 	 - 
//  ВариантУсловияТриггерногоСобытия - 	 - 
//  ПериодСобытияВид				 - 	 - 
//
Процедура ИнициализироватьСписокВидовПериодаСобытий(СписокВыбора, ВариантУсловияТриггерногоСобытия = Неопределено, ПериодСобытияВид, ПериодСобытия) Экспорт
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	Если НЕ ЗначениеЗаполнено(ВариантУсловияТриггерногоСобытия) Тогда 
		ВариантУсловияТриггерногоСобытия 		= Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
	КонецЕсли;
	
	СписокВыбора.Очистить();
	
	КоллекцияВариантовУсловийТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий", ВариантУсловияТриггерногоСобытия));
	
	Если КоллекцияВариантовУсловийТриггерныхСобытий.Количество() <> 0 Тогда 
		Для Каждого ЭлементКоллекции Из КоллекцияВариантовУсловийТриггерныхСобытий[0].СписокВидовПериодаАктивации Цикл
			НовыйЭлементСписка 						= СписокВыбора.Добавить();
			НовыйЭлементСписка.Значение 			= ЭлементКоллекции.Значение;
			НовыйЭлементСписка.Представление 		= СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу(XMLСтрока(ЭлементКоллекции.Значение), ПериодСобытия);
			НовыйЭлементСписка.Пометка 				= ПериодСобытияВид = ЭлементКоллекции.Значение;
		КонецЦикла;	
	Иначе 
		СписокВыбора.Добавить(Перечисления.Периодичность.День, СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу(XMLСтрока(Перечисления.Периодичность.День), ПериодСобытия), ПериодСобытияВид = Перечисления.Периодичность.День);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Инициализировать список видов сделок
//
// Параметры:
//  СписокВыбора					 - 	 - 
//  ВариантУсловияТриггерногоСобытия - 	 - 
//  ВидСделки						 - 	 - 
//
Процедура ИнициализироватьСписокВидовСделок(СписокВыбора, ВариантУсловияТриггерногоСобытия = Неопределено, ВидСделки) Экспорт
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	Если НЕ ЗначениеЗаполнено(ВариантУсловияТриггерногоСобытия) Тогда 
		ВариантУсловияТриггерногоСобытия 		= Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
	КонецЕсли;
	
	СписокВыбора.Очистить();
	КоллекцияВариантовУсловийТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий, ИспользуетсяОтборПоВидуСделки", ВариантУсловияТриггерногоСобытия, Истина));
	
	Если НЕ ВариантУсловияТриггерногоСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе Тогда 
		СписокВыбора.Добавить(Справочники.ВидыСделок.ПустаяСсылка(), "Для любых сделок", ВидСделки = Справочники.ВидыСделок.ПустаяСсылка());	
	КонецЕсли;	
	Если КоллекцияВариантовУсловийТриггерныхСобытий.Количество() <> 0 Тогда 
		МассивВидов = Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок();
		Для Каждого ЭлементВидСделки Из МассивВидов Цикл 
			СписокВыбора.Добавить(ЭлементВидСделки, "Для сделок с видом """ + СокрЛП(Строка(ЭлементВидСделки)) + """", ВидСделки = ЭлементВидСделки);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Инициализировать список видов лицевых счетов
//
// Параметры:
//  СписокВыбора					 - 	 - 
//  ВариантУсловияТриггерногоСобытия - 	 - 
//  ВидЛицевогоСчета				 - 	 - 
//
Процедура ИнициализироватьСписокВидовЛицевыхСчетов(СписокВыбора, ВариантУсловияТриггерногоСобытия = Неопределено, ВидЛицевогоСчета) Экспорт
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	Если НЕ ЗначениеЗаполнено(ВариантУсловияТриггерногоСобытия) Тогда 
		ВариантУсловияТриггерногоСобытия 		= Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
	КонецЕсли;
	
	СписокВыбора.Очистить();
	КоллекцияВариантовУсловийТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий, ИспользуетсяОтборПоВидуЛицевогоСчета", ВариантУсловияТриггерногоСобытия, Истина));
	
	СписокВыбора.Добавить(Справочники.ВидыЛицевыхСчетов.ПустаяСсылка(), "Для любых лицевых счетов", ВидЛицевогоСчета = Справочники.ВидыЛицевыхСчетов.ПустаяСсылка());	
	Если КоллекцияВариантовУсловийТриггерныхСобытий.Количество() <> 0 Тогда 
		МассивВидов = Справочники.ВидыЛицевыхСчетов.ВернутьВидыЛицевыхСчетов();
		Для Каждого ЭлементВидЛицевогоСчета Из МассивВидов Цикл 
			СписокВыбора.Добавить(ЭлементВидЛицевогоСчета, "Для лицевых счетов с видом """ + СокрЛП(Строка(ЭлементВидЛицевогоСчета)) + """", ВидЛицевогоСчета = ЭлементВидЛицевогоСчета);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Инициализировать список видов бонусных счетов счетов
//
// Параметры:
//  СписокВыбора					 - 	 - 
//  ВариантУсловияТриггерногоСобытия - 	 - 
//  ВидБонусногоСчета				 - 	 - 
//
Процедура ИнициализироватьСписокВидовБонусныхСчетовСчетов(СписокВыбора, ВариантУсловияТриггерногоСобытия = Неопределено, ВидБонусногоСчета) Экспорт
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	Если НЕ ЗначениеЗаполнено(ВариантУсловияТриггерногоСобытия) Тогда 
		ВариантУсловияТриггерногоСобытия 		= Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
	КонецЕсли;
	
	СписокВыбора.Очистить();
	КоллекцияВариантовУсловийТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий, ИспользуетсяОтборПоВидуБонусногоСчета", ВариантУсловияТриггерногоСобытия, Истина));
	
	СписокВыбора.Добавить(Справочники.ВидыБонусныхСчетов.ПустаяСсылка(), "Для любых бонусных счетов", ВидБонусногоСчета = Справочники.ВидыБонусныхСчетов.ПустаяСсылка());	
	Если КоллекцияВариантовУсловийТриггерныхСобытий.Количество() <> 0 Тогда 
		МассивВидов = Справочники.ВидыБонусныхСчетов.ВернутьВидыБонусныхСчетов();
		Для Каждого ЭлементВидБонусногоСчета Из МассивВидов Цикл 
			СписокВыбора.Добавить(ЭлементВидБонусногоСчета, "Для бонусных счетов с видом """ + СокрЛП(Строка(ЭлементВидБонусногоСчета)) + """", ВидБонусногоСчета = ЭлементВидБонусногоСчета);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Инициализировать список вариантов действия
//
// Параметры:
//  СписокВыбора					 - 	 - 
//  ВариантУсловияТриггерногоСобытия - 	 - 
//  ВариантДействия					 - 	 - 
//
Процедура ИнициализироватьСписокВариантовДействия(СписокВыбора, ВариантУсловияТриггерногоСобытия = Неопределено, ВариантДействия) Экспорт
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	Если НЕ ЗначениеЗаполнено(ВариантУсловияТриггерногоСобытия) Тогда 
		ВариантУсловияТриггерногоСобытия 		= Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
	КонецЕсли;
	
	СписокВыбора.Очистить();
	КоллекцияВариантовУсловийТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий, РазрешенаРаботаСоСделками", ВариантУсловияТриггерногоСобытия, Истина));
	
	Если КоллекцияВариантовУсловийТриггерныхСобытий.Количество() <> 0 Тогда 
		СписокВыбора.Добавить(Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки, , ВариантДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки);
		//СписокВыбора.Добавить(Перечисления.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки, , ВариантДействия = Перечисления.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Инициализировать ограничения по типу сделки
//
// Параметры:
//  ПараметрыВыбора					 - 	 - 
//  ВариантУсловияТриггерногоСобытия - 	 - 
//  ВидСделки						 - 	 - 
//
Процедура ИнициализироватьОграниченияПоТипуСделки(ПараметрыВыбора, ВариантУсловияТриггерногоСобытия = Неопределено, ВидСделки, ВидСделкиФильтр = Неопределено) Экспорт
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	Если НЕ ЗначениеЗаполнено(ВариантУсловияТриггерногоСобытия) Тогда 
		ВариантУсловияТриггерногоСобытия 		= Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
	КонецЕсли;
	
	КоллекцияВариантовУсловийТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий", ВариантУсловияТриггерногоСобытия));
	
	Если КоллекцияВариантовУсловийТриггерныхСобытий.Количество() <> 0 Тогда
		ДопустимыйВидСделки = КоллекцияВариантовУсловийТриггерныхСобытий[0].ДопустимыйВидСделки;
	Иначе 
		ДопустимыйВидСделки = Перечисления.ТипыСделок.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДопустимыйВидСделки) И ВариантУсловияТриггерногоСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе Тогда 
		МассивПараметров 		= Новый Массив;
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка"			, ВидСделкиФильтр));
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ПометкаУдаления"	, Ложь));
		ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
		Если ЗначениеЗаполнено(ВидСделки) И ВидСделки <> ВидСделкиФильтр Тогда 
			ВидСделки = Справочники.ВидыСделок.ПустаяСсылка();
		КонецЕсли;		
	Иначе 
		МассивПараметров 		= Новый Массив;
		Если ЗначениеЗаполнено(ДопустимыйВидСделки) Тогда 		
			МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка"		, ДопустимыйВидСделки));
		КонецЕсли;	
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ПометкаУдаления"	, Ложь));
		ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
		Если ЗначениеЗаполнено(ВидСделки) И ЗначениеЗаполнено(ДопустимыйВидСделки) И ВидСделки <> ДопустимыйВидСделки Тогда 
			ВидСделки = Справочники.ВидыСделок.ПустаяСсылка();
		КонецЕсли;		
	КонецЕсли;
	
	
КонецПроцедуры

// Процедура - Инициализировать завершающие этапы сделок
//
// Параметры:
//  СписокВыбора					 - 	 - 
//  ВариантУсловияТриггерногоСобытия - 	 - 
//
Процедура ИнициализироватьЗавершающиеЭтапыСделок(СписокВыбора, ВариантУсловияТриггерногоСобытия = Неопределено) Экспорт 
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	Если НЕ ЗначениеЗаполнено(ВариантУсловияТриггерногоСобытия) Тогда 
		ВариантУсловияТриггерногоСобытия 		= Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
	КонецЕсли;
	
	СписокВыбора.Очистить();
	
	КоллекцияВариантовУсловийТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий", ВариантУсловияТриггерногоСобытия));
	
	Если КоллекцияВариантовУсловийТриггерныхСобытий.Количество() <> 0 Тогда 
		Для Каждого ЭлементКоллекции Из КоллекцияВариантовУсловийТриггерныхСобытий[0].СписокДопустимыхЗавершающихЭтаповСделок Цикл
			НовыйЭлементСписка 						= СписокВыбора.Добавить();
			НовыйЭлементСписка.Значение 			= ЭлементКоллекции.Значение;
			НовыйЭлементСписка.Представление 		= ЭлементКоллекции.Представление;
			//НовыйЭлементСписка.Пометка 				= МоментАктивации = ЭлементКоллекции.Значение;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры	

// Процедура - Инициализировать ограничения по доступным сценариям
//
// Параметры:
//  ПараметрыВыбора					 - 	 - 
//  ВариантУсловияТриггерногоСобытия - 	 - 
//  МассивДоступныхСценариев		 - 	 - 
//
Процедура ИнициализироватьОграниченияПоДоступнымСценариям(ПараметрыВыбора, ВариантУсловияТриггерногоСобытия = Неопределено, МассивДоступныхСценариев = Неопределено) Экспорт
	
	Если МассивДоступныхСценариев = Неопределено Тогда
		МассивДоступныхСценариев = Новый Массив;
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТриггерноеСобытие", ВариантУсловияТриггерногоСобытия);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СценарииЧатБотов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СценарииЧатБотов КАК СценарииЧатБотов
		|ГДЕ
		|	СценарииЧатБотов.ПометкаУдаления = ЛОЖЬ
		|	И СценарииЧатБотов.Используется = ИСТИНА
		|	И СценарииЧатБотов.ИмяМакетаПредопределенногоСценария <> """"
		|	И СценарииЧатБотов.ТриггерныеСобытия.ТриггерноеСобытие = &ТриггерноеСобытие";
		
		МассивДоступныхСценариев = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	НовыеЗначения = Новый ФиксированныйМассив(МассивДоступныхСценариев);
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", НовыеЗначения));
	ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры

// Функция - Это исключительно регламентное событие
// 
// Возвращаемое значение:
//   - 
//
Функция ЭтоИсключительноРегламентноеСобытие(ВариантУсловияТриггерногоСобытия) Экспорт 
	
	ТаблицуВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	КоллекцияПараметровВариантаУсловияТриггерныхСобытий = ТаблицуВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий, ГибридныйВариантИнициацииТриггера", ВариантУсловияТриггерногоСобытия, Ложь));	
	
	Возврат НЕ КоллекцияПараметровВариантаУсловияТриггерныхСобытий.Количество() = 0;
	
КонецФункции

// Функция - Используется параметр события
//
// Параметры:
//  ВариантУсловияТриггерногоСобытия - 	 - 
//  ОбязательноеЗаполнение			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИспользуетсяПараметрСобытия(ВариантУсловияТриггерногоСобытия = Неопределено, ОбязательноеЗаполнение = Ложь) Экспорт 
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	Если НЕ ЗначениеЗаполнено(ВариантУсловияТриггерногоСобытия) Тогда 
		ВариантУсловияТриггерногоСобытия 		= Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
	КонецЕсли;
	
	Если ОбязательноеЗаполнение Тогда 
		КоллекцияПараметровВариантаУсловияТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий, ИспользуетсяПараметрСобытия, ОбязательноеЗаполнениеПараметраСобытия", ВариантУсловияТриггерногоСобытия, Истина, ОбязательноеЗаполнение));	
	Иначе 
		КоллекцияПараметровВариантаУсловияТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий, ИспользуетсяПараметрСобытия", ВариантУсловияТриггерногоСобытия, Истина));	
	КонецЕсли;
	
	Возврат НЕ КоллекцияПараметровВариантаУсловияТриггерныхСобытий.Количество() = 0;
	
КонецФункции

// Функция - Используется отбор по структурным единицам
//
// Параметры:
//  ВариантУсловияТриггерногоСобытия - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИспользуетсяОтборПоСтруктурнымЕдиницам(ВариантУсловияТриггерногоСобытия = Неопределено) Экспорт 
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	Если НЕ ЗначениеЗаполнено(ВариантУсловияТриггерногоСобытия) Тогда 
		ВариантУсловияТриггерногоСобытия 		= Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
	КонецЕсли;
	
	КоллекцияПараметровВариантаУсловияТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий, ИспользуетсяОтборПоСтруктурнойЕдинице", ВариантУсловияТриггерногоСобытия, Истина));	
	
	Возврат НЕ КоллекцияПараметровВариантаУсловияТриггерныхСобытий.Количество() = 0;
	
КонецФункции

// Функция - Используется отбор по источникам записи
//
// Параметры:
//  ВариантУсловияТриггерногоСобытия - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИспользуетсяОтборПоИсточникамЗаписи(ВариантУсловияТриггерногоСобытия = Неопределено) Экспорт 
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	Если НЕ ЗначениеЗаполнено(ВариантУсловияТриггерногоСобытия) Тогда 
		ВариантУсловияТриггерногоСобытия 		= Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
	КонецЕсли;
	
	КоллекцияПараметровВариантаУсловияТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий, ИспользуетсяОтборПоИсточникамЗаписи", ВариантУсловияТриггерногоСобытия, Истина));	
	
	Возврат НЕ КоллекцияПараметровВариантаУсловияТриггерныхСобытий.Количество() = 0;
	
КонецФункции

// Функция - Используется отбор по признаку онлайн продажа
//
// Параметры:
//  ВариантУсловияТриггерногоСобытия - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИспользуетсяОтборПоПризнакуОнлайнПродажа(ВариантУсловияТриггерногоСобытия = Неопределено) Экспорт 
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	Если НЕ ЗначениеЗаполнено(ВариантУсловияТриггерногоСобытия) Тогда 
		ВариантУсловияТриггерногоСобытия 		= Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
	КонецЕсли;
	
	КоллекцияПараметровВариантаУсловияТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий, ВиртуальнаяГруппаСобытий", ВариантУсловияТриггерногоСобытия, "СобытияПоПродажам"));	
	
	Возврат НЕ КоллекцияПараметровВариантаУсловияТриггерныхСобытий.Количество() = 0;
	
КонецФункции

// Функция - Используется отбор по сегменту услуг
//
// Параметры:
//  УсловиеСобытия	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИспользуетсяОтборПоСегментуУслуг(ВариантУсловияТриггерногоСобытия = Неопределено, ОбязательноеЗаполнение = Ложь) Экспорт 
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	Если НЕ ЗначениеЗаполнено(ВариантУсловияТриггерногоСобытия) Тогда 
		ВариантУсловияТриггерногоСобытия 		= Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
	КонецЕсли;
	
	Если ОбязательноеЗаполнение Тогда 
		КоллекцияПараметровВариантаУсловияТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий, ИспользуетсяОтборПоСегментуУслуг, ОбязательноеЗаполнениеСегментаУслуг", ВариантУсловияТриггерногоСобытия, Истина, ОбязательноеЗаполнение));	
	Иначе 
		КоллекцияПараметровВариантаУсловияТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий, ИспользуетсяОтборПоСегментуУслуг", ВариантУсловияТриггерногоСобытия, Истина));	
	КонецЕсли;
	
	Возврат НЕ КоллекцияПараметровВариантаУсловияТриггерныхСобытий.Количество() = 0;
	
КонецФункции

// Функция - Используется отбор по виду сделок
//
// Параметры:
//  ВариантУсловияТриггерногоСобытия - 	 - 
//  ОбязательноеЗаполнение			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИспользуетсяОтборПоВидуСделок(ВариантУсловияТриггерногоСобытия = Неопределено, ОбязательноеЗаполнение = Ложь) Экспорт 
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	Если НЕ ЗначениеЗаполнено(ВариантУсловияТриггерногоСобытия) Тогда 
		ВариантУсловияТриггерногоСобытия 		= Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
	КонецЕсли;
	
	//Если ОбязательноеЗаполнение Тогда 
	//	КоллекцияПараметровВариантаУсловияТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий, ИспользуетсяОтборПоВидуСделки, ОбязательноеЗаполнениеСегментаУслуг", ВариантУсловияТриггерногоСобытия, Истина, ОбязательноеЗаполнение));	
	//Иначе 
		КоллекцияПараметровВариантаУсловияТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий, ИспользуетсяОтборПоВидуСделки", ВариантУсловияТриггерногоСобытия, Истина));	
	//КонецЕсли;
	
	Возврат НЕ КоллекцияПараметровВариантаУсловияТриггерныхСобытий.Количество() = 0;
	
КонецФункции

// Функция - Используется отбор по виду лицевых счетов
//
// Параметры:
//  ВариантУсловияТриггерногоСобытия - 	 - 
//  ОбязательноеЗаполнение			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИспользуетсяОтборПоВидуЛицевыхСчетов(ВариантУсловияТриггерногоСобытия = Неопределено, ОбязательноеЗаполнение = Ложь) Экспорт 
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	Если НЕ ЗначениеЗаполнено(ВариантУсловияТриггерногоСобытия) Тогда 
		ВариантУсловияТриггерногоСобытия 		= Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
	КонецЕсли;
	
	//Если ОбязательноеЗаполнение Тогда 
	//	КоллекцияПараметровВариантаУсловияТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий, ИспользуетсяОтборПоВидуСделки, ОбязательноеЗаполнениеСегментаУслуг", ВариантУсловияТриггерногоСобытия, Истина, ОбязательноеЗаполнение));	
	//Иначе 
		КоллекцияПараметровВариантаУсловияТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий, ИспользуетсяОтборПоВидуЛицевогоСчета", ВариантУсловияТриггерногоСобытия, Истина));	
	//КонецЕсли;
	
	Возврат НЕ КоллекцияПараметровВариантаУсловияТриггерныхСобытий.Количество() = 0;
	
КонецФункции

// Функция - Используется отбор по виду бонусных счетов
//
// Параметры:
//  ВариантУсловияТриггерногоСобытия - 	 - 
//  ОбязательноеЗаполнение			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИспользуетсяОтборПоВидуБонусныхСчетов(ВариантУсловияТриггерногоСобытия = Неопределено, ОбязательноеЗаполнение = Ложь) Экспорт 
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
	Если НЕ ЗначениеЗаполнено(ВариантУсловияТриггерногоСобытия) Тогда 
		ВариантУсловияТриггерногоСобытия 		= Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
	КонецЕсли;
	
	//Если ОбязательноеЗаполнение Тогда 
	//	КоллекцияПараметровВариантаУсловияТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий, ИспользуетсяОтборПоВидуСделки, ОбязательноеЗаполнениеСегментаУслуг", ВариантУсловияТриггерногоСобытия, Истина, ОбязательноеЗаполнение));	
	//Иначе 
		КоллекцияПараметровВариантаУсловияТриггерныхСобытий = ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий, ИспользуетсяОтборПоВидуБонусногоСчета", ВариантУсловияТриггерногоСобытия, Истина));	
	//КонецЕсли;
	
	Возврат НЕ КоллекцияПараметровВариантаУсловияТриггерныхСобытий.Количество() = 0;
	
КонецФункции

// Процедура - Сформировать описание действия
//
// Параметры:
//  СтрокаДействия	 - 	 - 
//
Процедура СформироватьОписаниеДействия(СтрокаДействия) Экспорт 
	
	Если СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру Тогда 
		Если СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.ВрачПриема Тогда
			СтрокаДействия.Описание = Нстр("ru = 'Поставить задачу врачу'; en = 'Set a task to the doctor'");
		ИначеЕсли СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.Куратор Тогда
			СтрокаДействия.Описание = Нстр("ru = 'Поставить задачу куратору пациента'; en = 'Set a task for the main sales Manager'");			
		ИначеЕсли СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник Тогда
			СтрокаДействия.Описание = Нстр("ru = 'Поставить задачу сотруднику'; en = 'Assign a task to an employee'");
		ИначеЕсли СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.СегментСотрудников Тогда
			СтрокаДействия.Описание = Нстр("ru = 'Поставить задачу сегменту сотрудников'; en = 'Assign a task to a segment of employees'");;						
		Иначе 
			СтрокаДействия.Описание = Нстр("ru = 'Поставить задачу'; en = 'Set the task'");			
		КонецЕсли;
	ИначеЕсли СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение Тогда
		Если СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.КонтрагентСобытия Тогда 
			СтрокаДействия.Описание = Нстр("ru = 'Отправить пациенту сообщение'; en = 'Send a message to the client'");
		ИначеЕсли СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.ВрачПриема Тогда
			СтрокаДействия.Описание = Нстр("ru = 'Отправить врачу сообщение'; en = 'Send a message to the coach'");
		ИначеЕсли СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.Куратор Тогда
			СтрокаДействия.Описание = Нстр("ru = 'Отправить куратору пациента сообщение'; en = 'Send a message to the main sales Manager'");			
		ИначеЕсли СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник Тогда
			СтрокаДействия.Описание = Нстр("ru = 'Отправить сотруднику сообщение'; en = 'Send a message to an employee'");			
		Иначе 
			СтрокаДействия.Описание = Нстр("ru = 'Отправить сообщение'; en = 'Send message'");			
		КонецЕсли;
		СпособыОтправки = Новый Массив;
		Если СтрокаДействия.ОтправкаPush Тогда 
			СпособыОтправки.Добавить("Push");
		КонецЕсли;
		Если СтрокаДействия.ОтправкаPushWallet Тогда 
			СпособыОтправки.Добавить("Push(Wallet)");
		КонецЕсли;	
		Если СтрокаДействия.ОтправкаMessenger Тогда 
			СпособыОтправки.Добавить(Нстр("ru = 'Мессенджер'; en = 'Messenger'"));
		КонецЕсли;	
		Если СтрокаДействия.ОтправкаSMS Тогда 
			СпособыОтправки.Добавить("SMS");
		КонецЕсли;	
		Если СпособыОтправки.Количество() > 0 Тогда 
			СтрокаДействия.Описание = СтрокаДействия.Описание + " (" + СтрСоединить(СпособыОтправки, ", ") + ")";
		КонецЕсли;	
	ИначеЕсли СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо Тогда
		Если СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.КонтрагентСобытия Тогда 
			СтрокаДействия.Описание = Нстр("ru = 'Отправить пациенту электронное письмо'; en = 'Send an email to the client'");
		ИначеЕсли СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.ВрачПриема Тогда
			СтрокаДействия.Описание = Нстр("ru = 'Отправить врачу электронное письмо'; en = 'Send an email to the coach'");
		ИначеЕсли СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.Куратор Тогда
			СтрокаДействия.Описание = Нстр("ru = 'Отправить куратору пациента электронное письмо'; en = 'Send an email to the main sales Manager'");			
		ИначеЕсли СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник Тогда
			СтрокаДействия.Описание = Нстр("ru = 'Отправить сотруднику электронное письмо'; en = 'Send an email to an employee'");			
		Иначе 
			СтрокаДействия.Описание = Нстр("ru = 'Отправить электронное письмо'; en = 'Send an email'");			
		КонецЕсли;
	ИначеЕсли СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки Тогда
		Если ЗначениеЗаполнено(СтрокаДействия.ЭтапСделки) Тогда 
			СтрокаДействия.Описание = СтрШаблон(Нстр("ru = 'Повысить этап сделки до: ""%1""'; en = 'Increase the transaction stage to: ""%1""'"), СокрЛП(Строка(СтрокаДействия.ЭтапСделки))); 
		Иначе 
			СтрокаДействия.Описание = Нстр("ru = 'Повысить этап сделки'; en = 'To increase the stage of the transaction'"); 
		КонецЕсли;
	ИначеЕсли СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота Тогда
		Если ЗначениеЗаполнено(СтрокаДействия.СценарийЧатБота) Тогда 
			СтрокаДействия.Описание = СтрШаблон(Нстр("ru = 'Запустить сценарий: ""%1""'; en = 'Run the script: ""%1""'"), СокрЛП(Строка(СтрокаДействия.СценарийЧатБота)));
		Иначе 	
			СтрокаДействия.Описание = Нстр("ru = 'Запустить сценарий диалога чат-бота'; en = 'Run the chatbot dialog script'");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

// Функция - Триггерное событие активно
//
// Параметры:
//  ВариантУсловияТриггерногоСобытия - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ТриггерноеСобытиеАктивно(ВариантУсловияТриггерногоСобытия) Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УсловиеСобытия", ВариантУсловияТриггерногоСобытия);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТриггерныеСобытия.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТриггерныеСобытия КАК ТриггерныеСобытия
	|ГДЕ
	|	ТриггерныеСобытия.ПометкаУдаления = ЛОЖЬ
	|	И ТриггерныеСобытия.ЭтоГруппа = ЛОЖЬ
	|	И ТриггерныеСобытия.Активно = ИСТИНА
	|	И ТриггерныеСобытия.УсловиеСобытия = &УсловиеСобытия";
	
	Возврат НЕ Запрос.Выполнить().Пустой();	
	
КонецФункции

// Функция - Инициализировать триггерное событие
//
// Параметры:
//  ПараметрыТриггерногоСобытия				 - 	 - 
//  АнализироватьИмющиесяСогласноПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьТриггерноеСобытие(ПараметрыТриггерногоСобытия, АнализироватьИмющиесяСогласноПараметров = Ложь, ТаблицаСервисовSMS = Неопределено, ИскатьПоНаименованию = Ложь) Экспорт
	
	ТриггерноеСобытие = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыТриггерногоСобытия, "УсловиеСобытия", Неопределено))
		ИЛИ НЕ ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыТриггерногоСобытия, "МоментСобытия", Неопределено))
		ИЛИ НЕ ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыТриггерногоСобытия, "ПериодСобытия", Неопределено))
		ИЛИ НЕ ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыТриггерногоСобытия, "ПериодСобытияВид", Неопределено))
		ИЛИ НЕ ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыТриггерногоСобытия, "ПараметрыДействия", Неопределено)) Тогда 
		
		Возврат ТриггерноеСобытие;
	КонецЕсли;	
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если АнализироватьИмющиесяСогласноПараметров Тогда 
		ТриггерноеСобытие = ПолучитьТриггерноеСобытиеСогласноПараметров(ПараметрыТриггерногоСобытия, , ИскатьПоНаименованию);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТриггерноеСобытие) Тогда 
		Возврат ТриггерноеСобытие;
	КонецЕсли;
	
	Попытка
		// Генерируем триггер
		ТриггерноеСобытие_Объект			= СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(ТриггерноеСобытие_Объект, ПараметрыТриггерногоСобытия);
		ТриггерноеСобытие_Объект.Наименование = ?(ЗначениеЗаполнено(ТриггерноеСобытие_Объект.Наименование), ТриггерноеСобытие_Объект.Наименование, Строка(ПараметрыТриггерногоСобытия.УсловиеСобытия));
		СписокОписанийТриггеров 								= ПолучитьОписанияТриггеров();
		ЭлементСпискаОписаниеУсловия 							= СписокОписанийТриггеров.НайтиПоЗначению(ПараметрыТриггерногоСобытия.УсловиеСобытия);
		Если НЕ ЭлементСпискаОписаниеУсловия = Неопределено Тогда 
			ТриггерноеСобытие_Объект.Описание 					= ЭлементСпискаОписаниеУсловия.Представление;
		КонецЕсли;
		
		СтрокаДействия 											= ТриггерноеСобытие_Объект.Действия.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДействия, ПараметрыТриггерногоСобытия.ПараметрыДействия);
		СтрокаДействия.ИдентификаторДействия 					= Новый УникальныйИдентификатор();
		СтрокаДействия.Использование 							= Истина;
		
		Если СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение
			И ЗначениеЗаполнено(ТаблицаСервисовSMS) Тогда 
			// Актуализируем настройки каналов уведомлений
			Для Каждого СтрокаТаблицаСервисовSMS Из ТаблицаСервисовSMS Цикл 
				СтрокаНастройкиКаналовУведомления									= ТриггерноеСобытие_Объект.НастройкиКаналовУведомлений.Добавить();
				СтрокаНастройкиКаналовУведомления.ИдентификаторДействия 			= СтрокаДействия.ИдентификаторДействия;
				СтрокаНастройкиКаналовУведомления.СтруктурнаяЕдиница 				= СтрокаТаблицаСервисовSMS.СтруктурнаяЕдиница;
				СтрокаНастройкиКаналовУведомления.ОтправкаPushWallet 				= СтрокаТаблицаСервисовSMS.ОтправкаPushWallet;
				СтрокаНастройкиКаналовУведомления.ОтправкаMessenger 				= СтрокаТаблицаСервисовSMS.ОтправкаMessenger;
				СтрокаНастройкиКаналовУведомления.АккаунтВнешнейСистемы     		= СтрокаТаблицаСервисовSMS.АккаунтВнешнейСистемы;
				СтрокаНастройкиКаналовУведомления.ОтправкаSMS 						= ЗначениеЗаполнено(СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS);
				СтрокаНастройкиКаналовУведомления.АккаунтСервисаРассылкиSMS 		= СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS;
			КонецЦикла;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТриггерноеСобытие_Объект.Код) Тогда 
			ТриггерноеСобытие_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем триггер
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ТриггерноеСобытие_Объект);							
		Возврат ТриггерноеСобытие_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 				= Метаданные.Справочники.ТриггерныеСобытия;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать триггерное событие ""%1"" (%2) 
		|по причине: %3'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, ТриггерноеСобытие_Объект.Наименование
																			, Строка(ПараметрыТриггерногоСобытия.УсловиеСобытия)
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
								, УровеньЖурналаРегистрации.Предупреждение
								, МетаданныеСправочника
								,
								, Комментарий);
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

// Функция - Получить триггерное событие согласно параметров
//
// Параметры:
//  ПараметрыТриггерногоСобытия	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТриггерноеСобытиеСогласноПараметров(ПараметрыТриггерногоСобытия, ТолькоАктивные = Ложь, ИскатьПоНаименованию = Ложь)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТриггерныеСобытия.Ссылка КАК ТриггерноеСобытие
	|ИЗ
	|	Справочник.ТриггерныеСобытия КАК ТриггерныеСобытия
	|ГДЕ
	|	ТриггерныеСобытия.ПометкаУдаления = ЛОЖЬ
	|	И ТриггерныеСобытия.ЭтоГруппа = ЛОЖЬ";
	
	МетаданныеТриггерныеСобытия = Метаданные.Справочники.ТриггерныеСобытия;
	Для Каждого Параметр Из ПараметрыТриггерногоСобытия Цикл 
		Если Параметр.Ключ = "ПараметрыДействия" Тогда 
			Продолжить;
		КонецЕсли;
		Если Параметр.Ключ = "Активно" Тогда
			Если НЕ ТолькоАктивные Тогда 
				Продолжить;
			КонецЕсли;	
		КонецЕсли;
		Если Параметр.Ключ = "СегментУслуг" ИЛИ Параметр.Ключ = "ВремяСобытия" Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ МетаданныеТриггерныеСобытия.Реквизиты.Найти(Параметр.Ключ) = Неопределено Тогда 
			Запрос.Текст = Запрос.Текст + "
			|	И ТриггерныеСобытия." + Параметр.Ключ + " = &" + Параметр.Ключ;
			Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
		КонецЕсли;
		Если ИскатьПоНаименованию И Параметр.Ключ = "Наименование" Тогда 
			Запрос.Текст = Запрос.Текст + "
			|	И ТриггерныеСобытия." + Параметр.Ключ + " = &" + Параметр.Ключ;
			Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
		КонецЕсли;			
	КонецЦикла;
	
	МассивИмеющихсяТриггерныхСобытий = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТриггерноеСобытие");
	Если НЕ ЗначениеЗаполнено(МассивИмеющихсяТриггерныхСобытий) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыДействия = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыТриггерногоСобытия, "ПараметрыДействия", Неопределено);
	Если НЕ ЗначениеЗаполнено(ПараметрыДействия) Тогда 
		Возврат МассивИмеющихсяТриггерныхСобытий[0];
	КонецЕсли;	
	
	ТриггерноеСобытие = Неопределено;
	ПараметрыПоискаДействия = Новый Структура(Новый ФиксированнаяСтруктура(ПараметрыТриггерногоСобытия.ПараметрыДействия));
	Если ПараметрыПоискаДействия.Свойство("ШаблонСообщения") Тогда 
		ПараметрыПоискаДействия.Удалить("ШаблонСообщения");
	КонецЕсли;
	Если ПараметрыПоискаДействия.Свойство("Описание") Тогда 
		ПараметрыПоискаДействия.Удалить("Описание");
	КонецЕсли;		
	Для Каждого ТриггерноеСобытиеСсылка Из МассивИмеющихсяТриггерныхСобытий Цикл 
		Если ТриггерноеСобытиеСсылка.Действия.НайтиСтроки(ПараметрыПоискаДействия).Количество() <> 0 Тогда 
			ТриггерноеСобытие = ТриггерноеСобытиеСсылка;
		    Прервать;
		КонецЕсли;		
	КонецЦикла;
	
	Возврат ТриггерноеСобытие;
	
КонецФункции

// Процедура - Инициализировать триггерное событие лицевой счет взнос
//
// Параметры:
//  ТаблицаСервисовSMS	 - 	 - 
//
Процедура ИнициализироватьТриггерноеСобытие_ЛицевойСчетВзнос(ТаблицаСервисовSMS) Экспорт 
	
	СервисSMSРассылки = Константы.СервисSMSРассылкиПоУмолчанию.Получить(); 
	ИнформироватьОИзмененииБалансаЛСПоSMS = Ложь;
	Если ИнформироватьОИзмененииБалансаЛСПоSMS И ЗначениеЗаполнено(ТаблицаСервисовSMS) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТриггерныеСобытия.Ссылка КАК Ссылка,
		|	ТриггерныеСобытия.ПометкаУдаления КАК ПометкаУдаления,
		|	ТриггерныеСобытия.Активно КАК Активно
		|ИЗ
		|	Справочник.ТриггерныеСобытия КАК ТриггерныеСобытия
		|ГДЕ
		|	ТриггерныеСобытия.ЭтоГруппа = ЛОЖЬ
		|	И ТриггерныеСобытия.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетВзнос)";
		
		ТаблицаТриггеров = Запрос.Выполнить().Выгрузить();
		
		ГенерируемыйТриггер = Неопределено; 
		Если ЗначениеЗаполнено(ТаблицаТриггеров) Тогда 
			МассивТриггеров = ТаблицаТриггеров.НайтиСтроки(Новый Структура("Активно, ПометкаУдаления", Истина, Ложь));
			Если МассивТриггеров.Количество() > 0 Тогда 
				ГенерируемыйТриггер = МассивТриггеров[0].Ссылка;
			Иначе 
				ГенерируемыйТриггер = ТаблицаТриггеров[0].Ссылка;
			КонецЕсли;	
		КонецЕсли;
		
		Попытка
			Если ЗначениеЗаполнено(ГенерируемыйТриггер) Тогда 
				ТриггерВзносНаЛицевойСчет 							= ГенерируемыйТриггер.ПолучитьОбъект();
			Иначе 	
				// Генерируем триггер
				ТриггерВзносНаЛицевойСчет 							= СоздатьЭлемент();
			КонецЕсли;
			ТриггерВзносНаЛицевойСчет.Активно 						= Истина;
			ТриггерВзносНаЛицевойСчет.Наименование 					= ?(ЗначениеЗаполнено(ГенерируемыйТриггер), ТриггерВзносНаЛицевойСчет.Наименование, НСтр("ru = 'Взнос на лицевой счет';en= 'Contribution to a personal account'"));
			ТриггерВзносНаЛицевойСчет.УсловиеСобытия 				= Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетВзнос;
			ТриггерВзносНаЛицевойСчет.МоментСобытия 				= Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия;
			ТриггерВзносНаЛицевойСчет.ПериодСобытияВид 				= Перечисления.Периодичность.День;
			СписокОписанийТриггеров 								= ПолучитьОписанияТриггеров();
			ЭлементСпискаОписаниеУсловия 							= СписокОписанийТриггеров.НайтиПоЗначению(Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетВзнос);
			Если НЕ ЭлементСпискаОписаниеУсловия = Неопределено Тогда 
				ТриггерВзносНаЛицевойСчет.Описание 					= ?(ЗначениеЗаполнено(ГенерируемыйТриггер), ТриггерВзносНаЛицевойСчет.Описание, ЭлементСпискаОписаниеУсловия.Представление);
			КонецЕсли;
			Если ТриггерВзносНаЛицевойСчет.ПометкаУдаления = Истина Тогда 
				ТриггерВзносНаЛицевойСчет.ПометкаУдаления = Ложь;
			КонецЕсли;
			ТриггерВзносНаЛицевойСчет.ВидЛицевогоСчета 				= Справочники.ВидыЛицевыхСчетов.ПустаяСсылка();
			
			МассивДействийОтправитьСообщение = ТриггерВзносНаЛицевойСчет.Действия.НайтиСтроки(Новый Структура("ВидДействия, ВидАдресата, Удалено", Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение, Перечисления.ВидыАдресатов.КонтрагентСобытия, Ложь));
			СтрокаДействияОтправитьСообщение = Неопределено;
			Если МассивДействийОтправитьСообщение.Количество() = 0 Тогда 
				СтрокаДействияОтправитьСообщение = Неопределено;
			Иначе
				Для Каждого СтрокаДействия Из МассивДействийОтправитьСообщение Цикл
					Если СтрокаДействия.Использование = Истина Тогда 
						СтрокаДействияОтправитьСообщение = СтрокаДействия;
						Прервать;
					КонецЕсли;					
				КонецЦикла;
				Если СтрокаДействияОтправитьСообщение = Неопределено Тогда 
					СтрокаДействияОтправитьСообщение = МассивДействийОтправитьСообщение[0];
				КонецЕсли;	
			КонецЕсли;	
			
			Если СтрокаДействияОтправитьСообщение = Неопределено Тогда 
				СтрокаДействия 										= ТриггерВзносНаЛицевойСчет.Действия.Добавить();
				СтрокаДействия.ИдентификаторДействия 				= Новый УникальныйИдентификатор();				
			Иначе 
				СтрокаДействия 										= СтрокаДействияОтправитьСообщение;
			КонецЕсли;	
			СтрокаДействия.Использование 							= Истина;
			СтрокаДействия.ВидДействия 								= Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение;
			СтрокаДействия.ВидАдресата 								= Перечисления.ВидыАдресатов.КонтрагентСобытия;
			СтрокаДействия.ШаблонСообщения 							= Справочники.ШаблоныСообщений.ИнициализироватьШаблонСообщения_ЛицевойСчетВзнос();
			СтрокаДействия.Описание 								= НСтр("ru = 'Отправить пациенту сообщение';en= 'Send a message to the client'");
			
			// Актуализируем настройки каналов уведомлений
			МассивНастроекКаналовУведомлений = ТриггерВзносНаЛицевойСчет.НастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия", СтрокаДействия.ИдентификаторДействия));
			
			Если МассивНастроекКаналовУведомлений.Количество() = 0 Тогда 
				Для Каждого СтрокаТаблицаСервисовSMS Из ТаблицаСервисовSMS Цикл 
					СтрокаНастройкиКаналовУведомления									= ТриггерВзносНаЛицевойСчет.НастройкиКаналовУведомлений.Добавить();
					СтрокаНастройкиКаналовУведомления.ИдентификаторДействия 			= СтрокаДействия.ИдентификаторДействия;
			    	СтрокаНастройкиКаналовУведомления.СтруктурнаяЕдиница 				= СтрокаТаблицаСервисовSMS.СтруктурнаяЕдиница;
					СтрокаНастройкиКаналовУведомления.ОтправкаPushWallet 				= СтрокаТаблицаСервисовSMS.ОтправкаPushWallet;
					СтрокаНастройкиКаналовУведомления.ОтправкаMessenger 				= СтрокаТаблицаСервисовSMS.ОтправкаMessenger;
					СтрокаНастройкиКаналовУведомления.АккаунтВнешнейСистемы     		= СтрокаТаблицаСервисовSMS.АккаунтВнешнейСистемы;
					СтрокаНастройкиКаналовУведомления.ОтправкаSMS 						= ЗначениеЗаполнено(СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS);
					СтрокаНастройкиКаналовУведомления.АккаунтСервисаРассылкиSMS 		= СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS;
				КонецЦикла;
			Иначе 
				Для Каждого СтрокаТаблицаСервисовSMS Из ТаблицаСервисовSMS Цикл 
					МассивНастроекКаналовУведомлений = ТриггерВзносНаЛицевойСчет.НастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия, СтруктурнаяЕдиница", СтрокаДействия.ИдентификаторДействия, СтрокаТаблицаСервисовSMS.СтруктурнаяЕдиница));
					Если МассивНастроекКаналовУведомлений.Количество() = 0 Тогда
						СтрокаНастройкиКаналовУведомления								= ТриггерВзносНаЛицевойСчет.НастройкиКаналовУведомлений.Добавить();
						СтрокаНастройкиКаналовУведомления.ИдентификаторДействия 		= СтрокаДействия.ИдентификаторДействия;
						СтрокаНастройкиКаналовУведомления.СтруктурнаяЕдиница 			= СтрокаТаблицаСервисовSMS.СтруктурнаяЕдиница;
						СтрокаНастройкиКаналовУведомления.ОтправкаPushWallet 			= СтрокаТаблицаСервисовSMS.ОтправкаPushWallet;
						СтрокаНастройкиКаналовУведомления.ОтправкаMessenger 			= СтрокаТаблицаСервисовSMS.ОтправкаMessenger;
						СтрокаНастройкиКаналовУведомления.АккаунтВнешнейСистемы     	= СтрокаТаблицаСервисовSMS.АккаунтВнешнейСистемы;
						СтрокаНастройкиКаналовУведомления.ОтправкаSMS 					= ЗначениеЗаполнено(СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS);
						СтрокаНастройкиКаналовУведомления.АккаунтСервисаРассылкиSMS 	= СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS;
					Иначе 
						МассивНастроекКаналовУведомлений[0].ОтправкаSMS 				= Истина;
						МассивНастроекКаналовУведомлений[0].АккаунтСервисаРассылкиSMS 	= СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS;
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;	
			
			Если НЕ ЗначениеЗаполнено(ТриггерВзносНаЛицевойСчет.Код) Тогда 
				ТриггерВзносНаЛицевойСчет.УстановитьНовыйКод();
			КонецЕсли;
			// Сохраняем триггер
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ТриггерВзносНаЛицевойСчет);							
		Исключение
			МетаданныеСправочника 				= Метаданные.Справочники.ТриггерныеСобытия;		
			ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать триггерное событие ""Взнос на лицевой счет"" 
			|по причине: %1'");
			
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонКомментария,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение,
			МетаданныеСправочника,,
			Комментарий);
		КонецПопытки;
	КонецЕсли
	
КонецПроцедуры

// Процедура - Инициализировать триггерное событие лицевой счет списание
//
// Параметры:
//  ТаблицаСервисовSMS	 - 	 - 
//
Процедура ИнициализироватьТриггерноеСобытие_ЛицевойСчетСписание(ТаблицаСервисовSMS) Экспорт 
	
	СервисSMSРассылки = Константы.СервисSMSРассылкиПоУмолчанию.Получить();  
	ИнформироватьОИзмененииБалансаЛСПоSMS = Ложь;
	Если ИнформироватьОИзмененииБалансаЛСПоSMS И ЗначениеЗаполнено(ТаблицаСервисовSMS) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТриггерныеСобытия.Ссылка КАК Ссылка,
		|	ТриггерныеСобытия.ПометкаУдаления КАК ПометкаУдаления,
		|	ТриггерныеСобытия.Активно КАК Активно
		|ИЗ
		|	Справочник.ТриггерныеСобытия КАК ТриггерныеСобытия
		|ГДЕ
		|	ТриггерныеСобытия.ЭтоГруппа = ЛОЖЬ
		|	И ТриггерныеСобытия.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетСписание)";
		
		ТаблицаТриггеров = Запрос.Выполнить().Выгрузить();
		
		ГенерируемыйТриггер = Неопределено; 
		Если ЗначениеЗаполнено(ТаблицаТриггеров) Тогда 
			МассивТриггеров = ТаблицаТриггеров.НайтиСтроки(Новый Структура("Активно, ПометкаУдаления", Истина, Ложь));
			Если МассивТриггеров.Количество() > 0 Тогда 
				ГенерируемыйТриггер = МассивТриггеров[0].Ссылка;
			Иначе 
				ГенерируемыйТриггер = ТаблицаТриггеров[0].Ссылка;
			КонецЕсли;	
		КонецЕсли;
		
		Попытка
			Если ЗначениеЗаполнено(ГенерируемыйТриггер) Тогда 
				ТриггерСписаниеЛицевойСчет 							= ГенерируемыйТриггер.ПолучитьОбъект();
			Иначе 	
				// Генерируем триггер
				ТриггерСписаниеЛицевойСчет 							= СоздатьЭлемент();
			КонецЕсли;
			ТриггерСписаниеЛицевойСчет.Активно 						= Истина;
			ТриггерСписаниеЛицевойСчет.Наименование 				= ?(ЗначениеЗаполнено(ГенерируемыйТриггер), ТриггерСписаниеЛицевойСчет.Наименование, НСтр("ru = 'Взнос на лицевой счет';en= 'Contribution to a personal account'"));
			ТриггерСписаниеЛицевойСчет.УсловиеСобытия 				= Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетСписание;
			ТриггерСписаниеЛицевойСчет.МоментСобытия 				= Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия;
			ТриггерСписаниеЛицевойСчет.ПериодСобытияВид 			= Перечисления.Периодичность.День;
			СписокОписанийТриггеров 								= ПолучитьОписанияТриггеров();
			ЭлементСпискаОписаниеУсловия 							= СписокОписанийТриггеров.НайтиПоЗначению(Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетВзнос);
			Если НЕ ЭлементСпискаОписаниеУсловия = Неопределено Тогда 
				ТриггерСписаниеЛицевойСчет.Описание 				= ?(ЗначениеЗаполнено(ГенерируемыйТриггер), ТриггерСписаниеЛицевойСчет.Описание, ЭлементСпискаОписаниеУсловия.Представление);
			КонецЕсли;
			Если ТриггерСписаниеЛицевойСчет.ПометкаУдаления = Истина Тогда 
				ТриггерСписаниеЛицевойСчет.ПометкаУдаления = Ложь;
			КонецЕсли;
			ТриггерСписаниеЛицевойСчет.ВидЛицевогоСчета 			= Справочники.ВидыЛицевыхСчетов.ПустаяСсылка();
			
			МассивДействийОтправитьСообщение = ТриггерСписаниеЛицевойСчет.Действия.НайтиСтроки(Новый Структура("ВидДействия, ВидАдресата, Удалено", Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение, Перечисления.ВидыАдресатов.КонтрагентСобытия, Ложь));
			СтрокаДействияОтправитьСообщение = Неопределено;
			Если МассивДействийОтправитьСообщение.Количество() = 0 Тогда 
				СтрокаДействияОтправитьСообщение = Неопределено;
			Иначе
				Для Каждого СтрокаДействия Из МассивДействийОтправитьСообщение Цикл
					Если СтрокаДействия.Использование = Истина Тогда 
						СтрокаДействияОтправитьСообщение = СтрокаДействия;
						Прервать;
					КонецЕсли;					
				КонецЦикла;
				Если СтрокаДействияОтправитьСообщение = Неопределено Тогда 
					СтрокаДействияОтправитьСообщение = МассивДействийОтправитьСообщение[0];
				КонецЕсли;	
			КонецЕсли;	
			
			Если СтрокаДействияОтправитьСообщение = Неопределено Тогда 
				СтрокаДействия 										= ТриггерСписаниеЛицевойСчет.Действия.Добавить();
				СтрокаДействия.ИдентификаторДействия 				= Новый УникальныйИдентификатор();				
			Иначе 
				СтрокаДействия 										= СтрокаДействияОтправитьСообщение;
			КонецЕсли;	
			СтрокаДействия.Использование 							= Истина;
			СтрокаДействия.ВидДействия 								= Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение;
			СтрокаДействия.ВидАдресата 								= Перечисления.ВидыАдресатов.КонтрагентСобытия;
			СтрокаДействия.ШаблонСообщения 							= Справочники.ШаблоныСообщений.ИнициализироватьШаблонСообщения_ЛицевойСчетСписание();
			СтрокаДействия.Описание 								= НСтр("ru = 'Отправить пациенту сообщение';en= 'Send a message to the client'");
			
			// Актуализируем настройки каналов уведомлений
			МассивНастроекКаналовУведомлений = ТриггерСписаниеЛицевойСчет.НастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия", СтрокаДействия.ИдентификаторДействия));
			
			Если МассивНастроекКаналовУведомлений.Количество() = 0 Тогда 
				Для Каждого СтрокаТаблицаСервисовSMS Из ТаблицаСервисовSMS Цикл 
					СтрокаНастройкиКаналовУведомления									= ТриггерСписаниеЛицевойСчет.НастройкиКаналовУведомлений.Добавить();
					СтрокаНастройкиКаналовУведомления.ИдентификаторДействия 			= СтрокаДействия.ИдентификаторДействия;
			    	СтрокаНастройкиКаналовУведомления.СтруктурнаяЕдиница 				= СтрокаТаблицаСервисовSMS.СтруктурнаяЕдиница;
					СтрокаНастройкиКаналовУведомления.ОтправкаPushWallet 				= СтрокаТаблицаСервисовSMS.ОтправкаPushWallet;
					СтрокаНастройкиКаналовУведомления.ОтправкаMessenger 				= СтрокаТаблицаСервисовSMS.ОтправкаMessenger;
					СтрокаНастройкиКаналовУведомления.АккаунтВнешнейСистемы     		= СтрокаТаблицаСервисовSMS.АккаунтВнешнейСистемы;
					СтрокаНастройкиКаналовУведомления.ОтправкаSMS 						= ЗначениеЗаполнено(СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS);
					СтрокаНастройкиКаналовУведомления.АккаунтСервисаРассылкиSMS 		= СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS;
				КонецЦикла;
			Иначе 
				Для Каждого СтрокаТаблицаСервисовSMS Из ТаблицаСервисовSMS Цикл 
					МассивНастроекКаналовУведомлений = ТриггерСписаниеЛицевойСчет.НастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия, СтруктурнаяЕдиница", СтрокаДействия.ИдентификаторДействия, СтрокаТаблицаСервисовSMS.СтруктурнаяЕдиница));
					Если МассивНастроекКаналовУведомлений.Количество() = 0 Тогда
						СтрокаНастройкиКаналовУведомления								= ТриггерСписаниеЛицевойСчет.НастройкиКаналовУведомлений.Добавить();
						СтрокаНастройкиКаналовУведомления.ИдентификаторДействия 		= СтрокаДействия.ИдентификаторДействия;
						СтрокаНастройкиКаналовУведомления.СтруктурнаяЕдиница 			= СтрокаТаблицаСервисовSMS.СтруктурнаяЕдиница;
						СтрокаНастройкиКаналовУведомления.ОтправкаPushWallet 			= СтрокаТаблицаСервисовSMS.ОтправкаPushWallet;
						СтрокаНастройкиКаналовУведомления.ОтправкаMessenger 			= СтрокаТаблицаСервисовSMS.ОтправкаMessenger;
						СтрокаНастройкиКаналовУведомления.АккаунтВнешнейСистемы     	= СтрокаТаблицаСервисовSMS.АккаунтВнешнейСистемы;
						СтрокаНастройкиКаналовУведомления.ОтправкаSMS 					= ЗначениеЗаполнено(СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS);
						СтрокаНастройкиКаналовУведомления.АккаунтСервисаРассылкиSMS 	= СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS;
					Иначе 
						МассивНастроекКаналовУведомлений[0].ОтправкаSMS 				= Истина;
						МассивНастроекКаналовУведомлений[0].АккаунтСервисаРассылкиSMS 	= СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS;
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;	
			
			Если НЕ ЗначениеЗаполнено(ТриггерСписаниеЛицевойСчет.Код) Тогда 
				ТриггерСписаниеЛицевойСчет.УстановитьНовыйКод();
			КонецЕсли;
			// Сохраняем триггер
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ТриггерСписаниеЛицевойСчет);							
		Исключение
			МетаданныеСправочника 				= Метаданные.Справочники.ТриггерныеСобытия;		
			ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать триггерное событие ""Списание с лицевого счета"" 
			|по причине: %1'");
			
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонКомментария,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение,
			МетаданныеСправочника,,
			Комментарий);
		КонецПопытки;
	КонецЕсли
	
КонецПроцедуры

// Процедура - Инициализировать триггерное событие клиент день рождения
//
// Параметры:
//  ТаблицаСервисовSMS	 - 	 - 
//
Процедура ИнициализироватьТриггерноеСобытие_КлиентДеньРождения(ТаблицаСервисовSMS) Экспорт 
	
	СервисSMSРассылки 			= Константы.СервисSMSРассылкиПоУмолчанию.Получить();
	ПоздравлятьКлиентаПоSMS 	= Ложь;
	ПоздравлятьКлиентаПоEmail 	= Ложь;
	Если (ПоздравлятьКлиентаПоSMS = Истина ИЛИ ПоздравлятьКлиентаПоEmail = Истина) 
		И ЗначениеЗаполнено(ТаблицаСервисовSMS) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТриггерныеСобытия.Ссылка КАК Ссылка,
		|	ТриггерныеСобытия.ПометкаУдаления КАК ПометкаУдаления,
		|	ТриггерныеСобытия.Активно КАК Активно
		|ИЗ
		|	Справочник.ТриггерныеСобытия КАК ТриггерныеСобытия
		|ГДЕ
		|	ТриггерныеСобытия.ЭтоГруппа = ЛОЖЬ
		|	И ТриггерныеСобытия.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ПациентДеньРождения)";
		
		ТаблицаТриггеров = Запрос.Выполнить().Выгрузить();
		
		ГенерируемыйТриггер = Неопределено; 
		Если ЗначениеЗаполнено(ТаблицаТриггеров) Тогда 
			МассивТриггеров = ТаблицаТриггеров.НайтиСтроки(Новый Структура("Активно, ПометкаУдаления", Истина, Ложь));
			Если МассивТриггеров.Количество() > 0 Тогда 
				ГенерируемыйТриггер = МассивТриггеров[0].Ссылка;
			Иначе 
				ГенерируемыйТриггер = ТаблицаТриггеров[0].Ссылка;
			КонецЕсли;	
		КонецЕсли;
		
		Попытка
			ШаблонСообщения = Неопределено;
			Если ЗначениеЗаполнено(ГенерируемыйТриггер) Тогда 
				ТриггерКлиентДеньРождения 							= ГенерируемыйТриггер.ПолучитьОбъект();
			Иначе 	
				// Генерируем триггер
				ТриггерКлиентДеньРождения 							= СоздатьЭлемент();
			КонецЕсли;
			ТриггерКлиентДеньРождения.Активно 						= Истина;
			ТриггерКлиентДеньРождения.Наименование 					= ?(ЗначениеЗаполнено(ГенерируемыйТриггер), ТриггерКлиентДеньРождения.Наименование, НСтр("ru = 'День рождения клиента';en= 'Client's birthday'"));
			ТриггерКлиентДеньРождения.УсловиеСобытия 				= Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентДеньРождения;
			ТриггерКлиентДеньРождения.МоментСобытия 				= Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия;
			ТриггерКлиентДеньРождения.ПериодСобытияВид 				= Перечисления.Периодичность.День;
			ТриггерКлиентДеньРождения.ВремяСобытия 					= Неопределено;
			СписокОписанийТриггеров 								= ПолучитьОписанияТриггеров();
			ЭлементСпискаОписаниеУсловия 							= СписокОписанийТриггеров.НайтиПоЗначению(Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентДеньРождения);
			Если НЕ ЭлементСпискаОписаниеУсловия = Неопределено Тогда 
				ТриггерКлиентДеньРождения.Описание 					= ?(ЗначениеЗаполнено(ГенерируемыйТриггер), ТриггерКлиентДеньРождения.Описание, ЭлементСпискаОписаниеУсловия.Представление);
			КонецЕсли;
			Если ТриггерКлиентДеньРождения.ПометкаУдаления = Истина Тогда 
				ТриггерКлиентДеньРождения.ПометкаУдаления = Ложь;
			КонецЕсли;
			ТриггерКлиентДеньРождения.СегментКонтрагентов 			= Справочники.СегментыКонтрагентов.ПустаяСсылка();
			
			МассивДействийОтправитьСообщение = ТриггерКлиентДеньРождения.Действия.НайтиСтроки(Новый Структура("ВидДействия, ВидАдресата, Удалено", Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение, Перечисления.ВидыАдресатов.КонтрагентСобытия, Ложь));
			СтрокаДействияОтправитьСообщение = Неопределено;
			Если МассивДействийОтправитьСообщение.Количество() = 0 Тогда 
				СтрокаДействияОтправитьСообщение = Неопределено;
			Иначе
				Для Каждого СтрокаДействия Из МассивДействийОтправитьСообщение Цикл
					Если СтрокаДействия.Использование = Истина Тогда 
						СтрокаДействияОтправитьСообщение = СтрокаДействия;
						Прервать;
					КонецЕсли;					
				КонецЦикла;
				Если СтрокаДействияОтправитьСообщение = Неопределено Тогда 
					СтрокаДействияОтправитьСообщение = МассивДействийОтправитьСообщение[0];
				КонецЕсли;	
			КонецЕсли;	
			
			Если СтрокаДействияОтправитьСообщение = Неопределено И ПоздравлятьКлиентаПоSMS = Истина Тогда 
				СтрокаДействия 										= ТриггерКлиентДеньРождения.Действия.Добавить();
				СтрокаДействия.ИдентификаторДействия 				= Новый УникальныйИдентификатор();				
			Иначе 
				СтрокаДействия 										= СтрокаДействияОтправитьСообщение;
			КонецЕсли;
			Если НЕ СтрокаДействия = Неопределено Тогда			
				СтрокаДействия.Использование 							= ПоздравлятьКлиентаПоSMS;
				СтрокаДействия.ВидДействия 								= Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение;
				СтрокаДействия.ВидАдресата 								= Перечисления.ВидыАдресатов.КонтрагентСобытия;
				СтрокаДействия.ШаблонСообщения 							= Справочники.ШаблоныСообщений.ИнициализироватьШаблонСообщения_КлиентДеньРождения(ШаблонСообщения);
				ШаблонСообщения 										= СтрокаДействия.ШаблонСообщения;
				СтрокаДействия.Описание 								= НСтр("ru = 'Отправить клиенту сообщение';en= 'Send a message to the client'");
			КонецЕсли;
		
			Если НЕ СтрокаДействия = Неопределено Тогда 
				// Актуализируем настройки каналов уведомлений
				МассивНастроекКаналовУведомлений = ТриггерКлиентДеньРождения.НастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия", СтрокаДействия.ИдентификаторДействия));
				
				Если МассивНастроекКаналовУведомлений.Количество() = 0 Тогда 
					Для Каждого СтрокаТаблицаСервисовSMS Из ТаблицаСервисовSMS Цикл 
						СтрокаНастройкиКаналовУведомления									= ТриггерКлиентДеньРождения.НастройкиКаналовУведомлений.Добавить();
						СтрокаНастройкиКаналовУведомления.ИдентификаторДействия 			= СтрокаДействия.ИдентификаторДействия;
						СтрокаНастройкиКаналовУведомления.СтруктурнаяЕдиница 				= СтрокаТаблицаСервисовSMS.СтруктурнаяЕдиница;
						СтрокаНастройкиКаналовУведомления.ОтправкаPushWallet 				= СтрокаТаблицаСервисовSMS.ОтправкаPushWallet;
						СтрокаНастройкиКаналовУведомления.ОтправкаMessenger 				= СтрокаТаблицаСервисовSMS.ОтправкаMessenger;
						СтрокаНастройкиКаналовУведомления.АккаунтВнешнейСистемы     		= СтрокаТаблицаСервисовSMS.АккаунтВнешнейСистемы;
						СтрокаНастройкиКаналовУведомления.ОтправкаSMS 						= ЗначениеЗаполнено(СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS);
						СтрокаНастройкиКаналовУведомления.АккаунтСервисаРассылкиSMS 		= СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS;
					КонецЦикла;
				Иначе 
					Для Каждого СтрокаТаблицаСервисовSMS Из ТаблицаСервисовSMS Цикл 
						МассивНастроекКаналовУведомлений = ТриггерКлиентДеньРождения.НастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия, СтруктурнаяЕдиница", СтрокаДействия.ИдентификаторДействия, СтрокаТаблицаСервисовSMS.СтруктурнаяЕдиница));
						Если МассивНастроекКаналовУведомлений.Количество() = 0 Тогда
							СтрокаНастройкиКаналовУведомления								= ТриггерКлиентДеньРождения.НастройкиКаналовУведомлений.Добавить();
							СтрокаНастройкиКаналовУведомления.ИдентификаторДействия 		= СтрокаДействия.ИдентификаторДействия;
							СтрокаНастройкиКаналовУведомления.СтруктурнаяЕдиница 			= СтрокаТаблицаСервисовSMS.СтруктурнаяЕдиница;
							СтрокаНастройкиКаналовУведомления.ОтправкаPushWallet 			= СтрокаТаблицаСервисовSMS.ОтправкаPushWallet;
							СтрокаНастройкиКаналовУведомления.ОтправкаMessenger 			= СтрокаТаблицаСервисовSMS.ОтправкаMessenger;
							СтрокаНастройкиКаналовУведомления.АккаунтВнешнейСистемы     	= СтрокаТаблицаСервисовSMS.АккаунтВнешнейСистемы;
							СтрокаНастройкиКаналовУведомления.ОтправкаSMS 					= ЗначениеЗаполнено(СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS);
							СтрокаНастройкиКаналовУведомления.АккаунтСервисаРассылкиSMS 	= СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS;
						Иначе 
							МассивНастроекКаналовУведомлений[0].ОтправкаSMS 				= Истина;
							МассивНастроекКаналовУведомлений[0].АккаунтСервисаРассылкиSMS 	= СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS;
						КонецЕсли;	
					КонецЦикла;
				КонецЕсли;	
			КонецЕсли;
			
			МассивДействийОтправитьСообщение = ТриггерКлиентДеньРождения.Действия.НайтиСтроки(Новый Структура("ВидДействия, ВидАдресата, Удалено", Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо, Перечисления.ВидыАдресатов.КонтрагентСобытия, Ложь));
			СтрокаДействияОтправитьСообщение = Неопределено;
			Если МассивДействийОтправитьСообщение.Количество() = 0 Тогда 
				СтрокаДействияОтправитьСообщение = Неопределено;
			Иначе
				Для Каждого СтрокаДействия Из МассивДействийОтправитьСообщение Цикл
					Если СтрокаДействия.Использование = Истина Тогда 
						СтрокаДействияОтправитьСообщение = СтрокаДействия;
						Прервать;
					КонецЕсли;					
				КонецЦикла;
				Если СтрокаДействияОтправитьСообщение = Неопределено Тогда 
					СтрокаДействияОтправитьСообщение = МассивДействийОтправитьСообщение[0];
				КонецЕсли;	
			КонецЕсли;	
			
			Если СтрокаДействияОтправитьСообщение = Неопределено И ПоздравлятьКлиентаПоEmail = Истина Тогда 
				СтрокаДействия 										= ТриггерКлиентДеньРождения.Действия.Добавить();
				СтрокаДействия.ИдентификаторДействия 				= Новый УникальныйИдентификатор();				
			Иначе 
				СтрокаДействия 										= СтрокаДействияОтправитьСообщение;
			КонецЕсли;
			Если НЕ СтрокаДействия = Неопределено Тогда
				СтрокаДействия.Использование 						= ПоздравлятьКлиентаПоEmail;
				СтрокаДействия.ВидДействия 							= Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо;
				СтрокаДействия.ВидАдресата 							= Перечисления.ВидыАдресатов.КонтрагентСобытия;
				СтрокаДействия.ШаблонСообщения 						= Справочники.ШаблоныСообщений.ИнициализироватьШаблонСообщения_КлиентДеньРождения(ШаблонСообщения);
				СтрокаДействия.Описание 							= НСтр("ru = 'Отправить клиенту электронное письмо';en= 'Send customer an email'");
			КонецЕсли;
		
			Если НЕ ЗначениеЗаполнено(ТриггерКлиентДеньРождения.Код) Тогда 
				ТриггерКлиентДеньРождения.УстановитьНовыйКод();
			КонецЕсли;
			// Сохраняем триггер
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ТриггерКлиентДеньРождения);					
		Исключение
			МетаданныеСправочника 				= Метаданные.Справочники.ТриггерныеСобытия;		
			ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать триггерное событие ""День рождения клиента"" 
			|по причине: %1'");
			
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонКомментария,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение,
			МетаданныеСправочника,,
			Комментарий);
		КонецПопытки;
	КонецЕсли
	
КонецПроцедуры

// Процедура - Инициализировать триггерное событие запись начало приема
//
// Параметры:
//  ТаблицаСервисовSMS	 - 	 - 
//
Процедура ИнициализироватьТриггерноеСобытие_ЗаписьНачалоПриема(ТаблицаСервисовSMS) Экспорт 
	
	СервисSMSРассылки 				= Константы.СервисSMSРассылкиПоУмолчанию.Получить();
	НапоминатьКлиентуОЗаписиПоSMS 	= Ложь;
	Если НапоминатьКлиентуОЗаписиПоSMS И ЗначениеЗаполнено(ТаблицаСервисовSMS) Тогда
		
		// Если используется расширение мессенджера, то создавать этот триггер не имеет смысла, так как
		// есть соответствующий триггер и сценарий, им запускаемый, по подтверждению записи (что и есть информирование о предстоящей записи)
		Если ОбщегоНазначенияСтоматология.ИспользуетсяРасширение("Мессенджер") Тогда 
			Возврат;
		КонецЕсли;
		РасширениеМессенджера = ОбновлениеИнформационнойБазыСтоматология.ПолучитьРасширениеМесседжера();
		Если НЕ РасширениеМессенджера = Неопределено Тогда
			// Расширение мессенджера установлено, обновление не требуется.
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТриггерныеСобытия.Ссылка КАК Ссылка,
		|	ТриггерныеСобытия.ПометкаУдаления КАК ПометкаУдаления,
		|	ТриггерныеСобытия.Активно КАК Активно,
		|	ТриггерныеСобытия.МоментСобытия КАК МоментСобытия,
		|	ТриггерныеСобытия.ПериодСобытия КАК ПериодСобытия,
		|	ТриггерныеСобытия.ПериодСобытияВид КАК ПериодСобытияВид
		|ИЗ
		|	Справочник.ТриггерныеСобытия КАК ТриггерныеСобытия
		|ГДЕ
		|	ТриггерныеСобытия.ЭтоГруппа = ЛОЖЬ
		|	И ТриггерныеСобытия.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема)";
		
		ТаблицаТриггеров = Запрос.Выполнить().Выгрузить();
		
		ТипИнформирования 	= 0;
		ПериодСобытияВид 	= ?(ТипИнформирования = 0, Перечисления.Периодичность.День, Перечисления.Периодичность.Час);
		ПериодСобытия 		= 0;
		Если ПериодСобытияВид = Перечисления.Периодичность.День И ПериодСобытия = 0 Тогда 
			ПериодСобытияВид = Перечисления.Периодичность.Час;
			ПериодСобытия 	= 12;
		Иначе 	
			ПериодСобытия 	= ?(ПериодСобытия < 1, 1, ?(ПериодСобытия > 24, 24, ПериодСобытия));
		КонецЕсли;				
		ВремяСобытия 		= Неопределено;
		ШаблонСообщения		= Неопределено;
		
		ГенерируемыйТриггер = Неопределено; 
		Если ЗначениеЗаполнено(ТаблицаТриггеров) Тогда
	        СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Активно"			, Истина);
			СтруктураПоиска.Вставить("ПометкаУдаления"	, Ложь);
			СтруктураПоиска.Вставить("МоментСобытия"	, Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия);
			СтруктураПоиска.Вставить("ПериодСобытияВид"	, ПериодСобытияВид);
			
			МассивТриггеров = ТаблицаТриггеров.НайтиСтроки(СтруктураПоиска);
			Если МассивТриггеров.Количество() > 0 Тогда 
				ГенерируемыйТриггер = МассивТриггеров[0];
			Иначе
				СтруктураПоиска.Удалить("Активно");
				СтруктураПоиска.Удалить("ПометкаУдаления");
				МассивТриггеров = ТаблицаТриггеров.НайтиСтроки(СтруктураПоиска);
				Если МассивТриггеров.Количество() > 0 Тогда 
					ГенерируемыйТриггер = МассивТриггеров[0];
				Иначе
					ГенерируемыйТриггер = ТаблицаТриггеров[0];
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			Если ЗначениеЗаполнено(ГенерируемыйТриггер.Ссылка) 
				И ГенерируемыйТриггер.МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия
				И ГенерируемыйТриггер.ПериодСобытияВид = ПериодСобытияВид
				И ((ПериодСобытияВид = Перечисления.Периодичность.День И ПериодСобытия = ГенерируемыйТриггер.ПериодСобытия) ИЛИ (ПериодСобытияВид = Перечисления.Периодичность.Час И (Макс(ПериодСобытия, ГенерируемыйТриггер.ПериодСобытия) - Мин(ПериодСобытия, ГенерируемыйТриггер.ПериодСобытия) < 3))) Тогда 
				ТриггерДоНачалаПриема 								= ГенерируемыйТриггер.Ссылка.ПолучитьОбъект();
			Иначе 	
				// Генерируем триггер
				ТриггерДоНачалаПриема 								= СоздатьЭлемент();
			КонецЕсли;
			ТриггерДоНачалаПриема.Активно 							= Истина;
			ТриггерДоНачалаПриема.Наименование 						= ?(ЗначениеЗаполнено(ГенерируемыйТриггер.Ссылка), ТриггерДоНачалаПриема.Наименование, НСтр("ru = 'Напоминание клиентам о предварительной записи на приём';en= 'Reminder clients to make an appointment'"));
			ТриггерДоНачалаПриема.УсловиеСобытия 					= Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема;
			ТриггерДоНачалаПриема.МоментСобытия 					= Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия;
			ТриггерДоНачалаПриема.ПериодСобытияВид 					= ПериодСобытияВид;
			ТриггерДоНачалаПриема.ПериодСобытия 					= ПериодСобытия;
			ТриггерДоНачалаПриема.ВремяСобытия 						= ВремяСобытия;
			СписокОписанийТриггеров 								= ПолучитьОписанияТриггеров();
			ЭлементСпискаОписаниеУсловия 							= СписокОписанийТриггеров.НайтиПоЗначению(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема);
			Если НЕ ЭлементСпискаОписаниеУсловия = Неопределено Тогда 
				ТриггерДоНачалаПриема.Описание 						= ?(ЗначениеЗаполнено(ГенерируемыйТриггер.Ссылка), ТриггерДоНачалаПриема.Описание, ЭлементСпискаОписаниеУсловия.Представление);
			КонецЕсли;
			Если ТриггерДоНачалаПриема.ПометкаУдаления = Истина Тогда 
				ТриггерДоНачалаПриема.ПометкаУдаления = Ложь;
			КонецЕсли;
			ТриггерДоНачалаПриема.СегментКонтрагентов 				= Справочники.СегментыКонтрагентов.ПустаяСсылка();
			
			МассивДействийОтправитьСообщение = ТриггерДоНачалаПриема.Действия.НайтиСтроки(Новый Структура("ВидДействия, ВидАдресата, Удалено", Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение, Перечисления.ВидыАдресатов.КонтрагентСобытия, Ложь));
			СтрокаДействияОтправитьСообщение = Неопределено;
			Если МассивДействийОтправитьСообщение.Количество() = 0 Тогда 
				СтрокаДействияОтправитьСообщение = Неопределено;
			Иначе
				Для Каждого СтрокаДействия Из МассивДействийОтправитьСообщение Цикл
					Если СтрокаДействия.Использование = Истина Тогда 
						СтрокаДействияОтправитьСообщение = СтрокаДействия;
						Прервать;
					КонецЕсли;					
				КонецЦикла;
				Если СтрокаДействияОтправитьСообщение = Неопределено Тогда 
					СтрокаДействияОтправитьСообщение = МассивДействийОтправитьСообщение[0];
				КонецЕсли;	
			КонецЕсли;	
			
			Если СтрокаДействияОтправитьСообщение = Неопределено Тогда 
				СтрокаДействия 											= ТриггерДоНачалаПриема.Действия.Добавить();
				СтрокаДействия.ИдентификаторДействия 					= Новый УникальныйИдентификатор();				
			Иначе 
				СтрокаДействия 											= СтрокаДействияОтправитьСообщение;
			КонецЕсли;
			Если НЕ СтрокаДействия = Неопределено Тогда			
				СтрокаДействия.Использование 							= Истина; 
				СтрокаДействия.ВидДействия 								= Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение;
				СтрокаДействия.ВидАдресата 								= Перечисления.ВидыАдресатов.КонтрагентСобытия;
				Если ЗначениеЗаполнено(ШаблонСообщения) И ТриггерДоНачалаПриема.Ссылка.Пустая() Тогда 
					СтрокаДействия.ШаблонСообщения 						= ШаблонСообщения;
				ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаДействия.ШаблонСообщения) Тогда  	
					СтрокаДействия.ШаблонСообщения 						= Справочники.ШаблоныСообщений.ИнициализироватьШаблонСообщения_НачалоПриема(ТриггерДоНачалаПриема.ВремяСобытия);
				КонецЕсли;	
				СтрокаДействия.Описание 								= НСтр("ru = 'Отправить пациенту сообщение';en= 'Send a message to the client'");
			КонецЕсли;
		
			Если НЕ СтрокаДействия = Неопределено Тогда 
				// Актуализируем настройки каналов уведомлений
				МассивНастроекКаналовУведомлений = ТриггерДоНачалаПриема.НастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия", СтрокаДействия.ИдентификаторДействия));
				
				Если МассивНастроекКаналовУведомлений.Количество() = 0 Тогда 
					Для Каждого СтрокаТаблицаСервисовSMS Из ТаблицаСервисовSMS Цикл 
						СтрокаНастройкиКаналовУведомления									= ТриггерДоНачалаПриема.НастройкиКаналовУведомлений.Добавить();
						СтрокаНастройкиКаналовУведомления.ИдентификаторДействия 			= СтрокаДействия.ИдентификаторДействия;
						СтрокаНастройкиКаналовУведомления.СтруктурнаяЕдиница 				= СтрокаТаблицаСервисовSMS.СтруктурнаяЕдиница;
						СтрокаНастройкиКаналовУведомления.ОтправкаPushWallet 				= СтрокаТаблицаСервисовSMS.ОтправкаPushWallet;
						СтрокаНастройкиКаналовУведомления.ОтправкаMessenger 				= СтрокаТаблицаСервисовSMS.ОтправкаMessenger;
						СтрокаНастройкиКаналовУведомления.АккаунтВнешнейСистемы     		= СтрокаТаблицаСервисовSMS.АккаунтВнешнейСистемы;
						СтрокаНастройкиКаналовУведомления.ОтправкаSMS 						= ЗначениеЗаполнено(СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS);
						СтрокаНастройкиКаналовУведомления.АккаунтСервисаРассылкиSMS 		= СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS;
					КонецЦикла;
				Иначе 
					Для Каждого СтрокаТаблицаСервисовSMS Из ТаблицаСервисовSMS Цикл 
						МассивНастроекКаналовУведомлений = ТриггерДоНачалаПриема.НастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия, СтруктурнаяЕдиница", СтрокаДействия.ИдентификаторДействия, СтрокаТаблицаСервисовSMS.СтруктурнаяЕдиница));
						Если МассивНастроекКаналовУведомлений.Количество() = 0 Тогда
							СтрокаНастройкиКаналовУведомления								= ТриггерДоНачалаПриема.НастройкиКаналовУведомлений.Добавить();
							СтрокаНастройкиКаналовУведомления.ИдентификаторДействия 		= СтрокаДействия.ИдентификаторДействия;
							СтрокаНастройкиКаналовУведомления.СтруктурнаяЕдиница 			= СтрокаТаблицаСервисовSMS.СтруктурнаяЕдиница;
							СтрокаНастройкиКаналовУведомления.ОтправкаPushWallet 			= СтрокаТаблицаСервисовSMS.ОтправкаPushWallet;
							СтрокаНастройкиКаналовУведомления.ОтправкаMessenger 			= СтрокаТаблицаСервисовSMS.ОтправкаMessenger;
							СтрокаНастройкиКаналовУведомления.АккаунтВнешнейСистемы     	= СтрокаТаблицаСервисовSMS.АккаунтВнешнейСистемы;
							СтрокаНастройкиКаналовУведомления.ОтправкаSMS 					= ЗначениеЗаполнено(СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS);
							СтрокаНастройкиКаналовУведомления.АккаунтСервисаРассылкиSMS 	= СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS;
						Иначе 
							МассивНастроекКаналовУведомлений[0].ОтправкаSMS 				= Истина;
							МассивНастроекКаналовУведомлений[0].АккаунтСервисаРассылкиSMS 	= СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS;
						КонецЕсли;	
					КонецЦикла;
				КонецЕсли;	
			КонецЕсли;
					
			Если НЕ ЗначениеЗаполнено(ТриггерДоНачалаПриема.Код) Тогда 
				ТриггерДоНачалаПриема.УстановитьНовыйКод();
			КонецЕсли;
			// Сохраняем триггер
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ТриггерДоНачалаПриема);
		Исключение
			МетаданныеСправочника 				= Метаданные.Справочники.ТриггерныеСобытия;		
			ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать триггерное событие ""Начало приёма"" 
			|по причине: %1'");
			
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонКомментария,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение,
			МетаданныеСправочника,,
			Комментарий);
		КонецПопытки;
	КонецЕсли
	
КонецПроцедуры

// Процедура - Инициализировать триггерное событие пациент окончание срока действия страхового полиса
//
// Параметры:
//  ТаблицаСервисовSMS	 - 	 - 
//
Процедура ИнициализироватьТриггерноеСобытие_ПациентОкончаниеСрокаДействияСтраховогоПолиса(ТаблицаСервисовSMS) Экспорт 
	
	СервисSMSРассылки = Константы.СервисSMSРассылкиПоУмолчанию.Получить();   
	ИнформироватьОбОкончанииСтраховогоПолисаИспользование = Ложь;
	
	Если ИнформироватьОбОкончанииСтраховогоПолисаИспользование И ЗначениеЗаполнено(ТаблицаСервисовSMS) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТриггерныеСобытия.Ссылка КАК Ссылка,
		|	ТриггерныеСобытия.ПометкаУдаления КАК ПометкаУдаления,
		|	ТриггерныеСобытия.Активно КАК Активно
		|ИЗ
		|	Справочник.ТриггерныеСобытия КАК ТриггерныеСобытия
		|ГДЕ
		|	ТриггерныеСобытия.ЭтоГруппа = ЛОЖЬ
		|	И ТриггерныеСобытия.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ПациентОкончаниеСрокаДействияСтраховогоПолиса)";
		
		ТаблицаТриггеров = Запрос.Выполнить().Выгрузить();
		
		ГенерируемыйТриггер = Неопределено; 
		Если ЗначениеЗаполнено(ТаблицаТриггеров) Тогда 
			МассивТриггеров = ТаблицаТриггеров.НайтиСтроки(Новый Структура("Активно, ПометкаУдаления", Истина, Ложь));
			Если МассивТриггеров.Количество() > 0 Тогда 
				ГенерируемыйТриггер = МассивТриггеров[0].Ссылка;
			Иначе 
				ГенерируемыйТриггер = ТаблицаТриггеров[0].Ссылка;
			КонецЕсли;	
		КонецЕсли;
		
		Попытка
			Если ЗначениеЗаполнено(ГенерируемыйТриггер) Тогда 
				ТриггерОкончаниеДействияПолиса 						= ГенерируемыйТриггер.ПолучитьОбъект();
			Иначе 	
				// Генерируем триггер
				ТриггерОкончаниеДействияПолиса 						= СоздатьЭлемент();
			КонецЕсли;
			ТриггерОкончаниеДействияПолиса.Активно 					= Истина;
			ТриггерОкончаниеДействияПолиса.Наименование 			= ?(ЗначениеЗаполнено(ГенерируемыйТриггер), ТриггерОкончаниеДействияПолиса.Наименование, НСтр("ru = 'Окончание срока действия страхового полиса';en= 'Expiration of the insurance policy'"));
			ТриггерОкончаниеДействияПолиса.УсловиеСобытия 			= Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентОкончаниеСрокаДействияСтраховогоПолиса;
			ТриггерОкончаниеДействияПолиса.МоментСобытия 			= Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия;
			ТриггерОкончаниеДействияПолиса.ПериодСобытияВид 		= Перечисления.Периодичность.День;		
			ТриггерОкончаниеДействияПолиса.ПериодСобытия 			= 1;
			ТриггерОкончаниеДействияПолиса.ВремяСобытия 			= Дата(1,1,1) + 60*60*10;			
			СписокОписанийТриггеров 								= ПолучитьОписанияТриггеров();
			ЭлементСпискаОписаниеУсловия 							= СписокОписанийТриггеров.НайтиПоЗначению(Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентОкончаниеСрокаДействияСтраховогоПолиса);
			Если НЕ ЭлементСпискаОписаниеУсловия = Неопределено Тогда 
				ТриггерОкончаниеДействияПолиса.Описание 			= ?(ЗначениеЗаполнено(ГенерируемыйТриггер), ТриггерОкончаниеДействияПолиса.Описание, ЭлементСпискаОписаниеУсловия.Представление);
			КонецЕсли;
			Если ТриггерОкончаниеДействияПолиса.ПометкаУдаления = Истина Тогда 
				ТриггерОкончаниеДействияПолиса.ПометкаУдаления = Ложь;
			КонецЕсли;
			
			МассивДействийОтправитьСообщение = ТриггерОкончаниеДействияПолиса.Действия.НайтиСтроки(Новый Структура("ВидДействия, ВидАдресата, Удалено", Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение, Перечисления.ВидыАдресатов.КонтрагентСобытия, Ложь));
			СтрокаДействияОтправитьСообщение = Неопределено;
			Если МассивДействийОтправитьСообщение.Количество() = 0 Тогда 
				СтрокаДействияОтправитьСообщение = Неопределено;
			Иначе
				Для Каждого СтрокаДействия Из МассивДействийОтправитьСообщение Цикл
					Если СтрокаДействия.Использование = Истина Тогда 
						СтрокаДействияОтправитьСообщение = СтрокаДействия;
						Прервать;
					КонецЕсли;					
				КонецЦикла;
				Если СтрокаДействияОтправитьСообщение = Неопределено Тогда 
					СтрокаДействияОтправитьСообщение = МассивДействийОтправитьСообщение[0];
				КонецЕсли;	
			КонецЕсли;	
			
			Если СтрокаДействияОтправитьСообщение = Неопределено Тогда 
				СтрокаДействия 										= ТриггерОкончаниеДействияПолиса.Действия.Добавить();
				СтрокаДействия.ИдентификаторДействия 				= Новый УникальныйИдентификатор();				
			Иначе 
				СтрокаДействия 										= СтрокаДействияОтправитьСообщение;
			КонецЕсли;	
			СтрокаДействия.Использование 							= Истина;
			СтрокаДействия.ВидДействия 								= Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение;
			СтрокаДействия.ВидАдресата 								= Перечисления.ВидыАдресатов.КонтрагентСобытия;
			
			СтрокаДействия.ШаблонСообщения 						= Справочники.ШаблоныСообщений.ИнициализироватьШаблонСообщения_ОкончаниеСрокаДействияСтраховогоПолиса();
			СтрокаДействия.Описание 								= НСтр("ru = 'Отправить пациенту сообщение';en= 'Send a message to the client'");
			
			// Актуализируем настройки каналов уведомлений
			МассивНастроекКаналовУведомлений = ТриггерОкончаниеДействияПолиса.НастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия", СтрокаДействия.ИдентификаторДействия));
			
			Если МассивНастроекКаналовУведомлений.Количество() = 0 Тогда 
				Для Каждого СтрокаТаблицаСервисовSMS Из ТаблицаСервисовSMS Цикл 
					СтрокаНастройкиКаналовУведомления									= ТриггерОкончаниеДействияПолиса.НастройкиКаналовУведомлений.Добавить();
					СтрокаНастройкиКаналовУведомления.ИдентификаторДействия 			= СтрокаДействия.ИдентификаторДействия;
			    	СтрокаНастройкиКаналовУведомления.СтруктурнаяЕдиница 				= СтрокаТаблицаСервисовSMS.СтруктурнаяЕдиница;
					СтрокаНастройкиКаналовУведомления.ОтправкаPushWallet 				= СтрокаТаблицаСервисовSMS.ОтправкаPushWallet;
					СтрокаНастройкиКаналовУведомления.ОтправкаMessenger 				= СтрокаТаблицаСервисовSMS.ОтправкаMessenger;
					СтрокаНастройкиКаналовУведомления.АккаунтВнешнейСистемы     		= СтрокаТаблицаСервисовSMS.АккаунтВнешнейСистемы;
					СтрокаНастройкиКаналовУведомления.ОтправкаSMS 						= ЗначениеЗаполнено(СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS);
					СтрокаНастройкиКаналовУведомления.АккаунтСервисаРассылкиSMS 		= СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS;
				КонецЦикла;
			Иначе 
				Для Каждого СтрокаТаблицаСервисовSMS Из ТаблицаСервисовSMS Цикл 
					МассивНастроекКаналовУведомлений = ТриггерОкончаниеДействияПолиса.НастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия, СтруктурнаяЕдиница", СтрокаДействия.ИдентификаторДействия, СтрокаТаблицаСервисовSMS.СтруктурнаяЕдиница));
					Если МассивНастроекКаналовУведомлений.Количество() = 0 Тогда
						СтрокаНастройкиКаналовУведомления								= ТриггерОкончаниеДействияПолиса.НастройкиКаналовУведомлений.Добавить();
						СтрокаНастройкиКаналовУведомления.ИдентификаторДействия 		= СтрокаДействия.ИдентификаторДействия;
						СтрокаНастройкиКаналовУведомления.СтруктурнаяЕдиница 			= СтрокаТаблицаСервисовSMS.СтруктурнаяЕдиница;
						СтрокаНастройкиКаналовУведомления.ОтправкаPushWallet 			= СтрокаТаблицаСервисовSMS.ОтправкаPushWallet;
						СтрокаНастройкиКаналовУведомления.ОтправкаMessenger 			= СтрокаТаблицаСервисовSMS.ОтправкаMessenger;
						СтрокаНастройкиКаналовУведомления.АккаунтВнешнейСистемы     	= СтрокаТаблицаСервисовSMS.АккаунтВнешнейСистемы;
						СтрокаНастройкиКаналовУведомления.ОтправкаSMS 					= ЗначениеЗаполнено(СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS);
						СтрокаНастройкиКаналовУведомления.АккаунтСервисаРассылкиSMS 	= СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS;
					Иначе 
						МассивНастроекКаналовУведомлений[0].ОтправкаSMS 				= Истина;
						МассивНастроекКаналовУведомлений[0].АккаунтСервисаРассылкиSMS 	= СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS;
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;	
			
			Если НЕ ЗначениеЗаполнено(ТриггерОкончаниеДействияПолиса.Код) Тогда 
				ТриггерОкончаниеДействияПолиса.УстановитьНовыйКод();
			КонецЕсли;
			// Сохраняем триггер
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ТриггерОкончаниеДействияПолиса);							
		Исключение
			МетаданныеСправочника 				= Метаданные.Справочники.ТриггерныеСобытия;		
			ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать триггерное событие ""Окончании срока действия страхового полиса"" 
			|по причине: %1'");
			
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонКомментария,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение,
			МетаданныеСправочника,,
			Комментарий);
		КонецПопытки;
	КонецЕсли
	
КонецПроцедуры

// Процедура - Инициализировать триггерное событие запись смена статуса сотрудником клиники
//
// Параметры:
//  ТаблицаСервисовSMS	 - 	 - 
//
Процедура ИнициализироватьТриггерноеСобытие_ЗаписьСменаСтатусаСотрудникомКлиники(ТаблицаСервисовSMS) Экспорт 
	
	СервисSMSРассылки = Константы.СервисSMSРассылкиПоУмолчанию.Получить();
	ИнформированиеКлиентаПодтверждениеОнЛайнЗаписиШаблон = Неопределено;
	
	Если ЗначениеЗаполнено(ИнформированиеКлиентаПодтверждениеОнЛайнЗаписиШаблон) И ЗначениеЗаполнено(ТаблицаСервисовSMS) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТриггерныеСобытия.Ссылка КАК Ссылка,
		|	ТриггерныеСобытия.ПометкаУдаления КАК ПометкаУдаления,
		|	ТриггерныеСобытия.Активно КАК Активно
		|ИЗ
		|	Справочник.ТриггерныеСобытия КАК ТриггерныеСобытия
		|ГДЕ
		|	ТриггерныеСобытия.ЭтоГруппа = ЛОЖЬ
		|	И ТриггерныеСобытия.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаСотрудникомКлиники)";
		
		ТаблицаТриггеров = Запрос.Выполнить().Выгрузить();
		
		ГенерируемыйТриггер = Неопределено; 
		Если ЗначениеЗаполнено(ТаблицаТриггеров) Тогда 
			МассивТриггеров = ТаблицаТриггеров.НайтиСтроки(Новый Структура("Активно, ПометкаУдаления", Истина, Ложь));
			Если МассивТриггеров.Количество() > 0 Тогда 
				ГенерируемыйТриггер = МассивТриггеров[0].Ссылка;
			Иначе 
				ГенерируемыйТриггер = ТаблицаТриггеров[0].Ссылка;
			КонецЕсли;	
		КонецЕсли;
		
		Попытка
			Если ЗначениеЗаполнено(ГенерируемыйТриггер) Тогда 
				ТриггерСменаСтатусаЗаписи 						= ГенерируемыйТриггер.ПолучитьОбъект();
			Иначе 	
				// Генерируем триггер
				ТриггерСменаСтатусаЗаписи 						= СоздатьЭлемент();
			КонецЕсли;
			ТриггерСменаСтатусаЗаписи.Активно 					= Истина;
			ТриггерСменаСтатусаЗаписи.Наименование 				= ?(ЗначениеЗаполнено(ГенерируемыйТриггер), ТриггерСменаСтатусаЗаписи.Наименование, НСтр("ru = 'Смена статуса записи на приём сотрудником клиники';en= 'Changing the status of an appointment with a clinic employee'"));
			ТриггерСменаСтатусаЗаписи.УсловиеСобытия 			= Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаСотрудникомКлиники;
			ТриггерСменаСтатусаЗаписи.МоментСобытия 			= Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия;
			ТриггерСменаСтатусаЗаписи.ПериодСобытияВид 			= Перечисления.Периодичность.День;
			ТриггерСменаСтатусаЗаписи.СтатусЗаписи 				= Перечисления.СтатусыСобытия.Подтверждена;
			СписокОписанийТриггеров 							= ПолучитьОписанияТриггеров();
			ЭлементСпискаОписаниеУсловия 						= СписокОписанийТриггеров.НайтиПоЗначению(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаСотрудникомКлиники);
			Если НЕ ЭлементСпискаОписаниеУсловия = Неопределено Тогда 
				ТриггерСменаСтатусаЗаписи.Описание 				= ?(ЗначениеЗаполнено(ЭлементСпискаОписаниеУсловия.Представление), ЭлементСпискаОписаниеУсловия.Представление, ТриггерСменаСтатусаЗаписи.Описание);
			КонецЕсли;
			Если ТриггерСменаСтатусаЗаписи.ПометкаУдаления = Истина Тогда 
				ТриггерСменаСтатусаЗаписи.ПометкаУдаления 		= Ложь;
			КонецЕсли;
			
			МассивДействийОтправитьСообщение = ТриггерСменаСтатусаЗаписи.Действия.НайтиСтроки(Новый Структура("ВидДействия, ВидАдресата, Удалено", Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение, Перечисления.ВидыАдресатов.КонтрагентСобытия, Ложь));
			СтрокаДействияОтправитьСообщение = Неопределено;
			Если МассивДействийОтправитьСообщение.Количество() = 0 Тогда 
				СтрокаДействияОтправитьСообщение = Неопределено;
			Иначе
				Для Каждого СтрокаДействия Из МассивДействийОтправитьСообщение Цикл
					Если СтрокаДействия.Использование = Истина Тогда 
						СтрокаДействияОтправитьСообщение = СтрокаДействия;
						Прервать;
					КонецЕсли;					
				КонецЦикла;
				Если СтрокаДействияОтправитьСообщение = Неопределено Тогда 
					СтрокаДействияОтправитьСообщение = МассивДействийОтправитьСообщение[0];
				КонецЕсли;	
			КонецЕсли;	
			
			Если СтрокаДействияОтправитьСообщение = Неопределено Тогда 
				СтрокаДействия 										= ТриггерСменаСтатусаЗаписи.Действия.Добавить();
				СтрокаДействия.ИдентификаторДействия 				= Новый УникальныйИдентификатор();				
			Иначе 
				СтрокаДействия 										= СтрокаДействияОтправитьСообщение;
			КонецЕсли;	
			СтрокаДействия.Использование 							= Истина;
			СтрокаДействия.ВидДействия 								= Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение;
			СтрокаДействия.ВидАдресата 								= Перечисления.ВидыАдресатов.КонтрагентСобытия;
			СтрокаДействия.ШаблонСообщения 							= Справочники.ШаблоныСообщений.ИнициализироватьШаблонСообщения_СменаСтатусаЗаписиСотрудникомКлиники();
			СтрокаДействия.Описание 								= НСтр("ru = 'Отправить пациенту сообщение';en= 'Send a message to the client'");
			
			// Актуализируем настройки каналов уведомлений
			МассивНастроекКаналовУведомлений = ТриггерСменаСтатусаЗаписи.НастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия", СтрокаДействия.ИдентификаторДействия));
			
			Если МассивНастроекКаналовУведомлений.Количество() = 0 Тогда 
				Для Каждого СтрокаТаблицаСервисовSMS Из ТаблицаСервисовSMS Цикл 
					СтрокаНастройкиКаналовУведомления									= ТриггерСменаСтатусаЗаписи.НастройкиКаналовУведомлений.Добавить();
					СтрокаНастройкиКаналовУведомления.ИдентификаторДействия 			= СтрокаДействия.ИдентификаторДействия;
			    	СтрокаНастройкиКаналовУведомления.СтруктурнаяЕдиница 				= СтрокаТаблицаСервисовSMS.СтруктурнаяЕдиница;
					СтрокаНастройкиКаналовУведомления.ОтправкаPushWallet 				= СтрокаТаблицаСервисовSMS.ОтправкаPushWallet;
					СтрокаНастройкиКаналовУведомления.ОтправкаMessenger 				= СтрокаТаблицаСервисовSMS.ОтправкаMessenger;
					СтрокаНастройкиКаналовУведомления.АккаунтВнешнейСистемы     		= СтрокаТаблицаСервисовSMS.АккаунтВнешнейСистемы;
					СтрокаНастройкиКаналовУведомления.ОтправкаSMS 						= ЗначениеЗаполнено(СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS);
					СтрокаНастройкиКаналовУведомления.АккаунтСервисаРассылкиSMS 		= СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS;
				КонецЦикла;
			Иначе 
				Для Каждого СтрокаТаблицаСервисовSMS Из ТаблицаСервисовSMS Цикл 
					МассивНастроекКаналовУведомлений = ТриггерСменаСтатусаЗаписи.НастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия, СтруктурнаяЕдиница", СтрокаДействия.ИдентификаторДействия, СтрокаТаблицаСервисовSMS.СтруктурнаяЕдиница));
					Если МассивНастроекКаналовУведомлений.Количество() = 0 Тогда
						СтрокаНастройкиКаналовУведомления								= ТриггерСменаСтатусаЗаписи.НастройкиКаналовУведомлений.Добавить();
						СтрокаНастройкиКаналовУведомления.ИдентификаторДействия 		= СтрокаДействия.ИдентификаторДействия;
						СтрокаНастройкиКаналовУведомления.СтруктурнаяЕдиница 			= СтрокаТаблицаСервисовSMS.СтруктурнаяЕдиница;
						СтрокаНастройкиКаналовУведомления.ОтправкаPushWallet 			= СтрокаТаблицаСервисовSMS.ОтправкаPushWallet;
						СтрокаНастройкиКаналовУведомления.ОтправкаMessenger 			= СтрокаТаблицаСервисовSMS.ОтправкаMessenger;
						СтрокаНастройкиКаналовУведомления.АккаунтВнешнейСистемы     	= СтрокаТаблицаСервисовSMS.АккаунтВнешнейСистемы;
						СтрокаНастройкиКаналовУведомления.ОтправкаSMS 					= ЗначениеЗаполнено(СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS);
						СтрокаНастройкиКаналовУведомления.АккаунтСервисаРассылкиSMS 	= СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS;
					Иначе 
						МассивНастроекКаналовУведомлений[0].ОтправкаSMS 				= Истина;
						МассивНастроекКаналовУведомлений[0].АккаунтСервисаРассылкиSMS 	= СтрокаТаблицаСервисовSMS.АккаунтСервисаРассылкиSMS;
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;	
			
			Если НЕ ЗначениеЗаполнено(ТриггерСменаСтатусаЗаписи.Код) Тогда 
				ТриггерСменаСтатусаЗаписи.УстановитьНовыйКод();
			КонецЕсли;
			// Сохраняем триггер
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ТриггерСменаСтатусаЗаписи);							
		Исключение
			МетаданныеСправочника 				= Метаданные.Справочники.ТриггерныеСобытия;		
			ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать триггерное событие ""Смена статуса записи на приём сотрудником клиники"" 
			|по причине: %1'");
			
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонКомментария,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение,
			МетаданныеСправочника,,
			Комментарий);
		КонецПопытки;
	КонецЕсли
	
КонецПроцедуры
#КонецОбласти

#КонецЕсли

















