
#Область ОбработчикиСобытий

// Процедура - Обработка проверки заполнения
//
// Параметры:
//  Отказ				 - 	 - 
//  ПроверяемыеРеквизиты - 	 - 
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		Если Справочники.ТриггерныеСобытия.ИспользуетсяПараметрСобытия(УсловиеСобытия, Истина) Тогда  		
			ПроверяемыеРеквизиты.Добавить("ПараметрСобытия");
		КонецЕсли;
		
		Если Справочники.ТриггерныеСобытия.ИспользуетсяОтборПоСегментуУслуг(УсловиеСобытия, Истина) Тогда 
			ПроверяемыеРеквизиты.Добавить("УслугаСегментУслуг");
		КонецЕсли;
		
		Если МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия ИЛИ МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия Тогда 
			ПроверяемыеРеквизиты.Добавить("ПериодСобытия");
			ПроверяемыеРеквизиты.Добавить("ПериодСобытияВид");
		ИначеЕсли МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия И УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе Тогда 
			ПроверяемыеРеквизиты.Добавить("ПериодСобытия");
			ПроверяемыеРеквизиты.Добавить("ПериодСобытияВид");
			ПроверяемыеРеквизиты.Добавить("ВидСделки");
			ПроверяемыеРеквизиты.Добавить("ПереходСЭтапа");
		ИначеЕсли МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия И УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаявкаНеОбработана Тогда 
			ПроверяемыеРеквизиты.Добавить("ПериодСобытия");
			ПроверяемыеРеквизиты.Добавить("ПериодСобытияВид");
			Если ПериодСобытия > 12 И ПериодСобытияВид = Перечисления.Периодичность.Час Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Максимальное значение параметра для данного события не должно превышать 12", ЭтотОбъект, "ЭтотОбъект.ПериодСобытия");
				Отказ = Истина;
			ИначеЕсли ПериодСобытия > 720 И ПериодСобытияВид = Перечисления.Периодичность.Минута Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Максимальное значение параметра для данного события не должно превышать 720", ЭтотОбъект, "ЭтотОбъект.ПериодСобытия");
				Отказ = Истина;	
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Процедура - При копировании
//
// Параметры:
//  ОбъектКопирования	 - 	 - 
//
Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.Действия.Очистить();
	
КонецПроцедуры

// Процедура - Перед записью
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		//Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ИсточникЗаписи) ИЛИ НЕ Справочники.ТриггерныеСобытия.ИспользуетсяОтборПоИсточникамЗаписи(ЭтотОбъект.УсловиеСобытия) Тогда
		//	ИсточникЗаписи = Справочники.ИсточникиЗаписей.ПустаяСсылка();
		//КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СегментУслуг) ИЛИ НЕ Справочники.ТриггерныеСобытия.ИспользуетсяОтборПоСегментуУслуг(ЭтотОбъект.УсловиеСобытия) Тогда
			СегментУслуг = Неопределено;
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭтотОбъект.СегментУслуг) И ТипЗнч(ЭтотОбъект.СегментУслуг) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда 
			МассивТиповНоменклатуры = Новый Массив;
			МассивТиповНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Услуга);			
			Если СоставСегментаНеСодержитТипНоменклатуры(ЭтотОбъект.СегментУслуг, МассивТиповНоменклатуры, Отказ) Тогда 
				Возврат;
			КонецЕсли;	
		КонецЕсли;	
		
		Если МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия Тогда 
			Если НЕ Справочники.ТриггерныеСобытия.ЭтоИсключительноРегламентноеСобытие(ЭтотОбъект.УсловиеСобытия) ИЛИ ЭтотОбъект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема Тогда 
				// Сбросим время
				ЭтотОбъект.ВремяСобытия = Дата('0001.01.01 00:00:00');
			КонецЕсли;
		КонецЕсли;
		
		// Проверяем заполнение реквизитов табличных частях "Действия" и "НастройкиКаналовУведомлений"
		ПроверитьЗаполнениеРеквизитовДействий();
		
		Если ЭтотОбъект.Активно И ЭтотОбъект.Действия.НайтиСтроки(Новый Структура("Использование, Удалено", Истина, Ложь)).Количество() = 0 Тогда
			ЭтотОбъект.Активно = Ложь;	
		КонецЕсли;
		
		// Подчищаем неактуальные строки из ТЧ "Действия"
		АктуализироватьПланДействийТриггера();
	КонецЕсли;

КонецПроцедуры

// Процедура - При записи
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("АктуализироватьЗаписиВЖурналеРегистрации") Тогда
		РегистрыСведений.ЖурналРегистрацииТриггерныхСобытий.АктуализироватьЗаписиВЖурналеРегистрации(ЭтотОбъект);
	КонецЕсли;	
	
	Если ДополнительныеСвойства.Свойство("ПараметрыАктуализации") Тогда 
		Если ДополнительныеСвойства.ПараметрыАктуализации.Свойство("АктуализироватьПериодЗапланированныхСобытий") Тогда 
			АктуализироватьПериодЗапланированныхСобытий();
		КонецЕсли;
	КонецЕсли;	
	
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа И НЕ ПометкаУдаления И Активно Тогда
		РегламентныеЗаданияСерверСтоматология.АктуализироватьЗаданиеОчереди(Метаданные.РегламентныеЗадания.РегистрацияТриггерныхСобытий);
	КонецЕсли;
	
КонецПроцедуры

// Функция - Состав сегмента не содержит тип номенклатуры
//
// Параметры:
//  СегментНоменклатуры		 - 	 - 
//  МассивТиповНоменклатуры	 - 	 - 
//  Отказ					 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоставСегментаНеСодержитТипНоменклатуры(СегментНоменклатуры, МассивТиповНоменклатуры, Отказ)
	
	Если Отказ Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	             	  |	НоменклатураСегмента.Номенклатура КАК Номенклатура
	             	  |ИЗ
	             	  |	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	             	  |ГДЕ
	             	  |	НоменклатураСегмента.Сегмент = &Сегмент
	             	  |	И НоменклатураСегмента.Номенклатура.ТипНоменклатуры В(&МассивТиповНоменклатуры)";
	
	Запрос.УстановитьПараметр("Сегмент"					, СегментНоменклатуры);
	Запрос.УстановитьПараметр("МассивТиповНоменклатуры"	, МассивТиповНоменклатуры);
	
	Отказ = Запрос.Выполнить().Пустой();
	
	Если Отказ Тогда 
		СообщениеПользователю  							= Новый СообщениеПользователю;
		Если МассивТиповНоменклатуры.Найти(Перечисления.ТипыНоменклатуры.Услуга) <> Неопределено Тогда 
			СообщениеПользователю.Текст 					= "Вероятно не правильно указан сегмент, так как в него не входит ни одна номенклатура с типом: услуга!";		
			СообщениеПользователю.Поле 						= "Объект.УслугаСегментУслуг";
		Иначе 
			СообщениеПользователю.Текст 					= "Вероятно не правильно указан сегмент, так как в него не входит ни одна номенклатура с типом: членство/пакет услг!";		
			СообщениеПользователю.Поле 						= "Объект.СегментНоменклатуры";
		КонецЕсли;
		СообщениеПользователю.УстановитьДанные(Ссылка);
		СообщениеПользователю.Сообщить();
	КонецЕсли;		
	
	Возврат Отказ;
	
КонецФункции

// Процедура - Актуализировать период запланированных событий
//
Процедура АктуализироватьПериодЗапланированныхСобытий()
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЖурналРегистрацииТриггерныхСобытий.Период КАК Период,
	               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие КАК ТриггерноеСобытие,
	               |	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
	               |	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия КАК ОбъектСобытия,
	               |	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия КАК ИдентификаторДействия,
	               |	ЖурналРегистрацииТриггерныхСобытий.РегистрацияПоПодписке КАК РегистрацияПоПодписке
	               |ПОМЕСТИТЬ ТаблицаЗапланированныхТриггерныхСобытий
	               |ИЗ
	               |	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
	               |ГДЕ
	               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие
	               |	И ЖурналРегистрацииТриггерныхСобытий.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаЗапланированныхТриггерныхСобытий.Период КАК Период,
	               |	ВЫБОР
	               |		КОГДА &ПериодСобытияВидПрошлый = ЗНАЧЕНИЕ(Перечисление.Периодичность.Час)
	               |			ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаЗапланированныхТриггерныхСобытий.Период, ЧАС, &ПериодСобытияПрошлый * ВЫБОР
	               |						КОГДА ТаблицаЗапланированныхТриггерныхСобытий.ТриггерноеСобытие.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия)
	               |							ТОГДА 1
	               |						ИНАЧЕ -1
	               |					КОНЕЦ)
	               |		КОГДА &ПериодСобытияВидПрошлый = ЗНАЧЕНИЕ(Перечисление.Периодичность.Минута)
	               |			ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаЗапланированныхТриггерныхСобытий.Период, МИНУТА, &ПериодСобытияПрошлый * ВЫБОР
	               |						КОГДА ТаблицаЗапланированныхТриггерныхСобытий.ТриггерноеСобытие.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия)
	               |							ТОГДА 1
	               |						ИНАЧЕ -1
	               |					КОНЕЦ)
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ДатаОтсчета,
	               |	ТаблицаЗапланированныхТриггерныхСобытий.ТриггерноеСобытие КАК ТриггерноеСобытие,
	               |	ТаблицаЗапланированныхТриггерныхСобытий.Контрагент КАК Контрагент,
	               |	ТаблицаЗапланированныхТриггерныхСобытий.ОбъектСобытия КАК ОбъектСобытия,
	               |	ТаблицаЗапланированныхТриггерныхСобытий.ИдентификаторДействия КАК ИдентификаторДействия,
	               |	ТаблицаЗапланированныхТриггерныхСобытий.РегистрацияПоПодписке КАК РегистрацияПоПодписке
	               |ПОМЕСТИТЬ ТаблицаПланируемыхТриггеровИДатРегистрации
	               |ИЗ
	               |	ТаблицаЗапланированныхТриггерныхСобытий КАК ТаблицаЗапланированныхТриггерныхСобытий
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПланируемыхТриггеровИДатРегистрации.Период КАК Период,
	               |	ВЫБОР
	               |		КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытияВид = ЗНАЧЕНИЕ(Перечисление.Периодичность.Час)
	               |					ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета, ЧАС, ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытия * ВЫБОР
	               |								КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия)
	               |									ТОГДА -1
	               |								ИНАЧЕ 1
	               |							КОНЕЦ)
	               |				КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытияВид = ЗНАЧЕНИЕ(Перечисление.Периодичность.Минута)
	               |					ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета, МИНУТА, ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытия * ВЫБОР
	               |								КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия)
	               |									ТОГДА -1
	               |								ИНАЧЕ 1
	               |							КОНЕЦ)
	               |				ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ДатаЗапланированная,
	               |	ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано) КАК Статус,
	               |	ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие КАК ТриггерноеСобытие,
	               |	ТаблицаПланируемыхТриггеровИДатРегистрации.Контрагент КАК Контрагент,
	               |	ТаблицаПланируемыхТриггеровИДатРегистрации.ОбъектСобытия КАК ОбъектСобытия,
	               |	ТаблицаПланируемыхТриггеровИДатРегистрации.ИдентификаторДействия КАК ИдентификаторДействия,
	               |	ТаблицаПланируемыхТриггеровИДатРегистрации.РегистрацияПоПодписке КАК РегистрацияПоПодписке
	               |ИЗ
	               |	ТаблицаПланируемыхТриггеровИДатРегистрации КАК ТаблицаПланируемыхТриггеровИДатРегистрации";
				   
	
	Запрос.УстановитьПараметр("ТриггерноеСобытие"		, ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ПериодСобытияВидПрошлый"	, ДополнительныеСвойства.ПараметрыАктуализации.ПериодСобытияВидПрошлый);
	Запрос.УстановитьПараметр("ПериодСобытияПрошлый"	, ДополнительныеСвойства.ПараметрыАктуализации.ПериодСобытияПрошлый);
	
	ТаблицаАктуализацииЗапланированных = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ПланируемоеСобытие Из ТаблицаАктуализацииЗапланированных Цикл
		МенеджерЗаписиСобытия = РегистрыСведений.ЖурналРегистрацииТриггерныхСобытий.СоздатьМенеджерЗаписи();
		// Корректируем запись
		Если НЕ ЗначениеЗаполнено(ПланируемоеСобытие.Период) Тогда  
			Продолжить;
		КонецЕсли;							
		ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, ПланируемоеСобытие);
		МенеджерЗаписиСобытия.Прочитать();
		Если МенеджерЗаписиСобытия.Выбран() И МенеджерЗаписиСобытия.Статус = Перечисления.СтатусыРегистрацииСобытий.Запланировано Тогда 
			Если НЕ ЗначениеЗаполнено(ПланируемоеСобытие.ДатаЗапланированная) Тогда
				// Удаляем запись как неактуальную
				ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, ПланируемоеСобытие);
				МенеджерЗаписиСобытия.Удалить();
			Иначе
				// Обновляем запись
				ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, ПланируемоеСобытие);
				МенеджерЗаписиСобытия.Период = ПланируемоеСобытие.ДатаЗапланированная;				
				МенеджерЗаписиСобытия.Статус = Перечисления.СтатусыРегистрацииСобытий.Запланировано;
				МенеджерЗаписиСобытия.Записать();
			КонецЕсли;
		КонецЕсли;			
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Проверить заполнение реквизитов действий
//
Процедура ПроверитьЗаполнениеРеквизитовДействий()
	
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("СообщитьПользователю"	, Ложь);		
	СтруктураСообщения.Вставить("ТекстСообщения"		, "");
	СтруктураСообщения.Вставить("ПолеИнформирования"	, "");
	СтруктураСообщения.Вставить("ИндексСтроки"			, 0);
	СтруктураСообщения.Вставить("ПоказатьПараметры"		, Ложь);		
	
	Для Каждого СтрокаДействия Из ЭтотОбъект.Действия Цикл
		Если СтрокаДействия.Использование И НЕ ЗначениеЗаполнено(СтрокаДействия.ВидДействия) Тогда 
			СтрокаДействия.Использование = Ложь;
		КонецЕсли;	
		Если НЕ СтрокаДействия.Использование ИЛИ НЕ ЗначениеЗаполнено(СтрокаДействия.ВидДействия) ИЛИ СтрокаДействия.Удалено Тогда 
			Продолжить;
		КонецЕсли;
		
		// Проверка для действия "Поставить задачу"
		Если СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру Тогда 
			Если НЕ ЗначениеЗаполнено(СтрокаДействия.ВидАдресата) Тогда
				СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
				СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан вид исполнителя!';en='The type of performer is not specified!'"));
				СтруктураСообщения.Вставить("ПолеИнформирования"	, "ВидАдресата");
				СтруктураСообщения.Вставить("ИндексСтроки"			, ЭтотОбъект.Действия.Индекс(СтрокаДействия));

				Прервать;
			ИначеЕсли СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник И (НЕ ЗначениеЗаполнено(СтрокаДействия.Адресат) ИЛИ ТипЗнч(СтрокаДействия.Адресат) <> Тип("СправочникСсылка.Сотрудники")) Тогда
				СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
				СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан исполнитель!';en='The performer is not specified!'"));
				СтруктураСообщения.Вставить("ПолеИнформирования"	, "Адресат");
				СтруктураСообщения.Вставить("ИндексСтроки"			, ЭтотОбъект.Действия.Индекс(СтрокаДействия));

				Прервать;
			ИначеЕсли СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.СегментСотрудников И (НЕ ЗначениеЗаполнено(СтрокаДействия.Адресат) ИЛИ ТипЗнч(СтрокаДействия.Адресат) <> Тип("СправочникСсылка.СегментыСотрудников")) Тогда
				СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
				СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан сегмент исполнителей!';en='Do not specify the segment of performers!'"));
				СтруктураСообщения.Вставить("ПолеИнформирования"	, "Адресат");
				СтруктураСообщения.Вставить("ИндексСтроки"			, ЭтотОбъект.Действия.Индекс(СтрокаДействия));

				Прервать;
			ИначеЕсли СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.Куратор Тогда 
				Если НЕ ЗначениеЗаполнено(СтрокаДействия.ВидАдресатаРезервный) Тогда
					СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
					СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан резервный вид исполнителя!';en='The backup type of performer is not specified!'"));
					СтруктураСообщения.Вставить("ПолеИнформирования"	, "ВидАдресатаРезервный");
					СтруктураСообщения.Вставить("ИндексСтроки"			, ЭтотОбъект.Действия.Индекс(СтрокаДействия));
	
					Прервать;
				ИначеЕсли СтрокаДействия.ВидАдресатаРезервный = Перечисления.ВидыАдресатов.Сотрудник И (НЕ ЗначениеЗаполнено(СтрокаДействия.Адресат) ИЛИ ТипЗнч(СтрокаДействия.Адресат) <> Тип("СправочникСсылка.Сотрудники")) Тогда
					СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
					СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан резервный исполнитель!';en='A backup performer was not specified!'"));
					СтруктураСообщения.Вставить("ПолеИнформирования"	, "Адресат");
					СтруктураСообщения.Вставить("ИндексСтроки"			, ЭтотОбъект.Действия.Индекс(СтрокаДействия));
	
					Прервать;
				ИначеЕсли СтрокаДействия.ВидАдресатаРезервный = Перечисления.ВидыАдресатов.СегментСотрудников И (НЕ ЗначениеЗаполнено(СтрокаДействия.Адресат) ИЛИ ТипЗнч(СтрокаДействия.Адресат) <> Тип("СправочникСсылка.СегментыСотрудников")) Тогда
					СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
					СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан резервный сегмент исполнителей!';en='Do not specify a reserve segment performers!'"));
					СтруктураСообщения.Вставить("ПолеИнформирования"	, "Адресат");
					СтруктураСообщения.Вставить("ИндексСтроки"			, ЭтотОбъект.Действия.Индекс(СтрокаДействия));
	
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Проверка для действия "Отправить сообщение"
		Если СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение Тогда 
			Если НЕ ЗначениеЗаполнено(СтрокаДействия.ВидАдресата) Тогда
				СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
				СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан вид адресата!';en='The type of recipient is not specified!'"));
				СтруктураСообщения.Вставить("ПолеИнформирования"	, "ВидАдресата");
				СтруктураСообщения.Вставить("ИндексСтроки"			, ЭтотОбъект.Действия.Индекс(СтрокаДействия));
				Прервать;
			КонецЕсли;	
			Если СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник И (НЕ ЗначениеЗаполнено(СтрокаДействия.Адресат) ИЛИ ТипЗнч(СтрокаДействия.Адресат) <> Тип("СправочникСсылка.Сотрудники")) Тогда
				СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
				СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан адресат!';en='The recipient is not specified!'"));
				СтруктураСообщения.Вставить("ПолеИнформирования"	, "Адресат");
				СтруктураСообщения.Вставить("ИндексСтроки"			, ЭтотОбъект.Действия.Индекс(СтрокаДействия));
				Прервать;
			КонецЕсли;	
			// Проверка настроек каналов уведомлений
			Уведомить = Ложь;
			Для Каждого СтрокаНастройкаКаналов Из НастройкиКаналовУведомлений Цикл 
				Если НЕ СтрокаДействия.ИдентификаторДействия = СтрокаНастройкаКаналов.ИдентификаторДействия Тогда 
					Продолжить;
				КонецЕсли;
				
				Если СтрокаДействия.ВидАдресата <> Перечисления.ВидыАдресатов.КонтрагентСобытия Тогда 
					СтрокаНастройкаКаналов.ОтправкаPush 		= Ложь;
					СтрокаНастройкаКаналов.ОтправкаPushWallet 	= Ложь;
				КонецЕсли;
				Если СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.СегментСотрудников Тогда	
					СтрокаНастройкаКаналов.ОтправкаMessenger 	= Ложь;
				КонецЕсли;				
				Если НЕ СтрокаНастройкаКаналов.ОтправкаMessenger Тогда
					СтрокаНастройкаКаналов.КаналСистемыСообщений = "";
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрокаНастройкаКаналов.АккаунтВнешнейСистемы) И СтрокаНастройкаКаналов.ОтправкаMessenger Тогда
					СтруктураСообщения.Вставить("СообщитьПользователю"			, Истина);					
					СтруктураСообщения.Вставить("ТекстСообщения"				, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Для структурной единицы ""%1"" не указан аккаунт системы сообщений!';en='Message system account not specified!'"), СтрокаНастройкаКаналов.СтруктурнаяЕдиница));						
					СтруктураСообщения.Вставить("ПолеИнформирования"			, "АккаунтВнешнейСистемы");
					СтруктураСообщения.Вставить("ИндексСтроки"					, ЭтотОбъект.Действия.Индекс(СтрокаДействия));
					Уведомить = Истина;
					Прервать;
				КонецЕсли;	
				Если НЕ ЗначениеЗаполнено(СтрокаНастройкаКаналов.АккаунтСервисаРассылкиSMS) И СтрокаНастройкаКаналов.ОтправкаSMS Тогда
					СтруктураСообщения.Вставить("СообщитьПользователю"			, Истина);
					СтруктураСообщения.Вставить("ТекстСообщения"				, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Для структурной единицы ""%1"" не указан аккаунт SMS-рассылки!';en='The SMS mailing account is not specified!'"), СтрокаНастройкаКаналов.СтруктурнаяЕдиница));												
					СтруктураСообщения.Вставить("ПолеИнформирования"			, "АккаунтSMS");
					СтруктураСообщения.Вставить("ИндексСтроки"					, ЭтотОбъект.Действия.Индекс(СтрокаДействия));
					Уведомить = Истина;					
					Прервать;
				КонецЕсли;	
				Если СтрокаНастройкаКаналов.ОтправкаMessenger Тогда 
					ТипВнешнейСистемы = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаНастройкаКаналов.АккаунтВнешнейСистемы, "ТипВнешнейСистемы");
					Если ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Chat2Desk И НЕ ЗначениеЗаполнено(СтрокаДействия.КаналСистемыСообщений) Тогда 
						//СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
						//СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан канал системы сообщений!';en='The message system channel is not specified!'"));
						//СтруктураСообщения.Вставить("ПолеИнформирования"	, "КаналСистемыСообщений");
						//СтруктураСообщения.Вставить("ИндексСтроки"			, ЭтотОбъект.Действия.Индекс(СтрокаДействия));
						//
						//Прервать;
					ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi Тогда 
						СтрокаНастройкаКаналов.КаналСистемыСообщений = "";					
					КонецЕсли;						
				КонецЕсли;
			КонецЦикла;	
			
			Если Уведомить Тогда 
				Прервать;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДействия.ШаблонСообщения) Тогда 
				Если ПустоеСодержаниеШаблона(СтрокаДействия.ШаблонСообщения, "СодержаниеМессенджер") И ПустоеСодержаниеШаблона(СтрокаДействия.ШаблонСообщения, "Содержание") Тогда 
					СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
					СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Необходимо заполнить содержание в шаблоне SMS-рассылки!';en='You must fill in the content in the SMS mailing template!'"));
					СтруктураСообщения.Вставить("ПолеИнформирования"	, "ШаблонСообщения");
					СтруктураСообщения.Вставить("ИндексСтроки"			, ЭтотОбъект.Действия.Индекс(СтрокаДействия));
					Прервать;
				КонецЕсли;
			КонецЕсли;
			Если НастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия, ОтправкаPush", СтрокаДействия.ИдентификаторДействия, Истина)).Количество() = 0
				И НастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия, ОтправкаPushWallet", СтрокаДействия.ИдентификаторДействия, Истина)).Количество() = 0
				И НастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия, ОтправкаMessenger", СтрокаДействия.ИдентификаторДействия, Истина)).Количество() = 0 
				И НастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия, ОтправкаSMS", СтрокаДействия.ИдентификаторДействия, Истина)).Количество() = 0 Тогда 
				
				СтрокаДействия.Использование = Ложь;
			КонецЕсли;			
		КонецЕсли;
		
		// Проверка для действия "Отправить Email"			
		Если СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо Тогда 
			Если НЕ ЗначениеЗаполнено(СтрокаДействия.ВидАдресата) Тогда
				СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
				СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан вид адресата!';en='The type of recipient is not specified!'"));
				СтруктураСообщения.Вставить("ПолеИнформирования"	, "ВидАдресата");
				СтруктураСообщения.Вставить("ИндексСтроки"			, ЭтотОбъект.Действия.Индекс(СтрокаДействия));

				Прервать;
			ИначеЕсли СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник И (НЕ ЗначениеЗаполнено(СтрокаДействия.Адресат) ИЛИ ТипЗнч(СтрокаДействия.Адресат) <> Тип("СправочникСсылка.Сотрудники")) Тогда
				СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
				СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан адресат!';en='The recipient is not specified!'"));
				СтруктураСообщения.Вставить("ПолеИнформирования"	, "Адресат");
				СтруктураСообщения.Вставить("ИндексСтроки"			, ЭтотОбъект.Действия.Индекс(СтрокаДействия));

				Прервать;
			ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаДействия.АккаунтEmail) Тогда
				СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
				СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан аккаунт Email-рассылки!';en='The Email mailing account is not specified!'"));
				СтруктураСообщения.Вставить("ПолеИнформирования"	, "АккаунтEmail");
				СтруктураСообщения.Вставить("ИндексСтроки"			, ЭтотОбъект.Действия.Индекс(СтрокаДействия));

				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		// Проверка для действия "Повысить этап сделки"						
		Если СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки ИЛИ СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки Тогда 
			Если НЕ ЗначениеЗаполнено(СтрокаДействия.ВидСделки) Тогда
				СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
				СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан вид сделки!';en='The type of transaction is not specified!'"));
				СтруктураСообщения.Вставить("ПолеИнформирования"	, "ВидСделки");
				СтруктураСообщения.Вставить("ИндексСтроки"			, ЭтотОбъект.Действия.Индекс(СтрокаДействия));

				Прервать;
			ИначеЕсли ЗначениеЗаполнено(СтрокаДействия.ВидСделки) И НЕ ЗначениеЗаполнено(СтрокаДействия.ЭтапСделки) Тогда 
				СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
				СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан этап сделки!';en='The transaction stage was omitted!'"));
				СтруктураСообщения.Вставить("ПолеИнформирования"	, "ЭтапСделки");
				СтруктураСообщения.Вставить("ИндексСтроки"			, ЭтотОбъект.Действия.Индекс(СтрокаДействия));

				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		// Проверка для действия "Активировать чат-бота"						
		Если СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота Тогда 
			Если НЕ ЗначениеЗаполнено(СтрокаДействия.СценарийЧатБота) Тогда
				СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
				СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан сценарий чат-бота!';en='No chatbot script specified!'"));
				СтруктураСообщения.Вставить("ПолеИнформирования"	, "СценарийЧатБота");
				СтруктураСообщения.Вставить("ИндексСтроки"			, ЭтотОбъект.Действия.Индекс(СтрокаДействия));

				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		// Проверка заполненности шаблона
		Если ЗначениеЗаполнено(СтрокаДействия.ВидДействия) И НЕ (СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки ИЛИ СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки ИЛИ СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота) Тогда 
			Если НЕ ЗначениеЗаполнено(СтрокаДействия.ШаблонСообщения) Тогда
				СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
				СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан шаблон!';en='Do not specify a template!'"));
				СтруктураСообщения.Вставить("ПолеИнформирования"	, "ШаблонСообщения");
				СтруктураСообщения.Вставить("ИндексСтроки"			, ЭтотОбъект.Действия.Индекс(СтрокаДействия));

				Прервать;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	// Информируем пользователя
	Если СтруктураСообщения.СообщитьПользователю Тогда
		// Сообщаем
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураСообщения.ТекстСообщения,
		ЭтотОбъект, "ЭтотОбъект.Действия[" + Формат(СтруктураСообщения.ИндексСтроки, "ЧГ=0") + "]." + СтруктураСообщения.ПолеИнформирования);
		// Прерываем запись
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры

// Функция - Пустое содержание шаблона
//
// Параметры:
//  ШаблонСообщения	 - 	 - 
//  ИмяРеквизита	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПустоеСодержаниеШаблона(ШаблонСообщения, ИмяРеквизита)
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ПустоеСодержание = Ложь;
	Попытка
		ПустоеСодержание = НЕ ЗначениеЗаполнено(СокрЛП(ШаблонСообщения[ИмяРеквизита]));
	Исключение
		
	КонецПопытки;
	
	Возврат ПустоеСодержание;
	
КонецФункции

// Процедура - Актуализировать план действий триггера
//
Процедура АктуализироватьПланДействийТриггера()
	
	МассивИдентификаторов = Новый Массив;
	Для Каждого СтрокаДействие Из ЭтотОбъект.Действия Цикл 
		Если СтрокаДействие.Удалено Тогда 
			МассивИдентификаторов.Добавить(СтрокаДействие.ИдентификаторДействия);
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаДействие.ВидДействия) И (ЭтотОбъект.Ссылка.Пустая() ИЛИ ЭтотОбъект.Ссылка.Действия.Найти(СтрокаДействие.ИдентификаторДействия, "ИдентификаторДействия") = Неопределено) Тогда 
			МассивИдентификаторов.Добавить(СтрокаДействие.ИдентификаторДействия);
		КонецЕсли;	
	КонецЦикла;
	
	Если МассивИдентификаторов.Количество() <> 0 Тогда 
		Если НЕ ПривилегированныйРежим() Тогда 
			УстановитьПривилегированныйРежим(Истина);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия КАК ИдентификаторДействия
		               |ИЗ
		               |	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		               |ГДЕ
		               |	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия В(&МассивИдентификаторов)";
		
		Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
		МассивАктуальныхИдентификаторов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИдентификаторДействия");
		Для Каждого АктуальныйИдентификатор Из МассивАктуальныхИдентификаторов Цикл
			ИдентификаторВЖурнале = МассивИдентификаторов.Найти(АктуальныйИдентификатор);
			Если ИдентификаторВЖурнале <> Неопределено Тогда 
				МассивИдентификаторов.Удалить(ИдентификаторВЖурнале);
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	
	Если МассивИдентификаторов.Количество() <> 0 Тогда 
		Для Каждого ИдентификаторДействия Из МассивИдентификаторов Цикл 
			ЭтотОбъект.Действия.Удалить(ЭтотОбъект.Действия.Найти(ИдентификаторДействия, "ИдентификаторДействия"));			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
