
#Область ОбработчикиСобытий

// Функция, возвращает таблицу настроек интерфейса журнала записи.
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьНастройкиИнтерфейсаЖурналаЗаписи(СтруктурнаяЕдиница, ТекущийСотрудник = Неопределено) Экспорт
	
	// цвета по умолчанию
	ЦветПриемНачат	     = ЗначениеВСтрокуВнутр(Новый Цвет(164, 209, 251)); 
	ЦветНеПодтверждена   = ЗначениеВСтрокуВнутр(Новый Цвет(255, 140, 0));
	ЦветПодтверждена	 = ЗначениеВСтрокуВнутр(Новый Цвет(181, 228, 229));
	ЦветПриемОкончен     = ЗначениеВСтрокуВнутр(Новый Цвет(144, 238, 144));
	ЦветПриемОтменен     = ЗначениеВСтрокуВнутр(Новый Цвет(224, 56, 56));
	ЦветПриемНеСостоялся = ЗначениеВСтрокуВнутр(Новый Цвет(128, 128, 0));
	ЦветПациентОжидает	 = ЗначениеВСтрокуВнутр(Новый Цвет(229, 218, 0));
	ЦветПриемПеренесен	 = ЗначениеВСтрокуВнутр(Новый Цвет(230, 165, 165));
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиИнтерфейсов.Ссылка КАК НастройкаПВХ
	|ПОМЕСТИТЬ ВтНастройки
	|ИЗ
	|	ПланВидовХарактеристик.НастройкиИнтерфейсов КАК НастройкиИнтерфейсов
	|ГДЕ
	|	НастройкиИнтерфейсов.Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ИнтерфейсЖурналаЗаписи)
	|	И НЕ НастройкиИнтерфейсов.ПометкаУдаления
	|	И НЕ НастройкиИнтерфейсов.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиИнтерфейсов.Настройка КАК Настройка,
	|	НастройкиИнтерфейсов.Значение КАК Значение
	|ПОМЕСТИТЬ ВтДанные
	|ИЗ
	|	РегистрСведений.НастройкиИнтерфейсов КАК НастройкиИнтерфейсов
	|ГДЕ
	|	НастройкиИнтерфейсов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И НастройкиИнтерфейсов.Настройка В
	|			(ВЫБРАТЬ
	|				ВтНастройки.НастройкаПВХ
	|			ИЗ
	|				ВтНастройки КАК ВтНастройки)
	|	И ВЫБОР
	|			КОГДА НастройкиИнтерфейсов.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ИнтервалЗаписи)
	|				ТОГДА НастройкиИнтерфейсов.Пользователь = &ТекущийСотрудник
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтНастройки.НастройкаПВХ КАК Настройка,
	|	ВЫБОР
	|		КОГДА ВтДанные.Значение ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВтНастройки.НастройкаПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеВремени)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеВремениВариант1)
	|					КОГДА ВтНастройки.НастройкаПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеСотрудника)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеСотрудникаВариант1)
	|					КОГДА ВтНастройки.НастройкаПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеКлиента)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеКлиентаВариант1)
	|					КОГДА ВтНастройки.НастройкаПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеУслуги)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеВариантОтображать)
	|					КОГДА ВтНастройки.НастройкаПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеРесурса)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеВариантОтображать)
	|					КОГДА ВтНастройки.НастройкаПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеТелефона)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеВариантНеОтображать)
	|					КОГДА ВтНастройки.НастройкаПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеКомментария)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеВариантНеОтображать)
	|					КОГДА ВтНастройки.НастройкаПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеДолжности)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеВариантОтображать)
	|					КОГДА ВтНастройки.НастройкаПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеВозраста)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеВариантОтображать)
	|					КОГДА ВтНастройки.НастройкаПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемНачат)
	|						ТОГДА &ЦветПриемНачат
	|					КОГДА ВтНастройки.НастройкаПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ЦветНеПодтверждена)
	|						ТОГДА &ЦветНеПодтверждена
	|					КОГДА ВтНастройки.НастройкаПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ЦветПодтверждена)
	|						ТОГДА &ЦветПодтверждена
	|					КОГДА ВтНастройки.НастройкаПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемОкончен)
	|						ТОГДА &ЦветПриемОкончен
	|					КОГДА ВтНастройки.НастройкаПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемОтменен)
	|						ТОГДА &ЦветПриемОтменен
	|					КОГДА ВтНастройки.НастройкаПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемПеренесен)
	|						ТОГДА &ЦветПриемПеренесен
	|					КОГДА ВтНастройки.НастройкаПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемНеСостоялся)
	|						ТОГДА &ЦветПриемНеСостоялся
	|					КОГДА ВтНастройки.НастройкаПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ЦветПациентОжидает)
	|						ТОГДА &ЦветПациентОжидает
	|					КОГДА ВтНастройки.НастройкаПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеТекущегоДня)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеТекущегоДняВариант2)
	|					КОГДА ВтНастройки.НастройкаПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеФильтров)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеФильтровВариант1)
	|					КОГДА ВтНастройки.НастройкаПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ИнтервалЗаписи)
	|						ТОГДА 0
	|				КОНЕЦ
	|		ИНАЧЕ ВтДанные.Значение
	|	КОНЕЦ КАК Значение
	|ИЗ
	|	ВтНастройки КАК ВтНастройки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтДанные КАК ВтДанные
	|		ПО ВтНастройки.НастройкаПВХ = ВтДанные.Настройка");
		
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"  , СтруктурнаяЕдиница);
    Запрос.УстановитьПараметр("ЦветНеПодтверждена"  , ЦветНеПодтверждена);
    Запрос.УстановитьПараметр("ЦветПодтверждена"    , ЦветПодтверждена);
	Запрос.УстановитьПараметр("ЦветПриемНачат"  	, ЦветПриемНачат);
	Запрос.УстановитьПараметр("ЦветПриемОкончен"    , ЦветПриемОкончен);
	Запрос.УстановитьПараметр("ЦветПриемОтменен"	, ЦветПриемОтменен);
	Запрос.УстановитьПараметр("ЦветПриемПеренесен"	, ЦветПриемПеренесен);
	Запрос.УстановитьПараметр("ЦветПриемНеСостоялся", ЦветПриемНеСостоялся);
	Запрос.УстановитьПараметр("ЦветПациентОжидает"	, ЦветПациентОжидает);
	Запрос.УстановитьПараметр("ТекущийСотрудник"	, ТекущийСотрудник);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция, получить настройки цвета журнала записи.
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьНастройкиЦветаЖурналаЗаписи(СтруктурнаяЕдиница) Экспорт
	
	ТаблицаНастроек = РегистрыСведений.НастройкиИнтерфейсов.ПолучитьНастройкиИнтерфейсаЖурналаЗаписи(СтруктурнаяЕдиница);
	Настройки = Новый Структура();
	Для Каждого СтрокаТЧ Из ТаблицаНастроек Цикл
		
		Если СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветНеПодтверждена Тогда
			Настройки.Вставить("ЦветНеПодтверждена", СтрокаТЧ.Значение);
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПодтверждена Тогда
			Настройки.Вставить("ЦветПодтверждена", СтрокаТЧ.Значение);
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемНачат Тогда
			Настройки.Вставить("ЦветПриемНачат", СтрокаТЧ.Значение);
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемОкончен Тогда
			Настройки.Вставить("ЦветПриемОкончен", СтрокаТЧ.Значение);
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемОтменен Тогда
			Настройки.Вставить("ЦветПриемОтменен", СтрокаТЧ.Значение);
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемНеСостоялся Тогда
			Настройки.Вставить("ЦветПриемНеСостоялся", СтрокаТЧ.Значение);
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПациентОжидает Тогда
			Настройки.Вставить("ЦветПациентОжидает", СтрокаТЧ.Значение);
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемПеренесен Тогда
			Настройки.Вставить("ЦветПриемПеренесен", СтрокаТЧ.Значение);	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Настройки;
	
КонецФункции

// Функция - Получить настройки монитора продаж
//
// Параметры:
//  ТекущийПользователь	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьНастройкиМонитораПродаж(ЗНАЧ ТекущийПользователь = Неопределено, ДляВсехПользователей = Ложь) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(ТекущийПользователь) Тогда 
		ТекущийПользователь = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиИнтерфейсов.Ссылка КАК Настройка
	               |ПОМЕСТИТЬ ТаблицаНастроек
	               |ИЗ
	               |	ПланВидовХарактеристик.НастройкиИнтерфейсов КАК НастройкиИнтерфейсов
	               |ГДЕ
	               |	НастройкиИнтерфейсов.ПометкаУдаления = ЛОЖЬ
	               |	И НастройкиИнтерфейсов.Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.ИнтерфейсМонитораПродаж)
	               |	И НастройкиИнтерфейсов.ЭтоГруппа = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НастройкиИнтерфейсов.Настройка КАК Настройка,
	               |	НастройкиИнтерфейсов.Пользователь КАК Пользователь,
	               |	НастройкиИнтерфейсов.Значение КАК Значение
	               |ПОМЕСТИТЬ ТаблицаЗначенийНастроек
	               |ИЗ
	               |	РегистрСведений.НастройкиИнтерфейсов КАК НастройкиИнтерфейсов
	               |ГДЕ
	               |	НастройкиИнтерфейсов.Настройка В
	               |			(ВЫБРАТЬ
	               |				ТаблицаНастроек.Настройка
	               |			ИЗ
	               |				ТаблицаНастроек)
	               |	И НастройкиИнтерфейсов.Пользователь = &ТекущийПользователь
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаНастроек.Настройка КАК Настройка,
	               |	ВЫБОР
	               |		КОГДА ТаблицаЗначенийНастроек.Значение ЕСТЬ NULL
	               |			ТОГДА ВЫБОР
	               |					КОГДА ТаблицаНастроек.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.МониторПродаж_ПоказатьВидеоРоликПриПервомЗапуске)
	               |						ТОГДА ИСТИНА
	               |					КОГДА ТаблицаНастроек.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.МониторПродаж_АвтоматическоеАвтообновление)
	               |						ТОГДА ИСТИНА
	               |					КОГДА ТаблицаНастроек.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.МониторПродаж_ПериодАвтообновления)
	               |						ТОГДА 300
	               |					КОГДА ТаблицаНастроек.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.МониторПродаж_ДатаПросмотраИсторииСобытий)
	               |						ТОГДА &ДатаНачалаВыборкиДляИсторииПросмотра
	               |					КОГДА ТаблицаНастроек.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.МониторПродаж_ОтображатьИнструкциюПоKPI)
	               |						ТОГДА ИСТИНА
	               |					КОГДА ТаблицаНастроек.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.МониторПродаж_ОтображатьИнструкциюПоЗадачам)
	               |						ТОГДА ИСТИНА
	               |					КОГДА ТаблицаНастроек.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.МониторПродаж_ОтображатьИнструкциюПоЗаявкам)
	               |						ТОГДА ИСТИНА
	               |					КОГДА ТаблицаНастроек.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.МониторПродаж_ОтображатьИнструкциюПоКлиентам)
	               |						ТОГДА ИСТИНА
	               |					КОГДА ТаблицаНастроек.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.МониторПродаж_ОтображатьИнструкциюПоСделкам)
	               |						ТОГДА ИСТИНА
	               |					КОГДА ТаблицаНастроек.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.МониторПродаж_КоличествоКолонокДляВыводимыхВиджетов)
	               |						ТОГДА 3
	               |					КОГДА ТаблицаНастроек.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.МониторПродаж_КоличествоКолонокДляВыводимыхВиджетовKPI)
	               |						ТОГДА 3
	               |					КОГДА ТаблицаНастроек.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.МониторПродаж_ОтборПериодТип)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	               |					КОГДА ТаблицаНастроек.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.МониторПродаж_ОтборАдресатСведенийТип)
	               |						ТОГДА ""Мои""
	               |					КОГДА ТаблицаНастроек.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.МониторПродаж_ОтборСтруктурнаяЕдиница)
	               |						ТОГДА &ТекущаяСтруктурнаяЕдиница
	               |				КОНЕЦ
	               |		ИНАЧЕ ТаблицаЗначенийНастроек.Значение
	               |	КОНЕЦ КАК Значение,
	               |	ЕСТЬNULL(ТаблицаЗначенийНастроек.Пользователь, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Пользователь,
	               |	ТаблицаНастроек.Настройка.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	               |ИЗ
	               |	ТаблицаНастроек КАК ТаблицаНастроек
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЗначенийНастроек КАК ТаблицаЗначенийНастроек
	               |		ПО ТаблицаНастроек.Настройка = ТаблицаЗначенийНастроек.Настройка";
	
	Если ДляВсехПользователей Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НастройкиИнтерфейсов.Пользователь = &ТекущийПользователь", "ИСТИНА");
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекущийПользователь) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НастройкиИнтерфейсов.Пользователь = &ТекущийПользователь", "ЛОЖЬ");
	Иначе 
		Запрос.УстановитьПараметр("ТекущийПользователь"					, ТекущийПользователь);
	КонецЕсли;	
	Запрос.УстановитьПараметр("ДатаНачалаВыборкиДляИсторииПросмотра" 	, ТекущаяДатаСеанса() - 86400*7);
	Запрос.УстановитьПараметр("ТекущаяСтруктурнаяЕдиница"				, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция, возвращает значение настройки из регистра.
//
Функция ПолучитьЗначениеНастройки(СтруктурнаяЕдиница, Настройка, ЗначениеПоУмолчанию) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА НастройкиИнтерфейсов.Значение ЕСТЬ NULL
	|			ТОГДА &ЗначениеПоУмолчанию
	|		ИНАЧЕ НастройкиИнтерфейсов.Значение
	|	КОНЕЦ КАК Значение
	|ИЗ
	|	РегистрСведений.НастройкиИнтерфейсов КАК НастройкиИнтерфейсов
	|ГДЕ
	|	НастройкиИнтерфейсов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И НастройкиИнтерфейсов.Настройка = &Настройка");
	
	//ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиИнтерфейсов.РегистрацияПосещений)
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница" , СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Настройка"		   , Настройка);
	Запрос.УстановитьПараметр("ЗначениеПоУмолчанию", ЗначениеПоУмолчанию);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Значение, Ложь);
	
КонецФункции

// Функция - Получить значение настройки пользователя
//
// Параметры:
//  ИмяНастройки		 - 	 - 
//  ЗначениеПоУмолчанию	 - 	 - 
//  ТекущийПользователь	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЗначениеНастройкиПользователя(ИмяНастройки, ЗначениеПоУмолчанию, ТекущийПользователь = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТекущийПользователь) Тогда 
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВЫБОР
	               |		КОГДА НастройкиИнтерфейсов.Значение ЕСТЬ NULL
	               |			ТОГДА &ЗначениеПоУмолчанию
	               |		ИНАЧЕ НастройкиИнтерфейсов.Значение
	               |	КОНЕЦ КАК Значение
	               |ИЗ
	               |	ПланВидовХарактеристик.НастройкиИнтерфейсов КАК ПВХ_НастройкиИнтерфейсов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиИнтерфейсов КАК НастройкиИнтерфейсов
	               |		ПО ПВХ_НастройкиИнтерфейсов.Ссылка = НастройкиИнтерфейсов.Настройка
	               |ГДЕ
	               |	ПВХ_НастройкиИнтерфейсов.ИмяПредопределенныхДанных = &ИмяНастройки
	               |	И НастройкиИнтерфейсов.Пользователь = &Пользователь";
	
	
	Запрос.УстановитьПараметр("Пользователь" 		, ТекущийПользователь);
	Запрос.УстановитьПараметр("ИмяНастройки"		, ИмяНастройки);
	Запрос.УстановитьПараметр("ЗначениеПоУмолчанию"	, ЗначениеПоУмолчанию);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ТипЗнч(ЗначениеПоУмолчанию) = Тип("Булево") Тогда 
		Возврат ?(Выборка.Следующий(), Выборка.Значение, ?(ЗначениеПоУмолчанию, ЗначениеПоУмолчанию, Ложь));
	Иначе 	
		Возврат ?(Выборка.Следующий(), Выборка.Значение, Неопределено);
	КонецЕсли;
	
КонецФункции

// Процедура, выполняет запись значения настройки.
//
Процедура ЗаписатьЗначениеНастройки(Знач СтруктурнаяЕдиница = Неопределено, Настройка, Значение, Сотрудник = Неопределено) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	МенеджерЗаписи.СтруктурнаяЕдиница 	= СтруктурнаяЕдиница;
	МенеджерЗаписи.Настройка		  	= Настройка;
	МенеджерЗаписи.Значение			  	= Значение;
	МенеджерЗаписи.Пользователь			= Сотрудник;
	
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

// Процедура - Записать значение настройки пользователя
//
// Параметры:
//  ИмяНастройки		 - 	 - 
//  Значение			 - 	 - 
//  ТекущийПользователь	 - 	 - 
//
Процедура ЗаписатьЗначениеНастройкиПользователя(ИмяНастройки, Значение, ТекущийПользователь = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТекущийПользователь) Тогда 
		ТекущийПользователь = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Настройка		= ПланыВидовХарактеристик.НастройкиИнтерфейсов[ИмяНастройки];
	МенеджерЗаписи.Пользователь 	= ТекущийПользователь;
	МенеджерЗаписи.Значение			= Значение;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти
