
#Область ОбработчикиСобытийФормы

&НаКлиенте
// Обработчик при открытии формы на клиенте
// 
Процедура ПриОткрытии(Отказ)
	
	// Обработать проверку на создание элемента в папке предопределенных
	Если Объект.Ссылка.Пустая()
		И ЗначениеЗаполнено(Объект.Родитель)
		И Объект.Родитель = ПредопределенноеЗначение("ПланВидовХарактеристик.ПараметрыОбследований.Предопределенные") Тогда
		
		ПоказатьПредупреждение(,"Создание новых групп в группе предопределенных параметров запрещено!");
		Отказ = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

&НаКлиенте 
// Обработчик события скрыть показать дополнительно.
//
Процедура СкрытьПоказатьДополнительно(Команда)
	
	Элементы.ГруппаДополнительно.Видимость = НЕ Элементы.ГруппаДополнительно.Видимость;
	
КонецПроцедуры

#КонецОбласти