
#Область ________________________________ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ___________________________________

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоВерсияКОРП 								= Истина; //ОбщегоНазначенияПовтИсп.ЭтоВерсияКОРП();
	Элементы.ГруппаИнформацияДляПРОФ.Видимость 	= НЕ ЭтоВерсияКОРП;
	ЗадаватьВопросПередУдалениемДействий		= РегистрыСведений.НастройкиИнтерфейсов.ПолучитьЗначениеНастройкиПользователя("Триггеры_ЗадаватьВопросПриУдаленииДействий", Истина);
	ТекущаяСтруктурнаяЕдиница 					= ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	
	Если НЕ Элементы.ГруппаИнформацияДляПРОФ.Видимость Тогда
		ЗагрузитьТаблицуАктуализацииТриггеров();
		ЗагрузитьСписокВнешнихСистем();
	КонецЕсли;

	ИнициироватьРазделСобытия();
	ЗаполнитьСписокТриггеров(, Истина);
	ЗаполнитьСписокМоментовАктивации();
	ЗаполнитьСписокВыбораВремени();
	ЗаполнитьСписокСтруктурныхЕдиниц();
	ЗаполнитьСписокВидовПериодаСобытий();	
	ЗаполнитьСписокВидовСделок();
	ЗаполнитьСписокВидовЛицевыхСчетов();
	ЗаполнитьСписокВидовБонусныхСчетов();
	ЗаполнитьСписокСтатусовПредварительнойЗаписи();
	ЗаполнитьСписокТиповСтраховыхПолисов();
	ЗаполнитьСписокВыбораРежимаНапоминания();
	
	// Динамическое формирование табличной части
	СформироватьТаблицуДействий(, Истина);
	
	УстановитьСвойстваЭлементамФормы(Истина);
	УстановитьДоступностьЭлементамФормы();
		
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка оповещения
//
// Параметры:
//  ИмяСобытия	 - 	 - 
//  Параметр	 - 	 - 
//  Источник	 - 	 - 
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОБНОВИТЬ_ВИДЫ_И_ЭТАПЫ_СДЕЛОК" Тогда
		// Кешируем текущие значения объекта
		СтруктураЗначенийОбъекта = ЗакешироватьТекущиеЗначенияОбъекта();
		// Читаем актуальную версию объекта
		ЭтаФорма.Прочитать();
		// Восстанавливаем значения
		ЗаполнитьЗначенияСвойств(Объект, СтруктураЗначенийОбъекта);
		ЭтаФорма.Модифицированность = НЕ Объект.Ссылка.Пустая();
		УстановитьСвойстваЭлементамДействий();
	КонецЕсли;	
	
	Если ИмяСобытия = "СОХРАНЕНИЕ_ВНЕШНЕЙ_СИСТЕМЫ" Тогда 
		УстановитьСвойстваЭлементамДействий();
	КонецЕсли;
	
	Если ИмяСобытия = "СОХРАНЕНИЕ_СЦЕНАРИЯ" Тогда 
		УстановитьСвойстваЭлементамДействий();
	КонецЕсли;
	
	Если ИмяСобытия = "ОТКЛЮЧЕН_ВОПРОС_ПОЛЬЗОВАТЕЛЮ_ОБ_УДАЛЕНИИ_ДЕЙСТВИЯ" Тогда
		Если ЗадаватьВопросПередУдалениемДействий = Истина Тогда 
			ЗадаватьВопросПередУдалениемДействий = Ложь;
		КонецЕсли;			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перед записью
//
// Параметры:
//  Отказ			 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Активно И Объект.ЭтоГруппа = Ложь Тогда
		// Проверка на заполненость реквизитов объекта, которые скрыты в всплывающих группах
		// (Прекрасно понимаю, что данная проверка должна производится в модуле объекта.
		// Но для большей информативности пользователей было принято решение продублировать в модуле формы)
		
		СтруктураСообщения = Новый Структура;
		СтруктураСообщения.Вставить("СообщитьПользователю"			, Ложь);		
		СтруктураСообщения.Вставить("ТекстСообщения"				, "");
		СтруктураСообщения.Вставить("ПолеИнформирования"			, "");
		СтруктураСообщения.Вставить("ИндексСтроки"					, 0);
		СтруктураСообщения.Вставить("ПоказатьПараметры"				, Ложь);		
		СтруктураСообщения.Вставить("ПоказатьФормуНастройкиКаналов"	, Ложь);
		
		Для Каждого СтрокаДействия Из Объект.Действия Цикл
			Если НЕ СтрокаДействия.Использование ИЛИ НЕ ЗначениеЗаполнено(СтрокаДействия.ВидДействия) ИЛИ СтрокаДействия.Удалено Тогда 
				Продолжить;
			КонецЕсли;
			
			// Проверка для действия "Поставить задачу"
			Если СтрокаДействия.ВидДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру") Тогда 
				Если НЕ ЗначениеЗаполнено(СтрокаДействия.ВидАдресата) Тогда
					СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
					СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан вид исполнителя!';en='The type of performer is not specified!'"));
					СтруктураСообщения.Вставить("ПолеИнформирования"	, "ВидАдресата");
					СтруктураСообщения.Вставить("ИндексСтроки"			, Объект.Действия.Индекс(СтрокаДействия));
					СтруктураСообщения.Вставить("ПоказатьПараметры"		, Истина);
					Прервать;
				ИначеЕсли СтрокаДействия.ВидАдресата = ПредопределенноеЗначение("Перечисление.ВидыАдресатов.Сотрудник") И (НЕ ЗначениеЗаполнено(СтрокаДействия.Адресат) ИЛИ ТипЗнч(СтрокаДействия.Адресат) <> Тип("СправочникСсылка.Сотрудники")) Тогда
					СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
					СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан исполнитель!';en='The performer is not specified!'"));
					СтруктураСообщения.Вставить("ПолеИнформирования"	, "Адресат");
					СтруктураСообщения.Вставить("ИндексСтроки"			, Объект.Действия.Индекс(СтрокаДействия));
					СтруктураСообщения.Вставить("ПоказатьПараметры"		, Истина);
					Прервать;
				ИначеЕсли СтрокаДействия.ВидАдресата = ПредопределенноеЗначение("Перечисление.ВидыАдресатов.СегментСотрудников") И (НЕ ЗначениеЗаполнено(СтрокаДействия.Адресат) ИЛИ ТипЗнч(СтрокаДействия.Адресат) <> Тип("СправочникСсылка.СегментыСотрудников")) Тогда
					СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
					СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан сегмент исполнителей!';en='Do not specify the segment of performers!'"));
					СтруктураСообщения.Вставить("ПолеИнформирования"	, "Адресат");
					СтруктураСообщения.Вставить("ИндексСтроки"			, Объект.Действия.Индекс(СтрокаДействия));
					СтруктураСообщения.Вставить("ПоказатьПараметры"		, Истина);
					Прервать;
				ИначеЕсли СтрокаДействия.ВидАдресата = ПредопределенноеЗначение("Перечисление.ВидыАдресатов.Куратор") Тогда 
					Если НЕ ЗначениеЗаполнено(СтрокаДействия.ВидАдресатаРезервный) Тогда
						СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
						СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан резервный вид исполнителя!';en='The backup type of performer is not specified!'"));
						СтруктураСообщения.Вставить("ПолеИнформирования"	, "ВидАдресатаРезервный");
						СтруктураСообщения.Вставить("ИндексСтроки"			, Объект.Действия.Индекс(СтрокаДействия));
						СтруктураСообщения.Вставить("ПоказатьПараметры"		, Истина);
						Прервать;
					ИначеЕсли СтрокаДействия.ВидАдресатаРезервный = ПредопределенноеЗначение("Перечисление.ВидыАдресатов.Сотрудник") И (НЕ ЗначениеЗаполнено(СтрокаДействия.Адресат) ИЛИ ТипЗнч(СтрокаДействия.Адресат) <> Тип("СправочникСсылка.Сотрудники")) Тогда
						СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
						СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан резервный исполнитель!';en='A backup performer was not specified!'"));
						СтруктураСообщения.Вставить("ПолеИнформирования"	, "Адресат");
						СтруктураСообщения.Вставить("ИндексСтроки"			, Объект.Действия.Индекс(СтрокаДействия));
						СтруктураСообщения.Вставить("ПоказатьПараметры"		, Истина);
						Прервать;
					ИначеЕсли СтрокаДействия.ВидАдресатаРезервный = ПредопределенноеЗначение("Перечисление.ВидыАдресатов.СегментСотрудников") И (НЕ ЗначениеЗаполнено(СтрокаДействия.Адресат) ИЛИ ТипЗнч(СтрокаДействия.Адресат) <> Тип("СправочникСсылка.СегментыСотрудников")) Тогда
						СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
						СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан резервный сегмент исполнителей!';en='Do not specify a reserve segment performers!'"));
						СтруктураСообщения.Вставить("ПолеИнформирования"	, "Адресат");
						СтруктураСообщения.Вставить("ИндексСтроки"			, Объект.Действия.Индекс(СтрокаДействия));
						СтруктураСообщения.Вставить("ПоказатьПараметры"		, Истина);
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			// Проверка для действия "Отправить сообщение"
			Если СтрокаДействия.ВидДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение") Тогда
				Если НЕ ЗначениеЗаполнено(СтрокаДействия.ВидАдресата) Тогда
					СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
					СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан вид адресата!';en='The type of recipient is not specified!'"));
					СтруктураСообщения.Вставить("ПолеИнформирования"	, "ВидАдресата");
					СтруктураСообщения.Вставить("ИндексСтроки"			, Объект.Действия.Индекс(СтрокаДействия));
					СтруктураСообщения.Вставить("ПоказатьПараметры"		, Истина);
					Прервать;
				ИначеЕсли СтрокаДействия.ВидАдресата = ПредопределенноеЗначение("Перечисление.ВидыАдресатов.Сотрудник") И (НЕ ЗначениеЗаполнено(СтрокаДействия.Адресат) ИЛИ ТипЗнч(СтрокаДействия.Адресат) <> Тип("СправочникСсылка.Сотрудники")) Тогда
					СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
					СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан адресат!';en='The recipient is not specified!'"));
					СтруктураСообщения.Вставить("ПолеИнформирования"	, "Адресат");
					СтруктураСообщения.Вставить("ИндексСтроки"			, Объект.Действия.Индекс(СтрокаДействия));
					СтруктураСообщения.Вставить("ПоказатьПараметры"		, Истина);
					Прервать;
					//ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаДействия.АккаунтSMS) И СтрокаДействия.ОтправкаSMS Тогда
					//	СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
					//	СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан аккаунт SMS-рассылки!';en='The SMS mailing account is not specified!'"));												
					//	СтруктураСообщения.Вставить("ПолеИнформирования"	, "АккаунтSMS");
					//	СтруктураСообщения.Вставить("ИндексСтроки"			, Объект.Действия.Индекс(СтрокаДействия));
					//	СтруктураСообщения.Вставить("ПоказатьПараметры"		, Истина);
					//	Прервать;
					//ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаДействия.АккаунтВнешнейСистемы) И СтрокаДействия.ОтправкаMessenger Тогда
					//	СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);					
					//	СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан аккаунт системы сообщений!';en='Message system account not specified!'"));						
					//	СтруктураСообщения.Вставить("ПолеИнформирования"	, "АккаунтВнешнейСистемы");
					//	СтруктураСообщения.Вставить("ИндексСтроки"			, Объект.Действия.Индекс(СтрокаДействия));
					//	СтруктураСообщения.Вставить("ПоказатьПараметры"		, Истина);
					//	Прервать;					
					//ИначеЕсли СтрокаДействия.ОтправкаMessenger Тогда 
					//	ТипВнешнейСистемы = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаДействия.АккаунтВнешнейСистемы, "ТипВнешнейСистемы");
					//	Если ТипВнешнейСистемы = ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.Chat2Desk") И НЕ ЗначениеЗаполнено(СтрокаДействия.КаналСистемыСообщений) Тогда 
					//		СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
					//		СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан канал системы сообщений!';en='The message system channel is not specified!'"));
					//		СтруктураСообщения.Вставить("ПолеИнформирования"	, "КаналСистемыСообщений");
					//		СтруктураСообщения.Вставить("ИндексСтроки"			, Объект.Действия.Индекс(СтрокаДействия));
					//		СтруктураСообщения.Вставить("ПоказатьПараметры"		, Истина);
					//		Прервать;						
					//	КонецЕсли;
				Иначе
					Уведомить = Ложь;				
					Для Каждого СтрокаНастройкаКаналов Из МоделируемыеНастройкиКаналовУведомлений Цикл 
						Если НЕ СтрокаДействия.ИдентификаторДействия = СтрокаНастройкаКаналов.ИдентификаторДействия Тогда 
							Продолжить;
						КонецЕсли;
						
						Если НЕ ЗначениеЗаполнено(СтрокаНастройкаКаналов.АккаунтВнешнейСистемы) И СтрокаНастройкаКаналов.ОтправкаMessenger Тогда
							СтруктураСообщения.Вставить("СообщитьПользователю"			, Истина);					
							СтруктураСообщения.Вставить("ТекстСообщения"				, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Для структурной единицы ""%1"" не указан аккаунт системы сообщений!';en='Message system account not specified!'"), СтрокаНастройкаКаналов.СтруктурнаяЕдиница));						
							СтруктураСообщения.Вставить("ПолеИнформирования"			, "АккаунтВнешнейСистемы");
							СтруктураСообщения.Вставить("ИндексСтроки"					, Объект.Действия.Индекс(СтрокаДействия));
							СтруктураСообщения.Вставить("ПоказатьПараметры"				, Истина);
							СтруктураСообщения.Вставить("ПоказатьФормуНастройкиКаналов"	, Истина);
							Уведомить = Истина;						
							Прервать;					
						ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаНастройкаКаналов.АккаунтСервисаРассылкиSMS) И СтрокаНастройкаКаналов.ОтправкаSMS Тогда
							СтруктураСообщения.Вставить("СообщитьПользователю"			, Истина);
							СтруктураСообщения.Вставить("ТекстСообщения"				, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Для структурной единицы ""%1"" не указан аккаунт SMS-рассылки!';en='The SMS mailing account is not specified!'"), СтрокаНастройкаКаналов.СтруктурнаяЕдиница));												
							СтруктураСообщения.Вставить("ПолеИнформирования"			, "АккаунтSMS");
							СтруктураСообщения.Вставить("ИндексСтроки"					, Объект.Действия.Индекс(СтрокаДействия));
							СтруктураСообщения.Вставить("ПоказатьПараметры"				, Истина);
							СтруктураСообщения.Вставить("ПоказатьФормуНастройкиКаналов"	, Истина);							
							Уведомить = Истина;												
							Прервать; 
						КонецЕсли;
					КонецЦикла;
					Если Уведомить Тогда 
						Прервать;
					КонецЕсли;				
				КонецЕсли;	
				Если ЗначениеЗаполнено(СтрокаДействия.ШаблонСообщения) Тогда 
					Если ПустоеСодержаниеШаблона(СтрокаДействия.ШаблонСообщения, "СодержаниеМессенджер") И ПустоеСодержаниеШаблона(СтрокаДействия.ШаблонСообщения, "Содержание") Тогда 
						СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
						СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Необходимо заполнить содержание в шаблоне SMS-рассылки!';en='You must fill in the content in the SMS mailing template!'"));
						СтруктураСообщения.Вставить("ПолеИнформирования"	, "ШаблонСообщения");
						СтруктураСообщения.Вставить("ИндексСтроки"			, Объект.Действия.Индекс(СтрокаДействия));
						СтруктураСообщения.Вставить("ПоказатьПараметры"		, Истина);
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			// Проверка для действия "Отправить Email"			
			Если СтрокаДействия.ВидДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо") Тогда 
				Если НЕ ЗначениеЗаполнено(СтрокаДействия.ВидАдресата) Тогда
					СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
					СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан вид адресата!';en='The type of recipient is not specified!'"));
					СтруктураСообщения.Вставить("ПолеИнформирования"	, "ВидАдресата");
					СтруктураСообщения.Вставить("ИндексСтроки"			, Объект.Действия.Индекс(СтрокаДействия));
					СтруктураСообщения.Вставить("ПоказатьПараметры"		, Истина);
					Прервать;
				ИначеЕсли СтрокаДействия.ВидАдресата = ПредопределенноеЗначение("Перечисление.ВидыАдресатов.Сотрудник") И (НЕ ЗначениеЗаполнено(СтрокаДействия.Адресат) ИЛИ ТипЗнч(СтрокаДействия.Адресат) <> Тип("СправочникСсылка.Сотрудники")) Тогда
					СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
					СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан адресат!';en='The recipient is not specified!'"));
					СтруктураСообщения.Вставить("ПолеИнформирования"	, "Адресат");
					СтруктураСообщения.Вставить("ИндексСтроки"			, Объект.Действия.Индекс(СтрокаДействия));
					СтруктураСообщения.Вставить("ПоказатьПараметры"		, Истина);
					Прервать;
				ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаДействия.АккаунтEmail) Тогда
					СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
					СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан аккаунт Email-рассылки!';en='The Email mailing account is not specified!'"));
					СтруктураСообщения.Вставить("ПолеИнформирования"	, "АккаунтEmail");
					СтруктураСообщения.Вставить("ИндексСтроки"			, Объект.Действия.Индекс(СтрокаДействия));
					СтруктураСообщения.Вставить("ПоказатьПараметры"		, Истина);
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
			// Проверка для действия "Повысить этап сделки"						
			Если СтрокаДействия.ВидДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки") ИЛИ СтрокаДействия.ВидДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки") Тогда 
				Если НЕ ЗначениеЗаполнено(СтрокаДействия.ВидСделки) Тогда
					СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
					СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан вид сделки!';en='The type of transaction is not specified!'"));
					СтруктураСообщения.Вставить("ПолеИнформирования"	, "ВидСделки");
					СтруктураСообщения.Вставить("ИндексСтроки"			, Объект.Действия.Индекс(СтрокаДействия));
					СтруктураСообщения.Вставить("ПоказатьПараметры"		, Истина);
					Прервать;
				ИначеЕсли ЗначениеЗаполнено(СтрокаДействия.ВидСделки) И НЕ ЗначениеЗаполнено(СтрокаДействия.ЭтапСделки) Тогда 
					СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
					СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан этап сделки!';en='The transaction stage was omitted!'"));
					СтруктураСообщения.Вставить("ПолеИнформирования"	, "ЭтапСделки");
					СтруктураСообщения.Вставить("ИндексСтроки"			, Объект.Действия.Индекс(СтрокаДействия));
					СтруктураСообщения.Вставить("ПоказатьПараметры"		, Истина);
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
			// Проверка для действия "Активировать чат-бота"						
			Если СтрокаДействия.ВидДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота") Тогда 
				Если НЕ ЗначениеЗаполнено(СтрокаДействия.СценарийЧатБота) Тогда
					СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
					СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан сценарий чат-бота!';en='No chatbot script specified!'"));
					СтруктураСообщения.Вставить("ПолеИнформирования"	, "СценарийЧатБота");
					СтруктураСообщения.Вставить("ИндексСтроки"			, Объект.Действия.Индекс(СтрокаДействия));
					СтруктураСообщения.Вставить("ПоказатьПараметры"		, Истина);
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
			// Проверка заполненности шаблона
			Если ЗначениеЗаполнено(СтрокаДействия.ВидДействия) И НЕ (СтрокаДействия.ВидДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки") ИЛИ СтрокаДействия.ВидДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки") ИЛИ СтрокаДействия.ВидДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота")) Тогда 
				Если НЕ ЗначениеЗаполнено(СтрокаДействия.ШаблонСообщения) Тогда
					СтруктураСообщения.Вставить("СообщитьПользователю"	, Истина);
					СтруктураСообщения.Вставить("ТекстСообщения"		, НСтр("ru='Не указан шаблон!';en='Do not specify a template!'"));
					СтруктураСообщения.Вставить("ПолеИнформирования"	, "ШаблонСообщения");
					СтруктураСообщения.Вставить("ИндексСтроки"			, Объект.Действия.Индекс(СтрокаДействия));
					СтруктураСообщения.Вставить("ПоказатьПараметры"		, Истина);
					Прервать;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		
		// Информируем пользователя
		Если СтруктураСообщения.СообщитьПользователю Тогда
			// Показываем всплывающую группу
			Если СтруктураСообщения.ПоказатьПараметры Тогда 
				ЭлементФормы = Элементы.Найти("ВсплывающаяГруппаПараметровДействия_Индекс_" + Строка(СтруктураСообщения.ИндексСтроки));
				Если НЕ ЭлементФормы = Неопределено Тогда
					Если ЭлементФормы.Скрыта() Тогда 
						ЭлементФормы.Показать();
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			// Сообщаем
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтруктураСообщения.ТекстСообщения,
			, "Объект.Действия[" + Формат(СтруктураСообщения.ИндексСтроки, "ЧГ=0") + "]." + СтруктураСообщения.ПолеИнформирования);
			// Прерываем запись
			Отказ = Истина;
		КонецЕсли;	
				
	КонецЕсли;

	ИнициироватьАктуализациюЗапланированных(Отказ);		
	
КонецПроцедуры

&НаКлиенте
// Процедура - Инициировать актуализацию запланированных
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ИнициироватьАктуализациюЗапланированных(Отказ)
	
	Если Отказ = Истина Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыАктуализации) = Тип("Структура") И ПараметрыАктуализации.Свойство("ПроверкаИнициирована") Тогда 
		Возврат;
	КонецЕсли;
	
	ИнициироватьАктуализациюЗапланированныхНаСервере(); 
	Если ПараметрыАктуализации.Свойство("АктуализироватьПериодЗапланированныхСобытий") Тогда
		ОписаниеОповещенияВопроса = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбАктуализациипериодаЗапланированных", ЭтотОбъект);
		СписокКнопокДиалога = Новый СписокЗначений;
		СписокКнопокДиалога.Добавить(КодВозвратаДиалога.ОК		, "Продолжить");
		СписокКнопокДиалога.Добавить(КодВозвратаДиалога.Отмена	, "Отмена");
		ПоказатьВопрос(ОписаниеОповещенияВопроса, "Вами были изменены параметры инициации триггерного события в разделе ""Старт"". Необходима актуализация времени срабатывания триггерного события для запланированных клиентов.", СписокКнопокДиалога, , , "Вопрос пользователю");
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - После ответа на вопрос об актуализациипериода запланированных
//
// Параметры:
//  РезультатОтвета			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПослеОтветаНаВопросОбАктуализациипериодаЗапланированных(РезультатОтвета, ДополнительныеПараметры = Неопределено) Экспорт 
	
	Если ЗначениеЗаполнено(РезультатОтвета) Тогда
		Если РезультатОтвета = КодВозвратаДиалога.ОК Тогда 
			ПараметрыАктуализации.Вставить("ПроверкаИнициирована", Истина);
			ЭтаФорма.Записать();
			ЭтаФорма.Закрыть();
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Процедура - Инициировать актуализацию запланированных на сервере
//
Процедура ИнициироватьАктуализациюЗапланированныхНаСервере()
	
	ПараметрыАктуализации = Новый Структура;
	
	Если Объект.Ссылка.Пустая() Тогда 
		Возврат;
	КонецЕсли;
	
	Если Объект.Активно И Объект.ЭтоГруппа = Ложь Тогда
		Если Объект.УсловиеСобытия = Объект.Ссылка.УсловиеСобытия И Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентСменаСтатуса Тогда 
			Если Объект.Ссылка.МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия И (Объект.Ссылка.ПериодСобытияВид = Перечисления.Периодичность.Час ИЛИ Объект.Ссылка.ПериодСобытияВид = Перечисления.Периодичность.Минута) 
				И Объект.МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия И (Объект.ПериодСобытияВид = Перечисления.Периодичность.Час ИЛИ Объект.ПериодСобытияВид = Перечисления.Периодичность.Минута) 
				И (Объект.Ссылка.ПериодСобытияВид <> Объект.ПериодСобытияВид ИЛИ Объект.Ссылка.ПериодСобытия <> Объект.ПериодСобытия) Тогда 
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	ЖурналРегистрацииТриггерныхСобытий.Период КАК Период,
				               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие КАК ТриггерноеСобытие,
				               |	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
				               |	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия КАК ОбъектСобытия,
				               |	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия КАК ИдентификаторДействия,
				               |	ЖурналРегистрацииТриггерныхСобытий.РегистрацияПоПодписке КАК РегистрацияПоПодписке
				               |ИЗ
				               |	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
				               |ГДЕ
				               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие
				               |	И ЖурналРегистрацииТриггерныхСобытий.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)";
				
				Запрос.УстановитьПараметр("ТриггерноеСобытие", Объект.Ссылка);
				ТаблицаЗапланированных = Запрос.Выполнить().Выгрузить();
				ПараметрыАктуализации.Вставить("КоличествоЗапланированных", ТаблицаЗапланированных.Количество());
				//Если ПараметрыАктуализации.КоличествоЗапланированных > 0 Тогда 
					ПараметрыАктуализации.Вставить("АктуализироватьПериодЗапланированныхСобытий", Истина);
					ПараметрыАктуализации.Вставить("ПериодСобытияВидПрошлый", Объект.Ссылка.ПериодСобытияВид);
					ПараметрыАктуализации.Вставить("ПериодСобытияПрошлый"	, Объект.Ссылка.ПериодСобытия);
				//КонецЕсли;	
				
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура - Перед записью на сервере
//
// Параметры:
//  Отказ			 - 	 - 
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.НастройкиКаналовУведомлений.Очистить();
	
	Для Каждого СтрокаДействия Из ТекущийОбъект.Действия Цикл 
		Если НЕ ЗначениеЗаполнено(СтрокаДействия.ВидДействия) ИЛИ СтрокаДействия.Удалено ИЛИ НЕ СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение Тогда 
			Продолжить;
		КонецЕсли;
		
		МассивСтрокНастроекПоСтруктурнымЕдиницам = МоделируемыеНастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия", СтрокаДействия.ИдентификаторДействия));
		Для Каждого ЭлементМассиваСтрок Из МассивСтрокНастроекПоСтруктурнымЕдиницам Цикл 
			ЗаполнитьЗначенияСвойств(ТекущийОбъект.НастройкиКаналовУведомлений.Добавить(), ЭлементМассиваСтрок);
		КонецЦикла;
	КонецЦикла;	
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ПараметрыАктуализации", ПараметрыАктуализации);
	      
КонецПроцедуры

&НаСервере
// Процедура - После записи на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// Динамическое формирование табличной части
	СформироватьТаблицуДействий(, Истина);	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перед закрытием
//
// Параметры:
//  Отказ				 - 	 - 
//  ЗавершениеРаботы	 - 	 - 
//  ТекстПредупреждения	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если ЗавершениеРаботы ИЛИ НЕ ЭтоВерсияКОРП Тогда 
		Возврат;
	КонецЕсли;
	
	СохранитьТаблицуАктуализацииТриггеров(ТаблицаАктуализацииТриггеров); 
	
КонецПроцедуры

#КонецОбласти

#Область ________________________________ОБРАБОТЧИКИ_КОМАНД_ФОРМЫ____________________________________

&НаКлиенте
// Процедура - Активировать событие
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура АктивироватьСобытие(Команда)
	
	Объект.Активно = НЕ Объект.Активно;
	ЭтаФорма.Модифицированность = Истина;
	УстановитьСвойстваЭлементамФормы(Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор времени старта
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВыборВремениСтарта(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ДатаВремя"			, НачалоДня(ТекущаяДата()) + (Час(Объект.ВремяСобытия)*60*60) + (Минута(Объект.ВремяСобытия)*60));
	ПараметрыФормы.Вставить("ШагМинут"			, 10);	

	ОписаниеОповещения = Новый ОписаниеОповещения("ПредставлениеВремяСтартаРегистрацииСобытия", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборВремениДня", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Представление время старта регистрации события
//
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
//
Процедура ПредставлениеВремяСтартаРегистрацииСобытия(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.ВремяСобытия = Результат;
		УстановитьСвойстваЭлементамПериодаАктивации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Фильтровать по сегменту услуг
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ФильтроватьПоСегментуУслуг(Команда)

	ОбновитьСвойстваЭлементовВыбораУслугиСегментаУслуг(Новый ОписаниеТипов("СправочникСсылка.СегментыНоменклатуры"));
		
КонецПроцедуры

&НаКлиенте
// Процедура - Фильтровать по услуге
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ФильтроватьПоУслуге(Команда)
	
	ОбновитьСвойстваЭлементовВыбораУслугиСегментаУслуг(Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Фильтровать по онлайн продаже да
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ФильтроватьПоОнлайнПродаже_Да(Команда)
	
	ОбновитьСвойстваЭлементовВыбораПризнакаОнлайнПродажа("ОнлайнКасса");
	
КонецПроцедуры

&НаКлиенте
// Процедура - Фильтровать по онлайн продаже нет
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ФильтроватьПоОнлайнПродаже_Нет(Команда)
	
	ОбновитьСвойстваЭлементовВыбораПризнакаОнлайнПродажа("НеФискализировать");
	
КонецПроцедуры

&НаКлиенте
// Процедура - Фильтровать по онлайн продаже не важно
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ФильтроватьПоОнлайнПродаже_НеВажно(Команда)
	
	ОбновитьСвойстваЭлементовВыбораПризнакаОнлайнПродажа("ПустаяСсылка");
	
КонецПроцедуры

&НаКлиенте
// Процедура - Сохраниь описание
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СохраниьОписание(Команда)
	
	Элементы.ГруппаВсплывающаяОписание.Скрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ____________________________ОБРАБОТКА_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ_______________________________

&НаКлиенте
// Процедура - Активно при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура АктивноПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;
	УстановитьСвойстваЭлементамФормы();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Виртуальная группа событий при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ВиртуальнаяГруппаСобытийПриИзменении(Элемент)
	
	ЗаполнитьСписокТриггеров(Истина, , Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Условие активации при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура УсловиеАктивацииПриИзменении(Элемент)
	
	ЗаполнитьСписокМоментовАктивации(Истина, Истина, Истина, Истина, Истина, Истина, Истина, Истина, Истина, Истина, Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Параметр события при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ПараметрСобытияПриИзменении(Элемент)

	УстановитьСвойстваЭлементамПараметраАктивации();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Момент активации при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура МоментАктивацииПриИзменении(Элемент)
	
	УстановитьСвойстваЭлементамПериодаАктивации();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Период события при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ПериодСобытияПриИзменении(Элемент)
	
	Если СтрНайти(Элемент.Имя, "Параметр") = 0 Тогда
		УстановитьСвойстваЭлементамПериодаАктивации();
	Иначе 
		УстановитьСвойстваЭлементамПериодаПараметра();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Период события вид при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ПериодСобытияВидПриИзменении(Элемент)
	
	Если СтрНайти(Элемент.Имя, "Параметр") = 0 Тогда	
		УстановитьСвойстваЭлементамПериодаАктивации();	
	Иначе 
		УстановитьСвойстваЭлементамПериодаПараметра();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Услуга сегмент услуг при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура УслугаСегментУслугПриИзменении(Элемент)
	
	ОчиститьСообщения();
	#Если Не ВебКлиент Тогда
		//ОкноСлСообщ = Новый COMОбъект("Wscript.shell"); 
		//ОкноСлСообщ.SendKeys("^+{z}"); 
		//ОкноСлСообщ.SendKeys("^+{я}");
	#КонецЕсли	
		
КонецПроцедуры

&НаКлиенте
// Процедура - Вид сделки при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ВидСделкиПриИзменении(Элемент)
	
	УстановитьСвойстваЭлементамВыбораВидаСделок();
	Если ЗначениеЗаполнено(Объект.ВидСделки) Тогда 
		ЭтаФорма.ТекущийЭлемент = Элементы.ПереходСЭтапа;
	Иначе 
		Объект.ПереходСЭтапа = ПредопределенноеЗначение("Справочник.ЭтапыСделок.ПустаяСсылка");
		Объект.ПереходНаЭтап = ПредопределенноеЗначение("Справочник.ЭтапыСделок.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Переход с этапа при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ПереходСЭтапаПриИзменении(Элемент)

	ЭтаФорма.ТекущийЭлемент = Элементы.ПереходНаЭтап;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Переход на этап при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ПереходНаЭтапПриИзменении(Элемент)
	
	ЭтаФорма.ТекущийЭлемент = Элементы.МоментСобытия;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Переход с этапа обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПереходСЭтапаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) И ЗначениеЗаполнено(Объект.ПереходНаЭтап) И ВыбранноеЗначение = Объект.ПереходНаЭтап Тогда 
		СтандартнаяОбработка = Ложь;
		Если ТипЗнч(Объект.ПереходНаЭтап) = Тип("ПеречислениеСсылка.СтатусыКонтрагентов") Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю("Выбранный статус уже указан!", , "Объект.ПереходНаЭтап");
		ИначеЕсли ТипЗнч(Объект.ПереходНаЭтап) = Тип("СправочникСсылка.ЭтапыСделок") Тогда 	
			ОбщегоНазначенияКлиент.СообщитьПользователю("Выбранный этап уже указан!", , "Объект.ПереходНаЭтап");
		КонецЕсли;	
		Элементы.ПереходНаЭтап.ОбновитьТекстРедактирования();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Переход на этап обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПереходНаЭтапОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) И ЗначениеЗаполнено(Объект.ПереходСЭтапа) И ВыбранноеЗначение = Объект.ПереходСЭтапа Тогда 
		СтандартнаяОбработка = Ложь;
		Если ТипЗнч(Объект.ПереходСЭтапа) = Тип("ПеречислениеСсылка.СтатусыКонтрагентов") Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю("Выбранный статус уже указан!", , "Объект.ПереходСЭтапа");
		ИначеЕсли ТипЗнч(Объект.ПереходСЭтапа) = Тип("СправочникСсылка.ЭтапыСделок") Тогда  	
			ОбщегоНазначенияКлиент.СообщитьПользователю("Выбранный этап уже указан!", , "Объект.ПереходСЭтапа");
		КонецЕсли;
		Элементы.ПереходСЭтапа.ОбновитьТекстРедактирования();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Переход с этапа открытие
//
// Параметры:
//  Элемент				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПереходСЭтапаОткрытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Переход на этап открытие
//
// Параметры:
//  Элемент				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПереходНаЭтапОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Декорация описание триггерного события обработка навигационной ссылки
//
// Параметры:
//  Элемент									 - 	 - 
//  НавигационнаяСсылкаФорматированнойСтроки - 	 - 
//  СтандартнаяОбработка					 - 	 - 
//
Процедура ДекорацияОписаниеТриггерногоСобытияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Элементы.ГруппаВсплывающаяОписание.Показать();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Описание изменение текста редактирования
//
// Параметры:
//  Элемент				 - 	 - 
//  Текст				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОписаниеИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Объект.Описание = Текст;
	СформироватьДекорациюОписаниеТриггерногоСобытия();	
	
КонецПроцедуры

#КонецОбласти

#Область ________________________ПОДКЛЮЧАЕМЫЕ_ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ__________________________

&НаКлиенте
// Процедура - Подключаемый использование действия поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ИспользованиеДействия_Поле_ПриИзменении(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамДействий(, СтруктураДанныеЭлемента.ИндексСтроки);
		Если ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.ШаблонСообщения) Тогда
			ИнформирующееСообщение = "";
			Если ПустоеСодержаниеШаблона(СтруктураДанныеЭлемента.ДанныеЭлемента.ШаблонСообщения, , СтруктураДанныеЭлемента.ДанныеЭлемента.ВидДействия, ИнформирующееСообщение) Тогда 
				// Сообщаем
				Если ЗначениеЗаполнено(ИнформирующееСообщение) Тогда 
					ОбщегоНазначенияКлиент.СообщитьПользователю(ИнформирующееСообщение,
					, "Объект.Действия[" + Формат(СтруктураДанныеЭлемента.ИндексСтроки, "ЧГ=0") + "]." + "ШаблонСообщения");
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый вид действия поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ВидДействия_Поле_ПриИзменении(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		Если ДействиеЗарегистрировано(СтруктураДанныеЭлемента.ДанныеЭлемента.ИдентификаторДействия, СтруктураДанныеЭлемента.ДанныеЭлемента.ВидДействия, , Объект.Ссылка) Тогда
			СообщитьОНедопустимостиСменыДействия(СтруктураДанныеЭлемента.ИндексСтроки);
			Возврат;
		КонецЕсли;		
		СтруктураДанныеЭлемента.ДанныеЭлемента.Использование = ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.ВидДействия);
		Если ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.ВидДействия) И НеобходимоДобавитьЭлементВвода(СтруктураДанныеЭлемента.ИндексСтроки) Тогда 
			СформироватьТаблицуДействий(СтруктураДанныеЭлемента.ИндексСтроки, , Истина);
		Иначе 	
			УстановитьСвойстваЭлементамДействий(, СтруктураДанныеЭлемента.ИндексСтроки);
		КонецЕсли;
		Если СтруктураДанныеЭлемента.ДанныеЭлемента.ВидДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота") Тогда 
			СтруктураДанныеЭлемента.ДанныеЭлемента.ВидАдресата = ПредопределенноеЗначение("Перечисление.ВидыАдресатов.КонтрагентСобытия");	
		КонецЕсли;	
		ПоказатьВсплывающуюГруппуПараметров(СтруктураДанныеЭлемента.ДанныеЭлемента.ИдентификаторДействия, СтруктураДанныеЭлемента.ДанныеЭлемента.ВидДействия);
		Если ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.ШаблонСообщения) Тогда
			ИнформирующееСообщение = "";
			Если ПустоеСодержаниеШаблона(СтруктураДанныеЭлемента.ДанныеЭлемента.ШаблонСообщения, , СтруктураДанныеЭлемента.ДанныеЭлемента.ВидДействия, ИнформирующееСообщение) Тогда 
				// Сообщаем
				Если ЗначениеЗаполнено(ИнформирующееСообщение) Тогда 
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ИнформирующееСообщение,
					, "Объект.Действия[" + Формат(СтруктураДанныеЭлемента.ИндексСтроки, "ЧГ=0") + "]." + "ШаблонСообщения");
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый вид действия поле начало выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеВыбора		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура Подключаемый_ВидДействия_Поле_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		Если ДействиеЗарегистрировано(СтруктураДанныеЭлемента.ДанныеЭлемента.ИдентификаторДействия, СтруктураДанныеЭлемента.ДанныеЭлемента.ВидДействия, СтандартнаяОбработка, Объект.Ссылка) Тогда
			СообщитьОНедопустимостиСменыДействия(СтруктураДанныеЭлемента.ИндексСтроки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый вид действия поле очистка
//
// Параметры:
//  Элемент				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура Подключаемый_ВидДействия_Поле_Очистка(Элемент, СтандартнаяОбработка)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		Если ДействиеЗарегистрировано(СтруктураДанныеЭлемента.ДанныеЭлемента.ИдентификаторДействия, СтруктураДанныеЭлемента.ДанныеЭлемента.ВидДействия, СтандартнаяОбработка, Объект.Ссылка) Тогда
			СообщитьОНедопустимостиСменыДействия(СтруктураДанныеЭлемента.ИндексСтроки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый вид действия поле обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура Подключаемый_ВидДействия_Поле_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		Если ДействиеЗарегистрировано(СтруктураДанныеЭлемента.ДанныеЭлемента.ИдентификаторДействия, СтруктураДанныеЭлемента.ДанныеЭлемента.ВидДействия, СтандартнаяОбработка, Объект.Ссылка) Тогда
			СообщитьОНедопустимостиСменыДействия(СтруктураДанныеЭлемента.ИндексСтроки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый удалить строку т ч декорация картинка нажатие
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_УдалитьСтроку_ТЧ_Декорация_Картинка_Нажатие(Элемент)
	 
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		Если ЗадаватьВопросПередУдалениемДействий Тогда 
			Если ДействиеЗарегистрировано(СтруктураДанныеЭлемента.ДанныеЭлемента.ИдентификаторДействия, СтруктураДанныеЭлемента.ДанныеЭлемента.ВидДействия, , Объект.Ссылка) Тогда
				ТекстВопроса = НСтр("ru='Данное действие зарегистрировано в ""Журнале событий триггера"". Удаление этого действия в данном триггерном событии не приведет к удалению соответствующих записей в журнале событий. После удаления - регистрация данного действия прекратится.';en='This action is registered in the ""trigger event Log"". Deleting this action in this trigger will not delete the corresponding entries in the event log. After deletion, the registration of this action will stop.'") + Символы.ПС +
								НСтр("ru='Продолжить удаление?';en='Proceed with removal?'");
			Иначе 
				ТекстВопроса = НСтр("ru='Удалить данное действие в триггерном событии?';en='Delete this action in a trigger event?'");
			КонецЕсли;
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОУдаленииСтрокиДействия", ЭтотОбъект, Новый Структура("СтрокаДействия", СтруктураДанныеЭлемента.ДанныеЭлемента));
			СписокЗначенийОтветаНаВопрос = Новый СписокЗначений;
			СписокЗначенийОтветаНаВопрос.Добавить("Удалить", "Да");
			СписокЗначенийОтветаНаВопрос.Добавить("УдалитьИОтключитьВопрос", "Да, больше не спрашивать");
			СписокЗначенийОтветаНаВопрос.Добавить("Отмена", "Отмена");			
			ПоказатьВопрос(Оповещение, ТекстВопроса, СписокЗначенийОтветаНаВопрос, , , НСтр("ru='Вопрос пользователю';en='Question to the user'"));
		Иначе 
			УдалитьДействиеТриггера(СтруктураДанныеЭлемента.ДанныеЭлемента);
		КонецЕсли;
	КонецЕсли;	
			
КонецПроцедуры

&НаКлиенте
// Процедура - После закрытия вопроса о удалении строки действия
//
// Параметры:
//  РезультатОтвета			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПослеЗакрытияВопросаОУдаленииСтрокиДействия(РезультатОтвета, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатОтвета <> Неопределено Тогда 
		Если РезультатОтвета = "Удалить" Тогда 
			УдалитьДействиеТриггера(ДополнительныеПараметры.СтрокаДействия);
		ИначеЕсли РезультатОтвета = "УдалитьИОтключитьВопрос" Тогда
			УдалитьДействиеТриггера(ДополнительныеПараметры.СтрокаДействия, Истина);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый вид исполнителя поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ВидИсполнителя_Поле_ПриИзменении(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамИсполнителей(, СтруктураДанныеЭлемента.ИндексСтроки);
		Если ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.ВидАдресата) Тогда 
			Если СтруктураДанныеЭлемента.ДанныеЭлемента.ВидАдресата = ПредопределенноеЗначение("Перечисление.ВидыАдресатов.Куратор") Тогда 
				ЭлементФормы = Элементы.Найти("ВидИсполнителяРезервный_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
				Если НЕ ЭлементФормы = Неопределено Тогда 			
					ЭтаФорма.ТекущийЭлемент = ЭлементФормы;
				КонецЕсли;
			ИначеЕсли СтруктураДанныеЭлемента.ДанныеЭлемента.ВидАдресата = ПредопределенноеЗначение("Перечисление.ВидыАдресатов.Сотрудник") ИЛИ СтруктураДанныеЭлемента.ДанныеЭлемента.ВидАдресата = ПредопределенноеЗначение("Перечисление.ВидыАдресатов.СегментСотрудников") Тогда
				ЭлементФормы = Элементы.Найти("Исполнитель_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
				Если НЕ ЭлементФормы = Неопределено Тогда 			
					ЭтаФорма.ТекущийЭлемент = ЭлементФормы;		
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
				
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый вид исполнителя резервный поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ВидИсполнителяРезервный_Поле_ПриИзменении(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамИсполнителей(, СтруктураДанныеЭлемента.ИндексСтроки);
		Если ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.ВидАдресатаРезервный) Тогда 
			ЭлементФормы = Элементы.Найти("Исполнитель_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
			Если НЕ ЭлементФормы = Неопределено Тогда 			
				ЭтаФорма.ТекущийЭлемент = ЭлементФормы;		
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый вид получателя поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ВидПолучателя_Поле_ПриИзменении(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамПолучателяСообщения(, СтруктураДанныеЭлемента.ИндексСтроки);
		Если ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.ВидАдресата) Тогда 
			Если СтруктураДанныеЭлемента.ДанныеЭлемента.ВидАдресата = ПредопределенноеЗначение("Перечисление.ВидыАдресатов.Сотрудник") Тогда  
				ЭлементФормы = Элементы.Найти("Получатель_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
				Если НЕ ЭлементФормы = Неопределено Тогда 			
					ЭтаФорма.ТекущийЭлемент = ЭлементФормы;		
				КонецЕсли;
			КонецЕсли;
			Если СтруктураДанныеЭлемента.ДанныеЭлемента.ВидДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение") И СтруктураДанныеЭлемента.ДанныеЭлемента.ВидАдресата <> ПредопределенноеЗначение("Перечисление.ВидыАдресатов.КонтрагентСобытия") Тогда  
				Если СтруктураДанныеЭлемента.ДанныеЭлемента.ОтправкаPush ИЛИ СтруктураДанныеЭлемента.ДанныеЭлемента.ОтправкаPushWallet Тогда 
					Объект.Действия[СтруктураДанныеЭлемента.ИндексСтроки].ОтправкаPush 			= Ложь;
					Объект.Действия[СтруктураДанныеЭлемента.ИндексСтроки].ОтправкаPushWallet 	= Ложь;
					
					ПоказатьОповещениеПользователя(НСтр("ru = 'Push уведомления деактивированы'; en = 'Push notifications deactivated'"),,
					НСтр("ru = 'Push уведомления доступны только тогда, когда в качестве адресата указан контрагент события'; en = 'Push notifications are only available when the event counterparty is specified as the recipient'"),
					БиблиотекаКартинок.Информация32,
					СтатусОповещенияПользователя.Информация);

				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый получатель поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_Получатель_Поле_ПриИзменении(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		Если СтруктураДанныеЭлемента.ДанныеЭлемента.ВидАдресата = ПредопределенноеЗначение("Перечисление.ВидыАдресатов.Сотрудник") И ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.Адресат) И ТипЗнч(СтруктураДанныеЭлемента.ДанныеЭлемента.Адресат) = Тип("СправочникСсылка.Сотрудники") Тогда 
			Если СтруктураДанныеЭлемента.ДанныеЭлемента.ВидДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение") Тогда 
				Если СтруктураДанныеЭлемента.ДанныеЭлемента.ОтправкаPush ИЛИ СтруктураДанныеЭлемента.ДанныеЭлемента.ОтправкаPushWallet ИЛИ СтруктураДанныеЭлемента.ДанныеЭлемента.ОтправкаSMS Тогда 
					Если КонтактныйНомерТелефонаУАдресатаОтсутствует(СтруктураДанныеЭлемента.ДанныеЭлемента.Адресат) Тогда 
						ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru='У адресата %1 отсутствует контактный номер телефона';en='The recipient %1 does not have a contact phone number'"), Строка(СтруктураДанныеЭлемента.ДанныеЭлемента.Адресат)), , "Действия[" + СтруктураДанныеЭлемента.ИндексСтроки + "].Адресат", "Объект");
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли СтруктураДанныеЭлемента.ДанныеЭлемента.ВидДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо") Тогда 
				Если ЭлектронныйАдресУАдресатаОтсутствует(СтруктураДанныеЭлемента.ДанныеЭлемента.Адресат) Тогда 
					ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru='У адресата %1 отсутствует электронный адрес';en='The recipient %1 does not have an email address'"), Строка(СтруктураДанныеЭлемента.ДанныеЭлемента.Адресат)), , "Действия[" + СтруктураДанныеЭлемента.ИндексСтроки + "].Адресат", "Объект");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		//УстановитьСвойстваЭлементамПолучателяСообщения(, СтруктураДанныеЭлемента.ИндексСтроки);
		//Если ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.ВидАдресата) Тогда 
		//	Если СтруктураДанныеЭлемента.ДанныеЭлемента.ВидАдресата = ПредопределенноеЗначение("Перечисление.ВидыАдресатов.Сотрудник") Тогда  
		//		ЭлементФормы = Элементы.Найти("Получатель_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
		//		Если НЕ ЭлементФормы = Неопределено Тогда 			
		//			ЭтаФорма.ТекущийЭлемент = ЭлементФормы;		
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый отправка push поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ОтправкаPush_Поле_ПриИзменении(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамАккаунтаСообщения(, СтруктураДанныеЭлемента.ИндексСтроки);
		ЭлементФормы = Элементы.Найти("ОтправкаPushWallet_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
		Если НЕ ЭлементФормы = Неопределено Тогда 			
			ЭтаФорма.ТекущийЭлемент = ЭлементФормы;		
		КонецЕсли;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый отправка push wallet поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ОтправкаPushWallet_Поле_ПриИзменении(Элемент)

	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамАккаунтаСообщения(, СтруктураДанныеЭлемента.ИндексСтроки);
		ЭлементФормы = Элементы.Найти("ОтправкаMessenger_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
		Если НЕ ЭлементФормы = Неопределено Тогда 			
			ЭтаФорма.ТекущийЭлемент = ЭлементФормы;		
		КонецЕсли;
		ЭтаФорма.Модифицированность = Истина;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый отправка messenger поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ОтправкаMessenger_Поле_ПриИзменении(Элемент)

	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамАккаунтаСообщения(, СтруктураДанныеЭлемента.ИндексСтроки);
		ЭлементФормы = Элементы.Найти("АккаунтСообщенийМессенджера_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
		Если НЕ ЭлементФормы = Неопределено Тогда 			
			ЭтаФорма.ТекущийЭлемент = ЭлементФормы;		
		КонецЕсли;
		ЭтаФорма.Модифицированность = Истина;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый отправка SMS поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ОтправкаSMS_Поле_ПриИзменении(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамАккаунтаСообщения(, СтруктураДанныеЭлемента.ИндексСтроки);
		ЭлементФормы = Элементы.Найти("АккаунтСообщений_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
		Если НЕ ЭлементФормы = Неопределено Тогда 			
			ЭтаФорма.ТекущийЭлемент = ЭлементФормы;		
		КонецЕсли;
		ЭтаФорма.Модифицированность = Истина;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый аккаунт сообщений мессенджера поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_АккаунтСообщенийМессенджера_Поле_ПриИзменении(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамАккаунтаСообщения(, СтруктураДанныеЭлемента.ИндексСтроки);
		Если НЕ СтруктураДанныеЭлемента.СтрокаНастройкиКаналовУведомлений = Неопределено И ЗначениеЗаполнено(СтруктураДанныеЭлемента.СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы) Тогда 
			ТипВнешнейСистемы = Неопределено;
			Для Каждого СтрокаВнешняяСистема Из ТаблицаВнешнихСистем Цикл 
				Если СтрокаВнешняяСистема.Ссылка = СтруктураДанныеЭлемента.СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы Тогда 
					ТипВнешнейСистемы = СтрокаВнешняяСистема.ТипВнешнейСистемы;
					Прервать;
				КонецЕсли;				
			КонецЦикла;	
			Если НЕ ЗначениеЗаполнено(ТипВнешнейСистемы) Тогда 
				ТипВнешнейСистемы = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтруктураДанныеЭлемента.СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы, "ТипВнешнейСистемы");
			КонецЕсли;
			Если ТипВнешнейСистемы = ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.Chat2Desk") Тогда 
				ЭлементФормы = Элементы.Найти("КаналСистемыСообщений_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
				Если НЕ ЭлементФормы = Неопределено Тогда 			
					ЭтаФорма.ТекущийЭлемент = ЭлементФормы;		
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый аккаунт сообщений поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_АккаунтСообщений_Поле_ПриИзменении(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамАккаунтаСообщения(, СтруктураДанныеЭлемента.ИндексСтроки);
		Если НЕ СтруктураДанныеЭлемента.СтрокаНастройкиКаналовУведомлений = Неопределено И ЗначениеЗаполнено(СтруктураДанныеЭлемента.СтрокаНастройкиКаналовУведомлений.АккаунтСервисаРассылкиSMS) Тогда 		
			ЭлементФормы = Элементы.Найти("ОткрытьНастройкиУведомленийSMS_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
			Если НЕ ЭлементФормы = Неопределено Тогда 			
				ЭтаФорма.ТекущийЭлемент = ЭлементФормы;		
			КонецЕсли;
		КонецЕсли;
		ЭтаФорма.Модифицированность = Истина;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый вид сделки поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ВидСделки_Поле_ПриИзменении(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамДействийПоСделкам(, СтруктураДанныеЭлемента.ИндексСтроки);
		Если ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.ВидСделки) Тогда 
			ЭлементФормы = Элементы.Найти("ЭтапСделки_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
			Если НЕ ЭлементФормы = Неопределено Тогда 			
				ЭтаФорма.ТекущийЭлемент = ЭлементФормы;		
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый этап сделки поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ЭтапСделки_Поле_ПриИзменении(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамДействийПоСделкам(, СтруктураДанныеЭлемента.ИндексСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый этап сделки поле начало выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеВыбора		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура Подключаемый_ЭтапСделки_Поле_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элемент.СписокВыбора.Количество() = 0 Тогда
		СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
		Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Для начала укажите вид сделки", , "Объект.Действия[" + Строка(СтруктураДанныеЭлемента.ИндексСтроки) + "].ВидСделки");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый этап сделки поле открытие
//
// Параметры:
//  Элемент				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура Подключаемый_ЭтапСделки_Поле_Открытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый создавать сделку поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_СоздаватьСделку_Поле_ПриИзменении(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамДействийПоСделкам(, СтруктураДанныеЭлемента.ИндексСтроки);
		Если СтруктураДанныеЭлемента.ДанныеЭлемента.СоздаватьСделку Тогда 
			ЭлементФормы = Элементы.Найти("КоличествоГенерацийСделок_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
			Если НЕ ЭлементФормы = Неопределено Тогда 			
				ЭтаФорма.ТекущийЭлемент = ЭлементФормы;		
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый количество генераций сделок поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_КоличествоГенерацийСделок_Поле_ПриИзменении(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамДействийПоСделкам(, СтруктураДанныеЭлемента.ИндексСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый сценарий чат бота поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_СценарийЧатБота_Поле_ПриИзменении(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		УстановитьСвойстваЭлементамДействийПоЧатБотам(, СтруктураДанныеЭлемента.ИндексСтроки);
		//Если ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.ВидСделки) Тогда 
		//	ЭлементФормы = Элементы.Найти("ЭтапСделки_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
		//	Если НЕ ЭлементФормы = Неопределено Тогда 			
		//		ЭтаФорма.ТекущийЭлемент = ЭлементФормы;		
		//	КонецЕсли;
		//КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый шаблон сообщения поле при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ШаблонСообщения_Поле_ПриИзменении(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Элемент, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		Если ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.ШаблонСообщения) Тогда
			ИнформирующееСообщение = "";
			Если ПустоеСодержаниеШаблона(СтруктураДанныеЭлемента.ДанныеЭлемента.ШаблонСообщения, , СтруктураДанныеЭлемента.ДанныеЭлемента.ВидДействия, ИнформирующееСообщение) Тогда 
				// Сообщаем
				Если ЗначениеЗаполнено(ИнформирующееСообщение) Тогда 
					ОбщегоНазначенияКлиент.СообщитьПользователю(ИнформирующееСообщение,
					, "Объект.Действия[" + Формат(СтруктураДанныеЭлемента.ИндексСтроки, "ЧГ=0") + "]." + "ШаблонСообщения");
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		ЭлементФормы = Элементы.Найти("ОткрытьШаблонДействия_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
		Если НЕ ЭлементФормы = Неопределено Тогда
			ЭлементФормы.Видимость 		= ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.ВидДействия) И НЕ (СтруктураДанныеЭлемента.ДанныеЭлемента.ВидДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки") ИЛИ СтруктураДанныеЭлемента.ДанныеЭлемента.ВидДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки"));
			ЭлементФормы.Доступность 	= Объект.Активно И СтруктураДанныеЭлемента.ДанныеЭлемента.Использование И ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.ВидДействия) И ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.ШаблонСообщения);
			ЭлементФормы.Заголовок 		= ?(ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.ШаблонСообщения), НСтр("ru = 'Шаблон'; en = 'Template'"), НСтр("ru = '<Шаблон не указан>'; en = '<Template not specified>'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый открыть шаблон действия выполнить команду
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Подключаемый_ОткрытьШаблонДействия_ВыполнитьКоманду(Команда)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Команда, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		Если ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.ШаблонСообщения) Тогда 
			ОткрытьФорму("Справочник.ШаблоныСообщений.ФормаОбъекта", Новый Структура("Ключ", СтруктураДанныеЭлемента.ДанныеЭлемента.ШаблонСообщения), ЭтаФорма,);
			//ПоказатьЗначение(, СтруктураДанныеЭлемента.ДанныеЭлемента.ШаблонСообщения)
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый открыть настройки уведомлений push выполнить команду
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Подключаемый_ОткрытьНастройкиУведомленийPush_ВыполнитьКоманду(Команда)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Команда, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ТипКанала"									, "Push");
		ПараметрыФормы.Вставить("ТекущаяСтруктурнаяЕдиница"					, ТекущаяСтруктурнаяЕдиница);
		Если НЕ СтруктураДанныеЭлемента.СтрокаНастройкиКаналовУведомлений = Неопределено Тогда 
			ПараметрыФормы.Вставить("ИдентификаторДействия"					, СтруктураДанныеЭлемента.СтрокаНастройкиКаналовУведомлений.ИдентификаторДействия);
		Иначе 
			ПараметрыФормы.Вставить("ИдентификаторДействия"					, СтруктураДанныеЭлемента.ДанныеЭлемента.ИдентификаторДействия);
		КонецЕсли;
		ПараметрыФормы.Вставить("ПараметрыДействия"							, СтрокуТаблицыЗначенийВСтруктуру(СтруктураДанныеЭлемента.ДанныеЭлемента, ИменаКолонокТаблицыДействий()));		
		ПараметрыФормы.Вставить("МоделируемыеНастройкиКаналовУведомлений"	, ТаблицуЗначенийВМассивСтруктур(МоделируемыеНастройкиКаналовУведомлений, ИменаКолонокМоделируемойТаблицы()));
		ПараметрыФормы.Вставить("ТаблицаВнешнихСистем"						, ТаблицуЗначенийВМассивСтруктур(ТаблицаВнешнихСистем, ИменаКолонокТаблицыВнешнихСистем()));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("РезультатНастройкиКаналовУведомлений", ЭтаФорма);
		ОткрытьФорму("Справочник.ТриггерныеСобытия.Форма.ФормаНастроекКаналовУведомлений", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, 
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый открыть настройки уведомлений push wallet выполнить команду
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Подключаемый_ОткрытьНастройкиУведомленийPushWallet_ВыполнитьКоманду(Команда)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Команда, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ТипКанала"									, "PushWallet");
		ПараметрыФормы.Вставить("ТекущаяСтруктурнаяЕдиница"					, ТекущаяСтруктурнаяЕдиница);		
		Если НЕ СтруктураДанныеЭлемента.СтрокаНастройкиКаналовУведомлений = Неопределено Тогда 
			ПараметрыФормы.Вставить("ИдентификаторДействия"					, СтруктураДанныеЭлемента.СтрокаНастройкиКаналовУведомлений.ИдентификаторДействия);
		Иначе 
			ПараметрыФормы.Вставить("ИдентификаторДействия"					, СтруктураДанныеЭлемента.ДанныеЭлемента.ИдентификаторДействия);
		КонецЕсли;
		ПараметрыФормы.Вставить("ПараметрыДействия"							, СтрокуТаблицыЗначенийВСтруктуру(СтруктураДанныеЭлемента.ДанныеЭлемента, ИменаКолонокТаблицыДействий()));		
		ПараметрыФормы.Вставить("МоделируемыеНастройкиКаналовУведомлений"	, ТаблицуЗначенийВМассивСтруктур(МоделируемыеНастройкиКаналовУведомлений, ИменаКолонокМоделируемойТаблицы()));
		ПараметрыФормы.Вставить("ТаблицаВнешнихСистем"						, ТаблицуЗначенийВМассивСтруктур(ТаблицаВнешнихСистем, ИменаКолонокТаблицыВнешнихСистем()));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("РезультатНастройкиКаналовУведомлений", ЭтаФорма);
		ОткрытьФорму("Справочник.ТриггерныеСобытия.Форма.ФормаНастроекКаналовУведомлений", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, 
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый открыть настройки уведомлений messenger выполнить команду
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Подключаемый_ОткрытьНастройкиУведомленийMessenger_ВыполнитьКоманду(Команда)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Команда, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ТипКанала"									, "Messenger");
		ПараметрыФормы.Вставить("ТекущаяСтруктурнаяЕдиница"					, ТекущаяСтруктурнаяЕдиница);		
		Если НЕ СтруктураДанныеЭлемента.СтрокаНастройкиКаналовУведомлений = Неопределено Тогда 
			ПараметрыФормы.Вставить("ИдентификаторДействия"					, СтруктураДанныеЭлемента.СтрокаНастройкиКаналовУведомлений.ИдентификаторДействия);
		Иначе 
			ПараметрыФормы.Вставить("ИдентификаторДействия"					, СтруктураДанныеЭлемента.ДанныеЭлемента.ИдентификаторДействия);
		КонецЕсли;
		ПараметрыФормы.Вставить("ПараметрыДействия"							, СтрокуТаблицыЗначенийВСтруктуру(СтруктураДанныеЭлемента.ДанныеЭлемента, ИменаКолонокТаблицыДействий()));
		ПараметрыФормы.Вставить("МоделируемыеНастройкиКаналовУведомлений"	, ТаблицуЗначенийВМассивСтруктур(МоделируемыеНастройкиКаналовУведомлений, ИменаКолонокМоделируемойТаблицы()));
		ПараметрыФормы.Вставить("ТаблицаВнешнихСистем"						, ТаблицуЗначенийВМассивСтруктур(ТаблицаВнешнихСистем, ИменаКолонокТаблицыВнешнихСистем()));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("РезультатНастройкиКаналовУведомлений", ЭтаФорма);
		ОткрытьФорму("Справочник.ТриггерныеСобытия.Форма.ФормаНастроекКаналовУведомлений", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, 
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый открыть настройки уведомлений SMS выполнить команду
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Подключаемый_ОткрытьНастройкиУведомленийSMS_ВыполнитьКоманду(Команда)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Команда, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ТипКанала"									, "SMS");
		ПараметрыФормы.Вставить("ТекущаяСтруктурнаяЕдиница"					, ТекущаяСтруктурнаяЕдиница);		
		Если НЕ СтруктураДанныеЭлемента.СтрокаНастройкиКаналовУведомлений = Неопределено Тогда 
			ПараметрыФормы.Вставить("ИдентификаторДействия"					, СтруктураДанныеЭлемента.СтрокаНастройкиКаналовУведомлений.ИдентификаторДействия);
		Иначе 
			ПараметрыФормы.Вставить("ИдентификаторДействия"					, СтруктураДанныеЭлемента.ДанныеЭлемента.ИдентификаторДействия);
		КонецЕсли;
		ПараметрыФормы.Вставить("ПараметрыДействия"							, СтрокуТаблицыЗначенийВСтруктуру(СтруктураДанныеЭлемента.ДанныеЭлемента, ИменаКолонокТаблицыДействий()));		
		ПараметрыФормы.Вставить("МоделируемыеНастройкиКаналовУведомлений"	, ТаблицуЗначенийВМассивСтруктур(МоделируемыеНастройкиКаналовУведомлений, ИменаКолонокМоделируемойТаблицы()));
		ПараметрыФормы.Вставить("ТаблицаВнешнихСистем"						, ТаблицуЗначенийВМассивСтруктур(ТаблицаВнешнихСистем, ИменаКолонокТаблицыВнешнихСистем()));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("РезультатНастройкиКаналовУведомлений", ЭтаФорма);
		ОткрытьФорму("Справочник.ТриггерныеСобытия.Форма.ФормаНастроекКаналовУведомлений", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, 
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый взаимодействие режим напоминания выполнить команду
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Подключаемый_ВзаимодействиеРежимНапоминания_ВыполнитьКоманду(Команда)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Команда, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		ЭлементФормы = Элементы.Найти("ВзаимодействиеРежимНапоминания_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
		Если НЕ ЭлементФормы = Неопределено Тогда
			Для Каждого ЭлементСписка Из ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора Цикл 
				Если Объект.Действия[СтруктураДанныеЭлемента.ИндексСтроки].ЗадачаРежимНапоминания = ЭлементСписка.Значение Тогда 
					ЭлементСписка.Картинка = БиблиотекаКартинок.Будильник24;
					ЭлементСписка.Пометка = Истина
				Иначе 
					ЭлементСписка.Картинка = БиблиотекаКартинок.Пустая;
					ЭлементСписка.Пометка = Ложь;
				КонецЕсли;	
			КонецЦикла;	
			Оповещение = Новый ОписаниеОповещения("ВыборРежимаНапоминанияЗавершение", ЭтотОбъект, Новый Структура("ИндексСтроки, ЭлементКнопка", СтруктураДанныеЭлемента.ИндексСтроки, ЭлементФормы));
			ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора, ЭлементФормы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый применить параметры действия выполнить команду
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Подключаемый_ПрименитьПараметрыДействия_ВыполнитьКоманду(Команда)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(ЭтотОбъект, Команда, ТекущаяСтруктурнаяЕдиница);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		ЭлементФормы = Элементы.Найти("ВсплывающаяГруппаПараметровДействия_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
		Если НЕ ЭлементФормы = Неопределено Тогда
			Если НЕ ЭлементФормы.Скрыта() Тогда 
				ЭлементФормы.Скрыть();
			КонецЕсли;	
		КонецЕсли;
		ЭлементФормы = Элементы.Найти("ВидДействия_Индекс_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки + 1));
		Если НЕ ЭлементФормы = Неопределено Тогда
			ЭтаФорма.ТекущийЭлемент = ЭлементФормы;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Подключаемый шаблон начало выбора
//
// Параметры:
//  Элемент	 - 	 - 
// 
Процедура Получатель_Шаблон_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	НомерСимвола = СтрНайти(Элемент.Имя, "с_") + 1; 
	ИндексСтроки = ?(НомерСимвола > 0, Число(Прав(Элемент.Имя, СтрДлина(Элемент.Имя) - НомерСимвола)), Неопределено);
	Если Объект.Действия[ИндексСтроки].ВидАдресата = ПредопределенноеЗначение("Перечисление.ВидыАдресатов.Сотрудник") Тогда	
		СтандартнаяОбработка = Ложь; 
		ОписаниеОповещения = Новый ОписаниеОповещения("Получатель_Шаблон_НачалоВыбораЗавершение", ЭтаФорма, Новый Структура("Индекс, Элемент, ЭлементИмя", ИндексСтроки, Элемент, Элемент.Имя));
		ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", Новый Структура("БезОтбораПоРолям", Истина),,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ___________________________________ОБРАБОТКА_ОПОВЕЩЕНИЯ_____________________________________

&НаКлиенте
// Процедура - Выбор взаимодействия завершение
//
Процедура ВыборРежимаНапоминанияЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.Действия[ДополнительныеПараметры.ИндексСтроки].ЗадачаРежимНапоминания = Результат.Значение;
		Если Результат.Значение > -1 Тогда 
			ДополнительныеПараметры.ЭлементКнопка.Заголовок = Нстр("ru = 'Напомнить '; en = 'Remind me '") + Результат.Представление;
			ДополнительныеПараметры.ЭлементКнопка.Картинка 	= БиблиотекаКартинок.Напомнить;			
		Иначе 	
			ДополнительныеПараметры.ЭлементКнопка.Заголовок = Нстр("ru = 'Не напоминать'; en = 'Don''t remind me'");
			ДополнительныеПараметры.ЭлементКнопка.Картинка 	= БиблиотекаКартинок.НапоминаниеОтключить;			
		КонецЕсли;
		ЭлементФормы = Элементы.Найти("ПрименитьПараметрыДействия_Индекс_" + Строка(ДополнительныеПараметры.ИндексСтроки));
		Если НЕ ЭлементФормы = Неопределено Тогда
			ЭтаФорма.ТекущийЭлемент = ЭлементФормы;
		КонецЕсли;			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Результат настройки каналов уведомлений
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура РезультатНастройкиКаналовУведомлений(Результат, ДополнительныеПараметры = Неопределено)  Экспорт
	
	СтруктураНастроекКаналовУведомлений = Результат;
	Если СтруктураНастроекКаналовУведомлений = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ЕстьИзменения = Ложь;
	ОбновитьНастройкиКаналовУведомлений(СтруктураНастроекКаналовУведомлений, ЕстьИзменения);
	Если ЕстьИзменения Тогда 
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
// Процедура - Обновить настройки каналов уведомлений
//
// Параметры:
//  СтруктураНастроекКаналовУведомлений	 - 	 - 
//  ЕстьИзменения						 - 	 - 
//
Процедура ОбновитьНастройкиКаналовУведомлений(СтруктураНастроекКаналовУведомлений, ЕстьИзменения)

	ОбновленнаяТаблицаНастроекКаналов = ПреобразоватьМассивСтруктурВТаблицуЗначений(СтруктураНастроекКаналовУведомлений.МоделируемыеНастройкиКаналовУведомлений);
	
	МВТ 	= Новый МенеджерВременныхТаблиц;
	Запрос 	= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("ОбновленнаяТаблицаНастроекКаналов"						, ОбновленнаяТаблицаНастроекКаналов.Скопировать(, "ИдентификаторДействия, СтруктурнаяЕдиница, ОтправкаPush, ОтправкаPushWallet, ОтправкаMessenger, ОтправкаSMS, АккаунтВнешнейСистемы, АккаунтСервисаРассылкиSMS, КаналСистемыСообщений"));
	Запрос.УстановитьПараметр("ТаблицаЗначенийКешированныхНастроекКаналовУведомлений"	, МоделируемыеНастройкиКаналовУведомлений.Выгрузить(, "ИдентификаторДействия, СтруктурнаяЕдиница, ОтправкаPush, ОтправкаPushWallet, ОтправкаMessenger, ОтправкаSMS, АккаунтВнешнейСистемы, АккаунтСервисаРассылкиSMS, КаналСистемыСообщений"));			
	Запрос.Текст = 
	"ВЫБРАТЬ ОбновленнаяТаблицаНастроекКаналов.*
	|ПОМЕСТИТЬ НовыеНастройкиКаналовУведомлений
	|ИЗ &ОбновленнаяТаблицаНастроекКаналов КАК ОбновленнаяТаблицаНастроекКаналов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ТаблицаЗначенийКешированныхНастроекКаналовУведомлений.*
	|ПОМЕСТИТЬ КешированныеНастройкиКаналовУведомлений
	|ИЗ &ТаблицаЗначенийКешированныхНастроекКаналовУведомлений КАК ТаблицаЗначенийКешированныхНастроекКаналовУведомлений";	
	Запрос.Выполнить();
	
	Запрос 			= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст 	= 
	"ВЫБРАТЬ
	|	ТекущиеКешированныеНастройкиКаналовУведомлений.ИдентификаторДействия КАК ИдентификаторДействия
	|ИЗ
	|	НовыеНастройкиКаналовУведомлений КАК НовыеНастройкиКаналовУведомлений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КешированныеНастройкиКаналовУведомлений КАК ТекущиеКешированныеНастройкиКаналовУведомлений
	|		ПО НовыеНастройкиКаналовУведомлений.ИдентификаторДействия = ТекущиеКешированныеНастройкиКаналовУведомлений.ИдентификаторДействия
	|			И НовыеНастройкиКаналовУведомлений.СтруктурнаяЕдиница = ТекущиеКешированныеНастройкиКаналовУведомлений.СтруктурнаяЕдиница
	|			И (НовыеНастройкиКаналовУведомлений.ОтправкаPush <> ТекущиеКешированныеНастройкиКаналовУведомлений.ОтправкаPush
	|				ИЛИ НовыеНастройкиКаналовУведомлений.ОтправкаPushWallet <> ТекущиеКешированныеНастройкиКаналовУведомлений.ОтправкаPushWallet
	|				ИЛИ НовыеНастройкиКаналовУведомлений.ОтправкаMessenger <> ТекущиеКешированныеНастройкиКаналовУведомлений.ОтправкаMessenger
	|				ИЛИ НовыеНастройкиКаналовУведомлений.ОтправкаSMS <> ТекущиеКешированныеНастройкиКаналовУведомлений.ОтправкаSMS
	|				ИЛИ НовыеНастройкиКаналовУведомлений.АккаунтВнешнейСистемы <> ТекущиеКешированныеНастройкиКаналовУведомлений.АккаунтВнешнейСистемы
	|				ИЛИ НовыеНастройкиКаналовУведомлений.АккаунтСервисаРассылкиSMS <> ТекущиеКешированныеНастройкиКаналовУведомлений.АккаунтСервисаРассылкиSMS
	|				ИЛИ (ВЫРАЗИТЬ(НовыеНастройкиКаналовУведомлений.КаналСистемыСообщений КАК СТРОКА(32))) <> (ВЫРАЗИТЬ(ТекущиеКешированныеНастройкиКаналовУведомлений.КаналСистемыСообщений КАК СТРОКА(32))))";		
	
	ЕстьИзменения = НЕ Запрос.Выполнить().Пустой();
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	МоделируемыеНастройкиКаналовУведомлений.Загрузить(ОбновленнаяТаблицаНастроекКаналов);
	
	Если ЕстьИзменения Тогда 
		МассивСтрок = Объект.Действия.НайтиСтроки(Новый Структура("ИдентификаторДействия", СтруктураНастроекКаналовУведомлений.ИдентификаторДействия));
		Если НЕ МассивСтрок.Количество() = 0 Тогда 
			УстановитьСвойстваЭлементамАккаунтаСообщения(, Объект.Действия.Индекс(МассивСтрок[0]));
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, Обработчик события "Получатель_Шаблон_НачалоВыбораЗавершение" 
//
Процедура Получатель_Шаблон_НачалоВыбораЗавершение(Результат, Параметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	Объект.Действия[Параметры.Индекс].Адресат = Результат; 
	Если СтрНайти(Параметры.ЭлементИмя, "Получатель_") > 0 Тогда 
		Подключаемый_Получатель_Поле_ПриИзменении(Параметры.Элемент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ______________________________СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ_________________________________

&НаСервере
// Процедура - Инициировать раздел события
//
Процедура ИнициироватьРазделСобытия()
	
	Справочники.ТриггерныеСобытия.ИнициализироватьВиртуальнуюГруппуСобытий(ВиртуальнаяГруппаСобытий, Объект.УсловиеСобытия, Элементы.ВиртуальнаяГруппаСобытий);
	
КонецПроцедуры

&НаСервере
// Процедура - Сформировать таблицу действий
//
Процедура СформироватьТаблицуДействий(ИндексСтроки = Неопределено, СозданиеФормы = Ложь, ДобавитьЭлементВвода = Ложь, ОтключитьВопрос = Ложь)
	
	Если ОтключитьВопрос Тогда 
		РегистрыСведений.НастройкиИнтерфейсов.ЗаписатьЗначениеНастройкиПользователя("Триггеры_ЗадаватьВопросПриУдаленииДействий", Ложь);
		ЗадаватьВопросПередУдалениемДействий = Ложь;
	КонецЕсли;
	Если НЕ ИндексСтроки = Неопределено Тогда 
		Справочники.ТриггерныеСобытия.СформироватьОписаниеДействия(Объект.Действия[ИндексСтроки]);
	КонецЕсли;	
	ТриггерныеСобытия.ОбновитьОтображениеТаблицыДействий(ЭтотОбъект, СозданиеФормы, ДобавитьЭлементВвода);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Удалить действие триггера
//
// Параметры:
//  СтрокаДействия	 - 	 - 
//  ОтключитьВопрос	 - 	 - 
//
Процедура УдалитьДействиеТриггера(СтрокаДействия, ОтключитьВопрос = Ложь)
	
	Если Объект.Ссылка.Пустая() Тогда 
		Объект.Действия.Удалить(СтрокаДействия);
	Иначе 	
		СтрокаДействия.Удалено = Истина;
	КонецЕсли;	
	СформироватьТаблицуДействий(, , , ОтключитьВопрос);
	Если ОтключитьВопрос Тогда 
		Оповестить("ОТКЛЮЧЕН_ВОПРОС_ПОЛЬЗОВАТЕЛЮ_ОБ_УДАЛЕНИИ_ДЕЙСТВИЯ")
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить список выбора времени
//
Процедура ЗаполнитьСписокВыбораВремени()
	
	ПериодРаботы               = Новый Структура("ДатаНачала, ДатаОкончания");
	ПериодРаботы.ДатаНачала    = Дата(0001,01,01,00,00,00);
	ПериодРаботы.ДатаОкончания = Дата(0001,01,02,00,00,00);
	
	МассивПериодов = Новый Массив;
	МассивПериодов.Добавить(ПериодРаботы);
	
	СписокВремени = РаботаСДиалогами.ВернутьСписокВремениДляНачалаРаботыСервер(МассивПериодов, Ложь, 30);
	
	Элементы.ВремяСобытия.СписокВыбора.Очистить();
	
	Для Каждого Элемент Из СписокВремени Цикл
		Элементы.ВремяСобытия.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить список триггеров
//
// Параметры:
//  УстановитьСвойстваЭлементамФормы - 	 - 
//
Процедура ЗаполнитьСписокТриггеров(УстановитьСвойстваЭлементамФормы = Ложь, ИнициализироватьТаблицу = Ложь, УстановитьАктивнымСледующийЭлемент = Ложь)
	
	Справочники.ТриггерныеСобытия.ИнициализироватьСписокТриггеров(Элементы.УсловиеСобытия.СписокВыбора, ВиртуальнаяГруппаСобытий, Объект.УсловиеСобытия, ТаблицаАктуализацииТриггеров, ИнициализироватьТаблицу);
		
	Если ЗначениеЗаполнено(Объект.УсловиеСобытия) Тогда 
		ЭлементСписка = Элементы.УсловиеСобытия.СписокВыбора.НайтиПоЗначению(Объект.УсловиеСобытия);
		Если ЭлементСписка = Неопределено Тогда 
			//Элементы.УсловиеСобытия.СписокВыбора.Добавить(Объект.УсловиеСобытия, , Истина);
			Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
		КонецЕсли;	
	КонецЕсли;
	
	//Элементы.УсловиеСобытия.СписокВыбора.СортироватьПоЗначению();
	
	Если УстановитьСвойстваЭлементамФормы = Истина Тогда 
		УстановитьСвойстваЭлементамФормы();
	КонецЕсли;
	
	Если УстановитьАктивнымСледующийЭлемент Тогда 
		ЭтаФорма.ТекущийЭлемент = Элементы.УсловиеСобытия;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить список моментов активации
//
// Параметры:
//  УстановитьСвойстваЭлементамФормы - 	 - 
//  ПерезаполнитьСписокТриггеров	 - 	 - 
//
Процедура ЗаполнитьСписокМоментовАктивации(УстановитьСвойстваЭлементамФормы = Ложь
										, ПерезаполнитьСписокТриггеров = Ложь
										, ПерезаполнитьСписокТиповАктивацииЧленств = Ложь
										, ПерезаполнитьСписокСтруктурныхЕдиниц = Ложь
										, ПерезаполнитьСписокВидовПериодаСобытий = Ложь
										, ПерезаполнитьСписокВидовСделок = Ложь
										, ПерезаполнитьСписокВидовЛицевыхСчетов = Ложь
										, ПерезаполнитьСписокВидовБонусныхСчетов = Ложь
										, ПерезаполнитьСписокВариантовДействий = Ложь
										, ПерезаполнитьСписокСтатусовЗаписей = Ложь
										, ПерезаполнитьТиповСтраховыхПолисов = Ложь)
	
	Справочники.ТриггерныеСобытия.ИнициализироватьСписокМоментовАктивации(Элементы.МоментСобытия.СписокВыбора, Объект.УсловиеСобытия, Объект.МоментСобытия);
		
	Если ЗначениеЗаполнено(Объект.МоментСобытия) Тогда 
		ЭлементСписка = Элементы.МоментСобытия.СписокВыбора.НайтиПоЗначению(Объект.МоментСобытия); 
		Если ЭлементСписка = Неопределено Тогда 
			Объект.МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПустаяСсылка();		
		КонецЕсли;	
	КонецЕсли;
	
	Если ПерезаполнитьСписокТриггеров = Истина Тогда 
		ЗаполнитьСписокТриггеров();
	КонецЕсли;
	
	Если ПерезаполнитьСписокСтруктурныхЕдиниц = Истина Тогда 
		ЗаполнитьСписокСтруктурныхЕдиниц();
	КонецЕсли;
	
	Если ПерезаполнитьСписокВидовПериодаСобытий = Истина Тогда 
		ЗаполнитьСписокВидовПериодаСобытий();
	КонецЕсли;
	
	Если ПерезаполнитьСписокВидовСделок = Истина Тогда 
		ЗаполнитьСписокВидовСделок();
	КонецЕсли;
	
	Если ПерезаполнитьСписокВидовЛицевыхСчетов = Истина Тогда 
		ЗаполнитьСписокВидовЛицевыхСчетов();
	КонецЕсли;
	
	Если ПерезаполнитьСписокВидовБонусныхСчетов = Истина Тогда 
		ЗаполнитьСписокВидовБонусныхСчетов();
	КонецЕсли;
	
	Если ПерезаполнитьСписокСтатусовЗаписей = Истина Тогда 
		ЗаполнитьСписокСтатусовПредварительнойЗаписи();
	КонецЕсли;

	Если ПерезаполнитьТиповСтраховыхПолисов = Истина Тогда 	
		ЗаполнитьСписокТиповСтраховыхПолисов();                
	КонецЕсли;
	
	Если УстановитьСвойстваЭлементамФормы = Истина Тогда 
		УстановитьСвойстваЭлементамФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить список видов периода событий
//
// Параметры:
//  УстановитьСвойстваЭлементамФормы - 	 - 
//
Процедура ЗаполнитьСписокВидовПериодаСобытий(УстановитьСвойстваЭлементамФормы = Ложь)
	
	Справочники.ТриггерныеСобытия.ИнициализироватьСписокВидовПериодаСобытий(Элементы.ПериодСобытияВид.СписокВыбора, Объект.УсловиеСобытия, Объект.ПериодСобытияВид, Объект.ПериодСобытия);
	
	Если ЗначениеЗаполнено(Объект.ПериодСобытияВид) Тогда 
		ЭлементСписка = Элементы.ПериодСобытияВид.СписокВыбора.НайтиПоЗначению(Объект.ПериодСобытияВид); 
		Если ЭлементСписка = Неопределено Тогда 
			Объект.ПериодСобытияВид = Перечисления.Периодичность.ПустаяСсылка();		
		КонецЕсли;
	Иначе 
		ЭлементСписка = Элементы.ПериодСобытияВид.СписокВыбора.НайтиПоЗначению(Перечисления.Периодичность.День); 
		Если ЭлементСписка <> Неопределено Тогда 
			Объект.ПериодСобытияВид = Перечисления.Периодичность.День;		
		КонецЕсли;
	КонецЕсли;
	
	Если УстановитьСвойстваЭлементамФормы = Истина Тогда 
		УстановитьСвойстваЭлементамФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить список структурных единиц
//
Процедура ЗаполнитьСписокСтруктурныхЕдиниц()

	Справочники.ТриггерныеСобытия.ИнициализироватьСписокСтруктурныхЕдиниц(Элементы.СтруктурнаяЕдиница.СписокВыбора, Объект.УсловиеСобытия, Объект.СтруктурнаяЕдиница);
	
	Если ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда 
		ЭлементСписка = Элементы.СтруктурнаяЕдиница.СписокВыбора.НайтиПоЗначению(Объект.СтруктурнаяЕдиница); 
		Если ЭлементСписка = Неопределено Тогда 
			Объект.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();		
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить список видов сделок
//
// Параметры:
//  УстановитьСвойстваЭлементамФормы - 	 - 
//
Процедура ЗаполнитьСписокВидовСделок(УстановитьСвойстваЭлементамФормы = Ложь)
	
	Справочники.ТриггерныеСобытия.ИнициализироватьСписокВидовСделок(Элементы.ВидСделки.СписокВыбора, Объект.УсловиеСобытия, Объект.ВидСделки);
	
	Если ЗначениеЗаполнено(Объект.ВидСделки) Тогда 
		ЭлементСписка = Элементы.ВидСделки.СписокВыбора.НайтиПоЗначению(Объект.ВидСделки); 
		Если ЭлементСписка = Неопределено Тогда 
			Объект.ВидСделки = Справочники.ВидыСделок.ПустаяСсылка();		
		КонецЕсли;	
	КонецЕсли;
	
	Если УстановитьСвойстваЭлементамФормы = Истина Тогда 
		УстановитьСвойстваЭлементамФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить список видов лицевых счетов
//
// Параметры:
//  УстановитьСвойстваЭлементамФормы - 	 - 
//
Процедура ЗаполнитьСписокВидовЛицевыхСчетов(УстановитьСвойстваЭлементамФормы = Ложь)
	
	Справочники.ТриггерныеСобытия.ИнициализироватьСписокВидовЛицевыхСчетов(Элементы.ВидЛицевогоСчета.СписокВыбора, Объект.УсловиеСобытия, Объект.ВидЛицевогоСчета);
	
	Если ЗначениеЗаполнено(Объект.ВидЛицевогоСчета) Тогда 
		ЭлементСписка = Элементы.ВидЛицевогоСчета.СписокВыбора.НайтиПоЗначению(Объект.ВидЛицевогоСчета); 
		Если ЭлементСписка = Неопределено Тогда 
			Объект.ВидЛицевогоСчета = Справочники.ВидыЛицевыхСчетов.ПустаяСсылка();		
		КонецЕсли;	
	КонецЕсли;
	
	Если УстановитьСвойстваЭлементамФормы = Истина Тогда 
		УстановитьСвойстваЭлементамФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить список видов бонусных счетов
//
// Параметры:
//  УстановитьСвойстваЭлементамФормы - 	 - 
//
Процедура ЗаполнитьСписокВидовБонусныхСчетов(УстановитьСвойстваЭлементамФормы = Ложь)
	
	Справочники.ТриггерныеСобытия.ИнициализироватьСписокВидовБонусныхСчетовСчетов(Элементы.ВидБонусногоСчета.СписокВыбора, Объект.УсловиеСобытия, Объект.ВидБонусногоСчета);
	
	Если ЗначениеЗаполнено(Объект.ВидБонусногоСчета) Тогда 
		ЭлементСписка = Элементы.ВидБонусногоСчета.СписокВыбора.НайтиПоЗначению(Объект.ВидБонусногоСчета); 
		Если ЭлементСписка = Неопределено Тогда 
			Объект.ВидБонусногоСчета = Справочники.ВидыБонусныхСчетов.ПустаяСсылка();		
		КонецЕсли;	
	КонецЕсли;
	
	Если УстановитьСвойстваЭлементамФормы = Истина Тогда 
		УстановитьСвойстваЭлементамФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить список статусов предварительной записи
//
// Параметры:
//  УстановитьСвойстваЭлементамФормы - 	 - 
//
Процедура ЗаполнитьСписокСтатусовПредварительнойЗаписи(УстановитьСвойстваЭлементамФормы = Ложь)
	
	Элементы.СтатусЗаписи.СписокВыбора.Очистить();
	МетаданныеЗначенийПеречисления = Метаданные.Перечисления.СтатусыСобытия.ЗначенияПеречисления;
	Если Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаСотрудникомКлиники ИЛИ Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаПациентом Тогда 
		Элементы.СтатусЗаписи.СписокВыбора.Добавить(Перечисления.СтатусыСобытия.ПустаяСсылка(), "На любой статус", Объект.СтатусЗаписи = Перечисления.СтатусыСобытия.ПустаяСсылка());	
	ИначеЕсли Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема Тогда 
		Элементы.СтатусЗаписи.СписокВыбора.Добавить(Перечисления.СтатусыСобытия.ПустаяСсылка(), "Для записей с любым статусом (кроме статуса ""Прием отменен"")", Объект.СтатусЗаписи = Перечисления.СтатусыСобытия.ПустаяСсылка());	
	КонецЕсли;	
	Для Каждого МетаданныеЗначенияПеречисления Из МетаданныеЗначенийПеречисления Цикл
		Если Перечисления.СтатусыСобытия[МетаданныеЗначенияПеречисления.Имя] = Перечисления.СтатусыСобытия.ПриемНеСостоялся Тогда 
			Продолжить;
		КонецЕсли;
		Если Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаСотрудникомКлиники ИЛИ Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаПациентом Тогда 		
			Элементы.СтатусЗаписи.СписокВыбора.Добавить(Перечисления.СтатусыСобытия[МетаданныеЗначенияПеречисления.Имя], "На статус """ + СокрЛП(Строка(Перечисления.СтатусыСобытия[МетаданныеЗначенияПеречисления.Имя])) + """", Объект.СтатусЗаписи = Перечисления.СтатусыСобытия[МетаданныеЗначенияПеречисления.Имя]);
		ИначеЕсли Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема Тогда 
			Элементы.СтатусЗаписи.СписокВыбора.Добавить(Перечисления.СтатусыСобытия[МетаданныеЗначенияПеречисления.Имя], "Для записей со статусом """ + СокрЛП(Строка(Перечисления.СтатусыСобытия[МетаданныеЗначенияПеречисления.Имя])) + """", Объект.СтатусЗаписи = Перечисления.СтатусыСобытия[МетаданныеЗначенияПеречисления.Имя]);	
		КонецЕсли;	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Объект.СтатусЗаписи) Тогда 
		ЭлементСписка = Элементы.СтатусЗаписи.СписокВыбора.НайтиПоЗначению(Объект.СтатусЗаписи); 
		Если ЭлементСписка = Неопределено Тогда 
			Объект.СтатусЗаписи = Перечисления.СтатусыСобытия.ПустаяСсылка();		
		КонецЕсли;	
	КонецЕсли;
	
	Если УстановитьСвойстваЭлементамФормы = Истина Тогда 
		УстановитьСвойстваЭлементамФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить список типов страховых полисов
//
// Параметры:
//  УстановитьСвойстваЭлементамФормы - 	 - 
//
Процедура ЗаполнитьСписокТиповСтраховыхПолисов(УстановитьСвойстваЭлементамФормы = Ложь)
	
	Элементы.ТипПолиса.СписокВыбора.Очистить();
	МетаданныеЗначенийПеречисления = Метаданные.Перечисления.ТипыПолиса.ЗначенияПеречисления;
	Если Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентОкончаниеСрокаДействияСтраховогоПолиса Тогда 
		Элементы.ТипПолиса.СписокВыбора.Добавить(Перечисления.ТипыПолиса.ПустаяСсылка(), "Для любого типа полиса", Объект.ТипПолиса = Перечисления.ТипыПолиса.ПустаяСсылка());	
	//ИначеЕсли Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема Тогда 
	//	Элементы.ТипПолиса.СписокВыбора.Добавить(Перечисления.ТипыПолиса.ПустаяСсылка(), "Для записей с любым статусом", Объект.ТипПолиса = Перечисления.ТипыПолиса.ПустаяСсылка());	
	КонецЕсли;	
	Для Каждого МетаданныеЗначенияПеречисления Из МетаданныеЗначенийПеречисления Цикл
		Если Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентОкончаниеСрокаДействияСтраховогоПолиса Тогда 		
			Элементы.ТипПолиса.СписокВыбора.Добавить(Перечисления.ТипыПолиса[МетаданныеЗначенияПеречисления.Имя], СокрЛП(Строка(Перечисления.ТипыПолиса[МетаданныеЗначенияПеречисления.Имя])), Объект.ТипПолиса = Перечисления.ТипыПолиса[МетаданныеЗначенияПеречисления.Имя]);
		//ИначеЕсли Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема Тогда 
		//	Элементы.ТипПолиса.СписокВыбора.Добавить(Перечисления.ТипыПолиса[МетаданныеЗначенияПеречисления.Имя], "Для записей со статусом """ + СокрЛП(Строка(Перечисления.ТипыПолиса[МетаданныеЗначенияПеречисления.Имя])) + """", Объект.ТипПолиса = Перечисления.ТипыПолиса[МетаданныеЗначенияПеречисления.Имя]);	
		КонецЕсли;	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Объект.ТипПолиса) Тогда 
		ЭлементСписка = Элементы.ТипПолиса.СписокВыбора.НайтиПоЗначению(Объект.ТипПолиса); 
		Если ЭлементСписка = Неопределено Тогда 
			Объект.ТипПолиса = Перечисления.ТипыПолиса.ПустаяСсылка();		
		КонецЕсли;	
	КонецЕсли;
	
	Если УстановитьСвойстваЭлементамФормы = Истина Тогда 
		УстановитьСвойстваЭлементамФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Заполнить список выбора режима напоминания
//
Процедура ЗаполнитьСписокВыбораРежимаНапоминания()
	
	ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Очистить();
	ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(-1	 , Нстр("ru = 'не напоминать'; en = 'do not remind'"));
	ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(0     , Нстр("ru = 'в момент события'; en = 'at the time of the event'"));
	ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(300   , Нстр("ru = 'за 5 минут'; en = '5 minutes before'"));
    ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(600   , Нстр("ru = 'за 10 минут'; en = '10 minutes before'"));
	ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(900   , Нстр("ru = 'за 15 минут'; en = '15 minutes before'"));
	ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(1800  , Нстр("ru = 'за 30 минут'; en = '30 minutes before'"));     
	ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(3600  , Нстр("ru = 'за 1 час'; en = '1 hour before'"));
	ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(7200  , Нстр("ru = 'за 2 часа'; en = '2 hours before'"));
    ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(86400 , Нстр("ru = 'за 1 день'; en = '1 day before'"));
    ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(172800, Нстр("ru = 'за 2 дня'; en = '2 days before'"));
    ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(604800, Нстр("ru = 'за 1 неделю'; en = '1 week before'"));
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить список каналов системы сообщения
//
Процедура ЗаполнитьСписокКаналовСистемыСообщения(ЭлементФормы, ИндексСтроки, СтрокаНастройкиКаналовУведомлений)
	
	Если НЕ ЭлементФормы = Неопределено Тогда 
		ЭлементФормы.Видимость = Ложь;		
		ЭлементФормы.СписокВыбора.Очистить();
		Если ЗначениеЗаполнено(СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы) И ТипЗнч(СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы) = Тип("СправочникСсылка.ВнешниеСистемы") Тогда 
			МассивСтрокВнешниСистем = ТаблицаВнешнихСистем.НайтиСтроки(Новый Структура("Ссылка", СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы));
			Если НЕ МассивСтрокВнешниСистем.Количество() = 0 Тогда 
				ТипВнешнейСистемы = МассивСтрокВнешниСистем[0].ТипВнешнейСистемы;
			Иначе 
				ТипВнешнейСистемы = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы, "ТипВнешнейСистемы");
			КонецЕсли;
			
			Если ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Chat2Desk Тогда 
				ЭлементФормы.Видимость = Истина;			
				МассивКаналов = Новый Массив;//МессенджерСтоматология.ПолучитьКаналыChat2Desk(СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы);
				Для Каждого ЭлементКанал Из МассивКаналов Цикл 
					ЭлементФормы.СписокВыбора.Добавить(ЭлементКанал.Значение, ЭлементКанал.Имя + " (" + Строка(ЭлементКанал.Значение) + ")", СтрокаНастройкиКаналовУведомлений.КаналСистемыСообщений = ЭлементКанал.Значение);
				КонецЦикла;
				Если ЗначениеЗаполнено(СтрокаНастройкиКаналовУведомлений.КаналСистемыСообщений) Тогда 
					ЭлементСпискаКанал = ЭлементФормы.СписокВыбора.НайтиПоЗначению(СтрокаНастройкиКаналовУведомлений.КаналСистемыСообщений);
					Если ЭлементСпискаКанал = Неопределено Тогда 
						ЭлементФормы.СписокВыбора.Добавить(СтрокаНастройкиКаналовУведомлений.КаналСистемыСообщений, Новый ФорматированнаяСтрока("Канал деактивирован (" + СтрокаНастройкиКаналовУведомлений.КаналСистемыСообщений + ")", , Новый Цвет(255, 0, 0)), Истина);
					КонецЕсли;
				КонецЕсли;
				Если ЭлементФормы.СписокВыбора.Количество() = 0 Тогда 
					ЭлементФормы.ПодсказкаВвода = НСтр("ru = 'Каналы сообщений не найдены'; en = 'Message channels are not found'");
				Иначе 
					ЭлементФормы.ПодсказкаВвода = НСтр("ru = 'Выберите канал сообщений'; en = 'Select a message channel'");
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам формы
//
Процедура УстановитьСвойстваЭлементамФормы(ПриСозданииНаСервере = Ложь)
	
	УстановитьСвойстваЭлементамПереключателяАктивности();
	
	УстановитьСвойстваЭлементамПараметраАктивации();
	УстановитьСвойстваЭлементамПериодаАктивации();
	УстановитьСвойстваЭлементамПериодаПараметра();	
	УстановитьСвойстваЭлементамМоментаСобытия();
	УстановитьСвойстваЭлементамВыбораСтатусовКлиентов();
	УстановитьСвойстваЭлементамВыбораВидаСделок();
	УстановитьСвойстваЭлементамВидаЛицевыхСчетов();
	УстановитьСвойстваЭлементамВидаБонусныхСчетов();
	УстановитьСвойстваЭлементамСтатусаПредварительнойЗаписи();
	УстановитьСвойстваЭлементамПараметровСтраховыхПолисов();	
	УстановитьСвойстваЭлементамПричиныОтменыЗанятия();
	УстановитьСвойстваЭлементамФильтров();
	
	// Свойства элементов фильтра по статусу пациента приема		
	Элементы.ГруппаПараметрыСтатусПациентаПриема.Видимость	= Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершен;
	
	// Свойства элементов фильтра по результату приема		
	Элементы.ГруппаПараметрыРезультатПриема.Видимость		= Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершен;
	
	Если НЕ ПриСозданииНаСервере Тогда 
    	УстановитьСвойстваЭлементамДействий();
	КонецЕсли;	
	
	// Описание
	СформироватьОписаниеТриггерногоСобытия();
	
КонецПроцедуры

&НаСервере
// Процедура - Установить доступность элементам формы
//
// Параметры:
//  ПриСозданииНаСервере - 	 - 
//
Процедура УстановитьДоступностьЭлементамФормы(ПриСозданииНаСервере = Ложь)
	
	РедактированиеРазрешено 							= ПравоДоступа("Редактирование", Метаданные.Справочники.ТриггерныеСобытия);
	Элементы.АктивироватьСобытие.Доступность 			= РедактированиеРазрешено;
	Элементы.Активно.Доступность 						= РедактированиеРазрешено;
	Элементы.ВиртуальнаяГруппаСобытий.ТолькоПросмотр	= НЕ РедактированиеРазрешено;
	Элементы.ГруппаДействий.Доступность 				= РедактированиеРазрешено;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам переключателя активности
//
// Параметры:
//  УстановитьСвойстваЭлементамФильтраСобытия	 - 	 - 
//  УстановитьСвойстваЭлементамМоментаСобытия	 - 	 - 
//  УстановитьСвойстваЭлементамДействий			 - 	 - 
//  УстановитьСвойстваЭлементамШаблона			 - 	 - 
//
Процедура УстановитьСвойстваЭлементамПереключателяАктивности(УстановитьСвойстваЭлементамФильтраСобытия = Ложь, УстановитьСвойстваЭлементамМоментаСобытия = Ложь, УстановитьСвойстваЭлементамДействий = Ложь, УстановитьСвойстваЭлементамШаблона = Ложь)
	
	Элементы.ГруппаКнопкиАктивацииСобытия.ЦветФона 	= ?(Объект.Активно, Новый Цвет(25, 116, 206), Новый Цвет(242, 242, 242));
	Элементы.АктивироватьСобытие.ЦветТекста 		= ?(Объект.Активно, Новый Цвет(255, 255, 255), Новый Цвет(77, 77, 77));
	Элементы.АктивироватьСобытие.Заголовок 			= ?(Объект.Активно, "Активно", "Не активно");
	Элементы.Активно.Заголовок 						= ?(Объект.Активно, "Активно", "Не активно");
	Элементы.Активно.ЦветТекстаЗаголовка 			= ?(Объект.Активно, Новый Цвет(), Новый Цвет(121, 121, 121));
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам параметра активации
//
Процедура УстановитьСвойстваЭлементамПараметраАктивации()
	
	Элементы.ПараметрСобытияНомерПосещения.Видимость 		= Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентПосещениеКлиники;
	Элементы.ГруппаПараметрПериод.Видимость 				= Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе ИЛИ Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаявкаНеОбработана;
	Элементы.ПериодСобытияПараметр.ПоложениеЗаголовка 		= ?(Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаявкаНеОбработана, ПоложениеЗаголовкаЭлементаФормы.Нет, ПоложениеЗаголовкаЭлементаФормы.Лево);
	
	// Сбрасываем свойства
	Элементы.ПараметрСобытия.Видимость 								= Ложь;	
	Элементы.ПараметрСобытияНомерПосещения.Видимость 				= Ложь;
	Элементы.ПараметрСобытия.МинимальноеЗначение 					= 0;	
	Элементы.ПараметрСобытияНомерПосещения.МинимальноеЗначение 		= 0;
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий 	= ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	ПараметрыВариантаУсловияТриггерныхСобытий 		= ТаблицаВсехВариантовУсловийТриггерныхСобытий.Найти(Объект.УсловиеСобытия, "ВариантыУсловийТриггерныхСобытий");	
	Если ПараметрыВариантаУсловияТриггерныхСобытий <> Неопределено Тогда 
		ЭлементПараметра = Элементы.Найти(ПараметрыВариантаУсловияТриггерныхСобытий.ИмяЭлементаПараметраСобытия);
		Если ЭлементПараметра <> Неопределено Тогда 
			ЭлементПараметра.Видимость 				= ПараметрыВариантаУсловияТриггерныхСобытий.ИспользуетсяПараметрСобытия;
			ЭлементПараметра.МинимальноеЗначение 	= ПараметрыВариантаУсловияТриггерныхСобытий.МинимальноеЗначениеПараметраСобытия;
		КонецЕсли;	
	КонецЕсли;
	
	Элементы.ПараметрСобытия.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	Если Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентНепосещениеКлиники ИЛИ Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентПотенциальныйНеСталНовым Тогда 
		Элементы.ПараметрСобытия.Заголовок = СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу("День", Объект.ПараметрСобытия, "Родительный");
	ИначеЕсли Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетКритическийОстатокСредств Тогда
		Элементы.ПараметрСобытия.Заголовок = ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодЦелойчастиВалюты();
	КонецЕсли;
	
	Элементы.ПериодСобытияПараметр.АвтоОтметкаНезаполненного 	= Элементы.ГруппаПараметрПериод.Видимость;
	Элементы.ПериодСобытияПараметр.ОтметкаНезаполненного 		= Элементы.ГруппаПараметрПериод.Видимость;	
	Элементы.ПериодСобытияВидПараметр.АвтоОтметкаНезаполненного = Элементы.ГруппаПараметрПериод.Видимость;
	Элементы.ПериодСобытияВидПараметр.ОтметкаНезаполненного 	= Элементы.ГруппаПараметрПериод.Видимость;
	Элементы.ВидСделки.АвтоОтметкаНезаполненного 				= Элементы.ГруппаПараметрПериод.Видимость;
	Элементы.ВидСделки.ОтметкаНезаполненного 					= Элементы.ГруппаПараметрПериод.Видимость;	
	Элементы.ПереходСЭтапа.АвтоОтметкаНезаполненного 			= Элементы.ГруппаПараметрПериод.Видимость;
	Элементы.ПереходСЭтапа.ОтметкаНезаполненного 				= Элементы.ГруппаПараметрПериод.Видимость;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам момента события
//
// Параметры:
//  УстановитьСвойстваЭлементамПериодаАктивации	 - 	 - 
//
Процедура УстановитьСвойстваЭлементамМоментаСобытия(УстановитьСвойстваЭлементамПериодаАктивации = Ложь)
	
	Если УстановитьСвойстваЭлементамПериодаАктивации = Истина Тогда 
		УстановитьСвойстваЭлементамПериодаАктивации();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам фильтров
//
Процедура УстановитьСвойстваЭлементамФильтров()
	
	Элементы.Группа3.Видимость 											= НЕ ЗначениеЗаполнено(Объект.УсловиеСобытия) ИЛИ НЕ Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаявкаНеОбработана;
	Элементы.СегментКонтрагентов.Видимость 								= НЕ ЗначениеЗаполнено(Объект.УсловиеСобытия) ИЛИ НЕ Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаявкаНеОбработана;
	
	// Свойства элементов фильтра Структурная единица
	РазрешенОтборПоСтруктурнымЕдиницам 									= Справочники.ТриггерныеСобытия.ИспользуетсяОтборПоСтруктурнымЕдиницам(Объект.УсловиеСобытия);	
	Элементы.ГруппаДоступностьЧленствПакетов.Видимость 					= РазрешенОтборПоСтруктурнымЕдиницам;
	
	// Свойства элементов фильтра Источник записи
	РазрешенОтборПоИсточникамЗаписи 									= Справочники.ТриггерныеСобытия.ИспользуетсяОтборПоИсточникамЗаписи(Объект.УсловиеСобытия);	
	Элементы.ДекорацияЗаголовокИсточникЗаписи.Видимость 				= РазрешенОтборПоИсточникамЗаписи;
	Элементы.ИсточникЗаписи.Видимость 									= РазрешенОтборПоИсточникамЗаписи;
	//Элементы.ИсточникЗаписи.ОграничениеТипа 							= Новый ОписаниеТипов("СправочникСсылка.ИсточникиЗаписей");
	
	// Свойства элементов фильтра онлайн-продажа
	РазрешенОтборПоПоПризнакуОнлайнПродажа								= Справочники.ТриггерныеСобытия.ИспользуетсяОтборПоПризнакуОнлайнПродажа(Объект.УсловиеСобытия);	
	Элементы.ДекорацияЗаголовокФильтраПоПризнакуОнлайПродажа.Видимость 	= РазрешенОтборПоПоПризнакуОнлайнПродажа;
	Элементы.ГруппаКнопокФильтрацииПоПризнакуОнлайПродажа.Видимость 	= РазрешенОтборПоПоПризнакуОнлайнПродажа;
	
	// Свойства элементов фильтра по услугам		
	РазрешенОтборПоСегментуУслуг 										= Справочники.ТриггерныеСобытия.ИспользуетсяОтборПоСегментуУслуг(Объект.УсловиеСобытия);
	Элементы.ГруппаУслугаСегментУслуг.Видимость 						= РазрешенОтборПоСегментуУслуг;
	Элементы.СегментУслуг.Видимость 									= РазрешенОтборПоСегментуУслуг;
	Элементы.ДекорацияЗаголовокФильтраПоУслуге.Заголовок 				= ПолучитьЗаголовокФильтраПоУслугам();
	
	ОбновитьСвойстваЭлементовВыбораУслугиСегментаУслуг();	
	ОбновитьСвойстваЭлементовВыбораПризнакаОнлайнПродажа();
	
КонецПроцедуры

&НаСервере
// Функция - Получить заголовок фильтра по услугам
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЗаголовокФильтраПоУслугам();
	
	ЗаголовокФильтра = "";
	Если Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСозданиеЗаписиНаПрием Тогда		
		ЗаголовокФильтра = "Услуга занятия:";
	ИначеЕсли Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаСотрудникомКлиники ИЛИ Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаПациентом Тогда 
		ЗаголовокФильтра = "Услуга занятия:";
	ИначеЕсли Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеПереносДатыВремени Тогда 
		ЗаголовокФильтра = "Услуга занятия:";
	ИначеЕсли Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеЗаменаИнструктора Тогда 
		ЗаголовокФильтра = "Услуга занятия:";				
	ИначеЕсли Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеКлиентНеПрибыл Тогда 
		ЗаголовокФильтра = "Услуга занятия:";
	ИначеЕсли Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеКлиентПрибыл Тогда 
		ЗаголовокФильтра = "Услуга занятия:";
	ИначеЕсли Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема Тогда 
		ЗаголовокФильтра = "Услуга занятия:";
	ИначеЕсли Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеОтменено Тогда 
		ЗаголовокФильтра = "Услуга занятия:";
	ИначеЕсли Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеСписаниеУслугиКлиентПрибыл Тогда 
		ЗаголовокФильтра = "Услуга занятия:";
	ИначеЕсли Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеСписаниеУслугиПоНеявке Тогда 
		ЗаголовокФильтра = "Услуга занятия:";
	Иначе 
		ЗаголовокФильтра = "Услуга:";
	КонецЕсли;
	
	Возврат ЗаголовокФильтра;
	
КонецФункции

&НаСервере
Процедура ОбновитьСвойстваЭлементовВыбораПризнакаОнлайнПродажа(ОписаниеТипаПризнака = "")
	
	Если Справочники.ТриггерныеСобытия.ИспользуетсяОтборПоИсточникамЗаписи(Объект.УсловиеСобытия) Тогда
		Элементы.ИсточникЗаписи.ОграничениеТипа 							= Новый ОписаниеТипов("СправочникСсылка.ИсточникиЗаписей");
		Объект.ИсточникЗаписи												= Элементы.ИсточникЗаписи.ОграничениеТипа.ПривестиЗначение(Объект.ИсточникЗаписи);
	ИначеЕсли Справочники.ТриггерныеСобытия.ИспользуетсяОтборПоПризнакуОнлайнПродажа(Объект.УсловиеСобытия) Тогда
		Если ЗначениеЗаполнено(ОписаниеТипаПризнака) Тогда
			Если ОписаниеТипаПризнака = "ПустаяСсылка" Тогда 
				Объект.ИсточникЗаписи 										= Перечисления.ТипыФискализации.ПустаяСсылка();
			Иначе 	
				Объект.ИсточникЗаписи 										= Перечисления.ТипыФискализации[ОписаниеТипаПризнака];
			КонецЕсли;
			ЭтаФорма.Модифицированность = Истина;
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ИсточникЗаписи) ИЛИ Объект.ИсточникЗаписи = Неопределено ИЛИ ТипЗнч(Объект.ИсточникЗаписи) <> Тип("ПеречислениеСсылка.ТипыФискализации") Тогда 
			Объект.ИсточникЗаписи 											= Перечисления.ТипыФискализации.ПустаяСсылка();
		КонецЕсли;
		Если Объект.ИсточникЗаписи = Перечисления.ТипыФискализации.ОнлайнКасса Тогда 
			
			Элементы.ФильтроватьПоПризнакуОнлайПродажа_Да.ЦветТекста 		= Новый Цвет(255, 255, 255);
			Элементы.ФильтроватьПоПризнакуОнлайПродажа_Нет.ЦветТекста 		= Новый Цвет();
			Элементы.ФильтроватьПоПризнакуОнлайПродажа_Неважно.ЦветТекста 	= Новый Цвет();
			
			Элементы.ГруппаКнопкиДа.ЦветФона 								= Новый Цвет(25, 116, 206);
			Элементы.ГруппаКнопкиНет.ЦветФона 								= Новый Цвет(242, 242, 242);
			Элементы.ГруппаКнопкиНеважно.ЦветФона 							= Новый Цвет(242, 242, 242);
			
		ИначеЕсли Объект.ИсточникЗаписи = Перечисления.ТипыФискализации.НеФискализировать Тогда 
			
			Элементы.ФильтроватьПоПризнакуОнлайПродажа_Да.ЦветТекста 		= Новый Цвет();
			Элементы.ФильтроватьПоПризнакуОнлайПродажа_Нет.ЦветТекста 		= Новый Цвет(255, 255, 255);
			Элементы.ФильтроватьПоПризнакуОнлайПродажа_Неважно.ЦветТекста 	= Новый Цвет();
			
			Элементы.ГруппаКнопкиДа.ЦветФона 								= Новый Цвет(242, 242, 242);
			Элементы.ГруппаКнопкиНет.ЦветФона 								= Новый Цвет(25, 116, 206);
			Элементы.ГруппаКнопкиНеважно.ЦветФона 							= Новый Цвет(242, 242, 242);
			
		ИначеЕсли Объект.ИсточникЗаписи = Перечисления.ТипыФискализации.ПустаяСсылка() Тогда 
			
			Элементы.ФильтроватьПоПризнакуОнлайПродажа_Да.ЦветТекста 		= Новый Цвет();
			Элементы.ФильтроватьПоПризнакуОнлайПродажа_Нет.ЦветТекста 		= Новый Цвет();
			Элементы.ФильтроватьПоПризнакуОнлайПродажа_Неважно.ЦветТекста 	= Новый Цвет(255, 255, 255);
			
			Элементы.ГруппаКнопкиДа.ЦветФона 								= Новый Цвет(242, 242, 242);
			Элементы.ГруппаКнопкиНет.ЦветФона 								= Новый Цвет(242, 242, 242);
			Элементы.ГруппаКнопкиНеважно.ЦветФона 							= Новый Цвет(25, 116, 206);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить свойства элементов выбора услуги сегмента услуг
//
// Параметры:
//  ОписаниеТипаФильтра	 - 	 - 
//
Процедура ОбновитьСвойстваЭлементовВыбораУслугиСегментаУслуг(ОписаниеТипаФильтра = Неопределено)
	
	Если ОписаниеТипаФильтра = Неопределено Тогда 
		Если ЗначениеЗаполнено(Объект.СегментУслуг) ИЛИ Объект.СегментУслуг <> Неопределено Тогда
			Если НЕ Справочники.ТриггерныеСобытия.ИспользуетсяОтборПоСегментуУслуг(Объект.УсловиеСобытия) Тогда 
				Объект.СегментУслуг 							= Неопределено;
				Объект.СегментУслуг 							= Элементы.СегментУслуг.ОграничениеТипа.ПривестиЗначение();
			КонецЕсли;	
			Если ТипЗнч(Объект.СегментУслуг) = Тип("СправочникСсылка.Номенклатура") Тогда 
				Если Объект.СегментУслуг = Неопределено Тогда 
					Элементы.СегментУслуг.ОграничениеТипа 		= Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
				КонецЕсли;
				Элементы.ГруппаКнопкиСегментУслуг.ЦветФона 		= ?(Элементы.ГруппаУслугаСегментУслуг.Доступность	, Новый Цвет(239, 239, 239)	, Новый Цвет(229, 229, 229));
				Элементы.ФильтроватьПоСегментуУслуг.ЦветТекста 	= ?(Элементы.ГруппаУслугаСегментУслуг.Доступность	, Новый Цвет(115, 115, 115)	, Новый Цвет(115, 115, 115));
				Элементы.ГруппаКнопкиУслуга.ЦветФона 			= ?(Элементы.ГруппаУслугаСегментУслуг.Доступность	, Новый Цвет(25, 116, 206)	, Новый Цвет(242, 242, 242));
				Элементы.ФильтроватьПоУслуге.ЦветТекста 		= ?(Элементы.ГруппаУслугаСегментУслуг.Доступность	, Новый Цвет(255, 255, 255)	, Новый Цвет(115, 115, 115));
				
				Элементы.СегментУслуг.ПодсказкаВвода 			= "Укажите услугу";
				
			ИначеЕсли ТипЗнч(Объект.СегментУслуг) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
				Если Объект.СегментУслуг = Неопределено Тогда 
					Элементы.СегментУслуг.ОграничениеТипа 		= Новый ОписаниеТипов("СправочникСсылка.СегментыНоменклатуры");
				КонецЕсли;
				Элементы.ГруппаКнопкиСегментУслуг.ЦветФона 		= ?(Элементы.ГруппаУслугаСегментУслуг.Доступность	, Новый Цвет(25, 116, 206)	, Новый Цвет(229, 229, 229));
				Элементы.ФильтроватьПоСегментуУслуг.ЦветТекста 	= ?(Элементы.ГруппаУслугаСегментУслуг.Доступность	, Новый Цвет(255, 255, 255)	, Новый Цвет(115, 115, 115));
				Элементы.ГруппаКнопкиУслуга.ЦветФона 			= ?(Элементы.ГруппаУслугаСегментУслуг.Доступность	, Новый Цвет(239, 239, 239)	, Новый Цвет(242, 242, 242));
				Элементы.ФильтроватьПоУслуге.ЦветТекста 		= ?(Элементы.ГруппаУслугаСегментУслуг.Доступность	, Новый Цвет(115, 115, 115)	, Новый Цвет(115, 115, 115));
				
				Элементы.СегментУслуг.ПодсказкаВвода 			= "Укажите сегмент услуг";
			КонецЕсли;
		Иначе 
			Элементы.СегментУслуг.ОграничениеТипа 				= Новый ОписаниеТипов("СправочникСсылка.СегментыНоменклатуры");
			Объект.СегментУслуг 								= Элементы.СегментУслуг.ОграничениеТипа.ПривестиЗначение();
			
			Элементы.ГруппаКнопкиСегментУслуг.ЦветФона 			= ?(Элементы.ГруппаУслугаСегментУслуг.Доступность	, Новый Цвет(25, 116, 206)	, Новый Цвет(229, 229, 229));
			Элементы.ФильтроватьПоСегментуУслуг.ЦветТекста 		= ?(Элементы.ГруппаУслугаСегментУслуг.Доступность	, Новый Цвет(255, 255, 255)	, Новый Цвет(115, 115, 115));
			Элементы.ГруппаКнопкиУслуга.ЦветФона 				= ?(Элементы.ГруппаУслугаСегментУслуг.Доступность	, Новый Цвет(239, 239, 239)	, Новый Цвет(242, 242, 242));
			Элементы.ФильтроватьПоУслуге.ЦветТекста 			= ?(Элементы.ГруппаУслугаСегментУслуг.Доступность	, Новый Цвет(115, 115, 115)	, Новый Цвет(115, 115, 115));
			
			Элементы.СегментУслуг.ПодсказкаВвода 				= "Укажите сегмент услуг";			
		КонецЕсли;
	Иначе 
		Элементы.СегментУслуг.ОграничениеТипа 					= ОписаниеТипаФильтра;
		Если НЕ Элементы.СегментУслуг.ОграничениеТипа.СодержитТип(ТипЗнч(Объект.СегментУслуг)) Тогда 
			Объект.СегментУслуг 								= ОписаниеТипаФильтра.ПривестиЗначение();
		КонецЕсли;
		ОбновитьСвойстваЭлементовВыбораУслугиСегментаУслуг();
		ЭтаФорма.ТекущийЭлемент = Элементы.СегментУслуг;
	КонецЕсли;	
	Элементы.СегментУслуг.ОтметкаНезаполненного 				= Справочники.ТриггерныеСобытия.ИспользуетсяОтборПоСегментуУслуг(Объект.УсловиеСобытия, Истина);
	Элементы.СегментУслуг.АвтоОтметкаНезаполненного 			= Справочники.ТриггерныеСобытия.ИспользуетсяОтборПоСегментуУслуг(Объект.УсловиеСобытия, Истина);
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам периода активации
//
Процедура УстановитьСвойстваЭлементамПериодаАктивации()
	
	Если НЕ ЗначениеЗаполнено(Объект.МоментСобытия) ИЛИ Объект.МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия Тогда 
		Элементы.ГруппаПериодСобытия.Видимость = Ложь;
		Если ЭтоВерсияКОРП Тогда 
			Элементы.ГруппаВремяСобытия.Видимость 	= Справочники.ТриггерныеСобытия.ЭтоИсключительноРегламентноеСобытие(Объект.УсловиеСобытия) И НЕ Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема И НЕ Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе И НЕ Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаявкаНеОбработана;
			Элементы.ВыборВремениСтарта.Видимость 	= Элементы.ГруппаВремяСобытия.Видимость И НЕ Элементы.ВремяСобытия.Видимость;
			Элементы.Декорация4.Видимость 			= Элементы.ГруппаВремяСобытия.Видимость И НЕ Элементы.ВремяСобытия.Видимость;		
		КонецЕсли;	
		Элементы.ПериодСобытия.МинимальноеЗначение 	= 0;
		Элементы.МоментСобытия.Ширина 				= 0;
		Элементы.МоментСобытия.МаксимальнаяШирина 	= 0;
	Иначе
		Элементы.ГруппаВремяСобытия.Видимость 		= ?(Объект.ПериодСобытияВид = Перечисления.Периодичность.День, Истина, Ложь);
		Элементы.ВыборВремениСтарта.Видимость 		= ?(Объект.ПериодСобытияВид = Перечисления.Периодичность.День, Истина, Ложь) И НЕ Элементы.ВремяСобытия.Видимость;
		Элементы.Декорация4.Видимость 				= ?(Объект.ПериодСобытияВид = Перечисления.Периодичность.День, Истина, Ложь) И НЕ Элементы.ВремяСобытия.Видимость;		
		Элементы.ГруппаПериодСобытия.Видимость 		= Истина;
		Элементы.Декорация1.Заголовок = ?(Объект.МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия, "за", "через");
		Элементы.ПериодСобытия.МинимальноеЗначение 	= 1;	
		Элементы.МоментСобытия.Ширина 				= 29;
		Элементы.МоментСобытия.МаксимальнаяШирина 	= 29;		
	КонецЕсли;
	
	Если Элементы.ВыборВремениСтарта.Видимость Тогда 
		Элементы.ВыборВремениСтарта.Заголовок 		= Формат(Объект.ВремяСобытия, "ДФ=HH:mm; ДП=00:00");
		Если Час(Объект.ВремяСобытия) = 0 И Минута(Объект.ВремяСобытия) = 0 Тогда 
			Элементы.ГруппаКнопкиВыборВремениСтарта.ЦветФона 	= Новый Цвет(243, 243, 243);
			Элементы.ВыборВремениСтарта.ЦветТекста 				= Новый Цвет();
		Иначе 
			Элементы.ГруппаКнопкиВыборВремениСтарта.ЦветФона 	= Новый Цвет(25, 116, 206);
			Элементы.ВыборВремениСтарта.ЦветТекста 				= Новый Цвет(255, 255, 255);
		КонецЕсли;
	КонецЕсли;
	
	//Элементы.ПериодСобытия.Заголовок = СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу("День", Объект.ПериодСобытия);
	Для Каждого ЭлементСписка Из Элементы.ПериодСобытияВид.СписокВыбора Цикл 
		ЭлементСписка.Представление = СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу(XMLСтрока(ЭлементСписка.Значение), Объект.ПериодСобытия, ?(ЭлементСписка.Значение = Перечисления.Периодичность.День, "", "Родительный"));
	КонецЦикла;
	
	Элементы.ДекорацияПояснениеОбластиСтарт.Видимость = Ложь;
	
	УстановитьСвойстваЭлементамСтатусаПредварительнойЗаписи();
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам периода параметра
//
Процедура УстановитьСвойстваЭлементамПериодаПараметра()
	
	ЭлементМинута = Элементы.ПериодСобытияВидПараметр.СписокВыбора.НайтиПоЗначению(Перечисления.Периодичность.Минута);
	Если ЭлементМинута <> Неопределено И Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаявкаНеОбработана Тогда
		//Элементы.ПериодСобытияВидПараметр.СписокВыбора.Удалить(ЭлементМинута);
	ИначеЕсли ЭлементМинута = Неопределено И НЕ Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаявкаНеОбработана Тогда 
		Элементы.ПериодСобытияВидПараметр.СписокВыбора.Добавить(Перечисления.Периодичность.Минута);
	КонецЕсли;
	
	ЭлементДень = Элементы.ПериодСобытияВидПараметр.СписокВыбора.НайтиПоЗначению(Перечисления.Периодичность.День);
	Если ЭлементДень = Неопределено И Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе Тогда
		Элементы.ПериодСобытияВидПараметр.СписокВыбора.Вставить(0, Перечисления.Периодичность.День); 
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из Элементы.ПериодСобытияВидПараметр.СписокВыбора Цикл 
		ЭлементСписка.Представление = СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу(XMLСтрока(ЭлементСписка.Значение), Объект.ПериодСобытия, "Родительный", , Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам выбора статусов клиентов
//
Процедура УстановитьСвойстваЭлементамВыбораСтатусовКлиентов()
	
	// Свойства элементов фильтра по статусам клиентов		
	РазрешенОтборПоСтатусамКлиентов									= Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентСменаСтатуса;
	РазрешенОтборПоВидуСделок 										= Справочники.ТриггерныеСобытия.ИспользуетсяОтборПоВидуСделок(Объект.УсловиеСобытия);	
	Элементы.ПереходСЭтапа.Видимость 								= РазрешенОтборПоСтатусамКлиентов ИЛИ РазрешенОтборПоВидуСделок;
	Элементы.ПереходНаЭтап.Видимость 								= РазрешенОтборПоСтатусамКлиентов ИЛИ РазрешенОтборПоВидуСделок;
	
	Если РазрешенОтборПоСтатусамКлиентов Тогда
		Элементы.ПереходСЭтапа.СписокВыбора.Очистить();
		Элементы.ПереходНаЭтап.СписокВыбора.Очистить();				
		Элементы.ПереходСЭтапа.СписокВыбора.Добавить(Перечисления.СтатусыКонтрагентов.ПустаяСсылка(), "С любого статуса"	, Объект.ПереходСЭтапа = Перечисления.СтатусыКонтрагентов.ПустаяСсылка());
		Элементы.ПереходНаЭтап.СписокВыбора.Добавить(Перечисления.СтатусыКонтрагентов.ПустаяСсылка(), "На любой статус"		, Объект.ПереходНаЭтап = Перечисления.СтатусыКонтрагентов.ПустаяСсылка());
		Элементы.ПереходСЭтапа.СписокВыбора.Добавить(Перечисления.СтатусыКонтрагентов.Потенциальный, "Со статуса """ + Строка(Перечисления.СтатусыКонтрагентов.Потенциальный) + """", Объект.ПереходСЭтапа = Перечисления.СтатусыКонтрагентов.Потенциальный);
		Элементы.ПереходНаЭтап.СписокВыбора.Добавить(Перечисления.СтатусыКонтрагентов.Потенциальный, "На статус """ + Строка(Перечисления.СтатусыКонтрагентов.Потенциальный) + """", Объект.ПереходНаЭтап = Перечисления.СтатусыКонтрагентов.Потенциальный);
		Элементы.ПереходСЭтапа.СписокВыбора.Добавить(Перечисления.СтатусыКонтрагентов.Первичный, "Со статуса """ + Строка(Перечисления.СтатусыКонтрагентов.Первичный) + """", Объект.ПереходСЭтапа = Перечисления.СтатусыКонтрагентов.Первичный);
		Элементы.ПереходНаЭтап.СписокВыбора.Добавить(Перечисления.СтатусыКонтрагентов.Первичный, "На статус """ + Строка(Перечисления.СтатусыКонтрагентов.Первичный) + """", Объект.ПереходНаЭтап = Перечисления.СтатусыКонтрагентов.Первичный);
		Элементы.ПереходСЭтапа.СписокВыбора.Добавить(Перечисления.СтатусыКонтрагентов.Постоянный, "Со статуса """ + Строка(Перечисления.СтатусыКонтрагентов.Постоянный) + """", Объект.ПереходСЭтапа = Перечисления.СтатусыКонтрагентов.Постоянный);
		Элементы.ПереходНаЭтап.СписокВыбора.Добавить(Перечисления.СтатусыКонтрагентов.Постоянный, "На статус """ + Строка(Перечисления.СтатусыКонтрагентов.Постоянный) + """", Объект.ПереходНаЭтап = Перечисления.СтатусыКонтрагентов.Постоянный);
		Элементы.ПереходСЭтапа.СписокВыбора.Добавить(Перечисления.СтатусыКонтрагентов.НеВернувшийся, "Со статуса """ + Строка(Перечисления.СтатусыКонтрагентов.НеВернувшийся) + """", Объект.ПереходСЭтапа = Перечисления.СтатусыКонтрагентов.НеВернувшийся);
		Элементы.ПереходНаЭтап.СписокВыбора.Добавить(Перечисления.СтатусыКонтрагентов.НеВернувшийся, "На статус """ + Строка(Перечисления.СтатусыКонтрагентов.НеВернувшийся) + """", Объект.ПереходНаЭтап = Перечисления.СтатусыКонтрагентов.НеВернувшийся);
		Элементы.ПереходСЭтапа.СписокВыбора.Добавить(Перечисления.СтатусыКонтрагентов.Отказ, "Со статуса """ + Строка(Перечисления.СтатусыКонтрагентов.Отказ) + """", Объект.ПереходСЭтапа = Перечисления.СтатусыКонтрагентов.Отказ);
		Элементы.ПереходНаЭтап.СписокВыбора.Добавить(Перечисления.СтатусыКонтрагентов.Отказ, "На статус """ + Строка(Перечисления.СтатусыКонтрагентов.Отказ) + """", Объект.ПереходНаЭтап = Перечисления.СтатусыКонтрагентов.Отказ);
		
		Если Элементы.ПереходСЭтапа.СписокВыбора.НайтиПоЗначению(Объект.ПереходСЭтапа) = Неопределено Тогда 
			Объект.ПереходСЭтапа = Перечисления.СтатусыКонтрагентов.ПустаяСсылка();
		КонецЕсли;	
		Если Элементы.ПереходНаЭтап.СписокВыбора.НайтиПоЗначению(Объект.ПереходНаЭтап) = Неопределено Тогда 
			Объект.ПереходНаЭтап = Перечисления.СтатусыКонтрагентов.ПустаяСсылка();
		КонецЕсли;	
	КонецЕсли;
	
	Если НЕ РазрешенОтборПоСтатусамКлиентов И НЕ РазрешенОтборПоВидуСделок Тогда 
		Объект.ПереходСЭтапа 				= Неопределено;
		Объект.ПереходНаЭтап 				= Неопределено;
		Элементы.ПереходСЭтапа.Видимость 	= Ложь;
		Элементы.ПереходНаЭтап.Видимость 	= Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам выбора вида сделок
//
Процедура УстановитьСвойстваЭлементамВыбораВидаСделок()
	
	// Свойства элементов фильтра по видам сделок		
	РазрешенОтборПоВидуСделок 										= Справочники.ТриггерныеСобытия.ИспользуетсяОтборПоВидуСделок(Объект.УсловиеСобытия);
	РазрешенОтборПоСтатусамКлиентов									= Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентСменаСтатуса;	
	Элементы.ВидСделки.Видимость 									= РазрешенОтборПоВидуСделок;
	Элементы.ПереходСЭтапа.Видимость 								= РазрешенОтборПоВидуСделок ИЛИ РазрешенОтборПоСтатусамКлиентов;
	Элементы.ПереходНаЭтап.Видимость 								= (РазрешенОтборПоВидуСделок ИЛИ РазрешенОтборПоСтатусамКлиентов) И НЕ Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе И НЕ Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаявкаНеОбработана;
	
	Если РазрешенОтборПоВидуСделок Тогда 
		Если ЗначениеЗаполнено(Объект.ВидСделки) Тогда
			Элементы.ПереходСЭтапа.СписокВыбора.Очистить();
			Элементы.ПереходНаЭтап.СписокВыбора.Очистить();				
			МассивЭтапов = Справочники.ЭтапыСделок.ВернутьМассивЭтаповВидаСделки(Объект.ВидСделки, Истина);
			Если НЕ Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе Тогда 
				Элементы.ПереходСЭтапа.СписокВыбора.Добавить(Справочники.ЭтапыСделок.ПустаяСсылка(), "С любого этапа"	, Объект.ПереходСЭтапа = Справочники.ЭтапыСделок.ПустаяСсылка());
				Элементы.ПереходНаЭтап.СписокВыбора.Добавить(Справочники.ЭтапыСделок.ПустаяСсылка(), "На любой этап"	, Объект.ПереходНаЭтап = Справочники.ЭтапыСделок.ПустаяСсылка());
			КонецЕсли;	
			Для К = 0 По МассивЭтапов.Количество() - 1 Цикл
				Если Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе Тогда 
					Элементы.ПереходСЭтапа.СписокВыбора.Добавить(МассивЭтапов[К], "На этапе """ + Строка(К + 1) + ". " + Строка(МассивЭтапов[К]) + """", МассивЭтапов[К] = Объект.ПереходСЭтапа);
				Иначе 	
					Элементы.ПереходСЭтапа.СписокВыбора.Добавить(МассивЭтапов[К], "С этапа """ + Строка(К + 1) + ". " + Строка(МассивЭтапов[К]) + """", МассивЭтапов[К] = Объект.ПереходСЭтапа);
				КонецЕсли;	
				Элементы.ПереходНаЭтап.СписокВыбора.Добавить(МассивЭтапов[К], "На этап """ + Строка(К + 1) + ". " + Строка(МассивЭтапов[К]) + """", МассивЭтапов[К] = Объект.ПереходНаЭтап);			
			КонецЦикла;
			Если Элементы.ПереходСЭтапа.СписокВыбора.НайтиПоЗначению(Объект.ПереходСЭтапа) = Неопределено Тогда 
				Объект.ПереходСЭтапа = Справочники.ЭтапыСделок.ПустаяСсылка();
			КонецЕсли;	
			Если Элементы.ПереходНаЭтап.СписокВыбора.НайтиПоЗначению(Объект.ПереходНаЭтап) = Неопределено Тогда 
				Объект.ПереходНаЭтап = Справочники.ЭтапыСделок.ПустаяСсылка();
			КонецЕсли;	
			
			Элементы.ПереходСЭтапа.Видимость 								= РазрешенОтборПоВидуСделок;
			Элементы.ПереходНаЭтап.Видимость 								= РазрешенОтборПоВидуСделок И НЕ Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе;
		Иначе 
			Элементы.ПереходСЭтапа.СписокВыбора.Очистить();
			Элементы.ПереходНаЭтап.СписокВыбора.Очистить();
			Если НЕ Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе Тогда 			
				Элементы.ПереходСЭтапа.СписокВыбора.Добавить(Справочники.ЭтапыСделок.ПустаяСсылка(), "С любого этапа"	, Объект.ПереходСЭтапа = Справочники.ЭтапыСделок.ПустаяСсылка());
				Элементы.ПереходНаЭтап.СписокВыбора.Добавить(Справочники.ЭтапыСделок.ПустаяСсылка(), "На любой этап"	, Объект.ПереходНаЭтап = Справочники.ЭтапыСделок.ПустаяСсылка());		
			КонецЕсли;
			Элементы.ПереходСЭтапа.Видимость 								= Ложь;
			Элементы.ПереходНаЭтап.Видимость 								= Ложь;
		КонецЕсли;
	КонецЕсли;

	Если НЕ РазрешенОтборПоСтатусамКлиентов И НЕ РазрешенОтборПоВидуСделок Тогда 
		Объект.ПереходСЭтапа 				= Неопределено;
		Объект.ПереходНаЭтап 				= Неопределено;
		Элементы.ПереходСЭтапа.Видимость 	= Ложь;
		Элементы.ПереходНаЭтап.Видимость 	= Ложь;
	КонецЕсли;
	
	Если Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе Тогда
		ПараметрыОтображенияЭлементов = ИнициализироватьСтруктуруПараметровОтрисовки();		
		Для Каждого СтрокаДействие Из Объект.Действия Цикл 
			Если СтрокаДействие.Удалено Тогда 
				Продолжить;
			КонецЕсли;
			
			УстановитьСвойстваЭлементамДействийПоСделкам(, Объект.Действия.Индекс(СтрокаДействие), ПараметрыОтображенияЭлементов);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам вида лицевых счетов
//
Процедура УстановитьСвойстваЭлементамВидаЛицевыхСчетов()

	// Свойства элементов фильтра по видам лицевых счетов		
	РазрешенОтборПоВидуЛицевыхСчетов								= Справочники.ТриггерныеСобытия.ИспользуетсяОтборПоВидуЛицевыхСчетов(Объект.УсловиеСобытия);
	Элементы.ГруппаВидЛицевогоСчета.Видимость 						= РазрешенОтборПоВидуЛицевыхСчетов;

КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам вида бонусных счетов
//
Процедура УстановитьСвойстваЭлементамВидаБонусныхСчетов()

	// Свойства элементов фильтра по видам бонусных счетов счетов		
	РазрешенОтборПоВидуБонусныхСчетов								= Справочники.ТриггерныеСобытия.ИспользуетсяОтборПоВидуБонусныхСчетов(Объект.УсловиеСобытия);
	Элементы.ГруппаВидБонусногоСчета.Видимость 						= РазрешенОтборПоВидуБонусныхСчетов;

КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам статуса предварительной записи
//
Процедура УстановитьСвойстваЭлементамСтатусаПредварительнойЗаписи()

	// Свойства элементов фильтра по статусам предварительной записи		
	РазрешенОтборПоСтатусуПредварительнойЗаписи						= Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаСотрудникомКлиники
	                                                                ИЛИ Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаПациентом 
																	ИЛИ (Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема И Объект.МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия);
	Элементы.ГруппаСтатусЗаписи.Видимость 							= РазрешенОтборПоСтатусуПредварительнойЗаписи;

КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам параметров страховых полисов
//
Процедура УстановитьСвойстваЭлементамПараметровСтраховыхПолисов()

	// Свойства элементов фильтра по типам страховых полисов		
	РазрешенОтборПоТипуСтраховогоПолиса						= Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентОкончаниеСрокаДействияСтраховогоПолиса;
	Элементы.ГруппаПараметрыПолиса.Видимость				= РазрешенОтборПоТипуСтраховогоПолиса;

КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам причины отмены занятия
//
Процедура УстановитьСвойстваЭлементамПричиныОтменыЗанятия()

	// Свойства элементов фильтра по видам лицевых счетов		
	РазрешенОтборПоПричинеОтмены									= Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеОтменено;
	Элементы.ГруппаПричинаОтмены.Видимость 							= РазрешенОтборПоПричинеОтмены;

КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам действий
//
Процедура УстановитьСвойстваЭлементамДействий(ЭлементФормы = Неопределено, ИндексРедактируемойСтроки = Неопределено, ПараметрыОтображенияЭлементов = Неопределено) Экспорт
	
	ОбновлятьПараметрыСтроки = Ложь;
	ПоискЭлемента = ЭлементФормы = Неопределено;
	
	// Актуализируем параметры отрисовки
	Если ПараметрыОтображенияЭлементов = Неопределено Тогда 
		ПараметрыОтображенияЭлементов 	= ИнициализироватьСтруктуруПараметровОтрисовки();
		МассивАктуальныхСтрок 			= Объект.Действия.НайтиСтроки(Новый Структура("Удалено", Ложь));		
		ОбновлятьПараметрыСтроки 		= Истина;
	КонецЕсли;
	
	Для Каждого СтрокаДействие ИЗ Объект.Действия Цикл
		Если СтрокаДействие.Удалено Тогда 
			Продолжить;
		КонецЕсли;
		Если НЕ ИндексРедактируемойСтроки = Неопределено Тогда 
			Если ИндексРедактируемойСтроки = Объект.Действия.Индекс(СтрокаДействие) Тогда
				ИндексСтроки = ИндексРедактируемойСтроки;
			Иначе 	
				Продолжить;
			КонецЕсли;
		Иначе 
			ИндексСтроки = Объект.Действия.Индекс(СтрокаДействие);
		КонецЕсли;
		
		// Актуализируем параметр конкретной строки
		Если ОбновлятьПараметрыСтроки Тогда 
			ПараметрыОтображенияЭлементов.Вставить("ЭтоПерваяАктуальнаяСтрока", ?(МассивАктуальныхСтрок.Количество() = 0, Истина, ИндексСтроки = Объект.Действия.Индекс(МассивАктуальныхСтрок[0])));
		КонецЕсли;
		
		// Настраиваем элементы строки
		УстановитьСвойстваЭлементамСтрокиДействий(, ИндексСтроки, ПараметрыОтображенияЭлементов);
		Если НЕ ИндексРедактируемойСтроки = Неопределено ИЛИ СтрокаДействие.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки ИЛИ СтрокаДействие.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота Тогда
			Если ЗначениеЗаполнено(СтрокаДействие.ВидДействия) Тогда
				Если СтрокаДействие.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру Тогда 
					УстановитьСвойстваЭлементамИсполнителей(, ИндексСтроки, ПараметрыОтображенияЭлементов);
					УстановитьСвойстваЭлементамШаблона(, ИндексСтроки, ПараметрыОтображенияЭлементов);
			    ИначеЕсли СтрокаДействие.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение ИЛИ СтрокаДействие.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо Тогда 
					УстановитьСвойстваЭлементамПолучателяСообщения(, ИндексСтроки, ПараметрыОтображенияЭлементов);
					УстановитьСвойстваЭлементамАккаунтаСообщения(, ИндексСтроки, ПараметрыОтображенияЭлементов);
					УстановитьСвойстваЭлементамШаблона(, ИндексСтроки, ПараметрыОтображенияЭлементов);					
				//ИначеЕсли СтрокаДействие.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо Тогда 
				//	УстановитьСвойстваЭлементамПолучателяСообщения(, ИндексРедактируемойСтроки, ПараметрыОтображенияЭлементов);					
				//	УстановитьСвойстваЭлементамАккаунтаСообщения(, ИндексРедактируемойСтроки, ПараметрыОтображенияЭлементов);
				//	УстановитьСвойстваЭлементамШаблона(, ИндексРедактируемойСтроки, ПараметрыОтображенияЭлементов);					
			    ИначеЕсли СтрокаДействие.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки ИЛИ СтрокаДействие.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки Тогда 
					УстановитьСвойстваЭлементамДействийПоСделкам(, ИндексСтроки, ПараметрыОтображенияЭлементов);
				ИначеЕсли СтрокаДействие.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота Тогда 
					УстановитьСвойстваЭлементамДействийПоЧатБотам(, ИндексСтроки, ПараметрыОтображенияЭлементов);
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам строки действий
//
// Параметры:
//  ЭлементФормы					 - 	 - 
//  ИндексРедактируемойСтроки		 - 	 - 
//  ПараметрыОтображенияЭлементов	 - 	 - 
//
Процедура УстановитьСвойстваЭлементамСтрокиДействий(ЭлементФормы = Неопределено, ИндексСтроки, ПараметрыОтображенияЭлементов = Неопределено) Экспорт

	// Актуализируем параметры отрисовки
	Если ПараметрыОтображенияЭлементов = Неопределено Тогда 
		ПараметрыОтображенияЭлементов 	= ИнициализироватьСтруктуруПараметровОтрисовки(Ложь);
		МассивАктуальныхСтрок 			= Объект.Действия.НайтиСтроки(Новый Структура("Удалено", Ложь));		
		ПараметрыОтображенияЭлементов.Вставить("ЭтоПерваяАктуальнаяСтрока", ?(МассивАктуальныхСтрок.Количество() = 0, Истина, ИндексСтроки = Объект.Действия.Индекс(МассивАктуальныхСтрок[0])));
		//Если НЕ ПараметрыОтображенияЭлементов.Свойство("ЦветСтроки") Тогда 
		//	 ПараметрыОтображенияЭлементов.Вставить("ЦветСтроки", ОпределитьЦветСтроки(ИндексСтроки));
		//КонецЕсли;	 
	КонецЕсли;
	
	ПоискЭлемента = ЭлементФормы = Неопределено;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ГруппаСтрока_ТЧ_Действия_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;	
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ГруппаСтрока_ТЧ_Действия_Индекс_" + Строка(ИндексСтроки) Тогда 		
			ЭлементФормы.Доступность = Объект.Активно;
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ИспользованиеДействия_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;			
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ИспользованиеДействия_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Видимость 		= ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидДействия) ИЛИ ПараметрыОтображенияЭлементов.ТабличнаяЧастьСодержитОднуАктуальнуюСтроку ИЛИ ПараметрыОтображенияЭлементов.ЭтоПерваяАктуальнаяСтрока;
			ЭлементФормы.Доступность 	= Объект.Активно; // И ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.ВидДействия);			
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;				
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ВидДействия_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;					
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ВидДействия_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Доступность = Объект.Активно И (Объект.Действия[ИндексСтроки].Использование ИЛИ НЕ (ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидДействия) ИЛИ ПараметрыОтображенияЭлементов.ТабличнаяЧастьСодержитОднуАктуальнуюСтроку ИЛИ ПараметрыОтображенияЭлементов.ЭтоПерваяАктуальнаяСтрока) ИЛИ ПараметрыОтображенияЭлементов.ТабличнаяЧастьСодержитОднуАктуальнуюСтроку);
			// Актуализируем список выбора
			ЭлементФормы.СписокВыбора.Очистить();
			ЭлементФормы.СписокВыбора.Добавить(Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение	, , Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение);			
			ЭлементФормы.СписокВыбора.Добавить(Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо		, , Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо);			
			ЭлементФормы.СписокВыбора.Добавить(Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру		, , Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру);
			//ЭлементФормы.СписокВыбора.Добавить(Перечисления.ВариантыДействийТриггерныхСобытий.СообщениеSMS			, , Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.СообщениеSMS);
			//ЭлементФормы.СписокВыбора.Добавить(Перечисления.ВариантыДействийТриггерныхСобытий.СообщениеВМесенджер	, , Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.СообщениеВМесенджер);
			Если ПараметрыОтображенияЭлементов.РазрешенаРаботаСоСделками Тогда 	
				ЭлементФормы.СписокВыбора.Добавить(Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки, , Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки);
				//ЭлементФормы.СписокВыбора.Добавить(Перечисления.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки, , Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки);
			КонецЕсли;
			Если ПараметрыОтображенияЭлементов.РазрешенаРаботаСЧатБотом И ПараметрыОтображенияЭлементов.ИспользуетсяРасширениеМессенджер Тогда 
				ЭлементФормы.СписокВыбора.Добавить(Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота, , Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота);
			КонецЕсли;	
			Если ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидДействия) И ЭлементФормы.СписокВыбора.НайтиПоЗначению(Объект.Действия[ИндексСтроки].ВидДействия) = Неопределено Тогда 
				ЭлементФормы.СписокВыбора.Добавить(Объект.Действия[ИндексСтроки].ВидДействия						, , Истина);				
				ЭлементФормы.Доступность = Ложь;				
				Объект.Действия[ИндексСтроки].Использование = Ложь;
				ЭлементФормы_ИспользованиеДействия = Элементы.Найти("ИспользованиеДействия_Индекс_" + Строка(ИндексСтроки));
				Если НЕ ЭлементФормы_ИспользованиеДействия = Неопределено Тогда
					ЭлементФормы_ИспользованиеДействия.Доступность = Ложь;
				КонецЕсли;	
			КонецЕсли;	
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;				
		КонецЕсли;	
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ГруппаОписаниеДействия_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;					
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ГруппаОписаниеДействия_Индекс_" + Строка(ИндексСтроки) Тогда			
			ЭлементФормы.Видимость 		= Объект.Действия[ИндексСтроки].Использование ИЛИ ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидДействия) ИЛИ ПараметрыОтображенияЭлементов.ТабличнаяЧастьСодержитОднуАктуальнуюСтроку;
			ЭлементФормы.Доступность 	= Объект.Активно И Объект.Действия[ИндексСтроки].Использование И ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидДействия);
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;				
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ОписаниеДействия_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;					
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ОписаниеДействия_Индекс_" + Строка(ИндексСтроки) Тогда			
			Если ПоискЭлемента Тогда
				Справочники.ТриггерныеСобытия.СформироватьОписаниеДействия(Объект.Действия[ИндексСтроки]);
			Иначе 	
				Возврат;
			КонецЕсли;				
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ОткрытьШаблонДействия_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;					
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ОткрытьШаблонДействия_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Видимость 		= ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидДействия) И НЕ (Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота ИЛИ Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки ИЛИ Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки);
			ЭлементФормы.Доступность 	= Объект.Активно И Объект.Действия[ИндексСтроки].Использование И ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидДействия) И ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ШаблонСообщения);
			ЭлементФормы.Заголовок 		= ?(ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ШаблонСообщения), НСтр("ru = 'Шаблон'; en = 'Template'"), НСтр("ru = '<Шаблон не указан>'; en = '<Template not specified>'"));			
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;				
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("Группа_Удаления_СтрокаТЧ_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;							
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "Группа_Удаления_СтрокаТЧ_Индекс_" + Строка(ИндексСтроки) Тогда						
			ЭлементФормы.Видимость 		= Объект.Действия[ИндексСтроки].Использование ИЛИ ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидДействия) ИЛИ ПараметрыОтображенияЭлементов.ТабличнаяЧастьСодержитОднуАктуальнуюСтроку;
			ЭлементФормы.Доступность 	= Объект.Активно;
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;				
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ВсплывающаяГруппаПараметровДействия_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;									
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ВсплывающаяГруппаПараметровДействия_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Видимость 		= Истина;
			ЭлементФормы.Доступность 	= ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидДействия);
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;				
		КонецЕсли;	
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ГруппаВыбораИсполнителяЗадачи_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;									
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ГруппаВыбораИсполнителяЗадачи_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Видимость = Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру;
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;				
		КонецЕсли;	
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ГруппаВыбораПолучателяСообщения_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;									
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ГруппаВыбораПолучателяСообщения_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Видимость = Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение ИЛИ Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо;
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;				
		КонецЕсли;	
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ГруппаВыбораАккаунтаОтправки_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;									
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ГруппаВыбораАккаунтаОтправки_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Видимость = Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение;
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;				
		КонецЕсли;	
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ГруппаВыбораАккаунтаОтправкиEmail_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;									
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ГруппаВыбораАккаунтаОтправкиEmail_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Видимость = Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо;
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;				
		КонецЕсли;	
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ГруппаНастроекДействийПоСделкам_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;									
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ГруппаНастроекДействийПоСделкам_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Видимость = Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки ИЛИ Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки;
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;				
		КонецЕсли;	
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ГруппаНастроекДействийПоСценариямЧатБота_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;									
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ГруппаНастроекДействийПоСценариямЧатБота_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Видимость = Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота;
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;				
		КонецЕсли;	
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ВзаимодействиеРежимНапоминания_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;					
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ВзаимодействиеРежимНапоминания_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Видимость 		= ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидДействия) И Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру;
			ЭлементФормы.Доступность 	= Объект.Активно И Объект.Действия[ИндексСтроки].Использование И ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидДействия);
			
			НайденноеЗначение = ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.НайтиПоЗначению(Объект.Действия[ИндексСтроки].ЗадачаРежимНапоминания);
			Если НайденноеЗначение = Неопределено Тогда
				Объект.Действия[ИндексСтроки].ЗадачаРежимНапоминания = -1;
				ЭлементФормы.Заголовок = Нстр("ru = 'Не напоминать'; en = 'Don''t remind me'");
				ЭлементФормы.Картинка = БиблиотекаКартинок.НапоминаниеОтключить;	
			Иначе
				Если НайденноеЗначение.Значение = -1 Тогда 
					ЭлементФормы.Заголовок = Нстр("ru = 'Не напоминать'; en = 'Do not remind'");
					ЭлементФормы.Картинка = БиблиотекаКартинок.НапоминаниеОтключить;						
				Иначе 	
					ЭлементФормы.Заголовок = Нстр("ru = 'Напомнить '; en = 'Remind me '") + НайденноеЗначение.Представление;
					ЭлементФормы.Картинка = БиблиотекаКартинок.Напомнить;					
				КонецЕсли;	
			КонецЕсли;	
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;				
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ГруппаВыбораШаблона_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;									
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ГруппаВыбораШаблона_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Видимость = Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру ИЛИ Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение ИЛИ Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо;
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;				
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам исполнителей
//
Процедура УстановитьСвойстваЭлементамИсполнителей(Знач ЭлементФормы = Неопределено, ИндексСтроки, ПараметрыОтображенияЭлементов = Неопределено) Экспорт
	
	// Актуализируем параметры отрисовки
	Если ПараметрыОтображенияЭлементов = Неопределено Тогда 
		ПараметрыОтображенияЭлементов 	= ИнициализироватьСтруктуруПараметровОтрисовки(Ложь);
		МассивАктуальныхСтрок 			= Объект.Действия.НайтиСтроки(Новый Структура("Удалено", Ложь));		
		ПараметрыОтображенияЭлементов.Вставить("ЭтоПерваяАктуальнаяСтрока", ?(МассивАктуальныхСтрок.Количество() = 0, Истина, ИндексСтроки = Объект.Действия.Индекс(МассивАктуальныхСтрок[0])));
	КонецЕсли;
	
	ПоискЭлемента = ?(ЭлементФормы = Неопределено, Истина, Ложь);
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ГруппаВыбораИсполнителяЗадачи_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;	
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ГруппаВыбораИсполнителяЗадачи_Индекс_" + Строка(ИндексСтроки) Тогда 		
			ЭлементФормы.Видимость = ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидДействия) И Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру;
			Если НЕ ПоискЭлемента ИЛИ НЕ ЭлементФормы.Видимость Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ВидИсполнителя_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;		
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ВидИсполнителя_Индекс_" + Строка(ИндексСтроки) Тогда 		
			ЭлементФормы.СписокВыбора.Очистить();
			
			//// Добавим в качестве адресата тренера занятия	
			//Если ПараметрыОтображенияЭлементов.ВиртуальнаяГруппаСобытий = "СобытияПоЗаписям" И ПараметрыОтображенияЭлементов.РазрешенаРаботаСоСделками = Ложь Тогда
			//	ЭлементФормы.СписокВыбора.Добавить(Перечисления.ВидыАдресатов.ВрачПриема					, , Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.ВрачПриема);
			//КонецЕсли;
			
			// Добавим основных адресатов
			Если Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру Тогда
				Если НЕ ПараметрыОтображенияЭлементов.ВариантыУсловийТриггерныхСобытий = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаявкаНеОбработана Тогда
					// Врачам задачи не ставим	
					//Если ПараметрыОтображенияЭлементов.ВиртуальнаяГруппаСобытий = "СобытияПоЗаписям" Тогда
					//	ЭлементФормы.СписокВыбора.Добавить(Перечисления.ВидыАдресатов.ВрачПриема				, , Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.ВрачПриема);
					//КонецЕсли;
					
					ЭлементФормы.СписокВыбора.Добавить(Перечисления.ВидыАдресатов.Куратор						, , Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.Куратор);
					ЭлементФормы.СписокВыбора.Добавить(Перечисления.ВидыАдресатов.Сотрудник						, , Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник);
					ЭлементФормы.СписокВыбора.Добавить(Перечисления.ВидыАдресатов.СегментСотрудников			, , Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.СегментСотрудников);
				Иначе 
					ЭлементФормы.СписокВыбора.Добавить(Перечисления.ВидыАдресатов.Сотрудник						, , Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник);
					ЭлементФормы.СписокВыбора.Добавить(Перечисления.ВидыАдресатов.СегментСотрудников			, , Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.СегментСотрудников);
				КонецЕсли;
				Если ЭлементФормы.СписокВыбора.НайтиПоЗначению(Объект.Действия[ИндексСтроки].ВидАдресата) = Неопределено Тогда 
					Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.ПустаяСсылка();
				КонецЕсли;					
			КонецЕсли;
			
			Если Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.ВрачПриема Тогда 
				ЭлементФормы.Ширина = 0;
				ЭлементФормы.МаксимальнаяШирина = 0;
			Иначе 
				ЭлементФормы.Ширина = 22;
				ЭлементФормы.МаксимальнаяШирина = 22;
			КонецЕсли;
			
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ВидИсполнителяРезервный_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;			
	Если НЕ ЭлементФормы = Неопределено Тогда 
		Если ЭлементФормы.Имя = "ВидИсполнителяРезервный_Индекс_" + Строка(ИндексСтроки) Тогда 		
			ЭлементФормы.Видимость = Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.Куратор;
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("Исполнитель_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;				
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "Исполнитель_Индекс_" + Строка(ИндексСтроки) Тогда 				
			ЭлементФормы.Видимость = НЕ Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.КонтрагентСобытия И НЕ Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.ВрачПриема;// И ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидАдресата);
			Если ЭлементФормы.Видимость Тогда 
				МассивТипов = Новый Массив();
				ЭлементФормы.Доступность = Истина;			
				Если Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник Тогда 
					МассивТипов.Добавить(Тип("СправочникСсылка.Сотрудники"));
				ИначеЕсли Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.СегментСотрудников Тогда 
					МассивТипов.Добавить(Тип("СправочникСсылка.СегментыСотрудников"));
				ИначеЕсли Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.Куратор Тогда	
					Если Объект.Действия[ИндексСтроки].ВидАдресатаРезервный = Перечисления.ВидыАдресатов.Сотрудник Тогда 
						МассивТипов.Добавить(Тип("СправочникСсылка.Сотрудники"));
					ИначеЕсли Объект.Действия[ИндексСтроки].ВидАдресатаРезервный = Перечисления.ВидыАдресатов.СегментСотрудников Тогда 
						МассивТипов.Добавить(Тип("СправочникСсылка.СегментыСотрудников"));
					Иначе
						ЭлементФормы.Доступность = Ложь;					
						МассивТипов.Добавить(Тип("СправочникСсылка.Сотрудники"));
						МассивТипов.Добавить(Тип("СправочникСсылка.СегментыСотрудников"));
					КонецЕсли;
				Иначе
					ЭлементФормы.Доступность = Ложь;					
					МассивТипов.Добавить(Тип("СправочникСсылка.Сотрудники"));
				КонецЕсли;
				НашеОписание = Новый ОписаниеТипов(МассивТипов);
				ЭлементФормы.ОграничениеТипа = НашеОписание;
				Если НЕ МассивТипов.Найти(Тип("СправочникСсылка.Сотрудники")) = Неопределено Тогда 
					ЭлементФормы.ПодсказкаВвода = ?(ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидАдресата), "Сотрудник", "Исполнитель");
					ЭлементФормы.Подсказка 		= Нстр("ru = 'Укажите исполнителя задачи'; en = 'Specify the task performer'"); 
				ИначеЕсли НЕ МассивТипов.Найти(Тип("СправочникСсылка.СегментыСотрудников")) = Неопределено Тогда 
					ЭлементФормы.ПодсказкаВвода = "Сегмент сотрудников";
					ЭлементФормы.Подсказка 		= Нстр("ru = 'Укажите сегмент исполнителей задачи'; en = 'Specify the segment of task performers'");			
				КонецЕсли;
				
				Объект.Действия[ИндексСтроки].Адресат = НашеОписание.ПривестиЗначение(Объект.Действия[ИндексСтроки].Адресат);
				Если НЕ ПоискЭлемента Тогда 
					Возврат;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ОписаниеДействия_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;					
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ОписаниеДействия_Индекс_" + Строка(ИндексСтроки) Тогда			
			Если ПоискЭлемента Тогда
				Справочники.ТриггерныеСобытия.СформироватьОписаниеДействия(Объект.Действия[ИндексСтроки]);
			Иначе 	
				Возврат;
			КонецЕсли;				
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам получателя сообщения
//
// Параметры:
//  ЭлементФормы					 - 	 - 
//  ИндексСтроки					 - 	 - 
//  ПараметрыОтображенияЭлементов	 - 	 - 
//
Процедура УстановитьСвойстваЭлементамПолучателяСообщения(Знач ЭлементФормы = Неопределено, ИндексСтроки, ПараметрыОтображенияЭлементов = Неопределено) Экспорт
	
	// Актуализируем параметры отрисовки
	Если ПараметрыОтображенияЭлементов = Неопределено Тогда 
		ПараметрыОтображенияЭлементов 	= ИнициализироватьСтруктуруПараметровОтрисовки(Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение);
		МассивАктуальныхСтрок 			= Объект.Действия.НайтиСтроки(Новый Структура("Удалено", Ложь));		
		ПараметрыОтображенияЭлементов.Вставить("ЭтоПерваяАктуальнаяСтрока", ?(МассивАктуальныхСтрок.Количество() = 0, Истина, ИндексСтроки = Объект.Действия.Индекс(МассивАктуальныхСтрок[0])));
	КонецЕсли;
	
	ПоискЭлемента = ?(ЭлементФормы = Неопределено, Истина, Ложь);
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ГруппаВыбораПолучателяСообщения_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;	
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ГруппаВыбораПолучателяСообщения_Индекс_" + Строка(ИндексСтроки) Тогда 		
			ЭлементФормы.Видимость = ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидДействия) И (Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение ИЛИ Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо);
			Если НЕ ПоискЭлемента ИЛИ НЕ ЭлементФормы.Видимость Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ВидПолучателя_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;		
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ВидПолучателя_Индекс_" + Строка(ИндексСтроки) Тогда 		
			ЭлементФормы.СписокВыбора.Очистить();                                                                                                                                  
			
			// Добавим основных адресатов
			Если Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение ИЛИ Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо Тогда 
				Если НЕ ПараметрыОтображенияЭлементов.ВариантыУсловийТриггерныхСобытий = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаявкаНеОбработана Тогда 
					ЭлементФормы.СписокВыбора.Добавить(Перечисления.ВидыАдресатов.КонтрагентСобытия				, , Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.КонтрагентСобытия);				
					// Добавим в качестве адресата врача приема	
					Если ПараметрыОтображенияЭлементов.ВиртуальнаяГруппаСобытий = "СобытияПоЗаписям" Тогда //И ПараметрыОтображенияЭлементов.РазрешенаРаботаСоСделками = Ложь Тогда
						ЭлементФормы.СписокВыбора.Добавить(Перечисления.ВидыАдресатов.ВрачПриема				, , Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.ВрачПриема);
					КонецЕсли;				
					ЭлементФормы.СписокВыбора.Добавить(Перечисления.ВидыАдресатов.Куратор						, , Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.Куратор);
					ЭлементФормы.СписокВыбора.Добавить(Перечисления.ВидыАдресатов.Сотрудник						, , Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник);
				Иначе 
					ЭлементФормы.СписокВыбора.Добавить(Перечисления.ВидыАдресатов.Сотрудник						, , Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник);
				КонецЕсли;
				Если ЭлементФормы.СписокВыбора.НайтиПоЗначению(Объект.Действия[ИндексСтроки].ВидАдресата) = Неопределено Тогда 
					Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.ПустаяСсылка();
				КонецЕсли;					
			КонецЕсли;
			Если Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение Тогда 
				УстановитьСвойстваЭлементамАккаунтаСообщения( , ИндексСтроки, ПараметрыОтображенияЭлементов);
			КонецЕсли;	
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ОписаниеДействия_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;					
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ОписаниеДействия_Индекс_" + Строка(ИндексСтроки) Тогда			
			Если ПоискЭлемента Тогда
				Справочники.ТриггерныеСобытия.СформироватьОписаниеДействия(Объект.Действия[ИндексСтроки]);
			Иначе 	
				Возврат;
			КонецЕсли;				
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("Получатель_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;				
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "Получатель_Индекс_" + Строка(ИндексСтроки) Тогда 				
			ЭлементФормы.Видимость = Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник;// И ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидАдресата);
			Если НЕ ЭлементФормы.Видимость Тогда 
				Возврат;
			КонецЕсли;	
			МассивТипов = Новый Массив();
			МассивТипов.Добавить(Тип("СправочникСсылка.Сотрудники"));
			НашеОписание = Новый ОписаниеТипов(МассивТипов);
			ЭлементФормы.ОграничениеТипа = НашеОписание;
			ЭлементФормы.ПодсказкаВвода = ?(ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидАдресата), "Сотрудник", "Адресат");
			ЭлементФормы.Подсказка 		= Нстр("ru = 'Укажите исполнителя задачи'; en = 'Specify the task performer'");
			Объект.Действия[ИндексСтроки].Адресат = НашеОписание.ПривестиЗначение(Объект.Действия[ИндексСтроки].Адресат);
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ОписаниеДействия_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;					
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ОписаниеДействия_Индекс_" + Строка(ИндексСтроки) Тогда			
			Если ПоискЭлемента Тогда
				Справочники.ТриггерныеСобытия.СформироватьОписаниеДействия(Объект.Действия[ИндексСтроки]);
			Иначе 	
				Возврат;
			КонецЕсли;				
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам аккаунта сообщения
//
// Параметры:
//  ЭлементФормы					 - 	 - 
//  ИндексСтроки					 - 	 - 
//  ПараметрыОтображенияЭлементов	 - 	 - 
//
Процедура УстановитьСвойстваЭлементамАккаунтаСообщения(Знач ЭлементФормы = Неопределено, ИндексСтроки, ПараметрыОтображенияЭлементов = Неопределено) Экспорт
	
	// Актуализируем параметры отрисовки
	Если ПараметрыОтображенияЭлементов = Неопределено Тогда 
		ПараметрыОтображенияЭлементов 	= ИнициализироватьСтруктуруПараметровОтрисовки(Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение, ИндексСтроки);
		МассивАктуальныхСтрок 			= Объект.Действия.НайтиСтроки(Новый Структура("Удалено", Ложь));		
		ПараметрыОтображенияЭлементов.Вставить("ЭтоПерваяАктуальнаяСтрока", ?(МассивАктуальныхСтрок.Количество() = 0, Истина, ИндексСтроки = Объект.Действия.Индекс(МассивАктуальныхСтрок[0])));
	КонецЕсли;
	
	ПоискЭлемента = ?(ЭлементФормы = Неопределено, Истина, Ложь);
	
	МассивСтрокНастроекУведомлений = МоделируемыеНастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия, СтруктурнаяЕдиница", Объект.Действия[ИндексСтроки].ИдентификаторДействия, ТекущаяСтруктурнаяЕдиница));
	Если НЕ МассивСтрокНастроекУведомлений.Количество() = 0 Тогда
		// Конвертируем элемент коллекции в структуру, так как невозможен обмен Клиент/Сервер
		СтрокаНастройкиКаналовУведомлений = СтрокуТаблицыЗначенийВСтруктуру(МассивСтрокНастроекУведомлений[0], ИменаКолонокМоделируемойТаблицы());
		ПараметрыОтображенияЭлементов.Вставить("СтрокаНастройкиКаналовУведомлений", СтрокаНастройкиКаналовУведомлений);
	КонецЕсли;

	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ГруппаВыбораАккаунтаОтправки_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;	
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ГруппаВыбораАккаунтаОтправки_Индекс_" + Строка(ИндексСтроки) Тогда 		
			ЭлементФормы.Видимость = ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидДействия) И Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение;
			Если НЕ ПоискЭлемента ИЛИ НЕ ЭлементФормы.Видимость Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ГруппаВыбораАккаунтаОтправкиEmail_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;	
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ГруппаВыбораАккаунтаОтправкиEmail_Индекс_" + Строка(ИндексСтроки) Тогда 		
			ЭлементФормы.Видимость = ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидДействия) И Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо;
			Если НЕ ПоискЭлемента  Тогда //ИЛИ НЕ ЭлементФормы.Видимость Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ОтправкаPush_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;			
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ОтправкаPush_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Доступность = ПараметрыОтображенияЭлементов.ПараметрыРассылки.ОтправкаPush И (Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.КонтрагентСобытия ИЛИ НЕ ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидАдресата));
			ЭлементФормы.Заголовок = ?(ЭлементФормы.Доступность, Нстр("ru = 'Push уведомления'; en = 'Push notifications'"), Нстр("ru = 'Push уведомления (не доступно)'; en = 'Push notifications (not available)'"));
			ЭлементФормы.ЦветТекстаЗаголовка = ?(ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.ОтправкаPush, Новый Цвет(), Новый Цвет(153, 153, 153));
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;				
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ОтправкаPushWallet_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;			
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ОтправкаPushWallet_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Доступность = ПараметрыОтображенияЭлементов.ПараметрыРассылки.ОтправкаPushWallet И (Объект.Действия[ИндексСтроки].ВидАдресата = Перечисления.ВидыАдресатов.КонтрагентСобытия ИЛИ НЕ ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидАдресата));
			ЭлементФормы.Заголовок = ?(ЭлементФормы.Доступность, Нстр("ru = 'Push (Wallet) уведомления'; en = 'Push (Wallet) notifications'"), Нстр("ru = 'Push (Wallet) уведомления (не доступно)'; en = 'Push (Wallet) notifications (not available)'"));
			ЭлементФормы.ЦветТекстаЗаголовка = ?(ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.ОтправкаPushWallet, Новый Цвет(), Новый Цвет(153, 153, 153));
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;				
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ОтправкаMessenger_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;			
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ОтправкаMessenger_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Доступность = ПараметрыОтображенияЭлементов.ПараметрыРассылки.ОтправкаMessenger И Объект.Действия[ИндексСтроки].ВидАдресата <> Перечисления.ВидыАдресатов.СегментСотрудников;
			//ЭлементФормы.Заголовок = ?(ЭлементФормы.Доступность, Нстр("ru = 'Уведомления в мессенджер'; en = 'Notifications in messenger'"), Нстр("ru = 'Уведомления в мессенджер (не доступно)'; en = 'Notifications in messenger (not available)'"));
			ЭлементФормы.ЦветТекстаЗаголовка = ?(ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.ОтправкаMessenger, Новый Цвет(), Новый Цвет(153, 153, 153));
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;				
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ОтправкаSMS_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;			
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ОтправкаSMS_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Доступность = ПараметрыОтображенияЭлементов.ПараметрыРассылки.ОтправкаSMS;
			ЭлементФормы.Заголовок = ?(ЭлементФормы.Доступность, Нстр("ru = 'Уведомления по sms'; en = 'SMS notifications'"), Нстр("ru = 'Уведомления по sms (не доступно)'; en = 'SMS notifications (not available)'"));
			ЭлементФормы.ЦветТекстаЗаголовка = ?(ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.ОтправкаSMS, Новый Цвет(), Новый Цвет(153, 153, 153));
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;				
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("АккаунтСообщенийМессенджера_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;		
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "АккаунтСообщенийМессенджера_Индекс_" + Строка(ИндексСтроки) Тогда 		
			Если Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение Тогда 
				ЭлементФормы.Видимость 			= Истина;
				ЭлементФормы.Доступность 		= ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.ОтправкаMessenger И ПараметрыОтображенияЭлементов.ПараметрыРассылки.ОтправкаMessenger;// Объект.Действия[ИндексСтроки].ОтправкаMessenger И ПараметрыОтображенияЭлементов.ПараметрыРассылки.ОтправкаMessenger;
				ТипВнешнейСистемы 				= Перечисления.ТипыВнешнихСистем.ПустаяСсылка(); 
				Если ЗначениеЗаполнено(ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы) Тогда 
					МассивСтрокВнешниСистем = ТаблицаВнешнихСистем.НайтиСтроки(Новый Структура("Ссылка", ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы));
					Если НЕ МассивСтрокВнешниСистем.Количество() = 0 Тогда 
						ТипВнешнейСистемы = МассивСтрокВнешниСистем[0].ТипВнешнейСистемы;
					Иначе 
						ТипВнешнейСистемы = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы, "ТипВнешнейСистемы");
					КонецЕсли;
				КонецЕсли;	
				ЭлементФормы.МаксимальнаяШирина = ?(ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Chat2Desk, 25, 46); 
				ЭлементФормы.ОтметкаНезаполненного = ЭлементФормы.Доступность И НЕ ЗначениеЗаполнено(ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы);
				ЭлементФормы.АвтоОтметкаНезаполненного = ЭлементФормы.Доступность И НЕ ЗначениеЗаполнено(ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы);				
				ЭлементФормы.СписокВыбора.Очистить();
				//ЭлементФормы.СписокВыбора.ЗагрузитьЗначения(ПараметрыОтображенияЭлементов.МассивАккаунтовСистемыОтправкиСообщений);
				Для Каждого АккаунтСистемыОтправки Из ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.СписокАккаунтовMessenger Цикл 
					Если Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение И ТипЗнч(АккаунтСистемыОтправки.Значение) = Тип("СправочникСсылка.ВнешниеСистемы") Тогда 
						ЗаполнитьЗначенияСвойств(ЭлементФормы.СписокВыбора.Добавить(), АккаунтСистемыОтправки);
						//ЭлементФормы.СписокВыбора.Добавить(АккаунтСистемыОтправки, , АккаунтСистемыОтправки = Объект.Действия[ИндексСтроки].АккаунтВнешнейСистемы);
					КонецЕсли;	
				КонецЦикла;	
				Если ЗначениеЗаполнено(ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы) Тогда
					ЭлементСписка = ЭлементФормы.СписокВыбора.НайтиПоЗначению(ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы);
					Если ЭлементСписка = Неопределено Тогда
						ЭлементФормы.СписокВыбора.Добавить(ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы, Новый ФорматированнаяСтрока("Аккаунт деактивирован (" + СокрЛП(Строка(ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.АккаунтВнешнейСистемы)) + ")", , Новый Цвет(255, 0, 0)), Истина);						
					Иначе
						ЭлементСписка.Пометка = Истина;
					КонецЕсли;	
				КонецЕсли;
			Иначе 
				ЭлементФормы.Видимость = Ложь;
			КонецЕсли;
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("АккаунтСообщений_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;		
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "АккаунтСообщений_Индекс_" + Строка(ИндексСтроки) Тогда 		
			Если Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение Тогда 
				ЭлементФормы.Видимость 					= Истина;
				ЭлементФормы.Доступность 				= ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.ОтправкаSMS И ПараметрыОтображенияЭлементов.ПараметрыРассылки.ОтправкаSMS;				
				ЭлементФормы.ОтметкаНезаполненного 		= ЭлементФормы.Доступность И НЕ ЗначениеЗаполнено(ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.АккаунтСервисаРассылкиSMS);
				ЭлементФормы.АвтоОтметкаНезаполненного 	= ЭлементФормы.Доступность И НЕ ЗначениеЗаполнено(ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.АккаунтСервисаРассылкиSMS);					
				ЭлементФормы.СписокВыбора.Очистить();
				//ЭлементФормы.СписокВыбора.ЗагрузитьЗначения(ПараметрыОтображенияЭлементов.МассивАккаунтовСистемыОтправкиСообщений);
				Для Каждого АккаунтСистемыОтправки Из ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.СписокАккаунтовSMS Цикл 
					Если Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение И ТипЗнч(АккаунтСистемыОтправки.Значение) = Тип("СправочникСсылка.СервисыРассылки") Тогда 
						ЗаполнитьЗначенияСвойств(ЭлементФормы.СписокВыбора.Добавить(), АккаунтСистемыОтправки);						
						//ЭлементФормы.СписокВыбора.Добавить(АккаунтСистемыОтправки, , АккаунтСистемыОтправки = Объект.Действия[ИндексСтроки].АккаунтSMS);
					КонецЕсли;	
				КонецЦикла;	
				Если ЗначениеЗаполнено(ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.АккаунтСервисаРассылкиSMS) Тогда
					ЭлементСписка = ЭлементФормы.СписокВыбора.НайтиПоЗначению(ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.АккаунтСервисаРассылкиSMS);
					Если ЭлементСписка = Неопределено Тогда
						ЭлементФормы.СписокВыбора.Добавить(ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.АккаунтСервисаРассылкиSMS, Новый ФорматированнаяСтрока("Аккаунт деактивирован (" + СокрЛП(Строка(ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.АккаунтСервисаРассылкиSMS)) + ")", , Новый Цвет(255, 0, 0)), Истина);						
					Иначе
						ЭлементСписка.Пометка = Истина;
					КонецЕсли;	
				КонецЕсли;
				ЭлементФормы.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СервисыРассылки");				
			Иначе 
				ЭлементФормы.Видимость = Ложь;
			КонецЕсли;
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("КаналСистемыСообщений_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;				
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "КаналСистемыСообщений_Индекс_" + Строка(ИндексСтроки) Тогда 				
			ЗаполнитьСписокКаналовСистемыСообщения(ЭлементФормы, ИндексСтроки, ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений);
			ЭлементФормы.Доступность = ПараметрыОтображенияЭлементов.СтрокаНастройкиКаналовУведомлений.ОтправкаMessenger И ПараметрыОтображенияЭлементов.ПараметрыРассылки.ОтправкаMessenger;				
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("АккаунтEmail_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;				
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "АккаунтEmail_Индекс_" + Строка(ИндексСтроки) Тогда 				
			ЭлементФормы.Видимость = Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо;
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ОписаниеДействия_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;					
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ОписаниеДействия_Индекс_" + Строка(ИндексСтроки) Тогда			
			Если ПоискЭлемента Тогда
				Справочники.ТриггерныеСобытия.СформироватьОписаниеДействия(Объект.Действия[ИндексСтроки]);
			Иначе 	
				Возврат;
			КонецЕсли;				
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам действий по сделкам
//
// Параметры:
//  ЭлементФормы					 - 	 - 
//  ИндексСтроки					 - 	 - 
//  ПараметрыОтображенияЭлементов	 - 	 - 
//
Процедура УстановитьСвойстваЭлементамДействийПоСделкам(Знач ЭлементФормы = Неопределено, ИндексСтроки, ПараметрыОтображенияЭлементов = Неопределено) Экспорт 
	
	// Актуализируем параметры отрисовки
	Если ПараметрыОтображенияЭлементов = Неопределено Тогда 
		ПараметрыОтображенияЭлементов 	= ИнициализироватьСтруктуруПараметровОтрисовки(Ложь);
		МассивАктуальныхСтрок 			= Объект.Действия.НайтиСтроки(Новый Структура("Удалено", Ложь));		
		ПараметрыОтображенияЭлементов.Вставить("ЭтоПерваяАктуальнаяСтрока", ?(МассивАктуальныхСтрок.Количество() = 0, Истина, ИндексСтроки = Объект.Действия.Индекс(МассивАктуальныхСтрок[0])));
	КонецЕсли;
	
	ПоискЭлемента = ЭлементФормы = Неопределено;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ГруппаНастроекДействийПоСделкам_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;	
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ГруппаНастроекДействийПоСделкам_Индекс_" + Строка(ИндексСтроки) Тогда 		
			ЭлементФормы.Видимость = ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидДействия) И (Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки ИЛИ Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки);
			Если НЕ ПоискЭлемента ИЛИ НЕ ЭлементФормы.Видимость Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ВидСделки_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;	
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ВидСделки_Индекс_" + Строка(ИндексСтроки) Тогда 
			Справочники.ТриггерныеСобытия.ИнициализироватьОграниченияПоТипуСделки(ЭлементФормы.ПараметрыВыбора, Объект.УсловиеСобытия, Объект.Действия[ИндексСтроки].ВидСделки, Объект.ВидСделки);
			ЭлементФормы.ОтметкаНезаполненного 			= Объект.Активно И Объект.Действия[ИндексСтроки].Использование И (Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки ИЛИ Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки);
			ЭлементФормы.АвтоОтметкаНезаполненного 		= Объект.Активно И Объект.Действия[ИндексСтроки].Использование И (Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки ИЛИ Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки);			
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ЭтапСделки_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;	
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ЭтапСделки_Индекс_" + Строка(ИндексСтроки) Тогда 		
			Если ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидСделки) Тогда
				ЭлементФормы.СписокВыбора.Очистить();		
				МассивЭтапов = Справочники.ЭтапыСделок.ВернутьМассивЭтаповВидаСделки(Объект.Действия[ИндексСтроки].ВидСделки, , Истина);
				Для К = 0 По МассивЭтапов.Количество() - 1 Цикл
					ЭлементФормы.СписокВыбора.Добавить(МассивЭтапов[К], Строка(К + 1) + ". " + Строка(МассивЭтапов[К]), МассивЭтапов[К] = Объект.Действия[ИндексСтроки].ЭтапСделки);
					Если К = МассивЭтапов.Количество() - 1 И ЭлементФормы.СписокВыбора.Количество() <> 0 Тогда
						СписокДопустимыхЗавершающихЭтаповСделок = Новый СписокЗначений;
						Справочники.ТриггерныеСобытия.ИнициализироватьЗавершающиеЭтапыСделок(СписокДопустимыхЗавершающихЭтаповСделок, Объект.УсловиеСобытия);
						Для Каждого ЭлементСписка Из СписокДопустимыхЗавершающихЭтаповСделок Цикл  
							ЭлементФормы.СписокВыбора.Добавить(ЭлементСписка.Значение, Строка(ЭлементФормы.СписокВыбора.Количество() + 1) + ". " + Строка(ЭлементСписка.Значение), ЭлементСписка.Значение = Объект.Действия[ИндексСтроки].ЭтапСделки);
						КонецЦикла;
					КонецЕсли;	
				КонецЦикла;
				Если ЭлементФормы.СписокВыбора.НайтиПоЗначению(Объект.Действия[ИндексСтроки].ЭтапСделки) = Неопределено Тогда 
					Объект.Действия[ИндексСтроки].ЭтапСделки = Справочники.ЭтапыСделок.ПустаяСсылка();
				КонецЕсли;	
			Иначе 	
				ЭлементФормы.СписокВыбора.Очистить();
				Объект.Действия[ИндексСтроки].ЭтапСделки = Справочники.ЭтапыСделок.ПустаяСсылка();
			КонецЕсли;
			ЭлементФормы.Заголовок = ?(Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки, "повысить до", "сменить на");	
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;	
		КонецЕсли;			
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("СоздаватьСделку_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;	
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "СоздаватьСделку_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.ТолькоПросмотр = Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе;
			ЭлементФормы.ЦветТекстаЗаголовка = ?(Объект.Действия[ИндексСтроки].СоздаватьСделку, Новый Цвет(), Новый Цвет(175, 175, 175));
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("КоличествоГенерацийСделок_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;		
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "КоличествоГенерацийСделок_Индекс_" + Строка(ИндексСтроки) Тогда
			ЭлементФормы.Доступность 	= Объект.Действия[ИндексСтроки].СоздаватьСделку;
			ЭлементФормы.ТолькоПросмотр = Объект.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе;			
			ЭлементФормы.Подсказка 		= СтрШаблон(Нстр("ru = 'Создавать новую сделку не более %1 %2'; en = 'Create a new deal no more than %1 time'"), Объект.Действия[ИндексСтроки].КоличествоГенерацийСделок, СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу("Раз", Объект.Действия[ИндексСтроки].КоличествоГенерацийСделок, "Родительный"));		
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;	
		КонецЕсли;			
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ДекорацияИзмерениеКоличества_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;			
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ДекорацияИзмерениеКоличества_Индекс_" + Строка(ИндексСтроки) Тогда		
			ЭлементФормы.Доступность 	= Объект.Действия[ИндексСтроки].СоздаватьСделку;
			//ЭлементФормы.ЦветТекста 	= ?(Объект.Действия[ИндексСтроки].СоздаватьСделку, Новый Цвет(), Новый Цвет(175, 175, 175));			
			ЭлементФормы.Заголовок 		= СтрШаблон(Нстр("ru = '%1'; en = 'time'"), СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу("Раз", Объект.Действия[ИндексСтроки].КоличествоГенерацийСделок, "Родительный"));
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;	
		КонецЕсли;					
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ОписаниеДействия_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;					
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ОписаниеДействия_Индекс_" + Строка(ИндексСтроки) Тогда			
			Если ПоискЭлемента Тогда
				Справочники.ТриггерныеСобытия.СформироватьОписаниеДействия(Объект.Действия[ИндексСтроки]);
			Иначе 	
				Возврат;
			КонецЕсли;				
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам действий по чат ботам
//
// Параметры:
//  ЭлементФормы					 - 	 - 
//  ИндексСтроки					 - 	 - 
//  ПараметрыОтображенияЭлементов	 - 	 - 
//
Процедура УстановитьСвойстваЭлементамДействийПоЧатБотам(Знач ЭлементФормы = Неопределено, ИндексСтроки, ПараметрыОтображенияЭлементов = Неопределено) Экспорт 
	
	// Актуализируем параметры отрисовки
	Если ПараметрыОтображенияЭлементов = Неопределено Тогда 
		ПараметрыОтображенияЭлементов 	= ИнициализироватьСтруктуруПараметровОтрисовки(Ложь);
		МассивАктуальныхСтрок 			= Объект.Действия.НайтиСтроки(Новый Структура("Удалено", Ложь));		
		ПараметрыОтображенияЭлементов.Вставить("ЭтоПерваяАктуальнаяСтрока", ?(МассивАктуальныхСтрок.Количество() = 0, Истина, ИндексСтроки = Объект.Действия.Индекс(МассивАктуальныхСтрок[0])));
	КонецЕсли;
	
	ПоискЭлемента = ЭлементФормы = Неопределено;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ГруппаНастроекДействийПоСценариямЧатБота_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;	
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ГруппаНастроекДействийПоСценариямЧатБота_Индекс_" + Строка(ИндексСтроки) Тогда 		
			ЭлементФормы.Видимость = ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидДействия) И Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота;
			Если НЕ ПоискЭлемента ИЛИ НЕ ЭлементФормы.Видимость Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("СценарийЧатБота_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;	
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "СценарийЧатБота_Индекс_" + Строка(ИндексСтроки) Тогда 
			Справочники.ТриггерныеСобытия.ИнициализироватьОграниченияПоДоступнымСценариям(ЭлементФормы.ПараметрыВыбора, Объект.УсловиеСобытия, ПараметрыОтображенияЭлементов.МассивДоступныхСценариев);
			Если ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].СценарийЧатБота) И ПараметрыОтображенияЭлементов.МассивДоступныхСценариев.Найти(Объект.Действия[ИндексСтроки].СценарийЧатБота) = Неопределено Тогда 
				ЭлементФормы.ЦветТекста 				= Новый Цвет(255, 0, 0);
			Иначе 
				ЭлементФормы.ЦветТекста 				= Новый Цвет();
			КонецЕсли;	
			ЭлементФормы.ОтметкаНезаполненного 			= Объект.Активно И Объект.Действия[ИндексСтроки].Использование И Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота;
			ЭлементФормы.АвтоОтметкаНезаполненного 		= Объект.Активно И Объект.Действия[ИндексСтроки].Использование И Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота;			
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
		
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ОписаниеДействия_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;					
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ОписаниеДействия_Индекс_" + Строка(ИндексСтроки) Тогда			
			Если ПоискЭлемента Тогда
				Справочники.ТриггерныеСобытия.СформироватьОписаниеДействия(Объект.Действия[ИндексСтроки]);
			Иначе 	
				Возврат;
			КонецЕсли;				
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам шаблона
//
// Параметры:
//  ЭлементФормы					 - 	 - 
//  ИндексСтроки					 - 	 - 
//  ПараметрыОтображенияЭлементов	 - 	 - 
//
Процедура УстановитьСвойстваЭлементамШаблона(Знач ЭлементФормы = Неопределено, ИндексСтроки, ПараметрыОтображенияЭлементов = Неопределено) Экспорт 
	
	// Актуализируем параметры отрисовки
	Если ПараметрыОтображенияЭлементов = Неопределено Тогда 
		ПараметрыОтображенияЭлементов 	= ИнициализироватьСтруктуруПараметровОтрисовки(Ложь);
		МассивАктуальныхСтрок 			= Объект.Действия.НайтиСтроки(Новый Структура("Удалено", Ложь));		
		ПараметрыОтображенияЭлементов.Вставить("ЭтоПерваяАктуальнаяСтрока", ?(МассивАктуальныхСтрок.Количество() = 0, Истина, ИндексСтроки = Объект.Действия.Индекс(МассивАктуальныхСтрок[0])));
	КонецЕсли;
	
	ПоискЭлемента = ЭлементФормы = Неопределено;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ГруппаВыбораШаблона_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;	
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ГруппаВыбораШаблона_Индекс_" + Строка(ИндексСтроки) Тогда 		
			ЭлементФормы.Видимость = ЗначениеЗаполнено(Объект.Действия[ИндексСтроки].ВидДействия) И (Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру ИЛИ Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение ИЛИ Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо);
			Если Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру Тогда 
				ЭлементФормы.Заголовок = НСтр("ru='Укажите шаблон для описания задачи';en='Specify a template for the task description'");
			ИначеЕсли Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение Тогда 
				ЭлементФормы.Заголовок = НСтр("ru='Укажите шаблон сообщения';en='Specify the message template'");
			ИначеЕсли Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо Тогда 
				ЭлементФормы.Заголовок = НСтр("ru='Укажите шаблон электронного письма';en='Specify the email template'");
			Иначе 
				ЭлементФормы.Заголовок = НСтр("ru='Укажите шаблон';en='Specify a template'");
			КонецЕсли;	
			Если НЕ ПоискЭлемента ИЛИ НЕ ЭлементФормы.Видимость Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискЭлемента Тогда 
		ЭлементФормы = Элементы.Найти("ШаблонСообщения_Индекс_" + Строка(ИндексСтроки));
	КонецЕсли;	
	Если НЕ ЭлементФормы = Неопределено Тогда
		Если ЭлементФормы.Имя = "ШаблонСообщения_Индекс_" + Строка(ИндексСтроки) Тогда
			Если Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру Тогда 
				ЭлементФормы.ПодсказкаВвода = НСтр("ru='Шаблон для описания задачи';en='Template for the task description'");
			ИначеЕсли Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение Тогда 
				ЭлементФормы.ПодсказкаВвода = НСтр("ru='Шаблон сообщения';en='Message template'");
			ИначеЕсли Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо Тогда 
				ЭлементФормы.ПодсказкаВвода = НСтр("ru='Шаблон электронного письма';en='Email template'");
			Иначе 
				ЭлементФормы.ПодсказкаВвода = НСтр("ru='Шаблон';en='Template'");
			КонецЕсли;				
			ЭлементФормы.ОтметкаНезаполненного 			= Объект.Активно И Объект.Действия[ИндексСтроки].Использование И (Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру ИЛИ Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение ИЛИ Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо);
			ЭлементФормы.АвтоОтметкаНезаполненного 		= Объект.Активно И Объект.Действия[ИндексСтроки].Использование И (Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру ИЛИ Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение ИЛИ Объект.Действия[ИндексСтроки].ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо);			
			Если НЕ ПоискЭлемента Тогда 
				Возврат;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - Закешировать текущие значения объекта
// 
// Возвращаемое значение:
//   - 
//
Функция ЗакешироватьТекущиеЗначенияОбъекта();
	
	СтруктураРеквизитов = Новый Структура();
	
	РеквизитыОбъекта 			= Объект.Ссылка.Метаданные().Реквизиты;
	РеквизитыОбъектаСтандартные = Объект.Ссылка.Метаданные().СтандартныеРеквизиты;
	Для Каждого РеквизитФормы Из РеквизитыОбъекта Цикл 
		СтруктураРеквизитов.Вставить(РеквизитФормы.Имя, Объект[РеквизитФормы.Имя]);
	КонецЦикла;
	Для Каждого РеквизитФормы Из РеквизитыОбъектаСтандартные Цикл
		Если РеквизитФормы.Имя = "Наименование" Тогда 
			СтруктураРеквизитов.Вставить(РеквизитФормы.Имя, Объект[РеквизитФормы.Имя]);
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаСервере
// Процедура - Сформировать описание триггерного события
//
Процедура СформироватьОписаниеТриггерногоСобытия()
	
	СписокОписаний = ОбщегоНазначенияПовтИсп.ПолучитьОписанияТриггеров();			
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Объект.Описание)) Тогда 
		ЭлементСпискаОписания = СписокОписаний.НайтиПоЗначению(Объект.УсловиеСобытия);
		Если ЭлементСпискаОписания <> Неопределено Тогда 
			Объект.Описание = ЭлементСпискаОписания.Представление; 
		КонецЕсли;
	Иначе 
		Для Каждого ЭлементСпискаОписания Из СписокОписаний Цикл 
			Если СтрЗаменить(СокрЛП(Объект.Описание), ".", "") = СтрЗаменить(ЭлементСпискаОписания.Представление, ".", "") И ЭлементСпискаОписания.Значение <> Объект.УсловиеСобытия Тогда 
				ЭлементСпискаОписания = СписокОписаний.НайтиПоЗначению(Объект.УсловиеСобытия);
				Если ЭлементСпискаОписания <> Неопределено Тогда
					Объект.Описание = ЭлементСпискаОписания.Представление;
				Иначе 
					Объект.Описание = "";
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
	СформироватьДекорациюОписаниеТриггерногоСобытия();
	
КонецПроцедуры

&НаСервере
// Процедура - Сформировать декорацию описание триггерного события
//
Процедура СформироватьДекорациюОписаниеТриггерногоСобытия()

	Если НЕ ЗначениеЗаполнено(СокрЛП(Объект.Описание)) Тогда
		МассивФорматированныхСтрок = Новый Массив;
		МассивФорматированныхСтрок.Добавить(Новый ФорматированнаяСтрока("Описание отсутствует "));
		МассивФорматированныхСтрок.Добавить(Новый ФорматированнаяСтрока("Добавить", , Новый Цвет(159, 136, 78), , "ПоказатьПолноеОписаниеДляРедактирования"));
		Элементы.ДекорацияОписаниеТриггерногоСобытия.Заголовок = Новый ФорматированнаяСтрока(МассивФорматированныхСтрок);
	Иначе 	
		МассивФорматированныхСтрок = Новый Массив;
		МассивФорматированныхСтрок.Добавить(Новый ФорматированнаяСтрока(Лев(СокрЛП(Объект.Описание), 220) + "... "));
		МассивФорматированныхСтрок.Добавить(Новый ФорматированнаяСтрока("Подробнее", , Новый Цвет(159, 136, 78), , "ПоказатьПолноеОписаниеДляРедактирования"));
		Элементы.ДекорацияОписаниеТриггерногоСобытия.Заголовок = Новый ФорматированнаяСтрока(МассивФорматированныхСтрок);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - Сохранить таблицу актуализации триггеров
//
// Параметры:
//  ТаблицаАктуализацииТриггеров - 	 - 
//
Процедура СохранитьТаблицуАктуализацииТриггеров(Знач ТаблицаАктуализацииТриггеров)
	
	УстановитьПривилегированныйРежим(Истина);	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("Справочник.ТриггерныеСобытия.Форма.ФормаЭлемента", "НастройкиОбновленияТриггеров", ТаблицаАктуализацииТриггеров.Выгрузить());
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
// Процедура - Загрузить таблицу актуализации триггеров
//
Процедура ЗагрузитьТаблицуАктуализацииТриггеров()
	
	УстановитьПривилегированныйРежим(Истина);
	НастройкиОбновленияТриггеров = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить("Справочник.ТриггерныеСобытия.Форма.ФормаЭлемента", "НастройкиОбновленияТриггеров");
	Если НЕ НастройкиОбновленияТриггеров = Неопределено И ТипЗнч(НастройкиОбновленияТриггеров) = Тип("ТаблицаЗначений") Тогда 
		ТаблицаАктуализацииТриггеров.Загрузить(НастройкиОбновленияТриггеров);
	КонецЕсли;	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
// Процедура - Загрузить список внешних систем
//
Процедура ЗагрузитьСписокВнешнихСистем()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВнешниеСистемы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	               |ГДЕ
	               |	ВнешниеСистемы.ПометкаУдаления = ЛОЖЬ
	               |	И ВнешниеСистемы.Используется = ИСТИНА
	               |	И ВнешниеСистемы.ТипВнешнейСистемы В (ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.ВиджетОнлайнЗаписи))";
	
	МассивПараметров 		= Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ПометкаУдаления", Ложь));
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ВнешняяСистема", Новый ФиксированныйМассив(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"))));
	
	Элементы.ИсточникЗаписи.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
		
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Пустое содержание шаблона
//
// Параметры:
//  ШаблонСообщения	 - 	 - 
//  ИмяРеквизита	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПустоеСодержаниеШаблона(ШаблонСообщения, ИмяРеквизита = "", ВидДействия = Неопределено, Сообщение = "")
	
	ИмяРеквизитаПроверки2 = "";
	Если НЕ ЗначениеЗаполнено(ВидДействия) Тогда 
		ИмяРеквизитаПроверки = ИмяРеквизита;
	Иначе 
		Если ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру Тогда 
			ИмяРеквизитаПроверки = "ЗадачаОписание";
			Сообщение = НСтр("ru='Необходимо заполнить содержание в шаблоне для описания задачи!';en='You must fill in the content in the template for the task description!'")
		ИначеЕсли ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо Тогда	
			ИмяРеквизитаПроверки = "ТекстHTML";
			Сообщение = НСтр("ru='Необходимо заполнить содержание в шаблоне для электронного письма!';en='You must fill in the content in the email template!'")			
		ИначеЕсли ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки Тогда
			ИмяРеквизитаПроверки = "";
		Иначе 
			ИмяРеквизитаПроверки = "Содержание";
			ИмяРеквизитаПроверки2 = "СодержаниеМессенджер";			
			Сообщение = НСтр("ru='Необходимо заполнить содержание в шаблоне для генерируемых сообщений!';en='You must fill in the content in the template for generated messages!'")
		КонецЕсли;	
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ИмяРеквизитаПроверки) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ПустоеСодержание = Ложь;
	Попытка
		Если ИмяРеквизитаПроверки = "ТекстHTML" Тогда 
			ПарсерHTML 						= Новый ЧтениеHTML;
			ПарсерHTML.УстановитьСтроку(ШаблонСообщения[ИмяРеквизитаПроверки]);
			ПостроительDOM 					= Новый ПостроительDOM;
			ДокументHTML 					= ПостроительDOM.Прочитать(ПарсерHTML);
			ПустоеСодержание = ДокументHTML.Тело = Неопределено;
			Если ДокументHTML.Тело = Неопределено Тогда 
				Возврат Истина;
			Иначе 	
				Возврат ПустаяСтрока(СокрЛП(ДокументHTML.Тело.ТекстовоеСодержимое));
			КонецЕсли;	
		Иначе 	
			ПустоеСодержание = НЕ ЗначениеЗаполнено(СокрЛП(ШаблонСообщения[ИмяРеквизитаПроверки])) И НЕ ЗначениеЗаполнено(СокрЛП(ШаблонСообщения[ИмяРеквизитаПроверки2]));
		КонецЕсли;	
	Исключение
		
	КонецПопытки;
	
	Возврат ПустоеСодержание;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Действие зарегистрировано
//
// Параметры:
//  ИдентификаторДействия	 - 	 - 
//  СтандартнаяОбработка	 - 	 - 
//  СсылкаНаОбъектПустая	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ДействиеЗарегистрировано(ИдентификаторДействия, ВидДействия, СтандартнаяОбработка = Истина, СсылкаНаОбъект = Неопределено)
	
	ФлагРегистрацииДействия = Ложь;
	ВидДействияИзЖурналаРегистрации = ВидДействия;
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда 
		ФлагРегистрацииДействия = РегистрыСведений.ЖурналРегистрацииТриггерныхСобытий.ДействиеЗарегистрировано(ИдентификаторДействия, ВидДействияИзЖурналаРегистрации); 
		СтандартнаяОбработка 	= НЕ ФлагРегистрацииДействия;
	КонецЕсли;	
	
	Если ФлагРегистрацииДействия Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТриггерныеСобытияДействия.ВидДействия КАК ВидДействия
		               |ИЗ
		               |	Справочник.ТриггерныеСобытия.Действия КАК ТриггерныеСобытияДействия
		               |ГДЕ
		               |	ТриггерныеСобытияДействия.Ссылка = &Ссылка
		               |	И ТриггерныеСобытияДействия.ИдентификаторДействия = &ИдентификаторДействия";
		
		Запрос.УстановитьПараметр("Ссылка"					, СсылкаНаОбъект);
		Запрос.УстановитьПараметр("ИдентификаторДействия"	, ИдентификаторДействия);
		
		ВыборкаДействия = Запрос.Выполнить().Выбрать();
		Если ВыборкаДействия.Следующий() Тогда 
			ВидДействия = ?(ЗначениеЗаполнено(ВидДействия), ВидДействия, ?(ЗначениеЗаполнено(ВыборкаДействия.ВидДействия), ВыборкаДействия.ВидДействия, ВидДействияИзЖурналаРегистрации));
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат ФлагРегистрацииДействия;
	
КонецФункции

&НаКлиенте
// Процедура - Сообщить о недопустимости смены действия
//
// Параметры:
//  ИндексСтроки - 	 - 
//
Процедура СообщитьОНедопустимостиСменыДействия(ИндексСтроки)
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Данное действие уже зарегистрированно в журнале ригистрации триггерных событий! Изменение запрещено! Вы можете данное действие деактивировать или удалить.", , "Объект.Действия[" + ИндексСтроки + "].ВидДействия");
	
КонецПроцедуры	

&НаКлиенте
// Функция - Необходимо добавить элемент ввода
//
// Параметры:
//  ИндексСтроки - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция НеобходимоДобавитьЭлементВвода(ИндексСтроки)
	
	Счетчик = -1;
	Для Каждого СтрокаДействие ИЗ Объект.Действия Цикл
		//Если СтрокаДействие.Удалено Тогда 
		//	Продолжить;
		//КонецЕсли;
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	Возврат ИндексСтроки = Счетчик;
	
КонецФункции	

&НаКлиенте
// Процедура - Показать всплывающую группу параметров
//
// Параметры:
//  ИдентификаторДействия	 - 	 - 
//  ВидДействия				 - 	 - 
//
Процедура ПоказатьВсплывающуюГруппуПараметров(ИдентификаторДействия, ВидДействия)
	
	Для Каждого СтрокаДействие ИЗ Объект.Действия Цикл
		Если СтрокаДействие.ИдентификаторДействия = ИдентификаторДействия Тогда 
			ГруппаФормы = Элементы.Найти("ВсплывающаяГруппаПараметровДействия_Индекс_" + Строка(Объект.Действия.Индекс(СтрокаДействие)));
			Если НЕ ГруппаФормы = Неопределено Тогда
				Если ГруппаФормы.Скрыта() И ЗначениеЗаполнено(ВидДействия) Тогда 
					ГруппаФормы.Показать();
				ИначеЕсли НЕ ГруппаФормы.Скрыта() И НЕ ЗначениеЗаполнено(ВидДействия) Тогда	
					ГруппаФормы.Скрыть();
				КонецЕсли;	
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Функция - Инициализировать структуру параметров отрисовки
//
// Параметры:
//  Объект	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСтруктуруПараметровОтрисовки(ИнициализироватьМассивАккаунтовСистемыОтправки = Истина, ИндексСтроки = Неопределено) Экспорт
	
	ПараметрыОтрисовки = Новый Структура;
	
	// Формируем пустую структуру
	ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	Для Каждого КолонкаТаблицы Из ТаблицаВсехВариантовУсловийТриггерныхСобытий.Колонки Цикл 
		ПараметрыОтрисовки.Вставить(КолонкаТаблицы.Имя, КолонкаТаблицы.ТипЗначения.ПривестиЗначение());
	КонецЦикла;
	// Наполняем параметрами триггера
	Если ЗначениеЗаполнено(Объект.УсловиеСобытия) Тогда 
		ВариантУсловияТриггерногоСобытия 		= Объект.УсловиеСобытия;		
	Иначе 
		ВариантУсловияТриггерногоСобытия 		= Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
	КонецЕсли;
	КоллекцияВариантовУсловийТриггерныхСобытий 	= ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий", ВариантУсловияТриггерногоСобытия));
	Если КоллекцияВариантовУсловийТриггерныхСобытий.Количество() <> 0 Тогда 
		ЗаполнитьЗначенияСвойств(ПараметрыОтрисовки, КоллекцияВариантовУсловийТриггерныхСобытий[0]);
	КонецЕсли;
	
	ПараметрыОтрисовки.Вставить("ТабличнаяЧастьСодержитОднуАктуальнуюСтроку", Объект.Действия.НайтиСтроки(Новый Структура("Удалено", Ложь)).Количество() < 2);
	
	// Подготовка сервисов рассылки сообщений.	
	СервисыРассылки = Новый Структура;
	СервисыРассылки.Вставить("Push"     	, Неопределено);
	СервисыРассылки.Вставить("PushWallet"   , Неопределено);
	СервисыРассылки.Вставить("Messenger"	, Неопределено);
	СервисыРассылки.Вставить("SMS"      	, Неопределено);
	
	Если ИнициализироватьМассивАккаунтовСистемыОтправки Тогда
		ИнициализироватьНастройкиКаналовУведомлений();
		
#Область СТАРЫЙ_МЕХАНИЗМ_ОПРЕДЕЛНИЯ_СЕРВИСОВ_РАССЫЛКИ
		
		// Получим массив аккаунтов
		Запрос 			= Новый Запрос;
		Запрос.Текст 	= 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВнешниеСистемы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
		|ГДЕ
		|	ВнешниеСистемы.ПометкаУдаления = ЛОЖЬ
		|	И ВнешниеСистемы.Используется = ИСТИНА
		|	И ВнешниеСистемы.ТипВнешнейСистемы В (ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Chat2Desk), ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.GreenApi))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СервисыРассылки.Ссылка
		|ИЗ
		|	Справочник.СервисыРассылки КАК СервисыРассылки
		|ГДЕ
		|	СервисыРассылки.ПометкаУдаления = ЛОЖЬ";
		
		ПараметрыОтрисовки.Вставить("МассивАккаунтовСистемыОтправкиСообщений", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		
#КонецОбласти

		ПараметрыОтрисовки.Вставить("МассивАккаунтовСистемыОтправкиСообщений", ТаблицаВнешнихСистем.Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Иначе 
		ПараметрыОтрисовки.Вставить("МассивАккаунтовСистемыОтправкиСообщений", Новый Массив);
	КонецЕсли;

	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("СтруктурнаяЕдиница", ТекущаяСтруктурнаяЕдиница);
	Если НЕ ИндексСтроки = Неопределено Тогда
		СтрокаТаблицыПлана = Объект.Действия.Получить(ИндексСтроки);
		СтруктураПоиска.Вставить("ИдентификаторДействия", СтрокаТаблицыПлана.ИдентификаторДействия);
	КонецЕсли;	
	МассивСтрокНастроекКаналов = МоделируемыеНастройкиКаналовУведомлений.НайтиСтроки(СтруктураПоиска);
	Если НЕ МассивСтрокНастроекКаналов.Количество() = 0 Тогда 
		СтрокаНастроекКаналов = МассивСтрокНастроекКаналов[0];
		Если НЕ ИндексСтроки = Неопределено Тогда
			// Конвертируем элемент коллекции в структуру, так как невозможен обмен Клиент/Сервер			
			ПараметрыОтрисовки.Вставить("СтрокаНастройкиКаналовУведомлений", СтрокуТаблицыЗначенийВСтруктуру(СтрокаНастроекКаналов, ИменаКолонокМоделируемойТаблицы()));
		КонецЕсли;	
		// Сервис Push-уведомлений
		Если НЕ СтрокаНастроекКаналов.СписокАккаунтовPush.Количество() = 0 Тогда 
			СервисыРассылки.Push = СтрокаНастроекКаналов.СписокАккаунтовPush[0].Значение; 
		КонецЕсли;
		// Сервис Push Wallet
		Если НЕ СтрокаНастроекКаналов.СписокАккаунтовPushWallet.Количество() = 0 Тогда 
			СервисыРассылки.PushWallet = СтрокаНастроекКаналов.СписокАккаунтовPushWallet[0].Значение; 
		КонецЕсли;
		// Сервисы мессенджера
		СервисыMessenger = Новый Структура;
		СервисыMessenger.Вставить("GreenApi"        , Справочники.ВнешниеСистемы.ПустаяСсылка());
		СервисыMessenger.Вставить("Chat2Desk"      , Справочники.ВнешниеСистемы.ПустаяСсылка());
		
 		ПараметрыОтрисовки.Вставить("ИспользуетсяРасширениеМессенджер", ОбщегоНазначенияСтоматология.ИспользуетсяРасширение("Мессенджер"));
 
		Для Каждого ЭлементСервисMessenger Из СтрокаНастроекКаналов.СписокАккаунтовMessenger Цикл
			МассивСтрокВнешнихСистем = ТаблицаВнешнихСистем.НайтиСтроки(Новый Структура("Ссылка", ЭлементСервисMessenger.Значение));
			Если НЕ МассивСтрокВнешнихСистем.Количество() = 0 Тогда 
				Если МассивСтрокВнешнихСистем[0].ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi Тогда 
					СервисыMessenger.Вставить("GreenApi"			, ЭлементСервисMessenger.Значение);
				ИначеЕсли МассивСтрокВнешнихСистем[0].ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Chat2Desk Тогда 
					СервисыMessenger.Вставить("Chat2Desk"		, ЭлементСервисMessenger.Значение);
				КонецЕсли;				
			КонецЕсли;
			Если ЗначениеЗаполнено(СервисыMessenger.GreenApi) И ЗначениеЗаполнено(СервисыMessenger.Chat2Desk) Тогда 
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		СервисыРассылки.Messenger 	= СервисыMessenger;
		ОтправкаMessenger 			= ПараметрыОтрисовки.ИспользуетсяРасширениеМессенджер 
									И (ЗначениеЗаполнено(СервисыРассылки.Messenger.Chat2Desk)
									ИЛИ ЗначениеЗаполнено(СервисыРассылки.Messenger.GreenApi));
		// Сервис sms-рассылки
		СервисыРассылки.SMS 		= СтрокаНастроекКаналов.АккаунтСервисаРассылкиSMS;
	Иначе 
		
#Область СТАРЫЙ_МЕХАНИЗМ_ОПРЕДЕЛНИЯ_СЕРВИСОВ_РАССЫЛКИ_2
		
		// Сервис Push-уведомлений.
		СервисыРассылки.Push = Справочники.ВнешниеСистемы.ПустаяСсылка();//Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.МобильноеПриложениеКлиента, Истина);
		
		// Сервис Push Wallet 	
		СервисыРассылки.PushWallet = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.Wallet);
		
		// Севисы мессенджера.
		СервисыMessenger = Новый Структура;		
		СервисыMessenger.Вставить("GreenApi"        , Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.GreenApi        , Истина));
		СервисыMessenger.Вставить("Chat2Desk"      , Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.Chat2Desk      , Истина, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница));
		
		СервисыРассылки.Messenger = СервисыMessenger;
		
		ОтправкаMessenger = ЗначениеЗаполнено(СервисыРассылки.Messenger.Chat2Desk)
		ИЛИ ЗначениеЗаполнено(СервисыРассылки.Messenger.GreenApi);
		
		// Сервис sms-рассылки.
		СервисыРассылки.SMS = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.СервисSMSРассылки;
		СервисыРассылки.SMS = ?(Не ЗначениеЗаполнено(СервисыРассылки.SMS), Константы.СервисSMSРассылкиПоУмолчанию.Получить(), СервисыРассылки.SMS);
		
#КонецОбласти
		
	КонецЕсли;				
	
	ПараметрыРассылки = Новый Структура;
	ПараметрыРассылки.Вставить("СервисыРассылки"  	, СервисыРассылки);
	ПараметрыРассылки.Вставить("ОтправкаPush"     	, ЗначениеЗаполнено(СервисыРассылки.Push));
	ПараметрыРассылки.Вставить("ОтправкаPushWallet" , ЗначениеЗаполнено(СервисыРассылки.PushWallet));
	ПараметрыРассылки.Вставить("ОтправкаMessenger"	, ОтправкаMessenger);
	ПараметрыРассылки.Вставить("ОтправкаSMS"      	, ЗначениеЗаполнено(СервисыРассылки.SMS));
	
	ПараметрыОтрисовки.Вставить("ПараметрыРассылки"	, ПараметрыРассылки);
	
	ПараметрыОтрисовки.Вставить("МассивДоступныхСценариев", Новый Массив);
	Если ПараметрыОтрисовки.РазрешенаРаботаСЧатБотом И ПараметрыОтрисовки.ИспользуетсяРасширениеМессенджер Тогда 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТриггерноеСобытие", Объект.УсловиеСобытия);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СценарииЧатБотов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СценарииЧатБотов КАК СценарииЧатБотов
		|ГДЕ
		|	СценарииЧатБотов.ПометкаУдаления = ЛОЖЬ
		|	И СценарииЧатБотов.Используется = ИСТИНА
		|	И СценарииЧатБотов.ТриггерныеСобытия.ТриггерноеСобытие = &ТриггерноеСобытие";
		
		ПараметрыОтрисовки.Вставить("МассивДоступныхСценариев", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	КонецЕсли;	
		
	Возврат ПараметрыОтрисовки;
	
КонецФункции

&НаСервере
Процедура ИнициализироватьНастройкиКаналовУведомлений()
	
	МВТ 	= Новый МенеджерВременныхТаблиц;
	Запрос 	= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("ТаблицаЗначенийПланДействий", Объект.Действия.Выгрузить(Новый Структура("Удалено", Ложь)));
	Запрос.УстановитьПараметр("ТаблицаЗначенийНастройкиКаналовУведомлений", Объект.НастройкиКаналовУведомлений.Выгрузить());		
	Запрос.УстановитьПараметр("ТаблицаЗначенийКешированныхНастроекКаналовУведомлений", МоделируемыеНастройкиКаналовУведомлений.Выгрузить(, "ИдентификаторДействия, СтруктурнаяЕдиница, ОтправкаPush, ОтправкаPushWallet, ОтправкаMessenger, ОтправкаSMS, АккаунтВнешнейСистемы, АккаунтСервисаРассылкиSMS, КаналСистемыСообщений"));			
	Запрос.Текст = 
	"ВЫБРАТЬ ТаблицаЗначенийПланДействий.*
	|ПОМЕСТИТЬ ПланДействий
	|ИЗ &ТаблицаЗначенийПланДействий КАК ТаблицаЗначенийПланДействий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ТаблицаЗначенийНастройкиКаналовУведомлений.*
	|ПОМЕСТИТЬ НастройкиКаналовУведомлений
	|ИЗ &ТаблицаЗначенийНастройкиКаналовУведомлений КАК ТаблицаЗначенийНастройкиКаналовУведомлений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ТаблицаЗначенийКешированныхНастроекКаналовУведомлений.*
	|ПОМЕСТИТЬ КешированныеНастройкиКаналовУведомлений
	|ИЗ &ТаблицаЗначенийКешированныхНастроекКаналовУведомлений КАК ТаблицаЗначенийКешированныхНастроекКаналовУведомлений";	
	Запрос.Выполнить();
	
	Запрос 			= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст 	= 
	"ВЫБРАТЬ
	|	Действия.ИдентификаторДействия КАК ИдентификаторДействия,
	|	СтруктурныеЕдиницы.Ссылка КАК СтруктурнаяЕдиница,
	|	Действия.Использование КАК Использование,
	|	Действия.ОтправкаPush КАК ОтправкаPush,
	|	Действия.ОтправкаPushWallet КАК ОтправкаPushWallet,
	|	Действия.ОтправкаMessenger КАК ОтправкаMessenger,
	|	Действия.ОтправкаSMS КАК ОтправкаSMS,
	|	Действия.АккаунтВнешнейСистемы КАК АккаунтВнешнейСистемы,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Действия.АккаунтSMS, СтруктурныеЕдиницы.СервисSMSРассылки) = ЗНАЧЕНИЕ(Справочник.СервисыРассылки.ПустаяСсылка)
	|				ИЛИ ЕСТЬNULL(Действия.АккаунтSMS, СтруктурныеЕдиницы.СервисSMSРассылки) = НЕОПРЕДЕЛЕНО
	|			ТОГДА СервисSMSРассылкиПоУмолчанию.Значение
	|		ИНАЧЕ ЕСТЬNULL(Действия.АккаунтSMS, СтруктурныеЕдиницы.СервисSMSРассылки)
	|	КОНЕЦ КАК АккаунтSMS,
	|	Действия.КаналСистемыСообщений КАК КаналСистемыСообщений
	|ПОМЕСТИТЬ МоделируемыеНастройкиКаналовУведомлений
	|ИЗ
	|	ПланДействий КАК Действия
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО (ИСТИНА),
	|	Константа.СервисSMSРассылкиПоУмолчанию КАК СервисSMSРассылкиПоУмолчанию
	|ГДЕ
	|	СтруктурныеЕдиницы.ПометкаУдаления = ЛОЖЬ
	|	И СтруктурныеЕдиницы.ЭтоГруппа = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.ИдентификаторДействия, МоделируемыеНастройкиКаналовУведомлений.ИдентификаторДействия) КАК ИдентификаторДействия,
	|	ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.СтруктурнаяЕдиница, МоделируемыеНастройкиКаналовУведомлений.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиница,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.СтруктурнаяЕдиница, МоделируемыеНастройкиКаналовУведомлений.СтруктурнаяЕдиница)) КАК ПредставлениеСтруктурнойЕдиницы,
	|	ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.СтруктурнаяЕдиница.Наименование, МоделируемыеНастройкиКаналовУведомлений.СтруктурнаяЕдиница.Наименование) КАК НаименованиеСтруктурнойЕдиницы,
	|	ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.ОтправкаPush, МоделируемыеНастройкиКаналовУведомлений.ОтправкаPush) КАК ОтправкаPush,
	|	ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.ОтправкаPushWallet, МоделируемыеНастройкиКаналовУведомлений.ОтправкаPushWallet) КАК ОтправкаPushWallet,
	|	ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.ОтправкаMessenger, МоделируемыеНастройкиКаналовУведомлений.ОтправкаMessenger) КАК ОтправкаMessenger,
	|	ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.ОтправкаSMS, МоделируемыеНастройкиКаналовУведомлений.ОтправкаSMS) КАК ОтправкаSMS,
	|	ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.АккаунтВнешнейСистемы, МоделируемыеНастройкиКаналовУведомлений.АккаунтВнешнейСистемы) КАК АккаунтВнешнейСистемы,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.АккаунтВнешнейСистемы, МоделируемыеНастройкиКаналовУведомлений.АккаунтВнешнейСистемы)) КАК ПредставлениеАккаунтаВнешнейСистемы,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.АккаунтСервисаРассылкиSMS, МоделируемыеНастройкиКаналовУведомлений.АккаунтSMS) = ЗНАЧЕНИЕ(Справочник.СервисыРассылки.ПустаяСсылка)
	|			ТОГДА МоделируемыеНастройкиКаналовУведомлений.АккаунтSMS
	|		ИНАЧЕ ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.АккаунтСервисаРассылкиSMS, МоделируемыеНастройкиКаналовУведомлений.АккаунтSMS)
	|	КОНЕЦ КАК АккаунтСервисаРассылкиSMS,
	|	ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.КаналСистемыСообщений, МоделируемыеНастройкиКаналовУведомлений.КаналСистемыСообщений) КАК КаналСистемыСообщений
	|ИЗ
	|	МоделируемыеНастройкиКаналовУведомлений КАК МоделируемыеНастройкиКаналовУведомлений
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиКаналовУведомлений КАК ТекущиеНастройкиКаналовУведомлений
	|		ПО МоделируемыеНастройкиКаналовУведомлений.ИдентификаторДействия = ТекущиеНастройкиКаналовУведомлений.ИдентификаторДействия
	|			И МоделируемыеНастройкиКаналовУведомлений.СтруктурнаяЕдиница = ТекущиеНастройкиКаналовУведомлений.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ КешированныеНастройкиКаналовУведомлений КАК ТекущиеКешированныеНастройкиКаналовУведомлений
	|		ПО МоделируемыеНастройкиКаналовУведомлений.ИдентификаторДействия = ТекущиеКешированныеНастройкиКаналовУведомлений.ИдентификаторДействия
	|			И МоделируемыеНастройкиКаналовУведомлений.СтруктурнаяЕдиница = ТекущиеКешированныеНастройкиКаналовУведомлений.СтруктурнаяЕдиница
	|ГДЕ
	|	ТекущиеКешированныеНастройкиКаналовУведомлений.СтруктурнаяЕдиница ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИдентификаторДействия,
	|	НаименованиеСтруктурнойЕдиницы,
	|	СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВнешниеСистемы.Ссылка КАК Ссылка,
	|	ВнешниеСистемы.ТипВнешнейСистемы КАК ТипВнешнейСистемы,
	|	ВнешниеСистемы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВнешниеСистемы.Ссылка) КАК Представление
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ПометкаУдаления = ЛОЖЬ
	|	И ВнешниеСистемы.Используется = ИСТИНА
	|	И ВнешниеСистемы.ТипВнешнейСистемы В (ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Wallet), ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.GreenApi), ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Chat2Desk))";		
	
	РезультатПакетаЗапросов = Запрос.ВыполнитьПакет();
	
	ТаблицаНастроекКаналовУведомлений = РезультатПакетаЗапросов[1].Выгрузить();
	ТаблицаВнешнихСистем.Загрузить(РезультатПакетаЗапросов[2].Выгрузить());
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	//МоделируемыеНастройкиКаналовУведомлений.Очистить();
	Для Каждого СтрокаНастройкаКанала Из ТаблицаНастроекКаналовУведомлений Цикл 
		НоваяСтрока = МоделируемыеНастройкиКаналовУведомлений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНастройкаКанала);
		Для Каждого СтрокаВнешняяСистема Из ТаблицаВнешнихСистем Цикл 
			Если СтрокаНастройкаКанала.СтруктурнаяЕдиница = СтрокаВнешняяСистема.СтруктурнаяЕдиница ИЛИ НЕ ЗначениеЗаполнено(СтрокаВнешняяСистема.СтруктурнаяЕдиница) Тогда 
				//Если СтрокаВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.МобильноеПриложениеКлиента Тогда 
				//	НоваяСтрока.СписокАккаунтовPush.Добавить(СтрокаВнешняяСистема.Ссылка, СтрокаВнешняяСистема.Представление);
				Если СтрокаВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Wallet Тогда	
					НоваяСтрока.СписокАккаунтовPushWallet.Добавить(СтрокаВнешняяСистема.Ссылка, СтрокаВнешняяСистема.Представление);
				ИначеЕсли СтрокаВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi ИЛИ СтрокаВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Chat2Desk Тогда	
					НоваяСтрока.СписокАккаунтовMessenger.Добавить(СтрокаВнешняяСистема.Ссылка, СокрЛП(СтрокаВнешняяСистема.Представление), СтрокаВнешняяСистема.Ссылка = НоваяСтрока.АккаунтВнешнейСистемы);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеЗаполнено(СтрокаНастройкаКанала.АккаунтВнешнейСистемы) Тогда 
			СохраненныйАккаунтМессенджера = НоваяСтрока.СписокАккаунтовMessenger.НайтиПоЗначению(СтрокаНастройкаКанала.АккаунтВнешнейСистемы);
			Если СохраненныйАккаунтМессенджера = Неопределено Тогда 
				//НоваяСтрока.СписокАккаунтовMessenger.Добавить(СтрокаНастройкаКанала.АккаунтВнешнейСистемы, Новый ФорматированнаяСтрока(СокрЛП(СтрокаНастройкаКанала.ПредставлениеАккаунтаВнешнейСистемы) + " (не корректный аккаунт)", , Новый Цвет(255, 0, 0)));
				НоваяСтрока.ОтправкаMessenger = Ложь;
			КонецЕсли;
		ИначеЕсли НоваяСтрока.СписокАккаунтовMessenger.Количество() = 1 Тогда  
			НоваяСтрока.АккаунтВнешнейСистемы = НоваяСтрока.СписокАккаунтовMessenger[0].Значение;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаНастройкаКанала.АккаунтСервисаРассылкиSMS) Тогда 
			НоваяСтрока.СписокАккаунтовSMS.Добавить(СтрокаНастройкаКанала.АккаунтСервисаРассылкиSMS);
		КонецЕсли;	
	КонецЦикла;
	
	ТаблицаАктуальныхСЕ = ТаблицаНастроекКаналовУведомлений.Скопировать(, "СтруктурнаяЕдиница");
	ТаблицаАктуальныхСЕ.Свернуть("СтруктурнаяЕдиница");
	СписокАктуальныхСтруктурныхЕдиниц.ЗагрузитьЗначения(ТаблицаАктуальныхСЕ.ВыгрузитьКолонку("СтруктурнаяЕдиница"));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция - Имена колонок таблицы действий
// 
// Возвращаемое значение:
//   - 
//
Функция ИменаКолонокТаблицыДействий()
	
	Возврат "ИдентификаторДействия, Использование, ВидДействия, ВидАдресата, ВидАдресатаРезервный, Адресат";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Функция - Имена колонок моделируемой таблицы
//
// Параметры:
//  КолонкиСКоллекциями	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИменаКолонокМоделируемойТаблицы(КолонкиСКоллекциями = Истина)
	
	Если КолонкиСКоллекциями Тогда 
		Возврат "ИдентификаторДействия, СтруктурнаяЕдиница, ОтправкаPush, ОтправкаPushWallet, ОтправкаMessenger, ОтправкаSMS, АккаунтВнешнейСистемы, АккаунтСервисаРассылкиSMS, КаналСистемыСообщений, СписокАккаунтовPush, СписокАккаунтовPushWallet, СписокАккаунтовMessenger, СписокАккаунтовSMS, ПредставлениеСтруктурнойЕдиницы";
	Иначе 
		Возврат "ИдентификаторДействия, СтруктурнаяЕдиница, ОтправкаPush, ОтправкаPushWallet, ОтправкаMessenger, ОтправкаSMS, АккаунтВнешнейСистемы, АккаунтСервисаРассылкиSMS, КаналСистемыСообщений, ПредставлениеСтруктурнойЕдиницы";
	КонецЕсли;	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Функция - Имена колонок таблицы внешних систем
// 
// Возвращаемое значение:
//   - 
//
Функция ИменаКолонокТаблицыВнешнихСистем()
	
	Возврат "Ссылка, ТипВнешнейСистемы, СтруктурнаяЕдиница, Представление";
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Контактный номер телефона у адресата отсутствует
//
// Параметры:
//  Адресат	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция КонтактныйНомерТелефонаУАдресатаОтсутствует(Адресат)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СотрудникиКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	               |ИЗ
	               |	Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
	               |ГДЕ
	               |	СотрудникиКонтактнаяИнформация.Ссылка = &Ссылка
	               |	И СотрудникиКонтактнаяИнформация.Тип = &Тип
	               |	И СотрудникиКонтактнаяИнформация.НомерТелефона <> &НомерТелефона";
	
	Запрос.УстановитьПараметр("Ссылка"			, Адресат);
	Запрос.УстановитьПараметр("Тип"				, Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("НомерТелефона"	, "");
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции	

&НаСервереБезКонтекста
// Функция - Электронный адрес у адресата отсутствует
//
// Параметры:
//  Адресат	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЭлектронныйАдресУАдресатаОтсутствует(Адресат)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СотрудникиКонтактнаяИнформация.НомерТелефона КАК Представление
	               |ИЗ
	               |	Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
	               |ГДЕ
	               |	СотрудникиКонтактнаяИнформация.Ссылка = &Ссылка
	               |	И СотрудникиКонтактнаяИнформация.Тип = &Тип
	               |	И (ВЫРАЗИТЬ(СотрудникиКонтактнаяИнформация.Представление КАК СТРОКА(200))) <> &Представление";
	
	Запрос.УстановитьПараметр("Ссылка"			, Адресат);
	Запрос.УстановитьПараметр("Тип"				, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("Представление"	, "");
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции	

&НаСервере
// Функция - Преобразовать массив структур в таблицу значений
//
// Параметры:
//  МассивДанных - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПреобразоватьМассивСтруктурВТаблицуЗначений(МассивДанных)

	// Создадим структуру колонок с типами так как сменить тип колонки в ТЗ не получиться
	СтруктураКолонок = Новый Структура;
	
	Для Каждого ЭлементМассива Из МассивДанных Цикл
		// Ввиду того что массив может попасться разноколоночны нужно проверять не только первую строку.
		// А также, если типы отличаются в разных элементах массива, нужно иметь возможность получить читабельную ТЗ.
		Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
			ТипЗначенияКолонки = ТипЗнч(ЗначениеСтруктуры.Значение);
			Если НЕ СтруктураКолонок.Свойство(ЗначениеСтруктуры.Ключ) Тогда
				МассивДопустимыеТипы = Новый Массив;
				МассивДопустимыеТипы.Добавить(ТипЗначенияКолонки);
				СтруктураКолонок.Вставить(ЗначениеСтруктуры.Ключ, МассивДопустимыеТипы);
			Иначе
				СодержитТип = СтруктураКолонок[ЗначениеСтруктуры.Ключ].Найти(ТипЗначенияКолонки);
				Если СодержитТип = Неопределено Тогда
					СтруктураКолонок[ЗначениеСтруктуры.Ключ].Добавить(ТипЗначенияКолонки)
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Создадим ТЗ
	ТаблицаЗначенийДанные = Новый ТаблицаЗначений;
	
	// Добавим Колонки в ТЗ
	Для Каждого Колонка Из СтруктураКолонок Цикл
		ТаблицаЗначенийДанные.Колонки.Добавить(Колонка.Ключ, Новый ОписаниеТипов(Колонка.Значение));		
	КонецЦикла;
	
	// Теперь можно обработать нормально массив
	Для Каждого ЭлементМассива Из МассивДанных Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаЗначенийДанные.Добавить(), ЭлементМассива);
	КонецЦикла;
	
	Возврат ТаблицаЗначенийДанные;

КонецФункции

#КонецОбласти
