
#Область СлужебныйПрограммныйИнтерфейс

// Функция осуществляет подключение устройства.
//
// Параметры:
//  ОбъектДрайвера   - <*>
//           - ОбъектДрайвера драйвера торгового оборудования.
//
// Возвращаемое значение:
//  <Булево> - Результат работы функции.
//
Функция ПодключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт

	Результат = Истина;
	ПараметрыПодключения.Вставить("СерийныйНомерККМ", "0");
	ПараметрыПодключения.Вставить("ФРПодключен"     , Ложь);

	// Обязательные выходные
	ВыходныеПараметры = Новый Массив();

	// Проверка настроенных параметров
	КодСимволаЧастичногоОтреза = Неопределено;
	НомерСекции                = Неопределено;
	Модель                     = Неопределено;

	Параметры.Свойство("КодСимволаЧастичногоОтреза", КодСимволаЧастичногоОтреза);
	Параметры.Свойство("НомерСекции"               , НомерСекции);
	Параметры.Свойство("Модель"                    , Модель);

	Если КодСимволаЧастичногоОтреза = Неопределено
	 Или НомерСекции                = Неопределено
	 Или Модель                     = Неопределено Тогда
		Результат = Ложь;
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Не настроены параметры устройства."
"Для корректной работы устройства необходимо задать параметры его работы."
"Сделать это можно при помощи формы ""Настройка параметров"" модели"
"внешнего оборудования в форме ""Подключение и настройка оборудования"".';en='Parameters devices are not configured."
"For correct work devices is necessary to set its work parameters."
"Make it is possible with the help"
"of the forms ""Customization of parameters"" of the model external equipment in the form ""Connection and customization equipment"".'"));
	КонецЕсли;
	// Конец: Проверка настроенных параметров

	Если Результат Тогда
		Если ПараметрыПодключения.ФРПодключен Тогда
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(НСтр("ru='Фискальный регистратор уже подключен';en='Fiscal registrar already connected'"));
			Результат = Ложь;
		Иначе
			ПараметрыПодключения.ФРПодключен = Истина;

			ВыходныеПараметры.Добавить(""); // Источник событий
			ВыходныеПараметры.Добавить(Неопределено); // Список событий
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Функция осуществляет отключение устройства.
//
// Параметры:
//  ОбъектДрайвера - <*>
//         - ОбъектДрайвера драйвера торгового оборудования.
//
// Возвращаемое значение:
//  <Булево> - Результат работы функции.
//
Функция ОтключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт

	Результат = Истина;

	// Обязательные выходные
	ВыходныеПараметры = Неопределено;

	ПараметрыПодключения.ФРПодключен = Ложь;

	Возврат Результат;

КонецФункции

// Функция получает, обрабатывает и перенаправляет на исполнение команду к драйверу
//
Функция ВыполнитьКоманду(Команда, ВходныеПараметры = Неопределено, ВыходныеПараметры = Неопределено,
                         ОбъектДрайвера, Параметры, ПараметрыПодключения) Экспорт

	Результат = Истина;

	// Обязательные выходные
	ВыходныеПараметры = Новый Массив();

	// Открыть смену
	Если Команда = "OpenDay" или Команда = "OpenShift" Тогда
		Результат = ОткрытьСмену(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);

	// Печать чека
	ИначеЕсли Команда = "PrintReceipt" или Команда = "CheckFiscalization" Тогда
		ТаблицаНоменклатуры = ВходныеПараметры[0].ПозицииЧека;
		ТаблицаОплат        = ВходныеПараметры[0].ТаблицаОплат;
		ОбщиеПараметры      = ВходныеПараметры[0];
		
		Результат = ПечатьЧека(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаНоменклатуры,
		                       ТаблицаОплат, ОбщиеПараметры, ВыходныеПараметры);

	// Печать слип чека
	ИначеЕсли Команда = "PrintText" Тогда
		СтрокаТекста = ВходныеПараметры[0];

		Результат = ПечатьТекста(ОбъектДрайвера, Параметры, ПараметрыПодключения,
		                         СтрокаТекста, ВыходныеПараметры);

	// Печать чека внесения/выемки
	ИначеЕсли Команда = "Encash" Тогда
		// ТипИнкассации = ВходныеПараметры[0];
		// Сумма         = ВходныеПараметры[1];    		
		ТипИнкассации   = 0;
		Сумма			= 0;
		Если ТипЗнч(ВходныеПараметры) = Тип("Структура") Тогда  	
			ТипИнкассации      = ?(ВходныеПараметры.Свойство("ТипИнкассации"), ВходныеПараметры.ТипИнкассации	, 0);  
			Сумма              = ?(ВходныеПараметры.Свойство("Сумма")        , ВходныеПараметры.Сумма			, 0);  
		ИначеЕсли ТипЗнч(ВходныеПараметры) = Тип("Массив") Тогда
			ТипИнкассации = ?(ВходныеПараметры.Количество() > 0, ВходныеПараметры[0], 0);
			Сумма         = ?(ВходныеПараметры.Количество() > 1, ВходныеПараметры[1], 0);
		КонецЕсли;     

		Результат = Инкассация(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТипИнкассации, Сумма, ВыходныеПараметры);

	// Печать отчета без гашения
	ИначеЕсли Команда = "PrintXReport" или Команда = "ReportCurrentStatusOfSettlements" Тогда
		Результат = НапечататьОтчетБезГашения(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);

	// Печать отчета с гашением
	ИначеЕсли Команда = "PrintZReport" или Команда = "CloseShift" Тогда
		Результат = НапечататьОтчетСГашением(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
	ИначеЕсли Команда = "OpenCheck" Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(1);
		// ВыходныеПараметры.Добавить(?(Параметры.Свойство("ПоследнийНомерЧека"), Параметры.ПоследнийНомерЧека + 1, 1));// 1 номер чека
		ПоследнийНомерОбъект = ПодключаемоеОборудованиеХеликсЧековыйПринтерКассираСервер.ПолучитьПоследнийНомерЧека(Параметры);
		ВыходныеПараметры.Добавить(?(Параметры.Свойство("ПоследнийНомерЧека") и ПоследнийНомерОбъект <> Неопределено, ПоследнийНомерОбъект + 1, 1));// 1 номер чек
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(ТекущаяДата());		
		Результат = Истина;

	// Указанная команда не поддерживается данным драйвером
	Иначе
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Команда ""%Команда%"" не поддерживается данным драйвером.';en='Command ""%Команда%"" is not supported by this driver.'"));
		ВыходныеПараметры[1] = СтрЗаменить(ВыходныеПараметры[1], "%Команда%", Команда);
		Результат = Ложь;

	КонецЕсли;

	Возврат Результат;

КонецФункции

// Функция возвращает возможность работы модуля в асинхронном режиме.
// Стандартные команды модуля:
// - ПодключитьУстройство
// - ОтключитьУстройство
// - ВыполнитьКоманду
// Команды модуля для работы асинхронном режиме (должны быть определены):
// - НачатьПодключениеУстройства
// - НачатьОтключениеУстройства
// - НачатьВыполнениеКоманды.
//
Функция ПоддержкаАсинхронногоРежима() Экспорт
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

/////////////////////////////////////
// Функции-исполнители команд

///////// СПЕЦИФИЧНЫЕ ПО ТИПУ ВО КОМАНДЫ ////////////////

// Функция осуществляет открытие смены
Функция ОткрытьСмену(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	Результат = Истина;
	СтрокаЛога = "";

	СтрокаЛога = "----- " + НСтр("ru='Смена открыта';en='Change isopen'") + " -----" + Символы.ПС;

	// Заполнение выходных параметров
	ВыходныеПараметры.Добавить(0);
	ВыходныеПараметры.Добавить(0);
	ВыходныеПараметры.Добавить(0);
	ВыходныеПараметры.Добавить(ТекущаяДата());

	ПоказатьОповещениеПользователя(СтрокаЛога);

	Возврат Результат;

КонецФункции

// Функция осуществляет печать фискального чека
Функция ПечатьЧека(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаНоменклатуры,
                   ТаблицаОплат, ОбщиеПараметры, ВыходныеПараметры)

	Результат  = Истина;
	ПараметрыПодключения.Вставить("СтрокаЛога", "");

	
	Если ТипЗнч(ОбщиеПараметры.ТипРасчета) = Тип("ПеречислениеСсылка.ТипыРасчетаДенежнымиСредствами") Тогда
		ЧекВозврата = НЕ ОбщиеПараметры.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств");
	Иначе
		ЧекВозврата = Не ОбщиеПараметры.ТипРасчета = "ПриходДенежныхСредств";
	КонецЕсли;
	
	// Открываем чек
	Результат = ПодключаемоеОборудованиеХеликсЧековыйПринтерКассираСервер.ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения,
					ЧекВозврата, Истина, ВыходныеПараметры);
		
	// Печатаем строки чека
	Если Результат Тогда
				
		Индекс = 0;
		Для Каждого СтрокаМ из ТаблицаНоменклатуры Цикл
			
			ПредставлениеНаименования = "ru = '" + СтрокаМ.Наименование + "'; en = '" + СтрокаМ.Номенклатура + "'";
			
			Если Индекс = 0
				И ОбщиеПараметры.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.Возврат") Тогда
			
				Наименование = МенеджерОборудованияВызовСервера.ПолучитьСловоСУчетомЯзыка("Возврат оплаты: ") + Символы.ПС + НСтр(ПредставлениеНаименования);
			Иначе
				Наименование = НСтр(ПредставлениеНаименования);
			КонецЕсли;
			
			Количество    = СтрокаМ.Количество;
			Цена          = СтрокаМ.Цена;
			//// Если СтрокаМ.Сумма + ?(СтрокаМ.СуммаВключаетНДС, 0, СтрокаМ.СуммаНДС) < (СтрокаМ.Количество * СтрокаМ.Цена) Тогда
			// Если (СтрокаМ.ЦенаСоСкидками * СтрокаМ.Количество) < (СтрокаМ.Количество * СтрокаМ.Цена) Тогда
			////	ПроцентСкидки = (СтрокаМ.Сумма + ?(СтрокаМ.СуммаВключаетНДС, 0, СтрокаМ.СуммаНДС) )/(СтрокаМ.Количество * СтрокаМ.Цена) * 100;
			//	ПроцентСкидки = (СтрокаМ.ЦенаСоСкидками * СтрокаМ.Количество)/(СтрокаМ.Количество * СтрокаМ.Цена) * 100;      
			// Иначе
			//	ПроцентСкидки = 0;
			// КонецЕсли;
			
			ПроцентСкидки = 0;
			Сумма         = СтрокаМ.Сумма;
			НомерСекции   = СтрокаМ.НомерСекции;
			СтавкаНДС     = СтрокаМ.СтавкаНДС;

			Если НЕ ПодключаемоеОборудованиеХеликсЧековыйПринтерКассираСервер.НапечататьФискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения,
			                                   Наименование, Количество, Цена, ПроцентСкидки, Сумма,
			                                   НомерСекции, СтавкаНДС, ВыходныеПараметры, ?(СтрокаМ.Свойство("СуммаВключаетНДС"), СтрокаМ.СуммаВключаетНДС, Истина), СтрокаМ.СуммаНДС) Тогда
				Прервать;
			КонецЕсли;
			
			Индекс = Индекс + 1;
			
		КонецЦикла;
	КонецЕсли;

	// Закрываем чек
	Если Результат Тогда
		
		Если ТипЗнч(ОбщиеПараметры) = Тип("Структура") И ОбщиеПараметры.Свойство("Контрагент")
			И ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("ТаблицаПодвалЧека") и ТипЗнч(Параметры.ТаблицаПодвалЧека) = Тип("Массив") Тогда
			
 			СловоСУчетомЯзыка_ФИО = МенеджерОборудованияВызовСервера.ПолучитьСловоСУчетомЯзыка("ФИО: ");
			Флаг = Ложь;
			Для Каждого ЭлементМ Из Параметры.ТаблицаПодвалЧека Цикл
				Если СтрНайти(ЭлементМ, СловоСУчетомЯзыка_ФИО) > 0 Тогда
					Флаг = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если Не Флаг Тогда
				Параметры.ТаблицаПодвалЧека.Вставить(0, "");
				Параметры.ТаблицаПодвалЧека.Вставить(1, "" + СловоСУчетомЯзыка_ФИО + ОбщиеПараметры.Контрагент);
			КонецЕсли;
			
		КонецЕсли;
		
		Результат = ПодключаемоеОборудованиеХеликсЧековыйПринтерКассираСервер.ЗакрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаОплат, ВыходныеПараметры);
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПараметрыПодключения.СтрокаЛога);
	
	Параметры.ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если Параметры.Ширина = 80 Тогда
		Параметры.ТабличныйДокумент.Область("C15:C15").ШиринаКолонки = 8;
	ИначеЕсли Параметры.Ширина = 100 Тогда		
		Параметры.ТабличныйДокумент.Область("C15:C15").ШиринаКолонки = 18;
	КонецЕсли;	
	
	ПечатьКопииЧековКоличество = 1;
	ПечатьКопииЧеков = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ОбщиеПараметры.Касса, "ПечатьКопииЧеков");
	Если ПечатьКопииЧеков Тогда
		ПечатьКопииЧековКоличество = ПечатьКопииЧековКоличество + ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ОбщиеПараметры.Касса, "ПечатьКопииЧековКоличество");
	КонецЕсли;	 
	
	// Параметры.ТабличныйДокумент.КоличествоЭкземпляров = ПечатьКопииЧековКоличество;	
	
	Если Параметры.ПредварительныйПросмотр Тогда 
		Параметры.ТабличныйДокумент.Показать("Фискальный чек");
	Иначе                                 		
		Если Параметры.ИмяПринтера<>"" Тогда
			Параметры.ТабличныйДокумент.ИмяПринтера=Параметры.ИмяПринтера;				
		КонецЕсли; 
		
		КоличествоЧеков = 0;		
		Пока КоличествоЧеков < ПечатьКопииЧековКоличество Цикл 
			Параметры.ТабличныйДокумент.Напечатать(НЕ Параметры.ВыборПринтера); 
			КоличествоЧеков = КоличествоЧеков + 1;
		КонецЦикла;
	КонецЕсли;
	        
	Возврат Результат;

КонецФункции

// Функция осуществляет печать слип-чека
Функция ПечатьТекста(ОбъектДрайвера, Параметры, ПараметрыПодключения,
                       СтрокаТекста, ВыходныеПараметры)

	Результат  = Истина;
	ПараметрыПодключения.Вставить("СтрокаЛога", "");

	// Открываем чек
	Результат = ПодключаемоеОборудованиеХеликсЧековыйПринтерКассираСервер.ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, Ложь, Ложь, ВыходныеПараметры);

	// Печатаем строки чека
	Если Результат Тогда
		Для НомерСтроки = 1 По СтрЧислоСтрок(СтрокаТекста) Цикл
			ВыделеннаяСтрока = СтрПолучитьСтроку(СтрокаТекста, НомерСтроки);
			Если Найти(ВыделеннаяСтрока, Символ(Параметры.КодСимволаЧастичногоОтреза)) > 0 Тогда
				ТаблицаОплат = Новый Массив();
				Результат = ПодключаемоеОборудованиеХеликсЧековыйПринтерКассираСервер.ЗакрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаОплат, ВыходныеПараметры);
				Результат = ПодключаемоеОборудованиеХеликсЧековыйПринтерКассираСервер.ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, Ложь, Ложь, ВыходныеПараметры);
			Иначе
				Если НЕ ПодключаемоеОборудованиеХеликсЧековыйПринтерКассираСервер.НапечататьНефискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения,
				                                     ВыделеннаяСтрока, ВыходныеПараметры) Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	// Закрываем чек
	// Если Результат Тогда
	//	ТаблицаОплат = Новый Массив();
	//	Результат = ПодключаемоеОборудованиеХеликсЧековыйПринтерКассираСервер.ЗакрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаОплат, ВыходныеПараметры);
	// КонецЕсли;

	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПараметрыПодключения.СтрокаЛога);
	
	Параметры.ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если Параметры.Ширина = 80 Тогда
		Параметры.ТабличныйДокумент.Область("C15:C15").ШиринаКолонки = 8;
	ИначеЕсли Параметры.Ширина = 100 Тогда		
		Параметры.ТабличныйДокумент.Область("C15:C15").ШиринаКолонки = 18;
	КонецЕсли;	
	
	Если Параметры.ПредварительныйПросмотр Тогда 
		Параметры.ТабличныйДокумент.Показать("Фискальный чек");
	Иначе                                 		
		Если Параметры.ИмяПринтера<>"" Тогда
			Параметры.ТабличныйДокумент.ИмяПринтера=Параметры.ИмяПринтера;				
		КонецЕсли;    
		Параметры.ТабличныйДокумент.Напечатать(НЕ Параметры.ВыборПринтера); 
	КонецЕсли;	
	
	Возврат Результат;

КонецФункции


// Функция осуществляет внесение или выемку суммы на ФР.
//
Функция Инкассация(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТипИнкассации, Сумма, ВыходныеПараметры)

	Результат = Истина;

	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(?(ТипИнкассации = 1, НСтр("ru='Внесение на сумму';en='Introduction on amount of'"), НСтр("ru='Выемка на сумму';en='Notch on amount of'"))
	                                                 + " " + Сумма);

	// Заполнение выходных параметров
	ВыходныеПараметры.Добавить(1);
	ВыходныеПараметры.Добавить(1);
	ВыходныеПараметры.Добавить(0);
	ВыходныеПараметры.Добавить(ТекущаяДата());

	Возврат Результат;

КонецФункции

// Функция осуществляет снятие отчёта без гашения.
//
Функция НапечататьОтчетБезГашения(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	Результат = Истина;

	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Печать отчета без гашения';en='Print report without blanking'"));

	// Заполнение выходных параметров
	ВыходныеПараметры.Добавить(1);
	ВыходныеПараметры.Добавить(1);
	ВыходныеПараметры.Добавить(0);
	ВыходныеПараметры.Добавить(ТекущаяДата());

	Возврат Результат;

КонецФункции

// Функция осуществляет снятие отчёта с гашением.
//
Функция НапечататьОтчетСГашением(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	Результат = Истина;

	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Печать отчета с гашением';en='Print report with extinguishing'") + Символы.ПС
	                                                 + "----- " + НСтр("ru='Смена закрыта';en='Change isclosed'")
	                                                 + " -----");

	// Заполнение выходных параметров
	ВыходныеПараметры.Добавить(1);
	ВыходныеПараметры.Добавить(1);
	ВыходныеПараметры.Добавить(0);
	ВыходныеПараметры.Добавить(ТекущаяДата());

	Возврат Результат;

КонецФункции

#КонецОбласти 
