                         ////////// ОБЩИЕ КОМАНДЫ ВСЕХ ОБРАБОТЧИКОВ //////////////


#Область СлужебныеПроцедурыИФункции						 
						 
// Функция осуществляет подключение устройства.
//
// Параметры:
//  ОбъектДрайвера   - <*>
//           - ОбъектДрайвера драйвера торгового оборудования.
//
// Возвращаемое значение:
//  <Булево> - Результат работы функции.
//
Функция ПодключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	Результат = Истина;
    Протокол = 0;	
    РезультатДрайвера = 0;
	
	ВыходныеПараметры = Новый Массив();

	// Проверка параметров устройства
	Порт                       = Неопределено;
	Скорость                   = Неопределено;
    НомерЛУ                    = Неопределено;	
	Пароль                     = Неопределено;
    НаличнаяОплата             = Неопределено;	
	Секция                     = Неопределено;
	
	Параметры.Свойство("Порт"                      , Порт);
	Параметры.Свойство("Скорость"                  , Скорость);
	Параметры.Свойство("НомерЛУ"                   , НомерЛУ);
	Параметры.Свойство("Пароль"                    , Пароль);
    Параметры.Свойство("НаличнаяОплата"            , НаличнаяОплата);	
	Параметры.Свойство("Секция"                    , Секция);
	
	Если Порт                       = Неопределено
	 Или Скорость                   = Неопределено
	 Или НомерЛУ                    = Неопределено
	 Или Пароль                     = Неопределено
	 Или НаличнаяОплата             = Неопределено
	 Или Секция                     = Неопределено Тогда
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Не настроены параметры устройства.
		|Для корректной работы устройства необходимо задать параметры его работы.
		|Сделать это можно при помощи формы ""Настройка параметров"" модели
		|подключаемого оборудования в форме ""Подключение и настройка оборудования"".'"));

		Результат = Ложь;
	КонецЕсли;

	Если Результат Тогда
		Протокол = ПолучитьКодПротокола(Параметры.Модель);
		
        РезультатДрайвера = ОбъектДрайвера.Подключить(Параметры.НомерЛУ, Параметры.Порт, Параметры.Скорость, 
		                                              Параметры.Пароль, Параметры.Секция, Протокол);

		Если РезультатДрайвера<>0 Тогда
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить("");
			ПолучитьТекстОшибкиДрайвера(ОбъектДрайвера, Параметры, ВыходныеПараметры[1]);

			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Функция осуществляет отключение устройства.
//
// Параметры:
//  ОбъектДрайвера - <*>
//         - ОбъектДрайвера драйвера торгового оборудования.
//
// Возвращаемое значение:
//  <Булево> - Результат работы функции.
//
Функция ОтключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	Результат = Ложь;
    РезультатДрайвера = 0;

	ВыходныеПараметры = Новый Массив();
	
    РезультатДрайвера = ОбъектДрайвера.Отключить(Параметры.НомерЛУ);

	Если РезультатДрайвера<>0 Тогда
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		ПолучитьТекстОшибкиДрайвера(ОбъектДрайвера, Параметры, ВыходныеПараметры[1]);
	Иначе
		Результат = Истина;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Функция получает, обрабатывает и перенаправляет на исполнение команду к драйверу
//
Функция ВыполнитьКоманду(Команда, ВходныеПараметры = Неопределено, ВыходныеПараметры = Неопределено,
                         ОбъектДрайвера, Параметры, ПараметрыПодключения) Экспорт

	Результат = Истина;
    
	ВыходныеПараметры = Новый Массив();

	// Открыть смену
	Если Команда = "OpenDay" Тогда
		Результат = ОткрытьСмену(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);

	// Печать чека
	ИначеЕсли Команда = "PrintReceipt" Тогда
		ТаблицаНоменклатуры = ВходныеПараметры[0];
		ТаблицаОплат        = ВходныеПараметры[1];
		ОбщиеПараметры      = ВходныеПараметры[2];

		Результат = ПечатьЧека(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаНоменклатуры,
		                       ТаблицаОплат, ОбщиеПараметры, ВыходныеПараметры);

	// Печать слип чека
	ИначеЕсли Команда = "PrintText" Тогда
		СтрокаТекста   = ВходныеПараметры[0];

		Результат = ПечатьТекста(ОбъектДрайвера, Параметры, ПараметрыПодключения,
		                         СтрокаТекста, ВыходныеПараметры);

	// Печать чека внесения/выемки
	ИначеЕсли Команда = "Encash" Тогда
		ТипИнкассации = ВходныеПараметры[0];
		Сумма         = ВходныеПараметры[1];

		Результат = Инкассация(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТипИнкассации, Сумма, ВыходныеПараметры);

	// Печать отчета без гашения
	ИначеЕсли Команда = "PrintXReport" Тогда
		Результат = НапечататьОтчетБезГашения(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);

	// Печать отчета с гашением
	ИначеЕсли Команда = "PrintZReport" Тогда
		Результат = НапечататьОтчетСГашением(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);

	// Тестирование устройства
	ИначеЕсли Команда = "CheckHealth" Тогда
		Результат = ТестУстройства(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);

	// Получение версии драйвера
	ИначеЕсли Команда = "ПолучитьВерсиюДрайвера" Тогда
		Результат = ПолучитьВерсиюДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);

	// Указанная команда не поддерживается данным драйвером
	Иначе
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Команда ""%Команда%"" не поддерживается данным драйвером.'"));
		ВыходныеПараметры[1] = СтрЗаменить(ВыходныеПараметры[1], "%Команда%", Команда);
		Результат = Ложь;

	КонецЕсли;

	Возврат Результат;

КонецФункции


/////////////////////////////////////
// Функции-исполнители команд

///////// СПЕЦИФИЧНЫЕ ПО ТИПУ ОБОРУДОВАНИЯ КОМАНДЫ ////////////////

// Функция осуществляет открытие смены
Функция ОткрытьСмену(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	Результат = Истина;

	// Заполнение выходных параметров
	ВыходныеПараметры.Добавить(0);
	ВыходныеПараметры.Добавить(0);
	ВыходныеПараметры.Добавить(0);
	ВыходныеПараметры.Добавить(ТекущаяДата());

	Возврат Результат;

КонецФункции


// Осуществляет печать фискального чека
Функция ПечатьЧека(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаНоменклатуры,
                       ТаблицаОплат, ОбщиеПараметры, ВыходныеПараметры)

	Результат  = Истина;

	// Открываем чек
	Результат = ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения,
	                       ОбщиеПараметры[0] = 1, ОбщиеПараметры[1], ВыходныеПараметры);

	// Печатаем строки чека
	Если Результат Тогда
		Для ИндексМассива = 0 По ТаблицаНоменклатуры.Количество() - 1 Цикл
			Наименование  = ТаблицаНоменклатуры[ИндексМассива][0].Значение;
			Количество    = ТаблицаНоменклатуры[ИндексМассива][5].Значение;
			Цена          = ТаблицаНоменклатуры[ИндексМассива][4].Значение;
			ПроцентСкидки = ТаблицаНоменклатуры[ИндексМассива][8].Значение;
			Сумма         = ТаблицаНоменклатуры[ИндексМассива][9].Значение;
			НомерСекции   = ТаблицаНоменклатуры[ИндексМассива][3].Значение;
			СтавкаНДС     = ТаблицаНоменклатуры[ИндексМассива][12].Значение;

			Если НЕ НапечататьФискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения,
			                                   Наименование, Количество, Цена, ПроцентСкидки, Сумма,
			                                   НомерСекции, СтавкаНДС, ВыходныеПараметры) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	// Закрываем чек
	Если Результат Тогда
		Результат = ЗакрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаОплат, ВыходныеПараметры);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Осуществляет печать слип-чека
Функция ПечатьТекста(ОбъектДрайвера, Параметры, ПараметрыПодключения,
                       СтрокаТекста, ВыходныеПараметры)

	Результат  = Истина;

	// Открываем чек
	Результат = ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, Ложь, Ложь, ВыходныеПараметры);

	// Печатаем строки чека
	Если Результат Тогда
		Для НомерСтроки = 1 По СтрЧислоСтрок(СтрокаТекста) Цикл
			ВыделеннаяСтрока = СтрПолучитьСтроку(СтрокаТекста, НомерСтроки);
			Если Параметры.Свойство("КодСимволаЧастичногоОтреза") и  Найти(ВыделеннаяСтрока, Символ(Параметры.КодСимволаЧастичногоОтреза)) > 0 Тогда
				ТаблицаОплат = Новый Массив();
				Результат = ЗакрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаОплат, ВыходныеПараметры);
				Результат = ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, Ложь, Ложь, ВыходныеПараметры);
			Иначе
				Если НЕ НапечататьНефискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения,
				                                     ВыделеннаяСтрока, ВыходныеПараметры) Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	// Закрываем чек
	Если Результат Тогда
		ТаблицаОплат = Новый Массив();
		Результат = ЗакрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаОплат, ВыходныеПараметры);
	КонецЕсли;

	Возврат Результат;

КонецФункции


// Функция осуществляет открытие нового чека.
//
Функция ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ЧекВозврата, ФискальныйЧек, ВыходныеПараметры)
	
	Результат  = Истина;
	НомерСмены = 0;
	НомерЧека  = 0;
    РезультатДрайвера = 0;
		
	// Открываем чек
	РезультатДрайвера = ОбъектДрайвера.ОткрытьЧек(Параметры.НомерЛУ, ФискальныйЧек, ЧекВозврата);
										  
	Если РезультатДрайвера<>0 Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		ПолучитьТекстОшибкиДрайвера(ОбъектДрайвера, Параметры, ВыходныеПараметры[1]);
		Результат = Ложь;
	Иначе
		// Заполнение выходных параметров
		НомерЧека = ОбъектДрайвера.НомерЧека;
		НомерСмены = ОбъектДрайвера.НомерСмены;
		
		ВыходныеПараметры.Добавить(НомерСмены);
		ВыходныеПараметры.Добавить(НомерЧека);
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(ТекущаяДата())
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Функция осуществляет печать фискальной строки.
//
Функция НапечататьФискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения,
                                   Наименование, Количество, Цена, ПроцентСкидки, Сумма,
                                   НомерСекции, СтавкаНДС, ВыходныеПараметры)
	Результат = Истина;
	РезультатДрайвера = 0;

	РезультатДрайвера = ОбъектДрайвера.НапечататьФискСтроку(Параметры.НомерЛУ, Наименование, Количество,
	                                                        Цена, Сумма, НомерСекции, СтавкаНДС);
	Если РезультатДрайвера<>0 Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		ПолучитьТекстОшибкиДрайвера(ОбъектДрайвера, Параметры, ВыходныеПараметры[1]);
		
	    Результат = Ложь;
		ОтменитьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Функция осуществляет печать нефискальной строки.
//
Функция НапечататьНефискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения, СтрокаТекста, ВыходныеПараметры)
	
	Результат = Истина;
	РезультатДрайвера = 0;
	
	РезультатДрайвера = ОбъектДрайвера.НапечататьНефискСтроку(Параметры.НомерЛУ, СтрокаТекста);
	
	Если РезультатДрайвера<>0 Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		ПолучитьТекстОшибкиДрайвера(ОбъектДрайвера, Параметры, ВыходныеПараметры[1]);
		
	    Результат = Ложь;
		ОтменитьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Функция осуществляет закрытие ранее открытого чека.
//
Функция ЗакрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаОплат, ВыходныеПараметры)
	
	Результат = Истина;
	РезультатДрайвера = 0;
	
	СуммаНаличнойОплаты    = 0;
	СуммаБезналичнойОплаты = 0;

	Для ИндексОплаты = 0 По ТаблицаОплат.Количество() - 1 Цикл
		Если ТаблицаОплат[ИндексОплаты][0].Значение = 0 Тогда
			СуммаНаличнойОплаты = СуммаНаличнойОплаты + ТаблицаОплат[ИндексОплаты][1].Значение;
		Иначе
			СуммаБезналичнойОплаты = СуммаБезналичнойОплаты + ТаблицаОплат[ИндексОплаты][1].Значение;
		КонецЕсли;
	КонецЦикла;

	РезультатДрайвера = ОбъектДрайвера.ЗакрытьЧек(Параметры.НомерЛУ, СуммаНаличнойОплаты, СуммаБезналичнойОплаты);
	                                        	  
	Если РезультатДрайвера<>0 Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		ПолучитьТекстОшибкиДрайвера(ОбъектДрайвера, Параметры, ВыходныеПараметры[1]);
		
	    Результат = Ложь;
		ОтменитьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Функция осуществляет отмену ранее открытого чека.
//
Функция ОтменитьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Истина;
	РезультатДрайвера = 0;
	
	РезультатДрайвера = ОбъектДрайвера.ОтменитьЧек(Параметры.НомерЛУ);
	
	Если РезультатДрайвера<>0 Тогда
		Результат = Ложь;		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет внесение или выемку суммы на ФР.
//
Функция Инкассация(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТипИнкассации, Сумма, ВыходныеПараметры)
	
	Результат = Истина;
	РезультатДрайвера = 0;
	
	РезультатДрайвера = ОбъектДрайвера.НапечататьЧекВнесенияВыемки(Параметры.НомерЛУ, ?(ТипИнкассации = 1, Сумма, -Сумма));
	
	Если РезультатДрайвера<>0 Тогда
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		ПолучитьТекстОшибкиДрайвера(ОбъектДрайвера, Параметры, ВыходныеПараметры[1]);
		
		Результат = Ложь;		
		ОтменитьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
	Иначе
		// Заполнение выходных параметров
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(ТекущаяДата());
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Функция осуществляет снятие отчёта без гашения.
//
Функция НапечататьОтчетБезГашения(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Истина;
	РезультатДрайвера = 0;
	
	// Печать X-отчета
	    // 0 - Полный отчет
		// 1 - Включить в X/Z отчёт накопления по кассирам, полный отчет
		// 2 - Включить в X/Z отчёт накопления по секциям, полный отчет
		// 3 - Включить в X/Z отчёт накопления по кассирам и секциям, полный отчет
		// 4 - Краткий отчет (без печати нулевых счётчиков)
		// 5 - Включить в X/Z отчёт накопления по кассирам, краткий отчет (без печати нулевых счётчиков)
		// 6 - Включить в X/Z отчёт накопления по секциям, краткий отчет (без печати нулевых счётчиков)
		// 7 - Включить в X/Z отчёт накопления по кассирам и секциям, краткий отчет (без печати нулевых счётчиков)
	РезультатДрайвера = ОбъектДрайвера.НапечататьОтчетБезГашения(Параметры.НомерЛУ, 4);  // краткий отчет
	
	Если РезультатДрайвера<>0 Тогда
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		ПолучитьТекстОшибкиДрайвера(ОбъектДрайвера, Параметры, ВыходныеПараметры[1]);
		
		Результат = Ложь;		
		ОтменитьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
	Иначе
		// Заполнение выходных параметров
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(ТекущаяДата());
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Функция осуществляет снятие отчёта с гашением.
//
Функция НапечататьОтчетСГашением(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Истина;
	РезультатДрайвера = 0;
	
	// Печать Z-отчета
		// 0 - Полный отчет
		// 1 - Включить в X/Z отчёт накопления по кассирам, полный отчет
		// 2 - Включить в X/Z отчёт накопления по секциям, полный отчет
		// 3 - Включить в X/Z отчёт накопления по кассирам и секциям, полный отчет
		// 4 - Краткий отчет (без печати нулевых счётчиков)
		// 5 - Включить в X/Z отчёт накопления по кассирам, краткий отчет (без печати нулевых счётчиков)
		// 6 - Включить в X/Z отчёт накопления по секциям, краткий отчет (без печати нулевых счётчиков)
		// 7 - Включить в X/Z отчёт накопления по кассирам и секциям, краткий отчет (без печати нулевых счётчиков)
	РезультатДрайвера = ОбъектДрайвера.НапечататьОтчетСГашением(Параметры.НомерЛУ, 4);   // краткий отчет
	
	Если РезультатДрайвера<>0 Тогда
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		ПолучитьТекстОшибкиДрайвера(ОбъектДрайвера, Параметры, ВыходныеПараметры[1]);
		
		Результат = Ложь;		
		ОтменитьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
	Иначе
		// Заполнение выходных параметров
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(ТекущаяДата());
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

//////////// ДОПОЛНИТЕЛЬНЫЕ КОМАНДЫ ////////////////////

// Функция осуществляет тестирование ФР.
//
Функция ТестУстройства(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Истина;
	Протокол = 0;
	РезультатДрайвера = 0;

	Протокол = ПолучитьКодПротокола(Параметры.Модель);
	
    РезультатДрайвера = ОбъектДрайвера.ТестУстройства(Параметры.НомерЛУ, Параметры.Порт, Параметры.Скорость, 
	                                                  Параметры.Пароль, Параметры.Секция, Протокол);
    
	ВыходныеПараметры.Добавить(?(РезультатДрайвера=0, 0, 999));
	ВыходныеПараметры.Добавить(ОбъектДрайвера.РезультатТеста);

	Возврат Результат;
	
КонецФункции

// Функция возвращает версию установленного драйвера
//
Функция ПолучитьВерсиюДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Истина;

	ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
	ВыходныеПараметры.Добавить(НСтр("ru='Не определена'"));

	Попытка
		ОбъектДрайвера.ПолучитьНомерВерсииДрайвера();
		ВыходныеПараметры[1] = ОбъектДрайвера.ВерсияДрайвера;
	Исключение
		Результат = Ложь;	 
	КонецПопытки;

	Возврат Результат;
	
КонецФункции

Функция ПолучитьТекстОшибкиДрайвера(ОбъектДрайвера, Параметры, ТекстОшибки)
	
	Результат = Истина;	
	ТекстОшибки = "";
	
	Попытка
		ОбъектДрайвера.ПолучитьОшибку(Параметры.НомерЛУ); 
		ТекстОшибки = ОбъектДрайвера.ТекстОшибки;
	Исключение
		Результат = Ложь;	 
	КонецПопытки;
	
	Возврат Результат;	
	
КонецФункции

///////// ВСПОМОГАТЕЛЬНЫЕ МЕТОДЫ ОБРАБОТЧИКА ///////////

// Возвращает по наименованию модели код протокола устройства
//
Функция ПолучитьКодПротокола(Модель)
	
	КодПротокола = 0;

	Протоколы = Новый Соответствие;
	
    Протоколы["Инкотекс-Меркурий-ФР"]                 =  0;
	Протоколы["Меркурий-114.1Ф"]                      =  1;
	Протоколы["Меркурий-СИСТЕМА-Ф"]                   =  2;
	Протоколы["Меркурий MS-K"]                        =  3;
	Протоколы["Меркурий-114.1К"]                      =  4;
	Протоколы["Меркурий-114.1ФMD (молдавская)"]       =  5;
	Протоколы["Меркурий-СИСТЕМА-К"]                   =  6;
	Протоколы["Меркурий-118К"]                        =  7;
	Протоколы["Меркурий-119К"]                        =  8;
	Протоколы["Меркурий-119ФAZ (азербайджанская)"]    =  9;
	Протоколы["Гепард НТС-ФBY (белорусская)"]         = 10;
	Протоколы["MSTAR-ФKZ (казахская)"]                = 11;
	
	Попытка
		КодПротокола = Протоколы[Модель];
	Исключение
	КонецПопытки;

	Возврат КодПротокола;
	
КонецФункции

#КонецОбласти
