
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Идентификатор", Идентификатор);
	Заголовок = НСтр("ru='ФР'") + " """ + Строка(Идентификатор) + """";

	СпПорт = Элементы.Порт.СписокВыбора;
	Индекс = Неопределено;
	Для Индекс = 1 По 32 Цикл
		СпПорт.Добавить(Индекс, "COM" + СокрЛП(Индекс));
	КонецЦикла;

	СпСкорость = Элементы.Скорость.СписокВыбора;
	СпСкорость.Добавить(2400,   "2400");
	СпСкорость.Добавить(4800,   "4800");
	СпСкорость.Добавить(9600,   "9600");
	СпСкорость.Добавить(19200,  "19200");
	СпСкорость.Добавить(38400,  "38400");
	СпСкорость.Добавить(57600,  "57600");
	СпСкорость.Добавить(115200, "115200");
	
	СпШиринаЧека = Элементы.ШиринаЧека.СписокВыбора;
	СпШиринаЧека.Добавить(24,   "24");
	СпШиринаЧека.Добавить(32,   "32");
	СпШиринаЧека.Добавить(36,   "36");
	СпШиринаЧека.Добавить(40,   "40");
	СпШиринаЧека.Добавить(48,   "48");
	
	времПорт                       = Неопределено;
	времСкорость                   = Неопределено;
	времШиринаЧека                 = Неопределено;
	времТаймаут                    = Неопределено;
	времПарольПользователя         = Неопределено;
	времПарольАдминистратора       = Неопределено;
	времОтменятьЧекПриПодключении  = Неопределено;
	времНаименованиеОплаты1        = Неопределено;
	времНаименованиеОплаты2        = Неопределено;
	времНомерСекции                = Неопределено;
	времКодСимволаЧастичногоОтреза = Неопределено;
	времЖурналОперацийДрайвера     = Неопределено;
	времМодель                     = Неопределено;
	
	времТипПодключения             = Неопределено;
	времИмяКомпьютера              = Неопределено;
	времIPАдрес		               = Неопределено;
	времTCPПорт              	   = Неопределено;
	
	времИспользоватьДенежныйЯщик   = Неопределено;
	
	времНомерПроизводителя		   = Неопределено;
	времРегистрационныйНомер	   = Неопределено;
	
	Параметры.Свойство("Порт"                      , времПорт);
	Параметры.Свойство("Скорость"                  , времСкорость);
	Параметры.Свойство("ШиринаЧека"                , времШиринаЧека);
	Параметры.Свойство("Таймаут"                   , времТаймаут);
	Параметры.Свойство("ПарольПользователя"        , времПарольПользователя);
	Параметры.Свойство("ПарольАдминистратора"      , времПарольАдминистратора);
	Параметры.Свойство("ОтменятьЧекПриПодключении" , времОтменятьЧекПриПодключении);
	Параметры.Свойство("НаименованиеОплаты1"       , времНаименованиеОплаты1);
	Параметры.Свойство("НаименованиеОплаты2"       , времНаименованиеОплаты2);
	Параметры.Свойство("НомерСекции"               , времНомерСекции);
	Параметры.Свойство("КодСимволаЧастичногоОтреза", времКодСимволаЧастичногоОтреза);
	Параметры.Свойство("ЖурналОперацийДрайвера"    , времЖурналОперацийДрайвера);
	Параметры.Свойство("Модель"                    , времМодель);
	
	Параметры.Свойство("ТипПодключения"            , времТипПодключения);
	Параметры.Свойство("ИмяКомпьютера"             , времИмяКомпьютера);
	Параметры.Свойство("IPАдрес"                   , времIPАдрес);
	Параметры.Свойство("TCPПорт"                   , времTCPПорт);
	
	Параметры.Свойство("ИспользоватьДенежныйЯщик"  , времИспользоватьДенежныйЯщик);

    Параметры.Свойство("НомерПроизводителя"        , времНомерПроизводителя);
	Параметры.Свойство("РегистрационныйНомер"      , времРегистрационныйНомер);

	Порт                       = ?(времПорт                       = Неопределено,      1, времПорт);
	Скорость                   = ?(времСкорость                   = Неопределено, 115200, времСкорость);
	ШиринаЧека                 = ?(времШиринаЧека                 = Неопределено, 32, времШиринаЧека);
	Таймаут                    = ?(времТаймаут                    = Неопределено,    150, времТаймаут);
	ПарольПользователя         = ?(времПарольПользователя         = Неопределено,    "1", времПарольПользователя);
	ПарольАдминистратора       = ?(времПарольАдминистратора       = Неопределено,   "30", времПарольАдминистратора);
	ОтменятьЧекПриПодключении  = ?(времОтменятьЧекПриПодключении  = Неопределено,   Ложь, времОтменятьЧекПриПодключении);
	НаименованиеОплаты1        = ?(времНаименованиеОплаты1        = Неопределено,     "", времНаименованиеОплаты1);
	НаименованиеОплаты2        = ?(времНаименованиеОплаты2        = Неопределено,     "", времНаименованиеОплаты2);
	НомерСекции                = ?(времНомерСекции                = Неопределено,      0, времНомерСекции);
	КодСимволаЧастичногоОтреза = ?(времКодСимволаЧастичногоОтреза = Неопределено,     22, времКодСимволаЧастичногоОтреза);
	ЖурналОперацийДрайвера     = ?(времЖурналОперацийДрайвера     = Неопределено,   Ложь, времЖурналОперацийДрайвера);
	Модель                     = ?(времМодель                     = Неопределено, Элементы.Модель.СписокВыбора[0], времМодель);
	
	ТипПодключения             = ?(времТипПодключения             = Неопределено, Элементы.ТипПодключения.СписокВыбора[0], времТипПодключения);
	ИмяКомпьютера              = ?(времИмяКомпьютера              = Неопределено, "", времИмяКомпьютера);
	IPАдрес                    = ?(времIPАдрес                    = Неопределено, "", времIPАдрес);
	TCPПорт                    = ?(времTCPПорт                    = Неопределено, "211", времTCPПорт);

	ИспользоватьДенежныйЯщик   = ?(времИспользоватьДенежныйЯщик   = Неопределено, ЛОжь, времИспользоватьДенежныйЯщик);
	
	НомерПроизводителя		   = ?(времНомерПроизводителя		  = Неопределено, 	  "", времНомерПроизводителя);
	РегистрационныйНомер	   = ?(времРегистрационныйНомер		  = Неопределено, 	  "", времРегистрационныйНомер);
	
	Элементы.ТестУстройства.Видимость    = (ПараметрыСеанса.РабочееМестоКлиента = Идентификатор.РабочееМесто);
	Элементы.УстановитьДрайвер.Видимость = (ПараметрыСеанса.РабочееМестоКлиента = Идентификатор.РабочееМесто);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьИнформациюОДрайвере();
	
	ОбновитьВидимостьЭлементов();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТестУстройства(Команда)

	РезультатТеста    = Неопределено;

	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;

	времПараметрыУстройства = Новый Структура();
	времПараметрыУстройства.Вставить("Порт"                      , Порт);
	времПараметрыУстройства.Вставить("Скорость"                  , Скорость);
	времПараметрыУстройства.Вставить("ШиринаЧека"                , ШиринаЧека);
	времПараметрыУстройства.Вставить("Таймаут"                   , Таймаут);
	времПараметрыУстройства.Вставить("ПарольПользователя"        , ПарольПользователя);
	времПараметрыУстройства.Вставить("ПарольАдминистратора"      , ПарольАдминистратора);
	времПараметрыУстройства.Вставить("ОтменятьЧекПриПодключении" , ОтменятьЧекПриПодключении);
	времПараметрыУстройства.Вставить("НаименованиеОплаты1"       , НаименованиеОплаты1);
	времПараметрыУстройства.Вставить("НаименованиеОплаты2"       , НаименованиеОплаты2);
	времПараметрыУстройства.Вставить("НомерСекции"               , НомерСекции);
	времПараметрыУстройства.Вставить("КодСимволаЧастичногоОтреза", КодСимволаЧастичногоОтреза);
	времПараметрыУстройства.Вставить("ЖурналОперацийДрайвера"    , ЖурналОперацийДрайвера);
	времПараметрыУстройства.Вставить("Модель"                    , Модель);
	
	времПараметрыУстройства.Вставить("ТипПодключения"            , ТипПодключения);
	времПараметрыУстройства.Вставить("ИмяКомпьютера"             , ИмяКомпьютера);
	времПараметрыУстройства.Вставить("IPАдрес"                   , IPАдрес);
	времПараметрыУстройства.Вставить("TCPПорт"                   , TCPПорт);
	

	Результат = МенеджерОборудованияКлиент.ВыполнитьДополнительнуюКоманду("CheckHealth",
	                                                                      ВходныеПараметры,
	                                                                      ВыходныеПараметры,
	                                                                      Идентификатор,
	                                                                      времПараметрыУстройства);

	ДополнительноеОписание = ?(ТипЗнч(ВыходныеПараметры) = Тип("Массив")
	                           И ВыходныеПараметры.Количество(),
	                           НСтр("ru = 'Дополнительное описание:'") + " " + ВыходныеПараметры[1],
	                           "");
	Если Результат Тогда
		ТекстСообщения = НСтр("ru = 'Тест успешно выполнен.%ПереводСтроки%%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПереводСтроки%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                  "",
		                                                                  Символы.ПС));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                           "",
		                                                                           ДополнительноеОписание));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		ТекстСообщения = НСтр("ru = 'Тест не пройден.%ПереводСтроки%%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПереводСтроки%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                  "",
		                                                                  Символы.ПС));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                           "",
		                                                                           ДополнительноеОписание));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДрайвер(Команда)

	МенеджерОборудованияКлиент.УстановитьДрайвер(Идентификатор);

	ОбновитьИнформациюОДрайвере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьИнформациюОДрайвере()

	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;

	времПараметрыУстройства = Новый Структура();
	времПараметрыУстройства.Вставить("Порт"                      , Порт);
	времПараметрыУстройства.Вставить("Скорость"                  , Скорость);
	времПараметрыУстройства.Вставить("ШиринаЧека"                , ШиринаЧека);
	времПараметрыУстройства.Вставить("Таймаут"                   , Таймаут);
	времПараметрыУстройства.Вставить("ПарольПользователя"        , ПарольПользователя);
	времПараметрыУстройства.Вставить("ПарольАдминистратора"      , ПарольАдминистратора);
	времПараметрыУстройства.Вставить("ОтменятьЧекПриПодключении" , ОтменятьЧекПриПодключении);
	времПараметрыУстройства.Вставить("НаименованиеОплаты1"       , НаименованиеОплаты1);
	времПараметрыУстройства.Вставить("НаименованиеОплаты2"       , НаименованиеОплаты2);
	времПараметрыУстройства.Вставить("НомерСекции"               , НомерСекции);
	времПараметрыУстройства.Вставить("КодСимволаЧастичногоОтреза", КодСимволаЧастичногоОтреза);
	времПараметрыУстройства.Вставить("ЖурналОперацийДрайвера"    , ЖурналОперацийДрайвера);
	времПараметрыУстройства.Вставить("Модель"                    , Модель);
	
	времПараметрыУстройства.Вставить("ТипПодключения"            , ТипПодключения);
	времПараметрыУстройства.Вставить("ИмяКомпьютера"             , ИмяКомпьютера);
	времПараметрыУстройства.Вставить("IPАдрес"                   , IPАдрес);
	времПараметрыУстройства.Вставить("TCPПорт"                   , TCPПорт);
	
	времПараметрыУстройства.Вставить("ИспользоватьДенежныйЯщик"  , ИспользоватьДенежныйЯщик);


	Если МенеджерОборудованияКлиент.ВыполнитьДополнительнуюКоманду("ПолучитьВерсиюДрайвера",
	                                                               ВходныеПараметры,
	                                                               ВыходныеПараметры,
	                                                               Идентификатор,
	                                                               времПараметрыУстройства) Тогда
		Драйвер = ВыходныеПараметры[0];
		Версия  = ВыходныеПараметры[1];
	Иначе
		Если ВыходныеПараметры <> Неопределено Тогда
			Драйвер = ВыходныеПараметры[2];
		КонецЕсли;
		Версия  = НСтр("ru='Не определена'");
	КонецЕсли;

	Элементы.УстановитьДрайвер.Видимость = Не (Драйвер = НСтр("ru='Установлен'"));

КонецПроцедуры

&НаКлиенте
Процедура ТипПодключенияПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ВидАдресаПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()

	Если ТипПодключения = "0" Тогда 
		
		Элементы.ИмяКомпьютера.Видимость = Ложь;
		Элементы.IPАдрес.Видимость = Ложь;
		Элементы.TCPПорт.Видимость = Ложь;
		Элементы.ВидАдреса.Видимость = Ложь;
		
	ИначеЕсли ТипПодключения = "1" Тогда 
	
		Элементы.ИмяКомпьютера.Видимость = Истина;
		Элементы.IPАдрес.Видимость = Истина;
		Элементы.TCPПорт.Видимость = Истина;
		Элементы.ВидАдреса.Видимость = Истина;
		
	ИНачеЕсли ТипПодключения = "2" Тогда
		
		Элементы.ИмяКомпьютера.Видимость = Истина;
		Элементы.IPАдрес.Видимость = Истина;
		Элементы.TCPПорт.Видимость = Ложь;
		Элементы.ВидАдреса.Видимость = Истина;
		
	КонецЕсли;
	
	Если (ТипПодключения = 1 или ТипПодключения = 2) Тогда
		
		Если ВидАдреса Тогда 
		   	Элементы.IPАдрес.Видимость = Ложь;
			Элементы.ИмяКомпьютера.Видимость = Истина;
		Иначе
			Элементы.IPАдрес.Видимость = Истина;
			Элементы.ИмяКомпьютера.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


// Процедура представляет обработчик события "Нажатие" кнопки
// "ОК" командной панели "ОсновныеДействияФормы".
//
// Параметры:
//  Кнопка - <КнопкаКоманднойПанели>
//         - Кнопка, с которой связано данное событие (кнопка "ОК").
//
&НаКлиенте
Процедура ЗаписатьИЗакрытьВыполнить()

	Параметры.ПараметрыНастройки.Добавить(Порт                      , "Порт");
	Параметры.ПараметрыНастройки.Добавить(Скорость                  , "Скорость");
	Параметры.ПараметрыНастройки.Добавить(ШиринаЧека                , "ШиринаЧека");
	Параметры.ПараметрыНастройки.Добавить(Таймаут                   , "Таймаут");
	Параметры.ПараметрыНастройки.Добавить(ПарольПользователя        , "ПарольПользователя");
	Параметры.ПараметрыНастройки.Добавить(ПарольАдминистратора      , "ПарольАдминистратора");
	Параметры.ПараметрыНастройки.Добавить(ОтменятьЧекПриПодключении , "ОтменятьЧекПриПодключении");
	Параметры.ПараметрыНастройки.Добавить(НаименованиеОплаты1       , "НаименованиеОплаты1");
	Параметры.ПараметрыНастройки.Добавить(НаименованиеОплаты2       , "НаименованиеОплаты2");
	Параметры.ПараметрыНастройки.Добавить(НомерСекции               , "НомерСекции");
	Параметры.ПараметрыНастройки.Добавить(КодСимволаЧастичногоОтреза, "КодСимволаЧастичногоОтреза");
	Параметры.ПараметрыНастройки.Добавить(ЖурналОперацийДрайвера    , "ЖурналОперацийДрайвера");
	Параметры.ПараметрыНастройки.Добавить(Модель                    , "Модель");
	
	Параметры.ПараметрыНастройки.Добавить(ТипПодключения            , "ТипПодключения");
	Параметры.ПараметрыНастройки.Добавить(ИмяКомпьютера             , "ИмяКомпьютера");
	Параметры.ПараметрыНастройки.Добавить(IPАдрес                   , "IPАдрес");
	Параметры.ПараметрыНастройки.Добавить(TCPПорт                   , "TCPПорт");
	
	Параметры.ПараметрыНастройки.Добавить(ИспользоватьДенежныйЯщик  , "ИспользоватьДенежныйЯщик");

	Параметры.ПараметрыНастройки.Добавить(НомерПроизводителя        , "НомерПроизводителя");
	Параметры.ПараметрыНастройки.Добавить(РегистрационныйНомер      , "РегистрационныйНомер");

	ОчиститьСообщения();
	Закрыть(КодВозвратаДиалога.ОК);

КонецПроцедуры // ОсновныеДействияФормыОК()

#КонецОбласти