
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СкрытьНеИспользуемыеТриггеры = РегистрыСведений.НастройкиИнтерфейсов.ПолучитьЗначениеНастройкиПользователя("Триггеры_СкрытьНеИспользуемые", Ложь);
	Если СкрытьНеИспользуемыеТриггеры Тогда 	
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Активно", СкрытьНеИспользуемыеТриггеры, ЗначениеЗаполнено(СкрытьНеИспользуемыеТриггеры));
	Иначе 
		МассивСтатусов = Новый Массив;
		МассивСтатусов.Добавить(Истина);
		МассивСтатусов.Добавить(Ложь);
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Активно", МассивСтатусов, Истина, ВидСравненияКомпоновкиДанных.ВСписке);	
	КонецЕсли;	
	Элементы.СкрытьНеИспользуемые.Пометка = СкрытьНеИспользуемыеТриггеры;
	
	// Механизм использования данной формы списка как формы выбора
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	Если Параметры.МножественныйВыбор <> Неопределено Тогда
		Элементы.Список.МножественныйВыбор = Параметры.МножественныйВыбор;
	КонецЕсли;
	// Обход автоматического сохранения пользовательских настроек для разных режимов, спасибо @stolya
	Если Параметры.РежимВыбора И Не ЗначениеЗаполнено(Параметры.КлючПользовательскихНастроек) Тогда
		Параметры.КлючПользовательскихНастроек = "РежимВыбора";
		Список.АвтоматическоеСохранениеПользовательскихНастроек = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перед закрытием
//
// Параметры:
//  Отказ				 - 	 - 
//  ЗавершениеРаботы	 - 	 - 
//  ТекстПредупреждения	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы = Истина Тогда 
		
	Иначе 	
		ПередЗакрытиемНаСервере(СкрытьНеИспользуемыеТриггеры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Скрыть не используемые
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СкрытьНеИспользуемые(Команда)
	
	СкрытьНеИспользуемыеТриггеры = НЕ СкрытьНеИспользуемыеТриггеры;
	Элементы.СкрытьНеИспользуемые.Пометка = СкрытьНеИспользуемыеТриггеры;
	Если СкрытьНеИспользуемыеТриггеры Тогда 
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Активно", СкрытьНеИспользуемыеТриггеры, ЗначениеЗаполнено(СкрытьНеИспользуемыеТриггеры));	
	Иначе
		МассивСтатусов = Новый Массив;
		МассивСтатусов.Добавить(Истина);
		МассивСтатусов.Добавить(Ложь);
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Активно", МассивСтатусов, Истина, ВидСравненияКомпоновкиДанных.ВСписке);	
	КонецЕсли;	
	//Если Элементы.Список.Развернут(Элементы.Список.ТекущаяСтрока) Тогда
	//	Элементы.Список.Свернуть(Элементы.Список.ТекущаяСтрока);
	//Иначе
		Элементы.Список.Развернуть(Элементы.Список.ТекущаяСтрока);
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Процедура - Перед закрытием на сервере
//
Процедура ПередЗакрытиемНаСервере(СкрытьНеИспользуемыеТриггеры)

	РегистрыСведений.НастройкиИнтерфейсов.ЗаписатьЗначениеНастройкиПользователя("Триггеры_СкрытьНеИспользуемые", СкрытьНеИспользуемыеТриггеры);
	
КонецПроцедуры

#КонецОбласти
