
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ЗаполнитьСписокПоДоступнымУчетнымЗаписямПользователя();
			
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик оповещения формы
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыУчетныеЗаписиПользователей"
		 ИЛИ ИмяСобытия = "ПолученаЭлектроннаяПочта"
		 ИЛИ ИмяСобытия = "ИзмененоЭлектронноеПисьмо" Тогда
		
		ЗаполнитьСписокПоДоступнымУчетнымЗаписямПользователя(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура обрабатывает событие нажатия элемента формы "СсылкаУчетныеЗаписиЭлПочты"
//
Процедура СсылкаУчетныеЗаписиЭлПочтыНажатие(Элемент)
	
	ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - обработчик команды "Получить почту"
//
Процедура ПолучитьПочту(Команда)
	
	УправлениеЭлектроннойПочтойКлиент.ЗагрузитьПочтуПользователя(Элементы.СписокПисем);
	Оповестить("ПолученаЭлектроннаяПочта");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМенеджерПочты(Команда)
	
	ОткрытьФорму("Обработка.МенеджерПочты.Форма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Функция возвращает массив учетных записей электронной почты,
// доступных текущему пользователю
Функция ПолучитьМассивДоступныхУчетныхЗаписейЭлПочты()
	
	УстановитьПривилегированныйРежим(Истина);
		
	ТЗУчетныеЗаписи = Справочники.УчетныеЗаписиЭлектроннойПочты.ВернутьУчетныеЗаписиЭлектроннойПочтыОбщиеИЛичные(ПараметрыСеанса.ТекущийПользователь, Истина, Ложь, Ложь, Ложь);			
	Возврат ТЗУчетныеЗаписи.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
// Процедура - обработчик события "Выбор" элемента формы "СписокПисем"
//
Процедура СписокПисемВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокПисем.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено 
	   И Не ТекущиеДанные.Рассмотрено Тогда
	   
	    УстановитьРассмотренностьПисьма(ТекущиеДанные.Ссылка);
		Элементы.СписокПисем.Обновить();
		
		Оповестить("ИзмененоЭлектронноеПисьмо", ТекущиеДанные.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура устанавливает рассмотренность переданного письма
// т.е. отмечает его как прочитанное
//
Процедура УстановитьРассмотренностьПисьма(ТекущееПисьмо)
	
	ПисьмоОбъект = ТекущееПисьмо.ПолучитьОбъект();
	ПисьмоОбъект.Рассмотрено = Истина;
	ПисьмоОбъект.Записать();
	
КонецПроцедуры // УстановитьРассмотренностьПисьма()

&НаСервере
// Процедура производит установку параметров списка писем,
// в соответствии с доступными данному пользователю учетными записями
//
Функция ЗаполнитьСписокПоДоступнымУчетнымЗаписямПользователя(ОбновитьСписок = Ложь)
	
	МассивУчетныхЗаписей = ПолучитьМассивДоступныхУчетныхЗаписейЭлПочты();
	НетДоступныхУчетныхЗаписей = (МассивУчетныхЗаписей.Количество() = 0);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокПисем, "МассивУчетныхЗаписей", МассивУчетныхЗаписей);
	
	Если ОбновитьСписок И (НетДоступныхУчетныхЗаписей = Ложь) Тогда
		Элементы.СписокПисем.Обновить();
	КонецЕсли;
	
	ОпределитьВидимостьЭлементовФормы(НетДоступныхУчетныхЗаписей);
	
	Возврат НетДоступныхУчетныхЗаписей;
	
КонецФункции

&НаСервере
Процедура ОпределитьВидимостьЭлементовФормы(НетДоступныхУчетныхЗаписей)
	
	// Если у пользователя нет доступных учетных записей - вместо списка писем он увидит предупреждение
	Элементы.ГруппаСпискаПисем.Видимость = НЕ НетДоступныхУчетныхЗаписей;
	Элементы.ГруппаПредупреждения.Видимость = НетДоступныхУчетныхЗаписей;
	
	// Ссылки будут видны только тем, у кого есть соответствующме права
	Элементы.СсылкаУчетныеЗаписиЭлПочты.Видимость = ?(НетДоступныхУчетныхЗаписей,
													  ПравоДоступа("Редактирование", Метаданные.Справочники.УчетныеЗаписиЭлектроннойПочты),
													  Ложь);
													  
													  
														  
													
КонецПроцедуры

#КонецОбласти


