
&НаКлиенте
Перем МинКолСимволовПоиска;	// Хранит минимальное кол. символов для поиска  

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере"
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
	// Ищем пациента по телефону (из предв. записи)
	Параметры.Отбор.Свойство("Телефон", ФильтрТелефон);
	
	// Открытие формы с заданным условием поиска
	Параметры.Свойство("НомерТелефона"	, ФильтрТелефон);
	Параметры.Свойство("Фамилия"		, ФильтрФамилия);
	Параметры.Свойство("Имя"			, ФильтрИмя);
	Параметры.Свойство("Отчество"		, ФильтрОтчество);
	Параметры.Свойство("ДатаРождения"	, ФильтрДатаРождения);
	Параметры.Свойство("НомерМедКарты"	, ФильтрНомерМедКарты);
	
	Если Параметры.Свойство("СтрокаПоиска") Тогда 
		ФИО 			= ОбщегоНазначения.ВернутьФИОКлиента(Параметры.СтрокаПоиска);			
		ФильтрФамилия 	= ?(ЗначениеЗаполнено(ФИО.Фамилия), ФИО.Фамилия, "");
		ФильтрИмя 		= ?(ЗначениеЗаполнено(ФИО.Имя), ФИО.Имя, "");
		ФильтрОтчество 	= ?(ЗначениеЗаполнено(ФИО.Отчество), ФИО.Отчество, "");
	КонецЕсли;
	
	// Если передан массив дублей клиентов.
	МассивДублей = Неопределено;
	Параметры.Свойство("МассивДублей", МассивДублей);
	
	Если ЗначениеЗаполнено(МассивДублей) Тогда 
		ФильтрТелефон = МассивДублей[0].Телефон;
	КонецЕсли;

	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	
КонецПроцедуры

&НаКлиенте
// Обработчик при открытии 
//
Процедура ПриОткрытии(Отказ)
	
	МинКолСимволовПоиска = 3;
	ОтборПоФильтру();

КонецПроцедуры

&НаКлиенте
// Процедура - Обработка оповещения
//
// Параметры:
//  ИмяСобытия	 - 	 - 
//  Параметр	 - 	 - 
//  Источник	 - 	 - 
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписанНовыйКлиент" Тогда 
		Если ЗначениеЗаполнено(Параметр) И ТипЗнч(Параметр) = Тип("СправочникСсылка.Контрагенты") Тогда 
			ДанныеФИО 		= ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Параметр, "Фамилия, Имя, Отчество");
			ФильтрФамилия 	= ДанныеФИО.Фамилия;
			ФильтрИмя 		= ДанныеФИО.Имя;
			ФильтрОтчество 	= ДанныеФИО.Отчество;
			ОтборПоФильтру();			
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Обработчик кнопки выполнения поиска
//
Процедура ВыполнитьПоиск(Команда)
	
	ОтборПоФильтру();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Прии изменении любого параметра фильтра
//
Процедура ПриИзмененииПараметраФильтра(Элемент)
	
	ОтборПоФильтру();
	
КонецПроцедуры

&НаКлиенте
// Обработчик отбора по фильтру
//
Процедура ОтборПоФильтру()

	ФлагРазрешения = Ложь;
	Список.Параметры.УстановитьЗначениеПараметра("Фамилия"       , СобратьПараметрЗапроса(ФильтрФамилия, ФлагРазрешения));
	Список.Параметры.УстановитьЗначениеПараметра("Имя"           , СобратьПараметрЗапроса(ФильтрИмя, ФлагРазрешения));
	Список.Параметры.УстановитьЗначениеПараметра("Отчество"      , СобратьПараметрЗапроса(ФильтрОтчество, ФлагРазрешения));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаРождения"  , ФильтрДатаРождения);
	Список.Параметры.УстановитьЗначениеПараметра("Телефон"       , СобратьПараметрЗапросаВнутреннеВхождение(ФильтрТелефон, ФлагРазрешения));
	Список.Параметры.УстановитьЗначениеПараметра("НомерМедКарты" , ?(ЗначениеЗаполнено(ФильтрНомерМедКарты), "%" + ФильтрНомерМедКарты + "%", ""));
	
	Если ФлагРазрешения ИЛИ ЗначениеЗаполнено(ФильтрДатаРождения) ИЛИ ЗначениеЗаполнено(ФильтрНомерМедКарты) Тогда
		
		Список.Параметры.УстановитьЗначениеПараметра("ЗапретОтображения" , Ложь);	
		Элементы.ДекорацияОповещение.Заголовок = "Результат поиска";
			 
	Иначе		 
		
		Элементы.ДекорацияОповещение.Заголовок = "Для поиска введите 3 и более символа!";
		Список.Параметры.УстановитьЗначениеПараметра("ЗапретОтображения" , Истина);

	КонецЕсли;    
	
КонецПроцедуры

&НаКлиенте
// Функция компановки параметра запроса 
//
Функция СобратьПараметрЗапроса(Парамтер, ФлагРазрешения)
	
	Если СтрДлина(Парамтер) >= МинКолСимволовПоиска Тогда
		
		ФлагРазрешения = Истина;
		Возврат ""+ Парамтер  + "%";
	Иначе 
		Возврат "";
	КонецЕсли;
	
КонецФункции  

&НаКлиенте
// Функция компановки параметра запроса 
//
Функция СобратьПараметрЗапросаВнутреннеВхождение(Парамтер, ФлагРазрешения)
	
	Если СтрДлина(Парамтер) >= МинКолСимволовПоиска Тогда
		
		ФлагРазрешения = Истина;
		Возврат "%"+ Парамтер  + "%";
	Иначе 
		Возврат "";
	КонецЕсли;
	
КонецФункции


#КонецОбласти


