
#Область ОбработчикиСобытийФормы

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии"
//
Процедура ПриОткрытии(Отказ)
	
	Попытка
		СофтФон = Новый COMОбъект("HelixSoftPhone");
	Исключение
		СофтФон = Неопределено;
	КонецПопытки;

	
	Если СофтФон = Неопределено Тогда		
		ВнешняяКомпонента = "Не установлена";
		Версия = "Не определена";
	Иначе
		ЗаголовокСтраницы = "Учетная запись";
		ВнешняяКомпонента = "Установлена";
		Попытка 
			Версия = СофтФон.GetInfoDLL(); 
		Исключение
			Версия = "Не определена";
		КонецПопытки;
	КонецЕсли;

	СофтФон = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды
//
Процедура УстановитьВК(Команда)
	
	Установлен = Истина;
	Если СофтФон = Неопределено Тогда
		Попытка
			мСофтФон = Новый COMОбъект("HelixSoftPhone");
			Установлен = Истина;
		Исключение
			Установлен = Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если Установлен Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьВКПродолжение", ЭтотОбъект), "Для переустанвоки ВК, необходимо перезапустить предеприятие, начать переустановку?", РежимДиалогаВопрос.ДаНет);
        Возврат;              		
	КонецЕсли;   
	
	ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьВКЗавершение", ЭтотОбъект), "Для корректной работы, после установки предприятие будет перезапущено, начать установку?", РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
// Процедура - Установить ВКЗавершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура УстановитьВКПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
		
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		УстановитьФлагУстановкиВК(Истина);
		ПрекратитьРаботуСистемы(Истина);
		Возврат;
	КонецЕсли;              		
	
	ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьВКЗавершение", ЭтотОбъект), "Для корректной работы, после установки предприятие будет перезапущено, начать установку?", РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
// Процедура - Установить ВКЗавершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура УстановитьВКЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли; 
	
	#Если Не ВебКлиент Тогда
		Системнаяинформация = Новый Системнаяинформация;
		Если Системнаяинформация.ТипПлатформы = ТипПлатформы.Windows_x86 Или Системнаяинформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда 
			WSHShell = Новый COMОбъект("WScript.Shell");
			Путь = "" + WshShell.RegRead("HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\.NETFramework\InstallRoot");
			НаличиеFrameWork = Новый Файл(Путь +"\v2.0.50727\");				
			Если НаличиеFrameWork.Существует()Тогда								
				Если Не СофтФон = Неопределено и СофтФон.LineRegister() Тогда	
					СофтФон.UnregisterLine();
					Счетчик = 0;
					Пока Не СофтФон.LineUnRegister() Цикл
						Счетчик = Счетчик + 1;
					КонецЦикла;			
				КонецЕсли; 	
				ПереустановитьВК();
				ПрекратитьРаботуСистемы(Истина);
			Иначе
				ПоказатьПредупреждение(,"Для работы ВК, необходимо установить Microsoft .net framework 3.5");
			КонецЕсли;
		КонецЕсли;
	#Конецесли

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура, выполняет переустановку внешней компоненты
//
Процедура ПереустановитьВК()
	
	#Если НЕ ВебКлиент Тогда		      		
		Системнаяинформация = Новый Системнаяинформация; 
		Попытка
			Если Системнаяинформация.ТипПлатформы = ТипПлатформы.Windows_x86 Или Системнаяинформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда 	 
				WSHShell = Новый COMОбъект("WScript.Shell");
				Путь = "" + WshShell.RegRead("HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\.NETFramework\InstallRoot");
				НаличиеFrameWork = Новый Файл(Путь +"\v2.0.50727\");				
				Если НаличиеFrameWork.Существует()Тогда
					Макет = ВернутьМакетСофтФон("SoftPhone");
					ВременныйКаталог = КаталогВременныхФайлов();
					ФайлМакета = Новый ЧтениеZipФайла();				
					Макет.Записать(ВременныйКаталог+"Model.zip");
					ФайлМакета.Открыть(ВременныйКаталог + "Model.zip");
					WSHShell = Новый COMОбъект("WScript.Shell");
					ФайлМакета.ИзвлечьВсе(Путь +"v2.0.50727\");
					
					ФайлБиблеотекиСервиса = Новый Файл(Путь +"\v2.0.50727\VoIPSDK.dll");
					Если Не ФайлБиблеотекиСервиса.Существует() Тогда
						Макет = ВернутьМакетСофтФон("VoipSDK");
						ВременныйКаталог = КаталогВременныхФайлов();
						ФайлМакета = Новый ЧтениеZipФайла();				
						Макет.Записать(ВременныйКаталог+"Model.zip");
						ФайлМакета.Открыть(ВременныйКаталог + "Model.zip");					
						ФайлМакета.ИзвлечьВсе(Путь +"v2.0.50727\");							
					КонецЕсли;					
					ЗапуститьПриложение(Путь +"v2.0.50727\regasm  HelixSoftPhone.dll /codebase /tlb",,Истина);										
					Попытка
						СофтФон = Новый COMОбъект("HelixSoftPhone");
						ПоказатьПредупреждение(,"Внешняя компонента установлена! Программа будет перезапущена.");
						ПрекратитьРаботуСистемы(Истина);
					Исключение
						ПоказатьПредупреждение(,"Внешняя компонента не установлена! Для корректной установки ВК, 1С:Предприятие 8 должно быть запущено с правами администратора!");
					КонецПопытки;				
				КонецЕсли;
			КонецЕсли;
		Исключение
			ПоказатьПредупреждение(,"Внешняя компонента не установлена: "+ОписаниеОшибки()+Символы.ПС+" Произведите запуск от имени администратора!");
		КонецПопытки;
	#КонецЕсли 
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает макет компоненты
//
Функция ВернутьМакетСофтФон(Имя) 
	
	Возврат Обработки.СофтФон.ПолучитьМакет(Имя);
	
	
КонецФункции

&НаСервере
// Процедура выполняет установку флага установки
// 
Процедура УстановитьФлагУстановкиВК(Флаг)
	
	ХранилищеСистемныхНастроек.Сохранить(ПараметрыСеанса.ТекущийПользователь, "ПереустановитьСфотфон", Флаг);
	
КонецПроцедуры

#КонецОбласти
