
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик создания формы на сервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураМеню = Новый Структура;
	СтруктураМеню.Вставить("Сотрудники"         , "ГруппаПользователи");
	СтруктураМеню.Вставить("СегментыСотрудников", "ГруппаГруппыПользователей");
	
	СписокПользователей.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	ОбработкаТабличныхЧастейКлиент.СоздатьМенюДокумента(ЭтаФорма, СтруктураМеню, "ГруппаПереключательЗакладок");
	
	// Установка текущего выбранного элемента.
	Если Параметры.Свойство("Ключ") 
		И Параметры.Ключ <> Неопределено 
		И ТипЗнч(Параметры.Ключ) = Тип("СправочникСсылка.Сотрудники") Тогда
		
		Если Параметры.Ключ.ЭтоГруппа Тогда
			
			ПроцедураОбработкиНажатияМенюСервер("_ГруппаГруппыПользователей");
			
			ТекущийЭлемент               = Элементы.ТаблицаСегментыСотрудников;
			ТекущийЭлемент.ТекущаяСтрока = Параметры.Ключ;  
		Иначе
			ТекущийЭлемент               = Элементы.ТаблицаСотрудников;
			ТекущийЭлемент.ТекущаяСтрока = Параметры.Ключ;  
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Если Параметры.Свойство("ВыборТолькоЭлементов") Тогда 
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПользователей		, "ЭтоГруппа", Ложь, Истина);		
		// ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокГруппПользователей	, "ЭтоГруппа", Ложь, Истина);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события формы "ПриЗагрузкеДанныхИзНастроекНаСервере".
//
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если ЗначениеЗаполнено(ОтборРольСотрудника) Тогда
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПользователей, "Роль", ОтборРольСотрудника, ЗначениеЗаполнено(ОтборРольСотрудника));		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаСотрудников

&НаКлиенте
// Обработка выбора в таблице пользователи
Процедура ТаблицаПользователиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТекущийЭлемент.ТекущиеДанные <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;		
		Если ТекущийЭлемент.ТекущиеДанные.ЭтоГруппа Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выбор групп запрещен!';en='Selection groups is prohibited!'"), ЭтотОбъект);
		Иначе 	
			Закрыть(ТекущийЭлемент.ТекущиеДанные.Ссылка);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаСегментыСотрудников

&НаКлиенте
// Обработка выбора в таблице группы пользователи
Процедура ТаблицаГруппыПользователейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТекущийЭлемент.ТекущиеДанные <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;		
		Если ТекущийЭлемент.ТекущиеДанные.ЭтоГруппа Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выбор групп запрещен!';en='Selection groups is prohibited!'"), ЭтотОбъект);
		Иначе 	
			Закрыть(ТекущийЭлемент.ТекущиеДанные.Ссылка);
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Обработчик выбора 
Процедура Выбрать(Команда)
	
	СтандартнаяОбработка = Ложь;		
	Если Элементы.ГруппаПользователи.Видимость Тогда
		Закрыть(Элементы.ТаблицаСотрудников.ТекущаяСтрока);
	Иначе
		Закрыть(Элементы.ТаблицаСегментыСотрудников.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события элемента формы "ОтборРольСотрудникаПриИзменении".
//
Процедура ОтборРольСотрудникаПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПользователей, "Роль", ОтборРольСотрудника, ЗначениеЗаполнено(ОтборРольСотрудника));
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет обработку нажатия динамических кнопок.
//
Процедура ПроцедураОбработкиНажатияМеню(Элемент)
	
	ПроцедураОбработкиНажатияМенюСервер(Элемент.Имя);
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет обработку нажатия динамических кнопок на сервере.
//
Процедура ПроцедураОбработкиНажатияМенюСервер(ИмяЭлемента)
	
	ОбработкаТабличныхЧастейКлиент.ПроцедураОбработкиНажатияМеню(ЭтаФорма, ИмяЭлемента);
	
КонецПроцедуры

#КонецОбласти
