 
#Область СлужебныйПрограммныйИнтерфейс 

// Функция - Вернуть виды лицевых счетов.
// 
Функция ВернутьВидыЛицевыхСчетов() Экспорт
	
	ЗапросВыборка = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЛицевыхСчетов.Ссылка
	|ИЗ
	|	Справочник.ВидыЛицевыхСчетов КАК ВидыЛицевыхСчетов
	|ГДЕ
	|	ВидыЛицевыхСчетов.ПометкаУдаления = ЛОЖЬ");
	Возврат ЗапросВыборка.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Функция - Вернуть историю лицевого счета.
//
Функция ВернутьИсториюЛицевогоСчета(ВидСчета, Контрагент, СтруктурнаяЕдиница = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(ВидСчета) ИЛИ НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваНаЛицевыхСчетахОстаткиИОбороты.ПериодСекунда КАК Период,
		|	ДенежныеСредстваНаЛицевыхСчетахОстаткиИОбороты.Регистратор КАК Регистратор,
		|	ДенежныеСредстваНаЛицевыхСчетахОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
		|	ДенежныеСредстваНаЛицевыхСчетахОстаткиИОбороты.СуммаОборот КАК Сумма,
		|	ВЫБОР
		|		КОГДА ДенежныеСредстваНаЛицевыхСчетахОстаткиИОбороты.СуммаОборот > 0
		|			ТОГДА ""Поступление""
		|		ИНАЧЕ ""Списание""
		|	КОНЕЦ КАК Операция
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваНаЛицевыхСчетах.ОстаткиИОбороты(
		|			,
		|			,
		|			Авто,
		|			,
		|			ВидСчета = &ВидСчета
		|				И Контрагент = &Контрагент
		|				И &УсловиеСтруктурнаяЕдиница) КАК ДенежныеСредстваНаЛицевыхСчетахОстаткиИОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДенежныеСредстваНаЛицевыхСчетахОстаткиИОбороты.ПериодСекунда";
	
	Запрос.УстановитьПараметр("ВидСчета", ВидСчета);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
    Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);

	УсловиеСтруктурнаяЕдиница = ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), "СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "ИСТИНА");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", УсловиеСтруктурнаяЕдиница);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти