
#Область СлужебныеПроцедурыИФункции

 // Процедура обработчик события ОбработкаПолученияДанныхВыбора.
//
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец")
		И ЗначениеЗаполнено(Параметры.Отбор.Владелец)
		И НЕ Параметры.Отбор.Владелец.ИспользоватьПартии Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Для номенклатуры не ведется учет по партиям!'");
		Сообщение.Сообщить();
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;	
	
	
КонецПроцедуры

// Функция возвращает сумму сертификата с указанной серией.
//
Функция ПолучитьСуммуСертификата(Серия) Экспорт
	
	Сертификат = Серия.Владелец;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СертификатыОстатки.СуммаОстаток КАК Сумма
	                      |ИЗ
	                      |	РегистрНакопления.Сертификаты.Остатки КАК СертификатыОстатки
	                      |ГДЕ
	                      |	СертификатыОстатки.Сертификат = &Сертификат
	                      |	И СертификатыОстатки.СерийныйНомер = &Серия");
						  
	Запрос.УстановитьПараметр("Сертификат", Сертификат);
	Запрос.УстановитьПараметр("Серия", Серия);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();	
	Возврат Результат.Сумма;
	
КонецФункции

#КонецОбласти