
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		ПараметрыФормы = Новый Структура("АктОказанияУслуг", ПараметрКоманды);
		ОткрытьФорму("РегистрСведений.РегистрацияПакетовИнформационногоОбмена.Форма.УпрСозданиеФайлаОбмена", 
						ПараметрыФормы,
						ПараметрыВыполненияКоманды.Источник,
						ПараметрыВыполненияКоманды.Уникальность,
						ПараметрыВыполненияКоманды.Окно
					);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти