
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ЭтоВерсияКОРП = ОбщегоНазначения.ЭтоВерсияКОРП();

	Параметры.Свойство("ПОIPТелефонии"	, ПОIPТелефонии);	
	Параметры.Свойство("IDЗвонка"		, IDЗвонка);
	Параметры.Свойство("IDПлеча"		, IDПлеча);
	Параметры.Свойство("СНомерТелефона"	, СНомерТелефона);
	Параметры.Свойство("НаНомерТелефона", НаНомерТелефона);
	Параметры.Свойство("ОткрытаИзСписка", ОткрытаИзСписка);
	Параметры.Свойство("Заявка", ЗаявкаОснование);
	
	ЗаписьРазговораДоступна = ?(Параметры.Свойство("ЗаписьРазговораДоступна"), Параметры.ЗаписьРазговораДоступна, Ложь);
	
	Отказ = НЕ ЗначениеЗаполнено(ПОIPТелефонии) ИЛИ НЕ ЗначениеЗаполнено(IDЗвонка); 
	      
	Если НЕ Отказ Тогда
		// Заполняем таблицу активных пользователей
		ТаблицаАктивныхПользователей.Загрузить(IPТелефония.ПолучитьСписокАктивныхПользователей(,Истина));
		ТаблицаАктивныхПользователей.Сортировать("ВнутреннийНомер");
		// Инициализируем номер телефона клиента
		ИнициализироватьПараметрыТелефонногоЗвонка();
		// Получаем структуру клиента
		СтруктураКлиента = ПолучитьСтруктуруКлиентаПоНомеруТелефона(СписокВариантовНомераТелефона); 
		
		ЭтоГородской = УправлениеКонтактнойИнформациейСтоматология.ЭтоГородскойРФ(ПреобразованныйНомерТелефона);
		ТелефонВЧС = РегистрыСведений.ЗаблокированныеНомераТелефонов.ТелефонВЧерномСписке(НомерТелефонаКлиента);
		Если НЕ ТелефонВЧС Тогда
			Если НЕ ЗначениеЗаполнено(СтруктураКлиента.СписокКонтрагентов) Тогда
				СоздатьОбновитьЗаявку();
			Иначе
				ОтобразитьЗаявки();
			КонецЕсли;              
		КонецЕсли;
		УстановитьВидимостьЭлементовФормы();   
	КонецЕсли;	
	
	ГруппаКонтрагентов = Справочники.Контрагенты.ПолучитьПапкуПоТипу(Перечисления.ТипыКонтрагентов.Клиенты);
	
КонецПроцедуры

&НаКлиенте
// Процедура - При открытии
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриОткрытии(Отказ)
	
	// Если НЕ ОткрытаИзСписка И ТаблицаАктивныхПользователей.НайтиСтроки(Новый Структура("ВнутреннийНомер", СНомерТелефона)).Количество() <> 0 И ЗначениеЗаполнено(ПараметрыТелефонногоЗвонка.Заявка) И ТипЗнч(ПараметрыТелефонногоЗвонка.Заявка) = Тип("ДокументСсылка.Заявка") Тогда 
	//	// Это переадресация с внутреннего номера и заявка уже создана - поэтому открываем ее
	//	Отказ = Истина;
	//	ОткрытьФорму("Документ.Заявка.ФормаОбъекта", Новый Структура("Ключ, IDЗвонка, ПОIPТелефонии", ПараметрыТелефонногоЗвонка.Заявка, IDЗвонка, ПОIPТелефонии));
	// Иначе 
		Если ЗначениеЗаполнено(СокрЛП(Заметка)) Тогда 
			Элементы.Заметки.УстановитьГраницыВыделения(СтрДлина(Заметка + " "), СтрДлина(Заметка) + 1);
		КонецЕсли;
	// КонецЕсли;
	
	Элементы.ГруппаПредставлениеСделки.Видимость 					= Ложь;
	Элементы.ГруппаПредставлениеЗаписи.Видимость					= Ложь;
	Элементы.ПолисМедицинскогоСтрахованияПредставление.Видимость 	= Ложь;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка оповещения
//
// Параметры:
//  ИмяСобытия	 - 	 - 
//  Параметр	 - 	 - 
//  Источник	 - 	 - 
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписанНовыйКлиент" ИЛИ ИмяСобытия = "ЗаписанаНоваяЗаявка" ИЛИ ИмяСобытия = "ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ" Тогда
		СтруктураКлиента = ПолучитьСтруктуруКлиентаПоНомеруТелефона(СписокВариантовНомераТелефона);
		УстановитьВидимостьЭлементовФормы();   
	ИначеЕсли ИмяСобытия = "ОбновитьИсториюВзаимодействияКонтрагента" Или ИмяСобытия = "ИзмененоСобытие" Тогда
		Если ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("ТелефонДляСоздания") Тогда
			//НомераТелефонов = ПолучитьНомераТелефонов(Параметр.Пациент);
			//ПреобразованныйНомер = СтрЗаменить(СтрСоединить(СтрРазделить(НомерТелефонаКлиента, "+&<>`“‘|%/\@() "), ""), Символы.НПП, "");
			Если ПривестиНомер(НомерТелефонаКлиента) = ПривестиНомер(Параметр.ТелефонДляСоздания) Тогда   
				ЗаявкаОснование = Параметр.Сделка;
				СохранитьКонтрАгента(ПОIPТелефонии, IDЗвонка, Параметр.Пациент, ЗаявкаОснование);     
			КонецЕсли;
		ЗаполнитьРезультатЗвонка(ПредопределенноеЗначение("Перечисление.РезультатыОбработкиЗвонка.ЗаписанНаПрием"));	
		КонецЕсли;
		УстановитьВидимостьЭлементовФормы();
	ИначеЕсли ИмяСобытия = "ЗакрытьФормуЗвонкаПациенту" И Параметр.IDЗвонка = IDЗвонка Тогда 
		ПропуститьПроверкуПриЗакрытииФормы = Истина;
		ЭтаФорма.Закрыть();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Скопировать в буфер номер телефона без форматирования
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СкопироватьВБуферНомерТелефонаБезФорматирования(Команда)
	
	#Если Клиент Тогда 
		Объект_htmlfile = Новый COMОбъект("htmlfile"); 
		Объект_htmlfile.ParentWindow.ClipboardData.Setdata("Text", НомерТелефонаКлиента); 
		Возврат;
	#КонецЕсли 	
	
	// Элементы.Добавить(Тип("ПолеHTMLДокумента"), "Поле_HTML_Документа_acb123", Ложь); 
	// Окно = ЭлементыФормы.Поле_HTML_Документа_acb123.Документ.ParentWindow; 
	// Окно.ClipboardData.SetData("Text", НомерТелефонаКлиента); 
	// Элементы.Удалить(Элементы.Индекс(Элементы.Найти("Поле_HTML_Документа_acb123"))); 
	 
КонецПроцедуры

&НаКлиенте
// Процедура - Прослушать запись
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПрослушатьЗапись(Команда)
	
	Если ЗначениеЗаполнено(ПараметрыТелефонногоЗвонка.ФайлЗаписи) Тогда
		ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ПараметрыТелефонногоЗвонка.ФайлЗаписи); // ПолучитьРабочийКаталог()
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
	ИначеЕсли ЗначениеЗаполнено(ПараметрыТелефонногоЗвонка.URLЗаписи) Тогда 
		АктуальныйURLЗаписи = IPТелефонияКлиент.ПолучитьАктуальныйURLЗаписиROSTELECOMКлиент(ПараметрыТелефонногоЗвонка.URLЗаписи, IDЗвонка, ПОIPТелефонии);
		Оповещение = Новый ОписаниеОповещения(,,, "ОтобразитьОшибку", ЭтотОбъект);
		НачатьЗапускПриложения(Оповещение, АктуальныйURLЗаписи);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Отобразить ошибку
//
Процедура ОтобразитьОшибку(ИнформацияОбОшибке, СтандартнаяОбработка, Контекст) Экспорт 
	
	СтандартнаяОбработка = Ложь;
	ОткрытьПроводникОповеститьОбОшибке("", Контекст);
	
КонецПроцедуры

&НаКлиенте
// Продолжение процедуры отобразить ошибку.
Процедура ОткрытьПроводникОповеститьОбОшибке(ОписаниеОшибки, Контекст)
	
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда 
		ПоказатьПредупреждение(, ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить контакт
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ДобавитьКонтакт(Команда)
	
	Элементы.ГруппаКнопкиДобавитьКонтакт.Видимость 	= Ложь;
	Элементы.ГруппаКонтрагент.Видимость 			= Истина;
	ЭтаФорма.ТекущийЭлемент 						= Элементы.ПоискКонтрагента;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Открыть заявку
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОткрытьЗаявку(Команда)
	
	Если ЗначениеЗаполнено(ЗаявкаОснование) Тогда 
		ПоказатьЗначение( , ЗаявкаОснование);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый открыть партнера
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Подключаемый_ОткрытьКонтрагента(Команда) Экспорт

	Индекс 					= Число(СтрЗаменить(Команда.Имя, "Кнопка_ОткрытьКонтрагента_", ""));	
	КонтрагентСсылка		= СтруктураКлиента.СписокКонтрагентов[Индекс].Значение.КонтрагентСсылка;
	
	Если ТипЗнч(КонтрагентСсылка) = Тип("СправочникСсылка.Контрагенты") Тогда 
		ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", Новый Структура("Ключ, IDЗвонка", КонтрагентСсылка, IDЗвонка));
	ИначеЕсли ТипЗнч(КонтрагентСсылка) = Тип("СправочникСсылка.Сотрудники") Тогда
		ОткрытьФорму("Справочник.Сотрудники.ФормаОбъекта", Новый Структура("Ключ, IDЗвонка", КонтрагентСсылка, IDЗвонка));
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый открыть куратора
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Подключаемый_ОткрытьКуратора(Команда) Экспорт

	Индекс 				= Число(СтрЗаменить(Команда.Имя, "Кнопка_ОткрытьКуратора_", ""));	
	КураторСсылка		= СтруктураКлиента.СписокКонтрагентов[Индекс].Значение.Куратор;

	ПоказатьЗначение( , КураторСсылка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый открыть заявку
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Подключаемый_ОткрытьЗаявку(Команда) Экспорт

	Индекс 			= Число(СтрЗаменить(Команда.Имя, "Кнопка_ОткрытьЗаявку_", ""));	
	ЗаявкаСсылка	= СтруктураКлиента.СписокЗаявок[Индекс].Значение.ЗаявкаСсылка;
	
	ОткрытьФорму("Справочник.Заявки.ФормаОбъекта", Новый Структура("Ключ, IDЗвонка, ПОIPТелефонии", ЗаявкаСсылка, IDЗвонка, ПОIPТелефонии));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить заявку
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ДобавитьЗаявку(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПОIPТелефонии"				, ПОIPТелефонии);	
	ПараметрыФормы.Вставить("IDЗвонка"					, IDЗвонка);
	ПараметрыФормы.Вставить("НомерТелефона"				, ПреобразованныйНомерТелефона);
	ПараметрыФормы.Вставить("КоллтрекингНомер"			, ПараметрыТелефонногоЗвонка.КоллтрекингНомер);
	ПараметрыФормы.Вставить("ИсточникЗаписи"			, "Телефон");

	ЗначениеЗаполнения = Новый Структура();
	ЗначениеЗаполнения.Вставить("ДатаСоздания"			, ТекущаяДата());
	ЗначениеЗаполнения.Вставить("ДобавитьНомерТелефона"	, Истина);
	ЗначениеЗаполнения.Вставить("НомерТелефона"			, ПреобразованныйНомерТелефона);
	ЗначениеЗаполнения.Вставить("РекламнаяПлощадка"		, ВернутьРекламнуюПлощадку(ПараметрыТелефонногоЗвонка.ПиктограммаЗвонка));
	
	ПОIPТелефонииCallTouch = ПулучитьПОIPТелефонииCallTouch();
	
	Если ЗначениеЗаполнено(ПОIPТелефонииCallTouch) Тогда 
		
		ПараметрыЗвонка = IPТелефония.CallTouch_ПолучитьИнформациюОПосетителеСайта(ПОIPТелефонииCallTouch, НомерТелефонаКлиента);	
		
		Если ЗначениеЗаполнено(ПараметрыЗвонка) Тогда			
			Если ПОIPТелефонии <> ПОIPТелефонииCallTouch Тогда
				Если ПараметрыЗвонка.Свойство("callid") Тогда    
					ПараметрыЗвонка.callid = IDЗвонка;
				Иначе 
					ПараметрыЗвонка.Добавить("callid", IDЗвонка);
				КонецЕсли;
			КонецЕсли;
			
			СквознаяАналитикаДобавитьЗапись(ПараметрыЗвонка);
			
			ДанныеСквознойАналитики = ПолучитьДанныеСквознойАналитики(IDЗвонка);
			
			Если ЗначениеЗаполнено(ДанныеСквознойАналитики) Тогда 
				
				РекламныйИсточник = РекламныйИсточникПоНаименованию(ДанныеСквознойАналитики.source);
				
				ЗначениеЗаполнения.Вставить("РекламныйИсточник", ?(ЗначениеЗаполнено(РекламныйИсточник), РекламныйИсточник, СоздатьРекламныйИсточник(ДанныеСквознойАналитики.source)));
				ЗначениеЗаполнения.Вставить("ga_cid"	       , ДанныеСквознойАналитики.gcid);
				ЗначениеЗаполнения.Вставить("utm_campaign"     , ДанныеСквознойАналитики.utm_campaign);
				ЗначениеЗаполнения.Вставить("utm_content"      , ДанныеСквознойАналитики.utm_content);
				ЗначениеЗаполнения.Вставить("utm_medium"       , ДанныеСквознойАналитики.utm_medium);
				ЗначениеЗаполнения.Вставить("utm_source"       , ДанныеСквознойАналитики.utm_source);
				ЗначениеЗаполнения.Вставить("utm_term"	       , ДанныеСквознойАналитики.utm_term);
				ЗначениеЗаполнения.Вставить("ym_cid"	       , ДанныеСквознойАналитики.yaClientId);	
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли; 
	
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначениеЗаполнения);
	
	ОткрытьФорму("Справочник.Заявки.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

// Функция - Рекламный источник по наименованию
//
// Параметры:
//  РекламныйИсточник	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаСервере
Функция РекламныйИсточникПоНаименованию(РекламныйИсточник) 	
	Возврат Справочники.РекламныеИсточники.РекламныйИсточникПоНаименованию(РекламныйИсточник);
КонецФункции

// Функция - Создать рекламный источник
//
// Параметры:
//  РекламныйИсточник	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаСервере
Функция СоздатьРекламныйИсточник(РекламныйИсточник) 	
	Возврат Справочники.РекламныеИсточники.СоздатьРекламныйИсточник(РекламныйИсточник);
КонецФункции

// Функция - Пулучить ПОIPТелефонии call touch
// 
// Возвращаемое значение:
//   - 
//
&НаСервере
Функция ПулучитьПОIPТелефонииCallTouch()
	Возврат IPТелефония.ОпределитьПодключаемоеОборудование(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсCallTouch);
КонецФункции 

// Процедура - Сквозная аналитика добавить запись
//
// Параметры:
//  Параметры	 - 	 - 
//
&НаСервере
Процедура СквознаяАналитикаДобавитьЗапись(Параметры)
	
	РегистрыСведений.СквознаяАналитика.Добавить(Параметры);

КонецПроцедуры

// Функция - Получить данные сквозной аналитики
//
// Параметры:
//  IDЗвонка - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаСервере
Функция ПолучитьДанныеСквознойАналитики(IDЗвонка)
	
	Возврат РегистрыСведений.СквознаяАналитика.ПолучитьЗаписьПоID(IDЗвонка);
	
КонецФункции  

&НаКлиенте
// Процедура - Добавить потенциального
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ДобавитьПотенциального(Команда)
	
	МассивВидовСделок = ПолучитьМассивВсехВидовСделокПоПродажамНаСервере();
	СписокВариантовСоздания = Новый СписокЗначений;
	СписокВариантовСоздания.ЗагрузитьЗначения(МассивВидовСделок);
	
	Для Каждого ЭлементСписка Из СписокВариантовСоздания Цикл			
		ЭлементСписка.Представление = "Потенциального клиента + " + ЭлементСписка.Значение; 
	КонецЦикла;
	
	СписокВариантовСоздания.Добавить(ПредопределенноеЗначение("Справочник.ВидыСделок.ПустаяСсылка"), "Потенциального клиента");
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораВариантаСоздания", ЭтотОбъект, Новый Структура("ЭтоСозданиеКлиента", Истина));
	ПоказатьВыборИзМеню(Оповещение, СписокВариантовСоздания, Элементы.ДобавитьПотенциального);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка выбора варианта создания
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ОбработкаВыбораВариантаСоздания(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	// СтруктураЗаполнения = Новый Структура();
	// СтруктураЗаполнения.Вставить("ЗарегистрироватьДействие"	, Истина); 
	// СтруктураЗаполнения.Вставить("ТелефонКлиента"			, ПреобразованныйНомерТелефона); 
	//
	// Если ЗначениеЗаполнено(СтруктураКлиента.СписокЗаявок) Тогда
	//	ЗаявкаОснование = СтруктураКлиента.СписокЗаявок[0].Значение.ЗаявкаСсылка;
	//	СтруктураЗаполнения.Вставить("ЗаявкаОснование"  , ЗаявкаОснование);		
	//	СтруктураЗаполнения.Вставить("ФамилияКлиента"	, СтруктураКлиента.СписокЗаявок[0].Значение.Фамилия);		
	//	СтруктураЗаполнения.Вставить("ИмяКлиента"		, СтруктураКлиента.СписокЗаявок[0].Значение.Имя);
	//	СтруктураЗаполнения.Вставить("ОтчествоКлиента"	, СтруктураКлиента.СписокЗаявок[0].Значение.Отчество);		
	// КонецЕсли;
	//
	// ФормаЭлементаКонтакт = ПолучитьФорму("Справочник.Контрагенты.Форма.ФормаЭлементаПотенциальныйКлиентНовая", Новый Структура("ЗаявкаОснование", ?(ЗначениеЗаполнено(СтруктураКлиента.СписокЗаявок), СтруктураКлиента.СписокЗаявок[0].Значение.ЗаявкаСсылка, ПредопределенноеЗначение("Справочник.Заявки.ПустаяСсылка"))), , "IPТелефония_СоздатьПотенциальногоКлиента_" + IDЗвонка);
	// Если ЗначениеЗаполнено(СтруктураКлиента.СписокЗаявок) Тогда
	//	ЗаявкаОснование = СтруктураКлиента.СписокЗаявок[0].Значение.ЗаявкаСсылка;
	//	СтруктураЗаполнения.Вставить("ЗаявкаОснование", ЗаявкаОснование);		
	//	ФормаЭлементаКонтакт.Фамилия	= СтруктураКлиента.СписокЗаявок[0].Значение.Фамилия;		
	//	ФормаЭлементаКонтакт.Имя		= СтруктураКлиента.СписокЗаявок[0].Значение.Имя;
	//	ФормаЭлементаКонтакт.Отчество	= СтруктураКлиента.СписокЗаявок[0].Значение.Отчество;		
	// КонецЕсли;
	// МассивСтрокТелефона = ФормаЭлементаКонтакт.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон")));
	// НоваяСтрока		= ?(МассивСтрокТелефона.Количество() > 0, МассивСтрокТелефона[0], ФормаЭлементаКонтакт.КонтактнаяИнформация.Добавить());
	// НоваяСтрока.Тип	= ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
	// НоваяСтрока.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКлиента");
	// НоваяСтрока.Представление = ПреобразованныйНомерТелефона;
	// НоваяСтрока.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияXMLПоПредставлению(ПреобразованныйНомерТелефона, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКлиента"));
	// ФормаЭлементаКонтакт.ОбновитьЭлементыКонтактнойИнформации();
	// ФормаЭлементаКонтакт.Модифицированность = Истина;
	//
	// ФормаЭлементаКонтакт.Открыть();
	
	
	ФормаЭлементаКонтакт = Неопределено;
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("ЗарегистрироватьДействие"	, Истина); 
	СтруктураЗаполнения.Вставить("ТелефонКлиента"			, ПреобразованныйНомерТелефона); 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(РезультатВыбора.Значение) Тогда
		ФормаЭлементаКонтакт = ПолучитьФорму("Справочник.Контрагенты.ФормаОбъекта", , , "IPТелефония_СоздатьПотенциальногоКлиента_" + IDЗвонка);
		// ФормаЭлементаКонтакт = ПолучитьФорму("Справочник.Контрагенты.ФормаОбъекта", Новый Структура("ЗаявкаОснование", ?(ЗначениеЗаполнено(СтруктураКлиента.СписокЗаявок), СтруктураКлиента.СписокЗаявок[0].Значение.ЗаявкаСсылка, ПредопределенноеЗначение("Справочник.Заявки.ПустаяСсылка"))), , "IPТелефония_СоздатьПотенциальногоКлиента_" + IDЗвонка);
		// Если ЗначениеЗаполнено(СтруктураКлиента.СписокЗаявок) Тогда
		//	ЗаявкаОснование = СтруктураКлиента.СписокЗаявок[0].Значение.ЗаявкаСсылка;
		//	СтруктураЗаполнения.Вставить("ЗаявкаОснование", ЗаявкаОснование);		
		//	ФормаЭлементаКонтакт.Фамилия	= СтруктураКлиента.СписокЗаявок[0].Значение.Фамилия;		
		//	ФормаЭлементаКонтакт.Имя		= СтруктураКлиента.СписокЗаявок[0].Значение.Имя;
		//	ФормаЭлементаКонтакт.Отчество	= СтруктураКлиента.СписокЗаявок[0].Значение.Отчество;		
		// КонецЕсли;
		
		Если ЭтотОбъект.ПараметрыТелефонногоЗвонка.ПиктограммаЗвонка = 0 Тогда
			ФормаЭлементаКонтакт.Объект.КаналПривлечения = ПредопределенноеЗначение("Справочник.КаналыПривлечения.ВходящийЗвонок");
		ИначеЕсли ЭтотОбъект.ПараметрыТелефонногоЗвонка.ПиктограммаЗвонка = 1 Тогда
			ФормаЭлементаКонтакт.Объект.КаналПривлечения = ПредопределенноеЗначение("Справочник.КаналыПривлечения.ИсходящийЗвонок");
		КонецЕсли;
		         
		Если СтрНайти(НРег(Строка(ЭтотОбъект.ПОIPТелефонии)), "comagic") > 0 Тогда 
			ФормаЭлементаКонтакт.Объект.ИсточникИнформации = РекламеыйИсточникНаСервере();
		КонецЕсли;
		
		МассивСтрокТелефона = ФормаЭлементаКонтакт.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон")));
		НоваяСтрока		= ?(МассивСтрокТелефона.Количество() > 0, МассивСтрокТелефона[0], ФормаЭлементаКонтакт.КонтактнаяИнформация.Добавить());
		НоваяСтрока.Тип	= ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
		НоваяСтрока.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКлиента");
		НоваяСтрока.Представление = ПреобразованныйНомерТелефона;
		НоваяСтрока.ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебныйВызовСервераСтоматология.КонтактнаяИнформацияXMLПоПредставлению(ПреобразованныйНомерТелефона, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКлиента"));
		НоваяСтрока.Значение      = УправлениеКонтактнойИнформациейСлужебныйВызовСервераСтоматология.КонтактнаяИнформацияПоПредставлению(ПреобразованныйНомерТелефона, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКлиента"));
		ФормаЭлементаКонтакт.Модифицированность = Истина;		
	ИначеЕсли ТипЗнч(РезультатВыбора.Значение) = Тип("СправочникСсылка.ВидыСделок") И ЗначениеЗаполнено(РезультатВыбора.Значение) Тогда
		Если ДополнительныеПараметры.ЭтоСозданиеКлиента Тогда 
			Сделка = СоздатьСделку(РезультатВыбора.Значение);
			
			ДанныеЗаполнения = Новый Структура();
			ДанныеЗаполнения.Вставить("Сделка", Сделка);
			ГруппаКлиентов = ОбщегоНазначенияСтоматология.ВернутьГруппуКлиентов();
			ТекущийРодитель = ?(ЗначениеЗаполнено(ГруппаКлиентов), ГруппаКлиентов, ГруппаКонтрагентов);	
			ДанныеЗаполнения.Вставить("ТекущийРодитель", ТекущийРодитель);	
			// ДанныеЗаполнения.Вставить("ЗаявкаОснование", ?(ЗначениеЗаполнено(СтруктураКлиента.СписокЗаявок), СтруктураКлиента.СписокЗаявок[0].Значение.ЗаявкаСсылка, ПредопределенноеЗначение("Справочник.Заявки.ПустаяСсылка")));
			ФормаЭлементаКонтакт = ПолучитьФорму("Справочник.Контрагенты.ФормаОбъекта", ДанныеЗаполнения);
			// Если ЗначениеЗаполнено(СтруктураКлиента.СписокЗаявок) Тогда
			//	ЗаявкаОснование = СтруктураКлиента.СписокЗаявок[0].Значение.ЗаявкаСсылка;
			//	СтруктураЗаполнения.Вставить("ЗаявкаОснование", ЗаявкаОснование);		
			//	ФормаЭлементаКонтакт.Фамилия	= СтруктураКлиента.СписокЗаявок[0].Значение.Фамилия;		
			//	ФормаЭлементаКонтакт.Имя		= СтруктураКлиента.СписокЗаявок[0].Значение.Имя;
			//	ФормаЭлементаКонтакт.Отчество	= СтруктураКлиента.СписокЗаявок[0].Значение.Отчество;		
			// КонецЕсли;
			
			Если ЭтотОбъект.ПараметрыТелефонногоЗвонка.ПиктограммаЗвонка = 0 Тогда
				ФормаЭлементаКонтакт.Объект.КаналПривлечения = ПредопределенноеЗначение("Справочник.КаналыПривлечения.ВходящийЗвонок");
			ИначеЕсли ЭтотОбъект.ПараметрыТелефонногоЗвонка.ПиктограммаЗвонка = 1 Тогда
				ФормаЭлементаКонтакт.Объект.КаналПривлечения = ПредопределенноеЗначение("Справочник.КаналыПривлечения.ИсходящийЗвонок");
			КонецЕсли;
			
			Если СтрНайти(НРег(Строка(ЭтотОбъект.ПОIPТелефонии)), "comagic") > 0 Тогда 
				ФормаЭлементаКонтакт.Объект.ИсточникИнформации = РекламеыйИсточникНаСервере();
			КонецЕсли;
			
			МассивСтрокТелефона = ФормаЭлементаКонтакт.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон")));
			НоваяСтрока		= ?(МассивСтрокТелефона.Количество() > 0, МассивСтрокТелефона[0], ФормаЭлементаКонтакт.КонтактнаяИнформация.Добавить());
			НоваяСтрока.Тип	= ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
			НоваяСтрока.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКлиента");
			НоваяСтрока.Представление = ПреобразованныйНомерТелефона;
			НоваяСтрока.ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебныйВызовСервераСтоматология.КонтактнаяИнформацияXMLПоПредставлению(ПреобразованныйНомерТелефона, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКлиента"));
			НоваяСтрока.Значение      = УправлениеКонтактнойИнформациейСлужебныйВызовСервераСтоматология.КонтактнаяИнформацияПоПредставлению(ПреобразованныйНомерТелефона, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКлиента"));
			ФормаЭлементаКонтакт.Модифицированность = Истина;					
		Иначе
			// ПерыйЭтап 	= ПолучитьСтартовыйЭтапВидаСделкиНаСервере(РезультатВыбора.Значение);
			// ДанныеЗаполнения = Новый Структура();
			// ДанныеЗаполнения.Вставить("ВидСделки",          РезультатВыбора.Значение);
			// ДанныеЗаполнения.Вставить("ЭтапСделки",         ПерыйЭтап);			
			// ОткрытьФорму("Справочник.Сделки.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения), , Истина);
		КонецЕсли;
	КонецЕсли;
	
	Если ФормаЭлементаКонтакт <> Неопределено Тогда 
		ФормаЭлементаКонтакт.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить рекламный источник на сервере
// 
// Возвращаемое значение:
//   - 
//
Функция РекламеыйИсточникНаСервере()
	
	Возврат Справочники.РекламныеИсточники.ПолучитьСоздатьРекламныйИсточникПоНаименованию("Источник из Comagic");
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить массив всех видов сделок на сервере
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивВсехВидовСделокПоПродажамНаСервере()
	
	Возврат Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(Перечисления.ТипыСделок.Продажа);
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить стартовый этап вида сделки на сервере
//
// Параметры:
//  ВидСделки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтартовыйЭтапВидаСделкиНаСервере(ВидСделки)
	
	Возврат Справочники.ВидыСделок.ПолучитьСтартовыйЭтапВидаСделки(ВидСделки);
	
КонецФункции

&НаСервереБезКонтекста
// Функция, создает новую сделку клиенту.
//
Функция СоздатьСделку(ВидСделки)
			
	НоваяСделка = Справочники.Сделки.СоздатьЭлемент();		
	ПерыйЭтап 	= ПолучитьСтартовыйЭтапВидаСделкиНаСервере(ВидСделки);
	
	ДанныеЗаполнения = Новый Структура();
	ДанныеЗаполнения.Вставить("ВидСделки",          ВидСделки);
	ДанныеЗаполнения.Вставить("ЭтапСделки",         ПерыйЭтап);
	ДанныеЗаполнения.Вставить("ДатаСделки",         ТекущаяДатаСеанса());
	ДанныеЗаполнения.Вставить("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	НоваяСделка.Заполнить(ДанныеЗаполнения);
	
	Попытка
		
		НоваяСделка.Записать();
		Возврат НоваяСделка.Ссылка;
		
	Исключение		
	    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось создать сделку: ';en='Not succeeded create deal:'") + ОписаниеОшибки());	
	КонецПопытки;
		
КонецФункции

&НаКлиенте
// Процедура - Позвонить клиенту
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПозвонитьКлиенту(Команда)
	
	ОписаниеОшибки = "";
	КонтрагентСсылка = Неопределено;
	Если ЗначениеЗаполнено(СтруктураКлиента.СписокКонтрагентов) Тогда 
		КонтрагентСсылка = СтруктураКлиента.СписокКонтрагентов[0].Значение.КонтрагентСсылка;
	КонецЕсли;
	Если ЗначениеЗаполнено(КонтрагентСсылка) ИЛИ ЗначениеЗаполнено(НомерТелефонаКлиента) Тогда 
		IPТелефонияКлиент.ИсходящийЗвонокОсуществитьПоКонтрагенту(КонтрагентСсылка, НомерТелефонаКлиента, ОписаниеОшибки);
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Переадресовать клиента
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПереадресоватьКлиента(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("IPТелефонияПодключаемоеОборудование"	, ПОIPТелефонии);		
	ПараметрыФормы.Вставить("IDЗвонка"								, IDЗвонка);
	ПараметрыФормы.Вставить("IDПлеча"								, IDПлеча);	
	ПараметрыФормы.Вставить("НаНомерТелефона"						, НаНомерТелефона);
	ПараметрыФормы.Вставить("НомерТелефонаКлиента"					, НомерТелефонаКлиента);
	ПараметрыФормы.Вставить("ПереводЗвонка"							, Истина);	
	// ПараметрыФормы.Вставить("ПереадресацияЗвонка"					, Ложь);
	ОткрытьФорму("Справочник.ТелефонныеАппараты.Форма.ФормаПереадресации", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Внести в черный список
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВнестиВЧерныйСписок(Команда)

	ОписаниеОповещенияВводаСтроки = Новый ОписаниеОповещения("ПослеВводаПричиныБлокировки", ЭтотОбъект);
	ПоказатьВводСтроки(ОписаниеОповещенияВводаСтроки, Заметка, "Кто звонит?", , Истина);	
	
КонецПроцедуры

&НаКлиенте
// Процедура - После ввода причины блокировки
//
// Параметры:
//  ВведенноеЗначение		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПослеВводаПричиныБлокировки(ВведенноеЗначение, ДополнительныеПараметры = Неопределено) Экспорт 
	
	Если ЗначениеЗаполнено(СокрЛП(ВведенноеЗначение)) Тогда 
		ДобавитьНеобрабатываемыйНомер(НомерТелефонаКлиента, СокрЛП(ВведенноеЗначение));
		ПолучитьСтруктуруБлокировкиНомера(СтруктураБлокировкиНомера, СписокВариантовНомераТелефона);
		ПометитьНаУдалениеСвязанныеОбъекты(Истина);
		ВызвытьОповещение = Истина; 
		ЗаполнитьРезультатЗвонка(ПредопределенноеЗначение("Перечисление.РезультатыОбработкиЗвонка.ЗвонитНеПациент"));
		ЭтаФорма.Закрыть();
	КонецЕсли;                          
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - Поле номер телефона очистка
//
// Параметры:
//  Элемент				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПолеНомерТелефонаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Поиск контрагента создание
//
// Параметры:
//  Элемент				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПоискКонтрагентаСоздание(Элемент, СтандартнаяОбработка)
	
	ГруппаКлиентов = ОбщегоНазначенияСтоматология.ВернутьГруппуКлиентов();
	ТекущийРодитель = ?(ЗначениеЗаполнено(ГруппаКлиентов), ГруппаКлиентов, ГруппаКонтрагентов);
	
	СтандартнаяОбработка = Ложь;
	ЗначениеЗаполнения = Новый Структура();
	ЗначениеЗаполнения.Вставить("ДобавитьНомерТелефона"			, Истина);
	ЗначениеЗаполнения.Вставить("ТекстЗаполнения"				, Элемент.ТекстРедактирования);
	ЗначениеЗаполнения.Вставить("НомерТелефона"					, ПреобразованныйНомерТелефона);
	ЗначениеЗаполнения.Вставить("ТекущийРодитель"				, ТекущийРодитель);
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначениеЗаполнения), ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
// Процедура - Поиск контрагента обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПоискКонтрагентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда 
		СтандартнаяОбработка = Ложь;
		ЗначениеЗаполнения = Новый Структура();
		ЗначениеЗаполнения.Вставить("ДобавитьНомерТелефона"			, Истина);
		ЗначениеЗаполнения.Вставить("НомерТелефона"					, ПреобразованныйНомерТелефона);
		
		ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", Новый Структура("Ключ, ЗначенияЗаполнения", ВыбранноеЗначение, ЗначениеЗаполнения), ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Заметки при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ЗаметкиПриИзменении(Элемент)
	
	СохранитьЗаметкуПользователя(ПОIPТелефонии, IDЗвонка, Заметка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура - Инициализировать номер телефона клиента
//
Процедура ИнициализироватьПараметрыТелефонногоЗвонка()
	
	Если ТаблицаАктивныхПользователей.НайтиСтроки(Новый Структура("ВнутреннийНомер", СНомерТелефона)).Количество() <> 0 Тогда 
		// Это переадресация с внутреннего номера
	Иначе 	
		НомерТелефонаКлиента = СНомерТелефона;
	КонецЕсли;
		
	ПараметрыТелефонногоЗвонка = Новый Структура("ДатаВремяЗвонка, ПиктограммаЗвонка, НачалоРазговора, ОкончаниеЗвонка, URLЗаписи, ФайлЗаписи, Заявка, КоллтрекингНомер, Заметка, ВнутреннийНомерСотрудника", Дата(1,1,1), 0, Дата(1,1,1), Дата(1,1,1), "", Справочники.Файлы.ПустаяСсылка(), Справочники.Заявки.ПустаяСсылка(), "");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ИсторияВызовов.Заявка КАК Заявка,
	|	ВЫБОР
	|		КОГДА ИсторияВызовов.НаправлениеВызова = ЗНАЧЕНИЕ(Перечисление.ВариантыНаправленияВызова.Исходящий)
	|			ТОГДА ИсторияВызовов.ПользовательSip
	|		ИНАЧЕ ИсторияВызовов.НомерТелефона
	|	КОНЕЦ КАК НомерТелефонаКлиента,
	|	ВЫБОР
	|		КОГДА ИсторияВызовов.НачалоРазговора = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ИсторияВызовов.НачалоВызова
	|		ИНАЧЕ ИсторияВызовов.НачалоРазговора
	|	КОНЕЦ КАК ДатаВремяЗвонка,
	|	ВЫБОР
	|		КОГДА ИсторияВызовов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗвонка.Пропущен)
	|			ТОГДА 2
	|		КОГДА ИсторияВызовов.НаправлениеВызова = ЗНАЧЕНИЕ(Перечисление.ВариантыНаправленияВызова.Исходящий)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПиктограммаЗвонка,
	|	ИсторияВызовов.ПользовательSip КАК ПользовательSip,
	|	ИсторияВызовов.НомерТелефона КАК НомерТелефона,
	|	ИсторияВызовов.НачалоРазговора КАК НачалоРазговора,
	|	ИсторияВызовов.ОкончаниеЗвонка КАК ОкончаниеЗвонка,
	|	ИсторияВызовов.КоллтрекингНомер КАК КоллтрекингНомер,
	|	ИсторияВызовов.URLЗаписи КАК URLЗаписи,
	|	ИсторияВызовов.ФайлЗаписи КАК ФайлЗаписи,
	|	ИсторияВызовов.Заметка КАК Заметка,
	|	ИсторияВызовов.ВнутреннийНомерСотрудника КАК ВнутреннийНомерСотрудника
	|ИЗ
	|	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
	|ГДЕ
	|	ИсторияВызовов.ОборудованиеТелефонии = &ОборудованиеТелефонии
	|	И ИсторияВызовов.IDЗвонка = &IDЗвонка");
	
	Запрос.УстановитьПараметр("ОборудованиеТелефонии"	, ПОIPТелефонии);
	Запрос.УстановитьПараметр("IDЗвонка"				, IDЗвонка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ПараметрыТелефонногоЗвонка, Выборка);		
		
		Если НЕ ЗначениеЗаполнено(НомерТелефонаКлиента) Тогда
			
			ЭтоAtsAm   		 = ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсAtsAm;
			ЭтоITOOLABS      = ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсITOOLABS;
			ЭтоCoMagic 		 = ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсCoMagic;
			ЭтоBINOTEL		 = ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсBINOTEL;
			
			Если ЭтоAtsAm ИЛИ ЭтоCoMagic ИЛИ ЭтоITOOLABS ИЛИ ЭтоBINOTEL Тогда
				НомерТелефонаКлиента = Выборка.НомерТелефона;
			ИначеЕсли ЗначениеЗаполнено(Выборка.НомерТелефонаКлиента) И СтрДлина(Выборка.НомерТелефонаКлиента) > 4 Тогда 
				НомерТелефонаКлиента = Выборка.НомерТелефонаКлиента;
			Иначе 
				НомерТелефонаКлиента = Макс(Выборка.ПользовательSip, Выборка.НомерТелефона);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Формируем представление и варианты номера телефона
	СформироватьПредставлениеИСписокВариантовНомера(НомерТелефонаКлиента, ПреобразованныйНомерТелефона, СписокВариантовНомераТелефона);
	
	// Получаем структуру блокировки номера, если был заблокирован
	ПолучитьСтруктуруБлокировкиНомера(СтруктураБлокировкиНомера, СписокВариантовНомераТелефона);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - Получить структуру блокировки номера
//
// Параметры:
//  СтруктураБлокировкиНомера		 - 	 - 
//  СписокВариантовНомераТелефона	 - 	 - 
//
Процедура ПолучитьСтруктуруБлокировкиНомера(СтруктураБлокировкиНомера, Знач СписокВариантовНомераТелефона)
	
	СтруктураБлокировкиНомера = Неопределено;
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	ЗаблокированныеНомераТелефонов.НомерТелефонаАбонента,
	             	  |	ЗаблокированныеНомераТелефонов.ПричинаБлокировки,
	             	  |	ЗаблокированныеНомераТелефонов.АвторБлокировки
	             	  |ИЗ
	             	  |	РегистрСведений.ЗаблокированныеНомераТелефонов КАК ЗаблокированныеНомераТелефонов
	             	  |ГДЕ
	             	  |	ЗаблокированныеНомераТелефонов.НомерТелефонаАбонента В(&МассивНомеровТелефонаАбонента)";
	
	Запрос.УстановитьПараметр("МассивНомеровТелефонаАбонента", СписокВариантовНомераТелефона.ВыгрузитьЗначения());
	
	ВыборкаЗаблокированных = Запрос.Выполнить().Выбрать();
	Если ВыборкаЗаблокированных.Следующий() Тогда
		СтруктураБлокировкиНомера = Новый Структура("НомерТелефонаАбонента, ПричинаБлокировки, АвторБлокировки");
		ЗаполнитьЗначенияСвойств(СтруктураБлокировкиНомера, ВыборкаЗаблокированных);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - Сформировать представление и список вариантов номера
//
// Параметры:
//  НомерТелефона					 - 	 - 
//  ПреобразованныйНомерТелефона	 - 	 - 
//  СписокВариантовНомераТелефона	 - 	 - 
//
Процедура СформироватьПредставлениеИСписокВариантовНомера(Знач НомерТелефона, ПреобразованныйНомерТелефона, СписокВариантовНомераТелефона)
	
	НомерТелефона = СокрЛП(НомерТелефона);	
	СписокВариантовНомераТелефона.Очистить();
	СписокВариантовНомераТелефона.Добавить(НомерТелефона);
	УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(НомерТелефона, Новый СписокЗначений);
	СписокВариантовНомераТелефона.Добавить(НомерТелефона);
	
	Если ЗначениеЗаполнено(НомерТелефона) Тогда 
		
		Объект_XDTO_Телефон = ПолучитьСтруктуру_XDTO(НомерТелефона, Перечисления.ТипыКонтактнойИнформации.Телефон);
		
		Если Объект_XDTO_Телефон <> Неопределено Тогда
			
			СписокВариантовНомераТелефона.Добавить(Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
			СписокВариантовНомераТелефона.Добавить(Объект_XDTO_Телефон.Представление);
			
			КодСтраны = Константы.СтранаУчета.Получить().Код;
			// КодСтраны = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.Страна.Код;
			
			Если КодСтраны = "804" Тогда
				СписокВариантовНомераТелефона.Добавить("38"  + Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
				СписокВариантовНомераТелефона.Добавить("+38" + Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
			ИначеЕсли КодСтраны = "051" Тогда
				СписокВариантовНомераТелефона.Добавить("374"  + Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
				СписокВариантовНомераТелефона.Добавить("+374" + Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);	
			Иначе
				СписокВариантовНомераТелефона.Добавить("0"  + Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
				СписокВариантовНомераТелефона.Добавить("8"  + Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
				СписокВариантовНомераТелефона.Добавить("7"  + Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
				СписокВариантовНомераТелефона.Добавить("+7" + Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
			КонецЕсли;	
		КонецЕсли;
		
	КонецЕсли;
	
	ПреобразованныйНомерТелефона = НомерТелефона;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить структуру клиента по номеру телефона
//
// Параметры:
//  СписокВариантовНомераТелефона	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтруктуруКлиентаПоНомеруТелефона(СписокВариантовНомераТелефона)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Контрагент,
		|	КонтрагентыКонтактнаяИнформация.Ссылка.Наименование КАК Наименование,
		|	ВЫРАЗИТЬ(КонтрагентыКонтактнаяИнформация.Ссылка.НаименованиеПолное КАК Строка(1000)) КАК НаименованиеПолное,
		|	КонтрагентыКонтактнаяИнформация.Ссылка.Куратор КАК Куратор,
		|	КонтрагентыКонтактнаяИнформация.Ссылка.ДатаРожденияКлиента КАК ДатаРожденияКлиента
		|ПОМЕСТИТЬ ТаблицаКонтрагентов
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|	И КонтрагентыКонтактнаяИнформация.НомерТелефона В(&МассивНомеровТелефонов)
		|	И НЕ КонтрагентыКонтактнаяИнформация.Ссылка.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ 
		|	Сделки.Контрагент КАК Контрагент,
		|	Сделки.Контрагент.Наименование КАК КонтрагентНаименование,
		|	ВЫРАЗИТЬ(Сделки.Контрагент.НаименованиеПолное КАК Строка(1000)) КАК КонтрагентНаименованиеПолное,
		|	Сделки.Контрагент.Куратор КАК КонтрагентКуратор,
		|	Сделки.Контрагент.ДатаРожденияКлиента КАК КонтрагентДатаРожденияКлиента
		|ИЗ
		|	Справочник.Сделки КАК Сделки
		|ГДЕ
		|	Сделки.ВходящийНомерТелефона В(&МассивНомеровТелефонов)
		|	И НЕ Сделки.Ссылка.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ 
		|	Событие.Контрагент КАК Контрагент,
		|	Событие.Контрагент.Наименование КАК КонтрагентНаименование,
		|	ВЫРАЗИТЬ(Событие.Контрагент.НаименованиеПолное КАК Строка(1000)) КАК КонтрагентНаименованиеПолное,
		|	Событие.Контрагент.Куратор КАК КонтрагентКуратор,
		|	Событие.Контрагент.ДатаРожденияКлиента КАК КонтрагентДатаРожденияКлиента
		|ИЗ
		|	Документ.Событие КАК Событие
		|ГДЕ
		|	Событие.ВходящийНомерТелефона В(&МассивНомеровТелефонов)
		|	И НЕ Событие.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаКонтрагентов.Контрагент КАК Контрагент,
		|	ТаблицаКонтрагентов.Наименование КАК Наименование,
		|	ТаблицаКонтрагентов.НаименованиеПолное КАК НаименованиеПолное,
		|	ТаблицаКонтрагентов.Куратор КАК Куратор,
		|	ЕСТЬNULL(СтатусыКонтрагентовСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)) КАК СтатусКонтрагента,
		|	ТаблицаКонтрагентов.ДатаРожденияКлиента КАК ДатаРожденияКлиента
		|ПОМЕСТИТЬ ТаблицаКонтрагентовСоСтатусами
		|ИЗ
		|	ТаблицаКонтрагентов КАК ТаблицаКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКонтрагентов.СрезПоследних(
		|				,
		|				Контрагент В
		|					(ВЫБРАТЬ
		|						ВТКонтрагенты.Контрагент
		|					ИЗ
		|						ТаблицаКонтрагентов КАК ВТКонтрагенты)) КАК СтатусыКонтрагентовСрезПоследних
		|		ПО ТаблицаКонтрагентов.Контрагент = СтатусыКонтрагентовСрезПоследних.Контрагент";
	

	
	Запрос.УстановитьПараметр("МассивНомеровТелефонов", СписокВариантовНомераТелефона.ВыгрузитьЗначения());

	МассивТаблиц = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ТаблицаКонтрагентов 			= МассивТаблиц[1].Выгрузить();

	СписокКонтрагентов 				= Новый СписокЗначений;
	СписокКонтрагентов_Временный 	= Новый СписокЗначений;
	СтруктураКлиента 				= Новый Структура;
	
	Для Каждого СтрокаТаблицы Из ТаблицаКонтрагентов Цикл 
		Если ЗначениеЗаполнено(СтрокаТаблицы.Контрагент) И СписокКонтрагентов_Временный.НайтиПоЗначению(СтрокаТаблицы.Контрагент) = Неопределено Тогда
			СписокКонтрагентов.Добавить(Новый Структура("КонтрагентСсылка, Наименование, НаименованиеПолное, СтатусКонтрагента, Куратор, ДатаРожденияКлиента, ПредставлениеДатыРожденияСтрокой", СтрокаТаблицы.Контрагент, СтрокаТаблицы.Наименование, СтрокаТаблицы.НаименованиеПолное, СтрокаТаблицы.СтатусКонтрагента, СтрокаТаблицы.Куратор, СтрокаТаблицы.ДатаРожденияКлиента, ""));
			СписокКонтрагентов_Временный.Добавить(СтрокаТаблицы.Контрагент);
		КонецЕсли;
	КонецЦикла;	
	
	СтруктураКлиента.Вставить("СписокКонтрагентов", СписокКонтрагентов);
	
	СписокКонтрагентов_Временный.Очистить();
	
	Возврат СтруктураКлиента;

КонецФункции	

&НаСервереБезКонтекста
// Процедура - Добавить необрабатываемый номер
//
// Параметры:
//  Номер	 - 	 - 
//
Процедура ДобавитьНеобрабатываемыйНомер(Знач НомерТелефона, Знач ПричинаБлокировки = "")
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.ЗаблокированныеНомераТелефонов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.НомерТелефонаАбонента 	= НомерТелефона;
	МенеджерЗаписи.ПричинаБлокировки 		= ПричинаБлокировки;
	МенеджерЗаписи.АвторБлокировки 			= ПараметрыСеанса.ТекущийСотрудник;	
	МенеджерЗаписи.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
// Процедура - Установить видимость элементов формы
//
Процедура УстановитьВидимостьЭлементовФормы()   
		
	Элементы.НомерВБазеНайден.Видимость 							= ЗначениеЗаполнено(СтруктураКлиента.СписокКонтрагентов);
	Элементы.НомерВБазеНеНайденПоле.Видимость 						= НЕ ЗначениеЗаполнено(СтруктураКлиента.СписокКонтрагентов);
	Элементы.ПерезвонитьКлиенту.Видимость 							= ОткрытаИзСписка;
	Элементы.ПерезвонитьКлиенту.Заголовок 							= ?(ПараметрыТелефонногоЗвонка.ПиктограммаЗвонка = 2, "Перезвонить", "Позвонить");;
	Элементы.ГруппаПерезвонитьПереадресовать.ЦветФона 				= ?(ОткрытаИзСписка, Новый Цвет(25, 116, 206), Новый Цвет(0, 112, 210));
	
	Элементы.ГруппаСоздатьПациентаИСделку.Видимость 				= НЕ ЭтоГородской И (НЕ ЗначениеЗаполнено(СтруктураКлиента.СписокКонтрагентов) ИЛИ (ЗначениеЗаполнено(ЗаявкаОснование) И ТипЗнч(ЗаявкаОснование) = Тип("СправочникСсылка.Сделки") И ЗаявкаОснование.ЭтапСделки.НомерЭтапа = 1));
	Элементы.ЗвонокНеСвязанСприемом.Видимость 						= ЗначениеЗаполнено(ЗаявкаОснование) И ((ТипЗнч(ЗаявкаОснование) = Тип("СправочникСсылка.Сделки") И ЗаявкаОснование.ЭтапСделки.НомерЭтапа = 1) ИЛИ НЕ ЗначениеЗаполнено(СтруктураКлиента.СписокКонтрагентов)); 
	Элементы.НекачественнаяЗаявка.Видимость 						= ЗначениеЗаполнено(ЗаявкаОснование) И (ТипЗнч(ЗаявкаОснование) = Тип("СправочникСсылка.Заявки") ИЛИ (ТипЗнч(ЗаявкаОснование) = Тип("СправочникСсылка.Сделки") И ЗаявкаОснование.ЭтапСделки.НомерЭтапа = 1)); 
		
	Элементы.ВнестиВЧерныйСписок.Видимость 							= НЕ ЭтоГородской И (НЕ ЗначениеЗаполнено(СтруктураКлиента.СписокКонтрагентов) ИЛИ НЕ ПациентыСуществуют(СтруктураКлиента.СписокКонтрагентов));
	
	Элементы.ГруппаЗаписатьПациента.Видимость 						= ЗначениеЗаполнено(СтруктураКлиента.СписокКонтрагентов) И НЕ ЭтоГородской;
	Элементы.ГруппаЗаписатьПациентаВЛистОжидания.Видимость			= ЗначениеЗаполнено(СтруктураКлиента.СписокКонтрагентов) И НЕ ЭтоГородской;
	Если ЗначениеЗаполнено(СтруктураКлиента.СписокКонтрагентов) И СтруктураКлиента.СписокКонтрагентов.Количество() > 1 Тогда
		Элементы.ЗаписатьПациента.Картинка = БиблиотекаКартинок.СтрелкаВнизСплошная;
		Элементы.ЗаписатьПациентаВЛистОжидания.Картинка = БиблиотекаКартинок.СтрелкаВнизСплошная;
	Иначе
		Элементы.ЗаписатьПациента.Картинка = Новый Картинка;
	КонецЕсли;
    Элементы.ГруппаСоздатьПациентаИЗаписать.Видимость 				= НЕ ЗначениеЗаполнено(СтруктураКлиента.СписокКонтрагентов);
	Элементы.ПрослушатьЗапись.Доступность                           = ЗаписьРазговораДоступна;
	Элементы.ГруппаЗарегистрированныеЗаявки.Видимость               = ОткрытаИзСписка;
	Элементы.ГруппаДвеКолонки.Видимость               				= СтруктураБлокировкиНомера = Неопределено; 
	Элементы.ГруппаУдалитьИзЧерногоСписка.Видимость               	= НЕ СтруктураБлокировкиНомера = Неопределено;
	
	ОтобразитьСделкиИЗаписи();
	ВывестиИнформациюПоКлиенту();

	Элементы.ГруппаЗаметки.Видимость               					= СтруктураБлокировкиНомера = Неопределено; 
	Элементы.ГруппаФИО.Видимость               						= НЕ ЗначениеЗаполнено(СтруктураКлиента.СписокКонтрагентов) И СтруктураБлокировкиНомера = Неопределено И НЕ ЭтоГородской; 
	Элементы.ДекорацияПричинаБлокировки.Видимость               	= НЕ СтруктураБлокировкиНомера = Неопределено;
	Элементы.ДекорацияПричинаБлокировки.Заголовок                   = Заметка;
	
КонецПроцедуры

&НаСервере
// Процедура - Вывести информацию по клиенту
//
Процедура ВывестиИнформациюПоКлиенту();
	
	ВывестиИнформациюПоБлокировкеНомера();
			
	// Выводим дату и время звонка
	Элементы.ДекорацияНадписьДатаВремяЗвонка.Заголовок 		= Формат(ПараметрыТелефонногоЗвонка.ДатаВремяЗвонка, "ДФ='dd.MM.yy'' - ''HH:mm'");
	
	// Выведем продолжительность звонка
	ВывестиПродолжительностьЗвонка();
	
	// Выводим гиперссылку для прослушивания записи
	ОтобразитьГиперссылкуПрослушиванияЗаписи();
	
	// Выводим пиктограмму звонка	
	Элементы.ДекорацияКартинкаЗвонок.Картинка 				= ?(ПараметрыТелефонногоЗвонка.ПиктограммаЗвонка = 0, БиблиотекаКартинок.ТелефонныйЗвонокВходящийБольшой, ?(ПараметрыТелефонногоЗвонка.ПиктограммаЗвонка = 1, БиблиотекаКартинок.ТелефонныйЗвонокИсходящийБольшой, БиблиотекаКартинок.ТелефонныйЗвонокПропущенныйБольшой));	
	
	Элементы.ПолеНомерТелефонаНайден.ПодсказкаВвода 		= ПреобразованныйНомерТелефона;	
	Элементы.ПолеНомерТелефонаНеНайден.ПодсказкаВвода 		= ПреобразованныйНомерТелефона;
	
	// Сформируем заголовок формы
	ЭтаФорма.Заголовок = ?(ПараметрыТелефонногоЗвонка.ПиктограммаЗвонка = 0, НСтр("ru = 'Входящий звонок: '; en = 'Incoming call: '"), 
	?(ПараметрыТелефонногоЗвонка.ПиктограммаЗвонка = 1, НСтр("ru = 'Исходящий звонок: '; en = 'Outgoing call:'"), НСтр("ru = 'Пропущенный звонок: '; en = 'Missed call:'")))
	+ Формат(ПараметрыТелефонногоЗвонка.ДатаВремяЗвонка, "ДФ=HH:mm") 
	+ ?(ЗначениеЗаполнено(СтруктураКлиента.СписокКонтрагентов), НСтр("ru = ', от '; en = ', from '"), "") 
	+ ?(ЗначениеЗаполнено(СтруктураКлиента.СписокКонтрагентов), СокрЛП(СтруктураКлиента.СписокКонтрагентов[0].Значение.Наименование), "");				
	
	СформироватьПредставленияКонтрагентов();
	
	// Отобразим заявку если сформирована
	СформироватьПредставлениеЗаявки();
	
	МассивАктивныхПользователей = ТаблицаАктивныхПользователей.НайтиСтроки(Новый Структура("ВнутреннийНомер", СНомерТелефона));
	Если МассивАктивныхПользователей.Количество() <> 0 Тогда 
		Элементы.ДекорацияПереадресованноОт.Видимость = Истина;
		Элементы.ДекорацияПереадресованноОт.Заголовок = НСтр("ru = 'Переадресованно от: '; en = 'Redirected from: '") + СокрЛП(Строка(МассивАктивныхПользователей[0].Пользователь));
	Иначе 
		Элементы.ДекорацияПереадресованноОт.Видимость = Ложь;
	КонецЕсли;	
	
	ОтобразитьЗаметкиПользователей();
	
КонецПроцедуры

&НаСервере
// Процедура - Вывести информацию по блокировке номера
//
Процедура ВывестиИнформациюПоБлокировкеНомера()
	
	Элементы.ГруппаИнформацияОБлокировке.Видимость 					= НЕ СтруктураБлокировкиНомера = Неопределено;			
	Если НЕ СтруктураБлокировкиНомера = Неопределено Тогда
		Если ТипЗнч(СтруктураБлокировкиНомера) = Тип("Структура") И СтруктураБлокировкиНомера.Свойство("АвторБлокировки") И ЗначениеЗаполнено(СтруктураБлокировкиНомера.АвторБлокировки) Тогда 
			Элементы.ДекорацияИнформацияОБлокировке.Заголовок 		= НСтр("ru = 'Номер заблокирован ('; en = 'Number is blocked ('") + СокрЛП(Строка(СтруктураБлокировкиНомера.АвторБлокировки)) + ")";
		Иначе 
			Элементы.ДекорацияИнформацияОБлокировке.Заголовок 		= НСтр("ru = 'Номер заблокирован'; en = 'Number is blocked'");
		КонецЕсли; 
	КонецЕсли;	

КонецПроцедуры

&НаСервере
// Процедура - Вывести продолжительность звонка
//
Процедура ВывестиПродолжительностьЗвонка()
	
	Элементы.ДекорацияПродолжительностьЗвонка.Видимость = Ложь;	
	Если ОткрытаИзСписка = Истина Тогда 
		Если ЗначениеЗаполнено(ПараметрыТелефонногоЗвонка.НачалоРазговора) И ЗначениеЗаполнено(ПараметрыТелефонногоЗвонка.ОкончаниеЗвонка) Тогда 
			Если ПараметрыТелефонногоЗвонка.НачалоРазговора <= ПараметрыТелефонногоЗвонка.ОкончаниеЗвонка Тогда 
				Элементы.ДекорацияПродолжительностьЗвонка.Видимость = Истина;				
				ПродолжительностьЗвонка = Дата(1,1,1) + (ПараметрыТелефонногоЗвонка.ОкончаниеЗвонка - ПараметрыТелефонногоЗвонка.НачалоРазговора);
				Если ПродолжительностьЗвонка <= Дата('00010101000059') Тогда 
					Элементы.ДекорацияПродолжительностьЗвонка.Заголовок = Формат(ПродолжительностьЗвонка, СтрШаблон("ДФ='с ""%1""'", НСтр("ru = 'сек.'; en = 'sec.'")));
				ИначеЕсли ПродолжительностьЗвонка <= Дата('00010101005959') И ПродолжительностьЗвонка > Дата('00010101000059') Тогда
					Элементы.ДекорацияПродолжительностьЗвонка.Заголовок = Формат(ПродолжительностьЗвонка, СтрШаблон("ДФ='m ""%1"" с ""%2""'", НСтр("ru = 'мин.'; en = 'min.'"), НСтр("ru = 'сек.'; en = 'sec.'")));
				ИначеЕсли ПродолжительностьЗвонка <= Дата('00010101235959') И ПродолжительностьЗвонка > Дата('00010101005959') Тогда
					Элементы.ДекорацияПродолжительностьЗвонка.Заголовок = Формат(ПродолжительностьЗвонка, СтрШаблон("ДФ='h ""%1"" m ""%2"" с ""%3""'", НСтр("ru = 'ч.'; en = 'h.'"), НСтр("ru = 'мин.'; en = 'min.'"), НСтр("ru = 'сек.'; en = 'sec.'")));
				Иначе 	                                                                                  
					Элементы.ДекорацияПродолжительностьЗвонка.Заголовок = Формат(ПродолжительностьЗвонка, СтрШаблон("ДФ='d ""%1"" h ""%2"" m ""%3"" с ""%4""'", НСтр("ru = 'дней'; en = 'days'"), НСтр("ru = 'ч.'; en = 'h.'"), НСтр("ru = 'мин.'; en = 'min.'"), НСтр("ru = 'сек.'; en = 'sec.'")));
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Элементы.ДекорацияРазделитель_1.Видимость = Элементы.ДекорацияПродолжительностьЗвонка.Видимость;
	
КонецПроцедуры

&НаСервере
// Процедура - Отобразить гиперссылку прослушивания записи
//
Процедура ОтобразитьГиперссылкуПрослушиванияЗаписи()
	
	Элементы.ПрослушатьЗапись.Видимость = Ложь;	
	Если ОткрытаИзСписка = Истина Тогда 
		Если ЗначениеЗаполнено(ПараметрыТелефонногоЗвонка.URLЗаписи) ИЛИ ЗначениеЗаполнено(ПараметрыТелефонногоЗвонка.ФайлЗаписи) Тогда 
			Элементы.ПрослушатьЗапись.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Элементы.ДекорацияРазделитель_2.Видимость = Элементы.ПрослушатьЗапись.Видимость;
	
КонецПроцедуры

&НаСервере
// Процедура - Сформировать представления партнеров и контактных лиц
//
Процедура СформироватьПредставленияКонтрагентов()
	
	// Определяем родительские группы
	ГруппаРазмещенияКонтрагентов 					= Элементы.Найти("ГруппаСписокКонтрагентов");
	
	// Основной менеджер.
	ТекстКнопкиОсновногоМенеджера 					= "";
	
	// Формируем представление партнеров
	Если НЕ ГруппаРазмещенияКонтрагентов = Неопределено Тогда 
		// Очищаем родительские группы					
		УдалитьЭлементыГруппы(ГруппаРазмещенияКонтрагентов);
		// Создаем элементы
		Для Каждого ЭлементСписка Из СтруктураКлиента.СписокКонтрагентов Цикл
			
			Индекс 									= СтруктураКлиента.СписокКонтрагентов.Индекс(ЭлементСписка);
			
			Если Индекс > -1 Тогда
				
				// Группа контрагента
				Группа_Контрагент_НоваяСтрока                      = Элементы.Добавить("Группа_Контрагент_Строка" + Индекс, Тип("ГруппаФормы"), ГруппаРазмещенияКонтрагентов);
				Группа_Контрагент_НоваяСтрока.Вид                  = ВидГруппыФормы.ОбычнаяГруппа;
				Группа_Контрагент_НоваяСтрока.Отображение          = ОтображениеОбычнойГруппы.Нет;
				Группа_Контрагент_НоваяСтрока.Группировка          = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				Группа_Контрагент_НоваяСтрока.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
				Группа_Контрагент_НоваяСтрока.ОтображатьЗаголовок  = Ложь;
				
				// Добавим группу с пациентом и куратором
				Группа_Пациент_НоваяСтрока                      = Элементы.Добавить("Группа_Пациент_Строка" + Индекс, Тип("ГруппаФормы"), Группа_Контрагент_НоваяСтрока);
				Группа_Пациент_НоваяСтрока.Вид                  = ВидГруппыФормы.ОбычнаяГруппа;
				Группа_Пациент_НоваяСтрока.Отображение          = ОтображениеОбычнойГруппы.Нет;
				Группа_Пациент_НоваяСтрока.Группировка          = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
				Группа_Пациент_НоваяСтрока.ОтображатьЗаголовок  = Ложь;

				// Добавим кнопку контрагента
				НовыйЭлемент_Кнопка 					= Элементы.Добавить("Кнопка_ОткрытьКонтрагента_" + Индекс, Тип("КнопкаФормы"), Группа_Пациент_НоваяСтрока);
				ПредставлениеДРСтрокой					= ОбщегоНазначенияСтоматология.ВозвратитьВозрастСтрокой(ЭлементСписка.Значение.ДатаРожденияКлиента);
				ПолныхЛет = ?(ЗначениеЗаполнено(ЭлементСписка.Значение.ДатаРожденияКлиента), ", " + Формат(ЭлементСписка.Значение.ДатаРожденияКлиента, "ДФ=dd.MM.yyyy") 
														+ " (" + ПредставлениеДРСтрокой + ")",
														"");
				ЭлементСписка.Значение.ПредставлениеДатыРожденияСтрокой = ПредставлениеДРСтрокой;
				
				НовыйЭлемент_Кнопка.Заголовок 			= ?(ЗначениеЗаполнено(ЭлементСписка.Значение.Наименование), СокрЛП(ЭлементСписка.Значение.Наименование) + ПолныхЛет, "Не заполнено ФИО"); 
													//+ ", " + Формат(ЭлементСписка.Значение.ДатаРожденияКлиента, "ДФ=dd.MM.yyyy") 
													//	+ " (" + ОбщегоНазначенияСтоматология.ВозвратитьВозрастСтрокой(ЭлементСписка.Значение.ДатаРожденияКлиента) + ")";
				НовыйЭлемент_Кнопка.ЦветТекста 			= Новый Цвет(51, 51, 51);
				НовыйЭлемент_Кнопка.Шрифт 				= Новый Шрифт("Arial", 18);
				НовыйЭлемент_Кнопка.ОтображениеФигуры 	= ОтображениеФигурыКнопки.Нет;
				
				// Добавим команду
				НоваяКоманда 							= Команды.Найти("Кнопка_ОткрытьКонтрагента_" + Индекс);
				Если НоваяКоманда = Неопределено Тогда 
					НоваяКоманда 						= Команды.Добавить("Кнопка_ОткрытьКонтрагента_" + Индекс);
					НоваяКоманда.Действие 				= "Подключаемый_ОткрытьКонтрагента";				
				КонецЕсли;
				НовыйЭлемент_Кнопка.ИмяКоманды 			= НоваяКоманда.Имя;
				
				
				// Добавим кнопку куратора
				Если ЗначениеЗаполнено(ЭлементСписка.Значение.Куратор) Тогда
					ФИОСокращенное = Справочники.Сотрудники.ПолучитьСокращенноеНаименованиеСотрудника(, ЭлементСписка.Значение.Куратор);
				КонецЕсли;
					
				ТекстКнопкиОсновногоМенеджера = ?(ЗначениеЗаполнено(ЭлементСписка.Значение.Куратор), НСтр("ru = 'Куратор: '; en = 'Curator: '") + СокрЛП(ФИОСокращенное), "");
				
				Если ЗначениеЗаполнено(ТекстКнопкиОсновногоМенеджера) Тогда
					НовыйЭлемент_Кнопка 					= Элементы.Добавить("Кнопка_ОткрытьКуратора_" + Индекс, Тип("КнопкаФормы"), Группа_Пациент_НоваяСтрока);
					НовыйЭлемент_Кнопка.Заголовок 			= ТекстКнопкиОсновногоМенеджера;
					НовыйЭлемент_Кнопка.ЦветТекста 			= ЦветаСтиля.ПоясняющийТекст;
					НовыйЭлемент_Кнопка.Шрифт 				= Новый Шрифт("Arial", 14);
					НовыйЭлемент_Кнопка.ОтображениеФигуры 	= ОтображениеФигурыКнопки.Нет;
					НовыйЭлемент_Кнопка.Доступность 		= РольДоступна("ПолныеПрава");

					
					// Добавим команду
					НоваяКоманда 							= Команды.Найти("Кнопка_ОткрытьКуратора_" + Индекс);
					Если НоваяКоманда = Неопределено Тогда 
						НоваяКоманда 						= Команды.Добавить("Кнопка_ОткрытьКуратора_" + Индекс);
						НоваяКоманда.Действие 				= "Подключаемый_ОткрытьКуратора";				
					КонецЕсли;
					НовыйЭлемент_Кнопка.ИмяКоманды          = НоваяКоманда.Имя;
					
				КонецЕсли;
				
				// Общая группа меток контрагента
				Группа_МеткиКонтрагента_НоваяСтрока                     = Элементы.Добавить("Группа_МеткиКонтрагента_НоваяСтрока" + Индекс, Тип("ГруппаФормы"), Группа_Контрагент_НоваяСтрока);
				Группа_МеткиКонтрагента_НоваяСтрока.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
				Группа_МеткиКонтрагента_НоваяСтрока.Отображение         = ОтображениеОбычнойГруппы.Нет;
				Группа_МеткиКонтрагента_НоваяСтрока.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
				Группа_МеткиКонтрагента_НоваяСтрока.ОтображатьЗаголовок = Ложь;
				
				ОтобразитьМеткиКонтрагента(ЭлементСписка.Значение.КонтрагентСсылка,Группа_МеткиКонтрагента_НоваяСтрока,Индекс);
				
			КонецЕсли;	
			
			/////////////////////////// Отображение Полиса мед страхования
			
			МассивПолисовДействующие = Справочники.ПолисыМедицинскогоСтрахования.ПолучитьАктивныеПолисыКонтрагента(ЭлементСписка.Значение.КонтрагентСсылка, ТекущаяДатаСеанса(),,Ложь); 
			
			Индекс = ТаблицаПолисов.Количество();
			
			Для Каждого ЭлМассива Из МассивПолисовДействующие Цикл
				
				ЭлементГруппаМеткиПолис                     	= ЭтаФорма.Элементы.Добавить("ГруппаМеткиПолисИНФО_" + Индекс, Тип("ГруппаФормы"), ГруппаРазмещенияКонтрагентов);
				ЭлементГруппаМеткиПолис.Вид                 	= ВидГруппыФормы.ОбычнаяГруппа;
				ЭлементГруппаМеткиПолис.ОтображатьЗаголовок 	= Ложь;
				ЭлементГруппаМеткиПолис.Отображение         	= ОтображениеОбычнойГруппы.Нет;
				ЭлементГруппаМеткиПолис.Группировка         	= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;	
				ЭлементГруппаМеткиПолис.ГоризонтальныйИнтервал  = ИнтервалМеждуЭлементамиФормы.Нет;
				
				Если ЗначениеЗаполнено(ЭлМассива.СтраховаяКомпания.КраткоеНаименование) Тогда
					ФонМетки = ?(ЗначениеЗаполнено(ЭлМассива.СтраховаяКомпания.ЦветФонаМетки), ЗначениеИзСтрокиВнутр(ЭлМассива.СтраховаяКомпания.ЦветФонаМетки), WebЦвета.СеребристоСерый); 
					
					ЭлементГруппаМетка                      	= ЭтаФорма.Элементы.Добавить("ГруппаМеткаСКИНФО_" + Индекс, Тип("ГруппаФормы"), ЭлементГруппаМеткиПолис);
					ЭлементГруппаМетка.Вид                  	= ВидГруппыФормы.ОбычнаяГруппа;
					ЭлементГруппаМетка.ОтображатьЗаголовок  	= Ложь;
					ЭлементГруппаМетка.Отображение          	= ОтображениеОбычнойГруппы.Нет;
					ЭлементГруппаМетка.ЦветФона          		= ФонМетки;
					
					ДекорацияФормы_Метка = Элементы.Добавить("ДекорацияМеткаСКИНФО_" + Индекс, Тип("ДекорацияФормы"), ЭлементГруппаМетка);
					ДекорацияФормы_Метка.Вид 				   = ВидДекорацииФормы.Надпись;
					ДекорацияФормы_Метка.Заголовок 			   = ЭлМассива.СтраховаяКомпания.КраткоеНаименование;
					ДекорацияФормы_Метка.АвтоМаксимальнаяШирина = Ложь;
					ДекорацияФормы_Метка.ЦветТекста             = ?(ЭлМассива.СтраховаяКомпания.ЦветТекстаБелый, Новый Цвет(255,255,255), Новый Цвет(77,77,77));
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ЭлМассива.Договор) 
					И ЗначениеЗаполнено(ЭлМассива.Договор.ПрограммаСтрахования) Тогда
					
					ДанныеПрограммыСтрахования = Справочники.ПрограммыСтрахования.ПолучитьТекстЦветФонаИТекста(ЭлМассива.Договор.ПрограммаСтрахования);
					
					ЭлементГруппаМетка                      	= ЭтаФорма.Элементы.Добавить("ГруппаМеткаДоговорИНФО_" + Индекс, Тип("ГруппаФормы"), ЭлементГруппаМеткиПолис);
					ЭлементГруппаМетка.Вид                  	= ВидГруппыФормы.ОбычнаяГруппа;
					ЭлементГруппаМетка.ОтображатьЗаголовок  	= Ложь;
					ЭлементГруппаМетка.Отображение          	= ОтображениеОбычнойГруппы.Нет;
					ЭлементГруппаМетка.ЦветФона          		= ДанныеПрограммыСтрахования.ЦветФона;
					
					ДекорацияФормы_Метка = Элементы.Добавить("ДекорацияМеткаДоговорИНФО_" + Индекс, Тип("ДекорацияФормы"), ЭлементГруппаМетка);
					ДекорацияФормы_Метка.Вид 				   	= ВидДекорацииФормы.Надпись;
					ДекорацияФормы_Метка.Заголовок 			   	= ДанныеПрограммыСтрахования.Текст;
					ДекорацияФормы_Метка.АвтоМаксимальнаяШирина = Ложь;
					ДекорацияФормы_Метка.ЦветТекста             = ДанныеПрограммыСтрахования.ЦветТекста;
					
				КонецЕсли;  
				
				// Добавим декорацию перенести прием
				ДекорацияФормы_ПеренестиПрием 					= Элементы.Добавить("Декорация_ОткрытьПолис_" + Индекс, Тип("ДекорацияФормы"), ЭлементГруппаМеткиПолис);
				ДекорацияФормы_ПеренестиПрием.Вид 				= ВидДекорацииФормы.Надпись;
				ДекорацияФормы_ПеренестиПрием.Заголовок 		= ЭлМассива.Наименование; // + " №" + ЭлМассива.НомерПолиса + " с " + Формат(ЭлМассива.ДанаНачала,"ДФ=dd.MM.yyyy") + " по " + Формат(ЭлМассива.ДатаОкончания,"ДФ=dd.MM.yyyy"); 
				ДекорацияФормы_ПеренестиПрием.Гиперссылка 		= Истина;
				ДекорацияФормы_ПеренестиПрием.УстановитьДействие("Нажатие", "Подключаемый_ДекорацияФормы_ОткрытьПолис_Нажатие");
				ДекорацияФормы_ПеренестиПрием.АвтоМаксимальнаяШирина = Ложь;
				
				СсылкаНаПолис = ТаблицаПолисов.Добавить();
				СсылкаНаПолис.Полис = ЭлМассива;
				
				Индекс = Индекс + 1;
				
			КонецЦикла; 
			
		КонецЦикла; 	
		
		
		#Область Комментарии
		// Для Каждого ЭлементСписка Из СтруктураКлиента.СписокЗаявок Цикл
		//	Индекс 									= СтруктураКлиента.СписокЗаявок.Индекс(ЭлементСписка);
		//	// Добавим кнопку
		//	НовыйЭлемент_Кнопка 					= Элементы.Добавить("Кнопка_ОткрытьЗаявку_" + Индекс, Тип("КнопкаФормы"), ГруппаРазмещенияКонтрагентов);
		//	НовыйЭлемент_Кнопка.Заголовок 			= СокрЛП(ЭлементСписка.Значение.Наименование) + НСтр("ru = ' (Заявка)'; en = ' (Request)'");
		//	НовыйЭлемент_Кнопка.ЦветТекста 			= Новый Цвет(51, 51, 51);
		//	НовыйЭлемент_Кнопка.Шрифт 				= Новый Шрифт("Arial", 18);
		//	НовыйЭлемент_Кнопка.ОтображениеФигуры 	= ОтображениеФигурыКнопки.Нет;
		//	// Добавим команду
		//	НоваяКоманда 							= Команды.Найти("Кнопка_ОткрытьЗаявку_" + Индекс);
		//	Если НоваяКоманда = Неопределено Тогда 
		//		НоваяКоманда 						= Команды.Добавить("Кнопка_ОткрытьЗаявку_" + Индекс);
		//		НоваяКоманда.Действие 				= "Подключаемый_ОткрытьЗаявку";				
		//	КонецЕсли;
		//	НовыйЭлемент_Кнопка.ИмяКоманды 			= НоваяКоманда.Имя;
		//	
		//	Если НЕ ЗначениеЗаполнено(ТекстКнопкиОсновногоМенеджера) Тогда
		//		
		//		Если ЗначениеЗаполнено(ЭлементСписка.Значение.ОсновнойМенеджер) Тогда
		//			ФИОСокращенное = Справочники.Сотрудники.ПолучитьСокращенноеНаименованиеСотрудника(, ЭлементСписка.Значение.ОсновнойМенеджер);
		//		КонецЕсли;
		//		
		//		ТекстКнопкиОсновногоМенеджера = ?(ЗначениеЗаполнено(ЭлементСписка.Значение.ОсновнойМенеджер), НСтр("ru = 'Осн. менеджер: '; en = 'Primary manager: '") + СокрЛП(ФИОСокращенное), "");
		//	КонецЕсли;
		//				
		//	Если ЗначениеЗаполнено(ЭлементСписка.Значение.СтатусЗаявки) И НЕ ЗначениеЗаполнено(Элементы.ДекорацияСтатусКонтрагента.Заголовок) Тогда 
		//		Элементы.ДекорацияСтатусКонтрагента.Заголовок = СокрЛП(Строка(ЭлементСписка.Значение.СтатусЗаявки));
		//	КонецЕсли;
		// КонецЦикла;
		
		#КонецОбласти				
	КонецЕсли;
	
	Элементы.ДекорацияСтатусКонтрагента.Видимость = ЗначениеЗаполнено(Элементы.ДекорацияСтатусКонтрагента.Заголовок);
	
	#Область Комментарии
	
	#КонецОбласти
	
КонецПроцедуры

&НаСервере
// Процедура - Отобразить Метки Контрагента 
//
Процедура ОтобразитьМеткиКонтрагента(КлиентСсылка, ГруппаМетокКонтрагента, кИндекс)
	
	// Получаем метки Объект.Ссылка,ТекущаяДата(),ЭтаФорма,Элементы.ГруппаКлиентсикеМетки,,Истина,,,СоздатьСсылкуРедактирования)
	Метки = РегистрыСведений.МеткиКлиентов.ПолучитьМеткиКлиента(КлиентСсылка,ТекущаяДатаСеанса()).ВыгрузитьКолонку("Метка");

	мИндекс = 0;
	
	// Удаляем элементы группы
	Пока мИндекс < ГруппаМетокКонтрагента.ПодчиненныеЭлементы.Количество() Цикл
		
		ЭтаФорма.Элементы.Удалить(ГруппаМетокКонтрагента.ПодчиненныеЭлементы[мИндекс]);
		
	КонецЦикла;	
	
	ПолучитьНовуюСтроку = 0;
	// Размещаем элементы меток
	Для мИндекс = 0 По Метки.Количество()-1 Цикл
		
		Если ПолучитьНовуюСтроку = 0 Тогда
			
			Группа_Заглушка_НоваяСтрока 					= ЭтаФорма.Элементы.Добавить("Группа_Заглушка_Строка_" + кИндекс + "_" + мИндекс, Тип("ГруппаФормы"), ГруппаМетокКонтрагента);
			Группа_Заглушка_НоваяСтрока.Вид 				= ВидГруппыФормы.ОбычнаяГруппа;
			Группа_Заглушка_НоваяСтрока.Отображение 		= ОтображениеОбычнойГруппы.Нет;
			Группа_Заглушка_НоваяСтрока.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			Группа_Заглушка_НоваяСтрока.ОтображатьЗаголовок = Ложь;
			
		КонецЕсли;
		
		Группа_Заглушка_Выравнивания					 = ЭтаФорма.Элементы.Добавить("Группа_Заглушка_Выравнивания_" +  кИндекс + "_" + мИндекс, Тип("ГруппаФормы"), Группа_Заглушка_НоваяСтрока);
		Группа_Заглушка_Выравнивания.Вид				 = ВидГруппыФормы.ОбычнаяГруппа;
		Группа_Заглушка_Выравнивания.Отображение		 = ОтображениеОбычнойГруппы.Нет;
		Группа_Заглушка_Выравнивания.Группировка 		 = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		Группа_Заглушка_Выравнивания.ОтображатьЗаголовок = Ложь;
		
		Группа_Заглушка_Метка						 = ЭтаФорма.Элементы.Добавить("Группа_Заглушка_" +  кИндекс + "_" + мИндекс, Тип("ГруппаФормы"), Группа_Заглушка_Выравнивания);
		Группа_Заглушка_Метка.Вид					 = ВидГруппыФормы.ОбычнаяГруппа;
		Группа_Заглушка_Метка.Отображение			 = ОтображениеОбычнойГруппы.Нет;
		Группа_Заглушка_Метка.Группировка			 = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		Группа_Заглушка_Метка.ОтображатьЗаголовок	 = Ложь;
		Группа_Заглушка_Метка.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
		Группа_Заглушка_Метка.ЦветФона 				 = ?(ЗначениеЗаполнено(Метки[мИндекс].ЦветМетки),ЗначениеИзСтрокиВнутр(Метки[мИндекс].ЦветМетки),ЦветаСтиля.ЦветФонаФормы);
		
		НоваяМетка 			  = ЭтаФорма.Элементы.Добавить("Метка_" + кИндекс + "_" + мИндекс, Тип("ДекорацияФормы"), Группа_Заглушка_Метка);
		НоваяМетка.Вид		  = ВидДекорацииФормы.Надпись;
		НоваяМетка.Заголовок  = СокрЛП(Строка(Метки[мИндекс].Ссылка));
		НоваяМетка.ЦветРамки  = ?(ЗначениеЗаполнено(Метки[мИндекс].ЦветМетки),ЗначениеИзСтрокиВнутр(Метки[мИндекс].ЦветМетки),ЦветаСтиля.ЦветФонаФормы);
		НоваяМетка.ЦветТекста = ?(ЗначениеИзСтрокиВнутр(Метки[мИндекс].ЦветМетки)<>Новый Цвет(), Новый Цвет(255, 255, 255), Новый Цвет());
		
		ПолучитьНовуюСтроку = ПолучитьНовуюСтроку + 1;
		
		Если ПолучитьНовуюСтроку = 6 Тогда
			ПолучитьНовуюСтроку = 0;
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры
 
&НаСервере
// Процедура - Сформировать представление заявки
//
Процедура СформироватьПредставлениеЗаявки()
	
	Если ЗначениеЗаполнено(ЗаявкаОснование) И ТипЗнч(ЗаявкаОснование) = Тип("СправочникСсылка.Заявки") Тогда 
		Элементы.ОткрытьЗаявку.Видимость = Истина;
		Элементы.ОткрытьЗаявку.Заголовок = "Зарегистрировано: Обращение № " + ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(ЗаявкаОснование.Код, "") + " | Автор: " + СокрЛП(Строка(ЗаявкаОснование.Автор));
	Иначе 
		Элементы.ОткрытьЗаявку.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Отобразить заметки пользователей
//
Процедура ОтобразитьЗаметкиПользователей()
	
	Если НЕ СтруктураБлокировкиНомера = Неопределено Тогда
		Если ТипЗнч(СтруктураБлокировкиНомера) = Тип("Структура") И СтруктураБлокировкиНомера.Свойство("ПричинаБлокировки") И ЗначениеЗаполнено(СтруктураБлокировкиНомера.ПричинаБлокировки) Тогда 
			Если СтрНайти(ПараметрыТелефонногоЗвонка.Заметка, СтруктураБлокировкиНомера.ПричинаБлокировки) = 0 Тогда 
				Заметка = СтруктураБлокировкиНомера.ПричинаБлокировки + Символы.ПС + Символы.ПС + ПараметрыТелефонногоЗвонка.Заметка;
			Иначе 
				Заметка = ПараметрыТелефонногоЗвонка.Заметка;
			КонецЕсли;
		Иначе 
			Заметка = ПараметрыТелефонногоЗвонка.Заметка;
		КонецЕсли;	
	Иначе 
		Заметка = ПараметрыТелефонногоЗвонка.Заметка;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Удалить элементы группы
//
// Параметры:
//  Форма				 - 	 - 
//  РодительскаяГруппа	 - 	 - 
//
Процедура УдалитьЭлементыГруппы(РодительскаяГруппа)
	
	УдаляемыеЭлементы = Новый Массив;
	
	Для Каждого ГруппаЭлементов Из Элементы[РодительскаяГруппа.Имя].ПодчиненныеЭлементы Цикл
		УдаляемыеЭлементы.Добавить(ГруппаЭлементов);
	КонецЦикла;
	
	Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить структуру XDTO телефона
//
// Параметры:
//  Телефон	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтруктуру_XDTO(Представление, ТипКИ)
	
	Если НЕ ЗначениеЗаполнено(Представление) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Объект_XDTO = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOПоПредставлению(Представление, ТипКИ);
	Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда 
		Если НЕ ЗначениеЗаполнено(Объект_XDTO.Состав.Номер) Тогда 
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Объект_XDTO;
	
КонецФункции

&НаКлиенте
// Функция - Получить рабочий каталог
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьРабочийКаталог() Экспорт
	
	СсылкаПапки = ПредопределенноеЗначение("Справочник.ПапкиФайлов.ЗаписиТелефонныхРазговоров");
	Если ТипЗнч(СсылкаПапки) <> Тип("СправочникСсылка.ПапкиФайлов") Тогда
		Возврат ""
	КонецЕсли;
	
	РабочийКаталог = "";
	
	// Подготовить структуру отбора по измерениям
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Папка", СсылкаПапки);
	СтруктураОтбора.Вставить("Пользователь", ОбщегоНазначения.ТекущийПользователь());
	
	// Получить структуру с данными ресурсов записи
	// СтруктураРесурсов = РегистрыСведений.РабочиеКаталогиФайлов.Получить(СтруктураОтбора);
	
	// Получить путь из регистра
	// РабочийКаталог = СтруктураРесурсов.Путь;
    РабочийКаталог = КаталогВременныхФайлов();  
	Если НЕ ПустаяСтрока(РабочийКаталог) Тогда
		// Добавляем слэш в конце, если его нет
		Если Прав(РабочийКаталог,1) <> "\" Тогда
			РабочийКаталог = РабочийКаталог + "\";
		КонецЕсли;
	КонецЕсли;
	
	Возврат РабочийКаталог;
	
КонецФункции

&НаСервереБезКонтекста
// Процедура - Сохранить заметку пользователя
//
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  IDЗвонка		 - 	 - 
//  Текст			 - 	 - 
//
Процедура СохранитьЗаметкуПользователя(ПОIPТелефонии, IDЗвонка, Текст)
	
	НаборЗаписей = РегистрыСведений.ИсторияВызовов.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.ОборудованиеТелефонии.Значение 		= ПОIPТелефонии;
	НаборЗаписей.Отбор.ОборудованиеТелефонии.Использование 	= Истина;
	НаборЗаписей.Отбор.IDЗвонка.Значение 					= IDЗвонка;
	НаборЗаписей.Отбор.IDЗвонка.Использование 				= Истина;
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда 
		Запись 			= НаборЗаписей[0];
		Запись.Заметка 	= Текст;
		НачатьТранзакцию();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать(Истина);
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры	

&НаСервереБезКонтекста
// Функция - Вернуть рекламную площадку
//
// Параметры:
//  ПиктограммаЗвонка	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьРекламнуюПлощадку(Знач ПиктограммаЗвонка = 0)
	
	Если ПиктограммаЗвонка = 0 Тогда
		Возврат Справочники.КаналыПривлечения.ВходящийЗвонок;
	Иначе 
		Возврат Справочники.КаналыПривлечения.ИсходящийЗвонок;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
// Процедура - Фамилия, Имя при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ФамилияИмяПриИзменении(Элемент)

	ОбновитьДанныеПоСозданиюПациента();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда записать на прием
//
Процедура ЗаписатьНаПрием(Команда)
	
	Если СтруктураКлиента.СписокКонтрагентов.Количество() = 1 Тогда
		
		ДопПараметры = Новый Структура;
		ЗаписатьНаПриемЗавершение(СтруктураКлиента.СписокКонтрагентов[0].Значение.КонтрагентСсылка, ДопПараметры);
		
	Иначе
				
		Оповещение = Новый ОписаниеОповещения("ЗаписатьНаПриемЗавершение", ЭтотОбъект);
		ВыбратьПациентаИВыполнитьОповещение(Оповещение);
		
	КонецЕсли;    
	
КонецПроцедуры
 
&НаКлиенте
// Процедура - Команда записать на прием
//
Процедура ЗаписатьНаПриемЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ПараметрыФормы = Новый Структура;
		Если ТипЗнч(Результат) = Тип("СправочникСсылка.Контрагенты") Тогда
			ПараметрыФормы.Вставить("Контрагент"              , Результат); 
		Иначе
			ПараметрыФормы.Вставить("Контрагент"              , Результат.Значение);
		КонецЕсли;
		ПараметрыФормы.Вставить("ЗакрытьПриСозданииЗаписи"	, Истина);    
		ПараметрыФормы.Вставить("Заявка"					, ЗаявкаОснование);
		ПараметрыФормы.Вставить("Сделка"					, СделкаПоЗаявке);
		ПараметрыФормы.Вставить("ИсточникЗаписи"			, "Телефон");
		ПараметрыФормы.Вставить("IDЗвонка"					, IDЗвонка);
        ПараметрыФормы.Вставить("ВходящийНомерТелефона"		, ПреобразованныйНомерТелефона);

		//Если ПараметрыТелефонногоЗвонка.ПиктограммаЗвонка = 0 Тогда	
			ПараметрыФормы.Вставить("ВнутреннийНомерСотрудника"			, ПараметрыТелефонногоЗвонка.ВнутреннийНомерСотрудника);	
		//КонецЕсли;
	
		ИмяФормыПланировщика = ОбщегоНазначенияКлиент.ПолучитьИмяФормыПланировщика(ПараметрыФормы, "ФормаЗаписи");
		
		Форма = ПолучитьФорму(ИмяФормыПланировщика, ПараметрыФормы,, "ФормаПланировщикКлючУникальности");
		Форма.Открыть();
		Оповестить("СозданиеСобытияСКонтрагентом", ПараметрыФормы);
		
		ВызвытьОповещение = Истина;
		
	КонецЕсли;
	    
КонецПроцедуры

&НаКлиенте
// Процедура - Команда записать в лист ожидания.
//
Процедура ЗаписатьВЛистОжидания(Команда)
	
	Если СтруктураКлиента.СписокКонтрагентов.Количество() = 1 Тогда
		
		ДопПараметры = Новый Структура;
		ЗаписатьВЛистОжиданияЗавершение(СтруктураКлиента.СписокКонтрагентов[0].Значение.КонтрагентСсылка, ДопПараметры);
		
	Иначе
				
		Оповещение = Новый ОписаниеОповещения("ЗаписатьВЛистОжиданияЗавершение", ЭтотОбъект);
		ВыбратьПациентаИВыполнитьОповещение(Оповещение);
		
	КонецЕсли;	
			
КонецПроцедуры

&НаКлиенте
// Процедура - Показывает диалог выбора пациента и выполняет оповещение при выборе.
//
Процедура ВыбратьПациентаИВыполнитьОповещение(Оповещение)
	
	СписокПациентов = Новый СписокЗначений;
	Для Каждого Элемент Из СтруктураКлиента.СписокКонтрагентов Цикл
		СписокПациентов.Добавить(Элемент.Значение.КонтрагентСсылка,
		СтрШаблон("%1, %2 (%3)" , Элемент.Значение.Наименование, Формат(Элемент.Значение.ДатаРожденияКлиента, "ДФ=dd.MM.yyyy")
								, Элемент.Значение.ПредставлениеДатыРожденияСтрокой));
		 // ОбщегоНазначенияСтоматология.ВозвратитьВозрастСтрокой(Элемент.Значение.ДатаРожденияКлиента).
	КонецЦикла;
	
	ПоказатьВыборИзМеню(Оповещение, СписокПациентов, ЭтаФорма.ТекущийЭлемент);
	
КонецПроцедуры
 
&НаКлиенте
// Процедура - Обработчик оповещения "ЗаписатьВЛистОжидания".
//
Процедура ЗаписатьВЛистОжиданияЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ПараметрыФормы = Новый Структура;
		Если ТипЗнч(Результат) = Тип("СправочникСсылка.Контрагенты") Тогда
			ПараметрыФормы.Вставить("Контрагент"              , Результат); 
		Иначе
			ПараметрыФормы.Вставить("Контрагент"              , Результат.Значение);
		КонецЕсли; 
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеЗаписиВЛистОжидания", ЭтотОбъект);
		ОткрытьФорму("РегистрСведений.Профосмотры.Форма.ФормаЗаписиВЛистОжидания", ПараметрыФормы,,,,, ОповещениеОЗакрытии);

	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - после установки  задачи
//
Процедура ПослеЗаписиВЛистОжидания(Результат, ДопПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		
		ЗаполнитьРезультатЗвонка(ПредопределенноеЗначение("Перечисление.РезультатыОбработкиЗвонка.ЗаписанВЛистОжидания"));
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
// Процедура - Отображает сделки и заявки пациента
//
Процедура ОтобразитьСделкиИЗаписи()
	
	ТаблицаСделок.Очистить();
	ТаблицаЗаписей.Очистить();
	ТаблицаПолисов.Очистить();
	УдалитьДинамическиеЭлементы(Элементы.ГруппаПациенты);
	
	СтруктураКлиента = ПолучитьСтруктуруКлиентаПоНомеруТелефона(СписокВариантовНомераТелефона);
	
	Если ЗначениеЗаполнено(СтруктураКлиента.СписокКонтрагентов) Тогда
		
		ИндексПациента = 0;
		
		Для Каждого Пациент Из СтруктураКлиента.СписокКонтрагентов Цикл
			
			ЭлементГруппаПациент                     	= ЭтаФорма.Элементы.Добавить("ГруппаПациент_" + ИндексПациента, Тип("ГруппаФормы"), Элементы.ГруппаПациенты);
			ЭлементГруппаПациент.Вид                 	= ВидГруппыФормы.ОбычнаяГруппа;
			ЭлементГруппаПациент.Заголовок 				= ?(СтруктураКлиента.СписокКонтрагентов.Количество() = 1, "", Пациент.Значение.Наименование);
			ЭлементГруппаПациент.Отображение         	= ОтображениеОбычнойГруппы.Нет;
			ЭлементГруппаПациент.ЦветТекстаЗаголовка	= WebЦвета.Черный;
			ЭлементГруппаПациент.ШрифтЗаголовка			= Новый Шрифт("Arial", 12);
			ЭлементГруппаПациент.Группировка         	= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			ДоступныеСЕ = Справочники.Сотрудники.ПолучитьМестаРаботыСотрудника(ПараметрыСеанса.ТекущийСотрудник);
			ЗначТекСЕ = ДоступныеСЕ.НайтиПоЗначению(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
			НомерСтроки = ДоступныеСЕ.Индекс(ЗначТекСЕ) * (-1);
			ДоступныеСЕ.Сдвинуть(ЗначТекСЕ, НомерСтроки); 
			
			ИндексСЕ = 0;
			Для Каждого СтрЕдиница Из ДоступныеСЕ Цикл
				
				ОткрытыеСделкиПациента = Справочники.Сделки.ПолучитьСделкиПоКлиенту(Пациент.Значение.КонтрагентСсылка, СтрЕдиница.Значение, Ложь,,,,Истина,Истина,,Истина);
				ОткрытыеЗаписиПациента = Документы.Событие.СобытияЗаУказанныйПериод( НачалоДня(ТекущаяДатаСеанса()), Дата(3000,1,1),,СтрЕдиница.Значение, Пациент.Значение.КонтрагентСсылка);
				Если ЗначениеЗаполнено(ОткрытыеЗаписиПациента) Тогда
					ОткрытыеЗаписиПациента.Свернуть("Событие, ДатаНачала, Статус, ПолисМедСтрахования, Сотрудник");
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ОткрытыеСделкиПациента) Или ЗначениеЗаполнено(ОткрытыеЗаписиПациента) Тогда

					Если ИндексСЕ = 1 Тогда 
						
						ДекорацияФормы_Метка = Элементы.Добавить("ДекорацияСЕЗаголовок" + ИндексСЕ + "_" + ИндексПациента, Тип("ДекорацияФормы"), ЭлементГруппаПациент);
						ДекорацияФормы_Метка.Вид 				   = ВидДекорацииФормы.Надпись;
						ДекорацияФормы_Метка.Заголовок 			   = "Другие клиники:";
						ДекорацияФормы_Метка.АвтоМаксимальнаяШирина = Ложь;
						ДекорацияФормы_Метка.ЦветТекста             = WebЦвета.Черный;

					КонецЕсли;

					ЭлементГруппаСЕ                     	= ЭтаФорма.Элементы.Добавить("ГруппаСЕ_" + ИндексСЕ + "_" + ИндексПациента, Тип("ГруппаФормы"), ЭлементГруппаПациент);
					ЭлементГруппаСЕ.Вид                 	= ВидГруппыФормы.ОбычнаяГруппа;
					ЭлементГруппаСЕ.Заголовок 				= ?(ИндексСЕ = 0, "", СтрЕдиница.Представление);
					ЭлементГруппаСЕ.Отображение         	= ОтображениеОбычнойГруппы.Нет;
					ЭлементГруппаСЕ.ШрифтЗаголовка			= Новый Шрифт("Arial", 12);
					ЭлементГруппаСЕ.Группировка         	= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
					
					ЭлементГруппаПациентСделки                     	= ЭтаФорма.Элементы.Добавить("ГруппаПациентСделки_" + ИндексСЕ + "_" + ИндексПациента, Тип("ГруппаФормы"), ЭлементГруппаСЕ);
					ЭлементГруппаПациентСделки.Вид                 	= ВидГруппыФормы.ОбычнаяГруппа;
					ЭлементГруппаПациентСделки.Заголовок 			= "Открытые сделки";
					ЭлементГруппаПациентСделки.Отображение         	= ОтображениеОбычнойГруппы.Нет;
					ЭлементГруппаПациентСделки.Группировка         	= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
					
					ЭлементГруппаПациентЗаписи                     	= ЭтаФорма.Элементы.Добавить("ГруппаПациентЗаписи_" + ИндексСЕ + "_" + ИндексПациента, Тип("ГруппаФормы"), ЭлементГруппаСЕ);
					ЭлементГруппаПациентЗаписи.Вид                 	= ВидГруппыФормы.ОбычнаяГруппа;
					ЭлементГруппаПациентЗаписи.Заголовок 			= "Запланированные приемы";
					ЭлементГруппаПациентЗаписи.Отображение         	= ОтображениеОбычнойГруппы.Нет;
					ЭлементГруппаПациентЗаписи.Группировка         	= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
					
					Индекс = ТаблицаСделок.Количество();
					
					Для Каждого Элемент Из ОткрытыеСделкиПациента Цикл
						
						Если НЕ ЗначениеЗаполнено(Элемент.ЭтапСделки.ЦветЭтапа)
							ИЛИ ЗначениеИзСтрокиВнутр(Элемент.ЭтапСделки.ЦветЭтапа) = Новый Цвет() Тогда
							ЦветЭтапа 			= Новый Цвет(0,112,210);
						Иначе		
							ЦветЭтапа 			= ЗначениеИзСтрокиВнутр(Элемент.ЭтапСделки.ЦветЭтапа);
						КонецЕсли;
						ЦветТекстаЭтапа			= ПолучитьЦветТекстаПоФону(ЦветЭтапа);
						
						ЭлементГруппаСделки                     	= ЭтаФорма.Элементы.Добавить("ГруппаСделкаОбщая_" + Индекс, Тип("ГруппаФормы"), ЭлементГруппаПациентСделки);
						ЭлементГруппаСделки.Вид                 	= ВидГруппыФормы.ОбычнаяГруппа;
						ЭлементГруппаСделки.ОтображатьЗаголовок 	= Ложь;
						ЭлементГруппаСделки.Отображение         	= ОтображениеОбычнойГруппы.Нет;
						ЭлементГруппаСделки.Группировка         	= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
						ЭлементГруппаСделки.ГоризонтальныйИнтервал  = ИнтервалМеждуЭлементамиФормы.Нет;	
						
						
						ЭлементГруппа                     = ЭтаФорма.Элементы.Добавить("ГруппаСделка_" + Индекс, Тип("ГруппаФормы"), ЭлементГруппаСделки);
						ЭлементГруппа.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
						ЭлементГруппа.ОтображатьЗаголовок = Ложь;
						ЭлементГруппа.Отображение         = ОтображениеОбычнойГруппы.Нет;
						ЭлементГруппа.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;			
						ЭлементГруппа.ЦветФона            = WebЦвета.АкварельноСиний;
						ЭлементГруппа.Ширина			  = 22;   
						
						// Добавим кнопку контрагента
						НовыйЭлемент_Кнопка 					= Элементы.Добавить("Кнопка_ОткрытьСделку_" + Индекс, Тип("КнопкаФормы"), ЭлементГруппа);
						НовыйЭлемент_Кнопка.Заголовок 			= Элемент.Сделка.Врач.НаименованиеСокращенное + " " + Элемент.Сделка.НаименованиеСокращенное;
						НовыйЭлемент_Кнопка.ЦветТекста 			= ЦветТекстаЭтапа;
						НовыйЭлемент_Кнопка.Шрифт 				= Новый Шрифт("Arial", 11);
						НовыйЭлемент_Кнопка.ОтображениеФигуры 	= ОтображениеФигурыКнопки.Нет;
						
						// Добавим команду
						НоваяКоманда 							= Команды.Найти("Кнопка_ОткрытьСделку_" + Индекс);
						Если НоваяКоманда = Неопределено Тогда 
							НоваяКоманда 						= Команды.Добавить("Кнопка_ОткрытьСделку_" + Индекс);
							НоваяКоманда.Действие 				= "Подключаемый_ОткрытьСделку";				
						КонецЕсли;
						НовыйЭлемент_Кнопка.ИмяКоманды 			= НоваяКоманда.Имя;
						
						// ДекорацияФормы_Заглушка = Элементы.Добавить("Заглушка_" + Индекс, Тип("ДекорацияФормы"), ЭлементГруппа);
						// ДекорацияФормы_Заглушка.Вид 				   = ВидДекорацииФормы.Надпись;
						// ДекорацияФормы_Заглушка.АвтоМаксимальнаяШирина = Ложь;
						// ДекорацияФормы_Заглушка.МаксимальнаяШирина     = 2;
						// ДекорацияФормы_Заглушка.Ширина                 = 2;				
						
						ЭлементГруппаЭтап                     = ЭтаФорма.Элементы.Добавить("ГруппаСделкаЭтап_" + Индекс, Тип("ГруппаФормы"), ЭлементГруппаСделки);
						ЭлементГруппаЭтап.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
						ЭлементГруппаЭтап.ОтображатьЗаголовок = Ложь;
						ЭлементГруппаЭтап.Отображение         = ОтображениеОбычнойГруппы.Нет;
						// ЭлементГруппаЭтап.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
						ЭлементГруппаЭтап.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
						
						ЭлементГруппаЭтап.ЦветФона            = ЦветЭтапа;
						ЭлементГруппаЭтап.Ширина			  = 23; 
						
						// Добавим кнопку смена этапа
						НовыйЭлемент_Кнопка_Этап 					= Элементы.Добавить("Кнопка_СменитьЭтап_" + Индекс, Тип("КнопкаФормы"), ЭлементГруппаЭтап);
						НовыйЭлемент_Кнопка_Этап.Заголовок 			= Элемент.ЭтапСделки.Наименование;
						НовыйЭлемент_Кнопка_Этап.ЦветТекста 		= ЦветТекстаЭтапа;
						НовыйЭлемент_Кнопка_Этап.Шрифт 				= Новый Шрифт("Arial", 11);
						НовыйЭлемент_Кнопка_Этап.ОтображениеФигуры 	= ОтображениеФигурыКнопки.Нет;
						
						// Добавим команду
						НоваяКоманда_Этап 							= Команды.Найти("Кнопка_СменитьЭтап_" + Индекс);
						Если НоваяКоманда_Этап = Неопределено Тогда 
							НоваяКоманда_Этап 						= Команды.Добавить("Кнопка_СменитьЭтап_" + Индекс);
							НоваяКоманда_Этап.Действие 				= "Подключаемый_СменитьЭтап";				
						КонецЕсли;
						НовыйЭлемент_Кнопка_Этап.ИмяКоманды 		= НоваяКоманда_Этап.Имя;
						
						СсылкаНаСделку = ТаблицаСделок.Добавить();
						СсылкаНаСделку.Сделка = Элемент.Сделка;
						
						Индекс = Индекс + 1;
						
					КонецЦикла;
					
					Индекс = ТаблицаЗаписей.Количество();
					
					Для Каждого Элемент Из ОткрытыеЗаписиПациента Цикл
						
						Если Элемент.Статус <> Перечисления.СтатусыСобытия.ПриемОкончен И Элемент.Статус <> Перечисления.СтатусыСобытия.ПриемОтменен Тогда
							
							ЭлементГруппа                      		= ЭтаФорма.Элементы.Добавить("ГруппаПрием_" + Индекс, Тип("ГруппаФормы"), ЭлементГруппаПациентЗаписи);
							ЭлементГруппа.Вид                  		= ВидГруппыФормы.ОбычнаяГруппа;
							ЭлементГруппа.ОтображатьЗаголовок  		= Ложь;
							ЭлементГруппа.Отображение          		= ОтображениеОбычнойГруппы.Нет;
							ЭлементГруппа.Группировка          		= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;			
							ЭлементГруппа.ВертикальныйИнтервал 		= ИнтервалМеждуЭлементамиФормы.Нет;
							
							ЭлементПодГруппа                      	= ЭтаФорма.Элементы.Добавить("ПодГруппаПрием_" + Индекс, Тип("ГруппаФормы"), ЭлементГруппа);
							ЭлементПодГруппа.Вид                  	= ВидГруппыФормы.ОбычнаяГруппа;
							ЭлементПодГруппа.ОтображатьЗаголовок  	= Ложь;
							ЭлементПодГруппа.Отображение          	= ОтображениеОбычнойГруппы.Нет;
							ЭлементПодГруппа.Группировка          	= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;			
							ЭлементПодГруппа.ВертикальныйИнтервал 	= ИнтервалМеждуЭлементамиФормы.Нет;
							ЭлементПодГруппа.ЦветФона          		= WebЦвета.АкварельноСиний;
							ЭлементПодГруппа.Ширина			 		= 44;
							
							ЭлементГруппаПрием                     	= ЭтаФорма.Элементы.Добавить("ГруппаПриемДата_" + Индекс, Тип("ГруппаФормы"), ЭлементПодГруппа);
							ЭлементГруппаПрием.Вид                 	= ВидГруппыФормы.ОбычнаяГруппа;
							ЭлементГруппаПрием.ОтображатьЗаголовок 	= Ложь;
							ЭлементГруппаПрием.Отображение         	= ОтображениеОбычнойГруппы.Нет;
							ЭлементГруппаПрием.Группировка         	= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;			
							ЭлементГруппаПрием.Ширина		 		= 44;
							
							// Добавим кнопку контрагента
							НовыйЭлемент_Кнопка 					= Элементы.Добавить("Кнопка_ОткрытьЗапись_" + Индекс, Тип("КнопкаФормы"), ЭлементГруппаПрием);
							НовыйЭлемент_Кнопка.Заголовок 			= Формат(Элемент.ДатаНачала, "ДФ=""дд ММММ ЧЧ:мм""") + ", " + Элемент.Сотрудник.НаименованиеСокращенное;
							НовыйЭлемент_Кнопка.ЦветТекста 			= Новый Цвет(51, 51, 51);
							НовыйЭлемент_Кнопка.Шрифт 				= Новый Шрифт("Arial", 11);
							НовыйЭлемент_Кнопка.ОтображениеФигуры 	= ОтображениеФигурыКнопки.Нет;
							
							// Добавим команду
							НоваяКоманда 							= Команды.Найти("Кнопка_ОткрытьЗапись_" + Индекс);
							Если НоваяКоманда = Неопределено Тогда 
								НоваяКоманда 						= Команды.Добавить("Кнопка_ОткрытьЗапись_" + Индекс);
								НоваяКоманда.Действие 				= "Подключаемый_ОткрытьЗапись";				
							КонецЕсли;
							НовыйЭлемент_Кнопка.ИмяКоманды 			= НоваяКоманда.Имя;
							
							// Создаем заглушку = номер этапа.
							// ДекорацияФормы_Заглушка = Элементы.Добавить("Заглушка_" + Индекс, Тип("ДекорацияФормы"), ЭлементГруппаПрием);
							// ДекорацияФормы_Заглушка.Вид 				   = ВидДекорацииФормы.Надпись;
							// ДекорацияФормы_Заглушка.АвтоМаксимальнаяШирина = Ложь;
							// ДекорацияФормы_Заглушка.МаксимальнаяШирина     = 2;
							// ДекорацияФормы_Заглушка.Ширина                 = 2;				
							
							// Создаем декорацию статус приема.
							ЭлементГруппаСтатус                      	= ЭтаФорма.Элементы.Добавить("ГруппаСтатус_" + Индекс, Тип("ГруппаФормы"), ЭлементГруппаПрием);
							ЭлементГруппаСтатус.Вид                  	= ВидГруппыФормы.ОбычнаяГруппа;
							ЭлементГруппаСтатус.ОтображатьЗаголовок  	= Ложь;
							ЭлементГруппаСтатус.Отображение          	= ОтображениеОбычнойГруппы.Нет;
							ЭлементГруппаСтатус.ЦветФона          		= ?(Элемент.Статус = Перечисления.СтатусыСобытия.Подтверждена, Новый Цвет(25, 112, 206), WebЦвета.АкварельноСиний);
							ЭлементГруппаСтатус.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
							
							ДекорацияФормы_СтатусПриема = Элементы.Добавить("ДекорацияСтатусПриема_" + Индекс, Тип("ДекорацияФормы"), ЭлементГруппаСтатус);
							ДекорацияФормы_СтатусПриема.Вид 				   = ВидДекорацииФормы.Надпись;
							ДекорацияФормы_СтатусПриема.Заголовок 			   = Элемент.Статус;
							ДекорацияФормы_СтатусПриема.АвтоМаксимальнаяШирина = Ложь;
							ДекорацияФормы_СтатусПриема.ЦветТекста             = ?(Элемент.Статус = Перечисления.СтатусыСобытия.Подтверждена, Новый Цвет(255, 255, 255),Новый Цвет (77, 77 ,77));
							
							
							//// Добавим кнопку контрагента
							// НовыйЭлемент_КнопкаСотрудник 					= Элементы.Добавить("Кнопка_ОткрытьСотрудника_" + Индекс, Тип("КнопкаФормы"), ЭлементГруппа);
							// НовыйЭлемент_КнопкаСотрудник.Заголовок 			= "Врач: " + Элемент.Сотрудник.НаименованиеСокращенное;
							// НовыйЭлемент_КнопкаСотрудник.ЦветТекста 		= Новый Цвет(51, 51, 51);
							// НовыйЭлемент_КнопкаСотрудник.Шрифт 				= Новый Шрифт("Arial", 11);
							// НовыйЭлемент_КнопкаСотрудник.ОтображениеФигуры 	= ОтображениеФигурыКнопки.Нет;
							//
							//// Добавим команду
							// НоваяКоманда 							= Команды.Найти("Кнопка_ОткрытьЗапись_" + Индекс);
							// Если НоваяКоманда = Неопределено Тогда 
							//	НоваяКоманда 						= Команды.Добавить("Кнопка_ОткрытьЗапись_" + Индекс);
							//	НоваяКоманда.Действие 				= "Подключаемый_ОткрытьЗапись";				
							// КонецЕсли;
							// НовыйЭлемент_КнопкаСотрудник.ИмяКоманды 		= НоваяКоманда.Имя;
							
							
							МеткиПациента = РегистрыСведений.МеткиКлиентов.ПолучитьАктивныеМеткиЗаписи(Элемент.Событие);
							// МассивПолисовДействующие = Справочники.ПолисыМедицинскогоСтрахования.ПолучитьАктивныеПолисыКонтрагента(СтруктураКлиента.СписокКонтрагентов[0].Значение.КонтрагентСсылка, Элемент.ДатаНачала,,Ложь); 
							
							ЭлементГруппаМетки                     = ЭтаФорма.Элементы.Добавить("ГруппаМетки_" + Индекс, Тип("ГруппаФормы"), ЭлементПодГруппа);
							ЭлементГруппаМетки.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
							ЭлементГруппаМетки.ОтображатьЗаголовок = Ложь;
							ЭлементГруппаМетки.Отображение         = ОтображениеОбычнойГруппы.Нет;
							ЭлементГруппаМетки.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;	 
							
							Если ЗначениеЗаполнено(Элемент.ПолисМедСтрахования) Тогда 
								ПолисДействующий = Элемент.ПолисМедСтрахования;
								
								ЭлементГруппаМеткиПолис                     	= ЭтаФорма.Элементы.Добавить("ГруппаМеткиПолис_" + Индекс, Тип("ГруппаФормы"), ЭлементГруппаМетки);
								ЭлементГруппаМеткиПолис.Вид                 	= ВидГруппыФормы.ОбычнаяГруппа;
								ЭлементГруппаМеткиПолис.ОтображатьЗаголовок 	= Ложь;
								ЭлементГруппаМеткиПолис.Отображение         	= ОтображениеОбычнойГруппы.Нет;
								ЭлементГруппаМеткиПолис.Группировка         	= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;	
								ЭлементГруппаМеткиПолис.ГоризонтальныйИнтервал  = ИнтервалМеждуЭлементамиФормы.Нет;
								
								Если ЗначениеЗаполнено(ПолисДействующий.СтраховаяКомпания.КраткоеНаименование) Тогда
									ФонМетки = ?(ЗначениеЗаполнено(ПолисДействующий.СтраховаяКомпания.ЦветФонаМетки), ЗначениеИзСтрокиВнутр(ПолисДействующий.СтраховаяКомпания.ЦветФонаМетки), WebЦвета.СеребристоСерый); 
									
									ЭлементГруппаМетка                      	= ЭтаФорма.Элементы.Добавить("ГруппаМеткаСК_" + Индекс, Тип("ГруппаФормы"), ЭлементГруппаМеткиПолис);
									ЭлементГруппаМетка.Вид                  	= ВидГруппыФормы.ОбычнаяГруппа;
									ЭлементГруппаМетка.ОтображатьЗаголовок  	= Ложь;
									ЭлементГруппаМетка.Отображение          	= ОтображениеОбычнойГруппы.Нет;
									ЭлементГруппаМетка.ЦветФона          		= ФонМетки;
									
									ДекорацияФормы_Метка = Элементы.Добавить("ДекорацияМеткаСК_" + Индекс, Тип("ДекорацияФормы"), ЭлементГруппаМетка);
									ДекорацияФормы_Метка.Вид 				   = ВидДекорацииФормы.Надпись;
									ДекорацияФормы_Метка.Заголовок 			   = ПолисДействующий.СтраховаяКомпания.КраткоеНаименование;
									ДекорацияФормы_Метка.АвтоМаксимальнаяШирина = Ложь;
									ДекорацияФормы_Метка.ЦветТекста             = ?(ПолисДействующий.СтраховаяКомпания.ЦветТекстаБелый, Новый Цвет(255,255,255), Новый Цвет(77,77,77));
								КонецЕсли;
								
								Если ЗначениеЗаполнено(ПолисДействующий.Договор) 
									И ЗначениеЗаполнено(ПолисДействующий.Договор.ПрограммаСтрахования) Тогда
									
									ДанныеПрограммыСтрахования = Справочники.ПрограммыСтрахования.ПолучитьТекстЦветФонаИТекста(ПолисДействующий.Договор.ПрограммаСтрахования); 
									
									ЭлементГруппаМетка                      	= ЭтаФорма.Элементы.Добавить("ГруппаМеткаДоговор_" + Индекс, Тип("ГруппаФормы"), ЭлементГруппаМеткиПолис);
									ЭлементГруппаМетка.Вид                  	= ВидГруппыФормы.ОбычнаяГруппа;
									ЭлементГруппаМетка.ОтображатьЗаголовок  	= Ложь;
									ЭлементГруппаМетка.Отображение          	= ОтображениеОбычнойГруппы.Нет;
									ЭлементГруппаМетка.ЦветФона          		= ДанныеПрограммыСтрахования.ЦветФона;
									
									ДекорацияФормы_Метка = Элементы.Добавить("ДекорацияМеткаДоговор_" + Индекс, Тип("ДекорацияФормы"), ЭлементГруппаМетка);
									ДекорацияФормы_Метка.Вид 				   	= ВидДекорацииФормы.Надпись;
									ДекорацияФормы_Метка.Заголовок 			   	= ДанныеПрограммыСтрахования.Текст;
									ДекорацияФормы_Метка.АвтоМаксимальнаяШирина = Ложь;
									ДекорацияФормы_Метка.ЦветТекста             = ДанныеПрограммыСтрахования.ЦветТекста;
									
								КонецЕсли;  
								
							КонецЕсли;
							
							Если МеткиПациента.Количество() > 0 Тогда
								
								ИндексМетки = 0;
								
								// Размещаем элементы меток
								Для ИндексМетки = 0 По МеткиПациента.Количество()-1 Цикл
									
									ЭлементГруппаМеткаПациента                      	= ЭтаФорма.Элементы.Добавить("ГруппаМеткаПациента_" + Индекс + ИндексМетки, Тип("ГруппаФормы"), ЭлементГруппаМетки);
									ЭлементГруппаМеткаПациента.Вид                  	= ВидГруппыФормы.ОбычнаяГруппа;
									ЭлементГруппаМеткаПациента.ОтображатьЗаголовок  	= Ложь;
									ЭлементГруппаМеткаПациента.Отображение          	= ОтображениеОбычнойГруппы.Нет;
									ЭлементГруппаМеткаПациента.ЦветФона          		= ЗначениеИзСтрокиВнутр(МеткиПациента[ИндексМетки].ЦветМетки);
									
									// Создаем декорацию метки.
									ДекорацияФормы_Метка = Элементы.Добавить("ДекорацияМетка_" + Индекс + ИндексМетки, Тип("ДекорацияФормы"), ЭлементГруппаМеткаПациента);
									ДекорацияФормы_Метка.Вид 				   = ВидДекорацииФормы.Надпись;
									ДекорацияФормы_Метка.Заголовок 			   = МеткиПациента[ИндексМетки].Наименование;
									ДекорацияФормы_Метка.АвтоМаксимальнаяШирина = Ложь;
									ДекорацияФормы_Метка.ЦветТекста             = ?(МеткиПациента[ИндексМетки].ЦветТекстаБелый, Новый Цвет(255, 255, 255),Новый Цвет (77, 77 ,77));
									
								КонецЦикла;
								
							КонецЕсли;
							
							// Создаем заглушку.
							ДекорацияФормы_ЗаглушкаЕще = Элементы.Добавить("ЗаглушкаЕще_" + Индекс, Тип("ДекорацияФормы"), ЭлементПодГруппа);
							ДекорацияФормы_ЗаглушкаЕще.Вид					= ВидДекорацииФормы.Надпись;
							ДекорацияФормы_ЗаглушкаЕще.Шрифт				= Новый Шрифт("Arial", 2);
							
							////////////////////// Перенести Отменить ////////////////////////////////
							ЭлементГруппаПеренестиОтменить                     = ЭтаФорма.Элементы.Добавить("ГруппаПеренестиОтменить_" + Индекс, Тип("ГруппаФормы"), ЭлементГруппа);
							ЭлементГруппаПеренестиОтменить.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
							ЭлементГруппаПеренестиОтменить.ОтображатьЗаголовок = Ложь;
							ЭлементГруппаПеренестиОтменить.Отображение         = ОтображениеОбычнойГруппы.Нет;
							ЭлементГруппаПеренестиОтменить.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;			
							ЭлементГруппаПеренестиОтменить.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Право; 
							ЭлементГруппаПеренестиОтменить.Ширина              = 44;
							
							// Добавим декорацию перенести прием
							ДекорацияФормы_ПеренестиПрием 					= Элементы.Добавить("Декорация_ПеренестиПрием_" + Индекс, Тип("ДекорацияФормы"), ЭлементГруппаПеренестиОтменить);
							ДекорацияФормы_ПеренестиПрием.Вид 				= ВидДекорацииФормы.Надпись;
							ДекорацияФормы_ПеренестиПрием.Заголовок 		= "Перенести"; 
							ДекорацияФормы_ПеренестиПрием.Гиперссылка 		= Истина;
							ДекорацияФормы_ПеренестиПрием.ЦветТекста 		= ЦветаСтиля.ЦветАкцента; 
							ДекорацияФормы_ПеренестиПрием.Шрифт 			= Новый Шрифт("Arial", 11);
							ДекорацияФормы_ПеренестиПрием.УстановитьДействие("Нажатие", "Подключаемый_ДекорацияФормы_ПеренестиПрием_Нажатие");
							
							// Создаем заглушку.
							ДекорацияФормы_ЗаглушкаВторая = Элементы.Добавить("ЗаглушкаВторая_" + Индекс, Тип("ДекорацияФормы"), ЭлементГруппаПеренестиОтменить);
							ДекорацияФормы_ЗаглушкаВторая.Вид 				   = ВидДекорацииФормы.Надпись;
							ДекорацияФормы_ЗаглушкаВторая.АвтоМаксимальнаяШирина = Ложь;
							ДекорацияФормы_ЗаглушкаВторая.МаксимальнаяШирина     = 2;
							ДекорацияФормы_ЗаглушкаВторая.Ширина                 = 2;	
							
							// Добавим декорацию перенести прием
							ДекорацияФормы_ПеренестиПрием 					= Элементы.Добавить("Декорация_ОтменитьПрием_" + Индекс, Тип("ДекорацияФормы"), ЭлементГруппаПеренестиОтменить);
							ДекорацияФормы_ПеренестиПрием.Вид 				= ВидДекорацииФормы.Надпись;
							ДекорацияФормы_ПеренестиПрием.Заголовок 		= "Отменить"; 
							ДекорацияФормы_ПеренестиПрием.Гиперссылка 		= Истина;
							ДекорацияФормы_ПеренестиПрием.ЦветТекста 		= ЦветаСтиля.ЦветОсобогоТекста; 
							ДекорацияФормы_ПеренестиПрием.Шрифт 			= Новый Шрифт("Arial", 11);
							ДекорацияФормы_ПеренестиПрием.УстановитьДействие("Нажатие", "Подключаемый_ДекорацияФормы_ОтменитьПрием_Нажатие");
							
							СсылкаНаЗапись = ТаблицаЗаписей.Добавить();
							СсылкаНаЗапись.Запись = Элемент.Событие;
							
							Индекс = Индекс + 1;
						КонецЕсли;               
						
					КонецЦикла;
				ИначеЕсли ИндексСЕ > 0 Тогда
					ИндексСЕ = ИндексСЕ - 1;
				КонецЕсли;
				ИндексСЕ = ИндексСЕ + 1;
			КонецЦикла;			
			ИндексПациента = ИндексПациента + 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый отменить прием
//
// Параметры:
//  Элемент	 - 	 - 
// 
Процедура Подключаемый_ДекорацияФормы_ПеренестиПрием_Нажатие(Элемент)

	Индекс 		  = Число(СтрЗаменить(Элемент.Имя, "Декорация_ПеренестиПрием_", ""));	
	СтрокаТаблицы = ЭтаФорма.ТаблицаЗаписей[Индекс];

	БуферОбмена = Новый Структура;
	БуферОбмена.Вставить("ПризнакВырезать", Истина);
	БуферОбмена.Вставить("Буфер", Новый Структура("Событие", СтрокаТаблицы.Запись));

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент"              ,ПациентПоПриему(СтрокаТаблицы.Запись));
	ПараметрыФормы.Вставить("ЗакрытьПриСозданииЗаписи",Истина);    
	ПараметрыФормы.Вставить("БуферОбмена", БуферОбмена); 

	ОписаниеОповещения = Новый ОписаниеОповещения("ПеренестиПриемЗавершение", ЭтаФорма);
	//ИмяФормыПланировщика = ОбщегоНазначенияКлиент.ПолучитьИмяФормыПланировщика(ПараметрыФормы, "ФормаПредварительнойЗаписи");
	//ОткрытьФорму(ИмяФормыПланировщика, ПараметрыФормы,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	ИмяФормыПланировщика = ОбщегоНазначенияКлиент.ПолучитьИмяФормыПланировщика(ПараметрыФормы, "ФормаЗаписи");
	Форма = ПолучитьФорму(ИмяФормыПланировщика, ПараметрыФормы,, "ФормаПланировщикКлючУникальности");
	Форма.Открыть();                            
	Оповестить("ПереносПриема", ПараметрыФормы);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция возвращает значение пациента из приема
//
Функция ПациентПоПриему(Прием)
	
	Возврат ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Прием, "Контрагент");
	
КонецФункции

&НаСервере
// Процедура - Отменить прием завершение
//
Процедура ПеренестиПриемЗавершение(Результат, ДопПараметры) Экспорт
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый отменить прием
//
// Параметры:
//  Элемент	 - 	 - 
// 
Процедура Подключаемый_ДекорацияФормы_ОтменитьПрием_Нажатие(Элемент)

	Индекс 		  = Число(СтрЗаменить(Элемент.Имя, "Декорация_ОтменитьПрием_", ""));	
	СтрокаТаблицы = ЭтаФорма.ТаблицаЗаписей[Индекс];
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Событие", СтрокаТаблицы.Запись);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтменитьПриемЗавершение", ЭтаФорма, ДополнительныеПараметры);
 	ОткрытьФорму("Справочник.ПричиныОтменыЗаписи.ФормаВыбора",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
// Процедура - Отменить прием завершение
//
Процедура ОтменитьПриемЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		СобытиеОбъект = ДопПараметры.Событие.ПолучитьОбъект();
		СобытиеОбъект.ПричинаОтмены = Результат;
		СобытиеОбъект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыСобытия.ПриемОтменен");
		СобытиеОбъект.Записать(); 
		УстановитьВидимостьЭлементовФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый открыть сделку
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Подключаемый_ОткрытьСделку(Команда) Экспорт

	Индекс 		  = Число(СтрЗаменить(Команда.Имя, "Кнопка_ОткрытьСделку_", ""));	
    СтрокаТаблицы = ЭтаФорма.ТаблицаСделок[Индекс];
	ПоказатьЗначение(,СтрокаТаблицы.Сделка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый открыть полис
//
Процедура Подключаемый_ДекорацияФормы_ОткрытьПолис_Нажатие(Элемент) Экспорт

	Индекс 		  = Число(СтрЗаменить(Элемент.Имя, "Декорация_ОткрытьПолис_", ""));	
    СтрокаТаблицы = ЭтаФорма.ТаблицаПолисов[Индекс];
	ПоказатьЗначение(,СтрокаТаблицы.Полис);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый сменить этап
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Подключаемый_СменитьЭтап(Команда) Экспорт
	
	Индекс 		  = Число(СтрЗаменить(Команда.Имя, "Кнопка_СменитьЭтап_", ""));	
	СтрокаТаблицы = ЭтаФорма.ТаблицаСделок[Индекс];
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент"	, ПациентПоПриему(СтрокаТаблицы.Сделка));
	ПараметрыФормы.Вставить("ВыбратьЭтап"	, Истина);
	ПараметрыФормы.Вставить("Сделка", СтрокаТаблицы.Сделка);
	
	ОткрытьФорму("Справочник.Сделки.Форма.ФормаВиджета", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый открыть Запись
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Подключаемый_ОткрытьЗапись(Команда) Экспорт

	Индекс 		  = Число(СтрЗаменить(Команда.Имя, "Кнопка_ОткрытьЗапись_", ""));	
    СтрокаТаблицы = ЭтаФорма.ТаблицаЗаписей[Индекс];
	ПоказатьЗначение(,СтрокаТаблицы.Запись);
	
КонецПроцедуры

&НаСервере
// Процедура - удаляет динамические элементы.
//
Процедура УдалитьДинамическиеЭлементы(ГруппаСделки)
	
	МассивУдаляемых = Новый Массив;
	
	Для Каждого ЭлементГруппы Из ГруппаСделки.ПодчиненныеЭлементы Цикл
		МассивУдаляемых.Добавить(ЭлементГруппы);                   
	КонецЦикла;
	
	Для Каждого ЭлементФормы Из МассивУдаляемых Цикл
		Элементы.Удалить(ЭлементФормы);  
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура - создает, обновляет заявку.
//
Процедура СоздатьОбновитьЗаявку()
	
	//ЗаявкаОснование = Справочники.Заявки.ПолучитьЗаявкуПоНомеруТелефона(НомерТелефонаКлиента);
	
	// Если Не ЗначениеЗаполнено(ЗаявкаОснование) Тогда
	//	Если ЗначениеЗаполнено(СтруктураКлиента.СписокКонтрагентов) Тогда
	//		Пациент = СтруктураКлиента.СписокКонтрагентов[0].Значение.КонтрагентСсылка;
	//	Иначе
	//		Пациент = Справочники.Контрагенты.ПустаяСсылка();
	//	КонецЕсли;
	//	
	//	ЗаявкаОснование = Справочники.Заявки.СоздатьВходящуюЗаявку(,,,,,,НомерТелефонаКлиента,,,,,,,,,Пациент,ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	//	
	// КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураКлиента.СписокКонтрагентов) Тогда
		Пациент = СтруктураКлиента.СписокКонтрагентов[0].Значение.КонтрагентСсылка;
	Иначе
		Пациент = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ИсторияВызовов.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.ОборудованиеТелефонии.Значение 		= ПОIPТелефонии;
	НаборЗаписей.Отбор.ОборудованиеТелефонии.Использование 	= Истина;
	НаборЗаписей.Отбор.IDЗвонка.Значение 					= IDЗвонка;
	НаборЗаписей.Отбор.IDЗвонка.Использование 				= Истина;
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда 
		Запись 			= НаборЗаписей[0];
		Если Не ЗначениеЗаполнено(Запись.Контрагент) Тогда
			Запись.Контрагент 	= Пациент;                    
		КонецЕсли;
		ЗаявкаОснование = Запись.Заявка; //   = ЗаявкаОснование;
		НачатьТранзакцию();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать(Истина);
		ЗафиксироватьТранзакцию();  
		Сотрудник = Запись.Пользователь;
	КонецЕсли;

	// Если ЗаявкаОснование.Статус <> Перечисления.СтатусыЗаявок.Принята И ЗаявкаОснование.Статус <> Перечисления.СтатусыЗаявок.Отклонена Тогда
	//	// Добавим кнопку контрагента
	//	НовыйЭлемент_Кнопка 					= Элементы.Добавить("Кнопка_ОткрытьЗаявку_0", Тип("КнопкаФормы"), Элементы.ГруппаЗаявки);
	//	НовыйЭлемент_Кнопка.Заголовок 			= ?(ЗначениеЗаполнено(ЗаявкаОснование.Наименование),ЗаявкаОснование.Наименование,ЗаявкаОснование.НомерТелефона);
	//	НовыйЭлемент_Кнопка.ЦветТекста 			= Новый Цвет(51, 51, 51);
	//	НовыйЭлемент_Кнопка.Шрифт 				= Новый Шрифт("Arial", 12);
	//	НовыйЭлемент_Кнопка.ОтображениеФигуры 	= ОтображениеФигурыКнопки.Нет;
	//	
	//	// Добавим команду
	//	НоваяКоманда 							= Команды.Найти("Кнопка_ОткрытьЗаявку_0");
	//	Если НоваяКоманда = Неопределено Тогда 
	//		НоваяКоманда 						= Команды.Добавить("Кнопка_ОткрытьЗаявку_0");
	//		НоваяКоманда.Действие 				= "Подключаемый_ОткрытьЗаявкуНов";				
	//	КонецЕсли;
	//	НовыйЭлемент_Кнопка.ИмяКоманды 			= НоваяКоманда.Имя;
	//	
	// КонецЕсли;
	
	СсылкаНаЗаявку = ТаблицаЗаявок.Добавить();
	СсылкаНаЗаявку.Заявка = ЗаявкаОснование;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый открыть заявку
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Подключаемый_ОткрытьЗаявкуНов(Команда) Экспорт

	Индекс 		  = Число(СтрЗаменить(Команда.Имя, "Кнопка_ОткрытьЗаявку_", ""));	
    СтрокаТаблицы = ЭтаФорма.ТаблицаЗаявок[Индекс];
	ПоказатьЗначение(,СтрокаТаблицы.Заявка);
	
КонецПроцедуры

&НаСервере
// Процедура - отображает заявки пациента
//
Процедура ОтобразитьЗаявки()
	
	Заявки = Справочники.Заявки.ПолучитьМассивАктуальныхЗаявокКонтрагента(,СтруктураКлиента.СписокКонтрагентов[0].Значение.КонтрагентСсылка);
	
	Если Не ЗначениеЗаполнено(Заявки) Тогда
		СоздатьОбновитьЗаявку();
	Иначе	
		Индекс = 0;
		Для Каждого Элемент Из Заявки Цикл
			// НовыйЭлемент_Кнопка 					= Элементы.Добавить("Кнопка_ОткрытьЗаявку_" + Индекс, Тип("КнопкаФормы"), Элементы.ГруппаЗаявки);
			// НовыйЭлемент_Кнопка.Заголовок 			= ?(ЗначениеЗаполнено(Элемент.Наименование),Элемент.Наименование,Элемент.НомерТелефона);
			// НовыйЭлемент_Кнопка.ЦветТекста 			= Новый Цвет(51, 51, 51);
			// НовыйЭлемент_Кнопка.Шрифт 				= Новый Шрифт("Arial", 12);
			// НовыйЭлемент_Кнопка.ОтображениеФигуры 	= ОтображениеФигурыКнопки.Нет;
			//
			//// Добавим команду
			// НоваяКоманда 							= Команды.Найти("Кнопка_ОткрытьЗаявку_" + Индекс);
			// Если НоваяКоманда = Неопределено Тогда 
			//	НоваяКоманда 						= Команды.Добавить("Кнопка_ОткрытьЗаявку_" + Индекс);
			//	НоваяКоманда.Действие 				= "Подключаемый_ОткрытьЗаявкуНов";				
			// КонецЕсли;
			// НовыйЭлемент_Кнопка.ИмяКоманды 			= НоваяКоманда.Имя;
			
			СсылкаНаЗаявку = ТаблицаЗаявок.Добавить();
			СсылкаНаЗаявку.Заявка = Элемент; 
			Если Индекс = 0 Тогда
				ЗаявкаОснование = Элемент;
			КонецЕсли;
			Индекс = Индекс + 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - команда Некачественная заявка
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура НекачественнаяЗаявка(Команда)
	
	ВызвытьОповещение = Истина;	
	Если ТипЗнч(ЗаявкаОснование) = Тип("СправочникСсылка.Заявки") Тогда
		ОткрытьФорму("Справочник.ОценкиКачестваЗаявок.ФормаВыбора",,,,,, Новый ОписаниеОповещения("ОценкаЗаявкиВыборЗавершение", ЭтотОбъект));
	ИначеЕсли ТипЗнч(ЗаявкаОснование) = Тип("СправочникСсылка.Сделки") Тогда
		ОтменитьСделку(); 
		ЗаполнитьРезультатЗвонка(ПредопределенноеЗначение("Перечисление.РезультатыОбработкиЗвонка.ЗаписатьНеУдалось"));
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Оценка заявки завершение
//
Процедура ОценкаЗаявкиВыборЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		
		ЗаполнитьРезультатЗаявки(Результат);
		// Для закрытия окна звонка
		ОткрытаИзСписка = Истина; 
		ЗаполнитьРезультатЗвонка(ПредопределенноеЗначение("Перечисление.РезультатыОбработкиЗвонка.ЗаписатьНеУдалось"));
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРезультатЗаявки(Оценка)
	
	ЗаявкаОснование = Справочники.Заявки.ПолучитьЗаявкуПоНомеруТелефона(НомерТелефонаКлиента);
	
	ЗаявкаОбъект = ЗаявкаОснование.ПолучитьОбъект();
	ЗаявкаОбъект.ОценкаЗаявки = Оценка;
	ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявок.Отклонена;
	ЗаявкаОбъект.Записать(); 
	
КонецПроцедуры

&НаКлиенте
// Процедура - Создать пациента и записать на прием
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СоздатьИЗаписатьПациента(Команда)
	
	Если ЗначениеЗаполнено(Фамилия) Или ЗначениеЗаполнено(Имя) Тогда
		ОбновитьЗаявкуИСделку(Ложь);                                    
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	Если ЗначениеЗаполнено(СтруктураКлиента.СписокКонтрагентов) Тогда
		ПараметрыОткрытия.Вставить("Контрагент"              	, СтруктураКлиента.СписокКонтрагентов[0].Значение.КонтрагентСсылка);
	Иначе
		ПараметрыОткрытия.Вставить("ЗаявкаОснование"            , ЗаявкаОснование);
	КонецЕсли;
	ПараметрыОткрытия.Вставить("ЗакрытьПриСозданииЗаписи"	, Истина);    
	ПараметрыОткрытия.Вставить("ИсточникЗаписи"			, "Телефон");
	
	Если Не ОткрытаИзСписка И ПараметрыТелефонногоЗвонка.ПиктограммаЗвонка = 0 Тогда	
		ПараметрыОткрытия.Вставить("ВнутреннийНомерСотрудника"			, ПараметрыТелефонногоЗвонка.ВнутреннийНомерСотрудника);	
	КонецЕсли;
	ПараметрыОткрытия.Вставить("IDЗвонка"			, IDЗвонка);
	
	ИмяФормыПланировщика = ОбщегоНазначенияКлиент.ПолучитьИмяФормыПланировщика(ПараметрыОткрытия, "ФормаЗаписи");
		
	Форма = ПолучитьФорму(ИмяФормыПланировщика, ПараметрыОткрытия,, "ФормаПланировщикКлючУникальности");
	Форма.Открыть();                            
	Оповестить("СозданиеСобытияСКонтрагентом", ПараметрыОткрытия);
	
	ВызвытьОповещение = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Создает пациента и сделку
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СоздатьПациентаИСделку(Команда)
	
	Если ЗначениеЗаполнено(ЗаявкаОснование) И ТипЗнч(ЗаявкаОснование) = Тип("СправочникСсылка.Заявки") Тогда
		ОбновитьЗаявкуИСделку(Истина);                                                   
	КонецЕсли;
	
	ВзаимодействиеЗадачаПараметры = Новый Структура;
	ВзаимодействиеЗадачаПараметры.Вставить("Взаимодействие"   , ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыВзаимодействий.ЗвонокИсходящий"));
	ВзаимодействиеЗадачаПараметры.Вставить("ВидВзаимодействия", ПредопределенноеЗначение("Перечисление.ВидыВзаимодействия.ЗвонокИсходящий"));
	ВзаимодействиеЗадачаПараметры.Вставить("ТемаПоУмолчанию"  , "Звонок исходящий");
	ВзаимодействиеЗадачаПараметры.Вставить("Представление"    , "Звонок исходящий");
	ВзаимодействиеЗадачаПараметры.Вставить("Картинка"         , БиблиотекаКартинок.ЗвонокИсходящий);
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Контрагент"	, СтруктураКлиента.СписокКонтрагентов[0].Значение.КонтрагентСсылка); 
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения"		, ЗначенияЗаполнения);
	ПараметрыОткрытия.Вставить("ВзаимодействиеСделка"	, ЗаявкаОснование);
	ПараметрыОткрытия.Вставить("ВзаимодействиеЗадачаПараметры"	, ВзаимодействиеЗадачаПараметры);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеУстановкиЗадачи", ЭтотОбъект);
	
	ОткрытьФорму("Задача.Взаимодействие.Форма.ФормаЗадачиБыстрая", ПараметрыОткрытия,,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура - после установки  задачи
//
Процедура ПослеУстановкиЗадачи(Результат, ДопПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		
		ЗаполнитьРезультатЗвонка(ПредопределенноеЗначение("Перечисление.РезультатыОбработкиЗвонка.ЗаписьНаПриемОтложена"));
		
	КонецЕсли;
		
КонецПроцедуры


&НаСервере
// Процедура - Обновляет заявку и сделку
//
Процедура ОбновитьЗаявкуИСделку(СоздаватьСделку) 
	
	ПреобразованныйНомер = СтрЗаменить(СтрСоединить(СтрРазделить(НомерТелефонаКлиента, "+&<>`“‘|%/\@() "), ""), Символы.НПП, "");
	
	Пациент = Справочники.Контрагенты.ПолучитьКонтрагентаПоНомеруТелефона(ПреобразованныйНомер);  
	Если ЗначениеЗаполнено(Пациент) Тогда
		СделкаПоЗаявке = Справочники.Сделки.ПолучитьАктуальнуюСделкуКлиента(Пациент, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница); 
	КонецЕсли;
	Если ЗначениеЗаполнено(СделкаПоЗаявке) Тогда
		ЗаявкаОснование = СделкаПоЗаявке; 
	Иначе
		Если Не ЗначениеЗаполнено(Пациент) Тогда
			Пациент = Справочники.Контрагенты.СоздатьКлиента(Фамилия,Имя,Отчество,НомерТелефонаКлиента,,ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница,"");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты")) И СоздаватьСделку Тогда
			
			ДанныеЗаполнения = Новый Структура();
			ДанныеЗаполнения.Вставить("ВидСделки"         , ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты"));
			ДанныеЗаполнения.Вставить("Контрагент"        , Пациент);
			ДанныеЗаполнения.Вставить("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
			ДанныеЗаполнения.Вставить("ЭтапСделки"        , Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(Справочники.ВидыСделок.НовыеПациенты, 1));
			ДанныеЗаполнения.Вставить("Заявка"            , ЗаявкаОснование);
			СделкаПоЗаявке = Справочники.Сделки.СоздатьНовуюСделку(ДанныеЗаполнения, Истина);
			
			ЗаявкаОснование = СделкаПоЗаявке;
			
		КонецЕсли;
	КонецЕсли;         
	СохранитьКонтрАгента(ПОIPТелефонии, IDЗвонка, Пациент, ЗаявкаОснование);
	
	СформироватьПредставлениеИСписокВариантовНомера(НомерТелефонаКлиента, ПреобразованныйНомерТелефона, СписокВариантовНомераТелефона);
	СтруктураКлиента = ПолучитьСтруктуруКлиентаПоНомеруТелефона(СписокВариантовНомераТелефона);
	
	УстановитьВидимостьЭлементовФормы();	
	
КонецПроцедуры

&НаСервере
// Процедура - Сохраняет пациента
//
Процедура СохранитьКонтрАгента(ПОIPТелефонии, IDЗвонка, Контрагент = Неопределено, ЗаявкаОснование)
	
	НаборЗаписей = РегистрыСведений.ИсторияВызовов.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.ОборудованиеТелефонии.Значение 		= ПОIPТелефонии;
	НаборЗаписей.Отбор.ОборудованиеТелефонии.Использование 	= Истина;
	НаборЗаписей.Отбор.IDЗвонка.Значение 					= IDЗвонка;
	НаборЗаписей.Отбор.IDЗвонка.Использование 				= Истина;
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда 
		Запись 			= НаборЗаписей[0];
		Если Контрагент <> Неопределено Тогда
			Запись.Контрагент 	= Контрагент;    
		КонецЕсли;
		Запись.Заявка    = ЗаявкаОснование;
		НачатьТранзакцию();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать(Истина);
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция, возвращает цвет текста от передаваемого цвета фона.
//
Функция ПолучитьЦветТекстаПоФону(ЦветФона)
	
	Если (ЦветФона.Зеленый + ЦветФона.Красный + ЦветФона.Синий) > 383 Тогда
		Возврат Новый Цвет(60,60,60);		
	Иначе
		Возврат Новый Цвет(255,255,255);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Оповестить("ОбновитьСписокИсторииЗвонков");
	
	Если НЕ ОткрытаИзСписка И ВызвытьОповещение Тогда
		ОповеститьПоНомеруТелефона();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФамилияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Текст) Тогда
		
		ОбновитьДанныеПоСозданиюПациента(Элемент.Имя, Текст);                          
		Если Элемент.Имя = "Фамилия" Тогда
			Фамилия = "";
		Иначе
			Имя = "";
		КонецЕсли;

	КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПоСозданиюПациента(ИмяФамилия = Неопределено, ТекстЗаполнения = Неопределено)

	ПолеФ = ?(ИмяФамилия = Неопределено Или ИмяФамилия = "Имя", Фамилия, ТекстЗаполнения);
	ПолеИ = ?(ИмяФамилия = Неопределено Или ИмяФамилия = "Фамилия", Имя, ТекстЗаполнения);	
		
	Если ЗначениеЗаполнено(ПолеФ) Или ЗначениеЗаполнено(ПолеИ) Тогда
		//Элементы.ГруппаСоздатьПациентаИЗаписать.Доступность = Истина;  
		Элементы.ГруппаСоздатьПациентаИСделку.Доступность 	= Истина;
		//Элементы.СоздатьИЗаписатьПациента.Доступность 		= Истина;
		Элементы.СоздатьПациентаИСделку.Доступность 		= Истина;
	Иначе    
		//Элементы.ГруппаСоздатьПациентаИЗаписать.Доступность = Ложь;  
		Элементы.ГруппаСоздатьПациентаИСделку.Доступность 	= Ложь;
		//Элементы.СоздатьИЗаписатьПациента.Доступность 		= Ложь;
		Элементы.СоздатьПациентаИСделку.Доступность 		= Ложь;
	КонецЕсли;
	
	//Элементы.ГруппаСоздатьПациентаИЗаписать.ЦветФона 				= ?(Элементы.ГруппаСоздатьПациентаИЗаписать.Доступность, Новый Цвет(25, 116, 206), Новый Цвет(242, 242, 242));
	//Элементы.СоздатьИЗаписатьПациента.ЦветТекста 					= ?(Элементы.ГруппаСоздатьПациентаИЗаписать.Доступность, Новый Цвет(255, 255, 255), Новый Цвет(49, 49, 49));	
	Элементы.СоздатьПациентаИСделку.ЦветТекста 						= ?(Элементы.ГруппаСоздатьПациентаИСделку.Доступность, Новый Цвет(255, 255, 255), Новый Цвет(49, 49, 49));	
	Элементы.ГруппаСоздатьПациентаИСделку.ЦветФона 					= ?(Элементы.ГруппаСоздатьПациентаИСделку.Доступность, Новый Цвет(25, 116, 206), Новый Цвет(242, 242, 242));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Удаляет пациента из черного списка
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура УдалитьИзЧерногоСписка(Команда)
	
	УдалитьНеобрабатываемыйНомер(НомерТелефонаКлиента); 
	СтруктураБлокировкиНомера = Неопределено;
	ПометитьНаУдалениеСвязанныеОбъекты(Ложь);
	УстановитьВидимостьЭлементовФормы();
	ВызвытьОповещение = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - Добавить необрабатываемый номер
//
// Параметры:
//  Номер	 - 	 - 
//
Процедура УдалитьНеобрабатываемыйНомер(Знач НомерТелефона, Знач ПричинаБлокировки = "")
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.ЗаблокированныеНомераТелефонов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.НомерТелефонаАбонента 	= НомерТелефона;
	МенеджерЗаписи.Удалить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
// Процедура - помечает на удаление объекты связанные с обращением
//
Процедура ПометитьНаУдалениеСвязанныеОбъекты(Удалить)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(ЗаявкаОснование) Тогда
		
		ЗаявкаОбъект = ЗаявкаОснование.ПолучитьОбъект();
		Если ТипЗнч(ЗаявкаОснование) = Тип("СправочникСсылка.Заявки") Тогда
			ЗаявкаОбъект.Статус = ?(Удалить, Перечисления.СтатусыЗаявок.Отклонена, Перечисления.СтатусыЗаявок.Принята);
		КонецЕсли;
		ЗаявкаОбъект.ПометкаУдаления = Удалить;
		ЗаявкаОбъект.Записать();   
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураКлиента.СписокКонтрагентов) Тогда
		
		Для Каждого Пациент Из СтруктураКлиента.СписокКонтрагентов Цикл
			
			ОткрытыеСделкиПациента = Справочники.Сделки.ПолучитьСделкиПоКлиенту(Пациент.Значение.КонтрагентСсылка,, Ложь,,,,Истина,Истина,,Истина);
			
			Для Каждого Элемент Из ОткрытыеСделкиПациента Цикл
				
				СделкаОбъект 					= Элемент.Сделка.ПолучитьОбъект();
				СделкаОбъект.ЭтапСделки 		= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ЭтапыСделок.Отказ");
				СделкаОбъект.ЭтапОтказа 		= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ЭтапыСделок.Отказ");
				СделкаОбъект.РезультатСделки 	= Перечисления.РезультатыСделок.Отказ;
				СделкаОбъект.ПометкаУдаления 	= Истина;
				СделкаОбъект.Записать();	
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - менает этап сделки в отказ
//
Процедура ОтменитьСделку()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(ЗаявкаОснование) Тогда
		
		СделкаОбъект 					= ЗаявкаОснование.ПолучитьОбъект();
		СделкаОбъект.ЭтапСделки 		= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ЭтапыСделок.Отказ");
		СделкаОбъект.ЭтапОтказа 		= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ЭтапыСделок.Отказ");
		СделкаОбъект.РезультатСделки 	= Перечисления.РезультатыСделок.Отказ;

		СделкаОбъект.Записать();   

	КонецЕсли;
    	
КонецПроцедуры

&НаСервере
// Функция - проверяет есть ли у пациента прием
// 
Функция ПриемСуществует(Пациент)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Прием.Ссылка КАК Ссылка,
		|	Прием.Контрагент КАК Контрагент
		|ИЗ
		|	Документ.Прием КАК Прием
		|ГДЕ
		|	Прием.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Пациент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ?(РезультатЗапроса.Пустой(), Ложь, Истина);
	
КонецФункции

&НаКлиенте
// Процедура - помечает на удаление сделку
//
Процедура ЗвонокНеСвязанСПриемом(Команда)
	
	Если ЗначениеЗаполнено(ЗаявкаОснование) И ТипЗнч(ЗаявкаОснование) = Тип("СправочникСсылка.Сделки") Тогда
		УдалитьСделку(); 
	ИначеЕсли ЗначениеЗаполнено(ЗаявкаОснование) И ТипЗнч(ЗаявкаОснование) = Тип("СправочникСсылка.Заявки") Тогда
       	ПометитьНаУдалениеСвязанныеОбъекты(Истина);
	КонецЕсли;

	ЗаполнитьРезультатЗвонка(ПредопределенноеЗначение("Перечисление.РезультатыОбработкиЗвонка.ЗвонокНеСвязанСПриемом"));
	ВызвытьОповещение = Истина;
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
// Процедура - помечает на удаление сделку
//
Процедура УдалитьСделку()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СделкаОбъект 					= ЗаявкаОснование.ПолучитьОбъект();
	СделкаОбъект.ЭтапСделки 		= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ЭтапыСделок.Отказ");
	СделкаОбъект.ЭтапОтказа 		= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ЭтапыСделок.Отказ");
	СделкаОбъект.РезультатСделки 	= Перечисления.РезультатыСделок.Отказ;
	СделкаОбъект.ПометкаУдаления 	= Истина;
	СделкаОбъект.Записать();   
	
КонецПроцедуры

&НаСервере
// Процедура - оповещает о закрытии формы связи
//
Процедура ОповеститьПоНомеруТелефона()

	УстановитьПривилегированныйРежим(Истина);
	
	ИспользоватьСистемуВзаимодействия = ОбсужденияСистемыВзаимодействия.СистемаВзаимодействияВключена();
	
	СписокАктивныхПользователей = IPТелефония.ПолучитьСписокАктивныхПользователей(ПараметрыТелефонногоЗвонка.ВнутреннийНомерСотрудника);
	
	Если ИспользоватьСистемуВзаимодействия = Истина Тогда
		
		Сотрудники 	 = Новый Массив;
		
		Для каждого АктивныйСеансПользователя Из СписокАктивныхПользователей Цикл
			Сотрудники.Добавить(АктивныйСеансПользователя.Пользователь);
		КонецЦикла;
		
		Если Сотрудники.Количество() > 0 Тогда
			
			ДанныеСообщения = Новый Структура;
			ДанныеСообщения.Вставить("Ключ"				, "ЗакрытьФормуЗвонкаПациенту");
			ДанныеСообщения.Вставить("Телефон"       	, НомерТелефонаКлиента);    
			ДанныеСообщения.Вставить("IDЗвонка"       	, IDЗвонка);

			ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения, Сотрудники); 
			
		КонецЕсли;
		
	Иначе
		
		// Оповещение через регистр сведений.
		Для Каждого АктивныйСеансПользователя Из СписокАктивныхПользователей Цикл
			
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(НомерТелефонаКлиента);
			МассивПараметров.Добавить(IDЗвонка);
			
			РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(АктивныйСеансПользователя.РабочееМесто,
			Неопределено, 
			"ЗакрытьФормуЗвонкаПациенту",
			ТекущаяДатаСеанса(),
			60,,,
			МассивПараметров);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - проверяет есть ли у пациента прием
// 
Функция ПолучитьНомераТелефонов(Пациент)
	
	Возврат Справочники.Контрагенты.ПолучитьМассивНомеровТелефонаКонтрагента(Пациент);
	
КонецФункции

&НаСервере
// Функция - проверяет есть ли у пациента прием
// 
Функция ПривестиНомер(НомерТел)
	
	Возврат СтрЗаменить(СтрСоединить(СтрРазделить(НомерТел, "+&<>`“‘|%/\@() "), ""), Символы.НПП, "");
	
КонецФункции

&НаСервере
// Функция - проверяет есть ли у пациента прием
// 
Функция ПациентыСуществуют(Пациенты)
	
	Для Каждого Элемент Из Пациенты Цикл
		Если ПриемСуществует(Элемент.Значение.КонтрагентСсылка) Тогда
			Возврат Истина;			
		КонецЕсли;                                                 
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
// Процедура - Сохраняет пациента
//
Процедура ЗаполнитьРезультатЗвонка(РезультатЗвонка)
	
	НаборЗаписей = РегистрыСведений.ИсторияВызовов.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.ОборудованиеТелефонии.Значение 		= ПОIPТелефонии;
	НаборЗаписей.Отбор.ОборудованиеТелефонии.Использование 	= Истина;
	НаборЗаписей.Отбор.IDЗвонка.Значение 					= IDЗвонка;
	НаборЗаписей.Отбор.IDЗвонка.Использование 				= Истина;
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда 
		Запись 			= НаборЗаписей[0];
		Запись.РезультатыОбработкиЗвонка    = РезультатЗвонка;
		НачатьТранзакцию();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать(Истина);
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 
