
#Область СлужебныйПрограммныйИнтерфейс

// Функция - Вернуть тип мессенджера внешней системы
//
// Параметры:
//  ВнешняяСистема	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьТипМессенджераВнешнейСистемы(ВнешняяСистема) Экспорт

	ТипВнешнейСистемы = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ВнешняяСистема, "ТипВнешнейСистемы");	
	
	Если НЕ ЗначениеЗаполнено(ТипВнешнейСистемы) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi Тогда 
		Возврат whatsapp;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Telegram Тогда	
		Возврат telegram;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Viber Тогда	
		Возврат viber;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.VkontakteApi Тогда	
		Возврат vk;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти