#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс	 
	 
////////////////////////////////////////////////////////////////////////////////
//
// Функция ВыполнитьОтправкуПисьма
//
// Описание: Выполняет фактическую отправку письма.
//			 Отправка может выполняться в двух режимах:
//			 Режим = 0: обычная отправка;
//			 Режим = 1: каждому адресату из поля "Кому" отправляется отдельное письмо (для того, чтобы он [адресат] видел в поле "Кому" только себя)
//			 			при этом адресаты из полей ("Копия", "Скрытая копия") игнорируются.
//
//
// Параметры (название, тип, дифференцированное значение)
//			 Объект - ДокументОбъект.ЭлектронноеПисьмоИсходящее, объект документа исходящего письма;
//			 ОписаниеОшибки - Строка, возвращает описание ошибки, в случае ошибки при отправке;
//			 Режим - Число, 0 - обычная отправка письма и 1 - отправка каждому адресату отдельного письма
//			 НомерАдресатаДляОтправки - Число, номер адресата из таблицы получателей письма, которому необходимо выполнить отправку.
//			 							Игнорируется, если Режим = 0.
//
// Возвращаемое значение: Булево, Истина - если письмо было успешно отправлено
//
Функция ВыполнитьОтправкуПисьма(Объект, ОписаниеОшибки, Режим = 0, НомерАдресатаДляОтправки = Неопределено, УровеньЖурналаРегистрацииКоллизии = Неопределено) Экспорт
	
	Результат = Истина;
	
	Попытка
		
		Если Не ЗначениеЗаполнено(Объект.УчетнаяЗапись) Тогда
			ОписаниеОшибки = "Не выбрана учетная запись электронной почты";
			Результат = Ложь;
			Возврат Результат;
		ИначеЕсли Не Объект.УчетнаяЗапись.ИспользоватьДляОтправки Тогда
			ОписаниеОшибки = "Выбранная учетная запись не предназначена для отправки писем";
			Результат = Ложь;
			Возврат Результат;			
		КонецЕсли;
		
		ПараметрыПисьма = Новый Структура;
		
		Если Режим = 0 Тогда // обычная отправка
			ДобавитьВПараметрАдресатов(Объект, ПараметрыПисьма, "Кому", "ПолучателиПисьма");
			ДобавитьВПараметрАдресатов(Объект, ПараметрыПисьма, "Копии", "ПолучателиКопий");
			ДобавитьВПараметрАдресатов(Объект, ПараметрыПисьма, "СкрытыеКопии", "ПолучателиСкрытыхКопий");
		ИначеЕсли Режим = 1 Тогда // индивидуальная отправка
			ДобавитьВПараметрАдресатов(Объект, ПараметрыПисьма, "Кому", "ПолучателиПисьма", НомерАдресатаДляОтправки);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ПолучателиПисьма) И Объект.ПолучателиПисьма.Количество() = 1 Тогда 			
			Получатель = Объект.ПолучателиПисьма[0].Контакт; 
		Иначе
			Получатель = Объект.Предмет; 		
		КонецЕсли;
		
		ПараметрыПисьма.Вставить("Тема",      Объект.Тема);
		//ПараметрыПисьма.Вставить("Тело",      Объект.ТекстHTML);
		ПараметрыПисьма.Вставить("Тело",      Справочники.ШаблоныСообщений.ПреобразоватьСодержаниеСПараметрамиВТекст(Объект.ТекстHTML,Объект,Получатель,, Истина));
		ПараметрыПисьма.Вставить("Кодировка", Объект.Кодировка);
		ПараметрыПисьма.Вставить("Важность",  УправлениеЭлектроннойПочтой.ПолучитьВажность(Объект.Важность));
		
		Если Не ПустаяСтрока(Объект.ИдентификаторыОснований) Тогда
			ПараметрыПисьма.Вставить("ИдентификаторыОснований", Объект.ИдентификаторыОснований);
		КонецЕсли;
		
		АктивнаяПодпись = Справочники.ПодписиЭлектронныхПисем.ПолучитьПодписьПоУчетнойЗаписи(Объект.УчетнаяЗапись);
		
		Если АктивнаяПодпись <> Неопределено Тогда
			Приветствие = АктивнаяПодпись.Приветствие;
			Подпись = АктивнаяПодпись.Подпись;
			Если ЗначениеЗаполнено(Приветствие) Тогда
				Объект.ТекстHTML = Приветствие +  " <br> " + "--------------------" + Объект.ТекстHTML;
			КонецЕсли;
			Если ЗначениеЗаполнено(Подпись) Тогда		
				Объект.ТекстHTML = Объект.ТекстHTML + "--------------------" + " <br> " + Подпись;
			КонецЕсли;
		КонецЕсли;
		
		#Область Заполнение_вложений
		
		соотвВложения = Новый Соответствие;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Файлы.ТекущаяВерсия КАК ТекущаяВерсия,
		|	Файлы.ТекущаяВерсия.ПолноеНаименование КАК ПолноеНаименование,
		|	Файлы.ТекущаяВерсия.Расширение КАК Расширение
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.ВладелецФайла = &ВладелецФайла
		|	И Файлы.ТекущаяВерсия <> ЗНАЧЕНИЕ(Справочник.ВерсииФайлов.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
			
		Пока Выборка.Следующий() Цикл
			ИмяФайла = Выборка.ПолноеНаименование + ?(Выборка.Расширение = "", "", "." + Выборка.Расширение);
			ДанныеФайла = РаботаСФайламиСлужебный.ПолучитьНавигационнуюСсылкуВоВременномХранилище(Выборка.ТекущаяВерсия);
			соотвВложения.Вставить(ИмяФайла, ДанныеФайла);
		КонецЦикла;
		ПараметрыПисьма.Вставить("Вложения", соотвВложения);
		
		#КонецОбласти

		
		Если ЗначениеЗаполнено(Объект.ТекстHTML) Тогда
			Объект.ТипТекста = ПредопределенноеЗначение("Перечисление.ТипыТекстовЭлектронныхПисем.HTML");
		ИначеЕсли Объект.ТипТекста = ПредопределенноеЗначение("Перечисление.ТипыТекстовЭлектронныхПисем.ПустаяСсылка") Тогда
			Объект.ТипТекста = ПредопределенноеЗначение("Перечисление.ТипыТекстовЭлектронныхПисем.ПростойТекст");
		КонецЕсли;
		
		ПараметрыПисьма.Вставить("ТипТекста", Объект.ТипТекста);
		
		ИдентификаторПисьма = ЭлектроннаяПочта.ОтправитьПочтовоеСообщение(Объект.УчетнаяЗапись, ПараметрыПисьма);
		
		Объект.ИдентификаторСообщения = ИдентификаторПисьма;
		Объект.СтатусПисьма = ПредопределенноеЗначение("Перечисление.СтатусыИсходящегоЭлектронногоПисьма.Отправлено");
		Объект.ДатаОтправления = ТекущаяДата();
		Объект.Записать(РежимЗаписиДокумента.Запись);
		
	Исключение
		
		Результат = Ложь;
		ОписаниеОшибки = ОписаниеОшибки();
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьВПараметрАдресатов(Объект, ПараметрыПисьма, ИмяПараметра, ИмяТаблицы, НомерСтрокиАдресата = Неопределено)
	
	ТабЗн = Объект[ИмяТаблицы];
	Если ТабЗн.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Адресаты = Новый Массив;
	
	Если НомерСтрокиАдресата = Неопределено Тогда
		Для Каждого Стр Из ТабЗн Цикл
			Адресаты.Добавить(Новый Структура("Адрес, Представление", Стр.Адрес, Стр.Представление));
		КонецЦикла;
	Иначе
		ИндексАдресата = НомерСтрокиАдресата - 1;
		Адресаты.Добавить(Новый Структура("Адрес, Представление", ТабЗн[ИндексАдресата].Адрес, ТабЗн[ИндексАдресата].Представление));
	КонецЕсли; 
	
	ПараметрыПисьма.Вставить(ИмяПараметра, Адресаты);
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
