#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции	
	
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылкаНачислениеЗарплаты, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	РасчетЗарплаты.Ссылка.Дата КАК Период,
	|	РасчетЗарплаты.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	РасчетЗарплаты.Сотрудник,
	|	РасчетЗарплаты.Сумма,
	|	НАЧАЛОПЕРИОДА(РасчетЗарплаты.Ссылка.ДатаНачалаПериода, МЕСЯЦ) КАК МесяцНачисления,
	|	РасчетЗарплаты.Ссылка КАК ДокументНачисления
	|ПОМЕСТИТЬ ТаблицаРасчетыСПерсоналом
	|ИЗ
	|	Документ.НачислениеЗарплаты.РасчетЗарплаты КАК РасчетЗарплаты
	|ГДЕ
	|	РасчетЗарплаты.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	НачислениеЗарплатыАвансы.Ссылка.Дата,
	|	НачислениеЗарплатыАвансы.Ссылка.СтруктурнаяЕдиница,
	|	НачислениеЗарплатыАвансы.Сотрудник,
	|	-НачислениеЗарплатыАвансы.Сумма,
	|	НАЧАЛОПЕРИОДА(НачислениеЗарплатыАвансы.Ссылка.ДатаНачалаПериода, МЕСЯЦ),
	|	NULL
	|ИЗ
	|	Документ.НачислениеЗарплаты.Авансы КАК НачислениеЗарплатыАвансы
	|ГДЕ
	|	НачислениеЗарплатыАвансы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	НачислениеЗарплатыАвансы.Ссылка.Дата,
	|	НачислениеЗарплатыАвансы.Ссылка.СтруктурнаяЕдиница,
	|	НачислениеЗарплатыАвансы.Сотрудник,
	|	НачислениеЗарплатыАвансы.Сумма,
	|	НАЧАЛОПЕРИОДА(НачислениеЗарплатыАвансы.Ссылка.ДатаНачалаПериода, МЕСЯЦ),
	|	НачислениеЗарплатыАвансы.Ссылка
	|ИЗ
	|	Документ.НачислениеЗарплаты.Авансы КАК НачислениеЗарплатыАвансы
	|ГДЕ
	|	НачислениеЗарплатыАвансы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	НачислениеЗарплатыПрочиеНачисленияИУдержания.Ссылка.Дата,
	|	НачислениеЗарплатыПрочиеНачисленияИУдержания.Ссылка.СтруктурнаяЕдиница,
	|	НачислениеЗарплатыПрочиеНачисленияИУдержания.Сотрудник,
	|	НачислениеЗарплатыПрочиеНачисленияИУдержания.Сумма,
	|	НАЧАЛОПЕРИОДА(НачислениеЗарплатыПрочиеНачисленияИУдержания.Ссылка.ДатаНачалаПериода, МЕСЯЦ),
	|	НачислениеЗарплатыПрочиеНачисленияИУдержания.Ссылка
	|ИЗ
	|	Документ.НачислениеЗарплаты.ПрочиеНачисленияИУдержания КАК НачислениеЗарплатыПрочиеНачисленияИУдержания
	|ГДЕ
	|	НачислениеЗарплатыПрочиеНачисленияИУдержания.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Затраты.Ссылка.Дата КАК Период,
	|	Затраты.Ссылка.СтруктурнаяЕдиница,
	|	Затраты.ВидНачисления,
	|	Затраты.Сотрудник,
	|	Затраты.Контрагент,
	|	Затраты.Номенклатура,
	|	Затраты.Сумма
	|ПОМЕСТИТЬ ТаблицаЗатрат
	|ИЗ
	|	Документ.НачислениеЗарплаты.Затраты КАК Затраты
	|ГДЕ
	|	Затраты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(Затраты.НомерСтроки) КАК НомерСтроки,
	|	Затраты.Ссылка.Дата КАК Период,
	|	Затраты.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.РасходыСебестоимость) КАК СчетДт,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Зарплата) КАК СчетКт,
	|	ВЫБОР
	|		КОГДА НЕ СотрудникиСпецилазацииСотрудника.Специализация ЕСТЬ NULL 
	|			ТОГДА СотрудникиСпецилазацииСотрудника.Специализация
	|		ИНАЧЕ Затраты.Номенклатура.Специализация
	|	КОНЕЦ КАК СубконтоДт1,
	|	ВЫБОР
	|		КОГДА Затраты.Документ ССЫЛКА Документ.Прием
	|				И Затраты.Документ.ПолисМедСтрахования <> ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяССылка)
	|			ТОГДА Затраты.Документ.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ Затраты.Контрагент
	|	КОНЕЦ КАК СубконтоДт2,
	|	Затраты.Документ.Сотрудник КАК СубконтоДт3,
	|	Затраты.СтатьяРасходов КАК СубконтоДт4,
	|	Затраты.Документ.Сотрудник КАК СубконтоКт1,
	|	СУММА(Затраты.Сумма) КАК Сумма,
	|	""Начисление заплаты"" КАК Содержание
	|ПОМЕСТИТЬ ВременнаяТаблицаУправленческий
	|ИЗ
	|	Документ.НачислениеЗарплаты.Затраты КАК Затраты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники.СпецилазацииСотрудника КАК СотрудникиСпецилазацииСотрудника
	|		ПО Затраты.Сотрудник = СотрудникиСпецилазацииСотрудника.Ссылка
	|			И (СотрудникиСпецилазацииСотрудника.Основная = ИСТИНА)
	|ГДЕ
	|	Затраты.Ссылка = &Ссылка
	|	И Затраты.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Затраты.Ссылка.Дата,
	|	Затраты.Ссылка.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА НЕ СотрудникиСпецилазацииСотрудника.Специализация ЕСТЬ NULL 
	|			ТОГДА СотрудникиСпецилазацииСотрудника.Специализация
	|		ИНАЧЕ Затраты.Номенклатура.Специализация
	|	КОНЕЦ,
	|	Затраты.Документ.Сотрудник,
	|	ВЫБОР
	|		КОГДА Затраты.Документ ССЫЛКА Документ.Прием
	|				И Затраты.Документ.ПолисМедСтрахования <> ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяССылка)
	|			ТОГДА Затраты.Документ.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ Затраты.Контрагент
	|	КОНЕЦ,
	|	Затраты.СтатьяРасходов,
	|	Затраты.Документ.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(Затраты.НомерСтроки),
	|	Затраты.Ссылка.Дата,
	|	Затраты.Ссылка.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.РасходыПрочие),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Зарплата),
	|	Затраты.СтатьяРасходов,
	|	ВЫБОР
	|		КОГДА НЕ СотрудникиСпецилазацииСотрудника.Специализация ЕСТЬ NULL 
	|			ТОГДА СотрудникиСпецилазацииСотрудника.Специализация
	|		ИНАЧЕ Затраты.Номенклатура.Специализация
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	Затраты.Сотрудник,
	|	СУММА(Затраты.Сумма),
	|	""Начисление заплаты""
	|ИЗ
	|	Документ.НачислениеЗарплаты.Затраты КАК Затраты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники.СпецилазацииСотрудника КАК СотрудникиСпецилазацииСотрудника
	|		ПО Затраты.Сотрудник = СотрудникиСпецилазацииСотрудника.Ссылка
	|			И (СотрудникиСпецилазацииСотрудника.Основная = ИСТИНА)
	|ГДЕ
	|	Затраты.Ссылка = &Ссылка
	|	И Затраты.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Затраты.Ссылка.Дата,
	|	Затраты.Ссылка.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА НЕ СотрудникиСпецилазацииСотрудника.Специализация ЕСТЬ NULL 
	|			ТОГДА СотрудникиСпецилазацииСотрудника.Специализация
	|		ИНАЧЕ Затраты.Номенклатура.Специализация
	|	КОНЕЦ,
	|	Затраты.Сотрудник,
	|	Затраты.СтатьяРасходов";
	
	Запрос.УстановитьПараметр("Ссылка" , ДокументСсылкаНачислениеЗарплаты);
	Запрос.ВыполнитьПакет();
	
	СформироватьТаблицаРасчетыСПерсоналом(ДокументСсылкаНачислениеЗарплаты, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗатраты(ДокументСсылкаНачислениеЗарплаты, СтруктураДополнительныеСвойства);
	СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства);	

	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПерсоналом(ДокументСсылкаНачислениеЗарплаты, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПерсоналом.НомерСтроки КАК НомерСтроки,
	|	РасчетыСПерсоналом.ВидДвижения,
	|	РасчетыСПерсоналом.Период,
	|	РасчетыСПерсоналом.ДокументНачисления,
	|	РасчетыСПерсоналом.СтруктурнаяЕдиница,
	|	РасчетыСПерсоналом.МесяцНачисления,
	|	РасчетыСПерсоналом.Сотрудник,
	|	СУММА(РасчетыСПерсоналом.Сумма) КАК Сумма
	|ИЗ
	|	ТаблицаРасчетыСПерсоналом КАК РасчетыСПерсоналом
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПерсоналом.НомерСтроки,
	|	РасчетыСПерсоналом.ВидДвижения,
	|	РасчетыСПерсоналом.Период,
	|	РасчетыСПерсоналом.ДокументНачисления,
	|	РасчетыСПерсоналом.СтруктурнаяЕдиница,
	|	РасчетыСПерсоналом.МесяцНачисления,
	|	РасчетыСПерсоналом.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПерсоналом", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗатраты(ДокументСсылкаНачислениеЗарплаты, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Затраты.Период,
	|	Затраты.СтруктурнаяЕдиница,
	|	Затраты.ВидНачисления КАК СтатьяЗатрат,
	|	Затраты.Сотрудник,
	|	Затраты.Контрагент,
	|	Затраты.Номенклатура,
	|	Затраты.Сумма
	|ИЗ
	|	ТаблицаЗатрат КАК Затраты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗатраты", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	ВременнаяТаблицаУправленческий.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ВременнаяТаблицаУправленческий.СубконтоДт1,
	|	ВременнаяТаблицаУправленческий.СубконтоДт2,
	|	ВременнаяТаблицаУправленческий.СубконтоДт3,
	|	ВременнаяТаблицаУправленческий.СубконтоДт4,
	|	ВременнаяТаблицаУправленческий.СубконтоКт1,
	|	ВременнаяТаблицаУправленческий.Сумма,
	|	ВременнаяТаблицаУправленческий.Содержание КАК Содержание
	|ИЗ
	|	ВременнаяТаблицаУправленческий КАК ВременнаяТаблицаУправленческий
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
		
	РезультатЗапроса = Запрос.Выполнить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция СформироватьПечатнуюФорму(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НачислениеЗарплаты.ПФ_MXL_РасчетныйЛисток");

	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	НачислениеЗарплатыРасчетЗарплаты.Ссылка КАК Ссылка,
	                      |	НачислениеЗарплатыРасчетЗарплаты.Сотрудник КАК Сотрудник,
	                      |	НачислениеЗарплатыРасчетЗарплаты.НачислениеУдержание КАК ВидНачисления,
	                      |	ВЫБОР
	                      |		КОГДА НачислениеЗарплатыРасчетЗарплаты.Сумма > 0
	                      |			ТОГДА НачислениеЗарплатыРасчетЗарплаты.Сумма
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ КАК СуммаНачисления,
	                      |	НачислениеЗарплатыРасчетЗарплаты.База,
	                      |	НачислениеЗарплатыРасчетЗарплаты.Размер,
	                      |	НачислениеЗарплатыРасчетЗарплаты.Ссылка.СтруктурнаяЕдиница,
	                      |	НачислениеЗарплатыРасчетЗарплаты.Ссылка.Организация,
	                      |	НачислениеЗарплатыРасчетЗарплаты.ДнейФакт КАК ДнейФакт,
	                      |	НачислениеЗарплатыРасчетЗарплаты.ЧасовФакт КАК ЧасовФакт,
	                      |	НачислениеЗарплатыРасчетЗарплаты.ДнейПлан КАК ДнейПлан,
	                      |	НачислениеЗарплатыРасчетЗарплаты.ЧасовПлан КАК ЧасовПлан,
	                      |	НачислениеЗарплатыРасчетЗарплаты.Сотрудник.Должность КАК Должность,
	                      |	НачислениеЗарплатыРасчетЗарплаты.Ссылка.ДатаНачалаПериода КАК РасчетнаяДата,
	                      |	КОНЕЦПЕРИОДА(НачислениеЗарплатыРасчетЗарплаты.Ссылка.ДатаОкончанияПериода, ДЕНЬ) КАК ДатаОкончанияПериода,
	                      |	ВЫБОР
	                      |		КОГДА НачислениеЗарплатыРасчетЗарплаты.Сумма < 0
	                      |			ТОГДА НачислениеЗарплатыРасчетЗарплаты.Сумма
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ КАК СуммаУдержания
	                      |ИЗ
	                      |	Документ.НачислениеЗарплаты.РасчетЗарплаты КАК НачислениеЗарплатыРасчетЗарплаты
	                      |ГДЕ
	                      |	НачислениеЗарплатыРасчетЗарплаты.Ссылка В(&МассивОбъектов)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	НачислениеЗарплатыПрочиеНачисленияИУдержания.Ссылка,
	                      |	НачислениеЗарплатыПрочиеНачисленияИУдержания.Сотрудник,
	                      |	НачислениеЗарплатыПрочиеНачисленияИУдержания.Начисление,
	                      |	ВЫБОР
	                      |		КОГДА НачислениеЗарплатыПрочиеНачисленияИУдержания.Сумма > 0
	                      |			ТОГДА НачислениеЗарплатыПрочиеНачисленияИУдержания.Сумма
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ,
	                      |	0,
	                      |	0,
	                      |	НачислениеЗарплатыПрочиеНачисленияИУдержания.Ссылка.СтруктурнаяЕдиница,
	                      |	НачислениеЗарплатыПрочиеНачисленияИУдержания.Ссылка.Организация,
	                      |	0,
	                      |	0,
	                      |	0,
	                      |	0,
	                      |	НачислениеЗарплатыПрочиеНачисленияИУдержания.Сотрудник.Должность,
	                      |	НачислениеЗарплатыПрочиеНачисленияИУдержания.Ссылка.ДатаНачалаПериода,
	                      |	НачислениеЗарплатыПрочиеНачисленияИУдержания.Ссылка.ДатаОкончанияПериода,
	                      |	ВЫБОР
	                      |		КОГДА НачислениеЗарплатыПрочиеНачисленияИУдержания.Сумма < 0
	                      |			ТОГДА НачислениеЗарплатыПрочиеНачисленияИУдержания.Сумма
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ
	                      |ИЗ
	                      |	Документ.НачислениеЗарплаты.ПрочиеНачисленияИУдержания КАК НачислениеЗарплатыПрочиеНачисленияИУдержания
	                      |ГДЕ
	                      |	НачислениеЗарплатыПрочиеНачисленияИУдержания.Ссылка В(&МассивОбъектов)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Сотрудник");
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.СледующийПоЗначениюПоля("Сотрудник") Цикл
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
		ОбластьШапки = Макет.ПолучитьОбласть("ОбластьШапка");
		ОбластьШапки.Параметры.Заполнить(Выборка);
		ОбластьШапки.Параметры.РасчетнаяДата = Формат(Выборка.РасчетнаяДата, "ДФ=dd.MM.yy") + " по: " + Формат(Выборка.ДатаОкончанияПериода, "ДФ=dd.MM.yy");

		ОбластьШапкиТаблицы = Макет.ПолучитьОбласть("ОбластьШапкаТаблицы");
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьШапки);
		ТабличныйДокумент.Вывести(ОбластьШапкиТаблицы);
		
		ВыборкаДетально 		= Выборка;
		ОбластьСтрокаНачисление = Макет.ПолучитьОбласть("ОбластьСтрокаТаблицыНачисление");
		ОбластьСтрокаУдержание 	= Макет.ПолучитьОбласть("ОбластьСтрокаТаблицыУдержание");
		
		ТабДокументНачисленияУдержания 	= Новый ТабличныйДокумент;
		ТабДокументНачисления 			= Новый ТабличныйДокумент;
		ТабДокументУдержания 			= Новый ТабличныйДокумент;

		КолН 			= 0;  // Количество начислений
		КолУ 			= 0;  // Количество удержаний
		
		СуммаНачисления = 0;
		СуммаУдержания  = 0;
		
		Пока ВыборкаДетально.Следующий() Цикл
			ИмяРеквизита = "";
			Если ТипЗнч(ВыборкаДетально.ВидНачисления) = Тип("СправочникСсылка.НачисленияИУдержанияСотрудников") Тогда 
				ИмяРеквизита = "НачислениеУдержание";
			Иначе 
				ИмяРеквизита = "ТипНачисленияУдержания";
			КонецЕсли;
			
			Если ВыборкаДетально.ВидНачисления[ИмяРеквизита] = Перечисления.ТипыНачисленийУдержаний.Начисление Тогда
				
				ОбластьСтрокаНачисление.Параметры.Заполнить(ВыборкаДетально);
				
				Если ИмяРеквизита = "НачислениеУдержание" Тогда 
					Если ВыборкаДетально.ВидНачисления.ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Процент Тогда
						ОбластьСтрокаНачисление.Параметры.ДнейЧасов = Формат(ВыборкаДетально.Размер, "") + "%";
					ИначеЕсли ВыборкаДетально.ВидНачисления.ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Оклад Тогда
						Если ВыборкаДетально.ВидНачисления.ЗависимостьОтВыработки = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗависитОтВыработки
							И ВыборкаДетально.ВидНачисления.ТипПериодаНачисления = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоЧасам Тогда
							ОбластьСтрокаНачисление.Параметры.ДнейЧасов = Формат(ВыборкаДетально.ЧасовПлан, "ЧДЦ=0; ЧН=") + " / " + Формат(ВыборкаДетально.ЧасовФакт, "ЧДЦ=0; ЧН=");
						Иначе
							ОбластьСтрокаНачисление.Параметры.ДнейЧасов = Формат(ВыборкаДетально.ДнейПлан, "ЧДЦ=0; ЧН=") + " / " + Формат(ВыборкаДетально.ДнейФакт, "ЧДЦ=0; ЧН=");
						КонецЕсли;
					ИначеЕсли ВыборкаДетально.ВидНачисления.ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Тариф Тогда
						Если ВыборкаДетально.ВидНачисления.ТипТарифа = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаЧас Тогда
							ОбластьСтрокаНачисление.Параметры.ДнейЧасов = Формат(ВыборкаДетально.ЧасовФакт, "ЧДЦ=0; ЧН=");
						Иначе
							ОбластьСтрокаНачисление.Параметры.ДнейЧасов = Формат(ВыборкаДетально.ДнейФакт, "ЧДЦ=0; ЧН=");
						КонецЕсли;					
					Иначе
						ОбластьСтрокаНачисление.Параметры.ДнейЧасов = "";
					КонецЕсли;
				Иначе 
					ОбластьСтрокаНачисление.Параметры.ДнейЧасов = "";
				КонецЕсли;
				
				ТабДокументНачисления.Вывести(ОбластьСтрокаНачисление);
				
				КолН = КолН +1;
				СуммаНачисления = СуммаНачисления + Выборка.СуммаНачисления;
				
			ИначеЕсли ВыборкаДетально.ВидНачисления[ИмяРеквизита] = Перечисления.ТипыНачисленийУдержаний.Удержание Тогда
				
				ОбластьСтрокаУдержание.Параметры.Заполнить(ВыборкаДетально);
				ОбластьСтрокаУдержание.Параметры.СуммаУдержания = Выборка.СуммаУдержания*-1;				
				ТабДокументУдержания.Вывести(ОбластьСтрокаУдержание);
				КолУ = КолУ +1;
				СуммаУдержания = СуммаУдержания + Выборка.СуммаУдержания;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
		
		// Соединяем начисления и удержания
		ТабДокументНачисленияУдержания.Присоединить(ТабДокументНачисления);
		ТабДокументНачисленияУдержания.Присоединить(ТабДокументУдержания);
		Область = ТабДокументНачисленияУдержания.Область("R1C1:R"+Макс(КолН, КолУ)+"C7");
		Область.Обвести(Линия, Линия, Линия, Линия);
		
		// Выводим параллельные списки начислений удержаний
		ТабличныйДокумент.Вывести(ТабДокументНачисленияУдержания);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(СУММА(РасчетыСПерсоналомОстаткиИОбороты.СуммаНачальныйОстаток), 0) КАК ДолгНачало,
		|	ЕСТЬNULL(СУММА(РасчетыСПерсоналомОстаткиИОбороты.СуммаКонечныйОстаток), 0) КАК Долг,
		|	ЕСТЬNULL(СУММА(РасчетыСПерсоналомОстаткиИОбороты.СуммаРасход), 0) КАК Выплачено,
		|	ЕСТЬNULL(СУММА(РасчетыСПерсоналомОстаткиИОбороты.СуммаПриход), 0) КАК Начислено
		|ИЗ
		|	РегистрНакопления.РасчетыСПерсоналом.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			,
		|			Сотрудник = &Сотрудник
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК РасчетыСПерсоналомОстаткиИОбороты";
		
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Выборка.СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
		Запрос.УстановитьПараметр("НачалоПериода", Выборка.РасчетнаяДата);		
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(Выборка.ДатаОкончанияПериода));
		
		ВыборкаИтоги = Запрос.Выполнить().Выбрать();
		ВыборкаИтоги.Следующий();
		
		ОбластьСтрокаИтог = Макет.ПолучитьОбласть("ОбластьСтрокаИтог");
		ОбластьСтрокаИтог.Параметры.СуммаУдержания  = СуммаУдержания*-1;
		ОбластьСтрокаИтог.Параметры.СуммаНачисления = СуммаНачисления;
		
		ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
		ОбластьПодвал.Параметры.ДолгНачало 		= Формат(ВыборкаИтоги.ДолгНачало, "ЧЦ=15; ЧДЦ=2; ЧН=0,00") + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
		ОбластьПодвал.Параметры.Выплачено 		= Формат(ВыборкаИтоги.Выплачено, "ЧЦ=15; ЧДЦ = 2; ЧН=0,00") + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
		ОбластьПодвал.Параметры.Долг 			= Формат(ВыборкаИтоги.Долг, "ЧЦ=15; ЧДЦ=2; ЧН=0,00") + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
		СуммаИтого 								= ВыборкаИтоги.Долг;
		ОбластьПодвал.Параметры.СуммаПрописью 	= Формат(СуммаИтого, "ЧЦ=15; ЧДЦ=2; ЧН=0,00") + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти() +"(" + ФормированиеПечатныхФорм.СформироватьСуммуПрописью(СуммаИтого) + ")";
		
		ТабличныйДокумент.Вывести(ОбластьСтрокаИтог);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФорму()

// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция СформироватьПечатнуюФормуПлатежнаяВедомость(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НачислениеЗарплаты.ПФ_MXL_ПлатежнаяВедомость");

	Для Каждого ДокНачисление Из МассивОбъектов Цикл
		ОбластьШапкиДокумента = Макет.ПолучитьОбласть("ШапкаДокумента");
		ОбластьШапкиДокумента.Параметры.НазваниеОрганизации = ДокНачисление.Организация;
		ОбластьШапкиДокумента.Параметры.СуммаДокПрописью = ФормированиеПечатныхФорм.СформироватьСуммуПрописью(ДокНачисление.РасчетЗарплаты.Итог("Сумма") + ДокНачисление.ПрочиеНачисленияИУдержания.Итог("Сумма") - ДокНачисление.Авансы.Итог("Сумма"));
		ОбластьШапкиДокумента.Параметры.СуммаДок = ДокНачисление.РасчетЗарплаты.Итог("Сумма") + ДокНачисление.ПрочиеНачисленияИУдержания.Итог("Сумма") - ДокНачисление.Авансы.Итог("Сумма");
		ОбластьШапкиДокумента.Параметры.Валюта = ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодЦелойчастиВалюты();
		
		Отбор = Новый Структура("Организация, ТипОтветственногоЛица", ДокНачисление.Организация, Перечисления.ТипыОтветственныхЛиц.Руководитель);
		СрезОтветственныхЛиц = РегистрыСведений.ОтветственныеЛица.СрезПоследних(ТекущаяДата(), Отбор);
		ОбластьШапкиДокумента.Параметры.РуководительДолжность = ?(СрезОтветственныхЛиц.Количество() > 0, СрезОтветственныхЛиц[0].Должность, "");
		ОбластьШапкиДокумента.Параметры.ФИОРуководителя = ?(СрезОтветственныхЛиц.Количество() > 0, ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(СрезОтветственныхЛиц[0].Сотрудник)), "");
		Отбор = Новый Структура("Организация, ТипОтветственногоЛица", ДокНачисление.Организация, Перечисления.ТипыОтветственныхЛиц.ГлавныйБухгалтер);
		СрезОтветственныхЛиц = РегистрыСведений.ОтветственныеЛица.СрезПоследних(ТекущаяДата(), Отбор);
		ОбластьШапкиДокумента.Параметры.ФИОГлавногоБухгалтера = ?(СрезОтветственныхЛиц.Количество() > 0, ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(СрезОтветственныхЛиц[0].Сотрудник)), "");
		ОбластьШапкиДокумента.Параметры.НомерДок = ДокНачисление.Номер;
		ОбластьШапкиДокумента.Параметры.ДатаДок = ДокНачисление.Дата;
		ОбластьШапкиДокумента.Параметры.ОтчетныйПериодС = ДокНачисление.ДатаНачалаПериода;
		ОбластьШапкиДокумента.Параметры.ОтчетныйПериодПо = ДокНачисление.ДатаОкончанияПериода;
		ТабличныйДокумент.Вывести(ОбластьШапкиДокумента);
		
		ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
		ТабличныйДокумент.Вывести(ОбластьШапки);
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                      |	ВложенныйЗапрос.Сотрудник,
		                      |	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма
		                      |ИЗ
		                      |	(ВЫБРАТЬ
		                      |		НачислениеЗарплатыРасчетЗарплаты.Сотрудник КАК Сотрудник,
		                      |		СУММА(НачислениеЗарплатыРасчетЗарплаты.Сумма) КАК Сумма
		                      |	ИЗ
		                      |		Документ.НачислениеЗарплаты.РасчетЗарплаты КАК НачислениеЗарплатыРасчетЗарплаты
		                      |	ГДЕ
		                      |		НачислениеЗарплатыРасчетЗарплаты.Ссылка = &Ссылка
		                      |	
		                      |	СГРУППИРОВАТЬ ПО
		                      |		НачислениеЗарплатыРасчетЗарплаты.Сотрудник
		                      |	
		                      |	ОБЪЕДИНИТЬ ВСЕ
		                      |	
		                      |	ВЫБРАТЬ
		                      |		НачислениеЗарплатыПрочиеНачисленияИУдержания.Сотрудник,
		                      |		СУММА(НачислениеЗарплатыПрочиеНачисленияИУдержания.Сумма)
		                      |	ИЗ
		                      |		Документ.НачислениеЗарплаты.ПрочиеНачисленияИУдержания КАК НачислениеЗарплатыПрочиеНачисленияИУдержания
		                      |	ГДЕ
		                      |		НачислениеЗарплатыПрочиеНачисленияИУдержания.Ссылка = &Ссылка
		                      |	
		                      |	СГРУППИРОВАТЬ ПО
		                      |		НачислениеЗарплатыПрочиеНачисленияИУдержания.Сотрудник
		                      |	
		                      |	ОБЪЕДИНИТЬ ВСЕ
		                      |	
		                      |	ВЫБРАТЬ
		                      |		НачислениеЗарплатыАвансы.Сотрудник,
		                      |		СУММА(-НачислениеЗарплатыАвансы.Сумма)
		                      |	ИЗ
		                      |		Документ.НачислениеЗарплаты.Авансы КАК НачислениеЗарплатыАвансы
		                      |	ГДЕ
		                      |		НачислениеЗарплатыАвансы.Ссылка = &Ссылка
		                      |	
		                      |	СГРУППИРОВАТЬ ПО
		                      |		НачислениеЗарплатыАвансы.Сотрудник) КАК ВложенныйЗапрос
		                      |ГДЕ
		                      |	ВложенныйЗапрос.Сумма <> 0
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ВложенныйЗапрос.Сотрудник
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	ВложенныйЗапрос.Сотрудник.Наименование");
		Запрос.УстановитьПараметр("Ссылка", ДокНачисление);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьСтрокаДетали = Макет.ПолучитьОбласть("Детали");
		Индекс = 0;
		Пока Выборка.Следующий() Цикл
			Индекс = Индекс + 1;
			ОбластьСтрокаДетали.Параметры.НомерСтроки = Индекс;
			ОбластьСтрокаДетали.Параметры.ТабельныйНомер = Выборка.Сотрудник.Код;
			ОбластьСтрокаДетали.Параметры.ХарактерРаботы = "Осн.";
			ОбластьСтрокаДетали.Параметры.Физлицо = Выборка.Сотрудник;
			ОбластьСтрокаДетали.Параметры.Сумма = Выборка.Сумма;
			ТабличныйДокумент.Вывести(ОбластьСтрокаДетали);
			
		КонецЦикла;
		
		ОбластьПодвала = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьПодвала);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФормуКО2()

// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция СформироватьПечатнуюФормуРасшифровкаНачисленияПодробно(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НачислениеЗарплаты.ПФ_MXL_РасшифровкаНачисленияПодробно");
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	НачислениеЗарплатыЗатраты.Ссылка,
	                      |	НачислениеЗарплатыЗатраты.Ссылка.СтруктурнаяЕдиница,
	                      |	НАЧАЛОПЕРИОДА(НачислениеЗарплатыЗатраты.Дата, ДЕНЬ) КАК Дата,
	                      |	НачислениеЗарплатыЗатраты.ВидНачисления КАК ВидНачисления,
	                      |	НачислениеЗарплатыЗатраты.Контрагент,
	                      |	НачислениеЗарплатыЗатраты.Сотрудник,
	                      |	НачислениеЗарплатыЗатраты.Номенклатура,
	                      |	НачислениеЗарплатыЗатраты.План,
	                      |	НачислениеЗарплатыЗатраты.Факт,
	                      |	НачислениеЗарплатыЗатраты.База,
	                      |	НачислениеЗарплатыЗатраты.Размер,
	                      |	НачислениеЗарплатыЗатраты.Сумма
	                      |ИЗ
	                      |	Документ.НачислениеЗарплаты.Затраты КАК НачислениеЗарплатыЗатраты
	                      |ГДЕ
	                      |	НачислениеЗарплатыЗатраты.Ссылка.Проведен = ИСТИНА
	                      |	И НачислениеЗарплатыЗатраты.Ссылка В(&МассивОбъектов)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
						  |	Сотрудник,
	                      |	Дата,
	                      |	ВидНачисления");
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Область = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(Область);
	Иначе
		
		Пока Выборка.СледующийПоЗначениюПоля("Сотрудник") Цикл
			
			Область = Макет.ПолучитьОбласть("Заголовок");
			Область.Параметры.Заполнить(Выборка);
			Область.Параметры.РасчетнаяДата = "с: " + Формат(Выборка.Ссылка.ДатаНачалаПериода, "ДФ=dd.MM.yy") + " по: " + Формат(Выборка.Ссылка.ДатаОкончанияПериода, "ДФ=dd.MM.yy");
			ТабличныйДокумент.Вывести(Область);
			
			Область = Макет.ПолучитьОбласть("Шапка");
			ТабличныйДокумент.Вывести(Область);
			
			СуммаНачисленияИтого = 0;
			СуммаУдержанияИтого = 0;
			
			ВыборкаПоДате = Выборка;
			Пока ВыборкаПоДате.СледующийПоЗначениюПоля("Дата") Цикл
				
				НомерСтрокиТаблицыС = ТабличныйДокумент.ВысотаТаблицы;
				
				ВыборкаДетально = ВыборкаПоДате;
				Пока ВыборкаДетально.Следующий() Цикл
					
					Область = Макет.ПолучитьОбласть("СтрокаЗначений");
					Область.Параметры.Заполнить(ВыборкаДетально);
					Если Область.Параметры.Сумма <> Окр(ВыборкаДетально.Сумма, 2) Тогда
						Область.Параметры.Сумма = Формат(Окр(ВыборкаДетально.Сумма, 2), "ЧЦ=15; ЧДЦ=2") + "..";
					КонецЕсли;
					
					ИмяРеквизита = "";
					Если ТипЗнч(ВыборкаДетально.ВидНачисления) = Тип("СправочникСсылка.НачисленияИУдержанияСотрудников") Тогда 
						ИмяРеквизита = "НачислениеУдержание";
					Иначе 
						ИмяРеквизита = "ТипНачисленияУдержания";
					КонецЕсли;
					
					Если ВыборкаДетально.ВидНачисления[ИмяРеквизита] = Перечисления.ТипыНачисленийУдержаний.Начисление Тогда
						СуммаНачисленияИтого = СуммаНачисленияИтого + Выборка.Сумма;
					Иначе
						СуммаУдержанияИтого = СуммаУдержанияИтого + -1 * Выборка.Сумма;
					КонецЕсли;
					
					ТабличныйДокумент.Вывести(Область);
					
				КонецЦикла;
				
				ТабличныйДокумент.Область(НомерСтрокиТаблицыС + 1, 1, ТабличныйДокумент.ВысотаТаблицы, 1).Объединить();
				
			КонецЦикла;
			
			Область = Макет.ПолучитьОбласть("Итог");
			Область.Параметры.СуммаНачисленияИтого = СуммаНачисленияИтого;
			Область.Параметры.СуммаУдержанияИтого = СуммаУдержанияИтого;
			Область.Параметры.СуммаИтого = СуммаНачисленияИтого - СуммаУдержанияИтого;
			ТабличныйДокумент.Вывести(Область);
			
		КонецЦикла;
	КонецЕсли;
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФормуРасшифровкаНачисления()

// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция СформироватьПечатнуюФормуРасшифровкаНачисления(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НачислениеЗарплаты.ПФ_MXL_РасшифровкаНачисления");
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	НачислениеЗарплатыЗатраты.Ссылка КАК Ссылка,
	                      |	НачислениеЗарплатыЗатраты.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	                      |	НАЧАЛОПЕРИОДА(НачислениеЗарплатыЗатраты.Дата, ДЕНЬ) КАК Дата,
	                      |	НачислениеЗарплатыЗатраты.ВидНачисления КАК ВидНачисления,
	                      |	НачислениеЗарплатыЗатраты.Сотрудник КАК Сотрудник,
	                      |	НачислениеЗарплатыЗатраты.Номенклатура КАК Номенклатура,
	                      |	МАКСИМУМ(НачислениеЗарплатыЗатраты.План) КАК План,
	                      |	СУММА(НачислениеЗарплатыЗатраты.Факт) КАК Факт,
	                      |	СУММА(НачислениеЗарплатыЗатраты.База) КАК База,
	                      |	НачислениеЗарплатыЗатраты.Размер КАК Размер,
	                      |	СУММА(НачислениеЗарплатыЗатраты.Сумма) КАК Сумма
	                      |ИЗ
	                      |	Документ.НачислениеЗарплаты.Затраты КАК НачислениеЗарплатыЗатраты
	                      |ГДЕ
	                      |	НачислениеЗарплатыЗатраты.Ссылка.Проведен = ИСТИНА
	                      |	И НачислениеЗарплатыЗатраты.Ссылка В(&МассивОбъектов)
	                      |	И НачислениеЗарплатыЗатраты.ВидНачисления.ТипНачисленияУдержания <> ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийУдержаний.Оклад)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	НачислениеЗарплатыЗатраты.Ссылка,
	                      |	НачислениеЗарплатыЗатраты.Ссылка.СтруктурнаяЕдиница,
	                      |	НАЧАЛОПЕРИОДА(НачислениеЗарплатыЗатраты.Дата, ДЕНЬ),
	                      |	НачислениеЗарплатыЗатраты.ВидНачисления,
	                      |	НачислениеЗарплатыЗатраты.Сотрудник,
	                      |	НачислениеЗарплатыЗатраты.Номенклатура,
	                      |	НачислениеЗарплатыЗатраты.Размер
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	НачислениеЗарплатыЗатраты.Ссылка,
	                      |	НачислениеЗарплатыЗатраты.Ссылка.СтруктурнаяЕдиница,
	                      |	МАКСИМУМ(НАЧАЛОПЕРИОДА(НачислениеЗарплатыЗатраты.Дата, ДЕНЬ)),
	                      |	НачислениеЗарплатыЗатраты.ВидНачисления,
	                      |	НачислениеЗарплатыЗатраты.Сотрудник,
	                      |	НачислениеЗарплатыЗатраты.Номенклатура,
	                      |	НачислениеЗарплатыЗатраты.План,
	                      |	СУММА(НачислениеЗарплатыЗатраты.Факт),
	                      |	НачислениеЗарплатыЗатраты.База,
	                      |	НачислениеЗарплатыЗатраты.Размер,
	                      |	СУММА(НачислениеЗарплатыЗатраты.Сумма)
	                      |ИЗ
	                      |	Документ.НачислениеЗарплаты.Затраты КАК НачислениеЗарплатыЗатраты
	                      |ГДЕ
	                      |	НачислениеЗарплатыЗатраты.Ссылка.Проведен = ИСТИНА
	                      |	И НачислениеЗарплатыЗатраты.Ссылка В(&МассивОбъектов)
	                      |	И НачислениеЗарплатыЗатраты.ВидНачисления.ТипНачисленияУдержания = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийУдержаний.Оклад)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	НачислениеЗарплатыЗатраты.Ссылка,
	                      |	НачислениеЗарплатыЗатраты.Ссылка.СтруктурнаяЕдиница,
	                      |	НачислениеЗарплатыЗатраты.ВидНачисления,
	                      |	НачислениеЗарплатыЗатраты.Сотрудник,
	                      |	НачислениеЗарплатыЗатраты.Номенклатура,
	                      |	НачислениеЗарплатыЗатраты.План,
	                      |	НачислениеЗарплатыЗатраты.База,
	                      |	НачислениеЗарплатыЗатраты.Размер
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	НачислениеЗарплатыЗатраты.Сотрудник,
	                      |	Дата,
	                      |	НачислениеЗарплатыЗатраты.ВидНачисления");
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Не Выборка.Следующий() Тогда
		Область = Макет.ПолучитьОбласть("Заголовок"); 
		ТабличныйДокумент.Вывести(Область); 
	Иначе
		Пока Выборка.СледующийПоЗначениюПоля("Сотрудник") Цикл
			
			Область = Макет.ПолучитьОбласть("Заголовок");
			Область.Параметры.Заполнить(Выборка);
			Область.Параметры.РасчетнаяДата = "с: " + Формат(Выборка.Ссылка.ДатаНачалаПериода, "ДФ=dd.MM.yy") + " по: " + Формат(Выборка.Ссылка.ДатаОкончанияПериода, "ДФ=dd.MM.yy");
			ТабличныйДокумент.Вывести(Область);
			
			Область = Макет.ПолучитьОбласть("Шапка");
			ТабличныйДокумент.Вывести(Область);
			
			СуммаНачисленияИтого = 0;
			СуммаУдержанияИтого = 0;
			ПредыдущаяДата = Дата(01, 01, 01);
			
			ВыборкаПоДате = Выборка;
			Пока ВыборкаПоДате.СледующийПоЗначениюПоля("Дата") Цикл
				
				НомерСтрокиТаблицыС = ТабличныйДокумент.ВысотаТаблицы;
				
				ВыборкаДетально = ВыборкаПоДате;
				Пока ВыборкаДетально.Следующий() Цикл
					
					Область = Макет.ПолучитьОбласть("СтрокаЗначений");
					Область.Параметры.Заполнить(ВыборкаДетально);
					Если Область.Параметры.Сумма <> Окр(ВыборкаДетально.Сумма, 2) Тогда
						Область.Параметры.Сумма = Формат(Окр(ВыборкаДетально.Сумма, 2), "ЧЦ=15; ЧДЦ=2") + "..";
					КонецЕсли;
					
					ИмяРеквизита = "";
					Если ТипЗнч(ВыборкаДетально.ВидНачисления) = Тип("СправочникСсылка.НачисленияИУдержанияСотрудников") Тогда 
						ИмяРеквизита = "НачислениеУдержание";
					Иначе 
						ИмяРеквизита = "ТипНачисленияУдержания";
					КонецЕсли;
					
					Если ВыборкаДетально.ВидНачисления[ИмяРеквизита] = Перечисления.ТипыНачисленийУдержаний.Начисление Тогда
						СуммаНачисленияИтого = СуммаНачисленияИтого + Выборка.Сумма;
					Иначе
						СуммаУдержанияИтого = СуммаУдержанияИтого + -1 * Выборка.Сумма;
					КонецЕсли;
					
					ТабличныйДокумент.Вывести(Область);
					
				КонецЦикла;
				
				ТабличныйДокумент.Область(НомерСтрокиТаблицыС + 1, 1, ТабличныйДокумент.ВысотаТаблицы, 1).Объединить();
				
			КонецЦикла;
			
			Область = Макет.ПолучитьОбласть("Итог");
			Область.Параметры.СуммаНачисленияИтого = СуммаНачисленияИтого;
			Область.Параметры.СуммаУдержанияИтого = СуммаУдержанияИтого;
			Область.Параметры.СуммаИтого = СуммаНачисленияИтого - СуммаУдержанияИтого;
			ТабличныйДокумент.Вывести(Область);
			
		КонецЦикла;
	КонецЕсли;
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФормуРасшифровкаНачисления()

// Процедура печати документа.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_РасчетныйЛисток") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ПФ_MXL_РасчетныйЛисток",
		"Расходный кассовый ордер",
		СформироватьПечатнуюФорму(МассивОбъектов, ОбъектыПечати)
		);
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПлатежнаяВедомость") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ПФ_MXL_ПлатежнаяВедомость",
		"Расходный кассовый ордер",
		СформироватьПечатнуюФормуПлатежнаяВедомость(МассивОбъектов, ОбъектыПечати)
		);
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_РасшифровкаНачисленияПодробно") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_РасшифровкаНачисленияПодробно", "Расшифровка начисления (подробно)",
				СформироватьПечатнуюФормуРасшифровкаНачисленияПодробно(МассивОбъектов, ОбъектыПечати));		
				
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_РасшифровкаНачисления") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_РасшифровкаНачисления", "Расшифровка начисления",
				СформироватьПечатнуюФормуРасшифровкаНачисления(МассивОбъектов, ОбъектыПечати));		
				
	КонецЕсли;
	
КонецПроцедуры // Печать()

// Функция получения списка печатных форм.
//
Функция ПолучитьСписокПечатныхФорм() Экспорт
	
	Список = Новый СписокЗначений;
	Список.Добавить("ПФ_MXL_ПлатежнаяВедомость", "Платежная ведомость", , БиблиотекаКартинок.Документ);
	Список.Добавить("ПФ_MXL_РасчетныйЛисток", "Расчетные листки", , БиблиотекаКартинок.Документ);
	Список.Добавить("ПФ_MXL_РасшифровкаНачисления", "Расшифровка начисления", , БиблиотекаКартинок.Документ);
	Список.Добавить("ПФ_MXL_РасшифровкаНачисленияПодробно", "Расшифровка начисления (подробно)", , БиблиотекаКартинок.Документ);
		
	Возврат Список;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ РАСЧЕТА НАЧИСЛЕНИЙ/УДЕРЖАНИЙ

// Процедура - обработчик команды формы "ЗаполнитьНаСервере".
//
Процедура ЗаполнитьТаблицуАвансов(Объект, СтруктурнаяЕдиница, МесяцНачисления, МассивСотрудников, ИсключитьРегистратор) Экспорт
	
	// Заполнить таблицу "Авансы"
	ЗапросВыборка = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                             |	ВложенныйЗапрос.Сотрудник,
	                             |	-ВложенныйЗапрос.Сумма КАК Сумма
	                             |ИЗ
	                             |	(ВЫБРАТЬ
	                             |		РасчетыСПерсоналомОбороты.Сотрудник КАК Сотрудник,
	                             |		РасчетыСПерсоналомОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	                             |		СУММА(РасчетыСПерсоналомОбороты.СуммаОборот) КАК Сумма,
	                             |		РасчетыСПерсоналомОбороты.ДокументНачисления КАК ДокументНачисления
	                             |	ИЗ
	                             |		РегистрНакопления.РасчетыСПерсоналом.Обороты(
	                             |				,
	                             |				,
	                             |				Авто,
	                             |				МесяцНачисления = &МесяцНачисления
	                             |					И ДокументНачисления = ЗНАЧЕНИЕ(Документ.НачислениеЗарплаты.ПустаяСсылка)
	                             |					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                             |					И Сотрудник В (&МассивСотрудников)) КАК РасчетыСПерсоналомОбороты
	                             |	ГДЕ
	                             |		НЕ РасчетыСПерсоналомОбороты.Регистратор = &ИсключитьРегистратор
	                             |	
	                             |	СГРУППИРОВАТЬ ПО
	                             |		РасчетыСПерсоналомОбороты.Сотрудник,
	                             |		РасчетыСПерсоналомОбороты.СтруктурнаяЕдиница,
	                             |		РасчетыСПерсоналомОбороты.ДокументНачисления) КАК ВложенныйЗапрос
	                             |ГДЕ
	                             |	ВложенныйЗапрос.Сумма < 0");
								 
	ЗапросВыборка.УстановитьПараметр("МесяцНачисления"     ,МесяцНачисления);
	ЗапросВыборка.УстановитьПараметр("СтруктурнаяЕдиница"  ,СтруктурнаяЕдиница);
    ЗапросВыборка.УстановитьПараметр("ИсключитьРегистратор",ИсключитьРегистратор);
	ЗапросВыборка.УстановитьПараметр("МассивСотрудников"   ,МассивСотрудников);
    Результат = ЗапросВыборка.Выполнить().Выгрузить();
	
    Объект.Авансы.Загрузить(Результат);	
	
КонецПроцедуры

// Процедура - обработчик команды формы "РассчитатьНаСервере".
//
Процедура РассчитатьЗарплатуПоДокументу(Объект) Экспорт
	
	Объект.Затраты.Очистить();
	
	Для Каждого СтрокаТЧ Из Объект.РасчетЗарплаты Цикл
		
		СтрокаТЧ.Описание = СтрокаТЧ.НачислениеУдержание.ПолноеНаименование;		
		
		ТаблицаРасшифровкиНачислений = РассчитатьЗарплатуПоНачислению(СтрокаТЧ.НачислениеУдержание, СтрокаТЧ.ПериодС, СтрокаТЧ.ПериодПо, ?(СтрокаТЧ.ВычисляетсяВручную, СтрокаТЧ, Неопределено));
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаРасшифровкиНачислений, Объект.Затраты);
		Объект.Затраты.Сортировать("Сотрудник, Дата, ВидНачисления");
		
		ИмяВремени = ?(СтрокаТЧ.НачислениеУдержание.ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Тариф И СтрокаТЧ.НачислениеУдержание.ТипТарифа = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаЧас
			ИЛИ СтрокаТЧ.НачислениеУдержание.ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Тариф И СтрокаТЧ.НачислениеУдержание.ТипТарифа = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаЧасАссистирования
			ИЛИ СтрокаТЧ.НачислениеУдержание.ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Оклад И СтрокаТЧ.НачислениеУдержание.ЗависимостьОтВыработки = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗависитОтВыработки И СтрокаТЧ.НачислениеУдержание.ТипПериодаНачисления = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоЧасам, "Часов", "Дней");
		// Если СтрокаТЧ.ВычисляетсяВручную Тогда
		//	СтрокаТЧ.Сумма = ТаблицаРасшифровкиНачислений.Итог("Сумма");
		// Иначе
			СтрокаТЧ.ЧасовПлан = 0; СтрокаТЧ.ДнейПлан = 0; СтрокаТЧ.ЧасовФакт = 0; СтрокаТЧ.ДнейФакт = 0;		
			СтрокаТЧ[ИмяВремени + "План"] = ?(ТаблицаРасшифровкиНачислений.Количество() > 0, ТаблицаРасшифровкиНачислений[0].План, 0);
			СтрокаТЧ[ИмяВремени + "Факт"] = ТаблицаРасшифровкиНачислений.Итог("Факт");
			СтрокаТЧ.База = ТаблицаРасшифровкиНачислений.Итог("База");			
			СтрокаТЧ.Размер = ?(ТаблицаРасшифровкиНачислений.Количество() > 0, ТаблицаРасшифровкиНачислений[0].Размер, СтрокаТЧ.НачислениеУдержание.Размер);
			СтрокаТЧ.Сумма = ТаблицаРасшифровкиНачислений.Итог("Сумма");
		// КонецЕсли;
		   
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из Объект.ПрочиеНачисленияИУдержания Цикл
		НоваяСтрока = Объект.Затраты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		НоваяСтрока.ВидНачисления 	= СтрокаТЧ.Начисление;
		НоваяСтрока.Размер 			= СтрокаТЧ.Сумма
	КонецЦикла;
	
	// Обрабатываем суммы начислений которые в группах
	МассивУдаляемыхНачислений = Новый Массив;
	Для Каждого СтрокаТЧ Из Объект.РасчетЗарплаты Цикл
		МассивПоРодителю = Новый Массив;
		Для Каждого СтрокаТЧВрем Из Объект.РасчетЗарплаты Цикл
			Если Не СтрокаТЧ.НачислениеУдержание.Родитель.Пустая() И СтрокаТЧВрем.НачислениеУдержание.Родитель = СтрокаТЧ.НачислениеУдержание.Родитель Тогда
				МассивПоРодителю.Добавить(СтрокаТЧВрем);
			КонецЕсли;
		КонецЦикла;
		Если МассивПоРодителю.Количество() >= 2 Тогда
			СтрокаПодходящегоВГруппе = Неопределено;
			Для Каждого СтрокаТЧВрем Из МассивПоРодителю Цикл
				Если СтрокаПодходящегоВГруппе = Неопределено Тогда
					СтрокаПодходящегоВГруппе = СтрокаТЧВрем;					
				Иначе
					Если СтрокаПодходящегоВГруппе.НачислениеУдержание.Родитель.ВариантИспользования = Перечисления.ВариантыИспользования.Максимум И СтрокаПодходящегоВГруппе.Сумма < СтрокаТЧВрем.Сумма
							ИЛИ СтрокаПодходящегоВГруппе.НачислениеУдержание.Родитель.ВариантИспользования = Перечисления.ВариантыИспользования.Минимум И СтрокаПодходящегоВГруппе.Сумма > СтрокаТЧВрем.Сумма Тогда
						МассивУдаляемыхНачислений.Добавить(СтрокаПодходящегоВГруппе.НачислениеУдержание);
						СтрокаПодходящегоВГруппе = СтрокаТЧВрем;
					Иначе
						МассивУдаляемыхНачислений.Добавить(СтрокаТЧВрем.НачислениеУдержание);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	// Удаляем строки которые неподошли по условиям группировок
	Для Каждого УдаляемоеНачисление Из МассивУдаляемыхНачислений Цикл
		Если Объект.РасчетЗарплаты.НайтиСтроки(Новый Структура("НачислениеУдержание", УдаляемоеНачисление)) <> Неопределено Тогда
			ПервоначальноеКоличество = Объект.РасчетЗарплаты.Количество();
			Для а = 1 По ПервоначальноеКоличество Цикл
				Если Объект.РасчетЗарплаты[ПервоначальноеКоличество - а].НачислениеУдержание = УдаляемоеНачисление Тогда
					Объект.РасчетЗарплаты.Удалить(ПервоначальноеКоличество - а);
				КонецЕсли;
			КонецЦикла;			
		КонецЕсли;		
		Если Объект.Затраты.НайтиСтроки(Новый Структура("ВидНачисления", УдаляемоеНачисление)) <> Неопределено Тогда
			ПервоначальноеКоличество = Объект.Затраты.Количество();
			Для а = 1 По ПервоначальноеКоличество Цикл
				Если Объект.Затраты[ПервоначальноеКоличество - а].ВидНачисления = УдаляемоеНачисление Тогда
					Объект.Затраты.Удалить(ПервоначальноеКоличество - а);
				КонецЕсли;
			КонецЦикла;			
		КонецЕсли;
	КонецЦикла;
	
	Объект.СуммаДокумента = Объект.РасчетЗарплаты.Итог("Сумма") + Объект.ПрочиеНачисленияИУдержания.Итог("Сумма");	
	
КонецПроцедуры // РассчитатьНаСервере()

// Процедура - производит проверку вида начисления, в зависимости от которого будет происходить начисление заработной платы
//
Функция РассчитатьЗарплатуПоНачислению(НачислениеУдержание, ПериодС, ПериодПо, СтруктураПереопределенияБазы = Неопределено) Экспорт
	
	ТаблицаРасшифровкиНачислений = Документы.НачислениеЗарплаты.СоздатьДокумент().Затраты.ВыгрузитьКолонки();
	
	Если НачислениеУдержание.НачислениеУдержание = Перечисления.ТипыНачисленийУдержаний.Начисление Тогда
		Если НачислениеУдержание.ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Процент Тогда
			РасчетыПоПроцентномуНачислению(ТаблицаРасшифровкиНачислений, НачислениеУдержание, ПериодС, ПериодПо, СтруктураПереопределенияБазы);
		ИначеЕсли НачислениеУдержание.ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Оклад Тогда
			РасчетыПоОкладу(ТаблицаРасшифровкиНачислений, НачислениеУдержание, ПериодС, ПериодПо, СтруктураПереопределенияБазы);
		ИначеЕсли НачислениеУдержание.ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Тариф Тогда			
			РасчетыПоТарифу(ТаблицаРасшифровкиНачислений, НачислениеУдержание, ПериодС, ПериодПо, СтруктураПереопределенияБазы);
		КонецЕсли;
	Иначе
		РасчетыПоУдержанию(ТаблицаРасшифровкиНачислений, НачислениеУдержание, ПериодС, ПериодПо, СтруктураПереопределенияБазы);
	КонецЕсли;
	
	Возврат ТаблицаРасшифровкиНачислений;
	
КонецФункции // ПроверкаВидаНачисления()

// Производится расчет ЗП при установленной виде начисления "Процент"
//
Процедура РасчетыПоПроцентномуНачислению(ТаблицаРасшифровкиНачислений, НачислениеУдержание, ПериодС, ПериодПо, СтруктураПереопределенияБазы = Неопределено)
	
	Если СтруктураПереопределенияБазы <> Неопределено Тогда
		ДобавитьРасшифровкуНачисленияВЗатраты(ТаблицаРасшифровкиНачислений, НачислениеУдержание, ПериодПо, , , ,
						, , СтруктураПереопределенияБазы.База, СтруктураПереопределенияБазы.Размер, СтруктураПереопределенияБазы.База * СтруктураПереопределенияБазы.Размер / 100);
		Возврат;
	КонецЕсли;
	
	// Получаем временную таблицу проданных товаров и услуг
	ЗапросПоПродажам = Новый Запрос;
	
	Если НачислениеУдержание.УчитываяТолькоОплаченныеПродажи = Ложь Тогда
		ЗапросПоПродажам.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                         |	ПродажиОбороты.ПериодСекунда КАК Дата,
		                         |	ПродажиОбороты.ДокументПродажи КАК Документ,
		                         |	ПродажиОбороты.Контрагент КАК Контрагент,
		                         |	ПродажиОбороты.Номенклатура КАК Номенклатура,
		                         |	ВЫБОР
		                         |		КОГДА &ИспользоватьСкидки = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоВидуЦен)
		                         |			ТОГДА ЕСТЬNULL(ЦеныНоменклатурыОстатки.Цена, 0) * ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0)
		                         |		КОГДА &ИспользоватьСкидки = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.СоСкидкой)
		                         |			ТОГДА ПродажиОбороты.СтоимостьОборот
		                         |		ИНАЧЕ ПродажиОбороты.СтоимостьБезСкидкиОборот
		                         |	КОНЕЦ - ВЫБОР
		                         |		КОГДА &УчитыватьМатериалы = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.УчитыватьСебестоимостьТовара)
		                         |			ТОГДА ЕСТЬNULL(СебестоимостьОбороты.СтоимостьОборот, 0)
		                         |		ИНАЧЕ 0
		                         |	КОНЕЦ КАК Сумма,
		                         |	ЛОЖЬ КАК СписаниеПоМатериалам
		                         |ИЗ
		                         |	РегистрНакопления.Продажи.Обороты(
		                         |			&НачалоПериода,
		                         |			&КонецПериода,
		                         |			Авто,
		                         |			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		                         |				И ВЫБОР
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСтоматологии)
		                         |						ТОГДА ИСТИНА
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотруднику)
		                         |						ТОГДА Сотрудник = &Сотрудник
		                         |								ИЛИ Ассистент = &Сотрудник
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеВрача)
		                         |						ТОГДА Сотрудник = &Сотрудник
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеАссистента)
		                         |						ТОГДА Ассистент = &Сотрудник
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеЗубногоТехника)
		                         |						ТОГДА ЗубнойТехник = &Сотрудник
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПродажиОформленныхСотрудником)
		                         |						ТОГДА ВЫБОР
		                         |								КОГДА ТИПЗНАЧЕНИЯ(ДокументПродажи) В (ТИП(Документ.Реализация), ТИП(Документ.ВозвратОтПокупателя), ТИП(Документ.Прием))
		                         |									ТОГДА ДокументПродажи.Сотрудник = &Сотрудник
		                         |								ИНАЧЕ ЛОЖЬ
		                         |							КОНЕЦ
		                         |					ИНАЧЕ ИСТИНА
		                         |				КОНЕЦ
		                         |				И ВЫБОР
		                         |					КОГДА ТИПЗНАЧЕНИЯ(ДокументПродажи) = ТИП(Документ.Прием)
		                         |							И &УсловиеПоМедПолисамПриема = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.СМедПолисом)
		                         |						ТОГДА ДокументПродажи.ПолисМедСтрахования <> ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
		                         |					КОГДА ТИПЗНАЧЕНИЯ(ДокументПродажи) = ТИП(Документ.Прием)
		                         |							И &УсловиеПоМедПолисамПриема = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.БезМедПолиса)
		                         |						ТОГДА ДокументПродажи.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
		                         |					ИНАЧЕ ИСТИНА
		                         |				КОНЕЦ
		                         |				И ВЫБОР
		                         |					КОГДА &СегментНоменклатуры <> ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
		                         |						ТОГДА Номенклатура В
		                         |								(ВЫБРАТЬ
		                         |									РегистрСведений.НоменклатураСегмента.Номенклатура
		                         |								ИЗ
		                         |									РегистрСведений.НоменклатураСегмента
		                         |								ГДЕ
		                         |									РегистрСведений.НоменклатураСегмента.Сегмент = &СегментНоменклатуры)
		                         |					ИНАЧЕ ИСТИНА
		                         |				КОНЕЦ
		                         |				И ВЫБОР
		                         |					КОГДА &СегментКонтрагента <> ЗНАЧЕНИЕ(Справочник.СегментыКонтрагентов.ПустаяСсылка)
		                         |						ТОГДА Контрагент В
		                         |								(ВЫБРАТЬ
		                         |									РегистрСведений.КонтрагентыСегмента.Контрагент
		                         |								ИЗ
		                         |									РегистрСведений.КонтрагентыСегмента
		                         |								ГДЕ
		                         |									РегистрСведений.КонтрагентыСегмента.Сегмент = &СегментКонтрагента)
		                         |					ИНАЧЕ ИСТИНА
		                         |				КОНЕЦ) КАК ПродажиОбороты
		                         |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиСебестоимость.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК СебестоимостьОбороты
		                         |		ПО (СебестоимостьОбороты.ДокументПродажи = ПродажиОбороты.ДокументПродажи)
		                         |			И (СебестоимостьОбороты.Номенклатура = ПродажиОбороты.Номенклатура)
		                         |			И (СебестоимостьОбороты.Сотрудник = ПродажиОбороты.Сотрудник)
		                         |			И (СебестоимостьОбороты.Ассистент = ПродажиОбороты.Ассистент)
		                         |			И (СебестоимостьОбороты.Контрагент = ПродажиОбороты.Контрагент)
		                         |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		                         |				&КонецПериода,
		                         |				Актуальность = ИСТИНА
		                         |					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		                         |					И ВидЦен = &ВидЦенСуммы
		                         |					И Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)) КАК ЦеныНоменклатурыОстатки
		                         |		ПО (ЦеныНоменклатурыОстатки.Номенклатура = ПродажиОбороты.Номенклатура)
		                         |
		                         |ОБЪЕДИНИТЬ ВСЕ
		                         |
		                         |ВЫБРАТЬ
		                         |	ПродажиСебестоимостьОбороты.ПериодСекунда,
		                         |	ПродажиСебестоимостьОбороты.ДокументПродажи,
		                         |	ПродажиСебестоимостьОбороты.Контрагент,
		                         |	ПродажиСебестоимостьОбороты.Номенклатура,
		                         |	-1 * ВЫБОР
		                         |		КОГДА &ТипЦен = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоЗакупочнойЦене)
		                         |			ТОГДА ЕСТЬNULL(ПродажиСебестоимостьОбороты.СтоимостьОборот, 0)
		                         |		ИНАЧЕ ПродажиСебестоимостьОбороты.КоличествоОборот * (ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) / ВЫБОР
		                         |				КОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент, 0) = 0
		                         |					ТОГДА 1
		                         |				ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент
		                         |			КОНЕЦ)
		                         |	КОНЕЦ,
		                         |	ИСТИНА
		                         |ИЗ
		                         |	РегистрНакопления.ПродажиСебестоимость.Обороты(
		                         |			&НачалоПериода,
		                         |			&КонецПериода,
		                         |			Авто,
		                         |			Материал <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		                         |				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		                         |				И ВЫБОР
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотруднику)
		                         |						ТОГДА Сотрудник = &Сотрудник
		                         |								ИЛИ Ассистент = &Сотрудник
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеВрача)
		                         |						ТОГДА Сотрудник = &Сотрудник
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеАссистента)
		                         |						ТОГДА Ассистент = &Сотрудник
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеЗубногоТехника)
		                         |						ТОГДА ЗубнойТехник = &Сотрудник
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПродажиОформленныхСотрудником)
		                         |						ТОГДА ВЫБОР
		                         |								КОГДА ТИПЗНАЧЕНИЯ(ДокументПродажи) В (ТИП(Документ.Реализация), ТИП(Документ.ВозвратОтПокупателя), ТИП(Документ.Прием))
		                         |									ТОГДА ДокументПродажи.Сотрудник = &Сотрудник
		                         |								ИНАЧЕ ЛОЖЬ
		                         |							КОНЕЦ
		                         |					ИНАЧЕ ИСТИНА
		                         |				КОНЕЦ
		                         |				И ВЫБОР
		                         |					КОГДА ТИПЗНАЧЕНИЯ(ДокументПродажи) = ТИП(Документ.Прием)
		                         |							И &УсловиеПоМедПолисамПриема = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.СМедПолисом)
		                         |						ТОГДА ДокументПродажи.ПолисМедСтрахования <> ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
		                         |					КОГДА ТИПЗНАЧЕНИЯ(ДокументПродажи) = ТИП(Документ.Прием)
		                         |							И &УсловиеПоМедПолисамПриема = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.БезМедПолиса)
		                         |						ТОГДА ДокументПродажи.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
		                         |					ИНАЧЕ ИСТИНА
		                         |				КОНЕЦ
		                         |				И ВЫБОР
		                         |					КОГДА &СегментНоменклатуры <> ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
		                         |						ТОГДА Номенклатура В
		                         |								(ВЫБРАТЬ
		                         |									РегистрСведений.НоменклатураСегмента.Номенклатура
		                         |								ИЗ
		                         |									РегистрСведений.НоменклатураСегмента
		                         |								ГДЕ
		                         |									РегистрСведений.НоменклатураСегмента.Сегмент = &СегментНоменклатуры)
		                         |					ИНАЧЕ ИСТИНА
		                         |				КОНЕЦ) КАК ПродажиСебестоимостьОбороты
		                         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                         |			ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка.Номенклатура КАК Номенклатура,
		                         |			МИНИМУМ(ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка.Упаковка) КАК Упаковка
		                         |		ИЗ
		                         |			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		                         |					&КонецПериода,
		                         |					Актуальность = ИСТИНА
		                         |						И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		                         |						И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка
		                         |		
		                         |		СГРУППИРОВАТЬ ПО
		                         |			ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка.Номенклатура) КАК ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка
		                         |		ПО ПродажиСебестоимостьОбороты.Материал = ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка.Номенклатура
		                         |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		                         |				&КонецПериода,
		                         |				Актуальность = ИСТИНА
		                         |					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		                         |					И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних
		                         |		ПО ПродажиСебестоимостьОбороты.Материал = ЦеныНоменклатурыСрезПоследних.Номенклатура
		                         |			И (ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка.Упаковка = ЦеныНоменклатурыСрезПоследних.Упаковка)
		                         |ГДЕ
		                         |	&УчитыватьМатериалы = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.УчитыватьСтоимостьМатериалов)
		                         |
		                         |ОБЪЕДИНИТЬ ВСЕ
		                         |
		                         |ВЫБРАТЬ
		                         |	ПартииТоваровОбороты.ПериодСекунда,
		                         |	ПартииТоваровОбороты.Регистратор,
		                         |	NULL,
		                         |	ПартииТоваровОбороты.Номенклатура,
		                         |	-1 * ВЫБОР
		                         |		КОГДА &ТипЦен = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоЗакупочнойЦене)
		                         |			ТОГДА ЕСТЬNULL(ПартииТоваровОбороты.СтоимостьОборот, 0)
		                         |		ИНАЧЕ ПартииТоваровОбороты.КоличествоОборот * (ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) / ВЫБОР
		                         |				КОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент, 0) = 0
		                         |					ТОГДА 1
		                         |				ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент
		                         |			КОНЕЦ)
		                         |	КОНЕЦ,
		                         |	ИСТИНА
		                         |ИЗ
		                         |	РегистрНакопления.ПартииТоваров.Обороты(
		                         |			&НачалоПериода,
		                         |			&КонецПериода,
		                         |			Авто,
		                         |			ТИПЗНАЧЕНИЯ(Склад) = ТИП(Справочник.Сотрудники)
		                         |				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		                         |				И ВЫБОР
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотруднику)
		                         |							ИЛИ &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПродажиОформленныхСотрудником)
		                         |						ТОГДА Склад = &Сотрудник
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеВрача)
		                         |						ТОГДА Склад = &Сотрудник
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеАссистента)
		                         |						ТОГДА ЛОЖЬ
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеЗубногоТехника)
		                         |						ТОГДА ЛОЖЬ
		                         |					ИНАЧЕ ИСТИНА
		                         |				КОНЕЦ
		                         |				И ВЫБОР
		                         |					КОГДА &СегментПередаваемыхМатериалов <> ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
		                         |						ТОГДА Номенклатура В
		                         |								(ВЫБРАТЬ
		                         |									РегистрСведений.НоменклатураСегмента.Номенклатура
		                         |								ИЗ
		                         |									РегистрСведений.НоменклатураСегмента
		                         |								ГДЕ
		                         |									РегистрСведений.НоменклатураСегмента.Сегмент = &СегментПередаваемыхМатериалов)
		                         |					ИНАЧЕ ИСТИНА
		                         |				КОНЕЦ) КАК ПартииТоваровОбороты
		                         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                         |			ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка.Номенклатура КАК Номенклатура,
		                         |			МИНИМУМ(ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка.Упаковка) КАК Упаковка
		                         |		ИЗ
		                         |			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		                         |					&КонецПериода,
		                         |					Актуальность = ИСТИНА
		                         |						И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		                         |						И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка
		                         |		
		                         |		СГРУППИРОВАТЬ ПО
		                         |			ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка.Номенклатура) КАК ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка
		                         |		ПО ПартииТоваровОбороты.Номенклатура = ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка.Номенклатура
		                         |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		                         |				&КонецПериода,
		                         |				Актуальность = ИСТИНА
		                         |					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		                         |					И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних
		                         |		ПО ПартииТоваровОбороты.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		                         |			И (ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка.Упаковка = ЦеныНоменклатурыСрезПоследних.Упаковка)
		                         |ГДЕ
		                         |	&УчитыватьМатериалы = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ВычитатьСтоимостьПереданныхСотрудникуМатериалов)
		                         |	И ТИПЗНАЧЕНИЯ(ПартииТоваровОбороты.Регистратор) = ТИП(Документ.ПеремещениеЗапасов)
		                         |
		                         |УПОРЯДОЧИТЬ ПО
		                         |	Дата
		                         |;
		                         |
		                         |////////////////////////////////////////////////////////////////////////////////
		                         |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                         |	ПродажиОбороты.ПериодСекунда КАК Дата,
		                         |	ПродажиОбороты.ДокументПродажи КАК Документ,
		                         |	ПродажиОбороты.Контрагент КАК Контрагент,
		                         |	ПродажиОбороты.Номенклатура КАК Номенклатура,
		                         |	ПродажиОбороты.СтоимостьОборот КАК Сумма
		                         |ИЗ
		                         |	РегистрНакопления.Продажи.Обороты(
		                         |			&НачалоПериода,
		                         |			&КонецПериода,
		                         |			Авто,
		                         |			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		                         |				И ВЫБОР
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСтоматологии)
		                         |						ТОГДА ИСТИНА
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотруднику)
		                         |						ТОГДА Сотрудник = &Сотрудник
		                         |								ИЛИ Ассистент = &Сотрудник
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеВрача)
		                         |						ТОГДА Сотрудник = &Сотрудник
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеАссистента)
		                         |						ТОГДА Ассистент = &Сотрудник
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеЗубногоТехника)
		                         |						ТОГДА ЗубнойТехник = &Сотрудник
		                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПродажиОформленныхСотрудником)
		                         |						ТОГДА ВЫБОР
		                         |								КОГДА ТИПЗНАЧЕНИЯ(ДокументПродажи) В (ТИП(Документ.Реализация), ТИП(Документ.ВозвратОтПокупателя), ТИП(Документ.Прием))
		                         |									ТОГДА ДокументПродажи.Сотрудник = &Сотрудник
		                         |								ИНАЧЕ ЛОЖЬ
		                         |							КОНЕЦ
		                         |					ИНАЧЕ ИСТИНА
		                         |				КОНЕЦ) КАК ПродажиОбороты
		                         |
		                         |УПОРЯДОЧИТЬ ПО
		                         |	ПродажиОбороты.ПериодСекунда";
							 
	Иначе
		
		ЗапросПоПродажам.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                         |	ПродажиОбороты.ПериодСекунда КАК Дата,
	                         |	ПродажиОбороты.ДокументПродажи КАК Документ,
	                         |	ПродажиОбороты.Контрагент КАК Контрагент,
	                         |	ПродажиОбороты.Номенклатура КАК Номенклатура,
	                         |	(ВЫБОР
	                         |		КОГДА &ИспользоватьСкидки = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоВидуЦен)
	                         |			ТОГДА ЕСТЬNULL(ЦеныНоменклатурыОстатки.Цена, 0) * ПродажиОбороты.КоличествоОборот
	                         |		КОГДА &ИспользоватьСкидки = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.СоСкидкой)
	                         |			ТОГДА ПродажиОбороты.СтоимостьОборот
	                         |		ИНАЧЕ ПродажиОбороты.СтоимостьБезСкидкиОборот
	                         |	КОНЕЦ - ВЫБОР
	                         |		КОГДА &УчитыватьМатериалы = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.УчитыватьСебестоимостьТовара)
	                         |			ТОГДА ЕСТЬNULL(СебестоимостьОбороты.СтоимостьОборот, 0)
	                         |		ИНАЧЕ 0
                     		 |	КОНЕЦ) * ВЫБОР 
						 	 |				КОГДА ЕСТЬNULL(ПродажиОбороты.ДокументПродажи.СуммаДокумента, 0) = 0 
						 	 |					ТОГДА 0
						 	 |				ИНАЧЕ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаПриход / ПродажиОбороты.ДокументПродажи.СуммаДокумента 							 
							 |			КОНЕЦ КАК Сумма,
	                         |	ЛОЖЬ КАК СписаниеПоМатериалам
	                         |ИЗ
	                         |	РегистрНакопления.Продажи.Обороты(
	                         |			,
	                         |			,
	                         |			Авто,
	                         |			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                         |				И ВЫБОР
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСтоматологии)
	                         |						ТОГДА ИСТИНА
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотруднику)
	                         |						ТОГДА Сотрудник = &Сотрудник ИЛИ Ассистент = &Сотрудник
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеВрача)
	                         |						ТОГДА Сотрудник = &Сотрудник
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеАссистента)
	                         |						ТОГДА Ассистент = &Сотрудник
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеЗубногоТехника)
	                         |						ТОГДА ЗубнойТехник = &Сотрудник							 
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПродажиОформленныхСотрудником)
	                         |						ТОГДА ВЫБОР 
							 |								КОГДА ТИПЗНАЧЕНИЯ(ДокументПродажи) В (ТИП(Документ.Реализация), ТИП(Документ.ВозвратОтПокупателя), ТИП(Документ.Прием))
	                         |							  		ТОГДА ДокументПродажи.Сотрудник = &Сотрудник
							 |								ИНАЧЕ ЛОЖЬ
							 |							  КОНЕЦ
	                         |					ИНАЧЕ ИСТИНА
	                         |				КОНЕЦ
	                         |				И ВЫБОР
	                         |					КОГДА ТИПЗНАЧЕНИЯ(ДокументПродажи) = ТИП(Документ.Прием) И &УсловиеПоМедПолисамПриема = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.СМедПолисом)
	                         |						ТОГДА ДокументПродажи.ПолисМедСтрахования <> ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	                         |					КОГДА ТИПЗНАЧЕНИЯ(ДокументПродажи) = ТИП(Документ.Прием) И &УсловиеПоМедПолисамПриема = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.БезМедПолиса)
	                         |						ТОГДА ДокументПродажи.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	                         |					ИНАЧЕ ИСТИНА
	                         |				КОНЕЦ							 
	                         |				И ВЫБОР
	                         |					КОГДА &СегментНоменклатуры <> ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
	                         |						ТОГДА Номенклатура В
	                         |								(ВЫБРАТЬ
	                         |									РегистрСведений.НоменклатураСегмента.Номенклатура
	                         |								ИЗ
	                         |									РегистрСведений.НоменклатураСегмента
	                         |								ГДЕ
	                         |									РегистрСведений.НоменклатураСегмента.Сегмент = &СегментНоменклатуры)
	                         |					ИНАЧЕ ИСТИНА
	                         |				КОНЕЦ
	                         |				И ВЫБОР
	                         |					КОГДА &СегментКонтрагента <> ЗНАЧЕНИЕ(Справочник.СегментыКонтрагентов.ПустаяСсылка)
	                         |						ТОГДА Контрагент В
	                         |								(ВЫБРАТЬ
	                         |									РегистрСведений.КонтрагентыСегмента.Контрагент
	                         |								ИЗ
	                         |									РегистрСведений.КонтрагентыСегмента
	                         |								ГДЕ
	                         |									РегистрСведений.КонтрагентыСегмента.Сегмент = &СегментКонтрагента)
	                         |					ИНАЧЕ ИСТИНА
	                         |				КОНЕЦ) КАК ПродажиОбороты
	                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты
	                         |		ПО (ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации = ПродажиОбороты.ДокументПродажи)
	                         |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиСебестоимость.Обороты(, , Авто, ) КАК СебестоимостьОбороты
	                         |		ПО (СебестоимостьОбороты.ДокументПродажи = ПродажиОбороты.ДокументПродажи)
	                         |			И (СебестоимостьОбороты.Номенклатура = ПродажиОбороты.Номенклатура)
	                         |			И (СебестоимостьОбороты.Сотрудник = ПродажиОбороты.Сотрудник)
							 |			И (СебестоимостьОбороты.Ассистент = ПродажиОбороты.Ассистент)
	                         |			И (СебестоимостьОбороты.Контрагент = ПродажиОбороты.Контрагент)
	                         |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                         |				&КонецПериода,
	                         |				Актуальность = ИСТИНА
	                         |					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                         |					И ВидЦен = &ВидЦенСуммы
	                         |					И Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)) КАК ЦеныНоменклатурыОстатки
	                         |		ПО (ЦеныНоменклатурыОстатки.Номенклатура = ПродажиОбороты.Номенклатура)
	                         |ГДЕ
	                         |	ПродажиОбороты.СтоимостьОборот >= 0 // Убираем влияние возвратов что бы не дублировалось
	                         |
	                         |ОБЪЕДИНИТЬ ВСЕ
	                         |
	                         |ВЫБРАТЬ
	                         |	ПродажиСебестоимостьОбороты.ПериодСекунда,
	                         |	ПродажиСебестоимостьОбороты.ДокументПродажи,
	                         |	ПродажиСебестоимостьОбороты.Контрагент,
	                         |	ПродажиСебестоимостьОбороты.Номенклатура,
	                         |	-1 * ВЫБОР
	                         |		КОГДА &ТипЦен = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоЗакупочнойЦене)
	                         |			ТОГДА ЕСТЬNULL(ПродажиСебестоимостьОбороты.СтоимостьОборот, 0)
	                         |		ИНАЧЕ ПродажиСебестоимостьОбороты.КоличествоОборот * (ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) / ВЫБОР
	                         |				КОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент, 0) = 0
	                         |					ТОГДА 1
	                         |				ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент
	                         |			КОНЕЦ)
                     		 |	КОНЕЦ * ВЫБОР 
						 	 |				КОГДА ЕСТЬNULL(ПродажиСебестоимостьОбороты.ДокументПродажи.СуммаДокумента, 0) = 0 
						 	 |					ТОГДА 0
						 	 |				ИНАЧЕ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаПриход / ПродажиСебестоимостьОбороты.ДокументПродажи.СуммаДокумента 							 
							 |			КОНЕЦ,							 
	                         |	ИСТИНА
	                         |ИЗ
	                         |	РегистрНакопления.ПродажиСебестоимость.Обороты(
	                         |			,
	                         |			,
	                         |			Авто,
	                         |			Материал <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	                         |				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                         |				И ВЫБОР
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотруднику)
	                         |						ТОГДА Сотрудник = &Сотрудник ИЛИ Ассистент = &Сотрудник
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеВрача)
	                         |						ТОГДА Сотрудник = &Сотрудник
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеАссистента)
	                         |						ТОГДА Ассистент = &Сотрудник
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеЗубногоТехника)
	                         |						ТОГДА ЗубнойТехник = &Сотрудник							 
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПродажиОформленныхСотрудником)
	                         |						ТОГДА ВЫБОР 
							 |								КОГДА ТИПЗНАЧЕНИЯ(ДокументПродажи) В (ТИП(Документ.Реализация), ТИП(Документ.ВозвратОтПокупателя), ТИП(Документ.Прием))
	                         |							  		ТОГДА ДокументПродажи.Сотрудник = &Сотрудник
							 |								ИНАЧЕ ЛОЖЬ
							 |							  КОНЕЦ
	                         |					ИНАЧЕ ИСТИНА
	                         |				КОНЕЦ
	                         |				И ВЫБОР
	                         |					КОГДА ТИПЗНАЧЕНИЯ(ДокументПродажи) = ТИП(Документ.Прием) И &УсловиеПоМедПолисамПриема = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.СМедПолисом)
	                         |						ТОГДА ДокументПродажи.ПолисМедСтрахования <> ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	                         |					КОГДА ТИПЗНАЧЕНИЯ(ДокументПродажи) = ТИП(Документ.Прием) И &УсловиеПоМедПолисамПриема = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.БезМедПолиса)
	                         |						ТОГДА ДокументПродажи.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	                         |					ИНАЧЕ ИСТИНА
	                         |				КОНЕЦ							 
	                         |				И ВЫБОР
	                         |					КОГДА &СегментНоменклатуры <> ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
	                         |						ТОГДА Номенклатура В
	                         |								(ВЫБРАТЬ
	                         |									РегистрСведений.НоменклатураСегмента.Номенклатура
	                         |								ИЗ
	                         |									РегистрСведений.НоменклатураСегмента
	                         |								ГДЕ
	                         |									РегистрСведений.НоменклатураСегмента.Сегмент = &СегментНоменклатуры)
	                         |					ИНАЧЕ ИСТИНА
	                         |				КОНЕЦ) КАК ПродажиСебестоимостьОбороты
	                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты
	                         |		ПО (ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации = ПродажиСебестоимостьОбороты.ДокументПродажи)
	                         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                         |			ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка.Номенклатура КАК Номенклатура,
	                         |			МИНИМУМ(ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка.Упаковка) КАК Упаковка
	                         |		ИЗ
	                         |			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                         |					&КонецПериода,
	                         |					Актуальность = ИСТИНА
	                         |						И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                         |						И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка
	                         |		
	                         |		СГРУППИРОВАТЬ ПО
	                         |			ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка.Номенклатура) КАК ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка
	                         |		ПО ПродажиСебестоимостьОбороты.Материал = ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка.Номенклатура
	                         |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                         |				&КонецПериода,
	                         |				Актуальность = ИСТИНА
	                         |					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                         |					И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних
	                         |		ПО ПродажиСебестоимостьОбороты.Материал = ЦеныНоменклатурыСрезПоследних.Номенклатура
	                         |			И (ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка.Упаковка = ЦеныНоменклатурыСрезПоследних.Упаковка)
	                         |ГДЕ
	                         |	&УчитыватьМатериалы = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.УчитыватьСтоимостьМатериалов)
	                         |	И ПродажиСебестоимостьОбороты.СтоимостьОборот >= 0 // Убираем влияние возвратов что бы не дублировалось
	                         |
	                         |ОБЪЕДИНИТЬ ВСЕ
	                         |
	                         |ВЫБРАТЬ
	                         |	ПартииТоваровОбороты.ПериодСекунда,
	                         |	ПартииТоваровОбороты.Регистратор,
	                         |	NULL,
	                         |	ПартииТоваровОбороты.Номенклатура,
	                         |	-1 * ВЫБОР
	                         |		КОГДА &ТипЦен = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоЗакупочнойЦене)
	                         |			ТОГДА ЕСТЬNULL(ПартииТоваровОбороты.СтоимостьОборот, 0)
	                         |		ИНАЧЕ ПартииТоваровОбороты.КоличествоОборот * (ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) / ВЫБОР
	                         |				КОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент, 0) = 0
	                         |					ТОГДА 1
	                         |				ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент
	                         |			КОНЕЦ)
	                         |	КОНЕЦ,
	                         |	ИСТИНА
	                         |ИЗ
	                         |	РегистрНакопления.ПартииТоваров.Обороты(
	                         |			&НачалоПериода,
	                         |			&КонецПериода,
	                         |			Авто,
							 |				ТИПЗНАЧЕНИЯ(Склад) = ТИП(Справочник.Сотрудники)
	                         |				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                         |				И ВЫБОР
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотруднику)
							 |							ИЛИ &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПродажиОформленныхСотрудником)
	                         |						ТОГДА Склад = &Сотрудник
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеВрача)
	                         |						ТОГДА Склад = &Сотрудник
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеАссистента)
	                         |						ТОГДА ЛОЖЬ
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеЗубногоТехника)
	                         |						ТОГДА ЛОЖЬ							 
	                         |					ИНАЧЕ ИСТИНА
	                         |				КОНЕЦ
	                         |				И ВЫБОР
	                         |					КОГДА &СегментПередаваемыхМатериалов <> ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
	                         |						ТОГДА Номенклатура В
	                         |								(ВЫБРАТЬ
	                         |									РегистрСведений.НоменклатураСегмента.Номенклатура
	                         |								ИЗ
	                         |									РегистрСведений.НоменклатураСегмента
	                         |								ГДЕ
	                         |									РегистрСведений.НоменклатураСегмента.Сегмент = &СегментПередаваемыхМатериалов)
	                         |					ИНАЧЕ ИСТИНА
	                         |				КОНЕЦ) КАК ПартииТоваровОбороты
	                         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                         |			ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка.Номенклатура КАК Номенклатура,
	                         |			МИНИМУМ(ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка.Упаковка) КАК Упаковка
	                         |		ИЗ
	                         |			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                         |					&КонецПериода,
	                         |					Актуальность = ИСТИНА
	                         |						И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                         |						И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка
	                         |		
	                         |		СГРУППИРОВАТЬ ПО
	                         |			ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка.Номенклатура) КАК ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка
	                         |		ПО ПартииТоваровОбороты.Номенклатура = ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка.Номенклатура
	                         |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                         |				&КонецПериода,
	                         |				Актуальность = ИСТИНА
	                         |					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                         |					И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних
	                         |		ПО ПартииТоваровОбороты.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	                         |			И (ЦеныНоменклатурыСрезПоследнихПодобраннаяУпаковка.Упаковка = ЦеныНоменклатурыСрезПоследних.Упаковка)
	                         |ГДЕ
	                         |	&УчитыватьМатериалы = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ВычитатьСтоимостьПереданныхСотрудникуМатериалов)							 
							 |	И ТИПЗНАЧЕНИЯ(Регистратор) = ТИП(Документ.ПеремещениеЗапасов)
	                         |
	                         |УПОРЯДОЧИТЬ ПО
	                         |	Дата
		                     |;
		                     |
		                     |////////////////////////////////////////////////////////////////////////////////
							 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                         |	ПродажиОбороты.ПериодСекунда КАК Дата,
	                         |	ПродажиОбороты.ДокументПродажи КАК Документ,
	                         |	ПродажиОбороты.Контрагент КАК Контрагент,
	                         |	ПродажиОбороты.Номенклатура КАК Номенклатура,
	                         |	ПродажиОбороты.СтоимостьОборот * (ВЫБОР 
						 	 |			КОГДА ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаРасход, 0) = 0 
						 	 |				ТОГДА 1 
						 	 |			ИНАЧЕ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаПриход / ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаРасход 
							 |		КОНЕЦ) КАК Сумма
	                         |ИЗ
	                         |	РегистрНакопления.Продажи.Обороты(
	                         |			,
	                         |			,
	                         |			Авто,
	                         |			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                         |				И ВЫБОР
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСтоматологии)
	                         |						ТОГДА ИСТИНА
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотруднику)
	                         |						ТОГДА Сотрудник = &Сотрудник ИЛИ Ассистент = &Сотрудник
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеВрача)
	                         |						ТОГДА Сотрудник = &Сотрудник
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеАссистента)
	                         |						ТОГДА Ассистент = &Сотрудник
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоСотрудникуВКачествеЗубногоТехника)
	                         |						ТОГДА ЗубнойТехник = &Сотрудник							 
	                         |					КОГДА &ОтПродаж = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ПродажиОформленныхСотрудником)
	                         |						ТОГДА ВЫБОР 
							 |								КОГДА ТИПЗНАЧЕНИЯ(ДокументПродажи) В (ТИП(Документ.Реализация), ТИП(Документ.ВозвратОтПокупателя), ТИП(Документ.Прием))
	                         |							  		ТОГДА ДокументПродажи.Сотрудник = &Сотрудник
							 |								ИНАЧЕ ЛОЖЬ
							 |							  КОНЕЦ
	                         |					ИНАЧЕ ИСТИНА
	                         |				КОНЕЦ) КАК ПродажиОбороты
	                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты
	                         |		ПО (ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации = ПродажиОбороты.ДокументПродажи)
	                         |
	                         |УПОРЯДОЧИТЬ ПО
	                         |	ПродажиОбороты.ПериодСекунда";
	КонецЕсли;
	
	ЗапросПоПродажам.УстановитьПараметр("СтруктурнаяЕдиница", 				НачислениеУдержание.СтруктурнаяЕдиница);						 
	ЗапросПоПродажам.УстановитьПараметр("НачалоПериода", 					НачалоДня(ПериодС));
	ЗапросПоПродажам.УстановитьПараметр("КонецПериода", 					КонецДня(ПериодПо));
	ЗапросПоПродажам.УстановитьПараметр("УсловиеПоМедПолисамПриема", 		НачислениеУдержание.УсловиеПоМедПолисамПриема);
	ЗапросПоПродажам.УстановитьПараметр("ОтПродаж", 						НачислениеУдержание.ОтПродаж);
	ЗапросПоПродажам.УстановитьПараметр("Сотрудник", 						НачислениеУдержание.Владелец);
	ЗапросПоПродажам.УстановитьПараметр("УчитыватьМатериалы", 				НачислениеУдержание.УчитыватьМатериалы);
	ЗапросПоПродажам.УстановитьПараметр("ИспользоватьСкидки",				НачислениеУдержание.ОтСуммы); 
	ЗапросПоПродажам.УстановитьПараметр("ВидЦенСуммы", 						НачислениеУдержание.ВидЦенСуммы);
	ЗапросПоПродажам.УстановитьПараметр("СегментНоменклатуры", 				НачислениеУдержание.СегментНоменклатуры);
	ЗапросПоПродажам.УстановитьПараметр("СегментПередаваемыхМатериалов",	НачислениеУдержание.СегментПередаваемыхМатериалов);
	ЗапросПоПродажам.УстановитьПараметр("СегментКонтрагента", 				НачислениеУдержание.СегментКонтрагента);
	ЗапросПоПродажам.УстановитьПараметр("УчитываяТолькоОплаченныеПродажи", 	НачислениеУдержание.УчитываяТолькоОплаченныеПродажи);
	ЗапросПоПродажам.УстановитьПараметр("ВидЦен", 							НачислениеУдержание.ВидЦен);
	ЗапросПоПродажам.УстановитьПараметр("ТипЦен", 							НачислениеУдержание.ТипЦен);
	
	РезультатЗапроса = ЗапросПоПродажам.ВыполнитьПакет();
	
	СуммаПродаж = РезультатЗапроса[0].Выгрузить().Итог("Сумма");
	ОбщаяСуммаПродаж = РезультатЗапроса[1].Выгрузить().Итог("Сумма");
	Если НачислениеУдержание.УсловиеПродажи = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ЕслиСуммаПродажи
			И НЕ (НачислениеУдержание.ТипСравнения = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.Больше И СуммаПродаж >= НачислениеУдержание.СуммаПродаж
				ИЛИ НачислениеУдержание.ТипСравнения = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.Меньше И СуммаПродаж < НачислениеУдержание.СуммаПродаж) Тогда
		Возврат;
	ИначеЕсли НачислениеУдержание.УсловиеПродажи = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ЕслиОбщаяСуммаПродажи
			И НЕ (НачислениеУдержание.ТипСравнения = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.Больше И ОбщаяСуммаПродаж >= НачислениеУдержание.СуммаПродаж
				ИЛИ НачислениеУдержание.ТипСравнения = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.Меньше И ОбщаяСуммаПродаж < НачислениеУдержание.СуммаПродаж) Тогда				
		Возврат;
	КонецЕсли;
	
	БазаРассчитанная = РасчетБазыПоНачислению(НачислениеУдержание, СуммаПродаж);
	
	Если БазаРассчитанная <> 0 И БазаРассчитанная <> СуммаПродаж Тогда
		
		Коэффициент = СуммаПродаж / БазаРассчитанная;
		ТаблицаДляЗатрат = РезультатЗапроса[0].Выгрузить();	
		
		МаксимальнаяСумма = 0;
		Для Каждого СтрокаТЧ Из ТаблицаДляЗатрат Цикл
			СтрокаТЧ.Сумма = Окр(СтрокаТЧ.Сумма / Коэффициент, 2);
			Если СтрокаТЧ.Сумма > МаксимальнаяСумма Тогда
				МаксимальнаяСумма = СтрокаТЧ.Сумма;
			КонецЕсли;
		КонецЦикла;          		
		
		// В результате деления на коэффициент может возникать огромный хвост после запятой и в результате может давать ложные копейки. 
		// Их необходимо откруглить до той базы, на которую мы должны выйти.  
		// Если есть погрешность, то находим МаксимальнаяСумма в таблице, в строке с которой потом корректируем копейки в колонке База и Сумма.
		
		РазницаСуммы = БазаРассчитанная - ТаблицаДляЗатрат.Итог("Сумма");                                                                          	
		
		Если РазницаСуммы <> 0 Тогда                                       
			СтрокаТЗ = ТаблицаДляЗатрат.НайтиСтроки(Новый Структура("Сумма", МаксимальнаяСумма));
			
			Если ЗначениеЗаполнено(СтрокаТЗ) Тогда 			
				СтрокаТЗ[0].Сумма = СтрокаТЗ[0].Сумма + РазницаСуммы;
			КонецЕсли;
			
		КонецЕсли;  
		
		Для Каждого СтрокаТЧ Из ТаблицаДляЗатрат Цикл
			ДобавитьРасшифровкуНачисленияВЗатраты(ТаблицаРасшифровкиНачислений, НачислениеУдержание, СтрокаТЧ.Дата, СтрокаТЧ.Документ, СтрокаТЧ.Контрагент, СтрокаТЧ.Номенклатура,
			, , СтрокаТЧ.Сумма, НачислениеУдержание.Размер, СтрокаТЧ.Сумма * НачислениеУдержание.Размер / 100);				
		КонецЦикла;   		
		
		РазницаСуммыПоЗатратам = БазаРассчитанная * НачислениеУдержание.Размер / 100 - ТаблицаРасшифровкиНачислений.Итог("Сумма"); 
		Если РазницаСуммыПоЗатратам <> 0 Тогда		
			
			Если ЗначениеЗаполнено(СтрокаТЗ) Тогда
				СтрокаТЗЗатрат = ТаблицаРасшифровкиНачислений.НайтиСтроки(Новый Структура("Документ, Номенклатура", СтрокаТЗ[0].Документ, СтрокаТЗ[0].Номенклатура));
				Если ЗначениеЗаполнено(СтрокаТЗЗатрат) Тогда
					СтрокаТЗЗатрат[0].Сумма = СтрокаТЗЗатрат[0].Сумма + РазницаСуммыПоЗатратам;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли БазаРассчитанная = СуммаПродаж Тогда
		Выборка = РезультатЗапроса[0].Выбрать();
		Пока Выборка.Следующий() Цикл            			
			
			ДобавитьРасшифровкуНачисленияВЗатраты(ТаблицаРасшифровкиНачислений, НачислениеУдержание, Выборка.Дата, Выборка.Документ, Выборка.Контрагент, Выборка.Номенклатура,
			, , Выборка.Сумма, НачислениеУдержание.Размер, Выборка.Сумма * НачислениеУдержание.Размер / 100);
		КонецЦикла;    
	КонецЕсли;           
	
КонецПроцедуры // РасчетПоПроцентнойСтавке()

// Производится расчет ЗП при установленной виде начисления "Тариф"
//
Процедура РасчетыПоТарифу(ТаблицаРасшифровкиНачислений, НачислениеУдержание, ПериодС, ПериодПо, СтруктураПереопределенияБазы = Неопределено)
	
	Если НачислениеУдержание.ТипТарифа	 = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.АвторуЗаПервичныйПрием Тогда
		
		Если СтруктураПереопределенияБазы <> Неопределено Тогда
			ДобавитьРасшифровкуНачисленияВЗатраты(ТаблицаРасшифровкиНачислений, НачислениеУдержание, ПериодПо, , , ,
					, , СтруктураПереопределенияБазы.База, СтруктураПереопределенияБазы.Размер, СтруктураПереопределенияБазы.Размер * СтруктураПереопределенияБазы.База);
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Прием.Ссылка,
		               |	Прием.Дата,
		               |	Прием.Контрагент
		               |ИЗ
		               |	Документ.Прием КАК Прием
		               |ГДЕ
		               |	Прием.Проведен = ИСТИНА
		               |	И Прием.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И Прием.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		               |	И Прием.СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Первичный)
		               |	И Прием.ДокументОснование.АвторДокумента.Сотрудник = &АвторДокумента";
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПериодС));
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодПо));
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", НачислениеУдержание.СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("АвторДокумента", НачислениеУдержание.Владелец);
		
		Выборка = Запрос.Выполнить().Выбрать();
				
		Пока Выборка.Следующий() Цикл
			ДобавитьРасшифровкуНачисленияВЗатраты(ТаблицаРасшифровкиНачислений, НачислениеУдержание, Выборка.Дата, Выборка.Ссылка, Выборка.Контрагент, ,
					, , 1, НачислениеУдержание.Размер, НачислениеУдержание.Размер * 1);			
		КонецЦикла;
		
	ИначеЕсли НачислениеУдержание.ТипТарифа	 = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.АвторуЗаОплаченныйПрием Тогда
	     
		Если СтруктураПереопределенияБазы <> Неопределено Тогда
			ДобавитьРасшифровкуНачисленияВЗатраты(ТаблицаРасшифровкиНачислений, НачислениеУдержание, ПериодПо, , , ,
					, , СтруктураПереопределенияБазы.База, СтруктураПереопределенияБазы.Размер, СтруктураПереопределенияБазы.Размер * СтруктураПереопределенияБазы.База);
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Прием.Ссылка,
		               |	Прием.Дата,
		               |	Прием.Контрагент
		               |ИЗ
		               |	Документ.Прием КАК Прием
		               |ГДЕ
		               |	Прием.Проведен = ИСТИНА
		               |	И Прием.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И Прием.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		               |	И Прием.СуммаОплачено = Прием.СуммаДокумента
		               |	И Прием.ДокументОснование.АвторДокумента.Сотрудник = &АвторДокумента
		               |	И ВЫБОР
		               |			КОГДА &СегментНоменклатуры <> ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
		               |				ТОГДА Прием.Лечение.Номенклатура В
		               |						(ВЫБРАТЬ
		               |							РегистрСведений.НоменклатураСегмента.Номенклатура
		               |						ИЗ
		               |							РегистрСведений.НоменклатураСегмента
		               |						ГДЕ
		               |							РегистрСведений.НоменклатураСегмента.Сегмент = &СегментНоменклатуры)
		               |			ИНАЧЕ ИСТИНА
		               |		КОНЕЦ";
					   
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПериодС));
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодПо));
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", НачислениеУдержание.СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("АвторДокумента", НачислениеУдержание.Владелец);
		Запрос.УстановитьПараметр("СегментНоменклатуры", НачислениеУдержание.СегментНоменклатуры);
		
		Выборка = Запрос.Выполнить().Выбрать();
				
		Пока Выборка.Следующий() Цикл
			ДобавитьРасшифровкуНачисленияВЗатраты(ТаблицаРасшифровкиНачислений, НачислениеУдержание, Выборка.Дата, Выборка.Ссылка, Выборка.Контрагент, ,
					, , 1, НачислениеУдержание.Размер, НачислениеУдержание.Размер * 1);			
		КонецЦикла;
		
	ИначеЕсли НачислениеУдержание.ТипТарифа	 = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаЧасАссистирования Тогда
		
		Если СтруктураПереопределенияБазы <> Неопределено Тогда
			ДобавитьРасшифровкуНачисленияВЗатраты(ТаблицаРасшифровкиНачислений, НачислениеУдержание, ПериодПо, , , ,
					, СтруктураПереопределенияБазы.ЧасовФакт, , СтруктураПереопределенияБазы.Размер, СтруктураПереопределенияБазы.Размер * СтруктураПереопределенияБазы.ЧасовФакт);
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РабочееВремяСотрудниковОбороты.ПериодДень КАК Дата,
		               |	РабочееВремяСотрудниковОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	РабочееВремяСотрудниковОбороты.Сотрудник КАК Сотрудник,
		               |	РабочееВремяСотрудниковОбороты.Врач КАК Врач,
		               |	РабочееВремяСотрудниковОбороты.ДнейОборот КАК ДнейФакт,
		               |	ВЫБОР
		               |		КОГДА &Врач <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		               |			ТОГДА ВЫБОР
		               |					КОГДА &УсловиеПродажи = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаКаждыйЧасДо)
		               |						ТОГДА ВЫБОР
		               |								КОГДА РабочееВремяСотрудниковОбороты.ЧасовОборот < &СуммаПродаж
		               |									ТОГДА РабочееВремяСотрудниковОбороты.ЧасовОборот
		               |								ИНАЧЕ &СуммаПродаж
		               |							КОНЕЦ
		               |					КОГДА &УсловиеПродажи = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаКаждыйЧасСверх)
		               |						ТОГДА ВЫБОР
		               |								КОГДА РабочееВремяСотрудниковОбороты.ЧасовОборот > &СуммаПродаж
		               |									ТОГДА РабочееВремяСотрудниковОбороты.ЧасовОборот - &СуммаПродаж
		               |								ИНАЧЕ 0
		               |							КОНЕЦ
		               |					ИНАЧЕ РабочееВремяСотрудниковОбороты.ЧасовОборот
		               |				КОНЕЦ
		               |		ИНАЧЕ ВЫБОР
		               |				КОГДА &УсловиеПродажи <> ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаКаждыйЧасДо)
		               |						И &УсловиеПродажи <> ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаКаждыйЧасСверх)
		               |					ТОГДА РабочееВремяСотрудниковОбороты.ЧасовОборот
		               |				ИНАЧЕ 1
		               |			КОНЕЦ
		               |	КОНЕЦ КАК ЧасовФакт,
		               |	ЕСТЬNULL(ПродажиОбороты.СтоимостьОборот, 0) КАК СтоимостьОборот,
		               |	РабочееВремяСотрудниковОбщееОбороты.ЧасовОборот КАК ЧасовФактОбщее
		               |ИЗ
		               |	РегистрНакопления.РабочееВремяСотрудников.Обороты(
		               |			&НачалоПериода,
		               |			&КонецПериода,
		               |			Авто,
		               |			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		               |				И Врач <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		               |				И Сотрудник = &Сотрудник
		               |				И ВЫБОР
		               |					КОГДА &Врач <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		               |						ТОГДА Врач = &Врач
		               |					ИНАЧЕ ИСТИНА
		               |				КОНЕЦ) КАК РабочееВремяСотрудниковОбороты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(
		               |				&НачалоПериода,
		               |				&КонецПериода,
		               |				Авто,
		               |				СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		               |					И ВЫБОР
		               |						КОГДА &СегментНоменклатуры <> ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
		               |							ТОГДА Номенклатура В
		               |									(ВЫБРАТЬ
		               |										РегистрСведений.НоменклатураСегмента.Номенклатура
		               |									ИЗ
		               |										РегистрСведений.НоменклатураСегмента
		               |									ГДЕ
		               |										РегистрСведений.НоменклатураСегмента.Сегмент = &СегментНоменклатуры)
		               |						ИНАЧЕ ИСТИНА
		               |					КОНЕЦ) КАК ПродажиОбороты
		               |		ПО РабочееВремяСотрудниковОбороты.Врач = ПродажиОбороты.Сотрудник
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РабочееВремяСотрудников.Обороты(
		               |				&НачалоПериода,
		               |				&КонецПериода,
		               |				Авто,
		               |				СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		               |					И Врач <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		               |					И Сотрудник = &Сотрудник) КАК РабочееВремяСотрудниковОбщееОбороты
		               |		ПО РабочееВремяСотрудниковОбороты.Сотрудник = РабочееВремяСотрудниковОбщееОбороты.Сотрудник
		               |ГДЕ
		               |	ВЫБОР
		               |			КОГДА &УсловиеПродажи = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ЕслиСуммаПродажи)
		               |				ТОГДА ВЫБОР
		               |						КОГДА &ТипСравнения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.Больше)
		               |							ТОГДА ЕСТЬNULL(ПродажиОбороты.СтоимостьОборот, 0) >= &СуммаПродаж
		               |						КОГДА &ТипСравнения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.Меньше)
		               |							ТОГДА ЕСТЬNULL(ПродажиОбороты.СтоимостьОборот, 0) < &СуммаПродаж
		               |					КОНЕЦ
		               |			ИНАЧЕ ИСТИНА
		               |		КОНЕЦ
		               |	И ВЫБОР
		               |			КОГДА &КоличествоЧасов <> 0
		               |				ТОГДА ВЫБОР
		               |						КОГДА &УсловиеВыработкиПоЧасам = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.Всего)
		               |								ИЛИ &УсловиеВыработкиПоЧасам = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.СВрачом)
		               |									И &Врач = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		               |							ТОГДА ВЫБОР
		               |									КОГДА &ТипСравненияВыработкиПоЧасам = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.Больше)
		               |										ТОГДА РабочееВремяСотрудниковОбщееОбороты.ЧасовОборот >= &КоличествоЧасов
		               |									КОГДА &ТипСравненияВыработкиПоЧасам = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.Меньше)
		               |										ТОГДА РабочееВремяСотрудниковОбщееОбороты.ЧасовОборот < &КоличествоЧасов
		               |								КОНЕЦ
		               |						ИНАЧЕ ВЫБОР
		               |								КОГДА &ТипСравненияВыработкиПоЧасам = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.Больше)
		               |									ТОГДА РабочееВремяСотрудниковОбороты.ЧасовОборот >= &КоличествоЧасов
		               |								КОГДА &ТипСравненияВыработкиПоЧасам = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.Меньше)
		               |									ТОГДА РабочееВремяСотрудниковОбороты.ЧасовОборот < &КоличествоЧасов
		               |							КОНЕЦ
		               |					КОНЕЦ
		               |			ИНАЧЕ ИСТИНА
		               |		КОНЕЦ";
					   
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПериодС));
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодПо));					   
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", НачислениеУдержание.СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("Сотрудник", НачислениеУдержание.Владелец);
		Запрос.УстановитьПараметр("Врач", НачислениеУдержание.Врач);
		Запрос.УстановитьПараметр("СегментНоменклатуры", НачислениеУдержание.СегментНоменклатуры);
		Запрос.УстановитьПараметр("УсловиеПродажи", НачислениеУдержание.УсловиеПродажи);
		Запрос.УстановитьПараметр("ТипСравнения", НачислениеУдержание.ТипСравнения);
		Запрос.УстановитьПараметр("СуммаПродаж", НачислениеУдержание.СуммаПродаж);
		Запрос.УстановитьПараметр("УсловиеВыработкиПоЧасам", НачислениеУдержание.УсловиеВыработкиПоЧасам);
		Запрос.УстановитьПараметр("ТипСравненияВыработкиПоЧасам", НачислениеУдержание.ТипСравненияВыработкиПоЧасам);
		Запрос.УстановитьПараметр("КоличествоЧасов", НачислениеУдержание.КоличествоЧасов);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбщееНачислено = Ложь;
		Пока Выборка.Следующий() Цикл 
			ЧасовФакт		 = Выборка.ЧасовФакт;
			ДатаВРасшифровке = Выборка.Дата;

			// в запросе не удалось обработать это условие, поэтому кодом обрабатываю
			Если Не ЗначениеЗаполнено(НачислениеУдержание.Врач) Тогда 
				Если НачислениеУдержание.УсловиеПродажи = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаКаждыйЧасДо Тогда 
					ЧасовФакт = ?(Выборка.ЧасовФактОбщее < НачислениеУдержание.СуммаПродаж, Выборка.ЧасовФактОбщее, НачислениеУдержание.СуммаПродаж);
				ИначеЕсли НачислениеУдержание.УсловиеПродажи = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаКаждыйЧасСверх Тогда 
					ЧасовФакт = ?(Выборка.ЧасовФактОбщее < НачислениеУдержание.СуммаПродаж, 0, Выборка.ЧасовФактОбщее - НачислениеУдержание.СуммаПродаж);	
				КонецЕсли;
			КонецЕсли;	
			Если ЧасовФакт <> 0 И Не ОбщееНачислено Тогда  
				Если Не ЗначениеЗаполнено(НачислениеУдержание.Врач) И (НачислениеУдержание.УсловиеПродажи = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаКаждыйЧасДо Или 
					НачислениеУдержание.УсловиеПродажи = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаКаждыйЧасСверх) Тогда 
					ДатаВРасшифровке = ПериодПо;
					ОбщееНачислено = Истина;
				КонецЕсли;
				ДобавитьРасшифровкуНачисленияВЗатраты(ТаблицаРасшифровкиНачислений, НачислениеУдержание, ДатаВРасшифровке,,,,, ЧасовФакт,, НачислениеУдержание.Размер, НачислениеУдержание.Размер * ЧасовФакт);	
			КонецЕсли;
		КонецЦикла;	
				
	Иначе
		
		ПоЧасам = НачислениеУдержание.ТипТарифа = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаЧас;
		
		Если СтруктураПереопределенияБазы <> Неопределено Тогда
			Факт = ?(ПоЧасам, СтруктураПереопределенияБазы.ЧасовФакт, СтруктураПереопределенияБазы.ДнейФакт);
			ДобавитьРасшифровкуНачисленияВЗатраты(ТаблицаРасшифровкиНачислений, НачислениеУдержание, ПериодПо, , , ,
					, Факт, , СтруктураПереопределенияБазы.Размер, СтруктураПереопределенияБазы.Размер * Факт);
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РабочееВремяСотрудниковОбороты.ПериодДень КАК Дата,
		               |	РабочееВремяСотрудниковОбороты.Сотрудник,
		               |	РабочееВремяСотрудниковОбороты.СтруктурнаяЕдиница,
		               |	РабочееВремяСотрудниковОбороты.ДнейОборот КАК ДнейФакт,
		               |	ВЫБОР
		               |		КОГДА &УсловиеПродажи = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаКаждыйЧасДо)
		               |			ТОГДА ВЫБОР
		               |					КОГДА РабочееВремяСотрудниковОбороты.ЧасовОборот < &СуммаПродаж
		               |						ТОГДА РабочееВремяСотрудниковОбороты.ЧасовОборот
		               |					ИНАЧЕ &СуммаПродаж
		               |				КОНЕЦ
		               |		КОГДА &УсловиеПродажи = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаКаждыйЧасСверх)
		               |			ТОГДА РабочееВремяСотрудниковОбороты.ЧасовОборот - &СуммаПродаж
		               |		ИНАЧЕ РабочееВремяСотрудниковОбороты.ЧасовОборот
		               |	КОНЕЦ КАК ЧасовФакт,
		               |	ЕСТЬNULL(ПродажиОбороты.СтоимостьОборот, 0) КАК СтоимостьОборот
		               |ИЗ
		               |	РегистрНакопления.РабочееВремяСотрудников.Обороты(
		               |			&НачалоПериода,
		               |			&КонецПериода,
		               |			Авто,
		               |			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		               |				И Сотрудник = &Сотрудник
		               |				И Врач = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК РабочееВремяСотрудниковОбороты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(
		               |				&НачалоПериода,
		               |				&КонецПериода,
		               |				Авто,
		               |				СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		               |					И ВЫБОР
		               |						КОГДА &СегментНоменклатуры <> ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
		               |							ТОГДА Номенклатура В
		               |									(ВЫБРАТЬ
		               |										РегистрСведений.НоменклатураСегмента.Номенклатура
		               |									ИЗ
		               |										РегистрСведений.НоменклатураСегмента
		               |									ГДЕ
		               |										РегистрСведений.НоменклатураСегмента.Сегмент = &СегментНоменклатуры)
		               |						ИНАЧЕ ИСТИНА
		               |					КОНЕЦ) КАК ПродажиОбороты
		               |		ПО РабочееВремяСотрудниковОбороты.Сотрудник = ПродажиОбороты.Сотрудник
		               |ГДЕ
		               |	ВЫБОР
		               |			КОГДА &УсловиеПродажи = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ЕслиСуммаПродажи)
		               |				ТОГДА ВЫБОР
		               |						КОГДА &ТипСравнения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.Больше)
		               |							ТОГДА ЕСТЬNULL(ПродажиОбороты.СтоимостьОборот, 0) >= &СуммаПродаж
		               |						КОГДА &ТипСравнения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.Меньше)
		               |							ТОГДА ЕСТЬNULL(ПродажиОбороты.СтоимостьОборот, 0) < &СуммаПродаж
		               |					КОНЕЦ
		               |			КОГДА &УсловиеПродажи = ЗНАЧЕНИЕ(Перечисление.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаКаждыйЧасСверх)
		               |				ТОГДА РабочееВремяСотрудниковОбороты.ЧасовОборот > &СуммаПродаж
		               |			ИНАЧЕ ИСТИНА
		               |		КОНЕЦ";
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПериодС));
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодПо));
		Запрос.УстановитьПараметр("ПоЧасам", ПоЧасам);
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", НачислениеУдержание.СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("Сотрудник", НачислениеУдержание.Владелец);
		Запрос.УстановитьПараметр("СегментНоменклатуры", НачислениеУдержание.СегментНоменклатуры);
		Запрос.УстановитьПараметр("УсловиеПродажи", НачислениеУдержание.УсловиеПродажи);
		Запрос.УстановитьПараметр("ТипСравнения", НачислениеУдержание.ТипСравнения);
		Запрос.УстановитьПараметр("СуммаПродаж", НачислениеУдержание.СуммаПродаж);		
		
		Выборка = Запрос.Выполнить().Выбрать();
				
		Пока Выборка.Следующий() Цикл
			Факт = ?(ПоЧасам, Выборка.ЧасовФакт, Выборка.ДнейФакт);
			ДобавитьРасшифровкуНачисленияВЗатраты(ТаблицаРасшифровкиНачислений, НачислениеУдержание, Выборка.Дата, , , ,
					, Факт, , НачислениеУдержание.Размер, НачислениеУдержание.Размер * Факт);			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // РасчетПоТарифу()

// Производится расчет ЗП при установленной виде начисления "Оклад"
//
Процедура РасчетыПоОкладу(ТаблицаРасшифровкиНачислений, НачислениеУдержание, ПериодС, ПериодПо, СтруктураПереопределенияБазы = Неопределено)
	
	Если НачислениеУдержание.ЗависимостьОтВыработки	 = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.НеЗависитОтВыработки Тогда
				
		Если СтруктураПереопределенияБазы <> Неопределено Тогда
			ДобавитьРасшифровкуНачисленияВЗатраты(ТаблицаРасшифровкиНачислений, НачислениеУдержание, ПериодПо, , , ,
							СтруктураПереопределенияБазы.ДнейПлан, СтруктураПереопределенияБазы.ДнейФакт, , СтруктураПереопределенияБазы.Размер, ?(СтруктураПереопределенияБазы.ДнейПлан <> 0, СтруктураПереопределенияБазы.Размер * СтруктураПереопределенияБазы.ДнейФакт / СтруктураПереопределенияБазы.ДнейПлан, 0));
			Возврат;
		КонецЕсли;
		
		МассивДниМесяца = Новый Массив;
		МассивДниНачисленияВМесяце = Новый Массив;
		ДатаРасчетаОкладаС = ?(Месяц(НачислениеУдержание.НачалоПериода) >= Месяц(ПериодС), НачислениеУдержание.НачалоПериода, НачалоМесяца(ПериодС));
		ДатаРасчетаОкладаПо = ?(ЗначениеЗаполнено(НачислениеУдержание.КонецПериода), КонецДня(НачислениеУдержание.КонецПериода), КонецМесяца(ПериодПо));
		ПроверяемаяДата = ДатаРасчетаОкладаС;			
		Пока ПроверяемаяДата <= ДатаРасчетаОкладаПо ИЛИ МассивДниМесяца.Количество() > 0 Цикл
			МассивДниМесяца.Добавить(ПроверяемаяДата);
			Если ПроверяемаяДата >= ПериодС И ПроверяемаяДата <= ПериодПо Тогда
				МассивДниНачисленияВМесяце.Добавить(ПроверяемаяДата);
			КонецЕсли;
			Если Месяц(ПроверяемаяДата) <> Месяц(ПроверяемаяДата + 60 * 60 * 24) Тогда
				Для Каждого ЭлементМассива Из МассивДниНачисленияВМесяце Цикл
					ДобавитьРасшифровкуНачисленияВЗатраты(ТаблицаРасшифровкиНачислений, НачислениеУдержание, ЭлементМассива, , , ,
					МассивДниМесяца.Количество(), 1, , НачислениеУдержание.Размер, НачислениеУдержание.Размер * 1 / МассивДниМесяца.Количество());
				КонецЦикла;
				
				// при округлении образовалась погрешность, прибавляем к последнему дню
				Если МассивДниНачисленияВМесяце.Количество() > 1 И НачислениеУдержание.Размер <> Окр(НачислениеУдержание.Размер / МассивДниМесяца.Количество(), 2) * МассивДниМесяца.Количество() Тогда 
					ТаблицаРасшифровкиНачислений[ТаблицаРасшифровкиНачислений.Количество()-1].Сумма = ТаблицаРасшифровкиНачислений[ТаблицаРасшифровкиНачислений.Количество()-1].Сумма + НачислениеУдержание.Размер - Окр(НачислениеУдержание.Размер / МассивДниМесяца.Количество(), 2) * МассивДниМесяца.Количество();
				КонецЕсли;

				МассивДниМесяца.Очистить();
				МассивДниНачисленияВМесяце.Очистить();					
			КонецЕсли;
			ПроверяемаяДата = ПроверяемаяДата + 60*60*24;
		КонецЦикла;
		
	Иначе
		
		ПоЧасам = НачислениеУдержание.ТипПериодаНачисления = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоЧасам;
		
		Если СтруктураПереопределенияБазы <> Неопределено Тогда
			План = ?(ПоЧасам, СтруктураПереопределенияБазы.ЧасовПлан, СтруктураПереопределенияБазы.ДнейПлан);
			Факт = ?(ПоЧасам, СтруктураПереопределенияБазы.ЧасовФакт, СтруктураПереопределенияБазы.ДнейФакт);
			ДобавитьРасшифровкуНачисленияВЗатраты(ТаблицаРасшифровкиНачислений, НачислениеУдержание, ПериодПо, , , ,
									План, Факт, , НачислениеУдержание.Размер, ?(План <> 0, НачислениеУдержание.Размер * Факт / План, 0));
			Возврат;
		КонецЕсли;		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ЕСТЬNULL(ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница, РабочееВремяСотрудниковФакт.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиница,
		               |	ЕСТЬNULL(ВремяРаботыСотрудниковПлан.Сотрудник, РабочееВремяСотрудниковФакт.Сотрудник) КАК Сотрудник,
		               |	ЕСТЬNULL(ВремяРаботыСотрудниковПлан.Дата, РабочееВремяСотрудниковФакт.ПериодДень) КАК Дата,
		               |	ЕСТЬNULL(ВремяРаботыСотрудниковПлан.ЧасовПлан, 0) КАК ЧасовПлан,
		               |	ЕСТЬNULL(ВремяРаботыСотрудниковПлан.ДнейПлан, 0) КАК ДнейПлан,
		               |	ЕСТЬNULL(РабочееВремяСотрудниковФакт.ЧасовОборот, 0) КАК ЧасовФакт,
		               |	ЕСТЬNULL(РабочееВремяСотрудниковФакт.ДнейОборот, 0) КАК ДнейФакт
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |		ВремяРаботыСотрудниковПлан.Сотрудник КАК Сотрудник,
		               |		НАЧАЛОПЕРИОДА(ВремяРаботыСотрудниковПлан.ДатаВремяОкончания, ДЕНЬ) КАК Дата,
		               |		СУММА(ВремяРаботыСотрудниковПлан.Минуты / 60) КАК ЧасовПлан,
		               |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НАЧАЛОПЕРИОДА(ВремяРаботыСотрудниковПлан.ДатаВремяНачала, ДЕНЬ)) КАК ДнейПлан
		               |	ИЗ
		               |		РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
		               |	ГДЕ
		               |		ВремяРаботыСотрудниковПлан.ДатаВремяНачала МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
		               |		И ВремяРаботыСотрудниковПлан.Сотрудник = &Сотрудник
		               |		И ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		               |	
		               |	СГРУППИРОВАТЬ ПО
		               |		ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница,
		               |		ВремяРаботыСотрудниковПлан.Сотрудник,
		               |		НАЧАЛОПЕРИОДА(ВремяРаботыСотрудниковПлан.ДатаВремяОкончания, ДЕНЬ)) КАК ВремяРаботыСотрудниковПлан
		               |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.РабочееВремяСотрудников.Обороты(
		               |				&НачалоПериода,
		               |				&КонецПериода,
		               |				Авто,
		               |				Сотрудник = &Сотрудник
		               |					И Врач = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		               |					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК РабочееВремяСотрудниковФакт
		               |		ПО ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница = РабочееВремяСотрудниковФакт.СтруктурнаяЕдиница
		               |			И ВремяРаботыСотрудниковПлан.Сотрудник = РабочееВремяСотрудниковФакт.Сотрудник
		               |			И ВремяРаботыСотрудниковПлан.Дата = РабочееВремяСотрудниковФакт.ПериодДень
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата";
		
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", НачислениеУдержание.СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("Сотрудник", 			НачислениеУдержание.Владелец);
		Запрос.УстановитьПараметр("НачалоПериода", 		НачалоДня(ПериодС));
		Запрос.УстановитьПараметр("КонецПериода", 		КонецДня(ПериодПо));

		Выборка = Запрос.Выполнить().Выбрать();
					
		План = 0;
		Пока Выборка.Следующий() Цикл
			План = План + ?(ПоЧасам, Выборка.ЧасовПлан, Выборка.ДнейПлан);
		КонецЦикла;
		Выборка.Сбросить();
		СуммаНачислено = 0;
		ФактИтог = 0;
		Индекс = 0;
		ИндексПоследнейСтрокиССуммой = 0;
		Пока Выборка.Следующий() Цикл
			Факт = ?(ПоЧасам, Выборка.ЧасовФакт, Выборка.ДнейФакт);
			ДобавитьРасшифровкуНачисленияВЗатраты(ТаблицаРасшифровкиНачислений, НачислениеУдержание, Выборка.Дата, , , ,
							План, Факт, , НачислениеУдержание.Размер, НачислениеУдержание.Размер * ?(План <> 0, Факт / План, 0));			
			СуммаНачислено = СуммаНачислено + Окр(НачислениеУдержание.Размер * ?(План <> 0, Факт / План, 0), 2);
			ФактИтог = ФактИтог + Факт; 
			ИндексПоследнейСтрокиССуммой = ?(Факт = 0 Или План = 0, ИндексПоследнейСтрокиССуммой, Индекс);
			Индекс = Индекс + 1;
		КонецЦикла;
		
		// при округлении образовалась погрешность, прибавляем к последнему дню
		Если Выборка.Количество() > 1 И Окр(НачислениеУдержание.Размер * ?(План <> 0, ФактИтог / План, 0), 2) <> СуммаНачислено Тогда 
			ИндексСпогрешностью = ТаблицаРасшифровкиНачислений.Количество() - Выборка.Количество() + ИндексПоследнейСтрокиССуммой; 
			ТаблицаРасшифровкиНачислений[ИндексСпогрешностью].Сумма = ТаблицаРасшифровкиНачислений[ИндексСпогрешностью].Сумма + Окр(НачислениеУдержание.Размер * ?(План <> 0, ФактИтог / План, 0), 2) - СуммаНачислено;
		КонецЕсли;

		
	КонецЕсли;         

КонецПроцедуры // РасчетПоОкладу()

// Функция расчета заработной платы для значения "Удержание"
//
Процедура РасчетыПоУдержанию(ТаблицаРасшифровкиНачислений, НачислениеУдержание, ПериодС, ПериодПо, СтруктураПереопределенияБазы = Неопределено)
	
	Если СтруктураПереопределенияБазы <> Неопределено Тогда
		ДобавитьРасшифровкуНачисленияВЗатраты(ТаблицаРасшифровкиНачислений, НачислениеУдержание, ПериодПо, , , , , , 
							СтруктураПереопределенияБазы.База, СтруктураПереопределенияБазы.Размер, СтруктураПереопределенияБазы.Размер * СтруктураПереопределенияБазы.База);
		Возврат;
	КонецЕсли;
	
	ДобавитьРасшифровкуНачисленияВЗатраты(ТаблицаРасшифровкиНачислений, НачислениеУдержание, ПериодПо, , , , , , 
						1, -НачислениеУдержание.Размер,  1 * -НачислениеУдержание.Размер);
	
КонецПроцедуры

// Процедура добавляет расшифровку начисления в ТЧ Затраты
//
//		РасшифровкаНачисления - выборка результатов запроса, содержащая расшифровку начисления,
//								либо Число - если не нужно выводить расшифровку по строкам;
//		СтрокаПараметры - ссылка на элемент справочника начислений/удержаний;
//		
//		Через параметр СуммаЗатрат процедура может вернуть общую сумму начисления
//				(актуально для начислений вида "процент от продаж", где для исключения разницы, возникающей при округлениях,
//				 в ТЧ РасчетЗарплаты по начислению пишется сумма, полученная в данной процедуре)
//
Процедура ДобавитьРасшифровкуНачисленияВЗатраты(ТаблицаРасшифровкиНачислений, НачислениеУдержание, Дата = Неопределено, Документ = Неопределено, Контрагент = Неопределено, Номенклатура = Неопределено, План = 0, Факт = 0, База = 0, Размер = 0, Сумма = 0)
	
	// Если Сумма <> 0 Тогда
		
		НоваяСтрока = ТаблицаРасшифровкиНачислений.Добавить();
		
		НоваяСтрока.Дата 			= Дата;
		НоваяСтрока.Документ 		= Документ;
		НоваяСтрока.Контрагент 		= Контрагент;
		НоваяСтрока.Номенклатура 	= Номенклатура;
		НоваяСтрока.Сотрудник 		= НачислениеУдержание.Владелец;
		НоваяСтрока.ВидНачисления   = НачислениеУдержание;
		НоваяСтрока.План 			= План;
		НоваяСтрока.Факт 			= Факт;
		НоваяСтрока.База 			= База;
		НоваяСтрока.Размер 			= Размер;
		НоваяСтрока.Сумма			= Сумма; 
		
	// КонецЕсли;
	
КонецПроцедуры

// Функция рассчитывает и возвращает базу, если в начислении процент от части суммы.
//
Функция РасчетБазыПоНачислению(НачислениеУдержание, База)

	Если База > 0 И НачислениеУдержание.ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Процент 
		И НачислениеУдержание.УсловиеСумма = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ОтЧастиСуммы Тогда
		
		ВидСравненияУсловия = НачислениеУдержание.ТипСравненияУсловиеСумма;
		СуммаОт     		= НачислениеУдержание.УсловиеСуммаОт;
		СуммаДо  		    = НачислениеУдержание.УсловиеСуммаДо;  
		
		Если ВидСравненияУсловия = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.Больше Тогда  		
			Если База > СуммаОт Тогда
				НоваяБаза = База - СуммаОт;
				Возврат ?(НоваяБаза < 0, 0, НоваяБаза);				
			Иначе
				Возврат 0;					
			КонецЕсли; 		
		КонецЕсли;  
		
		Если ВидСравненияУсловия = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.Меньше Тогда 					
			Если База <= СуммаДо Тогда 
				Возврат База;
			Иначе 
				Возврат СуммаДо; 			
			КонецЕсли; 		
		КонецЕсли;
		
		Если ВидСравненияУсловия = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.Между Тогда 
			
			Если База >= СуммаОт И База <= СуммаДо Тогда
				Возврат База;
			ИначеЕсли База < СуммаОт Тогда
				Возврат 0;
			ИначеЕсли База > СуммаДо Тогда
				Возврат СуммаДо;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли; 
	
	Возврат База;		
	
КонецФункции

#КонецОбласти

#КонецЕсли
