
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("СтруктурнаяЕдиница") Тогда
		СтруктурнаяЕдиница   = ДанныеЗаполнения.СтруктурнаяЕдиница;
		Организация          = СтруктурнаяЕдиница.Организация;
		АвторДокумента       = ПараметрыСеанса.ТекущийПользователь;	
		ДатаНачалаПериода	 = НачалоМесяца(ТекущаяДата());
		ДатаОкончанияПериода = КонецМесяца(ТекущаяДата());
	Иначе
		СтруктурнаяЕдиница	 = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница; 			
		Организация          = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.Организация;	
		АвторДокумента       = ПараметрыСеанса.ТекущийПользователь;	
		ДатаНачалаПериода	 = НачалоМесяца(ТекущаяДата());
		ДатаОкончанияПериода = КонецМесяца(ТекущаяДата());
		
	КонецЕсли;
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	                       
КонецПроцедуры

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	 
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Простоавляем не заполненные статьи затрат
	Для Каждого СтрокаТ ИЗ ЭтотОбъект.Затраты Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТ.СтатьяРасходов) Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаТ.Номенклатура) Тогда
				Если СтрокаТ.ВидНачисления.ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Оклад Тогда
					СтрокаТ.СтатьяРасходов = Справочники.СтатьиДоходовИРасходов.Оклад;
				ИначеЕсли СтрокаТ.ВидНачисления.ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Начисление Тогда
					СтрокаТ.СтатьяРасходов = Справочники.СтатьиДоходовИРасходов.ПрочееНачисление;
				ИначеЕсли СтрокаТ.ВидНачисления.ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Удержание Тогда
					СтрокаТ.СтатьяРасходов = Справочники.СтатьиДоходовИРасходов.ПрочееУдержание;
				ИначеЕсли СтрокаТ.ВидНачисления.ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Тариф Тогда
					СтрокаТ.СтатьяРасходов = Справочники.СтатьиДоходовИРасходов.Тариф;
				КонецЕсли;
			Иначе
				СтрокаТ.СтатьяРасходов = Справочники.СтатьиДоходовИРасходов.ЗарплатаВПроцентахОтВыручки;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	СуммаДокумента = РасчетЗарплаты.Итог("Сумма") + ПрочиеНачисленияИУдержания.Итог("Сумма");
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, Режим)

	// Инициализация дополнительных свойств для проведения документа.
	ДвиженияДокументовСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);	
	
    // Инициализация данных документа.	
	Документы.НачислениеЗарплаты.УстановитьНачальныеДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	ДополнительныеСвойства.ДляПроведения.Вставить("ВыполнятьДвиженияРасчетыСПерсоналом", Истина);

	// Движения по регистрам
	ДвиженияДокументовСервер.РасчетыСПерсоналом(ДополнительныеСвойства, Движения, Отказ);	
	ДвиженияДокументовСервер.Затраты(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.Управленческий(ДополнительныеСвойства, Движения, Отказ);

    // Запись наборов записей.
	ДвиженияДокументовСервер.ДобавитьНаборыЗаписей(ЭтотОбъект);	

КонецПроцедуры

// Обработка проверки заполнения объекта
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НачалоМесяца(ДатаНачалаПериода) <> НачалоМесяца(ДатаОкончанияПериода) Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Период начисления должен находится в границах одного месяца!");	
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из РасчетЗарплаты Цикл
		
		Если СтрокаТЧ.ПериодС >= КонецДня(СтрокаТЧ.ПериодПо) Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По сотруднику " + Строка(СтрокаТЧ.Сотрудник)+" неправильно указан период, ""период с"" должен быть больше ""периода по""");
		КонецЕсли;
		
		ЗапросПроверка = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		                              |	РасчетЗарплаты.Ссылка
		                              |ИЗ
		                              |	Документ.НачислениеЗарплаты.РасчетЗарплаты КАК РасчетЗарплаты
		                              |ГДЕ
		                              |	РасчетЗарплаты.Ссылка.Проведен
		                              |	И РасчетЗарплаты.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		                              |	И РасчетЗарплаты.Сотрудник = &Сотрудник
		                              |	И (РасчетЗарплаты.ПериодС >= &НачалоПериода
		                              |				И РасчетЗарплаты.ПериодС <= &ОкончаниеПериода
		                              |			ИЛИ РасчетЗарплаты.ПериодПо >= &НачалоПериода
		                              |				И РасчетЗарплаты.ПериодПо <= &ОкончаниеПериода)
		                              |	И РасчетЗарплаты.Ссылка <> &Ссылка");						
		ЗапросПроверка.УстановитьПараметр("СтруктурнаяЕдиница"  , СтруктурнаяЕдиница);
		ЗапросПроверка.УстановитьПараметр("Сотрудник"           , СтрокаТЧ.Сотрудник);
		ЗапросПроверка.УстановитьПараметр("НачалоПериода"       , СтрокаТЧ.ПериодС);
		ЗапросПроверка.УстановитьПараметр("ОкончаниеПериода"    , СтрокаТЧ.ПериодПо);
		ЗапросПроверка.УстановитьПараметр("НачислениеУдержание" , СтрокаТЧ.НачислениеУдержание);
		ЗапросПроверка.УстановитьПараметр("Ссылка"              , Ссылка);
		
		РезультатПроверкиНачисления = ЗапросПроверка.Выполнить().Выбрать();
		
		Если РезультатПроверкиНачисления.Следующий() Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По сотруднику """ + Строка(СтрокаТЧ.Сотрудник)+""" в текущем периоде зарплата уже была рассчитана документом """ + Строка(РезультатПроверкиНачисления.Ссылка) + """");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти


