
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБЩЕГО НАЗНАЧЕНИЯ

#Область СлужебныйПрограммныйИнтерфейс

// Выполнить редактирование состава свойств
//
Процедура РедактироватьСоставСвойств(Форма, Ссылка) Экспорт
	
	Наборы = Форма.__Свойства_ОсновнойНабор;
	// Если вернули СправочникСсылка.НаборыСвойств, то это объект с одним набором свойств
	Если ТипЗнч(Наборы) = Тип("СправочникСсылка.НаборыСвойств") Тогда
		ПараметрыФормыНабораСвойств = Новый Структура("Ключ", Форма.__Свойства_ОсновнойНабор);
		
		ОткрытьФорму("Справочник.НаборыСвойств.Форма.ФормаЭлемента", ПараметрыФормыНабораСвойств,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
       	// ...Иначе - это объект у которого может быть несколько наборов свойств 
	// и требуется выбрать редактируемый набор
	Иначе
		Если Наборы.Количество() = 1 Тогда
			Элемент = Наборы.Получить(0);
		Иначе
			Элемент = Наборы.ВыбратьЭлемент();
			Если Элемент = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		ПараметрыФормыНабораСвойств = Новый Структура("Ключ", Элемент.Значение);
		
		ОткрытьФорму("Справочник.НаборыСвойств.Форма.ФормаЭлемента", ПараметрыФормыНабораСвойств,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
	КонецЕсли;
	
КонецПроцедуры

// Проверить, связано ли оповещение с изменением набора свойств и нужно ли 
// обрабатывать его в текущей форме
Функция ОбрабатыватьОповещения(Форма, ИмяСобытия, Параметр) Экспорт
	
	Если (ИмяСобытия <> "ИзмененНаборСвойств") ИЛИ Не Форма.__Свойства_ИспользоватьСвойства Тогда
		Возврат Ложь;
		
	ИначеЕсли Форма.__Свойства_ОсновнойНабор = Параметр Тогда
		Возврат Истина;
		
	ИначеЕсли (ТипЗнч(Форма.__Свойства_ОсновнойНабор) = Тип("СписокЗначений"))
		И (Форма.__Свойства_ОсновнойНабор.НайтиПоЗначению(Параметр) <> Неопределено) Тогда
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область СОБЫТИЯ_ЭЛЕМЕНТОВ_ФОРМЫ

// Процедура - Открыть форму ввода доп информации
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ОткрытьФормуВводаДопИнформации(Результат = Неопределено, ДополнительныеПараметры = Неопределено, Форма, Знач ВладелецСсылка = Неопределено) Экспорт
	
	ЭтоКлиент 		= Ложь;
	ЭтоКонтрагент 	= Ложь;
		
	Если ТипЗнч(ВладелецСсылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		Если Форма.ИмяФормы = "Документ.Прием.Форма.ФормаДокумента" Тогда
			ЭтоКлиент 		= Истина;
		ИначеЕсли Форма.Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиенты") Тогда 
			ЭтоКлиент 		= Истина;
		Иначе 
			ЭтоКонтрагент 	= Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Если ТипЗнч(Результат) = Тип("КодВозвратаДиалога") И Результат = КодВозвратаДиалога.Да Тогда
		Записать = Истина;
	ИначеЕсли ТипЗнч(Результат) = Тип("КодВозвратаДиалога") И Результат = КодВозвратаДиалога.Нет Тогда
		Записать = Ложь;
	Иначе
		Записать = Неопределено;
	КонецЕсли;	
	
	Если ВладелецСсылка.Пустая() Тогда
		Если Записать = Неопределено Тогда
			Возврат;
		ИначеЕсли Записать = Истина И Форма.ПроверитьЗаполнение() Тогда
			ФормаЗаписана = Форма.Записать();
			ВладелецСсылка = Форма.Объект.Ссылка;
			Если НЕ ФормаЗаписана Тогда
				Возврат;
			КонецЕсли;
			Если ЭтоКлиент Тогда 
				Форма.Заголовок = Строка(ВладелецСсылка) + " (Клиент)";
			КонецЕсли;	
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ЭтоУдостоверениеЛичности") И ДополнительныеПараметры.ЭтоУдостоверениеЛичности Тогда 
		
		Параметр = Новый Структура("Контрагент", ВладелецСсылка);
		ОткрытьФорму("РегистрСведений.ДокументыФизическихЛиц.Форма.ФормаЗаписиБыстрая", Параметр,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	ИначеЕсли ДополнительныеПараметры.Свойство("ЭтоПолис") И ДополнительныеПараметры.ЭтоПолис Тогда
		
		Параметр = Новый Структура("Контрагент", ВладелецСсылка);
		ОткрытьФорму("Справочник.ПолисыМедицинскогоСтрахования.Форма.ФормаЭлемента", Параметр,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	ИначеЕсли ДополнительныеПараметры.Свойство("ЭтоСкидка") И ДополнительныеПараметры.ЭтоСкидка Тогда
				
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ТипПолучателя"			, ПредопределенноеЗначение("Перечисление.ТипыПолучателейСкидкиНаценки.ОграниченоСпискомКлиентов"));
		ПараметрыОтбора.Вставить("ТекущаяСтруктурнаяЕдиница", Истина); 
		ПараметрыОтбора.Вставить("ТекущаяДата"				, ТекущаяДата());
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Отбор"			, ПараметрыОтбора);
		ПараметрыОткрытия.Вставить("Клиент"			, ВладелецСсылка);
		ПараметрыОткрытия.Вставить("ПравоНазначения", Истина);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборСкидкиЗавершение", Форма);
		
		ОткрытьФорму("Справочник.СкидкиНаценки.ФормаВыбора", 
					 ПараметрыОткрытия,, 
					 Новый УникальныйИдентификатор,,,
					 ОписаниеОповещения,
					 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
					 
	ИначеЕсли ДополнительныеПараметры.Свойство("ЭтоКарта") И ДополнительныеПараметры.ЭтоКарта Тогда
		
		Параметр = Новый Структура("ВладелецКарты", ВладелецСсылка);
		ОткрытьФорму("Справочник.Карты.Форма.ФормаНовогоЭлемента", Параметр);  			 
		
	ИначеЕсли ДополнительныеПараметры.Свойство("ЭтоВзносНаЛицевойСчет") И ДополнительныеПараметры.ЭтоВзносНаЛицевойСчет Тогда
		
		ЛицевойСчет = Неопределено;
		ДополнительныеПараметры.Свойство("ЛицевойСчет", ЛицевойСчет);
		ПараметрыФормы = Новый Структура("Контрагент, ЛицевойСчет", ВладелецСсылка, ЛицевойСчет);
		ОткрытьФорму("Обработка.ПомощникПроведенияОплаты.Форма.ДиалогВзносаНаЛицевойСчет", ПараметрыФормы, Форма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ДополнительныеПараметры.Свойство("ЭтоРодственник") И ДополнительныеПараметры.ЭтоРодственник Тогда	
		
		Параметр = Новый Структура("Контрагент", ВладелецСсылка);
		ОткрытьФорму("РегистрСведений.РодственныеСвязи.Форма.ФормаЗаписиБыстрая", Параметр,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ДополнительныеПараметры.Свойство("ЭтоПользовательИБ") И ДополнительныеПараметры.ЭтоПользовательИБ Тогда	
		
		Параметр = Новый Структура("Ключ", ВладелецСсылка);
		ОткрытьФорму("Справочник.Пользователи.Форма.ФормаЭлемента", Параметр,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

// Функция, возвращает значение из структуры по ключу.
//
Функция ПолучитьЗначениеИзСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);	    
		
КонецФункции

// Процедура - Действие дополнительной информации нажатие
//
// Параметры:
//  Форма	 - 	 - 
//  Элемент	 - 	 - 
//
Процедура ДействиеДополнительнойИнформацииНажатие(Форма, Элемент) Экспорт
	
	СтруктураДанныеЭлемента = ПолучитьДанныеЭлемента(Форма, Элемент);
	
	Если СтруктураДанныеЭлемента.ДанныеЭлемента = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если СтруктураДанныеЭлемента.ИмяТаблицы = "УдостоверенияЛичностиСуществующие" Тогда 
		
		КлючСтруктурой = ПолучитьКлючСтруктурой(СтруктураДанныеЭлемента);
		Если КлючСтруктурой <> Неопределено Тогда
			ПараметрыМассив = Новый Массив;
			ПараметрыМассив.Добавить(КлючСтруктурой);   		
			КлючЗаписиРегистра = Новый("РегистрСведенийКлючЗаписи.ДокументыФизическихЛиц", ПараметрыМассив);
			ОткрытьФорму("РегистрСведений.ДокументыФизическихЛиц.Форма.ФормаЗаписиБыстрая", Новый Структура("Ключ", КлючЗаписиРегистра),,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);//РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		КонецЕсли;
		
	ИначеЕсли СтруктураДанныеЭлемента.ИмяТаблицы = "ПолисыСуществующие" Тогда
		
		ОткрытьФорму("Справочник.ПолисыМедицинскогоСтрахования.Форма.ФормаЭлементаБыстрая", Новый Структура("Ключ", СтруктураДанныеЭлемента.ДанныеЭлемента.Полис),,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	ИначеЕсли СтруктураДанныеЭлемента.ИмяТаблицы = "СкидкиСуществующие" Тогда
		
		ОткрытьФорму("Справочник.СкидкиНаценки.Форма.ФормаЭлемента", Новый Структура("Ключ", СтруктураДанныеЭлемента.ДанныеЭлемента.Скидка),,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	ИначеЕсли СтруктураДанныеЭлемента.ИмяТаблицы = "МестаРаботы" Тогда
			
		ОткрытьФорму("Справочник.СтруктурныеЕдиницы.Форма.ФормаЭлемента", Новый Структура("Ключ", СтруктураДанныеЭлемента.ДанныеЭлемента.СтруктурнаяЕдиница),,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
				
	ИначеЕсли СтруктураДанныеЭлемента.ИмяТаблицы = "ТаблицаЛицевыхБонусныхСчетов" Тогда
		
		Если ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.ЛицевойБонусныйСчет) Тогда
			
			ЭтоЛицевойСчет = ТипЗнч(СтруктураДанныеЭлемента.ДанныеЭлемента.ЛицевойБонусныйСчет) = Тип("СправочникСсылка.ВидыЛицевыхСчетов");
			
			Если ЭтоЛицевойСчет И (НЕ Форма = Неопределено И СтрЧислоВхождений(Форма.ИмяФормы, "ФормаЭлементаКлиенты") > 0
					И ЗначениеЗаполнено(Форма.Объект.Ссылка)) Тогда
				
				ВидЛС = СтруктураДанныеЭлемента.ДанныеЭлемента.ЛицевойБонусныйСчет;
				ВладелецСчета = Форма.Объект.Ссылка;
				ОткрытьФорму("Справочник.ВидыЛицевыхСчетов.Форма.ФормаЛицевогоСчета", Новый Структура("ВладелецСчета, ВидСчета", ВладелецСчета, ВидЛС),
							 ,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
							 
			ИначеЕсли ЭтоЛицевойСчет ИЛИ ТипЗнч(СтруктураДанныеЭлемента.ДанныеЭлемента.ЛицевойБонусныйСчет) = Тип("СправочникСсылка.БонусныеСчета") Тогда
				ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(СтруктураДанныеЭлемента.ДанныеЭлемента.ЛицевойБонусныйСчет));	
			КонецЕсли;

		КонецЕсли;
		
	ИначеЕсли СтруктураДанныеЭлемента.ИмяТаблицы = "РодственникиСуществующие" Тогда 
		
		//	Если НЕ НавигационнаяСсылка = Неопределено Тогда
		//Если Лев(НавигационнаяСсылка, 34) = "РедактированиеРодственныхСвязейИД_" Тогда
		// Открываем запись регистра
		КлючСтруктурой = ПолучитьКлючСтруктурой(СтруктураДанныеЭлемента);
		Если КлючСтруктурой <> Неопределено Тогда
			ПараметрыМассив = Новый Массив;
			ПараметрыМассив.Добавить(КлючСтруктурой);   		
			КлючЗаписиРегистра = Новый("РегистрСведенийКлючЗаписи.РодственныеСвязи", ПараметрыМассив);
			ОткрытьФорму("РегистрСведений.РодственныеСвязи.Форма.ФормаЗаписиБыстрая", Новый Структура("Ключ", КлючЗаписиРегистра),,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);//РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		КонецЕсли;
	ИначеЕсли СтруктураДанныеЭлемента.ИмяТаблицы = "ДоступныеКассы" Тогда
		
		Если СтруктураДанныеЭлемента.ДанныеЭлемента.Основная Тогда 
			ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(СтруктураДанныеЭлемента.ДанныеЭлемента.Касса));
		Иначе 
			СписокВариантов = Новый СписокЗначений;
			СписокВариантов.Добавить(0, "Открыть");
			СписокВариантов.Добавить(1, "Назначить основной");
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыборВариантаДействияСКассой", Форма, СтруктураДанныеЭлемента.ДанныеЭлемента);
			Форма.ПоказатьВыборИзМеню(ОписаниеОповещения, СписокВариантов, Элемент);
		КонецЕсли;
		
	ИначеЕсли СтруктураДанныеЭлемента.ИмяТаблицы = "ПользователиИБСуществующие" Тогда
		
		ОткрытьФорму("Справочник.Пользователи.Форма.ФормаЭлемента", Новый Структура("Ключ", СтруктураДанныеЭлемента.ДанныеЭлемента.Пользователь),,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	ИначеЕсли СтруктураДанныеЭлемента.ИмяТаблицы = "Информация_По_Оплате" Тогда
		
		Если ЗначениеЗаполнено(СтруктураДанныеЭлемента.ДанныеЭлемента.ДокументОплаты) Тогда
			ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(СтруктураДанныеЭлемента.ДанныеЭлемента.ДокументОплаты));	
		КонецЕсли;		
		
	ИначеЕсли СтруктураДанныеЭлемента.ИмяТаблицы = "ДолгиСуществующие" Тогда
		
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(СтруктураДанныеЭлемента.ДанныеЭлемента.Основание)); 
		
	ИначеЕсли СтруктураДанныеЭлемента.ИмяТаблицы = "КартыСуществующие" Тогда
			
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(СтруктураДанныеЭлемента.ДанныеЭлемента.КартаСсылка));	
		
	ИначеЕсли СтруктураДанныеЭлемента.ИмяТаблицы = "БудущиеСобытия" Тогда
		
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(СтруктураДанныеЭлемента.ДанныеЭлемента.Событие)); 	
		
	ИначеЕсли СтруктураДанныеЭлемента.ИмяТаблицы = "ПромокодыСуществующие" Тогда	
		
		КлючСтруктурой = Новый Структура;
		КлючСтруктурой.Вставить("Вид"		, СтруктураДанныеЭлемента.ДанныеЭлемента.ПромокодСсылка);
		КлючСтруктурой.Вставить("Владелец"	, Форма.Объект.Ссылка);
		ПараметрыМассив = Новый Массив;
		ПараметрыМассив.Добавить(КлючСтруктурой);   		
		КлючЗаписиРегистра = Новый("РегистрСведенийКлючЗаписи.Промокоды", ПараметрыМассив);
		ОткрытьФорму("РегистрСведений.Промокоды.Форма.ФормаЗаписиБыстрая", Новый Структура("Ключ", КлючЗаписиРегистра),,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - Действие дополнительной информации нажатие
//
// Параметры:
//  Форма	 - 	 - 
//  Элемент	 - 	 - 
//
Процедура ДействиеДополнительнойИнформации_Удалить_Нажатие(Форма, Элемент) Экспорт
	
	СтруктураДанныеЭлемента = ПолучитьДанныеЭлемента(Форма, Элемент);
	
	Если СтруктураДанныеЭлемента.ДанныеЭлемента = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	//Если СтруктураДанныеЭлемента.ИмяТаблицы = "УдостоверенияЛичностиСуществующие" Тогда 
	//	
	//	КлючСтруктурой = ПолучитьКлючСтруктурой(СтруктураДанныеЭлемента);
	//	Если КлючСтруктурой <> Неопределено Тогда
	//		ПараметрыМассив = Новый Массив;
	//		ПараметрыМассив.Добавить(КлючСтруктурой);   		
	//		КлючЗаписиРегистра = Новый("РегистрСведенийКлючЗаписи.ДокументыФизическихЛиц", ПараметрыМассив);
	//		ОткрытьФорму("РегистрСведений.ДокументыФизическихЛиц.Форма.ФормаЗаписи", Новый Структура("Ключ", КлючЗаписиРегистра),,,,,, РежимОткрытияОкнаФормы.Независимый);//РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	//	КонецЕсли;
	//	
	//ИначеЕсли СтруктураДанныеЭлемента.ИмяТаблицы = "КартыСуществующие" Тогда
	//	
	//	ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(СтруктураДанныеЭлемента.ДанныеЭлемента.КартаСсылка));
	//	
	//ИначеЕсли СтруктураДанныеЭлемента.ИмяТаблицы = "АвтомобилиСуществующие" Тогда
	//	
	//	ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(СтруктураДанныеЭлемента.ДанныеЭлемента.АвтомобильСсылка));
	//	
	//ИначеЕсли СтруктураДанныеЭлемента.ИмяТаблицы = "РодственникиСуществующие" Тогда 
	//	
	//	КлючСтруктурой = ПолучитьКлючСтруктурой(СтруктураДанныеЭлемента);
	//	Если КлючСтруктурой <> Неопределено Тогда
	//		ПараметрыМассив = Новый Массив;
	//		ПараметрыМассив.Добавить(КлючСтруктурой);   		
	//		КлючЗаписиРегистра = Новый("РегистрСведенийКлючЗаписи.РодственныеСвязи", ПараметрыМассив);
	//		ОткрытьФорму("РегистрСведений.РодственныеСвязи.Форма.ФормаЗаписи", Новый Структура("Ключ", КлючЗаписиРегистра),,,,,, РежимОткрытияОкнаФормы.Независимый);//РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	//	КонецЕсли;
	//	
	//ИначеЕсли СтруктураДанныеЭлемента.ИмяТаблицы = "ЧленстваПакетУслугСуществующие" Тогда
	//	
	//	ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(СтруктураДанныеЭлемента.ДанныеЭлемента.ЧленствоПакетУслугСсылка));
	//	
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВСПОМОГАТЕЛЬНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

// Функция - Получить данные элемента
//
// Параметры:
//  Форма	 - 	 - 
//  Элемент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеЭлемента(Знач Форма, Знач Элемент) Экспорт
		
	Если СтрНачинаетсяС(Элемент.Имя, "УдостоверенияЛичностиСуществующие") Тогда 
		
		ИмяТаблицы 				= "УдостоверенияЛичностиСуществующие"; 
		ИДСтрокиДанных = Число(СтрРазделить(Элемент.Имя, "_")[1]);
		ДанныеЭлемента 			= Форма.УдостоверенияЛичностиСуществующие.НайтиПоИдентификатору(ИДСтрокиДанных);
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "МестоРаботыВыбранные_") ИЛИ СтрНачинаетсяС(Элемент.Имя, "МестоРаботыУдалить_") Тогда 
		
		ИмяТаблицы 				= "МестаРаботы";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, ?(СтрНачинаетсяС(Элемент.Имя, "МестоРаботыВыбранные_"), СтрДлина("МестоРаботыВыбранные_"), СтрДлина("МестоРаботыУдалить_")) + 1));
		ДанныеЭлемента 			= ?(Форма.Объект.Свойство("ДоступныеСтруктурныеЕдиницы") И Форма.Объект.ДоступныеСтруктурныеЕдиницы.Количество() >= ИндексСтроки + 1, Форма.Объект.ДоступныеСтруктурныеЕдиницы[ИндексСтроки], Форма.ДоступныеСтруктурныеЕдиницы[ИндексСтроки]);
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ЖурналыПриемовВыбранные_") Тогда 
		
		ИмяТаблицы 				= "МестаРаботы";		
		ИндексСтроки			= Число(СтрРазделить(Элемент.Имя, "_")[1]);
		ДанныеЭлемента 			= ?(Форма.Объект.Свойство("ДоступныеЖурналыПриемов"), Форма.Объект.ДоступныеЖурналыПриемов[ИндексСтроки], Форма.ДоступныеЖурналыПриемов[ИндексСтроки]);
	
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ДоступнаяКассаВыбранные_") ИЛИ СтрНачинаетсяС(Элемент.Имя, "ДоступнаяКассаУдалить_") Тогда 
		
		ИмяТаблицы 				= "ДоступныеКассы";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, ?(СтрНачинаетсяС(Элемент.Имя, "ДоступнаяКассаВыбранные_"), СтрДлина("ДоступнаяКассаВыбранные_"), СтрДлина("ДоступнаяКассаУдалить_")) + 1));
		ДанныеЭлемента 			= Форма.ДоступныеКассы[ИндексСтроки];
	
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ПолисКонтрагента") Тогда
		
		ИмяТаблицы 				= "ПолисыСуществующие";	
		ИДСтрокиДанных = Число(СтрРазделить(Элемент.Имя, "_")[1]);
		ДанныеЭлемента 			= Форма.ПолисыСуществующие.НайтиПоИдентификатору(ИДСтрокиДанных);
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "СкидкиСуществующие") Тогда
		
		ИмяТаблицы 				= "СкидкиСуществующие";		
		ИДСтрокиДанных = Число(СтрРазделить(Элемент.Имя, "_")[1]);
		ДанныеЭлемента 			= Форма.СкидкиСуществующие.НайтиПоИдентификатору(ИДСтрокиДанных);
		
	ИначеЕсли НЕ СтрНайти(Элемент.Имя, "_ДобавитьСтрокуТабличнойЧасти_") = 0 Тогда
		
		ИмяТаблицы 				= Сред(Элемент.Имя, СтрНайти(Элемент.Имя, "_ДобавитьСтрокуТабличнойЧасти_") + СтрДлина("_ДобавитьСтрокуТабличнойЧасти_"));
		ИндексСтроки 			= Неопределено;
		ДанныеЭлемента 			= Неопределено;
		
	ИначеЕсли НЕ СтрНайти(Элемент.Имя, "_УдалитьСтроку_ТЧ_") = 0 Тогда 
		
		ИмяТЧ_Индекс_Строкой 	= Сред(Элемент.Имя, СтрНайти(Элемент.Имя, "_УдалитьСтроку_ТЧ_") + СтрДлина("_УдалитьСтроку_ТЧ_"));
		ИмяТаблицы 				= Лев(ИмяТЧ_Индекс_Строкой, СтрНайти(ИмяТЧ_Индекс_Строкой, "_") - 1);
		ИндексСтроки 			= Число(Сред(ИмяТЧ_Индекс_Строкой, СтрНайти(ИмяТЧ_Индекс_Строкой, "_") + 1));
		ДанныеЭлемента 			= Форма.Объект[ИмяТаблицы][ИндексСтроки];
		
	ИначеЕсли НЕ СтрНайти(Элемент.Имя, "ПолеФормы_") = 0 И НЕ СтрНайти(Элемент.Имя, "_ТЧ_") = 0 Тогда
		
		ИмяТЧ_Индекс_Строкой 	= Сред(Элемент.Имя, СтрНайти(Элемент.Имя, "_ТЧ_") + СтрДлина("_ТЧ_"));
		ИмяТаблицы 				= Лев(ИмяТЧ_Индекс_Строкой, СтрНайти(ИмяТЧ_Индекс_Строкой, "_") - 1);
		ИндексСтроки 			= Число(Сред(ИмяТЧ_Индекс_Строкой, СтрНайти(ИмяТЧ_Индекс_Строкой, "_") + 1));
		ДанныеЭлемента 			= Форма.Объект[ИмяТаблицы][ИндексСтроки];
		
	ИначеЕсли НЕ СтрНайти(Элемент.Имя, "ПолеРедактирование_") = 0 И НЕ СтрНайти(Элемент.Имя, "_ТЧ_") = 0 Тогда
		
		ИмяТЧ_Индекс_Строкой 	= Сред(Элемент.Имя, СтрНайти(Элемент.Имя, "_ТЧ_") + СтрДлина("_ТЧ_"));
		ИмяТаблицы 				= Лев(ИмяТЧ_Индекс_Строкой, СтрНайти(ИмяТЧ_Индекс_Строкой, "_") - 1);
		ИндексСтроки 			= Число(Сред(ИмяТЧ_Индекс_Строкой, СтрНайти(ИмяТЧ_Индекс_Строкой, "_") + 1));
		ДанныеЭлемента 			= Форма.Объект[ИмяТаблицы][ИндексСтроки];
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "Лицевой_Бонусный_Счет_Контрагента_") Тогда
		
		ИмяТаблицы 				= "ТаблицаЛицевыхБонусныхСчетов";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("Лицевой_Бонусный_Счет_Контрагента_") + 1));
		ДанныеЭлемента 			= Форма.ТаблицаЛицевыхБонусныхСчетов[ИндексСтроки];
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "РодственникиСуществующие_") ИЛИ СтрНачинаетсяС(Элемент.Имя, "Родственники_Редактировать_") Тогда 
		
		ИмяТаблицы 				= "РодственникиСуществующие";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, ?(СтрНачинаетсяС(Элемент.Имя, "РодственникиСуществующие_"), СтрДлина("РодственникиСуществующие_"), СтрДлина("Родственники_Редактировать_")) + 1));
		ДанныеЭлемента 			= Форма.РодственникиСуществующие[ИндексСтроки];
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ПользователиИБСуществующие_") Тогда 
		
		ИмяТаблицы 				= "ПользователиИБСуществующие";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ПользователиИБСуществующие_") + 1));
		ДанныеЭлемента 			= Форма.ПользователиИБСуществующие[ИндексСтроки];
		
	ИначеЕсли НЕ СтрНайти(Элемент.Имя, "Основание_") = 0 Тогда
		
		ИндексСтроки 			= Число(Сред(Элемент.Имя, СтрНайти(Элемент.Имя, "_") + 1));
		ДанныеЭлемента 			= Форма.Объект.РасшифровкаПлатежа[ИндексСтроки];
		
	ИначеЕсли НЕ СтрНайти(Элемент.Имя, "КабинетыУдалить_") = 0 Тогда
		
		ИмяТаблицы 				= "КабинетыУдалить";
		МассивПодстрок			= СтрРазделить(Элемент.Имя, "_", Ложь);
		ИндексСтроки			= ?(МассивПодстрок.Количество() > 1, МассивПодстрок[1], -1);
		ДанныеЭлемента 			= Форма.КабинетыСуществующие.НайтиПоИдентификатору(ИндексСтроки);
		
	ИначеЕсли НЕ СтрНайти(Элемент.Имя, "КабинетыСуществующие_") = 0 Тогда
		
		ИмяТаблицы 				= "КабинетыСуществующие";
		МассивПодстрок			= СтрРазделить(Элемент.Имя, "_", Ложь);
		ИндексСтроки			= ?(МассивПодстрок.Количество() > 1, МассивПодстрок[1], -1); 
		ДанныеЭлемента 			= Форма.КабинетыСуществующие.НайтиПоИдентификатору(ИндексСтроки);   
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ДекорацияФормы_УдалениеИнтервала_") Тогда 
		
		ИмяТаблицы 				= "ОтборИнтервалыРаботы";				
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ДекорацияФормы_УдалениеИнтервала_") + 1));
		ДанныеЭлемента 			= Форма.ОтборИнтервалыРаботы[ИндексСтроки];
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "Подключаемый_ВыборНачалаИнтервала_") Тогда 
		
		ИмяТаблицы 				= "ОтборИнтервалыРаботы";				
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("Подключаемый_ВыборНачалаИнтервала_") + 1));
		ДанныеЭлемента 			= Форма.ОтборИнтервалыРаботы[ИндексСтроки];
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "Подключаемый_ВыборОкончанияИнтервала_") Тогда 
		
		ИмяТаблицы 				= "ОтборИнтервалыРаботы";				
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("Подключаемый_ВыборОкончанияИнтервала_") + 1));
		ДанныеЭлемента 			= Форма.ОтборИнтервалыРаботы[ИндексСтроки];
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "Подключаемый_Открыть_Субъект_Оплаты_") Тогда
		
		ИмяТаблицы 				= "Информация_По_Оплате";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("Подключаемый_Открыть_Субъект_Оплаты_") + 1));
		ДанныеЭлемента 			= Форма.Информация_По_Оплате[ИндексСтроки];  	
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ДолгиСуществующие_") Тогда
		
		ИмяТаблицы 				= "ДолгиСуществующие";
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ДолгиСуществующие_") + 1));
		ДанныеЭлемента 			= Форма.ДолгиСуществующие[ИндексСтроки];
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "КартыСуществующие_") Тогда
		
		ИмяТаблицы 				= "КартыСуществующие";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("КартыСуществующие_") + 1));
		ДанныеЭлемента 			= Форма.КартыСуществующие[ИндексСтроки];
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "БудущееСобытие_") Тогда
		
		ИмяТаблицы 				= "БудущиеСобытия";
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("БудущееСобытие_") + 1));
		ДанныеЭлемента 			= Форма.БудущиеСобытия[ИндексСтроки];
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ПромокодыСуществующие_") Тогда
		ИмяТаблицы 				= "ПромокодыСуществующие";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ПромокодыСуществующие_") + 1));
		ДанныеЭлемента 			= Форма.ПромокодыСуществующие[ИндексСтроки];
		
	Иначе 
		
		ИмяТаблицы 		= "";
		ДанныеЭлемента 	= Неопределено;
		
	КонецЕсли;
	
	Возврат Новый Структура("ИмяТаблицы, ИндексСтроки, ДанныеЭлемента", ИмяТаблицы, ИндексСтроки, ДанныеЭлемента);

	
КонецФункции

// Функция - Получить данные элемента виджета сделки
//
// Параметры:
//  Форма	 - 	 - 
//  Элемент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеЭлементаВиджетаСделки(Знач Форма, Знач Элемент) Экспорт
	
	Если СтрНачинаетсяС(Элемент.Имя, "ВыбратьВидГенерируемойСделки_") Тогда 
		
		ИмяТаблицы 				= "ТаблицаДоступныхВидовСделок";
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ВыбратьВидГенерируемойСделки_") + 1));
		ДанныеЭлемента 			= Форма.ТаблицаДоступныхВидовСделок[ИндексСтроки];
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ВыбратьЭтапГенерируемойСделки_") Тогда
		
		ИмяТаблицы 				= "ТаблицаДоступныхВидовСделок";
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ВыбратьЭтапГенерируемойСделки_") + 1));
		ДанныеЭлемента 			= Форма.Таблица_Задачи_БП_CRM[ИндексСтроки];
		
	//ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "Флаг_Выполнения_НеВыполненнойЗадачи_Поле_") Тогда
	//	
	//	ИмяТаблицы 				= "Таблица_Задачи_БП_CRM";		
	//	ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("Флаг_Выполнения_НеВыполненнойЗадачи_Поле_Индекс_") + 1));
	//	ДанныеЭлемента 			= Форма.Таблица_Задачи_БП_CRM[ИндексСтроки];
	//	
	//ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "Действие_ВыполненаяЗадача_Картинка_Индекс_") ИЛИ СтрНачинаетсяС(Элемент.Имя, "Действие_НеВыполненаяЗадача_Картинка_Индекс_") Тогда
	//	
	//	ИмяТаблицы 				= "Таблица_Задачи_БП_CRM";		
	//	ИндексСтроки			= Число(Сред(Элемент.Имя, ?(СтрНачинаетсяС(Элемент.Имя, "Действие_ВыполненаяЗадача_Картинка_Индекс_"), СтрДлина("Действие_ВыполненаяЗадача_Картинка_Индекс_"), СтрДлина("Действие_НеВыполненаяЗадача_Картинка_Индекс_")) + 1));
	//	ДанныеЭлемента 			= Форма.Таблица_Задачи_БП_CRM[ИндексСтроки];
	//	
	//ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "Действие_НеВыполненаяЗадача_Картинка_Корзина_Индекс_") Тогда
	//	
	//	ИмяТаблицы 				= "Таблица_Задачи_БП_CRM";		
	//	ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("Действие_НеВыполненаяЗадача_Картинка_Корзина_Индекс_") + 1));
	//	ДанныеЭлемента 			= Форма.Таблица_Задачи_БП_CRM[ИндексСтроки];
	//	
	//ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "Команда_ПроверитьВозможность_Выполнения_Задачи_Сейчас_Индекс_") Тогда
	//	
	//	ИмяТаблицы 				= "Таблица_Задачи_БП_CRM";		
	//	ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("Команда_ПроверитьВозможность_Выполнения_Задачи_Сейчас_Индекс_") + 1));
	//	ДанныеЭлемента 			= Форма.Таблица_Задачи_БП_CRM[ИндексСтроки];
		
	Иначе 
		
		ИмяТаблицы 		= "";
		ДанныеЭлемента 	= Неопределено;
		
	КонецЕсли;
	
	Возврат Новый Структура("ИмяТаблицы, ИндексСтроки, ДанныеЭлемента", ИмяТаблицы, ИндексСтроки, ДанныеЭлемента);
	
КонецФункции

// Функция - Получить данные элемента настройки действий триггерного события
//
// Параметры:
//  Форма	 - 	 - 
//  Элемент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеЭлементаНастройкиДействийТриггерногоСобытия(Знач Форма, Знач Элемент, Знач ТекущаяСтруктурнаяЕдиница = Неопределено, Знач Реквизит = "") Экспорт
	
	Если СтрНачинаетсяС(Элемент.Имя, "ИспользованиеДействия_") Тогда 
		
		ИмяТаблицы 				= "Действия";
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ИспользованиеДействия_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ВидДействия_") Тогда 
		
		ИмяТаблицы 				= "Действия";
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ВидДействия_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ДекорацияФормы_Картинка_УдалитьСтроку_ТЧ_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ДекорацияФормы_Картинка_УдалитьСтроку_ТЧ_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ВидИсполнителя_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ВидИсполнителя_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ВидИсполнителяРезервный_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ВидИсполнителяРезервный_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ВидПолучателя_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ВидПолучателя_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "Получатель_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("Получатель_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ОтправкаPush_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ОтправкаPush_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ОтправкаPushWallet_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ОтправкаPushWallet_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ОтправкаMessenger_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ОтправкаMessenger_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ОтправкаSMS_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ОтправкаSMS_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "АккаунтСообщенийМессенджера_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("АккаунтСообщенийМессенджера_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "АккаунтСообщений_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("АккаунтСообщений_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ВидСделки_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ВидСделки_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ЭтапСделки_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ЭтапСделки_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "СоздаватьСделку_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("СоздаватьСделку_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "КоличествоГенерацийСделок_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("КоличествоГенерацийСделок_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "СценарийЧатБота_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("СценарийЧатБота_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ШаблонСообщения_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ШаблонСообщения_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ОткрытьШаблонДействия_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ОткрытьШаблонДействия_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ОткрытьНастройкиУведомленийPush_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ОткрытьНастройкиУведомленийPush_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ОткрытьНастройкиУведомленийPushWallet_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ОткрытьНастройкиУведомленийPushWallet_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ОткрытьНастройкиУведомленийMessenger_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ОткрытьНастройкиУведомленийMessenger_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ОткрытьНастройкиУведомленийSMS_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ОткрытьНастройкиУведомленийSMS_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ВзаимодействиеРежимНапоминания_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ВзаимодействиеРежимНапоминания_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(Элемент.Имя, "ПрименитьПараметрыДействия_Индекс_") Тогда
		
		ИмяТаблицы 				= "Действия";		
		ИндексСтроки			= Число(Сред(Элемент.Имя, СтрДлина("ПрименитьПараметрыДействия_Индекс_") + 1));
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда 
			ДанныеЭлемента 		= Форма.Объект.Действия[ИндексСтроки];
		Иначе 
			ДанныеЭлемента 		= Форма[Реквизит][ИндексСтроки];
		КонецЕсли;
		
	Иначе 
		
		ИмяТаблицы 		= "";
		ДанныеЭлемента 	= Неопределено;
		
	КонецЕсли;
	
	СтрокаНастройкиКаналовУведомлений = Неопределено;
	Если НЕ ДанныеЭлемента = Неопределено И НЕ ТекущаяСтруктурнаяЕдиница = Неопределено Тогда
		// Клиентский метод. Юзаем цикл.
		Для Каждого СтрокаМоделируемыеНастройки Из Форма.МоделируемыеНастройкиКаналовУведомлений Цикл 
			Если СтрокаМоделируемыеНастройки.ИдентификаторДействия = ДанныеЭлемента.ИдентификаторДействия И СтрокаМоделируемыеНастройки.СтруктурнаяЕдиница = ТекущаяСтруктурнаяЕдиница Тогда 
				СтрокаНастройкиКаналовУведомлений = СтрокаМоделируемыеНастройки;
				Прервать;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	Возврат Новый Структура("ИмяТаблицы, ИндексСтроки, ДанныеЭлемента, СтрокаНастройкиКаналовУведомлений", ИмяТаблицы, ИндексСтроки, ДанныеЭлемента, СтрокаНастройкиКаналовУведомлений);
	
КонецФункции

// Функция, возвращает структуру данных документов физ. лиц 
// клиенту
//
Функция ПолучитьКлючСтруктурой(Знач СтруктураДанныеЭлемента)
	
	Если СтруктураДанныеЭлемента.ИмяТаблицы = "УдостоверенияЛичностиСуществующие" Тогда
		
		//СтруктураВозврата = Новый Структура("Период, ВидДокумента, Физлицо");	
		СтруктураВозврата = Новый Структура("ВидДокумента, Физлицо");
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, СтруктураДанныеЭлемента.ДанныеЭлемента);
		
	ИначеЕсли СтруктураДанныеЭлемента.ИмяТаблицы = "РодственникиСуществующие" Тогда
		
		СтруктураВозврата = Новый Структура("Контрагент, Родственник");	
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, СтруктураДанныеЭлемента.ДанныеЭлемента);
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции 

#КонецОбласти

#КонецОбласти