
#Область СлужебныеПроцедурыИФункции

// Процедура снимает отметку "Основная" у других записей переданного пользователя
//
//	Параметры:
//		Пользователь   - Справочники.Пользователи;
//		ОсновнаяЗапись - Ключ или Менеджер той записи регистра, которой необходимо оставить отметку "Основная"
//
Процедура ПриУстановкеФлагаОсновная(Пользователь, ОсновнаяЗапись) Экспорт
	
	НаборЗаписей = РегистрыСведений.УчетныеЗаписиЭлектроннойПочты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Прочитать();
	
	Для Каждого ЗаписьРегистра Из НаборЗаписей Цикл
		Если ЗаписьРегистра.УчетнаяЗапись = ОсновнаяЗапись.УчетнаяЗапись
		   И ЗаписьРегистра.Пользователь  = ОсновнаяЗапись.Пользователь Тогда
			
			ЗаписьРегистра.Основная = Истина;
			
		Иначе
			
			ЗаписьРегистра.Основная = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти