
#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает массив групп пользователей в которых находится текущий пользователь
//
Функция ПолучитьМассивГруппПользователей(ТекущийПользователь) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ГруппыПользователейСостав.Ссылка КАК ГруппыПользователей
	               |ИЗ
	               |	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	               |ГДЕ
	               |	ГруппыПользователейСостав.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);			   
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		МассивГруппПользователей = Новый Массив;
		МассивГруппПользователей = Результат.Выгрузить().ВыгрузитьКолонку("ГруппыПользователей");
		Возврат МассивГруппПользователей;
	Иначе
		МассивГруппПользователей = Новый Массив;
		Возврат МассивГруппПользователей;
	КонецЕсли;	
	
КонецФункции

#КонецОбласти