
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеЗапроса = ПолучитьПараметрыЗапроса(Запись.UIDЗапроса, Запись.Период);	
	
	ЭтаФорма.Заголовок = "HTTP-сервис: "+ ЭтотОбъект.Запись.Тип +"    "+ "'"+ЭтотОбъект.Запись.HTTPШаблон+"'";
	
	Если Не ДанныеЗапроса = Неопределено Тогда		
		Для Каждого СтрокаТЧ из ДанныеЗапроса.Заголовки Цикл
			НоваяСтрока = ЭтотОбъект.Заголовки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ); 			
		КонецЦикла;
		
		Если Не Запись.Исходящий Тогда
			Для Каждого СтрокаТЧ из ДанныеЗапроса.ПараметрыURL Цикл
				НоваяСтрока = ЭтотОбъект.ПараметрыURL.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ); 			
			КонецЦикла;
			
			Для Каждого СтрокаТЧ из ДанныеЗапроса.ПараметрыЗапроса Цикл
				НоваяСтрока = ЭтотОбъект.ПараметрыЗапроса.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ); 			
			КонецЦикла;
		КонецЕсли;

		ТелоЗапроса = СтрЗаменить(ДанныеЗапроса.ТелоЗапроса, ",", "," + Символы.ПС);
		ОтветJSON   = ДанныеЗапроса.ОтветJSON;		
		
		Если (Запись.HTTPШаблон = "rating" ИЛИ Запись.HTTPШаблон = "record"
			 ИЛИ Запись.HTTPШаблон = "request" ИЛИ Запись.HTTPШаблон = "lead") 
			 И Запись.HTTPМетод = "GET" Тогда
			Элементы.ОтветJSON.Вид = ВидПоляФормы.ПолеHTMLДокумента;			
			Элементы.ОтветJSON.Ширина = 64;
			Элементы.ОтветJSON.РастягиватьПоГоризонтали = Ложь;
			Элементы.ОтветJSON.Доступность = Ложь;
		КонецЕсли;
		
	Иначе
		Элементы.ГруппаСтраницы.Видимость = Ложь;
		Элементы.ГруппаОшибка.Видимость   = Истина;
	КонецЕсли;
	
	Если Запись.Статус = Перечисления.СтатусыЗапросов.Выполнен Тогда
		Элементы.Статус.ЦветТекста = Новый Цвет(0,150,70);
	Иначе
		Элементы.Статус.ЦветТекста = Новый Цвет(255,0,0);
	КонецЕсли;
	
	Если Запись.КодСостояния = 500 ИЛИ Запись.КодСостояния = 400 Тогда
		Элементы.КодСостояния.ЦветТекста = Новый Цвет(255,0,0);
	КонецЕсли;
	
	Элементы.Объект.Видимость = ЗначениеЗаполнено(Запись.Объект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Процедура, возвращает параметры http запроса.
//
Функция ПолучитьПараметрыЗапроса(UIDЗапроса, Период)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("UIDЗапроса", UIDЗапроса);
	Запрос.УстановитьПараметр("Период"    , Период);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЖурналЗапросов.ПараметрыЗапроса КАК ПараметрыЗапроса
	|ИЗ
	|	РегистрСведений.ЖурналЗапросов КАК ЖурналЗапросов
	|ГДЕ
	|	ЖурналЗапросов.Период = &Период
	|	И ЖурналЗапросов.UIDЗапроса = &UIDЗапроса";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.ПараметрыЗапроса.Получить(), Неопределено);	
	
КонецФункции  

#КонецОбласти
