
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Идентификатор", Идентификатор);
	Заголовок = НСтр("ru='ТСД'") + " """ + Строка(Идентификатор) + """";

	ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
	ЦветОшибки = ЦветаСтиля.ЦветОтрицательногоЧисла;

	СпМодель = Элементы.Модель.СписокВыбора;
	СпМодель.Добавить("CipherLab 80xx");
	СпМодель.Добавить("CipherLab 82xx");
	СпМодель.Добавить("CipherLab 83xx");
	СпМодель.Добавить("CipherLab 84xx");           
	СпМодель.Добавить("CipherLab 85xx");


	СпПорт = Элементы.Порт.СписокВыбора;
	Для Индекс = 1 По 256 Цикл
		СпПорт.Добавить(Индекс, "COM" + СокрЛП(Индекс));
	КонецЦикла;

 	СпТипСвязи =  Элементы.ТипСвязи.СписокВыбора;
	СпТипСвязи.Добавить(0, "ИК-подставка");
	СпТипСвязи.Добавить(1, "Кабель");
	СпТипСвязи.Добавить(2, "Bluetooth SPP");

	СпСкорость = Элементы.Скорость.СписокВыбора;
	СпСкорость.Добавить(1, "115200");
	СпСкорость.Добавить(2, "57600");
	СпСкорость.Добавить(3, "38400");
	СпСкорость.Добавить(4, "19200");
	СпСкорость.Добавить(5, "9600");


	времПорт                     = Неопределено;
	времСкорость                 = Неопределено;
	времТипСвязи                 = Неопределено;
	времНомерБазы                = Неопределено;
	времНомерДокумента           = Неопределено;
	времОчищатьДокумент          = Неопределено;
	времВыбиратьИсточникЗагрузки = Неопределено;
	времФорматБазы               = Неопределено;
	времФорматДокумента          = Неопределено;
	времМодель                   = Неопределено;

	Параметры.ПараметрыОборудования.Свойство("Порт"                    , времПорт);
	Параметры.ПараметрыОборудования.Свойство("Скорость"                , времСкорость);
	Параметры.ПараметрыОборудования.Свойство("ТипСвязи"                , времТипСвязи);
	Параметры.ПараметрыОборудования.Свойство("НомерБазы"               , времНомерБазы);
	Параметры.ПараметрыОборудования.Свойство("НомерДокумента"          , времНомерДокумента);
	Параметры.ПараметрыОборудования.Свойство("ОчищатьДокумент"         , времОчищатьДокумент);
	Параметры.ПараметрыОборудования.Свойство("ВыбиратьИсточникЗагрузки", времВыбиратьИсточникЗагрузки);
	Параметры.ПараметрыОборудования.Свойство("ФорматБазы"              , времФорматБазы);
	Параметры.ПараметрыОборудования.Свойство("ФорматДокумента"         , времФорматДокумента);
	Параметры.ПараметрыОборудования.Свойство("Модель"                  , времМодель);

	Порт                     = ?(времПорт                     = Неопределено,    1, времПорт);
	Скорость                 = ?(времСкорость                 = Неопределено,    1, времСкорость);
	ТипСвязи				 = ?(времТипСвязи                 = Неопределено,    0, времТипСвязи);
	НомерБазы                = ?(времНомерБазы                = Неопределено,    1, времНомерБазы);
	НомерДокумента           = ?(времНомерДокумента           = Неопределено,    1, времНомерДокумента);
	ОчищатьДокумент          = ?(времОчищатьДокумент          = Неопределено, Ложь, времОчищатьДокумент);
	ВыбиратьИсточникЗагрузки = ?(времВыбиратьИсточникЗагрузки = Неопределено, Ложь, времВыбиратьИсточникЗагрузки);

	Если времФорматБазы <> Неопределено Тогда
		Для Каждого СтрокаБазы Из времФорматБазы Цикл
			СтрокаТаблицы = ФорматБазы.Добавить();
			СтрокаТаблицы.НомерПоля    = СтрокаБазы.НомерПоля;
			СтрокаТаблицы.Наименование = СтрокаБазы.Наименование;
		КонецЦикла;
	КонецЕсли;

	Если времФорматДокумента <> Неопределено Тогда
		Для Каждого СтрокаДокумента Из времФорматДокумента Цикл
			СтрокаТаблицы = ФорматДокумента.Добавить();
			СтрокаТаблицы.НомерПоля    = СтрокаДокумента.НомерПоля;
			СтрокаТаблицы.Наименование = СтрокаДокумента.Наименование;
		КонецЦикла;
	КонецЕсли;

	Модель = ?(времМодель = Неопределено,  Элементы.Модель.СписокВыбора[0], времМодель);

	Элементы.УстановитьДрайвер.Видимость = (ПараметрыСеанса.РабочееМестоКлиента
	                                        = Идентификатор.РабочееМесто);
											
	Если ФорматБазы.Количество() = 0 Тогда
		ЗаполнитьФорматБазыПоУмолчаниюНаСервере();
	КонецЕсли;
	Если ФорматДокумента.Количество() = 0 Тогда
		ЗаполнитьФорматДокументаПоУмолчаниюНаСервере();
	КонецЕсли;

	СтруктураМеню = Новый Структура;
	СтруктураМеню.Вставить("Параметры", "ГруппаПараметры");
	СтруктураМеню.Вставить("Форматы"  , "ГруппаФорматБазыИДокумента");		
	
	ОбработкаТабличныхЧастейКлиент.СоздатьМенюДокумента(ЭтаФорма, СтруктураМеню, "ГруппаПереключательЗакладок");
																					
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет обработку нажатия динамических кнопок.
//
Процедура ПроцедураОбработкиНажатияМеню(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ПроцедураОбработкиНажатияМеню(ЭтаФорма, Элемент.Имя);	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьИнформациюОДрайвере();

КонецПроцедуры

// Процедура представляет обработчик события "Нажатие" кнопки
// "ОК" командной панели "ОсновныеДействияФормы".
//
// Параметры:
//  Кнопка - <КнопкаКоманднойПанели>
//         - Кнопка, с которой связано данное событие (кнопка "ОК").
//
&НаКлиенте
Процедура ЗаписатьИЗакрытьВыполнить()
	
	ПараметрыОборудования = Новый Структура();
	ПараметрыОборудования.Вставить("Порт"					 , Порт);
	ПараметрыОборудования.Вставить("Скорость"				 , Скорость);
	ПараметрыОборудования.Вставить("ТипСвязи"				 , ТипСвязи);
	ПараметрыОборудования.Вставить("НомерБазы"				 , НомерБазы);
	ПараметрыОборудования.Вставить("НомерДокумента"			 , НомерДокумента);
	ПараметрыОборудования.Вставить("ОчищатьДокумент"		 , ОчищатьДокумент);
	ПараметрыОборудования.Вставить("ВыбиратьИсточникЗагрузки", ВыбиратьИсточникЗагрузки);
	ПараметрыОборудования.Вставить("Модель"					 , Модель);
	
	времФорматБазы = Новый Массив();
	Для Каждого СтрокаТаблицы Из ФорматБазы Цикл
		НоваяСтрока = Новый Структура("НомерПоля, Наименование",
		                              СтрокаТаблицы.НомерПоля,
		                              СтрокаТаблицы.Наименование);
		времФорматБазы.Добавить(НоваяСтрока);
	КонецЦикла;
    ПараметрыОборудования.Вставить("ФорматБазы", времФорматБазы);
	
	времФорматДокумента = Новый Массив();
	Для Каждого СтрокаТаблицы Из ФорматДокумента Цикл
		НоваяСтрока = Новый Структура("НомерПоля, Наименование",
		                              СтрокаТаблицы.НомерПоля,
		                              СтрокаТаблицы.Наименование);
		времФорматДокумента.Добавить(НоваяСтрока);
	КонецЦикла;
    ПараметрыОборудования.Вставить("ФорматДокумента", времФорматДокумента);
	
	ПараметрыЗакрытия = Новый Структура();
	ПараметрыЗакрытия.Вставить("Идентификатор", Идентификатор);
	ПараметрыЗакрытия.Вставить("ПараметрыОборудования", ПараметрыОборудования);
	
	ОчиститьСообщения();
	Закрыть(ПараметрыЗакрытия);

КонецПроцедуры // ОсновныеДействияФормыОК()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьДрайвер(Команда)

	МенеджерОборудованияКлиент.УстановитьДрайвер(Идентификатор);

	ОбновитьИнформациюОДрайвере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьИнформациюОДрайвере()

	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;

	времПараметрыУстройства = Новый Структура();
	времПараметрыУстройства.Вставить("Порт"                    , Порт);
	времПараметрыУстройства.Вставить("Скорость"                , Скорость);
	времПараметрыУстройства.Вставить("ТипСвязи"                , ТипСвязи);
	времПараметрыУстройства.Вставить("НомерБазы"               , НомерБазы);
	времПараметрыУстройства.Вставить("НомерДокумента"          , НомерДокумента);
	времПараметрыУстройства.Вставить("ОчищатьДокумент"         , ОчищатьДокумент);
	времПараметрыУстройства.Вставить("ВыбиратьИсточникЗагрузки", ВыбиратьИсточникЗагрузки);
	времПараметрыУстройства.Вставить("Модель"                  , Модель);

	времФорматБазы = Новый Массив();
	Для Каждого СтрокаТаблицы Из ФорматБазы Цикл
		НоваяСтрока = Новый Структура("НомерПоля, Наименование",
		                              СтрокаТаблицы.НомерПоля,
		                              СтрокаТаблицы.Наименование);
		времФорматБазы.Добавить(НоваяСтрока);
	КонецЦикла;
	времПараметрыУстройства.Вставить("ФорматБазы", времФорматБазы);

	времФорматДокумента = Новый Массив(); 
	Для Каждого СтрокаТаблицы Из ФорматДокумента Цикл
		НоваяСтрока = Новый Структура("НомерПоля, Наименование",
		                              СтрокаТаблицы.НомерПоля,
		                              СтрокаТаблицы.Наименование);
		времФорматДокумента.Добавить(НоваяСтрока);
	КонецЦикла;
	времПараметрыУстройства.Вставить("ФорматДокумента", времФорматДокумента);

	Если МенеджерОборудованияКлиент.ВыполнитьДополнительнуюКоманду("ПолучитьВерсиюДрайвера",
	                                                               ВходныеПараметры,
	                                                               ВыходныеПараметры,
	                                                               Идентификатор,
	                                                               времПараметрыУстройства) Тогда
		Драйвер = ВыходныеПараметры[0];
		Версия  = ВыходныеПараметры[1];
	Иначе
		Если ВыходныеПараметры <> Неопределено Тогда
			Драйвер = ВыходныеПараметры[2];
		КонецЕсли;
		Версия  = НСтр("ru='Не определена'");
	КонецЕсли;

	Элементы.Драйвер.ЦветТекста = ?(Драйвер = НСтр("ru='Не установлен'"), ЦветОшибки, ЦветТекста);
	Элементы.Версия.ЦветТекста  = ?(Версия  = НСтр("ru='Не определена'"), ЦветОшибки, ЦветТекста);
	Элементы.УстановитьДрайвер.Доступность = Не (Драйвер = НСтр("ru='Установлен'"));

КонецПроцедуры


/////////////////////////////////////////////
// Заполнение формата обмена данными с ТСД //
/////////////////////////////////////////////

&НаКлиенте
Процедура ЗаполнитьФорматБазыПоУмолчанию(Команда)
	ЗаполнитьФорматБазыПоУмолчаниюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФорматДокументаПоУмолчанию(Команда)
	ЗаполнитьФорматДокументаПоУмолчаниюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФорматБазыПоУмолчаниюНаСервере()
	ФорматБазы.Очистить();
	НоваяСтрока = ФорматБазы.Добавить();
	НоваяСтрока.НомерПоля 		= 1;
	НоваяСтрока.Наименование 	= Элементы.ФорматБазыНаименование.СписокВыбора[0];
	НоваяСтрока = ФорматБазы.Добавить();
	НоваяСтрока.НомерПоля 		= 2;
	НоваяСтрока.Наименование 	= Элементы.ФорматБазыНаименование.СписокВыбора[1];
	НоваяСтрока = ФорматБазы.Добавить();
	НоваяСтрока.НомерПоля 		= 3;
	НоваяСтрока.Наименование 	= Элементы.ФорматБазыНаименование.СписокВыбора[6];
	НоваяСтрока = ФорматБазы.Добавить();
	НоваяСтрока.НомерПоля 		= 4;
	НоваяСтрока.Наименование 	= Элементы.ФорматБазыНаименование.СписокВыбора[7];
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФорматДокументаПоУмолчаниюНаСервере()
	ФорматДокумента.Очистить();
	НоваяСтрока = ФорматДокумента.Добавить();
	НоваяСтрока.НомерПоля 		= 1;
	НоваяСтрока.Наименование 	= Элементы.ФорматДокументаНаименование.СписокВыбора[0];
	НоваяСтрока = ФорматДокумента.Добавить();
	НоваяСтрока.НомерПоля 		= 2;
	НоваяСтрока.Наименование 	= Элементы.ФорматДокументаНаименование.СписокВыбора[1];
КонецПроцедуры

&НаКлиенте
Процедура ТестУстройства(Команда)
	
	РезультатТеста = Неопределено;
	
	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;

	времПараметрыУстройства = Новый Структура();
	времПараметрыУстройства.Вставить("Порт"                    , Порт);
	времПараметрыУстройства.Вставить("Скорость"                , Скорость);
	времПараметрыУстройства.Вставить("ТипСвязи"                , ТипСвязи);
	времПараметрыУстройства.Вставить("НомерБазы"               , НомерБазы);
	времПараметрыУстройства.Вставить("НомерДокумента"          , НомерДокумента);
	времПараметрыУстройства.Вставить("ОчищатьДокумент"         , ОчищатьДокумент);
	времПараметрыУстройства.Вставить("ВыбиратьИсточникЗагрузки", ВыбиратьИсточникЗагрузки);
	времПараметрыУстройства.Вставить("Модель"                  , Модель);

	Результат = МенеджерОборудованияКлиент.ВыполнитьДополнительнуюКоманду("ТестУстройства",
	                                                               ВходныеПараметры,
	                                                               ВыходныеПараметры,
	                                                               Идентификатор,
	                                                               времПараметрыУстройства);
																   
	Если Результат Тогда
		ТекстСообщения = НСтр("ru = 'Тест успешно выполнен.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		ДополнительноеОписание = ?(ТипЗнч(ВыходныеПараметры) = Тип("Массив")
		                           И ВыходныеПараметры.Количество() >= 2,
		                           НСтр("ru = 'Дополнительное описание:'") + " " + ВыходныеПараметры[1],
		                           "");


		ТекстСообщения = НСтр("ru = 'Тест не пройден.%ПереводСтроки%%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПереводСтроки%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                  "",
		                                                                  Символы.ПС));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                           "",
		                                                                           ДополнительноеОписание));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
																   
КонецПроцедуры

#КонецОбласти