
&НаКлиенте
Перем ПредупреждениеДублирование; // Переменная для хранения данных о дублировании записи

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.ТекущийПользователь       	= ПараметрыСеанса.ТекущийСотрудник;
	ЭтотОбъект.ТекущаяСтруктурнаяЕдиница 	= ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	
	Элементы.ДекорацияВалюта.Заголовок 		= ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодЦелойчастиВалюты(, Истина);
			
	Если Параметры.Свойство("ВидСделки") Тогда
		Объект.ВидСделки = Параметры.ВидСделки;
	КонецЕсли;
	
	ВремСписокФильтрацииИсторииВзаимодействия = ХранилищеСистемныхНастроек.Загрузить("Справочники.Сделки.Форма.ФормаЭлемента", "НастройкиФильтрации");	
	ОбщегоНазначенияКлиентСерверСтоматология.ЗаполнитьСписокФильтрацииИсторииВзаимодействияПоУмолчанию(СписокФильтрацииИсторииВзаимодействия,, ВремСписокФильтрацииИсторииВзаимодействия, Объект.Ссылка);	
		
	ФильтрПрименен = ФильтрПрименен(СписокФильтрацииИсторииВзаимодействия);	
	Элементы.ОчиститьФильтры.Видимость	= ФильтрПрименен;
	Элементы.ПоказатьФильтры.Картинка	= ?(ФильтрПрименен, БиблиотекаКартинок.ФильтрУстановлен, БиблиотекаКартинок.ФильтрНеУстановлен);
	
	ОбновитьДекорациюПовторногоПриема();
	ОбновитьДекорациюНаправившегоВрача();
	ОбновитьДанныеПоКлиенту();
	
	ИнициализироватьОграничениеТипаМенеджера();
	
	УстановитьВидимостьЗначенияКаналаПривлечения(ЭтотОбъект);
	
	Элементы.Специализация.Видимость 	= НЕ ЗначениеЗаполнено(Объект.Врач);
	Элементы.ПланЛечения.Видимость 		= ЗначениеЗаполнено(Объект.ПланЛечения);
	
КонецПроцедуры

&НаСервере
// Процедура - При чтении на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Контактная информация
	УправлениеКонтактнойИнформациейСтоматология.ПриСозданииПриЧтенииНаСервереСделки(ЭтотОбъект, ТекущийОбъект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	// Для обновления представления ссылки конрагента после записи.
	ОповеститьОбИзменении(Тип("СправочникСсылка.Контрагенты"));

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	КомментарийПроверки = "";
	ПроверитьБизнесЛогикуСоздания(КомментарийПроверки, Отказ);
	Если ЗначениеЗаполнено(КомментарийПроверки) Тогда 
		Если ЗначениеЗаполнено(СделкаАналог) Тогда 
			ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьОткрытиеСделкиАналога", ЭтотОбъект, СделкаАналог)
						, КомментарийПроверки + Символы.ПС + Символы.ПС + "Открыть существующую сделку?"
						, РежимДиалогаВопрос.ДаНет
						, 
						, КодВозвратаДиалога.Да
						, "Вопрос пользователю");
		Иначе 
			ПоказатьПредупреждение(, КомментарийПроверки, , "Сообщение пользователю");
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выполнить открытие сделки аналога
//
// Параметры:
//  РезультатОтвета			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВыполнитьОткрытиеСделкиАналога(РезультатОтвета, ДополнительныеПараметры) Экспорт 
	
	Если РезультатОтвета = Неопределено Тогда 
		Возврат;		
	КонецЕсли;	
	
	Если РезультатОтвета = КодВозвратаДиалога.Да И ЗначениеЗаполнено(ДополнительныеПараметры) Тогда 
		ПоказатьЗначение(, ДополнительныеПараметры);
		ЭтаФорма.Модифицированность = Ложь;
		ЭтаФорма.Закрыть();		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Проверить бизнес логику создания
//
Процедура ПроверитьБизнесЛогикуСоздания(Комментарий, Отказ = Ложь)
	
	Справочники.Сделки.ПроверитьБизнесЛогикуСоздания(ЭтотОбъект, СделкаАналог, Комментарий, , Отказ);
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПередЗаписьюНаСервере".
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ИнтерактивнаяЗапись", Истина);
	ТекущийОбъект.Примечание = СокрЛП(ТекущийОбъект.Примечание);
	ОбновитьДанныеКлиента(ТекущийОбъект);

КонецПроцедуры

&НаСервере
// Процедура - При записи на сервере
//
// Параметры:
//  Отказ			 - 	 - 
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущийОбъект.ДополнительныеСвойства, "ЭтапЗаписьПодтверждена", Ложь) Тогда 
		ПараметрыЗаписи.Вставить("ЭтапЗаписьПодтверждена", Истина);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеЗаписи".
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОБНОВИТЬ_ВИДЖЕТ_СДЕЛКИ");
	Оповестить("ОБНОВИТЬ_СВЕДЕНИЯ_ПО_СДЕЛКАМ", Объект.Ссылка);
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗаписи, "ЭтапЗаписьПодтверждена", Ложь) Тогда
		Оповестить("ОБНОВИТЬ_СТАТУС_И_ВИДЖЕТ_СДЕЛКИ", Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаОповещения".
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	Если ИмяСобытия = "ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ" Тогда
		
		ЭтаФорма.Прочитать();
		ОбновитьВидимостьЭтаповВнеКонтекста();

	ИначеЕсли ИмяСобытия = "СозданИзмененСервисSMSРассылки" Тогда
		
		ВзаимодействиеSMSНастроитьСервисЗавершение(Параметр);
		
	ИначеЕсли ИмяСобытия = "СозданаИзмененаУчетнаяЗапись" Тогда
		
		ВзаимодействиеПисьмоНастроитьАккаунтЗавершение(Параметр);
		
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьИсториюВзаимодействияКонтрагента" Тогда
		Если ЗначениеЗаполнено(Параметр) И ТипЗнч(Параметр) = Тип("Структура") Тогда 
			Если Параметр.Свойство("Сделка") И Параметр.Сделка = Объект.Ссылка Тогда
				ЭтаФорма.Прочитать();
				ОбновитьВидимостьЭтаповВнеКонтекста();				
				ОбновитьИсториюВзаимодействияСКлиентом(, Истина);
				// УстановитьФильтрИсторииВзаимодействияНаСервере();
			КонецЕсли;
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Процедура, ОбновитьВидимостьЭтаповВсеКонтекста.
//
Процедура ОбновитьВидимостьЭтаповВнеКонтекста()
	
	ОбновитьЭтапыСделки();
	УстановитьВидимостьРезультатаСделки();

КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ОбработкаПроверкиЗаполненияНаСервере".
//
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// КонтактнаяИнформация
	УправлениеКонтактнойИнформациейСтоматология.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Отказ);
	// Конец КонтактнаяИнформация	
	
	// Проверка заполнения настроенных обязательных полей.
	ОбязательныеПоля = Константы.ОбязательныеПоляСделки.Получить().Получить();
	
	Если ЗначениеЗаполнено(ОбязательныеПоля) Тогда
		
		Для Каждого ДанныеПоля Из ОбязательныеПоля Цикл
			
			Если ДанныеПоля.Обязательно = Ложь Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Объект[ДанныеПоля.Поле]) Тогда
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Поле ""%1"" не заполнено'"), ДанныеПоля.ПредставлениеПоля);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект." + ДанныеПоля.Поле,, Отказ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Процедура - Врач при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ВрачПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Врач) Тогда 
		Объект.Специализация = ПолучитьСпециализациюВрача(Объект.Врач);
	КонецЕсли;	
	
	Элементы.Специализация.Видимость = НЕ ЗначениеЗаполнено(Объект.Врач);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить специализацию врача
//
// Параметры:
//  Врач - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСпециализациюВрача(Врач)

	Возврат Справочники.Сотрудники.ПолучитьОсновнуюСпециализациюСотрудника(Врач);
	
КонецФункции

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура КаналПривлеченияПриИзменении(Элемент)
	
	УстановитьВидимостьЗначенияКаналаПривлечения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
// Процедура, обновляет выбора заявок
//
Процедура ОбновитьПараметрыВыбораЗаявки()
	
	МассивЗаявок = ПолучитьАктивныеЗаявкиКонтрагента(, Объект.Контрагент, Истина);
	
	ФиксированныйМассив = Новый ФиксированныйМассив(МассивЗаявок);
	
	Массив = Новый Массив;
	НовыеПараметрыВыбора = Новый  ПараметрВыбора("Отбор.Ссылка", ФиксированныйМассив);
	Массив.Добавить(НовыеПараметрыВыбора);

	Элементы.Заявка.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);
	Элементы.Заявка.Видимость = ЗначениеЗаполнено(Объект.Заявка) ИЛИ ЗначениеЗаполнено(МассивЗаявок); 
		
КонецПроцедуры	

&НаКлиенте
// Процедура, обработчик события "СписокПричинОтказаВыбор".
//
Процедура СписокПричинОтказаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Элементы.ОткрытьПродажу.Видимость = Ложь;
	СтандартнаяОбработка = Ложь;
	СписокПричинОтказаВыборНаСервере(ВыбраннаяСтрока);
	УстановитьФокусЭлемента();
	
КонецПроцедуры

&НаСервере
// Процедура, продолжение обработчика события на сервере "СписокПричинОтказаВыбор".
//
Процедура СписокПричинОтказаВыборНаСервере(ВыбраннаяСтрока = Неопределено)
	
	Если ВидСделкиПредопределенный Тогда
		Элементы.ГруппаРеализация.Видимость = Ложь;
		Элементы.ОткрытьПродажу.Видимость 	= Ложь;
		
		ПричинаОтказа = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПричиныОтказов.КлиентОтказался");
	ИначеЕсли НЕ ВыбраннаяСтрока = Неопределено Тогда 	
		ПричинаОтказа = ЭтотОбъект.СписокПричинОтказа[ВыбраннаяСтрока].Значение;
	Иначе 
		Возврат;
	КонецЕсли;
	
	//СтруктураНаименований = Справочники.ВидыСделок.ПолучитьНаименованияЗавершающихЭтаповСделки(Объект.ВидСделки);
	//Элементы.РезультатСделки.Заголовок = СтруктураНаименований.НаименованиеЭтапаОтказ + Строка(ПричинаОтказа);
	
	Объект.РезультатСделки 	= Перечисления.РезультатыСделок.Отказ;
	Объект.ПричинаОтказа   	= ПричинаОтказа;
	Объект.ЭтапОтказа 		= ?(ЗначениеЗаполнено(Объект.ЭтапОтказа), Объект.ЭтапОтказа, Объект.ЭтапСделки);
	Объект.ЭтапСделки	   	= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ЭтапыСделок.Отказ");
	
	ОбновитьЭтапыСделки();
	УстановитьВидимостьРезультатаСделки();
	УстановитьУсловноеОформмлениеСписка();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ИсточникИнформацииПриИзменении".
//
Процедура ИсточникИнформацииПриИзменении(Элемент)
	
	ТипДругойПациент = ПредопределенноеЗначение("Справочник.РекламныеИсточники.ДругойПациент");
	Элементы.ИсточникИнформацииЗначение.Видимость = (Объект.ИсточникИнформации = ТипДругойПациент);
	
	Если Объект.ИсточникИнформации = ТипДругойПациент Тогда
		Элементы.ИсточникИнформацииЗначение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ИсточникИнформацииЗначениеНачалоВыбора".
//
Процедура ИсточникИнформацииЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ИсточникИнформацииЗначениеНачалоВыбораЗавершение", ЭтаФорма);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораКлиенты",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Клиент источник информации начало выбора завершение.
// Завершение немодального открытия окна формы - Справочник Контрагенты - ФормаВыбораКлиенты
// Параметры:
//  Результат	 - 	 Результат Оповещения 
//  Параметры	 - 	 Параметры Оповещения 
//
Процедура ИсточникИнформацииЗначениеНачалоВыбораЗавершение(Результат, Параметры)  Экспорт
	
	ЗначениеКонтрагент = Результат;
	Если ЗначениеКонтрагент <> Неопределено Тогда
		Если ЗначениеКонтрагент <> Объект.Контрагент Тогда
			Объект.ИсточникИнформацииЗначение = ЗначениеКонтрагент;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Клиент не может быть источником информации для самого себя.
			                                                             |Следует выбрать другого клиента.'; 
																   |en = 'The client cannot be a source of information for himself.
																		 |You should choose another client.'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ДекорацияПоследнееПосещениеНажатие".
//
Процедура ДекорацияПоследнееПосещениеНажатие(Элемент)
	
	Возврат;
	// ПараметрыОтбора = Новый Структура("Контрагент", Объект.Контрагент);
	// ОткрытьФорму("Документ.Посещение.Форма.ФормаСпискаПоКлиенту", ПараметрыОтбора, ЭтаФорма, Истина, ЭтаФорма.Окно);	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды "РезультатСделкиУспешно".
//
Процедура РезультатСделкиУспешно(Команда)

	Если Объект.РезультатСделки = ПредопределенноеЗначение("Перечисление.РезультатыСделок.Успех") Тогда 
		Если ЗначениеЗаполнено(Объект.Прием) Тогда 
			ПоказатьЗначение(,Объект.Прием); 
		Иначе 
			ВыбратьРеализацию(Неопределено);
		КонецЕсли;	
	Иначе 	
		НачатьФиксациюЗавершающегоЭтапа("Успех");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "РезультатСделкиОтказ".
//
Процедура РезультатСделкиОтказ(Команда)
	
	НачатьФиксациюЗавершающегоЭтапа("Отказ");
	
КонецПроцедуры

&НаКлиенте
// Процедура - Начать фиксацию завершающего этапа
//
// Параметры:
//  ИмяЗавершающегоЭтапа - 	 - 
//
Процедура НачатьФиксациюЗавершающегоЭтапа(ИмяЗавершающегоЭтапа)
	
	Если Объект.Ссылка.Пустая() Тогда
		ОповещениеПослеЗаписи = Новый ОписаниеОповещения("ОткрытьФормуРезлультатаСделкиПослеЗаписи", ЭтотОбъект, Новый Структура("ИмяЗавершающегоЭтапа", ИмяЗавершающегоЭтапа));
		ПоказатьВопрос(ОповещениеПослеЗаписи
				, НСтр("ru='Для продолжения необходимо произвести запись сделки. Записать?';en='To continue, you must record the transaction. Write down?'")
				, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да
				, НСтр("ru='Вопрос пользователю';en='Question to the user'"));
		
	ИначеЕсли ИмяЗавершающегоЭтапа = "Успех" Тогда 
		Если ВидСделкиПредопределенный Тогда
			Возврат;
		КонецЕсли;	
	ИначеЕсли ИмяЗавершающегоЭтапа = "Отказ" Тогда 
		Если ВидСделкиПредопределенный Тогда
			Если НЕ ЗначениеЗаполнено(Объект.РезультатСделки) ИЛИ НЕ ЗначениеЗаполнено(Объект.ПричинаОтказа) Тогда 
				СписокПричинОтказаВыборНаСервере();
				Возврат;				
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	ОткрытьФормуРезлультатаСделки(ИмяЗавершающегоЭтапа);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Открыть форму резлуьтата сделки после записи.
//
Процедура ОткрытьФормуРезлультатаСделкиПослеЗаписи(РезультатОтвета, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатОтвета = КодВозвратаДиалога.Да
		И ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ИмяЗавершающегоЭтапа", ""))
		И ЭтаФорма.Записать() Тогда
		
		НачатьФиксациюЗавершающегоЭтапа(ДополнительныеПараметры.ИмяЗавершающегоЭтапа);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Открыть форму резлуьтата сделки.
//
Процедура ОткрытьФормуРезлультатаСделки(ИмяЗавершающегоЭтапа)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ФормаРезультатСделкиЗавершение", ЭтотОбъект); 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент"			, Объект.Контрагент);
	ПараметрыФормы.Вставить("Сделка"				, Объект.Ссылка);
	ПараметрыФормы.Вставить("ИмяЗавершающегоЭтапа"	, ИмяЗавершающегоЭтапа);
	
	ОткрытьФорму("Справочник.Сделки.Форма.ФормаРезультатаСделки", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик асинхронного события "ФормаРезультатСделкиЗавершение". 
//
Процедура ФормаРезультатСделкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Объект, Результат);
		ОбновитьЭтапыСделки();
		УстановитьВидимостьРезультатаСделки();
		
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события команды "ВыбратьРеализацию".
//
Процедура ВыбратьРеализацию(Команда)
		
	НовоеОповещение = Новый ОписаниеОповещения("ВыбратьРеализациюЗавершение", ЭтотОбъект);
	
	МассивСделок = Новый Массив();
	МассивСделок.Добавить(Объект.Ссылка);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Контрагент", 			  Объект.Контрагент);
	ПараметрыФормы.Вставить("ВключатьПакетИЧленство", Истина);
	ПараметрыФормы.Вставить("РеализацияБезСделки"	, Истина);
	ПараметрыФормы.Вставить("МассивСделок"			, МассивСделок);
	
	ОткрытьФорму("Документ.Прием.ФормаВыбора", ПараметрыФормы,,,,,НовоеОповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
// Процедура, ВыбратьРеализациюЗавершение.
//
Процедура ВыбратьРеализациюЗавершение(Результат, ДопПараметры) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;		
	КонецЕсли;
	
	Объект.Прием = Результат;
	РезультатСделкиУспешноНаСервере();
	УстановитьФокусЭлементаСервер();	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события команды "СоздатьРеализацию".
//
Процедура СоздатьРеализацию(Команда)
	
	Структура = Новый Структура();
	Структура.Вставить("Контрагент"			, Объект.Контрагент);
	Структура.Вставить("Сделка"	   			, Объект.Ссылка);
	ПараметрыФормы  = Новый Структура("ЗначенияЗаполнения", Структура);	
	НовоеОповещение = Новый ОписаниеОповещения("СоздатьРеализациюЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.Прием.Форма.ФормаДокумента",ПараметрыФормы,,,,,НовоеОповещение);
	
КонецПроцедуры

&НаСервере
// Процедура, СоздатьРеализациюЗавершение.
//
Процедура СоздатьРеализациюЗавершение(Результат, ДопПараметры) Экспорт
	
	Объект.Прием = ПолучитьПоследнююПродажуПоСделке(Объект.Ссылка);
	Если ЗначениеЗаполнено(Объект.Прием) Тогда
		РезультатСделкиУспешноНаСервере();
		УстановитьФокусЭлементаСервер();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ОткрытьНастройкаОбязательныеПоля".
//
Процедура ОткрытьНастройкаОбязательныеПоля(Команда)
	
	ОткрытьФорму("Справочник.Сделки.Форма.ФормаНастройкиОбязательныхПолей");
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СоздатьПрием".
//
Процедура СоздатьПрием(Команда)
	
	Если Объект.Врач.Пустая() Тогда	
		ПоказатьПредупреждение(, НСтр("ru = 'Для назначения приема требуется выбрать врача.'; en = 'To make an appointment, you need to choose a doctor.'"));		
	Иначе		
		
		ПараметрыОткрытия = Новый Структура();
		ПараметрыОткрытия.Вставить("ОтборПоСотрудникИлиДолжности"	, Объект.Врач);
		ПараметрыОткрытия.Вставить("ПереключательПериода"			, ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Неделя")); 
		ПараметрыОткрытия.Вставить("Контрагент"						, Объект.Контрагент);
		ПараметрыОткрытия.Вставить("ЗаписьИзДругойФормы"			, Истина);
		
		ИмяФормыПланировщика = ОбщегоНазначенияКлиент.ПолучитьИмяФормыПланировщика(ПараметрыОткрытия, "ФормаЗаписи");
		ОткрытьФорму(ИмяФормыПланировщика, ПараметрыОткрытия,, Новый УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		// ОткрытьФорму("Обработка.ЖурналЗаписи.Форма.Форма", ПараметрыОткрытия,, Новый УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Показать прошлый прием
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПоказатьПрошлыйПрием(Команда)
	
	Если ЗначениеЗаполнено(Объект.ПредыдущийПрием) Тогда 
		ПоказатьЗначение(, Объект.ПредыдущийПрием);
	КонецЕсли;	
	
КонецПроцедуры

#Область ФильтрацияДанныхИсторииВзаимодействия

&НаКлиенте 
// Процедура - Показать фильтры.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПоказатьФильтры(Команда)  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыФормы.Вставить("СписокФильтрацииИсторииВзаимодействия", СписокФильтрацииИсторииВзаимодействия);
	
	ФормаФильтровОписаниеОповещения = Новый ОписаниеОповещения("ВыборФильтровИсторииВзаимодействияЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаФильтровИсторииВзаимодействия", ПараметрыФормы,,,,, ФормаФильтровОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
		
КонецПроцедуры

&НаСервере 
// Процедура - Выбор фильтров истории взаимодействия завершение.
//
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
//
Процедура ВыборФильтровИсторииВзаимодействияЗавершение(Результат, Параметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СписокФильтрацииИсторииВзаимодействия = Результат;	
	
	Если НЕ Объект.Ссылка.Пустая() Тогда		
		ОбновитьИсториюВзаимодействияСКлиентом();
	КонецЕсли;
	
	ФильтрПрименен = ФильтрПрименен(СписокФильтрацииИсторииВзаимодействия);	
	Элементы.ОчиститьФильтры.Видимость	= ФильтрПрименен;
	Элементы.ПоказатьФильтры.Картинка	= ?(ФильтрПрименен, БиблиотекаКартинок.ФильтрУстановлен, БиблиотекаКартинок.ФильтрНеУстановлен);
	
	ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить("Справочники.Сделки.Форма.ФормаЭлемента", "НастройкиФильтрации", СписокФильтрацииИсторииВзаимодействия);
		
КонецПроцедуры

&НаКлиенте 
// Процедура - Декорация фильтры очистить нажатие.
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ОчиститьФильтры(Команда)
	
	ОбщегоНазначенияКлиентСерверСтоматология.ЗаполнитьСписокФильтрацииИсторииВзаимодействияПоУмолчанию(СписокФильтрацииИсторииВзаимодействия,,, Объект.Ссылка);	

	Элементы.ОчиститьФильтры.Видимость	= Ложь;
	Элементы.ПоказатьФильтры.Картинка	= БиблиотекаКартинок.ФильтрНеУстановлен;
	
	ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить("Справочники.Сделки.Форма.ФормаЭлемента", "НастройкиФильтрации", СписокФильтрацииИсторииВзаимодействия);

	Если НЕ Объект.Ссылка.Пустая() Тогда		
		ОбновитьИсториюВзаимодействияСКлиентом();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область КонтактнаяИнформацияРеквизит

&НаКлиенте
// Процедура - Добавить контактную информацию
//
Процедура ДобавитьКонтактнуюИнформацию(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьКонтактнуюИнформациюВидВыбран", ЭтотОбъект);
	СписокДоступныхВидов = УправлениеКонтактнойИнформациейКлиентСерверСтоматология.СписокВидовДляДобавленияКонтактнойИнформации(ЭтаФорма.СвойстваВидовКонтактнойИнформации, ЭтаФорма.КонтактнаяИнформация);
	ЭтаФорма.ПоказатьВыборИзМеню(ОписаниеОповещения, СписокДоступныхВидов, Элементы.КнопкаДобавитьКонтактнуюИнформацию);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить контактную информацию вид выбран.
//
// Параметры:
//  ВыбранныйЭлемент		 - 	 -
//  ДополнительныеПараметры	 - 	 -
//
Процедура ДобавитьКонтактнуюИнформациюВидВыбран(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("Вид", ВыбранныйЭлемент.Значение);
	
	НайденныеСтроки = ЭтаФорма.СвойстваВидовКонтактнойИнформации.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	ДобавитьКонтактнуюИнформациюСервер(ВыбранныйЭлемент.Значение);
	
КонецПроцедуры

&НаСервере
// Процедура - Добавить контактную информацию сервер.
//
// Параметры:
//  ДобавляемыйВид				 - 	 -
//  УстановитьВыводВФормеВсегда	 - 	 -
//
Процедура ДобавитьКонтактнуюИнформациюСервер(ДобавляемыйВид, УстановитьВыводВФормеВсегда = Ложь) Экспорт
		
	УправлениеКонтактнойИнформациейСтоматология.ДобавитьКонтактнуюИнформацию(ЭтаФорма, Объект.Контрагент, ДобавляемыйВид, УстановитьВыводВФормеВсегда);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый действие КИНажатие
//
Процедура Подключаемый_ДействиеКИНажатие(Элемент)
	
	// КонтактнаяИнформацияКлиент.ДействиеКИНажатие(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый представление КИПри изменении
//
Процедура Подключаемый_ПредставлениеКИПриИзменении(Элемент)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ПредставлениеКИПриИзменении(ЭтотОбъект, Элемент, Истина);
	
	ДобавитьОбновляемыеДанные("КонтактнаяИнформация", ЭтотОбъект.ОбновляемыеДанные);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый представление КИНачало выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеВыбора		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура Подключаемый_ПредставлениеКИНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ПредставлениеКИНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Значение КИРедактирование в диалоге завершено.
//
Процедура ЗначениеКИРедактированиеВДиалогеЗавершено(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеКИ = ЭтаФорма.КонтактнаяИнформация[ДополнительныеПараметры.ИндексКИ];
	
	ДанныеКИ.Представление	 = РезультатЗакрытия.Представление;
	ДанныеКИ.ЗначенияПолей	 = РезультатЗакрытия.КонтактнаяИнформация;
	ДанныеКИ.Значение 		 = РезультатЗакрытия.Значение;
	ДанныеКИ.Комментарий	 = РезультатЗакрытия.Комментарий;
	
	Модифицированность = Истина;
	
	Если ДанныеКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ЗаполнитьСписокВыбораАдресов(ЭтаФорма);
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ОповещениеОЗакрытииДиалога") Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗакрытииДиалога, РезультатЗакрытия.Представление);
	КонецЕсли;
	
	ПроверкаДублированияКлиентаКонтактнаяИнформация(ДанныеКИ, ДанныеКИ.Представление);
	ДобавитьОбновляемыеДанные("КонтактнаяИнформация", ЭтотОбъект.ОбновляемыеДанные);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Представление КИПри изменении.
//
Процедура ПредставлениеКИПриИзменении(Элемент) Экспорт
	
	ИндексКИ = Число(Сред(Элемент.Имя, СтрДлина("ПредставлениеКИ_")+1));
	ДанныеКИ = ЭтаФорма.КонтактнаяИнформация[ИндексКИ];
	
	Если ПустаяСтрока(ДанныеКИ.Представление) Тогда
		ДанныеКИ.ЗначенияПолей = "";
	Иначе
		ДанныеКИ.ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(ДанныеКИ.Представление, ДанныеКИ.Вид);
	КонецЕсли;
	
	Если ДанныеКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ЗаполнитьСписокВыбораАдресов(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый представление КИОчистка.
//
// Параметры:
//  Элемент				 - 	 -
//  СтандартнаяОбработка - 	 -
//
Процедура Подключаемый_ПредставлениеКИОчистка(Элемент, СтандартнаяОбработка)
		
	УправлениеКонтактнойИнформациейКлиентСтоматология.ПредставлениеКИОчистка(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый контактная информация авто подбор
//
// Параметры:
//  Элемент					 - 	 - 
//  Текст					 - 	 - 
//  ДанныеВыбора			 - 	 - 
//  ПараметрыПолученияДанных - 	 - 
//  Ожидание				 - 	 - 
//  СтандартнаяОбработка	 - 	 - 
//
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.АвтоПодбор(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый контактная информация обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый комментарий КИПри изменении.
//
// Параметры:
//  Элемент	 - 	 -
//
Процедура Подключаемый_КомментарийКИПриИзменении(Элемент)
		
	УправлениеКонтактнойИнформациейКлиентСтоматология.КомментарийКИПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый контактная информация выполнить команду.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура Подключаемый_КонтактнаяИнформация_ВыполнитьКоманду(Команда)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ВыполнитьКоманду(ЭтотОбъект, Команда);
		
КонецПроцедуры

&НаКлиенте 
// Процедура - Подключаемый перейти к диалогу
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ПерейтиКДиалогу(Элемент)	

	Если Модифицированность И Не ЭтаФорма.Записать() Тогда
		Возврат;
	КонецЕсли;

	ИндексСтроки = Число(Сред(Элемент.Имя, СтрДлина("ПерейтиКДиалогу_")+1));
	ДанныеКИ     = ЭтотОбъект.КонтактнаяИнформация[ИндексСтроки];
	
	ПредставлениеНомераТелефона = ДанныеКИ.Представление;
	ПредставлениеНомераТелефона = СтрЗаменить(ПредставлениеНомераТелефона, " ", "");
	ПредставлениеНомераТелефона = СтрЗаменить(ПредставлениеНомераТелефона, "(", "");
	ПредставлениеНомераТелефона = СтрЗаменить(ПредставлениеНомераТелефона, ")", "");
	ПредставлениеНомераТелефона = СтрЗаменить(ПредставлениеНомераТелефона, "+", "");
	
	Если НЕ ЗначениеЗаполнено(ПредставлениеНомераТелефона) Тогда
		ОбщегоНазначения.СообщитьПользователю("Пустой номер телефона клиента");
		Возврат;
	КонецЕсли;
	
	ДанныеВнешнихСистемМессенджера = ПолучитьДоступныеВнешниеСистемыМессенджера(Объект.Контрагент, ТекущаяСтруктурнаяЕдиница, Истина, ПредставлениеНомераТелефона);
	
	Если ДанныеВнешнихСистемМессенджера.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли ДанныеВнешнихСистемМессенджера.Количество() = 1 Тогда
		Подключаемый_ПерейтиКДиалогуЗавершение(ДанныеВнешнихСистемМессенджера[0],Неопределено);
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ПерейтиКДиалогуЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(ОписаниеОповещения, ДанныеВнешнихСистемМессенджера, Элемент);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения асинхронного события.
//
Процедура Подключаемый_ПерейтиКДиалогуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = Результат.Значение.Идентификатор;
	ВнешняяСистема= Результат.Значение.ВнешняяСистема;
	
	ОписаниеОшибки = "";
	
	ИдСообщения = УстановитьОжиданиеСообщения(Идентификатор,ВнешняяСистема,ОписаниеОшибки,Объект.Контрагент,Результат.Значение.НомерМессенджера);
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ДанныеКанала = Новый Структура;
	ДанныеКанала.Вставить("ИдКлиента"		, Идентификатор);
	ДанныеКанала.Вставить("ВнешняяСистема"	, ВнешняяСистема);
	ДанныеКанала.Вставить("ИдСообщения"		, ИдСообщения);
	
	ПараметрыОткрытия = Новый Структура("ДанныеКанала", ДанныеКанала);
	
	Оповестить("ОткрытьДиалог", ПараметрыОткрытия);
	ОткрытьФорму("Обработка.Мессенджер_Стоматология.Форма", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

#Область ОтправлениеПоПочтеСКонтактнойИнформации

&НаКлиенте
// Процедура - Подключаемый отправить по почте
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ОтправитьПоПочте(Элемент)
		
	Если Модифицированность И Не ЭтаФорма.Записать() Тогда
		Возврат;
	КонецЕсли;
	ИндексЭлемента = Число(Сред(Элемент.Имя, СтрДлина("ОтправитьПоПочте_") + 1));
	
	ДанныеКИ     = ЭтотОбъект.КонтактнаяИнформация[ИндексЭлемента];
	
	Если Не ЗначениеЗаполнено(ДанныеКИ.Представление) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='У клиента не задан адрес электронной почты';en='Client does not have set email address of mail'"));
		Возврат;
	КонецЕсли;
	
	Если ДанныеКИ.НеУчаствоватьВРассылке = Истина Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='У клиента запрещена рассылка электронных писем';en='Client is prohibited newsletter electronic of letters'"));
		Возврат;
	КонецЕсли;    
	
	СписокАдресовЭП = Новый Массив;
	СписокАдресовЭП.Добавить(ДанныеКИ.Представление);
	
	ПараметрыПисьма = Новый Структура("Получатель,АдресЭП", Объект.Контрагент, ДанныеКИ.Представление);
	
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаДокумента", ПараметрыПисьма,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	
#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
// Функция, "ПолучитьКартинку".
//
Функция ПолучитьКартинку(Флаг)
	
	Возврат ?(Флаг, БиблиотекаКартинок.РассылкаЗапрещена, БиблиотекаКартинок.РассылкаРазрешена);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Функция, "ПолучитьПодсказку".
//
Функция ПолучитьПодсказку(Флаг)
	
	Возврат ?(Флаг, НСтр("ru = 'Рассылка запрещена'; en = 'Distribution forbidden'"), НСтр("ru = 'Рассылка разрешена'; en = 'Distribution allowed'"));

КонецФункции

&НаСервере
// Функция возвращает таблицу типов контактной информации в порядке по умолчанию.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Стандартный порядок типов контактной информации для отображения в интерфейсе
//
Функция ПорядокТиповКИ()
	
	ПорядокТиповКИ = Новый ТаблицаЗначений;
	ПорядокТиповКИ.Колонки.Добавить("Тип", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"));
	ПорядокТиповКИ.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	СтрокаТипов.Порядок = 1;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	СтрокаТипов.Порядок = 2;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	СтрокаТипов.Порядок = 3;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.Факс;
	СтрокаТипов.Порядок = 4;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.Skype;
	СтрокаТипов.Порядок = 5;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.СоциальнаяСеть;
	СтрокаТипов.Порядок = 6;

	Возврат ПорядокТиповКИ;
	
КонецФункции

#КонецОбласти

#Область Статусы

&НаСервере
// Процедура, добавляет на форму статусы контрагента.
//
Процедура ВывестиСтатусыКонтрагента()
	
	Если Объект.Контрагент.Пустая() Тогда
		Возврат;	
	КонецЕсли;	
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыКонтрагентов.Период КАК Период,
	|	СтатусыКонтрагентов.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыКонтрагентов КАК СтатусыКонтрагентов
	|ГДЕ
	|	СтатусыКонтрагентов.Контрагент = &Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период");
	
	Запрос.УстановитьПараметр("Контрагент",	Объект.Контрагент);
	
	ТаблицаСтатусов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТ Из ТаблицаСтатусов Цикл
		
		НоваяСтрока = ЭтотОбъект.СтатусыКлиента.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТ);
		
		ИндексЭлементов = НоваяСтрока.ПолучитьИдентификатор(); 
		
		СкопироватьЭлементФормыРекурсивно(Элементы.ГруппаСтатус_Шаблон, Элементы.ГруппаИсторияСтатусов, ИндексЭлементов);						
		
		Элементы["СтатусОткрыть_" + ИндексЭлементов].Заголовок = Формат(СтрокаТ.Период, "ДФ='д МММ Ч:мм'"); 
		
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВРеквизитСтруктурыДанныхВсплывающихГрупп(ЭтаФорма, "Статус_" + ИндексЭлементов);	
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
// Процедура - Открыть историю статусов.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОткрытьИсториюСтатусов(Команда)
	
	Если ПроверитьВидимостьВсплывающихГрупп("ИсторияСтатусов") Тогда				
		УстановитьВидимостьВсплывающихГрупп("ИсторияСтатусов");	
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
// Функция, возвращает цвета бизнес процессов.
//
Функция ПолучитьСоответствиеЦветовИСтатусовКлиентов()
	
	СоответствиеЦветовИСтатусовКлиентов = Новый Соответствие();                                                           
	СоответствиеЦветовИСтатусовКлиентов.Вставить(Перечисления.СтатусыКонтрагентов.Потенциальный			, Новый Цвет(3  , 156, 253)); // Голубой
	СоответствиеЦветовИСтатусовКлиентов.Вставить(Перечисления.СтатусыКонтрагентов.Первичный           	, Новый Цвет(0  , 112, 210)); // Синий
	СоответствиеЦветовИСтатусовКлиентов.Вставить(Перечисления.СтатусыКонтрагентов.Постоянный            , Новый Цвет(136, 191, 136)); // Зеленый
	СоответствиеЦветовИСтатусовКлиентов.Вставить(Перечисления.СтатусыКонтрагентов.НеВернувшийся       	, Новый Цвет(152, 59 , 69));  // Бордовый
	СоответствиеЦветовИСтатусовКлиентов.Вставить(Перечисления.СтатусыКонтрагентов.Отказ     			, Новый Цвет(255, 0  , 0));
		
	Возврат СоответствиеЦветовИСтатусовКлиентов;
	
КонецФункции

&НаСервереБезКонтекста
// Функция проверяет на дубликат контрагента по контактной информации.
//
Функция ПроверитьНаДублированиеКлиентаКИ(Знач Ссылка, Знач ТипКИ, Знач ЗначениеЭлемента)
	
	Возврат Справочники.Контрагенты.ПроверитьНаДублированиеКлиентаКИ(Ссылка, ТипКИ, ЗначениеЭлемента);
	
КонецФункции

&НаКлиенте
// Процедура проверяет дублирование клиента по телефони и E-mail.
//
Процедура ПроверкаДублированияКлиентаКонтактнаяИнформация(ДанныеКИ, ТекстРедактирования) Экспорт
	
	Если (ПредупреждениеДублирование <> Неопределено И ПредупреждениеДублирование = Истина) Тогда
		Возврат;	
	КонецЕсли;
	
	ТипКИ = ДанныеКИ.Тип;
	
	МассивКлиентов = ПроверитьНаДублированиеКлиентаКИ(Объект.Контрагент, ТипКИ, ТекстРедактирования);
	
	Если МассивКлиентов <> Неопределено И МассивКлиентов.Количество() > 0 Тогда		
		Если МассивКлиентов.Количество() = 1 Тогда 
			Текст = НСтр("ru = 'Клиент с такими данными уже существуют. Прикрепить клиента к сделке?'; en = 'A client with this data already exists. Attach a client to a transaction?'");		
			ПоказатьВопрос(Новый ОписаниеОповещения("ПроверкаДублированияКлиентаКонтактнаяИнформацияОтвет", ЭтотОбъект, МассивКлиентов), Текст, РежимДиалогаВопрос.ДаНет);
		Иначе 	
			Текст = НСтр("ru = 'Клиенты с такими данными уже существуют, открыть список клиентов?'; en = 'Clients with such data already exist, open a list of clients?'");		
			ПоказатьВопрос(Новый ОписаниеОповещения("ПроверкаДублированияКлиентаКонтактнаяИнформацияОтвет", ЭтотОбъект, МассивКлиентов), Текст, РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
// Процедура - Проверка дублирования клиента контактная информация ответ
// Завершение немодального открытия окна "ПоказатьВопрос()" 
// Параметры:
//  РезультатВопроса - Ответ на вопрос
//  Параметры	     - Параметры вопроса 
//
Процедура ПроверкаДублированияКлиентаКонтактнаяИнформацияОтвет(РезультатВопроса, Параметры)  Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да  Тогда
		// Модифицированность = Ложь; 
		// Закрыть();
		МассивКлиентов = Параметры;
		Если МассивКлиентов.Количество() > 1 Тогда
			// ФормаКлиенты = ПолучитьФорму("Справочник.Контрагенты.Форма.ФормаСписка", , ЭтаФорма);
			// ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ФормаКлиенты.Список, "Ссылка", МассивКлиентов, Истина, ВидСравненияКомпоновкиДанных.ВСписке);
			// ФормаКлиенты.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
			// ФормаКлиенты.Открыть();
			
			ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораКлиенты",
							Новый Структура("МассивДублей", МассивКлиентов), 
							ЭтаФорма, , , ,
							Новый ОписаниеОповещения("ПослеВыборкаКонтрагентаДубля", ЭтотОбъект, МассивКлиентов));
		Иначе
			// НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(МассивКлиентов[0]);
			// ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);
			ПослеВыборкаКонтрагентаДубля(МассивКлиентов[0], МассивКлиентов)
		КонецЕсли;                                            		
	Иначе
		ПредупреждениеДублирование = Истина;
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
// Процедура - После выборка контрагента дубля
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПослеВыборкаКонтрагентаДубля(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) И ЗначениеЗаполнено(ДополнительныеПараметры) И ТипЗнч(ДополнительныеПараметры) = Тип("Массив") И ДополнительныеПараметры.Найти(РезультатВыбора) <> Неопределено Тогда 
		Объект.Контрагент = РезультатВыбора;
		ОбновитьДанныеПоКлиенту();
	Иначе 
		ПредупреждениеДублирование = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ИсторияВзаимодействияСКлиентом

&НаСервере
// Процедура - Обновить историю взаимодействия с клиентом.
//
// Параметры:
//  РежимПодробно	 - 	 -
//  ВыводитьВсе		 - 	 -
//
Процедура ОбновитьИсториюВзаимодействияСКлиентом(Фильтры = Неопределено, РежимПодробно = Ложь, ВыводитьВсе = Ложь)
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Возврат;
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Фильтры = Новый Структура;
		 
	ОбщегоНазначенияКлиентСерверСтоматология.ЗаполнитьСтруктуруФильтрациИсторииВзаимодйствия(СписокФильтрацииИсторииВзаимодействия, Фильтры);
	
	ПараметрыДанных = Новый Структура;
	ПараметрыДанных.Вставить("Сделка"	         		, Объект.Ссылка);	
	ПараметрыДанных.Вставить("Контрагент"         		, Объект.Контрагент);
	ПараметрыДанных.Вставить("СтатусКлиента"      		, ЭтотОбъект.СтатусКонтрагента);
	СтруктураДатПациента = ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(Объект.Контрагент, "ДатаРожденияКлиента, ДатаРегистрации");
	ПараметрыДанных.Вставить("ДатаРожденияКлиента"		, СтруктураДатПациента.ДатаРожденияКлиента);
	ПараметрыДанных.Вставить("ДатаРегистрацииКлиента"	, СтруктураДатПациента.ДатаРегистрации); 
	ПараметрыДанных.Вставить("СделкаДатаНачала"			, Объект.ДатаСделки);
	ПараметрыДанных.Вставить("СделкаДатаОкончания"		, ?(ЗначениеЗаполнено(Объект.ДатаЗавершенияСделки), Объект.ДатаЗавершенияСделки, ТекущаяДатаСеанса()));
    ПараметрыДанных.Вставить("ВходящийНомерТелефона"	, Объект.ВходящийНомерТелефона);  
	
	ТаблицаИсторииВзаимодействий = Справочники.Контрагенты.ПолучитьИсториюВзаимодействияКлиента(ПараметрыДанных, Истина, Фильтры);
	
	ЭтотОбъект.ИсторияВзаимодействий.Загрузить(ТаблицаИсторииВзаимодействий);
	
	ТекстHTML = УправлениеИнтерфейсамиСервер.СформироватьИсториюВзаимодействий(ЭтаФорма, ПараметрыДанных, Истина, ВыводитьВсе);
	ЭтотОбъект.ИсторияВзаимодействия = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(ТекстHTML);
	
КонецПроцедуры

#Область ОбработчикиСобытийИсторииВзаимодействия

&НаКлиенте
// Процедура, обработчик события "ПриНажатии" поля формы "ИсторияВзаимодействия".
//
Процедура ИсторияВзаимодействияПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ЭлементHTML 		= ДанныеСобытия.Element; 
	ДанныеСсылкиHTML 	= ДанныеСобытия.Anchor;
	Документ 			= Элемент.Документ;
	
	Попытка 
		
		Если ДанныеСсылкиHTML = Неопределено Тогда 				// Нажали в пустое место.	
			Возврат;	
		ИначеЕсли ДанныеСсылкиHTML.name = "more" Тогда
			
			СтандартнаяОбработка = Ложь;						
			
			Фильтры = Новый Структура();
			Фильтры.Вставить("Прием"      , ПолучитьЗначениеФильтра("Прием")); 	
			Фильтры.Вставить("SMS"        , ПолучитьЗначениеФильтра("SMS"));
			Фильтры.Вставить("Письмо"     , ПолучитьЗначениеФильтра("Письмо"));
			Фильтры.Вставить("ПланЛечения", ПолучитьЗначениеФильтра("ПланЛечения"));
			Фильтры.Вставить("Событие"    , ПолучитьЗначениеФильтра("Событие"));	
			Фильтры.Вставить("Заметка"    , ПолучитьЗначениеФильтра("Заметка"));	
			Фильтры.Вставить("Задача"    , ПолучитьЗначениеФильтра("Задача"));	
			
			Если ВсеФильтрыОтключены(Фильтры) Тогда
				Фильтры = Новый Структура();
			КонецЕсли;
			
			ОбновитьИсториюВзаимодействияСКлиентом(Фильтры, Истина, Истина);
			
		ИначеЕсли СтрНайти(ДанныеСсылкиHTML.name, "note") Тогда  // редактировать заметку
			
			СтандартнаяОбработка = Ложь;
			
			СтрокаТЗ = ЭтотОбъект.ИсторияВзаимодействий.НайтиПоИдентификатору(ДанныеСсылкиHTML.id);
			
			Если РольДоступнаКлиентСервер("ПолныеПрава")
				ИЛИ РольДоступнаКлиентСервер("ДобавлениеИзменениеКлиентов") Тогда
				
				МассивЭлементовHTML = ДанныеСсылкиHTML.getElementsByClassName("text-message");
				
				Если МассивЭлементовHTML.length > 0 Тогда
					РедактироватьЗаметку(МассивЭлементовHTML[0], СтрокаТЗ.Заметка, СтрокаТЗ);
				КонецЕсли;
				
			КонецЕсли; 
			
		ИначеЕсли СтрНайти(ДанныеСсылкиHTML.name, "call_comment") Тогда // редактировать коментарий звонка
			
			СтандартнаяОбработка = Ложь;
			
			МассивЭлементовHTML = ДанныеСсылкиHTML.getElementsByClassName("text-message");
			
			Если МассивЭлементовHTML.length > 0 Тогда
				РедактироватьЗаметкуЗвонок(МассивЭлементовHTML[0],  ДанныеСсылкиHTML.id);
			КонецЕсли;
		
		ИначеЕсли СтрНайти(ДанныеСсылкиHTML.name, "profs") Тогда  // редактировать профосмотр.		
			
			СтандартнаяОбработка = Ложь;
			
			РедактироватьПрофосмотр(ДанныеСсылкиHTML);
		ИначеЕсли СтрНайти(ЭлементHTML.className, "listen_call") Тогда // прослущать звонок
			
			СтандартнаяОбработка = Ложь;
			
			СтрокаТЗ = ЭтотОбъект.ИсторияВзаимодействий.НайтиПоИдентификатору(ЭлементHTML.id);
			Сообщение = "";
			
			ДанныеВызова = ПолучитьДанныеИсторииВызова(СтрокаТЗ.Взаимодействие, Сообщение);
			
			Если Не ЗначениеЗаполнено(ДанныеВызова) Тогда 
				Если ЗначениеЗаполнено(Сообщение) Тогда 
					ПоказатьПредупреждение(,Сообщение);
				КонецЕсли;
				Возврат;
			ИначеЕсли ЗначениеЗаполнено(ДанныеВызова.ФайлЗаписи) Тогда					
				СсылкаНаФайл = ПолучитьСсылкуПоУид(ДанныеВызова.ФайлЗаписи.УникальныйИдентификатор(), ЭлементHTML.name);
				
				ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(СсылкаНаФайл);
				
				РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
				
			ИначеЕсли ЗначениеЗаполнено(ДанныеВызова.URLЗаписи) Тогда
				АктуальныйURLЗаписи = IPТелефонияКлиент.ПолучитьАктуальныйURLЗаписиROSTELECOMКлиент(ДанныеВызова.URLЗаписи, ДанныеВызова.IDЗвонка, ДанныеВызова.ОборудованиеТелефонии);
				НачатьЗапускПриложения(Новый ОписаниеОповещения("ПослеЗапускаПриложения", ЭтотОбъект), АктуальныйURLЗаписи);
			Иначе
				Возврат;
			КонецЕсли;
			
		ИначеЕсли СтрНайти(ДанныеСсылкиHTML.name, "open_dialog") Тогда  // Открыть диалог.
			
			СтандартнаяОбработка = Ложь;
			
			ИдКлиента 			= Лев(ДанныеСсылкиHTML.id, СтрНайти(ДанныеСсылкиHTML.id, "_") - 1);	
			UidВнешнейСистемы 	= Сред(ДанныеСсылкиHTML.id, СтрНайти(ДанныеСсылкиHTML.id, "_") + 1, СтрДлина(ДанныеСсылкиHTML.id));
			
			ПерейтиВЧат(ИдКлиента, UidВнешнейСистемы);
			
		ИначеЕсли СтрНайти(ЭлементHTML.className, "task") > 0 Тогда 
			Ссылка = ПолучитьСсылкуНаЗадачуПоУид(Новый УникальныйИдентификатор(ЭлементHTML.id));
			ОбновитьФорму = ОтметитьЗадачуКакВыполненую(Ссылка);
			Если ОбновитьФорму Тогда
				УстановитьФильтрИсторииВзаимодействияНаСервере();	
			КонецЕсли;
		ИначеЕсли СтрНайти(ДанныеСсылкиHTML.name, "clip") Тогда // закрепить/открепить
			
			СтандартнаяОбработка = Ложь;
			
			СтрокаТЗ = ЭтотОбъект.ИсторияВзаимодействий.НайтиПоИдентификатору(ДанныеСсылкиHTML.id);
			
			ЗакрепитьОткрепитьЗаметку(СтрокаТЗ.ИДЗаметки, СтрНайти(ДанныеСсылкиHTML.name, "off"));
			ОбновитьИсториюВзаимодействияСКлиентом();
	
		ИначеЕсли ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
			
			СтандартнаяОбработка = Ложь;
			ПерейтиПоНавигационнойСсылке(ДанныеСобытия.Href);
			
		Иначе
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
		Элемент.Доступность = Истина;
		
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
// Процедура - После запуска приложения
//
// Параметры:
//  КодВозврата				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПослеЗапускаПриложения(КодВозврата, ДополнительныеПараметры) Экспорт
	
	// Процедура - заглушка описания оповещения
	Возврат;

КонецПроцедуры 

&НаСервере
// Функция, проверяет отключены ли все фильтры.
//
Функция ВсеФильтрыОтключены(Фильтры)
	
	Для Каждого Фильтр Из Фильтры Цикл
		Если Фильтр.Значение = Истина Тогда
			Возврат Ложь;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
// Функция, возвращает значение фильтра.
//
Функция ПолучитьЗначениеФильтра(ИмяФильтр)
	
	// Фильтр = Элементы["ДекорацияФильтр" + ИмяФильтр];
	Возврат Ложь; // СтрНайти(Фильтр.Подсказка, "Очистить") > 0;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить данные истории вызова
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеИсторииВызова(IDЗвонка, Сообщение = "")
	
	СтруктураВызова = РегистрыСведений.ИсторияВызовов.ПолучитьПоIDЗвонка(IDЗвонка);
	Если ЗначениеЗаполнено(СтруктураВызова) Тогда  
		
		Если Справочники.ТелефонныеАппараты.ЗаписьРазговораДоступна(ПараметрыСеанса.ТекущийСотрудник, СтруктураВызова.ПользовательSip) Тогда
			
			Возврат СтруктураВызова; 
		Иначе
			Сообщение = НСтр("ru = 'Нет прав на прослушивание текущей записи'; en = 'No rights to listen to the current recording'");
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат Неопределено;	
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает ссылку на документ по ид.
//
Функция ПолучитьСсылкуПоУид(Уид, ТипСобытия)
	
	Если ТипСобытия = "ЗадачаИсполнителя" Тогда
		Возврат Задачи.ЗадачаИсполнителя.ПолучитьСсылку(Уид);
	ИначеЕсли ТипСобытия = "Звонок" Тогда
		Возврат Справочники.Файлы.ПолучитьСсылку(Уид);
	Иначе
		Возврат Задачи.Взаимодействие.ПолучитьСсылку(Уид);
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает ссылку на документ по ид.
//
Функция ПолучитьСсылкуНаЗадачуПоУид(Уид)
	
	// Возврат Задачи.ЗадачаПользователей.ПолучитьСсылку(Уид);
	
	// Задачи создаются в "Взаимодействие", а не в "ЗадачаПользователей"
	Возврат Задачи.Взаимодействие.ПолучитьСсылку(Уид);
	
КонецФункции

&НаСервереБезКонтекста
// Функция, отмечает задачу как выполненую.
//
Функция ОтметитьЗадачуКакВыполненую(Задача)
	
	ЗадачаОбъект = Задача.ПолучитьОбъект();
	ЗадачаОбъект.Выполнена = Истина;
	
	Попытка
		ЗадачаОбъект.Записать();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
// Процедура, редактирует заметку.
//
Процедура РедактироватьЗаметку(ЭлементHTML, ТекстЗаметки, СтрокаТЗ)	
	
	Обработчик = Новый ОписаниеОповещения("ЗавершитьРедактированиеЗаметки", ЭтотОбъект, Новый Структура("ЭлементHTML, СтрокаТЗ", ЭлементHTML, СтрокаТЗ));
	
	КлючЗаписи = ПолучитьКлючЗаписи(СтрокаТЗ.ИДЗаметки);
	
	ОткрытьФорму("РегистрСведений.Заметки.Форма.ФормаРедактированияЗаметки", Новый Структура("ТекстЗаметки, Заголовок, Контрагент, ВзаимодействиеСделка, Ключ", ТекстЗаметки, "Редактирование заметки", Объект.Контрагент, Объект.Ссылка, КлючЗаписи),,,,, Обработчик, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить ключ записи.
//
// Параметры:
//  ЗаметкаИД	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКлючЗаписи(ЗаметкаИД)
		
	Выборка = РегистрыСведений.Заметки.Выбрать(,,Новый Структура ("ИД", Новый УникальныйИдентификатор(ЗаметкаИД)));
	Если Выборка.Следующий() Тогда
		
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("Объект"			, Выборка.Объект);
		СтруктураОтбора.Вставить("АктивностьЗаметки", Выборка.АктивностьЗаметки);
		СтруктураОтбора.Вставить("Автор"			, Выборка.Автор);
		СтруктураОтбора.Вставить("Период"			, Выборка.Период);
		СтруктураОтбора.Вставить("ИД"				, Выборка.ИД);
		
	КонецЕсли; 	
	
	МассивСтруктураЗаписи = Новый Массив;
	МассивСтруктураЗаписи.Добавить(СтруктураОтбора);
	
	Возврат Новый("РегистрСведенийКлючЗаписи.Заметки", МассивСтруктураЗаписи);

КонецФункции

&НаКлиенте
// Процедура, открывает профосмотр.
//
Процедура РедактироватьПрофосмотр(ДанныеСсылкиHTML)
	
	Обработчик = Новый ОписаниеОповещения("ЗавершитьРедактированиеПрофосмотра", ЭтотОбъект, Новый Структура("ДанныеСсылкиHTML", ДанныеСсылкиHTML));
	
	СтрокаТЗ 				= ЭтотОбъект.ИсторияВзаимодействий.НайтиПоИдентификатору(ДанныеСсылкиHTML.id);
	КлючЗаписиПрофосмотра 	= ПолучитьПараметрыОткрытияФормыПрофосмотр(СтрокаТЗ);
	
	ОткрытьФорму("РегистрСведений.Профосмотры.Форма.ФормаРедактированияЗаписиПлана", Новый Структура("Ключ", КлючЗаписиПрофосмотра),,,,,Обработчик, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	                                	
КонецПроцедуры 

&НаКлиенте  
// Функция - Получить параметры открытия формы профосмотр
//
// Параметры:
//  СтрокаТЗ - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПараметрыОткрытияФормыПрофосмотр(СтрокаТЗ)
		
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("СтруктурнаяЕдиница"	, СтрокаТЗ.СтруктурнаяЕдиница);
	СтруктураОтбора.Вставить("Сотрудник"			, СтрокаТЗ.Сотрудник);
	СтруктураОтбора.Вставить("ВидОсмотра"			, СтрокаТЗ.ВидОсмотра);
	СтруктураОтбора.Вставить("Контрагент"			, Объект.Контрагент);
	СтруктураОтбора.Вставить("Период"				, СтрокаТЗ.Начало);
	
	МассивСтруктураЗаписи = Новый Массив;
	МассивСтруктураЗаписи.Добавить(СтруктураОтбора);

	Возврат Новый("РегистрСведенийКлючЗаписи.Профосмотры", МассивСтруктураЗаписи);
	
КонецФункции

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ЗавершитьРедактированиеПрофосмотра(Результат, ДопПараметры) Экспорт 	
	
	Если Результат <> Неопределено Тогда	
		ОбновитьИсториюВзаимодействияСКлиентом();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ЗавершитьРедактированиеЗаметки(Результат, Параметры) Экспорт 	
	
	Если Результат <> Неопределено Тогда
		
		ЭлементHTML = Параметры.ЭлементHTML;
		СтрокаТЗ = Параметры.СтрокаТЗ;
		СтрокаТЗ.Заметка = Результат.ТекстЗаметки;  // обновляем данные в таблице
		ЗавершитьРедактированиеЗаметкиНаСервере(Результат.ТекстЗаметки, СтрокаТЗ.ИДЗаметки, СтрокаТЗ.Взаимодействие); // обновляем данные в регистре
		
		Если ЗначениеЗаполнено(Результат.ТекстЗаметки) Тогда
			ЭлементHTML.innerHTML = ?(СтрДлина(Результат.ТекстЗаметки) > 200, Лев(Результат.ТекстЗаметки, 200) + "...", Результат.ТекстЗаметки);
		Иначе
			ЭлементHTML.innerHTML = "...";
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
// Процедура, обработчик оповещения.
//
Процедура ЗавершитьРедактированиеЗаметкиНаСервере(ТекстЗаметки, ИдЗаметки, Сделка)
		
	Выборка = РегистрыСведений.Заметки.Выбрать(,,Новый Структура ("ИД", Новый УникальныйИдентификатор(ИдЗаметки)));
	
	Пока Выборка.Следующий() Цикл
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("Объект"			, Выборка.Объект);
		СтруктураОтбора.Вставить("АктивностьЗаметки", Выборка.АктивностьЗаметки);
		СтруктураОтбора.Вставить("Автор"			, Выборка.Автор);
		СтруктураОтбора.Вставить("Период"			, Выборка.Период);
		СтруктураОтбора.Вставить("Заметка"			, ТекстЗаметки);
		СтруктураОтбора.Вставить("Сделка"			, Сделка);
		СтруктураОтбора.Вставить("ИД"				, Выборка.ИД);
	КонецЦикла;
	
	ОбъектРегистрСведенийЗаметка = РегистрыСведений.Заметки.СоздатьНаборЗаписей();
	ОбъектРегистрСведенийЗаметка.ОбменДанными.Загрузка = Истина; 
	ОбъектРегистрСведенийЗаметка.Отбор.ИД.Установить(СтруктураОтбора.ИД);
	ЗаполнитьЗначенияСвойств(ОбъектРегистрСведенийЗаметка.Добавить(), СтруктураОтбора);
	ОбъектРегистрСведенийЗаметка.Записать(Истина);
	
КонецПроцедуры 

&НаКлиенте
// Процедура, редактирует заметку.
//
Процедура РедактироватьЗаметкуЗвонок(ЭлементHTML, ИдЗвонка)
	
	Обработчик = Новый ОписаниеОповещения("ЗавершитьРедактированиеЗаметкиЗвонок", ЭтотОбъект, Новый Структура("ЭлементHTML, ИдЗвонка", ЭлементHTML, ИдЗвонка));
	
	СокращенныйТекстЗаметки = ЭлементHTML.innerHTML;
	
	СтрокаТЗ = ЭтотОбъект.ИсторияВзаимодействий.НайтиПоИдентификатору(ИдЗвонка);
	
	ТекстЗаметки = ПолучитьПолныйТекстЗаметкиЗвонка(СтрокаТЗ.Взаимодействие, Объект.Ссылка, СокращенныйТекстЗаметки);
	
	ОткрытьФорму("РегистрСведений.Заметки.Форма.ФормаРедактированияЗаметки", Новый Структура("ТекстЗаметки", ТекстЗаметки),,,,, Обработчик, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры 

&НаСервереБезКонтекста
// Функция - Получить ключ записи.
//
// Параметры:
//  ЗаметкаИД	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПолныйТекстЗаметкиЗвонка(IDЗвонка, Контрагент, ТекстЗаметки)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ИсторияВызовов.Заметка КАК Заметка
	|ИЗ
	|	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
	|ГДЕ
	|	ИсторияВызовов.Контрагент = &Контрагент
	|	И ИсторияВызовов.IDЗвонка = &IDЗвонка";
	
	Запрос.УстановитьПараметр("IDЗвонка"	, IDЗвонка);
	Запрос.УстановитьПараметр("Контрагент"	, Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда	
		Возврат Выборка.Заметка;	
	КонецЕсли;
	
	Возврат ТекстЗаметки;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ЗавершитьРедактированиеЗаметкиЗвонок(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ТекстЗаметки     = Результат.ТекстЗаметки; 	
		ЭлементHTML      = ДопПараметры.ЭлементHTML;	
		СтрокаТЗ         = ЭтотОбъект.ИсторияВзаимодействий.НайтиПоИдентификатору(ДопПараметры.ИдЗвонка);
		СтрокаТЗ.Заметка = ТекстЗаметки; 
		
		ЗавершитьРедактированиеЗаметкиЗвонокНаСервере(ТекстЗаметки, СтрокаТЗ.Взаимодействие);
		
		Если ЗначениеЗаполнено(ТекстЗаметки) Тогда
			ЭлементHTML.innerHTML = ?(СтрДлина(ТекстЗаметки) > 200, Лев(Результат.ТекстЗаметки, 200) + "...", ТекстЗаметки);
		Иначе
			ЭлементHTML.innerHTML = "...";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик оповещения.
//
Процедура ЗавершитьРедактированиеЗаметкиЗвонокНаСервере(ТекстЗаметки, ИдЗвонка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсторияВызовов.ОборудованиеТелефонии КАК ОборудованиеТелефонии,
	|	ИсторияВызовов.IDЗвонка КАК IDЗвонка,
	|	ИсторияВызовов.НаправлениеВызова КАК НаправлениеВызова,
	|	ИсторияВызовов.ИсходящийЗвонок КАК ИсходящийЗвонок,
	|	ИсторияВызовов.НомерТелефона КАК НомерТелефона,
	|	ИсторияВызовов.ПользовательSip КАК ПользовательSip,
	|	ИсторияВызовов.НачалоВызова КАК НачалоВызова,
	|	ИсторияВызовов.НачалоРазговора КАК НачалоРазговора,
	|	ИсторияВызовов.ОкончаниеЗвонка КАК ОкончаниеЗвонка,
	|	ИсторияВызовов.Статус КАК Статус,
	|	ИсторияВызовов.URLЗаписи КАК URLЗаписи,
	|	ИсторияВызовов.ФайлЗаписи КАК ФайлЗаписи,
	|	ИсторияВызовов.ПринятДругимАбонентомГруппы КАК ПринятДругимАбонентомГруппы,
	|	ИсторияВызовов.Заявка КАК Заявка,
	|	ИсторияВызовов.НеОбработан КАК НеОбработан,
	|	ИсторияВызовов.ИдентификаторОбрабатывающего КАК ИдентификаторОбрабатывающего,
	|	ИсторияВызовов.ИсточникЗвонка КАК ИсточникЗвонка,
	|	ИсторияВызовов.Пользователь КАК Пользователь,
	|	ИсторияВызовов.Контрагент КАК Контрагент,
	|	ИсторияВызовов.ПопытокПолученияФайлаЗаписи КАК ПопытокПолученияФайлаЗаписи,
	|	ИсторияВызовов.Заметка КАК Заметка
	|ИЗ
	|	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
	|ГДЕ
	|	ИсторияВызовов.IDЗвонка = &IDЗвонка");
	
	Запрос.УстановитьПараметр("IDЗвонка", ИдЗвонка); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		МенеджерЗаписи = РегистрыСведений.ИсторияВызовов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);	
		МенеджерЗаписи.Заметка = ТекстЗаметки;
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, устанавливает фильтр истории взаимодействия на сервере.
//
Процедура УстановитьФильтрИсторииВзаимодействияНаСервере(ИмяЭлемента = Неопределено)
	
	Если ЗначениеЗаполнено(ИмяЭлемента) Тогда
		Фильтр = Элементы[ИмяЭлемента];
		УстановитьФильтр = СтрНайти(Фильтр.Подсказка, "Установить") > 0;
		Фильтр.Картинка  = ?(УстановитьФильтр, БиблиотекаКартинок.ФильтрОчистить, БиблиотекаКартинок.Фильтр);
		Фильтр.Подсказка = ?(УстановитьФильтр, "Очистить фильтр", "Установить фильтр"); 
	КонецЕсли;
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		Фильтры = Новый Структура();
		// Фильтры.Вставить("Задача"      , ПолучитьЗначениеФильтра("Задача")); 	
		Фильтры.Вставить("Заметка"      , ПолучитьЗначениеФильтра("Заметка")); 	
		Фильтры.Вставить("Прием"      , ПолучитьЗначениеФильтра("Прием")); 	
		Фильтры.Вставить("SMS"        , ПолучитьЗначениеФильтра("SMS"));
		Фильтры.Вставить("Письмо"     , ПолучитьЗначениеФильтра("Письмо"));
		Фильтры.Вставить("ПланЛечения", ПолучитьЗначениеФильтра("ПланЛечения"));
		Фильтры.Вставить("Событие"    , ПолучитьЗначениеФильтра("Событие"));
		
		Если ВсеФильтрыОтключены(Фильтры) Тогда
			Фильтры = Новый Структура();
		КонецЕсли;
		
		ОбновитьИсториюВзаимодействияСКлиентом(Фильтры);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФильтрыПоВзаимодействиямСКлиентом

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ВзаимодействиеПодробно(Команда)
	
	Элементы.КнопкаПодробно.Пометка  = Не Элементы.КнопкаПодробно.Пометка;
	Элементы.КнопкаПодробно.Заголовок = ?(Элементы.КнопкаПодробно.Пометка, НСтр("ru = 'Кратко'; en = 'Short'"), НСтр("ru = 'Подробно'; en = 'In detail'"));
	
	ОбновитьИсториюВзаимодействияСКлиентом(, Элементы.КнопкаПодробно.Пометка, ВыводитьВсеВзаимодействия);		
	
КонецПроцедуры

&НаКлиенте
// Процедура, оброботчик оповещения.
//
Процедура ВзаимодействиеПослеВопросаОЗаписиСделки(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да 
		И ЭтаФорма.Записать() Тогда
		
		Действие = ДопПараметры.ВыполнитьДействие; 
		
		Если Действие = "СоздатьЗаметку" Тогда
			СоздатьЗаметкуНаКлиенте();
		ИначеЕсли Действие = "СоздатьПисьмо" Тогда
			СоздатьПисьмоНаКлиенте();
		ИначеЕсли Действие = "СоздатьSMS" Тогда
			СоздатьSMSРассылкуНаКлиенте();
		ИначеЕсли Действие = "ВыборВзаимодействия" Тогда
			ВыборВзаимодействиеЗадачаНаСервере();
		ИначеЕсли Параметры.ВыполнитьДействие = "ПерейтиКДиалогу" Тогда
			Подключаемый_ПерейтиКДиалогу(Параметры.Элемент);	
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры

#Область ВзаимодействиеЗадача

&НаСервере
// Заполнить список выбора взаимодействия.
//
Процедура ЗаполнитьСписокВыбораВзаимодействия()
	
	ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора.Очистить();
	
	ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора = Справочники.ВидыВзаимодействий.ПолучитьСписокВзаимодействий();
	
КонецПроцедуры

&НаСервере
// Заполнить список выбора режима напоминания
//
Процедура ЗаполнитьСписокВыбораРежимаНапоминания()
	
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Очистить();
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(-1	   , НСтр("ru = 'не напоминать'; en = 'do not remind'"));
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(0     , НСтр("ru = 'в момент события'; en = 'at the time of the event'"));
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(300   , НСтр("ru = 'за 5 минут'; en = 'in 5 minutes'"));
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(600   , НСтр("ru = 'за 10 минут'; en = 'in 10 minutes'"));
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(900   , НСтр("ru = 'за 15 минут'; en = 'in 15 minutes'"));
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(1800  , НСтр("ru = 'за 30 минут'; en = 'in 30 minutes'"));     
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(3600  , НСтр("ru = 'за 1 час'; en = 'in 1 hour'"));
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(7200  , НСтр("ru = 'за 2 часа'; en = 'in 2 hours'"));
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(86400 , НСтр("ru = 'за 1 день'; en = 'in 1 day'"));
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(172800, НСтр("ru = 'за 2 дня'; en = 'in 2 days'"));
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(604800, НСтр("ru = 'за 1 неделю'; en = 'in 1 week'"));
	
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания = -1;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда взаимодействие выбрать.
//
Процедура ВзаимодействиеЗадачаВыбрать(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыборВзаимодействиеЗадачаЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора, Элементы.ВзаимодействиеЗадачаВыбрать);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор взаимодействия завершение
//
Процедура ВыборВзаимодействиеЗадачаЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ЭтотОбъект.ВзаимодействиеЗадачаПараметры = Новый Структура;
		ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Вставить("Взаимодействие"   , Результат.Значение.Взаимодействие);
		ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Вставить("ВидВзаимодействия", Результат.Значение.ВидВзаимодействия);
		ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Вставить("ТемаПоУмолчанию"  , Результат.Значение.ТемаПоУмолчанию);
		ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Вставить("Представление"    , Результат.Представление);
		ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Вставить("Картинка"         , Результат.Картинка);
		
		Если Объект.Контрагент.Пустая() Тогда
						
			Оповещение = Новый ОписаниеОповещения("ВзаимодействиеПослеВопросаОЗаписиСделки", ЭтотОбъект, Новый Структура("ВыполнитьДействие", "ВыборВзаимодействия"));
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Для создания взаимодействия необходимо произвести запись нового клиента. Записать?'; en = 'To create an interaction, you need to record a new client. To record?'"), РежимДиалогаВопрос.ДаНет);
		Иначе
			ВыборВзаимодействиеЗадачаНаСервере();		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Выбор взаимодействия на клиенте
//
Процедура ВыборВзаимодействиеЗадачаНаСервере()
	
	Элементы.ДекорацияВзаимодействиеИконка.Картинка     = ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Картинка;
	Элементы.ДекорацияВзаимодействиеИконка.Видимость    = ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Картинка);
	Элементы.ДекорацияВзаимодействиеЗаголовок.Заголовок = ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Представление;
	
	УстановитьВидимостьВсплывающихГруппСервер("ВзаимодействиеЗадача");
	
	ЭтотОбъект.ВзаимодействиеЗадачаТема  = ?(ЗначениеЗаполнено(ВзаимодействиеЗадачаТема) , ВзаимодействиеЗадачаТема	, ЭтотОбъект.ВзаимодействиеЗадачаПараметры.ТемаПоУмолчанию);
	ЭтотОбъект.ВзаимодействиеЗадачаТекст = ?(ЗначениеЗаполнено(ВзаимодействиеЗадачаТекст), ВзаимодействиеЗадачаТекст, "");
	
	// Установить дату взаимодействия.
	ЭтотОбъект.ВзаимодействиеЗадачаДата = ПолучитьОкругленноеВремяВзаимодействия(ЭтотОбъект.ВзаимодействиеЗадачаВыполнена);	
	ВзаимодействиеЗадачаДатаПриИзмененииНаСервере();
	
	// Обновить исполнителя взаимодействия.
	ЭтотОбъект.ВзаимодействиеЗадачаИсполнитель         = ЭтотОбъект.ТекущийПользователь;	
	Элементы.ВзаимодействиеЗадачаИсполнитель.Заголовок = ПолучитьПредставлениеФИОСотрудника(ЭтотОбъект.ТекущийПользователь);
		
	// Обновить режим напоминания взаимодействия.
	РежимНапоминанияПоУмолчанию = ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора[0];		
	
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания    = РежимНапоминанияПоУмолчанию.Значение;
	Элементы.ВзаимодействиеЗадачаНапоминание.Заголовок = РежимНапоминанияПоУмолчанию.Представление;
	
	ВзаимодействиеЗадачаСтатус = ЭтотОбъект.ВзаимодействиеЗадачаВыполнена; 
	// АктивныйЭлемент   = ?(ЭтотОбъект.ВзаимодействиеЗадачаВыполнена, Элементы.ГруппаВзаимодействиеЗадачаСтатусВыполнена, Элементы.ГруппаВзаимодействиеЗадачаСтатусНеВыполнена);
	// НеактивныйЭлемент = ?(Не ЭтотОбъект.ВзаимодействиеЗадачаВыполнена, Элементы.ГруппаВзаимодействиеЗадачаСтатусВыполнена, Элементы.ГруппаВзаимодействиеЗадачаСтатусНеВыполнена);
	// УправлениеИнтерфейсамиСервер.ИзменитьАктивностьПереключателяФормы(АктивныйЭлемент, НеактивныйЭлемент, ЭтотОбъект.ВзаимодействиеЗадачаВыполнена);

КонецПроцедуры	

&НаКлиенте
// Процедура - Взаимодействие задача звонок дата при изменении.
//
// Параметры:
//  Элемент	 - 	 -
//
Процедура ВзаимодействиеЗадачаДатаПриИзменении(Элемент)
	
	ВзаимодействиеЗадачаДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
// Процедура - Взаимодействие задача звонок дата при изменении на сервере.
//
// Параметры:
//  Элемент	 - 	 -
//
Процедура ВзаимодействиеЗадачаДатаПриИзмененииНаСервере()
	
	ЗаполнитьСписокВыбораВремениЭлемента("ВзаимодействиеЗадачаВремя", ЭтотОбъект.ВзаимодействиеЗадачаДата);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие задача дата обработка выбора.
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ВзаимодействиеЗадачаДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЭтотОбъект.ВзаимодействиеЗадачаВыполнена Тогда
		
		СтандартнаяОбработка = ВзаимодействиеЗадачаРазрешеноСозданиеНаУказаннуюДату(ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие задача дата окончание ввода текста.
//
// Параметры:
//  Элемент					 - 	 - 
//  Текст					 - 	 - 
//  ДанныеВыбора			 - 	 - 
//  ПараметрыПолученияДанных - 	 - 
//  СтандартнаяОбработка	 - 	 - 
//
Процедура ВзаимодействиеЗадачаДатаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если ЭтотОбъект.ВзаимодействиеЗадачаВыполнена Тогда
		
		Попытка
			СтандартнаяОбработка = ВзаимодействиеЗадачаРазрешеноСозданиеНаУказаннуюДату(Дата(Текст + " 00:00:00"));	
		Исключение
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие задача время обработка выбора.
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ВзаимодействиеЗадачаВремяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЭтотОбъект.ВзаимодействиеЗадачаВыполнена Тогда
		
		СтандартнаяОбработка = ВзаимодействиеЗадачаРазрешеноСозданиеНаУказаннуюДату(ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Функция - Взаимодействие задача разрешено создание на указанную дату.
//
// Параметры:
//  ВыбраннаяДата	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВзаимодействиеЗадачаРазрешеноСозданиеНаУказаннуюДату(ВыбраннаяДата)
	
	Если ВыбраннаяДата > ТекущаяДата() Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Создание выполненных задач будущей датой запрещено!'; en = 'Creating completed tasks by a future date is prohibited!'"));
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
// Процедура - Команда взаимодействие исполнитель
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеЗадачаИсполнитель(Команда)
	
	Оповещение     = Новый ОписаниеОповещения("ОбработчикВыбораИсполнителяЗадачи", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("Ключ", ЭтотОбъект.ВзаимодействиеЗадачаИсполнитель);	
	
	ОткрытьФорму("Задача.Взаимодействие.Форма.ФормаВыбораИсполнителя", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик выбора исполнителя взаимодействия
//
// Параметры:
//  Результат	 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура ОбработчикВыбораИсполнителяЗадачи(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ЭтотОбъект.ВзаимодействиеЗадачаИсполнитель         = Результат;
		Если ТипЗнч(Результат) = Тип("СправочникСсылка.СегментыСотрудников") Тогда 
			Элементы.ВзаимодействиеЗадачаИсполнитель.Заголовок = Строка(Результат);
		Иначе		
			Элементы.ВзаимодействиеЗадачаИсполнитель.Заголовок = ПолучитьПредставлениеФИОСотрудника(Результат);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить представление ФИОСотрудника.
//
Функция ПолучитьПредставлениеФИОСотрудника(Сотрудник)
	
	Возврат Справочники.Сотрудники.ПредставлениеФИОСотрудника(Сотрудник);		
	
КонецФункции

&НаКлиенте
Процедура ВзаимодействиеЗадачаСтатусНеВыполнена(Команда)
	
	ЭтотОбъект.ВзаимодействиеЗадачаВыполнена = Ложь;
	
	УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(
		Элементы.ГруппаВзаимодействиеЗадачаСтатусНеВыполнена,
		Элементы.ГруппаВзаимодействиеЗадачаСтатусВыполнена,
		Ложь
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ВзаимодействиеЗадачаСтатусВыполнена(Команда)
	
	ЭтотОбъект.ВзаимодействиеЗадачаДата      = ПолучитьОкругленноеВремяВзаимодействия(Истина);
	ЭтотОбъект.ВзаимодействиеЗадачаВыполнена = Истина;
	
	УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(
		Элементы.ГруппаВзаимодействиеЗадачаСтатусВыполнена,
		Элементы.ГруппаВзаимодействиеЗадачаСтатусНеВыполнена,
		Истина
	);
	
	ВзаимодействиеЗадачаДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда взаимодействие задача режим напоминания.
//
Процедура ВзаимодействиеЗадачаРежимНапоминания(Команда)

	Оповещение = Новый ОписаниеОповещения("ВыборРежимаНапоминанияЗавершение", ЭтотОбъект);
	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора, Элементы.ВзаимодействиеЗадачаНапоминание);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор взаимодействия завершение
//
Процедура ВыборРежимаНапоминанияЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания    = Результат.Значение;
		Элементы.ВзаимодействиеЗадачаНапоминание.Заголовок = Результат.Представление; 

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда взаимодействие создать.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеЗадачаСоздать(Команда)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеЗадачаДата) Тогда
		ВзаимодействиеЗадачаСоздатьСервер();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнены данные взаимодействия!'; en = 'Interaction data is not filled!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик оповещения.
//
Процедура ВзаимодействиеЗадачаСоздатьСервер()
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Контрагент"                 , Объект.Контрагент);
	ДанныеЗаполнения.Вставить("ВидВзаимодействия"          , ЭтотОбъект.ВзаимодействиеЗадачаПараметры.ВидВзаимодействия);
	ДанныеЗаполнения.Вставить("ВидВзаимодействияСправочник", ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Взаимодействие);
	ДанныеЗаполнения.Вставить("Исполнитель"                , ЭтотОбъект.ВзаимодействиеЗадачаИсполнитель);
	ДанныеЗаполнения.Вставить("ЗадачаНазначеннаяДата"      , ЭтотОбъект.ВзаимодействиеЗадачаДата);
	ДанныеЗаполнения.Вставить("ЗадачаТема"                 , ?(ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеЗадачаТема), ЭтотОбъект.ВзаимодействиеЗадачаТема, ""));
	ДанныеЗаполнения.Вставить("ЗадачаОписание"             , ЭтотОбъект.ВзаимодействиеЗадачаТекст);
	ДанныеЗаполнения.Вставить("Сделка"                     , Объект.Ссылка);
	ДанныеЗаполнения.Вставить("Выполнена"                  , ЭтотОбъект.ВзаимодействиеЗадачаВыполнена);
	
	НоваяЗадача = Задачи.Взаимодействие.СоздатьЗадачу();
	НоваяЗадача.Заполнить(ДанныеЗаполнения);	
	
	Задачи.Взаимодействие.ЗаполнитьПараметрыНапоминания(НоваяЗадача, Новый Структура("ЗадачаРежимНапоминания", ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания));	
	
	НоваяЗадача.Записать();
	
	ОбновитьИсториюВзаимодействияСКлиентом(, Элементы.КнопкаПодробно.Пометка);
	
	ВзаимодействиеЗадачаТема  = "";
	ВзаимодействиеЗадачаТекст = "";
	
	СнятьВидимостьВсплывающихГруппСервер("ВзаимодействиеЗадача");
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура СоздатьЗаметку(Команда)
	
	Если Не ПроверитьВидимостьВсплывающихГрупп("Заметка") Тогда
		Возврат;
	КонецЕсли;	

	Если Объект.Контрагент.Пустая() Тогда	
		                
		ОписаниеОповещения = Новый ОписаниеОповещения("ВзаимодействиеПослеВопросаОЗаписиСделки", ЭтотОбъект, Новый Структура("ВыполнитьДействие", "СоздатьЗаметку"));
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Для добавления заметки необходимо произвести запись нового клиента. Записать?'; en = 'To add a note, you need to record a new client. To record?'"), РежимДиалогаВопрос.ДаНет);		
	Иначе		
		СоздатьЗаметкуНаКлиенте();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, добавляет заметку.
//
Процедура СоздатьЗаметкуНаКлиенте()
	
	УстановитьВидимостьВсплывающихГрупп("Заметка");
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие добавить заметку.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеЗаметкаДобавить(Команда)
		
	Если ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеЗаметкаТекст) Тогда 	
		ВзаимодействиеЗаметкаДобавитьСервер();	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнены данные заметки!'; en = 'Not filled out these notes!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик оповещения.
//
Процедура ВзаимодействиеЗаметкаДобавитьСервер()
	
	СоздатьЗаметкуНаСервере(ЭтотОбъект.ВзаимодействиеЗаметкаТекст, Объект.Ссылка, Объект.Контрагент);
	// ОбновитьИсториюВзаимодействияСКлиентом(, Элементы.КнопкаПодробно.Пометка);
		
	ЭтотОбъект.ВзаимодействиеЗаметкаТекст = "";
	
	СнятьВидимостьВсплывающихГруппСервер("Заметка");	
	
КонецПроцедуры

&НаСервере
// Процедура, добавляет заметку на сервере.
//
Процедура СоздатьЗаметкуНаСервере(ТекстЗаметки, Сделка, Контрагент)
			
	ОбъектРегистрСведенийЗаметка = РегистрыСведений.Заметки.СоздатьНаборЗаписей(); 	
	ОбъектРегистрСведенийЗаметка.ОбменДанными.Загрузка = Истина; 
	
	СтруктураОтбора = Новый Структура(); 
	СтруктураОтбора.Вставить("Объект"			, Контрагент); 
	СтруктураОтбора.Вставить("АктивностьЗаметки", Истина); 
	СтруктураОтбора.Вставить("Автор"			, ПараметрыСеанса.ТекущийСотрудник); 
	СтруктураОтбора.Вставить("Период"			, ТекущаяДатаСеанса()); 
	СтруктураОтбора.Вставить("Заметка"			, ТекстЗаметки); 
	СтруктураОтбора.Вставить("ИД"				, Новый УникальныйИдентификатор);
	СтруктураОтбора.Вставить("Сделка"           , Сделка);
	
	ОбъектРегистрСведенийЗаметка.Отбор.ИД.Установить(СтруктураОтбора.ИД); 	
	ЗаполнитьЗначенияСвойств(ОбъектРегистрСведенийЗаметка.Добавить(), СтруктураОтбора); 	
	ОбъектРегистрСведенийЗаметка.Записать(Истина);
	
	ОбновитьИсториюВзаимодействияСКлиентом(, Элементы.КнопкаПодробно.Пометка);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура СоздатьПисьмо(Команда)
	
	Если Не ПроверитьВидимостьВсплывающихГрупп("Письмо") Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Контрагент.Пустая()
		ИЛИ Модифицированность = Истина Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВзаимодействиеПослеВопросаОЗаписиСделки", ЭтотОбъект, Новый Структура("ВыполнитьДействие", "СоздатьПисьмо"));
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Для отправки электронного письма необходимо произвести запись нового клиента. Записать?'; en = 'To send an email, you need to record a new client. To record?'"), РежимДиалогаВопрос.ДаНет);		
	Иначе		
		СоздатьПисьмоНаКлиенте();		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, создает исходящее электронное письмо.
//
Процедура СоздатьПисьмоНаКлиенте()
	
	МассивАдресовЭП = ПолучитьАдресаЭПКонтрагента(Объект.Контрагент);
	
	Если ЗначениеЗаполнено(МассивАдресовЭП) Тогда
		
		ЭтаФорма.ТекущийЭлемент = Элементы.ВзаимодействиеПисьмоТекст;
		
		ЭтотОбъект.ВзаимодействиеПисьмоСписокАдресовЭП.ЗагрузитьЗначения(МассивАдресовЭП);
		
		Если Не (ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП)
			И МассивАдресовЭП.Найти(ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП) <> Неопределено) Тогда
			
			ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП = МассивАдресовЭП[0];
		КонецЕсли;
		
		Элементы.ВзаимодействиеПисьмоВыбратьАдресЭП.Заголовок = ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП;
		
		УстановитьВидимостьВсплывающихГрупп("Письмо");
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'У клиента не задан адрес электронной почты, или рассылка запрещена'; en = 'The client does not have an email address, or mailing is prohibited'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие Письмо, выбрать адрес ЭП.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеПисьмоВыбратьАдресЭП(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВзаимодействиеПисьмоВыбратьАдресЭПЗавершение", ЭтотОбъект);

	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеПисьмоСписокАдресовЭП);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие Письмо, выбрать адрес ЭП завершение.
//
// Параметры:
//  Результат	 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура ВзаимодействиеПисьмоВыбратьАдресЭПЗавершение(Результат, ДопПараметры) Экспорт
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ВзаимодействиеПисьмоТекст;
	
	Если Результат <> Неопределено  Тогда
		
		ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП = Результат;	
		
		Элементы.ВзаимодействиеПисьмоВыбратьАдресЭП.Заголовок = Результат; 	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие письмо настроить аккаунт.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура ВзаимодействиеПисьмоНастроитьАккаунт(Команда)
	
	ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.ФормаОбъекта", Новый Структура("ПользовательУчетнойЗаписи", ОбщегоНазначенияСтоматология.ТекущийПользователь()), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие письмо настроить аккаунт завершение.
//
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
//
Процедура ВзаимодействиеПисьмоНастроитьАккаунтЗавершение(Результат)
	
	Если Результат <> Неопределено Тогда
		
		Элементы.ГруппаВзаимодействиеПисьмоНастроитьАккаунт.Видимость = Ложь;
		Элементы.ГруппаВзаимодействиеПисьмоОсновная.Видимость         = Истина;
		УстановитьВидимостьВсплывающихГрупп("Письмо");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие Письмо отправить.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеПисьмоОтправить(Команда)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеПисьмоТема)
		И ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеПисьмоТекст)
		И ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП) Тогда 
		
		ВзаимодействиеПисьмоОтправитьСервер();	
	Иначе	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнены данные письма!'; en = 'The letter data is not filled in!'"));
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие письмо отправить сервер.
//
Процедура ВзаимодействиеПисьмоОтправитьСервер()
		
	ОписаниеОшибки = "";
	
	ДокументСоздан = СоздатьДокументИсходящееПисьмоОтправитьПисьмоНаСервере(
		Объект.Контрагент, 
		ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП,
		Объект.Ссылка,
		ЭтотОбъект.ВзаимодействиеПисьмоТема, 
		ЭтотОбъект.ВзаимодействиеПисьмоТекст, 
		ОписаниеОшибки
	);
		
	Если ДокументСоздан = Ложь Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		Возврат;
	КонецЕсли;		
	
	ОбновитьИсториюВзаимодействияСКлиентом(Элементы.КнопкаПодробно.Пометка);
	
	ЭтотОбъект.ВзаимодействиеПисьмоТема    = "";
	ЭтотОбъект.ВзаимодействиеПисьмоТекст   = "";
	ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП = "";
	
	СнятьВидимостьВсплывающихГруппСервер("Письмо");

КонецПроцедуры

&НаСервере
// Заполнить список выбора взаимодействия.
//
Процедура ЗаполнитьСписокВыбораШаблоновSMSСообщений()
	
	ЭтотОбъект.ВзаимодействиеSMSСписокШаблонов.Очистить();
	
	МассивШаблонов = Справочники.ШаблоныСообщений.ПолучитьШаблоныСообщений(Перечисления.ТипыСобытий.SMS);
	
	Для Каждого Шаблон Из МассивШаблонов Цикл
		ЭтотОбъект.ВзаимодействиеSMSСписокШаблонов.Добавить(Шаблон.Содержание, Шаблон.Наименование);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура СоздатьSMSРассылку(Команда)
	
	Если Не ПроверитьВидимостьВсплывающихГрупп("SMS") Тогда
		Возврат;
	КонецЕсли;

	Если Объект.Контрагент.Пустая() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВзаимодействиеПослеВопросаОЗаписиСделки", ЭтотОбъект, Новый Структура("ВыполнитьДействие", "СоздатьSMS"));
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Для отправки sms сообщения необходимо произвести запись сделки. Записать?'; en = 'To send an SMS message, you need to record a transaction. To record?'"), РежимДиалогаВопрос.ДаНет);		
	Иначе	
		Если Модифицированность И Не ЭтаФорма.Записать() Тогда
			Возврат;
		КонецЕсли;

		СоздатьSMSРассылкуНаКлиенте();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, создает sms рассылку.
//
Процедура СоздатьSMSРассылкуНаКлиенте()
	
	МассивНомеровТелефонов = ПолучитьНомераТелефоновКонтрагента(Объект.Контрагент);
	
	Если ЗначениеЗаполнено(МассивНомеровТелефонов) Тогда
		
		ЭтотОбъект.ВзаимодействиеSMSСписокНомеровТелефонов.ЗагрузитьЗначения(МассивНомеровТелефонов);
		
		Если Не (ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеSMSНомерТелефона)
			И МассивНомеровТелефонов.Найти(ЭтотОбъект.ВзаимодействиеSMSНомерТелефона) <> Неопределено) Тогда
			
			ЭтотОбъект.ВзаимодействиеSMSНомерТелефона = МассивНомеровТелефонов[0];
		КонецЕсли;
		
		Элементы.ВзаимодействиеSMSВыбратьНомерТелефона.Заголовок  = ЭтотОбъект.ВзаимодействиеSMSНомерТелефона;
		
		УстановитьВидимостьВсплывающихГрупп("SMS");
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'У клиента не задан номер телефона, или рассылка запрещена'; en = 'The client does not have a phone number, or mailing is prohibited'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMSВыбрать телефон.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеSMSВыбратьТелефон(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВзаимодействиеSMSВыбратьТелефонЗавершение", ЭтотОбъект);

	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеSMSСписокНомеровТелефонов);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMSВыбрать телефон завершение.
//
// Параметры:
//  Результат	 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура ВзаимодействиеSMSВыбратьТелефонЗавершение(Результат, ДопПараметры) Экспорт
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ВзаимодействиеSMSТекст;
	
	Если Результат <> Неопределено  Тогда
		
		ЭтотОбъект.ВзаимодействиеSMSНомерТелефона = Результат;
		
		Элементы.ВзаимодействиеSMSВыбратьНомерТелефона.Заголовок = Результат; 	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMS выбрать шаблон текста.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура ВзаимодействиеSMSВыбратьШаблон(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВзаимодействиеSMSВыбратьШаблонЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеSMSСписокШаблонов);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMS выбрать шаблон текста завершение.
//
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
//
Процедура ВзаимодействиеSMSВыбратьШаблонЗавершение(Результат, ДопПараметры) Экспорт
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ВзаимодействиеSMSТекст;
	
	Если Результат <> Неопределено  Тогда		
		ЭтотОбъект.ВзаимодействиеSMSТекст = Результат.Значение;
		ВзаимодействиеSMSОбновитьСтатусВведеныхСимволов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMSНастроить сервис.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура ВзаимодействиеSMSНастроитьСервис(Команда)

	Если НаличиеСервисовSMSРассылки() Тогда
		Оповещение = Новый ОписаниеОповещения("ВзаимодействиеSMSНастроитьСервисЗавершение", ЭтотОбъект);
		ОткрытьФорму("Справочник.СервисыРассылки.ФормаВыбора",, ЭтаФорма,,,, Оповещение);
	Иначе
		ОткрытьФорму("Справочник.СервисыРассылки.ФормаОбъекта",, ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMSНастроить сервис завершение.
//
// Параметры:
//  Результат	 - 	 -
//  ДопПаарметры - 	 -
//
Процедура ВзаимодействиеSMSНастроитьСервисЗавершение(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ЗаполнитьСервисSMSРассылкиПоУмолчанию(Результат);
		Элементы.ГруппаВзаимодействиеSMSНастроитьСервис.Видимость = Ложь;
		Элементы.ГруппаВзаимодействиеSMSОсновная.Видимость        = Истина;
		УстановитьВидимостьВсплывающихГрупп("SMS");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - Заполнить сервис SMSРассылки по умолчанию.
//
// Параметры:
//  СервисSMSРассылки	 - 	 -
//
Процедура ЗаполнитьСервисSMSРассылкиПоУмолчанию(СервисSMSРассылки)
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.СервисSMSРассылкиПоУмолчанию.Установить(СервисSMSРассылки);

КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMSТекст при изменении.
//
Процедура ВзаимодействиеSMSТекстПриИзменении(Элемент)
	
	ВзаимодействиеSMSОбновитьСтатусВведеныхСимволов();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обновляет колличество введенных символов.
//
Процедура ВзаимодействиеSMSОбновитьСтатусВведеныхСимволов()
	
	// Удаляем символы переноса строки.
	мТекст = НРег(ЭтотОбъект.ВзаимодействиеSMSТекст);
	
	// 1-sms это 160 символов, если больше 160 символов, тогда 1 sms = 153.
	РазмерностьСообщения = ?(СтрДлина(мТекст) > 160, 153, 160);
	КоличествоСМС = 0;

	СтрокаСимволов = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя@_$^~`№";
	
	Для а = 1 По СтрДлина(СтрокаСимволов) Цикл
		
		Если Найти(мТекст, Сред(СтрокаСимволов, а, 1)) > 0 Тогда
			
			// 1-sms это 70 символов, если больше 70 символов, тогда 1 sms = 67.
			РазмерностьСообщения = ?(СтрДлина(мТекст) > 70, 67, 70);
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	КоличествоСимволов = СтрДлина(мТекст);
	КоличествоСМС      = Цел(СтрДлина(мТекст) / РазмерностьСообщения) + ?(СтрДлина(мТекст) % РазмерностьСообщения > 0, 1, 0);
	
	ПредставлениеСимволов = СтрокаСЧислом(Нстр("ru = ';%1 символ;;%1 символа; %1 символов;%1 символа'; en = ';%1 character;;;;%1 characters'"),
				КоличествоСимволов,
				ВидЧисловогоЗначения.Количественное,
				НСтр("ru='L=ru'; en='L=en'")); 
	
	ЭтотОбъект.ВзаимодействиеSMSСтатусВведенныхСимволов = ПредставлениеСимволов + ", " + КоличествоСМС + " sms";	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMS Отправить.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеSMSОтправить(Команда)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеSMSТекст)
		И ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеSMSНомерТелефона) Тогда 
		
		ВзаимодействиеSMSОтправитьСервер();		
	Иначе	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнены данные sms сообщения!'; en = 'Not filled in sms message data!'"));
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMS Отправить сервер.
//
Процедура ВзаимодействиеSMSОтправитьСервер()
		
	ОписаниеОшибки = "";
	
	МассивСтруктурПолучателей = Новый Массив;
	МассивСтруктурПолучателей.Добавить(Новый Структура("Получатель, НомерТелефона", Объект.Контрагент, ЭтотОбъект.ВзаимодействиеSMSНомерТелефона));
	
	ДокументSMSРассылкаСоздан = СоздатьДокументSMSРассылкаИОтправитьSMSНаСервере(
		МассивСтруктурПолучателей,
		ЭтотОбъект.ВзаимодействиеSMSТекст,
		Объект.Ссылка,
		ЭтотОбъект.ТекущаяСтруктурнаяЕдиница,
		ОписаниеОшибки
	);
	
	Если ДокументSMSРассылкаСоздан = Ложь Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		Возврат;
	КонецЕсли;	
	
	ОбновитьИсториюВзаимодействияСКлиентом(Элементы.КнопкаПодробно.Пометка);
	
	ЭтотОбъект.ВзаимодействиеSMSТекст         = "";
	ЭтотОбъект.ВзаимодействиеSMSНомерТелефона = "";
	
	СнятьВидимостьВсплывающихГруппСервер("SMS");

КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает номера телефонов контрагента.
//
Функция ПолучитьНомераТелефоновКонтрагента(Контрагент)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКлиента)
	|	И КонтрагентыКонтактнаяИнформация.НомерТелефона <> """"
	|	И КонтрагентыКонтактнаяИнформация.Ссылка.ЭтоГруппа = ЛОЖЬ
	|	И КонтрагентыКонтактнаяИнформация.НеУчаствоватьВРассылке = ЛОЖЬ
	|	И КонтрагентыКонтактнаяИнформация.Ссылка = &Ссылка") ;
	
	Запрос.УстановитьПараметр("Ссылка", Контрагент);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерТелефона");
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает номера телефонов контрагента.
//
Функция ПолучитьАдресаЭПКонтрагента(Контрагент)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтрагентыКонтактнаяИнформация.АдресЭП КАК АдресЭП
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКлиента)
	|	И КонтрагентыКонтактнаяИнформация.АдресЭП <> """"
	|	И КонтрагентыКонтактнаяИнформация.Ссылка.ЭтоГруппа = ЛОЖЬ
	|	И КонтрагентыКонтактнаяИнформация.НеУчаствоватьВРассылке = ЛОЖЬ
	|	И КонтрагентыКонтактнаяИнформация.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Контрагент);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("АдресЭП");
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Создать документ РассылкаСообщений и отправить SMS.
//
// Параметры:
//  МассивСтруктурПолучателей	 - 	 - 
//  Содержание					 - 	 - 
//  ОписаниеОшибки				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьДокументSMSРассылкаИОтправитьSMSНаСервере(МассивСтруктурПолучателей, Содержание, Сделка, СтруктурнаяЕдиница, ОписаниеОшибки)
	
	ПараметрыРассылки = Новый Структура;
	ПараметрыРассылки.Вставить("Получатели"        , МассивСтруктурПолучателей);
	ПараметрыРассылки.Вставить("Содержание"        , Содержание);
	ПараметрыРассылки.Вставить("Сделка"            , Сделка);
	ПараметрыРассылки.Вставить("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	ПараметрыРассылки.Вставить("ОтправкаSMS"       , Истина);
	
	Возврат Документы.РассылкаСообщений.СоздатьДокументРассылкаСообщений(ПараметрыРассылки, ОписаниеОшибки);

КонецФункции

&НаСервереБезКонтекста
// Функция - Создать документ исходящее письмо отправить письмо на сервере.
//
// Параметры:
//  МассивСтруктурПолучателей	 - 	 - 
//  Содержание					 - 	 - 
//  Тема						 - 	 - 
//  ОписаниеОшибки				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьДокументИсходящееПисьмоОтправитьПисьмоНаСервере(Контакт, Адрес, Сделка, Тема, Содержание, ОписаниеОшибки)
	
	МассивСтруктурПолучателей = Новый Массив;
	МассивСтруктурПолучателей.Добавить(Новый Структура("Контакт, Адрес", Контакт, Адрес));

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Дата"             , ТекущаяДатаСеанса());
	ДанныеЗаполнения.Вставить("Тема"             , Тема);
	ДанныеЗаполнения.Вставить("Тело"             , Содержание);
	ДанныеЗаполнения.Вставить("МассивПолучателей", МассивСтруктурПолучателей);
	ДанныеЗаполнения.Вставить("Сделка"           , Сделка);
	
	ИсходящееЭлектронноеПисьмо = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
	ИсходящееЭлектронноеПисьмо.Заполнить(ДанныеЗаполнения);
	
	Возврат Документы.ЭлектронноеПисьмоИсходящее.ВыполнитьОтправкуПисьма(ИсходящееЭлектронноеПисьмо, ОписаниеОшибки);

КонецФункции

#КонецОбласти
	
#КонецОбласти

#Область ВсплывающиеГруппы

&НаКлиенте
// Процедура - Установить фокус элемента.
//
Процедура УстановитьФокусЭлемента()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.КнопкаПодробно;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить фокус элемента на сервере.
//
Процедура УстановитьФокусЭлементаСервер()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.КнопкаПодробно;
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить значения структуры данных всплывающих групп.
//
Процедура СформироватьСтруктуруДанныхВсплывающихГрупп()
			
	ПараметрыВидимости = Новый Структура;		
	ПараметрыВидимости.Вставить("Заметка"             , Ложь);
	ПараметрыВидимости.Вставить("ВзаимодействиеЗадача", Ложь);
	ПараметрыВидимости.Вставить("SMS"                 , Ложь);
	ПараметрыВидимости.Вставить("Письмо"              , Ложь);
	ПараметрыВидимости.Вставить("ФИО"                 , Ложь);
	ПараметрыВидимости.Вставить("Документ_Шаблон"     , Ложь);
	ПараметрыВидимости.Вставить("ИсторияСтатусов"     , Ложь);
	
	УправлениеИнтерфейсамиСервер.СформироватьРеквизитСтруктурыДанныхВсплывающихГрупп(ЭтаФорма, ПараметрыВидимости);

КонецПроцедуры

&НаКлиенте
// Функция - Проверить видимость всплывающей группы.
//
// Параметры:
//  ИмяВзаимодействия	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПроверитьВидимостьВсплывающихГрупп(ИмяЭлемента)
	
	Результат = УправлениеИнтерфейсамиКлиент.ПроверитьВидимостьВсплывающихГрупп(ЭтаФорма, ИмяЭлемента);
	
	Если Результат = Ложь Тогда 
		УстановитьФокусЭлемента();
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

&НаКлиенте
// Процедура - Установить видимость всплывающих групп.
//
// Параметры:
//  ИмяВзаимодействия	 - 	 - 
//  Видимость			 - 	 - 
//
Процедура УстановитьВидимостьВсплывающихГрупп(ИмяЭлемента, ИндексЭлемента = Неопределено)
	
	УправлениеИнтерфейсамиКлиент.УстановитьВидимостьВсплывающихГрупп(ЭтаФорма, ИмяЭлемента, ИндексЭлемента);
	
КонецПроцедуры

&НаСервере
// Процедура - Установить видимость всплывающих групп.
//
// Параметры:
//  ИмяВзаимодействия	 - 	 - 
//  Видимость			 - 	 - 
//
Процедура УстановитьВидимостьВсплывающихГруппСервер(ИмяЭлемента, ИндексЭлемента = Неопределено)
	
	УправлениеИнтерфейсамиСервер.УстановитьВидимостьВсплывающихГрупп(ЭтаФорма, ИмяЭлемента, ИндексЭлемента);
	
КонецПроцедуры

&НаСервере
// Процедура - Снять видимость всплывающих групп на сервере.
//
// Параметры:
//  ИмяВзаимодействия	 - 	 - 
//  Видимость			 - 	 - 
//
Процедура СнятьВидимостьВсплывающихГруппСервер(ИмяЭлемента)
	
	УправлениеИнтерфейсамиСервер.СнятьВидимостьВсплывающихГрупп(ЭтаФорма, ИмяЭлемента); 
	УстановитьФокусЭлементаСервер();	
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить списки выбора времени окончания работы.
//
// Параметры:
//  ВремяНачала	 - 	 -
//  ЭлементФормы - 	 -
//
Процедура ЗаполнитьСписокВыбораВремениЭлемента(ИмяЭлементаФормы, Знач ДатаНачала)
	
	ЭлементФормы = Элементы[ИмяЭлементаФормы];
	
	ПериодРаботы = Новый Структура;
	ПериодРаботы.Вставить("ДатаНачала"   , НачалоДня(ДатаНачала));
	ПериодРаботы.Вставить("ДатаОкончания", ДатаНачала + 86400);
	
	МассивПериодов = Новый Массив;
	МассивПериодов.Добавить(ПериодРаботы);
	
	СписокВремени = РаботаСДиалогами.ВернутьСписокВремениДляНачалаРаботыСервер(МассивПериодов, Ложь, 30);
	
	ЭлементФормы.СписокВыбора.Очистить();
	
	Для Каждого Элемент Из СписокВремени Цикл
		
		Представление = ?(Минута(Элемент.Значение) = 0, Элемент.Представление, Новый ФорматированнаяСтрока(Элемент.Представление,, Новый Цвет(100, 100, 100)));
		ЭлементФормы.СписокВыбора.Добавить(Элемент.Значение, Представление);
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
// Процедура - Открыть ФИО.
//
Процедура ПоказатьФИОВсплывающее(Команда)
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		ПоказатьЗначение(, Объект.Контрагент);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область Этапы

&НаСервере
// Процедура, ОбновитьЭтапыСделки.
//
Процедура ОбновитьЭтапыСделки()
	
	ОчиститьГруппуЭтапыСделки();
	
	ТаблицаЭтапов = Справочники.ВидыСделок.ПолучитьЭтапыПоВидуСделки(Объект.ВидСделки);
	
	Если ТаблицаЭтапов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуЭтапыСделок(ТаблицаЭтапов);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)
		И НЕ ЗначениеЗаполнено(Объект.ЭтапСделки) Тогда
		
		Объект.ЭтапСделки = ЭтотОбъект.ЭтапыСделок[0].Ссылка;
	КонецЕсли;
	
	ПустойЦвет = Новый Цвет();
	Если Объект.РезультатСделки = Перечисления.РезультатыСделок.Отказ Тогда 
		ТекущийПредзавершающийЭтап = ?(ЗначениеЗаполнено(Объект.ЭтапОтказа), Объект.ЭтапОтказа, Объект.ЭтапСделки);
	ИначеЕсли Объект.РезультатСделки = Перечисления.РезультатыСделок.Успех Тогда 
		ТекущийПредзавершающийЭтап = ?(ЗначениеЗаполнено(Объект.ЭтапУспеха), Объект.ЭтапУспеха, Объект.ЭтапСделки);
	Иначе 
		ТекущийПредзавершающийЭтап = Объект.ЭтапСделки;
	КонецЕсли;	
	НомерТекущегоЭтапа 	= ?(ЗначениеЗаполнено(ТекущийПредзавершающийЭтап), Макс(ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекущийПредзавершающийЭтап, "НомерЭтапа"), 1), 1);
	Индекс 				= 0;
	ДопустимОтказ 		= ?(ВидСделкиПредопределенный, Справочники.Сделки.ДопустимОтказСогласноТекущегоЭтапа(Объект.Ссылка, ВидСделкиПредопределенный), Истина);
	
	Для Каждого СтрокаТЗ Из ТаблицаЭтапов Цикл
		
		ЭтапСделки 	= СтрокаТЗ.ЭтапСделки;
		// ТекущийЭтап = Объект.ЭтапСделки = СтрокаТЗ.ЭтапСделки;
		
		ГруппаЭтапа = Элементы.Добавить("ГруппаЭтап_" + Индекс, Тип("ГруппаФормы"), Элементы.ГруппаЭтапыСделки);
		ГруппаЭтапа.Вид                 	 				= ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаЭтапа.Группировка         	 				= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаЭтапа.Отображение         	 				= ОтображениеОбычнойГруппы.Нет;
		ГруппаЭтапа.ОтображатьЗаголовок 	 				= Ложь;
		ГруппаЭтапа.РастягиватьПоГоризонтали 				= Истина;
		ГруппаЭтапа.Ширина					 				= 20;
		ГруппаЭтапа.Высота					 				= 1;
		ГруппаЭтапа.РастягиватьПоВертикали 					= Ложь;
		ГруппаЭтапа.ВертикальноеПоложениеПодчиненных 		= ВертикальноеПоложениеЭлемента.Центр;
		
		// Создаем картинку
		ПараметрыДекорации = Новый Структура;
		ПараметрыДекорации.Вставить("ИмяЭлемента"				, "Картинка_Выбран_ЭтапСделки" + Индекс);
		ПараметрыДекорации.Вставить("ГруппаЭлемента"			, ГруппаЭтапа);
		ПараметрыДекорации.Вставить("Картинка"					, ?(НЕ ЗначениеЗаполнено(Объект.РезультатСделки) И СтрокаТЗ.НомерЭтапа = НомерТекущегоЭтапа, БиблиотекаКартинок.ЧекБоксПолный, БиблиотекаКартинок.Пустая));
		ПараметрыДекорации.Вставить("РастягиватьПоГоризонтали"	, Ложь);
		КартинкаВида = УправлениеИнтерфейсамиСервер.СоздатьЭлементДекорация(ЭтаФорма, ПараметрыДекорации);
		КартинкаВида.АвтоМаксимальнаяШирина	 				= Ложь;		
		КартинкаВида.Ширина					 				= 2;
		КартинкаВида.Высота					 				= 0;
		КартинкаВида.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
		
		КнопкаЭтапа = Элементы.Добавить("КнопкаЭтап_" + Индекс, Тип("КнопкаФормы"), ГруппаЭтапа);
		КнопкаЭтапа.Заголовок				 				= ЭтапСделки.Наименование;
		КнопкаЭтапа.ОтображениеФигуры		 				= ОтображениеФигурыКнопки.Нет;
		КнопкаЭтапа.ИмяКоманды				 				= "ИзменитьЭтап";
		КнопкаЭтапа.РастягиватьПоГоризонтали 				= Истина;
		КнопкаЭтапа.Фигура 									= ФигураКнопки.Овал;
		КнопкаЭтапа.Отображение								= ОтображениеКнопки.Текст;			
		КнопкаЭтапа.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
		
		// Создаем картинку
		ПараметрыДекорации = Новый Структура;
		ПараметрыДекорации.Вставить("ИмяЭлемента"				, "Картинка_Выбран_ЭтапСделки_Пустая" + Индекс);
		ПараметрыДекорации.Вставить("ГруппаЭлемента"			, ГруппаЭтапа);
		ПараметрыДекорации.Вставить("Картинка"					, БиблиотекаКартинок.Пустая);
		ПараметрыДекорации.Вставить("РастягиватьПоГоризонтали"	, Ложь);
		КартинкаВида = УправлениеИнтерфейсамиСервер.СоздатьЭлементДекорация(ЭтаФорма, ПараметрыДекорации);
		КартинкаВида.АвтоМаксимальнаяШирина	 				= Ложь;		
		КартинкаВида.Ширина					 				= 2;
		КартинкаВида.Высота					 				= 0;
		КартинкаВида.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
		
		Если ВидСделкиПредопределенный Тогда
			Если ЗначениеЗаполнено(Объект.РезультатСделки) Тогда
				Если Объект.РезультатСделки = Перечисления.РезультатыСделок.Успех Тогда 
					КнопкаЭтапа.Доступность 	= Ложь;
				Иначе 
					КнопкаЭтапа.Доступность 	= ДопустимОтказ И (СтрокаТЗ.НомерЭтапа = 1 ИЛИ СтрокаТЗ.НомерЭтапа = 2);
				КонецЕсли;	
			ИначеЕсли СтрокаТЗ.НомерЭтапа = 1 ИЛИ СтрокаТЗ.НомерЭтапа = 2 Тогда
				КнопкаЭтапа.Доступность 		= НомерТекущегоЭтапа < 3;
			ИначеЕсли СтрокаТЗ.НомерЭтапа = 3 Тогда 
				КнопкаЭтапа.Доступность 		= Ложь;
			ИначеЕсли СтрокаТЗ.НомерЭтапа = 4 Тогда 	
				КнопкаЭтапа.Доступность 		= НомерТекущегоЭтапа > 2;
			КонецЕсли;
		КонецЕсли;
		
		РезультатСделкиУспех = (Объект.РезультатСделки = Перечисления.РезультатыСделок.Успех);
		
		Если (Индекс + 1) <= НомерТекущегоЭтапа Тогда 
			//ИЛИ (ЗначениеЗаполнено(Объект.РезультатСделки) И РезультатСделкиУспех) Тогда
			
			Если НЕ ЗначениеЗаполнено(ЭтапСделки.ЦветЭтапа)
				ИЛИ ЗначениеИзСтрокиВнутр(ЭтапСделки.ЦветЭтапа) = Новый Цвет() Тогда
				
				Цвет =	Новый Цвет(0,112,210);
			Иначе
				Цвет = ЗначениеИзСтрокиВнутр(ЭтапСделки.ЦветЭтапа);
			КонецЕсли;
			
			ГруппаЭтапа.ЦветФона   = Цвет;
			КнопкаЭтапа.ЦветТекста = ПолучитьЦветТекстаПоФону(ГруппаЭтапа.ЦветФона);
		Иначе
			ГруппаЭтапа.ЦветФона   = Новый Цвет(238,241,246); // бледно серый
			КнопкаЭтапа.ЦветТекста = Новый Цвет(117,117,117); // бледно серый			
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ИзменитьЭтап".
//
Процедура ИзменитьЭтап(Команда = Неопределено)
	
	ИзменитьЭтапНаСервере();

КонецПроцедуры

&НаСервере
// Процедура, ИзменитьЭтапНаСервере.
//
Процедура ИзменитьЭтапНаСервере()
	
	ИмяЭлемента = ЭтаФорма.ТекущийЭлемент.Имя;
	Индекс 		= ПолучитьИндексСтроки(ИмяЭлемента);
	Если НЕ Объект.ЭтапСделки = ЭтотОбъект.ЭтапыСделок[Индекс].Ссылка Тогда 
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;	
	Объект.ЭтапСделки = ЭтотОбъект.ЭтапыСделок[Индекс].Ссылка;
	
	Если ЗначениеЗаполнено(Объект.РезультатСделки) Тогда
		Объект.РезультатСделки = Неопределено;
		Объект.ПричинаОтказа   = Неопределено;
		УстановитьВидимостьРезультатаСделки();
	КонецЕсли;
	
	ОбновитьЭтапыСделки();
	
КонецПроцедуры

&НаСервере
// Процедура, ОчиститьГруппуЭтапыСделки.
//
Процедура ОчиститьГруппуЭтапыСделки()
	
	ПодчиненныеЭлементыФормы = Элементы.ГруппаЭтапыСделки.ПодчиненныеЭлементы;	
	КоличествоСтрок 		 = ПодчиненныеЭлементыФормы.Количество();
	
	Пока КоличествоСтрок <> 0 Цикл 
		
		Элементы.Удалить(ПодчиненныеЭлементыФормы[0]);	
		КоличествоСтрок = КоличествоСтрок - 1;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
// Процедура, ЗаполнитьТаблицуЭтапыСделок.
//
Процедура ЗаполнитьТаблицуЭтапыСделок(ТаблицаЭтапов)
	
	ЭтотОбъект.ЭтапыСделок.Очистить();
	
	Для Каждого СтрокаТЗ Из ТаблицаЭтапов Цикл
		
		НоваяСтрока = ЭтотОбъект.ЭтапыСделок.Добавить();
		НоваяСтрока.Цвет         = СтрокаТЗ.ЭтапСделки.ЦветЭтапа;
		НоваяСтрока.Наименование = СтрокаТЗ.ЭтапСделки.Наименование;
		НоваяСтрока.Ссылка       = СтрокаТЗ.ЭтапСделки;
		НоваяСтрока.ВидСделки    = СтрокаТЗ.ЭтапСделки.ВидСделки;
		НоваяСтрока.НомерЭтапа   = СтрокаТЗ.ЭтапСделки.НомерЭтапа;
				
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция, возвращает данные внешних систем мессенджера.
//
Функция ПолучитьДоступныеВнешниеСистемыМессенджера(Клиент, СтруктурнаяЕдиница, ДляОтправкиПервым = Ложь, МассивТребуемыхНомеров = Неопределено)
	
	Возврат Справочники.ВнешниеСистемы.ПолучитьДоступныеВнешниеСистемыМессенджера(Клиент,СтруктурнаяЕдиница, ДляОтправкиПервым, МассивТребуемыхНомеров);
	
КонецФункции

&НаСервереБезКонтекста
// Функция, создает сообщение с признаком ожидания сообщения.
//
Функция УстановитьОжиданиеСообщения(ИдКлиента, ВнешняяСистема, ОписаниеОшибки = "", Объект = Неопределено, НомерТелефона = "")
	
	Если ТипЗнч(ВнешняяСистема) = Тип("Строка") Тогда
		ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьСсылку(Новый УникальныйИдентификатор(ВнешняяСистема));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдКлиента) и ЗначениеЗаполнено(Объект) Тогда
		
		ДанныеКонтакта	 = СоздатьКонтактМессенджера(ВнешняяСистема, Объект, НомерТелефона);
		ИдКлиента		 = ДанныеКонтакта.ИдКлиента;
		ИдСообщения		 = ДанныеКонтакта.ИдСообщения;
		
	Иначе
		
		ИдСообщения = МессенджерСтоматология.ПолучитьИдОжидающегоСообщенияВМесенджер(ИдКлиента, ВнешняяСистема);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдКлиента) Тогда
		ОписаниеОшибки = НСтр("ru = 'Не удалось создать клиента в мессенджере.'; en = 'Failed to create messenger client.'");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ИдСообщения;

	
КонецФункции

&НаСервереБезКонтекста
// Функция, создает канал мессенджера.
//
Функция СоздатьКонтактМессенджера(ВнешняяСистема, Контрагент, Знач НомерТелефона)
	
	Если ВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi Тогда
		
		НомерТелефона = ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(НомерТелефона, Ложь);
		НомерТелефона = ?(СтрДлина(НомерТелефона) > 10 И Лев(НомерТелефона, 1) = "8", "7" + Сред(НомерТелефона, 2), НомерТелефона);
		
		ИдКлиента = НомерТелефона + "@c.us";
		
	КонецЕсли;
	
	ИдКлиента	 = ИдКлиента;
	ИдСообщения	 = Строка(Новый УникальныйИдентификатор);
	
	Если ЗначениеЗаполнено(ИдКлиента) Тогда
		
		НовыйДиалог					 = РегистрыСведений.Диалоги.СоздатьМенеджерЗаписи();
		НовыйДиалог.ИдДиалога		 = Строка(Новый УникальныйИдентификатор);
		НовыйДиалог.ВнешняяСистема	 = ВнешняяСистема;
		НовыйДиалог.ИдКлиента		 = ИдКлиента;
		НовыйДиалог.Начало			 = Дата(2022, 1, 1);
		НовыйДиалог.Окончание		 = Дата(2022, 1, 1);
		
		НовыйДиалог.Записать();
		
		РегистрыСведений.КонтактыМессенджеров.ЗаписатьИдентификаторМессенджера(
			ИдКлиента,
			Контрагент,
			НомерТелефона,,
			ВнешняяСистема,
			ОбщегоНазначения.ПолучитьЗначениеРеквизита(Контрагент, "Наименование"),,,,
			НовыйДиалог.ИдДиалога);
		
		РегистрыСведений.ЖурналСообщений.ДобавитьЗапистьЖурналСообщений(
			ИдКлиента,
			ИдСообщения,,,
			НСтр("ru = 'Создан контакт'"),
			Истина,
			Перечисления.Мессенджеры.whatsapp,
			Ложь,
			ТекущаяДатаСеанса(),
			ВнешняяСистема,,,,,,,,,
			НовыйДиалог.ИдДиалога,
			Истина
		);
		
	КонецЕсли;
	
	ДанныеКонтакта = Новый Структура;
	ДанныеКонтакта.Вставить("ИдКлиента"		, ИдКлиента);
	ДанныеКонтакта.Вставить("ИдСообщения"	, ИдСообщения);
	
	Возврат ДанныеКонтакта;
	
КонецФункции

&НаСервере
// Процедура - Обновить декорацию направившего врача
//
Процедура ОбновитьДекорациюНаправившегоВрача()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.ГруппаНаправившегоВрача.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	НаправившийВрач = РегистрыСведений.Профосмотры.ПолучитьНаправившегоВрача(Объект.Контрагент, , Объект.Ссылка);
	Элементы.ГруппаНаправившегоВрача.Видимость = ЗначениеЗаполнено(НаправившийВрач);
	Если ЗначениеЗаполнено(НаправившийВрач) Тогда 
		Элементы.ДекорацияНаправившегоВрача.Заголовок = СтрШаблон(НСтр("ru='По направлению от %1';en='In the direction from %1'")
																, ОбщегоНазначения.ПолучитьЗначениеРеквизита(НаправившийВрач, "НаименованиеСокращенное"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить декорацию повторного приема
//
Процедура ОбновитьДекорациюПовторногоПриема()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.ГруппаПовторногоПриема.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ПредыдущийПрием 		= РегистрыСведений.Профосмотры.ПолучитьПрошлыйПрием(Объект.Контрагент, , Объект.Ссылка);
	ВыводитьПредыдущийПрием = ЗначениеЗаполнено(ПредыдущийПрием);
	Если НЕ ЗначениеЗаполнено(Объект.ПредыдущийПрием) Тогда
		Объект.ПредыдущийПрием = ПредыдущийПрием;
		ЭтаФорма.Модифицированность = Ложь;
	КонецЕсли;	
	Элементы.ГруппаПовторногоПриема.Видимость = ВыводитьПредыдущийПрием;
	Если ВыводитьПредыдущийПрием Тогда //ЗначениеЗаполнено(Объект.ПредыдущийПрием) Тогда 
		Элементы.ПоказатьПрошлыйПрием.Заголовок = СтрШаблон(НСтр("ru='Прошлый приём от %1';en='Past appointment from %1'")
																, Формат(ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.ПредыдущийПрием, "ВремяНачалаПриема"), "ДФ='dd MMMM yyyy ''в'' HH:mm'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - управляет отображением элементов формы.
//
Процедура ОбновитьДанныеПоКлиенту()
	
	ВидСделкиПредопределенный = Объект.ВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты");
	
	УстановитьВидимостьФормыНаСервере();
	Если Параметры.Ключ.Пустая() Тогда
		УправлениеКонтактнойИнформациейСтоматология.ПриСозданииПриЧтенииНаСервереСделки(ЭтотОбъект, Объект.Контрагент);
	КонецЕсли;
	
	СформироватьСтруктуруДанныхВсплывающихГрупп();
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		ЭтотОбъект.СтатусКонтрагента = Справочники.Контрагенты.ПолучитьСтатус(Объект.Контрагент);
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СтатусКонтрагента) Тогда
			ЭтотОбъект.СтатусКонтрагента = Перечисления.СтатусыКонтрагентов.Первичный;
		КонецЕсли;
		
		ЭтотОбъект.Фамилия  = Объект.Контрагент.Фамилия;
		ЭтотОбъект.Имя		= Объект.Контрагент.Имя;
		ЭтотОбъект.Отчество = Объект.Контрагент.Отчество;
		
		ВывестиСтатусыКонтрагента();
		ОбновитьИсториюВзаимодействияСКлиентом();	
		
		ЗаполнитьТаблицуМеток();
		ОбновитьМетки();
		
		// Обновляем надпись Последнее посещение
		// Элементы.ДекорацияПоследнееПосещение.Заголовок = Документы.Посещение.ВернутьНадписьПоследнееПосещение(Объект.Контрагент, ЭтотОбъект.ТекущаяСтруктурнаяЕдиница);
		Элементы.ГруппаПоследнееПосещение.Видимость    = ЗначениеЗаполнено(Элементы.ДекорацияПоследнееПосещение.Заголовок);	
	Иначе
		Элементы.ГруппаПоследнееПосещение.Видимость = Ложь;	
	КонецЕсли; 
	ЗаполнитьСписокВыбораВзаимодействия();
	ЗаполнитьСписокВыбораРежимаНапоминания();
	ЗаполнитьСписокВыбораШаблоновSMSСообщений();
	
	ОбновитьЭтапыСделки();
	ЗаполнитьПричиныОтказа();
	УстановитьУсловноеОформмлениеСписка();
	ОбновитьПараметрыВыбораЗаявки();
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры	

&НаСервере
// Процедура - Инициализировать ограничение типа менеджера
//
Процедура ИнициализироватьОграничениеТипаМенеджера()

	Если НЕ (ЗначениеЗаполнено(Объект.Менеджер) И ТипЗнч(Объект.Менеджер) = Тип("СправочникСсылка.Пользователи")) Тогда 
		МассивТипов = Новый Массив(); 
		МассивТипов.Добавить(Тип("СправочникСсылка.Сотрудники")); 
		НашеОписание = Новый ОписаниеТипов(МассивТипов);
		
		Элементы.Менеджер.ОграничениеТипа = НашеОписание; 
		// ПолеВвода1 = НашеОписание.ПривестиЗначение(ПолеВвода1);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - управляет отображением элементов формы.
//
Процедура УстановитьВидимостьЭлементов()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		ФИОКонтрагента = ПолучитьПолноеФИООбъекта(ЭтотОбъект);
		Элементы.ОткрытьКонтрагента.Заголовок = ?(ЗначениеЗаполнено(ФИОКонтрагента), ФИОКонтрагента, Объект.Контрагент.НаименованиеПолное);		
		
		СоответствиеЦветов  = ПолучитьСоответствиеЦветовИСтатусовКлиентов();
		СтатусПредставление = ?(ЭтотОбъект.СтатусКонтрагента = Перечисления.СтатусыКонтрагентов.Потенциальный, Нстр("ru = 'Потенциальный'; en = 'Potential'"), ЭтотОбъект.СтатусКонтрагента); 
		
		Элементы.ГруппаСтатус.ЦветФона            = СоответствиеЦветов.Получить(ЭтотОбъект.СтатусКонтрагента);	
		Элементы.ОткрытьИсториюСтатусов.Заголовок = СтатусПредставление; 
				
	КонецЕсли;	
	
	// Видимость элементов взаимодействий.
	Элементы.ГруппаSMS.Видимость = РазрешенаОтправкаSMSСообщений();
	
	Элементы.ГруппаВзаимодействиеSMSНастроитьСервис.Видимость     = НЕ НаличиеСервисаSMSРассылки();
	Элементы.ГруппаВзаимодействиеSMSОсновная.Видимость            = НЕ Элементы.ГруппаВзаимодействиеSMSНастроитьСервис.Видимость;	
	
	Элементы.ГруппаВзаимодействиеПисьмоНастроитьАккаунт.Видимость = НЕ НаличиеПочтовогоАккаунта();
	Элементы.ГруппаВзаимодействиеПисьмоОсновная.Видимость         = НЕ Элементы.ГруппаВзаимодействиеПисьмоНастроитьАккаунт.Видимость;
	
	Если НЕ Объект.Ссылка.Пустая() И ПараметрыСеанса.ТекущийПользователь.РольПользователя = Перечисления.РольПользователя.Врач Тогда 
		Элементы.ГруппаКонтактнаяИнформацияСправочникКлиенты.Видимость	= Ложь;			
	КонецЕсли;
	
	УстановитьФокусЭлементаСервер();
	
	Если ЗначениеЗаполнено(Объект.РезультатСделки) Тогда 
		Элементы.Врач.ТолькоПросмотр 			= Истина;
		Элементы.Специализация.ТолькоПросмотр 	= Истина;
		Элементы.Менеджер.ТолькоПросмотр 		= Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает список заначений активных заявок контрагента
//
Функция ПолучитьАктивныеЗаявкиКонтрагента(Текст = "", Контрагент, ВернутьМассив = Ложь)
	
	МассивЗаявок = Справочники.Заявки.ПолучитьМассивАктуальныхЗаявокКонтрагента(Текст, Контрагент);
	
	Если ВернутьМассив Тогда
		Возврат МассивЗаявок;
	КонецЕсли;
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.ЗагрузитьЗначения(МассивЗаявок);
	
	Возврат СписокЗначений;
	
КонецФункции	

&НаСервере
// Процедура, копирует элементы формы.
//
Процедура СкопироватьЭлементФормыРекурсивно(Источник, Родитель, Индекс)
	
	Если ТипЗнч(Источник) = Тип("ГруппаФормы") Тогда
		
		ГруппаРодитель = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(ЭтаФорма, Источник, Индекс, Родитель);
				
		Для Каждого Элемент Из Источник.ПодчиненныеЭлементы Цикл
			СкопироватьЭлементФормыРекурсивно(Элемент, ГруппаРодитель, Индекс);	
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("КнопкаФормы") Тогда 
		
		УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(ЭтаФорма, Источник, Индекс, Родитель);
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДекорацияФормы") Тогда	
		
		УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(ЭтаФорма, Источник, Индекс, Тип("ДекорацияФормы"), Родитель);				
	Иначе		
		УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(ЭтаФорма, Источник, Индекс, Тип("ПолеФормы"), Родитель, ВернутьПутьКДанным(Источник, Индекс));				
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - Вернуть путь к данным.
//
// Параметры:
//  ИмяЭлемента	 - 	 - 
//  Индекс		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьПутьКДанным(Источник, Индекс)
	
	ИмяЭлемента = Источник.Имя;
	
	Если СтрНайти(ИмяЭлемента, "Документ") > 0 Тогда 
		
		ПутьКДанным = Источник.ПутьКДанным;
	Иначе
		ПутьКДанным = СтрЗаменить(Источник.ПутьКДанным, "[0]", "[" + Индекс + "]");
	КонецЕсли;
	
	Возврат ПутьКДанным;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает идентификатор строки данных по имени элемента.
//
Функция ПолучитьИндексСтроки(ИмяЭлемента)
	
	НомерСимвола = Найти(ИмяЭлемента,"_");
	Возврат Число(Прав(ИмяЭлемента,СтрДлина(ИмяЭлемента) - НомерСимвола)); 
	
КонецФункции

&НаСервере
// Процедура, обновляет текущего клиента или создает нового.
//
Процедура ОбновитьДанныеКлиента(ТекущийОбъект)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Контрагент) Тогда
		ОбъектКонтрагент = ТекущийОбъект.Контрагент.ПолучитьОбъект();
	Иначе
		
		// Создаем нового клиента
		ОбъектКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
		
		ДанныеЗаполнения = Новый Структура();
		ДанныеЗаполнения.Вставить("СтруктураФИО", Справочники.Контрагенты.ФамилияИмяОтчество(ПолучитьПолноеФИООбъекта(ЭтотОбъект)));
		
		ОбъектКонтрагент.Заполнить(ДанныеЗаполнения);
		
	КонецЕсли;
	
	Для Каждого СтрокаТЗ Из ЭтотОбъект.ОбновляемыеДанные Цикл
		
		Если СтрокаТЗ.ОбъектОбновления = "ФИО" Тогда
			
			ОбъектКонтрагент.ДополнительныеСвойства.Вставить("МодифицироватьНаименованиеКонтрагента");
			
			ОбъектКонтрагент.Фамилия  = ЭтотОбъект.Фамилия;
			ОбъектКонтрагент.Имя 	  = ЭтотОбъект.Имя;
			ОбъектКонтрагент.Отчество = ЭтотОбъект.Отчество;	
			
		КонецЕсли;
		
		Если СтрокаТЗ.ОбъектОбновления = "КонтактнаяИнформация" Тогда
			
			// КонтактнаяИнформация
			УправлениеКонтактнойИнформациейСтоматология.ПередЗаписьюНаСервере(ЭтотОбъект, ОбъектКонтрагент);
			// Конец КонтактнаяИнформация
	
			ОбъектКонтрагент.ДополнительныеСвойства.Вставить("КонтактнаяИнформацияПоменялась", Истина);
			// ОбъектКонтрагент.КонтактнаяИнформация.Очистить();
			// ОбъектКонтрагент.КонтактнаяИнформация.Загрузить(ЭтотОбъект.КонтактнаяИнформация.Выгрузить());
			
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка
		ОбъектКонтрагент.Записать();	
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось записать клиента'; en = 'Failed to record client'") + ОписаниеОшибки());		
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Контрагент) Тогда
		
		ТекущийОбъект.Контрагент = ОбъектКонтрагент.Ссылка;	
		
		СтатусыКонтрагентовМенеджерЗаписи            			= РегистрыСведений.СтатусыКонтрагентов.СоздатьМенеджерЗаписи();
		СтатусыКонтрагентовМенеджерЗаписи.Период     			= ТекущаяДатаСеанса();	
		СтатусыКонтрагентовМенеджерЗаписи.Контрагент 			= ТекущийОбъект.Контрагент;
		СтатусыКонтрагентовМенеджерЗаписи.Статус     			= Перечисления.СтатусыКонтрагентов.Потенциальный;
		СтатусыКонтрагентовМенеджерЗаписи.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Процедура, ДобавитьОбновляемыеДанные.
//
Процедура ДобавитьОбновляемыеДанные(ИмяОбъектаОбновления, ТаблицаФормы)
	
	НайденныеСтроки = ТаблицаФормы.НайтиСтроки(Новый Структура("ОбъектОбновления", ИмяОбъектаОбновления));
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		НоваяСтрока = ТаблицаФормы.Добавить();
		НоваяСтрока.ОбъектОбновления = ИмяОбъектаОбновления;
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, продолжение обработчика события на сервере "РезультатСделкиУспешно".
//
Процедура РезультатСделкиУспешноНаСервере()
	
	Объект.РезультатСделки = Перечисления.РезультатыСделок.Успех;
	Объект.ЭтапУспеха	   = Объект.ЭтапСделки;
	Объект.ЭтапСделки	   = Справочники.ЭтапыСделок.Успех;
	Объект.ПричинаОтказа   = Неопределено;
	ОбновитьЭтапыСделки();
	УстановитьВидимостьРезультатаСделки();

КонецПроцедуры

&НаСервере
// Процедура, заполняет список значений формы "СписокПричинОтказа".
//
Процедура ЗаполнитьПричиныОтказа()
	
	ЭтотОбъект.СписокПричинОтказа.Очистить();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПричиныОтказов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПричиныОтказов КАК ПричиныОтказов
	|ГДЕ
	|	НЕ ПричиныОтказов.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПричиныОтказов.Наименование");
	
	ЭтотОбъект.СписокПричинОтказа.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает цвет текста от передаваемого цвета фона.
//
Функция ПолучитьЦветТекстаПоФону(ЦветФона)
	
	Если (ЦветФона.Зеленый + ЦветФона.Красный + ЦветФона.Синий) > 383 Тогда
		Возврат Новый Цвет(60,60,60);		
	Иначе
		Возврат Новый Цвет(255,255,255);
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить округленное время взаимодействия
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьОкругленноеВремяВзаимодействия(ПолучитьТекДату = Ложь)
	
	ДатаВремя = ТекущаяДатаСеанса() + ?(ПолучитьТекДату, 0, 86400);
	
	КоличествоИнтервалов      = (ДатаВремя - НачалоДня(ДатаВремя)) / 1800;
	КоличествоЦелыхИнтервалов = Цел(КоличествоИнтервалов);
	
	// Округлить в большую сторону.
	Если ПолучитьТекДату = Ложь
		И КоличествоИнтервалов <> КоличествоЦелыхИнтервалов Тогда
		
		Возврат НачалоДня(ДатаВремя) + (КоличествоЦелыхИнтервалов + 1) * 1800;
	Иначе
		Возврат НачалоДня(ДатаВремя) + КоличествоЦелыхИнтервалов * 1800;
	КонецЕсли;
	
КонецФункции

&НаСервере
// Процедура, устанавливает видимость и оформление, кнопки и группы "результат сделки".
//
Процедура УстановитьВидимостьРезультатаСделки()
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	// Устанавливаем свойства по умолчанию
	Элементы.ОткрытьПродажу.Видимость 					= Ложь;	
	//Элементы.УстановитьОтказ.Видимость 					= Истина;
	
	Элементы.ГруппаЭтапаОтказ.ЦветФона 					= Новый Цвет(238, 241, 246); 
	Элементы.УстановитьОтказ.ЦветТекста 				= Новый Цвет(117,117,117);
	Элементы.ГруппаЭтапаУспех.ЦветФона 					= Новый Цвет(238, 241, 246); 
	Элементы.УстановитьУспех.ЦветТекста 				= Новый Цвет(117,117,117);
	
	Элементы.УстановитьУспех.Заголовок 					= НСтр("ru = 'Успех'; en = 'Success'");
	Элементы.УстановитьОтказ.Заголовок 					= ?(ВидСделкиПредопределенный И НЕ ЗначениеЗаполнено(Объект.РезультатСделки), Строка(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПричиныОтказов.КлиентОтказался")), НСтр("ru = 'Отказ'; en = 'Refusal'"));
	
	// Устанавливаем актуальные свойства	
	ДопустимОтказ 										= ?(ВидСделкиПредопределенный, Справочники.Сделки.ДопустимОтказСогласноТекущегоЭтапа(Объект.Ссылка, ВидСделкиПредопределенный), Истина);
	
	Элементы.УстановитьУспех.Доступность 				= НЕ ВидСделкиПредопределенный ИЛИ Объект.РезультатСделки = Перечисления.РезультатыСделок.Успех;
	Элементы.УстановитьОтказ.Доступность 				= НЕ ВидСделкиПредопределенный ИЛИ (ДопустимОтказ И НЕ Объект.РезультатСделки = Перечисления.РезультатыСделок.Отказ);

	Элементы.ГруппаЭтапаУспех.Видимость 				= НЕ ВидСделкиПредопределенный ИЛИ Объект.РезультатСделки = Перечисления.РезультатыСделок.Успех;				
	Элементы.ГруппаЭтапаОтказ.Видимость 				= НЕ ВидСделкиПредопределенный ИЛИ Объект.РезультатСделки = Перечисления.РезультатыСделок.Отказ ИЛИ ДопустимОтказ;				
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.РезультатСделки) Тогда
			Если Объект.РезультатСделки = Перечисления.РезультатыСделок.Успех Тогда
				Элементы.ГруппаЭтапаОтказ.Видимость 	= НЕ ВидСделкиПредопределенный;
				СтруктураНаименований 					= Справочники.ВидыСделок.ПолучитьНаименованияЗавершающихЭтаповСделки(Объект.ВидСделки);				
				Элементы.ГруппаЭтапаУспех.ЦветФона 		= Новый Цвет(72, 193, 123); 
				Элементы.УстановитьУспех.ЦветТекста 	= Новый Цвет(255, 255, 255);
				Элементы.УстановитьУспех.Заголовок 		= СтруктураНаименований.НаименованиеЭтапаУспех;
				//Элементы.ОткрытьПродажу.Видимость 		= Истина;
				КомандаУспеха = Команды.Найти("РезультатСделкиУспешно");
				Если ЗначениеЗаполнено(Объект.Прием) Тогда 
					НомерПродажи = ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.Прием, "Номер"), "");
					Элементы.УстановитьУспех.Заголовок 	= Элементы.УстановитьУспех.Заголовок + ": " + НСтр("ru = 'Прием № '; en = 'Reception №'") + НомерПродажи;
					Если НЕ КомандаУспеха = Неопределено Тогда 
						КомандаУспеха.Подсказка = НСтр("ru = 'Открыть приём'; en = 'Open appointment'");
					КонецЕсли;	
					//Элементы.ОткрытьПродажу.Заголовок 	= НСтр("ru = 'Прием № '; en = 'Reception №'") + НомерПродажи;
					//Элементы.УстановитьОтказ.Доступность = Ложь;
				Иначе
					Элементы.УстановитьУспех.Заголовок 	= Элементы.УстановитьУспех.Заголовок + ": " + НСтр("ru = '(Прием не указан)'; en = '(No Reception specified)'");
					Если НЕ КомандаУспеха = Неопределено Тогда 
						КомандаУспеха.Подсказка = НСтр("ru = 'Выбрать приём'; en = 'Choose an appointment'");
					КонецЕсли;						
					//Элементы.ОткрытьПродажу.Заголовок 	= НСтр("ru = '(Прием не указан)'; en = '(No Reception specified)'");
				КонецЕсли;
			Иначе
				Элементы.ГруппаЭтапаОтказ.ЦветФона 		= Новый Цвет(246, 110, 110); 
				Элементы.УстановитьОтказ.ЦветТекста 	= Новый Цвет(255, 255, 255);
				Элементы.УстановитьОтказ.Заголовок 		= Строка(Объект.РезультатСделки) + ?(ЗначениеЗаполнено(Объект.ПричинаОтказа), ": " + Строка(Объект.ПричинаОтказа), "");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, УстановитьВидимостьФормы.
//
Процедура УстановитьВидимостьФормыНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		// ЭтаФорма.АвтоЗаголовок = Истина;		
		ЭтаФорма.Заголовок = Строка(Объект.Ссылка) + " (Сделка)";
		
		// Эмуляция RLS т.к. на просмотр не действует.
		// При записи все равно RLS не позволит записать и что бы не нервировать пользователя, нужно заблокировать форму сразу.
		// Редактировать можно только свои сделки или новые сделки.
		// С дополнительными ролями, можно менять все сделки.
		Если ЗначениеЗаполнено(Объект.Менеджер) 
			И ЭтотОбъект.ТекущийПользователь.Роль = Перечисления.РольПользователя.Врач
			И Объект.Менеджер <> ЭтотОбъект.ТекущийПользователь Тогда
			
			РазрешеноИзменение = Ложь;
			
			// У сотрудника могут быть расширенные права. Подробнее см. все роли.
			Если РольДоступна("ДобавлениеИзменениеСделокВсех")
				ИЛИ РольДоступна("ПолныеПрава")
				ИЛИ РольДоступна("АдминистраторСистемы") Тогда
				
				РазрешеноИзменение = Истина;
				
			КонецЕсли;
			
			Если Не РазрешеноИзменение Тогда
				
				ЭтаФорма.ТолькоПросмотр = Истина;
				Элементы.ГруппаСтатусыШапка.Доступность = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		// ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = ?(ЗначениеЗаполнено(Объект.Код), НСтр("ru = 'Новая сделка № '; en = 'New deal'") + ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Объект.Код, ""), НСтр("ru = 'Новая сделка № '; en = 'New deal'")) + " (" + СокрЛП(Строка(Объект.ВидСделки)) + ")";
	КонецЕсли;
	
	ИсточникИнформацииЭтоДругойПациент = (Объект.ИсточникИнформации = Справочники.РекламныеИсточники.ДругойПациент);
	Элементы.ИсточникИнформацииЗначение.Видимость = ИсточникИнформацииЭтоДругойПациент;	
	Если ИсточникИнформацииЭтоДругойПациент Тогда
		Элементы.ИсточникИнформацииЗначение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	КонецЕсли;
			
	Элементы.ГруппаФИОСтатус.Видимость   = ЗначениеЗаполнено(Объект.Контрагент);
	Элементы.ГруппаФИОСоздание.Видимость = НЕ ЗначениеЗаполнено(Объект.Контрагент) И Объект.ВидСделки <> ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.ПостоянныеПациенты");	 
	Элементы.Контрагент.Видимость        = НЕ ЗначениеЗаполнено(Объект.Контрагент) И Объект.ВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.ПостоянныеПациенты");
		
	УстановитьВидимостьРезультатаСделки();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция, ПолучитьПолноеФИООбъекта.
//
Функция ПолучитьПолноеФИООбъекта(ОбъектПараметр)
	
	Возврат ОбъектПараметр.Фамилия + 
			?(ЗначениеЗаполнено(ОбъектПараметр.Фамилия), " ", "") + ОбъектПараметр.Имя + 
			?(ЗначениеЗаполнено(ОбъектПараметр.Имя), " ", "") + ОбъектПараметр.Отчество;

КонецФункции

&НаСервере
// Процедура, УстановитьУсловноеОформмлениеСписка.
//
Процедура УстановитьУсловноеОформмлениеСписка()
	
	Если ЗначениеЗаполнено(Объект.ПричинаОтказа) Тогда
		
		НайденнаяСтрока = ЭтотОбъект.СписокПричинОтказа.НайтиПоЗначению(Объект.ПричинаОтказа);
		
		Если НайденнаяСтрока <> Неопределено Тогда
			
			ЭтаФорма.УсловноеОформление.Элементы.Очистить();
			
			ЭлементУФ = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
			// Создаем условие отбора
			ЭлементОтбора = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СписокПричинОтказа.Значение"); // имя поля
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно; // либо задаем свой	
			ЭлементОтбора.ПравоеЗначение = Объект.ПричинаОтказа;
			ЭлементОтбора.Использование  = Истина;
			
			ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(246, 110, 110));
			ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 255, 255));
			
			ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();
			ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("СписокПричинОтказаЗначение");
			ПолеОформления.Использование = Истина;
						
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, ПолучитьПоследнююПродажуПоСделке.
//
Функция ПолучитьПоследнююПродажуПоСделке(Сделка)
	
	Если НЕ ЗначениеЗаполнено(Сделка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Прием.Ссылка КАК Продажа
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Сделка = &Сделка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Прием.Дата УБЫВ";
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗначениеВозврата = ?( Выборка.Следующий(), Выборка.Продажа, Неопределено);
	
	Возврат ЗначениеВозврата;
		
КонецФункции

&НаКлиенте
// Процедура, обработчик команды "ОткрытьПродажу".
//
Процедура ОткрытьПродажу(Команда)
	
	Если ЗначениеЗаполнено(Объект.Прием) Тогда
		ПоказатьЗначение(,Объект.Прием);
	Иначе 
		ВыбратьРеализацию(Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Проверить наличие сервиса SMSРассылки.
//
// Возвращаемое значение:
//   -
//
Функция НаличиеСервисаSMSРассылки()
	
	Возврат Не Константы.СервисSMSРассылкиПоУмолчанию.Получить().Пустая();
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Проверить наличие сервиса SMSРассылки.
//
// Возвращаемое значение:
//   -
//
Функция НаличиеСервисовSMSРассылки()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СервисыРассылки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СервисыРассылки КАК СервисыРассылки
	|ГДЕ
	|	СервисыРассылки.ПометкаУдаления = ЛОЖЬ");

	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Проверить наличие почтового аккаунта.
//
// Возвращаемое значение:
//   -
//
Функция НаличиеПочтовогоАккаунта()
	
	Возврат ЗначениеЗаполнено(УправлениеЭлектроннойПочтой.ПолучитьУчетнуюЗаписьДляОтправкиПоУмолчанию());
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Разрешена отправка SMSСообщений.
// 
// Возвращаемое значение:
//   - 
//
Функция РазрешенаОтправкаSMSСообщений()
	
	Возврат РольДоступна(Метаданные.Роли.ПолныеПрава);
	
КонецФункции

&НаСервереБезКонтекста
// Функция, проверяет роль доступность роли.
//
// Параметры:
// 	Роль - Строка - Роль метаданных в строковом представлении.
//
Функция РольДоступнаКлиентСервер(Роль)
	
    Возврат РольДоступна(Роль);
	
КонецФункции

&НаКлиенте
Процедура ВзаимодействиеЗадачаСтатусПриИзменении(Элемент)
	
	ЭтотОбъект.ВзаимодействиеЗадачаВыполнена = ВзаимодействиеЗадачаСтатус;
	
	Если ВзаимодействиеЗадачаСтатус тогда
		
		ЭтотОбъект.ВзаимодействиеЗадачаДата      = ПолучитьОкругленноеВремяВзаимодействия(Истина);
		ВзаимодействиеЗадачаДатаПриИзмененииНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Скрыть показать дополнительно
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СкрытьПоказатьДополнительно(Команда)
	
	Элементы.Дополнительно.Видимость = НЕ Элементы.Дополнительно.Видимость;
	
КонецПроцедуры

&НаКлиенте 
// Процедура, Контрагент начало выбора.
//
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.ВидСделки = ПредопределенноеЗначение("Справочник.ВидыСделок.ПостоянныеПациенты") Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы       = Новый Структура("СделкаПостоянныйПациент", Истина);
		ОписаниеОповещения   = Новый ОписаниеОповещения("НачатьВыборПациента", ЭтотОбъект);	
		ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", ПараметрыФормы,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
	
КонецПроцедуры 

 &НаКлиенте
// Процедура, начать выбор пациента.
//
Процедура НачатьВыборПациента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Контрагент = Результат; 
    ОбновитьДанныеПоКлиенту();   
	
КонецПроцедуры  

&НаКлиентеНаСервереБезКонтекста
// Процедура, устанавливает видимость поля "КаналПривлеченияЗначение".
//
Процедура УстановитьВидимостьЗначенияКаналаПривлечения(Форма)
	
	Форма.Элементы.КаналПривлеченияЗначение.Видимость = (Форма.Объект.КаналПривлечения = ПредопределенноеЗначение("Справочник.КаналыПривлечения.ЧатСКлиентом"));
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, закрепляет/открепляет заметку. 
//
Процедура ЗакрепитьОткрепитьЗаметку(ИдЗаметки, Закреплена);
	
	РегистрыСведений.Заметки.ЗакрепитьОткрепитьЗаметку(ИдЗаметки, Закреплена);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция - Фильтр применен.
//
// Параметры:
//  СписокФильтрации - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ФильтрПрименен(СписокФильтрации)
	
	Для Каждого Фильтр Из СписокФильтрации Цикл
		Если Фильтр.Пометка = Истина Тогда
			Возврат Истина;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик завершения перехода в чат мессенджера.
//
Процедура ПерейтиВЧат(ИдКлиента, ВнешняяСистема)
	
	// Проверим подключенно ли расширение мессенджера.
	Если НЕ ОбщегоНазначенияСтоматология.ИспользуетсяРасширение("Мессенджер") Тогда 
		Возврат;
	КонецЕсли;
	
	ИдСообщения = УстановитьОжиданиеСообщения(ИдКлиента, ВнешняяСистема);
	
	ДанныеКаналаСтруктура = Новый Структура;
	ДанныеКаналаСтруктура.Вставить("ИдКлиента"		, ИдКлиента);
	ДанныеКаналаСтруктура.Вставить("ВнешняяСистема"	, ВнешняяСистема);
	ДанныеКаналаСтруктура.Вставить("ИдСообщения"	, ИдСообщения);
	
	ПараметрыОткрытия = Новый Структура("ДанныеКанала", ДанныеКаналаСтруктура);
	
	Оповестить("ОткрытьДиалог", ПараметрыОткрытия);
	ОткрытьФорму("Обработка.Мессенджер_Стоматология.Форма.ФормаЧатаНовая", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

#Область МеткиКлиента

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ОбработчикРедактированияМеток(Команда)
	
	ОбновитьМетки(Ложь);

КонецПроцедуры
 
&НаКлиенте
// Процедура, обработчик команды подключаемый "ОтображатьМеткуПриНажатии".
//
Процедура Подключаемый_ОтображатьМеткуПриНажатии(Команда)
	
	КнопкаМетки = ТекущийЭлемент;
	ГруппаМетки = КнопкаМетки.Родитель;
	
 	ИндексМетки = Число(СтрЗаменить(КнопкаМетки.Имя, Лев(КнопкаМетки.Имя, Найти(КнопкаМетки.Имя, "_")), ""));
	ДанныеМетки = ЭтотОбъект.ТаблицаМеток.НайтиПоИдентификатору(ИндексМетки);
	
	Если ДанныеМетки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовоеЗначениеАктивности = Не ДанныеМетки.Активна;
	
	ЗаписатьИзменениеМетки(ДанныеМетки.Метка, Объект.Контрагент, НовоеЗначениеАктивности);
	
	ДанныеМетки.Активна = НовоеЗначениеАктивности;
	
	КнопкаМетки.ЦветТекста	 = ?(НовоеЗначениеАктивности И ДанныеМетки.ЦветТекстаБелый, Новый Цвет(255, 255, 255), Новый Цвет(77, 77, 77));
	ГруппаМетки.ЦветФона	 = ?(НовоеЗначениеАктивности, ДанныеМетки.ЦветФона, Новый Цвет(255, 255, 255));

КонецПроцедуры

&НаСервере
// Процедура, инициирует обновление меток клиента.
//
Процедура ОбновитьМетки(СоздатьСсылкуРедактирования = Истина)
	
	РегистрыСведений.МеткиКлиентов.СоздатьВизуальныеЭлементыМеток(
		Объект.Контрагент,
		ЭтаФорма,
		Элементы.ГруппаМеткиКлиента,
		СоздатьСсылкуРедактирования
	);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, записывает изменение метки в регистр.
//
Процедура ЗаписатьИзменениеМетки(Метка, Клиент, Активна)
	
	НаборЗаписей = РегистрыСведений.МеткиКлиентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Клиент.Установить(Клиент);
	НаборЗаписей.Отбор.Метка.Установить(Метка);
	
	Если Активна = Истина Тогда
		
		НоваяЗапись			 = НаборЗаписей.Добавить();
		НоваяЗапись.Период	 = ТекущаяДатаСеанса();
		НоваяЗапись.Клиент	 = Клиент;
		НоваяЗапись.Метка	 = Метка;
		НоваяЗапись.Активна	 = Активна;
		НоваяЗапись.Автор	 = ПараметрыСеанса.ТекущийПользователь;
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет таблицу меток разрешенными метками и устанавливает значения их активности.
//
Процедура ЗаполнитьТаблицуМеток()
	
	ТаблицаМеток.Очистить();
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Метки.Ссылка КАК Метка,
	|	ВЫБОР
	|		КОГДА МеткиДокументаКлиента.Активна
	|			ТОГДА МеткиДокументаКлиента.Активна
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Активна,
	|	Метки.ЦветМетки КАК ЦветМетки,
	|	Метки.ЦветТекстаБелый КАК ЦветТекстаБелый,
	|	Метки.Наименование КАК ПредставлениеМетки
	|ИЗ
	|	Справочник.Метки КАК Метки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МеткиКлиентов.Метка.Ссылка КАК МеткаСсылка,
	|			МеткиКлиентов.Активна КАК Активна
	|		ИЗ
	|			РегистрСведений.МеткиКлиентов КАК МеткиКлиентов
	|		ГДЕ
	|			МеткиКлиентов.Клиент = &Ссылка
	|			И МеткиКлиентов.Активна) КАК МеткиДокументаКлиента
	|		ПО Метки.Ссылка = МеткиДокументаКлиента.МеткаСсылка.Ссылка
	|ГДЕ
	|	Метки.ИспользоватьДляПациентов
	|
	|СГРУППИРОВАТЬ ПО
	|	Метки.Ссылка,
	|	ВЫБОР
	|		КОГДА МеткиДокументаКлиента.Активна
	|			ТОГДА МеткиДокументаКлиента.Активна
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Метки.Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Контрагент);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Метка Из Результат Цикл
		
		СтрокаТаблицы = ТаблицаМеток.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Метка);
		
		Если ЗначениеЗаполнено(Метка.ЦветМетки) Тогда
			
			ЦветМетки = ЗначениеИзСтрокиВнутр(Метка.ЦветМетки);
			
			Если ЦветМетки.Вид = ВидЦвета.АвтоЦвет Или (ЦветМетки.Красный = 255 И ЦветМетки.Зеленый = 255 И ЦветМетки.Синий = 255) Тогда
				ЦветФона = Новый Цвет(242, 242, 242);
			Иначе
				ЦветФона = ЦветМетки;
			КонецЕсли;
			
		Иначе
			ЦветФона = Новый Цвет(242, 242, 242);
			
		КонецЕсли;
		
		СтрокаТаблицы.ЦветФона = ЦветФона;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
