 
#Область ОписаниеПеременных

&НаКлиенте
Перем Документ; // Переменная содержит данные подписи электронных писем

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураМеню = Новый Структура;
	СтруктураМеню.Вставить("Приветствие", "ГруппаПриветствия");
	СтруктураМеню.Вставить("Подпись"	, "ГруппаПодписи");
	
	ОбработкаТабличныхЧастейКлиент.СоздатьМенюДокумента(ЭтаФорма, СтруктураМеню, "ГруппаПереключательЗакладок");
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаКлиенте       
// Процедура При открытии.
//
Процедура ПриОткрытии(Отказ)
	
	// Заголовок= "Введите текст!";
	Список = Элементы.КомандаformatBlock.СписокВыбора;
	Список.Добавить("<p>", "Обычный");
	Список.Добавить("<h1>", "Заголовок 1");
	Список.Добавить("<h2>", "Заголовок 2");
	Список.Добавить("<h3>", "Заголовок 3");
	Список.Добавить("<h4>", "Заголовок 4");
	Список.Добавить("<h5>", "Заголовок 5");
	Список.Добавить("<h6>", "Заголовок 6");
	Список.Добавить("<pre>", "Форматированный");
	Список.Добавить("<address>", "Адрес");
	ТекЭлемент = Список.НайтиПоИдентификатору(0);
	СтилиТекста = ТекЭлемент.Значение;

	// Заполнение списка шрифтов
	Список = Элементы.КомандаFontName.СписокВыбора;
	Список.Добавить("Arial");
	Список.Добавить("Arial Black");
	Список.Добавить("Arial Narrow");
	Список.Добавить("Comic Sans MS");
	Список.Добавить("Courier New");
	Список.Добавить("System");
	Список.Добавить("Tahoma");
	Список.Добавить("Times New Roman");
	Список.Добавить("Verdana");
	Список.Добавить("Wingdings");
	ТекЭлемент = Список.НайтиПоИдентификатору(0);
    ИмяШрифта = ТекЭлемент.Значение;
	
	// Заполнение списка размеров
	Список = Элементы.КомандаFontSize.СписокВыбора;
	Для Ном = 1 По 14 Цикл
		Список.Добавить(Ном);
	КонецЦикла;
	ТекЭлемент = Список.НайтиПоИдентификатору(2);
	РазмерыШрифта = ТекЭлемент.Значение;
	
	// Заполнение списка выбора даты
	// Для примера будет показываться тек. дата
	ТекДата = ТекущаяДата();
	Список = Элементы.ПредставлениеДаты.СписокВыбора;
	Список.Добавить("{Дата ДФ=dd.MM.yyyy}", Формат(ТекДата, "ДФ=dd.MM.yyyy"));
	Список.Добавить("{Дата ДФ=dd.MM.yy}", 	Формат(ТекДата, "ДФ=dd.MM.yy"));
	Список.Добавить("{Дата ДЛФ=DD}", 		Формат(ТекДата, "ДЛФ=DD"));
	Список.Добавить("{Дата ДЛФ=DT}", 		Формат(ТекДата, "ДЛФ=DT"));
	Список.Добавить("{Дата ДЛФ=DDT}",		Формат(ТекДата, "ДЛФ=DDT"));
	Список.Добавить("{Дата ДФ=ММММ}",		"Название месяца");
	список.Добавить("{Дата ДФ=дддд}",		"День недели");
	Список.Добавить("{Дата ДЛФ=T}",			"Время");
	
	УстановитьАктивныйЭлементHTML();
	
КонецПроцедуры

&НаКлиенте    
// Процедура Перед записью.
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// ИмяТекущегоЭлемента = Элементы.ГруппаПриветствияПодписи.Заголовок;
	// Объект[ИмяТекущегоЭлемента] = Элементы[ИмяТекущегоЭлемента].Документ.Body.innerHTML
	
	Если Элементы.Приветствие.Документ <> Неопределено Тогда
		Объект.Приветствие 	= Элементы.Приветствие.Документ.Body.innerHTML;
	ИначеЕсли Элементы.Подпись.Документ <> Неопределено Тогда
		Объект.Подпись = Элементы.Подпись.Документ.Body.innerHTML;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик нажатия переключателя закладок.
//
Процедура ПроцедураОбработкиНажатияМеню(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ПроцедураОбработкиНажатияМеню(ЭтаФорма, Элемент.Имя);
	
	Если ВРег(Элемент.Имя) = ВРег("_ГруппаПодписи") Тогда		
		ГруппаПриветствияПодписиПриСменеСтраницы(Элементы.Подпись, "Подпись"); 
	ИначеЕсли ВРег(Элемент.Имя) = ВРег("_ГруппаПриветствия") Тогда        
		ГруппаПриветствияПодписиПриСменеСтраницы(Элементы.Приветствие, "Приветствие"); 		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
// Процедура Документ сформирован.
//
Процедура ТекстHTMLДокументСформирован(Элемент)
	
	Если Объект.Свойство(Элемент.Имя) Тогда	
		Если Элемент.Имя = "Приветствие" Тогда
			// Элемент.Документ.Body.innerHTML = "<html><body>" + Объект[Элемент.Имя] + "</body></html>";
			ПриветствиеHTML = "<html><body>" + Объект[Элемент.Имя] + "</body></html>";
		ИначеЕсли Элемент.Имя = "Подпись" Тогда
			ПодписьHTML = "<html><body>" + Объект[Элемент.Имя] + "</body></html>";
		КонецЕсли;
	КонецЕсли; 	                           
	
	Элемент.Документ.Body.scroll = "auto";
	Элемент.Документ.Body.contentEditable = "true";
	
КонецПроцедуры

&НаКлиенте   
// Процедура При нажатии на текст html.
//
Процедура ТекстHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Документ = Элемент.Документ;
	ПоказатьРежимыКнопок();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте 
// Процедура при смене страницы.
//
Процедура ГруппаПриветствияПодписиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	// Сохраняем текст HTML той страницы, с которой переключились
	ИмяАктивногоЭлемента = ТекущаяСтраница;
	Если ИмяАктивногоЭлемента = "Подпись" Тогда
		Объект.Приветствие = Элементы.Приветствие.Документ.Body.innerHTML;
	ИначеЕсли ИмяАктивногоЭлемента = "Приветствие" Тогда
		Объект.Подпись = Элементы.Подпись.Документ.Body.innerHTML;
	КонецЕсли;
	
	УстановитьАктивныйЭлементHTML();
	
	ТекстHTMLДокументСформирован(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте  
// Процедура выполнения команды.
//
Процедура ВыполнитьКоманду(Кнопка)
	
	Команда = Сред(Кнопка.Имя, 8);
	Если Документ.queryCommandSupported(Команда) Тогда
		Документ.execCommand(Команда, Ложь);
		ПоказатьРежимыКнопок();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
// Процедура Показать режимы кнопок.
//
Процедура ПоказатьРежимыКнопок()
	
	Для каждого Группа Из Элементы.КоманднаяПанельКнопок.ПодчиненныеЭлементы Цикл 
		Если ТипЗнч(Группа) = Тип("ГруппаФормы") Тогда
			Для каждого Кнопка Из Группа.ПодчиненныеЭлементы Цикл
				Если ТипЗнч(Кнопка) = тип("КнопкаФормы") Тогда
					Команда = Сред(Кнопка.Имя, 8);
					Если Документ.queryCommandSupported(Команда) Тогда
						Попытка
							Кнопка.Пометка = Документ.queryCommandState(Команда);
						Исключение
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте   
// Процедура выполнения команды списк.
//
Процедура ВыполнитьКомандуСписка(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Команда = Сред(Элемент.Имя, 8);
	Если Документ.queryCommandSupported(Команда) Тогда
		Список = Элемент.СписокВыбора;
		Документ.execCommand(Команда, Истина, ВыбранноеЗначение);
		ПоказатьРежимыКнопок();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте    
// Процедура Вставить гиперссылку.
//
Процедура ВставитьГиперссылку(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ВыборГиперссылки",,,,,,
	Новый ОписаниеОповещения("ВставитьГиперссылкуЗавершение", ЭтотОбъект), 
	РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После выбора гиперссылки
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВставитьГиперссылкуЗавершение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		Документ.execCommand("CreateLink", Ложь, РезультатВыбора);
		Модифицированность = Истина;
	КонецЕсли; 	

	ПоказатьРежимыКнопок();
	
КонецПроцедуры

&НаКлиенте  
// Процедура выбора цвета.
//
Процедура ВыборЦвета(Команда)
	
	ОткрытьФорму("Обработка.ВыборWebЦвета.Форма",,,,,,
	Новый ОписаниеОповещения("ВыборЦветаЗавершение", ЭтотОбъект, Команда), 
	РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После выбора Цвета
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВыборЦветаЗавершение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		Кнопка = Сред(ДополнительныеПараметры.Имя, 8);
		Если Документ.queryCommandSupported(Кнопка) Тогда
			Документ.execCommand(Кнопка, Ложь, "" + ПеревестиИз10(РезультатВыбора.Красный) + ПеревестиИз10(РезультатВыбора.Зеленый) + ПеревестиИз10(РезультатВыбора.Синий));
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли; 	

	ПоказатьРежимыКнопок();
	
КонецПроцедуры

&НаКлиенте 
// Процедура приведения.
//
Функция ПеревестиИз10(Знач Значение = 0)
	
	Значение = Число(Значение);
	Если Значение <= 0 Тогда
		Возврат "00";
	КонецЕсли;
	
	Значение = Цел(Значение);
	Результат = "";
	
	Пока Значение > 0 Цикл
		Результат = Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ",Значение%16+1,1) + Результат;
		Значение = Цел(Значение/16);
	КонецЦикла;
	
	Если СтрДлина(Результат) = 1 Тогда
		Результат = "0" + Результат;
	КонецЕсли; 
  
	Возврат Результат;
	
КонецФункции

&НаКлиенте   
// Процедура добавления адресата.
//
Процедура ВставитьПредставлениеАдресата(Команда)
	
	ВставитьТекстВПолеHTML(ВидПредставленияАдресата);
	
КонецПроцедуры

&НаКлиенте 
// Процедура вставляет дату.
//
Процедура ВставитьДату(Команда)
	
	ВставитьТекстВПолеHTML(ВидПредставленияДаты);
	
КонецПроцедуры

&НаКлиенте 
// Процедура вставляет текст в поле.
//
Процедура ВставитьТекстВПолеHTML(Текст)
	
	Если НЕ ЗначениеЗаполнено(Текст) Тогда
		Возврат;
	КонецЕсли;
		
	Если ИмяАктивногоЭлемента = "Приветствие" Тогда
		HTMLДокумент = Элементы.Приветствие.Документ;
	ИначеЕсли ИмяАктивногоЭлемента = "Подпись" Тогда 
		HTMLДокумент = Элементы.Подпись.Документ;
	КонецЕсли;
	
	Попытка
		Выделение = HTMLДокумент.selection.createRange();
		Выделение.pasteHTML(Текст);
	Исключение
		Выделение = HTMLДокумент.getSelection().getRangeAt(0);
		Если Выделение <> Неопределено Тогда
			Узел = Выделение.createContextualFragment(Текст);
			Выделение.insertNode(Узел);         
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте 
// Процедура устанавливает активный элемент.
//
Процедура УстановитьАктивныйЭлементHTML()
	
	ИмяАктивногоЭлемента = ?(Элементы.ГруппаПриветствия.Видимость = Истина, Элементы.ГруппаПриветствия.Заголовок, Элементы.ГруппаПодписи.Заголовок);
	
	ЭтаФорма.ТекущийЭлемент = Элементы[ИмяАктивногоЭлемента];
	Документ = Элементы[ИмяАктивногоЭлемента].Документ;
	
КонецПроцедуры

#КонецОбласти