
 #Область ОбработчикиСобытийФормы
 
 // Процедура, обработчик события "ПриСозданииНаСервере"
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	ЮрЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
		
	Если Объект.ЮрФизЛицо = ЮрЛицо Тогда
		Элементы.КПП.Видимость = Истина;
		Элементы.ОГРН.Заголовок = "ОГРН";
	Иначе
		Элементы.КПП.Видимость = Ложь;
		Объект  .КПП           = "";
		Элементы.ОГРН.Заголовок = "ОГРНИП"; 
	КонецЕсли;
	
	//// Обработчик подсистемы "Контактная информация"
	// УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтаФорма, Объект, "ГруппаКонтактнаяИнформация");
	
	// Контактная информация
	КонтактнаяИнформацияСервер.ПриСозданииПриЧтенииНаСервере(ЭтаФорма, Объект);
	
	// Обработчик механизма "Свойства".
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, Объект, "СтраницаДополнительныеРеквизиты");	

	УстановитьВидимостьЭлементов();
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
	ЗаполнитьПараметрыВыбораОрганизации();
	
	
КонецПроцедуры

// Процедура, обработчик события "ОбработкаОповещения"
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Обработчик механизма "Свойства".
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьДополнительныеРеквизиты();
	КонецЕсли;
	
КонецПроцедуры

// Процедура, обработчик события "ПередЗаписьюНаСервере"
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект)
	
	//// Обработчик подсистемы "Контактная информация"
	// УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, Отказ);
	
	// КонтактнаяИнформация
	КонтактнаяИнформацияСервер.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец КонтактнаяИнформация

	// Обработчик механизма "Свойства".
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// ЗаписьВРегистрОтветственныеЛица
	ОтветственныеЛица(ТекущийОбъект);
КонецПроцедуры

 #КонецОбласти
 
 #Область ОбработчикиСобытийЭлементовШапкиФормы
 
 &НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура КПППриИзменении(Элемент)
	
	ЗаполнитьПараметрыВыбораОрганизации();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ИННПриИзменении(Элемент)
	
	ЗаполнитьПараметрыВыбораОрганизации();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ГоловнаяОрганизацияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ГоловнаяОрганизация) Тогда		
		Объект.ЭтоГоловнаяОрганизация = Ложь;
	КонецЕсли;
	
	Элементы.ЭтоГоловнаяОрганизация.ТолькоПросмотр = ЗначениеЗаполнено(Объект.ГоловнаяОрганизация);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ЭтоГоловнаяОрганизацияПриИзменении(Элемент)
	
	Если Объект.ЭтоГоловнаяОрганизация = Истина Тогда
		
		СуществующаяОрганизация = ПолучитьГоловнуюОрганизацию(Объект.ИНН);
		Если ЗначениеЗаполнено(СуществующаяОрганизация) Тогда
			ПоказатьПредупреждение(, "Уже существует головная организация с таким ИНН.");
			Объект.ЭтоГоловнаяОрганизация = Ложь;	
		КонецЕсли;
		
	Иначе
		
		Если Объект.Ссылка.Пустая() = Ложь Тогда
			МассивПодчиненныхОрганизаций = ПолучитьПодчиненныеГоловнойОрганизации(Объект.Ссылка);	
			Если МассивПодчиненныхОрганизаций.Количество() > 0 Тогда			
				ПоказатьПредупреждение(, "Эта организация является головной для других организаций.");
				Объект.ЭтоГоловнаяОрганизация = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ГоловнаяОрганизация.ТолькоПросмотр = Объект.ЭтоГоловнаяОрганизация = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Сотрудник начало выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеВыбора		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения   = Новый ОписаниеОповещения("СотрудникНачалоВыбораЗавершение", 
													ЭтаФорма, 
													Новый Структура("Сотрудник, Должность",Элемент.Имя, СтрЗаменить(Элемент.Имя, "ФИО", "Должность")));	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", 
				 Новый Структура("БезОтбораПоРолям, ОтбиратьВрачей, ОтбиратьПоСтруктурнойЕдинице", Истина, Истина, Ложь),,,,,
				 ОписаниеОповещения, 
				 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте 
// Процедура - ФИОКассира обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ФИОКассираОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЭтаФорма.Объект.ДолжностьКассира = ПолучитьДолжность(ВыбранноеЗначение);
КонецПроцедуры 

&НаКлиенте
// Процедура - ФИОГлавного бухгалтера обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ФИОГлавногоБухгалтераОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЭтаФорма.Объект.ДолжностьГлавногоБухгалтера =  ПолучитьДолжность(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
// Процедура - ФИОКладовщика обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ФИОКладовщикаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЭтаФорма.Объект.ДолжностьКладовщика =  ПолучитьДолжность(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте 
// Процедура - ФИОРуководителя обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ФИОРуководителяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЭтаФорма.Объект.ДолжностьРуководителя =  ПолучитьДолжность(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура СистемаНалогообложенияПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

// Процедура, обработчик события "ПриИзменении" поле ввода "ЮрФизЛицо"
//
&НаКлиенте
Процедура ЮрФизЛицоПриИзменении(Элемент)
	
	УстановитьВидимостьРеквизитов();
	
КонецПроцедуры

// Процедура, обработчик события "ПриИзменении" поле ввода "Наименование"
//
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПолноеНаименование) Тогда
		Объект.ПолноеНаименование = Объект.Наименование;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
 
#Область ОбработчикиКомандФормы

// Процедура - Редактировать состав свойств
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура РедактироватьСоставСвойств(Команда)
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);

КонецПроцедуры

#КонецОбласти
 
#Область СлужебныеПроцедурыИФункции
 
&НаКлиенте
// Процедура - Сотрудник начало выбора завершение
//
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
//
Процедура СотрудникНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда 
		
		Объект[Параметры.Сотрудник] = Результат;
		Объект[Параметры.Должность] = ПолучитьДолжность(Результат);  

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОтветственныеЛица(ТекущийОбъект)
	// запись в регистр ответственные лица
	ТекОбъект = ЭтаФорма.Объект;
	// руководитель
	Если (ЗначениеЗаполнено(ТекОбъект.ФИОРуководителя)) и (ЗначениеЗаполнено(ТекОбъект.ДолжностьРуководителя)) Тогда
		
		НаборЗаписей = РегистрыСведений.ОтветственныеЛица.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТипОтветственногоЛица.Установить(Перечисления.ТипыОтветственныхЛиц.Руководитель);
		Запись = НаборЗаписей.Добавить();
		Запись.Период =  ТекущаяДата();
		Запись.Организация   = ТекущийОбъект.Ссылка;
		Запись.ТипОтветственногоЛица = Перечисления.ТипыОтветственныхЛиц.Руководитель;
		Запись.Сотрудник = ТекОбъект.ФИОРуководителя;  
		Запись.Должность = ТекОбъект.ДолжностьРуководителя;
		Если ПроверкаСуществованияЗаписи(ТекущийОбъект, Перечисления.ТипыОтветственныхЛиц.Руководитель) Тогда
			НаборЗаписей.Записать(); 
		Иначе
			НаборЗаписей.Записать(Ложь); 
		КонецЕсли;
	ИначеЕсли (ЗначениеЗаполнено(ТекОбъект.ФИОРуководителя)) и (не ЗначениеЗаполнено(ТекОбъект.ДолжностьРуководителя)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить должность руководителя");
	ИначеЕсли (не ЗначениеЗаполнено(ТекОбъект.ФИОРуководителя)) и (ЗначениеЗаполнено(ТекОбъект.ДолжностьРуководителя)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить ФИО руководителя");
	КонецЕсли;
	// гл бух
	Если (ЗначениеЗаполнено(ТекОбъект.ФИОГлавногоБухгалтера)) и (ЗначениеЗаполнено(ТекОбъект.ДолжностьГлавногоБухгалтера)) Тогда
		НаборЗаписей = РегистрыСведений.ОтветственныеЛица.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТипОтветственногоЛица.Установить(Перечисления.ТипыОтветственныхЛиц.ГлавныйБухгалтер);
		Запись = НаборЗаписей.Добавить();
		Запись.Период =  ТекущаяДата();
		Запись.Организация   = ТекущийОбъект.Ссылка;
		Запись.ТипОтветственногоЛица = Перечисления.ТипыОтветственныхЛиц.ГлавныйБухгалтер;
		Запись.Сотрудник = ТекОбъект.ФИОГлавногоБухгалтера;  
		Запись.Должность = ТекОбъект.ДолжностьГлавногоБухгалтера;
		Если ПроверкаСуществованияЗаписи(ТекущийОбъект, Перечисления.ТипыОтветственныхЛиц.ГлавныйБухгалтер) Тогда
			НаборЗаписей.Записать();
		Иначе
			НаборЗаписей.Записать(Ложь);
		КонецЕсли;
	ИначеЕсли (ЗначениеЗаполнено(ТекОбъект.ФИОГлавногоБухгалтера)) и (не ЗначениеЗаполнено(ТекОбъект.ДолжностьГлавногоБухгалтера)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить должность главного бухгалтера");
	ИначеЕсли (не ЗначениеЗаполнено(ТекОбъект.ФИОГлавногоБухгалтера)) и (ЗначениеЗаполнено(ТекОбъект.ДолжностьГлавногоБухгалтера)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить ФИО главного бухгалтера");
	КонецЕсли;
	// кассир
	Если (ЗначениеЗаполнено(ТекОбъект.ФИОКассира)) и (ЗначениеЗаполнено(ТекОбъект.ДолжностьКассира)) Тогда
		НаборЗаписей = РегистрыСведений.ОтветственныеЛица.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТипОтветственногоЛица.Установить(Перечисления.ТипыОтветственныхЛиц.Кассир);
		Запись = НаборЗаписей.Добавить();
		Запись.Период =  ТекущаяДата();
		Запись.Организация   = ТекущийОбъект.Ссылка;
		Запись.ТипОтветственногоЛица = Перечисления.ТипыОтветственныхЛиц.Кассир;
		Запись.Сотрудник = ТекОбъект.ФИОКассира;  
		Запись.Должность = ТекОбъект.ДолжностьКассира;
		Если ПроверкаСуществованияЗаписи(ТекущийОбъект, Перечисления.ТипыОтветственныхЛиц.Кассир) Тогда
			НаборЗаписей.Записать();
		Иначе
			НаборЗаписей.Записать(Ложь);
		КонецЕсли;
		
	ИначеЕсли (ЗначениеЗаполнено(ТекОбъект.ФИОКассира)) и (не ЗначениеЗаполнено(ТекОбъект.ДолжностьКассира)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить должность кассира");
	ИначеЕсли (не ЗначениеЗаполнено(ТекОбъект.ФИОКассира)) и (ЗначениеЗаполнено(ТекОбъект.ДолжностьКассира)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить ФИО кассира");
	КонецЕсли;
	// кладовщик
	Если (ЗначениеЗаполнено(ТекОбъект.ФИОКладовщика)) и (ЗначениеЗаполнено(ТекОбъект.ДолжностьКладовщика)) Тогда
		НаборЗаписей = РегистрыСведений.ОтветственныеЛица.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТипОтветственногоЛица.Установить(Перечисления.ТипыОтветственныхЛиц.Кладовщик);
		Запись = НаборЗаписей.Добавить();
		Запись.Период =  ТекущаяДата();
		Запись.Организация   = ТекущийОбъект.Ссылка;
		Запись.ТипОтветственногоЛица = Перечисления.ТипыОтветственныхЛиц.Кладовщик;
		Запись.Сотрудник = ТекОбъект.ФИОКладовщика;  
		Запись.Должность = ТекОбъект.ДолжностьКладовщика;
		Если ПроверкаСуществованияЗаписи(ТекущийОбъект, Перечисления.ТипыОтветственныхЛиц.Кладовщик) Тогда
			НаборЗаписей.Записать(); 
		Иначе
			НаборЗаписей.Записать(Ложь);
		КонецЕсли;
	ИначеЕсли (ЗначениеЗаполнено(ТекОбъект.ФИОКладовщика)) и (не ЗначениеЗаполнено(ТекОбъект.ДолжностьКладовщика)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить должность кладовщика");
	ИначеЕсли (не ЗначениеЗаполнено(ТекОбъект.ФИОКладовщика)) и (ЗначениеЗаполнено(ТекОбъект.ДолжностьКладовщика)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить ФИО кладовщика");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверкаСуществованияЗаписи(Организация, ТипыОтветственныхЛиц)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	               |	ОтветственныеЛицаСрезПоследних.Период,
	               |	ОтветственныеЛицаСрезПоследних.Организация,
	               |	ОтветственныеЛицаСрезПоследних.ТипОтветственногоЛица
	               |ИЗ
	               |	РегистрСведений.ОтветственныеЛица.СрезПоследних(&Дата, ) КАК ОтветственныеЛицаСрезПоследних
	               |ГДЕ
	               |	ОтветственныеЛицаСрезПоследних.ТипОтветственногоЛица = &ТипОтветственногоЛица
	               |	И ОтветственныеЛицаСрезПоследних.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("ТипОтветственногоЛица", ТипыОтветственныхЛиц);
    Запрос.УстановитьПараметр("Организация", Организация.Ссылка);

	Результат = Запрос.Выполнить();
	Если   Результат.Пустой() Тогда 
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции


&НаСервере
// Процедура, обновляет элементы дополнительных реквизитов.
//
Процедура ОбновитьДополнительныеРеквизиты()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры // ОбновитьЭлементыДополнительныхРеквизитов()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "КОНТАКТНАЯ ИНФОРМАЦИЯ"

// Процедура, обработчик события "ПриИзменении" поля ввода "КонтактнаяИнформация".
// Процедура назначается динамически действию элемента формы поле ввода
//
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	
	УправлениеКонтактнойИнформациейКлиент.ПредставлениеПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

// Процедура, обработчик события "НачалоВыбора" поля ввода "КонтактнаяИнформация".
// Процедура назначается динамически действию элемента формы поле ввода
//
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
	
КонецПроцедуры

// Процедура, обработчик события "НачалоВыбора"
//
&НаКлиенте
Процедура БанковскийСчетПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Элемент справочника еще не записан.'");
		Сообщение.Сообщить();
	Иначе	
	
		ОткрытьФорму("Справочник.БанковскиеСчета.ФормаВыбора",
		Новый Структура("Владелец", Объект.Ссылка),,,,,
		Новый ОписаниеОповещения("БанковскийСчетПоУмолчаниюНачалоВыбораЗавершение", ЭтотОбъект), 
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - После выбора банковского счета
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура БанковскийСчетПоУмолчаниюНачалоВыбораЗавершение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда
		Объект.БанковскийСчетПоУмолчанию = РезультатВыбора;
		Модифицированность = Истина;
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик события Выполнить команды РедактироватьСоставСвойств.
//
Процедура Подключаемый_СвойстваВыполнитьКоманду(Команда)
	
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры // РедактироватьСоставСвойств()

&НаКлиенте
// Процедура устанавливает видимость реквизитов формы.
//
// Параметры:
//  Нет.
//
Процедура УстановитьВидимостьРеквизитов()
	
	Если Объект.ЮрФизЛицо 			 = ЮрЛицо Тогда
		Элементы.КПП.Видимость 		 = Истина;
		Элементы.ОГРН.Заголовок      = "ОГРН";
		Элементы.ИНН.ПодсказкаВвода  = "10 цифр";
		Элементы.ОГРН.ПодсказкаВвода = "13 цифр";
		Элементы.ОКПО.ПодсказкаВвода = "8 цифр";
	Иначе
		Элементы.КПП.Видимость 		 = Ложь;
		Объект.КПП 					 = "";
		Элементы.ОГРН.Заголовок      = "ОГРНИП";
		Элементы.ИНН.ПодсказкаВвода  = "12 цифр";
		Элементы.ОГРН.ПодсказкаВвода = "15 цифр";
		Элементы.ОКПО.ПодсказкаВвода = "10 цифр";
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьРеквизитов()
 
&НаСервере
Функция  ПолучитьДолжность(ВыбранноеЗначение)
	Возврат  ВыбранноеЗначение.Должность;  
КонецФункции

&НаСервере
// Процедура, устанавливает видимость элементов.
//
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.ОбъектНалогообложения.Видимость = Объект.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная;
	Элементы.ЭтоГоловнаяОрганизация.ТолькоПросмотр = ЗначениеЗаполнено(Объект.ГоловнаяОрганизация);
	Элементы.ГоловнаяОрганизация.ТолькоПросмотр = Объект.ЭтоГоловнаяОрганизация = Истина;
	
КонецПроцедуры


#Область КОНТАКТНАЯ_ИНФОРМАЦИЯ

&НаКлиенте
// Процедура - Добавить контактную информацию.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ДобавитьКонтактнуюИнформацию(Команда)

	КонтактнаяИнформацияКлиент.ДобавитьКонтактнуюИнформациюНажатие(ЭтаФорма, Элементы.КнопкаДобавитьКонтактнуюИнформацию);
	
КонецПроцедуры

&НаСервере
// Процедура - Добавить контактную информацию сервер.
//
// Параметры:
//  ДобавляемыйВид				 - 	 - 
//  УстановитьВыводВФормеВсегда	 - 	 - 
//
Процедура ДобавитьКонтактнуюИнформациюСервер(ДобавляемыйВид, УстановитьВыводВФормеВсегда = Ложь) Экспорт
	
	КонтактнаяИнформацияСервер.ДобавитьКонтактнуюИнформацию(ЭтаФорма, Объект, ДобавляемыйВид, УстановитьВыводВФормеВсегда);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый действие КИНажатие.
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ДействиеКИНажатие(Элемент)
	
	КонтактнаяИнформацияКлиент.ДействиеКИНажатие(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый представление КИПри изменении.
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ПредставлениеКИПриИзменении(Элемент)
	
	КонтактнаяИнформацияКлиент.ПредставлениеКИПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый представление КИНачало выбора.
//
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеВыбора		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура Подключаемый_ПредставлениеКИНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	КонтактнаяИнформацияКлиент.ПредставлениеКИНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый представление КИОчистка.
//
// Параметры:
//  Элемент				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура Подключаемый_ПредставлениеКИОчистка(Элемент, СтандартнаяОбработка)
	
	КонтактнаяИнформацияКлиент.ПредставлениеКИОчистка(ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый комментарий КИПри изменении.
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_КомментарийКИПриИзменении(Элемент)
	
	КонтактнаяИнформацияКлиент.КомментарийКИПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый контактная информация выполнить команду.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Подключаемый_КонтактнаяИнформация_ВыполнитьКоманду(Команда)
	
	КонтактнаяИнформацияКлиент.ВыполнитьКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
// Процедура, заполнить параметры выбора организации.
//
Процедура ЗаполнитьПараметрыВыбораОрганизации()
	
	Если Объект.ЭтоГоловнаяОрганизация = Истина Тогда		
		Возврат;
	КонецЕсли;
	
	МассивОрганизаций = Новый Массив();
	
	Если ЗначениеЗаполнено(Объект.ИНН) Тогда
		
		ГоловнаяОрганизация = ПолучитьГоловнуюОрганизацию(Объект.ИНН);
		Если ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
			
			Если ГоловнаяОрганизация.КПП = Объект.КПП Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'У организации и головной организация совпадает КПП ("+ (Объект.КПП)+"). Введите другое значение.'")); 
				Объект.КПП = "";           			
			Иначе
				МассивОрганизаций = Новый Массив();
				МассивОрганизаций.Добавить(ГоловнаяОрганизация);
			КонецЕсли;
			
		Иначе
			
			// Алгоритм когда еще не существует головной организации, можно любую сделать таковой.
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Организации.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	&УсловиеОтборов
			|	И Организации.ПометкаУдаления = ЛОЖЬ
			|	И Организации.ЭтоГруппа = ЛОЖЬ";
			
			Если Объект.Ссылка.Пустая() Тогда
				
				Если ЗначениеЗаполнено(Объект.КПП)
					И ЗначениеЗаполнено(Объект.ИНН) Тогда
					УсловиеОтборов = "Организации.КПП <> &КПП И Организации.ИНН = &ИНН";	
				Иначе
					УсловиеОтборов = "ЛОЖЬ";
				КонецЕсли;
				
			Иначе
				
				Если ЗначениеЗаполнено(Объект.КПП)
					И ЗначениеЗаполнено(Объект.ИНН) Тогда
					УсловиеОтборов = "Организации.Ссылка <> &Ссылка 
					|	И Организации.КПП <> &КПП 
					|	И Организации.ИНН = &ИНН";
				Иначе
					УсловиеОтборов = "ЛОЖЬ";
				КонецЕсли;
				
			КонецЕсли; 
			
			Если УсловиеОтборов = "ЛОЖЬ" Тогда
				МассивОрганизаций = Новый Массив();
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтборов", УсловиеОтборов); 
				Запрос.УстановитьПараметр("Ссылка"	, Объект.Ссылка);
				Запрос.УстановитьПараметр("КПП"		, Объект.КПП);
				Запрос.УстановитьПараметр("ИНН"		, Объект.ИНН);
				МассивОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
		
	ФиксированныйМассив = Новый ФиксированныйМассив(МассивОрганизаций);
	ПараметрыОтбора = Новый ПараметрВыбора("Отбор.Ссылка", ФиксированныйМассив);
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(ПараметрыОтбора);
	
	ФиксированныйМассив = Новый ФиксированныйМассив(НовыйМассив); 
	Элементы.ГоловнаяОрганизация.ПараметрыВыбора = ФиксированныйМассив;	
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, получает подчиненные головной организации.
//
Функция ПолучитьПодчиненныеГоловнойОрганизации(ГоловнаяОрганизация)
	
	Возврат Справочники.Организации.ПолучитьПодчиненныеГоловнойОрганизации(ГоловнаяОрганизация);
	
КонецФункции

&НаСервереБезКонтекста
// Процедура, получает подчиненные головной организации.
//
Функция ПолучитьГоловнуюОрганизацию(ИНН)
	
	Возврат Справочники.Организации.ПолучитьГоловнуюОрганизацию(ИНН);
	
КонецФункции

#КонецОбласти
 
 

