#Область  ОписаниеПеременных

&НаКлиенте
Перем ЗаданВопрос;
	
#КонецОбласти

#Область СобытияФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере"
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ПроверитьНарушенностьВложений() И НЕ ЗаданВопрос Тогда
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект), "Изменить структурную единицу для всех подчиненных элементов?", РежимДиалогаВопрос.ДаНет);
	Иначе
	    ЗаданВопрос = Ложь; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ИсправитьНарушенностьВложений();
		ЗаданВопрос = Истина;
		ЭтаФорма.Записать();
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИсправитьНарушенностьВложений()
	
	Возврат Справочники.Помещения.ПроверитьИИсправитьНарушенностьВложений(Объект, Истина);
		
КонецФункции

&НаСервере
Функция ПроверитьНарушенностьВложений()
	
	Возврат Справочники.Помещения.ПроверитьИИсправитьНарушенностьВложений(Объект, Ложь);
		
КонецФункции
