
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФлагИспользования = Параметры.ФлагИспользования;
	ФлагИспользованияПредыдущий = ФлагИспользования;
	
	// ВАРИАНТЫ НАСТРОЙКИ РАСПИСАНИЯ ВЫПОЛНЕНИЯ ОБМЕНА
	
	МенеджерПланаОбмена = ОбменДаннымиПовтИсп.ПолучитьМенеджерПланаОбмена(Параметры.УзелИнформационнойБазы);
	
	ВариантыНастройкиРасписанияПользовательские = МенеджерПланаОбмена.ВариантыНастройкиРасписания();
	
	СписокВыбора = Элементы.РасписаниеРегламентногоЗаданияСтрокой.СписокВыбора;
	
	СписокВыбора.Добавить(ЗначениеВСтрокуВнутр(Новый РасписаниеРегламентногоЗадания), НСтр("ru = 'Не задано'"));
	
	Для Каждого ВариантНастройки ИЗ ВариантыНастройкиРасписанияПользовательские Цикл
		
		СписокВыбора.Добавить(ЗначениеВСтрокуВнутр(ВариантНастройки.Значение), ВариантНастройки.Представление);
		
	КонецЦикла;
	
	РасписаниеРегламентногоЗадания = Справочники.СценарииОбменовДанными.ПолучитьРасписаниеВыполненияОбменаДанными(Параметры.Ключ);
	
	РасписаниеРегламентногоЗаданияСтрокой = ЗначениеВСтрокуВнутр(РасписаниеРегламентногоЗадания);
	
	Если СписокВыбора.НайтиПоЗначению(РасписаниеРегламентногоЗаданияСтрокой) = Неопределено Тогда
		
		СписокВыбора.Добавить(РасписаниеРегламентногоЗаданияСтрокой, Строка(РасписаниеРегламентногоЗадания));
		
	КонецЕсли;
	
	// доступность элементов
	Элементы.ЭлементыРасписания.Доступность = Объект.ИспользоватьРегламентноеЗадание;
	
	// заголовок формы
	Заголовок = НСтр("ru = 'Настройка расписания для: [УзелИнформационнойБазы]'");
	Заголовок = СтрЗаменить(Заголовок, "[УзелИнформационнойБазы]", Строка(Параметры.УзелИнформационнойБазы));
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);

КонецПроцедуры

// Процедура - При чтении на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);

КонецПроцедуры

// Процедура - После записи на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);

КонецПроцедуры



&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Справочники.СценарииОбменовДанными.ОбновитьДанныеРегламентногоЗадания(Отказ, ЗначениеИзСтрокиВнутр(РасписаниеРегламентногоЗаданияСтрокой), ТекущийОбъект);
	
	ФлагИспользованияИзменен = (ФлагИспользования <> ФлагИспользованияПредыдущий);
	
	ФлагИспользованияПредыдущий = ФлагИспользования;
	
	ЭтоНовый = (Объект.Ссылка.Пустая());
	
	Если ФлагИспользованияИзменен ИЛИ ЭтоНовый Тогда
		
		Если ФлагИспользования Тогда
			
			Справочники.СценарииОбменовДанными.ДобавитьВыгрузкуВСценарииОбменаДанными(ТекущийОбъект, Параметры.УзелИнформационнойБазы);
			Справочники.СценарииОбменовДанными.ДобавитьЗагрузкуВСценарииОбменаДанными(ТекущийОбъект, Параметры.УзелИнформационнойБазы);
		Иначе
			
			Справочники.СценарииОбменовДанными.УдалитьВыгрузкуВСценарииОбменаДанными(ТекущийОбъект, Параметры.УзелИнформационнойБазы);
			Справочники.СценарииОбменовДанными.УдалитьЗагрузкуВСценарииОбменаДанными(ТекущийОбъект, Параметры.УзелИнформационнойБазы);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписанСценарийОбменаДанными");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура РасписаниеРегламентногоЗаданияСтрокойПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРегламентноеЗаданиеПриИзменении(Элемент)
	
	Элементы.ЭлементыРасписания.Доступность = Объект.ИспользоватьРегламентноеЗадание;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьРасписание(Команда)
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания(РасписаниеРегламентногоЗаданияСтрокой));
	
	// открываем диалог для редактирования Расписания
	Диалог.Показать(Новый ОписаниеОповещения("ИзменитьРасписаниеЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог)));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИзменитьРасписаниеЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	
	Если Расписание Тогда
		
		ОбновитьСписокВыбораРасписанияРегламентногоЗадания(Диалог.Расписание);
		
		Модифицированность = Истина;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВыбораРасписанияРегламентногоЗадания(Знач Расписание)
	
	РасписаниеРегламентногоЗаданияСтрокой = ЗначениеВСтрокуВнутр(Расписание);
	
	СписокВыбора = Элементы.РасписаниеРегламентногоЗаданияСтрокой.СписокВыбора;
	
	Если СписокВыбора.НайтиПоЗначению(РасписаниеРегламентногоЗаданияСтрокой) = Неопределено Тогда
		
		СписокВыбора.Добавить(РасписаниеРегламентногоЗаданияСтрокой, Строка(Расписание));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РасписаниеРегламентногоЗадания(РасписаниеРегламентногоЗаданияСтрокой)
	
	Возврат ЗначениеИзСтрокиВнутр(РасписаниеРегламентногоЗаданияСтрокой);
	
КонецФункции

#КонецОбласти
