
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Актуализировать статусы всех пациентов
//
// Параметры:
//  ОповещатьОХодеВыполнения - 	 - 
//
Процедура АктуализироватьСтатусыВсехПациентов(ОповещатьОХодеВыполнения = Ложь) Экспорт
	
	// Используется для регламентного задания "АктуализацияСтатусовПациентов"
	
	Если НЕ ПривилегированныйРежим() Тогда 															
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	

	Если ОповещатьОХодеВыполнения Тогда 
		ДатаНачалаПроцесса = ТекущаяДатаСеанса();
		ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru='Актуализация статусов пациентов...';en='Updating customer statuses...'"), Новый Структура("ПредставлениеОбъекта, ОсталосьВремениВСекундах, ПредставлениеОставшегосяВремени, СозданоОбъектов", "Получение данных...", 0, "", 0));
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Контрагенты.Ссылка) КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления
		|	И НЕ Контрагенты.ЭтоГруппа
		|	И Контрагенты.ТипКонтрагента В (ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты), ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.ПустаяСсылка))";
		ВыборкаОбщегоКоличества = Запрос.Выполнить().Выбрать();
		Если ВыборкаОбщегоКоличества.Следующий() Тогда 
			ВсегоКлиентов = ВыборкаОбщегоКоличества.Ссылка;
		Иначе 
			ВсегоКлиентов = 0;	
		КонецЕсли;
		ВсегоКлиентов 			= ?(ВсегоКлиентов < 1, 1, ВсегоКлиентов);
		Счетчик 				= 0;
		ОсталосьВремени 		= Неопределено;				
	КонецЕсли;
	
	ТаблицаУстановленныхСтатусов 	= Неопределено;
	ТаблицаОбработанныхКонтрагентов = Новый ТаблицаЗначений;
	ТаблицаОбработанныхКонтрагентов.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	
	МетаданныеРегистра 				= Метаданные.РегистрыСведений.СтатусыКонтрагентов;
	ПредставлениеРегистра 			= МетаданныеРегистра.Представление();
	
	ВидСделкиНовыйПациент 			= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты");
	ВидСделкиПостоянныйПациент		= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.ПостоянныеПациенты");
	
	Пока ИСТИНА Цикл 
		ЗапросПорции = Новый Запрос;                          
		ЗапросПорции.МенеджерВременныхТаблиц = УправлениеЗапасамиПартионныйУчет.ВыбратьТЗВВременнуюТаблицу(ТаблицаОбработанныхКонтрагентов, "ТаблицаОбработанныхКонтрагентов");
		ЗапросПорции.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 300
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОбработанныхКонтрагентов КАК ТаблицаОбработанныхКонтрагентов
		|		ПО Контрагенты.Ссылка = ТаблицаОбработанныхКонтрагентов.Контрагент
		|ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления
		|	И НЕ Контрагенты.ЭтоГруппа
		|	И Контрагенты.ТипКонтрагента В (ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты), ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.ПустаяСсылка))
		|	И ТаблицаОбработанныхКонтрагентов.Контрагент ЕСТЬ NULL";
	
		РезультатЗапроса = ЗапросПорции.Выполнить();
		ВсеОбработано = РезультатЗапроса.Пустой();
		Если ВсеОбработано Тогда
			ЗапросПорции.МенеджерВременныхТаблиц.Закрыть();
			Прервать;
		КонецЕсли;	
		ТаблицаКонтрагентовДляОбработки = РезультатЗапроса.Выгрузить();
	    ЗапросПорции.МенеджерВременныхТаблиц.Закрыть();
	   	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаКонтрагентовДляОбработки, ТаблицаОбработанныхКонтрагентов);
		
		// Получаем актуальные статусы порции пациентов
		ЗапросАктальныхСтатусов 		= Новый Запрос;
		ЗапросАктальныхСтатусов.Текст 	= ПолучитьТекстЗапросаАктуализацииСтатусовПациентов();
		ЗапросАктальныхСтатусов.МенеджерВременныхТаблиц = УправлениеЗапасамиПартионныйУчет.ВыбратьТЗВВременнуюТаблицу(ТаблицаКонтрагентовДляОбработки, "ТаблицаКонтрагентовДляОбработки");
		
		ЗапросАктальныхСтатусов.УстановитьПараметр("ТекущаяДата"				, КонецДня(ТекущаяДатаСеанса()));
		ЗапросАктальныхСтатусов.УстановитьПараметр("ГраницаПериодаНеактивности"	, НачалоДня(ТекущаяДатаСеанса()) - ((Константы.ПериодПоискаНеВернувшихсяКлиентов.Получить() + 1) * 60*60*24));
		ЗапросАктальныхСтатусов.УстановитьПараметр("ДнейОтсутствия"				, Константы.ПериодПоискаНеВернувшихсяКлиентов.Получить() + 1);
		ЗапросАктальныхСтатусов.УстановитьПараметр("ВидСделкиНовыйПациент"		, ВидСделкиНовыйПациент);
		ЗапросАктальныхСтатусов.УстановитьПараметр("ВидСделкиПостоянныйПациент"	, ВидСделкиПостоянныйПациент);
		
		ТаблицаАктуальныхСтатусовПациентов = ЗапросАктальныхСтатусов.Выполнить().Выгрузить();
		ЗапросАктальныхСтатусов.МенеджерВременныхТаблиц.Закрыть();
		
		//Если ТаблицаУстановленныхСтатусов = Неопределено Тогда  
		//	ТаблицаУстановленныхСтатусов = ТаблицаАктуальныхСтатусовПациентов.СкопироватьКолонки();
		//КонецЕсли;
		
		Если НЕ ТаблицаАктуальныхСтатусовПациентов.Количество() = 0 Тогда 
			ТаблицаПациентов 	= ТаблицаАктуальныхСтатусовПациентов.Скопировать(, "Контрагент");
			ТаблицаПациентов.Свернуть("Контрагент");
			// Получаем набор текущих статусов пациента для анализа
			ЗапросТекущихСтатусов 							= Новый Запрос;			
			ЗапросТекущихСтатусов.Текст 					= ПолучитьТекстЗапросаТекущихСтатусов(Истина);
			ЗапросТекущихСтатусов.МенеджерВременныхТаблиц 	= УправлениеЗапасамиПартионныйУчет.ВыбратьТЗВВременнуюТаблицу(ТаблицаКонтрагентовДляОбработки, "ТаблицаКонтрагентов");			
			ТаблицаТекущихСтатусовПациента 					= ЗапросТекущихСтатусов.Выполнить().Выгрузить();
			ЗапросТекущихСтатусов.МенеджерВременныхТаблиц.Закрыть();
			// Актуализируем статусы пациента
			Для Каждого СтрокаПациент Из ТаблицаПациентов Цикл
				Если ОповещатьОХодеВыполнения Тогда 
					Счетчик = Счетчик + 1;
					Прогресс = Цел(100 * Счетчик / ВсегоКлиентов);
					ОсталосьВремени 				= ОбщегоНазначенияКлиентСерверСтоматология.ПолучитьОстатокВремениВыполненияПроцессаВСекундах(Прогресс, ДатаНачалаПроцесса, ТекущаяДатаСеанса(), ОсталосьВремени);
					ПредставлениеОставшегосяВремени = ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПредставлениеВремени(ОсталосьВремени);
					ДлительныеОперации.СообщитьПрогресс(Прогресс, НСтр("ru='Актуализация статусов пациентов...';en='Updating customer statuses...'"), Новый Структура("ПредставлениеОбъекта, ОсталосьВремениВСекундах, ПредставлениеОставшегосяВремени", " Осталось: " + ПредставлениеОставшегосяВремени, ОсталосьВремени, ПредставлениеОставшегосяВремени));		
				КонецЕсли;	
				
				КоллекцияСтрок 						= ТаблицаАктуальныхСтатусовПациентов.НайтиСтроки(Новый Структура("Контрагент", СтрокаПациент.Контрагент));
				Если КоллекцияСтрок.Количество() = 0 Тогда 
					Продолжить;
				Иначе 
					СтрокаАктуальныйСтатусПациента 	= КоллекцияСтрок[0];
				КонецЕсли;	
				МассивТекущихСтатусовПациента 		= ТаблицаТекущихСтатусовПациента.НайтиСтроки(Новый Структура("Контрагент", СтрокаПациент.Контрагент));
				ПериодУстановкиАктуальногоСтатуса 	= СтрокаАктуальныйСтатусПациента.Период;
				СтруктураПоследнейЗаписи 			= Новый Структура("Период, Контрагент, Статус");		
				Для Каждого ЭлементМассива Из МассивТекущихСтатусовПациента Цикл
					Если НЕ ЗначениеЗаполнено(ЭлементМассива.Статус) Тогда 
						// Удалим неактуальный статус
						УдалитьСтатусКлиента(ЭлементМассива);
						Продолжить;
					КонецЕсли;	
					Если НЕ ЗначениеЗаполнено(СтрокаАктуальныйСтатусПациента.Период) Тогда 
						ПериодУстановкиАктуальногоСтатуса = ЭлементМассива.Период;
					КонецЕсли;				
					Если ЭлементМассива.Период < СтрокаАктуальныйСтатусПациента.Период Тогда
						ЗаполнитьЗначенияСвойств(СтруктураПоследнейЗаписи, ЭлементМассива);
					Иначе 
						// Удалим неактуальный статус
						УдалитьСтатусКлиента(ЭлементМассива);
					КонецЕсли;
				КонецЦикла;
				Если ЗначениеЗаполнено(СтруктураПоследнейЗаписи.Статус) И СтруктураПоследнейЗаписи.Статус = СтрокаАктуальныйСтатусПациента.Статус И НЕ СтрокаАктуальныйСтатусПациента.Статус = Перечисления.СтатусыКонтрагентов.Потенциальный Тогда 
					// Удалим неактуальный статус
					УдалитьСтатусКлиента(СтруктураПоследнейЗаписи);	
				ИначеЕсли ЗначениеЗаполнено(СтруктураПоследнейЗаписи.Статус) И СтруктураПоследнейЗаписи.Статус = СтрокаАктуальныйСтатусПациента.Статус И СтрокаАктуальныйСтатусПациента.Статус = Перечисления.СтатусыКонтрагентов.Потенциальный Тогда 
					Продолжить;
				КонецЕсли;	
				СтрокаАктуальныйСтатусПациента.Период = ПериодУстановкиАктуальногоСтатуса;
				ЗаписатьАктуальныйСтатусКлиента(СтрокаАктуальныйСтатусПациента);
				//ЗаполнитьЗначенияСвойств(ТаблицаУстановленныхСтатусов.Добавить(), СтрокаАктуальныйСтатусПациента);				
			КонецЦикла;
			ТаблицаПациентов = Неопределено;
		КонецЕсли;
		ТаблицаАктуальныхСтатусовПациентов = Неопределено;
	КонецЦикла;	
	
	//// Регистрируем триггерные события смены статусов у клиентов, если настроены, отдельной процедурой,
	//// не задействуя общий механизм.
	//Если ТаблицаУстановленныхСтатусов.Количество() <> 0 Тогда
	//	Если ОбщегоНазначения.МодульТриггерныеСобытияСуществует() Тогда
	//		ОбщегоНазначения.ПолучитьМодульТриггерныеСобытия().ЗарегистрироватьСменуСтатусовКлиентов(ТаблицаУстановленныхСтатусов);
	//	КонецЕсли;	
	//КонецЕсли;
	
КонецПроцедуры

// Процедура - Актуализировать статус пациента
//
// Параметры:
//  Контрагент					 - 	 - 
//  ПриемИсключение				 - 	 - 
//  ИспользоватьБизнесЛогику	 - 	 - 
//  ИспользоватьБлокировкуЗаписи - 	 - 
//
Процедура АктуализироватьСтатусПациента(Знач Контрагент
										, ПриемИсключение 				= Неопределено
										, ИспользоватьБизнесЛогику 		= Ложь
										, ИспользоватьБлокировкуЗаписи 	= Ложь) Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Контрагент"					, Контрагент);
	СтруктураПараметров.Вставить("ПриемИсключение"				, ПриемИсключение);
	СтруктураПараметров.Вставить("ИспользоватьБизнесЛогику"		, ИспользоватьБизнесЛогику);
	СтруктураПараметров.Вставить("ИспользоватьБлокировкуЗаписи"	, ИспользоватьБлокировкуЗаписи);	
	СтруктураПараметров.Вставить("Пауза"						, 3); //числовое значение в секундах
	ПараметрыДлительнойОперации = ЗагрузкаПроведениеДокументов.НачатьАктуализациюСтатусаПациента(Строка(Новый УникальныйИдентификатор()), СтруктураПараметров);
		
КонецПроцедуры

// Процедура, выполняет установку статуса контрагента
//
Процедура УстановитьСтатусКонтрагента(СтруктураЗаписи) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураЗаписи.Период) ИЛИ НЕ ЗначениеЗаполнено(СтруктураЗаписи.Контрагент) Тогда 
		Возврат;
	КонецЕсли;
	
	СрезПоследних = РегистрыСведений.СтатусыКонтрагентов.СрезПоследних(СтруктураЗаписи.Период - 24*60*60, Новый Структура("Контрагент", СтруктураЗаписи.Контрагент));
	
	ЗаписатьСтатус = Ложь;
	Если СрезПоследних.Количество() <> 0 Тогда 
		Если СрезПоследних[0].Статус <> СтруктураЗаписи.Статус Тогда 
			ЗаписатьСтатус = Истина;
		КонецЕсли;
	Иначе 
		ЗаписатьСтатус = Истина;
	КонецЕсли;	
	
	// Удаление старого статуса
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыКонтрагентов.Период КАК Период,
	|	СтатусыКонтрагентов.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрСведений.СтатусыКонтрагентов КАК СтатусыКонтрагентов
	|ГДЕ
	|	СтатусыКонтрагентов.Период = &Период
	|	И СтатусыКонтрагентов.Контрагент = &Контрагент";
		
	Запрос.УстановитьПараметр("Период"		, СтруктураЗаписи.Период);
	Запрос.УстановитьПараметр("Контрагент"	, СтруктураЗаписи.Контрагент);
		
	Выборка = Запрос.Выполнить().Выбрать(); 

	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.СтатусыКонтрагентов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Отбор.Контрагент.Установить(Выборка.Контрагент);
		НаборЗаписей.Записать();
	КонецЦикла;	
	
	//  Пишем новый статус
	Если ЗаписатьСтатус Тогда		
		
		НаборЗаписей = РегистрыСведений.СтатусыКонтрагентов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Контрагент.Установить(СтруктураЗаписи.Контрагент);		
		НаборЗаписей.Отбор.Период.Установить(СтруктураЗаписи.Период);
		НоваяСтрока = НаборЗаписей.Добавить();
		НоваяСтрока.Контрагент         	= СтруктураЗаписи.Контрагент;
		НоваяСтрока.Период             	= СтруктураЗаписи.Период;
		НоваяСтрока.Статус 				= СтруктураЗаписи.Статус;
		НаборЗаписей.Записать();
		
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Установить статус пациенту
//
// Параметры:
//  Пациент				 - 	 - 
//  Статус				 - 	 -  
//  Период				 - 	 -  
//
Процедура УстановитьСтатусПациенту(Пациент, Статус, Период = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Пациент) ИЛИ НЕ ЗначениеЗаполнено(Статус) Тогда 
		Возврат;
	КонецЕсли;	
		
	Если НЕ ЗначениеЗаполнено(Период) Тогда 
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	НаборЗаписей 						= СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.Контрагент.Установить(Пациент);		
	
	НоваяСтрока 						= НаборЗаписей.Добавить();
	НоваяСтрока.Период             		= Период;	
	НоваяСтрока.Контрагент         		= Пациент;	
	НоваяСтрока.Статус 					= Статус;
	
	НаборЗаписей.Записать();
		
КонецПроцедуры

// Функция - Статус контрагента
//
// Параметры:
//  Контрагент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СтатусКонтрагента(Контрагент) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	СтатусыКонтрагентовСрезПоследних.Статус КАК Статус
	                      |ИЗ
	                      |	РегистрСведений.СтатусыКонтрагентов.СрезПоследних(, Контрагент = &Контрагент) КАК СтатусыКонтрагентовСрезПоследних");
						  					  
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать(); 
		
		Если Выборка.Следующий() Тогда 
			Возврат Выборка.Статус;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Перечисления.СтатусыКонтрагентов.ПустаяСсылка();
	
КонецФункции

// Функция - Это контрагент со статусом отказ
//
// Параметры:
//  Контрагент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЭтоКонтрагентСоСтатусомОтказ(Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатусыКонтрагентовСрезПоследних.Контрагент КАК Контрагент
	               |ИЗ
	               |	РегистрСведений.СтатусыКонтрагентов.СрезПоследних(, Контрагент = &Контрагент) КАК СтатусыКонтрагентовСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиСебестоимость.Обороты(, , , Контрагент = &Контрагент) КАК ПродажиСебестоимостьОбороты
	               |		ПО СтатусыКонтрагентовСрезПоследних.Контрагент = ПродажиСебестоимостьОбороты.Контрагент
	               |ГДЕ
	               |	СтатусыКонтрагентовСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Отказ)
	               |	И ЕСТЬNULL(ПродажиСебестоимостьОбороты.КоличествоОборот, 0) = 0";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Возврат НЕ Запрос.Выполнить().Пустой();	
	
КонецФункции

// Процедура - Отфильтровать клиентов со статусом отказ
//
// Параметры:
//  МассивКонтрагентов	 - 	 - 
//
Процедура ОтфильтроватьКлиентовСоСтатусомОтказ(МассивКонтрагентов) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыКонтрагентовСрезПоследних.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ТаблицаОтказников
	|ИЗ
	|	РегистрСведений.СтатусыКонтрагентов.СрезПоследних(, Контрагент В (&МассивКонтрагентов)) КАК СтатусыКонтрагентовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиСебестоимость.Обороты(, , , Контрагент В (&МассивКонтрагентов)) КАК ПродажиСебестоимостьОбороты
	|		ПО СтатусыКонтрагентовСрезПоследних.Контрагент = ПродажиСебестоимостьОбороты.Контрагент
	|ГДЕ
	|	СтатусыКонтрагентовСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Отказ)
	|	И ЕСТЬNULL(ПродажиСебестоимостьОбороты.КоличествоОборот, 0) = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка В(&МассивКонтрагентов)
	|	И НЕ Контрагенты.Ссылка В
	|				(ВЫБРАТЬ
	|					ТаблицаОтказников.Контрагент
	|				ИЗ
	|					ТаблицаОтказников)");
	
	Запрос.УстановитьПараметр("МассивКонтрагентов", МассивКонтрагентов);
	
	МассивКонтрагентов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контрагент");	
	
КонецПроцедуры

// Функция - Получить текст запроса актуализации статусов пациентов
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТекстЗапросаАктуализацииСтатусовПациентов() Экспорт

	#Область СтарыйЗапрос
	//Возврат "ВЫБРАТЬ
	//        |	СтатусыКонтрагентов.Период КАК Период,
	//        |	СтатусыКонтрагентов.Контрагент КАК Контрагент,
	//        |	СтатусыКонтрагентов.Статус КАК Статус
	//        |ПОМЕСТИТЬ ТаблицаТекущихСтатусовПациентов
	//        |ИЗ
	//        |	РегистрСведений.СтатусыКонтрагентов КАК СтатусыКонтрагентов
	//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаКонтрагентовДляОбработки КАК ТаблицаКонтрагентовДляОбработки
	//        |		ПО СтатусыКонтрагентов.Контрагент = ТаблицаКонтрагентовДляОбработки.Контрагент
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	Сделки.Ссылка КАК Сделка,
	//        |	Сделки.ВидСделки КАК ВидСделки,
	//        |	Сделки.ДатаСделки КАК ДатаСделки,
	//        |	Сделки.ДатаЗавершенияСделки КАК ДатаЗавершенияСделки,
	//        |	Сделки.Контрагент КАК Контрагент,
	//        |	Сделки.РезультатСделки КАК РезультатСделки
	//        |ПОМЕСТИТЬ ТаблицаСделокПациента
	//        |ИЗ
	//        |	Справочник.Сделки КАК Сделки
	//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаКонтрагентовДляОбработки КАК ТаблицаКонтрагентовДляОбработки
	//        |		ПО Сделки.Контрагент = ТаблицаКонтрагентовДляОбработки.Контрагент
	//        |ГДЕ
	//        |	Сделки.ПометкаУдаления = ЛОЖЬ
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ВЫРАЗИТЬ(ДокументПланЛечения.Прием КАК Документ.Прием) КАК Прием,
	//        |	ДокументПланЛечения.Ссылка.Контрагент КАК Контрагент,
	//        |	ВЫРАЗИТЬ(ДокументПланЛечения.Прием КАК Документ.Прием).Дата КАК ДатаПриема,
	//        |	ВЫРАЗИТЬ(ДокументПланЛечения.Прием КАК Документ.Прием).Номер КАК Номер,
	//        |	ДокументПланЛечения.Ссылка.Статус КАК СтатусПланаЛечения
	//        |ПОМЕСТИТЬ СтартоваяТаблицаПлановЛечения
	//        |ИЗ
	//        |	Документ.ПланЛечения.Лечение КАК ДокументПланЛечения
	//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаКонтрагентовДляОбработки КАК ТаблицаКонтрагентовДляОбработки
	//        |		ПО ДокументПланЛечения.Ссылка.Контрагент = ТаблицаКонтрагентовДляОбработки.Контрагент
	//        |ГДЕ
	//        |	ДокументПланЛечения.Ссылка.Проведен = ИСТИНА
	//        |	И НЕ ВЫРАЗИТЬ(ДокументПланЛечения.Прием КАК Документ.Прием) ЕСТЬ NULL
	//        |
	//        |СГРУППИРОВАТЬ ПО
	//        |	ДокументПланЛечения.Прием,
	//        |	ДокументПланЛечения.Ссылка.Контрагент,
	//        |	ДокументПланЛечения.Ссылка.Статус
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ДокументПрием.Ссылка КАК Прием,
	//        |	ДокументПрием.Проведен КАК Проведен,
	//        |	ДокументПрием.Контрагент КАК Контрагент,
	//        |	ДокументПрием.Дата КАК ДатаПриема,
	//        |	ДокументПрием.Номер КАК Номер,
	//        |	ДокументПрием.РезультатПриема КАК РезультатПриема,
	//        |	ДокументПрием.СтатусПациента КАК СтатусПриема,
	//        |	ДокументПрием.Сделка КАК Сделка
	//        |ПОМЕСТИТЬ СтартоваяТаблицаПриемов
	//        |ИЗ
	//        |	Документ.Прием КАК ДокументПрием
	//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаКонтрагентовДляОбработки КАК ТаблицаКонтрагентовДляОбработки
	//        |		ПО ДокументПрием.Контрагент = ТаблицаКонтрагентовДляОбработки.Контрагент
	//        |ГДЕ
	//        |	ДокументПрием.ПометкаУдаления = ЛОЖЬ
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	СтартоваяТаблицаПриемов.Прием КАК Прием,
	//        |	ВЫБОР
	//        |		КОГДА СтартоваяТаблицаПриемов.РезультатПриема = 1
	//        |			ТОГДА СтартоваяТаблицаПриемов.ДатаПриема
	//        |		ИНАЧЕ ТаблицаПлановЛечения.ДатаПриема
	//        |	КОНЕЦ КАК ДатаПриема,
	//        |	ВЫБОР
	//        |		КОГДА СтартоваяТаблицаПриемов.РезультатПриема = 1
	//        |			ТОГДА СтартоваяТаблицаПриемов.Номер
	//        |		ИНАЧЕ ТаблицаПлановЛечения.Номер
	//        |	КОНЕЦ КАК Номер,
	//        |	СтартоваяТаблицаПриемов.Контрагент КАК Контрагент
	//        |ПОМЕСТИТЬ БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы
	//        |ИЗ
	//        |	СтартоваяТаблицаПриемов КАК СтартоваяТаблицаПриемов
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСделокПациента КАК ТаблицаСделокПациента
	//        |		ПО СтартоваяТаблицаПриемов.Сделка = ТаблицаСделокПациента.Сделка
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ СтартоваяТаблицаПлановЛечения КАК ТаблицаПлановЛечения
	//        |		ПО СтартоваяТаблицаПриемов.Прием = ТаблицаПлановЛечения.Прием
	//        |ГДЕ
	//        |	СтартоваяТаблицаПриемов.Проведен = ИСТИНА
	//        |	И (СтартоваяТаблицаПриемов.РезультатПриема = 1
	//        |			ИЛИ НЕ ТаблицаПлановЛечения.Прием ЕСТЬ NULL)
	//        |	И ЕСТЬNULL(ТаблицаСделокПациента.ВидСделки, ЗНАЧЕНИЕ(Справочник.ВидыСделок.ПустаяСсылка)) <> &ВидСделкиНовыйПациент
	//        |
	//        |СГРУППИРОВАТЬ ПО
	//        |	СтартоваяТаблицаПриемов.Прием,
	//        |	ВЫБОР
	//        |		КОГДА СтартоваяТаблицаПриемов.РезультатПриема = 1
	//        |			ТОГДА СтартоваяТаблицаПриемов.ДатаПриема
	//        |		ИНАЧЕ ТаблицаПлановЛечения.ДатаПриема
	//        |	КОНЕЦ,
	//        |	ВЫБОР
	//        |		КОГДА СтартоваяТаблицаПриемов.РезультатПриема = 1
	//        |			ТОГДА СтартоваяТаблицаПриемов.Номер
	//        |		ИНАЧЕ ТаблицаПлановЛечения.Номер
	//        |	КОНЕЦ,
	//        |	СтартоваяТаблицаПриемов.Контрагент
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	СтартоваяТаблицаПриемов.Прием КАК Прием,
	//        |	СтартоваяТаблицаПриемов.ДатаПриема КАК ДатаПриема,
	//        |	СтартоваяТаблицаПриемов.Контрагент КАК Контрагент
	//        |ПОМЕСТИТЬ БазоваяТаблицаИнициацииПостоянныхПостоянныеПациентыПриемы
	//        |ИЗ
	//        |	ТаблицаСделокПациента КАК ТаблицаСделокПациента
	//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтартоваяТаблицаПриемов КАК СтартоваяТаблицаПриемов
	//        |		ПО ТаблицаСделокПациента.Сделка = СтартоваяТаблицаПриемов.Сделка
	//        |			И (ТаблицаСделокПациента.ВидСделки = &ВидСделкиПостоянныйПациент)
	//        |ГДЕ
	//        |	СтартоваяТаблицаПриемов.Проведен = ИСТИНА
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Прием КАК Прием,
	//        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.ДатаПриема КАК ДатаПриема,
	//        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Контрагент КАК Контрагент,
	//        |	КОЛИЧЕСТВО(БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.Прием) КАК НомерПоПорядку
	//        |ПОМЕСТИТЬ ТаблицаБолееОдногоСанированногоПриема
	//        |ИЗ
	//        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы КАК БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы
	//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы КАК БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1
	//        |		ПО БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.ДатаПриема >= БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.ДатаПриема
	//        |			И (ВЫБОР
	//        |				КОГДА БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.ДатаПриема = БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.ДатаПриема
	//        |					ТОГДА БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Номер >= БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.Номер
	//        |				ИНАЧЕ ИСТИНА
	//        |			КОНЕЦ)
	//        |			И БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Контрагент = БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.Контрагент
	//        |
	//        |СГРУППИРОВАТЬ ПО
	//        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Прием,
	//        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.ДатаПриема,
	//        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Контрагент
	//        |
	//        |ИМЕЮЩИЕ
	//        |	КОЛИЧЕСТВО(БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.Прием) = 2
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ТаблицаБолееОдногоСанированногоПриема.Прием КАК Прием,
	//        |	ТаблицаБолееОдногоСанированногоПриема.ДатаПриема КАК ДатаПриема,
	//        |	ТаблицаБолееОдногоСанированногоПриема.Контрагент КАК Контрагент
	//        |ПОМЕСТИТЬ БазоваяТаблицаИнициацииПостоянных
	//        |ИЗ
	//        |	ТаблицаБолееОдногоСанированногоПриема КАК ТаблицаБолееОдногоСанированногоПриема
	//        |
	//        |ОБЪЕДИНИТЬ
	//        |
	//        |ВЫБРАТЬ
	//        |	БазоваяТаблицаИнициацииПостоянныхПостоянныеПациентыПриемы.Прием,
	//        |	БазоваяТаблицаИнициацииПостоянныхПостоянныеПациентыПриемы.ДатаПриема,
	//        |	БазоваяТаблицаИнициацииПостоянныхПостоянныеПациентыПриемы.Контрагент
	//        |ИЗ
	//        |	БазоваяТаблицаИнициацииПостоянныхПостоянныеПациентыПриемы КАК БазоваяТаблицаИнициацииПостоянныхПостоянныеПациентыПриемы
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	СтартоваяТаблицаПриемов.Контрагент КАК Контрагент,
	//        |	МАКСИМУМ(СтартоваяТаблицаПриемов.ДатаПриема) КАК ДатаПриема
	//        |ПОМЕСТИТЬ ТаблицаИнициацииНовых
	//        |ИЗ
	//        |	СтартоваяТаблицаПриемов КАК СтартоваяТаблицаПриемов
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ БазоваяТаблицаИнициацииПостоянных КАК БазоваяТаблицаИнициацииПостоянных
	//        |		ПО СтартоваяТаблицаПриемов.Контрагент = БазоваяТаблицаИнициацииПостоянных.Контрагент
	//        |
	//        |СГРУППИРОВАТЬ ПО
	//        |	СтартоваяТаблицаПриемов.Контрагент
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	БазоваяТаблицаИнициацииПостоянных.Контрагент КАК Контрагент,
	//        |	МАКСИМУМ(СтартоваяТаблицаПриемов.ДатаПриема) КАК ДатаПриема
	//        |ПОМЕСТИТЬ ТаблицаИнициацииПостоянных
	//        |ИЗ
	//        |	СтартоваяТаблицаПриемов КАК СтартоваяТаблицаПриемов
	//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БазоваяТаблицаИнициацииПостоянных КАК БазоваяТаблицаИнициацииПостоянных
	//        |		ПО СтартоваяТаблицаПриемов.Контрагент = БазоваяТаблицаИнициацииПостоянных.Контрагент
	//        |
	//        |СГРУППИРОВАТЬ ПО
	//        |	БазоваяТаблицаИнициацииПостоянных.Контрагент
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ТаблицаИнициацииПостоянных.Контрагент КАК Контрагент,
	//        |	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ТаблицаИнициацииПостоянных.ДатаПриема, ДЕНЬ), ДЕНЬ, &ДнейОтсутствия) КАК Период
	//        |ПОМЕСТИТЬ ТаблицаНеВернувшихся
	//        |ИЗ
	//        |	ТаблицаИнициацииПостоянных КАК ТаблицаИнициацииПостоянных
	//        |ГДЕ
	//        |	ТаблицаИнициацииПостоянных.ДатаПриема < &ГраницаПериодаНеактивности
	//        |
	//        |ОБЪЕДИНИТЬ ВСЕ
	//        |
	//        |ВЫБРАТЬ
	//        |	ТаблицаИнициацииНовых.Контрагент,
	//        |	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ТаблицаИнициацииНовых.ДатаПриема, ДЕНЬ), ДЕНЬ, &ДнейОтсутствия)
	//        |ИЗ
	//        |	ТаблицаИнициацииНовых КАК ТаблицаИнициацииНовых
	//        |ГДЕ
	//        |	ТаблицаИнициацииНовых.ДатаПриема < &ГраницаПериодаНеактивности
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	СтартоваяТаблицаПриемов.Контрагент КАК Контрагент,
	//        |	МИНИМУМ(СтартоваяТаблицаПриемов.ДатаПриема) КАК Период
	//        |ПОМЕСТИТЬ ТаблицаНовых
	//        |ИЗ
	//        |	СтартоваяТаблицаПриемов КАК СтартоваяТаблицаПриемов
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИнициацииПостоянных КАК ТаблицаИнициацииПостоянных
	//        |		ПО СтартоваяТаблицаПриемов.Контрагент = ТаблицаИнициацииПостоянных.Контрагент
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНеВернувшихся КАК ТаблицаНеВернувшихся
	//        |		ПО СтартоваяТаблицаПриемов.Контрагент = ТаблицаНеВернувшихся.Контрагент
	//        |
	//        |СГРУППИРОВАТЬ ПО
	//        |	СтартоваяТаблицаПриемов.Контрагент
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	БазоваяТаблицаИнициацииПостоянных.Контрагент КАК Контрагент,
	//        |	МИНИМУМ(ВЫБОР
	//        |			КОГДА БазоваяТаблицаИнициацииПостоянных.ДатаПриема > ЕСТЬNULL(ТаблицаПоследнихНевернувшихся.Период, ДАТАВРЕМЯ(1, 1, 1))
	//        |				ТОГДА БазоваяТаблицаИнициацииПостоянных.ДатаПриема
	//        |			ИНАЧЕ СтартоваяТаблицаПриемов.ДатаПриема
	//        |		КОНЕЦ) КАК Период
	//        |ПОМЕСТИТЬ ТаблицаПостоянных
	//        |ИЗ
	//        |	БазоваяТаблицаИнициацииПостоянных КАК БазоваяТаблицаИнициацииПостоянных
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНеВернувшихся КАК ТаблицаНеВернувшихся
	//        |		ПО БазоваяТаблицаИнициацииПостоянных.Контрагент = ТаблицаНеВернувшихся.Контрагент
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//        |			МАКСИМУМ(ТаблицаТекущихСтатусовПациентов.Период) КАК Период,
	//        |			ТаблицаТекущихСтатусовПациентов.Контрагент КАК Контрагент
	//        |		ИЗ
	//        |			ТаблицаТекущихСтатусовПациентов КАК ТаблицаТекущихСтатусовПациентов
	//        |		ГДЕ
	//        |			ТаблицаТекущихСтатусовПациентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.НеВернувшийся)
	//        |		
	//        |		СГРУППИРОВАТЬ ПО
	//        |			ТаблицаТекущихСтатусовПациентов.Контрагент) КАК ТаблицаПоследнихНевернувшихся
	//        |		ПО БазоваяТаблицаИнициацииПостоянных.Контрагент = ТаблицаПоследнихНевернувшихся.Контрагент
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ СтартоваяТаблицаПриемов КАК СтартоваяТаблицаПриемов
	//        |		ПО БазоваяТаблицаИнициацииПостоянных.Контрагент = СтартоваяТаблицаПриемов.Контрагент
	//        |ГДЕ
	//        |	(БазоваяТаблицаИнициацииПостоянных.ДатаПриема > ЕСТЬNULL(ТаблицаПоследнихНевернувшихся.Период, ДАТАВРЕМЯ(1, 1, 1))
	//        |			ИЛИ НЕ ТаблицаПоследнихНевернувшихся.Период ЕСТЬ NULL
	//        |				И СтартоваяТаблицаПриемов.ДатаПриема > ТаблицаПоследнихНевернувшихся.Период)
	//        |
	//        |СГРУППИРОВАТЬ ПО
	//        |	БазоваяТаблицаИнициацииПостоянных.Контрагент
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	МАКСИМУМ(ВЫБОР
	//        |			КОГДА ТаблицаСделок.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
	//        |				ТОГДА ТаблицаСделок.ДатаСделки
	//        |			ИНАЧЕ ТаблицаСделок.ДатаЗавершенияСделки
	//        |		КОНЕЦ) КАК ДатаПоследнейСделки,
	//        |	ТаблицаСделок.Контрагент КАК Контрагент
	//        |ПОМЕСТИТЬ ТаблицаДатПоследнихСделок
	//        |ИЗ
	//        |	ТаблицаСделокПациента КАК ТаблицаСделок
	//        |ГДЕ
	//        |	ТаблицаСделок.ВидСделки = &ВидСделкиНовыйПациент
	//        |
	//        |СГРУППИРОВАТЬ ПО
	//        |	ТаблицаСделок.Контрагент
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	МАКСИМУМ(ТаблицаТекущихСтатусовПациентов.Период) КАК Период,
	//        |	ТаблицаТекущихСтатусовПациентов.Контрагент КАК Контрагент
	//        |ПОМЕСТИТЬ ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов
	//        |ИЗ
	//        |	ТаблицаТекущихСтатусовПациентов КАК ТаблицаТекущихСтатусовПациентов
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДатПоследнихСделок КАК ТаблицаДатПоследнихСделок
	//        |		ПО ТаблицаТекущихСтатусовПациентов.Контрагент = ТаблицаДатПоследнихСделок.Контрагент
	//        |ГДЕ
	//        |	ТаблицаТекущихСтатусовПациентов.Период <= ТаблицаДатПоследнихСделок.ДатаПоследнейСделки
	//        |
	//        |СГРУППИРОВАТЬ ПО
	//        |	ТаблицаТекущихСтатусовПациентов.Контрагент
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ТаблицаСделокПациента.ДатаЗавершенияСделки КАК Период,
	//        |	ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов.Контрагент КАК Контрагент
	//        |ПОМЕСТИТЬ ТаблицаПациентовСоСтатусомОтказ
	//        |ИЗ
	//        |	ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов КАК ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТекущихСтатусовПациентов КАК ТаблицаТекущихСтатусовПациентов
	//        |		ПО ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов.Контрагент = ТаблицаТекущихСтатусовПациентов.Контрагент
	//        |			И ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов.Период = ТаблицаТекущихСтатусовПациентов.Период
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСделокПациента КАК ТаблицаСделокПациента
	//        |		ПО ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов.Контрагент = ТаблицаСделокПациента.Контрагент
	//        |			И (ТаблицаСделокПациента.ВидСделки = &ВидСделкиНовыйПациент)
	//        |			И (ТаблицаСделокПациента.ДатаЗавершенияСделки >= ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов.Период)
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДатПоследнихСделок КАК ТаблицаДатПоследнихСделок
	//        |		ПО ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов.Контрагент = ТаблицаДатПоследнихСделок.Контрагент
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПостоянных КАК ТаблицаПостоянных
	//        |		ПО ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов.Контрагент = ТаблицаПостоянных.Контрагент
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНеВернувшихся КАК ТаблицаНеВернувшихся
	//        |		ПО ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов.Контрагент = ТаблицаНеВернувшихся.Контрагент
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНовых КАК ТаблицаНовых
	//        |		ПО ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов.Контрагент = ТаблицаНовых.Контрагент
	//        |ГДЕ
	//        |	ТаблицаТекущихСтатусовПациентов.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Потенциальный), ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Отказ))
	//        |	И ВЫБОР
	//        |			КОГДА ТаблицаТекущихСтатусовПациентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Отказ)
	//        |				ТОГДА ТаблицаСделокПациента.ДатаЗавершенияСделки >= ТаблицаДатПоследнихСделок.ДатаПоследнейСделки
	//        |			ИНАЧЕ ИСТИНА
	//        |		КОНЕЦ
	//        |	И ЕСТЬNULL(ТаблицаСделокПациента.РезультатСделки, ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.Отказ)
	//        |	И ТаблицаПостоянных.Контрагент ЕСТЬ NULL
	//        |	И ТаблицаНеВернувшихся.Контрагент ЕСТЬ NULL
	//        |	И ТаблицаНовых.Контрагент ЕСТЬ NULL
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ТаблицаПостоянных.Контрагент КАК Контрагент
	//        |ПОМЕСТИТЬ ТаблицаНеПотенциальныхПациентов
	//        |ИЗ
	//        |	ТаблицаПостоянных КАК ТаблицаПостоянных
	//        |
	//        |ОБЪЕДИНИТЬ ВСЕ
	//        |
	//        |ВЫБРАТЬ
	//        |	ТаблицаНеВернувшихся.Контрагент
	//        |ИЗ
	//        |	ТаблицаНеВернувшихся КАК ТаблицаНеВернувшихся
	//        |
	//        |ОБЪЕДИНИТЬ ВСЕ
	//        |
	//        |ВЫБРАТЬ
	//        |	ТаблицаНовых.Контрагент
	//        |ИЗ
	//        |	ТаблицаНовых КАК ТаблицаНовых
	//        |
	//        |ОБЪЕДИНИТЬ ВСЕ
	//        |
	//        |ВЫБРАТЬ
	//        |	ТаблицаПациентовСоСтатусомОтказ.Контрагент
	//        |ИЗ
	//        |	ТаблицаПациентовСоСтатусомОтказ КАК ТаблицаПациентовСоСтатусомОтказ
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	Контрагенты.Ссылка КАК Контрагент,
	//        |	Контрагенты.ДатаРегистрации КАК ДатаРегистрации
	//        |ПОМЕСТИТЬ ТаблицаКонтрагентов
	//        |ИЗ
	//        |	Справочник.Контрагенты КАК Контрагенты
	//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаКонтрагентовДляОбработки КАК ТаблицаКонтрагентовДляОбработки
	//        |		ПО Контрагенты.Ссылка = ТаблицаКонтрагентовДляОбработки.Контрагент
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ВЫБОР
	//        |		КОГДА ТаблицаКонтрагентов.ДатаРегистрации <> ДАТАВРЕМЯ(1, 1, 1)
	//        |			ТОГДА ТаблицаКонтрагентов.ДатаРегистрации
	//        |		КОГДА НЕ ТаблицаТекущихСтатусовПациентов.Период ЕСТЬ NULL
	//        |			ТОГДА ТаблицаТекущихСтатусовПациентов.Период
	//        |		ИНАЧЕ &ГраницаПериодаНеактивности
	//        |	КОНЕЦ КАК Период,
	//        |	ТаблицаКонтрагентов.Контрагент КАК Контрагент
	//        |ПОМЕСТИТЬ ТаблицаПотенциальныхПациентов
	//        |ИЗ
	//        |	ТаблицаКонтрагентов КАК ТаблицаКонтрагентов
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТекущихСтатусовПациентов КАК ТаблицаТекущихСтатусовПациентов
	//        |		ПО ТаблицаКонтрагентов.Контрагент = ТаблицаТекущихСтатусовПациентов.Контрагент
	//        |			И (ТаблицаТекущихСтатусовПациентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Потенциальный))
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНеПотенциальныхПациентов КАК ТаблицаНеПотенциальныхПациентов
	//        |		ПО ТаблицаКонтрагентов.Контрагент = ТаблицаНеПотенциальныхПациентов.Контрагент
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТекущихСтатусовПациентов КАК ТаблицаТекущихСтатусовОтказПациентов
	//        |		ПО ТаблицаКонтрагентов.Контрагент = ТаблицаТекущихСтатусовОтказПациентов.Контрагент
	//        |			И (ТаблицаТекущихСтатусовОтказПациентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Отказ))
	//        |ГДЕ
	//        |	ТаблицаНеПотенциальныхПациентов.Контрагент ЕСТЬ NULL
	//        |	И ТаблицаТекущихСтатусовОтказПациентов.Контрагент ЕСТЬ NULL
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ТаблицаПотенциальных.Период КАК Период,
	//        |	ТаблицаПотенциальных.Контрагент КАК Контрагент,
	//        |	ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Потенциальный) КАК Статус
	//        |ИЗ
	//        |	ТаблицаПотенциальныхПациентов КАК ТаблицаПотенциальных
	//        |ГДЕ
	//        |	ТаблицаПотенциальных.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//        |
	//        |ОБЪЕДИНИТЬ ВСЕ
	//        |
	//        |ВЫБРАТЬ
	//        |	ТаблицаНовых.Период,
	//        |	ТаблицаНовых.Контрагент,
	//        |	ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Первичный)
	//        |ИЗ
	//        |	ТаблицаНовых КАК ТаблицаНовых
	//        |ГДЕ
	//        |	ТаблицаНовых.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//        |
	//        |ОБЪЕДИНИТЬ ВСЕ
	//        |
	//        |ВЫБРАТЬ
	//        |	ТаблицаПостоянных.Период,
	//        |	ТаблицаПостоянных.Контрагент,
	//        |	ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Постоянный)
	//        |ИЗ
	//        |	ТаблицаПостоянных КАК ТаблицаПостоянных
	//        |ГДЕ
	//        |	ТаблицаПостоянных.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//        |
	//        |ОБЪЕДИНИТЬ ВСЕ
	//        |
	//        |ВЫБРАТЬ
	//        |	ТаблицаНеВернувшихся.Период,
	//        |	ТаблицаНеВернувшихся.Контрагент,
	//        |	ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.НеВернувшийся)
	//        |ИЗ
	//        |	ТаблицаНеВернувшихся КАК ТаблицаНеВернувшихся
	//        |ГДЕ
	//        |	ТаблицаНеВернувшихся.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//        |
	//        |ОБЪЕДИНИТЬ ВСЕ
	//        |
	//        |ВЫБРАТЬ
	//        |	ТаблицаПациентовСоСтатусомОтказ.Период,
	//        |	ТаблицаПациентовСоСтатусомОтказ.Контрагент,
	//        |	ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Отказ)
	//        |ИЗ
	//        |	ТаблицаПациентовСоСтатусомОтказ КАК ТаблицаПациентовСоСтатусомОтказ
	//        |ГДЕ
	//        |	ТаблицаПациентовСоСтатусомОтказ.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//        |
	//        |УПОРЯДОЧИТЬ ПО
	//        |	Контрагент,
	//        |	Период";
	    #КонецОбласти

		#Область НовыйЗапрос
		
		Возврат "ВЫБРАТЬ
		        |	СтатусыКонтрагентов.Период КАК Период,
		        |	СтатусыКонтрагентов.Контрагент КАК Контрагент,
		        |	СтатусыКонтрагентов.Статус КАК Статус
		        |ПОМЕСТИТЬ ТаблицаТекущихСтатусовПациентов
		        |ИЗ
		        |	РегистрСведений.СтатусыКонтрагентов КАК СтатусыКонтрагентов
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаКонтрагентовДляОбработки КАК ТаблицаКонтрагентовДляОбработки
		        |		ПО СтатусыКонтрагентов.Контрагент = ТаблицаКонтрагентовДляОбработки.Контрагент
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	Сделки.Ссылка КАК Сделка,
		        |	Сделки.ВидСделки КАК ВидСделки,
		        |	Сделки.ДатаСделки КАК ДатаСделки,
		        |	Сделки.ДатаЗавершенияСделки КАК ДатаЗавершенияСделки,
		        |	Сделки.Контрагент КАК Контрагент,
		        |	Сделки.РезультатСделки КАК РезультатСделки
		        |ПОМЕСТИТЬ ТаблицаСделокПациентаСОтказом
		        |ИЗ
		        |	Справочник.Сделки КАК Сделки
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаКонтрагентовДляОбработки КАК ТаблицаКонтрагентовДляОбработки
		        |		ПО Сделки.Контрагент = ТаблицаКонтрагентовДляОбработки.Контрагент
		        |ГДЕ
		        |	Сделки.ПометкаУдаления = ЛОЖЬ
		        |	И Сделки.ВидСделки = &ВидСделкиНовыйПациент
		        |	И ЕСТЬNULL(Сделки.РезультатСделки, ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.Отказ)
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ДокументПрием.Ссылка КАК Прием,
		        |	ДокументПрием.Проведен КАК Проведен,
		        |	ДокументПрием.Контрагент КАК Контрагент,
		        |	ДокументПрием.Дата КАК ДатаПриема,
		        |	ДокументПрием.Номер КАК Номер,
		        |	ДокументПрием.РезультатПриема КАК РезультатПриема,
		        |	ДокументПрием.СтатусПациента КАК СтатусПриема,
		        |	ДокументПрием.Сделка КАК Сделка
		        |ПОМЕСТИТЬ СтартоваяТаблицаПриемов
		        |ИЗ
		        |	Документ.Прием КАК ДокументПрием
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаКонтрагентовДляОбработки КАК ТаблицаКонтрагентовДляОбработки
		        |		ПО ДокументПрием.Контрагент = ТаблицаКонтрагентовДляОбработки.Контрагент
		        |ГДЕ
		        |	ДокументПрием.Проведен = ИСТИНА
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	СтартоваяТаблицаПриемов.Прием КАК Прием,
		        |	СтартоваяТаблицаПриемов.ДатаПриема КАК ДатаПриема,
		        |	СтартоваяТаблицаПриемов.Номер КАК Номер,
		        |	СтартоваяТаблицаПриемов.Контрагент КАК Контрагент
		        |ПОМЕСТИТЬ БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы
		        |ИЗ
		        |	СтартоваяТаблицаПриемов КАК СтартоваяТаблицаПриемов
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	СтартоваяТаблицаПриемов.Прием,
		        |	СтартоваяТаблицаПриемов.Контрагент,
		        |	СтартоваяТаблицаПриемов.ДатаПриема,
		        |	СтартоваяТаблицаПриемов.Номер
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Прием КАК Прием,
		        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.ДатаПриема КАК ДатаПриема,
		        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Контрагент КАК Контрагент,
		        |	КОЛИЧЕСТВО(БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.Прием) КАК НомерПоПорядку
		        |ПОМЕСТИТЬ ТаблицаПриемовПациаентовСНумерацией
		        |ИЗ
		        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы КАК БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы КАК БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1
		        |		ПО БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.ДатаПриема >= БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.ДатаПриема
		        |			И (ВЫБОР
		        |				КОГДА БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.ДатаПриема = БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.ДатаПриема
		        |					ТОГДА БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Номер >= БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.Номер
		        |				ИНАЧЕ ИСТИНА
		        |			КОНЕЦ)
		        |			И БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Контрагент = БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.Контрагент
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Прием,
		        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.ДатаПриема,
		        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Контрагент
		        |
		        |ИМЕЮЩИЕ
		        |	КОЛИЧЕСТВО(БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.Прием) = 2
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ТаблицаПриемовПациаентовСНумерацией.Контрагент КАК Контрагент,
		        |	ТаблицаПриемовПациаентовСНумерацией.ДатаПриема КАК ДатаПриема,
		        |	ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Постоянный) КАК Статус
		        |ПОМЕСТИТЬ ТаблицаПостоянныхПациентов
		        |ИЗ
		        |	ТаблицаПриемовПациаентовСНумерацией КАК ТаблицаПриемовПациаентовСНумерацией
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	СтартоваяТаблицаПриемов.Контрагент КАК Контрагент,
		        |	МИНИМУМ(СтартоваяТаблицаПриемов.ДатаПриема) КАК ДатаПриема,
		        |	ЗНАЧЕНИЕ(перечисление.статусыКонтрагентов.Первичный) КАК Статус
		        |ПОМЕСТИТЬ ТаблицаНовыхПациентов
		        |ИЗ
		        |	СтартоваяТаблицаПриемов КАК СтартоваяТаблицаПриемов
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПриемовПациаентовСНумерацией КАК ТаблицаПостоянных
		        |		ПО СтартоваяТаблицаПриемов.Контрагент = ТаблицаПостоянных.Контрагент
		        |ГДЕ
		        |	ТаблицаПостоянных.Контрагент ЕСТЬ NULL
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	СтартоваяТаблицаПриемов.Контрагент
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	МАКСИМУМ(ВЫБОР
		        |			КОГДА ТаблицаСделок.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
		        |				ТОГДА ТаблицаСделок.ДатаСделки
		        |			ИНАЧЕ ТаблицаСделок.ДатаЗавершенияСделки
		        |		КОНЕЦ) КАК ДатаПоследнейСделкиНовыйПациент,
		        |	ТаблицаСделок.Контрагент КАК Контрагент,
		        |	ЗНАЧЕНИЕ(перечисление.статусыКонтрагентов.Отказ) КАК Статус
		        |ПОМЕСТИТЬ ПоследниеСделкиПациентовСОтказом
		        |ИЗ
		        |	ТаблицаСделокПациентаСОтказом КАК ТаблицаСделок
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ТаблицаСделок.Контрагент
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	СтартоваяТаблицаПриемов.Контрагент КАК Контрагент,
		        |	МАКСИМУМ(СтартоваяТаблицаПриемов.ДатаПриема) КАК ДатаПриема
		        |ПОМЕСТИТЬ ПоследниеПриемыПациентов
		        |ИЗ
		        |	СтартоваяТаблицаПриемов КАК СтартоваяТаблицаПриемов
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	СтартоваяТаблицаПриемов.Контрагент
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ПоследниеПриемыПациентов.Контрагент КАК Контрагент,
		        |	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ПоследниеПриемыПациентов.ДатаПриема, ДЕНЬ), ДЕНЬ, &ДнейОтсутствия) КАК Дата,
		        |	ЗНАЧЕНИЕ(перечисление.статусыКонтрагентов.НеВернувшийся) КАК Статус
		        |ПОМЕСТИТЬ ТаблицаНеВернувшихсяПациентов
		        |ИЗ
		        |	ПоследниеПриемыПациентов КАК ПоследниеПриемыПациентов
		        |ГДЕ
		        |	ПоследниеПриемыПациентов.ДатаПриема < &ГраницаПериодаНеактивности
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ТаблицаНовыхПациентов.Контрагент КАК Контрагент,
		        |	ТаблицаНовыхПациентов.ДатаПриема КАК Дата
		        |ПОМЕСТИТЬ СтатусыКромеПотенциальныхИОтказ
		        |ИЗ
		        |	ТаблицаНовыхПациентов КАК ТаблицаНовыхПациентов
		        |
		        |ОБЪЕДИНИТЬ ВСЕ
		        |
		        |ВЫБРАТЬ
		        |	ТаблицаПостоянныхПациентов.Контрагент,
		        |	ТаблицаПостоянныхПациентов.ДатаПриема
		        |ИЗ
		        |	ТаблицаПостоянныхПациентов КАК ТаблицаПостоянныхПациентов
		        |
		        |ОБЪЕДИНИТЬ ВСЕ
		        |
		        |ВЫБРАТЬ
		        |	ТаблицаНеВернувшихсяПациентов.Контрагент,
		        |	ТаблицаНеВернувшихсяПациентов.Дата
		        |ИЗ
		        |	ТаблицаНеВернувшихсяПациентов КАК ТаблицаНеВернувшихсяПациентов
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	СтатусыКромеПотенциальныхИОтказ.Контрагент КАК Контрагент,
		        |	МАКСИМУМ(СтатусыКромеПотенциальныхИОтказ.Дата) КАК Дата
		        |ПОМЕСТИТЬ АктуальныеДатыСтатусовКонтрагентов
		        |ИЗ
		        |	СтатусыКромеПотенциальныхИОтказ КАК СтатусыКромеПотенциальныхИОтказ
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	СтатусыКромеПотенциальныхИОтказ.Контрагент
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	Контрагенты.Ссылка КАК Контрагент,
		        |	Контрагенты.ДатаРегистрации КАК ДатаРегистрации
		        |ПОМЕСТИТЬ ПотенциальныеИОтказ
		        |ИЗ
		        |	Справочник.Контрагенты КАК Контрагенты
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаКонтрагентовДляОбработки КАК ТаблицаКонтрагентовДляОбработки
		        |		ПО Контрагенты.Ссылка = ТаблицаКонтрагентовДляОбработки.Контрагент
		        |ГДЕ
		        |	НЕ Контрагенты.Ссылка В
		        |				(ВЫБРАТЬ
		        |					СтатусыКромеПотенциальныхИОтказ.Контрагент КАК Контрагент
		        |				ИЗ
		        |					СтатусыКромеПотенциальныхИОтказ КАК СтатусыКромеПотенциальныхИОтказ)
		        |	И Контрагенты.ЭтоГруппа = ЛОЖЬ
		        |	И Контрагенты.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты)
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ПотенциальныеИОтказ.ДатаРегистрации КАК ДатаРегистрации,
		        |	ПотенциальныеИОтказ.Контрагент КАК Контрагент,
		        |	ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Потенциальный) КАК Статус
		        |ПОМЕСТИТЬ Потенциальные
		        |ИЗ
		        |	ПотенциальныеИОтказ КАК ПотенциальныеИОтказ
		        |ГДЕ
		        |	НЕ ПотенциальныеИОтказ.Контрагент В
		        |				(ВЫБРАТЬ
		        |					ПоследниеСделкиПациентовСОтказом.Контрагент КАК Контрагент
		        |				ИЗ
		        |					ПоследниеСделкиПациентовСОтказом КАК ПоследниеСделкиПациентовСОтказом)
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ПоследниеСделкиПациентовСОтказом.Контрагент КАК Контрагент,
		        |	ПоследниеСделкиПациентовСОтказом.ДатаПоследнейСделкиНовыйПациент КАК Период,
		        |	ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Отказ) КАК Статус
		        |ИЗ
		        |	ПотенциальныеИОтказ КАК ПотенциальныеИОтказ
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследниеСделкиПациентовСОтказом КАК ПоследниеСделкиПациентовСОтказом
		        |		ПО ПотенциальныеИОтказ.Контрагент = ПоследниеСделкиПациентовСОтказом.Контрагент
		        |
		        |ОБЪЕДИНИТЬ ВСЕ
		        |
		        |ВЫБРАТЬ
		        |	Потенциальные.Контрагент,
		        |	Потенциальные.ДатаРегистрации,
		        |	Потенциальные.Статус
		        |ИЗ
		        |	Потенциальные КАК Потенциальные
		        |
		        |ОБЪЕДИНИТЬ ВСЕ
		        |
		        |ВЫБРАТЬ
		        |	АктуальныеДатыСтатусовКонтрагентов.Контрагент,
		        |	АктуальныеДатыСтатусовКонтрагентов.Дата,
		        |	ВЫБОР
		        |		КОГДА НЕ ТаблицаНеВернувшихсяПациентов.Статус ЕСТЬ NULL
		        |			ТОГДА ТаблицаНеВернувшихсяПациентов.Статус
		        |		КОГДА НЕ ТаблицаНовыхПациентов.Статус ЕСТЬ NULL
		        |			ТОГДА ТаблицаНовыхПациентов.Статус
		        |		КОГДА НЕ ТаблицаПостоянныхПациентов.Статус ЕСТЬ NULL
		        |			ТОГДА ТаблицаПостоянныхПациентов.Статус
		        |	КОНЕЦ
		        |ИЗ
		        |	АктуальныеДатыСтатусовКонтрагентов КАК АктуальныеДатыСтатусовКонтрагентов
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНовыхПациентов КАК ТаблицаНовыхПациентов
		        |		ПО АктуальныеДатыСтатусовКонтрагентов.Контрагент = ТаблицаНовыхПациентов.Контрагент
		        |			И АктуальныеДатыСтатусовКонтрагентов.Дата = ТаблицаНовыхПациентов.ДатаПриема
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПостоянныхПациентов КАК ТаблицаПостоянныхПациентов
		        |		ПО АктуальныеДатыСтатусовКонтрагентов.Контрагент = ТаблицаПостоянныхПациентов.Контрагент
		        |			И АктуальныеДатыСтатусовКонтрагентов.Дата = ТаблицаПостоянныхПациентов.ДатаПриема
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНеВернувшихсяПациентов КАК ТаблицаНеВернувшихсяПациентов
		        |		ПО АктуальныеДатыСтатусовКонтрагентов.Контрагент = ТаблицаНеВернувшихсяПациентов.Контрагент
		        |			И АктуальныеДатыСтатусовКонтрагентов.Дата = ТаблицаНеВернувшихсяПациентов.Дата";
		
		#КонецОбласти
	  
КонецФункции

// Функция - Получить текст запроса актуализации статусов пациента
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТекстЗапросаАктуализацииСтатусовПациента() Экспорт
	
#Область ЗАПРОС

#Область СтарыйЗапрос
	//Возврат "ВЫБРАТЬ
	//        |	СтатусыКонтрагентов.Период КАК Период,
	//        |	СтатусыКонтрагентов.Контрагент КАК Контрагент,
	//        |	СтатусыКонтрагентов.Статус КАК Статус
	//        |ПОМЕСТИТЬ ТаблицаТекущихСтатусовПациентов
	//        |ИЗ
	//        |	РегистрСведений.СтатусыКонтрагентов КАК СтатусыКонтрагентов
	//        |ГДЕ
	//        |	СтатусыКонтрагентов.Контрагент = &Контрагент
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	Сделки.Ссылка КАК Сделка,
	//        |	Сделки.ВидСделки КАК ВидСделки,
	//        |	Сделки.ДатаСделки КАК ДатаСделки,
	//        |	Сделки.ДатаЗавершенияСделки КАК ДатаЗавершенияСделки,
	//        |	Сделки.Контрагент КАК Контрагент,
	//        |	Сделки.РезультатСделки КАК РезультатСделки
	//        |ПОМЕСТИТЬ ТаблицаСделокПациента
	//        |ИЗ
	//        |	Справочник.Сделки КАК Сделки
	//        |ГДЕ
	//        |	Сделки.ПометкаУдаления = ЛОЖЬ
	//        |	И Сделки.Контрагент = &Контрагент
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ДокументПрием.Ссылка КАК Прием,
	//        |	ДокументПрием.Проведен КАК Проведен,
	//        |	ДокументПрием.Контрагент КАК Контрагент,
	//        |	ДокументПрием.Дата КАК ДатаПриема,
	//        |	ДокументПрием.Номер КАК Номер,
	//        |	ДокументПрием.РезультатПриема КАК РезультатПриема,
	//        |	ДокументПрием.СтатусПациента КАК СтатусПриема,
	//        |	ДокументПрием.Сделка КАК Сделка
	//        |ПОМЕСТИТЬ СтартоваяТаблицаПриемов
	//        |ИЗ
	//        |	Документ.Прием КАК ДокументПрием
	//        |ГДЕ
	//        |	ДокументПрием.ПометкаУдаления = ЛОЖЬ
	//        |	И ДокументПрием.Контрагент = &Контрагент
	//        |	И ДокументПрием.Контрагент.ПометкаУдаления = ЛОЖЬ
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	СтартоваяТаблицаПриемов.Прием КАК Прием,
	//        |	СтартоваяТаблицаПриемов.ДатаПриема КАК ДатаПриема,
	//        |	СтартоваяТаблицаПриемов.Номер КАК Номер,
	//        |	СтартоваяТаблицаПриемов.Контрагент КАК Контрагент
	//        |ПОМЕСТИТЬ БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы
	//        |ИЗ
	//        |	СтартоваяТаблицаПриемов КАК СтартоваяТаблицаПриемов
	//        |ГДЕ
	//        |	СтартоваяТаблицаПриемов.Проведен = ИСТИНА
	//        |
	//        |СГРУППИРОВАТЬ ПО
	//        |	СтартоваяТаблицаПриемов.Прием,
	//        |	СтартоваяТаблицаПриемов.Контрагент,
	//        |	СтартоваяТаблицаПриемов.ДатаПриема,
	//        |	СтартоваяТаблицаПриемов.Номер
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Прием КАК Прием,
	//        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.ДатаПриема КАК ДатаПриема,
	//        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Контрагент КАК Контрагент,
	//        |	КОЛИЧЕСТВО(БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.Прием) КАК НомерПоПорядку
	//        |ПОМЕСТИТЬ ТаблицаБолееОдногоПроведенногоПриема
	//        |ИЗ
	//        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы КАК БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы
	//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы КАК БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1
	//        |		ПО БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.ДатаПриема >= БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.ДатаПриема
	//        |			И (ВЫБОР
	//        |				КОГДА БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.ДатаПриема = БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.ДатаПриема
	//        |					ТОГДА БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Номер >= БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.Номер
	//        |				ИНАЧЕ ИСТИНА
	//        |			КОНЕЦ)
	//        |			И БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Контрагент = БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.Контрагент
	//        |
	//        |СГРУППИРОВАТЬ ПО
	//        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Прием,
	//        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.ДатаПриема,
	//        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Контрагент
	//        |
	//        |ИМЕЮЩИЕ
	//        |	КОЛИЧЕСТВО(БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.Прием) = 2
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ТаблицаБолееОдногоСанированногоПриема.Прием КАК Прием,
	//        |	ТаблицаБолееОдногоСанированногоПриема.ДатаПриема КАК ДатаПриема,
	//        |	ТаблицаБолееОдногоСанированногоПриема.Контрагент КАК Контрагент
	//        |ПОМЕСТИТЬ БазоваяТаблицаИнициацииПостоянных
	//        |ИЗ
	//        |	ТаблицаБолееОдногоПроведенногоПриема КАК ТаблицаБолееОдногоСанированногоПриема
	//        |
	//        |ОБЪЕДИНИТЬ
	//        |
	//        |ВЫБРАТЬ
	//        |	БазоваяТаблицаИнициацииПостоянныхПостоянныеПациентыПриемы.Прием,
	//        |	БазоваяТаблицаИнициацииПостоянныхПостоянныеПациентыПриемы.ДатаПриема,
	//        |	БазоваяТаблицаИнициацииПостоянныхПостоянныеПациентыПриемы.Контрагент
	//        |ИЗ
	//        |	БазоваяТаблицаИнициацииПостоянныхПостоянныеПациентыПриемы КАК БазоваяТаблицаИнициацииПостоянныхПостоянныеПациентыПриемы
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	СтартоваяТаблицаПриемов.Контрагент КАК Контрагент,
	//        |	МАКСИМУМ(СтартоваяТаблицаПриемов.ДатаПриема) КАК ДатаПриема
	//        |ПОМЕСТИТЬ ТаблицаИнициацииНовых
	//        |ИЗ
	//        |	СтартоваяТаблицаПриемов КАК СтартоваяТаблицаПриемов
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ БазоваяТаблицаИнициацииПостоянных КАК БазоваяТаблицаИнициацииПостоянных
	//        |		ПО СтартоваяТаблицаПриемов.Контрагент = БазоваяТаблицаИнициацииПостоянных.Контрагент
	//        |
	//        |СГРУППИРОВАТЬ ПО
	//        |	СтартоваяТаблицаПриемов.Контрагент
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	БазоваяТаблицаИнициацииПостоянных.Контрагент КАК Контрагент,
	//        |	МАКСИМУМ(СтартоваяТаблицаПриемов.ДатаПриема) КАК ДатаПриема
	//        |ПОМЕСТИТЬ ТаблицаИнициацииПостоянных
	//        |ИЗ
	//        |	СтартоваяТаблицаПриемов КАК СтартоваяТаблицаПриемов
	//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БазоваяТаблицаИнициацииПостоянных КАК БазоваяТаблицаИнициацииПостоянных
	//        |		ПО СтартоваяТаблицаПриемов.Контрагент = БазоваяТаблицаИнициацииПостоянных.Контрагент
	//        |
	//        |СГРУППИРОВАТЬ ПО
	//        |	БазоваяТаблицаИнициацииПостоянных.Контрагент
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ТаблицаИнициацииПостоянных.Контрагент КАК Контрагент,
	//        |	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ТаблицаИнициацииПостоянных.ДатаПриема, ДЕНЬ), ДЕНЬ, &ДнейОтсутствия) КАК Период
	//        |ПОМЕСТИТЬ ТаблицаНеВернувшихся
	//        |ИЗ
	//        |	ТаблицаИнициацииПостоянных КАК ТаблицаИнициацииПостоянных
	//        |ГДЕ
	//        |	ТаблицаИнициацииПостоянных.ДатаПриема < &ГраницаПериодаНеактивности
	//        |
	//        |ОБЪЕДИНИТЬ ВСЕ
	//        |
	//        |ВЫБРАТЬ
	//        |	ТаблицаИнициацииНовых.Контрагент,
	//        |	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ТаблицаИнициацииНовых.ДатаПриема, ДЕНЬ), ДЕНЬ, &ДнейОтсутствия)
	//        |ИЗ
	//        |	ТаблицаИнициацииНовых КАК ТаблицаИнициацииНовых
	//        |ГДЕ
	//        |	ТаблицаИнициацииНовых.ДатаПриема < &ГраницаПериодаНеактивности
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	СтартоваяТаблицаПриемов.Контрагент КАК Контрагент,
	//        |	МИНИМУМ(СтартоваяТаблицаПриемов.ДатаПриема) КАК Период
	//        |ПОМЕСТИТЬ ТаблицаНовых
	//        |ИЗ
	//        |	СтартоваяТаблицаПриемов КАК СтартоваяТаблицаПриемов
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИнициацииПостоянных КАК ТаблицаИнициацииПостоянных
	//        |		ПО СтартоваяТаблицаПриемов.Контрагент = ТаблицаИнициацииПостоянных.Контрагент
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНеВернувшихся КАК ТаблицаНеВернувшихся
	//        |		ПО СтартоваяТаблицаПриемов.Контрагент = ТаблицаНеВернувшихся.Контрагент
	//        |
	//        |СГРУППИРОВАТЬ ПО
	//        |	СтартоваяТаблицаПриемов.Контрагент
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	БазоваяТаблицаИнициацииПостоянных.Контрагент КАК Контрагент,
	//        |	МИНИМУМ(ВЫБОР
	//        |			КОГДА БазоваяТаблицаИнициацииПостоянных.ДатаПриема > ЕСТЬNULL(ТаблицаПоследнихНевернувшихся.Период, ДАТАВРЕМЯ(1, 1, 1))
	//        |				ТОГДА БазоваяТаблицаИнициацииПостоянных.ДатаПриема
	//        |			ИНАЧЕ СтартоваяТаблицаПриемов.ДатаПриема
	//        |		КОНЕЦ) КАК Период
	//        |ПОМЕСТИТЬ ТаблицаПостоянных
	//        |ИЗ
	//        |	БазоваяТаблицаИнициацииПостоянных КАК БазоваяТаблицаИнициацииПостоянных
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНеВернувшихся КАК ТаблицаНеВернувшихся
	//        |		ПО БазоваяТаблицаИнициацииПостоянных.Контрагент = ТаблицаНеВернувшихся.Контрагент
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//        |			МАКСИМУМ(ТаблицаТекущихСтатусовПациентов.Период) КАК Период,
	//        |			ТаблицаТекущихСтатусовПациентов.Контрагент КАК Контрагент
	//        |		ИЗ
	//        |			ТаблицаТекущихСтатусовПациентов КАК ТаблицаТекущихСтатусовПациентов
	//        |		ГДЕ
	//        |			ТаблицаТекущихСтатусовПациентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.НеВернувшийся)
	//        |		
	//        |		СГРУППИРОВАТЬ ПО
	//        |			ТаблицаТекущихСтатусовПациентов.Контрагент) КАК ТаблицаПоследнихНевернувшихся
	//        |		ПО БазоваяТаблицаИнициацииПостоянных.Контрагент = ТаблицаПоследнихНевернувшихся.Контрагент
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ СтартоваяТаблицаПриемов КАК СтартоваяТаблицаПриемов
	//        |		ПО БазоваяТаблицаИнициацииПостоянных.Контрагент = СтартоваяТаблицаПриемов.Контрагент
	//        |ГДЕ
	//        |	(БазоваяТаблицаИнициацииПостоянных.ДатаПриема > ЕСТЬNULL(ТаблицаПоследнихНевернувшихся.Период, ДАТАВРЕМЯ(1, 1, 1))
	//        |			ИЛИ НЕ ТаблицаПоследнихНевернувшихся.Период ЕСТЬ NULL
	//        |				И СтартоваяТаблицаПриемов.ДатаПриема > ТаблицаПоследнихНевернувшихся.Период)
	//        |
	//        |СГРУППИРОВАТЬ ПО
	//        |	БазоваяТаблицаИнициацииПостоянных.Контрагент
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	МАКСИМУМ(ВЫБОР
	//        |			КОГДА ТаблицаСделок.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
	//        |				ТОГДА ТаблицаСделок.ДатаСделки
	//        |			ИНАЧЕ ТаблицаСделок.ДатаЗавершенияСделки
	//        |		КОНЕЦ) КАК ДатаПоследнейСделки,
	//        |	ТаблицаСделок.Контрагент КАК Контрагент
	//        |ПОМЕСТИТЬ ТаблицаДатПоследнихСделок
	//        |ИЗ
	//        |	ТаблицаСделокПациента КАК ТаблицаСделок
	//        |ГДЕ
	//        |	ТаблицаСделок.ВидСделки = &ВидСделкиНовыйПациент
	//        |
	//        |СГРУППИРОВАТЬ ПО
	//        |	ТаблицаСделок.Контрагент
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	МАКСИМУМ(ТаблицаТекущихСтатусовПациентов.Период) КАК Период,
	//        |	ТаблицаТекущихСтатусовПациентов.Контрагент КАК Контрагент
	//        |ПОМЕСТИТЬ ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов
	//        |ИЗ
	//        |	ТаблицаТекущихСтатусовПациентов КАК ТаблицаТекущихСтатусовПациентов
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДатПоследнихСделок КАК ТаблицаДатПоследнихСделок
	//        |		ПО ТаблицаТекущихСтатусовПациентов.Контрагент = ТаблицаДатПоследнихСделок.Контрагент
	//        |ГДЕ
	//        |	ТаблицаТекущихСтатусовПациентов.Период <= ТаблицаДатПоследнихСделок.ДатаПоследнейСделки
	//        |
	//        |СГРУППИРОВАТЬ ПО
	//        |	ТаблицаТекущихСтатусовПациентов.Контрагент
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ТаблицаСделокПациента.ДатаЗавершенияСделки КАК Период,
	//        |	ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов.Контрагент КАК Контрагент
	//        |ПОМЕСТИТЬ ТаблицаПациентовСоСтатусомОтказ
	//        |ИЗ
	//        |	ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов КАК ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТекущихСтатусовПациентов КАК ТаблицаТекущихСтатусовПациентов
	//        |		ПО ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов.Контрагент = ТаблицаТекущихСтатусовПациентов.Контрагент
	//        |			И ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов.Период = ТаблицаТекущихСтатусовПациентов.Период
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСделокПациента КАК ТаблицаСделокПациента
	//        |		ПО ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов.Контрагент = ТаблицаСделокПациента.Контрагент
	//        |			И (ТаблицаСделокПациента.ВидСделки = &ВидСделкиНовыйПациент)
	//        |			И (ТаблицаСделокПациента.ДатаЗавершенияСделки >= ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов.Период)
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДатПоследнихСделок КАК ТаблицаДатПоследнихСделок
	//        |		ПО ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов.Контрагент = ТаблицаДатПоследнихСделок.Контрагент
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПостоянных КАК ТаблицаПостоянных
	//        |		ПО ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов.Контрагент = ТаблицаПостоянных.Контрагент
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНеВернувшихся КАК ТаблицаНеВернувшихся
	//        |		ПО ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов.Контрагент = ТаблицаНеВернувшихся.Контрагент
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНовых КАК ТаблицаНовых
	//        |		ПО ТаблицаАктуальныхПериодовДляСрезаСтатусовПациентов.Контрагент = ТаблицаНовых.Контрагент
	//        |ГДЕ
	//        |	ТаблицаТекущихСтатусовПациентов.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Потенциальный), ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Отказ))
	//        |	И ВЫБОР
	//        |			КОГДА ТаблицаТекущихСтатусовПациентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Отказ)
	//        |				ТОГДА ТаблицаСделокПациента.ДатаЗавершенияСделки >= ТаблицаДатПоследнихСделок.ДатаПоследнейСделки
	//        |			ИНАЧЕ ИСТИНА
	//        |		КОНЕЦ
	//        |	И ЕСТЬNULL(ТаблицаСделокПациента.РезультатСделки, ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.Отказ)
	//        |	И ТаблицаПостоянных.Контрагент ЕСТЬ NULL
	//        |	И ТаблицаНеВернувшихся.Контрагент ЕСТЬ NULL
	//        |	И ТаблицаНовых.Контрагент ЕСТЬ NULL
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ТаблицаПостоянных.Контрагент КАК Контрагент
	//        |ПОМЕСТИТЬ ТаблицаНеПотенциальныхПациентов
	//        |ИЗ
	//        |	ТаблицаПостоянных КАК ТаблицаПостоянных
	//        |
	//        |ОБЪЕДИНИТЬ ВСЕ
	//        |
	//        |ВЫБРАТЬ
	//        |	ТаблицаНеВернувшихся.Контрагент
	//        |ИЗ
	//        |	ТаблицаНеВернувшихся КАК ТаблицаНеВернувшихся
	//        |
	//        |ОБЪЕДИНИТЬ ВСЕ
	//        |
	//        |ВЫБРАТЬ
	//        |	ТаблицаНовых.Контрагент
	//        |ИЗ
	//        |	ТаблицаНовых КАК ТаблицаНовых
	//        |
	//        |ОБЪЕДИНИТЬ ВСЕ
	//        |
	//        |ВЫБРАТЬ
	//        |	ТаблицаПациентовСоСтатусомОтказ.Контрагент
	//        |ИЗ
	//        |	ТаблицаПациентовСоСтатусомОтказ КАК ТаблицаПациентовСоСтатусомОтказ
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	Контрагенты.Ссылка КАК Контрагент,
	//        |	Контрагенты.ДатаРегистрации КАК ДатаРегистрации
	//        |ПОМЕСТИТЬ ТаблицаКонтрагентов
	//        |ИЗ
	//        |	Справочник.Контрагенты КАК Контрагенты
	//        |ГДЕ
	//        |	НЕ Контрагенты.ПометкаУдаления
	//        |	И НЕ Контрагенты.ЭтоГруппа
	//        |	И Контрагенты.Ссылка = &Контрагент
	//        |	И Контрагенты.ТипКонтрагента В (ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты), ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.ПустаяСсылка))
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ВЫБОР
	//        |		КОГДА ТаблицаКонтрагентов.ДатаРегистрации <> ДАТАВРЕМЯ(1, 1, 1)
	//        |			ТОГДА ТаблицаКонтрагентов.ДатаРегистрации
	//        |		КОГДА НЕ ТаблицаТекущихСтатусовПациентов.Период ЕСТЬ NULL
	//        |			ТОГДА ТаблицаТекущихСтатусовПациентов.Период
	//        |		ИНАЧЕ &ГраницаПериодаНеактивности
	//        |	КОНЕЦ КАК Период,
	//        |	ТаблицаКонтрагентов.Контрагент КАК Контрагент
	//        |ПОМЕСТИТЬ ТаблицаПотенциальныхПациентов
	//        |ИЗ
	//        |	ТаблицаКонтрагентов КАК ТаблицаКонтрагентов
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТекущихСтатусовПациентов КАК ТаблицаТекущихСтатусовПациентов
	//        |		ПО ТаблицаКонтрагентов.Контрагент = ТаблицаТекущихСтатусовПациентов.Контрагент
	//        |			И (ТаблицаТекущихСтатусовПациентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Потенциальный))
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНеПотенциальныхПациентов КАК ТаблицаНеПотенциальныхПациентов
	//        |		ПО ТаблицаКонтрагентов.Контрагент = ТаблицаНеПотенциальныхПациентов.Контрагент
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТекущихСтатусовПациентов КАК ТаблицаТекущихСтатусовОтказПациентов
	//        |		ПО ТаблицаКонтрагентов.Контрагент = ТаблицаТекущихСтатусовОтказПациентов.Контрагент
	//        |			И (ТаблицаТекущихСтатусовОтказПациентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Отказ))
	//        |ГДЕ
	//        |	ТаблицаНеПотенциальныхПациентов.Контрагент ЕСТЬ NULL
	//        |	И ТаблицаТекущихСтатусовОтказПациентов.Контрагент ЕСТЬ NULL
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ТаблицаПотенциальных.Период КАК Период,
	//        |	ТаблицаПотенциальных.Контрагент КАК Контрагент,
	//        |	ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Потенциальный) КАК Статус
	//        |ИЗ
	//        |	ТаблицаПотенциальныхПациентов КАК ТаблицаПотенциальных
	//        |ГДЕ
	//        |	ТаблицаПотенциальных.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//        |
	//        |ОБЪЕДИНИТЬ ВСЕ
	//        |
	//        |ВЫБРАТЬ
	//        |	ТаблицаНовых.Период,
	//        |	ТаблицаНовых.Контрагент,
	//        |	ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Первичный)
	//        |ИЗ
	//        |	ТаблицаНовых КАК ТаблицаНовых
	//        |ГДЕ
	//        |	ТаблицаНовых.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//        |
	//        |ОБЪЕДИНИТЬ ВСЕ
	//        |
	//        |ВЫБРАТЬ
	//        |	ТаблицаПостоянных.Период,
	//        |	ТаблицаПостоянных.Контрагент,
	//        |	ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Постоянный)
	//        |ИЗ
	//        |	ТаблицаПостоянных КАК ТаблицаПостоянных
	//        |ГДЕ
	//        |	ТаблицаПостоянных.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//        |
	//        |ОБЪЕДИНИТЬ ВСЕ
	//        |
	//        |ВЫБРАТЬ
	//        |	ТаблицаНеВернувшихся.Период,
	//        |	ТаблицаНеВернувшихся.Контрагент,
	//        |	ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.НеВернувшийся)
	//        |ИЗ
	//        |	ТаблицаНеВернувшихся КАК ТаблицаНеВернувшихся
	//        |ГДЕ
	//        |	ТаблицаНеВернувшихся.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//        |
	//        |ОБЪЕДИНИТЬ ВСЕ
	//        |
	//        |ВЫБРАТЬ
	//        |	ТаблицаПациентовСоСтатусомОтказ.Период,
	//        |	ТаблицаПациентовСоСтатусомОтказ.Контрагент,
	//        |	ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Отказ)
	//        |ИЗ
	//        |	ТаблицаПациентовСоСтатусомОтказ КАК ТаблицаПациентовСоСтатусомОтказ
	//        |ГДЕ
	//        |	ТаблицаПациентовСоСтатусомОтказ.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//        |
	//        |УПОРЯДОЧИТЬ ПО
	//        |	Контрагент,
	//        |	Период"; 
	#КонецОбласти
	
	Возврат "ВЫБРАТЬ
	        |	СтатусыКонтрагентов.Период КАК Период,
	        |	СтатусыКонтрагентов.Контрагент КАК Контрагент,
	        |	СтатусыКонтрагентов.Статус КАК Статус
	        |ПОМЕСТИТЬ ТаблицаТекущихСтатусовПациентов
	        |ИЗ
	        |	РегистрСведений.СтатусыКонтрагентов КАК СтатусыКонтрагентов
	        |ГДЕ
	        |	СтатусыКонтрагентов.Контрагент = &Контрагент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Сделки.Ссылка КАК Сделка,
	        |	Сделки.ВидСделки КАК ВидСделки,
	        |	Сделки.ДатаСделки КАК ДатаСделки,
	        |	Сделки.ДатаЗавершенияСделки КАК ДатаЗавершенияСделки,
	        |	Сделки.Контрагент КАК Контрагент,
	        |	Сделки.РезультатСделки КАК РезультатСделки
	        |ПОМЕСТИТЬ ТаблицаСделокПациентаСОтказом
	        |ИЗ
	        |	Справочник.Сделки КАК Сделки
	        |ГДЕ
	        |	Сделки.ПометкаУдаления = ЛОЖЬ
	        |	И Сделки.ВидСделки = &ВидСделкиНовыйПациент
	        |	И ЕСТЬNULL(Сделки.РезультатСделки, ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.Отказ)
	        |	И Сделки.Контрагент = &Контрагент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДокументПрием.Ссылка КАК Прием,
	        |	ДокументПрием.Проведен КАК Проведен,
	        |	ДокументПрием.Контрагент КАК Контрагент,
	        |	ДокументПрием.Дата КАК ДатаПриема,
	        |	ДокументПрием.Номер КАК Номер,
	        |	ДокументПрием.РезультатПриема КАК РезультатПриема,
	        |	ДокументПрием.СтатусПациента КАК СтатусПриема,
	        |	ДокументПрием.Сделка КАК Сделка
	        |ПОМЕСТИТЬ СтартоваяТаблицаПриемов
	        |ИЗ
	        |	Документ.Прием КАК ДокументПрием
	        |ГДЕ
	        |	ДокументПрием.Проведен = ИСТИНА
	        |	И ДокументПрием.Контрагент = &Контрагент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СтартоваяТаблицаПриемов.Прием КАК Прием,
	        |	СтартоваяТаблицаПриемов.ДатаПриема КАК ДатаПриема,
	        |	СтартоваяТаблицаПриемов.Номер КАК Номер,
	        |	СтартоваяТаблицаПриемов.Контрагент КАК Контрагент
	        |ПОМЕСТИТЬ БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы
	        |ИЗ
	        |	СтартоваяТаблицаПриемов КАК СтартоваяТаблицаПриемов
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	СтартоваяТаблицаПриемов.Прием,
	        |	СтартоваяТаблицаПриемов.Контрагент,
	        |	СтартоваяТаблицаПриемов.ДатаПриема,
	        |	СтартоваяТаблицаПриемов.Номер
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Прием КАК Прием,
	        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.ДатаПриема КАК ДатаПриема,
	        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Контрагент КАК Контрагент,
	        |	КОЛИЧЕСТВО(БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.Прием) КАК НомерПоПорядку
	        |ПОМЕСТИТЬ ТаблицаПриемовПациаентовСНумерацией
	        |ИЗ
	        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы КАК БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы КАК БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1
	        |		ПО БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.ДатаПриема >= БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.ДатаПриема
	        |			И (ВЫБОР
	        |				КОГДА БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.ДатаПриема = БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.ДатаПриема
	        |					ТОГДА БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Номер >= БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.Номер
	        |				ИНАЧЕ ИСТИНА
	        |			КОНЕЦ)
	        |			И БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Контрагент = БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.Контрагент
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Прием,
	        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.ДатаПриема,
	        |	БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы.Контрагент
	        |
	        |ИМЕЮЩИЕ
	        |	КОЛИЧЕСТВО(БазоваяТаблицаИнициацииПостоянныхСанированныеПриемы1.Прием) = 2
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТаблицаПриемовПациаентовСНумерацией.Контрагент КАК Контрагент,
	        |	ТаблицаПриемовПациаентовСНумерацией.ДатаПриема КАК ДатаПриема,
	        |	ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Постоянный) КАК Статус
	        |ПОМЕСТИТЬ ТаблицаПостоянныхПациентов
	        |ИЗ
	        |	ТаблицаПриемовПациаентовСНумерацией КАК ТаблицаПриемовПациаентовСНумерацией
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СтартоваяТаблицаПриемов.Контрагент КАК Контрагент,
	        |	МИНИМУМ(СтартоваяТаблицаПриемов.ДатаПриема) КАК ДатаПриема,
	        |	ЗНАЧЕНИЕ(перечисление.статусыКонтрагентов.Первичный) КАК Статус
	        |ПОМЕСТИТЬ ТаблицаНовыхПациентов
	        |ИЗ
	        |	СтартоваяТаблицаПриемов КАК СтартоваяТаблицаПриемов
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПриемовПациаентовСНумерацией КАК ТаблицаПостоянных
	        |		ПО СтартоваяТаблицаПриемов.Контрагент = ТаблицаПостоянных.Контрагент
	        |ГДЕ
	        |	ТаблицаПостоянных.Контрагент ЕСТЬ NULL
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	СтартоваяТаблицаПриемов.Контрагент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	МАКСИМУМ(ВЫБОР
	        |			КОГДА ТаблицаСделок.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
	        |				ТОГДА ТаблицаСделок.ДатаСделки
	        |			ИНАЧЕ ТаблицаСделок.ДатаЗавершенияСделки
	        |		КОНЕЦ) КАК ДатаПоследнейСделкиНовыйПациент,
	        |	ТаблицаСделок.Контрагент КАК Контрагент,
	        |	ЗНАЧЕНИЕ(перечисление.статусыКонтрагентов.Отказ) КАК Статус
	        |ПОМЕСТИТЬ ПоследниеСделкиПациентовСОтказом
	        |ИЗ
	        |	ТаблицаСделокПациентаСОтказом КАК ТаблицаСделок
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ТаблицаСделок.Контрагент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СтартоваяТаблицаПриемов.Контрагент КАК Контрагент,
	        |	МАКСИМУМ(СтартоваяТаблицаПриемов.ДатаПриема) КАК ДатаПриема
	        |ПОМЕСТИТЬ ПоследниеПриемыПациентов
	        |ИЗ
	        |	СтартоваяТаблицаПриемов КАК СтартоваяТаблицаПриемов
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	СтартоваяТаблицаПриемов.Контрагент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПоследниеПриемыПациентов.Контрагент КАК Контрагент,
	        |	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ПоследниеПриемыПациентов.ДатаПриема, ДЕНЬ), ДЕНЬ, &ДнейОтсутствия) КАК Дата,
	        |	ЗНАЧЕНИЕ(перечисление.статусыКонтрагентов.НеВернувшийся) КАК Статус
	        |ПОМЕСТИТЬ ТаблицаНеВернувшихсяПациентов
	        |ИЗ
	        |	ПоследниеПриемыПациентов КАК ПоследниеПриемыПациентов
	        |ГДЕ
	        |	ПоследниеПриемыПациентов.ДатаПриема < &ГраницаПериодаНеактивности
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТаблицаНовыхПациентов.Контрагент КАК Контрагент,
	        |	ТаблицаНовыхПациентов.ДатаПриема КАК Дата
	        |ПОМЕСТИТЬ СтатусыКромеПотенциальныхИОтказ
	        |ИЗ
	        |	ТаблицаНовыхПациентов КАК ТаблицаНовыхПациентов
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ТаблицаПостоянныхПациентов.Контрагент,
	        |	ТаблицаПостоянныхПациентов.ДатаПриема
	        |ИЗ
	        |	ТаблицаПостоянныхПациентов КАК ТаблицаПостоянныхПациентов
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ТаблицаНеВернувшихсяПациентов.Контрагент,
	        |	ТаблицаНеВернувшихсяПациентов.Дата
	        |ИЗ
	        |	ТаблицаНеВернувшихсяПациентов КАК ТаблицаНеВернувшихсяПациентов
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СтатусыКромеПотенциальныхИОтказ.Контрагент КАК Контрагент,
	        |	МАКСИМУМ(СтатусыКромеПотенциальныхИОтказ.Дата) КАК Дата
	        |ПОМЕСТИТЬ АктуальныеДатыСтатусовКонтрагентов
	        |ИЗ
	        |	СтатусыКромеПотенциальныхИОтказ КАК СтатусыКромеПотенциальныхИОтказ
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	СтатусыКромеПотенциальныхИОтказ.Контрагент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Контрагенты.Ссылка КАК Контрагент,
	        |	Контрагенты.ДатаРегистрации КАК ДатаРегистрации
	        |ПОМЕСТИТЬ ПотенциальныеИОтказ
	        |ИЗ
	        |	Справочник.Контрагенты КАК Контрагенты
	        |ГДЕ
	        |	НЕ Контрагенты.Ссылка В
	        |				(ВЫБРАТЬ
	        |					СтатусыКромеПотенциальныхИОтказ.Контрагент КАК Контрагент
	        |				ИЗ
	        |					СтатусыКромеПотенциальныхИОтказ КАК СтатусыКромеПотенциальныхИОтказ)
	        |	И Контрагенты.ЭтоГруппа = ЛОЖЬ
	        |	И Контрагенты.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты)
	        |	И Контрагенты.Ссылка = &Контрагент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПотенциальныеИОтказ.ДатаРегистрации КАК ДатаРегистрации,
	        |	ПотенциальныеИОтказ.Контрагент КАК Контрагент,
	        |	ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Потенциальный) КАК Статус
	        |ПОМЕСТИТЬ Потенциальные
	        |ИЗ
	        |	ПотенциальныеИОтказ КАК ПотенциальныеИОтказ
	        |ГДЕ
	        |	НЕ ПотенциальныеИОтказ.Контрагент В
	        |				(ВЫБРАТЬ
	        |					ПоследниеСделкиПациентовСОтказом.Контрагент КАК Контрагент
	        |				ИЗ
	        |					ПоследниеСделкиПациентовСОтказом КАК ПоследниеСделкиПациентовСОтказом)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПоследниеСделкиПациентовСОтказом.Контрагент КАК Контрагент,
	        |	ПоследниеСделкиПациентовСОтказом.ДатаПоследнейСделкиНовыйПациент КАК Период,
	        |	ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Отказ) КАК Статус
	        |ИЗ
	        |	ПотенциальныеИОтказ КАК ПотенциальныеИОтказ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследниеСделкиПациентовСОтказом КАК ПоследниеСделкиПациентовСОтказом
	        |		ПО ПотенциальныеИОтказ.Контрагент = ПоследниеСделкиПациентовСОтказом.Контрагент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	Потенциальные.Контрагент,
	        |	Потенциальные.ДатаРегистрации,
	        |	Потенциальные.Статус
	        |ИЗ
	        |	Потенциальные КАК Потенциальные
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	АктуальныеДатыСтатусовКонтрагентов.Контрагент,
	        |	АктуальныеДатыСтатусовКонтрагентов.Дата,
	        |	ВЫБОР
	        |		КОГДА НЕ ТаблицаНеВернувшихсяПациентов.Статус ЕСТЬ NULL
	        |			ТОГДА ТаблицаНеВернувшихсяПациентов.Статус
	        |		КОГДА НЕ ТаблицаНовыхПациентов.Статус ЕСТЬ NULL
	        |			ТОГДА ТаблицаНовыхПациентов.Статус
	        |		КОГДА НЕ ТаблицаПостоянныхПациентов.Статус ЕСТЬ NULL
	        |			ТОГДА ТаблицаПостоянныхПациентов.Статус
	        |	КОНЕЦ
	        |ИЗ
	        |	АктуальныеДатыСтатусовКонтрагентов КАК АктуальныеДатыСтатусовКонтрагентов
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНовыхПациентов КАК ТаблицаНовыхПациентов
	        |		ПО АктуальныеДатыСтатусовКонтрагентов.Контрагент = ТаблицаНовыхПациентов.Контрагент
	        |			И АктуальныеДатыСтатусовКонтрагентов.Дата = ТаблицаНовыхПациентов.ДатаПриема
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПостоянныхПациентов КАК ТаблицаПостоянныхПациентов
	        |		ПО АктуальныеДатыСтатусовКонтрагентов.Контрагент = ТаблицаПостоянныхПациентов.Контрагент
	        |			И АктуальныеДатыСтатусовКонтрагентов.Дата = ТаблицаПостоянныхПациентов.ДатаПриема
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНеВернувшихсяПациентов КАК ТаблицаНеВернувшихсяПациентов
	        |		ПО АктуальныеДатыСтатусовКонтрагентов.Контрагент = ТаблицаНеВернувшихсяПациентов.Контрагент
	        |			И АктуальныеДатыСтатусовКонтрагентов.Дата = ТаблицаНеВернувшихсяПациентов.Дата";

#КонецОбласти

КонецФункции

// Функция - Получить текст запроса текущих статусов
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТекстЗапросаТекущихСтатусов(ИспользоватьМВТ = Ложь) Экспорт

	Если ИспользоватьМВТ Тогда 
		Возврат "ВЫБРАТЬ
		        |	СтатусыКонтрагентов.Период КАК Период,
		        |	СтатусыКонтрагентов.Контрагент КАК Контрагент,
		        |	СтатусыКонтрагентов.Статус КАК Статус
		        |ИЗ
		        |	РегистрСведений.СтатусыКонтрагентов КАК СтатусыКонтрагентов
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаКонтрагентов КАК ТаблицаКонтрагентов
		        |		ПО СтатусыКонтрагентов.Контрагент = ТаблицаКонтрагентов.Контрагент
		        |
		        |УПОРЯДОЧИТЬ ПО
		        |	Контрагент,
		        |	Период";
	Иначе 	
		Возврат "ВЫБРАТЬ
		        |	СтатусыКонтрагентов.Период КАК Период,
		        |	СтатусыКонтрагентов.Контрагент КАК Контрагент,
		        |	СтатусыКонтрагентов.Статус КАК Статус
		        |ИЗ
		        |	РегистрСведений.СтатусыКонтрагентов КАК СтатусыКонтрагентов
		        |ГДЕ
		        |	СтатусыКонтрагентов.Контрагент = &Контрагент
		        |
		        |УПОРЯДОЧИТЬ ПО
		        |	Контрагент,
		        |	Период";
	КонецЕсли;
	
КонецФункции

// Процедура - Удалить статус клиента
//
// Параметры:
//  СтруктураЗаписи	 - 	 - 
//
Процедура УдалитьСтатусКлиента(СтруктураЗаписи, ИспользоватьБизнесЛогику = Ложь, ИспользоватьБлокировкуЗаписи = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураЗаписи.Период) ИЛИ НЕ ЗначениеЗаполнено(СтруктураЗаписи.Контрагент) Тогда 
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(СтруктураЗаписи.Период);
	НаборЗаписей.Отбор.Контрагент.Установить(СтруктураЗаписи.Контрагент);	
	
	Если НЕ ИспользоватьБизнесЛогику Тогда 
		НаборЗаписей.ОбменДанными.Загрузка = Истина;	
	КонецЕсли;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение 
		Возврат;
	КонецПопытки;	
	
КонецПроцедуры

// Процедура - Записать актуальный статус клиента
//
// Параметры:
//  СтруктураЗаписи	 - 	 - 
//
Процедура ЗаписатьАктуальныйСтатусКлиента(СтруктураЗаписи, ИспользоватьБизнесЛогику = Ложь, ИспользоватьБлокировкуЗаписи = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураЗаписи.Период) ИЛИ НЕ ЗначениеЗаполнено(СтруктураЗаписи.Контрагент) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьБлокировкуЗаписи Тогда 	
		
		НачатьТранзакцию();
		
		Попытка
			
			НаборЗаписей = СоздатьНаборЗаписей(); 
			
			НаборЗаписей.Отбор.Период.Установить(СтруктураЗаписи.Период);
			НаборЗаписей.Отбор.Контрагент.Установить(СтруктураЗаписи.Контрагент);
			
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.СтатусыКонтрагентов");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("Контрагент"			, СтруктураЗаписи.Контрагент);			
			БлокировкаДанных.Заблокировать();
			
			Если НЕ ИспользоватьБизнесЛогику Тогда 
				НаборЗаписей.ОбменДанными.Загрузка = Истина;	
			КонецЕсли;
			
			НаборЗаписей.Записать();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
		КонецПопытки;
		
	Иначе 
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(СтруктураЗаписи.Период);
		НаборЗаписей.Отбор.Контрагент.Установить(СтруктураЗаписи.Контрагент);
		
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), СтруктураЗаписи);
		
		Если НЕ ИспользоватьБизнесЛогику Тогда 
			НаборЗаписей.ОбменДанными.Загрузка = Истина;	
		КонецЕсли;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение 
			
		КонецПопытки;
		
	КонецЕсли;
	
	// Актуализация статуса в регистре "КонтрагентыСведенияДляСписка".
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтруктураЗаписи, "Статус") И ЗначениеЗаполнено(СтруктураЗаписи.Статус) Тогда
		ОбновляемыеДанные = Новый Структура("Статус", СтруктураЗаписи.Статус);
		РегистрыСведений.КонтрагентыСведенияДляСписка.АктуализироватьНеобходимыеДанныеВСведенияхДляСписка(СтруктураЗаписи.Контрагент, ОбновляемыеДанные);		
	КонецЕсли;

КонецПроцедуры	

// Функция - Получить статус клиента
//
// Параметры:
//  Контрагент	 - 	 - 
//  Период		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтатусКлиента(Контрагент
							, Период = Неопределено
							, АктуализироватьДляСписка = Ложь
							, СтатусПоУмолчанию = Неопределено) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент"			, Контрагент);
	Запрос.УстановитьПараметр("Период"				, Период);						  
	
	Если АктуализироватьДляСписка Тогда 
		Запрос.Текст = "ВЫБРАТЬ
		               |	СтатусыКонтрагентовСрезПоследних.Контрагент КАК Контрагент,
		               |	СтатусыКонтрагентовСрезПоследних.Статус КАК Статус,
		               |	СтатусыКонтрагентовСрезПоследних.Период КАК Период
		               |ИЗ
		               |	РегистрСведений.СтатусыКонтрагентов.СрезПоследних(&Период, Контрагент = &Контрагент) КАК СтатусыКонтрагентовСрезПоследних
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтрагентыСведенияДляСписка КАК КонтрагентыСведенияДляСписка
		               |		ПО СтатусыКонтрагентовСрезПоследних.Контрагент = КонтрагентыСведенияДляСписка.Контрагент
		               |ГДЕ
		               |	СтатусыКонтрагентовСрезПоследних.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |	И ЕСТЬNULL(КонтрагентыСведенияДляСписка.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)) <> СтатусыКонтрагентовСрезПоследних.Статус";
	Иначе 	
		Запрос.Текст = "ВЫБРАТЬ
		               |	СтатусыКонтрагентовСрезПоследних.Контрагент КАК Контрагент,
		               |	СтатусыКонтрагентовСрезПоследних.Статус КАК Статус,
		               |	СтатусыКонтрагентовСрезПоследних.Период КАК Период
		               |ИЗ
		               |	РегистрСведений.СтатусыКонтрагентов.СрезПоследних(&Период, Контрагент = &Контрагент) КАК СтатусыКонтрагентовСрезПоследних
		               |ГДЕ
		               |	СтатусыКонтрагентовСрезПоследних.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";
		
	КонецЕсли;

	РезультатВыборка = Запрос.Выполнить().Выбрать();
	Если РезультатВыборка.Следующий() Тогда
		Возврат РезультатВыборка.Статус;
	Иначе
		АктуализироватьДляСписка = Ложь;
		Если ЗначениеЗаполнено(СтатусПоУмолчанию) Тогда 
			Возврат СтатусПоУмолчанию;
		Иначе 	
			Возврат Перечисления.СтатусыКонтрагентов.ПустаяСсылка();
		КонецЕсли;	
	КонецЕсли; 
	
КонецФункции

// Функция - Определить статус контрагента
//
// Параметры:
//  мПараметры	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОпределитьСтатусКонтрагента(мПараметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Продажи.ДокументПродажи КАК ДокументПродажи
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Контрагент = &Контрагент
	|	И Продажи.Период < &Дата
	|	И Продажи.Регистратор ССЫЛКА Документ.Прием";
						  
	Запрос.УстановитьПараметр("Контрагент", мПараметры.Контрагент);
	Запрос.УстановитьПараметр("Дата", мПараметры.Дата);

	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		ПланируемыйСтатус = Перечисления.СтатусыКонтрагентов.Постоянный;
	Иначе
		ПланируемыйСтатус = Перечисления.СтатусыКонтрагентов.Первичный;
	КонецЕсли;
			
	Возврат ПланируемыйСтатус;

КонецФункции

// Удаляет движения регистра сведения СтатусыКонтрагентов.
//  Параметры:
//   ДокументДвижения - Документ, который производил движение по регистру;
//
Процедура УдалениеСтатусаПациента(СтруктураЗаписи) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураЗаписи.Период) ИЛИ НЕ ЗначениеЗаполнено(СтруктураЗаписи.Контрагент) Тогда 
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СтатусыКонтрагентов.Период КАК Период,
	               |	СтатусыКонтрагентов.Контрагент КАК Контрагент,
	               |	СтатусыКонтрагентов.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.СтатусыКонтрагентов КАК СтатусыКонтрагентов
	               |ГДЕ
	               |	СтатусыКонтрагентов.Период = &Период
	               |	И СтатусыКонтрагентов.Контрагент = &Контрагент";

	Запрос.УстановитьПараметр("Период"		, СтруктураЗаписи.Период);
	Запрос.УстановитьПараметр("Контрагент"	, СтруктураЗаписи.Контрагент); 
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();

		Пока Выборка.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.СтатусыКонтрагентов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
			НаборЗаписей.Отбор.Контрагент.Установить(Выборка.Контрагент);
			НаборЗаписей.Записать();
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
	
#КонецЕсли













