
#Область СлужебныйПрограммныйИнтерфейс

// Процедура - При записи
//
// Параметры:
//  Отказ		 - 	 - 
//  Замещение	 - 	 - 
//
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;	
	
	// Если ЭтотОбъект.Количество() > 0 Тогда 
	//	Для Каждого Запись Из ЭтотОбъект Цикл
	//		// Если НЕ Запись.Контрагент.ЭтоГруппа И ЗначениеЗаполнено(Запись.Контрагент) Тогда
	//		Если ЗначениеЗаполнено(Запись.Контрагент) И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Контрагент, "ЭтоГруппа") Тогда
	//			// Перехватываем и дозаписываем в регистр.
	//			РегистрыСведений.КонтрагентыСведенияДляСписка.АктуализироватьСтатусКлиента(Запись.Контрагент, Запись.Статус);
	//		КонецЕсли;	
	//	КонецЦикла;	
	// Иначе // Похоже что это удаление неактуального статуса. Необходимо также обновить статус в регистре СведенияКонтрагентыДляСписка
	//	ЭлементОтбораКонтрагент = ЭтотОбъект.Отбор.Найти("Контрагент");
	//	Если ЭлементОтбораКонтрагент <> Неопределено И ЗначениеЗаполнено(ЭлементОтбораКонтрагент.Значение) Тогда 
	//		АктуализироватьСтатусДляСписка = Истина;
	//		ТекущийАктуальныйСтатус = РегистрыСведений.СтатусыКонтрагентов.ПолучитьСтатусКлиента(ЭлементОтбораКонтрагент.Значение, , АктуализироватьСтатусДляСписка);
	//	    Если АктуализироватьСтатусДляСписка И ЗначениеЗаполнено(ТекущийАктуальныйСтатус) Тогда 
	//			РегистрыСведений.КонтрагентыСведенияДляСписка.АктуализироватьСтатусКлиента(ЭлементОтбораКонтрагент.Значение, ТекущийАктуальныйСтатус);
	//		КонецЕсли;
	//	КонецЕсли;	
	// КонецЕсли;

КонецПроцедуры

#КонецОбласти