#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
// Обработчик события "ПриСозданииНаСервере" объекта.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.ДатаНачала = ТекущаяДатаСеанса();
	КонецЕсли;
	ЭтаФорма.ТолькоПросмотр = Истина;
	Элементы.Приемы.Видимость = Не Объект.Ссылка.Пустая();
	Приемы.Параметры.УстановитьЗначениеПараметра("ЛечениеВрача", Объект.Ссылка);
    Приемы.Параметры.УстановитьЗначениеПараметра("Контрагент"  , Объект.Контрагент);
	Приемы.Параметры.УстановитьЗначениеПараметра("Сотрудник"   , Объект.Сотрудник);
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);

КонецПроцедуры 

&НаСервере
// Обработчик события "ПриЧтенииНаСервере" объекта.
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
КонецПроцедуры

&НаСервере
// Обработчик события "ПослеЗаписиНаСервере" объекта.
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
КонецПроцедуры

#КонецОбласти
