
#Область СлужебныйПрограммныйИнтерфейс

// Функция - Вернет сегменты содержащие переданный объект
//
// Параметры:
//  ОбъектСегмента	 - 	 - 
// Возвращаемое значение:
//   - 
Функция СегментыСодержащиеоОбъект(ОбъектСегмента) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставСегментов.Сегмент
	|ИЗ
	|	РегистрСведений.СоставСегментов КАК СоставСегментов
	|ГДЕ
	|	СоставСегментов.ОбъектСегмента = &ОбъектСегмента
	|	И СоставСегментов.Сегмент.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	СоставСегментов.Сегмент");
	
	Запрос.УстановитьПараметр("ОбъектСегмента", ОбъектСегмента);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сегмент");
	
КонецФункции

// Функция - вернет состав переданного сегмента
//
// Параметры:
//  Сегмент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоставСегмента(Сегмент) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставСегментов.ОбъектСегмента
	|ИЗ
	|	РегистрСведений.СоставСегментов КАК СоставСегментов
	|ГДЕ
	|	СоставСегментов.Сегмент = &ОбъектСегмента");
	
	Запрос.УстановитьПараметр("ОбъектСегмента", Сегмент);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОбъектСегмента");

КонецФункции

// Функция - Сегмент содержит объект
//
// Параметры:
//  Сегмент	 - 	 - 
//  Объект	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СегментСодержитОбъект(Сегмент, Объект) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставСегментов.Сегмент
	|ИЗ
	|	РегистрСведений.СоставСегментов КАК СоставСегментов
	|ГДЕ
	|	СоставСегментов.ОбъектСегмента = &ОбъектСегмента
	|	И СоставСегментов.Сегмент = &Сегмент");

	Запрос.УстановитьПараметр("Сегмент"       , Сегмент);
	Запрос.УстановитьПараметр("ОбъектСегмента", Объект);

	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

// Функция, сегмент содержит массив объектов.
//
Функция СегментСодержитМассивОбъектов(Сегмент, МассивОбъектов, ВернутьМассивНайденных = Ложь) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставСегментов.ОбъектСегмента КАК ОбъектСегмента
	|ИЗ
	|	РегистрСведений.СоставСегментов КАК СоставСегментов
	|ГДЕ
	|	СоставСегментов.ОбъектСегмента В(&МассивОбъектов)
	|	И СоставСегментов.Сегмент = &Сегмент");

	Запрос.УстановитьПараметр("Сегмент"       , Сегмент);
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	МассивОбъектовИзСегмента = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОбъектСегмента");
	
	Если ВернутьМассивНайденных Тогда 
		Возврат МассивОбъектовИзСегмента;
	Иначе 
		Если МассивОбъектовИзСегмента.Количество() = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Для Каждого Объект Из МассивОбъектов Цикл
			Если МассивОбъектовИзСегмента.Найти(Объект) = Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Возврат Истина;
	КонецЕсли;

КонецФункции

// Функция - Пересчение состава сегментов
//
// Параметры:
//  МассивСегментов	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПересчениеСоставаСегментов(МассивСегментов) Экспорт
	
	Запрос = Новый Запрос;
	
	ТелоЗапроса =
	"ВЫБРАТЬ
	|	СоставСегментов.ОбъектСегмента
	|ИЗ
	|	РегистрСведений.СоставСегментов КАК СоставСегментов";
	
	УсловиеЗапроса = 
	" ГДЕ
	|	СоставСегментов.Сегмент = &Сегмент";

	Запрос.УстановитьПараметр("Сегмент", МассивСегментов[0]); 
		
	Для Индекс = 1 По МассивСегментов.Количество() - 1 Цикл
		
		ТелоЗапроса = ТелоЗапроса + 
		" ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставСегментов КАК СоставСегментов" + Индекс +
		"		ПО СоставСегментов.ОбъектСегмента = СоставСегментов" + Индекс + ".ОбъектСегмента";
		
		УсловиеЗапроса = УсловиеЗапроса + " И СоставСегментов" + Индекс + ".Сегмент = &Сегмент" + Индекс;
		
		Запрос.УстановитьПараметр("Сегмент" + Индекс, МассивСегментов[Индекс]); 
		Индекс = Индекс + 1;
		
	КонецЦикла;                                                                   

	Запрос.Текст = ТелоЗапроса + УсловиеЗапроса;
    Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОбъектСегмента");	
	
КонецФункции

// Функция - Состав сегмента номенклатуры виды услуг
//
// Параметры:
//  Сегмент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВидыУслугСоставаСегментаНоменклатуры(СегментНоменклатуры) Экспорт
	
	Запрос = Новый Запрос;	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставСегментов.ВидУслуги КАК ВидУслуги,
	|	ВЫБОР
	|		КОГДА СоставСегментов.ВидУслуги = ЗНАЧЕНИЕ(Перечисление.ВидыУслугНоменклатуры.ПерсональныеЗанятия)
	|			ТОГДА 0
	|		КОГДА СоставСегментов.ВидУслуги = ЗНАЧЕНИЕ(Перечисление.ВидыУслугНоменклатуры.ГрупповыеЗанятия)
	|			ТОГДА 1
	|		КОГДА СоставСегментов.ВидУслуги = ЗНАЧЕНИЕ(Перечисление.ВидыУслугНоменклатуры.АрендаЗала)
	|			ТОГДА 2
	|	КОНЕЦ КАК Индекс
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ВЫРАЗИТЬ(СоставСегментов.ОбъектСегмента КАК Справочник.Номенклатура).ВидУслуги КАК ВидУслуги
	|	ИЗ
	|		РегистрСведений.СоставСегментов КАК СоставСегментов
	|	ГДЕ
	|		СоставСегментов.Сегмент ССЫЛКА Справочник.СегментыНоменклатуры
	|		И СоставСегментов.Сегмент = &Сегмент
	|		И СоставСегментов.ОбъектСегмента ССЫЛКА Справочник.Номенклатура) КАК СоставСегментов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Индекс";
	
	Запрос.УстановитьПараметр("Сегмент", СегментНоменклатуры);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидУслуги");

КонецФункции

// Функция - Вернуть состав сегмента сотрудников
//
// Параметры:
//  СегментСотрудников	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьСоставСегментаСотрудников(СегментСотрудников) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставСегментов.ОбъектСегмента КАК Сотрудник
	|ИЗ
	|	РегистрСведений.СоставСегментов КАК СоставСегментов
	|ГДЕ
	|	СоставСегментов.Сегмент = &Сегмент
	|	И НЕ СоставСегментов.ОбъектСегмента.ПометкаУдаления
	|	И СоставСегментов.ОбъектСегмента.Служебный = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	СоставСегментов.ОбъектСегмента.Наименование";
	
	Запрос.УстановитьПараметр("Сегмент", СегментСотрудников);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");		
	
КонецФункции

// Функция - Вернуть состав сегмента сотрудников таблицей
//
// Параметры:
//  СегментСотрудников	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьСоставСегментаСотрудниковТаблицей(СегментСотрудников) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	СоставСегментов.ОбъектСегмента КАК ОбъектСегмента
	               |ПОМЕСТИТЬ ТаблицаОбъектовСегмента
	               |ИЗ
	               |	РегистрСведений.СоставСегментов КАК СоставСегментов
	               |ГДЕ
	               |	СоставСегментов.Сегмент = &Сегмент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ТаблицаОбъектовСегмента.ОбъектСегмента КАК Сотрудник,
	               |	ТаблицаОбъектовСегмента.ОбъектСегмента.Наименование КАК Наименование,
	               |	ТаблицаОбъектовСегмента.ОбъектСегмента.НаименованиеСокращенное КАК НаименованиеСокращенное,
	               |	ТаблицаОбъектовСегмента.ОбъектСегмента.НаименованиеСокращенное КАК Представление,
	               |	ТаблицаОбъектовСегмента.ОбъектСегмента.Имя КАК Имя,
	               |	ТаблицаОбъектовСегмента.ОбъектСегмента.Фамилия КАК Фамилия,
	               |	ТаблицаОбъектовСегмента.ОбъектСегмента.Отчество КАК Отчество
	               |ИЗ
	               |	ТаблицаОбъектовСегмента КАК ТаблицаОбъектовСегмента
	               |ГДЕ
	               |	ТаблицаОбъектовСегмента.ОбъектСегмента.ПометкаУдаления = ЛОЖЬ
	               |	И ТаблицаОбъектовСегмента.ОбъектСегмента.ЭтоГруппа = ЛОЖЬ
	               |	И ТаблицаОбъектовСегмента.ОбъектСегмента.Служебный = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Сегмент", СегментСотрудников);
	Если ТипЗнч(СегментСотрудников) = Тип("СправочникСсылка.СегментыСотрудников") Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СоставСегментов.ОбъектСегмента КАК ОбъектСегмента", "ВЫРАЗИТЬ(СоставСегментов.ОбъектСегмента КАК Справочник.Сотрудники) КАК ОбъектСегмента");
	ИначеЕсли ТипЗнч(СегментСотрудников) = Тип("СправочникСсылка.СегментыКонтрагентов") Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СоставСегментов.ОбъектСегмента КАК ОбъектСегмента", "ВЫРАЗИТЬ(СоставСегментов.ОбъектСегмента КАК Справочник.Контрагенты) КАК ОбъектСегмента");
	КонецЕсли;
	
	
	Возврат Запрос.Выполнить().Выгрузить();		
	
КонецФункции

#КонецОбласти
