 
 #Область ОбработчикиСобытийФормы

&НаСервере  
// Обработчик события "ПриСозданииНаСервере" объекта.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрЕдиницаОтбор = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтрЕдиницаОтбор, ЗначениеЗаполнено(СтрЕдиницаОтбор));
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
 
#Область ОбработчикиСобытийЭлементовШапкиФормы 
 
&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля СтрЕдиницаОтбор
//
Процедура СтрЕдиницаОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтрЕдиницаОтбор, ЗначениеЗаполнено(СтрЕдиницаОтбор));
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля КонтрагентОтбор
//
Процедура КонтрагентОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", КонтрагентОтбор, ЗначениеЗаполнено(КонтрагентОтбор));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура печати.
//
Процедура ДокументПечать(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "ЗаказПоставщику");	
	Структура.Вставить("МассивДокументов", Элементы.Список.ВыделенныеСтроки);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ОбработкаКоманды", УправлениеПечатьюКлиентСтоматология, Структура);									
	// ПоказатьВыборИзСписка(Оповещение, СписокПечатныхФорм, ТекущийЭлемент);
	ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, ТекущийЭлемент);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()  
	
	Возврат Документы.ЗаказПоставщику.ПолучитьСписокПечатныхФорм();	
	
КонецФункции

#КонецОбласти
