
#Область СлужебныеПроцедурыИФункции

#Область РаботаССмс

// Процедура, выполняет отправку смс сообщения.
//  Параметры:
//   ДокументСсылка: ссылка на докумет, который выполняет отправку смс.
//   
Функция СведенияОСервисеSMS(СервисSMSРассылки) Экспорт
	
	Если СервисSMSРассылки.SMSСервис = Перечисления.СервисыSMSРассылки.HelixSMS Тогда
		
		Результат = HelixSMS_СведенияОСервисеSMS();
		
	ИначеЕсли СервисSMSРассылки.SMSСервис = Перечисления.СервисыSMSРассылки.RocketSMS Тогда
		
		Результат = RocketSMS_СведенияОСервисеSMS();
		
	ИначеЕсли СервисSMSРассылки.SMSСервис = Перечисления.СервисыSMSРассылки.TurboSMS Тогда
		
		Результат = TurboSMS_СведенияОСервисеSMS();
		
	ИначеЕсли СервисSMSРассылки.SMSСервис = Перечисления.СервисыSMSРассылки.SMSC_KZ Тогда
		
		Результат = SMSC_KZ_СведенияОСервисеSMS();
		
	Иначе // Внешняя обработка сервиса рассылки
		ОписаниеОшибки = "";
		Результат = Новый Структура("Наименование, Версия, Информация, СсылкаНаСайт, СсылкаНаСайтПредставление");
		
		ОбработкаSMSРассылки = ПолучитьОбработкуСервисаSMSРассылки(СервисSMSРассылки, ОписаниеОшибки);
		Если ОбработкаSMSРассылки <> Неопределено Тогда
			Результат = ОбработкаSMSРассылки.СведенияОВнешнейОбработке();
			Результат.Наименование = ОбработкаSMSРассылки.Метаданные().Синоним;
		Иначе
			Результат.Наименование = "Ошибка";
			Результат.Информация = ОписаниеОшибки;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ОтправитьSMSСообщения()

// Процедура, выполняет отправку смс сообщения.
//  Параметры:
//   ДокументСсылка: ссылка на докумет, который выполняет отправку смс.
//   
Функция ОтправитьSMSСообщения(СервисSMSРассылки, ТекстSMS, Получатели) Экспорт
	
	Если СервисSMSРассылки.SMSСервис = Перечисления.СервисыSMSРассылки.HelixSMS Тогда
		
		Результат = HelixSMS_ОтправитьSMS(СервисSMSРассылки, ТекстSMS, Получатели);
		
	ИначеЕсли СервисSMSРассылки.SMSСервис = Перечисления.СервисыSMSРассылки.RocketSMS Тогда
		
		Результат = RocketSMS_ОтправитьSMS(СервисSMSРассылки, ТекстSMS, Получатели);
			
	ИначеЕсли СервисSMSРассылки.SMSСервис = Перечисления.СервисыSMSРассылки.TurboSMS Тогда
		
		Результат = TurboSMS_ОтправитьSMS(СервисSMSРассылки, ТекстSMS, Получатели);
		
	ИначеЕсли СервисSMSРассылки.SMSСервис = Перечисления.СервисыSMSРассылки.SMSC_KZ Тогда
		
		Результат = SMSC_KZ_ОтправитьSMS(СервисSMSРассылки, ТекстSMS, Получатели);
			
	Иначе // Внешняя обработка сервиса рассылки
		ОписаниеОшибки = "";
		Результат = СоздатьТаблицуРезульта(Получатели, Истина);
		
		ОбработкаSMSРассылки = ПолучитьОбработкуСервисаSMSРассылки(СервисSMSРассылки, ОписаниеОшибки);
		Если ОбработкаSMSРассылки <> Неопределено Тогда
			ПОПЫТКА
				ОбработкаSMSРассылки.ОтправитьSMS(ТекстSMS, Результат, Ложь);
			ИСКЛЮЧЕНИЕ
				Результат.ЗаполнитьЗначения(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), "СтатусСообщения");
			КОНЕЦПОПЫТКИ
		Иначе
			Результат.ЗаполнитьЗначения(ОписаниеОшибки, "СтатусСообщения");
		КонецЕсли;
		
		// Приводим к новому механизму
		Для каждого СтрокаТЗ Из Результат Цикл
			Если СтрокаТЗ.СтатусДействия = -1 ИЛИ СтрокаТЗ.СтатусДействия = -2 Тогда
				СтрокаТЗ.СтадияДоставки = Перечисления.СтадииДоставкиSMSСообщений.ОшибкаДоставки;
			ИначеЕсли СтрокаТЗ.СтатусДействия = 0 И СтрокаТЗ.IDСообщения <> "" Тогда
				СтрокаТЗ.СтадияДоставки = Перечисления.СтадииДоставкиSMSСообщений.ВРежимеДоставки;
			ИначеЕсли СтрокаТЗ.СтатусДействия = 1 Тогда
				СтрокаТЗ.СтадияДоставки = Перечисления.СтадииДоставкиSMSСообщений.СообщениеДоставлено;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ОтправитьSMSСообщения()

// Процедура, выполняет отправку смс сообщения 
//  Параметры:
//   ДокументСсылка: ссылка на докумет, который выполняет отправку смс.
//   
Функция ПолучитьСтатусыSMSСообщений(СервисSMSРассылки, IDСообщений) Экспорт

	Если СервисSMSРассылки.SMSСервис = Перечисления.СервисыSMSРассылки.HelixSMS Тогда
		
		Результат = HelixSMS_ПолучитьСтатусSMS(СервисSMSРассылки, IDСообщений);
		
	ИначеЕсли СервисSMSРассылки.SMSСервис = Перечисления.СервисыSMSРассылки.RocketSMS Тогда

		Результат = RocketSMS_ПолучитьСтатусSMS(СервисSMSРассылки, IDСообщений);

	ИначеЕсли СервисSMSРассылки.SMSСервис = Перечисления.СервисыSMSРассылки.TurboSMS Тогда

		Результат = TurboSMS_ПолучитьСтатусSMS(СервисSMSРассылки, IDСообщений);
		
	ИначеЕсли СервисSMSРассылки.SMSСервис = Перечисления.СервисыSMSРассылки.SMSC_KZ Тогда

		Результат = SMSC_KZ_ПолучитьСтатусSMS(СервисSMSРассылки, IDСообщений);

	Иначе // Внешняя обработка сервиса рассылки
		ОписаниеОшибки = "";
		Результат = СоздатьТаблицуРезульта(IDСообщений, Ложь);
		
		ОбработкаSMSРассылки = ПолучитьОбработкуСервисаSMSРассылки(СервисSMSРассылки, ОписаниеОшибки);
		Если ОбработкаSMSРассылки <> Неопределено Тогда
			ОбработкаSMSРассылки.ПолучитьСтатусSMS(Результат, Ложь);
		Иначе
			Результат.ЗаполнитьЗначения(ОписаниеОшибки, "СтатусСообщения");
		КонецЕсли;
		
		// Приводим к новому механизму
		Для каждого СтрокаТЗ Из Результат Цикл
			Если СтрокаТЗ.СтатусДействия = -1 ИЛИ СтрокаТЗ.СтатусДействия = -2 Тогда
				СтрокаТЗ.СтадияДоставки = Перечисления.СтадииДоставкиSMSСообщений.ОшибкаДоставки;
			ИначеЕсли СтрокаТЗ.СтатусДействия = 0 И СтрокаТЗ.IDСообщения <> "" Тогда
				СтрокаТЗ.СтадияДоставки = Перечисления.СтадииДоставкиSMSСообщений.ВРежимеДоставки;
			ИначеЕсли СтрокаТЗ.СтатусДействия = 1 Тогда
				СтрокаТЗ.СтадияДоставки = Перечисления.СтадииДоставкиSMSСообщений.СообщениеДоставлено;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Функция, возвращает текущий остаток денежных средств по отправке смс-сообщений.
//  Параметры:
//
Функция ПолучитьБалансАккаунтаSMS(СервисSMSРассылки) Экспорт

	Если СервисSMSРассылки.SMSСервис = Перечисления.СервисыSMSРассылки.HelixSMS Тогда
		
		Результат = HelixSMS_ПолучитьБаланс(СервисSMSРассылки);
			
	ИначеЕсли СервисSMSРассылки.SMSСервис = Перечисления.СервисыSMSРассылки.RocketSMS Тогда
		
		Результат = RocketSMS_ПолучитьБаланс(СервисSMSРассылки);
		
	ИначеЕсли СервисSMSРассылки.SMSСервис = Перечисления.СервисыSMSРассылки.TurboSMS Тогда
		
		Результат = TurboSMS_ПолучитьБаланс(СервисSMSРассылки);
		
	ИначеЕсли СервисSMSРассылки.SMSСервис = Перечисления.СервисыSMSРассылки.SMSC_KZ Тогда
		
		Результат = SMSC_KZ_ПолучитьБаланс(СервисSMSРассылки);
		
	Иначе // Внешняя обработка сервиса рассылки
		ОписаниеОшибки = "";
		Результат = Новый Структура("Баланс, Валюта, Ошибка, ОписаниеОшибки", Неопределено, "Недоступно", Ложь, "");
		
		ОбработкаSMSРассылки = ПолучитьОбработкуСервисаSMSРассылки(СервисSMSРассылки, ОписаниеОшибки);
		Если ОбработкаSMSРассылки <> Неопределено Тогда
			РезультатОбработки = ОбработкаSMSРассылки.ПолучитьБалансАккаунтаSMS(Ложь);
			РезультатОбработки.Свойство("Баланс", Результат.Баланс);
			РезультатОбработки.Свойство("Валюта", Результат.Валюта);
			Если ТипЗнч(РезультатОбработки) = Тип("Структура") И (ТипЗнч(РезультатОбработки.Баланс) = Тип("Строка") Или Не ЗначениеЗаполнено(РезультатОбработки.Баланс)) Тогда
				Результат.Баланс = 0;
				Результат.Валюта = "Недоступно";
				Результат.Ошибка = Истина;
				Результат.ОписаниеОшибки = РезультатОбработки.Баланс;
			КонецЕсли;
		Иначе
			Результат.Ошибка = Истина;
			Результат.ОписаниеОшибки = ОписаниеОшибки;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедура, выполняет отправку смс сообщения на сайт smsmm.ru.
//  Параметры:
//   ДокументСсылка: ссылка на документ, который выполняет отправку смс.
//   
Функция ПолучитьОбработкуСервисаSMSРассылки(СервисSMSРассылки, ОписаниеОшибки = "") Экспорт

	Если СервисSMSРассылки.ХранилищеОбработки.Получить() = Неопределено Тогда
		ОписаниеОшибки = "Нет доступных обработок сервисов SMS-рассылки";
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Если ТипЗнч(СервисSMSРассылки) = Тип("СправочникСсылка.СервисыРассылки") Тогда
			НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(СервисSMSРассылки, "ХранилищеОбработки");
		Иначе
			НавигационнаяСсылка = ПоместитьВоВременноеХранилище(СервисSMSРассылки.ХранилищеОбработки.Получить());
			//АдресВременногоХранилища
		КонецЕсли;
		ИмяВнешнейОбработкиСервиса = ВнешниеОбработки.Подключить(НавигационнаяСсылка, , Ложь);
		ОбработкаСервиса = ВнешниеОбработки.Создать(ИмяВнешнейОбработкиСервиса);	
	Исключение
		ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Неопределено;
	КонецПопытки;
	
	ПОПЫТКА
		СведенияОВнешнейОбработке = ОбработкаСервиса.СведенияОВнешнейОбработке();
	ИСКЛЮЧЕНИЕ
		ОписаниеОшибки = "Обработка не может быть подключена т.к. не является подлючаемой внешней обработкой!";
		Возврат Неопределено;
	КОНЕЦПОПЫТКИ;
	
	ОбработкаСервиса.Пользователь = СервисSMSРассылки.Пользователь;
	ОбработкаСервиса.Пароль = СервисSMSРассылки.Пароль;
	ОбработкаСервиса.Подпись = СервисSMSРассылки.Подпись;	
		                         
	Возврат ОбработкаСервиса;
	
КонецФункции

#КонецОбласти

#Область ОбщиеПроцедуры

// Функция - Создать таблицу результа
//
// Параметры:
//  МассивID		 - 	 - 
//  ЭтоПолучатели - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьТаблицуРезульта(МассивID = Неопределено, ЭтоПолучатели = Истина)
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("НомерТелефона");
	Результат.Колонки.Добавить("IDСообщения");
	Результат.Колонки.Добавить("СтатусСообщения");
	Результат.Колонки.Добавить("СтадияДоставки");
	Результат.Колонки.Добавить("СтатусДействия");
	
	Если МассивID <> Неопределено Тогда
		Для Каждого ЭлементМассиваID Из МассивID Цикл
			НоваяСтрока = Результат.Добавить();
						
			Если ТипЗнч(ЭлементМассиваID) = Тип("Структура") 
				И ЭлементМассиваID.Свойство("НомерТелефона") 
				И ЭлементМассиваID.Свойство("IDСообщения") Тогда
			    НоваяСтрока.НомерТелефона = ?(ЭтоПолучатели, ЭлементМассиваID, ЭлементМассиваID.НомерТелефона);
				НоваяСтрока.IDСообщения	  = ?(ЭтоПолучатели, "", ЭлементМассиваID.IDСообщения);
			Иначе
				НоваяСтрока[?(ЭтоПолучатели = Истина, "НомерТелефона", "IDСообщения")] = ЭлементМассиваID;
			КонецЕсли;

		КонецЦикла;		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция - Добавить строку в расшифровку статуса
//
// Параметры:
//  РасшировкиСтатусов	 - 	 - 
//  Код					 - 	 - 
//  Представление		 - 	 - 
//  СтадияДоставки		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ДобавитьСтрокуВРасшифровкуСтатуса(РасшировкиСтатусов, Код, Представление, СтадияДоставки = Неопределено)
	
	Если РасшировкиСтатусов = Неопределено Тогда
		РасшировкиСтатусов = Новый ТаблицаЗначений;
		РасшировкиСтатусов.Колонки.Добавить("Код");
		РасшировкиСтатусов.Колонки.Добавить("Представление");
		РасшировкиСтатусов.Колонки.Добавить("СтадияДоставки");
	КонецЕсли;
	
	НоваяСтрока = РасшировкиСтатусов.Добавить();
	НоваяСтрока.Код = Код;
	НоваяСтрока.Представление = Представление;
	НоваяСтрока.СтадияДоставки = ?(СтадияДоставки <> Неопределено, СтадияДоставки, Перечисления.СтадииДоставкиSMSСообщений.ПустаяСсылка());
	
	Возврат НоваяСтрока;
	
КонецФункции

// Функция, получает прокси стандарта SOAP по спецификации WSDL
//
Функция ПолучитьПроксиWSDL(МестоположениеWSDL, URIПространстваИменСервиса, ИмяСервиса, ИмяТочкиПодключения, ОписаниеОшибки)
	
	Попытка
		// Инициализируем данные
		Определение = Новый WSОпределения(МестоположениеWSDL);
		Прокси = Новый WSПрокси(Определение, URIПространстваИменСервиса, ИмяСервиса, ИмяТочкиПодключения);
	Исключение
		ОписаниеОшибки = "Невозможно подключиться к сервису сообщений по сертификации WSDL!" + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;
		
	Возврат Прокси;
	
КонецФункции // ПолучитьПроксиWSDL()

#КонецОбласти

#Область HelixSMS

// Функция, возвращает данные об обработке
//  
Функция HelixSMS_СведенияОСервисеSMS()
	
	РезультатСтруктура = Новый Структура("Наименование, Версия, Информация, ПоддержкаМножественнойОтправки, СсылкаНаСайт, СсылкаНаСайтПредставление");
	
	РезультатСтруктура.Наименование = "Helix SMS";
	РезультатСтруктура.Версия = "1.57";
	РезультатСтруктура.Информация = "Хеликс SMS — удобный сервис sms-рассылок по России.
		|	- Абонентская плата за услуги 0 руб, бесплатное подключение.
		|	- Самая низкая стоимость sms-сообщений.
		|	- Нет ограничений на срок годности купленных SMS.
		|	- Поддержка всех мобильных операторов России.";
	РезультатСтруктура.ПоддержкаМножественнойОтправки = Ложь;
	РезультатСтруктура.СсылкаНаСайт = "http://www.salon1c.ru/price/";
	РезультатСтруктура.СсылкаНаСайтПредставление = "www.salon1c.ru";
	
	Возврат РезультатСтруктура;
	
КонецФункции // СведенияОСервисеSMS()

// Функция, выполняет отправку смс сообщения
//  Параметры:
//   ТекстSMS: Текст, текст отправляемого сообщения.
//   МассивНомеров: Массив, Массив номеров телефонов для отправки сообщения.
//  
Функция HelixSMS_ОтправитьSMS(СервисSMSРассылки, ТекстSMS, Получатели)
	
	Результат = СоздатьТаблицуРезульта(Получатели, Истина);
	
	// Инициализируем данные
	ОписаниеОшибки = "";
	Прокси = ПолучитьПроксиWSDL("http://ws1.smsdelivery.ru/SMSWebservice.asmx?WSDL", "http://smsdelivery.ru/", "SMSWebService", "SMSWebServiceSoap", ОписаниеОшибки);
	Если Прокси = Неопределено Тогда
		Результат.ЗаполнитьЗначения(ОписаниеОшибки, "СтатусСообщения");
		Результат.ЗаполнитьЗначения(Перечисления.СтадииДоставкиSMSСообщений.ПустаяСсылка(), "СтадияДоставки");
		Возврат Результат;
	КонецЕсли;
								   
	Для Каждого ПолучательSMS Из Результат Цикл
		
		ПОПЫТКА
			
			// Отправляем и получаем ответ от сервера
			СтруктураОтветаWSПрокси = Прокси.SendMessage(СервисSMSРассылки.Пользователь, СервисSMSРассылки.Пароль, 0, 1, ПолучательSMS.НомерТелефона, СервисSMSРассылки.Подпись, ТекстSMS);
		
			// Разбираем структуру ответа
			Если СтруктураОтветаWSПрокси.Result = "OK" Тогда
				ПолучательSMS.IDСообщения = Формат(СтруктураОтветаWSПрокси.MessageID, "ЧГ=0");
			Иначе
				ПолучательSMS.СтатусСообщения = HelixSMS_РасшифровкаОтветаСервера(СтруктураОтветаWSПрокси.Result).Представление;
				ПолучательSMS.СтадияДоставки  = HelixSMS_РасшифровкаОтветаСервера(СтруктураОтветаWSПрокси.Result).СтадияДоставки;
			КонецЕсли;
			
		ИСКЛЮЧЕНИЕ
			
			ПолучательSMS.СтатусСообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ПолучательSMS.СтадияДоставки  = Перечисления.СтадииДоставкиSMSСообщений.ПустаяСсылка();
			
		КОНЕЦПОПЫТКИ
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ОтправитьSMS()

// Функция, получает статус отправленного сообщения по его ID
//  Параметры:
//   МассивIDSMS: Массив, Массив ID сообщений.
//   
Функция HelixSMS_ПолучитьСтатусSMS(СервисSMSРассылки, IDСообщений)
	
	Результат = СоздатьТаблицуРезульта(IDСообщений, Ложь);
	
	// Инициализируем данные
	ОписаниеОшибки = "";
	Прокси = ПолучитьПроксиWSDL("http://ws1.smsdelivery.ru/SMSWebservice.asmx?WSDL", "http://smsdelivery.ru/", "SMSWebService", "SMSWebServiceSoap", ОписаниеОшибки);
	Если Прокси = Неопределено Тогда
		Результат.ЗаполнитьЗначения(ОписаниеОшибки, "СтатусСообщения");
		Результат.ЗаполнитьЗначения(Перечисления.СтадииДоставкиSMSСообщений.ПустаяСсылка(), "СтадияДоставки");		
		Возврат Результат;
	КонецЕсли;	
	
	Для Каждого СтрокаIDСообщения Из Результат Цикл
		
		ПОПЫТКА
			
			// Отправляем и получаем ответ от сервера
			СтруктураОтветаWSПрокси = Прокси.GetMessageStatus(СервисSMSРассылки.Пользователь, СервисSMSРассылки.Пароль, СтрокаIDСообщения.IDСообщения);
		
			// Разбираем структуру ответа
			Если СтруктураОтветаWSПрокси.Result = "OK" Тогда
				СтрокаIDСообщения.СтатусСообщения = HelixSMS_РасшифровкаОтветаСервера(СтруктураОтветаWSПрокси.MessageStatus).Представление;
				СтрокаIDСообщения.СтадияДоставки  = HelixSMS_РасшифровкаОтветаСервера(СтруктураОтветаWSПрокси.MessageStatus).СтадияДоставки;
			Иначе
				СтрокаIDСообщения.СтатусСообщения = HelixSMS_РасшифровкаОтветаСервера(СтруктураОтветаWSПрокси.Result).Представление;
				СтрокаIDСообщения.СтадияДоставки  = HelixSMS_РасшифровкаОтветаСервера(СтруктураОтветаWSПрокси.Result).СтадияДоставки;			
			КонецЕсли;
			
		ИСКЛЮЧЕНИЕ
			
			СтрокаIDСообщения.СтатусСообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			СтрокаIDСообщения.СтадияДоставки  = Перечисления.СтадииДоставкиSMSСообщений.ВРежимеДоставки;
			
		КОНЕЦПОПЫТКИ
			
	КонецЦикла;
	
	Возврат Результат;
		
КонецФункции // ПолучитьСтатусSMS()

// Функция, выполняет отправку смс сообщения
//  Параметры:
//
Функция HelixSMS_ПолучитьБаланс(СервисSMSРассылки)
	
	Результат = Новый Структура("Баланс, Валюта, Ошибка, ОписаниеОшибки", 0, "Руб.", Ложь, "");
	
	// Инициализируем данные
	ОписаниеОшибки = "";
	Прокси = ПолучитьПроксиWSDL("http://ws1.smsdelivery.ru/SMSWebservice.asmx?WSDL", "http://smsdelivery.ru/", "SMSWebService", "SMSWebServiceSoap", ОписаниеОшибки);
	Если Прокси = Неопределено Тогда
		Результат.Ошибка = Истина;
		Результат.ОписаниеОшибки = ОписаниеОшибки;
		Возврат Результат;
	КонецЕсли;
	
	// Отправляем и получаем ответ от сервера
	СтруктураОтветаWSПрокси = Прокси.GetRoubleBalance(СервисSMSРассылки.Пользователь, СервисSMSРассылки.Пароль);
	
	// Разбираем структуру ответа
	Если СтруктураОтветаWSПрокси.Result = "OK" Тогда
		Результат.Баланс = СтруктураОтветаWSПрокси.RoubleBalance;
	Иначе
		Результат.Ошибка = Истина;
		Результат.ОписаниеОшибки = HelixSMS_РасшифровкаОтветаСервера(СтруктураОтветаWSПрокси.Result).Представление;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция, Расшифровывает ответ на сообщение полученное с сервера
//  Параметры:
//   ЗначениеПараметра: Строка, текст значения присланный сервером
//
Функция HelixSMS_РасшифровкаОтветаСервера(ЗначениеПараметра)
	
	РасшировкиСтатусов = Неопределено;
	
	ДобавитьСтрокуВРасшифровкуСтатуса(РасшировкиСтатусов, "Delivered", 	 	"Сообщение доставлено до абонента", 					Перечисления.СтадииДоставкиSMSСообщений.СообщениеДоставлено);
	ДобавитьСтрокуВРасшифровкуСтатуса(РасшировкиСтатусов, "EnRoute", 	 	"Сообщение находится в режиме отправки", 				Перечисления.СтадииДоставкиSMSСообщений.ВРежимеДоставки);
	ДобавитьСтрокуВРасшифровкуСтатуса(РасшировкиСтатусов, "EnQueue", 	 	"Сообщение находится в очереди на отправку",			Перечисления.СтадииДоставкиSMSСообщений.ВРежимеДоставки);
	ДобавитьСтрокуВРасшифровкуСтатуса(РасшировкиСтатусов, "Deleted", 	 	"Сообщение удалено", 									Перечисления.СтадииДоставкиSMSСообщений.ОшибкаДоставки);
	ДобавитьСтрокуВРасшифровкуСтатуса(РасшировкиСтатусов, "Expired", 	 	"Сообщение не доставлено", 								Перечисления.СтадииДоставкиSMSСообщений.ОшибкаДоставки);
	ДобавитьСтрокуВРасшифровкуСтатуса(РасшировкиСтатусов, "Rejected", 	 	"Сообщение не доставлено", 								Перечисления.СтадииДоставкиSMSСообщений.ОшибкаДоставки);
	ДобавитьСтрокуВРасшифровкуСтатуса(РасшировкиСтатусов, "UnDeliverable",	"Сообщение не доставлено", 								Перечисления.СтадииДоставкиSMSСообщений.ОшибкаДоставки);
	ДобавитьСтрокуВРасшифровкуСтатуса(РасшировкиСтатусов, "Unknown", 	 	"Сообщение не доставлено или неизвестная ошибка", 	  	Перечисления.СтадииДоставкиSMSСообщений.ОшибкаДоставки);
	ДобавитьСтрокуВРасшифровкуСтатуса(РасшировкиСтатусов, "Error", 	 	 	"Проверить статус не удалось или неизвестная ошибка", 	Перечисления.СтадииДоставкиSMSСообщений.ВРежимеДоставки);
	
	ДобавитьСтрокуВРасшифровкуСтатуса(РасшировкиСтатусов, "InvalidCredentials", 	"Ошибка: Неправильный логин или пароль", 			);
	ДобавитьСтрокуВРасшифровкуСтатуса(РасшировкиСтатусов, "UserDisabled", 	 		"Ошибка: Пользователь заблокирован", 				);
	ДобавитьСтрокуВРасшифровкуСтатуса(РасшировкиСтатусов, "InvalidFlashMessage", 	"Ошибка: Некорректное флэш-сообщение",				);
	ДобавитьСтрокуВРасшифровкуСтатуса(РасшировкиСтатусов, "InvalidSenderAddress", 	"Ошибка: Некорректный адрес отправителя сообщения", );
	ДобавитьСтрокуВРасшифровкуСтатуса(РасшировкиСтатусов, "InvalidReceiverAddress", "Ошибка: Некорректный номер получателя сообщения", 	);
	ДобавитьСтрокуВРасшифровкуСтатуса(РасшировкиСтатусов, "EmptyMessage", 	 		"Ошибка: Пустое сообщение", 						);
	ДобавитьСтрокуВРасшифровкуСтатуса(РасшировкиСтатусов, "TooLongMessage",			"Ошибка: Слишком длинное сообщение", 				);
	ДобавитьСтрокуВРасшифровкуСтатуса(РасшировкиСтатусов, "MessageBlocked", 	 	"Ошибка: Сообщение заблокировано анти спам-фильтром");
	ДобавитьСтрокуВРасшифровкуСтатуса(РасшировкиСтатусов, "InvalidBalance", 	 	"Ошибка: Недостаточно баланса", 					);
	ДобавитьСтрокуВРасшифровкуСтатуса(РасшировкиСтатусов, "DatabaseOffline", 	 	"Ошибка: Проблема базы данных на стороне сервиса",	);
		
	РасшифровкаСтатуса = РасшировкиСтатусов.Найти(ЗначениеПараметра, "Код");
	Если РасшифровкаСтатуса <> Неопределено Тогда
		РасшифровкаОтвета = Новый Структура("Представление, СтадияДоставки", РасшифровкаСтатуса.Представление, РасшифровкаСтатуса.СтадияДоставки);
	Иначе
		РасшифровкаОтвета = Новый Структура("Представление, СтадияДоставки", "Ошибка: '" + ЗначениеПараметра + "'", Перечисления.СтадииДоставкиSMSСообщений.ПустаяСсылка());
	КонецЕсли;
	
	Возврат РасшифровкаОтвета;
	
КонецФункции // РасшифровкаОтветаСервера()

#КонецОбласти

#Область ПроцедурыОбщегоНазначения

// Процедура перепроводит документы в исторической последовательности
//
Процедура УстановитьСервисSMSПоУмолчанию() Экспорт
	
	Если Константы.СервисSMSРассылкиПоУмолчанию.Получить().Пустая() Тогда
		СервисПоУмолчанию = Справочники.СервисыРассылки.НайтиПоРеквизиту("SMSСервис", Перечисления.СервисыSMSРассылки.HelixSMS);
		Константы.СервисSMSРассылкиПоУмолчанию.Установить(СервисПоУмолчанию);
	КонецЕсли;
		
КонецПроцедуры

// Функция возвращает все сервисы СМС-рассылки
//
Функция ПолучитьСервисыSMSрассылки(Логин = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СервисыРассылки.Ссылка КАК Ссылка,
	|	СервисыРассылки.Пользователь КАК Пользователь
	|ИЗ
	|	Справочник.СервисыРассылки КАК СервисыРассылки
	|ГДЕ
	|	СервисыРассылки.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &Логин <> НЕОПРЕДЕЛЕНО
	|				ТОГДА СервисыРассылки.Пользователь = &Логин
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ");
	
	Запрос.УстановитьПараметр("Логин", Логин);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция - Обновить информацию о модерации подписи сервиса СМС
//
Функция ОбновитьИнформациюОМодерацииПодписиСервисаСМС(СервисSMSРассылки, Форма, ИндексГруппыЗаполнения = Неопределено, ОписаниеОшибки = "") Экспорт
	
	ПовторноОбновитьИнформациюОМодерацииПодписи = Ложь;
	
	Если НЕ ЗначениеЗаполнено(СервисSMSРассылки) Тогда
		Возврат ПовторноОбновитьИнформациюОМодерацииПодписи;
	КонецЕсли;
	
	СтрокаИндекс = Формат(ИндексГруппыЗаполнения, "ЧН=; ЧГ=");
	
	ГруппаРегистрацииПодписи 	= ?(ЗначениеЗаполнено(СтрокаИндекс), Форма.Элементы["ГруппаРегистрацииПодписи_" + СтрокаИндекс], Форма.Элементы.ГруппаРегистрацииПодписи);
	ДекорацияРегистрацииПодписи = ?(ЗначениеЗаполнено(СтрокаИндекс), Форма.Элементы["ДекорацияРегистрацииПодписи_" + СтрокаИндекс], Форма.Элементы.ДекорацияРегистрацииПодписи);
	ПополнитьБаланс 			= ?(ЗначениеЗаполнено(СтрокаИндекс), Форма.Элементы["ПополнитьБаланс_" + СтрокаИндекс], Форма.Элементы.ПополнитьБаланс);
	
	ГруппаРегистрацииПодписи.Видимость = Истина;
	
	Результат = ЛичныйКабинет.ПроверитьМодерациюПодписиСервисаСМС(СервисSMSРассылки.Пользователь);

	Если Результат.ВыполненоУспешно <> Истина Тогда
		
		Если Результат.КодОшибки = 1098 Тогда
			ДекорацияРегистрацииПодписи.Заголовок = Новый ФорматированнаяСтрока(Результат.ОписаниеОшибки,, WebЦвета.Красный);
			ПополнитьБаланс.Доступность 		  = Ложь;
		Иначе
			ДекорацияРегистрацииПодписи.Заголовок = Новый ФорматированнаяСтрока("Не удалось получить информацию о подписи",, WebЦвета.Красный);
		КонецЕсли;
		
		ГруппаРегистрацииПодписи.ЦветФона  = Новый Цвет(237,237,237);
		
		ОписаниеОшибки = Результат.ОписаниеОшибки;
		Возврат ПовторноОбновитьИнформациюОМодерацииПодписи;
		
	КонецЕсли;
	
	Если Результат.ВыполненоУспешно
		И Результат.ПараметрыРезультата.result = Истина Тогда
		
		СтатусыПодписи = Результат.ПараметрыРезультата.sign_statuses;
		
		// Submitted - на модерации
		// Approved - одобрено модератором
		// NameFailed - имя отклонено модератором
		// DocumentsFailed - документы отклонены модератором
		// Rejected - отклонено модератором
		// NotPerformed - не модерировалось
		
		ПополнитьБаланс.Доступность 		  = Истина;
		ГруппаРегистрацииПодписи.ЦветФона  	  = Новый Цвет(255,215,40);
		ДекорацияРегистрацииПодписи.Заголовок = Новый ФорматированнаяСтрока(Новый ФорматированнаяСтрока("Необходимо "), Новый ФорматированнаяСтрока("зарегистрировать буквенную подпись",,,,"ЗарегестрироватьПодпись"));
		
		Если НЕ ЗначениеЗаполнено(Результат.ПараметрыРезультата.sign_statuses) Тогда
			Возврат ПовторноОбновитьИнформациюОМодерацииПодписи;
		КонецЕсли;
		
		ФорматированнаяСтрокаССсылкой = Новый ФорматированнаяСтрока(Новый ФорматированнаяСтрока("Подпись отклонена. ",, WebЦвета.Кирпичный), Новый ФорматированнаяСтрока("Повторить попытку",,,,"ПовторитьПопытку"));
		ПодписьОбрабатывается		  = Ложь;
		
		Если СтатусыПодписи.status = "NotPerformed"
			ИЛИ СтатусыПодписи.status = "Submitted" Тогда
			
			ДекорацияРегистрацииПодписи.Заголовок = "Подпись находится на модерации";
			ПодписьОбрабатывается 				  = Истина;
			
		ИначеЕсли СтатусыПодписи.status = "Approved" Тогда
			
			// Submitted - на регистрации у оператора
			// Approved - допущено оператором
			// Rejected - отклонено оператором
			// NotPerformed - не регистрировалось у оператора
			
			ПодписьНеДопущенаОператором = Ложь;
			
			Для Каждого ПодписьОператора Из СтатусыПодписи.operator_statuses Цикл
				
				Если ПодписьОператора.status = "Rejected" Тогда
					ПодписьНеДопущенаОператором = Истина;
					Прервать;
				КонецЕсли;
				
				Если ПодписьОператора.status = "NotPerformed"
					ИЛИ ПодписьОператора.status = "Submitted" Тогда
					
					ПодписьОбрабатывается = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ПодписьНеДопущенаОператором Тогда
				
				ДекорацияРегистрацииПодписи.Заголовок = ФорматированнаяСтрокаССсылкой;
				ПодписьОбрабатывается				  = Ложь;
				
			ИначеЕсли ПодписьОбрабатывается Тогда
				ДекорацияРегистрацииПодписи.Заголовок = "Подпись находится на модерации";	
			Иначе
				// Подпись одобрена
				ГруппаРегистрацииПодписи.Видимость = Ложь;
				
				ОбъектСервис 				 = СервисSMSРассылки.ПолучитьОбъект();
				ОбъектСервис.Подпись		 = СтатусыПодписи.sign;
				ОбъектСервис.ПодписьОдобрена = Истина;
				ОбъектСервис.Записать();
				
			КонецЕсли;
			
		Иначе
			
			ДекорацияРегистрацииПодписи.Заголовок = ФорматированнаяСтрокаССсылкой;
			
		КонецЕсли;
		
		ПовторноОбновитьИнформациюОМодерацииПодписи = ПодписьОбрабатывается;
		
	КонецЕсли;
	
	Возврат ПовторноОбновитьИнформациюОМодерацииПодписи;
	
КонецФункции

#КонецОбласти

#Область RocketSMS

// Функция - Rocket SMS сведения о сервисе SMS
// 
// Возвращаемое значение:
//   - 
//
Функция RocketSMS_СведенияОСервисеSMS()

	РезультатСтруктура = Новый Структура("Наименование, Версия, Информация, ПоддержкаМножественнойОтправки, СсылкаНаСайт, СсылкаНаСайтПредставление");
	
	РезультатСтруктура.Наименование = "RocketSMS";
	РезультатСтруктура.Версия       = 1;
	РезультатСтруктура.Информация   = "RocketSMS — сервис рассылок смс-сообщений.";
	РезультатСтруктура.ПоддержкаМножественнойОтправки = Ложь;
	РезультатСтруктура.СсылкаНаСайт = "http://cab.rocketsms.by/";
	РезультатСтруктура.СсылкаНаСайтПредставление = "rocketsms.by";
	
	Возврат РезультатСтруктура;

КонецФункции

// Функция, выполняет отправку смс сообщения
//  Параметры:
//   ТекстSMS: Текст, текст отправляемого сообщения.
//   МассивНомеров: Массив, Массив номеров телефонов для отправки сообщения.
//  
Функция RocketSMS_ОтправитьSMS(СервисSMSРассылки, ТекстSMS, Получатели)
	
	Результат = СоздатьТаблицуРезульта(Получатели, Истина);
								   
	Для Каждого ПолучательSMS Из Результат Цикл
		
		ПОПЫТКА
			
			ОписаниеОшибки = "";
			
			Аргументы = "&phone=" + URLEncode(ПолучательSMS.НомерТелефона) +
			            "&text=" + URLEncode(ТекстSMS) +
			            ?(Не ПустаяСтрока(СервисSMSРассылки.Подпись), "&sender=" + URLEncode(СервисSMSРассылки.Подпись), "") +
						"&priority=true";
			
			Ответ = RocketSMS_ПослатьКоманду("//simple/send/", Аргументы, СервисSMSРассылки, ОписаниеОшибки);
			
			Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				
				Результат.ЗаполнитьЗначения(ОписаниеОшибки, "СтатусСообщения");
				Результат.ЗаполнитьЗначения(Перечисления.СтадииДоставкиSMSСообщений.ПустаяСсылка(), "СтадияДоставки");
				Возврат Результат;
				
			КонецЕсли;	
			
			СтруктураОтвета = ДекодироватьИзJSON(Ответ);
				
			Если СтруктураОтвета.Свойство("error") Тогда
				
				ПолучательSMS.СтатусСообщения = "Ошибка отправки SMS (" + СтруктураОтвета.error + ")";
				ПолучательSMS.СтадияДоставки  = Перечисления.СтадииДоставкиSMSСообщений.ОшибкаДоставки;
				Возврат Результат;

			КонецЕсли;	
			
			Если СтруктураОтвета.Свойство("id") Тогда
				
				Если ТипЗнч(СтруктураОтвета.id) = Тип("Число") Тогда
					ПолучательSMS.IDСообщения = Формат(СтруктураОтвета.id, "ЧГ=0");
				Иначе
					ПолучательSMS.IDСообщения = Строка(СтруктураОтвета.id);
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтруктураОтвета.Свойство("status") Тогда
				status = СтруктураОтвета.status;
				Если status = "QUEUED" Или status = "SENT" Тогда
					СтатусСообщенияСтрока = "В редиме доставки";
					СтадияДоставки  = Перечисления.СтадииДоставкиSMSСообщений.ВРежимеДоставки;
				ИначеЕсли status = "DELIVERED"  Тогда
					СтадияДоставки = Перечисления.СтадииДоставкиSMSСообщений.СообщениеДоставлено;
					СтатусСообщенияСтрока = "Сообщение доставлено";
				ИначеЕсли status = "FAILED " Тогда
					СтадияДоставки = Перечисления.СтадииДоставкиSMSСообщений.ОшибкаДоставки;
					СтатусСообщенияСтрока = "Ошибка доставки";
				КонецЕсли;
				ПолучательSMS.СтадияДоставки  = СтадияДоставки;
				ПолучательSMS.СтатусСообщения = СтатусСообщенияСтрока;

			КонецЕсли;
			
		ИСКЛЮЧЕНИЕ
			
			ПолучательSMS.СтатусСообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ПолучательSMS.СтадияДоставки  = Перечисления.СтадииДоставкиSMSСообщений.ПустаяСсылка();
			
		КОНЕЦПОПЫТКИ
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ОтправитьSMS()

// Функция - RocketSMS послать команду
//
// Параметры:
//  Команда				 - 	 - 
//  Аргументы			 - 	 - 
//  СервисSMSРассылки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция RocketSMS_ПослатьКоманду(Команда, Аргументы = "", СервисSMSРассылки, ОписаниеОшибки) Экспорт

	Сервер = "api.rocketsms.by";
	
	Ресурс = Команда;                         
    Параметры = "username=" + СокрЛП(СервисSMSРассылки.Пользователь) + "&password=" + ПолучитьMD5(СокрЛП(URLEncode(СервисSMSРассылки.Пароль))) + Аргументы;	
	Результат = ПрочитатьАдрес(Сервер, Ресурс, Параметры, ОписаниеОшибки);                       
	
	Возврат Результат;	
	
КонецФункции 

// Функция, получает статус отправленного сообщения по его ID
//  Параметры:
//   МассивIDSMS: Массив, Массив ID сообщений.
//   
Функция RocketSMS_ПолучитьСтатусSMS(СервисSMSРассылки, IDСообщений)
	
	Результат = СоздатьТаблицуРезульта(IDСообщений, Ложь);
		
	Для Каждого СтрокаIDСообщения Из Результат Цикл
		
		ПОПЫТКА
			
			ОписаниеОшибки = "";
			Если ПустаяСтрока(СтрокаIDСообщения.IDСообщения) Тогда
				Продолжить;
			КонецЕсли;
			
			Ответ = RocketSMS_ПослатьКоманду("//simple/status/", "&id=" + URLEncode(СтрокаIDСообщения.IDСообщения), СервисSMSРассылки, ОписаниеОшибки);
			
			Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				
				СтрокаIDСообщения.СтатусСообщения = ОписаниеОшибки;
				СтрокаIDСообщения.СтадияДоставки  = Перечисления.СтадииДоставкиSMSСообщений.ВРежимеДоставки;
				
				Возврат Результат;
				
			КонецЕсли;
			
			СтруктураОтвета = ДекодироватьИзJSON(Ответ);
			
			
			Если СтруктураОтвета.Свойство("status") Тогда
				status = СтруктураОтвета.status;
				Если status = "QUEUED" Или status = "SENT" Тогда
					СтатусСообщенияСтрока = "В редиме доставки";
					СтадияДоставки  = Перечисления.СтадииДоставкиSMSСообщений.ВРежимеДоставки;
				ИначеЕсли status = "DELIVERED"  Тогда
					СтадияДоставки = Перечисления.СтадииДоставкиSMSСообщений.СообщениеДоставлено;
					СтатусСообщенияСтрока = "Сообщение доставлено";
				ИначеЕсли status = "FAILED " Тогда
					СтадияДоставки = Перечисления.СтадииДоставкиSMSСообщений.ОшибкаДоставки;
					СтатусСообщенияСтрока = "Ошибка доставки";
				КонецЕсли;
				СтрокаIDСообщения.СтадияДоставки  = СтадияДоставки;
				СтрокаIDСообщения.СтатусСообщения = СтатусСообщенияСтрока;
			Иначе
				СтрокаIDСообщения.СтатусСообщения = "Ошибка доставки";
			    СтрокаIDСообщения.СтадияДоставки  = Перечисления.СтадииДоставкиSMSСообщений.ВРежимеДоставки;
			КонецЕсли;
			
		ИСКЛЮЧЕНИЕ
			
			СтрокаIDСообщения.СтатусСообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			СтрокаIDСообщения.СтадияДоставки  = Перечисления.СтадииДоставкиSMSСообщений.ВРежимеДоставки;
			
		КОНЕЦПОПЫТКИ
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ПолучитьСтатусSMS()

// Функция, выполняет отправку смс сообщения
//  Параметры:
//
Функция RocketSMS_ПолучитьБаланс(СервисSMSРассылки)
		
	ОписаниеОшибки 	= "";
	Ответ			= RocketSMS_ПослатьКоманду("//simple/balance/",, СервисSMSРассылки, ОписаниеОшибки);
	
	Результат = Новый Структура("Баланс, Валюта, Ошибка, ОписаниеОшибки", 0, "Руб.", Ложь, "");
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		
		Результат.Ошибка         = Истина;
	    Результат.ОписаниеОшибки = ОписаниеОшибки;
		Возврат Результат;

	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ответ) Тогда
	    СтруктураОтвета = ДекодироватьИзJSON(Ответ);
		Результат.Ошибка = Ложь;
		Результат.Баланс = СтруктураОтвета.balance;
	Иначе
	    Результат.Ошибка         = Истина;
	    Результат.ОписаниеОшибки = "Неверный формат ответа";
	КонецЕсли;
		
    Возврат Результат;
	
КонецФункции

// Функция возвращает хеш строки
//
Функция ПолучитьMD5(Текст)
	
	ОбъектХеш = Новый ХешированиеДанных(ХешФункция.MD5);
	ОбъектХеш.Добавить(Текст);
	ХешСумма = СтрЗаменить(ОбъектХеш.ХешСумма, " ", "");
	Возврат ХешСумма;

КонецФункции

// Функция - Прочитать адрес
//
// Параметры:
//  Сервер			 - 	 - 
//  РесурсНаСервере	 - 	 - 
//  Параметры		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПрочитатьАдрес(Сервер, РесурсНаСервере, Параметры, ОписаниеОшибки) Экспорт
	
	ЗащищенноеСоединениеOpenSSL = Новый ЗащищенноеСоединениеOpenSSL(, );
	
	Попытка
        Соединение = Новый HTTPСоединение(Сервер,,,,,, ЗащищенноеСоединениеOpenSSL);
	Исключение
		ОписаниеОшибки = "Не удалось установить соединение с сервером:" + Символы.ПС + ИнформацияОбОшибке().Описание;
	    Возврат "";
	КонецПопытки;

	ИмяФайлаРезультата = ПолучитьИмяВременногоФайла();
	
	РесурсПараметры = РесурсНаСервере + "?" + Параметры;
	Если СтрДлина(РесурсПараметры) < 2000 Тогда // GET 
		
		Попытка
			Соединение.Получить(РесурсПараметры, ИмяФайлаРезультата);
			Соединение = Неопределено;
		Исключение 
			ОписаниеОшибки = "Не удалось получить данные с сервера";
			Возврат "";
		КонецПопытки;
			
	Иначе // POST	
		
		// Создаём файл отправки - содержимое POST-запроса. 
		ИмяФайлаОтправки = ПолучитьИмяВременногоФайла();
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.ANSI, Символы.ПС, ЛОЖЬ);
		ФайлОтправки.ЗаписатьСтроку(Параметры); 
		ФайлОтправки.Закрыть(); 

		// Формируем заголовок POST-запроса.
	    ЗаголовокHTTP = Новый Соответствие();
	    ЗаголовокHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	    ФайлОтправки = Новый Файл(ИмяФайлаОтправки); 
	    РазмерФайлаОтправки = XMLСтрока(ФайлОтправки.Размер()); 
		ЗаголовокHTTP.Вставить("Content-Length", Строка(РазмерФайлаОтправки)); 

		Попытка
	 		Соединение.ОтправитьДляОбработки(ИмяФайлаОтправки, РесурсНаСервере, ИмяФайлаРезультата, ЗаголовокHTTP);
			Соединение = Неопределено;
		Исключение 
			ОписаниеОшибки = "Не удалось получить данные с сервера:" + Символы.ПС + ИнформацияОбОшибке().Описание;
			Возврат "";
		КонецПопытки;
		
		УдалитьФайлы(ИмяФайлаОтправки);
		
	КонецЕсли;	
		
	ФайлРезультата	= Новый ЧтениеТекста(ИмяФайлаРезультата);
	Результат    	= ФайлРезультата.Прочитать();
	ФайлРезультата.Закрыть();
		
	УдалитьФайлы(ИмяФайлаРезультата);
	
	Возврат Результат;
	
КонецФункции // ПрочитатьАдрес()

// Функция - Преобразоватьв систему
//
// Параметры:
//  Число10	 - 	 - 
//  система	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПреобразоватьвСистему(Число10, система)
	
	Если система > 36 или система < 2 тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбранная система исчисления не поддерживается");
		Возврат -1;
	КонецЕсли;
	
	СтрокаЗначений = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	СтрокаСистема = "";
	Пока Число10 > 0 цикл
		РезДеления = Число10/система;
		ЧислоСистема = цел(РезДеления);
		остатокОтДеления = Число10 - система*(ЧислоСистема);
		СтрокаСистема = сред(СтрокаЗначений,остатокОтДеления+1,1)+ СтрокаСистема;
		Число10 = ?(ЧислоСистема=0,0,РезДеления); 
	КонецЦикла;
	
	//!!!!!!!!
	//[
	Нечётное = стрДлина(СтрокаСистема) - цел(стрДлина(СтрокаСистема)/2)*2;
	Если Нечётное тогда
		СтрокаСистема = "0"+СтрокаСистема;
	КонецЕсли;
	//]
	Возврат СтрокаСистема;
КонецФункции

// Функция - URLEncode
//
// Параметры:
//  Стр	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция URLEncode(Стр) Экспорт
	
	Длина=СтрДлина(Стр);
	Итог="";
	Для Н=1 По Длина Цикл
		Знак=Сред(Стр,Н,1);
		Код=КодСимвола(Знак);
		
		Если ((Знак>="a")и(Знак<="z")) или
			 ((Знак>="A")и(Знак<="Z")) или
			 ((Знак>="0")и(Знак<="9")) тогда
			Итог=Итог + Знак;
		Иначе
			Если (Код>=КодСимвола("А"))И(Код<=КодСимвола("п")) Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(208,16)+"%"+ПреобразоватьвСистему(144+Код-КодСимвола("А"),16);
			ИначеЕсли (Код>=КодСимвола("р"))И(Код<=КодСимвола("я")) Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(209,16)+"%"+ПреобразоватьвСистему(128+Код-КодСимвола("р"),16);
			ИначеЕсли (Знак="ё") Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(209,16)+"%"+ПреобразоватьвСистему(145,16);
			ИначеЕсли (Знак="Ё") Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(208,16)+"%"+ПреобразоватьвСистему(129,16);
			Иначе
				Итог=Итог+"%"+ПреобразоватьвСистему(Код,16);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Итог;
КонецФункции

#КонецОбласти

#Область TurboSMS

// Функция, возвращает сведения о сервисе рассылки.
//
Функция TurboSMS_СведенияОСервисеSMS() Экспорт
	Возврат Новый Структура("Наименование, Версия, Информация, СсылкаНаСайт, СсылкаНаСайтПредставление", "TurboSMS", "1.0", "TurboSMS — сервис рассылок смс-сообщений.", "https://turbosms.ua/", "turbosms.ua");
КонецФункции

// Функция, выполняет отправку смс сообщения
//  Параметры:
//   ТекстSMS: Текст, текст отправляемого сообщения.
//   МассивНомеров: Массив, Массив номеров телефонов для отправки сообщения.
//  
Функция TurboSMS_ОтправитьSMS(СервисSMSРассылки, ТекстSMS, Получатели)  Экспорт
	
	Результат = СоздатьТаблицуРезульта(Получатели, Истина);
		
	IdСессии = "";
	РезультатАвторизации =  Auth(СервисSMSРассылки, IdСессии);
	
	Если РезультатАвторизации.Количество() = 0 Тогда 
		Для Каждого СтрокаРезультата из Результат Цикл
			СтрокаРезультата.СтатусСообщения = "Неизвестная ошибка";
		КонецЦикла;	
		Возврат Результат;
	КонецЕсли;	
	
	Если РезультатАвторизации[0] <> "Вы успешно авторизировались" Тогда 
		Для Каждого СтрокаРезультата из Результат Цикл
			СтрокаРезультата.СтатусСообщения = РезультатАвторизации[0];
		КонецЦикла;	
		Возврат Результат;
	КонецЕсли;       
	
	SendSMS(СервисSMSРассылки, IdСессии, ТекстSMS, Результат);
	
	Возврат Результат;
	
КонецФункции

// Функция, получает статус отправленного сообщения по его ID
//  Параметры:
//   МассивIDSMS: Массив, Массив ID сообщений.
//   
функция TurboSMS_ПолучитьСтатусSMS(СервисSMSРассылки, IDСообщений) Экспорт
	
	Результат = СоздатьТаблицуРезульта(IDСообщений, Ложь);
	
	IdСессии = "";
	РезультатАвторизации = Auth(СервисSMSРассылки, IdСессии);
	
	Если РезультатАвторизации.Количество() = 0 Тогда 
		Возврат Результат;
	КонецЕсли;	
	
	Если РезультатАвторизации[0] <> "Вы успешно авторизировались" Тогда 
		Возврат Результат;
	КонецЕсли;
	
	GetMessageStatus(IdСессии, Результат);
	
	Возврат Результат;
	
КонецФункции

// Функция, выполняет получение баланса
//  Параметры:
//
Функция TurboSMS_ПолучитьБаланс(СервисSMSРассылки)  
	
	IdСессии = "";
	РезультатАвторизации = Auth(СервисSMSРассылки, IdСессии);
	
	СтрВозврата = Новый Структура("Баланс, Валюта, Ошибка, ОписаниеОшибки", 0, "Руб.", Ложь, "");
	
	Если РезультатАвторизации.Количество() = 0 Тогда 
		СтрВозврата.Ошибка			 = Истина;
		СтрВозврата.ОписаниеОшибки	 = "Неизвестная ошибка";
		Возврат СтрВозврата;
	КонецЕсли;
	
	Если РезультатАвторизации[0] <> "Вы успешно авторизировались" Тогда 
		СтрВозврата.Ошибка			 = Истина;
		СтрВозврата.ОписаниеОшибки	 = РезультатАвторизации[0];
		Возврат СтрВозврата;
	КонецЕсли;
	
	Баланс = GetCreditBalance(IdСессии);
	
	Если Баланс.Количество() = 0 Тогда 
		СтрВозврата.Ошибка			 = Истина;
		СтрВозврата.ОписаниеОшибки	 = "Неизвестная ошибка";
		Возврат СтрВозврата;
	КонецЕсли;
	
	Результат = Баланс[0];
	
	БалансЧисло = 0; 
	Попытка
		БалансЧисло = Число(Результат);
	Исключение
		БалансЧисло = Результат;
	КонецПопытки;
	
	Если БалансЧисло = 0 Тогда 
		СтрВозврата.Баланс = БалансЧисло; 
	Иначе
		СтрВозврата.Баланс = БалансЧисло;
		СтрВозврата.Валюта = "ед.";
	КонецЕсли;
	
	Возврат СтрВозврата;
	
КонецФункции

// Функция, выполняет авторизацию перед выполнением действия в TurboSMS.
//
Функция Auth(СервисSMSРассылки, IdСессии)
	
	sXML = 
	"<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:tur=""http://turbosms.in.ua/api/Turbo"">
	|	<soapenv:Header/>
	|	<soapenv:Body>
	|  	 <tur:Auth>
	|  	    <!--Optional:-->
	|  	    <tur:login>"+СокрЛП(СервисSMSРассылки.Пользователь)+"</tur:login>
	|  	    <!--Optional:-->
	|  	    <tur:password>"+СокрЛП(СервисSMSРассылки.Пароль)+"</tur:password>
	|  	 </tur:Auth>
	|	</soapenv:Body>
	|</soapenv:Envelope>";

	HTTPСоединение = Новый HTTPСоединение("turbosms.in.ua");
	
	HTTPЗапрос = Новый HTTPЗапрос("/api/soap.html");
	HTTPЗапрос.УстановитьТелоИзСтроки(sXML);
	
	Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	IdСессии = Ответ.Заголовки.Получить("Set-Cookie");
	
	Возврат РазобратьОтвет(Ответ.ПолучитьТелоКакСтроку(), "<ns1:AuthResult>", "</ns1:AuthResult>");
	
КонецФункции

// Функция, возвращает баланс аккаунта.
//
Функция GetCreditBalance(IdСессии)
	
	sXML = 
	"<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:tur=""http://turbosms.in.ua/api/Turbo"">
	|<soapenv:Header/>
	|	<soapenv:Body>
	|		<tur:GetCreditBalance/>
	|	</soapenv:Body>
	|</soapenv:Envelope>";
	
	HTTPСоединение = Новый HTTPСоединение("turbosms.in.ua");
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("COOKIE", IdСессии);
	
	HTTPЗапрос = Новый HTTPЗапрос("/api/soap.html", Заголовки);
	HTTPЗапрос.УстановитьТелоИзСтроки(sXML);
	
	Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Возврат РазобратьОтвет(Ответ.ПолучитьТелоКакСтроку(), "<ns1:GetCreditBalanceResult>", "</ns1:GetCreditBalanceResult>");
	
КонецФункции

// Процедура, выполняет отправку сообщения.
//
Процедура SendSMS(СервисSMSРассылки, IdСессии, ТекстСМС, ТаблицаРезультата)
	
	HTTPСоединение = Новый HTTPСоединение("turbosms.in.ua");
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("COOKIE", IdСессии);
	
	HTTPЗапрос = Новый HTTPЗапрос("/api/soap.html", Заголовки);

	Для Каждого СтрокаРезультата из ТаблицаРезультата Цикл
		
		sXML = 
		"<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:tur=""http://turbosms.in.ua/api/Turbo"">
		|<soapenv:Header/>
		|	<soapenv:Body>
		|  	 <tur:SendSMS>
		|		<tur:sender>"+ СокрЛП(СервисSMSРассылки.Подпись) +"</tur:sender>
		|		<tur:destination>"+СокрЛП(СтрокаРезультата.НомерТелефона)+"</tur:destination>
		|		<tur:text>"+СокрЛП(ТекстСМС) +"</tur:text>
		|		<tur:wappush></tur:wappush>
		|  	 </tur:SendSMS>
		|	</soapenv:Body>
		|</soapenv:Envelope>";
		
		HTTPЗапрос.УстановитьТелоИзСтроки(sXML);
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		МассивПараметров = РазобратьОтвет(Ответ.ПолучитьТелоКакСтроку(), "<ns1:ResultArray>", "</ns1:ResultArray>");
		Если МассивПараметров.Количество() > 0 Тогда
			СтрокаРезультата.СтатусСообщения = МассивПараметров[0];
			Если МассивПараметров[0] = "Сообщение доставлено получателю"  Тогда
				СтрокаРезультата.СтатусДействия = 1;
			КонецЕсли;	
			
			Если МассивПараметров.Количество() > 1 Тогда
				СтрокаРезультата.IDСообщения =  МассивПараметров[1];
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

// Процедура, выполняет получение статуса сообщения.
//
Процедура GetMessageStatus (IdСессии, ТаблицаРезультата)
	
	HTTPСоединение = Новый HTTPСоединение("turbosms.in.ua");
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("COOKIE", IdСессии);
	
	HTTPЗапрос = Новый HTTPЗапрос("/api/soap.html", Заголовки);
	
	Для Каждого СтрокаРезультата из ТаблицаРезультата Цикл
		Если СтрокаРезультата.СтатусДействия = 1 Тогда
			Продолжить;
		КонецЕсли;	
		
		sXML = 
		"<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:tur=""http://turbosms.in.ua/api/Turbo"">
		|<soapenv:Header/>
		|	<soapenv:Body>
		|  	 <tur:GetMessageStatus>
		|		<tur:MessageId>"+ СокрЛП(СтрокаРезультата.IDСообщения) +"</tur:MessageId>
		|  	 </tur:GetMessageStatus>
		|	</soapenv:Body>
		|</soapenv:Envelope>";
		
		HTTPЗапрос.УстановитьТелоИзСтроки(sXML);
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		МассивПараметров = РазобратьОтвет(Ответ.ПолучитьТелоКакСтроку(), "<ns1:GetMessageStatusResult>", "</ns1:GetMessageStatusResult>");
		Если МассивПараметров.Количество() > 0 Тогда
			СтрокаРезультата.СтатусСообщения = МассивПараметров[0];
			Если МассивПараметров[0] = "Сообщение доставлено получателю"  Тогда
				СтрокаРезультата.СтатусДействия = 1;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

// Функция, обрабатывает ответ.
//
Функция РазобратьОтвет(Стр, ЛеваяГраница, ПраваяГраница)
	
	МассивПараметров = новый Массив;
	
	ЕстьСтрока = Истина;
	ПозСледПоиск = 1;
	Пока ЕстьСтрока Цикл
		НачальнаяПозиция = СтрНайти(Стр, ЛеваяГраница,,ПозСледПоиск);
		ЕстьСтрока = НЕ НачальнаяПозиция = 0;
		Если ЕстьСтрока Тогда 
			НачальнаяПозиция = НачальнаяПозиция + СтрДлина(ЛеваяГраница);
			КонечнаяПозиция = СтрНайти(Стр, ПраваяГраница,, ПозСледПоиск);
			ПозСледПоиск  = КонечнаяПозиция + СтрДлина(ПраваяГраница);
			Результат = Сред(Стр, НачальнаяПозиция, КонечнаяПозиция - НачальнаяПозиция);
			МассивПараметров.Добавить(Результат);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивПараметров;
	
КонецФункции

#КонецОбласти

#Область SMSC_KZ

// Функция - SMSC KZ сведения о сервисе SMS
// 
// Возвращаемое значение:
//   - 
//
Функция SMSC_KZ_СведенияОСервисеSMS()

	РезультатСтруктура = Новый Структура("Наименование, Версия, Информация, ПоддержкаМножественнойОтправки, СсылкаНаСайт, СсылкаНаСайтПредставление");
	
	РезультатСтруктура.Наименование = "SMSC_KZ";
	РезультатСтруктура.Версия       = 1;
	РезультатСтруктура.Информация   = НСтр("ru = 'SMSC_KZ — сервис рассылок смс-сообщений.'; en = 'SMSC_KZ - SMS messaging service.'");
	РезультатСтруктура.ПоддержкаМножественнойОтправки = Истина;
	РезультатСтруктура.СсылкаНаСайт = "https://smsc.kz/";
	РезультатСтруктура.СсылкаНаСайтПредставление = "smsc.kz";
	
	Возврат РезультатСтруктура;

КонецФункции

// Функция, выполняет отправку смс сообщения
//  Параметры:
//   ТекстSMS: Текст, текст отправляемого сообщения.
//   МассивНомеров: Массив, Массив номеров телефонов для отправки сообщения.
//  
Функция SMSC_KZ_ОтправитьSMS(СервисSMSРассылки, ТекстSMS, Получатели)
	
	Результат = СоздатьТаблицуРезульта(Получатели, Истина);
	
	Для Каждого ПолучательSMS Из Результат Цикл
		
		ПОПЫТКА
			
			ОписаниеОшибки = "";
			
			Аргументы = "&phones=" + URLEncode(ПолучательSMS.НомерТелефона) +
			            "&mes=" + URLEncode(ТекстSMS) +
			            ?(Не ПустаяСтрока(СервисSMSРассылки.Подпись), "&sender=" + URLEncode(СервисSMSРассылки.Подпись), "") +
						"&fmt=3&charset=utf-8";
			Ответ = SMSC_KZ_ПослатьКоманду("/sys/send.php", Аргументы, СервисSMSРассылки, ОписаниеОшибки);
			
			Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				
				Результат.ЗаполнитьЗначения(ОписаниеОшибки, "СтатусСообщения");
				Результат.ЗаполнитьЗначения(Перечисления.СтадииДоставкиSMSСообщений.ПустаяСсылка(), "СтадияДоставки");
				Возврат Результат;
				
			КонецЕсли;	
			
			СтруктураОтвета = ДекодироватьИзJSON(Ответ);
				
			Если СтруктураОтвета.Свойство("error") Тогда
				
				ПолучательSMS.СтатусСообщения = "Ошибка отправки SMS (" + СтруктураОтвета.error + ")";
				ПолучательSMS.СтадияДоставки  = Перечисления.СтадииДоставкиSMSСообщений.ОшибкаДоставки;
				Возврат Результат;

			КонецЕсли;	
			
			Если СтруктураОтвета.Свойство("id") Тогда
				
				Если ТипЗнч(СтруктураОтвета.id) = Тип("Число") Тогда
					ПолучательSMS.IDСообщения = Формат(СтруктураОтвета.id, "ЧГ=0");
				Иначе
					ПолучательSMS.IDСообщения = Строка(СтруктураОтвета.id);
				КонецЕсли;
				
			КонецЕсли;
		
		ИСКЛЮЧЕНИЕ
			
			ПолучательSMS.СтатусСообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ПолучательSMS.СтадияДоставки  = Перечисления.СтадииДоставкиSMSСообщений.ПустаяСсылка();
			
		КОНЕЦПОПЫТКИ
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ОтправитьSMS()

// Функция, получает статус отправленного сообщения по его ID
//  Параметры:
//   МассивIDSMS: Массив, Массив ID сообщений.
//   
Функция SMSC_KZ_ПолучитьСтатусSMS(СервисSMSРассылки, IDСообщений)
	
	Результат = СоздатьТаблицуРезульта(IDСообщений, Ложь);
		
	Для Каждого СтрокаIDСообщения Из Результат Цикл
		
		ПОПЫТКА
			
			ОписаниеОшибки = "";
			Если ПустаяСтрока(СтрокаIDСообщения.IDСообщения) Тогда
				Продолжить;
			КонецЕсли;
			
			Аргументы = "&phone=" + URLEncode(СтрокаIDСообщения.НомерТелефона) +
			            "&id=" + URLEncode(СтрокаIDСообщения.IDСообщения) +
						"&fmt=3";
			
			Ответ = SMSC_KZ_ПослатьКоманду("/sys/status.php", Аргументы, СервисSMSРассылки, ОписаниеОшибки);
			
			Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				
				СтрокаIDСообщения.СтатусСообщения = ОписаниеОшибки;
				СтрокаIDСообщения.СтадияДоставки  = Перечисления.СтадииДоставкиSMSСообщений.ВРежимеДоставки;
				
				Возврат Результат;
				
			КонецЕсли;
			
			СтруктураОтвета = ДекодироватьИзJSON(Ответ);
			
			
			Если СтруктураОтвета.Свойство("status") Тогда
				status = СтруктураОтвета.status;
				Если status = -1 Или status = 0 Тогда  // ожидает отправки или передано оператору
					СтатусСообщенияСтрока = НСтр("ru = 'В режиме доставки'; en = 'In delivery mode'");
					СтадияДоставки  = Перечисления.СтадииДоставкиSMSСообщений.ВРежимеДоставки;
				ИначеЕсли status = 1  Тогда // доставлено
					СтадияДоставки = Перечисления.СтадииДоставкиSMSСообщений.СообщениеДоставлено;
					СтатусСообщенияСтрока = НСтр("ru = 'Сообщение доставлено'; en = 'Message delivered'");
				Иначе
					СтадияДоставки = Перечисления.СтадииДоставкиSMSСообщений.ОшибкаДоставки;
					СтатусСообщенияСтрока = НСтр("ru = 'Ошибка доставки'; en = 'Delivery error'");
				КонецЕсли;
				СтрокаIDСообщения.СтадияДоставки  = СтадияДоставки;
				СтрокаIDСообщения.СтатусСообщения = СтатусСообщенияСтрока;
			Иначе
				СтрокаIDСообщения.СтатусСообщения = НСтр("ru = 'Ошибка доставки'; en = 'Delivery error'");
			    СтрокаIDСообщения.СтадияДоставки  = Перечисления.СтадииДоставкиSMSСообщений.ВРежимеДоставки;
			КонецЕсли;
			
		ИСКЛЮЧЕНИЕ
			
			СтрокаIDСообщения.СтатусСообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			СтрокаIDСообщения.СтадияДоставки  = Перечисления.СтадииДоставкиSMSСообщений.ВРежимеДоставки;
			
		КОНЕЦПОПЫТКИ
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ПолучитьСтатусSMS()

// Функция, выполняет получение баланса
//  Параметры:
//
Функция SMSC_KZ_ПолучитьБаланс(СервисSMSРассылки)
		
	ОписаниеОшибки 	= "";
	Аргументы = "&cur=1&fmt=3";
				
	Ответ			= SMSC_KZ_ПослатьКоманду("/sys/balance.php", Аргументы, СервисSMSРассылки, ОписаниеОшибки);
	
	Результат = Новый Структура("Баланс, Валюта, Ошибка, ОписаниеОшибки", 0, "Руб.", Ложь, "");
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		
		Результат.Ошибка         = Истина;
	    Результат.ОписаниеОшибки = ОписаниеОшибки;
		Возврат Результат;

	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ответ) Тогда
	    СтруктураОтвета = ДекодироватьИзJSON(Ответ);
		Результат.Ошибка = Ложь;
		Результат.Валюта = ?(СтруктураОтвета.Свойство("currency"), СтруктураОтвета.currency, "");
		Результат.Баланс = ?(СтруктураОтвета.Свойство("balance"), СтруктураОтвета.balance, "");
	Иначе
	    Результат.Ошибка         = Истина;
	    Результат.ОписаниеОшибки = НСтр("ru= 'Неверный формат ответа';en= 'Invalid response format'");
	КонецЕсли;
		
    Возврат Результат;
	
КонецФункции

// Функция - SMSC KZ послать команду
//
// Параметры:
//  Команда				 - 	 - 
//  Аргументы			 - 	 - 
//  СервисSMSРассылки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция SMSC_KZ_ПослатьКоманду(Команда, Аргументы = "", СервисSMSРассылки, ОписаниеОшибки) Экспорт

	Сервер = "smsc.kz";
	
	Ресурс = Команда;                         
    Параметры = "login=" + КодироватьСтроку(СокрЛП(СервисSMSРассылки.Пользователь), СпособКодированияСтроки.КодировкаURL) 
		+ "&psw=" + КодироватьСтроку(СокрЛП(СервисSMSРассылки.Пароль), СпособКодированияСтроки.КодировкаURL) + Аргументы;	
	Результат = ПрочитатьАдрес(Сервер, Ресурс, Параметры, ОписаниеОшибки);                       
	
	Возврат Результат;	
	
КонецФункции 

#КонецОбласти

#КонецОбласти
