
#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает СЕ по оранизации.
// Если у Организации несколько СЕ - возвращает Неопределенно
//
Функция ВернутьСтруктурныеЕдиницыОрганизации(Организация = Неопределено) Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					И &Организация <> НЕОПРЕДЕЛЕНО
	|				ТОГДА СтруктурныеЕдиницы.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";	
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	 
	
КонецФункции   

// Функция, получить массив структурных единиц сотрудника.
// 
Функция ПолучитьМассивСтруктурныхЕдиницСотрудника(Сотрудник) Экспорт
	
	Если ТипЗнч(Сотрудник) = Тип("СправочникСсылка.Пользователи") Тогда
		Сотрудник = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Сотрудник,"Сотрудник");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	СтруктурныеЕдиницы.ПометкаУдаления = ЛОЖЬ
	|	И СтруктурныеЕдиницы.Ссылка В
	|			(ВЫБРАТЬ
	|				СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|			ИЗ
	|				Справочник.Сотрудники.ДоступныеСтруктурныеЕдиницы КАК СотрудникиДоступныеСтруктурныеЕдиницы
	|			ГДЕ
	|				СотрудникиДоступныеСтруктурныеЕдиницы.Ссылка = &Сотрудник)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтруктурныеЕдиницы.Наименование"); 	
		
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Функция, возвращает текстовое представления графика работы стоматологии
//
Функция ПолучитьПредставленияГрафикаРаботы(СтруктурнаяЕдиница) Экспорт
	
	ПредставленияГрафикаРаботы = "";
	
	СписокДнейНедели = Новый СписокЗначений;
	СписокДнейНедели.Добавить(1, "Пн");
	СписокДнейНедели.Добавить(2, "Вт");
	СписокДнейНедели.Добавить(3, "Ср");
	СписокДнейНедели.Добавить(4, "Чт");
	СписокДнейНедели.Добавить(5, "Пт");
	СписокДнейНедели.Добавить(6, "Сб");
	СписокДнейНедели.Добавить(7, "Вс");
	
	ГрафикРаботы = Новый ТаблицаЗначений;
	ГрафикРаботы.Колонки.Добавить("МассивДнейНедели", Новый ОписаниеТипов("Массив"));
	ГрафикРаботы.Колонки.Добавить("НачалоРаботы", Новый ОписаниеТипов("Дата"));
	ГрафикРаботы.Колонки.Добавить("ОкончаниеРаботы", Новый ОписаниеТипов("Дата"));
	
	// Схлопываем дни с одинаковым временем
	Для Каждого СтрокаРасписаниеРаботы Из СтруктурнаяЕдиница.РасписаниеРаботы Цикл
		ДеньДобавлен = Ложь;
		Для Каждого СтрокаТЗ Из ГрафикРаботы Цикл
			Если СтрокаРасписаниеРаботы.Активность И СтрокаТЗ.НачалоРаботы = СтрокаРасписаниеРаботы.НачалоРаботы И СтрокаТЗ.ОкончаниеРаботы = СтрокаРасписаниеРаботы.ОкончаниеРаботы Тогда
				СтрокаТЗ.МассивДнейНедели.Добавить(ДеньНедели(СтрокаРасписаниеРаботы.ДеньНедели));
				ДеньДобавлен = Истина;
			КонецЕсли;
		КонецЦикла;
		Если СтрокаРасписаниеРаботы.Активность И ДеньДобавлен = Ложь Тогда
			СтрокаТЗ = ГрафикРаботы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, СтрокаРасписаниеРаботы);
			СтрокаТЗ.МассивДнейНедели.Добавить(ДеньНедели(СтрокаРасписаниеРаботы.ДеньНедели));
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТЗ Из ГрафикРаботы Цикл
		ПредставлениеПериода = ""; а = 0;
		Для а = 0 По СтрокаТЗ.МассивДнейНедели.Количество()-1 Цикл
			Если а-1 >= 0 И СтрокаТЗ.МассивДнейНедели[а-1] = (СтрокаТЗ.МассивДнейНедели[а] - 1)
					И а+1 <= СтрокаТЗ.МассивДнейНедели.Количество()-1 И (СтрокаТЗ.МассивДнейНедели[а] + 1) = СтрокаТЗ.МассивДнейНедели[а+1] Тогда
				ПредставлениеПериода = ПредставлениеПериода + ?(Сред(ПредставлениеПериода, СтрДлина(ПредставлениеПериода)) <> "-", "-", "");
			Иначе
				ПредставлениеПериода = ПредставлениеПериода + ?(ПредставлениеПериода <> "" И Сред(ПредставлениеПериода, СтрДлина(ПредставлениеПериода)) <> "-", ",", "") + СписокДнейНедели.НайтиПоЗначению(СтрокаТЗ.МассивДнейНедели[а]).Представление;
			КонецЕсли;
		КонецЦикла;
		ПредставленияГрафикаРаботы = ПредставленияГрафикаРаботы + ?(ПредставленияГрафикаРаботы <> "", ", ", "") + 
				ПредставлениеПериода + ": " + Формат(СтрокаТЗ.НачалоРаботы, "ДФ=HH:mm") + "-" + Формат(СтрокаТЗ.ОкончаниеРаботы, "ДФ=HH:mm");
	КонецЦикла;
	
	Возврат ПредставленияГрафикаРаботы;
	
КонецФункции

// Функция - Получить таблицу сервисов рассылок для структурных единиц
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТаблицуСервисовРассылокДляСтруктурныхЕдиниц() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнешниеСистемы.Ссылка КАК ВнешняяСистема,
	|	ВнешниеСистемы.ТипВнешнейСистемы КАК ТипВнешнейСистемы,
	|	ВнешниеСистемы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВнешниеСистемы.Ссылка) КАК Представление
	|ПОМЕСТИТЬ ТаблицаВнешнихСистем
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ПометкаУдаления = ЛОЖЬ
	|	И ВнешниеСистемы.Используется = ИСТИНА
	|	И ВнешниеСистемы.ТипВнешнейСистемы В (ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Wallet), ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.GreenApi))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА СтруктурныеЕдиницы.СервисSMSРассылки = ЗНАЧЕНИЕ(Справочник.СервисыРассылки.ПустаяСсылка)
	|				ИЛИ СтруктурныеЕдиницы.СервисSMSРассылки = НЕОПРЕДЕЛЕНО
	|			ТОГДА СервисSMSРассылкиПоУмолчанию.Значение
	|		ИНАЧЕ СтруктурныеЕдиницы.СервисSMSРассылки
	|	КОНЕЦ КАК АккаунтСервисаРассылкиSMS,
	|	ВЫБОР
	|		КОГДА ТаблицаВнешнихСистемPushWallet.СтруктурнаяЕдиница ЕСТЬ NULL
	|				И ТаблицаВнешнихСистемPushWalletПоЛюбойСЕ.СтруктурнаяЕдиница ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОтправкаPushWallet,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаВнешнихСистемPushWallet.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемPushWallet.ВнешняяСистема
	|		КОГДА НЕ ТаблицаВнешнихСистемPushWalletПоЛюбойСЕ.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемPushWalletПоЛюбойСЕ.ВнешняяСистема
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПустаяСсылка)
	|	КОНЕЦ КАК АккаунтВнешнейСистемыPushWallet,
	|	ВЫБОР
	|		КОГДА ТаблицаВнешнихСистемGreenApi.СтруктурнаяЕдиница ЕСТЬ NULL
	|				И ТаблицаВнешнихСистемGreenApiПоЛюбойСЕ.СтруктурнаяЕдиница ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОтправкаMessenger,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаВнешнихСистемGreenApi.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемGreenApi.ВнешняяСистема
	|		КОГДА НЕ ТаблицаВнешнихСистемGreenApiПоЛюбойСЕ.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемGreenApiПоЛюбойСЕ.ВнешняяСистема
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПустаяСсылка)
	|	КОНЕЦ КАК АккаунтВнешнейСистемы
	|ИЗ
	|	Константа.СервисSMSРассылкиПоУмолчанию КАК СервисSMSРассылкиПоУмолчанию,
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВнешнихСистем КАК ТаблицаВнешнихСистемPushWallet
	|		ПО (ТаблицаВнешнихСистемPushWallet.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Wallet))
	|			И СтруктурныеЕдиницы.Ссылка = ТаблицаВнешнихСистемPushWallet.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВнешнихСистем КАК ТаблицаВнешнихСистемPushWalletПоЛюбойСЕ
	|		ПО (ТаблицаВнешнихСистемPushWalletПоЛюбойСЕ.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Wallet))
	|			И (ТаблицаВнешнихСистемPushWalletПоЛюбойСЕ.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВнешнихСистем КАК ТаблицаВнешнихСистемGreenApi
	|		ПО (ТаблицаВнешнихСистемGreenApi.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.GreenApi))
	|			И СтруктурныеЕдиницы.Ссылка = ТаблицаВнешнихСистемGreenApi.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВнешнихСистем КАК ТаблицаВнешнихСистемGreenApiПоЛюбойСЕ
	|		ПО (ТаблицаВнешнихСистемGreenApiПоЛюбойСЕ.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.GreenApi))
	|			И (ТаблицаВнешнихСистемGreenApiПоЛюбойСЕ.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|ГДЕ
	|	НЕ СтруктурныеЕдиницы.ПометкаУдаления
	|	И НЕ СтруктурныеЕдиницы.ЭтоГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТаблицаВнешнихСистемPushWallet.СтруктурнаяЕдиница ЕСТЬ NULL
	|				И ТаблицаВнешнихСистемPushWalletПоЛюбойСЕ.СтруктурнаяЕдиница ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаВнешнихСистемPushWallet.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемPushWallet.ВнешняяСистема
	|		КОГДА НЕ ТаблицаВнешнихСистемPushWalletПоЛюбойСЕ.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемPushWalletПоЛюбойСЕ.ВнешняяСистема
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаВнешнихСистемGreenApi.СтруктурнаяЕдиница ЕСТЬ NULL
	|				И ТаблицаВнешнихСистемGreenApiПоЛюбойСЕ.СтруктурнаяЕдиница ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаВнешнихСистемGreenApi.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемGreenApi.ВнешняяСистема
	|		КОГДА НЕ ТаблицаВнешнихСистемGreenApiПоЛюбойСЕ.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемGreenApiПоЛюбойСЕ.ВнешняяСистема
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтруктурныеЕдиницы.СервисSMSРассылки = ЗНАЧЕНИЕ(Справочник.СервисыРассылки.ПустаяСсылка)
	|				ИЛИ СтруктурныеЕдиницы.СервисSMSРассылки = НЕОПРЕДЕЛЕНО
	|			ТОГДА СервисSMSРассылкиПоУмолчанию.Значение
	|		ИНАЧЕ СтруктурныеЕдиницы.СервисSMSРассылки
	|	КОНЕЦ,
	|	СтруктурныеЕдиницы.Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция, выполняет возврат всех структурных единиц
//
Функция ВернутьМассивСтруктурныхЕдиниц(Знач МассивРазрешенных = Неопределено, ПолучатьУдаленные = Ложь) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	НЕ СтруктурныеЕдиницы.ЭтоГруппа
	|	И НЕ СтруктурныеЕдиницы.ПометкаУдаления
	|	И &УсловиеСтруктурнаяЕдиница");

	Если ПолучатьУдаленные Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НЕ СтруктурныеЕдиницы.ПометкаУдаления", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивРазрешенных", МассивРазрешенных);
	
	УсловиеСтруктурнаяЕдиница = ?(ЗначениеЗаполнено(МассивРазрешенных), "И СтруктурныеЕдиницы.Ссылка В (&МассивРазрешенных)", "");
	Запрос.Текст              = СтрЗаменить(Запрос.Текст, "И &УсловиеСтруктурнаяЕдиница", УсловиеСтруктурнаяЕдиница);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	
	
КонецФункции

// Функция, выполняет возврат всех структурных единиц
//
Функция ВернутьМассивСтруктурныхЕдиницСтоматология(Знач МассивРазрешенных = Неопределено, ПолучатьУдаленные = Ложь) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	НЕ СтруктурныеЕдиницы.ЭтоГруппа
	|	И НЕ СтруктурныеЕдиницы.ПометкаУдаления
	|	И &УсловиеСтруктурнаяЕдиница");
	
	Если ПолучатьУдаленные Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НЕ СтруктурныеЕдиницы.ПометкаУдаления", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивРазрешенных", МассивРазрешенных);
	
	УсловиеСтруктурнаяЕдиница = ?(ЗначениеЗаполнено(МассивРазрешенных), "И СтруктурныеЕдиницы.Ссылка В (&МассивРазрешенных)", "");
	Запрос.Текст              = СтрЗаменить(Запрос.Текст, "И &УсловиеСтруктурнаяЕдиница", УсловиеСтруктурнаяЕдиница);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	
	
КонецФункции

// Функция - Вернуть региональные настройки
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьРегиональныеНастройки(СтруктурнаяЕдиница = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	// РегиональныеПараметрыСЕ = Новый Структура;
	// РегиональныеПараметрыСЕ.Вставить("СтранаУчета"		, Справочники.СтраныМира.ПустаяСсылка());
	// РегиональныеПараметрыСЕ.Вставить("ВалютаУчета"		, Справочники.Валюты.ПустаяСсылка());
	// РегиональныеПараметрыСЕ.Вставить("ФорматТелНомера"	, 0);
	// РегиональныеПараметрыСЕ.Вставить("Код"				, 0);
	
	// Запрос = Новый Запрос;
	// Запрос.Текст = "ВЫБРАТЬ
	//               |	СтруктурныеЕдиницы.Страна КАК СтранаУчета,
	//               |	СтруктурныеЕдиницы.Валюта КАК ВалютаУчета,
	//               |	СтруктурныеЕдиницы.ФорматТелефонныхНомеров КАК ФорматТелНомера,
	//               |	ВЫБОР
	//               |		КОГДА СтруктурныеЕдиницы.Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	//               |			ТОГДА 0
	//               |		ИНАЧЕ СтруктурныеЕдиницы.Страна.Код
	//               |	КОНЕЦ КАК Код
	//               |ИЗ
	//               |	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	//               |ГДЕ
	//               |	СтруктурныеЕдиницы.Ссылка = &СтруктурнаяЕдиница";
	//
	// Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда 
	//	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	// Иначе 
	//	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	// КонецЕсли;
	//
	// ВыборкаРегиональныхПараметров = Запрос.Выполнить().Выбрать();
	// Если ВыборкаРегиональныхПараметров.Следующий() Тогда 
	//	ЗаполнитьЗначенияСвойств(РегиональныеПараметрыСЕ, ВыборкаРегиональныхПараметров);
	// КонецЕсли;	
	
	СтранаУчета = Константы.СтранаУчета.Получить();
	РегиональныеПараметрыСЕ = Новый Структура;
	РегиональныеПараметрыСЕ.Вставить("СтранаУчета"		, СтранаУчета);
	РегиональныеПараметрыСЕ.Вставить("ВалютаУчета"		, Константы.ВалютаУчета.Получить());
	РегиональныеПараметрыСЕ.Вставить("ФорматТелНомера"	, Константы.ФорматТелефонныхНомеров.Получить());
	РегиональныеПараметрыСЕ.Вставить("Код"				, СтранаУчета.Код);

	Возврат РегиональныеПараметрыСЕ;
	
КонецФункции

//// Функция, возвращает текстовое представления графикаработы салона
////
// Функция ПолучитьПредставленияГрафикаРаботы(СтруктурнаяЕдиница) Экспорт
//	
//	ПредставленияГрафикаРаботы = "";
//	
//	СписокДнейНедели = Новый СписокЗначений;
//	СписокДнейНедели.Добавить(1, "Пн");
//	СписокДнейНедели.Добавить(2, "Вт");
//	СписокДнейНедели.Добавить(3, "Ср");
//	СписокДнейНедели.Добавить(4, "Чт");
//	СписокДнейНедели.Добавить(5, "Пт");
//	СписокДнейНедели.Добавить(6, "Сб");
//	СписокДнейНедели.Добавить(7, "Вс");
//	
//	ГрафикРаботы = Новый ТаблицаЗначений;
//	ГрафикРаботы.Колонки.Добавить("МассивДнейНедели", Новый ОписаниеТипов("Массив"));
//	ГрафикРаботы.Колонки.Добавить("НачалоРаботы", Новый ОписаниеТипов("Дата"));
//	ГрафикРаботы.Колонки.Добавить("ОкончаниеРаботы", Новый ОписаниеТипов("Дата"));
//	
//	// Схлопываем дни с одинаковым временем
//	Для Каждого СтрокаРасписаниеРаботы Из СтруктурнаяЕдиница.РасписаниеРаботы Цикл
//		ДеньДобавлен = Ложь;
//		Для Каждого СтрокаТЗ Из ГрафикРаботы Цикл
//			Если СтрокаРасписаниеРаботы.Активность И СтрокаТЗ.НачалоРаботы = СтрокаРасписаниеРаботы.НачалоРаботы И СтрокаТЗ.ОкончаниеРаботы = СтрокаРасписаниеРаботы.ОкончаниеРаботы Тогда
//				СтрокаТЗ.МассивДнейНедели.Добавить(ДеньНедели(СтрокаРасписаниеРаботы.ДеньНедели));
//				ДеньДобавлен = Истина;
//			КонецЕсли;
//		КонецЦикла;
//		Если СтрокаРасписаниеРаботы.Активность И ДеньДобавлен = Ложь Тогда
//			СтрокаТЗ = ГрафикРаботы.Добавить();
//			ЗаполнитьЗначенияСвойств(СтрокаТЗ, СтрокаРасписаниеРаботы);
//			СтрокаТЗ.МассивДнейНедели.Добавить(ДеньНедели(СтрокаРасписаниеРаботы.ДеньНедели));
//		КонецЕсли;
//	КонецЦикла;
//	
//	Для Каждого СтрокаТЗ Из ГрафикРаботы Цикл
//		ПредставлениеПериода = ""; а = 0;
//		Для а = 0 По СтрокаТЗ.МассивДнейНедели.Количество()-1 Цикл
//			Если а-1 >= 0 И СтрокаТЗ.МассивДнейНедели[а-1] = (СтрокаТЗ.МассивДнейНедели[а] - 1)
//					И а+1 <= СтрокаТЗ.МассивДнейНедели.Количество()-1 И (СтрокаТЗ.МассивДнейНедели[а] + 1) = СтрокаТЗ.МассивДнейНедели[а+1] Тогда
//				ПредставлениеПериода = ПредставлениеПериода + ?(Сред(ПредставлениеПериода, СтрДлина(ПредставлениеПериода)) <> "-", "-", "");
//			Иначе
//				ПредставлениеПериода = ПредставлениеПериода + ?(ПредставлениеПериода <> "" И Сред(ПредставлениеПериода, СтрДлина(ПредставлениеПериода)) <> "-", ",", "") + СписокДнейНедели.НайтиПоЗначению(СтрокаТЗ.МассивДнейНедели[а]).Представление;
//			КонецЕсли;
//		КонецЦикла;
//		ПредставленияГрафикаРаботы = ПредставленияГрафикаРаботы + ?(ПредставленияГрафикаРаботы <> "", ", ", "") + 
//				ПредставлениеПериода + ": " + Формат(СтрокаТЗ.НачалоРаботы, "ДФ=HH:mm") + "-" + Формат(СтрокаТЗ.ОкончаниеРаботы, "ДФ=HH:mm");
//	КонецЦикла;
//	
//	Возврат ПредставленияГрафикаРаботы;
//	
// КонецФункции

// Функция вернет массив рабочих дней недели СЕ, если выставлен флаг ДобавитьВремяРаботы
// будет возвращен массив структур с рабочим временем
// Функция - вернет начало дня и окончание дня заданной СЕ
// 
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  ДеньНедели			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ВремяРаботыСтруктурнойЕдиницы(
	Знач Дата 			  = Неопределено,
	Знач СтруктурнаяЕдиница = Неопределено,
	Знач ДеньНедели 		  = Неопределено,
	ТолькоВремя 			  = Истина) Экспорт
	
	Если Дата = Неопределено Тогда 
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если СтруктурнаяЕдиница = Неопределено Тогда 
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	Если ДеньНедели = Неопределено Тогда 
		ДеньНедели = ДеньНедели(Дата);
	КонецЕсли;		
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницыРасписаниеРаботы.НачалоРаботы КАК НачалоРаботы,
	|	СтруктурныеЕдиницыРасписаниеРаботы.ОкончаниеРаботы КАК ОкончаниеРаботы
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы.РасписаниеРаботы КАК СтруктурныеЕдиницыРасписаниеРаботы
	|ГДЕ
	|	ДЕНЬНЕДЕЛИ(СтруктурныеЕдиницыРасписаниеРаботы.ДеньНедели) = &ДеньНедели
	|	И СтруктурныеЕдиницыРасписаниеРаботы.Активность = ИСТИНА
	|	И СтруктурныеЕдиницыРасписаниеРаботы.Ссылка = &СтруктурнаяЕдиница");
	
	Запрос.УстановитьПараметр("ДеньНедели"        , ДеньНедели);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	РезВыборки = Запрос.Выполнить().Выбрать();
	
	Если РезВыборки.Следующий() Тогда
		Начало = ?(РезВыборки.НачалоРаботы = Дата(0001,01,01,00,00,00),  Дата(0001,01,01,00,00,00), РезВыборки.НачалоРаботы); 
		Конец  = ?(РезВыборки.ОкончаниеРаботы = Дата(0001,01,01,00,00,00) 
			ИЛИ РезВыборки.ОкончаниеРаботы = Дата(0001,01,02,00,00,00),  Дата(0001,01,01,23,59,59), РезВыборки.ОкончаниеРаботы); 
		
		Если НЕ ТолькоВремя Тогда 
			Начало  = НачалоДня(Дата) + Час(Начало)	* 3600 + Минута(Начало) *60;
			Конец 	= НачалоДня(Дата) + Час(Конец) 	* 3600 + Минута(Конец)	*60 + Секунда(Конец);
		КонецЕсли;
		
		Минуты 							= Цел((Конец - Начало) / 60);
		Часов  							= Цел(Минуты / 60);
		Минут 							= Минуты - (Часов * 60);
		Продолжительность  				= Дата(1, 1, 1) + Часов * 3600 + Минут * 60;
		ПродолжительностьПредставление 	= СокрЛП(?(Часов > 0 ,"" + Часов + ?(Часов = 1, " час ", " часа "), "") + ?(Минут > 0 ,"" + Минут + " мин.", ""));
					
		Возврат Новый Структура("НачалоРаботы, ОкончаниеРаботы, Продолжительность, ПродолжительностьПредставление",
			Начало, Конец, Продолжительность, ПродолжительностьПредставление);		
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

// Функция - Интервалы времени записи структурной единицы
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнтервалВремениЗаписиСтруктурнойЕдиницы(СтруктурнаяЕдиница) Экспорт
	
	Интервал = 15;

	Возврат Интервал;
	
КонецФункции

// Функция - Максимальный интервал работы структурной единицы
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция МаксимальныйИнтервалРаботыСтруктурнойЕдиницы(СтруктурнаяЕдиница, БратьМаксимальныйИнтервалТолькоЗаВыходные = Ложь) Экспорт

	ПервыйДень 	  = ?(БратьМаксимальныйИнтервалТолькоЗаВыходные = Истина, 6, 1);
	ПоследнийДень = 7;
	
	МаксПериод = Неопределено;
	
	Для А = ПервыйДень По ПоследнийДень Цикл
		
		ПериодРаботы = ВремяРаботыСтруктурнойЕдиницы(,СтруктурнаяЕдиница, А); 
		
		Если ПериодРаботы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если  МаксПериод = Неопределено ИЛИ ПериодРаботы.Продолжительность > МаксПериод.Продолжительность Тогда
			МаксПериод = ПериодРаботы;
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат МаксПериод;
	
КонецФункции

// Функция - Получить доступные кассы для СЕ
//
// Параметры:
//  СтруктЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДоступныеКассы(СтруктЕдиница, Организация = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		
		Возврат СтруктЕдиница.ДоступныеКассы.ВыгрузитьКолонку("Касса"); 
		
	Иначе
		
		Кассы = Новый Массив;
		Кассы.Добавить(СтруктЕдиница.ОсновнаяКасса);
		
		Возврат Кассы;
		
	КонецЕсли;
	
КонецФункции

// Функция - Получить сотрудников структурной единицы
//
// Параметры:
//  СтруктЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСотрудниковСтруктурнойЕдиницы(СтруктурнаяЕдиница) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НастройкиСотрудников.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И НЕ НастройкиСотрудников.Сотрудник.ПометкаУдаления");

	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",СтруктурнаяЕдиница);	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции

// Функция - Получить сотрудников структурных единиц
//
// Параметры:
//  СтруктурныеЕдиницы	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСотрудниковСтруктурныхЕдиниц(СтруктурныеЕдиницы) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НастройкиСотрудников.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НастройкиСотрудников.СтруктурнаяЕдиница В (&СтруктурныеЕдиницы)
	|	И НЕ НастройкиСотрудников.Сотрудник.ПометкаУдаления");

	Запрос.УстановитьПараметр("СтруктурныеЕдиницы", СтруктурныеЕдиницы);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");

КонецФункции

// Функция - Получить признак РазрешитьВходБезКлюча в текущей структурной единице
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПризнакРазрешитьВходБезКлючаВСтруктурнойЕдинице(СтруктурнаяЕдиница = Неопределено)Экспорт
	Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		Возврат СтруктурнаяЕдиница.РазрешитьВходБезКлюча;
	Иначе
		Возврат ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.РазрешитьВходБезКлюча;
	КонецЕсли;
КонецФункции

// Функция - Получить организации структурной единицы
//
// Параметры:
//  СтруктЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтруктурныеЕдиницыОрганизации(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	СтруктурныеЕдиницы.Ссылка КАК СтруктурнаяЕдиница,
	               |	СтруктурныеЕдиницы.Организация КАК Организация
	               |ИЗ
	               |	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
				   |ГДЕ
				   |	СтруктурныеЕдиницы.Организация = &Организация
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СтруктурныеЕдиницыДоступныеКассы.Ссылка,
	               |	СтруктурныеЕдиницыДоступныеКассы.Касса.Организация
	               |ИЗ
	               |	Справочник.СтруктурныеЕдиницы.ДоступныеКассы КАК СтруктурныеЕдиницыДоступныеКассы
				   |ГДЕ
				   |	СтруктурныеЕдиницыДоступныеКассы.Касса.Организация = &Организация";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СтруктурнаяЕдиница");
	
КонецФункции

// Функция - Получить сегмент номенклатуры организации
//
// Параметры:
//  Организация	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСегментНоменклатурыОрганизацииПоСтруктурнойЕдинице(СтруктЕдиница, Организация) Экспорт
	
	НайденныеСтроки = СтруктЕдиница.ОграниченияПоСегментамНоменклатуры.НайтиСтроки(Новый Структура("Организация", Организация));
	Возврат ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].СегментНоменклатуры, Неопределено); 
	
КонецФункции

// Функция -  Получить структурные единицы по кассе
Функция ПолучитьСтруктурныеЕдиницыПоКассе(Касса) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СтруктурныеЕдиницыДоступныеКассы.Ссылка КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА СтруктурныеЕдиницыДоступныеКассы.Ссылка = &ТекущаяСтруктурнаяЕдиница
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы.ДоступныеКассы КАК СтруктурныеЕдиницыДоступныеКассы
	|ГДЕ
	|	СтруктурныеЕдиницыДоступныеКассы.Касса = &Касса
	|	И СтруктурныеЕдиницыДоступныеКассы.Ссылка.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет УБЫВ");
	
	Запрос.УстановитьПараметр("Касса", Касса);
	Запрос.УстановитьПараметр("ТекущаяСтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СтруктурнаяЕдиница");
	
КонецФункции

// Функция - Вструктурной единице выполняются предпродажи на дату
//
// Параметры:
//  СтруктЕдиница	 - 	 - 
//  Дата			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВСтруктурнойЕдиницеВыполняютсяПредпродажиНаДату(СтруктЕдиница, Дата) Экспорт
	
	Возврат СтруктЕдиница.ПредпродажаДоОткрытияКлиники = Истина
	И СтруктЕдиница.ЗапланированнаяДатаОткрытияКлиники > НачалоДня(Дата);
	
КонецФункции

// Функция - Получить интервалы работы структурной единицы.
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьИнтервалыРаботыСтруктурнойЕдиницы(СтруктурнаяЕдиница) Экспорт
	
	МассивИнтерваловРаботы = Новый Массив;
	
	Для Каждого СтрокаТ Из СтруктурнаяЕдиница.РасписаниеРаботы Цикл
		
		// Пропускаем неактивные и праздничные дни.
		Если Не ЗначениеЗаполнено(СтрокаТ.ДеньНедели) Тогда
			Продолжить;
		КонецЕсли;
		
		ИнтервалыРаботы = Новый Массив;
		
		// Если структурная единица работает в этот день.
		Если СтрокаТ.Активность Тогда
			
			ВремяНачала = СтрокаТ.НачалоРаботы; 
			
			Если ВремяНачала > Дата(0001,01,01,00,00,00) Тогда 
				
				ПараметрыПоиска = Новый Структура("ДеньНедели", Дата(2001, 01, ДеньНедели(СтрокаТ.ДеньНедели - 86400)));
				ПредДеньНедели  = СтруктурнаяЕдиница.РасписаниеРаботы.НайтиСтроки(ПараметрыПоиска)[0]; 
				
				Если ПредДеньНедели.Активность И ПредДеньНедели.ОкончаниеРаботы > Дата(0001,01,02,00,00,00) Тогда
					
					// Если интервал пересекается с предыдущим днем.
					Если ВремяНачала = ПредДеньНедели.ОкончаниеРаботы - 86400 Тогда 
						ВремяНачала = Дата(0001,01,01,00,00,00);	
					Иначе
						Интервал = Новый Структура;
						Интервал.Вставить("ВремяНачала"   , Дата(0001,01,01,00,00,00));
						Интервал.Вставить("ВремяОкончания", ПредДеньНедели.ОкончаниеРаботы - 86400);
						
						ИнтервалыРаботы.Добавить(Интервал);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Интервал = Новый Структура;
			Интервал.Вставить("ВремяНачала"   , ВремяНачала);
			Интервал.Вставить("ВремяОкончания", ?(СтрокаТ.ОкончаниеРаботы >= Дата(0001,01,02,00,00,00), Дата(0001,01,01,23,59,00), СтрокаТ.ОкончаниеРаботы));
			
			ИнтервалыРаботы.Добавить(Интервал);
			
		// Если не работает - проверяем работу предыдущего дня после 00:00 (полуночи).	
		Иначе
			
			ПараметрыПоиска = Новый Структура("ДеньНедели", Дата(2001, 01, ДеньНедели(СтрокаТ.ДеньНедели - 86400)));
			ПредДеньНедели  = СтруктурнаяЕдиница.РасписаниеРаботы.НайтиСтроки(ПараметрыПоиска)[0]; 
			
			Если ПредДеньНедели.Активность И ПредДеньНедели.ОкончаниеРаботы > Дата(0001,01,02,00,00,00) Тогда
				
				Интервал = Новый Структура;
				Интервал.Вставить("ВремяНачала"   , Дата(0001,01,01,00,00,00));
				Интервал.Вставить("ВремяОкончания", ПредДеньНедели.ОкончаниеРаботы - 86400);
				
				ИнтервалыРаботы.Добавить(Интервал);
			Иначе
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;

		МассивИнтерваловРаботы.Добавить(Новый Структура("ДеньНедели, ИнтервалыРаботы", ДеньНедели(СтрокаТ.ДеньНедели), ИнтервалыРаботы));
		
	КонецЦикла;
	
	Возврат МассивИнтерваловРаботы;
	
КонецФункции	

// Функция - Получить интервалы работы структурной единицы на дату.
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  ДатаВремя			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьИнтервалыРаботыСтруктурнойЕдиницыНаДату(СтруктурнаяЕдиница, ДатаВремя) Экспорт
	
	СтрокиРасписанияРаботы = СтруктурнаяЕдиница.РасписаниеРаботы.НайтиСтроки(Новый Структура("ДеньНедели", Дата(2001, 01, ДеньНедели(ДатаВремя))));
	СтрокаРасписанияРаботы = ?(ЗначениеЗаполнено(СтрокиРасписанияРаботы), СтрокиРасписанияРаботы[0], Неопределено);
	
	Если Не ЗначениеЗаполнено(СтрокаРасписанияРаботы) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	ИнтервалыРаботы = Новый Массив;
	
	// Если структурная единица работает в этот день.
	Если СтрокаРасписанияРаботы.Активность Тогда
		
		ВремяНачала = СтрокаРасписанияРаботы.НачалоРаботы;
		
		Если ВремяНачала > Дата(0001,01,01,00,00,00) Тогда 
			
			ПараметрыПоиска = Новый Структура("ДеньНедели", Дата(2001, 01, ДеньНедели(ДатаВремя - 86400)));
			ПредДеньНедели  = СтруктурнаяЕдиница.РасписаниеРаботы.НайтиСтроки(ПараметрыПоиска)[0]; 
			
			Если ПредДеньНедели.Активность И ПредДеньНедели.ОкончаниеРаботы > Дата(0001,01,02,00,00,00) Тогда
				
				// Если интервал пересекается с предыдущим днем.
				Если ВремяНачала = ПредДеньНедели.ОкончаниеРаботы - 86400 Тогда 
					ВремяНачала = Дата(0001,01,01,00,00,00);
				Иначе
					Интервал = Новый Структура;
					Интервал.Вставить("ВремяНачала"   , Дата(0001,01,01,00,00,00));
					Интервал.Вставить("ВремяОкончания", ПредДеньНедели.ОкончаниеРаботы - 86400);
					
					ИнтервалыРаботы.Добавить(Интервал);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Интервал = Новый Структура;
		Интервал.Вставить("ВремяНачала"   , ВремяНачала);
		Интервал.Вставить("ВремяОкончания", ?(СтрокаРасписанияРаботы.ОкончаниеРаботы >= Дата(0001,01,02,00,00,00), Дата(0001,01,01,23,59,00), СтрокаРасписанияРаботы.ОкончаниеРаботы));
		
		ИнтервалыРаботы.Добавить(Интервал);
		
	// Если не работает - проверяем работу предыдущего дня после 00:00 (полуночи).	
	Иначе
		ПараметрыПоиска = Новый Структура("ДеньНедели", Дата(2001, 01, ДеньНедели(ДатаВремя - 86400)));
		ПредДеньНедели  = СтруктурнаяЕдиница.РасписаниеРаботы.НайтиСтроки(ПараметрыПоиска)[0]; 
		
		Если Не (ПредДеньНедели.Активность И ПредДеньНедели.ОкончаниеРаботы > Дата(0001,01,02,00,00,00)) Тогда
			Возврат Неопределено;	
		КонецЕсли;	
		
		Интервал = Новый Структура;
		Интервал.Вставить("ВремяНачала"   , Дата(0001,01,01,00,00,00));
		Интервал.Вставить("ВремяОкончания", ПредДеньНедели.ОкончаниеРаботы - 86400);
		
		ИнтервалыРаботы.Добавить(Интервал);
		
	КонецЕсли;
	
	Возврат ИнтервалыРаботы;
	
КонецФункции	

// Функция - Получить макс интервалы работы структурной единицы.
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМаксИнтервалыРаботыСтруктурнойЕдиницы(СтруктурнаяЕдиница) Экспорт
	
	ИнтервалыРаботы = Новый Массив;
	
	МинВремяНачала     = Неопределено;
	МаксВремяОкончания = Неопределено;
	
	Для Каждого СтрокаТ Из СтруктурнаяЕдиница.РасписаниеРаботы Цикл
		
		// Пропускаем неактивные и праздничные дни.
		Если Не (СтрокаТ.Активность И ЗначениеЗаполнено(СтрокаТ.ДеньНедели)) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(МинВремяНачала) Тогда
			МинВремяНачала = ?(СтрокаТ.НачалоРаботы < МинВремяНачала, СтрокаТ.НачалоРаботы, МинВремяНачала);
		Иначе
			МинВремяНачала = СтрокаТ.НачалоРаботы;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(МаксВремяОкончания) Тогда
			МаксВремяОкончания = ?(СтрокаТ.ОкончаниеРаботы > МаксВремяОкончания, СтрокаТ.ОкончаниеРаботы, МаксВремяОкончания);
		Иначе
			МаксВремяОкончания = СтрокаТ.ОкончаниеРаботы;
		КонецЕсли;
		
	КонецЦикла;
	
	МинВремяНачала     = ?(ЗначениеЗаполнено(МинВремяНачала), МинВремяНачала, Дата(0001,01,01,00,00,00));
	МаксВремяОкончания = ?(ЗначениеЗаполнено(МаксВремяОкончания), МаксВремяОкончания, Дата(0001,01,01,23,59,00));
	
	// Если структурная единица работает после 00:00 (полуночи).
	Если МаксВремяОкончания > Дата(0001,01,02,00,00,00) 
		И МинВремяНачала > Дата(0001,01,01,00,00,00) Тогда
		
		Если МинВремяНачала <= МаксВремяОкончания - 86400 Тогда
			МинВремяНачала = Дата(0001,01,01,00,00,00);
		Иначе
			Интервал = Новый Структура;
			Интервал.Вставить("ВремяНачала"   , Дата(0001,01,01,00,00,00));
			Интервал.Вставить("ВремяОкончания", МаксВремяОкончания - 86400);
			
			ИнтервалыРаботы.Добавить(Интервал);
		КонецЕсли;
		
		МаксВремяОкончания = Дата(0001,01,01,23,59,00);
		
	КонецЕсли;
	
	Интервал = Новый Структура;
	Интервал.Вставить("ВремяНачала"   , МинВремяНачала);
	Интервал.Вставить("ВремяОкончания", ?(МаксВремяОкончания >= Дата(0001,01,02,00,00,00), Дата(0001,01,01,23,59,00), МаксВремяОкончания));
	
	ИнтервалыРаботы.Добавить(Интервал);
	
	Возврат ИнтервалыРаботы;
	
КонецФункции

// Функция вернет массив рабочих дней недели СЕ, если выставлен флаг ДобавитьВремяРаботы
// будет возвращен массив структур с рабочим временем
Функция РабочиеДниСтруктурнойЕдиницы(СтруктурнаяЕдиница, ДобавитьВремяРаботы = Истина, ОбработатьДатуОкончания = Ложь) Экспорт
	
	РасписаниеРаботы = ПолучитьРасписаниеРаботы(СтруктурнаяЕдиница);
	
	РабочиеДни = Новый Массив;
	Индекс = 0;
	Для Каждого СтрокаТ ИЗ РасписаниеРаботы Цикл
		
		Если СтрокаТ.Активность = Истина Тогда
			
			Если ДобавитьВремяРаботы = Истина Тогда
				
				ДатаОкончанияРаботы = СтрокаТ.ОкончаниеРаботы;
				Если ОбработатьДатуОкончания = Истина И НЕ ЗначениеЗаполнено(ДатаОкончанияРаботы) Тогда
					ДатаОкончанияРаботы = Дата('0001010123:59:59')
				КонецЕсли;
				
				РабочиеДни.Добавить(Новый Структура("ДеньНедели,ДатаНачала,ДатаОкончания", Дата(2001, 01, ДеньНедели(СтрокаТ.ДеньНедели)), СтрокаТ.НачалоРаботы, ДатаОкончанияРаботы));
			Иначе
				РабочиеДни.Добавить(Дата(2001, 01, ДеньНедели(СтрокаТ.ДеньНедели)));
			КонецЕсли;
			
		КонецЕсли;
		
		Индекс = Индекс + 1;
				
	КонецЦикла;	  
	
	Возврат РабочиеДни;
	
КонецФункции

// Функция - Получить адрес структурной единицы
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  ВидАдреса			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьАдресСтруктурнойЕдиницы(СтруктурнаяЕдиница, ВидАдреса = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидАдреса) Тогда 
		ВидАдреса = Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтруктурныеЕдиницыКонтактнаяИнформация.Представление КАК Адрес
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы.КонтактнаяИнформация КАК СтруктурныеЕдиницыКонтактнаяИнформация
	|ГДЕ
	|	СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка = &СтруктурнаяЕдиница
	|	И СтруктурныеЕдиницыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И СтруктурныеЕдиницыКонтактнаяИнформация.Вид = &ВидыКонтактнойИнформации
	|	И (ВЫРАЗИТЬ(СтруктурныеЕдиницыКонтактнаяИнформация.Представление КАК СТРОКА(1024))) <> """"";
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"		, СтруктурнаяЕдиница);    
	Запрос.УстановитьПараметр("ВидыКонтактнойИнформации", ВидАдреса);    
	
	ВыборкаАдреса = Запрос.Выполнить().Выбрать();
	Если ВыборкаАдреса.Следующий() Тогда 
		Возврат СокрЛП(ВыборкаАдреса.Адрес);
	Иначе 
	   	Возврат Null;
	КонецЕсли;
	
КонецФункции

// Функция - Получить сайт структурной единицы
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСайтСтруктурнойЕдиницы(СтруктурнаяЕдиница) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтруктурныеЕдиницыКонтактнаяИнформация.Представление КАК Сайт
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы.КонтактнаяИнформация КАК СтруктурныеЕдиницыКонтактнаяИнформация
	|ГДЕ
	|	СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка = &СтруктурнаяЕдиница
	|	И СтруктурныеЕдиницыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.ВебСтраница)
	|	И СтруктурныеЕдиницыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СайтСтруктурнойЕдиницы)
	|	И (ВЫРАЗИТЬ(СтруктурныеЕдиницыКонтактнаяИнформация.Представление КАК СТРОКА(1024))) <> """"";
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"		, СтруктурнаяЕдиница);    
	
	ВыборкаСайта = Запрос.Выполнить().Выбрать();
	Если ВыборкаСайта.Следующий() Тогда 
		Возврат СокрЛП(ВыборкаСайта.Сайт);
	Иначе 
	   	Возврат Null;
	КонецЕсли;
	
КонецФункции

// Функция - Получить ЯндексОтзывы структурной единицы
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЯндексКартыСтруктурнойЕдиницы(СтруктурнаяЕдиница) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтруктурныеЕдиницыКонтактнаяИнформация.Представление КАК ЯндексКарты
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы.КонтактнаяИнформация КАК СтруктурныеЕдиницыКонтактнаяИнформация
	|ГДЕ
	|	СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка = &СтруктурнаяЕдиница
	|	И СтруктурныеЕдиницыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.ЯндексКарты)
	|	И СтруктурныеЕдиницыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЯндексКарты)
	|	И (ВЫРАЗИТЬ(СтруктурныеЕдиницыКонтактнаяИнформация.Представление КАК СТРОКА(1024))) <> """"";
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"		, СтруктурнаяЕдиница);    
	
	ВыборкаЯндекса = Запрос.Выполнить().Выбрать();
	Если ВыборкаЯндекса.Следующий() Тогда 
		Возврат СокрЛП(ВыборкаЯндекса.ЯндексКарты);
	Иначе 
	   	Возврат Null;
	КонецЕсли;
	
КонецФункции

// Функция - Получить ЯндексОтзывы структурной единицы
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЯндексОтзывыСтруктурнойЕдиницы(СтруктурнаяЕдиница) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтруктурныеЕдиницыКонтактнаяИнформация.Представление КАК ЯндексОтзывы
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы.КонтактнаяИнформация КАК СтруктурныеЕдиницыКонтактнаяИнформация
	|ГДЕ
	|	СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка = &СтруктурнаяЕдиница
	|	И СтруктурныеЕдиницыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.ЯндексОтзывы)
	|	И СтруктурныеЕдиницыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЯндексОтзывы)
	|	И (ВЫРАЗИТЬ(СтруктурныеЕдиницыКонтактнаяИнформация.Представление КАК СТРОКА(1024))) <> """"";
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"		, СтруктурнаяЕдиница);    
	
	ВыборкаЯндекса = Запрос.Выполнить().Выбрать();
	Если ВыборкаЯндекса.Следующий() Тогда 
		Возврат СокрЛП(ВыборкаЯндекса.ЯндексОтзывы);
	Иначе 
	   	Возврат Null;
	КонецЕсли;
	
КонецФункции

// Функция - Получить расписание работы
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьРасписаниеРаботы(СтруктурнаяЕдиница)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницыРасписаниеРаботы.ДеньНедели КАК ДеньНедели,
	|	СтруктурныеЕдиницыРасписаниеРаботы.НачалоРаботы КАК НачалоРаботы,
	|	СтруктурныеЕдиницыРасписаниеРаботы.ОкончаниеРаботы КАК ОкончаниеРаботы,
	|	СтруктурныеЕдиницыРасписаниеРаботы.Активность КАК Активность
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы.РасписаниеРаботы КАК СтруктурныеЕдиницыРасписаниеРаботы
	|ГДЕ
	|	СтруктурныеЕдиницыРасписаниеРаботы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДеньНедели");
	
	Запрос.УстановитьПараметр("Ссылка", СтруктурнаяЕдиница);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти 
