
#Область ОбработчикиСобытий

// Процедура - ОбработкаПроверкиЗаполнения справочника Структурные единицы
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ВыборкаПериодовРаботы = Справочники.ПериодыРаботы.Выбрать(,, Новый Структура("СтруктурнаяЕдиница", Ссылка));
	Для Каждого СтрокаПериод из РасписаниеРаботы Цикл
		Если СтрокаПериод.Активность = Истина и НЕ ЗначениеЗаполнено(СтрокаПериод.НачалоРаботы) и не ЗначениеЗаполнено(СтрокаПериод.ОкончаниеРаботы) Тогда
			Отказ = Ложь;
			Возврат;
			Прервать;			
		КонецЕсли;
	КонецЦикла;                                      	
	Пока ВыборкаПериодовРаботы.Следующий() Цикл				
		Для Каждого СтрокаПериод из РасписаниеРаботы Цикл 
			  ВремяНачалаСмены = ВыборкаПериодовРаботы.НачалоСмены;
			  ВремяОкончанияСмены = ВыборкаПериодовРаботы.ОкончаниеСмены;
			  Если СтрокаПериод.Активность = Истина
				  И СтрокаПериод.НачалоРаботы <= ВремяНачалаСмены
				  И СтрокаПериод.ОкончаниеРаботы >= ВремяОкончанияСмены Тогда
				Отказ = Ложь;
				Прервать;
			Иначе
				Отказ = Истина;
			КонеЦесли;			
		КонецЦикла;
		Если Отказ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Время работы смены " + ВыборкаПериодовРаботы + " не входит в интервал работы структурной единицы " + ВремяНачалаРаботы + ":" + ВремяОкончанияРаботы + " ! ");	
			Прервать;
		КонецЕсли; 				
	КонецЦикла;	
	
КонецПроцедуры

// Процедура, обработчик события "ПриКопировании".
//
Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.ОсновнойСклад    = Неопределено;
	ЭтотОбъект.ОсновнаяКасса    = Неопределено;
	ЭтотОбъект.КодСинхронизации = "";
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЭтотОбъект.ЭтоГруппа = Ложь Тогда
		
		Если ДополнительныеСвойства.Свойство("НастройкиЯндексКарты") Тогда  		
			НастройкиЯндексКарты = Новый ХранилищеЗначения(ДополнительныеСвойства.НастройкиЯндексКарты);     
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.УникальныйИдентификаторСтруктурнойЕдиницы) И Не ЭтотОбъект.ЭтоГруппа Тогда
		ЭтотОбъект.УникальныйИдентификаторСтруктурнойЕдиницы = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ОбщегоНазначения.ЭтоСеть();
	
КонецПроцедуры

#КонецОбласти
