
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СтруктураМеню = Новый Структура;
	СтруктураМеню.Вставить("Основное"		, "ГруппаОсновное");
	СтруктураМеню.Вставить("Оплата"			, "ГруппаОплата");
	СтруктураМеню.Вставить("Дополнительно"	, "ГруппаДополнительно");
	
	ОбработкаТабличныхЧастейКлиент.СоздатьМенюДокумента(ЭтаФорма, СтруктураМеню, "ГруппаПереключательЗакладок");
	
	УстановитьДоступностьЭлементовИФормы();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеЗаписи".
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьДоступностьЭлементовИФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапки

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ОплатаПриИзменении(Элемент)
	
	Объект.СуммаДокумента = Объект.Оплата.Итог("Сумма");
	
	ОплатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОплатаПриИзмененииНаСервере()
	
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура выполняет печать чека на фискальном регистраторе.
//
&НаКлиенте
Процедура НапечататьЧекКоррекции(Команда)
	
	ОчиститьСообщения();
	ОписаниеОшибки = "";
	
	Если Объект.ПробитЧек Тогда
		ТекстСообщения = НСтр("ru = 'Чек уже пробит на фискальном устройстве.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = "";
	СостояниеКассовойСмены = РозничныеПродажи.ПолучитьСостояниеКассовойСмены(Объект.КассаККМ); 		
	КассоваяСмена = ?(СостояниеКассовойСмены <> Неопределено, СостояниеКассовойСмены.КассоваяСмена, ПредопределенноеЗначение("Документ.КассоваяСмена.ПустаяСсылка"));
	РозничныеПродажи.СменаОткрыта(КассоваяСмена, ТекущаяДата(), ТекстОшибки);
	
	Если ((СокрЛП(ТекстОшибки) = "Кассовая смена закрыта") ИЛИ (СокрЛП(ТекстОшибки) = "Кассовая смена не открыта")) ИЛИ (Лев(ТекстОшибки, 33) = "С момента открытия кассовой смены") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;	
	
	ПараметрыКассыККМ  = МенеджерОборудованияВызовСервера.ПолучитьПараметрыКассы(Объект.КассаККМ);
	
	Если НЕ ПараметрыКассыККМ.ТипОборудованияИмя = "ККТ" Тогда
		ТекстСообщения = НСтр("ru = 'Данная операция возможна только с использованием ККТ!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	МенеджерОборудованияКлиент.ПроверитьВозможностьПечатиЧека(ЭтаФорма, Новый ОписаниеОповещения("ПослеПроверкиВозможностиПечатиЧека",ЭтотОбъект,Новый Структура("ОписаниеОшибки",ОписаниеОшибки)));
			
КонецПроцедуры

&НаКлиенте 
// Процедура - После проверки возможности печати чека
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПослеПроверкиВозможностиПечатиЧека(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОшибки = ДополнительныеПараметры.ОписаниеОшибки;
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		МассивВО = Новый Массив;			
		МассивВО.Добавить("ККТ");
		
		МенеджерОборудованияКлиент.ВыбратьУстройство(МассивВО, НСтр("ru = 'Выберите фискальный регистратор'"), НСтр("ru = 'Фискальный регистратор не подключен'"),
		Новый ОписаниеОповещения("НапечататьЧекКоррекцииПослеВыбораУстройства",ЭтотОбъект, ДополнительныеПараметры));
		
	Иначе
		ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место внешнего оборудования текущего сеанса.'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте 
Процедура НапечататьЧекКоррекцииПослеВыбораУстройства(ИдентификаторУстройства, ДополнительныеПараметры) Экспорт
	
	ОписаниеОшибки = ДополнительныеПараметры.ОписаниеОшибки;
	
	Если ИдентификаторУстройства <> Неопределено Тогда				
		
		// Подключаем ФР
		Результат = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор, ИдентификаторУстройства, ОписаниеОшибки);
		Если Результат Тогда
			// Готовим данные
			ВходныеПараметры  = ПолучитьПараметрыЧека();
			ВыходныеПараметры = Новый Массив; 					
			
			// Печатаем чек.
			Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройства, "PrintReceiptCorrection", ВходныеПараметры, ВыходныеПараметры);
			
			Если Результат Тогда
				// Установить полученное значение номера чека реквизиту документа.
				Объект.НомерЧекаККМ = ВыходныеПараметры[1];
				Объект.ПробитЧек   = Истина;
				Модифицированность = Истина;
				Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
			Иначе
				ТекстСообщения = НСтр("ru = 'При печати чека произошла ошибка.
				|Чек не напечатан на фискальном регистраторе.
				|Дополнительное описание:
				|%ДополнительноеОписание%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ВыходныеПараметры[1]);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			
			// Отключаем ФР
			МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор, ИдентификаторУстройства);
		Иначе
			ТекстСообщения = НСтр("ru = 'При подключении устройства произошла ошибка.
			|Чек не напечатан на фискальном регистраторе.
			|Дополнительное описание:
			|%ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедуры

&НаСервере
Функция ВернутьИтогиОплатыПоВиду(ТипОплаты)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипОплаты", ТипОплаты);
	НайденныеСтроки = Объект.Оплата.Выгрузить(ПараметрыОтбора,"Сумма");
	Возврат НайденныеСтроки.Итог("Сумма");
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыЧека();
	
	КодСистемыНалообложения = 0;
	Если Объект.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход Тогда
		КодСистемыНалообложения = 1;
	ИначеЕсли Объект.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход Тогда
		КодСистемыНалообложения = 2;
	ИначеЕсли Объект.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД Тогда
		КодСистемыНалообложения = 3;
	ИначеЕсли Объект.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ЕСН Тогда
		КодСистемыНалообложения = 4;
	ИначеЕсли Объект.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.Патент Тогда
		КодСистемыНалообложения = 5;
	КонецЕсли;	
	
	РеквизитыКассир = Объект.Ответственный.Сотрудник;
	
	ПараметрыЧека = МенеджерОборудованияКлиентСервер.ПараметрыОперацииЧекаКоррекции();
	
	ПараметрыЧека.Вставить("КодСистемыНалогообложения", КодСистемыНалообложения);
	
	ПараметрыЧека.ТипРасчета = Объект.ТипРасчета;
	ПараметрыЧека.Кассир     = РеквизитыКассир.Наименование; // ФИО лица, осуществившего расчет с покупателем (клиентом), оформившего кассовый чек.
	ПараметрыЧека.КассирИНН  = РеквизитыКассир.ИНН;//РеквизитыКассир.ИНН; // Идентификационный номер налогоплательщика кассира, при наличии.
	ПараметрыЧека.Сумма      = Объект.СуммаДокумента;
	ПараметрыЧека.ТипКоррекции = Объект.ТипКоррекции;
	
	ПараметрыЧека.СистемаНалогообложения  = Объект.СистемаНалогообложения;  // Системы налогообложения
	ПараметрыЧека.НаименованиеОснования   = Объект.ОснованиеДляКоррекции;   // Наименование документа основания для коррекции
	ПараметрыЧека.ДатаДокументаОснования  = Объект.ДатаДокументаОснования;  // Дата документа основания для коррекции
	ПараметрыЧека.НомерДокументаОснования = Объект.НомерДокументаОснования; // Номер документа основания для коррекции
		
	ПараметрыЧека.СуммаБезНДС = Объект.СуммаБезНДС;
	ПараметрыЧека.СуммаНДС0   = Объект.СуммаНДС0;
	ПараметрыЧека.СуммаНДС10  = Объект.СуммаНДС10;
	ПараметрыЧека.СуммаНДС18  = Объект.СуммаНДС18;
	ПараметрыЧека.СуммаНДС20  = Объект.СуммаНДС20;
	ПараметрыЧека.СуммаНДС110 = Объект.СуммаНДС110;
	ПараметрыЧека.СуммаНДС118 = Объект.СуммаНДС118;
	ПараметрыЧека.СуммаНДС120 = Объект.СуммаНДС120;
	
	ПараметрыЧека.НаличнаяОплата           = ВернутьИтогиОплатыПоВиду(Перечисления.ТипыОплатыККТ.Наличные);
	ПараметрыЧека.ЭлектроннаяОплаты        = ВернутьИтогиОплатыПоВиду(Перечисления.ТипыОплатыККТ.Электронно);
	ПараметрыЧека.Предоплатой              = ВернутьИтогиОплатыПоВиду(Перечисления.ТипыОплатыККТ.Предоплата);
	ПараметрыЧека.Постоплатой              = ВернутьИтогиОплатыПоВиду(Перечисления.ТипыОплатыККТ.Постоплата);
	ПараметрыЧека.ВстречнымПредоставлением = ВернутьИтогиОплатыПоВиду(Перечисления.ТипыОплатыККТ.ВстречноеПредоставление);
	
	Возврат ПараметрыЧека;
	
КонецФункции

&НаСервере
// Процедура, устанавливает доступность элементов и формы.
//
Процедура УстановитьДоступностьЭлементовИФормы()
	
	ТолькоПросмотр = Объект.ПробитЧек или ЗначениеЗаполнено(Объект.НомерЧекаККМ);	
	
	ЭтаФорма.ТолькоПросмотр = ТолькоПросмотр;
	
	Элементы.НапечататьЧек.Доступность = НЕ ТолькоПросмотр;  	
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик нажатия переключателя закладок.
//
Процедура ПроцедураОбработкиНажатияМеню(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ПроцедураОбработкиНажатияМеню(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры	

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ОплатаСуммаПриИзменении(Элемент)
	
	Объект.СуммаДокумента = Объект.Оплата.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти