
#Область ___________________________________ОБРАБОТЧИКИ_СОБЫТИЙ______________________________________

&НаКлиенте
// Процедура - Обработка оповещения
//
// Параметры:
//  ИмяСобытия	 - 	 - 
//  Параметр	 - 	 - 
//  Источник	 - 	 - 
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеЗадачи" Тогда 
		ОбновитьДанныеДляОтображения();
	ИначеЕсли ИмяСобытия = "ОбновитьСписокЗадачМенеджера" Тогда 
		Элементы.СписокЗадач.Обновить();		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ___________________________ОБРАБОТЧИКИ_КОМАНД_ФОРМЫ____________________________

&НаКлиенте
// Процедура - Перейти режим монитор
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура УстановитьРежимОтображенияИнформации(Команда)

	Если Команда.Имя = "ПерейтиРежимСписокЗадач" Тогда	
		ВыбранныйРежим 		= 2;
	ИначеЕсли Команда.Имя = "ПерейтиРежимСписокПроцессов" Тогда	
		ВыбранныйРежим 		= 3;
	КонецЕсли;
	
	ОбновитьДанныеДляОтображения();
		
КонецПроцедуры

&НаКлиенте
// Процедура - Установить отбор по виду бизнес процесса
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура УстановитьОтборПоВидуБизнесПроцесса(Команда)
	
	// Если Команда.Имя = "ОтобразитьПродажиЧленств" Тогда 
	//	ВыбранныйВидБизнесПроцесса = ПредопределенноеЗначение("Перечисление.ВидыБизнесПроцессов.ПродажаЧленства_КОРП");
	// ИначеЕсли Команда.Имя = "ОтобразитьПродажиДополнительныхУслуг" Тогда 
	//	ВыбранныйВидБизнесПроцесса = ПредопределенноеЗначение("Перечисление.ВидыБизнесПроцесс.ПродажаДополнительныхУслуг_КОРП");
	// ИначеЕсли Команда.Имя = "ОтобразитьПродленияЧленств" Тогда	
	//	ВыбранныйВидБизнесПроцесса = ПредопределенноеЗначение("Перечисление.ВидыБизнесПроцессов.ПродлениеЧленства_КОРП");
	// ИначеЕсли Команда.Имя = "ОтобразитьПродленияПакетовУслуг" Тогда	
	//	ВыбранныйВидБизнесПроцесса = ПредопределенноеЗначение("Перечисление.ВидыБизнесПроцессов.ПродлениеПакетаУслуг_КОРП");
	// КонецЕсли;
	
	ОбновитьДанныеДляОтображения();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Создать задачу
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СоздатьЗадачу(Команда)
	
	Предмет = Новый Структура("ЗадачаПредмет", ОбъектКлюч);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Предмет);	 	 
	
	ОткрытьФорму("Задача.Взаимодействие.ФормаОбъекта", ПараметрыФормы);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиДинамическогоМеню

&НаКлиенте
// Процедура - Обработчик нажатия элемента динамического меню
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОбработчикНажатияЭлементаДинамическогоМеню(Команда) Экспорт		
			
	// ЭтаФорма.ТекущийЭлемент = Элементы.План;	
	
	// Если это элнмент открытия Списка
	Если СтрНайти(Команда.Имя, "ОткрытьСписок") > 0 Тогда
		
		// Открываем список значений
		ОбработчикНажатияСпискаДинамическогоМеню(Команда.Имя);			
		Возврат;
		
	КонецЕсли;
	                             
	ПриИзмененииОтборовСервер(Команда.Имя);
	
КонецПроцедуры

#Область ________________ОБРАБОТЧИКИ_НАЖАТИЯ_СПИСКА_ДИНАМИЧЕСКОГО_МЕНЮ__________________

&НаКлиенте
// Процедура - Обработчик нажатия списка динамического меню
//
// Параметры:
//  Форма					 - 	 - 
//  СписокЗначений			 - 	 - 
//  ИмяКнопкиПредставления	 - 	 - 
//
Процедура ОбработчикНажатияСпискаДинамическогоМеню(ИмяКоманды)
	
	// Получаем привязанные данные и доп значения
	СтруктДанных = ОбработчикНажатияСпискаДинамическогоМенюСервер(ИмяКоманды);  
	
	Если СтруктДанных = Неопределено Тогда
		ОбновитьДанныеДляОтображения();
		Возврат;
	КонецЕсли;	
	
	// Выбор значения из выпадающего меню
	Оповещение = Новый ОписаниеОповещения("ОбработчикОткрытияСпискаДинамическогоМенюЗавершение", ЭтотОбъект, СтруктДанных);
	ПоказатьВыборИзМеню(Оповещение, СтруктДанных.ПривязанныеДанные.СписокЗначений, ЭтаФорма.Элементы[СтруктДанных.ИмяКнопкиПредставления]);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик открытия списка динамического меню завершение 
//
// Параметры:
//  Результат	 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура ОбработчикОткрытияСпискаДинамическогоМенюЗавершение(Результат, ДопПараметры) Экспорт
	
 	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.План;

	// Обрабатываем результат выбора
	Если Результат <> Неопределено  Тогда
		
		ДопПараметры.Вставить("РезультатЗначение", Результат.Значение);
		ДопПараметры.Вставить("РезультатПредставление", Результат.Представление);
		
		ОбработчикНажатияСпискаДинамическогоМенюСерверЗавершение(ДопПараметры)	 				
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Функция - Обработчик нажатия списка динамического меню сервер 
//
// Параметры:
//  КомандаИмя		 - 	 - 
//  КомандаИмяРод	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОбработчикНажатияСпискаДинамическогоМенюСервер(КомандаИмя)
	
	Возврат УправлениеИнтерфейсамиСервер.ОбработчикНажатияСпискаДинамическогоМеню(ЭтаФорма, КомандаИмя);
	
КонецФункции

&НаСервере
// Процедура - Обработчик нажатия списка динамического меню сервер завершение 
//
// Параметры:
//  СтруктДанных - 	 - 
//
Процедура ОбработчикНажатияСпискаДинамическогоМенюСерверЗавершение(СтруктДанных)
	
	// Обработка выбранного значения
	УправлениеИнтерфейсамиСервер.ОбработчикНажатияСпискаДинамическогоМенюЗавершение(ЭтаФорма, СтруктДанных);
	
	ПриИзмененииОтборовСервер(ЭтаФорма.Элементы[СтруктДанных.ИмяКнопкиПредставления].ИмяКоманды);
	
КонецПроцедуры

#КонецОбласти

#Область __________________________ОБНОВИТЬ_ДИНАМИЧЕСКИЕ_МЕНЮ___________________________

&НаСервере
// Процедура создания динамических меню отборов
Процедура ОбновитьДинамическиеМенюОтборов(ЧтоОбновить = "Все", ЗначениеПоУмолчанию = Неопределено)
	
	// Подготовка переключателя отбора статуса выполненности задачи
	Если СтрНайти(ЧтоОбновить,"Все") > 0
		ИЛИ СтрНайти(ЧтоОбновить,"Отборы") > 0 
		ИЛИ СтрНайти(ЧтоОбновить,"ОтборСтатусыВыполненности") > 0 Тогда
		
		ОбновитьДинамическоеМенюОтборСтатусыВыполненности();
		
	КонецЕсли;
	
	// Подготовка переключателя отбора видов взаимодействий задачи
	Если СтрНайти(ЧтоОбновить,"Все") > 0
		ИЛИ СтрНайти(ЧтоОбновить,"Отборы") > 0 
		ИЛИ СтрНайти(ЧтоОбновить,"ОтборВидыВзаимодействий") > 0 Тогда
		
		ОбновитьДинамическоеМенюОтборВидыВзаимодействий();
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
// Процедура - Обновить динамическое меню отбор статус выполненности 
//
Процедура ОбновитьДинамическоеМенюОтборСтатусыВыполненности(ОтборСтатусВыполненности = Неопределено)
	
	МассивСтатусовВыполненности = Новый  Массив;
	МассивСтатусовВыполненности.Добавить(Новый Структура("Значение, Представление, Выбор", Истина	, Нстр("ru = 'Выполнена'; en = 'Completed'")		, Ложь));
	МассивСтатусовВыполненности.Добавить(Новый Структура("Значение, Представление, Выбор", Ложь		, Нстр("ru = 'Не выполнена'; en = 'Not completed'")	, Ложь));   
	
	Если ЗначениеЗаполнено(ОтборСтатусВыполненности) Тогда 
		ЗначениеПоУмолчанию = ОтборСтатусВыполненности;		
		ОбщегоНазначенияКлиентСерверСтоматология.НайтиВМассивеСтруктур(МассивСтатусовВыполненности, "Значение", ОтборСтатусВыполненности).Выбор = Истина;
	КонецЕсли;
	
	МассивДанных = Новый Массив;		
	МассивДанных.Добавить(Новый Структура("Значение, Представление, ИмяПодчиненногоМеню, МассивЗначений", "Статус", "ПереключательСтатусыВыполненности", "ПодчиненноеМенюОтборСтатусыВыполненности", МассивСтатусовВыполненности));	
	
	УправлениеИнтерфейсамиСервер.СоздатьДинамическоеМенюФормыРасписанияЗанятий(
	"МенюОтборСтатусыВыполненности",
	ЭтаФорма, 
	Элементы.ГруппаОтборСтатусыВыполненности,
	МассивДанных, 
	"ОбработчикНажатияЭлементаДинамическогоМеню",
	ЗначениеПоУмолчанию,,
	Истина,,,,
	Новый Структура("ШиринаЭлемента", 6),,
	"Отбор");

КонецПроцедуры

&НаСервере
// Процедура - Обновить динамическое меню отбор статус выполненности 
//
Процедура ОбновитьДинамическоеМенюОтборВидыВзаимодействий(ОтборВидВзаимодействия = Неопределено)
	
	// Получим таблицу всех видов взаимодействий
	ТаблицаВидовВзаимодействий 	= Справочники.ВидыВзаимодействий.ПолучитьТаблицуВзаимодействий();
	// Подготовка массива видов взаимодействий                                              	
	МассивВидовВзаимодействий 	= Новый Массив;
	Для Каждого СтрокаТаблицы Из ТаблицаВидовВзаимодействий Цикл 
		МассивВидовВзаимодействий.Добавить(Новый Структура("Значение, Представление, Выбор, Код", СтрокаТаблицы.Ссылка, СтрокаТаблицы.Наименование, Ложь, СтрокаТаблицы.Ссылка.УникальныйИдентификатор()));
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ОтборВидВзаимодействия) Тогда 
		ЗначениеПоУмолчанию = ОтборВидВзаимодействия;
		Если ТипЗнч(ОтборВидВзаимодействия) = Тип("СправочникСсылка.ВидыВзаимодействий") Тогда 
			НайденноеЗначение   = ОбщегоНазначенияКлиентСерверСтоматология.НайтиВМассивеСтруктур(МассивВидовВзаимодействий, "Значение", ОтборВидВзаимодействия);
			Если НайденноеЗначение <> Неопределено Тогда 
				НайденноеЗначение.Выбор = Истина;
			КонецЕсли;			
		ИначеЕсли ТипЗнч(ОтборВидВзаимодействия) = Тип("Массив") Тогда	
			Для Каждого ЭлементМассива Из ОтборВидВзаимодействия Цикл 
				НайденноеЗначение   = ОбщегоНазначенияКлиентСерверСтоматология.НайтиВМассивеСтруктур(МассивВидовВзаимодействий, "Значение", ЭлементМассива);
				Если НайденноеЗначение <> Неопределено Тогда 
					НайденноеЗначение.Выбор = Истина;
				КонецЕсли;			
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;
	
	МассивДанных = Новый Массив;		
	МассивДанных.Добавить(Новый Структура("Значение, Представление, ИмяПодчиненногоМеню, МассивЗначений", "Взаимодействие", "ПереключательВидыВзаимодействий", "ПодчиненноеМенюОтборВидыВзаимодействий", МассивВидовВзаимодействий));	
	
	УправлениеИнтерфейсамиСервер.СоздатьДинамическоеМенюФормыРасписанияЗанятий(
	"МенюОтборВидыВзаимодействий",
	ЭтаФорма, 
	Элементы.ГруппаОтборВидыВзаимодействий,
	МассивДанных, 
	"ОбработчикНажатияЭлементаДинамическогоМеню",
	ЗначениеПоУмолчанию,,
	Истина,,,,
	Новый Структура("ШиринаЭлемента", 14),,
	"Отбор");

КонецПроцедуры

#КонецОбласти

&НаСервере
// При изменении состава отборов
//
Процедура ПриИзмененииОтборовСервер(знач ИмяЭлемента)
		
	ИмяМеню = Неопределено;
	
	ЭлементФормы        = УправлениеИнтерфейсамиСервер.ЭлементФормыПоИмениЭлемента(ЭтаФорма, ИмяЭлемента);
	ИмяЭлемента         = ЭлементФормы.Имя;
	ОбновитьПланировщик = УправлениеИнтерфейсамиСервер.ОбработчикЭлементаДинамическогоМенюПриНажатии(ЭтаФорма, ИмяЭлемента);
	 
	// Селектирование страниц филтров в зависимости от переключателей
	Если УправлениеИнтерфейсамиСервер.ЭтоЭлементБыстрогоВыбора(ИмяЭлемента) Тогда
		
		ИмяМеню = УправлениеИнтерфейсамиСервер.ИмяДинамическогоМенюФормыИзЭлемента(ИмяЭлемента);
		                    		
		// Если сменился период отображения, необходимо обновить меню отборов 
		Если СтрНайти(ИмяЭлемента,"КнопкаПрименить") > 0 
			ИЛИ СтрНайти(ИмяЭлемента,"УдалитьЗначение") > 0 Тогда
			
			ОбновитьДинамическиеМенюОтборов("ПереключательПериод");
			// ДатаПриИзмененииСервер(Ложь);
			
			Если СтрНайти(ИмяМеню, "МенюОтборПомещения") > 0 
				И ЭтотОбъект.ОтборПредставление = "Сотрудники" Тогда
				
				ОбновитьДинамическиеМенюОтборов("Отборы");
				
			ИначеЕсли СтрНайти(ИмяМеню, "МенюОтборСотрудники") > 0 
				И ЭтотОбъект.ОтборПредставление = "Помещения" Тогда
				
				ОбновитьДинамическиеМенюОтборов("ОтборТипыЗанятий, ОтборПодразделения, ОтборСотрудники");
				ОбновитьДинамическиеМенюОтборов("ОтборПомещения, ОтборУслуги, ОтборСтатусыЗанятия");

			ИначеЕсли СтрНайти(ИмяМеню, "МенюОтборСотрудники") > 0 Тогда
				
				ОбновитьДинамическиеМенюОтборов("Отборы");
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли;
	
	// Обновить планировщик
	Если ОбновитьПланировщик Тогда 
		ОбновитьДанныеДляОтображения();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область __________________________ВСПОМОГАТЕЛЬНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ_______________________________


#КонецОбласти

#Область ___________________________________________CRM______________________________________________ 

&НаКлиенте
// Процедура - Добавить БП
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Добавить_БП(Команда)
	
	Если ТипЗнч(ОбъектКлюч) = Тип("СправочникСсылка.Контрагенты") Тогда
		Если ЭтоВерсияКОРП Тогда 
			СписокСоздаваемыхБП = Новый СписокЗначений;
			//СписокСоздаваемыхБП.Добавить(Тип("БизнесПроцессСсылка.ПродажаЧленства_КОРП")			, Нстр("ru = 'Продажа членства, пакета услуг'; en = 'Sale of a membership, package of services'"), , БиблиотекаКартинок.БизнесПроцесс);
			// СписокСоздаваемыхБП.Добавить(Тип("БизнесПроцессСсылка.ПродажаДополнительныхУслуг_КОРП")	, "Продажа дополнительной услуги", , БиблиотекаКартинок.БизнесПроцесс);
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыборБП", ЭтотОбъект);
			ЭтаФорма.ПоказатьВыборИзМеню(ОписаниеОповещения, СписокСоздаваемыхБП, Элементы.КнопкаДобавитьБП);
		Иначе	
			ПараметрПредмет = Новый Структура("ЗадачаПредмет", ОбъектКлюч);	 	 
			ОткрытьФорму("Задача.ЗадачаИсполнителя.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ПараметрПредмет), ЭтаФорма);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор БП
//
// Параметры:
//  ВыбранныйЭлемент		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВыборБП(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить данные для отображения
//
// Параметры:
//  СформироватьПериод	 - 	 - 
//
Процедура ОбновитьДанныеДляОтображения()
	
	УстановитьСвойстваОтображенияЭлементов();

	УстановитьПараметрыДинамическихСписков();
	
	// Если ВыбранныйРежим 		= 0 Тогда 
	//	ОбновитьМониторЗадач();			
	// ИначеЕсли ВыбранныйРежим 	= 1 Тогда
	//	ОбновитьПланировщик();
	// ИначеЕсли ВыбранныйРежим 	= 2 Тогда	

	// ИначеЕсли ВыбранныйРежим 	= 3 Тогда	
	//	
	// КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить видимость элементов
//
Процедура УстановитьСвойстваОтображенияЭлементов()
	
	// Управление свойствами элементов-переключателей режимов и заголовком формы
	Для Каждого ЭлементГруппаПереключательРежима Из Элементы.ГруппаПереключателиРежимов.ПодчиненныеЭлементы Цикл
		ЭлементГруппаПереключательРежима.ЦветФона = Новый Цвет();
		Если ТипЗнч(ЭлементГруппаПереключательРежима) = Тип("ГруппаФормы") Тогда 
			Для Каждого ЭлементКнопкаПереключательРежима Из ЭлементГруппаПереключательРежима.ПодчиненныеЭлементы Цикл
				ЭлементКнопкаПереключательРежима.ЦветТекста = Новый Цвет(0, 112, 210);
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;	
	Если ВыбранныйРежим = 2 Тогда 
		// ЭтаФорма.Заголовок 											= "Задачи";		
		Элементы.ГруппаКнопкиПерейтиРежимСписокЗадач.ЦветФона 		= Новый Цвет(234,228,226);				
		Элементы.ПерейтиРежимСписокЗадач.ЦветТекста 				= Новый Цвет();
		Элементы.СтраницыРежимов.ТекущаяСтраница = Элементы.СтраницаСписокЗадач;		
	ИначеЕсли ВыбранныйРежим = 3 Тогда
		// ЭтаФорма.Заголовок 											= "Процессы";		
		Элементы.ГруппаКнопкиПерейтиРежимСписокПроцессов.ЦветФона 	= Новый Цвет(234,228,226);						
		Элементы.ПерейтиРежимСписокПроцессов.ЦветТекста 			= Новый Цвет();
		Элементы.СтраницыРежимов.ТекущаяСтраница = Элементы.СтраницаСписокПроцессов;		
	КонецЕсли;
	
	// Управление свойствами элементов-переключателей видов бизнес-процессов	
	
	Если ТипЗнч(ОбъектКлюч) = Тип("СправочникСсылка.Контрагенты") Тогда
		// Элементы.ГруппаОтборовПоТипуБизнесПроцессов.Видимость = Истина;
		Элементы.ГруппаОтборовПоТипуБизнесПроцессов.Видимость = НЕ ВыбранныйРежим = 2;		
	КонецЕсли;	
		
	Для Каждого ЭлементГруппаПереключательТипПроцесса Из Элементы.ГруппаОтборовПоТипуБизнесПроцессов.ПодчиненныеЭлементы Цикл 
		ЭлементГруппаПереключательТипПроцесса.ЦветФона = Новый Цвет();
		Если ТипЗнч(ЭлементГруппаПереключательТипПроцесса) = Тип("ГруппаФормы") Тогда 
			Для Каждого ЭлементКнопкаПереключательТипПроцесса Из ЭлементГруппаПереключательТипПроцесса.ПодчиненныеЭлементы Цикл
				ЭлементКнопкаПереключательТипПроцесса.ЦветТекста = Новый Цвет(0, 112, 210);
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;	
	// Если ВыбранныйВидБизнесПроцесса = Перечисления.ВидыБизнесПроцессов.ПродажаЧленства_КОРП Тогда
	//	Элементы.ГруппаКнопкиУстановитьОтображениеПродажЧленств.ЦветФона				= Новый Цвет(234,228,226);				
	//	Элементы.ОтобразитьПродажиЧленств.ЦветТекста 									= Новый Цвет();
	//	Элементы.СтраницыПроцессов.ТекущаяСтраница = Элементы.СтраницаСпискаПроцессовПродажиЧленств;				
	// ИначеЕсли ВыбранныйВидБизнесПроцесса = Перечисления.ВидыБизнесПроцессов.ПродажаДополнительныхУслуг_КОРП Тогда
	//	Элементы.ГруппаКнопкиУстановитьОтображениеПродажДополнительныхУслуг.ЦветФона	= Новый Цвет(234,228,226);				
	//	Элементы.ОтобразитьПродажиДополнительныхУслуг.ЦветТекста 						= Новый Цвет();
	//	Элементы.СтраницыПроцессов.ТекущаяСтраница = Элементы.СтраницаСпискаПроцессовПродажиДополнительныхУслуг;						
	// ИначеЕсли ВыбранныйВидБизнесПроцесса = Перечисления.ВидыБизнесПроцессов.ПродлениеЧленства_КОРП Тогда
	//	Элементы.ГруппаКнопкиУстановитьОтображениеПродленияЧленств.ЦветФона				= Новый Цвет(234,228,226);						
	//	Элементы.ОтобразитьПродленияЧленств.ЦветТекста 									= Новый Цвет();
	//	Элементы.СтраницыПроцессов.ТекущаяСтраница = Элементы.СтраницаСпискаПроцессовПродленияЧленства;				
	// ИначеЕсли ВыбранныйВидБизнесПроцесса = Перечисления.ВидыБизнесПроцессов.ПродлениеПакетаУслуг_КОРП Тогда 
	//	Элементы.ГруппаКнопкиУстановитьОтображениеПродленияПакетовУслуг.ЦветФона		= Новый Цвет(234,228,226);						
	//	Элементы.ОтобразитьПродленияПакетовУслуг.ЦветТекста 							= Новый Цвет();
	//	Элементы.СтраницыПроцессов.ТекущаяСтраница = Элементы.СтраницаСпискаПроцессовПродленияПакетовУслуг;				
	// ИначеЕсли ВыбранныйВидБизнесПроцесса = Перечисления.ВидыБизнесПроцессов.КонтрольПлатежейПоРассрочкам_КОРП Тогда
	//	
	// КонецЕсли;
	
	Элементы.ГруппаОтборСтатусыВыполненности.Видимость 	= ВыбранныйРежим = 1 ИЛИ ВыбранныйРежим = 2;
	Элементы.ГруппаОтборВидыВзаимодействий.Видимость 	= ВыбранныйРежим = 1 ИЛИ ВыбранныйРежим = 2;
	Элементы.ГруппаОтборы.Видимость 					= ВыбранныйРежим = 1 ИЛИ ВыбранныйРежим = 2; 
	
КонецПроцедуры

&НаСервере
// Процедура - Установить параметры динамических списков
//
Процедура УстановитьПараметрыДинамическихСписков()
	
	ОтборСтатусыВыполненности = УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСтатусыВыполненности");
	ОтборСтатусыВыполненности = ?(ЗначениеЗаполнено(ОтборСтатусыВыполненности), ОтборСтатусыВыполненности, УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСтатусыВыполненности", Истина));		
	
	ОтборВидыВзаимодействий = УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборВидыВзаимодействий");
	ОтборВидыВзаимодействий = ?(ЗначениеЗаполнено(ОтборВидыВзаимодействий), ОтборВидыВзаимодействий, УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборВидыВзаимодействий", Истина));		
	
	// СегментСотрудников = Пользователи.ПолучитьЗначениеПоУмолчаниюПользователя(ТекущийПользователь, "ПросмотрЗадачСотрудников", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	//
	// ОтборСотрудники = Новый Массив;
	// Если ЗначениеЗаполнено(СегментСотрудников) Тогда
	//	ОтборСотрудники = РегистрыСведений.СоставСегментов.ВернутьСоставСегментаСотрудников(СегментСотрудников);
	//	Если ОтборСотрудники.Найти(ТекущийПользователь) = Неопределено Тогда 
	//		ОтборСотрудники.Добавить(ТекущийПользователь);
	//	КонецЕсли;
	// Иначе
	//	ОтборСотрудники.Добавить(ТекущийПользователь);
	// КонецЕсли;

	// Если ТипЗнч(ОбъектКлюч) = Тип("СправочникСсылка.Контрагенты") Тогда		
	//	СписокЗадач.ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	                           |	Задача.Ссылка КАК Ссылка,
	//	                           |	Задача.ПометкаУдаления КАК ПометкаУдаления,
	//	                           |	Задача.Номер КАК Номер,
	//	                           |	Задача.Дата КАК Дата,
	//	                           |	Задача.БизнесПроцесс КАК БизнесПроцесс,
	//	                           |	Задача.ТочкаМаршрута КАК ТочкаМаршрута,
	//	                           |	Задача.Наименование КАК Наименование,
	//	                           |	Задача.Выполнена КАК Выполнена,
	//	                           |	Задача.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//	                           |	Задача.РегламентнаяЗадача КАК РегламентнаяЗадача,
	//	                           |	Задача.Представление КАК Представление,
	//	                           |	Задача.ВидВзаимодействия КАК ВидВзаимодействия,
	//	                           |	Задача.ВидВзаимодействияСправочник КАК ВидВзаимодействияСправочник,
	//	                           |	Задача.ВзаимодействиеСостоялось КАК ВзаимодействиеСостоялось,
	//	                           |	Задача.ЗадачаАвтор КАК ЗадачаАвтор,
	//	                           |	Задача.ЗадачаНазначеннаяДата КАК ЗадачаНазначеннаяДата,
	//	                           |	Задача.ЗадачаОписание КАК ЗадачаОписание,
	//	                           |	Задача.ЗадачаПредмет.Контрагент КАК ЗадачаПредмет,
	//	                           |	Задача.ЗадачаТема КАК ЗадачаТема,
	//	                           |	Задача.НапоминаниеДатаНачала КАК НапоминаниеДатаНачала,
	//	                           |	Задача.НапоминаниеИспользовать КАК НапоминаниеИспользовать,
	//	                           |	Задача.ВариантНапоминания КАК ВариантНапоминания,
	//	                           |	Задача.СледующаяЗадачаНазначеннаяДата КАК СледующаяЗадачаНазначеннаяДата,
	//	                           |	Задача.СледующаяЗадачаНапоминаниеИспользовать КАК СледующаяЗадачаНапоминаниеИспользовать,
	//	                           |	Задача.СледующаяЗадачаНапоминаниеДатаНачала КАК СледующаяЗадачаНапоминаниеДатаНачала,
	//	                           |	Задача.СледующаяЗадачаВариантНапоминания КАК СледующаяЗадачаВариантНапоминания,
	//	                           |	Задача.СледующаяЗадачаИсполнитель КАК СледующаяЗадачаИсполнитель,
	//	                           |	Задача.ДатаИсполнения КАК ДатаИсполнения,
	//	                           |	Задача.РезультатВыполнения КАК РезультатВыполнения,
	//	                           |	Задача.РезультатВыполненияПодробно КАК РезультатВыполненияПодробно,
	//	                           |	Задача.Исполнитель КАК Исполнитель,
	//	                           |	ВЫБОР
	//	                           |		КОГДА ЧАС(Задача.ЗадачаНазначеннаяДата) = 0
	//	                           |				И МИНУТА(Задача.ЗадачаНазначеннаяДата) = 0
	//	                           |			ТОГДА ИСТИНА
	//	                           |		ИНАЧЕ ЛОЖЬ
	//	                           |	КОНЕЦ КАК ВесьДень,
	//	                           |	НАЧАЛОПЕРИОДА(Задача.ЗадачаНазначеннаяДата, ДЕНЬ) КАК ДатаБезВремени,
	//	                           |	ВЫБОР
	//	                           |		КОГДА НЕ Задача.Выполнена
	//	                           |				И НАЧАЛОПЕРИОДА(Задача.ЗадачаНазначеннаяДата, ДЕНЬ) < &ТекущаяДата
	//	                           |			ТОГДА ИСТИНА
	//	                           |		ИНАЧЕ ЛОЖЬ
	//	                           |	КОНЕЦ КАК Просроченная
	//	                           |ИЗ
	//	                           |	Задача.ЗадачаИсполнителя КАК Задача
	//	                           |ГДЕ
	//	                           |	Задача.Выполнена В(&МассивСостоянийВыполненности)
	//	                           |	И Задача.ВидВзаимодействияСправочник В(&МассивВидВзаимодействия)
	//	                           |	И Задача.ЗадачаПредмет ССЫЛКА Документ.Реализация
	//	                           |	И Задача.ЗадачаПредмет.Контрагент = &КонтрагентКлюч
	//	                           |	И НЕ Задача.Исполнитель = НЕОПРЕДЕЛЕНО
	//	                           |	И ВЫБОР
	//	                           |			КОГДА Задача.БизнесПроцесс ЕСТЬ NULL
	//	                           |					ИЛИ Задача.БизнесПроцесс = НЕОПРЕДЕЛЕНО
	//	                           |				ТОГДА ИСТИНА
	//	                           |			ИНАЧЕ НЕ Задача.БизнесПроцесс.ПометкаУдаления
	//	                           |		КОНЕЦ
	//	                           |	И Задача.ПометкаУдаления = ЛОЖЬ
	//	                           |	И Задача.Черновик = ЛОЖЬ
	//	                           |
	//	                           |ОБЪЕДИНИТЬ ВСЕ
	//	                           |
	//	                           |ВЫБРАТЬ
	//	                           |	Задача.Ссылка,
	//	                           |	Задача.ПометкаУдаления,
	//	                           |	Задача.Номер,
	//	                           |	Задача.Дата,
	//	                           |	Задача.БизнесПроцесс,
	//	                           |	Задача.ТочкаМаршрута,
	//	                           |	Задача.Наименование,
	//	                           |	Задача.Выполнена,
	//	                           |	Задача.СтруктурнаяЕдиница,
	//	                           |	Задача.РегламентнаяЗадача,
	//	                           |	Задача.Представление,
	//	                           |	Задача.ВидВзаимодействия,
	//	                           |	Задача.ВидВзаимодействияСправочник,
	//	                           |	Задача.ВзаимодействиеСостоялось,
	//	                           |	Задача.ЗадачаАвтор,
	//	                           |	Задача.ЗадачаНазначеннаяДата,
	//	                           |	Задача.ЗадачаОписание,
	//	                           |	Задача.ЗадачаПредмет.Контрагент,
	//	                           |	Задача.ЗадачаТема,
	//	                           |	Задача.НапоминаниеДатаНачала,
	//	                           |	Задача.НапоминаниеИспользовать,
	//	                           |	Задача.ВариантНапоминания,
	//	                           |	Задача.СледующаяЗадачаНазначеннаяДата,
	//	                           |	Задача.СледующаяЗадачаНапоминаниеИспользовать,
	//	                           |	Задача.СледующаяЗадачаНапоминаниеДатаНачала,
	//	                           |	Задача.СледующаяЗадачаВариантНапоминания,
	//	                           |	Задача.СледующаяЗадачаИсполнитель,
	//	                           |	Задача.ДатаИсполнения,
	//	                           |	Задача.РезультатВыполнения,
	//	                           |	Задача.РезультатВыполненияПодробно,
	//	                           |	Задача.Исполнитель,
	//	                           |	ВЫБОР
	//	                           |		КОГДА ЧАС(Задача.ЗадачаНазначеннаяДата) = 0
	//	                           |				И МИНУТА(Задача.ЗадачаНазначеннаяДата) = 0
	//	                           |			ТОГДА ИСТИНА
	//	                           |		ИНАЧЕ ЛОЖЬ
	//	                           |	КОНЕЦ,
	//	                           |	НАЧАЛОПЕРИОДА(Задача.ЗадачаНазначеннаяДата, ДЕНЬ),
	//	                           |	ВЫБОР
	//	                           |		КОГДА НЕ Задача.Выполнена
	//	                           |				И НАЧАЛОПЕРИОДА(Задача.ЗадачаНазначеннаяДата, ДЕНЬ) < &ТекущаяДата
	//	                           |			ТОГДА ИСТИНА
	//	                           |		ИНАЧЕ ЛОЖЬ
	//	                           |	КОНЕЦ
	//	                           |ИЗ
	//	                           |	Задача.ЗадачаИсполнителя КАК Задача
	//	                           |ГДЕ
	//	                           |	Задача.Выполнена В(&МассивСостоянийВыполненности)
	//	                           |	И Задача.ВидВзаимодействияСправочник В(&МассивВидВзаимодействия)
	//	                           |	И Задача.ЗадачаПредмет ССЫЛКА Документ.ЧленствоПакетУслуг
	//	                           |	И Задача.ЗадачаПредмет.Контрагент = &КонтрагентКлюч
	//	                           |	И НЕ Задача.Исполнитель = НЕОПРЕДЕЛЕНО
	//	                           |	И ВЫБОР
	//	                           |			КОГДА Задача.БизнесПроцесс ЕСТЬ NULL
	//	                           |					ИЛИ Задача.БизнесПроцесс = НЕОПРЕДЕЛЕНО
	//	                           |				ТОГДА ИСТИНА
	//	                           |			ИНАЧЕ НЕ Задача.БизнесПроцесс.ПометкаУдаления
	//	                           |		КОНЕЦ
	//	                           |	И Задача.ПометкаУдаления = ЛОЖЬ
	//	                           |	И Задача.Черновик = ЛОЖЬ
	//	                           |
	//	                           |ОБЪЕДИНИТЬ ВСЕ
	//	                           |
	//	                           |ВЫБРАТЬ
	//	                           |	Задача.Ссылка,
	//	                           |	Задача.ПометкаУдаления,
	//	                           |	Задача.Номер,
	//	                           |	Задача.Дата,
	//	                           |	Задача.БизнесПроцесс,
	//	                           |	Задача.ТочкаМаршрута,
	//	                           |	Задача.Наименование,
	//	                           |	Задача.Выполнена,
	//	                           |	Задача.СтруктурнаяЕдиница,
	//	                           |	Задача.РегламентнаяЗадача,
	//	                           |	Задача.Представление,
	//	                           |	Задача.ВидВзаимодействия,
	//	                           |	Задача.ВидВзаимодействияСправочник,
	//	                           |	Задача.ВзаимодействиеСостоялось,
	//	                           |	Задача.ЗадачаАвтор,
	//	                           |	Задача.ЗадачаНазначеннаяДата,
	//	                           |	Задача.ЗадачаОписание,
	//	                           |	Задача.ЗадачаПредмет,
	//	                           |	Задача.ЗадачаТема,
	//	                           |	Задача.НапоминаниеДатаНачала,
	//	                           |	Задача.НапоминаниеИспользовать,
	//	                           |	Задача.ВариантНапоминания,
	//	                           |	Задача.СледующаяЗадачаНазначеннаяДата,
	//	                           |	Задача.СледующаяЗадачаНапоминаниеИспользовать,
	//	                           |	Задача.СледующаяЗадачаНапоминаниеДатаНачала,
	//	                           |	Задача.СледующаяЗадачаВариантНапоминания,
	//	                           |	Задача.СледующаяЗадачаИсполнитель,
	//	                           |	Задача.ДатаИсполнения,
	//	                           |	Задача.РезультатВыполнения,
	//	                           |	Задача.РезультатВыполненияПодробно,
	//	                           |	Задача.Исполнитель,
	//	                           |	ВЫБОР
	//	                           |		КОГДА ЧАС(Задача.ЗадачаНазначеннаяДата) = 0
	//	                           |				И МИНУТА(Задача.ЗадачаНазначеннаяДата) = 0
	//	                           |			ТОГДА ИСТИНА
	//	                           |		ИНАЧЕ ЛОЖЬ
	//	                           |	КОНЕЦ,
	//	                           |	НАЧАЛОПЕРИОДА(Задача.ЗадачаНазначеннаяДата, ДЕНЬ),
	//	                           |	ВЫБОР
	//	                           |		КОГДА НЕ Задача.Выполнена
	//	                           |				И НАЧАЛОПЕРИОДА(Задача.ЗадачаНазначеннаяДата, ДЕНЬ) < &ТекущаяДата
	//	                           |			ТОГДА ИСТИНА
	//	                           |		ИНАЧЕ ЛОЖЬ
	//	                           |	КОНЕЦ
	//	                           |ИЗ
	//	                           |	Задача.ЗадачаИсполнителя КАК Задача
	//	                           |ГДЕ
	//	                           |	Задача.Выполнена В(&МассивСостоянийВыполненности)
	//	                           |	И Задача.ВидВзаимодействияСправочник В(&МассивВидВзаимодействия)
	//	                           |	И Задача.ЗадачаПредмет ССЫЛКА Справочник.Контрагенты
	//	                           |	И Задача.ЗадачаПредмет = &КонтрагентКлюч
	//	                           |	И НЕ Задача.Исполнитель = НЕОПРЕДЕЛЕНО
	//	                           |	И ВЫБОР
	//	                           |			КОГДА Задача.БизнесПроцесс ЕСТЬ NULL
	//	                           |					ИЛИ Задача.БизнесПроцесс = НЕОПРЕДЕЛЕНО
	//	                           |				ТОГДА ИСТИНА
	//	                           |			ИНАЧЕ НЕ Задача.БизнесПроцесс.ПометкаУдаления
	//	                           |		КОНЕЦ
	//	                           |	И Задача.ПометкаУдаления = ЛОЖЬ
	//	                           |	И Задача.Черновик = ЛОЖЬ
	//	                           |
	//	                           |ОБЪЕДИНИТЬ ВСЕ
	//	                           |
	//	                           |ВЫБРАТЬ
	//	                           |	Задача.Ссылка,
	//	                           |	Задача.ПометкаУдаления,
	//	                           |	Задача.Номер,
	//	                           |	Задача.Дата,
	//	                           |	Задача.БизнесПроцесс,
	//	                           |	Задача.ТочкаМаршрута,
	//	                           |	Задача.Наименование,
	//	                           |	Задача.Выполнена,
	//	                           |	Задача.СтруктурнаяЕдиница,
	//	                           |	Задача.РегламентнаяЗадача,
	//	                           |	Задача.Представление,
	//	                           |	Задача.ВидВзаимодействия,
	//	                           |	Задача.ВидВзаимодействияСправочник,
	//	                           |	Задача.ВзаимодействиеСостоялось,
	//	                           |	Задача.ЗадачаАвтор,
	//	                           |	Задача.ЗадачаНазначеннаяДата,
	//	                           |	Задача.ЗадачаОписание,
	//	                           |	Задача.ЗадачаПредмет,
	//	                           |	Задача.ЗадачаТема,
	//	                           |	Задача.НапоминаниеДатаНачала,
	//	                           |	Задача.НапоминаниеИспользовать,
	//	                           |	Задача.ВариантНапоминания,
	//	                           |	Задача.СледующаяЗадачаНазначеннаяДата,
	//	                           |	Задача.СледующаяЗадачаНапоминаниеИспользовать,
	//	                           |	Задача.СледующаяЗадачаНапоминаниеДатаНачала,
	//	                           |	Задача.СледующаяЗадачаВариантНапоминания,
	//	                           |	Задача.СледующаяЗадачаИсполнитель,
	//	                           |	Задача.ДатаИсполнения,
	//	                           |	Задача.РезультатВыполнения,
	//	                           |	Задача.РезультатВыполненияПодробно,
	//	                           |	Задача.Исполнитель,
	//	                           |	ВЫБОР
	//	                           |		КОГДА ЧАС(Задача.ЗадачаНазначеннаяДата) = 0
	//	                           |				И МИНУТА(Задача.ЗадачаНазначеннаяДата) = 0
	//	                           |			ТОГДА ИСТИНА
	//	                           |		ИНАЧЕ ЛОЖЬ
	//	                           |	КОНЕЦ,
	//	                           |	НАЧАЛОПЕРИОДА(Задача.ЗадачаНазначеннаяДата, ДЕНЬ),
	//	                           |	ВЫБОР
	//	                           |		КОГДА НЕ Задача.Выполнена
	//	                           |				И НАЧАЛОПЕРИОДА(Задача.ЗадачаНазначеннаяДата, ДЕНЬ) < &ТекущаяДата
	//	                           |			ТОГДА ИСТИНА
	//	                           |		ИНАЧЕ ЛОЖЬ
	//	                           |	КОНЕЦ
	//	                           |ИЗ
	//	                           |	Задача.ЗадачаИсполнителя КАК Задача
	//	                           |ГДЕ
	//	                           |	Задача.Выполнена В(&МассивСостоянийВыполненности)
	//	                           |	И Задача.ВидВзаимодействияСправочник В(&МассивВидВзаимодействия)
	//	                           |	И Задача.БизнесПроцесс ССЫЛКА БизнесПроцесс.ПродажаДополнительныхУслуг_КОРП
	//	                           |	И Задача.БизнесПроцесс.Контрагент = &КонтрагентКлюч
	//	                           |	И НЕ Задача.Исполнитель = НЕОПРЕДЕЛЕНО
	//	                           |	И ВЫБОР
	//	                           |			КОГДА Задача.БизнесПроцесс ЕСТЬ NULL
	//	                           |					ИЛИ Задача.БизнесПроцесс = НЕОПРЕДЕЛЕНО
	//	                           |				ТОГДА ИСТИНА
	//	                           |			ИНАЧЕ НЕ Задача.БизнесПроцесс.ПометкаУдаления
	//	                           |		КОНЕЦ
	//	                           |	И Задача.ПометкаУдаления = ЛОЖЬ
	//	                           |	И Задача.Черновик = ЛОЖЬ";		
	//	КонтрагентКлюч 			= ОбъектКлюч;
	//	ЧленствоПакетУслугКлюч 	= Неопределено;
	//	СписокЗадач.Параметры.УстановитьЗначениеПараметра("ТекущаяДата"			 			, НачалоДня(ТекущаяДатаСеанса()));
	//	// СписокЗадач.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиница"				, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	//	СписокЗадач.Параметры.УстановитьЗначениеПараметра("МассивСостоянийВыполненности"	, ОтборСтатусыВыполненности);
	//	СписокЗадач.Параметры.УстановитьЗначениеПараметра("МассивВидВзаимодействия"			, ОтборВидыВзаимодействий);	
	//	СписокЗадач.Параметры.УстановитьЗначениеПараметра("КонтрагентКлюч"					, КонтрагентКлюч);	
	//	// СписокЗадач.Параметры.УстановитьЗначениеПараметра("ОтборПоСотрудникам"				, ЗначениеЗаполнено(ОтборСотрудники));
	//	// СписокЗадач.Параметры.УстановитьЗначениеПараметра("Исполнитель"						, ОтборСотрудники);					
	// КонецЕсли;
	//
	//
	// Если ВыбранныйВидБизнесПроцесса = Перечисления.ВидыБизнесПроцессов.ПродажаЧленства_КОРП Тогда 
	//	СписокЗадач.Параметры.УстановитьЗначениеПараметра("ФильтрПоБизнесПроцессу"		, 1);
	// ИначеЕсли ВыбранныйВидБизнесПроцесса = Перечисления.ВидыБизнесПроцессов.ПродлениеЧленства_КОРП Тогда 
	//	СписокЗадач.Параметры.УстановитьЗначениеПараметра("ФильтрПоБизнесПроцессу"		, 2);	
	// ИначеЕсли ВыбранныйВидБизнесПроцесса = Перечисления.ВидыБизнесПроцессов.ПродлениеПакетаУслуг_КОРП Тогда 
	//	СписокЗадач.Параметры.УстановитьЗначениеПараметра("ФильтрПоБизнесПроцессу"		, 3);	
	// Иначе 
	//	СписокЗадач.Параметры.УстановитьЗначениеПараметра("ФильтрПоБизнесПроцессу"		, 0);	
	// КонецЕсли;	
	
	// Новый механизм
	// Продажа
	СписокПроцессовПродажиЧленств.Параметры.УстановитьЗначениеПараметра("ТекущаяДата"			 					, ТекущаяДатаСеанса());	
	// СписокПроцессовПродажиЧленств.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиница"						, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	// СписокПроцессовПродажиЧленств.Параметры.УстановитьЗначениеПараметра("КонтрагентКлюч"							, КонтрагентКлюч);	
	// СписокПроцессовПродажиЧленств.Параметры.УстановитьЗначениеПараметра("ОтборПоСотрудникам"						, ЗначениеЗаполнено(ОтборСотрудники));
	// СписокПроцессовПродажиЧленств.Параметры.УстановитьЗначениеПараметра("Исполнитель"								, ОтборСотрудники);			
	// Продажа доп. услуг
	СписокПроцессовПродажиДополнительныхУслуг.Параметры.УстановитьЗначениеПараметра("ТекущаяДата"			 					, ТекущаяДатаСеанса());	
	// СписокПроцессовПродажиДополнительныхУслуг.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиница"						, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	// СписокПроцессовПродажиДополнительныхУслуг.Параметры.УстановитьЗначениеПараметра("КонтрагентКлюч"							, КонтрагентКлюч);	
	// СписокПроцессовПродажиДополнительныхУслуг.Параметры.УстановитьЗначениеПараметра("ОтборПоСотрудникам"						, ЗначениеЗаполнено(ОтборСотрудники));
	// СписокПроцессовПродажиДополнительныхУслуг.Параметры.УстановитьЗначениеПараметра("Исполнитель"								, ОтборСотрудники);				
	// Продление членства
	СписокПроцессовПродленияЧленств.Параметры.УстановитьЗначениеПараметра("ТекущаяДата"			 					, ТекущаяДатаСеанса());	
	// СписокПроцессовПродленияЧленств.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиница"						, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	// СписокПроцессовПродленияЧленств.Параметры.УстановитьЗначениеПараметра("КонтрагентКлюч"							, КонтрагентКлюч);	
	// СписокПроцессовПродленияЧленств.Параметры.УстановитьЗначениеПараметра("ЧленствоПакетУслугКлюч"					, ЧленствоПакетУслугКлюч);			
	// СписокПроцессовПродленияЧленств.Параметры.УстановитьЗначениеПараметра("ОтборПоСотрудникам"						, ЗначениеЗаполнено(ОтборСотрудники));
	// СписокПроцессовПродленияЧленств.Параметры.УстановитьЗначениеПараметра("Исполнитель"								, ОтборСотрудники);				
	// Продление пакета услуг
	СписокПроцессовПродленияПакетовУслуг.Параметры.УстановитьЗначениеПараметра("ТекущаяДата"			 			, ТекущаяДатаСеанса());	
	// СписокПроцессовПродленияПакетовУслуг.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиница"					, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	// СписокПроцессовПродленияПакетовУслуг.Параметры.УстановитьЗначениеПараметра("КонтрагентКлюч"						, КонтрагентКлюч);	
	// СписокПроцессовПродленияПакетовУслуг.Параметры.УстановитьЗначениеПараметра("ЧленствоПакетУслугКлюч"				, ЧленствоПакетУслугКлюч);			
	// СписокПроцессовПродленияПакетовУслуг.Параметры.УстановитьЗначениеПараметра("ОтборПоСотрудникам"					, ЗначениеЗаполнено(ОтборСотрудники));
	// СписокПроцессовПродленияПакетовУслуг.Параметры.УстановитьЗначениеПараметра("Исполнитель"						, ОтборСотрудники);					
	
КонецПроцедуры





#КонецОбласти 