
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ДополнительныеПроцедурыИФункции

// Процедура, обновляет фото клиента.
 //  Параметры:
 //   Нет;
 //
Функция ПолучитьФотоКлиента(Клиент, ИдентификаторФормыДляПривязки)Экспорт
	 
	 Фото = Неопределено;
	 Если ЗначениеЗаполнено(Клиент) Тогда
		 ФайлКартинки  = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизитаПоПути(Клиент, "ФайлКартинки");   
		 // Установка значения реквизита АдресКартинки.
		 Если ЗначениеЗаполнено(ФайлКартинки) Тогда
			 // Фото = РаботаСФайламиСлужебный.ПолучитьНавигационнуюСсылкуВоВременномХранилище(ФайлКартинки);
			 
			 СсылкаНаДвоичныеДанные = РаботаСФайламиВызовСервераСтоматология.СсылкаНаДвоичныеДанныеФайла(ФайлКартинки, Новый УникальныйИдентификатор);
			 Фото = ?(СсылкаНаДвоичныеДанные = Неопределено, "", СсылкаНаДвоичныеДанные);
			 
		 Конецесли;	
	 КонецЕсли;
	 
	 Возврат Фото;
	 
КонецФункции

 // Функция - Выбор половины дня для отображения
// 
// Возвращаемое значение:
//   - 
//
Функция ВыборПоловиныДняДляОтображенияПланировщика() Экспорт
	
	НачалоИКонецДня = Справочники.СтруктурныеЕдиницы.ВремяРаботыСтруктурнойЕдиницы(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница,ДеньНедели(ТекущаяДата()));	
	Если НачалоИКонецДня = Неопределено Тогда
		НачалоИКонецДня = Новый Структура("НачалоРаботы,ОкончаниеРаботы",Дата(0001,01,01,00,00,00),Дата(0001,01,01,23,59,00));
	КонецЕсли;	
	
	ТекущееВремя = ТекущаяДата() - НачалоДня(ТекущаяДата());
	ПоловинаРабочегоДня = НачалоИКонецДня.ОкончаниеРаботы - НачалоИКонецДня.НачалоРаботы;

	Если ТекущееВремя < ПоловинаРабочегоДня Тогда
		Возврат "Утро"; 
	Иначе
		Возврат "Вечер";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
