
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийСотрудник;
	Элементы.Изменить.Видимость = РольДоступна(Метаданные.Роли.ПолныеПрава);
	Элементы.СоздатьСделку.Видимость = ПравоДоступа("Добавление", Метаданные.Справочники.Сделки);
	Если Элементы.СоздатьСделку.Видимость Тогда 
		МассивВидовСделок = ПолучитьВидыСделок();
		Элементы.СоздатьСделку.Доступность = НЕ МассивВидовСделок.Количество() = 0;
		Если МассивВидовСделок.Количество() > 1 Тогда
			Элементы.СоздатьСделку.Отображение = ОтображениеКнопки.КартинкаИТекст;
		Иначе 
			Элементы.СоздатьСделку.Отображение = ОтображениеКнопки.Текст;
		КонецЕсли;	
	КонецЕсли;
	
	// Должно вызываться до загрузки настроек из хранилища и формирования механизма фильтрации данных.
	ЗаполнитьОтборПоВидуСделки();
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Инициализируем настройки при первом открытии формы
	Если ХранилищеСистемныхНастроек.Загрузить("Справочник.Сделки.Форма.ФормаСпискаНовая/ТекущиеДанные") = Неопределено Тогда
		Настройки = Новый Соответствие;
		ХранилищеСистемныхНастроек.Сохранить("Справочник.Сделки.Форма.ФормаСпискаНовая/ТекущиеДанные", ,Настройки);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ИнициализироватьКонтекстноеМенюСменыВидаСделки();
	УстановитьОтображениеФильтраСтатусПациента(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка оповещения
//
// Параметры:
//  ИмяСобытия	 - 	 - 
//  Параметр	 - 	 - 
//  Источник	 - 	 - 
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОБНОВИТЬ_ОТБОРЫ_СПИСКА_СДЕЛОК" Тогда 
		ИнициализироватьМеханизмФильтрацииДанных(Параметр.Отбор, Истина);
	ИначеЕсли ИмяСобытия = "ОБНОВИТЬ_СВЕДЕНИЯ_ПО_СДЕЛКАМ" Тогда
		УстановитьЗаголовкиДополнительныхОтборов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события при загрузке данных из настроек на сервере.
//
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Параметры.Свойство("ПараметрыОтбора") Тогда
		ОбновитьМеханизмФильтрацииДанных(Параметры.ПараметрыОтбора, Истина);
		
	Иначе
		ИнициализироватьМеханизмФильтрацииДанных(Параметры.Отбор, Истина);
		
	КонецЕсли;
	
	СоздатьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Процедура, обработчик события "СписокВыбор".
//
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока 		 = Элементы.Список.ТекущиеДанные;
	
	Если Поле.Имя = "ЗапланированнаяПредварительнаяЗаписьДата"
		И ЗначениеЗаполнено(ТекущаяСтрока.ЗапланированнаяПредварительнаяЗапись) Тогда
		
		ПоказатьЗначение(,ТекущаяСтрока.ЗапланированнаяПредварительнаяЗапись);
	
	ИначеЕсли Поле.Имя = "ПоследняяЗадачаЗадачаНазначеннаяДата"
		И ЗначениеЗаполнено(ТекущаяСтрока.ПоследняяЗадача) Тогда
		
		ПоказатьЗначение(,ТекущаяСтрока.ПоследняяЗадача);
		
	ИначеЕсли Поле.Имя = "ЗапланированнаяЗадачаЗадачаНазначеннаяДата"
		И ЗначениеЗаполнено(ТекущаяСтрока.ЗапланированнаяЗадача)Тогда
		
		ПоказатьЗначение(,ТекущаяСтрока.ЗапланированнаяЗадача);
		
	ИначеЕсли Поле.Имя = "Клиент" 
		И ЗначениеЗаполнено(ТекущаяСтрока.Контрагент) Тогда
		
		ПоказатьЗначение(,ТекущаяСтрока.Контрагент);
		
	Иначе
		
		ПоказатьЗначение(,ТекущаяСтрока.Сделка);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "СписокПередНачаломДобавления".
//
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ВидСделкиОтбор(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораВидаСделки", ЭтотОбъект);
	ПоказатьВыборИзМеню(ОписаниеОповещения, ЭтотОбъект.ДоступныеВидыСделок, Элементы.ИзменитьВидСделки);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ОткрытьКанбан(Команда)
	
	ФормаКанбана = ПолучитьОткрытуюФорму("Справочник.Сделки.Форма.ФормаСпискаКанбан");
	
	ПараметрыОтбора = ПараметрыВыбранныхФильтровКлиент();
	ПараметрыОтбора.Вставить("ВидСделки"			, ЭтотОбъект.ОтборВидСделки);
	ПараметрыОтбора.Вставить("ОтборСтатусПациента"	, ЭтотОбъект.ОтборСтатусПациента);
	ПараметрыОтбора.Вставить("ОтборПоЗадачам"		, ЭтотОбъект.ОтборПоЗадачам);
	
	Если ФормаКанбана = Неопределено Тогда
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ПараметрыОтбора", ПараметрыОтбора);
		
		ОткрытьФорму("Справочник.Сделки.Форма.ФормаСпискаКанбан", ПараметрыОткрытия);
		
	Иначе
		ФормаКанбана.Активизировать();
		ФормаКанбана.УстановитьОтбор(ПараметрыОтбора);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события команды "Изменить".
//
Процедура Изменить(Команда)
	
	// Получаем выделенные элементы с динамического списка.
	ВыделенныеЭлементы = Элементы.Список.ВыделенныеСтроки.Количество();
	ЭтотОбъект.Действие = ?(ЗначениеЗаполнено(ЭтотОбъект.Действие), ЭтотОбъект.Действие, "РекламныйИсточник"); 	
	
	// Устанавливаем параметры для открытия формы.
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Действие"			 , ЭтотОбъект.Действие);
	ПараметрыФормы.Вставить("ВыделенныеЭлементы" , ВыделенныеЭлементы);
	ПараметрыФормы.Вставить("Количество"		 , ЭтотОбъект.КоличествоСделок);
	
	Если ЭтотОбъект.Действие = "Менеджера" Тогда
		
		ПараметрыФормы.Вставить("ДанныеДействия" 	 , ПолучениеТаблицыДействия());
		ПараметрыФормы.Вставить("ЗаменитьМенеджера"  , ЭтотОбъект.ЗаменитьМенеджераПоПродажамВКлиенте);
		ПараметрыФормы.Вставить("ЗаменитьИсполнителя", ЭтотОбъект.ЗаменитьИсполнителяВНеЗавершенныхЗадачах);
				
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Сделки.Форма.ФормаИзменить", 
				 ПараметрыФормы,,,,,
				 Новый ОписаниеОповещения("ИзменитьЗавершение", ЭтотОбъект),
				 РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
// Процедура Обработчик описания оповещения.
//
Процедура ИзменитьЗавершение(Результат, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		// Заполнение "Действие".
		Если Результат.Свойство("Действие") Тогда
			ЭтотОбъект.Действие = Результат.Действие;
			
			Если Результат.Действие = "Менеджера" Тогда
				
				// Заполнение таблицы значений ТаблицаДействия.
				Если Результат.Свойство("ДанныеДействия") Тогда
					ЗаполнениеТаблицыДействия(Результат.ДанныеДействия);
				КонецЕсли;
				
				// Установка параметра ЗаменитьМенеджераПоПродажамВКлиенте.
				Если Результат.Свойство("ЗаменитьМенеджера") Тогда
					ЭтотОбъект.ЗаменитьМенеджераПоПродажамВКлиенте = Результат.ЗаменитьМенеджера;
				КонецЕсли;
				
				// Установка параметра ЗаменитьИсполнителяВНеЗавершенныхЗадачах.
				Если Результат.Свойство("ЗаменитьИсполнителя") Тогда
					ЭтотОбъект.ЗаменитьИсполнителяВНеЗавершенныхЗадачах = Результат.ЗаменитьИсполнителя;
				КонецЕсли;
				
			ИначеЕсли Результат.Действие = "РекламныйИсточник" ИЛИ Результат.Действие = "КаналПривлечения" Тогда
				
				// Заполнение поля ЗначениеДействия. 
				Если Результат.Свойство("ЗначениеДействия") Тогда
					ЭтотОбъект.ЗначениеДействия = Результат.ЗначениеДействия;
				КонецЕсли;
				
			ИначеЕсли Результат.Действие = "ВидСделки" Тогда
				
				// Заполнение поля ВидСделки. 
				Если Результат.Свойство("ВидСделкиВыбор") Тогда
					ЭтотОбъект.ВидСделки = Результат.ВидСделкиВыбор;
				КонецЕсли;
				
				// Заполнение поля Этап. 
				Если Результат.Свойство("Этап") Тогда
					ЭтотОбъект.ЗначениеДействия = Результат.Этап;
				КонецЕсли;
				
			КонецЕсли;
			
			// Выполнение выбранной команды. 
			Если Результат.Свойство("ИмяВыбраннойКоманды") Тогда
				
				Если Результат.ИмяВыбраннойКоманды = "ПрименитьКВыделенным"  Тогда
					
					ВыделенныеЭлементы = Элементы.Список.ВыделенныеСтроки.Количество();
					
					Вопрос = СтрШаблон(НСтр("ru='Внимание!!! Изменения будут применены ко всем %1 выделенным строкам в списке. Эти изменения необратимы. Продолжить?';en='Attention!!! Changes will be applied to to all %1 selected lines in list. These changes are irreversible. Continue?'"), ВыделенныеЭлементы);
					
					Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбИзменении", ЭтотОбъект, Новый Структура("КоличествоВыделенныхСтрок", ВыделенныеЭлементы)); 
					
				ИначеЕсли Результат.ИмяВыбраннойКоманды = "ПрименитьКоВсем" Тогда 
					
					Вопрос = СтрШаблон(НСтр("ru='Внимание!!! Изменения будут применены ко всем %1 видимым строкам в списке (даже не выделенным). Эти изменения необратимы. Продолжить?';en='Attention!!! Changes will be applied to all %1 visible lines in list not even selected). These changes are irreversible. Continue?'"), ЭтотОбъект.КоличествоСделок);
					
					Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбИзменении", ЭтотОбъект); 
					
				КонецЕсли;
				
				ПоказатьВопрос(Оповещение,
				Вопрос,
				РежимДиалогаВопрос.ДаНет,
				0, // таймаут в секундах
				КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
				НСтр("ru='Вопрос пользователю';en='Question to user'"));  // (необ.) заголовок
					
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, заполнение данных в ТаблицаДействия.
//
Процедура ЗаполнениеТаблицыДействия(АдресВХ)
	
	ТаблицаДействия.Очистить();
	
	ДанныеДействия = ПолучитьИзВременногоХранилища(АдресВХ);
	
	Для каждого СтрокаТЗ из ДанныеДействия Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДействия.Добавить(), СтрокаТЗ) 
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Функция, получение данных из ТаблицаДействия.
//
Функция ПолучениеТаблицыДействия()
		
	Возврат ПоместитьВоВременноеХранилище(ТаблицаДействия.Выгрузить(), Новый УникальныйИдентификатор); 
	
КонецФункции

&НаКлиенте
// Процедура, ПослеВопросаОбИзменении.
//
Процедура ПослеВопросаОбИзменении(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ПрименитьНаСервере(ДопПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик команды.
//
Процедура УстановитьФильтрПостоянные(Команда)
	
	СтатусПостоянный = ПредопределенноеЗначение("Перечисление.СтатусыКонтрагентов.Постоянный");
	
	ЭтотОбъект.ОтборСтатусПациента = ?(ЭтотОбъект.ОтборСтатусПациента = СтатусПостоянный, Неопределено, СтатусПостоянный);
	УстановитьОтображениеФильтраСтатусПациента(ЭтотОбъект);
	
	АктуализироватьДанныеСпискаСогласноОтборов();
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик команды.
//
Процедура УстановитьФильтрНовые(Команда)
	
	СтатусНовый = ПредопределенноеЗначение("Перечисление.СтатусыКонтрагентов.Первичный");
	
	ЭтотОбъект.ОтборСтатусПациента = ?(ЭтотОбъект.ОтборСтатусПациента = СтатусНовый, Неопределено, СтатусНовый);
	УстановитьОтображениеФильтраСтатусПациента(ЭтотОбъект);
	
	АктуализироватьДанныеСпискаСогласноОтборов();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ОтборБезЗадач".
//
Процедура ОтборБезЗадач(Команда)
	
	ОбновитьОтборНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события команды "ОтборПросроченныхЗадач".
//
Процедура ОтборПросроченныхЗадач(Команда)
	
	ОбновитьОтборНаСервере(, Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ОтборСЗадачамиНаСегодня(Команда)
	
	ОбновитьОтборНаСервере(,, Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура СброситьОтборПоЗадачам(Команда)
	
	ОбновитьОтборНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
// Процедура, устанавливает отображение фильтра.
//
Процедура УстановитьОтображениеФильтраСтатусПациента(Форма)
	
	ЦветАктивности	 = Новый Цвет(218, 230, 244);
	ЦветПоУмолчанию	 = Новый Цвет(255, 255, 255);
	
	Форма.Элементы.ГруппаФильтрСтатусНовые.ЦветФона		 = ?(Форма.ОтборСтатусПациента = ПредопределенноеЗначение("Перечисление.СтатусыКонтрагентов.Первичный"), ЦветАктивности, ЦветПоУмолчанию);
	Форма.Элементы.ГруппаФильтрСтатусПостоянные.ЦветФона = ?(Форма.ОтборСтатусПациента = ПредопределенноеЗначение("Перечисление.СтатусыКонтрагентов.Постоянный"), ЦветАктивности, ЦветПоУмолчанию);
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет отбор по виду сделки значением по умолчанию.
//
Процедура ЗаполнитьОтборПоВидуСделки()
	
	ЭтотОбъект.ОтборВидСделки			 = ?(ЗначениеЗаполнено(ЭтотОбъект.ОтборВидСделки), ЭтотОбъект.ОтборВидСделки, Справочники.ВидыСделок.НовыеПациенты);
	Элементы.ИзменитьВидСделки.Заголовок = ЭтотОбъект.ОтборВидСделки.Наименование;
	
КонецПроцедуры

&НаСервере
// Процедура, ОтборНаСервере.
//
Процедура ОбновитьОтборНаСервере(ОтборБезАктивности = Ложь, ОтборПросроченныхЗадач = Ложь, ОтборЗадачНаСегодня = Ложь)
	
	Для Каждого Строка из ТаблицаФильтров Цикл
		Строка.Инициализирован = Ложь;
	КонецЦикла;
	
	МассивИменОчищаемыхФильтров = Новый Массив();
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Статус");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Этап");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_СотрудникРегистрации");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_РекламныйИсточник");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Тег");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Интерес");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПредварительнаяЗапись"); 	
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Задача"); 
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_КаналПривлечения");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПризнакВыполненияСделки"); 
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_СозданаПериод");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ЗавершенаПериод"); 
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПериодЗапланированнойЗадачи");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПричинаОтказа");		
	
	Если Не ОтборБезАктивности И Не ОтборПросроченныхЗадач И Не ОтборЗадачНаСегодня Тогда
		
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Менеджер");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_СтруктурнаяЕдиница"); 
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПометкаУдаленияСделки");		
		
	КонецЕсли;
	
	УправлениеИнтерфейсамиСервер.ДеактивироватьВсеЗначенияФильтрацииДанных(ЭтаФорма, МассивИменОчищаемыхФильтров);
	
	Если ОтборБезАктивности Тогда
		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПредварительнаяЗапись", Ложь);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Задача", Ложь);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПризнакВыполненияСделки", Ложь);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПометкаУдаленияСделки", Истина,,,, Ложь);
		
	ИначеЕсли ОтборПросроченныхЗадач Тогда
		
		МассивПериодаЗапланированнойЗадачи = Новый Массив();
		СтруктураПериода = Новый Структура();
		СтруктураПериода.Вставить("Вариант", ВариантСтандартногоПериода.ПроизвольныйПериод);
		СтруктураПериода.Вставить("ДатаНачала", Дата(01,01,0001));
		СтруктураПериода.Вставить("ДатаОкончания", КонецДня(ТекущаяДатаСеанса() - 86400));
		
		МассивПериодаЗапланированнойЗадачи.Добавить(СтруктураПериода);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПериодЗапланированнойЗадачи", МассивПериодаЗапланированнойЗадачи);		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПризнакВыполненияСделки", Ложь);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПометкаУдаленияСделки", Истина,,,, Ложь);
		
	ИначеЕсли ОтборЗадачНаСегодня Тогда
		
		СтруктураПериода = Новый Структура;
		СтруктураПериода.Вставить("Вариант"			, ВариантСтандартногоПериода.ПроизвольныйПериод);
		СтруктураПериода.Вставить("ДатаНачала"		, НачалоДня(ТекущаяДатаСеанса()));
		СтруктураПериода.Вставить("ДатаОкончания"	, КонецДня(ТекущаяДатаСеанса()));
		
		МассивПериодаЗапланированнойЗадачи = Новый_Массив(СтруктураПериода);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПериодЗапланированнойЗадачи", МассивПериодаЗапланированнойЗадачи);		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПризнакВыполненияСделки", Ложь);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПометкаУдаленияСделки", Истина,,,, Ложь);
		
	Иначе
		
		УстановитьОтображениеФильтровПоЗадачам(ЭтотОбъект, ОтборБезАктивности, ОтборПросроченныхЗадач, ОтборЗадачНаСегодня);
		АктуализироватьДанныеСпискаСогласноОтборов();	
		Возврат;
		
	КонецЕсли;
	
	СтруктураОтборов = Новый Структура();
	СтруктураОтборов.Вставить("ОтборМенеджер"				, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Менеджер"));
	СтруктураОтборов.Вставить("ОтборСтруктурнаяЕдиница"		, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СтруктурнаяЕдиница"));
	
	СписокМенеджеров = СтруктураОтборов.ОтборМенеджер;
	Если НЕ ЗначениеЗаполнено(СписокМенеджеров) Тогда
		СписокМенеджеров = СтруктураОтборов.ОтборМенеджер.ДоступныеЗначения;
	КонецЕсли;
	МассивМенеджеров = СписокМенеджеров.ВыгрузитьЗначения();
	УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Менеджер", МассивМенеджеров, Истина);
	
	СписокКлиник = СтруктураОтборов.ОтборСтруктурнаяЕдиница;
	Если НЕ ЗначениеЗаполнено(СписокКлиник) Тогда
		СписокКлиник = СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения;
	КонецЕсли;
	МассивКлиник = СписокКлиник.ВыгрузитьЗначения();
	УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтруктурнаяЕдиница", МассивКлиник);
	
	УстановитьОтображениеФильтровПоЗадачам(ЭтотОбъект, ОтборБезАктивности, ОтборПросроченныхЗадач, ОтборЗадачНаСегодня);
	
	АктуализироватьДанныеСпискаСогласноОтборов();	
	
КонецПроцедуры

#Область ____________________ОБРАБОТЧИКИ_МЕХАНИЗМА_ФИЛЬТРАЦИИ_ДАННЫХ________________________

#Область __________________ИНИЦИАЛИЗАЦИЯ_МЕХАНИЗМА_ФИЛЬТРАЦИИ______________________

&НаСервере
// Процедура - Инициализировать механизм фильтрации данных
//
// Параметры:
//  ПараметрыОтбора	 - 	 - 
//  ОбновитьСписок	 - 	 - 
//
Процедура ИнициализироватьМеханизмФильтрацииДанных(ПараметрыОтбора = Неопределено, ОбновитьСписок = Ложь)
	
	РезультатПакетногоЗапроса = ПолучитьПакетЗапросаЗначенийДляОтборов(ЭтотОбъект.ТекущийПользователь);	
	
	ОбновитьДинамическоеМенюФильтрации_Статус(РезультатПакетногоЗапроса[8].Выгрузить());
	ОбновитьДинамическоеМенюФильтрации_СтруктурнаяЕдиница(РезультатПакетногоЗапроса[9].Выгрузить());
	ОбновитьДинамическоеМенюФильтрации_ВидСделки(РезультатПакетногоЗапроса[10].Выгрузить());
	ОбновитьДинамическоеМенюФильтрации_Этап(РезультатПакетногоЗапроса[6].Выгрузить());
	ОбновитьДинамическоеМенюФильтрации_СотрудникРегистрации(РезультатПакетногоЗапроса[3].Выгрузить());
	ОбновитьДинамическоеМенюФильтрации_РекламныйИсточник(РезультатПакетногоЗапроса[4].Выгрузить());
	ОбновитьДинамическоеМенюФильтрации_Тег(РезультатПакетногоЗапроса[7].Выгрузить());
	ОбновитьДинамическоеМенюФильтрации_ПредварительнаяЗапись();
	ОбновитьДинамическоеМенюФильтрации_Задача();
	ОбновитьДинамическоеМенюФильтрации_ПризнакВыполненияСделки();
	ОбновитьДинамическоеМенюФильтрации_ПометкаУдаленияСделки();
	ОбновитьДинамическоеМенюФильтрации_ПричинаОтказа(РезультатПакетногоЗапроса[11].Выгрузить());
	ОбновитьДинамическоеМенюФильтрации_Менеджер(РезультатПакетногоЗапроса[1].Выгрузить());
	ОбновитьДинамическоеМенюФильтрации_СозданаПериод();
	ОбновитьДинамическоеМенюФильтрации_ПериодЗапланированнойЗадачи();
	ОбновитьДинамическоеМенюФильтрации_ЗавершенаПериод();
	ОбновитьДинамическоеМенюФильтрации_КаналПривлечения(РезультатПакетногоЗапроса[12].Выгрузить());
	
	ОбновитьОтборНаСервере(,, Истина);
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр статус.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Статус(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию	
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра	
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Статус пациента'; en = 'Patient status'"));	
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Статус");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Статус");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Статус");	
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Статус");	
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Статус");	
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыКонтрагентов"));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)	
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра	
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																														
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр вид сделки.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ВидСделки(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Вид сделки'; en = 'Type of transaction'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ВидСделки");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ВидСделки");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ВидСделки");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ВидСделки");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ВидСделки");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.ВидыСделок"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																											
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр этап.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Этап(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Этап'; en = 'Stage'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Этап");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Этап");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Этап");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Этап");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Этап");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.ЭтапыСделок"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
		
КонецПроцедуры

&НаСервере
// Процедура - Обновить динамическое меню фильтрации причина отказа
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ПричинаОтказа(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Причина отказа'; en = 'Rejection reason'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ПричинаОтказа");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ПричинаОтказа");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ПричинаОтказа");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ПричинаОтказа");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ПричинаОтказа");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.ПричиныОтказов"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр структурная единица.
//
// Параметры:
//  ТаблицаСтруктурныхЕдиниц - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_СтруктурнаяЕдиница(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Клиника'; en = 'Clinics'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.СтруктурныеЕдиницы.ПустаяСсылка(), НСтр("ru = '< неуказана>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр сотрудник регистрации.
//
// Параметры:
//  ТаблицаСтатусов			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_СотрудникРегистрации(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Кем создан'; en = 'Who created'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_СотрудникРегистрации");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_СотрудникРегистрации");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_СотрудникРегистрации");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_СотрудникРегистрации");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_СотрудникРегистрации");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.Сотрудники.ПустаяСсылка(), НСтр("ru = '<не указан>'; en = '<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр рекламный источник.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_РекламныйИсточник(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Источник'; en = 'Source'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_РекламныйИсточник");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_РекламныйИсточник");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_РекламныйИсточник");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_РекламныйИсточник");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_РекламныйИсточник");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.РекламныеИсточники"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.РекламныеИсточники.ПустаяСсылка(), НСтр("ru = '<не указан>'; en = '<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр тег.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Тег(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Тег'; en = 'Tag'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Тег");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Тег");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Тег");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Тег");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Тег");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.Теги"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.Теги.ПустаяСсылка(), НСтр("ru = '<не указан>'; en = '<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр интерес.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Интерес(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Интерес'; en = 'Interest'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Интерес");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Интерес");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Интерес");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Интерес");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Интерес");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.Интересы"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.Интересы.ПустаяСсылка(), НСтр("ru = '<не указан>'; en = '<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр канал привлечения.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_КаналПривлечения(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Рекламная площадка'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_КаналПривлечения");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_КаналПривлечения");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_КаналПривлечения");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_КаналПривлечения");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_КаналПривлечения");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.КаналыПривлечения"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.КаналыПривлечения.ПустаяСсылка(), НСтр("ru = '<не указана>'; en = '<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура - Обновить динамическое меню фильтрации предварительная запись
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ПредварительнаяЗапись(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Назначенный прием'; en = 'Appointment appointment'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ПредварительнаяЗапись");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ПредварительнаяЗапись");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ПредварительнаяЗапись");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ПредварительнаяЗапись");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ПредварительнаяЗапись");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("Булево"));	

	// Формируем коллекцию сами
	КоллекцияЗначений = Новый ТаблицаЗначений;
	КоллекцияЗначений.Колонки.Добавить("Ссылка"			, Новый ОписаниеТипов("Булево"));
	КоллекцияЗначений.Колонки.Добавить("Представление"	, Новый ОписаниеТипов("Строка"));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", Ложь, НСтр("ru= 'Нет назначенного приема'; en='No appointment'")));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр задача.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Задача(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Задачи'; en = 'Tasks'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Задача");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Задача");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Задача");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Задача");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Задача");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("Булево"));	

	// Формируем коллекцию сами
	КоллекцияЗначений = Новый ТаблицаЗначений;
	КоллекцияЗначений.Колонки.Добавить("Ссылка"			, Новый ОписаниеТипов("Булево"));
	КоллекцияЗначений.Колонки.Добавить("Представление"	, Новый ОписаниеТипов("Строка"));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", Ложь, НСтр("ru= 'Нет задач'; en='No tasks'")));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр менеджер.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Менеджер(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Куратор'; en = 'Curator'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Менеджер");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Менеджер");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Менеджер");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Менеджер");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Менеджер");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.Сотрудники.ПустаяСсылка(), НСтр("ru = '<не указан>'; en = '<not specified>'"), , Истина);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура - Обновить динамическое меню фильтрации врач
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Врач(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Врач'; en = 'Doctor'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Врач");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Врач");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Врач");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Врач");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Врач");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.Сотрудники.ПустаяСсылка(), НСтр("ru = '<не указан>'; en = '<not specified>'"), , Истина);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр признак выполнения сделки.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ПризнакВыполненияСделки(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Статус сделки'; en = 'Deal status'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ПризнакВыполненияСделки");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ПризнакВыполненияСделки");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ПризнакВыполненияСделки");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ПризнакВыполненияСделки");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ПризнакВыполненияСделки");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("Булево"));	

	// Формируем коллекцию сами
	КоллекцияЗначений = Новый ТаблицаЗначений;
	КоллекцияЗначений.Колонки.Добавить("Ссылка"			, Новый ОписаниеТипов("Булево"));
	КоллекцияЗначений.Колонки.Добавить("Представление"	, Новый ОписаниеТипов("Строка"));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", Истина	, НСтр("ru= 'Завершена'; en='Completed'")));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", Ложь	, НСтр("ru= 'Не завершена'; en='Not completed'")));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура - Обновить динамическое меню фильтрации пометка удаления сделки
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ПометкаУдаленияСделки(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Пометка удаления'; en = 'Delete mark'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ПометкаУдаленияСделки");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ПометкаУдаленияСделки");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ПометкаУдаленияСделки");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ПометкаУдаленияСделки");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ПометкаУдаленияСделки");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("Булево"));	
	СтруктураФильтра.Вставить("ВариантОтбора"							, Ложь);
	
	// Формируем коллекцию сами
	КоллекцияЗначений = Новый ТаблицаЗначений;
	КоллекцияЗначений.Колонки.Добавить("Ссылка"			, Новый ОписаниеТипов("Булево"));
	КоллекцияЗначений.Колонки.Добавить("Представление"	, Новый ОписаниеТипов("Строка"));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", Истина, НСтр("ru= 'Удалена'; en='Deleted'") ));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр период создана.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_СозданаПериод(ДанныеПериода = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Создана'; en = 'Created by'"));
	СтруктураФильтра.Вставить("РеквизитДата"							, НачалоДня(ТекущаяДатаСеанса()));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_СозданаПериод");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_СозданаПериод");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_СозданаПериод");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_СозданаПериод");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_СозданаПериод");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СтандартныйПериод"));
	
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, , Новый СтандартныйПериод, НСтр("ru = 'За весь период'; en = 'For all period'"));
																												
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры 

&НаСервере
// Процедура, инициализировать фильтр период завершена.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ЗавершенаПериод(ДанныеПериода = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Завершена'; en = 'Completed'"));
	СтруктураФильтра.Вставить("РеквизитДата"							, НачалоДня(ТекущаяДатаСеанса()));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ЗавершенаПериод");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ЗавершенаПериод");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ЗавершенаПериод");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ЗавершенаПериод");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ЗавершенаПериод");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СтандартныйПериод"));
	
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, , Новый СтандартныйПериод, НСтр("ru = 'За весь период'; en = 'For all period'"));
																												
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр период запланированной задачи.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ПериодЗапланированнойЗадачи(ДанныеПериода = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Запланированная задача'; en = 'Scheduled task'"));
	СтруктураФильтра.Вставить("РеквизитДата"							, НачалоДня(ТекущаяДатаСеанса()));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ПериодЗапланированнойЗадачи");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ПериодЗапланированнойЗадачи");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ПериодЗапланированнойЗадачи");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ПериодЗапланированнойЗадачи");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ПериодЗапланированнойЗадачи");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СтандартныйПериод"));
	
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, , Новый СтандартныйПериод, НСтр("ru = 'За весь период'; en = 'For all period'"));
																												
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура - Обновить значения фильтрации данных.
//
// Параметры:
//  ПараметрыОтбора				 - 	 - 
//  ОчиститьВсеФильтры			 - 	 - 
//  МассивИменОчищаемыхФильтров	 - 	 - 
//
Процедура ОбновитьЗначенияФильтрацииДанных(ПараметрыОтбора, ОчиститьВсеФильтры = Истина, МассивИменОчищаемыхФильтров = Неопределено)
	
	Если ОчиститьВсеФильтры Тогда 
		МассивИменОчищаемыхФильтров = Новый Массив();
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Статус");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_СтруктурнаяЕдиница");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ВидСделки");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Этап");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Менеджер");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Врач");		
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_СотрудникРегистрации");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_РекламныйИсточник");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Тег");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Интерес");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПредварительнаяЗапись"); 		
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Задача"); 
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_КаналПривлечения");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПризнакВыполненияСделки");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПометкаУдаленияСделки");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_СозданаПериод");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ЗавершенаПериод"); 
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПериодЗапланированнойЗадачи");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПричинаОтказа");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивИменОчищаемыхФильтров) Тогда 
		УправлениеИнтерфейсамиСервер.ДеактивироватьВсеЗначенияФильтрацииДанных(ЭтаФорма, МассивИменОчищаемыхФильтров);
	КонецЕсли;
	
	СписокСтатусовПометокУдаления = Новый СписокЗначений;
	СписокСтатусовПометокУдаления.Добавить(Истина, , Ложь);
	УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПометкаУдаленияСделки", СписокСтатусовПометокУдаления, Истина);		
	
	// Отбор статус.
	Если ПараметрыОтбора.Свойство("ОчиститьОтборПоСтатусу") Тогда 	
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Статус", ПараметрыОтбора.ОчиститьОтборПоСтатусу);
	КонецЕсли;
	
	// Отбор структурная единица.
	Если ПараметрыОтбора.Свойство("МассивСтруктурныхЕдиниц") Тогда 
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтруктурнаяЕдиница", ПараметрыОтбора.МассивСтруктурныхЕдиниц);		
	Иначе 
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	КонецЕсли;
	
	// Отбор вид сделки.
	Если ПараметрыОтбора.Свойство("МассивВидовСделок") Тогда 	
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ВидСделки", ПараметрыОтбора.МассивВидовСделок);		
	КонецЕсли;

	// Отбор этапы сделки.
	Если ПараметрыОтбора.Свойство("МассивЭтапов") Тогда 		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Этап", ПараметрыОтбора.МассивЭтапов);		
	КонецЕсли;	
	
	// Отбор причина отказа.
	Если ПараметрыОтбора.Свойство("МассивПричинОтказов") Тогда 		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПричинаОтказа", ПараметрыОтбора.МассивПричинОтказов);		
	КонецЕсли;	
	
	// Отбор признак наличия назначенного приема.
	Если ПараметрыОтбора.Свойство("МассивСтатусовНаличияПредварительнойЗаписи") ИЛИ ПараметрыОтбора.Свойство("СписокСтатусовНаличияПредварительнойЗаписи") Тогда 
		Если ПараметрыОтбора.Свойство("МассивСтатусовНаличияПредварительнойЗаписи") Тогда 
			МассивСтатусовНаличияПредварительнойЗаписи = Новый Массив();
			Если ЗначениеЗаполнено(ПараметрыОтбора.МассивСтатусовНаличияПредварительнойЗаписи) 
				И ПараметрыОтбора.МассивСтатусовНаличияПредварительнойЗаписи[0] = "Нет назначенного приема" Тогда
				
				МассивСтатусовНаличияПредварительнойЗаписи.Добавить(Ложь);
			Иначе
				МассивСтатусовНаличияПредварительнойЗаписи.Добавить(Истина);		
			КонецЕсли;
			УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПредварительнаяЗапись", МассивСтатусовНаличияПредварительнойЗаписи);
		ИначеЕсли ЗначениеЗаполнено(ПараметрыОтбора.СписокСтатусовНаличияПредварительнойЗаписи) 
				И ПараметрыОтбора.СписокСтатусовНаличияПредварительнойЗаписи[0].Значение = Ложь Тогда
			УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПредварительнаяЗапись", ПараметрыОтбора.СписокСтатусовНаличияПредварительнойЗаписи); 
		КонецЕсли;
		ОбновитьСписок = Истина;
	КонецЕсли;
	
	// Отбор признак наличия задач.
	Если ПараметрыОтбора.Свойство("МассивСтатусовНаличияЗадач") Тогда 
		
		МассивСтатусовНаличияЗадач = Новый Массив();
		Если ЗначениеЗаполнено(ПараметрыОтбора.МассивСтатусовНаличияЗадач) 
			И ПараметрыОтбора.МассивСтатусовНаличияЗадач[0] = "Нет задач" Тогда
			
			МассивСтатусовНаличияЗадач.Добавить(Ложь);
		Иначе
			МассивСтатусовНаличияЗадач.Добавить(Истина);		
		КонецЕсли;

		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Задача", МассивСтатусовНаличияЗадач);
		ОбновитьСписок = Истина;
	КонецЕсли;
	
	// Отбор статусов сделки.
	Если ПараметрыОтбора.Свойство("МассивСтатусовСделок") Тогда
		
		МассивСтатусовСделок = Новый Массив();
		Если ЗначениеЗаполнено(ПараметрыОтбора.МассивСтатусовСделок) 
			И ПараметрыОтбора.МассивСтатусовСделок[0] = "Нет" Тогда
			
			МассивСтатусовСделок.Добавить(Ложь);
		Иначе
			МассивСтатусовСделок.Добавить(Истина);		
		КонецЕсли;
		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПризнакВыполненияСделки", МассивСтатусовСделок);
	
	КонецЕсли;

	// Отбор менеджеров.
	Если ПараметрыОтбора.Свойство("МассивМенеджеров") Тогда 		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Менеджер", ПараметрыОтбора.МассивМенеджеров);
	КонецЕсли;	
	
	// Отбор врач.
	Если ПараметрыОтбора.Свойство("МассивВрачей") Тогда 		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Врач", ПараметрыОтбора.МассивВрачей);
	КонецЕсли;	
	
	// Отбор период запланированной задачи
	Если ПараметрыОтбора.Свойство("ПериодПланирования") Тогда    	
		
		МассивПериодаЗапланированнойЗадачи = Новый Массив();
		МассивПериодаЗапланированнойЗадачи.Добавить(ПараметрыОтбора.ПериодПланирования);
		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПериодЗапланированнойЗадачи", МассивПериодаЗапланированнойЗадачи);

	КонецЕсли;	
	
	// Отбор периода завершения сделки.
	Если ПараметрыОтбора.Свойство("ПериодСделки") Тогда    
		
		МассивПериодаЗавершенияСделки = Новый Массив();
		МассивПериодаЗавершенияСделки.Добавить(ПараметрыОтбора.ПериодСделки);
		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ЗавершенаПериод", МассивПериодаЗавершенияСделки);
		
	КонецЕсли;
	
	// Отбор канал привлечения.
	Если ПараметрыОтбора.Свойство("МассивКаналовПривлечения") Тогда 		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_КаналПривлечения", ПараметрыОтбора.МассивКаналовПривлечения);
	КонецЕсли;	
	
	АктуализироватьДанныеСпискаСогласноОтборов();
	
КонецПроцедуры

&НаСервере
// Процедура, актуализировать данные списка согласно отборов.
//
Процедура АктуализироватьДанныеСпискаСогласноОтборов()
	
	СтруктураОтборов 				= ПолучитьСтруктуруЗначенийОтбора();
	
	ЗапросДляКоличества 			= ПолучитьЗапросДляПодсчетаКоличества(СтруктураОтборов);
	ЗапросДляДинамическогоСписка 	= ПолучитьЗапросДляДинамическогоСписка(СтруктураОтборов);
	
	// Цепляем наш запрос динамическому списку
	Список.ТекстЗапроса = ЗапросДляДинамическогоСписка.Текст;
	
	// Устанавливаем параметры динамическому списку
	Для Каждого ПараметрЗапроса Из ЗапросДляДинамическогоСписка.Параметры Цикл 
		Список.Параметры.УстановитьЗначениеПараметра(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);		
	КонецЦикла;
	
	ВыборкаДляКоличества = ЗапросДляКоличества.Выполнить().Выбрать();
	Если ВыборкаДляКоличества.Следующий() Тогда
		КоличествоСделок = ВыборкаДляКоличества.КоличествоСделок;
		УстановитьЗаголовокКоличествоЭлементовВСписке(КоличествоСделок);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция, возвращает структуру отборов формы.
//
Функция ПолучитьСтруктуруЗначенийОтбора()
	
	// Метод "ПолучитьЗначенияФильтра" возвращает список активированных значений фильтра.
	// У полученного списка значений есть свойство "ДоступныеЗначения", в котором хранится список всех значений.
	// Таким образом мы одним методом за одну итерацию получаем 2 списка значений(с активированными значениями и всеми значениями).
	// Вариант отбора передается в свойстве "ДоступныеЗначения" в представлении у любого элемента списка.
	
	СтруктураОтборов = Новый Структура();
	СтруктураОтборов.Вставить("ОтборСтатус"						, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Статус"));
	СтруктураОтборов.Вставить("ОтборСтруктурнаяЕдиница"			, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СтруктурнаяЕдиница"));
	СтруктураОтборов.Вставить("ОтборМенеджер"					, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Менеджер"));		
	СтруктураОтборов.Вставить("ОтборВрач"						, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Врач"));	
	СтруктураОтборов.Вставить("ОтборВидСделки"					, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ВидСделки"));	
	СтруктураОтборов.Вставить("ОтборЭтап"						, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Этап"));
	СтруктураОтборов.Вставить("ОтборСотрудникРегистрации"		, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СотрудникРегистрации"));
	СтруктураОтборов.Вставить("ОтборРекламныйИсточник"			, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_РекламныйИсточник"));
	СтруктураОтборов.Вставить("ОтборТег"						, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Тег"));
	СтруктураОтборов.Вставить("ОтборПредварительнаяЗапись"		, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПредварительнаяЗапись"));	
	СтруктураОтборов.Вставить("ОтборЗадача"	 					, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Задача"));		
	СтруктураОтборов.Вставить("ОтборЗавершена"					, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПризнакВыполненияСделки"));
	СтруктураОтборов.Вставить("ОтборДатаСоздания"				, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СозданаПериод"));
	СтруктураОтборов.Вставить("ОтборДатаЗавершенияСделки"		, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ЗавершенаПериод"));
	СтруктураОтборов.Вставить("ОтборДатаЗапланированнойЗадачи"	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПериодЗапланированнойЗадачи"));
	СтруктураОтборов.Вставить("ОтборПометкаУдаления"			, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПометкаУдаленияСделки"));
	СтруктураОтборов.Вставить("ОтборПричинаОтказа"				, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПричинаОтказа"));
	СтруктураОтборов.Вставить("ОтборКаналПривлечения"			, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_КаналПривлечения"));
	СтруктураОтборов.Вставить("ВидСделки"						, ЭтотОбъект.ОтборВидСделки);
	СтруктураОтборов.Вставить("ОтборСтатусПациента"				, ЭтотОбъект.ОтборСтатусПациента);
	
	Возврат СтруктураОтборов;
	
КонецФункции	

&НаСервере
// Функция, возвращает запрос с установленными параметрами, для подсчета количества.
//
Функция ПолучитьЗапросДляПодсчетаКоличества(СтруктураОтборов)
	    
	// Шаблон текста запроса без отборов (чистый) для подсчета кол-ва	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(Сделки.Ссылка) КАК КоличествоСделок
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СделкиСведенияДляСписка КАК СделкиСведенияДляСписка
	|		ПО Сделки.Ссылка = СделкиСведенияДляСписка.Сделка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтрагентыСведенияДляСписка КАК КонтрагентыСведенияДляСписка
	|		ПО Сделки.Контрагент = КонтрагентыСведенияДляСписка.Контрагент
	|ГДЕ
	|	Сделки.ВидСделки = &ОтборВидСделки
	|	И ВЫБОР
	|			КОГДА &ОтборСтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КонтрагентыСведенияДляСписка.Статус = &ОтборСтатусПациента
	|		КОНЕЦ
	|	И &УсловиеПометкаУдаления
	|	И &УсловиеСтруктурнаяЕдиница
	|	И &УсловиеСотрудникРегистрации
	|	И &УсловиеМенеджер
	|	И &УсловиеВрач
	|	И &УсловиеРекламныйИсточник
	|	И &УсловиеКаналПривлечения
	|	И &УсловиеТеги
	|	И &УсловиеДатаСоздания
	|	И &УсловиеДатаЗавершенияСделки
	|	И &УсловиеДатаЗапланированнойЗадачи
	|	И &УсловиеОтборБезНазначенногоПриема
	|	И &УсловиеОтборБезЗадач
	|	И &УсловиеЭтап
	|	И &УсловиеЗавершена
	|	И &УсловиеПричинаОтказа";	
	
	// Отбор пометка удаления.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборПометкаУдаления)
		И СтруктураОтборов.ОтборПометкаУдаления[0].Значение = Истина Тогда
		
		УсловиеПометкаУдаления = СтруктураОтборов.ОтборПометкаУдаления.ДоступныеЗначения[0].Представление + "Сделки.ПометкаУдаления = ИСТИНА";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПометкаУдаления", УсловиеПометкаУдаления);
	Иначе		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПометкаУдаления", "ИСТИНА");
	КонецЕсли;	

	// Отбор структурная единица.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборСтруктурнаяЕдиница) Тогда
		УсловиеСтруктурнаяЕдиница = СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения[0].Представление + "Сделки.СтруктурнаяЕдиница В (&ОтборСтруктурнаяЕдиница)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", УсловиеСтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("ОтборСтруктурнаяЕдиница", СтруктураОтборов.ОтборСтруктурнаяЕдиница.ВыгрузитьЗначения());
	Иначе
		Если СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения.Количество() <> 0 Тогда 
			ВариантОтбора = СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения[0].Представление;
		Иначе 
			ВариантОтбора = "";
		КонецЕсли;			
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", ВариантОтбора + "Сделки.СтруктурнаяЕдиница В (&ОтборСтруктурнаяЕдиница)");			
		Запрос.УстановитьПараметр("ОтборСтруктурнаяЕдиница", СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения.ВыгрузитьЗначения());				
		// Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", "ИСТИНА");
	КонецЕсли;	
	
	// Отбор сотрудник регистрации.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборСотрудникРегистрации) Тогда
		УсловиеСотрудникРегистрации = СтруктураОтборов.ОтборСотрудникРегистрации.ДоступныеЗначения[0].Представление + "Сделки.Автор В (&ОтборСотрудникРегистрации)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСотрудникРегистрации", УсловиеСотрудникРегистрации);
		Запрос.УстановитьПараметр("ОтборСотрудникРегистрации", СтруктураОтборов.ОтборСотрудникРегистрации.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСотрудникРегистрации", "ИСТИНА");	
	КонецЕсли;
	
	// Отбор менеджер.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборМенеджер) Тогда
		УсловиеМенеджер = СтруктураОтборов.ОтборМенеджер.ДоступныеЗначения[0].Представление + "Сделки.Менеджер В (&ОтборМенеджер)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеМенеджер", УсловиеМенеджер);
		Запрос.УстановитьПараметр("ОтборМенеджер", СтруктураОтборов.ОтборМенеджер.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеМенеджер", "ИСТИНА");	
	КонецЕсли;
	
	// Отбор врач.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборВрач) Тогда
		УсловиеВрач = СтруктураОтборов.ОтборВрач.ДоступныеЗначения[0].Представление + "Сделки.Врач В (&ОтборВрач)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВрач", УсловиеВрач);
		Запрос.УстановитьПараметр("ОтборВрач", СтруктураОтборов.ОтборВрач.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВрач", "ИСТИНА");	
	КонецЕсли;
	
	// Отбор рекламный источник.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборРекламныйИсточник) Тогда
		УсловиеРекламныйИсточник = СтруктураОтборов.ОтборРекламныйИсточник.ДоступныеЗначения[0].Представление + "Сделки.ИсточникИнформации В (&ОтборРекламныйИсточник)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеРекламныйИсточник", УсловиеРекламныйИсточник);
		Запрос.УстановитьПараметр("ОтборРекламныйИсточник", СтруктураОтборов.ОтборРекламныйИсточник.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеРекламныйИсточник", "ИСТИНА");
	КонецЕсли;
	
	// Отбор канал привлечения.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборКаналПривлечения) Тогда
		УсловиеКаналПривлечения = СтруктураОтборов.ОтборКаналПривлечения.ДоступныеЗначения[0].Представление + "Сделки.КаналПривлечения В (&ОтборКаналПривлечения)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКаналПривлечения", УсловиеКаналПривлечения);
		Запрос.УстановитьПараметр("ОтборКаналПривлечения", СтруктураОтборов.ОтборКаналПривлечения.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКаналПривлечения", "ИСТИНА");
	КонецЕсли;
	
	// Отбор причина отказа.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборПричинаОтказа) Тогда
		УсловиеПричинаОтказа = СтруктураОтборов.ОтборПричинаОтказа.ДоступныеЗначения[0].Представление + "Сделки.ПричинаОтказа В (&ОтборПричинаОтказа)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПричинаОтказа", УсловиеПричинаОтказа);
		Запрос.УстановитьПараметр("ОтборПричинаОтказа", СтруктураОтборов.ОтборПричинаОтказа.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПричинаОтказа", "ИСТИНА");
	КонецЕсли;
	
	// Отбор тег.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборТег) Тогда
		
		УсловиеТеги =  
		"Сделки.Контрагент В
		|  		(ВЫБРАТЬ
		|  			СправочникКонтрагентыТеги.Ссылка
		|  		ИЗ
		|  			Справочник.Контрагенты.Теги КАК СправочникКонтрагентыТеги
		|  		ГДЕ
		|  			" + СтруктураОтборов.ОтборТег.ДоступныеЗначения[0].Представление + "СправочникКонтрагентыТеги.Тег В (&ОтборТеги))";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеТеги", УсловиеТеги);
		Запрос.УстановитьПараметр("ОтборТеги", СтруктураОтборов.ОтборТег.ВыгрузитьЗначения());
		
	Иначе	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеТеги", "ИСТИНА");
	КонецЕсли;
	
	// Отбор дата создания сделки.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборДатаСоздания) Тогда   
		
		УсловиеДатаСоздания = "Сделки.ДатаСделки МЕЖДУ &ДатаРегистрацииДатаНачала И &ДатаРегистрацииДатаОкончания"; 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДатаСоздания", УсловиеДатаСоздания);
		ДатаНачала = СтруктураОтборов.ОтборДатаСоздания[0].Значение.ДатаНачала;
		ДатаОкончания = СтруктураОтборов.ОтборДатаСоздания[0].Значение.ДатаОкончания;
		Запрос.УстановитьПараметр("ДатаРегистрацииДатаНачала"   , ?(ЗначениеЗаполнено(ДатаНачала),     ДатаНачала, Дата(01,01,0001)));
		Запрос.УстановитьПараметр("ДатаРегистрацииДатаОкончания", ?(ЗначениеЗаполнено(ДатаОкончания),  ДатаОкончания, Дата(3999,12,31)));
		
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДатаСоздания", "ИСТИНА")	
	КонецЕсли;
	
	// Отбор дата завершения сделки.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборДатаЗавершенияСделки) Тогда   
		
		УсловиеДатаЗавершенияСделки = "Сделки.ДатаЗавершенияСделки МЕЖДУ &ДатаЗавершенияСделкиДатаНачала И &ДатаЗавершенияСделкиДатаОкончания";
		Запрос.Текст 	= СтрЗаменить(Запрос.Текст, "&УсловиеДатаЗавершенияСделки", УсловиеДатаЗавершенияСделки);
		ДатаНачала 		= СтруктураОтборов.ОтборДатаЗавершенияСделки[0].Значение.ДатаНачала;
		ДатаОкончания 	= СтруктураОтборов.ОтборДатаЗавершенияСделки[0].Значение.ДатаОкончания;
		Запрос.УстановитьПараметр("ДатаЗавершенияСделкиДатаНачала"   , ?(ЗначениеЗаполнено(ДатаНачала),    ДатаНачала, Дата(01,01,0001)));
		Запрос.УстановитьПараметр("ДатаЗавершенияСделкиДатаОкончания", ?(ЗначениеЗаполнено(ДатаОкончания), ДатаОкончания, Дата(3999,12,31)));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДатаЗавершенияСделки", "ИСТИНА");		
	КонецЕсли;
	
	// Отбор дата запланированной задачи.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборДатаЗапланированнойЗадачи) Тогда
		Если ЗначениеЗаполнено(СтруктураОтборов.ОтборПредварительнаяЗапись)
		И СтруктураОтборов.ОтборПредварительнаяЗапись[0].Значение = Ложь Тогда
			УсловиеДатаЗапланированнойЗадачи = "СделкиСведенияДляСписка.ЗапланированнаяЗадача.ЗадачаНазначеннаяДата МЕЖДУ &ДатаНачалаЗапланированнойЗадачи И &ДатаОкончанияЗапланированнойЗадачи";
			УсловиеОтборБезНазначенногоПриема = СтруктураОтборов.ОтборПредварительнаяЗапись.ДоступныеЗначения[0].Представление + "СделкиСведенияДляСписка.ЗапланированнаяПредварительнаяЗапись = ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка) И СделкиСведенияДляСписка.Сделка.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)";	
			УсловиеДатаЗапланированнойЗадачи = "(" + УсловиеДатаЗапланированнойЗадачи + ") ИЛИ (" + УсловиеОтборБезНазначенногоПриема + ")";
		Иначе 
			УсловиеДатаЗапланированнойЗадачи = "СделкиСведенияДляСписка.ЗапланированнаяЗадача.ЗадачаНазначеннаяДата МЕЖДУ &ДатаНачалаЗапланированнойЗадачи И &ДатаОкончанияЗапланированнойЗадачи";
		КонецЕсли;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДатаЗапланированнойЗадачи", УсловиеДатаЗапланированнойЗадачи);
		ДатаНачала 		= СтруктураОтборов.ОтборДатаЗапланированнойЗадачи[0].Значение.ДатаНачала;
		ДатаОкончания 	= СтруктураОтборов.ОтборДатаЗапланированнойЗадачи[0].Значение.ДатаОкончания;

		// УсловиеДатаЗапланированнойЗадачи = "И СделкиСведенияДляСписка.ЗапланированнаяЗадача.ЗадачаНазначеннаяДата МЕЖДУ &ДатаНачалаЗапланированнойЗадачи И &ДатаОкончанияЗапланированнойЗадачи";
		Запрос.УстановитьПараметр("ДатаНачалаЗапланированнойЗадачи"   , ?(ЗначениеЗаполнено(ДатаНачала),     ДатаНачала, Дата(01,01,0001)));	
		Запрос.УстановитьПараметр("ДатаОкончанияЗапланированнойЗадачи", ?(ЗначениеЗаполнено(ДатаОкончания),  ДатаОкончания, Дата(3999,12,31)));
		
	Иначе                               
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДатаЗапланированнойЗадачи", "ИСТИНА");
	КонецЕсли;
	
	// Отбор признак наличия назначенного приема.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборПредварительнаяЗапись)
		И СтруктураОтборов.ОтборПредварительнаяЗапись[0].Значение = Ложь Тогда
		
		УсловиеОтборБезНазначенногоПриема = СтруктураОтборов.ОтборПредварительнаяЗапись.ДоступныеЗначения[0].Представление + "СделкиСведенияДляСписка.ЗапланированнаяПредварительнаяЗапись = ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка) И СделкиСведенияДляСписка.Сделка.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)";	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтборБезНазначенногоПриема", УсловиеОтборБезНазначенногоПриема);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтборБезНазначенногоПриема", "ИСТИНА");	
	КонецЕсли;
	
	// Отбор признак выполнения задачи сделки.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборЗадача)
		И СтруктураОтборов.ОтборЗадача[0].Значение = Ложь Тогда
		
		УсловиеОтборБезЗадач = СтруктураОтборов.ОтборЗадача.ДоступныеЗначения[0].Представление + "СделкиСведенияДляСписка.ЗапланированнаяЗадача = ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка) И СделкиСведенияДляСписка.Сделка.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)";	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтборБезЗадач", УсловиеОтборБезЗадач);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтборБезЗадач", "ИСТИНА");	
	КонецЕсли;
	
	// Отбор этап сделки.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборЭтап) Тогда	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЭтап", СтруктураОтборов.ОтборЭтап.ДоступныеЗначения[0].Представление + "Сделки.ЭтапСделки В (&ОтборЭтап)");		
		Запрос.УстановитьПараметр("ОтборЭтап", СтруктураОтборов.ОтборЭтап.ВыгрузитьЗначения());
	Иначе
		Если СтруктураОтборов.ОтборЭтап.ДоступныеЗначения.Количество() <> 0 Тогда 
			ВариантОтбора = СтруктураОтборов.ОтборЭтап.ДоступныеЗначения[0].Представление;
		Иначе 
			ВариантОтбора = "";
		КонецЕсли;	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЭтап", ВариантОтбора + "Сделки.ЭтапСделки В (&ОтборЭтап)");			
		Запрос.УстановитьПараметр("ОтборЭтап", СтруктураОтборов.ОтборЭтап.ДоступныеЗначения.ВыгрузитьЗначения());		
		// Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЭтап", "ИСТИНА");		
	КонецЕсли;
	
	// Отбор признак завершения сделки.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборЗавершена)
		И СтруктураОтборов.ОтборЗавершена[0].Значение = Истина Тогда
		
		УсловиеЗавершена = СтруктураОтборов.ОтборЗавершена.ДоступныеЗначения[0].Представление + "Сделки.РезультатСделки <> ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЗавершена", УсловиеЗавершена);
		
	ИначеЕсли ЗначениеЗаполнено(СтруктураОтборов.ОтборЗавершена)
		И СтруктураОтборов.ОтборЗавершена[0].Значение = Ложь Тогда			
		
		УсловиеЗавершена = СтруктураОтборов.ОтборЗавершена.ДоступныеЗначения[0].Представление + "Сделки.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)";			
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЗавершена", УсловиеЗавершена);
		
	Иначе		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЗавершена", "ИСТИНА");
	КонецЕсли;
	
	// Отбор вид сделки.
	Запрос.УстановитьПараметр("ОтборВидСделки", СтруктураОтборов.ВидСделки);
	
	// Отбор статус пациента (новый / постоянный).
	Запрос.УстановитьПараметр("ОтборСтатусПациента", СтруктураОтборов.ОтборСтатусПациента);
	
	Возврат Запрос;
	
КонецФункции

&НаСервере
// Функция, возвращает запрос с установленными параметрами, для списка формы.
//
Функция ПолучитьЗапросДляДинамическогоСписка(СтруктураОтборов)
	
	// текст запроса без отборов (чистый)
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сделки.ДатаСделки КАК ДатаСделки,
	|	Сделки.Ссылка КАК Сделка,
	|	Сделки.ЭтапСделки КАК ЭтапСделки,
	|	Сделки.ВидСделки КАК ВидСделки,
	|	Сделки.СуммаСделки КАК СуммаСделки,
	|	Сделки.Контрагент КАК Контрагент,
	|	Сделки.ИсточникИнформации КАК ИсточникИнформации,
	|	Сделки.КаналПривлечения КАК КаналПривлечения,
	|	Сделки.Менеджер КАК Менеджер,
	|	Сделки.Врач КАК Врач,
	|	Сделки.Автор КАК Автор,
	|	ВЫРАЗИТЬ(Сделки.ЭтапСделки.ЦветЭтапа КАК СТРОКА(100)) КАК ЦветЭтапа,
	|	СделкиСведенияДляСписка.ЗапланированнаяПредварительнаяЗапись КАК ЗапланированнаяПредварительнаяЗапись,
	|	СделкиСведенияДляСписка.ЗапланированнаяЗадача КАК ЗапланированнаяЗадача,
	|	СделкиСведенияДляСписка.ПоследняяЗадача КАК ПоследняяЗадача,
	|	Сделки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Сделки.ПричинаОтказа КАК ПричинаОтказа,
	|	Сделки.ВидСделки.НаименованиеЭтапаУспех КАК НаименованиеЭтапаУспех,
	|	Сделки.РезультатСделки КАК РезультатСделки,
	|	ВЫБОР
	|		КОГДА Сделки.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.Успех)
	|			ТОГДА Сделки.ВидСделки.НаименованиеЭтапаУспех
	|		КОГДА Сделки.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.Отказ)
	|			ТОГДА Сделки.ПричинаОтказа
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЗавершающийЭтапПояснение,
	|	КонтрагентыСведенияДляСписка.Статус КАК СтатусПациента
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СделкиСведенияДляСписка КАК СделкиСведенияДляСписка
	|		ПО Сделки.Ссылка = СделкиСведенияДляСписка.Сделка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтрагентыСведенияДляСписка КАК КонтрагентыСведенияДляСписка
	|		ПО Сделки.Контрагент = КонтрагентыСведенияДляСписка.Контрагент
	|ГДЕ
	|	Сделки.ВидСделки = &ОтборВидСделки
	|	И ВЫБОР
	|			КОГДА &ОтборСтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КонтрагентыСведенияДляСписка.Статус = &ОтборСтатусПациента
	|		КОНЕЦ
	|	И &УсловиеПометкаУдаления
	|	И &УсловиеСтруктурнаяЕдиница
	|	И &УсловиеСотрудникРегистрации
	|	И &УсловиеМенеджер
	|	И &УсловиеВрач
	|	И &УсловиеРекламныйИсточник
	|	И &УсловиеКаналПривлечения
	|	И &УсловиеТеги
	|	И &УсловиеДатаСоздания
	|	И &УсловиеДатаЗавершенияСделки
	|	И &УсловиеДатаЗапланированнойЗадачи
	|	И &УсловиеОтборБезНазначенногоПриема
	|	И &УсловиеОтборБезЗадач
	|	И &УсловиеЭтап
	|	И &УсловиеЗавершена
	|	И &УсловиеПричинаОтказа";	
	
	// Отбор пометка удаления.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборПометкаУдаления)
		И СтруктураОтборов.ОтборПометкаУдаления[0].Значение = Истина Тогда
		
		УсловиеПометкаУдаления = СтруктураОтборов.ОтборПометкаУдаления.ДоступныеЗначения[0].Представление + "Сделки.ПометкаУдаления = ИСТИНА";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПометкаУдаления", УсловиеПометкаУдаления);
	Иначе		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПометкаУдаления", "ИСТИНА");
	КонецЕсли;	

	// Отбор структурная единица.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборСтруктурнаяЕдиница) Тогда
		УсловиеСтруктурнаяЕдиница = СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения[0].Представление + "Сделки.СтруктурнаяЕдиница В (&ОтборСтруктурнаяЕдиница)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", УсловиеСтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("ОтборСтруктурнаяЕдиница", СтруктураОтборов.ОтборСтруктурнаяЕдиница.ВыгрузитьЗначения());
	Иначе
		Если СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения.Количество() <> 0 Тогда 
			ВариантОтбора = СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения[0].Представление;
		Иначе 
			ВариантОтбора = "";
		КонецЕсли;			
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", ВариантОтбора + "Сделки.СтруктурнаяЕдиница В (&ОтборСтруктурнаяЕдиница)");			
		Запрос.УстановитьПараметр("ОтборСтруктурнаяЕдиница", СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения.ВыгрузитьЗначения());		
		// Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", "ИСТИНА");
	КонецЕсли;	
	
	// Отбор сотрудник регистрации.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборСотрудникРегистрации) Тогда
		УсловиеСотрудникРегистрации = СтруктураОтборов.ОтборСотрудникРегистрации.ДоступныеЗначения[0].Представление + "Сделки.Автор В (&ОтборСотрудникРегистрации)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСотрудникРегистрации", УсловиеСотрудникРегистрации);
		Запрос.УстановитьПараметр("ОтборСотрудникРегистрации", СтруктураОтборов.ОтборСотрудникРегистрации.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСотрудникРегистрации", "ИСТИНА");	
	КонецЕсли;
	
	// Отбор менеджер.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборМенеджер) Тогда
		УсловиеМенеджер = СтруктураОтборов.ОтборМенеджер.ДоступныеЗначения[0].Представление + "Сделки.Менеджер В (&ОтборМенеджер)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеМенеджер", УсловиеМенеджер);
		Запрос.УстановитьПараметр("ОтборМенеджер", СтруктураОтборов.ОтборМенеджер.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеМенеджер", "ИСТИНА");	
	КонецЕсли;
	
	// Отбор врач.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборВрач) Тогда
		УсловиеВрач = СтруктураОтборов.ОтборВрач.ДоступныеЗначения[0].Представление + "Сделки.Врач В (&ОтборВрач)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВрач", УсловиеВрач);
		Запрос.УстановитьПараметр("ОтборВрач", СтруктураОтборов.ОтборВрач.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВрач", "ИСТИНА");	
	КонецЕсли;
	
	// Отбор рекламный источник.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборРекламныйИсточник) Тогда
		УсловиеРекламныйИсточник = СтруктураОтборов.ОтборРекламныйИсточник.ДоступныеЗначения[0].Представление + "Сделки.ИсточникИнформации В (&ОтборРекламныйИсточник)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеРекламныйИсточник", УсловиеРекламныйИсточник);
		Запрос.УстановитьПараметр("ОтборРекламныйИсточник", СтруктураОтборов.ОтборРекламныйИсточник.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеРекламныйИсточник", "ИСТИНА");
	КонецЕсли;
	
	// Отбор канал привлечения.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборКаналПривлечения) Тогда
		УсловиеКаналПривлечения = СтруктураОтборов.ОтборКаналПривлечения.ДоступныеЗначения[0].Представление + "Сделки.КаналПривлечения В (&ОтборКаналПривлечения)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКаналПривлечения", УсловиеКаналПривлечения);
		Запрос.УстановитьПараметр("ОтборКаналПривлечения", СтруктураОтборов.ОтборКаналПривлечения.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКаналПривлечения", "ИСТИНА");
	КонецЕсли;
	
	// Отбор причина отказа.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборПричинаОтказа) Тогда
		УсловиеПричинаОтказа = СтруктураОтборов.ОтборПричинаОтказа.ДоступныеЗначения[0].Представление + "Сделки.ПричинаОтказа В (&ОтборПричинаОтказа)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПричинаОтказа", УсловиеПричинаОтказа);
		Запрос.УстановитьПараметр("ОтборПричинаОтказа", СтруктураОтборов.ОтборПричинаОтказа.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПричинаОтказа", "ИСТИНА");
	КонецЕсли;
	
	// Отбор тег.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборТег) Тогда
		
		УсловиеТеги =  
		"Сделки.Контрагент В
		|  		(ВЫБРАТЬ
		|  			СправочникКонтрагентыТеги.Ссылка
		|  		ИЗ
		|  			Справочник.Контрагенты.Теги КАК СправочникКонтрагентыТеги
		|  		ГДЕ
		|  			"+СтруктураОтборов.ОтборТег.ДоступныеЗначения[0].Представление+"СправочникКонтрагентыТеги.Тег В (&ОтборТеги))";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеТеги", УсловиеТеги);
		Запрос.УстановитьПараметр("ОтборТеги", СтруктураОтборов.ОтборТег.ВыгрузитьЗначения());
		
	Иначе	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеТеги", "ИСТИНА");
	КонецЕсли;
	
	// Отбор дата создания сделки.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборДатаСоздания) Тогда   
		
		УсловиеДатаСоздания = "Сделки.ДатаСделки МЕЖДУ &ДатаРегистрацииДатаНачала И &ДатаРегистрацииДатаОкончания"; 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДатаСоздания", УсловиеДатаСоздания);
		ДатаНачала = СтруктураОтборов.ОтборДатаСоздания[0].Значение.ДатаНачала;
		ДатаОкончания = СтруктураОтборов.ОтборДатаСоздания[0].Значение.ДатаОкончания;
		Запрос.УстановитьПараметр("ДатаРегистрацииДатаНачала"   , ?(ЗначениеЗаполнено(ДатаНачала),     ДатаНачала, Дата(01,01,0001)));
		Запрос.УстановитьПараметр("ДатаРегистрацииДатаОкончания", ?(ЗначениеЗаполнено(ДатаОкончания),  ДатаОкончания, Дата(3999,12,31)));

	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДатаСоздания", "ИСТИНА")
		
	КонецЕсли;
	
	// Отбор дата завершения сделки.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборДатаЗавершенияСделки) Тогда   
		
		УсловиеДатаЗавершенияСделки = "Сделки.ДатаЗавершенияСделки МЕЖДУ &ДатаЗавершенияСделкиДатаНачала И &ДатаЗавершенияСделкиДатаОкончания";
		Запрос.Текст 	= СтрЗаменить(Запрос.Текст, "&УсловиеДатаЗавершенияСделки", УсловиеДатаЗавершенияСделки);
		ДатаНачала 		= СтруктураОтборов.ОтборДатаЗавершенияСделки[0].Значение.ДатаНачала;
		ДатаОкончания 	= СтруктураОтборов.ОтборДатаЗавершенияСделки[0].Значение.ДатаОкончания;
		Запрос.УстановитьПараметр("ДатаЗавершенияСделкиДатаНачала"   , ?(ЗначениеЗаполнено(ДатаНачала),    ДатаНачала, Дата(01,01,0001)));
		Запрос.УстановитьПараметр("ДатаЗавершенияСделкиДатаОкончания", ?(ЗначениеЗаполнено(ДатаОкончания), ДатаОкончания, Дата(3999,12,31)));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДатаЗавершенияСделки", "ИСТИНА");		
	КонецЕсли;
	
	// Отбор дата запланированной задачи.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборДатаЗапланированнойЗадачи) Тогда
		Если ЗначениеЗаполнено(СтруктураОтборов.ОтборПредварительнаяЗапись)
		И СтруктураОтборов.ОтборПредварительнаяЗапись[0].Значение = Ложь Тогда
			УсловиеДатаЗапланированнойЗадачи = "СделкиСведенияДляСписка.ЗапланированнаяЗадача.ЗадачаНазначеннаяДата МЕЖДУ &ДатаНачалаЗапланированнойЗадачи И &ДатаОкончанияЗапланированнойЗадачи";
			УсловиеОтборБезНазначенногоПриема = СтруктураОтборов.ОтборПредварительнаяЗапись.ДоступныеЗначения[0].Представление + "СделкиСведенияДляСписка.ЗапланированнаяПредварительнаяЗапись = ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка) И СделкиСведенияДляСписка.Сделка.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)";	
			УсловиеДатаЗапланированнойЗадачи = "(" + УсловиеДатаЗапланированнойЗадачи + ") ИЛИ (" + УсловиеОтборБезНазначенногоПриема + ")";
		Иначе 
			УсловиеДатаЗапланированнойЗадачи = "СделкиСведенияДляСписка.ЗапланированнаяЗадача.ЗадачаНазначеннаяДата МЕЖДУ &ДатаНачалаЗапланированнойЗадачи И &ДатаОкончанияЗапланированнойЗадачи";
		КонецЕсли;	
		Запрос.Текст 	= СтрЗаменить(Запрос.Текст, "&УсловиеДатаЗапланированнойЗадачи", УсловиеДатаЗапланированнойЗадачи);
		ДатаНачала 		= СтруктураОтборов.ОтборДатаЗапланированнойЗадачи[0].Значение.ДатаНачала;
		ДатаОкончания 	= СтруктураОтборов.ОтборДатаЗапланированнойЗадачи[0].Значение.ДатаОкончания;

		// УсловиеДатаЗапланированнойЗадачи = "И СделкиСведенияДляСписка.ЗапланированнаяЗадача.ЗадачаНазначеннаяДата МЕЖДУ &ДатаНачалаЗапланированнойЗадачи И &ДатаОкончанияЗапланированнойЗадачи";
		Запрос.УстановитьПараметр("ДатаНачалаЗапланированнойЗадачи"   , ?(ЗначениеЗаполнено(ДатаНачала),     ДатаНачала, Дата(01,01,0001)));	
		Запрос.УстановитьПараметр("ДатаОкончанияЗапланированнойЗадачи", ?(ЗначениеЗаполнено(ДатаОкончания),  ДатаОкончания, Дата(3999,12,31)));
		
	Иначе                               
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДатаЗапланированнойЗадачи", "ИСТИНА");
	КонецЕсли;
	
	// Отбор признак наличия назначенного приема.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборПредварительнаяЗапись)
		И СтруктураОтборов.ОтборПредварительнаяЗапись[0].Значение = Ложь Тогда
		
		УсловиеОтборБезНазначенногоПриема = СтруктураОтборов.ОтборПредварительнаяЗапись.ДоступныеЗначения[0].Представление + "СделкиСведенияДляСписка.ЗапланированнаяПредварительнаяЗапись = ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка) И СделкиСведенияДляСписка.Сделка.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)";	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтборБезНазначенногоПриема", УсловиеОтборБезНазначенногоПриема);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтборБезНазначенногоПриема", "ИСТИНА");	
	КонецЕсли;
	
	// Отбор без задач.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборЗадача)
		И СтруктураОтборов.ОтборЗадача[0].Значение = Ложь Тогда
		
		УсловиеОтборБезЗадач = СтруктураОтборов.ОтборЗадача.ДоступныеЗначения[0].Представление + "СделкиСведенияДляСписка.ЗапланированнаяЗадача = ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка) И СделкиСведенияДляСписка.Сделка.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)";	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтборБезЗадач", УсловиеОтборБезЗадач);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтборБезЗадач", "ИСТИНА");
	КонецЕсли;

	// Отбор этап сделки.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборЭтап) Тогда	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЭтап", СтруктураОтборов.ОтборЭтап.ДоступныеЗначения[0].Представление + "Сделки.ЭтапСделки В (&ОтборЭтап)");		
		Запрос.УстановитьПараметр("ОтборЭтап", СтруктураОтборов.ОтборЭтап.ВыгрузитьЗначения());
	Иначе
		Если СтруктураОтборов.ОтборЭтап.ДоступныеЗначения.Количество() <> 0 Тогда 
			ВариантОтбора = СтруктураОтборов.ОтборЭтап.ДоступныеЗначения[0].Представление;
		Иначе 
			ВариантОтбора = "";
		КонецЕсли;	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЭтап", ВариантОтбора + "Сделки.ЭтапСделки В (&ОтборЭтап)");			
		Запрос.УстановитьПараметр("ОтборЭтап", СтруктураОтборов.ОтборЭтап.ДоступныеЗначения.ВыгрузитьЗначения());		
		// Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЭтап", "ИСТИНА");		
	КонецЕсли;
	
	// Отбор завершения задачи сделки.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборЗавершена)
		И СтруктураОтборов.ОтборЗавершена[0].Значение = Истина Тогда
		
		УсловиеЗавершена = СтруктураОтборов.ОтборЗавершена.ДоступныеЗначения[0].Представление + "Сделки.РезультатСделки <> ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЗавершена", УсловиеЗавершена);
		
	ИначеЕсли ЗначениеЗаполнено(СтруктураОтборов.ОтборЗавершена)
		И СтруктураОтборов.ОтборЗавершена[0].Значение = Ложь Тогда			
		
		УсловиеЗавершена = СтруктураОтборов.ОтборЗавершена.ДоступныеЗначения[0].Представление + "Сделки.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)";			
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЗавершена", УсловиеЗавершена);
		
	Иначе		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЗавершена", "ИСТИНА");
	КонецЕсли;	
	
	// Отбор вид сделки.
	Запрос.УстановитьПараметр("ОтборВидСделки", СтруктураОтборов.ВидСделки);
	
	// Отбор статус пациента (новый / постоянный).
	Запрос.УстановитьПараметр("ОтборСтатусПациента", СтруктураОтборов.ОтборСтатусПациента);
	
	Возврат Запрос;
	
КонецФункции	

&НаСервереБезКонтекста
// Функция, возвращает пакет запроса с элементами для создания отборов.
//
Функция ПолучитьПакетЗапросаЗначенийДляОтборов(ТекущийПользователь)
	
	МассивСтруктурныхЕдиниц 	= Справочники.Сотрудники.ПолучитьМестаРаботыСотрудника(ТекущийПользователь, "Массив");		
	МассивВидовСделок 			= Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(, МассивСтруктурныхЕдиниц);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивВидовСделок"		, МассивВидовСделок);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"		, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Сотрудник"				, ТекущийПользователь);
	Запрос.УстановитьПараметр("ЛюбаяПричина"			, ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПричиныОтказов.ЛюбаяПричина"));
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сделки.ИсточникИнформации КАК ИсточникИнформации,
	|	Сделки.КаналПривлечения КАК КаналПривлечения,
	|	Сделки.Автор КАК Автор,
	|	Сделки.ЭтапСделки КАК ЭтапСделки,
	|	Сделки.Менеджер КАК Менеджер,
	|	Сделки.Врач КАК Врач
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|
	|СГРУППИРОВАТЬ ПО
	|	Сделки.ИсточникИнформации,
	|	Сделки.КаналПривлечения,
	|	Сделки.Автор,
	|	Сделки.Менеджер,
	|	Сделки.ЭтапСделки,
	|	Сделки.Врач
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.Представление КАК Представление
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаСделок.Менеджер
	|			ИЗ
	|				ТаблицаСделок)
	|	И Сотрудники.Ссылка <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И Сотрудники.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.Представление КАК Представление
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаСделок.Врач
	|			ИЗ
	|				ТаблицаСделок)
	|	И Сотрудники.Ссылка <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И Сотрудники.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.Представление КАК Представление
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаСделок.Автор
	|			ИЗ
	|				ТаблицаСделок)
	|	И Сотрудники.Ссылка <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И Сотрудники.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РекламныеИсточники.Ссылка КАК Ссылка,
	|	РекламныеИсточники.Представление КАК Представление
	|ИЗ
	|	Справочник.РекламныеИсточники КАК РекламныеИсточники
	|ГДЕ
	|	РекламныеИсточники.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаСделок.ИсточникИнформации
	|			ИЗ
	|				ТаблицаСделок)
	|	И РекламныеИсточники.Ссылка <> ЗНАЧЕНИЕ(Справочник.РекламныеИсточники.ПустаяСсылка)
	|	И РекламныеИсточники.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыСделок.Ссылка КАК Ссылка,
	|	ВидыСделок.Представление КАК Представление
	|ПОМЕСТИТЬ ТаблицаВидовСделок
	|ИЗ
	|	Справочник.ВидыСделок КАК ВидыСделок
	|ГДЕ
	|	ВидыСделок.Ссылка В(&МассивВидовСделок)
	|	И ВидыСделок.ПометкаУдаления = ЛОЖЬ
	|	И (ВидыСделок.СтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ИЛИ ВидыСделок.СтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЭтапыСделок.Ссылка КАК Ссылка,
	|	ЭтапыСделок.Представление КАК Представление
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаСделок.ЭтапСделки
	|			ИЗ
	|				ТаблицаСделок
	|			СГРУППИРОВАТЬ ПО
	|				ТаблицаСделок.ЭтапСделки)
	|	И ЭтапыСделок.Ссылка <> ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.ПустаяСсылка)
	|	И ЭтапыСделок.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА ЭтапыСделок.Предопределенный
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЭтапыСделок.ВидСделки В
	|					(ВЫБРАТЬ
	|						ТаблицаВидовСделок.Ссылка КАК Ссылка
	|					ИЗ
	|						ТаблицаВидовСделок КАК ТаблицаВидовСделок)
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтапыСделок.Предопределенный,
	|	ЭтапыСделок.ВидСделки,
	|	ЭтапыСделок.НомерЭтапа,
	|	Ссылка УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Теги.Ссылка КАК Ссылка,
	|	Теги.Представление КАК Представление
	|ИЗ
	|	Справочник.Теги КАК Теги
	|ГДЕ
	|	Теги.ПометкаУдаления = ЛОЖЬ
	|	И Теги.Ссылка <> ЗНАЧЕНИЕ(Справочник.Теги.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СтатусыКлиентов.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СтатусыКлиентов.Ссылка) КАК Представление
	|ИЗ
	|	Перечисление.СтатусыКонтрагентов КАК СтатусыКлиентов
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыКлиентов.Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СтруктурныеЕдиницы.Ссылка) КАК Представление
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	СтруктурныеЕдиницы.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыСделок.Ссылка КАК Ссылка,
	|	ВидыСделок.Представление КАК Представление
	|ИЗ
	|	ТаблицаВидовСделок КАК ВидыСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПричиныОтказов.Ссылка КАК Ссылка,
	|	ПричиныОтказов.Представление КАК Представление
	|ИЗ
	|	Справочник.ПричиныОтказов КАК ПричиныОтказов
	|ГДЕ
	|	ПричиныОтказов.Ссылка <> &ЛюбаяПричина
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КаналыПривлечения.Ссылка КАК Ссылка,
	|	КаналыПривлечения.Представление КАК Представление
	|ИЗ
	|	Справочник.КаналыПривлечения КАК КаналыПривлечения
	|ГДЕ
	|	КаналыПривлечения.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаСделок.КаналПривлечения
	|			ИЗ
	|				ТаблицаСделок)
	|	И КаналыПривлечения.Ссылка <> ЗНАЧЕНИЕ(Справочник.КаналыПривлечения.ПустаяСсылка)
	|	И КаналыПривлечения.ПометкаУдаления = ЛОЖЬ";
	
	Возврат Запрос.ВыполнитьПакет();
	        	
КонецФункции

#КонецОбласти

#Область ___________________ОБРАБОТЧИКИ_МЕХАНИЗМА_ФИЛЬТРАЦИИ_______________________

&НаСервере
// Процедура - Применить механизм фильтрации данных.
//
// Параметры:
//  ДанныеЭлементаФильтрации - 	 - 
//
Процедура ПрименитьМеханизмФильтрацииДанных(ДанныеЭлементаФильтрации) Экспорт
	
	МассивСтрокОбрабатываемыхФильтров = ТаблицаФильтров.НайтиСтроки(Новый Структура("Применен", Ложь));
	Для Каждого СтрокаФильтра ИЗ МассивСтрокОбрабатываемыхФильтров Цикл
		УправлениеИнтерфейсамиСервер.ОбновитьГруппуАктивированныхЗначенийФильтра(ЭтаФорма, СтрокаФильтра);
	КонецЦикла;
	
	АктуализироватьДанныеСпискаСогласноОтборов();	
	ЭтаФорма.ТекущийЭлемент = Элементы.Список;
		
КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик нажатия элемента фильтрации данных.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОбработчикНажатияЭлементаФильтрацииДанных(Команда, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	МассивИмен = СтрРазделить(Команда.Имя,"_");
	
	Если МассивИмен.Количество() <> 0 Тогда 
		
		Если МассивИмен[0] = "Удалить" Тогда
			
			РезультатОбновления = УправлениеИнтерфейсамиКлиент.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, Команда.Имя, , ВыбранноеЗначение);
			Если РезультатОбновления.Свойство("ДействиеЭлемента") И РезультатОбновления.ДействиеЭлемента = "ОбработкаВыбора" Тогда 
				Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда 
					СтандартнаяОбработка = Ложь;
					// ВыбранноеЗначение = Неопределено;
					// ЭлементФормы.ОбновитьТекстРедактирования(); 			
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			ИсключаемыеФильтры = Новый Массив;
			ИсключаемыеФильтры.Добавить("ВидСделки");
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Отбор"				, ПараметрыВыбранныхФильтров(Новый Структура));
			ПараметрыФормы.Вставить("ИмяКоманды"		, Команда.Имя);
			ПараметрыФормы.Вставить("ВыбранноеЗначение"	, ВыбранноеЗначение);
			ПараметрыФормы.Вставить("ИсключаемыеФильтры", ИсключаемыеФильтры);
			
			ОткрытьФорму("Справочник.Сделки.Форма.ФормаФильтры",
						 ПараметрыФормы,,,,,
						 Новый ОписаниеОповещения("ОткрытиеФильтровЗавершение", ЭтотОбъект),
						 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - получение сведений о выбранных фильтрах.
//
Функция ПараметрыВыбранныхФильтров(ПараметрыОтбора)
	
	Для каждого Строка из ТаблицаФильтров Цикл
		Если Строка.КоличествоАктивированныхЗначений > 0 Тогда
			
			МассивДанных = ПолучениеЭлементовОтбора(Новый Массив, Строка.СписокЗначений, Строка.Наименование);
			
			Если Строка.Наименование = "Фильтр_Статус" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусов"			   				, МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусов_ВариантОтбора"				, Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_СтруктурнаяЕдиница" Тогда
				ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц"					, МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц_ВариантОтбора"	, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_ВидСделки" Тогда
				ПараметрыОтбора.Вставить("МассивВидовСделок"			  			, МассивДанных);
				ПараметрыОтбора.Вставить("МассивВидовСделок_ВариантОтбора"			, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Этап" Тогда
				ПараметрыОтбора.Вставить("МассивЭтапов"			     				, МассивДанных);
				ПараметрыОтбора.Вставить("МассивЭтапов_ВариантОтбора"				, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Менеджер" Тогда
				ПараметрыОтбора.Вставить("МассивМенеджеров"				 			, МассивДанных);
				ПараметрыОтбора.Вставить("МассивМенеджеров_ВариантОтбора"			, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Врач" Тогда
				ПараметрыОтбора.Вставить("МассивВрачей"				 				, МассивДанных);
				ПараметрыОтбора.Вставить("МассивВрачей_ВариантОтбора"				, Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_СотрудникРегистрации" Тогда
				ПараметрыОтбора.Вставить("МассивСотрудниковРегистрации"				 , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСотрудниковРегистрации_ВариантОтбора", Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_РекламныйИсточник" Тогда
				ПараметрыОтбора.Вставить("МассивРекламныхИсточников"			  	, МассивДанных);
				ПараметрыОтбора.Вставить("МассивРекламныхИсточников_ВариантОтбора"	, Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_ПричинаОтказа" Тогда
				ПараметрыОтбора.Вставить("МассивПричинОтказов"			  			, МассивДанных);
				ПараметрыОтбора.Вставить("МассивПричинОтказов_ВариантОтбора"		, Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_Тег" Тогда
				ПараметрыОтбора.Вставить("МассивТегов"								, МассивДанных);
				ПараметрыОтбора.Вставить("МассивТегов_ВариантОтбора"				, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Интерес" Тогда
				ПараметрыОтбора.Вставить("МассивИнтересов"							, МассивДанных);
				ПараметрыОтбора.Вставить("МассивИнтересов_ВариантОтбора"			, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_КаналПривлечения" Тогда
				ПараметрыОтбора.Вставить("МассивКаналовПривлечения"				 	, МассивДанных);
				ПараметрыОтбора.Вставить("МассивКаналовПривлечения_ВариантОтбора"	, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_ПредварительнаяЗапись" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусовНаличияПредварительнойЗаписи"			   , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусовНаличияПредварительнойЗаписи_ВариантОтбора", Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_Задача" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусовНаличияЗадач"			   , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусовНаличияЗадач_ВариантОтбора", Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_ПризнакВыполненияСделки" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусовСделок"			     , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусовСделок_ВариантОтбора", Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_ПометкаУдаленияСделки" Тогда
				ПараметрыОтбора.Вставить("СписокСтатусовПометокУдаления"			  , МассивДанных);
				ПараметрыОтбора.Вставить("СписокСтатусовПометокУдаления_ВариантОтбора", Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_СозданаПериод" Тогда
				ПараметрыОтбора.Вставить("ПериодСозданияСделки", МассивДанных);

			ИначеЕсли Строка.Наименование = "Фильтр_ПериодЗапланированнойЗадачи" Тогда
				ПараметрыОтбора.Вставить("ПериодПланирования", МассивДанных);

			ИначеЕсли Строка.Наименование = "Фильтр_ЗавершенаПериод" Тогда
				ПараметрыОтбора.Вставить("ПериодСделки", МассивДанных);	
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ПараметрыОтбора, Новый УникальныйИдентификатор);
	
КонецФункции

&НаСервереБезКонтекста
// Функция - ПолучениеЭлементовОтбора
Функция ПолучениеЭлементовОтбора(Массив, СписокЗначений, НаименованиеФильтра)
	
	Если НаименованиеФильтра = "Фильтр_СозданаПериод" 
		ИЛИ НаименованиеФильтра = "Фильтр_ЗавершенаПериод" 
		ИЛИ НаименованиеФильтра = "Фильтр_ПериодЗапланированнойЗадачи" Тогда
		
		Если СписокЗначений.Количество() > 0 Тогда
			ЗаданноеЗначение = СписокЗначений.Получить(0).Значение; 
			Массив.Добавить(ЗаданноеЗначение.ЗначениеФильтра);
		КонецЕсли;
		
	Иначе
		
		Если СписокЗначений.Количество() > 0 Тогда
			Для каждого Значение из СписокЗначений Цикл
				Если Значение.Значение.Выбран = Истина Тогда
					Массив.Добавить(Значение.Значение.ЗначениеФильтра);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
// Процедура - ОткрытиеФильтровЗавершение.
//
Процедура ОткрытиеФильтровЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытиеФильтровНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
// Процедура - ОткрытиеФильтровНаСервере.
//
Процедура ОткрытиеФильтровНаСервере(Результат)
	
	ПараметрыОтбора = ПолучитьИзВременногоХранилища(Результат);
	ОбновитьМеханизмФильтрацииДанных(ПараметрыОтбора, Истина);	
	
	// Сбрасываем фильтр по задачам после изменения фильтра.
	УстановитьОтображениеФильтровПоЗадачам(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
// Процедура - Инициализировать механизм фильтрации данных
//
// Параметры:
//  ПараметрыОтбора	 - 	 - 
//  ОбновитьСписок	 - 	 - 
//
Процедура ОбновитьМеханизмФильтрацииДанных(ПараметрыОтбора = Неопределено, ОчиститьФильтры = Ложь)
	
	Для Каждого Строка из ТаблицаФильтров Цикл
		Строка.Инициализирован = Ложь;
	КонецЦикла;
	
	МассивИменОчищаемыхФильтров = Новый Массив();
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Статус");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_СтруктурнаяЕдиница");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Этап");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_СотрудникРегистрации");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_РекламныйИсточник");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_КаналПривлечения");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Тег");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПредварительнаяЗапись"); 	
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Задача"); 
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПризнакВыполненияСделки"); 
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_СозданаПериод");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ЗавершенаПериод"); 
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПериодЗапланированнойЗадачи");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПометкаУдаленияСделки");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПричинаОтказа");	
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Менеджер");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Врач");
	
	УправлениеИнтерфейсамиСервер.ДеактивироватьВсеЗначенияФильтрацииДанных(ЭтаФорма, МассивИменОчищаемыхФильтров);

	РезультатПакетногоЗапроса = ПолучитьПакетЗапросаЗначенийДляОтборов(ТекущийПользователь);	
	
	Если ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("ВидСделки") Тогда
		ЭтотОбъект.ОтборВидСделки			 = ПараметрыОтбора.ВидСделки;
		Элементы.ИзменитьВидСделки.Заголовок = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект.ОтборВидСделки, "Наименование");
	КонецЕсли;
	
	Если ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("ОтборСтатусПациента") Тогда
		ЭтотОбъект.ОтборСтатусПациента = ПараметрыОтбора.ОтборСтатусПациента;
		УстановитьОтображениеФильтраСтатусПациента(ЭтотОбъект);
	КонецЕсли;
	
	// Отбор статус.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтатусов");	
	ОбновитьДинамическоеМенюФильтрации_Статус(РезультатПакетногоЗапроса[8].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтатусов_ВариантОтбора"), ПараметрыОтбора.МассивСтатусов_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Статус", ПараметрыОтбора.МассивСтатусов, Истина,,, ВариантОтбора);		
	КонецЕсли;
	
	// Отбор структурная единица.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтруктурныхЕдиниц");	
	ОбновитьДинамическоеМенюФильтрации_СтруктурнаяЕдиница(РезультатПакетногоЗапроса[9].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтруктурныхЕдиниц_ВариантОтбора"), ПараметрыОтбора.МассивСтруктурныхЕдиниц_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтруктурнаяЕдиница", ПараметрыОтбора.МассивСтруктурныхЕдиниц, Истина,,, ВариантОтбора);		
	КонецЕсли;
	
	// Отбор этапы сделки.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивЭтапов");
	ОбновитьДинамическоеМенюФильтрации_Этап(РезультатПакетногоЗапроса[6].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда 
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивЭтапов_ВариантОтбора"), ПараметрыОтбора.МассивЭтапов_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Этап", ПараметрыОтбора.МассивЭтапов, Истина,,, ВариантОтбора);	
	КонецЕсли;	
	
	// Отбор сотрудника регистрации.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСотрудниковРегистрации");
	ОбновитьДинамическоеМенюФильтрации_СотрудникРегистрации(РезультатПакетногоЗапроса[3].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСотрудниковРегистрации_ВариантОтбора"), ПараметрыОтбора.МассивСотрудниковРегистрации_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СотрудникРегистрации", ПараметрыОтбора.МассивСотрудниковРегистрации, Истина,,, ВариантОтбора);	
	КонецЕсли;
	
	// Отбор рекламного источника.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивРекламныхИсточников");
	ОбновитьДинамическоеМенюФильтрации_РекламныйИсточник(РезультатПакетногоЗапроса[4].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивРекламныхИсточников_ВариантОтбора"), ПараметрыОтбора.МассивРекламныхИсточников_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_РекламныйИсточник", ПараметрыОтбора.МассивРекламныхИсточников, Истина,,, ВариантОтбора);	
	КонецЕсли;
	
	// Отбор причины отказа.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивПричинОтказов");
	ОбновитьДинамическоеМенюФильтрации_ПричинаОтказа(РезультатПакетногоЗапроса[11].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивПричинОтказов_ВариантОтбора"), ПараметрыОтбора.МассивПричинОтказов_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПричинаОтказа", ПараметрыОтбора.МассивПричинОтказов, Истина,,, ВариантОтбора);	
	КонецЕсли;

	// Отбор тегов.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивТегов");
	ОбновитьДинамическоеМенюФильтрации_Тег(РезультатПакетногоЗапроса[7].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивТегов_ВариантОтбора"), ПараметрыОтбора.МассивТегов_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Тег", ПараметрыОтбора.МассивТегов, Истина,,, ВариантОтбора);	
	КонецЕсли;

	// Отбор признак наличия назначенного приема.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтатусовНаличияПредварительнойЗаписи");
	ОбновитьДинамическоеМенюФильтрации_ПредварительнаяЗапись(,УстановитьОтбор);
	Если УстановитьОтбор Тогда 
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтатусовНаличияПредварительнойЗаписи_ВариантОтбора"), ПараметрыОтбора.МассивСтатусовНаличияПредварительнойЗаписи_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПредварительнаяЗапись", ПараметрыОтбора.МассивСтатусовНаличияПредварительнойЗаписи, Истина,,, ВариантОтбора);
	КонецЕсли;
	
	// Отбор признак наличия задач.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтатусовНаличияЗадач");
	ОбновитьДинамическоеМенюФильтрации_Задача(,УстановитьОтбор);
	Если УстановитьОтбор Тогда 
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтатусовНаличияЗадач_ВариантОтбора"), ПараметрыОтбора.МассивСтатусовНаличияЗадач_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Задача", ПараметрыОтбора.МассивСтатусовНаличияЗадач, Истина,,, ВариантОтбора);
	КонецЕсли;
	
	// Отбор статусов сделки.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтатусовСделок"); 
	ОбновитьДинамическоеМенюФильтрации_ПризнакВыполненияСделки(, УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтатусовСделок_ВариантОтбора"), ПараметрыОтбора.МассивСтатусовСделок_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПризнакВыполненияСделки", ПараметрыОтбора.МассивСтатусовСделок, Истина,,, ВариантОтбора);
	КонецЕсли;

	// Отбор пометка удаления сделки.         
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("СписокСтатусовПометокУдаления"); 
	ОбновитьДинамическоеМенюФильтрации_ПометкаУдаленияСделки(, УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("СписокСтатусовПометокУдаления_ВариантОтбора"), ПараметрыОтбора.СписокСтатусовПометокУдаления_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПометкаУдаленияСделки", ПараметрыОтбора.СписокСтатусовПометокУдаления, Истина,,, ВариантОтбора);				
	КонецЕсли;
	
	// Отбор менеджеров.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивМенеджеров"); 
	ОбновитьДинамическоеМенюФильтрации_Менеджер(РезультатПакетногоЗапроса[1].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивМенеджеров_ВариантОтбора"), ПараметрыОтбора.МассивМенеджеров_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Менеджер", ПараметрыОтбора.МассивМенеджеров, Истина, НСтр("ru = '<не указан>'; en = '<not specified>'"),, ВариантОтбора);
	КонецЕсли;	
	
	// Отбор врач.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивВрачей"); 
	ОбновитьДинамическоеМенюФильтрации_Врач(РезультатПакетногоЗапроса[2].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивВрачей_ВариантОтбора"), ПараметрыОтбора.МассивВрачей_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Врач", ПараметрыОтбора.МассивВрачей, Истина, НСтр("ru = '<не указан>'; en = '<not specified>'"),, ВариантОтбора);
	КонецЕсли;	
	
	// Отбор периода создания сделки.	
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("ПериодСозданияСделки");
	ОбновитьДинамическоеМенюФильтрации_СозданаПериод(, УстановитьОтбор);
	Если УстановитьОтбор Тогда
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СозданаПериод", ПараметрыОтбора.ПериодСозданияСделки);	
	КонецЕсли;	
	
	// Отбор период запланированной задачи
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("ПериодПланирования");
	ОбновитьДинамическоеМенюФильтрации_ПериодЗапланированнойЗадачи(, УстановитьОтбор);
	Если УстановитьОтбор Тогда    	
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПериодЗапланированнойЗадачи", ПараметрыОтбора.ПериодПланирования);
	КонецЕсли;	
	
	// Отбор периода завершения сделки.	
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("ПериодСделки");
	ОбновитьДинамическоеМенюФильтрации_ЗавершенаПериод(, УстановитьОтбор);
	Если УстановитьОтбор Тогда    
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ЗавершенаПериод", ПараметрыОтбора.ПериодСделки);
	КонецЕсли;
	
	// Отбор канал привлечения.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивКаналовПривлечения"); 
	ОбновитьДинамическоеМенюФильтрации_КаналПривлечения(РезультатПакетногоЗапроса[12].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивКаналовПривлечения_ВариантОтбора"), ПараметрыОтбора.МассивКаналовПривлечения_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_КаналПривлечения", ПараметрыОтбора.МассивКаналовПривлечения, Истина, НСтр("ru = '<не указан>'; en = '<not specified>'"),, ВариантОтбора);
	КонецЕсли;	
	
	ЗначениеОтбораПоЗадачам = СвойствоСтруктуры(ПараметрыОтбора, "ОтборПоЗадачам", 0);
	УстановитьОтображениеФильтровПоЗадачам(ЭтотОбъект, ЗначениеОтбораПоЗадачам = 3, ЗначениеОтбораПоЗадачам = 2, ЗначениеОтбораПоЗадачам = 1);
	
	АктуализироватьДанныеСпискаСогласноОтборов();
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить свойства разделов фильтра.
//
// Параметры:
//  АктуализироватьФлаги - 	 - 
//
Процедура ОбновитьСвойстваРазделовФильтра(АктуализироватьФлаги = Ложь, ИмяСтраницыЗначенийФильтра = Неопределено) Экспорт
	
	Если ИмяСтраницыЗначенийФильтра <> Неопределено Тогда 
		Элементы.СтраницыЗначенийФильтров.ТекущаяСтраница = Элементы[ИмяСтраницыЗначенийФильтра];
	КонецЕсли;		
	УправлениеИнтерфейсамиСервер.ОбновитьСвойстваРазделовФильтра(ЭтаФорма, АктуализироватьФлаги);
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить группу значений фильтра.
//
// Параметры:
//  ИдентификаторСтрокиФильтра	 - 	 - 
//
Процедура ОбновитьГруппуЗначенийФильтра(ИдентификаторСтрокиФильтра, ИнициализироватьВыбранноеЗначение = Ложь, ВыбранноеЗначение = Неопределено) Экспорт
	
	СтрокаФильтра = ТаблицаФильтров.НайтиПоИдентификатору(ИдентификаторСтрокиФильтра);
	УправлениеИнтерфейсамиСервер.ОбновитьГруппуЗначенийФильтра(ЭтаФорма, СтрокаФильтра, ИнициализироватьВыбранноеЗначение, ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить свойства элемента значения.
//
// Параметры:
//  ДанныеЭлементаФильтрации - 	 - 
//
Процедура ОбновитьСвойстваЭлементаЗначения(ДанныеЭлементаФильтрации) Экспорт
	
	УправлениеИнтерфейсамиСервер.ОбновитьСвойстваЭлементаЗначения(ЭтаФорма, , , ДанныеЭлементаФильтрации);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор стандартного периода.
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВыборСтандартногоПериода(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ РезультатВыбора = Неопределено И НЕ ДополнительныеПараметры = Неопределено Тогда
		ЭлементВариантСтандартногоПериода = ЭтаФорма[ДополнительныеПараметры.ИмяТаблицы].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторФильтра).СписокЗначений[0].Значение.СписокСтандартныхПериодов.НайтиПоЗначению(РезультатВыбора.Значение);
		Если НЕ ЭлементВариантСтандартногоПериода = Неопределено Тогда
			ДополнительныеПараметры.Вставить("ИдентификаторЗначения", ЭлементВариантСтандартногоПериода.ПолучитьИдентификатор());
			ЭтаФорма[ДополнительныеПараметры.ИмяТаблицы].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторФильтра).СписокЗначений[0].Значение.СписокСтандартныхПериодов.ЗаполнитьПометки(Ложь);
			ЭлементВариантСтандартногоПериода.Пометка = Истина;
			РезультатОбновления = УправлениеИнтерфейсамиКлиент.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, "УстановитьСтандартныйПериод_ЗначениеФильтра_Идентификатор_" + ДополнительныеПараметры.ИдентификаторФильтра, ДополнительныеПараметры);
		КонецЕсли;	
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ВсплывающаяГруппаИзменить

&НаКлиенте
// Процедура, заполняет процентом строки табличной части.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Процедура ЗаполнитьПроцентомСтрокиТЗ()
	
	Элементы.ОстаточныйПроцент.Видимость = Ложь;
	
	КолвоЭлементов = ЭтотОбъект.ТаблицаДействия.Количество();
	ЭтотОбъект.ОстаточныйПроцентОтДеления = 0;
	Если КолвоЭлементов > 0 Тогда
		
		Процентов  		   = Цел(100/КолвоЭлементов);
		НедостающийПроцент = 100 - (Процентов*КолвоЭлементов);
		
		Для Каждого СтрокаТЗ Из ЭтотОбъект.ТаблицаДействия Цикл
			СтрокаТЗ.Пропорция = Процентов;
		КонецЦикла;
		
		ЭтотОбъект.ОстаточныйПроцентОтДеления = НедостающийПроцент;
		Элементы.ОстаточныйПроцент.Видимость  = НедостающийПроцент > 0;
		Элементы.ГруппаПрименитьОбщая.Доступность = НедостающийПроцент = 0;
		
	Иначе
		Элементы.ГруппаПрименитьОбщая.Доступность = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик команды на сервере "Применить".
//
Процедура ПрименитьНаСервере(ДопПараметры)
	
	Если ЗначениеЗаполнено(ДопПараметры) Тогда
		
		ТЗДинамическогоСписка = Новый ТаблицаЗначений();
		ТЗДинамическогоСписка.Колонки.Добавить("Сделка");
		ТЗДинамическогоСписка.Колонки.Добавить("Контрагент");
		ТЗДинамическогоСписка.Колонки.Добавить("ДатаСделки");
		ТЗДинамическогоСписка.Колонки.Добавить("Менеджер");
		ТЗДинамическогоСписка.Колонки.Добавить("ЗапланированнаяЗадача");
		
		ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкиСведенияДляСписка.Сделка КАК Сделка,
		|	СделкиСведенияДляСписка.ЗапланированнаяЗадача КАК ЗапланированнаяЗадача
		|ИЗ
		|	РегистрСведений.СделкиСведенияДляСписка КАК СделкиСведенияДляСписка
		|ГДЕ
		|	СделкиСведенияДляСписка.Сделка В(&МассивСделок)";
		Запрос.УстановитьПараметр("МассивСделок", ВыделенныеСтроки);
		ТЗЗадачСделок = Запрос.Выполнить().Выгрузить();
			
		Для Каждого ЭлементМассива Из ВыделенныеСтроки Цикл
						
			НоваяСтрока = ТЗДинамическогоСписка.Добавить();
			НоваяСтрока.Сделка		 = ЭлементМассива;
			НоваяСтрока.Контрагент	 = ЭлементМассива.Контрагент;
			НоваяСтрока.ДатаСделки	 = ЭлементМассива.ДатаСделки;
			НоваяСтрока.Менеджер	 = ЭлементМассива.Менеджер;
			
			СтрокаТЗ = ТЗЗадачСделок.Найти(ЭлементМассива, "Сделка");
			Если СтрокаТЗ <> Неопределено
				И ЗначениеЗаполнено(СтрокаТЗ.ЗапланированнаяЗадача) Тогда
				
				НоваяСтрока.ЗапланированнаяЗадача = СтрокаТЗ.ЗапланированнаяЗадача;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		ТЗДинамическогоСписка = ПолучитьТаблицуЗначенийДинамическогоСписка();
	КонецЕсли;

	УстановитьФокусЭлементаСервер();
	
	Если ЭтотОбъект.Действие = "Менеджера" Тогда
		
		МенеджерыРаспределитьВПропорции(ТЗДинамическогоСписка);
		
	ИначеЕсли ЭтотОбъект.Действие = "КаналПривлечения" Тогда
		
		Для Каждого СтрокаТЗ Из ТЗДинамическогоСписка Цикл
			
			ОбъектСделка 				  = СтрокаТЗ.Сделка.ПолучитьОбъект();
			ОбъектСделка.КаналПривлечения = ЭтотОбъект.ЗначениеДействия;
			ОбъектСделка.Записать();
			
		КонецЦикла;
		
	ИначеЕсли ЭтотОбъект.Действие = "РекламныйИсточник" Тогда
		
		Для Каждого СтрокаТЗ Из ТЗДинамическогоСписка Цикл
			
			ОбъектСделка 					= СтрокаТЗ.Сделка.ПолучитьОбъект();
			ОбъектСделка.ИсточникИнформации = ЭтотОбъект.ЗначениеДействия;
			ОбъектСделка.Записать();
			
		КонецЦикла;
		
	ИначеЕсли ЭтотОбъект.Действие = "ВидСделки" Тогда
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ВидСделки)
			И ЗначениеЗаполнено(ЭтотОбъект.ЗначениеДействия) Тогда
			
			Для Каждого СтрокаТЗ Из ТЗДинамическогоСписка Цикл
				
				ОбъектСделка = СтрокаТЗ.Сделка.ПолучитьОбъект();
				ОбъектСделка.ВидСделки 		 = ЭтотОбъект.ВидСделки;
				ОбъектСделка.ЭтапСделки 	 = ЭтотОбъект.ЗначениеДействия;
				ОбъектСделка.РезультатСделки = Неопределено;
				ОбъектСделка.ПричинаОтказа   = Неопределено;
				ОбъектСделка.ЭтапОтказа		 = Неопределено;
				ОбъектСделка.Записать();
				
			КонецЦикла;
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Заполните все поля!'; en = 'Fill in all the fields!'"));
			Возврат;
			
		КонецЕсли;

	КонецЕсли;
	
	Для каждого Строка из ТаблицаФильтров Цикл
		Строка.Инициализирован = Ложь;
	КонецЦикла;

	ОбновитьЗначенияФильтрацииДанных(Новый Структура);
				
КонецПроцедуры

&НаСервере
// Процедура, Распределяет мененеджеров в пропорции.
//
Процедура МенеджерыРаспределитьВПропорции(Знач ТЗДинамическогоСписка)
	
	КоличествоСотрудников = ЭтотОбъект.ТаблицаДействия.Количество();
	
	Если КоличествоСотрудников <= 0 Тогда		
		Возврат;
	КонецЕсли;
	
	ТипЧисло = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(3));
	
	ТЗСотрудников = ЭтотОбъект.ТаблицаДействия.Выгрузить();
	ТЗСотрудников.Колонки.Добавить("КоличествоСделок", ТипЧисло);
	ТЗСотрудников.Колонки.Добавить("ПроцентТекущий"	 , ТипЧисло);
	ТЗСотрудников.Колонки.Добавить("Дельта"			 , ТипЧисло);
	
	ТЗСделок = ТЗДинамическогоСписка.Скопировать(,"Сделка, ЗапланированнаяЗадача");
	
	Для Каждого СтрокаТЗ Из ТЗСделок Цикл
		
		ПриоритетныйСотрудник = Неопределено;
		ПриоритетныйПроцент   = 0;
		
		Для Каждого СтрокаСотрудников Из ТЗСотрудников Цикл
			
			Если СтрокаСотрудников.Дельта >= ПриоритетныйПроцент Тогда
				
				ПриоритетныйСотрудник = СтрокаСотрудников.Сотрудник;
				ПриоритетныйПроцент   = СтрокаСотрудников.Дельта;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ПриоритетныйСотрудник) Тогда
			
			ОбъектСделка = СтрокаТЗ.Сделка.ПолучитьОбъект();
			ОбъектСделка.Менеджер = ПриоритетныйСотрудник;
			ОбъектСделка.Записать();
			
			// Обновить исполнителя в не завершенных задачах.
			Если ЭтотОбъект.ЗаменитьИсполнителяВНеЗавершенныхЗадачах
				И ЗначениеЗаполнено(СтрокаТЗ.ЗапланированнаяЗадача) Тогда
				
				ОбъектЗадача = СтрокаТЗ.ЗапланированнаяЗадача.ПолучитьОбъект();
				ОбъектЗадача.Исполнитель = ПриоритетныйСотрудник;
				ОбъектЗадача.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаТЗСотрудников = ТЗСотрудников.Найти(ПриоритетныйСотрудник);
		СтрокаТЗСотрудников.КоличествоСделок = СтрокаТЗСотрудников.КоличествоСделок + 1;
		
		// Обновляем данные в таблице значений.
		Для Каждого СтрокаСотрудников Из ТЗСотрудников Цикл
			
			СтрокаСотрудников.ПроцентТекущий = СтрокаСотрудников.КоличествоСделок/ТЗСотрудников.Итог("КоличествоСделок")*100; 
			СтрокаСотрудников.Дельта 		 = СтрокаСотрудников.Пропорция - СтрокаСотрудников.ПроцентТекущий;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Обновить менеджера в клиенте.
	Если ЭтотОбъект.ЗаменитьМенеджераПоПродажамВКлиенте Тогда
		
		ТЗКонтрагентов = ТЗДинамическогоСписка.Скопировать(,"Контрагент");
		ТЗКонтрагентов.Свернуть("Контрагент");
		
		Для Каждого СтрокаТЗ Из ТЗКонтрагентов Цикл
			Если ЗначениеЗаполнено(СтрокаТЗ.Контрагент) Тогда
				
				ТЗСделок = ТЗДинамическогоСписка.Скопировать(Новый Структура("Контрагент", СтрокаТЗ.Контрагент), "Сделка, ДатаСделки");
				ТЗСделок.Сортировать("ДатаСделки");
				КоличествоСстрокТЗ = ТЗСделок.Количество();
				
				Если КоличествоСстрокТЗ > 0 Тогда
					МенеджерПоследнейСделки = ТЗСделок[КоличествоСстрокТЗ-1].Сделка.Менеджер;
					Если ЗначениеЗаполнено(МенеджерПоследнейСделки) Тогда
						
						КонтрагентОбъект = СтрокаТЗ.Контрагент.ПолучитьОбъект();
						КонтрагентОбъект.Менеджер = МенеджерПоследнейСделки;
						КонтрагентОбъект.Записать();
						
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора".
//
Процедура ВидСделкиВыборОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		Элементы.ЭтапСделки.Доступность = Истина;
		
		ЭтотОбъект.ЗначениеДействия = ПредопределенноеЗначение("Справочник.ЭтапыСделок.ПустаяСсылка");
		ЭтапыСделок = ПолучтьЭтапыПоВидуСделкиСервер(ВыбранноеЗначение);
		Элементы.ЭтапСделки.СписокВыбора.ЗагрузитьЗначения(ЭтапыСделок);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ВидСделкиВыборПриИзменении(Элемент)
	
	Элементы.ЭтапСделки.Доступность = ЗначениеЗаполнено(ВидСделки);
	
КонецПроцедуры

#КонецОбласти

#Область КонекстноеМеню_ВидСделки

&НаКлиенте
// Процедура, обработчик события "ПриАктивизацииСтроки".
//
Процедура СписокПриАктивизацииСтроки(Элемент)

	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда 
		Если Элемент.ТекущиеДанные.Свойство("Сделка") Тогда 
			Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Сделка) Тогда 
				ОбновитьКонтекстноеМенюСделок(Элемент.ТекущиеДанные.Сделка);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ИзменитьВидСделки".
//
Процедура ИзменитьВидСделки(Команда)
	
	ИндексТЗ = ПолучитьИндексСтроки(Команда.Имя);
	ВыбранныйВидСделки = ЭтотОбъект.ТаблицаВидовСделок[ИндексТЗ].ВидСделки;
	Сделка = ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока;

	ТекстОшибки = "";
	ОбновитьВидСделки(Сделка, ВыбранныйВидСделки, ТекстОшибки);
	
	Если ТекстОшибки <> "" Тогда		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	Иначе
		// Если прошло все гладко, обновляем список.
		АктуализироватьДанныеСпискаСогласноОтборов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, инициализирует данные контекстного меню для смены вида сделки.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Процедура ИнициализироватьКонтекстноеМенюСменыВидаСделки()
	
	ИнициализироватьТаблицуВидовСделок();
	СоздатьЭлементыСменыВидаСделки();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обновляет котекстное меню списка сделок.
//
Процедура ОбновитьКонтекстноеМенюСделок(Сделка)
	
	ТекущийЭлементФормы = ЭтаФорма.ТекущийЭлемент;
	Если ТипЗнч(ТекущийЭлементФормы) <> Тип("ТаблицаФормы") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрокаСписка = ТекущийЭлементФормы.ТекущиеДанные;
	Если ТекущаяСтрокаСписка <> Неопределено И ТекущаяСтрокаСписка.Свойство("ВидСделки") Тогда
		ВидТекущейСделки = ТекущаяСтрокаСписка.ВидСделки;
	Иначе
		Возврат;
	КонецЕсли;
	
	ПодчиненныеЭелеменыКонтекстногоМеню = Элементы.СписокСменитьСделку.ПодчиненныеЭлементы;
	
	Для Каждого ПодчиненныйЭлемент Из ПодчиненныеЭелеменыКонтекстногоМеню Цикл
		
		ИндексТЗ      = ПолучитьИндексСтроки(ПодчиненныйЭлемент.Имя);
		ВидСделки     = ЭтотОбъект.ТаблицаВидовСделок[ИндексТЗ].ВидСделки;
		
		ПодчиненныйЭлемент.Видимость = Не (ВидТекущейСделки = ВидСделки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура, создает либо находит существующую таблицу и отчищает ее.
//
Процедура ИнициализироватьТаблицуВидовСделок()
	
	МассивРеквизитов = Новый Массив();
	ИмяТаблицы = "ТаблицаВидовСделок";
	
	Если НЕ ОбщегоНазначенияСтоматология.ЕстьРеквизитФормы(ЭтаФорма, ИмяТаблицы) Тогда
		МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы , Новый ОписаниеТипов("ТаблицаЗначений")));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("ВидСделки", Новый ОписаниеТипов("СправочникСсылка.ВидыСделок")  , ИмяТаблицы));
	Иначе
		ЭтаФорма[ИмяТаблицы].Очистить();
	КонецЕсли;
	
	Если МассивРеквизитов.Количество() <> 0 Тогда 
		// Добавляем реквизит.
		ЭтаФорма.ИзменитьРеквизиты(МассивРеквизитов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, создает дианмические эелементы формы смены вида сделки.
//
Процедура СоздатьЭлементыСменыВидаСделки()
	
	КомандаСменыВидаСделки = ЭтаФорма.Команды.Найти("ИзменитьВидСделки");
	
	// Добавляем новые данные в таблицу значений.
	ВидыСделок = ПолучитьДанныеВидовСделок();
	Индекс = 0;
	Для Каждого ДанныеВидаСделки Из ВидыСделок Цикл
		
		// Заполнение списка выбора видов сделок.
		ЭтотОбъект.ДоступныеВидыСделок.Добавить(ДанныеВидаСделки.Ссылка, ДанныеВидаСделки.Наименование);
		
		НоваяСтрокаТЗ = ЭтотОбъект.ТаблицаВидовСделок.Добавить();
		НоваяСтрокаТЗ.ВидСделки = ДанныеВидаСделки.Ссылка;
		
		ИмяЭлемента = "ВидСделки_" + Индекс;
		
		// Создаем команду.
		КомандаКнопки = ЭтаФорма.Команды.Найти("Команда" + ИмяЭлемента);	
		Если КомандаКнопки = Неопределено Тогда
			
			КомандаКнопки = ЭтаФорма.Команды.Добавить("Команда" + ИмяЭлемента);
			КомандаКнопки.Действие  = "ИзменитьВидСделки";
			
		КонецЕсли;
		
		// Создаем кнопку.
		НайденнаяКнопка = ЭтаФорма.Элементы.Найти(ИмяЭлемента);
		Если НайденнаяКнопка = Неопределено Тогда			
			
			ЭлементКнопка = ЭтаФорма.Элементы.Вставить(ИмяЭлемента, Тип("КнопкаФормы"), Элементы.СписокСменитьСделку);
			ЭлементКнопка.ИмяКоманды = КомандаКнопки.Имя;
			ЭлементКнопка.Заголовок = ДанныеВидаСделки.Наименование;
			ЭлементКнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Функция, возвращает данные видов сделок.
//
Функция ПолучитьДанныеВидовСделок()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВидыСделокСтруктурныеЕдиницыПрименения.Ссылка КАК Ссылка,
	|	ВидыСделокСтруктурныеЕдиницыПрименения.Ссылка.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВидыСделок.СтруктурныеЕдиницыПрименения КАК ВидыСделокСтруктурныеЕдиницыПрименения
	|ГДЕ
	|	НЕ ВидыСделокСтруктурныеЕдиницыПрименения.Ссылка.ПометкаУдаления
	|	И ВидыСделокСтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница В (&СтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает идентификатор строки данных по имени элемента.
//
// Параметры:
//	 ИмяЭлемента 	- Строка - имя элемента.
//   ИндексЭлемента - Булево - признак чего получаем индекс (Элемента или Виджета).
//
Функция ПолучитьИндексСтроки(ИмяЭлемента, ИндексЭлемента = Истина)
	
	Если ИндексЭлемента Тогда
		НомерСимвола = СтрНайти(ИмяЭлемента,"_");
		Возврат Число(Сред(ИмяЭлемента, НомерСимвола + 1, 1));
	Иначе
		НомерСимвола = СтрНайти(ИмяЭлемента,"_", НаправлениеПоиска.СКонца);
		Возврат Число(Сред(ИмяЭлемента, НомерСимвола + 1, 1));
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает тип вида сделки по сделке.
//
Функция ПолучитьТипВидаСделки(Сделка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Сделки.ВидСделки.ТипСделки КАК ТипСделки
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.Ссылка = &Сделка";
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.ТипСделки, Неопределено);
	
	// PS. модуль занят, потом перенести в модуль менеджера 31.07.19
	
КонецФункции

&НаСервереБезКонтекста
// Процедура, обновляет вид сделки.
//
Процедура ОбновитьВидСделки(Сделка, ВыбранныйВидСделки, ТекстОшибки)
	
	ВсеВидыСделок = Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(Сделка.ВидСделки.ТипСделки); 
	ИндексВыбранногоВидаСделки = ВсеВидыСделок.Найти(ВыбранныйВидСделки);
	
	Если ИндексВыбранногоВидаСделки <> Неопределено Тогда
		УправлениеИнтерфейсамиСервер.ИзменитьВидСделки(Сделка, ИндексВыбранногоВидаСделки, ТекстОшибки);	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
// Процедура, устанавливает отбор при переходе из канбана.
//
Процедура УстановитьОтбор(ПараметрыОтбора) Экспорт
	
	// Используется для установки фильтра из формы канбана.
	// См. ФормаСпискаКанбан.ПерейтиВСписок.
	ОбновитьМеханизмФильтрацииДанных(ПараметрыОтбора, Истина);
	
КонецПроцедуры

&НаСервере
// Процедура - Установить фокус элемента на сервере.
//
Процедура УстановитьФокусЭлементаСервер()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.Список;
	
КонецПроцедуры

&НаСервере
// Процедура получает количество строк в динамическом списке .
//
Процедура УстановитьЗаголовокКоличествоЭлементовВСписке(КоличествоКлиентов)
	
	УстановитьЗаголовкиДополнительныхОтборов();
		
	Строка = СтрокаСЧислом(Нстр("ru = '; сделка;;  сделки;  сделок;  сделки'; en = '; deal;;;; deals'"),
	КоличествоКлиентов,
	ВидЧисловогоЗначения.Количественное,
	НСтр("ru='L=ru'; en='L=en'")); 
	
	Элементы.КоличествоЭлементовВСписке.Заголовок = "(" + Формат(КоличествоКлиентов, НСтр("ru = 'ЧН=Нет';en = 'ЧН=No'")) + " " + Строка + ")";	
	
КонецПроцедуры

&НаСервере
// Функция получает таблицу значений из динамического списка.
//
Функция ПолучитьТаблицуЗначенийДинамическогоСписка()
	
	// Получаем схему компановки данных (здесь хранится текст запроса)
	Схема 	  = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();	
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();

	// Выводим динамический список в таблицу значений
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(Схема, Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Возврат ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
КонецФункции

&НаСервере
// Процедура, СоздатьУсловноеОформление.
//
Процедура СоздатьУсловноеОформление()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ЭтапыСделок.ЦветЭтапа КАК СТРОКА(100)) КАК ЦветЭтапа
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	НЕ (ВЫРАЗИТЬ(ЭтапыСделок.ЦветЭтапа КАК СТРОКА(100))) = """"";
	
	ТаблицаЦветов = Запрос.Выполнить().Выгрузить();
		
	Для Каждого СтрокаТЧ Из ТаблицаЦветов Цикл
		
		ЭлементУФ = Список.УсловноеОформление.Элементы.Добавить();
		ЭлементОтбора = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЦветЭтапа");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = СтрокаТЧ.ЦветЭтапа;
		ЭлементОтбора.Использование  = Истина;
		
		ЦветЭтапа = ЗначениеИзСтрокиВнутр(СтрокаТЧ.ЦветЭтапа);
		ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветЭтапа);
		ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ПолучитьЦветТекстаПоФону(ЦветЭтапа));
		
		ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();
		ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("ЭтапСделки");
		ПолеОформления.Использование = Истина;
		
		// Условное оформление для успеха.
		ЭлементУФ = Список.УсловноеОформление.Элементы.Добавить();
		ЭлементОтбора = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЭтапСделки");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.ПравоеЗначение = Справочники.ЭтапыСделок.Успех;
		ЭлементОтбора.Использование  = Истина;
		
		ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ЦветФона"  , Новый Цвет(72, 193, 123));
		ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 255, 255));
		
		ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();
		ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("ЭтапСделки");
		ПолеОформления.Использование = Истина;
		
		// Условное оформление для отказа.
		ЭлементУФ = Список.УсловноеОформление.Элементы.Добавить();
		ЭлементОтбора = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЭтапСделки");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Справочники.ЭтапыСделок.Отказ;
		ЭлементОтбора.Использование  = Истина;
		
		ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ЦветФона"  , Новый Цвет(246, 110, 110));
		ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ЦветТекста",(Новый Цвет(255, 255, 255)));
		
		ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();
		ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("ЭтапСделки");
		ПолеОформления.Использование = Истина;
		
	КонецЦикла;
				
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает цвет текста от передаваемого цвета фона.
//
Функция ПолучитьЦветТекстаПоФону(ЦветФона)
	
	Если (ЦветФона.Зеленый + ЦветФона.Красный + ЦветФона.Синий) > 383 Тогда
		Возврат Новый Цвет(60,60,60);		
	Иначе
		Возврат Новый Цвет(255,255,255);
	КонецЕсли;
	
КонецФункции

&НаСервере
// Процедура, устанавливает заголовки дополнительных отборов "кол-во без сделок" и "кол-во с просроченными задачами".
//
Процедура УстановитьЗаголовкиДополнительныхОтборов()
	
	СтруктураОтборов = Новый Структура;
	СтруктураОтборов.Вставить("ОтборМенеджер"				, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Менеджер"));
	СтруктураОтборов.Вставить("ОтборСтруктурнаяЕдиница"		, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СтруктурнаяЕдиница"));
	//СтруктураОтборов.Вставить("ОтборЭтап"					, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Этап"));

	СписокМенеджеров = СтруктураОтборов.ОтборМенеджер.ВыгрузитьЗначения();
	Если НЕ ЗначениеЗаполнено(СписокМенеджеров) Тогда
		 СписокМенеджеров = СтруктураОтборов.ОтборМенеджер.ДоступныеЗначения.ВыгрузитьЗначения();
	КонецЕсли;
	
	СписокКлиник = СтруктураОтборов.ОтборСтруктурнаяЕдиница.ВыгрузитьЗначения();
	Если НЕ ЗначениеЗаполнено(СписокКлиник) Тогда
		СписокКлиник = СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения.ВыгрузитьЗначения();
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сделки.Ссылка КАК Сделка
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтрагентыСведенияДляСписка КАК КонтрагентыСведенияДляСписка
	|		ПО Сделки.Контрагент = КонтрагентыСведенияДляСписка.Контрагент
	|ГДЕ
	|	Сделки.ВидСделки = &ВидСделки
	|	И ВЫБОР
	|			КОГДА &ОтборСтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КонтрагентыСведенияДляСписка.Статус = &ОтборСтатусПациента
	|		КОНЕЦ
	|	И Сделки.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
	|	И Сделки.СтруктурнаяЕдиница В(&СписокКлиник)
	|	И Сделки.Менеджер В(&СписокМенеджеров)
	|	И Сделки.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(СделкиСведенияДляСписка.Сделка) КАК КоличествоБезАктивности
	|ИЗ
	|	РегистрСведений.СделкиСведенияДляСписка КАК СделкиСведенияДляСписка
	|ГДЕ
	|	СделкиСведенияДляСписка.Сделка В
	|			(ВЫБРАТЬ
	|				ТаблицаСделок.Сделка
	|			ИЗ
	|				ТаблицаСделок)
	|	И СделкиСведенияДляСписка.ЗапланированнаяЗадача = ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)
	|	И СделкиСведенияДляСписка.ЗапланированнаяПредварительнаяЗапись = ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сделки.Сделка КАК Сделка,
	|	СделкиСведенияДляСписка.ЗапланированнаяЗадача КАК ЗапланированнаяЗадача
	|ПОМЕСТИТЬ СделкиЗапланированнаяЗадача
	|ИЗ
	|	ТаблицаСделок КАК Сделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СделкиСведенияДляСписка КАК СделкиСведенияДляСписка
	|		ПО Сделки.Сделка = СделкиСведенияДляСписка.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СделкиЗапланированнаяЗадача.Сделка КАК Ссылка,
	|	СделкиЗапланированнаяЗадача.ЗапланированнаяЗадача.ЗадачаНазначеннаяДата КАК ЗадачаНазначеннаяДата
	|ПОМЕСТИТЬ СделкиЗадачаНазначеннаяДата
	|ИЗ
	|	СделкиЗапланированнаяЗадача КАК СделкиЗапланированнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(СделкиЗадачаНазначеннаяДата.Ссылка) КАК КоличествоПросроченныхЗадач
	|ИЗ
	|	СделкиЗадачаНазначеннаяДата КАК СделкиЗадачаНазначеннаяДата
	|ГДЕ
	|	СделкиЗадачаНазначеннаяДата.ЗадачаНазначеннаяДата МЕЖДУ &ДатаНачалаЗапланированнойЗадачи И &ДатаОкончанияЗапланированнойЗадачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(СделкиЗадачаНазначеннаяДата.Ссылка) КАК КоличествоЗадач
	|ИЗ
	|	СделкиЗадачаНазначеннаяДата КАК СделкиЗадачаНазначеннаяДата
	|ГДЕ
	|	СделкиЗадачаНазначеннаяДата.ЗадачаНазначеннаяДата МЕЖДУ &НачалоДня И &КонецДня";
	
	Запрос.УстановитьПараметр("СписокМенеджеров"					, СписокМенеджеров);
	Запрос.УстановитьПараметр("ДатаНачалаЗапланированнойЗадачи"     , Дата(1,1,1));
	Запрос.УстановитьПараметр("ДатаОкончанияЗапланированнойЗадачи"  , КонецДня(ТекущаяДатаСеанса() - 86400));
	Запрос.УстановитьПараметр("НачалоДня"							, НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("КонецДня"							, КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("СписокКлиник"						, СписокКлиник);
	Запрос.УстановитьПараметр("ВидСделки"							, ЭтотОбъект.ОтборВидСделки);
	Запрос.УстановитьПараметр("ОтборСтатусПациента"					, ЭтотОбъект.ОтборСтатусПациента);
	
	// Для единообразия списка и канбана подсчет ведется без разреза по этапу.
	//
	//// Отбор этап сделки.
	//Если ЗначениеЗаполнено(СтруктураОтборов.ОтборЭтап) Тогда	
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЭтап", СтруктураОтборов.ОтборЭтап.ДоступныеЗначения[0].Представление + "Сделки.ЭтапСделки В (&ОтборЭтап)");		
	//	Запрос.УстановитьПараметр("ОтборЭтап", СтруктураОтборов.ОтборЭтап.ВыгрузитьЗначения());
	//Иначе
	//	Если СтруктураОтборов.ОтборЭтап.ДоступныеЗначения.Количество() <> 0 Тогда 
	//		ВариантОтбора = СтруктураОтборов.ОтборЭтап.ДоступныеЗначения[0].Представление;
	//	Иначе 
	//		ВариантОтбора = "";
	//	КонецЕсли;	
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЭтап", ВариантОтбора + "Сделки.ЭтапСделки В (&ОтборЭтап)");			
	//	Запрос.УстановитьПараметр("ОтборЭтап", СтруктураОтборов.ОтборЭтап.ДоступныеЗначения.ВыгрузитьЗначения());		
	//	// Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЭтап", "ИСТИНА");		
	//КонецЕсли;
	
	РезультатЗапроса 				   	= Запрос.ВыполнитьПакет();
	ВыборкаКоличестваБезАктивности 		= РезультатЗапроса[1].Выбрать();	
	ВыборкаКоличествоПросроченныхЗадач 	= РезультатЗапроса[4].Выбрать();
	ВыборкаКоличествоЗадачиНаСегодня 	= РезультатЗапроса[5].Выбрать();
	
	ЦветРамкиНаличиеЗадач	 = Новый Цвет(208, 53, 86);
	ЦветРамкиОтсутствиеЗадач = Новый Цвет(160, 160, 160);
	
	ЦветТекстаНаличиеЗадач		 = Новый Цвет(208, 53, 86);
	ЦветТекстаОтсутствиеЗадач	 = Новый Цвет(77, 77, 77);
	
	КоличествоБезАктивности = ?(ВыборкаКоличестваБезАктивности.Следующий(), ВыборкаКоличестваБезАктивности.КоличествоБезАктивности, 0);
	
	ЭтотОбъект.БезЗадачКоличество	 		 = КоличествоБезАктивности;
	Элементы.БезЗадачКоличество.Ширина	 	 = СтрДлина(КоличествоБезАктивности) / 2 + 1;
	Элементы.БезЗадачКоличество.ЦветРамки	 = ?(КоличествоБезАктивности = 0, ЦветРамкиОтсутствиеЗадач, ЦветРамкиНаличиеЗадач);
	Элементы.БезЗадачКоличество.ЦветТекста	 = ?(КоличествоБезАктивности = 0, ЦветТекстаОтсутствиеЗадач, ЦветТекстаНаличиеЗадач);
	
	КоличествоПросроченныхЗадач = ?(ВыборкаКоличествоПросроченныхЗадач.Следующий(), ВыборкаКоличествоПросроченныхЗадач.КоличествоПросроченныхЗадач, 0);
	
	ЭтотОбъект.ПросроченныеЗадачиКоличество			 = КоличествоПросроченныхЗадач;
	Элементы.ПросроченныеЗадачиКоличество.Ширина	 = СтрДлина(КоличествоПросроченныхЗадач) / 2 + 1;
	Элементы.ПросроченныеЗадачиКоличество.ЦветРамки	 = ?(КоличествоПросроченныхЗадач = 0, ЦветРамкиОтсутствиеЗадач, ЦветРамкиНаличиеЗадач);
	Элементы.ПросроченныеЗадачиКоличество.ЦветТекста = ?(КоличествоПросроченныхЗадач = 0, ЦветТекстаОтсутствиеЗадач, ЦветТекстаНаличиеЗадач);
	
	КоличествоСЗадачамиНаСегодня = ?(ВыборкаКоличествоЗадачиНаСегодня.Следующий(), ВыборкаКоличествоЗадачиНаСегодня.КоличествоЗадач, 0);
	
	ЭтотОбъект.ЗадачиНаСегодняКоличество			 = КоличествоСЗадачамиНаСегодня;
	Элементы.ЗадачиНаСегодняКоличество.Ширина		 = СтрДлина(КоличествоСЗадачамиНаСегодня) / 2 + 1;
	Элементы.ЗадачиНаСегодняКоличество.ЦветРамки	 = ?(КоличествоСЗадачамиНаСегодня = 0, ЦветРамкиОтсутствиеЗадач, ЦветРамкиНаличиеЗадач);
	Элементы.ЗадачиНаСегодняКоличество.ЦветТекста	 = ?(КоличествоСЗадачамиНаСегодня = 0, ЦветТекстаОтсутствиеЗадач, ЦветТекстаНаличиеЗадач);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СоздатьСделку".
//
Процедура СоздатьСделку(Команда)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ОтборВидСделки) Тогда
		СоздатьСделкуИзСпискаЗавершение(Новый Структура("Значение", ЭтотОбъект.ОтборВидСделки));
		Возврат;
	КонецЕсли;
	
	МассивВидовСделок = ПолучитьВидыСделок();
	
	Если МассивВидовСделок.Количество() > 1 Тогда 
		СписокВыбора = Новый СписокЗначений();
		СписокВыбора.ЗагрузитьЗначения(МассивВидовСделок);
		
		Оповещение = Новый ОписаниеОповещения("СоздатьСделкуИзСпискаЗавершение", ЭтотОбъект);
		ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Элементы.СоздатьСделку);
	ИначеЕсли МассивВидовСделок.Количество() <> 0 Тогда 
		СоздатьСделкуИзСпискаЗавершение(Новый Структура("Значение", МассивВидовСделок[0]));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, открывает форму сделки.
//
Процедура СоздатьСделкуИзСпискаЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт 
		
	Если Результат = Неопределено Тогда
		Возврат;
	Иначе
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("ВидСделки", Результат.Значение);
		
		ОткрытьФорму("Справочник.Сделки.Форма.ФормаЭлемента", Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения),, Истина);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает виды сделок.
//
Функция ПолучитьВидыСделок()
	
	Возврат Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(Перечисления.ТипыСделок.Продажа); 
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает этапы по виду сделки.
//
Функция ПолучтьЭтапыПоВидуСделкиСервер(ВидСделки)
	
	Возврат Справочники.ВидыСделок.ПолучитьЭтапыПоВидуСделки(ВидСделки).ВыгрузитьКолонку("ЭтапСделки");
	
КонецФункции

&НаКлиенте
// Процедура, УдалитьПустыеСтрокиСотрудников.
//
Процедура УдалитьПустыеСтрокиСотрудников()
	
	МассивПустыхСтрок = ЭтотОбъект.ТаблицаДействия.НайтиСтроки(Новый Структура("Сотрудник", ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка")));
	Для Каждого СтрокаМассива Из МассивПустыхСтрок Цикл		
		ЭтотОбъект.ТаблицаДействия.Удалить(ЭтотОбъект.ТаблицаДействия.Индекс(СтрокаМассива));	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
// Функция - Данные выбранных фильтров.
//
Функция ПараметрыВыбранныхФильтровКлиент()
	
	ПараметрыОтбора = Новый Структура;
	
	Для Каждого Строка из ТаблицаФильтров Цикл
		Если Строка.КоличествоАктивированныхЗначений > 0 Тогда
			
			МассивДанных = ПолучениеЭлементовОтбораКлиент(Новый Массив, Строка.СписокЗначений, Строка.Наименование);
			
			Если Строка.Наименование = "Фильтр_Статус" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусов"			   				, МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусов_ВариантОтбора"				, Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_СтруктурнаяЕдиница" Тогда
				ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц"					, МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц_ВариантОтбора"	, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Менеджер" Тогда
				ПараметрыОтбора.Вставить("МассивМенеджеров"				 			, МассивДанных);
				ПараметрыОтбора.Вставить("МассивМенеджеров_ВариантОтбора"			, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Врач" Тогда
				ПараметрыОтбора.Вставить("МассивВрачей"				 				, МассивДанных);
				ПараметрыОтбора.Вставить("МассивВрачей_ВариантОтбора"				, Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_СотрудникРегистрации" Тогда
				ПараметрыОтбора.Вставить("МассивСотрудниковРегистрации"				 , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСотрудниковРегистрации_ВариантОтбора", Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_РекламныйИсточник" Тогда
				ПараметрыОтбора.Вставить("МассивРекламныхИсточников"			  	, МассивДанных);
				ПараметрыОтбора.Вставить("МассивРекламныхИсточников_ВариантОтбора"	, Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_ПричинаОтказа" Тогда
				ПараметрыОтбора.Вставить("МассивПричинОтказов"			  			, МассивДанных);
				ПараметрыОтбора.Вставить("МассивПричинОтказов_ВариантОтбора"		, Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_Тег" Тогда
				ПараметрыОтбора.Вставить("МассивТегов"								, МассивДанных);
				ПараметрыОтбора.Вставить("МассивТегов_ВариантОтбора"				, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Интерес" Тогда
				ПараметрыОтбора.Вставить("МассивИнтересов"							, МассивДанных);
				ПараметрыОтбора.Вставить("МассивИнтересов_ВариантОтбора"			, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_КаналПривлечения" Тогда
				ПараметрыОтбора.Вставить("МассивКаналовПривлечения"				 	, МассивДанных);
				ПараметрыОтбора.Вставить("МассивКаналовПривлечения_ВариантОтбора"	, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_ПредварительнаяЗапись" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусовНаличияПредварительнойЗаписи"			   , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусовНаличияПредварительнойЗаписи_ВариантОтбора", Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_Задача" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусовНаличияЗадач"			   , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусовНаличияЗадач_ВариантОтбора", Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_ПризнакВыполненияСделки" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусовСделок"			     , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусовСделок_ВариантОтбора", Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_ПометкаУдаленияСделки" Тогда
				ПараметрыОтбора.Вставить("СписокСтатусовПометокУдаления"			  , МассивДанных);
				ПараметрыОтбора.Вставить("СписокСтатусовПометокУдаления_ВариантОтбора", Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_СозданаПериод" Тогда
				ПараметрыОтбора.Вставить("ПериодСозданияСделки", МассивДанных);

			ИначеЕсли Строка.Наименование = "Фильтр_ПериодЗапланированнойЗадачи" Тогда
				ПараметрыОтбора.Вставить("ПериодПланирования", МассивДанных);

			ИначеЕсли Строка.Наименование = "Фильтр_ЗавершенаПериод" Тогда
				ПараметрыОтбора.Вставить("ПериодСделки", МассивДанных);	
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПараметрыОтбора;
	
КонецФункции

&НаКлиенте
// Функция - ПолучениеЭлементовОтбора
Функция ПолучениеЭлементовОтбораКлиент(Массив, СписокЗначений, НаименованиеФильтра)
	
	Если НаименованиеФильтра = "Фильтр_СозданаПериод" 
		Или НаименованиеФильтра = "Фильтр_ЗавершенаПериод" 
		Или НаименованиеФильтра = "Фильтр_ПериодЗапланированнойЗадачи" Тогда
		
		Если СписокЗначений.Количество() > 0 Тогда
			ЗаданноеЗначение = СписокЗначений.Получить(0).Значение; 
			Массив.Добавить(ЗаданноеЗначение.ЗначениеФильтра);
		КонецЕсли;
		
	Иначе
		
		Если СписокЗначений.Количество() > 0 Тогда
			Для каждого Значение из СписокЗначений Цикл
				Если Значение.Значение.Выбран = Истина Тогда
					Массив.Добавить(Значение.Значение.ЗначениеФильтра);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик завершения асинхронного события.
//
Процедура ПослеВыбораВидаСделки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Результат.Значение = ЭтотОбъект.ОтборВидСделки Тогда
		// Ничего не изменилось - действий не требуется.
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ОтборВидСделки			 = Результат.Значение;
	Элементы.ИзменитьВидСделки.Заголовок = Результат.Представление;
	
	АктуализироватьДанныеСпискаСогласноОтборов();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Процедура, устанавливает отображение фильтров по задачам.
//
Процедура УстановитьОтображениеФильтровПоЗадачам(Форма, ОтборБезАктивности = Ложь, ОтборПросроченныхЗадач = Ложь, ОтборЗадачНаСегодня = Ложь)
	
	ФонАктивнойГруппы	 = Новый Цвет(218, 230, 244);
	ФонНеактивнойГруппы	 = Новый Цвет(255, 255, 255);
	
	Форма.Элементы.ГруппаБезЗадач.ЦветФона			 = ФонНеактивнойГруппы;
	Форма.Элементы.ГруппаЗадачиНаСегодня.ЦветФона	 = ФонНеактивнойГруппы;
	Форма.Элементы.ГруппаПросроченныеЗадачи.ЦветФона = ФонНеактивнойГруппы;
	
	Форма.Элементы.СброситьОтборБезЗадач.Видимость			 = Ложь;
	Форма.Элементы.СброситьОтборЗадачиНаСегодня.Видимость	 = Ложь;
	Форма.Элементы.СброситьОтборПросроченныеЗадачи.Видимость = Ложь;
	
	Если ОтборБезАктивности = Истина Тогда
		
		Форма.Элементы.ГруппаБезЗадач.ЦветФона			 = ФонАктивнойГруппы;
		Форма.Элементы.СброситьОтборБезЗадач.Видимость	 = Истина;
		
		Форма.ОтборПоЗадачам = 3;
		
	ИначеЕсли ОтборЗадачНаСегодня = Истина Тогда
		
		Форма.Элементы.ГруппаЗадачиНаСегодня.ЦветФона			 = ФонАктивнойГруппы;
		Форма.Элементы.СброситьОтборЗадачиНаСегодня.Видимость	 = Истина;
		
		Форма.ОтборПоЗадачам = 1;
		
	ИначеЕсли ОтборПросроченныхЗадач = Истина Тогда
		
		Форма.Элементы.ГруппаПросроченныеЗадачи.ЦветФона			 = ФонАктивнойГруппы;
		Форма.Элементы.СброситьОтборПросроченныеЗадачи.Видимость	 = Истина;
		
		Форма.ОтборПоЗадачам = 2;
		
	Иначе
		Форма.ОтборПоЗадачам = 0;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Возвращает значение свойства структуры.
//
// Параметры:
//   Структура - Структура
//             - ФиксированнаяСтруктура - объект, из которого необходимо прочитать значение ключа.
//   Ключ - Строка - имя свойства структуры, для которого необходимо прочитать значение.
//   ЗначениеПоУмолчанию - Произвольный - необязательный. Возвращается когда в структуре нет значения по указанному
//                                        ключу.
//       Для скорости рекомендуется передавать только быстро вычисляемые значения (например примитивные типы),
//       а инициализацию более тяжелых значений выполнять после проверки полученного значения (только если это
//       требуется).
//
// Возвращаемое значение:
//   Произвольный - значение свойства структуры. ЗначениеПоУмолчанию если в структуре нет указанного свойства.
//
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
	
КонецФункции

#КонецОбласти
