 
#Область ОбработчикиСобытийФормы  
 
&НаСервере
// Процедура, обработчик события ПриСозданииНаСервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображатьКод                   = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Элементы.Код.Видимость          = ОтображатьКод;
	Элементы.Код.ПоложениеЗаголовка = ?(ОтображатьКод, ПоложениеЗаголовкаЭлементаФормы.Авто, ПоложениеЗаголовкаЭлементаФормы.Нет); 
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ТипКонтрагента") Тогда
		ЭтоПолис = Параметры.Отбор.ТипКонтрагента = Перечисления.ТипыКонтрагентов.СтраховаяКомпания;
	КонецЕсли;	
	
	Если ЭтаФорма.Параметры <> Неопределено И ЭтаФорма.Параметры.Свойство("ФильтрПоРодителю") Тогда			
		Элементы.Список.ТекущийРодитель = ЭтаФорма.Параметры.ФильтрПоРодителю.Родитель; 	
	КонецЕсли; 
	
	Если Параметры.Свойство("МножественныйВыбор") Тогда
		Элементы.Список.МножественныйВыбор = ?(НЕ Параметры.МножественныйВыбор = Неопределено, Параметры.МножественныйВыбор, Ложь);
	КонецЕсли;	
	
	Если Параметры.Свойство("СделкаПостоянныйПациент") Тогда
		Если Параметры.СделкаПостоянныйПациент Тогда 
			НастроитьДинамическийСписок();			
		КонецЕсли;
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры 

&НаКлиенте 
// Процедура, Обработчик события "ПриОткрытии" формы.
//
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоПолис Тогда 
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		ЭтаФорма.АвтоЗаголовок      = Ложь;
		ЭтаФорма.Заголовок          = "Страховые компании"; 
	КонецЕсли;
	
КонецПроцедуры   

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

&НаСервере 
// Процедура, Настроить динамический список.
//
Процедура НастроитьДинамическийСписок()
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Наименование КАК Наименование,
	|	Контрагенты.Код КАК Код,
	|	Контрагенты.Комментарий КАК Комментарий,
	|	ВЫБОР
	|		КОГДА Контрагенты.ЭтоГруппа
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ + ВЫБОР
	|		КОГДА Контрагенты.ПометкаУдаления
	|			ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВариантКартинки
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка В
	|			(ВЫБРАТЬ
	|				СтатусыКонтрагентов.Контрагент
	|			ИЗ
	|				РегистрСведений.СтатусыКонтрагентов.СрезПоследних(, ) КАК СтатусыКонтрагентов
	|			ГДЕ
	|				(СтатусыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Постоянный)
	|					ИЛИ СтатусыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.НеВернувшийся)))"; 	
	
	СвойстваСписка.ОсновнаяТаблица              = "Справочник.Контрагенты";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ТекстЗапроса                 = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
	
КонецПроцедуры   

#КонецОбласти