
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Для Каждого СтрокаПараметра Из Параметры.ПараметрыОборудования Цикл
		СтрокаТаблицы = ТаблицаПараметров.Добавить();

		СтрокаТаблицы.Идентификатор       = СтрокаПараметра.Идентификатор;
		СтрокаТаблицы.Наименование        = СтрокаПараметра.Наименование;
		СтрокаТаблицы.Тип                 = СтрокаПараметра.Тип;
		СтрокаТаблицы.ЗначениеПоУмолчанию = СтрокаПараметра.ЗначениеПоУмолчанию;
		СтрокаТаблицы.ТолькоДляЧтения     = СтрокаПараметра.ТолькоДляЧтения;
		СтрокаТаблицы.Описание            = СтрокаПараметра.Описание;
		СтрокаТаблицы.Значение            = ?(СтрокаПараметра.Значение = Неопределено,
		                                      СтрокаПараметра.ЗначениеПоУмолчанию,
		                                      СтрокаПараметра.Значение);
	КонецЦикла;
	Заголовок = Параметры.НаименованиеУстройства;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТаблицаПараметровПриАктивизацииЯчейки(Элемент)

	Если Элемент.ТекущийЭлемент <> Неопределено 
	   И Элемент.ТекущийЭлемент.Имя = "ТаблицаПараметровЗначение" Тогда

		Массив = Новый Массив();
		Массив.Добавить(Тип(Элемент.ТекущиеДанные.Тип));
		Элемент.ТекущийЭлемент.ДоступныеТипы  = Новый ОписаниеТипов(Массив);
		Элемент.ТекущийЭлемент.МногострочныйРежим = (Тип(Элемент.ТекущиеДанные.Тип) = Тип("Строка"));

		Элемент.ТекущийЭлемент.ТолькоПросмотр = Элемент.ТекущиеДанные.ТолькоДляЧтения;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметровЗначениеПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрытьВыполнить(Команда)

	МассивПараметров = Новый Массив();
	Для Каждого СтрокаТаблицы Из ТаблицаПараметров Цикл
		Параметр = Новый Структура("Идентификатор, Значение, Тип, ЗначениеПоУмолчанию,
		                              |ТолькоДляЧтения, Наименование, Описание",
		                              СтрокаТаблицы.Идентификатор,
		                              СтрокаТаблицы.Значение,
		                              СтрокаТаблицы.Тип,
		                              СтрокаТаблицы.ЗначениеПоУмолчанию,
		                              СтрокаТаблицы.ТолькоДляЧтения,
		                              СтрокаТаблицы.Наименование,
		                              СтрокаТаблицы.Описание);

		МассивПараметров.Добавить(Параметр);
	КонецЦикла;
	Параметры.ПараметрыНастройки.Добавить(МассивПараметров, "ПараметрыОборудования");

	ОчиститьСообщения();
	Закрыть(КодВозвратаДиалога.ОК);

КонецПроцедуры

#КонецОбласти