
 #Область ОбработчикиСобытийФормы
 
&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ШаблонДляОтправкиСсылкиНаОплату = Параметры.ШаблонДляОтправкиСсылкиНаОплату;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - Шаблон нажатие
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ШаблонНажатие(Элемент)

	ШаблонДляОтправкиСсылкиНаОплату = ШаблонДляОтправкиСсылкиНаОплату + " " + Элемент.Заголовок;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Сохранить
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Сохранить(Команда)
	
	Закрыть(Новый Структура("ШаблонДляОтправкиСсылкиНаОплату", ШаблонДляОтправкиСсылкиНаОплату));

КонецПроцедуры

&НаКлиенте
// Процедура - Шаблон для отправки ссылки на оплату при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ШаблонДляОтправкиСсылкиНаОплатуПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

