///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область УстаревшиеПроцедурыИФункции

// Устарела. Необходимо использовать РаботаВМоделиСервиса.ЭтоРазделеннаяКонфигурация.
// Возвращает признак наличия в конфигурации общих реквизитов-разделителей.
//
// Возвращаемое значение:
//   Булево - Истина, если это разделенная конфигурация.
//
Функция ЭтоРазделеннаяКонфигурация() Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса") Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		ЕстьРазделители = МодульРаботаВМоделиСервиса.ЭтоРазделеннаяКонфигурация();
	Иначе
		ЕстьРазделители = Ложь;
	КонецЕсли;
	
	Возврат ЕстьРазделители;
	
КонецФункции

// Устарела. Необходимо использовать РаботаВМоделиСервиса.РазделителиКонфигурации.
// Возвращает массив существующих в конфигурации разделителей.
//
// Возвращаемое значение:
//   ФиксированныйМассив - массив имен общих реквизитов, которые
//     являются разделителями.
//
Функция РазделителиКонфигурации() Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса") Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		Разделители = МодульРаботаВМоделиСервиса.РазделителиКонфигурации();
	Иначе
		Разделители = Новый  Массив;
	КонецЕсли;
	
	Возврат Разделители;
	
КонецФункции

// Устарела. Необходимо использовать РаботаВМоделиСервиса.СоставОбщегоРеквизита.
// Возвращает состав общего реквизита с заданным именем.
//
// Параметры:
//   Имя - Строка - Имя общего реквизита.
//
// Возвращаемое значение:
//   СоставОбщегоРеквизита - список объектов метаданных, в которые входит общий реквизит.
//
Функция СоставОбщегоРеквизита(Знач Имя) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса") Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		СоставОбщегоРеквизита = МодульРаботаВМоделиСервиса.СоставОбщегоРеквизита(Имя);
	Иначе
		СоставОбщегоРеквизита = Неопределено;
	КонецЕсли;
	
	Возврат СоставОбщегоРеквизита;
	
КонецФункции

// Устарела. Необходимо использовать РаботаВМоделиСервиса.ЭтоРазделенныйОбъектМетаданных.
// Возвращает признак того, что объект метаданных используется в общих реквизитах-разделителях.
//
// Параметры:
//   ИмяОбъектаМетаданных - Строка - имя объекта,
//   Разделитель - Строка - имя общего реквизита-разделителя, на разделение которыми проверяется объект метаданных.
//
// Возвращаемое значение:
//   Булево - Истина, если это разделенный объект.
//
Функция ЭтоРазделенныйОбъектМетаданных(Знач ИмяОбъектаМетаданных, Знач Разделитель) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса") Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		ЭтоРазделенныйОбъектМетаданных = МодульРаботаВМоделиСервиса.ЭтоРазделенныйОбъектМетаданных(ИмяОбъектаМетаданных);
	Иначе
		ЭтоРазделенныйОбъектМетаданных = Ложь;
	КонецЕсли;
	
	Возврат ЭтоРазделенныйОбъектМетаданных;
	
КонецФункции

// Устарела. Необходимо использовать ОбщегоНазначения.РазделениеВключено.
// Возвращает признак работы в режиме разделения данных по областям
// (технически это признак условного разделения).
// 
// Возвращает Ложь, если конфигурация не может работать в режиме разделения данных
// (не содержит общих реквизитов, предназначенных для разделения данных).
//
// Возвращаемое значение:
//  Булево - Истина, если разделение включено.
//         - Ложь,   если разделение выключено или не поддерживается.
//
Функция РазделениеВключено() Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса") Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		РазделениеВключено = МодульРаботаВМоделиСервиса.РазделениеВключено();
	Иначе
		РазделениеВключено = Ложь;
	КонецЕсли;
	
	Возврат РазделениеВключено;
	
КонецФункции

// Устарела. Необходимо использовать ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных.
// Возвращает признак возможности обращения к разделенным данным (которые входят в состав разделителей).
// Признак относится к сеансу, но может меняться во время работы сеанса, если разделение было включено
// в самом сеансе, поэтому проверку следует делать непосредственно перед обращением к разделенным данным.
// 
// Возвращает Истина, если конфигурация не может работать в режиме разделения данных
// (не содержит общих реквизитов, предназначенных для разделения данных).
//
// Возвращаемое значение:
//   Булево - Истина, если разделение не поддерживается, либо разделение выключено,
//                    либо разделение включено и разделители    установлены.
//          - Ложь,   если разделение включено и разделители не установлены.
//
Функция ДоступноИспользованиеРазделенныхДанных() Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса") Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		ДоступноИспользованиеРазделенныхДанных = МодульРаботаВМоделиСервиса.ДоступноИспользованиеРазделенныхДанных();
	Иначе
		ДоступноИспользованиеРазделенныхДанных = Истина;
	КонецЕсли;
	
	Возврат ДоступноИспользованиеРазделенныхДанных;
	
КонецФункции

// Устарела. Возвращает объект ПреобразованиеXSL созданный из общего макета с переданным
// именем.
//
// Параметры:
//   ИмяОбщегоМакета - Строка - имя общего макета типа ДвоичныеДанные содержащего
//     файл преобразования XSL.
//
// Возвращаемое значение:
//   ПреобразованиеXSL - объект ПреобразованиеXSL.
//
Функция ПолучитьПреобразованиеXSLИзОбщегоМакета(Знач ИмяОбщегоМакета) Экспорт
	
	ДанныеМакета = ПолучитьОбщийМакет(ИмяОбщегоМакета);
	ИмяФайлаПреобразования = ПолучитьИмяВременногоФайла("xsl");
	ДанныеМакета.Записать(ИмяФайлаПреобразования);
	
	Преобразование = Новый ПреобразованиеXSL;
	Преобразование.ЗагрузитьТаблицуСтилейXSLИзФайла(ИмяФайлаПреобразования);
	
	Попытка
		УдалитьФайлы(ИмяФайлаПреобразования);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Получение XSL'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат Преобразование;
	
КонецФункции

// Устарела. Необходимо использовать РаботаВМоделиСервиса.СеансЗапущенБезРазделителей.
// Определяет, сеанс запущен с разделителями или без.
//
// Возвращаемое значение:
//   Булево - Истина, если сеанс запущен без разделителей.
//
Функция СеансЗапущенБезРазделителей() Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса") Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		СеансЗапущенБезРазделителей = МодульРаботаВМоделиСервиса.СеансЗапущенБезРазделителей();
	Иначе
		СеансЗапущенБезРазделителей = Истина;
	КонецЕсли;
	
	Возврат СеансЗапущенБезРазделителей;
	
КонецФункции

// Функция - Получить настройки оповещения пользователя по взаимодействиям
//
// Параметры:
//  ТекущийПользователь	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьНастройкиОповещенияПользователяПоВзаимодействиям(ТекущийПользователь = Неопределено) Экспорт
	
	Возврат РегистрыСведений.НастройкиПользователей.ПолучитьНастройкиОповещенияПользователяПоВзаимодействиям(ТекущийПользователь); 	
	
КонецФункции

#КонецОбласти

#Область БСП

// Возвращает имя общего реквизита, который является разделителем основных данных.
//
// Возвращаемое значение: Строка.
//
Функция РазделительОсновныхДанных() Экспорт
	
	Результат = "";
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.БазоваяФункциональностьВМоделиСервиса") Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		Результат = МодульРаботаВМоделиСервиса.РазделительОсновныхДанных();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает имя общего реквизита, который является разделителем вспомогательных данных.
//
// Возвращаемое значение: Строка.
//
Функция РазделительВспомогательныхДанных() Экспорт
	
	Результат = "";
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.БазоваяФункциональностьВМоделиСервиса") Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		Результат = МодульРаботаВМоделиСервиса.РазделительВспомогательныхДанных();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает данные кэша версий из ресурса типа ХранилищеЗначения регистра КэшПрограммныхИнтерфейсов.
//
// Параметры:
//   Идентификатор - Строка - идентификатор записи кэша.
//   ТипДанных     - ПеречислениеСсылка.ТипыДанныхКэшаПрограммныхИнтерфейсов.
//   ПараметрыПолучения - Строка - массив параметров сериализованный в XML для передачи в метод обновления кэша.
//   ВозвращатьУстаревшиеДанные - Булево - флаг определяющий необходимость ожидания обновления
//      данных в кэше перед возвратом значения, в случае обнаружения факта их устаревания.
//      Истина - всегда использовать данные из кэша, если они там есть. Ложь - ожидать
//      обновления данных кэша, в случае обнаружения факта устаревания данных.
//
// Возвращаемое значение:
//   Произвольный.
//
Функция ДанныеКэшаВерсий(Знач Идентификатор, Знач ТипДанных, Знач ПараметрыПолучения, Знач ИспользоватьУстаревшиеДанные = Истина) Экспорт
	
	ПараметрыПолучения = ОбщегоНазначения.ЗначениеИзСтрокиXML(ПараметрыПолучения);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаКэша.ДатаОбновления КАК ДатаОбновления,
		|	ТаблицаКэша.Данные КАК Данные,
		|	ТаблицаКэша.ТипДанных КАК ТипДанных
		|ИЗ
		|	РегистрСведений.КэшПрограммныхИнтерфейсов КАК ТаблицаКэша
		|ГДЕ
		|	ТаблицаКэша.Идентификатор = &Идентификатор
		|	И ТаблицаКэша.ТипДанных = &ТипДанных";
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	
	НачатьТранзакцию();
	Попытка
		// Не устанавливаем управляемую блокировку, чтобы другие сеансы могли изменять значение пока эта транзакция активна.
		Результат = Запрос.Выполнить();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ТребуетсяВыполнитьОбновление = Ложь;
	ТребуетсяПеречитатьДанные = Ложь;
	
	Если Результат.Пустой() Тогда
		
		ТребуетсяВыполнитьОбновление = Истина;
		ТребуетсяПеречитатьДанные = Истина;
		
	Иначе
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		// Если ОбщегоНазначения.ЗаписьКэшаВерсийУстарела(Выборка) Тогда
			ТребуетсяВыполнитьОбновление = Истина;
			ТребуетсяПеречитатьДанные = НЕ ИспользоватьУстаревшиеДанные;
		// КонецЕсли;
	КонецЕсли;
	
	Если ТребуетсяВыполнитьОбновление Тогда
		
		ОбновлениеВТекущемСеансе = ТребуетсяПеречитатьДанные
			Или ОбщегоНазначения.ИнформационнаяБазаФайловая()
			Или МонопольныйРежим()
			Или ОбщегоНазначенияКлиентСервер.РежимОтладки()
			Или ТекущийРежимЗапуска() = Неопределено;
		
		Если ОбновлениеВТекущемСеансе Тогда
			РегистрыСведений.КэшПрограммныхИнтерфейсов.ОбновитьДанныеКэшаВерсий(Идентификатор, ТипДанных, ПараметрыПолучения);
			ТребуетсяПеречитатьДанные = Истина;
		Иначе
			ИмяМетодаЗадания = "РегистрыСведений.КэшПрограммныхИнтерфейсов.ОбновитьДанныеКэшаВерсий";
			НаименованиеЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Обновление кэша версий. Идентификатор записи %1. Тип данных %2.'"),
				Идентификатор,
				ТипДанных);
			ПараметрыЗадания = Новый Массив;
			ПараметрыЗадания.Добавить(Идентификатор);
			ПараметрыЗадания.Добавить(ТипДанных);
			ПараметрыЗадания.Добавить(ПараметрыПолучения);
			
			ОтборЗаданий = Новый Структура;
			ОтборЗаданий.Вставить("ИмяМетода", ИмяМетодаЗадания);
			ОтборЗаданий.Вставить("Наименование", НаименованиеЗадания);
			ОтборЗаданий.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
			
			Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборЗаданий);
			Если Задания.Количество() = 0 Тогда
				// Запустим новое.
				ДлительныеОперации.ЗапуститьФоновоеЗаданиеСКонтекстомКлиента(ИмяМетодаЗадания,
					ПараметрыЗадания,, НаименованиеЗадания);
			КонецЕсли;
		КонецЕсли;
		
		Если ТребуетсяПеречитатьДанные Тогда
			
			НачатьТранзакцию();
			Попытка
				// Не устанавливаем управляемую блокировку что бы другие сеансы могли изменять значение пока эта транзакция активна.
				Результат = Запрос.Выполнить();
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				ВызватьИсключение;
			КонецПопытки;
			
			Если Результат.Пустой() Тогда
				ШаблонСообщения = НСтр("ru = 'Ошибка при обновлении кэша версий. Данные не получены.
					|Идентификатор записи: %1
					|Тип данных: %2'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Идентификатор, ТипДанных);
					
				ВызватьИсключение(ТекстСообщения);
			КонецЕсли;
			
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат Выборка.Данные.Получить();
	
КонецФункции

// Возвращает объект WSОпределения созданный с переданными параметрами.
//
// Параметры:
//  АдресWSDL - Строка - месторасположение wsdl.
//  ИмяПользователя - Строка - имя пользователя для входа на сервер.
//  Пароль - Строка - пароль пользователя.
//
// Примечание: при получении определения используется кэш, обновление которого осуществляется
//  при смене версии конфигурации. Если для целей отладки требуется обновить
//  значения в кэше, раньше этого времени, следует удалить из регистра сведений.
//  КэшПрограммныхИнтерфейсов соответствующие записи.
//
Функция WSОпределения(Знач АдресWSDL, Знач ИмяПользователя, Знач Пароль) Экспорт
	
	Возврат  РегистрыСведений.КэшПрограммныхИнтерфейсов.WSОпределения(АдресWSDL, ИмяПользователя, Пароль);
	
КонецФункции

Функция СоздатьWSПрокси(Параметры) Экспорт
	
	Возврат РегистрыСведений.КэшПрограммныхИнтерфейсов.ВнутренняяWSПрокси(ОбщегоНазначения.ЗначениеИзСтрокиXML(Параметры));
	
КонецФункции

// Параметры, применяемых к элементам командного интерфейса, связанных с параметрическими функциональными опциями.
Функция ОпцииИнтерфейса() Экспорт
	
	ОпцииИнтерфейса = Новый Структура;
	Попытка
		ОбщегоНазначенияПереопределяемый.ПриОпределенииПараметровФункциональныхОпцийИнтерфейса(ОпцииИнтерфейса);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ИмяСобытия = НСтр("ru = 'Настройка интерфейса'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'При получении опций интерфейса произошла ошибка:
			   |%1'"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
	КонецПопытки;
	
	Возврат ОпцииИнтерфейса;
КонецФункции

// Определяет текущий режим работы программы.
//   В частности используется в панелях настроек программы
//   для скрытия специализированных интерфейсов, предназначенных не для всех режимов работы.
//
// Возвращаемое значение:
//   Структура - Настройки, описывающие права текущего пользователя и текущий режим работы программы.
//     По правам:
//       * ЭтоАдминистраторСистемы   - Булево - Истина, если есть право администрирования информационной базы.
//       * ЭтоАдминистраторПрограммы - Булево - Истина, если есть доступ ко всем "прикладным" данным информационной
//                                              базы.
//     По режимам работы базы:
//       * МодельСервиса   - Булево - Истина, если в конфигурации есть разделители и они условно включены.
//       * Локальный       - Булево - Истина, если конфигурации работает в обычном режиме (не в модели сервиса и не в
//                                    автономном рабочем месте).
//       * Автономный      - Булево - Истина, если конфигурации работает в режиме АРМ (автономное рабочее место).
//       * Файловый        - Булево - Истина, если конфигурации работает в файловом режиме.
//       * КлиентСерверный - Булево - Истина, если конфигурации работает в клиент-серверном режиме.
//       * ЛокальныйФайловый        - Булево - Истина, если работа в обычном файловом режиме.
//       * ЛокальныйКлиентСерверный - Булево - Истина, если работа в обычном клиент-серверном режиме.
//     По функциональности клиентской части:
//       * ЭтоLinuxКлиент - Булево - Истина, если клиентское приложение запущено под управлением ОС Linux.
//       * ЭтоВебКлиент   - Булево - Истина, если клиентское приложение является Веб-клиентом.
//
// Описание:
//   В панелях настроек программы включены 5 интерфейсов:
//     - Для администратора сервиса в области данных абонента (АС).
//     - Для администратора абонента (АА).
//     - Для администратора локального решения в клиент-серверном режиме (ЛКС).
//     - Для администратора локального решения в файловом режиме (ЛФ).
//     - Для администратора автономного рабочего места (АРМ).
//   
//   Интерфейсы АС и АА разрезаются при помощи скрытия групп и элементов формы
//     для всех ролей, кроме роли "АдминистраторСистемы".
//   
//   Администратор сервиса, выполнивший вход в область данных,
//     должен видеть те же настройки что и администратор абонента
//     вместе с настройками сервиса (неразделенными).
//
Функция РежимРаботыПрограммы() Экспорт
	РежимРаботы = Новый Структура;
	
	// Права текущего пользователя.
	РежимРаботы.Вставить("ЭтоАдминистраторПрограммы", Пользователи.ЭтоПолноправныйПользователь(, Ложь, Ложь)); // АА, АС, ЛКС, ЛФ
	РежимРаботы.Вставить("ЭтоАдминистраторСистемы",   Пользователи.ЭтоПолноправныйПользователь(, Истина, Ложь)); // АС, ЛКС, ЛФ
	
	// Режимы работы сервера.
	РежимРаботы.Вставить("МодельСервиса", РазделениеВключено()); // АС, АА
	РежимРаботы.Вставить("Локальный",     ПолучитьФункциональнуюОпцию("РаботаВЛокальномРежиме")); // ЛКС, ЛФ
	РежимРаботы.Вставить("Автономный",    ПолучитьФункциональнуюОпцию("РаботаВАвтономномРежиме")); // АРМ
	РежимРаботы.Вставить("Файловый",        Ложь); // АС, АА, ЛФ
	РежимРаботы.Вставить("КлиентСерверный", Ложь); // АС, АА, ЛКС
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		РежимРаботы.Файловый = Истина;
	Иначе
		РежимРаботы.КлиентСерверный = Истина;
	КонецЕсли;
	
	РежимРаботы.Вставить("ЛокальныйФайловый",
		РежимРаботы.Локальный И РежимРаботы.Файловый); // ЛФ
	РежимРаботы.Вставить("ЛокальныйКлиентСерверный",
		РежимРаботы.Локальный И РежимРаботы.КлиентСерверный); // ЛКС
	
	// Режимы работы клиента.
	РежимРаботы.Вставить("ЭтоWindowsКлиент", ОбщегоНазначенияКлиентСервер.ЭтоWindowsКлиент());
	РежимРаботы.Вставить("ЭтоLinuxКлиент"  , ОбщегоНазначенияКлиентСервер.ЭтоLinuxКлиент());
	РежимРаботы.Вставить("ЭтоOSXКлиент"    , ОбщегоНазначенияКлиентСервер.ЭтоOSXКлиент());
	РежимРаботы.Вставить("ЭтоВебКлиент"    , ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент());
	
	Возврат РежимРаботы;
КонецФункции

// Возвращает признак принадлежности узла к плану обмена РИБ.
//
// Параметры:
//  УзелИнформационнойБазы - ПланОбменаСсылка - узел плана обмена, для которого требуется получить значение функции.
// 
//  Возвращаемое значение:
//   Истина - узел принадлежит плану обмена РИБ, иначе Ложь.
//
Функция ЭтоУзелРаспределеннойИнформационнойБазы(УзелИнформационнойБазы) Экспорт

	Возврат УзелИнформационнойБазы.Метаданные().РаспределеннаяИнформационнаяБаза;
	
КонецФункции

// Возвращает Истина, если программа работает в режиме автономного рабочего места.
Функция ЭтоАвтономноеРабочееМесто() Экспорт
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МодульОбменДаннымиПовтИсп = ОбщегоНазначения.ОбщийМодуль("ОбменДаннымиПовтИсп");
	
	Возврат МодульОбменДаннымиПовтИсп.ЭтоАвтономноеРабочееМесто();
	
КонецФункции

// Возвращает массив описаний обработчиков серверного события.
Функция ОбработчикиСерверногоСобытия(Событие, Служебное = Ложь) Экспорт
	
	ПодготовленныеОбработчики = ПодготовленныеОбработчикиСерверногоСобытия(Событие, Служебное);
	
	//Если ПодготовленныеОбработчики = Неопределено Тогда
	//	// Автообновление кэша. Обновление повторно используемых значений требуется.
	//	СтандартныеПодсистемыВызовСервера.ПриОшибкеПолученияОбработчиковСобытия();
	//	ОбновитьПовторноИспользуемыеЗначения();
	//	// Повторная попытка получить обработчики события.
	//	ПодготовленныеОбработчики = ПодготовленныеОбработчикиСерверногоСобытия(Событие, Служебное, Ложь);
	//КонецЕсли;
	
	Возврат ПодготовленныеОбработчики;
	
КонецФункции

// Функция - Подготовленные обработчики серверного события
//
// Параметры:
//  Событие			 - 	 - 
//  Служебное		 - 	 - 
//  ПерваяПопытка	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПодготовленныеОбработчикиСерверногоСобытия(Событие, Служебное = Ложь, ПерваяПопытка = Истина)
	
	//Параметры = СтандартныеПодсистемыПовтИсп.ПараметрыПрограммныхСобытий().ОбработчикиСобытий.НаСервере;
	//
	//Если Служебное Тогда
	//	Обработчики = Параметры.ОбработчикиСлужебныхСобытий.Получить(Событие);
	//Иначе
	//	Обработчики = Параметры.ОбработчикиСобытий.Получить(Событие);
	//КонецЕсли;
	//
	//Если ПерваяПопытка И Обработчики = Неопределено Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	//
	//Если Обработчики = Неопределено Тогда
	//	Если Служебное Тогда
	//		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не найдено серверное служебное событие ""%1"".'"), Событие);
	//	Иначе
	//		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не найдено серверное событие ""%1"".'"), Событие);
	//	КонецЕсли;
	//КонецЕсли;
	
	Массив = Новый Массив;
	
	//Для каждого Обработчик Из Обработчики Цикл
	//	Элемент = Новый Структура;
	//	Модуль = Неопределено;
	//	Если ПерваяПопытка Тогда
	//		Попытка
	//			Модуль = ОбщегоНазначения.ОбщийМодуль(Обработчик.Модуль);
	//		Исключение
	//			Возврат Неопределено;
	//		КонецПопытки;
	//	Иначе
	//		Модуль = ОбщегоНазначения.ОбщийМодуль(Обработчик.Модуль);
	//	КонецЕсли;
	//	Элемент.Вставить("Модуль",     Модуль);
	//	Элемент.Вставить("Версия",     Обработчик.Версия);
	//	Элемент.Вставить("Подсистема", Обработчик.Подсистема);
	//	Массив.Добавить(Новый ФиксированнаяСтруктура(Элемент));
	//КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Массив);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает имя каталога временных файлов.
//
// Возвращаемое значение:
//	Строка - путь к каталогу временных файлов.
//
Функция КаталогВременногоХранилищаФайлов() Экспорт
	
	// Если файловая база, то возвращается КаталогВременныхФайлов.
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда 
		Возврат СокрЛП(КаталогВременныхФайлов());
	КонецЕсли;
	
	ОбщийТипПлатформы = "Windows";
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	//Если    СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86
	//	ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
	//	
	//	Результат         = Константы.КаталогВременныхФайловДляWindows.Получить();
	//	
	//ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86
	//	ИЛИ   СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда
	//	
	//	Результат         = Константы.КаталогВременныхФайловДляLinux.Получить();
	//	ОбщийТипПлатформы = "Linux";
	//	
	//Иначе
	//	
	//	Результат         = Константы.КаталогВременныхФайловДляWindows.Получить();
	//	
	//КонецЕсли;
	
	Результат = "";		
	ЗначениеПараметра = ?(ОбщийТипПлатформы = "Linux", "Каталог временных файлов для Linux", "Каталог временных файлов для Windows");
	
	Если ПустаяСтрока(Результат) Тогда
		
		Результат = СокрЛП(КаталогВременныхФайлов());
		
	Иначе
		
		Результат = СокрЛП(Результат);
		
		// Проверка существования каталога
		Каталог = Новый Файл(Результат);
		
		Если Не Каталог.Существует() Тогда
			
			ШаблонСообщения = НСтр("ru = 'Каталог временных файлов не существует.
					|Необходимо убедиться, что в форме настройки программы задано правильное значение константы
					|""%1"".'");
			ШаблонСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ЗначениеПараметра);
			ВызватьИсключение ШаблонСообщения;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

// Функция получает данные кеша версий из ресурса типа ХранилищеЗначения регистра КэшПрограммныхИнтерфейсов.
//
// Параметры:
// Идентификатор - Строка - идентификатор записи кэша
// ТипДанных - ПеречислениеСсылка.ТипыДанныхКэшаПрограммныхИнтерфейсов.
// ПараметрыПолучения - Строка - массив параметров сериализованный в XML для передачи в метод
//  обновления кэша
// ВозвращатьУстаревшиеДанные - Булево - флаг определяющий необходимость ожидания обновления
//  данных в кэше перед возвратом значения, в случае обнаружения факта их устаревания.
//  Истина - всегда использовать данные из кэша, если они там есть. Ложь - ожидать
//  обновления данных кэша, в случае обнаружения факта устаревания данных.
//
// Возвращаемое значение:
// Произвольный.
//
Функция ПолучитьДанныеКэшаВерсий(Знач Идентификатор, Знач ТипДанных, 
		Знач ПараметрыПолучения, Знач ИспользоватьУстаревшиеДанные = Истина) Экспорт
	
	ПараметрыПолучения = ОбщегоНазначения.ЗначениеИзСтрокиXML(ПараметрыПолучения);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаКэша.ДатаОбновления КАК ДатаОбновления,
		|	ТаблицаКэша.Данные КАК Данные,
		|	ТаблицаКэша.ТипДанных КАК ТипДанных
		|ИЗ
		|	РегистрСведений.КэшПрограммныхИнтерфейсов КАК ТаблицаКэша
		|ГДЕ
		|	ТаблицаКэша.Идентификатор = &Идентификатор
		|	И ТаблицаКэша.ТипДанных = &ТипДанных";
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	
	НачатьТранзакцию();
	Попытка
		// Не устанавливаем управляемую блокировку что бы другие сеансы могли изменять значение пока эта транзакция активна
		Результат = Запрос.Выполнить();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ТребуетсяВыполнитьОбновление = Ложь;
	ТребуетсяПеречитатьДанные = Ложь;
	
	Если Результат.Пустой() Тогда
		
		ТребуетсяВыполнитьОбновление = Истина;
		ТребуетсяПеречитатьДанные = Истина;
		
	Иначе
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		// Если ОбщегоНазначения.ЗаписьКэшаВерсийУстарела(Выборка) Тогда
			ТребуетсяВыполнитьОбновление = Истина;
			ТребуетсяПеречитатьДанные = НЕ ИспользоватьУстаревшиеДанные;
		// КонецЕсли;
	КонецЕсли;
	
	Если ТребуетсяВыполнитьОбновление Тогда
		
		ОбновлениеВТекущемСеансе = ОбщегоНазначения.ИнформационнаяБазаФайловая() ИЛИ МонопольныйРежим();
		
		Если ОбновлениеВТекущемСеансе Тогда
			РегистрыСведений.КэшПрограммныхИнтерфейсов.ОбновитьДанныеКэшаВерсий(Идентификатор, ТипДанных, ПараметрыПолучения);
			ТребуетсяПеречитатьДанные = Истина;
		Иначе
			ИмяМетодаЗадания = "РегистрыСведений.КэшПрограммныхИнтерфейсов.ОбновитьДанныеКэшаВерсий";
			НаименованиеЗадание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Обновление кэша версий. Идентификатор записи %1. Тип данных %2.'"),
				Идентификатор,
				ТипДанных);
			ПараметрыЗадания = Новый Массив;
			ПараметрыЗадания.Добавить(Идентификатор);
			ПараметрыЗадания.Добавить(ТипДанных);
			ПараметрыЗадания.Добавить(ПараметрыПолучения);
			
			ОтборЗаданий = Новый Структура;
			ОтборЗаданий.Вставить("ИмяМетода", ИмяМетодаЗадания);
			ОтборЗаданий.Вставить("Наименование", НаименованиеЗадание);
			ОтборЗаданий.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
			
			Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборЗаданий);
			Если Задания.Количество() = 0 Тогда
				// Запустим новое
				ФоновыеЗадания.Выполнить(ИмяМетодаЗадания, ПараметрыЗадания, , НаименованиеЗадание);
				// Задание могло сразу завершиться из-за обновления данных другим заданием
				Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборЗаданий);
			КонецЕсли;
		КонецЕсли;
		
		Если ТребуетсяПеречитатьДанные Тогда
			Если НЕ ОбновлениеВТекущемСеансе Тогда
				Попытка
					// Дождемся завершения
					ФоновыеЗадания.ОжидатьЗавершения(Задания);
				Исключение
					Для каждого ИсходноеЗадание Из Задания Цикл
						Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИсходноеЗадание.УникальныйИдентификатор);
						Если Задание.Состояние <> СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
							Продолжить;
						КонецЕсли;
						
						Если Задание.ИнформацияОбОшибке <> Неопределено Тогда
							ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление кэша версий'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
								УровеньЖурналаРегистрации.Ошибка,
								,
								,
								ПодробноеПредставлениеОшибки(Задание.ИнформацияОбОшибке));
							ВызватьИсключение(КраткоеПредставлениеОшибки(Задание.ИнформацияОбОшибке));
						Иначе
							ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление кэша версий'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
								УровеньЖурналаРегистрации.Ошибка,
								,
								,
								ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
							ВызватьИсключение(НСтр("ru = 'Неизвестная ошибка при выполнения задания обновления кэша версий'"));
						КонецЕсли;
					КонецЦикла;
					
					ВызватьИсключение(НСтр("ru = 'Неизвестная ошибка при обновлении кэша версий'"));
				КонецПопытки;
			КонецЕсли;
			
			НачатьТранзакцию();
			Попытка
				// Не устанавливаем управляемую блокировку что бы другие сеансы могли изменять значение пока эта транзакция активна
				Результат = Запрос.Выполнить();
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				ВызватьИсключение;
			КонецПопытки;
			
			Если Результат.Пустой() Тогда
				ШаблонСообщения = НСтр("ru = 'Ошибка при обновлении кэша версий. Данные не получены.
					|Идентификатор записи: %1
					|Тип данных: %2'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонСообщения, Идентификатор, ТипДанных);
					
				ВызватьИсключение(ТекстСообщения);
			КонецЕсли;
			
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат Выборка.Данные.Получить();
	
КонецФункции

// Функция возвращает объект WSПрокси созданный с переданными параметрами.
//
// Параметры соответствуют конструктору объекта WSПрокси.
//
Функция WSПрокси(Знач АдресWSDL, Знач URIПространстваИмен, Знач ИмяСервиса,
	Знач ИмяТочкиПодключения = "", Знач ИмяПользователя, Знач Пароль, Знач Таймаут = Неопределено) Экспорт
	
	Возврат ОбщегоНазначения.ВнутренняяWSПрокси(АдресWSDL, URIПространстваИмен, ИмяСервиса, 
		ИмяТочкиПодключения, ИмяПользователя, Пароль, Таймаут);
	
КонецФункции

// Возвращает структуру, описывающую "родительские" константы для указанных "подчиненных" констант.
//
//	Параметры:
//		СтруктураПодчиненныхКонстант - Структура - имена подчиненных констант
//
//	Возвращаемое значение:
//		Структура
//			Ключ - имя родительской константы
//
Функция ПолучитьСтруктуруРодительскихКонстант(СтруктураПодчиненныхКонстант) Экспорт
	
	Результат 		= Новый Структура;
	ТаблицаКонстант = ПолучитьТаблицуЗависимостиКонстант();
	
	Для Каждого ИскомаяКонстанта Из СтруктураПодчиненныхКонстант Цикл
		
		РодительскиеКонстанты = ТаблицаКонстант.НайтиСтроки(
			Новый Структура("ИмяПодчиненнойКонстанты", ИскомаяКонстанта.Ключ));
		
		Для Каждого СтрокаРодителя Из РодительскиеКонстанты Цикл
			
			Если Результат.Свойство(СтрокаРодителя.ИмяРодительскойКонстанты)
			 ИЛИ СтруктураПодчиненныхКонстант.Свойство(СтрокаРодителя.ИмяРодительскойКонстанты) Тогда
				Продолжить;
			КонецЕсли;
			
			Результат.Вставить(СтрокаРодителя.ИмяРодительскойКонстанты);
			
			РодителиРодителя = ПолучитьСтруктуруРодительскихКонстант(Новый Структура(СтрокаРодителя.ИмяРодительскойКонстанты));
			
			Для Каждого РодительРодителя Из РодителиРодителя Цикл
				Результат.Вставить(РодительРодителя.Ключ);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает таблицу, описывающую зависимость констант в конфигурации.
// Каждая строка таблицы означает:
// для родительской константы со значением Х допустимо только значение Y для подчиненной константы.
//
// Возвращаемое значение:
//	ТаблицаЗначений с колонками
//		- ИмяРодительскойКонстанты
//		- ИмяПодчиненнойКонстанты
//		- ЗначениеРодительскойКонстанты
//		- ЗначениеПодчиненнойКонстанты
//
Функция ПолучитьТаблицуЗависимостиКонстант() Экспорт
	
	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("ИмяРодительскойКонстанты", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИмяПодчиненнойКонстанты",  Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЗначениеРодительскойКонстанты");
	Результат.Колонки.Добавить("ЗначениеПодчиненнойКонстанты");
	
	Результат.Индексы.Добавить("ИмяРодительскойКонстанты");
	Результат.Индексы.Добавить("ИмяПодчиненнойКонстанты");
	
	// Бизнес-процессы и задачи
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьСогласованиеЗаказовКлиентов", 					Истина, "ИспользоватьБизнесПроцессыИЗадачи", 	 Истина);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьСогласованиеЗаказовПоставщикам", 				Истина, "ИспользоватьБизнесПроцессыИЗадачи", 	 Истина);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьСогласованиеЗаявокНаВозвратТоваровОтКлиентов", Истина, "ИспользоватьБизнесПроцессыИЗадачи", 	 Истина);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьСогласованиеКоммерческихПредложений", 			Истина, "ИспользоватьБизнесПроцессыИЗадачи", 	 Истина);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьСогласованиеСоглашенийСКлиентами", 			Истина, "ИспользоватьБизнесПроцессыИЗадачи", 	 Истина);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьСогласованиеЦенНоменклатуры", 					Истина, "ИспользоватьБизнесПроцессыИЗадачи", 	 Истина);
	
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользоватьБизнесПроцессыИЗадачи", 						Ложь, 	"ИспользоватьПодчиненныеБизнесПроцессы", Ложь);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользоватьБизнесПроцессыИЗадачи", 						Ложь, 	"ИзменятьЗаданияЗаднимЧислом", 			 Ложь);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользоватьБизнесПроцессыИЗадачи", 						Ложь, 	"ИспользоватьДатуНачалаЗадач", 			 Ложь);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользоватьБизнесПроцессыИЗадачи", 						Ложь, 	"ИспользоватьДатуИВремяВСрокахЗадач", 	 Ложь);
	
	
	// Почта
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьПочтовыйКлиент", Ложь, "ИспользоватьПризнакРассмотрено", 	Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьПочтовыйКлиент", Ложь, "ИспользоватьПрочиеВзаимодействия", Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьПочтовыйКлиент", Ложь, "ОтправлятьПисьмаВФорматеHTML", 	Ложь);
	
	
	// Полнотекстовый поиск
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьПолнотекстовыйПоиск", Ложь, "ИспользоватьПолнотекстовыйПоискПриПодбореТоваров", Ложь);
	
	
	// Синхронизация данных
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьФасовкуВесовогоТовара", Истина, "ПрефиксВесовогоШтрихкода", 2);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьФасовкуВесовогоТовара", Ложь, "ПрефиксВесовогоШтрихкода", 1);

	
	// ЭДО
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьОбменЭД", 						Ложь, "ИспользоватьОбменЭДМеждуОрганизациями", 				 Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьОбменЭД", 						Ложь, "ИспользоватьОбменЭДСБанками", 						 Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьОбменЭД", 						Ложь, "ИспользоватьОтложеннуюОтправкуЭлектронныхДокументов", Ложь);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЭлектронныеЦифровыеПодписи", 	Ложь, "ИспользоватьОбменЭДМеждуОрганизациями", 			   	 Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЭлектронныеЦифровыеПодписи", 	Ложь, "ИспользоватьОбменЭДСБанками", 						 Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЭлектронныеЦифровыеПодписи", 	Ложь, "ИспользоватьОтложеннуюОтправкуЭлектронныхДокументов", Ложь);
	
	
	// Организации и финансы
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьГруппыФинансовогоУчета", 		   	 Ложь,   "ФормироватьВидыЗапасовПоГруппамФинансовогоУчета",  		Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"УчитыватьСебестоимостьТоваровПоВидамЗапасов", 	 Ложь,   "ФормироватьВидыЗапасовПоГруппамФинансовогоУчета",  		Ложь);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьСделкиСКлиентами", 		   	   	 Ложь,   "ФормироватьВидыЗапасовПоСделкам",  				   		Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"УчитыватьСебестоимостьТоваровПоВидамЗапасов", 	 Ложь,   "ФормироватьВидыЗапасовПоСделкам", 				   		Ложь);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"УчитыватьСебестоимостьТоваровПоВидамЗапасов", 	 Ложь,   "ФормироватьВидыЗапасовПоПодразделениямМенеджерам", 		Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"УчитыватьСебестоимостьТоваровПоВидамЗапасов", 	 Ложь,   "ФормироватьВидыЗапасовПоПоставщикам", 			   		Ложь);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьУчетПрочихДоходовРасходов", 	   	 Ложь,   "ФормироватьФинансовыйРезультат", 				   			Ложь);
		
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьПередачиТоваровМеждуОрганизациями", Ложь, 	 "ПеремещатьТоварыДругихОрганизаций", 						Ложь);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"КонтролироватьОстаткиТоваровОрганизаций",		 Ложь, 	 "КонтролироватьТоварыОрганизацийПриОтменеПриходов",		Ложь);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"КонтролироватьОстаткиТоваровОрганизаций", Ложь, "ВидКонтроляТоваровОрганизаций", Перечисления.ВидыКонтроляТоваровОрганизаций.ПустаяСсылка());
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"КонтролироватьОстаткиТоваровОрганизаций", Истина, "ВидКонтроляТоваровОрганизаций", Перечисления.ВидыКонтроляТоваровОрганизаций.ПоУмолчанию());

	// Склад и доставка
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьОрдерныеСклады", 		Истина, "ИспользоватьРаспоряженияНаИнвентаризацию", 		  Истина);	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьПеремещениеТоваров", 	Ложь, 	"ИспользоватьЗаказыНаПеремещение", 					  Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьПеремещениеТоваров", 	Ложь, 	"ИспользоватьСтатусыПеремещенийТоваров", 			  Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьПеремещениеТоваров", 	Ложь, 	"ПеремещатьТоварыДругихОрганизаций", 				  Ложь);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЗаказыНаПеремещение", 	Ложь, 	"ИспользоватьПеремещениеПоНесколькимЗаказам", 		  Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЗаказыНаПеремещение", 	Ложь, 	"ИспользоватьСтатусыЗаказовНаПеремещение", 			  Ложь);
	
	
	// Склад и доставка
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьКачествоТоваров", 	  Ложь, "ИспользоватьОбобщенныйУчетНекачественныхТоваров", Ложь);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьМногооборотнуюТару", Ложь, "ПредлагатьДополнитьДокументыМногооборотнойТарой", Ложь);
	
	
	// Маркетинг и CRM	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьМаркетинговыеМероприятия", 	 Ложь, "ИспользоватьСкидкиПоМаркетинговымМероприятиям", 			  Ложь);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьРучныеСкидкиВПродажах", 		 Ложь, "ИспользоватьОграниченияРучныхСкидокВПродажахПоСоглашениям",   Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьРучныеСкидкиВПродажах", 		 Ложь, "ИспользоватьОграниченияРучныхСкидокВПродажахПоПользователям", Ложь);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьАвтоматическиеСкидкиВПродажах", Ложь, "НазначатьСкидкиПоКнопкеРасчетВЧекеККМ", 					  Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьАвтоматическиеСкидкиВПродажах", Ложь, "ИспользоватьКартыЛояльности", 								  Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьАвтоматическиеСкидкиВПродажах", Ложь, "ИспользоватьСкидкиПоМаркетинговымМероприятиям", 			  Ложь);
	
	
	// Продажи
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеСоглашенийСКлиентами", Перечисления.ИспользованиеСоглашенийСКлиентами.ТиповыеИИндивидуальныеСоглашения,
	//		"ИспользоватьТиповыеИИндивидуальныеСоглашенияСКлиентами", Истина);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеСоглашенийСКлиентами", Перечисления.ИспользованиеСоглашенийСКлиентами.ТиповыеИИндивидуальныеСоглашения,
	//		"ИспользоватьТиповыеСоглашенияСКлиентами", 				  Истина);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеСоглашенийСКлиентами", Перечисления.ИспользованиеСоглашенийСКлиентами.ТиповыеИИндивидуальныеСоглашения,
	//		"ИспользоватьИндивидуальныеСоглашенияСКлиентами", 		  Истина);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеСоглашенийСКлиентами", Перечисления.ИспользованиеСоглашенийСКлиентами.ТиповыеИИндивидуальныеСоглашения,
	//		"ИспользоватьСоглашенияСКлиентами", 					  Истина);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеСоглашенийСКлиентами", Перечисления.ИспользованиеСоглашенийСКлиентами.ТолькоТиповыеСоглашения,
	//		"ИспользоватьТиповыеИИндивидуальныеСоглашенияСКлиентами", Ложь);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеСоглашенийСКлиентами", Перечисления.ИспользованиеСоглашенийСКлиентами.ТолькоТиповыеСоглашения,
	//		"ИспользоватьТиповыеСоглашенияСКлиентами", 				  Истина);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеСоглашенийСКлиентами", Перечисления.ИспользованиеСоглашенийСКлиентами.ТолькоТиповыеСоглашения,
	//		"ИспользоватьИндивидуальныеСоглашенияСКлиентами", 		  Ложь);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеСоглашенийСКлиентами", Перечисления.ИспользованиеСоглашенийСКлиентами.ТолькоТиповыеСоглашения,
	//		"ИспользоватьСоглашенияСКлиентами", 					  Истина);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеСоглашенийСКлиентами", Перечисления.ИспользованиеСоглашенийСКлиентами.ТолькоИндивидуальныеСоглашения,
	//		"ИспользоватьТиповыеИИндивидуальныеСоглашенияСКлиентами", Ложь);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеСоглашенийСКлиентами", Перечисления.ИспользованиеСоглашенийСКлиентами.ТолькоИндивидуальныеСоглашения,
	//		"ИспользоватьТиповыеСоглашенияСКлиентами", 				  Ложь);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеСоглашенийСКлиентами", Перечисления.ИспользованиеСоглашенийСКлиентами.ТолькоИндивидуальныеСоглашения,
	//		"ИспользоватьИндивидуальныеСоглашенияСКлиентами", 		  Истина);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеСоглашенийСКлиентами", Перечисления.ИспользованиеСоглашенийСКлиентами.ТолькоИндивидуальныеСоглашения,
	//		"ИспользоватьСоглашенияСКлиентами", 					  Истина);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеСоглашенийСКлиентами", Перечисления.ИспользованиеСоглашенийСКлиентами.НеИспользовать,
	//		"ИспользоватьТиповыеИИндивидуальныеСоглашенияСКлиентами", Ложь);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеСоглашенийСКлиентами", Перечисления.ИспользованиеСоглашенийСКлиентами.НеИспользовать,
	//		"ИспользоватьТиповыеСоглашенияСКлиентами", 				  Ложь);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеСоглашенийСКлиентами", Перечисления.ИспользованиеСоглашенийСКлиентами.НеИспользовать,
	//		"ИспользоватьИндивидуальныеСоглашенияСКлиентами", 		  Ложь);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеСоглашенийСКлиентами", Перечисления.ИспользованиеСоглашенийСКлиентами.НеИспользовать,
	//		"ИспользоватьСоглашенияСКлиентами", 					  Ложь);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеСоглашенийСКлиентами", Перечисления.ИспользованиеСоглашенийСКлиентами.НеИспользовать,
	//		"ИспользоватьСогласованиеСоглашенийСКлиентами", 		  Ложь);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЗаказыКлиентов", 					Ложь, 	"ИспользоватьАктыВыполненныхРаботПоНесколькимЗаказам", 	  	Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЗаказыКлиентов", 					Ложь, 	"ИспользоватьРеализациюПоНесколькимЗаказам", 				Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЗаказыКлиентов", 					Ложь, 	"ВедетсяРаботаЧерезТорговыхПредставителей", 				Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЗаказыКлиентов", 					Ложь, 	"ИспользоватьСогласованиеЗаказовКлиентов", 				  	Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЗаказыКлиентов", 					Ложь, 	"ИспользоватьСтатусыЗаказовКлиентов", 					  	Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЗаказыКлиентов", 					Ложь,	 "ИспользоватьПричиныОтменыЗаказовКлиентов", 				Ложь);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЗаявкиНаВозвратТоваровОтКлиентов", Ложь, 	"ИспользоватьСогласованиеЗаявокНаВозвратТоваровОтКлиентов", Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЗаявкиНаВозвратТоваровОтКлиентов", Ложь, 	"ИспользоватьСтатусыЗаявокНаВозврат", 					  	Ложь);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьСтатусыЗаказовКлиентов", 			Ложь, 	"ИспользоватьСогласованиеЗаказовКлиентов", 				  	Ложь);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьСтатусыЗаявокНаВозврат", 			Ложь, 	"ИспользоватьСогласованиеЗаявокНаВозвратТоваровОтКлиентов", Ложь);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьУправлениеСделками", 				Истина, "ИспользоватьКоммерческиеПредложенияКлиентам", 		  		Истина);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьКоммерческиеПредложенияКлиентам", 	Ложь, 	"ИспользоватьСогласованиеКоммерческихПредложений", 		  	Ложь);
	
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользоватьРозничныеПродажи", 				Ложь, "ОперацияПриЗакрытииКассовойСмены", Перечисления.ОперацииПриЗакрытииКассовойСмены.Нет);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьРозничныеПродажи", 				Ложь, "КоличествоДнейХраненияОтложенныхЧеков", 0);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьРозничныеПродажи", 				Ложь, "КоличествоДнейХраненияЗаархивированныхЧеков", 0);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьРозничныеПродажи", 				Ложь, "ИспользоватьОбменСПодключаемымОборудованиемOffline", Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьРозничныеПродажи", 				Ложь, "НазначатьСкидкиПоКнопкеРасчетВЧекеККМ", Ложь);
	
		
	// Настройки подключаемого оборудования
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьПодключаемоеОборудование", Ложь, "ИспользоватьОбменСПодключаемымОборудованиемOffline", Ложь);
	
	
	// Торговые представители
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ВедетсяРаботаЧерезТорговыхПредставителей", Ложь,
	//		"ИспользованиеЗаданийТорговымПредставителям", Перечисления.ИспользованиеЗаданийТорговымПредставителям.НеИспользуются);
	//
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеЗаданийТорговымПредставителям", Перечисления.ИспользованиеЗаданийТорговымПредставителям.НеИспользуются,
	//		"ДетализироватьЗаданияТорговымПредставителямПоНоменклатуре", Ложь);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеЗаданийТорговымПредставителям", Перечисления.ИспользованиеЗаданийТорговымПредставителям.НеИспользуются,
	//		"НеДетализироватьЗаданияТорговымПредставителямПоНоменклатуре", Ложь);
	//
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеЗаданийТорговымПредставителям", Перечисления.ИспользованиеЗаданийТорговымПредставителям.ИспользуютсяДляУправленияТорговымиПредставителями,
	//		"ИспользоватьЗаданияДляУправленияТорговымиПредставителями", Истина);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеЗаданийТорговымПредставителям", Перечисления.ИспользованиеЗаданийТорговымПредставителям.ИспользуютсяТорговымиПредставителямиДляПланирования,
	//		"ИспользоватьЗаданияДляУправленияТорговымиПредставителями", Ложь);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеЗаданийТорговымПредставителям", Перечисления.ИспользованиеЗаданийТорговымПредставителям.НеИспользуются,
	//		"ИспользоватьЗаданияДляУправленияТорговымиПредставителями", Ложь);
	//
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеЗаданийТорговымПредставителям", Перечисления.ИспользованиеЗаданийТорговымПредставителям.ИспользуютсяТорговымиПредставителямиДляПланирования,
	//		"ИспользоватьЗаданияТорговымПредставителямДляПланирования", Истина);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеЗаданийТорговымПредставителям", Перечисления.ИспользованиеЗаданийТорговымПредставителям.ИспользуютсяДляУправленияТорговымиПредставителями,
	//		"ИспользоватьЗаданияТорговымПредставителямДляПланирования", Ложь);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ИспользованиеЗаданийТорговымПредставителям", Перечисления.ИспользованиеЗаданийТорговымПредставителям.НеИспользуются,
	//		"ИспользоватьЗаданияТорговымПредставителямДляПланирования", Ложь);
	
	
	// Запасы и закупки
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЗаказыПоставщикам", 			 Ложь, "ИспользоватьСогласованиеЗаказовПоставщикам", 			Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЗаказыПоставщикам", 			 Ложь, "ИспользоватьПоступлениеПоНесколькимЗаказам", 			Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЗаказыПоставщикам", 			 Ложь, "НеЗакрыватьЗаказыПоставщикамБезПолногоПоступления", 	Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЗаказыПоставщикам", 			 Ложь, "НеЗакрыватьЗаказыПоставщикамБезПолнойОплаты", 			Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЗаказыПоставщикам", 			 Ложь, "ИспользоватьСтатусыЗаказовПоставщикам", 				Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЗаказыПоставщикам", 			 Ложь, "ИспользоватьПричиныОтменыЗаказовПоставщикам", 			Ложь);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЗаказыНаВнутреннееПотребление", Ложь, "ИспользоватьВнутреннееПотреблениеПоНесколькимЗаказам", 	Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЗаказыНаВнутреннееПотребление", Ложь, "ИспользоватьСтатусыЗаказовНаВнутреннееПотребление", 	Ложь);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьВнутреннееПотребление", 		 Ложь, "ИспользоватьЗаказыНаВнутреннееПотребление", 			Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьВнутреннееПотребление", 		 Ложь, "ИспользоватьВнутреннееПотреблениеПоНесколькимЗаказам", 	Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьВнутреннееПотребление", 		 Ложь, "ИспользоватьСтатусыВнутреннихПотребленийТоваров", 		Ложь);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьСборкуРазборку", 				 Ложь, "ИспользоватьЗаказыНаСборку", 							Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьСборкуРазборку", 				 Ложь, "ИспользоватьСтатусыСборокТоваров", 						Ложь);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьЗаказыНаСборку", 				 Ложь, "ИспользоватьСтатусыЗаказовНаСборку",					Ложь);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьСтатусыЗаказовПоставщикам", 	 Ложь, "ИспользоватьСогласованиеЗаказовПоставщикам", 			Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьСтатусыЗаказовПоставщикам", 	 Ложь, "НеЗакрыватьЗаказыПоставщикамБезПолногоПоступления", 	Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьСтатусыЗаказовПоставщикам", 	 Ложь, "НеЗакрыватьЗаказыПоставщикамБезПолнойОплаты", 			Ложь);

	
	// Интеграция с 1С:Документооборот
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьИнтеграциюС1СДокументооборот", 	  Ложь,   "ИспользоватьСогласованиеЧерез1СДокументооборот", 					Ложь);
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьСогласованиеЧерез1СДокументооборот", Истина, "ИспользоватьВнутреннееСогласованиеЗаявокНаВозвратТоваровОтКлиентов", Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьСогласованиеЧерез1СДокументооборот", Истина, "ИспользоватьВнутреннееСогласованиеЗаказовКлиентов", 					Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьСогласованиеЧерез1СДокументооборот", Истина, "ИспользоватьВнутреннееСогласованиеКоммерческихПредложений", 			Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьСогласованиеЧерез1СДокументооборот", Истина, "ИспользоватьВнутреннееСогласованиеСоглашенийСКлиентами", 			Ложь);
	
	
	// Печатные формы, отчеты и обработки
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ОтображениеСкидокВПечатныхФормахДокументовПродажи", Перечисления.ВариантыВыводаСкидокВПечатныхФормах.ВыводитьСкидки,
	//		"ВыбиратьВариантВыводаСкидокПриПечатиДокументовПродажи", Ложь);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ОтображениеСкидокВПечатныхФормахДокументовПродажи", Перечисления.ВариантыВыводаСкидокВПечатныхФормах.НеВыводитьСкидки,
	//		"ВыбиратьВариантВыводаСкидокПриПечатиДокументовПродажи", Ложь);
	//ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
	//	"ОтображениеСкидокВПечатныхФормахДокументовПродажи", Перечисления.ВариантыВыводаСкидокВПечатныхФормах.ВыбиратьПриПечати,
	//		"ВыбиратьВариантВыводаСкидокПриПечатиДокументовПродажи", Истина);
	
	// Производство
	ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		"ИспользоватьПроизводство", 					Ложь, "ИспользоватьПроизводствоИзДавальческогоСырья", 	Ложь);
	
	
	// Инвертируемые константы (имеющие "двойника" с противоположным значением)
	ДобавитьСтрокуИнвертируемыхКонстант(Результат, "БазоваяВерсия");
	ДобавитьСтрокуИнвертируемыхКонстант(Результат, "БазоваяВерсия", "ИспользоватьУправлениеДоступом");
	ДобавитьСтрокуИнвертируемыхКонстант(Результат, "ИспользоватьБизнесРегионы");
	ДобавитьСтрокуИнвертируемыхКонстант(Результат, "ИспользоватьНесколькоВалют");
	ДобавитьСтрокуИнвертируемыхКонстант(Результат, "ИспользоватьПланированиеДенежныхСредств");
	ДобавитьСтрокуИнвертируемыхКонстант(Результат, "ИспользоватьРаспоряженияНаИнвентаризацию");
	ДобавитьСтрокуИнвертируемыхКонстант(Результат, "ВыбиратьВариантВыводаСкидокПриПечатиДокументовПродажи");
	ДобавитьСтрокуИнвертируемыхКонстант(Результат, "ФормироватьФинансовыйРезультат");
	
	
	// Синхронные константы (имеющие "двойника" с идентичным значением)
	ДобавитьСтрокуСинхронныхКонстант(Результат,
		"ИспользоватьХарактеристикиНоменклатуры", "ДобавлятьИндивидуальныеХарактеристикиПриСозданииНоменклатуры");
	ДобавитьСтрокуСинхронныхКонстант(Результат,
		"ИспользоватьУпаковкиНоменклатуры", 	  "ДобавлятьИндивидуальныеУпаковкиПриСозданииНоменклатуры");
	
	Возврат Результат;
	
КонецФункции

// Процедура - Добавить строку таблицы зависимости констант
//
// Параметры:
//  ТаблицаКонстант					 - 	 - 
//  ИмяРодительскойКонстанты		 - 	 - 
//  ЗначениеРодительскойКонстанты	 - 	 - 
//  ИмяПодчиненнойКонстанты			 - 	 - 
//  ЗначениеПодчиненнойКонстанты	 - 	 - 
//
Процедура ДобавитьСтрокуТаблицыЗависимостиКонстант(ТаблицаКонстант,
			ИмяРодительскойКонстанты, ЗначениеРодительскойКонстанты, ИмяПодчиненнойКонстанты, ЗначениеПодчиненнойКонстанты)
	
	НоваяСтрока = ТаблицаКонстант.Добавить();
	НоваяСтрока.ИмяРодительскойКонстанты 	  = ИмяРодительскойКонстанты;
	НоваяСтрока.ЗначениеРодительскойКонстанты = ЗначениеРодительскойКонстанты;
	НоваяСтрока.ИмяПодчиненнойКонстанты 	  = ИмяПодчиненнойКонстанты;
	НоваяСтрока.ЗначениеПодчиненнойКонстанты  = ЗначениеПодчиненнойКонстанты;
	
КонецПроцедуры

// Процедура - Добавить строку инвертируемых констант
//
// Параметры:
//  ТаблицаКонстант			 - 	 - 
//  ИмяРодительскойКонстанты - 	 - 
//  ИмяПодчиненнойКонстанты	 - 	 - 
//
Процедура ДобавитьСтрокуИнвертируемыхКонстант(ТаблицаКонстант,
			ИмяРодительскойКонстанты, ИмяПодчиненнойКонстанты = "")
	
	Если ИмяПодчиненнойКонстанты = "" Тогда
		ИмяПодчиненнойКонстанты = "Не" + ИмяРодительскойКонстанты;
	КонецЕсли;
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(ТаблицаКонстант,
		ИмяРодительскойКонстанты, Ложь,   ИмяПодчиненнойКонстанты, Истина);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(ТаблицаКонстант,
		ИмяРодительскойКонстанты, Истина, ИмяПодчиненнойКонстанты, Ложь);
	
КонецПроцедуры

// Процедура - Добавить строку синхронных констант
//
// Параметры:
//  ТаблицаКонстант			 - 	 - 
//  ИмяРодительскойКонстанты - 	 - 
//  ИмяПодчиненнойКонстанты	 - 	 - 
//
Процедура ДобавитьСтрокуСинхронныхКонстант(ТаблицаКонстант,
			ИмяРодительскойКонстанты, ИмяПодчиненнойКонстанты)
	
	ДобавитьСтрокуТаблицыЗависимостиКонстант(ТаблицаКонстант,
		ИмяРодительскойКонстанты, Ложь,   ИмяПодчиненнойКонстанты, Ложь);
	ДобавитьСтрокуТаблицыЗависимостиКонстант(ТаблицаКонстант,
		ИмяРодительскойКонстанты, Истина, ИмяПодчиненнойКонстанты, Истина);
	
КонецПроцедуры

// Возвращает признак наличия у константы "подчиненных" констант.
//
//	Параметры:
//		ИмяРодительскойКонстанты 	  - Строка - имя константы как оно задано в конфигураторе
//		ЗначениеРодительскойКонстанты - Произвольный - значение константы
//
//	Возвращаемое значение:
//		Булево - если Истина, то у константы есть "подчиненные" ей константы.
//
Функция ЕстьПодчиненныеКонстанты(ИмяРодительскойКонстанты, ЗначениеРодительскойКонстанты) Экспорт
	
	ТаблицаКонстант = ПолучитьТаблицуЗависимостиКонстант();
	
	ПодчиненныеКонстанты = ТаблицаКонстант.НайтиСтроки(
		Новый Структура(
			"ИмяРодительскойКонстанты, ЗначениеРодительскойКонстанты",
			ИмяРодительскойКонстанты, ЗначениеРодительскойКонстанты));
	
	Возврат ПодчиненныеКонстанты.Количество() > 0;
	
КонецФункции

// Возвращает структуру, описывающую "подчиненные" константы для указанной "родительской" константы.
//
//	Параметры:
//		ИмяРодительскойКонстанты - Структура - имя родительской константы
//
//	Возвращаемое значение:
//		Структура
//			Ключ - имя подчиненной константы
//
Функция ПолучитьСтруктуруПодчиненныхКонстант(ИмяРодительскойКонстанты) Экспорт
	
	Результат 		= Новый Структура;
	ТаблицаКонстант = ПолучитьТаблицуЗависимостиКонстант();
	
	ПодчиненныеКонстанты = ТаблицаКонстант.НайтиСтроки(
		Новый Структура("ИмяРодительскойКонстанты", ИмяРодительскойКонстанты));
	
	Для Каждого СтрокаПодчиненного Из ПодчиненныеКонстанты Цикл
		
		Если Результат.Свойство(СтрокаПодчиненного.ИмяПодчиненнойКонстанты) Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Вставить(СтрокаПодчиненного.ИмяПодчиненнойКонстанты);
		
		ПодчиненныеПодчиненных = ПолучитьСтруктуруПодчиненныхКонстант(СтрокаПодчиненного.ИмяПодчиненнойКонстанты);
		
		Для Каждого ПодчиненныйПодчиненного Из ПодчиненныеПодчиненных Цикл
			Результат.Вставить(ПодчиненныйПодчиненного.Ключ);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Доступность объектов метаданных по функциональным опциям.
Функция ДоступностьОбъектовПоОпциям() Экспорт
	
	Параметры = ОбщегоНазначенияПовтИсп.ОпцииИнтерфейса();
	
	Если ТипЗнч(Параметры) = Тип("ФиксированнаяСтруктура") Тогда
		Параметры = Новый Структура(Параметры);
	КонецЕсли;
	
	ДоступностьОбъектов = Новый Соответствие;
	
	Для Каждого ФункциональнаяОпция Из Метаданные.ФункциональныеОпции Цикл
		
		Значение = -1;
		
		Для Каждого Элемент Из ФункциональнаяОпция.Состав Цикл
			
			Если Элемент.Объект = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если Значение = -1 Тогда
				Значение = ПолучитьФункциональнуюОпцию(ФункциональнаяОпция.Имя, Параметры);
			КонецЕсли;
			
			ПолноеИмя = Элемент.Объект.ПолноеИмя();
			
			Если Значение = Истина Тогда
				ДоступностьОбъектов.Вставить(ПолноеИмя, Истина);
			Иначе
				Если ДоступностьОбъектов[ПолноеИмя] = Неопределено Тогда
					ДоступностьОбъектов.Вставить(ПолноеИмя, Ложь);
				КонецЕсли;	
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ДоступностьОбъектов;
	
КонецФункции

// Функция определяет пол клиента по ФИО
//
Функция ОпределитьПолКлиента(Фамилия, Имя, Отчество) Экспорт
	
	Фамилия = СокрЛП(Фамилия);
	Имя = СокрЛП(Имя);
	Отчество = СокрЛП(Отчество);
	Если Отчество <> "" Тогда
		Окончание_1_буква = НРег(Сред(Отчество, СтрДлина(Отчество)));
		Если Окончание_1_буква = "ч" ИЛИ Окончание_1_буква = "в" Тогда
			Возврат "Мужской";
		ИначеЕсли Окончание_1_буква = "а" Тогда
			Возврат "Женский";
		КонецЕсли;
	КонецЕсли;
	
	Окончание_1_буква = НРег(Сред(Фамилия, СтрДлина(Фамилия)));
	Окончание_2_буквы = НРег(Сред(Фамилия, СтрДлина(Фамилия) - 1));
	Окончание_3_буквы = НРег(Сред(Фамилия, СтрДлина(Фамилия) - 2));
	окончанияМужскихФамилий=",ов,ев,ий,ин,";
	окончанияЖенскихФамилий=",ова,ева,ина,ая,";
	Если Найти(окончанияМужскихФамилий, "," + Окончание_2_буквы + ",") > 0 Тогда
		Возврат "Мужской";
	ИначеЕсли Найти(окончанияЖенскихФамилий, "," + Окончание_2_буквы + ",") > 0 
		ИЛИ Найти(окончанияЖенскихФамилий, "," + Окончание_3_буквы + ",") > 0 
		Тогда
		Возврат "Женский";
	КонецЕсли;
	
	Если Имя <> "" Тогда
		Окончание_1_буква = НРег(Сред(Имя, СтрДлина(Имя)));
		Если Окончание_1_буква = "а" ИЛИ Окончание_1_буква = "я"  ИЛИ Окончание_1_буква = "е" Тогда
			Возврат "Женский";
		Иначе
			Возврат "Мужской";
		КонецЕсли;
	КонецЕсли;
	
	
	Возврат "";
КонецФункции

// Функция возвращает истину, если данная конфигурация является полнофункциональной версией
// (просто Стома или Стома КОРП)
//
//  Функция не применяется для реального ограничения функционала, а имеет вспомогательное значение:
//  убирает ненужные значения из списков выбора и т.д.
//
Функция ЭтоВерсияКОРП() Экспорт
	
	ИмяКонфигурации = Метаданные.Имя;
	
	Позиция_ = Найти(ИмяКонфигурации, "_");
	
	Если Позиция_ = 0 Тогда
		Возврат Истина; // Это просто "Стома"
	ИначеЕсли ВРег(Прав(ИмяКонфигурации, СтрДлина(ИмяКонфигурации) - Позиция_)) = "КОРП" Тогда
		Возврат Истина;
	ИначеЕсли ВРег(Прав(ИмяКонфигурации, СтрДлина(ИмяКонфигурации) - Позиция_)) = "ПРОФ" Тогда
		Возврат Ложь;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции 

// Функция - Это сеанс регламентного задания
// 
// Возвращаемое значение:
//   - 
//
Функция ЭтоСеансРегламентногоЗадания() Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();
	
	Возврат ФоновоеЗадание <> Неопределено И ФоновоеЗадание.РегламентноеЗадание <> Неопределено;
	
КонецФункции

// Функция - Получить служебного сотрудника
//
// Параметры:
//  Наименование - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСлужебногоСотрудника(Наименование = Неопределено) Экспорт
	
	Возврат Справочники.Сотрудники.ПолучитьСлужебногоСотрудника(Наименование);
	
КонецФункции

// Функция - Получить описания триггеров
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьОписанияТриггеров() Экспорт
	
	Возврат Справочники.ТриггерныеСобытия.ПолучитьОписанияТриггеров();
	
КонецФункции

// Функция - Получить таблицу всех вариантов условий триггерных событий
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий() Экспорт
	
	Возврат Справочники.ТриггерныеСобытия.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	
КонецФункции

// Функция - Получить таблицу параметров всех подставляемых реквизитов
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТаблицуПараметровВсехПодставляемыхРеквизитов() Экспорт
	
	Возврат Справочники.ШаблоныСообщений.ПолучитьТаблицуПараметровВсехПодставляемыхРеквизитов();
	
КонецФункции

// Функция - Получить период повтора регистрации триггерных событий в течение дня
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПериодПовтораРегистрацииТриггерныхСобытийВТечениеДня() Экспорт
	
	Возврат РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.РегистрацияТриггерныхСобытий).Расписание.ПериодПовтораВТечениеДня;
	
КонецФункции

// Функция - Режим тестирования ККТ
// 
// Возвращаемое значение:
//   - 
//
Функция РежимТестированияККТ() Экспорт
	
	Возврат Константы.РежимТестированияККТ.Получить();
	
КонецФункции

#КонецОбласти

