
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаКоманды".
//
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если УправлениеПечатьюКлиентСтоматология.ПроверитьДокументыПроведены(ПараметрКоманды) Тогда
	
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Документ.ЗаказПоставщику",
			"ЗаказПоставщику",
			ПараметрКоманды,
			Неопределено,
			Новый Структура("Тип", "ЗаказПоставщику")
		);
	
	КонецЕсли;
	
КонецПроцедуры // ОбработкаКоманды()

#КонецОбласти