
#Область ОбработчикиСобытийФормы

// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура Удалить промокоды.
//
Процедура УдалитьПромокод(Команда)
	
	Промокод = Элементы.Список.ТекущаяСтрока;
	ПометкаУдаленияУстановлена = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Промокод, "ПометкаУдаления");  
	Реферальный				   = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Промокод, "Реферальный"); 
	
	Если Реферальный = Истина Тогда	
		
		Если ПометкаУдаленияУстановлена = Ложь Тогда
			
			ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьПромокодЗавершение", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, "Реферальные коды промокода будут удалены. Продолжить удаление?", РежимДиалогаВопрос.ДаНет,,, "Предупреждение");
		Иначе
			ОписаниеОповещения = Новый ОписаниеОповещения("СнятьПометкуУдаленияЗавершение", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, "Снять пометку удаления? Реферальные коды будут сгенерированы заново.", РежимДиалогаВопрос.ДаНет,,, "Предупреждение");
			
		КонецЕсли;
		
	Иначе   
		
		Если ПометкаУдаленияУстановлена = Ложь Тогда
			
			ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьПромокодЗавершение", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, "Установить пометку удаления?", РежимДиалогаВопрос.ДаНет,,, "Предупреждение");
		Иначе
			ОписаниеОповещения = Новый ОписаниеОповещения("СнятьПометкуУдаленияЗавершение", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, "Снять пометку удаления?", РежимДиалогаВопрос.ДаНет,,, "Предупреждение");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры    

&НаКлиенте
// Процедура - Удалить промокод на сервере
//
Процедура УдалитьПромокодЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда				
		
		Если Реферальный = Истина Тогда
			УдалитьПромокодНаСервере(Промокод);		
		Иначе
			ЗаписатьПромокодНаСервере(Промокод, ПометкаУдаленияУстановлена);	
		КонецЕсли; 
		
		Элементы.Список.Обновить(); 
		ПометкаУдаленияУстановлена = Истина;		
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
// Процедура - Удалить промокод на сервере
//
Процедура СнятьПометкуУдаленияЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда                      
		
		ЗаписатьПромокодНаСервере(Промокод, ПометкаУдаленияУстановлена);                     		
		
		Элементы.Список.Обновить(); 
		ПометкаУдаленияУстановлена = Ложь;		
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
// Процедура Удалить промокод.
//
Процедура УдалитьПромокодНаСервере(Промокод)

	Справочники.Промокоды.УдалитьПромокодНаСервере(Промокод);

КонецПроцедуры    

&НаСервереБезКонтекста
// Процедура Записать промокод.
//
Процедура ЗаписатьПромокодНаСервере(Промокод, ПометкаУдаленияУстановлена)    
	
	Справочники.Промокоды.ЗаписатьПромокодНаСервере(Промокод, ПометкаУдаленияУстановлена);    
	
КонецПроцедуры  

#КонецОбласти
