
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата"		   , ТекущаяДата());
	ЭтотОбъект.Список.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиница" , ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);	
	
	ВПродажеОтбор = "Все"; 
	ЭтотОбъект.ВключенОтборПоШтрихКоду = Ложь;
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(Метаданные.Справочники.Номенклатура, НастройкиЗагрузкиДанных, ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника

КонецПроцедуры

&НаКлиенте
// Процедура - Обработка оповещения.
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьПослеДобавления" Тогда		
		Элементы.Список.Обновить();
	КонецЕсли;
	
	// ВнешнееОборудование
	Если Источник = "ВнешнееОборудование"
		И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			// Преобразуем предварительно к ожидаемому формату
			Данные = Новый Массив();
			Если Параметр[1] = Неопределено Тогда
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[0], 1)); // Достаем штрихкод из основных данных
			Иначе
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[1][1], 1)); // Достаем штрихкод из дополнительных данных
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Данные) Тогда
				ПоискПоШтрихкодуЗавершение(Данные[0].Штрихкод);	
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиРеквизитовШапки

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ВПродажеОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ВПродаже", ?(ВПродажеОтбор = "ВПродаже", Истина, Ложь), ВПродажеОтбор <> "Все");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Подобрать.
//
Процедура Подобрать(Команда)
	
	ОткрытьФорму("Справочник.КлассификаторНоменклатурыМедицинскихУслуг.Форма.ФормаПодбора",, Этаформа);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ИзменитьВыделенные".
//
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Поиск по штрих коду.
//
Процедура ПоискПоШтрихКоду(Команда)
	
	// Если была нажата кнопка поиска по штрих коду.
	Если ЭтотОбъект.ВключенОтборПоШтрихКоду Тогда	 	
		СброситьОтбор();			
	Иначе
		
		ТекШтрихкод = "";
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
		
		ПоказатьВводЗначения(ОписаниеОповещения, ТекШтрихкод, НСтр("ru = 'Введите штрих-код или номер серии'"));
		
	КонецЕсли;  
	
КонецПроцедуры 

&НаКлиенте
// Процедура - Загрузка данных из внешнего источника.
//
Процедура ЗагрузкаДанныхИзВнешнегоИсточника(Команда)
	
	ПоказатьПомощникЗагрузкиДанныхИзВнешнегоИсточника();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура - Сбросить отбор.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СброситьОтбор()
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ЭтаФорма.Список, "Ссылка");
	
	Элементы.Список.Отображение 			   = ОтображениеТаблицы.ИерархическийСписок;
	Элементы.ФормаПоискПоШтрихКоду.Отображение = ОтображениеКнопки.Картинка;
	Команды.ПоискПоШтрихКоду.Подсказка         = "Поиск по штрих-коду";
	
	ЭтотОбъект.ВключенОтборПоШтрихКоду = Ложь;
	
КонецПроцедуры

&НаСервере
// Процедура, ПоискПоШтрихкодуЗавершение.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Процедура ПоискПоШтрихкодуЗавершение(ТекШтрихкод, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ТекШтрихкод) Тогда
		
		НайденнаяНоменклатура = ОбщегоНазначения.ВернутьНоменклатуруПоШтрихкоду(ТекШтрихкод);
		
		Если ЗначениеЗаполнено(НайденнаяНоменклатура) Тогда
			
			ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ЭтаФорма.Список, "Ссылка", НайденнаяНоменклатура.Объект, Истина);
			
			Элементы.Список.Отображение 			   = ОтображениеТаблицы.Список;
			Элементы.ФормаПоискПоШтрихКоду.Отображение = ОтображениеКнопки.КартинкаИТекст;
			Команды.ПоискПоШтрихКоду.Подсказка         = "Отменить отбор по штрих-коду";
			
			ЭтотОбъект.ВключенОтборПоШтрихКоду = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника

&НаКлиенте
// Процедура - Показать помощник загрузки данных из внешнего источника.
//
Процедура ПоказатьПомощникЗагрузкиДанныхИзВнешнегоИсточника()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
	
	НастройкиЗагрузкиДанных.Вставить("ИмяМакетаСШаблоном", "ЗагрузкаИзФайла");
	НастройкиЗагрузкиДанных.Вставить("ОписаниеСтрокиВыбора", Новый Структура("ПолноеИмяОбъектаМетаданных, Тип", "Номенклатура", "ПрикладнаяЗагрузка"));
	
	ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Загрузка данных из внешнего источника обработка результата.
//
Процедура ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		
		Если РезультатЗагрузки.ОписаниеДействия = "ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника" Тогда
		
			ЗагрузкаДанныхИзВнешнегоИсточника.ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных.ИмяФормыЗагрузкиДанныхИзВнешнихИсточников);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
			ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
			
		ИначеЕсли РезультатЗагрузки.ОписаниеДействия = "ОбработатьПодготовленныеДанные" Тогда
			
			ДлительнаяОперация = ОбработатьПодготовленныеДанные(РезультатЗагрузки);
			ПроверитьНеобходимостьПодключенияОбработчикаОжидания(ДлительнаяОперация);
			
		КонецЕсли;
		
	ИначеЕсли РезультатЗагрузки = Неопределено Тогда
		
		//Элементы["СписокЗапасы"].Обновить();
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - Обработать подготовленные данные.
//
Функция ОбработатьПодготовленныеДанные(РезультатЗагрузки)
	
	ПараметрыВызоваСервера = Новый Структура;
	ПараметрыВызоваСервера.Вставить("НастройкиЗагрузкиДанных", РезультатЗагрузки.НастройкиЗагрузкиДанных);
	ПараметрыВызоваСервера.Вставить("ТаблицаСопоставленияДанных", ДанныеФормыВЗначение(РезультатЗагрузки.ТаблицаСопоставленияДанных, Тип("ТаблицаЗначений")));
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Подсистема ЗагрузкаДанныхИзВнешнегоИсточника: Выполнение серверного метода загрузки результата'");
	ПараметрыВыполнения.ЗапуститьНеВФоне    = Ложь;
	ПараметрыВыполнения.ЗапуститьВФоне      = Истина;	
	
	Если РезультатЗагрузки.НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "РегистрСведений.НормыСписанияМатериалов" Тогда
		ИмяМетода = "РегистрыСведений.НормыСписанияМатериалов.ОбработатьПодготовленныеДанные";	
	ИначеЕсли РезультатЗагрузки.НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "РегистрСведений.КритическиеОстатки" Тогда
		ИмяМетода = "РегистрыСведений.КритическиеОстатки.ОбработатьПодготовленныеДанные";	
	Иначе
		ИмяМетода = "Справочники.Номенклатура.ОбработатьПодготовленныеДанные";
	КонецЕсли;
	
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяМетода, ПараметрыВызоваСервера, ПараметрыВыполнения);
	
КонецФункции

#Область СлужебныеОбработчики

&НаКлиенте
// Процедура - После выполнения фонового задания.
//
Процедура ПослеВыполненияФоновогоЗадания(Прогресс, ДополнительныеПараметры) Экспорт
	
	//Элементы[ТекущаяСтраницаНоменклатуры].Обновить();
	Элементы.Список.Обновить();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) И ДополнительныеПараметры.Свойство("ФиксированныйШаблон") Тогда
		Оповестить("Запись_КатегорииНоменклатуры");
	КонецЕсли;
	
	ПоказатьПредупреждение(,Нстр("ru ='Загрузка данных завершена.'"));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Проверить необходимость подключения обработчика ожидания.
//
Процедура ПроверитьНеобходимостьПодключенияОбработчикаОжидания(ДлительнаяОперация, СтруктураПараметров = Неопределено)
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ПослеВыполненияФоновогоЗадания(ДлительнаяОперация, СтруктураПараметров);
		
	Иначе
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеВыполненияФоновогоЗадания", ЭтотОбъект);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Идет загрузка данных.'");
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника

#КонецОбласти
