////////////////////////////////////////////////////////////////////////////////
// СЕКЦИЯ ЭКСПОРТНЫХ ФУНКЦИЙ

#Область СлужебныеПроцедурыИФункции

// Процедура, выполняет обновление агрегатов.
//  Параметры:
//   Нет; 
//
Процедура ОбновлениеАгрегатов() Экспорт
	
	Для Каждого ТекущийРегистр Из Метаданные.РегистрыНакопления Цикл
		Если ТекущийРегистр.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Обороты Тогда
			Если РегистрыНакопления[ТекущийРегистр.Имя].ПолучитьРежимАгрегатов()
			  И РегистрыНакопления[ТекущийРегистр.Имя].ПолучитьИспользованиеАгрегатов() Тогда
			  	РегистрыНакопления[ТекущийРегистр.Имя].ОбновитьАгрегаты();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура, выполняет перестроение агрегатов.
//  Параметры:
//   Нет; 
//
Процедура ПерестроениеАгрегатов() Экспорт
	
	Для Каждого ТекущийРегистр Из Метаданные.РегистрыНакопления Цикл
		Если ТекущийРегистр.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Обороты Тогда
			Если РегистрыНакопления[ТекущийРегистр.Имя].ПолучитьРежимАгрегатов()
			  И РегистрыНакопления[ТекущийРегистр.Имя].ПолучитьИспользованиеАгрегатов() Тогда
			  	РегистрыНакопления[ТекущийРегистр.Имя].ПерестроитьИспользованиеАгрегатов();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура, выполняет установку периода рассчитанных итогов.
//  Параметры:
//   Нет; 
//
Процедура УстановкаПериодаРасчитанныхИтогов() Экспорт
	
	НаДату = НачалоМесяца(ТекущаяДата())-1;
	ПересчетРегистров(РегистрыНакопления, НаДату, Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки);
	ПересчетРегистров(РегистрыБухгалтерии, НаДату);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЕКЦИЯ СЛУЖЕБНЫХ ФУНКЦИЙ

// Процедура, выполняет пересчет регистров накопления.
//  Параметры:
//   Нет; 
//
Процедура ПересчетРегистров(МенеджерРегистров, НаДату, ОграничениеПоВидуРегистра = Неопределено)
	
	Для Каждого МенеджерРегистра ИЗ МенеджерРегистров Цикл
		
		МетаданныеРегистра = Метаданные.НайтиПоТипу(ТипЗнч(МенеджерРегистра));
		
		Если ОграничениеПоВидуРегистра <> Неопределено И МетаданныеРегистра.ВидРегистра <> ОграничениеПоВидуРегистра Тогда
			Продолжить;
		КонецЕсли;
		
		Если МенеджерРегистра.ПолучитьПериодРассчитанныхИтогов() < НаДату Тогда
			МенеджерРегистра.УстановитьПериодРассчитанныхИтогов(НаДату);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти