
#Область ОбработчикиСобытий

&НаКлиенте
// Процедура - Обработка команды
//
// Параметры:
//  ПараметрКоманды				 - 	 - 
//  ПараметрыВыполненияКоманды	 - 	 - 
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("Сотрудник", ПараметрКоманды);
	ОткрытьФорму("РегистрСведений.СотрудникиСегмента.Форма.ФормаСпискаПоСотруднику", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти