
#Область СлужебныйПрограммныйИнтерфейс

// Функция - Получить доступные клиники для работы сотрудника
//
// Параметры:
//  Сотрудник					 - 	 - 
//  ТипВозвращаемыхДанных		 - 	 - 
//  ВыбраннаяСтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДоступныеКлиникиДляРаботыСотрудника(Сотрудник) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
		МассивТиповКлиник 	= Новый Массив;
		МассивТиповКлиник.Добавить(Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));
		
		ТаблицаКлиник = Новый ТаблицаЗначений;
		ТаблицаКлиник.Колонки.Добавить("СтруктурнаяЕдиница"	, Новый ОписаниеТипов(МассивТиповКлиник));
		ТаблицаКлиник.Колонки.Добавить("Представление"		, Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
		
		ТекущаяКлиника 				= ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
		ТекущаяКлиникаПредставление = Строка(ТекущаяКлиника);
		ЗаполнитьЗначенияСвойств(ТаблицаКлиник.Добавить(), Новый Структура("СтруктурнаяЕдиница, Представление", ТекущаяКлиника, ТекущаяКлиникаПредставление));
		
		Возврат ТаблицаКлиник;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник"	, Сотрудник);
	Запрос.УстановитьПараметр("ТекущаяДата"	, ТекущаяДатаСеанса());		
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница) КАК Представление
	|ИЗ
	|	Справочник.Сотрудники.ДоступныеСтруктурныеЕдиницы КАК СотрудникиДоступныеСтруктурныеЕдиницы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСотрудников КАК Сотрудники
	|		ПО СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница = Сотрудники.СтруктурнаяЕдиница
	|			И СотрудникиДоступныеСтруктурныеЕдиницы.Ссылка = Сотрудники.Сотрудник
	|ГДЕ
	|	СотрудникиДоступныеСтруктурныеЕдиницы.Ссылка = &Сотрудник
	|	И ВЫБОР
	|			КОГДА ЕСТЬNULL(Сотрудники.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Сотрудники.ДатаУвольнения > &ТекущаяДата
	|		КОНЕЦ
	|	И СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница.ПометкаУдаления = ЛОЖЬ
	|	И СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница.ЭтоГруппа = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница.Наименование";
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция проверяет существование расширения
//
Функция ИспользуетсяРасширение(ИмяРасширения) Экспорт
    
    // Получить само расширение
	Если Не ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
    МассивРасширений = РасширенияКонфигурации.Получить();
	НужноеРасширение = Новый Массив;  
	
	Для Каждого ЭлементМ Из МассивРасширений Цикл
		Если СтрЧислоВхождений(ЭлементМ.Имя, ИмяРасширения) > 0 Тогда
			НужноеРасширение.Добавить(ЭлементМ);
		КонецЕсли;
	КонецЦикла;
	
	Если НужноеРасширение.Количество() <> 1 Тогда
        Возврат Ложь;
    КонецЕсли;
    Расширение = НужноеРасширение[0];
    
    // Проверить активность

    Если НЕ Расширение.Активно Тогда
        Возврат Ложь;
    КонецЕсли;
		
	// Проверка возможности применения.
	// Добавлена вместо Расширение.ПроверитьВозможностьПрименения(), т.к. работает быстрее
	Если НЕ Расширение.ОбластьДействия = ОбластьДействияРасширенияКонфигурации.ИнформационнаяБаза Тогда	
		Возврат Ложь;       
	КонецЕсли; 
    
    Возврат Истина;
	
КонецФункции

#КонецОбласти

