
#Область СлужебныеПроцедурыИФункции

// Процедура выполняет установку последнего мастера, обслуживавщего клиента
//
Процедура УстановитьПредпочитаемогоМастера(мПараметры) Экспорт
	
	Если ТипЗнч(мПараметры.Сотрудники) = Тип("ТаблицаЗначений") Тогда
		Для Каждого СтрокаСотрудник из мПараметры.Сотрудники Цикл
			НаборЗаписей = РегистрыСведений.ПредпочтенияКлиентовПоМастерам.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Контрагент.Установить(СтрокаСотрудник.Контрагент);
			НаборЗаписей.Отбор.Должность.Установить(СтрокаСотрудник.Сотрудник.Должность);
			НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(мПараметры.СтруктурнаяЕдиница);
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Контрагент = СтрокаСотрудник.Контрагент;
			НоваяЗапись.Должность  = СтрокаСотрудник.Сотрудник.Должность;
			НоваяЗапись.Сотрудник  = СтрокаСотрудник.Сотрудник;
			НоваяЗапись.СтруктурнаяЕдиница = мПараметры.СтруктурнаяЕдиница; 
			НаборЗаписей.Записать(Истина);
		КонецЦикла;
	Иначе
		Для Каждого СтрокаСотрудник из мПараметры.Сотрудники Цикл
			НаборЗаписей = РегистрыСведений.ПредпочтенияКлиентовПоМастерам.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Контрагент.Установить(мПараметры.Контрагент);
			НаборЗаписей.Отбор.Должность.Установить(СтрокаСотрудник.Должность);
			НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(мПараметры.СтруктурнаяЕдиница);
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Контрагент = мПараметры.Контрагент;
			НоваяЗапись.Должность  = СтрокаСотрудник.Должность;
			НоваяЗапись.Сотрудник  = СтрокаСотрудник;
			НоваяЗапись.СтруктурнаяЕдиница = мПараметры.СтруктурнаяЕдиница; 
			НаборЗаписей.Записать(Истина);
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти