
#Область СлужебныеПроцедурыИФункции

// Функция вернет отработанное вермя сотрудников за указанный период
Функция ПолучитьОтработанноеВремяСотрудников(СтруктурнаяЕдиница, НачалоПериода, КонецПериода) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РабочееВремяСотрудниковОбороты.Сотрудник КАК Сотрудник,
	|	СУММА(РабочееВремяСотрудниковОбороты.ЧасовОборот) КАК Время
	|ИЗ
	|	РегистрНакопления.РабочееВремяСотрудников.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Авто,
	|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И Сотрудник В
	|					(ВЫБРАТЬ
	|						ПродажиОбороты.Сотрудник
	|					ИЗ
	|						РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, , ДокументПродажи ССЫЛКА Документ.Прием) КАК ПродажиОбороты
	|					ГДЕ
	|						ПродажиОбороты.ДокументПродажи ССЫЛКА Документ.Прием
	|					СГРУППИРОВАТЬ ПО
	|						ПродажиОбороты.Сотрудник)) КАК РабочееВремяСотрудниковОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочееВремяСотрудниковОбороты.Сотрудник");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецПериода);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

#КонецОбласти