
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочееПоступление	= Ложь;
	ПрочееСписание		= Ложь;
	Инкассация			= Ложь;
	
	Если Параметры.Свойство("ПрочееПоступление") Тогда 
		ПрочееПоступление = Истина;
	ИначеЕсли Параметры.Свойство("ПрочееСписание") Тогда 
		ПрочееСписание = Истина;
	ИначеЕсли Параметры.Свойство("Инкассация") Тогда 
		Инкассация = Истина;
	КонецЕсли;
	
	Параметры.Свойство("Касса"	, Касса);
	Параметры.Свойство("Статья"	, Статья);
	
	Если Не ЗначениеЗаполнено(Касса) Тогда
		Касса = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.ОсновнаяКасса;	
	КонецЕсли;
	
	ИспользоватьБезПодключенияОборудования = ?(ЗначениеЗаполнено(Касса), Касса.ИспользоватьБезПодключенияОборудования, Ложь);	
	
	Если Инкассация И Статья = Справочники.СтатьиДоходовИРасходов.СдачаРозничнойВыручкиВКассуПредприятия Тогда 
		ЭтаФорма.Заголовок			= "Сдача розничной выручки в кассу предприятия";
		Элементы.Провести.Заголовок = "Сдать";  
	ИначеЕсли Инкассация И Статья = Справочники.СтатьиДоходовИРасходов.СдачаНаличныхВБанк Тогда 
		ЭтаФорма.Заголовок			= "Сдача наличных в банк";
		Элементы.Провести.Заголовок = "Сдать";
	ИначеЕсли ПрочееПоступление Тогда 
		ЭтаФорма.Заголовок			= "Сумма поступления";
		Элементы.Провести.Заголовок = "Оприходовать";
	ИначеЕсли ПрочееСписание Тогда 
		ЭтаФорма.Заголовок			= "Прочее списание";
		Элементы.Провести.Заголовок = "Списать";
		Элементы.ГруппаПечатьРКО.Видимость = Истина;
	КонецЕсли;
	
	Если ПрочееСписание Или Инкассация Тогда
		ЭтотОбъект.Сумма = ДенежныеСредстваСервер.ПолучитьОстаткоДенежныхСредств(ТекущаяДатаСеанса(), ЭтотОбъект.Касса);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыФункции      

&НаКлиенте
// Процедура, обработчик нажатия кнопки "Внести".
//
Процедура Оплатить(Команда)
	
	Если ПроверитьЗаполнение() Тогда 
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("СуммаДокумента"		, Сумма);
		СтруктураВозврата.Вставить("Статья"				, Статья);		
		СтруктураВозврата.Вставить("Комментарий"		, Комментарий);
		СтруктураВозврата.Вставить("Касса"				, Касса);
		СтруктураВозврата.Вставить("ТипДенежныхСредств"	, ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные"));
		СтруктураВозврата.Вставить("ВидОперации" 		, ?(Инкассация = Истина,
																ПредопределенноеЗначение("Перечисление.ВидыОпераций.СдачаНаличныхВБанк"), 
																ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПрочееПоступление")));
		
		Если Инкассация Тогда
			СтруктураВозврата.Вставить("БанковскийСчетКонтрагента"	, ПолучитьБанковскийСчетПоУмолчанию());
		КонецЕсли;   	

		ЭтаФорма.Закрыть(СтруктураВозврата);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - возвращает бансковский счет по умолчанию.
//
Функция ПолучитьБанковскийСчетПоУмолчанию()
	
	Возврат ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.Организация.БанковскийСчетПоУмолчанию;
	
КонецФункции

#КонецОбласти
