
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик создания формы на сервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если Параметры.Свойство("Ключ") И Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
		
		Параметры.Свойство("Контрагент"         , Запись.Контрагент);
		Параметры.Свойство("Сотрудник"          , Запись.Сотрудник);
		Параметры.Свойство("Прием"              , Запись.Прием);
		Параметры.Свойство("СтруктурнаяЕдиница" , Запись.СтруктурнаяЕдиница);
		Параметры.Свойство("ДатаЗапланированная", Запись.ДатаЗапланированная);	
		Параметры.Свойство("ВидОсмотра"         , Запись.ВидОсмотра);	
		Параметры.Свойство("ПричинаНаправления" , Запись.ПричинаНаправления);
		Параметры.Свойство("Комментарий" 		, Запись.Комментарий); 
		Параметры.Свойство("Специализация" 		, Запись.Специализация);
		Параметры.Свойство("Длительность" 		, Запись.Длительность);
		Параметры.Свойство("АвторЗаписи"        , Запись.АвторЗаписи);
		
	КонецЕсли;
	
	// Поле специализация, лучше не заполнять так как оно учавствует в отборе в документе прием для формирования результата лечения
	// если запись оформлена из результата лечения, то специализация будет заполнена.
	Элементы.Специализация.Видимость = ЗначениеЗаполнено(Запись.Специализация);
	
	Запись.Период              	= ТекущаяДатаСеанса(); 
	ЗапланированнаяДата         = ?(Дата(ЗапланированнаяДата) = Дата(1,1,1), Запись.ДатаЗапланированная, ЗапланированнаяДата); 
	Запись.АвторЗаписи         	= ?(НЕ ЗначениеЗаполнено(Запись.АвторЗаписи), ПараметрыСеанса.ТекущийПользователь, Запись.АвторЗаписи);
	
	УстановитьСостояниеФормы();
	УстановитьВидимостьНадписиЗапланированыхПредварительныхЗаписей();
	
КонецПроцедуры

&НаКлиенте
// Обработчик открытия формы на клиенте
//
Процедура ПриОткрытии(Отказ)

	Если Запись.ВидОсмотра = ПредопределенноеЗначение("Перечисление.ВидыОсмотров.ОчередьНаЗапись") Тогда
		Элементы.ПричинаНаправления.ТолькоПросмотр = Ложь;
		Элементы.Комментарий.ТолькоПросмотр 	   = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Перед записью на клиенте
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Запись.Статус) Тогда
		ПоказатьПредупреждение(,"Укажите статус планирования.");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Обработчик перед записью на сервере
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДатаЗапланированная = ЗапланированнаяДата;
	
КонецПроцедуры

&НаКлиенте
// Обработчик после записи на клиенте
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗАПИСЬ_В_РЕГИСТР_ПРОФОСМОТРЫ");
	
КонецПроцедуры

&НаКлиенте
// Обработчик формы записи новго объекта
//
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ТипЗнч(НовыйОбъект.Ссылка) = Тип("ДокументСсылка.Событие") Тогда
		
		Запись.ПредварительнаяЗапись = НовыйОбъект.Ссылка;
		Если ЗначениеЗаполнено(Запись.ПредварительнаяЗапись) Тогда
			Элементы.ДекорацияПредварительнаяЗапись.Заголовок = СформироватьПредставлениеПЗ(Запись.ПредварительнаяЗапись);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Процедура - Сохранить.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Сохранить(Команда)
	
	Если Записать() Тогда
		Оповестить("ОбновитьРабочийСтол");
		ЭтаФорма.Закрыть(Запись);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик изменения статуса
//
Процедура СтатусПриИзменении(Элемент)
	
	УстановитьСостояниеФормы();
	
КонецПроцедуры

&НаКлиенте
// Обработчик вызова формы создания предварительной записи
//
Процедура ДекорацияПредварительнаяЗаписьНажатие(Элемент)	
	
	// Если предварительная запись еще не создана откр. форму создания	
	Если НЕ ЗначениеЗаполнено(Запись.ПредварительнаяЗапись) Тогда	

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Дата"                    , Запись.ДатаЗапланированная);
		ПараметрыФормы.Вставить("Контрагент"              , Запись.Контрагент);
		ПараметрыФормы.Вставить("Сотрудник"               , Запись.Сотрудник);
		ПараметрыФормы.Вставить("СпециализацияВрача"      , Запись.Специализация);
//		ПараметрыФормы.Вставить("ПереключательПериода"    , ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.День"));
		ПараметрыФормы.Вставить("ЗакрытьПриСозданииЗаписи", Истина);
		
		ИмяФормыПланировщика = ОбщегоНазначенияКлиент.ПолучитьИмяФормыПланировщика(ПараметрыФормы, "ФормаПредварительнойЗаписи");
		ОткрытьФорму(ИмяФормыПланировщика, ПараметрыФормы,,,,, Новый ОписаниеОповещения("ДекорацияПредварительнаяЗаписьПослеНажатия", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе 
		// Если предварительная запись создана открываем форму доккумента
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(Запись.ПредварительнаяЗапись)); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Декорация предварительная запись после нажатия
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ДекорацияПредварительнаяЗаписьПослеНажатия(Результат, ДополнительныеПараметры) Экспорт
	
	Запись.ПредварительнаяЗапись = Результат;
	Если ЗначениеЗаполнено(Запись.ПредварительнаяЗапись) Тогда
		Элементы.ДекорацияПредварительнаяЗапись.Заголовок = СформироватьПредставлениеПЗ(Запись.ПредварительнаяЗапись); 
		Запись.ДатаЗапланированная = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Запись.ПредварительнаяЗапись, "Дата");
		Запись.Длительность = ВернутьДлительностьПредварительнойЗаписи(Запись.ПредварительнаяЗапись);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "Нажатие"
//
Процедура ДекорацияЗапланированнаяЗаписьНажатие(Элемент)	
	
	МассивНайденныхСтрок = ТаблицаЗапланированыхПредварительныхЗаписей.НайтиСтроки(Новый Структура("СтрокаКлюч", СтрЗаменить(Элемент.Имя, "Декорация_ПланируемаяПредварительнаяЗапись_", "")));
	Если МассивНайденныхСтрок.Количество() > 0 Тогда 
		ОткрытьФорму("Документ.Событие.ФормаОбъекта", Новый Структура("Ключ", МассивНайденныхСтрок[0].Ссылка), ЭтаФорма);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ДополнительныеПроцедурыИФункции 

&НаСервереБезКонтекста
// Функция, Возвращает длительность приема.
//
Функция ВернутьДлительностьПредварительнойЗаписи(ПредварительнаяЗапись)
	
	СтруктураДлительности = Документы.Событие.ПолучитьПродолжительностьСобытия(ПредварительнаяЗапись); 
	Возврат ?(СтруктураДлительности <> Неопределено И СтруктураДлительности.Свойство("Длительность"), СтруктураДлительности.Длительность, 0);	
	
КонецФункции

&НаСервере
// Процедура установки состояния формы
//
Процедура УстановитьСостояниеФормы()
	
	Если  Запись.ВидОсмотра = Перечисления.ВидыОсмотров.Профосмотр Тогда
		ЭтаФорма.Заголовок = "Планирование профосмотра";
	ИначеЕсли  Запись.ВидОсмотра = Перечисления.ВидыОсмотров.Направление Тогда	
		ЭтаФорма.Заголовок = "Планирование направления к врачу"; 
	ИначеЕсли  Запись.ВидОсмотра = Перечисления.ВидыОсмотров.ПовторныйПрием Тогда	
		ЭтаФорма.Заголовок = "Планирование повторного приема";  		
	ИначеЕсли  Запись.ВидОсмотра = Перечисления.ВидыОсмотров.ОчередьНаЗапись Тогда	
		ЭтаФорма.Заголовок = "Планирование записи к врачу";
		Элементы.ПричинаНаправления.Заголовок = "Причина добавления";
	КонецЕсли;	
	
	Элементы.ДекорацияПредварительнаяЗапись.Доступность = Ложь;
	Элементы.ПричинаОтказа.Доступность                  = Ложь;
	Элементы.ЗапланированнаяДата.Доступность      		= Ложь;	
	Элементы.ПричинаПереноса.Доступность      			= Ложь;	
	
	Если ЗначениеЗаполнено(Запись.Статус) Тогда
		
		Элементы.ГруппаСтатус.Видимость = Истина;
		
		Если Запись.Статус = Перечисления.СтатусыПрофосмотров.Согласился Тогда
			
			Элементы.ГруппаСогласился.Видимость = Истина;
			Элементы.ГруппаНапомнить.Видимость  = Ложь;
			Элементы.ГруппаОтказа.Видимость 	= Ложь;
			
			Элементы.ДекорацияПредварительнаяЗапись.Доступность = Истина;
			
		ИначеЕсли Запись.Статус = Перечисления.СтатусыПрофосмотров.НапомнитьПозже Тогда
			
			Элементы.ГруппаСогласился.Видимость 	 = Ложь;
			Элементы.ГруппаНапомнить.Видимость  	 = Истина;
			Элементы.ГруппаОтказа.Видимость 		 = Ложь;
			
			Элементы.ЗапланированнаяДата.Доступность = Истина;	
			Элементы.ПричинаПереноса.Доступность   	 = Истина;
			
		ИначеЕсли Запись.Статус = Перечисления.СтатусыПрофосмотров.Отказался Тогда
			
			Элементы.ГруппаСогласился.Видимость = Ложь;
			Элементы.ГруппаНапомнить.Видимость  = Ложь;	
			Элементы.ГруппаОтказа.Видимость 	= Истина;
			
			Элементы.ПричинаОтказа.Доступность  = Истина; 
			
		КонецЕсли;	
		
	Иначе
		Элементы.ГруппаСтатус.Видимость = Ложь;
	КонецЕсли;
	
	Если НЕ Запись.Статус = Перечисления.СтатусыПрофосмотров.НапомнитьПозже Тогда 		
		ЗапланированнаяДата = Запись.ДатаЗапланированная;
	КонецЕсли;		

	// Установка фильтра списка истории приемов
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокИсторииПриемов, "Контрагент", Запись.Контрагент, ЗначениеЗаполнено(Запись.Контрагент),ВидСравненияКомпоновкиДанных.Равно);
	
	// Установить видимость причины направления
	// Если Запись.ВидОсмотра = Перечисления.ВидыОсмотров.Направление ИЛИ Запись.ВидОсмотра = Перечисления.ВидыОсмотров.ОчередьНаЗапись Тогда 
	//	Элементы.Комментарий.Видимость = Истина;
	// Иначе 
	//	Элементы.Комментарий.Видимость = Ложь;
	// КонецЕсли;
	
	Элементы.КонтрагентТелефон.Видимость = НЕ (ПараметрыСеанса.ТекущийПользователь.РольПользователя = Перечисления.РольПользователя.Врач);
	
КонецПроцедуры

&НаСервере
// Процедура устанавливает видимость у надписи
// с гиперсылками "Открыть" и "ДобавитьУслуги"
//
Процедура УстановитьВидимостьНадписиЗапланированыхПредварительныхЗаписей()
	
	// Почистим группу перед добавлением в нее элементов
	Индекс = 0;
	КоличествоЭлементов = Элементы.Группа_БудущаяПредварительнаяЗапись.ПодчиненныеЭлементы.Количество();	
	Пока Индекс < КоличествоЭлементов Цикл		
		ЭтаФорма.Элементы.Удалить(Элементы.Группа_БудущаяПредварительнаяЗапись.ПодчиненныеЭлементы[0]);
		Индекс = Индекс + 1;
	КонецЦикла;            
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытиеУслуги.Ссылка КАК Ссылка,
	|	СобытиеУслуги.ДатаНачала КАК Дата,
	|	"""""""" КАК СтрокаКлюч,
	|	СобытиеУслуги.Сотрудник КАК Сотрудник,
	|	СобытиеУслуги.Ссылка.Контрагент КАК Контрагент,
	|	СобытиеУслуги.Ссылка.Дата КАК ДатаДокумента
	|ИЗ
	|	Документ.Событие.Услуги КАК СобытиеУслуги
	|ГДЕ
	|	НЕ СобытиеУслуги.Ссылка.ПометкаУдаления
	|	И СобытиеУслуги.ДатаНачала >= &ДатаНачала
	|	И СобытиеУслуги.Ссылка.Контрагент = &Контрагент
	|	И СобытиеУслуги.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И СобытиеУслуги.НомерСтроки = 1
	|	И НЕ СобытиеУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПРиемОтменен)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата");
	
	// "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	Профосмотры.Период КАК ПериодКлюч,
	//|	"""" КАК СтрокаКлюч,
	//|	Профосмотры.Контрагент КАК Контрагент,
	//|	Профосмотры.Сотрудник КАК Сотрудник,
	//|	Профосмотры.ДатаЗапланированная КАК Дата
	//|ИЗ
	//|	РегистрСведений.Профосмотры КАК Профосмотры
	//|ГДЕ
	//|	Профосмотры.Контрагент = &Контрагент
	//|	И Профосмотры.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	//|	И Профосмотры.ДатаЗапланированная >= &ДатаЗапланированная
	//|	И Профосмотры.ПредварительнаяЗапись = ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка)
	//|	И (Профосмотры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.Запланирован)
	//|			ИЛИ Профосмотры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.НапомнитьПозже))
	//|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Контрагент"        	, Запись.Контрагент);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"  , Запись.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ДатаНачала" 			, НачалоДня(ТекущаяДатаСеанса()));	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Индекс = 0;
	ТаблицаЗапланированыхПредварительныхЗаписей.Загрузить(Результат); 
	Для Каждого Планирование Из ТаблицаЗапланированыхПредварительныхЗаписей Цикл
				
		Планирование.СтрокаКлюч = Строка(Индекс);
		
		// Добавим группу   
		ЭлементГруппа                     = ЭтаФорма.Элементы.Добавить("ГруппаПредварительнойЗаписи_" + Планирование.СтрокаКлюч, Тип("ГруппаФормы"), Элементы.Группа_БудущаяПредварительнаяЗапись);
		ЭлементГруппа.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГруппа.ОтображатьЗаголовок = Ложь;
		ЭлементГруппа.Отображение         = ОтображениеОбычнойГруппы.Нет;
		ЭлементГруппа.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;		   
		
		// добавим элементы в эту группу
		ЭлементДекорация                           = ЭтаФорма.Элементы.Добавить("Декорация_Картинка_" + Планирование.СтрокаКлюч, Тип("ДекорацияФормы"), ЭлементГруппа);
		ЭлементДекорация.Вид                       = ВидДекорацииФормы.Картинка;
		ЭлементДекорация.Картинка 				   = БиблиотекаКартинок.КалендарьДень;
		// ЭлементДекорация.ГоризонтальноеПоложение   = ГоризонтальноеПоложениеЭлемента.Лево;
		ЭлементДекорация.Ширина = 2;
		ЭлементДекорация.Высота = 1;
		// -------------------------------
		ЭлементДекорация                          = ЭтаФорма.Элементы.Добавить("Декорация_ПланируемаяПредварительнаяЗапись_" + Планирование.СтрокаКлюч, Тип("ДекорацияФормы"), ЭлементГруппа);
		ЭлементДекорация.Вид                      = ВидДекорацииФормы.Надпись;
		ЭлементДекорация.ГоризонтальноеПоложение  = ГоризонтальноеПоложениеЭлемента.Лево;
		ЭлементДекорация.Гиперссылка              = Истина;
		// ЭлементДекорация.Шрифт                    = Новый Шрифт( , , Истина, );
		ЭлементДекорация.Заголовок = Формат(Планирование.Дата, "ДФ=ddd") + ", " + Сред(Формат(Планирование.Дата, "ДЛФ=DD"), 1, ?(СтрДлина(Формат(Планирование.Дата, "ДЛФ=DD")) > 0, СтрДлина(Формат(Планирование.Дата, "ДЛФ=DD")) - 1, 0)) + ", " + Строка(Планирование.Сотрудник);
		ЭлементДекорация.УстановитьДействие("Нажатие", "ДекорацияЗапланированнаяЗаписьНажатие"); 
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезконтекста
// Сформировать представление ссылки на ПЗ
//
Функция СформироватьПредставлениеПЗ(ДокСсылка)	
	
	Если ДокСсылка.Услуги.Количество() > 0 Тогда
		Возврат "Запись на " + Формат(ДокСсылка.Услуги[0].ДатаНачала,"ДФ='dd MMMM yyyy H:mm'"); 
	Иначе
		Возврат Строка(ДокСсылка);
	КонецЕсли;
	
КонецФункции

#КонецОбласти
 
