
#Область ОбработчикиСобытий

&НаКлиенте
// Процедура - обработчик события "ОбработкаКоманды".
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если УправлениеПечатьюКлиентСтоматология.ПроверитьДокументыПроведены(ПараметрКоманды) Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Документ.Реализация",
		    "СчетФактура",
			ПараметрКоманды,
			ПараметрыВыполненияКоманды.Источник,
			Неопределено // ПараметрыПечати
		);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаКоманды()

#КонецОбласти