#Область ОбработчикиСобытий

// Процедура - Обработка получения полей представления
//
// Параметры:
//  Поля				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
    Поля.Добавить("ЭтоСторно");
	Поля.Добавить("Ссылка");
	
КонецПроцедуры   

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает данные для пробития чека коррекции.
//
Функция ПодготовитьДанныеДляПробитияЧека(ЧекКоррекции, Параметры = Неопределено) Экспорт
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
		
	МассивДокументовОплаты = Новый Массив;
	МассивДокументовОплаты.Добавить(ЧекКоррекции.Ссылка);
	
	// Общие параметры чека
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Касса");
	СтруктураРеквизитов.Вставить("Организация");
	СтруктураРеквизитов.Вставить("Покупатель");
	СтруктураРеквизитов.Вставить("ПокупательEmail");
	СтруктураРеквизитов.Вставить("ПокупательНомер");
	СтруктураРеквизитов.Вставить("Дата");
	СтруктураРеквизитов.Вставить("СистемаНалогообложения");
	СтруктураРеквизитов.Вставить("ТипРасчета");
	СтруктураРеквизитов.Вставить("ТипКоррекции");
	СтруктураРеквизитов.Вставить("ОписаниеКоррекции");
	СтруктураРеквизитов.Вставить("ДатаКоррекции");
	СтруктураРеквизитов.Вставить("НомерПредписания");
	СтруктураРеквизитов.Вставить("НеприменениеККТ");
	//СтруктураРеквизитов.Вставить("ДокументОснование");
	СтруктураРеквизитов.Вставить("ПробитЧек");
	СтруктураРеквизитов.Вставить("Кассир");
	СтруктураРеквизитов.Вставить("КассирИНН");
	СтруктураРеквизитов.Вставить("ДополнительныйРеквизит");
	СтруктураРеквизитов.Вставить("СтруктурнаяЕдиница");
	СтруктураРеквизитов.Вставить("ВидОперации");
	//СтруктураРеквизитов.Вставить("ВидНалога");
	СтруктураРеквизитов.Вставить("АвторДокумента");
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЧекКоррекции, СтруктураРеквизитов);
	
	Если РеквизитыДокумента.ПробитЧек Тогда
		ТекстСообщения = НСтр("ru = '%1 уже пробит'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ЧекКоррекции);
		Возврат Новый Структура("Результат, ОписаниеОшибки", Ложь, ТекстСообщения);
	КонецЕсли;    

	ПараметрыЧека = МенеджерОборудованияВызовСервера.ПустаяСтруктураПараметровЧекаКоррекции();
	
	ПараметрыЧека.ВидОперации             = РеквизитыДокумента.ВидОперации;
	ПараметрыЧека.СтруктурнаяЕдиница      = РеквизитыДокумента.СтруктурнаяЕдиница;
	ПараметрыЧека.Организация             = РеквизитыДокумента.Организация;
	ПараметрыЧека.Сотрудник               = РеквизитыДокумента.АвторДокумента;
	ПараметрыЧека.Клиент                  = РеквизитыДокумента.Покупатель;
	ПараметрыЧека.Дата                    = ТекущаяДатаСеанса();
	ПараметрыЧека.Касса                   = РеквизитыДокумента.Касса;
	//ПараметрыЧека.Кассир				  = РеквизитыДокумента.Кассир;
	//ПараметрыЧека.КассирИНН				  = РеквизитыДокумента.КассирИНН;
	ПараметрыЧека.Количество              = 1;		
	ПараметрыЧека.СуммаОплачено           = ЧекКоррекции.Оплата.Итог("Сумма");//СтруктураРеквизитов.СуммаДокумента;
	ПараметрыЧека.СуммаКОплате 			  = ЧекКоррекции.Оплата.Итог("Сумма");
	ПараметрыЧека.ВидНалога               = РеквизитыДокумента.СистемаНалогообложения; 
	ПараметрыЧека.ТипЧека                 = ПолучитьКодТипаРасчетаДенежнымиСредствами(РеквизитыДокумента.ТипРасчета);
	
	ПараметрыЧека.ВыводитьЧекНаБумагу     = ?(Параметры.Свойство("ВыводитьЧекНаБумагу"), Параметры.ВыводитьЧекНаБумагу, Истина);
	ПараметрыЧека.ЭлектроннаяПочтаКлиента = ?(Параметры.Свойство("ЭлектроннаяПочтаКлиента"), Параметры.ЭлектроннаяПочтаКлиента, РеквизитыДокумента.ПокупательEmail); //ПочтаКлиента;
	ПараметрыЧека.НомерТелефонаКлиента    = ?(Параметры.Свойство("НомерТелефонаКлиента"), Параметры.НомерТелефонаКлиента, РеквизитыДокумента.ПокупательНомер); //ТелефонКлиента;
	
	ПараметрыЧека.КорректируемыйДокумент				= ОбщегоНазначенияСтоматология.ПреобразоватьТЗвМассивСтруктуры(ЧекКоррекции.ТаблицаОснований.Выгрузить());
	ПараметрыЧека.ДанныеКоррекции.ТипКоррекции			= РеквизитыДокумента.ТипКоррекции;
	ПараметрыЧека.ДанныеКоррекции.ОписаниеКоррекции		= РеквизитыДокумента.ОписаниеКоррекции;
	ПараметрыЧека.ДанныеКоррекции.ДатаКоррекции			= РеквизитыДокумента.ДатаКоррекции;
	ПараметрыЧека.ДанныеКоррекции.НомерПредписания		= РеквизитыДокумента.НомерПредписания;
	ПараметрыЧека.НеприменениеККТ 						= РеквизитыДокумента.НеприменениеККТ;
	ПараметрыЧека.МассивДокументовОснований				= МассивДокументовОплаты;
	ПараметрыЧека.СформироватьЧекКоррекции				= Истина;
	ПараметрыЧека.ДополнительныйРеквизит				= РеквизитыДокумента.ДополнительныйРеквизит;
	
	//----------
	РезультатОперации  = Новый Структура("Результат, ОписаниеОшибки", Истина, Неопределено);
	
	Касса				= ?(РеквизитыДокумента.Свойство("Касса"), РеквизитыДокумента.Касса, Неопределено);
	ПроизошлоИсключение	= Ложь;

	Если Касса = Неопределено Тогда		
		РезультатОперации.Результат      = Ложь;
		РезультатОперации.ОписаниеОшибки = НСтр("ru = 'Для данной операции необходимо указать кассу!'; en = 'For this operation, you must specify the cashbox!'");
		Возврат РезультатОперации;		
	КонецЕсли;
	
	// Если в кассе не используется оборудование отменить операцию.
	Если Касса.ИспользоватьБезПодключенияОборудования Тогда
		РезультатОперации.Результат      = Ложь;
		РезультатОперации.ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Касса: %1 используется без подключения оборудования!';en= 'Cashbox: %1 is used without connecting equipment!'"), Касса);
		Возврат РезультатОперации;
	КонецЕсли;		
	
	// Получаем общие параметры для пробития чека коррекции на ФР (ФИКСИРОВАННАЯ СТРУКТУРА).
	ОбщиеПараметры = МенеджерОборудованияВызовСервера.ПолучитьОбщиеПараметрыПробитияЧекаКоррекции(ПараметрыЧека);  	
	
	// Копируем основные параметры чека.
	ФискальныйЧек = Новый Структура(ОбщиеПараметры);
	ФискальныйЧек.ПозицииЧека  = Новый Массив;
	ФискальныйЧек.ТаблицаОплат = Новый Массив;
	
	ДобавитьТоварыВОбщиеПараметрыЧека(ФискальныйЧек, ЧекКоррекции.ПозицииЧека);
	ДобавитьОплатуВОбщиеПараметрыЧека(ФискальныйЧек, ЧекКоррекции.Оплата);		
	
	Если ЗначениеЗаполнено(ФискальныйЧек.Касса.ВнешнееОборудование) Тогда 
		РеквизитыОборудования = ФорматноЛогическийКонтрольВызовСервера.СтруктураДанныхФорматноЛогическогоКонтроля(ФискальныйЧек.Касса.ВнешнееОборудование);
		ФискальныйЧек.СпособФорматноЛогическогоКонтроля					= РеквизитыОборудования.СпособФорматноЛогическогоКонтроля;
		ФискальныйЧек.ДопустимоеРасхождениеФорматноЛогическогоКонтроля	= РеквизитыОборудования.ДопустимоеРасхождениеФорматноЛогическогоКонтроля;
	Иначе
		ФискальныйЧек.СпособФорматноЛогическогоКонтроля = Перечисления.СпособыФорматноЛогическогоКонтроля.РазделятьСтроки;
	КонецЕсли;
	
	ФорматноЛогическийКонтрольКлиентСервер.ПровестиФорматноЛогическийКонтроль(ФискальныйЧек, ФискальныйЧек.Касса.ВнешнееОборудование);
	
	РезультатОперации.Вставить("ФискальныйЧек", ФискальныйЧек);

	Возврат РезультатОперации;
	
КонецФункции

// Получить код типа расчета денежными средствами.
// 
Функция ПолучитьКодТипаРасчетаДенежнымиСредствами(ТипРасчета) 
	
	Если ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств") Тогда
		ПризнакРасчетаКод = 0 
	ИначеЕсли ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств") Тогда
		ПризнакРасчетаКод = 1 
	ИначеЕсли ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств") Тогда
		ПризнакРасчетаКод = 2
	ИначеЕсли ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств") Тогда
		ПризнакРасчетаКод = 3
	КонецЕсли;
	
	Возврат ПризнакРасчетаКод;
	
КонецФункции        

// Процедура добавляет оплату в общие параметры чека.
//
Процедура ДобавитьОплатуВОбщиеПараметрыЧека(ОбщиеПараметры, МассивОплат)
	
	Для Каждого СтрокаМ ИЗ МассивОплат Цикл							
		СтрокаОплаты = Новый Структура();
		СтрокаОплаты.Вставить("ТипОплаты", МенеджерОборудованияВызовСервера.ПолучитьТипОплатыПоТипуДенежныхСредств(Истина, СтрокаМ.ТипОплаты));
		СтрокаОплаты.Вставить("Сумма"    , СтрокаМ.Сумма);
		
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);			
	КонецЦикла;
	
КонецПроцедуры

// Процедура добавляет товары в общие параметры чека.
//
Процедура ДобавитьТоварыВОбщиеПараметрыЧека(ОбщиеПараметры, ПозицииЧека)
	
	Для Каждого СтрокаМ Из ПозицииЧека Цикл		
				
		СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
		ЗаполнитьЗначенияСвойств(СтрокаПозицииЧека, СтрокаМ);	
		
		Если ТипЗнч(СтрокаМ.НаименованиеПредметаРасчета) = Тип("Строка") Тогда
			СтрокаПозицииЧека.Наименование     = СтрокаМ.НаименованиеПредметаРасчета;
		Иначе
			СтрокаПозицииЧека.Наименование     = Справочники.Номенклатура.ПолучитьНаименованиеДляЧека(СтрокаМ.НаименованиеПредметаРасчета);
		КонецЕсли;
		СтрокаПозицииЧека.Сумма            = СтрокаМ.СуммаСоСкидками;
		
		СтрокаПозицииЧека.СтавкаНДС        = ПолучитьСтавкуНДСККТ(СтрокаМ.СтавкаНДС);  		
		СтрокаПозицииЧека.Штрихкод         = СтрокаМ.Штрихкод;	
		СтрокаПозицииЧека.НомерСекции      = СтрокаМ.НомерСекции;	
		
		СтрокаПозицииЧека.ДанныеПоставщика.ИНН					= СтрокаМ.ДанныеПоставщикаИНН;		
		СтрокаПозицииЧека.ДанныеПоставщика.Наименование 		= СтрокаМ.ДанныеПоставщикаНаименование;
		СтрокаПозицииЧека.ДанныеПоставщика.Телефон				= СтрокаМ.ДанныеПоставщикаТелефон;
		
		Если Не ЗначениеЗаполнено(СтрокаМ.ПризнакАгентаПоПредметуРасчета) Тогда
			СтрокаПозицииЧека.ПризнакАгентаПоПредметуРасчета = Неопределено;
		КонецЕсли;
		
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);			

	КонецЦикла;      
	
КонецПроцедуры

// Функция, возвращает ставку НДС для ККТ.
//
Функция ПолучитьСтавкуНДСККТ(СтавкаНДС)
	
	Если НЕ ЗначениеЗаполнено(СтавкаНДС)
		ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		 
		 Возврат Неопределено;
	 Иначе
		 СоответствиеСтавокНДС = Новый Соответствие;
		 СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС0 , 0);
		 СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС10, 10);
		 СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС18, 18);
		 СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС20, 20);
		 
		Возврат СоответствиеСтавокНДС.Получить(СтавкаНДС);
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#КонецЕсли