#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаПроверкиЗаполнения".
//   
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НачалоДня(Дата) <> НачалоДня(ТекущаяДатаСеанса()) Тогда
		ТекстОшибки = НСтр("ru = 'Не допускается коррекция датой, отличной от текущей'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Дата",, Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Касса) Тогда
		
		//СтруктураСостояниеКассовойСмены = РозничныеПродажиСервер.ПолучитьСостояниеКассовойСмены(КассаККМ);
		//
		//КассоваяСмена = СтруктураСостояниеКассовойСмены.КассоваяСмена;
		//
		//ТекстОшибки = НСтр("ru = 'Кассовая смена не открыта'");
		//Если НЕ РозничныеПродажиСервер.СменаОткрыта(КассоваяСмена, Дата, ТекстОшибки) Тогда
		//	ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "КассаККМ",, Отказ);
		//КонецЕсли;
		
		ТипОборудования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Касса, Новый Структура("ТипОборудования", "ВнешнееОборудование.ТипОборудования")).ТипОборудования;
		Если ТипОборудования <> Перечисления.ТипыПодключаемогоОборудования.ККТ Тогда
			ТекстОшибки = НСтр("ru = 'Коррекция допускается только при использовании ККТ'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Касса",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Оплата.Итог("Сумма") <> ПозицииЧека.Итог("СуммаСоСкидками") Тогда
		ТекстОшибки = НСтр("ru = 'Сумма оплат не совпадает с итоговой суммой по позициям чека'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Оплата",, Отказ);
	КонецЕсли;
	
	Если ТипКоррекции = 1 и Не ЗначениеЗаполнено(НомерПредписания) Тогда
		ТекстОшибки = НСтр("ru = 'Укажите номер предписания'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "НомерПредписания",, Отказ);
	КонецЕсли;          
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПробитЧекПоСсылке = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПробитЧек");
	
	Если ПробитЧекПоСсылке = Истина Тогда
		Текст = НСтр("ru = 'Чек коррекции пробит. Операции над этим документом запрещены.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект,,, Отказ);
		Возврат;
	КонецЕсли;
	
	// Прописываем кассовую смену в документ
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И НЕ ЗначениеЗаполнено(КассоваяСмена) 
		И РозничныеПродажи.ДоступностьИспользованияКассовойСмены(ЭтотОбъект.Касса) Тогда
		
		ЭтотОбъект.КассоваяСмена = РозничныеПродажи.ПолучитьТекущуюОткрытуюКассовуюСмену(ЭтотОбъект.Касса);
		
	КонецЕсли;	 	
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаПроведения".
//       
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Если чек пробит, тогда в любом случае вносим данные в РС СкорректированныеФискальныеОперации
	// независимо от проведения. Данные после пробития не редактируются.
	//Если ПробитЧек И НЕ НеприменениеККТ Тогда
	//	
	//	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	СкорректированныеФискальныеОперации.СкорректированныеДокумент КАК СкорректированныеДокумент
	//	|ИЗ
	//	|	РегистрСведений.СкорректированныеФискальныеОперации КАК СкорректированныеФискальныеОперации
	//	|ГДЕ
	//	|	СкорректированныеФискальныеОперации.СкорректированныеДокумент = &СкорректированныеДокумент");
	//	
	//	Запрос.УстановитьПараметр("СкорректированныеДокумент", ДокументОснование);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	Если РезультатЗапроса.Пустой() Тогда  			
	//		Менеджер = РегистрыСведений.СкорректированныеФискальныеОперации.СоздатьМенеджерЗаписи();  			
	//		Если ОбщегоНазначения.ЕстьРеквизитОбъекта(ДокументОснование, "СтруктурнаяЕдиница") Тогда
	//			Менеджер.СтруктурнаяЕдиница = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ДокументОснование, "СтруктурнаяЕдиница");
	//		КонецЕсли;  
	//		Если ОбщегоНазначения.ЕстьРеквизитОбъекта(ДокументОснование, "Организация") Тогда
	//			Менеджер.Организация = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ДокументОснование, "Организация");
	//		КонецЕсли;  	
	//		Менеджер.СкорректированныеДокумент 				= ДокументОснование;
	//		Менеджер.ПредставлениеКорректирующегоДокумента 	= Строка(ЭтотОбъект);			
	//		Менеджер.Записать();    			
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании".
//
Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ОбъектКопирования.НеприменениеККТ Тогда   		
		Текст = НСтр("ru = 'Можно копировать документы только с признаком ""Неприменение ККТ""'");  		
		ВызватьИсключение(Текст);       		
	КонецЕсли;
	
	НомерСмены		= 0;
	НомерЧекаККМ	= 0;
	ПробитЧек		= Ложь;
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - инициализирует документ.
//
Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)

	АвторДокумента		= ОбщегоНазначенияСтоматология.ПолучитьЗначениеПараметровСеанса("ТекущийПользователь");
	
	РеквизитыКассира	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(АвторДокумента, Новый Структура("Сотрудник, ИНН", "Сотрудник", "Сотрудник.ИНН"));
	Кассир 				= РеквизитыКассира.Сотрудник;
	КассирИНН 			= РеквизитыКассира.ИНН;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = СтруктурнаяЕдиница.Организация;
	КонецЕсли;
		
	НеприменениеККТ		= Истина;
	ОписаниеКоррекции	= НСтр("ru = 'Неприменение ККТ'");
	
КонецПроцедуры 

#КонецОбласти

#КонецЕсли
