
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьПоОК(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТабДокумент = ПолеВыбораЦвета;
	
	Макет   = Обработки.ВыборWebЦвета.ПолучитьМакет("Макет");
	Область = Макет.ПолучитьОбласть("ТаблицаЦветов");
	ТабДокумент.Вывести(Область);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолеВыбораЦветаВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Закрыть(Элемент.ТекущаяОбласть.ЦветФона);
	
КонецПроцедуры

#КонецОбласти