
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	Если Параметры.Свойство("Контрагент") И Параметры.Свойство("ДатаДокумента") Тогда
		
		УстановитьОтборДинамическомуСписку(Параметры);
		ЭтотОбъект.Контрагент = Параметры.Контрагент;
		
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды "Создать".
//
Процедура СоздатьПолис(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Контрагент) Тогда
		ПараметрыОткрытия.Вставить("Контрагент", ЭтотОбъект.Контрагент);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ПолисыМедицинскогоСтрахования.Форма.ФормаЭлемента",
				ПараметрыОткрытия,,,,,,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, устанавливает отбор динамического списка.
//
Процедура УстановитьОтборДинамическомуСписку(ПараметрыОтбора)
	
	// Задаем тест запроса динамического списка.
	Список.ПроизвольныйЗапрос = Истина;
	Список.ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПолисыМедицинскогоСтрахования.Ссылка КАК Ссылка,
	|	ПолисыМедицинскогоСтрахования.Код КАК Код,
	|	ПолисыМедицинскогоСтрахования.Наименование КАК Наименование,
	|	ПолисыМедицинскогоСтрахования.Контрагент КАК Контрагент,
	|	ПолисыМедицинскогоСтрахования.ТипПолиса КАК ТипПолиса,
	|	ПолисыМедицинскогоСтрахования.СтраховаяКомпания КАК СтраховаяКомпания,
	|	ПолисыМедицинскогоСтрахования.СерияПолиса КАК СерияПолиса,
	|	ПолисыМедицинскогоСтрахования.НомерПолиса КАК НомерПолиса,
	|	ПолисыМедицинскогоСтрахования.ЛимитПолиса КАК ЛимитПолиса,
	|	ПолисыМедицинскогоСтрахования.ДанаНачала КАК ДанаНачала,
	|	ПолисыМедицинскогоСтрахования.ДатаОкончания КАК ДатаОкончания,
	|	ПолисыМедицинскогоСтрахования.ДатаГарантийногоПисьма КАК ДатаГарантийногоПисьма,
	|	ПолисыМедицинскогоСтрахования.НомерГарантийногоПисьма КАК НомерГарантийногоПисьма,
	|	ПолисыМедицинскогоСтрахования.Представление КАК Представление
	|ИЗ
	|	Справочник.ПолисыМедицинскогоСтрахования КАК ПолисыМедицинскогоСтрахования
	|ГДЕ
	|	ПолисыМедицинскогоСтрахования.Контрагент = &Контрагент
	|	И ПолисыМедицинскогоСтрахования.ПометкаУдаления = ЛОЖЬ
	|	И ПолисыМедицинскогоСтрахования.ДанаНачала <= &Период
	|	И (ПолисыМедицинскогоСтрахования.ДатаОкончания >= &Период
	|			ИЛИ ПолисыМедицинскогоСтрахования.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|	И &УсловиеОрганизация";
	
	Список.Параметры.УстановитьЗначениеПараметра("Контрагент", ПараметрыОтбора.Контрагент);
	Список.Параметры.УстановитьЗначениеПараметра("Период", 	   НачалоДня(ПараметрыОтбора.ДатаДокумента));
	
	УсловиеОрганизация = ?(Параметры.Свойство("Организация"), 
							"И ВЫБОР 
							|	КОГДА ПолисыМедицинскогоСтрахования.Договор <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) 
							|	ТОГДА ПолисыМедицинскогоСтрахования.Договор.Организация В (&МассивОрганизаций)
							|	ИНАЧЕ ИСТИНА
							|КОНЕЦ", "");
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &УсловиеОрганизация", УсловиеОрганизация); 
	
	Если Параметры.Свойство("Организация") Тогда
		МассивОтбораОрганизации = Новый Массив();
		МассивОтбораОрганизации.Добавить(Справочники.Организации.ПустаяСсылка());	
		МассивОтбораОрганизации.Добавить(ПараметрыОтбора.Организация);
		Список.Параметры.УстановитьЗначениеПараметра("МассивОрганизаций", МассивОтбораОрганизации);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти