   
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда   
   
#Область СлужебныйПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Автор)
	|	ИЛИ НЕ ТолькоДляАвтора";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульСозданиеНаОсновании = ОбщегоНазначения.ОбщийМодуль("СозданиеНаОсновании");
		Команда = МодульСозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Справочники.ШаблоныСообщений);
		Если Команда <> Неопределено Тогда
			Команда.ФункциональныеОпции = "ИспользоватьШаблоныСообщений";
		КонецЕсли;
		Возврат Команда;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

// Функция - Инициализировать структуру содержания шаблона мессенджера
//
// Параметры:
//  ШаблонСообщения	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСтруктуруСодержанияШаблонаМессенджера(ШаблонСообщения) Экспорт 
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СодержаниеМессенджерHTML"	, "");
	СтруктураВозврата.Вставить("СодержаниеМессенджер"		, "");
	СтруктураВозврата.Вставить("Содержание"					, "");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШаблонСообщения", ШаблонСообщения);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШаблоныСообщений.СодержаниеМессенджерHTML КАК СодержаниеМессенджерHTML,
	|	ШаблоныСообщений.СодержаниеМессенджер КАК СодержаниеМессенджер,
	|	ШаблоныСообщений.Содержание КАК Содержание
	|ИЗ
	|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|ГДЕ
	|	ШаблоныСообщений.Ссылка = &ШаблонСообщения";
	
	ВыборкаСодержания = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаСодержания.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, ВыборкаСодержания);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Процедура заполнения предопределенных шаблонов СМС.
//
Процедура ЗаполнитьПредопределенныеШаблоныSMS(УстановитьОсновным = Истина) Экспорт
	
	//ЭлементОбъект = Справочники.ШаблоныСообщений.НапоминаниеПредварительнойЗаписи.ПолучитьОбъект();
	//ЭлементОбъект.Содержание = СтрШаблон(НСтр("ru = 'Уважаемая(ый) %1 %2, напоминаем вам, что вы записаны %3 в %4 к врачу %5';en= 'Dear %1, we remind you that you have %3 recorded in %4 to doctor %5'"), "{Имя}", "{Отчество}", "{День}", "{Время}", "{Сотрудник}");
	//ЭлементОбъект.Записать();
	
КонецПроцедуры

// Функция - Преобразовать содержание с параметрами в текст.
//
Функция ПреобразоватьСодержаниеСПараметрамиВТекст(Знач Содержание, Документ, Получатель, ЭтоДокументОснование = Ложь, НеСообщатьОбОшибках = Ложь, Карта = Неопределено) Экспорт
	
	// Получаем значение параметров
	МассивПараметров = ПолучитьМассивПараметровИзШаблона(Содержание, "{}");
	Для Каждого Параметр Из МассивПараметров Цикл
		
		Результат = Неопределено;
		Попытка 
			Если Параметр = "Email" Тогда
				МассивЭлПочты = Получатель.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)); 
				Результат = ?(МассивЭлПочты.Количество() > 0, МассивЭлПочты[0].Представление, "");
			ИначеЕсли Параметр = "ДатаОкончанияМедицинскойСправки" Тогда
				МедСправкаКлиента = РегистрыСведений.МедицинскиеСправкиКлиентов.ПолучитьМедицинскуюСправкуКонтрагента(Получатель,, ТекущаяДатаСеанса());
				Результат = ?(МедСправкаКлиента <> Неопределено, Формат(МедСправкаКлиента.ДатаОкончания, "ДЛФ=ДД"), ""); 
			ИначеЕсли Параметр = "КороткийАдресКлиники" Тогда
				Адрес = Справочники.СтруктурныеЕдиницы.ПолучитьАдресСтруктурнойЕдиницы(Получатель.СтруктурнаяЕдиница, Справочники.ВидыКонтактнойИнформации.КороткийАдресСтруктурнойЕдиницы);
				Результат = ?(ЗначениеЗаполнено(Адрес), Адрес, "");
			ИначеЕсли Параметр = "ПолныйАдресКлиники" Тогда
				ПолныйАдрес = Справочники.СтруктурныеЕдиницы.ПолучитьАдресСтруктурнойЕдиницы(Получатель.СтруктурнаяЕдиница, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);
				Результат = ?(ЗначениеЗаполнено(ПолныйАдрес), ПолныйАдрес, ""); 
			ИначеЕсли Параметр = "СайтКлиники" Тогда	
				Сайт = Справочники.СтруктурныеЕдиницы.ПолучитьСайтСтруктурнойЕдиницы(Получатель.СтруктурнаяЕдиница);
				Результат = ?(ЗначениеЗаполнено(Сайт), Сайт, ""); 
			ИначеЕсли Параметр = "ЯндексКарты" Тогда	
				Сайт = Справочники.СтруктурныеЕдиницы.ПолучитьЯндексКартыСтруктурнойЕдиницы(Получатель.СтруктурнаяЕдиница);
				Результат = ?(ЗначениеЗаполнено(Сайт), Сайт, ""); 
	        ИначеЕсли Параметр = "ЯндексОтзывы" Тогда	
				Сайт = Справочники.СтруктурныеЕдиницы.ПолучитьЯндексОтзывыСтруктурнойЕдиницы(Получатель.СтруктурнаяЕдиница);
				Результат = ?(ЗначениеЗаполнено(Сайт), Сайт, ""); 
			ИначеЕсли Параметр = "ДатаОкончанияПолиса" ИЛИ Параметр = "СерияПолиса"	ИЛИ Параметр = "НомерПолиса" ИЛИ Параметр = "ЛимитПолиса" Тогда 
				Результат = "";
				Если ЗначениеЗаполнено(Документ.ДокументОснование) И ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.Событие") Тогда
					 ПолисМедСтрахования = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Документ.ДокументОснование, "ПолисМедСтрахования");
					 Если ЗначениеЗаполнено(ПолисМедСтрахования) Тогда 
						 Если Параметр = "ДатаОкончанияПолиса" Тогда
							 ДатаОкончания = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ПолисМедСтрахования, "ДатаОкончания");
							 Результат = ?(ЗначениеЗаполнено(ДатаОкончания), Формат(ДатаОкончания, "ДЛФ=DD"), "");
						ИначеЕсли Параметр = "СерияПолиса" Тогда	 
							 Результат = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ПолисМедСтрахования, "СерияПолиса"); 
						ИначеЕсли Параметр = "НомерПолиса" Тогда	 
							 Результат = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ПолисМедСтрахования, "НомерПолиса");
	                    ИначеЕсли Параметр = "ЛимитПолиса" Тогда	 
							 ЛимитПолиса = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ПолисМедСтрахования, "ЛимитПолиса"); 
							 Результат = ?(ЗначениеЗаполнено(ЛимитПолиса), Строка(ЛимитПолиса), "");
						КонецЕсли;
					 КонецЕсли;
				КонецЕсли; 			
			Иначе
				Выполнить("Результат = " + ВернутьПутьКРеквизитуПоПредставлении(Параметр));
			КонецЕсли;
		Исключение
			Ошибка = Истина;
		КонецПопытки; 		
		
		Если Карта <> Неопределено Тогда
			
			Если Найти(НРег(Параметр), "владелец") <> 0 Тогда
				
				Результат = СокрЛП(Карта.ВладелецКарты.Наименование);	
				
			ИначеЕсли Найти(НРег(Параметр), "датаоткрытия") <> 0 Тогда
				
				Результат = Формат(Карта.ДатаОткрытия, "ДФ=dd.MM.yyyy");
				
			ИначеЕсли Найти(НРег(Параметр), "номер") <> 0 Тогда
				
				Результат = СокрЛП(Карта.КодКарты); 

			ИначеЕсли Найти(НРег(Параметр), "наименование") <> 0 Тогда
				
				Результат = СокрЛП(Карта.Наименование);
				
			ИначеЕсли Новый_Массив("ссылканаустановкукарты", "ссылка").Найти(НРег(Параметр)) <> Неопределено Тогда
				
				Результат = ПолучитьСсылкуСозднанияКарты(Карта.СсылкаНаУстановкуКарты); 
				
			КонецЕсли;
		КонецЕсли;
		Если Результат <> Неопределено Тогда
			Содержание = СтрЗаменить(Содержание, "{" + Параметр + "}", Результат);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Содержание;
	
КонецФункции

// Функция, возвращает короткую ссылку на создание карты
//
Функция ПолучитьСсылкуСозднанияКарты(СсылкаНаУстановкуКарты)
	
	//link = СтрШаблон("https://webcitrus.app/getcard/%1/%2", ТокенДоступа, НомерКарты);  	
	
	ДеталиСсылки = Новый Структура;
	ДеталиСсылки.Вставить("domainUriPrefix", "https://glk.me");	
	ДеталиСсылки.Вставить("link", СсылкаНаУстановкуКарты);		
	
	ДанныеСсылки = Новый Структура("dynamicLinkInfo, suffix", ДеталиСсылки, Новый Структура("option", "SHORT"));	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто);		
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);	
	ЗаписатьJSON(ЗаписьJSON, ДанныеСсылки); 	
	ДанныеJSON = ЗаписьJSON.Закрыть();
	
	Попытка		
		HTTPСоединение = Новый HTTPСоединение("firebasedynamiclinks.googleapis.com",,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		ЗаголовкиHTTP  = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("Content-Type", "application/json");
		
		HTTPЗапрос = Новый HTTPЗапрос("/v1/shortLinks/?key=AIzaSyAoS1PL4lwzRZWxMlPY1fGex4OC1L65jhw", ЗаголовкиHTTP);
		HTTPЗапрос.УстановитьТелоИзСтроки(ДанныеJSON); 		
		
		Запрос = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		ТекстJSON  = Запрос.ПолучитьТелоКакСтроку();  
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстJSON);
		ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON); 
	Исключение		
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ПолучениеКороткойСсылки", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
		Возврат Неопределено;        
	КонецПопытки;
	
	Если Запрос.КодСостояния = 200 Тогда
		Возврат ПараметрыJSON.shortLink;
	Иначе
		ОписаниеОшибки = "Код состояния: " + Запрос.КодСостояния + Символы.ПС + ТекстJSON;
		ЗаписьЖурналаРегистрации("ПолучениеКороткойСсылки", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);		
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

// Функция - Получить массив параметров из шаблона.
//
Функция ПолучитьМассивПараметровИзШаблона(ФормулаШаблона, ЗнакиВыделения = "{}")
	
	МассивПараметров = Новый Массив;
	
	НачалоПараметра = 0;
	КонецПараметра	= 0;	
	
	ЕстьStyle			= СтрНайти(ФормулаШаблона, "<style") <> 0 И СтрНайти(ФормулаШаблона, "</style>") <> 0; 
	НачальноеЗначение	= ?(ЕстьStyle, СтрНайти(ФормулаШаблона, "</style>") + СтрДлина("</style>"), 1);
		
	Для а = НачальноеЗначение По СтрДлина(ФормулаШаблона) Цикл
		Если Сред(ФормулаШаблона, а, 1) = Сред(ЗнакиВыделения, 1, 1) Тогда
			НачалоПараметра = а + 1;
		ИначеЕсли Сред(ФормулаШаблона, а, 1) = Сред(ЗнакиВыделения, 2, 1) Тогда
			КонецПараметра = а - 1;			
		КонецЕсли;
		Если НачалоПараметра <> 0 И КонецПараметра <> 0 И (КонецПараметра - НачалоПараметра + 1) > 0 Тогда
			МассивПараметров.Добавить(Сред(ФормулаШаблона, НачалоПараметра, КонецПараметра - НачалоПараметра + 1));
			НачалоПараметра = 0;
			КонецПараметра = 0;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивПараметров;
	
КонецФункции

// Функция - Вернуть путь к реквизиту по представлении.
//
Функция ВернутьПутьКРеквизитуПоПредставлении(Наименование, ЭтоДокументОснование = Ложь)
		
	СписокПараметров = Новый СписокЗначений;
	СписокПараметров.Добавить("Фамилия"                         , "Получатель.Фамилия");
	СписокПараметров.Добавить("Имя"                             , "Получатель.Имя");
	СписокПараметров.Добавить("Отчество"                        , "Получатель.Отчество");
	СписокПараметров.Добавить("ФИО"                             , "Получатель.Наименование");  
	СписокПараметров.Добавить("День"                            , "Формат(Документ.ДокументОснование.Дата, ""ДФ='dd MMMM'"")");
	СписокПараметров.Добавить("Время"                           , "Формат(Документ.ДокументОснование.Дата, ""ДФ=HH:mm"")");
	СписокПараметров.Добавить("День и время"                    , "Формат(Документ.ДокументОснование.Дата, ""ДФ='dd MMMM HH:mm'"")");
	СписокПараметров.Добавить("Сотрудник"                       , "Документ.ДокументОснование.Врач");
	СписокПараметров.Добавить("Услуга"                          , "Документ.ДокументОснование.Номенклатура");
	СписокПараметров.Добавить("Структурная единица"             , "Документ.ДокументОснование.СтруктурнаяЕдиница");
	                                                
	СписокПараметров.Добавить("ФамилияПациента"            		, "Получатель.Фамилия");
	СписокПараметров.Добавить("ИмяПациента"            			, "Получатель.Имя");
	СписокПараметров.Добавить("ОтчествоПациента"				, "Получатель.Отчество");
	СписокПараметров.Добавить("НаименованиеПациента"            , "Получатель.Наименование");
	СписокПараметров.Добавить("ФИОПациента"                     , "Получатель.НаименованиеПолное"); 
	СписокПараметров.Добавить("НаименованиеПациентаСокращенное" , "Получатель.НаименованиеСокращенное");
	СписокПараметров.Добавить("ДатаРегистрации"           		, "Формат(Получатель.ДатаРегистрации, ""ДЛФ=ДД"")");
	СписокПараметров.Добавить("Клиника"        					, "Получатель.СтруктурнаяЕдиница.Наименование");
	СписокПараметров.Добавить("ДатаРожденияПациента"           	, "Формат(Получатель.ДатаРожденияКлиента, ""ДЛФ=ДД"")");
	СписокПараметров.Добавить("КураторФИО"            		    , "Получатель.Куратор.Наименование");
	СписокПараметров.Добавить("КураторИмя"            			, "Получатель.Куратор.Имя");
	СписокПараметров.Добавить("Телефон"            				, "Получатель.Телефон");  
	Результат = СписокПараметров.НайтиПоЗначению(Наименование);
	
	Если Результат <> Неопределено Тогда
		Возврат Результат.Представление;
	Иначе
		Возврат Наименование;
	КонецЕсли;
		
КонецФункции

// Функция - Получить шаблоны сообщений.
//
Функция ПолучитьШаблоныСообщений(ТипШаблона = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ШаблоныСообщений.Ссылка КАК Ссылка,
	|	ШаблоныСообщений.Наименование КАК Наименование,
	|	ШаблоныСообщений.Содержание КАК Содержание,
	|	ШаблоныСообщений.СодержаниеМессенджер КАК СодержаниеМессенджер
	|ИЗ
	|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|ГДЕ
	|	НЕ ШаблоныСообщений.ПометкаУдаления
	|	И НЕ ШаблоныСообщений.ЭтоГруппа
	|	И &УсловиеТипШаблона
	|
	|УПОРЯДОЧИТЬ ПО
	|	ШаблоныСообщений.Наименование");
	
	УсловиеТипШаблона = "";
	
	Если ТипШаблона = Перечисления.ТипыСобытий.Письмо Тогда
		УсловиеТипШаблона = "И (ВЫРАЗИТЬ(ШаблоныСообщений.ТекстHTML КАК СТРОКА(200))) <> """"";
	ИначеЕсли ТипШаблона = Перечисления.ТипыСобытий.SMS Тогда
		УсловиеТипШаблона = "И (ВЫРАЗИТЬ(ШаблоныСообщений.Содержание КАК СТРОКА(200))) <> """"";  
	ИначеЕсли ТипШаблона = Перечисления.ТипыСобытий.ПушУведомление Тогда
		УсловиеТипШаблона = "И (ВЫРАЗИТЬ(ШаблоныСообщений.СодержаниеPush КАК СТРОКА(200))) <> """"";  
	ИначеЕсли ТипШаблона = Перечисления.ТипыСобытий.Мессенджер Тогда
		УсловиеТипШаблона = "И (ВЫРАЗИТЬ(ШаблоныСообщений.СодержаниеМессенджер КАК СТРОКА(200))) <> """"";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеТипШаблона", УсловиеТипШаблона);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция - Получить таблицу параметров всех подставляемых реквизитов.
// 
// Возвращаемое значение:
//   - 
// Важно!!! Наименования параметров должны быть уникальны!
Функция ПолучитьТаблицуПараметровВсехПодставляемыхРеквизитов() Экспорт
	
	// Сформируем таблицу параметров всех представляемых реквизитов.
	
	// Важно!!! Наименования параметров должны быть уникальны!
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	ТаблицаПараметров = Новый ТаблицаЗначений;
	ТаблицаПараметров.Колонки.Добавить("НаименованиеПараметра"				, ТипСтрока);
	ТаблицаПараметров.Колонки.Добавить("ПредставлениеПараметра"				, ТипСтрока);
	ТаблицаПараметров.Колонки.Добавить("РеквизитПараметра"					, ТипСтрока);
	ТаблицаПараметров.Колонки.Добавить("ОсновнаяТаблицаОбъекта"				, ТипСтрока);
	ТаблицаПараметров.Колонки.Добавить("ВидОсновнойТаблицыОбъекта"			, ТипСтрока);
	ТаблицаПараметров.Колонки.Добавить("ОбъектПараметра"					, ТипСтрока);
	ТаблицаПараметров.Колонки.Добавить("ПредставлениеОсновнойТаблицаОбъекта", ТипСтрока);
	ТаблицаПараметров.Колонки.Добавить("ИзОсновнойТаблицы"					, ТипБулево);
	ТаблицаПараметров.Колонки.Добавить("ФорматПараметра"					, ТипСтрока);
	ТаблицаПараметров.Колонки.Добавить("ИнициализированВИсходнойТаблице"	, ТипБулево);

#Область ____________________________СТРУКТУРНЫЕ_ЕДИНИЦЫ____________________________

		
	ПредставлениеОсновное = НСтр("ru='Клиника'; en='Structural unit'");
		
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ПолныйАдресКлиники}", НСтр("ru='Фактический адрес клиники'; en='The actual address of the structural unit'"), "ФактическийАдресСтруктурнойЕдиницы", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));

	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{КороткийАдресКлиники}", НСтр("ru='Короткий адрес клиники'; en='Unit short address'"), "КороткийАдресСтруктурнойЕдиницы", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СайтКлиники}", НСтр("ru='Сайт клиники'; en='Structural unit site'"), "СайтСтруктурнойЕдиницы", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ЯндексКарты}", НСтр("ru='Яндекс Карты'; en='Yandex maps'"), "ЯндексКарты", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ЯндексОтзывы}", НСтр("ru='Яндекс Отзывы'; en='Yandex reviews'"), "ЯндексОтзывы", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));
	

#КонецОбласти
	
#Область _________________________________КЛИЕНТЫ___________________________________

	ПредставлениеОсновное = НСтр("ru='Пациент'; en='Patient'");
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ФамилияПациента}", НСтр("ru='Фамилия'; en='Surname'"), "Фамилия", "Контрагенты", "Справочник", "Контрагенты", ПредставлениеОсновное, Истина, "", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ИмяПациента}", НСтр("ru='Имя'; en='Name'"), "Имя", "Контрагенты", "Справочник", "Контрагенты", ПредставлениеОсновное, Истина, "", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ОтчествоПациента}", НСтр("ru='Отчество'; en='MiddleName'"), "Отчество", "Контрагенты", "Справочник", "Контрагенты", ПредставлениеОсновное, Истина, "", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ФИОПациента}", НСтр("ru='Наименование полное (Фамилия Имя Отчество)'; en='Full name'"), "Наименование", "Контрагенты", "Справочник", "Контрагенты", ПредставлениеОсновное, Истина, "", Ложь));
	
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{НаименованиеКонтрагентаСокращенное}", НСтр("ru='Наименование сокращенное (Фамилия И.О.)'; en='Name abbreviated'"), "НаименованиеСокращенное", "Контрагенты", "Справочник", "Контрагенты", ПредставлениеОсновное, Истина, "", Ложь));	
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{Телефон}", НСтр("ru='Телефон'; en='Phone'"), "Телефон", "Контрагенты", "Справочник", "Контрагенты", ПредставлениеОсновное, Истина, "", Ложь));	
	
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{Email}", НСтр("ru='Email'; en='Email'"), "Email", "Контрагенты", "Справочник", "Контрагенты", ПредставлениеОсновное, Ложь, "", Ложь));	
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ДатаРегистрации}", НСтр("ru='Дата регистрации (dd.MM.yyyy)'; en='Date registration (dd.MM.yyyy)'"), "ДатаРегистрации", "Контрагенты", "Справочник", "Контрагенты", ПредставлениеОсновное, Истина, "ДФ=dd.MM.yyyy; ДЛФ=D", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{Клиника}", НСтр("ru='Клиника'; en='Clinic'"), "СтруктурнаяЕдиница", "Контрагенты", "Справочник", "Контрагенты", ПредставлениеОсновное, Истина, "", Ложь));	
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ДатаРожденияПациента}", НСтр("ru='Дата рождения'; en='Date of birth'"), "ДатаРожденияКлиента", "Контрагенты", "Справочник", "Контрагенты", ПредставлениеОсновное, Истина, "ДЛФ=DD", Ложь));
	
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ДатаОкончанияМедицинскойСправки}", НСтр("ru='Дата окончания медицинской справки'; en='End date of a medical certificate'"), "ДатаОкончания", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "ДЛФ=DD", Истина));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{КураторФИО}", НСтр("ru='Куратор (Фамилия Имя Отчество)'; en='Manager (Full name)'"), "Куратор", "Контрагенты", "Справочник", "Контрагенты", ПредставлениеОсновное, Истина, "", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{КураторИмя}", НСтр("ru='Куратор (Имя)'; en='Doctor (Name)'"), "Куратор.Имя", "Контрагенты", "Справочник", "Контрагенты", ПредставлениеОсновное, Истина, "", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ДатаОкончанияПолиса}", НСтр("ru='Дата окончания полиса'; en='End date of a medical certificate'"), "ДатаОкончания", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "ДЛФ=DD", Истина));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СерияПолиса}", НСтр("ru='Серия полиса'; en='Серия полиса'"), "СерияПолиса", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));

	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{НомерПолиса}", НСтр("ru='Номер полиса'; en='Номер полиса'"), "НомерПолиса", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ЛимитПолиса}", НСтр("ru='Лимит полиса'; en='Лимит полиса'"), "ЛимитПолиса", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "ЧДЦ=2; ЧН=0,00", Истина));		
	
#КонецОбласти

#Область _________________________________ЗАЯВКИ____________________________________

	Если ОбщегоНазначенияПовтИсп.ЭтоВерсияКОРП() Тогда
		
		//ПредставлениеОсновное = НСтр("ru='Заявка'; en='Proposal'");
		//
		//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ДатаСоздания}", НСтр("ru='Дата создания'; en='Date of creation'"), "ДатаСоздания", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "ДЛФ=DDT", Истина));
		//
		//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{Фамилия}", НСтр("ru='Фамилия'; en='Surname'"), "Фамилия", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));
		//
		//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{Имя}", НСтр("ru='Имя'; en='Name'"), "Имя", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));
		//	
		//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{Отчество}", НСтр("ru='Отчество'; en='Middle name'"), "Отчество", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));
		//
		//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{НомерТелефона}", НСтр("ru='Номер телефона'; en='Phone number'"), "НомерТелефона", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));
		
	КонецЕсли;
	
#КонецОбласти

#Область _________________________________СДЕЛКИ____________________________________

	Если ОбщегоНазначенияПовтИсп.ЭтоВерсияКОРП() Тогда
		
		//ПредставлениеОсновное = НСтр("ru='Сделка'; en='Deal'");
		//
		//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ДатаСозданияСделки}", НСтр("ru='Дата создания сделки (dd.MM.yyyy)'; en='Deal creation data (dd.MM.yyyy)'"), "ДатаСделки", "Сделки", "Справочник", "Сделки", ПредставлениеОсновное, Истина, "ДФ=dd.MM.yyyy; ДЛФ=D", Ложь));
		//
		//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ВидСделки}", НСтр("ru='Вид сделки'; en='Type of deal'"), "ВидСделки", "Сделки", "Справочник", "Сделки", ПредставлениеОсновное, Истина, "", Ложь));
		//
		//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ЭтапСделки}", НСтр("ru='Этап сделки'; en='Stage of deal'"), "ЭтапСделки", "Сделки", "Справочник", "Сделки", ПредставлениеОсновное, Истина, "", Ложь));
		//
		//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СуммаСделки}", НСтр("ru='Сумма сделки'; en='Amount of deal'"), "СуммаСделки", "Сделки", "Справочник", "Сделки", ПредставлениеОсновное, Истина, "ЧДЦ=2; ЧН=0,00", Ложь));
		//
		//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{АвторСделки}", НСтр("ru='Автор сделки'; en='Author of deal'"), "Автор", "Сделки", "Справочник", "Сделки", ПредставлениеОсновное, Истина, "", Ложь));
		//
		//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{КураторСделки}", НСтр("ru='Куратор'; en='Manager'"), "Менеджер", "Сделки", "Справочник", "Сделки", ПредставлениеОсновное, Истина, "", Ложь));
		//		
		//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ДатаЗавершенияСделки}", НСтр("ru='Дата завершения сделки (dd.MM.yyyy)'; en='Date complete deal (dd.MM.yyyy)'"), "ДатаЗавершенияСделки", "Сделки", "Справочник", "Сделки", ПредставлениеОсновное, Истина, "ДФ=dd.MM.yyyy; ДЛФ=D", Ложь));
		//
		//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{РезультатСделки}", НСтр("ru='Результат сделки'; en='Result of deal'"), "РезультатСделки", "Сделки", "Справочник", "Сделки", ПредставлениеОсновное, Истина, "", Ложь));
		//
		//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СтруктурнаяЕдиница}", НСтр("ru='Структурная единица'; en='Structural unit'"), "СтруктурнаяЕдиница", "Сделки", "Справочник", "Сделки", ПредставлениеОсновное, Истина, "", Ложь));	
	
	КонецЕсли;
	
#КонецОбласти

#Область ______________________________ЛИЦЕВЫЕ_СЧЕТА________________________________

	ПредставлениеОсновное = НСтр("ru='Лицевой счет'; en='Personal account'");
	
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ДатаОткрытияЛицевогоСчета}", НСтр("ru='Дата открытия (dd.MM.yyyy)'; en='Date discoveries (dd.MM.yyyy)'"), "ДатаОткрытия", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "ДФ=dd.MM.yyyy; ДЛФ=D", Истина));
	
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ДатаОкончанияДействияЛицевогоСчета}", НСтр("ru='Действует до (dd.MM.yyyy)'; en='Term actions (dd.MM.yyyy)'"), "СрокДействияКонец", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "ДФ=dd.MM.yyyy; ДЛФ=D; ДП=Бессрочный", Истина));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СуммаВзносаНаЛицевойСчет}", НСтр("ru='Сумма взноса на лицевой счет'; en='The amount of the deposit to the personal account'"), "СуммаВзноса", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "ЧДЦ=2; ЧН=0,00", Истина));		
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СуммаСписанияСЛицевогоСчета}", НСтр("ru='Сумма списания с лицевого счета'; en='Amount debited from the personal account'"), "СуммаСписания", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "ЧДЦ=2; ЧН=0,00", Истина));	
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ОстатокНаЛицевомСчету}", НСтр("ru='Остаток денежных средств на лицевом счёте'; en='Personal account balance'"), "Остаток", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "ЧДЦ=2; ЧН=0,00", Истина));
	
#КонецОбласти

#Область _____________________________БОНУСНЫЕ_СЧЕТА________________________________

	//ПредставлениеОсновное = НСтр("ru='Бонусный счет'; en='Bonus account'");
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ДатаОткрытияБонусногоСчета}", НСтр("ru='Дата открытия (dd.MM.yyyy)'; en='Date discoveries (dd.MM.yyyy)'"), "ДатаОткрытия", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "ДФ=dd.MM.yyyy; ДЛФ=D", Истина));
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ДатаОкончанияДействияБонусногоСчета}", НСтр("ru='Действует до (dd.MM.yyyy)'; en='Term actions (dd.MM.yyyy)'"), "СрокДействияКонец", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "ДФ=dd.MM.yyyy; ДЛФ=D; ДП=Бессрочный", Истина));
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СуммаЗачисленияНаБонусныйСчет}", НСтр("ru='Сумма зачисления на бонусный счет'; en='Amount credited to the bonus account'"), "СуммаНачисления", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "ЧДЦ=2; ЧН=0,00", Истина));		
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СуммаСписанияСЛицевогоСчета}", НСтр("ru='Сумма списания с бонусного счета'; en='Amount to be debited from the bonus account'"), "СуммаСписания", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "ЧДЦ=2; ЧН=0,00", Истина));	
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ОстатокНаЛицевомСчету}", НСтр("ru='Остаток денежных средств на бонусном счёте'; en='The balance of funds on the bonus account'"), "Остаток", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "ЧДЦ=2; ЧН=0,00", Истина));
	
#КонецОбласти

#Область _________________________________ПРОДАЖИ___________________________________

	//ПредставлениеОсновное = НСтр("ru='Продажа'; en='Sale'");
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ДатаПродажи}", НСтр("ru='Дата продажи (dd.MM.yyyy)'; en='Date of sale (dd.MM.yyyy)'"), "Дата", "Реализация", "Документ", "Реализация", ПредставлениеОсновное, Истина, "ДФ=dd.MM.yyyy; ДЛФ=D", Ложь));
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ДоговорПродажи}", НСтр("ru='Договор'; en='Contract'"), "Договор", "Реализация", "Документ", "Реализация", ПредставлениеОсновное, Истина, "", Ложь));
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СуммаДокумента}", НСтр("ru='Сумма документа'; en='Document amount'"), "СуммаДокумента", "Реализация", "Документ", "Реализация", ПредставлениеОсновное, Истина, "ЧДЦ=2; ЧН=0,00", Ложь));
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СтруктурнаяЕдиницаПродажи}", НСтр("ru='Структурная единица'; en='Structural unit'"), "СтруктурнаяЕдиница", "Реализация", "Документ", "Реализация", ПредставлениеОсновное, Истина, "", Ложь));
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ОрганизацияПродажи}", НСтр("ru='Организация'; en='Organization'"), "Организация", "Реализация", "Документ", "Реализация", ПредставлениеОсновное, Истина, "", Ложь));
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ОписаниеПокупки}", НСтр("ru='Описание покупки'; en='Description of the purchase'"), "НоменклатураНаименование", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СсылкаНаОплату}", НСтр("ru='Ссылка на оплату'; en='Payment link'"), "", "Реализация", "Документ", "Реализация", ПредставлениеОсновное, Истина, "", Истина));
	
#КонецОбласти

#Область _______________________СОБЫТИЯ_ПО_ЛИСТУ_ОЖИДАНИЯ___________________________

	ПредставлениеОсновное = НСтр("ru='Планирование приёмов (лист ожидания)'; en='Scheduling appointments (waiting list)'");
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ДатаЗапланированнаяПоЛистуОжидания}", НСтр("ru='Запланированная дата (dd.MM.yyyy)'; en='Scheduled date (dd.MM.yyyy)'"), "ДатаЗапланированная", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "ДФ=dd.MM.yyyy; ДЛФ=D", Истина));
		
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ВрачПоЛистуОжиданияНаПриемФИО}", НСтр("ru='Врач (ФИО)'; en='Employee providing the service'"), "Сотрудник", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));
		
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ВрачПоЛистуОжиданияНаПриемФамилия}", НСтр("ru='Врач (Фамилия)'; en='Employee providing the service (last Name)'"), "Сотрудник.Фамилия", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ВрачПоЛистуОжиданияНаПриемИмя}", НСтр("ru='Врач (Имя)'; en='Employee providing the service (Name)'"), "Сотрудник.Имя", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ВрачПоЛистуОжиданияНаПриемОтчество}", НСтр("ru='Врач (Отчество)'; en='Employee providing the service (middle Name)'"), "Сотрудник.Отчество", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));
			
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{КлиникаПоЛистуОжидания}", НСтр("ru='Клиника'; en='Clinic'"), "СтруктурнаяЕдиница", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ПричинаНаправленияНаЗапись}", НСтр("ru='Причина направления'; en='Reason for referral'"), "ПричинаНаправления", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));

	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{КомментарийПланированияЗаписиПоЛистуОжидания}", НСтр("ru='Комментарий'; en='Comment'"), "Комментарий", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));
		
#КонецОбласти

#Область ___________________________СОБЫТИЯ_ПО_ЗАПИСЯМ______________________________

	ПредставлениеОсновное = НСтр("ru='Запись на приём'; en='Appointments'");
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ДатаЗаписи}", НСтр("ru='Дата записи (dd.MM.yyyy)'; en='Date of recording (dd.MM.yyyy)'"), "Дата", "Событие", "Документ", "Событие", ПредставлениеОсновное, Истина, "ДФ=dd.MM.yyyy; ДЛФ=D", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ВремяНачалаЗаписьПриема}", НСтр("ru='Время начала приёма (HH:mm)'; en='Start time of reception (HH:mm)'"), "Дата", "Событие", "Документ", "Событие", ПредставлениеОсновное, Истина, "ДФ=HH:mm", Ложь));
	
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ВремяОкончанияЗанятия}", НСтр("ru='Время окончания занятия (HH:mm)'; en='Class end time (HH:mm)'"), "ДатаВремяОкончания", "Занятие", "Документ", "Занятие", ПредставлениеОсновное, Истина, "ДФ=HH:mm", Ложь));
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СсылкаНаКонференцию}", НСтр("ru='Ссылка на конференцию'; en='Link to the conference'"), "СсылкаНаПодключениеКТренировке", "Занятие", "Документ", "Занятие", ПредставлениеОсновное, Истина, "", Ложь));
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СсылкаНаОценкуИОтзыв}", НСтр("ru='Ссылка на оценку и отзыв (актуально только для триггера ""Занятие проведено"")'; en='Link to rating and review'"), "СсылкаНаОценкуИОтзыв", "", "", "", ПредставлениеОсновное, Ложь, "", Истина));
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СсылкаНаИнформациюОЗаписиНаЗанятие}", НСтр("ru='Ссылка на информацию о записи на занятие'; en='Link to lesson enrollment information'"), "СсылкаНаИнформациюОЗаписиНаЗанятие", "", "", "", ПредставлениеОсновное, Ложь, "", Истина));
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ИдентификаторКонференции}", НСтр("ru='Идентификатор конференции'; en='The conference ID'"), "СсылкаНаПодключениеКТренировке", "Занятие", "Документ", "Занятие", ПредставлениеОсновное, Истина, "ЧВН=; ЧГ=3,0; ЧФ=Ч", Ложь));

	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{Услуга}", НСтр("ru='Услуга'; en='Service'"), "Номенклатура", "Занятие", "Документ", "Занятие", ПредставлениеОсновное, Истина, "", Ложь));
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{Помещение}", НСтр("ru='Помещение'; en='Room'"), "Помещение", "Занятие", "Документ", "Занятие", ПредставлениеОсновное, Истина, "", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ВрачЗаписиНаПриемФИО}", НСтр("ru='Врач (ФИО)'; en='Employee providing the service'"), "Врач", "Событие", "Документ", "Событие", ПредставлениеОсновное, Истина, "", Ложь));
		
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ВрачЗаписиНаПриемФамилия}", НСтр("ru='Врач (Фамилия)'; en='Employee providing the service (last Name)'"), "Врач.Фамилия", "Событие", "Документ", "Событие", ПредставлениеОсновное, Истина, "", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ВрачЗаписиНаПриемИмя}", НСтр("ru='Врач (Имя)'; en='Employee providing the service (Name)'"), "Врач.Имя", "Событие", "Документ", "Событие", ПредставлениеОсновное, Истина, "", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ВрачЗаписиНаПриемОтчество}", НСтр("ru='Врач (Отчество)'; en='Employee providing the service (middle Name)'"), "Врач.Отчество", "Событие", "Документ", "Событие", ПредставлениеОсновное, Истина, "", Ложь));
	
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{Ассистент}", НСтр("ru='Ассистент'; en='Assistant'"), "Ассистент", "Занятие", "Документ", "Занятие", ПредставлениеОсновное, Истина, "", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СтатусЗаписи}", НСтр("ru='Статус записи'; en='Recording status'"), "Статус", "Событие", "Документ", "Событие", ПредставлениеОсновное, Истина, "", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{КлиникаЗаписи}", НСтр("ru='Клиника'; en='Clinic'"), "СтруктурнаяЕдиница", "Событие", "Документ", "Событие", ПредставлениеОсновное, Истина, "", Ложь));
	
#КонецОбласти

#Область _________________________________ПРИЕМЫ____________________________________

	ПредставлениеОсновное = НСтр("ru='Приемы'; en='Receptions'");
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ДатаПриема}", НСтр("ru='Дата приема (dd.MM.yyyy)'; en='Date of receipt (dd.MM.yyyy)'"), "Дата", "Прием", "Документ", "Прием", ПредставлениеОсновное, Истина, "ДФ=dd.MM.yyyy; ДЛФ=D", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ВремяНачалаПриема}", НСтр("ru='Время начала приёма (HH:mm)'; en='Start time of reception (HH:mm)'"), "ВремяНачалаПриема", "Прием", "Документ", "Прием", ПредставлениеОсновное, Истина, "ДФ=HH:mm", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ВремяОкончанияПриема}", НСтр("ru='Время окончания приема (HH:mm)'; en='End time of reception (HH:mm)'"), "ВремяОкончанияПриема", "Прием", "Документ", "Прием", ПредставлениеОсновное, Истина, "ДФ=HH:mm", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СотрудникПриемаФИО}", НСтр("ru='Врач (ФИО)'; en='Employee providing the service'"), "Сотрудник", "Прием", "Документ", "Прием", ПредставлениеОсновное, Истина, "", Ложь));
		
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СотрудникПриемаФамилия}", НСтр("ru='Врач (Фамилия)'; en='Employee providing the service (last Name)'"), "Сотрудник.Фамилия", "Прием", "Документ", "Прием", ПредставлениеОсновное, Истина, "", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СотрудникПриемаИмя}", НСтр("ru='Врач (Имя)'; en='Employee providing the service (Name)'"), "Сотрудник.Имя", "Прием", "Документ", "Прием", ПредставлениеОсновное, Истина, "", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СотрудникПриемаОтчество}", НСтр("ru='Врач (Отчество)'; en='Employee providing the service (middle Name)'"), "Сотрудник.Отчество", "Прием", "Документ", "Прием", ПредставлениеОсновное, Истина, "", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{АссистентПриема}", НСтр("ru='Ассистент'; en='Assistant'"), "Ассистент", "Прием", "Документ", "Прием", ПредставлениеОсновное, Истина, "", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СуммаПриема}", НСтр("ru='Сумма приема'; en='Admission amount'"), "СуммаДокумента", "Прием", "Документ", "Прием", ПредставлениеОсновное, Истина, "ЧДЦ=2; ЧН=0,00", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{КлиникаПриема}", НСтр("ru='Клиника'; en='Clinic'"), "СтруктурнаяЕдиница", "Прием", "Документ", "Прием", ПредставлениеОсновное, Истина, "", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ОценкаПриема}", НСтр("ru='Оценка приёма'; en='Admission score'"), "Оценка", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));
	
#КонецОбласти

#Область ______________________________ПЛАНЫ_ЛЕЧЕНИЯ________________________________

	ПредставлениеОсновное = НСтр("ru='Планы лечения'; en='Treatment plans'");
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ДатаПланаЛечения}", НСтр("ru='Дата плана лечения (dd.MM.yyyy)'; en='Date of receipt (dd.MM.yyyy)'"), "Дата", "ПланЛечения", "Документ", "ПланЛечения", ПредставлениеОсновное, Истина, "ДФ=dd.MM.yyyy; ДЛФ=D", Ложь));
		
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СотрудникПланаЛеченияФИО}", НСтр("ru='Врач (ФИО)'; en='Employee providing the service'"), "Сотрудник", "ПланЛечения", "Документ", "ПланЛечения", ПредставлениеОсновное, Истина, "", Ложь));
		
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СотрудникПланаЛеченияФамилия}", НСтр("ru='Врач (Фамилия)'; en='Employee providing the service (last Name)'"), "Сотрудник.Фамилия", "ПланЛечения", "Документ", "ПланЛечения", ПредставлениеОсновное, Истина, "", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СотрудникПланаЛеченияИмя}", НСтр("ru='Врач (Имя)'; en='Employee providing the service (Name)'"), "Сотрудник.Имя", "ПланЛечения", "Документ", "ПланЛечения", ПредставлениеОсновное, Истина, "", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СотрудникПланаЛеченияОтчество}", НСтр("ru='Врач (Отчество)'; en='Employee providing the service (middle Name)'"), "Сотрудник.Отчество", "ПланЛечения", "Документ", "ПланЛечения", ПредставлениеОсновное, Истина, "", Ложь));
		
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СуммаПланаЛечения}", НСтр("ru='Сумма плана лечения'; en='The amount of the treatment plan'"), "СуммаДокумента", "ПланЛечения", "Документ", "ПланЛечения", ПредставлениеОсновное, Истина, "ЧДЦ=2; ЧН=0,00", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{КлиникаПланаЛечения}", НСтр("ru='Клиника'; en='Clinic'"), "СтруктурнаяЕдиница", "ПланЛечения", "Документ", "ПланЛечения", ПредставлениеОсновное, Истина, "", Ложь));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СтатусПланаЛечения}", НСтр("ru='Статус плана лечения'; en='Treatment plan status'"), "Статус", "ПланЛечения", "Документ", "ПланЛечения", ПредставлениеОсновное, Истина, "", Ложь));
	
#КонецОбласти

#Область ______________________________ЗАДОЛЖЕННОСТИ________________________________

	//ПредставлениеОсновное = НСтр("ru='Задолженность по рассрочке'; en='Installment debt'");
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{НомерПлатежа}", НСтр("ru='Номер платежа'; en='Number payment'"), "НомерПлатежа", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ДатаПлатежаПлан}", НСтр("ru='Дата платежа план (dd.MM.yyyy)'; en='Plan payment date (dd.MM.yyyy)'"), "ДатаПлатежаПлан", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "ДФ=dd.MM.yyyy", Истина));
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СуммаПлатежаПлан}", НСтр("ru='Сумма платежа план'; en='Plan payment amount'"), "СуммаПлатежаПлан", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "ЧДЦ=2; ЧН=0,00", Истина));
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ПроцентПлатежаПлан}", НСтр("ru='Процент платежа план'; en='Plan payment percentage'"), "ПроцентПлатежаПлан", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "", Истина));
	//
	//ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СуммаПлатежаФакт}", НСтр("ru='Сумма платежа факт'; en='Actual payment amount'"), "СуммаПлатежаФакт", "ТаблицаДанныхОбъекта", "", "ТаблицаДанныхОбъекта", ПредставлениеОсновное, Истина, "ЧДЦ=2; ЧН=0,00", Истина));
	
#КонецОбласти 

#Область _______________________ДАТА_ОКОНЧЧАНИЯ_МЕД_ПОЛИСА__________________________

	 //ПредставлениеОсновное = НСтр("ru='Полис мед. страхования'; en='health insurance policy'");
	 //ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ДатаОкончанияСрокаДействияПолиса}", НСтр("ru='Дата окончания срока действия полиса (dd.MM.yyyy)'; en='Policy expiration date (dd.MM.yyyy)'"), "ДатаОкончания", "ПолисыМедицинскогоСтрахования", "Справочник", "ПолисыМедицинскогоСтрахования", ПредставлениеОсновное, Истина, "ДФ=dd.MM.yyyy; ДЛФ=D", Истина));
	 	 
#КонецОбласти   

#Область ______________________________КАРТЫ_КЛИЕНТОВ_______________________________

	ПредставлениеОсновное = НСтр("ru='Карта пациента'; en='Patient card'");
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{Владелец}", НСтр("ru='Владелец'; en='Owner'"), "ВладелецКарты", "Карты", "Справочник", "Карты", ПредставлениеОсновное, Истина, "", Истина));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{ДатаОткрытия}", НСтр("ru='Дата открытия'; en='Opening date'"), "ДатаОткрытия", "Карты", "Справочник", "Карты", ПредставлениеОсновное, Истина, "ДФ=dd.MM.yyyy", Истина));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{Наименование}", НСтр("ru='Наименование'; en='Name'"), "Наименование", "Карты", "Справочник", "Карты", ПредставлениеОсновное, Истина, "", Истина));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{Номер}", НСтр("ru='Номер'; en='Number'"), "КодКарты", "Карты", "Справочник", "Карты", ПредставлениеОсновное, Истина, "", Истина));
	
	ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СформироватьСтруктуруПараметров("{СсылкаНаУстановкуКарты}", НСтр("ru='Ссылка на установку карты'; en='Link to install map'"), "СсылкаНаУстановкуКарты", "Карты", "Справочник", "Карты", ПредставлениеОсновное, Истина, "", Истина));
	
#КонецОбласти 

	Возврат ТаблицаПараметров;
	
КонецФункции	

// Функция - Сформировать структуру параметров.
//
// Параметры:
//  НаименованиеПараметра				 - 	 - 
//  ПредставлениеПараметра				 - 	 - 
//  РеквизитПараметра					 - 	 - 
//  ОсновнаяТаблицаОбъекта				 - 	 - 
//  ВидОсновнойТаблицыОбъекта			 - 	 - 
//  ОбъектПараметра						 - 	 - 
//  ПредставлениеОсновнойТаблицаОбъекта	 - 	 - 
//  ИзОсновнойТаблицы					 - 	 - 
//  ФорматПараметра						 - 	 - 
//  ИнициализированВИсходнойТаблице		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьСтруктуруПараметров(
	НаименованиеПараметра,
	ПредставлениеПараметра,
	РеквизитПараметра,
	ОсновнаяТаблицаОбъекта,
	ВидОсновнойТаблицыОбъекта,
	ОбъектПараметра,
	ПредставлениеОсновнойТаблицаОбъекта,
	ИзОсновнойТаблицы,
	ФорматПараметра,
	ИнициализированВИсходнойТаблице)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НаименованиеПараметра"              , НаименованиеПараметра);
	СтруктураПараметров.Вставить("ПредставлениеПараметра"             , ПредставлениеПараметра);
	СтруктураПараметров.Вставить("РеквизитПараметра"                  , РеквизитПараметра);
	СтруктураПараметров.Вставить("ОсновнаяТаблицаОбъекта"             , ОсновнаяТаблицаОбъекта);
	СтруктураПараметров.Вставить("ВидОсновнойТаблицыОбъекта"          , ВидОсновнойТаблицыОбъекта);
	СтруктураПараметров.Вставить("ОбъектПараметра"                    , ОбъектПараметра);
	СтруктураПараметров.Вставить("ПредставлениеОсновнойТаблицаОбъекта", ПредставлениеОсновнойТаблицаОбъекта);
	СтруктураПараметров.Вставить("ИзОсновнойТаблицы"                  , ИзОсновнойТаблицы);
	СтруктураПараметров.Вставить("ФорматПараметра"                    , ФорматПараметра);
	СтруктураПараметров.Вставить("ИнициализированВИсходнойТаблице"    , ИнициализированВИсходнойТаблице);
	
	Возврат СтруктураПараметров;
	
КонецФункции

// Функция - Шаблон используется в триггерных событиях
//
// Параметры:
//  ШаблонСообщений	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ШаблонИспользуетсяВТриггерныхСобытиях(ШаблонСообщений) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ШаблонСообщений) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	               |	ТриггерныеСобытияДействия.Ссылка КАК Шаблон
	               |ИЗ
	               |	Справочник.ТриггерныеСобытия.Действия КАК ТриггерныеСобытияДействия
	               |ГДЕ
	               |	ТриггерныеСобытияДействия.ШаблонСообщения = &ШаблонСообщения";
	
	Запрос.УстановитьПараметр("ШаблонСообщения", ШаблонСообщений);
	
	ВыборкаШаблон = Запрос.Выполнить().Выбрать();

	Возврат ВыборкаШаблон.Следующий();
	
КонецФункции

// Функция - Вернуть массив некорректных параметров
//
// Параметры:
//  Содержание	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьМассивНекорректныхПараметров(Содержание) Экспорт 
	
	МассивНеКорректныхПараметров = Новый Массив;
	СимволНачалаПараметра = 1;
	СимволКонцаПараметра = 1;
	Пока СимволНачалаПараметра <> 0 ИЛИ СимволКонцаПараметра <> 0 Цикл 
		СимволНачалаПараметра = СтрНайти(Содержание, "{");
		Если СимволНачалаПараметра <> 0 Тогда 
			СимволКонцаПараметра = СтрНайти(Содержание, "}", , СимволНачалаПараметра);
			Если СимволКонцаПараметра <> 0 И СимволКонцаПараметра > СимволНачалаПараметра Тогда
				НекорректныйПараметр = Сред(Содержание, СимволНачалаПараметра, (СимволКонцаПараметра - СимволНачалаПараметра) + 1);
				Содержание = СтрЗаменить(Содержание, НекорректныйПараметр, "");
				МассивНеКорректныхПараметров.Добавить(НекорректныйПараметр);
			Иначе
				НекорректныйПараметр = Сред(Содержание, СимволНачалаПараметра, 1);								
				Содержание = СтрЗаменить(Содержание, НекорректныйПараметр, "");				
				МассивНеКорректныхПараметров.Добавить(НекорректныйПараметр);
			КонецЕсли;
		Иначе 
			СимволКонцаПараметра = СтрНайти(Содержание, "}");
			Если СимволКонцаПараметра <> 0 Тогда
				НекорректныйПараметр = Сред(Содержание, СимволКонцаПараметра, 1);				
				Содержание = СтрЗаменить(Содержание, НекорректныйПараметр, "");				
				МассивНеКорректныхПараметров.Добавить(НекорректныйПараметр);
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;	
	
	Возврат МассивНеКорректныхПараметров;
	
КонецФункции

// Процедура - Актуализировать параметры шаблона
//
// Параметры:
//  Шаблон	 - 	 - 
//
Процедура АктуализироватьПараметрыШаблона(Шаблон) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Шаблон) Тогда 
		Возврат;
	КонецЕсли;
	
	НеобходимоЗаписать = Ложь;
	
	ШаблонОбъект 					= Шаблон.ПолучитьОбъект();
	ТаблицаВсехПараметров 			= ОбщегоНазначенияПовтИсп.ПолучитьТаблицуПараметровВсехПодставляемыхРеквизитов();
	Содержание_Проверочное 			= ШаблонОбъект.Содержание;
	ПарсерHTML 						= Новый ЧтениеHTML;
	ПарсерHTML.УстановитьСтроку(ШаблонОбъект.ТекстHTML);
	ПостроительDOM 					= Новый ПостроительDOM;
	ДокументHTML 					= ПостроительDOM.Прочитать(ПарсерHTML);
	Если ДокументHTML.Тело = Неопределено Тогда 
		ТекстHTML_Проверочное 		= "";
	Иначе 	
		ТекстHTML_Проверочное 		= ДокументHTML.Тело.ТекстовоеСодержимое;
	КонецЕсли;	
	ЗадачаОписание_Проверочное 		= ШаблонОбъект.ЗадачаОписание;
	
	Для Каждого СтрокаТаблицы Из ТаблицаВсехПараметров Цикл
		Содержание_Проверочное 		= СтрЗаменить(Содержание_Проверочное	, СтрокаТаблицы.НаименованиеПараметра, ""); 
		ТекстHTML_Проверочное 		= СтрЗаменить(ТекстHTML_Проверочное		, СтрокаТаблицы.НаименованиеПараметра, ""); 
		ЗадачаОписание_Проверочное 	= СтрЗаменить(ЗадачаОписание_Проверочное, СтрокаТаблицы.НаименованиеПараметра, ""); 
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(СокрЛП(Содержание_Проверочное)) Тогда 
		МассивНеКорректныхПараметров = ВернутьМассивНекорректныхПараметров(Содержание_Проверочное);
		Для Каждого НекорректныйПараметр Из МассивНеКорректныхПараметров Цикл 
			ШаблонОбъект.Содержание = СтрЗаменить(ШаблонОбъект.Содержание, НекорректныйПараметр, "");
			НеобходимоЗаписать = Истина;
		КонецЦикла;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СокрЛП(ТекстHTML_Проверочное)) Тогда 
		МассивНеКорректныхПараметров = ВернутьМассивНекорректныхПараметров(ТекстHTML_Проверочное);
		Для Каждого НекорректныйПараметр Из МассивНеКорректныхПараметров Цикл 
			ШаблонОбъект.ТекстHTML = СтрЗаменить(ШаблонОбъект.ТекстHTML, НекорректныйПараметр, ""); 
			НеобходимоЗаписать = Истина;			
		КонецЦикла;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СокрЛП(ЗадачаОписание_Проверочное)) Тогда 
		МассивНеКорректныхПараметров = ВернутьМассивНекорректныхПараметров(ЗадачаОписание_Проверочное);
		Для Каждого НекорректныйПараметр Из МассивНеКорректныхПараметров Цикл 
			ШаблонОбъект.ЗадачаОписание = СтрЗаменить(ШаблонОбъект.ЗадачаОписание, НекорректныйПараметр, ""); 
			НеобходимоЗаписать = Истина;			
		КонецЦикла;	
	КонецЕсли;
	
	Если НеобходимоЗаписать Тогда 
		Попытка
			ШаблонОбъект.ОбменДанными.Загрузка = Истина;
			ШаблонОбъект.Записать();
		Исключение
			
		КонецПопытки;	
	КонецЕсли;
	
КонецПроцедуры

// Функция - Инициализировать шаблон сообщения
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
//  ГенерироватьШаблон	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения(НаименованиеШаблона, НаименованиеРодителя = "", ГенерироватьШаблон = Истина) Экспорт

	НаименованиеШаблона = СокрЛП(НаименованиеШаблона);
	Если НЕ ЗначениеЗаполнено(НаименованиеШаблона) Тогда 
		Возврат ПустаяСсылка();
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеШаблонаТочноеПопадание"	, СокрЛ(НаименованиеШаблона));		
	Запрос.УстановитьПараметр("НаименованиеШаблона"					, СокрЛ(НаименованиеШаблона) + "%");
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВложенныйЗапрос.Ссылка КАК ШаблонСообщения,
	|	ВложенныйЗапрос.Ссылка.Родитель КАК Родитель
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		ШаблоныСообщений.Ссылка КАК Ссылка,
	|		1 КАК Приоритет
	|	ИЗ
	|		Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|	ГДЕ
	|		ШаблоныСообщений.Наименование ПОДОБНО &НаименованиеШаблонаТочноеПопадание
	|		И ШаблоныСообщений.ПометкаУдаления = ЛОЖЬ
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ ПЕРВЫЕ 1
	|		ШаблоныСообщений.Ссылка,
	|		2
	|	ИЗ
	|		Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|	ГДЕ
	|		ШаблоныСообщений.Наименование ПОДОБНО &НаименованиеШаблона
	|		И ШаблоныСообщений.ПометкаУдаления = ЛОЖЬ
	|	
	|	УПОРЯДОЧИТЬ ПО
	|		Приоритет) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Приоритет";
	
	ВыборкаШаблона = Запрос.Выполнить().Выбрать();
	Если ВыборкаШаблона.Следующий() Тогда
		Если ЗначениеЗаполнено(СокрЛП(НаименованиеРодителя)) Тогда 
			ГруппаШаблонов = ИнициализироватьГруппуШаблонов(НаименованиеРодителя);
			Если ГруппаШаблонов <> ВыборкаШаблона.Родитель Тогда 
				ПоместитьШаблонВГруппу(ГруппаШаблонов, ВыборкаШаблона.ШаблонСообщения);
			КонецЕсли;	
		КонецЕсли;			
		Возврат ВыборкаШаблона.ШаблонСообщения;
	ИначеЕсли ГенерироватьШаблон Тогда 
		Возврат СоздатьШаблонСообщения(НаименованиеШаблона, НаименованиеРодителя);
	Иначе 	
		Возврат ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции

// Функция - Инициализировать группу шаблонов
//
// Параметры:
//  НаименованиеРодителя - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьГруппуШаблонов(НаименованиеРодителя)
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(НаименованиеРодителя)) Тогда 
		Возврат ПустаяСсылка();
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеГруппыШаблоновТочноеПопадание"	, СокрЛ(НаименованиеРодителя));		
	Запрос.УстановитьПараметр("НаименованиеГруппыШаблонов"					, СокрЛ(НаименованиеРодителя) + "%");
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВложенныйЗапрос.Ссылка КАК ГруппаШаблонов
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		ШаблоныСообщений.Ссылка КАК Ссылка,
	|		1 КАК Приоритет
	|	ИЗ
	|		Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|	ГДЕ
	|		ШаблоныСообщений.Наименование ПОДОБНО &НаименованиеГруппыШаблоновТочноеПопадание
	|		И ШаблоныСообщений.ПометкаУдаления = ЛОЖЬ
	|		И ШаблоныСообщений.ЭтоГруппа = ИСТИНА
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ ПЕРВЫЕ 1
	|		ШаблоныСообщений.Ссылка,
	|		2
	|	ИЗ
	|		Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|	ГДЕ
	|		ШаблоныСообщений.Наименование ПОДОБНО &НаименованиеГруппыШаблонов
	|		И ШаблоныСообщений.ПометкаУдаления = ЛОЖЬ
	|		И ШаблоныСообщений.ЭтоГруппа = ИСТИНА
	|	
	|	УПОРЯДОЧИТЬ ПО
	|		Приоритет) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Приоритет";
	
	ВыборкаГруппыШаблонов = Запрос.Выполнить().Выбрать();
	Если ВыборкаГруппыШаблонов.Следующий() Тогда
		Возврат ВыборкаГруппыШаблонов.ГруппаШаблонов;
	Иначе
		Попытка
			Группа_Объект 				= СоздатьГруппу();
			Группа_Объект.Наименование 	= СокрЛ(НаименованиеРодителя);
			Если НЕ ЗначениеЗаполнено(Группа_Объект.Код) Тогда 
				Группа_Объект.УстановитьНовыйКод();
			КонецЕсли;
			// Сохраняем группу
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Группа_Объект);
			Возврат Группа_Объект.Ссылка;
		Исключение
			Возврат ПустаяСсылка();
		КонецПопытки;
	КонецЕсли;
	
КонецФункции

// Процедура - Поместить шаблон в группу
//
// Параметры:
//  ГруппаСегментов		 - 	 - 
//  СегментНоменклатуры	 - 	 - 
//
Процедура ПоместитьШаблонВГруппу(ГруппаШаблонов, ШаблонСообщения)
	
	Попытка	
		Шаблон_Объект = ШаблонСообщения.ПолучитьОбъект();	
		Шаблон_Объект.Родитель = ГруппаШаблонов;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Шаблон_Объект);
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

// Функция - Создать шаблон сообщения
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьШаблонСообщения(НаименованиеШаблона, НаименованиеРодителя = "")

	Если СокрЛП(НаименованиеШаблона) = "Рекомендации после установки временной пломбы" Тогда 
		Возврат ИнициализироватьШаблонСообщения_РекомендацииПослеУстановкиВременнойПломбы(НаименованиеШаблона, НаименованиеРодителя);
	ИначеЕсли СокрЛП(НаименованиеШаблона) = "Рекомендации после установки постоянной пломбы" Тогда 
		Возврат ИнициализироватьШаблонСообщения_РекомендацииПослеУстановкиПостояннойПломбы(НаименованиеШаблона, НаименованиеРодителя);
	ИначеЕсли СокрЛП(НаименованиеШаблона) = "Рекомендации после гигиены" Тогда 
		Возврат ИнициализироватьШаблонСообщения_РекомендацииПослеГигиены(НаименованиеШаблона, НаименованиеРодителя);
	ИначеЕсли СокрЛП(НаименованиеШаблона) = "Рекомендации после отбеливания" Тогда 
		Возврат ИнициализироватьШаблонСообщения_РекомендацииПослеОтбеливания(НаименованиеШаблона, НаименованиеРодителя);
	ИначеЕсли СокрЛП(НаименованиеШаблона) = "Рекомендации после удаления зуба" Тогда 
		Возврат ИнициализироватьШаблонСообщения_РекомендацииПослеУдаленияЗуба(НаименованиеШаблона, НаименованиеРодителя);
	ИначеЕсли СокрЛП(НаименованиеШаблона) = "Рекомендации после Синус-лифтинг" Тогда 
		Возврат ИнициализироватьШаблонСообщения_РекомендацииПослеСинусЛифтинг(НаименованиеШаблона, НаименованиеРодителя);
	ИначеЕсли СокрЛП(НаименованиеШаблона) = "Рекомендация после имплантации" Тогда 
		Возврат ИнициализироватьШаблонСообщения_РекомендацииПослеИмплантации(НаименованиеШаблона, НаименованиеРодителя);
	ИначеЕсли СокрЛП(НаименованиеШаблона) = "Рекомендации по уходу за брекет системой" Тогда 
		Возврат ИнициализироватьШаблонСообщения_РекомендацииПоУходуЗаБрекетСистемой(НаименованиеШаблона, НаименованиеРодителя);
	ИначеЕсли СокрЛП(НаименованиеШаблона) = "Рекомендации по уходу за элайнерами" Тогда 
		Возврат ИнициализироватьШаблонСообщения_РекомендацииПоУходуЗаЭлайнерами(НаименованиеШаблона, НаименованиеРодителя);
	ИначеЕсли СокрЛП(НаименованиеШаблона) = "Как ваше самочувствие после операции?" Тогда 
		Возврат ИнициализироватьШаблонСообщения_КакВашеСамочувствиеПослеОперации(НаименованиеШаблона, НаименованиеРодителя);
	ИначеЕсли СокрЛП(НаименованиеШаблона) = "Создание предварительной записи" Тогда 
		Возврат ИнициализироватьШаблонСообщения_СозданиеПредварительнойЗаписи(НаименованиеШаблона, НаименованиеРодителя);
	ИначеЕсли СокрЛП(НаименованиеШаблона) = "Напоминание о записи за 2 часа" Тогда 
		Возврат ИнициализироватьШаблонСообщения_НапоминаниеОЗаписиЗа2Часа(НаименованиеШаблона, НаименованиеРодителя);
		
	Иначе 
		Возврат ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции	

#Область ГЕНЕРАЦИЯ_ШАБЛОНОВ_РЕКОМЕНДАЦИЙ

// Функция - Инициализировать шаблон сообщения рекомендации после установки временной пломбы
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
//  НаименованиеРодителя - 	 - 
//  ВремяСобытия		 - 	 - 
//  ВернутьОбъект		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_РекомендацииПослеУстановкиВременнойПломбы(НаименованиеШаблона, НаименованиеРодителя = "", ВремяСобытия = Неопределено, ВернутьОбъект = Ложь)

	ШаблонСообщения_Объект 								= СоздатьЭлемент();
	ШаблонСообщения_Объект.Наименование 				= СокрЛП(НаименованиеШаблона);
	ШаблонСообщения_Объект.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_Объект.SMSВремяНачалаОтправки 		= ?(ЗначениеЗаполнено(ВремяСобытия), ВремяСобытия, Дата('0001.01.01 08:00:00'));
	ШаблонСообщения_Объект.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_Объект.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_Объект.Родитель 					= ИнициализироватьГруппуШаблонов(НаименованиеРодителя);	
	
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= "%7B%D0%98%D0%BC%D1%8F%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D&nbsp;%7B%D0%9E%D1%82%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%BE%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D,%20%D0%92%D0%B0%D0%BC%20%D1%83%D1%81%D1%82%D0%B0%D0%BD%D0%BE%D0%B2%D0%BB%D0%B5%D0%BD%D0%B0%20%D0%B2%D1%80%D0%B5%D0%BC%D0%B5%D0%BD%D0%BD%D0%B0%D1%8F%20%D0%BF%D0%BB%D0%BE%D0%BC%D0%B1%D0%B0.%20%3Cdiv%3E%3Cbr%3E%3C/div%3E%D0%A1%D0%BB%D0%B5%D0%B4%D1%83%D0%B9%D1%82%D0%B5%20%D1%80%D0%B5%D0%BA%D0%BE%D0%BC%D0%B5%D0%BD%D0%B4%D0%B0%D1%86%D0%B8%D1%8F%D0%BC%20%D0%B4%D0%BE%D0%BA%D1%82%D0%BE%D1%80%D0%B0:%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E&nbsp;%D0%92%D0%BE%D0%B7%D0%B4%D0%B5%D1%80%D0%B6%D0%B8%D1%82%D0%B5%D1%81%D1%8C%20%D0%BE%D1%82%20%D0%BF%D1%80%D0%B8%D0%B5%D0%BC%D0%B0%20%D0%BB%D1%8E%D0%B1%D0%BE%D0%B9%20%D0%BF%D0%B8%D1%89%D0%B8%20%D0%B2%20%D1%82%D0%B5%D1%87%D0%B5%D0%BD%D0%B8%D0%B5%2030%20%D0%BC%D0%B8%D0%BD%D1%83%D1%82";
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= РаскодироватьСтроку(ШаблонСообщения_Объект.СодержаниеМессенджерHTML, СпособКодированияСтроки.URLВКодировкеURL);
	
	Если ВернутьОбъект Тогда 
		ШаблонСообщения_Объект.СодержаниеМессенджер = ПолучитьТекстИзHTMLКода(ШаблонСообщения_Объект.СодержаниеМессенджерHTML);
		Возврат ШаблонСообщения_Объект;
	КонецЕсли;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_Объект.Код) Тогда 
			ШаблонСообщения_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем шаблон
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_Объект);			
		Возврат ШаблонСообщения_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеШаблона
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

// Функция - Инициализировать шаблон сообщения рекомендации после установки постоянной пломбы
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
//  НаименованиеРодителя - 	 - 
//  ВремяСобытия		 - 	 - 
//  ВернутьОбъект		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_РекомендацииПослеУстановкиПостояннойПломбы(НаименованиеШаблона, НаименованиеРодителя = "", ВремяСобытия = Неопределено, ВернутьОбъект = Ложь)

	ШаблонСообщения_Объект 								= СоздатьЭлемент();
	ШаблонСообщения_Объект.Наименование 				= СокрЛП(НаименованиеШаблона);
	ШаблонСообщения_Объект.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_Объект.SMSВремяНачалаОтправки 		= ?(ЗначениеЗаполнено(ВремяСобытия), ВремяСобытия, Дата('0001.01.01 08:00:00'));
	ШаблонСообщения_Объект.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_Объект.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_Объект.Родитель 					= ИнициализироватьГруппуШаблонов(НаименованиеРодителя);	
	
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= "%7B%D0%98%D0%BC%D1%8F%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D&nbsp;%7B%D0%9E%D1%82%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%BE%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D,%20%D0%92%D0%B0%D0%BC%20%D1%83%D1%81%D1%82%D0%B0%D0%BD%D0%BE%D0%B2%D0%BB%D0%B5%D0%BD%D0%B0%20%D0%BF%D0%BE%D1%81%D1%82%D0%BE%D1%8F%D0%BD%D0%BD%D0%B0%D1%8F%20%D0%BF%D0%BB%D0%BE%D0%BC%D0%B1%D0%B0.%20%3Cdiv%3E%3Cbr%3E%3C/div%3E%D0%A1%D0%BB%D0%B5%D0%B4%D1%83%D0%B9%D1%82%D0%B5%20%D1%80%D0%B5%D0%BA%D0%BE%D0%BC%D0%B5%D0%BD%D0%B4%D0%B0%D1%86%D0%B8%D1%8F%D0%BC%20%D0%B4%D0%BE%D0%BA%D1%82%D0%BE%D1%80%D0%B0:%3Cbr%3E%3Cbr%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%92%D0%BE%D0%B7%D0%B4%D0%B5%D1%80%D0%B6%D0%B8%D1%82%D0%B5%D1%81%D1%8C%20%D0%BE%D1%82%20%D1%83%D0%BF%D0%BE%D1%82%D1%80%D0%B5%D0%B1%D0%BB%D0%B5%D0%BD%D0%B8%D1%8F%20%D0%BA%D1%80%D0%B0%D1%81%D1%8F%D1%89%D0%B5%D0%B9%20%D0%BF%D0%B8%D1%89%D0%B8%20%D0%B2%20%D0%BF%D0%B5%D1%80%D0%B2%D1%8B%D0%B5%20%D1%81%D1%83%D1%82%D0%BA%D0%B8%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9D%D0%B5%20%D0%B7%D0%B0%D0%B1%D1%8B%D0%B2%D0%B0%D0%B9%D1%82%D0%B5%20%D0%B8%D1%81%D0%BF%D0%BE%D0%BB%D1%8C%D0%B7%D0%BE%D0%B2%D0%B0%D1%82%D1%8C%20%D1%8D%D0%BB%D0%B8%D0%BA%D1%81%D0%B8%D1%80%D1%8B%20%D0%B8%20%D0%BE%D0%BF%D0%BE%D0%BB%D0%B0%D1%81%D0%BA%D0%B8%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D0%B8%20%D0%B4%D0%BB%D1%8F%20%D0%BF%D0%BE%D0%BB%D0%BE%D1%81%D1%82%D0%B8%20%D1%80%D1%82%D0%B0%20%D0%BD%D0%B0%20%D0%BF%D0%BE%D1%81%D1%82%D0%BE%D1%8F%D0%BD%D0%BD%D0%BE%D0%B9%20%D0%BE%D1%81%D0%BD%D0%BE%D0%B2%D0%B5%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%94%D0%BB%D1%8F%20%D1%83%D0%BB%D1%83%D1%87%D1%88%D0%B5%D0%BD%D0%B8%D1%8F%20%D1%81%D0%BE%D1%81%D1%82%D0%BE%D1%8F%D0%BD%D0%B8%D1%8F%20%D0%B3%D0%B8%D0%B3%D0%B8%D0%B5%D0%BD%D1%8B%20%D0%BF%D0%BE%D0%BB%D0%BE%D1%81%D1%82%D0%B8%20%D1%80%D1%82%D0%B0%20%D0%B8%D1%81%D0%BF%D0%BE%D0%BB%D1%8C%D0%B7%D1%83%D0%B9%D1%82%D0%B5%20%D0%B7%D1%83%D0%B1%D0%BD%D1%83%D1%8E%20%D0%BD%D0%B8%D1%82%D1%8C%20%D0%B8%20%D0%B8%D1%80%D1%80%D0%B8%D0%B3%D0%B0%D1%82%D0%BE%D1%80%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9F%D0%BE%D1%81%D0%B5%D1%89%D0%B0%D0%B9%D1%82%D0%B5%20%D0%BF%D1%80%D0%BE%D1%84%D0%B8%D0%BB%D0%B0%D0%BA%D1%82%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B5%20%D0%BE%D1%81%D0%BC%D0%BE%D1%82%D1%80%D1%8B%20%D1%81%D1%82%D0%BE%D0%BC%D0%B0%D1%82%D0%BE%D0%BB%D0%BE%D0%B3%D0%B0%20%D0%BD%D0%B5%20%D0%BC%D0%B5%D0%BD%D0%B5%D0%B5%202%D1%85%20%D1%80%D0%B0%D0%B7%20%D0%B2%20%D0%B3%D0%BE%D0%B4";
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= РаскодироватьСтроку(ШаблонСообщения_Объект.СодержаниеМессенджерHTML, СпособКодированияСтроки.URLВКодировкеURL);
	
	Если ВернутьОбъект Тогда 
		ШаблонСообщения_Объект.СодержаниеМессенджер = ПолучитьТекстИзHTMLКода(ШаблонСообщения_Объект.СодержаниеМессенджерHTML);
		Возврат ШаблонСообщения_Объект;
	КонецЕсли;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_Объект.Код) Тогда 
			ШаблонСообщения_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем шаблон
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_Объект);			
		Возврат ШаблонСообщения_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеШаблона
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

// Функция - Инициализировать шаблон сообщения рекомендации после гигиены
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
//  НаименованиеРодителя - 	 - 
//  ВремяСобытия		 - 	 - 
//  ВернутьОбъект		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_РекомендацииПослеГигиены(НаименованиеШаблона, НаименованиеРодителя = "", ВремяСобытия = Неопределено, ВернутьОбъект = Ложь)

	ШаблонСообщения_Объект 								= СоздатьЭлемент();
	ШаблонСообщения_Объект.Наименование 				= СокрЛП(НаименованиеШаблона);
	ШаблонСообщения_Объект.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_Объект.SMSВремяНачалаОтправки 		= ?(ЗначениеЗаполнено(ВремяСобытия), ВремяСобытия, Дата('0001.01.01 08:00:00'));
	ШаблонСообщения_Объект.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_Объект.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_Объект.Родитель 					= ИнициализироватьГруппуШаблонов(НаименованиеРодителя);	
	
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= "%7B%D0%98%D0%BC%D1%8F%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D&nbsp;%7B%D0%9E%D1%82%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%BE%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D,%20%D0%92%D1%8B%20%D0%BF%D1%80%D0%BE%D1%88%D0%BB%D0%B8%20%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D0%B4%D1%83%D1%80%D1%83%20%D0%BF%D1%80%D0%BE%D1%84%D0%B5%D1%81%D1%81%D0%B8%D0%BE%D0%BD%D0%B0%D0%BB%D1%8C%D0%BD%D0%BE%D0%B9%20%D0%B3%D0%B8%D0%B3%D0%B8%D0%B5%D0%BD%D1%8B%20%D0%BF%D0%BE%D0%BB%D0%BE%D1%81%D1%82%D0%B8%20%D1%80%D1%82%D0%B0,%20%D0%B8%20%D0%BC%D1%8B%20%D0%B3%D0%BE%D1%80%D0%B4%D0%B8%D0%BC%D1%81%D1%8F%20%D0%92%D0%B0%D0%BC%D0%B8,%20%D0%B2%D0%B5%D0%B4%D1%8C%20%D0%B8%D0%BC%D0%B5%D0%BD%D0%BD%D0%BE%20%D0%BF%D1%80%D0%BE%D1%84%D0%B8%D0%BB%D0%B0%D0%BA%D1%82%D0%B8%D0%BA%D0%B0%20-%20%D0%B7%D0%B0%D0%BB%D0%BE%D0%B3%20%D0%B7%D0%B4%D0%BE%D1%80%D0%BE%D0%B2%D0%BE%D0%B9%20%D0%B8%20%D0%BA%D1%80%D0%B0%D1%81%D0%B8%D0%B2%D0%BE%D0%B9%20%D1%83%D0%BB%D1%8B%D0%B1%D0%BA%D0%B8.%3Cdiv%3E%3Cbr%3E%3C/div%3E%D0%A1%D0%BB%D0%B5%D0%B4%D1%83%D0%B9%D1%82%D0%B5%20%D1%80%D0%B5%D0%BA%D0%BE%D0%BC%D0%B5%D0%BD%D0%B4%D0%B0%D1%86%D0%B8%D1%8F%D0%BC%20%D0%B4%D0%BE%D0%BA%D1%82%D0%BE%D1%80%D0%B0,%20%D1%87%D1%82%D0%BE%D0%B1%D1%8B%20%D1%81%D0%BE%D1%85%D1%80%D0%B0%D0%BD%D0%B8%D1%82%D1%8C%20%D1%80%D0%B5%D0%B7%D1%83%D0%BB%D1%8C%D1%82%D0%B0%D1%82:%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9E%D1%82%D0%BA%D0%B0%D0%B6%D0%B8%D1%82%D0%B5%D1%81%D1%8C%20%D0%BE%D1%82%20%D0%BA%D1%83%D1%80%D0%B5%D0%BD%D0%B8%D1%8F,%20%D1%83%D0%BF%D0%BE%D1%82%D1%80%D0%B5%D0%B1%D0%BB%D0%B5%D0%BD%D0%B8%D1%8F%20%D0%B5%D0%B4%D1%8B%20%D0%B8%20%D0%BD%D0%B0%D0%BF%D0%B8%D1%82%D0%BA%D0%BE%D0%B2%20%D0%B2%20%D1%82%D0%B5%D1%87%D0%B5%D0%BD%D0%B8%D0%B5%2030%20%D0%BC%D0%B8%D0%BD%D1%83%D1%82%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%92%20%D0%BF%D0%B5%D1%80%D0%B2%D1%8B%D0%B5%202%20%D0%B4%D0%BD%D1%8F%20%D0%BE%D1%82%D0%BA%D0%B0%D0%B6%D0%B8%D1%82%D0%B5%D1%81%D1%8C%20%D0%BE%D1%82%20%D0%BF%D1%80%D0%B8%D1%91%D0%BC%D0%B0%20%D0%BA%D1%80%D0%B0%D1%81%D1%8F%D1%89%D0%B8%D1%85%20%D0%BF%D1%80%D0%BE%D0%B4%D1%83%D0%BA%D1%82%D0%BE%D0%B2%20%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9D%D0%B5%D0%B4%D0%B5%D0%BB%D1%8E%20%D0%BD%D0%B5%20%D0%B8%D1%81%D0%BF%D0%BE%D0%BB%D1%8C%D0%B7%D1%83%D0%B9%D1%82%D0%B5%20%D0%BE%D0%BF%D0%BE%D0%BB%D0%B0%D1%81%D0%BA%D0%B8%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%20%D1%81%D0%BE%D0%B4%D0%B5%D1%80%D0%B6%D0%B0%D1%89%D0%B8%D0%B9%20%D1%81%D0%BF%D0%B8%D1%80%D1%82%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9F%D0%B5%D1%80%D0%B2%D1%8B%D0%B5%20%D0%B4%D0%BD%D0%B8%20%D0%BF%D0%BE%D0%BB%D1%8C%D0%B7%D1%83%D0%B9%D1%82%D0%B5%D1%81%D1%8C%20%D0%B7%D1%83%D0%B1%D0%BD%D0%BE%D0%B9%20%D1%89%D1%91%D1%82%D0%BA%D0%BE%D0%B9%20%D1%81%20%D0%BC%D1%8F%D0%B3%D0%BA%D0%B8%D0%BC%D0%B8%20%D1%89%D0%B5%D1%82%D0%B8%D0%BD%D0%BA%D0%B0%D0%BC%D0%B8%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%95%D0%B6%D0%B5%D0%B4%D0%BD%D0%B5%D0%B2%D0%BD%D0%BE%20%D0%BE%D1%87%D0%B8%D1%89%D0%B0%D0%B9%D1%82%D0%B5%20%D0%BF%D1%80%D0%BE%D0%BC%D0%B5%D0%B6%D1%83%D1%82%D0%BA%D0%B8%20%D0%BC%D0%B5%D0%B6%D0%B4%D1%83%20%D0%B7%D1%83%D0%B1%D0%B0%D0%BC%D0%B8%20%D0%BD%D0%B8%D1%82%D1%8C%D1%8E%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9F%D0%BE%D0%B2%D1%82%D0%BE%D1%80%D0%B8%D1%82%D0%B5%20%D0%BF%D1%80%D0%BE%D1%84%D0%B5%D1%81%D1%81%D0%B8%D0%BE%D0%BD%D0%B0%D0%BB%D1%8C%D0%BD%D1%83%D1%8E%20%D0%BF%D1%80%D0%BE%D1%84%D0%B8%D0%BB%D0%B0%D0%BA%D1%82%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D1%83%D1%8E%20%D1%87%D0%B8%D1%81%D1%82%D0%BA%D1%83%20%D1%87%D0%B5%D1%80%D0%B5%D0%B7%206%20%D0%BC%D0%B5%D1%81%D1%8F%D1%86%D0%B5%D0%B2";
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= РаскодироватьСтроку(ШаблонСообщения_Объект.СодержаниеМессенджерHTML, СпособКодированияСтроки.URLВКодировкеURL);
	
	Если ВернутьОбъект Тогда 
		ШаблонСообщения_Объект.СодержаниеМессенджер = ПолучитьТекстИзHTMLКода(ШаблонСообщения_Объект.СодержаниеМессенджерHTML);
		Возврат ШаблонСообщения_Объект;
	КонецЕсли;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_Объект.Код) Тогда 
			ШаблонСообщения_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем шаблон
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_Объект);			
		Возврат ШаблонСообщения_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеШаблона
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

// Функция - Инициализировать шаблон сообщения рекомендации после отбеливания
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
//  НаименованиеРодителя - 	 - 
//  ВремяСобытия		 - 	 - 
//  ВернутьОбъект		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_РекомендацииПослеОтбеливания(НаименованиеШаблона, НаименованиеРодителя = "", ВремяСобытия = Неопределено, ВернутьОбъект = Ложь)

	ШаблонСообщения_Объект 								= СоздатьЭлемент();
	ШаблонСообщения_Объект.Наименование 				= СокрЛП(НаименованиеШаблона);
	ШаблонСообщения_Объект.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_Объект.SMSВремяНачалаОтправки 		= ?(ЗначениеЗаполнено(ВремяСобытия), ВремяСобытия, Дата('0001.01.01 08:00:00'));
	ШаблонСообщения_Объект.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_Объект.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_Объект.Родитель 					= ИнициализироватьГруппуШаблонов(НаименованиеРодителя);	
	
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= "%7B%D0%98%D0%BC%D1%8F%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D&nbsp;%7B%D0%9E%D1%82%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%BE%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D,%20%D0%92%D1%8B%20%D0%BF%D1%80%D0%BE%D1%88%D0%BB%D0%B8%20%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D0%B4%D1%83%D1%80%D1%83%20%D0%BF%D1%80%D0%BE%D1%84%D0%B5%D1%81%D1%81%D0%B8%D0%BE%D0%BD%D0%B0%D0%BB%D1%8C%D0%BD%D0%BE%D0%B3%D0%BE%20%D0%BE%D1%82%D0%B1%D0%B5%D0%BB%D0%B8%D0%B2%D0%B0%D0%BD%D0%B8%D1%8F%20%D0%B7%D1%83%D0%B1%D0%BE%D0%B2.%20%D0%A2%D0%B5%D0%BF%D0%B5%D1%80%D1%8C%20%D0%92%D0%B0%D1%88%D0%B0%20%D1%83%D0%BB%D1%8B%D0%B1%D0%BA%D0%B0%20%D0%BD%D0%B5%D0%BE%D1%82%D1%80%D0%B0%D0%B7%D0%B8%D0%BC%D0%B0!%3Cdiv%3E%3Cbr%3E%3C/div%3E%D0%A1%D0%BB%D0%B5%D0%B4%D1%83%D0%B9%D1%82%D0%B5%20%D1%80%D0%B5%D0%BA%D0%BE%D0%BC%D0%B5%D0%BD%D0%B4%D0%B0%D1%86%D0%B8%D1%8F%D0%BC%20%D0%B4%D0%BE%D0%BA%D1%82%D0%BE%D1%80%D0%B0,%20%D1%87%D1%82%D0%BE%D0%B1%D1%8B%20%D1%81%D0%BE%D1%85%D1%80%D0%B0%D0%BD%D0%B8%D1%82%D1%8C%20%D1%80%D0%B5%D0%B7%D1%83%D0%BB%D1%8C%D1%82%D0%B0%D1%82:%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9D%D0%B5%20%D1%83%D0%BF%D0%BE%D1%82%D1%80%D0%B5%D0%B1%D0%BB%D1%8F%D0%B9%D1%82%D0%B5%20%D1%84%D1%80%D1%83%D0%BA%D1%82%D1%8B%20(%D0%BE%D1%81%D0%BE%D0%B1%D0%B5%D0%BD%D0%BD%D0%BE%20%D1%86%D0%B8%D1%82%D1%80%D1%83%D1%81%D0%BE%D0%B2%D1%8B%D0%B5),%20%D0%B0%20%D1%82%D0%B0%D0%BA%D0%B6%D0%B5%20%D1%84%D1%80%D1%83%D0%BA%D1%82%D0%BE%D0%B2%D1%8B%D0%B5%20%D1%81%D0%BE%D0%BA%D0%B8%20%D0%B8%20%D0%B3%D0%B0%D0%B7%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%BD%D1%8B%D0%B5%20%D0%BD%D0%B0%D0%BF%D0%B8%D1%82%D0%BA%D0%B8,%20%D1%82%D0%B0%D0%BA%20%D0%BA%D0%B0%D0%BA%20%D1%8D%D1%82%D0%BE%20%D0%BC%D0%BE%D0%B6%D0%B5%D1%82%20%D1%81%D1%82%D0%B0%D1%82%D1%8C%20%D0%BF%D1%80%D0%B8%D1%87%D0%B8%D0%BD%D0%BE%D0%B9%20%D0%BF%D0%BE%D0%B2%D1%8B%D1%88%D0%B5%D0%BD%D0%BD%D0%BE%D0%B9%20%D1%87%D1%83%D0%B2%D1%81%D1%82%D0%B2%D0%B8%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%D1%81%D1%82%D0%B8%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9D%D0%B5%20%D1%83%D0%BF%D0%BE%D1%82%D1%80%D0%B5%D0%B1%D0%BB%D1%8F%D0%B9%D1%82%D0%B5%20%D0%B2%20%D1%82%D0%B5%D1%87%D0%B5%D0%BD%D0%B8%D0%B5%202%D1%85%20%D0%BD%D0%B5%D0%B4%D0%B5%D0%BB%D1%8C%20%D0%BA%D0%BE%D1%84%D0%B5,%20%D1%87%D0%B5%D1%80%D0%BD%D1%8B%D0%B9%20%D1%87%D0%B0%D0%B9,%20%D0%BA%D1%80%D0%B0%D1%81%D0%BD%D0%BE%D0%B5%20%D0%B2%D0%B8%D0%BD%D0%BE%20%D0%B8%20%D0%B8%D0%BD%D1%8B%D0%B5%20%D0%BA%D1%80%D0%B0%D1%81%D1%8F%D1%89%D0%B8%D0%B5%20%D0%BF%D1%80%D0%BE%D0%B4%D1%83%D0%BA%D1%82%D1%8B%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%96%D0%B5%D0%BB%D0%B0%D1%82%D0%B5%D0%BB%D0%B5%D0%BD%20%D0%BE%D1%82%D0%BA%D0%B0%D0%B7%20%D0%BE%D1%82%20%D0%BA%D1%83%D1%80%D0%B5%D0%BD%D0%B8%D1%8F%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%92%20%D0%BF%D0%B5%D1%80%D0%B2%D1%8B%D0%B5%20%D1%81%D1%83%D1%82%D0%BA%D0%B8%20%D0%BF%D0%BE%D1%81%D0%BB%D0%B5%20%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D0%B4%D1%83%D1%80%D1%8B%20%D0%B2%D0%BE%D0%B7%D0%BC%D0%BE%D0%B6%D0%BD%D0%B0%20%D0%BF%D0%BE%D0%B2%D1%8B%D1%88%D0%B5%D0%BD%D0%BD%D0%B0%D1%8F%20%D1%87%D1%83%D0%B2%D1%81%D1%82%D0%B2%D0%B8%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%D1%81%D1%82%D1%8C%20%D0%B7%D1%83%D0%B1%D0%BE%D0%B2,%20%D0%BF%D1%80%D0%B8%D0%BD%D0%B8%D0%BC%D0%B0%D0%B9%D1%82%D0%B5%20%D0%BE%D0%B1%D0%B5%D0%B7%D0%B1%D0%BE%D0%BB%D0%B8%D0%B2%D0%B0%D1%8E%D1%89%D0%B8%D0%B5%20%D0%BF%D1%80%D0%B5%D0%BF%D0%B0%D1%80%D0%B0%D1%82%D1%8B";
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= РаскодироватьСтроку(ШаблонСообщения_Объект.СодержаниеМессенджерHTML, СпособКодированияСтроки.URLВКодировкеURL);
	
	Если ВернутьОбъект Тогда 
		ШаблонСообщения_Объект.СодержаниеМессенджер = ПолучитьТекстИзHTMLКода(ШаблонСообщения_Объект.СодержаниеМессенджерHTML);
		Возврат ШаблонСообщения_Объект;
	КонецЕсли;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_Объект.Код) Тогда 
			ШаблонСообщения_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем шаблон
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_Объект);			
		Возврат ШаблонСообщения_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеШаблона
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

// Функция - Инициализировать шаблон сообщения рекомендации после удаления зуба
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
//  НаименованиеРодителя - 	 - 
//  ВремяСобытия		 - 	 - 
//  ВернутьОбъект		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_РекомендацииПослеУдаленияЗуба(НаименованиеШаблона, НаименованиеРодителя = "", ВремяСобытия = Неопределено, ВернутьОбъект = Ложь)

	ШаблонСообщения_Объект 								= СоздатьЭлемент();
	ШаблонСообщения_Объект.Наименование 				= СокрЛП(НаименованиеШаблона);
	ШаблонСообщения_Объект.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_Объект.SMSВремяНачалаОтправки 		= ?(ЗначениеЗаполнено(ВремяСобытия), ВремяСобытия, Дата('0001.01.01 08:00:00'));
	ШаблонСообщения_Объект.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_Объект.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_Объект.Родитель 					= ИнициализироватьГруппуШаблонов(НаименованиеРодителя);	
	
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= "%7B%D0%98%D0%BC%D1%8F%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D&nbsp;%7B%D0%9E%D1%82%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%BE%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D,%20%D0%BF%D0%BE%D0%B7%D0%B4%D1%80%D0%B0%D0%B2%D0%BB%D1%8F%D0%B5%D0%BC!%20%D0%A5%D0%B8%D1%80%D1%83%D1%80%D0%B3%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B0%D1%8F%20%D0%BE%D0%BF%D0%B5%D1%80%D0%B0%D1%86%D0%B8%D1%8F%20%D0%BF%D0%BE%D0%B7%D0%B0%D0%B4%D0%B8.%3Cdiv%3E%3Cbr%3E%3C/div%3E%D0%A1%D0%BB%D0%B5%D0%B4%D1%83%D0%B9%D1%82%D0%B5%20%D1%80%D0%B5%D0%BA%D0%BE%D0%BC%D0%B5%D0%BD%D0%B4%D0%B0%D1%86%D0%B8%D1%8F%D0%BC%20%D0%B4%D0%BE%D0%BA%D1%82%D0%BE%D1%80%D0%B0,%20%D0%B8%20%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%20%D0%B7%D0%B0%D0%B6%D0%B8%D0%B2%D0%BB%D0%B5%D0%BD%D0%B8%D1%8F%20%D0%BF%D1%80%D0%BE%D0%B9%D0%B4%D0%B5%D1%82%20%D0%B1%D0%B5%D0%B7%20%D0%BE%D1%81%D0%BB%D0%BE%D0%B6%D0%BD%D0%B5%D0%BD%D0%B8%D0%B9:%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9E%D1%82%D0%BA%D0%B0%D0%B6%D0%B8%D1%82%D0%B5%D1%81%D1%8C%20%D0%BE%D1%82%20%D0%BA%D1%83%D1%80%D0%B5%D0%BD%D0%B8%D1%8F,%20%D1%83%D0%BF%D0%BE%D1%82%D1%80%D0%B5%D0%B1%D0%BB%D0%B5%D0%BD%D0%B8%D1%8F%20%D0%B5%D0%B4%D1%8B%20%D0%B8%20%D0%BD%D0%B0%D0%BF%D0%B8%D1%82%D0%BA%D0%BE%D0%B2%20%D0%B2%20%D1%82%D0%B5%D1%87%D0%B5%D0%BD%D0%B8%D0%B5%202%D1%85%20%D1%87%D0%B0%D1%81%D0%BE%D0%B2%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9D%D0%B0%203%20%D0%B4%D0%BD%D1%8F%20%D0%B8%D1%81%D0%BA%D0%BB%D1%8E%D1%87%D0%B8%D1%82%D0%B5%20%D0%BA%D0%B8%D1%81%D0%BB%D0%BE%D0%BC%D0%BE%D0%BB%D0%BE%D1%87%D0%BD%D1%8B%D0%B5%20%D0%BF%D1%80%D0%BE%D0%B4%D1%83%D0%BA%D1%82%D1%8B%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%92%20%D1%82%D0%B5%D1%87%D0%B5%D0%BD%D0%B8%D0%B5%20%D0%BF%D0%B5%D1%80%D0%B2%D1%8B%D1%85%20%D1%81%D1%83%D1%82%D0%BE%D0%BA%20%D0%B8%D1%81%D0%BA%D0%BB%D1%8E%D1%87%D0%B8%D1%82%D0%B5%20%D0%B3%D0%BE%D1%80%D1%8F%D1%87%D1%83%D1%8E%20%D0%B5%D0%B4%D1%83%20%D0%B8%20%D0%BF%D0%B8%D1%82%D1%8C%D0%B5%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9F%D0%B5%D1%80%D0%B2%D1%8B%D0%B5%203%20%D1%81%D1%83%D1%82%D0%BE%D0%BA%20%D0%BF%D1%80%D0%B8%D0%BA%D0%BB%D0%B0%D0%B4%D1%8B%D0%B2%D0%B0%D0%B9%D1%82%D0%B5%20%D1%85%D0%BE%D0%BB%D0%BE%D0%B4%20(3-5%20%D1%80%D0%B0%D0%B7%20%D0%B2%20%D0%B4%D0%B5%D0%BD%D1%8C%20%D0%BF%D0%BE%205%20%D0%BC%D0%B8%D0%BD%D1%83%D1%82)%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9D%D0%B0%205-7%20%D0%B4%D0%BD%D0%B5%D0%B9%20%D0%B8%D1%81%D0%BA%D0%BB%D1%8E%D1%87%D0%B8%D1%82%D0%B5%20%D0%B7%D0%B0%D0%BD%D1%8F%D1%82%D0%B8%D1%8F%20%D1%81%D0%BF%D0%BE%D1%80%D1%82%D0%BE%D0%BC,%20%D1%82%D1%8F%D0%B6%D0%B5%D0%BB%D1%8B%D0%B5%20%D0%BD%D0%B0%D0%B3%D1%80%D1%83%D0%B7%D0%BA%D0%B8,%20%D0%B0%D0%BB%D0%BA%D0%BE%D0%B3%D0%BE%D0%BB%D1%8C,%20%D0%B1%D0%B0%D0%BD%D0%B8%20%D0%B8%20%D1%81%D0%B0%D1%83%D0%BD%D1%8B,%20%D0%BB%D1%8E%D0%B1%D1%8B%D0%B5%20%D0%B7%D0%B0%D0%BD%D1%8F%D1%82%D0%B8%D1%8F,%20%D0%BA%D0%BE%D1%82%D0%BE%D1%80%D1%8B%D0%B5%20%D0%BF%D0%BE%D0%B2%D1%8B%D1%88%D0%B0%D1%8E%D1%82%20%D0%B4%D0%B0%D0%B2%D0%BB%D0%B5%D0%BD%D0%B8%D0%B5%20(%D1%80%D0%B8%D1%81%D0%BA%20%D0%BF%D0%BE%D1%81%D0%BB%D0%B5%D0%BE%D0%BF%D0%B5%D1%80%D0%B0%D1%86%D0%B8%D0%BE%D0%BD%D0%BD%D0%BE%D0%B3%D0%BE%20%D0%BA%D1%80%D0%BE%D0%B2%D0%BE%D1%82%D0%B5%D1%87%D0%B5%D0%BD%D0%B8%D1%8F)%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9F%D0%BE%D0%BB%D0%BE%D1%81%D0%BA%D0%B0%D0%BD%D0%B8%D0%B5%20%D1%80%D0%BE%D1%82%D0%BE%D0%B2%D0%BE%D0%B9%20%D0%BF%D0%BE%D0%BB%D0%BE%D1%81%D1%82%D0%B8%20%D0%BD%D0%B5%20%D1%82%D1%80%D0%B5%D0%B1%D1%83%D0%B5%D1%82%D1%81%D1%8F,%20%D1%80%D0%B0%D0%BD%D1%83%20%D1%8F%D0%B7%D1%8B%D0%BA%D0%BE%D0%BC%20%D1%82%D1%80%D0%BE%D0%B3%D0%B0%D1%82%D1%8C%20%D0%BD%D0%B5%D0%BB%D1%8C%D0%B7%D1%8F%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9F%D1%80%D0%B8%20%D0%B1%D0%BE%D0%BB%D1%8F%D1%85%20%D0%BF%D1%80%D0%B8%D0%BC%D0%B8%D1%82%D0%B5%20%D0%BB%D1%8E%D0%B1%D1%8B%D0%B5%20%D0%BE%D0%B1%D0%B5%D0%B7%D0%B1%D0%BE%D0%BB%D0%B8%D0%B2%D0%B0%D1%8E%D1%89%D0%B8%D0%B5%20%D0%BF%D1%80%D0%B5%D0%BF%D0%B0%D1%80%D0%B0%D1%82%D1%8B%3Cdiv%3E%3Cbr%3E%3C/div%3E%D0%9D%D0%B0%202-3%20%D1%81%D1%83%D1%82%D0%BA%D0%B8&nbsp;&nbsp;%D0%B2%D0%BE%D0%B7%D0%BC%D0%BE%D0%B6%D0%B5%D0%BD%20%D0%BE%D1%82%D0%B5%D0%BA,%20%D0%BF%D0%BE%D1%81%D0%BB%D0%B5%203%D1%85%20%D1%81%D1%83%D1%82%D0%BE%D0%BA%20%D0%BF%D0%BE%D0%B9%D0%B4%D0%B5%D1%82%20%D0%BD%D0%B0%20%D1%81%D0%BF%D0%B0%D0%B4.%3Cdiv%3E%3C/div%3E%D0%9F%D0%B5%D1%80%D0%B2%D1%8B%D0%B5%203-%D0%B5%20%D1%81%D1%83%D1%82%D0%BE%D0%BA%20%D1%80%D0%B0%D0%BD%D0%BA%D0%B0%20%D0%BC%D0%BE%D0%B6%D0%B5%D1%82%20%D0%BA%D1%80%D0%BE%D0%B2%D0%B8%D1%82%D1%8C,%20%D1%8D%D1%82%D0%BE%20%D0%BD%D0%BE%D1%80%D0%BC%D0%B0%D0%BB%D1%8C%D0%BD%D0%BE.%20%3Cbr%3E%3Cbr%3E%3Cimg%20alt=%22%E2%9D%97%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2757.png%22%20style=%22font-size:%2016px;%22%3E&nbsp;%3Cspan%20style=%22background-color:%20transparent;%22%3E%D0%9F%D1%80%D0%B8%20%D0%BE%D1%81%D1%82%D1%80%D0%BE%D0%BC%20%D0%BA%D1%80%D0%BE%D0%B2%D0%BE%D1%82%D0%B5%D1%87%D0%B5%D0%BD%D0%B8%D0%B8%20%D0%BD%D0%B5%D0%BE%D0%B1%D1%85%D0%BE%D0%B4%D0%B8%D0%BC%D0%BE%20%D0%BD%D0%B5%D0%BC%D0%B5%D0%B4%D0%BB%D0%B5%D0%BD%D0%BD%D0%BE%20%D0%BF%D1%80%D0%B8%D0%BB%D0%BE%D0%B6%D0%B8%D1%82%D1%8C%20%D0%BB%D0%B5%D0%B4%20%D0%B8%20%D0%BE%D0%B1%D1%80%D0%B0%D1%82%D0%B8%D1%82%D1%8C%D1%81%D1%8F%20%D0%BA%20%D0%B2%D1%80%D0%B0%D1%87%D1%83.%3C/span%3E";
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= РаскодироватьСтроку(ШаблонСообщения_Объект.СодержаниеМессенджерHTML, СпособКодированияСтроки.URLВКодировкеURL);
	
	Если ВернутьОбъект Тогда 
		ШаблонСообщения_Объект.СодержаниеМессенджер = ПолучитьТекстИзHTMLКода(ШаблонСообщения_Объект.СодержаниеМессенджерHTML);
		Возврат ШаблонСообщения_Объект;
	КонецЕсли;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_Объект.Код) Тогда 
			ШаблонСообщения_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем шаблон
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_Объект);			
		Возврат ШаблонСообщения_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеШаблона
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

// Функция - Инициализировать шаблон сообщения рекомендации после синус лифтинг
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
//  НаименованиеРодителя - 	 - 
//  ВремяСобытия		 - 	 - 
//  ВернутьОбъект		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_РекомендацииПослеСинусЛифтинг(НаименованиеШаблона, НаименованиеРодителя = "", ВремяСобытия = Неопределено, ВернутьОбъект = Ложь)

	ШаблонСообщения_Объект 								= СоздатьЭлемент();
	ШаблонСообщения_Объект.Наименование 				= СокрЛП(НаименованиеШаблона);
	ШаблонСообщения_Объект.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_Объект.SMSВремяНачалаОтправки 		= ?(ЗначениеЗаполнено(ВремяСобытия), ВремяСобытия, Дата('0001.01.01 08:00:00'));
	ШаблонСообщения_Объект.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_Объект.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_Объект.Родитель 					= ИнициализироватьГруппуШаблонов(НаименованиеРодителя);	
	
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= "%7B%D0%98%D0%BC%D1%8F%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D&nbsp;%7B%D0%9E%D1%82%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%BE%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D,%20%D0%B4%D0%BE%D0%BA%D1%82%D0%BE%D1%80%20%D0%BE%D1%82%D0%BF%D1%80%D0%B0%D0%B2%D0%BB%D1%8F%D0%B5%D1%82%20%D0%92%D0%B0%D0%BC%20%D0%BF%D0%B0%D0%BC%D1%8F%D1%82%D0%BA%D1%83%20%D0%BF%D0%BE%20%D1%83%D1%85%D0%BE%D0%B4%D1%83%20%D0%B7%D0%B0%20%D0%BF%D0%BE%D0%BB%D0%BE%D1%81%D1%82%D1%8C%D1%8E%20%D1%80%D1%82%D0%B0%20%D0%BF%D0%BE%D1%81%D0%BB%D0%B5%20%D0%BE%D0%BF%D0%B5%D1%80%D0%B0%D1%86%D0%B8%D0%B8%20%D0%BD%D0%B0%20%D0%B2%D0%B5%D1%80%D1%85%D0%BD%D0%B5%D0%B9%20%D1%87%D0%B5%D0%BB%D1%8E%D1%81%D1%82%D0%B8.%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E&nbsp;10-14%20%D0%B4%D0%BD%D0%B5%D0%B9%20%D0%BD%D0%B5%D0%BB%D1%8C%D0%B7%D1%8F%20%D0%B2%D1%8B%D1%81%D0%BC%D0%B0%D1%80%D0%BA%D0%B8%D0%B2%D0%B0%D1%82%D1%8C%20%D0%BD%D0%BE%D1%81%20%D0%B8%20%D1%87%D0%B8%D1%85%D0%B0%D1%82%D1%8C%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E&nbsp;%D0%9D%D0%B5%D0%BB%D1%8C%D0%B7%D1%8F%20%D0%BF%D0%BE%D0%B3%D1%80%D1%83%D0%B6%D0%B0%D1%82%D1%8C%D1%81%D1%8F%20%D0%B2%20%D0%B2%D0%BE%D0%B4%D1%83%20%D1%81%20%D0%B0%D0%BA%D0%B2%D0%B0%D0%BB%D0%B0%D0%BD%D0%B3%D0%BE%D0%BC%20%D0%B8%20%D0%BD%D0%B5%D0%BE%D0%B1%D1%85%D0%BE%D0%B4%D0%B8%D0%BC%D0%BE%20%D0%B8%D1%81%D0%BA%D0%BB%D1%8E%D1%87%D0%B8%D1%82%D1%8C%20%D0%BF%D0%B5%D1%80%D0%B5%D0%BB%D0%B5%D1%82%D1%8B,%20%D0%BF%D1%80%D1%8B%D0%B6%D0%BA%D0%B8%20%D1%81%20%D0%BF%D0%B0%D1%80%D0%B0%D1%88%D1%8E%D1%82%D0%BE%D0%BC%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E&nbsp;%D0%9E%D0%B1%D1%8F%D0%B7%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%20%D0%B8%D1%81%D0%BF%D0%BE%D0%BB%D1%8C%D0%B7%D0%BE%D0%B2%D0%B0%D1%82%D1%8C%20%D0%BA%D0%B0%D0%BF%D0%BB%D0%B8%20%D0%B2%20%D0%BD%D0%BE%D1%81:%20%D0%90%D0%9A%D0%92%D0%90%D0%9C%D0%90%D0%A0%D0%98%D0%A1%20%D0%B8%D0%BB%D0%B8%20%D0%9E%D0%A2%D0%A0%D0%98%D0%92%D0%98%D0%9D%20(%D0%BF%D0%BE%201%20%D0%BA%D0%B0%D0%BF%D0%BB%D0%B5,%203%20%D1%80%D0%B0%D0%B7%D0%B0%20%D0%B2%20%D0%B4%D0%B5%D0%BD%D1%8C)%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E&nbsp;%D0%90%D0%BA%D0%BA%D1%83%D1%80%D0%B0%D1%82%D0%BD%D0%BE%20%D0%B2%D0%B0%D1%82%D0%BD%D1%8B%D0%BC%D0%B8%20%D0%BF%D0%B0%D0%BB%D0%BE%D1%87%D0%BA%D0%B0%D0%BC%D0%B8%20%D0%B8%20%D1%81%D0%B0%D0%BB%D1%84%D0%B5%D1%82%D0%BA%D0%B0%D0%BC%D0%B8%20%D0%BF%D1%80%D0%BE%D1%87%D0%B8%D1%89%D0%B0%D0%B9%D1%82%D0%B5%20%D0%BD%D0%BE%D1%81%3Cspan%20style=%22background-color:%20transparent;%22%3E%3C/span%3E";
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= РаскодироватьСтроку(ШаблонСообщения_Объект.СодержаниеМессенджерHTML, СпособКодированияСтроки.URLВКодировкеURL);
	
	Если ВернутьОбъект Тогда 
		ШаблонСообщения_Объект.СодержаниеМессенджер = ПолучитьТекстИзHTMLКода(ШаблонСообщения_Объект.СодержаниеМессенджерHTML);
		Возврат ШаблонСообщения_Объект;
	КонецЕсли;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_Объект.Код) Тогда 
			ШаблонСообщения_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем шаблон
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_Объект);			
		Возврат ШаблонСообщения_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеШаблона
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

// Функция - Инициализировать шаблон сообщения рекомендации после имплантации
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
//  НаименованиеРодителя - 	 - 
//  ВремяСобытия		 - 	 - 
//  ВернутьОбъект		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_РекомендацииПослеИмплантации(НаименованиеШаблона, НаименованиеРодителя = "", ВремяСобытия = Неопределено, ВернутьОбъект = Ложь)

	ШаблонСообщения_Объект 								= СоздатьЭлемент();
	ШаблонСообщения_Объект.Наименование 				= СокрЛП(НаименованиеШаблона);
	ШаблонСообщения_Объект.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_Объект.SMSВремяНачалаОтправки 		= ?(ЗначениеЗаполнено(ВремяСобытия), ВремяСобытия, Дата('0001.01.01 08:00:00'));
	ШаблонСообщения_Объект.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_Объект.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_Объект.Родитель 					= ИнициализироватьГруппуШаблонов(НаименованиеРодителя);	
	
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= "%7B%D0%98%D0%BC%D1%8F%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D&nbsp;%7B%D0%9E%D1%82%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%BE%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D,%20%D0%92%D1%8B%20%D1%83%D1%81%D0%BF%D0%B5%D1%88%D0%BD%D0%BE%20%D0%BF%D1%80%D0%BE%D1%88%D0%BB%D0%B8%20%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D0%B4%D1%83%D1%80%D1%83%20%D0%B8%D0%BC%D0%BF%D0%BB%D0%B0%D0%BD%D1%82%D0%B0%D1%86%D0%B8%D0%B8%20%D0%B7%D1%83%D0%B1%D0%BE%D0%B2!%20%3Cdiv%3E%3Cbr%3E%3C/div%3E%D0%A1%D0%BB%D0%B5%D0%B4%D1%83%D0%B9%D1%82%D0%B5%20%D1%80%D0%B5%D0%BA%D0%BE%D0%BC%D0%B5%D0%BD%D0%B4%D0%B0%D1%86%D0%B8%D1%8F%D0%BC%20%D0%B4%D0%BE%D0%BA%D1%82%D0%BE%D1%80%D0%B0%20%D0%B8%20%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%20%D1%80%D0%B5%D0%B0%D0%B1%D0%B8%D0%BB%D0%B8%D1%82%D0%B0%D1%86%D0%B8%D0%B8%20%D0%BF%D1%80%D0%BE%D0%B9%D0%B4%D0%B5%D1%82%20%D0%B1%D1%8B%D1%81%D1%82%D1%80%D0%BE%20%D0%B8%20%D0%B1%D0%B5%D0%B7%20%D1%80%D0%B8%D1%81%D0%BA%D0%B0%20%D0%BE%D1%81%D0%BB%D0%BE%D0%B6%D0%BD%D0%B5%D0%BD%D0%B8%D0%B9:%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9E%D1%82%D0%BA%D0%B0%D0%B6%D0%B8%D1%82%D0%B5%D1%81%D1%8C%20%D0%BE%D1%82%20%D0%BA%D1%83%D1%80%D0%B5%D0%BD%D0%B8%D1%8F,%20%D1%83%D0%BF%D0%BE%D1%82%D1%80%D0%B5%D0%B1%D0%BB%D0%B5%D0%BD%D0%B8%D1%8F%20%D0%B5%D0%B4%D1%8B%20%D0%B8%20%D0%BD%D0%B0%D0%BF%D0%B8%D1%82%D0%BA%D0%BE%D0%B2%20%D0%B2%20%D1%82%D0%B5%D1%87%D0%B5%D0%BD%D0%B8%D0%B5%202-%D1%85%20%D1%87%D0%B0%D1%81%D0%BE%D0%B2%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9F%D0%B5%D1%80%D0%B2%D1%8B%D0%B5%202%20%D0%B4%D0%BD%D1%8F%20%D0%BF%D0%B8%D1%89%D0%B0%20%D0%B4%D0%BE%D0%BB%D0%B6%D0%BD%D0%B0%20%D0%B1%D1%8B%D1%82%D1%8C%20%D0%BF%D1%80%D0%B5%D0%B8%D0%BC%D1%83%D1%89%D0%B5%D1%81%D1%82%D0%B2%D0%B5%D0%BD%D0%BD%D0%BE%20%D0%BC%D1%8F%D0%B3%D0%BA%D0%BE%D0%B9%20%D0%B8%20%D1%83%D0%BC%D0%B5%D1%80%D0%B5%D0%BD%D0%BD%D0%BE%20%D1%82%D0%B5%D0%BF%D0%BB%D0%BE%D0%B9%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9F%D0%B5%D1%80%D0%B5%D0%B6%D0%B5%D0%B2%D1%8B%D0%B2%D0%B0%D0%B9%D1%82%D0%B5%20%D0%BF%D0%B8%D1%89%D1%83%20%D0%BD%D0%B0%20%D0%BF%D1%80%D0%BE%D1%82%D0%B8%D0%B2%D0%BE%D0%BF%D0%BE%D0%BB%D0%BE%D0%B6%D0%BD%D0%BE%D0%B9%20%D1%81%D1%82%D0%BE%D1%80%D0%BE%D0%BD%D0%B5%20%D0%BE%D1%82%20%D0%BE%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D0%B8%20%D0%B2%D0%BC%D0%B5%D1%88%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D1%81%D1%82%D0%B2%D0%B0%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9F%D0%B5%D1%80%D0%B2%D1%8B%D0%B5%203%20%D1%81%D1%83%D1%82%D0%BE%D0%BA%20%D0%BF%D1%80%D0%B8%D0%BA%D0%BB%D0%B0%D0%B4%D1%8B%D0%B2%D0%B0%D0%B9%D1%82%D0%B5%20%D1%85%D0%BE%D0%BB%D0%BE%D0%B4%20(3-5%20%D1%80%D0%B0%D0%B7%20%D0%B2%20%D0%B4%D0%B5%D0%BD%D1%8C%20%D0%BF%D0%BE%205%20%D0%BC%D0%B8%D0%BD%D1%83%D1%82)%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%98%D1%81%D0%BA%D0%BB%D1%8E%D1%87%D0%B8%D1%82%D0%B5%20%D0%B0%D0%BA%D1%82%D0%B8%D0%B2%D0%BD%D1%83%D1%8E%20%D1%84%D0%B8%D0%B7%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D1%83%D1%8E%20%D0%BD%D0%B0%D0%B3%D1%80%D1%83%D0%B7%D0%BA%D1%83%20%D0%B2%20%D1%82%D0%B5%D1%87%D0%B5%D0%BD%D0%B8%D0%B5%202-%D1%85%20%D0%BD%D0%B5%D0%B4%D0%B5%D0%BB%D1%8C%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9D%D0%B5%20%D0%BF%D0%BE%D1%81%D0%B5%D1%89%D0%B0%D0%B9%D1%82%D0%B5%20%D0%B1%D0%B0%D0%BD%D1%8E,%20%D1%81%D0%B0%D1%83%D0%BD%D1%83,%20%D0%B3%D0%BE%D1%80%D1%8F%D1%87%D1%83%D1%8E%20%D0%B2%D0%B0%D0%BD%D0%BD%D1%83,%20%D0%B8%D0%B7%D0%B1%D0%B5%D0%B3%D0%B0%D0%B9%D1%82%D0%B5%20%D0%BF%D0%B5%D1%80%D0%B5%D0%BE%D1%85%D0%BB%D0%B0%D0%B6%D0%B4%D0%B5%D0%BD%D0%B8%D1%8F%3Cdiv%3E%3Cbr%3E%3C/div%3E%D0%92%20%D0%BF%D0%BE%D1%81%D0%BB%D0%B5%D0%BE%D0%BF%D0%B5%D1%80%D0%B0%D1%86%D0%B8%D0%BE%D0%BD%D0%BD%D0%BE%D0%BC%20%D0%BF%D0%B5%D1%80%D0%B8%D0%BE%D0%B4%D0%B5%20%D0%B2%D0%BE%D0%B7%D0%BC%D0%BE%D0%B6%D0%BD%D1%8B%20%D0%B1%D0%BE%D0%BB%D0%B5%D0%B2%D1%8B%D0%B5%20%D0%BE%D1%89%D1%83%D1%89%D0%B5%D0%BD%D0%B8%D1%8F,%20%D0%BF%D0%BE%D0%B2%D1%8B%D1%88%D0%B5%D0%BD%D0%B8%D0%B5%20%D1%82%D0%B5%D0%BC%D0%BF%D0%B5%D1%80%D0%B0%D1%82%D1%83%D1%80%D1%8B%20%D1%82%D0%B5%D0%BB%D0%B0,%20%D0%BE%D1%82%D0%B5%D0%BA%20%D0%BB%D0%B8%D1%86%D0%B0%20%D0%B8%20%D1%81%D0%BB%D0%B8%D0%B7%D0%B8%D1%81%D1%82%D0%BE%D0%B9%20%D0%BE%D0%B1%D0%BE%D0%BB%D0%BE%D1%87%D0%BA%D0%B8%20%D0%B2%20%D0%BE%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D0%B8%20%D0%BE%D0%BF%D0%B5%D1%80%D0%B0%D1%86%D0%B8%D0%BE%D0%BD%D0%BD%D0%BE%D0%B9%20%D1%80%D0%B0%D0%BD%D1%8B,%20%D1%83%D1%85%D1%83%D0%B4%D1%88%D0%B5%D0%BD%D0%B8%D0%B5%20%D0%BE%D0%B1%D1%89%D0%B5%D0%B3%D0%BE%20%D1%81%D0%B0%D0%BC%D0%BE%D1%87%D1%83%D0%B2%D1%81%D1%82%D0%B2%D0%B8%D1%8F,%20%D0%B2%D1%8B%D0%B4%D0%B5%D0%BB%D0%B5%D0%BD%D0%B8%D1%8F%20%D0%B8%D0%B7%20%D0%BD%D0%BE%D1%81%D0%BE%D0%B2%D0%BE%D0%B9%20%D0%BF%D0%BE%D0%BB%D0%BE%D1%81%D1%82%D0%B8.%3Cdiv%3E%3Cspan%20style=%22background-color:%20transparent;%22%3E%3Cbr%3E%3Cimg%20alt=%22%E2%9D%97%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2757.png%22%3E%D0%9E%D0%B1%D1%8F%D0%B7%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%20%D0%BF%D0%BE%D0%B7%D0%B2%D0%BE%D0%BD%D0%B8%D1%82%D0%B5%20%D0%B2%20%D0%BA%D0%BB%D0%B8%D0%BD%D0%B8%D0%BA%D1%83,%20%D0%B5%D1%81%D0%BB%D0%B8%20%D0%B4%D0%B5%D1%81%D0%BD%D0%B0%20%D0%BF%D1%80%D0%BE%D0%B4%D0%BE%D0%BB%D0%B6%D0%B0%D0%B5%D1%82%20%D0%BF%D1%80%D0%B8%D0%BF%D1%83%D1%85%D0%B0%D1%82%D1%8C%20%D0%B8%20%D0%B1%D0%BE%D0%BB%D0%B8%20%D1%83%D1%81%D0%B8%D0%BB%D0%B8%D0%B2%D0%B0%D1%8E%D1%82%D1%81%D1%8F%20%D0%BF%D0%BE%20%D0%B8%D1%81%D1%82%D0%B5%D1%87%D0%B5%D0%BD%D0%B8%D0%B8%203-%D1%85%20%D0%B4%D0%BD%D0%B5%D0%B9%20%D0%B8%D0%BB%D0%B8%20%D1%83%20%D0%92%D0%B0%D1%81%20%D0%BE%D0%B1%D1%89%D0%B5%D0%B5%20%D0%BF%D0%BB%D0%BE%D1%85%D0%BE%D0%B5%20%D1%81%D0%B0%D0%BC%D0%BE%D1%87%D1%83%D0%B2%D1%81%D1%82%D0%B2%D0%B8%D0%B5%20%D0%B4%D0%BB%D0%B8%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%D0%B5%20%D0%B2%D1%80%D0%B5%D0%BC%D1%8F%20%D0%B8%20%D0%BF%D0%BE%D0%B4%D0%BD%D1%8F%D0%BB%D0%B0%D1%81%D1%8C%20%D0%B2%D1%8B%D1%81%D0%BE%D0%BA%D0%B0%D1%8F%20%D1%82%D0%B5%D0%BC%D0%BF%D0%B5%D1%80%D0%B0%D1%82%D1%83%D1%80%D0%B0.%3C/span%3E%3C/div%3E%3Cspan%20style=%22background-color:%20transparent;%22%3E%3C/span%3E";
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= РаскодироватьСтроку(ШаблонСообщения_Объект.СодержаниеМессенджерHTML, СпособКодированияСтроки.URLВКодировкеURL);
	
	Если ВернутьОбъект Тогда 
		ШаблонСообщения_Объект.СодержаниеМессенджер = ПолучитьТекстИзHTMLКода(ШаблонСообщения_Объект.СодержаниеМессенджерHTML);
		Возврат ШаблонСообщения_Объект;
	КонецЕсли;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_Объект.Код) Тогда 
			ШаблонСообщения_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем шаблон
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_Объект);			
		Возврат ШаблонСообщения_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеШаблона
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

// Функция - Инициализировать шаблон сообщения рекомендации по уходу за брекет системой
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
//  НаименованиеРодителя - 	 - 
//  ВремяСобытия		 - 	 - 
//  ВернутьОбъект		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_РекомендацииПоУходуЗаБрекетСистемой(НаименованиеШаблона, НаименованиеРодителя = "", ВремяСобытия = Неопределено, ВернутьОбъект = Ложь)

	ШаблонСообщения_Объект 								= СоздатьЭлемент();
	ШаблонСообщения_Объект.Наименование 				= СокрЛП(НаименованиеШаблона);
	ШаблонСообщения_Объект.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_Объект.SMSВремяНачалаОтправки 		= ?(ЗначениеЗаполнено(ВремяСобытия), ВремяСобытия, Дата('0001.01.01 08:00:00'));
	ШаблонСообщения_Объект.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_Объект.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_Объект.Родитель 					= ИнициализироватьГруппуШаблонов(НаименованиеРодителя);	
	
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= "%7B%D0%98%D0%BC%D1%8F%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D&nbsp;%7B%D0%9E%D1%82%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%BE%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D,%20%D0%BF%D0%BE%D0%B7%D0%B4%D1%80%D0%B0%D0%B2%D0%BB%D1%8F%D0%B5%D0%BC%20%D1%81%20%D0%BD%D0%B0%D1%87%D0%B0%D0%BB%D0%BE%D0%BC%20%D0%BE%D1%80%D1%82%D0%BE%D0%B4%D0%BE%D0%BD%D1%82%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%BE%D0%B3%D0%BE%20%D0%BB%D0%B5%D1%87%D0%B5%D0%BD%D0%B8%D1%8F!%20%D0%AD%D1%82%D0%BE%20%D0%BF%D0%B5%D1%80%D0%B2%D1%8B%D0%B9%20%D1%88%D0%B0%D0%B3%20%D0%BD%D0%B0%20%D0%BF%D1%83%D1%82%D0%B8%20%D0%BA%20%D0%B7%D0%B4%D0%BE%D1%80%D0%BE%D0%B2%D1%8B%D0%BC,%20%D1%80%D0%BE%D0%B2%D0%BD%D1%8B%D0%BC%20%D0%B7%D1%83%D0%B1%D0%B0%D0%BC%20%D0%B8%20%D0%BA%D1%80%D0%B0%D1%81%D0%B8%D0%B2%D0%BE%D0%B9%20%D1%83%D0%BB%D1%8B%D0%B1%D0%BA%D0%B5.%20%3Cdiv%3E%3Cbr%3E%3C/div%3E%D0%A1%D0%BB%D0%B5%D0%B4%D1%83%D0%B9%D1%82%D0%B5%20%D1%80%D0%B5%D0%BA%D0%BE%D0%BC%D0%B5%D0%BD%D0%B4%D0%B0%D1%86%D0%B8%D1%8F%D0%BC%20%D0%B4%D0%BE%D0%BA%D1%82%D0%BE%D1%80%D0%B0,%20%D1%87%D1%82%D0%BE%D0%B1%D1%8B%20%D0%B4%D0%BE%D1%81%D1%82%D0%B8%D1%87%D1%8C%20%D0%BD%D0%B0%D0%B8%D0%BB%D1%83%D1%87%D1%88%D0%B5%D0%B3%D0%BE%20%D1%80%D0%B5%D0%B7%D1%83%D0%BB%D1%8C%D1%82%D0%B0%D1%82%D0%B0:%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%A7%D0%B8%D1%81%D1%82%D0%B8%D1%82%D1%8C%20%D0%B7%D1%83%D0%B1%D1%8B%202-3%20%D1%80%D0%B0%D0%B7%D0%B0%20%D0%B2%20%D0%B4%D0%B5%D0%BD%D1%8C,%20%D0%BF%D0%BE%D1%81%D0%BB%D0%B5%20%D0%BA%D0%B0%D0%B6%D0%B4%D0%BE%D0%B3%D0%BE%20%D0%BF%D1%80%D0%B8%D0%B5%D0%BC%D0%B0%20%D0%BF%D0%B8%D1%89%D0%B8,%20%D0%BF%D1%80%D0%BE%D0%B2%D0%BE%D0%B4%D0%B8%D1%82%D1%8C%20%D0%B3%D0%B8%D0%B3%D0%B8%D0%B5%D0%BD%D1%83%20%D0%B1%D1%80%D0%B5%D0%BA%D0%B5%D1%82-%D1%81%D0%B8%D1%81%D1%82%D0%B5%D0%BC%D1%8B%20%D1%89%D0%B5%D1%82%D0%BA%D0%BE%D0%B9%20%D1%81%20Y-%D0%BE%D0%B1%D1%80%D0%B0%D0%B7%D0%BD%D1%8B%D0%BC%20%D0%B2%D1%8B%D1%80%D0%B5%D0%B7%D0%BE%D0%BC,%20%D0%B5%D1%80%D1%88%D0%B8%D0%BA%D0%B0%D0%BC%D0%B8%20%D0%B8%20%D0%BC%D0%BE%D0%BD%D0%BE%D0%BF%D1%83%D1%87%D0%BA%D0%BE%D0%B2%D0%BE%D0%B9%20%D1%89%D0%B5%D1%82%D0%BA%D0%BE%D0%B9.%20%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%92%20%D0%BA%D0%B0%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%B5%20%D0%B4%D0%BE%D0%BF%D0%BE%D0%BB%D0%BD%D0%B8%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%D0%B3%D0%BE%20%D1%81%D1%80%D0%B5%D0%B4%D1%81%D1%82%D0%B2%D0%B0%20%D0%B3%D0%B8%D0%B3%D0%B8%D0%B5%D0%BD%D1%8B%20%D0%B8%D1%81%D0%BF%D0%BE%D0%BB%D1%8C%D0%B7%D0%BE%D0%B2%D0%B0%D1%82%D1%8C%20%D0%B8%D1%80%D1%80%D0%B8%D0%B3%D0%B0%D1%82%D0%BE%D1%80%20%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9E%D1%82%D0%BA%D0%B0%D0%B7%D0%B0%D1%82%D1%8C%D1%81%D1%8F%20%D0%BE%D1%82%20%D0%BB%D0%B8%D0%BF%D0%BA%D0%BE%D0%B9%20%D0%B8%20%D1%82%D1%8F%D0%B3%D1%83%D1%87%D0%B5%D0%B9%20%D0%BF%D0%B8%D1%89%D0%B8:%20%D0%B8%D1%80%D0%B8%D1%81%D0%BE%D0%BA,%20%D0%BD%D1%83%D0%B3%D0%B8,%20%D0%B6%D0%B5%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D1%8B%D1%85%20%D1%80%D0%B5%D0%B7%D0%B8%D0%BD%D0%BE%D0%BA%20%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%A2%D0%B2%D0%B5%D1%80%D0%B4%D1%8B%D0%B5%20%D0%BF%D1%80%D0%BE%D0%B4%D1%83%D0%BA%D1%82%D1%8B%20%D0%BD%D0%B5%D0%B6%D0%B5%D0%BB%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D1%8B,%20%D0%BF%D1%80%D0%B8%D0%BD%D0%B8%D0%BC%D0%B0%D1%82%D1%8C%20%D0%BF%D0%B8%D1%89%D1%83%20%D1%82%D0%BE%D0%BB%D1%8C%D0%BA%D0%BE%20%D0%B2%20%D0%B8%D0%B7%D0%BC%D0%B5%D0%BB%D1%8C%D1%87%D0%B5%D0%BD%D0%BD%D0%BE%D0%BC%20%D0%B2%D0%B8%D0%B4%D0%B5%20%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%A1%D0%BE%D0%BA%D1%80%D0%B0%D1%82%D0%B8%D1%82%D1%8C%20%D0%BF%D0%BE%D1%82%D1%80%D0%B5%D0%B1%D0%BB%D0%B5%D0%BD%D0%B8%D0%B5%20%D0%BA%D0%BE%D1%84%D0%B5%20%D0%B8%20%D1%87%D0%B0%D1%8F,%20%D0%BA%D0%BE%D1%82%D0%BE%D1%80%D1%8B%D0%B5%20%D1%81%D0%BF%D0%BE%D1%81%D0%BE%D0%B1%D1%81%D1%82%D0%B2%D1%83%D1%8E%D1%82%20%D0%BE%D0%B1%D1%80%D0%B0%D0%B7%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D1%8E%20%D0%B7%D1%83%D0%B1%D0%BD%D0%BE%D0%B3%D0%BE%20%D0%BD%D0%B0%D0%BB%D0%B5%D1%82%D0%B0%20%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9F%D0%BE%D1%81%D0%B5%D1%89%D0%B0%D1%82%D1%8C%20%D0%B3%D0%B8%D0%B3%D0%B8%D0%B5%D0%BD%D0%B8%D1%81%D1%82%D0%B0%20%D1%81%D1%82%D0%BE%D0%BC%D0%B0%D1%82%D0%BE%D0%BB%D0%BE%D0%B3%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%BE%D0%B3%D0%BE%20%D0%BA%D0%B0%D0%B6%D0%B4%D1%8B%D0%B5%203-4%20%D0%BC%D0%B5%D1%81%D1%8F%D1%86%D0%B0%3Cdiv%3E%3Cspan%20style=%22background-color:%20transparent;%22%3E%3C/span%3E%3C/div%3E%3Cspan%20style=%22background-color:%20transparent;%22%3E%3C/span%3E";
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= РаскодироватьСтроку(ШаблонСообщения_Объект.СодержаниеМессенджерHTML, СпособКодированияСтроки.URLВКодировкеURL);
	
	Если ВернутьОбъект Тогда 
		ШаблонСообщения_Объект.СодержаниеМессенджер = ПолучитьТекстИзHTMLКода(ШаблонСообщения_Объект.СодержаниеМессенджерHTML);
		Возврат ШаблонСообщения_Объект;
	КонецЕсли;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_Объект.Код) Тогда 
			ШаблонСообщения_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем шаблон
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_Объект);			
		Возврат ШаблонСообщения_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеШаблона
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

// Функция - Инициализировать шаблон сообщения рекомендации по уходу за элайнерами
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
//  НаименованиеРодителя - 	 - 
//  ВремяСобытия		 - 	 - 
//  ВернутьОбъект		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_РекомендацииПоУходуЗаЭлайнерами(НаименованиеШаблона, НаименованиеРодителя = "", ВремяСобытия = Неопределено, ВернутьОбъект = Ложь)

	ШаблонСообщения_Объект 								= СоздатьЭлемент();
	ШаблонСообщения_Объект.Наименование 				= СокрЛП(НаименованиеШаблона);
	ШаблонСообщения_Объект.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_Объект.SMSВремяНачалаОтправки 		= ?(ЗначениеЗаполнено(ВремяСобытия), ВремяСобытия, Дата('0001.01.01 08:00:00'));
	ШаблонСообщения_Объект.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_Объект.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_Объект.Родитель 					= ИнициализироватьГруппуШаблонов(НаименованиеРодителя);	
	
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= "%7B%D0%98%D0%BC%D1%8F%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D&nbsp;%7B%D0%9E%D1%82%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%BE%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D,%20%D0%BF%D0%BE%D0%B7%D0%B4%D1%80%D0%B0%D0%B2%D0%BB%D1%8F%D0%B5%D0%BC%20%D1%81%20%D0%BD%D0%B0%D1%87%D0%B0%D0%BB%D0%BE%D0%BC%20%D0%BE%D1%80%D1%82%D0%BE%D0%B4%D0%BE%D0%BD%D1%82%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%BE%D0%B3%D0%BE%20%D0%BB%D0%B5%D1%87%D0%B5%D0%BD%D0%B8%D1%8F!%20%D0%AD%D1%82%D0%BE%20%D0%BF%D0%B5%D1%80%D0%B2%D1%8B%D0%B9%20%D1%88%D0%B0%D0%B3%20%D0%BD%D0%B0%20%D0%BF%D1%83%D1%82%D0%B8%20%D0%BA%20%D0%B7%D0%B4%D0%BE%D1%80%D0%BE%D0%B2%D1%8B%D0%BC,%20%D1%80%D0%BE%D0%B2%D0%BD%D1%8B%D0%BC%20%D0%B7%D1%83%D0%B1%D0%B0%D0%BC%20%D0%B8%20%D0%BA%D1%80%D0%B0%D1%81%D0%B8%D0%B2%D0%BE%D0%B9%20%D1%83%D0%BB%D1%8B%D0%B1%D0%BA%D0%B5.%20%3Cdiv%3E%3Cbr%3E%3C/div%3E%D0%A1%D0%BB%D0%B5%D0%B4%D1%83%D0%B9%D1%82%D0%B5%20%D1%80%D0%B5%D0%BA%D0%BE%D0%BC%D0%B5%D0%BD%D0%B4%D0%B0%D1%86%D0%B8%D1%8F%D0%BC%20%D0%B4%D0%BE%D0%BA%D1%82%D0%BE%D1%80%D0%B0,%20%D1%87%D1%82%D0%BE%D0%B1%D1%8B%20%D0%B4%D0%BE%D1%81%D1%82%D0%B8%D1%87%D1%8C%20%D0%BD%D0%B0%D0%B8%D0%BB%D1%83%D1%87%D1%88%D0%B5%D0%B3%D0%BE%20%D1%80%D0%B5%D0%B7%D1%83%D0%BB%D1%8C%D1%82%D0%B0%D1%82%D0%B0:%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9D%D0%BE%D1%81%D0%B8%D1%82%D1%8C%20%D1%8D%D0%BB%D0%B0%D0%B9%D0%BD%D0%B5%D1%80%D1%8B%2022%20%D1%87%D0%B0%D1%81%D0%B0%20%D0%B8%D0%B7%2024,%20%D0%BA%D1%80%D0%BE%D0%BC%D0%B5%20%D0%B3%D0%B8%D0%B3%D0%B8%D0%B5%D0%BD%D1%8B%20%D0%B8%20%D0%BF%D1%80%D0%B8%D0%B5%D0%BC%D0%B0%20%D0%BF%D0%B8%D1%89%D0%B8.%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%A7%D0%B8%D1%81%D1%82%D0%B8%D1%82%D1%8C%20%D0%B7%D1%83%D0%B1%D1%8B%202-3%20%D1%80%D0%B0%D0%B7%D0%B0%20%D0%B2%20%D0%B4%D0%B5%D0%BD%D1%8C,%20%D0%BF%D0%BE%D1%81%D0%BB%D0%B5%20%D0%BA%D0%B0%D0%B6%D0%B4%D0%BE%D0%B3%D0%BE%20%D0%BF%D1%80%D0%B8%D0%B5%D0%BC%D0%B0%20%D0%BF%D0%B8%D1%89%D0%B8,%20%D0%BF%D1%80%D0%BE%D0%B2%D0%BE%D0%B4%D0%B8%D1%82%D1%8C%20%D0%B3%D0%B8%D0%B3%D0%B8%D0%B5%D0%BD%D1%83%20%D1%8D%D0%BB%D0%B0%D0%B9%D0%BD%D0%B5%D1%80%D0%BE%D0%B2%20%D1%81%20%D0%BF%D0%BE%D0%BC%D0%BE%D1%89%D1%8C%D1%8E%20%D1%89%D0%B5%D1%82%D0%BA%D0%B8%20%D0%B8%20%D0%B7%D1%83%D0%B1%D0%BD%D0%BE%D0%B9%20%D0%BF%D0%B0%D1%81%D1%82%D1%8B.%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9E%D1%82%D0%BA%D0%B0%D0%B6%D0%B8%D1%82%D0%B5%D1%81%D1%8C%20%D0%BE%D1%82%20%D0%BF%D1%80%D0%B8%D0%B5%D0%BC%D0%B0%20%D0%BF%D0%B8%D1%89%D0%B8%20%D0%B8%20%D0%B3%D0%BE%D1%80%D1%8F%D1%87%D0%B8%D1%85%20%D0%BD%D0%B0%D0%BF%D0%B8%D1%82%D0%BA%D0%BE%D0%B2%20%D0%B2%20%D1%8D%D0%BB%D0%B0%D0%B9%D0%BD%D0%B5%D1%80%D0%B0%D1%85.%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%AD%D0%BB%D0%B0%D0%B9%D0%BD%D0%B5%D1%80%D1%8B%20%D1%81%D0%BB%D0%B5%D0%B4%D1%83%D0%B5%D1%82%20%D1%85%D1%80%D0%B0%D0%BD%D0%B8%D1%82%D1%8C%20%D0%B2%20%D0%BA%D0%B5%D0%B9%D1%81%D0%B5,%20%D0%B4%D0%BB%D1%8F%20%D0%BF%D1%80%D0%B5%D0%B4%D0%BE%D1%82%D0%B2%D1%80%D0%B0%D1%89%D0%B5%D0%BD%D0%B8%D1%8F%20%D0%BC%D0%B5%D1%85%D0%B0%D0%BD%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D1%85%20%D0%BF%D0%BE%D0%B2%D1%80%D0%B5%D0%B6%D0%B4%D0%B5%D0%BD%D0%B8%D0%B9.%20%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%E2%9C%85%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/2705.png%22%3E%20%D0%9F%D0%BE%D1%81%D0%B5%D1%89%D0%B0%D1%82%D1%8C%20%D0%B3%D0%B8%D0%B3%D0%B8%D0%B5%D0%BD%D0%B8%D1%81%D1%82%D0%B0%20%D1%81%D1%82%D0%BE%D0%BC%D0%B0%D1%82%D0%BE%D0%BB%D0%BE%D0%B3%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%BE%D0%B3%D0%BE%20%D0%BA%D0%B0%D0%B6%D0%B4%D1%8B%D0%B5%203-4%20%D0%BC%D0%B5%D1%81%D1%8F%D1%86%D0%B0.%3Cdiv%3E%3Cspan%20style=%22background-color:%20transparent;%22%3E%3C/span%3E%3C/div%3E%3Cspan%20style=%22background-color:%20transparent;%22%3E%3C/span%3E";
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= РаскодироватьСтроку(ШаблонСообщения_Объект.СодержаниеМессенджерHTML, СпособКодированияСтроки.URLВКодировкеURL);
	
	Если ВернутьОбъект Тогда 
		ШаблонСообщения_Объект.СодержаниеМессенджер = ПолучитьТекстИзHTMLКода(ШаблонСообщения_Объект.СодержаниеМессенджерHTML);
		Возврат ШаблонСообщения_Объект;
	КонецЕсли;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_Объект.Код) Тогда 
			ШаблонСообщения_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем шаблон
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_Объект);			
		Возврат ШаблонСообщения_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеШаблона
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;
	
КонецФункции




#КонецОбласти

// Функция - Инициализировать шаблон сообщения как ваше самочувствие после операции
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
//  НаименованиеРодителя - 	 - 
//  ВремяСобытия		 - 	 - 
//  ВернутьОбъект		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_КакВашеСамочувствиеПослеОперации(НаименованиеШаблона, НаименованиеРодителя = "", ВремяСобытия = Неопределено, ВернутьОбъект = Ложь)

	ШаблонСообщения_Объект 								= СоздатьЭлемент();
	ШаблонСообщения_Объект.Наименование 				= СокрЛП(НаименованиеШаблона);
	ШаблонСообщения_Объект.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_Объект.SMSВремяНачалаОтправки 		= ?(ЗначениеЗаполнено(ВремяСобытия), ВремяСобытия, Дата('0001.01.01 08:00:00'));
	ШаблонСообщения_Объект.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_Объект.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_Объект.Родитель 					= ИнициализироватьГруппуШаблонов(НаименованиеРодителя);	
	
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= "%7B%D0%98%D0%BC%D1%8F%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D%20%7B%D0%9E%D1%82%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%BE%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D,%20%D0%B4%D0%BE%D0%B1%D1%80%D1%8B%D0%B9%20%D0%B4%D0%B5%D0%BD%D1%8C!%3Cdiv%3E%3C/div%3E%D0%9A%D0%B0%D0%BA%20%D0%B2%D0%B0%D1%88%D0%B5%20%D1%81%D0%B0%D0%BC%D0%BE%D1%87%D1%83%D0%B2%D1%81%D1%82%D0%B2%D0%B8%D0%B5%20%D0%BF%D0%BE%D1%81%D0%BB%D0%B5%20%D0%BE%D0%BF%D0%B5%D1%80%D0%B0%D1%86%D0%B8%D0%B8?";
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= РаскодироватьСтроку(ШаблонСообщения_Объект.СодержаниеМессенджерHTML, СпособКодированияСтроки.URLВКодировкеURL);
		
	Если ВернутьОбъект Тогда 
		ШаблонСообщения_Объект.СодержаниеМессенджер = ПолучитьТекстИзHTMLКода(ШаблонСообщения_Объект.СодержаниеМессенджерHTML);
		Возврат ШаблонСообщения_Объект;
	КонецЕсли;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_Объект.Код) Тогда 
			ШаблонСообщения_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем шаблон
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_Объект);			
		Возврат ШаблонСообщения_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеШаблона
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

// Функция - Инициализировать шаблон сообщения чат бота
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщенияЧатБота(НаименованиеШаблона) Экспорт
	
	НаименованиеШаблона = СокрЛП(НаименованиеШаблона);
	Если НЕ ЗначениеЗаполнено(НаименованиеШаблона) Тогда 
		Возврат ПустаяСсылка();
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеШаблонаТочноеПопадание"	, СокрЛ(НаименованиеШаблона));		
	Запрос.УстановитьПараметр("НаименованиеШаблона"					, СокрЛ(НаименованиеШаблона) + "%");
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВложенныйЗапрос.Ссылка КАК ШаблонСообщения
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		ШаблоныСообщений.Ссылка КАК Ссылка,
	|		1 КАК Приоритет
	|	ИЗ
	|		Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|	ГДЕ
	|		ШаблоныСообщений.Наименование ПОДОБНО &НаименованиеШаблонаТочноеПопадание
	|		И ШаблоныСообщений.ПометкаУдаления = ЛОЖЬ
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ ПЕРВЫЕ 1
	|		ШаблоныСообщений.Ссылка,
	|		2
	|	ИЗ
	|		Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|	ГДЕ
	|		ШаблоныСообщений.Наименование ПОДОБНО &НаименованиеШаблона
	|		И ШаблоныСообщений.ПометкаУдаления = ЛОЖЬ
	|	
	|	УПОРЯДОЧИТЬ ПО
	|		Приоритет) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Приоритет";
	
	ВыборкаШаблона = Запрос.Выполнить().Выбрать();
	Если ВыборкаШаблона.Следующий() Тогда 
		Возврат ВыборкаШаблона.ШаблонСообщения;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции	

// Функция - Инициализировать шаблон сообщения вопрос о подтверждении записи на прием
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
//  ВремяСобытия		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_ВопросОПодтвержденииЗаписиНаПрием(НаименованиеШаблона, ВремяСобытия = Неопределено, ВернутьОбъект = Ложь) Экспорт 
	
	// Вопрос пациентам о подтверждении предварительной записи
	ШаблонСообщения_Объект 								= СоздатьЭлемент();
	ШаблонСообщения_Объект.Наименование 				= НаименованиеШаблона;
	ШаблонСообщения_Объект.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_Объект.SMSВремяНачалаОтправки 		= ?(ЗначениеЗаполнено(ВремяСобытия), ВремяСобытия, Дата('0001.01.01 08:00:00'));
	ШаблонСообщения_Объект.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_Объект.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_Объект.Содержание 					= "{ИмяПациента} {ОтчествоПациента}, напоминаем, что Вы записаны на приём в клинику ""{КлиникаЗаписи}""
	|	
	|Дата приёма: {ДатаЗаписи}   
	|Время приема: {ВремяНачалаЗаписьПриема} 
	|
	|Подтверждаете визит?";
	
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= "%7B%D0%98%D0%BC%D1%8F%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D%20%7B%D0%9E%D1%82%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%BE%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D,%20%D0%BD%D0%B0%D0%BF%D0%BE%D0%BC%D0%B8%D0%BD%D0%B0%D0%B5%D0%BC,%20%D1%87%D1%82%D0%BE%20%D0%92%D1%8B%20%D0%B7%D0%B0%D0%BF%D0%B8%D1%81%D0%B0%D0%BD%D1%8B%20%D0%BD%D0%B0%20%D0%BF%D1%80%D0%B8%D0%B5%D0%BC%20%D0%B2%20%D0%BA%D0%BB%D0%B8%D0%BD%D0%B8%D0%BA%D1%83%20%3Cimg%20alt=%22%3F%3F%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/1f3e5.png%22%3E&nbsp;%22%7B%D0%9A%D0%BB%D0%B8%D0%BD%D0%B8%D0%BA%D0%B0%D0%97%D0%B0%D0%BF%D0%B8%D1%81%D0%B8%7D%22%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%3F%3F%EF%B8%8F%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/1f5d3.png%22%3E&nbsp;%7B%D0%94%D0%B0%D1%82%D0%B0%D0%97%D0%B0%D0%BF%D0%B8%D1%81%D0%B8%7D&nbsp;%3Cbr%3E%3Cimg%20alt=%22%E2%8F%B0%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/23f0.png%22%3E%20%7B%D0%92%D1%80%D0%B5%D0%BC%D1%8F%D0%9D%D0%B0%D1%87%D0%B0%D0%BB%D0%B0%D0%97%D0%B0%D0%BF%D0%B8%D1%81%D1%8C%D0%9F%D1%80%D0%B8%D0%B5%D0%BC%D0%B0%7D&nbsp;%3Cbr%3E%3Cimg%20alt=%22%3F%3F%E2%80%8D%E2%9A%95%EF%B8%8F%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/1f468-2695.png%22%3E&nbsp;%7B%D0%92%D1%80%D0%B0%D1%87%D0%97%D0%B0%D0%BF%D0%B8%D1%81%D0%B8%D0%9D%D0%B0%D0%9F%D1%80%D0%B8%D0%B5%D0%BC%D0%A4%D0%98%D0%9E%7D%3Cdiv%3E%3Cbr%3E%3C/div%3E%D0%9F%D0%BE%D0%B4%D1%82%D0%B2%D0%B5%D1%80%D0%B6%D0%B4%D0%B0%D0%B5%D1%82%D0%B5%20%D0%B2%D0%B8%D0%B7%D0%B8%D1%82?";
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= РаскодироватьСтроку(ШаблонСообщения_Объект.СодержаниеМессенджерHTML, СпособКодированияСтроки.URLВКодировкеURL);
	
	Если ВернутьОбъект Тогда 
		ШаблонСообщения_Объект.СодержаниеМессенджер = ПолучитьТекстИзHTMLКода(ШаблонСообщения_Объект.СодержаниеМессенджерHTML);
		Возврат ШаблонСообщения_Объект;
	КонецЕсли;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_Объект.Код) Тогда 
			ШаблонСообщения_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем шаблон
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_Объект);			
		Возврат ШаблонСообщения_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения с напоминанием клиентам о предварительной записи 
		|по причине: %1'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонКомментария,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		//ВызватьИсключение;
	КонецПопытки;

КонецФункции

// Функция - Инициализировать шаблон сообщения вопрос о записи на проф осмотр
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
//  ВремяСобытия		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_ВопросОЗаписиНаПрофОсмотр(НаименованиеШаблона, ВремяСобытия = Неопределено, ВернутьОбъект = Ложь) Экспорт 
	
	// Вопрос пациентам о записи на проф. осмотр
	ШаблонСообщения_Объект 								= СоздатьЭлемент();
	ШаблонСообщения_Объект.Наименование 				= НаименованиеШаблона;
	ШаблонСообщения_Объект.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_Объект.SMSВремяНачалаОтправки 		= ?(ЗначениеЗаполнено(ВремяСобытия), ВремяСобытия, Дата('0001.01.01 08:00:00'));
	ШаблонСообщения_Объект.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_Объект.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_Объект.Содержание 					= "{ИмяПациента} {ОтчествоПациента}, напоминаем, что у Вас запланирован профилактический осмотр у врача {ВрачПоЛистуОжиданияНаПриемФИО} в клинике ""{КлиникаПоЛистуОжидания}""
															|Запланированная дата приёма: {ДатаЗапланированнаяПоЛистуОжидания} 
															|
															|Записать Вас на профилактический осмотр?";
	
	Если ВернутьОбъект Тогда 
		Возврат ШаблонСообщения_Объект;
	КонецЕсли;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_Объект.Код) Тогда 
			ШаблонСообщения_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем шаблон
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_Объект);			
		Возврат ШаблонСообщения_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения с напоминанием клиентам о предварительной записи на профилактический осмотр
		|по причине: %1'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонКомментария,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		//ВызватьИсключение;
	КонецПопытки;

КонецФункции

// Функция - Инициализировать шаблон сообщения подтверждение выбранных параметров записи
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
//  ВремяСобытия		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_ПодтверждениеВыбранныхПараметровЗаписи(НаименованиеШаблона, ВремяСобытия = Неопределено, ВернутьОбъект = Ложь) Экспорт 
	
	// Вопрос пациентам о подтверждении выбранных параметров записи
	ШаблонСообщения_Объект 								= СоздатьЭлемент();
	ШаблонСообщения_Объект.Наименование 				= НаименованиеШаблона;
	ШаблонСообщения_Объект.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_Объект.SMSВремяНачалаОтправки 		= ?(ЗначениеЗаполнено(ВремяСобытия), ВремяСобытия, Дата('0001.01.01 08:00:00'));
	ШаблонСообщения_Объект.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_Объект.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_Объект.Содержание 					= "Вы выбрали:
															|	
															|{ДатаЗаписи} ⏰ {ВремяНачалаЗаписьПриема} 
															|к врачу: {ВрачЗаписиНаПриемФИО}
															|
															|Верно?";
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= "%D0%92%D1%8B%20%D0%B2%D1%8B%D0%B1%D1%80%D0%B0%D0%BB%D0%B8:%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22??%EF%B8%8F%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/1f5d3.png%22%3E&nbsp;%7B%D0%94%D0%B0%D1%82%D0%B0%D0%97%D0%B0%D0%BF%D0%B8%D1%81%D0%B8%7D&nbsp;%3Cbr%3E%3Cimg%20alt=%22%E2%8F%B0%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/23f0.png%22%3E%20%7B%D0%92%D1%80%D0%B5%D0%BC%D1%8F%D0%9D%D0%B0%D1%87%D0%B0%D0%BB%D0%B0%D0%97%D0%B0%D0%BF%D0%B8%D1%81%D1%8C%D0%9F%D1%80%D0%B8%D0%B5%D0%BC%D0%B0%7D&nbsp;%3Cbr%3E%3Cimg%20alt=%22??%E2%80%8D%E2%9A%95%EF%B8%8F%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/1f468-2695.png%22%3E&nbsp;%7B%D0%92%D1%80%D0%B0%D1%87%D0%97%D0%B0%D0%BF%D0%B8%D1%81%D0%B8%D0%9D%D0%B0%D0%9F%D1%80%D0%B8%D0%B5%D0%BC%D0%A4%D0%98%D0%9E%7D%3Cdiv%3E%3Cbr%3E%3C/div%3E%D0%92%D0%B5%D1%80%D0%BD%D0%BE?";
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= РаскодироватьСтроку(ШаблонСообщения_Объект.СодержаниеМессенджерHTML, СпособКодированияСтроки.URLВКодировкеURL);	
	
	Если ВернутьОбъект Тогда 
		ШаблонСообщения_Объект.СодержаниеМессенджер = ПолучитьТекстИзHTMLКода(ШаблонСообщения_Объект.СодержаниеМессенджерHTML);
		Возврат ШаблонСообщения_Объект;
	КонецЕсли;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_Объект.Код) Тогда 
			ШаблонСообщения_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем шаблон
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_Объект);			
		Возврат ШаблонСообщения_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения о подтверждении выбранных параметров записи
		|по причине: %1'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонКомментария,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		//ВызватьИсключение;
	КонецПопытки;

КонецФункции

// Функция - Инициализировать шаблон сообщения сообщение о подтверждении записи
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
//  ВремяСобытия		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_СообщениеОПодтвержденииЗаписи(НаименованиеШаблона, ВремяСобытия = Неопределено, ВернутьОбъект = Ложь) Экспорт 
	
	// Сообщение о подтверждении предварительной записи
	ШаблонСообщения_Объект 								= СоздатьЭлемент();
	ШаблонСообщения_Объект.Наименование 				= НаименованиеШаблона;
	ШаблонСообщения_Объект.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_Объект.SMSВремяНачалаОтправки 		= ?(ЗначениеЗаполнено(ВремяСобытия), ВремяСобытия, Дата('0001.01.01 08:00:00'));
	ШаблонСообщения_Объект.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_Объект.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_Объект.Содержание 					= "Спасибо за подтверждение!
															|Ждем Вас в назначенное время по адресу: 
															|
															|{КороткийАдресКлиники}";
	
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= "%D0%A1%D0%BF%D0%B0%D1%81%D0%B8%D0%B1%D0%BE%20%D0%B7%D0%B0%20%D0%BF%D0%BE%D0%B4%D1%82%D0%B2%D0%B5%D1%80%D0%B6%D0%B4%D0%B5%D0%BD%D0%B8%D0%B5!%3Cdiv%3E%3C/div%3E%D0%96%D0%B4%D0%B5%D0%BC%20%D0%92%D0%B0%D1%81%20%D0%B2%20%D0%BD%D0%B0%D0%B7%D0%BD%D0%B0%D1%87%D0%B5%D0%BD%D0%BD%D0%BE%D0%B5%20%D0%B2%D1%80%D0%B5%D0%BC%D1%8F%20%D0%BF%D0%BE%20%D0%B0%D0%B4%D1%80%D0%B5%D1%81%D1%83:%3Cdiv%3E%3Cspan%20style=%22background-color:%20transparent;%22%3E%3Cimg%20alt=%22%3F%3F%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/1f3e5.png%22%3E%7B%D0%9A%D0%BE%D1%80%D0%BE%D1%82%D0%BA%D0%B8%D0%B9%D0%90%D0%B4%D1%80%D0%B5%D1%81%D0%9A%D0%BB%D0%B8%D0%BD%D0%B8%D0%BA%D0%B8%7D%3C/span%3E%3C/div%3E%3Cdiv%3E%3Cspan%20style=%22background-color:%20transparent;%22%3E%3Cimg%20alt=%22%3F%3F%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/1f4cd.png%22%3E%3C/span%3E%3Cspan%20style=%22background-color:%20transparent;%22%3E%7B%D0%AF%D0%BD%D0%B4%D0%B5%D0%BA%D1%81%D0%9A%D0%B0%D1%80%D1%82%D1%8B%7D%3C/span%3E%3C/div%3E";
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= РаскодироватьСтроку(ШаблонСообщения_Объект.СодержаниеМессенджерHTML, СпособКодированияСтроки.URLВКодировкеURL);
	
	Если ВернутьОбъект Тогда 
		ШаблонСообщения_Объект.СодержаниеМессенджер = ПолучитьТекстИзHTMLКода(ШаблонСообщения_Объект.СодержаниеМессенджерHTML);
		Возврат ШаблонСообщения_Объект;
	КонецЕсли;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_Объект.Код) Тогда 
			ШаблонСообщения_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем шаблон
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_Объект);			
		Возврат ШаблонСообщения_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон с сообщением о подтверждении предварительной записи 
		|по причине: %1'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонКомментария,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		//ВызватьИсключение;
	КонецПопытки;

КонецФункции

// Функция - Инициализировать шаблон сообщения сообщение об успешном оформлении предварительной записи
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
//  ВремяСобытия		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_СообщениеОбУспешномОформленииПредварительнойЗаписи(НаименованиеШаблона, ВремяСобытия = Неопределено, ВернутьОбъект = Ложь) Экспорт 
	
	// Сообщение об успешном оформлении предварительной записи
	ШаблонСообщения_Объект 								= СоздатьЭлемент();
	ШаблонСообщения_Объект.Наименование 				= НаименованиеШаблона;
	ШаблонСообщения_Объект.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_Объект.SMSВремяНачалаОтправки 		= ?(ЗначениеЗаполнено(ВремяСобытия), ВремяСобытия, Дата('0001.01.01 08:00:00'));
	ШаблонСообщения_Объект.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_Объект.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_Объект.Содержание 					= "Вы успешно записаны на Прием.
															|Ждем Вас в назначенное время по адресу: 
															|{КороткийАдресКлиники}";
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= "%7B%D0%98%D0%BC%D1%8F%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D&nbsp;%7B%D0%9E%D1%82%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%BE%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D,&nbsp;%D0%92%D1%8B%20%D0%B7%D0%B0%D0%BF%D0%B8%D1%81%D0%B0%D0%BD%D1%8B%20%D0%BD%D0%B0%20%D0%BF%D1%80%D0%B8%D1%91%D0%BC%20%D0%BA%20%D0%B2%D1%80%D0%B0%D1%87%D1%83&nbsp;%7B%D0%92%D1%80%D0%B0%D1%87%D0%97%D0%B0%D0%BF%D0%B8%D1%81%D0%B8%D0%9D%D0%B0%D0%9F%D1%80%D0%B8%D0%B5%D0%BC%D0%A4%D0%98%D0%9E%7D%3Cbr%3E%3Cbr%3E%3Cimg%20alt=%22??%EF%B8%8F%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/1f5d3.png%22%3E&nbsp;%7B%D0%94%D0%B0%D1%82%D0%B0%D0%97%D0%B0%D0%BF%D0%B8%D1%81%D0%B8%7D&nbsp;%3Cbr%3E%3Cimg%20alt=%22%E2%8F%B0%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/23f0.png%22%3E&nbsp;%7B%D0%92%D1%80%D0%B5%D0%BC%D1%8F%D0%9D%D0%B0%D1%87%D0%B0%D0%BB%D0%B0%D0%97%D0%B0%D0%BF%D0%B8%D1%81%D1%8C%D0%9F%D1%80%D0%B8%D0%B5%D0%BC%D0%B0%7D%3Cbr%3E%3Cbr%3E%D0%96%D0%B4%D0%B5%D0%BC%20%D0%92%D0%B0%D1%81%20%D0%BF%D0%BE%20%D0%B0%D0%B4%D1%80%D0%B5%D1%81%D1%83&nbsp;%7B%D0%9A%D0%BE%D1%80%D0%BE%D1%82%D0%BA%D0%B8%D0%B9%D0%90%D0%B4%D1%80%D0%B5%D1%81%D0%9A%D0%BB%D0%B8%D0%BD%D0%B8%D0%BA%D0%B8%7D";
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= РаскодироватьСтроку(ШаблонСообщения_Объект.СодержаниеМессенджерHTML, СпособКодированияСтроки.URLВКодировкеURL);	
	
	Если ВернутьОбъект Тогда 
		ШаблонСообщения_Объект.СодержаниеМессенджер = ПолучитьТекстИзHTMLКода(ШаблонСообщения_Объект.СодержаниеМессенджерHTML);
		Возврат ШаблонСообщения_Объект;
	КонецЕсли;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_Объект.Код) Тогда 
			ШаблонСообщения_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем шаблон
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_Объект);			
		Возврат ШаблонСообщения_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон с сообщением об успешном оформлении предварительной записи 
		|по причине: %1'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонКомментария,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		//ВызватьИсключение;
	КонецПопытки;

КонецФункции

// Функция - Инициализировать шаблон сообщения создание предварительной записи
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
//  ВремяСобытия		 - 	 - 
//  ВернутьОбъект		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_СозданиеПредварительнойЗаписи(НаименованиеШаблона, НаименованиеРодителя = "", ВремяСобытия = Неопределено, ВернутьОбъект = Ложь) Экспорт 
	
	ШаблонСообщения_Объект 								= СоздатьЭлемент();
	ШаблонСообщения_Объект.Наименование 				= СокрЛП(НаименованиеШаблона);
	ШаблонСообщения_Объект.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_Объект.SMSВремяНачалаОтправки 		= ?(ЗначениеЗаполнено(ВремяСобытия), ВремяСобытия, Дата('0001.01.01 08:00:00'));
	ШаблонСообщения_Объект.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_Объект.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_Объект.Родитель 					= ИнициализироватьГруппуШаблонов(НаименованиеРодителя);	
	
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= "%7B%D0%98%D0%BC%D1%8F%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D%20%7B%D0%9E%D1%82%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%BE%D0%9F%D0%B0%D1%86%D0%B8%D0%B5%D0%BD%D1%82%D0%B0%7D,%20%D0%92%D1%8B%20%D0%B7%D0%B0%D0%BF%D0%B8%D1%81%D0%B0%D0%BD%D1%8B%20%D0%BD%D0%B0%20%D0%BF%D1%80%D0%B8%D1%91%D0%BC%20%D0%BA%20%D0%B2%D1%80%D0%B0%D1%87%D1%83%20%7B%D0%92%D1%80%D0%B0%D1%87%D0%97%D0%B0%D0%BF%D0%B8%D1%81%D0%B8%D0%9D%D0%B0%D0%9F%D1%80%D0%B8%D0%B5%D0%BC%D0%A4%D0%98%D0%9E%7D.%3Cdiv%3E%3Cbr%3E%3C/div%3E%3Cimg%20alt=%22%3F%3F%EF%B8%8F%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/1f5d3.png%22%3E&nbsp;%7B%D0%94%D0%B0%D1%82%D0%B0%D0%97%D0%B0%D0%BF%D0%B8%D1%81%D0%B8%7D&nbsp;%3Cdiv%3E%3C/div%3E%3Cimg%20alt=%22%E2%8F%B0%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/23f0.png%22%3E&nbsp;%7B%D0%92%D1%80%D0%B5%D0%BC%D1%8F%D0%9D%D0%B0%D1%87%D0%B0%D0%BB%D0%B0%D0%97%D0%B0%D0%BF%D0%B8%D1%81%D1%8C%D0%9F%D1%80%D0%B8%D0%B5%D0%BC%D0%B0%7D%20%3Cdiv%3E%3Cbr%3E%3C/div%3E%D0%96%D0%B4%D0%B5%D0%BC%20%D0%92%D0%B0%D1%81%20%D0%BF%D0%BE%20%D0%B0%D0%B4%D1%80%D0%B5%D1%81%D1%83:%3Cdiv%3E%20%3Cimg%20alt=%22%3F%3F%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/1f3e5.png%22%3E&nbsp;%7B%D0%9A%D0%BE%D1%80%D0%BE%D1%82%D0%BA%D0%B8%D0%B9%D0%90%D0%B4%D1%80%D0%B5%D1%81%D0%9A%D0%BB%D0%B8%D0%BD%D0%B8%D0%BA%D0%B8%7D%20.%3Cdiv%3E%3Cimg%20alt=%22%3F%3F%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/1f4cd.png%22%20style=%22font-size:%2016px;%22%3E%3Cspan%20style=%22background-color:%20transparent;%22%3E&nbsp;%3C/span%3E%3Cspan%20style=%22background-color:%20transparent;%22%3E%7B%D0%AF%D0%BD%D0%B4%D0%B5%D0%BA%D1%81%D0%9A%D0%B0%D1%80%D1%82%D1%8B%7D%3C/span%3E%3C/div%3E%3Cdiv%3E%3Cdiv%3E%3C/div%3E%3C/div%3E%3C/div%3E";
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= РаскодироватьСтроку(ШаблонСообщения_Объект.СодержаниеМессенджерHTML, СпособКодированияСтроки.URLВКодировкеURL);
	
	Если ВернутьОбъект Тогда 
		ШаблонСообщения_Объект.СодержаниеМессенджер = ПолучитьТекстИзHTMLКода(ШаблонСообщения_Объект.СодержаниеМессенджерHTML);
		Возврат ШаблонСообщения_Объект;
	КонецЕсли;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_Объект.Код) Тогда 
			ШаблонСообщения_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем шаблон
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_Объект);			
		Возврат ШаблонСообщения_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеШаблона
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;

КонецФункции

// Функция - Инициализировать шаблон сообщения напоминание о записи за2 часа
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
//  НаименованиеРодителя - 	 - 
//  ВремяСобытия		 - 	 - 
//  ВернутьОбъект		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_НапоминаниеОЗаписиЗа2Часа(НаименованиеШаблона, НаименованиеРодителя = "", ВремяСобытия = Неопределено, ВернутьОбъект = Ложь) Экспорт 
	
	ШаблонСообщения_Объект 								= СоздатьЭлемент();
	ШаблонСообщения_Объект.Наименование 				= СокрЛП(НаименованиеШаблона);
	ШаблонСообщения_Объект.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_Объект.SMSВремяНачалаОтправки 		= ?(ЗначениеЗаполнено(ВремяСобытия), ВремяСобытия, Дата('0001.01.01 08:00:00'));
	ШаблонСообщения_Объект.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_Объект.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_Объект.Родитель 					= ИнициализироватьГруппуШаблонов(НаименованиеРодителя);	
	
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= "%3Cimg%20alt=%22%E2%8C%9B%22%20class=%22emojioneemoji%22%20src=%22https://cdn.jsdelivr.net/emojione/assets/3.1/png/32/231b.png%22%3E%20%D0%96%D0%B4%D1%91%D0%BC%20%D0%92%D0%B0%D1%81%20%D0%B2%20%7B%D0%92%D1%80%D0%B5%D0%BC%D1%8F%D0%9D%D0%B0%D1%87%D0%B0%D0%BB%D0%B0%D0%97%D0%B0%D0%BF%D0%B8%D1%81%D1%8C%D0%9F%D1%80%D0%B8%D0%B5%D0%BC%D0%B0%7D";
	ШаблонСообщения_Объект.СодержаниеМессенджерHTML 	= РаскодироватьСтроку(ШаблонСообщения_Объект.СодержаниеМессенджерHTML, СпособКодированияСтроки.URLВКодировкеURL);
	
	Если ВернутьОбъект Тогда 
		ШаблонСообщения_Объект.СодержаниеМессенджер = ПолучитьТекстИзHTMLКода(ШаблонСообщения_Объект.СодержаниеМессенджерHTML);
		Возврат ШаблонСообщения_Объект;
	КонецЕсли;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_Объект.Код) Тогда 
			ШаблонСообщения_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем шаблон
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_Объект);			
		Возврат ШаблонСообщения_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеШаблона
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;

КонецФункции

// Функция - Инициализировать шаблон сообщения вопрос с просьбой оценить работу врача
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
//  ВремяСобытия		 - 	 - 
//  ВернутьОбъект		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_ВопросСПросьбойОценитьРаботуВрача(НаименованиеШаблона, ВремяСобытия = Неопределено, ВернутьОбъект = Ложь) Экспорт 
	
	// Вопрос с просьбой оценить работу врача
	ШаблонСообщения_Объект 								= СоздатьЭлемент();
	ШаблонСообщения_Объект.Наименование 				= НаименованиеШаблона;
	ШаблонСообщения_Объект.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_Объект.SMSВремяНачалаОтправки 		= ?(ЗначениеЗаполнено(ВремяСобытия), ВремяСобытия, Дата('0001.01.01 08:00:00'));
	ШаблонСообщения_Объект.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_Объект.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_Объект.Содержание 					= "{ИмяПациента} {ОтчествоПациента}, спасибо, что доверяете нам!
	|Оцените, пожалуйста, работу врача {СотрудникПриемаФИО} от 1 до 5.";
	
	Если ВернутьОбъект Тогда 
		Возврат ШаблонСообщения_Объект;
	КонецЕсли;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_Объект.Код) Тогда 
			ШаблонСообщения_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем шаблон
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_Объект);			
		Возврат ШаблонСообщения_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон с сообщением - просьбой оценить работу врача 
		|по причине: %1'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонКомментария,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		//ВызватьИсключение;
	КонецПопытки;

КонецФункции

// Функция - Инициализировать шаблон сообщения отправка информации по негативному отзыву
//
// Параметры:
//  НаименованиеШаблона	 - 	 - 
//  ВремяСобытия		 - 	 - 
//  ВернутьОбъект		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_ОтправкаИнформацииПоНегативномуОтзыву(НаименованиеШаблона, ВремяСобытия = Неопределено, ВернутьОбъект = Ложь) Экспорт 
	
	// Отправка информации по негативному отзыву
	ШаблонСообщения_Объект 								= СоздатьЭлемент();
	ШаблонСообщения_Объект.Наименование 				= НаименованиеШаблона;
	ШаблонСообщения_Объект.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_Объект.SMSВремяНачалаОтправки 		= ?(ЗначениеЗаполнено(ВремяСобытия), ВремяСобытия, Дата('0001.01.01 08:00:00'));
	ШаблонСообщения_Объект.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_Объект.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_Объект.Содержание 					= "Пациент {ФИОПациента}, {ДатаРожденияПациента} г.р. тел. {Телефон} оценил приём на {ОценкаПриема}
	|Клиника: {КлиникаПриема} 
	|Врач: {СотрудникПриемаФИО}
	|Ассистент: {АссистентПриема} 
	|Дата приёма: {ДатаПриема}
	|Сумма приёма: {СуммаПриема}";
	
	Если ВернутьОбъект Тогда 
		Возврат ШаблонСообщения_Объект;
	КонецЕсли;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_Объект.Код) Тогда 
			ШаблонСообщения_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем шаблон
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_Объект);			
		Возврат ШаблонСообщения_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон с информацией по негативному отзыву 
		|по причине: %1'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонКомментария,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		//ВызватьИсключение;
	КонецПопытки;

КонецФункции

// Функция - Инициализировать шаблон сообщения занятие проведено клиент прибыл
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_ЗанятиеПроведеноКлиентПрибыл() Экспорт 
	
	// Ссылка на оценку и отзыв
	ШаблонСообщения_ОценитеЗанятие 								= СоздатьЭлемент();
	ШаблонСообщения_ОценитеЗанятие.Наименование 				= НСтр("ru = 'Просьба оценить и оставить отзыв о занятии';en= 'Please rate and leave the feedback about the class'");
	ШаблонСообщения_ОценитеЗанятие.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_ОценитеЗанятие.SMSВремяНачалаОтправки 		= Дата('0001.01.01 08:00:00');
	ШаблонСообщения_ОценитеЗанятие.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_ОценитеЗанятие.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_ОценитеЗанятие.Содержание 					= НСтр("ru = 'Оцените, пожалуйста занятие от {ДатаЗанятия}, {ВремяНачалаЗанятия}. Детали: {СсылкаНаОценкуИОтзыв}'; en= 'Please rate a class from {ДатаЗанятия}, {ВремяНачалаЗанятия}. Details: {СсылкаНаОценкуИОтзыв}'");
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_ОценитеЗанятие.Код) Тогда 
			ШаблонСообщения_ОценитеЗанятие.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем триггер
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_ОценитеЗанятие);			
		Возврат ШаблонСообщения_ОценитеЗанятие.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения с просьбой оценить и оставить отзыв о занятии 
		|по причине: %1'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонКомментария,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		ВызватьИсключение;
	КонецПопытки;

КонецФункции

// Функция - Инициализировать шаблон сообщения лицевой счет взнос
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_ЛицевойСчетВзнос() Экспорт 
	
	ШаблонСообщения_ЛицевойСчетВзнос 							= СоздатьЭлемент();
	ШаблонСообщения_ЛицевойСчетВзнос.Наименование 				= НСтр("ru = 'Информирование пациента о взносе на лицевой счет';en= 'Informing the client about the contribution to the personal account'");
	ШаблонСообщения_ЛицевойСчетВзнос.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_ЛицевойСчетВзнос.SMSВремяНачалаОтправки 	= Дата('0001.01.01 08:00:00');
	ШаблонСообщения_ЛицевойСчетВзнос.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_ЛицевойСчетВзнос.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_ЛицевойСчетВзнос.Содержание 				= НСтр("ru= 'Пополнение лиц. счета';en= 'Personal account replenishment'") + " " 
																+ "{СуммаВзносаНаЛицевойСчет}" + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодЦелойчастиВалюты() + " "
																+ НСтр("ru= 'Остаток: ';en= 'Balance: '") + "{ОстатокНаЛицевомСчету}" + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодЦелойчастиВалюты();
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_ЛицевойСчетВзнос.Код) Тогда 
			ШаблонСообщения_ЛицевойСчетВзнос.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем триггер
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_ЛицевойСчетВзнос);			
		Возврат ШаблонСообщения_ЛицевойСчетВзнос.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения с информацией о взносе на лицевой счет пациента 
		|по причине: %1'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонКомментария,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		ВызватьИсключение;
	КонецПопытки;

КонецФункции

// Функция - Инициализировать шаблон сообщения лицевой счет списание
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_ЛицевойСчетСписание() Экспорт 
	
	ШаблонСообщения_ЛицевойСчетСписание 							= СоздатьЭлемент();
	ШаблонСообщения_ЛицевойСчетСписание.Наименование 				= НСтр("ru = 'Информирование пациента о списании с лицевого счета';en= 'Informing the client about debiting from the personal account'");
	ШаблонСообщения_ЛицевойСчетСписание.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_ЛицевойСчетСписание.SMSВремяНачалаОтправки 	= Дата('0001.01.01 08:00:00');
	ШаблонСообщения_ЛицевойСчетСписание.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_ЛицевойСчетСписание.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_ЛицевойСчетСписание.Содержание 				= НСтр("ru= 'Списание с лиц. счета';en= 'Debt from the personal account'") + " " 
																+ "{СуммаСписанияСЛицевогоСчета}" + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодЦелойчастиВалюты() + " "
																+ НСтр("ru= 'Остаток: ';en= 'Balance: '") + "{ОстатокНаЛицевомСчету}" + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодЦелойчастиВалюты();
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_ЛицевойСчетСписание.Код) Тогда 
			ШаблонСообщения_ЛицевойСчетСписание.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем триггер
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_ЛицевойСчетСписание);			
		Возврат ШаблонСообщения_ЛицевойСчетСписание.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения с информацией о списании с лицевого счета пациента 
		|по причине: %1'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонКомментария,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		ВызватьИсключение;
	КонецПопытки;

КонецФункции

// Функция - Инициализировать шаблон сообщения клиент день рождения
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_КлиентДеньРождения(ШаблонСообщения = Неопределено) Экспорт 
	
	Если ЗначениеЗаполнено(ШаблонСообщения) Тогда 
		Возврат ШаблонСообщения;
	КонецЕсли; 
		
	ШаблонСообщения_КлиентДеньРождения 								= СоздатьЭлемент();
	ШаблонСообщения_КлиентДеньРождения.Наименование 				= НСтр("ru = 'Поздраление клиента с днем рождения';en= 'Happy birthday to the client'");
	ШаблонСообщения_КлиентДеньРождения.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_КлиентДеньРождения.SMSВремяНачалаОтправки 		= Дата('0001.01.01 08:00:00');
	ШаблонСообщения_КлиентДеньРождения.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_КлиентДеньРождения.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_КлиентДеньРождения.Содержание 					= НСтр("ru= 'Примите наши поздравления,
																			|Частицу нашего тепла!
																			|Желаем крепкого здоровья, 
																			|Уюта, счастья и добра!
																			|																			
																			|Стоматологическая клиника "" {Клиника} ""';en= 'Congratulations,
																			| Part of our warmth!
																			| We wish you good health,
																			| Comfort, happiness and kindness!
																			|
																			| Clinic "" {Клиника} ""'");
	ШаблонСообщения_КлиентДеньРождения.ТекстHTML = "<html>
													|<head>
													|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
													|<meta http-equiv=""X-UA-Compatible"" content=""IE=Edge"" />
													|<meta name=""format-detection"" content=""telephone=no"" />
													|<style type=""text/css"">
													|body{margin:0;padding:8px;}
													|p{line-height:1.15;margin:0;white-space:pre-wrap;}
													|ol,ul{margin-top:0;margin-bottom:0;}
													|img{border:none;}
													|li>p{display:inline;}
													|</style>
													|</head>
													|<body>
													|<p>Примите наши поздравления,<br>Частицу нашего тепла!<br>Желаем крепкого здоровья, <br>Уюта, счастья и добра!<br>Стоматологическая клиника &quot;{Клиника}&quot;</p>
													|</body>
													|</html>";	
													
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_КлиентДеньРождения.Код) Тогда 
			ШаблонСообщения_КлиентДеньРождения.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем триггер
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_КлиентДеньРождения);			
		Возврат ШаблонСообщения_КлиентДеньРождения.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения с поздравлением клиента с днем рождения
		|по причине: %1'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонКомментария,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		ВызватьИсключение;
	КонецПопытки;

КонецФункции

// Функция - Инициализировать шаблон сообщения окончание срока действия страхового полиса
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_ОкончаниеСрокаДействияСтраховогоПолиса() Экспорт 
	
	ШаблонСообщения_ОкончаниеДействияПолиса 							= СоздатьЭлемент();
	ШаблонСообщения_ОкончаниеДействияПолиса.Наименование 				= НСтр("ru = 'Информирование клиента об окончании срока действия страхового полиса';en= 'Informing the client about the expiration of the insurance policy'");
	ШаблонСообщения_ОкончаниеДействияПолиса.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_ОкончаниеДействияПолиса.SMSВремяНачалаОтправки 		= Дата('0001.01.01 08:00:00');
	ШаблонСообщения_ОкончаниеДействияПолиса.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_ОкончаниеДействияПолиса.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_ОкончаниеДействияПолиса.Содержание 					= "{ИмяПациента} {ОтчествоПациента}, срок действия вашего страхового полиса {СерияПолиса} {НомерПолиса} истекает {ДатаОкончанияПолиса}.
	|
	|Клиника ""{Клиника}""";
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_ОкончаниеДействияПолиса.Код) Тогда 
			ШаблонСообщения_ОкончаниеДействияПолиса.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем триггер
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_ОкончаниеДействияПолиса);			
		Возврат ШаблонСообщения_ОкончаниеДействияПолиса.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения с информацией об окончании срока действия страхового полиса 
		|по причине: %1'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонКомментария,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		ВызватьИсключение;
	КонецПопытки;

КонецФункции

// Функция - Инициализировать шаблон сообщения смена статуса сотрудником клиники
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_СменаСтатусаЗаписиСотрудникомКлиники() Экспорт 
	
	ШаблонСообщения_СменаСтатусаЗаписи 								= СоздатьЭлемент();
	ШаблонСообщения_СменаСтатусаЗаписи.Наименование 				= НСтр("ru = 'Информирование клиента о подтверждении записи';en= 'Informing the client about the confirmation of the record'");
	ШаблонСообщения_СменаСтатусаЗаписи.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_СменаСтатусаЗаписи.SMSВремяНачалаОтправки 		= Дата('0001.01.01 08:00:00');
	ШаблонСообщения_СменаСтатусаЗаписи.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_СменаСтатусаЗаписи.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_СменаСтатусаЗаписи.Содержание 					= "{ИмяПациента} {ОтчествоПациента}, Ваша запись на приём к врачу {ВрачЗаписиНаПриемФИО}  подтверждена.
	|Ждем Вас {ДатаЗаписи} в {ВремяНачалаЗаписьПриема}.
	|
	|Клиника ""{КлиникаЗаписи}"" ";
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_СменаСтатусаЗаписи.Код) Тогда 
			ШаблонСообщения_СменаСтатусаЗаписи.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем триггер
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_СменаСтатусаЗаписи);			
		Возврат ШаблонСообщения_СменаСтатусаЗаписи.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения с информацией о подтвержденной предварительной записи на приём 
		|по причине: %1'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонКомментария,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		ВызватьИсключение;
	КонецПопытки;

КонецФункции

// Функция - Инициализировать шаблон сообщения запись на занятие
//
// Параметры:
//  ВремяСобытия - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_ЗаписьНаЗанятие() Экспорт 
	
	// Информирование о подтверждении занятия
	ШаблонСообщения_ИнформированиеОПодтверждении 							= СоздатьЭлемент();
	ШаблонСообщения_ИнформированиеОПодтверждении.Наименование 				= НСтр("ru = 'Информирование о подтверждении занятия';en= 'Informing about the confirmation of the lesson'");
	ШаблонСообщения_ИнформированиеОПодтверждении.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_ИнформированиеОПодтверждении.SMSВремяНачалаОтправки 	= Дата('0001.01.01 08:00:00');
	ШаблонСообщения_ИнформированиеОПодтверждении.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_ИнформированиеОПодтверждении.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_ИнформированиеОПодтверждении.Содержание 				= НСтр("ru = 'Вы записаны на {ДатаЗанятия}, в {ВремяНачалаЗанятия}. Детали: " + Символы.ПС + "{СсылкаНаИнформациюОЗаписиНаЗанятие}'; en= 'You are enrolled in {ДатаЗанятия}, at {ВремяНачалаЗанятия}. Details: " + Символы.ПС + "{СсылкаНаИнформациюОЗаписиНаЗанятие}'");
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_ИнформированиеОПодтверждении.Код) Тогда 
			ШаблонСообщения_ИнформированиеОПодтверждении.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем триггер
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_ИнформированиеОПодтверждении);			
		Возврат ШаблонСообщения_ИнформированиеОПодтверждении.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения с информированием о подтверждении занятия 
		|по причине: %1'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонКомментария,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		ВызватьИсключение;
	КонецПопытки;

КонецФункции

// Функция - Инициализировать шаблон сообщения начало приема
//
// Параметры:
//  ВремяСобытия - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьШаблонСообщения_НачалоПриема(ВремяСобытия = Неопределено) Экспорт 
	
	// Напоминание пациентам о предварительной записи на приём
	ШаблонСообщения_НапоминаниеПрием 							= СоздатьЭлемент();
	ШаблонСообщения_НапоминаниеПрием.Наименование 				= НСтр("ru = 'Напоминание пациентам о предварительной записи на приём';en= 'Reminder clients to make an appointment'");
	ШаблонСообщения_НапоминаниеПрием.ДатаСоздания 				= ТекущаяДатаСеанса();
	ШаблонСообщения_НапоминаниеПрием.SMSВремяНачалаОтправки 	= Дата('0001.01.01 08:00:00');
	ШаблонСообщения_НапоминаниеПрием.SMSВремяОкончанияОтправки 	= Дата('0001.01.01 20:00:00');
	ШаблонСообщения_НапоминаниеПрием.Автор 						= ПараметрыСеанса.ТекущийСотрудник;
	ШаблонСообщения_НапоминаниеПрием.Содержание 				= "{ИмяПациента} {ОтчествоПациента}, напоминаем, что Вы записаны на приём к врачу {ВрачЗаписиНаПриемФИО} в клинику ""{КлиникаЗаписи}""
	|Дата приёма: {ДатаЗаписи} 
	|Время приёма: {ВремяНачалаЗаписьПриема}";
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения_НапоминаниеПрием.Код) Тогда 
			ШаблонСообщения_НапоминаниеПрием.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем триггер
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонСообщения_НапоминаниеПрием);			
		Возврат ШаблонСообщения_НапоминаниеПрием.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.ШаблоныСообщений;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать шаблон сообщения с напоминанием клиентам о предварительной записи 
		|по причине: %1'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонКомментария,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеСправочника,,
		Комментарий);
		
		ВызватьИсключение;
	КонецПопытки;

КонецФункции

// Процедура, Переименовать параметры шаблонов сообщений
//
Процедура ПереименоватьПараметрыШаблоновСообщений() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ШаблоныСообщений.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|ГДЕ
	|	НЕ ШаблоныСообщений.ЭтоГруппа");  
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		РезультатСМС = "";
		РезультатЗадача = ""; 
		РезультатПисьмо = "";
		ШаблонСообщения = Выборка.Ссылка.ПолучитьОбъект(); 
		МассивПараметровСМС    = ПолучитьМассивПараметровИзШаблона(ШаблонСообщения.Содержание, "{}");
		МассивПараметровЗадача = ПолучитьМассивПараметровИзШаблона(ШаблонСообщения.ЗадачаОписание, "{}"); 
		МассивПараметровПисьма = ПолучитьМассивПараметровИзШаблона(ШаблонСообщения.ТекстHTML, "{}");
		Для Каждого ПараметрСМС Из МассивПараметровСМС Цикл
			Если ПараметрСМС = "ПолныйАдресСтруктурнойЕдиницы" Тогда
				РезультатСМС = "{ПолныйАдресКлиники}";
			ИначеЕсли ПараметрСМС = "КороткийАдресСтруктурнойЕдиницы" Тогда
				РезультатСМС = "{КороткийАдресКлиники}";
			ИначеЕсли ПараметрСМС = "СайтСтруктурнойЕдиницы" Тогда
				РезультатСМС = "{СайтКлиники}";  
			ИначеЕсли ПараметрСМС = "ФамилияКонтрагента" Тогда
				РезультатСМС = "{ФамилияПациента}";
			ИначеЕсли ПараметрСМС = "ИмяКонтрагента" Тогда
				РезультатСМС = "{ИмяПациента}"; 
			ИначеЕсли ПараметрСМС = "ОтчествоКонтрагента" Тогда
				РезультатСМС = "{ОтчествоПациента}";
			ИначеЕсли ПараметрСМС = "НаименованиеКонтрагента" Тогда
				РезультатСМС = "{ФИОПациента}";
			ИначеЕсли ПараметрСМС = "ДатаРожденияКлиента" Тогда
				РезультатСМС = "{ДатаРожденияПациента}"; 
			ИначеЕсли ПараметрСМС = "СтруктурнаяЕдиницаПоЛистуОжидания"	Тогда
				РезультатСМС = "{КлиникаПоЛистуОжидания}";
			ИначеЕсли ПараметрСМС = "СтруктурнаяЕдиницаЗаписи" Тогда
				РезультатСМС = "{КлиникаЗаписи}"; 
			ИначеЕсли ПараметрСМС = "СтруктурнаяЕдиницаПриема" Тогда
				РезультатСМС = "{КлиникаПриема}";
			Иначе
				РезультатСМС = "{" + ПараметрСМС + "}";
			КонецЕсли;
			
			Если РезультатСМС <> Неопределено Тогда
				ШаблонСообщения.Содержание = СтрЗаменить(ШаблонСообщения.Содержание, "{" + ПараметрСМС + "}", РезультатСМС);
			КонецЕсли; 		
		КонецЦикла;	
		
		Для Каждого ПараметрЗадача Из МассивПараметровЗадача Цикл
			Если ПараметрЗадача = "ПолныйАдресСтруктурнойЕдиницы" Тогда
				РезультатЗадача = "{ПолныйАдресКлиники}";
			ИначеЕсли ПараметрЗадача = "КороткийАдресСтруктурнойЕдиницы" Тогда
				РезультатЗадача = "{КороткийАдресКлиники}";
			ИначеЕсли ПараметрЗадача = "СайтСтруктурнойЕдиницы" Тогда
				РезультатЗадача = "{СайтКлиники}";  
			ИначеЕсли ПараметрЗадача = "ФамилияКонтрагента" Тогда
				РезультатЗадача = "{ФамилияПациента}";                             
			ИначеЕсли ПараметрЗадача = "ИмяКонтрагента" Тогда
				РезультатЗадача = "{ИмяПациента}";                               
			ИначеЕсли ПараметрЗадача = "ОтчествоКонтрагента" Тогда
				РезультатЗадача = "{ОтчествоПациента}";
			ИначеЕсли ПараметрЗадача = "НаименованиеКонтрагента" Тогда
				РезультатЗадача = "{ФИОПациента}";
			ИначеЕсли ПараметрЗадача = "{ДатаРожденияПациента}" Тогда
				РезультатЗадача = "{ДатаРожденияПациента}"; 
			ИначеЕсли ПараметрЗадача = "СтруктурнаяЕдиницаПоЛистуОжидания"	Тогда
				РезультатЗадача = "{КлиникаПоЛистуОжидания}";
			ИначеЕсли ПараметрЗадача = "СтруктурнаяЕдиницаЗаписи" Тогда
				РезультатЗадача = "{КлиникаЗаписи}"; 
			ИначеЕсли ПараметрЗадача = "СтруктурнаяЕдиницаПриема" Тогда
				РезультатЗадача = "{КлиникаПриема}";  
			Иначе 
				РезультатЗадача = "{" + ПараметрЗадача + "}";
			КонецЕсли;
			
			Если РезультатЗадача <> Неопределено Тогда
				ШаблонСообщения.ЗадачаОписание = СтрЗаменить(ШаблонСообщения.ЗадачаОписание, "{" + ПараметрЗадача + "}", РезультатЗадача);
			КонецЕсли; 		
		КонецЦикла;
		
		Для Каждого ПараметрПисьма Из МассивПараметровПисьма Цикл
			Если ПараметрПисьма = "ПолныйАдресСтруктурнойЕдиницы" Тогда
				РезультатПисьмо = "{ПолныйАдресКлиники}";
			ИначеЕсли ПараметрПисьма = "КороткийАдресСтруктурнойЕдиницы" Тогда
				РезультатПисьмо = "{КороткийАдресКлиники}";
			ИначеЕсли ПараметрПисьма = "СайтСтруктурнойЕдиницы" Тогда
				РезультатПисьмо = "{СайтКлиники}";  
			ИначеЕсли ПараметрПисьма = "ФамилияКонтрагента" Тогда
				РезультатПисьмо = "{ФамилияПациента}";                             
			ИначеЕсли ПараметрПисьма = "ИмяКонтрагента" Тогда
				РезультатПисьмо = "{ИмяПациента}";                               
			ИначеЕсли ПараметрПисьма = "ОтчествоКонтрагента" Тогда
				РезультатПисьмо = "{ОтчествоПациента}";
			ИначеЕсли ПараметрПисьма = "НаименованиеКонтрагента" Тогда
				РезультатПисьмо = "{ФИОПациента}";
			ИначеЕсли ПараметрПисьма = "{ДатаРожденияПациента}" Тогда
				РезультатПисьмо = "{ДатаРожденияПациента}"; 
			ИначеЕсли ПараметрПисьма = "СтруктурнаяЕдиницаПоЛистуОжидания"	Тогда
				РезультатПисьмо = "{КлиникаПоЛистуОжидания}";
			ИначеЕсли ПараметрПисьма = "СтруктурнаяЕдиницаЗаписи" Тогда
				РезультатПисьмо = "{КлиникаЗаписи}"; 
			ИначеЕсли ПараметрПисьма = "СтруктурнаяЕдиницаПриема" Тогда
				РезультатПисьмо = "{КлиникаПриема}";  
			Иначе 
				РезультатПисьмо = "{" + ПараметрПисьма + "}";
			КонецЕсли;
			
			Если РезультатПисьмо <> Неопределено Тогда
				ШаблонСообщения.ТекстHTML = СтрЗаменить(ШаблонСообщения.ТекстHTML, "{" + ПараметрПисьма + "}", РезультатПисьмо);
			КонецЕсли; 		
		КонецЦикла;
		
		Попытка			
			ШаблонСообщения.Записать(); 
		Исключение 
			ОбщегоНазначения.СообщитьПользователю("Возникла ошибка при сохранении изменений связанных с " + Строка(Выборка.Ссылка));	
		КонецПопытки;  		
		
	КонецЦикла;
	
КонецПроцедуры

// Функция, возвращает текстовое содержимое HTML кода.
//
Функция ПолучитьТекстИзHTMLКода(КодHTML) Экспорт
	
	ЧтениеHTML = Новый ЧтениеHTML;
	ЧтениеHTML.УстановитьСтроку(КодHTML);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументHTML = ПостроительDOM.Прочитать(ЧтениеHTML);
	
	ЧтениеHTML.Закрыть();
	
	Если ДокументHTML.Тело = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстовыйПостроитель = Новый ЗаписьXML;
	ТекстовыйПостроитель.УстановитьСтроку();
	
	ИзвлечьТекстHTMLЭлемента(ДокументHTML.Тело, ТекстовыйПостроитель);
	
	Возврат ТекстовыйПостроитель.Закрыть();
	
КонецФункции

// Процедура, рекурсивно извлекает текст из HTML элемента.
//
Процедура ИзвлечьТекстHTMLЭлемента(Элемент, ТекстовыйПостроитель)
	
	Если Элемент.ИмяУзла = "#text" Тогда
		ТекстовыйПостроитель.ЗаписатьБезОбработки(Элемент.ЗначениеУзла);
		
	ИначеЕсли Элемент.ИмяУзла = "br" Тогда
		ТекстовыйПостроитель.ЗаписатьБезОбработки(Символы.ПС);
		
	ИначеЕсли Элемент.ИмяУзла = "img" Тогда
		ПредставлениеУзла = ПолучитьПредставлениеЭмодзи(Элемент);
		ТекстовыйПостроитель.ЗаписатьБезОбработки(ПредставлениеУзла);
		
	Иначе
		Если Элемент.ИмяУзла = "div" Тогда
			ТекстовыйПостроитель.ЗаписатьБезОбработки(Символы.ПС);
		КонецЕсли;
		
		Для Каждого ВложенныйЭлемент Из Элемент.ДочерниеУзлы Цикл
			ИзвлечьТекстHTMLЭлемента(ВложенныйЭлемент, ТекстовыйПостроитель);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция, возвращает представление эмодзи по элементу картинки.
//
Функция ПолучитьПредставлениеЭмодзи(ЭлементКартинки)
	
	Если Не СтрНайти(ЭлементКартинки.ИмяКласса, "emojioneemoji") Тогда
		Возврат "";
	КонецЕсли;
	
	Источник = ЭлементКартинки.Источник;
	
	НачальнаяПозиция = СтрНайти(Источник, "/", НаправлениеПоиска.СКонца) + 1;
	КонечнаяПозиция	 = СтрНайти(Источник, ".", НаправлениеПоиска.СКонца);
	
	КодыСимволов = Сред(Источник, НачальнаяПозиция, КонечнаяПозиция - НачальнаяПозиция);
	
	Возврат КодовыеТочкиUnicodeВСтроку(КодыСимволов);
	
КонецФункции

#КонецОбласти

#КонецЕсли   
