
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеОбязательныхПолей = Константы.ОбязательныеПоляСделки.Получить().Получить();	
	
	СписокПолей = ПолучитьСписокПолей();
	
	Если ЗначениеЗаполнено(ДанныеОбязательныхПолей) Тогда
		
		Для Каждого Поле Из СписокПолей Цикл
			
			ОбязательноеПоле					 = ЭтотОбъект.ОбязательныеПоля.Добавить();
			ОбязательноеПоле.Поле				 = Поле.Значение;
			ОбязательноеПоле.ПредставлениеПоля	 = Поле.Представление;
			ОбязательноеПоле.Обязательно		 = Ложь;
			
			Для Каждого ДанныеПоля Из ДанныеОбязательныхПолей Цикл
				Если ДанныеПоля.Поле = Поле.Значение Тогда
					ОбязательноеПоле.Обязательно = ДанныеПоля.Обязательно;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого Поле Из СписокПолей Цикл
			
			ОбязательноеПоле					 = ЭтотОбъект.ОбязательныеПоля.Добавить();
			ОбязательноеПоле.Поле				 = Поле.Значение;
			ОбязательноеПоле.ПредставлениеПоля	 = Поле.Представление;
			ОбязательноеПоле.Обязательно		 = Ложь;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, сохраняет значение константы и закрывает форму.
//
Процедура Сохранить(Команда)
	
	ЗначениеКонстанты = Новый Массив;
	
	Для Каждого ДанныеПоля Из ЭтотОбъект.ОбязательныеПоля Цикл
		
		СтруктураДанныхПоля = Новый Структура;
		СтруктураДанныхПоля.Вставить("Поле"				, ДанныеПоля.Поле);
		СтруктураДанныхПоля.Вставить("Обязательно"		, ДанныеПоля.Обязательно);
		СтруктураДанныхПоля.Вставить("ПредставлениеПоля", ДанныеПоля.ПредставлениеПоля);
		
		ЗначениеКонстанты.Добавить(СтруктураДанныхПоля);
		
	КонецЦикла;
	
	СохранитьЗначениеКонстанты(ЗначениеКонстанты);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция, возвращает список полей.
//
Функция ПолучитьСписокПолей()
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("ИсточникИнформации"	, "Рекламный источник");
	СписокПолей.Добавить("КаналПривлечения"		, "Канал привлечения");
	СписокПолей.Добавить("СтруктурнаяЕдиница"	, "Клиника");
	СписокПолей.Добавить("Врач"					, "Врач");
	
	Возврат СписокПолей;
	
КонецФункции	

&НаСервереБезКонтекста
// Процедура, сохраняет значение константы.
//
Процедура СохранитьЗначениеКонстанты(ЗначениеКонстанты)
	
	Константы.ОбязательныеПоляСделки.Установить(Новый ХранилищеЗначения(ЗначениеКонстанты));
	
КонецПроцедуры

#КонецОбласти
