
#Область ОбработчикиСобытийФормы

// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	Элементы.СтатусРекламногоИсточника.Видимость = РольДоступна("ПолныеПрава");
//	Элементы.Наименование.МаксимальнаяШирина = ?(Элементы.СтатусРекламногоИсточника.Видимость, 21, 40);	
//	Элементы.СостояниеОбъекта.МаксимальнаяШирина = ?(Элементы.СтатусРекламногоИсточника.Видимость, 57, 51);	
	
	// Блок с условиями
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УсловияОтбора = Объект.Ссылка.Условия.Получить();
	КонецЕсли;
	
	Если УсловияОтбора <> Неопределено Тогда
		
		ЭтотОбъект.utm_source   = ?(УсловияОтбора.Свойство("source")  , УсловияОтбора.source  , ЭтотОбъект.utm_source);
		ЭтотОбъект.utm_medium   = ?(УсловияОтбора.Свойство("medium")  , УсловияОтбора.medium  , ЭтотОбъект.utm_medium);
		ЭтотОбъект.utm_campaign = ?(УсловияОтбора.Свойство("campaign"), УсловияОтбора.campaign, ЭтотОбъект.utm_campaign);
		ЭтотОбъект.utm_content  = ?(УсловияОтбора.Свойство("content") , УсловияОтбора.content , ЭтотОбъект.utm_content);
		ЭтотОбъект.utm_term     = ?(УсловияОтбора.Свойство("term")    , УсловияОтбора.term    , ЭтотОбъект.utm_term);
		ЭтотОбъект.КомментарийСодержит = ?(УсловияОтбора.Свойство("комментарий"), УсловияОтбора.комментарий, ЭтотОбъект.КомментарийСодержит);
		
		
	КонецЕсли;
	// Конец блок с условиями
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

// Процедура - При записи на сервере
//
// Параметры:
//  Отказ			 - 	 - 
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
КонецПроцедуры

// Процедура - При чтении на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
КонецПроцедуры

&НаСервере
// Процедура - Перед записью на сервере.
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	УсловияОтбора = ТекущийОбъект.Условия.Получить();
	
	Если УсловияОтбора = Неопределено Тогда
		УсловияОтбора = Новый Структура();
	КонецЕсли;
		
	ДобавитьРеквизитВСтруктуру(УсловияОтбора, "source", ЭтотОбъект.utm_source);
	ДобавитьРеквизитВСтруктуру(УсловияОтбора, "medium"	, ЭтотОбъект.utm_medium);
	ДобавитьРеквизитВСтруктуру(УсловияОтбора, "campaign" , ЭтотОбъект.utm_campaign);
	ДобавитьРеквизитВСтруктуру(УсловияОтбора, "content" , ЭтотОбъект.utm_content);
	ДобавитьРеквизитВСтруктуру(УсловияОтбора, "term" , ЭтотОбъект.utm_term);
	ДобавитьРеквизитВСтруктуру(УсловияОтбора, "комментарий" , ЭтотОбъект.КомментарийСодержит);
		
	ТекущийОбъект.Условия = Новый ХранилищеЗначения(УсловияОтбора);

КонецПроцедуры

#КонецОбласти

#Область СтандартныеПроцедурыИФункции

// Процедура, добавляет реквизит в структуру.
//
Процедура ДобавитьРеквизитВСтруктуру(УсловияОтбора, НаименованиеРеквизита, ЗначениеРеквизита)
	
	Если УсловияОтбора.Свойство(НаименованиеРеквизита) Тогда
		УсловияОтбора[НаименованиеРеквизита] = ЗначениеРеквизита;
	Иначе
		УсловияОтбора.Вставить(НаименованиеРеквизита, ЗначениеРеквизита); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

