#Область СлужебныеПроцедурыИФункции

// Функция - Заполнить классификатор услуг
// 
// Возвращаемое значение:
//   - 
//
Функция ЗаполнитьКлассификаторУслуг() Экспорт
	
	КолличествоЗагружено = 0;
	КолличествоОбновлено = 0;

	// Получим Область с данными диагноза из макета.
	Классификатор = ПолучитьМакет("КлассификаторУслуг");
	
	СписокУслуг = Классификатор.ПолучитьОбласть("СписокУслуг");
	
	ОбластьПолеКод          = Классификатор.Область("ПолеКод");
	ОбластьПолеУЕТ          = Классификатор.Область("ПолеУЕТ");
	ОбластьПолеНорма        = Классификатор.Область("ПолеНорма");
	ОбластьПолеНаименование = Классификатор.Область("ПолеНаименование");
	
	Для СтрокаНомерСтроки = 1 По СписокУслуг.ВысотаТаблицы Цикл
		
		СтрокаКод               = СписокУслуг.Область(СтрокаНомерСтроки, ОбластьПолеКод.Лево).Текст;
		СтрокаУЕТ               = СписокУслуг.Область(СтрокаНомерСтроки, ОбластьПолеУЕТ.Лево).Текст;
		СтрокаПолеНорма         = СписокУслуг.Область(СтрокаНомерСтроки, ОбластьПолеНорма.Лево).Текст;
		СтрокаПолеНаименование  = СписокУслуг.Область(СтрокаНомерСтроки, ОбластьПолеНаименование.Лево).Текст;
		
		Если Не ЗначениеЗаполнено(СтрокаПолеНаименование) Тогда
			Продолжить;
		КонецЕсли;
		
		НайденнаяУслуга = Справочники.КлассификаторНоменклатурыМедицинскихУслуг.НайтиПоНаименованию(Лев(СтрокаПолеНаименование, 150));
		Если Не ЗначениеЗаполнено(НайденнаяУслуга) Тогда
			КлассификаторОбъект = Справочники.КлассификаторНоменклатурыМедицинскихУслуг.СоздатьЭлемент();
			КолличествоЗагружено = КолличествоЗагружено + 1;
		Иначе
			КлассификаторОбъект = НайденнаяУслуга.ПолучитьОбъект();
			КолличествоОбновлено = КолличествоОбновлено + 1;
		КонецЕсли;
		
		Попытка 
			
			КлассификаторОбъект.Наименование	   = Лев(СтрокаПолеНаименование, 150);
			КлассификаторОбъект.НормаВремени	   = СтрокаПолеНорма;
			КлассификаторОбъект.УЕТ	               = СтрокаУЕТ;
			КлассификаторОбъект.Код                = СтрокаКод;
			
			КлассификаторОбъект.Записать();
			
		Исключение				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не загружена услуга " + СтрокаПолеНаименование + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Новый Структура("КолличествоЗагружено, КолличествоОбновлено", КолличествоЗагружено, КолличествоОбновлено);

КонецФункции

// Процедура - Обработка получения полей представления
//
// Параметры:
//  Поля				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
   	Поля.Добавить("Наименование");
	Поля.Добавить("Код");		
   
КонецПроцедуры

// Процедура - Обработка получения представления
//
// Параметры:
//  Данные				 - 	 - 
//  Представление		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Представление = ?(ЗначениеЗаполнено(Данные.Код), СОКРЛП(Данные.Код) + " " + СОКРЛП(Данные.Наименование), СОКРЛП(Данные.Наименование));
		
КонецПроцедуры

// Процедура - Привести код к латинскому варианту
//
// Параметры:
//  Код	 - 	 - 
//
Процедура ПривестиКодКЛатинскомуВарианту(Код) Экспорт 

	Если ЗначениеЗаполнено(СокрЛП(Код)) Тогда 
		КодТС = КодСимвола(ВРег(Лев(СокрЛП(Код), 1)));	
		Если КодТС = 1040 ИЛИ КодТС = 1042 Тогда		
			Код = СтрЗаменить(Код, Лев(СокрЛП(Код), 1), ?(КодТС = 1040, "A", "B"));
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
