
#Область ________________________________ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ___________________________________

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("IDЗвонка"							, IDЗвонка);
	Параметры.Свойство("IDПлеча"							, IDПлеча);	
	Параметры.Свойство("НаНомерТелефона"					, СНомерТелефона);
	Параметры.Свойство("НомерТелефонаКлиента"				, НомерТелефонаКлиента);
	Параметры.Свойство("IPТелефонияПодключаемоеОборудование", IPТелефонияПодключаемоеОборудование);
	Параметры.Свойство("ПереводЗвонка"						, ПереводЗвонка);	
	Параметры.Свойство("ПереадресацияЗвонка"				, ПереадресацияЗвонка);
	
	СписокПользователей = IPТелефония.ПолучитьСписокАктивныхПользователей(, Истина);	
	Если ЗначениеЗаполнено(СписокПользователей) Тогда
		МассивТелефонныхАппаратов = СписокПользователей.ВыгрузитьКолонку("ТелефонныйАппарат");
	Иначе
		МассивТелефонныхАппаратов = Новый Массив;	
	КонецЕсли;
	
	СписокАктивныхПользователей.Параметры.УстановитьЗначениеПараметра("СписокАктивныхНомеров", МассивТелефонныхАппаратов);
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокАктивныхПользователей, "ВнутреннийНомер", СНомерТелефона, Истина, ВидСравненияКомпоновкиДанных.НеРавно);
	
	ЭтаФорма.ТекущийЭлемент = Элементы.СписокАктивныхПользователей;
	
КонецПроцедуры

#КонецОбласти

#Область ____________________________ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ_____________________________

&НаКлиенте
// Процедура - Список активных пользователей выбор
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбраннаяСтрока		 - 	 - 
//  Поле				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура СписокАктивныхПользователейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Выбрать(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область _________________________________ОБРАБОТЧИКИ_КОМАНД_ФОРМЫ___________________________________

&НаКлиенте
// Процедура - Выбрать
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Выбрать(Команда)
	
	ВыбраннаяСтрока = Элементы.СписокАктивныхПользователей.ТекущиеДанные;
	Если ВыбраннаяСтрока = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Номер телефона не выбран!'; en = 'No phone number selected!'"));
		Возврат;
	КонецЕсли;
	
	Если ВыбраннаяСтрока.ЭтоГруппа И НЕ ЗначениеЗаполнено(ВыбраннаяСтрока.ВнутреннийНомер) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Группе не присвоен внутренний номер!'; en = 'No internal number assigned to the group!'"));
		Возврат;
	ИначеЕсли ВыбраннаяСтрока.ВСети = 3 Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Абонент не в сети!'; en = 'The subscriber is offline!'"));
		Возврат;
	КонецЕсли;
	
	ОписаниеОшибки = "";
	Если ПереадресацияЗвонка Тогда 
		РезультатПереадреации = IPТелефония.ПереадресацияЗвонка(IPТелефонияПодключаемоеОборудование, IDПлеча, СНомерТелефона, ВыбраннаяСтрока.ВнутреннийНомер, НомерТелефонаКлиента, ОписаниеОшибки);
	ИначеЕсли ПереводЗвонка Тогда 
		РезультатПереадреации = IPТелефония.ПереводТекущегоЗвонка(IPТелефонияПодключаемоеОборудование, IDПлеча, СНомерТелефона, ВыбраннаяСтрока.ВнутреннийНомер, НомерТелефонаКлиента, ОписаниеОшибки);
	Иначе
		РезультатПереадреации 	= Ложь;
		ОписаниеОшибки 			= НСтр("ru = 'Не определен метод переадресации/перевода звонка!'; en = 'Call forwarding/transfer method not defined!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка при переадресации звонка: '; en = 'Call forwarding error: '") + ОписаниеОшибки);
	КонецЕсли;
	
	Если РезультатПереадреации = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка при переадресации звонка: '; en = 'Call forwarding error: '") + ОписаниеОшибки);
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Отмена
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
