#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
////////////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРА ФОРМИРОВАНИЯ ПАКЕТА ДАННЫХ ДЛЯ ДВИЖЕНИЯ ДОКУМЕНТА

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ДвиженияВРасход.Ссылка КАК Ссылка,
	|	ДвиженияВРасход.Ссылка.Дата КАК Период,
	|	ДвиженияВРасход.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ДвиженияВРасход.Ссылка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПоступлениеИзКассы), ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПоступлениеРозничнойВыручкиИзОперационнойКассы), ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПоступлениеИзКассыПредприятия))
	|			ТОГДА ЗНАЧЕНИЕ(перечисление.ТипыДенежныхСредств.ПереводыВпути)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДвиженияВРасход.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВыбытиеВкассу)
	|					ТОГДА ЗНАЧЕНИЕ(перечисление.ТипыДенежныхСредств.Безналичные)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ДвиженияВРасход.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПоступлениеИзБанка)
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ПереводыВПути)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ДвиженияВРасход.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПоступлениеОтЭквайера)
	|									ТОГДА ЗНАЧЕНИЕ(перечисление.ТипыДенежныхСредств.ПлатежнаяКарта)
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ТипДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ДвиженияВРасход.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПоступлениеОтЭквайера)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|	КОНЕЦ КАК БанковскийСчетКасса,
	|	ВЫБОР
	|		КОГДА ДвиженияВРасход.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПоступлениеОтЭквайера)
	|			ТОГДА ДвиженияВРасход.Сумма + ДвиженияВРасход.Ссылка.ЭквайрингСуммаКомиссииБанка
	|		ИНАЧЕ ДвиженияВРасход.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ДвиженияВРасход.Статья = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	|			ТОГДА ДвиженияВРасход.Ссылка.Статья
	|		ИНАЧЕ ДвиженияВРасход.Статья
	|	КОНЕЦ КАК Статья
	|ПОМЕСТИТЬ ВременнаяТаблицаДенежныеСредства
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ДвиженияВРасход
	|ГДЕ
	|	ДвиженияВРасход.Ссылка = &Ссылка
	|	И ДвиженияВРасход.Ссылка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПоступлениеИзБанка), ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПоступлениеОтЭквайера), ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПоступлениеИзКассы), ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПоступлениеРозничнойВыручкиИзОперационнойКассы), ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПоступлениеИзКассыПредприятия))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ДвиженияВПриход.Ссылка,
	|	ДвиженияВПриход.Ссылка.Дата,
	|	ДвиженияВПриход.Ссылка.СтруктурнаяЕдиница,
	|	ДвиженияВПриход.Ссылка.ТипДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ДвиженияВПриход.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА ДвиженияВПриход.Ссылка.Касса
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДвиженияВПриход.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|					ТОГДА ДвиженияВПриход.Ссылка.БанковскийСчет
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ДвиженияВПриход.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ПлатежнаяКарта)
	|							ТОГДА ДвиженияВПриход.Ссылка.ЭквайрингТерминал.Эквайер.БанковскийСчетПоУмолчанию
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДвиженияВПриход.Сумма,
	|	ВЫБОР
	|		КОГДА ДвиженияВПриход.Статья = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	|			ТОГДА ДвиженияВПриход.Ссылка.Статья
	|		ИНАЧЕ ДвиженияВПриход.Статья
	|	КОНЕЦ
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ДвиженияВПриход
	|ГДЕ
	|	ДвиженияВПриход.Ссылка = &Ссылка
	|	И ДвиженияВПриход.Ссылка.ТипДенежныхСредств <> ЗНАЧЕНИЕ(Перечисление.типыДенежныхСредств.ЛицевойСчет)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПоступлениеДенежныхСредств.Ссылка КАК Ссылка,
	|	ПоступлениеДенежныхСредств.Ссылка.Дата КАК Период,
	|	ПоступлениеДенежныхСредств.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПоступлениеДенежныхСредств.Ссылка.Контрагент КАК Контрагент,
	|	ПоступлениеДенежныхСредств.ЛицевойСчетКонтрагента КАК ВидЛицевогоСчета,
	|	ПоступлениеДенежныхСредств.СуммаДокумента КАК Сумма
	|ПОМЕСТИТЬ ВременнаяТаблицаДенежныеСредстваНаЛицевыхСчетах
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств КАК ПоступлениеДенежныхСредств
	|ГДЕ
	|	ПоступлениеДенежныхСредств.Ссылка = &Ссылка
	|	И (ПоступлениеДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВзносНаЛицевойСчет)
	|			ИЛИ ПоступлениеДенежныхСредств.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ЛицевойСчет))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка КАК Ссылка,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата КАК Период,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент КАК Контрагент,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументОснования КАК ДокументОснования,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПодотчетниками
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеДенежныхСредствРасшифровкаПлатежа
	|ГДЕ
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка = &Ссылка
	|	И ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОтПодотчетника)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыОтПоставщика)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	1 КАК НомерСтроки,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка КАК Ссылка,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата КАК Период,
	|	ВЫБОР
	|		КОГДА НЕ ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыОтПоставщика)
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументОснования ССЫЛКА Документ.НарядЗаказ
	|						ТОГДА ВЫБОР
	|								КОГДА ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументОснования ССЫЛКА Документ.ВозвратОтПокупателя
	|									ТОГДА ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументОснования.ДокументОснования
	|								ИНАЧЕ ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументОснования
	|							КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ДокументОснования,
	|	ВЫБОР
	|		КОГДА УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов.Значение = ИСТИНА
	|				ИЛИ ПоступлениеДенежныхСредствРасшифровкаПлатежа.ЭтоАванс = ЛОЖЬ
	|			ТОГДА ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументАванса
	|	КОНЕЦ КАК ДокументАванса,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтСтраховойКомпании)
	|				И ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументОснования ССЫЛКА Документ.Прием
	|			ТОГДА ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументОснования.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяССылка)
	|			ТОГДА ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.СтруктурнаяЕдиница.Организация
	|		ИНАЧЕ ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Организация
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыОтПоставщика)
	|				ИЛИ ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыКлиенту)
	|			ТОГДА ПоступлениеДенежныхСредствРасшифровкаПлатежа.Сумма * -1
	|		ИНАЧЕ ПоступлениеДенежныхСредствРасшифровкаПлатежа.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.ЭтоАванс КАК ЭтоАванс,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Договор КАК Договор
	|ПОМЕСТИТЬ ВременнаяТаблицаВзаиморасчетыКонтрагентов
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеДенежныхСредствРасшифровкаПлатежа,
	|	Константа.УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов КАК УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов
	|ГДЕ
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Ссылка = &Ссылка
	|	И (ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтКлиента), ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтСтраховойкомпании), ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыКлиенту), ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВзносНаЛицевойСчет), ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыОтПоставщика), ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратЗайма))
	|			ИЛИ ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПрочееПоступление)
	|				И ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ЛицевойСчет))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	2,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата,
	|	NULL,
	|	ВЫБОР
	|		КОГДА УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов.Значение = ИСТИНА
	|				ИЛИ ПоступлениеДенежныхСредствРасшифровкаПлатежа.ЭтоАванс = ЛОЖЬ
	|			ТОГДА ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументАванса
	|	КОНЕЦ,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.СтруктурнаяЕдиница,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент,
	|	ВЫБОР
	|		КОГДА ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяССылка)
	|			ТОГДА ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.СтруктурнаяЕдиница.Организация
	|		ИНАЧЕ ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Организация
	|	КОНЕЦ,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Сумма,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.ЭтоАванс,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Договор
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеДенежныхСредствРасшифровкаПлатежа,
	|	Константа.УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов КАК УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов
	|ГДЕ
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Ссылка = &Ссылка
	|	И ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыКлиенту)
	|	И ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ЛицевойСчет)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПоступлениеДенежныхСредств.Ссылка КАК Ссылка,
	|	ПоступлениеДенежныхСредств.Ссылка.Дата КАК Период,
	|	ПоступлениеДенежныхСредств.Ссылка.Дата КАК ДатаПлатежа,
	|	ПоступлениеДенежныхСредств.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПоступлениеДенежныхСредств.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ПоступлениеДенежныхСредств.СуммаДокумента КАК Сумма,
	|	ПоступлениеДенежныхСредств.ЭквайрингТерминал КАК ЭквайринговыйТерминал,
	|	ПоступлениеДенежныхСредств.ЭквайрингВидПлатежнойКарты КАК ВидПлатежнойКарты,
	|	ПоступлениеДенежныхСредств.ЭквайрингНомерПлатежнойКарты КАК НомерПлатежнойКарты
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыПоЭквайрингу
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств КАК ПоступлениеДенежныхСредств
	|ГДЕ
	|	ПоступлениеДенежныхСредств.Ссылка = &Ссылка
	|	И ПоступлениеДенежныхСредств.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.типыДенежныхСредств.ПлатежнаяКарта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата КАК Период,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Сотрудник КАК Сотрудник,
	|	НАЧАЛОПЕРИОДА(ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВозвратВыплатыЗПМесяц, МЕСЯЦ) КАК МесяцНачисления,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументОснования КАК ДокументНачисления,
	|	-ПоступлениеДенежныхСредствРасшифровкаПлатежа.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПерсоналом
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеДенежныхСредствРасшифровкаПлатежа
	|ГДЕ
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка = &Ссылка
	|	И ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратЗаработнойПлаты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РПОплатаОтКлиента.Ссылка.Дата КАК Период,
	|	РПОплатаОтКлиента.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА РПОплатаОтКлиента.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РПОплатаОтКлиента.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|					ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РПОплатаОтКлиента.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ПлатежнаяКарта)
	|							ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Эквайринг)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА РПОплатаОтКлиента.ЭтоАванс = ЛОЖЬ
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПокупателиПоАвансам)
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА РПОплатаОтКлиента.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА РПОплатаОтКлиента.Ссылка.Касса
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РПОплатаОтКлиента.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|					ТОГДА РПОплатаОтКлиента.Ссылка.БанковскийСчет
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РПОплатаОтКлиента.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ПлатежнаяКарта)
	|							ТОГДА РПОплатаОтКлиента.Ссылка.ЭквайрингТерминал.Эквайер
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СубконтоДт1,
	|	ВЫБОР
	|		КОГДА РПОплатаОтКлиента.Ссылка.ТипДенежныхСредств <> ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ПлатежнаяКарта)
	|			ТОГДА РПОплатаОтКлиента.Статья
	|	КОНЕЦ КАК СубконтоДт2,
	|	РПОплатаОтКлиента.Ссылка.Контрагент КАК СубконтоКт1,
	|	NULL КАК СубконтоКт2,
	|	РПОплатаОтКлиента.Сумма КАК Сумма,
	|	""Поступление денежных средств"" КАК Содержание
	|ПОМЕСТИТЬ ВременнаяТаблицаУправленческий
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК РПОплатаОтКлиента
	|ГДЕ
	|	РПОплатаОтКлиента.Ссылка = &Ссылка
	|	И РПОплатаОтКлиента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтКлиента)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РПВозвратОплатыКлиенту.Ссылка.Дата,
	|	РПВозвратОплатыКлиенту.Ссылка.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПокупателиПоАвансам),
	|	РПВозвратОплатыКлиенту.Ссылка.Контрагент,
	|	NULL,
	|	РПВозвратОплатыКлиенту.Ссылка.Контрагент,
	|	РПВозвратОплатыКлиенту.Ссылка.ЛицевойСчетКонтрагента,
	|	РПВозвратОплатыКлиенту.Сумма,
	|	""Поступление денежных средств""
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК РПВозвратОплатыКлиенту
	|ГДЕ
	|	РПВозвратОплатыКлиенту.Ссылка = &Ссылка
	|	И РПВозвратОплатыКлиенту.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыклиенту)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РПОплатаОтСтраховойКомпании.Ссылка.Дата,
	|	РПОплатаОтСтраховойКомпании.Ссылка.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА РПОплатаОтСтраховойКомпании.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РПОплатаОтСтраховойКомпании.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|					ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели),
	|	ВЫБОР
	|		КОГДА РПОплатаОтСтраховойКомпании.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА РПОплатаОтСтраховойКомпании.Ссылка.Касса
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РПОплатаОтСтраховойКомпании.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|					ТОГДА РПОплатаОтСтраховойКомпании.Ссылка.БанковскийСчет
	|			КОНЕЦ
	|	КОНЕЦ,
	|	РПОплатаОтСтраховойКомпании.Статья,
	|	РПОплатаОтСтраховойКомпании.Ссылка.Контрагент,
	|	NULL,
	|	РПОплатаОтСтраховойКомпании.Сумма,
	|	""Поступление денежных средств""
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК РПОплатаОтСтраховойКомпании
	|ГДЕ
	|	РПОплатаОтСтраховойКомпании.Ссылка = &Ссылка
	|	И РПОплатаОтСтраховойКомпании.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтСтраховойКомпании)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РПВзносНаЛицевойСчет.Ссылка.Дата,
	|	РПВзносНаЛицевойСчет.Ссылка.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА РПВзносНаЛицевойСчет.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РПВзносНаЛицевойСчет.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|					ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РПВзносНаЛицевойСчет.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ПлатежнаяКарта)
	|							ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Эквайринг)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПокупателиПоАвансам),
	|	ВЫБОР
	|		КОГДА РПВзносНаЛицевойСчет.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА РПВзносНаЛицевойСчет.Ссылка.Касса
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РПВзносНаЛицевойСчет.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|					ТОГДА РПВзносНаЛицевойСчет.Ссылка.БанковскийСчет
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РПВзносНаЛицевойСчет.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ПлатежнаяКарта)
	|							ТОГДА РПВзносНаЛицевойСчет.Ссылка.ЭквайрингТерминал.Эквайер
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	РПВзносНаЛицевойСчет.Статья,
	|	РПВзносНаЛицевойСчет.Ссылка.Контрагент,
	|	РПВзносНаЛицевойСчет.Ссылка.ЛицевойСчетКонтрагента,
	|	РПВзносНаЛицевойСчет.Сумма,
	|	""Поступление денежных средств""
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК РПВзносНаЛицевойСчет
	|ГДЕ
	|	РПВзносНаЛицевойСчет.Ссылка = &Ссылка
	|	И РПВзносНаЛицевойСчет.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВзносНаЛицевойСчет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РППоступлениеИзБанка.Ссылка.Дата,
	|	РППоступлениеИзБанка.Ссылка.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Переводы),
	|	РППоступлениеИзБанка.Ссылка.Касса,
	|	РППоступлениеИзБанка.Статья,
	|	NULL,
	|	NULL,
	|	РППоступлениеИзБанка.Сумма,
	|	""Поступление денежных средств""
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК РППоступлениеИзБанка
	|ГДЕ
	|	РППоступлениеИзБанка.Ссылка = &Ссылка
	|	И РППоступлениеИзБанка.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПоступлениеИзБанка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РПВозвратОтПоставщика.Ссылка.Дата,
	|	РПВозвратОтПоставщика.Ссылка.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА РПВозвратОтПоставщика.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РПВозвратОтПоставщика.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|					ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Поставщики),
	|	ВЫБОР
	|		КОГДА РПВозвратОтПоставщика.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА РПВозвратОтПоставщика.Ссылка.Касса
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РПВозвратОтПоставщика.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|					ТОГДА РПВозвратОтПоставщика.Ссылка.БанковскийСчет
	|			КОНЕЦ
	|	КОНЕЦ,
	|	РПВозвратОтПоставщика.Статья,
	|	РПВозвратОтПоставщика.Ссылка.Контрагент,
	|	NULL,
	|	РПВозвратОтПоставщика.Сумма,
	|	""Поступление денежных средств""
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК РПВозвратОтПоставщика
	|ГДЕ
	|	РПВозвратОтПоставщика.Ссылка = &Ссылка
	|	И РПВозвратОтПоставщика.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыОтПоставщика)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РПВозвратОтПодотчетника.Ссылка.Дата,
	|	РПВозвратОтПодотчетника.Ссылка.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА РПВозвратОтПодотчетника.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РПВозвратОтПодотчетника.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|					ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Подотчет),
	|	ВЫБОР
	|		КОГДА РПВозвратОтПодотчетника.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА РПВозвратОтПодотчетника.Ссылка.Касса
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РПВозвратОтПодотчетника.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|					ТОГДА РПВозвратОтПодотчетника.Ссылка.БанковскийСчет
	|			КОНЕЦ
	|	КОНЕЦ,
	|	РПВозвратОтПодотчетника.Статья,
	|	РПВозвратОтПодотчетника.Ссылка.Контрагент,
	|	NULL,
	|	РПВозвратОтПодотчетника.Сумма,
	|	""Поступление денежных средств""
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК РПВозвратОтПодотчетника
	|ГДЕ
	|	РПВозвратОтПодотчетника.Ссылка = &Ссылка
	|	И РПВозвратОтПодотчетника.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОтПодотчетника)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РППрочееПоступление.Ссылка.Дата,
	|	РППрочееПоступление.Ссылка.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА РППрочееПоступление.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РППрочееПоступление.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|					ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РППрочееПоступление.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ЛицевойСчет)
	|							ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Служебный)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РППрочееПоступление.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ЛицевойСчет)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПокупателиПоАвансам)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ДоходыПрочие)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РППрочееПоступление.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА РППрочееПоступление.Ссылка.Касса
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РППрочееПоступление.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|					ТОГДА РППрочееПоступление.Ссылка.БанковскийСчет
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ РППрочееПоступление.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ЛицевойСчет)
	|			ТОГДА РППрочееПоступление.Статья
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ РППрочееПоступление.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ЛицевойСчет)
	|			ТОГДА РППрочееПоступление.Статья
	|		ИНАЧЕ РППрочееПоступление.Ссылка.Контрагент
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РППрочееПоступление.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ЛицевойСчет)
	|			ТОГДА РППрочееПоступление.Ссылка.ЛицевойСчетКонтрагента
	|	КОНЕЦ,
	|	РППрочееПоступление.Сумма,
	|	""Поступление денежных средств""
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК РППрочееПоступление
	|ГДЕ
	|	РППрочееПоступление.Ссылка = &Ссылка
	|	И РППрочееПоступление.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПрочееПоступление)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РПВозвратНалога.Ссылка.Дата,
	|	РПВозвратНалога.Ссылка.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Налоги),
	|	РПВозвратНалога.Ссылка.БанковскийСчет,
	|	РПВозвратНалога.Статья,
	|	РПВозвратНалога.ВидНалога,
	|	NULL,
	|	РПВозвратНалога.Сумма,
	|	""Поступление денежных средств""
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК РПВозвратНалога
	|ГДЕ
	|	РПВозвратНалога.Ссылка = &Ссылка
	|	И РПВозвратНалога.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратНалога)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеОтЭквайера.Период,
	|	ПоступлениеОтЭквайера.СтруктурнаяЕдиница,
	|	ПоступлениеОтЭквайера.СчетДт,
	|	ПоступлениеОтЭквайера.СчетКт,
	|	ПоступлениеОтЭквайера.СубконтоДт1,
	|	ПоступлениеОтЭквайера.СубконтоДт2,
	|	ПоступлениеОтЭквайера.СубконтоКт1,
	|	NULL,
	|	ПоступлениеОтЭквайера.Сумма,
	|	ПоступлениеОтЭквайера.Содержание
	|ИЗ
	|	(ВЫБРАТЬ
	|		РППоступлениеОтЭквайера.Ссылка.Дата КАК Период,
	|		РППоступлениеОтЭквайера.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк) КАК СчетДт,
	|		ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Эквайринг) КАК СчетКт,
	|		РППоступлениеОтЭквайера.Ссылка.БанковскийСчет КАК СубконтоДт1,
	|		РППоступлениеОтЭквайера.Статья КАК СубконтоДт2,
	|		РППоступлениеОтЭквайера.Ссылка.ЭквайрингТерминал.Эквайер КАК СубконтоКт1,
	|		РППоступлениеОтЭквайера.Сумма КАК Сумма,
	|		""Поступление денежных средств"" КАК Содержание
	|	ИЗ
	|		Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК РППоступлениеОтЭквайера
	|	ГДЕ
	|		РППоступлениеОтЭквайера.Ссылка = &Ссылка
	|		И РППоступлениеОтЭквайера.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПоступлениеОтЭквайера)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РППоступлениеОтЭквайера.Ссылка.Дата,
	|		РППоступлениеОтЭквайера.Ссылка.СтруктурнаяЕдиница,
	|		ЗНАЧЕНИЕ(ПланСчетов.Управленческий.РасходыПрочие),
	|		ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Эквайринг),
	|		ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.КомиссияБанка),
	|		NULL,
	|		РППоступлениеОтЭквайера.Ссылка.ЭквайрингТерминал.Эквайер,
	|		РППоступлениеОтЭквайера.Ссылка.ЭквайрингСуммаКомиссииБанка,
	|		""Поступление денежных средств""
	|	ИЗ
	|		Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК РППоступлениеОтЭквайера
	|	ГДЕ
	|		РППоступлениеОтЭквайера.Ссылка = &Ссылка
	|		И РППоступлениеОтЭквайера.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПоступлениеОтЭквайера)
	|		И РППоступлениеОтЭквайера.Ссылка.ЭквайрингТерминал.ПроцентКомиссии > 0) КАК ПоступлениеОтЭквайера
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РПВводНачальныхОстатков.Ссылка.Дата,
	|	РПВводНачальныхОстатков.Ссылка.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА РПВводНачальныхОстатков.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РПВводНачальныхОстатков.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|					ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Служебный),
	|	ВЫБОР
	|		КОГДА РПВводНачальныхОстатков.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА РПВводНачальныхОстатков.Ссылка.Касса
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РПВводНачальныхОстатков.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|					ТОГДА РПВводНачальныхОстатков.Ссылка.БанковскийСчет
	|			КОНЕЦ
	|	КОНЕЦ,
	|	РПВводНачальныхОстатков.Статья,
	|	NULL,
	|	NULL,
	|	РПВводНачальныхОстатков.Сумма,
	|	""Поступление денежных средств""
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК РПВводНачальныхОстатков
	|ГДЕ
	|	РПВводНачальныхОстатков.Ссылка = &Ссылка
	|	И РПВводНачальныхОстатков.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВводОстатков)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РПВозвратЗайма.Ссылка.Дата,
	|	РПВозвратЗайма.Ссылка.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА РПВозвратЗайма.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РПВозвратЗайма.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|					ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Займы),
	|	ВЫБОР
	|		КОГДА РПВозвратЗайма.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА РПВозвратЗайма.Ссылка.Касса
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РПВозвратЗайма.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|					ТОГДА РПВозвратЗайма.Ссылка.БанковскийСчет
	|			КОНЕЦ
	|	КОНЕЦ,
	|	РПВозвратЗайма.Статья,
	|	РПВозвратЗайма.Ссылка.Контрагент,
	|	NULL,
	|	РПВозвратЗайма.Сумма,
	|	""Поступление денежных средств""
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК РПВозвратЗайма
	|ГДЕ
	|	РПВозвратЗайма.Ссылка = &Ссылка
	|	И РПВозвратЗайма.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратЗайма)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РПВзносУчредителя.Ссылка.Дата,
	|	РПВзносУчредителя.Ссылка.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА РПВзносУчредителя.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РПВзносУчредителя.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|					ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Участники),
	|	ВЫБОР
	|		КОГДА РПВзносУчредителя.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА РПВзносУчредителя.Ссылка.Касса
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РПВзносУчредителя.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|					ТОГДА РПВзносУчредителя.Ссылка.БанковскийСчет
	|			КОНЕЦ
	|	КОНЕЦ,
	|	РПВзносУчредителя.Статья,
	|	РПВзносУчредителя.Ссылка.Контрагент,
	|	NULL,
	|	РПВзносУчредителя.Сумма,
	|	""Поступление денежных средств""
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК РПВзносУчредителя
	|ГДЕ
	|	РПВзносУчредителя.Ссылка = &Ссылка
	|	И РПВзносУчредителя.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВзносУчредителя)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РПВозвратЗаработнойПлаты.Ссылка.Дата,
	|	РПВозвратЗаработнойПлаты.Ссылка.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Зарплата),
	|	ВЫБОР
	|		КОГДА РПВозвратЗаработнойПлаты.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)
	|	КОНЕЦ,
	|	РПВозвратЗаработнойПлаты.Сотрудник,
	|	NULL,
	|	ВЫБОР
	|		КОГДА РПВозвратЗаработнойПлаты.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА РПВозвратЗаработнойПлаты.Ссылка.Касса
	|		ИНАЧЕ РПВозвратЗаработнойПлаты.Ссылка.БанковскийСчет
	|	КОНЕЦ,
	|	РПВозвратЗаработнойПлаты.Статья,
	|	-РПВозвратЗаработнойПлаты.Сумма,
	|	""Поступление денежных средств""
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК РПВозвратЗаработнойПлаты
	|ГДЕ
	|	РПВозвратЗаработнойПлаты.Ссылка = &Ссылка
	|	И РПВозвратЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратЗаработнойПлаты)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РППоступлениеИзКассы.Ссылка.Дата,
	|	РППоступлениеИзКассы.Ссылка.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Переводы),
	|	РППоступлениеИзКассы.Ссылка.БанковскийСчетКонтрагента,
	|	РППоступлениеИзКассы.Статья,
	|	NULL,
	|	NULL,
	|	РППоступлениеИзКассы.Сумма,
	|	""Списание денежных средств""
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК РППоступлениеИзКассы
	|ГДЕ
	|	РППоступлениеИзКассы.Ссылка = &Ссылка
	|	И РППоступлениеИзКассы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПоступлениеИзКассы)";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.ВыполнитьПакет();
	
	СформироватьТаблицаДенежныеСредства(СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПодотчетниками(СтруктураДополнительныеСвойства);
	СформироватьТаблицаДенежныеСредстваНаЛицевыхСчетах(СтруктураДополнительныеСвойства);
	СформироватьТаблицаВзаиморасчетыСКонтрагентами(СтруктураДополнительныеСвойства);		
	СформироватьТаблицаРасчетыПоЭквайрингу(СтруктураДополнительныеСвойства);	
	СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПерсоналом(СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДенежныеСредства(СтруктураДополнительныеСвойства)
	
    Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДенежныеСредства.НомерСтроки КАК НомерСтроки,
	|	ДенежныеСредства.Период,
	|	ДенежныеСредства.СтруктурнаяЕдиница,
	|	ДенежныеСредства.БанковскийСчетКасса,
	|	ДенежныеСредства.ТипДенежныхСредств,
	|	ДенежныеСредства.ВидДвижения,
	|	СУММА(ДенежныеСредства.Сумма) КАК Сумма,
	|	ДенежныеСредства.Статья
	|ИЗ
	|	ВременнаяТаблицаДенежныеСредства КАК ДенежныеСредства
	|
	|СГРУППИРОВАТЬ ПО
	|	ДенежныеСредства.Статья,
	|	ДенежныеСредства.ВидДвижения,
	|	ДенежныеСредства.ТипДенежныхСредств,
	|	ДенежныеСредства.СтруктурнаяЕдиница,
	|	ДенежныеСредства.Период,
	|	ДенежныеСредства.НомерСтроки,
	|	ДенежныеСредства.БанковскийСчетКасса
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредства", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДенежныеСредстваНаЛицевыхСчетах(СтруктураДополнительныеСвойства)
	
    Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	ДенежныеСредстваНаЛицевыхСчетах.Период,
	|	ДенежныеСредстваНаЛицевыхСчетах.СтруктурнаяЕдиница,
	|	ДенежныеСредстваНаЛицевыхСчетах.Контрагент,
	|	ДенежныеСредстваНаЛицевыхСчетах.ВидДвижения,
	|	ДенежныеСредстваНаЛицевыхСчетах.ВидЛицевогоСчета КАК ВидСчета,
	|	СУММА(ДенежныеСредстваНаЛицевыхСчетах.Сумма) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаДенежныеСредстваНаЛицевыхСчетах КАК ДенежныеСредстваНаЛицевыхСчетах
	|
	|СГРУППИРОВАТЬ ПО
	|	ДенежныеСредстваНаЛицевыхСчетах.Период,
	|	ДенежныеСредстваНаЛицевыхСчетах.СтруктурнаяЕдиница,
	|	ДенежныеСредстваНаЛицевыхСчетах.Контрагент,
	|	ДенежныеСредстваНаЛицевыхСчетах.ВидДвижения,
	|	ДенежныеСредстваНаЛицевыхСчетах.ВидЛицевогоСчета";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредстваНаЛицевыхСчетах", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыПоЭквайрингу(СтруктураДополнительныеСвойства)
	
    Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	РасчетыПоЭквайрингу.ВидДвижения,
	|	РасчетыПоЭквайрингу.Период,
	|	РасчетыПоЭквайрингу.ДатаПлатежа,
	|	РасчетыПоЭквайрингу.СтруктурнаяЕдиница,
	|	РасчетыПоЭквайрингу.ТипДенежныхСредств,
	|	РасчетыПоЭквайрингу.ЭквайринговыйТерминал,
	|	РасчетыПоЭквайрингу.ВидПлатежнойКарты,
	|	РасчетыПоЭквайрингу.НомерПлатежнойКарты,
	|	РасчетыПоЭквайрингу.Сумма
	|ИЗ
	|	ВременнаяТаблицаРасчетыПоЭквайрингу КАК РасчетыПоЭквайрингу";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЭквайрингу", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыСКонтрагентами(СтруктураДополнительныеСвойства)
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаВзаиморасчетыСКонтрагентами.НомерСтроки КАК НомерСтроки,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ДокументОснования КАК ДокументРеализации,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ДокументАванса КАК ДокументАванса,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ВидДвижения КАК ВидДвижения,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Период КАК Период,
	|	ТаблицаВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Контрагент КАК Контрагент,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Организация КАК Организация,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ЭтоАванс КАК ЭтоАванс,
	|	СУММА(ТаблицаВзаиморасчетыСКонтрагентами.Сумма) КАК Сумма,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Ссылка.Договор КАК Договор
	|ИЗ
	|	ВременнаяТаблицаВзаиморасчетыКонтрагентов КАК ТаблицаВзаиморасчетыСКонтрагентами
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаВзаиморасчетыСКонтрагентами.НомерСтроки,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ДокументОснования,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ДокументАванса,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Период,
	|	ТаблицаВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Контрагент,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Организация,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ЭтоАванс,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ВидДвижения,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Ссылка.Договор
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыСКонтрагентами", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры	

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПодотчетниками(СтруктураДополнительныеСвойства)
	
    Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	ТаблицаРасчетыСПодотчетниками.Период,
	|	ТаблицаРасчетыСПодотчетниками.ВидДвижения,
	|	ТаблицаРасчетыСПодотчетниками.СтруктурнаяЕдиница,
	|	ТаблицаРасчетыСПодотчетниками.Контрагент КАК Сотрудник,
	|	ТаблицаРасчетыСПодотчетниками.ДокументОснования КАК ДокументОснования,
	|	СУММА(ТаблицаРасчетыСПодотчетниками.Сумма) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПодотчетниками КАК ТаблицаРасчетыСПодотчетниками
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасчетыСПодотчетниками.Период,
	|	ТаблицаРасчетыСПодотчетниками.СтруктурнаяЕдиница,
	|	ТаблицаРасчетыСПодотчетниками.ДокументОснования,
	|	ТаблицаРасчетыСПодотчетниками.ВидДвижения,
	|	ТаблицаРасчетыСПодотчетниками.Контрагент";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПодотчетниками", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПерсоналом(СтруктураДополнительныеСвойства)
	
    Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВременнаяТаблица.ВидДвижения,
	|	ВременнаяТаблица.Период,
	|	ВременнаяТаблица.СтруктурнаяЕдиница,
	|	ВременнаяТаблица.Сотрудник КАК Сотрудник,
	|   ВременнаяТаблица.МесяцНачисления,
	|   ВременнаяТаблица.ДокументНачисления,	
	|	ВременнаяТаблица.Сумма КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПерсоналом КАК ВременнаяТаблица";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПерсоналом", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ВременнаяТаблицаУправленческий.СубконтоДт1,
	|	ВременнаяТаблицаУправленческий.СубконтоДт2,
	|	ВременнаяТаблицаУправленческий.СубконтоКт1,
	|	ВременнаяТаблицаУправленческий.СубконтоКт2,
	|	СУММА(ВременнаяТаблицаУправленческий.Сумма) КАК Сумма,
	|	ВременнаяТаблицаУправленческий.Содержание
	|ИЗ
	|	ВременнаяТаблицаУправленческий КАК ВременнаяТаблицаУправленческий
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ВременнаяТаблицаУправленческий.СубконтоДт1,
	|	ВременнаяТаблицаУправленческий.СубконтоДт2,
	|	ВременнаяТаблицаУправленческий.СубконтоКт1,
	|	ВременнаяТаблицаУправленческий.СубконтоКт2,
	|	ВременнаяТаблицаУправленческий.Содержание";
	
	РезультатЗапроса = Запрос.Выполнить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция возвращает таблицу реквизитов, зависимых от хозяйственной операции документа.
//
Функция ПолучитьМассивСостоянияРеквизитов(ОбъектФормы) Экспорт
	
	МассивРеквизитов = Новый Массив;
	
	// Состояния реквизитов по умолчанию
    УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ГруппаПлатежнаяКарта",Тип("ГруппаФормы"),Ложь);
	УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежаГруппаДобавитьПоАкту",Тип("ГруппаФормы"),Ложь);
	УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежаГруппаЗаполнитьПоАкту",Тип("ГруппаФормы"),Ложь);
	УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ЭквайрингТерминал",,Ложь);
	УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ЛицевойСчетКонтрагента",,Ложь);
	УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"БанковскийСчет",,Ложь); 
	УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"БанковскийСчетКонтрагента",,Ложь);
	УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"Касса",,Ложь);
	УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа",,Ложь);
	УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"Контрагент",,,,,"Пациент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"НомерВходящегоДокумента",,Ложь);
    УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ДатаВходящегоДокумента",,Ложь);
	УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа.ВидНалога",,Ложь);
//    УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ЭквайрингДоговор",,Ложь);
	УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ЭквайрингСуммаКомиссииБанка",,Ложь);		
	УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ГруппаИнформация",Тип("ГруппаФормы"),Истина);
	УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа.Сотрудник",,Ложь);
    УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ГруппаВыплатаЗП",Тип("ГруппаФормы"),Ложь);
	
	// Состояние реквизитов в зависимости типа ден. средств
	Если ОбъектФормы.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда		
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"Касса");		
	ИначеЕсли ОбъектФормы.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные Тогда		
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"БанковскийСчетКонтрагента"); 
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"БанковскийСчет");	
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"Касса");			
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"НомерВходящегоДокумента",,Истина);
        УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ДатаВходящегоДокумента",,Истина);	
	ИначеЕсли ОбъектФормы.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта Тогда		
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ГруппаПлатежнаяКарта",Тип("ГруппаФормы"),Истина);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ЭквайрингТерминал",,Истина);		
	ИначеЕсли ОбъектФормы.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ЛицевойСчет Тогда		
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ЛицевойСчетКонтрагента",,Истина);	
	КонецЕсли;
	
	// Состояние реквизитов в зависимости от вида операции
	Если ОбъектФормы.ВидОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента Тогда			
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа",,Истина);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"СтатьяВТаблице",,Истина);
	ИначеЕсли ОбъектФормы.ВидОперации = Перечисления.ВидыОпераций.ОплатаОтСтраховойКомпании Тогда	
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежаГруппаДобавитьПоАкту",Тип("ГруппаФормы"),Истина);
	    УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежаГруппаЗаполнитьПоАкту",Тип("ГруппаФормы"),Истина);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа",,Истина);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"Контрагент",,,,,"Страховая компания",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа.ДокументАванса",,Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"СтатьяВТаблице",,Истина);
	ИначеЕсли ОбъектФормы.ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыОтПоставщика Тогда			
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа",,Истина);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"Контрагент",,,,,"Поставщик",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа.ДокументАванса",,Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"СтатьяВТаблице",,Истина);
	ИначеЕсли ОбъектФормы.ВидОперации = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет Тогда						
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ЛицевойСчетКонтрагента");
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"БанковскийСчетКонтрагента",,Ложь);	
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"СтатьяВТаблице",,Ложь);	
	ИначеЕсли ОбъектФормы.ВидОперации = Перечисления.ВидыОпераций.ВозвратОтПодотчетника Тогда					
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"Контрагент",,,,,"Сотрудник",Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));				
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа",,Истина);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа.ДокументАванса",,Ложь);
	    УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ГруппаИнформация",Тип("ГруппаФормы"),Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"СтатьяВТаблице",,Истина);
	ИначеЕсли ОбъектФормы.ВидОперации = Перечисления.ВидыОпераций.ПоступлениеИзБанка Тогда
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"БанковскийСчетКонтрагента");
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"Контрагент",,Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"СтатьяВТаблице",,Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ГруппаИнформация",Тип("ГруппаФормы"),Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"СтатьяВТаблице",,Ложь);
	//ИначеЕсли ОбъектФормы.ВидОперации = Перечисления.ВидыОпераций.ПоступлениеИзКассы Тогда
	ИначеЕсли ОбъектФормы.ВидОперации = Перечисления.ВидыОпераций.ПоступлениеРозничнойВыручкиИзОперационнойКассы Тогда		
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"БанковскийСчет",,Ложь);
		//УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"БанковскийСчетКонтрагента");
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"Контрагент",,Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"СтатьяВТаблице",,Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ГруппаИнформация",Тип("ГруппаФормы"),Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"СтатьяВТаблице",,Истина);
		
	ИначеЕсли ОбъектФормы.ВидОперации = Перечисления.ВидыОпераций.ПоступлениеИзКассыПредприятия Тогда		
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"БанковскийСчет",,Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"БанковскийСчетКонтрагента",, Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"Контрагент",,Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"СтатьяВТаблице",,Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ГруппаИнформация",Тип("ГруппаФормы"),Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"СтатьяВТаблице",,Истина);
		
	ИначеЕсли ОбъектФормы.ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыКлиенту Тогда
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа",,Истина);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"СтатьяВТаблице",,Истина);
	ИначеЕсли ОбъектФормы.ВидОперации = Перечисления.ВидыОпераций.ВозвратНалога Тогда
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа",,Истина);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"БанковскийСчетКонтрагента",,Ложь); 
        УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа.ВидНалога",,Истина);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа.Статья",,Истина);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа.ДокументОснования",,Ложь);
	    УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"Контрагент",,Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ГруппаИнформация",Тип("ГруппаФормы"),Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"СтатьяВТаблице",,Истина);
	ИначеЕсли ОбъектФормы.ВидОперации = Перечисления.ВидыОпераций.ПоступлениеОтЭквайера Тогда				
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"Контрагент",,Ложь);		
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ЭквайрингТерминал",,Истина); // ЭквайрингДоговор.
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"БанковскийСчетКонтрагента",,Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа",,Ложь);	
	    УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ГруппаИнформация",Тип("ГруппаФормы"),Ложь);	
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ЭквайрингСуммаКомиссииБанка",,Истина);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"СтатьяВТаблице",,Истина);
	ИначеЕсли ОбъектФормы.ВидОперации = Перечисления.ВидыОпераций.ВводОстатков Тогда
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ГруппаРеквизитыПлательщика",Тип("ГруппаФормы"),Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ГруппаИнформация",Тип("ГруппаФормы"),Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"СтатьяВТаблице",,Ложь);
    ИначеЕсли ОбъектФормы.ВидОперации = Перечисления.ВидыОпераций.ВозвратЗайма Тогда			
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа",,Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"Контрагент",,,,,"Поставщик",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"СтатьяВТаблице",,Ложь);
	ИначеЕсли ОбъектФормы.ВидОперации = Перечисления.ВидыОпераций.ВзносУчредителя Тогда
		 УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"Контрагент",,,,,"Учредитель",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		 УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ГруппаИнформация",Тип("ГруппаФормы"),Ложь);
		 УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"СтатьяВТаблице",,Ложь);
	 ИначеЕсли ОбъектФормы.ВидОперации = Перечисления.ВидыОпераций.ПрочееПоступление Тогда
		Если НЕ ОбъектФормы.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ЛицевойСчет Тогда
			УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"Контрагент",,Ложь);
			УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ГруппаИнформация",Тип("ГруппаФормы"),Ложь);
		КонецЕсли;
		Если ОбъектФормы.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные  Тогда
		     УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"БанковскийСчетКонтрагента",,ЛОжь); 
		 КонецЕсли;
		 УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"СтатьяВТаблице",,Ложь);
	 ИначеЕсли ОбъектФормы.ВидОперации = Перечисления.ВидыОпераций.ВозвратЗаработнойПлаты Тогда
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"БанковскийСчетКонтрагента",,Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"Контрагент",,Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа",,Истина);
        УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа.Сотрудник",,Истина);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ГруппаВыплатаЗП",Тип("ГруппаФормы"),Истина);	
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ГруппаИнформация",Тип("ГруппаФормы"),Ложь);
        УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа.ДокументАванса",,Ложь);
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"СтатьяВТаблице",,Истина);
		
	КонецЕсли;
	
	Если ОбъектФормы.СтатьяВТаблице Тогда
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"РасшифровкаПлатежа.Статья");
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"Статья",,,Ложь);
 	КонецЕсли;
	
	Возврат МассивРеквизитов;
	
КонецФункции // ПолучитьМассивыРеквизитов()

// Получить массив обязательных для заполнения реквизитов реквизитов
Процедура ПолучитьМассивыОбязательныхРеквизитов(ДокументОбъект,МассивОбязательныхРеквизитов) Экспорт
	
	МассивОбязательныхРеквизитов.Добавить("ТипДенежныхСредств");
	МассивОбязательныхРеквизитов.Добавить("ВидОперации");
	МассивОбязательныхРеквизитов.Добавить("СуммаДокумента");

	// Состояние реквизитов в зависимости от типа денежных средств
	Если ДокументОбъект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда
		МассивОбязательныхРеквизитов.Добавить("Касса");
	ИначеЕсли ДокументОбъект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные Тогда		 
		МассивОбязательныхРеквизитов.Добавить("БанковскийСчет");  
	ИначеЕсли ДокументОбъект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта Тогда		
		МассивОбязательныхРеквизитов.Добавить("ЭквайрингТерминал");
		МассивОбязательныхРеквизитов.Добавить("ЭквайрингВидПлатежнойКарты");		
	ИначеЕсли ДокументОбъект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ЛицевойСчет Тогда	
		МассивОбязательныхРеквизитов.Добавить("ЛицевойСчетКонтрагента");
	КонецЕсли;

	// Состояние реквизитов в зависимости от вида операции
	Если ДокументОбъект.ВидОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента Тогда			
		МассивОбязательныхРеквизитов.Добавить("Контрагент");
		МассивОбязательныхРеквизитов.Добавить("РасшифровкаПлатежа");	
		МассивОбязательныхРеквизитов.Добавить("РасшифровкаПлатежа.ДокументОснования");
		МассивОбязательныхРеквизитов.Добавить("РасшифровкаПлатежа.Сумма");
		Если ДокументОбъект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные Тогда
		   МассивОбязательныхРеквизитов.Добавить("БанковскийСчетКонтрагента");
	    КонецЕсли;
	ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет Тогда				
		МассивОбязательныхРеквизитов.Добавить("Контрагент");
		МассивОбязательныхРеквизитов.Добавить("ЛицевойСчетКонтрагента");
	ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОтПодотчетника Тогда	
		МассивОбязательныхРеквизитов.Добавить("Контрагент");
		МассивОбязательныхРеквизитов.Добавить("РасшифровкаПлатежа");	
		МассивОбязательныхРеквизитов.Добавить("РасшифровкаПлатежа.ДокументОснования");
		МассивОбязательныхРеквизитов.Добавить("РасшифровкаПлатежа.Сумма");	
	ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.ВидыОпераций.ПоступлениеИзБанка Тогда		
		МассивОбязательныхРеквизитов.Добавить("БанковскийСчетКонтрагента");
	ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыОтПоставщика 
		ИЛИ ДокументОбъект.ВидОперации = Перечисления.ВидыОпераций.ВозвратЗайма Тогда			
		МассивОбязательныхРеквизитов.Добавить("Контрагент");		
		Если ДокументОбъект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные Тогда			
			МассивОбязательныхРеквизитов.Добавить("БанковскийСчетКонтрагента");			
		КонецЕсли;		
	ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыКлиенту Тогда		
		МассивОбязательныхРеквизитов.Добавить("Контрагент");
		МассивОбязательныхРеквизитов.Добавить("РасшифровкаПлатежа");	
		МассивОбязательныхРеквизитов.Добавить("РасшифровкаПлатежа.ДокументОснования");
		МассивОбязательныхРеквизитов.Добавить("РасшифровкаПлатежа.Сумма");
	ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.ВидыОпераций.ВозвратНалога Тогда
        МассивОбязательныхРеквизитов.Добавить("РасшифровкаПлатежа.ВидНалога");
	ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.ВидыОпераций.ПоступлениеОтЭквайера Тогда
        МассивОбязательныхРеквизитов.Добавить("ЭквайрингТерминал"); // ЭквайрингДоговор.
    ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.ВидыОпераций.ПрочееПоступление Тогда
         Если ДокументОбъект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ЛицевойСчет Тогда
			МассивОбязательныхРеквизитов.Добавить("Контрагент");
		КонецЕсли;
	ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.ВидыОпераций.ВозвратЗаработнойПлаты Тогда		
		МассивОбязательныхРеквизитов.Добавить("ВозвратВыплатыЗПДокументОснования");
		МассивОбязательныхРеквизитов.Добавить("РасшифровкаПлатежа");	
		МассивОбязательныхРеквизитов.Добавить("РасшифровкаПлатежа.ДокументОснования");
		МассивОбязательныхРеквизитов.Добавить("РасшифровкаПлатежа.Сотрудник");
		МассивОбязательныхРеквизитов.Добавить("РасшифровкаПлатежа.Сумма");

	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Процедура печати документа.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КО1") Тогда		
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"КО1",
			"Поступление денежных средств",
			СформироватьПечатнуюФормуКО1(МассивОбъектов, ОбъектыПечати)
			);
			
	КонецЕсли;
	
КонецПроцедуры // Печать()
 
// Функция формирует табличный документ с печатной формой приходного кассового ордера.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма приходного кассового ордера
//
Функция СформироватьПечатнуюФормуКО1(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПоступлениеДенежныхСредств.ПФ_MXL_КО1");
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ДанныеДокумента.Ссылка КАК Ссылка,
	                      |	ДанныеДокумента.Дата КАК ДатаДокумента,
	                      |	ДанныеДокумента.Номер КАК Номер,
	                      |	ДанныеДокумента.Контрагент КАК Контрагент,
	                      |	ДанныеДокумента.Контрагент.Представление КАК КонтрагентПредставление,
	                      |	ДанныеДокумента.Контрагент КАК ПринятоОт,						  
	                      |	ДанныеДокумента.СтруктурнаяЕдиница.Организация КАК Организация,
	                      |	ДанныеДокумента.СтруктурнаяЕдиница.Организация КАК НименованиеОрганизации,
	                      |	ДанныеДокумента.СтруктурнаяЕдиница.Организация.Префикс КАК Префикс,
	                      |	ДанныеДокумента.СтруктурнаяЕдиница.Организация.КодПоОКПО КАК ОрганизацияПоОКПО,
	                      |	ДанныеДокумента.СуммаДокумента КАК Сумма,
	                      |	ДанныеДокумента.АвторДокумента.Наименование КАК ФИОКассира,
	                      |	ДанныеДокумента.АвторДокумента.Ссылка КАК АвторДокументаСсылка,						  
	                      |	ДанныеДокумента.ТипДенежныхСредств КАК ТипДенежныхСредств
	                      |ИЗ
	                      |	Документ.ПоступлениеДенежныхСредств КАК ДанныеДокумента
	                      |ГДЕ
	                      |	ДанныеДокумента.Ссылка В(&МассивДокументов)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДанныеДокумента.Номер");
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Выборка);
		
		ОбластьМакета.Параметры.СуммаТекВал = "Сумма" + Символы.ПС + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодЦелойчастиВалюты() + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодДробнойчастВалюты();
		ОбластьМакета.Параметры.СчетДебет="50.01";
		Если Выборка.Ссылка.ВидОперации =Перечисления.ВидыОпераций.ВзносНаЛицевойСчет Тогда
			
			ОбластьМакета.Параметры.СубСчет="60.01,60.02";
		ИначеЕсли Выборка.Ссылка.ВидОперации =Перечисления.ВидыОпераций.ВозвратПоставщику 
			ИЛИ Выборка.Ссылка.ВидОперации =Перечисления.ВидыОпераций.ОплатаОтКлиента Тогда
			
			ОбластьМакета.Параметры.СубСчет="62.01,62.02";
		ИначеЕсли Выборка.Ссылка.ВидОперации =Перечисления.ВидыОпераций.ПоступлениеИзБанка Тогда
			
		//	ОбластьМакета.Параметры.СубСчет="51";
		// ИначеЕсли Выборка.Ссылка.ВидОперации =Перечисления.ВидыОпераций.ПоступлениеИзКассыККМ Тогда
			
			ОбластьМакета.Параметры.СубСчет="50.2";
		ИначеЕсли Выборка.Ссылка.ВидОперации =Перечисления.ВидыОпераций.ВозвратОтПодотчетника Тогда
			
			ОбластьМакета.Параметры.СубСчет="71.01";
		Иначе
			
			ОбластьМакета.Параметры.СубСчет="91.01";
		КонецЕсли;	  
		
		// Если Не ПустаяСтрока(Выборка.НаименованиеОрганизацииСокращенное) Тогда
		//	ОбластьМакета.Параметры.ПредставлениеОрганизации = Выборка.НаименованиеОрганизацииСокращенное;
		// Иначе
		СведенияОбОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Выборка.Организация, Выборка.ДатаДокумента), "ОфициальноеНаименование");
		ОбластьМакета.Параметры.ПредставлениеОрганизации = СведенияОбОрганизации; 
		// ОбластьМакета.Параметры.ПредставлениеПодразделения=Выборка.Ссылка.СтруктурнаяЕдиница;
		
		// КонецЕсли;
		
		Сумма = Формат(Выборка.Сумма, "ЧЦ=15; ЧДЦ=2");
		// ВалютаРегламентированногоУчета = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ВалютаРегламентированногоУчета");
		// Если ВалютаРегламентированногоУчета <> Выборка.Валюта Тогда
		//	Сумма = Сумма + " " + СокрЛП(Выборка.ВалютаПредставление);
		// КонецЕсли;
		ОбластьМакета.Параметры.Сумма = Сумма;
		ОбластьМакета.Параметры.СуммаРубКоп = ФормированиеПечатныхФорм.СуммаРубКоп(
			Выборка.Сумма, 
			// Выборка.Валюта,	
			,// ВалютаРегламентированногоУчета
		);
		ОбластьМакета.Параметры.СуммаПрописью  
		= ФормированиеПечатныхФорм.СформироватьСуммуПрописью(
			Выборка.Сумма, 
			// Выборка.Валюта, 
			,Ложь // ВыводитьСуммуБезКопеек
		);
		ОбластьМакета.Параметры.НомерДокумента = ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(
		Выборка.Номер, 
		Выборка.Префикс
		);
		
		ЗапросОснование = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		                               |	ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументОснования КАК ДокументОснования,
		                               |	ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументАванса КАК ДокументАванса,
		                               |	ПоступлениеДенежныхСредствРасшифровкаПлатежа.ЭтоАванс КАК ЭтоАванс
		                               |ИЗ
		                               |	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеДенежныхСредствРасшифровкаПлатежа
		                               |ГДЕ
		                               |	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка = &Ссылка");
		
		ЗапросОснование.УстановитьПараметр("Ссылка", Выборка.Ссылка);
		МассивДокументовОснования = ЗапросОснование.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументОснования");
		Основание = ЗапросОснование.Выполнить().Выбрать();							  
		
		Если Основание.Следующий() Тогда 
			Если Основание.ДокументОснования <> Неопределено Тогда
				ОбластьМакета.Параметры.Основание = Строка(ТипЗнч(Основание.ДокументОснования)) + " №" + ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Основание.ДокументОснования.Номер, Истина, Истина) + " от " + Формат(Основание.ДокументОснования.Дата, "ДФ=dd.MM.yyyy");
			ИначеЕсли Основание.ЭтоАванс И ЗначениеЗаполнено(Основание.ДокументАванса) Тогда 
				ОбластьМакета.Параметры.Основание = Строка(ТипЗнч(Основание.ДокументАванса)) + " №" + ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Основание.ДокументАванса.Номер, Истина, Истина) + " от " + Формат(Основание.ДокументАванса.Дата, "ДФ=dd.MM.yyyy");
			КонецЕсли;	
		КонецЕсли;
		
		ВТомЧислеНДС = ДенежныеСредстваСервер.ТекстСуммаНДСПлатежа(Выборка.Сумма, , МассивДокументовОснования, Ложь);		
		Если ПустаяСтрока(ВТомЧислеНДС) Тогда
			ОбластьМакета.Параметры.ВТомЧисле = "без налога (НДС)";
		Иначе 
			ОбластьМакета.Параметры.ВТомЧисле = ВТомЧислеНДС;
		КонецЕсли;
		
		ГлавБух = ОбщегоНазначенияСтоматология.ПолучитьСрезПоследнихПоОтветсвеннымЛицам(Выборка.Организация, Перечисления.ТипыОтветственныхЛиц.ГлавныйБухгалтер, Выборка.ДатаДокумента);
		Если ГлавБух.Количество() > 0 Тогда 
			ОбластьМакета.Параметры.ФИОГлавногоБухгалтера = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(ГлавБух[0].Сотрудник));
		КонецЕсли;	
		
		Кассир = ОбщегоНазначенияСтоматология.ПолучитьСрезПоследнихПоОтветсвеннымЛицам(Выборка.Организация, Перечисления.ТипыОтветственныхЛиц.Кассир, Выборка.ДатаДокумента);
		Если Кассир.Количество() > 0 Тогда 
			ОбластьМакета.Параметры.ФИОКассира = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(Кассир[0].Сотрудник));
		ИначеЕсли Выборка.АвторДокументаСсылка <> Справочники.Сотрудники.ПустаяСсылка() Тогда
			ОбластьМакета.Параметры.ФИОКассира = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(Выборка.АвторДокументаСсылка)); 
		КонецЕсли;	
		
		// ОбластьМакета.Параметры.ФИОГлавногоБухгалтера = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Выборка.ГлавныйБухгалтер);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
		ТабличныйДокумент,
		НомерСтрокиНачало,
		ОбъектыПечати,
		Выборка.Ссылка
		);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФормуКО1()

#КонецОбласти

#КонецЕсли
