
#Область ОписаниеПеременных

Перем БлокировкаОбработчикаКорректировкиДокументовОснования Экспорт;  // Флаг блокировки в обработчике корректировки суммы документа оснвоания

// Текущий режим записи документа
Перем РежимЗаписиТекущий; 

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Заполнение реквизитов документа по умолчанию
	Дата               = ТекущаяДата();
	ТипДенежныхСредств = ?(НЕ ЗначениеЗаполнено(ТипДенежныхСредств),Перечисления.ТипыДенежныхСредств.Наличные,ТипДенежныхСредств);
	ВидОперации        = ?(НЕ ЗначениеЗаполнено(ВидОперации), Перечисления.ВидыОпераций.ВозвратОплатыКлиенту,ВидОперации);
	Касса              = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.ОсновнаяКасса;
	ЭквайрингТерминал  = Справочники.ЭквайринговыеТерминалы.ПолучитьЭквайринговыйТерминалПоУмолчанию(Касса);	
	СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
    Сотрудник          = ПараметрыСеанса.ТекущийПользователь.Сотрудник;
    АвторДокумента	   = ПараметрыСеанса.ТекущийПользователь;
	
	Если НЕ Константы.ИспользоватьВидыЛицевыхСчетов.Получить() 
		ИЛИ Справочники.ВидыЛицевыхСчетов.ВернутьВидыЛицевыхСчетов().Количество() = 1 Тогда
		ЛицевойСчетКонтрагента = Справочники.ВидыЛицевыхСчетов.ОсновнойЛицевойСчет;
	КонецЕсли;
	 
	Если ДанныеЗаполнения <> Неопределено Тогда
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда				
			ВидОперации            = ?(ДанныеЗаполнения.Свойство("ВидОперации"), ДанныеЗаполнения.ВидОперации, ВидОперации);	
			ТипДенежныхСредств     = ?(ДанныеЗаполнения.Свойство("ТипДенежныхСредств"), ДанныеЗаполнения.ТипДенежныхСредств, ТипДенежныхСредств);
			Контрагент             = ?(ДанныеЗаполнения.Свойство("Контрагент"), ДанныеЗаполнения.Контрагент, Контрагент);			
			ЛицевойСчетКонтрагента = ?(ДанныеЗаполнения.Свойство("ЛицевойСчетКонтрагента"), ДанныеЗаполнения.ЛицевойСчетКонтрагента, ЛицевойСчетКонтрагента); 
			Касса             	   = ?(ДанныеЗаполнения.Свойство("Касса"), ДанныеЗаполнения.Касса, Касса);   			
			Статья             	   = ?(ДанныеЗаполнения.Свойство("Статья"), ДанныеЗаполнения.Статья, Статья);
			Комментарий            = ?(ДанныеЗаполнения.Свойство("Комментарий"), ДанныеЗаполнения.Комментарий, Комментарий);

			Если ДанныеЗаполнения.Свойство("ЭквайринговыйТерминал") Тогда
				ЭквайрингТерминал = ДанныеЗаполнения.ЭквайринговыйТерминал;
			Иначе
				ЭквайрингТерминал = ?(ДанныеЗаполнения.Свойство("Касса"), 
										Справочники.ЭквайринговыеТерминалы.ПолучитьЭквайринговыйТерминалПоУмолчанию(Касса),
										ЭквайрингТерминал);	
			КонецЕсли;
			
			СуммаДокумента         = ?(ДанныеЗаполнения.Свойство("СуммаДокумента"), ДанныеЗаполнения.СуммаДокумента, СуммаДокумента);
			// Предназначено для заполнения из данных таблицы "Оплата" подготавливаемых
			// обработкой помощи проведения оплаты
			Если ДанныеЗаполнения.Свойство("СтрокаТаблицыОплата") Тогда			
				СтрокаТаблицыОплата           = ДанныеЗаполнения.СтрокаТаблицыОплата;
				ТипДенежныхСредств            = СтрокаТаблицыОплата.ТипДенежныхСредств;
				ЛицевойСчетКонтрагента        = СтрокаТаблицыОплата.ВидЛицевогоСчета;
				ЭквайрингВидПлатежнойКарты    = СтрокаТаблицыОплата.ЭквайрингВидПлатежнойКарты;
				ЭквайрингНомерПлатежнойКарты  = СтрокаТаблицыОплата.ЭквайрингНомерПлатежнойКарты;			
			КонецЕсли;		
		Иначе			
			// Заполнение на основании документа "Реализация" или "Прием"
			Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Реализация") Тогда
				ВидОперации                   = Перечисления.ВидыОпераций.ОплатаОтКлиента;
				СтруктурнаяЕдиница            = ДанныеЗаполнения.СтруктурнаяЕдиница;
				Контрагент                    = ДанныеЗаполнения.Контрагент;
				Сотрудник                     = ДанныеЗаполнения.Сотрудник;								
				НоваяСтрока                   = РасшифровкаПлатежа.Добавить();
				НоваяСтрока.ДокументОснования = ДанныеЗаполнения;
				НоваяСтрока.Сумма             = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ПолучитьЗадолженностьПоДокументу(ДанныеЗаполнения);
			ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Прием") Тогда
				// Если в документе основания в виде оплаты находится страховой полис
				 Если ЗначениеЗаполнено(ДанныеЗаполнения.ПолисМедСтрахования) Тогда 
					ВидОперации               = Перечисления.ВидыОпераций.ОплатаОтСтраховойКомпании;
					ТипДенежныхСредств        = Перечисления.ТипыДенежныхСредств.Безналичные;
					Контрагент                = ДанныеЗаполнения.ПолисМедСтрахования.СтраховаяКомпания
				Иначе
					ВидОперации               = Перечисления.ВидыОпераций.ОплатаОтКлиента;
					Контрагент                = ДанныеЗаполнения.Контрагент;				
				КонецЕсли;		
			 	СтруктурнаяЕдиница            = ДанныеЗаполнения.СтруктурнаяЕдиница;
				Сотрудник                     = ДанныеЗаполнения.Сотрудник;								
				НоваяСтрока                   = РасшифровкаПлатежа.Добавить();
				НоваяСтрока.ДокументОснования = ДанныеЗаполнения;
				НоваяСтрока.Сумма             = ДанныеЗаполнения.СуммаДокумента;
				Если ЗначениеЗаполнено(ДанныеЗаполнения.Касса) Тогда
					Касса = ДанныеЗаполнения.Касса;
				КонецЕсли;

				// Заполнение на основании документа "ВозвратПоставщику"
			ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда				
				ВидОперации                   = Перечисления.ВидыОпераций.ВозвратОплатыОтПоставщика;
				ТипДенежныхСредств            = Перечисления.ТипыДенежныхСредств.Безналичные; 
				СтруктурнаяЕдиница            = ДанныеЗаполнения.СтруктурнаяЕдиница;
				Контрагент                    = ДанныеЗаполнения.Контрагент;				
				НоваяСтрока                   = РасшифровкаПлатежа.Добавить();
				НоваяСтрока.ДокументОснования = ДанныеЗаполнения;
				НоваяСтрока.Сумма             = ДанныеЗаполнения.СуммаДокумента;			
				// Заполнение на основании документа "ВозвратПоставщику"
			ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктОказанияУслуг") Тогда
				ВидОперации                   = Перечисления.ВидыОпераций.ОплатаОтСтраховойКомпании;
				ТипДенежныхСредств            = Перечисления.ТипыДенежныхСредств.Безналичные;
				СтруктурнаяЕдиница            = ДанныеЗаполнения.СтруктурнаяЕдиница;
				Контрагент                    = ДанныеЗаполнения.Контрагент;         
				Договор 					  = ДанныеЗаполнения.Договор;
				РасшифровкаПлатежа.Загрузить(ДанныеЗаполнения.ОказанныеУслуги.Выгрузить());
			ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда				
				Сотрудник =  ДанныеЗаполнения.Сотрудник;
				Контрагент = ДанныеЗаполнения.Сотрудник;
	        	ВидОперации 	= Перечисления.ВидыОпераций.ВозвратОтПодотчетника;
				
				ЗапросОстаток = Новый Запрос("ВЫБРАТЬ
				|	РасчетыСПодотчетникамиОстатки.СуммаОстаток
				|ИЗ
				|	РегистрНакопления.РасчетыСПодотчетниками.Остатки(
				|			,
				|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
				|				И Сотрудник = &Сотрудник) КАК РасчетыСПодотчетникамиОстатки");
				
				ЗапросОстаток.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
				ЗапросОстаток.УстановитьПараметр("Сотрудник", Сотрудник);

				РезультатОстаток = ЗапросОстаток.Выполнить().Выбрать();
				
				НоваяСтрока                   = РасшифровкаПлатежа.Добавить();		             	
				Если РезультатОстаток.Следующий() Тогда
					НоваяСтрока.Сумма = РезультатОстаток.СуммаОстаток;
				Иначе
					НоваяСтрока.Сумма = 0;	
				КонецЕсли;	
				
	
			ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ПеречислениеСсылка.ТипыДенежныхСредств") Тогда
				ТипДенежныхСредств = ДанныеЗаполнения;
			КонецЕсли;		
			// Установка суммы документ
			СуммаДокумента = РасшифровкаПлатежа.Итог("Сумма");	
	
		КонецЕсли;		
		// Установка банковского счета контрагента по умолчанию(при указанных условиях)
		Если ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные
		   И НЕ ВидОперации     = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет	
		   И НЕ ЗначениеЗаполнено(БанковскийСчетКонтрагента) 
		   И ЗначениеЗаполнено(Контрагент) Тогда	
		   БанковскийСчетКонтрагента = Контрагент.БанковскийСчетПоУмолчанию;
	   ИначеЕсли ВидОперации     = Перечисления.ВидыОпераций.ПоступлениеИзБанка
		    И НЕ ЗначениеЗаполнено(БанковскийСчетКонтрагента) Тогда
		    БанковскийСчетКонтрагента = СтруктурнаяЕдиница.Организация.БанковскийСчетПоУмолчанию;
	   КонецЕсли;    
	   Если ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные
		   И НЕ ЗначениеЗаполнено(БанковскийСчет) Тогда	
		   БанковскийСчет = СтруктурнаяЕдиница.Организация.БанковскийСчетПоУмолчанию;
	   КонецЕсли; 

	КонецЕсли;
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Обработчик при копировани объекта.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	 СуммаДокумента   = 0;
	 НомерЧекаККМ     = 0;
	 КодСинхронизации = "";
	 СостояниеКассовойСмены = РозничныеПродажи.ПолучитьСостояниеКассовойСмены(Касса);
	 КассоваяСмена = ?(СостояниеКассовойСмены <> Неопределено, СостояниеКассовойСмены.КассоваяСмена, Неопределено);
	 РасшифровкаПлатежа.Очистить();
	 
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	 
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Перем МассивВсехРеквизитов;
	МассивОбязательныхРеквизитов = Новый Массив;
	//
	Документы.ПоступлениеДенежныхСредств.ПолучитьМассивыОбязательныхРеквизитов(ЭтотОбъект,
	МассивОбязательныхРеквизитов);
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	ДенежныеСредстваСервер.ЗаполнитьМассивНепроверяемыхРеквизитовПоОбъекту(ЭтотОбъект,
	МассивОбязательныхРеквизитов,
	МассивНепроверяемыхРеквизитов
	);
	
	// Если в документе заполнена колонка документ авнса
	// необходимость в обязательном заполнении колнки
	// Документ основания отпадает, ее необходимо исключить
	НомерСтроки = МассивОбязательныхРеквизитов.Найти("РасшифровкаПлатежа.ДокументОснования");
	Если НомерСтроки <> Неопределено Тогда
		Для Каждого СтрокаТ ИЗ РасшифровкаПлатежа Цикл
			Если ЗначениеЗаполнено(СтрокаТ.ДокументАванса) Тогда
				МассивОбязательныхРеквизитов.Удалить(НомерСтроки);
				МассивНепроверяемыхРеквизитов.Добавить("РасшифровкаПлатежа.ДокументОснования");
				Прервать;
			КонецЕсли;	 	
		КонецЦикла;
	КонецЕсли;
	//
	ДенежныеСредстваСервер.УдалитьНепроверяемыеРеквизитыИзМассива(
	ПроверяемыеРеквизиты,
	МассивНепроверяемыхРеквизитов
	);
	
	ДенежныеСредстваСервер.ПроверитьЗаполнениеРасшифровкиПлатежа(
	ЭтотОбъект,
	СуммаДокумента,
	ВидОперации,
	Отказ
	);
	
КонецПроцедуры

// Обработчик перед записью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	РежимЗаписиТекущий = РежимЗаписи;

    // Проверка возможности отмены проведения документа
	Если ЗначениеЗаполнено(НомерЧекаККМ) И  РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ пробит на фискальном регистраторе. Отмена проведения не возможна!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	Если ПометкаУдаления = Ложь И ЭтотОбъект.ВидОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента Тогда
		МассивОснований = Новый Массив;
		Для Каждого СтрокаТЧ Из РасшифровкаПлатежа Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.ДокументОснования) Тогда
				МассивОснований.Добавить(СтрокаТЧ.ДокументОснования);	
			КонецЕсли;
		КонецЦикла;
		Если МассивОснований.Количество() <> 0 И РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда  		
			НеУчитываетсяРегистратор = ?(Проведен, Ссылка, Неопределено);
			Задолженность = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ПолучитьЗадолженностьПоДокументам(МассивОснований, НеУчитываетсяРегистратор, СтруктурнаяЕдиница);  
			Если СуммаДокумента > Задолженность Тогда
				Отказ = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Проведение документа невозможно, т.к. сумма документа " + СуммаДокумента +
				" превышает сумму задолженности " + Задолженность + ".';en='Holding of the document is not possible because amount payment exceeds total amount of the document.'"));	
				Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;

	// Если нет ни одной строки расшифровки, добавляем строку с суммой документа.
	// Это необходимо т.к. отборы для проводок проводятся из ТЧ
	Если РасшифровкаПлатежа.Количество() = 0 Тогда
		НоваяСтрока          = РасшифровкаПлатежа.Добавить();
		НоваяСтрока.ЭтоАванс = ЭтотОбъект.ВидОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента;
		НоваяСтрока.Сумма    = СуммаДокумента; 	
	КонецЕсли;  
	// Проверка заполнения статьи расходов в шапке
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Статья) Тогда
		ЭтотОбъект.Статья = Справочники.СтатьиДоходовИРасходов.ПолучитьСтатьюПоУмолчаниюДляОперации(ЭтотОбъект.ВидОперации,ЭтотОбъект.РасшифровкаПлатежа[0].ЭтоАванс);
	КонецЕсли;	
    // Необходимо проставить этот флаг если это аванс(или сбросить его если клиент изменил вид операции сущ. документа) 
	Для Каждого СтрокаТ ИЗ РасшифровкаПлатежа Цикл
		// Проставляем признак авансового платежа
		Если НЕ ЗначениеЗаполнено(СтрокаТ.ДокументОснования) Тогда
			СтрокаТ.ЭтоАванс          = ЭтотОбъект.ВидОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента;
			СтрокаТ.ДокументОснования = Неопределено;// Для недопущения пустых ссылок в регистре.
		Иначе
			СтрокаТ.ЭтоАванс          = Ложь;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТ.ДокументАванса) Тогда
			СтрокаТ.ДокументАванса = Неопределено;// Для недопущения пустых ссылок в регистре.
		КонецЕсли;
		// Проверка заполнения статьи расходов в ТЧ
		Если ЭтотОбъект.СтатьяВТаблице = Ложь И (НЕ ЗначениеЗаполнено(СтрокаТ.Статья) ИЛИ СтрокаТ.Статья <> ЭтотОбъект.Статья) Тогда
			СтрокаТ.Статья = ЭтотОбъект.Статья;
		ИначеЕсли ЭтотОбъект.СтатьяВТаблице = Истина И НЕ ЗначениеЗаполнено(СтрокаТ.Статья) Тогда
			СтрокаТ.Статья = Справочники.СтатьиДоходовИРасходов.ПолучитьСтатьюПоУмолчаниюДляОперации(ЭтотОбъект.ВидОперации,СтрокаТ.ЭтоАванс);
		КонецЕсли;	
	КонецЦикла;
	// Прописываем кассовую смену в документ
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ ЗначениеЗаполнено(КассоваяСмена) Тогда
		 СостояниеКассовойСмены   = РозничныеПродажи.ПолучитьСостояниеКассовойСмены(Касса);
	     КассоваяСмена            = ?(ЗначениеЗаполнено(СостояниеКассовойСмены), СостояниеКассовойСмены.КассоваяСмена, Неопределено);
	КонецЕсли;	 
	  
	// Если виды лицевых счетов в системе не используются, необходимо проставить вид ЛС по умолчанию 
	Если (ЭтотОбъект.ВидОперации = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет
		ИЛИ ЭтотОбъект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ЛицевойСчет)
		И Константы.ИспользоватьВидыЛицевыхСчетов.Получить() = Ложь
		И НЕ ЗначениеЗаполнено(ЭтотОбъект.ЛицевойСчетКонтрагента) Тогда
		 ЭтотОбъект.ЛицевойСчетКонтрагента = Справочники.ВидыЛицевыхСчетов.ОсновнойЛицевойСчет;
	КонецЕсли;
	
	ПрисвоитьIDТранзакции();
		
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, Режим)

	// Инициализация дополнительных свойств для проведения документа.
	ДвиженияДокументовСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);	
	
    // Инициализация данных документа.	
	Документы.ПоступлениеДенежныхСредств.УстановитьНачальныеДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	ДополнительныеСвойства.ДляПроведения.Вставить("ВыполнятьДвиженияДенежныесредства", Истина);
	
	// Движения по регистрам
	ДвиженияДокументовСервер.ДенежныеСредства(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.ДенежныеСредстваНаЛицевыхСчетах(ДополнительныеСвойства, Движения, Отказ);		
	ДвиженияДокументовСервер.ВзаиморасчетыСКонтрагентами(ДополнительныеСвойства, Движения, Отказ);	
	ДвиженияДокументовСервер.РасчетыСПодотчетниками(ДополнительныеСвойства, Движения, Отказ);			
	ДвиженияДокументовСервер.РасчетыПоЭквайрингу(ДополнительныеСвойства, Движения, Отказ);	
	ДвиженияДокументовСервер.РасчетыСПерсоналом(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.Управленческий(ДополнительныеСвойства, Движения, Отказ);

    // Запись наборов записей.
	ДвиженияДокументовСервер.ДобавитьНаборыЗаписей(ЭтотОбъект);	

	// Запись значения реквизита "сумма оплачено"
	ДенежныеСредстваСервер.ЗаполнитьРеквизитыОплатыДокументаОснования(ЭтотОбъект);
	
	ВыполнитьПерепроведениеРеализацийПриНеобходимости();

КонецПроцедуры

// Обрабока удаления проведения.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Запись значения реквизита "сумма оплачено"
	ДенежныеСредстваСервер.ЗаполнитьРеквизитыОплатыДокументаОснования(ЭтотОбъект,Истина);
	ВыполнитьПерепроведениеРеализацийПриНеобходимости();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура присваивает уникальный идентификатор транзакции.
//
Процедура ПрисвоитьIDТранзакции()
	
	Если НЕ ЗначениеЗаполнено(ID_Транзакции) Тогда 
		ID_Транзакции = Новый УникальныйИдентификатор;
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Выполнить перепроведение реализаций при необходимости
//
Процедура ВыполнитьПерепроведениеРеализацийПриНеобходимости()
	
	Для Каждого СтрокаТ ИЗ ЭтотОбъект.РасшифровкаПлатежа Цикл
		
		Если ЗначениеЗаполнено(СтрокаТ.ДокументОснования)
			И (ТипЗнч(СтрокаТ.ДокументОснования) = Тип("ДокументСсылка.Прием") 
			ИЛИ ТипЗнч(СтрокаТ.ДокументОснования) = Тип("ДокументСсылка.Реализация"))
			И СтрокаТ.ДокументОснования.Проведен = Истина 
			И Обработки.ПомощникПроведенияОплаты.ПроверитьНеобходимостьПерепроведенияРеализацииПослеОплаты(СтрокаТ.ДокументОснования) = Истина Тогда
			
			ДокОбъект = СтрокаТ.ДокументОснования.ПолучитьОбъект();
			ДокОбъект.ДополнительныеСвойства.Вставить("НеПолучатьРазрешениеЗаписиПоПравам"		, Истина);
			ДокОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных"	, Истина);
			
			Если РежимЗаписиТекущий = РежимЗаписиДокумента.Проведение Тогда
				Докобъект.ДополнительныеСвойства.Вставить("ПерепроведениеПриемаПослеОплаты"	, Истина);
			КонецЕсли;
			
			ДокОбъект.ДополнительныеСвойства.Вставить("ДокументПоступлениеДенежныхСредств" , Ссылка);
			
			Докобъект.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

