
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура - При определении настроек отчета
//
// Параметры:
//  НастройкиОтчета		 - 	 - 
//  НастройкиВариантов	 - 	 - 
//
//Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
//	
//	НастройкиВариантов["Взаиморасчеты"].Рекомендуемый    = Истина;
//	НастройкиВариантов["Взаиморасчеты"].ИмяМакетаОбразца = "ОбразецВзаиморасчеты";
//	
//КонецПроцедуры

#КонецОбласти

#КонецЕсли