
#Область ОбработчикиСобытийЭлементовФормы
  
&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийСклад = Объект.СтруктурнаяЕдиница.ОсновнойСклад;
				
	РаботаСДиалогами.УстановитьДоступностьЭлементовФормДокументаПоПравамПользователя(ЭтаФорма, Объект);
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
	// Установим реквизиты
	Если Не ЗначениеЗаполнено(Объект.ВидЦен) Тогда
		Объект.ВидЦен = Справочники.ВидыЦен.Закупочная;
	КонецЕсли;

	ВывестиВидЦенИСтруктурнуюЕдиницу();	
	
	ОбщегоНазначенияСтоматология.ЗаполнитьПризнакИспользованияХарактеристик(Объект.Запасы);	
    Элементы.СтруктурнаяЕдиницаНадпись.Заголовок = Объект.СтруктурнаяЕдиница;
	
	СтруктураМеню = Новый Структура;
	СтруктураМеню.Вставить("ВыданныеАвансы", "ГруппаВыданныеАвансы");
	СтруктураМеню.Вставить("Запасы"	       , "ГруппаЗапасы");	
	СтруктураМеню.Вставить("Расходы"	   , "ГруппаРасходы");
	СтруктураМеню.Вставить("Оплаты"	   	   , "ГруппаОплаты");
	СтруктураМеню.Вставить("Дополнительно" , "ГруппаДополнительно");
	
	ОбработкаТабличныхЧастейКлиент.СоздатьМенюДокумента(ЭтаФорма, СтруктураМеню, "ГруппаПереключательЗакладок");
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ПриОкрытии
//
Процедура ПриОткрытии(Отказ)
	
		// МеханизмВнешнегоОборудования
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ОписаниеОшибки = "";
		
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
		
		Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:
			|""%ОписаниеОшибки%"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	// Конец МеханизмВнешнегоОборудования 
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ОбработкаОповещения
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ВнешнееОборудование
	Если Источник = "ВнешнееОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Данные = Новый Массив();
			Если Параметр[1] = Неопределено Тогда
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[0], 1)); // Достаем штрихкод из основных данных
			Иначе
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[1][1], 1)); // Достаем штрихкод из дополнительных данных
			КонецЕсли;
			ПолученыШтрихкоды(Данные);
		ИначеЕсли ИмяСобытия = "DataCollectionTerminal" Тогда
			ПолученыШтрихкоды(Параметр);
		КонецЕсли;
	КонецЕсли;
	// Конец ВнешнееОборудование 
	
	Если Источник = "ВнешнееОборудование" И ИмяСобытия = "НеизвестныеШтрихкоды" 
			И УникальныйИдентификатор = Параметр.ФормаВладелецУникальныйИдентификатор Тогда
		ПолученыШтрихкоды(Параметр.ЗарегистрированныеШтрихкоды);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПослеЗаписиНаСервере"
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияСтоматология.ЗаполнитьПризнакИспользованияХарактеристик(Объект.Запасы);
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовШапкиФормы

   &НаКлиенте
// Процедура, выполняет обработку нажатия динамических кнопок.
//
Процедура ПроцедураОбработкиНажатияМеню(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ПроцедураОбработкиНажатияМеню(ЭтаФорма, Элемент.Имя);	
		
КонецПроцедуры

 &НаКлиенте
// Процедура, обработчик события "ПриИзменении" поле ввода "Номенклатура"
// 
Процедура ЗапасыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Номенклатура", 		ТекущаяСтрока.Номенклатура);
	СтруктураДанные.Вставить("СтруктурнаяЕдиница",	Объект.СтруктурнаяЕдиница);
	СтруктураДанные.Вставить("ДатаОбработки",		Объект.Дата);
	СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);
	СтруктураДанные.Вставить("Упаковка", 			ТекущаяСтрока.Упаковка);
	
	СтруктураДанные = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	ТекущаяСтрока.Упаковка = СтруктураДанные.Упаковка;
	ТекущаяСтрока.Цена = СтруктураДанные.Цена; 
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.КоличествоУпаковок) Тогда
		ТекущаяСтрока.КоличествоУпаковок = 1;
	КонецЕсли;
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(ТекущаяСтрока);
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(ТекущаяСтрока); 
	
	ТекущаяСтрока.ХарактеристикиИспользуются = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ТекущаяСтрока.Номенклатура, "ИспользоватьПартии");
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик  события "ПриИзменении" поле ввода "Упаковка"
//
Процедура ЗапасыУпаковкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;	
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("ДатаОбработки",		Объект.Дата);
	СтруктураДанные.Вставить("СтруктурнаяЕдиница",	Объект.СтруктурнаяЕдиница);
	СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);	

	ОбработкаТабличныхЧастейКлиент.ПриИзмененииУпаковкиТабЧасти(ТекущаяСтрока, СтруктураДанные);
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поле ввода "КоличествоУпаковок"
//
Процедура ЗапасыКоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(ТекущаяСтрока);  	
	РассчитатьСуммуВСтрокеТабличнойЧасти(ТекущаяСтрока);
	
КонецПроцедуры 

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поле ввода "Цена"
//
Процедура ЗапасыЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(ТекущаяСтрока);
	
КонецПроцедуры                                                            

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поле ввода "Сумма"
//
Процедура ЗапасыСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	
	ОбработкаТабличныхЧастейКлиент.ПриИзмененииСуммыВТабличнойЧасти(ТекущаяСтрока);
	ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуВКолонкеВсегоТабЧасти(ТекущаяСтрока);	
	
КонецПроцедуры 

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поле ввода "Номенклатура"
//
Процедура РасходыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Расходы.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Номенклатура", 		ТекущаяСтрока.Номенклатура);
	СтруктураДанные.Вставить("СтруктурнаяЕдиница",	Объект.СтруктурнаяЕдиница);
	СтруктураДанные.Вставить("ДатаОбработки",		Объект.Дата);
	СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);
	СтруктураДанные.Вставить("Упаковка", 			ТекущаяСтрока.Упаковка);
	
	СтруктураДанные = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	ТекущаяСтрока.Упаковка = СтруктураДанные.Упаковка;
	ТекущаяСтрока.Цена = СтруктураДанные.Цена; 
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.КоличествоУпаковок) Тогда
		ТекущаяСтрока.КоличествоУпаковок = 1;
	КонецЕсли;
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(ТекущаяСтрока);
	РассчитатьСуммуВСтрокеТабличнойЧасти(ТекущаяСтрока); 
	ТекущаяСтрока.ХарактеристикиИспользуются = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ТекущаяСтрока.Номенклатура, "ИспользоватьПартии");
	
КонецПроцедуры  

// Процедура, обработчик события "НачалоВыбора" поле ввода "Упаковка"
//
&НаКлиенте
Процедура ЗапасыУпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработкаТабличныхЧастейКлиент.ВыбратьУпаковкуНоменклатуры(ДанныеВыбора, СтандартнаяОбработка, Элементы.Запасы.ТекущиеДанные);
	
КонецПроцедуры 

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура РасходыПартияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.Расходы.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		
		мПараметрыВыбора = Новый Структура;
		мПараметрыВыбора.Вставить("Владелец"                       , ТекущаяСтрока.Номенклатура);
		мПараметрыВыбора.Вставить("Склад"                          , ТекущийСклад);
		мПараметрыВыбора.Вставить("СтруктурнаяЕдиница"             , Объект.СтруктурнаяЕдиница);
		мПараметрыВыбора.Вставить("Дата"                           , Объект.Дата);
		мПараметрыВыбора.Вставить("НеКонтролироватьОстаткиПоСкладу", Истина);
        мПараметрыВыбора.Вставить("МножественныйВыбор"             , Ложь);

		ОткрытьФорму("Справочник.ПартииНоменклатуры.ФормаВыбора", мПараметрыВыбора,,,,,Новый ОписаниеОповещения("ЗапасыРасходыПартияНачалоВыбораЗавершение", ЭтотОбъект, ТекущаяСтрока), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик  события "ПриИзменении" поле ввода "Упаковка"
//
Процедура РасходыУпаковкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Расходы.ТекущиеДанные;	
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("ДатаОбработки",		Объект.Дата);
	СтруктураДанные.Вставить("СтруктурнаяЕдиница",	Объект.СтруктурнаяЕдиница);
	СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);	

	ОбработкаТабличныхЧастейКлиент.ПриИзмененииУпаковкиТабЧасти(ТекущаяСтрока, СтруктураДанные);
	РассчитатьСуммуВСтрокеТабличнойЧасти(ТекущаяСтрока);
	
КонецПроцедуры  

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора" поле ввода "Упаковка"
//
Процедура РасходыУпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработкаТабличныхЧастейКлиент.ВыбратьУпаковкуНоменклатуры(ДанныеВыбора, СтандартнаяОбработка, Элементы.Расходы.ТекущиеДанные);
	
КонецПроцедуры 
&НаКлиенте 
// Процедура, обработчик события "ПриИзменении" поле ввода "КоличествоУпаковок"
//
Процедура РасходыКоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Расходы.ТекущиеДанные;
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(ТекущаяСтрока);  	
	РассчитатьСуммуВСтрокеТабличнойЧасти(ТекущаяСтрока);
	
КонецПроцедуры 
&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поле ввода "Цена"
//
Процедура РасходыЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Расходы.ТекущиеДанные;	
	РассчитатьСуммуВСтрокеТабличнойЧасти(ТекущаяСтрока);
	
КонецПроцедуры                                                    

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поле ввода "Сумма"
//
Процедура РасходыСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Расходы.ТекущиеДанные;
	
	ОбработкаТабличныхЧастейКлиент.ПриИзмененииСуммыВТабличнойЧасти(ТекущаяСтрока);
	ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуВКолонкеВсегоТабЧасти(ТекущаяСтрока);	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ЗапасыПартияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		
		мПараметрыВыбора = Новый Структура;
		мПараметрыВыбора.Вставить("Владелец"                       , ТекущаяСтрока.Номенклатура);
		мПараметрыВыбора.Вставить("Склад"                          , ТекущийСклад);
		мПараметрыВыбора.Вставить("СтруктурнаяЕдиница"             , Объект.СтруктурнаяЕдиница);
		мПараметрыВыбора.Вставить("Дата"                           , Объект.Дата);
		мПараметрыВыбора.Вставить("НеКонтролироватьОстаткиПоСкладу", Истина);
		мПараметрыВыбора.Вставить("МножественныйВыбор"             , Ложь);

		ОткрытьФорму("Справочник.ПартииНоменклатуры.ФормаВыбора", мПараметрыВыбора,,,,,Новый ОписаниеОповещения("ЗапасыРасходыПартияНачалоВыбораЗавершение", ЭтотОбъект, ТекущаяСтрока), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
// При изменении заполнения заполнения статьи затрат
Процедура СтатьяРасходовПриИзменении(Элемент)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("СтатьяРасходовПриИзмененииПродолжение", ЭтотОбъект), "Перезаполнять только текущую открытую таблицу?",РежимДиалогаВопрос.ДаНет);	

КонецПроцедуры

&НаКлиенте 
// Процедура - Статья расходов при изменении продолжение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура СтатьяРасходовПриИзмененииПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПерезаполнятьВсеТаблицы  = РезультатВопроса = КодВозвратаДиалога.Нет;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("СтатьяРасходовПриИзмененииЗавершение", ЭтотОбъект, Новый Структура("ПерезаполнятьВсеТаблицы", ПерезаполнятьВсеТаблицы)), "Перезаполнять заполненные значения?",РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте   
// Процедура - Статья расходов при изменении завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура СтатьяРасходовПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПерезаполнятьВсеТаблицы = ДополнительныеПараметры.ПерезаполнятьВсеТаблицы;
	ПерезаполнятьЗаполненные = РезультатВопроса = КодВозвратаДиалога.Да;    
	
	Если Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаЗапасы.Видимость ИЛИ ПерезаполнятьВсеТаблицы Тогда
		Для Каждого СтрокаТ ИЗ Объект.Запасы Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТ.СтатьяЗатрат) ИЛИ ПерезаполнятьЗаполненные = Истина Тогда
				СтрокаТ.СтатьяЗатрат = Объект.СтатьяЗатрат;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	Если Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаРасходы.Видимость ИЛИ ПерезаполнятьВсеТаблицы Тогда
		Для Каждого СтрокаТ ИЗ Объект.Расходы Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТ.СтатьяЗатрат) ИЛИ ПерезаполнятьЗаполненные = Истина Тогда
				СтрокаТ.СтатьяЗатрат = Объект.СтатьяЗатрат;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	Если Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаОплаты.Видимость ИЛИ ПерезаполнятьВсеТаблицы Тогда
		Для Каждого СтрокаТ ИЗ Объект.Оплаты Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТ.СтатьяЗатрат) ИЛИ ПерезаполнятьЗаполненные = Истина Тогда
				СтрокаТ.СтатьяЗатрат = Объект.СтатьяЗатрат;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтруктурнаяЕдиницаНадписьНажатие(Элемент)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЭтоПользователь", Истина);
    СтруктураПараметров.Вставить("Ссылка", ОбщегоНазначенияСтоматология.ДоступныеСтруктурныеЕдиницы());  
	СтруктураПараметров.Вставить("ВидСравненияКомпоновкиДанных", ВидСравненияКомпоновкиДанных.ВСписке);
    ОткрытьФорму("Справочник.СтруктурныеЕдиницы.ФормаВыбора", СтруктураПараметров,,,,,Новый ОписаниеОповещения("СтруктурнаяЕдиницаНадписьНажатиеЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении"
//
Процедура ВыданныеАвансыДокументПриИзменении(Элемент)
	
	ТекущаяСтрока 		= Элементы.ВыданныеАвансы.ТекущиеДанные;	
	ТекущаяСтрока.Сумма = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ТекущаяСтрока.Документ, "СуммаДокумента");
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора"
//
Процедура ВыданныеАвансыДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ПараметрыФормы       = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент"        	, Объект.Сотрудник);
	ПараметрыФормы.Вставить("СтруктурнаяЕдиница" 	, Объект.СтруктурнаяЕдиница);
	ПараметрыФормы.Вставить("ДокументАванс" 		, Объект.Ссылка);	
	ПараметрыФормы.Вставить("МассивДокументов"      , ВернутьМассивВыбранныхДокументов());
	ПараметрыФормы.Вставить("КотрольКонтрагента"	, Истина);
	ПараметрыФормы.Вставить("ВыборкаОткрытыхАвансов", Истина);
	
	РезВыбора = ОткрытьФорму("ОбщаяФорма.ВыборДокументаРасчетов", ПараметрыФормы, Элемент);	
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ОбработкаВыбора"
//
Процедура ВыданныеАвансыДокументОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	Если ВыбранноеЗначение <> Неопределено Тогда		
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда	
			Счетчик = 0;
			Для Каждого ЭлементМ Из ВыбранноеЗначение Цикл
				ВыданныеАвансыДокументОбработкаВыбораЗавершение(ЭлементМ, Счетчик);	
			КонецЦикла;  	
		Иначе 
			СуммаВыбранногоДокумента     = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ВыбранноеЗначение,"СуммаДокумента");
			СтруктураВыбранногоДокумента = Новый Структура("ДокументОснования, СуммаДокумента", ВыбранноеЗначение, СуммаВыбранногоДокумента);	
			ВыданныеАвансыДокументОбработкаВыбораЗавершение(СтруктураВыбранногоДокумента);             
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте  
// Процедура - Выданные авансы обработка выбора завершение
//
// Параметры:
//  ВыбранноеЗначение	 - 	 - 
//  Счетчик				 - 	 - 
//
Процедура ВыданныеАвансыДокументОбработкаВыбораЗавершение(ВыбранноеЗначение, Счетчик = 0)
	
	РазрешитьДобавление = Истина;
	// Проверка существования строки с выбранными данными
	Для Каждого СтрокаТ ИЗ Объект.ВыданныеАвансы Цикл
		Если СтрокаТ.Документ = ВыбранноеЗначение.ДокументОснования Тогда
			СтрокаТ.Сумма       = ВыбранноеЗначение.СуммаДокумента; 
			РазрешитьДобавление = Ложь;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	// Есди добавление данных в строку разрешено
	Если РазрешитьДобавление = Истина Тогда
		ОбрабатываемаяСтрока = Неопределено;
		Если Счетчик = 0 Тогда
			ОбрабатываемаяСтрока = Элементы.ВыданныеАвансы.ТекущиеДанные;
		Иначе
			ОбрабатываемаяСтрока = Объект.ВыданныеАвансы.Добавить();
		КонецЕсли;	
		
		ОбрабатываемаяСтрока.Документ = ВыбранноеЗначение.ДокументОснования;
		ОбрабатываемаяСтрока.Сумма    = ВыбранноеЗначение.СуммаДокумента;
		
		Счетчик = Счетчик + 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПередНачаломДобавления"
//
Процедура ВыданныеАвансыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если Копирование Тогда 
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
//
//
Процедура ЗапасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	
	Если НоваяСтрока = Истина Тогда
		ТекущаяСтрока.Склад = Объект.Сотрудник;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриИзменении(Элемент)
	
	РасчитатьПотраченнуюСумму();
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура РасходыПриИзменении(Элемент)
	
	РасчитатьПотраченнуюСумму();
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОплатыПриИзменении(Элемент)
	
	РасчитатьПотраченнуюСумму();
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Расходы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Сотрудник) Тогда
		ТекущиеДанные.Специализация = ПолучитьСпециализациюСотрудника(ТекущиеДанные.Сотрудник);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыданныеАвансыПриИзменении(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "Дата".
//
Процедура ДатаПриИзменении(Элемент)

	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандформы 

&НаКлиенте
// Процедура оработчик команды "Подбор"
//
Процедура Подбор(Команда)
	
	Если Команда.Имя = "ПодборЗапасы" Тогда
		ИмяТабличнойЧасти  = "Запасы";
	ИначеЕсли Команда.Имя = "ПодборРасходы" Тогда
		ИмяТабличнойЧасти  = "Расходы";
	КонецЕсли;
	ЕстьПартии		   = Истина;
		
	ПараметрыПодбора = Новый Структура;
	
	ПараметрыПодбора.Вставить("Период",				   Объект.Дата);
	ПараметрыПодбора.Вставить("СтруктурнаяЕдиница",	   Объект.СтруктурнаяЕдиница);
	ПараметрыПодбора.Вставить("ВидЦен",	   			   Объект.ВидЦен);
	ПараметрыПодбора.Вставить("ИспользуетсяСодержание",Истина);

	Если Объект[ИмяТабличнойЧасти].Количество() > 0 Тогда
		АдресЗапасовВХранилище = ПоместитьЗапасыВХранилище(ИмяТабличнойЧасти, ЕстьПартии);
		ПараметрыПодбора.Вставить("АдресЗапасовДокумента", АдресЗапасовВХранилище);
	КонецЕсли; 
	
	ТипНоменклатуры = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Номенклатура"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					ТипНоменклатуры.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				ТипНоменклатуры.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ПараметрыПодбора.Вставить("ТипНоменклатуры",	   ТипНоменклатуры);
		
	СтатусПартии = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Партия"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.Статус" Тогда			
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					СтатусПартии.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				СтатусПартии.Добавить(ЭлементМассива.Значение);
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПодбора.Вставить("СтатусПартии",	   		СтатусПартии); 
	
	ДополнительныеПараметры = Новый Структура;
	
	ДополнительныеПараметры.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	ДополнительныеПараметры.Вставить("ЕстьПартии", ЕстьПартии);

	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбора",
	ПараметрыПодбора,,,,,
	Новый ОписаниеОповещения("ПодборЗавершение", ЭтотОбъект, ДополнительныеПараметры), 
	РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После выбора банковского счета
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПодборЗавершение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда
		ПолучитьЗапасыИзХранилища(РезультатВыбора, ДополнительныеПараметры.ИмяТабличнойЧасти, ДополнительныеПараметры.ЕстьПартии);
		РасчитатьПотраченнуюСумму();
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик команды вызывает форму настройки и редактирования цен.
//
Процедура РедактироватьЦены(Команда)
	
	// 1. Формируем структуру параметров для заполнения формы "Цены и Валюта".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидЦен", 	  			Объект.ВидЦен);
	СтруктураПараметров.Вставить("ПерезаполнитьЦены",	Ложь);
	
	// 2. Открвыаем форму "Цены и Валюта".
	ОткрытьФорму("ОбщаяФорма.ФормаЦены", СтруктураПараметров,,,,,Новый ОписаниеОповещения("РедактироватьЦеныЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ЗагрузитьДанныеИзТСД", загружает данные из ТСД
//
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	МенеджерОборудованияКлиент.ЗагрузитьДанныеИзТСД(УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ЗаполнитьВыданныеАвансы(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.Сотрудник) Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Необходимо заполнить сотрудника!";
		Сообщение.Поле = "Объект.Сотрудник";
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
		
	РезультатЗапроса = ВернутьВыданныеАвансы(Объект.Ссылка, Объект.Сотрудник, Объект.СтруктурнаяЕдиница, ВернутьМассивВыбранныхДокументов());
	Для Каждого СтрокаРезультат Из РезультатЗапроса Цикл
		НоваяСтрока = Объект.ВыданныеАвансы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультат);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура печати документов.
//
Процедура ДокументПечать(Команда)
	
	МассивДокументов = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		МассивДокументов.Добавить(Объект.Ссылка);
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "АвансовыйОтчет");
	Структура.Вставить("МассивДокументов", МассивДокументов);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ОбработкаКоманды", УправлениеПечатьюКлиентСтоматология, Структура);	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		
		СтруктураВопроса = Новый Структура;
		СтруктураВопроса.Вставить("СписокПечатныхФорм", СписокПечатныхФорм);
		СтруктураВопроса.Вставить("Оповещение", Оповещение);
		ОповещениеДляВопроса = Новый ОписаниеОповещения("ПослеВопросаЗавершение", ЭтотОбъект, СтруктураВопроса);			
		ПоказатьВопрос(ОповещениеДляВопроса, "Данные ещё не записаны. Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе	
		
		ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, Элементы.ФормаДокументаПечать);
		
	КонецЕсли;   				
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура, обработчик события "ЗапасыПартияНачалоВыбораЗавершение"
//
Процедура ЗапасыРасходыПартияНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	ТекущаяСтрока = Параметры;
	Если НЕ Результат = Неопределено Тогда
		ТекущаяСтрока.Партия = Результат[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "РедактироватьЦеныЗавершение"
//
Процедура РедактироватьЦеныЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	// 3. Перезаполняем табличную часть "Запасы" если были внесены изменения в форме "Цены и Валюта".
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.БылиВнесеныИзменения Тогда
		
		Объект.ВидЦен = Результат.ВидЦен;
		
		// Пересчитываем цены по виду цен.					
		Если Результат.ПерезаполнитьЦены Тогда
			ЦенообразованиеКлиент.ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ЭтаФорма, "Запасы");
			ЦенообразованиеКлиент.ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ЭтаФорма, "Расходы");
			РасчитатьПотраченнуюСумму();
		КонецЕсли;

	КонецЕсли;

	ВывестиВидЦенИСтруктурнуюЕдиницу();
	
КонецПроцедуры

&НаКлиенте
Функция ПолученыШтрихкоды(ДанныеШтрикодов)
	
	НеизвестныеШтрихкоды = Новый Массив;
	
	Для Каждого ЭлементШтрихкода Из ДанныеШтрикодов Цикл
		Если ОбработкаТабличныхЧастейКлиент.СШКОбработкаТабличнойЧасти(Элементы.Запасы, ЭлементШтрихкода, , , , Объект.Запасы, НеизвестныеШтрихкоды) Тогда
			ЗапасыУпаковкаПриИзменении(Элементы.Запасы.ТекущиеДанные);		
		КонецЕсли;
		Если НеизвестныеШтрихкоды.Количество() > 0 Тогда 
			СтруктураПараметров = Новый Структура("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды);
			ОткрытьФорму("РегистрСведений.Штрихкоды.Форма.РегистрацияШтрихкодовНоменклатуры", СтруктураПараметров, ЭтаФорма);
		КонецЕсли;
	КонецЦикла;						
	
КонецФункции // ПолученыШтрихкоды()

// Процедура рассчитывает сумму в строке табличной части.
//
&НаКлиенте
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти)
	
	 ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти);
	 ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуВКолонкеВсегоТабЧасти(СтрокаТабличнойЧасти);	
	
КонецПроцедуры // РассчитатьСуммуВСтрокеТабличнойЧасти()

&НаСервере
// Функция получает список товаров из временного хранилища
//
Процедура ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, ЕстьПартии)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресЗапасовВХранилище);
	
	Для каждого СтрокаЗагрузки Из ТаблицаДляЗагрузки Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура", СтрокаЗагрузки.Номенклатура);
		СтруктураОтбора.Вставить("Упаковка", СтрокаЗагрузки.Упаковка);
		Если ЕстьПартии Тогда
			СтруктураОтбора.Вставить("Партия", СтрокаЗагрузки.Партия);
		КонецЕсли;
		
		Строки = Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураОтбора);
		Если Строки.Количество() > 0 Тогда
			СтрокаТабличнойЧасти = Строки[0];
		Иначе
			СтрокаТабличнойЧасти = Объект[ИмяТабличнойЧасти].Добавить();
			Если ИмяТабличнойЧасти = "Запасы" Тогда
				СтрокаТабличнойЧасти.Склад = Объект.Сотрудник;
			КонецЕсли;
		КонецЕсли;
			
	    СтрокаТабличнойЧасти.Номенклатура =  СтрокаЗагрузки.Номенклатура;
		СтрокаТабличнойЧасти.Партия = СтрокаЗагрузки.Партия;
		// СтрокаТабличнойЧасти.КоличествоУпаковок =  СтрокаЗагрузки.Количество;
		// СтрокаТабличнойЧасти.Количество = СтрокаЗагрузки.Количество * ?(СтрокаТабличнойЧасти.Упаковка.Пустая() = Ложь, СтрокаТабличнойЧасти.Упаковка.Коэффициент, 1);
		СтрокаТабличнойЧасти.КоличествоУпаковок =  СтрокаЗагрузки.КоличествоУпаковок;
		СтрокаТабличнойЧасти.Количество = СтрокаЗагрузки.Количество;
		СтрокаТабличнойЧасти.Цена = СтрокаЗагрузки.Цена;
		СтрокаТабличнойЧасти.Упаковка = СтрокаЗагрузки.Упаковка;
		
		СтрокаТабличнойЧасти.Сумма 		= СтрокаЗагрузки.Сумма;
		СтрокаТабличнойЧасти.Всего 		= СтрокаЗагрузки.Всего;
			
	КонецЦикла;
	
КонецПроцедуры // ПолучитьЗапасыИзХранилища()

&НаСервере
// Функция помещает список запасов во временное хранилище и возвращает адрес 
//
Функция ПоместитьЗапасыВХранилище(ИмяТабличнойЧасти, ЕстьПартии) 
	
	СписокКолонок = "Номенклатура, Количество, КоличествоУпаковок, Цена, Сумма, Всего, Упаковка";
	Если ЕстьПартии Тогда
		СписокКолонок = СписокКолонок + ", Партия";
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(Объект[ИмяТабличнойЧасти].Выгрузить(, СписокКолонок), УникальныйИдентификатор);
	
КонецФункции // ПоместитьЗапасыВХранилище()

&НаСервере
// Процедура - выводит вид цен и структурную единицу документа
//
Процедура ВывестиВидЦенИСтруктурнуюЕдиницу()
	
	// По виду цен
	СтруктураНадписи = Новый Структура("ВидЦен", Объект.ВидЦен);
	Элементы.ЦеныИВалютаНадпись.Заголовок = СтроковыеФункцииКлиентСерверСтоматология.СформироватьНадписьЦеныИВалюта(СтруктураНадписи);		
	
КонецПроцедуры  

&НаКлиенте
// Процедура - обработчик события ПослеУдаления строки списка Запасы.
//
Процедура РасчитатьПотраченнуюСумму()
	
	Объект.СуммаДокумента = Объект.Запасы.Итог("Сумма") + Объект.Расходы.Итог("Сумма") + Объект.Оплаты.Итог("Сумма");
	
КонецПроцедуры // ЗапасыПослеУдаления() 

&НаКлиенте
//
//
Функция ВернутьМассивВыбранныхДокументов()
	
	МассивДокументов = Новый Массив;
	Для Каждого СтрокаТЧ Из Объект.ВыданныеАвансы Цикл 
		Если ЗначениеЗаполнено(СтрокаТЧ.Документ) Тогда 
			МассивДокументов.Добавить(СтрокаТЧ.Документ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции  

&НаСервереБезКонтекста
//
//
Функция ВернутьВыданныеАвансы(Ссылка, Сотрудник, СтруктурнаяЕдиница, МассивУжеВыбранныхАвансов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВложенныйЗапрос.Документ КАК Документ,
	               |	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	               |	ВложенныйЗапрос.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	               |	ВложенныйЗапрос.Сумма КАК Сумма
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		РасчетыСПодотчетникамиОстаткиИОбороты.ДокументОснования КАК Документ,
	               |		РасчетыСПодотчетникамиОстаткиИОбороты.Сотрудник КАК Сотрудник,
	               |		РасчетыСПодотчетникамиОстаткиИОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	               |		СУММА(РасчетыСПодотчетникамиОстаткиИОбороты.СуммаОборот) КАК Сумма
	               |	ИЗ
	               |		РегистрНакопления.РасчетыСПодотчетниками.ОстаткиИОбороты(
	               |				,
	               |				,
	               |				Авто,
	               |				,
	               |				Сотрудник = &Сотрудник
	               |					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |					И ДокументОснования <> ЗНАЧЕНИЕ(Документ.СписаниеДенежныхСредств.ПустаяСсылка)
	               |					И НЕ ДокументОснования В (&МассивДокументов)) КАК РасчетыСПодотчетникамиОстаткиИОбороты
	               |	ГДЕ
	               |		РасчетыСПодотчетникамиОстаткиИОбороты.Регистратор <> &Регистратор
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		РасчетыСПодотчетникамиОстаткиИОбороты.ДокументОснования,
	               |		РасчетыСПодотчетникамиОстаткиИОбороты.Сотрудник,
	               |		РасчетыСПодотчетникамиОстаткиИОбороты.СтруктурнаяЕдиница) КАК ВложенныйЗапрос
	               |ГДЕ
	               |	ВложенныйЗапрос.Сумма > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВложенныйЗапрос.Документ.Дата";
				   
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("МассивДокументов", МассивУжеВыбранныхАвансов);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Возврат ОбщегоНазначенияКлиентСерверСтоматология.КонвертироватьТаблицуВМассивСтруктур(Запрос.Выполнить().Выгрузить());	
	
КонецФункции 

&НаКлиенте
// Процедура, обработчик события "СтруктурнаяЕдиницаНадписьНажатиеЗавершение"
//
Процедура СтруктурнаяЕдиницаНадписьНажатиеЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда 
	   Если Объект.СтруктурнаяЕдиница <> Результат Тогда
	     Объект.СтруктурнаяЕдиница = Результат;
	     Элементы.СтруктурнаяЕдиницаНадпись.Заголовок = Объект.СтруктурнаяЕдиница;
	     Объект.ВыданныеАвансы.Очистить();  
	     Объект.Сотрудник = Неопределено;
	   КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСпециализациюСотрудника(Сотрудник)
	
	Возврат Справочники.Сотрудники.ПолучитьОсновнуюСпециализациюСотрудника(Сотрудник);
	
КонецФункции

&НаКлиенте
// Процедура После вопроса завврешение.
//
Процедура ПослеВопросаЗавершение(Результат, Параметры) Экспорт	
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ПроверитьЗаполнение() = Истина Тогда		
			ЭтаФорма.Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));			
		КонецЕсли; 		
		// ПоказатьВыборИзМеню(Параметры.Оповещение, Параметры.СписокПечатныхФорм, Элементы.ФормаДокументаПечать);		
	Иначе
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()
	
	Возврат Документы.АвансовыйОтчет.ПолучитьСписокПечатныхФорм();
	
КонецФункции 

&НаСервереБезКонтекста  
// Функция, Получить данные даты при изменении.
//
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	РазностьДат = ДвиженияДокументовСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением);
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", РазностьДат);
			
	Возврат СтруктураДанные;
	
КонецФункции

#КонецОбласти

