
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 
	ТекущаяСтруктурнаяЕдиница = ?(Параметры.Свойство("ТекущаяСтруктурнаяЕдиница"), Параметры.ТекущаяСтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница); 
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяСтруктурнаяЕдиница", ТекущаяСтруктурнаяЕдиница);	
	
	Если Параметры.Свойство("ЭтоПользователь") Тогда 
		
		СписокПараметровОтбора         = Параметры.Ссылка; 
		ЭлементОтбора                  = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения     = Параметры.ВидСравненияКомпоновкиДанных;
		ЭлементОтбора.Использование    = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.ПравоеЗначение   = СписокПараметровОтбора;
		
	КонецЕсли;  
	
	Сотрудник = Неопределено;
	Параметры.Свойство("Сотрудник", Сотрудник);
	
	Если ЗначениеЗаполнено(Сотрудник) И ТипЗнч(Сотрудник) = Тип("СправочникСсылка.Сотрудники") Тогда		
		МассивСЕСотрудника = ВернутьСписокСтруктурныхЕдиницСотрудника(Сотрудник);			
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Ссылка", МассивСЕСотрудника
															, ЗначениеЗаполнено(МассивСЕСотрудника)
															, ВидСравненияКомпоновкиДанных.ВСписке);		
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
									
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция - возвращает массив структурных единиц, в которых работает сотрудник.
//
Функция ВернутьСписокСтруктурныхЕдиницСотрудника(Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиСотрудников.СтруктурнаяЕдиница
		|ИЗ
		|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
		|ГДЕ
		|	НастройкиСотрудников.Сотрудник = &Сотрудник";

	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	МассивСтруктурныхЕдиниц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СтруктурнаяЕдиница");

	Возврат МассивСтруктурныхЕдиниц;
	
КонецФункции

#КонецОбласти

