

#Область СлужебныеПроцедурыИФункции

// Процедура - Инициализировать представление списка
//
// Параметры:
//  СписокВыбораЗначений	 - 	 - 
//  МассивЗначений			 - 	 - 
//  ВыводитьНомерТелефона	 - 	 - 
//
Процедура ИнициализироватьПредставлениеСписка(СписокВыбораЗначений, МассивЗначений, ВыводитьНомерТелефона = Истина) Экспорт 
	
	МассивКонтрагентов 	= Новый Массив;
	МассивЗаявок 		= Новый Массив;
	МассивСделок 		= Новый Массив;
	МассивСтрок 		= Новый Массив;
	
	ОбновлениеСписка = НЕ СписокВыбораЗначений.Количество() = 0;
	
	Для Каждого ЭлементМассива Из МассивЗначений Цикл 
		Если ТипЗнч(ЭлементМассива) = Тип("СправочникСсылка.Контрагенты") Тогда 
			МассивКонтрагентов.Добавить(ЭлементМассива);
		ИначеЕсли ТипЗнч(ЭлементМассива) = Тип("СправочникСсылка.Заявки") Тогда 
			МассивЗаявок.Добавить(ЭлементМассива);
		ИначеЕсли ТипЗнч(ЭлементМассива) = Тип("СправочникСсылка.Сделки") Тогда 
			МассивСделок.Добавить(ЭлементМассива);
		ИначеЕсли ТипЗнч(ЭлементМассива) = Тип("Строка") Тогда 
			МассивСтрок.Добавить(ЭлементМассива); 	
	    КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивСтрок) Тогда 
		Для Каждого ЭлементМассива Из МассивСтрок Цикл
			МассивФорматированныхСтрок = Новый Массив;
			МассивФорматированныхСтрок.Добавить(Новый ФорматированнаяСтрока(ЭлементМассива + Символы.Таб + Символы.Таб, Новый Шрифт("Arial", 10), Новый Цвет(74, 74, 74)));
			МассивФорматированныхСтрок.Добавить(Новый ФорматированнаяСтрока("  -  история вводимых значений", Новый Шрифт("Arial", 10), Новый Цвет(193, 193, 193)));
			Представление = Новый ФорматированнаяСтрока(МассивФорматированныхСтрок); 			
			Если ОбновлениеСписка Тогда
				СписокВыбораЗначений.Вставить(0, ЭлементМассива, Представление);			
			Иначе 
				СписокВыбораЗначений.Добавить(ЭлементМассива, Представление);			
			КонецЕсли;	
		КонецЦикла;				
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;	
	Если ЗначениеЗаполнено(МассивКонтрагентов) Тогда
		ИнициализироватьТекстЗапроса(Запрос, Тип("СправочникСсылка.Контрагенты"));
		Если МассивКонтрагентов.Количество() = 1 Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "В(&МассивКонтрагентов)", "= &КонтрагентСсылка");
			Запрос.УстановитьПараметр("КонтрагентСсылка", МассивКонтрагентов[0]);			
		Иначе 	
			Запрос.УстановитьПараметр("МассивКонтрагентов", МассивКонтрагентов);
		КонецЕсли;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(МассивЗаявок) Тогда 
		ИнициализироватьТекстЗапроса(Запрос, Тип("СправочникСсылка.Заявки"));
		Если МассивЗаявок.Количество() = 1 Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "В(&МассивЗаявок)", "= &ЗаявкаСсылка");
			Запрос.УстановитьПараметр("ЗаявкаСсылка", МассивЗаявок[0]);			
		Иначе 			
			Запрос.УстановитьПараметр("МассивЗаявок", МассивЗаявок);
		КонецЕсли;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(МассивСделок) Тогда 
		ИнициализироватьТекстЗапроса(Запрос, Тип("СправочникСсылка.Сделки"));
		Если МассивСделок.Количество() = 1 Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "В(&МассивСделок)", "= &СделкаСсылка");
			Запрос.УстановитьПараметр("СделкаСсылка", МассивСделок[0]);			
		Иначе 					
			Запрос.УстановитьПараметр("МассивСделок", МассивСделок);
		КонецЕсли;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		ТаблицаОбъектов = Запрос.Выполнить().Выгрузить();
		Если ТаблицаОбъектов.Количество() = 0 И НЕ ОбновлениеСписка Тогда 
			СписокВыбораЗначений.ЗагрузитьЗначения(МассивЗначений);
		Иначе
			//СписокВыбораЗначений.Очистить();
			Для Каждого ЭлементМассива Из МассивЗначений Цикл 
				СтрокаТаблицы = ТаблицаОбъектов.Найти(ЭлементМассива, "СсылкаНаОбъект");
				Если НЕ СтрокаТаблицы = Неопределено Тогда  
					Если ТипЗнч(СтрокаТаблицы.СсылкаНаОбъект) = Тип("СправочникСсылка.Заявки") Тогда
						ЗаголовокНаименования = "Заявка № " + ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(СтрокаТаблицы.КодОбъекта, "");
						Представление = ЗаголовокНаименования + ": " + СокрЛП(СтрокаТаблицы.НаименованиеОбъекта) + ?(ВыводитьНомерТелефона, ?(ЗначениеЗаполнено(СтрокаТаблицы.Телефон), "  тел.:" + СтрокаТаблицы.Телефон,""), "");
						Если ОбновлениеСписка Тогда 
							СписокВыбораЗначений.Вставить(0, СтрокаТаблицы.СсылкаНаОбъект, ВернутьФорматированнуюСтрокуПоиска(Представление, "", СокрЛП(ЗаголовокНаименования + ": "), Новый Цвет(0, 112, 210)));								
						Иначе 	
							СписокВыбораЗначений.Добавить(СтрокаТаблицы.СсылкаНаОбъект, ВернутьФорматированнуюСтрокуПоиска(Представление, "", СокрЛП(ЗаголовокНаименования + ": "), Новый Цвет(0, 112, 210)));								
						КонецЕсли;	
					ИначеЕсли ТипЗнч(СтрокаТаблицы.СсылкаНаОбъект) = Тип("СправочникСсылка.Сделки") Тогда 
						Представление = СокрЛП(СтрокаТаблицы.НаименованиеОбъекта) + ": " + СокрЛП(СтрокаТаблицы.НаименованиеКонтрагента) + ?(ВыводитьНомерТелефона, ?(ЗначениеЗаполнено(СтрокаТаблицы.Телефон), "  тел.:" + СтрокаТаблицы.Телефон,""), "");
						Если ОбновлениеСписка Тогда
							СписокВыбораЗначений.Вставить(0, СтрокаТаблицы.СсылкаНаОбъект, ВернутьФорматированнуюСтрокуПоиска(Представление, "", СокрЛП(СтрокаТаблицы.НаименованиеОбъекта + ": "), Новый Цвет(139, 0, 0)));						
						Иначе 	
							СписокВыбораЗначений.Добавить(СтрокаТаблицы.СсылкаНаОбъект, ВернутьФорматированнуюСтрокуПоиска(Представление, "", СокрЛП(СтрокаТаблицы.НаименованиеОбъекта + ": "), Новый Цвет(139, 0, 0)));						
						КонецЕсли;	
					Иначе 	
						Представление = "" + СокрЛП(СтрокаТаблицы.НаименованиеОбъекта) + ?(ВыводитьНомерТелефона, ?(ЗначениеЗаполнено(СтрокаТаблицы.Телефон), "  тел.:" + СтрокаТаблицы.Телефон,""), "");
						Если ОбновлениеСписка Тогда
							СписокВыбораЗначений.Вставить(0, СтрокаТаблицы.СсылкаНаОбъект, ВернутьФорматированнуюСтрокуПоиска(Представление, ""));			
						Иначе 
							СписокВыбораЗначений.Добавить(СтрокаТаблицы.СсылкаНаОбъект, ВернутьФорматированнуюСтрокуПоиска(Представление, ""));			
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли НЕ ОбновлениеСписка Тогда 
		СписокВыбораЗначений.ЗагрузитьЗначения(МассивЗначений);		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Инициализировать текст запроса
//
// Параметры:
//  Запрос		 - 	 - 
//  ТипОбъекта	 - 	 - 
//
Процедура ИнициализироватьТекстЗапроса(Запрос, ТипОбъекта)
	
	Если ТипОбъекта = Тип("СправочникСсылка.Контрагенты") Тогда 
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Контрагенты.Ссылка КАК СсылкаНаОбъект,
		               |	Контрагенты.Наименование КАК НаименованиеОбъекта,
		               |	Контрагенты.Код КАК КодОбъекта,
		               |	Контрагенты.Ссылка КАК Контрагент,
		               |	Контрагенты.Наименование КАК НаименованиеКонтрагента,					   
		               |	Контрагенты.Фамилия КАК Фамилия,
		               |	Контрагенты.Имя КАК Имя,
		               |	Контрагенты.Отчество КАК Отчество,
		               |	Контрагенты.Телефон КАК Телефон
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка В(&МассивКонтрагентов)";
		
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Заявки") Тогда 
		
		Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
			Запрос.Текст = Запрос.Текст + "
		               |	
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Заявки.Ссылка,
		               |	Заявки.Наименование,
		               |	Заявки.Код,
		               |	Заявки.ОсновнойКлиент,
		               |	Заявки.ОсновнойКлиент.Наименование,					   
		               |	Заявки.ОсновнойКлиент.Фамилия,
		               |	Заявки.ОсновнойКлиент.Имя,
		               |	Заявки.ОсновнойКлиент.Отчество,
		               |	Заявки.ОсновнойКлиент.Телефон
		               |ИЗ
		               |	Справочник.Заявки КАК Заявки
		               |ГДЕ
		               |	Заявки.Ссылка В(&МассивЗаявок)";
		Иначе 	
			Запрос.Текст = Запрос.Текст + "
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Заявки.Ссылка КАК СсылкаНаОбъект,
		               |	Заявки.Наименование КАК НаименованиеОбъекта,
		               |	Заявки.Код КАК КодОбъекта,
		               |	Заявки.ОсновнойКлиент КАК Контрагент,
		               |	Заявки.ОсновнойКлиент.Наименование КАК НаименованиеКонтрагента,					   
		               |	Заявки.ОсновнойКлиент.Фамилия КАК Фамилия,
		               |	Заявки.ОсновнойКлиент.Имя КАК Имя,
		               |	Заявки.ОсновнойКлиент.Отчество КАК Отчество,
		               |	Заявки.ОсновнойКлиент.Телефон КАК Телефон
		               |ИЗ
		               |	Справочник.Заявки КАК Заявки
		               |ГДЕ
		               |	Заявки.Ссылка В(&МассивЗаявок)";
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Сделки") Тогда 
		
		Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
			Запрос.Текст = Запрос.Текст + "
		               |	
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Сделки.Ссылка,
		               |	Сделки.Наименование,
		               |	Сделки.Код,
		               |	Сделки.Контрагент,
		               |	Сделки.Контрагент.Наименование,					   
		               |	Сделки.Контрагент.Фамилия,
		               |	Сделки.Контрагент.Имя,
		               |	Сделки.Контрагент.Отчество,
		               |	Сделки.Контрагент.Телефон
		               |ИЗ
		               |	Справочник.Сделки КАК Сделки
		               |ГДЕ
		               |	Сделки.Ссылка В(&МассивСделок)";
		Иначе 	
			Запрос.Текст = Запрос.Текст + "
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Сделки.Ссылка КАК СсылкаНаОбъект,
		               |	Сделки.Наименование КАК НаименованиеОбъекта,
		               |	Сделки.Код КАК КодОбъекта,
		               |	Сделки.Контрагент КАК Контрагент,
		               |	Сделки.Контрагент.Наименование КАК НаименованиеКонтрагента,					   
		               |	Сделки.Контрагент.Фамилия КАК Фамилия,
		               |	Сделки.Контрагент.Имя КАК Имя,
		               |	Сделки.Контрагент.Отчество КАК Отчество,
		               |	Сделки.Контрагент.Телефон КАК Телефон
		               |ИЗ
		               |	Справочник.Сделки КАК Сделки
		               |ГДЕ
		               |	Сделки.Ссылка В(&МассивСделок)";
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

// Функция - Вернуть форматированную строку поиска
//
// Параметры:
//  СтрокаДляРазбора - 	 - 
//  СтрокаПоиска	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьФорматированнуюСтрокуПоиска(Знач СтрокаДляРазбора, Знач СтрокаПоиска, СтрокаЗаголовокНаименованияОбъектаCRM = Неопределено, ЦветЗаголовкаОбъектаCRM = Неопределено) Экспорт
	
	Если СтрокаЗаголовокНаименованияОбъектаCRM <> Неопределено Тогда 
		СтрокаДляРазбораБезСделки = СокрЛП(СтрЗаменить(СтрокаДляРазбора, СтрокаЗаголовокНаименованияОбъектаCRM, ""));
	Иначе 	
		СтрокаДляРазбораБезСделки = СтрокаДляРазбора;
	КонецЕсли;
	
	СтрокаВВерхнемРегистре = Врег(СтрокаДляРазбораБезСделки);
	СтрокаПоискаВВерхнемРегистре = Врег(СтрокаПоиска);
	
	ФормСтрока = Новый Массив;
	Для Стр = 1 По СтрЧислоВхождений(СтрокаВВерхнемРегистре, СтрокаПоискаВВерхнемРегистре) Цикл
		Индекс = Найти(СтрокаВВерхнемРегистре, СтрокаПоискаВВерхнемРегистре);
		Если НЕ Индекс = 1 Тогда 
			ФормСтрока.Добавить(Новый ФорматированнаяСтрока(Сред(СтрокаДляРазбораБезСделки,1,Индекс-1)));
		КонецЕсли;
		ФормСтрока.Добавить(Новый ФорматированнаяСтрока(Сред(СтрокаДляРазбораБезСделки, Индекс, СтрДлина(СтрокаПоиска)), Новый Шрифт(,,Истина),WebЦвета.ЗеленыйЛес));
		СтрокаДляРазбораБезСделки = Прав(СтрокаДляРазбораБезСделки, СтрДлина(СтрокаДляРазбораБезСделки) - (Индекс + (СтрДлина(СтрокаПоиска)-1)));
		СтрокаВВерхнемРегистре = Прав(СтрокаВВерхнемРегистре, СтрДлина(СтрокаВВерхнемРегистре) - (Индекс + (СтрДлина(СтрокаПоиска)-1)));
	КонецЦикла;
	
	ФормСтрока.Добавить(Новый ФорматированнаяСтрока(СтрокаДляРазбораБезСделки));
	Если СтрокаЗаголовокНаименованияОбъектаCRM <> Неопределено Тогда
		Если ЦветЗаголовкаОбъектаCRM = Неопределено Тогда 
			ЦветЗаголовкаОбъектаCRM = Новый Цвет;
		КонецЕсли;	
		ФормСтрока.Вставить(0, Новый ФорматированнаяСтрока(СтрокаЗаголовокНаименованияОбъектаCRM + " ", Новый Шрифт(, , Истина), ЦветЗаголовкаОбъектаCRM));
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(ФормСтрока);
	
	////------------------------------------------------------------------------------------------
	//СтрокаВВерхнемРегистре = Врег(СтрокаДляРазбора);
	//СтрокаПоискаВВерхнемРегистре = Врег(СтрокаПоиска);
	//
	//ФормСтрока = Новый Массив;
	//Для Стр = 1 По СтрЧислоВхождений(СтрокаВВерхнемРегистре, СтрокаПоискаВВерхнемРегистре) Цикл
	//	Индекс = Найти(СтрокаВВерхнемРегистре, СтрокаПоискаВВерхнемРегистре);
	//	Если НЕ Индекс = 1 Тогда 
	//		ФормСтрока.Добавить(Новый ФорматированнаяСтрока(Сред(СтрокаДляРазбора,1,Индекс-1)));
	//	КонецЕсли;
	//	ФормСтрока.Добавить(Новый ФорматированнаяСтрока(Сред(СтрокаДляРазбора, Индекс, СтрДлина(СтрокаПоиска)), Новый Шрифт(,,Истина),WebЦвета.ЗеленыйЛес));
	//	СтрокаДляРазбора = Прав(СтрокаДляРазбора, СтрДлина(СтрокаДляРазбора) - (Индекс + (СтрДлина(СтрокаПоиска)-1)));
	//	СтрокаВВерхнемРегистре = Прав(СтрокаВВерхнемРегистре, СтрДлина(СтрокаВВерхнемРегистре) - (Индекс + (СтрДлина(СтрокаПоиска)-1)));
	//КонецЦикла;
	//ФормСтрока.Добавить(Новый ФорматированнаяСтрока(СтрокаДляРазбора));
	//
	//Возврат Новый ФорматированнаяСтрока(ФормСтрока);

КонецФункции

#КонецОбласти