
#Область СлужебныеПроцедурыИФункции

&НаСервере
// Найти клиентов по заданным условиям.
//
Функция НайтиКлиентов(ОбновитьИндекс = Ложь)

	// обновить индекс ППД
	Если ОбновитьИндекс Тогда
		
		УстановитьПривилегированныйРежим(Истина); 		
		Попытка
			ПолнотекстовыйПоиск.ОбновитьИндекс();
			ИндексППДАктуален = Истина;
		Исключение
		КонецПопытки;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;

	ТаблицаОснований = РеквизитФормыВЗначение("Основания");

	// получить результаты поиска
	Если Лев(СтрокаПоиска,1) <> "*" Тогда
		СтрокаПоискаКлиентов = СтрокаПоиска + "*"
	Иначе   
		СтрокаПоискаКлиентов = СтрокаПоиска;
	КонецЕсли;
   
	ТекстОшибки = МенеджерПочтыСервер.НайтиКонтрагентов(СтрокаПоискаКлиентов, ТаблицаОснований);
	
	Если ТекстОшибки = Неопределено Тогда

		// вернуть таблицу оснований
		ЗначениеВРеквизитФормы(ТаблицаОснований, "Основания");
		
		Элементы.СписокКлиентов.Отображение = ОтображениеТаблицы.Список;
		
		// установить отбор по списку найденных партнеров
		МенеджерПочтыКлиентСервер.ИзменитьЭлементОтбораСписка(
			СписокКлиентов, "Ссылка", ТаблицаОснований.ВыгрузитьКолонку("Значение"), Истина,
			ВидСравненияКомпоновкиДанных.ВСписке);

	КонецЕсли;

	Возврат ТекстОшибки;

КонецФункции

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполним переданную таблицу получателей
	ЗаполнитьТаблицуПолучателей();
	
	// Настроить видимость элементов
	ЗначениеРежимаПолнотекстовогоПоиска = ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска();
	
	Если ЗначениеРежимаПолнотекстовогоПоиска = РежимПолнотекстовогоПоиска.Разрешить Тогда
		ИндексППДАктуален = ПолнотекстовыйПоиск.ИндексАктуален();
	Иначе
		Элементы.СтрокаПоиска.Видимость = Ложь;
		Элементы.Найти.Видимость        = Ложь;
	КонецЕсли;
	
	ТолькоКлиенты = Истина;	// при удалении этой строки нужно также снять соответствующий отбор
							// в настройках динамического списка "СписокКлиентов"
							
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)

	Если СтрокаПоиска <> "" Тогда
		
		Если ИндексППДАктуален Тогда
			
			ОбновитьИндексПоиска = Ложь;	
			
		Иначе
			
			// ТекстВопроса = НСтр("ru='Индекс полнотекстового поиска неактуален. Обновить индекс?'");
			//
			// ОбновитьИндексПоиска =  Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да;
			ОбновитьИндексПоиска = Истина;
			ПоказатьОповещениеПользователя(НСтр("ru='Обновлен индекс полнотекстового поиска.'"));
			
		КонецЕсли;
		
		ТекстОшибки = НайтиКлиентов(ОбновитьИндексПоиска);
		
		Если ТекстОшибки <> Неопределено Тогда
			
			ПоказатьОповещениеПользователя(ТекстОшибки);
			
		КонецЕсли;
		
	Иначе
		
		МенеджерПочтыКлиентСервер.ИзменитьЭлементОтбораСписка(СписокКлиентов, "Ссылка");
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолучателиПисьмаПередНачаломИзменения(Элемент, Отказ)
	
	ТекущийПолучатель = Элементы.ПолучателиПисьма.ТекущиеДанные;
	
	Если ТекущийПолучатель.Контакт = Неопределено И Найти(",Кому,Копии,Скрытые,", ","+ТекущийПолучатель.Адрес+",") Тогда
		
		Отказ = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиПисьмаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	УдаляемыйПолучатель = ПолучателиПисьма.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если УдаляемыйПолучатель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоЭлементПервогоУровня = Ложь;
	Для Каждого ЭлементДереваПервыйУровень Из ПолучателиПисьма.ПолучитьЭлементы() Цикл
		
		Если ЭлементДереваПервыйУровень.Адрес   = УдаляемыйПолучатель.Адрес
			И ЭлементДереваПервыйУровень.Контакт = УдаляемыйПолучатель.Контакт Тогда
			
			ЭтоЭлементПервогоУровня = Истина;
			Прервать;		   
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЭтоЭлементПервогоУровня Тогда
		ГруппаПолучателей = УдаляемыйПолучатель.ПолучитьРодителя();
		ГруппаПолучателей.ПолучитьЭлементы().Удалить(УдаляемыйПолучатель);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиПисьмаПередУдалением(Элемент, Отказ)
	
	ТекущийПолучатель = Элементы.ПолучателиПисьма.ТекущиеДанные;
	
	Если ТекущийПолучатель.Контакт = Неопределено И Найти(",Кому,Копии,Скрытые,", ","+ТекущийПолучатель.Адрес+",") Тогда
		
		Отказ = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьТолькоКлиентовПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокКлиентов, "ЭтоКлиент", Истина, ТолькоКлиенты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьТолькоУчаствующихВРассылкеПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокКлиентов, "УчаствуетВРассылке", Истина, ТолькоУчаствующиеВРассылке);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Передает владельцу в качестве результата работы формы массив структур содержащих 
// адреса выбранных получателей и закрывает форму. 
//
Процедура КомандаОКВыполнить()
	
	Результат = Новый Массив;
	
	ЭлементыДереваПервыйУровень = ПолучателиПисьма.ПолучитьЭлементы();
	
	Для Каждого ЭлементДереваПервыйУровень Из ЭлементыДереваПервыйУровень Цикл
		
		Группа = ЭлементДереваПервыйУровень.Адрес;
		
		ЭлементыДереваВторойУровень = ЭлементДереваПервыйУровень.ПолучитьЭлементы();
		
		Для Каждого ЭлементДереваВторойУровень Из ЭлементыДереваВторойУровень Цикл
			
			ТекАдрес         = ЭлементДереваВторойУровень.Адрес;
			ТекПредставление = ЭлементДереваВторойУровень.Представление;
			ТекКонтакт       = ЭлементДереваВторойУровень.Контакт;
			
			Результат.Добавить(Новый Структура("Адрес, Представление, Контакт, Группа", 
											   ТекАдрес, ТекПредставление, ТекКонтакт, Группа));			
			
		КонецЦикла;
		
	КонецЦикла;	
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
// Универсальный обработчик выбора из динамических списков различных типов справочников - контактов.
Процедура СписокСправочникаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ВыбраннаяСтрока) Тогда
		Возврат;
	КонецЕсли;	
	
	СтруктураТекущейГруппы = Новый Структура("Адрес, Контакт");
	
	Если Не Элементы.ПолучателиПисьма.ТекущиеДанные = Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураТекущейГруппы, Элементы.ПолучателиПисьма.ТекущиеДанные);
		
	КонецЕсли;
	
	СтруктураАдресаЭП = Новый Структура("Email, Ссылка, УчаствуетВРассылке, ЭтоКлиент");
	Если Не Элемент.ТекущиеДанные = Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураАдресаЭП,  Элемент.ТекущиеДанные);
		
	КонецЕсли;
	
	МассивАдресатов = Новый Массив();	
	Для Каждого СтокаСпискаКлиентов Из Элементы.СписокКлиентов.ВыделенныеСтроки Цикл
		
		СтруктураАдресаЭП = Новый Структура("Email, Ссылка, УчаствуетВРассылке, ЭтоКлиент");
		ЗаполнитьЗначенияСвойств(СтруктураАдресаЭП, Элементы.СписокКлиентов.ДанныеСтроки(СтокаСпискаКлиентов));
		МассивАдресатов.Добавить(СтруктураАдресаЭП);
		
	КонецЦикла;
	
	ДобавитьПолучателей(СтруктураТекущейГруппы, МассивАдресатов);
	
	ЭлементыВерхнегоУровня = ПолучателиПисьма.ПолучитьЭлементы();
	
	Для каждого ЭлементВерхнегоУровня Из ЭлементыВерхнегоУровня Цикл
		
		Элементы.ПолучателиПисьма.Развернуть(ЭлементВерхнегоУровня.ПолучитьИдентификатор());
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПолучателей(СтруктураТекущейГруппы, МассивАдресовЭП)
	
	РеквизитКонтакта = "Ссылка";
	РеквизитАдреса   = "Email";
	
	
	СтрокиАдресов = Новый ТаблицаЗначений;
	СтрокиАдресов.Колонки.Добавить("Ссылка");
	СтрокиАдресов.Колонки.Добавить("Email");
	
	Для Каждого АдресЭП Из МассивАдресовЭП Цикл
		
		НоваяСтрокаАдреса = СтрокиАдресов.Добавить();
		НоваяСтрокаАдреса.Ссылка = АдресЭП.Ссылка;
		
		СтруктураОтбора = Новый Структура("Тип, АдресЭП", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, АдресЭП.Email);
		
		МассивАдресовЭлПочты = АдресЭП.Ссылка.КонтактнаяИнформация.НайтиСтроки(СтруктураОтбора);
		
		НоваяСтрокаАдреса.Email  = ?(МассивАдресовЭлПочты.Количество() = 0, "", СокрЛП(МассивАдресовЭлПочты[0].Представление));
		
	КонецЦикла;	
	
	// найдем строку, куда надо добавить адреса
	
	ЭлементыДереваПервыйУровень = ПолучателиПисьма.ПолучитьЭлементы();
	
	СтрокаГруппыАдресов = ЭлементыДереваПервыйУровень[0].ПолучитьЭлементы();
	
	Для Каждого ЭлементДереваПервыйУровень Из ЭлементыДереваПервыйУровень Цикл
		
		Если ЭлементДереваПервыйУровень.Адрес   = СтруктураТекущейГруппы.Адрес
			И ЭлементДереваПервыйУровень.Контакт = СтруктураТекущейГруппы.Контакт Тогда
			
			СтрокаГруппыАдресов = ЭлементДереваПервыйУровень.ПолучитьЭлементы();
			
			Прервать;		   
			
		КонецЕсли;
		
		ЭлементыДереваВторойУровень = ЭлементДереваПервыйУровень.ПолучитьЭлементы();
		
		СтрокаГруппыНайдена = Ложь;
		
		Для Каждого ЭлементДереваВторойУровень Из ЭлементыДереваВторойУровень Цикл
			
			Если ЭлементДереваВторойУровень.Адрес   = СтруктураТекущейГруппы.Адрес
				И ЭлементДереваВторойУровень.Контакт = СтруктураТекущейГруппы.Контакт Тогда
				
				СтрокаГруппыАдресов = ЭлементыДереваВторойУровень;
				
				СтрокаГруппыНайдена = Истина;
				
				Прервать;		   
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтрокаГруппыНайдена Тогда
			
			Прервать;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	ДеревоПолучатели = РеквизитФормыВЗначение("ПолучателиПисьма");
	
	Для Каждого СтрокаАдресов Из СтрокиАдресов Цикл
		
		Если ПустаяСтрока(СтрокаАдресов.Email) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		СтруктураНовогоАдреса = Новый Структура("Адрес, Контакт");
		
		СтруктураНовогоАдреса.Адрес   = СтрокаАдресов.Email;
		СтруктураНовогоАдреса.Контакт = СтрокаАдресов.Ссылка;
		
		СтрокиСуществующихАдресов = ДеревоПолучатели.Строки.НайтиСтроки(СтруктураНовогоАдреса, Истина);
		
		Если СтрокиСуществующихАдресов.Количество() = 0 Тогда
			
			НовыйАдрес = СтрокаГруппыАдресов.Добавить();
			
			НовыйАдрес.Адрес         = СтруктураНовогоАдреса.Адрес;
			НовыйАдрес.Представление = СтруктураНовогоАдреса.Контакт.Наименование;
			НовыйАдрес.Контакт       = СтруктураНовогоАдреса.Контакт;
			
			НомерПоследнейСтроки = НомерПоследнейСтроки + 1;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Элементы.ПолучателиПисьма.Обновить();
	
КонецПроцедуры// ДобавитьПолучателей(Элемент)	
	
&НаКлиенте
Процедура ПолучателиОчистить(Команда)
	
	ЭлементыДереваПервыйУровень = ПолучателиПисьма.ПолучитьЭлементы();
	
	Для Каждого ЭлементДереваПервыйУровень Из ЭлементыДереваПервыйУровень Цикл
		
		ЭлементыДереваВторойУровень = ЭлементДереваПервыйУровень.ПолучитьЭлементы();
		
		ЭлементыДереваВторойУровень.Очистить();
		
	КонецЦикла;
	
	Элементы.ПолучателиПисьма.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВГруппу(ИмяГруппы)
	
	// определим текущую группу
	ТекущийПолучатель = Элементы.ПолучателиПисьма.ТекущиеДанные;
	
	Если ТекущийПолучатель.Контакт = Неопределено И Найти(",Кому,Копии,Скрытые,", ","+ТекущийПолучатель.Адрес+",") Тогда
		Возврат;
	КонецЕсли;
	
	Переносить = Истина;
	ЭлементНайден = Ложь;
	
	СтруктураПереносимогоЭлемента = Новый Структура("Адрес, Представление, Контакт");
	ЗаполнитьЗначенияСвойств(СтруктураПереносимогоЭлемента, ТекущийПолучатель);
	
	ЭлементыДереваПервыйУровень = ПолучателиПисьма.ПолучитьЭлементы();
	
	Для Каждого ЭлементДереваПервыйУровень Из ЭлементыДереваПервыйУровень Цикл
		
		ЭлементыДереваВторойУровень = ЭлементДереваПервыйУровень.ПолучитьЭлементы();
		
		Если Не ЭлементНайден Тогда
			
			ИндексТекущегоЭлемента = 0;
			КоличествоЭлементовУровня = ЭлементыДереваВторойУровень.Количество();
			
			Пока ИндексТекущегоЭлемента < КоличествоЭлементовУровня Цикл
				
				ЭлементДереваВторойУровень = ЭлементыДереваВторойУровень[ИндексТекущегоЭлемента];
				
				Если ЭлементДереваВторойУровень.Адрес   = СтруктураПереносимогоЭлемента.Адрес 
				   И ЭлементДереваВторойУровень.Контакт = СтруктураПереносимогоЭлемента.Контакт Тогда
				   
				    // проверим, в какой папке находится получатель
					
					Если ЭлементДереваПервыйУровень.Адрес = ИмяГруппы Тогда
						
						Переносить = Ложь;
						
					Иначе
						
						ЭлементНайден = Истина;
						
						ЭлементыДереваВторойУровень.Удалить(ИндексТекущегоЭлемента);						
						
					КонецЕсли;
					
					Прервать;
					
				КонецЕсли;
				
				ИндексТекущегоЭлемента = ИндексТекущегоЭлемента + 1;
				
			КонецЦикла;
			
		КонецЕсли;	
		
		Если Не Переносить Тогда
			
			Прервать;
			
		ИначеЕсли ЭлементДереваПервыйУровень.Адрес = ИмяГруппы Тогда
			
			// добавим элемент в новую группу
			НовыйЭлемент = ЭлементыДереваВторойУровень.Добавить();
			НомерПоследнейСтроки = НомерПоследнейСтроки + 1;
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, СтруктураПереносимогоЭлемента);
			
		КонецЕсли;
		
		Элементы.ПолучателиПисьма.Развернуть(ЭлементДереваПервыйУровень.ПолучитьИдентификатор());
			
	КонецЦикла;
	
	Если Переносить Тогда
		Элементы.ПолучателиПисьма.Обновить();
		Элементы.ПолучателиПисьма.ТекущаяСтрока = НомерПоследнейСтроки;
	КонецЕсли;	
	
КонецПроцедуры// ПереместитьВГруппу(ИмяГруппы)	

&НаКлиенте
Процедура ПереместитьВГруппуКому(Команда)
	
	ПереместитьВГруппу("Кому");
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВГруппуКопии(Команда)
	
	ПереместитьВГруппу("Копии");	
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВГруппуСкрытые(Команда)
	
	ПереместитьВГруппу("Скрытые");
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВыделенныхВГруппу(Команда)
	
	СтруктураТекущейГруппы = Новый Структура("Адрес, Контакт");
	
	Если Не Элементы.ПолучателиПисьма.ТекущиеДанные = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(СтруктураТекущейГруппы, Элементы.ПолучателиПисьма.ТекущиеДанные);
	КонецЕсли;
	
	СтруктураАдресаЭП = Новый Структура("Email, Ссылка, УчаствуетВРассылке, ЭтоКлиент");
	
	МассивАдресатов = Новый Массив();	
	Для Каждого СтокаСпискаКлиентов Из Элементы.СписокКлиентов.ВыделенныеСтроки Цикл
		
		СтруктураАдресаЭП = Новый Структура("Email, Ссылка, УчаствуетВРассылке, ЭтоКлиент");
		ЗаполнитьЗначенияСвойств(СтруктураАдресаЭП, Элементы.СписокКлиентов.ДанныеСтроки(СтокаСпискаКлиентов));
		МассивАдресатов.Добавить(СтруктураАдресаЭП);
		
	КонецЦикла;
	
	ДобавитьПолучателей(СтруктураТекущейГруппы, МассивАдресатов);
	
	ЭлементыВерхнегоУровня = ПолучателиПисьма.ПолучитьЭлементы();
	Для Каждого ЭлементВерхнегоУровня Из ЭлементыВерхнегоУровня Цикл
		Элементы.ПолучателиПисьма.Развернуть(ЭлементВерхнегоУровня.ПолучитьИдентификатор());
	КонецЦикла;
	
	// СтруктураТекущейГруппы = Новый Структура("Адрес, Контакт");
	//
	// Если Не Элементы.ПолучателиПисьма.ТекущиеДанные = Неопределено Тогда
	//	ЗаполнитьЗначенияСвойств(СтруктураТекущейГруппы, Элементы.ПолучателиПисьма.ТекущиеДанные);
	// КонецЕсли;
	//
	// ДобавитьПолучателей(СтруктураТекущейГруппы);
	//
	// ЭлементыВерхнегоУровня = ПолучателиПисьма.ПолучитьЭлементы();
	// Для Каждого ЭлементВерхнегоУровня Из ЭлементыВерхнегоУровня Цикл
	//	Элементы.ПолучателиПисьма.Развернуть(ЭлементВерхнегоУровня.ПолучитьИдентификатор());
	// КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВыделенныхИзГруппы(Команда)
	
	УдаляемыеПолучатели = Элементы.ПолучателиПисьма.ВыделенныеСтроки;
	
	Для Каждого ИндексУдаляемогоПолучателя Из УдаляемыеПолучатели Цикл
		
		УдаляемыйПолучатель = ПолучателиПисьма.НайтиПоИдентификатору(ИндексУдаляемогоПолучателя);
		
		Если УдаляемыйПолучатель = Неопределено Тогда // получатель уже был удалён при удалении группы получателей
			Продолжить;
		КонецЕсли;
		
		ЭтоЭлементПервогоУровня = Ложь;
		Для Каждого ЭлементДереваПервыйУровень Из ПолучателиПисьма.ПолучитьЭлементы() Цикл
		
			Если ЭлементДереваПервыйУровень.Адрес   = УдаляемыйПолучатель.Адрес
			   И ЭлементДереваПервыйУровень.Контакт = УдаляемыйПолучатель.Контакт Тогда
			   
				ЭтоЭлементПервогоУровня = Истина;
				Прервать;		   
			
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЭтоЭлементПервогоУровня Тогда
			УдаляемыйПолучатель.ПолучитьЭлементы().Очистить();
		Иначе
			ГруппаПолучателей = УдаляемыйПолучатель.ПолучитьРодителя();
			ГруппаПолучателей.ПолучитьЭлементы().Удалить(УдаляемыйПолучатель);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти



&НаСервере
Процедура ЗаполнитьТаблицуПолучателей()
	
	ДеревоПолучатели = РеквизитФормыВЗначение("ПолучателиПисьма");
	
	// заполним первый уровен дерева (папки)
	
	СтрокаКому = ДеревоПолучатели.Строки.Добавить();
	СтрокаКому.Адрес = "Кому";
	
	СтрокаКопии = ДеревоПолучатели.Строки.Добавить();
	СтрокаКопии.Адрес = "Копии";
	
	СтрокаСкрытые = ДеревоПолучатели.Строки.Добавить();
	СтрокаСкрытые.Адрес = "Скрытые";
	
	НомерПоследнейСтроки = 2;
	
	КоличествоКому = 0;
	
	КоличествоКопии = 0;
	
	Для Каждого ГруппаВыбранных Из Параметры.СписокВыбранных Цикл
		
		Если ГруппаВыбранных.Значение <> Неопределено Тогда
			
			ТекущаяСтрокаДерева = ДеревоПолучатели.Строки.Найти(ГруппаВыбранных.Представление, "Адрес");
			
			Если Не ТекущаяСтрокаДерева = Неопределено Тогда
				
				Если ГруппаВыбранных.Представление = "Кому" Тогда
					
					КоличествоКому = ГруппаВыбранных.Значение.Количество();
					
				ИначеЕсли ГруппаВыбранных.Представление = "Копии" Тогда
					
					КоличествоКопии = ГруппаВыбранных.Значение.Количество();
					
				КонецЕсли;
				
				Для Каждого Элемент Из ГруппаВыбранных.Значение Цикл
					
					НоваяСтрокаДерева = ТекущаяСтрокаДерева.Строки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаДерева, Элемент);
					
					НомерПоследнейСтроки = НомерПоследнейСтроки + 1;
					
				КонецЦикла;
				
			КонецЕсли;		
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоПолучатели, "ПолучателиПисьма");
	
	Если Параметры.Свойство("ГруппаАдресов") Тогда
		Если Параметры.ГруппаАдресов = "Копии" Тогда
			
			Элементы.ПолучателиПисьма.ТекущаяСтрока = КоличествоКому + 1;
			
		ИначеЕсли Параметры.ГруппаАдресов = "Скрытые" Тогда
			
			Элементы.ПолучателиПисьма.ТекущаяСтрока = КоличествоКому + 1 + КоличествоКопии + 1;
			
		Иначе
			
			Элементы.ПолучателиПисьма.ТекущаяСтрока = 0;		
			
		КонецЕсли;
	Иначе
		Элементы.ПолучателиПисьма.ТекущаяСтрока = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти