
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	  ОтрисоватьФильтрПоКодам();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "СписокВыбор".
//
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("РегистрСведений.ЖурналЗапросов.ФормаЗаписи", Новый Структура("Ключ", ВыбраннаяСтрока),,,,,,РежимОткрытияОкнаФормы.Независимый);
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Фильтр списка
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ФильтрСписка(Команда)
			
	ФильтрСпискаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЖурнал(Команда)
	ОчиститьЖурналНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура - Фильтр списка на сервере
//
Процедура ФильтрСпискаНаСервере() 	
	
	ТекущийЭлемент.Пометка = Не ТекущийЭлемент.Пометка;				
	
	СписокЗначенийДляОтбора = Новый СписокЗначений();
	
	РодительскаяГруппа = ТекущийЭлемент.Родитель.Родитель;	
	
	ПолеОтбора = ?(СтрНайти(РодительскаяГруппа.Имя, "КодСостояния"), "КодСостояния", "Тип");	
	
	КнопкаВсе = ?(ПолеОтбора = "Тип", Элементы.Все, Элементы.КнопкаВсе);     	
	
	Для Каждого ЭлементОтбораГруппа Из РодительскаяГруппа.ПодчиненныеЭлементы Цикл  		
		Для Каждого ЭлементОтбора Из ЭлементОтбораГруппа.ПодчиненныеЭлементы Цикл
			
			Если ТекущийЭлемент = КнопкаВсе Тогда 
				ЭлементОтбора.Пометка = ЭлементОтбора = КнопкаВсе;
			Иначе
				КнопкаВсе.Пометка = Ложь;
				Если ЭлементОтбора.Пометка Тогда 
					Если ПолеОтбора = "Тип" Тогда 
						СписокЗначенийДляОтбора.Добавить(Перечисления.HTTPСервисы[ЭлементОтбора.Имя]);
					ИначеЕсли ПолеОтбора = "КодСостояния" Тогда 
						СписокЗначенийДляОтбора.Добавить(Число(СтрРазделить(ЭлементОтбора.Имя, "_", Ложь)[1]));
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;				
			
			Если ЭлементОтбора.Пометка Тогда 
				ЭлементОтбора.Родитель.ЦветФона = Новый Цвет(218, 230, 244);
			Иначе 		
				ЭлементОтбора.Родитель.ЦветФона = Новый Цвет(255, 255, 255);
			КонецЕсли;
			
		КонецЦикла;  		
	КонецЦикла;	
	
	Если ТекущийЭлемент = КнопкаВсе Тогда 
		ИзменитьЭлементОтбораСписка(Список, ПолеОтбора, СписокЗначенийДляОтбора, Истина, ВидСравненияКомпоновкиДанных.НеВСписке);
	Иначе
		ИзменитьЭлементОтбораСписка(Список, ПолеОтбора, СписокЗначенийДляОтбора, Истина, ВидСравненияКомпоновкиДанных.ВСписке);					
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
// Изменяет элемент отбора динамического списка
// 
// Параметры:
// Список         - обрабатываемый динамический список,
// ИмяПоля        - имя поля компоновки, отбор по которому нужно установить,
// ВидСравнения   - вид сравнения отбора, по умолчанию - Равно,
// ПравоеЗначение - значение отбора,
// Установить     - признак необходимости установить отбор
// 
Процедура ИзменитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение = Неопределено, Установить = Ложь, ВидСравнения = Неопределено, Представление = Неопределено) 
	
	Если Установить Тогда
		УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения, Представление, Истина);
	Иначе
		УдалитьЭлементОтбораСписка(Список, ИмяПоля, Представление);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Устанавливает элемент отбор динамического списка
// 
// Параметры:
// Список			- обрабатываемый динамический список,
// ИмяПоля			- имя поля компоновки, отбор по которому нужно установить,
// ВидСравнения		- вид сравнения отбора, по умолчанию - Равно,
// ПравоеЗначение 	- значение отбора
// 
Процедура УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения = Неопределено, Представление = Неопределено, Использование = Истина) 
	
	КоллекцияЭлементов = Неопределено;
	Если ТипЗнч(Список) = Тип("ДинамическийСписок") Тогда
		КоллекцияЭлементов = Список.Отбор.Элементы;
	ИначеЕсли ТипЗнч(Список) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
		КоллекцияЭлементов = Список.Элементы;
    КонецЕсли; 
	
	УстановитьЭлементОтбораКоллекции(КоллекцияЭлементов, ИмяПоля, ПравоеЗначение, ВидСравнения, Представление, Использование = Истина);
	
КонецПроцедуры

&НаСервере
// Удаляет элемент отбора динамического списка
// 
// Параметры:
// Список  - обрабатываемый динамический список,
// ИмяПоля - имя поля компоновки, отбор по которому нужно удалить
// 
Процедура УдалитьЭлементОтбораСписка(Список, ИмяПоля, Представление = Неопределено)
	
	КоллекцияЭлементов = Неопределено;
	Если ТипЗнч(Список) = Тип("ДинамическийСписок") Тогда
		КоллекцияЭлементов = Список.Отбор.Элементы;
	ИначеЕсли ТипЗнч(Список) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
		КоллекцияЭлементов = Список.Элементы;
    КонецЕсли; 
	
	УдалитьЭлементОтбораКоллекции(КоллекцияЭлементов, ИмяПоля, Представление);
	
КонецПроцедуры 

&НаСервере
// Процедура выполняет удаление элемента отбора коллекции
// 
Процедура УдалитьЭлементОтбораКоллекции(КоллекцияЭлементов, ИмяПоля, Представление = Неопределено)
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для Каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			
			Если Представление = Неопределено 
				ИЛИ ЭлементОтбора.Представление = Представление Тогда  
							
				КоллекцияЭлементов.Удалить(ЭлементОтбора);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
// Процедура выполняет установку элемента отбора коллекции
// 
Процедура УстановитьЭлементОтбораКоллекции(КоллекцияЭлементов, ИмяПоля, ПравоеЗначение, ВидСравнения = Неопределено, Представление = Неопределено, Использование = Истина)
	
	ЭлементОтбора  = Неопределено;
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для Каждого ЭлементОтбораПоиск Из КоллекцияЭлементов Цикл
		Если ТипЗнч(ЭлементОтбораПоиск) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбораПоиск.ЛевоеЗначение = ПолеКомпоновки Тогда
			
			Если Представление = Неопределено 
				ИЛИ ЭлементОтбораПоиск.Представление = Представление Тогда  
				
				ЭлементОтбора = ЭлементОтбораПоиск;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = КоллекцияЭлементов.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КонецЕсли;
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	
	Если ЗначениеЗаполнено(Представление) Тогда
		ЭлементОтбора.Представление = Представление;
	КонецЕсли;
	
	ЭлементОтбора.ВидСравнения     = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
	ЭлементОтбора.Использование    = Использование;
	ЭлементОтбора.ПравоеЗначение   = ПравоеЗначение;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

КонецПроцедуры

&НаСервере
// Функция - Получить коды состояния
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКодыСостояния()
	
	Запрос = новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЖурналЗапросов.КодСостояния КАК КодСостояния
	|ИЗ
	|	РегистрСведений.ЖурналЗапросов КАК ЖурналЗапросов
	|ГДЕ
	|	НЕ ЖурналЗапросов.КодСостояния = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналЗапросов.КодСостояния
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодСостояния");
	
	Возврат	Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КодСостояния");    	
	
КонецФункции

&НаСервере
Процедура ОчиститьЖурналНаСервере()
	
	// Вставить содержимое обработчика.
	Рег = РегистрыСведений.ЖурналЗапросов.СоздатьНаборЗаписей();
	Рег.Записать();

КонецПроцедуры

&НаСервере
// Процедура - Отрисовать фильтр по кодам
//
Процедура ОтрисоватьФильтрПоКодам()
	
	Коды = ПолучитьКодыСостояния();
	
	Для Каждого Код Из Коды Цикл
		
		Группа                     = Элементы.Добавить("Группа_" + Код, Тип("ГруппаФормы"), Элементы.ГруппаФильтрыКодСостояния);
		Группа.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Заголовок 	       = Группа.Имя;
		Группа.Отображение 		   = ОтображениеОбычнойГруппы.Нет;
		Группа.Группировка 	       = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		Группа.ОтображатьЗаголовок = Ложь;
		Группа.ЦветФона            = Новый Цвет(255, 255, 255);
				
		НоваяКоманда          = ЭтаФорма.Команды.Добавить("Команда_" + Код); 
		НоваяКоманда.Действие = "ФильтрСписка";
		
		Кнопка                   = Элементы.Добавить("Кнопка_" + Код, Тип("КнопкаФормы"), Группа);		
		Кнопка.ИмяКоманды 		 = НоваяКоманда.Имя;
		Кнопка.Заголовок 	     = Строка(Код);
		Кнопка.ЦветТекста        = Новый Цвет(51, 102, 187);
		Кнопка.Шрифт             = Новый Шрифт("Arial", 11);
		Кнопка.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет; 
		
		Если Кнопка.Имя = "Кнопка_400" ИЛИ Кнопка.Имя = "Кнопка_500" Тогда
			Кнопка.ЦветТекста = Новый Цвет(255, 0, 0);
		КонецЕсли;		
		
	КонецЦикла;	
	
КонецПроцедуры 


#КонецОбласти
