
#Область ОбработчикиСобытий

// Обработчик первоначального заполнения объекта
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если Не ЭтоГруппа Тогда
		УсловиеПредоставленияСкидки = Перечисления.УсловияПредоставленияСкидки.Всегда;
		ОбъектСкидки           = Перечисления.ОбъектСкидок.НаДокумент;
		ВидСравненияУсловия    = Истина;
		ЗначениеУсловия        = 0;
		// Заполнение по структуре данных
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
			
			Если ДанныеЗаполнения.Свойство("Получатели") Тогда
				Для каждого Получатель из ДанныеЗаполнения.Получатели Цикл
					СтрокаТЧ = ЭтотОбъект.Получатели.Добавить();
					СтрокаТЧ.Получатель = Получатель;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик проверки заполнения
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;

	// Проверка Реквизитов
	Если СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент ИЛИ СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Сумма Тогда
		ПроверяемыеРеквизиты.Добавить("ЗначениеСкидкиНаценки");
	КонецЕсли;	
	Если ОбъектСкидки = Перечисления.ОбъектСкидок.ПоПродажам Тогда
		ПроверяемыеРеквизиты.Добавить("ПериодНакопления");
	КонецЕсли;	
	
	Если НачислениеБонусами = Истина Тогда
		ПроверяемыеРеквизиты.Добавить("ВидБонусногоСчета");
		ПроверяемыеРеквизиты.Добавить("ЗначениеСкидкиНаценкиОбъектом");
	КонецЕсли;
	
	Если УсловиеПредоставленияСкидки = Перечисления.УсловияПредоставленияСкидки.НомерПокупки Тогда
		ПроверяемыеРеквизиты.Добавить("ЗначениеУсловия");	
	КонецЕсли; 	
	
	// Проверка ТЧ
	Если Не ЭтоГруппа И СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Подарок Тогда
		ПроверяемыеРеквизиты.Добавить("НаборПодарков");
	ИначеЕсли Не ЭтоГруппа И СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Подарок И СкидкаНаЕдиныйКомплект Тогда
		ПроверяемыеРеквизиты.Добавить("НаборПокупкиДляПолученияПодарков");
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если Родитель.Пустая()
		И (Ссылка <> Справочники.СкидкиНаценки.Бонусы
		И Ссылка <> Справочники.СкидкиНаценки.Скидки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Создание элементов и групп в корне справочника запрещено!'; en = 'Creating elements and groups in the root of the directory is prohibited!'"));
		Отказ = Истина;
	КонецЕсли;     
	
	Если Не Отказ 
		И (Ссылка.Пустая() ИЛИ Родитель <> Ссылка.Родитель) Тогда
		УстановитьПорядок();
	КонецЕсли;
	
	Если СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент 
		И ЗначениеСкидкиНаценки > 100 Тогда
		
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Значение скидки превышает 100%.'; en = 'The discount value exceeds 100%.'"), ЭтотОбъект, "ЗначениеСкидкиНаценки");
	КонецЕсли;

	Если ЭтоГруппа = Ложь Тогда
		
		Если СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.ВидЦен
				ИЛИ СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.ВыдачаКарты Тогда
			ПризнакИспользованиеНаУсмотрение = Ложь;
			ПризнакИспользованиеПоУмолчанию = Ложь;
		КонецЕсли;
		
		// Устанавливаем признак бонуса/скидки
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("РодительЭлемента", Родитель);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИСТИНА КАК ПризнакВхождения
		|ГДЕ
		|	&РодительЭлемента В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.СкидкиНаценки.Бонусы))";
		
		РезультатПризнаВхожденияВБонус = Запрос.Выполнить().Выбрать();
		НачислениеБонусами = (РезультатПризнаВхожденияВБонус.Следующий());
						
	КонецЕсли;	 
	
	// Если скидка предоставляется всегда
	Если УсловиеПредоставленияСкидки = Перечисления.УсловияПредоставленияСкидки.Всегда Тогда
		 ОбъектСкидки           = Перечисления.ОбъектСкидок.НаДокумент;
		 ВидСравненияУсловия    = Истина;
		 ЗначениеУсловия        = 0;
	КонецЕсли;	 	
		
КонецПроцедуры

// Обработчик после записи объекта
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Прописываем параметеры действия скидки в регистр
	Если ДополнительныеСвойства.Свойство("ДействиеСкидокНаценок") Тогда
		
		НаборЗаписей                                  = РегистрыСведений.ДействиеСкидокНаценок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СкидкаНаценка.Значение     = Ссылка;
		НаборЗаписей.Отбор.СкидкаНаценка.Использование = Истина;	
		Для Каждого СтрокаТЗ ИЗ ДополнительныеСвойства.ДействиеСкидокНаценок Цикл
			НоваяЗапись               = НаборЗаписей.Добавить();
			НоваяЗапись.Актуальность  = НЕ ПометкаУдаления;
			НоваяЗапись.Период        = СтрокаТЗ.ДатаНачала;
			НоваяЗапись.СкидкаНаценка = Ссылка;
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТЗ);	
		КонецЦикла;
		НаборЗаписей.Записать(Истина);    		
	Иначе         		
		// Перезаписываем с выставлением активности действия скидок в регистре
		НаборЗаписей = РегистрыСведений.ДействиеСкидокНаценок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СкидкаНаценка.Значение      = Ссылка;
		НаборЗаписей.Отбор.СкидкаНаценка.Использование = Истина;
		НаборЗаписей.Прочитать();
		Для каждого СтрокаНабораЗаписей Из НаборЗаписей Цикл
			СтрокаНабораЗаписей.Актуальность = НЕ ПометкаУдаления;
		КонецЦикла; 
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Устанавливает порядок применения для нового элемента.
//
Процедура УстановитьПорядок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(СкидкиНаценки.ПорядокПрименения) КАК ПорядокПрименения
	|ИЗ
	|	Справочник.СкидкиНаценки КАК СкидкиНаценки
	|ГДЕ
	|	СкидкиНаценки.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Родитель);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПорядокПрименения = ?(Выборка.Следующий() И Выборка.ПорядокПрименения <> Null, Выборка.ПорядокПрименения + 1, 1);
	
КонецПроцедуры

#КонецОбласти
 
