
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик создания формы на сервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;

	Элементы.ГруппаОграниченияСписанияСоСчета.Видимость = константы.ИспользоватьВидыЛицевыхСчетов.Получить();	
	Элементы.ПроцентОграниченияОплачиваемогоДокумента.ТолькоПросмотр = НЕ Объект.ОграничиватьСуммуСписанияСоСчета;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОграничиватьСуммуОплачиваемогоДокументаПриИзменении(Элемент)
	
	Элементы.ПроцентОграниченияОплачиваемогоДокумента.ТолькоПросмотр = НЕ Объект.ОграничиватьСуммуСписанияСоСчета;
	Если НЕ Объект.ОграничиватьСуммуСписанияСоСчета Тогда
		Объект.ПроцентОграниченияСуммыСписанияСоСчета = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти