
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЭлементовКОРП();
	ОтображниеКода                  = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Элементы.Код.Видимость          = ОтображниеКода;
	Элементы.Код.ПоложениеЗаголовка = ?(ОтображниеКода, ПоложениеЗаголовкаЭлементаФормы.Авто, ПоложениеЗаголовкаЭлементаФормы.Нет);
	
КонецПроцедуры

&НаСервере
// Процедура - Установить видимость элементов КОРП.
//
Процедура УстановитьВидимостьЭлементовКОРП()
	
	// Ограничение видимости элементов для версии ПРОФ.
	Если Не ОбщегоНазначенияПовтИсп.ЭтоВерсияКОРП() Тогда
		
		МассивИсключаемых = Новый Массив;
		МассивИсключаемых.Добавить(Справочники.КаналыПривлечения.ЛидФорма);
		МассивИсключаемых.Добавить(Справочники.КаналыПривлечения.ЛовецЛидов);
		МассивИсключаемых.Добавить(Справочники.КаналыПривлечения.ПрезентацияВстреча);
		МассивИсключаемых.Добавить(Справочники.КаналыПривлечения.ЧатСКлиентом);
		
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Ссылка", МассивИсключаемых, Истина, ВидСравненияКомпоновкиДанных.НеВСписке);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
