
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ВидЦен = Справочники.ВидыЦен.Закупочная;
	Если ДанныеЗаполнения <> Неопределено Тогда 
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Документы.Поступление.ЗаполнитьДокПоступлениеИзОснования(ЭтотОбъект,ДанныеЗаполнения);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СписаниеДенежныхСредств") Тогда
			Контрагент = ДанныеЗаполнения.Контрагент;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			Если ДанныеЗаполнения.Свойство("Документ") Тогда
				ЭтотОбъект.Дата 				= ТекущаяДата();
				ЭтотОбъект.Склад      			= ДанныеЗаполнения.Документ.Склад;		
				ЭтотОбъект.СтруктурнаяЕдиница 	= ДанныеЗаполнения.Документ.СтруктурнаяЕдиница;
				ЭтотОбъект.ВидЦен       		= ДанныеЗаполнения.Документ.ВидЦен;
				ЭтотОбъект.Контрагент   		= ДанныеЗаполнения.Лаборатория;
				Этотобъект.ДокументОснование 	= ДанныеЗаполнения.Документ;
				
				Запрос       = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				               |	НарядЗаказЗапасы.Количество,
				               |	НарядЗаказЗапасы.КоличествоУпаковок,
				               |	НарядЗаказЗапасы.Номенклатура,
				               |	НарядЗаказЗапасы.Партия,
				               |	НарядЗаказЗапасы.Сумма,
				               |	НарядЗаказЗапасы.Упаковка,
				               |	НарядЗаказЗапасы.Цена,
				               |	НарядЗаказЗапасы.Всего,
				               |	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНдс) КАК СтавкаНДС,
				               |	НарядЗаказЗапасы.Ссылка КАК ДокументОснования,
				               |	НарядЗаказЗапасы.КлючСтроки
				               |ИЗ
				               |	Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
				               |ГДЕ
				               |	НарядЗаказЗапасы.Ссылка = &ДокументОснование
				               |	И (НарядЗаказЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
				               |			ИЛИ НарядЗаказЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Материал))
				               |	И НарядЗаказЗапасы.Лаборатория = &Лаборатория
				               |	И ВЫБОР
				               |			КОГДА &Фильтр
				               |				ТОГДА НарядЗаказЗапасы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыНарядЗаказа.выполнено)
				               |			ИНАЧЕ ИСТИНА
				               |		КОНЕЦ
				               |	И ВЫБОР
				               |			КОГДА &ЕстьМассивКлючей
				               |				ТОГДА НарядЗаказЗапасы.КлючСтроки В (&МассивКлючей)
				               |			ИНАЧЕ ИСТИНА
				               |		КОНЕЦ
				               |;
				               |
				               |////////////////////////////////////////////////////////////////////////////////
				               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
				               |	НарядЗаказЗапасы.Количество,
				               |	НарядЗаказЗапасы.КоличествоУпаковок,
				               |	НарядЗаказЗапасы.Номенклатура,
				               |	НарядЗаказЗапасы.Партия,
				               |	НарядЗаказЗапасы.Сумма,
				               |	НарядЗаказЗапасы.Упаковка,
				               |	НарядЗаказЗапасы.Цена,
				               |	НарядЗаказЗапасы.Всего,
				               |	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНдс) КАК СтавкаНДС,
				               |	НарядЗаказЗапасы.Ссылка КАК ДокументОснования,
				               |	НарядЗаказЗапасы.Ссылка.Сотрудник,
				               |	СотрудникиСпецилазацииСотрудника.Специализация,
				               |	ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.Лаборатория) КАК СтатьяРасходов,
				               |	НарядЗаказЗапасы.КлючСтроки
				               |ИЗ
				               |	Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
				               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники.СпецилазацииСотрудника КАК СотрудникиСпецилазацииСотрудника
				               |		ПО НарядЗаказЗапасы.Ссылка.Сотрудник = СотрудникиСпецилазацииСотрудника.Ссылка
				               |			И (СотрудникиСпецилазацииСотрудника.Основная = ИСТИНА)
				               |ГДЕ
				               |	НарядЗаказЗапасы.Ссылка = &ДокументОснование
				               |	И НарядЗаказЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
				               |	И НарядЗаказЗапасы.Лаборатория = &Лаборатория
				               |	И ВЫБОР
				               |			КОГДА &Фильтр
				               |				ТОГДА НарядЗаказЗапасы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыНарядЗаказа.выполнено)
				               |			ИНАЧЕ ИСТИНА
				               |		КОНЕЦ
				               |	И ВЫБОР
				               |			КОГДА &ЕстьМассивКлючей
				               |				ТОГДА НарядЗаказЗапасы.КлючСтроки В (&МассивКлючей)
				               |			ИНАЧЕ ИСТИНА
				               |		КОНЕЦ";           
				
				Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения.Документ);		
				Запрос.УстановитьПараметр("Лаборатория"      , ДанныеЗаполнения.Лаборатория);
				Запрос.УстановитьПараметр("Фильтр"           , ДанныеЗаполнения.Фильтр);
				Запрос.УстановитьПараметр("ЕстьМассивКлючей" , ?(ДанныеЗаполнения.Свойство("МассивКлючей"), Истина, Ложь));
				Запрос.УстановитьПараметр("МассивКлючей"     , ?(ДанныеЗаполнения.Свойство("МассивКлючей"), ДанныеЗаполнения.МассивКлючей, Новый Массив));
				Результат = Запрос.ВыполнитьПакет();
				
				Запасы.Загрузить(Результат[0].Выгрузить());
				Расходы.Загрузить(Результат[1].Выгрузить());
			КонецЕсли;	
			
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УведомлениеОПриемкеМДЛП") Тогда
		       ЗаполнитьПоУведомлениюОПриемке(ДанныеЗаполнения);
		КонецЕсли;
	КонецЕсли;

	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	
	СуммаОплачено = 0;
	Договор       = Неопределено;
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	ДокументОснование = Неопределено;
	
КонецПроцедуры

// Обработчик при записи объекта
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка заполнения реквизита оплачено в док. основания
	ВременнаяТаблица = ЭтотОбъект.Запасы.Выгрузить();
	ВременнаяТаблица.Свернуть("ДокументОснования");
    ДокументыЗапасы = ВременнаяТаблица.ВыгрузитьКолонку("ДокументОснования");

	Для Каждого ДокументОснование ИЗ ДокументыЗапасы Цикл 
		Если ЗначениеЗаполнено(ДокументОснование) 
			И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику")
			И ДокументОснование.СуммаОплачено <> СуммаОплачено  Тогда
			ДокОбъект               = ДокументОснование.ПолучитьОбъект();
			ДокОбъект.СуммаОплачено = СуммаОплачено;
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	// Инициализация дополнительных свойств для проведения документа.
	ДвиженияДокументовСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.Поступление.УстановитьНачальныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Движения по регистрам
	ДвиженияДокументовСервер.ЗапасыНаСкладах(ДополнительныеСвойства, Движения, Отказ);   	
	ДвиженияДокументовСервер.ВзаиморасчетыСКонтрагентами(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.ПартииТоваров(ДополнительныеСвойства, Движения, Отказ); 
	ДвиженияДокументовСервер.УстановкаЦен(ДополнительныеСвойства, Движения, Отказ); 
	ДвиженияДокументовСервер.Затраты(ДополнительныеСвойства, Движения, Отказ);	
	ДвиженияДокументовСервер.Управленческий(ДополнительныеСвойства, Движения, Отказ);

	
	// Запись наборов записей.
	ДвиженияДокументовСервер.ДобавитьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Удаляем цены из регистра по документу
	ДвиженияДокументовСервер.УдалениеЦен(Ссылка, Движения, Отказ);
	
КонецПроцедуры

//
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка табличной части на разрешения по значениям. 
	Если ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьНулевуюСумму, Ложь) Тогда
		УдаляемыйЭлемент = ПроверяемыеРеквизиты.Найти("Запасы.Сумма");
		Если УдаляемыйЭлемент <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(УдаляемыйЭлемент);
		КонецЕсли;
	КонецЕсли;
	
	// Проверка табличной части на разрешения по значениям. 
	Если ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьНулевуюСумму, Ложь) Тогда
		УдаляемыйЭлемент = ПроверяемыеРеквизиты.Найти("Расходы.Сумма");
		Если УдаляемыйЭлемент <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(УдаляемыйЭлемент);
		КонецЕсли;
	КонецЕсли;
	
	// Проверка табличной части на разрешения по значениям статей затрат. 
	Если НЕ ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.ОбязательноеЗаполнениеСтатьиЗатратВПоступленииЗапасов, Ложь) Тогда
		УдаляемыйЭлемент = ПроверяемыеРеквизиты.Найти("Расходы.СтатьяРасходов");
		Если УдаляемыйЭлемент <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(УдаляемыйЭлемент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоУведомлениюОПриемке(Уведомление)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Связи.Организация КАК Организация,
	                      |	Связи.МестоДеятельности КАК Склад,
	                      |	СвязиВнешние.ОрганизацияКонтрагент КАК Контрагент,
	                      |	НЕ Уведомление.Проведен КАК ЕстьОшибкиПроведен
	                      |ИЗ
	                      |	Документ.УведомлениеОПриемкеМДЛП КАК Уведомление
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СубъектыОбращенияМДЛП КАК Связи
	                      |		ПО Уведомление.ИдентификаторОрганизации = Связи.ИдентификаторСубъектаОбращения
	                      |			И (Связи.СобственнаяОрганизация)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СубъектыОбращенияМДЛП КАК СвязиВнешние
	                      |		ПО Уведомление.ИдентификаторКонтрагента = СвязиВнешние.ИдентификаторСубъектаОбращения
	                      |			И (НЕ СвязиВнешние.СобственнаяОрганизация)
	                      |ГДЕ
	                      |	Уведомление.Ссылка = &Уведомление
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	                      |	ТаблицаТовары.Серия КАК Серия,
	                      |	ТаблицаТовары.Количество КАК Количество,
	                      |	ТаблицаТовары.Количество КАК КоличествоУпаковок,
	                      |	ТаблицаТовары.Цена КАК Цена,
	                      |	ТаблицаТовары.Сумма КАК Сумма,
	                      |	ТаблицаТовары.СуммаНДС КАК СуммаНДС
	                      |ИЗ
	                      |	Документ.УведомлениеОПриемкеМДЛП.Товары КАК ТаблицаТовары
	                      |ГДЕ
	                      |	ТаблицаТовары.Ссылка = &Уведомление");
	
	Запрос.УстановитьПараметр("Уведомление", Уведомление);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Шапка = РезультатЗапроса[0].Выбрать();
	Шапка.Следующий();
	
	Если Шапка.ЕстьОшибкиПроведен Тогда
		ТекстОшибки = НСтр("ru='Документ %1 не проведен. Ввод на основании непроведенного документа невозможен.'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Уведомление);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Шапка);
	Запасы.Загрузить(РезультатЗапроса[1].Выгрузить());
	
КонецПроцедуры

#КонецОбласти
