
#Область СлужебныйПрограммныйИнтерфейс

// Получает массив автозаполнений в файле
//  Параметры:Файл - ссылка на объект файла
//			ФайлОснование - файл, на основании которого был создан Файл. Ссылка на шаблон файла.
//			ВладелецФайла - ссылка на владельца файла, на основании которого следует производить подстановку данных
//  Возвращает:массив замен в формате "какое поле заменить"-"какую строку заменить"-"на что заменить"
Функция ПолучитьМассивАвтозаполненийШаблона(Файл, Шаблон, ВладелецФайла, ПоказзыватьПредупреждения = Истина) Экспорт
	
	СтрокаОшибки = "";
	МассивДанныеЗамен = Новый Массив;
	
	Для Каждого ДанныеДляЗамены Из Шаблон.ДанныеДляАвтозаполнения Цикл
			
		ДанныеВладельцаФайлаДляАвтозаполнения = Новый Структура("НомерСтроки, ТипЗаменяемойСтроки, ЗаменяемоеЗначение, ТипЗначенияЗамены, ЗначениеЗамены, ЗначениеЗаменыБезФормата, ТипЗаменыПустогоЗначения, ЗначениеЗаменыНезаполненного, КоличествоСимволовПрочерков");
		ЗаполнитьЗначенияСвойств(ДанныеВладельцаФайлаДляАвтозаполнения, ДанныеДляЗамены);
		ЗначениеРеквизита = Неопределено;
		
		Попытка
			Если ДанныеДляЗамены.ТипЗначенияЗамены = Истина И Лев(ДанныеДляЗамены.ЗначениеЗамены, 1) = """" И Прав(ДанныеДляЗамены.ЗначениеЗамены, 1) = """" Тогда
				ЗначениеРеквизита = Сред(ДанныеДляЗамены.ЗначениеЗамены, 2, СтрДлина(ДанныеДляЗамены.ЗначениеЗамены) - 1);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Истина Тогда
				Выражение = СтрЗаменить(ДанныеДляЗамены.ЗначениеЗамены, "Договоры", "ВладелецФайла");
				РезультатОбработки = Null;
				Выполнить(Выражение);
				Если РезультатОбработки = Null Тогда
					ВызватьИсключение("При выполнении выражения результат не был возвращен");
				Иначе 
					ЗначениеРеквизита = РезультатОбработки;
				КонецЕсли;
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "ДопРеквизиты") > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеДопРеквизитаДляЗамены(Файл, ДанныеДляЗамены.ЗначениеЗамены, ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "ДопКонтактнаяИнформация") > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеКонтактнаяИнформацияДляЗамены(Файл, ДанныеДляЗамены.ЗначениеЗамены, ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "ДопУдостоверенияЛичности") > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеДокументыФизическихЛицДляЗамены(Файл, ДанныеДляЗамены.ЗначениеЗамены, ВладелецФайла);				
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Номер договора") > 0 Тогда
				ЗначениеРеквизита = ПолучитьНомерБезПрефикса(Файл, ДанныеДляЗамены.ЗначениеЗамены, ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Дата договора") > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "Договоры.Дата", ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Врач") > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "Договоры.Врач", ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Автор документа") > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "Договоры.АвторДокумента", ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Комментарий") > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "Договоры.Комментарий", ВладелецФайла);
			// --------------------------------------------------------------------------------ПАЦИЕНТ--------------------------------------------------------------------------------------					
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Фамилия") > 0 И (Найти(ДанныеДляЗамены.ЗначениеЗамены, "Пациент") > 0 ИЛИ Найти(ДанныеДляЗамены.ЗначениеЗамены, "Клиент")) > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "ВладелецФайла.Контрагент.Фамилия", ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Имя") > 0 И (Найти(ДанныеДляЗамены.ЗначениеЗамены, "Пациент") > 0 ИЛИ Найти(ДанныеДляЗамены.ЗначениеЗамены, "Клиент")) > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "ВладелецФайла.Контрагент.Имя", ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Отчество") > 0 И (Найти(ДанныеДляЗамены.ЗначениеЗамены, "Пациент") > 0 ИЛИ Найти(ДанныеДляЗамены.ЗначениеЗамены, "Клиент")) > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "ВладелецФайла.Контрагент.Отчество", ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "ФИО") > 0 И (Найти(ДанныеДляЗамены.ЗначениеЗамены, "Пациент") > 0 ИЛИ Найти(ДанныеДляЗамены.ЗначениеЗамены, "Клиент")) > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "ВладелецФайла.Контрагент.Наименование", ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Дата рождения") > 0 И (Найти(ДанныеДляЗамены.ЗначениеЗамены, "Пациент") > 0 ИЛИ Найти(ДанныеДляЗамены.ЗначениеЗамены, "Клиент")) > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "ВладелецФайла.Контрагент.ДатаРожденияКлиента", ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Пол") > 0 И (Найти(ДанныеДляЗамены.ЗначениеЗамены, "Пациент") > 0 ИЛИ Найти(ДанныеДляЗамены.ЗначениеЗамены, "Клиент")) > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "ВладелецФайла.Контрагент.ПолКлиента", ВладелецФайла);	
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Телефон") > 0 И (Найти(ДанныеДляЗамены.ЗначениеЗамены, "Пациент") > 0 ИЛИ Найти(ДанныеДляЗамены.ЗначениеЗамены, "Клиент")) > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "ВладелецФайла.Контрагент.Телефон", ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Адрес") > 0 И (Найти(ДанныеДляЗамены.ЗначениеЗамены, "Пациент") > 0 ИЛИ Найти(ДанныеДляЗамены.ЗначениеЗамены, "Клиент")) > 0 Тогда
				ЗначениеРеквизита = ПолучитьАдресКлиента(ВладелецФайла, "Контрагент");
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Паспортные данные") > 0 И (Найти(ДанныеДляЗамены.ЗначениеЗамены, "Пациент") > 0 ИЛИ Найти(ДанныеДляЗамены.ЗначениеЗамены, "Клиент")) > 0 Тогда
				ЗначениеРеквизита = ПолучитьПаспортныеДанныеКлиента(ВладелецФайла, "Контрагент");
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Куратор") > 0 И (Найти(ДанныеДляЗамены.ЗначениеЗамены, "Пациент") > 0 ИЛИ Найти(ДанныеДляЗамены.ЗначениеЗамены, "Клиент")) > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "ВладелецФайла.Контрагент.Куратор", ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Номер мед. карты") > 0 И (Найти(ДанныеДляЗамены.ЗначениеЗамены, "Пациент") > 0 ИЛИ Найти(ДанныеДляЗамены.ЗначениеЗамены, "Клиент")) > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "ВладелецФайла.Контрагент.ТекущаяМедицинскаяКарта.КодБезНулей", ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Емайл") > 0 И (Найти(ДанныеДляЗамены.ЗначениеЗамены, "Пациент") > 0 ИЛИ Найти(ДанныеДляЗамены.ЗначениеЗамены, "Клиент")) > 0 Тогда
				ЗначениеРеквизита = ПолучитьЕмайлКлиента(ВладелецФайла, "Контрагент"); 
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "ИНН") > 0 И (Найти(ДанныеДляЗамены.ЗначениеЗамены, "Пациент") > 0 ИЛИ Найти(ДанныеДляЗамены.ЗначениеЗамены, "Клиент")) > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "ВладелецФайла.Контрагент.ИНН", ВладелецФайла);
				
				// ------------------------------------------------------------------------ЗАКОННЫЙ ПРЕДСТАВИТЕЛЬ------------------------------------------------------------------------------	
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Фамилия") > 0 И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Законный представитель") > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "ВладелецФайла.ЗаконныйПредставитель.Фамилия", ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Имя") > 0 И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Законный представитель") > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "ВладелецФайла.ЗаконныйПредставитель.Имя", ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Отчество") > 0 И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Законный представитель") > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "ВладелецФайла.ЗаконныйПредставитель.Отчество", ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "ФИО") > 0 И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Законный представитель") > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "ВладелецФайла.ЗаконныйПредставитель.Наименование", ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Дата рождения") > 0 И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Законный представитель") > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "ВладелецФайла.ЗаконныйПредставитель.ДатаРожденияКлиента", ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Телефон") > 0 И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Законный представитель") > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "ВладелецФайла.ЗаконныйПредставитель.Телефон", ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Адрес") > 0 И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Законный представитель") > 0 Тогда
				ЗначениеРеквизита = ПолучитьАдресКлиента(ВладелецФайла, "ЗаконныйПредставитель");
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Паспортные данные") > 0 И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Законный представитель") > 0 Тогда
				ЗначениеРеквизита = ПолучитьПаспортныеДанныеКлиента(ВладелецФайла, "ЗаконныйПредставитель");
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Куратор") > 0 И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Законный представитель") > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "ВладелецФайла.ЗаконныйПредставитель.Куратор", ВладелецФайла);
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Номер мед. карты") > 0 И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Законный представитель") > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "ВладелецФайла.ЗаконныйПредставитель.ТекущаяМедицинскаяКарта.КодБезНулей", ВладелецФайла);		
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Номер мед. карты") > 0 И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Законный представитель") > 0 Тогда
				ЗначениеРеквизита = ПолучитьЕмайлКлиента(ВладелецФайла, "ЗаконныйПредставитель"); 
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "ИНН") > 0 И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Законный представитель") > 0 Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, "ВладелецФайла.ЗаконныйПредставитель.ИНН", ВладелецФайла);
				
				// ------------------------------------------------------------------------ОРГАНИЗАЦИЯ------------------------------------------------------------------------------------------
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь И Найти(ДанныеДляЗамены.ЗначениеЗамены, "Организация") > 0 Тогда
				
				Если Найти(ДанныеДляЗамены.ЗначениеЗамены, "Наименование юр. лица") > 0 Тогда
					ЗначениеРеквизита = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизитаПоПути(ВладелецФайла,"СтруктурнаяЕдиница.Организация.ПолноеНаименование"); 
					ЗначениеРеквизита = ?(ЗначениеРеквизита = "",ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизитаПоПути(ВладелецФайла,"СтруктурнаяЕдиница.Организация.Наименование"),ЗначениеРеквизита); 
				Иначе
					ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполненияОрганизации(ДанныеДляЗамены.ЗначениеЗамены, ВладелецФайла);
				КонецЕсли;
				
				// -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------								
			ИначеЕсли ДанныеДляЗамены.ТипЗначенияЗамены = Ложь Тогда
				ЗначениеРеквизита = ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, ДанныеДляЗамены.ЗначениеЗамены, ВладелецФайла);
			КонецЕсли; 
			
			Если ПустаяСтрока(ЗначениеРеквизита) Тогда
				
				Если ДанныеВладельцаФайлаДляАвтозаполнения.ТипЗаменыПустогоЗначения Тогда
					
					ЗначениеРеквизита = СтрСоединить(Новый Массив(ДанныеВладельцаФайлаДляАвтозаполнения.КоличествоСимволовПрочерков + 1), "_");	
					
				Иначе 
					
					ЗначениеРеквизита = ДанныеВладельцаФайлаДляАвтозаполнения.ЗначениеЗаменыНезаполненного;
					
				КонецЕсли; 
				
			КонецЕсли;
				
		Исключение
			СтрокаОшибки = СтрокаОшибки + ДанныеДляЗамены.ЗначениеЗамены + 
			?(ИнформацияОбОшибке().Описание <> "", ", Ошибка: " + ИнформацияОбОшибке().Описание, "") + Символы.ВК;
		КонецПопытки;
		
		ДанныеВладельцаФайлаДляАвтозаполнения.ЗначениеЗамены = ?(ЗначениеЗаполнено(ДанныеДляЗамены.ФорматЗначенияЗамены), 
				Формат(ЗначениеРеквизита, ДанныеДляЗамены.ФорматЗначенияЗамены), Строка(ЗначениеРеквизита));
		ДанныеВладельцаФайлаДляАвтозаполнения.ЗначениеЗаменыБезФормата = ЗначениеРеквизита;
		МассивДанныеЗамен.Добавить(ДанныеВладельцаФайлаДляАвтозаполнения);
		
	КонецЦикла;
		
	// Если ЗначениеЗаполнено(СтрокаОшибки) И ПоказзыватьПредупреждения Тогда
	//	Сообщить("Следующие реквизиты правила автозаполнения заданы некорректно:" + Символы.ВК + СтрокаОшибки);
	// КонецЕсли;
	//
	Возврат МассивДанныеЗамен;
	
КонецФункции

// Возвращает двоичные данные файла
// Параметры:Файл - ссылка на файл, двоичные данные которого необходимо получить
Функция ПолучитьДвоичныеДанныеФайла(Файл) Экспорт
	
	Если Файл.ТекущаяВерсия.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекущаяВерсия = Файл.ТекущаяВерсия.ПолучитьОбъект();	
	Если ТекущаяВерсия.ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВТомахНаДиске Тогда
    	Если НЕ ТекущаяВерсия.Том.Пустая() Тогда
        	ПолныйПуть = ФайловыеФункции.ПолныйПутьТома(ТекущаяВерсия.Том) + ТекущаяВерсия.ПутьКФайлу; 
            Попытка
            	ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ПолныйПуть);
			Исключение
				ВызватьИсключение(НСтр("ru = 'Ошибка получения данных файла """ + Файл.Наименование + """.'"));
			КонецПопытки;
		Иначе
			ВызватьИсключение(НСтр("ru = 'Ошибка получения данных файла """ + Файл.Наименование + """.'"));
		КонецЕсли;
	ИначеЕсли ТекущаяВерсия.ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе Тогда
		ДвоичныеДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаИДвоичныеДанные(ТекущаяВерсия.Ссылка).ДвоичныеДанные;
		// ДвоичныеДанныеФайла = ТекущаяВерсия.ФайлХранилище.Получить();
	Иначе
		ВызватьИсключение(НСтр("ru = 'Ошибка получения данных файла """ + Файл.Наименование + """.'"));
	КонецЕсли;
	
	Возврат ДвоичныеДанныеФайла;
	
КонецФункции

// Получает настройки, связанные с автозаполнением файлов
// Параметры:
//			ФайлСсылка - ссылка на объект типа Файл
//			Документ - ссылка на Вн, Вх или Исх документ - владелец файла
// Возвращает:
//			Структура
//				ДвоичныеДанныеФайла - двоичные данные последней версии файла
//				РасширениеФайла - расширение последней версии файла
//				МассивЗамен - массив структур в формате "какое поле заменить"-"какую строку заменить"-"на что заменить"
//				ОснованиеСозданияФайла - ссылка на файл-шаблон, если параметр ФайлСсылка был создан из шаблона	
 Функция ПолучитьНастройкиАвтозаполненияШаблоновФайлов(Знач ФайлСсылка, Знач Шаблон, Знач ВладелецФайла) Экспорт
	
	Если Шаблон = Неопределено Тогда
		Шаблон = ВладелецФайла.ШаблонДоговора;
	КонецЕсли;
	Если ФайлСсылка = Неопределено Тогда
		ФайлСсылка = Шаблон.ШаблонФайла;
	КонецЕсли;
		
	МассивЗамен = ПолучитьМассивАвтозаполненийШаблона(ФайлСсылка, Шаблон, ВладелецФайла);
	ДвоичныеДанныеФайла = ПолучитьДвоичныеДанныеФайла(ФайлСсылка);
	РасширениеФайла = ?(ФайлСсылка.ТекущаяВерсияРасширение = "", НРег(ФайлСсылка.Расширение), НРег(ФайлСсылка.ТекущаяВерсияРасширение));
		
	ДанныеВозврата = Новый Структура("ДвоичныеДанныеФайла, РасширениеФайла, МассивЗамен", ДвоичныеДанныеФайла, РасширениеФайла, МассивЗамен);
	
	Возврат ДанныеВозврата;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает реквизит данных файла
//  Параметры:Файл - ссылка на объект файл
//			НазваниеПоля - наименование реквизита, которое необходимо получить
//			ВладелецФайла - ссылка на владельца файла, на основании которого следует производить подстановку данных
//  Возвращает:значение поля, если оно существует
Функция ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, Знач НазваниеПоля, ВладелецФайла)
	
	Результат = "";
	
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НазваниеПоля, ".");
	
	Если МассивСтрок.Количество() > 1 И МассивСтрок[0] = "Договоры" Тогда
		ВыражениеРеквизита = "ВладелецФайла" + "." + Сред(НазваниеПоля, СтрДлина(МассивСтрок[0]) + 2);
		Выражение = "Результат = " + ВыражениеРеквизита;
	ИначеЕсли МассивСтрок.Количество() > 1 И МассивСтрок[0] = "Ответственные лица" Тогда
		Выражение = "
			|Запрос = Новый Запрос;
			|Запрос.Текст = ""ВЫБРАТЬ РАЗРЕШЕННЫЕ
		    |          |	ОтветственныеЛицаСрезПоследних.Сотрудник
		    |          |ИЗ
		    |          |	РегистрСведений.ОтветственныеЛица.СрезПоследних КАК ОтветственныеЛицаСрезПоследних
		    |          |ГДЕ
		    |          |	ОтветственныеЛицаСрезПоследних.Организация = &Организация
		    |          |	И ОтветственныеЛицаСрезПоследних.ТипОтветственногоЛица = &ТипОтветственногоЛица"";
			|Запрос.УстановитьПараметр(""ТипОтветственногоЛица"", Перечисления.ТипыОтветственныхЛиц[МассивСтрок[1]]);
			|Запрос.УстановитьПараметр(""Организация"", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.Организация);
			|ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
			|Если ВыборкаЗапроса.Следующий() Тогда
			|	Результат = ВыборкаЗапроса.Сотрудник;
			|Иначе
			|	Результат = Справочники.Сотрудники.ПустаяСсылка();
			|КонецЕсли;" 
			
	ИначеЕсли ЗначениеЗаполнено(НазваниеПоля) Тогда
		Выражение = "Результат = " + НазваниеПоля;
	КонецЕсли;
	
	Выполнить(Выражение);
	
	Возврат Результат;
	
КонецФункции  

// Функция, получить значения реквиитов организации.
//
Функция ПолучитьЗначениеРеквизитаДляАвтозаполненияОрганизации(НазваниеПоля, ВладелецФайла)
	
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НазваниеПоля, "."); 
	Организация = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ВладелецФайла.СтруктурнаяЕдиница, "Организация");
	Результат = "";
	ВидКИ = "";
	
	Если МассивСтрок.Количество() > 1 И МассивСтрок[1] = "Телефон" Тогда
		ВидКИ = "ТелефонОрганизации";
	ИначеЕсли МассивСтрок.Количество() > 1 И МассивСтрок[1] = "Емайл" Тогда
		ВидКИ = "EmailОрганизации";
	ИначеЕсли МассивСтрок.Количество() > 1 И МассивСтрок[1] = "Фактический адрес" Тогда
		ВидКИ = "ФактАдресОрганизации";
	ИначеЕсли МассивСтрок.Количество() > 1 И МассивСтрок[1] = "Юридический адрес" Тогда
		ВидКИ = "ЮрАдресОрганизации";
	ИначеЕсли МассивСтрок.Количество() > 1 И МассивСтрок[1] = "Почтовый адрес" Тогда
		ВидКи = "ПочтовыйАдресОрганизации";
	ИначеЕсли МассивСтрок.Количество() > 1 И МассивСтрок[1] = "Факс" Тогда
		ВидКИ = "ФаксОрганизации";
	КонецЕсли;	
	
	Если ВидКИ <> "" Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|ГДЕ
		|	ОрганизацииКонтактнаяИнформация.Ссылка = &Организация
		|	И ОрганизацииКонтактнаяИнформация.Вид = &Вид");
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации[ВидКИ]);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Результат = ?(Выборка.Следующий(), Выборка.Представление, "");  
		
	КонецЕсли;  
	
	Возврат Результат; 		
	
КонецФункции	

//
//
Функция ПолучитьЗначениеДопРеквизитаДляЗамены(Файл, Знач НазваниеПоля, ВладелецФайла)
	
	Результат = Null;
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НазваниеПоля, ".");
	
	Если МассивСтрок[0] = "Договоры" Тогда
		МассивСтрок[0] = "ВладелецФайла";
	КонецЕсли;

	Счетчик = 0;
	ВыражениеРеквизита = "";
	Пока Счетчик < (МассивСтрок.Количество() - 1) И МассивСтрок[Счетчик] <> "ДопРеквизиты" Цикл
		ВыражениеРеквизита = ВыражениеРеквизита + ?(ЗначениеЗаполнено(ВыражениеРеквизита), ".", "") + МассивСтрок[Счетчик];
		Счетчик = Счетчик + 1;
	КонецЦикла;
	ИмяДопРеквизита = МассивСтрок[МассивСтрок.Количество() - 1];
		
	ВыражениеЦикла = 
	"Для Каждого ДопРеквизит Из " + ВыражениеРеквизита + ".ДополнительныеРеквизиты Цикл
		|Если Строка(ДопРеквизит.Свойство) = ИмяДопРеквизита Тогда
		|	Результат = ДопРеквизит.Значение;
		|КонецЕсли;
	|КонецЦикла;";
	
	Выполнить(ВыражениеЦикла);

	Если Результат = Null Тогда
		ВызватьИсключение("Дополнительный реквизит или свойство не обнаруженно");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//
//
Функция ПолучитьНомерБезПрефикса(Файл, Знач НазваниеПоля, ВладелецФайла)
	
	Результат = Null;
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НазваниеПоля, ".");
	
	Если МассивСтрок[0] = "Договоры" Тогда
		МассивСтрок[0] = "ВладелецФайла";
	КонецЕсли;

	Счетчик = 0;
	ВыражениеРеквизита = "";
	Пока Счетчик < (МассивСтрок.Количество() - 1) И МассивСтрок[Счетчик] <> "ДопКонтактнаяИнформация" Цикл
		ВыражениеРеквизита = МассивСтрок[Счетчик];
		Счетчик = Счетчик + 1;
	КонецЦикла; 
	
	Возврат ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(ВладелецФайла.Ссылка.Номер,,Истина);
	
КонецФункции

//
//
Функция ПолучитьАдресКлиента(ВладелецФайла, Контрагент = Неопределено)
	
	Если Контрагент <> Неопределено Тогда 
		Если Контрагент = "Контрагент" Тогда 
			Ссылка = ВладелецФайла.Контрагент;
		ИначеЕсли Контрагент = "ЗаконныйПредставитель" Тогда	
			Ссылка = ВладелецФайла.ЗаконныйПредставитель;
		КонецЕсли;
	Иначе 
		Ссылка = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
		
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	КонтрагентыКонтактнаяИнформация.Представление КАК Представление
	                      |ИЗ
	                      |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	                      |ГДЕ
	                      |	КонтрагентыКонтактнаяИнформация.Ссылка = &Ссылка
	                      |	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресКлиента)");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0].Представление;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

//
//
Функция ПолучитьЕмайлКлиента(ВладелецФайла, Контрагент = Неопределено)
	
	Если Контрагент <> Неопределено Тогда 
		Если Контрагент = "Контрагент" Тогда 
			Ссылка = ВладелецФайла.Контрагент;
		ИначеЕсли Контрагент = "ЗаконныйПредставитель" Тогда	
			Ссылка = ВладелецФайла.ЗаконныйПредставитель;
		КонецЕсли;
	Иначе 
		Ссылка = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
		
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	КонтрагентыКонтактнаяИнформация.Представление КАК Представление
	                      |ИЗ
	                      |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	                      |ГДЕ
	                      |	КонтрагентыКонтактнаяИнформация.Ссылка = &Ссылка
	                      |	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКлиента)");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0].Представление;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

//
//
Функция ПолучитьЗначениеКонтактнаяИнформацияДляЗамены(Файл, Знач НазваниеПоля, ВладелецФайла)
	
	Результат = Null;
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НазваниеПоля, ".");
	
	Если МассивСтрок[0] = "Договоры" Тогда
		МассивСтрок[0] = "ВладелецФайла";
	КонецЕсли;

	Счетчик = 0;
	ВыражениеРеквизита = "";
	Пока Счетчик < (МассивСтрок.Количество() - 1) И МассивСтрок[Счетчик] <> "ДопКонтактнаяИнформация" Цикл
		ВыражениеРеквизита = ВыражениеРеквизита + ?(ЗначениеЗаполнено(ВыражениеРеквизита), ".", "") + МассивСтрок[Счетчик];
		Счетчик = Счетчик + 1;
	КонецЦикла;
	ИмяТипаКонтактнойИнформации = "ТипыКонтактнойИнформации." + МассивСтрок[МассивСтрок.Количество() - 1];
		
	ВыражениеЦикла = 
	"СтрокаТЧ = " + ВыражениеРеквизита + ".КонтактнаяИнформация.Найти(Перечисления." + ИмяТипаКонтактнойИнформации + ", ""Тип"");
	|Если СтрокаТЧ <> Неопределено Тогда
	|	Результат = СтрокаТЧ.Представление;
	|КонецЕсли;";
	
	Выполнить(ВыражениеЦикла);

	// Если Результат = Null Тогда
	//	ВызватьИсключение("Контактная информация не обнаруженна");
	// КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//
//
Функция ПолучитьЗначениеДокументыФизическихЛицДляЗамены(Файл, Знач НазваниеПоля, ВладелецФайла)
	
	Результат = Null;
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НазваниеПоля, ".");
	
	Если МассивСтрок[0] = "Договоры" Тогда
		МассивСтрок[0] = "ВладелецФайла";
	КонецЕсли;

	Счетчик = 0;
	ВыражениеРеквизита = "";
	Пока Счетчик < (МассивСтрок.Количество() - 1) И МассивСтрок[Счетчик] <> "ДопУдостоверенияЛичности" Цикл
		ВыражениеРеквизита = ВыражениеРеквизита + ?(ЗначениеЗаполнено(ВыражениеРеквизита), ".", "") + МассивСтрок[Счетчик];
		Счетчик = Счетчик + 1;
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДокументыФизическихЛицСрезПоследних.Представление
	               |ИЗ
	               |	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
	               |			&Период,
	               |			ВидДокумента = &ВидДокумента
	               |				И Физлицо = &Физлицо) КАК ДокументыФизическихЛицСрезПоследних";
	Запрос.УстановитьПараметр("Период", ВладелецФайла.Дата);
	Запрос.УстановитьПараметр("Физлицо", ВладелецФайла.Контрагент);
	Запрос.УстановитьПараметр("ВидДокумента", Справочники.ВидыДокументовФизическихЛиц.НайтиПоНаименованию(МассивСтрок[МассивСтрок.Количество() - 1]));
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	Если ТаблицаЗначений.Количество() > 0 Тогда
		Результат = ТаблицаЗначений[0].Представление;
	КонецЕсли;
	
	Если Результат = Null Тогда
		ВызватьИсключение("Указанное вид удостоверения личности не обнаружен");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//
//
Функция ПолучитьПаспортныеДанныеКлиента(ВладелецФайла, Контрагент = Неопределено)
	
	Если Контрагент <> Неопределено Тогда 
		Если Контрагент = "Контрагент" Тогда 
			Ссылка = ВладелецФайла.Контрагент;
		ИначеЕсли Контрагент = "ЗаконныйПредставитель" Тогда	
			Ссылка = ВладелецФайла.ЗаконныйПредставитель;
		КонецЕсли;
	Иначе 
		Ссылка = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
	
	Запрос = НОвый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                      |	ДокументыФизическихЛиц.Представление
	                      |ИЗ
	                      |	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	                      |ГДЕ
	                      |	ДокументыФизическихЛиц.Физлицо = &Физлицо");
	Запрос.УстановитьПараметр("Физлицо", Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0].Представление;
	Иначе
		Возврат "";
	КонецЕсли; 
	
КонецФункции

#КонецОбласти
