
#Область СлужебныеПроцедурыИФункции

// Вернуть остатки по спианию абонементов
Функция ПолучитьОстаткиПоМатериаламКСписанию(Период,СтруктурнаяЕдиница = Неопределено,Склад = Неопределено,ИсключаемыйРегистратор = Неопределено) Экспорт
	
	ЗапросВыборка = Новый Запрос("ВЫБРАТЬ
	                             |	ВложенныйЗапрос.Услуга,
	                             |	ВложенныйЗапрос.Номенклатура,
	                             |	ВложенныйЗапрос.Партия,
	                             |	ВложенныйЗапрос.Сотрудник,
	                             |	ВложенныйЗапрос.Контрагент,
	                             |	ВложенныйЗапрос.ДокументПродажи,
	                             |	ВложенныйЗапрос.СтруктурнаяЕдиница,
	                             |	ВложенныйЗапрос.Склад,
	                             |	ВложенныйЗапрос.Количество
	                             |ИЗ
	                             |	(ВЫБРАТЬ
	                             |		МатериалыКСписаниюОбороты.Услуга КАК Услуга,
	                             |		МатериалыКСписаниюОбороты.Материал КАК Номенклатура,
	                             |		МатериалыКСписаниюОбороты.Партия КАК Партия,
	                             |		МатериалыКСписаниюОбороты.Сотрудник КАК Сотрудник,
	                             |		МатериалыКСписаниюОбороты.Клиент КАК Контрагент,
	                             |		МатериалыКСписаниюОбороты.ДокументПродажи КАК ДокументПродажи,
	                             |		МатериалыКСписаниюОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	                             |		МатериалыКСписаниюОбороты.Склад КАК Склад,
	                             |		СУММА(МатериалыКСписаниюОбороты.КоличествоОборот) КАК Количество
	                             |	ИЗ
	                             |		РегистрНакопления.МатериалыКСписанию.Обороты(
	                             |				,
	                             |				&Период,
	                             |				Авто,
	                             |				ВЫБОР
	                             |						КОГДА НЕ &СтруктурнаяЕдиница = НЕОПРЕДЕЛЕНО
	                             |								И НЕ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	                             |							ТОГДА СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                             |						ИНАЧЕ ИСТИНА
	                             |					КОНЕЦ
	                             |					И ВЫБОР
	                             |						КОГДА НЕ &Склад = НЕОПРЕДЕЛЕНО
	                             |								И НЕ &Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	                             |							ТОГДА Склад = &Склад
	                             |						ИНАЧЕ ИСТИНА
	                             |					КОНЕЦ) КАК МатериалыКСписаниюОбороты
	                             |	ГДЕ
	                             |		НЕ МатериалыКСписаниюОбороты.Регистратор = &ИсключаемыйРегистратор
	                             |	
	                             |	СГРУППИРОВАТЬ ПО
	                             |		МатериалыКСписаниюОбороты.Услуга,
	                             |		МатериалыКСписаниюОбороты.Склад,
	                             |		МатериалыКСписаниюОбороты.Материал,
	                             |		МатериалыКСписаниюОбороты.Партия,
	                             |		МатериалыКСписаниюОбороты.Сотрудник,
	                             |		МатериалыКСписаниюОбороты.Клиент,
	                             |		МатериалыКСписаниюОбороты.ДокументПродажи,
	                             |		МатериалыКСписаниюОбороты.СтруктурнаяЕдиница) КАК ВложенныйЗапрос
	                             |ГДЕ
	                             |	ВложенныйЗапрос.Количество > 0
	                             |
	                             |УПОРЯДОЧИТЬ ПО
	                             |	ВложенныйЗапрос.ДокументПродажи.Дата");
	
	ЗапросВыборка.УстановитьПараметр("Период"                ,Период);
	ЗапросВыборка.УстановитьПараметр("СтруктурнаяЕдиница"    ,СтруктурнаяЕдиница);
	ЗапросВыборка.УстановитьПараметр("Склад"                 ,Склад);
	ЗапросВыборка.УстановитьПараметр("ИсключаемыйРегистратор",ИсключаемыйРегистратор);

	Возврат ЗапросВыборка.Выполнить().Выгрузить(); 
	
КонецФункции

#КонецОбласти