
#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Параметры.Свойство("ЗначенияЗаполнения") И Параметры.ЗначенияЗаполнения.Свойство("ТипКонтрагента") Тогда  
		Объект.ТипКонтрагента = Параметры.ЗначенияЗаполнения.ТипКонтрагента;  
		Объект.Родитель = Справочники.Контрагенты.НайтиПоНаименованию("Страховые компании",Истина);	
		Элементы.ТипКонтрагента.ТолькоПросмотр = Объект.ТипКонтрагента = Перечисления.ТипыКонтрагентов.СтраховаяКомпания;
	КонецЕсли;
	
	Элементы.Автокоррекция.Видимость = Объект.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();

КонецПроцедуры

&НаСервере
// Процедура - обработчик события "ПередЗаписьюНаСервере".
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ТипКонтрагента <> Перечисления.ТипыКонтрагентов.Клиенты Тогда
		ТекущийОбъект.Автокоррекция = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте 
// Процедура, "Тип Контрагента при изменении".
//
Процедура ТипКонтрагентаПриИзменении(Элемент)
	
    ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиКомандФормы

&НаКлиенте
// Обработчик события "Скрыть показать дополнительно".
//
Процедура СкрытьПоказатьДополнительно(Команда)
	
    Элементы.ГруппаДополнительно.Видимость = Не Элементы.ГруппаДополнительно.Видимость;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура, обновить видимость элементов.
//
Процедура ОбновитьВидимостьЭлементов()
	
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиенты") Тогда
		Объект.Автокоррекция = 1;
		Элементы.Автокоррекция.Видимость = Истина;
	Иначе
		Элементы.Автокоррекция.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
