

#Область СлужебныеПроцедурыИФункции

// Удаляет элемент отбора динамического списка
//
// Параметры:
// Список  - обрабатываемый динамический список,
// ИмяПоля - имя поля компоновки, отбор по которому нужно удалить
//
Процедура УдалитьЭлементОтбораСписка(Список, ИмяПоля) Экспорт
	
	ЭлементыОтбора = Список.Отбор.Элементы;
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
	
	ИндексЭлементаОтбора = 0;
	
	Пока ИндексЭлементаОтбора < ЭлементыОтбора.Количество() Цикл
		
		ЭлементОтбора = ЭлементыОтбора[ИндексЭлементаОтбора];
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") 
		   И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			
			ЭлементыОтбора.Удалить(ЭлементОтбора);
			
		Иначе
			
			ИндексЭлементаОтбора = ИндексЭлементаОтбора + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // УдалитьЭлементОтбораСписка()

// Устанавливает элемент отбор динамического списка
//
// Параметры:
// Список			- обрабатываемый динамический список,
// ИмяПоля			- имя поля компоновки, отбор по которому нужно установить,
// ВидСравнения		- вид сравнения отбора, по умолчанию - Равно,
// ПравоеЗначение 	- значение отбора
//
Процедура УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения = Неопределено) Экспорт
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяПоля);	
	ЭлементОтбора.ВидСравнения   = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ПравоеЗначение = ПравоеЗначение;
	
КонецПроцедуры // УстановитьЭлементОтбораСписка()

// Изменяет элемент отбора динамического списка
//
// Параметры:
// Список         - обрабатываемый динамический список,
// ИмяПоля        - имя поля компоновки, отбор по которому нужно установить,
// ВидСравнения   - вид сравнения отбора, по умолчанию - Равно,
// ПравоеЗначение - значение отбора,
// Установить     - признак необходимости установить отбор
//
Процедура ИзменитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение = Неопределено, Установить = Ложь, ВидСравнения = Неопределено) Экспорт
	
	УдалитьЭлементОтбораСписка(Список, ИмяПоля);
	
	Если Установить Тогда
		
		Если ТипЗнч(ПравоеЗначение) = Тип("СтандартныйПериод") Тогда
			
			Если ЗначениеЗаполнено(ПравоеЗначение.ДатаНачала) Тогда
				
				УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение.ДатаНачала, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);	
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ПравоеЗначение.ДатаОкончания) Тогда
				
				УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение.ДатаОкончания, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);	
				
			КонецЕсли;	
			
		Иначе	
			
			УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ИзменитьЭлементОтбораСписка()

// Добавляет элемент в массив структур контакта
//
// Параметры
//  МассивОписания  					- Массив 	- массив, в который будут добавлена структура описания контакта.
//  Тип 								- Тип 		- тип ссылки контакта.
//  ВозможностьИнтерактивногоСоздания 	- Булево 	- признак возможности интерактивного создания контакта из документов 
// - взаимодействий.
//  Имя									- Строка	- имя типа контакта , как оно определено в метаданных.
//  Представление						- Строка	- представление типа контакта для отображения пользователю.
//  Иерархический                       - Булево    - признак того, является ли справочник иерархическим.
//  ЕстьВладелец						- Булево	- признак того, что у контакта есть владелец.
//  ИмяВладельца						- Строка 	- имя владельца контакта, как оно определено в метаданных.
//  ИскатьПоДомену						- Булево	- признак того, что по данному типу контакта будет осуществляться поиск по домену.
//  Связь 								- Строка    - описывает возможную связь данного контакта с другим контактом, в случае
// когда текущий контакт
//													  является реквизитом другого контакта. Описывается следующей строкой "ИмяТаблицы.ИмяРеквизита"	 
// 
Процедура ДобавитьЭлементМассиваОписанияВозможныхТиповКонтактов(МассивОписания,Тип,ВозможностьИнтерактивногоСоздания,Имя,Представление,Иерархический,ЕстьВладелец,ИмяВладельца,ИскатьПоДомену,Связь) Экспорт

	  МассивОписания.Добавить(Новый Структура("Тип,ВозможностьИнтерактивногоСоздания,Имя,Представление,Иерархический,ЕстьВладелец,ИмяВладельца,ИскатьПоДомену,Связь",
	  										   Тип,ВозможностьИнтерактивногоСоздания,Имя,Представление,Иерархический,ЕстьВладелец,ИмяВладельца,ИскатьПоДомену,Связь));

КонецПроцедуры

// Создает массив структур, в котором описываются возможные типы контактов
//
// Возвращаемое значение:
//   Массив   - массив структур, в котором описываются возможные типы контактов;
//
Функция ПолучитьМассивОписанияВозможныхКонтактов() Экспорт

	МассивВозможныеКонтакты = Новый Массив();
	МенеджерПочтыКлиентСервер.ДобавитьЭлементМассиваОписанияВозможныхТиповКонтактов(МассивВозможныеКонтакты,Тип("СправочникСсылка.Контрагенты"),Истина ,"Контрагенты","Контрагенты",Истина,Ложь,"",Истина,"");
	
	Возврат МассивВозможныеКонтакты;

КонецФункции // ПолучитьСтруктуруВозможныеКонтакты()

#КонецОбласти