
#Область СлужебныйПрограммныйИнтерфейс

// Обработчик события вызывается при получении имени кассира.
//
// Параметры:
//  ИмяКассира - Строка, Неопределено - Текст, используемый для заполнения документа
//  СтандартнаяОбработка - Булево
//
Процедура ОбработкаЗаполненияИмяКассира(ИмяКассира, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Обработчик события вызывается при получении ИНН кассира.
//
// Параметры:
//  ИННКассира - Строка, Неопределено - Текст, используемый для заполнения документа
//  СтандартнаяОбработка - Булево
//
Процедура ОбработкаЗаполненияИННКассира(ИННКассира, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Обработчик события вызывается при заполнения наименования рабочего места.
//
// Параметры:
//  Наименование - Строка - Наименование рабочего места.
//  ИмяПользователя - Строка - Имя пользователя информационной базы.
//  СтандартнаяОбработка - Булево
//
Процедура ОбработкаЗаполненияНаименованияРабочегоМеста(Наименование, ИмяПользователя, СтандартнаяОбработка)  Экспорт
	
КонецПроцедуры

// Обработчик события получения идентификатора клиента для рабочегоМеста.
//
// Параметры:
//  ИдентификаторКлиента - Строка, Неопределено - Идентификатор клиента
//  СтандартнаяОбработка - Булево
//
Процедура ИдентификаторКлиентаДляРабочегоМеста(ИдентификаторКлиента, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Стоматология      

// Функция выполняет проверку необходимости формато-логическоко контроля.
//
Функция НуженФорматоЛогическийКонтроль(ОбщиеПараметры, СтандартнаяОбработка) Экспорт
	
КонецФункции

// Функция возвращает поддерживаемые форматы ФФД в прикладном решении.
//
Функция ПолучитьПоддерживаемыйФорматыФФД() Экспорт
	
	ФорматыФФД = Новый СписокЗначений();
	
	ФорматыФФД.Добавить("1.0");
	ФорматыФФД.Добавить("1.0.5");
	ФорматыФФД.Добавить("1.1");
	ФорматыФФД.Добавить("1.2");
	
	Возврат ФорматыФФД;
	
КонецФункции

// Функция переопределяет типовой формато-логический контроль чека.
// Параметры:
//   ОбщиеПараметры - Структура, полученная ранее методом МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека,
//                    и заполненная данными чека.
//                    Содержит параметры для контроля:
//                      СпособФорматоЛогическогоКонтроля - ПеречислениеСсылка
//                      .СпособыФорматоЛогическогоКонтроля - если не заполнена,
//                                                         то контроль не выполняется,
//                      ДопустимоеРасхождениеФорматоЛогическогоКонтроля - Число 
//                      - по умолчанию установленное 54-ФЗ отклонение - 0.01,
//
//   СтандартнаяОбработка - Булево - Если присваивается значение Ложь, то стандарнтый контроль выполняться не будет.
//
//   ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудования - не обязательный.
//                              Если заполнено оборудование и не заполнен способ контроля в общих параметрах,
//                              то способ контроля и допустимое расхождение можно получать из подключаемого оборудования.
Процедура ПровестиФорматоЛогическийКонтроль(ОбщиеПараметры, СтандартнаяОбработка, ПодключаемоеОборудование = Неопределено) Экспорт
	
КонецПроцедуры

// Функция выполняет разделение фискальной строки.
//
Процедура РазделитьФискальнуюСтроку(ТекущаяПозиция, НовыеПозицииЧека, РасчетнаяЦена, РазницаСумм, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	// Запоминаем начальные значения.
	КоличествоНачальное = ТекущаяПозиция.Количество;
	СуммаСкидокНачальная = ТекущаяПозиция.СуммаСкидок;
	СуммаНДСНачальная = ТекущаяПозиция.СуммаНДС; // Рассчитывается формально, т.к. сумма НДС текущими драйверами игнорируется.
	
	// Если разница есть, то ее делим на копейку.
	// Получаем количество, которое нужно переоценить.
	КоличествоПереоценки = Окр(РазницаСумм / 0.01, 3, 1);
	Если КоличествоПереоценки < 0 Тогда
		КоличествоПереоценки = -КоличествоПереоценки;
	КонецЕсли;
	
	// Цена переоценки во всех примерах отличается от расчетной на 1 копейку.
	// В  большую или меньшую сторону в зависимости от знака разницы - зависимость обратная.
	ЦенаПереоценки = РасчетнаяЦена - Окр(РазницаСумм / КоличествоПереоценки, 2, 1);
	// Распределяем суммы скидок и НДС пропорционально количеству.
	// Если суммы есть. А если их нет, то должно остаться Неопределено.
	Если СуммаСкидокНачальная <> Неопределено Тогда
		СуммаСкидокПереоценки = Окр(СуммаСкидокНачальная * КоличествоПереоценки / КоличествоНачальное, 2, 1);
	КонецЕсли;
	Если СуммаНДСНачальная <> Неопределено Тогда
		СуммаНДСПереоценки = Окр(СуммаНДСНачальная * КоличествоПереоценки / КоличествоНачальное, 2, 1);
	КонецЕсли;
	ЕстьМарки = Ложь;
	СтарыйАлкоголь = Неопределено;
	НовыйАлкоголь = Неопределено;
	Если ТекущаяПозиция.Свойство("ПараметрыАлкогольнойПродукции") Тогда
		Если ТекущаяПозиция.ПараметрыАлкогольнойПродукции.Количество() > 0
		 	И ТекущаяПозиция.ПараметрыАлкогольнойПродукции[0] Тогда
			ВсегоАлкоголя = ТекущаяПозиция.ПараметрыАлкогольнойПродукции[1].Количество();
			Если ВсегоАлкоголя > 1 Тогда
				ЕстьМарки = Истина;
				СтарыйАлкоголь = Новый Массив;
				СтарыйАлкоголь.Добавить(ТекущаяПозиция.ПараметрыАлкогольнойПродукции[0]); //1 - Признак передаваемой акцизной продукции
				СтарыйАлкоголь.Добавить(Новый Массив); // 2 - Марки алкогольной продукции перезаполняются
				СтарыйАлкоголь.Добавить(ТекущаяПозиция.ПараметрыАлкогольнойПродукции[2]); // 3 - Объем алкогольной продукции
				СтарыйАлкоголь.Добавить(ТекущаяПозиция.ПараметрыАлкогольнойПродукции[3]); // 4 - Крепость алкогольной продукции
				СтарыйАлкоголь.Добавить(ТекущаяПозиция.ПараметрыАлкогольнойПродукции[4]); // 5 - КодВидаПродукции - код вида продукции по классификатору
				Для СчетчикМарок = КоличествоПереоценки + 1 По ВсегоАлкоголя Цикл
					СтарыйАлкоголь[1].Добавить(ТекущаяПозиция.ПараметрыАлкогольнойПродукции[1][СчетчикМарок - 1]);
				КонецЦикла;
				
				НовыйАлкоголь = Новый Массив;
				НовыйАлкоголь.Добавить(ТекущаяПозиция.ПараметрыАлкогольнойПродукции[0]); //1 - Признак передаваемой акцизной продукции
				НовыйАлкоголь.Добавить(Новый Массив); // 2 - Марки алкогольной продукции перезаполняются
				НовыйАлкоголь.Добавить(ТекущаяПозиция.ПараметрыАлкогольнойПродукции[2]); // 3 - Объем алкогольной продукции
				НовыйАлкоголь.Добавить(ТекущаяПозиция.ПараметрыАлкогольнойПродукции[3]); // 4 - Крепость алкогольной продукции
				НовыйАлкоголь.Добавить(ТекущаяПозиция.ПараметрыАлкогольнойПродукции[4]); // 5 - КодВидаПродукции - код вида продукции по классификатору
				Для СчетчикМарок = 1 По КоличествоПереоценки Цикл
					НовыйАлкоголь[1].Добавить(ТекущаяПозиция.ПараметрыАлкогольнойПродукции[1][СчетчикМарок - 1]);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Из начального количества отнимаем количество переоценки.
	// Получаем количество, которое остается по расчетной цене.
	Количество = ТекущаяПозиция.Количество - КоличествоПереоценки;
	
	// Выводим вместо первоначальной строки две новых.
	// Сначала с расчетной ценой и остатком количества.
	// И суммой - произведение цены и количества.
	НоваяПозиция = МенеджерОборудованияВызовСервера.СкопироватьСтруктуру(ТекущаяПозиция);
	НоваяПозиция.Количество = Количество;
	НоваяПозиция.ЦенаСоСкидками = РасчетнаяЦена;
	НоваяПозиция.Сумма = Окр(Количество * РасчетнаяЦена, 2, 1);
	Если СуммаСкидокНачальная <> Неопределено Тогда
		НоваяПозиция.СуммаСкидок = СуммаСкидокНачальная - СуммаСкидокПереоценки;
	КонецЕсли;
	Если СуммаНДСНачальная <> Неопределено Тогда
		НоваяПозиция.СуммаНДС = СуммаНДСНачальная - СуммаНДСПереоценки;
	КонецЕсли;
	Если ЕстьМарки Тогда
		НоваяПозиция.ПараметрыАлкогольнойПродукции = СтарыйАлкоголь;
	КонецЕсли;
	НовыеПозицииЧека.Добавить(НоваяПозиция);
	
	// Потом с переоцененной ценой и переоцененным количеством.
	// И суммой - произведение цены и количества.
	НоваяПозиция = МенеджерОборудованияВызовСервера.СкопироватьСтруктуру(ТекущаяПозиция);
	НоваяПозиция.Количество = КоличествоПереоценки;
	НоваяПозиция.ЦенаСоСкидками = ЦенаПереоценки;
	НоваяПозиция.Сумма = Окр(КоличествоПереоценки * ЦенаПереоценки, 2, 1);
	Если СуммаСкидокНачальная <> Неопределено Тогда
		НоваяПозиция.СуммаСкидок = СуммаСкидокПереоценки;
	КонецЕсли;
	Если СуммаНДСНачальная <> Неопределено Тогда
		НоваяПозиция.СуммаНДС = СуммаНДСПереоценки;
	КонецЕсли;
	Если ЕстьМарки Тогда
		НоваяПозиция.ПараметрыАлкогольнойПродукции = НовыйАлкоголь;
	КонецЕсли;
	НовыеПозицииЧека.Добавить(НоваяПозиция);
	
КонецПроцедуры

#КонецОбласти


#КонецОбласти