
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
	Если НЕ ЗначениеЗаполнено(Объект.ТипВнешнейСистемы) Тогда
		Параметры.Свойство("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	КонецЕсли;
	
	ЗаполнитьСписокВыбораТипВнешнейСистемы();
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	Элементы.ГруппаИЭМК.Видимость = Объект.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ИЭМК;

	Если Не Объект.Ссылка.Пустая() И Объект.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ИЭМК Тогда
		ПараметрыВнешнейСистемы = Объект.Ссылка.Параметры.Получить();		
		Если ЗначениеЗаполнено(ПараметрыВнешнейСистемы) И ТипЗнч(ПараметрыВнешнейСистемы) = Тип("Структура") Тогда
			ПараметрыВнешнейСистемы.Свойство("guid"		, ЭтотОбъект.guid);
			ПараметрыВнешнейСистемы.Свойство("idLPU"	, ЭтотОбъект.idLPU);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьЭлементов();	
	
КонецПроцедуры

&НаСервере
// Процедура - Перед записью на сервере
//
// Параметры:
//  Отказ			 - 	 - 
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ИЭМК Тогда
		ЗаполнитьПараметрыВнешнейСистемы(ТекущийОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - После записи на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.МобильноеПриложениеУправляющего Тогда
		
		РезультатЗапроса = ЛичныйКабинет.ОбновитьВнешнююСистемуВ_CRM(ТекущийОбъект.Ссылка, Истина, ЛичныйКабинет.УидТекущейСессии());
		
		Если Не РезультатЗапроса.ВыполненоУспешно Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатЗапроса.ОписаниеОшибки + "(" + РезультатЗапроса.КодОшибки + ")"); 
		КонецЕсли;
		
	КонецЕсли;
	
		
КонецПроцедуры

&НаКлиенте
// Процедура - После записи
//
// Параметры:
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	СтруктураОповещения = Новый Структура;
	СтруктураОповещения.Вставить("ВнешняяСистема"	, Объект.Ссылка);
	СтруктураОповещения.Вставить("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	
	Оповестить("ЗаписанаВнешняяСистема", СтруктураОповещения);  
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Скрыть показать дополнительно
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СкрытьПоказатьДополнительно(Команда)
	
	Элементы.ГруппаДополнительно.Видимость = Не Элементы.ГруппаДополнительно.Видимость;
	Элементы.СоздатьКлюч.Доступность 	   = Объект.Ссылка.Пустая();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СоздатьКлюч" 
//
Процедура СоздатьКлюч(Команда)
	
	Объект.КлючПриложения = Строка(Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СоздатьКлючШифрования".
//
Процедура СоздатьКлючШифрования(Команда)
	
	Объект.КлючШифрования = СгенерироватьКодПодтверждения() + СгенерироватьКодПодтверждения();
	
КонецПроцедуры

&НаСервере
// Функция генерирует случайное число от 1000 до 9999
// 
Функция СгенерироватьКодПодтверждения()
	
	ГенераторСлучайныхЧисел = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	Возврат Формат(ГенераторСлучайныхЧисел.СлучайноеЧисло(10000, 99999), "ЧГ=0");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура, устанавливает видимость элементов.
//
Процедура УстановитьВидимостьЭлементов()
	
	Если Объект.ТипВнешнейСистемы = ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.Wallet") Тогда
		
		Элементы.ТокенДоступа.Заголовок   = "Идентификатор клиента";
		Элементы.КлючШифрования.Заголовок = "Секрет клиента";
		Элементы.ТокенДоступа.Видимость            = Истина;
		Элементы.ГруппаКлючПриложения.Видимость    = Ложь;
		Элементы.СоздатьКлючШифрования.Доступность = Ложь;
		
	Иначе
		
		Элементы.ТокенДоступа.Заголовок            = "Токен доступа";
		Элементы.КлючШифрования.Заголовок          = "Ключ шифрования";
		Элементы.ТокенДоступа.Видимость            = Ложь;
		Элементы.ГруппаКлючПриложения.Видимость    = Истина;
		Элементы.СоздатьКлючШифрования.Доступность = Истина;
		
	КонецЕсли;
	
	Если Объект.ТипВнешнейСистемы = ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.МобильноеПриложениеКлиента") 
		ИЛИ Объект.ТипВнешнейСистемы = ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.МобильноеПриложениеУправляющего") Тогда	
		Элементы.КлючШифрованияОбратногоЗвонка.Видимость = Истина;
	Иначе
		Элементы.КлючШифрованияОбратногоЗвонка.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ТипВнешнейСистемыПриИзменении(Элемент)
	
	Если Объект.ТипВнешнейСистемы = ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.ИЭМК") Тогда
		Элементы.ГруппаИЭМК.Видимость = Истина;
	Иначе
		Элементы.ГруппаИЭМК.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.ТипВнешнейСистемы = ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.Wallet") Тогда
		
		Модифицированность = Ложь;
		ЭтаФорма.Закрыть();
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", 
		Новый Структура("ТипВнешнейСистемы", ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.Wallet")));	
		ОткрытьФорму("Справочник.ВнешниеСистемы.Форма.ФормаНастройкиЭлектронныхКартWallet", ПараметрыФормы);
		
	ИначеЕсли Объект.ТипВнешнейСистемы = ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.Calltouch") Тогда
		
		Модифицированность = Ложь;
		ЭтаФорма.Закрыть();
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", 
		Новый Структура("ТипВнешнейСистемы", ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.Calltouch")));	
		ОткрытьФорму("Справочник.ВнешниеСистемы.Форма.ФормаЭлементаCalltouch", ПараметрыФормы);
		
	ИначеЕсли Объект.ТипВнешнейСистемы = ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.Roistat") Тогда
		
		Модифицированность = Ложь;
		ЭтаФорма.Закрыть();
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", 
		Новый Структура("ТипВнешнейСистемы", ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.Roistat")));	
		ОткрытьФорму("Справочник.ВнешниеСистемы.Форма.ФормаЭлементаRoistat", ПараметрыФормы);
		
	ИначеЕсли Объект.ТипВнешнейСистемы = ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.Webhook") Тогда
		
		Модифицированность = Ложь;
		ЭтаФорма.Закрыть();
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", 
		Новый Структура("ТипВнешнейСистемы", ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.Webhook")));	
		ОткрытьФорму("Справочник.ВнешниеСистемы.Форма.ФормаЭлементаWebhook", ПараметрыФормы);
		
	ИначеЕсли Объект.ТипВнешнейСистемы = ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.ЯндексМетрика") Тогда
		
		Модифицированность = Ложь;
		ЭтаФорма.Закрыть();
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", 
		Новый Структура("ТипВнешнейСистемы", ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.ЯндексМетрика")));	
		ОткрытьФорму("Справочник.ВнешниеСистемы.Форма.ФормаЭлементаЯндексМетрика", ПараметрыФормы);
		
	ИначеЕсли Объект.ТипВнешнейСистемы = ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.ПроДокторов") Тогда
		
		Модифицированность = Ложь;
		ЭтаФорма.Закрыть();
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", 
		Новый Структура("ТипВнешнейСистемы", ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.ПроДокторов")));	
		ОткрытьФорму("Справочник.ВнешниеСистемы.Форма.ФормаЭлементаПроДокторов", ПараметрыФормы);
		
	КонецЕсли;
	
	Если Объект.ТипВнешнейСистемы = ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.МобильноеПриложениеУправляющего") Тогда
		
		Объект.КлючШифрованияОбратногоЗвонка = Новый УникальныйИдентификатор();    
		Элементы.КлючШифрованияОбратногоЗвонка.Видимость = Истина;

	Иначе
		Объект.КлючШифрованияОбратногоЗвонка = Неопределено;	    
		Элементы.КлючШифрованияОбратногоЗвонка.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура, заполняет параметры внешней системы.
//
Процедура ЗаполнитьПараметрыВнешнейСистемы(ТекущийОбъект)
	
	ПараметрыВнешнейСистемы = Новый Структура;
	ПараметрыВнешнейСистемы.Вставить("guid"			, ЭтотОбъект.guid);
	ПараметрыВнешнейСистемы.Вставить("idLPU"		, ЭтотОбъект.idLPU);
	
	ТекущийОбъект.Параметры = Новый ХранилищеЗначения(ПараметрыВнешнейСистемы);
	
КонецПроцедуры

&НаСервере
// Функция - Получить список типов внешних систем
// 
// Возвращаемое значение:
//   - 
//
Процедура ЗаполнитьСписокВыбораТипВнешнейСистемы()
		
	НовыйМассив = Новый Массив();
	Для Каждого ТипВнешнСистемы Из Перечисления.ТипыВнешнихСистем Цикл
		
		Если ТипВнешнСистемы <> Перечисления.ТипыВнешнихСистем.TapLink 
			И ТипВнешнСистемы <> Перечисления.ТипыВнешнихСистем.Tilda 
			И ТипВнешнСистемы <> Перечисления.ТипыВнешнихСистем.Vkontakte 
			И ТипВнешнСистемы <> Перечисления.ТипыВнешнихСистем.Marquiz
			И ТипВнешнСистемы <> Перечисления.ТипыВнешнихСистем.JivoSite
            И ТипВнешнСистемы <> Перечисления.ТипыВнешнихСистем.Chat2Desk 
			И ТипВнешнСистемы <> Перечисления.ТипыВнешнихСистем.МобильноеПриложениеУправляющего
			И ТипВнешнСистемы <> Перечисления.ТипыВнешнихСистем.ОценкиИОтзывы 
			И ТипВнешнСистемы <> Перечисления.ТипыВнешнихСистем.КонтурСтрахование Тогда
			НовыйМассив.Добавить(ТипВнешнСистемы);
		КонецЕсли;
		
	КонецЦикла;
	
	НовыеЗначения = Новый ФиксированныйМассив(НовыйМассив);
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", НовыеЗначения);
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.ТипВнешнейСистемы.ПараметрыВыбора = НовыеПараметры;	
	
КонецПроцедуры

#КонецОбласти
