////////////////////////////////////////////////////////////////////////////////
// Проверка одного или нескольких контрагентов при помощи веб-сервиса ФНС
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает состояние действующего контрагента.
// 
Функция ЭтоСостояниеДействующегоКонтрагента(Состояние, ДополнятьСостояниемСОшибкой = Истина, ДополнятьПустымСостоянием = Истина) Экспорт
	
	СостоянияДействующегоКонтрагента = СостоянияДействующегоКонтрагента(ДополнятьСостояниемСОшибкой, ДополнятьПустымСостоянием);
	Возврат СостоянияДействующегоКонтрагента.Найти(Состояние) <> Неопределено;
			
КонецФункции

// Функция возвращает состояние действующего контрагента.
// 
Функция СостоянияДействующегоКонтрагента(ДополнятьСостояниемСОшибкой = Истина, ДополнятьПустымСостоянием = Истина) Экспорт
	
	МассивСостояний = Новый Массив;
	МассивСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСуществованияКонтрагента.Действует"));
	МассивСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСуществованияКонтрагента.НеПодлежитПроверке"));
	ДобавитьДополнительныеСостояния(МассивСостояний, ДополнятьСостояниемСОшибкой, ДополнятьПустымСостоянием);
	
	Возврат МассивСостояний;
			
КонецФункции

// Функция возвращает состояние недействующего контрагента.
// 
Функция ЭтоСостояниеНедействующегоКонтрагента(Состояние, ДополнятьСостояниемСОшибкой = Ложь, ДополнятьПустымСостоянием = Ложь) Экспорт
	
	СостоянияНедействующегоКонтрагента = СостоянияНедействующегоКонтрагента(ДополнятьСостояниемСОшибкой, ДополнятьПустымСостоянием);
	Возврат СостоянияНедействующегоКонтрагента.Найти(Состояние) <> Неопределено;
			
КонецФункции
		
// Функция возвращает состояние недействующего контрагента.
// 
Функция СостоянияНедействующегоКонтрагента(ДополнятьСостояниемСОшибкой = Ложь, ДополнятьПустымСостоянием = Ложь) Экспорт
	
	МассивСостояний = Новый Массив;
	МассивСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСуществованияКонтрагента.КППНеСоответствуетИНН"));
	МассивСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСуществованияКонтрагента.ОтсутствуетВРеестре"));
	МассивСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСуществованияКонтрагента.ПрекратилДеятельность"));
	ДобавитьДополнительныеСостояния(МассивСостояний, ДополнятьСостояниемСОшибкой, ДополнятьПустымСостоянием);
	
	Возврат МассивСостояний;
			
КонецФункции

// Функция возвращает ссылку на инструкцию.
// 
Функция СсылкаНаИнструкцию() Экспорт
	Возврат Новый ФорматированнаяСтрока(НСтр("ru = 'Подробнее о проверке'"),,,,"e1cib/app/Обработка.ИнструкцияПоИспользованиюПроверкиКонтрагента");
КонецФункции

// Проверяет соответствие ИНН требованиям.
// 
// Параметры:
//  ИНН          	- Строка - Проверяемый индивидуальный номер налогоплательщика.
//  ЭтоЮрЛицо   	- Булево - признак, является ли владелец ИНН юридическим лицом.
//  ТекстСообщения 	- Строка - Текст сообщения о найденных ошибках.
// 
// Возвращаемое значение:
//  Истина       - ИНН соответствует требованиям;
//  Ложь         - ИНН не соответствует требованиям.
// 
Функция ИННСоответствуетТребованиям(Знач ИНН, ЭтоЮрЛицо, ТекстСообщения) Экспорт

	СоответствуетТребованиям = Истина;
	ТекстСообщения = "";

	ИНН      = СокрЛП(ИНН);
	ДлинаИНН = СтрДлина(ИНН);

	Если ЭтоЮрЛицо = Неопределено Тогда
	   	ТекстСообщения = ТекстСообщения + НСтр("ru = 'Не определен тип владельца ИНН.'");
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ИНН) Тогда
		СоответствуетТребованиям = Ложь;
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'ИНН должен состоять только из цифр.'");
	КонецЕсли;
	
	СтранаУчетаУкраина = ПроверкаКонтрагентовВызовСервера.СтранаУчетаУкраина();				
	ДлинаИНН_ФЛ = ?(СтранаУчетаУкраина, 10, 12);
	
	Если  ЭтоЮрЛицо  И ДлинаИНН <> 10 Тогда
		СоответствуетТребованиям = Ложь;
		ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "")
		               + НСтр("ru = 'ИНН юридического лица должен состоять из 10 цифр.'");
	ИначеЕсли НЕ ЭтоЮрЛицо  И ДлинаИНН <> ДлинаИНН_ФЛ Тогда
		СоответствуетТребованиям = Ложь;
		ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "")
		               + НСтр("ru = 'ИНН физического лица должен состоять из " + ДлинаИНН_ФЛ + " цифр.'");
	КонецЕсли;

	Если СоответствуетТребованиям И НЕ СтранаУчетаУкраина Тогда

		Если ЭтоЮрЛицо Тогда

			КонтрольнаяСумма = 0;

			Для Н = 1 По 9 Цикл

				Если Н = 1 Тогда
					Множитель = 2;
				ИначеЕсли Н = 2 Тогда
					Множитель = 4;
				ИначеЕсли Н = 3 Тогда
					Множитель = 10;
				ИначеЕсли Н = 4 Тогда
					Множитель = 3;
				ИначеЕсли Н = 5 Тогда
					Множитель = 5;
				ИначеЕсли Н = 6 Тогда
					Множитель = 9;
				ИначеЕсли Н = 7 Тогда
					Множитель = 4;
				ИначеЕсли Н = 8 Тогда
					Множитель = 6;
				ИначеЕсли Н = 9 Тогда
					Множитель = 8;
				КонецЕсли;

				Цифра = Число(Сред(ИНН, Н, 1));
				КонтрольнаяСумма = КонтрольнаяСумма + Цифра * Множитель;

			КонецЦикла;
			
			КонтрольныйРазряд = (КонтрольнаяСумма %11) %10;

			Если КонтрольныйРазряд <> Число(Сред(ИНН, 10, 1)) Тогда
				СоответствуетТребованиям = Ложь;
				ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "")
				               + НСтр("ru = 'Контрольное число для ИНН не совпадает с рассчитанным.'");
			КонецЕсли;

		Иначе

			КонтрольнаяСумма11 = 0;
			КонтрольнаяСумма12 = 0;

			Для Н=1 По 11 Цикл

				// Расчет множителя для 11-го и 12-го разрядов
				Если Н = 1 Тогда
					Множитель11 = 7;
					Множитель12 = 3;
				ИначеЕсли Н = 2 Тогда
					Множитель11 = 2;
					Множитель12 = 7;
				ИначеЕсли Н = 3 Тогда
					Множитель11 = 4;
					Множитель12 = 2;
				ИначеЕсли Н = 4 Тогда
					Множитель11 = 10;
					Множитель12 = 4;
				ИначеЕсли Н = 5 Тогда
					Множитель11 = 3;
					Множитель12 = 10;
				ИначеЕсли Н = 6 Тогда
					Множитель11 = 5;
					Множитель12 = 3;
				ИначеЕсли Н = 7 Тогда
					Множитель11 = 9;
					Множитель12 = 5;
				ИначеЕсли Н = 8 Тогда
					Множитель11 = 4;
					Множитель12 = 9;
				ИначеЕсли Н = 9 Тогда
					Множитель11 = 6;
					Множитель12 = 4;
				ИначеЕсли Н = 10 Тогда
					Множитель11 = 8;
					Множитель12 = 6;
				ИначеЕсли Н = 11 Тогда
					Множитель11 = 0;
					Множитель12 = 8;
				КонецЕсли;

				Цифра = Число(Сред(ИНН, Н, 1));
				КонтрольнаяСумма11 = КонтрольнаяСумма11 + Цифра * Множитель11;
				КонтрольнаяСумма12 = КонтрольнаяСумма12 + Цифра * Множитель12;

			КонецЦикла;

			КонтрольныйРазряд11 = (КонтрольнаяСумма11 %11) %10;
			КонтрольныйРазряд12 = (КонтрольнаяСумма12 %11) %10;

			Если КонтрольныйРазряд11 <> Число(Сред(ИНН,11,1)) ИЛИ КонтрольныйРазряд12 <> Число(Сред(ИНН,12,1)) Тогда
				СоответствуетТребованиям = Ложь;
				ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "")
				               + НСтр("ru = 'Контрольное число для ИНН не совпадает с рассчитанным.'");
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	Возврат СоответствуетТребованиям;

КонецФункции 

// Проверяет соответствие КПП требованиям.
// 
// Параметры:
//  КПП          - Строка - Проверяемый код причины постановки на учет.
//  ТекстСообщения - Строка - Текст сообщения о найденных ошибках.
// 
// Возвращаемое значение:
//  Истина       - КПП соответствует требованиям;
//  Ложь         - КПП не соответствует требованиям.
// 
Функция КППСоответствуетТребованиям(Знач КПП, ТекстСообщения) Экспорт

	СоответствуетТребованиям = Истина;
	ТекстСообщения           = "";

	КПП      = СокрЛП(КПП);
	ДлинаКПП = СтрДлина(КПП);

	Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(КПП) Тогда
		СоответствуетТребованиям = Ложь;
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'КПП должен состоять только из цифр.'");
	КонецЕсли;

	Если ДлинаКПП <> 9 Тогда
		СоответствуетТребованиям = Ложь;
		ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "") +
			НСтр("ru = 'КПП должен состоять из 9 цифр.'");
	КонецЕсли;

	Возврат СоответствуетТребованиям;

КонецФункции 

// Процедура выполняет проверку корректности введенных ИНН и КПП
// Принимает на вход структуру
// Параметры передачи - структура
// Обязательные ключи структуры
// 	ИНН
// 	КПП
// 	ЭтоЮрЛицо
// 	ОшибокПоИННнет
// 	ОшибокПоКППнет
// Дополнительные ключи структуры
// 	ЦветВыделенияНекорректногоЗначения
// 
// Возвращает структуру с переменным набором ключей 
// только со значениями соответствующими результату проверки.
Функция ПроверитьКорректностьИННКПП(Знач СтруктураПараметров) Экспорт
	
	ЦветВыделенияНекорректногоЗначения = Новый Цвет(225, 40, 40);
	
	СтруктураВозврата = Новый Структура;
	
	Если СтруктураПараметров.ПроверитьИНН Тогда
		
		СтруктураВозврата.Вставить("ИННВведенКорректно",               Истина);
		СтруктураВозврата.Вставить("РасширенноеПредставлениеИНН",      СтруктураПараметров.ИНН);
		СтруктураВозврата.Вставить("НадписьПоясненияНекорректногоИНН", "");
		СтруктураВозврата.Вставить("ПустойИНН",                        Ложь);
		СтруктураВозврата.Вставить("ОшибокПоИННнет",                   СтруктураПараметров.ПроверитьИНН);
		
		ИНН      = СокрП(СтруктураПараметров.ИНН);
		ДлинаИНН = СтрДлина(ИНН);
		
		Если НЕ ЗначениеЗаполнено(ИНН) Тогда
			
			СтруктураВозврата.ИННВведенКорректно = Ложь;
			
			СтруктураВозврата.НадписьПоясненияНекорректногоИНН = Неопределено;
			
			СтруктураВозврата.ПустойИНН = Истина;
			
			СтруктураВозврата.ОшибокПоИННнет = Ложь;
			
		КонецЕсли;
		
		Если СтруктураВозврата.ОшибокПоИННнет Тогда
			
			ЭтоЮрЛицо = Неопределено;
			СтруктураПараметров.Свойство("ЭтоЮрЛицо", ЭтоЮрЛицо);
			
			Если ЭтоЮрЛицо = Неопределено Тогда
				
				СтруктураВозврата.ИННВведенКорректно = Ложь;
				СтруктураВозврата.НадписьПоясненияНекорректногоИНН = Новый ФорматированнаяСтрока(НСтр("ru = 'Неизвестен вид контрагента. Укажите вид контрагента'"),,ЦветВыделенияНекорректногоЗначения);
				
				СтруктураВозврата.ОшибокПоИННнет = Ложь;
				
			КонецЕсли;
								
			Если СтруктураВозврата.ОшибокПоИННнет Тогда
				
				СтранаУчетаУкраина = ПроверкаКонтрагентовВызовСервера.СтранаУчетаУкраина();				
				ДлинаИНН_ФЛ = ?(СтранаУчетаУкраина, 10, 12);
				
				Если  ЭтоЮрЛицо И ДлинаИНН <> 10 Тогда
					
					СтруктураВозврата.ИННВведенКорректно = Ложь;
					
					СтруктураВозврата.НадписьПоясненияНекорректногоИНН = Новый ФорматированнаяСтрока(НСтр("ru = 'ИНН юридического лица должен состоять из 10 цифр'"),,ЦветВыделенияНекорректногоЗначения);
					
					ТекстДляНекорректногоИНН = НСтр("ru = '%1
					|ИНН содержит не 10 цифр'");
					
					СтруктураВозврата.РасширенноеПредставлениеИНН = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстДляНекорректногоИНН, ИНН);
					
					СтруктураВозврата.ОшибокПоИННнет = Ложь;
					
				ИначеЕсли НЕ ЭтоЮрЛицо И ДлинаИНН <> ДлинаИНН_ФЛ Тогда
					
					СтруктураВозврата.ИННВведенКорректно = Ложь;
					
					СтруктураВозврата.НадписьПоясненияНекорректногоИНН = Новый ФорматированнаяСтрока(НСтр("ru = 'ИНН физического лица должен состоять из " + ДлинаИНН_ФЛ + " цифр'"),,ЦветВыделенияНекорректногоЗначения);
					
					ТекстДляНекорректногоИНН = НСтр("ru = '%1
					|ИНН содержит не " + ДлинаИНН_ФЛ + " цифр'");
					
					СтруктураВозврата.РасширенноеПредставлениеИНН = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстДляНекорректногоИНН, ИНН);
					
					СтруктураВозврата.ОшибокПоИННнет = Ложь;
					
				ИначеЕсли Лев(ИНН, 2) = "00" Тогда
					
					СтруктураВозврата.ИННВведенКорректно = Ложь;
					
					СтруктураВозврата.НадписьПоясненияНекорректногоИНН = Новый ФорматированнаяСтрока(НСтр("ru = 'Первые две цифры ИНН не могут быть ""00""'"),,ЦветВыделенияНекорректногоЗначения);
					
					ТекстДляНекорректногоИНН = НСтр("ru = '%1
					|Первые две цифры ИНН не могут быть ""00""'");
					
					СтруктураВозврата.РасширенноеПредставлениеИНН = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстДляНекорректногоИНН, ИНН);
					
					СтруктураВозврата.ОшибокПоИННнет = Ложь;
					
				КонецЕсли;
				
				Если СтруктураВозврата.ОшибокПоИННнет Тогда
					
					Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ИНН) Тогда
						
						СтруктураВозврата.ИННВведенКорректно = Ложь;
						
						СтруктураВозврата.НадписьПоясненияНекорректногоИНН = Новый ФорматированнаяСтрока(НСтр("ru = 'ИНН должен включать только цифры'"),,ЦветВыделенияНекорректногоЗначения);
						
						ТекстДляНекорректногоИНН = НСтр("ru = '%1
						|ИНН содержит не только цифры'");
						
						СтруктураВозврата.РасширенноеПредставлениеИНН = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстДляНекорректногоИНН, ИНН);
						
						СтруктураВозврата.ОшибокПоИННнет = Ложь;
						
					КонецЕсли;
					
					Если СтруктураВозврата.ОшибокПоИННнет И НЕ СтранаУчетаУкраина Тогда
						
						Если ЭтоЮрЛицо Тогда
							
							КонтрольнаяСумма = 0;
							
							Для Н = 1 По 9 Цикл
								
								Если Н = 1 Тогда
									Множитель = 2;
								ИначеЕсли Н = 2 Тогда
									Множитель = 4;
								ИначеЕсли Н = 3 Тогда
									Множитель = 10;
								ИначеЕсли Н = 4 Тогда
									Множитель = 3;
								ИначеЕсли Н = 5 Тогда
									Множитель = 5;
								ИначеЕсли Н = 6 Тогда
									Множитель = 9;
								ИначеЕсли Н = 7 Тогда
									Множитель = 4;
								ИначеЕсли Н = 8 Тогда
									Множитель = 6;
								ИначеЕсли Н = 9 Тогда
									Множитель = 8;
								КонецЕсли;
								
								Цифра = Число(Сред(ИНН, Н, 1));
								КонтрольнаяСумма = КонтрольнаяСумма + Цифра * Множитель;
								
							КонецЦикла;
							
							КонтрольныйРазряд = (КонтрольнаяСумма %11) %10;
							
							Если КонтрольныйРазряд <> Число(Сред(ИНН, 10, 1)) или КонтрольнаяСумма = 0 Тогда
								
								СтруктураВозврата.ИННВведенКорректно = Ложь;
								
								СтруктураВозврата.НадписьПоясненияНекорректногоИНН = Новый ФорматированнаяСтрока(НСтр("ru = 'ИНН юридического лица введен некорректно'"),,ЦветВыделенияНекорректногоЗначения);
								
								ТекстДляНекорректногоИНН = НСтр("ru = '%1
								|ИНН не соответствует формату'");
								
								СтруктураВозврата.РасширенноеПредставлениеИНН = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстДляНекорректногоИНН, ИНН);
								
								СтруктураВозврата.ОшибокПоИННнет = Ложь;
								
							КонецЕсли;
							
						Иначе
							
							КонтрольнаяСумма11 = 0;
							КонтрольнаяСумма12 = 0;
							
							Для Н=1 По 11 Цикл
								
								// Расчет множителя для 11-го и 12-го разрядов
								Если Н = 1 Тогда
									Множитель11 = 7;
									Множитель12 = 3;
								ИначеЕсли Н = 2 Тогда
									Множитель11 = 2;
									Множитель12 = 7;
								ИначеЕсли Н = 3 Тогда
									Множитель11 = 4;
									Множитель12 = 2;
								ИначеЕсли Н = 4 Тогда
									Множитель11 = 10;
									Множитель12 = 4;
								ИначеЕсли Н = 5 Тогда
									Множитель11 = 3;
									Множитель12 = 10;
								ИначеЕсли Н = 6 Тогда
									Множитель11 = 5;
									Множитель12 = 3;
								ИначеЕсли Н = 7 Тогда
									Множитель11 = 9;
									Множитель12 = 5;
								ИначеЕсли Н = 8 Тогда
									Множитель11 = 4;
									Множитель12 = 9;
								ИначеЕсли Н = 9 Тогда
									Множитель11 = 6;
									Множитель12 = 4;
								ИначеЕсли Н = 10 Тогда
									Множитель11 = 8;
									Множитель12 = 6;
								ИначеЕсли Н = 11 Тогда
									Множитель11 = 0;
									Множитель12 = 8;
								КонецЕсли;
								
								Цифра = Число(Сред(ИНН, Н, 1));
								КонтрольнаяСумма11 = КонтрольнаяСумма11 + Цифра * Множитель11;
								КонтрольнаяСумма12 = КонтрольнаяСумма12 + Цифра * Множитель12;
								
							КонецЦикла;
							
							КонтрольныйРазряд11 = (КонтрольнаяСумма11 %11) %10;
							КонтрольныйРазряд12 = (КонтрольнаяСумма12 %11) %10;
							
							Если КонтрольныйРазряд11 <> Число(Сред(ИНН,11,1)) ИЛИ КонтрольныйРазряд12 <> Число(Сред(ИНН,12,1)) или (КонтрольнаяСумма11 = 0 и КонтрольнаяСумма12 = 0) Тогда
								
								СтруктураВозврата.ИННВведенКорректно = Ложь;
								
								СтруктураВозврата.НадписьПоясненияНекорректногоИНН = Новый ФорматированнаяСтрока(НСтр("ru = 'ИНН физического лица введен некорректно'"),,ЦветВыделенияНекорректногоЗначения);
								
								ТекстДляНекорректногоИНН = НСтр("ru = '%1
								|ИНН не соответствует формату'");
								
								СтруктураВозврата.РасширенноеПредставлениеИНН = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстДляНекорректногоИНН, ИНН);
								
								СтруктураВозврата.ОшибокПоИННнет = Ложь;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураПараметров.ПроверитьКПП Тогда
		
		СтруктураВозврата.Вставить("КППВВеденКорректно",               Истина);
		СтруктураВозврата.Вставить("РасширенноеПредставлениеКПП",      СтруктураПараметров.КПП);
		СтруктураВозврата.Вставить("НадписьПоясненияНекорректногоКПП", "");
		СтруктураВозврата.Вставить("ПустойКПП",                        Ложь);
		СтруктураВозврата.Вставить("ОшибокПоКППнет",                   СтруктураПараметров.ПроверитьКПП);
		
		ЭтоЮрЛицо = Неопределено;
		СтруктураПараметров.Свойство("ЭтоЮрЛицо", ЭтоЮрЛицо);
		
		Если ЭтоЮрЛицо = Неопределено Тогда
			
			СтруктураВозврата.КППВведенКорректно = Ложь;
			
			СтруктураВозврата.НадписьПоясненияНекорректногоКПП = Новый ФорматированнаяСтрока(НСтр("ru = 'Неизвестен вид контрагента. Укажите вид контрагента'"),,ЦветВыделенияНекорректногоЗначения);
			
			СтруктураВозврата.ОшибокПоКППнет = Ложь;
			
		ИначеЕсли НЕ ЭтоЮрЛицо Тогда
			СтруктураВозврата.ОшибокПоКППнет = Ложь;
		КонецЕсли;
		
		Если СтруктураВозврата.ОшибокПоКППнет Тогда
			
			КПП = СокрП(СтруктураПараметров.КПП);
			ДлинаКПП = СтрДлина(КПП);
			
			Если НЕ ЗначениеЗаполнено(КПП) Тогда
				
				СтруктураВозврата.КППВВеденКорректно = Ложь;
				
				СтруктураВозврата.НадписьПоясненияНекорректногоКПП = Неопределено;
				
				СтруктураВозврата.ПустойКПП = Истина;
				
				СтруктураВозврата.ОшибокПоКППнет = Ложь;
				
			КонецЕсли;
			
			Если СтруктураВозврата.ОшибокПоКППнет Тогда
				
				Если ДлинаКПП <> 9 Тогда
					
					СтруктураВозврата.КППВВеденКорректно = Ложь;
					
					СтруктураВозврата.НадписьПоясненияНекорректногоКПП  = Новый ФорматированнаяСтрока(НСтр("ru = 'КПП должен содержать 9 цифр'"),,ЦветВыделенияНекорректногоЗначения);
					
					ТекстДляНекорректногоКПП = НСтр("ru = '%1
					|КПП содержит не 9 цифр'");
					
					СтруктураВозврата.РасширенноеПредставлениеКПП = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстДляНекорректногоКПП, КПП);
					
					СтруктураВозврата.ОшибокПоКППнет = Ложь;
					
				КонецЕсли;
				
				Если СтруктураВозврата.ОшибокПоКППнет Тогда
					
					Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(КПП) Тогда
						
						СтруктураВозврата.КППВВеденКорректно = Ложь;
						
						СтруктураВозврата.НадписьПоясненияНекорректногоКПП = Новый ФорматированнаяСтрока(НСтр("ru = 'КПП должен включать только цифры'"),,ЦветВыделенияНекорректногоЗначения);
						
						ТекстДляНекорректногоКПП = НСтр("ru = '%1
						|КПП содержит не только цифры'");
						
						СтруктураВозврата.РасширенноеПредставлениеКПП = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстДляНекорректногоКПП, КПП);
						
						СтруктураВозврата.ОшибокПоКППнет = Ложь;
						
					КонецЕсли;
					
					Если СтруктураВозврата.ОшибокПоКППнет Тогда
						
						КонтрольнаяЧасть = Сред(КПП, 5, 2);
						
						ПризнакОбособленногоПодразделения = КонтрольнаяЧасть = "02" //Постановка на учёт налогоплательщика — российской организации по месту нахождения ее обособленного подразделения в зависимости от вида подразделения 
						или КонтрольнаяЧасть = "03" // Постановка на учёт налогоплательщика — российской организации по месту нахождения ее филиала, не исполняющего обязанности организации по уплате налогов и сборов 
						или КонтрольнаяЧасть = "04" // Постановка на учёт налогоплательщика — российской организации по месту нахождения ее обособленного подразделения в зависимости от вида подразделения 
						или КонтрольнаяЧасть = "05" // Постановка на учёт налогоплательщика — российской организации по месту нахождения ее обособленного подразделения в зависимости от вида подразделения
						или КонтрольнаяЧасть = "30" // Российская организация — налоговый агент, не учтенная в качестве налогоплательщика
						или КонтрольнаяЧасть = "31" // Постановка на учёт налогоплательщика — российской организации по месту нахождения обособленного подразделения, в отношении которого не проведена процедура оформления в соответствии с пунктом 3 статьи 55 Гражданского кодекса Российской Федерации, исполняющего обязанности организации по уплате налогов и сборов 
						или КонтрольнаяЧасть = "32" // Постановка на учёт налогоплательщика — российской организации по месту нахождения обособленного подразделения, в отношении которого не проведена процедура оформления в соответствии с пунктом 3 статьи 55 Гражданского кодекса Российской Федерации, не исполняющего обязанности организации по уплате налогов и сборов 
						или КонтрольнаяЧасть = "43" // Постановка на учёт российской организации по месту нахождения ее филиала (аналогично старым кодам «02», «03» — Письмо Минфина РФ от 02.06.2008 № ЧД-6-6/396@ «О применении кодов справочника СППУНО») 
						или КонтрольнаяЧасть = "44" // Постановка на учёт российской организации по месту нахождения ее представительства (аналогично старым кодам «04», «05» — Письмо Минфина РФ от 02.06.2008 № ЧД-6-6/396@ «О применении кодов справочника СППУНО») 
						или КонтрольнаяЧасть = "45";// Постановка на учёт российской организации по месту нахождения ее обособленного подразделения (аналогично старым кодам «31», «32» — Письмо Минфина РФ от 02.06.2008 № ЧД-6-6/396@ «О применении кодов справочника СППУНО»)
						
						ПризнакГоловногоПодразделения = КонтрольнаяЧасть = "01" 
						или КонтрольнаяЧасть = "50" // По месту постановки на учёт в качестве крупнейшего налогоплательщика
						или КонтрольнаяЧасть = "51" // Постановка на учёт отделений иностранных организаций 
						или КонтрольнаяЧасть = "52" // Постановка на учёт отделений иностранных организаций в Российской Федерации, созданных филиалом этой иностранной организации в иностранном государстве 
						или КонтрольнаяЧасть = "60" // Постановка на учёт посольств иностранных государств
						или КонтрольнаяЧасть = "61" // Постановка на учёт консульств иностранных государств
						или КонтрольнаяЧасть = "62" // Постановка на учёт представительств, приравненных к дипломатическим
						или КонтрольнаяЧасть = "63" // Постановка на учёт международных организаций
						или КонтрольнаяЧасть = "70" // Постановка на учёт иностранных и международных организаций, имеющих недвижимое имущество в Российской Федерации, за исключением транспортных средств, относящихся к недвижимому имуществу
						или КонтрольнаяЧасть = "71" // Постановка на учёт иностранных и международных организаций, имеющих транспортные средства в Российской Федерации, не относящиеся к недвижимому имуществу
						или КонтрольнаяЧасть = "72" // Постановка на учёт иностранных и международных организаций, имеющих морские транспортные средства в Российской Федерации
						или КонтрольнаяЧасть = "73" // Постановка на учёт иностранных и международных организаций, имеющих речные транспортные средства в Российской Федерации
						или КонтрольнаяЧасть = "74" // Постановка на учёт иностранных и международных организаций, имеющих воздушные транспортные средства в Российской Федерации
						или КонтрольнаяЧасть = "75" // Постановка на учёт иностранных и международных организаций, имеющих космические объекты в Российской Федерации
						или КонтрольнаяЧасть = "80" // Учет иностранных и международных организаций в связи с открытием в банках рублевых счетов типа «Т» (текущие)
						или КонтрольнаяЧасть = "81" // Учет иностранных и международных организаций в связи с открытием счетов в банках типа «И» (инвестиционные)
						или КонтрольнаяЧасть = "82" // учёт иностранных и международных организаций в связи с открытием счетов в банках типа «С» (специальные)
						или КонтрольнаяЧасть = "83" // Учет иностранных и международных организаций в связи с открытием в банках счетов типа «Т» (текущие) в иностранной валюте
						или КонтрольнаяЧасть = "84";// Учет иностранных и международных организаций в связи с открытием корреспондентских счетов в банках 
						
						Если НЕ ПризнакГоловногоПодразделения и НЕ ПризнакОбособленногоПодразделения Тогда
							
							СтруктураВозврата.КППВВеденКорректно = Ложь;
							
							СтруктураВозврата.НадписьПоясненияНекорректногоКПП = Новый ФорматированнаяСтрока(НСтр("ru = 'КПП не соответствует формату'"),,ЦветВыделенияНекорректногоЗначения);
							
							ТекстДляНекорректногоКПП = НСтр("ru = '%1
							|КПП не соответствует формату'");
							
							СтруктураВозврата.РасширенноеПредставлениеКПП = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстДляНекорректногоКПП, КПП);
							
							СтруктураВозврата.ОшибокПоКППнет = Ложь;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	Если СтруктураПараметров.ПроверитьОКПО Тогда
		
		СтруктураВозврата.Вставить("ОКПОВведенКорректно",               Истина);
		СтруктураВозврата.Вставить("РасширенноеПредставлениеОКПО",      СтруктураПараметров.ОКПО);
		СтруктураВозврата.Вставить("НадписьПоясненияНекорректногоОКПО", "");
		СтруктураВозврата.Вставить("ПустойОКПО",                        Ложь);
		СтруктураВозврата.Вставить("ОшибокПоОКПОнет",                   СтруктураПараметров.ПроверитьОКПО);
		
		ОКПО      = СокрП(СтруктураПараметров.ОКПО);
		ДлинаОКПО = СтрДлина(ОКПО);
		
		Если НЕ ЗначениеЗаполнено(ОКПО) Тогда
			
			СтруктураВозврата.ОКПОВведенКорректно = Ложь;
			
			СтруктураВозврата.НадписьПоясненияНекорректногоОКПО = Неопределено;
			
			СтруктураВозврата.ПустойОКПО = Истина;
			
			СтруктураВозврата.ОшибокПоОКПОнет = Ложь;
			
		КонецЕсли;
		
		Если СтруктураВозврата.ОшибокПоОКПОнет Тогда
			
			ЭтоЮрЛицо = Неопределено;
			СтруктураПараметров.Свойство("ЭтоЮрЛицо", ЭтоЮрЛицо);
			
			Если ЭтоЮрЛицо = Неопределено Тогда
				
				СтруктураВозврата.ОКПОВведенКорректно = Ложь;
				СтруктураВозврата.НадписьПоясненияНекорректногоОКПО = Новый ФорматированнаяСтрока(НСтр("ru = 'Неизвестен вид контрагента. Укажите вид контрагента'"),,ЦветВыделенияНекорректногоЗначения);
				
				СтруктураВозврата.ОшибокПоОКПОнет = Ложь;
				
			КонецЕсли;
								
			Если СтруктураВозврата.ОшибокПоОКПОнет Тогда
				
				СтранаУчетаУкраина = ПроверкаКонтрагентовВызовСервера.СтранаУчетаУкраина();				
				ДлинаОКПО_ФЛ = ?(СтранаУчетаУкраина, 8, 10);
				
				Если  ЭтоЮрЛицо И ДлинаОКПО <> 8 Тогда
					
					СтруктураВозврата.ОКПОВведенКорректно = Ложь;
					
					СтруктураВозврата.НадписьПоясненияНекорректногоОКПО = Новый ФорматированнаяСтрока(НСтр("ru = 'ОКПО юридического лица должен состоять из 8 цифр'"),,ЦветВыделенияНекорректногоЗначения);
					
					ТекстДляНекорректногоОКПО = НСтр("ru = '%1
					|ОКПО содержит не 8 цифр'");
					
					СтруктураВозврата.РасширенноеПредставлениеОКПО = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстДляНекорректногоОКПО, ОКПО);
					
					СтруктураВозврата.ОшибокПоОКПОнет = Ложь;
					
				ИначеЕсли НЕ ЭтоЮрЛицо И ДлинаОКПО <> ДлинаОКПО_ФЛ Тогда
					
					СтруктураВозврата.ОКПОВведенКорректно = Ложь;
					
					СтруктураВозврата.НадписьПоясненияНекорректногоОКПО = Новый ФорматированнаяСтрока(НСтр("ru = 'ОКПО физического лица должен состоять из " + ДлинаОКПО_ФЛ + " цифр'"),,ЦветВыделенияНекорректногоЗначения);
					
					ТекстДляНекорректногоОКПО = НСтр("ru = '%1
					|ОКПО содержит не " + ДлинаОКПО_ФЛ + " цифр'");
					
					СтруктураВозврата.РасширенноеПредставлениеОКПО = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстДляНекорректногоОКПО, ОКПО);
					
					СтруктураВозврата.ОшибокПоОКПОнет = Ложь;
										
				КонецЕсли;
				
				Если СтруктураВозврата.ОшибокПоОКПОнет Тогда
					
					Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ОКПО) Тогда
						
						СтруктураВозврата.ОКПОВведенКорректно = Ложь;
						
						СтруктураВозврата.НадписьПоясненияНекорректногоОКПО = Новый ФорматированнаяСтрока(НСтр("ru = 'ОКПО должен включать только цифры'"),,ЦветВыделенияНекорректногоЗначения);
						
						ТекстДляНекорректногоОКПО = НСтр("ru = '%1
						|ОКПО содержит не только цифры'");
						
						СтруктураВозврата.РасширенноеПредставлениеОКПО = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстДляНекорректногоОКПО, ОКПО);
						
						СтруктураВозврата.ОшибокПоОКПОнет = Ложь;
						
					КонецЕсли;
					
					Если СтруктураВозврата.ОшибокПоОКПОнет И НЕ СтранаУчетаУкраина Тогда
						
						СуммаПроизведений = 0;
						Для Позиция = 1 По СтрДлина(ОКПО)-1 Цикл
							Цифра = Число(Сред(ОКПО, Позиция, 1));
							Вес = (Позиция - 1) % 10 + 1;
							СуммаПроизведений = СуммаПроизведений + Цифра * Вес;
						КонецЦикла;
						
						КонтрольнаяЦифра = СуммаПроизведений % 11;
						Если КонтрольнаяЦифра = 10 Тогда
							СуммаПроизведений = 0;
							Для Позиция = 1 По СтрДлина(ОКПО)-1 Цикл
								Цифра = Число(Сред(ОКПО, Позиция, 1));
								Вес = (Позиция + 1) % 10 + 1;
								СуммаПроизведений = СуммаПроизведений + Цифра * Вес;
							КонецЦикла;
							КонтрольнаяЦифра = СуммаПроизведений % 11;
						КонецЕсли;
						
						КонтрольнаяЦифра = КонтрольнаяЦифра % 10;
						
						Если Строка(КонтрольнаяЦифра) <> Прав(ОКПО, 1) Тогда		
							
							СтруктураВозврата.ОКПОВведенКорректно = Ложь;
							
							СтруктураВозврата.НадписьПоясненияНекорректногоОКПО = Новый ФорматированнаяСтрока(НСтр("ru = 'ОКПО юридического лица введен некорректно'"),,ЦветВыделенияНекорректногоЗначения);
							
							ТекстДляНекорректногоОКПО = НСтр("ru = '%1
							|ОКПО не соответствует формату'");
							
							СтруктураВозврата.РасширенноеПредставлениеОКПО = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстДляНекорректногоОКПО, ОКПО);
							
							СтруктураВозврата.ОшибокПоОКПОнет = Ложь;
							
						КонецЕсли;
						
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;
	

	Возврат СтруктураВозврата;
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Добавить дополнительные состояния.
// 
// Параметры:
//  МассивСостояний				 - 	 - 
//  ДополнятьСостояниемСОшибкой	 - 	 - 
//  ДополнятьПустымСостоянием	 - 	 - 
// 
Процедура ДобавитьДополнительныеСостояния(МассивСостояний, ДополнятьСостояниемСОшибкой, ДополнятьПустымСостоянием)
	
	Если ДополнятьСостояниемСОшибкой Тогда
		МассивСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСуществованияКонтрагента.СодержитОшибкиВДанных"));
	КонецЕсли;
	Если ДополнятьПустымСостоянием Тогда
		МассивСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСуществованияКонтрагента.ПустаяСсылка"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти