
#Область СлужебныеПроцедурыИФункции

// Процедура, устанавливает признак последнего в очереди.
//
Процедура УстановитьФлагПоследнего(ВнешняяСистема, ПорядковыйНомер, ЭтоПоследний) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВнешняяСистема.Установить(ВнешняяСистема);
	НаборЗаписей.Отбор.ПорядковыйНомер.Установить(ПорядковыйНомер);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Выбран() И НаборЗаписей[0].ПоследнийВОчереди <> ЭтоПоследний Тогда
		НаборЗаписей[0].ПоследнийВОчереди = ЭтоПоследний;
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
