
#Область СлужебныйПрограммныйИнтерфейс

Функция ТелефонВЧерномСписке(НомерТелефонаАбонента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаблокированныеНомераТелефонов.НомерТелефонаАбонента КАК НомерТелефонаАбонента
		|ИЗ
		|	РегистрСведений.ЗаблокированныеНомераТелефонов КАК ЗаблокированныеНомераТелефонов
		|ГДЕ
		|	ЗаблокированныеНомераТелефонов.НомерТелефонаАбонента = &НомерТелефонаАбонента";
	
	Запрос.УстановитьПараметр("НомерТелефонаАбонента", НомерТелефонаАбонента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ?(РезультатЗапроса.Пустой(), Ложь, Истина);
	
КонецФункции

#КонецОбласти