
#Область СлужебныеПроцедурыИФункции

Функция МаксимумПолезныхКолонокТабличногоДокумента() ЭКспорт
	
	// Самый большой справочник по количеству реквизитов: Контрагенты (43 полезных) + 10 на КИ + Дополнительные реквизиты.
	// Остальное регулируем в ЗагрузкаДанныхИзВнешнегоИсточника.ОптимизироватьТабличныйДокумент()
	
	Возврат 43 + 10 + МаксимумДополнительныхРеквизитовТабличногоДокумента();
	
КонецФункции

Функция МаксимумДополнительныхРеквизитовТабличногоДокумента() ЭКспорт
	
	Возврат 10;
	
КонецФункции

Функция МаксимумЗаписейВОднойТранзакции() Экспорт
	
	Возврат 137;
	
КонецФункции

Функция СтандартныеПодсистемыСервер_ПреобразоватьСтрокуВДопустимоеНаименованиеКолонки(Строка) Экспорт
	
	НедопустимыеСимволы = "<>:;!@#$%^&-~`'.,?{}[]+=*/|\ ()_""«»";
	Результат = "";
	Для Индекс = 1 По СтрДлина(Строка) Цикл
		Символ =  Сред(Строка, Индекс, 1);
		Если СтрНайти(НедопустимыеСимволы, Символ) > 0 Тогда
			Результат = Результат + "_" + КодСимвола(Символ) + "_";
		Иначе
			Результат = Результат + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Процедура ДобавитьУсловноеОформлениеДополнительныхРеквизитов(ЭтотОбъект, ПутьРеквизита, НастройкиЗагрузкиДанных)
	
	
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформлениеТаблицыСопоставлений(ЭтотОбъект, ПутьРеквизита, НастройкиЗагрузкиДанных) Экспорт
	
	Если НастройкиЗагрузкиДанных.ЭтоЗагрузкаТабличнойЧасти Тогда
		
		Возврат;
		
	ИначеЕсли НастройкиЗагрузкиДанных.ЭтоЗагрузкаСправочника Тогда
		
		// Если НастройкиЗагрузкиДанных.ОписаниеДополнительныхРеквизитов.Количество() > 0 Тогда
		// 	
		// 	ДобавитьУсловноеОформлениеДополнительныхРеквизитов(ЭтотОбъект, ПутьРеквизита, НастройкиЗагрузкиДанных);
		// 	
		// КонецЕсли;
		
		Если НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "Справочник.Номенклатура" Тогда
			
			ИмяПоля = "Номенклатура";
			
		ИначеЕсли НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "Справочник.Контрагенты" Тогда
			
			ИмяПоля = "Контрагент";
			
		КонецЕсли;
		
		ТекстНовыйЭлемент	= Нстр("ru ='<Будет создан новый элемент>'");
		ТекстПропущены		= Нстр("ru ='<Данные будут пропущены>'");
		ТекстУсловногоОформления = ?(НастройкиЗагрузкиДанных.СоздаватьЕслиНеСопоставлено, ТекстНовыйЭлемент, ТекстПропущены);
		
	ИначеЕсли НастройкиЗагрузкиДанных.ЭтоЗагрузкаРегистраСведений Тогда
		
		Если НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "РегистрСведений.ЦеныНоменклатуры" Тогда
			
			ИмяПоля = "Номенклатура";
			ТекстУсловногоОформления = Нстр("ru ='<Строка будет пропущена...>'");
			
		ИначеЕсли НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "РегистрСведений.НормыСписанияМатериалов" Тогда	
			
			ИмяПоля = "Материал";
			ТекстНовыйЭлемент = Нстр("ru ='<Будет создан новый элемент>'");
			ТекстПропущены	  = Нстр("ru ='<Данные будут пропущены>'");
			ТекстУсловногоОформления = ?(НастройкиЗагрузкиДанных.СоздаватьЕслиНеСопоставлено, ТекстНовыйЭлемент, ТекстПропущены);

		КонецЕсли;
			
	КонецЕсли;
	
	ЭлементУсловногоОформленияКД = ЭтотОбъект.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформленияКД.Использование = Истина;
	
	ЭлементОтбораКД = ЭлементУсловногоОформленияКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораКД.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьРеквизита + "." + ИмяПоля);
	ЭлементОтбораКД.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУсловногоОформленияКД.Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Текст"), ТекстУсловногоОформления);
	ЭлементУсловногоОформленияКД.Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЦветТекста"), Новый Цвет(175, 175, 175));
	
	ОформляемоеПолеКД = ЭлементУсловногоОформленияКД.Поля.Элементы.Добавить();
	ОформляемоеПолеКД.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	
КонецПроцедуры

Процедура ИзменитьТекстУсловногоОформления(УсловноеОформление, НастройкиЗагрузкиДанных) Экспорт
	
	Если НастройкиЗагрузкиДанных.ЭтоЗагрузкаТабличнойЧасти Тогда
		
		Возврат;
		
	ИначеЕсли НастройкиЗагрузкиДанных.ЭтоЗагрузкаРегистраСведений Тогда
		
		Возврат;
		
	ИначеЕсли НастройкиЗагрузкиДанных.ЭтоЗагрузкаСправочника Тогда
		
		Если НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "Справочник.Номенклатура" Тогда
			
			ИмяПоля = "Номенклатура";
			
		ИначеЕсли НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "Справочник.Контрагенты" Тогда
			
			ИмяПоля = "Контрагент";
			
		КонецЕсли;
		
		ТекстНовыйЭлемент	= Нстр("ru ='<Будет создан новый элемент>'");
		ТекстПропущены		= Нстр("ru ='<Данные будут пропущены>'");
		ТекстУсловногоОформления = ?(НастройкиЗагрузкиДанных.СоздаватьЕслиНеСопоставлено, ТекстНовыйЭлемент, ТекстПропущены);
		
	КонецЕсли;
	
	ИскомыйЭлемент = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для каждого ЭлементУсловногоОформления Из УсловноеОформление.Элементы Цикл
		
		ЭтоИскомоеОформление = Ложь;
		Для каждого ОформляемоеПоле Из ЭлементУсловногоОформления.Поля.Элементы Цикл
			
			Если ОформляемоеПоле.Поле = ИскомыйЭлемент Тогда
				
				ЭтоИскомоеОформление = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЭтоИскомоеОформление Тогда
			
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Текст"), ТекстУсловногоОформления);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриОпределенииФормыЗагрузкиДанных(ИмяФормыЗагрузкиДанныхИзВнешнихИсточников, ПолноеИмяОбъектаЗаполнения, ОбъектЗаполнения) Экспорт
	
	
	
КонецПроцедуры

Процедура ПереопределитьОбразцыЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	
	
КонецПроцедуры

Процедура ПереопределитьЗаполнениеПолейЗагрузкиДанных(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт
	
	
	
КонецПроцедуры

Процедура ПриДобавленииСлужебныхПолей(ГруппаСлужебныхПолей, ПолноеИмяОбъектаЗаполнения) Экспорт
	
	
	
КонецПроцедуры

Процедура ПослеДобавленияЭлементовТаблицыСопоставлений(ЭтотОбъект, НастройкиЗагрузкиДанных) Экспорт
	
	Если НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "Справочник.Номенклатура" Тогда
		
		ЭтотОбъект.Элементы["Родитель"].ФормаВыбора = "Справочник.Номенклатура.Форма.ФормаВыбораГруппы";
		
	ИначеЕсли НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "Справочник.Контрагенты"  Тогда
		
		ЭтотОбъект.Элементы["Родитель"].ФормаВыбора = "Справочник.Контрагенты.Форма.ФормаВыбораГруппы.";
		
	ИначеЕсли НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "Документ.ПриходнаяНакладная.ТабличнаяЧасть.Запасы" Тогда
		
		МассивТиповНоменклатуры = Новый Массив;
		МассивТиповНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Запас);
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипНоменклатуры", МассивТиповНоменклатуры);
		
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(НовыйПараметр);
		
		ЭтотОбъект.Элементы["Номенклатура"].ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
		
	ИначеЕсли НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "Документ.ПриходнаяНакладная.ТабличнаяЧасть.Расходы" Тогда
		
		МассивТиповНоменклатуры = Новый Массив;
		МассивТиповНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Услуга);
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипНоменклатуры", МассивТиповНоменклатуры);
		
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(НовыйПараметр);
		
		ЭтотОбъект.Элементы["Номенклатура"].ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОпределенииРежимаИспользования(ИспользоватьСовместно) Экспорт
	
	ИспользоватьСовместно = Ложь;
	
КонецПроцедуры

Функция СтандартныеИменаПолейНеподлежащихОбновлению(НастройкиЗагрузкиДанных) Экспорт
	
	// При более сложной настройке допускается индивидуальная настройка исключаемых полей
	// Описание таких полей можно разместить непосредственно в менеджерах объектов (Справочники.Номенклатура.<ИмяПроцедурыИлиФункции>)
	
	СтандартныеИсключаемыеСвойства = "";
	Если НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "Справочник.Контрагенты" Тогда
		
		СтандартныеИсключаемыеСвойства = "Родитель";
		
	ИначеЕсли НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "Справочник.Номенклатура" Тогда
		
		СтандартныеИсключаемыеСвойства = "Код,Родитель";
		
	ИначеЕсли НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "Справочник.КонтактныеЛица" Тогда
		
		СтандартныеИсключаемыеСвойства = "Код";
		
	ИначеЕсли НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "Справочник.Лиды" Тогда
		
		СтандартныеИсключаемыеСвойства = "Код";
		
	КонецЕсли;
	
	Возврат СтандартныеИсключаемыеСвойства;
	
КонецФункции

Функция ИменаИспользуемыхТабличныхЧастей() Экспорт
	
	ИспользуемыеИменаТабличныхЧастей = Новый Соответствие;
	ИспользуемыеИменаТабличныхЧастей.Вставить(".ТабличнаяЧасть.Состав",						"Состав");
	ИспользуемыеИменаТабличныхЧастей.Вставить(".ТабличнаяЧасть.Расходы",					"Расходы");
	ИспользуемыеИменаТабличныхЧастей.Вставить(".ТабличнаяЧасть.Калькуляция",				"Калькуляция");
	ИспользуемыеИменаТабличныхЧастей.Вставить(".ТабличнаяЧасть.Получатели",					"Получатели");
	ИспользуемыеИменаТабличныхЧастей.Вставить(".ТабличнаяЧасть.ВнеоборотныеАктивы",			"ВнеоборотныеАктивы");
	ИспользуемыеИменаТабличныхЧастей.Вставить(".ТабличнаяЧасть.РасчетыСПоставщиками",		"РасчетыСПоставщиками");
	ИспользуемыеИменаТабличныхЧастей.Вставить(".ТабличнаяЧасть.РасчетыСПокупателями",		"РасчетыСПокупателями");
	ИспользуемыеИменаТабличныхЧастей.Вставить(".ТабличнаяЧасть.РасчетыСПерсоналом",			"РасчетыСПерсоналом");
	ИспользуемыеИменаТабличныхЧастей.Вставить(".ТабличнаяЧасть.ЗапасыПринятые",				"ЗапасыПринятые");
	ИспользуемыеИменаТабличныхЧастей.Вставить(".ТабличнаяЧасть.ЗапасыПереданные",			"ЗапасыПереданные");
	ИспользуемыеИменаТабличныхЧастей.Вставить(".ТабличнаяЧасть.ЗапасыВРазрезеГТД",			"ЗапасыВРазрезеГТД");
	ИспользуемыеИменаТабличныхЧастей.Вставить(".ТабличнаяЧасть.Запасы", 					"Запасы");
	ИспользуемыеИменаТабличныхЧастей.Вставить(".ТабличнаяЧасть.ПакетыУслуг", 				"ПакетыУслуг");
	ИспользуемыеИменаТабличныхЧастей.Вставить(".ТабличнаяЧасть.БонусныеСчета", 				"БонусныеСчета");
	ИспользуемыеИменаТабличныхЧастей.Вставить(".ТабличнаяЧасть.Сертификаты", 				"Сертификаты");
	ИспользуемыеИменаТабличныхЧастей.Вставить(".ТабличнаяЧасть.Продажи", 					"Продажи");
	ИспользуемыеИменаТабличныхЧастей.Вставить(".ТабличнаяЧасть.ЗакупкиДляКУДИР",			"ЗакупкиДляКУДИР");
	ИспользуемыеИменаТабличныхЧастей.Вставить(".ТабличнаяЧасть.РасшифровкаПлатежаОтАгента",	"РасшифровкаПлатежаОтАгента");
	ИспользуемыеИменаТабличныхЧастей.Вставить(".ТабличнаяЧасть.СерийныеНомераСертификатов",	"СерийныеНомераСертификатов");
	ИспользуемыеИменаТабличныхЧастей.Вставить(".ТабличнаяЧасть.ДенежныеСредстваНаЛицевыхСчетах","ДенежныеСредстваНаЛицевыхСчетах");
	
	Возврат ИспользуемыеИменаТабличныхЧастей;
	
КонецФункции

Функция ИменаПолейНеУчаствующиеВЗаполненииСвойств() Экспорт
	
	Возврат
	"АдресФакт
	|АдресЮр
	|АдресЭП
	|ИНН_КПП
	|КонтрагентНаименование
	|НоменклатураНаименование
	|НоменклатураНаименованиеПолное
	|РасчетныйСчет
	|Родитель
	|Телефон
	|СерийныйНомер
	|Штрихкод
	|ИНН_КПП1
	|Контрагент1Наименование
	|РасчетныйСчет1
	|Должность1
	|ИНН_КПП2
	|Контрагент2Наименование
	|РасчетныйСчет2
	|Должность2
	|ИНН_КПП3
	|Контрагент3Наименование
	|РасчетныйСчет3
	|Должность3
	|Контакт1
	|Телефон1
	|АдресЭП1
	|Контакт2
	|Телефон2
	|АдресЭП2
	|Контакт3
	|Телефон3
	|АдресЭП3
	|Цена
	|Количество
	|Картинка
	|Коэффициент
	|Характеристика";
	
	
КонецФункции

Функция ОсновнойВидЦен() Экспорт
	
	Возврат Справочники.Контрагенты.ПолучитьОсновнойВидЦенПродажи();
	
КонецФункции

#Область МетодыСопоставлений

// Общее

Процедура СправочникПоНаименованию(ИмяСправочника, СправочникЗначение, СправочникНаименование, ЗначениеПоУмолчанию = Неопределено)
	
	Если НЕ ПустаяСтрока(СправочникНаименование) Тогда
		
		СправочникСсылка = Справочники[ИмяСправочника].НайтиПоНаименованию(СправочникНаименование, Ложь);
		Если ЗначениеЗаполнено(СправочникСсылка)
			И НЕ СправочникСсылка.ЭтоГруппа Тогда
			
			СправочникЗначение = СправочникСсылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СправочникЗначение) Тогда
		
		СправочникЗначение = ЗначениеПоУмолчанию;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьПеречисление(ИмяПеречисления, ЗначениеПеречисления, ВходящиеДанные, ЗначениеПоУмолчанию)
	
	Если ЗначениеЗаполнено(ВходящиеДанные) Тогда
		
		Для каждого ЭлементПеречисления Из Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления Цикл
			
			Синоним = ЭлементПеречисления.Синоним;
			Если СтрНайти(ВРег(Синоним), ВРег(ВходящиеДанные)) > 0 Тогда
				
				ЗначениеПеречисления = Перечисления[ИмяПеречисления][ЭлементПеречисления.Имя];
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗначениеПеречисления) Тогда
		
		ЗначениеПеречисления = ЗначениеПоУмолчанию;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПреобразоватьСтрокуВБулево(ЗначениеБулево, ВходящиеДанные) Экспорт
	
	ВходящиеДанные = ВРЕГ(СокрЛП(ВходящиеДанные));
	
	МассивИстина = Новый Массив;
	МассивИстина.Добавить("+");
	МассивИстина.Добавить("1");
	МассивИстина.Добавить("ИСТИНА");
	МассивИстина.Добавить("ДА");
	МассивИстина.Добавить("TRUE");
	МассивИстина.Добавить("YES");
	
	МассивЛожь = Новый Массив;
	МассивЛожь.Добавить("-");
	МассивЛожь.Добавить("0");
	МассивЛожь.Добавить("ЛОЖЬ");
	МассивЛожь.Добавить("НЕТ");
	МассивЛожь.Добавить("FALSE");
	МассивЛожь.Добавить("NO");
	
	Если МассивИстина.Найти(ВходящиеДанные) <> Неопределено Тогда
		
		ЗначениеБулево = Истина;
		
	ИначеЕсли МассивЛожь.Найти(ВходящиеДанные) <> Неопределено Тогда
		
		ЗначениеБулево = Ложь;
		
	Иначе
		
		ЗначениеБулево = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПреобразоватьСтрокуВЧисло(ЧислоРезультат, ЧислоСтрокой, ЗначениеПоУмолчанию = 0) Экспорт
	
	Если ПустаяСтрока(ЧислоСтрокой) Тогда
		
		ЧислоРезультат = ЗначениеПоУмолчанию;
		Возврат;
		
	КонецЕсли;
	
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число");
	
	// ВРег используется для возможности преобразования чисел в экспоненциальной форме
	// Например 6,022140857e23 или 3,14e+00
	ЧислоРезультат = ОписаниеТиповЧисло.ПривестиЗначение(ВРег(СтрЗаменить(ЧислоСтрокой, " ", "")));
	
КонецПроцедуры

Процедура ПреобразоватьСтрокуВДату(ДатаРезультат, ДатаСтрокой) Экспорт
	
	Если ПустаяСтрока(ДатаСтрокой) Тогда
		
		ДатаРезультат = Дата(0001, 01, 01);
		
	Иначе
		
		КопияДатаСтрокой = ДатаСтрокой;
		
		МассивРазделителей = Новый Массив;
		МассивРазделителей.Добавить(".");
		МассивРазделителей.Добавить("/");
		МассивРазделителей.Добавить(",");
		
		Для каждого Разделитель Из МассивРазделителей Цикл
			
			ЧислоСтрокой = "";
			МесяцСтрокой = "";
			ГодСтрокой = "";
			
			ПозицияРазделителя = СтрНайти(КопияДатаСтрокой, Разделитель);
			Если ПозицияРазделителя > 0 Тогда
				
				ЧислоСтрокой = Лев(КопияДатаСтрокой, ПозицияРазделителя - 1);
				КопияДатаСтрокой = Сред(КопияДатаСтрокой, ПозицияРазделителя + 1);
				
			КонецЕсли;
			
			ПозицияРазделителя = СтрНайти(КопияДатаСтрокой, Разделитель);
			Если ПозицияРазделителя > 0 Тогда
				
				МесяцСтрокой = Лев(КопияДатаСтрокой, ПозицияРазделителя - 1);
				КопияДатаСтрокой = Сред(КопияДатаСтрокой, ПозицияРазделителя + 1);
				
			КонецЕсли;
			
			ГодСтрокой = КопияДатаСтрокой;
			
			Если НЕ ПустаяСтрока(ЧислоСтрокой) 
				И НЕ ПустаяСтрока(МесяцСтрокой) 
				И НЕ ПустаяСтрока(ГодСтрокой) Тогда
				
				Попытка
					
					ДатаРезультат = Дата(Число(ГодСтрокой), Число(МесяцСтрокой), Число(ЧислоСтрокой));
					
				Исключение
					
					ДатаРезультат = Дата(0001, 01, 01);
					
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СкопироватьСтрокуВЗначениеСтроковогоТипа(ЗначениеСтроковогоТипа, Строка) Экспорт
	
	ЗначениеСтроковогоТипа = СокрЛП(Строка);
	
КонецПроцедуры

Процедура СопоставитьНоменклатуру(Номенклатура, Штрихкод, Артикул, НоменклатураНаименование, 
	НоменклатураНаименованиеПолное = Неопределено, Код = Неопределено, КодСинхронизации = Неопределено, КодНоменклатурыМедицинскиУслуг = Неопределено, НомерПоиска = 0) Экспорт
	
	ЗначениеБылоСопоставлено = Ложь;
	Если ЗначениеЗаполнено(НомерПоиска) Тогда
		
		// Поиск по "Артикулу".	
		Если НомерПоиска = 1 И ЗначениеЗаполнено(Артикул) Тогда
			
			СправочникСсылка = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Артикул);
			Если НЕ СправочникСсылка.Пустая() Тогда
				
				ЗначениеБылоСопоставлено = Истина;
				Номенклатура = СправочникСсылка;
				
			КонецЕсли;
			
		// Поиск по "Коду синхронизации".
		ИначеЕсли НомерПоиска = 2 И ЗначениеЗаполнено(КодСинхронизации) Тогда
			
			Попытка
				СправочникСсылка = Справочники.Номенклатура.НайтиПоРеквизиту("КодСинхронизации", КодСинхронизации);		
			Исключение
				СправочникСсылка = Справочники.Номенклатура.ПустаяСсылка();
			КонецПопытки;
			
			Если НЕ СправочникСсылка.Пустая() Тогда
				
				ЗначениеБылоСопоставлено = Истина;
				Номенклатура = СправочникСсылка;
				
			КонецЕсли;  
		// Поиск по "Коду номенклатуры медицинских услуг"	
		ИначеЕсли НомерПоиска = 3 Тогда
			Попытка 
				СправочникСсылка = Справочники.Номенклатура.НайтиПоРеквизиту("КодНоменклатурыМедицинскиУслуг", КодНоменклатурыМедицинскиУслуг);
			Исключение   
				СправочникСсылка = Справочники.Номенклатура.ПустаяСсылка();				
			КонецПопытки;			
			
			Если НЕ СправочникСсылка.Пустая() Тогда 
				ЗначениеБылоСопоставлено = Истина;
				Номенклатура = СправочникСсылка;				
			КонецЕсли;
			
		КонецЕсли;
		
		// Если выбран поиск по "Наименованию", либо выбран другой поиск, но значения не заполнены в файле.
		Если НомерПоиска = 0 
			ИЛИ ((НомерПоиска = 1 И НЕ ЗначениеЗаполнено(Артикул)) 
			ИЛИ (НомерПоиска = 2 И НЕ ЗначениеЗаполнено(КодСинхронизации))
			ИЛИ (НомерПоиска = 3 И НЕ ЗначениеЗаполнено(КодНоменклатурыМедицинскиУслуг))) Тогда
			
			Если ЗначениеЗаполнено(НоменклатураНаименование) Тогда
				СправочникСсылка = Справочники.Номенклатура.НайтиПоНаименованию(НоменклатураНаименование, Истина);
				Если ЗначениеЗаполнено(СправочникСсылка)
					И НЕ СправочникСсылка.ЭтоГруппа Тогда
					
					ЗначениеБылоСопоставлено = Истина;
					Номенклатура = СправочникСсылка;
					
				Иначе
					
					НоменклатураНаименованиеЭкранировано = СтрЗаменить(НоменклатураНаименование, "[", "\[");
					НоменклатураНаименованиеЭкранировано = СтрЗаменить(НоменклатураНаименованиеЭкранировано, "]", "\]");
					
					Запрос = Новый Запрос("ВЫБРАТЬ Справочник.Номенклатура.Ссылка ГДЕ НЕ Справочник.Номенклатура.ЭтоГруппа И Справочник.Номенклатура.Наименование ПОДОБНО &Наименование СПЕЦСИМВОЛ ""\""");
					Запрос.УстановитьПараметр("Наименование", НоменклатураНаименованиеЭкранировано + "%");
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						
						ЗначениеБылоСопоставлено = Истина;
						Номенклатура = Выборка.Ссылка;
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НоменклатураНаименованиеПолное) 
				И ЗначениеБылоСопоставлено = Ложь Тогда
				
				НоменклатураНаименованиеПолноеЭкранировано = СтрЗаменить(НоменклатураНаименованиеПолное, "[", "\[");
				НоменклатураНаименованиеПолноеЭкранировано = СтрЗаменить(НоменклатураНаименованиеПолноеЭкранировано, "]", "\]");
				
				Запрос = Новый Запрос("ВЫБРАТЬ Справочник.Номенклатура.Ссылка ГДЕ НЕ Справочник.Номенклатура.ЭтоГруппа И Справочник.Номенклатура.НаименованиеПолное ПОДОБНО &НаименованиеПолное СПЕЦСИМВОЛ ""\""");
				Запрос.УстановитьПараметр("НаименованиеПолное", НоменклатураНаименованиеПолноеЭкранировано + "%");
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					
					ЗначениеБылоСопоставлено = Истина;
					Номенклатура = Выборка.Ссылка;
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		Если НЕ ЗначениеБылоСопоставлено 
			И ЗначениеЗаполнено(КодСинхронизации) Тогда
			
			Попытка
				СправочникСсылка = Справочники.Номенклатура.НайтиПоРеквизиту("КодСинхронизации", КодСинхронизации);		
			Исключение
				СправочникСсылка = Справочники.Номенклатура.ПустаяСсылка();
			КонецПопытки;
			
			Если НЕ СправочникСсылка.Пустая() Тогда
				
				ЗначениеБылоСопоставлено = Истина;
				Номенклатура = СправочникСсылка;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеБылоСопоставлено 
			И ЗначениеЗаполнено(Код) Тогда
			
			СправочникСсылка = Справочники.Номенклатура.НайтиПоКоду(Код, Ложь);
			Если НЕ СправочникСсылка.Пустая() Тогда
				
				ЗначениеБылоСопоставлено = Истина;
				Номенклатура = СправочникСсылка;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеБылоСопоставлено 
			И ЗначениеЗаполнено(Штрихкод) Тогда
			
			Запрос = Новый Запрос("ВЫБРАТЬ ШК.Объект ИЗ РегистрСведений.Штрихкоды КАК ШК ГДЕ ШК.Штрихкод = &Штрихкод");
			Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				
				ЗначениеБылоСопоставлено = Истина;
				Номенклатура = Выборка.Объект;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеБылоСопоставлено 
			И ЗначениеЗаполнено(Артикул) Тогда
			
			СправочникСсылка = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Артикул);
			Если НЕ СправочникСсылка.Пустая() Тогда
				
				ЗначениеБылоСопоставлено = Истина;
				Номенклатура = СправочникСсылка;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеБылоСопоставлено 
			И ЗначениеЗаполнено(НоменклатураНаименование) Тогда
			
			СправочникСсылка = Справочники.Номенклатура.НайтиПоНаименованию(НоменклатураНаименование, Истина);
			Если ЗначениеЗаполнено(СправочникСсылка)
				И НЕ СправочникСсылка.ЭтоГруппа Тогда
				
				ЗначениеБылоСопоставлено = Истина;
				Номенклатура = СправочникСсылка;
				
			Иначе
				
				НоменклатураНаименованиеЭкранировано = СтрЗаменить(НоменклатураНаименование, "[", "\[");
				НоменклатураНаименованиеЭкранировано = СтрЗаменить(НоменклатураНаименованиеЭкранировано, "]", "\]");
				
				Запрос = Новый Запрос("ВЫБРАТЬ Справочник.Номенклатура.Ссылка ГДЕ НЕ Справочник.Номенклатура.ЭтоГруппа И Справочник.Номенклатура.Наименование ПОДОБНО &Наименование СПЕЦСИМВОЛ ""\""");
				Запрос.УстановитьПараметр("Наименование", НоменклатураНаименованиеЭкранировано + "%");
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					
					ЗначениеБылоСопоставлено = Истина;
					Номенклатура = Выборка.Ссылка;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеБылоСопоставлено 
			И ЗначениеЗаполнено(НоменклатураНаименованиеПолное) Тогда
			
			НоменклатураНаименованиеПолноеЭкранировано = СтрЗаменить(НоменклатураНаименованиеПолное, "[", "\[");
			НоменклатураНаименованиеПолноеЭкранировано = СтрЗаменить(НоменклатураНаименованиеПолноеЭкранировано, "]", "\]");
			
			Запрос = Новый Запрос("ВЫБРАТЬ Справочник.Номенклатура.Ссылка ГДЕ НЕ Справочник.Номенклатура.ЭтоГруппа И Справочник.Номенклатура.НаименованиеПолное ПОДОБНО &НаименованиеПолное СПЕЦСИМВОЛ ""\""");
			Запрос.УстановитьПараметр("НаименованиеПолное", НоменклатураНаименованиеПолноеЭкранировано + "%");
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				
				ЗначениеБылоСопоставлено = Истина;
				Номенклатура = Выборка.Ссылка;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	// Группы для справочника номенклатуры на текущий момент не используется.
	Если ЗначениеЗаполнено(Номенклатура)
		И Номенклатура.ЭтоГруппа Тогда
		
		Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура СопоставитьХарактеристику(Характеристика, Номенклатура, Штрихкод, Характеристика_ВходящиеДанные) Экспорт
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		
		ЗначениеБылоСопоставлено = Ложь;
		Если ЗначениеЗаполнено(Штрихкод) Тогда
			
			Запрос = Новый Запрос("ВЫБРАТЬ ШК.ПартииНоменклатуры ИЗ РегистрСведений.Штрихкоды КАК ШК ГДЕ ШК.Штрихкод = &Штрихкод И ШК.Объект = &Номенклатура");
			Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
			Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Если НЕ ЗначениеЗаполнено(Выборка.Характеристика) Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				Характеристика = Выборка.Характеристика;
				ЗначениеБылоСопоставлено = Истина;
				Прервать;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если НЕ ЗначениеБылоСопоставлено
			И ЗначениеЗаполнено(Характеристика_ВходящиеДанные) Тогда
			
			// Владельцем характеристики может быть номенклатура или категория номенклатуры.
			// 
			
			СправочникСсылка = Неопределено;
			СправочникСсылка = Справочники.ПартииНоменклатуры.НайтиПоНаименованию(Характеристика_ВходящиеДанные, Ложь, , Номенклатура);
			// Если НЕ ЗначениеЗаполнено(СправочникСсылка)
			// 	И ЗначениеЗаполнено(Номенклатура.КатегорияНоменклатуры) Тогда
			// 	
			// 	СправочникСсылка = Справочники.ПартииНоменклатуры.НайтиПоНаименованию(Характеристика_ВходящиеДанные, Ложь, , Номенклатура.КатегорияНоменклатуры);
			// 	
			// КонецЕсли;
			
			Если ЗначениеЗаполнено(СправочникСсылка) Тогда
				
				Характеристика = СправочникСсылка;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьПартию(Партия, Номенклатура, Штрихкод, Партия_ВходящиеДанные) Экспорт
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		
		ЗначениеБылоСопоставлено = Ложь;
		Если ЗначениеЗаполнено(Штрихкод) Тогда
			
			Запрос = Новый Запрос("ВЫБРАТЬ ШК.Партия ИЗ РегистрСведений.ШтрихкодыНоменклатуры КАК ШК ГДЕ ШК.Штрихкод = &Штрихкод И ШК.Номенклатура = &Номенклатура");
			Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
			Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				
				ЗначениеБылоСопоставлено = Истина;
				Партия = Выборка.Партия;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеБылоСопоставлено
			И ЗначениеЗаполнено(Партия_ВходящиеДанные) Тогда
			
			СправочникСсылка = Справочники.ПартииНоменклатуры.НайтиПоНаименованию(Партия_ВходящиеДанные, Ложь, , Номенклатура);
			Если ЗначениеЗаполнено(СправочникСсылка) Тогда
				
				Партия = СправочникСсылка;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьЕдиницыИзмерения(Номенклатура, ЕдиницаИзмерения, ЕдиницаИзмерения_ВходящиеДанные, ЗначениеПоУмолчанию) Экспорт
	
	Если НЕ ПустаяСтрока(ЕдиницаИзмерения_ВходящиеДанные) Тогда
		
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			
			НаименованиеТекущейЕдиницыИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ЕдиницаИзмерения.Наименование");
			Если ВРег(СокрЛП(НаименованиеТекущейЕдиницыИзмерения)) = ВРег(СокрЛП(ЕдиницаИзмерения_ВходящиеДанные)) Тогда
				
				ЕдиницаИзмерения = Номенклатура.ЕдиницаИзмерения;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
			
			СправочникСсылка = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ЕдиницаИзмерения_ВходящиеДанные, Ложь);
			Если ЗначениеЗаполнено(СправочникСсылка) Тогда
				
				ЕдиницаИзмерения = СправочникСсылка;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(Номенклатура) Тогда
		//	
		//	Если НЕ ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		//		
		//		СправочникСсылка = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(ЕдиницаИзмерения_ВходящиеДанные, Ложь, , Номенклатура);
		//		Если ЗначениеЗаполнено(СправочникСсылка) Тогда
		//			
		//			ЕдиницаИзмерения = СправочникСсылка;
		//			
		//		КонецЕсли;
		//		
		//	КонецЕсли;
		//	
		//	Если НЕ ЗначениеЗаполнено(ЕдиницаИзмерения)  Тогда
		//		
		//		КатегорияНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "КатегорияНоменклатуры");
		//		Если ЗначениеЗаполнено(КатегорияНоменклатуры) Тогда
		//			
		//			СправочникСсылка = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(ЕдиницаИзмерения_ВходящиеДанные, Ложь, , КатегорияНоменклатуры);
		//			Если ЗначениеЗаполнено(СправочникСсылка) Тогда
		//				
		//				ЕдиницаИзмерения = СправочникСсылка;
		//				
		//			КонецЕсли;
		//			
		//		КонецЕсли;
		//		
		//	КонецЕсли;
		//	
		//КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		
		ЕдиницаИзмерения = ЗначениеПоУмолчанию;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьРодителя(ИмяСправочника, Родитель, Родитель_ВходящиеДанные, ЗначениеПоУмолчанию) Экспорт
	
	Если НЕ ПустаяСтрока(Родитель_ВходящиеДанные) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Наименование", Родитель_ВходящиеДанные);
		Запрос.Текст = "ВЫБРАТЬ Справочник." + ИмяСправочника + ".Ссылка ГДЕ Справочник." + ИмяСправочника + ".ЭтоГруппа И Справочник." + ИмяСправочника + ".Наименование = &Наименование";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Родитель = Выборка.Ссылка;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Родитель) Тогда
			
			Запрос.УстановитьПараметр("Наименование", Родитель_ВходящиеДанные + "%");
			Запрос.Текст = "ВЫБРАТЬ Справочник." + ИмяСправочника + ".Ссылка ГДЕ Справочник." + ИмяСправочника + ".ЭтоГруппа И Справочник." + ИмяСправочника + ".Наименование ПОДОБНО &Наименование";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				
				Родитель = Выборка.Ссылка;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Родитель) Тогда
		
		Родитель = ЗначениеПоУмолчанию;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьВалюту(ЗначениеДопРеквизита, СтроковоеЗначение) Экспорт
	
	Если ПустаяСтрока(СтроковоеЗначение) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ СпрВалюты.Ссылка КАК Ссылка ИЗ Справочник.Валюты КАК СпрВалюты 
	|ГДЕ СпрВалюты.Код = &КодВалюты 
	|	ИЛИ СпрВалюты.Наименование ПОДОБНО &НаименованиеВалюты
	|	ИЛИ СпрВалюты.НаименованиеПолное ПОДОБНО &НаименованиеПолное
	|	ИЛИ СпрВалюты.СимвольноеПредставление = &СимвольноеПредставление");
	
	Запрос.УстановитьПараметр("КодВалюты", СокрЛП(СтроковоеЗначение));
	Запрос.УстановитьПараметр("НаименованиеВалюты", СокрЛП(СтроковоеЗначение));
	Запрос.УстановитьПараметр("НаименованиеПолное", СокрЛП(СтроковоеЗначение));
	Запрос.УстановитьПараметр("СимвольноеПредставление", СокрЛП(СтроковоеЗначение));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			
			ЗначениеДопРеквизита = Выборка.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьДополнительноеСвойство(ЗначениеДопРеквизита, Свойство, ИспользоватьИерархию, СтроковоеЗначение) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ Справочник.ЗначенияСвойствОбъектов.Ссылка КАК ЗначениеСвойства ГДЕ Наименование ПОДОБНО &Наименование И Справочник.ЗначенияСвойствОбъектов.Ссылка В(&МассивЗначений)");
	
	Если ИспользоватьИерархию Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.ЗначенияСвойствОбъектов", "Справочник.ЗначенияСвойствОбъектовИерархия");
		
	КонецЕсли;
	
	МассивЗначений = УправлениеСвойствами.ПолучитьСписокЗначенийСвойств(Свойство);
	
	Запрос.УстановитьПараметр("Наименование", СокрЛП(СтроковоеЗначение));
	Запрос.УстановитьПараметр("МассивЗначений", МассивЗначений);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			
			ЗначениеДопРеквизита = Выборка.ЗначениеСвойства;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьПользователя(ЗначениеДопРеквизита, СтроковоеЗначение) Экспорт
	
	НайденныйПользователь = Пользователи.НайтиПоИмени(СокрЛП(СтроковоеЗначение));
	Если НЕ ЗначениеЗаполнено(НайденныйПользователь) Тогда
		
		НайденныйПользователь = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(СтроковоеЗначение), Ложь);
		
	КонецЕсли;
	
	ЗначениеДопРеквизита = ?(ЗначениеЗаполнено(НайденныйПользователь), НайденныйПользователь, Неопределено);
	
КонецПроцедуры

Процедура СопоставитьПроект(ЗначениеДопРеквизита, СтроковоеЗначение) Экспорт
	
	Если ПустаяСтрока(СтроковоеЗначение) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ Справочник.Проекты.Ссылка КАК Проект ГДЕ Наименование ПОДОБНО &Наименование");
	
	Запрос.УстановитьПараметр("Наименование", СокрЛП(СтроковоеЗначение));
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			
			ЗначениеДопРеквизита = Выборка.Проект;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьСотрудника(ЗначениеДопРеквизита, СтроковоеЗначение) Экспорт
	
	Если ПустаяСтрока(СтроковоеЗначение) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ Справочник.Сотрудники.Ссылка КАК Сотрудник ГДЕ Код = &ТабельныйНомер ИЛИ Наименование ПОДОБНО &ПредставлениеСотрудника");
	
	Запрос.УстановитьПараметр("ТабельныйНомер", СокрЛП(СтроковоеЗначение));
	Запрос.УстановитьПараметр("ПредставлениеСотрудника", СокрЛП(СтроковоеЗначение));
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			
			ЗначениеДопРеквизита = Выборка.Сотрудник;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьДополнительноеСвойство(ЗначениеДопРеквизита, Свойство, ИспользоватьИерархию, СтроковоеЗначение) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЗначениеДопРеквизита) Тогда
		
		ИмяСправочника = ?(ИспользоватьИерархию, "ЗначенияСвойствОбъектовИерархия", "ЗначенияСвойствОбъектов");
		
		ЗначениеДопРеквизита = Справочники[ИмяСправочника].НайтиПоНаименованию(СокрЛП(СтроковоеЗначение), Истина, , Свойство);
		Если НЕ ЗначениеЗаполнено(ЗначениеДопРеквизита) Тогда
			
			СпрОбъект = Справочники[ИмяСправочника].СоздатьЭлемент();
			СпрОбъект.Владелец = Свойство;
			СпрОбъект.Наименование = СокрЛП(СтроковоеЗначение);
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СпрОбъект, Истина, Истина);
			
			ЗначениеДопРеквизита = СпрОбъект.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьЗаполнитьТаблицуВозможныхТиповЗначенийДопРеквизита(Свойство, ТаблицаТипов) Экспорт
	
	ТаблицаТипов = Новый ТаблицаЗначений;
	ТаблицаТипов.Колонки.Добавить("Тип");
	ТаблицаТипов.Колонки.Добавить("Приоритет");
	
	МассивТиповЗначений = Свойство.ТипЗначения.Типы();
	Для каждого ЭлементМассива Из МассивТиповЗначений Цикл
		
		НоваяСтрока = ТаблицаТипов.Добавить();
		НоваяСтрока.Тип = ЭлементМассива;
		Если ЭлементМассива = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") 
			ИЛИ ЭлементМассива = Тип("СправочникСсылка.ЗначенияСвойствОбъектовИерархия") Тогда
			
			НоваяСтрока.Приоритет = 1;
			
		ИначеЕсли ЭлементМассива = Тип("Булево")
			ИЛИ ЭлементМассива = Тип("Дата")
			ИЛИ ЭлементМассива = Тип("Число") Тогда
			
			НоваяСтрока.Приоритет = 3;
			
		ИначеЕсли ЭлементМассива = Тип("Строка") Тогда
			
			НоваяСтрока.Приоритет = 4;
			
		Иначе
			
			НоваяСтрока.Приоритет = 2;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаТипов.Сортировать("Приоритет");
	
КонецПроцедуры

Процедура СопоставитьДополнительныеРеквизиты(СтрокаТаблицыФормы, ВыбранныеДополнительныеРеквизиты) Экспорт
	Перем ТаблицаТипов;
	
	ПостФикс = "_ВходящиеДанные";
	Для каждого ЭлементСоответствия Из ВыбранныеДополнительныеРеквизиты Цикл
		
		СтроковоеЗначение = СтрокаТаблицыФормы[ЭлементСоответствия.Значение + ПостФикс];
		Если ПустаяСтрока(СтроковоеЗначение) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Свойство = ЭлементСоответствия.Ключ;
		
		СоздатьЗаполнитьТаблицуВозможныхТиповЗначенийДопРеквизита(Свойство, ТаблицаТипов);
		
		ЗначениеДопРеквизита = Неопределено;
		Для каждого СтрокаТаблицы Из ТаблицаТипов Цикл
			
			Если СтрокаТаблицы.Тип = Тип("СправочникСсылка.Валюты") Тогда
				
				СопоставитьВалюту(ЗначениеДопРеквизита, СтроковоеЗначение);
				
			ИначеЕсли СтрокаТаблицы.Тип = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") Тогда
				
				СопоставитьДополнительноеСвойство(ЗначениеДопРеквизита, Свойство, Ложь, СтроковоеЗначение);
				
			ИначеЕсли СтрокаТаблицы.Тип = Тип("СправочникСсылка.ЗначенияСвойствОбъектовИерархия") Тогда
				
				СопоставитьДополнительноеСвойство(ЗначениеДопРеквизита, Свойство, Истина, СтроковоеЗначение);
				
			ИначеЕсли СтрокаТаблицы.Тип = Тип("СправочникСсылка.Контрагенты") Тогда
				
				СопоставитьКонтрагента(ЗначениеДопРеквизита, СтроковоеЗначение, СтроковоеЗначение, СтроковоеЗначение, СтроковоеЗначение);
				
			ИначеЕсли СтрокаТаблицы.Тип = Тип("СправочникСсылка.Пользователи") Тогда
				
				СопоставитьПользователя(ЗначениеДопРеквизита, СтроковоеЗначение);
				
			ИначеЕсли СтрокаТаблицы.Тип = Тип("СправочникСсылка.Проекты") Тогда
				
				СопоставитьПроект(ЗначениеДопРеквизита, СтроковоеЗначение);
				
			ИначеЕсли СтрокаТаблицы.Тип = Тип("СправочникСсылка.Сотрудники") Тогда
				
				СопоставитьСотрудника(ЗначениеДопРеквизита, СтроковоеЗначение);
				
			ИначеЕсли СтрокаТаблицы.Тип = Тип("СправочникСсылка.ФизическиеЛица") Тогда
				
				СопоставитьФизическоеЛицо(ЗначениеДопРеквизита, СтроковоеЗначение);
				
			ИначеЕсли СтрокаТаблицы.Тип = Тип("Булево") Тогда
				
				ПреобразоватьСтрокуВБулево(ЗначениеДопРеквизита, СтроковоеЗначение);
				
			ИначеЕсли СтрокаТаблицы.Тип = Тип("Строка") Тогда
				
				СкопироватьСтрокуВЗначениеСтроковогоТипа(ЗначениеДопРеквизита, СтроковоеЗначение);
				
			ИначеЕсли СтрокаТаблицы.Тип = Тип("Дата") Тогда
				
				ПреобразоватьСтрокуВДату(ЗначениеДопРеквизита, СтроковоеЗначение);
				
			ИначеЕсли СтрокаТаблицы.Тип = Тип("Число") Тогда
				
				ПреобразоватьСтрокуВЧисло(ЗначениеДопРеквизита, СтроковоеЗначение);
				Если ЗначениеДопРеквизита = 0 Тогда // 0 игнорируем
					
					ЗначениеДопРеквизита = Неопределено;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗначениеДопРеквизита <> Неопределено Тогда
				
				СтрокаТаблицыФормы[ЭлементСоответствия.Значение] = ЗначениеДопРеквизита;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиКонтрагентаПоИНН_КПП(ИНН, КПП) Экспорт
	Перем Контрагент;
	
	Запрос = Новый Запрос("ВЫБРАТЬ Справочник.Контрагенты.Ссылка ГДЕ НЕ ЭтоГруппа И ИНН = &ИНН");
	Запрос.УстановитьПараметр("ИНН", ИНН);
	
	Если НЕ ПустаяСтрока(КПП) Тогда
		
		Запрос.Текст = Запрос.Текст + " И КПП = &КПП";
		Запрос.УстановитьПараметр("КПП", КПП);
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Контрагент = Выборка.Ссылка;
		
	КонецЕсли;
	
	Возврат Контрагент;
	
КонецФункции

Процедура СопоставитьСтрануПроисхождения(СтранаПроисхождения, СтранаПроисхождения_ВходящиеДанные, ЗначениеПоУмолчанию) Экспорт
	Перем СправочникСсылка;
	
	// Справочник страны мира
	Если НЕ ПустаяСтрока(СтранаПроисхождения_ВходящиеДанные) Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		СправочникСсылка = УправлениеКонтактнойИнформацией.СтранаМираПоКодуИлиНаименованию(СтранаПроисхождения_ВходящиеДанные);
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	СтранаПроисхождения = ?(ЗначениеЗаполнено(СправочникСсылка), СправочникСсылка, ЗначениеПоУмолчанию);
	
КонецПроцедуры

Процедура СопоставитьНомерГТД(НомерГТД, НомерГТД_ВходящиеДанные) Экспорт
	
	Если НЕ ПустаяСтрока(НомерГТД_ВходящиеДанные) Тогда
		
		НомерГТД = Справочники.НомераГТД.НайтиПоКоду(НомерГТД_ВходящиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

// Спецификация

Процедура СопоставитьТипСтроки(ТипСтроки, ТипСтроки_ВходящиеДанные, ЗначениеПоУмолчанию) Экспорт
	
	СопоставитьПеречисление("ТипыСтрокСоставаСпецификации", ТипСтроки, ТипСтроки_ВходящиеДанные, ЗначениеПоУмолчанию);
	
КонецПроцедуры

Процедура СопоставитьСпецификацию(Спецификация, Спецификация_ВходящиеДанные, Номенклатура) Экспорт
	
	Если ЗначениеЗаполнено(Номенклатура) 
		И НЕ ПустаяСтрока(Спецификация_ВходящиеДанные) Тогда
		
		СправочникСсылка = Справочники.Спецификации.НайтиПоНаименованию(Спецификация_ВходящиеДанные, Ложь, , Номенклатура);
		Если ЗначениеЗаполнено(СправочникСсылка) Тогда
			
			Спецификация = СправочникСсылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Номенклатура

Процедура СопоставитьТипНоменклатуры(ТипНоменклатуры, ТипНоменклатуры_ВходящиеДанные, ЗначениеПоУмолчанию) Экспорт
	
	СопоставитьПеречисление("ТипыНоменклатуры", ТипНоменклатуры, ТипНоменклатуры_ВходящиеДанные, ЗначениеПоУмолчанию);
	
КонецПроцедуры

Процедура СопоставитьМетодОценки(МетодОценки, МетодОценки_ВходящиеДанные, ЗначениеПоУмолчанию) Экспорт
	
	СопоставитьПеречисление("МетодОценкиЗапасов", МетодОценки, МетодОценки_ВходящиеДанные, ЗначениеПоУмолчанию);
	
КонецПроцедуры

Процедура СопоставитьНаправлениеДеятельности(НаправлениеДеятельности, НаправлениеДеятельности_ВходящиеДанные, ЗначениеПоУмолчанию) Экспорт
	
	ИспользованиеВключено = ПолучитьФункциональнуюОпцию("УчетПоНесколькимНаправлениямДеятельности");
	Если НЕ ИспользованиеВключено Тогда
		
		// Нельзя заполнять значением по умолчанию, например, потому, что оно может прийти из пользовательских настроек.
		// 
		НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
		
	Иначе
		
		СправочникПоНаименованию("НаправленияДеятельности", НаправлениеДеятельности, НаправлениеДеятельности_ВходящиеДанные, ЗначениеПоУмолчанию);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьКатегориюНоменклатуры(КатегорияНоменклатуры, КатегорияНоменклатуры_ВходящиеДанные, ЗначениеПоУмолчанию) Экспорт
	
	Если НЕ ПустаяСтрока(КатегорияНоменклатуры_ВходящиеДанные) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НаименованиеТочное", КатегорияНоменклатуры_ВходящиеДанные);
		Запрос.УстановитьПараметр("НаименованиеПодобное", КатегорияНоменклатуры_ВходящиеДанные + "%");
		
		Запрос.Текст =
		"ВЫБРАТЬ Ссылка ИЗ Справочник.КатегорииНоменклатуры ГДЕ Наименование = &НаименованиеТочное И НЕ ЭтоГруппа
		|;ВЫБРАТЬ Ссылка ИЗ Справочник.КатегорииНоменклатуры ГДЕ Наименование ПОДОБНО &НаименованиеПодобное И НЕ ЭтоГруппа";
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		Если НЕ РезультатЗапроса[0].Пустой() Тогда
			
			Выборка = РезультатЗапроса[0].Выбрать();
			КатегорияНоменклатуры = ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(КатегорияНоменклатуры)
			И НЕ РезультатЗапроса[1].Пустой() Тогда
			
			Выборка = РезультатЗапроса[1].Выбрать();
			КатегорияНоменклатуры = ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КатегорияНоменклатуры) Тогда
		
		КатегорияНоменклатуры = ЗначениеПоУмолчанию;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьПродукциюПоЕГАИС(КодПродукцииЕГАИС, КодПродукцииЕГАИС_ВходящиеДанные) Экспорт
	
	Если ПустаяСтрока(КодПродукцииЕГАИС_ВходящиеДанные) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.Ссылка КАК ПродукцияЕГАИС ГДЕ Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.Код = &КодПродукцииЕГАИС");
	Запрос.УстановитьПараметр("КодПродукцииЕГАИС", КодПродукцииЕГАИС_ВходящиеДанные);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			
			КодПродукцииЕГАИС = Выборка.ПродукцияЕГАИС;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьТоварнуюНоменклатуруВЭД(ТоварнаяНоменклатураВЭД, ТоварнаяНоменклатураВЭД_ВходящиеДанные) Экспорт
	
	Если ПустаяСтрока(ТоварнаяНоменклатураВЭД_ВходящиеДанные) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ СправочникТНВЭД.Ссылка ИЗ Справочник.КлассификаторТНВЭД КАК СправочникТНВЭД ГДЕ СправочникТНВЭД.Код = &КодТНВЭД");
	Запрос.УстановитьПараметр("КодТНВЭД", ТоварнаяНоменклатураВЭД_ВходящиеДанные);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			
			ТоварнаяНоменклатураВЭД = Выборка.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьПоставщика(Поставщик, Поставщик_ВходящиеДанные) Экспорт
	
	Если ПустаяСтрока(Поставщик_ВходящиеДанные) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// :::Поиск ИНН и КПП
	Разделители = Новый Массив;
	Разделители.Добавить("/");
	Разделители.Добавить("\");
	Разделители.Добавить("-");
	Разделители.Добавить("|");
	
	ИНН = "";
	КПП = "";
	
	Для каждого ЗначениеРазделителя Из Разделители Цикл
		
		ПозицияРазделителя = СтрНайти(Поставщик_ВходящиеДанные, ЗначениеРазделителя);
		Если ПозицияРазделителя = 0 Тогда 
			
			Продолжить;
			
		КонецЕсли;
		
		ИНН = Лев(Поставщик_ВходящиеДанные, ПозицияРазделителя - 1);
		КПП = Сред(Поставщик_ВходящиеДанные, ПозицияРазделителя + 1);
		
		Запрос = Новый Запрос("ВЫБРАТЬ Справочник.Контрагенты.Ссылка ГДЕ НЕ ЭтоГруппа И ИНН = &ИНН И КПП = &КПП");
		Запрос.УстановитьПараметр("ИНН", ИНН);
		Запрос.УстановитьПараметр("КПП", КПП);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Поставщик = Выборка.Ссылка;
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// :::Поиск ИНН
	Запрос = Новый Запрос("ВЫБРАТЬ Справочник.Контрагенты.Ссылка ГДЕ НЕ ЭтоГруппа И ИНН = &ИНН");
	Запрос.УстановитьПараметр("ИНН", Поставщик_ВходящиеДанные);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Поставщик = Выборка.Ссылка;
		Возврат;
		
	КонецЕсли;
	
	СправочникСсылка = Справочники.Контрагенты.НайтиПоНаименованию(Поставщик_ВходящиеДанные, Ложь);
	Если ЗначениеЗаполнено(СправочникСсылка) Тогда
		
		Поставщик = СправочникСсылка;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьСтруктурнуюЕдиницу(Склад, Склад_ВходящиеДанные, ЗначениеПоУмолчанию) Экспорт
	
	СправочникПоНаименованию("СтруктурныеЕдиницы", Склад, Склад_ВходящиеДанные, ЗначениеПоУмолчанию);
	
КонецПроцедуры

Процедура СопоставитьСклад(Склад, Склад_ВходящиеДанные, ЗначениеПоУмолчанию) Экспорт
	
	СправочникПоНаименованию("Склады", Склад, Склад_ВходящиеДанные, ЗначениеПоУмолчанию);
	
КонецПроцедуры

Процедура СопоставитьСпособПополнения(СпособПополнения, СпособПополнения_ВходящиеДанные, ЗначениеПоУмолчанию) Экспорт
	
	СопоставитьПеречисление("СпособыПополненияЗапасов", СпособПополнения, СпособПополнения_ВходящиеДанные, ЗначениеПоУмолчанию);
	
КонецПроцедуры

Процедура СопоставитьРольПользователя(РольПользователя, РольПользователя_ВходящиеДанные, ЗначениеПоУмолчанию) Экспорт
	
	СопоставитьПеречисление("РольПользователя", РольПользователя, РольПользователя_ВходящиеДанные, ЗначениеПоУмолчанию);
	
КонецПроцедуры

Процедура СопоставитьСтавкуНДС(СтавкаНДС, СтавкаНДС_ВходящиеДанные, ЗначениеПоУмолчанию) Экспорт
	
	СопоставитьПеречисление("СтавкиНДС", СтавкаНДС, СтавкаНДС_ВходящиеДанные, ЗначениеПоУмолчанию);
	
КонецПроцедуры

Процедура СопоставитьЯчейку(Ячейка, Ячейка_ВходящиеДанные, ЗначениеПоУмолчанию) Экспорт
	
	СправочникПоНаименованию("Ячейки", Ячейка, Ячейка_ВходящиеДанные, ЗначениеПоУмолчанию);
	
КонецПроцедуры

Процедура СопоставитьЦеновуюГруппу(ЦеноваяГруппа, ЦеноваяГруппа_ВходящиеДанные, ЗначениеПоУмолчанию) Экспорт
	
	СправочникПоНаименованию("ЦеновыеГруппы", ЦеноваяГруппа, ЦеноваяГруппа_ВходящиеДанные, ЗначениеПоУмолчанию);
	
КонецПроцедуры

Процедура ДобавитьЗаписьСопоставленияПоИНН_КПП(ОрганизацияЕГАИС, Контрагент)
	
	// Пробуем сами сопоставить
	Контрагент = НайтиКонтрагентаПоИНН_КПП(ОрганизацияЕГАИС.ИНН, ОрганизацияЕГАИС.КПП);
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		СпрОбъект = ОрганизацияЕГАИС.ПолучитьОбъект();
		СпрОбъект.Контрагент = Контрагент;
		СпрОбъект.Сопоставлено = Истина;
		СпрОбъект.СоответствуетОрганизации = Ложь;
		СпрОбъект.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКонтрагентовПоСоответствиюЕГАИС(Производитель, Импортер) Экспорт
	
	СопоставленныеДанные = Новый Структура("Производитель, Импортер");
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Производитель", Производитель);
	Запрос.УстановитьПараметр("Импортер", Импортер);
	
	Запрос.Текст = 
	"ВЫБРАТЬ Справочник.КлассификаторОрганизацийЕГАИС.* ГДЕ Ссылка = &Производитель;
	|ВЫБРАТЬ Справочник.КлассификаторОрганизацийЕГАИС.* ГДЕ Ссылка = &Импортер";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	// :::Производитель
	ВыборкаПроизводитель = РезультатЗапроса[0].Выбрать();
	Если ВыборкаПроизводитель.Следующий() Тогда
		
		СопоставленныеДанные.Производитель = ВыборкаПроизводитель.Контрагент;
		
	ИначеЕсли ЗначениеЗаполнено(Производитель) Тогда
		
		ДобавитьЗаписьСопоставленияПоИНН_КПП(Производитель, СопоставленныеДанные.Производитель);
		
	КонецЕсли;
	
	ВыборкаИмпортер = РезультатЗапроса[1].Выбрать();
	Если ВыборкаИмпортер.Следующий() Тогда
		
		СопоставленныеДанные.Импортер = ВыборкаПроизводитель.Контрагент;
		
	ИначеЕсли ЗначениеЗаполнено(Импортер) Тогда
		
		ДобавитьЗаписьСопоставленияПоИНН_КПП(Импортер, СопоставленныеДанные.Импортер);
		
	КонецЕсли;
		
	Возврат СопоставленныеДанные;
	
КонецФункции

Процедура СопоставитьСерийныйНомер(НоменклатураСсылка, СерийныйНомер, СерийныйНомер_ВходящиеДанные) Экспорт
	
	Если ЗначениеЗаполнено(НоменклатураСсылка) И ЗначениеЗаполнено(СерийныйНомер_ВходящиеДанные) Тогда
		
		СправочникСсылка = Справочники.СерийныеНомера.НайтиПоНаименованию(СерийныйНомер_ВходящиеДанные, Ложь, , НоменклатураСсылка);
		Если ЗначениеЗаполнено(СправочникСсылка) Тогда
			
			СерийныйНомер = СправочникСсылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Характеристики номенклатуры

Процедура СопоставитьХарактеристикуПоНаименованию(Характеристика, ХарактеристикаНаименование_ВходящиеДанные, ХарактеристикаНаименованиеДляПечати_ВходящиеДанные, ВладелецХарактеристики) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВладелецХарактеристики) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ХарактеристикаНаименование_ВходящиеДанные) Тогда
		
		СправочникСсылка = Неопределено;
		СправочникСсылка = Справочники.ПартииНоменклатуры.НайтиПоНаименованию(ХарактеристикаНаименование_ВходящиеДанные, Ложь, , ВладелецХарактеристики);
		Если НЕ ЗначениеЗаполнено(СправочникСсылка)
			И НЕ ПустаяСтрока(ХарактеристикаНаименованиеДляПечати_ВходящиеДанные) Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("НаименованиеДляПечати", ХарактеристикаНаименованиеДляПечати_ВходящиеДанные);
			Запрос.УстановитьПараметр("ВладелецХарактеристики", ВладелецХарактеристики);
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СпрХарактеристики.Ссылка КАК Ссылка
			|ИЗ Справочник.ПартииНоменклатуры КАК СпрХарактеристики 
			|ГДЕ Владелец = &ВладелецХарактеристики 
			|	И НаименованиеДляПечати ПОДОБНО &НаименованиеДляПечати";
			
			ВыборкаРезультата = Запрос.Выполнить().Выбрать();
			Если ВыборкаРезультата.Следующий() Тогда
				
				СправочникСсылка = ВыборкаРезультата.Ссылка;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СправочникСсылка) Тогда
			
			Характеристика = СправочникСсылка;
			
		КонецЕсли;
	
	конецЕсли;
	
КонецПроцедуры

// Заказы

Процедура СопоставитьЗаказ(Заказ, Заказ_ВходящиеДанные, Организация = Неопределено) Экспорт
	
	Если ПустаяСтрока(Заказ_ВходящиеДанные) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МассивТеговПоставщиков = Новый Массив;
	МассивТеговПоставщиков.Добавить("Заказ поставщику");
	МассивТеговПоставщиков.Добавить("ЗаказПоставщику");
	МассивТеговПоставщиков.Добавить("Поставщику");
	МассивТеговПоставщиков.Добавить("Поставщик");
	МассивТеговПоставщиков.Добавить("Пост");
	
	НомерДляПоиска	= Заказ_ВходящиеДанные;
	ВидДокумента	= "ЗаказПокупателя";
	Для каждого ТегИзМассива Из МассивТеговПоставщиков Цикл
		
		Если СтрНайти(Заказ_ВходящиеДанные, ТегИзМассива) > 0 Тогда
			
			ВидДокумента = "ЗаказПоставщику";
			НомерДляПоиска = СокрЛП(СтрЗаменить(НомерДляПоиска, "", ТегИзМассива));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номер", "%" + НомерДляПоиска);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.Номер КАК Номер
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Номер ПОДОБНО &Номер
	|	И (ТаблицаДокумента.Организация = &Организация
	|			ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаДокумента.Дата УБЫВ";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаказПокупателя", ВидДокумента);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТочноеСовпадение = Неопределено;
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Номер = НомерДляПоиска Тогда
			ТочноеСовпадение = Выборка.Ссылка;
			Прервать;
		КонецЕсли; 
		НомерНаПечать = ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Выборка.Номер, Истина, Истина);// ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Истина, Истина);
		Если НомерНаПечать = НомерДляПоиска Тогда
			ТочноеСовпадение = Выборка.Ссылка;
			Прервать;
		КонецЕсли; 
		НомерБезПрефиксов = ФормированиеПечатныхФорм.УдалитьПользовательскиеПрефиксыИзНомераОбъекта(Выборка.Номер);
		НомерБезПрефиксов = ФормированиеПечатныхФорм.УдалитьПрефиксыИзНомераОбъекта(НомерБезПрефиксов, Истина, Истина);
		Если НомерБезПрефиксов = НомерДляПоиска Тогда
			ТочноеСовпадение = Выборка.Ссылка;
			Прервать;
		КонецЕсли; 
			
	КонецЦикла;
	Если ЗначениеЗаполнено(ТочноеСовпадение) Тогда
		Заказ = ТочноеСовпадение;
	КонецЕсли; 
	
КонецПроцедуры

// Контрагент

Процедура СопоставитьКонтрагента(Контрагент, КодСинхронизации, КонтрагентНаименование, МассивТелефонов, НомерПоиска) Экспорт
	
	// Номер поиска
	// 0 - Наименование
	// 1 - Телефон
	// 2 - Код синхронизаци
	
	Если НомерПоиска = 0
		И ЗначениеЗаполнено(КонтрагентНаименование) Тогда
			
			СправочникСсылка = Справочники.Контрагенты.НайтиПоНаименованию(КонтрагентНаименование, Истина);
			Если ЗначениеЗаполнено(СправочникСсылка)
				И НЕ СправочникСсылка.ЭтоГруппа Тогда
				
				Контрагент = СправочникСсылка;
				
			Иначе
				
				КонтрагентНаименованиеЭкранировано = СтрЗаменить(КонтрагентНаименование, "[", "\[");
				КонтрагентНаименованиеЭкранировано = СтрЗаменить(КонтрагентНаименованиеЭкранировано, "]", "\]");
				
				Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Контрагенты.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Контрагенты КАК Контрагенты
				|ГДЕ
				|	НЕ Контрагенты.ЭтоГруппа
				|	И Контрагенты.Наименование ПОДОБНО &Наименование СПЕЦСИМВОЛ ""\""
				|	И НЕ Контрагенты.ПометкаУдаления");
				Запрос.УстановитьПараметр("Наименование", КонтрагентНаименованиеЭкранировано + "%");
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					
					Контрагент = Выборка.Ссылка;
					
				КонецЕсли;
				
			КонецЕсли;		
		
	ИначеЕсли НомерПоиска = 1
		И ЗначениеЗаполнено(МассивТелефонов) Тогда
			
			Запрос = Новый Запрос;
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	КонтрагентыКонтактнаяИнформация.Ссылка
			|ИЗ
			|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
			|ГДЕ
			|	КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
			|	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКлиента)
			|	И (КонтрагентыКонтактнаяИнформация.НомерТелефона В (&МассивТелефонов)
			|			ИЛИ ВЫРАЗИТЬ(КонтрагентыКонтактнаяИнформация.Представление КАК СТРОКА(100)) В (&МассивТелефонов))
			|	И НЕ КонтрагентыКонтактнаяИнформация.Ссылка.ПометкаУдаления
			|	И НЕ КонтрагентыКонтактнаяИнформация.Ссылка.ЭтоГруппа";
			
			Запрос.УстановитьПараметр("МассивТелефонов", МассивТелефонов);
			
			Запрос.Текст = ТекстЗапроса;
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Контрагент = Выборка.Ссылка;
			КонецЦикла;
					
	ИначеЕсли НомерПоиска = 2
		И ЗначениеЗаполнено(КодСинхронизации) Тогда
			
			Попытка
				СправочникСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("КодСинхронизации", КодСинхронизации);		
			Исключение
				СправочникСсылка = Справочники.Контрагенты.ПустаяСсылка();
			КонецПопытки;
			
			Если НЕ СправочникСсылка.Пустая() Тогда
				
				Контрагент = СправочникСсылка;
				
			КонецЕсли;
		
	КонецЕсли;
	
	// 
	// 
	// // :::Поиск ИНН и КПП
	// Если НЕ ПустаяСтрока(ИНН_КПП) Тогда
	// 	
	// 	Разделители = Новый Массив;
	// 	Разделители.Добавить("/");
	// 	Разделители.Добавить("\");
	// 	Разделители.Добавить("-");
	// 	Разделители.Добавить("|");
	// 	
	// 	ИНН = "";
	// 	КПП = "";
	// 	
	// 	Для каждого ЗначениеРазделителя Из Разделители Цикл
	// 		
	// 		ПозицияРазделителя = СтрНайти(ИНН_КПП, ЗначениеРазделителя);
	// 		Если ПозицияРазделителя = 0 Тогда 
	// 			
	// 			Продолжить;
	// 			
	// 		КонецЕсли;
	// 		
	// 		ИНН = Лев(ИНН_КПП, ПозицияРазделителя - 1);
	// 		КПП = Сред(ИНН_КПП, ПозицияРазделителя + 1);
	// 		
	// 	КонецЦикла;
	// 
	// 	// Если не было разделителя, то предполагаю, что это все ИНН
	// 	Если ИНН = "" И КПП = "" Тогда
	// 		
	// 		ИНН = ИНН_КПП;
	// 		
	// 	КонецЕсли;
	// 	
	// 	Контрагент = НайтиКонтрагентаПоИНН_КПП(ИНН, КПП);
	// 	Если ЗначениеЗаполнено(Контрагент) Тогда
	// 		
	// 		Возврат;
	// 		
	// 	КонецЕсли;
	// 	
	// КонецЕсли;
	// 
	// Если НЕ ПустаяСтрока(КонтрагентНаименование) Тогда
	// 	
	// 	СправочникСсылка = Справочники.Контрагенты.НайтиПоНаименованию(КонтрагентНаименование, Ложь);
	// 	Если ЗначениеЗаполнено(СправочникСсылка) Тогда
	// 		
	// 		Контрагент = СправочникСсылка;
	// 		Возврат;
	// 		
	// 	КонецЕсли;
	// 	
	// КонецЕсли;
	// 
	// // :::Номер расчетного счета
	// Если НЕ ПустаяСтрока(РасчетныйСчет) Тогда
	// 	
	// 	СправочникСсылка = Справочники.БанковскиеСчета.НайтиПоРеквизиту("НомерСчета", РасчетныйСчет);
	// 	Если ЗначениеЗаполнено(СправочникСсылка) Тогда
	// 		
	// 		Контрагент = СправочникСсылка.Владелец;
	// 		
	// 	КонецЕсли;
	// 	
	// КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьФизическоеЛицо(ФизическоеЛицо, ФизическоеЛицо_ВходящиеДанные) Экспорт
	
	СправочникПоНаименованию("ФизическиеЛица", ФизическоеЛицо, ФизическоеЛицо_ВходящиеДанные, Неопределено);
	
КонецПроцедуры

Процедура СопоставитьГруппуДоступа(ГруппаДоступа, ГруппаДоступа_ВходящиеДанные) Экспорт
	
	СправочникПоНаименованию("ГруппыДоступаКонтрагентов", ГруппаДоступа, ГруппаДоступа_ВходящиеДанные);
	
КонецПроцедуры

Процедура СопоставитьВидыКонтрагентов(ВидыКонтрагентов, ВидыКонтрагентов_ВходящиеДанные, ЗначениеПоУмолчанию) Экспорт
	
	Если ПустаяСтрока(ВидыКонтрагентов_ВходящиеДанные) Тогда
		
		ВидыКонтрагентов = ЗначениеПоУмолчанию;
		
	Иначе
		
		Если ВРЕГ(ВидыКонтрагентов_ВходящиеДанные) = ВРЕГ("Юр. лицо")
			ИЛИ ВидыКонтрагентов_ВходящиеДанные = "1" Тогда
			
			ВидыКонтрагентов = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
			
		ИначеЕсли ВРЕГ(ВидыКонтрагентов_ВходящиеДанные) = ВРЕГ("ИП")
			ИЛИ ВидыКонтрагентов_ВходящиеДанные = "2" Тогда
			
			ВидыКонтрагентов = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель;
			
		ИначеЕсли ВРЕГ(ВидыКонтрагентов_ВходящиеДанные) = ВРЕГ("Физ. лицо")
			ИЛИ ВидыКонтрагентов_ВходящиеДанные = "3" Тогда
			
			ВидыКонтрагентов = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
			
		Иначе
			
			ВидыКонтрагентов = ЗначениеПоУмолчанию;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьПолФизическогоЛица(Пол, Пол_ВходящиеДанные) Экспорт
	
	Если ВРЕГ(Пол_ВходящиеДанные) = ВРЕГ("М")
		ИЛИ ВРЕГ(Пол_ВходящиеДанные) = ВРЕГ("М.")
		ИЛИ ВРЕГ(Пол_ВходящиеДанные) = ВРЕГ("Муж")
		ИЛИ ВРЕГ(Пол_ВходящиеДанные) = ВРЕГ("Муж.")
		ИЛИ ВРЕГ(Пол_ВходящиеДанные) = ВРЕГ("Мужской")
		ИЛИ ВРЕГ(Пол_ВходящиеДанные) = ВРЕГ("+") Тогда
		
		Пол = Перечисления.ПолФизическогоЛица.Мужской;
		
	ИначеЕсли ВРЕГ(Пол_ВходящиеДанные) = ВРЕГ("Ж")
		ИЛИ ВРЕГ(Пол_ВходящиеДанные) = ВРЕГ("Ж.")
		ИЛИ ВРЕГ(Пол_ВходящиеДанные) = ВРЕГ("Жен")
		ИЛИ ВРЕГ(Пол_ВходящиеДанные) = ВРЕГ("Жен.")
		ИЛИ ВРЕГ(Пол_ВходящиеДанные) = ВРЕГ("Женский")
		ИЛИ ВРЕГ(Пол_ВходящиеДанные) = ВРЕГ("-") Тогда
		
		Пол = Перечисления.ПолФизическогоЛица.Женский;
		
	КонецЕсли;
	
КонецПроцедуры

// Контактные лица

Процедура СопоставитьКонтактноеЛицо(КонтактноеЛицо, КонтактноеЛицоНаименование, КонтактноеЛицоКод) Экспорт
	
	Если НЕ ПустаяСтрока(КонтактноеЛицоНаименование) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("КонтактноеЛицоКод", КонтактноеЛицоКод);
		Запрос.УстановитьПараметр("НаименованиеТочное", КонтактноеЛицоНаименование);
		Запрос.УстановитьПараметр("НаименованиеПодобное", КонтактноеЛицоНаименование + "%");
		
		Запрос.Текст =
		"ВЫБРАТЬ Ссылка, Код, Наименование ПОМЕСТИТЬ СпрКонтактныеЛица ИЗ Справочник.КонтактныеЛица ГДЕ НЕ ЭтоГруппа Индексировать ПО Код, Наименование
		|;ВЫБРАТЬ СпрКонтактныеЛица.Ссылка ИЗ СпрКонтактныеЛица КАК СпрКонтактныеЛица ГДЕ СпрКонтактныеЛица.Код = &КонтактноеЛицоКод
		|;ВЫБРАТЬ СпрКонтактныеЛица.Ссылка ИЗ СпрКонтактныеЛица КАК СпрКонтактныеЛица ГДЕ СпрКонтактныеЛица.Наименование = &НаименованиеТочное
		|;ВЫБРАТЬ СпрКонтактныеЛица.Ссылка ИЗ СпрКонтактныеЛица КАК СпрКонтактныеЛица ГДЕ СпрКонтактныеЛица.Наименование ПОДОБНО &НаименованиеПодобное";
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		Если НЕ РезультатЗапроса[1].Пустой() Тогда
			
			Выборка = РезультатЗапроса[1].Выбрать();
			КонтактноеЛицо = ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(КонтактноеЛицо)
			И НЕ РезультатЗапроса[2].Пустой() Тогда
			
			Выборка = РезультатЗапроса[2].Выбрать();
			КонтактноеЛицо = ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(КонтактноеЛицо)
			И НЕ РезультатЗапроса[3].Пустой() Тогда
			
			Выборка = РезультатЗапроса[3].Выбрать();
			КонтактноеЛицо = ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьИсточникиПривлеченияПокупателей(ИсточникПривлечения, ИсточникПривлечения_ВходящиеДанные) Экспорт
	
	СправочникПоНаименованию("ИсточникиПривлеченияПокупателей", ИсточникПривлечения, ИсточникПривлечения_ВходящиеДанные);
	
КонецПроцедуры

// Лиды

Процедура СопоставитьЛид(Лид, ЛидНаименование, ЛидКод) Экспорт
	
	Если НЕ ПустаяСтрока(ЛидНаименование) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЛидКод", ЛидКод);
		Запрос.УстановитьПараметр("НаименованиеТочное", ЛидНаименование);
		Запрос.УстановитьПараметр("НаименованиеПодобное", ЛидНаименование + "%");
		
		Запрос.Текст =
		"ВЫБРАТЬ Ссылка, Код, Наименование ПОМЕСТИТЬ СпрЛиды ИЗ Справочник.Лиды ГДЕ НЕ ЭтоГруппа Индексировать ПО Код, Наименование
		|;ВЫБРАТЬ СпрЛиды.Ссылка ИЗ СпрЛиды КАК СпрЛиды ГДЕ СпрЛиды.Код = &ЛидКод
		|;ВЫБРАТЬ СпрЛиды.Ссылка ИЗ СпрЛиды КАК СпрЛиды ГДЕ СпрЛиды.Наименование = &НаименованиеТочное
		|;ВЫБРАТЬ СпрЛиды.Ссылка ИЗ СпрЛиды КАК СпрЛиды ГДЕ СпрЛиды.Наименование ПОДОБНО &НаименованиеПодобное";
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		Если НЕ РезультатЗапроса[1].Пустой() Тогда
			
			Выборка = РезультатЗапроса[1].Выбрать();
			Лид = ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Лид)
			И НЕ РезультатЗапроса[2].Пустой() Тогда
			
			Выборка = РезультатЗапроса[2].Выбрать();
			Лид = ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Лид)
			И НЕ РезультатЗапроса[3].Пустой() Тогда
			
			Выборка = РезультатЗапроса[3].Выбрать();
			Лид = ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьСостояниеЛида(СостояниеЛида, СостояниеЛида_ВходящиеДанные, ЗначениеПоУмолчанию) Экспорт
	
	СправочникПоНаименованию("СостоянияЛидов", СостояниеЛида, СостояниеЛида_ВходящиеДанные, ЗначениеПоУмолчанию);
	
КонецПроцедуры

Процедура СопоставитьГруппуДоступаЛида(ГруппаДоступа, ГруппаДоступа_ВходящиеДанные) Экспорт
	
	СправочникПоНаименованию("ГруппыДоступаЛидов", ГруппаДоступа, ГруппаДоступа_ВходящиеДанные);
	
КонецПроцедуры

// Цены номенклатуры

Процедура СопоставитьВидЦен(ВидЦен, ВидЦен_ВходящиеДанные, ЗначениеПоУмолчанию) Экспорт
	
	Если НЕ ПустаяСтрока(ВидЦен_ВходящиеДанные) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ВидЦен_ВходящиеДанные", СокрЛП(ВидЦен_ВходящиеДанные));
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СпрВидыЦен.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыЦен КАК СпрВидыЦен
		|ГДЕ
		|	СпрВидыЦен.Наименование ПОДОБНО &ВидЦен_ВходящиеДанные
		|	И НЕ СпрВидыЦен.ПометкаУдаления
		|	И НЕ СпрВидыЦен.ЭтоГруппа";
		Запрос.УстановитьПараметр("ВидЦен_ВходящиеДанные", ВидЦен_ВходящиеДанные + "%");
		Выборка = Запрос.Выполнить().Выбрать();            
		
		ВидЦен = ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидЦен) Тогда
		
		ВидЦен = ЗначениеПоУмолчанию;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьУпаковку(Упаковка, Упаковка_ВходящиеДанные, Номенклатура, ЗначениеПоУмолчанию) Экспорт
	
	Если НЕ ПустаяСтрока(Упаковка_ВходящиеДанные) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Упаковка_ВходящиеДанные", СокрЛП(Упаковка_ВходящиеДанные));
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УпаковкиНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
		|ГДЕ
		|	НЕ УпаковкиНоменклатуры.ПометкаУдаления
		|	И УпаковкиНоменклатуры.Наименование ПОДОБНО &Упаковка_ВходящиеДанные
		|	И УпаковкиНоменклатуры.Владелец = &Владелец";
		Запрос.УстановитьПараметр("Упаковка_ВходящиеДанные", Упаковка_ВходящиеДанные + "%");
		Запрос.УстановитьПараметр("Владелец", Номенклатура);
		Выборка = Запрос.Выполнить().Выбрать();            
		
		Упаковка = ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Упаковка) Тогда
		
		Упаковка = ЗначениеПоУмолчанию;
		
	КонецЕсли;
	
КонецПроцедуры

// Ввод начальных остатков

Процедура СопоставитьДоговор(Контрагент, Договор, Договор_ВходящиеДанные) Экспорт
	
	Если ЗначениеЗаполнено(Контрагент) 
		И ЗначениеЗаполнено(Договор_ВходящиеДанные) Тогда
		
		СправочникСсылка = Неопределено;
		СправочникСсылка = Справочники.ДоговорыКонтрагентов.НайтиПоНаименованию(Договор_ВходящиеДанные, Ложь, , Контрагент);
		Если НЕ ЗначениеЗаполнено(СправочникСсылка) Тогда
			
			СправочникСсылка = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("НомерДоговора", Договор_ВходящиеДанные, , Контрагент);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СправочникСсылка) Тогда
			
			Договор = СправочникСсылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьЗаказПоНомеруДате(Заказ, НазваниеТипаДокумента, Контрагент, Номер_ВходящиеДанные, Дата_ВходящиеДанные) Экспорт
	
	Если ПустаяСтрока(Номер_ВходящиеДанные) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если НазваниеТипаДокумента <> "ЗаказПоставщику" Тогда
		
		НазваниеТипаДокумента = "ЗаказПокупателя"
		
	КонецЕсли;
	
	ИмяТаблицы = "Документ." + НазваниеТипаДокумента;
	
	Запрос = Новый Запрос("ВЫБРАТЬ Заказ.Ссылка ИЗ &ИмяТаблицы КАК Заказ ГДЕ Заказ.Контрагент = &Контрагент И Заказ.Номер ПОДОБНО &Номер");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", ИмяТаблицы);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номер", "%" + Номер_ВходящиеДанные + "%");
	
	Если НЕ ПустаяСтрока(Дата_ВходящиеДанные) Тогда
		
		ДатаИзСтроки = Дата('00010101');
		ПреобразоватьСтрокуВДату(ДатаИзСтроки, Дата_ВходящиеДанные);
		
		Если ЗначениеЗаполнено(ДатаИзСтроки) Тогда
			
			Запрос.Текст = Запрос.Текст + " И Заказ.Дата Между &ДатаНачала И &ДатаОкончания";
			Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаИзСтроки));
			Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаИзСтроки));
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО Заказ.Дата УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Заказ = Выборка.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьРасчетныйДокументПоНомеруДате(Документ, НазваниеТипаДокумента, Контрагент, Номер_ВходящиеДанные, Дата_ВходящиеДанные) Экспорт
	
	Если ПустаяСтрока(НазваниеТипаДокумента) 
		ИЛИ ПустаяСтрока(Номер_ВходящиеДанные) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СоответствиеИменДокументов = Новый Соответствие;
	
	СоответствиеИменДокументов.Вставить("ЗаказПокупателя", 		"ЗаказПокупателя");
	СоответствиеИменДокументов.Вставить("Заказы покупателей",	"ЗаказПокупателя");
	СоответствиеИменДокументов.Вставить("Заказ покупателя",		"ЗаказПокупателя");
	
	СоответствиеИменДокументов.Вставить("Взаимозачет",			"Взаимозачет");
	СоответствиеИменДокументов.Вставить("Корректировка долга",	"Взаимозачет");
	СоответствиеИменДокументов.Вставить("Корректировки долга",	"Взаимозачет");
	
	СоответствиеИменДокументов.Вставить("ОтчетКомиссионера",	"ОтчетКомиссионера");
	СоответствиеИменДокументов.Вставить("Отчет комиссионера",	"ОтчетКомиссионера");
	СоответствиеИменДокументов.Вставить("Отчеты комиссионеров",	"ОтчетКомиссионера");
	
	СоответствиеИменДокументов.Вставить("ОтчетОПереработке",	"ОтчетОПереработке");
	СоответствиеИменДокументов.Вставить("Отчет о переработке",	"ОтчетОПереработке");
	СоответствиеИменДокументов.Вставить("Отчеты о переработке",	"ОтчетОПереработке");
	
	СоответствиеИменДокументов.Вставить("ПоступлениеВКассу",	"ПоступлениеВКассу");
	СоответствиеИменДокументов.Вставить("Поступление в кассу",	"ПоступлениеВКассу");
	СоответствиеИменДокументов.Вставить("Поступления в кассу",	"ПоступлениеВКассу");
	СоответствиеИменДокументов.Вставить("ПКО",	"ПоступлениеВКассу");
	
	СоответствиеИменДокументов.Вставить("ПоступлениеНаСчет",	"ПоступлениеНаСчет");
	СоответствиеИменДокументов.Вставить("Поступление на счет",	"ПоступлениеНаСчет");
	СоответствиеИменДокументов.Вставить("Поступления на счет",	"ПоступлениеНаСчет");
	
	СоответствиеИменДокументов.Вставить("ПередачаВА",			"ПередачаВА");
	СоответствиеИменДокументов.Вставить("Продажа имущества",	"ПередачаВА");
	СоответствиеИменДокументов.Вставить("Продажи имущества",	"ПередачаВА");
	
	СоответствиеИменДокументов.Вставить("РасходнаяНакладная",	"РасходнаяНакладная");
	СоответствиеИменДокументов.Вставить("РН",					"РасходнаяНакладная");
	СоответствиеИменДокументов.Вставить("Расходная накладная",	"РасходнаяНакладная");
	СоответствиеИменДокументов.Вставить("Расходные накладные",	"РасходнаяНакладная");
	
	СоответствиеИменДокументов.Вставить("АвансовыйОтчет", "АвансовыйОтчет");
	СоответствиеИменДокументов.Вставить("Авансовый отчет", "АвансовыйОтчет");
	СоответствиеИменДокументов.Вставить("Авансовые отчеты", "АвансовыйОтчет");
	
	СоответствиеИменДокументов.Вставить("ДополнительныеРасходы", "ДополнительныеРасходы");
	СоответствиеИменДокументов.Вставить("Дополнительные расходы", "ДополнительныеРасходы");
	
	СоответствиеИменДокументов.Вставить("ОтчетКомитенту", "ОтчетКомитенту");
	СоответствиеИменДокументов.Вставить("Отчет комитенту", "ОтчетКомитенту");
	СоответствиеИменДокументов.Вставить("Отчеты комитентам", "ОтчетКомитенту");
	
	СоответствиеИменДокументов.Вставить("ОтчетПереработчика", "ОтчетПереработчика");
	СоответствиеИменДокументов.Вставить("Отчет переработчика", "ОтчетПереработчика");
	СоответствиеИменДокументов.Вставить("Отчеты переработчиков", "ОтчетПереработчика");
	
	СоответствиеИменДокументов.Вставить("ПриходнаяНакладная", "ПриходнаяНакладная");
	СоответствиеИменДокументов.Вставить("Приходная накладная", "ПриходнаяНакладная");
	СоответствиеИменДокументов.Вставить("Приходные накладные", "ПриходнаяНакладная");
	СоответствиеИменДокументов.Вставить("ПН", "ПриходнаяНакладная");
	
	СоответствиеИменДокументов.Вставить("РасходИзКассы", "РасходИзКассы");
	СоответствиеИменДокументов.Вставить("Расход из кассы", "РасходИзКассы");
	СоответствиеИменДокументов.Вставить("РКО", "РасходИзКассы");
	
	СоответствиеИменДокументов.Вставить("РасходСоСчета", "РасходСоСчета");
	СоответствиеИменДокументов.Вставить("Расход со счета", "РасходСоСчета");
	
	ТипДокумента = СоответствиеИменДокументов.Получить(НазваниеТипаДокумента);
	Если ТипДокумента = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ИмяТаблицы = "Документ." + ТипДокумента;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ДокументРасчетов.Ссылка ИЗ &ИмяТаблицы КАК ДокументРасчетов ГДЕ ДокументРасчетов.Контрагент = &Контрагент И ДокументРасчетов.Номер ПОДОБНО &Номер");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", ИмяТаблицы);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номер", "%" + Номер_ВходящиеДанные + "%");
	
	Если НЕ ПустаяСтрока(Дата_ВходящиеДанные) Тогда
		
		ДатаИзСтроки = Дата('00010101');
		ПреобразоватьСтрокуВДату(ДатаИзСтроки, Дата_ВходящиеДанные);
		
		Если ЗначениеЗаполнено(ДатаИзСтроки) Тогда
			
			Запрос.Текст = Запрос.Текст + " И ДокументРасчетов.Дата Между &ДатаНачала И &ДатаОкончания";
			Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаИзСтроки));
			Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаИзСтроки));
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО ДокументРасчетов.Дата УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Документ = Выборка.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьСчетПоНомеруДате(Счет, Контрагент, Номер_ВходящиеДанные, Дата_ВходящиеДанные) Экспорт
	
	Если ПустаяСтрока(Номер_ВходящиеДанные) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ Счет.Ссылка ИЗ Документ.СчетНаОплату КАК Счет ГДЕ Счет.Контрагент = &Контрагент И Счет.Номер ПОДОБНО &Номер");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номер", "%" + Номер_ВходящиеДанные + "%");
	
	Если НЕ ПустаяСтрока(Дата_ВходящиеДанные) Тогда
		
		ДатаИзСтроки = Дата('00010101');
		ПреобразоватьСтрокуВДату(ДатаИзСтроки, Дата_ВходящиеДанные);
		
		Если ЗначениеЗаполнено(ДатаИзСтроки) Тогда
			
			Запрос.Текст = Запрос.Текст + " И Счет.Дата Между &ДатаНачала И &ДатаОкончания";
			Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаИзСтроки));
			Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаИзСтроки));
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО Счет.Дата УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Счет = Выборка.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьВнеоборотныйАктив(ВнеоборотныйАктив, ВнеоборотныйАктив_ВходящиеДанные) Экспорт
	
	Если НЕ ПустаяСтрока(ВнеоборотныйАктив_ВходящиеДанные) Тогда
		
		СправочникСсылка = Справочники.ВнеоборотныеАктивы.НайтиПоНаименованию(ВнеоборотныйАктив_ВходящиеДанные, Истина);
		
		Если НЕ ЗначениеЗаполнено(СправочникСсылка) Тогда
			
			СправочникСсылка = Справочники.ВнеоборотныеАктивы.НайтиПоКоду(ВнеоборотныйАктив_ВходящиеДанные);
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СправочникСсылка) Тогда
		
		ВнеоборотныйАктив = СправочникСсылка;
		
	КонецЕсли;
	
КонецПроцедуры

// Полис страхования
Процедура СопоставитьТипПолиса(ТипПолиса, ТипПолиса_ВходящиеДанные, ЗначениеПоУмолчанию) Экспорт
	
	СопоставитьПеречисление("ТипыПолиса", ТипПолиса, ТипПолиса_ВходящиеДанные, ЗначениеПоУмолчанию);
	
КонецПроцедуры

Процедура СопоставитьВидМедицинскойКарты(ЗначениеДопРеквизита, СтроковоеЗначение) Экспорт
	
	Если ПустаяСтрока(СтроковоеЗначение) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ВидыМедицинскихКарт.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ВидыМедицинскихКарт КАК ВидыМедицинскихКарт
	                      |ГДЕ
	                      |	ВидыМедицинскихКарт.Наименование ПОДОБНО &Наименование");
	
	Запрос.УстановитьПараметр("Наименование", СокрЛП(СтроковоеЗначение));
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			
			ЗначениеДопРеквизита = Выборка.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Номер зауба
Процедура СопоставитьНомерЗуба(ЗначениеЗуба, ЗначениеЗуба_ВходящиеДанные, ЗначениеПоУмолчанию) Экспорт
	
	СопоставитьПеречисление("Зубы", ЗначениеЗуба, ЗначениеЗуба_ВходящиеДанные, ЗначениеПоУмолчанию);
	
КонецПроцедуры


#КонецОбласти

#КонецОбласти

