
#Область ОбработчикиСобытийФормы

&НаСервере 
// Процедура, обработчик события "ПриСозданииНаСервере"  
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)		
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Элементы.Код.Видимость = ОтображниеКода;
	Элементы.Код.ПоложениеЗаголовка = ?(ОтображниеКода, ПоложениеЗаголовкаЭлементаФормы.Авто, ПоложениеЗаголовкаЭлементаФормы.Нет);
	
	МассивСпециализаий = Новый Массив;
	Если Параметры.Свойство("ПараметрыОтбора") И Параметры.ПараметрыОтбора.Свойство("Специализация") И ЗначениеЗаполнено(Параметры.ПараметрыОтбора.Специализация) Тогда	
		Если ТипЗнч(Параметры.ПараметрыОтбора.Специализация) <> Тип("Массив") Тогда 
			МассивСпециализаий.Добавить(Параметры.ПараметрыОтбора.Специализация);
		Иначе
			МассивСпециализаий = Параметры.ПараметрыОтбора.Специализация;
		КонецЕсли;	
		Список.Параметры.УстановитьЗначениеПараметра("Специализация", МассивСпециализаий);
	Иначе
		МассивСпециализаий.Добавить("Все");
		Список.Параметры.УстановитьЗначениеПараметра("Специализация", МассивСпециализаий);
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти