
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаПроверкиЗаполнения" объекта
// 
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка наличия номера телефона для sms рассылки и push уведомлений.
	Для Каждого СтрокиТ Из Получатели Цикл
		
		Если Не ЗначениеЗаполнено(СтрокиТ.СервисРассылки) Тогда
			Продолжить;
		КонецЕсли;
		
		ПроверятьНомерТелефона = ТипЗнч(СтрокиТ.СервисРассылки) = Тип("СправочникСсылка.СервисыРассылки")
			Или СтрокиТ.СервисРассылки.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi;
		
		Если Не ЗначениеЗаполнено(СтрокиТ.НомерТелефона) И ПроверятьНомерТелефона Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru='В строке № %1 табличной части ""Получатели"" не заполнено поле ""Номер телефона""'; en='In row № %1 of the tabular parts ""Recipients"" is not filled field ""Phone number""'"), СтрокиТ.НомерСтроки));
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Получатели.Количество() = 0 Тогда
		
		УдаляемыйЭлемент = ПроверяемыеРеквизиты.Найти("Получатели.НомерТелефона");
		Если УдаляемыйЭлемент <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(УдаляемыйЭлемент);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения); 
		
		Если ДанныеЗаполнения.Свойство("МассивПолучателей") Тогда	
			
			МассивПолучателейSMS = Документы.РассылкаСообщений.ПолучитьНомераТелефоновКонтрагентов(ДанныеЗаполнения.МассивПолучателей);	
			Для Каждого ЭлементМ Из МассивПолучателейSMS Цикл
				НовыйПолучатель = Получатели.Добавить();
				НовыйПолучатель.Получатель    = ЭлементМ.Получатель;
				НовыйПолучатель.НомерТелефона = ЭлементМ.НомерТелефона;		
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаОтправки = Неопределено;
	Для Каждого СтрокаТЧ Из Получатели Цикл
		СтрокаТЧ.КлючСтроки = Неопределено;
	КонецЦикла;
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

// Процедура, обработчик события "ПередЗаписью"
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Для Каждого СтрокаТЧ Из Получатели Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.КлючСтроки) Тогда
			СтрокаТЧ.КлючСтроки = Новый УникальныйИдентификатор();
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ДатаОтправки) Тогда
		ДатаОтправки = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Удаляем движения
	Если НЕ Ссылка.Пустая() Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СтекСообщений.РассылкаСообщений КАК РассылкаСообщений,
		|	СтекСообщений.КлючСтроки КАК КлючСтроки
		|ИЗ
		|	РегистрСведений.СтекСообщений КАК СтекСообщений
		|ГДЕ
		|	СтекСообщений.РассылкаСообщений = &РассылкаСообщений");
		
		Запрос.УстановитьПараметр("РассылкаСообщений", Ссылка);
		
		ПредыдущиеДвиженияДляУдаления = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаТ Из ПредыдущиеДвиженияДляУдаления Цикл
			
			ЗаписьСтатусыСообщений                   = РегистрыСведений.СтекСообщений.СоздатьМенеджерЗаписи();
			ЗаписьСтатусыСообщений.РассылкаСообщений = СтрокаТ.РассылкаСообщений;
			ЗаписьСтатусыСообщений.КлючСтроки        = СтрокаТ.КлючСтроки;
			ЗаписьСтатусыСообщений.Удалить();
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Ссылка.ПометкаУдаления Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СтатусыСообщений.РассылкаСообщений КАК РассылкаСообщений,
		|	СтатусыСообщений.КлючСтроки КАК КлючСтроки
		|ИЗ
		|	РегистрСведений.СтатусыСообщений КАК СтатусыСообщений
		|ГДЕ
		|	СтатусыСообщений.ДатаУстановкиСтатуса = &ДатаОтбора
		|	И СтатусыСообщений.РассылкаСообщений = &РассылкаСообщений
		|	И СтатусыСообщений.IDСообщения = """"");
		
		Запрос.УстановитьПараметр("РассылкаСообщений", Ссылка);
		Запрос.УстановитьПараметр("ДатаОтбора"       , Ссылка.Дата);
		
		ПредыдущиеДвиженияДляУдаления = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаТ Из ПредыдущиеДвиженияДляУдаления Цикл
			
			ЗаписьСтатусыСообщений                   = РегистрыСведений.СтатусыСообщений.СоздатьМенеджерЗаписи();
			ЗаписьСтатусыСообщений.РассылкаСообщений = СтрокаТ.РассылкаСообщений;
			ЗаписьСтатусыСообщений.КлючСтроки        = СтрокаТ.КлючСтроки;
			ЗаписьСтатусыСообщений.Удалить();
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидОперации) Тогда
		ВидОперации = ?(Получатели.Количество() > 1, Перечисления.ВидОперацииОтправкаSMS.МассоваяРассылкаSMS, Перечисления.ВидОперацииОтправкаSMS.ОтправкаSMSПолучателю);
	КонецЕсли;

КонецПроцедуры

// Процедура - При записи
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("ПараметрыРегистрацииТриггера") Тогда
		ДополнительныеСвойства.ПараметрыРегистрацииТриггера.Вставить("ОбъектГенерации", ЭтотОбъект.Ссылка);		
		РегистрыСведений.ЖурналРегистрацииТриггерныхСобытий.ЗарегистрироватьСобытиеТриггера(ДополнительныеСвойства.ПараметрыРегистрацииТриггера);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей                                       = РегистрыСведений.СтекСообщений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РассылкаСообщений.Значение      = ЭтотОбъект.Ссылка;
	НаборЗаписей.Отбор.РассылкаСообщений.Использование = Истина;
	
	ТекстШаблонаСообщения = ПолучитьСообщениеЗаполненноеПредварительнымиДанными(ЭтотОбъект.Содержание);
	
	Для Каждого СтрокаТ Из Получатели Цикл
		
		// Проверка наличия записи статуса сообщения.
		ЗаписьСтатусСообщения = РегистрыСведений.СтатусыСообщений.СоздатьМенеджерЗаписи();
		ЗаписьСтатусСообщения.РассылкаСообщений = ЭтотОбъект.Ссылка;
		ЗаписьСтатусСообщения.КлючСтроки        = СтрокаТ.КлючСтроки;
		
		ЗаписьСтатусСообщения.Прочитать();

		Если ЗаписьСтатусСообщения.Выбран() Тогда
			Если ЗначениеЗаполнено(ЗаписьСтатусСообщения.IDСообщения) Тогда
				Продолжить;
			КонецЕсли;
			// Удаление невалидной записи статуса сообщения.
			ЗаписьСтатусСообщения.Удалить();
		КонецЕсли;
		
		// При наличии параметров получателя.
		ТекстСообщения 					= ПолучитьСообщениеЗаполненноеДаннымиПолучателя(ТекстШаблонаСообщения, СтрокаТ.Получатель);
		
		// Запись в стек для отправки.
		НоваяЗапись                     = НаборЗаписей.Добавить();
		НоваяЗапись.РассылкаСообщений   = ЭтотОбъект.Ссылка;
		НоваяЗапись.КлючСтроки          = СтрокаТ.КлючСтроки;
		НоваяЗапись.ДатаОтправки        = ЭтотОбъект.ДатаОтправки;
		НоваяЗапись.ОтправитьНемедленно = ЭтотОбъект.ОтправитьНемедленно;		
		НоваяЗапись.СервисРассылки      = ?(ЗначениеЗаполнено(СтрокаТ.СервисРассылки), СтрокаТ.СервисРассылки, СервисSMSРассылки);
		НоваяЗапись.ТекстСообщения      = ТекстСообщения;
		НоваяЗапись.ТекстСообщенияUTF8  = ЭтотОбъект.СодержаниеUTF8;			
		НоваяЗапись.Получатель          = СтрокаТ.Получатель;
		НоваяЗапись.НомерТелефона       = ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(СтрокаТ.НомерТелефона, Ложь);
		НоваяЗапись.ИдКанала            = СтрокаТ.ИдКанала; 
		
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ПараметрыОтправки") Тогда
			НоваяЗапись.ПараметрыОтправки = Новый ХранилищеЗначения(ЭтотОбъект.ДополнительныеСвойства.ПараметрыОтправки);
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Функция - Получить сообщение заполненное данными получателя.
//
Функция ПолучитьСообщениеЗаполненноеДаннымиПолучателя(Знач ШаблонСообщения, Получатель)
	
	Если НЕ СтрНайти(ШаблонСообщения, "{") Тогда
		Возврат ШаблонСообщения;	
	КонецЕсли;
	
	// Параметры шаблона для получателя по умолчанию.
	РеквизитыПолучателя = ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(Получатель, "Фамилия, Имя, Отчество, Наименование");
	
	ШаблонСообщения = СтрЗаменить(ШаблонСообщения, "{Фамилия}" , РеквизитыПолучателя.Фамилия);
	ШаблонСообщения = СтрЗаменить(ШаблонСообщения, "{Имя}"     , РеквизитыПолучателя.Имя);
	ШаблонСообщения = СтрЗаменить(ШаблонСообщения, "{Отчество}", РеквизитыПолучателя.Отчество);
	ШаблонСообщения = СтрЗаменить(ШаблонСообщения, "{ФИО}"     , РеквизитыПолучателя.Наименование);
	
	Если СтрНайти(ШаблонСообщения, "{") И ТипЗнч(Получатель) = Тип("СправочникСсылка.Контрагенты") Тогда
		ШаблонСообщения = Справочники.ШаблоныСообщений.ПреобразоватьСодержаниеСПараметрамиВТекст(ШаблонСообщения, ЭтотОбъект, Получатель);	
	КонецЕсли;
	
	Возврат ШаблонСообщения;
	
КонецФункции 

// Функция - Получить сообщение заполненное предварительными данными.
//
Функция ПолучитьСообщениеЗаполненноеПредварительнымиДанными(Знач ШаблонСообщения)
	
	Если Не СтрНайти(ШаблонСообщения, "{") Тогда
		Возврат ШаблонСообщения;	
	КонецЕсли;
	
	Документы.РассылкаСообщений.ПреобразоватьСодержимоеСПараметрамиВТекст(ШаблонСообщения, ДокументОснование);
	
	Возврат ШаблонСообщения;
	
КонецФункции

#КонецОбласти

