
#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
// Обработчик события "ПриСозданииНаСервере" объекта.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Элементы.Код.Видимость          = ?(ОтображниеКода, Истина, Ложь);
	Элементы.Код.ПоложениеЗаголовка = ?(ОтображниеКода, ПоложениеЗаголовкаЭлементаФормы.Авто, ПоложениеЗаголовкаЭлементаФормы.Нет);
	
	ТекущееМестоположение = Справочники.МедицинскиеКарты.ВернутьМестоположениеМедицинскойКарты(Объект.Ссылка);
	Если Объект.Ссылка.Пустая() Тогда
		Если Объект.ВидМедицинскойКарты.Пустая() Тогда 
			Объект.ВидМедицинскойКарты = Справочники.ВидыМедицинскихКарт.ОсновнойВидМедицинскойКарты;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТекущееМестоположение) Тогда
			ТекущееМестоположение = Справочники.Местоположения.ВКлинике;
		КонецЕсли;
	КонецЕсли;	
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.ВладелецКарты) Тогда 
		Элементы.ВладелецКарты.Видимость = Ложь;
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры 

&НаКлиенте
// Процедура, Обработка оповещения.  
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОБНОВЛЕНО_МЕСТОПОЛОЖЕНИЕ_МЕДИЦИНСКОЙ_КАРТЫ" И Параметр = Объект.Ссылка Тогда
		ТекущееМестоположение = ВернутьМестоположениеМедицинскойКарты(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Обработчик события "ПриЗаписиНаСервере" объекта.
//
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Справочники.МедицинскиеКарты.УстановитьМестоположениеМедицинскойКарты(ТекущийОбъект.Ссылка, ТекущееМестоположение);
	
КонецПроцедуры
    
&НаКлиенте
// Обработчик события "ПослеЗаписи" объекта
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОБНОВЛЕНЫ_МЕДИЦИНСКИЕ_КАРТЫ_КЛИЕНТА", Объект.ВладелецКарты, Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Обработчик события "КодПриИзменении".
//
Процедура КодПриИзменении(Элемент)
	
	КоличествоСимволов = ВернутьДлинуКода();
	Если СтрДлина(Объект.Код) <> КоличествоСимволов Тогда 
		Если СтрДлина(Объект.Код) < КоличествоСимволов Тогда
			Количество = КоличествоСимволов - СтрДлина(Объект.Код);
			Если Количество = 1 ИЛИ Количество = 4 Тогда 
				Текст = "Неверно введен код!" + Символы.ПС + "Не хватает " + Количество + " символа!";
			ИначеЕсли Количество = 2 ИЛИ Количество = 3 Тогда 
				Текст = "Неверно введен код!" + Символы.ПС + "Не хватает " + Количество + "-х символов!";
			Иначе 
				Текст = "Неверно введен код!" + Символы.ПС + "Не хватает " + Количество + " символов!";
			КонецЕсли;
		Иначе 
			Количество = СтрДлина(Объект.Код) - КоличествоСимволов;
			Если Количество = 1 Тогда 
				Текст = "Неверно введен код!" + Символы.ПС + "Введен " + Количество + " лишний символ!";
			ИначеЕсли Количество = 2 ИЛИ Количество = 3 ИЛИ Количество = 4 Тогда 
				Текст = "Неверно введен код!" + Символы.ПС + "Введено " + Количество + " лишних символа!";
			Иначе 
				Текст = "Неверно введен код!" + Символы.ПС + "Введено " + Количество + " лишних символов!";
			КонецЕсли;
		КонецЕсли;	
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Текст;
		Сообщение.Поле = "Объект.Код";
		Сообщение.УстановитьДанные(Объект.Ссылка);
		Сообщение.Сообщить();
	КонецЕсли;		
	             
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Обработчик кнопки автогенерации штрихкода карты
//
Процедура СгенерироватьШтрихкод(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("СгенерироватьШтрихкодЗавершение", ЭтотОбъект), "Медицинская карта не сохранена. Сохранить?", РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
		
	Объект.Штрихкод = СгенерироватьШтрихкодНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьШтрихкодЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;  
	
	Если Записать() = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Штрихкод = СгенерироватьШтрихкодНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедцрыИФункции

&НаСервереБезКонтекста
// Сформировать штрихкод формата EAN13
//
Функция СгенерироватьШтрихкодНаСервере()
	
	Возврат РегистрыСведений.Штрихкоды.СформироватьШтрихкодEAN13();
	
КонецФункции

&НаСервереБезКонтекста
// Сформировать штрихкод формата EAN13
//
Функция ВернутьМестоположениеМедицинскойКарты(МедицинскаяКарта)
	
	Возврат Справочники.МедицинскиеКарты.ВернутьМестоположениеМедицинскойКарты(МедицинскаяКарта);
	
КонецФункции

&НаСервере
// Функция, Вернуть длину кода.
//
Функция ВернутьДлинуКода()
	
	Возврат СтрДлина(Справочники.МедицинскиеКарты.СгенерироватьКодМедКарты(Объект.ВидМедицинскойКарты.ДлинаНомера, Объект.ВидМедицинскойКарты.Префикс, Объект.ВидМедицинскойКарты.Суффикс));
	             
КонецФункции

#КонецОбласти
