
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыНастроек = Константы.НастройкиМобильногоПриложенияСтоматологии.Получить().Получить();
	
	Если ПараметрыНастроек = Неопределено Тогда
		MobileApp_v1.ОбновитьКонстантуНастройкиМобильногоПриложенияСтоматологии();
		ПараметрыНастроек = Константы.НастройкиМобильногоПриложенияСтоматологии.Получить().Получить();
	КонецЕсли;
	
	Если ПараметрыНастроек.Свойство("РазрешитьРедактированиеПриемовВрачом") Тогда
		ЭтотОбъект.РазрешитьРедактированиеПриемовВрачом = ПараметрыНастроек.РазрешитьРедактированиеПриемовВрачом;
	КонецЕсли;
	
	Если ПараметрыНастроек.Свойство("ВыводитьТелефонКлиентаВрачу") Тогда
		ЭтотОбъект.ВыводитьТелефонКлиентаВрачу = ПараметрыНастроек.ВыводитьТелефонКлиентаВрачу;
	КонецЕсли;
	
	Если ПараметрыНастроек.Свойство("НеВыводитьИсториюПриемовПоКлиенту") Тогда
		ЭтотОбъект.НеВыводитьИсториюПриемовПоКлиенту = ПараметрыНастроек.НеВыводитьИсториюПриемовПоКлиенту;
	КонецЕсли;
	
	Если ПараметрыНастроек.Свойство("ВыводитьВрачуКомментарий") Тогда
		ЭтотОбъект.ВыводитьВрачуКомментарий = ПараметрыНастроек.ВыводитьВрачуКомментарий;
	КонецЕсли;
	
	Если ПараметрыНастроек.Свойство("УведомлятьВрачаОбИзмененииПриемов") Тогда
		ЭтотОбъект.УведомлятьВрачаОбИзмененииПриемов = ПараметрыНастроек.УведомлятьВрачаОбИзмененииПриемов;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - При изменении значения
//
Процедура ПриИзмененииЗначения()
	
	ПодготовитьДанныеДляКонстантыИЗаписать();	
	
КонецПроцедуры

&НаСервере
// Процедура - Подготовить данные для константы и записать
//
Процедура ПодготовитьДанныеДляКонстантыИЗаписать()
	
	СтруктураЗначенийДляКонстанты = Новый Структура;
	СтруктураЗначенийДляКонстанты.Вставить("РазрешитьРедактированиеПриемовВрачом"	, ЭтотОбъект.РазрешитьРедактированиеПриемовВрачом);
	СтруктураЗначенийДляКонстанты.Вставить("ВыводитьТелефонКлиентаВрачу"			, ЭтотОбъект.ВыводитьТелефонКлиентаВрачу);
	СтруктураЗначенийДляКонстанты.Вставить("НеВыводитьИсториюПриемовПоКлиенту"		, ЭтотОбъект.НеВыводитьИсториюПриемовПоКлиенту);
	СтруктураЗначенийДляКонстанты.Вставить("ВыводитьВрачуКомментарий"		   		, ЭтотОбъект.ВыводитьВрачуКомментарий);
	СтруктураЗначенийДляКонстанты.Вставить("УведомлятьВрачаОбИзмененииПриемов"   	, ЭтотОбъект.УведомлятьВрачаОбИзмененииПриемов);	
	
	УстановитьЗначениеКонстантыСервер("НастройкиМобильногоПриложенияСтоматологии", Новый ХранилищеЗначения(СтруктураЗначенийДляКонстанты));
	
КонецПроцедуры

&НаСервере
// Процедура - Установить значение константы сервер
//
// Параметры:
//  ЗначениеКонстанты	 - 	 - 
//
Процедура УстановитьЗначениеКонстантыСервер(ИмяКонстанты, ЗначениеКонстанты)
	
	Константы[ИмяКонстанты].Установить(ЗначениеКонстанты);	
	
КонецПроцедуры

#КонецОбласти