
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик при создании формы на сервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ТолщинаЛиний = 1;	РазмерПоШирине = 100;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Применить парамтеры
Процедура Применить(Команда)	
	
	ПараметрыТаблицы = Новый Структура("ЗаголовокТаблицы, КолСтрок, КолКолонок, ТолщинаЛиний, РазмерПоШирине", ЗаголовокТаблицы, КолСтрок, КолКолонок,ТолщинаЛиний, РазмерПоШирине);	
	Закрыть(ПараметрыТаблицы);
	
КонецПроцедуры

#КонецОбласти