
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Обработка получения представления.
//
// Параметры:
//  Данные				 - 	 - 
//  Представление		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	Если ПользователиСлужебныйПовтИсп.ЯзыкИнтерфейсаАнглийский() Тогда
		
		ВидСделок_НовыеПациенты 		= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты");
		ВидСделок_ПостоянныеПациенты	= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.ПостоянныеПациенты");
		
		Если Данные.Ссылка = ВидСделок_НовыеПациенты Тогда
			Представление = "New Patients";
		ИначеЕсли Данные.Ссылка = ВидСделок_ПостоянныеПациенты Тогда
			Представление = "Regular Patients";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция - Получить массив всех видов сделок
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивВсехВидовСделок(ВидСделки = Неопределено, СтруктурнаяЕдиница = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда 
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	Если ТипЗнч(СтруктурнаяЕдиница) = Тип("СправочникСсылка.СтруктурныеЕдиницы") Тогда 
		МассивСтруктурныхЕдиниц = Новый Массив;
		МассивСтруктурныхЕдиниц.Добавить(СтруктурнаяЕдиница);
	ИначеЕсли ТипЗнч(СтруктурнаяЕдиница) = Тип("Массив") Тогда 
		МассивСтруктурныхЕдиниц = СтруктурнаяЕдиница;
	Иначе 
		МассивСтруктурныхЕдиниц = Новый Массив;
		МассивСтруктурныхЕдиниц.Добавить(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	КонецЕсли;
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийСотрудник;
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда 
		РольПользователя = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ТекущийПользователь, "Роль");
	Иначе 
		РольПользователя = Неопределено;
	КонецЕсли;
	ОграничитьПоДоступнымСотруднику = Ложь;
	
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВидыСделок.Ссылка КАК ВидСделки
	|ИЗ
	|	Справочник.ВидыСделок КАК ВидыСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыСделок КАК ЭтапыСделок
	|		ПО ВидыСделок.Ссылка = ЭтапыСделок.ВидСделки
	|			И (ЭтапыСделок.ПометкаУдаления = ЛОЖЬ)
	|ГДЕ
	|	ВидыСделок.ПометкаУдаления = ЛОЖЬ
	|	И (ВидыСделок.СтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница В (&МассивСтруктурныхЕдиниц)
	|			ИЛИ ВидыСделок.СтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|	И ВидыСделок.Ссылка = &ВидСделкиНовыеПациенты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыСделок.Наименование");
	
	Если ОграничитьПоДоступнымСотруднику Тогда 
		Запрос.УстановитьПараметр("Сотрудник", ТекущийПользователь);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВидыСделокСотрудников.ВидСделки КАК ВидСделки
	|ПОМЕСТИТЬ ТаблицаДоступныхСотруднику
	|ИЗ
	|	РегистрСведений.ВидыСделокСотрудников КАК ВидыСделокСотрудников
	|ГДЕ
	|	ВидыСделокСотрудников.Сотрудник = &Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|", "");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВидыСделок.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаДоступныхСотруднику.ВидСделки
	|			ИЗ
	|				ТаблицаДоступныхСотруднику)", "ИСТИНА");
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ВидСделки) И ТипЗнч(ВидСделки) = Тип("СправочникСсылка.ВидыСделок") Тогда 
		Запрос.УстановитьПараметр("ВидСделкиНовыеПациенты", ВидСделки);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВидыСделок.Ссылка = &ВидСделкиНовыеПациенты", "ИСТИНА");
	КонецЕсли;
	Запрос.УстановитьПараметр("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидСделки");
		
КонецФункции

// Функция - Получить доступные для генерации виды сделок
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  Пациент				 - 	 - 
//  СтатусПациента		 - 	 - 
//  Врач				 - 	 - 
//  ВернутьТаблицей		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДоступныеДляГенерацииВидыСделок(СтруктурнаяЕдиница = Неопределено
												, Пациент
												, СтатусПациента = Неопределено
												, Врач = Неопределено
												, ВернутьТаблицей = Ложь
												, ПолучатьДляПотенциального = Ложь
												, ИсключитьПредопределенные = Ложь
												, ИсключительноПредопределенные = Ложь) Экспорт
	
	Если ВернутьТаблицей Тогда 
		ДоступныеВидыСделок = Новый ТаблицаЗначений;
	Иначе 
		ДоступныеВидыСделок = Новый Массив;
	КонецЕсли;	
		
	Если НЕ ЗначениеЗаполнено(Пациент) И НЕ ПолучатьДляПотенциального Тогда 
		Возврат ДоступныеВидыСделок;
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда 
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	//Если ПолучатьДляПотенциального Тогда 
	//	СтатусПациента = Перечисления.СтатусыКонтрагентов.Потенциальный;
	//Иначе 	
	//	Если НЕ ЗначениеЗаполнено(СтатусПациента) Тогда 
	//		СтатусПациента = РегистрыСведений.СтатусыКонтрагентов.ПолучитьСтатусКлиента(Пациент, ТекущаяДатаСеанса());
	//		Если НЕ ЗначениеЗаполнено(СтатусПациента) Тогда 
	//			СтатусПациента = Перечисления.СтатусыКонтрагентов.Потенциальный;
	//		КонецЕсли;	
	//	КонецЕсли;	
	//КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Врач) Тогда 
		Врач = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"			, СтруктурнаяЕдиница);
	//Запрос.УстановитьПараметр("СтатусПациента"		, СтатусПациента);
	Запрос.УстановитьПараметр("Пациент"						, ?(ЗначениеЗаполнено(Пациент), Пациент, Неопределено));
	Запрос.УстановитьПараметр("Врач"						, Врач); 
	Запрос.УстановитьПараметр("ПредопределенныйВидСделки"	, ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты")); 
	Запрос.УстановитьПараметр("ЛюбаяПричина"				, ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПричиныОтказов.ЛюбаяПричина"));	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыСделок.Ссылка КАК ВидСделки,
	|	ВидыСделок.Предопределенный КАК Предопределенный,
	|	ВидыСделок.Код КАК Код,
	|	ВидыСделок.Наименование КАК Наименование,
	|	ВидыСделок.НаименованиеЭтапаУспех КАК НаименованиеЭтапаУспех,
	|	ВидыСделок.НаименованиеЭтапаОтказ КАК НаименованиеЭтапаОтказ
	|ПОМЕСТИТЬ ТаблицаДоступныхВидовСделок
	|ИЗ
	|	Справочник.ВидыСделок КАК ВидыСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыСделок КАК ЭтапыСделок
	|		ПО ВидыСделок.Ссылка = ЭтапыСделок.ВидСделки
	|			И (ЭтапыСделок.ПометкаУдаления = ЛОЖЬ)
	|ГДЕ
	|	ВидыСделок.ПометкаУдаления = ЛОЖЬ
	|	И (ВидыСделок.СтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|			ИЛИ ВидыСделок.СтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|	И НЕ ВидыСделок.Предопределенный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сделки.Ссылка КАК Сделка,
	|	Сделки.ВидСделки КАК ВидСделки,
	|	Сделки.Врач КАК Врач,
	|	Сделки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Сделки.ЭтапСделки.НомерЭтапа КАК НомерЭтапа
	|ПОМЕСТИТЬ ТаблицаДействующихСделок
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Сделки.ВидСделки В
	|			(ВЫБРАТЬ
	|				ТаблицаДоступныхВидовСделок.ВидСделки
	|			ИЗ
	|				ТаблицаДоступныхВидовСделок)
	|	И Сделки.Контрагент = &Пациент
	|	И &Пациент <> НЕОПРЕДЕЛЕНО
	|	И Сделки.ПометкаУдаления = ЛОЖЬ
	|	И Сделки.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДоступныхВидовСделок.ВидСделки КАК ВидСделки,
	|	ТаблицаДоступныхВидовСделок.Предопределенный КАК Предопределенный,
	|	ТаблицаДоступныхВидовСделок.Код КАК Код,
	|	ТаблицаДоступныхВидовСделок.Наименование КАК Наименование,
	|	ТаблицаДоступныхВидовСделок.НаименованиеЭтапаУспех КАК НаименованиеЭтапаУспех,
	|	ТаблицаДоступныхВидовСделок.НаименованиеЭтапаОтказ КАК НаименованиеЭтапаОтказ
	|ПОМЕСТИТЬ ИтоговаяТаблицаВидовСделок
	|ИЗ
	|	ТаблицаДоступныхВидовСделок КАК ТаблицаДоступныхВидовСделок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДействующихСделок КАК ТаблицаДействующихСделок
	|		ПО ТаблицаДоступныхВидовСделок.ВидСделки = ТаблицаДействующихСделок.ВидСделки
	|			И (ТаблицаДействующихСделок.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)
	|			И (ТаблицаДействующихСделок.Врач = &Врач)
	|			И (ВЫБОР
	|				КОГДА ТаблицаДоступныхВидовСделок.ВидСделки = &ПредопределенныйВидСделки
	|					ТОГДА ТаблицаДействующихСделок.НомерЭтапа < 3
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|ГДЕ
	|	ТаблицаДействующихСделок.Сделка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапыСделок.ВидСделки КАК ВидСделки,
	|	ЭтапыСделок.Ссылка КАК Этап,
	|	ЭтапыСделок.Предопределенный КАК Предопределенный,
	|	ЭтапыСделок.Наименование КАК Наименование,
	|	ЭтапыСделок.НомерЭтапа КАК НомерЭтапа,
	|	ЭтапыСделок.ЦветЭтапа КАК ЦветЭтапа,
	|	ЛОЖЬ КАК Выбран
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.ПометкаУдаления = ЛОЖЬ
	|	И ЭтапыСделок.ВидСделки В
	|			(ВЫБРАТЬ
	|				ИтоговаяТаблицаВидовСделок.ВидСделки
	|			ИЗ
	|				ИтоговаяТаблицаВидовСделок)
	|	И ЭтапыСделок.Предопределенный = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидСделки,
	|	НомерЭтапа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблицаВидовСделок.ВидСделки КАК ВидСделки,
	|	ИтоговаяТаблицаВидовСделок.Предопределенный КАК Предопределенный,
	|	ИтоговаяТаблицаВидовСделок.Код КАК Код,
	|	ИтоговаяТаблицаВидовСделок.Наименование КАК Наименование,
	|	ИтоговаяТаблицаВидовСделок.НаименованиеЭтапаУспех КАК НаименованиеЭтапаУспех,
	|	ИтоговаяТаблицаВидовСделок.НаименованиеЭтапаОтказ КАК НаименованиеЭтапаОтказ,
	|	ЛОЖЬ КАК Выбран
	|ИЗ
	|	ИтоговаяТаблицаВидовСделок КАК ИтоговаяТаблицаВидовСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	Предопределенный УБЫВ,
	|	ВидСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыСделокПричиныОтказов.Ссылка КАК ВидСделки,
	|	ВидыСделокПричиныОтказов.ПричинаОтказа КАК ПричинаОтказа,
	|	ВидыСделокПричиныОтказов.ПричинаОтказа.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВидыСделок.ПричиныОтказов КАК ВидыСделокПричиныОтказов
	|ГДЕ
	|	ВидыСделокПричиныОтказов.Ссылка В
	|			(ВЫБРАТЬ
	|				ИтоговаяТаблицаВидовСделок.ВидСделки
	|			ИЗ
	|				ИтоговаяТаблицаВидовСделок)
	|	И ВидыСделокПричиныОтказов.ПричинаОтказа <> &ЛюбаяПричина";	

	Если ИсключительноПредопределенные Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НЕ ВидыСделок.Предопределенный", "ВидыСделок.Предопределенный");
	ИначеЕсли НЕ ИсключитьПредопределенные Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НЕ ВидыСделок.Предопределенный", "ИСТИНА");
	КонецЕсли;
	
	РезультатПакетаЗапросов = Запрос.ВыполнитьПакет();
	
	Если ВернутьТаблицей Тогда
		ТаблицаДоступныхВидовСделок = РезультатПакетаЗапросов[4].Выгрузить();
		ТаблицаЭтаповВидовСделок 	= РезультатПакетаЗапросов[3].Выгрузить();
		ТаблицаПричинОтказов 		= РезультатПакетаЗапросов[5].Выгрузить();
		
		ТаблицаДоступныхВидовСделок.Колонки.Добавить("ТаблицаЭтапов"		, Новый ОписаниеТипов("ТаблицаЗначений"));
		ТаблицаДоступныхВидовСделок.Колонки.Добавить("ТаблицаПричинОтказов"	, Новый ОписаниеТипов("ТаблицаЗначений"));

		Для Каждого СтрокаТаблицы Из ТаблицаДоступныхВидовСделок Цикл
			// Формируем таблицу этапов
			ТаблицаЭтапов = ТаблицаЭтаповВидовСделок.Скопировать(Новый Структура("ВидСделки", СтрокаТаблицы.ВидСделки));
			ЗаполнитьЗначенияСвойств(ТаблицаЭтапов.Добавить(), Новый Структура("ВидСделки, Этап, Предопределенный, Наименование, Выбран", СтрокаТаблицы.ВидСделки, Справочники.ЭтапыСделок.Успех, Истина, ?(ЗначениеЗаполнено(СокрЛП(СтрокаТаблицы.НаименованиеЭтапаУспех)), СокрЛП(СтрокаТаблицы.НаименованиеЭтапаУспех), "Успех"), Ложь));
			ЗаполнитьЗначенияСвойств(ТаблицаЭтапов.Добавить(), Новый Структура("ВидСделки, Этап, Предопределенный, Наименование, Выбран", СтрокаТаблицы.ВидСделки, Справочники.ЭтапыСделок.Отказ, Истина, ?(ЗначениеЗаполнено(СокрЛП(СтрокаТаблицы.НаименованиеЭтапаОтказ)), СокрЛП(СтрокаТаблицы.НаименованиеЭтапаОтказ), "Отказ"), Ложь));
			СтрокаТаблицы.ТаблицаЭтапов = ТаблицаЭтапов;
			// Формируем таблицу причин отказов
			ТаблицаПричин = ТаблицаПричинОтказов.Скопировать(Новый Структура("ВидСделки", СтрокаТаблицы.ВидСделки));
			СтрокаТаблицы.ТаблицаПричинОтказов = ТаблицаПричин;
		КонецЦикла;
		
		Возврат ТаблицаДоступныхВидовСделок;
	Иначе 	
		Возврат РезультатПакетаЗапросов[4].Выгрузить().ВыгрузитьКолонку("ВидСделки");
	КонецЕсли;
	
КонецФункции

// Функция - Получить стартовый этап вида сделки
//
// Параметры:
//  ВидСделки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтартовыйЭтапВидаСделки(ВидСделки) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЭтапыСделок.Ссылка КАК ЭтапСделки
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.ВидСделки = &ВидСделки
	|	И НЕ ЭтапыСделок.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтапыСделок.НомерЭтапа");
	
	Запрос.УстановитьПараметр("ВидСделки", ВидСделки);
	
	ВыборкаЭтапа = Запрос.Выполнить().Выбрать();
	
	Возврат ?(ВыборкаЭтапа.Следующий(), ВыборкаЭтапа.ЭтапСделки, Неопределено);
		
КонецФункции

// Функция, отбирает существующие этапы из справочника.
//
// Описание: Возвращает таблицу значений этапов.
//
// Параметры (название, тип, дифференцированное значение)
//	- ВидСделки, СправочникСсылка.ВидыСделок.
//
Функция ПолучитьЭтапыПоВидуСделки(ВидСделки) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭтапыСделок.Ссылка КАК ЭтапСделки,
	|	ЭтапыСделок.НомерЭтапа КАК НомерЭтапа,
	|	ЭтапыСделок.ЦветЭтапа КАК ЦветЭтапа
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.ВидСделки = &ВидСделки
	|	И НЕ ЭтапыСделок.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтапыСделок.НомерЭтапа");
	
	Запрос.УстановитьПараметр("ВидСделки", ВидСделки);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

// Процедура - Обновить предопределнные виды сделок
//
Процедура ОбновитьПредопределнныеВидыСделок() Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	Запрос 		= Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыСделок.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВидСделкиНовыеПациенты
	               |ИЗ
	               |	Справочник.ВидыСделок КАК ВидыСделок
	               |ГДЕ
	               |	ВидыСделок.Предопределенный = ИСТИНА
	               |	И ВидыСделок.Ссылка = &ИмяПредопределенныхДанных_НовыеПациенты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВидыСделок.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВидСделкиПостоянныеПациенты
	               |ИЗ
	               |	Справочник.ВидыСделок КАК ВидыСделок
	               |ГДЕ
	               |	ВидыСделок.Предопределенный = ИСТИНА
	               |	И ВидыСделок.Ссылка = &ИмяПредопределенныхДанных_ПостоянныеПациенты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭтапыСделок.Ссылка КАК Ссылка,
	               |	ЭтапыСделок.Наименование КАК Наименование,
	               |	ЭтапыСделок.ВидСделки КАК ВидСделки,
	               |	ЭтапыСделок.НомерЭтапа КАК НомерЭтапа,
	               |	ИСТИНА КАК Удалить
	               |ИЗ
	               |	Справочник.ЭтапыСделок КАК ЭтапыСделок
	               |ГДЕ
	               |	ЭтапыСделок.ВидСделки В
	               |			(ВЫБРАТЬ
	               |				ВидСделкиНовыеПациенты.Ссылка
	               |			ИЗ
	               |				ВидСделкиНовыеПациенты)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерЭтапа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭтапыСделок.Ссылка КАК Ссылка,
	               |	ЭтапыСделок.Наименование КАК Наименование,
	               |	ЭтапыСделок.ВидСделки КАК ВидСделки,
	               |	ЭтапыСделок.НомерЭтапа КАК НомерЭтапа,
	               |	ИСТИНА КАК Удалить
	               |ИЗ
	               |	Справочник.ЭтапыСделок КАК ЭтапыСделок
	               |ГДЕ
	               |	ЭтапыСделок.ВидСделки В
	               |			(ВЫБРАТЬ
	               |				ВидСделкиПостоянныеПациенты.Ссылка
	               |			ИЗ
	               |				ВидСделкиПостоянныеПациенты)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерЭтапа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВидСделкиНовыеПациенты.Ссылка КАК Ссылка
	               |ИЗ
	               |	ВидСделкиНовыеПациенты КАК ВидСделкиНовыеПациенты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВидСделкиПостоянныеПациенты.Ссылка КАК Ссылка
	               |ИЗ
	               |	ВидСделкиПостоянныеПациенты КАК ВидСделкиПостоянныеПациенты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВидыСделок.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ВидыСделок КАК ВидыСделок
	               |ГДЕ
	               |	ВидыСделок.Предопределенный = ИСТИНА
	               |	И НЕ ВидыСделок.Ссылка В
	               |				(ВЫБРАТЬ
	               |					ВидСделкиНовыеПациенты.Ссылка
	               |				ИЗ
	               |					ВидСделкиНовыеПациенты)
	               |	И НЕ ВидыСделок.Ссылка В
	               |				(ВЫБРАТЬ
	               |					ВидСделкиПостоянныеПациенты.Ссылка
	               |				ИЗ
	               |					ВидСделкиПостоянныеПациенты)";
	
	ВидСделок__НовыеПациенты 		= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты");
	ВидСделок__ПостоянныеПациенты 	= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.ПостоянныеПациенты");
	
	Запрос.УстановитьПараметр("ИмяПредопределенныхДанных_НовыеПациенты"		, ВидСделок__НовыеПациенты);
	Запрос.УстановитьПараметр("ИмяПредопределенныхДанных_ПостоянныеПациенты", ВидСделок__ПостоянныеПациенты);
	
	РезультатПакетаЗапросов = Запрос.ВыполнитьПакет();
	
#Область ОБЛАСТЬ_ИНИЦИАЛИЗИРОВАНИЯ_ПРЕДОПРЕДЕЛЕННОГО_ВИДА_СДЕЛКИ_НовыеПациенты
	
	Отказ = Ложь;			
	ВыборкаНовыеПациенты = РезультатПакетаЗапросов[4].Выбрать();
	Если ВыборкаНовыеПациенты.Следующий() Тогда 
		ВидСделки_Объект = ВыборкаНовыеПациенты.Ссылка.ПолучитьОбъект();
	Иначе 
		ВидСделки_Объект = Справочники.ВидыСделок.СоздатьЭлемент();
		ВидСделки_Объект.УстановитьНовыйКод();
	КонецЕсли;		
	Если ВидСделки_Объект <> Неопределено Тогда 
		ВидСделки_Объект.ИмяПредопределенныхДанных 	= "НовыеПациенты";
		ВидСделки_Объект.Наименование 				= НСтр("ru = 'Новый пациент'; en = 'New patient'");
		ВидСделки_Объект.Префикс 					= ПолучитьПрефиксВоронкиПоНаименованию(ВидСделки_Объект.Наименование);
		ВидСделки_Объект.ТипСделки 					= Перечисления.ТипыСделок.Продажа;
		ВидСделки_Объект.НаименованиеЭтапаУспех 	= НСтр("ru = 'Санирован'; en = 'Sanitized'");
		ВидСделки_Объект.НаименованиеЭтапаОтказ		= НСтр("ru = 'Отказ'; en = 'Refusal'");
		
		Если НЕ ЗначениеЗаполнено(ВидСделки_Объект.СтруктурныеЕдиницыПрименения) Тогда 
			СтрокаТЧ = ВидСделки_Объект.СтруктурныеЕдиницыПрименения.Добавить();
			СтрокаТЧ.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
		КонецЕсли;	
		
		ВидСделки_Объект.СтатусыПациентовПрименения.Очистить();
		ЗаполнитьЗначенияСвойств(ВидСделки_Объект.СтатусыПациентовПрименения.Добавить(), Новый Структура("СтатусПациента", Перечисления.СтатусыКонтрагентов.Потенциальный));
		ЗаполнитьЗначенияСвойств(ВидСделки_Объект.СтатусыПациентовПрименения.Добавить(), Новый Структура("СтатусПациента", Перечисления.СтатусыКонтрагентов.Первичный));
		ЗаполнитьЗначенияСвойств(ВидСделки_Объект.СтатусыПациентовПрименения.Добавить(), Новый Структура("СтатусПациента", Перечисления.СтатусыКонтрагентов.Отказ));
		
		ВидСделки_Объект.ОбменДанными.Загрузка 		= Истина;
		Попытка
			ВидСделки_Объект.Записать();
			ВидСделки = ВидСделки_Объект.Ссылка;
		Исключение
			Отказ = Истина;
			ЗаписьЖурналаРегистрации(НСтр("ru='Ошибка создания вида сделки!';en='Mistake create kind of deals!'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ВидыСделок, , ОписаниеОшибки());			
		КонецПопытки;	
	КонецЕсли;
	
	Если НЕ Отказ Тогда 
		ТаблицаЭтапов = РезультатПакетаЗапросов[2].Выгрузить();
		СтруктураЭтаповМассивом = Справочники.ЭтапыСделок.ПолучитьПервоначальнуюСтруктуруЭтаповВидаСделки(ВидСделки);
		Для Каждого СтруктураЭтапа Из СтруктураЭтаповМассивом Цикл
			РанееСозданныйЭтап = ТаблицаЭтапов.Найти(СтруктураЭтапа.НомерЭтапа, "НомерЭтапа");
			Если ЗначениеЗаполнено(РанееСозданныйЭтап) Тогда 
				ЭтапСделки_Объект = РанееСозданныйЭтап.Ссылка.ПолучитьОбъект();
				РанееСозданныйЭтап.Удалить = Ложь;
			Иначе 
				ЭтапСделки_Объект = Справочники.ЭтапыСделок.СоздатьЭлемент();
				ЭтапСделки_Объект.УстановитьНовыйКод();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ЭтапСделки_Объект, СтруктураЭтапа);
			ЭтапСделки_Объект.ВидСделки 			= ВидСделки;
			ЭтапСделки_Объект.ОбменДанными.Загрузка = Истина;
			Попытка
				ЭтапСделки_Объект.Записать();
			Исключение
				Отказ = Истина;
				ЗаписьЖурналаРегистрации(НСтр("ru='Ошибка создания вида сделки!';en='Mistake create kind of deals!'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ЭтапыСделок, , ОписаниеОшибки());			
			КонецПопытки;
		КонецЦикла;
		Для Каждого РанееСозданныйЭтап Из ТаблицаЭтапов Цикл 
			Если РанееСозданныйЭтап.Удалить Тогда 
				ЭтапСделки_Объект = РанееСозданныйЭтап.Ссылка.ПолучитьОбъект();
				Попытка
					ЭтапСделки_Объект.УстановитьПометкуУдаления(Истина);
				Исключение
					
				КонецПопытки;	
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли; 
	
#КонецОбласти

#Область ОБЛАСТЬ_ИНИЦИАЛИЗИРОВАНИЯ_ПРЕДОПРЕДЕЛЕННОГО_ВИДА_СДЕЛКИ_ПостоянныеПациенты
	
	Отказ = Ложь;			
	ВыборкаПрофосмотр = РезультатПакетаЗапросов[5].Выбрать();
	Если ВыборкаПрофосмотр.Следующий() Тогда 
		ВидСделки_Объект = ВыборкаПрофосмотр.Ссылка.ПолучитьОбъект();
	Иначе 
		ВидСделки_Объект = Справочники.ВидыСделок.СоздатьЭлемент();
		ВидСделки_Объект.УстановитьНовыйКод();
	КонецЕсли;		
	Если ВидСделки_Объект <> Неопределено Тогда 
		ВидСделки_Объект.ИмяПредопределенныхДанных 	= "ПостоянныеПациенты";
		ВидСделки_Объект.Наименование 				= НСтр("ru = 'Постоянный пациент'; en = 'Regular patient'");		
		ВидСделки_Объект.Префикс 					= ПолучитьПрефиксВоронкиПоНаименованию(ВидСделки_Объект.Наименование);		
		ВидСделки_Объект.ТипСделки 					= Перечисления.ТипыСделок.Продажа;
		ВидСделки_Объект.НаименованиеЭтапаУспех 	= НСтр("ru = 'Санирован'; en = 'Sanitized'");
		ВидСделки_Объект.НаименованиеЭтапаОтказ		= НСтр("ru = 'Отказ'; en = 'Refusal'");
		
		Если НЕ ЗначениеЗаполнено(ВидСделки_Объект.СтруктурныеЕдиницыПрименения) Тогда 
			СтрокаТЧ = ВидСделки_Объект.СтруктурныеЕдиницыПрименения.Добавить();
			СтрокаТЧ.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
		КонецЕсли;	
		
		ВидСделки_Объект.СтатусыПациентовПрименения.Очистить();
		ЗаполнитьЗначенияСвойств(ВидСделки_Объект.СтатусыПациентовПрименения.Добавить(), Новый Структура("СтатусПациента", Перечисления.СтатусыКонтрагентов.НеВернувшийся));
		ЗаполнитьЗначенияСвойств(ВидСделки_Объект.СтатусыПациентовПрименения.Добавить(), Новый Структура("СтатусПациента", Перечисления.СтатусыКонтрагентов.Постоянный));
		
		ВидСделки_Объект.ОбменДанными.Загрузка 		= Истина;
		Попытка
			ВидСделки_Объект.Записать();
			ВидСделки = ВидСделки_Объект.Ссылка;
		Исключение
			Отказ = Истина;
			ЗаписьЖурналаРегистрации(НСтр("ru='Ошибка создания вида сделки!';en='Mistake create kind of deals!'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ВидыСделок, , ОписаниеОшибки());			
		КонецПопытки;	
	КонецЕсли;
	
	Если НЕ Отказ Тогда 
		ТаблицаЭтапов = РезультатПакетаЗапросов[3].Выгрузить();
		СтруктураЭтаповМассивом = Справочники.ЭтапыСделок.ПолучитьПервоначальнуюСтруктуруЭтаповВидаСделки(ВидСделки);
		Для Каждого СтруктураЭтапа Из СтруктураЭтаповМассивом Цикл
			РанееСозданныйЭтап = ТаблицаЭтапов.Найти(СтруктураЭтапа.НомерЭтапа, "НомерЭтапа");
			Если ЗначениеЗаполнено(РанееСозданныйЭтап) Тогда 
				ЭтапСделки_Объект = РанееСозданныйЭтап.Ссылка.ПолучитьОбъект();
				РанееСозданныйЭтап.Удалить = Ложь;
			Иначе 
				ЭтапСделки_Объект = Справочники.ЭтапыСделок.СоздатьЭлемент();
				ЭтапСделки_Объект.УстановитьНовыйКод();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ЭтапСделки_Объект, СтруктураЭтапа);
			ЭтапСделки_Объект.ВидСделки 			= ВидСделки;
			ЭтапСделки_Объект.ОбменДанными.Загрузка = Истина;
			Попытка
				ЭтапСделки_Объект.Записать();
			Исключение
				Отказ = Истина;
				ЗаписьЖурналаРегистрации(НСтр("ru='Ошибка создания вида сделки!';en='Mistake create kind of deals!'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ЭтапыСделок, , ОписаниеОшибки());			
			КонецПопытки;
		КонецЦикла;
		Для Каждого РанееСозданныйЭтап Из ТаблицаЭтапов Цикл 
			Если РанееСозданныйЭтап.Удалить Тогда 
				ЭтапСделки_Объект = РанееСозданныйЭтап.Ссылка.ПолучитьОбъект();
				Попытка
					ЭтапСделки_Объект.УстановитьПометкуУдаления(Истина);
				Исключение
					
				КонецПопытки;	
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли; 
	
#КонецОбласти

	МассивНеактуальныхПредопределнных = РезультатПакетаЗапросов[6].Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Для Каждого ВидПредопределенныйНеактуальный Из МассивНеактуальныхПредопределнных Цикл 
		ВидСделки_Объект = ВидПредопределенныйНеактуальный.ПолучитьОбъект();
		ВидСделки_Объект.ИмяПредопределенныхДанных = "";
		Попытка
			ВидСделки_Объект.ОбменДанными.Загрузка = Истина;
			ВидСделки_Объект.Записать();
		Исключение
			
		КонецПопытки;	
	КонецЦикла;	

КонецПроцедуры

// Процедура - Инициализировать предопределенный вид первичный повторный пациент
//
Процедура ИнициализироватьПредопределенныйВид_ПервичныйПовторныйПациент(ВидСделки = Неопределено, Отказ = Ложь) Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	ВидСделок__НовыеПациенты = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты");
	
	Запрос 		= Новый Запрос;
	Запрос.УстановитьПараметр("ПредопределенныйЭлемент_НовыеПациенты", ВидСделок__НовыеПациенты);	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыСделок.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВидСделкиНовыеПациенты
	|ИЗ
	|	Справочник.ВидыСделок КАК ВидыСделок
	|ГДЕ
	|	ВидыСделок.Предопределенный = ИСТИНА
	|	И ВидыСделок.Ссылка = &ПредопределенныйЭлемент_НовыеПациенты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапыСделок.Ссылка КАК Ссылка,
	|	ЭтапыСделок.Наименование КАК Наименование,
	|	ЭтапыСделок.ВидСделки КАК ВидСделки,
	|	ЭтапыСделок.НомерЭтапа КАК НомерЭтапа,
	|	ИСТИНА КАК Удалить
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.ВидСделки В
	|			(ВЫБРАТЬ
	|				ВидСделкиНовыеПациенты.Ссылка
	|			ИЗ
	|				ВидСделкиНовыеПациенты)
	|	И ЭтапыСделок.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЭтапа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидСделкиНовыеПациенты.Ссылка КАК Ссылка
	|ИЗ
	|	ВидСделкиНовыеПациенты КАК ВидСделкиНовыеПациенты";
	
	
	РезультатПакетаЗапросов = Запрос.ВыполнитьПакет();
	
#Область ОБЛАСТЬ_ИНИЦИАЛИЗИРОВАНИЯ_ПРЕДОПРЕДЕЛЕННОГО_ВИДА_СДЕЛКИ_НовыеПациенты
	
	ВыборкаНовыеПациенты = РезультатПакетаЗапросов[2].Выбрать();
	Если ВыборкаНовыеПациенты.Следующий() Тогда 
		ВидСделки_Объект = ВыборкаНовыеПациенты.Ссылка.ПолучитьОбъект();
	Иначе 
		ВидСделки_Объект = Справочники.ВидыСделок.СоздатьЭлемент();
		ВидСделки_Объект.УстановитьНовыйКод();
	КонецЕсли;		
	Если ВидСделки_Объект <> Неопределено Тогда 
		ВидСделки_Объект.ИмяПредопределенныхДанных 	= "НовыеПациенты";
		ВидСделки_Объект.Наименование 				= НСтр("ru = 'Первичный, повторный пациент'; en = 'Primary, repeat patient'");
		ВидСделки_Объект.Префикс 					= ПолучитьПрефиксВоронкиПоНаименованию(ВидСделки_Объект.Наименование);
		ВидСделки_Объект.ТипСделки 					= Перечисления.ТипыСделок.Продажа;
		ВидСделки_Объект.НаименованиеЭтапаУспех 	= НСтр("ru = 'Пациент пришел'; en = 'The patient came'");
		ВидСделки_Объект.НаименованиеЭтапаОтказ		= НСтр("ru = 'Пациент не пришел'; en = 'Patient didn''t come'");
		
		Если НЕ ЗначениеЗаполнено(ВидСделки_Объект.СтруктурныеЕдиницыПрименения) Тогда 
			СтрокаТЧ = ВидСделки_Объект.СтруктурныеЕдиницыПрименения.Добавить();
			СтрокаТЧ.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
		КонецЕсли;	
		
		ВидСделки_Объект.СтатусыПациентовПрименения.Очистить();
		ЗаполнитьЗначенияСвойств(ВидСделки_Объект.СтатусыПациентовПрименения.Добавить(), Новый Структура("СтатусПациента", Перечисления.СтатусыКонтрагентов.Потенциальный));
		ЗаполнитьЗначенияСвойств(ВидСделки_Объект.СтатусыПациентовПрименения.Добавить(), Новый Структура("СтатусПациента", Перечисления.СтатусыКонтрагентов.Первичный));
		ЗаполнитьЗначенияСвойств(ВидСделки_Объект.СтатусыПациентовПрименения.Добавить(), Новый Структура("СтатусПациента", Перечисления.СтатусыКонтрагентов.Постоянный));		
		ЗаполнитьЗначенияСвойств(ВидСделки_Объект.СтатусыПациентовПрименения.Добавить(), Новый Структура("СтатусПациента", Перечисления.СтатусыКонтрагентов.Отказ));
		
		ВидСделки_Объект.ОбменДанными.Загрузка 		= Истина;
		НачатьТранзакцию();
		Попытка
			НеобходимоОбновитьПовторноИспользуемыеЗначения = Ложь;			
			КлиентНеПришел 	= Справочники.ПричиныОтказов.ИнициализироватьПредопределеннуюПричинуОтказа("КлиентНеПришел"	, "Пациент не пришел", НеобходимоОбновитьПовторноИспользуемыеЗначения);
			КлиентОтказался = Справочники.ПричиныОтказов.ИнициализироватьПредопределеннуюПричинуОтказа("КлиентОтказался", "Пациент отказался", НеобходимоОбновитьПовторноИспользуемыеЗначения);
			ЛюбаяПричина 	= Справочники.ПричиныОтказов.ИнициализироватьПредопределеннуюПричинуОтказа("ЛюбаяПричина"	, "Любая причина", НеобходимоОбновитьПовторноИспользуемыеЗначения);
			
			Если ЗначениеЗаполнено(КлиентНеПришел) Тогда
				Если ВидСделки_Объект.ПричиныОтказов.Найти(КлиентНеПришел, "ПричинаОтказа") = Неопределено Тогда 
					ЗаполнитьЗначенияСвойств(ВидСделки_Объект.ПричиныОтказов.Добавить(), Новый Структура("ПричинаОтказа", КлиентНеПришел));	
				КонецЕсли;	
			КонецЕсли;
			Если ЗначениеЗаполнено(КлиентОтказался) Тогда
				Если ВидСделки_Объект.ПричиныОтказов.Найти(КлиентОтказался, "ПричинаОтказа") = Неопределено Тогда 				
					ЗаполнитьЗначенияСвойств(ВидСделки_Объект.ПричиныОтказов.Добавить(), Новый Структура("ПричинаОтказа", КлиентОтказался));	
				КонецЕсли;	
			КонецЕсли;
			
			ВидСделки_Объект.Записать();
			ВидСделки = ВидСделки_Объект.Ссылка;
			ЗафиксироватьТранзакцию();
			Если НеобходимоОбновитьПовторноИспользуемыеЗначения Тогда 
				ОбновитьПовторноИспользуемыеЗначения();
			КонецЕсли;				
		Исключение
			ОтменитьТранзакцию();
			Отказ = Истина;
			ЗаписьЖурналаРегистрации(НСтр("ru='Ошибка создания вида сделки!';en='Mistake create kind of deals!'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ВидыСделок, , ОписаниеОшибки());			
		КонецПопытки;	
	КонецЕсли;
	
	Если НЕ Отказ Тогда 
		ТаблицаЭтапов = РезультатПакетаЗапросов[1].Выгрузить();
		СтруктураЭтаповМассивом = Справочники.ЭтапыСделок.ПолучитьПервоначальнуюСтруктуруЭтаповВидаСделки(ВидСделки);
		Для Каждого СтруктураЭтапа Из СтруктураЭтаповМассивом Цикл
			МассивСтрокРанееСозданныхЭтапов = ТаблицаЭтапов.НайтиСтроки(Новый Структура("НомерЭтапа, Наименование", СтруктураЭтапа.НомерЭтапа, СтруктураЭтапа.Наименование));
			Если МассивСтрокРанееСозданныхЭтапов.Количество() = 0 Тогда
				ЭтапСделки_Объект = Справочники.ЭтапыСделок.СоздатьЭлемент();
				ЭтапСделки_Объект.УстановитьНовыйКод();
			Иначе 	
				ЭтапСделки_Объект = МассивСтрокРанееСозданныхЭтапов[0].Ссылка.ПолучитьОбъект();
				МассивСтрокРанееСозданныхЭтапов[0].Удалить = Ложь;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ЭтапСделки_Объект, СтруктураЭтапа);
			ЭтапСделки_Объект.ВидСделки 			= ВидСделки;
			Попытка
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ЭтапСделки_Объект);
			Исключение
				Отказ = Истина;
				ЗаписьЖурналаРегистрации(НСтр("ru='Ошибка создания вида сделки!';en='Mistake create kind of deals!'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ЭтапыСделок, , ОписаниеОшибки());			
			КонецПопытки;
		КонецЦикла;
		Для Каждого РанееСозданныйЭтап Из ТаблицаЭтапов Цикл 
			Если РанееСозданныйЭтап.Удалить Тогда 
				ЭтапСделки_Объект = РанееСозданныйЭтап.Ссылка.ПолучитьОбъект();
				ЭтапСделки_Объект.ПометкаУдаления = Истина;	
				Попытка
					ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ЭтапСделки_Объект);
				Исключение
					
				КонецПопытки;	
			КонецЕсли;	
		КонецЦикла;		
	КонецЕсли; 
	
#КонецОбласти

КонецПроцедуры

// Функция - Получить префикс сделки по наименованию
//
// Параметры:
//  Наименование - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПрефиксВоронкиПоНаименованию(Наименование) Экспорт 
	
	Префикс = "";
	МассивСлов = СтрРазделить(СокрЛП(Наименование), " ");
	Для Каждого Слово Из МассивСлов Цикл 
		Если СтрДлина(СокрЛП(Слово)) < 3 Тогда 
			Продолжить;
		КонецЕсли;
		Префикс = Префикс + ВРег(Лев(Слово, 1));
	КонецЦикла;
	
	Возврат Префикс;
	
КонецФункции

// Процедура - Обработка получения данных выбора
//
// Параметры:
//  ДанныеВыбора		 - 	 - 
//  Параметры			 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
 	СтандартнаяОбработка = Ложь;
	МассивТиповСделок = Новый Массив;
	Если Параметры.Отбор.Свойство("ТипСделки") Тогда
		Если ТипЗнч(Параметры.Отбор.ТипСделки) = Тип("ФиксированныйМассив") Тогда
			МассивТиповСделок = Параметры.Отбор.ТипСделки;
		Иначе
			МассивТиповСделок.Добавить(Параметры.Отбор.ТипСделки);
		КонецЕсли;		
	КонецЕсли;
	
	ДанныеВыбора = НайтиВидыСделокПоСтроке(Параметры.СтрокаПоиска, 12, МассивТиповСделок);	
	
КонецПроцедуры

// Функция - Найти виды сделок по строке
//
// Параметры:
//  СтрокаПоиска		 - 	 - 
//  РазмерПорции		 - 	 - 
//  МассивТиповСделок	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция НайтиВидыСделокПоСтроке(СтрокаПоиска, РазмерПорции = 12, МассивТиповСделок = Неопределено) Экспорт
	
	СтрокаПоиска = СокрЛ(СтрокаПоиска);
	Если СокрЛ(СтрокаПоиска) = "" ИЛИ СтрДлина(СтрокаПоиска) < 3 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//=======================АНАЛИЗ ВВЕДЕННЫХ СИМВОЛОВ=======================
	Если СтрДлина(СокрЛ(СтрокаПоиска)) <> 0 Тогда 
		//К = 1;
		ЕстьЦифры = Ложь;
		ЕстьБуквы = Ложь;
		СтрокаПоиска_М = СтрСоединить(СтрРазделить(СтрокаПоиска, " ()-+"));
		СтрокаПоиска_Ц = СтрСоединить(СтрРазделить(СтрокаПоиска, СтрСоединить(СтрРазделить(СтрокаПоиска, "0123456789"))));
		Если СтрокаПоиска_М = СтрокаПоиска_Ц Тогда 
			СтрокаПоиска = СтрокаПоиска_Ц;
			ЕстьЦифры = Истина;
		Иначе 
			КоличествоЦифр = 0;
			КоличествоБукв = 0;
			Для К = 1 По СтрДлина(СокрЛ(СтрокаПоиска)) Цикл 
				Если Найти("0123456789", Сред(СтрокаПоиска, К, 1)) <> 0 Тогда 
					ЕстьЦифры = Истина;
					КоличествоЦифр = КоличествоЦифр + 1;
				Иначе 
					ЕстьБуквы = Истина;
					КоличествоБукв = КоличествоБукв + 1;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;		
	
	Запрос = Новый Запрос;
	Если ЕстьБуквы И НЕ ЕстьЦифры Тогда
		
		Запрос.УстановитьПараметр("СтрокаПоиска", СокрЛ(СтрокаПоиска) + "%");
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 20
		               |	ВложенныйЗапрос.Ссылка КАК Ссылка,
		               |	МИНИМУМ(ВложенныйЗапрос.Индекс) КАК Индекс,
		               |	ВложенныйЗапрос.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	ВложенныйЗапрос.ТипСделки КАК ТипСделки,
		               |	ВложенныйЗапрос.Код КАК Код,
		               |	ВложенныйЗапрос.Наименование КАК Наименование
		               |ИЗ
		               |	(ВЫБРАТЬ ПЕРВЫЕ 20
		               |		ВидыСделок.Ссылка КАК Ссылка,
		               |		1 КАК Индекс,
		               |		ВидыСделок.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |		ВидыСделок.ТипСделки КАК ТипСделки,
		               |		ВидыСделок.Код КАК Код,
		               |		ВидыСделок.Наименование КАК Наименование
		               |	ИЗ
		               |		Справочник.ВидыСделок КАК ВидыСделок
		               |	ГДЕ
		               |		ВидыСделок.Наименование ПОДОБНО &СтрокаПоиска
		               |		И ВидыСделок.ПометкаУдаления = ЛОЖЬ
		               |		И (ВидыСделок.СтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		               |				ИЛИ ВидыСделок.СтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)
		               |		И ВидыСделок.ТипСделки В(&МассивТиповСделок)) КАК ВложенныйЗапрос
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВложенныйЗапрос.Ссылка,
		               |	ВложенныйЗапрос.СтруктурнаяЕдиница,
		               |	ВложенныйЗапрос.ТипСделки,
		               |	ВложенныйЗапрос.Код,
		               |	ВложенныйЗапрос.Наименование
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Индекс,
		               |	ВложенныйЗапрос.Наименование,
		               |	ВложенныйЗапрос.Код";
		
	Иначе
		
		Запрос.УстановитьПараметр("СтрокаПоиска", СокрЛ(СтрокаПоиска) + "%");
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 20
		               |	ВложенныйЗапрос.Ссылка КАК Ссылка,
		               |	МИНИМУМ(ВложенныйЗапрос.Индекс) КАК Индекс,
		               |	ВложенныйЗапрос.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	ВложенныйЗапрос.ТипСделки КАК ТипСделки,
		               |	ВложенныйЗапрос.Код КАК Код,
		               |	ВложенныйЗапрос.Наименование КАК Наименование
		               |ИЗ
		               |	(ВЫБРАТЬ ПЕРВЫЕ 20
		               |		ВидыСделок.Ссылка КАК Ссылка,
		               |		1 КАК Индекс,
		               |		ВидыСделок.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |		ВидыСделок.ТипСделки КАК ТипСделки,
		               |		ВидыСделок.Код КАК Код,
		               |		ВидыСделок.Наименование КАК Наименование
		               |	ИЗ
		               |		Справочник.ВидыСделок КАК ВидыСделок
		               |	ГДЕ
		               |		ВидыСделок.Наименование ПОДОБНО &СтрокаПоиска
		               |		И ВидыСделок.ПометкаУдаления = ЛОЖЬ
		               |		И (ВидыСделок.СтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		               |				ИЛИ ВидыСделок.СтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)
		               |		И ВидыСделок.ТипСделки В(&МассивТиповСделок)
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		ВидыСделок.Ссылка,
		               |		2,
		               |		ВидыСделок.СтруктурнаяЕдиница,
		               |		ВидыСделок.ТипСделки,
		               |		ВидыСделок.Код,
		               |		ВидыСделок.Наименование
		               |	ИЗ
		               |		Справочник.ВидыСделок КАК ВидыСделок
		               |	ГДЕ
		               |		ВидыСделок.Код ПОДОБНО &СтрокаПоиска
		               |		И ВидыСделок.ПометкаУдаления = ЛОЖЬ
		               |		И (ВидыСделок.СтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		               |				ИЛИ ВидыСделок.СтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)
		               |		И ВидыСделок.ТипСделки В(&МассивТиповСделок)) КАК ВложенныйЗапрос
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВложенныйЗапрос.Ссылка,
		               |	ВложенныйЗапрос.СтруктурнаяЕдиница,
		               |	ВложенныйЗапрос.ТипСделки,
		               |	ВложенныйЗапрос.Код,
		               |	ВложенныйЗапрос.Наименование
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Индекс,
		               |	ВложенныйЗапрос.Наименование,
		               |	ВложенныйЗапрос.Код";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	Если МассивТиповСделок.Количество() > 0 Тогда 
		Запрос.УстановитьПараметр("МассивТиповСделок", МассивТиповСделок);
	Иначе                                                 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВидыСделок.ТипСделки В(&МассивТиповСделок)", "ИСТИНА");
	КонецЕсли;	
	
	Результат = Запрос.Выполнить().Выбрать();			
	
	СписокКонтрагентов = Новый СписокЗначений;
	
	Счетчик = 1;
	Пока ?(РазмерПорции = 0, Результат.Следующий(), Результат.Следующий() И Счетчик <= РазмерПорции) Цикл
		Представление = "" + СокрЛП(Результат.Наименование);
		СписокКонтрагентов.Добавить(Результат.Ссылка, Представление);			
		Счетчик = Счетчик + 1;                                       		
	КонецЦикла;                            	 			
	
	Возврат СписокКонтрагентов;
	
КонецФункции

// Функция - Получить структурную единицу применения вида сделки
//
// Параметры:
//  ВидСделки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтруктурнуюЕдиницуПримененияВидаСделки(ВидСделки) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидСделки", ВидСделки);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА ВидыСделокСтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА ВидыСделокСтруктурныеЕдиницыПрименения.НомерСтроки + 99
	|		КОГДА ВидыСделокСтруктурныеЕдиницыПрименения.Ссылка.СтруктурнаяЕдиница = ВидыСделокСтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница
	|			ТОГДА 0
	|		ИНАЧЕ ВидыСделокСтруктурныеЕдиницыПрименения.НомерСтроки
	|	КОНЕЦ КАК Приоритет,
	|	ВЫБОР
	|		КОГДА ВидыСделокСтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА ВидыСделокСтруктурныеЕдиницыПрименения.Ссылка.СтруктурнаяЕдиница
	|		ИНАЧЕ ВидыСделокСтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиница
	|ИЗ
	|	Справочник.ВидыСделок.СтруктурныеЕдиницыПрименения КАК ВидыСделокСтруктурныеЕдиницыПрименения
	|ГДЕ
	|	ВидыСделокСтруктурныеЕдиницыПрименения.Ссылка = &ВидСделки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	ВыборкаСЕ = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаСЕ.Следующий() Тогда 
		Если ЗначениеЗаполнено(ВыборкаСЕ.СтруктурнаяЕдиница) Тогда 
			Возврат ВыборкаСЕ.СтруктурнаяЕдиница;
		Иначе 
			Возврат ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница; // в любой клинике
	    КонецЕсли;
	Иначе 
		Возврат ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница; // в любой клинике
	КонецЕсли;	
	
КонецФункции

// Функция - Получить наименования завершающих этапов сделки
//
// Параметры:
//  СделкаИлиВид - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьНаименованияЗавершающихЭтаповСделки(СделкаИлиВид) Экспорт
	
	СтруктураНаименований = Новый Структура;
	СтруктураНаименований.Вставить("НаименованиеЭтапаУспех", "Успех");
	СтруктураНаименований.Вставить("НаименованиеЭтапаОтказ", "Отказ");
	
	Если НЕ ЗначениеЗаполнено(СделкаИлиВид) Тогда 
		Возврат СтруктураНаименований;
	КонецЕсли;
	
	Если ТипЗнч(СделкаИлиВид) = Тип("СправочникСсылка.ВидыСделок") Тогда 
		ВидСделки = СделкаИлиВид;
	ИначеЕсли ТипЗнч(СделкаИлиВид) = Тип("СправочникСсылка.Сделки") Тогда 
		ВидСделки = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СделкаИлиВид, "ВидСделки");
	Иначе 
		Возврат СтруктураНаименований;
	КонецЕсли; 	
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидСделки", ВидСделки);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыСделок.НаименованиеЭтапаУспех КАК НаименованиеЭтапаУспех,
	               |	ВидыСделок.НаименованиеЭтапаОтказ КАК НаименованиеЭтапаОтказ
	               |ИЗ
	               |	Справочник.ВидыСделок КАК ВидыСделок
	               |ГДЕ
	               |	ВидыСделок.Ссылка = &ВидСделки";
	
	ВыборкаНаименований = Запрос.Выполнить().Выбрать();
	Если ВыборкаНаименований.Следующий() Тогда
		Если ЗначениеЗаполнено(СокрЛП(ВыборкаНаименований.НаименованиеЭтапаУспех)) Тогда 
			СтруктураНаименований.НаименованиеЭтапаУспех = СокрЛП(ВыборкаНаименований.НаименованиеЭтапаУспех);
		КонецЕсли;
		Если ЗначениеЗаполнено(СокрЛП(ВыборкаНаименований.НаименованиеЭтапаОтказ)) Тогда 
			СтруктураНаименований.НаименованиеЭтапаОтказ = СокрЛП(ВыборкаНаименований.НаименованиеЭтапаОтказ);
		КонецЕсли;
		Возврат СтруктураНаименований;
	Иначе 
		Возврат СтруктураНаименований;
	КонецЕсли;	
		
КонецФункции

#КонецОбласти
	
#КонецЕсли