
#Область ОбработчикиСобытий 
// Процедура - Перед записью
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПричиныОтказов) Тогда
	//	Отказ = Истина;
	//	ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Укажите причину отказа';en='Specify the reason for refusal'")
	//										, 
	//										, "Объект.ПричиныОтказов[0].ПричинаОтказа");
	//	Возврат;
	//КонецЕсли;
	
КонецПроцедуры

// Процедура - При записи
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;
	
	АктуализироватьЭтапыВидаСделки();
	АктуализироватьТриггерныеСобытия();
	
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Актуализировать этапы вида сделки
//
Процедура АктуализироватьЭтапыВидаСделки()
	
	Если ДополнительныеСвойства.Свойство("ЭтапыСделок") Тогда 
		ЭтапыСделок = ДополнительныеСвойства.ЭтапыСделок;
		КоличествоСтрок = ЭтапыСделок.Количество();
		ЭтапыСделок.Удалить(КоличествоСтрок - 1);
		
		Для Каждого СтрокаТЗ Из ЭтапыСделок Цикл
			
			Цвет = ?(ЗначениеЗаполнено(СтрокаТЗ.Цвет), СтрокаТЗ.Цвет, ЗначениеВСтрокуВнутр(Новый Цвет));
			
			Если НЕ СтрокаТЗ.Ссылка.Пустая() Тогда
				
				СтарыйЭтапОбъект = СтрокаТЗ.Ссылка.ПолучитьОбъект();
				СтарыйЭтапОбъект.Наименование = СтрокаТЗ.Наименование;
				СтарыйЭтапОбъект.ЦветЭтапа	  = Цвет;
				СтарыйЭтапОбъект.НомерЭтапа	  = ЭтапыСделок.Индекс(СтрокаТЗ) + 1;
				СтарыйЭтапОбъект.Записать();
				
			Иначе
				
				НовыйЭтап = Справочники.ЭтапыСделок.СоздатьЭлемент();
				НовыйЭтап.ВидСделки    = Ссылка;
				НовыйЭтап.НомерЭтапа   = ЭтапыСделок.Индекс(СтрокаТЗ) + 1;
				НовыйЭтап.ЦветЭтапа    = Цвет;
				НовыйЭтап.Наименование = СтрокаТЗ.Наименование;
				НовыйЭтап.Записать();
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Актуализировать триггерные события
//
Процедура АктуализироватьТриггерныеСобытия()
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Сбрасываем неактуальные этапы в триггерах
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапыСделок.Ссылка КАК Этап
	               |ПОМЕСТИТЬ ТаблицаЭтапов
	               |ИЗ
	               |	Справочник.ЭтапыСделок КАК ЭтапыСделок
	               |ГДЕ
	               |	ЭтапыСделок.ВидСделки = &ВидСделки
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЭтапыСделок.Ссылка
	               |ИЗ
	               |	Справочник.ЭтапыСделок КАК ЭтапыСделок
	               |ГДЕ
	               |	ЭтапыСделок.Предопределенный = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТриггерныеСобытия.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ТриггерныеСобытия КАК ТриггерныеСобытия
	               |ГДЕ
	               |	ТриггерныеСобытия.ЭтоГруппа = ЛОЖЬ
	               |	И ТриггерныеСобытия.Действия.ВидДействия В (ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки), ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки))
	               |	И ТриггерныеСобытия.Действия.ВидСделки = &ВидСделки
	               |	И НЕ ТриггерныеСобытия.Действия.ЭтапСделки = ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.ПустаяСсылка)
	               |	И НЕ ТриггерныеСобытия.Действия.ЭтапСделки В
	               |				(ВЫБРАТЬ
	               |					ТаблицаЭтапов.Этап
	               |				ИЗ
	               |					ТаблицаЭтапов)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТриггерныеСобытия.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаЭтапов.Этап КАК Этап
	               |ИЗ
	               |	ТаблицаЭтапов КАК ТаблицаЭтапов";
	
	Запрос.УстановитьПараметр("ВидСделки", Ссылка);
	ПакетЗапросов 		= Запрос.ВыполнитьПакет();
	МассивЭтапов 		= ПакетЗапросов[2].Выгрузить().ВыгрузитьКолонку("Этап");	
	ВыборкаТриггеров 	= ПакетЗапросов[1].Выбрать();
	Пока ВыборкаТриггеров.Следующий() Цикл 
		Триггер_Объект = ВыборкаТриггеров.Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаДействие Из Триггер_Объект.Действия Цикл
			Если СтрокаДействие.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки ИЛИ СтрокаДействие.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки Тогда 
				Если СтрокаДействие.ВидСделки = Ссылка И МассивЭтапов.Найти(СтрокаДействие.ЭтапСделки) = Неопределено Тогда 
					СтрокаДействие.ЭтапСделки = Справочники.ЭтапыСделок.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		Триггер_Объект.ОбменДанными.Загрузка = Истина;
		Триггер_Объект.Записать();
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры	




#КонецОбласти
