
#Область ОбработчикиСобытийФормы

&НаСервере
//
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();     
	Для Каждого ЭлементОтбора Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		НовыйОтбор = Отчет.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЗаполнитьЗначенияСвойств(НовыйОтбор, ЭлементОтбора);
	КонецЦикла;
	
	ЭлементыПараметраДанных = Отчет.КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.Элементы;
	ЭлементыПараметраВывода = Отчет.КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы;
	Если Параметры.Свойство("Контрагент") Тогда
		ЭлементыПараметраДанных.Найти("Контрагент").Значение = Параметры.Контрагент;
		ЭлементыПараметраДанных.Найти("Контрагент").Использование = Истина;
		ЭлементыПараметраДанных.Найти("ЭтоКонтрагент").Значение = Не (Параметры.Контрагент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты);
		ЭлементыПараметраДанных.Найти("ЭтоКонтрагент").Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ПриОткрытии(Отказ)
	Попытка	
		ЭтаФорма.СкомпоноватьРезультат();
	Исключение
		ЗагрузитьНастройкиПоУмолчанию();
		ЭтаФорма.СкомпоноватьРезультат();
	КОнецПопытки;
	
КонецПроцедуры

#КонецОбласти

  #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНастройкиПоУмолчанию()
	
	СхемаКомпоновкиДанных = Отчеты.ПерейтиВзаиморасчеты.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	
КонецПроцедуры

#КонецОбласти


