
#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура обработчик команды ИзменитьЦветФона.
//
Процедура ИзменитьЦветФона(Команда)
	
	ДиалогЦвета = Новый ДиалогВыбораЦвета();
	
	#Если Не ВебКлиент Тогда
		ДиалогЦвета.Цвет = Элементы.КнопкаЦветФона.ЦветФона;
	#КонецЕсли
	
	ДиалогЦвета.Показать(Новый ОписаниеОповещения("ИзменитьЦветФонаЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЦветФонаЗавершение(Цвет, ДополнительныеПараметры) Экспорт
	
	Если (Цвет <> Неопределено) = Истина Тогда
		ИзменитьЦветФонаНаСервере(Цвет);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	Элементы.КнопкаЦветФона.ЦветФона = ?(ЗначениеЗаполнено(Объект.ЦветФона), ЗначениеИзСтрокиВнутр(Объект.ЦветФона), Новый Цвет());
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Не Объект.ЭтоГруппа Тогда
			Объект.ОтображатьВРасписанииЗанятий = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмененаДолжность", Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура изменяет устанавливает в значение реквизита - цвет фона.
//
Процедура ИзменитьЦветФонаНаСервере(Цвет)
	
	Объект.ЦветФона = ЗначениеВСтрокуВнутр(Цвет);
	Элементы.КнопкаЦветФона.ЦветФона = Цвет;
	
КонецПроцедуры

#КонецОбласти
