#Область СобытияФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере"
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти


&НаСервере
// Функция скрывает не основные элементы
Процедура СкрытьНеОсновныеЭлементы() Экспорт
	Элементы.ПодчиненРеквизиту.Видимость = Ложь;
	Элементы.ПодчиненДиагнозу.Видимость = Ложь;
КонецПроцедуры

