
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дерево = РеквизитФормыВЗначение("ОбъектДеревоРеквизитов");
	
	ТаблицаПараметров = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуПараметровВсехПодставляемыхРеквизитов();
	ТаблицаРодителейПараметров = ТаблицаПараметров.Скопировать(, "ОсновнаяТаблицаОбъекта, ПредставлениеОсновнойТаблицаОбъекта");
	ТаблицаРодителейПараметров.Свернуть("ОсновнаяТаблицаОбъекта, ПредставлениеОсновнойТаблицаОбъекта");
	
	Для Каждого СтрокаРодитель Из ТаблицаРодителейПараметров Цикл 
		РодительСтрок = ДобавитьСтрокуВДеревоЗначений(Дерево, СтрокаРодитель.ОсновнаяТаблицаОбъекта, СтрокаРодитель.ПредставлениеОсновнойТаблицаОбъекта, Ложь, , БиблиотекаКартинок.ПапкаТемная);
		МассивПараметров = ТаблицаПараметров.НайтиСтроки(Новый Структура("ОсновнаяТаблицаОбъекта", СтрокаРодитель.ОсновнаяТаблицаОбъекта));
		Для Каждого ЭлементМассива Из МассивПараметров Цикл 
			ДобавитьСтрокуВДеревоЗначений(РодительСтрок, ЭлементМассива.НаименованиеПараметра, ЭлементМассива.ПредставлениеПараметра, , , БиблиотекаКартинок.ЧекБоксПолный);
		КонецЦикла;	
	КонецЦикла;
	
	//--------------------------------------------------------------------------------------------
	
	//РодительСтрок = ДобавитьСтрокуВДеревоЗначений(Дерево, "Клиент", Ложь);
	//ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Фамилия");
	//ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Имя");
	//ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Отчество");
	//ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "ФИО");

	//РодительСтрок = ДобавитьСтрокуВДеревоЗначений(Дерево, "Посещение", Ложь);
	//ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "День");
	//ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Время");
	//ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "День и время");
	//ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Услуга");
	//ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Сотрудник");
	//ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Структурная единица");
	
	ЗначениеВРеквизитФормы(Дерево, "ОбъектДеревоРеквизитов");	
		
	//Элементы.ДеревоРеквизитов.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КоллекцияЭлементовДерева = ОбъектДеревоРеквизитов.ПолучитьЭлементы();	
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
		Если Строка.НаименованиеПараметра = АктуальныйРаздел Тогда 
			ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
			Элементы.ДеревоРеквизитов.Развернуть(ИдентификаторСтроки);
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Функция ДобавитьСтрокуВДеревоЗначений(РодительСтроки, НаименованиеПараметра, ПредставлениеПоля, РазрешитьВыбор = Истина, ФорматСтроки = "", КартинкаСтроки = Неопределено)
	
	НоваяСтрока 						= РодительСтроки.Строки.Добавить();
	НоваяСтрока.НаименованиеПараметра 	= НаименованиеПараметра;
	НоваяСтрока.Представление 			= ПредставлениеПоля;	
	НоваяСтрока.РазрешитьВыбор 			= РазрешитьВыбор;
	НоваяСтрока.ФорматСтроки   			= ФорматСтроки;
	Если ЗначениеЗаполнено(КартинкаСтроки) Тогда 
		НоваяСтрока.Картинка   			= КартинкаСтроки;
	КонецЕсли;	
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Процедура ДеревоРеквизитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ ТекущиеДанные.РазрешитьВыбор = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементРодитель = ТекущиеДанные.ПолучитьРодителя();
	Если ЭлементРодитель <>Неопределено Тогда 
		АктуальныйРаздел = ЭлементРодитель.НаименованиеПараметра
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ФорматСтроки) Тогда 
    	Представление = ТекущиеДанные.ФорматСтроки; 
    Иначе	
	    Представление = ТекущиеДанные.НаименованиеПараметра;
    КонецЕсли;

	Закрыть(Представление);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекущиеДанные = Элементы.ДеревоРеквизитов.ТекущиеДанные;
    Если ТекущиеДанные = Неопределено ИЛИ ТекущиеДанные.РазрешитьВыбор = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементРодитель = ТекущиеДанные.ПолучитьРодителя();
	Если ЭлементРодитель <>Неопределено Тогда 
		АктуальныйРаздел = ЭлементРодитель.НаименованиеПараметра
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ФорматСтроки) Тогда 
    	Представление = ТекущиеДанные.ФорматСтроки; 
    Иначе	
	    Представление = ТекущиеДанные.НаименованиеПараметра;
    КонецЕсли;

	Закрыть(Представление);
	
КонецПроцедуры

