
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивСтруктурДанных            = Новый Массив;
	МассивНеИспользуемыхУведомлений = Новый Массив;
	
	Параметры.Свойство("МассивНеИспользуемыхУведомлений", МассивНеИспользуемыхУведомлений);
	Параметры.Свойство("МассивАктивныхУведомлений"      , МассивСтруктурДанных);
	Параметры.Свойство("ОбъектОграничения"              , ОбъектОграничения   );
	Параметры.Свойство("Реквизит"		                , Реквизит            );
		
	МассивКолонок = Новый Массив();
	МассивКолонок.Добавить("Push");
	МассивКолонок.Добавить("SMS");
	МассивКолонок.Добавить("EMail");
	МассивКолонок.Добавить("Задача");
	МассивКолонок.Добавить("Мессенджер");
	
	Для Каждого ЭлементМ Из МассивНеИспользуемыхУведомлений Цикл 
		Элементы[ЭлементМ].Видимость           = Ложь;
		Элементы[ЭлементМ + "Шапка"].Видимость = Ложь;
	КонецЦикла;	
	
	ОбработкаТабличныхЧастейКлиент.СоздатьДеревоСтруктурныхЕдиниц(ЭтаФорма, Реквизит, ОбъектОграничения,,,,, МассивКолонок) 
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перед закрытием
//
// Параметры:
//  Отказ				 - 	 - 
//  ЗавершениеРаботы	 - 	 - 
//  ТекстПредупреждения	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МассивВыбранныхУведомлений = Новый Массив;
	ЗаполнитьМассивВыбранныхСтруктурныхЕдиниц(ЭтотОбъект.ПодборСтруктурныеЕдиницы.ПолучитьЭлементы(), МассивВыбранныхУведомлений);
	
	ЭтаФорма.Закрыть(МассивВыбранныхУведомлений);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Процедура - Выгружать при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ВыгружатьПриИзменении(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.УстановитьФлагиНаСтруктурныеЕдиницы(ЭтаФорма,, Элемент.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Рекурсивный метод обхода дерева и выбора структурных единиц, установленных в Истину
//
Функция ЗаполнитьМассивВыбранныхСтруктурныхЕдиниц(ДанныеДерева, МассивВыбранныхУведомлений)
	
	Для Каждого УровеньДерева ИЗ ДанныеДерева Цикл
		
		ЗаполнитьМассивВыбранныхСтруктурныхЕдиниц(УровеньДерева.ПолучитьЭлементы(), МассивВыбранныхУведомлений);
		
		Если НЕ УровеньДерева.ЭтоГруппа Тогда
			
			СтруктураУведомлений = Новый Структура;
			СтруктураУведомлений.Вставить("СтруктурнаяЕдиница", УровеньДерева.СтруктурнаяЕдиница);
			СтруктураУведомлений.Вставить("Push"      , УровеньДерева.Push  );
			СтруктураУведомлений.Вставить("SMS"       , УровеньДерева.SMS   );
			СтруктураУведомлений.Вставить("EMail"     , УровеньДерева.Email );
			СтруктураУведомлений.Вставить("Задача"    , УровеньДерева.Задача);
			СтруктураУведомлений.Вставить("Мессенджер", УровеньДерева.Мессенджер);

			
			МассивВыбранныхУведомлений.Добавить(СтруктураУведомлений);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

#КонецОбласти



