
#Область ОписаниеПеременных

&НаКлиенте
Перем ИскомыйКлиент; 
&НаКлиенте
Перем СтруктураОбязательныеПоля; // Хранит обязательные поля
&НаКлиенте
Перем ПризнакСозданияНовогоПациента; // Флаг для корректной работы создания нового пациента
&НаКлиенте
Перем ПризнакИзмененияВремениВрачей; // Флаг для корректной работы изменения времени работы врача/ей
&НаКлиенте
Перем ОтветПользователяНаВопрос; 

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовыйДок = Объект.Ссылка.Пустая();

	ЭтотОбъект.ЗапускВэбКлиент = ОбщегоНазначения.ЭтоВебКлиент();
	
	ИнициализироватьСписокСтатусовПредварительнойЗаписи();	
	ИспользуетсяРасширениеМессенджер = ОбщегоНазначенияСтоматология.ИспользуетсяРасширение("Мессенджер");	
	ДатаДокумента = ?(НЕ ЗначениеЗаполнено(Объект.Дата), ТекущаяДатаСеанса(), Объект.Дата);	
	Если ЭтоНовыйДок Тогда
		
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = "Назначение приема";
				
		Объект.Дата = ?(ЗначениеЗаполнено(Параметры.ДатаНачала), Параметры.ДатаНачала, ТекущаяДатаСеанса());	
		Параметры.Свойство("Резерв"			, Объект.Резерв); 	
		Параметры.Свойство("ПеренесённаяПредварительнаяЗапись", Объект.ПеренесённаяПредварительнаяЗапись);
		Если Параметры.Свойство("Сделка") И Параметры.Свойство("Сотрудник") И (Параметры.Сделка.Врач = Параметры.Сотрудник ИЛИ Параметры.Сделка.Врач = Справочники.Сотрудники.ПустаяСсылка())Тогда
			Параметры.Свойство("Сделка", Объект.Сделка); 
		КонецЕсли;
		Параметры.Свойство("Заявка"				, ТекущаяЗаявка); 
		Параметры.Свойство("ИсточникЗаписи"		, Объект.ИсточникЗаписи);
		Параметры.Свойство("СтруктурнаяЕдиница"	, Объект.СтруктурнаяЕдиница);
		
		Объект.Комментарий = ?(Параметры.Свойство("ПричинаЗаписи") И ЗначениеЗаполнено(Параметры.ПричинаЗаписи), Параметры.ПричинаЗаписи, Неопределено);
		
		Если НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда 
			
			НоваяСтрокаОбъектУслуги = Объект.Услуги.Добавить();
						
			Если ЗначениеЗаполнено(Параметры.ДатаНачала) И ЗначениеЗаполнено(Параметры.ДатаОкончания)  Тогда 

				Параметры.Свойство("ВнутреннийНомерСотрудника"	, ЭтотОбъект.ВнутреннийНомерСотрудника);  
				Параметры.Свойство("IDЗвонка"					, ЭтотОбъект.IDЗвонка);
          		Параметры.Свойство("Контрагент"					, Объект.Контрагент); 
				
				// Если в форму передан контрагент для заполнения запретить возможность его изменения
				// Если ЗначениеЗаполнено(Объект.Контрагент) И НЕ ЗначениеЗаполнено(ЭтотОбъект.ВнутреннийНомерСотрудника) Тогда
				//		Элементы.Контрагент.ТолькоПросмотр = Истина;
				// КонецЕсли;	

				Если Не ЗначениеЗаполнено(Объект.Контрагент) И ЗначениеЗаполнено(ТекущаяЗаявка) И ЗначениеЗаполнено(ТекущаяЗаявка.НомерТелефона) Тогда
					Телефон_НовыйПациент = ТекущаяЗаявка.НомерТелефона;
					ДобавитьТелефонСуществующемуПациенту = Истина;
				ИначеЕсли ЗначениеЗаполнено(Объект.Контрагент) И ЗначениеЗаполнено(Объект.Контрагент.Телефон) Тогда
	                Телефон_НовыйПациент = Объект.Контрагент.Телефон;
				КонецЕсли; 
				Если Параметры.Свойство("ВходящийНомерТелефона") И ЗначениеЗаполнено(Параметры.ВходящийНомерТелефона) Тогда
					Объект.ВходящийНомерТелефона = Параметры.ВходящийНомерТелефона;	
					Телефон_НовыйПациент = Параметры.ВходящийНомерТелефона;
				КонецЕсли;
				НоваяСтрокаОбъектУслуги.ДатаНачала    = Параметры.ДатаНачала;
				НоваяСтрокаОбъектУслуги.ДатаОкончания = Параметры.ДатаОкончания;
			Иначе
				НоваяСтрокаОбъектУслуги.ДатаНачала    = ТекущаяДатаСеанса();
				НоваяСтрокаОбъектУслуги.ДатаОкончания = НоваяСтрокаОбъектУслуги.ДатаНачала + 3600;	
			КонецЕсли;
					
			НоваяСтрокаОбъектУслуги.Сотрудник     = ?(ЗначениеЗаполнено(Параметры.Сотрудник), Параметры.Сотрудник, Неопределено);
			НоваяСтрокаОбъектУслуги.Помещение     = ?(ЗначениеЗаполнено(Параметры.Помещение), Параметры.Помещение, ПолучитьПомещениеСотрудникаПоУмолчанию(Параметры.Сотрудник, Объект.СтруктурнаяЕдиница));
			НоваяСтрокаОбъектУслуги.НормаВремени  = (НоваяСтрокаОбъектУслуги.ДатаОкончания - НоваяСтрокаОбъектУслуги.ДатаНачала) / 60;			
				
			ДатаНачала 		= НоваяСтрокаОбъектУслуги.ДатаНачала;
			ДатаОкончания 	= НоваяСтрокаОбъектУслуги.ДатаОкончания;
			НормаВремени 	= НоваяСтрокаОбъектУслуги.НормаВремени; 			
			
		Иначе   // если документ копируется, то время брать от копируемого документа, а дату текущую
			
			Если ЗначениеЗаполнено(Параметры.ДатаНачала)  Тогда
				Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
					СтрокаТЧ.ДатаНачала    = Параметры.ДатаНачала;
					СтрокаТЧ.ДатаОкончания = СтрокаТЧ.ДатаНачала + (СтрокаТЧ.НормаВремени * 60);
				КонецЦикла;
			Иначе
				Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
					СтрокаТЧ.ДатаНачала = НачалоДня(ТекущаяДатаСеанса()) + ((Час(СтрокаТЧ.ДатаНачала) * 3600) + (Минута(СтрокаТЧ.ДатаНачала) * 60) + (Секунда(СтрокаТЧ.ДатаНачала)));
					СтрокаТЧ.ДатаОкончания = СтрокаТЧ.ДатаНачала + (СтрокаТЧ.НормаВремени * 60);
				КонецЦикла;
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
			
	Если Объект.Услуги.Количество() = 0 Тогда // в тч Услуги обязательно должна быть хоть одна строка
		НоваяСтрокаОбъектУслуги = Объект.Услуги.Добавить();
		НоваяСтрокаОбъектУслуги.ДатаНачала    = ТекущаяДатаСеанса();
		НоваяСтрокаОбъектУслуги.ДатаОкончания = НоваяСтрокаОбъектУслуги.ДатаНачала + 3600;
		НоваяСтрокаОбъектУслуги.НормаВремени  = (НоваяСтрокаОбъектУслуги.ДатаОкончания - НоваяСтрокаОбъектУслуги.ДатаНачала) / 60;
	КонецЕсли;
		
	Параметры.Свойство("ИнтервалГрафика", ИнтервалГрафика);
		
	УстановитьДаты();		
	РаботаСДиалогами.УстановитьДоступностьЭлементовФормДокументаПоПравамПользователя(ЭтаФорма, Объект);				
    ОбновитьНадписи(); 
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		// Инициализируем полисы мед. страхования пациента
		ОбновитьПолисыМедицинскогоСтрахования(Истина);
		// Обновляем виджет сделок
		УправлениеИнтерфейсамиСервер.ОбновитьВиджетСделки(ЭтаФорма, Объект.Контрагент, Объект.Сделка);
		// Заполняем комментарий при создании записи
		ИнициализироватьКомментарий();
		// Выводим наряд-заказы
		ВывестиНезавершенныеНарядЗаказы();  
		// Выводим долги пациента
		МассивРодителей = Новый Массив();
		МассивРодителей.Добавить("ГруппаДолгиКонтрагентаСуществующие");
		МассивРодителей.Добавить("ГруппаБудущиеСобытияКлиента");
		ОтображениеДополнительнойИнформации(МассивРодителей);
		ИнформированияПоДнюРожденияКонтрагента = ПроверитьНеобходимостьИнформированияПоДнюРожденияКонтрагента(Объект.Контрагент); 
        Если Не ЭтоНовыйДок Тогда
			ЭтотОбъект.ДанныеВнешнихСистемМессенджера = ПолучитьДоступныеВнешниеСистемыМессенджера(Объект.Контрагент, Объект.СтруктурнаяЕдиница);
		КонецЕсли;	
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ВидЦен = ВернутьВидЦены(Объект.ПолисМедСтрахования, Объект.Услуги[0].Сотрудник, Объект.СтруктурнаяЕдиница); 
	КонецЕсли;
	
	ЗаполнитьТаблицуМеток();
	ОбновитьМетки();
		
	// Здесь также формируется список для выбора времени приема
	ПриИзменениеДатыВизитаНаСервере(ДатаНачала); 	
	// Установка цвета
	Если ЗначениеЗаполнено(Объект.ЦветФонаРезерва) Тогда
		ЦветФонаРезерваФорма = ЗначениеИзСтрокиВнутр(Объект.ЦветФонаРезерва);
		Элементы.УстановкаЦвет.ЦветФона = ЗначениеИзСтрокиВнутр(Объект.ЦветФонаРезерва);
	Иначе 
		ЦветФонаРезерваФорма = WebЦвета.Хаки;
		Объект.ЦветФонаРезерва = ЗначениеВСтрокуВнутр(ЦветФонаРезерваФорма);
		Элементы.УстановкаЦвет.ЦветФона = ЗначениеИзСтрокиВнутр(Объект.ЦветФонаРезерва);
	КонецЕсли;	
	
	УстановитьОбязательныеПоля();	
	
	// Скрываем/Показываем блок с услугами до нажатия кнопки ДобавитьУслугу	
	ПоказыватьКнопкуДобавленияУслуг = ?(Объект.Услуги.Количество() = 0, Истина, Ложь);
	Если НЕ ПоказыватьКнопкуДобавленияУслуг Тогда
		Если ЗначениеЗаполнено(Объект.Услуги[0].Номенклатура) ИЛИ Объект.Услуги.Количество() >= 2 Тогда	
			СоздатьДинамическиеЭлементыГруппыЗапись();
		Иначе
			ПоказыватьКнопкуДобавленияУслуг = Истина;	
		КонецЕсли;				
	КонецЕсли;
	Элементы.ГруппаКнопкаДобавитьУслуги.Видимость = ПоказыватьКнопкуДобавленияУслуг;
	Элементы.ГруппаУслугПолями.Видимость = НЕ ПоказыватьКнопкуДобавленияУслуг;
			
	УстановитьВидимостьЭлементов();

	// Вставим в заголовок кнопки "Прием" номер созданного приема
	Если ЗначениеЗаполнено(Объект.СсылкаНаПрием) Тогда
		НомерПриемаПолный = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.СсылкаНаПрием, "Номер");
		НомерПриемаКраткий = ФормированиеПечатныхФорм.ПолучитьНомерНаПечатьПосле2011г(НомерПриемаПолный, Истина, Истина);
		Элементы.ФормаКнопкаВвестиПосещение.Заголовок = "Прием №"+НомерПриемаКраткий;
	КонецЕсли;
	
	// Для контроля записей родственных связей у нового пациента;
	ПациентЗаписан_НовыйПациент = Ложь;
	
	ЗаполнитьТЧ_КИ_ПриИзменении();	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
	Параметры.Свойство("ЭтоРабочееВремя", ЭтотОбъект.ЭтоРабочееВремяСотрудника);
		
	// Сформируем надпись
	Элементы.ВыбратьСтруктурнуюЕдиницу.Заголовок = Строка(Объект.СтруктурнаяЕдиница);
	
	// Заполним интервалы длительности приема.
	ЗаполнитьИнтервалиДлительностиПриема();
	ПриемОкончен = Перечисления.СтатусыСобытия.ПриемОкончен;
	
    УстановитьПараметрыВыбораСотрудникаНаСервере();
	
	// Показываем признак блокировки и показываем нужный замок 
	НомерЗамка = Число(ВернутьКонстантуНесколькоВрачейВОдномПриеме()); 
	НужныйЗамок = Элементы.Найти("УстановитьЗамок"+НомерЗамка); 
	НужныйЗамок.Картинка = ?(Объект.Услуги.Количество() > 0 И Объект.Услуги[0].ПризнакЗаблокированно = 1, БиблиотекаКартинок.ЗамокБлокировка, БиблиотекаКартинок.ЗамокОткрытый); 	 
	НенужныйЗамок = Элементы.Найти("УстановитьЗамок"+?(НомерЗамка = 1, 0, 1));
	НенужныйЗамок.Видимость = Ложь;
	
	ПериодРаботыСЕ = ОбщегоНазначенияСтоматология.ПолучитьВремяРаботыСтруктурнойЕдиницы(НачалоДня(ДатаНачала), Объект.СтруктурнаяЕдиница);
		
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриОткрытии.
// В процедуре устанавливается текущая страница в зависимости от операции.
//
Процедура ПриОткрытии(Отказ)
		
	// МеханизмВнешнегоОборудования
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ОписаниеОшибки = "";
		
		ПоддерживаемыеТипыВО = Новый Массив();
		// ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
		ПоддерживаемыеТипыВО.Добавить("СчитывательМагнитныхКарт");
		
		Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:
			|""%ОписаниеОшибки%"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	// Конец МеханизмВнешнегоОборудования
		
	Если ЗначениеЗаполнено(Объект.Контрагент) И ИнформированияПоДнюРожденияКонтрагента.Информировать Тогда
		ПоказатьПредупреждение(, ИнформированияПоДнюРожденияКонтрагента.СообщениеИнформирования, 15, "Информирование о дне рождения клиента");
	КонецЕсли;	
	ПроинициализироватьЭлементыВыбораВремени();				
	// Устанавливаем флаг для корректной работы механизма создания нового пациента. Без него крашится платформа!
	ПризнакСозданияНовогоПациента = Ложь;
	
	// Флаг для корректной работы изменения времени работы врача/ей;
	ПризнакИзмененияВремениВрачей = Ложь;
		
	ИзменитьЭлементДлительностиПриема(ПосчитатьНормуВремениТЧУслуги(), Неопределено, Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПередЗакрытием" формы.
//
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
		
	Если ЭтаФорма.Модифицированность Тогда
		СтандартнаяОбработка = Ложь; 	
		 		
		Если ОтветПользователяНаВопрос = Неопределено Тогда	
			
			Оповещение = Новый ОписаниеОповещения("ПоказатьПользователюВопросЗавершение_ПередЗакрытием", ЭтотОбъект, Неопределено);
			ПоказатьВопрос(Оповещение, "Данные были изменены! Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена);	
			Отказ = Истина;
			Возврат;
		Иначе
			
			Если ОтветПользователяНаВопрос = КодВозвратаДиалога.Да Тогда			
				
				Отказ = НЕ ПроверитьЗаполнение();
				ОтветПользователяНаВопрос = Неопределено;
				Если Отказ Тогда
					Возврат;
				Иначе 	
					ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
				КонецЕсли;
	
			ИначеЕсли ОтветПользователяНаВопрос = КодВозвратаДиалога.Отмена Тогда 
				
				ОтветПользователяНаВопрос = Неопределено;
				Отказ = Истина;
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе

		Оповестить("ОчиститьБуферЖурналаПредварительнойЗаписи");
		
	КонецЕсли;
		
	//
	// Если ЭтаФорма.Модифицированность Тогда

	//	СтандартнаяОбработка = Ложь;
	//	Ответ = Вопрос("Данные были изменены! Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена, , , "Вопрос");
	//	Если Ответ = КодВозвратаДиалога.Да Тогда			
	//		Отказ = НЕ ПроверитьЗаполнение();
	//		Если Отказ Тогда
	//			Возврат;
	//		Иначе 	
	//			ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	//		КонецЕсли;
	//	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда 
	//		Отказ = Истина;
	//		Возврат;

	//	КонецЕсли;

	// КонецЕсли; 
	
	// Если была создана родственная связь, а форму закрывают не сохраняя, удалем связь
	Если Ссылка_НовыйПациент <> Неопределено
		И ТипЗнч(Ссылка_НовыйПациент) = Тип("СправочникСсылка.Контрагенты")
		И ПациентЗаписан_НовыйПациент = Ложь Тогда
		
			УдалитьВсеРодственныеСвязиКонтрагентаНаСервере(Ссылка_НовыйПациент);
			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		ПроверитьТекущиеНапоминанияПоПосещениямСтоматология(Объект.Контрагент);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаОповещения"
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ВнешнееОборудование" И ВводДоступен() Тогда
		// Если ИмяСобытия = "TracksData" Тогда
		//	Результат = Неопределено;			
		//	// Если НЕ ДанныеКлиента = Неопределено Тогда				
		//	//	Объект.Контрагент   = ДанныеКлиента.Клиент;
		//	//	Объект.КартаКлиента = ДанныеКлиента.КартаКлиента;
		//	//	Модифицированность = Истина;
		//	// КонецЕсли;
		// КонецЕсли;
	ИначеЕсли ИмяСобытия = "ВыборНоменклатуры" И Источник = ЭтаФорма Тогда
		Если ПризнакДобавитьСтрокуПриПодборе Тогда
			Элементы.Услуги.СкопироватьСтроку();
		КонецЕсли;		
		Элементы.Услуги.ТекущиеДанные.Номенклатура = Параметр;
		УслугиНоменклатураПриИзменении(Неопределено);
		ПризнакДобавитьСтрокуПриПодборе = Истина;
	КонецЕсли;
	
	Если ИмяСобытия = "ПРОВЕДЕННО_ИЗМЕНЕНИЕ_ДОКУМЕНТА" Тогда
		ВывестиНезавершенныеНарядЗаказы();
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьСтруктурныеЕдиницыСотрудника" Тогда
		УстановитьПараметрыВыбораСотрудникаНаСервере();
	КонецЕсли;
	
	Если ИмяСобытия = "ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ" Тогда
		ЭтаФорма.Прочитать();
		ОбновитьВиджетСделки();
	КонецЕсли;  
	
	Если ИмяСобытия = "ОБНОВИТЬ_СТАТУС_И_ВИДЖЕТ_СДЕЛКИ" И Параметр = Объект.Сделка Тогда
		ЭтаФорма.Прочитать();		
		ОбновитьВиджетСделки(, , Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик перед записью данных формы.
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	УстановитьОбязательныеПоля();
	
	// Если создаем нового пациента то проверяем поля нового пациента на заполнение
	Если ПризнакСозданияНовогоПациента = Истина Тогда
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект.Фамилия_НовыйПациент) И Не ЗначениеЗаполнено(ЭтотОбъект.Имя_НовыйПациент)
			И Не ЗначениеЗаполнено(ЭтотОбъект.Отчество_НовыйПациент) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Невозможно создать нового пациента. Не заполнено наименование!",,,, Отказ);
			Возврат;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(Родитель_НовыйПациент) Тогда
			
			ПризнакСозданияНовогоПациента = Истина;
			Ссылка_НовыйПациент = ?(Ссылка_НовыйПациент <> Неопределено И ЗначениеЗаполнено(Ссылка_НовыйПациент), Ссылка_НовыйПациент, ПолучитьСсылкуНаНовогоПациента());
			
			// Определяем куда записать нового пациента
			МассивГруппКлиентов = ПолучитьГруппуНовогоПациента();
			
			Если Не ЗначениеЗаполнено(МассивГруппКлиентов) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют группы для создания пациента",,,, Отказ);
				Возврат;
			Иначе
				Родитель_НовыйПациент = МассивГруппКлиентов[0];
			КонецЕсли;
			
		КонецЕсли;
		// Если создаем нового пациента 
		Если Элементы.Контрагент.АвтоОтметкаНезаполненного = Истина Тогда
			Элементы.Контрагент.АвтоОтметкаНезаполненного = Ложь;
		КонецЕсли;
				
	КонецЕсли; 
	
	// Проверяем заполнение обязательных полей 	
	Для Каждого ЭлементФормы Из Элементы Цикл
		Если ТипЗнч(ЭлементФормы) = Тип("ПолеФормы")
			И ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода
			И ЭлементФормы.АвтоОтметкаНезаполненного = Истина Тогда
			
			ИмяЭлемента = ЭлементФормы.Заголовок;
			Если ЭлементФормы.ТекстРедактирования = "" Тогда
				
				Если ЭлементФормы.Имя = "Контрагент" Тогда
					
					ИмяЭлемента = НСтр("ru = 'Пациент'; en = 'Patient'");
					
				ИначеЕсли ЭлементФормы.Имя = "УслугиПричинаЗаписиПолем" Тогда
					
					ИмяЭлемента = НСтр("ru = 'Причина записи'; en = 'Reason for entry'");
					
				ИначеЕсли ЭлементФормы.Имя = "УслугиСотрудникПолем" Тогда	
					
					ИмяЭлемента = НСтр("ru = 'Врач'; en = 'Doctor'");
					
				ИначеЕсли ЭлементФормы.Имя = "УслугиПомещениеПолем" Тогда
					
					ИмяЭлемента = НСтр("ru = 'Кабинет'; en = 'Cabinet'");
					
				Иначе
					Если ЗначениеЗаполнено(ЭлементФормы.Заголовок) Тогда
						ИмяЭлемента = ЭлементФормы.Заголовок;
					Иначе
						ИмяЭлемента = ЭлементФормы.Имя;	
					КонецЕсли;
				КонецЕсли;
				
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, ЭлементФормы.Имя) И ЗначениеЗаполнено(Объект[ЭлементФормы.Имя]) Тогда 					
					Продолжить;	
				КонецЕсли;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru='Не заполнено поле %1!';en='Not is filled field %1!'"), ИмяЭлемента));
				Отказ = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Проверка на работу врача в указанное время
	Если ПризнакИзмененияВремениВрачей = Ложь Тогда	
		НеобходимВопрос = Ложь;
		НесколькоВрачейВПриеме = ВернутьКонстантуНесколькоВрачейВОдномПриеме();
		
		Если НЕ НесколькоВрачейВПриеме ИЛИ (НесколькоВрачейВПриеме И Объект.Услуги.Количество() <= 2) Тогда
			// Делаем время рабочим для текущего врача
		
			ВремяРабочее = ПроверитьВхождениеИнтервалаВРабочееВремяСотрудника(Объект.Услуги[0].ДатаНачала,Объект.Услуги[0].ДатаНачала,Объект.Услуги[0].ДатаОкончания,Объект.Услуги[0].Сотрудник,Объект.СтруктурнаяЕдиница);	 			
			Если НЕ ВремяРабочее И ЗначениеЗаполнено(Объект.Услуги[0].Сотрудник) Тогда
				
				НеобходимВопрос = Истина;
				УслугиКоличествоСтрок = Объект.Услуги.Количество();	
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("ВремяНачала"				, Объект.Услуги[0].ДатаНачала);
				ДополнительныеПараметры.Вставить("ВремяОкончания"			, Объект.Услуги[УслугиКоличествоСтрок-1].ДатаОкончания);
				ДополнительныеПараметры.Вставить("Сотрудник"				, Объект.Услуги[0].Сотрудник);
				ДополнительныеПараметры.Вставить("НесколькоВрачейВПриеме"	, Ложь); // Если 1 строка в ТЧ, но НесколькоВрачей = Истина, то всеравно ставим на Ложь.
				
				// Формируем вопрос для сообщения:
				Вопрос = "Выбранное время не является рабочим для сотрудника "+Объект.Услуги[0].Сотрудник+". Отметить выбранный период рабочим и продолжить?";
			КонецЕсли;
		Иначе
			ТаблицаУслуги = Объект.Услуги;
			МассивВремениДляИзменения = ИзменениеРабочегоВремениДляНесколькихВрачей(ТаблицаУслуги);
			
			// Если не нужно изменять время, не изменяем его
			Если МассивВремениДляИзменения.Количество() <> 0 Тогда 
				НеобходимВопрос = Истина;
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("ДополнительныеПараметры", МассивВремениДляИзменения);
		   		ДополнительныеПараметры.Вставить("НесколькоВрачейВПриеме"	, Истина);
				
				// Формируем вопрос для сообщения:
				ЭлементСообщения = "";
				ИтераторМассив = 0;
				Для Каждого ЭлементСообщенияИзМассива Из МассивВремениДляИзменения Цикл
					ЭлементСообщения = ЭлементСообщения+"с "+Формат(ЭлементСообщенияИзМассива.ВремяНачала,"ДЛФ=T")+" по "+Формат(ЭлементСообщенияИзМассива.ВремяОкончания,"ДЛФ=T")+" для сотрудника "+ЭлементСообщенияИзМассива.ФИО+?(ИтераторМассив = МассивВремениДляИзменения.ВГраница(),". ",", ")  ;
					ИтераторМассив = ИтераторМассив + 1;	
				КонецЦикла;
			
				Вопрос = "Выбранное время не является рабочим "+ЭлементСообщения+"Отметить выбранный период рабочим и продолжить?";
			КонецЕсли;
		КонецЕсли;
		
		Если НеобходимВопрос Тогда
			ДополнительныеПараметры.Вставить("СтруктурнаяЕдиница"		, Объект.СтруктурнаяЕдиница);
			Оповещение = Новый ОписаниеОповещения("ИзменениеРабочегоВремениПриРедактированииПриема", ЭтотОбъект, ДополнительныеПараметры);
			ПоказатьВопрос(Оповещение, Вопрос, РежимДиалогаВопрос.ДаНет);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ВидСделки = ПолучитьВидСделкиДляГенерации(Объект.Ссылка, Объект.Сделка, ЭтаФорма.ТекущаяСделка, ТаблицаДоступныхВидовСделок);
	Если ЗначениеЗаполнено(ВидСделки) И ЗначениеЗаполнено(Объект.Контрагент) И НЕ ЗначениеЗаполнено(ЭтотОбъект.КаналПривлечения) Тогда
		ОбращениеПациента = Неопределено;
		Если ПервичнаяСделкаБезОбращения(Объект.СтруктурнаяЕдиница, ВидСделки, Объект.Контрагент, , ОбращениеПациента) Тогда
			// Спрашиваем канал привлечения
			ОповещениеВыбораКаналаПривлечения = Новый ОписаниеОповещения("ПослеВыбораКаналаПривлечения", ЭтотОбъект, Новый Структура("ФормированиеПриема", ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗаписи, "ФормированиеПриема", Ложь)));
			ОткрытьФорму("Справочник.КаналыПривлечения.ФормаВыбора", , ЭтотОбъект, , , ,ОповещениеВыбораКаналаПривлечения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			Отказ = Истина;
			Возврат;
		ИначеЕсли ЗначениеЗаполнено(ОбращениеПациента) Тогда 
			ПараметрыЗаписи.Вставить("ЗаявкаСинхронизации", ОбращениеПациента);
		КонецЕсли;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Контрагент) И НЕ ЗначениеЗаполнено(ЭтотОбъект.КаналПривлечения) И ЗначениеЗаполнено(Ссылка_НовыйПациент) И НЕ СсылкаСуществует(Ссылка_НовыйПациент) Тогда	
		// Спрашиваем канал привлечения
		ОповещениеВыбораКаналаПривлечения = Новый ОписаниеОповещения("ПослеВыбораКаналаПривлечения", ЭтотОбъект, Новый Структура("ФормированиеПриема", ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗаписи, "ФормированиеПриема", Ложь)));
		ОткрытьФорму("Справочник.КаналыПривлечения.ФормаВыбора", , ЭтотОбъект, , , ,ОповещениеВыбораКаналаПривлечения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Ссылка существует
//
// Параметры:
//  Ссылка_НовыйПациент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СсылкаСуществует(Ссылка_НовыйПациент)

	Возврат ОбщегоНазначения.СсылкаСуществует(Ссылка_НовыйПациент);	
	
КонецФункции

&НаКлиенте
// Процедура - После выбора канала привлечения
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПослеВыбораКаналаПривлечения(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт 

	Если ЗначениеЗаполнено(РезультатВыбора) Тогда 
		ЭтаФорма.КаналПривлечения = РезультатВыбора;
		Если ЭтаФорма.КаналПривлечения = ПредопределенноеЗначение("Справочник.КаналыПривлечения.ЧатСКлиентом") Тогда 
			ОповещениеВыбораМессенджера = Новый ОписаниеОповещения("ПослеВыбораМессенджера", ЭтотОбъект, ДополнительныеПараметры);
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("МножественныйВыбор"		, Ложь);
			ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе"		, Истина);
			ПараметрыОткрытия.Вставить("ВыборГруппИЭлементов"	, ГруппыИЭлементы.Элементы);
			ПараметрыОткрытия.Вставить("ВыборДляПервичнойСделки", Истина);
			ОткрытьФорму("Перечисление.Мессенджеры.ФормаВыбора", ПараметрыОткрытия, ЭтотОбъект, , , ,ОповещениеВыбораМессенджера, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			Возврат;
		ИначеЕсли ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ФормированиеПриема", Ложь) Тогда
			ВвестиПосещение(Неопределено); 
		Иначе
			Если ЭтаФорма.Записать(Новый Структура("РежимЗаписи, НеобходимаГенерацияЗаявки", РежимЗаписиДокумента.Проведение, Истина)) Тогда 
				Если ЭтаФорма.Открыта() Тогда 
					ЭтаФорма.Закрыть();          
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - После выбора мессенджера
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПослеВыбораМессенджера(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт 

	Если ЗначениеЗаполнено(РезультатВыбора) Тогда 
		ЭтаФорма.КаналПривлеченияЗначение = РезультатВыбора;
		Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ФормированиеПриема", Ложь) Тогда
			ВвестиПосещение(Неопределено); 
		Иначе
			Если ЭтаФорма.Записать(Новый Структура("РежимЗаписи, НеобходимаГенерацияЗаявки", РежимЗаписиДокумента.Проведение, Истина)) Тогда 
				Если ЭтаФорма.Открыта() Тогда
					ЭтаФорма.Закрыть();
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	Иначе 
		ЭтаФорма.КаналПривлечения = Неопределено;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПередЗаписьюНаСервере".
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	
	// Если ТекущийОбъект.Статус = Перечисления.СтатусыСобытия.НеПодтверждена Тогда
	//	ТекущийОбъект.Статус = Перечисления.СтатусыСобытия.Подтверждена;
	// КонецЕсли;
	
	Если Ссылка_НовыйПациент <> Неопределено И ЗначениеЗаполнено(Ссылка_НовыйПациент) Тогда	
		
		НовыйКлиент = Справочники.Контрагенты.СоздатьЭлемент();
		НовыйКлиент.УстановитьСсылкуНового(Ссылка_НовыйПациент);
		
	    НовыйКлиент.Фамилия				 = ЭтотОбъект.Фамилия_НовыйПациент;
	    НовыйКлиент.Имя					 = ЭтотОбъект.Имя_НовыйПациент;
	    НовыйКлиент.Отчество			 = ЭтотОбъект.Отчество_НовыйПациент;
		НовыйКлиент.ПолКлиента			 = ЭтотОбъект.Пол_НовыйПациент;
		НовыйКлиент.Родитель			 = ЭтотОбъект.Родитель_НовыйПациент;
		НовыйКлиент.ДатаРожденияКлиента	 = ЭтотОбъект.ДатаРождения_НовыйПациент;
		НовыйКлиент.ДатаРегистрации		 = ТекущаяДатаСеанса();
		НовыйКлиент.СтруктурнаяЕдиница	 = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
		НовыйКлиент.ЮрФизЛицо			 = Перечисления.ЮрФизЛицо.ФизЛицо;
		НовыйКлиент.ТипЗубнойФормулы	 = 2;
		НовыйКлиент.СотрудникРегистрации = ПараметрыСеанса.АвторизованныйПользователь;
		НовыйКлиент.ТипКонтрагента		 = Перечисления.ТипыКонтрагентов.Клиенты;
		
		Если ЗначениеЗаполнено(КонтактнаяИнформация[0].Представление) Тогда
			НоваяСтрокаКИ						 = НовыйКлиент.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Тип					 = КонтактнаяИнформация[0].Тип;
			НоваяСтрокаКИ.Вид					 = КонтактнаяИнформация[0].Вид;
			НоваяСтрокаКИ.Представление			 = КонтактнаяИнформация[0].Представление;
			НоваяСтрокаКИ.ЗначенияПолей			 = КонтактнаяИнформация[0].ЗначенияПолей;
			НоваяСтрокаКИ.Значение				 = КонтактнаяИнформация[0].Значение;
			НоваяСтрокаКИ.НеУчаствоватьВРассылке = Ложь;
			
			ОбъектКИ = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияВСтруктуруJSON(НоваяСтрокаКИ.Значение, НоваяСтрокаКИ.Тип);
			УправлениеКонтактнойИнформациейСлужебныйСтоматология.ЗаполнитьТехническиеПоляКонтактнойИнформации(НоваяСтрокаКИ, ОбъектКИ, НоваяСтрокаКИ.Тип);
		КонецЕсли;
		
		// Записываем нового пациента (если он еще не записан)
		Если ПациентЗаписан_НовыйПациент = Ложь Тогда
			Попытка
				
	            НовыйКлиент.Записать();
				ТекущийОбъект.Контрагент = НовыйКлиент.Ссылка;
				ПациентЗаписан_НовыйПациент = Истина;
				
				УправлениеИнтерфейсамиСервер.ОбновитьВиджетСделки(ЭтаФорма, ТекущийОбъект.Контрагент, ТекущийОбъект.Сделка);
				
				//// Пересоздаем родственную связь
				// РС_РодственныеСвязи = РегистрыСведений.РодственныеСвязи.СоздатьНаборЗаписей();
				// РС_РодственныеСвязи.Отбор.Контрагент.Установить(УнИдНовогоПациента);
				// РС_РодственныеСвязи.Прочитать();
				// Для Каждого РС_Запись Из РС_РодственныеСвязи Цикл
				//	РС_Запись.Контрагент = ТекущийОбъект.Контрагент;	
				// КонецЦикла;
				// РС_РодственныеСвязи.Записать(); 

				// РС_НовЗапись = РС_РодственныеСвязи.Добавить();
				// РС_НовЗапись.Контрагент = ТекущийОбъект.Контрагент;
				// РС_РодственныеСвязи.Записать(); 
				
	    	Исключение
	            ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
				ПациентЗаписан_НовыйПациент = Ложь;
				Отказ = Истина;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Если ДобавитьТелефонСуществующемуПациенту Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДобавитьТелефонСуществующемуПациенту", Телефон_НовыйПациент);		
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Сделка) Тогда
		ТекущийОбъект.Сделка = ЭтаФорма.ТекущаяСделка;
	КонецЕсли;
	
	// Прокидываем вид и этап генериуемой сделки
	Если ТекущийОбъект.Ссылка.Пустая() И НЕ ЗначениеЗаполнено(ТекущийОбъект.Сделка) Тогда 
		МассивВыбранныхДляГенерации = ТаблицаДоступныхВидовСделок.НайтиСтроки(Новый Структура("Выбран", Истина));
		Если МассивВыбранныхДляГенерации.Количество() > 0 Тогда 
			Если ЗначениеЗаполнено(МассивВыбранныхДляГенерации[0].ВидСделки) Тогда 
				ТекущийОбъект.ДополнительныеСвойства.Вставить("ВидСделкиГенерации", МассивВыбранныхДляГенерации[0].ВидСделки);
				МассивВыбранныхЭтапов = МассивВыбранныхДляГенерации[0].ТаблицаЭтапов.НайтиСтроки(Новый Структура("Выбран", Истина));
				Если МассивВыбранныхЭтапов.Количество() > 0 Тогда 
					Если ЗначениеЗаполнено(МассивВыбранныхЭтапов[0].Этап) Тогда 
						ТекущийОбъект.ДополнительныеСвойства.Вставить("ЭтапСделкиГенерации", МассивВыбранныхЭтапов[0].Этап);
					КонецЕсли;
				ИначеЕсли МассивВыбранныхДляГенерации[0].ТаблицаЭтапов.Количество() > 0 Тогда 
					ТекущийОбъект.ДополнительныеСвойства.Вставить("ЭтапСделкиГенерации", МассивВыбранныхДляГенерации[0].ТаблицаЭтапов[0].Этап);
				Иначе 	
					ТекущийОбъект.ДополнительныеСвойства.Вставить("ЭтапСделкиГенерации", Неопределено);
				КонецЕсли;
				ТекущийОбъект.ДополнительныеСвойства.Вставить("ОбновитьВиджетСделки", Истина);
				ОбращениеПациента = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗаписи, "ЗаявкаСинхронизации", Неопределено);
				Если ЗначениеЗаполнено(ОбращениеПациента) Тогда 
					ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗаявкаСинхронизации"			, ОбращениеПациента);
					ИнформацияОКаналеПривлечения = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ОбращениеПациента, "КаналПривлечения, КаналПривлеченияЗначение");
					ТекущийОбъект.ДополнительныеСвойства.Вставить("КаналПривлечения"			, ИнформацияОКаналеПривлечения.КаналПривлечения);
					ТекущийОбъект.ДополнительныеСвойства.Вставить("КаналПривлеченияЗначение"	, ИнформацияОКаналеПривлечения.КаналПривлеченияЗначение);										
				Иначе 
					ТекущийОбъект.ДополнительныеСвойства.Вставить("НеобходимаГенерацияЗаявки"	, ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗаписи, "НеобходимаГенерацияЗаявки", Ложь));
					ТекущийОбъект.ДополнительныеСвойства.Вставить("КаналПривлечения"			, ЭтотОбъект.КаналПривлечения);
					ТекущийОбъект.ДополнительныеСвойства.Вставить("КаналПривлеченияЗначение"	, ЭтотОбъект.КаналПривлеченияЗначение);					
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВнутреннийНомерСотрудника) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ВнутреннийНомерСотрудника", ВнутреннийНомерСотрудника);	
	КонецЕсли;
    Если ЗначениеЗаполнено(IDЗвонка) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("IDЗвонка", IDЗвонка);	
	КонецЕсли;
	Если ЗначениеЗаполнено(ТаблицаМеток) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ТаблицаМетокДляЗаписи", ТаблицаМеток.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПослеЗаписи.
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если Не НеОбновлятьРабочийСтол Тогда  
		Оповестить("ИзмененоСобытие", Объект.Ссылка);
	КонецЕсли;
	
	Если ЭтоНовыйДок Тогда 
		ОповеститьОЗаписиНового(Объект.Ссылка);
		Оповестить("ОбновитьИсториюВзаимодействияКонтрагента", Новый Структура("Пациент, Сделка, ТелефонДляСоздания", Объект.Контрагент, Объект.Сделка, Телефон_НовыйПациент));
		Если ЗначениеЗаполнено(Объект.Сделка) Тогда 
			Оповестить("ОБНОВИТЬ_СВЕДЕНИЯ_ПО_СДЕЛКАМ", Объект.Сделка);
		КонецЕсли;	
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ЗаявкаОснование"            , Неопределено);
		Оповестить("СозданиеСобытияСКонтрагентом", ПараметрыОткрытия); 
		
	КонецЕсли;	 
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик команды ПослеЗаписиНаСервере.
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьВидимостьЭлементов();
	
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ОбновитьВиджетСделки") Тогда 
		ОбновитьВиджетСделки();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Процедура - обработчик события ОбработкаПроверкиЗаполненияНаСервере формы.
//
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка на работу структурной единицы
	Если Объект.Услуги.Количество() > 0 Тогда
		ПериодРаботы = ОбщегоНазначенияСтоматология.ПолучитьВремяРаботыСтруктурнойЕдиницы(Объект.Услуги[0].ДатаНачала, Объект.СтруктурнаяЕдиница); 
		Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
			Если СтрокаТЧ.ДатаОкончания = НачалоДня(СтрокаТЧ.ДатаОкончания) Тогда 
				СтрокаТЧ.ДатаОкончания = СтрокаТЧ.ДатаОкончания - 1;
			КонецЕсли;						
			Если СтрокаТЧ.ДатаНачала < ПериодРаботы.ДатаНачала ИЛИ СтрокаТЧ.ДатаНачала >= ПериодРаботы.ДатаОкончания
				ИЛИ СтрокаТЧ.ДатаОкончания <= ПериодРаботы.ДатаНачала ИЛИ СтрокаТЧ.ДатаОкончания > ПериодРаботы.ДатаОкончания Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Строка " + СтрокаТЧ.НомерСтроки + ":Структурная единица не работает " + ПредставлениеПериода(СтрокаТЧ.ДатаНачала, СтрокаТЧ.ДатаОкончания) + "!");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
		

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработчик события ПередОкончаниемРедактирования таблицы значений ввода Услуги
//
Процедура УслугиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	
	Если ОтменаРедактирования <> Истина Тогда
		Отказ = Не ПроверитьВозможностьДобавленияЗаписи(ТекущаяСтрока, Истина);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении таблицы значений ввода Услуги, элемента НормаВремени.
//
Процедура УслугиНормаВремениПриИзменении(Элемент)
	
	Если Объект.Резерв Тогда 
		Объект.Услуги[0].ДатаОкончания = ДатаНачала + НормаВремени * 60;
		ДатаОкончания = ДатаНачала + НормаВремени * 60;
	Иначе 	
		ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
		ТекущаяСтрока.НормаВремени = НормаВремени;
		ТекущаяСтрока.ДатаОкончания = ТекущаяСтрока.ДатаНачала + ТекущаяСтрока.НормаВремени * 60;
		ДатаОкончания = ДатаНачала + НормаВремени * 60;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении таблицы значений Услуги, элемента Время.
//
Процедура УслугиВремяПриИзменении(Элемент)
	
	ЭтоВремяНачала = Найти(Элемент.Имя, "ДатаНачала") <> 0;
	ЭтоЭлементТаблицы = Найти(Элемент.Имя, "Полем") = 0;
	
	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
	ВремяНачала	   = ?(ЭтоЭлементТаблицы, ТекущаяСтрока.ДатаНачала, ДатаНачала);
	ВремяОкончания = ?(ЭтоЭлементТаблицы, ТекущаяСтрока.ДатаОкончания, ДатаОкончания);
	
	Если Элемент <> Элементы.УслугиДатаНачалаПолем Тогда
		НомерСтроки = ТекущаяСтрока.НомерСтроки;
	Иначе
		НомерСтроки = 0;
	КонецЕсли;
	    
		
	Если ЭтоВремяНачала Тогда
		
		Если (НомерСтроки = 1 и ВремяОкончания <= ВремяНачала) или (НомерСтроки > 1 и ВремяОкончания < ВремяНачала) Тогда
			ВремяНачала = Дата("00010101");
		КонецЕсли;
		
		ТекущаяСтрока.ДатаНачала = ВремяНачала;
		ДатаНачала = ВремяНачала;
		
	Иначе
		
		Если (НомерСтроки = 1 и ВремяОкончания < ВремяНачала) или (НомерСтроки > 1 и ВремяОкончания <= ВремяНачала) Тогда 
			ВремяОкончания = Дата("00010101");
		КонецЕсли;
		
		ТекущаяСтрока.ДатаОкончания = ВремяОкончания;
		ДатаОкончания = ВремяОкончания;
		
	КонецЕсли;
	
	ТекущаяСтрока.НормаВремени = (ТекущаяСтрока.ДатаОкончания - ТекущаяСтрока.ДатаНачала) / 60;
	НормаВремени = (ДатаОкончания - ДатаНачала) / 60;
		
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события НачалоВыбора Таблицы Услуги элемента Номенклатура.
//
Процедура УслугиНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПризнакДобавитьСтрокуПриПодборе = Ложь;
	СтандартнаяОбработка = Ложь;
	
	Сегмент = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизитаСотрудника(Элементы.Услуги.ТекущиеДанные.Сотрудник, Объект.СтруктурнаяЕдиница, "СегментыНоменклатуры");
	//мВидЦен = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизитаСотрудника(Элементы.Услуги.ТекущиеДанные.Сотрудник, Объект.СтруктурнаяЕдиница, "ВидЦен");
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("ТекущаяСтрока", Элементы.Услуги.ТекущиеДанные.Номенклатура);
	ПараметрыФормыВыбора.Вставить("ВидЦен", Объект.ВидЦен);
	ПараметрыФормыВыбора.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	ПараметрыФормыВыбора.Вставить("Дата", Объект.Дата); 
	
	Если ЗначениеЗаполнено(Сегмент) Тогда
		
		СтруктураПараметры     = Новый Структура();	
		МассивРазрешенныхТипов = Новый Массив;
		МассивРазрешенныхТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"));
		
		СтруктураПараметры.Вставить("ОтборМассивРазрешенныхТипов"       , МассивРазрешенныхТипов); 
		СтруктураПараметры.Вставить("Заголовок"                         , "Выберите услугу");	   
		СтруктураПараметры.Вставить("Сегмент"                           , Сегмент);
		
		ДопПараметры = Новый Структура("ПризнакДобавитьСтрокуПриПодборе, Элемент", ПризнакДобавитьСтрокуПриПодборе, Элемент);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораНоменклатурыИзФормПодбораИВыбора", ЭтотОбъект, ДопПараметры);
		ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаПодбораНоменклатуры", СтруктураПараметры,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе 
		ДопПараметры = Новый Структура("ПризнакДобавитьСтрокуПриПодборе, Элемент", ПризнакДобавитьСтрокуПриПодборе, Элемент);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораНоменклатурыИзФормПодбораИВыбора", ЭтотОбъект, ДопПараметры);
		ПараметрыФормыВыбора.Вставить("Отбор", Новый Структура("ТипНоменклатуры, ЭтоГруппа, ВПродаже", ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"), Ложь, Истина));
		ПараметрыФормыВыбора.Вставить("Цена", Истина); 	
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормыВыбора,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;    	

	ПризнакДобавитьСтрокуПриПодборе = Ложь;
	
КонецПроцедуры 

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора".
//
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораКонтрагента", ЭтотОбъект, Новый Структура("Элемент", Элемент));
	ПараметрыОткрытия = Новый Структура("ТекущаяСтрока, СтрокаПоиска", Объект.Контрагент, Элемент.ТекстРедактирования);	
    ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораКлиенты", ПараметрыОткрытия, ЭтаФорма,,,, Оповещение);

КонецПроцедуры  

&НаКлиенте
// Процедура, обработчик события "Создание" поля "Контрагент".
//
Процедура КонтрагентСоздание(Элемент, СтандартнаяОбработка)
	
	Если Элемент <> Неопределено Тогда
		ИскомыйКлиент = Элемент.ТекстРедактирования;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ИзменитьИнтерфейсФормыДляСозданияПациента();
	ЭтаФорма.ТекущийЭлемент = Элементы.Фамилия_НовыйПациент;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обрботчик события "ОбработкаВыбора".
//
Процедура КонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = "СоздатьНовогоКлиента" Тогда
		ИскомыйКлиент = Элемент.ТекстРедактирования;
		КонтрагентСоздание(Неопределено, Ложь);
		// ВыбранноеЗначение = Объект.Контрагент;
		
	ИначеЕсли ВыбранноеЗначение = "ПеренестиИскомогоКлиента" Тогда 
		Объект.Контрагент = Неопределено;
		Объект.Комментарий = ИскомыйКлиент;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "АвтоПодбор".
//
Процедура КонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Не ЗначениеЗаполнено(Текст);
	
	Если СтрДлина(Текст) >= 3 Тогда
				
		ДанныеВыбора = ОбщегоНазначенияСтоматология.НайтиКонтрагентовПоСтроке(Текст, 10, Истина, Истина);
		
	Иначе
		
		СписокКонтрагентов = Новый СписокЗначений;
		СписокКонтрагентов.Добавить(Неопределено, "Для поиска необходимо ввести 3 и более символа.");		
		ДанныеВыбора = СписокКонтрагентов;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ОкончаниеВводаТекста.
//
Процедура КонтрагентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ПризнакСозданияНовогоПациента Тогда
	
		СтандартнаяОбработка = Ложь;	
		ДанныеВыбора = ОбщегоНазначенияСтоматология.НайтиКонтрагентовПоСтроке(Текст, , Истина, Истина);
		
		// Без Флага крашится платформа, когда ФИО написали, но нажали в любое другое место. 
		// ПризнакСозданияНовогоПациента = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "Выбор".
//
Процедура УслугиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элемент.ПодчиненныеЭлементы.УслугиПризнакЗаблокированно И ТолькоПросмотр = Ложь Тогда
		Элемент.ТекущиеДанные.ПризнакЗаблокированно = 1 - Элемент.ТекущиеДанные.ПризнакЗаблокированно;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора".
//
Процедура УслугиПомещениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаТЧ = Объект.Услуги[0];
	
	ПараметрОткрытия = Новый Структура("РежимПодбора,ДатаНачала,ДатаОкончания, СтруктурнаяЕдиница, Сотрудник, ИспользоватьОграничениеПоРегистру,КоличествоПомещений", 
	"Помещение", СтрокаТЧ.ДатаНачала,СтрокаТЧ.ДатаОкончания, Объект.СтруктурнаяЕдиница, 
	СтрокаТЧ.Сотрудник, Истина, КоличествоПомещенийСотрудника(СтрокаТЧ.Сотрудник));
	
	ОткрытьФорму("Документ.Событие.Форма.ФормаПодбора", ПараметрОткрытия, ЭтотОбъект,,,,Новый ОписаниеОповещения("УслугиПомещениеНачалоВыбораЗавершение", ЭтотОбъект, СтрокаТЧ), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "УслугиПомещениеНачалоВыбораЗавершение".
//
Процедура УслугиПомещениеНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Параметры.Помещение = Результат.ВыбранноеЗначение;
		Если Результат.КорректировкаВремени <>-1 Тогда
			Параметры.ДатаНачала = Параметры.ДатаНачала + Результат.КорректировкаВремени;
			Параметры.ДатаОкончания = Параметры.ДатаОкончания + Результат.КорректировкаВремени;
		КонецЕсли;	 
	КонецЕсли;
	
	ОбновитьРеквизитыТаблицыУслуг();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "Нажатие".
//
Процедура ДекорацияНезавершенныйНарядЗаказНажатие(Элемент)	
	
	МассивНайденныхСтрок = ТаблицаНезавершенныхНарядЗаказов.НайтиСтроки(Новый Структура("СтрокаКлюч", СтрЗаменить(Элемент.Имя, "Декорация_НезавершенныйНарядЗаказ_", "")));
	Если МассивНайденныхСтрок.Количество() > 0 Тогда 
		ОткрытьФорму("Документ.НарядЗаказ.ФормаОбъекта", Новый Структура("Ключ", МассивНайденныхСтрок[0].НарядЗаказ), ЭтаФорма);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события НачалоВыбораИзСписка поля ввода ЕдиницаИзмерения.
//
Процедура ТЧУслугиДатаНачалаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Резерв Тогда
		
		МассивПериодов = Новый Массив;
	
		МассивПериодов.Добавить(ОбщегоНазначенияСтоматология.ПолучитьВремяРаботыСтруктурнойЕдиницы(Объект.Дата, Объект.СтруктурнаяЕдиница));
		СписокВеремени 		= ВернутьСписокВремени(МассивПериодов, Истина, ОпределнениеИнтервалаВремени(ИнтервалГрафика));		
		НачальноеЗначение 	= СписокВеремени.НайтиПоЗначению(ДатаНачала);		
		
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ТЧУслугиДатаНачалаПослеВыбораИзСписка", ЭтотОбъект, Новый Структура("Элемент, СтрокаВвода", Элемент, Объект.Услуги[0])), СписокВеремени, Элемент, НачальноеЗначение);
		
	Иначе 
		
		ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
		
		МассивПериодов = Новый Массив;
		МассивПериодов.Добавить(ОбщегоНазначенияСтоматология.ПолучитьВремяРаботыСтруктурнойЕдиницы(Объект.Дата, Объект.СтруктурнаяЕдиница));
		
		СписокВеремени 		= ВернутьСписокВремени(МассивПериодов, Истина, ОпределнениеИнтервалаВремени(ИнтервалГрафика));		
		НачальноеЗначение 	= СписокВеремени.НайтиПоЗначению(ТекущаяСтрока.ДатаНачала);		

		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ТЧУслугиДатаНачалаПослеВыбораИзСписка", ЭтотОбъект, Новый Структура("Элемент, СтрокаВвода", Элемент, ТекущаяСтрока)), СписокВеремени, Элемент, НачальноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - ТЧУслуги дата начала после выбора из списка
//
// Параметры:
//  ВыбранныйЭлемент		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ТЧУслугиДатаНачалаПослеВыбораИзСписка(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	СтрокаВвода = ДополнительныеПараметры.СтрокаВвода;          
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		СтрокаВвода.ДатаНачала = ВыбранныйЭлемент.Значение;
		ДатаНачала = ВыбранныйЭлемент.Значение;
		УслугиВремяПриИзменении(Элемент);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработчик запуска формы расшифровки планируемых оплат контрагента.
//
Процедура ДекорацияСуммаПланируемыхОплатНажатие(Элемент)

	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
		ОтборРасшифровки = Новый Соответствие;
		ОтборРасшифровки.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыОткрытия.Вставить("ОтборРасшифровки", ОтборРасшифровки);
		Вариант =  СсылкаВариантаОтчета("ПерейтиПланируемыеОплаты", "Основной");
		ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтаФорма, Вариант, ПараметрыОткрытия);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриНачалеРедактирования списка .ПлатежныйКалендарь
//
Процедура УслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока = Истина Тогда
		Если Объект.Услуги.Количество() >= 2 Тогда
			Элемент.ТекущиеДанные.Сотрудник 		= ?(Не ПризнакДобавитьСтрокуПриПодборе, Объект.Услуги[0].Сотрудник, Элемент.ТекущиеДанные.Сотрудник);
			Элемент.ТекущиеДанные.Помещение 		= Объект.Услуги[0].Помещение;
			Элемент.ТекущиеДанные.ПричинаЗаписи 	= Объект.Услуги[0].ПричинаЗаписи;
			Элемент.ТекущиеДанные.ДатаНачала 		= Объект.Услуги[Объект.Услуги.Количество() - 1 - 1].ДатаОкончания;
			Элемент.ТекущиеДанные.ДатаОкончания 	= Элемент.ТекущиеДанные.ДатаНачала;// + 15 * 60;
			Элемент.ТекущиеДанные.НормаВремени 		= (Элемент.ТекущиеДанные.ДатаОкончания - Элемент.ТекущиеДанные.ДатаНачала) / 60;
			
			ДатаОкончания = Элемент.ТекущиеДанные.ДатаНачала + 15 * 60;

		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеУдаления".
//
Процедура УслугиПослеУдаления(Элемент)
	
	УслугиПослеУдаленияНаСервере();

КонецПроцедуры

&НаКлиенте
// Обработчик события "ОбработкаВыбора".
//
Процедура СтатусОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗапретитьВыбранноеЗначение(ВыбранноеЗначение) Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(,"Установка данного статуса производится автоматически.
								|Для открытия либо завершения уже открытого приёма нажмите на кнопку "+Символ(34)+"Приём"+Символ(34));
		// ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Установка данного статуса производится автоматически. Для открытия либо завершения уже открытого приёма нажмите на кнопку "+Символ(34)+"Приём"+Символ(34));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении." 
//
Процедура УслугиНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("СтруктурнаяЕдиница",	Объект.СтруктурнаяЕдиница);
	СтруктураДанные.Вставить("ДатаОбработки",		Объект.Дата);
	СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);
	СтруктураДанные.Вставить("Сотрудник", 			СтрокаТабличнойЧасти.Сотрудник);
	СтруктураДанные.Вставить("Номенклатура", 		СтрокаТабличнойЧасти.Номенклатура);
	
	СтруктураДанные = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
	
	НормаВремениНоменклатры = ВернутьНормыВремениУслуги(СтрокаТабличнойЧасти.Номенклатура);
	Если (ЗначениеЗаполнено(НормаВремениНоменклатры) ИЛИ НормаВремениНоменклатры = 0) И НормаВремениНоменклатры <> СтрокаТабличнойЧасти.НормаВремени Тогда 
		
		Если ОтветПользователяНаВопрос = Неопределено Тогда
			
			ПараметрыОповещения = Новый Структура("Элемент, ПроцедураВозврата", Элемент, "УслугиНоменклатураПриИзменении");
			Оповещение = Новый ОписаниеОповещения("ПоказатьПользователюВопросЗавершение_ЗапасыНоменклатураПриИзменении", ЭтотОбъект, ПараметрыОповещения);
			ПоказатьВопрос(Оповещение, "Норма времени по услуге не соответствует выбранному значению. Изменить?", РежимДиалогаВопрос.ДаНет);
			Возврат;
			
		ИначеЕсли ОтветПользователяНаВопрос = КодВозвратаДиалога.Да Тогда
			
			СтрокаТабличнойЧасти.ДатаОкончания = СтрокаТабличнойЧасти.ДатаНачала + НормаВремениНоменклатры * 60;
			ДатаОкончания = СтрокаТабличнойЧасти.ДатаНачала + НормаВремениНоменклатры * 60;
			СтрокаТабличнойЧасти.НормаВремени = НормаВремениНоменклатры;
			НормаВремени = НормаВремениНоменклатры;

		КонецЕсли;
		ОтветПользователяНаВопрос = Неопределено;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ПриИзменении.
//
Процедура УслугиСотрудникПриИзменении(Элемент)
	
	// СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	
	СтрокаТабличнойЧасти = Объект.Услуги[0];
	
	// Если ПроверитьПомещениеНаСоответствиеСотруднику(Элементы.Услуги.ТекущиеДанные.Сотрудник, Элементы.Услуги.ТекущиеДанные.Помещение, Объект.СтруктурнаяЕдиница) = Ложь Тогда
	СтрокаТабличнойЧасти.Помещение = ПолучитьПомещениеСотрудникаПоУмолчанию(СтрокаТабличнойЧасти.Сотрудник, Объект.СтруктурнаяЕдиница);
	// КонецЕсли;
	
	Объект.ВидЦен = ВернутьВидЦены(Объект.ПолисМедСтрахования, Объект.Услуги[0].Сотрудник, Объект.СтруктурнаяЕдиница); 
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("СтруктурнаяЕдиница",	Объект.СтруктурнаяЕдиница);
	СтруктураДанные.Вставить("ДатаОбработки",		Объект.Дата);
	СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);
	СтруктураДанные.Вставить("Сотрудник", 			СтрокаТабличнойЧасти.Сотрудник);
	СтруктураДанные.Вставить("Номенклатура", 		СтрокаТабличнойЧасти.Номенклатура);
	
	СтруктураДанные = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;	
	ОбновитьДанныеНаСервере(СтрокаТабличнойЧасти.Сотрудник);	
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события НачалоВыбора.
//
Процедура УслугиСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаТЧ = Объект.Услуги[0];
	
	ПараметрОткрытия = Новый Структура("РежимПодбора,ДатаНачала,ДатаОкончания, СтруктурнаяЕдиница, Сотрудник, ИспользоватьОграничениеПоРегистру", 
	"Сотрудник",СтрокаТЧ.ДатаНачала,СтрокаТЧ.ДатаОкончания, Объект.СтруктурнаяЕдиница, СтрокаТЧ.Сотрудник, Истина);
	
	ОткрытьФорму("Документ.Событие.Форма.ФормаПодбора", ПараметрОткрытия,,,,,Новый ОписаниеОповещения("УслугиСотрудникНачалоВыбораЗавершение", ЭтотОбъект, СтрокаТЧ), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Услуги сотрудник полем очистка
//
// Параметры:
//  Элемент				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура УслугиСотрудникПолемОчистка(Элемент, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Сделка) И НЕ Объект.Ссылка.Пустая() Тогда 
		СтандартнаяОбработка = Ложь;
		//ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выбранный врач не соответствует врачу, указанному в сделке!'"), , "Объект.Услуги[0].Сотрудник");
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Обновить данные
//
&НаСервере
Процедура ОбновитьДанныеНаСервере(Сотрудник)
	
	ОбновитьВиджетСделки(); 
		
КонецПроцедуры

&НаКлиенте
// Процедура - Услуги сотрудник полем обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура УслугиСотрудникПолемОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//Если ЗначениеЗаполнено(ВыбранноеЗначение) И ЗначениеЗаполнено(Объект.Сделка) И НЕ Объект.Ссылка.Пустая() Тогда 
	//	Если НЕ ВрачСоответствуетСделке(ВыбранноеЗначение, Объект.Сделка) Тогда 
	//		СтандартнаяОбработка = Ложь;
	//		ВыбранноеЗначение = Объект.Услуги[0].Сотрудник;
	//		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выбранный врач не соответствует врачу, указанному в сделке!'"), , "Объект.Услуги[0].Сотрудник");
	//		Возврат;
	//	КонецЕсли;	
	//КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Врач соответствует сделке
//
// Параметры:
//  Врач	 - 	 - 
//  Сделка	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВрачСоответствуетСделке(Врач, Сделка)
	
	Возврат ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Сделка, "Врач") = Врач;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поля "Контрагент".
//
Процедура КонтрагентПриИзменении(Элемент)
	
	// Это поле уже скрыто. Без этого крашится платформа.
	Если НЕ Элементы.ГруппаКонтрагента.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	КонтрагентПриИзмененииСервер();
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		
		ПроверитьТекущиеНапоминанияПоПосещениямСтоматология(Объект.Контрагент);
		
		Результат = ПроверитьНеобходимостьИнформированияПоДнюРожденияКонтрагента(Объект.Контрагент);
		Если Результат.Информировать = Истина Тогда
			ПоказатьПредупреждение(, Результат.СообщениеИнформирования, 15, "Информирование о дне рождения клиента");
		КонецЕсли;
		
	КонецЕсли;
	
	// После ввода ФИО клиента делаем активным поле "Комментарий"
	ЭтаФорма.ТекущийЭлемент = Элементы.Комментарий;
	
	#Если не ВебКлиент Тогда
		Системнаяинформация = Новый Системнаяинформация;
		Если Системнаяинформация.ТипПлатформы = ТипПлатформы.Windows_x86 Или Системнаяинформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда 	
			WSHShell                = Новый COMОбъект("WScript.Shell");
			WSHShell.SendKeys("{END}");
		КонецЕсли;
	#Конецесли

	//// Выводим комментарий из карточки клиента в подсказку
	//КомментарийКонтрагента = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.Контрагент, "Комментарий");
	//Если ЗначениеЗаполнено(Объект.Контрагент) И ЗначениеЗаполнено(КомментарийКонтрагента) Тогда 
	//	Элементы.КонтрагентРасширеннаяПодсказка.Заголовок = КомментарийКонтрагента;	
	//	Элементы.Контрагент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	//Иначе 
	//	Элементы.Контрагент.ОтображениеПодсказки = ОтображениеПодсказки.Авто;
	//КонецЕсли;
	
	//МассивРодителей = Новый Массив();
	//МассивРодителей.Добавить("ГруппаДолгиКонтрагентаСуществующие");
	//МассивРодителей.Добавить("ГруппаБудущиеСобытияКлиента");
	//ОтображениеДополнительнойИнформации(МассивРодителей);
	
КонецПроцедуры

&НаСервере
// Процедура - Отображение дополнительной информации
//
Процедура ОтображениеДополнительнойИнформации(МассивРодителей)
	
	УправлениеСвойствамиСтоматология.ОтображениеДополнительнойИнформации(ЭтаФорма, Объект.Контрагент, МассивРодителей);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик нажатия на декорацию с долгом
//
Процедура Подключаемый_ДекорацияФормы_Представление_Нажатие(Элемент) // Команда
	
	УправлениеСвойствамиКлиентСтоматология.ДействиеДополнительнойИнформацииНажатие(ЭтаФорма, ТекущийЭлемент); // Элемент
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НадписьНажатие".
//
Процедура СтруктурнаяЕдиницаНадписьНажатие(Элемент)
   
    СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЭтоПользователь", Истина);
    СтруктураПараметров.Вставить("Ссылка", ОбщегоНазначенияСтоматология.ДоступныеСтруктурныеЕдиницы()); 
	СтруктураПараметров.Вставить("ВидСравненияКомпоновкиДанных", ВидСравненияКомпоновкиДанных.ВСписке);
	ОткрытьФорму("Справочник.СтруктурныеЕдиницы.ФормаВыбора", СтруктураПараметров,,,,,Новый ОписаниеОповещения("СтруктурнаяЕдиницаНадписьНажатиеЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события элемента "ПриИзменении".
//
Процедура УслугиПричинаЗаписиПолемПриИзменении(Элемент)
	
	Если Объект.Услуги.Количество() = 1 Тогда
		ПредыдущаяНормаВремени = Объект.Услуги[0].НормаВремени
	КонецЕсли;
	
	УстановитьНормуВремени();
	
	Если Объект.Услуги.Количество() = 1 Тогда
		
		// НормаВремениПричины = Объект.Услуги[0].ПричинаЗаписи.НормаВремени;
	
		// Выделим нужную ячейку длительности
		ИзменитьЭлементДлительностиПриема(Объект.Услуги[0].НормаВремени, ПредыдущаяНормаВремени);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик открытия формы редактирования номера телефона
//
Процедура ПредставлениеКИ_0НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ПредставлениеКИНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Открыть перенесенную запись
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОткрытьПеренесеннуюЗапись(Команда)
	
	Если ЗначениеЗаполнено(Объект.ПеренесённаяПредварительнаяЗапись) Тогда 
		ПоказатьЗначение(, Объект.ПеренесённаяПредварительнаяЗапись);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик команды вызывает форму настройки и редактирования цен.
//
Процедура РедактироватьЦены(Команда)
	
	// 1. Формируем структуру параметров для заполнения формы "Цены и Валюта".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидЦен", 	  			Объект.ВидЦен);
	СтруктураПараметров.Вставить("ПерезаполнитьЦены",	Ложь);
	
	// 2. Открвыаем форму "Цены и Валюта".
	ОткрытьФорму("ОбщаяФорма.ФормаЦены", СтруктураПараметров,,,,, Новый ОписаниеОповещения("РедактироватьЦеныЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте  
// Процедура - Редактировать цены завершение
//
// Параметры:
//  СтруктураЦены			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура РедактироватьЦеныЗавершение(СтруктураЦены, ДополнительныеПараметры) Экспорт
	
	// 3. Перезаполняем табличную часть "Запасы" если были внесены изменения в форме "Цены и Валюта".
	Если ТипЗнч(СтруктураЦены) = Тип("Структура") И СтруктураЦены.БылиВнесеныИзменения Тогда
		
		Объект.ВидЦен = СтруктураЦены.ВидЦен;
		
		// Пересчитываем цены по виду цен.					
		Если СтруктураЦены.ПерезаполнитьЦены Тогда
			
			СтруктураДанныеМассив = Новый Массив;
			
			Для Каждого СтрокаТабличнойЧасти Из Объект.Услуги Цикл 
				СтруктураДанные = Новый Структура();
				СтруктураДанные.Вставить("СтруктурнаяЕдиница",	Объект.СтруктурнаяЕдиница);
				СтруктураДанные.Вставить("ДатаОбработки",		Объект.Дата);
				СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);
				СтруктураДанные.Вставить("Сотрудник", 			СтрокаТабличнойЧасти.Сотрудник);
				СтруктураДанные.Вставить("Номенклатура", 		СтрокаТабличнойЧасти.Номенклатура);
				СтруктураДанныеМассив.Добавить(СтруктураДанные);
			КонецЦикла;
			
			ДобавитьЦеныКаждойЗаписиПакетом(СтруктураДанныеМассив);
			
			// Заполняем цены
			Для Каждого СтруктураДанные Из СтруктураДанныеМассив Цикл 
				РезультатПоиска = Объект.Услуги.НайтиСтроки(Новый Структура("Номенклатура, Сотрудник", СтруктураДанные.Номенклатура, СтруктураДанные.Сотрудник));
				Для каждого СтрокаРезультат Из РезультатПоиска Цикл
					СтрокаРезультат.Цена = СтруктураДанные.Цена;
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Сформируем надпись
	СтруктураНадписи = Новый Структура("ВидЦен", Объект.ВидЦен);
	Элементы.ЦеныИВалютаНадпись.Заголовок = СтроковыеФункцииКлиентСерверСтоматология.СформироватьНадписьЦеныИВалюта(СтруктураНадписи);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ПредставлениеВремяНачалаВизита".
//
Процедура ПредставлениеВремяНачалаВизита(Команда)
	
	Дата = Объект.Дата;
	ПараметрыФормы = Новый Структура("НачалоПериода, КонецПериода", Дата, Дата);	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПредставлениеВремяНачалаВизитаЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаДень", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды формы "ОткрытьНастройкаОбязательныеПоля".
//
Процедура ОткрытьНастройкаОбязательныеПоля(Команда)
	
	ОткрытьФорму("Документ.Событие.Форма.ФормаНастройкаОбязательныеПоля");
    УстановитьОбязательныеПоля();
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
// Команда, обработчик установки цвета.
//
Процедура ЦветРезерва(Команда)
	
	ДиалогЦвета = Новый ДиалогВыбораЦвета();
	
	#Если Не ВебКлиент Тогда
		ДиалогЦвета.Цвет = Элементы.УстановкаЦвет.ЦветФона;
	#КонецЕсли
	
	ДиалогЦвета.Показать(Новый ОписаниеОповещения("ЦветРезерваЗавершение", ЭтотОбъект));	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Цвет резерва завершение
//
// Параметры:
//  Цвет					 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ЦветРезерваЗавершение(Цвет, ДополнительныеПараметры) Экспорт
	
	Если Цвет <> Неопределено Тогда
		ИзменитьЦветФонаРезерва(Цвет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды ОтменитьСобытие.
//
Процедура КомандаОтменитьСобытие(Команда)
	
	Если Модифицированность = Истина Тогда
	// Если Вопрос("Событие было модифицировано, перед отменой события все изменения сохраняться.", РежимДиалогаВопрос.ОКОтмена) = КодВозвратаДиалога.ОК Тогда
		Если ОтветПользователяНаВопрос = Неопределено Тогда				
		
			Оповещение = Новый ОписаниеОповещения("ПоказатьПользователюВопросЗавершение_КомандаОтменитьСобытие", ЭтотОбъект, Неопределено);
			ПоказатьВопрос(Оповещение, "Событие было модифицировано, перед отменой события все изменения сохраняться.", РежимДиалогаВопрос.ОКОтмена);
			Возврат;
			
		ИначеЕсли ОтветПользователяНаВопрос = КодВозвратаДиалога.ОК Тогда	
			ОтветПользователяНаВопрос = Неопределено;
			Записать();
		Иначе
			ОтветПользователяНаВопрос = Неопределено;
			Возврат;			
		КонецЕсли;
	
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСтоматология.ОтменитьСобытие(Объект.Ссылка,, Новый ОписаниеОповещения("КомандаОтменитьСобытиеЗавершение", ЭтотОбъект));
			
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды ВвестиПосещение.
//
Процедура ВвестиПосещение(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		НеОбновлятьРабочийСтол = Истина;
		
		Попытка
			Записать(Новый Структура("РежимЗаписи, ФормированиеПриема, НеобходимаГенерацияЗаявки", РежимЗаписиДокумента.Проведение, Истина, ЗначениеЗаполнено(ЭтотОбъект.КаналПривлечения)));
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());	
		КонецПопытки;
		
		НеОбновлятьРабочийСтол = Ложь;
	КонецЕсли;
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		
		СтруктураПараметры = Новый Структура("Основание", Объект.Ссылка);	
		ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиПосещениеЗавершение", ЭтаФорма);
		Если ЗначениеЗаполнено(Объект.СсылкаНаПрием) Тогда
			СтруктураПараметры.вставить("Ключ",Объект.СсылкаНаПрием);
			ОткрытьФорму("Документ.Прием.ФормаОбъекта", СтруктураПараметры,, Объект.Ссылка,,, 
				ОписаниеОповещения, РежимОткрытияОкнаФормы.Независимый);
		Иначе
			ОткрытьФорму("Документ.Прием.ФормаОбъекта", СтруктураПараметры,, Объект.Ссылка,,, 
				ОписаниеОповещения, РежимОткрытияОкнаФормы.Независимый); 
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды формы "КомандаРасшифровкаЗадолженности".
//
Процедура КомандаРасшифровкаЗадолженности(Команда)
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПараметрыФормы = Новый Структура("Контрагент",Объект.Контрагент);
		ОткрытьФорму("Отчет.ВзаиморасчетыПодробно.Форма.ФормаОтчета", ПараметрыФормы); 	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды формы "КомандаРасшифровкаОстатковНаЛС".
//
Процедура КомандаРасшифровкаОстатковНаЛС(Команда)
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
		ОтборРасшифровки = Новый Соответствие;
		ОтборРасшифровки.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыОткрытия.Вставить("ОтборРасшифровки", ОтборРасшифровки);
		Вариант =  СсылкаВариантаОтчета("ПерейтиЛицевыеСчета", "Основной");
		ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтаФорма, Вариант, ПараметрыОткрытия);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды подключаемый "ОтображатьМеткуПриНажатии".
//
Процедура Подключаемый_ОтображатьМеткуПриНажатии(Команда)
	
	КнопкаМетки = ТекущийЭлемент;
	ГруппаМетки = КнопкаМетки.Родитель;
	
 	ИндексМетки = Число(СтрЗаменить(КнопкаМетки.Имя, Лев(КнопкаМетки.Имя, Найти(КнопкаМетки.Имя, "_")), ""));
	ДанныеМетки = ЭтотОбъект.ТаблицаМеток.НайтиПоИдентификатору(ИндексМетки);
	
	Если ДанныеМетки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовоеЗначениеАктивности = Не ДанныеМетки.Активна;
	
	ДанныеМетки.Активна = НовоеЗначениеАктивности;
	
	КнопкаМетки.ЦветТекста	 = ?(НовоеЗначениеАктивности И ДанныеМетки.ЦветТекстаБелый, Новый Цвет(255, 255, 255), Новый Цвет(77, 77, 77));
	ГруппаМетки.ЦветФона	 = ?(НовоеЗначениеАктивности, ДанныеМетки.ЦветФона, Новый Цвет(255, 255, 255));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Открыть диалог с чат ботом
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОткрытьДиалогСЧатБотом(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ИдентификаторДиалога) ИЛИ НЕ ИспользуетсяРасширениеМессенджер Тогда 
		Возврат;
	КонецЕсли;

	ДанныеДиалога = ПолучитьДанныеДиалога(Объект.ИдентификаторДиалога);
	
	Если НЕ ЗначениеЗаполнено(ДанныеДиалога.ИдКлиента) ИЛИ НЕ ЗначениеЗаполнено(ДанныеДиалога.ВнешняяСистема) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось получить данные диалога!");
		Возврат;
	КонецЕсли;
	
	ДанныеКаналаСтруктура = Новый Структура;
	ДанныеКаналаСтруктура.Вставить("ИдКлиента"		, ДанныеДиалога.ИдКлиента);
	ДанныеКаналаСтруктура.Вставить("ВнешняяСистема"	, ДанныеДиалога.ВнешняяСистема);
	Если ДанныеДиалога.Свойство("ДанныеПоследнегоСообщения") Тогда 
		ДанныеКаналаСтруктура.Вставить("ИдСообщения", ДанныеДиалога.ДанныеПоследнегоСообщения.ИдСообщения);
	КонецЕсли;	
	
	ПараметрыОткрытия = Новый Структура("ДанныеКанала", ДанныеКаналаСтруктура);
	
	Оповестить("ОткрытьДиалог", ПараметрыОткрытия);
	ОткрытьФорму("Обработка.Мессенджер_Стоматология.Форма", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ПерейтиВЧат".
//
Процедура ПерейтиВЧат(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ДанныеВнешнихСистемМессенджера) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПерейтиВЧатЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(ОписаниеОповещения, ЭтотОбъект.ДанныеВнешнихСистемМессенджера, Элементы.ПерейтиВЧат);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения асинхронного события.
//
Процедура ПерейтиВЧатЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат.Значение.Идентификатор) Тогда
		ОбновлятьДанныеВнешнихСистем = Истина;
	КонецЕсли;
	
	ОписаниеОшибки = "";
	ИдСообщения = УстановитьОжиданиеСообщения(
		Результат.Значение.Идентификатор,
		Результат.Значение.ВнешняяСистема,
		ОписаниеОшибки,
		Объект.Контрагент,
		Результат.Значение.НомерМессенджера
	);
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		Возврат;
		
	КонецЕсли;
	
	Если ОбновлятьДанныеВнешнихСистем = Истина Тогда
		ЭтотОбъект.ДанныеВнешнихСистемМессенджера = ПолучитьДоступныеВнешниеСистемыМессенджера(Объект.Контрагент, Объект.СтруктурнаяЕдиница);
	КонецЕсли;
	
	ДанныеКанала = Новый Структура;
	ДанныеКанала.Вставить("ИдКлиента"		, Результат.Значение.Идентификатор);
	ДанныеКанала.Вставить("ВнешняяСистема"	, Результат.Значение.ВнешняяСистема);
	ДанныеКанала.Вставить("ИдСообщения"		, ИдСообщения);
	
	ПараметрыОткрытия = Новый Структура("ДанныеКанала", ДанныеКанала);
	
	Оповестить("ОткрытьДиалог", ПараметрыОткрытия);
	ОткрытьФорму("Обработка.Мессенджер_Стоматология.Форма", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, создает канал мессенджера.
//
Функция СоздатьКлиентаМессенджера(ВнешняяСистема, Контрагент, Знач НомерТелефона)
	
	НомерТелефона = УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(НомерТелефона);
	ИдКлиента = НомерТелефона + "@c.us";
	
	РегистрыСведений.КонтактыМессенджеров.ЗаписатьИдентификаторМессенджера(
		ИдКлиента,
		Контрагент,
		НомерТелефона,,
		ВнешняяСистема,
		Контрагент.Наименование
	);
	
	РегистрыСведений.ЖурналСообщений.ДобавитьЗапистьЖурналСообщений(
		ИдКлиента,
		Строка(Новый УникальныйИдентификатор()),,,
		"Создан клиент",
		Истина,
		Перечисления.Мессенджеры.whatsapp,
		Ложь,
		Дата(1, 1, 1),
		ВнешняяСистема,,,,,,,,,,
		Истина
	);
	
	Возврат ИдКлиента;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, создает сообщение с признаком ожидания сообщения.
//
Функция УстановитьОжиданиеСообщения(ИдКлиента, ВнешняяСистема, ОписаниеОшибки, Клиент = Неопределено, НомерТелефона = "")
	
	Если Не ЗначениеЗаполнено(ИдКлиента) Тогда
		ИдКлиента = СоздатьКлиентаМессенджера(ВнешняяСистема, Клиент, НомерТелефона);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдКлиента) Тогда
		ОписаниеОшибки = НСтр("ru = 'Не удалось создать контакт мессенджера.'; en = 'Failed to create messenger client.'");
		Возврат Неопределено;
	КонецЕсли;
	
	ИдСообщения = МессенджерСтоматология.ПолучитьИдОжидающегоСообщенияВМесенджер(ИдКлиента, ВнешняяСистема);
	
	Возврат ИдСообщения;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить данные диалога
//
// Параметры:
//  ИдентификаторДиалога - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеДиалога(ИдентификаторДиалога)

	Возврат РегистрыСведений.Диалоги.ПолучитьДанныеДиалога(ИдентификаторДиалога, , Истина);
	
КонецФункции

&НаКлиенте
// Процедура, обработчик команды ДобавитьИВыбратьКонтрагента.
//
Процедура ДобавитьИВыбратьКонтрагента(Команда)
			 
	ИзменитьИнтерфейсФормыДляСозданияПациента();		 
	ЭтаФорма.ТекущийЭлемент = Элементы.Фамилия_НовыйПациент;
	
	УстановитьВидимостьКнопокПереходаВМессенджер(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Изменить интерфейс формы для создания пациента
//
Процедура ИзменитьИнтерфейсФормыДляСозданияПациента() 

	ИскомыйКлиентКеш = ИскомыйКлиент; 
	ФИО = ОбщегоНазначенияКлиентСтоматология.ВернутьФИОКлиента(ИскомыйКлиент);			
	
	ИскомыйКлиент = ИскомыйКлиентКеш;
	
	ЭтаФорма.Фамилия_НовыйПациент = ?(ЗначениеЗаполнено(ФИО.Фамилия), ФИО.Фамилия, "");
	ЭтаФорма.Имя_НовыйПациент = ?(ЗначениеЗаполнено(ФИО.Имя), ФИО.Имя, "");
	ЭтаФорма.Отчество_НовыйПациент = ?(ЗначениеЗаполнено(ФИО.Отчество), ФИО.Отчество, "");
	
	Элементы.Группировка2НовыйПациент.Видимость = Истина;
	Если НЕ ЗначениеЗаполнено(Телефон_НовыйПациент) Тогда 
		Телефон_НовыйПациент = "";                           
	КонецЕсли;
	
	// Скрываем долги
	Элементы.ГруппаДолгиКонтрагента.Видимость = Ложь;
	
	// Очищаем сделки
	// УправлениеИнтерфейсамиСервер.ОчиститьГруппуВиджетСделки(ЭтаФорма);
	
	Если НЕ ПризнакСозданияНовогоПациента Тогда
		ПризнакСозданияНовогоПациента = Истина;
		Элементы.ГруппаКонтрагента.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "НайтиПациента"
//
Процедура НайтиПациента(Команда)
	
	ПризнакСозданияНовогоПациента = Ложь;
	Элементы.ГруппаКонтрагента.Видимость = Истина;
	Элементы.Группировка2НовыйПациент.Видимость = Ложь;
	ЭтаФорма.ТекущийЭлемент = Элементы.Контрагент;
	
	// Если пациент был найден, но нажали на кнопку создания пациент (а потом опять вернулись к поиску), возвращаем найденного обратно.
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		// Элементы.Контрагент.ТекстРедактирования = Строка(Объект.Контрагент);
		// УправлениеИнтерфейсамиСервер.ОбновитьВиджетСделки(ЭтаФорма, Объект.Контрагент, Объект.Сделка);
		КонтрагентПриИзменении(Элементы.Найти("Контрагент"));
		
		Если ЭтаФорма.ДолгиСуществующие.Количество() <> 0 Тогда
			Элементы.ГруппаДолгиКонтрагента.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый открыть предварительную запись.
//
Процедура Подключаемый_ОткрытьПредварительнуюЗапись(Команда)
	
	УправлениеСвойствамиКлиентСтоматология.ДействиеДополнительнойИнформацииНажатие(ЭтаФорма, ТекущийЭлемент);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧ_КИ_ПриИзменении()
	
	НоваяСтрокаКИ = КонтактнаяИнформация.Добавить();
	НоваяСтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	НоваяСтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКлиента;
	НоваяСтрокаКИ.Представление = Телефон_НовыйПациент;
	НоваяСтрокаКИ.НеУчаствоватьВРассылке = Ложь;
	НоваяСтрокаКИ.ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебныйВызовСервераСтоматология.КонтактнаяИнформацияXMLПоПредставлению(НоваяСтрокаКИ.Представление, НоваяСтрокаКИ.Вид);
	НоваяСтрокаКИ.Значение = УправлениеКонтактнойИнформациейСлужебныйВызовСервераСтоматология.КонтактнаяИнформацияПоПредставлению(НоваяСтрокаКИ.Представление, НоваяСтрокаКИ.Вид);	
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ПредставлениеКИ_0ПриИзменении" для контроля дублей в базе пациентов
//
Процедура ПредставлениеКИ_0ПриИзменении(Элемент)
	
	// Контроль дублей при создании нового пациента
	// УправлениеКонтактнойИнформациейКлиентСтоматология.ПредставлениеКИПриИзменении(ЭтаФорма, Элемент, Истина);
	// ПроверкаДублированияКлиентаКонтактнаяИнформация(ДанныеКИ, ТекстРедактирования)
	
	// Преобразовывать в нужный вид +7 () ... и т.д.
	
	КонтактнаяИнформация.Очистить();
	ЗаполнитьТЧ_КИ_ПриИзменении();
	
	Телефон_НовыйПациент = КонтактнаяИнформация[0].Представление;
	
	ПроверкаДублированияКлиентаКонтактнаяИнформация(Элемент.ТекстРедактирования)
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает ссылку нового контрагента.
//
Функция ПолучитьСсылкуНаНовогоПациента()
	
	Возврат(Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор))
		
КонецФункции

&НаКлиенте
// Процедура проверяет дублирование нового пациента по телефону.
//
Процедура ПроверкаДублированияКлиентаКонтактнаяИнформация(ТекстРедактирования) Экспорт
	
	ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
	
	МассивКлиентов = ПроверитьНаДублированиеКлиентаКИ(Объект.Ссылка, ТипКИ, ТекстРедактирования);
	
	Если ЗначениеЗаполнено(МассивКлиентов) Тогда
		
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Да		, НСтр("ru='Создать родственную связь';en='Yes'"));
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена	, НСтр("ru='Нет';en='Not'"));
		СписокКнопок.Добавить(КодВозвратаДиалога.Нет	, НСтр("ru='Использовать существующего';en='Open existing'"));
		
		ДанныеКИ = Неопределено;
		
		Оповещение = Новый ОписаниеОповещения("ПроверкаДублированияКлиентаКонтактнаяИнформацияОтвет", ЭтотОбъект, Новый Структура("МассивКлиентов, ДанныеКИ", МассивКлиентов, ДанныеКИ));
		ПоказатьВопрос(Оповещение, НСтр("ru='Пациент с такими данными уже существует. Продолжить?';en='Client with such data already exists. Continue?'"), СписокКнопок,);
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция проверяет на дубликат контрагента по контактной информации.
//
Функция ПроверитьНаДублированиеКлиентаКИ(Знач Ссылка, Знач ТипКИ, Знач ЗначениеЭлемента)
	
	Возврат Справочники.Контрагенты.ПроверитьНаДублированиеКлиентаКИ(Ссылка, ТипКИ, ЗначениеЭлемента);
	
КонецФункции

&НаКлиенте
// Процедура, обработчик завершения создания родственника.
//
Процедура ПослеСозданияРодственника(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		ЭтотОбъект.Телефон_НовыйПациент = "";
		Возврат;
	КонецЕсли;
	
	Объект.Контрагент = Результат;
	
	ПризнакСозданияНовогоПациента = Ложь;
	Элементы.ГруппаКонтрагента.Видимость = Истина;
	Элементы.Группировка2НовыйПациент.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения выбора дублирующего клиента.
//
Процедура ПроверкаДублированияКлиентаКонтактнаяИнформацияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		
		Объект.Контрагент = ДополнительныеПараметры;
		
		ПризнакСозданияНовогоПациента = Ложь;
		Элементы.ГруппаКонтрагента.Видимость = Истина;
		Элементы.Группировка2НовыйПациент.Видимость = Ложь;
		
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		
		ПараметрыСозданияРодственника = Новый Структура;
		ПараметрыСозданияРодственника.Вставить("ВыбранныйКлиент"	, ДополнительныеПараметры);
		ПараметрыСозданияРодственника.Вставить("Фамилия"			, ЭтотОбъект.Фамилия_НовыйПациент);
		ПараметрыСозданияРодственника.Вставить("Имя"				, ЭтотОбъект.Имя_НовыйПациент);
		ПараметрыСозданияРодственника.Вставить("Отчество"			, ЭтотОбъект.Отчество_НовыйПациент);
		ПараметрыСозданияРодственника.Вставить("НомерТелефона"		, ЭтотОбъект.Телефон_НовыйПациент);
		ПараметрыСозданияРодственника.Вставить("ПолНовогоКлиента"	, ЭтотОбъект.Пол_НовыйПациент);
		ПараметрыСозданияРодственника.Вставить("ДатаРождения"		, ЭтотОбъект.ДатаРождения_НовыйПациент);
		ПараметрыСозданияРодственника.Вставить("СозданиеИзСобытия"	, Истина);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСозданияРодственника", ЭтотОбъект); 
		
		ОткрытьФорму(
			"РегистрСведений.РодственныеСвязи.Форма.ФормаЗаписиБыстрая",
			ПараметрыСозданияРодственника,,,,,
			ОписаниеОповещения,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
		);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Проверка дублирования клиента контактная информация ответ
// Завершение немодального открытия окна "ПоказатьВопрос()" 
// Параметры:
//  РезультатВопроса - Ответ на вопрос
//  Параметры	     - Параметры вопроса 
//
Процедура ПроверкаДублированияКлиентаКонтактнаяИнформацияОтвет(РезультатВопроса, Параметры)  Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		ЭтотОбъект.Телефон_НовыйПациент = "";
		Возврат;
	КонецЕсли;
	
	Если Параметры.МассивКлиентов.Количество() > 1 Тогда
		
		ЗначениеОтбора	 = Новый Структура("Телефон", ЭтотОбъект.Телефон_НовыйПациент);
		ПараметрыОтбора	 = Новый Структура("Отбор"	, ЗначениеОтбора);	
		ПараметрыОтбора.Вставить("РежимОтображения", "Список");
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПациентаИзСпискаДублей", ЭтаФорма, РезультатВопроса);
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораКлиенты",ПараметрыОтбора,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат;
	Иначе
		ПроверкаДублированияКлиентаКонтактнаяИнформацияЗавершение(РезультатВопроса, Параметры.МассивКлиентов[0]);
		Возврат;
	КонецЕсли;
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		
		Объект.Контрагент = Параметры.МассивКлиентов[0];
		
		ПризнакСозданияНовогоПациента = Ложь;
		Элементы.ГруппаКонтрагента.Видимость = Истина;
		Элементы.Группировка2НовыйПациент.Видимость = Ложь;
		
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ПараметрыСозданияРодственника = Новый Структура;
		ПараметрыСозданияРодственника.Вставить("Фамилия"			, ЭтотОбъект.Фамилия_НовыйПациент);
		ПараметрыСозданияРодственника.Вставить("Имя"				, ЭтотОбъект.Имя_НовыйПациент);
		ПараметрыСозданияРодственника.Вставить("Отчество"			, ЭтотОбъект.Отчество_НовыйПациент);
		ПараметрыСозданияРодственника.Вставить("НомерТелефона"		, ЭтотОбъект.Телефон_НовыйПациент);
		ПараметрыСозданияРодственника.Вставить("ПолНовогоКлиента"	, ЭтотОбъект.Пол_НовыйПациент);
		ПараметрыСозданияРодственника.Вставить("ДатаРождения"		, ЭтотОбъект.ДатаРождения_НовыйПациент);
		ПараметрыСозданияРодственника.Вставить("СозданиеИзСобытия"	, Истина);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСозданияРодственника", ЭтотОбъект); 
		
		ОткрытьФорму(
			"РегистрСведений.РодственныеСвязи.Форма.ФормаЗаписиБыстрая",
			ПараметрыСозданияРодственника,,,,,
			ОписаниеОповещения,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
		);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ВыбратьПациентаИзСпискаДублей".
//
Процедура ВыбратьПациентаИзСпискаДублей(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ПроверкаДублированияКлиентаКонтактнаяИнформацияЗавершение(Параметры, Результат);
		
	Иначе
		
		ЭтотОбъект.Телефон_НовыйПациент = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, Обработчик события "СоздатьРодственнуюСвязь"
//
Процедура СоздатьРодственнуюСвязь(Результат, Параметры) Экспорт
	
	// Проверяем создана ли родственная связь
	Если Ссылка_НовыйПациент <> Неопределено И ЗначениеЗаполнено(Ссылка_НовыйПациент) Тогда
		
		РодственныеСвязи = ПоискРодственныхСвязейПоНовомуПациенту(Ссылка_НовыйПациент);
		
		Если РодственныеСвязи.Количество() >= 1 Тогда 	
			ПризнакСозданияНовогоПациента = Истина;	
		КонецЕсли;
		
		Телефон_НовыйПациент = "";
		
		// ЗДЕСЬ ДИЛЛЕМА!
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "Пол_НовыйПациентПриИзменении"
//
Процедура Пол_НовыйПациентПриИзменении(Элемент)
	
	Если ТипЗнч(ПризнакСозданияНовогоПациента) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		// Получим ссылку на нового пациента
		Если ЗначениеЗаполнено(ПризнакСозданияНовогоПациента) Тогда
			Ссылка_НовыйПациент = ?(Ссылка_НовыйПациент <> Неопределено И ЗначениеЗаполнено(Ссылка_НовыйПациент), Ссылка_НовыйПациент, ПолучитьСсылкуНаНовогоПациента());
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗначенияЗаполнения"		, Новый Структура("Родственник", ПризнакСозданияНовогоПациента)); 
		ПараметрыФормы.Вставить("ВернутьСтруктуруСвязи"		, Истина);
		ПараметрыФормы.Вставить("Контрагент"				, Ссылка_НовыйПациент);
        ПараметрыФормы.Вставить("ЭтоНовый"					, Истина);
		ПараметрыФормы.Вставить("ПолКонтрагента"			, Пол_НовыйПациент);

		ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьРодственнуюСвязь", ЭтотОбъект, ПараметрыФормы);
	    ОткрытьФорму("РегистрСведений.РодственныеСвязи.Форма.ФормаЗаписиБыстрая", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
						
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, обработчик команды "ПоискРодственныхСвязейПоНовомуПациенту" 
//
Функция ПоискРодственныхСвязейПоНовомуПациенту(СсылкаНаНовогоПациента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РодственныеСвязи.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрСведений.РодственныеСвязи КАК РодственныеСвязи
		|ГДЕ
		|	РодственныеСвязи.Контрагент = &СсылкаНаНовогоПациента";
	
	Запрос.УстановитьПараметр("СсылкаНаНовогоПациента", СсылкаНаНовогоПациента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НайденныеРодственныеСвязи = Новый Массив();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НайденныеРодственныеСвязи.Добавить(ВыборкаДетальныеЗаписи.Контрагент);	
	КонецЦикла;
	
	Возврат (НайденныеРодственныеСвязи);

	
КонецФункции

&НаСервереБезКонтекста
// Функция, обработчик команды "ОпределениеГруппыЗаписиНовогоПациента"
// 
Функция ПолучитьГруппуНовогоПациента()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ЭтоГруппа = ИСТИНА
	|	И Контрагенты.ПометкаУдаления = ЛОЖЬ
	|	И Контрагенты.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты)");
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик команды "ВыбратьСтруктурнуюЕдиницу".
//
Процедура ВыбратьСтруктурнуюЕдиницу(Команда)
	
    СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЭтоПользователь", Истина);
    СтруктураПараметров.Вставить("Ссылка", ПолучитьМассивСтруктурныхЕдиницСотрудника()); 
	СтруктураПараметров.Вставить("ВидСравненияКомпоновкиДанных", ВидСравненияКомпоновкиДанных.ВСписке);
	ОткрытьФорму("Справочник.СтруктурныеЕдиницы.ФормаВыбора", СтруктураПараметров,,,,,Новый ОписаниеОповещения("СтруктурнаяЕдиницаНадписьНажатиеЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Напомнить пациенту о будущих событиях.
//
Процедура НапомнитьПациентуОБудущихСобытиях(Команда)
	
	ПредставлениеСобытий = "";
	ЗапланированноеСобытие = Неопределено;
	Для Каждого БудущееСобытие Из ЭтаФорма.БудущиеСобытия Цикл
		ПредставлениеСобытий = ПредставлениеСобытий + Символы.ПС + Формат(БудущееСобытие.ДатаСобытия, "ДФ='дд ММММ ЧЧ:мм'") + ", врач " + БудущееСобытие.Сотрудник; 
		Если ЭтаФорма.БудущиеСобытия.Количество() = 1 Тогда
			ЗапланированноеСобытие = БудущееСобытие.Событие; 
		КонецЕсли;
	КонецЦикла;
	
	ПредставлениеКлиента = ПолучитьПредставлениеПациентаДляНапоминанияОБудущихСобытиях(Объект.Контрагент);	
	ТекстСообщения = ПредставлениеКлиента + ", ждем Вас!" + Символы.ПС + ПредставлениеСобытий;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыОткрытия.Вставить("МессенджерВключен", ЭтотОбъект.ИспользуетсяРасширениеМессенджер);
	ПараметрыОткрытия.Вставить("ТекстСообщенияSms", ТекстСообщения);   
	ПараметрыОткрытия.Вставить("ДокументОснование", ЗапланированноеСобытие);
		
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаОтправкиСообщения", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Записать на прием.
//
Процедура АктуальнаяПредварительнаяЗапись(Команда)
	
	Если ЗначениеЗаполнено(СсылкаНаСобытие) Тогда 
		ПоказатьЗначение(, СсылкаНаСобытие);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВиджетСделки

&НаКлиентеНаСервереБезКонтекста
// Функция - Получить вид сделки для генерации
//
// Параметры:
//  Запись						 - 	 - 
//  СделкаЗаписи				 - 	 - 
//  ТекущаяСделка				 - 	 - 
//  ТаблицаДоступныхВидовСделок	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьВидСделкиДляГенерации(Запись, СделкаЗаписи, ТекущаяСделка, ЗНАЧ ТаблицаДоступныхВидовСделок)
	
	Если Запись.Пустая() И НЕ ЗначениеЗаполнено(СделкаЗаписи) И НЕ ЗначениеЗаполнено(ТекущаяСделка) Тогда 
		МассивВыбранныхДляГенерации = ТаблицаДоступныхВидовСделок.НайтиСтроки(Новый Структура("Выбран", Истина));
		Если МассивВыбранныхДляГенерации.Количество() > 0 Тогда 
			Возврат МассивВыбранныхДляГенерации[0].ВидСделки;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Первичная сделка без обращения
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  ВидСделки			 - 	 - 
//  Контрагент			 - 	 - 
//  ДатаСделки			 - 	 - 
//  ЗаявкаКлиента		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПервичнаяСделкаБезОбращения(СтруктурнаяЕдиница, ВидСделки, Контрагент, ДатаСделки = Неопределено, ЗаявкаКлиента = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(ДатаСделки) Тогда 
		ДатаСделки = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ПризнакПервичнойСделки = Справочники.Сделки.ВернутьПризнакПервичногоПациента(, ВидСделки, Контрагент, ДатаСделки);
	Если ПризнакПервичнойСделки = Перечисления.СтатусыКонтрагентов.Первичный Тогда 
		ЗаявкаКлиента = Справочники.Заявки.ПолучитьЗаявкуКонтрагента(Контрагент, , СтруктурнаяЕдиница, Истина);
		Если НЕ ЗначениеЗаполнено(ЗаявкаКлиента) Тогда
			МассивНомеровТелефона = Справочники.Контрагенты.ПолучитьМассивНомеровТелефонаКонтрагента(Контрагент);
			ЗаявкаКлиента = Справочники.Заявки.ПолучитьЗаявкуПоНомеруТелефона(МассивНомеровТелефона, , СтруктурнаяЕдиница, Истина);	
		КонецЕсли;	
		Возврат НЕ ЗначениеЗаполнено(ЗаявкаКлиента); 
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции	

&НаСервере
// Процедура, ОбновитьВиджетСделки.
//
Процедура ОбновитьВиджетСделки(ОбновитьВиджетГенерации = Ложь, АктуализироватьДанные = Истина, ОбновитьСтатус = Ложь) Экспорт 
	// Процедура экспортная т.к. вызывается из расширения журнала записи.
	Если ОбновитьВиджетГенерации Тогда 
		УправлениеИнтерфейсамиСервер.ОбновитьВиджетВыбораВидаГенерируемойСделки(ЭтаФорма, Неопределено, Неопределено, АктуализироватьДанные);
	Иначе 
		УправлениеИнтерфейсамиСервер.ОбновитьВиджетСделки(ЭтаФорма, Объект.Контрагент, Объект.Сделка, АктуализироватьДанные);		
	КонецЕсли;
	Если ОбновитьСтатус Тогда 
		УстановитьСвойстваЭлементамПодтвержденияЗаписи();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик нажати динамического элемента виджета выбор вида сделки
//
// Параметры:
//  ИмяКоманды	 - 	 - 
//
Процедура ОбработчикНажатиДинамическогоЭлементаВиджетаВыборВидаСделки(Команда) Экспорт
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаВиджетаСделки(ЭтотОбъект, Команда);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		
		Врач = Неопределено;
		Если НЕ Объект.Услуги.Количество() = 0 Тогда 
			Врач = Объект.Услуги[0].Сотрудник;
		КонецЕсли;
		
		ВыбранныйВидСделки 	= Неопределено;
		ВыбранныйЭтап 		= Неопределено; 
		МассивСтрок = ТаблицаДоступныхВидовСделок.НайтиСтроки(Новый Структура("Выбран", Истина));
		Если МассивСтрок.Количество() > 0 Тогда 
			ВыбранныйВидСделки = МассивСтрок[0].ВидСделки;
			МассивСтрок = МассивСтрок[0].ТаблицаЭтапов.НайтиСтроки(Новый Структура("Выбран", Истина));
			Если МассивСтрок.Количество() > 0 Тогда 
				ВыбранныйЭтап = МассивСтрок[0].Этап;
			КонецЕсли;				
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Контрагент"					, Объект.Контрагент);
		ПараметрыФормы.Вставить("Врач"							, Врач);
		ПараметрыФормы.Вставить("ВыбратьВидГенерируемойСделки"	, Истина);
		ПараметрыФормы.Вставить("ВыбранныйВидСделки"			, ВыбранныйВидСделки);
		ПараметрыФормы.Вставить("ВыбранныйЭтап"					, ВыбранныйЭтап);
		                                                
		ОткрытьФорму("Справочник.Сделки.Форма.ФормаВиджета"
					, ПараметрыФормы
					, ЭтаФорма,,,
					, Новый ОписаниеОповещения("ВыборВидаГенерируемойСделки", ЭтотОбъект, Новый Структура("ВыбранныйВидСделки, ВыбранныйЭтап", ВыбранныйВидСделки, ВыбранныйЭтап))
					, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик нажати динамического элемента виджета выбор этап сделки
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОбработчикНажатиДинамическогоЭлементаВиджетаВыборЭтапСделки(Команда) Экспорт
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлементаВиджетаСделки(ЭтотОбъект, Команда);
	Если НЕ СтруктураДанныеЭлемента = Неопределено Тогда
		
		Врач = Неопределено;
		Если НЕ Объект.Услуги.Количество() = 0 Тогда 
			Врач = Объект.Услуги[0].Сотрудник;
		КонецЕсли;
		
		ВыбранныйВидСделки 	= Неопределено;
		ВыбранныйЭтап 		= Неопределено; 		
		МассивСтрок = ТаблицаДоступныхВидовСделок.НайтиСтроки(Новый Структура("Выбран", Истина));
		Если МассивСтрок.Количество() > 0 Тогда 
			ВыбранныйВидСделки = МассивСтрок[0].ВидСделки;
			МассивСтрок = МассивСтрок[0].ТаблицаЭтапов.НайтиСтроки(Новый Структура("Выбран", Истина));
			Если МассивСтрок.Количество() > 0 Тогда 
				ВыбранныйЭтап = МассивСтрок[0].Этап;
			КонецЕсли;	
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Контрагент"					, Объект.Контрагент);
		ПараметрыФормы.Вставить("Врач"							, Врач);
		ПараметрыФормы.Вставить("ВыбратьЭтапГенерируемойСделки"	, Истина);
		ПараметрыФормы.Вставить("ВыбранныйВидСделки"			, ВыбранныйВидСделки);
		ПараметрыФормы.Вставить("ВыбранныйЭтап"					, ВыбранныйЭтап);		
		
		ОткрытьФорму("Справочник.Сделки.Форма.ФормаВиджета"
					, ПараметрыФормы
					, ЭтаФорма,,,
					, Новый ОписаниеОповещения("ВыборЭтапаГенерируемойСделки", ЭтотОбъект, Новый Структура("ВыбранныйВидСделки, ВыбранныйЭтап", ВыбранныйВидСделки, ВыбранныйЭтап))
					, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Выбор этапа генерируемой сделки
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВыборЭтапаГенерируемойСделки(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда 
		Если РезультатВыбора = ДополнительныеПараметры.ВыбранныйЭтап Тогда 
			Возврат;
		КонецЕсли;
		ОбновитьВиджетСделкиНаФорме = Ложь;
		Для Каждого СтрокаВидСделки Из ТаблицаДоступныхВидовСделок Цикл 
			Если СтрокаВидСделки.ВидСделки = ДополнительныеПараметры.ВыбранныйВидСделки Тогда
				Для Каждого СтрокаЭтап Из СтрокаВидСделки.ТаблицаЭтапов Цикл 
					СтрокаЭтап.Выбран = СтрокаЭтап.Этап = РезультатВыбора;
					Если СтрокаЭтап.Выбран Тогда 
						ОбновитьВиджетСделкиНаФорме = Истина;
					КонецЕсли;	
				КонецЦикла;	
		        Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ОбновитьВиджетСделкиНаФорме Тогда 
			ОбновитьВиджетСделки(Истина, Ложь); 
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор вида генерируемой сделки
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВыборВидаГенерируемойСделки(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда 
		Если РезультатВыбора = ДополнительныеПараметры.ВыбранныйВидСделки Тогда 
			Возврат;
		КонецЕсли;
		ОбновитьВиджетСделкиНаФорме = Ложь;
		Для Каждого СтрокаВидСделки Из ТаблицаДоступныхВидовСделок Цикл
			Если СтрокаВидСделки.Выбран Тогда 
				Для Каждого СтрокаЭтап Из СтрокаВидСделки.ТаблицаЭтапов Цикл 
					СтрокаЭтап.Выбран = Ложь;
				КонецЦикла;	
			КонецЕсли;	
			СтрокаВидСделки.Выбран 	= СтрокаВидСделки.ВидСделки = РезультатВыбора;			
			Если СтрокаВидСделки.Выбран Тогда 
				ОбновитьВиджетСделкиНаФорме = Истина;
				СтрокаВидСделки.ТаблицаЭтапов[0].Выбран = Истина;
			КонецЕсли;	
		КонецЦикла;
		Если ОбновитьВиджетСделкиНаФорме Тогда 
			ОбновитьВиджетСделки(Истина, Ложь); 
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, ОбработчикНажатиДинамическогоЭлементаВиджета.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Процедура ОбработчикНажатиДинамическогоЭлементаВиджета(Команда) Экспорт
	
	Если ЭтаФорма.Модифицированность Тогда
		
		Оповещение = Новый ОписаниеОповещения("ОбработчикНажатияДинамическогоЭлементаВиджетаЗавершение", ЭтотОбъект, Новый Структура("ИмяКоманды", Команда.Имя));
		ПоказатьВопрос(Оповещение, НСтр("ru='Предварительная запись не сохранена. Сохранить изменения?';en='No pre-entry saved. Save changes?'"), РежимДиалогаВопрос.ДаНет);
		
	Иначе
		ВыполнитьНажатиеНаВиджетСделки(Команда.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет нажатие на виджет сделки после вопроса о записи.
//  
//  Описание:
//  
//  
//  Параметры (название, тип, дифференцированное значение)
//
// Параметры:
//  Результат	 - КодВозвратаДиалога	 -  да/нет.
//  ДопПараметры - Структура			 -  содержит доп. параметры.
//
Процедура ОбработчикНажатияДинамическогоЭлементаВиджетаЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да
		И ТипЗнч(ДопПараметры) = Тип("Структура")
		И ДопПараметры.Свойство("ИмяКоманды") Тогда
		
		ЭтаФорма.Записать();
		ВыполнитьНажатиеНаВиджетСделки(ДопПараметры.ИмяКоманды);

	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
// Процедура, обработка нажатия на виджет сделки.
//  
//  Описание: обрабаытвает нажатие на элемент формы, виджет сделки.
//  
//  
//  Параметры (название, тип, дифференцированное значение)
//
// Параметры:
//  ИмяКоманды	 - строка - имя выполненной команды.
//
Процедура ВыполнитьНажатиеНаВиджетСделки(ИмяКоманды)
	
	Если СтрНайти(ИмяКоманды, "КомандаОткрытьПродажу") Тогда 
		
		ИндексСтроки = ПолучитьИндексСтроки(ИмяКоманды);
		Реализация   = ЭтаФорма.ТаблицаСделок[ИндексСтроки].Прием;
		
		Если ЗначениеЗаполнено(Реализация) Тогда
			ПоказатьЗначение(,Реализация);
		КонецЕсли;
		
	Иначе
		
		Если СтрНайти(ИмяКоманды, "КомандаСделка") Тогда
			
			ИндексГурппы  = ПолучитьИндексСтроки(ИмяКоманды, Ложь);
			ИмяГруппыРодителя = Элементы["ГруппаТелоВиджета_" + ИндексГурппы].Родитель.Имя;
			СтрокаТаблицы = ЭтаФорма.ТаблицаСделок[ИндексГурппы];
			// Если НЕ ИмяГруппыРодителя = "ВиджетСделки" Тогда
				ПоказатьЗначение(,СтрокаТаблицы.Сделка);
				Возврат;
			// КонецЕсли;

		КонецЕсли;
		
		Врач = Неопределено;
		Если НЕ Объект.Услуги.Количество() = 0 Тогда 
			Врач = Объект.Услуги[0].Сотрудник;
		КонецЕсли;		
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Контрагент"	, Объект.Контрагент);
		ПараметрыФормы.Вставить("ВыбратьЭтап"	, СтрНайти(ИмяКоманды, "КомандаТекущийЭтап") > 0);
		ПараметрыФормы.Вставить("Врач"			, Врач);
		
		ИндексГурппы  = ПолучитьИндексСтроки(ИмяКоманды, Ложь);
		СтрокаТаблицы = ЭтаФорма.ТаблицаСделок[ИндексГурппы];
		ПараметрыФормы.Вставить("Сделка", СтрокаТаблицы.Сделка);
		
		ОткрытьФорму("Справочник.Сделки.Форма.ФормаВиджета", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик динамической команды "Подключаемый_ОткрытьСделку".
//
Процедура Подключаемый_ОткрытьСделку(Команда)
	
	ИндексГруппы  = ПолучитьИндексСтроки(Команда.Имя, Ложь);
	СтрокаТаблицы = ЭтаФорма.ТаблицаСделок[ИндексГруппы];
	СменитьФокусЭлемента(ИндексГруппы);
	ПоказатьЗначение(,СтрокаТаблицы.Сделка);
    
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик динамической команды "Подключаемый_СменитьСделку".
//
Процедура Подключаемый_СменитьСделку(Команда)
	
	ИндексГурппы = ПолучитьИндексСтроки(Команда.Имя);
	СменитьФокусЭлемента(ИндексГурппы);
	
	Элементы["ГруппаВсплывающаяВидСделки_"+ИндексГурппы].Показать();
	
КонецПроцедуры

&НаКлиенте
// Процедура, работчик динамической команды "Подключаемый_СменитьВидСделки".
//
Процедура Подключаемый_СменитьВидСделки(Команда)
	
	ИндексВида  	= ПолучитьИндексСтроки(Команда.Имя);
	ИндексВиджета  	= ПолучитьИндексСтроки(Команда.Имя, Ложь);
	СтрокаТаблицы 	= ЭтаФорма.ТаблицаСделок[ИндексВиджета];
	ТекстОшибки		= "";
	УправлениеИнтерфейсамиСервер.ИзменитьВидСделки(СтрокаТаблицы.Сделка, ИндексВида, ТекстОшибки);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	Иначе
		СменитьФокусЭлемента(ИндексВиджета);
		ОбновитьСделку(Команда.Имя, Объект.Ссылка);
		Оповестить("ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ");
		Оповестить("ОБНОВИТЬ_ВИДЖЕТ_СДЕЛКИ");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик динамического элемента "ПриИзменении".
//
Процедура Подключаемый_ПолеВводаСуммыСделкиПриИзменении(Элемент)
	
	ИзменитьСуммуСделки(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
// Процедура, ИзменитьСуммуСделки.
//
Процедура ИзменитьСуммуСделки(ИмяЭлемента)
	
	ИндексВиджета = ПолучитьИндексСтроки(ИмяЭлемента, Ложь);
	СтрокаТаблицы = ЭтаФорма.ТаблицаСделок[ИндексВиджета];
	
	УправлениеИнтерфейсамиСервер.ИзменитьСуммуСделки(СтрокаТаблицы.Сделка, ЭтотОбъект.ПолеВводаСуммыСделки);
	
	СтрокаТаблицы.СуммаСделки = ЭтотОбъект.ПолеВводаСуммыСделки;
	
	// УстановитьФокусЭлемента();

	ПоказатьВсплывающуюГруппуСделки(ИндексВиджета);
	
КонецПроцедуры

&НаКлиенте
// Процедура, изменяет видимость элементов суммы сделки в виджете.
// Значения реквизита "сумма сделки" и в "таблице сделок" (динамических), изменяется перед процедурой. 
// т.к. процедура предназначена для изменения видимости элементов, а не значений реквизитов формы.
//
// Параметры:
//	ИндексВиджета - Число  - индекс виджета.
//	ВводДоступен  - Булево - признак отображения поле ввода.
//
Процедура ПоказатьВсплывающуюГруппуСделки(ИндексВиджета)
	
	Элементы["ГруппаВсплывающаяСделка_"+ИндексВиджета].Показать();

КонецПроцедуры

//&НаСервереБезКонтекста
//// Процедура, СделкаЗавершена.
////
// Функция СделкаЗавершена(знач Сделка)
//	
//	Возврат ЗначениеЗаполнено(Сделка.Реализация) ИЛИ ЗначениеЗаполнено(Сделка.ПричинаОтказа);
//	
// КонецФункции

&НаКлиенте
// Процедура, ОбработчикНажатияИзменитьЭтап.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Процедура ОбработчикНажатияИзменитьЭтап(Команда) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент", Объект.Ссылка);
	ПараметрыФормы.Вставить("ИзменитьЭтапОтказ", СтрНайти(Команда.Имя, "КомандаИзменитьЭтапОтказ") > 0);
	
	ИндексГурппы  = ПолучитьИндексСтроки(Команда.Имя, Ложь);
	СтрокаТаблицы = ЭтаФорма.ТаблицаСделок[ИндексГурппы];
	ПараметрыФормы.Вставить("Сделка", СтрокаТаблицы.Сделка);
	
	ОткрытьФорму("Справочник.Сделки.Форма.ФормаВиджета", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
// Процедура, СоздатьРеализациюЗавершение.
//
Процедура СоздатьРеализациюЗавершение(Результат, ДопПараметры) Экспорт
	
	СоздатьРеализациюЗавершениеНаСервере(ДопПараметры);
	Оповестить("ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ");
	Оповестить("ОБНОВИТЬ_ВИДЖЕТ_СДЕЛКИ");
	
КонецПроцедуры

&НаСервере
// Процедура, СоздатьРеализациюЗавершениеНаСервере.
//
Процедура СоздатьРеализациюЗавершениеНаСервере(Сделка)
	
	Реализация = ПолучитьПоследнююПродажуПоСделке(Сделка);
	Если ЗначениеЗаполнено(Реализация) Тогда
		УправлениеИнтерфейсамиСервер.ОбновитьЭтапУспех(Сделка, Реализация);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, открывает форму продажи.
//
Процедура ОткрытьФормуПродажи(ИндексВиджета)
	
	Сделка = ЭтаФорма.ТаблицаСделок[ИндексВиджета].Сделка;
	
	Структура = Новый Структура();
	Структура.Вставить("Контрагент"			, Объект.Ссылка);
	Структура.Вставить("Сделка"	   			, Сделка);
	Если ОбщегоНазначенияСтоматология.ПолучитьЗначениеКонстанты("ИспользоватьМенеджераПрезентацииПриПродаже") = Истина Тогда 	
		МенеджерПрезентации = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Сделка, "МенеджерПрезентации");
		Структура.Вставить("МенеджерПрезентации", ?(ЗначениеЗаполнено(МенеджерПрезентации), МенеджерПрезентации, Объект.МенеджерПрезентации));
	КонецЕсли;
	ПараметрыФормы  = Новый Структура("ЗначенияЗаполнения", Структура);	
	НовоеОповещение = Новый ОписаниеОповещения("СоздатьРеализациюЗавершение", ЭтотОбъект, Сделка);
	
	СменитьФокусЭлемента(ИндексВиджета);
	ОткрытьФорму("Документ.Реализация.Форма.ФормаДокумента",ПараметрыФормы,,,,,НовоеОповещение);
	
КонецПроцедуры

&НаКлиенте
// Процедура, ОбработчикТаблицаОтказовВыбор.
//
Процедура ОбработчикТаблицаОтказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
	
	ПричинаОтказа = Элемент.ТекущиеДанные.Ссылка;
	ИмяЭлемента   = Элемент.Имя;
	
	ИндексВиджета = ПолучитьИндексСтроки(ИмяЭлемента, Ложь);
	СменитьФокусЭлемента(ИндексВиджета);
	
	ОбновитьПричинуОтказаВыборНаСервере(ПричинаОтказа, ИмяЭлемента);	
	Оповестить("ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ");
	Оповестить("ОБНОВИТЬ_ВИДЖЕТ_СДЕЛКИ");
	    
КонецПроцедуры

&НаСервере
// Процедура, ОбновитьПричинуОтказаВыборНаСервере.
//
Процедура ОбновитьПричинуОтказаВыборНаСервере(ПричинаОтказа, ИмяЭлемента)	
	
	УправлениеИнтерфейсамиСервер.ОбновитьПричинуОтказа(ЭтаФорма, ПричинаОтказа, ИмяЭлемента);
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ЭтотОбъект.Статус = Перечисления.СтатусыКонтрагентов.Отказ;
		// ОбновитьОформлениеКнопкиСтатусаКлиента();
		
	Иначе 
		
		ЭтотОбъект.Статус = Справочники.Контрагенты.ПолучитьСтатус(Объект.Ссылка);
		// ОбновитьОформлениеКнопкиСтатусаКлиента();
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, ОбновитьСделку.
//
Процедура ОбновитьСделку(ИмяКоманды, Контрагент)
	
	Если СтрНайти(ИмяКоманды, "КомандаЭтап") > 0 Тогда		
		
		ИндексВиджета 	= ПолучитьИндексСтроки(ИмяКоманды, Ложь);
		ИндексЭтапа     = ПолучитьИндексСтроки(ИмяКоманды);
		НайденнаяСделка = ЭтотОбъект.ТаблицаСделок[ИндексВиджета].Сделка;

		УправлениеИнтерфейсамиСервер.ОбновитьЭтапСделки(НайденнаяСделка, ИндексЭтапа);
		
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() 
		И ЭтотОбъект.Статус <> Перечисления.СтатусыКонтрагентов.Потенциальный Тогда
		
		ЭтотОбъект.Статус = Перечисления.СтатусыКонтрагентов.Потенциальный;
		// ОбновитьОформлениеКнопкиСтатусаКлиента();
		
	Иначе 
		
		ЭтотОбъект.Статус = Справочники.Контрагенты.ПолучитьСтатус(Объект.Ссылка);
		// ОбновитьОформлениеКнопкиСтатусаКлиента();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает идентификатор строки данных по имени элемента.
//
// Параметры:
//	 ИмяЭлемента 	- Строка - имя элемента.
//   ИндексЭлемента - Булево - признак чего получаем индекс (Элемента или Виджета).
//
Функция ПолучитьИндексСтроки(ИмяЭлемента, ИндексЭлемента = Истина)
	
	Если ИндексЭлемента Тогда
		НомерСимвола = СтрНайти(ИмяЭлемента,"_");
		
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Сред(ИмяЭлемента, НомерСимвола + 1, 2)) Тогда
			Возврат Число(Сред(ИмяЭлемента, НомерСимвола + 1, 2));
		Иначе		
			Возврат Число(Сред(ИмяЭлемента, НомерСимвола + 1, 1));	
		КонецЕсли;		
		
	Иначе
		НомерСимвола = СтрНайти(ИмяЭлемента,"_", НаправлениеПоиска.СКонца);
		Возврат Число(Сред(ИмяЭлемента, НомерСимвола + 1));
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Процедура, СменитьФокусЭлемента.
Процедура СменитьФокусЭлемента(Знач ИндексГурппы)
	
	ЭтаФорма.ТекущийЭлемент = Элементы["КнопкаТекущийЭтап_" + ИндексГурппы];
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, ПолучитьПоследнююПродажуПоСделке.
//
Функция ПолучитьПоследнююПродажуПоСделке(Сделка)
	
	Если НЕ ЗначениеЗаполнено(Сделка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Реализация.Ссылка КАК Продажа
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.Сделка = &Сделка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Реализация.Дата УБЫВ";
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗначениеВозврата = ?( Выборка.Следующий(), Выборка.Продажа, Неопределено);
	
	Возврат ЗначениеВозврата;
		
КонецФункции

&НаКлиенте
// Процедура, ПоказатьСделкиАрхива.
//
Процедура ПоказатьСделкиАрхива(Команда) Экспорт
	
	ГруппаАрхивСделокСвертываемая = ЭтаФорма.Элементы.Найти("ГруппаСвертываемаяАрхивСделок");	
	Если НЕ ГруппаАрхивСделокСвертываемая = Неопределено Тогда
		ГруппаАрхивСделокСвертываемая.Видимость = НЕ ГруппаАрхивСделокСвертываемая.Видимость;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДинамическиеЭлментыУслуги

&НаСервере
// Процедура, Создать динамические табличные части.
//
Процедура СоздатьДинамическиеЭлементыГруппыЗапись()
		
	// Формирование динамических табличных частей
	МассивТабличныхЧастей = Новый Массив();
	МассивТабличныхЧастей.Добавить(Новый Структура("ТабличнаяЧасть, ГруппаДляРазмещения", "Услуги", "ГруппаЗапись"));  // ("ГруппаДляВремениДлительности", "ГруппаВыводаКнопокДлительности")
	УправлениеСвойствамиСтоматология.ОбновитьОтображениеТабличныхЧастей(ЭтаФорма, , МассивТабличныхЧастей);
	
	// Создание шкалы длительности приема
	УправлениеСвойствамиСтоматология.ЗаполнитьШкалуДлительностиПриема(ЭтаФорма, "ГруппаВыводаКнопокДлительности", Неопределено, Неопределено, Ложь);
	
	ЭтотОбъект.ОбновитьДинамическуюТаблицу = Ложь;
	
КонецПроцедуры

&НаКлиенте
// Процедура, Подключаемый удалить строку табличной части.
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_УдалитьСтрокуТабличнойЧасти(Элемент) Экспорт
	
	Если Объект.Услуги.Количество() > 1 Тогда
		
		// Получим всю информацию по удаляемой строке
		СтруктураДанныхЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлемента(ЭтаФорма, Элемент);
		
		Если СтруктураДанныхЭлемента.ДанныеЭлемента <> Неопределено Тогда
			
			СтароеВремяПриема = 0;
			Для СтрокаУслуги = 1 по Объект.Услуги.Количество() Цикл
				СтароеВремяПриема = СтароеВремяПриема + Объект.Услуги[СтрокаУслуги-1].НормаВремени;	
			КонецЦикла;
			
			УдалитьСтрокуТабличнойЧастиНаСервере(СтруктураДанныхЭлемента.ИндексСтроки);
			ЭтаФорма.Модифицированность = Истина;
			
			// Меняем выделяемые элемент в шкале длительности
			
			// ИзменитьЭлементДлительностиПриема(Число(СтароеВремяПриема - Число(СтруктураДанныхЭлемента.ДанныеЭлемента.НормаВремени)), Число(СтароеВремяПриема));
			
			
			УдалитьЭтуДлительностьПриема("УдалитьСтрокуТЧ");
			
			
		КонецЕсли;
		
	Иначе
		Элементы.ГруппаУслугПолями.Видимость = Ложь;
		Элементы.ГруппаКнопкаДобавитьУслуги.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, Удалить строку табличной части на сервере.
//
// Параметры:
//  ИмяТаблицы	 - 	 - 
//  ИндексСтроки - 	 - 
//
Процедура УдалитьСтрокуТабличнойЧастиНаСервере(ИндексСтроки)
	
	Объект.Услуги.Удалить(ИндексСтроки);
	
	// Если удалили последнюю строчку - сразу добавляем новую
	Если Объект.Услуги.Количество() = 0 Тогда
		Объект.Услуги.Добавить();
	КонецЕсли;
	
	ПредыдущаяСтрока = Неопределено;
	ВремяОжидания = 0;
	Для Каждого СтрокаУслуга Из Объект.Услуги Цикл
		
		Если ПредыдущаяСтрока = Неопределено Тогда
			
			Если СтрокаУслуга.ДатаНачала = Дата(1, 1, 1) ИЛИ СтрокаУслуга.ДатаНачала = НачалоДня(ЭтотОбъект.ДатаНачала) Тогда
				СтрокаУслуга.ДатаНачала = ЭтотОбъект.ДатаНачала;
			ИначеЕсли НЕ НачалоДня(СтрокаУслуга.ДатаНачала) = НачалоДня(ЭтотОбъект.ДатаНачала) Тогда
				ИзмененаДатаВизита = Истина;
				СтрокаУслуга.ДатаНачала = НачалоДня(ЭтотОбъект.ДатаНачала) + Час(СтрокаУслуга.ДатаНачала) * 3600 + Минута(СтрокаУслуга.ДатаНачала) * 60;
			КонецЕсли;
			
		Иначе// Если СтрокаУслуга.Сотрудник = ПредыдущаяСтрока.Сотрудник Тогда
			СтрокаУслуга.ДатаНачала = ПредыдущаяСтрока.ДатаНачала + (ПредыдущаяСтрока.НормаВремени * 60);//?(ПредыдущаяСтрока.ДатаНачала + (ПредыдущаяСтрока.НормаВремени * 60) > СтрокаУслуга.ДатаНачала, ПредыдущаяСтрока.ДатаНачала + (ПредыдущаяСтрока.НормаВремени * 60), СтрокаУслуга.ДатаНачала);
			ВремяОжидания = ВремяОжидания + Цел((СтрокаУслуга.ДатаНачала - ПредыдущаяСтрока.ДатаОкончания) / 60);
		КонецЕсли;

		ПредыдущаяСтрока = СтрокаУслуга;

	КонецЦикла;
	
	Если Объект.Услуги.Количество() > 1 Тогда
		ДатаНачала = Объект.Услуги[0].ДатаНачала;
		ДатаОкончания = Объект.Услуги[Объект.Услуги.Количество() - 1 - 1].ДатаОкончания;	
	КонецЕсли;
	
	СоздатьДинамическиеЭлементыГруппыЗапись();
	
	УстановитьНормуВремени();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ЗапасыНоменклатураПриИзменении(Элемент, СтрокаТЧ = Неопределено, ПересчитатьКоличествоУпаковок = Истина)	
		
		Если СтрокаТЧ = Неопределено Тогда
			
			СтруктураДанныхЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлемента(ЭтаФорма, Элемент);
			
			ЗакладкаЗапись = (СтруктураДанныхЭлемента.ДанныеЭлемента <> Неопределено);
			СтрокаТЧ	   = ?(ЗакладкаЗапись, СтруктураДанныхЭлемента.ДанныеЭлемента, Элементы.Услуги.ТекущиеДанные);
		Иначе
			ЗакладкаЗапись = Ложь;
		КонецЕсли;
	
		Отказ = Ложь;
		
	Если ОтветПользователяНаВопрос = Неопределено Тогда
		// СтароеВремяПриема = Элементы.УслугиНормаВремениПолем.ВыделенныйТекст;
		// СтароеВремяПриема = ЭтаФорма.НормаВремени;
		
		СтароеВремяПриема = ПосчитатьНормуВремениТЧУслуги();		
		
		СтрокаТабличнойЧасти = СтрокаТЧ;
		
		СтруктураДанные = Новый Структура();
		СтруктураДанные.Вставить("СтруктурнаяЕдиница",	Объект.СтруктурнаяЕдиница);
		СтруктураДанные.Вставить("ДатаОбработки",		Объект.Дата);
		СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);
		СтруктураДанные.Вставить("Сотрудник", 			СтрокаТабличнойЧасти.Сотрудник);
		СтруктураДанные.Вставить("Номенклатура", 		СтрокаТабличнойЧасти.Номенклатура);
		
		СтруктураДанные = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
		СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
		
	Иначе
		СтароеВремяПриема = ПосчитатьНормуВремениТЧУслуги();
		СтрокаТабличнойЧасти = СтрокаТЧ;
	КонецЕсли;
		
	НормаВремениНоменклатры = ВернутьНормыВремениУслуги(СтрокаТабличнойЧасти.Номенклатура); // СтрокаТабличнойЧасти.Номенклатура
	Если (ЗначениеЗаполнено(НормаВремениНоменклатры) ИЛИ НормаВремениНоменклатры = 0) И НормаВремениНоменклатры <> СтрокаТабличнойЧасти.НормаВремени Тогда
		
		Если ОтветПользователяНаВопрос = Неопределено Тогда
			
			ПараметрыОповещения = Новый Структура("Элемент, СтрокаТЧ, ПересчитатьКоличествоУпаковок, ПроцедураВозврата", Элемент, СтрокаТЧ, ПересчитатьКоличествоУпаковок, "ЗапасыНоменклатураПриИзменении");
			Оповещение = Новый ОписаниеОповещения("ПоказатьПользователюВопросЗавершение_ЗапасыНоменклатураПриИзменении", ЭтотОбъект, ПараметрыОповещения);
			ПоказатьВопрос(Оповещение, "Норма времени по услуге не соответствует выбранному значению. Изменить?", РежимДиалогаВопрос.ДаНет);
			Возврат;
			
		ИначеЕсли ОтветПользователяНаВопрос = КодВозвратаДиалога.Да Тогда
			
			СтрокаТабличнойЧасти.ДатаОкончания = СтрокаТабличнойЧасти.ДатаНачала + НормаВремениНоменклатры * 60;
			ДатаОкончания = СтрокаТабличнойЧасти.ДатаНачала + НормаВремениНоменклатры * 60;
			СтрокаТабличнойЧасти.НормаВремени = НормаВремениНоменклатры;
			НормаВремени = НормаВремениНоменклатры;
			НовоеВремяПриема = СтароеВремяПриема + НормаВремениНоменклатры;
			
		Иначе
			
			НормаВремениНоменклатры = СтароеВремяПриема;
			НовоеВремяПриема = СтароеВремяПриема;
			
			// Если мы несколько раз отменяем корректировку времени, то распределяем первоначальное время по всем услугам.
			// Если Объект.Услуги.Количество() >= 2 Тогда
			//	
			//	// КолонкаНормаВремени = Объект.Услуги.Выгрузить( , НормаВремени);
			//	КоличествоЗаполненных = 0;
			//	Для каждого ПроверяемаяСтрока Из Объект.Услуги Цикл
			//		Если ПроверяемаяСтрока.НормаВремени <> 0 Тогда
			//			КоличествоЗаполненных = КоличествоЗаполненных + 1;		
			//		КонецЕсли;
			//	КонецЦикла;
			//	Если КоличествоЗаполненных < Объект.Услуги.Количество() Тогда
			//	// НУЖНО ЗАПУСТИТЬ ПОСЛЕ СОЗДАНИЯ ПУСТОЙ СТРОКИ!!!
			//		ПересчетВремениОказанияУслуг(НовоеВремяПриема);		
			//	КонецЕсли;
			//	
			// КонецЕсли;
			
		КонецЕсли;
		ОтветПользователяНаВопрос = Неопределено;
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.Услуги[Объект.Услуги.Количество()-1].Номенклатура) Тогда
		
		НоваяСтрокаУслуг = Объект.Услуги.Добавить();
		
		Если Объект.Услуги.Количество() >= 2 Тогда
			НоваяСтрокаУслуг.Сотрудник 		= НоваяСтрокаУслуг.Сотрудник;
			НоваяСтрокаУслуг.Помещение 		= Объект.Услуги[0].Помещение;
			НоваяСтрокаУслуг.ПричинаЗаписи 	= Объект.Услуги[0].ПричинаЗаписи;
			НоваяСтрокаУслуг.ДатаНачала 	= Объект.Услуги[Объект.Услуги.Количество() - 1 - 1].ДатаОкончания;
			НоваяСтрокаУслуг.ДатаОкончания 	= НоваяСтрокаУслуг.ДатаНачала;// + 15 * 60;
			НоваяСтрокаУслуг.НормаВремени 	= (НоваяСтрокаУслуг.ДатаОкончания - НоваяСтрокаУслуг.ДатаНачала) / 60;
			НоваяСтрокаУслуг.Бесплатно      = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТабличнойЧасти.Номенклатура, "Бесплатно");
			
			ДатаОкончания = НоваяСтрокаУслуг.ДатаНачала + 15 * 60;
			
		КонецЕсли;	
	КонецЕсли;
	
	СоздатьДинамическиеЭлементыГруппыЗапись();
	ОбновитьРеквизитыТаблицыУслуг();
	
	// НормаВремениИтого = 0;
	// Для Каждого СтрокаУслуги Из Объект.Услуги Цикл
	//	НормаВремениИтого = НормаВремениИтого + СтрокаУслуги.НормаВремени;	
	// КонецЦикла;
	
	
	// ИзменитьЭлементДлительностиПриема(Число(Элементы.УслугиНормаВремениПолем.ВыделенныйТекст), Число(СтароеВремяПриема));
	ИзменитьЭлементДлительностиПриема(?(Объект.Услуги.Количество() <= 2, НормаВремениНоменклатры,  НовоеВремяПриема), Число(СтароеВремяПриема));

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора".
//
Процедура ЗапасыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Получим данные строки
	СтруктураДанныхЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлемента(ЭтаФорма, Элемент);
		
	СотрудникУслуги = Объект.Услуги[СтруктураДанныхЭлемента.ИндексСтроки].Сотрудник;
	Номенклатура = Объект.Услуги[СтруктураДанныхЭлемента.ИндексСтроки].Номенклатура;
	Сегмент = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизитаСотрудника(СотрудникУслуги, Объект.СтруктурнаяЕдиница, "СегментыНоменклатуры");
	мВидЦен = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизитаСотрудника(СотрудникУслуги, Объект.СтруктурнаяЕдиница, "ВидЦен");
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("ТекущаяСтрока", Номенклатура);
	ПараметрыФормыВыбора.Вставить("ВидЦен", ?(ЗначениеЗаполнено(мВидЦен),мВидЦен, объект.ВидЦен));
	ПараметрыФормыВыбора.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	ПараметрыФормыВыбора.Вставить("Дата", Объект.Дата);
	
	СтруктураПараметры     = Новый Структура();	
	МассивРазрешенныхТипов = Новый Массив;
	МассивРазрешенныхТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"));
		
	СписокРазрешенныхТипов = Новый СписокЗначений;
	СписокРазрешенныхТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"));

	СтруктураПараметры.Вставить("ОтборМассивРазрешенныхТипов"       , МассивРазрешенныхТипов); 
	СтруктураПараметры.Вставить("Заголовок"                         , "Выберите услугу");	   
	СтруктураПараметры.Вставить("Сегмент"                           , Сегмент);
	СтруктураПараметры.Вставить("СписокРазрешенныхТипов"            , СписокРазрешенныхТипов);
	СтруктураПараметры.Вставить("Сотрудник"                         , СотрудникУслуги);
	СтруктураПараметры.Вставить("ТипДок"                            , "Предварительная запись");
		                    
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СтруктураДанныхЭлемента", СтруктураДанныхЭлемента);
	ДополнительныеПараметры.Вставить("Номенклатура", Номенклатура);

	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаПодбораНоменклатуры", СтруктураПараметры,,,,,Новый ОписаниеОповещения("ЗапасыНоменклатураНачалоВыбораЗавершение", ЭтотОбъект, ДополнительныеПараметры), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ЗапасыНоменклатураНачалоВыбораЗавершение".
//
Процедура ЗапасыНоменклатураНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Объект.Услуги[Параметры.СтруктураДанныхЭлемента.ИндексСтроки].Номенклатура = Результат.Номенклатура;
		
		СтрокаТабличнойЧасти = Объект.Услуги[Параметры.СтруктураДанныхЭлемента.ИндексСтроки]; 
		СтруктураДанные = Новый Структура();
		СтруктураДанные.Вставить("СтруктурнаяЕдиница",	Объект.СтруктурнаяЕдиница);
		СтруктураДанные.Вставить("ДатаОбработки",		Объект.Дата);
		СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);
		СтруктураДанные.Вставить("Сотрудник", 			СтрокаТабличнойЧасти.Сотрудник);
		СтруктураДанные.Вставить("Номенклатура", 		СтрокаТабличнойЧасти.Номенклатура);
		
		СтруктураДанные = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
		СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
		
		НормаВремениНоменклатры = ВернутьНормыВремениУслуги(СтрокаТабличнойЧасти.Номенклатура);
		Если (ЗначениеЗаполнено(НормаВремениНоменклатры) ИЛИ НормаВремениНоменклатры = 0) И НормаВремениНоменклатры <> СтрокаТабличнойЧасти.НормаВремени Тогда 
						
			Если ОтветПользователяНаВопрос = Неопределено Тогда
				
				ПараметрыОповещения = Новый Структура("РезультатФорма, ПараметрыФорма, ПроцедураВозврата", Результат.Номенклатура, Параметры, "ЗапасыНоменклатураНачалоВыбораЗавершение");
				Оповещение = Новый ОписаниеОповещения("ПоказатьПользователюВопросЗавершение_ЗапасыНоменклатураПриИзменении", ЭтотОбъект, ПараметрыОповещения);
				ПоказатьВопрос(Оповещение, "Норма времени по услуге не соответствует выбранному значению. Изменить?", РежимДиалогаВопрос.ДаНет);
				Возврат;
				
			ИначеЕсли ОтветПользователяНаВопрос = КодВозвратаДиалога.Да Тогда
				
				СтрокаТабличнойЧасти.ДатаОкончания = СтрокаТабличнойЧасти.ДатаНачала + НормаВремениНоменклатры * 60;
				ДатаОкончания = СтрокаТабличнойЧасти.ДатаНачала + НормаВремениНоменклатры * 60;
				СтрокаТабличнойЧасти.НормаВремени = НормаВремениНоменклатры;
				НормаВремени = НормаВремениНоменклатры;

			КонецЕсли;
			ОтветПользователяНаВопрос = Неопределено;	
				
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметры.Номенклатура)
		И ЗначениеЗаполнено(Результат) Тогда
		
		НоваяСтрокаУслуг = Объект.Услуги.Добавить();
		
		Если Объект.Услуги.Количество() >= 2 Тогда
			НоваяСтрокаУслуг.Сотрудник 		= НоваяСтрокаУслуг.Сотрудник;
			НоваяСтрокаУслуг.Помещение 		= Объект.Услуги[0].Помещение;
			НоваяСтрокаУслуг.ПричинаЗаписи 	= Объект.Услуги[0].ПричинаЗаписи;
			НоваяСтрокаУслуг.ДатаНачала 	= Объект.Услуги[Объект.Услуги.Количество() - 1 - 1].ДатаОкончания;
			НоваяСтрокаУслуг.ДатаОкончания 	= НоваяСтрокаУслуг.ДатаНачала;// + 15 * 60;
			НоваяСтрокаУслуг.НормаВремени 	= (НоваяСтрокаУслуг.ДатаОкончания - НоваяСтрокаУслуг.ДатаНачала) / 60;
			
			ДатаОкончания = НоваяСтрокаУслуг.ДатаНачала + 15 * 60;
			
		КонецЕсли;	
	КонецЕсли;

	СоздатьДинамическиеЭлементыГруппыЗапись();
	ОбновитьРеквизитыТаблицыУслуг();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ЗапасыНоменклатураНачалоВыбораЗавершение".
//
Процедура ЗапасыНоменклатураНачалоВыбораЗавершение_Вопрос(Результат, Параметры) Экспорт
	
КонецПроцедуры

&НаСервере
// Процедура, Заполнить список времени начала услуг.
//
// Параметры:
//  Элемент						 - 	 - 
//  СписокДополнительныхЗначений - 	 - 
//
Процедура ЗаполнитьСписокВремениНачалаУслуг(Элемент, СтрокаТЧ) Экспорт
	
	Элемент.СписокВыбора.Очистить();
	МассивПериодов = Новый Массив;
	МассивПериодов.Добавить(ОбщегоНазначенияСтоматология.ПолучитьВремяРаботыСтруктурнойЕдиницы(НачалоДня(ДатаНачала), Объект.СтруктурнаяЕдиница));
	
	ИнтервалВремени = ОпределнениеИнтервалаВремени(ИнтервалГрафика);

	СписокВремени = УправлениеСвойствамиСтоматология.ВернутьСписокВремениНаСервере(МассивПериодов, Истина, ИнтервалВремени);
	
	Для Каждого ПредставлениеВремени Из СписокВремени Цикл
		Элемент.СписокВыбора.Добавить(ПредставлениеВремени.Значение, ПредставлениеВремени.Представление);
	КонецЦикла;
	
	Если Элемент.СписокВыбора.НайтиПоЗначению(ДатаНачала) = Неопределено Тогда
		Элемент.СписокВыбора.Добавить(ДатаНачала, Формат(ДатаНачала, "ДФ=ЧЧ:мм"));
	КонецЕсли;
	
	Элемент.СписокВыбора.СортироватьПоЗначению();
	
КонецПроцедуры

&НаКлиенте
// Процедура, Подключаемый удалить строку табличной части.
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_БлокироватьСтрокуТабличнойЧасти(Элемент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	// Получим всю информацию по строке
	СтруктураДанныхЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлемента(ЭтаФорма, Элемент);
	
	Если СтруктураДанныхЭлемента.ДанныеЭлемента <> Неопределено 
		И Не ТолькоПросмотр Тогда
		
		СтрокаТЧ = Объект.Услуги[СтруктураДанныхЭлемента.ИндексСтроки];
		СтрокаТЧ.ПризнакЗаблокированно = 1 - СтрокаТЧ.ПризнакЗаблокированно;
		
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Установить замок, для блокировки времени врача.
//
Процедура УстановитьЗамок(Команда)
	
	НужныйЗамок = Элементы.Найти("УстановитьЗамок"+Число(ВернутьКонстантуНесколькоВрачейВОдномПриеме())); 
	
	Если Объект.Услуги.Количество() > 0 Тогда
		
		БылоЗаблокировано = Объект.Услуги[0].ПризнакЗаблокированно = 1;
		Для каждого СтрокаУслуги из Объект.Услуги Цикл
			СтрокаУслуги.ПризнакЗаблокированно = ?(БылоЗаблокировано, 0, 1);	
		КонецЦикла;
		
		НужныйЗамок.Картинка = ?(БылоЗаблокировано, БиблиотекаКартинок.ЗамокОткрытый, БиблиотекаКартинок.ЗамокБлокировка);
		ЭтаФорма.Модифицированность = Истина;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, Подключаемый удалить строку табличной части.
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_УдалитьСтрокуТабличнойЧастиОжидание(Элемент) Экспорт
	
	// Получим всю информацию по удаляемой строке
	СтруктураДанныхЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлемента(ЭтаФорма, Элемент);
	
	Если СтруктураДанныхЭлемента.ДанныеЭлемента = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ИндексСтроки = СтруктураДанныхЭлемента.ИндексСтроки;
	СтрокаТЧ = Объект.Услуги[ИндексСтроки];
	
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПредыдущаяСтрока = Объект.Услуги[ИндексСтроки - 1];
	Если ПредыдущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТЧ.ДатаНачала = ПредыдущаяСтрока.ДатаОкончания;
	СоздатьДинамическиеЭлементыГруппыЗапись();

	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ПриИзменении.
//
Процедура ЗапасыСотрудникПриИзменении(Элемент)
	
	// Получим данные строки
	СтруктураДанныхЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлемента(ЭтаФорма, Элемент);
	СтрокаТабличнойЧасти  = Объект.Услуги[СтруктураДанныхЭлемента.ИндексСтроки];

	// Если ПроверитьПомещениеНаСоответствиеСотруднику(Элементы.Услуги.ТекущиеДанные.Сотрудник, Элементы.Услуги.ТекущиеДанные.Помещение, Объект.СтруктурнаяЕдиница) = Ложь Тогда
	СтрокаТабличнойЧасти.Помещение = ПолучитьПомещениеСотрудникаПоУмолчанию(СтрокаТабличнойЧасти.Сотрудник, Объект.СтруктурнаяЕдиница);
	// КонецЕсли;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("СтруктурнаяЕдиница",	Объект.СтруктурнаяЕдиница);
	СтруктураДанные.Вставить("ДатаОбработки",		Объект.Дата);
	СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);
	СтруктураДанные.Вставить("Сотрудник", 			СтрокаТабличнойЧасти.Сотрудник);
	СтруктураДанные.Вставить("Номенклатура", 		СтрокаТабличнойЧасти.Номенклатура);
	
	СтруктураДанные = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;	
	
	ОбновитьВиджетСделки();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Услуги сотрудник полем обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ЗапасыСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	// Получим данные строки
	СтруктураДанныхЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлемента(ЭтаФорма, Элемент);
	СтрокаТабличнойЧасти  = Объект.Услуги[СтруктураДанныхЭлемента.ИндексСтроки];
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) И ЗначениеЗаполнено(Объект.Сделка) И НЕ Объект.Ссылка.Пустая() Тогда 
		Если НЕ ВрачСоответствуетСделке(ВыбранноеЗначение, Объект.Сделка) Тогда 
			СтандартнаяОбработка = Ложь;
			ВыбранноеЗначение = Объект.Услуги[СтруктураДанныхЭлемента.ИндексСтроки].Сотрудник;
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выбранный врач не соответствует врачу, указанному в сделке!'"), , "Объект.Услуги[" + Формат(СтруктураДанныхЭлемента.ИндексСтроки, "ЧН=0; ЧГ=0") + "].Сотрудник");
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Процедура, ОбновитьРеквизитыТаблицыУслуг.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Процедура ОбновитьРеквизитыТаблицыУслуг()
	
	НесколькоВрачейВОдномПриеме = Константы.НесколькоВрачейВОдномПриеме.Получить();

	Если НЕ НесколькоВрачейВОдномПриеме Тогда
		
		ОсновнойВрач = ?(Объект.Услуги.Количество()>0, Объект.Услуги[0].Сотрудник, Неопределено);
		ОсновноеПомещение = ?(Объект.Услуги.Количество()>0, Объект.Услуги[0].Помещение, Неопределено);	
		
		 Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
			 
			  СтрокаТЧ.Сотрудник = ОсновнойВрач;
			  СтрокаТЧ.Помещение = ОсновноеПомещение;
			 
		 КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - Ссылка варианта отчета.
//
// Параметры:
//  ИмяОтчета	 - 	 - 
//  КлючВарианта - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СсылкаВариантаОтчета(ИмяОтчета, КлючВарианта)
	
	Отчет = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Отчет." + ИмяОтчета);
	Возврат ВариантыОтчетов.ВариантОтчета(Отчет, КлючВарианта);
	
КонецФункции

#КонецОбласти

&НаКлиенте
// Процедура - Команда отменить событие завершение.
//
Процедура КомандаОтменитьСобытиеЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Истина Тогда
		Оповестить("ИзмененоСобытие");
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик выбора пользователя при закрытии формы
//
Процедура ПоказатьПользователюВопросЗавершение_ПередЗакрытием(Результат, ПараметрыВопроса) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОтветПользователяНаВопрос = Результат;
		ЭтаФорма.Закрыть();
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик выбора пользователя при отмене события
//
Процедура ПоказатьПользователюВопросЗавершение_КомандаОтменитьСобытие(Результат, ПараметрыВопроса) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОтветПользователяНаВопрос = Результат;
		КомандаОтменитьСобытие(Неопределено);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик выбора пользователя при отмене события
//
Процедура ПоказатьПользователюВопросЗавершение_ЗапасыНоменклатураПриИзменении(Результат, ПараметрыВопроса) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОтветПользователяНаВопрос = Результат;
		
		Если ПараметрыВопроса.Свойство("ПроцедураВозврата") Тогда
			
			Если ПараметрыВопроса.ПроцедураВозврата	= "ЗапасыНоменклатураПриИзменении" Тогда
				
				ЗапасыНоменклатураПриИзменении(ПараметрыВопроса.Элемент, ПараметрыВопроса.СтрокаТЧ, ПараметрыВопроса.ПересчитатьКоличествоУпаковок);
				
			ИначеЕсли ПараметрыВопроса.ПроцедураВозврата = "ЗапасыНоменклатураНачалоВыбораЗавершение" Тогда
				
				ЗапасыНоменклатураНачалоВыбораЗавершение(Новый Структура("Номенклатура", ПараметрыВопроса.РезультатФорма), ПараметрыВопроса.ПараметрыФорма);
				
			ИначеЕсли ПараметрыВопроса.ПроцедураВозврата = "УслугиНоменклатураПриИзменении" Тогда
				
				УслугиНоменклатураПриИзменении(ПараметрыВопроса.Элемент);
				
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Инициализировать список статусов предварительной записи.
//
Процедура ИнициализироватьСписокСтатусовПредварительнойЗаписи()
	
	Элементы.Статус.СписокВыбора.Очистить();
	
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСобытия.НеПодтверждена
										, Новый ФорматированнаяСтрока(Строка(Перечисления.СтатусыСобытия.НеПодтверждена), , ЦветаСтиля.ГруппаВариантовОтчетовЦвет82)
										, Объект.Статус = Перечисления.СтатусыСобытия.НеПодтверждена);
	
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСобытия.Подтверждена
										, Новый ФорматированнаяСтрока(Строка(Перечисления.СтатусыСобытия.Подтверждена), , ЦветаСтиля.ЦветВажного)
										, Объект.Статус = Перечисления.СтатусыСобытия.Подтверждена);
											
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСобытия.ПриемНачат
										, Новый ФорматированнаяСтрока(Строка(Перечисления.СтатусыСобытия.ПриемНачат), , ЦветаСтиля.РезультатУспехЦвет)
										, Объект.Статус = Перечисления.СтатусыСобытия.ПриемНачат);
											
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСобытия.ПриемОкончен
										, Новый ФорматированнаяСтрока(Строка(Перечисления.СтатусыСобытия.ПриемОкончен), , ЦветаСтиля.ЗаголовокГруппыФормы)
										, Объект.Статус = Перечисления.СтатусыСобытия.ПриемОкончен);
											
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСобытия.ПриемОтменен
										, Новый ФорматированнаяСтрока(Строка(Перечисления.СтатусыСобытия.ПриемОтменен), , ЦветаСтиля.ДосьеПлохаяОценкаЦвет)
										, Объект.Статус = Перечисления.СтатусыСобытия.ПриемОтменен);
											
	Если ЗначениеЗаполнено(Объект.Статус) Тогда 
		Если Элементы.Статус.СписокВыбора.НайтиПоЗначению(Объект.Статус) = Неопределено Тогда 
			Элементы.Статус.СписокВыбора.Добавить(Объект.Статус
										, Новый ФорматированнаяСтрока(Строка(Объект.Статус) + " (не используется)", , ЦветаСтиля.ФайлЗанятыйДругимПользователем)
										, Истина);
		КонецЕсли;
	КонецЕсли;									
	
	
	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция, определяет интервал времени в зависимости от выбранного интервала графика.
//
Функция ОпределнениеИнтервалаВремени(ИнтервалГрафика)
	
	ИнтервалВремени = 15;
	Если ИнтервалГрафика = 0 Тогда
		ИнтервалВремени = 15;
	ИначеЕсли ИнтервалГрафика = 1 Тогда
		ИнтервалВремени = 10; 
	ИначеЕсли ИнтервалГрафика = 2 Тогда
		ИнтервалВремени = 5;
	ИначеЕсли ИнтервалГрафика = 3 Тогда
		ИнтервалВремени = 30;	
	КонецЕсли;
	
	Возврат ИнтервалВремени;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Запретить выбранное значение.
//
// Параметры:
//  ВыбранноеЗначение	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЗапретитьВыбранноеЗначение(ВыбранноеЗначение)
	
	Если ВыбранноеЗначение = Перечисления.СтатусыСобытия.ПриемНачат
		ИЛИ ВыбранноеЗначение = Перечисления.СтатусыСобытия.ПриемОкончен Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

&НаСервере
// Процедура - Установить даты.
//
Процедура УстановитьДаты()
	
	Если Объект.Услуги.Количество() <> 0 Тогда
		ТаблицаУслуги = Объект.Услуги.Выгрузить();
		ТаблицаУслуги.Сортировать("ДатаНачала");
		ДатаНачала = ТаблицаУслуги[0].ДатаНачала;
		ТаблицаУслуги.Сортировать("ДатаОкончания УБЫВ");
		ДатаОкончания = ТаблицаУслуги[0].ДатаОкончания;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Устанавливает списки выбора для элементов выбора времени начала и окончания услуг
// Это вынужденная мера, т.к. в платформе 8.3.4 есть косяк со списками выбора
//
Процедура ПроинициализироватьЭлементыВыбораВремени()

	МассивИнициализируемыхЭлементов = Новый Массив;
	МассивИнициализируемыхЭлементов.Добавить("УслугиДатаНачала");
	
	МассивПериодов = Новый Массив;
	МассивПериодов.Добавить(ПериодРаботыСЕ);
	СписокВремени = ВернутьСписокВремени(МассивПериодов, Истина, ОпределнениеИнтервалаВремени(ИнтервалГрафика));
	
	Для Каждого ИмяЭлемента Из МассивИнициализируемыхЭлементов Цикл
		
		Элементы[ИмяЭлемента].СписокВыбора.Очистить();
		Для Каждого ПредставлениеВремени Из СписокВремени Цикл
			Элементы[ИмяЭлемента].СписокВыбора.Добавить(ПредставлениеВремени.Значение, ПредставлениеВремени.Представление);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ПроинициализироватьЭлементыВыбораВремени()

&НаКлиенте
// Функция возвращает интервалы времени
// 
//  Параметры
//   МассивПериодов - структура, периоды, между которыми необходимо возвратить интервалы
//   Интервал - число, интервал в минутах
//   Формат - строка, представление интервала
//
// Возвращаемое значение:
//   СписокЗначений, список времени с интервалом.
//
Функция ВернутьСписокВремени(МассивПериодов, ДатаНачала, Интервал = 15, Формат = "ДФ=ЧЧ:мм")

	СписокВремени = Новый СписокЗначений;
	
	Для Каждого Период Из МассивПериодов Цикл
		Если ДатаНачала Тогда
			Индекс = 0;
		Иначе
			Индекс = 1;
		КонецЕсли;
		Период.ДатаНачала = НачалоЧаса(Период.ДатаНачала) + Цел (Минута(Период.ДатаНачала) / 15) * 15 * 60;
		Пока Период.ДатаНачала + Интервал * 60 * Индекс <= Период.ДатаОкончания Цикл
			Время = Период.ДатаНачала + Интервал * 60 * Индекс;
			Если СписокВремени.НайтиПоЗначению(Время) = Неопределено Тогда
				Если не ЗначениеЗаполнено(Время) Тогда
					СписокВремени.Добавить(Время, "00:00");
				Иначе
					СписокВремени.Добавить(Время, Формат(Время, Формат));
				КонецЕсли;
			КонецЕсли;			
			Индекс = Индекс + 1;
		КонецЦикла;
		Если Период.ДатаОкончания = Дата(01,01,01,23,59,59) и не ДатаНачала Тогда
			СписокВремени.Добавить(Период.ДатаНачала + Интервал * 60 * Индекс, "24:00");
		КонецЕсли;
	КонецЦикла;

	Возврат СписокВремени; 
	
КонецФункции

&НаСервере
// Процедура устанавливает видимость у надписи
// с гиперсылками "Открыть" и "ДобавитьУслуги"
//
Процедура ВывестиНезавершенныеНарядЗаказы()
	
	// Почистим группу перед добавлением в нее элементов
	Индекс = 0;
	КоличествоЭлементов = Элементы.НарядЗаказыВРаботе.ПодчиненныеЭлементы.Количество();	
	Пока Индекс < КоличествоЭлементов Цикл		
		ЭтаФорма.Элементы.Удалить(Элементы.НарядЗаказыВРаботе.ПодчиненныеЭлементы[0]);
		Индекс = Индекс + 1;
	КонецЦикла;            
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		МассивКонтрагентов 		= Новый Массив;
		МассивСтруктурныхЕдиниц = Новый Массив;
		МассивКонтрагентов.Добавить(Объект.Контрагент);
		МассивСтруктурныхЕдиниц.Добавить(Объект.СтруктурнаяЕдиница);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВложенныйЗапрос.Ссылка КАК НарядЗаказ,
		               |	ВложенныйЗапрос.Ссылка.Контрагент КАК Контрагент,
		               |	ВложенныйЗапрос.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	ВложенныйЗапрос.Ссылка.Дата КАК Дата,
		               |	"""" КАК СтрокаКлюч
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		НарядЗаказЗапасы.Ссылка КАК Ссылка
		               |	ИЗ
		               |		Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
		               |	ГДЕ
		               |		НарядЗаказЗапасы.Ссылка.Проведен
		               |		И НЕ НарядЗаказЗапасы.Ссылка.ПометкаУдаления
		               |		И (НарядЗаказЗапасы.Прием = ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
		               |				ИЛИ НарядЗаказЗапасы.Прием = НЕОПРЕДЕЛЕНО
		               |				ИЛИ НарядЗаказЗапасы.Прием = NULL)
		               |		И НарядЗаказЗапасы.Ссылка.Контрагент В(&МассивКонтрагентов)
		               |		И НарядЗаказЗапасы.Ссылка.СтруктурнаяЕдиница В(&МассивСтруктурныхЕдиниц)
		               |	
		               |	СГРУППИРОВАТЬ ПО
		               |		НарядЗаказЗапасы.Ссылка) КАК ВложенныйЗапрос
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата";
					   
		Запрос.УстановитьПараметр("МассивКонтрагентов"		, МассивКонтрагентов);
		Запрос.УстановитьПараметр("МассивСтруктурныхЕдиниц"	, МассивСтруктурныхЕдиниц);		
		
		// Для того, чтобы о наряд-заказах были прочитаны независимо от прав пользователя
		УстановитьПривилегированныйРежим(Истина);
		ТаблицаНезавершенныхНарядЗаказов.Загрузить(Запрос.Выполнить().Выгрузить());
		УстановитьПривилегированныйРежим(Ложь);
		
		Счетчик = 0;
		
		Для Каждого НарядЗаказ Из ТаблицаНезавершенныхНарядЗаказов Цикл
			НарядЗаказ.СтрокаКлюч = Строка(Счетчик);
			// Добавим группу   
			ЭлементГруппа                     = ЭтаФорма.Элементы.Добавить("ГруппаНарядЗаказа_" + НарядЗаказ.СтрокаКлюч, Тип("ГруппаФормы"), Элементы.НарядЗаказыВРаботе);
			ЭлементГруппа.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
			ЭлементГруппа.ОтображатьЗаголовок = Ложь;
			ЭлементГруппа.Отображение         = ОтображениеОбычнойГруппы.Нет;
			ЭлементГруппа.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;		   
			
			// Добавим элементы в эту группу
			ЭлементДекорация                           = ЭтаФорма.Элементы.Добавить("Декорация_Картинка_" + НарядЗаказ.СтрокаКлюч, Тип("ДекорацияФормы"), ЭлементГруппа);
			ЭлементДекорация.Вид                       = ВидДекорацииФормы.Картинка;
			
			// Определим стадию выполнеия наряд-заказа
			СтатусНарядЗакза = ВернутьСтатусНарядЗаказа(НарядЗаказ.НарядЗаказ);
			Если СтатусНарядЗакза 		= Перечисления.СтатусыНарядЗаказа.Заказано Тогда 
				ЭлементДекорация.Картинка 				   = БиблиотекаКартинок.СтатусЗаказано;
			ИначеЕсли СтатусНарядЗакза 	= Перечисления.СтатусыНарядЗаказа.ВРаботе Тогда 
			    ЭлементДекорация.Картинка 				   = БиблиотекаКартинок.СтатусВРаботе;
			ИначеЕсли СтатусНарядЗакза 	= Перечисления.СтатусыНарядЗаказа.Выполнено Тогда
			    ЭлементДекорация.Картинка 				   = БиблиотекаКартинок.СтатусВыполнено;
			КонецЕсли;
			ЭлементДекорация.Ширина = 2;
			ЭлементДекорация.Высота = 1;
			// -------------------------------
			ЭлементДекорация                          = ЭтаФорма.Элементы.Добавить("Декорация_НезавершенныйНарядЗаказ_" + НарядЗаказ.СтрокаКлюч, Тип("ДекорацияФормы"), ЭлементГруппа);
			ЭлементДекорация.Вид                      = ВидДекорацииФормы.Надпись;
			ЭлементДекорация.ГоризонтальноеПоложение  = ГоризонтальноеПоложениеЭлемента.Лево;
			ЭлементДекорация.Гиперссылка              = Истина;
			ЭлементДекорация.АвтоМаксимальнаяШирина   = Ложь;
			// ЭлементДекорация.Шрифт                    = Новый Шрифт( , , Истина, );
			ЭлементДекорация.Заголовок = "Наряд-заказ № " + Формат(ФормированиеПечатныхФорм.ПолучитьНомерНаПечатьПосле2011г(НарядЗаказ.НарядЗаказ.Номер, Истина, Истина),"ЧГ=0") + " от " + Сред(Формат(НарядЗаказ.Дата, "ДЛФ=DD"), 1, ?(СтрДлина(Формат(НарядЗаказ.Дата, "ДЛФ=DD")) > 0, СтрДлина(Формат(НарядЗаказ.Дата, "ДЛФ=DD")) - 1, 0)) + ", " + НарядЗаказ.НарядЗаказ.Сотрудник;
			ЭлементДекорация.УстановитьДействие("Нажатие", "ДекорацияНезавершенныйНарядЗаказНажатие");
			
			Счетчик = Счетчик + 1;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Функция - Вернуть статус наряд заказа.
//
// Параметры:
//  НарядЗаказ	 - 	 - 
// 
// Возвращаемое значение:
//   - 
Функция ВернутьСтатусНарядЗаказа(НарядЗаказ)
	
	ТаблицаЗапасыНЗ = НарядЗаказ.Запасы.ВыгрузитьКолонки();	
	Для Каждого СтрокаТабличнойЧасти Из НарядЗаказ.Запасы Цикл 
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Прием) Тогда 
			НоваяСтрока = ТаблицаЗапасыНЗ.Добавить();
	        ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТабличнойЧасти);
		КонецЕсли;	
	КонецЦикла;
	
	МассивСтрок_ЗАКАЗАНО 	= ТаблицаЗапасыНЗ.НайтиСтроки(Новый Структура("Статус", Перечисления.СтатусыНарядЗаказа.Заказано)); 
	МассивСтрок_ВРАБОТЕ 	= ТаблицаЗапасыНЗ.НайтиСтроки(Новый Структура("Статус", Перечисления.СтатусыНарядЗаказа.ВРаботе)); 
	МассивСтрок_ВЫПОЛНЕНО 	= ТаблицаЗапасыНЗ.НайтиСтроки(Новый Структура("Статус", Перечисления.СтатусыНарядЗаказа.Выполнено)); 
	
	Если МассивСтрок_ЗАКАЗАНО.Количество() = ТаблицаЗапасыНЗ.Количество() Тогда 
		Статус = Перечисления.СтатусыНарядЗаказа.Заказано;
	ИначеЕсли МассивСтрок_ВРАБОТЕ.Количество() > 0 Тогда 
		Статус = Перечисления.СтатусыНарядЗаказа.ВРаботе;
	ИначеЕсли МассивСтрок_ВЫПОЛНЕНО.Количество() = ТаблицаЗапасыНЗ.Количество() Тогда
		Статус = Перечисления.СтатусыНарядЗаказа.Выполнено;
	Иначе 
		Статус = Перечисления.СтатусыНарядЗаказа.ВРаботе;
	КонецЕсли;
	
	Возврат Статус;
	
КонецФункции

&НаСервере
// Процедура - Обновить надписи.
//
Процедура ОбновитьНадписи()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Долг 					= РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ПолучитьОстатокПоВзаиморасчетамСконтрагентом(Объект.Контрагент,, Объект.СтруктурнаяЕдиница);	
		ОстатокЛицевогоСчета 	= РегистрыНакопления.ДенежныеСредстваНаЛицевыхСчетах.ПолучитьОстаткиНаЛицевыхСчетахКонтрагента(Объект.Контрагент, ТекущаяДатаСеанса(),, Объект.СтруктурнаяЕдиница,,Истина);
		ЗапланированныеОплаты	= ОбщегоНазначенияСтоматология.ВернутьЗапланированныеОплаты(Объект.Контрагент);
	Иначе
		Долг = 0;
		ОстатокЛицевогоСчета = 0;
		ЗапланированныеОплаты = 0;
	КонецЕсли;

	// Декорация планируемых оплат контрагента
	Элементы.ДекорацияЗапланированныеОплаты.Заголовок = "Запланированные оплаты:";
	// Элементы.ДекорацияСуммаПланируемыхОплат.Заголовок = Формат(ЗапланированныеОплаты, "ЧЦ=15; ЧДЦ=2; ЧН=") + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
	Элементы.ДекорацияСуммаПланируемыхОплат.Заголовок = Формат(ЗапланированныеОплаты, "ЧЦ=15; ЧДЦ=2; ЧН=");
	Если ЗапланированныеОплаты > 0 Тогда 
		Элементы.ДекорацияЗапланированныеОплаты.ЦветТекста = Новый Цвет(220,140,0); // Новый Цвет(150, 95, 9);
		Элементы.ДекорацияСуммаПланируемыхОплат.ЦветТекста = Новый Цвет(220,140,0); // Новый Цвет(150, 95, 9);
	Иначе 
		Элементы.ДекорацияЗапланированныеОплаты.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
		Элементы.ДекорацияСуммаПланируемыхОплат.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
	КонецЕсли;
	
	// Декорация задолженности контрагента
	Элементы.ДекорацияЗадолженностьСумма.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
	Если Долг > 0 Тогда
		Элементы.ДекорацияЗадолженностьСумма.Заголовок = "Долг пациента:";
		// Элементы.ДекорацияДолг.Заголовок = Формат(Долг, "ЧЦ=15; ЧДЦ=2; ЧН=") + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
		Элементы.ДекорацияДолг.Заголовок = Формат(Долг, "ЧЦ=15; ЧДЦ=2; ЧН=");
		Элементы.ДекорацияЗадолженностьСумма.ЦветТекста = WebЦвета.Красный;
		Элементы.ДекорацияДолг.ЦветТекста = WebЦвета.Красный;			
	Иначе
		Элементы.ДекорацияЗадолженностьСумма.Заголовок = "Наш долг перед пациентом:";
		// Элементы.ДекорацияДолг.Заголовок = Формат(-Долг, "ЧЦ=15; ЧДЦ=2; ЧН=") + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
		Элементы.ДекорацияДолг.Заголовок = Формат(-Долг, "ЧЦ=15; ЧДЦ=2; ЧН=");
		Элементы.ДекорацияЗадолженностьСумма.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
		Элементы.ДекорацияДолг.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;				
	КонецЕсли;
	
	// Декорация остатка лицевого счета
	Элементы.ДекорацияОстаткиНаЛицевыхсчетах.Заголовок = "На лицевом счете пациента:";
	// Элементы.ДекорацияОстатокЛицевогоСчета.Заголовок = Формат(ОстатокЛицевогоСчета, "ЧЦ=15; ЧДЦ=2; ЧН=") + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
	Элементы.ДекорацияОстатокЛицевогоСчета.Заголовок = Формат(ОстатокЛицевогоСчета, "ЧЦ=15; ЧДЦ=2; ЧН=");
	Если ОстатокЛицевогоСчета < 0 Тогда
		Элементы.ДекорацияОстаткиНаЛицевыхсчетах.ЦветТекста = WebЦвета.Красный;
		Элементы.ДекорацияОстатокЛицевогоСчета.ЦветТекста = WebЦвета.Красный;
	Иначе
		Элементы.ДекорацияОстаткиНаЛицевыхсчетах.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
		Элементы.ДекорацияОстатокЛицевогоСчета.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
	КонецЕсли;
	ДатаСозданияОбращения = Формат(Объект.ДатаСоздания,"ДЛФ=DD");

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.ДекорацияАвторДатаВремяСоздания.Видимость = Истина;
		Элементы.ДекорацияАвторДатаВремяСоздания.Заголовок = "Создана " + Лев(ДатаСозданияОбращения, СтрДлина(ДатаСозданияОбращения) - 2) + " в " 
															+ Формат(Объект.ДатаСоздания, "ДФ=HH:mm")+ ", " 
															+ ПользователиСлужебныйКлиентСервер.ПолучитьКраткоеИмяПользователяИБНовый(Объект.АвторДокумента); 
	Иначе
		Элементы.ДекорацияАвторДатаВремяСоздания.Видимость = Ложь;
	КонецЕсли;
	Элементы.ДекорацияКартинкаНаправления.Видимость = Элементы.ДекорацияАвторДатаВремяСоздания.Видимость;
	
КонецПроцедуры

&НаСервере
// Процедура обновляет полисы медицинского страхования пациента.
//
Процедура ОбновитьПолисыМедицинскогоСтрахования(ПриСоздании = Ложь)
	
    МассивПолисовВсе = Справочники.ПолисыМедицинскогоСтрахования.ПолучитьАктивныеПолисыКонтрагента(Объект.Контрагент, Объект.Дата);
	
	Если МассивПолисовВсе.Количество() > 0 Или ЗначениеЗаполнено(Объект.ПолисМедСтрахования) Тогда
		Элементы.ГруппаПолисМедСтрахования.Видимость = Истина;  
		Элементы.ПолисМедСтрахования.СписокВыбора.Очистить();
		
		Если МассивПолисовВсе.Количество() > 0 Тогда
			Элементы.ПолисМедСтрахования.СписокВыбора.ЗагрузитьЗначения(МассивПолисовВсе); 
			
			Если ПриСоздании = Ложь ИЛИ (ПриСоздании = Истина И Объект.Ссылка.Пустая() И НЕ ЗначениеЗаполнено(Объект.ПолисМедСтрахования)) Тогда
				МассивПолисовДействующие = Справочники.ПолисыМедицинскогоСтрахования.ПолучитьАктивныеПолисыКонтрагента(Объект.Контрагент, Объект.Дата,,Ложь);
				Если МассивПолисовДействующие.Количество() > 0 Тогда
					Объект.ПолисМедСтрахования = МассивПолисовДействующие[0];	
				Иначе
					Объект.ПолисМедСтрахования = Неопределено;	
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;	
		
		ОтобразитьМеткуПолиса();
	Иначе
		Элементы.ГруппаПолисМедСтрахования.Видимость = Ложь;		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Процедура - Инициализировать комментарий
//
Процедура ИнициализироватьКомментарий()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) И (ЗначениеЗаполнено(Объект.Ссылка) ИЛИ ЗначениеЗаполнено(ТекущаяСделка)) Тогда 
		НаправившийВрач = РегистрыСведений.Профосмотры.ПолучитьНаправившегоВрача(Объект.Контрагент
																				, ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено)
																				, ?(ЗначениеЗаполнено(ТекущаяСделка), ТекущаяСделка, Неопределено));
		
		Элементы.ДекорацияАвторДатаВремяСоздания.Видимость = ЗначениеЗаполнено(НаправившийВрач) ИЛИ Элементы.ДекорацияАвторДатаВремяСоздания.Видимость;
		Если ЗначениеЗаполнено(НаправившийВрач) Тогда
			Элементы.ДекорацияКартинкаНаправления.Видимость = Истина;
			ДатаСозданияОбращения = Формат(Объект.ДатаСоздания,"ДЛФ=DD");			
			Элементы.ДекорацияАвторДатаВремяСоздания.Заголовок = СтрШаблон(НСтр("ru='По направлению от %1';en='In the direction from %1'")
																		, ОбщегоНазначения.ПолучитьЗначениеРеквизита(НаправившийВрач, "НаименованиеСокращенное"))
																		+ " записан " + Лев(ДатаСозданияОбращения, СтрДлина(ДатаСозданияОбращения) - 2) + " в " 
																		+ Формат(Объект.ДатаСоздания, "ДФ=HH:mm")+ ", " 
																		+ ПользователиСлужебныйКлиентСервер.ПолучитьКраткоеИмяПользователяИБНовый(Объект.АвторДокумента);
		Иначе 
			Элементы.ДекорацияКартинкаНаправления.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;																			
																				

	
	//Если НЕ ЭтоНовыйДок ИЛИ ЗначениеЗаполнено(СокрЛП(Объект.Комментарий)) ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСделка) Тогда 
	//	Возврат;
	//КонецЕсли;
	//
	//// формируем здесь, так как сделка инициализируется при создании формы
	//Объект.Комментарий = СокрЛП(ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекущаяСделка, "Описание"));	
	
КонецПроцедуры

&НаСервере
// Процедура - Услуги после удаления на сервере.
//
Процедура УслугиПослеУдаленияНаСервере()
	
	Если Объект.Услуги.Количество() > 0 Тогда 
		ТаблицаУслуги = Объект.Услуги.Выгрузить();
		Объект.Услуги.Очистить();
		Для Каждого СтрокаУслуга Из ТаблицаУслуги Цикл
			Если СтрокаУслуга.НомерСтроки = 1 Тогда 
				СледующаяДата = ДатаНачала;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаУслуга.Номенклатура) Тогда				
				НоваяСтрока = Объект.Услуги.Добавить();
				НоваяСтрока.ДатаНачала 		= СледующаяДата;
				НоваяСтрока.ДатаОкончания 	= НоваяСтрока.ДатаНачала + СтрокаУслуга.НормаВремени * 60;
			    НоваяСтрока.НормаВремени 	= СтрокаУслуга.НормаВремени;
				НоваяСтрока.Номенклатура 	= СтрокаУслуга.Номенклатура;
				НоваяСтрока.Сотрудник 		= СтрокаУслуга.Сотрудник;
				НоваяСтрока.Помещение 		= СтрокаУслуга.Помещение;
				НоваяСтрока.ПричинаЗаписи 	= СтрокаУслуга.ПричинаЗаписи;
				СледующаяДата = НоваяСтрока.ДатаОкончания;
			КонецЕсли;	
		КонецЦикла;
		
		УстановитьДаты();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура устанавливает видимость элементов.
//
Процедура УстановитьВидимостьЭлементов()
		
	Элементы.ГруппаПеренесеннаяЗапись.Видимость 	= ЗначениеЗаполнено(Объект.ПеренесённаяПредварительнаяЗапись);
	Если ЗначениеЗаполнено(Объект.ПеренесённаяПредварительнаяЗапись) Тогда 
		ДатаВремяЗаписи = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.ПеренесённаяПредварительнаяЗапись, "Дата");
		Элементы.ОткрытьПеренесеннуюЗапись.Заголовок = "Перезапись от " + Формат(ДатаВремяЗаписи, "ДФ='d MMM'','' H:mm'");
	КонецЕсли; 
		
	Если НЕ Объект.Резерв Тогда 
		Если Объект.Ссылка.Статус = Перечисления.СтатусыСобытия.ПриемОтменен Тогда
			Элементы.ПричинаОтмены.Видимость = Истина;
			Элементы.ПричинаОтмены.КнопкаОткрытия = Ложь;
			Элементы.ПричинаОтмены.ЦветТекста = Новый Цвет(77, 77, 77);
			Элементы.Выравнивание.Ширина = 71;
			Элементы.ГруппаФормаКнопкаОтменаПриема.Видимость    = Ложь; 
			Элементы.ГруппаФормаКнопкаЗаписатьНаПрием.Видимость = Истина; 
			Элементы.ГруппаФормаКнопкаПровестиИЗакрыть.ЦветФона = Новый Цвет(242, 242, 242);
			Элементы.ФормаКнопкаПровестиИЗакрыть.ЦветТекста     = Новый Цвет(51, 51, 51);
			СсылкаНаСобытие = ПолучитьПредварительнуюЗаписьОтмененногоСобытия(Объект.Ссылка);
			Если ЗначениеЗаполнено(СсылкаНаСобытие) Тогда 
				Элементы.ФормаКнопкаПерезаписать.Видимость         = Ложь;
				Элементы.АктуальнаяПредварительнаяЗапись.Видимость = Истина;
				Элементы.ГруппаФормаКнопкаЗаписатьНаПрием.ЦветФона = Новый Цвет(255, 255, 255);  
				ДатаВремяЗаписи = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СсылкаНаСобытие, "Дата");
				Элементы.АктуальнаяПредварительнаяЗапись.Заголовок = "Запись на " + Формат(ДатаВремяЗаписи, "ДФ='d MMM'','' H:mm'"); 
				Элементы.ФормаКнопкаВвестиПосещение.Доступность    = Ложь;
			КонецЕсли;	
			
		Иначе			
			Если Объект.Статус = Перечисления.СтатусыСобытия.ПриемОкончен ИЛИ Объект.Статус = Перечисления.СтатусыСобытия.ПриемНеСостоялся Тогда

			ИначеЕсли Объект.Ссылка.Статус = Перечисления.СтатусыСобытия.НеПодтверждена Или Объект.Ссылка.Статус = Перечисления.СтатусыСобытия.Подтверждена ИЛИ Объект.Ссылка.Статус = Перечисления.СтатусыСобытия.ПриемНеСостоялся Тогда
				Элементы.ФормаКнопкаВвестиПосещение.Картинка = БиблиотекаКартинок.Документ;   			
			ИначеЕсли Объект.Ссылка.Статус = Перечисления.СтатусыСобытия.ПриемНачат Тогда
				Элементы.ФормаКнопкаВвестиПосещение.Картинка = БиблиотекаКартинок.ДокументПроведен;				
			КонецЕсли;  			
			
			Элементы.ФормаКнопкаВвестиПосещение.Доступность = ?(НачалоДня(Объект.Дата) > НачалоДня(ТекущаяДатаСеанса()), Ложь, Истина);
			Элементы.ПричинаОтмены.Видимость = Ложь;
			Элементы.ПричинаОтмены.ТолькоПросмотр = Ложь;
			Элементы.ПричинаОтмены.КнопкаОткрытия = Истина;
			Элементы.Выравнивание.Ширина = ?(ЭтотОбъект.ЗапускВэбКлиент, 71, 70);	
			Элементы.ГруппаТело.Доступность = Истина;
			Элементы.ГруппаКоманднаяПанель.Доступность = Истина;
			Элементы.ГруппаКнопкиКоманднойПанели.Доступность = Истина;
		КонецЕсли;
		
	Иначе
		Элементы.ФормаКнопкаВвестиПосещение.Видимость = Ложь;
		Элементы.ГруппаКонтрагента.Видимость = Ложь;
		Элементы.ГруппаУслугТаблицей.Видимость = Ложь;
		Элементы.ГруппаУслугиПолемНоменклатура.Видимость = Ложь;
		Элементы.УслугиСотрудникПолем.Видимость = Ложь;
		Элементы.УслугиПомещениеПолем.Видимость = Ложь;
		Элементы.ГруппаИтог.Видимость = Ложь;
		Элементы.ПричинаОтмены.Видимость = Ложь;
		Элементы.ПричинаОтмены.ТолькоПросмотр = Ложь;
		Элементы.ПричинаОтмены.КнопкаОткрытия = Истина;
		Элементы.Выравнивание.Ширина = ?(ЭтотОбъект.ЗапускВэбКлиент, 71, 70);
		Элементы.ГруппаТело.Доступность = Истина;
		Элементы.ГруппаКоманднаяПанель.Доступность = Истина;
		Элементы.ГруппаКнопкиКоманднойПанели.Доступность = Истина;
		Элементы.Комментарий.РастягиватьПоВертикали = Истина;
		Элементы.Комментарий.Высота = 13;
		Элементы.Дата.Заголовок = "День резерва";
		Элементы.Статус.Видимость = Ложь;
		Элементы.ГруппаСтатус.Видимость = Ложь;
		ЭтаФорма.Заголовок = "Резерв времени (создание)";
		ЭтаФорма.АвтоЗаголовок = Ложь;
		Элементы.ГруппаКлиентскиеМетки.Видимость = Ложь;
		Элементы.ГруппаЦветРезерва.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ГруппировкаКнопкаУслуги.Ширина = ?(ЭтотОбъект.ЗапускВэбКлиент, 67, 66);
	НесколькоВрачейВОдномПриеме = Константы.НесколькоВрачейВОдномПриеме.Получить();
	Элементы.УслугиСотрудникПолем.Видимость = Не НесколькоВрачейВОдномПриеме;
	Элементы.УслугиПомещениеПолем.Видимость = Не НесколькоВрачейВОдномПриеме; 
	
	УстановитьВидимостьКнопокПереходаВМессенджер(ЭтотОбъект);
	Элементы.Декорация15.Видимость = НЕ (Элементы.ДобавитьИВыбратьКонтрагента.Видимость ИЛИ Элементы.ОткрытьДиалогСЧатБотом.Видимость ИЛИ Элементы.ПерейтиВЧат.Видимость);
	Элементы.ДекорацияПричинаОтмены.Видимость = Элементы.ПричинаОтмены.Видимость;
	
	УстановитьСвойстваЭлементамПодтвержденияЗаписи();
	
	Если РольДоступна("Администрирование") ИЛИ РольДоступна("ПолныеПрава") Тогда
		Элементы.ОбязательныеПоля.Видимость = Истина;
	КонецЕсли;	
	
	Элементы.ГруппаФормаКнопкаОтменаПриема.Видимость = Объект.Проведен;  
	Элементы.ФормаКнопкаОтменитьПрием.Доступность = НЕ (Объект.Статус = ПриемОкончен ИЛИ Объект.Статус = Перечисления.СтатусыСобытия.ПриемОтменен);	
	
	УстановитьВидимостьОсновныхКнопок();  
	
КонецПроцедуры  

&НаСервереБезКонтекста 
// Функция, возвращает ссылку на событие основаннное на переносе текущей записи.
//
Функция ПолучитьПредварительнуюЗаписьОтмененногоСобытия(ПредварительнаяЗапись)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Событие.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.Проведен
	|	И НЕ Событие.ПометкаУдаления
	|	И Событие.ПеренесённаяПредварительнаяЗапись = &ПеренесённаяПредварительнаяЗапись");
	Запрос.УстановитьПараметр("ПеренесённаяПредварительнаяЗапись", ПредварительнаяЗапись);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

&НаСервереБезКонтекста
// Процедура - Доступ к чату по ролям
//
Функция ДоступКМессенджеруПоРолям()
	
	Возврат РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ИспользованиеМессенджера");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Процедура, устанавливает видимость кнопок перехода в мессенджер.
//
Процедура УстановитьВидимостьКнопокПереходаВМессенджер(Форма, СкрытьПереходВЧат = Ложь)
	
	Форма.Элементы.ПерейтиВЧат.Видимость = ?(
		СкрытьПереходВЧат,
		Ложь,
		Форма.ИспользуетсяРасширениеМессенджер И ЗначениеЗаполнено(Форма.ДанныеВнешнихСистемМессенджера) И Не ЗначениеЗаполнено(Форма.Объект.ИдентификаторДиалога) И ДоступКМессенджеруПоРолям());
	
	Форма.Элементы.ОткрытьДиалогСЧатБотом.Видимость = Форма.ИспользуетсяРасширениеМессенджер И ЗначениеЗаполнено(Форма.Объект.ИдентификаторДиалога) И ДоступКМессенджеруПоРолям();
		
КонецПроцедуры

&НаСервере
// Функция возвращает норму времени услуги.
//
Функция ВернутьНормыВремениУслуги(Услуга)
	
	Возврат Услуга.НормаВремени;
	
КонецФункции

&НаСервере
// Процедура обработчик команды вызывает форму настройки и редактирования цен.
//
Процедура ДобавитьЦеныКаждойЗаписиПакетом(МассивСтруктурыДанных)
	
	Для Каждого СтруктураДанные Из МассивСтруктурыДанных Цикл 
		СтруктураДанные = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "УслугиСотрудникНачалоВыбораЗавершение".
//
Процедура УслугиСотрудникНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ДополнительныеПараметры.Сотрудник = Результат.ВыбранноеЗначение;
		Если Результат.КорректировкаВремени<>-1 Тогда
			ДополнительныеПараметры.ДатаНачала = ДополнительныеПараметры.ДатаНачала + Результат.КорректировкаВремени;
			ДополнительныеПараметры.ДатаОкончания = ДополнительныеПараметры.ДатаОкончания + Результат.КорректировкаВремени;
		КонецЕсли;	 
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Функция, возвращает основное помещение сотрудника.
//
Функция ПолучитьПомещениеСотрудникаПоУмолчанию(Сотрудник, СтруктурнаяЕдиница)
	
	ОсновноеПомещение = РегистрыСведений.СвязкаПомещениеСотрудник.ПолучитьПомещениеСотрудникаПоУмолчанию(Сотрудник, СтруктурнаяЕдиница);
	Возврат ОсновноеПомещение;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик события "ПослеВыбораКонтрагента" 
//
Процедура ПослеВыбораКонтрагента(Результат, ДополнительныеПараметры)Экспорт 
	
	Если Результат <> Неопределено Тогда
		Объект.Контрагент = Результат; 
		КонтрагентПриИзменении(ДополнительныеПараметры.Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Ввести посещение завершение.
//
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
//
Процедура ВвестиПосещениеЗавершение(Результат, Параметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	СсылкаНаПрием = Результат;
	
	////	ЭтаФорма.Записать();
	Если ЗначениеЗаполнено(СсылкаНаПрием) Тогда
		
		// Элементы.ФормаКнопкаВвестиПосещение.Заголовок = "Открыть приём";

		НомерПриемаПолный = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СсылкаНаПрием, "Номер");
		НомерПриемаКраткий = ФормированиеПечатныхФорм.ПолучитьНомерНаПечатьПосле2011г(НомерПриемаПолный, Истина, Истина);
		Элементы.ФормаКнопкаВвестиПосещение.Заголовок = "Прием №"+НомерПриемаКраткий;
		
	КонецЕсли;
	
	ЭтаФорма.Прочитать();
	
	Если Объект.Статус = ПриемОкончен Тогда
		Элементы.ФормаКнопкаОтменитьПрием.Доступность = Ложь;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаНаПрием) И НЕ Объект.СсылкаНаПрием = СсылкаНаПрием Тогда 
		Объект.СсылкаНаПрием = СсылкаНаПрием;
		ЭтаФорма.Записать();
		Оповестить("ИзмененоСобытие");	
	КонецЕсли;
	// Элементы.ФормаКнопкаВвестиПосещение.Доступность = Ложь;
	// ЭтаФорма.ТолькоПросмотр = Истина;
	// Элементы.Контрагент.Доступность = Ложь;
	// Элементы.ДобавитьИВыбратьКонтрагента.Видимость = Ложь;
	// Элементы.СтруктурнаяЕдиницаНадпись.Доступность = Ложь;
	
	Оповестить("ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ");
	
КонецПроцедуры
&НаКлиенте
// Функция проверяет данные для добавления в услуги на правельность заполнения.
//
Функция ПроверитьВозможностьДобавленияЗаписи(ПараметрыЗаписи, ВыдаватьСообщение = Истина)
	
	Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
		
		// Если ПараметрыЗаписи <> СтрокаТЧ
		//	И (ПараметрыЗаписи.ДатаНачала >= СтрокаТЧ.ДатаНачала И ПараметрыЗаписи.ДатаНачала < СтрокаТЧ.ДатаОкончания 
		//		ИЛИ ПараметрыЗаписи.ДатаОкончания > СтрокаТЧ.ДатаНачала И ПараметрыЗаписи.ДатаОкончания <= СтрокаТЧ.ДатаОкончания
		//		ИЛИ СтрокаТЧ.ДатаНачала >= ПараметрыЗаписи.ДатаНачала И СтрокаТЧ.ДатаНачала < ПараметрыЗаписи.ДатаОкончания 
		//		ИЛИ СтрокаТЧ.ДатаОкончания > ПараметрыЗаписи.ДатаНачала И СтрокаТЧ.ДатаОкончания <= ПараметрыЗаписи.ДатаОкончания) Тогда
		//	Если ВыдаватьСообщение Тогда
		//		Сообщить("Клиент на текущее время занят!");
		//	КонецЕсли;
		//	Возврат Ложь;
		// КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
// Функция - Количество помещений сотрудника.
//
// Параметры:
//  Сотрудник	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция КоличествоПомещенийСотрудника(Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	СвязкаПомещениеСотрудник.Помещение
	|ИЗ
	|	РегистрСведений.СвязкаПомещениеСотрудник КАК СвязкаПомещениеСотрудник
	|ГДЕ
	|	СвязкаПомещениеСотрудник.Сотрудник = &Сотрудник";
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат.Количество();
	
КонецФункции

&НаСервере
// Процедура, обработчик события "ПриИзменении" поля "Контрагент" на сервере.
//
Процедура КонтрагентПриИзмененииСервер()
	
	ОбновитьНадписи();
	Объект.ПолисМедСтрахования = Справочники.ПолисыМедицинскогоСтрахования.ПустаяСсылка();
	ОбновитьПолисыМедицинскогоСтрахования();
	ВывестиНезавершенныеНарядЗаказы();
	УправлениеИнтерфейсамиСервер.ОбновитьВиджетСделки(ЭтаФорма, Объект.Контрагент, Объект.Сделка);
	ИнициализироватьКомментарий();
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ЭтотОбъект.ДанныеВнешнихСистемМессенджера = ПолучитьДоступныеВнешниеСистемыМессенджера(Объект.Контрагент, Объект.СтруктурнаяЕдиница);
		УстановитьВидимостьКнопокПереходаВМессенджер(ЭтотОбъект);
		Элементы.ДобавитьИВыбратьКонтрагента.Видимость = Ложь;
	Иначе
		Элементы.ДобавитьИВыбратьКонтрагента.Видимость = Истина;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьТаблицуМеток();
	КонецЕсли;
	ОбновитьМетки();
	
	УстановитьВидимостьЭлементов();
	
	// Выводим комментарий из карточки клиента в подсказку
	КомментарийКонтрагента = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.Контрагент, "Комментарий");
	Если ЗначениеЗаполнено(Объект.Контрагент) И ЗначениеЗаполнено(КомментарийКонтрагента) Тогда 
		Элементы.КонтрагентРасширеннаяПодсказка.Заголовок = КомментарийКонтрагента;	
		Элементы.Контрагент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	Иначе 
		Элементы.Контрагент.ОтображениеПодсказки = ОтображениеПодсказки.Авто;
	КонецЕсли;
	
	МассивРодителей = Новый Массив();
	МассивРодителей.Добавить("ГруппаДолгиКонтрагентаСуществующие");
	МассивРодителей.Добавить("ГруппаБудущиеСобытияКлиента");
	ОтображениеДополнительнойИнформации(МассивРодителей);
	
КонецПроцедуры

&НаСервере
// Функция возвращает статус контрагента.
//
Функция СтатусКонтрагента(Контрагент)
	
	Возврат РегистрыСведений.СтатусыКонтрагентов.СтатусКонтрагента(Контрагент);
	
КонецФункции

&НаСервере
// Функция - Получить ссылку метки.
//
// Параметры:
//  НаименованиеМетки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСсылкуМетки(НаименованиеМетки)
	
	Возврат Справочники.Метки.НайтиПоНаименованию(НаименованиеМетки);
	
КонецФункции

&НаСервереБезКонтекста
// Проверка интервала рабочего времени. 
//
Функция ПроверитьВхождениеИнтервалаВРабочееВремяСотрудника(Период,ДатаНачала,ДатаОкончания,Сотрудник,СтруктурнаяЕдиница)
	
	Возврат РегистрыСведений.ВремяРаботыСотрудниковПлан.ПроверитьРаботаетЛиСотрудникВпериодВремя(Период,ДатаНачала,ДатаОкончания,Сотрудник,СтруктурнаяЕдиница);
	
КонецФункции

&НаСервереБезКонтекста
// Установка интервала рабочего времени сотрудника в план.
//
Процедура УставитьИнтервалРабочегоВремениСотрудника(ДатаНачала,ДатаОкончания,Сотрудник,СтруктурнаяЕдиница)
	
	РегистрыСведений.ВремяРаботыСотрудниковПлан.УстановкаРабочегоВремениСотрудника(СтруктурнаяЕдиница, Сотрудник, Истина, ДатаНачала, ДатаОкончания);  	
	
КонецПроцедуры

&НаСервере
// Инициировать обновление клиентских меток.
//
Процедура ОбновитьМетки()
	
	РегистрыСведений.МеткиКлиентов.СоздатьВизуальныеЭлементыМеток(Объект.Ссылка, ЭтаФорма, Элементы.ГруппаКлиентскиеМетки, Ложь);
	
КонецПроцедуры

&НаСервере
// Обработать запись проведенных изменений меток.
//
Процедура ЗаписатьИзмененияМеток(ТекущийОбъект)
	
	Период = ТекущаяДатаСеанса();
	
	НаборЗаписей = РегистрыСведений.МеткиКлиентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Клиент.Установить(ТекущийОбъект.Ссылка);
	
	МеткаПервичногоДобавлена = Ложь;
	
	Для Каждого ДанныеМетки ИЗ ЭтотОбъект.ТаблицаМеток Цикл
		
		Если ДанныеМетки.Активна = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеМетки.Метка = Справочники.Метки.Первичный Тогда
			МеткаПервичногоДобавлена = Истина;
		КонецЕсли;
		
		НоваяМетка			 = НаборЗаписей.Добавить();
		НоваяМетка.Период	 = Период;
		НоваяМетка.Клиент	 = ТекущийОбъект.Ссылка;
		НоваяМетка.Метка	 = ДанныеМетки.Метка;
		НоваяМетка.Автор	 = ПараметрыСеанса.ТекущийПользователь;
		НоваяМетка.Активна	 = Истина;
		
	КонецЦикла;
	
	Если МеткаПервичногоДобавлена = Ложь Тогда
		
		СтатусПациента = СтатусКонтрагента(ТекущийОбъект.Контрагент);
		
		Если СтатусПациента = Перечисления.СтатусыКонтрагентов.Потенциальный Или СтатусПациента = Неопределено Тогда
			
			НоваяМетка			 = НаборЗаписей.Добавить();
			НоваяМетка.Период	 = Период;
			НоваяМетка.Клиент	 = ТекущийОбъект.Ссылка;
			НоваяМетка.Метка	 = Справочники.Метки.Первичный;
			НоваяМетка.Автор	 = ПараметрыСеанса.ТекущийПользователь;
			НоваяМетка.Активна	 = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
// Процедура заполняет таблицу меток разрешенными метками и устанавливает значиния их активности.
//
Процедура ЗаполнитьТаблицуМеток()
	
	ТаблицаМеток.Очистить();
	
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Метки.Ссылка КАК Метка,
		|	Метки.Наименование КАК ПредставлениеМетки,
		|	Метки.ЦветМетки КАК ЦветМетки,
		|	Метки.ЦветТекстаБелый КАК ЦветТекстаБелый,
		|	ЕСТЬNULL(МеткиКлиентов.Активна, ЛОЖЬ) КАК Активна
		|ИЗ
		|	Справочник.Метки КАК Метки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МеткиКлиентов КАК МеткиКлиентов
		|		ПО Метки.Ссылка = МеткиКлиентов.Метка
		|			И (МеткиКлиентов.Клиент = &Ссылка)
		|ГДЕ
		|	Метки.ИспользоватьДляПредварительнойЗаписи
		|	И НЕ Метки.ПометкаУдаления";	
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МеткиКлиентов.Метка КАК Метка,
		|	МеткиКлиентов.Активна КАК Активна
		|ПОМЕСТИТЬ МеткиДокументаКлиента
		|ИЗ
		|	РегистрСведений.МеткиКлиентов КАК МеткиКлиентов
		|ГДЕ
		|	МеткиКлиентов.Клиент = &Ссылка
		|	И МеткиКлиентов.Активна
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Метки.Ссылка КАК Метка,
		|	ЕСТЬNULL(МеткиДокументаКлиента.Активна, ЛОЖЬ) КАК Активна,
		|	Метки.Наименование КАК ПредставлениеМетки,
		|	Метки.ЦветМетки КАК ЦветМетки,
		|	Метки.ЦветТекстаБелый КАК ЦветТекстаБелый
		|ИЗ
		|	Справочник.Метки КАК Метки
		|		ЛЕВОЕ СОЕДИНЕНИЕ МеткиДокументаКлиента КАК МеткиДокументаКлиента
		|		ПО Метки.Ссылка = МеткиДокументаКлиента.Метка
		|ГДЕ
		|	Метки.ИспользоватьДляПредварительнойЗаписи
		|	И НЕ Метки.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПредставлениеМетки";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Контрагент);
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Метка Из Результат Цикл
		
		СтрокаТаблицы = ТаблицаМеток.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Метка);
		
		Если ЗначениеЗаполнено(Метка.ЦветМетки) Тогда
			
			ЦветМетки = ЗначениеИзСтрокиВнутр(Метка.ЦветМетки);
			
			Если ЦветМетки.Вид = ВидЦвета.АвтоЦвет Или (ЦветМетки.Красный = 255 И ЦветМетки.Зеленый = 255 И ЦветМетки.Синий = 255) Тогда
				ЦветФона = Новый Цвет(242, 242, 242);
			Иначе
				ЦветФона = ЦветМетки;
			КонецЕсли;
			
		Иначе
			ЦветФона = Новый Цвет(242, 242, 242);
			
		КонецЕсли;
		
		СтрокаТаблицы.ЦветФона = ЦветФона;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
// Функция возвращает метки по ссылке.
//
Функция ПолучитьМеткиПоСсылке(Ссылка)
	
	Возврат РегистрыСведений.МеткиКлиентов.ПолучитьМеткиКлиента(Ссылка, ТекущаяДата()).ВыгрузитьКолонку("Метка");
	
КонецФункции

&НаСервере
// Процедура изменяет устанавливает в значение реквизита - цвет фона.
//
Процедура ИзменитьЦветФонаРезерва(Цвет)
	
	Объект.ЦветФонаРезерва = ЗначениеВСтрокуВнутр(Цвет);
	Элементы.УстановкаЦвет.ЦветФона = Цвет;	
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Проверить необходимость информирования по дню рождения контрагента.
//
// Параметры:
//  Контрагент	 - 	 - 
//  Дата		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПроверитьНеобходимостьИнформированияПоДнюРожденияКонтрагента(Контрагент, Дата = Неопределено)
	
	Возврат Справочники.Контрагенты.ПроверитьНеобходимостьИнформированияПоДнюРожденияКонтрагента(Контрагент, Дата);
	
КонецФункции

&НаКлиенте
// Процедура, обработчик события "СтруктурнаяЕдиницаНадписьНажатиеЗавершение".
//
Процедура СтруктурнаяЕдиницаНадписьНажатиеЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
	   ИзменитьСтруктурнуюЕдиницуНаСервере(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Изменить структурную единицу на сервере.
//
Процедура ИзменитьСтруктурнуюЕдиницуНаСервере(Знач Результат)
	
	Если Объект.СтруктурнаяЕдиница <> Результат Тогда
		
		Объект.Услуги.Очистить();
		НоваяСтрокаОбъектУслуги = Объект.Услуги.Добавить();
		НоваяСтрокаОбъектУслуги.ДатаНачала    = ТекущаяДатаСеанса();
		НоваяСтрокаОбъектУслуги.ДатаОкончания = НоваяСтрокаОбъектУслуги.ДатаНачала + 3600;
		НоваяСтрокаОбъектУслуги.НормаВремени  = (НоваяСтрокаОбъектУслуги.ДатаОкончания - НоваяСтрокаОбъектУслуги.ДатаНачала) / 60;

		Объект.СтруктурнаяЕдиница = Результат;
		Элементы.ВыбратьСтруктурнуюЕдиницу.Заголовок = Объект.СтруктурнаяЕдиница;
		ОбновитьНадписи();
		ОбновитьПолисыМедицинскогоСтрахования();		
		ВывестиНезавершенныеНарядЗаказы();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура - Установить обязательные поля.
//
Процедура УстановитьОбязательныеПоля() 
	
	ХранилищеСтруктураОбязательныеПоля = Константы.ОбязательныеПоляСобытие.Получить();
	СтруктураОбязательныеПоля = ХранилищеСтруктураОбязательныеПоля.Получить();	
	Если СтруктураОбязательныеПоля <> Неопределено Тогда
		Для Каждого ОбязательноеПоле Из СтруктураОбязательныеПоля Цикл
			Если ОбязательноеПоле.Значение = Истина Тогда
				 Элементы[ОбязательноеПоле.Ключ].АвтоОтметкаНезаполненного = Истина; 
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
	
	НесколькоВрачейВОдномПриеме = Константы.НесколькоВрачейВОдномПриеме.Получить();
	
	Элементы.УслугиСотрудникПолем.АвтоОтметкаНезаполненного = Не НесколькоВрачейВОдномПриеме;		
		
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, обработчик события "ПолучитьСписокСотрудниковОрганизации".
//
Функция ПолучитьСписокСотрудниковОрганизации(СтруктурнаяЕдиница)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиСотрудников.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НЕ НастройкиСотрудников.Сотрудник.ЭтоГруппа
	|	И (НастройкиСотрудников.Сотрудник В
	|				(ВЫБРАТЬ
	|					СвязкаПомещениеСотрудник.Сотрудник
	|				ИЗ
	|					РегистрСведений.СвязкаПомещениеСотрудник КАК СвязкаПомещениеСотрудник
	|				ГДЕ
	|					СвязкаПомещениеСотрудник.Помещение.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)
	|			ИЛИ НЕ НастройкиСотрудников.Сотрудник В
	|					(ВЫБРАТЬ
	|						СвязкаПомещениеСотрудник.Сотрудник
	|					ИЗ
	|						РегистрСведений.СвязкаПомещениеСотрудник КАК СвязкаПомещениеСотрудник))
	|	И &СтруктурнаяЕдиница В (НастройкиСотрудников.СтруктурнаяЕдиница)
	|	И НастройкиСотрудников.Сотрудник.Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.Врач)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НастройкиСотрудников.Сотрудник.Представление");
	
	Запрос.Параметры.Вставить("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции

&НаСервере
// Процедура, обработчик события "УстановитьПараметрыВыбораСотрудника".
//
Процедура УстановитьПараметрыВыбораСотрудникаНаСервере()
	
	Сотрудник = ПолучитьСписокСотрудниковОрганизации(Объект.СтруктурнаяЕдиница);
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(Сотрудник));
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(НовыйПараметр); 		
	
	Элементы.УслугиСотрудникПолем.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры

&НаКлиенте
// Процедура, задает дату.
//
Процедура ПредставлениеВремяНачалаВизитаЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ПриИзменениеДатыВизитаНаСервере(Результат.НачалоПериода);
		
		ДатаПередИзменением = ДатаДокумента;
		ДатаДокумента = Объект.Дата; 
		
		Если Объект.Дата <> ДатаПередИзменением Тогда
			СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
			Если СтруктураДанные.РазностьДат <> 0 Тогда
				Объект.Номер = "";
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры  

&НаСервереБезКонтекста  
// Функция, Получить данные даты при изменении.
//
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	РазностьДат = ДвиженияДокументовСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением);
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", РазностьДат);
			
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
// Процедура, При изменение даты визита на сервере.
//
Процедура ПриИзменениеДатыВизитаНаСервере(НачалоПериода)
	
	Элементы.ПредставлениеВремяНачалаВизита.Заголовок = Формат(НачалоПериода, "ДЛФ=DD") + " (" + Формат(НачалоПериода, "ДФ=ддд") + ")";
	
	Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
		СтрокаТЧ.ДатаНачала = НачалоДня(НачалоПериода) + (СтрокаТЧ.ДатаНачала - НачалоДня(СтрокаТЧ.ДатаНачала));
		СтрокаТЧ.ДатаОкончания = НачалоДня(НачалоПериода) + (СтрокаТЧ.ДатаОкончания - НачалоДня(СтрокаТЧ.ДатаОкончания));
	КонецЦикла;
	ДатаНачала = Дата(Год(НачалоПериода), Месяц(НачалоПериода), День(НачалоПериода), Час(ДатаНачала), Минута(ДатаНачала), Секунда(ДатаНачала));
	ДатаОкончания = Дата(Год(НачалоПериода), Месяц(НачалоПериода), День(НачалоПериода), Час(ДатаОкончания), Минута(ДатаОкончания), Секунда(ДатаОкончания));
	Объект.Дата = ДатаНачала; // НачалоПериода
	ЗаполнитьСписокВремениНачалаУслуг(Элементы.УслугиДатаНачалаПолем, 0);
	СоздатьДинамическиеЭлементыГруппыЗапись();
	
КонецПроцедуры	

&НаСервере
// Процедура - Установить видимость основных кнопок.
//
Процедура УстановитьВидимостьОсновныхКнопок()
	
	ПустойОбъект = Объект.Ссылка.Пустая();
	
	ЦветВажного		 = ЦветаСтиля.ЦветВажного;
	ЦветФонаФормы	 = ЦветаСтиля.ЦветФонаФормы;
	НовыйЦвет		 = Новый Цвет();
	
	ЦветФонаСерыйВторостепенный = Новый Цвет(242, 242, 242);
	ЦветТекстаЧерный = Новый Цвет(77, 77, 77);
		
 	// Если прием не доступен по правам то скрываем кнопку открытия приема.
	МассивДоступныхСтруктурныхЕдиниц 			= ПолучитьМассивСтруктурныхЕдиницСотрудника();
	Элементы.ГруппаФормаКнопкаПрием.Видимость 	= МассивДоступныхСтруктурныхЕдиниц.Найти(Объект.СтруктурнаяЕдиница) <> Неопределено;
	
	Элементы.ГруппаФормаКнопкаПрием.ЦветФона			 = ?(ПустойОбъект, ЦветФонаСерыйВторостепенный, ЦветФонаСерыйВторостепенный); // ЦветФонаСерыйВторостепенный, ЦветВажного
	Элементы.ФормаКнопкаВвестиПосещение.ЦветТекста		 = ?(ПустойОбъект, ЦветТекстаЧерный, ЦветТекстаЧерный);   // ЦветТекстаЧерный, ЦветФонаФормы
	
	Элементы.ГруппаФормаКнопкаПровестиИЗакрыть.ЦветФона	 = ?(ПустойОбъект, ЦветВажного, ЦветВажного);
	Элементы.ФормаКнопкаПровестиИЗакрыть.ЦветТекста		 = ?(ПустойОбъект, ЦветФонаФормы, ЦветФонаФормы);

КонецПроцедуры

&НаСервере
// Процедура - Установить норму времени.
//
// Параметры:
//  КоличествоСтрокТаблицы	 - 	 - 
//  СтрокаТаблицыУслуг		 - 	 - 
//
Процедура УстановитьНормуВремени()
	
	Если Объект.Услуги.Количество() = 1 Тогда
		
		СтрокаТаблицыУслуг = Объект.Услуги[0];
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицыУслуг.Номенклатура)
			И (ЗначениеЗаполнено(СтрокаТаблицыУслуг.ПричинаЗаписи)
				И ЗначениеЗаполнено(СтрокаТаблицыУслуг.ПричинаЗаписи.НормаВремени)) Тогда
			// ПредыдущаяНормаВремени = СтрокаТаблицыУслуг.НормаВремени;
			СтрокаТаблицыУслуг.НормаВремени = СтрокаТаблицыУслуг.ПричинаЗаписи.НормаВремени;
			СтрокаТаблицыУслуг.ДатаОкончания = СтрокаТаблицыУслуг.ДатаНачала + СтрокаТаблицыУслуг.НормаВремени*60;
			
			// Выделим нужную ячейку длительности
			// ИзменитьЭлементДлительностиПриема(СтрокаТаблицыУслуг.НормаВремени, ПредыдущаяНормаВремени);
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Добавить первую услугу на сервере
//
Процедура ДобавитьПервуюУслугуНаСервере()
	СоздатьДинамическиеЭлементыГруппыЗапись();
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить первую услугу
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ДобавитьПервуюУслугу(Команда)
	Элементы.ГруппаУслугПолями.Видимость = Истина;
	Элементы.ГруппаКнопкаДобавитьУслуги.Видимость = Ложь;
	ДобавитьПервуюУслугуНаСервере();
КонецПроцедуры 

&НаКлиенте 
// Процедура, Обработчик события "ПослеВыбораНоменклатурыИзФормПодбораИВыбора"
//
Процедура ПослеВыбораНоменклатурыИзФормПодбораИВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Если ДополнительныеПараметры.ПризнакДобавитьСтрокуПриПодборе Тогда
			Элементы.Услуги.ДобавитьСтроку();
		КонецЕсли;
		Элементы.Услуги.ТекущиеДанные.Номенклатура = ?(ТипЗнч(Результат) = Тип("Структура"), Результат.Номенклатура, Результат);
		УслугиНоменклатураПриИзменении(ДополнительныеПараметры.Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Отменить прием
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОтменитьПрием(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтменитьПриемИЗакрытьФорму", ЭтаФорма);
	ОткрытьФорму("Справочник.ПричиныОтменыЗаписи.ФормаВыбора",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 

КонецПроцедуры

&НаКлиенте
// Процедура - Отменить прием и закрыть форму
//
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
//
Процедура ОтменитьПриемИЗакрытьФорму(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда 
		Объект.ПричинаОтмены = Результат;
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыСобытия.ПриемОтменен");
		ЭтаФорма.Записать();
		ЭтаФорма.Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Признак отзвона клиенту
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПризнакОтзвонаКлиенту(Команда)

	Если Объект.ТелефонныйЗвонок = Ложь Тогда
		Объект.ТелефонныйЗвонок = Истина;
		// Меняем также и статус события
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыСобытия.Подтверждена");
		УстановитьСвойстваЭлементамПодтвержденияЗаписи();		
	Иначе 
		
		Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыСобытия.Подтверждена") И ЗначениеЗаполнено(Объект.ИдентификаторДиалога) Тогда  
			
			ОписаниеОповещенияСменыСтатуса = Новый ОписаниеОповещения("ПриОтменеПодтвержденияЗаписи", ЭтотОбъект);
			СписокКнопок = Новый СписокЗначений;
			СписокКнопок.Добавить(КодВозвратаДиалога.Да	, НСтр("ru = 'Да'; en = 'Yes'"));
			СписокКнопок.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Нет'; en = 'Not'"));
			Если ИспользуетсяРасширениеМессенджер Тогда 
				СписокКнопок.Добавить("ПоказатьДиалог"	, НСтр("ru = 'Открыть диалог с чат-ботом'; en = 'Open a chatbot dialog'"));
			КонецЕсли;	
			ПоказатьВопрос(ОписаниеОповещенияСменыСтатуса
						, НСтр("ru = 'Прием подтвержден пациентом посредством чат-бота. Отменить подтверждение приема?'; en = 'The appointment is confirmed by the patient via a chatbot. Cancel confirmation of receipt?'")
						, СписокКнопок
						,
						, КодВозвратаДиалога.Нет
						, НСтр("ru = 'Вопрос пользователю'; en = 'Question to the user'"));
						
			Возврат;
		КонецЕсли;
		Объект.ТелефонныйЗвонок = Ложь;
		// Меняем также и статус события
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыСобытия.НеПодтверждена");
		УстановитьСвойстваЭлементамПодтвержденияЗаписи();
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
// Процедура - При отмене подтверждения записи
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  дополнительныеПараметры	 - 	 - 
//
Процедура ПриОтменеПодтвержденияЗаписи(РезультатВыбора, дополнительныеПараметры = Неопределено) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(РезультатВыбора) = Тип("КодВозвратаДиалога") Тогда 
		Если РезультатВыбора = КодВозвратаДиалога.Да Тогда 
			Объект.ТелефонныйЗвонок = Ложь;
			// Меняем также и статус события
			Объект.Статус 			= ПредопределенноеЗначение("Перечисление.СтатусыСобытия.НеПодтверждена");
			УстановитьСвойстваЭлементамПодтвержденияЗаписи();
		Иначе
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	Если ТипЗнч(РезультатВыбора) = Тип("Строка") Тогда 
		Если РезультатВыбора = "ПоказатьДиалог"	Тогда 
			ОткрытьДиалогСЧатБотом(Неопределено);			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

#Область УправлениеДлительностьюПриема

&НаСервере
// Процедура - Заполнить интервали длительности приема.
//
Процедура ЗаполнитьИнтервалиДлительностиПриема()
	
	Если Объект.Услуги.Количество() = 1 Тогда
		ТекущаяНормаВремени = Объект.Услуги[0].НормаВремени;
	Иначе
		ТекущаяНормаВремени = (Объект.Услуги[Объект.Услуги.Количество()-1].ДатаОкончания - Объект.Услуги[0].ДатаНачала) / 60;
	КонецЕсли;
			
	СписокИнтерваловДлительностиПриема.ЗагрузитьЗначения(РегистрыСведений.ДлительностиПриемов.ВернутьДлительностиПриемов(Истина));
	СписокИнтерваловДлительностиПриема.Вставить(0, Неопределено);
	
	Если НЕ СписокИнтерваловДлительностиПриема.НайтиПоЗначению(ТекущаяНормаВремени) = Неопределено Тогда
		СписокИнтерваловДлительностиПриема[0].Значение = "N";
	Иначе
		СписокИнтерваловДлительностиПриема[0].Значение = ТекущаяНормаВремени;
		СохранитьИлиУдалитьДлительностиПриемаНаСервере(ТекущаяНормаВремени);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Установить время длительности
//
Процедура УстановитьВремяДлительности(Команда)
	
	Если СписокИнтерваловДлительностиПриема[0].Значение <> "N" Тогда
		УдалитьЭтуДлительностьПриема(Команда);
		
		Если СписокИнтерваловДлительностиПриема[0].Значение = "N" Тогда
			
			// Скроем поле ввода если не завершили ввод времени, но нажали на созданную кнопку.
			
			ПолеВводаДлительность = Элементы.Найти("НовыйЭлементДлительностиПриема");	
			Если НЕ ПолеВводаДлительность = Неопределено Тогда
				ПолеВводаДлительность.Видимость = Ложь;
			КонецЕсли;
			
			КнопкаСохраненияДлительности = Элементы.Найти("СохранитьЭлементДлительностиПриема");
			Если НЕ КнопкаСохраненияДлительности = Неопределено Тогда
				КнопкаСохраненияДлительности.Видимость = Ложь;
			КонецЕсли;
			
		КонецЕсли;		
			
	Иначе
		ДлительностьНаТекущейКнопке = Число(СтрРазделить(ТекущийЭлемент.Имя, "_", Ложь)[1]);	
		
		ПолеВводаНовыйЭлементДлительностиПриема = Элементы.Найти("НовыйЭлементДлительностиПриема");
		Если НЕ ПолеВводаНовыйЭлементДлительностиПриема = Неопределено Тогда
			ПолеВводаНовыйЭлементДлительностиПриема.Видимость = Ложь;
		КонецЕсли;
		
		КнопкаСохранитьЭлементДлительностиПриема = Элементы.Найти("СохранитьЭлементДлительностиПриема");
		Если НЕ КнопкаСохранитьЭлементДлительностиПриема = Неопределено Тогда
			КнопкаСохранитьЭлементДлительностиПриема.Видимость = Ложь;	
		КонецЕсли;
		
		ИзменитьЭлементДлительностиПриема(ДлительностьНаТекущейКнопке, Неопределено, Ложь, ?(Элементы.Найти("ГруппаВыводаКнопокДлительности_0") = Неопределено, Неопределено, 0));
		ПересчетВремениОказанияУслуг(ДлительностьНаТекущейКнопке);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Изменить элемент длительности приема
//
Процедура ИзменитьЭлементДлительностиПриема(НовоеВремя, СтароеВремя, ПервоеОткрытиеФормы = Ложь, УдаляемаяДлительность = Неопределено)
	
	Если НовоеВремя = СтароеВремя Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементНовогоВремени = Элементы.Найти("ГруппаВыводаКнопокДлительности_"+НовоеВремя+"");
	ЭлементСтарогоВремени = Элементы.Найти("ГруппаВыводаКнопокДлительности_"+СтароеВремя+"");
	
	// Удаление/ перекраска старого элемента длительности.		
	
	ЭтоСтандартныйЭлементДлительности = СписокИнтерваловДлительностиПриема.НайтиПоЗначению(СтароеВремя);	
	
	Если ЭлементСтарогоВремени <> Неопределено Тогда // Такой элемент есть
		
		Если ЭтоСтандартныйЭлементДлительности <> Неопределено Тогда
			ЭлементСтарогоВремени.ЦветФона = Новый Цвет(242, 242, 242);
			ЭлементСтарогоВремени.ПодчиненныеЭлементы[0].ЦветТекста = Новый Цвет(77, 77, 77);	
		Иначе	
			СписокИнтерваловДлительностиПриема[0].Значение = СтароеВремя;
			УдалитьЭтуДлительностьПриема("УдалитьСтрокуТЧ");
			Возврат;	
		КонецЕсли;	
		
	Иначе // Такого элемента нет, перекрашиваем в серый все элементы.
		
		Для Каждого ГруппаСДлительностьюОбщая Из Элементы.ГруппаВыводаКнопокДлительности.ПодчиненныеЭлементы Цикл
			
			Для Каждого ГруппаСДлительностью Из ГруппаСДлительностьюОбщая.ПодчиненныеЭлементы Цикл
				Если ТипЗнч(ГруппаСДлительностью) = Тип("ГруппаФормы") Тогда
					ГруппаСДлительностью.ЦветФона = Новый Цвет(242, 242, 242);
					ГруппаСДлительностью.ПодчиненныеЭлементы[0].ЦветТекста = Новый Цвет(77, 77, 77);
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	// Создание/ покраска нового элемента длительности	
	Если НЕ ЭлементНовогоВремени = Неопределено И (НЕ ПервоеОткрытиеФормы ИЛИ СписокИнтерваловДлительностиПриема[0].Значение = "N") Тогда
		
		Если НЕ УдаляемаяДлительность = Неопределено Тогда
			СохранитьИлиУдалитьДлительностиПриемаНаСервере(?(НовоеВремя = 0, 0, Неопределено), УдаляемаяДлительность);
		КонецЕсли;
		
		КнопкаКнопкаДлительности_N = Элементы.Найти("КнопкаДлительности_N");
		Если НЕ КнопкаКнопкаДлительности_N = Неопределено Тогда
			КнопкаКнопкаДлительности_N.Видимость = Истина;	
		КонецЕсли;
		
		КнопкаУдалитьЭлементДлительностиПриема = Элементы.Найти("УдалитьЭлементДлительностиПриема");
		Если НЕ КнопкаУдалитьЭлементДлительностиПриема = Неопределено Тогда
			КнопкаУдалитьЭлементДлительностиПриема.Видимость = Ложь;	
		КонецЕсли;		
		
	Иначе // Создаем новый элемент времени
		
		Если НЕ ПервоеОткрытиеФормы Тогда
			СохранитьИлиУдалитьДлительностиПриемаНаСервере(НовоеВремя, УдаляемаяДлительность);			
		КонецЕсли;
		
		КнопкаУдалитьЭлементДлительностиПриема = Элементы.Найти("УдалитьЭлементДлительностиПриема");
		Если НЕ КнопкаУдалитьЭлементДлительностиПриема = Неопределено Тогда
			КнопкаУдалитьЭлементДлительностиПриема.Видимость = Истина;	
		КонецЕсли;
		
		КнопкаКнопкаДлительности_N = Элементы.Найти("КнопкаДлительности_N");
		Если НЕ КнопкаКнопкаДлительности_N = Неопределено Тогда
			КнопкаКнопкаДлительности_N.Видимость = Ложь;	
		КонецЕсли;
		
		СписокИнтерваловДлительностиПриема[0].Значение = НовоеВремя;
		ЭлементНовогоВремени = Элементы.Найти("ГруппаВыводаКнопокДлительности_"+НовоеВремя+"");
		
	КонецЕсли;
	
	ЭлементНовогоВремени.ЦветФона = Новый Цвет(25 , 116, 206);
	ЭлементНовогоВремени.ПодчиненныеЭлементы[0].ЦветТекста = Новый Цвет(255 , 255, 255);
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ИзменитьДлительностьПриема" 
//
Процедура ИзменитьДлительностьПриема(Команда)
		
	НажатаяКнопка = Элементы.Найти(ТекущийЭлемент.Имя);
	НажатаяКнопка.Видимость = Ложь;
		
	ЭтотОбъект.НовыйЭлементДлительностиПриема = ?(НажатаяКнопка.Имя = "КнопкаДлительности_N", 0, Число(СтрРазделить(ТекущийЭлемент.Имя, "_", Ложь)[1]));

	КнопкаСохранитьЭлементДлительностиПриема = Элементы.Найти("СохранитьЭлементДлительностиПриема");
	Если НЕ КнопкаСохранитьЭлементДлительностиПриема = Неопределено Тогда
		КнопкаСохранитьЭлементДлительностиПриема.Видимость = Истина;	
	КонецЕсли;
	
	СписокИнтерваловДлительностиПриема[0].Значение = ?(ЗначениеЗаполнено(ЭтотОбъект.НовыйЭлементДлительностиПриема), ЭтотОбъект.НовыйЭлементДлительностиПриема, "N");
 	
	КнопкаУдалитьЭлементДлительностиПриема = Элементы.Найти("УдалитьЭлементДлительностиПриема");
	Если НЕ КнопкаУдалитьЭлементДлительностиПриема = Неопределено Тогда
		КнопкаУдалитьЭлементДлительностиПриема.Видимость = Ложь;	
	КонецЕсли;	
	
	ПолеВводаНовыйЭлементДлительностиПриема = Элементы.Найти("НовыйЭлементДлительностиПриема");
	Если НЕ ПолеВводаНовыйЭлементДлительностиПриема = Неопределено Тогда
		ПолеВводаНовыйЭлементДлительностиПриема.Видимость = Истина;
		ЭтаФорма.ТекущийЭлемент =  ПолеВводаНовыйЭлементДлительностиПриема;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Сохранить новую длительность приема сервер
//
Процедура СохранитьИлиУдалитьДлительностиПриемаНаСервере(НоваяДлительность = Неопределено, УдаляемаяДлительность = Неопределено)
	
	Если НЕ УдаляемаяДлительность = Неопределено Тогда
		УдаляемыйЭлемент = Элементы.Найти("ГруппаВыводаКнопокДлительности_" + УдаляемаяДлительность);
		Если НЕ УдаляемыйЭлемент = Неопределено Тогда
			ЭтаФорма.Элементы.Удалить(УдаляемыйЭлемент);
		КонецЕсли;			
	КонецЕсли;
	
	Если НЕ НоваяДлительность = Неопределено Тогда	
		УправлениеСвойствамиСтоматология.ЗаполнитьШкалуДлительностиПриема(ЭтаФорма, "ГруппаВыводаКнопокДлительности", Неопределено, НоваяДлительность, Ложь);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "СохранитьНовуюДлительностьПриема" 
//
Процедура СохранитьНовуюДлительностьПриема(Команда) Экспорт
	
	НоваяДлительность = НовыйЭлементДлительностиПриема;
 	
	МаксимальнаяДлительностьТекПриема = ПолучитьМаксимальнуюДлительностьТекущегоПриема(Объект.Услуги[0].ДатаНачала,
																						Объект.СтруктурнаяЕдиница,
																						Объект.Услуги[0].Сотрудник,
																						ЭтотОбъект.ЭтоРабочееВремяСотрудника);
	
	Если НоваяДлительность > МаксимальнаяДлительностьТекПриема Тогда
		
		ЭтотОбъект.НовыйЭлементДлительностиПриема = МаксимальнаяДлительностьТекПриема;
		НоваяДлительность = МаксимальнаяДлительностьТекПриема;
		
	КонецЕсли;

	ДлительностьПоменялась = Истина;
	
	// Нажата раннее созданная кнопка
	Если СписокИнтерваловДлительностиПриема[0].Значение <> "N" Тогда
		
		ДлительностьНаТекущейКнопке = СписокИнтерваловДлительностиПриема[0].Значение;
		
		// Кастомная кнопка изменена пользователем
		Если ДлительностьНаТекущейКнопке <> НоваяДлительность Тогда
			
			Если Элементы.Найти("ГруппаВыводаКнопокДлительности_"+НоваяДлительность) = Неопределено Тогда // И НоваяДлительность <> 0
				// СохранитьИлиУдалитьДлительностиПриемаНаСервере(НоваяДлительность); // НовыйЭлементДлительностиПриема
				ФлагВремяНоль = Истина;
			ИначеЕсли Элементы.Найти("ГруппаВыводаКнопокДлительности_"+НоваяДлительность) <> Неопределено Тогда
				КнопкаКнопкаДлительности_N = Элементы.Найти("КнопкаДлительности_N");
				Если НЕ КнопкаКнопкаДлительности_N = Неопределено Тогда
					КнопкаКнопкаДлительности_N.Видимость = Истина;	
				КонецЕсли;
				ФлагВремяНоль = Ложь;
			КонецЕсли;
			
			ИзменитьЭлементДлительностиПриема(НоваяДлительность, Неопределено, Ложь, ДлительностьНаТекущейКнопке);
			
			КнопкаУдалитьЭлементДлительностиПриема = Элементы.Найти("УдалитьЭлементДлительностиПриема");
			Если НЕ КнопкаУдалитьЭлементДлительностиПриема = Неопределено Тогда
				КнопкаУдалитьЭлементДлительностиПриема.Видимость = ФлагВремяНоль;	
			КонецЕсли;
			ДлительностьНаТекущейКнопке = НоваяДлительность;
			
		ИначеЕсли ДлительностьНаТекущейКнопке = НоваяДлительность Тогда
			
			КнопкаУдалитьЭлементДлительностиПриема = Элементы.Найти("УдалитьЭлементДлительностиПриема");
			Если НЕ КнопкаУдалитьЭлементДлительностиПриема = Неопределено Тогда
				КнопкаУдалитьЭлементДлительностиПриема.Видимость = Истина;	
			КонецЕсли;
			ДлительностьПоменялась = Ложь;
			
		КонецЕсли;
		
		// ТекущаяНажатаяКнопка = Элементы.Найти(?(НоваяДлительность <> 0, "КнопкаДлительности_"+ДлительностьНаТекущейКнопке, "КнопкаДлительности_N"));
		ТекущаяНажатаяКнопка = Элементы.Найти("КнопкаДлительности_"+ДлительностьНаТекущейКнопке);
		Если НЕ ТекущаяНажатаяКнопка = Неопределено Тогда
			ТекущаяНажатаяКнопка.Видимость = Истина;
		КонецЕсли;
		СписокИнтерваловДлительностиПриема[0].Значение = ДлительностьНаТекущейКнопке;			
		
	Иначе
		
		// Пользователь нажал на кнопку N'
		
		ЭтоСтандартнаяКнопка = Элементы.Найти("ГруппаВыводаКнопокДлительности_"+НоваяДлительность);
		Если ЭтоСтандартнаяКнопка = Неопределено Тогда // и НоваяДлительность <> 0
			// СохранитьИлиУдалитьДлительностиПриемаНаСервере(НоваяДлительность);
			КнопкаУдалитьЭлементДлительностиПриема = Элементы.Найти("УдалитьЭлементДлительностиПриема");
			Если НЕ КнопкаУдалитьЭлементДлительностиПриема = Неопределено Тогда
				КнопкаУдалитьЭлементДлительностиПриема.Видимость = Истина;	
			КонецЕсли;
			СписокИнтерваловДлительностиПриема[0].Значение = НоваяДлительность;				
		ИначеЕсли ЭтоСтандартнаяКнопка <> Неопределено Тогда			
			
			КнопкаКнопкаДлительности_N = Элементы.Найти("КнопкаДлительности_N");
			Если НЕ КнопкаКнопкаДлительности_N = Неопределено Тогда
				КнопкаКнопкаДлительности_N.Видимость = Истина;	
			КонецЕсли;				
			СписокИнтерваловДлительностиПриема[0].Значение = "N";
			
		КонецЕсли;
		
		ИзменитьЭлементДлительностиПриема(НоваяДлительность, Неопределено);	
		
	КонецЕсли;
	
	Если ДлительностьПоменялась Тогда
		ПересчетВремениОказанияУслуг(НоваяДлительность);
	КонецЕсли;
	
	КнопкаСохранитьЭлементДлительностиПриема = Элементы.Найти("СохранитьЭлементДлительностиПриема");
	Если НЕ КнопкаСохранитьЭлементДлительностиПриема = Неопределено Тогда
		КнопкаСохранитьЭлементДлительностиПриема.Видимость = Ложь;	
	КонецЕсли;
	ПолеВводаНовыйЭлементДлительностиПриема = Элементы.Найти("НовыйЭлементДлительностиПриема");
	Если НЕ ПолеВводаНовыйЭлементДлительностиПриема = Неопределено Тогда
		ПолеВводаНовыйЭлементДлительностиПриема.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Удалить эту длительность приема, используется для удаления самостоятельно созданного времени приема
//
Процедура УдалитьЭтуДлительностьПриема(Команда)
	
	УдаляемаяДлительность = Неопределено;
	
	Если ТипЗнч(Команда) = Тип("КомандаФормы") Тогда 
	
		Если Команда.Имя = "УстановитьВремяДлительности" Тогда
		// Нажали на кнопку, созданную динамически.
		
			ДлительностьНаНажатойКнопке = Число(СтрРазделить(ТекущийЭлемент.Имя, "_", Ложь)[1]);
			
			Если СписокИнтерваловДлительностиПриема[0].Значение <> Неопределено И СписокИнтерваловДлительностиПриема[0].Значение <> "N" Тогда
				
				УдаляемаяДлительность = СписокИнтерваловДлительностиПриема[0].Значение;
				СписокИнтерваловДлительностиПриема[0].Значение = "N";
				
			КонецЕсли;
			
			НоваяДлительность = ДлительностьНаНажатойКнопке;
			

		ИначеЕсли Команда.Имя = "ДлительностьПриемаУдалить" Тогда  // УдалитьЭтуДлительностьПриема
		// Нажали на крестик.
		
			УдаляемаяДлительность = СписокИнтерваловДлительностиПриема[0].Значение;		
		    СписокИнтерваловДлительностиПриема[0].Значение = "N";
			НоваяДлительность = 0;
			
			КнопкаКнопкаДлительности_N = Элементы.Найти("КнопкаДлительности_N");
			Если НЕ КнопкаКнопкаДлительности_N = Неопределено Тогда
				КнопкаКнопкаДлительности_N.Видимость = Ложь;	
			КонецЕсли;
			КнопкаУдалитьЭлементДлительностиПриема = Элементы.Найти("УдалитьЭлементДлительностиПриема");
			Если НЕ КнопкаУдалитьЭлементДлительностиПриема = Неопределено Тогда
				КнопкаУдалитьЭлементДлительностиПриема.Видимость = Истина;	
			КонецЕсли;
	
		КонецЕсли;
		
		ПересчетВремениОказанияУслуг(НоваяДлительность);
		
		Если НЕ (НоваяДлительность = 0 И (УдаляемаяДлительность = 0 ИЛИ УдаляемаяДлительность = "N")) Тогда
			ИзменитьЭлементДлительностиПриема(НоваяДлительность, Неопределено, Ложь, УдаляемаяДлительность);		
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Команда) = Тип("Строка") Тогда
		// Удалили строку ТЧ.
		Если Команда = "УдалитьСтрокуТЧ" Тогда
			
			УдаляемаяДлительность = Неопределено;
			Если СписокИнтерваловДлительностиПриема[0].Значение <> "N" Тогда
				УдаляемаяДлительность = СписокИнтерваловДлительностиПриема[0].Значение;
			КонецЕсли;
			
			НоваяНормаВремени = ПосчитатьНормуВремениТЧУслуги();
			ПересчетВремениОказанияУслуг(НоваяНормаВремени);
			
			ИзменитьЭлементДлительностиПриема(НоваяНормаВремени, Неопределено, Ложь, УдаляемаяДлительность);
			
		    СписокИнтерваловДлительностиПриема[0].Значение = ?(СписокИнтерваловДлительностиПриема.НайтиПоЗначению(НоваяНормаВремени) = Неопределено, НоваяНормаВремени, "N");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Функция - Посчитать норму времени В ТЧ "Услуги"
// 
Функция ПосчитатьНормуВремениТЧУслуги()
	
	ТекущаяНормаВремени = 0;
	Для СтрокаУслуги = 1 по Объект.Услуги.Количество() Цикл
		ТекущаяНормаВремени = ТекущаяНормаВремени + Объект.Услуги[СтрокаУслуги-1].НормаВремени;	
	КонецЦикла;
	
	Возврат ТекущаяНормаВремени;
	
КонецФункции

&НаКлиенте
// Процедура - "ПересчетВремениОказанияУслуг", используется для пересчета времени приема в Табл. части Услуги 
//
Процедура ПересчетВремениОказанияУслуг(НоваяДлительность)
	
	Если Объект.Услуги.Количество() <= 1 Тогда
		Объект.Услуги[0].НормаВремени = НоваяДлительность;
		Объект.Услуги[0].ДатаОкончания = Объект.Услуги[0].ДатаНачала + (НоваяДлительность * 60);
			
	Иначе
		КоличествоСтрок = Объект.Услуги.Количество() - 1;
		
		СреднееВремяДлительностиОднойУслуги = Цел(НоваяДлительность / КоличествоСтрок);
		Если (НоваяДлительность % КоличествоСтрок) <> 0 Тогда
			ПоследняяДлительность = СреднееВремяДлительностиОднойУслуги + (НоваяДлительность % КоличествоСтрок);
			ЕстьОстаток = Истина;
		КонецЕсли;
		
		Для ТекущаяСтрока = 1 По Объект.Услуги.Количество() Цикл
			Если ЗначениеЗаполнено(Объект.Услуги[ТекущаяСтрока-1].Номенклатура) Тогда	
				Объект.Услуги[ТекущаяСтрока-1].НормаВремени = ?(ТекущаяСтрока = КоличествоСтрок И ЕстьОстаток = Истина, ПоследняяДлительность, СреднееВремяДлительностиОднойУслуги);
				Объект.Услуги[ТекущаяСтрока-1].ДатаНачала = ?(ТекущаяСтрока = 1, Объект.Услуги[0].ДатаНачала, Объект.Услуги[ТекущаяСтрока-2].ДатаОкончания);
				Объект.Услуги[ТекущаяСтрока-1].ДатаОкончания = ?(ТекущаяСтрока = 1, Объект.Услуги[0].ДатаНачала + (СреднееВремяДлительностиОднойУслуги * 60), Объект.Услуги[ТекущаяСтрока-1].ДатаНачала + ?(ТекущаяСтрока = КоличествоСтрок И ЕстьОстаток = Истина, (ПоследняяДлительность * 60), (СреднееВремяДлительностиОднойУслуги * 60)));
			ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Услуги[ТекущаяСтрока-1].Номенклатура) Тогда
				Объект.Услуги[Объект.Услуги.Количество()-1].ДатаНачала = Объект.Услуги[Объект.Услуги.Количество()-2].ДатаОкончания;
				// Объект.Услуги[Объект.Услуги.Количество()-1].ДатаОкончания = Объект.Услуги[Объект.Услуги.Количество()-1].ДатаОкончания + (СреднееВремяДлительностиОднойУслуги * 60);
				Объект.Услуги[Объект.Услуги.Количество()-1].ДатаОкончания = Объект.Услуги[Объект.Услуги.Количество()-1].ДатаНачала;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получает максимально возможную длительность для текущего приема
// 
Функция ПолучитьМаксимальнуюДлительностьТекущегоПриема(ВремяНачала, СтруктурнаяЕдиница, Сотрудник, ЭтоРабочееВремяСотрудника)

	ТЗСобытий = Документы.Событие.ФактСобытийЗаУказаныйПериод(
		ВремяНачала,
		КонецДня(ВремяНачала),
		СтруктурнаяЕдиница,
		Сотрудник);	
				
	Если ТЗСобытий.Количество() = 1 Тогда
		Возврат ( (ТЗСобытий[0].ДатаНачала - ВремяНачала) / 60 );		
	КонецЕсли;		
		
	ГрафикРаботыСотрудникаПолучен = Ложь;	
	Если ЭтоРабочееВремяСотрудника = Неопределено Тогда	
															
		ГрафикРаботыСотрудника = РегистрыСведений.ВремяРаботыСотрудниковПлан.ПроверитьРаботаетЛиСотрудникВпериодВремя(
			ВремяНачала,,,
			Сотрудник,
			СтруктурнаяЕдиница,,
			Истина);
			
		ГрафикРаботыСотрудникаПолучен = Истина;
		
		Если ГрафикРаботыСотрудника.Количество() = 1 Тогда	
			ЭтоРабочееВремяСотрудника = (ГрафикРаботыСотрудника[0].ДатаОкончания >= ВремяНачала);		
		Иначе
			ЭтоРабочееВремяСотрудника = Ложь;	
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоРабочееВремяСотрудника = Истина Тогда				
			
		Если НЕ ГрафикРаботыСотрудникаПолучен Тогда							
			ГрафикРаботыСотрудника = РегистрыСведений.ВремяРаботыСотрудниковПлан.ПроверитьРаботаетЛиСотрудникВпериодВремя(
				ВремяНачала,,,
				Сотрудник,
				СтруктурнаяЕдиница,,
				Истина); 	
		КонецЕсли;
			
		ПеременнаяКонецПериода = ГрафикРаботыСотрудника[0].ДатаОкончания;
					
	Иначе // Если сотрудник работает не по графику.
		
		ГрафикРаботыКлиники = Справочники.СтруктурныеЕдиницы.ВремяРаботыСтруктурнойЕдиницы(ВремяНачала, СтруктурнаяЕдиница);
		ПеременнаяКонецПериода = НачалоДня(ВремяНачала) + (ГрафикРаботыКлиники.ОкончаниеРаботы - Дата(1,1,1));

	КонецЕсли;
				
	Возврат ( (ПеременнаяКонецПериода - ВремяНачала) / 60 );				
		 	
КонецФункции

#КонецОбласти

&НаКлиенте
// Процедура - "УслугиДатаНачалаПолемОбработкаВыбора", Используется для пересчета времени начала приема
//
Процедура УслугиДатаНачалаПолемОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
		
	Если Объект.Услуги.Количество() = 1 Тогда
		Объект.Услуги[0].ДатаНачала = ВыбранноеЗначение;
		Объект.Услуги[0].ДатаОкончания = Объект.Услуги[0].ДатаНачала + (Объект.Услуги[0].НормаВремени * 60);
			
	Иначе
		
		Для ТекущаяСтрока = 1 По Объект.Услуги.Количество() Цикл
			
			Если ЗначениеЗаполнено(Объект.Услуги[ТекущаяСтрока-1].Номенклатура) Тогда	
				Объект.Услуги[ТекущаяСтрока-1].ДатаНачала = ?(ТекущаяСтрока = 1, ВыбранноеЗначение, Объект.Услуги[ТекущаяСтрока-2].ДатаОкончания);
				Объект.Услуги[ТекущаяСтрока-1].ДатаОкончания = Объект.Услуги[ТекущаяСтрока-1].ДатаНачала + (Объект.Услуги[ТекущаяСтрока-1].НормаВремени * 60);
				
			ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Услуги[ТекущаяСтрока-1].Номенклатура) Тогда
				Объект.Услуги[Объект.Услуги.Количество()-1].ДатаНачала = Объект.Услуги[Объект.Услуги.Количество()-2].ДатаОкончания;
				Объект.Услуги[Объект.Услуги.Количество()-1].ДатаОкончания = Объект.Услуги[Объект.Услуги.Количество()-1].ДатаНачала;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Объект.Дата = ВыбранноеЗначение;
	
	// Если поменяли время начала приема, надо изменить длительность, если есть другие записи	
	
	ТекущаяДлительностьПриема = ПосчитатьНормуВремениТЧУслуги();
	МаксимальнаяДлительностьТекПриема = ПолучитьМаксимальнуюДлительностьТекущегоПриема(ВыбранноеЗначение,
																						Объект.СтруктурнаяЕдиница,
																						Объект.Услуги[0].Сотрудник,
																						ЭтотОбъект.ЭтоРабочееВремяСотрудника);

 	Если ТекущаяДлительностьПриема > МаксимальнаяДлительностьТекПриема Тогда	
		ЭтотОбъект.НовыйЭлементДлительностиПриема = МаксимальнаяДлительностьТекПриема;	
		СохранитьНовуюДлительностьПриема(Неопределено);
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - Удалить все родственные связи контрагента на сервере
//
// Параметры:
//  СсылкаНового - 	 - 
//
Процедура УдалитьВсеРодственныеСвязиКонтрагентаНаСервере(СсылкаНовогоПациента)
	
	РегистрыСведений.РодственныеСвязи.УдалитьВсеРодственныеСвязиКонтрагента(СсылкаНовогоПациента);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Изменение рабочего времени при редактировании приема
//
Процедура ИзменениеРабочегоВремениПриРедактированииПриема(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если Результат = КодВозвратаДиалога.Да И ДополнительныеПараметры.Свойство("НесколькоВрачейВПриеме") <> Неопределено Тогда
			
			Если ДополнительныеПараметры.НесколькоВрачейВПриеме = Ложь Тогда
				УставитьИнтервалРабочегоВремениСотрудника(ДополнительныеПараметры.ВремяНачала, ДополнительныеПараметры.ВремяОкончания, ДополнительныеПараметры.Сотрудник, ДополнительныеПараметры.СтруктурнаяЕдиница);		
			Иначе
				
			ВремяУслугМассив = ДополнительныеПараметры.ДополнительныеПараметры;
			Для Каждого ВремяУслугиВрача Из ВремяУслугМассив Цикл
				УставитьИнтервалРабочегоВремениСотрудника(ВремяУслугиВрача.ВремяНачала, ВремяУслугиВрача.ВремяОкончания, ВремяУслугиВрача.ФИО, ДополнительныеПараметры.СтруктурнаяЕдиница);		
			КонецЦикла;
								
			КонецЕсли;
			
			ПризнакИзмененияВремениВрачей = Истина;
			
			ПараметрыЗаписи = Новый Структура;
			ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
			Если ЭтаФорма.Записать(ПараметрыЗаписи) Тогда 
				Если ЭтаФорма.Открыта() Тогда
					ЭтаФорма.Закрыть();	
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда Возврат;
		КонецЕсли;
		
	Иначе Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Изменение рабочего времени для нескольких врачей
//
Функция ИзменениеРабочегоВремениДляНесколькихВрачей(ТаблицаУслуги)
	
	ТаблицаВрачей = Новый ТаблицаЗначений;
	ТаблицаВрачей.Колонки.Добавить("ФИО");
	ТаблицаВрачей.Колонки.Добавить("ВремяНачала");
	ТаблицаВрачей.Колонки.Добавить("ВремяОкончания");
	
	Для Каждого СтрокаТЧ Из ТаблицаУслуги Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Сотрудник) Тогда
			// СтрокаТаблицы = ТаблицаВрачей.Найти(СтрокаТЧ.Сотрудник, "ФИО");	
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ФИО", СтрокаТЧ.Сотрудник); 
			СтрокаТаблицы = ТаблицаВрачей.НайтиСтроки(СтруктураПоиска);
			
			
			Если СтрокаТаблицы.Количество() = 0 Тогда
				НоваяСтрока = ТаблицаВрачей.Добавить();
				НоваяСтрока.ФИО = СтрокаТЧ.Сотрудник;
				НоваяСтрока.ВремяНачала = СтрокаТЧ.ДатаНачала;
				НоваяСтрока.ВремяОкончания = СтрокаТЧ.ДатаОкончания;
			Иначе
				ИндексСтроки = ТаблицаВрачей.Индекс(СтрокаТаблицы[СтрокаТаблицы.ВГраница()]);
				КоличествоСтрокПоИндексу = ТаблицаВрачей.Количество() - 1;
				
				Если ИндексСтроки = КоличествоСтрокПоИндексу Тогда
					// Строка с этим врачем находится в конце списка
				    ТаблицаВрачей[ИндексСтроки].ВремяОкончания = СтрокаТЧ.ДатаОкончания;
				Иначе
					НоваяСтрока = ТаблицаВрачей.Добавить();
					НоваяСтрока.ФИО = СтрокаТЧ.Сотрудник;
					НоваяСтрока.ВремяНачала = СтрокаТЧ.ДатаНачала;
					НоваяСтрока.ВремяОкончания = СтрокаТЧ.ДатаОкончания;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;			
	КонецЦикла;
	
	// После обработки услуг перенесем все в массив для работы на клиенте:
	
	ВремяУслугМассив = Новый Массив();
    СтруктураСтрокой = "";
    НужнаЗапятая = Ложь;
	
    Для Каждого Колонка Из ТаблицаВрачей.Колонки Цикл
		
		Если НужнаЗапятая Тогда
            СтруктураСтрокой = СтруктураСтрокой + ",";
		КонецЕсли;
		
        СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
        НужнаЗапятая = Истина;
		
	КонецЦикла;
	
    Для Каждого Строка Из ТаблицаВрачей Цикл
		
		НоваяСтрока = Новый Структура(СтруктураСтрокой);
        ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
        ВремяУслугМассив.Добавить(НоваяСтрока);
		
    КонецЦикла;
		
	// Убираем рабочие куски времени из массива, чтобы потом не обрабатывать все строки (не делать рабочее время там, где оно уже рабочее), а только необходимые	
	Для ИтераторОбходаМассива = 0 По ВремяУслугМассив.ВГраница() Цикл
		
		// Без этого не работает
		Если ИтераторОбходаМассива > ВремяУслугМассив.ВГраница() Тогда Прервать; КонецЕсли;
		
		СтрокаПроверкаРабочегоВремени = ВремяУслугМассив.Получить(ИтераторОбходаМассива);
		ВремяРабочее = ПроверитьВхождениеИнтервалаВРабочееВремяСотрудника(СтрокаПроверкаРабочегоВремени.ВремяНачала , СтрокаПроверкаРабочегоВремени.ВремяНачала, СтрокаПроверкаРабочегоВремени.ВремяОкончания, СтрокаПроверкаРабочегоВремени.ФИО, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);	 			
		
		Если ВремяРабочее Тогда
			ВремяУслугМассив.Удалить(ИтераторОбходаМассива);
			ИтераторОбходаМассива = ИтераторОбходаМассива - 1;
		КонецЕсли;
		
	КонецЦикла;
	
	
	Возврат (ВремяУслугМассив);
	
КонецФункции

// Процедура - Обработчик созданного пользователем элемента длительности при его изменении
//
&НаКлиенте
Процедура НовыйЭлементДлительностиПриемаПриИзменении(Элемент)
	СохранитьНовуюДлительностьПриема(Неопределено);
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Вернуть константу несколько врачей в одном приеме
// 
Функция ВернутьКонстантуНесколькоВрачейВОдномПриеме()
	Возврат Константы.НесколькоВрачейВОдномПриеме.Получить();
КонецФункции

&НаКлиенте
// Процедура - Определение пола при изменении ФИО
//
Процедура Наименование__НовыйПациентПриИзменении(Элемент)
	
	 ОпределитьПолНовогоПациента();
	 
КонецПроцедуры

&НаКлиенте
// Процедура - Определить пол нового пациента
//
Процедура ОпределитьПолНовогоПациента()
	
	// Заполняем пол клиента, если он не был заполнен ранее
	ПолКлиента = ОбщегоНазначенияКлиентПовтИспСтоматология.ОпределитьПолКлиента(Фамилия_НовыйПациент, Имя_НовыйПациент, Отчество_НовыйПациент);
	Если ПолКлиента = "Мужской" Тогда
		Пол_НовыйПациент = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской");
	ИначеЕсли ПолКлиента = "Женский" Тогда
		Пол_НовыйПациент = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Женский");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам подтверждения записи
//
Процедура УстановитьСвойстваЭлементамПодтвержденияЗаписи()

	ЗаписьПодтверждена = Объект.ТелефонныйЗвонок ИЛИ Объект.Статус = Перечисления.СтатусыСобытия.Подтверждена;   
	
	Если ЗаписьПодтверждена Тогда 
		// Элементы.ФормаКнопкаПодтвердитьЗвонок.Отображение   = ОтображениеКнопки.Текст;
		Элементы.ФормаКнопкаПодтвердитьЗвонок.Отображение   = ОтображениеКнопки.КартинкаИТекст;
		Элементы.ФормаКнопкаПодтвердитьЗвонок.Заголовок 	= НСтр("ru = 'Прием подтвержден'; en = 'Confirmed'");
		Элементы.ФормаКнопкаПодтвердитьЗвонок.ЦветТекста 		= Новый Цвет (255, 255, 255);
		Элементы.ГруппаФормаКнопкаПодтвержденияЗвонка.ЦветФона 	= Новый Цвет(25, 116, 206);		
		Если ЗначениеЗаполнено(Объект.ИдентификаторДиалога) Тогда 
			Элементы.ФормаКнопкаПодтвердитьЗвонок.Картинка = БиблиотекаКартинок.РоботКонтур;
		Иначе
			Элементы.ФормаКнопкаПодтвердитьЗвонок.Картинка = БиблиотекаКартинок.ВидВзаимодействия_21;
		КонецЕсли;
	Иначе                                                                             
		Элементы.ФормаКнопкаПодтвердитьЗвонок.Отображение   = ОтображениеКнопки.Текст;
		Элементы.ФормаКнопкаПодтвердитьЗвонок.Заголовок = НСтр("ru = 'Прием не подтвержден'; en = 'Reception not confirmed'");	
		Элементы.ФормаКнопкаПодтвердитьЗвонок.ЦветТекста 		= Новый Цвет (77, 77 ,77);
		Элементы.ГруппаФормаКнопкаПодтвержденияЗвонка.ЦветФона 	= Новый Цвет(242, 242, 242);		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Процедура, отображает метку полиса.
//
Процедура ОтобразитьМеткуПолиса() 
	
	Если ЗначениеЗаполнено(Объект.ПолисМедСтрахования) Тогда 
		
		Если ЗначениеЗаполнено(Объект.ПолисМедСтрахования.Договор) 
			И ЗначениеЗаполнено(Объект.ПолисМедСтрахования.Договор.ПрограммаСтрахования) Тогда
			
			ДанныеПрограммыСтрахования = Справочники.ПрограммыСтрахования.ПолучитьТекстЦветФонаИТекста(Объект.ПолисМедСтрахования.Договор.ПрограммаСтрахования); 
			
			Элементы.ДекорацияПрограммаСтрахования.Заголовок 	= ДанныеПрограммыСтрахования.Текст;
			Элементы.ДекорацияПрограммаСтрахования.ЦветТекста 	= ДанныеПрограммыСтрахования.ЦветТекста;
			Элементы.ГруппаПрограммаСтрахования.ЦветФона 		= ДанныеПрограммыСтрахования.ЦветФона;
			Элементы.ГруппаПрограммаСтрахования.Видимость  		= Истина;
		Иначе
			Элементы.ГруппаПрограммаСтрахования.Видимость  = Ложь;
		КонецЕсли;                                                 
			
		Если ЗначениеЗаполнено(Объект.ПолисМедСтрахования.СтраховаяКомпания.КраткоеНаименование) Тогда
			Элементы.ГруппаАльфа.Видимость  = Истина;
			ФонМетки = ?(ЗначениеЗаполнено(Объект.ПолисМедСтрахования.СтраховаяКомпания.ЦветФонаМетки), ЗначениеИзСтрокиВнутр(Объект.ПолисМедСтрахования.СтраховаяКомпания.ЦветФонаМетки), WebЦвета.СеребристоСерый); 
			Элементы.ДекорацияАльфа.ЦветТекста  = ?(Объект.ПолисМедСтрахования.СтраховаяКомпания.ЦветТекстаБелый, Новый Цвет(255,255,255), Новый Цвет(77,77,77));
			Элементы.ДекорацияАльфа.Заголовок	= Объект.ПолисМедСтрахования.СтраховаяКомпания.КраткоеНаименование;
			Элементы.ГруппаАльфа.ЦветФона  = ФонМетки; 
		Иначе
			Элементы.ГруппаАльфа.Видимость  = Ложь;
		КонецЕсли;

	Иначе
		Элементы.ГруппаПрограммаСтрахования.Видимость  = Ложь;
		Элементы.ГруппаАльфа.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчика события "Начало выбора".
//
Процедура ПолисМедСтрахованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПараметрыОткрытия.Вставить("Контрагент", Объект.Контрагент);
	КонецЕсли;
	ПараметрыОткрытия.Вставить("ДатаДокумента", Объект.Дата);
	ПараметрыОткрытия.Вставить("Организация", ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.СтруктурнаяЕдиница, "Организация"));
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыборМедПолисаОкончание", ЭтотОбъект);	
	
	ОткрытьФорму("Справочник.ПолисыМедицинскогоСтрахования.Форма.ФормаВыбора", 
				 ПараметрыОткрытия,,,,,
				 ОповещениеОЗакрытии, 
				 РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик описания оповещения ПолисМедСтрахованияНачалоВыбора.
//
Процедура ВыборМедПолисаОкончание(Результат, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.ПолисМедСтрахования = Результат;
		ОтобразитьМеткуПолиса();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте 
// Процедура, обработчика события "Очистка".
//
Процедура ПолисМедСтрахованияОчистка(Элемент, СтандартнаяОбработка)
	Объект.ПолисМедСтрахования = Неопределено;
	ОтобразитьМеткуПолиса();
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - Получить представление пациента для напоминания о будущих событиях
//
Функция ПолучитьПредставлениеПациентаДляНапоминанияОБудущихСобытиях(Контрагент)
		
	ДанныеКонтрагента = ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(Контрагент, "Имя, Отчество");		
	ПредставлениеКонтрагента = СокрЛП(ДанныеКонтрагента.Имя) + " " + СокрЛП(ДанныеКонтрагента.Отчество);
	
	// Если Прав(ПредставлениеКонтрагента, 1) = " " Тогда
	//	
	//	ПредставлениеПола = "";
	//	Если ЗначениеЗаполнено(ДанныеКонтрагента.ПолКлиента) Тогда
	//		ПредставлениеПола = ?(ДанныеКонтрагента.ПолКлиента = Перечисления.ПолФизическогоЛица.Мужской, "ый ", "ая ");		
	//	    ПредставлениеКонтрагента = "Уважаем"+ ПредставлениеПола + СокрЛП(ДанныеКонтрагента.Имя);
	//	Иначе
	//		ПредставлениеКонтрагента = "Уважаемый клиент";	
	//	КонецЕсли;
	//	
	// Иначе
		
	Если Лев(ПредставлениеКонтрагента, 1) = " " ИЛИ Прав(ПредставлениеКонтрагента, 1) = " " Тогда
		ПредставлениеКонтрагента = "Уважаемый клиент";	
	КонецЕсли;
	
	Возврат ПредставлениеКонтрагента;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает данные внешних систем мессенджера.
//
Функция ПолучитьДоступныеВнешниеСистемыМессенджера(Клиент, СтруктурнаяЕдиница)
	
	Возврат Справочники.ВнешниеСистемы.ПолучитьДоступныеВнешниеСистемыМессенджера(Клиент,СтруктурнаяЕдиница);
	
КонецФункции

#Область Печать

&НаКлиенте
// Процедура печати документов.
//
Процедура ДокументПечать(Команда)
	
	МассивДокументов = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		МассивДокументов.Добавить(Объект.Ссылка);
	КонецЕсли;
		
	СписокПечатныхФорм = ПолучитьСписокПечати(); 	
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "Событие");
	Структура.Вставить("МассивДокументов", МассивДокументов);
	Структура.Вставить("Контрагент", Объект.Контрагент);
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаКоманды", УправлениеПечатьюКлиентСтоматология, Структура);	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) ИЛИ ЭтаФорма.Модифицированность Тогда	
		
		СтруктураВопроса = Новый Структура;
		СтруктураВопроса.Вставить("СписокПечатныхФорм", СписокПечатныхФорм);
		СтруктураВопроса.Вставить("Оповещение", Оповещение);
		ОповещениеДляВопроса = Новый ОписаниеОповещения("ПослеВопросаЗавершение", ЭтотОбъект, СтруктураВопроса);
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ПоказатьВопрос(ОповещениеДляВопроса, "Данные ещё не записаны. Записать?", РежимДиалогаВопрос.ДаНет);
		Иначе
			ПоказатьВопрос(ОповещениеДляВопроса, "Данные изменены. Записать?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
		
	Иначе
		
		ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, Элементы.ФормаДокументаПечать);
		
	КонецЕсли;   				
	
КонецПроцедуры

&НаКлиенте
// Процедура После вопроса завврешение.
//
Процедура ПослеВопросаЗавершение(Результат, Параметры) Экспорт	
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ПроверитьЗаполнение() = Истина Тогда		
			ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));			
		КонецЕсли; 				
	Иначе
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()
	Возврат Документы.Событие.ПолучитьСписокПечатныхФорм();	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить массив структурных единиц сотрудника
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивСтруктурныхЕдиницСотрудника()

	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	Возврат Справочники.СтруктурныеЕдиницы.ПолучитьМассивСтруктурныхЕдиницСотрудника(ТекущийПользователь);
	
КонецФункции

&НаСервереБезКонтекста
// Процедура возвращает вид цен
//
Функция ВернутьВидЦены(ПолисМедСтрахования, Сотрудник, СтруктурнаяЕдиница)	
	ВидЦен = Неопределено;
	Если ЗначениеЗаполнено(ПолисМедСтрахования) И ЗначениеЗаполнено(ПолисМедСтрахования.Договор)
	   И ЗначениеЗаполнено(ПолисМедСтрахования.Договор.ВидЦен) Тогда 
		ВидЦен = ПолисМедСтрахования.Договор.ВидЦен;
	ИначеЕсли ЗначениеЗаполнено(Сотрудник) Тогда				
		ВидЦен = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизитаСотрудника(Сотрудник, СтруктурнаяЕдиница , "ВидЦен");		
	КонецЕсли;		
	Если НЕ ЗначениеЗаполнено(ВидЦен) 
	   И ЗначениеЗаполнено(СтруктурнаяЕдиница.ВидЦенРеализации) Тогда 
		ВидЦен = СтруктурнаяЕдиница.ВидЦенРеализации;
    КонецЕсли;	
    Если НЕ ЗначениеЗаполнено(ВидЦен) Тогда		
		ВидЦен = Справочники.ВидыЦен.Розничная;
	КонецЕсли;	
	Возврат ВидЦен;	
КонецФункции

#КонецОбласти

#КонецОбласти 
