
////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры работы с обсуждениями (вызов сервера)
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Вызывает процедуру формирования массива структур, 
// Содержащий имена и описания пользователей для использования в тексте обсуждений.
// 
// Параметры: Нет
//
// Возвращаемое значение:
//  Массив           - по числу пользователей: 
//   * Пользователь  - эл. справочника Пользователи
//   * Представление - Строка - Наименование пользователя,
//   * Имя 			 - Строка - Наименование пользователя сплошной строкой с нижним подчеркиванием, по типу "Фамилия_Имя";
//   * ДляПоиска 	 - Строка - Наименование пользователя сплошной строкой с нижним подчеркиванием, по типу "Фамилия_Имя",
//	 				   в нижнем регистре
Функция СловарьОписанийПользователей() Экспорт
	
	Возврат ОбсужденияСервер.СловарьОписанийПользователей();
	
КонецФункции

// Добавляет запись обсуждения в регистр сведений Обсуждения для Ссылки, 
// А также для упомянутых (по навигационным ссылкам) в тексте комментария объектов,
// формирует напоминания пользователям, упомянутым в тексте комментария
// Параметры:
//  Комментарий			    Строка 		- текст сообщения
//  Ссылка				    Любая ссылка - ссылка на объект обсуждения
//	Системный				Булево - Истина - если записывается история изменения,
//									Ложь - если записывается комментарий
Функция ДобавитьСообщение(Комментарий, Ссылка, Системный = Ложь) Экспорт
	
	ОбсужденияСервер.ДобавитьСообщение(Комментарий, Ссылка, ,Системный);
	
КонецФункции

// Возвращает содержимое поля HTML документа, которое отображает обсуждения объекта (ссылки)
// 
// Параметры: 
//  Объект		     - любая ссылка - объект, по которому выводятся данные обсуждений 
//  ЗаПериод		 - Булево - регулирует ограничение показываемых записей. Если ЗаПериод=Истина И
//						число записей обсуждений больше 15, то показываются записи за последние 14 дней
//						от текущей даты
// Возвращаемое значение:
//  Результат        - Строка - содержимое поля HTML документа
Функция ОбсужденияПоОбъекту(Ссылка, ЗаПериод=Ложь) Экспорт
	
	Возврат ОбсужденияСервер.ОбсужденияПоОбъекту(Ссылка, ЗаПериод);
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ДоступныМеханизмы8_3_6() Экспорт
	
	Возврат ОбсужденияСервер.ДоступныМеханизмы8_3_6();
	
КонецФункции

Процедура ВключитьФОИспользоватьНапоминанияПользователяПриОбновлении(СтруктураПараметров) Экспорт
	
КонецПроцедуры

#КонецОбласти 

 