
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Заголовок", ЭтаФорма.Заголовок);
	
	Параметры.Свойство("СписокЗначений", СписокЗначений);
	Если Параметры.Свойство("СписокЗначений") И ТипЗнч(Параметры.СписокЗначений) = Тип("Массив") Тогда
		СписокЗначений.ЗагрузитьЗначения(Параметры.СписокЗначений);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыбранноеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ВыбранноеЗначениеНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), СписокЗначений, Элемент, ВыбранноеЗначение); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЗначений

&НаКлиенте
Процедура СписокЗначенийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Закрыть(ВыбранноеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбранноеЗначениеНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	
	Результат = ВыбранныйЭлемент;
	Если Результат <> Неопределено Тогда
		ВыбранноеЗначение = Результат.Значение;
		СписокЗначенийОбработкаВыбора(Элемент, ВыбранноеЗначение, Истина)
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
