
#Область ОбработчикиКомандФормы

// Процедура, обработчик команды "ЗаполнитьСерийныеНомера"
//
&НаКлиенте
Процедура ЗаполнитьСерийныеНомера(Команда)
	
	ПараметрыОткрытия = Новый Структура("Номенклатура", НоменклатураВладелец);
	ФормаЗаполнения = ПолучитьФорму("Обработка.ЗаполнениеДиапазонаСерийныхНомеров.Форма", ПараметрыОткрытия);
	Если Не ФормаЗаполнения.Открыта() Тогда
		ФормаЗаполнения.Объект.Номенклатура = НоменклатураВладелец;
		ФормаЗаполнения.Открыть();
	Иначе
		ФормаЗаполнения.Активизировать();
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") Тогда
		
		НоменклатураВладелец  = Параметры.Отбор.Владелец;
		
		Если НоменклатураВладелец.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат и НоменклатураВладелец.ИспользоватьПартии Тогда
			
			Элементы.ФормаКнопкаГенераторСерийныхНомеров.Видимость = Истина;
			
		КонецЕсли;		
	КонецЕсли;  
	
КонецПроцедуры

#КонецОбласти