
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - При компоновке результата
//
// Параметры:
//  ДокументРезультат	 - 	 - 
//  ДанныеРасшифровки	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОтчетыСервер.ПриКомпоновкеРезультата(КомпоновщикНастроек, СхемаКомпоновкиДанных, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	//Счетчик = 0;
	//Для Каждого Элемент Из ДанныеРасшифровки.Элементы Цикл
	//	
	//	Если ТипЗнч(Элемент) = Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда
	//		Счетчик = Счетчик + 1;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//ДокументРезультат.ФиксацияСверху = Счетчик;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - При определении настроек отчета
//
// Параметры:
//  НастройкиОтчета		 - 	 - 
//  НастройкиВариантов	 - 	 - 
//
Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиОтчета.Вставить("УровеньГруппировкиСтрок", 2);

	НастройкиВариантов["ЛицевыеСчета"].Рекомендуемый = Истина;	
	
	ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов);
	
КонецПроцедуры

// Процедура - Заполнить предопределенные варианты оформления
//
// Параметры:
//  НастройкиВариантов	 - 	 - 
//
Процедура ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов)
	
	МассивПолейСумм = Новый Массив;
	
	Для Каждого ДоступноеПоле Из КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
		
		Если Не ДоступноеПоле.Ресурс Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПоля = Строка(ДоступноеПоле.Поле);
		МассивПолейСумм.Добавить(ИмяПоля);
		
	КонецЦикла; 
	
	Для Каждого НастройкиТекВарианта Из НастройкиВариантов Цикл
		
		ВариантыОформления = НастройкиТекВарианта.Значение.ВариантыОформления;
		ОтчетыСервер.ДобавитьВариантыОформленияСумм(ВариантыОформления, МассивПолейСумм);
			
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли