#Область ОбработчикиСобытийФормы   

&НаСервере 
// Процедура - При создании на сервере.
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Ссылка", СсылкаРодитель);
	Параметры.Свойство("СписокФильтрацииИсторииВзаимодействия", СписокФильтрацииИсторииВзаимодействия);
	УстановитьВидимостьЭлементовФормы();
	
	Если ЗначениеЗаполнено(СписокФильтрацииИсторииВзаимодействия) Тогда
		ОтметитьВыбранныеФильтры(СписокФильтрацииИсторииВзаимодействия);
	Иначе
		ОбщегоНазначенияКлиентСерверСтоматология.ЗаполнитьСписокФильтрацииИсторииВзаимодействияПоУмолчанию(СписокФильтрацииИсторииВзаимодействия, Элементы.ГруппаВыравнивание,, СсылкаРодитель)
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Фильтр команда нажатие.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ФильтрКомандаНажатие(Команда)
	ФильтРисторииВзаимодействияНажатие(Команда.Имя, СписокФильтрацииИсторииВзаимодействия);	 
КонецПроцедуры

&НаКлиенте  
// Процедура - Применить фильтры.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПрименитьФильтры(Команда)	
	Закрыть(СписокФильтрацииИсторииВзаимодействия);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - Фильтр истории взаимодействия нажатие.
//
// Параметры:
//  ИмяКоманды			 - 	 - 
//  ГруппаВсплывающая	 - 	 - 
//  СписокФильтрации	 - 	 - 
//
Процедура ФильтрИсторииВзаимодействияНажатие(ИмяКоманды, СписокФильтрации) Экспорт
	
	ЦветВыделеннойГруппы 	= Новый Цвет(218, 230, 244);
	ЦветОбычнойГруппы		= Новый Цвет(255, 255, 255);
	
	Для Каждого ЭлементФормы Из Элементы.ГруппаВыравнивание.ПодчиненныеЭлементы Цикл 
		
		Если Не СтрНачинаетсяС(ЭлементФормы.Имя, "ГруппаФильтр") Или ЭлементФормы.Видимость = Ложь Тогда
			Продолжить;	
		КонецЕсли;
		
		ИмяФильтра = СтрЗаменить(ЭлементФормы.Имя, "ГруппаФильтр", "");
		
		Если СтрНайти(ИмяКоманды, ИмяФильтра) = 0 Тогда 
			Продолжить;
		КонецЕсли;     
		
		ЭлементСпискаЗначения = СписокФильтрации.НайтиПоЗначению(ИмяФильтра);
		
		Если ЭлементСпискаЗначения = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементСпискаЗначения.Пометка = Не ЭлементСпискаЗначения.Пометка;
		
		ЭлементФормы.ЦветФона = ?(ЭлементСпискаЗначения.Пометка = Истина, ЦветВыделеннойГруппы, ЦветОбычнойГруппы);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура - Отметить выбранные фильтры.
//
// Параметры:
//  ГруппаВсплывающая	 - 	 - 
//  СписокФильтрации	 - 	 - 
//
Процедура ОтметитьВыбранныеФильтры(СписокФильтрации) Экспорт
	
	ЦветВыделеннойГруппы 	= Новый Цвет(218, 230, 244);
	ЦветОбычнойГруппы		= Новый Цвет(255, 255, 255);	
	
	Для Каждого ЭлементФормы Из Элементы.ГруппаВыравнивание.ПодчиненныеЭлементы Цикл 
		
		Если Не СтрНачинаетсяС(ЭлементФормы.Имя, "ГруппаФильтр") Или ЭлементФормы.Видимость = Ложь Тогда
			Продолжить;	
		КонецЕсли;	
		
		ИмяФильтра = СтрЗаменить(ЭлементФормы.Имя, "ГруппаФильтр", "");
		
		ЭлементСпискаЗначения = СписокФильтрации.НайтиПоЗначению(ИмяФильтра);
		
		Если ЭлементСпискаЗначения = Неопределено Тогда
			ЭлементФормы.ЦветФона = ЦветОбычнойГруппы;
			Продолжить;
		КонецЕсли;
		
		ЭлементФормы.ЦветФона = ?(ЭлементСпискаЗначения.Пометка = Истина, ЦветВыделеннойГруппы, ЦветОбычнойГруппы); 
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
// Процедура - Установить видимость элементов формы.
//
Процедура УстановитьВидимостьЭлементовФормы()
	
	Если ТипЗнч(СсылкаРодитель) = Тип("СправочникСсылка.Заявки") Тогда
		Элементы.ГруппаФильтрОбращения.Видимость 	= Ложь;
		Элементы.ГруппаФильтрСобытия.Видимость 		= Ложь;
		Элементы.ГруппаФильтрПриемы.Видимость 		= Ложь;
		Элементы.ГруппаФильтрПланыЛечения.Видимость = Ложь;
		Элементы.ГруппаФильтрНарядЗаказы.Видимость 	= Ложь;	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

