   
#Область ОбработчикиСобытийФормы   
   
 &НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НаДату = ТекущаяДата();
	СФормироватьОтчетАвтоматически = Параметры.Свойство("Пользователь"); 
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;	
	ЗапросНастройки = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                               |	&Пользователь КАК Пользователь,
	                               |	Права.Ссылка КАК Право,
	                               |	ЕСТЬNULL(ЗначениеПрав.Значение, ЛОЖЬ) КАК Значение
	                               |ИЗ
	                               |	ПланВидовХарактеристик.ПраваПользователей КАК Права
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхПравПользователя КАК ЗначениеПрав
	                               |		ПО (ЗначениеПрав.Пользователь = &Пользователь)
	                               |			И (ЗначениеПрав.Право = Права.Ссылка)
	                               |ГДЕ
	                               |	НЕ Права.Ссылка.ПометкаУдаления
	                               |	И Права.Ссылка В ИЕРАРХИИ(&ПравоГруппа)
	                               |	И НЕ Права.ЭтоГруппа");
	
	ЗапросНастройки.УстановитьПараметр("Пользователь", ТекПользователь);
	ЗапросНастройки.УстановитьПараметр("ПравоГруппа", ПланыВидовХарактеристик.ПраваПользователей.СводныйОтчетПриЗапуске);	
	ТаблицаНастроек = ЗапросНастройки.Выполнить().Выгрузить();
	
	Для Каждого СтрокаНастроек ИЗ ТаблицаНастроек Цикл 
		
		НС = СтруктураОтчета.Добавить();
		НС.Настройка = СтрокаНастроек.Право;
		НС.Значение = СтрокаНастроек.Значение;
				
	КонецЦикла;
	
	Если СФормироватьОтчетАвтоматически Тогда
		
		СформироватьОтчет();	

	КонецЕсли;	

КонецПроцедуры
	
&НаКлиенте
// Процедура - обработчик события "ОбработкаОповещения".
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "НастройкиИзменены" Тогда
		
		Для Каждого СтрокаНастройка Из Параметр.НастройкиОтчета Цикл			
			ИскНастройка = СтруктураОтчета.НайтиСтроки(Новый Структура("Настройка", СтрокаНастройка.Настройка));
			ИскНастройка[0].Значение = СтрокаНастройка.Значение;		
		КонецЦикла;
		
		ЗаписатьНастройки();		
		
		СформироватьОтчет();
		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - обработчик команды "Сформировать".
//
Процедура Сформировать(Команда)
	СформироватьОтчет();	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "ОтправитьSMS".
//
Процедура ОтправитьSMS(Команда)
	
	Если ДанныеКонтрагентов.Количество() > 0 Тогда
		
		ПараметрыОткрытия = Новый Структура("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидОперацииОтправкаSMS.МассоваяРассылкаSMS"));
		ФормаОтправкиSMS = ПолучитьФорму("Документ.РассылкаСообщений.ФормаОбъекта", Новый Структура("Основание", ПараметрыОткрытия));
		
		Для Каждого СтрокаДанныхКонтрагента Из ДанныеКонтрагентов Цикл
			Если ЗначениеЗаполнено(СтрокаДанныхКонтрагента.Телефон) И СтрокаДанныхКонтрагента.НеУчаствоватьВРассылкеСообщений = Ложь Тогда
				НоваяСтрока = ФормаОтправкиSMS.Объект.Получатели.Добавить();
				НоваяСтрока.Получатель 		= СтрокаДанныхКонтрагента.Контрагент;
				НоваяСтрока.НомерТелефона 	= ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(СтрокаДанныхКонтрагента.Телефон);
			КонецЕсли;
		КонецЦикла;
		
		ФормаОтправкиSMS.Открыть();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "Настройка".
//
Процедура Настройка(Команда)
	
	ФормаНастройка = ПолучитьФорму("Отчет.СводныйОтчетПриЗапуске.Форма.ФормаСтруктураОтчета", Новый Структура("НастройкиОтчета", СтруктураОтчета), ЭтаФорма);
	ФормаНастройка.Открыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "НаДату".
//
Процедура НаДатуПриИзменении(Элемент)
	СформироватьОтчет();	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - обработчик события "ОбработкаРасшифровки" поля "ПолеТаблицаОтчета".
//
Процедура ПолеТаблицаОтчетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("РегистрСведений.Профосмотры.Форма.ФормаРедактированияЗаписиПлана", Расшифровка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура формирования отчета.
//
Процедура СформироватьОтчет()
	
	ДанныеКОтображениюОтсутствуют = Истина;
	ТаблицаОтчета.Очистить();
	Макет = Отчеты.СводныйОтчетПриЗапуске.ПолучитьМакет("Макет");
	ДанныеКонтрагентов.Очистить();
	Элементы.ОтправитьСМС.Видимость = Ложь;	
	
	Если СтруктураОтчета.НайтиСтроки(Новый Структура("Настройка", ПланыВидовХарактеристик.ПраваПользователей.ДниРождения))[0].Значение Тогда
		
		// Дни рождения.	
		
		ЗапросДР = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                        |	Клиенты.Контрагент КАК Контрагент,
		                        |	Клиенты.ДатаРожденияКлиента КАК ДатаРожденияКлиента,
		                        |	Клиенты.Телефон КАК Телефон,
		                        |	ПОДСТРОКА(Клиенты.Email, 1, 500) КАК Email,
		                        |	Клиенты.НеУчаствоватьВРассылкеEmail КАК НеУчаствоватьВРассылкеEmail,
		                        |	Клиенты.НеУчаствоватьВРассылкеСообщений КАК НеУчаствоватьВРассылкеСообщений,
		                        |	ВЫБОР
		                        |		КОГДА Клиенты.ДатаРожденияКлиента = &ПустаяДата
		                        |			ТОГДА 0
		                        |		ИНАЧЕ ДЕНЬ(Клиенты.ДатаРожденияКлиента)
		                        |	КОНЕЦ КАК ДатаРожденияДень,
		                        |	ВЫБОР
		                        |		КОГДА Клиенты.ДатаРожденияКлиента = &ПустаяДата
		                        |			ТОГДА 0
		                        |		ИНАЧЕ МЕСЯЦ(Клиенты.ДатаРожденияКлиента)
		                        |	КОНЕЦ КАК ДатаРожденияМесяц
		                        |ИЗ
		                        |	(ВЫБРАТЬ
		                        |		Контрагенты.Ссылка КАК Контрагент,
		                        |		Контрагенты.ДатаРожденияКлиента КАК ДатаРожденияКлиента,
		                        |		Контрагенты.Телефон КАК Телефон,
		                        |		ЕСТЬNULL(Email.Представление, """") КАК Email,
		                        |		Контрагенты.НеУчаствоватьВРассылкеEmail КАК НеУчаствоватьВРассылкеEmail,
		                        |		Контрагенты.НеУчаствоватьВРассылкеСообщений КАК НеУчаствоватьВРассылкеСообщений
		                        |	ИЗ
		                        |		Справочник.Контрагенты КАК Контрагенты
		                        |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                        |				Email.Ссылка КАК Ссылка,
		                        |				Email.Представление КАК Представление
		                        |			ИЗ
		                        |				Справочник.Контрагенты.КонтактнаяИнформация КАК Email
		                        |			ГДЕ
		                        |				(Email.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента)
		                        |						ИЛИ Email.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailОрганизации))) КАК Email
		                        |			ПО Контрагенты.Ссылка = Email.Ссылка
		                        |	ГДЕ
		                        |		Контрагенты.ЭтоГруппа = ЛОЖЬ
		                        |		И Контрагенты.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты)) КАК Клиенты
		                        |ГДЕ
		                        |	ВЫБОР
		                        |			КОГДА Клиенты.ДатаРожденияКлиента = &ПустаяДата
		                        |				ТОГДА 0
		                        |			ИНАЧЕ ДЕНЬ(Клиенты.ДатаРожденияКлиента)
		                        |		КОНЕЦ = &ТекДатаДень
		                        |	И ВЫБОР
		                        |			КОГДА Клиенты.ДатаРожденияКлиента = &ПустаяДата
		                        |				ТОГДА 0
		                        |			ИНАЧЕ МЕСЯЦ(Клиенты.ДатаРожденияКлиента)
		                        |		КОНЕЦ = &ТекДатаМесяц");
		ЗапросДР.УстановитьПараметр("ПустаяДата", Дата("00010101000000"));
		ЗапросДР.УстановитьПараметр("ТекДатаДень", День(НаДату));
		ЗапросДР.УстановитьПараметр("ТекДатаМесяц", Месяц(НаДату));

		
		РезультатДР = ЗапросДР.Выполнить().Выгрузить();
		
		Если РезультатДР.Количество() > 0 Тогда 
			ТаблицаОтчета.Вывести(Макет.ПолучитьОбласть("Шапка_ДР"));
			ДанныеКОтображениюОтсутствуют = Ложь;
		КонецЕсли;	
		НомерСтроки = 1;
		Для Каждого КлиентСтрока Из РезультатДР Цикл
			
			НоваяСтрокаДанных = ДанныеКонтрагентов.Добавить();
			НоваяСтрокаДанных.Контрагент = КлиентСтрока.Контрагент;
			НоваяСтрокаДанных.Телефон = КлиентСтрока.Телефон;
			НоваяСтрокаДанных.Email = КлиентСтрока.Email;
			НоваяСтрокаДанных.НеУчаствоватьВРассылкеСообщений = КлиентСтрока.Контрагент.НеУчаствоватьВРассылкеСообщений;
			НоваяСтрокаДанных.НеУчаствоватьВРассылкеEmail     = КлиентСтрока.Контрагент.НеУчаствоватьВРассылкеEmail;
			
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка_ДР");
			ОбластьСтрока.Параметры.Клиент = КлиентСтрока.Контрагент;
			ОбластьСтрока.Параметры.Телефон  =  КлиентСтрока.Телефон;
			ОбластьСтрока.Параметры.Почта = КлиентСтрока.Email;
			ОбластьСтрока.Параметры.Возраст = Год(НаДату) - Год(КлиентСтрока.ДатаРожденияКлиента);
			ОбластьСтрока.Параметры.Номер = НомерСтроки;
			ТаблицаОтчета.Вывести(ОбластьСтрока);
			НомерСтроки = НомерСтроки+1;
			
		КонецЦикла;
		
		Если ДанныеКонтрагентов.Количество() > 0 Тогда
			Элементы.ОтправитьСМС.Видимость = Истина;
		КонецЕсли;	
			
	КонецЕсли;
	
	Если СтруктураОтчета.НайтиСтроки(Новый Структура("Настройка", ПланыВидовХарактеристик.ПраваПользователей.КритическиеОстатки))[0].Значение Тогда
		
		// Критические остатки.	
		ЗапросКО = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КритическиеОстатки.Номенклатура,
		|	КритическиеОстатки.Склад,
		|	КритическиеОстатки.Количество * ЕСТЬNULL(КритическиеОстатки.Упаковка.Коэффициент, 1) КАК КритическийОстаток,
		|	КритическиеОстатки.СтруктурнаяЕдиница,
		|	ЗапасыНаСкладахОстатки.КоличествоОстаток,
		|	КритическиеОстатки.Количество * ЕСТЬNULL(КритическиеОстатки.Упаковка.Коэффициент, 1) - ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) КАК Обеспечение
		|ИЗ
		|	РегистрСведений.КритическиеОстатки КАК КритическиеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки КАК ЗапасыНаСкладахОстатки
		|		ПО КритическиеОстатки.Номенклатура = ЗапасыНаСкладахОстатки.Номенклатура
		|			И КритическиеОстатки.Склад = ЗапасыНаСкладахОстатки.Склад
		|ГДЕ
		|	КритическиеОстатки.Количество * ЕСТЬNULL(КритическиеОстатки.Упаковка.Коэффициент, 1) - ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) > 0
		|	И КритическиеОстатки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
		
		ЗапросКО.УстановитьПараметр("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
		
		РезультатКО = ЗапросКО.Выполнить().Выгрузить();
		
		Если РезультатКО.Количество() > 0 Тогда 
			ТаблицаОтчета.Вывести(Макет.ПолучитьОбласть("Шапка_КО"));
			ДанныеКОтображениюОтсутствуют = Ложь;
		КонецЕсли;	
		НомерСтроки = 1;
		Для Каждого НоменклатураСтрока Из РезультатКО Цикл
			
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка_КО");
			ОбластьСтрока.Параметры.Номенклатура  =  НоменклатураСтрока.Номенклатура;
			ОбластьСтрока.Параметры.Склад = НоменклатураСтрока.Склад;
			ОбластьСтрока.Параметры.кОстаток = НоменклатураСтрока.КритическийОстаток;
			ОбластьСтрока.Параметры.тОстаток = НоменклатураСтрока.КоличествоОстаток;
			ОбластьСтрока.Параметры.Необходимо = НоменклатураСтрока.Обеспечение;	
			ОбластьСтрока.Параметры.Номер = НомерСтроки;
			ТаблицаОтчета.Вывести(ОбластьСтрока);
			НомерСтроки = НомерСтроки+1;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	Если СтруктураОтчета.НайтиСтроки(Новый Структура("Настройка", ПланыВидовХарактеристик.ПраваПользователей.ЛистОжидания))[0].Значение Тогда
		
		// Лист ожидания.	
		ЗапросПН = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                        |	ПрофосмотрыСрезПоследних.ВидОсмотра КАК ВидОсмотра,
		                        |	ПрофосмотрыСрезПоследних.Контрагент КАК Пациент,
		                        |	ПрофосмотрыСрезПоследних.ПричинаНаправления КАК Основание,
		                        |	АдресЭлПочты.Представление КАК Email,
		                        |	ПрофосмотрыСрезПоследних.Период КАК Период,
		                        |	ПрофосмотрыСрезПоследних.Прием КАК Прием,
		                        |	ПрофосмотрыСрезПоследних.ДатаЗапланированная КАК ДатаЗапланированная,
		                        |	ПрофосмотрыСрезПоследних.Статус КАК Статус,
		                        |	ПрофосмотрыСрезПоследних.Сотрудник КАК Сотрудник,
		                        |	ПрофосмотрыСрезПоследних.АвторЗаписи КАК АвторЗаписи
		                        |ИЗ
		                        |	РегистрСведений.Профосмотры.СрезПоследних(, ) КАК ПрофосмотрыСрезПоследних
		                        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                        |			КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка,
		                        |			КонтрагентыКонтактнаяИнформация.Представление КАК Представление
		                        |		ИЗ
		                        |			Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		                        |		ГДЕ
		                        |			(КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента)
		                        |					ИЛИ КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailОрганизации))) КАК АдресЭлПочты
		                        |		ПО ПрофосмотрыСрезПоследних.Контрагент.Ссылка = АдресЭлПочты.Ссылка
		                        |ГДЕ
		                        |	ПрофосмотрыСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		                        |	И ПрофосмотрыСрезПоследних.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.Запланирован), ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.НапомнитьПозже))
		                        |	И НАЧАЛОПЕРИОДА(ПрофосмотрыСрезПоследних.ДатаЗапланированная, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаЗапланированная, ДЕНЬ)");
		
		ЗапросПН.УстановитьПараметр("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
		ЗапросПН.УстановитьПараметр("ДатаЗапланированная", НаДату);
		
		РезультатПН = ЗапросПН.Выполнить().Выгрузить();
		
		Если РезультатПН.Количество() > 0 Тогда 
			ТаблицаОтчета.Вывести(Макет.ПолучитьОбласть("Шапка_ПН"));
			ДанныеКОтображениюОтсутствуют = Ложь;
		КонецЕсли;	
		
		НомерСтроки = 1;
		Для Каждого СтрокаТаблицы Из РезультатПН Цикл
			
			НоваяСтрокаДанных = ДанныеКонтрагентов.Добавить();
			НоваяСтрокаДанных.Контрагент = СтрокаТаблицы.Пациент;
			НоваяСтрокаДанных.Телефон = СтрокаТаблицы.Пациент.Телефон;
			НоваяСтрокаДанных.Email = СтрокаТаблицы.Email;
			НоваяСтрокаДанных.НеУчаствоватьВРассылкеСообщений = СтрокаТаблицы.Пациент.НеУчаствоватьВРассылкеСообщений;
			НоваяСтрокаДанных.НеУчаствоватьВРассылкеEmail     = СтрокаТаблицы.Пациент.НеУчаствоватьВРассылкеEmail;
			
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка_ПН");
			ОбластьСтрока.Параметры.ВидОсмотра  =  СтрокаТаблицы.ВидОсмотра;
			ОбластьСтрока.Параметры.Пациент = СтрокаТаблицы.Пациент;
			ОбластьСтрока.Параметры.Сотрудник = СтрокаТаблицы.Сотрудник;
			ОбластьСтрока.Параметры.АвторЗаписи = СтрокаТаблицы.АвторЗаписи;
			ОбластьСтрока.Параметры.Телефон = СтрокаТаблицы.Пациент.Телефон;
			ОбластьСтрока.Параметры.Основание = СтрокаТаблицы.Основание;
			ОбластьСтрока.Параметры.Номер = НомерСтроки;
			
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Контрагент"          ,СтрокаТаблицы.Пациент);
			ПараметрыФормы.Вставить("Сотрудник"           ,СтрокаТаблицы.Сотрудник);
			ПараметрыФормы.Вставить("Прием"               ,СтрокаТаблицы.Прием);
			ПараметрыФормы.Вставить("СтруктурнаяЕдиница"  ,ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
			ПараметрыФормы.Вставить("ДатаЗапланированная" ,СтрокаТаблицы.ДатаЗапланированная);
			ПараметрыФормы.Вставить("Статус"              ,СтрокаТаблицы.Статус);
			ПараметрыФормы.Вставить("ВидОсмотра"          ,СтрокаТаблицы.ВидОсмотра);
			ПараметрыФормы.Вставить("ПричинаНаправления"  ,СтрокаТаблицы.Основание);
			
			ОбластьСтрока.Параметры.ОбработатьПН = ПараметрыФормы;
			
			ТаблицаОтчета.Вывести(ОбластьСтрока);
			НомерСтроки = НомерСтроки+1;
			
		КонецЦикла;	
		
		Если РезультатПН.Количество() > 0 Тогда
			Элементы.ОтправитьСМС.Видимость = Истина;
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры	
	
&НаСервере
// Процедура записи настроек отчета.
//
Процедура ЗаписатьНастройки()
	
	Для Каждого СтрокаНастройки Из структураОтчета Цикл
		
		НастройкаПользователя = РегистрыСведений.ЗначенияДополнительныхПравПользователя.СоздатьМенеджерЗаписи();
		НастройкаПользователя.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		НастройкаПользователя.Право = СтрокаНастройки.Настройка;
		НастройкаПользователя.Значение = СтрокаНастройки.Значение;
		НастройкаПользователя.Записать();
		
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти




