#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Настройка пользователя
//
// Параметры:
//  Пользователь		 - 	 - 
//  Настройка			 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция НастройкаПользователя(Пользователь, Настройка, СтруктурнаяЕдиница = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиПользователей.Значение
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Пользователь = &Пользователь
	|	И НастройкиПользователей.Настройка = &Настройка
	|	И НастройкиПользователей.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
	
	Запрос.УстановитьПараметр("Пользователь"         , Пользователь);
	Запрос.УстановитьПараметр("Настройка"            , Настройка);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"   , ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница , ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница));

	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Значение, Неопределено);
	
КонецФункции

// Установить настройку пользователя.
// 
// Параметры:
//  ЗначениеНастройки  - Произвольный - Значение настройки
//  ИмяНастройки - Строка - Имя настройки
//  Пользователь - СправочникСсылка.Пользователи, Неопределено - Пользователь
Процедура Установить(ЗначениеНастройки, ИмяНастройки, Пользователь = Неопределено, СтруктурнаяЕдиница = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	Если ТипЗнч(ИмяНастройки) = Тип("Строка") Тогда
	
		НастройкаНаименование = ПланыВидовХарактеристик.НастройкиПользователей[ИмяНастройки]; 
		НастройкаЗначение = ПланыВидовХарактеристик.НастройкиПользователей[ИмяНастройки].ТипЗначения.ПривестиЗначение(ЗначениеНастройки);
		
	ИначеЕсли ТипЗнч(ИмяНастройки) = Тип("ПланВидовХарактеристикСсылка.НастройкиПользователей") Тогда
		
		НастройкаНаименование = ИмяНастройки;
		НастройкаЗначение =	ЗначениеНастройки;
		
	КонецЕсли;
	
		
	
	НаборЗаписей = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Пользователь.Использование = Истина;
	НаборЗаписей.Отбор.Пользователь.Значение = Пользователь;
	НаборЗаписей.Отбор.Настройка.Использование = Истина;
	НаборЗаписей.Отбор.Настройка.Значение = НастройкаНаименование; // ПланыВидовХарактеристик.НастройкиПользователей[ИмяНастройки];
	НаборЗаписей.Отбор.СтруктурнаяЕдиница.Использование = Истина;
	НаборЗаписей.Отбор.СтруктурнаяЕдиница.Значение = СтруктурнаяЕдиница;

	Запись = НаборЗаписей.Добавить();

	Запись.Пользователь = Пользователь;
	Запись.Настройка = НастройкаНаименование; // ПланыВидовХарактеристик.НастройкиПользователей[ИмяНастройки];
	Запись.Значение = НастройкаЗначение; //ПланыВидовХарактеристик.НастройкиПользователей[ИмяНастройки].ТипЗначения.ПривестиЗначение(ЗначениеНастройки);
	Запись.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
	НаборЗаписей.Записать();

	ОбновитьПовторноИспользуемыеЗначения();

КонецПроцедуры

// Процедура - Установить настройки из массива структур.
//
Процедура УстановитьНастройкиИзМассиваСтруктур(МассивНастроек, Знач Пользователь = Неопределено, Знач СтруктурнаяЕдиница = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(МассивНастроек) Тогда
		Возврат;
	КонецЕсли;
	
	Пользователь = ?(ЗначениеЗаполнено(Пользователь), Пользователь, Пользователи.АвторизованныйПользователь());	
	СтруктурнаяЕдиница = ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
		
	НаборЗаписей = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Пользователь.Использование = Истина;
	НаборЗаписей.Отбор.Пользователь.Значение = Пользователь;
	НаборЗаписей.Отбор.СтруктурнаяЕдиница.Использование = Истина;
	НаборЗаписей.Отбор.СтруктурнаяЕдиница.Значение = СтруктурнаяЕдиница; 
	
	Для Каждого Настройка Из МассивНастроек Цикл 
		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		
		НоваяЗапись.Пользователь = Пользователь;
		НоваяЗапись.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
		НоваяЗапись.Настройка = Настройка.Настройка;
		НоваяЗапись.Значение = Настройка.Значение;

	КонецЦикла; 
		
	Попытка
		НаборЗаписей.Записать();
	Исключение
	КонецПопытки; 

КонецПроцедуры

// Функция - Получить настройки оповещения пользователя по взаимодействиям
//
// Параметры:
//  ТекущийПользователь	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьНастройкиОповещенияПользователяПоВзаимодействиям(ЗНАЧ ТекущийПользователь = Неопределено) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(ТекущийПользователь) Тогда 
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиПользователей.Ссылка КАК Настройка
	               |ПОМЕСТИТЬ ТаблицаНастроек
	               |ИЗ
	               |	ПланВидовХарактеристик.НастройкиПользователей КАК НастройкиПользователей
	               |ГДЕ
	               |	НастройкиПользователей.ПометкаУдаления = ЛОЖЬ
	               |	И НастройкиПользователей.Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОповещенияПоВзаимодействиям)
	               |	И НастройкиПользователей.ЭтоГруппа = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НастройкиПользователей.Настройка КАК Настройка,
	               |	НастройкиПользователей.Пользователь КАК Пользователь,
	               |	НастройкиПользователей.Значение КАК Значение
	               |ПОМЕСТИТЬ ТаблицаЗначенийНастроек
	               |ИЗ
	               |	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	               |ГДЕ
	               |	НастройкиПользователей.Настройка В
	               |			(ВЫБРАТЬ
	               |				ТаблицаНастроек.Настройка
	               |			ИЗ
	               |				ТаблицаНастроек)
	               |	И НастройкиПользователей.Пользователь = &ТекущийПользователь
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаНастроек.Настройка КАК Настройка,
	               |	ВЫБОР
	               |		КОГДА ТаблицаЗначенийНастроек.Значение ЕСТЬ NULL
	               |			ТОГДА ВЫБОР
	               |					КОГДА ТаблицаНастроек.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОповещатьОЗапланированныхЗадачах)
	               |						ТОГДА ЛОЖЬ
	               |					КОГДА ТаблицаНастроек.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОповещатьПриСозданииЗадач)
	               |						ТОГДА ЛОЖЬ
	               |					КОГДА ТаблицаНастроек.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.НеОповещатьОПросроченныхЗадачах)
	               |						ТОГДА ЛОЖЬ
	               |				КОНЕЦ
	               |		ИНАЧЕ ТаблицаЗначенийНастроек.Значение
	               |	КОНЕЦ КАК Значение,
	               |	ЕСТЬNULL(ТаблицаЗначенийНастроек.Пользователь, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Пользователь,
	               |	ТаблицаНастроек.Настройка.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	               |ИЗ
	               |	ТаблицаНастроек КАК ТаблицаНастроек
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЗначенийНастроек КАК ТаблицаЗначенийНастроек
	               |		ПО ТаблицаНастроек.Настройка = ТаблицаЗначенийНастроек.Настройка";
	
	Запрос.УстановитьПараметр("ТекущийПользователь"					, ТекущийПользователь);
	
	ВыборкаНастроек = Запрос.Выполнить().Выбрать();
	
	СтруктураНастроекОповещения = Новый Структура;
	
	Пока ВыборкаНастроек.Следующий() Цикл 
		СтруктураНастроекОповещения.Вставить(ВыборкаНастроек.ИмяПредопределенныхДанных, ВыборкаНастроек.Значение);
	КонецЦикла;	
	
	Возврат СтруктураНастроекОповещения;
	
КонецФункции

#КонецОбласти

#КонецЕсли   
