
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрЕдиницаОтбор = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница; 
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтрЕдиницаОтбор, ЗначениеЗаполнено(СтрЕдиницаОтбор));
	  
	Если Параметры.Свойство("Контрагент") Тогда 
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", Параметры.Контрагент, ЗначениеЗаполнено(Параметры.Контрагент));
	КонецЕсли;
	Если Параметры.Свойство("Статус") Тогда 
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Статус", Параметры.Статус, ЗначениеЗаполнено(Параметры.Статус));
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПРОВЕДЕННО_ИЗМЕНЕНИЕ_ДОКУМЕНТА_АВАНСА" Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
		   Элементы.Список.Обновить();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля СтрЕдиницаОтбор
//
Процедура СтрЕдиницаОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтрЕдиницаОтбор, ЗначениеЗаполнено(СтрЕдиницаОтбор));
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля КонтрагентОтбор
//
Процедура КонтрагентОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", КонтрагентОтбор, ЗначениеЗаполнено(КонтрагентОтбор));
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поля СотрудникОтбор.
//
Процедура СотрудникОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Сотрудник", СотрудникОтбор, ЗначениеЗаполнено(СотрудникОтбор));

КонецПроцедуры

&НаКлиенте
// Процедура - Сотрудник отбор начало выбора.
//
Процедура СотрудникОтборНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	мПараметрыВыбора = Новый Структура;
	мПараметрыВыбора.Вставить("СтруктурнаяЕдиница", ЭтотОбъект.СтрЕдиницаОтбор);
	мПараметрыВыбора.Вставить("ТекущаяСтрока"     , ЭтотОбъект.СотрудникОтбор);
	мПараметрыВыбора.Вставить("ОтбиратьВрачей"    , Истина); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СотрудникНачалоВыбораЗавершение", ЭтаФорма);	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", мПараметрыВыбора,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// При активации строки списка
//
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Если Не Элементы.Найти("СписокОплатитьДокумент") = Неопределено Тогда
			Элементы.СписокОплатитьДокумент.Доступность = НЕ ТекущиеДанные.ПометкаУдаления; 		
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()
	Возврат Документы.ПланЛечения.ПолучитьСписокПечатныхФорм();	
КонецФункции

&НаКлиенте
// Процедура - Обработка выбора документа печати
//
Процедура ОбработкаВыбораДокументаПечати(Результат, Параметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если Результат.Значение = "ПФ_MXL_ГарантийныйТалон" 
		ИЛИ Результат.Значение = "ПФ_MXL_Квитанция" Тогда
		
		 Параметры.ИмяДокумента = "Прием";
		
	КонецЕсли;
	
	УправлениеПечатьюКлиентСтоматология.ОбработкаКоманды(Результат, Параметры);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
// Обработчик кнопки проведения оплаты документа
//
Процедура ОплатитьДокумент(Команда)	
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;	
	Если НЕ ТекущиеДанные = Неопределено Тогда		
		Если ТекущиеДанные.Проведен Тогда		
			ПараметрыОплаты = Новый Структура;
			ПараметрыОплаты.Вставить("ДатаПродажи"                       , ТекущиеДанные.Дата);
			ПараметрыОплаты.Вставить("СтруктурнаяЕдиница"                , ТекущиеДанные.СтруктурнаяЕдиница);			
			ПараметрыОплаты.Вставить("ВидОперации"                       , ПредопределенноеЗначение("Перечисление.ВидыОпераций.Продажа"));
			ПараметрыОплаты.Вставить("Контрагент"                        , ТекущиеДанные.Контрагент);
			ПараметрыОплаты.Вставить("ДокументыПродажи"                  , ТекущиеДанные.Ссылка);
			ПараметрыОплаты.Вставить("ЗакрытьФормуАвтоматически"         , Истина);
			ПараметрыОплаты.Вставить("Касса"                             , ТекущиеДанные.Касса);

			ОткрытьФорму("Обработка.ПомощникПроведенияОплаты.Форма.ФормаОплаты", ПараметрыОплаты,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
			
		Иначе
			ПоказатьПредупреждение(,"Предварительно необходимо провести документ!");
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "ВнестиНаЛицевойСчет"
//
Процедура ВнестиНаЛицевойСчет(Команда)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;	
	Если НЕ ТекущиеДанные = Неопределено Тогда		
		Если ЗначениеЗаполнено(ТекущиеДанные.Контрагент) Тогда 
			ПараметрыФормы = Новый Структура("Контрагент", ТекущиеДанные.Контрагент);
			ОткрытьФорму("Обработка.ПомощникПроведенияОплаты.Форма.ДиалогВзносаНаЛицевойСчет", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе 
			ПоказатьПредупреждение(,"В документе не указан пациент!");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура печати.
//
Процедура ДокументПечать(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "ПланЛечения");	
	Структура.Вставить("МассивДокументов", Элементы.Список.ВыделенныеСтроки);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораДокументаПечати", ЭтотОбъект, Структура);									
	
	ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, ТекущийЭлемент);

КонецПроцедуры

&НаКлиенте
// Процедура - Сотрудник начало выбора продолжение завершение.
//
Процедура СотрудникНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда 
		ЭтотОбъект.СотрудникОтбор = Результат;
		СотрудникОтборПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
