////////////////////////////////////////////////////////////////////////////////
// Подсистема "Резервное копирование ИБ".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет обработчик ожидания старта автоматического резервного копирования
// в процессе работы пользователя, а также повторного оповещения после игнорировании первоначального.
//
Процедура ОбработчикДействийРезервногоКопированияСтоматология() Экспорт 
	
	РезервноеКопированиеИБКлиент.ОбработчикОжиданияЗапуска();
	
КонецПроцедуры

#КонецОбласти
