///////////////////////////////////////////
//	ВЕРСИЯ ПОДСИСТЕМЫ

#Область СлужебныеПроцедурыИФункции

Функция		ПолучитьВерсиюПодсистемы() Экспорт
	
    Возврат "1.0.0.0";
	

КонецФункции

///////////////////////////////////////////
//	ПРОВЕРКА ЗАВЕРШЕНИЯ РАБОТЫ ПОЛЬЗОВАТЕЛЯ

Процедура 	ЗапускВыполненияОблачногоАрхива() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

Функция 	ПроверитьНеобходимостьЗавершенияРаботыПользователя() Экспорт

	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное("ПроверкаНеобходимостиЗавершенияРаботы");
	
	Если РегламентноеЗадание.Расписание.ТребуетсяВыполнение(ТекущаяДата()) Тогда
		
		Возврат "Завершать работу";
		
	ИначеЕсли РегламентноеЗадание.Расписание.ТребуетсяВыполнение(ТекущаяДата() + 180) Тогда
		
		Возврат "Предупредить пользователя";
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти