
#Область ПрограммныйИнтерфейс

// Получить текущие напоминания текущего пользователя.Если передать ссылку на клиента
// будет произведено получение задач и по посещениям
Процедура ПроверитьТекущиеНапоминанияВзаимодействий() Экспорт
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено()
		И НЕ ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбновлениеИнформационнойБазыВызовСервера.НеобходимоОбновлениеИнформационнойБазы() Тогда // При обновлении вылетает исключение: Недопустимая операция для формы начальной страницы
		ПодключитьОбработчикОжидания("ПроверитьТекущиеНапоминанияВзаимодействий", 300, Истина);
		Возврат;
	КонецЕсли;
	
	СтруктураСтекаОповещения = СтоматологияСервер.ПолучитьСтруктуруСтекаОповещенияПользователя();
	
	ЗадачиПользователя = СтруктураСтекаОповещения.МассивВзаимодействийДляУникальныхОповещений;
	
	// Открыть форму напоминания списка текущих задач пользователя (напоминания настроены в самой задаче)
	ФормаНапоминания = ПолучитьФорму("Задача.Взаимодействие.Форма.ФормаНапоминания", Новый Структура("Задачи", ЗадачиПользователя), , "НапоминанияПользователюОЗадачахВзаимодействий");	
	Если ЗадачиПользователя.Количество() > 0 Тогда
		Если ФормаНапоминания.Открыта() Тогда
			ФормаНапоминания.ЗагрузитьЗадачи(ЗадачиПользователя);
		Иначе 
			ФормаНапоминания.Открыть();
		КонецЕсли;
	ИначеЕсли ЗадачиПользователя.Количество() = 0 И ФормаНапоминания.Открыта() Тогда
		Попытка //очень редкий глюк пользователя, когда форма не открыта, а метод Открыта() возвращает Истину 
			ФормаНапоминания.Закрыть();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	// Общие оповещения по задачам пользователя
	Для Каждого ОповещениеПользователя Из СтруктураСтекаОповещения.МассивВзаимодействийДляНеУникальныхОповещений Цикл
		Если ОповещениеПользователя.Просрочена Тогда 
			ЗаголовокОповещения = Новый ФорматированнаяСтрока(ОповещениеПользователя.ЗаголовокОповещения, , Новый Цвет(222, 33, 33)); 
		ИначеЕсли ОповещениеПользователя.Новая Тогда 
			ЗаголовокОповещения = Новый ФорматированнаяСтрока(ОповещениеПользователя.ЗаголовокОповещения, , Новый Цвет(0, 112, 210)); 
		Иначе 
			ЗаголовокОповещения = ОповещениеПользователя.ЗаголовокОповещения;
		КонецЕсли;	
		ПоказатьОповещениеПользователя(ЗаголовокОповещения,
										ОповещениеПользователя.НавигационнаяСсылка,
										СокрЛП(Строка(ОповещениеПользователя.ВзаимодействиеПредставление)),
										?(ОповещениеПользователя.Новая, БиблиотекаКартинок.НоваяЗадача, БиблиотекаКартинок.Будильник24),
										СтатусОповещенияПользователя.Важное,
										ОповещениеПользователя.КлючУникальности);	
	КонецЦикла;
	
	// Подключаем заново
	ПодключитьОбработчикОжидания("ПроверитьТекущиеНапоминанияВзаимодействий", 300, Истина); // Каждые 5 минут.
	
КонецПроцедуры

#КонецОбласти
