
#Область СлужебныеПроцедурыИФункции

// Процедура печати элемента справочника.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТехнологическаяКарта") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ТехнологическаяКарта",
		"Технологическая карта",
		СформироватьПечатнуюФормуТехнологическойКарты(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		
	КонецЕсли;
	
КонецПроцедуры 

// Функция - Сформировать печатную форму технологической карты
//
// Параметры:
//  ОбъектПечати	 - 	 - 
//  ОбъектыПечати	 - 	 - 
//  ПараметрыПечати	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьПечатнуюФормуТехнологическойКарты(ОбъектПечати, ОбъектыПечати, ПараметрыПечати)
	
	Макет = УправлениеПечатью.ПолучитьМакет("Справочник.Номенклатура.ТехнологическаяКарта");
	Если ПараметрыПечати.Свойство("ОтборСтруктурнаяЕдиница") Тогда 
		
		ОтборСтруктурнаяЕдиница = ПараметрыПечати.ОтборСтруктурнаяЕдиница;
		
		Если ОтборСтруктурнаяЕдиница.Пустая() Тогда
			ОтборСтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
		КонецЕсли;
		
	Иначе
		ОтборСтруктурнаяЕдиница = Неопределено;
	КонецЕсли;	
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТехнологическаяКарта";
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

	Для Каждого ТекущийОбъект Из ОбъектПечати Цикл
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		Руководитель = ПолучитьОтветственноеЛицо(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.Организация, Перечисления.ТипыОтветственныхЛиц.Руководитель);
		Организация  = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.Организация;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаФормы");
		ОбластьМакета.Параметры.НаименованиеОрганизации = ?(ЗначениеЗаполнено(Организация), Организация.ПолноеНаименование(), Неопределено);
		ОбластьМакета.Параметры.ПолеУслуга      		= Строка(ТекущийОбъект.ТипНоменклатуры)+": ";
		ОбластьМакета.Параметры.ДолжностьРуководителя 	= Руководитель.Должность;
		ОбластьМакета.Параметры.ФИОРуководителя 		= Руководитель.ФИО;
		ОбластьМакета.Параметры.ДатаТехКарты 			= ТекущаяДата();	
		ОбластьМакета.Параметры.Услуга      			= ТекущийОбъект.Наименование;	
		ОбластьМакета.Параметры.РозничнаяЦена 			= ПолучитьЦенуНоменклатуры(ТекущийОбъект.Ссылка,, Справочники.УпаковкиНоменклатуры.ПустаяСсылка(), ПредопределенноеЗначение("Справочник.ВидыЦен.Розничная"));
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьМакетаСтруктурнаяЕдиница = Макет.ПолучитьОбласть("СтруктурнаяЕдиница");
		
		Индекс	= 0;
		Итог	= 0;
		
		Если ОтборСтруктурнаяЕдиница = Неопределено Тогда  // эта ветка не используется. вызывается с отбором по СЕ
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НормыСписанияМатериалов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			|	НормыСписанияМатериалов.Материал КАК Материал,
			|	НормыСписанияМатериалов.СкладСписания КАК СкладСписания,
			|	НормыСписанияМатериалов.Партия КАК Партия,
			|	НормыСписанияМатериалов.Количество КАК Количество,
			|	НормыСписанияМатериалов.Упаковка КАК Упаковка
			|ИЗ
			|	РегистрСведений.НормыСписанияМатериалов КАК НормыСписанияМатериалов
			|ГДЕ
			|	НормыСписанияМатериалов.Номенклатура = &Номенклатура
			|	И ВЫБОР
			|			КОГДА &ОтборПоСЕ = ИСТИНА
			|				ТОГДА НормыСписанияМатериалов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|ИТОГИ ПО
			|	СтруктурнаяЕдиница");
			
			Запрос.УстановитьПараметр("Номенклатура"	  , ТекущийОбъект);
			Запрос.УстановитьПараметр("ОтборПоСЕ"		  , ?(ОтборСтруктурнаяЕдиница = Неопределено, Ложь, Истина));
			Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаСтруктурнаяЕдиница = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаСтруктурнаяЕдиница.Следующий() Цикл
				
				ОбластьМакетаСтруктурнаяЕдиница.Параметры.СтруктурнаяЕдиница = ВыборкаСтруктурнаяЕдиница.СтруктурнаяЕдиница;
				ТабДокумент.Вывести(ОбластьМакетаСтруктурнаяЕдиница);
				
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
				ТабДокумент.Вывести(ОбластьМакета);
				
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицы");
				
				Выборка = ВыборкаСтруктурнаяЕдиница.Выбрать();
				
				Пока Выборка.Следующий() Цикл 
					Индекс = Индекс + 1;
					ОбластьМакета.Параметры.Номер = Индекс;
					ОбластьМакета.Параметры.Наименование = Выборка.Материал;
					ОбластьМакета.Параметры.ЕдиницаИзмерения = Выборка.Материал.ЕдиницаИзмерения;
					
					Если ЗначениеЗаполнено(Выборка.Упаковка) Тогда
						Количество = Выборка.Упаковка.Коэффициент * Выборка.Количество;
					Иначе
						Количество = Выборка.Количество;
					КонецЕсли;	
					ОбластьМакета.Параметры.Количество = Количество;
					ОбластьМакета.Параметры.Себестоимость = ПолучитьЦенуНоменклатуры(Выборка.Материал, Количество, Выборка.Упаковка, ПредопределенноеЗначение("Справочник.ВидыЦен.Закупочная"));
					
					Итог = Итог + ОбластьМакета.Параметры.Себестоимость;
					ТабДокумент.Вывести(ОбластьМакета);
				КонецЦикла;
				
			КонецЦикла;
			
		Иначе
			
			ТаблицаНормСписания = РегистрыСведений.НормыСписанияМатериалов.ПолучитьНормыСписанияМатериалов(ОбъектПечати[0], ОтборСтруктурнаяЕдиница);
			
			ОбластьМакетаСтруктурнаяЕдиница.Параметры.СтруктурнаяЕдиница = "" + ?(ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница), ОтборСтруктурнаяЕдиница, "Общие нормы списания")+ "" + ?(ТаблицаНормСписания.Количество() = 0, " (нормы списания не используются)", "");
			
			ТабДокумент.Вывести(ОбластьМакетаСтруктурнаяЕдиница);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицы"); 
			ВидЦены = ?(ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница.ВидЦенРеализации), ОтборСтруктурнаяЕдиница.ВидЦенРеализации, Справочники.ВидыЦен.Закупочная);
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТаблицаНормСписания"	, ТаблицаНормСписания);
			Запрос.УстановитьПараметр("ДатаОбработки"		, ТекущаяДатаСеанса());
			Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, ОтборСтруктурнаяЕдиница);
			Запрос.УстановитьПараметр("ВидЦен"				, ВидЦены);	
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаНормСписания.Материал КАК Материал,
			|	ТаблицаНормСписания.Упаковка КАК Упаковка
			|ПОМЕСТИТЬ ВременнаяТаблицаНормСписания
			|ИЗ
			|	&ТаблицаНормСписания КАК ТаблицаНормСписания
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВременнаяТаблицаНормСписания.Материал КАК Номенклатура,
			|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка,
			|	ЦеныНоменклатурыСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
			|ИЗ
			|	ВременнаяТаблицаНормСписания КАК ВременнаяТаблицаНормСписания
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
			|				&ДатаОбработки,
			|				Актуальность = ИСТИНА
			|					И (СтруктурнаяЕдиница = &СтруктурнаяЕдиница
			|						ИЛИ СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
			|					И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних
			|		ПО ВременнаяТаблицаНормСписания.Материал = ЦеныНоменклатурыСрезПоследних.Номенклатура
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВременнаяТаблицаНормСписания.Материал,
			|	ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент";
			
			ТаблицаЦен = Запрос.Выполнить().Выгрузить();      
			
			Для Каждого СтрокаТЗ Из ТаблицаНормСписания Цикл
				Индекс = Индекс + 1;
				ОбластьМакета.Параметры.Номер = Индекс;
				ОбластьМакета.Параметры.Наименование		= СтрокаТЗ.Материал;
				ОбластьМакета.Параметры.ЕдиницаИзмерения	= ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрокаТЗ.Материал, "ЕдиницаИзмерения");
				
				Количество = ?(ЗначениеЗаполнено(СтрокаТЗ.Упаковка), СтрокаТЗ.Упаковка.Коэффициент * СтрокаТЗ.Количество, СтрокаТЗ.Количество);
				
				ОбластьМакета.Параметры.Количество			= Количество;
				//ОбластьМакета.Параметры.Себестоимость		= ПолучитьЦенуНоменклатуры(СтрокаТЗ.Материал, Количество, СтрокаТЗ.Упаковка, ПредопределенноеЗначение("Справочник.ВидыЦен.Закупочная"));
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("Номенклатура"			, СтрокаТЗ.Материал);
				СтруктураПараметров.Вставить("Упаковка"				, СтрокаТЗ.Упаковка);
				СтруктураПараметров.Вставить("СтруктурнаяЕдиница"	, ОтборСтруктурнаяЕдиница);
				
				ТаблицаЦенМатериала = ТаблицаЦен.Скопировать(Новый Структура("Номенклатура", СтрокаТЗ.Материал));
				
				Цена = Ценообразование.ВозвратитьЦенуУпаковкиИзТаблицыЦен(ТаблицаЦенМатериала, СтруктураПараметров);
				//Цена = Ценообразование.ОкруглитьЦену(Цена, ВидЦены.ПорядокОкругления, ВидЦены.ОкруглятьВБольшуюСторону);
				
				ОбластьМакета.Параметры.Себестоимость	=  Цена * СтрокаТЗ.Количество;// * Количество;      
					
				Итог = Итог + ОбластьМакета.Параметры.Себестоимость;
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЦикла;        		
			
		КонецЕсли;
		
	КонецЦикла;
	ОбластьМакета = Макет.ПолучитьОбласть("ИтоговаяСтрокаТаблицы");
	ОбластьМакета.Параметры.Итог = Итог;
	ТабДокумент.Вывести(ОбластьМакета);
	
	
	ОбластьМакета = Макет.ПолучитьОбласть("ПодвалФормы");
	ОбластьМакета.Параметры.ДолжностьРуководителя = Руководитель.Должность;
	ОбластьМакета.Параметры.ФИОРуководителя = Руководитель.ФИО;
	ОбластьМакета.Параметры.ФИОБухгалтера = ПолучитьОтветственноеЛицо(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.Организация, Перечисления.ТипыОтветственныхЛиц.ГлавныйБухгалтер).ФИО;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	//УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ОбъектПечати);
	
	Возврат ТабДокумент;
	
КонецФункции 

// Функция - Получить ответственное лицо
//
// Параметры:
//  Организация				 - 	 - 
//  ТипОтветственногоЛица	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьОтветственноеЛицо(Организация, ТипОтветственногоЛица)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтветственныеЛицаСрезПоследних.Сотрудник,
	|	ОтветственныеЛицаСрезПоследних.Должность
	|ИЗ
	|	РегистрСведений.ОтветственныеЛица.СрезПоследних КАК ОтветственныеЛицаСрезПоследних
	|ГДЕ
	|	ОтветственныеЛицаСрезПоследних.Организация = &Организация
	|	И ОтветственныеЛицаСрезПоследних.ТипОтветственногоЛица = &ТипОтветственногоЛица");
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТипОтветственногоЛица", ТипОтветственногоЛица);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Новый Структура("ФИО, Должность", Результат.Сотрудник, Результат.Должность);
	Иначе
		Возврат Новый Структура("ФИО, Должность", "", "");
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЦенуНоменклатуры(Ссылка, Количество = 1, Упаковка, ВидЦен, СтруктурнаяЕдиница = Неопределено) Экспорт
	
	СтруктурнаяЕдиница = ?(СтруктурнаяЕдиница = Неопределено, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница, СтруктурнаяЕдиница);
	
	ЗапросЦенаНоменклатуры = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка,
	|	ЦеныНоменклатурыСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			,
	|			Актуальность = ИСТИНА
	|				И ВидЦен = &ВидЦен
	|				И Номенклатура = &Ссылка
	|				И (СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|					ИЛИ СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))) КАК ЦеныНоменклатурыСрезПоследних");
	
	ЗапросЦенаНоменклатуры.УстановитьПараметр("Ссылка"			  , Ссылка);
	ЗапросЦенаНоменклатуры.УстановитьПараметр("ВидЦен"			  , ВидЦен);
	ЗапросЦенаНоменклатуры.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	Результат = ЗапросЦенаНоменклатуры.Выполнить().Выгрузить();
	
	СтрокаТЧ = Результат.Найти(Упаковка, "Упаковка");
	Если СтрокаТЧ <> Неопределено Тогда
		Если ЗначениеЗаполнено(СтрокаТЧ.Упаковка) Тогда
			Возврат (СтрокаТЧ.Цена / СтрокаТЧ.Упаковка.Коэффициент) * ?(Количество > 0, Количество, 1)
		Иначе
			Возврат СтрокаТЧ.Цена * ?(Количество > 0, Количество, 1);
		КонецЕсли;
	ИначеЕсли Результат.Количество() > 0 Тогда
		Если ЗначениеЗаполнено(Результат[0].Упаковка) Тогда
			Возврат (Результат[0].Цена / Результат[0].Упаковка.Коэффициент) * ?(Количество > 0, Количество, 1);
		Иначе
			Возврат Результат[0].Цена * ?(Количество > 0, Количество, 1);
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Функция возвращает список имен «ключевых» реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ТипНоменклатуры");
	
	Возврат Результат;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()

// Возвращает список реквизитов, которые разрешается редактировать
// с помощью обработки группового изменения объектов.
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	РедактируемыеРеквизиты = Новый Массив;
	
	РедактируемыеРеквизиты.Добавить("ТипНоменклатуры");
	РедактируемыеРеквизиты.Добавить("ЕдиницаИзмерения");
	РедактируемыеРеквизиты.Добавить("ИспользоватьПартии");
	РедактируемыеРеквизиты.Добавить("Комментарий");
	РедактируемыеРеквизиты.Добавить("Номинал");
	// РедактируемыеРеквизиты.Добавить("ВидНоминала");
	РедактируемыеРеквизиты.Добавить("Периодичность");
	РедактируемыеРеквизиты.Добавить("СтавкаНДС");
	// РедактируемыеРеквизиты.Добавить("УпаковкаДляОтчета");
	// РедактируемыеРеквизиты.Добавить("УпаковкаПоУмолчанию");
	РедактируемыеРеквизиты.Добавить("НормаВремени");
	РедактируемыеРеквизиты.Добавить("ТипСрокаДействия");
	РедактируемыеРеквизиты.Добавить("КоличествоПериодовДействия");
	РедактируемыеРеквизиты.Добавить("ДатаОкончанияДействия");	
	// РедактируемыеРеквизиты.Добавить("ВидСертификата");
	РедактируемыеРеквизиты.Добавить("ЭтоИменнойСертификат");
	РедактируемыеРеквизиты.Добавить("СертификатМногоразовоеИспользование");
	РедактируемыеРеквизиты.Добавить("Гарантия");
    РедактируемыеРеквизиты.Добавить("СкидкиЗапрещены");
	РедактируемыеРеквизиты.Добавить("Специализация");
	РедактируемыеРеквизиты.Добавить("ВПродаже");
	
	Возврат РедактируемыеРеквизиты;
	
КонецФункции

// Функция расширенного отбора номенклатур
// Возврат значений: Артикул, Номенклатура, Родитель, Цена, ИндКартинки, ЕдиницаИзмерения,НормаВремени
Функция ОтборНоменклатур(ОтборДата = Неопределено,
	                     ОтборСтруктурнаяЕдиница = Неопределено,
						 ОтборСегмент = Неопределено,
						 ОтборСписокРазрешенныхТипов = Неопределено,
						 ОтборВидЦен = Неопределено,
						 ОтборТолькоРеализованныхСертификатов = Неопределено,
						 ПараметрыФильтра = Неопределено,
						 ОтборТолькоПоНаименованию = Ложь,
						 ОтборТолькоПоАртикулу = Ложь,
						 ОтборСегментПоСогласованию = Неопределено,
						 ОтборВПродаже = Истина,
						 ОтборПоДоговоруПолиса = Неопределено,
						 ПолисМедСтрахования = Неопределено) Экспорт
	
	ОтборПоНаименованию = Неопределено;	
	Если ЗначениеЗаполнено(ПараметрыФильтра) Тогда
		ОтборПоНаименованию = ПараметрыФильтра;
	КонецЕсли;
	
	// Подготовка массива отбора по сегментам
	ОтборСегментМассив = Неопределено;
	Если ОтборСегмент <> Неопределено И НЕ ОтборСегмент = Справочники.СегментыНоменклатуры.ПустаяСсылка() Тогда
		Если ТипЗнч(ОтборСегмент) = Тип("Массив") ИЛИ ТипЗнч(ОтборСегмент) = Тип("СписокЗначений") Тогда
			ОтборСегментМассив = ОтборСегмент;
		Иначе	
			ОтборСегментМассив = Новый Массив;
			ОтборСегментМассив.Добавить(ОтборСегмент);
		КонецЕсли;
	Иначе
		ОтборСегментМассив = Новый Массив;
		ОтборСегментМассив.Добавить("Все");
	КонецЕсли;
	
	ОтборДоговорПоПолисуМассив = Новый Массив;
	Если ОтборПоДоговоруПолиса = Неопределено ИЛИ ОтборПоДоговоруПолиса = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда
		ОтборДоговорПоПолисуМассив.Добавить("Отсутствует");		
	Иначе
		ОтборДоговорПоПолисуМассив.Добавить(ОтборПоДоговоруПолиса);	
	КонецЕсли;

	ПодсчетКоличестваОказанныхУслугПоПолису = Новый Массив;
	Если ПолисМедСтрахования = Неопределено ИЛИ ПолисМедСтрахования = Справочники.ПолисыМедицинскогоСтрахования.ПустаяСсылка() Тогда
		ПодсчетКоличестваОказанныхУслугПоПолису.Добавить("Отсутствует");		
	Иначе
		ПодсчетКоличестваОказанныхУслугПоПолису.Добавить(ПолисМедСтрахования);	
	КонецЕсли;
	
	
	ОтборВПродаже = ?(ОтборВПродаже = Истина, Истина, Ложь);
	
	// Запрос к справочнику номенклатур
	ВыборкаНоменклатур      = Новый Запрос;
	ВыборкаНоменклатур.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапросЛечение.Номенклатура КАК ЛечениеНоменклатура,
	|	СУММА(ВложенныйЗапросЛечение.Количество) КАК ЛечениеКоличество
	|ПОМЕСТИТЬ ВТОказаноПоПолису
	|ИЗ
	|	Документ.Прием КАК Прием
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ПриемЛечение.Количество) КАК Количество,
	|			ПриемЛечение.Номенклатура КАК Номенклатура,
	|			ПриемЛечение.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.Прием.Лечение КАК ПриемЛечение
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПриемЛечение.Номенклатура,
	|			ПриемЛечение.Ссылка) КАК ВложенныйЗапросЛечение
	|		ПО Прием.Ссылка = ВложенныйЗапросЛечение.Ссылка
	|ГДЕ
	|	Прием.ПолисМедСтрахования В(&ПолисМедСтрахования)
	|	И НЕ ""Отсутствует"" В (&ПолисМедСтрахования)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапросЛечение.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоговорыКонтрагентовУслугиПоДоговору.Номенклатура КАК Номенклатура,
	|	ДоговорыКонтрагентовУслугиПоДоговору.Согласование КАК Согласование,
	|	ДоговорыКонтрагентовУслугиПоДоговору.Количество КАК Количество,
	|	ДоговорыКонтрагентовУслугиПоДоговору.КоличествоПриПревышении КАК КоличествоПриПревышении,
	|	ЕСТЬNULL(ДоговорыКонтрагентовОграничениеЗубов.КоличествоЗубов, 0) КАК КоличествоЗубов,
	|	ЕСТЬNULL(ДоговорыКонтрагентовОграничениеЗубов.КоличествоВПриеме, 0) КАК КоличествоВПриеме,
	|	ЕСТЬNULL(ДоговорыКонтрагентовОграничениеЗубов.НаименованиеОграничения, """") КАК НаименованиеОграничения
	|ПОМЕСТИТЬ ВТУслугиПоДоговору
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.УслугиПоДоговору КАК ДоговорыКонтрагентовУслугиПоДоговору
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ОграничениеЗубов КАК ДоговорыКонтрагентовОграничениеЗубов
	|		ПО ДоговорыКонтрагентовУслугиПоДоговору.Ссылка = ДоговорыКонтрагентовОграничениеЗубов.Ссылка
	|			И ДоговорыКонтрагентовУслугиПоДоговору.КлючСтроки = ДоговорыКонтрагентовОграничениеЗубов.КлючСтроки
	|ГДЕ
	|	ДоговорыКонтрагентовУслугиПоДоговору.Ссылка В(&СсылкаДоговорПоПолису)
	|	И НЕ ""Отсутствует"" В (&СсылкаДоговорПоПолису)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписокНоменклатуры.Артикул КАК Артикул,
	|	СписокНоменклатуры.Ссылка КАК Номенклатура,
	|	СписокНоменклатуры.Родитель КАК Родитель,
	|	ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент, 1) КАК Цена,
	|	ВЫБОР
	|		КОГДА СписокНоменклатуры.Ссылка.ЭтоГруппа = ИСТИНА
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СписокНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|					ТОГДА 4
	|				ИНАЧЕ 2
	|			КОНЕЦ
	|	КОНЕЦ КАК ИндКартинки,
	|	СписокНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СписокНоменклатуры.НормаВремени КАК НормаВремени,
	|	СписокНоменклатуры.УпаковкаПоУмолчанию КАК Упаковка,
	|	СписокНоменклатуры.СкидкиЗапрещены КАК СкидкиЗапрещены,
	|	СписокНоменклатуры.Наименование КАК Наименование,
	|	ВЫБОР
	|		КОГДА &СегментПоСогласованию <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫБОР
	|					КОГДА ОтборНоменклатураСегмента.Сегмент = &СегментПоСогласованию
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НоменклатураПоСогласованию,
	|	СписокНоменклатуры.Бесплатно КАК Бесплатно,
	|	ВТУслугиПоДоговору.Согласование КАК ПолисСогласование,
	|	ВТУслугиПоДоговору.Количество КАК ПолисКоличество,
	|	ВТУслугиПоДоговору.КоличествоПриПревышении КАК ПолисКоличествоПриПревышении,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТУслугиПоДоговору.Количество, НЕОПРЕДЕЛЕНО) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПолисНеограничено,
	|	ВТУслугиПоДоговору.КоличествоЗубов КАК КоличествоЗубов,
	|	ВТУслугиПоДоговору.КоличествоВПриеме КАК КоличествоВПриеме,
	|	ВТУслугиПоДоговору.НаименованиеОграничения КАК НаименованиеОграничения
	|ИЗ
	|	Справочник.Номенклатура КАК СписокНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&НаДату,
	|				Актуальность = ИСТИНА
	|					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|					И ВидЦен = &ВидЦен
	|					И Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО СписокНоменклатуры.Ссылка = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			НоменклатураСегмента.Сегмент КАК Сегмент,
	|			НоменклатураСегмента.Номенклатура КАК Номенклатура
	|		ИЗ
	|			РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|		ГДЕ
	|			НоменклатураСегмента.Сегмент В(&Сегмент)
	|			И НЕ ""Все"" В (&Сегмент)
	|			И ВЫБОР
	|					КОГДА НЕ &СписокРазрешенныхТипов ЕСТЬ NULL
	|						ТОГДА НоменклатураСегмента.Номенклатура.ТипНоменклатуры В (&СписокРазрешенныхТипов)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ОтборНоменклатураСегмента
	|		ПО СписокНоменклатуры.Ссылка = ОтборНоменклатураСегмента.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыНоменклатуры.СрезПоследних(&НаДату, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК СтатусыНоменклатурыСрезПоследних
	|		ПО (СтатусыНоменклатурыСрезПоследних.Номенклатура = СписокНоменклатуры.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОказаноПоПолису КАК ВТОказаноПоПолису
	|		ПО СписокНоменклатуры.Ссылка = ВТОказаноПоПолису.ЛечениеНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУслугиПоДоговору КАК ВТУслугиПоДоговору
	|		ПО СписокНоменклатуры.Ссылка = ВТУслугиПоДоговору.Номенклатура
	|ГДЕ
	|	(""Все"" В (&Сегмент)
	|			ИЛИ СписокНоменклатуры.Ссылка В (ОтборНоменклатураСегмента.Номенклатура))
	|	И НЕ СписокНоменклатуры.ПометкаУдаления
	|	И СписокНоменклатуры.ЭтоГруппа = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА НЕ &СписокРазрешенныхТипов ЕСТЬ NULL
	|				ТОГДА СписокНоменклатуры.ТипНоменклатуры В (&СписокРазрешенныхТипов)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ВПродаже = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЕСТЬNULL(СтатусыНоменклатурыСрезПоследних.ВПродаже, ИСТИНА)
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ТолькоПроданныеСертификаты
	|					И СписокНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|				ТОГДА СписокНоменклатуры.Ссылка В
	|						(ВЫБРАТЬ
	|							СертификатыОстатки.Сертификат
	|						ИЗ
	|							РегистрНакопления.Сертификаты.Остатки КАК СертификатыОстатки
	|						СГРУППИРОВАТЬ ПО
	|							СертификатыОстатки.Сертификат
	|						ИМЕЮЩИЕ
	|							СУММА(СертификатыОстатки.СуммаОстаток) > 0)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборНаименование <> """"
	|				ТОГДА ВЫБОР
	|						КОГДА &ОтборТолькоПоНаименованию
	|							ТОГДА СписокНоменклатуры.Наименование ПОДОБНО &ОтборНаименование
	|						КОГДА &ОтборТолькоПоАртикулу
	|							ТОГДА СписокНоменклатуры.Артикул ПОДОБНО &ОтборПоАртикулу
	|						ИНАЧЕ СписокНоменклатуры.Артикул ПОДОБНО &ОтборПоАртикулу
	|								ИЛИ СписокНоменклатуры.Наименование ПОДОБНО &ОтборНаименование
	|					КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И &УсловиеУслугиПоДоговору
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокНоменклатуры.Ссылка,
	|	СписокНоменклатуры.Родитель,
	|	СписокНоменклатуры.ЕдиницаИзмерения,
	|	СписокНоменклатуры.НормаВремени,
	|	ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент, 1),
	|	СписокНоменклатуры.Артикул,
	|	СписокНоменклатуры.УпаковкаПоУмолчанию,
	|	СписокНоменклатуры.СкидкиЗапрещены,
	|	СписокНоменклатуры.Наименование,
	|	ВЫБОР
	|		КОГДА &СегментПоСогласованию <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫБОР
	|					КОГДА ОтборНоменклатураСегмента.Сегмент = &СегментПоСогласованию
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СписокНоменклатуры.Ссылка.ЭтоГруппа = ИСТИНА
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СписокНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|					ТОГДА 4
	|				ИНАЧЕ 2
	|			КОНЕЦ
	|	КОНЕЦ,
	|	СписокНоменклатуры.Бесплатно,
	|	ВТУслугиПоДоговору.Согласование,
	|	ВТУслугиПоДоговору.Количество,
	|	ВТУслугиПоДоговору.КоличествоПриПревышении,
	|	ВТУслугиПоДоговору.КоличествоЗубов,
	|	ВТУслугиПоДоговору.КоличествоВПриеме,
	|	ВТУслугиПоДоговору.НаименованиеОграничения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Артикул,
	|	СписокНоменклатуры.Наименование";
	
	УсловиеУслугиПоДоговору = 
	"И ВЫБОР КОГДА СписокНоменклатуры.ТипНоменклатуры = Значение(Перечисление.ТипыНоменклатуры.Услуга) Тогда СписокНоменклатуры.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТУслугиПоДоговору.Номенклатура КАК Номенклатура
	|			ИЗ
	|				ВТУслугиПоДоговору КАК ВТУслугиПоДоговору)ИНАЧЕ ИСТИНА КОНЕЦ";
	ВыборкаНоменклатур.Текст = СтрЗаменить(ВыборкаНоменклатур.Текст, "И &УсловиеУслугиПоДоговору", ?(ЗначениеЗаполнено(ПолисМедСтрахования), УсловиеУслугиПоДоговору, ""));

	ВыборкаНоменклатур.УстановитьПараметр("ОтборТолькоПоАртикулу"               , ОтборТолькоПоАртикулу);
	ВыборкаНоменклатур.УстановитьПараметр("ОтборТолькоПоНаименованию"           , ОтборТолькоПоНаименованию);
	ВыборкаНоменклатур.УстановитьПараметр("Сегмент"                             , ОтборСегментМассив);
	ВыборкаНоменклатур.УстановитьПараметр("ВПродаже"							, ОтборВПродаже);                           
	ВыборкаНоменклатур.УстановитьПараметр("ОтборПоАртикулу"                   	, ?(ЗначениеЗаполнено(ОтборПоНаименованию)       , "%" + ОтборПоНаименованию + "%", ""));
	ВыборкаНоменклатур.УстановитьПараметр("ОтборНаименование"                   , ?(ЗначениеЗаполнено(ОтборПоНаименованию)       , "%" + ОтборПоНаименованию + "%",""));	
	ВыборкаНоменклатур.УстановитьПараметр("СписокРазрешенныхТипов"              , ?(ЗначениеЗаполнено(ОтборСписокРазрешенныхТипов) И ОтборСписокРазрешенныхТипов.Количество() > 0 ,ОтборСписокРазрешенныхТипов,NULL));
	ВыборкаНоменклатур.УстановитьПараметр("СтруктурнаяЕдиница"                  , ?(ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница)   , ОтборСтруктурнаяЕдиница, Неопределено));
	ВыборкаНоменклатур.УстановитьПараметр("ВидЦен"                              , ?(ЗначениеЗаполнено(ОтборВидЦен)               , ОтборВидЦен, Неопределено));
	ВыборкаНоменклатур.УстановитьПараметр("НаДату"                			    , ?(ЗначениеЗаполнено(ОтборДата)                 , ОтборДата, Неопределено));
	ВыборкаНоменклатур.УстановитьПараметр("ТолькоПроданныеСертификаты"			, ?(ЗначениеЗаполнено(ОтборТолькоРеализованныхСертификатов),ОтборТолькоРеализованныхСертификатов,ЛОжь));                           
	ВыборкаНоменклатур.УстановитьПараметр("СегментПоСогласованию"				, ?(ЗначениеЗаполнено(ОтборСегментПоСогласованию),ОтборСегментПоСогласованию,Неопределено));                           
	ВыборкаНоменклатур.УстановитьПараметр("СсылкаДоговорПоПолису"				, ОтборДоговорПоПолисуМассив);
	ВыборкаНоменклатур.УстановитьПараметр("ПолисМедСтрахования"					, ПодсчетКоличестваОказанныхУслугПоПолису);
	
	Возврат ВыборкаНоменклатур.Выполнить().Выгрузить();	
	
КонецФункции	

// Функция расширенного отбора номенклатур
// Возврат значений: Артикул, Номенклатура, Родитель, Цена, ИндКартинки, ЕдиницаИзмерения,НормаВремени
Функция ОтборНоменклатурПоУслугамСотрудника(
	ОтборДата = Неопределено,
	ОтборСтруктурнаяЕдиница = Неопределено,						 
	ОтборВидЦен = Неопределено,						 
	ОтборСотрудник = Истина,
	ОтборСегмент = Неопределено, 
	ОтборСегментУслугПоСогласованию = Неопределено,
	ОтборПоДоговоруПолиса = Неопределено,
	ПолисМедСтрахования = Неопределено) Экспорт
	
	ОтборДоговорПоПолисуМассив = Новый Массив;
	Если ОтборПоДоговоруПолиса = Неопределено ИЛИ ОтборПоДоговоруПолиса = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда
		ОтборДоговорПоПолисуМассив.Добавить("Отсутствует");		
	Иначе
		ОтборДоговорПоПолисуМассив.Добавить(ОтборПоДоговоруПолиса);	
	КонецЕсли;
	
	ПодсчетКоличестваОказанныхУслугПоПолису = Новый Массив;
	Если ПолисМедСтрахования = Неопределено ИЛИ ПолисМедСтрахования = Справочники.ПолисыМедицинскогоСтрахования.ПустаяСсылка() Тогда
		ПодсчетКоличестваОказанныхУслугПоПолису.Добавить("Отсутствует");		
	Иначе
		ПодсчетКоличестваОказанныхУслугПоПолису.Добавить(ПолисМедСтрахования);	
	КонецЕсли;
	
	
	// Запрос к справочнику номенклатур
	ВыборкаНоменклатур      = Новый Запрос;	
	ВыборкаНоменклатур.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураСегмента.Сегмент КАК Сегмент,
	|	НоменклатураСегмента.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТУслугиСегмента
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|ГДЕ
	|	&СегментЗаполнен
	|	И НоменклатураСегмента.Сегмент = &ОтборСегмент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапросЛечение.Номенклатура КАК ЛечениеНоменклатура,
	|	СУММА(ВложенныйЗапросЛечение.Количество) КАК ЛечениеКоличество
	|ПОМЕСТИТЬ ВТОказаноПоПолису
	|ИЗ
	|	Документ.Прием КАК Прием
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ПриемЛечение.Количество) КАК Количество,
	|			ПриемЛечение.Номенклатура КАК Номенклатура,
	|			ПриемЛечение.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.Прием.Лечение КАК ПриемЛечение
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПриемЛечение.Номенклатура,
	|			ПриемЛечение.Ссылка) КАК ВложенныйЗапросЛечение
	|		ПО Прием.Ссылка = ВложенныйЗапросЛечение.Ссылка
	|ГДЕ
	|	Прием.ПолисМедСтрахования В(&ПолисМедСтрахования)
	|	И НЕ ""Отсутствует"" В (&ПолисМедСтрахования)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапросЛечение.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураСегмента.Сегмент КАК Сегмент,
	|	НоменклатураСегмента.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТУслугиСегментаУслугПоСогласованию
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|ГДЕ
	|	&СегментУслугПоСогласованиюЗаполнен
	|	И НоменклатураСегмента.Сегмент = &ОтборСегментУслугПоСогласованию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоговорыКонтрагентовУслугиПоДоговору.Номенклатура КАК Номенклатура,
	|	ДоговорыКонтрагентовУслугиПоДоговору.Согласование КАК Согласование,
	|	ДоговорыКонтрагентовУслугиПоДоговору.Количество КАК Количество,
	|	ДоговорыКонтрагентовУслугиПоДоговору.КоличествоПриПревышении КАК КоличествоПриПревышении,
	|	ЕСТЬNULL(ДоговорыКонтрагентовОграничениеЗубов.КоличествоЗубов, 0) КАК КоличествоЗубов,
	|	ЕСТЬNULL(ДоговорыКонтрагентовОграничениеЗубов.КоличествоВПриеме, 0) КАК КоличествоВПриеме,
	|	ЕСТЬNULL(ДоговорыКонтрагентовОграничениеЗубов.НаименованиеОграничения, """") КАК НаименованиеОграничения
	|ПОМЕСТИТЬ ВТУслугиПоДоговору
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.УслугиПоДоговору КАК ДоговорыКонтрагентовУслугиПоДоговору
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ОграничениеЗубов КАК ДоговорыКонтрагентовОграничениеЗубов
	|		ПО ДоговорыКонтрагентовУслугиПоДоговору.Ссылка = ДоговорыКонтрагентовОграничениеЗубов.Ссылка
	|			И ДоговорыКонтрагентовУслугиПоДоговору.КлючСтроки = ДоговорыКонтрагентовОграничениеЗубов.КлючСтроки
	|ГДЕ
	|	ДоговорыКонтрагентовУслугиПоДоговору.Ссылка В(&СсылкаДоговорПоПолису)
	|	И НЕ ""Отсутствует"" В (&СсылкаДоговорПоПолису)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	УслугиСотрудника.Номенклатура КАК Номенклатура,
	|	УслугиСотрудника.Сотрудник КАК Сотрудник,
	|	УслугиСотрудника.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УслугиСотрудника.Номенклатура.Родитель КАК Родитель,
	|	УслугиСотрудника.Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
	|	УслугиСотрудника.Номенклатура.Наименование КАК Наименование,
	|	УслугиСотрудника.Номенклатура.Артикул КАК Артикул,
	|	УслугиСотрудника.Номенклатура.Бесплатно КАК Бесплатно,
	|	УслугиСотрудника.Номенклатура.НормаВремени КАК НормаВремени,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА НЕ УслугиСотрудника.Номенклатура.ЭтоГруппа
	|			ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИндКартинки,
	|	ВТУслугиПоДоговору.Согласование КАК ПолисСогласование,
	|	ВТУслугиПоДоговору.Количество КАК ПолисКоличество,
	|	ВТУслугиПоДоговору.КоличествоПриПревышении КАК ПолисКоличествоПриПревышении,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТУслугиПоДоговору.Количество, НЕОПРЕДЕЛЕНО) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПолисНеограничено,
	|	ВТУслугиПоДоговору.КоличествоЗубов КАК КоличествоЗубов,
	|	ВТУслугиПоДоговору.КоличествоВПриеме КАК КоличествоВПриеме,
	|	ВТУслугиПоДоговору.НаименованиеОграничения КАК НаименованиеОграничения,
	|	УслугиСотрудника.Номенклатура.СкидкиЗапрещены КАК СкидкиЗапрещены
	|ИЗ
	|	РегистрСведений.УслугиСотрудника КАК УслугиСотрудника
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&НаДату,
	|				ВидЦен = &ВидЦен
	|					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|					И Актуальность = ИСТИНА) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО УслугиСотрудника.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыНоменклатуры.СрезПоследних КАК СтатусыНоменклатурыСрезПоследних
	|		ПО УслугиСотрудника.Номенклатура = СтатусыНоменклатурыСрезПоследних.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОказаноПоПолису КАК ВТОказаноПоПолису
	|		ПО УслугиСотрудника.Номенклатура = ВТОказаноПоПолису.ЛечениеНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУслугиПоДоговору КАК ВТУслугиПоДоговору
	|		ПО УслугиСотрудника.Номенклатура = ВТУслугиПоДоговору.Номенклатура
	|ГДЕ
	|	УслугиСотрудника.Сотрудник = &Сотрудник
	|	И УслугиСотрудника.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И (СтатусыНоменклатурыСрезПоследних.ВПродаже ЕСТЬ NULL
	|			ИЛИ СтатусыНоменклатурыСрезПоследних.ВПродаже = ИСТИНА)
	|	И ВЫБОР
	|			КОГДА &СегментЗаполнен
	|				ТОГДА УслугиСотрудника.Номенклатура В
	|						(ВЫБРАТЬ
	|							ВТУслугиСегмента.Номенклатура
	|						ИЗ
	|							ВТУслугиСегмента)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &СегментУслугПоСогласованиюЗаполнен
	|				ТОГДА УслугиСотрудника.Номенклатура В
	|						(ВЫБРАТЬ
	|							ВТУслугиСегментаУслугПоСогласованию.Номенклатура
	|						ИЗ
	|							ВТУслугиСегментаУслугПоСогласованию)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И &УсловиеУслугиПоДоговору
	|	И НЕ УслугиСотрудника.Номенклатура.ПометкаУдаления";
	
	УсловиеУслугиПоДоговору = 
	"И УслугиСотрудника.Номенклатура В
	|			(ВЫБРАТЬ
	|				ВТУслугиПоДоговору.Номенклатура КАК Номенклатура
	|			ИЗ
	|				ВТУслугиПоДоговору КАК ВТУслугиПоДоговору)";
	ВыборкаНоменклатур.Текст = СтрЗаменить(ВыборкаНоменклатур.Текст, "И &УсловиеУслугиПоДоговору", ?(ЗначениеЗаполнено(ПолисМедСтрахования), УсловиеУслугиПоДоговору, ""));

	ВыборкаНоменклатур.УстановитьПараметр("СтруктурнаяЕдиница" , ?(ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница)   , ОтборСтруктурнаяЕдиница, Неопределено));
	ВыборкаНоменклатур.УстановитьПараметр("ВидЦен"             , ?(ЗначениеЗаполнено(ОтборВидЦен)               , ОтборВидЦен            , Неопределено));
	ВыборкаНоменклатур.УстановитьПараметр("НаДату"             , ?(ЗначениеЗаполнено(ОтборДата)                 , ОтборДата              , Неопределено));
	ВыборкаНоменклатур.УстановитьПараметр("Сотрудник"		   , ?(ЗначениеЗаполнено(ОтборСотрудник)            , ОтборСотрудник         , Неопределено));                           	
	ВыборкаНоменклатур.УстановитьПараметр("СегментЗаполнен"    , ЗначениеЗаполнено(ОтборСегмент));	
	ВыборкаНоменклатур.УстановитьПараметр("ОтборСегмент"	   , ОтборСегмент);    
	ВыборкаНоменклатур.УстановитьПараметр("СегментУслугПоСогласованиюЗаполнен", ЗначениеЗаполнено(ОтборСегментУслугПоСогласованию));	
	ВыборкаНоменклатур.УстановитьПараметр("ОтборСегментУслугПоСогласованию"   , ОтборСегментУслугПоСогласованию);
	ВыборкаНоменклатур.УстановитьПараметр("СсылкаДоговорПоПолису"				, ОтборДоговорПоПолисуМассив);
	ВыборкаНоменклатур.УстановитьПараметр("ПолисМедСтрахования"					, ПодсчетКоличестваОказанныхУслугПоПолису);
	
	Возврат ВыборкаНоменклатур.Выполнить().Выгрузить();	
	
КонецФункции

// Функция расширенного отбора номенклатур
// Возврат значений: Артикул, Номенклатура, Родитель, Цена, ИндКартинки, ЕдиницаИзмерения,НормаВремени
Функция ОтборНоменклатурЗубнаяФормула(ОтборДата = Неопределено,ОтборСтруктурнаяЕдиница = Неопределено,ОтборСостояние,ОтборВидЦен = Неопределено) Экспорт
	
	// Запрос к справочнику номенклатур
	ВыборкаНоменклатур       = Новый Запрос;
	ВыборкаНоменклатур.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписокНоменклатуры.Ссылка.Артикул КАК Артикул,
	|	СписокНоменклатуры.Ссылка КАК Номенклатура,
	|	СписокНоменклатуры.Ссылка.Родитель КАК Родитель,
	|	ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент, 1) КАК Цена,
	|	ВЫБОР
	|		КОГДА СписокНоменклатуры.Ссылка.ЭтоГруппа = ИСТИНА
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндКартинки,
	|	СписокНоменклатуры.Ссылка.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СписокНоменклатуры.Ссылка.НормаВремени КАК НормаВремени
	|ИЗ
	|	Справочник.Номенклатура.ОбластиЗубнойФормулы КАК СписокНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&НаДату,
	|				Актуальность = ИСТИНА
	|					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|					И ВидЦен = &ВидЦен
	|					И Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО СписокНоменклатуры.Ссылка = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|ГДЕ
	|	НЕ СписокНоменклатуры.Ссылка.ПометкаУдаления
	|	И СписокНоменклатуры.Ссылка.ЭтоГруппа = ЛОЖЬ
	|	И СписокНоменклатуры.СостояниеЗубнойФормулы = &ОтборСостояние
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокНоменклатуры.Ссылка,
	|	СписокНоменклатуры.Ссылка.Родитель,
	|	СписокНоменклатуры.Ссылка.ЕдиницаИзмерения,
	|	СписокНоменклатуры.Ссылка.НормаВремени,
	|	ВЫБОР
	|		КОГДА СписокНоменклатуры.Ссылка.ЭтоГруппа = ИСТИНА
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ,
	|	СписокНоменклатуры.Ссылка.Артикул,
	|	ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент, 1)
	|АВТОУПОРЯДОЧИВАНИЕ";
      
	ВыборкаНоменклатур.УстановитьПараметр("ОтборСостояние"                      , ОтборСостояние);
	ВыборкаНоменклатур.УстановитьПараметр("СтруктурнаяЕдиница"                  , ?(ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница)   , ОтборСтруктурнаяЕдиница, Неопределено));
	ВыборкаНоменклатур.УстановитьПараметр("ВидЦен"                              , ?(ЗначениеЗаполнено(ОтборВидЦен)               , ОтборВидЦен, Неопределено));
	ВыборкаНоменклатур.УстановитьПараметр("НаДату"                			    , ?(ЗначениеЗаполнено(ОтборДата)                 , ОтборДата, Неопределено));
	Возврат ВыборкаНоменклатур.Выполнить().Выгрузить();	
	
КонецФункции	

// Функция - Получить остаток сертификата
//
// Параметры:
//  Сертификат		 - 	 - 
//  СерийныйНомер	 - 	 - 
//  Дата			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьОстатокСертификата(Сертификат, СерийныйНомер, Знач Дата = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	ЗапросСертификат = Новый Запрос(
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	СертификатыОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.Сертификаты.Остатки(
	|			&ТекДата,
	|			 Сертификат = &Сертификат
	|				И СерийныйНомер = &СерийныйНомер) КАК СертификатыОстатки");
	
	ЗапросСертификат.УстановитьПараметр("Сертификат", Сертификат);
	ЗапросСертификат.УстановитьПараметр("СерийныйНомер", СерийныйНомер);
	ЗапросСертификат.УстановитьПараметр("ТекДата", КонецДня(Дата));
	
	РезультатОстаток = ЗапросСертификат.Выполнить().Выгрузить();
	Если РезультатОстаток.Количество() > 0 Тогда
		Возврат РезультатОстаток[0].СуммаОстаток;
	Иначе
		Возврат 0;
	КонецЕсли;	
	
КонецФункции

// Функция, возвращает цены номенклатуры.
//
Функция ПолучитьЦеныНомеклатуры(Номенклатура,
								СтруктурнаяЕдиница 	 	   = Неопределено,
								ВидЦен 				 	   = Неопределено,
								Знач ПериодНачало 	 	   = Неопределено,
								Знач ПериодОкончание 	   = Неопределено,
								РасширенноеЦенообразование = Истина) Экспорт
	
	СтруктурнаяЕдиница 		   = ?(СтруктурнаяЕдиница = Неопределено, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница, СтруктурнаяЕдиница);
	ИспользоватьОтборПоВремени = ?(РасширенноеЦенообразование, ПериодНачало <> Неопределено, Ложь);
	ДатаПериод 				   = ПериодНачало;
	ДобавитьДень			   = ИспользоватьОтборПоВремени И ЗначениеЗаполнено(ПериодОкончание) И День(ПериодНачало) <> День(ПериодОкончание);
	ПериодНачалоТолькоВремя    = Дата(1,1,1) + ?(ЗначениеЗаполнено(ПериодНачало), (ПериодНачало - НачалоДня(ПериодНачало)), 0);
	ПериодОкончаниеТолькоВремя = Дата(1,1,1) + ?(ЗначениеЗаполнено(ПериодОкончание), (ПериодОкончание - НачалоДня(ПериодОкончание)), 0) + ?(ДобавитьДень, 86400, 0);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.ВидЦен КАК ВидЦен,
	|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка,
	|	ЦеныНоменклатурыСрезПоследних.ДеньНедели КАК ДеньНедели,
	|	ЦеныНоменклатурыСрезПоследних.ВремяНачала КАК ВремяНачала,
	|	ЦеныНоменклатурыСрезПоследних.ВремяОкончания КАК ВремяОкончания,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.ВидЦен.Наименование КАК Наименование
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаПериод,
	|			Номенклатура = &Номенклатура
	|				И Актуальность
	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И &ВидЦен
	|				И &ИспользоватьОтборПоВремени) КАК ЦеныНоменклатурыСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование,
	|	Упаковка,
	|	ДеньНедели,
	|	ВремяНачала");
	
	Запрос.УстановитьПараметр("Номенклатура"	  		  , Номенклатура);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"		  , СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ВидЦен"			  		  , ВидЦен);
	Запрос.УстановитьПараметр("ДатаПериод"			  	  , ДатаПериод);
	Запрос.УстановитьПараметр("ИспользоватьОтборПоВремени", ИспользоватьОтборПоВремени);
	Запрос.УстановитьПараметр("ПериодНачалоТолькоВремя"	  , ПериодНачалоТолькоВремя);
	Запрос.УстановитьПараметр("ПериодОкончаниеТолькоВремя", ПериодОкончаниеТолькоВремя);

	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВидЦен", ?(ВидЦен = Неопределено, "Истина", "ВидЦен = &ВидЦен"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаПериод", ?(ДатаПериод = Неопределено, "", "&ДатаПериод"));
	
	Если ИспользоватьОтборПоВремени Тогда
		
		УсловиеОтбораПоВремени =
		"И ВЫБОР
		|	КОГДА Номенклатура.РасширенноеВременноеЦенообразование = ИСТИНА
		|		ТОГДА (ДеньНедели = ДЕНЬНЕДЕЛИ(&ДатаПериод)
		|				ИЛИ ДеньНедели = 0
		|				ИЛИ ДеньНедели = 8 И ДЕНЬНЕДЕЛИ(&ДатаПериод) Между 1 И 5
		|				ИЛИ ДеньНедели = 9 И ДЕНЬНЕДЕЛИ(&ДатаПериод) Между 6 И 7)
		|				И &УсловиеПериодОкончания
		|				И (ВремяОкончания > &ПериодНачалоТолькоВремя
		|					ИЛИ ВремяОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|	ИНАЧЕ ИСТИНА
		|КОНЕЦ";
		
		УсловиеПериодОкончания = ?(ЗначениеЗаполнено(ПериодОкончание), "И (ВремяНачала < &ПериодОкончаниеТолькоВремя ИЛИ ВремяНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))", "");
		УсловиеОтбораПоВремени = СтрЗаменить(УсловиеОтбораПоВремени, "И &УсловиеПериодОкончания", УсловиеПериодОкончания);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ИспользоватьОтборПоВремени", УсловиеОтбораПоВремени);
		
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ИспользоватьОтборПоВремени", "");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// При изменении основной цены продажи на форме элемента установим ее основной
//
Процедура УстановитьЦенуНоменклатуры(Номенклатура, ВидЦен, Упаковка, СтруктурнаяЕдиница, Цена, РасширенноеЦенообразование = Неопределено) Экспорт
	
	НоваяЦена                    = РегистрыСведений.ЦеныНоменклатуры.СоздатьМенеджерЗаписи();
	НоваяЦена.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
	НоваяЦена.Номенклатура       = Номенклатура;
	НоваяЦена.ВидЦен             = ВидЦен;
	НоваяЦена.Цена               = Цена;
	НоваяЦена.Упаковка           = Упаковка;
	НоваяЦена.Период             = ТекущаяДата();
	НоваяЦена.Автор              = ПараметрыСеанса.ТекущийПользователь;
	Если Не РасширенноеЦенообразование = Неопределено Тогда
		НоваяЦена.ДеньНедели 	 = РасширенноеЦенообразование.ДеньНедели;
		НоваяЦена.ВремяНачала 	 = РасширенноеЦенообразование.ВремяНачала;
		НоваяЦена.ВремяОкончания = РасширенноеЦенообразование.ВремяОкончания;
	КонецЕсли;
	НоваяЦена.Записать();
	
КонецПроцедуры // УстановитьИзменитьОсновнуюЦенуПродажи()

// Функция, возвращает неиспользуемые группы, которые не нужно отображать в динамических списках.
//
Функция ПолучитьНеиспользуемыеГруппы(
		СтруктурнаяЕдиница,
		Дата,
		МассивТипов,
		СегментСотрудника = Неопределено,
		Сотрудник = Неопределено,
		ДоговорПоПолису = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	СтатусыНоменклатурыСрезПоследних.ВПродаже КАК ВПродаже
	|ПОМЕСТИТЬ СтасусыНоменклатуры
	|ИЗ
	|	РегистрСведений.СтатусыНоменклатуры.СрезПоследних(&Дата, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК СтатусыНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентовУслугиПоДоговору.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТУслугиПоДоговору
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.УслугиПоДоговору КАК ДоговорыКонтрагентовУслугиПоДоговору
	|ГДЕ
	|	ДоговорыКонтрагентовУслугиПоДоговору.Ссылка = &СсылкаДоговорПоПолису
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(СписокНоменклатуры.Ссылка) КАК Номенклатура,
	|	СписокНоменклатуры.Родитель КАК Родитель
	|ИЗ
	|	Справочник.Номенклатура КАК СписокНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтасусыНоменклатуры КАК СтасусыНоменклатуры
	|		ПО СписокНоменклатуры.Ссылка = СтасусыНоменклатуры.Номенклатура
	|ГДЕ
	|	НЕ СписокНоменклатуры.ПометкаУдаления
	|	И НЕ СписокНоменклатуры.ЭтоГруппа
	|	И &УсловиеОтбораПоСегментам
	|	И &УсловиеМассивТипов
	|	И ЕСТЬNULL(СтасусыНоменклатуры.ВПродаже, ИСТИНА)
	|	И &УсловиеУслугиСотрудника
	|	И &УсловиеУслугиПоДоговору
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокНоменклатуры.Родитель");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"    , СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Дата"                  , Дата);
	Запрос.УстановитьПараметр("МассивТипов"			  , МассивТипов);
	Запрос.УстановитьПараметр("СегментСотрудника"	  , СегментСотрудника);
	Запрос.УстановитьПараметр("СсылкаДоговорПоПолису" , ДоговорПоПолису);
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда 
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	КонецЕсли;
	
	УсловиеМассивТипов 				  	  = ?(ЗначениеЗаполнено(МассивТипов), "И СписокНоменклатуры.ТипНоменклатуры В (&МассивТипов)", "");
	Запрос.Текст	   					  = СтрЗаменить(Запрос.Текст, "И &УсловиеМассивТипов", УсловиеМассивТипов);
			
	Если ЗначениеЗаполнено(СегментСотрудника) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СегментСотрудника.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ТаблицаНоменклатурПоСегментам
		|ИЗ
		|	РегистрСведений.НоменклатураСегмента КАК СегментСотрудника
		|ГДЕ
		|	СегментСотрудника.Сегмент = &СегментСотрудника
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|" + Запрос.Текст;
		
		УсловиеОтбораПоСегментам = 
		"И СписокНоменклатуры.Ссылка В
		|	(ВЫБРАТЬ
		|		ТаблицаНоменклатурПоСегментам.Номенклатура
		|	ИЗ
		|		ТаблицаНоменклатурПоСегментам)";
		
	Иначе
		УсловиеОтбораПоСегментам = "";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеОтбораПоСегментам", УсловиеОтбораПоСегментам);
	
	УсловиеУслугиСотрудника = ""; 
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		УсловиеУслугиСотрудника =  
		"И (СписокНоменклатуры.ТипНоменклатуры <> Значение(Перечисление.ТипыНоменклатуры.Услуга) Или СписокНоменклатуры.Ссылка В
		|(ВЫБРАТЬ
		|	УслугиСотрудника.Номенклатура
		|ИЗ
		|	РегистрСведений.УслугиСотрудника КАК УслугиСотрудника
		|ГДЕ
		|   УслугиСотрудника.Сотрудник = &Сотрудник
		|	И УслугиСотрудника.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И НЕ УслугиСотрудника.Номенклатура.ПометкаУдаления))";
	КонецЕсли;

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеУслугиСотрудника", УсловиеУслугиСотрудника);

	// БЛОК - Настройки подбора по полису		
	УсловиеУслугиПоДоговору = 
	"И ВЫБОР КОГДА СписокНоменклатуры.ТипНоменклатуры = Значение(Перечисление.ТипыНоменклатуры.Услуга) Тогда СписокНоменклатуры.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТУслугиПоДоговору.Номенклатура КАК Номенклатура
	|			ИЗ
	|				ВТУслугиПоДоговору КАК ВТУслугиПоДоговору)ИНАЧЕ ИСТИНА КОНЕЦ";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеУслугиПоДоговору", ?(ЗначениеЗаполнено(ДоговорПоПолису), УсловиеУслугиПоДоговору, ""));
	
	ТаблицаНоменклатуры = Запрос.Выполнить().Выгрузить();	
	
	ПодборНоменклатурИсточникГрупп_ = Новый ДеревоЗначений;
	ПодборНоменклатурИсточникГрупп_.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
	ЗапросГрупп = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ИСТИНА
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И Номенклатура.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Справочник.Номенклатура.Родитель
	|			ИЗ
	|				Справочник.Номенклатура)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ");
	
	ВыборкаГрупп = ЗапросГрупп.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ЗаполнитьИсточникГруппПодбора(ВыборкаГрупп, ПодборНоменклатурИсточникГрупп_.Строки);
	ПустаяГруппа = ПодборНоменклатурИсточникГрупп_.Строки.Добавить();
	
	ПодборНоменклатурИсточникЭлементов_ = Новый ТаблицаЗначений;
	ПодборНоменклатурИсточникЭлементов_.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ПодборНоменклатурИсточникЭлементов_.Колонки.Добавить("Родитель"    , Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
	Для Каждого СтрокаТЧ из ТаблицаНоменклатуры Цикл
		ЗаполнитьЗначенияСвойств(ПодборНоменклатурИсточникЭлементов_.Добавить(), СтрокаТЧ);
	КонецЦикла;
	
	ПодборНоменклатуры_ = Новый ДеревоЗначений;
	ПодборНоменклатуры_.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ПодборНоменклатуры_.Колонки.Добавить("Родитель"	   , Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ПодборНоменклатуры_.Колонки.Добавить("ЭтоГруппа"   , Новый ОписаниеТипов("Булево"));
	
	СписокНеиспользуемыхГрупп = Новый Массив;
	ЗаполнитьСписокПодбора(
		ПодборНоменклатурИсточникГрупп_.Строки,
		ПодборНоменклатурИсточникЭлементов_, 
		ПодборНоменклатуры_, 
		ПодборНоменклатуры_, 
		СписокНеиспользуемыхГрупп);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа
	|	И (НЕ Номенклатура.Ссылка В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Справочник.Номенклатура.Родитель
	|					ИЗ
	|						Справочник.Номенклатура)
	|			ИЛИ Номенклатура.ПометкаУдаления)");
	
	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТЧ Из Результат Цикл
		СписокНеиспользуемыхГрупп.Добавить(СтрокаТЧ.Ссылка);
	КонецЦикла;
	
	Возврат СписокНеиспользуемыхГрупп;
	
КонецФункции

// Процедура, рекурсивно заполняет дерева подбора номенклатур.
//
Процедура ЗаполнитьСписокПодбора(ИсточникГрупп, ИсточникНоменклатуры, ЭлементЗаполнения, ДеревоПодбора, СписокНеиспользуемыхГрупп)
	
	Для Каждого УровеньЗаполнения ИЗ ИсточникГрупп Цикл
		
		Если ЗначениеЗаполнено(УровеньЗаполнения.Номенклатура) Тогда
			НоваяСтрокаГруппы              = ЭлементЗаполнения.Строки.Добавить();
			НоваяСтрокаГруппы.Номенклатура = УровеньЗаполнения.Номенклатура;
			НоваяСтрокаГруппы.ЭтоГруппа    = Истина;
		Иначе
			НоваяСтрокаГруппы = ДеревоПодбора;
		КонецЕсли;
		
		ЗаполнитьСписокПодбора(УровеньЗаполнения.Строки, ИсточникНоменклатуры, НоваяСтрокаГруппы, ДеревоПодбора, СписокНеиспользуемыхГрупп);
		НоменклатураПоРодителю = ИсточникНоменклатуры.НайтиСтроки(Новый Структура("Родитель", УровеньЗаполнения.Номенклатура));
		
		// Заполняем номенклатуры
		Для Каждого СтрокаН ИЗ НоменклатураПоРодителю Цикл
			НоваяСтрока = НоваяСтрокаГруппы.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаН);
		КонецЦикла;
		
		// Удаляем узел группы если он не содержит элементы
		Если НоваяСтрокаГруппы.Строки.Количество() = 0 И Не ТипЗнч(НоваяСтрокаГруппы) = Тип("ДеревоЗначений") Тогда
			СписокНеиспользуемыхГрупп.Добавить(НоваяСтрокаГруппы.Номенклатура);
			ЭлементЗаполнения.Строки.Удалить(НоваяСтрокаГруппы);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура, рекурсивно заполняет источник групп.
//
Процедура ЗаполнитьИсточникГруппПодбора(ВыборкаГрупп, УровеньЗаполнения)
	
	Для Каждого УровеньОбхода Из ВыборкаГрупп.Строки Цикл
		НоваяСтрока = УровеньЗаполнения.Добавить();
		ЗаполнитьИсточникГруппПодбора(УровеньОбхода, НоваяСтрока.Строки);
		НоваяСтрока.Номенклатура = УровеньОбхода.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

// Функция, возвращает номенклатуру по группе, сотруднику и стр. ед.
//
Функция ПолучитьНоменклатуруПоГруппе(Папка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникНоменклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК СправочникНоменклатура
		|ГДЕ
		|	НЕ СправочникНоменклатура.ПометкаУдаления
		|	И СправочникНоменклатура.ЭтоУслуга
		|	И НЕ СправочникНоменклатура.ЭтоГруппа
		|	И СправочникНоменклатура.Ссылка В ИЕРАРХИИ (&Папка)";
	
	Запрос.УстановитьПараметр("Папка", Папка);
		
	Возврат Запрос.Выполнить().Выгрузить();
		
	
КонецФункции

#Область ЗагрузкаДанныхИзВнешнегоИсточника

// Процедура При опрелелении значения по умолчанию.
//
Процедура ПриОпределенииЗначенияПоУмолчанию(СправочникСсылка, ИмяРеквизита, ВходящиеДанные, СтрокаСопоставлена, ОбновлятьДанные, ЗначениеПоУмолчанию)
	
	Если СтрокаСопоставлена 
		И НЕ ЗначениеЗаполнено(ВходящиеДанные) Тогда
		
		ЗначениеПоУмолчанию = СправочникСсылка[ИмяРеквизита];
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура При опрелелении образцов загрузки данных.
//
Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
	
КонецПроцедуры

// Процедура Поля загрузки данных из внешнего источника.
//
Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт
	
	//
	// Для группы полей действует правило: хотя бы одно поле в группе должно быть выбрано в колонках
	//
	
	ОписаниеТиповСтрока10 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(10));
	ОписаниеТиповСтрока11 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(11));
	ОписаниеТиповСтрока19 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(19));
	ОписаниеТиповСтрока25 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25));
	ОписаниеТиповСтрока50 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100));
	ОписаниеТиповСтрока150 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
	ОписаниеТиповСтрока200 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(200));
	ОписаниеТиповСтрока1000 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000));
	ОписаниеТиповСтрока0000 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(0));
	ОписаниеТиповЧисло10_0 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло10_3 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(10, 3, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло15_2 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповДата = Новый ОписаниеТипов("Дата", , , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Родитель", "Группа", ОписаниеТиповСтрока150, ОписаниеТиповКолонка, , , , );
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Код", "Код", ОписаниеТиповСтрока11, ОписаниеТиповКолонка, "Номенклатура", 1, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Штрихкод", "Штрихкод", ОписаниеТиповСтрока200, ОписаниеТиповКолонка, "Номенклатура", 2, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "КодСинхронизации", "Код синхронизации", ОписаниеТиповСтрока100, ОписаниеТиповСтрока100, "Номенклатура", 2, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Артикул", "Артикул", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 3, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименование","Номенклатура (наименование)", ОписаниеТиповСтрока150, ОписаниеТиповКолонка, "Номенклатура", 4, Истина, Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименованиеПолное","Номенклатура (полное наименование)", ОписаниеТиповСтрока1000, ОписаниеТиповКолонка, "Номенклатура", 5, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "КодНоменклатурыМедицинскиУслуг", "Код услуги", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 6,,Истина);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНоменклатуры");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ТипНоменклатуры", "Тип номенклатуры", ОписаниеТиповСтрока11, ОписаниеТиповКолонка);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ЕдиницаИзмерения", "Ед. изм.", ОписаниеТиповСтрока25, ОписаниеТиповКолонка);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Цена", "Цена", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СтавкаНДС", "Ставка НДС", ОписаниеТиповСтрока11, ОписаниеТиповКолонка);
	
	// ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ЦеновыеГруппы");
	// ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ЦеноваяГруппа", "Ценовая группа (наименование)", ОписаниеТиповСтрока50, ОписаниеТиповКолонка);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Комментарий", "Комментарий", ОписаниеТиповСтрока0000, ОписаниеТиповСтрока0000);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НормаВремени", "Норма времени", ОписаниеТиповСтрока25, ОписаниеТиповЧисло10_3);
	
	// ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.СтраныМира");
	// ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СтранаПроисхождения", "Страна происхождения (код или наименование)", ОписаниеТиповСтрока25, ОписаниеТиповКолонка);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.УпаковкиНоменклатуры");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "УпаковкаПоУмолчанию", "Упаковка", ОписаниеТиповСтрока25, ОписаниеТиповКолонка);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Коэффициент", "Коэффициент упаковки", ОписаниеТиповСтрока10, ОписаниеТиповЧисло10_3);

	// ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ПартииНоменклатуры");
	// ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Характеристика", "Характеристика, серия", ОписаниеТиповСтрока25, ОписаниеТиповКолонка);
	

КонецПроцедуры

// Процедура Сопоставить загружаемые данные из внешнего источника.
//
Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ПараметрыСопоставления, АдресРезультата) Экспорт
	
	ТаблицаСопоставленияДанных	= ПараметрыСопоставления.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
	НастройкиЗагрузкиДанных		= ПараметрыСопоставления.НастройкиЗагрузкиДанных;
	ОбновлятьДанные				= НастройкиЗагрузкиДанных.ОбновлятьСуществующие;
	ФиксированныйШаблон			= НастройкиЗагрузкиДанных.ФиксированныйШаблон;
	ПоискПоПолю                 = НастройкиЗагрузкиДанных.ПоискПоПолю;
	
	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		// Номенклатура по ШтрихКоду, Артикулу, Наименованию, НаименованиеПолное, Код, КодУслугиМЗ
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНоменклатуру(СтрокаТаблицыФормы.Номенклатура, 
			СтрокаТаблицыФормы.Штрихкод, 
			СтрокаТаблицыФормы.Артикул, 
			СтрокаТаблицыФормы.НоменклатураНаименование, 
			СтрокаТаблицыФормы.НоменклатураНаименованиеПолное, 
			СтрокаТаблицыФормы.Код,
			СтрокаТаблицыФормы.КодСинхронизации,
			СтрокаТаблицыФормы.КодНоменклатурыМедицинскиУслуг,
			ПоискПоПолю);

		ЭтаСтрокаСопоставлена = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура);
		
		// Родитель по наименованию
		ЗначениеПоУмолчанию = Справочники.Номенклатура.ПустаяСсылка();
		ПриОпределенииЗначенияПоУмолчанию(СтрокаТаблицыФормы.Номенклатура, "Родитель", СтрокаТаблицыФормы.Родитель_ВходящиеДанные, ЭтаСтрокаСопоставлена, ОбновлятьДанные, ЗначениеПоУмолчанию);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьРодителя("Номенклатура", СтрокаТаблицыФормы.Родитель, СтрокаТаблицыФормы.Родитель_ВходящиеДанные, ЗначениеПоУмолчанию);
					
		// Тип номенклатуры (реквизиты, закрытые для редактирования не правим)
		Если ЭтаСтрокаСопоставлена Тогда
			ЗначениеПоУмолчанию = СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры;
		Иначе
			ЗначениеПоУмолчанию = ?(ЗначениеЗаполнено(СтрокаТаблицыФормы.Родитель), СтрокаТаблицыФормы.Родитель.ТипНоменклатуры, Перечисления.ТипыНоменклатуры.Услуга);
		КонецЕсли;
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьТипНоменклатуры(СтрокаТаблицыФормы.ТипНоменклатуры, СтрокаТаблицыФормы.ТипНоменклатуры_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// ЕдиницыИзмерения по Наименованию 
		ЗначениеПоУмолчанию = Справочники.КлассификаторЕдиницИзмерения.шт;
		ПриОпределенииЗначенияПоУмолчанию(СтрокаТаблицыФормы.Номенклатура, "ЕдиницаИзмерения", СтрокаТаблицыФормы.ЕдиницаИзмерения_ВходящиеДанные, ЭтаСтрокаСопоставлена, ОбновлятьДанные, ЗначениеПоУмолчанию);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьЕдиницыИзмерения(СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.ЕдиницаИзмерения, СтрокаТаблицыФормы.ЕдиницаИзмерения_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// СтавкаНДС по наименованию
		ЗначениеПоУмолчанию = ?(СтрокаТаблицыФормы.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат"),
		Перечисления.СтавкиНДС.БезНДС, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.Организация.СтавкаНДС);
		
		Если Не ЭтаСтрокаСопоставлена Или СтрокаТаблицыФормы.СтавкаНДС_ВходящиеДанные <> "" Тогда
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСтавкуНДС(СтрокаТаблицыФормы.СтавкаНДС, СтрокаТаблицыФормы.СтавкаНДС_ВходящиеДанные, ЗначениеПоУмолчанию);
		КонецЕсли;
		
		//// ЦеноваяГруппа по наименованию
		// ЗначениеПоУмолчанию = Справочники.ЦеновыеГруппы.ПустаяСсылка();
		// ПриОпределенииЗначенияПоУмолчанию(СтрокаТаблицыФормы.Номенклатура, "ЦеноваяГруппа", СтрокаТаблицыФормы.ЦеноваяГруппа_ВходящиеДанные, ЭтаСтрокаСопоставлена, ОбновлятьДанные, ЗначениеПоУмолчанию);
		// ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьЦеновуюГруппу(СтрокаТаблицыФормы.ЦеноваяГруппа, СтрокаТаблицыФормы.ЦеноваяГруппа_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// Комментарий как строка
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.Комментарий, СтрокаТаблицыФормы.Комментарий_ВходящиеДанные);
		
		// НормаВремени
		ЗначениеПоУмолчанию = 0;
		ПриОпределенииЗначенияПоУмолчанию(СтрокаТаблицыФормы.Номенклатура, "НормаВремени", СтрокаТаблицыФормы.НормаВремени_ВходящиеДанные, ЭтаСтрокаСопоставлена, ОбновлятьДанные, ЗначениеПоУмолчанию);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.НормаВремени, СтрокаТаблицыФормы.НормаВремени_ВходящиеДанные, ЗначениеПоУмолчанию);
				
		//// СтранаПроисхождения по коду
		// ЗначениеПоУмолчанию = Справочники.СтраныМира.ПустаяСсылка();
		// ПриОпределенииЗначенияПоУмолчанию(СтрокаТаблицыФормы.Номенклатура, "СтранаПроисхождения", СтрокаТаблицыФормы.СтранаПроисхождения_ВходящиеДанные, ЭтаСтрокаСопоставлена, ОбновлятьДанные, ЗначениеПоУмолчанию);
		// ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСтрануПроисхождения(СтрокаТаблицыФормы.СтранаПроисхождения, СтрокаТаблицыФормы.СтранаПроисхождения_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// Цена
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Цена, СтрокаТаблицыФормы.Цена_ВходящиеДанные);
		
		// УпаковкиНоменклатуры
		ЗначениеПоУмолчанию = Справочники.УпаковкиНоменклатуры.ПустаяСсылка();
		// ПриОпределенииЗначенияПоУмолчанию(СтрокаТаблицыФормы.Упаковка, "Упаковка", СтрокаТаблицыФормы.Упаковка_ВходящиеДанные, ЭтаСтрокаСопоставлена, ОбновлятьДанные, ЗначениеПоУмолчанию);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьУпаковку(СтрокаТаблицыФормы.УпаковкаПоУмолчанию, СтрокаТаблицыФормы.УпаковкаПоУмолчанию_ВходящиеДанные, СтрокаТаблицыФормы.Номенклатура, ЗначениеПоУмолчанию);
		
		// Коэффициент
		ЗначениеПоУмолчанию = 1;
		// ПриОпределенииЗначенияПоУмолчанию(СтрокаТаблицыФормы.Коэффициент, "Коэффициент", СтрокаТаблицыФормы.Коэффициент_ВходящиеДанные, ЭтаСтрокаСопоставлена, ОбновлятьДанные, ЗначениеПоУмолчанию);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Коэффициент, СтрокаТаблицыФормы.Коэффициент_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		//// Характеристика
		// ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьХарактеристику(СтрокаТаблицыФормы.Характеристика, СтрокаТаблицыФормы.Номенклатура,,СтрокаТаблицыФормы.Характеристика_ВходящиеДанные); 
		
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы);
		
		ЗагрузкаДанныхИзВнешнегоИсточника.ПрогрессСопоставленияДанных(ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицыФормы), РазмерТаблицыДанных);
		
	КонецЦикла;   
	
	Если НастройкиЗагрузкиДанных.ПоискПоПолю = 0 Тогда // Сопоставляли по наименованию
		ТаблицаСопоставленияДанных.Сортировать("НоменклатураНаименование"); 
	ИначеЕсли НастройкиЗагрузкиДанных.ПоискПоПолю = 1 Тогда  // Сопостовляли по артикулу
		 ТаблицаСопоставленияДанных.Сортировать("Артикул");
	ИначеЕсли НастройкиЗагрузкиДанных.ПоискПоПолю = 2 Тогда
		ТаблицаСопоставленияДанных.Сортировать("КодСинхронизации"); // Сопоставляли по кодусинхронизации
	ИначеЕсли НастройкиЗагрузкиДанных.ПоискПоПолю = 3 Тогда                                             
		ТаблицаСопоставленияДанных.Сортировать("КодНоменклатурыМедицинскиУслуг"); // Сопоставляли по кодууслуги		
	КонецЕсли;	
	
	ПоместитьВоВременноеХранилище(ТаблицаСопоставленияДанных, АдресРезультата);
	
КонецПроцедуры

// Процедура проверить корректность данных в свтроке таблицы.
//
Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	СтрокаТаблицыФормы._СтрокаСопоставлена = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура);
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	
	СтрокаТаблицыФормы[ИмяСлужебногоПоля] = СтрокаТаблицыФормы._СтрокаСопоставлена
											ИЛИ (НЕ СтрокаТаблицыФормы._СтрокаСопоставлена И НЕ ПустаяСтрока(СтрокаТаблицыФормы.НоменклатураНаименование));
	
КонецПроцедуры

// Процедура Обработать подготовленные данные.
//
Процедура ОбработатьПодготовленныеДанные(СтруктураДанных, ФоновоеЗаданиеАдресХранилища = "") Экспорт
	
	НастройкиОбновленияСвойств		= СтруктураДанных.НастройкиЗагрузкиДанных.НастройкиОбновленияСвойств;
	ОбновлятьСуществующие			= СтруктураДанных.НастройкиЗагрузкиДанных.ОбновлятьСуществующие;
	СоздаватьЕслиНеСопоставлено		= СтруктураДанных.НастройкиЗагрузкиДанных.СоздаватьЕслиНеСопоставлено; 
	ПоискПоПолю 				    = СтруктураДанных.НастройкиЗагрузкиДанных.ПоискПоПолю;
	ФиксированныйШаблон				= СтруктураДанных.НастройкиЗагрузкиДанных.ФиксированныйШаблон; 	
	ТаблицаСопоставленияДанных		= СтруктураДанных.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных				= ТаблицаСопоставленияДанных.Количество();
	КоличествоЗаписейТранзакции		= 0;
	ТранзакцияОткрыта				= Ложь;	
	
	ВидЦен 			   = СтруктураДанных.НастройкиЗагрузкиДанных.ВидЦен;
	СкладОстатков 	   = СтруктураДанных.НастройкиЗагрузкиДанных.СкладОстатков;
	СтруктурнаяЕдиница = СтруктураДанных.НастройкиЗагрузкиДанных.СтруктурнаяЕдиница;
		
	Попытка
		
		Для Каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			Если НЕ ТранзакцияОткрыта 
				И КоличествоЗаписейТранзакции = 0 Тогда
				
				НачатьТранзакцию();
				ТранзакцияОткрыта = Истина;
				
			КонецЕсли;
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			
			СогласованноеСостояниеСтроки = (СтрокаТаблицы._СтрокаСопоставлена И ОбновлятьСуществующие) 
				ИЛИ (НЕ СтрокаТаблицы._СтрокаСопоставлена И СоздаватьЕслиНеСопоставлено)
				ИЛИ ФиксированныйШаблон;
				
			Если ЗагрузкаВПриложениеВозможна И СогласованноеСостояниеСтроки Тогда
				
				КоличествоЗаписейТранзакции = КоличествоЗаписейТранзакции + 1;
				
				Если СтрокаТаблицы._СтрокаСопоставлена Тогда
					
					ЭлементСправочника = СтрокаТаблицы.Номенклатура.ПолучитьОбъект();
					Если СтрНайти(НастройкиОбновленияСвойств.ИменаПолейОбновляемые,"СтавкаНДС") Тогда
						НастройкиОбновленияСвойств.ИменаПолейОбновляемые = СтрЗаменить(НастройкиОбновленияСвойств.ИменаПолейОбновляемые, "СтавкаНДС,","");
						НастройкиОбновленияСвойств.ИменаПолейОбновляемые = СтрЗаменить(НастройкиОбновленияСвойств.ИменаПолейОбновляемые, ",СтавкаНДС","");
						НастройкиОбновленияСвойств.ИменаПолейОбновляемые = СтрЗаменить(НастройкиОбновленияСвойств.ИменаПолейОбновляемые, "СтавкаНДС","");
					КонецЕсли;
					
					Если СтрНайти(НастройкиОбновленияСвойств.ИменаПолейНеподлежащихОбновлению,"СтавкаНДС") Тогда
						НастройкиОбновленияСвойств.ИменаПолейНеподлежащихОбновлению = СтрЗаменить(НастройкиОбновленияСвойств.ИменаПолейНеподлежащихОбновлению, "СтавкаНДС,","");
						НастройкиОбновленияСвойств.ИменаПолейНеподлежащихОбновлению = СтрЗаменить(НастройкиОбновленияСвойств.ИменаПолейНеподлежащихОбновлению, ",СтавкаНДС","");
						НастройкиОбновленияСвойств.ИменаПолейНеподлежащихОбновлению = СтрЗаменить(НастройкиОбновленияСвойств.ИменаПолейНеподлежащихОбновлению, "СтавкаНДС","");
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(ЭлементСправочника, СтрокаТаблицы, НастройкиОбновленияСвойств.ИменаПолейОбновляемые, НастройкиОбновленияСвойств.ИменаПолейНеподлежащихОбновлению);
					
				Иначе
					
					НоменклатураВЭтойТранзакции = Неопределено;
					// Номенклатура по ШтрихКоду, Артикулу, Наименованию, НаименованиеПолное, Код, КодСинхронизации
					ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНоменклатуру(НоменклатураВЭтойТранзакции, 
					СтрокаТаблицы.Штрихкод, 
					СтрокаТаблицы.Артикул, 
					СтрокаТаблицы.НоменклатураНаименование, 
					СтрокаТаблицы.НоменклатураНаименованиеПолное, 
					СтрокаТаблицы.Код,
					СтрокаТаблицы.КодСинхронизации,
					СтрокаТаблицы.КодНоменклатурыМедицинскиУслуг,
					ПоискПоПолю);
					
					Если ЗначениеЗаполнено(НоменклатураВЭтойТранзакции) Тогда
						ЭлементСправочника = НоменклатураВЭтойТранзакции.ПолучитьОбъект();
					Иначе
						
						ЭлементСправочника = Справочники.Номенклатура.СоздатьЭлемент();	
						
						ЗаполнитьЗначенияСвойств(ЭлементСправочника, СтрокаТаблицы, , ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СтандартныеИменаПолейНеподлежащихОбновлению(СтруктураДанных.НастройкиЗагрузкиДанных));
						ЭлементСправочника.Записать();					
						
					КонецЕсли;
					
				КонецЕсли;
				
				ЭлементСправочника.Наименование       = СтрокаТаблицы.НоменклатураНаименование;
				ЭлементСправочника.НаименованиеПолное = ?(ПустаяСтрока(СтрокаТаблицы.НоменклатураНаименованиеПолное), СтрокаТаблицы.НоменклатураНаименование, СтрокаТаблицы.НоменклатураНаименованиеПолное);
				ЭлементСправочника.ЭтоУслуга          = ?(ЭлементСправочника.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга, Истина, Ложь);
				ЭлементСправочника.Родитель           = СтрокаТаблицы.Родитель;
				
				Если НЕ ПустаяСтрока(СтрокаТаблицы.КодНоменклатурыМедицинскиУслуг) Тогда
					 ЭлементСправочника.НоменклатураМедицинскихУслуг = Справочники.КлассификаторНоменклатурыМедицинскихУслуг.НайтиПоКоду(СтрокаТаблицы.КодНоменклатурыМедицинскиУслуг);
				КонецЕсли;	 
				
				Если НЕ ЗначениеЗаполнено(ЭлементСправочника.Родитель)
					И ЗначениеЗаполнено(СтрокаТаблицы.Родитель_ВходящиеДанные) Тогда  
					
					// Разбить строку на подстроки
					Группа = Неопределено;
					
					МассивСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(СтрокаТаблицы.Родитель_ВходящиеДанные, "|");
					РодительВерхнегоУровня = Неопределено;
					Для Каждого РодительНаименование Из МассивСлов Цикл
						
						Если ЗначениеЗаполнено(РодительНаименование) Тогда
							
							Группа = НайтиСоздатьГруппу(РодительНаименование, РодительВерхнегоУровня, ЭлементСправочника.ТипНоменклатуры);
							РодительВерхнегоУровня = Группа;
							
						КонецЕсли;
						
					КонецЦикла;
					
					ЭлементСправочника.Родитель = Группа;
					
				КонецЕсли;


				Если Не ЗначениеЗаполнено(СтрокаТаблицы.УпаковкаПоУмолчанию)
					И ЗначениеЗаполнено(СтрокаТаблицы.УпаковкаПоУмолчанию_ВходящиеДанные) Тогда
										
					// Создать упаковку
					НоваяУпаковка = Справочники.УпаковкиНоменклатуры.СоздатьЭлемент();
					НоваяУпаковка.Владелец     = ЭлементСправочника.Ссылка;//?(ЭлементСправочника.Ссылка.Пустая(), ЭлементСправочникаНоваяСсылка, ЭлементСправочника.Ссылка);
					НоваяУпаковка.Наименование = СтрокаТаблицы.УпаковкаПоУмолчанию_ВходящиеДанные;
					НоваяУпаковка.Коэффициент  = СтрокаТаблицы.Коэффициент;
					НоваяУпаковка.Записать();
					
					ЭлементСправочника.УпаковкаПоУмолчанию = НоваяУпаковка.Ссылка;

				КонецЕсли;
								
				// Если Не ЗначениеЗаполнено(СтрокаТаблицы.Характеристика)
				//	И ЗначениеЗаполнено(СтрокаТаблицы.Характеристика_ВходящиеДанные) Тогда
				//	
				//	НовыйЭлементСправочникаСсылка = ЭлементСправочника.Ссылка;//?(ЭлементСправочника.Ссылка.Пустая(), ЭлементСправочникаНоваяСсылка, ЭлементСправочника.Ссылка);
				//	ЭлементСправочника.ИспользоватьПартии = Истина;
				//	
				//	НоваяХарактеристика = Справочники.ПартииНоменклатуры.Выбрать(, НовыйЭлементСправочникаСсылка, Новый Структура("Наименование", СтрокаТаблицы.Характеристика_ВходящиеДанные));
				//	Если Не НоваяХарактеристика.Следующий() Тогда
				//		НоваяХарактеристика = Справочники.ПартииНоменклатуры.СоздатьЭлемент();
				//		НоваяХарактеристика.Владелец = НовыйЭлементСправочникаСсылка;
				//		НоваяХарактеристика.Наименование = СтрокаТаблицы.Характеристика_ВходящиеДанные;
				//		НоваяХарактеристика.Записать();
				//	КонецЕсли;
				//	
				// КонецЕсли;
		
				ЭлементСправочника.Записать();
								
				Если НЕ ПустаяСтрока(СтрокаТаблицы.ШтрихКод) Тогда
					
					ШК = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
					ШК.Период   = ТекущаяДата();
					ШК.Штрихкод = СокрЛП(СтрокаТаблицы.ШтрихКод);
					ШК.Объект   = ЭлементСправочника.Ссылка;
										
					ШК.Записать(Истина);
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаТаблицы.Цена) Тогда
					
					УстановитьЦенуНоменклатуры(ЭлементСправочника.Ссылка, ВидЦен, ЭлементСправочника.УпаковкаПоУмолчанию, СтруктурнаяЕдиница, СтрокаТаблицы.Цена); 
					
				КонецЕсли;
					
			КонецЕсли;
			
			ИндексТекущейстроки	= ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицы);
			ТекстПрогресса		= СтрШаблон(НСтр("ru ='Обработано %1 из %2 строк...'"), ИндексТекущейстроки, РазмерТаблицыДанных);
			
			#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
				ДлительныеОперации.СообщитьПрогресс(Цел(ИндексТекущейстроки * 100 / РазмерТаблицыДанных), ТекстПрогресса);
			#КонецЕсли
			
			Если ТранзакцияОткрыта
				И КоличествоЗаписейТранзакции > ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.МаксимумЗаписейВОднойТранзакции() Тогда
				
				ЗафиксироватьТранзакцию();
				ТранзакцияОткрыта = Ложь;
				КоличествоЗаписейТранзакции = 0;
				
			КонецЕсли;
			
		КонецЦикла;
			
		Если ТранзакцияОткрыта 
			И КоличествоЗаписейТранзакции > 0 Тогда
			
			ЗафиксироватьТранзакцию();
			ТранзакцияОткрыта = Ложь;
			
		КонецЕсли;
		
	Исключение
		
		ЗаписьЖурналаРегистрации(Нстр("ru='Загрузка данных'", "ru"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Номенклатура, , ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры

// Функция, находит или если не найдена группа, то создает ее.
//
// Параметры:
//  РодительНаименование	 - Строка 				- Наименование группы которую ищем. 
//  РодительВерхнегоУровня	 - СправочникСсылка 	- Ссылка на справочник родителя группы которую ищем.
//  ТипНоменклатуры			 - ПеречислениеСсылка 	- Перечисление типов номенклатуры. 
// 
// Возвращаемое значение:
//  Родитель - Ссылка на группу номенклатуры.
//
Функция НайтиСоздатьГруппу(РодительНаименование, РодительВерхнегоУровня = Неопределено, ТипНоменклатуры = Неопределено)
	
	Родитель = Справочники.Номенклатура.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ИСТИНА
	|	И Номенклатура.Наименование = &Наименование
	|	И ВЫБОР
	|			КОГДА &РодительВерхнегоУровня <> НЕОПРЕДЕЛЕНО
	|				ТОГДА Номенклатура.Родитель = &РодительВерхнегоУровня
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ТипНоменклатуры <> НЕОПРЕДЕЛЕНО
	|				ТОГДА Номенклатура.ТипНоменклатуры = &ТипНоменклатуры
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Наименование"          , РодительНаименование);
	Запрос.УстановитьПараметр("РодительВерхнегоУровня", РодительВерхнегоУровня);
	Запрос.УстановитьПараметр("ТипНоменклатуры"       , ТипНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Родитель = Выборка.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Родитель) Тогда
		
		// Создать родителя
		РодительОбъект                 = Справочники.Номенклатура.СоздатьГруппу();
		РодительОбъект.Наименование    = РодительНаименование;
		РодительОбъект.ТипНоменклатуры = ТипНоменклатуры;
		Если ЗначениеЗаполнено(РодительВерхнегоУровня) Тогда 
			РодительОбъект.Родитель = РодительВерхнегоУровня;
		КонецЕсли;
		
		РодительОбъект.Записать();
		Родитель = РодительОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат Родитель;
	
КонецФункции

#КонецОбласти

// Функция, определяет, доступна ли номенклатура для онлайн записи.
// 
Функция НоменклатураДоступнаДляОнлайнЗаписи(ПодборСтруктурныеЕдиницы) Экспорт
	
	Для Каждого СтрокаДерева Из ПодборСтруктурныеЕдиницы.ПолучитьЭлементы() Цикл
		Если СтрокаДерева.Выгружать <> 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#Область ОбработчикиНастроекОнлайнЗаписиИПродажи

// Функция Получить таблицу номенклатур онлайн-записи.
//
Функция ПолучитьТаблицуНоменклатурОнлайнЗаписи(Объект, ДеревоНоменклатур)
	
	ЗапросУслуг = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыОбъектов.Объект КАК Услуга,
	|	ВЫБОР
	|		КОГДА РеквизитыОбъектов.Объект.ГруппаОнлайнЗаписи.Ссылка ЕСТЬ NULL
	|				ИЛИ РеквизитыОбъектов.Объект.ГруппаОнлайнЗаписи.ПометкаУдаления
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РеквизитыОбъектов.Объект.ГруппаОнлайнЗаписи.Ссылка
	|	КОНЕЦ КАК Родитель,
	|	РеквизитыОбъектов.Объект.ИндексСортировки КАК ИндексСортировки,
	|	2 КАК ИндексКартинки,
	|	ИСТИНА КАК ОтображатьКнопкиПеремещения
	|ИЗ
	|	РегистрСведений.РеквизитыОбъектов КАК РеквизитыОбъектов
	|ГДЕ
	|	РеквизитыОбъектов.Объект ССЫЛКА Справочник.Номенклатура
	|	И НЕ РеквизитыОбъектов.Объект.ПометкаУдаления
	|	И НЕ РеквизитыОбъектов.Объект.ЭтоГруппа
	|	И РеквизитыОбъектов.Объект.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И РеквизитыОбъектов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И РеквизитыОбъектов.Значение = ИСТИНА
	|	И РеквизитыОбъектов.Реквизит = ""ОнлайнЗапись""
	|	И &УсловиеНормаВремени
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА РеквизитыОбъектов.Объект.ИндексСортировки = 0
	|			ТОГДА 999999
	|		ИНАЧЕ РеквизитыОбъектов.Объект.ИндексСортировки
	|	КОНЕЦ,
	|	РеквизитыОбъектов.Объект.Наименование");
	
	ЗапросУслуг.УстановитьПараметр("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	УсловиеНормаВремени = ?(Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга, "И РеквизитыОбъектов.Объект.НормаВремени <> 0", "");
	ЗапросУслуг.Текст	= СтрЗаменить(ЗапросУслуг.Текст, "И &УсловиеНормаВремени", УсловиеНормаВремени);
	
	Возврат ЗапросУслуг.Выполнить().Выгрузить();
	
КонецФункции

// Функция Получить таблицу номенклатур онлайн-продажи.
//
Функция ПолучитьТаблицуНоменклатурОнлайнПродажи(Объект, ДеревоНоменклатур)
	
	ЗапросУслуг = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыОбъектов.Объект КАК Услуга,
	|	ВЫБОР
	|		КОГДА РеквизитыОбъектов.Объект.ГруппаОнлайнПродажи.Ссылка ЕСТЬ NULL
	|				ИЛИ РеквизитыОбъектов.Объект.ГруппаОнлайнПродажи.ПометкаУдаления
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РеквизитыОбъектов.Объект.ГруппаОнлайнПродажи.Ссылка
	|	КОНЕЦ КАК Родитель,
	|	РеквизитыОбъектов.Объект.ИндексСортировки КАК ИндексСортировки,
	|	2 КАК ИндексКартинки,
	|	ИСТИНА КАК ОтображатьКнопкиПеремещения
	|ИЗ
	|	РегистрСведений.РеквизитыОбъектов КАК РеквизитыОбъектов
	|ГДЕ
	|	РеквизитыОбъектов.Объект ССЫЛКА Справочник.Номенклатура
	|	И НЕ РеквизитыОбъектов.Объект.ПометкаУдаления
	|	И НЕ РеквизитыОбъектов.Объект.ЭтоГруппа
	|	И РеквизитыОбъектов.Объект.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.АбонементПакетУслуг), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат))
	|	И РеквизитыОбъектов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И РеквизитыОбъектов.Значение = ИСТИНА
	|	И РеквизитыОбъектов.Реквизит = ""ОнлайнЗапись""
	|	И &УсловиеНормаВремени
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА РеквизитыОбъектов.Объект.ИндексСортировки = 0
	|			ТОГДА 999999
	|		ИНАЧЕ РеквизитыОбъектов.Объект.ИндексСортировки
	|	КОНЕЦ,
	|	РеквизитыОбъектов.Объект.Наименование");
	
	ЗапросУслуг.УстановитьПараметр("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	УсловиеНормаВремени = ?(Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга, "И РеквизитыОбъектов.Объект.НормаВремени <> 0", "");
	ЗапросУслуг.Текст	= СтрЗаменить(ЗапросУслуг.Текст, "И &УсловиеНормаВремени", УсловиеНормаВремени);
	
	Возврат ЗапросУслуг.Выполнить().Выгрузить();
	
КонецФункции

// Процедура, заполняет дерево услуг.
// 
Процедура ЗаполнитьДеревоНоменклатур(Объект, ДеревоНоменклатур) Экспорт
	
	ДеревоНоменклатур.ПолучитьЭлементы().Очистить();
	
	ЭтоУслуга = Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга;
	
	Если ЭтоУслуга Тогда
		ТаблицаГрупп 	   = ПолучитьТаблицуГруппОнлайнЗаписи();
		ТаблицаНоменклатур = ПолучитьТаблицуНоменклатурОнлайнЗаписи(Объект, ДеревоНоменклатур);
	Иначе
		ТаблицаГрупп 	   = ПолучитьТаблицуГруппОнлайнПродажи();
		ТаблицаНоменклатур = ПолучитьТаблицуНоменклатурОнлайнПродажи(Объект, ДеревоНоменклатур);
	КонецЕсли;
	
	МассивСтрок = ТаблицаНоменклатур.НайтиСтроки(Новый Структура("Услуга", Объект.Ссылка));
	
	Если МассивСтрок.Количество() > 0 Тогда
		
		ТекущаяГруппа 	 = ?(ЭтоУслуга, Объект.ГруппаОнлайнЗаписи, Объект.ГруппаОнлайнПродажи);
		ПредыдущаяГруппа = ?(ЭтоУслуга, Объект.Ссылка.ГруппаОнлайнЗаписи, Объект.Ссылка.ГруппаОнлайнПродажи);
		ГруппаИзменена   = ТекущаяГруппа <> ПредыдущаяГруппа;
		
		СтрокаТЗ 		 		  = МассивСтрок[0];
		СтрокаТЗ.Родитель 		  = ?(ЗначениеЗаполнено(ТекущаяГруппа) И Не ТекущаяГруппа.ПометкаУдаления, ТекущаяГруппа, Неопределено);
		СтрокаТЗ.ИндексСортировки = ?(ГруппаИзменена, Объект.ИндексСортировки, Объект.Ссылка.ИндексСортировки);
		
	КонецЕсли;
	
	Если ЭтоУслуга Тогда
		
		Для Каждого СтрокаТЧ Из ТаблицаГрупп Цикл
			
			МассивДочернихСтрок = ТаблицаНоменклатур.НайтиСтроки(Новый Структура("Родитель", СтрокаТЧ.Услуга));
			
			Если МассивДочернихСтрок.Количество() > 0 Тогда			
				СтрокаРодитель = ДеревоНоменклатур.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРодитель, СтрокаТЧ);
				
				Для Каждого СтрокаУслуги Из МассивДочернихСтрок Цикл					
					СтрокаУслуга = СтрокаРодитель.ПолучитьЭлементы().Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаУслуга, СтрокаУслуги);					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;		
	
	Иначе	
		ЗаполнитьДеревоНоменклатурРекурсивно(ТаблицаГрупп, ТаблицаНоменклатур, ДеревоНоменклатур);
	КонецЕсли;

	Для Каждого СтрокаТЧ Из ТаблицаНоменклатур.НайтиСтроки(Новый Структура("Родитель", Неопределено)) Цикл
		СтрокаУслуга = ДеревоНоменклатур.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаУслуга, СтрокаТЧ);
	КонецЦикла;
		
КонецПроцедуры

// Функция, возвращает структуру ресурсов.
//
Процедура ЗаполнитьДеревоНоменклатурРекурсивно(ТаблицаГруппСИерархией, ТаблицаНоменклатур, ДеревоНоменклатур)
	
	Для Каждого СтрокаТЧ ИЗ ТаблицаГруппСИерархией.Строки Цикл
		
		СтрокаРодитель = ДеревоНоменклатур.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРодитель, СтрокаТЧ);
		
		Если СтрокаТЧ.Строки.Количество() > 0 Тогда
			ЗаполнитьДеревоНоменклатурРекурсивно(СтрокаТЧ, ТаблицаНоменклатур, СтрокаРодитель);
		КонецЕсли;
		
		МассивДочернихСтрок = ТаблицаНоменклатур.НайтиСтроки(Новый Структура("Родитель", СтрокаТЧ.Услуга));
			
		Если МассивДочернихСтрок.Количество() > 0 Тогда
			
			Для Каждого СтрокаУслуги Из МассивДочернихСтрок Цикл
				
				СтрокаУслуга = СтрокаРодитель.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаУслуга, СтрокаУслуги);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

// Функция, возвращает таблицу с группами онлайн-записи.
//
Функция ПолучитьТаблицуГруппОнлайнЗаписи()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГруппыОнлайнЗаписи.Ссылка КАК Услуга,
	|	ГруппыОнлайнЗаписи.ИндексСортировки КАК ИндексСортировки,
	|	0 КАК ИндексКартинки,
	|	ИСТИНА КАК ЭтоГруппа,
	|	ИСТИНА КАК ОтображатьКнопкиПеремещения
	|ИЗ
	|	Справочник.ГруппыОнлайнЗаписи КАК ГруппыОнлайнЗаписи
	|ГДЕ
	|	НЕ ГруппыОнлайнЗаписи.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА ГруппыОнлайнЗаписи.ИндексСортировки = 0
	|			ТОГДА 999999
	|		ИНАЧЕ ГруппыОнлайнЗаписи.ИндексСортировки
	|	КОНЕЦ,
	|	ГруппыОнлайнЗаписи.Наименование");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция, возвращает таблицу с группами онлайн-продажи.
//
Функция ПолучитьТаблицуГруппОнлайнПродажи()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГруппыОнлайнПродажи.Ссылка КАК Услуга,
	|	ГруппыОнлайнПродажи.ИндексСортировки КАК ИндексСортировки,
	|	ГруппыОнлайнПродажи.Родитель КАК Родитель,
	|	0 КАК ИндексКартинки,
	|	ИСТИНА КАК ЭтоГруппа,
	|	ИСТИНА КАК ОтображатьКнопкиПеремещения
	|ИЗ
	|	Справочник.ГруппыОнлайнПродажи КАК ГруппыОнлайнПродажи
	|ГДЕ
	|	НЕ ГруппыОнлайнПродажи.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Услуга ИЕРАРХИЯ,
	|	ВЫБОР
	|		КОГДА ГруппыОнлайнПродажи.ИндексСортировки = 0
	|			ТОГДА 999999
	|		ИНАЧЕ ГруппыОнлайнПродажи.ИндексСортировки
	|	КОНЕЦ,
	|	ИндексСортировки ИЕРАРХИЯ,
	|	ГруппыОнлайнПродажи.Наименование ИЕРАРХИЯ");
	
	Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
КонецФункции

#КонецОбласти

// Функция получает наименование номенклатуры для чека.
//
Функция ПолучитьНаименованиеДляЧека(Номенклатура) Экспорт
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипЗнч(Номенклатура) <> Тип("СправочникСсылка.Номенклатура") Тогда 
		Возврат Номенклатура;
	КонецЕсли;
	
	СтруктураРеквизитов = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Номенклатура, "Наименование, НаименованиеПолное");
	
	Возврат ?(ЗначениеЗаполнено(СтруктураРеквизитов.НаименованиеПолное), СтруктураРеквизитов.НаименованиеПолное, СтруктураРеквизитов.Номенклатура);	
		
КонецФункции

// вид налога и ставка НДС       

// Функция, возвращает вид налога номенклатуры по структурной единице.
//
Функция ПолучитьВидНалогаНоменклатуры(Номенклатура, СтруктурнаяЕдиница) Экспорт
	
	Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	Организация = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтруктурнаяЕдиница, "Организация");
	
	ДанныеОрганизации	= ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(Организация	,
							"СПриоритетомНоменклатуры, СистемаНалогообложенияДляТоваров, СистемаНалогообложенияДляАвансов");
	ДанныеНоменклатуры	= ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(Номенклатура	,
							"ВидНалога, ТипНоменклатуры");
	
	Если Не ДанныеОрганизации.СПриоритетомНоменклатуры
		ИЛИ Не ЗначениеЗаполнено(ДанныеНоменклатуры.ВидНалога) Тогда
		
		Если ДанныеНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат
			И ЗначениеЗаполнено(ДанныеОрганизации.СистемаНалогообложенияДляАвансов) Тогда
			
			Возврат ДанныеОрганизации.СистемаНалогообложенияДляАвансов;     			
		Иначе
			Возврат ДанныеОрганизации.СистемаНалогообложенияДляТоваров;
		КонецЕсли;
		
	Иначе
		Возврат ДанныеНоменклатуры.ВидНалога;
	КонецЕсли;
	
КонецФункции

// Функция - Проверить виды налога номеклатуры совпадают
//
// Параметры:
//  Номенклатура1		 - 	 - 
//  Номенклатура2		 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//  Организация			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПроверитьВидыНалогаНомеклатурыСовпадают(Номенклатура1, Номенклатура2, СтруктурнаяЕдиница = Неопределено, Организация = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Организация) Тогда   
		Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
			СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
		КонецЕсли;
		Организация = СтруктурнаяЕдиница.Организация;
	КонецЕсли;
	
	ДанныеОрганизации = ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(Организация,
							"СПриоритетомНоменклатуры, СистемаНалогообложенияДляТоваров, СистемаНалогообложенияДляАвансов");
		
	МассивНоменклатур = Новый Массив;
	МассивНоменклатур.Добавить(Номенклатура1);
	МассивНоменклатур.Добавить(Номенклатура2);
	ВидНалогаНоменклатура1 = Неопределено;
	ВидНалогаНоменклатура2 = Неопределено;

	Запрос       = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.ВидНалога КАК ВидНалога,
		|	Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&МассивНоменклатур)";	
	Запрос.УстановитьПараметр("МассивНоменклатур", МассивНоменклатур);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Ссылка = Номенклатура1 Тогда 
			 ВидНалога1       = Выборка.ВидНалога;
			 ТипНоменклатуры1 = Выборка.ТипНоменклатуры; 
		 Иначе
			 ВидНалога2       = Выборка.ВидНалога;
			 ТипНоменклатуры2 = Выборка.ТипНоменклатуры;
		КонецЕсли;
		
	КонецЦикла;
		
	Если Не ДанныеОрганизации.СПриоритетомНоменклатуры
		ИЛИ Не ЗначениеЗаполнено(ВидНалога1) Тогда
		Если ТипНоменклатуры1 = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат
			И ЗначениеЗаполнено(ДанныеОрганизации.СистемаНалогообложенияДляАвансов) Тогда			
			ВидНалогаНоменклатура1 = ДанныеОрганизации.СистемаНалогообложенияДляАвансов;     			
		Иначе
			ВидНалогаНоменклатура1 = ДанныеОрганизации.СистемаНалогообложенияДляТоваров;
		КонецЕсли;
	Иначе
		ВидНалогаНоменклатура1 = ВидНалога1;
	КонецЕсли;
	
	Если Не ДанныеОрганизации.СПриоритетомНоменклатуры
		ИЛИ Не ЗначениеЗаполнено(ВидНалога2) Тогда
		Если ТипНоменклатуры2 = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат
			И ЗначениеЗаполнено(ДанныеОрганизации.СистемаНалогообложенияДляАвансов) Тогда			
			ВидНалогаНоменклатура2 = ДанныеОрганизации.СистемаНалогообложенияДляАвансов;     			
		Иначе
			ВидНалогаНоменклатура2 = ДанныеОрганизации.СистемаНалогообложенияДляТоваров;
		КонецЕсли;
	Иначе
		ВидНалогаНоменклатура2 = ВидНалога2;
	КонецЕсли;
	
	Возврат (ВидНалогаНоменклатура1 = ВидНалогаНоменклатура2);
	
КонецФункции

// Процедура, возвращает стаку НДС номенклатуры.
//
Функция ПолучитьСтавкуНДСНоменклатуры(Номенклатура, СтруктурнаяЕдиница) Экспорт
	
	Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	Организация = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтруктурнаяЕдиница, "Организация");
	
	СтавкаНДС = Неопределено;
	
	ДанныеОрганизации	= ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(Организация , "СПриоритетомНоменклатуры, СтавкаНДС, СтавкаНДСДляАвансов");
	ДанныеНоменклатуры	= ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(Номенклатура, "СтавкаНДС, ТипНоменклатуры");
	
	Если НЕ ДанныеОрганизации.СПриоритетомНоменклатуры 
		ИЛИ (ДанныеОрганизации.СПриоритетомНоменклатуры И Не ЗначениеЗаполнено(ДанныеНоменклатуры.СтавкаНДС)) Тогда
		
		Если ДанныеНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат
			И ЗначениеЗаполнено(ДанныеОрганизации.СтавкаНДСДляАвансов) Тогда
			
			Возврат ДанныеОрганизации.СтавкаНДСДляАвансов; 
		Иначе
			СтавкаНДС = ДанныеОрганизации.СтавкаНДС;
		КонецЕсли;
		
	Иначе
		СтавкаНДС = ДанныеНоменклатуры.СтавкаНДС;
	КонецЕсли;
	
	Возврат ?(ЗначениеЗаполнено(СтавкаНДС), СтавкаНДС, Перечисления.СтавкиНДС.БезНДС);	
	
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

// Процедура - Обработка получения представления
//
// Параметры:
//  Данные				 - 	 - 
//  Представление		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = Данные.Наименование;
	
КонецПроцедуры 

// Процедура Обработка получения представления.
//
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	Поля.Добавить("Наименование"); 	
	Поля.Добавить("СоДоступ"); 	
	
КонецПроцедуры

#КонецОбласти
