
#Область ОбработчикиСобытий

// Обработка заполнения объекта внешними данными
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Родитель") Тогда
			ЭтотОбъект.ТипНоменклатуры = ДанныеЗаполнения.Родитель.ТипНоменклатуры;
			Если НЕ ЗначениеЗаполнено(Специализация) Тогда
				Специализация = ДанныеЗаполнения.Родитель.Специализация;
			КонецЕсли; 
			// Добавлено по тикету 325867
		ИначеЕсли ДанныеЗаполнения.Свойство("ТипНоменклатуры") И ЗначениеЗаполнено(ДанныеЗаполнения.ТипНоменклатуры) Тогда 
			Если ТипЗНЧ(ДанныеЗаполнения.ТипНоменклатуры) = Тип("ФиксированныйМассив") Тогда
				ЭтотОбъект.ТипНоменклатуры = ДанныеЗаполнения.ТипНоменклатуры[0] 
			ИначеЕсли ТипЗНЧ(ДанныеЗаполнения.ТипНоменклатуры) = Тип("ПеречислениеСсылка.ТипыНоменклатуры") Тогда 
				ЭтотОбъект.ТипНоменклатуры = ДанныеЗаполнения.ТипНоменклатуры;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура, обработчик события "ПриКопировании"
//
Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЭтоГруппа Тогда
		УпаковкаДляОтчета 	= Неопределено;
		УпаковкаПоУмолчанию = Неопределено;
		ЭтоЗапас                = Ложь;
		ЭтоПакетУслуг           = Ложь;
        ЭтоПодарочныйСертификат = Ложь;
		ЭтоУслуга               = Ложь;
		ЭтоИмущество            = Ложь;
	КонецЕсли;	
	
	КодСинхронизации = "";
	
КонецПроцедуры

// Обработка проверки заполнения
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа = Ложь Тогда		
		Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат Тогда			
			ПроверяемыеРеквизиты.Добавить("Номинал");
		Иначе			
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ТипСрокаДействия"));
		КонецЕсли;		
		Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат И ВидНоминала = Истина Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Номинал"));
		КонецЕсли;
	КонецЕсли;	
	
	
КонецПроцедуры

// Обработчик перед записью объекта
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(НоменклатураМедицинскихУслуг) Тогда
		КодНоменклатурыМедицинскиУслуг = НоменклатураМедицинскихУслуг.Код;
		УЕТ = НоменклатураМедицинскихУслуг.УЕТ;
	КонецЕсли;
	
	Если Не ЭтоГруппа И НЕ ЗначениеЗаполнено(НаименованиеПолное) Тогда
		НаименованиеПолное = Наименование;
	КонецЕсли;
	//Если СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка() Тогда 
	//	СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
	//КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас
			Или ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал Тогда 
			ЭтоЗапас         = Истина;
		КонецЕсли;
		
		ЭтоИмущество        	= ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Имущество;
		ЭтоПакетУслуг           = ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор;
		ЭтоПодарочныйСертификат = ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат;
		ЭтоУслуга               = ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти