
////////////////////////////////////////////////////////////////////////////////
// Процесс подготовкм к импорту

&НаСервере
// Процедура, обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("СтраховаяКомпания", ЭтотОбъект.СтраховаяКомпания);
	Параметры.Свойство("ДоговорСтраховойКомпании", ЭтотОбъект.ДоговорСтраховойКомпании);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриОткрытии"
//
Процедура ПриОткрытии(Отказ)
	
	ФлагРазрешенияИмпорта = Ложь;
	СимволРазделитель = ";";
	СформироватьСписокРеквизитов();
	// ИзменитьПроверкуПолейТаблицыСоответствий();
	ЗаполнитьТаблицуСоответствийРеквизитами();
    ЭтотОбъект.ПоискПоТипу = 1;
	
КонецПроцедуры

&НаСервере
// Выбрать заполняемый справочник
//
Процедура СформироватьСписокРеквизитов()
	
	Объект.ТаблицаСоответсвийПолей.Очистить();
	Элементы.Декорация1.Заголовок = "";	
	
	ВыборПапкиСправочника = Справочники.Контрагенты.ПустаяСсылка();
	// заполняем список наименований реквизитов заполняемого справочника
	СписокРеквизитовСправочника.Очистить();
	СписокРеквизитовСправочника.Добавить("Номер амбулаторной карты");
	СписокРеквизитовСправочника.Добавить("Группа");
	СписокРеквизитовСправочника.Добавить("ФИО");
	СписокРеквизитовСправочника.Добавить("Фамилия");
	СписокРеквизитовСправочника.Добавить("Имя");
	СписокРеквизитовСправочника.Добавить("Отчество");
	СписокРеквизитовСправочника.Добавить("Дата рождения");
	СписокРеквизитовСправочника.Добавить("Дата регистрации");
	СписокРеквизитовСправочника.Добавить("Пол");
	СписокРеквизитовСправочника.Добавить("Адрес");
	СписокРеквизитовСправочника.Добавить("Телефон");
	СписокРеквизитовСправочника.Добавить("Email");
	СписокРеквизитовСправочника.Добавить("Место работы");
	СписокРеквизитовСправочника.Добавить("Комментарий");
	СписокРеквизитовСправочника.Добавить("Номер полиса");
	СписокРеквизитовСправочника.Добавить("Серия полиса");	
	СписокРеквизитовСправочника.Добавить("Начало действия полиса");
	СписокРеквизитовСправочника.Добавить("Конец действия полиса");
	СписокРеквизитовСправочника.Добавить("Код синхронизации"); 
	СписокРеквизитовСправочника.Добавить("Метки *");
	
КонецПроцедуры

&НаКлиенте
// Процедура - Заполнить таблицу соответствий реквизитами
//
Процедура ЗаполнитьТаблицуСоответствийРеквизитами()
	
	ОбязательныеПоля = СформироватьМассивОбязательныхПолей();
	ОтмечатьОбязательныеПоля = ЗначениеЗаполнено(ОбязательныеПоля);
	
	Объект.ТаблицаСоответсвийПолей.Очистить();
	ИндексЗначения = 0;
	Пока ИндексЗначения < СписокРеквизитовСправочника.Количество() Цикл		
		Строка = Объект.ТаблицаСоответсвийПолей.Добавить();		
		Строка.РеквизитСправочника = СписокРеквизитовСправочника[ИндексЗначения].Значение;
		
		Если ОтмечатьОбязательныеПоля И НЕ ОбязательныеПоля.Найти(Строка.РеквизитСправочника) = Неопределено Тогда	
			Строка.ОтметкаНезаполненного = Истина;					
		КонецЕсли;		
				
		ИндексЗначения = ИндексЗначения + 1;
	КонецЦикла;
	
	ФлагРазрешенияИмпорта = Истина;
	
КонецПроцедуры

&НаКлиенте
// Функция - Сформировать массив обязательных полей
// 
Функция СформироватьМассивОбязательныхПолей()
	
	ОбязательныеПоля = Новый Массив();
	ОбязательныеПоля.Добавить("ФИО");
	ОбязательныеПоля.Добавить("Фамилия");
	ОбязательныеПоля.Добавить("Имя");
	ОбязательныеПоля.Добавить("Отчество");
	ОбязательныеПоля.Добавить("Номер полиса");
	ОбязательныеПоля.Добавить("Начало действия полиса");
	ОбязательныеПоля.Добавить("Конец действия полиса");

	Возврат ОбязательныеПоля;
	
КонецФункции	
	
&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поля "ПоискПоТипу".
//
Процедура ПоискПоТипуПриИзменении(Элемент)
	
	ЭтотОбъект.ПоискПоТипу = ?(ЭтотОбъект.ПоискПоТипу = 0, 1, ЭтотОбъект.ПоискПоТипу);	
	
КонецПроцедуры
	
&НаКлиенте
// Процедура - обработчик события "НачалоВыбора"
//
Процедура ВыборФайлаИмпортаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыборФайла(Элемент);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении"
//
Процедура ВыборФайлаИмпортаПриИзменении(Элемент)
	
	ЧитаемыйФайл = Новый Файл(ФайлИмпорта);
	
	ЧитаемыйФайл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ВыборФайлаИмпортаПослеПроверки", ЭтотОбъект, Новый Структура("ЧитаемыйФайл", ЧитаемыйФайл)));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор файла импорта после проверки
//
// Параметры:
//  ПроверкаПройдена		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВыборФайлаИмпортаПослеПроверки(ПроверкаПройдена, ДополнительныеПараметры) Экспорт
	
	ЧитаемыйФайл = ДополнительныеПараметры.ЧитаемыйФайл;
		
	Если НЕ ПроверкаПройдена И НЕ ДополнительныеПараметры.Свойство("ПроверкаНаКаталогЗавершилась") ИЛИ ПроверкаПройдена И ДополнительныеПараметры.Свойство("ПроверкаНаКаталогЗавершилась") Тогда
		ПоказатьПредупреждение(,"Выберите файл загрузки."); 
	ИначеЕсли НЕ ДополнительныеПараметры.Свойство("ПроверкаНаКаталогЗавершилась") Тогда
		ЧитаемыйФайл.НачатьПроверкуЭтоКаталог(Новый ОписаниеОповещения("ВыборФайлаИмпортаПослеПроверки", ЭтотОбъект, Новый Структура("ЧитаемыйФайл, ПроверкаНаКаталогЗавершилась", ЧитаемыйФайл, Истина)));
		Возврат;
	Иначе
		ВыборФайлаИмпортаПриИзмененииЗавершение(ЧитаемыйФайл);
	КонецЕсли; 
	
КонецПроцедуры  

&НаКлиенте
// Процедура - Выбор файла импорта при изменении завершение
//
// Параметры:
//  ЧитаемыйФайл - 	 - 
//
Процедура ВыборФайлаИмпортаПриИзмененииЗавершение(ЧитаемыйФайл)
	
	Расширение = нРег(ЧитаемыйФайл.Расширение);
	
	Если нРег(Расширение) = ".xls" ИЛИ нРег(Расширение) = ".xlsx" Тогда
		
		ТипФайлаИмпорта = "EXCEL";
		элементы.СимволРазделитель.Видимость = Ложь;
	ИначеЕсли нРег(Расширение) = ".csv" Тогда
		
		ТипФайлаИмпорта = "TEXT";	
		элементы.СимволРазделитель.Видимость = Истина;
	КонецЕсли;
	
	Если ПолучитьПоляФайла() = Истина Тогда
		Элементы.ТаблицаСоответствияПолейПолеКолФайла.СписокВыбора.ЗагрузитьЗначения(СписокКолонокФайла.ВыгрузитьЗначения());
		// ЗаполнитьТаблицуСоответствий();
	Иначе 
		ПоказатьПредупреждение(,"Оперция прервана импорт не возможен !");
		Элементы.Декорация1.Заголовок = "";
	КонецЕсли;	
	
	Элементы.Декорация1.Заголовок = ФайлИмпорта;

КонецПроцедуры

&НаКлиенте
// Открывает диалог выбора файла
//
Процедура ВыборФайла(Элемент)
	
	ДиалогВыбораФайла =	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр = "Файл импорта (*.csv;*.xls;*.xlsx)|*.csv;*.xls;*.xlsx";
	
	ДиалогВыбораФайла.Заголовок						=	"Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогВыбораФайла.ИндексФильтра					=	0;
	ДиалогВыбораФайла.ПолноеИмяФайла				=	ФайлИмпорта;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла	=	Истина;
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбораФайла, Элемент", ДиалогВыбораФайла, Элемент)));

КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	Элемент = ДополнительныеПараметры.Элемент;

	Если (ВыбранныеФайлы <> Неопределено) Тогда
		ФайлИмпорта = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
	ВыборФайлаИмпортаПриИзменении(Элемент);

КонецПроцедуры

&НаКлиенте
// Процедура - Символ разделитель при изменении
//
Процедура СимволРазделительПриИзменении(Элемент)
	
	Если ПолучитьПоляФайла()=Истина Тогда
		Элементы.ТаблицаСоответствияПолейПолеКолФайла.СписокВыбора.ЗагрузитьЗначения(СписокКолонокФайла.ВыгрузитьЗначения());
		// ИзменитьПроверкуПолейТаблицыСоответствий();
	Иначе 
		ПоказатьПредупреждение(,"Оперция прервана импорт не возможен !");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Создаем и заполняем новый элемент справочника
//
Процедура ЗаполнитьРеквизитыСправочника(СтруктураРеквизитов, ИсходнаяСтрокаДанных, ВидМедицинскихКарт, СтруктураТелефонногоНомера = Неопределено)
	
	Если СтруктураРеквизитов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ненайдено соответствий наименований реквизитов и полей файла");
		Возврат;
	КонецЕсли;		 
	
	Попытка		
			
#Область _____________________________________________________СОЗДАНИЕ_ОБЪЕКТА_СПРАВОЧНИКА_КОНТРАГЕНТЫ______________________________________________________________		


		// Получаем значения реквизитов
		НомерАмбулаторнойКарты 	= ВернутьЗначениеРевизита("Номер амбулаторной карты", СтруктураРеквизитов);
		ФИО 					= ВернутьЗначениеРевизита("ФИО"						, СтруктураРеквизитов);
		Фамилия 				= ВернутьЗначениеРевизита("Фамилия"					, СтруктураРеквизитов);
		Имя 					= ВернутьЗначениеРевизита("Имя"						, СтруктураРеквизитов);
		Отчество 				= ВернутьЗначениеРевизита("Отчество"				, СтруктураРеквизитов);
		ДатаРождения 			= ВернутьЗначениеРевизита("Дата рождения"			, СтруктураРеквизитов);
		Пол 					= ВернутьЗначениеРевизита("Пол"						, СтруктураРеквизитов);
		Адрес 					= ВернутьЗначениеРевизита("Адрес"					, СтруктураРеквизитов);
		Телефон 				= ВернутьЗначениеРевизита("Телефон"					, СтруктураРеквизитов);
		Email 					= ВернутьЗначениеРевизита("Email"					, СтруктураРеквизитов);
		Комментарий 			= ВернутьЗначениеРевизита("Комментарий"				, СтруктураРеквизитов);
		СерияПолиса 			= ВернутьЗначениеРевизита("Серия полиса"			, СтруктураРеквизитов);
		НомерПолиса 			= ВернутьЗначениеРевизита("Номер полиса"			, СтруктураРеквизитов);
		НачалоДействияПолиса 	= ВернутьЗначениеРевизита("Начало действия полиса"	, СтруктураРеквизитов);
		КонецДействияПолиса 	= ВернутьЗначениеРевизита("Конец действия полиса"	, СтруктураРеквизитов);			
		КодСинхронизации 		= ВернутьЗначениеРевизита("Код синхронизации"		, СтруктураРеквизитов);
		ДатаРегистрации 		= ВернутьЗначениеРевизита("Дата регистрации"		, СтруктураРеквизитов);
		Метки 					= ВернутьЗначениеРевизита("Метки"					, СтруктураРеквизитов);
		МестоРаботы             = ВернутьЗначениеРевизита("МестоРаботы"	         	, СтруктураРеквизитов); 
		 
#Область ___________________________________________________________ПОЛУЧИМ_ПРЕДСТАВЛЕНИЕ_КЛИЕНТА__________________________________________________________________
			
		Если ЗначениеЗаполнено(ФИО) Тогда 
			СтруктураИнициалов = ВернутьСтруктуруИнициалов(ФИО);
			Фамилия 				= СтруктураИнициалов.Фамилия;
			Имя 					= СтруктураИнициалов.Имя;
			Отчество 				= СтруктураИнициалов.Отчество;
		Иначе 
			Фамилия 				= ?(Фамилия 	= Неопределено, "", Фамилия);
			Имя 					= ?(Имя 		= Неопределено, "", Имя);
			Отчество 				= ?(Отчество 	= Неопределено, "", Отчество);
		КонецЕсли;
		Представление 			= СокрЛП(Фамилия + " " + Имя + " " + Отчество);
			
#КонецОбласти
						
#Область ______________________________________________________________ОБРАБОТКА_ДАТЫ_РОЖДЕНИЯ_____________________________________________________________________

		Если ЗначениеЗаполнено(ДатаРождения) Тогда				
			ДатаР = ПривестиКТипуДата(СокрЛП(ДатаРождения));
			Если ЗначениеЗаполнено(ДатаР) Тогда					
				ДатаРождения = ДатаР;					         
			Иначе
				ДатаРождения = Неопределено;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неудалось привести к типу Дата. Строка: " + ИсходнаяСтрокаДанных);		
			КонецЕсли;
		Иначе
			ДатаРождения = Неопределено;
		КонецЕсли;
			
#КонецОбласти

#Область ______________________________________________________________ОБРАБОТКА_ДАТЫ_РЕГИСТРАЦИИ_____________________________________________________________________

		Если ЗначениеЗаполнено(ДатаРегистрации) Тогда				
			ДатаР = ПривестиКТипуДата(СокрЛП(ДатаРегистрации));
			Если ЗначениеЗаполнено(ДатаР) Тогда					
				ДатаРегистрации = ДатаР;					         
			Иначе
				ДатаРегистрации = Неопределено;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неудалось привести к типу Дата. Строка: " + ИсходнаяСтрокаДанных);		
			КонецЕсли;
		Иначе
			ДатаРегистрации = Неопределено;
		КонецЕсли;
			
#КонецОбласти

#Область ______________________________________________________________ПОДГОТОВИТЬ_ТЕЛЕФОН_ДЛЯ_ПОИСКА_________________________________________________________________


	Если ЗначениеЗаполнено(Телефон) Тогда
		
		Телефон = СтрЗаменить(СокрЛП(Телефон), "-", "");
		Телефон = СтрЗаменить(Телефон, "+", "");
		Телефон = СтрЗаменить(Телефон, "(", "");
		Телефон = СтрЗаменить(Телефон, ")", "");
		Телефон = СтрЗаменить(Телефон, " ", "");

		МассивТелефонов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Телефон, ",", Истина);
		
		Если МассивТелефонов.Количество() > 0 И ЭтотОбъект.ПоискПоТипу = 3 Тогда   	
			
			МассивТелефоновДобавляемых = Новый Массив;
			Для Каждого ТелефонМ Из МассивТелефонов Цикл
					
				Если Сред(ТелефонМ, 1, 1) = "0" Тогда
					МассивТелефоновДобавляемых.Добавить(Сред(ТелефонМ, 2));	
				КонецЕсли;	
					
				Объект_XDTO_Телефон = ПолучитьСтруктуру_XDTO(СокрЛП(ТелефонМ), ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
				
				Если Объект_XDTO_Телефон = Неопределено Тогда
					
					Если Лев(ТелефонМ, 1) = "+" Тогда
						ТелефонМ = Сред(ТелефонМ, 2);
					КонецЕсли;
					
					Объект_XDTO_Телефон = ПолучитьСтруктуру_XDTO(СокрЛП(ТелефонМ), ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
					
				КонецЕсли;
				
				МассивТелефоновДобавляемых.Добавить(Объект_XDTO_Телефон.Представление);
				
				НомерТелефонаПриведенный = СокрЛП(Объект_XDTO_Телефон.Состав.КодСтраны) + СокрЛП(Объект_XDTO_Телефон.Состав.КодГорода) + СокрЛП(Объект_XDTO_Телефон.Состав.Номер);
				МассивТелефоновДобавляемых.Добавить(НомерТелефонаПриведенный);    					
				
				НомерТелефонаПриведенныйБезКодов = Объект_XDTO_Телефон.Состав.Номер;
				МассивТелефоновДобавляемых.Добавить(НомерТелефонаПриведенный);   					
			КонецЦикла;
			Для Каждого ТелефонМ Из МассивТелефоновДобавляемых Цикл
				МассивТелефонов.Добавить(ТелефонМ);
			КонецЦикла;	
			
		КонецЕсли;
		
	КонецЕсли;
	
#КонецОбласти

#Область ______________________________________________________________ПОИСК_КЛИЕНТА__________________________________________________________________________________

		// Ищем не существует ли такой клиент			
		
		НовыйЭлемент = Справочники.Контрагенты.ПустаяСсылка();
		ВыполнятьЗапрос = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Представление", Представление+"%");
		
		Если ЗначениеЗаполнено(Представление) И 
			(ЭтотОбъект.ПоискПоТипу = 1 ИЛИ ЭтотОбъект.ПоискПоТипу = 2 ИЛИ
			(ЭтотОбъект.ПоискПоТипу = 3 И НЕ ЗначениеЗаполнено(МассивТелефонов)) ) Тогда
		
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Контрагенты.Ссылка КАК КлиентСсылка,
			|	Контрагенты.Телефон КАК Телефон
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	НЕ Контрагенты.ПометкаУдаления
			|	И НЕ Контрагенты.ЭтоГруппа
			|	И Контрагенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
			|	И Контрагенты.Наименование ПОДОБНО &Представление";
				
			// Поиск по ФИО + Дате Рождения
			Если ЭтотОбъект.ПоискПоТипу = 2 И ЗначениеЗаполнено(ДатаРождения) Тогда
				
				УсловиеПоискПоДатеРождения = " И ВЫБОР
				|			КОГДА НЕ Контрагенты.ДатаРожденияКлиента = ДАТАВРЕМЯ(1, 1, 1)
				|				ТОГДА Контрагенты.ДатаРожденияКлиента = &ДатаРожденияКлиента
				|			ИНАЧЕ ИСТИНА
				|		КОНЕЦ";
				
				Запрос.Текст = Запрос.Текст + Символы.ПС + УсловиеПоискПоДатеРождения;	
				Запрос.УстановитьПараметр("ДатаРожденияКлиента", ДатаРождения);
								
			КонецЕсли;
			
			ВыполнятьЗапрос = Истина;
			
		КонецЕсли;
	
		// Поиск по ФИО + Номеру телефона
		Если ЭтотОбъект.ПоискПоТипу = 3 И ЗначениеЗаполнено(МассивТелефонов) И ЗначениеЗаполнено(Представление) Тогда
	
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	КонтрагентыКонтактнаяИнформация.Ссылка КАК КлиентСсылка,
			|	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК Телефон
			|ИЗ
			|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
			|ГДЕ
			|	КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
			|	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКлиента)
			|	И (КонтрагентыКонтактнаяИнформация.НомерТелефона В (&МассивТелефонов)
			|			ИЛИ ВЫРАЗИТЬ(КонтрагентыКонтактнаяИнформация.Представление КАК СТРОКА(100)) В (&МассивТелефонов))
			|	И КонтрагентыКонтактнаяИнформация.Ссылка.Наименование = &Представление
			|	И НЕ КонтрагентыКонтактнаяИнформация.Ссылка.ПометкаУдаления
			|	И НЕ КонтрагентыКонтактнаяИнформация.Ссылка.ЭтоГруппа";
					
			Запрос.УстановитьПараметр("МассивТелефонов", МассивТелефонов);
			
			ВыполнятьЗапрос = Истина;
			
		КонецЕсли;
		
		Если ВыполнятьЗапрос = Истина Тогда			
			
			ТаблицаКлиентов = Запрос.Выполнить().Выгрузить();			
			
			Если ТаблицаКлиентов.Количество() = 1 Тогда
				НовыйЭлемент = ТаблицаКлиентов[0].КлиентСсылка;
				
			// Если Тип поиска по ФИО или ФИО + ДР, и найдено несколько клиентов,
			// то найдем нужного по телефону (если он заполнен)	
			ИначеЕсли ТаблицаКлиентов.Количество() > 1 Тогда				
				
				Если ЭтотОбъект.ПоискПоТипу = 3 Тогда
					НовыйЭлемент = ТаблицаКлиентов[0].КлиентСсылка;	
				ИначеЕсли ЗначениеЗаполнено(Телефон) Тогда
					
					МассивКлиентовСНезаполненнымТелефоном = Новый Массив;
					Для Каждого СтрокаТаблицы Из ТаблицаКлиентов Цикл 
						Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Телефон) Тогда
							МассивКлиентовСНезаполненнымТелефоном.Добавить(СтрокаТаблицы.КлиентСсылка);
							Продолжить;
						Иначе 
							Если СравнитьТелефоны(Телефон, СтрокаТаблицы.Телефон) Тогда 
								НовыйЭлемент = СтрокаТаблицы.КлиентСсылка;
								Прервать;
							КонецЕсли;	
						КонецЕсли;
					КонецЦикла;
					Если НовыйЭлемент.Пустая() И МассивКлиентовСНезаполненнымТелефоном.Количество() > 0 Тогда 
						НовыйЭлемент = МассивКлиентовСНезаполненнымТелефоном[0].КлиентСсылка;
					КонецЕсли;
					
				Иначе
					НовыйЭлемент = ТаблицаКлиентов[0].КлиентСсылка;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;						
			
#КонецОбласти

		ЭтоНовыйКонтрагент = Ложь;
			
		Если НовыйЭлемент.Пустая() Тогда							
			
			НовыйЭлемент = Справочники.Контрагенты.СоздатьЭлемент();
			НовыйЭлемент.ЮрФизЛицо 				= Перечисления.ЮрФизЛицо.ФизЛицо;
			НовыйЭлемент.Наименование 			= Представление;
			НовыйЭлемент.НаименованиеПолное 	= Представление;
			
			НовыйЭлемент.Фамилия 				= Фамилия;
			НовыйЭлемент.Имя 					= Имя;
			НовыйЭлемент.Отчество 				= Отчество;
			
			НовыйЭлемент.ДатаРожденияКлиента 	= ?(ДатаРождения = Неопределено, Дата(1,1,1), ДатаРождения);
			
			ЭтоНовыйКонтрагент = Истина;
			
		Иначе			
			НовыйЭлемент = НовыйЭлемент.ПолучитьОбъект();
		КонецЕсли;
		
		НовыйЭлемент.Родитель 				= ЭтотОбъект.ВыборПапкиСправочника;  
		НовыйЭлемент.ДатаРегистрации 		= ?(ЗначениеЗаполнено(НовыйЭлемент.ДатаРегистрации), НовыйЭлемент.ДатаРегистрации,
												?(ЗначениеЗаполнено(ДатаРегистрации), ДатаРегистрации, ТекущаяДатаСеанса())); 
												
		Если НовыйЭлемент.СтруктурнаяЕдиница.Пустая() Тогда 
			НовыйЭлемент.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КодСинхронизации)
			И КодСинхронизации <> НовыйЭлемент.КодСинхронизации  Тогда
			НовыйЭлемент.КодСинхронизации = КодСинхронизации;
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(Комментарий) Тогда
			НовыйЭлемент.Комментарий = Комментарий;
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(МестоРаботы) Тогда
			НовыйЭлемент.СоциальныйСтатус = Справочники.СоциальныеСтатусыКонтрагентов.Работающий;
			НовыйЭлемент.Организация      = МестоРаботы;
		КонецЕсли;
	
#Область _____________________________________________________ЗАПОЛНЕНИЕ_НОМЕРА_АМБУЛАТОРНОЙ_КАРТЫ____________________________________________________________


  		ЭтоЧисло = Ложь;
		Уникальный = Ложь;
		
		Если ЗначениеЗаполнено(НомерАмбулаторнойКарты) Тогда 
			
			Если  ТипЗнч(НомерАмбулаторнойКарты) = Тип("Число") Тогда 
				ЭтоЧисло = Истина;
				НомерАмбулаторнойКарты_Число = НомерАмбулаторнойКарты;
			ИначеЕсли  ТипЗнч(НомерАмбулаторнойКарты) = Тип("Строка") Тогда 
				ЭтоЧисло = ПроверитьСтрокуНаЧисло(НомерАмбулаторнойКарты);
				Если ЭтоЧисло Тогда 
					НомерАмбулаторнойКарты_Число = Число(НомерАмбулаторнойКарты); 
				КонецЕсли;
			КонецЕсли;
			
			Если НовыйЭлемент.ТекущаяМедицинскаяКарта.Пустая() Тогда
				
				МедКарта = Справочники.МедицинскиеКарты.НайтиПоКоду(СокрЛП(НомерАмбулаторнойКарты));
				Если НЕ МедКарта.Пустая() Тогда
					Если МедКарта.ВладелецКарты <> НовыйЭлемент.Ссылка Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Мед. карта № "+СокрЛП(НомерАмбулаторнойКарты)+" принадлежит другому владельцу!");
					Иначе	
						НовыйЭлемент.ТекущаяМедицинскаяКарта = МедКарта;	
					КонецЕсли;	
				Иначе								
					МедКарта = Справочники.МедицинскиеКарты.СоздатьЭлемент();
					МедКарта.Код = НомерАмбулаторнойКарты;
					МедКарта.ДатаРегистрации = ТекущаяДата();
					Если ЗначениеЗаполнено(ВидМедицинскихКарт) Тогда 
						МедКарта.ВидМедицинскойКарты = ВидМедицинскихКарт;
					Иначе 	
						ВидыМедицинскихКарт = Справочники.ВидыМедицинскихКарт.Выбрать();
						Если ВидыМедицинскихКарт.Следующий() Тогда									
							МедКарта.ВидМедицинскойКарты = ВидыМедицинскихКарт.Ссылка;
						Иначе 
							ВидМедКарты = Справочники.ВидыМедицинскихКарт.СоздатьЭлемент();
							ВидМедКарты.Наименование = "Медицинская карта клиента";
							ВидМедКарты.ДлинаНомера = 12;
							ВидМедКарты.ПечатнаяФорма = Перечисления.ПечатныеФормыМедицинскихКарт.АмбулаторнаяКарта_043_У_А5;
							ВидМедКарты.Записать();
							МедКарта.ВидМедицинскойКарты = ВидМедКарты.Ссылка;
						КонецЕсли;
					КонецЕсли;
					МедКарта.ВладелецКарты = НовыйЭлемент.Ссылка;
					МедКарта.Наименование = МедКарта.ВидМедицинскойКарты.Наименование + " №" + МедКарта.Код + ", " + МедКарта.ВладелецКарты;
					МедКарта.Записать();
					
					МенеджерЗаписи = РегистрыСведений.МестонахождениеМедицинскихКарт.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Период = ТекущаяДата();
					МенеджерЗаписи.МедицинскаяКарта = МедКарта.Ссылка;
					МенеджерЗаписи.Местоположение = Справочники.Местоположения.ВКлинике;
					МенеджерЗаписи.Записать();
					
					НовыйЭлемент.ТекущаяМедицинскаяКарта = МедКарта.Ссылка;
				КонецЕсли;							
				
				
			КонецЕсли;	
		КонецЕсли;					
		
		
#КонецОбласти
			

#Область ________________________________________________________________ЗАПОЛНЕНИЕ_ПОЛА______________________________________________________________________


		Если НЕ ЗначениеЗаполнено(НовыйЭлемент.ПолКлиента) Тогда 
			Если Пол <> "" И Пол <> Неопределено Тогда				
				НайденныйПол = ПолучитьТипПол(СокрЛП(Пол), Перечисления.ПолФизическогоЛица);				
				Если НайденныйПол <> Неопределено Тогда
					НовыйЭлемент.ПолКлиента = НайденныйПол
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неудалось привести к типу Пол. Строка: " + ИсходнаяСтрокаДанных);		
				КонецЕсли;
			Иначе 
				ПолКлиента = ОбщегоНазначенияКлиентСерверСтоматология.ОпределитьПолКлиента(Фамилия, Имя, Отчество);
				Если ПолКлиента = "Мужской" Тогда
					НовыйЭлемент.ПолКлиента = Перечисления.ПолФизическогоЛица.Мужской;
				ИначеЕсли ПолКлиента = "Женский" Тогда
					НовыйЭлемент.ПолКлиента = Перечисления.ПолФизическогоЛица.Женский;
				КонецЕсли;					
			КонецЕсли;			
		КонецЕсли;
			
#КонецОбласти


#Область ________________________________________________________ЗАПОЛНЕНИЕ_КОНТАКТНОЙ_ИНФОРМАЦИИ_____________________________________________________________


		Email = ВернутьЗначениеРевизита("Email", СтруктураРеквизитов);
		Если ЗначениеЗаполнено(Email) Тогда
			Если Найти(Email, "@") = 0 Тогда
				Email = "";
			КонецЕсли;
		КонецЕсли;
		
		Клиент_КонтактнаяИнформация = НовыйЭлемент.КонтактнаяИнформация;
		
		// Заполняем телефон клиента
		Если ЗначениеЗаполнено(Телефон) Тогда
			
			Представление = "";
			// Разложим телефоны на подстроки еще раз, т.к. выше в этот массив попало много ненужных строк
			МассивТелефонов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Телефон, ",");
			Для Каждого Телефон Из МассивТелефонов Цикл
				
				Объект_XDTO_Телефон = ПолучитьСтруктуру_XDTO(СокрЛП(Телефон), Перечисления.ТипыКонтактнойИнформации.Телефон);
				
				// Найти в КИ существующий телефон
				Представление = Объект_XDTO_Телефон.Представление;
				
				НайденныеСтроки = Клиент_КонтактнаяИнформация.НайтиСтроки(Новый Структура("Представление, Тип", Представление, Перечисления.ТипыКонтактнойИнформации.Телефон));
				Если НайденныеСтроки.Количество() = 0 Тогда
					ЗаполнитьТелефон(НовыйЭлемент, Объект_XDTO_Телефон, Справочники.ВидыКонтактнойИнформации.ТелефонКлиента);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		// Заполняем Email клиента
		МассивEmail = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Email, ",");
		Для Каждого Email Из МассивEmail Цикл
			Объект_XDTO_Email = ПолучитьСтруктуру_XDTO(СокрЛП(Email), Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			
			// Найти в КИ существующий АдресЭлектроннойПочты
			Представление = Объект_XDTO_Email.Представление;
			
			НайденныеСтроки = Клиент_КонтактнаяИнформация.НайтиСтроки(Новый Структура("Представление, Тип", Представление, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
			Если НайденныеСтроки.Количество() = 0 Тогда
				ЗаполнитьEmail(НовыйЭлемент, Объект_XDTO_Email, Справочники.ВидыКонтактнойИнформации.EmailКлиента);
			КонецЕсли;
			
		КонецЦикла;
		
		// Заполняем адрес клиента
		Если ЗначениеЗаполнено(Адрес) Тогда
			
			Объект_XDTO_Адрес = ПолучитьСтруктуру_XDTO(Адрес	, Перечисления.ТипыКонтактнойИнформации.Адрес);
			
			// Найти в КИ существующий Адрес
			Представление = Объект_XDTO_Адрес.Представление;
			
			ВсеАдресаКлиента = Клиент_КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
			Для каждого АдресКлиента Из ВсеАдресаКлиента Цикл
				Клиент_КонтактнаяИнформация.Удалить(АдресКлиента);
			КонецЦикла;					
			
			ЗаполнитьАдрес(НовыйЭлемент, Объект_XDTO_Адрес, Справочники.ВидыКонтактнойИнформации.АдресКлиента);
			
		КонецЕсли;
				
#КонецОбласти


#Область _____________________________________________________ЗАПИСЬ_КОНТРАГЕНТА______________________________________________________________________________


		НовыйЭлемент.Записать();

#КонецОбласти


#Область _____________________________________________________ПОИСК_И_СОЗДАНИЕ_ПОЛИСОВ_МЕДИЦИНСКОГО_СТРАХОВАНИЯ_______________________________________________


		СсылкаПолисМедСтрахования = Справочники.ПолисыМедицинскогоСтрахования.ПустаяСсылка();
		
		Если НЕ ЭтоНовыйКонтрагент Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ПолисыМедицинскогоСтрахования.Ссылка КАК Ссылка
			               |ИЗ
			               |	Справочник.ПолисыМедицинскогоСтрахования КАК ПолисыМедицинскогоСтрахования
			               |ГДЕ
			               |	НЕ ПолисыМедицинскогоСтрахования.ПометкаУдаления
			               |	И ПолисыМедицинскогоСтрахования.Контрагент = &Контрагент
			               |	И ПолисыМедицинскогоСтрахования.СтраховаяКомпания = &СтраховаяКомпания
			               |	И ПолисыМедицинскогоСтрахования.НомерПолиса ПОДОБНО &НомерПолиса
			               |	И &УсловиеСерияПолиса
			               |	И &УсловиеТипПолиса";
						
			Запрос.УстановитьПараметр("НомерПолиса",		СокрЛП(НомерПолиса));		
			Запрос.УстановитьПараметр("Контрагент",			НовыйЭлемент.Ссылка);
			Запрос.УстановитьПараметр("СтраховаяКомпания",	ЭтотОбъект.СтраховаяКомпания);	
			Запрос.УстановитьПараметр("СерияПолиса",		СокрЛП(СерияПолиса));
			Запрос.УстановитьПараметр("ТипПолиса",			ЭтотОбъект.ТипПолиса);
				
			УсловиеСерияПолиса = ?(ЗначениеЗаполнено(СокрЛП(СерияПолиса)), "ПолисыМедицинскогоСтрахования.СерияПолиса ПОДОБНО &СерияПолиса", "ИСТИНА");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСерияПолиса", УсловиеСерияПолиса); 
			
			УсловиеТипПолиса = ?(ЗначениеЗаполнено(ЭтотОбъект.ТипПолиса), "ПолисыМедицинскогоСтрахования.ТипПолиса = &ТипПолиса", "ИСТИНА");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеТипПолиса", УсловиеТипПолиса); 			
						
			ТаблицаПолисов = Запрос.Выполнить().Выгрузить();
			
			Если ЗначениеЗаполнено(ТаблицаПолисов) Тогда
				СсылкаПолисМедСтрахования = ТаблицаПолисов[0].Ссылка;		
			КонецЕсли;	
			
		КонецЕсли;
		
		НачалоДействияПолиса	= ?(ЗначениеЗаполнено(НачалоДействияПолиса), ПривестиКТипуДата(СокрЛП(НачалоДействияПолиса)), Дата(1, 1, 1));
		КонецДействияПолиса		= ?(ЗначениеЗаполнено(КонецДействияПолиса), ПривестиКТипуДата(СокрЛП(КонецДействияПолиса)), Дата(1, 1, 1));
		
		Если СсылкаПолисМедСтрахования.Пустая() Тогда
			
			СсылкаПолисМедСтрахования = Справочники.ПолисыМедицинскогоСтрахования.СоздатьЭлемент();	
			
			СсылкаПолисМедСтрахования.СерияПолиса = СокрЛП(СерияПолиса);
			СсылкаПолисМедСтрахования.НомерПолиса = СокрЛП(НомерПолиса);
			СсылкаПолисМедСтрахования.Контрагент = НовыйЭлемент.Ссылка;
			СсылкаПолисМедСтрахования.СтраховаяКомпания = ЭтотОбъект.СтраховаяКомпания;
			СсылкаПолисМедСтрахования.ТипПолиса = ?(ЗначениеЗаполнено(ЭтотОбъект.ТипПолиса), ЭтотОбъект.ТипПолиса, Перечисления.ТипыПолиса.ДобровольноеМедицинскоеСтрахование);
			СсылкаПолисМедСтрахования.Договор = ЭтотОбъект.ДоговорСтраховойКомпании;
			
			СсылкаПолисМедСтрахования.Наименование = ""+ЭтотОбъект.СтраховаяКомпания+" №"+СокрЛП(НомерПолиса)+" с "+Формат(НачалоДействияПолиса,"ДФ=dd.MM.yyyy")+" по "+Формат(КонецДействияПолиса,"ДФ=dd.MM.yyyy");

		Иначе
			СсылкаПолисМедСтрахования = СсылкаПолисМедСтрахования.ПолучитьОбъект();					
		КонецЕсли;
		
		СсылкаПолисМедСтрахования.ДанаНачала = НачалоДействияПолиса;
		СсылкаПолисМедСтрахования.ДатаОкончания = КонецДействияПолиса;
		
		Попытка
			СсылкаПолисМедСтрахования.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать полис медицинского страхования для пациента: " + Строка(НовыйЭлемент.Ссылка) + " по причине: " + ОписаниеОшибки());
		КонецПопытки;
			
#КонецОбласти

						
#Область _____________________________________________________СОЗДАНИЕ_МЕТОК__________________________________________________________________________________
			
		Если ЗначениеЗаполнено(Метки) Тогда
			
			МассивМетки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Метки, ",");
			
			ТабМетки = Новый ТаблицаЗначений;
			ТабМетки.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
			
			Для Каждого Метка Из МассивМетки Цикл
				СтрокаТабМетки = ТабМетки.Добавить();
				СтрокаТабМетки.Наименование = Лев(СокрЛП(Метка), 50);
			КонецЦикла;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВЫРАЗИТЬ(Метки.Наименование КАК СТРОКА(50)) КАК Наименование
			|ПОМЕСТИТЬ ВТ_МеткиВсе
			|ИЗ
			|	&Метки КАК Метки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Метки.Ссылка КАК МеткаСсылка,
			|	ВТ_МеткиВсе.Наименование КАК Наименование
			|ИЗ
			|	ВТ_МеткиВсе КАК ВТ_МеткиВсе
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Метки КАК Метки
			|		ПО ВТ_МеткиВсе.Наименование = Метки.Наименование";
			
			Запрос.УстановитьПараметр("Метки", ТабМетки); 
			
			ТабРезультат = Запрос.Выполнить().Выгрузить();
			
			Для Каждого СтрокаТЗ Из ТабРезультат Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаТЗ.МеткаСсылка) Тогда
					
					НоваяМетка = Справочники.Метки.СоздатьЭлемент();
					НоваяМетка.Наименование 			= СокрЛП(СтрокаТЗ.Наименование);
					НоваяМетка.ИспользоватьДляПациентов = Истина;
					НоваяМетка.ЦветМетки 				= "{""#"",9cd510c7-abfc-11d4-9434-004095e12fc7,2,{3,3,{-1}}}"; //{"#",9cd510c7-abfc-11d4-9434-004095e12fc7,2,{3,3,{-1}}}
					
					Попытка
						НоваяМетка.Записать();
						СтрокаТЗ.МеткаСсылка = НоваяМетка.Ссылка;
					Исключение
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка при записи элемента справочника Метки.';en='Error at records element directory Labels.'") + Символы.ПС + ОписаниеОшибки());	
						Продолжить;	
					КонецПопытки;
					
				КонецЕсли;
				
				ЗаписьМеткаКлиента 			= РегистрыСведений.МеткиКлиентов.СоздатьМенеджерЗаписи();
				ЗаписьМеткаКлиента.Автор 	= ПараметрыСеанса.ТекущийПользователь;
				ЗаписьМеткаКлиента.Активна 	= Истина;
				ЗаписьМеткаКлиента.Клиент 	= НовыйЭлемент.Ссылка;
				ЗаписьМеткаКлиента.Метка 	= СтрокаТЗ.МеткаСсылка;
				ЗаписьМеткаКлиента.Период	= ТекущаяДатаСеанса();
				ЗаписьМеткаКлиента.Записать(Истина);
				
			КонецЦикла;
			
		КонецЕсли;	

#КонецОбласти


#КонецОбласти
										
		СчетчикИмпортируемыхОбъектов = СчетчикИмпортируемыхОбъектов+1;
	Исключение
		ТекстИсключение = ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка обработки по причине: " + ТекстИсключение);		
	КонецПопытки;	  
	
КонецПроцедуры

&НаСервере
// Верент значение реквизита справочника из переданной структуры реквизитов
//
Функция ВернутьЗначениеРевизита(НаименованиеРеквизита, СтруктураРеквизитов)
	
	Возв = СокрЛП(СтруктураРеквизитов[СтрЗаменить(НаименованиеРеквизита," ","")]);   
	Если Возв = "" Тогда
		Возврат Неопределено;
	Иначе
		Возврат Возв;
	КонецЕсли;
	
КонецФункции  

&НаСервере
// Функция - Вернуть структуру инициалов
//
Функция ВернутьСтруктуруИнициалов(ФИО)

	ФИО = СокрЛП(ФИО);
	НомерПробела = Найти(ФИО, " ");
	Если НомерПробела = 0 Тогда 
		Фамилия = ФИО;
		Имя = "";
		Отчество = "";
	Иначе 
		Фамилия = СокрЛП(Лев(ФИО, НомерПробела));	
		ИмяОтчество = СокрЛП(Сред(ФИО, НомерПробела));	
		НомерПробела = Найти(ИмяОтчество, " ");
		Если НомерПробела = 0 Тогда 
			Имя = ИмяОтчество;
		    Отчество = "";
		Иначе 
			Имя = СокрЛП(Лев(ИмяОтчество, НомерПробела));
			Отчество = СокрЛП(Сред(ИмяОтчество, НомерПробела));			
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Новый Структура("Фамилия, Имя, Отчество", Фамилия, Имя, Отчество);
	
КонецФункции


//////////////////////////////////////////////////////////////////////////////////////////////
// Импорт из Excel таблицы

// Получить список данных из строки Excel
&НаКлиенте
Функция ИзСтрокиExcel(ExcelЛист, НомерСтроки, КолСтолбцов)
	
	СписокПолей = Новый СписокЗначений;
	
	Для Столбец = 1 По КолСтолбцов Цикл
		СписокПолей.Добавить(ExcelЛист.Cells(НомерСтроки,Столбец).Text, ExcelЛист.Cells(НомерСтроки,Столбец).Text);
	КонецЦикла;
	
	Возврат СписокПолей;
	
КонецФункции

// Получаем наименования полей из первой строки 
&НаКлиенте
Функция ПолчитьПоляИзExcel()
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ФайлИмпорта);
		// Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист = Excel.Sheets(1);
	Исключение
		ТекстИсключение=ОписаниеОшибки();
		ПоказатьПредупреждение(,"Немогу подключиться к файлу по причине: "+ТекстИсключение);
		Возврат неопределено;		 
	КонецПопытки;
	
	ColumnsCount = Excel.Cells.CurrentRegion.Columns.Count;		
	СписокКолонокФайла=ИзСтрокиExcel(ExcelЛист,1,ColumnsCount);
	
	Excel.WorkBooks.Close();
	Excel = 0;
	
	возврат СписокКолонокФайла;
	
КонецФункции

&НаКлиенте
// Загрузка реквизитов справочника из таблицы Excel
// 
Функция ЗагрузитьИзExcel()
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ФайлИмпорта);
		// Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист = Excel.Sheets(1);
	Исключение
		ТекстИсключение = ОписаниеОшибки();
		ПоказатьПредупреждение(,"Не могу подключиться к файлу по причине: "+ТекстИсключение);
		Возврат неопределено;		 
	КонецПопытки;
	
	
	КолСтрок = Excel.Cells.CurrentRegion.Rows.Count;
	КолСтолбцов = Excel.Cells.CurrentRegion.Columns.Count;
	
	ИндексСтроки = 2;
	Коэфициент = 100 / КолСтрок;
	Коэф = Коэфициент;
	
	ТекстСообщения = "Импорт страховых пациентов";
	Пока ИндексСтроки <= КолСтрок Цикл
		СписокДанных = ИзСтрокиExcel(ExcelЛист, ИндексСтроки, КолСтолбцов);
		СтруктураРеквизитов = Новый Структура();
		
		Индекс = 0;
		Пока Индекс < Объект.ТаблицаСоответсвийПолей.Количество() Цикл
			
			Строка = Объект.ТаблицаСоответсвийПолей[Индекс];
			
			ОбщегоНазначенияКлиентСерверСтоматология.УдалитьНедопустимыеСимволыXMLРабочая(Строка, "");
			
			Реквизит = СтрЗаменить(Строка.РеквизитСправочника, " ", "");
			Реквизит = СтрЗаменить(Реквизит, "*", "");	
			
			Если Строка.КолонкаФайла <> "" Тогда
				
				Идентификатор = СписокКолонокФайла.НайтиПоЗначению(Строка.КолонкаФайла).ПолучитьИдентификатор();
				СтруктураРеквизитов.Вставить(Реквизит, СписокДанных[Идентификатор].Значение);
				
			Иначе   
				
				СтруктураРеквизитов.Вставить(Реквизит, "");
				
			КонецЕсли;	   
			
			Индекс = Индекс + 1;
			
		КонецЦикла;

		Состояние(ТекстСообщения, ?(Цел(Коэф) < 1, 1, Цел(Коэф)), "Получение " + Строка(СтруктураРеквизитов.Фамилия) + " " + Строка(СтруктураРеквизитов.Имя) + " " + Строка(СтруктураРеквизитов.Отчество) + "...", БиблиотекаКартинок.Информация32); 
		// Приведем телефонный номер к установленному формату
		СписокПолей = Новый СписокЗначений;
		УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(?(СтруктураРеквизитов.Свойство("Телефон"), СтруктураРеквизитов.Телефон, ""), СписокПолей);			
		СтруктураТелефонногоНомера = ЗаполнитьСтруктуруТелефонногоНомера(?(СтруктураРеквизитов.Свойство("Телефон"), СтруктураРеквизитов.Телефон, ""), СписокПолей);
		
		
		ЗаполнитьРеквизитыСправочника(СтруктураРеквизитов, Формат(СписокДанных), ВидМедицинскихКарт, СтруктураТелефонногоНомера);
		Коэф = Коэф + Коэфициент;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;		
	
	Excel.WorkBooks.Close();
	Excel = 0;
	
	Возврат Истина;
	
КонецФункции // ЗагрузитьИзExcel()


////////////////////////////////////////////////////////////////////////////////////
// Импорт из текстового файла

// Работа с текстовым файлом
&НаКлиенте
Функция ПолучитьПоляФайла()
	
	Если ТипФайлаИмпорта="TEXT" Тогда
		
		// Читаем первую строку файла содержащую наименования колонок
		Текст = Новый ЧтениеТекста(ФайлИмпорта);
		Стр = Текст.ПрочитатьСтроку();
		Если Стр=Неопределено Тогда
			
			ПоказатьПредупреждение(,"Файл импорта пуст ! импорт не возможен !");
			Возврат Ложь;
		КонецЕсли;	 
		
		СписокКолонокФайла = СтрокаВСписок(Стр, СимволРазделитель);
	Иначе
		
		СписокКолонокФайла = ПолчитьПоляИзExcel();
	КонецЕсли;
	
	Если СписокКолонокФайла.Количество() = 0 Тогда 
		
		ПоказатьПредупреждение(,"Файл импорта пуст ! импорт не возможен !");
		Возврат Ложь;
	Иначе
		
		Возврат Истина;	   
	КонецЕсли; 
	
КонецФункции

// Получить строку реквизитов из текстового файла
&НаКлиенте
Функция ЗагрузитьИзТекста()
	
	Попытка
		
		// Выводим оповещение, т.к. показать прогресс в случае с текстовым файлом затруднительно
		ПоказатьОповещениеПользователя("Выполнение импорта данных", , "Производится загрузка данных из файла. Это может занять некоторое время.", БиблиотекаКартинок.Информация32);
		
		Текст = Новый ЧтениеТекста(ФайлИмпорта);
		Стр = Текст.ПрочитатьСтроку();
		Стр = Текст.ПрочитатьСтроку(); 
		
		СтруктураРеквизитов = Новый Структура();
		
		Пока Стр <> Неопределено Цикл
			
			СписокДанных = СтрокаВСписок(Стр, СимволРазделитель);
			Индекс = 0;
			Пока Индекс < Объект.ТаблицаСоответсвийПолей.Количество() Цикл
				
				Строка 		= Объект.ТаблицаСоответсвийПолей[Индекс];
				Реквизит 	= СтрЗаменить(Строка.РеквизитСправочника," ","");
				Реквизит 	= СтрЗаменить(Реквизит,"*","");	
				
				Если Строка.КолонкаФайла <> "" Тогда
					Идентификатор = СписокКолонокФайла.НайтиПоЗначению(Строка.КолонкаФайла).ПолучитьИдентификатор();
					СтруктураРеквизитов.Вставить(Реквизит, СписокДанных[Идентификатор].Значение);
				Иначе   
					СтруктураРеквизитов.Вставить(Реквизит, "");
				КонецЕсли;	   
				
				Индекс = Индекс + 1;
			КонецЦикла;
			
			ОбщегоНазначенияКлиентСерверСтоматология.УдалитьНедопустимыеСимволыXMLРабочая(Стр, "");
			
			ЗаполнитьРеквизитыСправочника(СтруктураРеквизитов, Стр, ВидМедицинскихКарт);
			Стр = Текст.ПрочитатьСтроку();
			
		КонецЦикла;
	Исключение 
		ТекстИсключение = ОписаниеОшибки();
		ПоказатьПредупреждение(,"Ошибка обработки файла: " + ТекстИсключение);
		Возврат неопределено;	
	КонецПопытки;	
	
	Возврат Истина;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////
// Процесс импорта

&НаКлиенте
// Процедура - Старт импорта
//
Процедура СтартИмпорта(Команда)
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ФайлИмпорта) Тогда 		
		ПоказатьПредупреждение(,"Укажите файл импорта");
		Возврат;		
	КонецЕсли;
	
	Если  ВыборПапкиСправочника.Пустая() = Истина Тогда
		ПоказатьПредупреждение(,"Укажите папку справочника");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СтраховаяКомпания) Тогда 		
		ПоказатьПредупреждение(,"Укажите страховую компанию");
		Возврат;		
	КонецЕсли;
	
	ПроверятьЗаполнениеФИО = Истина;
	
	ТаблицаСоответствийПолей = Объект.ТаблицаСоответсвийПолей;
	РезультатПроверки = ВернутьНезаполненныеОбязательныеПоляТаблицыСоответствий(ТаблицаСоответствийПолей, ПроверятьЗаполнениеФИО, ЭтотОбъект.ПоискПоТипу);
	
	Если ПроверятьЗаполнениеФИО И РезультатПроверки.Свойство("Стр_НезаполненныеРеквизитыФИО") И ЗначениеЗаполнено(РезультатПроверки.Стр_НезаполненныеРеквизитыФИО) Тогда
		
		ФИОЗаполнено = НЕ РезультатПроверки.Стр_НезаполненныеРеквизитыФИО.Свойство("ФИО");
		
		ПроверкаЗаполненияФИО = ?(РезультатПроверки.Стр_НезаполненныеРеквизитыФИО.Свойство("Фамилия"), 0, 1) + 
							  + ?(РезультатПроверки.Стр_НезаполненныеРеквизитыФИО.Свойство("Имя"), 0, 1) +
							  + ?(РезультатПроверки.Стр_НезаполненныеРеквизитыФИО.Свойство("Отчество"), 0, 1);
		
		Если НЕ ФИОЗаполнено И ПроверкаЗаполненияФИО = 0 Тогда
			
			ПоказатьПредупреждение(,"Заполните поля ФИО или Фамилия, Имя, Отчество");			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если РезультатПроверки.Свойство("Строка_НезаполненныеРеквизиты") И ЗначениеЗаполнено(РезультатПроверки.Строка_НезаполненныеРеквизиты) Тогда
		
		ПоказатьПредупреждение(,"Заполните следующие реквизиты в таблице соответствий: " + РезультатПроверки.Строка_НезаполненныеРеквизиты + ".");
	    Возврат;
		
	КонецЕсли;
		
	Если ФлагРазрешенияИмпорта = Истина Тогда
		СчетчикИмпортируемыхОбъектов = 0;
		Результат = Ложь;
		
		Если ТипФайлаИмпорта = "TEXT" Тогда
			
			Результат = ЗагрузитьИзТекста();
		Иначе
			Результат = ЗагрузитьИзExcel();
		КонецЕсли;	
		
		Если Результат = Истина Тогда	
			
			ПоказатьПредупреждение(,"Операция импортирования завершена успешно. Обновлено объектов: "+Формат(СчетчикИмпортируемыхОбъектов, "ЧН=0"));
		КонецЕсли;	 
	Иначе
		
		ПоказатьПредупреждение(,"Операция не возможна в связи с неверными настройками импортирования");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Вернуть незаполненные обязательные поля таблицы соответствий
//
Функция ВернутьНезаполненныеОбязательныеПоляТаблицыСоответствий(ТаблицаСоответсвийПолей, ВключатьПроверкуФИОВРезультат = Ложь, ПоискПоТипу)
	
	ТаблицаСоответсвийПолей_ТаблицаЗначений = ТаблицаСоответсвийПолей.Выгрузить(); 	
	ОбязательныеПоля = ТаблицаСоответсвийПолей_ТаблицаЗначений.НайтиСтроки(Новый Структура("ОтметкаНезаполненного", Истина));
	
	Если НЕ ПоискПоТипу = 1 Тогда
		
		ПолеПоиска = ?(ПоискПоТипу = 2, "Дата рождения", "Телефон");
		ДопСтрока = ТаблицаСоответсвийПолей_ТаблицаЗначений.НайтиСтроки(Новый Структура("РеквизитСправочника", ПолеПоиска)); 	
		Если ЗначениеЗаполнено(ДопСтрока) Тогда		
			ОбязательныеПоля.Добавить(ДопСтрока[0]); 			
		КонецЕсли;
		
	КонецЕсли;
	// ВозвращаемыйМассивР = Новый Массив;
	ПредставлениеНезаполненных = "";
	Если ВключатьПроверкуФИОВРезультат Тогда
		ВозвращаемаяСтруктураФИО = Новый Структура;
	КонецЕсли;
	
	Для Каждого СтрокаТ Из ОбязательныеПоля Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТ.КолонкаФайла) Тогда
			
			Если СтрокаТ.РеквизитСправочника = "ФИО" ИЛИ
				 СтрокаТ.РеквизитСправочника = "Фамилия" ИЛИ
				 СтрокаТ.РеквизитСправочника = "Имя" ИЛИ
				 СтрокаТ.РеквизитСправочника = "Отчество" Тогда
				 
				Если ВключатьПроверкуФИОВРезультат = Истина Тогда 
					// ВозвращаемыйМассивФИО.Добавить(СтрокаТ.РеквизитСправочника);
					ВозвращаемаяСтруктураФИО.Вставить(СтрокаТ.РеквизитСправочника, Ложь);
				КонецЕсли;
				
			Иначе
				ПредставлениеНезаполненных = "" + ПредставлениеНезаполненных + """" + СтрокаТ.РеквизитСправочника + """, "; 
				// ВозвращаемыйМассивР.Добавить(СтрокаТ.РеквизитСправочника);		 				 
			КонецЕсли;
			 			
		КонецЕсли;
		
	КонецЦикла;
	
	ПредставлениеНезаполненных = ?(ЗначениеЗаполнено(ПредставлениеНезаполненных), Сред(ПредставлениеНезаполненных, 1, СтрДлина(ПредставлениеНезаполненных) - 2), "");
	
	СтруктураВозврата = Новый Структура;
	// СтруктураВозврата.Вставить("Массив_НезаполненныеРеквизиты", ВозвращаемыйМассивР);
	СтруктураВозврата.Вставить("Строка_НезаполненныеРеквизиты", ПредставлениеНезаполненных);
	Если ВключатьПроверкуФИОВРезультат Тогда
		СтруктураВозврата.Вставить("Стр_НезаполненныеРеквизитыФИО", ВозвращаемаяСтруктураФИО);
	КонецЕсли;
	
	Возврат СтруктураВозврата; 
			
КонецФункции


////////////////////////////////////////////////////////////////////////////////////
// Дополнительные методы обработки


&НаСервере
// Функция разбивает строку на подстроки в списке
//
Функция СтрокаВСписок(Строка,Разделитель = ",")
	
	ПоследнийЭлементПуст=Ложь;
	Стр=Строка;
	Список = Новый СписокЗначений;
	ДлинаСтроки = СтрДлина(Разделитель)-1;
	Пока СтрДлина(Стр)>0 Цикл
		РазделительКоличество = Найти(Стр,Разделитель);
		Если РазделительКоличество > 0 Тогда
			ВрСтр = СокрЛП(Лев(Стр, РазделительКоличество - 1));
			Стр = СокрЛП(Прав(Стр, СтрДлина(Стр) - РазделительКоличество - ДлинаСтроки));
			Если СтрДлина(Стр)=0 Тогда
				ПоследнийЭлементПуст=Истина;
			КонецЕсли;
		Иначе
			// последняя
			ВрСтр = СокрЛП(Стр);
			Стр = "";
		КонецЕсли;
		
		Если (Лев(ВрСтр,1) = """") И (Прав(ВрСтр,1) = """") Тогда
			ВрСтр = Сред(ВрСтр,2,СтрДлина(ВрСтр)-2);
		КонецЕсли;
		
		Список.Добавить(ВрСтр);
	КонецЦикла;
	
	Если ПоследнийЭлементПуст Тогда
		Список.Добавить("");
	КонецЕсли;	  
	
	Возврат(Список)
КонецФункции

&НаСервере
// Функция приводит текстовый формат представления даты к типу дата, поддерживаемые маски ####.##.##., ##.##.####
//
Функция ПривестиКТипуДата(СтрПредст)
	
	Если СтрДлина(СтрПредст) < 8 Тогда
		Возврат Неопределено;	
	КонецЕсли;	
	Попытка 
		
		СписокЗн = СтрокаВСписок(СтрПредст,".");
		
		Если СписокЗн.Количество() = 0 Тогда
			Возврат Неопределено;
		Иначе
			
			Если СтрДлина(СписокЗн[0]) > 2 Тогда
				Возврат Дата(СписокЗн[0] + Формат(СписокЗн[1], "ЧЦ=2; ЧВН=") + Формат(СписокЗн[2], "ЧЦ=2; ЧВН="));
			Иначе
				Возврат Дата(Формат(СписокЗн[2], "ЧЦ=2; ЧВН=") + Формат(СписокЗн[1], "ЧЦ=2; ЧВН=") + СписокЗн[0]);
			КонецЕсли;
		КонецЕсли;	
	Исключение
		Возврат Неопределено;
	КонецПопытки;	  
	
КонецФункции	

// Функция ищет значение перечисления по передеанной строке(поддержка поиска по подстрокам)
//
&НаСервере
Функция ПолучитьТипПол(СтрПредст,ПеречислениеОбъект)
	
	СтрПредст=СтрЗаменить(СтрПредст,".","");
	Индекс=0;
	Пока Индекс<ПеречислениеОбъект.Количество() Цикл
		
		Зн=Формат(ПеречислениеОбъект[Индекс]);
		Если Найти(НРег(Зн),НРег(СтрПредст))<>0 Тогда
			Возврат ПеречислениеОбъект[Индекс];
		КонецЕсли;	
		
		Индекс=Индекс+1;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции	  

&НаСервере
// Функция возвращает Истина, если в строке содержится только число
// и Ложь, если это не так
//
Функция ПроверитьСтрокуНаЧисло(НашаСтрока)
	
	Если СтрДлина(СокрЛП(НашаСтрока)) <> 0 Тогда 
		ЕстьЦифры = Ложь;
		ЕстьБуквы = Ложь;
		Для К = 1 По СтрДлина(СокрЛП(НашаСтрока)) Цикл 
			Если Найти("0123456789", Сред(НашаСтрока, К, 1)) <> 0 Тогда 
				ЕстьЦифры = Истина;
			Иначе 
				ЕстьБуквы = Истина;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;		
	
	Если ЕстьЦифры И ЕстьБуквы Тогда 
		Возврат Ложь;
	ИначеЕсли ЕстьЦифры И НЕ ЕстьБуквы Тогда 
		Возврат Истина;
	ИначеЕсли НЕ ЕстьЦифры И ЕстьБуквы Тогда 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Функция - Заполнить структуру телефонного номера
//
Функция ЗаполнитьСтруктуруТелефонногоНомера(Телефон, СписокПолей)
	
	СтруктураТелефонногоНомера = Новый Структура;
	СтруктураТелефонногоНомера.Вставить("Представление");
	СтруктураТелефонногоНомера.Вставить("ЗначенияПолей");
	СтруктураТелефонногоНомера.Вставить("НомерТелефона");
	СтруктураТелефонногоНомера.Вставить("НомерТелефонаБезКодов");
	
	Для Каждого ЭлементСписка Из СписокПолей Цикл 
		Если ЭлементСписка.Представление = "КодСтраны" Тогда 
			ЗначенияПолейКодСтраны = ?(ЗначениеЗаполнено(ЭлементСписка.Значение), ЭлементСписка.Представление + "=" + Строка(ЭлементСписка.Значение), "");
			КодСтраны = Строка(ЭлементСписка.Значение); 
		КонецЕсли;
		Если ЭлементСписка.Представление = "КодГорода" Тогда 
			ЗначенияПолейКодГорода = ?(ЗначениеЗаполнено(ЭлементСписка.Значение), ЭлементСписка.Представление + "=" + Строка(ЭлементСписка.Значение), "");
			КодГорода = Строка(ЭлементСписка.Значение);
		КонецЕсли;
		Если ЭлементСписка.Представление = "НомерТелефона" Тогда
			ЗначенияПолейНомерТелефона = ?(ЗначениеЗаполнено(ЭлементСписка.Значение), ЭлементСписка.Представление + "=" + Строка(ЭлементСписка.Значение), "");
			НомерТелефона = Строка(ЭлементСписка.Значение);
		КонецЕсли;
		Если ЭлементСписка.Представление = "Добавочный" Тогда
			ЗначенияПолейДобавочный = ?(ЗначениеЗаполнено(ЭлементСписка.Значение), ЭлементСписка.Представление + "=" + Строка(ЭлементСписка.Значение), "");
		КонецЕсли;	
		Если ЭлементСписка.Представление = "Комментарий" Тогда
			ЗначенияПолейКомментарий = ?(ЗначениеЗаполнено(ЭлементСписка.Значение), ЭлементСписка.Представление + "=" + Строка(ЭлементСписка.Значение), "");
		КонецЕсли;	
		
	КонецЦикла;
	
	СтруктураТелефонногоНомера.Представление 			= ""+Телефон;	
	СтруктураТелефонногоНомера.ЗначенияПолей 			= ""+ЗначенияПолейКодСтраны + Символы.ПС + ЗначенияПолейКодГорода + Символы.ПС + ЗначенияПолейНомерТелефона + Символы.ПС + ЗначенияПолейДобавочный + Символы.ПС + ЗначенияПолейКомментарий;
	СтруктураТелефонногоНомера.НомерТелефона 			= ""+КодСтраны + КодГорода + НомерТелефона;
	СтруктураТелефонногоНомера.НомерТелефонаБезКодов 	= ""+НомерТелефона;
	
	Возврат СтруктураТелефонногоНомера;
	
КонецФункции

&НаСервере
// Функция - Сравнить телефоны
//
Функция СравнитьТелефоны(Телефон1, Телефон2) 
	
	Телефон1 = СокрЛП(Телефон1);	
	Телефон2 = СокрЛП(Телефон2);	
	
	ПозицияЗапятой1 = Найти(Телефон1, ",");
	ПозицияЗапятой2 = Найти(Телефон2, ",");
	
	Если ПозицияЗапятой1 <> 0 Тогда 
		Телефон1 = Лев(Телефон1, ПозицияЗапятой1);
	КонецЕсли;
	
	Если ПозицияЗапятой2 <> 0 Тогда 
		Телефон2 = Лев(Телефон2, ПозицияЗапятой2);
	КонецЕсли;
	
	НомерТелефона1_ТолькоЦифры = ВернутьТелефонТолькоЦифрами(Телефон1);
	НомерТелефона2_ТолькоЦифры = ВернутьТелефонТолькоЦифрами(Телефон2);
	
	
	Если ?(Константы.СтранаУчета.Получить().Пустая(), 0, Константы.СтранаУчета.Получить().Код) = "804" Тогда 
		Если СтрДлина(НомерТелефона1_ТолькоЦифры) = 11 Тогда
			Если Сред(НомерТелефона1_ТолькоЦифры, 2, 1) = "0" Тогда 
				НомерТелефона1_ТолькоЦифры = Сред(НомерТелефона1_ТолькоЦифры, 2, 10);
			КонецЕсли;
		ИначеЕсли СтрДлина(НомерТелефона1_ТолькоЦифры) = 12 Тогда
			Если Сред(НомерТелефона1_ТолькоЦифры, 1, 2) = "38" Тогда 
				НомерТелефона1_ТолькоЦифры = Сред(НомерТелефона1_ТолькоЦифры, 3, 10);
			КонецЕсли;	
		КонецЕсли;		
		Если СтрДлина(НомерТелефона2_ТолькоЦифры) = 11 Тогда
			Если Сред(НомерТелефона2_ТолькоЦифры, 2, 1) = "0" Тогда 
				НомерТелефона2_ТолькоЦифры = Сред(НомерТелефона2_ТолькоЦифры, 2, 10);
			КонецЕсли;
		ИначеЕсли СтрДлина(НомерТелефона2_ТолькоЦифры) = 12 Тогда
			Если Сред(НомерТелефона2_ТолькоЦифры, 1, 2) = "38" Тогда 
				НомерТелефона2_ТолькоЦифры = Сред(НомерТелефона2_ТолькоЦифры, 3, 10);
			КонецЕсли;	
		КонецЕсли;		
	Иначе 	
		Если СтрДлина(НомерТелефона1_ТолькоЦифры) = 11 Тогда
			Если Лев(НомерТелефона1_ТолькоЦифры, 1) = "7" ИЛИ Лев(НомерТелефона1_ТолькоЦифры, 1) = "8" Тогда 
				НомерТелефона1_ТолькоЦифры = Сред(НомерТелефона1_ТолькоЦифры, 2, 10);
			КонецЕсли;		
		КонецЕсли;
		Если СтрДлина(НомерТелефона2_ТолькоЦифры) = 11 Тогда
			Если Лев(НомерТелефона2_ТолькоЦифры, 1) = "7" ИЛИ Лев(НомерТелефона2_ТолькоЦифры, 1) = "8" Тогда 
				НомерТелефона2_ТолькоЦифры = Сред(НомерТелефона2_ТолькоЦифры, 2, 10);
			КонецЕсли;		
		КонецЕсли;		
	КонецЕсли;
	
	Если НомерТелефона1_ТолькоЦифры = НомерТелефона2_ТолькоЦифры Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
// Функция - Вернуть телефон только цифрами
//
Функция ВернутьТелефонТолькоЦифрами(Строка) 
	
  СтрокаЧисел = "";

   Для Индекс = 1 По СтрДлина(Строка) Цикл
   
      Символ = Сред(Строка, Индекс, 1); // Перебираем все сиволы из нашей строки

      Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда // Код нуля - 48, код 9-ки - 57
         СтрокаЧисел = СтрокаЧисел + Символ;
      КонецЕсли;
   
   КонецЦикла;

   Возврат СтрокаЧисел;	
	
	
КонецФункции

// Функция - Получить структуру XDTO телефона
//
// Параметры:
//  Телефон	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтруктуру_XDTO(Представление, ТипКИ)
	
	Если НЕ ЗначениеЗаполнено(Представление) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Объект_XDTO = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOПоПредставлению(Представление, ТипКИ);
	Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда 
		Если НЕ ЗначениеЗаполнено(Объект_XDTO.Состав.Номер) Тогда 
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Объект_XDTO;
	
КонецФункции

// Процедура - Заполнить телефон 
//
// Параметры:
//  НовыйЭлемент		 - 	 - 
//  Объект_XDTO_Телефон	 - 	 - 
//
Процедура ЗаполнитьТелефон(НовыйЭлемент, Знач Объект_XDTO_Телефон, Знач ВидКИ)
	
	Если Объект_XDTO_Телефон = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	НоваяСтрока 						= НовыйЭлемент.КонтактнаяИнформация.Добавить();
	НоваяСтрока.Тип 					= Перечисления.ТипыКонтактнойИнформации.Телефон;
	НоваяСтрока.Вид 					= ВидКИ;
	НоваяСтрока.НомерТелефона 			= СокрЛП(Объект_XDTO_Телефон.Состав.КодСтраны) + СокрЛП(Объект_XDTO_Телефон.Состав.КодГорода) + СокрЛП(Объект_XDTO_Телефон.Состав.Номер);
	НоваяСтрока.НомерТелефонаБезКодов 	= Объект_XDTO_Телефон.Состав.Номер;
	
	НоваяСтрока.ЗначенияПолей 			= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияXMLПоПредставлению(Объект_XDTO_Телефон.Представление,ВидКИ);
	НоваяСтрока.Значение 				= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Объект_XDTO_Телефон.Представление, ВидКИ);

	НоваяСтрока.Представление			= Объект_XDTO_Телефон.Представление;
	// НоваяСтрока.ЗначенияПолей			= УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(Объект_XDTO_Телефон);
	
КонецПроцедуры

// Процедура - Заполнить email 
//
// Параметры:
//  НовыйЭлемент		 - 	 - 
//  Объект_XDTO_Email	 - 	 - 
//
Процедура ЗаполнитьEmail(НовыйЭлемент, Знач Объект_XDTO_Email, Знач ВидКИ)
	
	Если Объект_XDTO_Email = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	НоваяСтрока 				= НовыйЭлемент.КонтактнаяИнформация.Добавить();
	НоваяСтрока.Тип 			= Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	НоваяСтрока.Вид 			= ВидКИ;
	НоваяСтрока.АдресЭП 		= Объект_XDTO_Email.Представление;
	НоваяСтрока.ЗначенияПолей 	= УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(Объект_XDTO_Email);
	НоваяСтрока.Значение 		= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Объект_XDTO_Email.Представление, ВидКИ);
	НоваяСтрока.Представление 	= НоваяСтрока.АдресЭП;
	
КонецПроцедуры

// Процедура - Заполнить адрес
//
// Параметры:
//  НовыйЭлемент		 - 	 - 
//  Объект_XDTO_Адрес	 - 	 - 
//  ВидКИ				 - 	 - 
//
Процедура ЗаполнитьАдрес(НовыйЭлемент, Знач Объект_XDTO_Адрес, Знач ВидКИ)
	
	Если Объект_XDTO_Адрес = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	НоваяСтрока 				= НовыйЭлемент.КонтактнаяИнформация.Добавить();
	НоваяСтрока.Тип 			= Перечисления.ТипыКонтактнойИнформации.Адрес;
	НоваяСтрока.Вид 			= ВидКИ;
	НоваяСтрока.Страна 			= ?(Объект_XDTO_Адрес.Состав.Страна = Неопределено, "", Объект_XDTO_Адрес.Состав.Страна);
	НоваяСтрока.Регион 			= ?(Объект_XDTO_Адрес.Состав.Состав.СубъектРФ = Неопределено, "", Объект_XDTO_Адрес.Состав.Состав.СубъектРФ);
	НоваяСтрока.Город 			= ?(Объект_XDTO_Адрес.Состав.Состав.Город = Неопределено, "", Объект_XDTO_Адрес.Состав.Состав.Город);
	НоваяСтрока.ЗначенияПолей 	= УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(Объект_XDTO_Адрес);
	НоваяСтрока.Значение 		= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Объект_XDTO_Адрес.Представление, ВидКИ);
	НоваяСтрока.Представление 	= Объект_XDTO_Адрес.Представление;
	
КонецПроцедуры


