
#Область ОбработчикиСобытий

&НаКлиенте
// Процедура, обработчик команды объекта.
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("ГруппаОнлайнЗаписи", ПараметрКоманды);
	ОткрытьФорму("Справочник.ГруппыОнлайнЗаписи.Форма.ФормаУслугиСотрудника", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);	

КонецПроцедуры

#КонецОбласти