
#Область ОбработчикиСобытийФормы

&НаКлиенте
// Процедура, обарботчик события на сервере
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьСписок");
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыбЦвет = "#efefef";
	Если ЗначениеЗаполнено(Объект.Цвет) Тогда
		Элементы.КнопкаЦвет.ЦветФона = ОбщегоназначенияКлиентСерверСтоматология.ПолучитьЦветRGB(Объект.Цвет);
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();

КонецПроцедуры

&НаКлиенте
// Процедура, обаработчик события "ПриОткрытии"
//
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда
		ЭтоВебКлиент = Истина;
	#Иначе
		ЭтоВебКлиент = Ложь;
	#КонецЕсли
	
	ПолеHTML = ПолучитьШапкуСтраницы();
	СформироватьКнопки();
	ПолеHTML = ПолеHTML + ПолучитьПодвалСтраницы();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Функция, возвращает HTML документ
//
Функция ПолучитьШапкуСтраницы()
	
	Если ЭтоВебКлиент Тогда
		Адрес = "e1cib/helpservice/topics/v8config/v8cfgHelp/"; 
	Иначе
		Адрес = "../../";
	КонецЕсли;
	//| .bt{color: #FCFCFC; height: 52px; width: 100%;	border-collapse: collapse; cursor: pointer;	background: #000000;}
	
	Текст = "<!DOCTYPE html PUBLIC '-//W3C//DTD XHTML 1.0 Transitional//EN' 'http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd'>
	|<html xmlns='http://www.w3.org/1999/xhtml'>
	|<meta content='text/html; charset=utf-8' http-equiv='Content-Type'></meta><link rel='stylesheet' type='text/css' href='__STYLE__'></link><meta name='GENERATOR' content='MSHTML 8.00.6001.18702'></meta><base href='v8config://v8cfgHelp/mdobject/id8d74233b-feb6-4170-918c-dfe5689c9b14/8eb4fad1-1fa6-403e-970f-2c12dbb43e23'></base>
	|<head>
	|    <title></title> 
	|<style type = 'text/css' >
	| .TableBody {height: auto; width: 100%; table-layout: fixed; margin: 22px 0px 0px 0px;}
	| .td {width: 16%; height: 52px;} 
	| .bt{color: #000000; height: 52px; width: 100%;	border-collapse: collapse; cursor: pointer;	background: #000000;}
	| .Left   { max-height: 52px; width: 3px;  background-image: url('"+Адрес+"mdpicture/id60a61f70-b632-49ea-af4f-1ea378b970d7/00000000-0000-0000-0000-000000000000'); background-position: left;}
	| .Center1{ max-height: 52px; width: 40px; background-image: url('"+Адрес+"mdpicture/id82d5f69e-ce56-48e6-aa13-995033d1a42d/00000000-0000-0000-0000-000000000000'); text-align: Center; background-position: Left;} 
	| .Center2{	max-height: 52px; width: auto; background-image: url('"+Адрес+"mdpicture/id82d5f69e-ce56-48e6-aa13-995033d1a42d/00000000-0000-0000-0000-000000000000'); text-align: center; background-position: Left; font-weight: bold; font-family: Arial; font-size: 11pt;}
	| .Right  {	max-height: 52px; width: 5px;  background-image: url('"+Адрес+"mdpicture/id9c81b1bf-bcd0-4988-8c3e-52dd16a8eae5/00000000-0000-0000-0000-000000000000'); background-position: right; }
	|</style></head>
	|<script type = 'text/javascript'>
    |function sf2(id) {
	|    
	|    document.getElementById('l' + id).style.background = 'url("+Адрес+"mdpicture/id60a61f70-b632-49ea-af4f-1ea378b970d7/00000000-0000-0000-0000-000000000000)';
	|    document.getElementById('c' + id).style.background = 'url("+Адрес+"mdpicture/id82d5f69e-ce56-48e6-aa13-995033d1a42d/00000000-0000-0000-0000-000000000000)';	
	|    document.getElementById('s' + id).style.background = 'url("+Адрес+"mdpicture/id82d5f69e-ce56-48e6-aa13-995033d1a42d/00000000-0000-0000-0000-000000000000)';	
	|    document.getElementById('r' + id).style.background = 'url("+Адрес+"mdpicture/id9c81b1bf-bcd0-4988-8c3e-52dd16a8eae5/00000000-0000-0000-0000-000000000000)'; 
	|    document.getElementById('r'+id).style.backgroundPosition = 'right';
	|    document.getElementById('c'+id).style.backgroundPosition = 'right';
	|    document.getElementById('s'+id).style.backgroundPosition = 'right';
	|    document.getElementById('l'+id).style.backgroundPosition = 'left';
	|}
    |function sf(id) {
	|    document.getElementById('l' + id).style.background = 'url("+Адрес+"mdpicture/ide0f6baa5-302f-49c5-8010-425ab574c7c0/00000000-0000-0000-0000-000000000000)';
	|    document.getElementById('c' + id).style.background = 'url("+Адрес+"mdpicture/idb62c36fc-487a-4823-bf85-bbcea30fae0c/00000000-0000-0000-0000-000000000000)';
	|    document.getElementById('s' + id).style.background = 'url("+Адрес+"mdpicture/idb62c36fc-487a-4823-bf85-bbcea30fae0c/00000000-0000-0000-0000-000000000000)';
	|    document.getElementById('r' + id).style.background = 'url("+Адрес+"mdpicture/idb0f2bc40-c325-4c57-8a5d-eeac02c2a7b9/00000000-0000-0000-0000-000000000000)'; 
	|    document.getElementById('r'+id).style.backgroundPosition = 'right';
	|    document.getElementById('c'+id).style.backgroundPosition = 'right';
	|    document.getElementById('s'+id).style.backgroundPosition = 'right';
	|    document.getElementById('l'+id).style.backgroundPosition = 'left';
    |}
	|</script>
	|<body style='OVERFLOW: auto;' bgColor=#fcfaeb onselectstart='return false'>
	|<table class = 'TableBody'>
	|<tr>"; 
	
	Возврат Текст;
	       
КонецФункции

&НаСервере
Функция ПолучитьПодвалСтраницы()
	
	Текст = "</table>
	|</body>
	|</html>";
	Возврат Текст;	
	
КонецФункции

&НаСервере
// Процедура, формирует кнопки HTML
//
Процедура СформироватьКнопки()
	Счетчик = 0;	
	Если ЭтоВебКлиент Тогда
		Адрес = "e1cib/helpservice/topics/v8config/v8cfgHelp/"; 
	Иначе
		Адрес = "../../";
	КонецЕсли;
	МассивЦветов = СоздатьПалитру();
	Для каждого СтрокаТЧ из МассивЦветов Цикл
		Если Счетчик = 8 Тогда
			Счетчик = 0;
			ПолеHTML = ПолеHTML + "</tr>" + Символы.ПС + "<tr>";			
		КонецЕсли;
		ПолеHTML = ПолеHTML + "<td><table class = 'bt'   onmousedown = sf('"+СтрокаТЧ+"') onmouseup = sf2('"+СтрокаТЧ+"') Style = 'BackGround-Color: "+СтрокаТЧ+"' >
		|<tr>
		|<td id = 'l"+СтрокаТЧ+"' class = 'Left'></td>
		|<td id = 'c"+СтрокаТЧ+"' class = 'Center1'></td>
		|<td id = 's"+СтрокаТЧ+"' class = 'Center2'></td>

		//|<td id = 'c"+СтрокаТЧ+"' class = 'Center1'><IMG border=0 align = top src = '"+Адрес+Картинка+"'/></td>
		//|<td id = 's"+СтрокаТЧ+"' class = 'Ctnter2'>"+ЭтаФорма.Надпись+"</td>
		|<td id = 'r"+СтрокаТЧ+"' class = 'Right'></td>
		|</tr>
		|</table></td>";		
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
// Функция, выполняет создание палитры цветов
//
Функция СоздатьПалитру()
	
	Массив = Новый Массив;
	Массив.Добавить("#cc0117");// 1 ряд
	Массив.Добавить("#84000e");
	Массив.Добавить("#ce0067");
	Массив.Добавить("#8b0044");
	Массив.Добавить("#c501cd");//
	Массив.Добавить("#89018f");
	Массив.Добавить("#5913cd");
	Массив.Добавить("#3f0d90");
	Массив.Добавить("#d52438");// 2 ряд
	Массив.Добавить("#980c19");
	Массив.Добавить("#d5217c");
	Массив.Добавить("#970c50");
	Массив.Добавить("#cd20d4");//
	Массив.Добавить("#900994");
	Массив.Добавить("#6d2ed2");
	Массив.Добавить("#461a93");
    Массив.Добавить("#e26875");// 3 ряд
	Массив.Добавить("#b34d5a");
	Массив.Добавить("#d5217c");
	Массив.Добавить("#b14d7f");
	Массив.Добавить("#dc5fe1");//
	Массив.Добавить("#b355b5");
	Массив.Добавить("#976cdf");
	Массив.Добавить("#805db7");
	Массив.Добавить("#eea9ae");// 4 ряд
	Массив.Добавить("#cd8c93");
	Массив.Добавить("#f3b8d6");
	Массив.Добавить("#d596b5");
	Массив.Добавить("#eeb0f2");//
	Массив.Добавить("#ce90d3");
	Массив.Добавить("#d1b1f0");
	Массив.Добавить("#b292d1");
	Массив.Добавить("#feecec");// 5 ряд
	Массив.Добавить("#eacedd");
	Массив.Добавить("#fce8f1");
	Массив.Добавить("#e6c7d7");
	Массив.Добавить("#f9e6fa");//
	Массив.Добавить("#e3c1e2");
	Массив.Добавить("#f1e5fb");
	Массив.Добавить("#d9cce6");
	
	Массив.Добавить("#02775d");// 6 ряд
	Массив.Добавить("#015440");
	Массив.Добавить("#1674d4");
	Массив.Добавить("#0e4f91");
	Массив.Добавить("#013ad1");//
	Массив.Добавить("#002892");
	Массив.Добавить("#47468a");
	Массив.Добавить("#323061");
    Массив.Добавить("#1b856e");// 7 ряд
	Массив.Добавить("#0c5b48");
	Массив.Добавить("#3283d4");
	Массив.Добавить("#1c5a97");
	Массив.Добавить("#1e4fd2");//
	Массив.Добавить("#13369a");
	Массив.Добавить("#5d5d99");
	Массив.Добавить("#383763");
	Массив.Добавить("#61a898");// 8 ряд
	Массив.Добавить("#518b7d");
	Массив.Добавить("#6fa7e2");
	Массив.Добавить("#5685b3");
	Массив.Добавить("#5f82e0");//
	Массив.Добавить("#4d67b1");
	Массив.Добавить("#8c8bb7");
	Массив.Добавить("#747496");
	Массив.Добавить("#b3d6cf");// 9 ряд
	Массив.Добавить("#90b3ad");
	Массив.Добавить("#abcdf2");
	Массив.Добавить("#97b5d1");
	Массив.Добавить("#a7bbee");//
	Массив.Добавить("#8b9bcc");
	Массив.Добавить("#c7c8dd");
	Массив.Добавить("#a5a6bb");
	Массив.Добавить("#deedea");// 10 ряд
	Массив.Добавить("#cfdedb");
	Массив.Добавить("#e6f0fa");
	Массив.Добавить("#d0daea");
	Массив.Добавить("#e7eafb");//
	Массив.Добавить("#d3d8eb");
	Массив.Добавить("#e5e5ef");
	Массив.Добавить("#d6d6de");
	
	Массив.Добавить("#008d01");// 11 ряд
	Массив.Добавить("#005f01");
	Массив.Добавить("#74ba00");
	Массив.Добавить("#528400");
	Массив.Добавить("#cfce00");//
	Массив.Добавить("#8e9000");
	Массив.Добавить("#c89601");
	Массив.Добавить("#866400");
	Массив.Добавить("#229c23");// 12 ряд
	Массив.Добавить("#106e10");
	Массив.Добавить("#85c21f");
	Массив.Добавить("#5d8b0f");
	Массив.Добавить("#d3d31b");//
	Массив.Добавить("#949509");
	Массив.Добавить("#cda21f");
	Массив.Добавить("#8c6b0a");
	Массив.Добавить("#5cb65c");// 13 ряд
	Массив.Добавить("#4b934a");
	Массив.Добавить("#a9d460");
	Массив.Добавить("#87aa4e");
	Массив.Добавить("#e1e15d");//
	Массив.Добавить("#b1b24c");
	Массив.Добавить("#dbbc5f");
	Массив.Добавить("#b09850");
	Массив.Добавить("#aedeac");// 14 ряд
	Массив.Добавить("#87b986");
	Массив.Добавить("#d0eba6");
	Массив.Добавить("#b1c98d");
	Массив.Добавить("#f2f195");//
	Массив.Добавить("#cecf8d");
	Массив.Добавить("#f3dfa9");
	Массив.Добавить("#ccbc8b");
	Массив.Добавить("#dff2df");// 15 ряд
	Массив.Добавить("#c6dcc7");
	Массив.Добавить("#eaf5d5");
	Массив.Добавить("#d5e0c0");
	Массив.Добавить("#faf9e4");//
	Массив.Добавить("#e5e4c5");
	Массив.Добавить("#f9f2df");
	Массив.Добавить("#dfd7c0");
	
	Массив.Добавить("#676767");// 16 ряд
	Массив.Добавить("#272727");
	Массив.Добавить("#673301");
	Массив.Добавить("#472300");
	Массив.Добавить("#cd3d00");//
	Массив.Добавить("#8f2a00");
	Массив.Добавить("#d26900");
	Массив.Добавить("#904800");
	Массив.Добавить("#838383");// 17 ряд
	Массив.Добавить("#515151");
	Массив.Добавить("#7c5023");
	Массив.Добавить("#583716");
	Массив.Добавить("#d0521f");//
	Массив.Добавить("#96330a");
	Массив.Добавить("#d57a21");
	Массив.Добавить("#944e08");
	Массив.Добавить("#a9a9a9");// 18 ряд
	Массив.Добавить("#787878");
	Массив.Добавить("#a18265");
	Массив.Добавить("#866e56");
	Массив.Добавить("#dd8561");//
	Массив.Добавить("#b57053");
	Массив.Добавить("#e1a05e");
	Массив.Добавить("#b88452");
	Массив.Добавить("#dcdcdc");// 19 ряд
	Массив.Добавить("#9d9d9d");
	Массив.Добавить("#cbb9a5");
	Массив.Добавить("#a3907f");
	Массив.Добавить("#f2bba6");//
	Массив.Добавить("#cf9f8a");
	Массив.Добавить("#f4caa2");
	Массив.Добавить("#caa078");
	Массив.Добавить("#f7f7f7");// 20 ряд
	Массив.Добавить("#dddddd");
	Массив.Добавить("#efe8e2");
	Массив.Добавить("#dbd4cc");
	Массив.Добавить("#fbe8e2");//
	Массив.Добавить("#dfcbc2");
	Массив.Добавить("#f9ecdc");
	Массив.Добавить("#e4d2c4");	
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик события "ПриНажатии"
//
Процедура ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеСобытия.Element.id) Тогда
		ВыбЦвет = Сред(ДанныеСобытия.Element.id, 2, 100);	
		Элементы.КнопкаЦвет.ЦветФона = ОбщегоназначенияКлиентСерверСтоматология.ПолучитьЦветRGB(ВыбЦвет);         
		Объект.Цвет = ВыбЦвет;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Ерунда
//
Процедура ИзменитьЦвет(Команда)
	
	К1Б5С7 = "Секретная шифровка";	
	
КонецПроцедуры 

#КонецОбласти