

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДатаВремя"		, ВыбранноеВремя);
	Параметры.Свойство("ШагМинут"		, ШагМинут);
	Если Параметры.Свойство("МассивПериодов") Тогда
		Если ТипЗнч(Параметры.МассивПериодов) = Тип("Массив") Тогда 
			КоллекцияПериодов.ЗагрузитьЗначения(Параметры.МассивПериодов);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВыбранноеВремя) Тогда 
		ВыбранноеВремя = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ШагМинут) Тогда 
		ШагМинут = 1;
	ИначеЕсли ШагМинут > 30 Тогда 
		ШагМинут = 30;
	КонецЕсли;
	
	СформироватьСоседниеЗначенияНаСервере(Истина, Истина, Истина);
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьВремя(Команда)
	
	РезультатВыбора = НачалоДня(ВыбранноеВремя) + (Час(ВремяНачалоЧас)*60*60) + (Минута(ВремяНачалоМинута)*60);
	Закрыть(РезультатВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВремяНачалоЧасПриИзменении(Элемент)
	
	СформироватьСоседниеЗначенияНаКлиенте(, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалоМинутаПриИзменении(Элемент)
	
	СформироватьСоседниеЗначенияНаКлиенте(, , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалоМинутаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВремяНачалоМинута = ВремяНачалоМинута + (60*ШагМинут)*Направление;
	СформироватьСоседниеЗначенияНаКлиенте(, , Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьСоседниеЗначенияНаКлиенте(ПерваяИнициализация = Ложь, Часы = Ложь, Минуты = Ложь)
	
	Если ПерваяИнициализация Тогда 
		ВремяНачалоЧас 		= ВыбранноеВремя;	
		ВремяНачалоМинута 	= ВыбранноеВремя;
	КонецЕсли;
	
	Если Часы Тогда
		// Предыдущие значения		
		ВремяНачалоЧасПред = ВремяНачалоЧас - (60*60);
		ВремяНачалоЧасПред1 = ВремяНачалоЧас - ((60*60)*2);
		// Следующие значения
		ВремяНачалоЧасСлед = ВремяНачалоЧас + (60*60);
		ВремяНачалоЧасСлед1 = ВремяНачалоЧас + ((60*60)*2);
	КонецЕсли;
	
	Если Минуты Тогда
		ЦелыхШагов = Цел(Макс(Минута(ВремяНачалоМинута), ШагМинут) / ?(Мин(Минута(ВремяНачалоМинута), ШагМинут) < 1 , ШагМинут, Мин(Минута(ВремяНачалоМинута), ШагМинут)));
		Если ЦелыхШагов <> Макс(Минута(ВремяНачалоМинута), ШагМинут) / ?(Мин(Минута(ВремяНачалоМинута), ШагМинут) < 1 , ШагМинут, Мин(Минута(ВремяНачалоМинута), ШагМинут)) Тогда 
			Если Минута(ВремяНачалоМинута) < ШагМинут Тогда 
				ВремяНачалоМинута = НачалоЧаса(ВремяНачалоМинута) + (ШагМинут*60);
			Иначе 
				РазницаМинута = Мин(((ЦелыхШагов+1)*ШагМинут) - Минута(ВремяНачалоМинута), Минута(ВремяНачалоМинута) - (ЦелыхШагов*ШагМинут));
				Если Цел(Минута(ВремяНачалоМинута + (РазницаМинута*60)) / ШагМинут) = Минута(ВремяНачалоМинута + (РазницаМинута*60)) / ШагМинут Тогда 
					ВремяНачалоМинута = ВремяНачалоМинута + (РазницаМинута*60)
				Иначе 
					ВремяНачалоМинута = ВремяНачалоМинута - (РазницаМинута*60)
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
		// Предыдущие значения
		ВремяНачалоМинутаПред = ВремяНачалоМинута - (60*ШагМинут);
		ВремяНачалоМинутаПред1 = ВремяНачалоМинута - ((60*ШагМинут)*2);
		// Следующие значения
		ВремяНачалоМинутаСлед = ВремяНачалоМинута + 60*ШагМинут;
		ВремяНачалоМинутаСлед1 = ВремяНачалоМинута + ((60*ШагМинут)*2);
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура СформироватьСоседниеЗначенияНаСервере(ПерваяИнициализация = Ложь, Часы = Ложь, Минуты = Ложь)
	
	Если ПерваяИнициализация Тогда 
		ВремяНачалоЧас 		= ВыбранноеВремя;	
		ВремяНачалоМинута 	= ВыбранноеВремя;
	КонецЕсли;
	
	Если Часы Тогда
		// Предыдущие значения		
		ВремяНачалоЧасПред = ВремяНачалоЧас - (60*60);
		ВремяНачалоЧасПред1 = ВремяНачалоЧас - ((60*60)*2);
		// Следующие значения
		ВремяНачалоЧасСлед = ВремяНачалоЧас + (60*60);
		ВремяНачалоЧасСлед1 = ВремяНачалоЧас + ((60*60)*2);
	КонецЕсли;
	
	Если Минуты Тогда
		ЦелыхШагов = Цел(Макс(Минута(ВремяНачалоМинута), ШагМинут) / ?(Мин(Минута(ВремяНачалоМинута), ШагМинут) < 1 , ШагМинут, Мин(Минута(ВремяНачалоМинута), ШагМинут)));
		Если ЦелыхШагов <> Макс(Минута(ВремяНачалоМинута), ШагМинут) / ?(Мин(Минута(ВремяНачалоМинута), ШагМинут) < 1 , ШагМинут, Мин(Минута(ВремяНачалоМинута), ШагМинут)) Тогда 
			Если Минута(ВремяНачалоМинута) < ШагМинут Тогда 
				ВремяНачалоМинута = НачалоЧаса(ВремяНачалоМинута) + (ШагМинут*60);
			Иначе 
				РазницаМинута = Мин(((ЦелыхШагов+1)*ШагМинут) - Минута(ВремяНачалоМинута), Минута(ВремяНачалоМинута) - (ЦелыхШагов*ШагМинут));
				Если Цел(Минута(ВремяНачалоМинута + (РазницаМинута*60)) / ШагМинут) = Минута(ВремяНачалоМинута + (РазницаМинута*60)) / ШагМинут Тогда 
					ВремяНачалоМинута = ВремяНачалоМинута + (РазницаМинута*60)
				Иначе 
					ВремяНачалоМинута = ВремяНачалоМинута - (РазницаМинута*60)
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
		// Предыдущие значения
		ВремяНачалоМинутаПред = ВремяНачалоМинута - (60*ШагМинут);
		ВремяНачалоМинутаПред1 = ВремяНачалоМинута - ((60*ШагМинут)*2);
		// Следующие значения
		ВремяНачалоМинутаСлед = ВремяНачалоМинута + 60*ШагМинут;
		ВремяНачалоМинутаСлед1 = ВремяНачалоМинута + ((60*ШагМинут)*2);
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти