 
 #Область ОбработчикиСобытийФормы
 
&НаСервере
// Процедура, При создании на сервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
// Процедура печати.
//
Процедура ДокументПечать(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "ПланЛечения");	
	Структура.Вставить("МассивДокументов", Элементы.Список.ВыделенныеСтроки);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораДокументаПечати", ЭтотОбъект, Структура);									
	
	ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, ТекущийЭлемент);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()
	Возврат Документы.ПланЛечения.ПолучитьСписокПечатныхФорм();	
КонецФункции

&НаКлиенте
// Процедура - Обработка выбора документа печати
//
Процедура ОбработкаВыбораДокументаПечати(Результат, Параметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если Результат.Значение = "ПФ_MXL_ГарантийныйТалон" 
		ИЛИ Результат.Значение = "ПФ_MXL_Квитанция" Тогда
		
		 Параметры.ИмяДокумента = "Прием";
		
	КонецЕсли;
	
	УправлениеПечатьюКлиентСтоматология.ОбработкаКоманды(Результат, Параметры);
	
КонецПроцедуры

#КонецОбласти

