
#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСКассами

// Функция - Получить кассы доступные для сотрудника
//
// Параметры:
//  Сотрудник	 - 	 - 
//  РабочееМесто - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКассыДоступныеДляОплаты(Кассы, РабочееМесто, ЕслиЕстьФРТоТолькоДоступные = Истина) Экспорт	
    Возврат РозничныеПродажи.ПолучитьКассыДоступныеДляОплаты(Кассы, РабочееМесто, ЕслиЕстьФРТоТолькоДоступные);	
КонецФункции

// Функция - Получить основную кассу доступную для оплаты
//
// Параметры:
//  Сотрудник	 - 	 - 
//  РабочееМесто - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьОсновнуюКассуДоступнуюДляОплаты(Сотрудник, РабочееМесто) Экспорт
	Возврат РозничныеПродажи.ПолучитьОсновнуюКассуДоступнуюДляОплаты(Сотрудник, РабочееМесто);	
КонецФункции

// Функция - Получить доступные кассы для СЕ
//
// Параметры:
//  СтруктЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДоступныеКассыСтруктурнойЕдиницы(СтруктЕдиница, Организаци = Неопределено) Экспорт
	Возврат Справочники.СтруктурныеЕдиницы.ПолучитьДоступныеКассы(СтруктЕдиница, Организаци); 	
КонецФункции

#КонецОбласти

#КонецОбласти
