 
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	КартаКлиента = Неопределено;
	КартаКлиентаМассивом = Новый Массив;
	МедицинскиеКартыКлиента = ПолучитьМедКартыКлиентаПоПриему(ПараметрКоманды);
	
	Если МедицинскиеКартыКлиента.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У клиента нет медицинской карты!");
	ИначеЕсли МедицинскиеКартыКлиента.Количество() = 1 Тогда
		КартаКлиента = МедицинскиеКартыКлиента[0];
	Иначе 
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаКомандыПечатьМедКартыЗавершение", ОбщегоНазначенияКлиент, Новый Структура("ВариантПечати", "ПечатьВкладышаКарты"));
		КартаКлиента = ОткрытьФорму("Справочник.МедицинскиеКарты.ФормаВыбора", Новый Структура("Отбор", Новый Структура("Ссылка", МедицинскиеКартыКлиента)),,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат;
	КонецЕсли;
		
	КартаКлиентаМассивом.Добавить(КартаКлиента);
	Если КартаКлиента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//КартаКлиентаМассивом = ИсключитьВидМедКарты(КартаКлиентаМассивом);
	
	//Если КартаКлиентаМассивом.Количество() > 0 Тогда
		//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.МедицинскиеКарты", "ПечатьМедКарты", КартаКлиентаМассивом, Неопределено, Новый Структура("ПечатьВкладыша", ПараметрКоманды));
	//КонецЕсли;
	
	ДопПараметрыДляПечати = Новый Структура("КартаКлиентаМассивом", КартаКлиентаМассивом); 
	ОписаниеОповещения = Новый ОписаниеОповещения("НапечататьВкладышМедКартыПослеВыбораПриемов", УправлениеПечатьюКлиентСтоматология, ДопПараметрыДляПечати);
	
	ПараметрыОткрытияФормы = Новый Структура;
	МассивПриемовНаПечать = Новый Массив;
	МассивПриемовНаПечать.Добавить(ПараметрКоманды);
	ПараметрыОткрытияФормы.Вставить("МассивДокументов", МассивПриемовНаПечать);
	ПараметрыОткрытияФормы.Вставить("Контрагент", ПолучитьПациентаПоПриему(ПараметрКоманды));
	ПараметрыОткрытияФормы.Вставить("ТолькоПроведенныеДокументы", Ложь);
	
	ОткрытьФорму("Справочник.МедицинскиеКарты.Форма.ФормаПечатиВкладышейКарт", ПараметрыОткрытияФормы,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьМедКартыКлиентаПоПриему(Прием)	
	
	Возврат Справочники.МедицинскиеКарты.ПолучитьМедКартыКлиента(Прием.Контрагент);	
	
КонецФункции

&НаСервере
Функция ПолучитьПациентаПоПриему(СсылкаНаПрием)	 
	
	Возврат СсылкаНаПрием.Контрагент;
	
КонецФункции

#КонецОбласти