
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокАктивныхПользователей = IPТелефония.ПолучитьСписокАктивныхПользователей(, Истина);	
	Если ЗначениеЗаполнено(СписокАктивныхПользователей) Тогда
		МассивТелефонныхАппаратов = СписокАктивныхПользователей.ВыгрузитьКолонку("ТелефонныйАппарат");
	Иначе
		МассивТелефонныхАппаратов = Новый Массив;	
	КонецЕсли;
			
	Список.Параметры.УстановитьЗначениеПараметра("СписокАктивныхНомеров", МассивТелефонныхАппаратов);

КонецПроцедуры

#КонецОбласти