#Область ОбработчикиСобытийФормы
Перем Значение;

&НаСервере
// Обработчик события ПриСозданииНаСервере формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Макет = Справочники.СтруктурныеЕдиницы.ПолучитьМакет("ИдентификаторРубрики");
		
	Для Х=1 по Макет.ВысотаТаблицы Цикл
		
		Ячейка1 = "R" + СтрЗаменить(Строка(Х),Символы.НПП,"")+"C1";
		Ячейка2 = "R" + СтрЗаменить(Строка(Х),Символы.НПП,"")+"C2";
		Стр = Рубрики.Добавить();
		Стр.НаименованиеРубрики		 = Макет.Область(Ячейка2).Текст;
		Стр.КодРубрики			     = Макет.Область(Ячейка1).Текст; 
	КонецЦикла;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
// Записывает значение во временное хранилище.
//
Функция ЗаписатьВХранилище(Значение)
    Возврат ПоместитьВоВременноеХранилище(Значение); 
КонецФункции

&НаКлиенте
// Процедура, обработчик события "Выбор".
//
Процедура РубрикиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Значение = Рубрики.Получить(ВыбраннаяСтрока);
	Значение = Значение.КодРубрики + "_" + Значение.НаименованиеРубрики;
	ЗаписатьВХранилище(Значение);
	Оповестить("Значение",Значение,);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры


&НаКлиенте
// Процедура, обработчик события "Очистка".
//
Процедура СтрокаПоискаОчистка(Элемент, СтандартнаяОбработка)
	
	Элементы.Рубрики.ОтборСтрок = Неопределено;

КонецПроцедуры


&НаКлиенте
// Процедура, обработчик события "АвтоПодбор".
//
Процедура СтрокаПоискаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если СтрДлина(Текст) >= 1 Тогда
		Элементы.Рубрики.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("НаименованиеРубрики", Текст));
	Иначе
		Элементы.Рубрики.ОтборСтрок = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
