   
#Область ОбработчикиСобытий   
   
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	// Вставить содержимое обработчика.
	// ПараметрыФормы = Новый Структура("", );
	// ОткрытьФорму("Документ.Событие.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Событие", "Талон", ПараметрКоманды, Неопределено, Неопределено);
КонецПроцедуры

#КонецОбласти