
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыбор()
	
	Закрыть(Элементы.НайденныеЗаписиПоИндексу.ТекущиеДанные.Код);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеВРеквизитФормы(ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище), "НайденныеЗаписиПоИндексу");
	УдалитьИзВременногоХранилища(Параметры.АдресВХранилище);
	
	НадписьОРегионеИРайоне = "" + Параметры.НайденныйРегион + ?(ЗначениеЗаполнено(Параметры.НайденныйРегион) И ЗначениеЗаполнено(Параметры.НайденныйРайон), ", ", "") + Параметры.НайденныйРайон;
	
	ЕстьОписание = Ложь;
	Для Каждого Стр Из НайденныеЗаписиПоИндексу Цикл
		Если Не ПустаяСтрока(Стр.Описание) Тогда
			ЕстьОписание = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.НайденныеЗаписиПоИндексу.ПодчиненныеЭлементы.Описание.Видимость = ЕстьОписание;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомандаЗакрытьВыполнить()
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбратьВыполнить()
	ОбработатьВыбор();
КонецПроцедуры

&НаКлиенте
Процедура НайденныеЗаписиПоИндексуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработатьВыбор();
КонецПроцедуры

#КонецОбласти