
#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
// Обработка создания формы на сервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокПлана.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	ЭтоЗаписьНаПрием = Ложь;
	ОтборСтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	Параметры.Свойство("ЭтоЗаписьНаПрием", ЭтоЗаписьНаПрием);
	Параметры.Свойство("Старт", Старт);
	Параметры.Свойство("Финиш", Финиш);
	Параметры.Свойство("Сотрудник", Сотрудник);	
	Параметры.Свойство("Помещение", Помещение);
	
	Если Параметры.Свойство("ТолькоВОчереди") Тогда 
		Параметры.Свойство("ТолькоВОчереди", 		ОтборВидОсмотра); 
		Параметры.Свойство("Сотрудник", 			ОтборСотрудник);
		Параметры.Свойство("ДатаЗапланированная", 	ОтборНачалоПериода);
		ОтборКоннецПериода = ТекущаяДатаСеанса();
	   	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "ВидОсмотра", ОтборВидОсмотра, ЗначениеЗаполнено(ОтборВидОсмотра), ВидСравненияКомпоновкиДанных.Равно);
	   	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "Сотрудник", ОтборСотрудник, ЗначениеЗаполнено(ОтборСотрудник), ВидСравненияКомпоновкиДанных.Равно);
	Иначе 	
		// Установка периода отбоора по умолчанию
		ОтборКоннецПериода      = ТекущаяДатаСеанса(); 
	КонецЕсли;  
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "СтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница, ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница), ВидСравненияКомпоновкиДанных.Равно);

	ОтборыСписковКлиентСервер.УстановитьДиапазонДатДляСписка(СписокПлана, "ДатаЗапланированная", ОтборНачалоПериода, ВернутьКонецДняДаты(ОтборКоннецПериода), Истина);
		
	//ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "ДатаЗапланированная", ОтборКоннецПериода, ЗначениеЗаполнено(ОтборКоннецПериода), ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);	
	//ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "ДатаЗапланированная", ОтборНачалоПериода, ЗначениеЗаполнено(ОтборНачалоПериода), ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	
	Элементы.СписокТелефонКонтрагента.Видимость = НЕ (ПараметрыСеанса.ТекущийПользователь.РольПользователя = Перечисления.РольПользователя.Врач);
	
КонецПроцедуры

&НаКлиенте
// Обработчик оповещений формы
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОБНОВИТЬ_СПИСОК_ПРОФОСМОТРОВ" Тогда
		Элементы.СписокПлана.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиРеквизитовОтбора

&НаКлиенте
// Обработчик изменения отбора по дате начала периода
//
Процедура ОтборНачалоПериодаПриИзменении(Элемент)	
		
	ОтборыСписковКлиентСервер.УстановитьДиапазонДатДляСписка(СписокПлана, "ДатаЗапланированная", ОтборНачалоПериода, ВернутьКонецДняДаты(ОтборКоннецПериода), Истина);
	
	//ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "ДатаЗапланированная", ОтборНачалоПериода, ЗначениеЗаполнено(ОтборНачалоПериода),ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	
КонецПроцедуры

&НаКлиенте
// Обработчик изменения отбора по дате конца периода
//
Процедура ОтборКоннецПериодаПриИзменении(Элемент)	
		
	ОтборыСписковКлиентСервер.УстановитьДиапазонДатДляСписка(СписокПлана, "ДатаЗапланированная", ОтборНачалоПериода, ВернутьКонецДняДаты(ОтборКоннецПериода), Истина);
	
	//ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "ДатаЗапланированная", ОтборКоннецПериода, ЗначениеЗаполнено(ОтборКоннецПериода),ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	
КонецПроцедуры

&НаКлиенте
// Приизменении отбора по виду осмотра
//
Процедура ОтборВидОсмотраПриИзменении(Элемент) 
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "ВидОсмотра", ОтборВидОсмотра, ЗначениеЗаполнено(ОтборВидОсмотра),ВидСравненияКомпоновкиДанных.Равно); 
	
КонецПроцедуры

&НаКлиенте
// Обработчик изменения отбора по сотруднику
//
Процедура ОтборСотрудникПриИзменении(Элемент)	
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "Сотрудник", ОтборСотрудник, ЗначениеЗаполнено(ОтборСотрудник), ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПациентПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "Контрагент", ОтборПациент, ЗначениеЗаполнено(ОтборПациент), ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаКлиенте
// Изменения отбора по структурной единице
//
Процедура ОтборСтруктурнаяЕдиницаПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "СтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница, ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница), ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция - Вернуть конец дня даты
//
Функция ВернутьКонецДняДаты(Дата)
	
	Возврат ?(ЗначениеЗаполнено(Дата), КонецДня(Дата), Дата);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСписка

&НаКлиенте
// Обработчик выбора строки в списке 
//
Процедура СписокПланаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	
	Если ЭтоЗаписьНаПрием Тогда 
		Если Элемент.ТекущиеДанные.ВидОсмотра = ПредопределенноеЗначение("Перечисление.ВидыОсмотров.ОчередьНаЗапись") Тогда 
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ДатаНачала"              , Старт);
			ПараметрыФормы.Вставить("ДатаОкончания"           , Финиш);
			ПараметрыФормы.Вставить("Контрагент"              , Элемент.ТекущиеДанные.Контрагент);
			ПараметрыФормы.Вставить("Сотрудник"               , ?(ЗначениеЗаполнено(Сотрудник), Сотрудник, Элемент.ТекущиеДанные.Сотрудник));
			ПараметрыФормы.Вставить("Помещение"               , Помещение);    
			ПараметрыФормы.Вставить("ПричинаЗаписи"           , Элемент.ТекущиеДанные.ПричинаНаправления);
			ОткрытьФорму("Документ.Событие.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);			
		КонецЕсли;
	Иначе 	
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные        = Элементы.СписокПлана.ТекущиеДанные;	
				
		ПараметрыФормы = Новый Структура; 	
		ПараметрыФормы.Вставить("Ключ", ПолучитьКлючЗаписи(ТекущиеДанные));
		
		ОткрытьФорму("РегистрСведений.Профосмотры.Форма.ФормаРедактированияЗаписиПлана", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик формы записи новго объекта
//
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ТипЗнч(НовыйОбъект.Ссылка) = Тип("ДокументСсылка.Событие") Тогда
		ЗаписьПоПланированиюОчереди(НовыйОбъект.Ссылка);
		Элементы.СписокПлана.Обновить();
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик начала удаления записи
//
Процедура СписокПланаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина; 
	
КонецПроцедуры

&НаКлиенте
// Обработчик начала добавления записи
//
Процедура СписокПланаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа) 
	
	Отказ = Истина;  
	
КонецПроцедуры

&НаКлиенте
// Обработчик начала редактирования записи
//
Процедура СписокПланаПередНачаломИзменения(Элемент, Отказ) 
	
	Отказ = Истина;  
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Процедура, Запись по планированию очереди
//
Процедура ЗаписьПоПланированиюОчереди(СобытиеСсылка)
	
	Сотрудник = ?(СобытиеСсылка.Услуги.Количество() > 0, СобытиеСсылка.Услуги[0].Сотрудник, Справочники.Сотрудники.ПустаяСсылка());
	Если НЕ Сотрудник.Пустая() Тогда 
		НоваяЗапись = РегистрыСведений.Профосмотры.СоздатьМенеджерЗаписи();
		
		НоваяЗапись.ВидОсмотра          	= Перечисления.ВидыОсмотров.ОчередьНаЗапись;
		НоваяЗапись.Период              	= ТекущаяДата(); 
		НоваяЗапись.СтруктурнаяЕдиница  	= СобытиеСсылка.СтруктурнаяЕдиница;
		НоваяЗапись.Контрагент          	= СобытиеСсылка.Контрагент;
		НоваяЗапись.Сотрудник           	= Сотрудник;
		НоваяЗапись.АвторЗаписи         	= ПараметрыСеанса.ТекущийПользователь;
		НоваяЗапись.ДатаЗапланированная 	= СобытиеСсылка.Дата;
		НоваяЗапись.Статус              	= Перечисления.СтатусыПрофосмотров.Согласился;
		НоваяЗапись.ПредварительнаяЗапись 	= СобытиеСсылка;	
		НоваяЗапись.Записать(Ложь);	
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
// Функция - Получить ключ записи.
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКлючЗаписи(ТекущиеДанные)
	
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("СтруктурнаяЕдиница"	, ТекущиеДанные.СтруктурнаяЕдиница);
	СтруктураОтбора.Вставить("Сотрудник"			, ТекущиеДанные.Сотрудник);
	СтруктураОтбора.Вставить("ВидОсмотра"			, ТекущиеДанные.ВидОсмотра);
	СтруктураОтбора.Вставить("Контрагент"			, ТекущиеДанные.Контрагент);
	СтруктураОтбора.Вставить("Период"				, ТекущиеДанные.Период);
	
	МассивСтруктураЗаписи = Новый Массив;
	МассивСтруктураЗаписи.Добавить(СтруктураОтбора);

	Возврат Новый("РегистрСведенийКлючЗаписи.Профосмотры", МассивСтруктураЗаписи); 
	
КОнецФункции

#КонецОбласти


