
#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиРегламентныхЗаданий

// Обработчик регламентного задания "ОбновлениеДанныхИЭМК"
//
Процедура ОбновлениеДанныхИЭМК() Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(,Перечисления.ТипыВнешнихСистем.ИЭМК, Истина);  
	
	Если Не ЗначениеЗаполнено(ВнешняяСистема) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВнешнейСистемы = ВнешняяСистема.Параметры.Получить();
	guid = ПараметрыВнешнейСистемы.guid;
	idLPU = ПараметрыВнешнейСистемы.idLPU;
	Демо = ПараметрыВнешнейСистемы.РаботаВРежимеДемо;
	
	Если Не ЗначениеЗаполнено(guid) Или Не ЗначениеЗаполнено(idLPU) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЖурналОбменаИЭМК.Объект КАК Объект,
	|	ЖурналОбменаИЭМК.ОтветИЭМК КАК ОтветИЭМК,
	|	ЖурналОбменаИЭМК.КодОтвета КАК КодОтвета,
	|	ЖурналОбменаИЭМК.УидВИЭМК КАК УидВИЭМК,
	|	ЖурналОбменаИЭМК.УИД КАК УИД,
	|	ЖурналОбменаИЭМК.КоличествоПопыток КАК КоличествоПопыток,
	|	ЖурналОбменаИЭМК.ДатаОтправки КАК ДатаОтправки
	|ИЗ
	|	РегистрСведений.ЖурналОбменаИЭМК КАК ЖурналОбменаИЭМК
	|ГДЕ
	|	ЖурналОбменаИЭМК.КодОтвета <> 200
	|   И ЖурналОбменаИЭМК.КоличествоПопыток < 3";
	
	Результат = Запрос.Выполнить().Выбрать();	
	
	Пока Результат.Следующий() Цикл
		
		Если ТипЗнч(Результат.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
			СоздатьПациентаВИЭМК(Результат.Объект, guid, idLPU, Результат.КоличествоПопыток, Результат.УидВИЭМК, Демо)
		Иначе 
			СоздатьПриемВИЭМК(Результат.Объект, guid, idLPU, Результат.КоличествоПопыток, Результат.УидВИЭМК, Демо)	
		КонецЕсли;
		
	КонецЦикла;
	

КонецПроцедуры        

#КонецОбласти 

// Процедура - создает карточку пациента в ИЭМК.
//
Процедура СоздатьПациентаВИЭМК(КонтрАгентДляОтправки, guid, idLPU, КоличествоПопыток = Неопределено, УидВИЭМК, Демо) Экспорт
	
	// Если ПроверятьПациента Тогда 
	//	УИДПациентаВИЭМК = ПроверитьПациентаИЭМК(КонтрАгентДляОтправки, guid, idLPU);
	// Иначе
	//	УИДПациентаВИЭМК = "";
	// КонецЕсли;
	//
	Если КоличествоПопыток = Неопределено Тогда 
		КоличествоПопыток = 0;
	КонецЕсли;  
	
	КоличествоПопытокПодключения = КоличествоПопыток + 1;
	// 
	// Если Лев(УИДПациентаВИЭМК, 6) = "Ошибка" Тогда
	//	РегистрыСведений.ЖурналОбменаИЭМК.ДобавитьЗапись(КонтрАгентДляОтправки, "404", УИДПациентаВИЭМК, "",Строка(КонтрАгентДляОтправки.УникальныйИдентификатор()),КоличествоПопытокПодключения, ТекущаяДатаСеанса());
	//	Возврат	
	// КонецЕсли;
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		ЧасовойПоясОД = Константы.ЧасовойПоясОбластиДанных.Получить();
		ЧасовойПоясБазы = "+" + Формат(СмещениеСтандартногоВремени(ЧасовойПоясОД)/60/60, "ЧЦ=2; ЧВН=; ЧГ=")+":00";
	Иначе
		ЧасовойПоясБазы = "+" + Формат(СмещениеСтандартногоВремени(ЧасовойПояс())/60/60, "ЧЦ=2; ЧВН=; ЧГ=")+":00";
	КонецЕсли;

	ПутьКФайлу = ПолучитьИмяВременногоФайла("xml");
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	
	Если ЗначениеЗаполнено(УидВИЭМК) Тогда
		Запись.ЗаписатьНачалоЭлемента("tem:UpdatePatient");
	Иначе
	    Запись.ЗаписатьНачалоЭлемента("tem:AddPatient");
	КонецЕсли;
	
		Запись.ЗаписатьНачалоЭлемента("tem:guid");
		Запись.ЗаписатьТекст(guid);
		Запись.ЗаписатьКонецЭлемента();
	
		Запись.ЗаписатьНачалоЭлемента("tem:idLPU");
		Запись.ЗаписатьТекст(idLPU);
		Запись.ЗаписатьКонецЭлемента();
	
		Запись.ЗаписатьНачалоЭлемента("tem:patient");
			///////////////////////////////////////////////////// Адрес пациента //////////////////////////////////////////////////////////	
			МассивАдресов = КонтрАгентДляОтправки.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
			Если МассивАдресов.Количество() > 0 Тогда
				
				ДанныеАдреса = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(МассивАдресов[0].ЗначенияПолей, Перечисления.ТипыКонтактнойИнформации.Адрес);
				
				Если НЕ ДанныеАдреса.addressType = "ВСвободнойФорме" Тогда
					Запись.ЗаписатьНачалоЭлемента("emk:Addresses");
					Запись.ЗаписатьНачалоЭлемента("emk:AddressDto");
					
					АдресСписокЗначений = РаботаСАдресами.АдресВФорматеКЛАДР(МассивАдресов[0].ЗначенияПолей);                    
					Если АдресСписокЗначений.Свойство("Квартира") И ЗначениеЗаполнено(АдресСписокЗначений.Квартира) Тогда        
						Запись.ЗаписатьНачалоЭлемента("emk:Appartment");
						Запись.ЗаписатьТекст(АдресСписокЗначений.Квартира);     
						Запись.ЗаписатьКонецЭлемента();
					КонецЕсли;
					
					Если АдресСписокЗначений.Свойство("Дом") И ЗначениеЗаполнено(АдресСписокЗначений.Дом) Тогда        
						Запись.ЗаписатьНачалоЭлемента("emk:Building");
						Запись.ЗаписатьТекст(АдресСписокЗначений.Дом);     
						Запись.ЗаписатьКонецЭлемента();
					КонецЕсли;
					
					АдераВСтруктуре = РаботаСАдресами.КонтактнаяИнформацияВСтруктуруJSON(МассивАдресов[0].ЗначенияПолей); 
					// АдресВXML = АдресныйКлассификаторСлужебный.КодыАдресаИКодыКЛАДР(АдераВСтруктуре);
					// Если АдераВСтруктуре.area = "Москва" Тогда
					//	АдресВXML.КодыКЛАДР.Город = "7700000000000";
					// ИначеЕсли АдераВСтруктуре.area = "Санкт-Петербург" Тогда
					//	АдресВXML.КодыКЛАДР.Город = "7800000000000";
					// ИначеЕсли АдераВСтруктуре.area = "Севастополь" Тогда
					//	АдресВXML.КодыКЛАДР.Город = "9200000000000";
					// ИначеЕсли АдераВСтруктуре.area = "Байконур" Тогда
					//	АдресВXML.КодыКЛАДР.Город = "9900000000000";
					// КонецЕсли;	
					// Если АдресВXML.КодыКЛАДР.Город <> Неопределено Тогда 
					//	Запись.ЗаписатьНачалоЭлемента("emk:City");
					//	Запись.ЗаписатьТекст(АдресВXML.КодыКЛАДР.Город);
					//	Запись.ЗаписатьКонецЭлемента();
					// КонецЕсли;
					
					Город = АдераВСтруктуре.city;
					Если АдераВСтруктуре.area = "Москва" Тогда
						Город = "Москва";
					ИначеЕсли АдераВСтруктуре.area = "Санкт-Петербург" Тогда
						Город = "Санкт-Петербург";
					ИначеЕсли АдераВСтруктуре.area = "Севастополь" Тогда
						Город = "Севастополь";
					ИначеЕсли АдераВСтруктуре.area = "Байконур" Тогда
						Город = "Байконур";
					КонецЕсли;	
					Если Город <> "" Тогда 
						Запись.ЗаписатьНачалоЭлемента("emk:City");
						Запись.ЗаписатьТекст(Город);
						Запись.ЗаписатьКонецЭлемента();
					КонецЕсли;
					
					
					Запись.ЗаписатьНачалоЭлемента("emk:IdAddressType");
					Запись.ЗаписатьТекст("1");
					Запись.ЗаписатьКонецЭлемента();
					
					Если АдресСписокЗначений.Свойство("Индекс") И ЗначениеЗаполнено(АдресСписокЗначений.Индекс) Тогда        
						Запись.ЗаписатьНачалоЭлемента("emk:PostalCode");
						Запись.ЗаписатьТекст(АдресСписокЗначений.Индекс);   
						Запись.ЗаписатьКонецЭлемента();
					КонецЕсли;
					
					Если АдераВСтруктуре.street <> "" Тогда 
						Запись.ЗаписатьНачалоЭлемента("emk:Street");
						Запись.ЗаписатьТекст(АдераВСтруктуре.street);
						Запись.ЗаписатьКонецЭлемента();
					КонецЕсли;
					
					// Если АдресВXML.КодыАдреса.КодКЛАДР <> Неопределено Тогда 
					//	Запись.ЗаписатьНачалоЭлемента("emk:Street");
					//	Запись.ЗаписатьТекст(АдресВXML.КодыАдреса.КодКЛАДР);
					//	Запись.ЗаписатьКонецЭлемента();
					// КонецЕсли;
					
					Если МассивАдресов[0].Представление <> "" Тогда 
						Запись.ЗаписатьНачалоЭлемента("emk:StringAddress");
						Запись.ЗаписатьТекст(МассивАдресов[0].Представление);
						Запись.ЗаписатьКонецЭлемента();
					КонецЕсли;
					
					Запись.ЗаписатьКонецЭлемента();
					Запись.ЗаписатьКонецЭлемента(); 
				КонецЕсли;
			КонецЕсли;	
			/////////////////////////////////////////////////////////////////// Дата рождения /////////////////////////////////////////////
			Запись.ЗаписатьНачалоЭлемента("emk:BirthDate");
			Запись.ЗаписатьТекст(Формат(КонтрАгентДляОтправки.ДатаРожденияКлиента, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
			Запись.ЗаписатьКонецЭлемента();
				
			///////////////////////////////////////////////////////////////// Место рождения //////////////////////////////////////////
			// Запись.ЗаписатьНачалоЭлемента("emk:BirthPlace");
			//	
			//	Если КонтрАгентДляОтправки.МестоРождения <> "" Тогда 
			//		Запись.ЗаписатьНачалоЭлемента("emk:City");
			//		Запись.ЗаписатьТекст(КонтрАгентДляОтправки.МестоРождения);
			//		Запись.ЗаписатьКонецЭлемента();
			//	КонецЕсли;
			//		
			//	// РезультатПоиска = НайтиПоПредставлениюЭлементСписка(АдресСписокЗначений, "Страна"); // 2,0
			//	// Если РезультатПоиска <> Неопределено Тогда   // 2,0
			//	Если АдресСписокЗначений.Свойство("Страна") И ЗначениеЗаполнено(АдресСписокЗначений.Страна) Тогда        // 3,0
			//		Запись.ЗаписатьНачалоЭлемента("emk:Country");
			//		Запись.ЗаписатьТекст(АдресСписокЗначений.Страна);   // 3,0
			//		// Запись.ЗаписатьТекст(РезультатПоиска.Значение);  // 2,0
			//		Запись.ЗаписатьКонецЭлемента();
			//	КонецЕсли;
			//		
			//	// РезультатПоиска = НайтиПоПредставлениюЭлементСписка(АдресСписокЗначений, "Регион"); // 2,0
			//	// Если РезультатПоиска <> Неопределено Тогда   // 2,0
			//	Если АдресСписокЗначений.Свойство("Регион") И ЗначениеЗаполнено(АдресСписокЗначений.Регион) Тогда        // 3,0
			//		Запись.ЗаписатьНачалоЭлемента("emk:Region");
			//		Запись.ЗаписатьТекст(АдресСписокЗначений.Регион);   // 3,0
			//		// Запись.ЗаписатьТекст(РезультатПоиска.Значение);  // 2,0
			//		Запись.ЗаписатьКонецЭлемента();
			//	КонецЕсли;
			//			
			// Запись.ЗаписатьКонецЭлемента();						
			
			///////////////////////////////////////////////////// Контактное лицо /////////////////////////////////////////
			
			// РодственникиКлиента = РегистрыСведений.РодственныеСвязи.РодственникиКлиента(КонтрАгентДляОтправки);
			//
			// Если РодственникиКлиента.Количество() > 0 Тогда
			//	
			//	Для Каждого ЭлТЗ Из РодственникиКлиента Цикл
			//		Запись.ЗаписатьНачалоЭлемента("emk:ContactPerson");
			//			Запись.ЗаписатьНачалоЭлемента("emk:ContactList");
			//				
			//				МассивТелефонов = ЭлТЗ.Родственник.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
			//				Если МассивТелефонов.Количество() > 0 Тогда
			//					Для Каждого ЭлМассива Из МассивТелефонов Цикл
			//			
			//						Запись.ЗаписатьНачалоЭлемента("emk:ContactDto");

			//							Запись.ЗаписатьНачалоЭлемента("emk:ContactValue");
			//							Запись.ЗаписатьТекст(ЭлМассива.Представление);
			//							Запись.ЗаписатьКонецЭлемента();
			//			
			//							Запись.ЗаписатьНачалоЭлемента("emk:IdContactType");
			//							Запись.ЗаписатьТекст("1");
			//							Запись.ЗаписатьКонецЭлемента();
			//		
			//						Запись.ЗаписатьКонецЭлемента();
			//			
			//					КонецЦикла;
			//				КонецЕсли;
			//		
			//				МассивЭЛПочта = ЭлТЗ.Родственник.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
			//				Если МассивЭЛПочта.Количество() > 0 Тогда
			//					Для Каждого ЭлМассива Из МассивЭЛПочта Цикл
			//			
			//						Запись.ЗаписатьНачалоЭлемента("emk:ContactDto");

			//						Запись.ЗаписатьНачалоЭлемента("emk:ContactValue");
			//						Запись.ЗаписатьТекст(ЭлМассива.Представление);
			//						Запись.ЗаписатьКонецЭлемента();
			//			
			//						Запись.ЗаписатьНачалоЭлемента("emk:IdContactType");
			//						Запись.ЗаписатьТекст("3");
			//						Запись.ЗаписатьКонецЭлемента();
			//			
			//						Запись.ЗаписатьКонецЭлемента();
			//		
			//					КонецЦикла;
			//				КонецЕсли;

			//			Запись.ЗаписатьКонецЭлемента();

			//			Запись.ЗаписатьНачалоЭлемента("emk:FamilyName");
			//			Запись.ЗаписатьТекст(ЭлТЗ.Родственник.Фамилия);
			//			Запись.ЗаписатьКонецЭлемента();
			//    	
			//			Запись.ЗаписатьНачалоЭлемента("emk:GivenName");
			//			Запись.ЗаписатьТекст(ЭлТЗ.Родственник.Имя);
			//			Запись.ЗаписатьКонецЭлемента();
			//	
			//			Запись.ЗаписатьНачалоЭлемента("emk:IdPatientMIS");
			//			Запись.ЗаписатьТекст(Строка(ЭлТЗ.Родственник.УникальныйИдентификатор()));
			//			Запись.ЗаписатьКонецЭлемента();
			//			
			//			// КодРодственника = ОпределитьОИД
			//			Запись.ЗаписатьНачалоЭлемента("emk:IdRelationType");
			//			Запись.ЗаписатьТекст("1");
			//			Запись.ЗаписатьКонецЭлемента();

			//			Если ЗначениеЗаполнено(КонтрАгентДляОтправки.Отчество) Тогда
			//				Запись.ЗаписатьНачалоЭлемента("emk:MiddleName");
			//				Запись.ЗаписатьТекст(ЭлТЗ.Родственник.Отчество);
			//				Запись.ЗаписатьКонецЭлемента();
			//			КонецЕсли;
			//
			//		Запись.ЗаписатьКонецЭлемента();
			//	КонецЦикла;
			//
			// КонецЕсли;
			///////////////////////////////////////////////////////////////// Контактная информация //////////////////////////////////////////
			МассивТелефонов = КонтрАгентДляОтправки.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
			МассивЭЛПочта = КонтрАгентДляОтправки.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
			
			Если МассивТелефонов.Количество() > 0 Или МассивЭЛПочта.Количество() > 0 Тогда
				Запись.ЗаписатьНачалоЭлемента("emk:Contacts");
				
					Если МассивТелефонов.Количество() > 0 Тогда
						Для Каждого ЭлМассива Из МассивТелефонов Цикл
							
							Если ЗначениеЗаполнено(ЭлМассива.Представление) Тогда
							Запись.ЗаписатьНачалоЭлемента("emk:ContactDto");

							Запись.ЗаписатьНачалоЭлемента("emk:ContactValue");
							Запись.ЗаписатьТекст(ЭлМассива.Представление);
							Запись.ЗаписатьКонецЭлемента();
						
				    		Запись.ЗаписатьНачалоЭлемента("emk:IdContactType");
							Запись.ЗаписатьТекст("1");
							Запись.ЗаписатьКонецЭлемента();
						
							Запись.ЗаписатьКонецЭлемента();
							КонецЕсли;
						
						КонецЦикла;
					КонецЕсли;
				
					Если МассивЭЛПочта.Количество() > 0 Тогда
						Для Каждого ЭлМассива Из МассивЭЛПочта Цикл
						
							Запись.ЗаписатьНачалоЭлемента("emk:ContactDto");

							Запись.ЗаписатьНачалоЭлемента("emk:ContactValue");
							Запись.ЗаписатьТекст(ЭлМассива.Представление);
							Запись.ЗаписатьКонецЭлемента();
						
			    			Запись.ЗаписатьНачалоЭлемента("emk:IdContactType");
							Запись.ЗаписатьТекст("3");
							Запись.ЗаписатьКонецЭлемента();
						
							Запись.ЗаписатьКонецЭлемента();
					
						КонецЦикла;
					КонецЕсли;
					
				Запись.ЗаписатьКонецЭлемента();		
			КонецЕсли;
		
			///////////////////////////////////////////////////////////////// Документы пациента //////////////////////////////////////////
			ДокументФизЛицо = РегистрыСведений.ДокументыФизическихЛиц.ДокументыУдостоверяющиеЛичностьФизлица(КонтрАгентДляОтправки, ТекущаяДатаСеанса(),, Истина); 
			ПолисыОМСДМС = Справочники.ПолисыМедицинскогоСтрахования.ПолучитьАктивныеПолисыКонтрагента(КонтрАгентДляОтправки);
			МедецинскиеКарты = Справочники.МедицинскиеКарты.ПолучитьМедКартыКлиента(КонтрАгентДляОтправки);
			
			ДокументФизЛицаСуществует = Ложь;
			Если ДокументФизЛицо.Количество() > 0 Тогда
				Для Каждого Элемент Из ДокументФизЛицо Цикл
					Если ЗначениеЗаполнено(Элемент.Номер) И ЗначениеЗаполнено(Элемент.КемВыдан) И ?(Элемент.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ, ЗначениеЗаполнено(Элемент.Серия), Истина) Тогда
						ДокументФизЛицаСуществует = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;	
			
			ПолисСуществует = Ложь;
			Если ПолисыОМСДМС.Количество() > 0 Тогда
				Для Каждого Элемент Из ПолисыОМСДМС Цикл
					Если ЗначениеЗаполнено(Элемент.НомерПолиса) И ЗначениеЗаполнено(Элемент.СтраховаяКомпания.НаименованиеПолное) И ЗначениеЗаполнено(Элемент.СерияПолиса) Тогда
						ПолисСуществует = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ДокументФизЛицаСуществует Или ПолисСуществует Или МедецинскиеКарты.Количество() > 0 Тогда
			
			Запись.ЗаписатьНачалоЭлемента("emk:Documents");
			Если ДокументФизЛицо.Количество() > 0 Тогда
				Для Каждого ЭлМассива Из ДокументФизЛицо Цикл
					Если ЗначениеЗаполнено(ЭлМассива.Номер) И ЗначениеЗаполнено(ЭлМассива.КемВыдан) И ?(ЭлМассива.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ, ЗначениеЗаполнено(ЭлМассива.Серия), Истина) Тогда
					Запись.ЗаписатьНачалоЭлемента("emk:DocumentDto");
				
			        	Запись.ЗаписатьНачалоЭлемента("emk:DocN");
						Запись.ЗаписатьТекст(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(ЭлМассива.Номер)));
						Запись.ЗаписатьКонецЭлемента();
						
						Если ЗначениеЗаполнено(ЭлМассива.Серия) Тогда
							Запись.ЗаписатьНачалоЭлемента("emk:DocS");
							Запись.ЗаписатьТекст(ЭлМассива.Серия);
							Запись.ЗаписатьКонецЭлемента();
						КонецЕсли;
					
						Запись.ЗаписатьНачалоЭлемента("emk:DocumentName");
						Запись.ЗаписатьТекст(ЭлМассива.ВидДокумента.Наименование);
						Запись.ЗаписатьКонецЭлемента();
						
						Если ЭлМассива.СрокДействия <> Дата(1,1,1) Тогда
							Запись.ЗаписатьНачалоЭлемента("emk:ExpiredDate");
							Запись.ЗаписатьТекст(Формат(ЭлМассива.СрокДействия, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
							Запись.ЗаписатьКонецЭлемента();
						КонецЕсли;
						
			       		Если ЭлМассива.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда
						   	Запись.ЗаписатьНачалоЭлемента("emk:IdDocumentType");
							Запись.ЗаписатьТекст("14");
							Запись.ЗаписатьКонецЭлемента();
						ИначеЕсли ЭлМассива.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СНИЛС Тогда
							Запись.ЗаписатьНачалоЭлемента("emk:IdDocumentType");
							Запись.ЗаписатьТекст("223");
							Запись.ЗаписатьКонецЭлемента();
						КонецЕсли;
						
						Если ЭлМассива.ДатаВыдачи <> Дата(1,1,1) Тогда
							Запись.ЗаписатьНачалоЭлемента("emk:IssuedDate");
							Запись.ЗаписатьТекст(Формат(ЭлМассива.ДатаВыдачи, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
							Запись.ЗаписатьКонецЭлемента();
						КонецЕсли;
					
						Запись.ЗаписатьНачалоЭлемента("emk:ProviderName");
						Запись.ЗаписатьТекст(ЭлМассива.КемВыдан);
						Запись.ЗаписатьКонецЭлемента();
							
					Запись.ЗаписатьКонецЭлемента();
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ПолисыОМСДМС.Количество() > 0 Тогда
			    Для Каждого ЭлМассива Из ПолисыОМСДМС Цикл
					
					Если ЗначениеЗаполнено(ЭлМассива.НомерПолиса) И ЗначениеЗаполнено(ЭлМассива.СтраховаяКомпания.НаименованиеПолное) И ЗначениеЗаполнено(ЭлМассива.СерияПолиса) Тогда
					Запись.ЗаписатьНачалоЭлемента("emk:DocumentDto");
				
			        	Запись.ЗаписатьНачалоЭлемента("emk:DocN");
						Запись.ЗаписатьТекст(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(ЭлМассива.НомерПолиса)));
						Запись.ЗаписатьКонецЭлемента();
							
						Запись.ЗаписатьНачалоЭлемента("emk:DocS");
						Запись.ЗаписатьТекст(ЭлМассива.СерияПолиса);
						Запись.ЗаписатьКонецЭлемента();
						
						Запись.ЗаписатьНачалоЭлемента("emk:DocumentName");
						Запись.ЗаписатьТекст(ЭлМассива.Наименование);
						Запись.ЗаписатьКонецЭлемента();
						
						Если ЭлМассива.ДатаОкончания <> Дата(1,1,1) Тогда
							Запись.ЗаписатьНачалоЭлемента("emk:ExpiredDate");
							Запись.ЗаписатьТекст(Формат(ЭлМассива.ДатаОкончания, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
							Запись.ЗаписатьКонецЭлемента();
						КонецЕсли;
					
			       	   	Запись.ЗаписатьНачалоЭлемента("emk:IdDocumentType");
						Если СтрДлина(ЭлМассива.НомерПолиса) = 6 Тогда
							Запись.ЗаписатьТекст("226");
						ИначеЕсли СтрДлина(ЭлМассива.НомерПолиса) = 16 Тогда
							Запись.ЗаписатьТекст("228");
						Иначе 
							Запись.ЗаписатьТекст("240");
						КонецЕсли;
						Запись.ЗаписатьКонецЭлемента();
						
						Если ЗначениеЗаполнено(ЭлМассива.СтраховаяКомпания.РеестровыйНомерОМС) Тогда 
							Запись.ЗаписатьНачалоЭлемента("emk:IdProvider");
							Запись.ЗаписатьТекст(ЭлМассива.СтраховаяКомпания.РеестровыйНомерОМС);
							Запись.ЗаписатьКонецЭлемента();
						КонецЕсли;
						
						Если ЭлМассива.ДанаНачала <> Дата(1,1,1) Тогда
							Запись.ЗаписатьНачалоЭлемента("emk:IssuedDate");
							Запись.ЗаписатьТекст(Формат(ЭлМассива.ДанаНачала, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
							Запись.ЗаписатьКонецЭлемента();
						КонецЕсли;
					
						Запись.ЗаписатьНачалоЭлемента("emk:ProviderName");
						Запись.ЗаписатьТекст(ЭлМассива.СтраховаяКомпания.НаименованиеПолное);
						Запись.ЗаписатьКонецЭлемента();
						
						Если ЭлМассива.ДанаНачала <> Дата(1,1,1) Тогда
							Запись.ЗаписатьНачалоЭлемента("emk:StartDate");
							Запись.ЗаписатьТекст(Формат(ЭлМассива.ДанаНачала, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
							Запись.ЗаписатьКонецЭлемента();
						КонецЕсли;
						
					Запись.ЗаписатьКонецЭлемента();
					КонецЕсли;
			    КонецЦикла;
			КонецЕсли;
			
			Если МедецинскиеКарты.Количество() > 0 И ЗначениеЗаполнено(КонтрАгентДляОтправки.ТекущаяМедицинскаяКарта) Тогда
				
				ЭлМассива = КонтрАгентДляОтправки.ТекущаяМедицинскаяКарта;				
				
					Запись.ЗаписатьНачалоЭлемента("emk:DocumentDto");
					
			        	Запись.ЗаписатьНачалоЭлемента("emk:DocN");
						Запись.ЗаписатьТекст(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(ЭлМассива.КодБезНулей)));
						Запись.ЗаписатьКонецЭлемента();
						
						Запись.ЗаписатьНачалоЭлемента("emk:DocumentName");
						Запись.ЗаписатьТекст(ЭлМассива.ВидМедицинскойКарты.Наименование);
						Запись.ЗаписатьКонецЭлемента();
						
						Если ЭлМассива.ДатаЗакрытия <> Дата(1,1,1) Тогда
							Запись.ЗаписатьНачалоЭлемента("emk:ExpiredDate");
							Запись.ЗаписатьТекст(Формат(ЭлМассива.ДатаЗакрытия, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
							Запись.ЗаписатьКонецЭлемента();
						КонецЕсли;
						
					   	Запись.ЗаписатьНачалоЭлемента("emk:IdDocumentType");
						Запись.ЗаписатьТекст("246");
						Запись.ЗаписатьКонецЭлемента();
						
						Если ЭлМассива.ДатаРегистрации <> Дата(1,1,1) Тогда
							Запись.ЗаписатьНачалоЭлемента("emk:IssuedDate");
							Запись.ЗаписатьТекст(Формат(ЭлМассива.ДатаРегистрации, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
							Запись.ЗаписатьКонецЭлемента();
						КонецЕсли;
					
						Запись.ЗаписатьНачалоЭлемента("emk:ProviderName");
						Запись.ЗаписатьТекст(КонтрАгентДляОтправки.СтруктурнаяЕдиница.Наименование);
						Запись.ЗаписатьКонецЭлемента();
					
					Запись.ЗаписатьКонецЭлемента();
			
			КонецЕсли;
			Запись.ЗаписатьКонецЭлемента();
			КонецЕсли;
			///////////////////////////////////////////////////////////////// Информация о пациенте //////////////////////////////////////////
			
			Запись.ЗаписатьНачалоЭлемента("emk:FamilyName");
			Запись.ЗаписатьТекст(СокрЛП(КонтрАгентДляОтправки.Фамилия));
			Запись.ЗаписатьКонецЭлемента();
			
			Запись.ЗаписатьНачалоЭлемента("emk:GivenName");
			Запись.ЗаписатьТекст(СокрЛП(КонтрАгентДляОтправки.Имя));
			Запись.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(КонтрАгентДляОтправки.ГруппаКрови) Тогда
				
				Если КонтрАгентДляОтправки.ГруппаКрови = Перечисления.ГруппыКрови.ПерваяОтрицательная Тогда
					ГруппаКровиПациента = "1";
				ИначеЕсли КонтрАгентДляОтправки.ГруппаКрови = Перечисления.ГруппыКрови.ПерваяПоложительная Тогда
					ГруппаКровиПациента = "2";
				ИначеЕсли КонтрАгентДляОтправки.ГруппаКрови = Перечисления.ГруппыКрови.ВтораяОтрицательная Тогда
					ГруппаКровиПациента = "3";
				ИначеЕсли КонтрАгентДляОтправки.ГруппаКрови = Перечисления.ГруппыКрови.ВтораяПоложительная Тогда
					ГруппаКровиПациента = "4";
				ИначеЕсли КонтрАгентДляОтправки.ГруппаКрови = Перечисления.ГруппыКрови.ТретьяОтрицательная Тогда
					ГруппаКровиПациента = "5";             
				ИначеЕсли КонтрАгентДляОтправки.ГруппаКрови = Перечисления.ГруппыКрови.ТретьяПоложительная Тогда
					ГруппаКровиПациента = "6";
				ИначеЕсли КонтрАгентДляОтправки.ГруппаКрови = Перечисления.ГруппыКрови.ЧетвертаяОтрицательная Тогда
					ГруппаКровиПациента = "7";
				Иначе 
					ГруппаКровиПациента = "8";
				КонецЕсли;
					
				Запись.ЗаписатьНачалоЭлемента("emk:IdBloodType");
				Запись.ЗаписатьТекст(ГруппаКровиПациента);
				Запись.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			Если АдресСписокЗначений <> Неопределено Тогда
				Если АдресСписокЗначений.ГородСокращение = "г" Или АдресСписокЗначений.РегионСокращение = "г" Тогда
					Запись.ЗаписатьНачалоЭлемента("emk:IdLivingAreaType");
					Запись.ЗаписатьТекст("1");
					Запись.ЗаписатьКонецЭлемента();
				ИначеЕсли АдресСписокЗначений.НаселенныйПунктСокращение = "с" Тогда
					Запись.ЗаписатьНачалоЭлемента("emk:IdLivingAreaType");
					Запись.ЗаписатьТекст("2");
					Запись.ЗаписатьКонецЭлемента();
				КонецЕсли;
			КонецЕсли;
			
			Запись.ЗаписатьНачалоЭлемента("emk:IdPatientMIS");
			Запись.ЗаписатьТекст(Строка(КонтрАгентДляОтправки.УникальныйИдентификатор()));
			Запись.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(КонтрАгентДляОтправки.Отчество) Тогда
				Запись.ЗаписатьНачалоЭлемента("emk:MiddleName");
				Запись.ЗаписатьТекст(СокрЛП(КонтрАгентДляОтправки.Отчество));
				Запись.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			Если КонтрАгентДляОтправки.ПолКлиента = Перечисления.ПолФизическогоЛица.Мужской Тогда
				Пол = 1;
			ИначеЕсли КонтрАгентДляОтправки.ПолКлиента = Перечисления.ПолФизическогоЛица.Женский Тогда
				Пол = 2;
			Иначе
				Пол = 3;
			КонецЕсли;
			Запись.ЗаписатьНачалоЭлемента("emk:Sex");
			Запись.ЗаписатьТекст(Строка(Пол));
			Запись.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(КонтрАгентДляОтправки.СоциальнаяГруппа) Тогда
				Запись.ЗаписатьНачалоЭлемента("emk:SocialGroup");
				Запись.ЗаписатьТекст(КонтрАгентДляОтправки.СоциальнаяГруппа.КодОИД);
				Запись.ЗаписатьКонецЭлемента();
			КонецЕсли;

			Если ЗначениеЗаполнено(КонтрАгентДляОтправки.СоциальныйСтатус) Тогда
				Запись.ЗаписатьНачалоЭлемента("emk:SocialStatus");
				Запись.ЗаписатьТекст(КонтрАгентДляОтправки.СоциальныйСтатус.СоциальныйСтатусПоКлассификаторуИЭМК.КодОИД);
				Запись.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
		Запись.ЗаписатьКонецЭлемента();
	
	Запись.ЗаписатьКонецЭлемента();
     
	СтрокаXML = Запись.Закрыть();  

	СтрокаSOAP = "<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:tem=""http://tempuri.org/"" xmlns:emk=""http://schemas.datacontract.org/2004/07/EMKService.Data.Dto"">
	| <soapenv:Header/>
	| <soapenv:Body>
	|"
	+СтрокаXML+
	"
	| </soapenv:Body>
	|</soapenv:Envelope>";
	
// Описываем заголовки HTTP-запроса

Заголовки = Новый Соответствие;

Заголовки.Вставить("Content-Type", "text/xml;charset=UTF-8");
Если ЗначениеЗаполнено(УидВИЭМК) Тогда
	Заголовки.Вставить("SOAPAction", "http://tempuri.org/IPixService/UpdatePatient");
Иначе
    Заголовки.Вставить("SOAPAction", "http://tempuri.org/IPixService/AddPatient");
КонецЕсли;

Если Демо Тогда
	АдресСтенда = "b2b-demo.n3health.ru";
Иначе
	АдресСтенда = "b2b.n3health.ru";
КонецЕсли;

Соединение = Новый HTTPСоединение(АдресСтенда,,,,,5,Новый ЗащищенноеСоединениеOpenSSL()); 
// Получаем текст корневой страницы через POST-запрос.

HTTPЗапрос = Новый HTTPЗапрос("/emk/PixService.svc", Заголовки);
HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаSOAP);

Попытка
	Результат = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	
	Ответ = Результат.ПолучитьТелоКакСтроку();
	
	Если Результат.КодСостояния = 200 И НЕ ЗначениеЗаполнено(УидВИЭМК) Тогда
		УидПациентаВИЭМК = ПроверитьПациентаИЭМК(КонтрАгентДляОтправки, guid, idLPU, Демо);
	КонецЕсли;
	
	РегистрыСведений.ЖурналОбменаИЭМК.ДобавитьЗапись(КонтрАгентДляОтправки, Результат.КодСостояния, Ответ, УидПациентаВИЭМК, Строка(КонтрАгентДляОтправки.УникальныйИдентификатор()), КоличествоПопытокПодключения, ТекущаяДатаСеанса());
Исключение
	
	ИнформацияОбОшибке = ИнформацияОбОшибке(); 
	Комментарий = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
	ЗаписьЖурналаРегистрации(
	НСтр("ru = 'Создание пациента в ИЭМК.'",
	ОбщегоНазначения.КодОсновногоЯзыка()),
	УровеньЖурналаРегистрации.Ошибка,,,
	Комментарий);
	
	РегистрыСведений.ЖурналОбменаИЭМК.ДобавитьЗапись(КонтрАгентДляОтправки, "404", Комментарий, "",Строка(КонтрАгентДляОтправки.УникальныйИдентификатор()),КоличествоПопытокПодключения, ТекущаяДатаСеанса());
КонецПопытки;

КонецПроцедуры

// Функция возвращает признак находится ли данный пациент в системе ИЭМК.
//
Функция ПроверитьПациентаИЭМК(КонтрАгентДляОтправки, guid, idLPU, Демо) Экспорт

	ПутьКФайлу = ПолучитьИмяВременногоФайла("xml");
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();

	Запись.ЗаписатьНачалоЭлемента("tem:GetPatient");
	
	    Запись.ЗаписатьНачалоЭлемента("tem:guid");
		Запись.ЗаписатьТекст(guid);
		Запись.ЗаписатьКонецЭлемента();
	
		Запись.ЗаписатьНачалоЭлемента("tem:idLPU");
		Запись.ЗаписатьТекст(idLPU);
		Запись.ЗаписатьКонецЭлемента();
	
		Запись.ЗаписатьНачалоЭлемента("tem:patient");
		
			Запись.ЗаписатьНачалоЭлемента("emk:IdPatientMIS");
			Запись.ЗаписатьТекст(Строка(КонтрАгентДляОтправки.УникальныйИдентификатор()));
			Запись.ЗаписатьКонецЭлемента();

	    Запись.ЗаписатьКонецЭлемента();
	
	Запись.ЗаписатьКонецЭлемента();
	
	СтрокаXML = Запись.Закрыть(); 
		
	СтрокаSOAP = "<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:tem=""http://tempuri.org/"" xmlns:ser=""http://schemas.microsoft.com/2003/10/Serialization/"" xmlns:emk=""http://schemas.datacontract.org/2004/07/EMKService.Data.Dto"">
	| <soapenv:Header/>
	| <soapenv:Body>
	|"
	+СтрокаXML+
	"
	| </soapenv:Body>
	|</soapenv:Envelope>";

// Описываем заголовки HTTP-запроса

Заголовки = Новый Соответствие;

Заголовки.Вставить("Content-Type", "text/xml;charset=UTF-8");
Заголовки.Вставить("SOAPAction", "http://tempuri.org/IPixService/GetPatient");

Если Демо Тогда
	АдресСтенда = "b2b-demo.n3health.ru";
Иначе
	АдресСтенда = "b2b.n3health.ru";
КонецЕсли;

Соединение = Новый HTTPСоединение(АдресСтенда,,,,,5,Новый ЗащищенноеСоединениеOpenSSL()); 
// Получаем текст корневой страницы через POST-запрос.

HTTPЗапрос = Новый HTTPЗапрос("/emk/PixService.svc", Заголовки);
HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаSOAP);

Попытка
	Результат = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);	
	
	Ответ = Результат.ПолучитьТелоКакСтроку();	

	ЧтениеXML = Новый ЧтениеXML;	
	
	// Загрузить XML из строки
	ЧтениеXML.УстановитьСтроку(Ответ);	

	УИДПациентаВИЭМК = "";

	// Перебор узлов	
	Пока ЧтениеXML.Прочитать() Цикл
	
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если ЧтениеXML.ЛокальноеИмя = "IdGlobal" Тогда
				ЧтениеXML.Прочитать();
				УИДПациентаВИЭМК = ЧтениеXML.Значение;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;

	ЧтениеXML.Закрыть(); 
	
Исключение
	
	ИнформацияОбОшибке = ИнформацияОбОшибке(); 
	Комментарий = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
	ЗаписьЖурналаРегистрации(
	НСтр("ru = 'Проврка пациента в ИЭМК.'",
	ОбщегоНазначения.КодОсновногоЯзыка()),
	УровеньЖурналаРегистрации.Ошибка,,,
	Комментарий);
	
	Возврат "Ошибка:" + ИнформацияОбОшибке;

КонецПопытки;

Возврат УИДПациентаВИЭМК;

КонецФункции

// Процедура производит запись приема в ИЭМК.
//
Процедура СоздатьПриемВИЭМК(ПриемДляОтправки, guid, idLPU, КоличествоПопыток, УидВИЭМК, Демо) Экспорт
	
	УИДПациентаВИЭМК = ПроверитьПациентаИЭМК(ПриемДляОтправки.Контрагент, guid, idLPU, Демо);
	
	Если Лев(УИДПациентаВИЭМК, 6) = "Ошибка" Тогда
		РегистрыСведений.ЖурналОбменаИЭМК.ДобавитьЗапись(ПриемДляОтправки.Контрагент, "404", УИДПациентаВИЭМК, "",Строка(ПриемДляОтправки.Контрагент.УникальныйИдентификатор()),, ТекущаяДатаСеанса());
		Возврат	
	КонецЕсли;

	УидВИЭМКПривема = УидВИЭМК;
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		ЧасовойПоясОД = Константы.ЧасовойПоясОбластиДанных.Получить();
		ЧасовойПоясБазы = "+" + Формат(СмещениеСтандартногоВремени(ЧасовойПоясОД)/60/60, "ЧЦ=2; ЧВН=; ЧГ=")+":00";
	Иначе
		ЧасовойПоясБазы = "+" + Формат(СмещениеСтандартногоВремени(ЧасовойПояс())/60/60, "ЧЦ=2; ЧВН=; ЧГ=")+":00";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УИДПациентаВИЭМК) Тогда
		СоздатьПациентаВИЭМК(ПриемДляОтправки.Контрагент, guid, idLPU,, "", Демо);
		УИДПациентаВИЭМК = ПроверитьПациентаИЭМК(ПриемДляОтправки.Контрагент, guid, idLPU, Демо);
	ИначеЕсли Не ЗначениеЗаполнено(УидВИЭМКПривема) Тогда
		УИДПриема = Строка(ПриемДляОтправки.УникальныйИдентификатор());
		УидВИЭМКПривема = ПроверитьПриемИЭМК(УИДПациентаВИЭМК, УИДПриема, guid, idLPU, Демо);
	КонецЕсли;
	
	КоличествоПопытокПодключения = КоличествоПопыток + 1;
	Если Лев(УидВИЭМКПривема, 6) = "Ошибка" Тогда
		РегистрыСведений.ЖурналОбменаИЭМК.ДобавитьЗапись(ПриемДляОтправки, "404", УидВИЭМКПривема,,Строка(ПриемДляОтправки.УникальныйИдентификатор()), КоличествоПопытокПодключения, ТекущаяДатаСеанса());
		Возврат	
	КонецЕсли;
	
	ПациентИмеетСнНИЛС = Ложь;
	ДокументФизЛицаСуществует = Ложь;
	ДокументФизЛицо = РегистрыСведений.ДокументыФизическихЛиц.ДокументыУдостоверяющиеЛичностьФизлица(ПриемДляОтправки.Контрагент, ТекущаяДатаСеанса(),, Истина);
	Если ДокументФизЛицо.Количество() > 0 Тогда
		Для Каждого Элемент Из ДокументФизЛицо Цикл
			Если ЗначениеЗаполнено(Элемент.Номер) И Элемент.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СНИЛС Тогда
				ПациентИмеетСнНИЛС = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	ОбследованиеПациента = РегистрыСведений.ЗначенияПараметровОбследований.ПолучитьМенеджераВременнойТаблицыОбследованияСтоматолога(ПриемДляОтправки.Контрагент, ПриемДляОтправки);
	Если Не ЗначениеЗаполнено(ОбследованиеПациента) Или ОбследованиеПациента.Найти("Диагноз").Количество() = 0 Тогда	
		РегистрыСведений.ЖурналОбменаИЭМК.ДобавитьЗапись(ПриемДляОтправки.Контрагент, "404", "Не заполнен диагноз!", "",Строка(ПриемДляОтправки.Контрагент.УникальныйИдентификатор()),КоличествоПопытокПодключения, ТекущаяДатаСеанса());
		Возврат;
	КонецЕсли;
	
	Если Не Демо Тогда
		ПодписьОрганизации = Подпись(ПриемДляОтправки.Организация);
	    ПодписьСотрудника  = Подпись(ПриемДляОтправки.Организация, ПриемДляОтправки.Сотрудник);
	КонецЕсли;
	
	ЗначениеПараметровОбследования = РегистрыСведений.ЗначенияПараметровОбследований.ПолучитьМенеджераВременнойТаблицыОбследованияСтоматолога(ПриемДляОтправки.Контрагент, ПриемДляОтправки);
	ПараметрыОбследованияСтрокой = "";
	Для Каждого ЭлементПараметра Из  ЗначениеПараметровОбследования Цикл
		ПараметрыОбследованияСтрокой = ПараметрыОбследованияСтрокой + ЭлементПараметра.РеквизитИмя + ": " + ЭлементПараметра.РеквизитЗначение + Символы.ПС;
	КонецЦикла;
	ПараметрыОбследованияСтрокой = Лев(ПараметрыОбследованияСтрокой, СтрДлина(ПараметрыОбследованияСтрокой) - 1);
	
	Для Каждого Элемент Из ПриемДляОтправки.Сотрудник.СпецилазацииСотрудника Цикл
		Если Элемент.Основная Тогда
			Специальность = Элемент.Специализация.СпециализацияПоКлассификаторуИЭМК.КодОИД;	
		КонецЕсли;	
	КонецЦикла;
	
	ДокументФизЛицо = РегистрыСведений.ДокументыФизическихЛиц.ДокументыУдостоверяющиеЛичностьФизлица(ПриемДляОтправки.Сотрудник, ТекущаяДатаСеанса(),, Истина);
	
	ДокументФизЛицаСуществует = Ложь;
	Если ДокументФизЛицо.Количество() > 0 Тогда
		Для Каждого Элемент Из ДокументФизЛицо Цикл
			Если ЗначениеЗаполнено(Элемент.Номер) И Элемент.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СНИЛС Тогда
				ДокументФизЛицаСуществует = Истина; 
				Прервать;
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
	
	Если Не ДокументФизЛицаСуществует Тогда
		РегистрыСведений.ЖурналОбменаИЭМК.ДобавитьЗапись(ПриемДляОтправки, "404", УИДПациентаВИЭМК, "",Строка(ПриемДляОтправки.Контрагент.УникальныйИдентификатор()),, ТекущаяДатаСеанса());
		Возврат;                           
	КонецЕсли;
		
	ПутьКФайлу = ПолучитьИмяВременногоФайла("xml");
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	
	Если УидВИЭМК = "" Тогда
		Запись.ЗаписатьНачалоЭлемента("AddCase");
		Запись.ЗаписатьАтрибут("xmlns", "http://tempuri.org/");
		// Запись.ЗаписатьСоответствиеПространстваИмен("xmlns", "http://tempuri.org/");
	Иначе
		Запись.ЗаписатьНачалоЭлемента("UpdateCase");
		Запись.ЗаписатьАтрибут("xmlns", "http://tempuri.org/");
	КонецЕсли;
	
			Запись.ЗаписатьНачалоЭлемента("guid");
			Запись.ЗаписатьТекст(guid);
			Запись.ЗаписатьКонецЭлемента();
	
			Запись.ЗаписатьНачалоЭлемента("caseDto");
			Запись.ЗаписатьСоответствиеПространстваИмен("d4p1", "http://schemas.datacontract.org/2004/07/N3.EMK.Dto.Case");
			Запись.ЗаписатьСоответствиеПространстваИмен("i", "http://www.w3.org/2001/XMLSchema-instance");
			Запись.ЗаписатьАтрибут("i:type", "d4p1:CaseAmb");
	
				Запись.ЗаписатьНачалоЭлемента("d4p1:OpenDate");
				Запись.ЗаписатьТекст(Формат(ПриемДляОтправки.ВремяНачалаПриема, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
				Запись.ЗаписатьКонецЭлемента();
	
				Запись.ЗаписатьНачалоЭлемента("d4p1:CloseDate");
				Запись.ЗаписатьТекст(Формат(ПриемДляОтправки.ВремяОкончанияПриема, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
				Запись.ЗаписатьКонецЭлемента();
	
				Запись.ЗаписатьНачалоЭлемента("d4p1:HistoryNumber");
				Запись.ЗаписатьТекст(Строка(ПриемДляОтправки.Номер));
				Запись.ЗаписатьКонецЭлемента();
	
				Запись.ЗаписатьНачалоЭлемента("d4p1:IdCaseMis");
				Запись.ЗаписатьТекст(Строка(ПриемДляОтправки.УникальныйИдентификатор()));
				Запись.ЗаписатьКонецЭлемента();
	
				Запись.ЗаписатьНачалоЭлемента("d4p1:IdCaseAidType");
				Запись.ЗаписатьТекст("6");
				Запись.ЗаписатьКонецЭлемента();
	
				Запись.ЗаписатьНачалоЭлемента("d4p1:IdPaymentType");
				Если ЗначениеЗаполнено(ПриемДляОтправки.ПолисМедСтрахования) Тогда
					Если ПриемДляОтправки.ПолисМедСтрахования.ТипПолиса = Перечисления.ТипыПолиса.ОбязательноеМедицинскоеСтрахование Тогда
				Запись.ЗаписатьТекст("1");
					Иначе
				Запись.ЗаписатьТекст("4");
					КонецЕсли;
				Иначе
				Запись.ЗаписатьТекст("5");
				КонецЕсли;
				Запись.ЗаписатьКонецЭлемента();
	
				Запись.ЗаписатьНачалоЭлемента("d4p1:Confidentiality");
				Запись.ЗаписатьТекст("1");
				Запись.ЗаписатьКонецЭлемента();
	
				Запись.ЗаписатьНачалоЭлемента("d4p1:DoctorConfidentiality");
				Запись.ЗаписатьТекст("1");
				Запись.ЗаписатьКонецЭлемента();
	
				Запись.ЗаписатьНачалоЭлемента("d4p1:CuratorConfidentiality");
				Запись.ЗаписатьТекст("1");
				Запись.ЗаписатьКонецЭлемента();
	
				Запись.ЗаписатьНачалоЭлемента("d4p1:IdLpu");
				Запись.ЗаписатьТекст(idLPU);
				Запись.ЗаписатьКонецЭлемента();
	
				Запись.ЗаписатьНачалоЭлемента("d4p1:IdCaseResult");
				Если ПриемДляОтправки.РезультатПриема = 1 Тогда
				Запись.ЗаписатьТекст("5");
				Иначе
				Запись.ЗаписатьТекст("2");
				КонецЕсли;
				Запись.ЗаписатьКонецЭлемента();
	
				Запись.ЗаписатьНачалоЭлемента("d4p1:Comment");
				Запись.ЗаписатьТекст(Лев(ПараметрыОбследованияСтрокой, 999));
				Запись.ЗаписатьКонецЭлемента();    
				
				///////////////////////////////////////////////// Информация о враче /////////////////////////////////////////////////////
				Запись.ЗаписатьНачалоЭлемента("d4p1:DoctorInCharge");
				Запись.ЗаписатьСоответствиеПространстваИмен("d5p1", "http://schemas.datacontract.org/2004/07/N3.EMK.Dto");
	
					Запись.ЗаписатьНачалоЭлемента("d5p1:Person");
	
						Запись.ЗаписатьНачалоЭлемента("d5p1:HumanName");
	
							Запись.ЗаписатьНачалоЭлемента("d5p1:GivenName");
							Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Имя));
							Запись.ЗаписатьКонецЭлемента();
	
							Если ЗначениеЗаполнено(ПриемДляОтправки.Сотрудник.Отчество) Тогда
							Запись.ЗаписатьНачалоЭлемента("d5p1:MiddleName");
							Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Отчество));
							Запись.ЗаписатьКонецЭлемента();
							КонецЕсли;
	
							Запись.ЗаписатьНачалоЭлемента("d5p1:FamilyName");
							Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Фамилия));
							Запись.ЗаписатьКонецЭлемента();
	
						Запись.ЗаписатьКонецЭлемента();
	
						Если ЗначениеЗаполнено(ПриемДляОтправки.Сотрудник.ДатаРождения) Тогда
						Запись.ЗаписатьНачалоЭлемента("d5p1:Birthdate");
						Запись.ЗаписатьТекст(Формат(ПриемДляОтправки.Сотрудник.ДатаРождения, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
						Запись.ЗаписатьКонецЭлемента();
						КонецЕсли;
	
						Запись.ЗаписатьНачалоЭлемента("d5p1:IdPersonMis");
						Запись.ЗаписатьТекст(Строка(ПриемДляОтправки.Сотрудник.УникальныйИдентификатор()));
						Запись.ЗаписатьКонецЭлемента();
	
						// Документы врача
	
						Если ДокументФизЛицаСуществует Тогда
		        	
						Запись.ЗаписатьНачалоЭлемента("d5p1:Documents");
							Если ДокументФизЛицо.Количество() > 0 Тогда
								Для Каждого ЭлМассива Из ДокументФизЛицо Цикл
									Если ЗначениеЗаполнено(ЭлМассива.Номер) И ЭлМассива.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СНИЛС Тогда
							Запись.ЗаписатьНачалоЭлемента("d5p1:IdentityDocument");
							
								Запись.ЗаписатьНачалоЭлемента("d5p1:DocN");
								Запись.ЗаписатьТекст(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(ЭлМассива.Номер)));
								Запись.ЗаписатьКонецЭлемента();
						
								Запись.ЗаписатьНачалоЭлемента("d5p1:IdDocumentType");
								Запись.ЗаписатьТекст("223");
								Запись.ЗаписатьКонецЭлемента();
						
								Если ЭлМассива.ДатаВыдачи <> Дата(1,1,1) Тогда
								Запись.ЗаписатьНачалоЭлемента("d5p1:IssuedDate");
								Запись.ЗаписатьТекст(Формат(ЭлМассива.ДатаВыдачи, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
								Запись.ЗаписатьКонецЭлемента();
								КонецЕсли;
						
								Запись.ЗаписатьНачалоЭлемента("d5p1:ProviderName");
								Запись.ЗаписатьТекст(ЭлМассива.КемВыдан);
								Запись.ЗаписатьКонецЭлемента();
						
							Запись.ЗаписатьКонецЭлемента();
									КонецЕсли;
								КонецЦикла;
							КонецЕсли; 
						Запись.ЗаписатьКонецЭлемента();
						КонецЕсли;
							            	
						// Конец Документы сотрудника
	            	
					Запись.ЗаписатьКонецЭлемента();
	
					Запись.ЗаписатьНачалоЭлемента("d5p1:IdLpu");
					Запись.ЗаписатьТекст(idLPU);
					Запись.ЗаписатьКонецЭлемента();
	
					Запись.ЗаписатьНачалоЭлемента("d5p1:IdSpeciality");
					Запись.ЗаписатьТекст(Специальность);
					Запись.ЗаписатьКонецЭлемента();
	
					Запись.ЗаписатьНачалоЭлемента("d5p1:IdPosition");
					Запись.ЗаписатьТекст(ПриемДляОтправки.Сотрудник.Должность.ДолжностьПоКлассификаторуИЭМК.КодОИД);
					Запись.ЗаписатьКонецЭлемента();
	
				Запись.ЗаписатьКонецЭлемента();
				///////////////////////////////////////////////// Информация о враче /////////////////////////////////////////////////////
				Запись.ЗаписатьНачалоЭлемента("d4p1:Authenticator");
				Запись.ЗаписатьСоответствиеПространстваИмен("d5p1", "http://schemas.datacontract.org/2004/07/N3.EMK.Dto");
	
					Запись.ЗаписатьНачалоЭлемента("d5p1:Doctor");
	
						Запись.ЗаписатьНачалоЭлемента("d5p1:Person");
	
							Запись.ЗаписатьНачалоЭлемента("d5p1:HumanName");
	
								Запись.ЗаписатьНачалоЭлемента("d5p1:GivenName");
								Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Имя));
								Запись.ЗаписатьКонецЭлемента();
	
								Если ЗначениеЗаполнено(ПриемДляОтправки.Сотрудник.Отчество) Тогда
								Запись.ЗаписатьНачалоЭлемента("d5p1:MiddleName");
								Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Отчество));
								Запись.ЗаписатьКонецЭлемента();
								КонецЕсли;
	
								Запись.ЗаписатьНачалоЭлемента("d5p1:FamilyName");
								Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Фамилия));
								Запись.ЗаписатьКонецЭлемента();
	
							Запись.ЗаписатьКонецЭлемента();
	
							Если ЗначениеЗаполнено(ПриемДляОтправки.Сотрудник.ДатаРождения) Тогда
							Запись.ЗаписатьНачалоЭлемента("d5p1:Birthdate");
							Запись.ЗаписатьТекст(Формат(ПриемДляОтправки.Сотрудник.ДатаРождения, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
							Запись.ЗаписатьКонецЭлемента();
							КонецЕсли;
	
							Запись.ЗаписатьНачалоЭлемента("d5p1:IdPersonMis");
							Запись.ЗаписатьТекст(Строка(ПриемДляОтправки.Сотрудник.УникальныйИдентификатор()));
							Запись.ЗаписатьКонецЭлемента();
	
							// Документы врача
	
							Если ДокументФизЛицаСуществует Тогда
		
							Запись.ЗаписатьНачалоЭлемента("d5p1:Documents");
								Если ДокументФизЛицо.Количество() > 0 Тогда
									Для Каждого ЭлМассива Из ДокументФизЛицо Цикл
										Если ЗначениеЗаполнено(ЭлМассива.Номер) И ЭлМассива.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СНИЛС Тогда
								Запись.ЗаписатьНачалоЭлемента("d5p1:IdentityDocument");
					
									Запись.ЗаписатьНачалоЭлемента("d5p1:DocN");
									Запись.ЗаписатьТекст(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(ЭлМассива.Номер)));
									Запись.ЗаписатьКонецЭлемента();
					
									Запись.ЗаписатьНачалоЭлемента("d5p1:IdDocumentType");
									Запись.ЗаписатьТекст("223");
									Запись.ЗаписатьКонецЭлемента();
					
									Если ЭлМассива.ДатаВыдачи <> Дата(1,1,1) Тогда
									Запись.ЗаписатьНачалоЭлемента("d5p1:IssuedDate");
									Запись.ЗаписатьТекст(Формат(ЭлМассива.ДатаВыдачи, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
									Запись.ЗаписатьКонецЭлемента();
									КонецЕсли;
					
									Запись.ЗаписатьНачалоЭлемента("d5p1:ProviderName");
									Запись.ЗаписатьТекст(ЭлМассива.КемВыдан);
									Запись.ЗаписатьКонецЭлемента();
					
								Запись.ЗаписатьКонецЭлемента();
										КонецЕсли;
									КонецЦикла;
								КонецЕсли; 
							Запись.ЗаписатьКонецЭлемента();
							КонецЕсли;
								
							// Конец Документы сотрудника
	
						Запись.ЗаписатьКонецЭлемента();
	
						Запись.ЗаписатьНачалоЭлемента("d5p1:IdLpu");
						Запись.ЗаписатьТекст(idLPU);
						Запись.ЗаписатьКонецЭлемента();
	
						Запись.ЗаписатьНачалоЭлемента("d5p1:IdSpeciality");
						Запись.ЗаписатьТекст(Специальность);
						Запись.ЗаписатьКонецЭлемента();
	          	
						Запись.ЗаписатьНачалоЭлемента("d5p1:IdPosition");
						Запись.ЗаписатьТекст(ПриемДляОтправки.Сотрудник.Должность.ДолжностьПоКлассификаторуИЭМК.КодОИД);
						Запись.ЗаписатьКонецЭлемента();
	
					Запись.ЗаписатьКонецЭлемента();
	
					Запись.ЗаписатьНачалоЭлемента("d5p1:IdRole");
					Запись.ЗаписатьТекст("4");   // Роль - Лечащий врач
					Запись.ЗаписатьКонецЭлемента();
	
				Запись.ЗаписатьКонецЭлемента();
				///////////////////////////////////////////////// Информация о враче /////////////////////////////////////////////////////
				Запись.ЗаписатьНачалоЭлемента("d4p1:Author");
				Запись.ЗаписатьСоответствиеПространстваИмен("d5p1", "http://schemas.datacontract.org/2004/07/N3.EMK.Dto");
	
					Запись.ЗаписатьНачалоЭлемента("d5p1:Doctor");
	
						Запись.ЗаписатьНачалоЭлемента("d5p1:Person");
	
							Запись.ЗаписатьНачалоЭлемента("d5p1:HumanName");
	
								Запись.ЗаписатьНачалоЭлемента("d5p1:GivenName");
								Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Имя));
								Запись.ЗаписатьКонецЭлемента();
	
								Если ЗначениеЗаполнено(ПриемДляОтправки.Сотрудник.Отчество) Тогда 
								Запись.ЗаписатьНачалоЭлемента("d5p1:MiddleName");
								Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Отчество));
								Запись.ЗаписатьКонецЭлемента();
								КонецЕсли;
	
								Запись.ЗаписатьНачалоЭлемента("d5p1:FamilyName");
								Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Фамилия));
								Запись.ЗаписатьКонецЭлемента();
	
							Запись.ЗаписатьКонецЭлемента();
	
							Если ЗначениеЗаполнено(ПриемДляОтправки.Сотрудник.ДатаРождения) Тогда
							Запись.ЗаписатьНачалоЭлемента("d5p1:Birthdate");
							Запись.ЗаписатьТекст(Формат(ПриемДляОтправки.Сотрудник.ДатаРождения, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
							Запись.ЗаписатьКонецЭлемента();
							КонецЕсли;
	
							Запись.ЗаписатьНачалоЭлемента("d5p1:IdPersonMis");
							Запись.ЗаписатьТекст(Строка(ПриемДляОтправки.Сотрудник.УникальныйИдентификатор()));
							Запись.ЗаписатьКонецЭлемента();
	
							// Документы врача
	               		
							Если ДокументФизЛицаСуществует Тогда
		           		
							Запись.ЗаписатьНачалоЭлемента("d5p1:Documents");
								Если ДокументФизЛицо.Количество() > 0 Тогда
									Для Каждого ЭлМассива Из ДокументФизЛицо Цикл
										Если ЗначениеЗаполнено(ЭлМассива.Номер) И ЭлМассива.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СНИЛС Тогда
								Запись.ЗаписатьНачалоЭлемента("d5p1:IdentityDocument");
							
									Запись.ЗаписатьНачалоЭлемента("d5p1:DocN");
									Запись.ЗаписатьТекст(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(ЭлМассива.Номер)));
									Запись.ЗаписатьКонецЭлемента();
							
									Запись.ЗаписатьНачалоЭлемента("d5p1:IdDocumentType");
									Запись.ЗаписатьТекст("223");
									Запись.ЗаписатьКонецЭлемента();
							
									Если ЭлМассива.ДатаВыдачи <> Дата(1,1,1) Тогда
									Запись.ЗаписатьНачалоЭлемента("d5p1:IssuedDate");
									Запись.ЗаписатьТекст(Формат(ЭлМассива.ДатаВыдачи, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
									Запись.ЗаписатьКонецЭлемента();
									КонецЕсли;
							
									Запись.ЗаписатьНачалоЭлемента("d5p1:ProviderName");
									Запись.ЗаписатьТекст(ЭлМассива.КемВыдан);
									Запись.ЗаписатьКонецЭлемента();
							
								Запись.ЗаписатьКонецЭлемента();
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							Запись.ЗаписатьКонецЭлемента();
							КонецЕсли;
	               		
							// Конец Документы сотрудника
	               		
						Запись.ЗаписатьКонецЭлемента();
	
						Запись.ЗаписатьНачалоЭлемента("d5p1:IdLpu");
						Запись.ЗаписатьТекст(idLPU);
						Запись.ЗаписатьКонецЭлемента();
	
						Запись.ЗаписатьНачалоЭлемента("d5p1:IdSpeciality");
						Запись.ЗаписатьТекст(Специальность);
						Запись.ЗаписатьКонецЭлемента();
	
						Запись.ЗаписатьНачалоЭлемента("d5p1:IdPosition");
						Запись.ЗаписатьТекст(ПриемДляОтправки.Сотрудник.Должность.ДолжностьПоКлассификаторуИЭМК.КодОИД);
						Запись.ЗаписатьКонецЭлемента();
	
					Запись.ЗаписатьКонецЭлемента();
	
					Запись.ЗаписатьНачалоЭлемента("d5p1:IdRole");
					Запись.ЗаписатьТекст("4");   // Роль - Лечащий врач
					Запись.ЗаписатьКонецЭлемента();
	
				Запись.ЗаписатьКонецЭлемента();
				///////////////////////////////////////////////// Информация о законном представителе /////////////////////////////////////////////////////
				ЗаконныеПредставители = РегистрыСведений.РодственныеСвязи.РодственникиКлиента(ПриемДляОтправки.Контрагент,,,Истина);
				ЗаконныйПредставитель = Неопределено;
				Если ЗаконныеПредставители.Количество() > 0 Тогда
					ЗаконныйПредставитель = ЗаконныеПредставители[0].Родственник;
				КонецЕсли;
	
				Если ЗначениеЗаполнено(ЗаконныйПредставитель) Тогда
		
				Запись.ЗаписатьНачалоЭлемента("d4p1:Guardian");
				Запись.ЗаписатьСоответствиеПространстваИмен("d5p1", "http://schemas.datacontract.org/2004/07/N3.EMK.Dto");
		
					Запись.ЗаписатьНачалоЭлемента("d5p1:Person");
		
						Запись.ЗаписатьНачалоЭлемента("d5p1:HumanName");
		
							Запись.ЗаписатьНачалоЭлемента("d5p1:GivenName");
							Запись.ЗаписатьТекст(СокрЛП(ЗаконныйПредставитель.Имя));
							Запись.ЗаписатьКонецЭлемента();
		
							Если ЗначениеЗаполнено(ЗаконныйПредставитель.Отчество) Тогда
							Запись.ЗаписатьНачалоЭлемента("d5p1:MiddleName");
							Запись.ЗаписатьТекст(СокрЛП(ЗаконныйПредставитель.Отчество));
							Запись.ЗаписатьКонецЭлемента();
							КонецЕсли;
		
							Запись.ЗаписатьНачалоЭлемента("d5p1:FamilyName");
							Запись.ЗаписатьТекст(СокрЛП(ЗаконныйПредставитель.Фамилия));
							Запись.ЗаписатьКонецЭлемента();
		
						Запись.ЗаписатьКонецЭлемента();
		
						Если ЗаконныйПредставитель.ПолКлиента = Перечисления.ПолФизическогоЛица.Мужской Тогда
							Пол = 1;
						ИначеЕсли ЗаконныйПредставитель.ПолКлиента = Перечисления.ПолФизическогоЛица.Женский Тогда
							Пол = 2;
						Иначе
							Пол = 3;
						КонецЕсли;
						Запись.ЗаписатьНачалоЭлемента("d5p1:Sex");
						Запись.ЗаписатьТекст(Строка(Пол));
						Запись.ЗаписатьКонецЭлемента();
		
						Если ЗначениеЗаполнено(ЗаконныйПредставитель.ДатаРожденияКлиента) Тогда
						Запись.ЗаписатьНачалоЭлемента("d5p1:Birthdate");
						Запись.ЗаписатьТекст(Формат(ЗаконныйПредставитель.ДатаРожденияКлиента, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
						Запись.ЗаписатьКонецЭлемента();
						КонецЕсли;
		
						Запись.ЗаписатьНачалоЭлемента("d5p1:IdPersonMis");
						Запись.ЗаписатьТекст(Строка(ЗаконныйПредставитель.УникальныйИдентификатор()));
						Запись.ЗаписатьКонецЭлемента();
		
						////////////////////////////// Документы Законного представителя //////////////////////
						ДокументФизЛицо = РегистрыСведений.ДокументыФизическихЛиц.ДокументыУдостоверяющиеЛичностьФизлица(ЗаконныйПредставитель, ТекущаяДатаСеанса(),, Истина);
						ПолисыОМСДМС = Справочники.ПолисыМедицинскогоСтрахования.ПолучитьАктивныеПолисыКонтрагента(ЗаконныйПредставитель);
						МедецинскиеКарты = Справочники.МедицинскиеКарты.ПолучитьМедКартыКлиента(ЗаконныйПредставитель);
		
						ДокументФизЛицаСуществует = Ложь;
						Если ДокументФизЛицо.Количество() > 0 Тогда
							Для Каждого Элемент Из ДокументФизЛицо Цикл
								Если ЗначениеЗаполнено(Элемент.Номер) И ЗначениеЗаполнено(Элемент.КемВыдан) И ?(Элемент.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ, ЗначениеЗаполнено(Элемент.Серия), Истина) Тогда
									ДокументФизЛицаСуществует = Истина;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;	
		
						ПолисСуществует = Ложь;
						Если ПолисыОМСДМС.Количество() > 0 Тогда
							Для Каждого Элемент Из ПолисыОМСДМС Цикл
								Если ЗначениеЗаполнено(Элемент.НомерПолиса) И ЗначениеЗаполнено(Элемент.СтраховаяКомпания.НаименованиеПолное) И ЗначениеЗаполнено(Элемент.СерияПолиса) Тогда
									ПолисСуществует = Истина;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
		
						Если ДокументФизЛицаСуществует Или ПолисСуществует Или МедецинскиеКарты.Количество() > 0 Тогда
			
						Запись.ЗаписатьНачалоЭлемента("d5p1:Documents");
						Если ДокументФизЛицо.Количество() > 0 Тогда
							Для Каждого ЭлМассива Из ДокументФизЛицо Цикл
								Если ЗначениеЗаполнено(ЭлМассива.Номер) И ЗначениеЗаполнено(ЭлМассива.КемВыдан) И ?(ЭлМассива.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ, ЗначениеЗаполнено(ЭлМассива.Серия), Истина) Тогда
							Запись.ЗаписатьНачалоЭлемента("d5p1:IdentityDocument");
						
								Запись.ЗаписатьНачалоЭлемента("d5p1:DocN");
								Запись.ЗаписатьТекст(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(ЭлМассива.Номер)));
								Запись.ЗаписатьКонецЭлемента();
						
								Если ЗначениеЗаполнено(ЭлМассива.Серия) Тогда
								Запись.ЗаписатьНачалоЭлемента("d5p1:DocS");
								Запись.ЗаписатьТекст(ЭлМассива.Серия);
								Запись.ЗаписатьКонецЭлемента();
								КонецЕсли;
						
								Запись.ЗаписатьНачалоЭлемента("d5p1:DocumentName");
								Запись.ЗаписатьТекст(ЭлМассива.ВидДокумента.Наименование);
								Запись.ЗаписатьКонецЭлемента();
						
								Если ЭлМассива.СрокДействия <> Дата(1,1,1) Тогда
								Запись.ЗаписатьНачалоЭлемента("d5p1:ExpiredDate");
								Запись.ЗаписатьТекст(Формат(ЭлМассива.СрокДействия, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
								Запись.ЗаписатьКонецЭлемента();
								КонецЕсли;
						
								Если ЭлМассива.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда
								Запись.ЗаписатьНачалоЭлемента("d5p1:IdDocumentType");
								Запись.ЗаписатьТекст("14");
								Запись.ЗаписатьКонецЭлемента();
								ИначеЕсли ЭлМассива.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СНИЛС Тогда
								Запись.ЗаписатьНачалоЭлемента("d5p1:IdDocumentType");
								Запись.ЗаписатьТекст("223");
								Запись.ЗаписатьКонецЭлемента();
								КонецЕсли;
						
								Если ЭлМассива.ДатаВыдачи <> Дата(1,1,1) Тогда
								Запись.ЗаписатьНачалоЭлемента("d5p1:IssuedDate");
								Запись.ЗаписатьТекст(Формат(ЭлМассива.ДатаВыдачи, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
								Запись.ЗаписатьКонецЭлемента();
								КонецЕсли;
						
								Запись.ЗаписатьНачалоЭлемента("d5p1:ProviderName");
								Запись.ЗаписатьТекст(ЭлМассива.КемВыдан);
								Запись.ЗаписатьКонецЭлемента();
						
							Запись.ЗаписатьКонецЭлемента();
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
			
						Если ПолисыОМСДМС.Количество() > 0 Тогда
							Для Каждого ЭлМассива Из ПолисыОМСДМС Цикл
								Если ЗначениеЗаполнено(ЭлМассива.НомерПолиса) И ЗначениеЗаполнено(ЭлМассива.СтраховаяКомпания.НаименованиеПолное) И ЗначениеЗаполнено(ЭлМассива.СерияПолиса) Тогда
							Запись.ЗаписатьНачалоЭлемента("d5p1:IdentityDocument");
						
								Запись.ЗаписатьНачалоЭлемента("d5p1:DocN");
								Запись.ЗаписатьТекст(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(ЭлМассива.НомерПолиса)));
								Запись.ЗаписатьКонецЭлемента();
						
								Запись.ЗаписатьНачалоЭлемента("d5p1:DocS");
								Запись.ЗаписатьТекст(ЭлМассива.СерияПолиса);
								Запись.ЗаписатьКонецЭлемента();
						
								Запись.ЗаписатьНачалоЭлемента("d5p1:DocumentName");
								Запись.ЗаписатьТекст(ЭлМассива.Наименование);
								Запись.ЗаписатьКонецЭлемента();
						
								Если ЭлМассива.ДатаОкончания <> Дата(1,1,1) Тогда
								Запись.ЗаписатьНачалоЭлемента("d5p1:ExpiredDate");
								Запись.ЗаписатьТекст(Формат(ЭлМассива.ДатаОкончания, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
								Запись.ЗаписатьКонецЭлемента();
								КонецЕсли;
						
								Запись.ЗаписатьНачалоЭлемента("d5p1:IdDocumentType");
								Если СтрДлина(ЭлМассива.НомерПолиса) = 6 Тогда
								Запись.ЗаписатьТекст("226");
								ИначеЕсли СтрДлина(ЭлМассива.НомерПолиса) = 16 Тогда
								Запись.ЗаписатьТекст("228");
								Иначе 
								Запись.ЗаписатьТекст("240");
								КонецЕсли;
								Запись.ЗаписатьКонецЭлемента();
						
								Если ЗначениеЗаполнено(ЭлМассива.СтраховаяКомпания.РеестровыйНомерОМС) Тогда 
								Запись.ЗаписатьНачалоЭлемента("d5p1:IdProvider");
								Запись.ЗаписатьТекст(ЭлМассива.СтраховаяКомпания.РеестровыйНомерОМС);
								Запись.ЗаписатьКонецЭлемента();
								КонецЕсли;
						
								Если ЭлМассива.ДанаНачала <> Дата(1,1,1) Тогда
								Запись.ЗаписатьНачалоЭлемента("d5p1:IssuedDate");
								Запись.ЗаписатьТекст(Формат(ЭлМассива.ДанаНачала, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
								Запись.ЗаписатьКонецЭлемента();
								КонецЕсли;
						
								Запись.ЗаписатьНачалоЭлемента("d5p1:ProviderName");
								Запись.ЗаписатьТекст(ЭлМассива.СтраховаяКомпания.НаименованиеПолное);
								Запись.ЗаписатьКонецЭлемента();
						
								Если ЭлМассива.ДанаНачала <> Дата(1,1,1) Тогда
								Запись.ЗаписатьНачалоЭлемента("d5p1:StartDate");
								Запись.ЗаписатьТекст(Формат(ЭлМассива.ДанаНачала, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
								Запись.ЗаписатьКонецЭлемента();
								КонецЕсли;
						
							Запись.ЗаписатьКонецЭлемента();
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
			
						Если МедецинскиеКарты.Количество() > 0 Тогда
							Для Каждого ЭлМассива Из МедецинскиеКарты Цикл
						
							Запись.ЗаписатьНачалоЭлемента("d5p1:IdentityDocument");
					
								Запись.ЗаписатьНачалоЭлемента("d5p1:DocN");
								Запись.ЗаписатьТекст(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(ЭлМассива.КодБезНулей)));
								Запись.ЗаписатьКонецЭлемента();
					
								Запись.ЗаписатьНачалоЭлемента("d5p1:DocumentName");
								Запись.ЗаписатьТекст(ЭлМассива.ВидМедицинскойКарты.Наименование);
								Запись.ЗаписатьКонецЭлемента();
					
								Если ЭлМассива.ДатаЗакрытия <> Дата(1,1,1) Тогда
								Запись.ЗаписатьНачалоЭлемента("d5p1:ExpiredDate");
								Запись.ЗаписатьТекст(Формат(ЭлМассива.ДатаЗакрытия, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
								Запись.ЗаписатьКонецЭлемента();
								КонецЕсли;
						
								Запись.ЗаписатьНачалоЭлемента("d5p1:IdDocumentType");
								Запись.ЗаписатьТекст("246");
								Запись.ЗаписатьКонецЭлемента();
					
								Если ЭлМассива.ДатаРегистрации <> Дата(1,1,1) Тогда
								Запись.ЗаписатьНачалоЭлемента("d5p1:IssuedDate");
								Запись.ЗаписатьТекст(Формат(ЭлМассива.ДатаРегистрации, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
								Запись.ЗаписатьКонецЭлемента();
								КонецЕсли;
					
								Запись.ЗаписатьНачалоЭлемента("d5p1:ProviderName");
								Запись.ЗаписатьТекст(ЗаконныйПредставитель.СтруктурнаяЕдиница.Наименование);
								Запись.ЗаписатьКонецЭлемента();
					
							Запись.ЗаписатьКонецЭлемента();
							КонецЦикла;
						КонецЕсли;
						Запись.ЗаписатьКонецЭлемента();
					КонецЕсли;
					
					///////////////////////////// Конец документы законного представителя /////////////////
		            Запись.ЗаписатьКонецЭлемента();
					
					РодствоЗаконногоПредставителя = РегистрыСведений.РодственныеСвязи.ОпределитьРодство(ПриемДляОтправки.Контрагент, ЗаконныйПредставитель);
					КодСтепениРодства = Справочники.СтепеньРодства.ПолучитьКодСтепениРодства(РодствоЗаконногоПредставителя);
		
					Запись.ЗаписатьНачалоЭлемента("d5p1:IdRelationType");
					Запись.ЗаписатьТекст(КодСтепениРодства);             
					Запись.ЗаписатьКонецЭлемента();
		
					Запись.ЗаписатьНачалоЭлемента("d5p1:UnderlyingDocument");
					Запись.ЗаписатьТекст("Реквизиты документа, удостоверяющие право представлять пациента");             
					Запись.ЗаписатьКонецЭлемента();
			
				Запись.ЗаписатьКонецЭлемента(); 
		
				КонецЕсли;
				///////////////////////////// Конец Законный представитель
				//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
				Запись.ЗаписатьНачалоЭлемента("d4p1:IdPatientMis");
				Запись.ЗаписатьТекст(Строка(ПриемДляОтправки.Контрагент.УникальныйИдентификатор()));   
				Запись.ЗаписатьКонецЭлемента();
	
				Запись.ЗаписатьНачалоЭлемента("d4p1:AdmissionCondition");
				Запись.ЗаписатьТекст("1");   
				Запись.ЗаписатьКонецЭлемента();
	
				Запись.ЗаписатьНачалоЭлемента("d4p1:CaseVisitType");
				Запись.ЗаписатьТекст(?(ПриемДляОтправки.ЭтоПервичныйПациентДляВрача, "1", "2"));   
				Запись.ЗаписатьКонецЭлемента();
	
				Запись.ЗаписатьНачалоЭлемента("d4p1:IdCasePurpose");
				Запись.ЗаписатьТекст("12");   
				Запись.ЗаписатьКонецЭлемента();
	
				Запись.ЗаписатьНачалоЭлемента("d4p1:IdCaseType");
				Запись.ЗаписатьТекст("2");   
				Запись.ЗаписатьКонецЭлемента();
	
				// Запись.ЗаписатьНачалоЭлемента("d4p1:IdAmbResult");
				// Запись.ЗаписатьТекст("4");   
				// Запись.ЗаписатьКонецЭлемента();
	   	
				Запись.ЗаписатьНачалоЭлемента("d4p1:IsActive");
				Запись.ЗаписатьТекст("true");   
				Запись.ЗаписатьКонецЭлемента();
		
				///////////////////////////////////////////////// Эпизод медицинского обслуживания /////////////////////////////////////////////////////
				Запись.ЗаписатьНачалоЭлемента("d4p1:Steps");
				Запись.ЗаписатьСоответствиеПространстваИмен("d5p1", "http://schemas.datacontract.org/2004/07/N3.EMK.Dto.Step");
	
					Запись.ЗаписатьНачалоЭлемента("d5p1:StepAmb");
	
						Запись.ЗаписатьНачалоЭлемента("d5p1:DateStart");
						Запись.ЗаписатьТекст(Формат(ПриемДляОтправки.ВремяНачалаПриема, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
						Запись.ЗаписатьКонецЭлемента();
	
						Запись.ЗаписатьНачалоЭлемента("d5p1:DateEnd");
						Запись.ЗаписатьТекст(Формат(ПриемДляОтправки.ВремяОкончанияПриема, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
						Запись.ЗаписатьКонецЭлемента();
	
						Запись.ЗаписатьНачалоЭлемента("d5p1:IdPaymentType");
						Если ЗначениеЗаполнено(ПриемДляОтправки.ПолисМедСтрахования) Тогда
							Если ПриемДляОтправки.ПолисМедСтрахования.ТипПолиса = Перечисления.ТипыПолиса.ОбязательноеМедицинскоеСтрахование Тогда
						Запись.ЗаписатьТекст("1");
							Иначе
						Запись.ЗаписатьТекст("4");
						КонецЕсли;
							Иначе
						Запись.ЗаписатьТекст("5");
						КонецЕсли;
						Запись.ЗаписатьКонецЭлемента();
			
						Запись.ЗаписатьНачалоЭлемента("d5p1:Doctor");
						Запись.ЗаписатьСоответствиеПространстваИмен("d7p1", "http://schemas.datacontract.org/2004/07/N3.EMK.Dto");
	
							Запись.ЗаписатьНачалоЭлемента("d7p1:Person");
	
								Запись.ЗаписатьНачалоЭлемента("d7p1:HumanName");
	
									Запись.ЗаписатьНачалоЭлемента("d7p1:GivenName");
									Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Имя));
									Запись.ЗаписатьКонецЭлемента();
			
									Если ЗначениеЗаполнено(ПриемДляОтправки.Сотрудник.Отчество) Тогда
									Запись.ЗаписатьНачалоЭлемента("d7p1:MiddleName");
									Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Отчество));
									Запись.ЗаписатьКонецЭлемента();
									КонецЕсли;
			
									Запись.ЗаписатьНачалоЭлемента("d7p1:FamilyName");
									Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Фамилия));
									Запись.ЗаписатьКонецЭлемента();
		
								Запись.ЗаписатьКонецЭлемента();
		
								Если ЗначениеЗаполнено(ПриемДляОтправки.Сотрудник.ДатаРождения) Тогда
								Запись.ЗаписатьНачалоЭлемента("d7p1:Birthdate");
								Запись.ЗаписатьТекст(Формат(ПриемДляОтправки.Сотрудник.ДатаРождения, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
								Запись.ЗаписатьКонецЭлемента();
								КонецЕсли;
	
								Запись.ЗаписатьНачалоЭлемента("d7p1:IdPersonMis");
								Запись.ЗаписатьТекст(Строка(ПриемДляОтправки.Сотрудник.УникальныйИдентификатор()));
								Запись.ЗаписатьКонецЭлемента();
			
								// Документы врача
	
								Если ДокументФизЛицаСуществует Тогда
		
								Запись.ЗаписатьНачалоЭлемента("d7p1:Documents");
									Если ДокументФизЛицо.Количество() > 0 Тогда
										Для Каждого ЭлМассива Из ДокументФизЛицо Цикл
											Если ЗначениеЗаполнено(ЭлМассива.Номер) И ЭлМассива.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СНИЛС Тогда
									Запись.ЗаписатьНачалоЭлемента("d7p1:IdentityDocument");
							
										Запись.ЗаписатьНачалоЭлемента("d7p1:DocN");
										Запись.ЗаписатьТекст(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(ЭлМассива.Номер)));
										Запись.ЗаписатьКонецЭлемента();
							
										Запись.ЗаписатьНачалоЭлемента("d7p1:IdDocumentType");
										Запись.ЗаписатьТекст("223");
										Запись.ЗаписатьКонецЭлемента();
							
										Если ЭлМассива.ДатаВыдачи <> Дата(1,1,1) Тогда
										Запись.ЗаписатьНачалоЭлемента("d7p1:IssuedDate");
										Запись.ЗаписатьТекст(Формат(ЭлМассива.ДатаВыдачи, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
										Запись.ЗаписатьКонецЭлемента();
										КонецЕсли;
							
										Запись.ЗаписатьНачалоЭлемента("d7p1:ProviderName");
										Запись.ЗаписатьТекст(ЭлМассива.КемВыдан);
										Запись.ЗаписатьКонецЭлемента();
							
									Запись.ЗаписатьКонецЭлемента();
											КонецЕсли;
										КонецЦикла;
									КонецЕсли; 
								Запись.ЗаписатьКонецЭлемента();
								КонецЕсли;
									
								// Конец Документы сотрудника
	
							Запись.ЗаписатьКонецЭлемента();
	
							Запись.ЗаписатьНачалоЭлемента("d7p1:IdLpu");
							Запись.ЗаписатьТекст(idLPU);
							Запись.ЗаписатьКонецЭлемента();
			
							Запись.ЗаписатьНачалоЭлемента("d7p1:IdSpeciality");
							Запись.ЗаписатьТекст(Специальность);
							Запись.ЗаписатьКонецЭлемента();
			
							Запись.ЗаписатьНачалоЭлемента("d7p1:IdPosition");
							Запись.ЗаписатьТекст(ПриемДляОтправки.Сотрудник.Должность.ДолжностьПоКлассификаторуИЭМК.КодОИД);
							Запись.ЗаписатьКонецЭлемента();
			
						Запись.ЗаписатьКонецЭлемента();
			
						Запись.ЗаписатьНачалоЭлемента("d5p1:IdStepMis");
						Запись.ЗаписатьТекст(Строка(ПриемДляОтправки.УникальныйИдентификатор()));
						Запись.ЗаписатьКонецЭлемента();
			
						Запись.ЗаписатьНачалоЭлемента("d5p1:IdVisitPlace");
						Запись.ЗаписатьТекст("1");
						Запись.ЗаписатьКонецЭлемента();
			
						Запись.ЗаписатьНачалоЭлемента("d5p1:IdVisitPurpose");
						Запись.ЗаписатьТекст("1");
						Запись.ЗаписатьКонецЭлемента();
			
						///////////////////////////////////////////////// Медецинские записи /////////////////////////////////////////////////////
						Запись.ЗаписатьНачалоЭлемента("d5p1:MedRecords");
						Запись.ЗаписатьСоответствиеПространстваИмен("d6p1", "http://schemas.datacontract.org/2004/07/N3.EMK.Dto.MedRec");
	
						МКБ10 = ОбследованиеПациента.Найти("Диагноз").КодМКБ10;
						КодПоМКБ10 = УстановитьКодПоМКБ10(МКБ10);
						МассивКомментариев = СтроковыеФункцииКлиентСерверСтоматология.РазложитьСтрокуВМассивПодстрок(ОбследованиеПациента.Найти("Диагноз").РеквизитЗначение, ";");
						НомерДиагноза = 0;
						Для Каждого ЭлементМКБ Из КодПоМКБ10 Цикл
						///////////////////////////////  Диагнозы ////////////////////////////////
							Запись.ЗаписатьНачалоЭлемента("d6p1:MedRecord");
							Запись.ЗаписатьСоответствиеПространстваИмен("d7p1", "http://schemas.datacontract.org/2004/07/N3.EMK.Dto.MedRec.Diag");
							Запись.ЗаписатьАтрибут("i:type", "d7p1:ClinicMainDiagnosis");
		
								Запись.ЗаписатьНачалоЭлемента("d7p1:DiagnosisInfo");
		
									// Запись.ЗаписатьНачалоЭлемента("d7p1:IdDiseaseType");     // Классификатор характера заболевания Острое?
									// Запись.ЗаписатьТекст("1");
									// Запись.ЗаписатьКонецЭлемента();
		        		
									Запись.ЗаписатьНачалоЭлемента("d7p1:DiagnosedDate");     
									Запись.ЗаписатьТекст(Формат(ПриемДляОтправки.ВремяНачалаПриема, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
									Запись.ЗаписатьКонецЭлемента();
		
									Запись.ЗаписатьНачалоЭлемента("d7p1:IdDiagnosisType");
									Запись.ЗаписатьТекст("1");
									Запись.ЗаписатьКонецЭлемента();
		
									Запись.ЗаписатьНачалоЭлемента("d7p1:Comment");
									Запись.ЗаписатьТекст(Лев(МассивКомментариев[НомерДиагноза], 999));
									Запись.ЗаписатьКонецЭлемента();
									НомерДиагноза = НомерДиагноза + 1;
									// Запись.ЗаписатьНачалоЭлемента("d7p1:DiagnosisChangeReason");
									// Запись.ЗаписатьТекст("1");
									// Запись.ЗаписатьКонецЭлемента();
		
									Запись.ЗаписатьНачалоЭлемента("d7p1:DiagnosisStage");
									Запись.ЗаписатьТекст("3");
									Запись.ЗаписатьКонецЭлемента();
		
									Запись.ЗаписатьНачалоЭлемента("d7p1:Params");
									Запись.ЗаписатьАтрибут("i:nil", "true");
									Запись.ЗаписатьКонецЭлемента(); 
		
									Запись.ЗаписатьНачалоЭлемента("d7p1:MkbCode");
									Запись.ЗаписатьТекст(ЭлементМКБ);
									Запись.ЗаписатьКонецЭлемента();		
		
								Запись.ЗаписатьКонецЭлемента();
		
								Запись.ЗаписатьНачалоЭлемента("d7p1:Doctor");
								Запись.ЗаписатьСоответствиеПространстваИмен("d8p1", "http://schemas.datacontract.org/2004/07/N3.EMK.Dto");
		        		
									Запись.ЗаписатьНачалоЭлемента("d8p1:Person");
		
										Запись.ЗаписатьНачалоЭлемента("d8p1:HumanName");
		
											Запись.ЗаписатьНачалоЭлемента("d8p1:GivenName");
											Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Имя));
											Запись.ЗаписатьКонецЭлемента();
		
											Если ЗначениеЗаполнено(ПриемДляОтправки.Сотрудник.Отчество) Тогда
											Запись.ЗаписатьНачалоЭлемента("d8p1:MiddleName");
											Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Отчество));
											Запись.ЗаписатьКонецЭлемента();
											КонецЕсли;
		
											Запись.ЗаписатьНачалоЭлемента("d8p1:FamilyName");
											Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Фамилия));
											Запись.ЗаписатьКонецЭлемента();
		
										Запись.ЗаписатьКонецЭлемента();
		
										Если ЗначениеЗаполнено(ПриемДляОтправки.Сотрудник.ДатаРождения) Тогда
										Запись.ЗаписатьНачалоЭлемента("d8p1:Birthdate");
										Запись.ЗаписатьТекст(Формат(ПриемДляОтправки.Сотрудник.ДатаРождения, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
										Запись.ЗаписатьКонецЭлемента();
										КонецЕсли;
		        	
										Запись.ЗаписатьНачалоЭлемента("d8p1:IdPersonMis");
										Запись.ЗаписатьТекст(Строка(ПриемДляОтправки.Сотрудник.УникальныйИдентификатор()));
										Запись.ЗаписатьКонецЭлемента();
		
										// Документы врача
		
										Если ДокументФизЛицаСуществует Тогда
			
										Запись.ЗаписатьНачалоЭлемента("d8p1:Documents");
											Если ДокументФизЛицо.Количество() > 0 Тогда
												Для Каждого ЭлМассива Из ДокументФизЛицо Цикл
													Если ЗначениеЗаполнено(ЭлМассива.Номер) И ЭлМассива.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СНИЛС Тогда
											Запись.ЗаписатьНачалоЭлемента("d8p1:IdentityDocument");
								
												Запись.ЗаписатьНачалоЭлемента("d8p1:DocN");
												Запись.ЗаписатьТекст(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(ЭлМассива.Номер)));
												Запись.ЗаписатьКонецЭлемента();
								
												Запись.ЗаписатьНачалоЭлемента("d8p1:IdDocumentType");
												Запись.ЗаписатьТекст("223");
												Запись.ЗаписатьКонецЭлемента();
								
												Если ЭлМассива.ДатаВыдачи <> Дата(1,1,1) Тогда
												Запись.ЗаписатьНачалоЭлемента("d8p1:IssuedDate");
												Запись.ЗаписатьТекст(Формат(ЭлМассива.ДатаВыдачи, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
												Запись.ЗаписатьКонецЭлемента();
												КонецЕсли;
								
												Запись.ЗаписатьНачалоЭлемента("d8p1:ProviderName");
												Запись.ЗаписатьТекст(ЭлМассива.КемВыдан);
												Запись.ЗаписатьКонецЭлемента();
								
											Запись.ЗаписатьКонецЭлемента();
													КонецЕсли;
												КонецЦикла;
											КонецЕсли; 
										Запись.ЗаписатьКонецЭлемента();
										КонецЕсли;
				
									// Конец Документы сотрудника
				
									Запись.ЗаписатьКонецЭлемента();
				
									Запись.ЗаписатьНачалоЭлемента("d8p1:IdLpu");
									Запись.ЗаписатьТекст(idLPU);
									Запись.ЗаписатьКонецЭлемента();
				
									Запись.ЗаписатьНачалоЭлемента("d8p1:IdSpeciality");
									Запись.ЗаписатьТекст(Специальность);
									Запись.ЗаписатьКонецЭлемента();
				
									Запись.ЗаписатьНачалоЭлемента("d8p1:IdPosition");
									Запись.ЗаписатьТекст(ПриемДляОтправки.Сотрудник.Должность.ДолжностьПоКлассификаторуИЭМК.КодОИД);
									Запись.ЗаписатьКонецЭлемента();
				
								Запись.ЗаписатьКонецЭлемента();
			
							Запись.ЗаписатьКонецЭлемента();
							
			            Прервать; // Передается только 1 диагноз
						
						КонецЦикла;
						
						/////////////////////////////////////////// Подписываем Документ /////////////////////////////////////////////////////
						    Если ПациентИмеетСнНИЛС Тогда
							Запись.ЗаписатьНачалоЭлемента("d6p1:MedRecord");
							Запись.ЗаписатьСоответствиеПространстваИмен("d7p1", "http://schemas.datacontract.org/2004/07/N3.EMK.Dto.MedRec.MedDoc");
							Запись.ЗаписатьАтрибут("i:type", "d7p1:ConsultNote");

								Запись.ЗаписатьНачалоЭлемента("d7p1:Attachments");
								
									Запись.ЗаписатьНачалоЭлемента("d7p1:MedDocumentDto.DocumentAttachment");
									
										Если ЗначениеЗаполнено(ПодписьОрганизации) Тогда
										Запись.ЗаписатьНачалоЭлемента("d7p1:OrganizationSign");
										Запись.ЗаписатьТекст(ПодписьОрганизации);
										Запись.ЗаписатьКонецЭлемента();                 
										КонецЕсли;
								
										Запись.ЗаписатьНачалоЭлемента("d7p1:PersonalSigns");
										
											Запись.ЗаписатьНачалоЭлемента("d7p1:MedDocumentDto.PersonalSign");
											
												Если ЗначениеЗаполнено(ПодписьСотрудника) Тогда
												Запись.ЗаписатьНачалоЭлемента("d7p1:Sign");
												Запись.ЗаписатьТекст(ПодписьСотрудника);
												Запись.ЗаписатьКонецЭлемента();                
												КонецЕсли;
												
												Запись.ЗаписатьНачалоЭлемента("d7p1:Doctor");
												Запись.ЗаписатьСоответствиеПространстваИмен("d8p1", "http://schemas.datacontract.org/2004/07/N3.EMK.Dto");
		        		
													Запись.ЗаписатьНачалоЭлемента("d8p1:Person");
		
														Запись.ЗаписатьНачалоЭлемента("d8p1:HumanName");
		
															Запись.ЗаписатьНачалоЭлемента("d8p1:GivenName");
															Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Имя));
															Запись.ЗаписатьКонецЭлемента();
		
															Если ЗначениеЗаполнено(ПриемДляОтправки.Сотрудник.Отчество) Тогда
															Запись.ЗаписатьНачалоЭлемента("d8p1:MiddleName");
															Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Отчество));
															Запись.ЗаписатьКонецЭлемента();
															КонецЕсли;
		
															Запись.ЗаписатьНачалоЭлемента("d8p1:FamilyName");
															Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Фамилия));
															Запись.ЗаписатьКонецЭлемента();
		
														Запись.ЗаписатьКонецЭлемента();
		
														Если ЗначениеЗаполнено(ПриемДляОтправки.Сотрудник.ДатаРождения) Тогда
														Запись.ЗаписатьНачалоЭлемента("d8p1:Birthdate");
														Запись.ЗаписатьТекст(Формат(ПриемДляОтправки.Сотрудник.ДатаРождения, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
														Запись.ЗаписатьКонецЭлемента();
														КонецЕсли;
		        	
														Запись.ЗаписатьНачалоЭлемента("d8p1:IdPersonMis");
														Запись.ЗаписатьТекст(Строка(ПриемДляОтправки.Сотрудник.УникальныйИдентификатор()));
														Запись.ЗаписатьКонецЭлемента();
		
														// Документы врача
		
														Если ДокументФизЛицаСуществует Тогда
			
														Запись.ЗаписатьНачалоЭлемента("d8p1:Documents");
															Если ДокументФизЛицо.Количество() > 0 Тогда
																Для Каждого ЭлМассива Из ДокументФизЛицо Цикл
																	Если ЗначениеЗаполнено(ЭлМассива.Номер) И ЭлМассива.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СНИЛС Тогда
															Запись.ЗаписатьНачалоЭлемента("d8p1:IdentityDocument");
								
																Запись.ЗаписатьНачалоЭлемента("d8p1:DocN");
																Запись.ЗаписатьТекст(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(ЭлМассива.Номер)));
																Запись.ЗаписатьКонецЭлемента();
								
																Запись.ЗаписатьНачалоЭлемента("d8p1:IdDocumentType");
																Запись.ЗаписатьТекст("223");
																Запись.ЗаписатьКонецЭлемента();
								
																Если ЭлМассива.ДатаВыдачи <> Дата(1,1,1) Тогда
																Запись.ЗаписатьНачалоЭлемента("d8p1:IssuedDate");
																Запись.ЗаписатьТекст(Формат(ЭлМассива.ДатаВыдачи, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
																Запись.ЗаписатьКонецЭлемента();
																КонецЕсли;
								
																Запись.ЗаписатьНачалоЭлемента("d8p1:ProviderName");
																Запись.ЗаписатьТекст(ЭлМассива.КемВыдан);
																Запись.ЗаписатьКонецЭлемента();
								
															Запись.ЗаписатьКонецЭлемента();
																	КонецЕсли;
																КонецЦикла;
															КонецЕсли; 
														Запись.ЗаписатьКонецЭлемента();
														КонецЕсли;
																		
													// Конец Документы сотрудника
				
													Запись.ЗаписатьКонецЭлемента();
				        			
													Запись.ЗаписатьНачалоЭлемента("d8p1:IdLpu");
													Запись.ЗаписатьТекст(idLPU);
													Запись.ЗаписатьКонецЭлемента();
				   					
													Запись.ЗаписатьНачалоЭлемента("d8p1:IdSpeciality");
													Запись.ЗаписатьТекст(Специальность);
													Запись.ЗаписатьКонецЭлемента();
				
													Запись.ЗаписатьНачалоЭлемента("d8p1:IdPosition");
													Запись.ЗаписатьТекст(ПриемДляОтправки.Сотрудник.Должность.ДолжностьПоКлассификаторуИЭМК.КодОИД);
													Запись.ЗаписатьКонецЭлемента();
				
												Запись.ЗаписатьКонецЭлемента(); 
												                   								
											Запись.ЗаписатьКонецЭлемента();	
										
										Запись.ЗаписатьКонецЭлемента();
										
									Запись.ЗаписатьКонецЭлемента();
									
								Запись.ЗаписатьКонецЭлемента();
								
								Запись.ЗаписатьНачалоЭлемента("d7p1:CreationDate");
								Запись.ЗаписатьТекст(Формат(ПриемДляОтправки.ВремяОкончанияПриема, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
								Запись.ЗаписатьКонецЭлемента();  
								
								Запись.ЗаписатьНачалоЭлемента("d7p1:Header");
								Запись.ЗаписатьТекст(Строка(ПриемДляОтправки));
								Запись.ЗаписатьКонецЭлемента();  
								
								Запись.ЗаписатьНачалоЭлемента("d7p1:IdDocumentMis");
								Запись.ЗаписатьТекст(Строка(ПриемДляОтправки.УникальныйИдентификатор()));
								Запись.ЗаписатьКонецЭлемента();

							Запись.ЗаписатьКонецЭлемента();
							КонецЕсли;
						//////////////////////////////////////////////// Мед документы Лабораторные исследования ///////////////////////////////
	
						ДанныеРентгеновскихЛабораторныхИсследований = ОбследованиеПациента.Найти("ДанныеРентгеновскихЛабораторныхИсследований");
	
						Если ЗначениеЗаполнено(ДанныеРентгеновскихЛабораторныхИсследований) Тогда
		
							Запись.ЗаписатьНачалоЭлемента("d6p1:MedRecord");
							Запись.ЗаписатьСоответствиеПространстваИмен("d7p1", "http://schemas.datacontract.org/2004/07/N3.EMK.Dto.MedRec.MedDoc");
							Запись.ЗаписатьАтрибут("i:type", "d7p1:LaboratoryReport");
		
								Запись.ЗаписатьНачалоЭлемента("d7p1:Author");
								Запись.ЗаписатьСоответствиеПространстваИмен("d8p1", "http://schemas.datacontract.org/2004/07/N3.EMK.Dto");
		
									Запись.ЗаписатьНачалоЭлемента("d8p1:Person");
		
										Запись.ЗаписатьНачалоЭлемента("d8p1:HumanName");
		
											Запись.ЗаписатьНачалоЭлемента("d8p1:GivenName");
											Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Имя));
											Запись.ЗаписатьКонецЭлемента();
		
											Если ЗначениеЗаполнено(ПриемДляОтправки.Сотрудник.Отчество) Тогда 
											Запись.ЗаписатьНачалоЭлемента("d8p1:MiddleName");
											Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Отчество));
											Запись.ЗаписатьКонецЭлемента();
											КонецЕсли;
		
											Запись.ЗаписатьНачалоЭлемента("d8p1:FamilyName");
											Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Фамилия));
											Запись.ЗаписатьКонецЭлемента();
		        	
										Запись.ЗаписатьКонецЭлемента();
		
										Если ЗначениеЗаполнено(ПриемДляОтправки.Сотрудник.ДатаРождения) Тогда
										Запись.ЗаписатьНачалоЭлемента("d8p1:Birthdate");
										Запись.ЗаписатьТекст(Формат(ПриемДляОтправки.Сотрудник.ДатаРождения, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
										Запись.ЗаписатьКонецЭлемента();
										КонецЕсли;
		
										Запись.ЗаписатьНачалоЭлемента("d8p1:IdPersonMis");
										Запись.ЗаписатьТекст(Строка(ПриемДляОтправки.Сотрудник.УникальныйИдентификатор()));
										Запись.ЗаписатьКонецЭлемента();
		    		
										// Документы врача
		
										Если ДокументФизЛицаСуществует Тогда
			
										Запись.ЗаписатьНачалоЭлемента("d8p1:Documents");
											Если ДокументФизЛицо.Количество() > 0 Тогда
												Для Каждого ЭлМассива Из ДокументФизЛицо Цикл
													Если ЗначениеЗаполнено(ЭлМассива.Номер) И ЭлМассива.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СНИЛС Тогда
											Запись.ЗаписатьНачалоЭлемента("d8p1:IdentityDocument");
								
												Запись.ЗаписатьНачалоЭлемента("d8p1:DocN");
												Запись.ЗаписатьТекст(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(ЭлМассива.Номер)));
												Запись.ЗаписатьКонецЭлемента();
							
												Запись.ЗаписатьНачалоЭлемента("d8p1:IdDocumentType");
												Запись.ЗаписатьТекст("223");
												Запись.ЗаписатьКонецЭлемента();
							
												Если ЭлМассива.ДатаВыдачи <> Дата(1,1,1) Тогда
												Запись.ЗаписатьНачалоЭлемента("d8p1:IssuedDate");
												Запись.ЗаписатьТекст(Формат(ЭлМассива.ДатаВыдачи, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
												Запись.ЗаписатьКонецЭлемента();
												КонецЕсли;
						
												Запись.ЗаписатьНачалоЭлемента("d8p1:ProviderName");
												Запись.ЗаписатьТекст(ЭлМассива.КемВыдан);
												Запись.ЗаписатьКонецЭлемента();
							
											Запись.ЗаписатьКонецЭлемента();
													КонецЕсли;
												КонецЦикла;
											КонецЕсли; 
										Запись.ЗаписатьКонецЭлемента();
										КонецЕсли;
												    		
										// Конец Документы сотрудника
		    		
									Запись.ЗаписатьКонецЭлемента();
		    		
									Запись.ЗаписатьНачалоЭлемента("d8p1:IdLpu");
									Запись.ЗаписатьТекст(idLPU);
									Запись.ЗаписатьКонецЭлемента();
		    		
									Запись.ЗаписатьНачалоЭлемента("d8p1:IdSpeciality");
									Запись.ЗаписатьТекст(Специальность);
									Запись.ЗаписатьКонецЭлемента();
		    		
									Запись.ЗаписатьНачалоЭлемента("d8p1:IdPosition");
									Запись.ЗаписатьТекст(ПриемДляОтправки.Сотрудник.Должность.ДолжностьПоКлассификаторуИЭМК.КодОИД);
									Запись.ЗаписатьКонецЭлемента();
		    		
								Запись.ЗаписатьКонецЭлемента();
		    		
								Запись.ЗаписатьНачалоЭлемента("d7p1:CreationDate");
								Запись.ЗаписатьТекст(Формат(ПриемДляОтправки.ВремяНачалаПриема, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
								Запись.ЗаписатьКонецЭлемента();
		    		
								Запись.ЗаписатьНачалоЭлемента("d7p1:Header");
								Запись.ЗаписатьТекст(Лев(ДанныеРентгеновскихЛабораторныхИсследований.РеквизитЗначение, 249));
								Запись.ЗаписатьКонецЭлемента();
		    		
								Запись.ЗаписатьНачалоЭлемента("d7p1:IdDocumentMis");
								Запись.ЗаписатьТекст(Строка(ПриемДляОтправки.УникальныйИдентификатор()));
								Запись.ЗаписатьКонецЭлемента();
		    		
								// Запись.ЗаписатьНачалоЭлемента("d7p1:IdMedDocumentType");                 //// ждем ответ иэмк почему не работает
								// Запись.ЗаписатьТекст("2");
								// Запись.ЗаписатьКонецЭлемента();
		    		
							Запись.ЗаписатьКонецЭлемента();
		    		
						КонецЕсли;
						/////////////////////////////////////////////////////// Оказанные услуги /////////////////////////////////////
						Для Каждого ЭлементЛечения Из ПриемДляОтправки.Лечение Цикл
		
							Если ЗначениеЗаполнено(ЭлементЛечения.Номенклатура.НоменклатураМедицинскихУслуг) Тогда
			
							Запись.ЗаписатьНачалоЭлемента("d6p1:MedRecord");
							Запись.ЗаписатьСоответствиеПространстваИмен("d6p1", "http://schemas.datacontract.org/2004/07/N3.EMK.Dto.MedRec");
							Запись.ЗаписатьАтрибут("i:type", "d6p1:Service");
			
								Запись.ЗаписатьНачалоЭлемента("d6p1:DateEnd");
								Запись.ЗаписатьТекст(Формат(ПриемДляОтправки.ВремяОкончанияПриема, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
								Запись.ЗаписатьКонецЭлемента();
				
								Запись.ЗаписатьНачалоЭлемента("d6p1:DateStart");
								Запись.ЗаписатьТекст(Формат(ПриемДляОтправки.ВремяНачалаПриема, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
								Запись.ЗаписатьКонецЭлемента();
						
								Запись.ЗаписатьНачалоЭлемента("d6p1:IdServiceType");
								КодНМУ = СтроковыеФункцииКлиентСерверСтоматология.ТранслитерацияРусАнгл(СокрЛП(ЭлементЛечения.Номенклатура.НоменклатураМедицинскихУслуг.Код));
								Если Лев(КодНМУ, 1) = "B" Тогда
									КодНМУ = Лев(КодНМУ, 11);
								Иначе
									КодНМУ = Лев(КодНМУ, 10);
								КонецЕсли;
								Запись.ЗаписатьТекст(КодНМУ);      
								Запись.ЗаписатьКонецЭлемента();
					
								Запись.ЗаписатьНачалоЭлемента("d6p1:Params");
								Запись.ЗаписатьАтрибут("i:nil", "true");
								Запись.ЗаписатьКонецЭлемента();
					
								Запись.ЗаписатьНачалоЭлемента("d6p1:PaymentInfo");
								Если ЭлементЛечения.Сумма > 0 Тогда
						
									Запись.ЗаписатьНачалоЭлемента("d6p1:HealthCareUnit");
									Запись.ЗаписатьТекст("9");
									Запись.ЗаписатьКонецЭлемента();
						
									Запись.ЗаписатьНачалоЭлемента("d6p1:IdPaymentType");
										Если ЗначениеЗаполнено(ПриемДляОтправки.ПолисМедСтрахования) Тогда
											Если ПриемДляОтправки.ПолисМедСтрахования.ТипПолиса = Перечисления.ТипыПолиса.ОбязательноеМедицинскоеСтрахование Тогда
									Запись.ЗаписатьТекст("1");
											Иначе
									Запись.ЗаписатьТекст("2");
											КонецЕсли;
										Иначе
									Запись.ЗаписатьТекст("4");
										КонецЕсли;
									Запись.ЗаписатьКонецЭлемента();
						
									Запись.ЗаписатьНачалоЭлемента("d6p1:PaymentState");
									Если ПриемДляОтправки.СуммаОплачено = ПриемДляОтправки.СуммаДокумента Тогда
									Запись.ЗаписатьТекст("1");
									ИначеЕсли ПриемДляОтправки.СуммаОплачено = 0 Тогда
									Запись.ЗаписатьТекст("0");
									Иначе
									Запись.ЗаписатьТекст("3");
									КонецЕсли;
									Запись.ЗаписатьКонецЭлемента();
						
									Запись.ЗаписатьНачалоЭлемента("d6p1:Quantity");
									Запись.ЗаписатьТекст(Строка(ЭлементЛечения.Количество));
									Запись.ЗаписатьКонецЭлемента();
						
									Запись.ЗаписатьНачалоЭлемента("d6p1:Tariff");
									Запись.ЗаписатьТекст(Формат(ЭлементЛечения.Цена,"ЧРД=.; ЧГ=0"));
									Запись.ЗаписатьКонецЭлемента();
						
								Иначе
								Запись.ЗаписатьАтрибут("i:nil", "true");
								КонецЕсли;
								Запись.ЗаписатьКонецЭлемента();
					
								Запись.ЗаписатьНачалоЭлемента("d6p1:Performer");
								Запись.ЗаписатьСоответствиеПространстваИмен("d7p1", "http://schemas.datacontract.org/2004/07/N3.EMK.Dto");
					
									Запись.ЗаписатьНачалоЭлемента("d7p1:Doctor");
					
										Запись.ЗаписатьНачалоЭлемента("d7p1:Person");
					
											Запись.ЗаписатьНачалоЭлемента("d7p1:HumanName");
					
												Запись.ЗаписатьНачалоЭлемента("d7p1:GivenName");
												Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Имя));
												Запись.ЗаписатьКонецЭлемента();
					
												Если ЗначениеЗаполнено(ПриемДляОтправки.Сотрудник.Отчество) Тогда 
												Запись.ЗаписатьНачалоЭлемента("d7p1:MiddleName");
												Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Отчество));
												Запись.ЗаписатьКонецЭлемента();
												КонецЕсли;
					
												Запись.ЗаписатьНачалоЭлемента("d7p1:FamilyName");
												Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Фамилия));
												Запись.ЗаписатьКонецЭлемента();
					
											Запись.ЗаписатьКонецЭлемента();
					
											Если ЗначениеЗаполнено(ПриемДляОтправки.Сотрудник.ДатаРождения) Тогда
											Запись.ЗаписатьНачалоЭлемента("d7p1:Birthdate");
											Запись.ЗаписатьТекст(Формат(ПриемДляОтправки.Сотрудник.ДатаРождения, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
											Запись.ЗаписатьКонецЭлемента();
											КонецЕсли;
					
											Запись.ЗаписатьНачалоЭлемента("d7p1:IdPersonMis");
											Запись.ЗаписатьТекст(Строка(ПриемДляОтправки.Сотрудник.УникальныйИдентификатор()));
											Запись.ЗаписатьКонецЭлемента();
					
											// Документы врача
					
											Если ДокументФизЛицаСуществует Тогда
						
											Запись.ЗаписатьНачалоЭлемента("d7p1:Documents");
												Если ДокументФизЛицо.Количество() > 0 Тогда
													Для Каждого ЭлМассива Из ДокументФизЛицо Цикл
														Если ЗначениеЗаполнено(ЭлМассива.Номер) И ЭлМассива.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СНИЛС Тогда
												Запись.ЗаписатьНачалоЭлемента("d7p1:IdentityDocument");
									
													Запись.ЗаписатьНачалоЭлемента("d7p1:DocN");
													Запись.ЗаписатьТекст(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(ЭлМассива.Номер)));
													Запись.ЗаписатьКонецЭлемента();
									
													Запись.ЗаписатьНачалоЭлемента("d7p1:IdDocumentType");
													Запись.ЗаписатьТекст("223");
													Запись.ЗаписатьКонецЭлемента();
								
													Если ЭлМассива.ДатаВыдачи <> Дата(1,1,1) Тогда
													Запись.ЗаписатьНачалоЭлемента("d7p1:IssuedDate");
													Запись.ЗаписатьТекст(Формат(ЭлМассива.ДатаВыдачи, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
													Запись.ЗаписатьКонецЭлемента();
													КонецЕсли;
									
													Запись.ЗаписатьНачалоЭлемента("d7p1:ProviderName");
													Запись.ЗаписатьТекст(ЭлМассива.КемВыдан);
													Запись.ЗаписатьКонецЭлемента();
									
												Запись.ЗаписатьКонецЭлемента();
														КонецЕсли;
													КонецЦикла;
												КонецЕсли;
											Запись.ЗаписатьКонецЭлемента();
											КонецЕсли;
																											
											// Конец Документы сотрудника
					
										Запись.ЗаписатьКонецЭлемента();
					
										Запись.ЗаписатьНачалоЭлемента("d7p1:IdLpu");
										Запись.ЗаписатьТекст(idLPU);
										Запись.ЗаписатьКонецЭлемента();
					
										Запись.ЗаписатьНачалоЭлемента("d7p1:IdSpeciality");
										Запись.ЗаписатьТекст(Специальность);
										Запись.ЗаписатьКонецЭлемента();
					
										Запись.ЗаписатьНачалоЭлемента("d7p1:IdPosition");
										Запись.ЗаписатьТекст(ПриемДляОтправки.Сотрудник.Должность.ДолжностьПоКлассификаторуИЭМК.КодОИД);
										Запись.ЗаписатьКонецЭлемента();
					
									Запись.ЗаписатьКонецЭлемента();
					
									Запись.ЗаписатьНачалоЭлемента("d7p1:IdRole");
									Запись.ЗаписатьТекст("4");   // Роль - Лечащий врач
									Запись.ЗаписатьКонецЭлемента();
					
								Запись.ЗаписатьКонецЭлемента();
					
								Запись.ЗаписатьНачалоЭлемента("d6p1:ServiceName");
								Запись.ЗаписатьТекст(ЭлементЛечения.Номенклатура.НаименованиеПолное);
								Запись.ЗаписатьКонецЭлемента();
					
							Запись.ЗаписатьКонецЭлемента();
					
							КонецЕсли;	
		    		
						КонецЦикла;
	        		
						Запись.ЗаписатьКонецЭлемента();
	        		
					Запись.ЗаписатьКонецЭлемента();

				Запись.ЗаписатьКонецЭлемента();
	
			///////////////////////////////////////// Данные Эпикриза ///////////////////////////////////////////////
	
				Эпикриз = ОбследованиеПациента.Найти("Эпикриз");
	
				Если ЗначениеЗаполнено(Эпикриз) И ЗначениеЗаполнено(Эпикриз.РеквизитЗначение) Тогда
		
				Запись.ЗаписатьНачалоЭлемента("d4p1:MedRecords");
				Запись.ЗаписатьСоответствиеПространстваИмен("d5p1", "http://schemas.datacontract.org/2004/07/N3.EMK.Dto.MedRec");
		
					Запись.ЗаписатьНачалоЭлемента("d5p1:MedRecord");
					Запись.ЗаписатьСоответствиеПространстваИмен("d6p1", "http://schemas.datacontract.org/2004/07/N3.EMK.Dto.MedRec.MedDoc");
					Запись.ЗаписатьАтрибут("i:type", "d6p1:DischargeSummary");
		
						Запись.ЗаписатьНачалоЭлемента("d6p1:Author");
						Запись.ЗаписатьСоответствиеПространстваИмен("d7p1", "http://schemas.datacontract.org/2004/07/N3.EMK.Dto");
		
							Запись.ЗаписатьНачалоЭлемента("d7p1:Person");
		
								Запись.ЗаписатьНачалоЭлемента("d7p1:HumanName");
		
									Запись.ЗаписатьНачалоЭлемента("d7p1:GivenName");
									Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Имя));
									Запись.ЗаписатьКонецЭлемента();
		
									Если ЗначениеЗаполнено(ПриемДляОтправки.Сотрудник.Отчество) Тогда 
									Запись.ЗаписатьНачалоЭлемента("d7p1:MiddleName");
									Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Отчество));
									Запись.ЗаписатьКонецЭлемента();
									КонецЕсли;
		
									Запись.ЗаписатьНачалоЭлемента("d7p1:FamilyName");
									Запись.ЗаписатьТекст(СокрЛП(ПриемДляОтправки.Сотрудник.Фамилия));
									Запись.ЗаписатьКонецЭлемента();
		
								Запись.ЗаписатьКонецЭлемента();
		
								Если ЗначениеЗаполнено(ПриемДляОтправки.Сотрудник.ДатаРождения) Тогда
								Запись.ЗаписатьНачалоЭлемента("d7p1:Birthdate");
								Запись.ЗаписатьТекст(Формат(ПриемДляОтправки.Сотрудник.ДатаРождения, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
								Запись.ЗаписатьКонецЭлемента();
								КонецЕсли;
		
								Запись.ЗаписатьНачалоЭлемента("d7p1:IdPersonMis");
								Запись.ЗаписатьТекст(Строка(ПриемДляОтправки.Сотрудник.УникальныйИдентификатор()));
								Запись.ЗаписатьКонецЭлемента();
		
								// Документы врача
		
								Если ДокументФизЛицаСуществует Тогда
					
								Запись.ЗаписатьНачалоЭлемента("d7p1:Documents");
									Если ДокументФизЛицо.Количество() > 0 Тогда
										Для Каждого ЭлМассива Из ДокументФизЛицо Цикл
											Если ЗначениеЗаполнено(ЭлМассива.Номер) И ЭлМассива.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СНИЛС Тогда
									Запись.ЗаписатьНачалоЭлемента("d7p1:IdentityDocument");
						
										Запись.ЗаписатьНачалоЭлемента("d7p1:DocN");
										Запись.ЗаписатьТекст(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(ЭлМассива.Номер)));
										Запись.ЗаписатьКонецЭлемента();
						
										Запись.ЗаписатьНачалоЭлемента("d7p1:IdDocumentType");
										Запись.ЗаписатьТекст("223");
										Запись.ЗаписатьКонецЭлемента();
						
										Если ЭлМассива.ДатаВыдачи <> Дата(1,1,1) Тогда
										Запись.ЗаписатьНачалоЭлемента("d7p1:IssuedDate");
										Запись.ЗаписатьТекст(Формат(ЭлМассива.ДатаВыдачи, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
										Запись.ЗаписатьКонецЭлемента();
										КонецЕсли;
						
										Запись.ЗаписатьНачалоЭлемента("d7p1:ProviderName");
										Запись.ЗаписатьТекст(ЭлМассива.КемВыдан);
										Запись.ЗаписатьКонецЭлемента();
						
									Запись.ЗаписатьКонецЭлемента();
											КонецЕсли;
										КонецЦикла;
									КонецЕсли;
								Запись.ЗаписатьКонецЭлемента();
								КонецЕсли;
										
								// Конец Документы сотрудника
		
							Запись.ЗаписатьКонецЭлемента();
		
							Запись.ЗаписатьНачалоЭлемента("d7p1:IdLpu");
							Запись.ЗаписатьТекст(idLPU);
							Запись.ЗаписатьКонецЭлемента();
		
							Запись.ЗаписатьНачалоЭлемента("d7p1:IdSpeciality");
							Запись.ЗаписатьТекст(Специальность);
							Запись.ЗаписатьКонецЭлемента();
		
							Запись.ЗаписатьНачалоЭлемента("d7p1:IdPosition");
							Запись.ЗаписатьТекст(ПриемДляОтправки.Сотрудник.Должность.ДолжностьПоКлассификаторуИЭМК.КодОИД);
							Запись.ЗаписатьКонецЭлемента();
		
						Запись.ЗаписатьКонецЭлемента();
		
						Запись.ЗаписатьНачалоЭлемента("d6p1:CreationDate");
						Запись.ЗаписатьТекст(Формат(ПриемДляОтправки.ВремяНачалаПриема, "ДФ=гггг-ММ-ддTЧЧ:мм:сс") + ЧасовойПоясБазы);
						Запись.ЗаписатьКонецЭлемента();
		
						Запись.ЗаписатьНачалоЭлемента("d6p1:Header");
						Запись.ЗаписатьТекст(Лев(Эпикриз.РеквизитЗначение, 249));
						Запись.ЗаписатьКонецЭлемента();
		
						Запись.ЗаписатьНачалоЭлемента("d6p1:IdDocumentMis");
						Запись.ЗаписатьТекст(Строка(ПриемДляОтправки.УникальныйИдентификатор()));
						Запись.ЗаписатьКонецЭлемента();
		
						// Запись.ЗаписатьНачалоЭлемента("d6p1:IdMedDocumentType");                /// вопрос отправлен в ИЭМК
						// Запись.ЗаписатьТекст("42");
						// Запись.ЗаписатьКонецЭлемента();
				
					Запись.ЗаписатьКонецЭлемента();
		
				Запись.ЗаписатьКонецЭлемента();	
		
				КонецЕсли;
	
			Запись.ЗаписатьКонецЭлемента();	
	
		Запись.ЗаписатьКонецЭлемента();  
	
	СтрокаXML = Запись.Закрыть();  
	
	СтрокаSOAP = "<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"">
	| <soapenv:Header/>
	| <soapenv:Body>
	|"
	+СтрокаXML+
	"
	| </soapenv:Body>
	|</soapenv:Envelope>";
	
	// Описываем заголовки HTTP-запроса
	
	//ПодписанныйSOAP = ПодписатьSOAP(СтрокаSOAP, ПриемДляОтправки.Организация, ПриемДляОтправки.Сотрудник);
	
	//ПодписанныйSOAPКонечный = ПодписатьSOAP(ПодписанныйSOAP, ПриемДляОтправки.Организация);
	
	Заголовки = Новый Соответствие;
	
	Заголовки.Вставить("Content-Type", "text/xml;charset=UTF-8");
	Если УидВИЭМКПривема = "" Тогда
		Заголовки.Вставить("SOAPAction", "http://tempuri.org/IEmkService/AddCase");
	Иначе
		Заголовки.Вставить("SOAPAction", "http://tempuri.org/IEmkService/UpdateCase");
	КонецЕсли;
	
	Если Демо Тогда
		АдресСтенда = "b2b-demo.n3health.ru";
	Иначе
		АдресСтенда = "b2b.n3health.ru";
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(АдресСтенда,,,,,5,Новый ЗащищенноеСоединениеOpenSSL()); 
	// Получаем текст корневой страницы через POST-запрос.
	
	HTTPЗапрос = Новый HTTPЗапрос("/emk/EmkService.svc", Заголовки);
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаSOAP);
	
	Попытка
		
		Результат = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
		
		Ответ = Результат.ПолучитьТелоКакСтроку();
		
		ЧтениеXML = Новый ЧтениеXML;	
		
		// Загрузить XML из строки
		ЧтениеXML.УстановитьСтроку(Ответ);	
		
		ПриемВИЭМК = Ложь;
		
		// Перебор узлов	
		Пока ЧтениеXML.Прочитать() Цикл
			
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				Если ЧтениеXML.ЛокальноеИмя = "AddCaseResponse" Тогда
					ПриемВИЭМК = Истина;
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		ЧтениеXML.Закрыть();
		
		Если ПриемВИЭМК Тогда
			УИДПриема = Строка(ПриемДляОтправки.УникальныйИдентификатор()); 
			УидВИЭМКПривема = ПроверитьПриемИЭМК(УИДПациентаВИЭМК, УИДПриема, guid, idLPU, Демо);
		КонецЕсли;
		
		РегистрыСведений.ЖурналОбменаИЭМК.ДобавитьЗапись(ПриемДляОтправки, Результат.КодСостояния, Ответ, УидВИЭМКПривема,Строка(ПриемДляОтправки.УникальныйИдентификатор()), КоличествоПопытокПодключения, ТекущаяДатаСеанса());
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке(); 
		Комментарий = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Создание пациента в ИЭМК.'",
		ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,,,
		Комментарий);
		
		РегистрыСведений.ЖурналОбменаИЭМК.ДобавитьЗапись(ПриемДляОтправки, "404", Комментарий, УидВИЭМКПривема, Строка(ПриемДляОтправки.УникальныйИдентификатор()), КоличествоПопытокПодключения, ТекущаяДатаСеанса());
		
	КонецПопытки;
	
КонецПроцедуры

// Процедура производит проверку приема в ИЭМК.
//
Функция ПроверитьПриемИЭМК(КонтрАгентДляОтправки, УИДПриема, guid, idLPU, Демо) Экспорт

	ПараметрыЗапроса = "{
	|""resourceType"": ""Parameters"",
	|""parameter"": [{
	|""name"": ""patients"",
	|""valueString"": """ + КонтрАгентДляОтправки  + """
	|},
	|{
	|""name"": ""count"",
	|""valueString"": 1
	|}
	|]
	|}";

	
// Описываем заголовки HTTP-запроса

	Если Демо Тогда
		АдресСтенда = "b2b-demo.n3health.ru";
	Иначе
		АдресСтенда = "b2b.n3health.ru";
	КонецЕсли;

	HTTPСоединение = Новый HTTPСоединение(АдресСтенда,,,,,5, Новый ЗащищенноеСоединениеOpenSSL());
	
	ЗаголовкиHTTP  = Новый Соответствие; 
	ЗаголовкиHTTP.Вставить("Content-Type","application/json");
	Авторизация = "N3 "+ guid;
	ЗаголовкиHTTP.Вставить("Authorization", Авторизация);
	
	HTTPЗапрос  = Новый HTTPЗапрос("/fhirproxy2/fhir/Encounter/_search", ЗаголовкиHTTP);	
	мДатаНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	HTTPЗапрос.УстановитьТелоИзСтроки(?(ЗначениеЗаполнено(ПараметрыЗапроса), ПараметрыЗапроса, ""));
	
	Попытка
		
		Запрос = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		мДатаКонца = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ВремяВыполненияЗапроса = (мДатаКонца - мДатаНачала) /1000;
		
		
		Ответ = Запрос.ПолучитьТелоКакСтроку();	
		
		ЧтениеXML = Новый ЧтениеXML;	
		
		// Загрузить XML из строки
		ЧтениеXML.УстановитьСтроку(Ответ);	
		
		УИДВПриеме = "";
		ЗакончитьЦикл = Ложь;
		
		ТипОтвета = Запрос.Заголовки.Получить("Content-Type");
		
		Если СтрНайти( ТипОтвета, "xml") > 0 Тогда 
			Пока ЧтениеXML.Прочитать() Цикл
				Если ЧтениеXML.КоличествоАтрибутов() > 0 Тогда
					Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
						// Обработка атрибута
						Если ЧтениеXML.Имя = "value" И Не ЕстьНеЦифры(ЧтениеXML.Значение) И ЧтениеXML.КонтекстПространствИмен.Глубина = 5 Тогда
							УИДВПриеме = ЧтениеXML.Значение;
						КонецЕсли;
						Если ЧтениеXML.Имя = "value" И ЧтениеXML.Значение = "days" Тогда   
							УИДВПриеме = "";
						КонецЕсли;
						Если ЧтениеXML.Имя = "value" И ЧтениеXML.Значение = УИДПриема Тогда
							ЗакончитьЦикл = Истина;
						КонецЕсли;
					КонецЦикла
				КонецЕсли;
				Если ЗакончитьЦикл Тогда 
					Прервать;
				КонецЕсли;                  
			КонецЦикла;
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке(); 
		Комментарий = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Проврка приема в ИЭМК.'",
		ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,,,
		Комментарий);
		
		Возврат "Ошибка:" + ИнформацияОбОшибке;
		
		
	КонецПопытки;

Возврат УИДВПриеме;

КонецФункции

// Функция определяет наличие не цифр в строке.
//
Функция ЕстьНеЦифры(Знач СтрокаПроверки) Экспорт


	Если ТипЗнч(СтрокаПроверки) <> Тип("Строка") Тогда
		Возврат Истина;
	КонецЕсли;
	
	СтрокаПроверки = СокрЛП(СтрокаПроверки);
	Длина = СтрДлина(СтрокаПроверки);
	
	Для а = 1 По Длина Цикл
		Если Найти("0123456789", Сред(СтрокаПроверки, а, 1)) = 0 Тогда
			Возврат Истина;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции 

// Функция устанавливает код диагноза по МКБ10.
//
Функция УстановитьКодПоМКБ10(МКБ10) Экспорт

	КодМКБ10 = СтроковыеФункцииКлиентСерверСтоматология.ТранслитерацияРусАнгл(МКБ10);
    КодМКБ10 = СтрЗаменить(КодМКБ10, " ", "");
	МассивМКБ = СтроковыеФункцииКлиентСерверСтоматология.РазложитьСтрокуВМассивПодстрок(КодМКБ10, ";");
	Макет = Справочники.Диагнозы.ПолучитьМакет("КлассификаторДиагнозовПоИЭМК");
	ОбластьТабДокумента = Макет.ПолучитьОбласть("МКБ");
	
	МассивМКБИЭМК = Новый Массив;
	
	Для Каждого Элемент Из МассивМКБ Цикл
		
		Строка = СтрЗаменить( Элемент, Символы.НПП, ""); 
		
		Если Сред(Строка, 2, 1) = "O" Тогда
			Строка = Сред(Строка, 1, 1) + "0" + Прав(Строка, СтрДлина(Строка) - 2);
		КонецЕсли;
		
		ЭлементНайден = Ложь;
		
		Для НомерСтроки = 1 По ОбластьТабДокумента.ВысотаТаблицы Цикл
			Ячейка = "R" + Формат(НомерСтроки, "ЧГ=0") + "C1";
			МКБ10 = Макет.Область(Ячейка).Текст;
			Если МКБ10 = Элемент Тогда
				МассивМКБИЭМК.Добавить(МКБ10);
				ЭлементНайден = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		////////////// Если не нашли полное соответствие ищем без последнего символа ////////////////////////////
		Если Не ЭлементНайден Тогда
			КодМКБ102Вар = Лев(Элемент, СтрДлина(Элемент) - 1);
			
			Для НомерСтроки = 1 По ОбластьТабДокумента.ВысотаТаблицы Цикл
				Ячейка = "R" + Формат(НомерСтроки, "ЧГ=0") + "C1";
				МКБ10 = Макет.Область(Ячейка).Текст;
				Если МКБ10 = КодМКБ102Вар Тогда
					МассивМКБИЭМК.Добавить(МКБ10);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивМКБИЭМК;
	
КонецФункции 

// Процедура - Проверка связи с классификатором должностей
//
Функция ПроверитьВСИЭМК(Сотрудник, Контрагент, Лечение) Экспорт
	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(,Перечисления.ТипыВнешнихСистем.ИЭМК, Истина);  
		
	Если Не ЗначениеЗаполнено(ВнешняяСистема) Или Контрагент.ТипКонтрагента <> Перечисления.ТипыКонтрагентов.Клиенты Тогда 
		Возврат "";
	КонецЕсли;

	// Если Прием.ВремяОкончанияПриема < Прием.ВремяНачалаПриема Тогда
	//	Возврат "9";
	// КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Сотрудник.Имя) Или Не ЗначениеЗаполнено(Сотрудник.Фамилия) Тогда
		Возврат "6";
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Контрагент.Имя) Или Не ЗначениеЗаполнено(Контрагент.Фамилия) Или Не ЗначениеЗаполнено(Контрагент.ДатаРожденияКлиента) Тогда
		Возврат "5";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сотрудник.Должность) И Не ЗначениеЗаполнено(Сотрудник.Должность.ДолжностьПоКлассификаторуИЭМК) Тогда
		Возврат "2";
	КонецЕсли;
	
	ЗаконныеПредставители = РегистрыСведений.РодственныеСвязи.РодственникиКлиента(Контрагент);
	ЗаконныйПредставитель = Неопределено;
	Если ЗаконныеПредставители.Количество() > 0 Тогда
		ЗаконныйПредставитель = ЗаконныеПредставители[0].Родственник;
		Если ЗначениеЗаполнено(ЗаконныйПредставитель) И Не ЗначениеЗаполнено(ЗаконныеПредставители[0].РеквизитыДокументаЗаконногоПредставителя) Тогда
			Возврат ЗаконныйПредставитель;
		КонецЕсли;
	КонецЕсли;
				
	Если ЗначениеЗаполнено(ЗаконныйПредставитель) 
		И (Не ЗначениеЗаполнено(ЗаконныйПредставитель.Имя) 
		Или Не ЗначениеЗаполнено(ЗаконныйПредставитель.Фамилия) 
		Или Не ЗначениеЗаполнено(ЗаконныйПредставитель.ДатаРожденияКлиента)) Тогда
			Возврат "8";
	КонецЕсли;
	
	СНИЛСПациента = РегистрыСведений.ДокументыФизическихЛиц.ДокументыУдостоверяющиеЛичностьФизлица(Контрагент, ТекущаяДатаСеанса(), Истина, Истина);
	
	//Если СНИЛСПациента.Количество() = 0 Тогда
	//	Возврат "10";
	//КонецЕсли;
	
	Если Сотрудник.СпецилазацииСотрудника.Количество() > 0 Тогда
		Для Каждого Элемент Из Сотрудник.СпецилазацииСотрудника Цикл
			Если Элемент.Основная И Не ЗначениеЗаполнено(Элемент.Специализация.СпециализацияПоКлассификаторуИЭМК) Тогда
				Возврат "4";
			ИначеЕсли Элемент.Основная И ЗначениеЗаполнено(Элемент.Специализация.СпециализацияПоКлассификаторуИЭМК) Тогда
				ТекстОшибки = "";
				Для Каждого Элемент Из Лечение Цикл
					КодВИЭМК = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Элемент.Номенклатура, "НоменклатураМедицинскихУслуг");
					Если Не ЗначениеЗаполнено(КодВИЭМК) Тогда
						ТекстОшибки = ТекстОшибки + "ИЭМК: У услуги: " + Строка(Элемент.Номенклатура) + " не заполнен реквизит НМУ (Номенклатура медецинских услуг). Данные не будут переданы в ИЭМК." + Символы.ПС;
					КонецЕсли;
				КонецЦикла;
				Если ЗначениеЗаполнено(ТекстОшибки) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
					Возврат "Ошибка";
				КонецЕсли;
				Возврат "";
			КонецЕсли;
		КонецЦикла;
		Возврат "3";
	Иначе
		Возврат "1";
	КонецЕсли;

КонецФункции        

Функция Подпись(Организация, Сотрудник = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СертификатыКлючейЭлектроннойПодписиИШифрования.Ссылка КАК Ссылка,
		|	СертификатыКлючейЭлектроннойПодписиИШифрования.Программа КАК Программа,
		|	СертификатыКлючейЭлектроннойПодписиИШифрования.ДанныеСертификата КАК ДанныеСертификата,
		|	СертификатыКлючейЭлектроннойПодписиИШифрования.ПарольСертификата КАК ПарольСертификата
		|ИЗ
		|	Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования КАК СертификатыКлючейЭлектроннойПодписиИШифрования
		|ГДЕ
		|	СертификатыКлючейЭлектроннойПодписиИШифрования.Организация = &Организация
		|	И СертификатыКлючейЭлектроннойПодписиИШифрования.Фамилия = &Фамилия";
		//|	И СертификатыКлючейЭлектроннойПодписиИШифрования.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		Запрос.УстановитьПараметр("Фамилия", Сотрудник.Фамилия); 
	Иначе
		Запрос.УстановитьПараметр("Фамилия", ""); 
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		
		ПараметрыСоздания = ЭлектроннаяПодписьСлужебный.ПараметрыСозданияМенеджераКриптографии();
		ПараметрыСоздания.Программа = Результат.Программа;
		ПараметрыСоздания.ОписаниеОшибки = Новый Структура;
		
		МенеджерКриптографии = ЭлектроннаяПодписьСлужебный.МенеджерКриптографии("Подписание", ПараметрыСоздания);
		
		Пароль = Результат.ПарольСертификата;
		
		Если ЗначениеЗаполнено(Пароль) Тогда
			МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = Пароль;		
		КонецЕсли;
		
		СертификатКриптографии = Новый СертификатКриптографии(Результат.ДанныеСертификата.Получить());
		
		ДанныеПодписи = МенеджерКриптографии.Подписать(СертификатКриптографии.Выгрузить(), СертификатКриптографии);
		Подпись = СтрЗаменить(СтрЗаменить(Base64Строка(ДанныеПодписи),Символы.ПС, ""), Символы.ВК, "");
		Возврат ?(ЗначениеЗаполнено(Подпись), Подпись, Неопределено);
				
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
