
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.МаксимальноеКоличествоСделокВКолонке = 15;
	
	ЭтотОбъект.ТекущийСотрудник				 = ПараметрыСеанса.ТекущийСотрудник;
	ЭтотОбъект.ТекущаяСтруктурнаяЕдиница	 = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	ЭтотОбъект.ЭтоПолноправныйПользователь	 = РольДоступна(Метаданные.Роли.ПолныеПрава);
	
	ЗаполнитьДоступныеВидыСделок();
	ИнициализироватьДанныеПредопределенногоВидаСделки();
	
	УстановитьОтображениеФильтраСтатусПациента(ЭтотОбъект);
	
	Если Параметры.Свойство("ПараметрыОтбора") И ЗначениеЗаполнено(Параметры.ПараметрыОтбора) Тогда
		ОбновитьМеханизмФильтрацииДанных(Параметры.ПараметрыОтбора, Истина);
	Иначе
		ИнициализироватьМеханизмФильтрацииДанных();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	// Запускаем обновление канбана раз в 10 минут.
	ПодключитьОбработчикОжидания("ОбновитьПредставлениеКанбана", 600, Ложь);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаОповещения".
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = ЭтотОбъект Тогда
		// Не обрабатываем оповещения, если они возникли на этой же форме.
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ОБНОВИТЬ_СВЕДЕНИЯ_ПО_СДЕЛКАМ" Тогда
		
		ОбработатьИзменениеСделки(Параметр);
		
	ИначеЕсли ИмяСобытия = "ДобавленаСделка" Тогда
		
		Если Параметр.ВидСделки = ЭтотОбъект.ВидСделки Тогда
			ОбработатьИзменениеСделки(Параметр.Сделка);
		КонецЕсли;
			
	ИначеЕсли ИмяСобытия = "ИзмененЭтапСделки" Тогда
		
		Если Параметр.ВидСделки = ЭтотОбъект.ВидСделки Тогда
			
			// Обновляем блок сделки только если он выведен на форму.
			БлокИзмененнойСделки = ПолучитьЭлементБлокаСделки(Параметр.Сделка);
			Если БлокИзмененнойСделки <> Неопределено Тогда
				ОбработатьИзменениеСделки(Параметр.Сделка);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ОбновитьЗадачуКанбан" И ЗначениеЗаполнено(Параметр) Тогда
		
		ОбновитьДанныеЗадач(Параметр);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ИзменитьВидСделки(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораВидаСделки", ЭтотОбъект);
	ПоказатьВыборИзМеню(ОписаниеОповещения, ЭтотОбъект.ДоступныеВидыСделок, Элементы.ИзменитьВидСделки);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ОткрытьСписок(Команда)
	
	ПерейтиВСписок();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ОбновитьКанбан(Команда)
	
	ОбновитьПредставлениеКанбана();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ОтборБезЗадач".
//
Процедура ОтборБезЗадач(Команда)
	
	ОбновитьОтборНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события команды "ОтборПросроченныхЗадач".
//
Процедура ОтборПросроченныхЗадач(Команда)
	
	ОбновитьОтборНаСервере(, Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ОтборСЗадачамиНаСегодня(Команда)
	
	ОбновитьОтборНаСервере(,, Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура СброситьОтборПоЗадачам(Команда)
	
	ОбновитьОтборНаСервере();
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик команды.
//
Процедура УстановитьФильтрПостоянные(Команда)
	
	СтатусПостоянный = ПредопределенноеЗначение("Перечисление.СтатусыКонтрагентов.Постоянный");
	
	ЭтотОбъект.ОтборСтатусПациента = ?(ЭтотОбъект.ОтборСтатусПациента = СтатусПостоянный, Неопределено, СтатусПостоянный);
	УстановитьОтображениеФильтраСтатусПациента(ЭтотОбъект);
	
	СформироватьКанбан();
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик команды.
//
Процедура УстановитьФильтрНовые(Команда)
	
	СтатусНовый = ПредопределенноеЗначение("Перечисление.СтатусыКонтрагентов.Первичный");
	
	ЭтотОбъект.ОтборСтатусПациента = ?(ЭтотОбъект.ОтборСтатусПациента = СтатусНовый, Неопределено, СтатусНовый);
	УстановитьОтображениеФильтраСтатусПациента(ЭтотОбъект);
	
	СформироватьКанбан();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "ДокументСформирован".
//
Процедура КанбанДокументСформирован(Элемент)
	
	ЭтотОбъект.ШиринаОкна = Элементы.Канбан.Документ.defaultView.innerWidth;
	ЭтотОбъект.ВысотаОкна = Элементы.Канбан.Документ.defaultView.innerHeight;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриНажатии".
//
Процедура КанбанПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СвернутыеМеню = СвернутьВсплывающиеМеню(ДанныеСобытия);
	
	Если ДанныеСобытия.Element.id = "eventSender" Тогда
		ОбработатьВызовСобытия(ДанныеСобытия.Element.dataset.eventName);
		
	ИначеЕсли ДанныеСобытия.Element.className = "phone-number" Тогда
		
		Если Не ЭтотОбъект.ТелефонияДоступна Тогда
			// Если нет доступа к телефонии - ничего не делаем при нажатии на номер.
			Возврат;
		КонецЕсли;
		
		ИдентификаторСделки = ДанныеСобытия.Element.closest(".item-col").id;
		ПредставлениеНомера = ДанныеСобытия.Element.innerText;
		СовершитьЗвонок(ИдентификаторСделки, ПредставлениеНомера);
			
	ИначеЕсли ДанныеСобытия.Element.className = "ico-chat" Тогда
		ИдентификаторКлиента = ДанныеСобытия.Element.closest(".item-col").querySelector(".client-name").id;
		ПерейтиКДиалогу(ИдентификаторКлиента);
			
	ИначеЕсли ДанныеСобытия.Element.className = "title-col" Тогда
		ИдентификаторСделки = ДанныеСобытия.Element.dataset.dealId;
		ОткрытьСделку(ИдентификаторСделки);
		
	ИначеЕсли ДанныеСобытия.Element.className = "client-name" Тогда
		ИдентификаторКлиента = ДанныеСобытия.Element.id;
		ОткрытьКлиента(ИдентификаторКлиента);
		
	ИначеЕсли ДанныеСобытия.Element.className = "doctor" Или ДанныеСобытия.Element.className = "manager" Тогда
		ИдентификаторСотрудника = ДанныеСобытия.Element.id;
		ОткрытьСотрудника(ИдентификаторСотрудника);
		
	ИначеЕсли ДанныеСобытия.Element.className = "button-create" Тогда
		СоздатьСделку();
		
	ИначеЕсли ДанныеСобытия.Element.className = "create-task" Тогда
		БлокСделки			 = ДанныеСобытия.Element.closest(".item-col");
		ИдентификаторСделки	 = БлокСделки.id;
		ИдентификаторКлиента = БлокСделки.querySelector(".client-name").id;
		
		СоздатьЗадачу(ИдентификаторСделки, ИдентификаторКлиента);
		
	ИначеЕсли ДанныеСобытия.Element.className = "current-tasks" Тогда
		
		ВсплывающееМенюЗадач = ДанныеСобытия.Element.parentElement.querySelector(".menu");
		
		Для Каждого Меню Из СвернутыеМеню Цикл
			
			// Повторные клик на кнопку открытия меню, не переоткрываем.
			Если Меню = ВсплывающееМенюЗадач Тогда
				Возврат;
			КонецЕсли;
			
		КонецЦикла;
		
		ВсплывающееМенюЗадач.style = Неопределено;
		ВсплывающееМенюЗадач.classList.toggle("active");
		
		КонтейнерЗадач = ВсплывающееМенюЗадач.children[0];
		
		ИдентификаторСделки		 = ДанныеСобытия.Element.closest(".item-col").id;
		КонтейнерЗадач.innerHTML = ПолучитьДанныеЗадач(ИдентификаторСделки);
		
		ИнвертироватьГоризонтально	 = (ЭтотОбъект.ШиринаОкна < ДанныеСобытия.Event.clientX + КонтейнерЗадач.clientWidth + 100);
		ИнвертироватьВертикально	 = (ЭтотОбъект.ВысотаОкна < ДанныеСобытия.Event.clientY + КонтейнерЗадач.clientHeight + 50);
		
		Если ИнвертироватьВертикально = Истина Тогда
			ВсплывающееМенюЗадач.style.bottom = 25;
		Иначе
			ВсплывающееМенюЗадач.style.top = 40;
		КонецЕсли;
		
		Если ИнвертироватьГоризонтально = Истина Тогда
			ВсплывающееМенюЗадач.style.right = 0;
		Иначе
			ВсплывающееМенюЗадач.style.left = 0;
		КонецЕсли;
		
	ИначеЕсли ДанныеСобытия.Element.className = "checkbox" Тогда
		ИдентификаторЗадачи = ДанныеСобытия.Element.closest(".container").id;
		ВыполнитьЗадачу(ИдентификаторЗадачи);
		
	ИначеЕсли СтрЧислоВхождений(ДанныеСобытия.Element.className, "show-all") Тогда
		ИдентификаторВидаСделки = ДанныеСобытия.Element.dataset.id;
		ПерейтиВСписок(ИдентификаторВидаСделки);
		
	ИначеЕсли ДанныеСобытия.Element.closest(".task-data") <> Неопределено Тогда
		ИдентификаторЗадачи = ДанныеСобытия.Element.closest(".container").id;
		ОткрытьЗадачу(ИдентификаторЗадачи);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
// Процедура, устанавливает отображение фильтров по задачам.
//
Процедура УстановитьОтображениеФильтровПоЗадачам(Форма, ОтборБезАктивности = Ложь, ОтборПросроченныхЗадач = Ложь, ОтборЗадачНаСегодня = Ложь)
	
	ФонАктивнойГруппы	 = Новый Цвет(218, 230, 244);
	ФонНеактивнойГруппы	 = Новый Цвет(255, 255, 255);
	
	Форма.Элементы.ГруппаБезЗадач.ЦветФона			 = ФонНеактивнойГруппы;
	Форма.Элементы.ГруппаЗадачиНаСегодня.ЦветФона	 = ФонНеактивнойГруппы;
	Форма.Элементы.ГруппаПросроченныеЗадачи.ЦветФона = ФонНеактивнойГруппы;
	
	Форма.Элементы.СброситьОтборБезЗадач.Видимость			 = Ложь;
	Форма.Элементы.СброситьОтборЗадачиНаСегодня.Видимость	 = Ложь;
	Форма.Элементы.СброситьОтборПросроченныеЗадачи.Видимость = Ложь;
	
	Если ОтборБезАктивности = Истина Тогда
		
		Форма.Элементы.ГруппаБезЗадач.ЦветФона			 = ФонАктивнойГруппы;
		Форма.Элементы.СброситьОтборБезЗадач.Видимость	 = Истина;
		
		Форма.ОтборПоЗадачам = 3;
		
	ИначеЕсли ОтборЗадачНаСегодня = Истина Тогда
		
		Форма.Элементы.ГруппаЗадачиНаСегодня.ЦветФона			 = ФонАктивнойГруппы;
		Форма.Элементы.СброситьОтборЗадачиНаСегодня.Видимость	 = Истина;
		
		Форма.ОтборПоЗадачам = 1;
		
	ИначеЕсли ОтборПросроченныхЗадач = Истина Тогда
		
		Форма.Элементы.ГруппаПросроченныеЗадачи.ЦветФона			 = ФонАктивнойГруппы;
		Форма.Элементы.СброситьОтборПросроченныеЗадачи.Видимость	 = Истина;
		
		Форма.ОтборПоЗадачам = 2;
		
	Иначе
		Форма.ОтборПоЗадачам = 0;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, открывает форму задачи.
//
Процедура ОткрытьЗадачу(ИдентификаторЗадачи)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИдентификаторЗадачи", ИдентификаторЗадачи);
	
	ОткрытьФорму("Задача.Взаимодействие.ФормаОбъекта", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура, устанавливает признак выполнения задачи.
//
Процедура ВыполнитьЗадачу(ИдентификаторЗадачи)
	
	СтруктураОтбора = ПолучитьСтруктуруЗначенийОтбораКлиент();
	
	РезультатОперации = ВыполнитьЗадачуНаСервере(ИдентификаторЗадачи, СтруктураОтбора);
	
	Если РезультатОперации.ВыполненоУспешно = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ОбновитьКоличествоСделокВБлоках(РезультатОперации.ДанныеКоличества);
	УстановитьЗаголовкиДополнительныхОтборов(ЭтотОбъект, СтруктураОтбора, РезультатОперации.ДанныеКоличестваПоОтборам);
	
	БлокТекущейСделки = Элементы.Канбан.Документ.querySelector(ПолучитьСелекторСсылки(РезультатОперации.Сделка) + ".item-col");
	
	Если Не ЗначениеЗаполнено(РезультатОперации.БлокСделки) Тогда
		БлокТекущейСделки.remove();
		
	Иначе
		// Блок сделки не обновляется полностью чтобы не закрывалось меню задач.
		БлокЗадачи = БлокТекущейСделки.querySelector(ПолучитьСелекторСсылки(РезультатОперации.Задача) + ".container");
		БлокЗадачи.remove();
			
		// Обновляем количество в блоке "Дела".
		БлокТекущейСделки.querySelector(".current-tasks").dataset.taskCount = БлокТекущейСделки.querySelectorAll(".container").length;
		
		// Иногда остаются пробельные символы после удаления элементов из блока - нарушает логику стилей.
		КолонкаЗадач = БлокТекущейСделки.querySelector(".menu-container");
		Если КолонкаЗадач.children.length = 0 Тогда
			КолонкаЗадач.innerHTML = "";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, устанавливает признак выполнения задачи и возвращает результат операции.
//
Функция ВыполнитьЗадачуНаСервере(ИдентификаторЗадачи, СтруктураОтбора)
	
	РезультатОперации = Новый Структура;
	РезультатОперации.Вставить("ОписаниеОшибки"		, "");
	РезультатОперации.Вставить("ВыполненоУспешно"	, Ложь);
	
	Задача = Задачи.Взаимодействие.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторЗадачи));
	
	Попытка
		ЗадачаОбъект			 = Задача.ПолучитьОбъект();
		ЗадачаОбъект.Выполнена	 = Истина;
		ЗадачаОбъект.Записать();
		
		РезультатОперации.Вставить("Задача", ЗадачаОбъект.Ссылка);
		РезультатОперации.ВыполненоУспешно = Истина;
		
		ЗаполнитьДополнительныеПараметрыРезультата(ЗадачаОбъект.Сделка, РезультатОперации, СтруктураОтбора, Неопределено);
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		РезультатОперации.ОписаниеОшибки = НСтр("ru = 'Не удалось выполнить задачу. Текст ошибки: '") + ОписаниеОшибки;
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

&НаКлиенте
// Процедура, выполняет обновление данных о задачах в блоке сделки.
//
Процедура ОбновитьДанныеЗадач(ПараметрыОповещения)
	
	Если ПараметрыОповещения.Свойство("ВидСделки") И ПараметрыОповещения.ВидСделки <> ЭтотОбъект.ВидСделки Тогда
		Возврат;
	КонецЕсли;
	
	// Обновляем блок сделки только если он выведен на форму.
	БлокСделки = ПолучитьЭлементБлокаСделки(ПараметрыОповещения.Сделка);
	
	Если БлокСделки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МенюЗадач = БлокСделки.querySelector(".menu");
	МенюАктивно = МенюЗадач.classList.contains("active");
	
	Если МенюАктивно Тогда
		ОбновитьБлокЗадачи(БлокСделки, ПараметрыОповещения);
	Иначе
		ОбновитьБлокСделки(БлокСделки, ПараметрыОповещения.Сделка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обновляет блок задачи в меню.
//
Процедура ОбновитьБлокЗадачи(БлокСделки, ПараметрыОповещения)
	
	Документ = Элементы.Канбан.Документ;
	ОбновляемаяЗадача = ПараметрыОповещения.Задача;
	
	СтруктураОтборов	 = ПолучитьСтруктуруЗначенийОтбораКлиент();
	ДанныеДляОбновления	 = ПолучитьДанныеДляОбновленияЗадач(ПараметрыОповещения.Сделка, ОбновляемаяЗадача, СтруктураОтборов);
	
	// Сделка больше не удовлетворяет параметрам фильтрации - удаляем блок.
	Если Не ЗначениеЗаполнено(ДанныеДляОбновления.БлокСделки) Тогда
		БлокСделки.remove();
	КонецЕсли;
	
	СелекторЗадачи			 = ПолучитьСелекторСсылки(ОбновляемаяЗадача) + ".container";
	БлокОбновляемойЗадачи	 = БлокСделки.querySelector(СелекторЗадачи);
	
	Если СвойствоСтруктуры(ПараметрыОповещения, "УдалениеЗадачи", Ложь) Тогда
		
		// Удаляем блок после удаления или выполнения задачи.
		Если БлокОбновляемойЗадачи <> Неопределено Тогда
			БлокОбновляемойЗадачи.remove();
		КонецЕсли;
		
	Иначе
		
		Если БлокОбновляемойЗадачи = Неопределено Тогда
			КолонкаЗадач			 = БлокСделки.querySelector(".menu-container");
			КолонкаЗадач.innerHTML	 = КолонкаЗадач.innerHTML + ДанныеДляОбновления.БлокЗадачи;
		Иначе
			БлокОбновляемойЗадачи.outerHTML = ДанныеДляОбновления.БлокЗадачи;
		КонецЕсли;
		
	КонецЕсли;
	
	// Обновляем количество в блоке "Дела".
	БлокСделки.querySelector(".current-tasks").dataset.taskCount = БлокСделки.querySelectorAll(".container").length;
	
	// Иногда остаются пробельные символы после удаления элементов из блока - нарушает логику стилей.
	КолонкаЗадач = ?(КолонкаЗадач = Неопределено, БлокСделки.querySelector(".menu-container"), КолонкаЗадач);
	Если КолонкаЗадач.children.length = 0 Тогда
		КолонкаЗадач.innerHTML = "";
	КонецЕсли;
	
	ОбновитьКоличествоСделокВБлоках(ДанныеДляОбновления.ДанныеКоличества);
	УстановитьЗаголовкиДополнительныхОтборов(ЭтотОбъект, СтруктураОтборов, ДанныеДляОбновления.ДанныеКоличестваПоОтборам);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает блок задачи.
//
Функция ПолучитьДанныеДляОбновленияЗадач(Сделка, Задача, СтруктураОтборов)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Взаимодействие.Ссылка КАК Ссылка,
	|	Взаимодействие.ЗадачаНазначеннаяДатаНачало КАК НазначеннаяДатаНачало,
	|	Взаимодействие.ЗадачаНазначеннаяДата КАК НазначеннаяДата,
	|	Взаимодействие.ВидВзаимодействияСправочник.Наименование КАК ВидВзаимодействия,
	|	Взаимодействие.ВидВзаимодействияСправочник.ИндексКартинки КАК ИндексКартинки,
	|	Взаимодействие.ЗадачаТема КАК Тема,
	|	Взаимодействие.ЗадачаОписание КАК Описание,
	|	Взаимодействие.ЗадачаНазначеннаяДата < &ТекущаяДата КАК Просрочена
	|ИЗ
	|	Задача.Взаимодействие КАК Взаимодействие
	|ГДЕ
	|	Взаимодействие.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка"		, Задача);
	Запрос.УстановитьПараметр("ТекущаяДата"	, ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	КартинкаВзаимодействия = БиблиотекаКартинок["ВидВзаимодействия_" + Выборка.ИндексКартинки];
	ДвоичныеДанныеКартинки = КартинкаВзаимодействия.ПолучитьДвоичныеДанные();
	
	АдресКартинки = "data:image/svg+xml;base64," + СтрСоединить(СтрРазделить(Base64Строка(ДвоичныеДанныеКартинки), Символы.ПС + Символы.ВК));
	
	БлокЗадачи = ПолучитьБлокЗадачи(Выборка, АдресКартинки);
	
	ДанныеДляОбновления = Новый Структура;
	ДанныеДляОбновления.Вставить("БлокЗадачи", БлокЗадачи);
	
	ЗаполнитьДополнительныеПараметрыРезультата(Сделка, ДанныеДляОбновления, СтруктураОтборов, Неопределено);
	
	Возврат ДанныеДляОбновления;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает блок задачи.
//
Функция ПолучитьБлокЗадачи(ДанныеЗадачи, АдресКартинки)
	
	ПредставлениеДатыЗадачи	 = ПолучитьПредставлениеДатыЗадачи(ДанныеЗадачи);
	ИдентификаторЗадачи		 = XMLСтрока(ДанныеЗадачи.Ссылка);
	ТемаЗадачи				 = ДанныеЗадачи.Тема;
	ОписаниеЗадачи			 = ДанныеЗадачи.Описание;
	ВидВзаимодействия		 = ДанныеЗадачи.ВидВзаимодействия;
	КлассПросроченнойЗадачи	 = ?(ДанныеЗадачи.Просрочена = Истина, " timed-out", "");
	
	БлокЗадачи =
	"<div class='container' id='" + ИдентификаторЗадачи + "'>
	|	<div class='task'>
	|		<div class='checkbox-wrapper'><div class='checkbox' title='Выполнить задачу'></div></div>
	|		<div class='task-data'>
	|			<div class='date" + КлассПросроченнойЗадачи + "'>" + ПредставлениеДатыЗадачи + "</div>
	|			<div class='theme' title='" + ТемаЗадачи + "'>" + ТемаЗадачи + "</div>
	|			<div class='description' title='" + ОписаниеЗадачи + "'>" + ОписаниеЗадачи + "</div>
	|		</div>
	|		<div class='task-type'>
	|			<img class='interaction-image' src='" + АдресКартинки + "'>
	|			<div class='interaction-type'>" + ВидВзаимодействия + "</div>
	|		</div>
	|	</div>
	|	<div class='margin'></div>
	|</div>";
	
	Возврат БлокЗадачи;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает представление даты задачи.
//
Функция ПолучитьПредставлениеДатыЗадачи(ДанныеЗадачи)
	
	Если Не ЗначениеЗаполнено(ДанныеЗадачи.НазначеннаяДата) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Если НачалоДня(ДанныеЗадачи.НазначеннаяДата) > НачалоДня(ТекущаяДата) Тогда
		
		Возврат Формат(ДанныеЗадачи.НазначеннаяДата, "ДФ='d MMMM'");
		
	ИначеЕсли ДанныеЗадачи.НазначеннаяДата = НачалоДня(ТекущаяДата) Тогда
		
		Возврат "Сегодня, весь день";
		
	ИначеЕсли НачалоДня(ДанныеЗадачи.НазначеннаяДата) = НачалоДня(ТекущаяДата) Тогда
		
		Если ЗначениеЗаполнено(ДанныеЗадачи.НазначеннаяДатаНачало) И НачалоДня(ДанныеЗадачи.НазначеннаяДатаНачало) = НачалоДня(ТекущаяДата) Тогда
			Возврат СтрШаблон(НСтр("ru = 'Сегодня с %1 по %2'"), Формат(ДанныеЗадачи.НазначеннаяДатаНачало, "ДФ='ЧЧ:мм'"), Формат(ДанныеЗадачи.НазначеннаяДата, "ДФ='ЧЧ:мм'"));
		Иначе
			Возврат Формат(ДанныеЗадачи.НазначеннаяДата, "ДФ='''Сегодня ''ЧЧ:мм'");
		КонецЕсли;
		
	ИначеЕсли НачалоГода(ДанныеЗадачи.НазначеннаяДата) = НачалоГода(ТекущаяДата) Тогда
		
		Возврат Формат(ДанныеЗадачи.НазначеннаяДата, "ДФ='d MMMM'")
		
	Иначе
		Возврат Формат(ДанныеЗадачи.НазначеннаяДата, "ДФ='d MMMM yyyy'")
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаКлиенте
// Процедура, обновляет блок сделки.
//
Процедура ОбновитьБлокСделки(БлокСделки, Сделка)
	
	СтруктураОтборов = ПолучитьСтруктуруЗначенийОтбораКлиент();
	
	ПараметрыОбновления = Новый Структура;
	ЗаполнитьДополнительныеПараметрыРезультата(Сделка, ПараметрыОбновления, СтруктураОтборов, Неопределено);
	
	ОбновитьКоличествоСделокВБлоках(ПараметрыОбновления.ДанныеКоличества);
	УстановитьЗаголовкиДополнительныхОтборов(ЭтотОбъект, СтруктураОтборов, ПараметрыОбновления.ДанныеКоличестваПоОтборам);
	
	БлокСделки.outerHTML = ПараметрыОбновления.БлокСделки;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает количество задач по сделке.
//
Функция ПолучитьКоличествоЗадач(Сделка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(Взаимодействие.Ссылка) КАК КоличествоЗадач
	|ИЗ
	|	Задача.Взаимодействие КАК Взаимодействие
	|ГДЕ
	|	Взаимодействие.Сделка = &Сделка
	|	И НЕ Взаимодействие.ПометкаУдаления
	|	И НЕ Взаимодействие.Выполнена");
	
	Запрос.УстановитьПараметр("Сделка", Сделка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.КоличествоЗадач, 0);
	
КонецФункции

&НаКлиенте
// Функция, возвращает HTML-элемент блока сделки.
//
Функция ПолучитьЭлементБлокаСделки(Сделка)
	
	Документ = Элементы.Канбан.Документ;
	
	СелекторСделки		 = ПолучитьСелекторСсылки(Сделка) + ".item-col";
	БлокИзмененнойСделки = Документ.querySelector(СелекторСделки);
	
	Возврат БлокИзмененнойСделки;
	
КонецФункции

&НаКлиенте
// Функция, возвращает селектор идентификатора элемента, полученный из идентификатора ссылки.
//
Функция ПолучитьСелекторСсылки(Ссылка)
	
	ИдентификаторСсылки = Строка(Ссылка.УникальныйИдентификатор());
	Возврат "#" + Элементы.Канбан.Документ.CSS.escape(ИдентификаторСсылки);
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает данные задач для формирования меню.
//
Функция ПолучитьДанныеЗадач(ИдентификаторСделки)
	
	Сделка = Справочники.Сделки.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторСделки));
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Взаимодействие.Ссылка КАК Ссылка,
	|	Взаимодействие.ЗадачаНазначеннаяДатаНачало КАК НазначеннаяДатаНачало,
	|	Взаимодействие.ЗадачаНазначеннаяДата КАК НазначеннаяДата,
	|	Взаимодействие.ВидВзаимодействияСправочник.Наименование КАК ВидВзаимодействия,
	|	Взаимодействие.ВидВзаимодействияСправочник.ИндексКартинки КАК ИндексКартинки,
	|	Взаимодействие.ЗадачаТема КАК Тема,
	|	Взаимодействие.ЗадачаОписание КАК Описание,
	|	Взаимодействие.ЗадачаНазначеннаяДата < &ТекущаяДата КАК Просрочена
	|ПОМЕСТИТЬ ДанныеЗадач
	|ИЗ
	|	Задача.Взаимодействие КАК Взаимодействие
	|ГДЕ
	|	Взаимодействие.Сделка = &Сделка
	|	И НЕ Взаимодействие.Выполнена
	|	И НЕ Взаимодействие.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеЗадач.ИндексКартинки КАК ИндексКартинки
	|ИЗ
	|	ДанныеЗадач КАК ДанныеЗадач
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗадач.Ссылка КАК Ссылка,
	|	ДанныеЗадач.НазначеннаяДатаНачало КАК НазначеннаяДатаНачало,
	|	ДанныеЗадач.НазначеннаяДата КАК НазначеннаяДата,
	|	ДанныеЗадач.ВидВзаимодействия КАК ВидВзаимодействия,
	|	ДанныеЗадач.ИндексКартинки КАК ИндексКартинки,
	|	ДанныеЗадач.Тема КАК Тема,
	|	ДанныеЗадач.Описание КАК Описание,
	|	ДанныеЗадач.Просрочена КАК Просрочена
	|ИЗ
	|	ДанныеЗадач КАК ДанныеЗадач");
	
	Запрос.УстановитьПараметр("Сделка"		, Сделка);
	Запрос.УстановитьПараметр("ТекущаяДата"	, ТекущаяДатаСеанса());
	
	Результат = Запрос.ВыполнитьПакет();
	
	БлокиЗадач = Новый Массив;
	
	ДанныеКартинок = Новый Соответствие;
	ВыборкаИндексыКартинок = Результат[Результат.ВГраница() - 1].Выбрать();
	
	Пока ВыборкаИндексыКартинок.Следующий() Цикл
		
		КартинкаВзаимодействия = БиблиотекаКартинок["ВидВзаимодействия_" + ВыборкаИндексыКартинок.ИндексКартинки];
		ДвоичныеДанныеКартинки = КартинкаВзаимодействия.ПолучитьДвоичныеДанные();
		
		АдресКартинки = "data:image/svg+xml;base64," + СтрСоединить(СтрРазделить(Base64Строка(ДвоичныеДанныеКартинки), Символы.ПС + Символы.ВК));
		
		ДанныеКартинок.Вставить(ВыборкаИндексыКартинок.ИндексКартинки, АдресКартинки);
		
	КонецЦикла;
	
	Выборка = Результат[Результат.ВГраница()].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		БлокЗадачи = ПолучитьБлокЗадачи(Выборка, ДанныеКартинок.Получить(Выборка.ИндексКартинки));
		БлокиЗадач.Добавить(БлокЗадачи);
		
	КонецЦикла;
	
	Возврат СтрСоединить(БлокиЗадач, Символы.ПС);
	
КонецФункции

&НаКлиенте
// Функция, сворачивает всплывающие меню и возвращает свернутые элементы.
//
Функция СвернутьВсплывающиеМеню(ДанныеСобытия)
	
	СвернутыеМеню = Новый Массив;
	
	ЭлементМеню = ДанныеСобытия.Element.closest(".menu");
	
	АктивныеЭлементыМеню = ДанныеСобытия.Document.querySelectorAll(".menu.active");
	
	Для Каждого Меню Из АктивныеЭлементыМеню Цикл
		
		// Не сворачиваем активное меню при нажатии.
		Если Меню = ЭлементМеню Тогда
			Продолжить;
		КонецЕсли;
		
		Меню.classList.toggle("active");
		СвернутыеМеню.Добавить(Меню);
		
	КонецЦикла;
	
	Возврат СвернутыеМеню
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Процедура, устанавливает отображение фильтра.
//
Процедура УстановитьОтображениеФильтраСтатусПациента(Форма)
	
	ЦветАктивности	 = Новый Цвет(218, 230, 244);
	ЦветПоУмолчанию	 = Новый Цвет(255, 255, 255);
	
	Форма.Элементы.ГруппаФильтрСтатусНовые.ЦветФона		 = ?(Форма.ОтборСтатусПациента = ПредопределенноеЗначение("Перечисление.СтатусыКонтрагентов.Первичный"), ЦветАктивности, ЦветПоУмолчанию);
	Форма.Элементы.ГруппаФильтрСтатусПостоянные.ЦветФона = ?(Форма.ОтборСтатусПациента = ПредопределенноеЗначение("Перечисление.СтатусыКонтрагентов.Постоянный"), ЦветАктивности, ЦветПоУмолчанию);
	
КонецПроцедуры

&НаСервере
// Процедура, ОтборНаСервере.
//
Процедура ОбновитьОтборНаСервере(ОтборБезАктивности = Ложь, ОтборПросроченныхЗадач = Ложь, ОтборЗадачНаСегодня = Ложь, УстановитьТекущуюСтруктурнуюЕдиницу = Ложь)
	
	Для Каждого Строка из ТаблицаФильтров Цикл
		Строка.Инициализирован = Ложь;
	КонецЦикла;
	
	МассивИменОчищаемыхФильтров = Новый Массив();
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Статус");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_СотрудникРегистрации");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_РекламныйИсточник");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Тег");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Интерес");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПредварительнаяЗапись"); 	
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Задача"); 
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_КаналПривлечения");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПризнакВыполненияСделки"); 
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_СозданаПериод");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ЗавершенаПериод"); 
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПериодЗапланированнойЗадачи");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПричинаОтказа");		
	
	Если Не ОтборБезАктивности И Не ОтборПросроченныхЗадач И Не ОтборЗадачНаСегодня Тогда
		
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Менеджер");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_СтруктурнаяЕдиница"); 
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПометкаУдаленияСделки");		
		
	КонецЕсли;
	
	УправлениеИнтерфейсамиСервер.ДеактивироватьВсеЗначенияФильтрацииДанных(ЭтаФорма, МассивИменОчищаемыхФильтров);
	
	Если ОтборБезАктивности Тогда
		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПредварительнаяЗапись", Ложь);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Задача", Ложь);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПризнакВыполненияСделки", Ложь);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПометкаУдаленияСделки", Истина,,,, Ложь);
		
	ИначеЕсли ОтборПросроченныхЗадач Тогда
		
		СтруктураПериода = Новый Структура;
		СтруктураПериода.Вставить("Вариант"			, ВариантСтандартногоПериода.ПроизвольныйПериод);
		СтруктураПериода.Вставить("ДатаНачала"		, Дата(1, 1, 1));
		СтруктураПериода.Вставить("ДатаОкончания"	, КонецДня(ТекущаяДатаСеанса() - 86400));
		
		МассивПериодаЗапланированнойЗадачи = Новый_Массив(СтруктураПериода);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПериодЗапланированнойЗадачи", МассивПериодаЗапланированнойЗадачи);		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПризнакВыполненияСделки", Ложь);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПометкаУдаленияСделки", Истина,,,, Ложь);
		
	ИначеЕсли ОтборЗадачНаСегодня Тогда
		
		СтруктураПериода = Новый Структура;
		СтруктураПериода.Вставить("Вариант"			, ВариантСтандартногоПериода.ПроизвольныйПериод);
		СтруктураПериода.Вставить("ДатаНачала"		, НачалоДня(ТекущаяДатаСеанса()));
		СтруктураПериода.Вставить("ДатаОкончания"	, КонецДня(ТекущаяДатаСеанса()));
		
		МассивПериодаЗапланированнойЗадачи = Новый_Массив(СтруктураПериода);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПериодЗапланированнойЗадачи", МассивПериодаЗапланированнойЗадачи);		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПризнакВыполненияСделки", Ложь);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПометкаУдаленияСделки", Истина,,,, Ложь);
		
	Иначе
		
		Если УстановитьТекущуюСтруктурнуюЕдиницу = Истина Тогда
			ЗначенияФильтрации = Новый_Массив(ЭтотОбъект.ТекущаяСтруктурнаяЕдиница, Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
			УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтруктурнаяЕдиница", ЗначенияФильтрации);
		КонецЕсли;
		
		УстановитьОтображениеФильтровПоЗадачам(ЭтотОбъект, ОтборБезАктивности, ОтборПросроченныхЗадач, ОтборЗадачНаСегодня);
		СформироватьКанбан();	
		Возврат;
		
	КонецЕсли;
	
	СтруктураОтборов = Новый Структура;
	СтруктураОтборов.Вставить("ОтборМенеджер"			, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Менеджер"));
	СтруктураОтборов.Вставить("ОтборСтруктурнаяЕдиница"	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СтруктурнаяЕдиница"));
	
	СписокМенеджеров = СтруктураОтборов.ОтборМенеджер;
	Если Не ЗначениеЗаполнено(СписокМенеджеров) Тогда
		СписокМенеджеров = СтруктураОтборов.ОтборМенеджер.ДоступныеЗначения;
	КонецЕсли;
	УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Менеджер", СписокМенеджеров.ВыгрузитьЗначения(), Истина);
	
	Если УстановитьТекущуюСтруктурнуюЕдиницу = Истина Тогда
		ЗначенияФильтрации = Новый_Массив(ЭтотОбъект.ТекущаяСтруктурнаяЕдиница);
		
	Иначе
		СписокКлиник = СтруктураОтборов.ОтборСтруктурнаяЕдиница;
		Если Не ЗначениеЗаполнено(СписокКлиник) Тогда
			СписокКлиник = СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения;
		КонецЕсли;
		
		ЗначенияФильтрации = СписокКлиник.ВыгрузитьЗначения();
		
	КонецЕсли;
	
	УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтруктурнаяЕдиница", ЗначенияФильтрации);
	
	УстановитьОтображениеФильтровПоЗадачам(ЭтотОбъект, ОтборБезАктивности, ОтборПросроченныхЗадач, ОтборЗадачНаСегодня);
	
	СформироватьКанбан();	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения асинхронного события.
//
Процедура ПослеВыбораВидаСделки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Результат.Значение = ЭтотОбъект.ВидСделки Тогда
		// Ничего не изменилось - действий не требуется.
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ВидСделки				 = Результат.Значение;
	Элементы.ИзменитьВидСделки.Заголовок = Результат.Представление;
	
	СформироватьКанбан();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обрабатывает оповещение об изменении сделки.
//
Процедура ОбработатьИзменениеСделки(Сделка)
	
	Документ = Элементы.Канбан.Документ;
	
	СелекторСделки		 = ПолучитьСелекторСсылки(Сделка) + ".item-col";
	УдаляемыйБлокСделки	 = Документ.querySelector(СелекторСделки);
	
	Если УдаляемыйБлокСделки <> Неопределено Тогда
		
		// При необходимости подгрузить следующую заявку для этоой колонки.
		КолонкаУдаляемойСделки = УдаляемыйБлокСделки.closest(".kanban-board");
		
		КоличествоСделокВКолонкеВсего	 = Число(КолонкаУдаляемойСделки.querySelector(".item-count").dataset.count);
		КоличествоСделокВКолонкеТекущее	 = КолонкаУдаляемойСделки.querySelectorAll(".kanban-item").length;
		ТребуетсяПолучитьСделкуИзОчереди = КоличествоСделокВКолонкеВсего > Макс(ЭтотОбъект.МаксимальноеКоличествоСделокВКолонке, КоличествоСделокВКолонкеТекущее);
		
		Если ТребуетсяПолучитьСделкуИзОчереди Тогда
			
			ИдентификаторыИсключаемыхСделок = Новый Массив;
			
			Для Каждого БлокЗаявки Из КолонкаУдаляемойСделки.querySelector(".kanban-drag").children Цикл
				
				Если БлокЗаявки.className = "show-all" Тогда
					Продолжить;
				КонецЕсли;
				
				ИдентификаторыИсключаемыхСделок.Добавить(БлокЗаявки.children[0].id);
				
			КонецЦикла;
			
			ИдентификаторЭтапа = КолонкаУдаляемойСделки.dataset.id;
			
			ПараметрыПолученияСделкиИзОчереди = Новый Структура;
			ПараметрыПолученияСделкиИзОчереди.Вставить("ЭтапСделки"						, ИдентификаторЭтапа);
			ПараметрыПолученияСделкиИзОчереди.Вставить("ИдентификаторыИсключаемыхСделок", ИдентификаторыИсключаемыхСделок);
			
		КонецЕсли;
		
		// Удаляем существующий неактуальный блок заявки.
		УдаляемыйБлокСделки.parentElement.remove();
		
	КонецЕсли;
	
	СтруктураОтбора	 = ПолучитьСтруктуруЗначенийОтбораКлиент();
	ДанныеБлока		 = ПолучитьДанныеБлокаСделки(Сделка, СтруктураОтбора, ПараметрыПолученияСделкиИзОчереди);
	
	Если Не ЗначениеЗаполнено(ДанныеБлока) Тогда
		Возврат;
	КонецЕсли;
	
	КолонкаДанныхКанбана = Документ.querySelector(".kanban-board[data-id=" + Документ.CSS.escape(ДанныеБлока.ПредставлениеКолонки) + "] .kanban-drag");
	
	// Добавляем новый блок в начало колонки.
	НовыйБлокСделки				 = Документ.createElement("div");
	НовыйБлокСделки.innerHTML	 = ДанныеБлока.БлокСделки;
	НовыйБлокСделки.className	 = "kanban-item";
	
	КолонкаДанныхКанбана.prepend(НовыйБлокСделки);
	
	ОбновитьКоличествоСделокВБлоках(ДанныеБлока.ДанныеКоличества);
	ВывестиСделкуИзОчереди(ДанныеБлока.ДанныеВыводимойСделки);
	
КонецПроцедуры

&НаСервере
// Процедура, инициализирует данные соответствия для дальнейшего использвания.
//
Процедура ИнициализироватьДанныеПредопределенногоВидаСделки()
	
	ВидСделкиПервичныйПовторный = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты");
	Если НЕ ЗначениеЗаполнено(ВидСделкиПервичныйПовторный) Тогда 
		ДанныеВидаСделки = Новый Соответствие;
		ДанныеВидаСделки.Вставить("ИдентификаторПричиныОтказаНеПришел", "");		
		ЭтотОбъект.ДанныеПредопределенногоВидаСделки = Новый ФиксированноеСоответствие(ДанныеВидаСделки);
	КонецЕсли;		
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидСделкиПервичныйПовторный", ВидСделкиПервичныйПовторный);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВидыСделок.Ссылка КАК Ссылка,
	|	ВидыСделок.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВидыСделок КАК ВидыСделок
	|ГДЕ
	|	ВидыСделок.Ссылка = &ВидСделкиПервичныйПовторный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭтапыСделок.Ссылка КАК Ссылка,
	|	ЭтапыСделок.НомерЭтапа КАК НомерЭтапа,
	|	ЭтапыСделок.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.ВидСделки = &ВидСделкиПервичныйПовторный
	|	И НЕ ЭтапыСделок.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЭтапыСделок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.ИмяПредопределенныхДанных = ""Отказ""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЭтапыСделок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.ИмяПредопределенныхДанных = ""Успех""";
	
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	
	ВыборкаВидСделки = РезультатыЗапросов[0].Выбрать();
	ВыборкаВидСделки.Следующий();
	
	ЭтотОбъект.ВидСделкиПоУмолчанию	 = ВыборкаВидСделки.Ссылка;
	ЭтотОбъект.ВидСделки			 = ВыборкаВидСделки.Ссылка;
	
	Элементы.ИзменитьВидСделки.Заголовок = ВыборкаВидСделки.Наименование;
	
	ВыборкаЭтапыСделок = РезультатыЗапросов[1].Выбрать();
	
	ДанныеВидаСделки = Новый Соответствие;
	
	Пока ВыборкаЭтапыСделок.Следующий() Цикл
		Если ВыборкаЭтапыСделок.НомерЭтапа = 1 Тогда
			ДанныеВидаСделки.Вставить("ЭтапПотенциальныйПрием", ВыборкаЭтапыСделок.Ссылка);
		ИначеЕсли ВыборкаЭтапыСделок.НомерЭтапа = 2 Тогда
			ДанныеВидаСделки.Вставить("ЭтапПредложениеОзвучено", ВыборкаЭтапыСделок.Ссылка);
		ИначеЕсли ВыборкаЭтапыСделок.НомерЭтапа = 3 Тогда
			ДанныеВидаСделки.Вставить("ЭтапКлиентЗаписан", ВыборкаЭтапыСделок.Ссылка);
		ИначеЕсли ВыборкаЭтапыСделок.НомерЭтапа = 4 Тогда
			ДанныеВидаСделки.Вставить("ЭтапКлиентПодтвердил", ВыборкаЭтапыСделок.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	ВыборкаЭтапОтказ = РезультатыЗапросов[2].Выбрать();
	ВыборкаЭтапОтказ.Следующий();
	ДанныеВидаСделки.Вставить("ЭтапОтказ", ВыборкаЭтапОтказ.Ссылка);
	
	ВыборкаЭтапУспех = РезультатыЗапросов[3].Выбрать();
	ВыборкаЭтапУспех.Следующий();
	ДанныеВидаСделки.Вставить("ЭтапУспех", ВыборкаЭтапУспех.Ссылка);
	
	//ВыборкаПричинаОтказаНеПришел = РезультатыЗапросов[2].Выбрать();
	//ВыборкаПричинаОтказаНеПришел.Следующий();
	
	ПричинаОтказаНеПришел = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПричиныОтказов.КлиентНеПришел");
	Если ЗначениеЗаполнено(ПричинаОтказаНеПришел) Тогда 
		ДанныеВидаСделки.Вставить("ИдентификаторПричиныОтказаНеПришел", Строка(ПричинаОтказаНеПришел.УникальныйИдентификатор()));
	Иначе 
		ДанныеВидаСделки.Вставить("ИдентификаторПричиныОтказаНеПришел", "");
	КонецЕсли;
	
	//ВыборкаПричинаОтказаОтказался = РезультатыЗапросов[3].Выбрать();
	//ВыборкаПричинаОтказаОтказался.Следующий(); 
	
	ПричинаОтказаОтказался = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПричиныОтказов.КлиентОтказался");
	Если ЗначениеЗаполнено(ПричинаОтказаНеПришел) Тогда 	
		ДанныеВидаСделки.Вставить("ПричинаОтказаОтказался", ПричинаОтказаОтказался);
	Иначе 
		ДанныеВидаСделки.Вставить("ПричинаОтказаОтказался", Справочники.ПричиныОтказов.ПустаяСсылка());
	КонецЕсли;
	
	ЭтотОбъект.ДанныеПредопределенногоВидаСделки = Новый ФиксированноеСоответствие(ДанныеВидаСделки);
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет доступные виды сделок.
//
Процедура ЗаполнитьДоступныеВидыСделок()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВидыСделокСтруктурныеЕдиницыПрименения.Ссылка КАК Ссылка,
	|	ВидыСделокСтруктурныеЕдиницыПрименения.Ссылка.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВидыСделок.СтруктурныеЕдиницыПрименения КАК ВидыСделокСтруктурныеЕдиницыПрименения
	|ГДЕ
	|	ВидыСделокСтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница В (&СтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|	И НЕ ВидыСделокСтруктурныеЕдиницыПрименения.Ссылка.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ЭтотОбъект.ТекущаяСтруктурнаяЕдиница);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭтотОбъект.ДоступныеВидыСделок.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обновляет канбан.
//
Процедура ОбновитьПредставлениеКанбана() Экспорт
	
	СформироватьКанбан();
	ЭтотОбъект.ТекущийЭлемент = Элементы.Канбан;
	
КонецПроцедуры

&НаКлиенте
// Процедура, устанавливает отбор по статусу.
//
Процедура УстановитьОтбор(ПараметрыОтбора) Экспорт
	
	// Используется для установки фильтра из формы списка.
	// См. ФормаСписка.ОткрытьКанбан.
	ОбновитьМеханизмФильтрацииДанных(ПараметрыОтбора, Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет переход на форму списка с установкой фильтра по статусу.
//
Процедура ПерейтиВСписок(ИдентификаторЭтапа = Неопределено)
	
	ФормаСписка = ПолучитьОткрытуюФорму("Справочник.Сделки.Форма.ФормаСпискаНовая");
	
	ПараметрыОтбора = ПараметрыВыбранныхФильтровКлиент();
	ПараметрыОтбора.Вставить("ВидСделки"			, ЭтотОбъект.ВидСделки);
	ПараметрыОтбора.Вставить("ОтборСтатусПациента"	, ЭтотОбъект.ОтборСтатусПациента);
	ПараметрыОтбора.Вставить("ОтборПоЗадачам"		, ЭтотОбъект.ОтборПоЗадачам);
	
	Если ЗначениеЗаполнено(ИдентификаторЭтапа) Тогда
		ПараметрыОтбора.Вставить("МассивЭтапов"					, Новый_Массив(ПолучитьСсылку("Справочники", "ЭтапыСделок", ИдентификаторЭтапа)));
		ПараметрыОтбора.Вставить("МассивЭтапов_ВариантОтбора"	, Истина);
	КонецЕсли;
	
	Если ФормаСписка = Неопределено Тогда
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ПараметрыОтбора", ПараметрыОтбора);
		
		ОткрытьФормуСписка(ПараметрыОткрытия);
		
	Иначе
		ФормаСписка.Активизировать();
		ФормаСписка.УстановитьОтбор(ПараметрыОтбора);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, открывает форму списка сделок.
//
Процедура ОткрытьФормуСписка(ПараметрыОткрытия = Неопределено)
	
	ОткрытьФорму("Справочник.Сделки.Форма.ФормаСпискаНовая", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обрабатывает вызов события из HTML-документа.
//
Процедура ОбработатьВызовСобытия(ИмяСобытия)
	
	Если ИмяСобытия = "drop" Тогда
		ИзменитьЭтапСделки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, изменяет этап сделки.
//
Процедура ИзменитьЭтапСделки()
	
	Документ = Элементы.Канбан.Документ;
	
	Если Документ.defaultView.dropElement.parentElement = Документ.defaultView.dropSource Тогда
		// Сделка осталась в том же блоке.
		Возврат;
	КонецЕсли;
	
	ИдентификаторЭтапа	 = Документ.defaultView.dropTarget.parentElement.dataset.id;
	ИдентификаторСделки	 = Документ.defaultView.dropElement.querySelector(".item-col").id;
	
	КоличествоСделокВИсточникеВсего		 = Число(Документ.defaultView.dropSource.parentElement.querySelector(".item-count").dataset.count);
	КоличествоСделокВИсточникеТекущее	 = Документ.defaultView.dropSource.querySelectorAll(".kanban-item").length;
	ТребуетсяПолучитьСделкуИзОчереди	 = КоличествоСделокВИсточникеВсего > Макс(ЭтотОбъект.МаксимальноеКоличествоСделокВКолонке, КоличествоСделокВИсточникеТекущее + 1);
	
	Если ТребуетсяПолучитьСделкуИзОчереди Тогда
		
		ИдентификаторыИсключаемыхСделок = Новый Массив;
		
		Для Каждого БлокСделки Из Документ.defaultView.dropSource.children Цикл
			
			Если БлокСделки.className = "show-all" Тогда
				Продолжить;
			КонецЕсли;
			
			ИдентификаторыИсключаемыхСделок.Добавить(БлокСделки.children[0].id);
			
		КонецЦикла;
		
		ИзмененныйЭтап = Документ.defaultView.dropSource.parentElement.dataset.id;
		
		ПараметрыПолученияСделкиИзОчереди = Новый Структура;
		ПараметрыПолученияСделкиИзОчереди.Вставить("ЭтапСделки"						, ИзмененныйЭтап);
		ПараметрыПолученияСделкиИзОчереди.Вставить("ИдентификаторыИсключаемыхСделок", ИдентификаторыИсключаемыхСделок);
		
	КонецЕсли;
	
	СтруктураОтборов = ПолучитьСтруктуруЗначенийОтбораКлиент();
	
	ОбработатьПереходНаЭтап(ИдентификаторСделки, ИдентификаторЭтапа, СтруктураОтборов, ПараметрыПолученияСделкиИзОчереди);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обрабатывает изменение этапа сделки.
//
Процедура ОбработатьПереходНаЭтап(ИдентификаторСделки, ИдентификаторЭтапа, СтруктураОтборов, ПараметрыПолученияСделкиИзОчереди)
	
	ЭтапОтказ = ЭтотОбъект.ДанныеПредопределенногоВидаСделки.Получить("ЭтапОтказ");
	Если ЭтотОбъект.ВидСделки <> ЭтотОбъект.ВидСделкиПоУмолчанию И ЗначениеЗаполнено(ЭтапОтказ)
		И ИдентификаторЭтапа = Строка(ЭтапОтказ.УникальныйИдентификатор()) Тогда
		
		// Даем выбрать причину отказа только для пользователских видов сделок,
		// для предопределенного всегда "Клиент отказался".
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("СтруктураОтборов"					, СтруктураОтборов);
		ПараметрыОповещения.Вставить("ИдентификаторЭтапа"				, ИдентификаторЭтапа);
		ПараметрыОповещения.Вставить("ИдентификаторСделки"				, ИдентификаторСделки);
		ПараметрыОповещения.Вставить("ПараметрыПолученияСделкиИзОчереди", ПараметрыПолученияСделкиИзОчереди);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораРезультатаСделкиОтказ", ЭтотОбъект, ПараметрыОповещения);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ИдентификаторСделки"	, ИдентификаторСделки);
		ПараметрыОткрытия.Вставить("ИмяЗавершающегоЭтапа"	, "Отказ");
		
		ОткрытьФорму("Справочник.Сделки.Форма.ФормаРезультатаСделки", ПараметрыОткрытия,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат;
		
	КонецЕсли;
	
	ЭтапУспех = ЭтотОбъект.ДанныеПредопределенногоВидаСделки.Получить("ЭтапУспех");
	Если ЭтотОбъект.ВидСделки <> ЭтотОбъект.ВидСделкиПоУмолчанию И ЗначениеЗаполнено(ЭтапУспех)
		И ИдентификаторЭтапа = Строка(ЭтапУспех.УникальныйИдентификатор()) Тогда
		
		// Перевести сделку в успех можно только в пользовательском виде сделки,
		// для предопределенного этап "Успех" проставляется автоматически.
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("СтруктураОтборов"					, СтруктураОтборов);
		ПараметрыОповещения.Вставить("ИдентификаторЭтапа"				, ИдентификаторЭтапа);
		ПараметрыОповещения.Вставить("ИдентификаторСделки"				, ИдентификаторСделки);
		ПараметрыОповещения.Вставить("ПараметрыПолученияСделкиИзОчереди", ПараметрыПолученияСделкиИзОчереди);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораРезультатаСделкиУспех", ЭтотОбъект, ПараметрыОповещения);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ИдентификаторСделки"	, ИдентификаторСделки);
		ПараметрыОткрытия.Вставить("ИмяЗавершающегоЭтапа"	, "Успех");
		
		ОткрытьФорму("Справочник.Сделки.Форма.ФормаРезультатаСделки", ПараметрыОткрытия,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат;
		
	КонецЕсли;
	
	ДополнительныеПараметрыСделки = Новый Структура;
	
	Если ЗначениеЗаполнено(ЭтапОтказ) И ИдентификаторЭтапа = Строка(ЭтапОтказ.УникальныйИдентификатор()) Тогда
		ДополнительныеПараметрыСделки.Вставить("ПричинаОтказа", ЭтотОбъект.ДанныеПредопределенногоВидаСделки.Получить("ПричинаОтказаОтказался"));
	КонецЕсли;
	
	РезультатОперации = ОбработатьПереходНаЭтапНаСервере(
		ИдентификаторСделки,
		ИдентификаторЭтапа,
		СтруктураОтборов,
		ПараметрыПолученияСделкиИзОчереди,
		ДополнительныеПараметрыСделки
	);
	ОбработатьРезультатПереходаНаЭтап(РезультатОперации);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения асинхронного события.
//
Процедура ПослеВыбораРезультатаСделкиОтказ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ОтменитьПеретаскиваниеСделки();
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметрыСделки = Новый Структура("ПричинаОтказа", Результат.ПричинаОтказа);
	
	РезультатОперации = ОбработатьПереходНаЭтапНаСервере(
		ДополнительныеПараметры.ИдентификаторСделки,
		ДополнительныеПараметры.ИдентификаторЭтапа,
		ДополнительныеПараметры.СтруктураОтборов,
		ДополнительныеПараметры.ПараметрыПолученияСделкиИзОчереди,
		ДополнительныеПараметрыСделки
	);
	ОбработатьРезультатПереходаНаЭтап(РезультатОперации);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения асинхронного события.
//
Процедура ПослеВыбораРезультатаСделкиУспех(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ОтменитьПеретаскиваниеСделки();
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("Прием") Тогда
		ДополнительныеПараметрыСделки = Новый Структура("Прием", Результат.Прием);
	КонецЕсли;
	
	РезультатОперации = ОбработатьПереходНаЭтапНаСервере(
		ДополнительныеПараметры.ИдентификаторСделки,
		ДополнительныеПараметры.ИдентификаторЭтапа,
		ДополнительныеПараметры.СтруктураОтборов,
		ДополнительныеПараметры.ПараметрыПолученияСделкиИзОчереди,
		ДополнительныеПараметрыСделки
	);
	ОбработатьРезультатПереходаНаЭтап(РезультатОперации);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, выполняет переход сделки на этап.
//
Функция ОбработатьПереходНаЭтапНаСервере(
		ИдентификаторСделки,
		ИдентификаторЭтапа,
		СтруктураОтборов,
		ПараметрыПолученияСделкиИзОчереди,
		ДополнительныеПараметрыСделки = Неопределено
	)
	
	РезультатОперации = Новый Структура;
	РезультатОперации.Вставить("ОписаниеОшибки"		, "");
	РезультатОперации.Вставить("ВыполненоУспешно"	, Ложь);
	
	Попытка
		Сделка		 = Справочники.Сделки.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторСделки));
		ЭтапСделки	 = Справочники.ЭтапыСделок.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторЭтапа));
		СделкаОбъект = Сделка.ПолучитьОбъект();
		
		Если ЭтапСделки = Справочники.ЭтапыСделок.Отказ Тогда
			СделкаОбъект.ЭтапОтказа		 = СделкаОбъект.ЭтапСделки;
			СделкаОбъект.РезультатСделки = Перечисления.РезультатыСделок.Отказ;
		Иначе
			СделкаОбъект.ПричинаОтказа = Неопределено;
		КонецЕсли;
		
		Если ЭтапСделки = Справочники.ЭтапыСделок.Успех Тогда
			СделкаОбъект.ЭтапУспеха		 = СделкаОбъект.ЭтапСделки;
			СделкаОбъект.РезультатСделки = Перечисления.РезультатыСделок.Успех;
		КонецЕсли;
		
		Если ЭтапСделки <> Справочники.ЭтапыСделок.Успех И ЭтапСделки <> Справочники.ЭтапыСделок.Отказ Тогда
			СделкаОбъект.ЭтапУспеха		 = Неопределено;
			СделкаОбъект.ЭтапОтказа		 = Неопределено;
			СделкаОбъект.РезультатСделки = Неопределено;
		КонецЕсли;
		
		СделкаОбъект.ЭтапСделки = ЭтапСделки;
		
		Если ЗначениеЗаполнено(ДополнительныеПараметрыСделки) Тогда
			ЗаполнитьЗначенияСвойств(СделкаОбъект, ДополнительныеПараметрыСделки);
		КонецЕсли;
		
		СделкаОбъект.Записать();
		
		РезультатОперации.ВыполненоУспешно = Истина;
		
	Исключение
		РезультатОперации.ОписаниеОшибки = НСтр("ru = 'Не удалось изменить этап сделки. Текст ошибки: '") + ОписаниеОшибки();
		
	КонецПопытки;
	
	Если РезультатОперации.ВыполненоУспешно Тогда
		ЗаполнитьДополнительныеПараметрыРезультата(СделкаОбъект.Ссылка, РезультатОперации, СтруктураОтборов, ПараметрыПолученияСделкиИзОчереди);
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции

&НаКлиенте
// Процедура, обрабатывает результат изменения этапа сделки.
//
Процедура ОбработатьРезультатПереходаНаЭтап(РезультатОперации, ОбрабатыватьИзменение = Ложь)
	
	// Все прошло успешно, обновляем количество сделок в блоках.
	Если РезультатОперации.ВыполненоУспешно = Истина Тогда
		
		Оповестить("ОБНОВИТЬ_СВЕДЕНИЯ_ПО_СДЕЛКАМ", РезультатОперации.Сделка, ?(ОбрабатыватьИзменение = Истина, Неопределено, ЭтотОбъект));
		
		ВывестиСделкуИзОчереди(РезультатОперации.ДанныеВыводимойСделки);
		ОбновитьКоличествоСделокВБлоках(РезультатОперации.ДанныеКоличества);
		ОбновитьПредставлениеСделки(РезультатОперации.Сделка, РезультатОперации.БлокСделки);
		УстановитьЗаголовкиДополнительныхОтборов(ЭтотОбъект, ПолучитьСтруктуруЗначенийОтбораКлиент(), РезультатОперации.ДанныеКоличестваПоОтборам);
		
		Возврат;
		
	КонецЕсли;
	
	// Сообщаем об ошибке и отменяем визуальные последствия действия.
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.ОписаниеОшибки);
	ОтменитьПеретаскиваниеСделки();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обновляет представление сделки.
//
Процедура ОбновитьПредставлениеСделки(Сделка, БлокСделки)
	
	Документ = Элементы.Канбан.Документ;
	
	СелекторСделки				 = ПолучитьСелекторСсылки(Сделка) + ".item-col";
	БлокСделкиЭлемент			 = Документ.querySelector(СелекторСделки);
	БлокСделкиЭлемент.outerHTML	 = БлокСделки;
	
КонецПроцедуры

&НаКлиенте
// Процедура, возвращает сделку в изначальный блок.
//
Процедура ОтменитьПеретаскиваниеСделки()
	
	Документ = Элементы.Канбан.Документ;
	
	Документ.defaultView.dropTarget.removeChild(Документ.defaultView.dropElement);
	Документ.defaultView.dropSource.prepend(Документ.defaultView.dropElement);
	
КонецПроцедуры

&НаКлиенте
// Процедура, выводит следующую в очереди сделку.
//
Процедура ВывестиСделкуИзОчереди(ДанныеВыводимойСделки)
	
	Если Не ЗначениеЗаполнено(ДанныеВыводимойСделки) Тогда
		Возврат;
	КонецЕсли;
	
	Документ = Элементы.Канбан.Документ;
	
	КолонкаДляДобавления = Документ.querySelector(".kanban-board[data-id='" + ДанныеВыводимойСделки.ЭтапСделки + "']");
	
	БлокВыводимойСделки = Документ.createElement("div");
	БлокВыводимойСделки.className = "kanban-item";
	БлокВыводимойСделки.innerHTMl = ДанныеВыводимойСделки.БлокСделки;
	
	КнопкаПереходаВСписок = КолонкаДляДобавления.querySelector(".show-all");
	КнопкаПереходаВСписок.before(БлокВыводимойСделки);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обновляет представление количества сделок в блоках.
//
Процедура ОбновитьКоличествоСделокВБлоках(ДанныеКоличества)
	
	Документ = Элементы.Канбан.Документ;
	
	КонтейнерБлоков = Документ.querySelector(".kanban-container");
	
	Для Каждого Блок Из КонтейнерБлоков.children Цикл
		
		КоличествоСделок = ДанныеКоличества.Получить(Блок.dataset.id);
		КоличествоСделок = ?(КоличествоСделок = Неопределено, 0, КоличествоСделок);
		
		КнопкаПоказатьВсе				 = Блок.querySelector(".show-all");
		КнопкаПоказатьВсе.dataset.count	 = КоличествоСделок;
		
		ПредставлениеКоличестваЭлемент				 = Блок.querySelector("span.item-count");
		ПредставлениеКоличестваЭлемент.dataset.count = КоличествоСделок;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, выполняет оповещение сеансов об изменении сделки и 
// Заполняет дополнительные параметры для обработки изменения сделки.
//
Процедура ЗаполнитьДополнительныеПараметрыРезультата(Сделка, РезультатОперации, СтруктураОтборов, ПараметрыПолученияСделкиИзОчереди)
	
	// Оповещение других сеансов не требуется - описано в модуле объекта.
	
	РезультатОперации.Вставить("Сделка", Сделка);
	
	// Получаем данные количества сделок.
	ДанныеКоличества = ПолучитьКоличествоСделокВКолонках(СтруктураОтборов);
	РезультатОперации.Вставить("ДанныеКоличества", ДанныеКоличества);
	
	// Получаем данные количества сделок по дополнительным отборам.
	ДанныеКоличестваПоОтборам = ПолучитьКоличествоСделокПоДополнительнымОтборам(СтруктураОтборов);
	РезультатОперации.Вставить("ДанныеКоличестваПоОтборам", ДанныеКоличестваПоОтборам);
	
	// Получаем следующую в очереди сделку для отображения в блоке.
	ДанныеВыводимойСделки = ПолучитьДанныеВыводимойСделки(СтруктураОтборов, ПараметрыПолученияСделкиИзОчереди);
	РезультатОперации.Вставить("ДанныеВыводимойСделки", ДанныеВыводимойСделки);
	
	// Получаем блок текущей сделки для обновления представления.
	ДанныеСделки			 = ПолучитьДанныеСделки(СтруктураОтборов, Сделка);
	ОбновленныйБлокСделки	 = ПолучитьБлокСделки(ДанныеСделки);
	РезультатОперации.Вставить("БлокСделки", ОбновленныйБлокСделки);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает данные сделки из очереди.
//
Функция ПолучитьДанныеВыводимойСделки(Знач СтруктураОтбора, ПараметрыПолученияСделкиИзОчереди)
	
	Если Не ЗначениеЗаполнено(ПараметрыПолученияСделкиИзОчереди) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЭтапСделки						 = ПараметрыПолученияСделкиИзОчереди.ЭтапСделки;
	ИдентификаторыИсключаемыхСделок	 = ПараметрыПолученияСделкиИзОчереди.ИдентификаторыИсключаемыхСделок;
	
	ИсключаемыеСделки = Новый Массив;
	
	Для Каждого ИдентификаторСделки Из ИдентификаторыИсключаемыхСделок Цикл
		
		ИсключаемаяСделка = Справочники.Сделки.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторСделки));
		ИсключаемыеСделки.Добавить(ИсключаемаяСделка);
		
	КонецЦикла;
	
	СтруктураОтбора.Вставить("ЭтапСделки", Справочники.ЭтапыСделок.ПолучитьСсылку(Новый УникальныйИдентификатор(ЭтапСделки)));
	
	ДанныеСделки = ПолучитьДанныеСделки(СтруктураОтбора,, ИсключаемыеСделки);
	
	Если Не ЗначениеЗаполнено(ДанныеСделки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	БлокСделки = ПолучитьБлокСделки(ДанныеСделки);
	
	ДанныеВыводимойСделки = Новый Структура;
	ДанныеВыводимойСделки.Вставить("ЭтапСделки"	, ЭтапСделки);
	ДанныеВыводимойСделки.Вставить("БлокСделки"	, БлокСделки);
	
	Возврат ДанныеВыводимойСделки;
	
КонецФункции

&НаСервере
// Функция, возвращает блок колонки.
//
Функция ПолучитьБлокКолонки(ДанныеСделки, БлокиСделок, КоличествоСделок)
	
	ИмяСтатуса					 = XMLСтрока(ДанныеСделки.ЭтапСделки);
	ПредставлениеСтатуса		 = ДанныеСделки.НаименованиеЭтапа;
	СодержимоеКолонки			 = СтрСоединить(БлокиСделок, "," + Символы.ПС);
	
	ТекстНастройкиОграниченияПереносаСделок = ?(
		ЭтотОбъект.ВидСделки = ЭтотОбъект.ВидСделкиПоУмолчанию,
		ПолучитьТекстОграниченияПереносаСделок(ДанныеСделки),
		""
	);
	
	БлокКолонки =
	"    {
	|      id: '" + ИмяСтатуса + "',
	|      title: """ + ПредставлениеСтатуса + " <span class='item-count' data-count='" + КоличествоСделок + "'></span><svg xmlns='http://www.w3.org/2000/svg' width='13' height='32' viewBox='0 0 13 32'><path fill='#39a8ef' fill-opacity='1' d='M0 0h3c2.8 0 4 3 4 3l6 13-6 13s-1.06 3-4 3H0V0z'/></svg>"",
	|      class: 'col-head',
	|      " + ТекстНастройкиОграниченияПереносаСделок + "
	|      item: [
	|          " + СодержимоеКолонки + "
	|      ]
	|    },";
	
	Возврат БлокКолонки;
	
КонецФункции

&НаСервере
// Функция, возвращает код настройки ограничения переноса сделок между этапами.
//
Функция ПолучитьТекстОграниченияПереносаСделок(ДанныеСделки)
	
	Возврат ?(
		ЭтотОбъект.ВидСделки = ЭтотОбъект.ВидСделкиПоУмолчанию,
		"dragTo: [" + ПолучитьДоступныеДляПереносаБлоки(ДанныеСделки) + "],",
		""
	);
	
КонецФункции

&НаСервере
// Функция, возвращает представление блоков, доступных для переноса.
//
Функция ПолучитьДоступныеДляПереносаБлоки(ДанныеСделки)
	
	ЭтапПотенциальныйПрием 	= ЭтотОбъект.ДанныеПредопределенногоВидаСделки.Получить("ЭтапПотенциальныйПрием");
	ЭтапПредложениеОзвучено = ЭтотОбъект.ДанныеПредопределенногоВидаСделки.Получить("ЭтапПредложениеОзвучено");
	ЭтапОтказ 				= ЭтотОбъект.ДанныеПредопределенногоВидаСделки.Получить("ЭтапОтказ");
	ЭтапКлиентЗаписан		= ЭтотОбъект.ДанныеПредопределенногоВидаСделки.Получить("ЭтапКлиентЗаписан");
	ЭтапКлиентПодтвердил	= ЭтотОбъект.ДанныеПредопределенногоВидаСделки.Получить("ЭтапКлиентПодтвердил");
	
	Если (ЗначениеЗаполнено(ЭтапПотенциальныйПрием) И ДанныеСделки.ЭтапСделки = ЭтапПотенциальныйПрием)
		ИЛИ (ЗначениеЗаполнено(ЭтапПредложениеОзвучено) И ДанныеСделки.ЭтапСделки = ЭтапПредложениеОзвучено)
		ИЛИ (ЗначениеЗаполнено(ЭтапОтказ) И ДанныеСделки.ЭтапСделки = ЭтапОтказ) Тогда
		
		МассивБлоков = Новый Массив;
		
		МассивБлоков.Добавить("'" + ?(ЗначениеЗаполнено(ЭтапПотенциальныйПрием), Строка(ЭтапПотенциальныйПрием.УникальныйИдентификатор()), "") + "'");
		МассивБлоков.Добавить("'" + ?(ЗначениеЗаполнено(ЭтапПредложениеОзвучено), Строка(ЭтапПредложениеОзвучено.УникальныйИдентификатор()), "") + "'");
		МассивБлоков.Добавить("'" + ?(ЗначениеЗаполнено(ЭтапОтказ), Строка(ЭтапОтказ.УникальныйИдентификатор()), "") + "'");
		
		ДоступныеБлоки = СтрСоединить(МассивБлоков, ", ");
		
	ИначеЕсли (ЗначениеЗаполнено(ЭтапКлиентЗаписан) И ДанныеСделки.ЭтапСделки = ЭтапКлиентЗаписан)
		ИЛИ (ЗначениеЗаполнено(ЭтапКлиентПодтвердил) И ДанныеСделки.ЭтапСделки = ЭтапКлиентПодтвердил) Тогда
		
		ДоступныеБлоки = "'" + ?(ЗначениеЗаполнено(ЭтапОтказ), Строка(ЭтапОтказ.УникальныйИдентификатор()), "") + "'";
		
	Иначе
		ДоступныеБлоки = "";
		
	КонецЕсли;
		
	Возврат ДоступныеБлоки
	
КонецФункции

&НаСервере
// Функция, возвращает блок сделки.
//
Функция ПолучитьБлокСделкиДляФормированияКанбана(ДанныеСделки)
	
	БлокСделки =
	"		{
	|			title: `" + ПолучитьБлокСделки(ДанныеСделки) + "`
	|		}";
	
	Возврат БлокСделки;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает блок сделки.
//
Функция ПолучитьБлокСделки(ДанныеСделки)
	
	Если ДанныеСделки = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ПредставлениеДатыСоздания				 = ПолучитьПредставлениеДаты(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСделки, "ДатаСделки", ""));
	
	ИдентификаторСделки						 = XMLСтрока(ДанныеСделки.Сделка);
	ПредставлениеСделки						 = ДанныеСделки.ПредставлениеСделки + ПредставлениеДатыСоздания;
	ПредставлениеКлиента					 = ДанныеСделки.ПредставлениеКлиента;
	ИдентификаторКлиента					 = XMLСтрока(ДанныеСделки.Клиент);
	НомераТелефоновКлиента					 = СтрРазделить(ДанныеСделки.НомерТелефона, ",", Ложь);
	
	ИдентификаторПричиныОтказа				 = Строка(ДанныеСделки.ПричинаОтказа.УникальныйИдентификатор());
	ПредставлениеПричиныОтказа				 = ДанныеСделки.ПричинаОтказаНаименование;
	
	КлассПометкиУдаления					 = ?(ДанныеСделки.ПометкаУдаления, " deleted", "");
	
	ИдентификаторВрача						 = XMLСтрока(ДанныеСделки.Врач);
	ПредставлениеВрача						 = ДанныеСделки.ПредставлениеВрача;
	ПредставлениеСпециализации				 = ДанныеСделки.ПредставлениеСпециализации;
	Примечание								 = ДанныеСделки.Примечание;
	ИдентификаторКуратора					 = XMLСтрока(ДанныеСделки.Куратор);
	ПредставлениеКуратора					 = ДанныеСделки.ПредставлениеКуратора;
	ПредставлениеРекламногоИсточника		 = ДанныеСделки.ПредставлениеРекламногоИсточника;
	ПредставлениеЗначенияКаналаПривлечения	 = ?(ЗначениеЗаполнено(ДанныеСделки.ПредставлениеЗначенияКаналаПривлечения), " - " + ДанныеСделки.ПредставлениеЗначенияКаналаПривлечения, "");
	ПредставлениеКаналаПривлечения			 = ДанныеСделки.ПредставлениеКаналаПривлечения + ПредставлениеЗначенияКаналаПривлечения;
	Комментарий								 = ДанныеСделки.Комментарий;
	
	СтатусПациента							 = ДанныеСделки.СтатусПациента;
	ЭтоПервыйВизит							 = (ДанныеСделки.ЭтоПовторныйПрием = Ложь);
	
	КоличествоЗадач							 = ДанныеСделки.КоличествоЗадач;
	НаправившийВрач							 = ?(ЗначениеЗаполнено(ДанныеСделки.НаправившийВрач), НСтр("ru = 'По направлению от '") + ДанныеСделки.НаправившийВрач, "");
	
	БлокНомеров = "";
	Для Каждого НомерТелефона Из НомераТелефоновКлиента Цикл
		БлокНомера = "<div class='phone-number'>" + НомерТелефона + "</div>";
		БлокНомеров = БлокНомеров + БлокНомера;
	КонецЦикла;
	
	БлокСделки =
	"			<div class='item-col" + КлассПометкиУдаления + "' id='" + ИдентификаторСделки + "'>
	|				<div class='deletion-mark'>Удалена</div>
	|				<div class='head-col'>
	|					<div class='deal-row'>
	|						<div class='title-col' data-deal-id='" + ИдентификаторСделки + "' title='" + ПредставлениеСделки + "'>" + ПредставлениеСделки + "</div>
	|						<div class='container-row'>
	|							<div class='ico-chat' title='Перейти к диалогу'></div>
	|						</div>
	|					</div>
	|				</div>
	|				<div class='referred-from'>" + НаправившийВрач + "</div>
	|				<div class='visit-type" + ?(ЭтоПервыйВизит, " first", "") + "'></div>
	|				<div class='deny-reason' id='" + ИдентификаторПричиныОтказа + "' title='" + ПредставлениеПричиныОтказа + "'>" + ПредставлениеПричиныОтказа + "</div>
	|				<div class='client-status" + ?(СтатусПациента = Перечисления.СтатусыКонтрагентов.Первичный, " new", "") + "'>" + СтатусПациента + "</div>
	|				<div class='client-name' id='" + ИдентификаторКлиента + "'>" + ПредставлениеКлиента + "</div>" +
	БлокНомеров + "
	|				<div class='manager' title='" + ПредставлениеКуратора + "' id='" + ИдентификаторКуратора + "'>" + ПредставлениеКуратора + "</div>
	|				<div class='doctor' title='" + ПредставлениеВрача + "' id='" + ИдентификаторВрача + "'>" + ПредставлениеВрача + "</div>
	|				<div class='specialization'>" + ПредставлениеСпециализации + "</div>
	|				<div class='note'>" + Примечание + "</div>
	|				<div class='ad-source'>" + ПредставлениеРекламногоИсточника + "</div>
	|				<div class='channel'>" + ПредставлениеКаналаПривлечения + "</div>
	|				<div class='comment' title='" + Комментарий + "'>" + Комментарий + "</div>
	|				<div class='tasks'>
	|					<div class='current-tasks' data-task-count='" + КоличествоЗадач + "'></div>
	|					<div class='create-task'>+ Запланировать</div>
	|					<div class='menu'>
	|						<div class='menu-container'></div>
	|					</div>
	|				</div>
	|			</div>";
	
	Возврат БлокСделки;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает цвет для HTML документа.
//
Функция ПолучитьЦветДляHTML(Цвет)
	
	Возврат ПолучитьRGBЦвет(Цвет,,,, Истина);
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает представление даты.
//
Функция ПолучитьПредставлениеДаты(Дата)
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Если НачалоДня(Дата) = НачалоДня(ТекущаяДата) Тогда
		// Сегодня - показываем время.
		Возврат Формат(Дата, "ДФ=''' сегодня в ''ЧЧ:мм'");
		
	ИначеЕсли НачалоГода(Дата) = НачалоГода(ТекущаяДата) Тогда
		// В этом году - не показывам год.
		Возврат Формат(Дата, "ДФ=' от d MMMM'")
		
	Иначе
		Возврат Формат(Дата, "ДФ=' от d MMMM yyyy'")
		
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает данные блока сделки (представление и родительский блок).
//
Функция ПолучитьДанныеБлокаСделки(Сделка, СтруктураОтбора, ПараметрыПолученияСделкиИзОчереди = Неопределено)
	
	ДанныеСделки = ПолучитьДанныеСделки(СтруктураОтбора, Сделка);
	
	Если Не ЗначениеЗаполнено(ДанныеСделки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеКоличества		 = ПолучитьКоличествоСделокВКолонках(СтруктураОтбора);
	ДанныеВыводимойСделки	 = ПолучитьДанныеВыводимойСделки(СтруктураОтбора, ПараметрыПолученияСделкиИзОчереди);
	
	Результат = Новый Структура;
	Результат.Вставить("БлокСделки"				, ПолучитьБлокСделки(ДанныеСделки));
	Результат.Вставить("ПредставлениеКолонки"	, XMLСтрока(ДанныеСделки.ЭтапСделки));
	Результат.Вставить("ДанныеКоличества"		, ДанныеКоличества);
	Результат.Вставить("ДанныеВыводимойСделки"	, ДанныеВыводимойСделки);
	
	Возврат Результат
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает количество сделок в каждой колонке канбана.
//
Функция ПолучитьКоличествоСделокВКолонках(Знач СтруктураОтборов)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сделки.ЭтапСделки КАК ЭтапСделки,
	|	КОЛИЧЕСТВО(Сделки.Ссылка) КАК КоличествоСделок
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СделкиСведенияДляСписка КАК СделкиСведенияДляСписка
	|		ПО Сделки.Ссылка = СделкиСведенияДляСписка.Сделка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтрагентыСведенияДляСписка КАК КонтрагентыСведенияДляСписка
	|		ПО Сделки.Контрагент = КонтрагентыСведенияДляСписка.Контрагент
	|ГДЕ
	|	Сделки.ВидСделки = &ВидСделки
	|	И ВЫБОР
	|			КОГДА &СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КонтрагентыСведенияДляСписка.Статус = &СтатусПациента
	|		КОНЕЦ
	|	И &ОтборПоСсылке
	|	И &УсловиеПометкаУдаления
	|	И &УсловиеСтруктурнаяЕдиница
	|	И &УсловиеСотрудникРегистрации
	|	И &УсловиеМенеджер
	|	И &УсловиеВрач
	|	И &УсловиеРекламныйИсточник
	|	И &УсловиеКаналПривлечения
	|	И &УсловиеДатаСоздания
	|	И &УсловиеДатаЗавершенияСделки
	|	И &УсловиеДатаЗапланированнойЗадачи
	|	И &УсловиеОтборБезНазначенногоПриема
	|	И &УсловиеОтборБезЗадач
	|	И &УсловиеЭтап
	|	И &УсловиеЗавершена
	|	И &УсловиеПричинаОтказа
	|	И &УсловиеИсключаемыеСделки
	|
	|СГРУППИРОВАТЬ ПО
	|	Сделки.ЭтапСделки");
	
	ПрименитьУсловияФильтрации(Запрос, СтруктураОтборов);
	
	Результат = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(XMLСтрока(Выборка.ЭтапСделки), Выборка.КоличествоСделок);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает данные сделки.
//
Функция ПолучитьДанныеСделки(Знач СтруктураОтбора, Сделка = Неопределено, ИсключаемыеСделки = Неопределено)
	
	Запрос = ЗапросПолученияДанных(СтруктураОтбора, Сделка, ИсключаемыеСделки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КолонкиРезультата = Новый Массив;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		КолонкиРезультата.Добавить(Колонка.Имя);
	КонецЦикла;
	
	ВыборкаПоЭтапу = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПоЭтапу.Следующий();
	
	Выборка = ВыборкаПоЭтапу.Выбрать();
	Выборка.Следующий();
	
	ДанныеСделки = Новый Структура(СтрСоединить(КолонкиРезультата, ","));
	ЗаполнитьЗначенияСвойств(ДанныеСделки, Выборка);
	
	Возврат ДанныеСделки;
	
КонецФункции

&НаКлиенте
// Процедура, совершает звонок.
//
Процедура СовершитьЗвонок(ИдентификаторСделки, НомерТелефона)
	
	Документ = Элементы.Канбан.Документ;
	
	Клиент			 = ПолучитьКлиентаСделки(ИдентификаторСделки);
	НомерТелефона	 = СтрСоединить(СтрРазделить(НомерТелефона, "()+- "));
	
	IPТелефонияКлиент.ИсходящийЗвонокОсуществитьПоКонтрагенту(Клиент, НомерТелефона);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает контрагента сделки.
//
Функция ПолучитьКлиентаСделки(ИдентификаторСделки)
	
	Сделка = ПолучитьСсылку("Справочники", "Сделки", ИдентификаторСделки);
	
	КлиентСделки = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Сделка, "Контрагент");
	
	Возврат ?(ЗначениеЗаполнено(КлиентСделки), КлиентСделки, Справочники.Контрагенты.ПустаяСсылка());
	
КонецФункции

&НаКлиенте
// Процедура, выполняет переход в чат.
//
Процедура ПерейтиКДиалогу(ИдентификаторКлиента)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИдентификаторКлиента", ИдентификаторКлиента);
	
	ОткрытьФорму("Справочник.Заявки.Форма.ФормаВыбораКонтактаМессенджера", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
// Процедура, открывает форму сотрудника.
//
Процедура ОткрытьСотрудника(ИдентификаторСотрудника)
	
	Если Строка(ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор()) = ИдентификаторСотрудника Тогда
		// Сотрудник не назначен.
		Возврат;
	КонецЕсли;
	
	Сотрудник = ПолучитьСсылку("Справочники", "Сотрудники", ИдентификаторСотрудника);
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		ПоказатьЗначение(, Сотрудник);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, открывает клиента.
//
Процедура ОткрытьКлиента(ИдентификаторКлиента)
	
	Клиент = ПолучитьСсылку("Справочники", "Контрагенты", ИдентификаторКлиента);
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		ПоказатьЗначение(, Клиент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, открывает сделку.
//
Процедура ОткрытьСделку(ИдентификаторСделки)
	
	Сделка = ПолучитьСсылку("Справочники", "Сделки", ИдентификаторСделки);
	
	Если ЗначениеЗаполнено(Сделка) Тогда
		ПоказатьЗначение(, Сделка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, открывает форму создания сделки.
//
Процедура СоздатьСделку()
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВидСделки", ЭтотОбъект.ВидСделки);
	
	ОткрытьФорму("Справочник.Сделки.ФормаОбъекта", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
// Процедура, создает задачу.
//
Процедура СоздатьЗадачу(ИдентификаторСделки, ИдентификаторКлиента)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИдентификаторСделки"	, ИдентификаторСделки);
	ПараметрыОткрытия.Вставить("ИдентификаторКлиента"	, ИдентификаторКлиента);
	
	ОткрытьФорму("Задача.Взаимодействие.ФормаОбъекта", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает массив структур, содержащий данные результата запроса.
//
Функция РезультатЗапросаВМассивСтруктур(РезультатЗапроса)
	
	Результат = Новый Массив;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИменаСвойств = Новый Массив;
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		ИменаСвойств.Добавить(Колонка.Имя);
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаДанных = Новый Структура(СтрСоединить(ИменаСвойств, ","));
		ЗаполнитьЗначенияСвойств(СтрокаДанных, Выборка);
		
		Результат.Добавить(СтрокаДанных);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает номер без лидирующих нулей.
//
Функция ПолучитьНомерНаПечать(Знач Номер)

	Пока Лев(Номер, 1)= "0" Цикл
		Номер = Сред(Номер, 2);
	КонецЦикла;
	
	Возврат Номер;

КонецФункции

&НаСервере
// Функция, возвращает данные.
//
Функция ПолучитьПредставлениеБлоков(ДанныеСделок)
	
	БлокиКанбана = Новый Массив;
	
	Пока ДанныеСделок.Следующий() Цикл
		
		Выборка = ДанныеСделок.Выбрать();
		
		БлокСделок = Новый Массив;
		
		КоличествоБлоков = 0;
		
		Пока Выборка.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(Выборка.Сделка) Тогда
				Продолжить;
			КонецЕсли;
			
			Если КоличествоБлоков = ЭтотОбъект.МаксимальноеКоличествоСделокВКолонке Тогда
				Прервать;
			КонецЕсли;
			
			БлокСделок.Добавить(ПолучитьБлокСделкиДляФормированияКанбана(Выборка));
			КоличествоБлоков = КоличествоБлоков + 1;
			
		КонецЦикла;
		
		Количество = ?(КоличествоБлоков = 0, 0, Выборка.Количество());
		БлокиКанбана.Добавить(ПолучитьБлокКолонки(ДанныеСделок, БлокСделок, Количество));
		
	КонецЦикла;
	
	ПредставлениеБлоковКанбана = СтрСоединить(БлокиКанбана, "," + Символы.ПС);
	
	Возврат ПредставлениеБлоковКанбана;
	
КонецФункции

&НаСервере
// Функция, возвращает данные сделок.
//
Функция ПолучитьДанныеСделок()
	
	СтруктураОтборов = ПолучитьСтруктуруЗначенийОтбора();
	Запрос			 = ЗапросПолученияДанных(СтруктураОтборов);
	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции

&НаСервере
// Процедура, формирует поле HTML.
//
Процедура СформироватьКанбан()
	
	ЭтотОбъект.ТелефонияДоступна	 = Справочники.ТелефонныеАппараты.ПроверитьВозможностьЗвонкаНаДанномПК();
	ЭтотОбъект.МессенджерДоступен	 = ЭтотОбъект.ЭтоПолноправныйПользователь Или РольДоступна(Метаданные.Роли.ИспользованиеМессенджера);
	
	ПараметрыОграничений = Новый Структура;
	ПараметрыОграничений.Вставить("ТелефонияДоступна"	, ЭтотОбъект.ТелефонияДоступна);
	ПараметрыОграничений.Вставить("МессенджерДоступен"	, ЭтотОбъект.МессенджерДоступен);
	
	ДополнительныеСкрипты	 = Новый_Массив(ПолучитьКодОсновногоСкрипта());
	ДополнительныеСтили		 = Новый_Массив(ПолучитьКодДополнительныхСтилей());
	
	УстановитьЗаголовкиДополнительныхОтборов(ЭтотОбъект, ПолучитьСтруктуруЗначенийОтбора());
	
	Канбан = ФормированиеКанбанДосок.ПолучитьHTMLКодКанбана(ПараметрыОграничений, ДополнительныеСкрипты, ДополнительныеСтили, ЭтотОбъект.МаксимальноеКоличествоСделокВКолонке);
	
КонецПроцедуры

&НаСервере
// Функция, возвращает код стилей.
//
Функция ПолучитьКодДополнительныхСтилей()
	
	Возврат
	".col-head{}
	|.col-head svg{fill:inherit}
	|.col-head svg path{fill:inherit}
	|
	|.item-col{background:var(--background-color);padding:15px 10px;margin-bottom:20px;border:1px solid #d4e5ff;flex-grow:1;}
	|.item-col.deleted{background:#fff9fb;border-color:#ffb0c9;}
	|
	|.title-col{padding-right:3px;padding-bottom:3px;cursor:pointer;display:-webkit-inline-box;font-size:15px;color:#246ab1;overflow:hidden;-webkit-line-clamp:2;-webkit-box-orient:vertical;}
	|
	|.deny-reason{font-size:14px;overflow:hidden;text-overflow:ellipsis;white-space:nowrap;margin:-5px 0 10px 0;color:#e91e63;}
	|.deny-reason:empty(display:none;)
	|
	|.deletion-mark{display:none;}
	|.deleted .deletion-mark{display:flex;justify-content:center;color:#ff7777;margin-top:-12px;margin-bottom:6px;font-size:15px;}
	|
	|.deal-row{display:flex;align-items:flex-start;justify-content:space-between;margin-bottom:5px;}
	|
	|.deal{font-size:13px;cursor:pointer;overflow:hidden;text-overflow:ellipsis;white-space:nowrap;padding:3px 2px;max-width:fit-content;margin:7px 0;}
	|.deal:hover{text-decoration:underline;}
	|.deal:empty{display:none;}
	|
	|.doctor::before{content:'Врач';}
	|.manager::before{content:'Куратор';}
	|.manager::before, .doctor::before{display:block;color:#999;font-size:13px;}
	|.manager:hover::before, .doctor:hover::before{text-decoration:underline;text-decoration-color:var(--background-color);}
	|
	|.comment::before{content:'Описание';}
	|
	|.client-name{margin:-5px 0 5px 0;}
	|
	|.visit-type{font-size:12px;color:grey;display:flex;align-items:center;margin:0 0 0 -5px;}
	|.visit-type::after{content:'Повторный прием';}
	|.visit-type::before{margin-right:5px;content:url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABgAAAAYBAMAAAASWSDLAAAABGdBTUEAALGPC/xhBQAAACBjSFJNAAB6JgAAgIQAAPoAAACA6AAAdTAAAOpgAAA6mAAAF3CculE8AAAAFVBMVEUAAAD/bwD/bgD/cAD/bwD/bwAAAAAaFldnAAAABXRSTlMAiH+Ad0DJy9wAAAABYktHRACIBR1IAAAACXBIWXMAAABgAAAAYADwa0LPAAAAB3RJTUUH5goTCQEwNMaIjQAAAEtJREFUGNNjYCAIGJE5rALInEAIFQoBAsgcBTAnAEwGMSBxFJA4zAxIHCIBTLEBEoc5AIljisRhhroGzGFB5jC4IlvKguICA8KuAAAptw/iLuu9uAAAACV0RVh0ZGF0ZTpjcmVhdGUAMjAyMi0xMC0xOVQwOTowMTo0OCswMDowMMKEcOIAAAAldEVYdGRhdGU6bW9kaWZ5ADIwMjItMTAtMTlUMDk6MDE6NDgrMDA6MDCz2cheAAAAKHRFWHRkYXRlOnRpbWVzdGFtcAAyMDIyLTEwLTE5VDA5OjAxOjQ4KzAwOjAw5MzpgQAAAABJRU5ErkJggg==');}
	|.visit-type.first{display:none;}
	|
	|.referred-from{font-size:12px;color:grey;display:flex;align-items:center;margin:-5px 0 0 -5px;}
	|.referred-from::before{margin-right:5px;content:url('data:image/svg+xml,<svg xmlns=""http://www.w3.org/2000/svg"" width=""24"" height=""24"" viewBox=""0 0 24 24""><path fill=""rgb(48, 114, 207)"" d=""M7,17L10.2,10.2L17,7L13.8,13.8L7,17M12,11.1A0.9,0.9 0 0,0 11.1,12A0.9,0.9 0 0,0 12,12.9A0.9,0.9 0 0,0 12.9,12A0.9,0.9 0 0,0 12,11.1M12,2A10,10 0 0,1 22,12A10,10 0 0,1 12,22A10,10 0 0,1 2,12A10,10 0 0,1 12,2M12,4A8,8 0 0,0 4,12A8,8 0 0,0 12,20A8,8 0 0,0 20,12A8,8 0 0,0 12,4Z"" /></svg>');}
	|.referred-from:empty{display:none;}
	|
	|.tasks{display:flex;flex-wrap:wrap;font-size:14px;margin-top:15px;align-items:center;position:relative;}
	|
	|.current-tasks{display:flex;align-items:center;cursor:pointer;padding:5px 10px 5px 0;}
	|
	|.current-tasks::before{content:'Дела';color:#246ab1;}
	|.current-tasks::after{content:attr(data-task-count);display:inline-flex;padding:1px 7px;border-radius:50px;color:#fff;margin-left:6px;background:red;text-align:center;justify-content:center;align-items:center;}
	|.current-tasks[data-task-count='']::after{display:none;}
	|.current-tasks[data-task-count='0']::after{display:none;}
	|
	|.create-task{display:inline;margin-left:auto;cursor:pointer;padding:2px 5px;color:lightslategrey;}
	|
	|body{--menu-color:var(--background-color);}
	|.menu{position:absolute;width:400px;z-index:1;white-space:break-spaces;display:none;flex-direction:column;cursor:default;}
	|.menu.active{display:flex;}
	|
	|.menu-container{position:relative;margin-top:-12px;padding:5px 5px;background:var(--menu-color);display:flex;flex-direction:column;box-shadow:1px 1px 10px 1px #cfcfcf;max-height:350px;overflow-y:auto;}
	|.menu-container:empty::after{content:'Ничего не запланировано';margin: 10px auto;color: #777777;font-size: 16px;}
	|
	|.menu-container .container {display:flex;flex-direction:column;flex-grow:1;flex-shrink:0;}
	|.menu-container .task {display: flex;margin:5px 10px;align-items: center;min-height: 60px;flex-shrink:0;}
	|.menu-container .checkbox-wrapper{display:flex;}
	|.menu-container .checkbox-wrapper:hover{background:radial-gradient(closest-side, #b5c5d7, var(--menu-color));}
	|.menu-container .checkbox {display:inline;cursor:pointer;width:24px;height:24px;background:no-repeat url(""data:image/svg+xml,<svg xmlns='http://www.w3.org/2000/svg' width='24' height='24' viewBox='0 0 24 24'><path fill='rgb(150, 150, 150)' d='M19,3H5C3.89,3 3,3.89 3,5V19A2,2 0 0,0 5,21H19A2,2 0 0,0 21,19V5C21,3.89 20.1,3 19,3M19,5V19H5V5H19Z' /></svg>"");}
	|.menu-container .task-data {cursor:pointer;margin: 0 10px;flex-grow: 1;width: 250px;display: flex;flex-direction: column;}
	|.menu-container .date {color: #1c71cf;font-size:13px;}
	|.menu-container .date.timed-out {color: #ff4d4d;}
	|.menu-container .theme {text-overflow: ellipsis;overflow: hidden;white-space: nowrap;font-size: 16px;color: cornflowerblue;margin: 5px 0;}
	|.menu-container .description {white-space: pre-line;display: -webkit-box;-webkit-line-clamp: 2;-webkit-box-orient: vertical;overflow: hidden;font-size: 14px;color: #555555;}
	|.menu-container .task-type {display: flex;flex-direction: column;align-items: center;max-width: 80px;width: 80px;flex-grow: 1;}
	|.menu-container .interaction-type {white-space: break-spaces;text-align: center;color: #999;font-size:12px;}
	|
	|.menu-container .margin {border-bottom:1px #bbbbbb solid;margin:5px 0;}
	|.menu-container :last-child .margin{display:none;}
	|
	|";
	
КонецФункции

&НаСервере
// Функция, возвращает код скрипта.
//
Функция ПолучитьКодОсновногоСкрипта()
	
	ДанныеСделок = ПолучитьДанныеСделок();
	
	ПредставлениеБлоковКанбана = ПолучитьПредставлениеБлоков(ДанныеСделок);
	
	Возврат
	"var dropTarget;
	|var dropSource;
	|var dropElement;
	|
	|function fireEvent(eventName) {
	|	eventSender = document.getElementById('eventSender');
	|	eventSender.dataset.eventName = eventName;
	|	eventSender.click();
	|}
	|
	|var kanban = new jKanban({
	|  element: '#myKanban',
	|  gutter: '10px',
	|  widthBoard: '',
	|  dragBoards: false,
	|  itemHandleOptions:{
	|    enabled: false,
	|  },
	|  dragEl: function(el, source){
	// Запрещаем перемещать кнопку "Показать все".
	|    if (el.classList.contains('show-all')) {
	|    	throw 149;
	|    }" +
	// Для предопределенного вида сделки - если клиент не пришел, то этап изменять нельзя.
	?(ЭтотОбъект.ВидСделки <> ЭтотОбъект.ВидСделкиПоУмолчанию, "", "
	|    if (el.querySelector('.deny-reason').id == '" + ЭтотОбъект.ДанныеПредопределенногоВидаСделки["ИдентификаторПричиныОтказаНеПришел"] + "') {
	|    	throw 149;
	|    }") + "
	|  },
	|  dropEl: function(el, target, source, sibling){
	|    dropTarget = target;
	|    dropSource = source;
	|    dropElement = el;
	|    fireEvent('drop');
	|  },
	|  itemAddOptions: {
	|    enabled: false
	|  },
	|  boards: [
	|		" + ПредставлениеБлоковКанбана + "
	|  ]
	|});
	|
	|let kanbanContainer = document.querySelector('.kanban-container');
	|
	|let createButton = document.createElement('div');
	|createButton.title = 'Создать сделку';
	|createButton.className = 'button-create';
	|createButton.innerText = '+';
	|
	|kanbanContainer.children[0].children[0].after(createButton);
	|
	|for (let child of kanbanContainer.children) {
	|	
	|	let newElement = document.createElement('div');
	|	newElement.className = 'show-all';
	|	newElement.innerText = 'Показать все';
	|	newElement.dataset.count = child.querySelector('.item-count').dataset.count;
	|	newElement.dataset.id = child.dataset.id;
	|	
	|	child.querySelector('.kanban-drag').append(newElement);
	|	
	|}
	|
	|" + СформироватьКодСтилизацииКолонокКанбана(ДанныеСделок);
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает код стилизации колонок канбана.
//
Функция СформироватьКодСтилизацииКолонокКанбана(ДанныеСделок)
	
	КодСтилизацииКолонокКанбана = "";
	
	МассивТекстовКоманд = Новый Массив;
	
	ДанныеСделок.Сбросить();
	
	Пока ДанныеСделок.Следующий() Цикл
		
		Если ДанныеСделок.ИмяПредопределенногоЭтапа = "Успех" Тогда
			ЦветЭтапа		 = Новый Цвет(0, 185, 97);
			ЦветТекстаЭтапа	 = Новый Цвет(255, 255, 255);
			
		ИначеЕсли ДанныеСделок.ИмяПредопределенногоЭтапа = "Отказ" Тогда
			ЦветЭтапа		 = Новый Цвет(255, 50, 50);
			ЦветТекстаЭтапа	 = Новый Цвет(255, 255, 255);
			
		Иначе
			ЦветЭтапа		 = ?(ЗначениеЗаполнено(ДанныеСделок.ЦветЭтапа), ЗначениеИзСтрокиВнутр(ДанныеСделок.ЦветЭтапа), Новый Цвет(242, 242, 242));
			ЦветТекстаЭтапа	 = ОбщегоНазначенияСтоматология.ПолучитьЦветТекстаПоЦветуФона(ЦветЭтапа, Истина);
			
		КонецЕсли;
		
		ЦветЭтапаHTML	 = ПолучитьЦветДляHTML(ЦветЭтапа);
		ЦветТекстаHTML	 = ПолучитьЦветДляHTML(ЦветТекстаЭтапа);
		
		СтильЦветФонаЭтапа		 = "background:" + ЦветЭтапаHTML + ";";
		СтильЦветТекстаЭтапа	 = "color:" + ЦветТекстаHTML + ";";
		СтильЦветЗаливки		 = "fill:" + ЦветЭтапаHTML + ";";
		
		СтильКолонкиКанбана = СтильЦветФонаЭтапа + " " + СтильЦветТекстаЭтапа + " " + СтильЦветЗаливки;
		
		ТекстКоманды =
		"document.querySelector('.kanban-board[data-id=""" + XMLСтрока(ДанныеСделок.ЭтапСделки) + """] .kanban-board-header').style = '" + СтильКолонкиКанбана + "';";
		МассивТекстовКоманд.Добавить(ТекстКоманды);
		
	КонецЦикла;
	
	КодСтилизацииКолонокКанбана = СтрСоединить(МассивТекстовКоманд, Символы.ПС);
	
	Возврат КодСтилизацииКолонокКанбана;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает ссылку на объект.
//
Функция ПолучитьСсылку(ВидОбъекта, ИмяОбъекта, Идентификатор)
	
	Возврат ПолучитьСсылкуОбъектаПоUID(ВидОбъекта, ИмяОбъекта, Идентификатор);
	
КонецФункции

#Область ____________________ОБРАБОТЧИКИ_МЕХАНИЗМА_ФИЛЬТРАЦИИ_ДАННЫХ________________________

#Область __________________ИНИЦИАЛИЗАЦИЯ_МЕХАНИЗМА_ФИЛЬТРАЦИИ______________________

&НаСервере
// Процедура - Инициализировать механизм фильтрации данных
//
// Параметры:
//  ПараметрыОтбора	 - 	 - 
//  ОбновитьСписок	 - 	 - 
//
Процедура ИнициализироватьМеханизмФильтрацииДанных(ПараметрыОтбора = Неопределено)
	
	РезультатПакетногоЗапроса = ПолучитьПакетЗапросаЗначенийДляОтборов(ЭтотОбъект.ТекущийСотрудник);	
	
	ОбновитьДинамическоеМенюФильтрации_Статус(РезультатПакетногоЗапроса[8].Выгрузить());
	ОбновитьДинамическоеМенюФильтрации_СтруктурнаяЕдиница(РезультатПакетногоЗапроса[9].Выгрузить());
	ОбновитьДинамическоеМенюФильтрации_ВидСделки(РезультатПакетногоЗапроса[10].Выгрузить());
	ОбновитьДинамическоеМенюФильтрации_Этап(РезультатПакетногоЗапроса[6].Выгрузить());
	ОбновитьДинамическоеМенюФильтрации_СотрудникРегистрации(РезультатПакетногоЗапроса[3].Выгрузить());
	ОбновитьДинамическоеМенюФильтрации_РекламныйИсточник(РезультатПакетногоЗапроса[4].Выгрузить());
	ОбновитьДинамическоеМенюФильтрации_Тег(РезультатПакетногоЗапроса[7].Выгрузить());
	ОбновитьДинамическоеМенюФильтрации_ПредварительнаяЗапись();
	ОбновитьДинамическоеМенюФильтрации_Задача();
	ОбновитьДинамическоеМенюФильтрации_ПризнакВыполненияСделки();
	ОбновитьДинамическоеМенюФильтрации_ПометкаУдаленияСделки();
	ОбновитьДинамическоеМенюФильтрации_ПричинаОтказа(РезультатПакетногоЗапроса[11].Выгрузить());
	ОбновитьДинамическоеМенюФильтрации_Менеджер(РезультатПакетногоЗапроса[1].Выгрузить());
	ОбновитьДинамическоеМенюФильтрации_СозданаПериод();
	ОбновитьДинамическоеМенюФильтрации_ПериодЗапланированнойЗадачи();
	ОбновитьДинамическоеМенюФильтрации_ЗавершенаПериод();
	ОбновитьДинамическоеМенюФильтрации_КаналПривлечения(РезультатПакетногоЗапроса[12].Выгрузить());
	
	ОбновитьОтборНаСервере(,, Истина, Истина);
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр статус.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Статус(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию	
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра	
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Статус пациента'; en = 'Patient status'"));	
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Статус");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Статус");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Статус");	
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Статус");	
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Статус");	
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыКонтрагентов"));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)	
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра	
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																														
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр вид сделки.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ВидСделки(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Вид сделки'; en = 'Type of transaction'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ВидСделки");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ВидСделки");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ВидСделки");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ВидСделки");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ВидСделки");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.ВидыСделок"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																											
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр этап.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Этап(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Этап'; en = 'Stage'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Этап");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Этап");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Этап");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Этап");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Этап");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.ЭтапыСделок"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
		
КонецПроцедуры

&НаСервере
// Процедура - Обновить динамическое меню фильтрации причина отказа
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ПричинаОтказа(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Причина отказа'; en = 'Rejection reason'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ПричинаОтказа");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ПричинаОтказа");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ПричинаОтказа");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ПричинаОтказа");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ПричинаОтказа");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.ПричиныОтказов"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр структурная единица.
//
// Параметры:
//  ТаблицаСтруктурныхЕдиниц - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_СтруктурнаяЕдиница(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Клиника'; en = 'Clinics'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.СтруктурныеЕдиницы.ПустаяСсылка(), Нстр("ru = '<не указана>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр сотрудник регистрации.
//
// Параметры:
//  ТаблицаСтатусов			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_СотрудникРегистрации(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Кем создан'; en = 'Who created'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_СотрудникРегистрации");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_СотрудникРегистрации");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_СотрудникРегистрации");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_СотрудникРегистрации");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_СотрудникРегистрации");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.Сотрудники.ПустаяСсылка(), НСтр("ru = '<не указан>'; en = '<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр рекламный источник.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_РекламныйИсточник(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Источник'; en = 'Source'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_РекламныйИсточник");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_РекламныйИсточник");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_РекламныйИсточник");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_РекламныйИсточник");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_РекламныйИсточник");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.РекламныеИсточники"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.РекламныеИсточники.ПустаяСсылка(), НСтр("ru = '<не указан>'; en = '<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр тег.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Тег(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Тег'; en = 'Tag'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Тег");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Тег");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Тег");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Тег");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Тег");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.Теги"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.Теги.ПустаяСсылка(), НСтр("ru = '<не указан>'; en = '<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр интерес.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Интерес(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Интерес'; en = 'Interest'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Интерес");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Интерес");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Интерес");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Интерес");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Интерес");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.Интересы"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.Интересы.ПустаяСсылка(), НСтр("ru = '<не указан>'; en = '<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр канал привлечения.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_КаналПривлечения(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Рекламная площадка'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_КаналПривлечения");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_КаналПривлечения");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_КаналПривлечения");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_КаналПривлечения");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_КаналПривлечения");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.КаналыПривлечения"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.КаналыПривлечения.ПустаяСсылка(), НСтр("ru = '<не указана>'; en = '<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура - Обновить динамическое меню фильтрации предварительная запись
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ПредварительнаяЗапись(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Назначенный прием'; en = 'Appointment appointment'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ПредварительнаяЗапись");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ПредварительнаяЗапись");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ПредварительнаяЗапись");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ПредварительнаяЗапись");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ПредварительнаяЗапись");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("Булево"));	

	// Формируем коллекцию сами
	КоллекцияЗначений = Новый ТаблицаЗначений;
	КоллекцияЗначений.Колонки.Добавить("Ссылка"			, Новый ОписаниеТипов("Булево"));
	КоллекцияЗначений.Колонки.Добавить("Представление"	, Новый ОписаниеТипов("Строка"));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", Ложь, НСтр("ru= 'Нет назначенного приема'; en='No appointment'")));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр задача.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Задача(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Задачи'; en = 'Tasks'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Задача");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Задача");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Задача");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Задача");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Задача");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("Булево"));	

	// Формируем коллекцию сами
	КоллекцияЗначений = Новый ТаблицаЗначений;
	КоллекцияЗначений.Колонки.Добавить("Ссылка"			, Новый ОписаниеТипов("Булево"));
	КоллекцияЗначений.Колонки.Добавить("Представление"	, Новый ОписаниеТипов("Строка"));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", Ложь, НСтр("ru= 'Нет задач'; en='No tasks'")));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр менеджер.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Менеджер(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Куратор'; en = 'Curator'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Менеджер");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Менеджер");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Менеджер");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Менеджер");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Менеджер");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.Сотрудники.ПустаяСсылка(), НСтр("ru = '<не указан>'; en = '<not specified>'"), , Истина);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура - Обновить динамическое меню фильтрации врач
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Врач(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Врач'; en = 'Doctor'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Врач");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Врач");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Врач");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Врач");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Врач");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.Сотрудники.ПустаяСсылка(), НСтр("ru = '<не указан>'; en = '<not specified>'"), , Истина);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр признак выполнения сделки.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ПризнакВыполненияСделки(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Статус сделки'; en = 'Deal status'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ПризнакВыполненияСделки");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ПризнакВыполненияСделки");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ПризнакВыполненияСделки");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ПризнакВыполненияСделки");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ПризнакВыполненияСделки");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("Булево"));	

	// Формируем коллекцию сами
	КоллекцияЗначений = Новый ТаблицаЗначений;
	КоллекцияЗначений.Колонки.Добавить("Ссылка"			, Новый ОписаниеТипов("Булево"));
	КоллекцияЗначений.Колонки.Добавить("Представление"	, Новый ОписаниеТипов("Строка"));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", Истина	, НСтр("ru= 'Завершена'; en='Completed'")));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", Ложь	, НСтр("ru= 'Не завершена'; en='Not completed'")));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура - Обновить динамическое меню фильтрации пометка удаления сделки
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ПометкаУдаленияСделки(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Пометка удаления'; en = 'Delete mark'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ПометкаУдаленияСделки");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ПометкаУдаленияСделки");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ПометкаУдаленияСделки");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ПометкаУдаленияСделки");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ПометкаУдаленияСделки");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("Булево"));	
	СтруктураФильтра.Вставить("ВариантОтбора"							, Ложь);
	
	// Формируем коллекцию сами
	КоллекцияЗначений = Новый ТаблицаЗначений;
	КоллекцияЗначений.Колонки.Добавить("Ссылка"			, Новый ОписаниеТипов("Булево"));
	КоллекцияЗначений.Колонки.Добавить("Представление"	, Новый ОписаниеТипов("Строка"));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", Истина, НСтр("ru= 'Удалена'; en='Deleted'") ));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр период создана.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_СозданаПериод(ДанныеПериода = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Создана'; en = 'Created by'"));
	СтруктураФильтра.Вставить("РеквизитДата"							, НачалоДня(ТекущаяДатаСеанса()));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_СозданаПериод");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_СозданаПериод");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_СозданаПериод");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_СозданаПериод");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_СозданаПериод");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СтандартныйПериод"));
	
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, , Новый СтандартныйПериод, НСтр("ru = 'За весь период'; en = 'For all period'"));
																												
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры 

&НаСервере
// Процедура, инициализировать фильтр период завершена.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ЗавершенаПериод(ДанныеПериода = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Завершена'; en = 'Completed'"));
	СтруктураФильтра.Вставить("РеквизитДата"							, НачалоДня(ТекущаяДатаСеанса()));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ЗавершенаПериод");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ЗавершенаПериод");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ЗавершенаПериод");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ЗавершенаПериод");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ЗавершенаПериод");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СтандартныйПериод"));
	
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, , Новый СтандартныйПериод, НСтр("ru = 'За весь период'; en = 'For all period'"));
																												
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр период запланированной задачи.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ПериодЗапланированнойЗадачи(ДанныеПериода = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Запланированная задача'; en = 'Scheduled task'"));
	СтруктураФильтра.Вставить("РеквизитДата"							, НачалоДня(ТекущаяДатаСеанса()));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ПериодЗапланированнойЗадачи");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ПериодЗапланированнойЗадачи");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ПериодЗапланированнойЗадачи");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ПериодЗапланированнойЗадачи");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ПериодЗапланированнойЗадачи");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СтандартныйПериод"));
	
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, , Новый СтандартныйПериод, НСтр("ru = 'За весь период'; en = 'For all period'"));
																												
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура - Обновить значения фильтрации данных.
//
// Параметры:
//  ПараметрыОтбора				 - 	 - 
//  ОчиститьВсеФильтры			 - 	 - 
//  МассивИменОчищаемыхФильтров	 - 	 - 
//
Процедура ОбновитьЗначенияФильтрацииДанных(ПараметрыОтбора, ОчиститьВсеФильтры = Истина, МассивИменОчищаемыхФильтров = Неопределено)
	
	Если ОчиститьВсеФильтры Тогда 
		МассивИменОчищаемыхФильтров = Новый Массив();
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Статус");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_СтруктурнаяЕдиница");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ВидСделки");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Этап");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Менеджер");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Врач");		
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_СотрудникРегистрации");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_РекламныйИсточник");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Тег");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Интерес");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПредварительнаяЗапись"); 		
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Задача"); 
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_КаналПривлечения");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПризнакВыполненияСделки");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПометкаУдаленияСделки");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_СозданаПериод");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ЗавершенаПериод"); 
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПериодЗапланированнойЗадачи");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПричинаОтказа");		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивИменОчищаемыхФильтров) Тогда 
		УправлениеИнтерфейсамиСервер.ДеактивироватьВсеЗначенияФильтрацииДанных(ЭтаФорма, МассивИменОчищаемыхФильтров);
	КонецЕсли;
	
	СписокСтатусовПометокУдаления = Новый СписокЗначений;
	СписокСтатусовПометокУдаления.Добавить(Истина, , Ложь);
	УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПометкаУдаленияСделки", СписокСтатусовПометокУдаления, Истина);		
	
	// Отбор статус.
	Если ПараметрыОтбора.Свойство("ОчиститьОтборПоСтатусу") Тогда 	
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Статус", ПараметрыОтбора.ОчиститьОтборПоСтатусу);
	КонецЕсли;
	
	// Отбор структурная единица.
	Если ПараметрыОтбора.Свойство("МассивСтруктурныхЕдиниц") Тогда 
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтруктурнаяЕдиница", ПараметрыОтбора.МассивСтруктурныхЕдиниц);		
	Иначе 
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	КонецЕсли;
	
	// Отбор вид сделки.
	Если ПараметрыОтбора.Свойство("МассивВидовСделок") Тогда 	
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ВидСделки", ПараметрыОтбора.МассивВидовСделок);		
	КонецЕсли;

	// Отбор этапы сделки.
	Если ПараметрыОтбора.Свойство("МассивЭтапов") Тогда 		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Этап", ПараметрыОтбора.МассивЭтапов);		
	КонецЕсли;	
	
	// Отбор причина отказа.
	Если ПараметрыОтбора.Свойство("МассивПричинОтказов") Тогда 		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПричинаОтказа", ПараметрыОтбора.МассивПричинОтказов);		
	КонецЕсли;	
	
	// Отбор признак наличия назначенного приема.
	Если ПараметрыОтбора.Свойство("МассивСтатусовНаличияПредварительнойЗаписи") ИЛИ ПараметрыОтбора.Свойство("СписокСтатусовНаличияПредварительнойЗаписи") Тогда 
		Если ПараметрыОтбора.Свойство("МассивСтатусовНаличияПредварительнойЗаписи") Тогда 
			МассивСтатусовНаличияПредварительнойЗаписи = Новый Массив();
			Если ЗначениеЗаполнено(ПараметрыОтбора.МассивСтатусовНаличияПредварительнойЗаписи) 
				И ПараметрыОтбора.МассивСтатусовНаличияПредварительнойЗаписи[0] = "Нет назначенного приема" Тогда
				
				МассивСтатусовНаличияПредварительнойЗаписи.Добавить(Ложь);
			Иначе
				МассивСтатусовНаличияПредварительнойЗаписи.Добавить(Истина);		
			КонецЕсли;
			УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПредварительнаяЗапись", МассивСтатусовНаличияПредварительнойЗаписи);
		ИначеЕсли ЗначениеЗаполнено(ПараметрыОтбора.СписокСтатусовНаличияПредварительнойЗаписи) 
				И ПараметрыОтбора.СписокСтатусовНаличияПредварительнойЗаписи[0].Значение = Ложь Тогда
			УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПредварительнаяЗапись", ПараметрыОтбора.СписокСтатусовНаличияПредварительнойЗаписи); 
		КонецЕсли;
		ОбновитьСписок = Истина;
	КонецЕсли;
	
	// Отбор признак наличия задач.
	Если ПараметрыОтбора.Свойство("МассивСтатусовНаличияЗадач") Тогда 
		
		МассивСтатусовНаличияЗадач = Новый Массив();
		Если ЗначениеЗаполнено(ПараметрыОтбора.МассивСтатусовНаличияЗадач) 
			И ПараметрыОтбора.МассивСтатусовНаличияЗадач[0] = "Нет задач" Тогда
			
			МассивСтатусовНаличияЗадач.Добавить(Ложь);
		Иначе
			МассивСтатусовНаличияЗадач.Добавить(Истина);		
		КонецЕсли;

		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Задача", МассивСтатусовНаличияЗадач);
		ОбновитьСписок = Истина;
	КонецЕсли;
	
	// Отбор статусов сделки.
	Если ПараметрыОтбора.Свойство("МассивСтатусовСделок") Тогда
		
		МассивСтатусовСделок = Новый Массив();
		Если ЗначениеЗаполнено(ПараметрыОтбора.МассивСтатусовСделок) 
			И ПараметрыОтбора.МассивСтатусовСделок[0] = "Нет" Тогда
			
			МассивСтатусовСделок.Добавить(Ложь);
		Иначе
			МассивСтатусовСделок.Добавить(Истина);		
		КонецЕсли;
		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПризнакВыполненияСделки", МассивСтатусовСделок);
	
	КонецЕсли;

	// Отбор менеджеров.
	Если ПараметрыОтбора.Свойство("МассивМенеджеров") Тогда 		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Менеджер", ПараметрыОтбора.МассивМенеджеров);
	КонецЕсли;	
	
	// Отбор врач.
	Если ПараметрыОтбора.Свойство("МассивВрачей") Тогда 		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Врач", ПараметрыОтбора.МассивВрачей);
	КонецЕсли;	
	
	// Отбор период запланированной задачи
	Если ПараметрыОтбора.Свойство("ПериодПланирования") Тогда    	
		
		МассивПериодаЗапланированнойЗадачи = Новый Массив();
		МассивПериодаЗапланированнойЗадачи.Добавить(ПараметрыОтбора.ПериодПланирования);
		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПериодЗапланированнойЗадачи", МассивПериодаЗапланированнойЗадачи);

	КонецЕсли;	
	
	// Отбор периода завершения сделки.
	Если ПараметрыОтбора.Свойство("ПериодСделки") Тогда    
		
		МассивПериодаЗавершенияСделки = Новый Массив();
		МассивПериодаЗавершенияСделки.Добавить(ПараметрыОтбора.ПериодСделки);
		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ЗавершенаПериод", МассивПериодаЗавершенияСделки);
		
	КонецЕсли;
	
	СформироватьКанбан();
	
КонецПроцедуры

&НаСервере
// Функция, возвращает структуру отборов формы.
//
Функция ПолучитьСтруктуруЗначенийОтбора()
	
	// Метод "ПолучитьЗначенияФильтра" возвращает список активированных значений фильтра.
	// У полученного списка значений есть свойство "ДоступныеЗначения", в котором хранится список всех значений.
	// Таким образом мы одним методом за одну итерацию получаем 2 списка значений(с активированными значениями и всеми значениями).
	// Вариант отбора передается в свойстве "ДоступныеЗначения" в представлении у любого элемента списка.
	
	СтруктураОтборов = Новый Структура;
	СтруктураОтборов.Вставить("ОтборСтатус"						, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Статус"));
	СтруктураОтборов.Вставить("ОтборСтруктурнаяЕдиница"			, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СтруктурнаяЕдиница"));
	СтруктураОтборов.Вставить("ОтборМенеджер"					, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Менеджер"));		
	СтруктураОтборов.Вставить("ОтборВрач"						, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Врач"));	
	СтруктураОтборов.Вставить("ОтборВидСделки"					, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ВидСделки"));	
	СтруктураОтборов.Вставить("ОтборЭтап"						, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Этап"));
	СтруктураОтборов.Вставить("ОтборСотрудникРегистрации"		, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СотрудникРегистрации"));
	СтруктураОтборов.Вставить("ОтборРекламныйИсточник"			, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_РекламныйИсточник"));
	СтруктураОтборов.Вставить("ОтборКаналПривлечения"			, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_КаналПривлечения"));
	СтруктураОтборов.Вставить("ОтборТег"						, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Тег"));
	СтруктураОтборов.Вставить("ОтборПредварительнаяЗапись"		, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПредварительнаяЗапись"));	
	СтруктураОтборов.Вставить("ОтборЗадача"	 					, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Задача"));		
	СтруктураОтборов.Вставить("ОтборЗавершена"					, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПризнакВыполненияСделки"));
	СтруктураОтборов.Вставить("ОтборДатаСоздания"				, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СозданаПериод"));
	СтруктураОтборов.Вставить("ОтборДатаЗавершенияСделки"		, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ЗавершенаПериод"));
	СтруктураОтборов.Вставить("ОтборДатаЗапланированнойЗадачи"	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПериодЗапланированнойЗадачи"));
	СтруктураОтборов.Вставить("ОтборПометкаУдаления"			, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПометкаУдаленияСделки"));
	СтруктураОтборов.Вставить("ОтборПричинаОтказа"				, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПричинаОтказа"));
	СтруктураОтборов.Вставить("ВидСделки"						, ЭтотОбъект.ВидСделки);
	СтруктураОтборов.Вставить("ОтборСтатусПациента"				, ЭтотОбъект.ОтборСтатусПациента);
		
	Возврат СтруктураОтборов;
	
КонецФункции	

&НаКлиенте
// Функция, возвращает структуру отборов формы.
//
Функция ПолучитьСтруктуруЗначенийОтбораКлиент()
	
	// Метод "ПолучитьЗначенияФильтра" возвращает список активированных значений фильтра.
	// У полученного списка значений есть свойство "ДоступныеЗначения", в котором хранится список всех значений.
	// Таким образом мы одним методом за одну итерацию получаем 2 списка значений(с активированными значениями и всеми значениями).
	// Вариант отбора передается в свойстве "ДоступныеЗначения" в представлении у любого элемента списка.
	
	СтруктураОтборов = Новый Структура;
	СтруктураОтборов.Вставить("ОтборСтатус"						, УправлениеИнтерфейсамиКлиент.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Статус"));
	СтруктураОтборов.Вставить("ОтборСтруктурнаяЕдиница"			, УправлениеИнтерфейсамиКлиент.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СтруктурнаяЕдиница"));
	СтруктураОтборов.Вставить("ОтборМенеджер"					, УправлениеИнтерфейсамиКлиент.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Менеджер"));		
	СтруктураОтборов.Вставить("ОтборВрач"						, УправлениеИнтерфейсамиКлиент.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Врач"));	
	СтруктураОтборов.Вставить("ОтборВидСделки"					, УправлениеИнтерфейсамиКлиент.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ВидСделки"));	
	СтруктураОтборов.Вставить("ОтборЭтап"						, УправлениеИнтерфейсамиКлиент.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Этап"));
	СтруктураОтборов.Вставить("ОтборСотрудникРегистрации"		, УправлениеИнтерфейсамиКлиент.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СотрудникРегистрации"));
	СтруктураОтборов.Вставить("ОтборРекламныйИсточник"			, УправлениеИнтерфейсамиКлиент.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_РекламныйИсточник"));
	СтруктураОтборов.Вставить("ОтборКаналПривлечения"			, УправлениеИнтерфейсамиКлиент.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_КаналПривлечения"));
	СтруктураОтборов.Вставить("ОтборТег"						, УправлениеИнтерфейсамиКлиент.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Тег"));
	СтруктураОтборов.Вставить("ОтборПредварительнаяЗапись"		, УправлениеИнтерфейсамиКлиент.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПредварительнаяЗапись"));	
	СтруктураОтборов.Вставить("ОтборЗадача"	 					, УправлениеИнтерфейсамиКлиент.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Задача"));		
	СтруктураОтборов.Вставить("ОтборЗавершена"					, УправлениеИнтерфейсамиКлиент.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПризнакВыполненияСделки"));
	СтруктураОтборов.Вставить("ОтборДатаСоздания"				, УправлениеИнтерфейсамиКлиент.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СозданаПериод"));
	СтруктураОтборов.Вставить("ОтборДатаЗавершенияСделки"		, УправлениеИнтерфейсамиКлиент.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ЗавершенаПериод"));
	СтруктураОтборов.Вставить("ОтборДатаЗапланированнойЗадачи"	, УправлениеИнтерфейсамиКлиент.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПериодЗапланированнойЗадачи"));
	СтруктураОтборов.Вставить("ОтборПометкаУдаления"			, УправлениеИнтерфейсамиКлиент.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПометкаУдаленияСделки"));
	СтруктураОтборов.Вставить("ОтборПричинаОтказа"				, УправлениеИнтерфейсамиКлиент.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПричинаОтказа"));
	СтруктураОтборов.Вставить("ВидСделки"						, ЭтотОбъект.ВидСделки);
	СтруктураОтборов.Вставить("ОтборСтатусПациента"				, ЭтотОбъект.ОтборСтатусПациента);
	
	Возврат СтруктураОтборов;
	
КонецФункции	

&НаСервереБезКонтекста
// Функция, возвращает запрос с установленными параметрами, для списка формы.
//
Функция ЗапросПолученияДанных(СтруктураОтборов, Сделка = Неопределено, ИсключаемыеСделки = Неопределено)
	
	// Текст запроса без отборов (чистый).
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭтапыСделок.Ссылка КАК ЭтапСделки,
	|	ЭтапыСделок.НомерЭтапа КАК НомерЭтапа
	|ПОМЕСТИТЬ ЭтапыСделок
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.ВидСделки В(&ВидСделки)
	|	И НЕ ЭтапыСделок.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЭтапыСделок.Ссылка,
	|	999999
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.ИмяПредопределенныхДанных = ""Отказ""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЭтапыСделок.Ссылка,
	|	999998
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.ИмяПредопределенныхДанных = ""Успех""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сделки.Ссылка КАК Сделка,
	|	Сделки.ЭтапСделки КАК ЭтапСделки,
	|	Сделки.НаименованиеСокращенное КАК ПредставлениеСделки,
	|	Сделки.ПометкаУдаления КАК ПометкаУдаления,
	|	Сделки.ДатаСделки КАК ДатаСделки,
	|	Сделки.ДатаЗавершенияСделки КАК ДатаЗавершенияСделки,
	|	Сделки.Контрагент КАК Клиент,
	|	ПРЕДСТАВЛЕНИЕ(Сделки.Контрагент) КАК ПредставлениеКлиента,
	|	Сделки.Контрагент.Телефон КАК НомерТелефона,
	|	Сделки.ПричинаОтказа КАК ПричинаОтказа,
	|	ПРЕДСТАВЛЕНИЕ(Сделки.ПричинаОтказа) КАК ПричинаОтказаНаименование,
	|	ПРЕДСТАВЛЕНИЕ(Сделки.ИсточникИнформации) КАК ПредставлениеРекламногоИсточника,
	|	ПРЕДСТАВЛЕНИЕ(Сделки.КаналПривлечения) КАК ПредставлениеКаналаПривлечения,
	|	ПРЕДСТАВЛЕНИЕ(Сделки.КаналПривлеченияЗначение) КАК ПредставлениеЗначенияКаналаПривлечения,
	|	Сделки.Менеджер КАК Куратор,
	|	ПРЕДСТАВЛЕНИЕ(Сделки.Менеджер) КАК ПредставлениеКуратора,
	|	Сделки.Врач КАК Врач,
	|	ПРЕДСТАВЛЕНИЕ(Сделки.Врач) КАК ПредставлениеВрача,
	|	Сделки.Примечание КАК Примечание,
	|	Сделки.Описание КАК Комментарий,
	|	ПРЕДСТАВЛЕНИЕ(Сделки.Специализация) КАК ПредставлениеСпециализации,
	|	Сделки.ПредыдущийПрием <> ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка) КАК ЭтоПовторныйПрием,
	|	КонтрагентыСведенияДляСписка.Статус КАК СтатусПациента
	|ПОМЕСТИТЬ ДанныеСделок
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СделкиСведенияДляСписка КАК СделкиСведенияДляСписка
	|		ПО Сделки.Ссылка = СделкиСведенияДляСписка.Сделка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтрагентыСведенияДляСписка КАК КонтрагентыСведенияДляСписка
	|		ПО Сделки.Контрагент = КонтрагентыСведенияДляСписка.Контрагент
	|ГДЕ
	|	Сделки.ВидСделки = &ВидСделки
	|	И ВЫБОР
	|			КОГДА &СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КонтрагентыСведенияДляСписка.Статус = &СтатусПациента
	|		КОНЕЦ
	|	И &ОтборПоСсылке
	|	И &УсловиеПометкаУдаления
	|	И &УсловиеСтруктурнаяЕдиница
	|	И &УсловиеСотрудникРегистрации
	|	И &УсловиеМенеджер
	|	И &УсловиеВрач
	|	И &УсловиеРекламныйИсточник
	|	И &УсловиеКаналПривлечения
	|	И &УсловиеДатаСоздания
	|	И &УсловиеДатаЗавершенияСделки
	|	И &УсловиеДатаЗапланированнойЗадачи
	|	И &УсловиеОтборБезНазначенногоПриема
	|	И &УсловиеОтборБезЗадач
	|	И &УсловиеЭтап
	|	И &УсловиеЗавершена
	|	И &УсловиеПричинаОтказа
	|	И &УсловиеИсключаемыеСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(Взаимодействие.Ссылка) КАК КоличествоЗадач,
	|	Взаимодействие.Сделка КАК Сделка
	|ПОМЕСТИТЬ ЗадачиКоличество
	|ИЗ
	|	Задача.Взаимодействие КАК Взаимодействие
	|ГДЕ
	|	Взаимодействие.Сделка В
	|			(ВЫБРАТЬ
	|				ДанныеСделок.Сделка
	|			ИЗ
	|				ДанныеСделок КАК ДанныеСделок)
	|	И НЕ Взаимодействие.ПометкаУдаления
	|	И НЕ Взаимодействие.Выполнена
	|
	|СГРУППИРОВАТЬ ПО
	|	Взаимодействие.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Профосмотры.Сделка КАК Сделка,
	|	МАКСИМУМ(Профосмотры.НаправившийВрач) КАК НаправившийВрач
	|ПОМЕСТИТЬ НаправившиеВрачи
	|ИЗ
	|	РегистрСведений.Профосмотры КАК Профосмотры
	|ГДЕ
	|	Профосмотры.Сделка В
	|			(ВЫБРАТЬ
	|				ДанныеСделок.Сделка
	|			ИЗ
	|				ДанныеСделок КАК ДанныеСделок)
	|
	|СГРУППИРОВАТЬ ПО
	|	Профосмотры.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭтапыСделок.ЭтапСделки КАК ЭтапСделки,
	|	ЭтапыСделок.ЭтапСделки.Наименование КАК НаименованиеЭтапа,
	|	ЭтапыСделок.ЭтапСделки.ЦветЭтапа КАК ЦветЭтапа,
	|	ЭтапыСделок.ЭтапСделки.ИмяПредопределенныхДанных КАК ИмяПредопределенногоЭтапа,
	|	ДанныеСделок.Сделка КАК Сделка,
	|	ДанныеСделок.ПредставлениеСделки КАК ПредставлениеСделки,
	|	ДанныеСделок.ПометкаУдаления КАК ПометкаУдаления,
	|	ДанныеСделок.ДатаСделки КАК ДатаСделки,
	|	ДанныеСделок.ДатаЗавершенияСделки КАК ДатаЗавершенияСделки,
	|	ДанныеСделок.Клиент КАК Клиент,
	|	ДанныеСделок.ПредставлениеКлиента КАК ПредставлениеКлиента,
	|	ДанныеСделок.НомерТелефона КАК НомерТелефона,
	|	ДанныеСделок.ПричинаОтказа КАК ПричинаОтказа,
	|	ДанныеСделок.ПричинаОтказаНаименование КАК ПричинаОтказаНаименование,
	|	ДанныеСделок.ПредставлениеРекламногоИсточника КАК ПредставлениеРекламногоИсточника,
	|	ДанныеСделок.ПредставлениеКаналаПривлечения КАК ПредставлениеКаналаПривлечения,
	|	ДанныеСделок.ПредставлениеЗначенияКаналаПривлечения КАК ПредставлениеЗначенияКаналаПривлечения,
	|	ДанныеСделок.Куратор КАК Куратор,
	|	ДанныеСделок.ПредставлениеКуратора КАК ПредставлениеКуратора,
	|	ДанныеСделок.Врач КАК Врач,
	|	ДанныеСделок.ПредставлениеВрача КАК ПредставлениеВрача,
	|	ДанныеСделок.Примечание КАК Примечание,
	|	ДанныеСделок.Комментарий КАК Комментарий,
	|	ДанныеСделок.ПредставлениеСпециализации КАК ПредставлениеСпециализации,
	|	ДанныеСделок.ЭтоПовторныйПрием КАК ЭтоПовторныйПрием,
	|	ЗадачиКоличество.КоличествоЗадач КАК КоличествоЗадач,
	|	НаправившиеВрачи.НаправившийВрач.НаименованиеСокращенное КАК НаправившийВрач,
	|	ДанныеСделок.СтатусПациента КАК СтатусПациента
	|ИЗ
	|	ЭтапыСделок КАК ЭтапыСделок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеСделок КАК ДанныеСделок
	|			ЛЕВОЕ СОЕДИНЕНИЕ ЗадачиКоличество КАК ЗадачиКоличество
	|			ПО ДанныеСделок.Сделка = ЗадачиКоличество.Сделка
	|			ЛЕВОЕ СОЕДИНЕНИЕ НаправившиеВрачи КАК НаправившиеВрачи
	|			ПО ДанныеСделок.Сделка = НаправившиеВрачи.Сделка
	|		ПО ЭтапыСделок.ЭтапСделки = ДанныеСделок.ЭтапСделки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтапыСделок.НомерЭтапа,
	|	ДатаСделки УБЫВ
	|ИТОГИ ПО
	|	ЭтапСделки");
	
	ПрименитьУсловияФильтрации(Запрос, СтруктураОтборов, Сделка, ИсключаемыеСделки);
	
	Возврат Запрос;
	
КонецФункции	

&НаСервереБезКонтекста
// Процедура, применяет условия фильтрации к запросу получения данных.
//
Процедура ПрименитьУсловияФильтрации(Запрос, СтруктураОтборов, Сделка = Неопределено, ИсключаемыеСделки = Неопределено)
	
	// Отбор по текущему виду сделки.
	Запрос.УстановитьПараметр("ВидСделки", СтруктураОтборов.ВидСделки);
	
	// Отбор по статусу пациента (новый / постоянный).
	Запрос.УстановитьПараметр("СтатусПациента", СтруктураОтборов.ОтборСтатусПациента);
	
	// Устанавливаем отбор по ссылке для получения данных конкретной сделки.
	Если ЗначениеЗаполнено(Сделка) Тогда
		УсловиеСсылка	 = "Сделки.Ссылка = &Ссылка";
		Запрос.Текст	 = СтрЗаменить(Запрос.Текст, "&ОтборПоСсылке", УсловиеСсылка);
		Запрос.Текст	 = СтрЗаменить(Запрос.Текст, "ЛЕВОЕ СОЕДИНЕНИЕ ДанныеСделок", "ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеСделок");
		Запрос.УстановитьПараметр("Ссылка", Сделка);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСсылке", "ИСТИНА");
	КонецЕсли;
	
	// Получение первой в очереди на вывод сделки (связано с ограничением - вывод первых 15 сделок в колонку).
	Если ЗначениеЗаполнено(ИсключаемыеСделки) Тогда
		
		УсловиеИсключаемыеСделки =
		"НЕ Сделки.Ссылка В(&ИсключаемыеСделки)
		|
		|УПОРЯДОЧИТЬ ПО 
		|	ДатаСделки УБЫВ";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИсключаемыеСделки", УсловиеИсключаемыеСделки);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЛЕВОЕ СОЕДИНЕНИЕ ДанныеСделок", "ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеСделок");
		
		Запрос.УстановитьПараметр("ИсключаемыеСделки", ИсключаемыеСделки);
		
		УсловиеЭтап	 = "Сделки.ЭтапСделки = &ЭтапСделки";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЭтап", УсловиеЭтап);
		Запрос.УстановитьПараметр("ЭтапСделки", СтруктураОтборов.ЭтапСделки);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИсключаемыеСделки", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЭтап"				, "ИСТИНА");		
		
	КонецЕсли;
	
	// Отбор пометка удаления.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборПометкаУдаления)
		И СтруктураОтборов.ОтборПометкаУдаления[0].Значение = Истина Тогда
		
		УсловиеПометкаУдаления = СтруктураОтборов.ОтборПометкаУдаления.ДоступныеЗначения[0].Представление + "Сделки.ПометкаУдаления = ИСТИНА";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПометкаУдаления", УсловиеПометкаУдаления);
	Иначе		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПометкаУдаления", "ИСТИНА");
	КонецЕсли;	
	
	// Отбор структурная единица.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборСтруктурнаяЕдиница) Тогда
		УсловиеСтруктурнаяЕдиница = СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения[0].Представление + "Сделки.СтруктурнаяЕдиница В (&ОтборСтруктурнаяЕдиница)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", УсловиеСтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("ОтборСтруктурнаяЕдиница", СтруктураОтборов.ОтборСтруктурнаяЕдиница.ВыгрузитьЗначения());
	Иначе
		Если СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения.Количество() <> 0 Тогда 
			ВариантОтбора = СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения[0].Представление;
		Иначе 
			ВариантОтбора = "";
		КонецЕсли;			
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", ВариантОтбора + "Сделки.СтруктурнаяЕдиница В (&ОтборСтруктурнаяЕдиница)");			
		Запрос.УстановитьПараметр("ОтборСтруктурнаяЕдиница", СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения.ВыгрузитьЗначения());		
		// Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", "ИСТИНА");
	КонецЕсли;	
	
	// Отбор сотрудник регистрации.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборСотрудникРегистрации) Тогда
		УсловиеСотрудникРегистрации = СтруктураОтборов.ОтборСотрудникРегистрации.ДоступныеЗначения[0].Представление + "Сделки.Автор В (&ОтборСотрудникРегистрации)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСотрудникРегистрации", УсловиеСотрудникРегистрации);
		Запрос.УстановитьПараметр("ОтборСотрудникРегистрации", СтруктураОтборов.ОтборСотрудникРегистрации.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСотрудникРегистрации", "ИСТИНА");	
	КонецЕсли;
	
	// Отбор менеджер.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборМенеджер) Тогда
		УсловиеМенеджер = СтруктураОтборов.ОтборМенеджер.ДоступныеЗначения[0].Представление + "Сделки.Менеджер В (&ОтборМенеджер)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеМенеджер", УсловиеМенеджер);
		Запрос.УстановитьПараметр("ОтборМенеджер", СтруктураОтборов.ОтборМенеджер.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеМенеджер", "ИСТИНА");	
	КонецЕсли;
	
	// Отбор врач.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборВрач) Тогда
		УсловиеВрач = СтруктураОтборов.ОтборВрач.ДоступныеЗначения[0].Представление + "Сделки.Врач В (&ОтборВрач)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВрач", УсловиеВрач);
		Запрос.УстановитьПараметр("ОтборВрач", СтруктураОтборов.ОтборВрач.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВрач", "ИСТИНА");	
	КонецЕсли;
	
	// Отбор рекламный источник.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборРекламныйИсточник) Тогда
		УсловиеРекламныйИсточник = СтруктураОтборов.ОтборРекламныйИсточник.ДоступныеЗначения[0].Представление + "Сделки.ИсточникИнформации В (&ОтборРекламныйИсточник)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеРекламныйИсточник", УсловиеРекламныйИсточник);
		Запрос.УстановитьПараметр("ОтборРекламныйИсточник", СтруктураОтборов.ОтборРекламныйИсточник.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеРекламныйИсточник", "ИСТИНА");
	КонецЕсли;
	
	// Отбор канал привлечения.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборКаналПривлечения) Тогда
		УсловиеКаналПривлечения = СтруктураОтборов.ОтборКаналПривлечения.ДоступныеЗначения[0].Представление + "Сделки.КаналПривлечения В (&ОтборКаналПривлечения)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКаналПривлечения", УсловиеКаналПривлечения);
		Запрос.УстановитьПараметр("ОтборКаналПривлечения", СтруктураОтборов.ОтборКаналПривлечения.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКаналПривлечения", "ИСТИНА");
	КонецЕсли;
	
	// Отбор причина отказа.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборПричинаОтказа) Тогда
		УсловиеПричинаОтказа = СтруктураОтборов.ОтборПричинаОтказа.ДоступныеЗначения[0].Представление + "Сделки.ПричинаОтказа В (&ОтборПричинаОтказа)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПричинаОтказа", УсловиеПричинаОтказа);
		Запрос.УстановитьПараметр("ОтборПричинаОтказа", СтруктураОтборов.ОтборПричинаОтказа.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПричинаОтказа", "ИСТИНА");
	КонецЕсли;
	
	// Отбор дата создания сделки.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборДатаСоздания) Тогда   
		
		УсловиеДатаСоздания = "Сделки.ДатаСделки МЕЖДУ &ДатаРегистрацииДатаНачала И &ДатаРегистрацииДатаОкончания"; 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДатаСоздания", УсловиеДатаСоздания);
		ДатаНачала = СтруктураОтборов.ОтборДатаСоздания[0].Значение.ДатаНачала;
		ДатаОкончания = СтруктураОтборов.ОтборДатаСоздания[0].Значение.ДатаОкончания;
		Запрос.УстановитьПараметр("ДатаРегистрацииДатаНачала"   , ?(ЗначениеЗаполнено(ДатаНачала),     ДатаНачала, Дата(01,01,0001)));
		Запрос.УстановитьПараметр("ДатаРегистрацииДатаОкончания", ?(ЗначениеЗаполнено(ДатаОкончания),  ДатаОкончания, Дата(3999,12,31)));

	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДатаСоздания", "ИСТИНА")
		
	КонецЕсли;
	
	// Отбор дата завершения сделки.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборДатаЗавершенияСделки) Тогда   
		
		УсловиеДатаЗавершенияСделки = "Сделки.ДатаЗавершенияСделки МЕЖДУ &ДатаЗавершенияСделкиДатаНачала И &ДатаЗавершенияСделкиДатаОкончания";
		Запрос.Текст 	= СтрЗаменить(Запрос.Текст, "&УсловиеДатаЗавершенияСделки", УсловиеДатаЗавершенияСделки);
		ДатаНачала 		= СтруктураОтборов.ОтборДатаЗавершенияСделки[0].Значение.ДатаНачала;
		ДатаОкончания 	= СтруктураОтборов.ОтборДатаЗавершенияСделки[0].Значение.ДатаОкончания;
		Запрос.УстановитьПараметр("ДатаЗавершенияСделкиДатаНачала"   , ?(ЗначениеЗаполнено(ДатаНачала),    ДатаНачала, Дата(01,01,0001)));
		Запрос.УстановитьПараметр("ДатаЗавершенияСделкиДатаОкончания", ?(ЗначениеЗаполнено(ДатаОкончания), ДатаОкончания, Дата(3999,12,31)));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДатаЗавершенияСделки", "ИСТИНА");		
	КонецЕсли;
	
	// Отбор дата запланированной задачи.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборДатаЗапланированнойЗадачи) Тогда
		Если ЗначениеЗаполнено(СтруктураОтборов.ОтборПредварительнаяЗапись)
		И СтруктураОтборов.ОтборПредварительнаяЗапись[0].Значение = Ложь Тогда
			УсловиеДатаЗапланированнойЗадачи = "СделкиСведенияДляСписка.ЗапланированнаяЗадача.ЗадачаНазначеннаяДата МЕЖДУ &ДатаНачалаЗапланированнойЗадачи И &ДатаОкончанияЗапланированнойЗадачи";
			УсловиеОтборБезНазначенногоПриема = СтруктураОтборов.ОтборПредварительнаяЗапись.ДоступныеЗначения[0].Представление + "СделкиСведенияДляСписка.ЗапланированнаяПредварительнаяЗапись = ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка) И СделкиСведенияДляСписка.Сделка.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)";	
			УсловиеДатаЗапланированнойЗадачи = "(" + УсловиеДатаЗапланированнойЗадачи + ") ИЛИ (" + УсловиеОтборБезНазначенногоПриема + ")";
		Иначе 
			УсловиеДатаЗапланированнойЗадачи = "СделкиСведенияДляСписка.ЗапланированнаяЗадача.ЗадачаНазначеннаяДата МЕЖДУ &ДатаНачалаЗапланированнойЗадачи И &ДатаОкончанияЗапланированнойЗадачи";
		КонецЕсли;	
		Запрос.Текст 	= СтрЗаменить(Запрос.Текст, "&УсловиеДатаЗапланированнойЗадачи", УсловиеДатаЗапланированнойЗадачи);
		ДатаНачала 		= СтруктураОтборов.ОтборДатаЗапланированнойЗадачи[0].Значение.ДатаНачала;
		ДатаОкончания 	= СтруктураОтборов.ОтборДатаЗапланированнойЗадачи[0].Значение.ДатаОкончания;

		// УсловиеДатаЗапланированнойЗадачи = "И СделкиСведенияДляСписка.ЗапланированнаяЗадача.ЗадачаНазначеннаяДата МЕЖДУ &ДатаНачалаЗапланированнойЗадачи И &ДатаОкончанияЗапланированнойЗадачи";
		Запрос.УстановитьПараметр("ДатаНачалаЗапланированнойЗадачи"   , ?(ЗначениеЗаполнено(ДатаНачала),     ДатаНачала, Дата(01,01,0001)));	
		Запрос.УстановитьПараметр("ДатаОкончанияЗапланированнойЗадачи", ?(ЗначениеЗаполнено(ДатаОкончания),  ДатаОкончания, Дата(3999,12,31)));
		
	Иначе                               
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДатаЗапланированнойЗадачи", "ИСТИНА");
	КонецЕсли;
	
	// Отбор признак наличия назначенного приема.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборПредварительнаяЗапись)
		И СтруктураОтборов.ОтборПредварительнаяЗапись[0].Значение = Ложь Тогда
		
		УсловиеОтборБезНазначенногоПриема = СтруктураОтборов.ОтборПредварительнаяЗапись.ДоступныеЗначения[0].Представление + "СделкиСведенияДляСписка.ЗапланированнаяПредварительнаяЗапись = ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка) И СделкиСведенияДляСписка.Сделка.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)";	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтборБезНазначенногоПриема", УсловиеОтборБезНазначенногоПриема);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтборБезНазначенногоПриема", "ИСТИНА");	
	КонецЕсли;
	
	// Отбор без задач.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборЗадача)
		И СтруктураОтборов.ОтборЗадача[0].Значение = Ложь Тогда
		
		УсловиеОтборБезЗадач = СтруктураОтборов.ОтборЗадача.ДоступныеЗначения[0].Представление + "СделкиСведенияДляСписка.ЗапланированнаяЗадача = ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка) И СделкиСведенияДляСписка.Сделка.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)";	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтборБезЗадач", УсловиеОтборБезЗадач);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтборБезЗадач", "ИСТИНА");
	КонецЕсли;
	
	// Отбор завершения задачи сделки.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборЗавершена)
		И СтруктураОтборов.ОтборЗавершена[0].Значение = Истина Тогда
		
		УсловиеЗавершена = СтруктураОтборов.ОтборЗавершена.ДоступныеЗначения[0].Представление + "Сделки.РезультатСделки <> ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЗавершена", УсловиеЗавершена);
		
	ИначеЕсли ЗначениеЗаполнено(СтруктураОтборов.ОтборЗавершена)
		И СтруктураОтборов.ОтборЗавершена[0].Значение = Ложь Тогда			
		
		УсловиеЗавершена = СтруктураОтборов.ОтборЗавершена.ДоступныеЗначения[0].Представление + "Сделки.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)";			
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЗавершена", УсловиеЗавершена);
		
	Иначе		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЗавершена", "ИСТИНА");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает пакет запроса с элементами для создания отборов.
//
Функция ПолучитьПакетЗапросаЗначенийДляОтборов(ТекущийСотрудник)
	
	МассивСтруктурныхЕдиниц 	= Справочники.Сотрудники.ПолучитьМестаРаботыСотрудника(ТекущийСотрудник, "Массив");		
	МассивВидовСделок 			= Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(, МассивСтруктурныхЕдиниц);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивВидовСделок"	, МассивВидовСделок);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ЛюбаяПричина"		, ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПричиныОтказов.ЛюбаяПричина"));
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сделки.ИсточникИнформации КАК ИсточникИнформации,
	|	Сделки.КаналПривлечения КАК КаналПривлечения,
	|	Сделки.Автор КАК Автор,
	|	Сделки.ЭтапСделки КАК ЭтапСделки,
	|	Сделки.Менеджер КАК Менеджер,
	|	Сделки.Врач КАК Врач
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|
	|СГРУППИРОВАТЬ ПО
	|	Сделки.ИсточникИнформации,
	|	Сделки.КаналПривлечения,
	|	Сделки.Автор,
	|	Сделки.Менеджер,
	|	Сделки.ЭтапСделки,
	|	Сделки.Врач
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.Представление КАК Представление
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаСделок.Менеджер
	|			ИЗ
	|				ТаблицаСделок)
	|	И Сотрудники.Ссылка <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И Сотрудники.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.Представление КАК Представление
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаСделок.Врач
	|			ИЗ
	|				ТаблицаСделок)
	|	И Сотрудники.Ссылка <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И Сотрудники.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.Представление КАК Представление
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаСделок.Автор
	|			ИЗ
	|				ТаблицаСделок)
	|	И Сотрудники.Ссылка <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И Сотрудники.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РекламныеИсточники.Ссылка КАК Ссылка,
	|	РекламныеИсточники.Представление КАК Представление
	|ИЗ
	|	Справочник.РекламныеИсточники КАК РекламныеИсточники
	|ГДЕ
	|	РекламныеИсточники.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаСделок.ИсточникИнформации
	|			ИЗ
	|				ТаблицаСделок)
	|	И РекламныеИсточники.Ссылка <> ЗНАЧЕНИЕ(Справочник.РекламныеИсточники.ПустаяСсылка)
	|	И РекламныеИсточники.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыСделок.Ссылка КАК Ссылка,
	|	ВидыСделок.Представление КАК Представление
	|ПОМЕСТИТЬ ТаблицаВидовСделок
	|ИЗ
	|	Справочник.ВидыСделок КАК ВидыСделок
	|ГДЕ
	|	ВидыСделок.Ссылка В(&МассивВидовСделок)
	|	И ВидыСделок.ПометкаУдаления = ЛОЖЬ
	|	И (ВидыСделок.СтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ИЛИ ВидыСделок.СтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЭтапыСделок.Ссылка КАК Ссылка,
	|	ЭтапыСделок.Представление КАК Представление
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаСделок.ЭтапСделки
	|			ИЗ
	|				ТаблицаСделок
	|			СГРУППИРОВАТЬ ПО
	|				ТаблицаСделок.ЭтапСделки)
	|	И ЭтапыСделок.Ссылка <> ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.ПустаяСсылка)
	|	И ЭтапыСделок.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА ЭтапыСделок.Предопределенный
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЭтапыСделок.ВидСделки В
	|					(ВЫБРАТЬ
	|						ТаблицаВидовСделок.Ссылка КАК Ссылка
	|					ИЗ
	|						ТаблицаВидовСделок КАК ТаблицаВидовСделок)
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтапыСделок.Предопределенный,
	|	ЭтапыСделок.ВидСделки,
	|	ЭтапыСделок.НомерЭтапа,
	|	Ссылка УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Теги.Ссылка КАК Ссылка,
	|	Теги.Представление КАК Представление
	|ИЗ
	|	Справочник.Теги КАК Теги
	|ГДЕ
	|	Теги.ПометкаУдаления = ЛОЖЬ
	|	И Теги.Ссылка <> ЗНАЧЕНИЕ(Справочник.Теги.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СтатусыКлиентов.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СтатусыКлиентов.Ссылка) КАК Представление
	|ИЗ
	|	Перечисление.СтатусыКонтрагентов КАК СтатусыКлиентов
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыКлиентов.Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СтруктурныеЕдиницы.Ссылка) КАК Представление
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	СтруктурныеЕдиницы.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыСделок.Ссылка КАК Ссылка,
	|	ВидыСделок.Представление КАК Представление
	|ИЗ
	|	ТаблицаВидовСделок КАК ВидыСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПричиныОтказов.Ссылка КАК Ссылка,
	|	ПричиныОтказов.Представление КАК Представление
	|ИЗ
	|	Справочник.ПричиныОтказов КАК ПричиныОтказов
	|ГДЕ
	|	ПричиныОтказов.Ссылка <> &ЛюбаяПричина
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КаналыПривлечения.Ссылка КАК Ссылка,
	|	КаналыПривлечения.Представление КАК Представление
	|ИЗ
	|	Справочник.КаналыПривлечения КАК КаналыПривлечения
	|ГДЕ
	|	КаналыПривлечения.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаСделок.КаналПривлечения
	|			ИЗ
	|				ТаблицаСделок)
	|	И КаналыПривлечения.Ссылка <> ЗНАЧЕНИЕ(Справочник.КаналыПривлечения.ПустаяСсылка)
	|	И КаналыПривлечения.ПометкаУдаления = ЛОЖЬ";
	
	Возврат Запрос.ВыполнитьПакет();
	        	
КонецФункции

&НаСервере
// Процедура - Инициализировать механизм фильтрации данных
//
// Параметры:
//  ПараметрыОтбора	 - 	 - 
//  ОбновитьСписок	 - 	 - 
//
Процедура ОбновитьМеханизмФильтрацииДанных(ПараметрыОтбора = Неопределено, ОчиститьФильтры = Ложь)
	
	Для Каждого Строка из ТаблицаФильтров Цикл
		Строка.Инициализирован = Ложь;
	КонецЦикла;
	
	МассивИменОчищаемыхФильтров = Новый Массив();
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Статус");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_СтруктурнаяЕдиница");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Этап");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_СотрудникРегистрации");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_РекламныйИсточник");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_КаналПривлечения");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Тег");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПредварительнаяЗапись"); 	
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Задача"); 
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПризнакВыполненияСделки"); 
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_СозданаПериод");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ЗавершенаПериод"); 
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПериодЗапланированнойЗадачи");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПометкаУдаленияСделки");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПричинаОтказа");	
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Менеджер");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Врач");
	
	УправлениеИнтерфейсамиСервер.ДеактивироватьВсеЗначенияФильтрацииДанных(ЭтаФорма, МассивИменОчищаемыхФильтров);

	РезультатПакетногоЗапроса = ПолучитьПакетЗапросаЗначенийДляОтборов(ЭтотОбъект.ТекущийСотрудник);	
	
	Если ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("ВидСделки") Тогда
		ЭтотОбъект.ВидСделки				 = ПараметрыОтбора.ВидСделки;
		Элементы.ИзменитьВидСделки.Заголовок = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект.ВидСделки, "Наименование");
	КонецЕсли;
	
	Если ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("ОтборСтатусПациента") Тогда
		ЭтотОбъект.ОтборСтатусПациента = ПараметрыОтбора.ОтборСтатусПациента;
		УстановитьОтображениеФильтраСтатусПациента(ЭтотОбъект);
	КонецЕсли;
	
	// Отбор статус.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтатусов");	
	ОбновитьДинамическоеМенюФильтрации_Статус(РезультатПакетногоЗапроса[8].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтатусов_ВариантОтбора"), ПараметрыОтбора.МассивСтатусов_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Статус", ПараметрыОтбора.МассивСтатусов, Истина,,, ВариантОтбора);		
	КонецЕсли;
	
	// Отбор структурная единица.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтруктурныхЕдиниц");	
	ОбновитьДинамическоеМенюФильтрации_СтруктурнаяЕдиница(РезультатПакетногоЗапроса[9].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтруктурныхЕдиниц_ВариантОтбора"), ПараметрыОтбора.МассивСтруктурныхЕдиниц_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтруктурнаяЕдиница", ПараметрыОтбора.МассивСтруктурныхЕдиниц, Истина,,, ВариантОтбора);		
	КонецЕсли;

	// Отбор этапы сделки.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивЭтапов");
	ОбновитьДинамическоеМенюФильтрации_Этап(РезультатПакетногоЗапроса[6].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда 
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивЭтапов_ВариантОтбора"), ПараметрыОтбора.МассивЭтапов_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Этап", ПараметрыОтбора.МассивЭтапов, Истина,,, ВариантОтбора);	
	КонецЕсли;	
	
	// Отбор сотрудника регистрации.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСотрудниковРегистрации");
	ОбновитьДинамическоеМенюФильтрации_СотрудникРегистрации(РезультатПакетногоЗапроса[3].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСотрудниковРегистрации_ВариантОтбора"), ПараметрыОтбора.МассивСотрудниковРегистрации_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СотрудникРегистрации", ПараметрыОтбора.МассивСотрудниковРегистрации, Истина,,, ВариантОтбора);	
	КонецЕсли;
	
	// Отбор рекламного источника.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивРекламныхИсточников");
	ОбновитьДинамическоеМенюФильтрации_РекламныйИсточник(РезультатПакетногоЗапроса[4].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивРекламныхИсточников_ВариантОтбора"), ПараметрыОтбора.МассивРекламныхИсточников_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_РекламныйИсточник", ПараметрыОтбора.МассивРекламныхИсточников, Истина,,, ВариантОтбора);	
	КонецЕсли;
	
	// Отбор причины отказа.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивПричинОтказов");
	ОбновитьДинамическоеМенюФильтрации_ПричинаОтказа(РезультатПакетногоЗапроса[11].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивПричинОтказов_ВариантОтбора"), ПараметрыОтбора.МассивПричинОтказов_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПричинаОтказа", ПараметрыОтбора.МассивПричинОтказов, Истина,,, ВариантОтбора);	
	КонецЕсли;

	// Отбор тегов.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивТегов");
	ОбновитьДинамическоеМенюФильтрации_Тег(РезультатПакетногоЗапроса[7].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивТегов_ВариантОтбора"), ПараметрыОтбора.МассивТегов_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Тег", ПараметрыОтбора.МассивТегов, Истина,,, ВариантОтбора);	
	КонецЕсли;

	// Отбор признак наличия назначенного приема.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтатусовНаличияПредварительнойЗаписи");
	ОбновитьДинамическоеМенюФильтрации_ПредварительнаяЗапись(,УстановитьОтбор);
	Если УстановитьОтбор Тогда 
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтатусовНаличияПредварительнойЗаписи_ВариантОтбора"), ПараметрыОтбора.МассивСтатусовНаличияПредварительнойЗаписи_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПредварительнаяЗапись", ПараметрыОтбора.МассивСтатусовНаличияПредварительнойЗаписи, Истина,,, ВариантОтбора);
	КонецЕсли;
	
	// Отбор признак наличия задач.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтатусовНаличияЗадач");
	ОбновитьДинамическоеМенюФильтрации_Задача(,УстановитьОтбор);
	Если УстановитьОтбор Тогда 
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтатусовНаличияЗадач_ВариантОтбора"), ПараметрыОтбора.МассивСтатусовНаличияЗадач_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Задача", ПараметрыОтбора.МассивСтатусовНаличияЗадач, Истина,,, ВариантОтбора);
	КонецЕсли;
	
	// Отбор статусов сделки.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтатусовСделок"); 
	ОбновитьДинамическоеМенюФильтрации_ПризнакВыполненияСделки(, УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтатусовСделок_ВариантОтбора"), ПараметрыОтбора.МассивСтатусовСделок_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПризнакВыполненияСделки", ПараметрыОтбора.МассивСтатусовСделок, Истина,,, ВариантОтбора);
	КонецЕсли;

	// Отбор пометка удаления сделки.         
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("СписокСтатусовПометокУдаления"); 
	ОбновитьДинамическоеМенюФильтрации_ПометкаУдаленияСделки(, УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("СписокСтатусовПометокУдаления_ВариантОтбора"), ПараметрыОтбора.СписокСтатусовПометокУдаления_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПометкаУдаленияСделки", ПараметрыОтбора.СписокСтатусовПометокУдаления, Истина,,, ВариантОтбора);				
	КонецЕсли;
	
	// Отбор менеджеров.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивМенеджеров"); 
	ОбновитьДинамическоеМенюФильтрации_Менеджер(РезультатПакетногоЗапроса[1].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивМенеджеров_ВариантОтбора"), ПараметрыОтбора.МассивМенеджеров_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Менеджер", ПараметрыОтбора.МассивМенеджеров, Истина, НСтр("ru = '<не указан>'; en = '<not specified>'"),, ВариантОтбора);
	КонецЕсли;	
	
	// Отбор врач.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивВрачей"); 
	ОбновитьДинамическоеМенюФильтрации_Врач(РезультатПакетногоЗапроса[2].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивВрачей_ВариантОтбора"), ПараметрыОтбора.МассивВрачей_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Врач", ПараметрыОтбора.МассивВрачей, Истина, НСтр("ru = '<не указан>'; en = '<not specified>'"),, ВариантОтбора);
	КонецЕсли;	
	
	// Отбор периода создания сделки.	
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("ПериодСозданияСделки");
	ОбновитьДинамическоеМенюФильтрации_СозданаПериод(, УстановитьОтбор);
	Если УстановитьОтбор Тогда
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СозданаПериод", ПараметрыОтбора.ПериодСозданияСделки);	
	КонецЕсли;	
	
	// Отбор период запланированной задачи
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("ПериодПланирования");
	ОбновитьДинамическоеМенюФильтрации_ПериодЗапланированнойЗадачи(, УстановитьОтбор);
	Если УстановитьОтбор Тогда    	
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПериодЗапланированнойЗадачи", ПараметрыОтбора.ПериодПланирования);
	КонецЕсли;	
	
	// Отбор периода завершения сделки.	
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("ПериодСделки");
	ОбновитьДинамическоеМенюФильтрации_ЗавершенаПериод(, УстановитьОтбор);
	Если УстановитьОтбор Тогда    
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ЗавершенаПериод", ПараметрыОтбора.ПериодСделки);
	КонецЕсли;
	
	// Отбор канал привлечения.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивКаналовПривлечения");
	ОбновитьДинамическоеМенюФильтрации_КаналПривлечения(РезультатПакетногоЗапроса[12].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивКаналовПривлечения_ВариантОтбора"), ПараметрыОтбора.МассивКаналовПривлечения_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_КаналПривлечения", ПараметрыОтбора.МассивКаналовПривлечения, Истина,,, ВариантОтбора);	
	КонецЕсли;
	
	ЗначениеОтбораПоЗадачам = СвойствоСтруктуры(ПараметрыОтбора, "ОтборПоЗадачам", 0);
	УстановитьОтображениеФильтровПоЗадачам(ЭтотОбъект, ЗначениеОтбораПоЗадачам = 3, ЗначениеОтбораПоЗадачам = 2, ЗначениеОтбораПоЗадачам = 1);
	
	СформироватьКанбан();
	
КонецПроцедуры

#КонецОбласти

#Область ___________________ОБРАБОТЧИКИ_МЕХАНИЗМА_ФИЛЬТРАЦИИ_______________________

&НаСервере
// Процедура - Применить механизм фильтрации данных.
//
// Параметры:
//  ДанныеЭлементаФильтрации - 	 - 
//
Процедура ПрименитьМеханизмФильтрацииДанных(ДанныеЭлементаФильтрации) Экспорт
	
	МассивСтрокОбрабатываемыхФильтров = ТаблицаФильтров.НайтиСтроки(Новый Структура("Применен", Ложь));
	Для Каждого СтрокаФильтра ИЗ МассивСтрокОбрабатываемыхФильтров Цикл
		УправлениеИнтерфейсамиСервер.ОбновитьГруппуАктивированныхЗначенийФильтра(ЭтаФорма, СтрокаФильтра);
	КонецЦикла;
	
	СформироватьКанбан();	
		
КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик нажатия элемента фильтрации данных.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОбработчикНажатияЭлементаФильтрацииДанных(Команда, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	МассивИмен = СтрРазделить(Команда.Имя,"_");
	
	Если МассивИмен.Количество() <> 0 Тогда 
		Если МассивИмен[0] = "Удалить" Тогда
			
			РезультатОбновления = УправлениеИнтерфейсамиКлиент.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, Команда.Имя, , ВыбранноеЗначение);
			Если РезультатОбновления.Свойство("ДействиеЭлемента") И РезультатОбновления.ДействиеЭлемента = "ОбработкаВыбора" Тогда 
				Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда 
					СтандартнаяОбработка = Ложь;
					// ВыбранноеЗначение = Неопределено;
					// ЭлементФормы.ОбновитьТекстРедактирования(); 			
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			ИсключаемыеФильтры = Новый Массив;
			ИсключаемыеФильтры.Добавить("Этап");
			ИсключаемыеФильтры.Добавить("ВидСделки");
			
			//Если ЭтотОбъект.ЭтоПолноправныйПользователь = Ложь Тогда
			//	ИсключаемыеФильтры.Добавить("Менеджер");
			//	ИсключаемыеФильтры.Добавить("СтруктурнаяЕдиница");
			//КонецЕсли;
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Отбор"								, ПараметрыВыбранныхФильтров(Новый Структура));
			ПараметрыФормы.Вставить("ИмяКоманды"						, Команда.Имя);
			ПараметрыФормы.Вставить("ВыбранноеЗначение" 				, ВыбранноеЗначение);
			ПараметрыФормы.Вставить("ИсключаемыеФильтры"				, ИсключаемыеФильтры);
			
			ОткрытьФорму("Справочник.Сделки.Форма.ФормаФильтры",
						 ПараметрыФормы,,,,,
						 Новый ОписаниеОповещения("ОткрытиеФильтровЗавершение", ЭтотОбъект),
						 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - получение сведений о выбранных фильтрах.
//
Функция ПараметрыВыбранныхФильтров(ПараметрыОтбора)
	
	Для Каждого Строка из ТаблицаФильтров Цикл
		Если Строка.КоличествоАктивированныхЗначений > 0 Тогда
			
			МассивДанных = ПолучениеЭлементовОтбора(Новый Массив, Строка.СписокЗначений, Строка.Наименование);
			
			Если Строка.Наименование = "Фильтр_Статус" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусов"			   				, МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусов_ВариантОтбора"				, Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_СтруктурнаяЕдиница" Тогда
				ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц"					, МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц_ВариантОтбора"	, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_ВидСделки" Тогда
				ПараметрыОтбора.Вставить("МассивВидовСделок"			  			, МассивДанных);
				ПараметрыОтбора.Вставить("МассивВидовСделок_ВариантОтбора"			, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Этап" Тогда
				ПараметрыОтбора.Вставить("МассивЭтапов"			     				, МассивДанных);
				ПараметрыОтбора.Вставить("МассивЭтапов_ВариантОтбора"				, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Менеджер" Тогда
				ПараметрыОтбора.Вставить("МассивМенеджеров"				 			, МассивДанных);
				ПараметрыОтбора.Вставить("МассивМенеджеров_ВариантОтбора"			, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Врач" Тогда
				ПараметрыОтбора.Вставить("МассивВрачей"				 				, МассивДанных);
				ПараметрыОтбора.Вставить("МассивВрачей_ВариантОтбора"				, Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_СотрудникРегистрации" Тогда
				ПараметрыОтбора.Вставить("МассивСотрудниковРегистрации"				 , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСотрудниковРегистрации_ВариантОтбора", Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_РекламныйИсточник" Тогда
				ПараметрыОтбора.Вставить("МассивРекламныхИсточников"			  	, МассивДанных);
				ПараметрыОтбора.Вставить("МассивРекламныхИсточников_ВариантОтбора"	, Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_ПричинаОтказа" Тогда
				ПараметрыОтбора.Вставить("МассивПричинОтказов"			  			, МассивДанных);
				ПараметрыОтбора.Вставить("МассивПричинОтказов_ВариантОтбора"		, Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_Тег" Тогда
				ПараметрыОтбора.Вставить("МассивТегов"								, МассивДанных);
				ПараметрыОтбора.Вставить("МассивТегов_ВариантОтбора"				, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Интерес" Тогда
				ПараметрыОтбора.Вставить("МассивИнтересов"							, МассивДанных);
				ПараметрыОтбора.Вставить("МассивИнтересов_ВариантОтбора"			, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_КаналПривлечения" Тогда
				ПараметрыОтбора.Вставить("МассивКаналовПривлечения"				 	, МассивДанных);
				ПараметрыОтбора.Вставить("МассивКаналовПривлечения_ВариантОтбора"	, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_ПредварительнаяЗапись" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусовНаличияПредварительнойЗаписи"			   , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусовНаличияПредварительнойЗаписи_ВариантОтбора", Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_Задача" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусовНаличияЗадач"			   , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусовНаличияЗадач_ВариантОтбора", Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_ПризнакВыполненияСделки" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусовСделок"			     , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусовСделок_ВариантОтбора", Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_ПометкаУдаленияСделки" Тогда
				ПараметрыОтбора.Вставить("СписокСтатусовПометокУдаления"			  , МассивДанных);
				ПараметрыОтбора.Вставить("СписокСтатусовПометокУдаления_ВариантОтбора", Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_СозданаПериод" Тогда
				ПараметрыОтбора.Вставить("ПериодСозданияСделки", МассивДанных);

			ИначеЕсли Строка.Наименование = "Фильтр_ПериодЗапланированнойЗадачи" Тогда
				ПараметрыОтбора.Вставить("ПериодПланирования", МассивДанных);

			ИначеЕсли Строка.Наименование = "Фильтр_ЗавершенаПериод" Тогда
				ПараметрыОтбора.Вставить("ПериодСделки", МассивДанных);	
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ПараметрыОтбора, Новый УникальныйИдентификатор);
	
КонецФункции

&НаСервереБезКонтекста
// Функция - ПолучениеЭлементовОтбора
Функция ПолучениеЭлементовОтбора(Массив, СписокЗначений, НаименованиеФильтра)
	
	Если НаименованиеФильтра = "Фильтр_СозданаПериод" 
		Или НаименованиеФильтра = "Фильтр_ЗавершенаПериод" 
		Или НаименованиеФильтра = "Фильтр_ПериодЗапланированнойЗадачи" Тогда
		
		Если СписокЗначений.Количество() > 0 Тогда
			ЗаданноеЗначение = СписокЗначений.Получить(0).Значение; 
			Массив.Добавить(ЗаданноеЗначение.ЗначениеФильтра);
		КонецЕсли;
		
	Иначе
		
		Если СписокЗначений.Количество() > 0 Тогда
			Для каждого Значение из СписокЗначений Цикл
				Если Значение.Значение.Выбран = Истина Тогда
					Массив.Добавить(Значение.Значение.ЗначениеФильтра);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
// Функция - Данные выбранных фильтров.
//
Функция ПараметрыВыбранныхФильтровКлиент()
	
	ПараметрыОтбора = Новый Структура;
	
	Для Каждого Строка из ТаблицаФильтров Цикл
		Если Строка.КоличествоАктивированныхЗначений > 0 Тогда
			
			МассивДанных = ПолучениеЭлементовОтбораКлиент(Новый Массив, Строка.СписокЗначений, Строка.Наименование);
			
			Если Строка.Наименование = "Фильтр_Статус" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусов"			   				, МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусов_ВариантОтбора"				, Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_СтруктурнаяЕдиница" Тогда
				ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц"					, МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц_ВариантОтбора"	, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_ВидСделки" Тогда
				ПараметрыОтбора.Вставить("МассивВидовСделок"			  			, МассивДанных);
				ПараметрыОтбора.Вставить("МассивВидовСделок_ВариантОтбора"			, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Этап" Тогда
				ПараметрыОтбора.Вставить("МассивЭтапов"			     				, МассивДанных);
				ПараметрыОтбора.Вставить("МассивЭтапов_ВариантОтбора"				, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Менеджер" Тогда
				ПараметрыОтбора.Вставить("МассивМенеджеров"				 			, МассивДанных);
				ПараметрыОтбора.Вставить("МассивМенеджеров_ВариантОтбора"			, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Врач" Тогда
				ПараметрыОтбора.Вставить("МассивВрачей"				 				, МассивДанных);
				ПараметрыОтбора.Вставить("МассивВрачей_ВариантОтбора"				, Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_СотрудникРегистрации" Тогда
				ПараметрыОтбора.Вставить("МассивСотрудниковРегистрации"				 , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСотрудниковРегистрации_ВариантОтбора", Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_РекламныйИсточник" Тогда
				ПараметрыОтбора.Вставить("МассивРекламныхИсточников"			  	, МассивДанных);
				ПараметрыОтбора.Вставить("МассивРекламныхИсточников_ВариантОтбора"	, Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_ПричинаОтказа" Тогда
				ПараметрыОтбора.Вставить("МассивПричинОтказов"			  			, МассивДанных);
				ПараметрыОтбора.Вставить("МассивПричинОтказов_ВариантОтбора"		, Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_Тег" Тогда
				ПараметрыОтбора.Вставить("МассивТегов"								, МассивДанных);
				ПараметрыОтбора.Вставить("МассивТегов_ВариантОтбора"				, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Интерес" Тогда
				ПараметрыОтбора.Вставить("МассивИнтересов"							, МассивДанных);
				ПараметрыОтбора.Вставить("МассивИнтересов_ВариантОтбора"			, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_КаналПривлечения" Тогда
				ПараметрыОтбора.Вставить("МассивКаналовПривлечения"				 	, МассивДанных);
				ПараметрыОтбора.Вставить("МассивКаналовПривлечения_ВариантОтбора"	, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_ПредварительнаяЗапись" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусовНаличияПредварительнойЗаписи"			   , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусовНаличияПредварительнойЗаписи_ВариантОтбора", Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_Задача" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусовНаличияЗадач"			   , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусовНаличияЗадач_ВариантОтбора", Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_ПризнакВыполненияСделки" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусовСделок"			     , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусовСделок_ВариантОтбора", Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_ПометкаУдаленияСделки" Тогда
				ПараметрыОтбора.Вставить("СписокСтатусовПометокУдаления"			  , МассивДанных);
				ПараметрыОтбора.Вставить("СписокСтатусовПометокУдаления_ВариантОтбора", Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_СозданаПериод" Тогда
				ПараметрыОтбора.Вставить("ПериодСозданияСделки", МассивДанных);

			ИначеЕсли Строка.Наименование = "Фильтр_ПериодЗапланированнойЗадачи" Тогда
				ПараметрыОтбора.Вставить("ПериодПланирования", МассивДанных);

			ИначеЕсли Строка.Наименование = "Фильтр_ЗавершенаПериод" Тогда
				ПараметрыОтбора.Вставить("ПериодСделки", МассивДанных);	
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПараметрыОтбора;
	
КонецФункции

&НаКлиенте
// Функция - ПолучениеЭлементовОтбора
Функция ПолучениеЭлементовОтбораКлиент(Массив, СписокЗначений, НаименованиеФильтра)
	
	Если НаименованиеФильтра = "Фильтр_СозданаПериод" 
		Или НаименованиеФильтра = "Фильтр_ЗавершенаПериод" 
		Или НаименованиеФильтра = "Фильтр_ПериодЗапланированнойЗадачи" Тогда
		
		Если СписокЗначений.Количество() > 0 Тогда
			ЗаданноеЗначение = СписокЗначений.Получить(0).Значение; 
			Массив.Добавить(ЗаданноеЗначение.ЗначениеФильтра);
		КонецЕсли;
		
	Иначе
		
		Если СписокЗначений.Количество() > 0 Тогда
			Для каждого Значение из СписокЗначений Цикл
				Если Значение.Значение.Выбран = Истина Тогда
					Массив.Добавить(Значение.Значение.ЗначениеФильтра);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
// Процедура - ОткрытиеФильтровЗавершение.
//
Процедура ОткрытиеФильтровЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытиеФильтровНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
// Процедура - ОткрытиеФильтровНаСервере.
//
Процедура ОткрытиеФильтровНаСервере(Результат)
	
	ПараметрыОтбора = ПолучитьИзВременногоХранилища(Результат);
	ОбновитьМеханизмФильтрацииДанных(ПараметрыОтбора, Истина);	
	
	// Сбрасываем фильтр по задачам после изменения фильтра.
	УстановитьОтображениеФильтровПоЗадачам(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить свойства разделов фильтра.
//
// Параметры:
//  АктуализироватьФлаги - 	 - 
//
Процедура ОбновитьСвойстваРазделовФильтра(АктуализироватьФлаги = Ложь, ИмяСтраницыЗначенийФильтра = Неопределено) Экспорт
	
	Если ИмяСтраницыЗначенийФильтра <> Неопределено Тогда 
		Элементы.СтраницыЗначенийФильтров.ТекущаяСтраница = Элементы[ИмяСтраницыЗначенийФильтра];
	КонецЕсли;		
	УправлениеИнтерфейсамиСервер.ОбновитьСвойстваРазделовФильтра(ЭтаФорма, АктуализироватьФлаги);
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить группу значений фильтра.
//
// Параметры:
//  ИдентификаторСтрокиФильтра	 - 	 - 
//
Процедура ОбновитьГруппуЗначенийФильтра(ИдентификаторСтрокиФильтра, ИнициализироватьВыбранноеЗначение = Ложь, ВыбранноеЗначение = Неопределено) Экспорт
	
	СтрокаФильтра = ТаблицаФильтров.НайтиПоИдентификатору(ИдентификаторСтрокиФильтра);
	УправлениеИнтерфейсамиСервер.ОбновитьГруппуЗначенийФильтра(ЭтаФорма, СтрокаФильтра, ИнициализироватьВыбранноеЗначение, ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить свойства элемента значения.
//
// Параметры:
//  ДанныеЭлементаФильтрации - 	 - 
//
Процедура ОбновитьСвойстваЭлементаЗначения(ДанныеЭлементаФильтрации) Экспорт
	
	УправлениеИнтерфейсамиСервер.ОбновитьСвойстваЭлементаЗначения(ЭтаФорма, , , ДанныеЭлементаФильтрации);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор стандартного периода.
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВыборСтандартногоПериода(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ РезультатВыбора = Неопределено И НЕ ДополнительныеПараметры = Неопределено Тогда
		ЭлементВариантСтандартногоПериода = ЭтаФорма[ДополнительныеПараметры.ИмяТаблицы].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторФильтра).СписокЗначений[0].Значение.СписокСтандартныхПериодов.НайтиПоЗначению(РезультатВыбора.Значение);
		Если НЕ ЭлементВариантСтандартногоПериода = Неопределено Тогда
			ДополнительныеПараметры.Вставить("ИдентификаторЗначения", ЭлементВариантСтандартногоПериода.ПолучитьИдентификатор());
			ЭтаФорма[ДополнительныеПараметры.ИмяТаблицы].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторФильтра).СписокЗначений[0].Значение.СписокСтандартныхПериодов.ЗаполнитьПометки(Ложь);
			ЭлементВариантСтандартногоПериода.Пометка = Истина;
			РезультатОбновления = УправлениеИнтерфейсамиКлиент.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, "УстановитьСтандартныйПериод_ЗначениеФильтра_Идентификатор_" + ДополнительныеПараметры.ИдентификаторФильтра, ДополнительныеПараметры);
		КонецЕсли;	
	КонецЕсли;	

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Процедура, устанавливает заголовки дополнительных отборов.
//
Процедура УстановитьЗаголовкиДополнительныхОтборов(Форма, СтруктураОтбора, ДанныеКоличества = Неопределено)
	
	Если ДанныеКоличества = Неопределено Тогда
		ДанныеКоличества = ПолучитьКоличествоСделокПоДополнительнымОтборам(СтруктураОтбора);
	КонецЕсли;
	
	ЦветРамкиНаличиеЗадач	 = Новый Цвет(208, 53, 86);
	ЦветРамкиОтсутствиеЗадач = Новый Цвет(160, 160, 160);
	
	ЦветТекстаНаличиеЗадач		 = Новый Цвет(208, 53, 86);
	ЦветТекстаОтсутствиеЗадач	 = Новый Цвет(77, 77, 77);
	
	КоличествоБезАктивности = ДанныеКоличества.КоличествоБезАктивности;
	
	Форма.БезЗадачКоличество				 	 = КоличествоБезАктивности;
	Форма.Элементы.БезЗадачКоличество.Ширина 	 = СтрДлина(КоличествоБезАктивности) / 2 + 1;
	Форма.Элементы.БезЗадачКоличество.ЦветРамки	 = ?(КоличествоБезАктивности = 0, ЦветРамкиОтсутствиеЗадач, ЦветРамкиНаличиеЗадач);
	Форма.Элементы.БезЗадачКоличество.ЦветТекста = ?(КоличествоБезАктивности = 0, ЦветТекстаОтсутствиеЗадач, ЦветТекстаНаличиеЗадач);
	
	КоличествоПросроченныхЗадач = ДанныеКоличества.КоличествоПросроченныхЗадач;
	
	Форма.ПросроченныеЗадачиКоличество						 = КоличествоПросроченныхЗадач;
	Форма.Элементы.ПросроченныеЗадачиКоличество.Ширина		 = СтрДлина(КоличествоПросроченныхЗадач) / 2 + 1;
	Форма.Элементы.ПросроченныеЗадачиКоличество.ЦветРамки	 = ?(КоличествоПросроченныхЗадач = 0, ЦветРамкиОтсутствиеЗадач, ЦветРамкиНаличиеЗадач);
	Форма.Элементы.ПросроченныеЗадачиКоличество.ЦветТекста	 = ?(КоличествоПросроченныхЗадач = 0, ЦветТекстаОтсутствиеЗадач, ЦветТекстаНаличиеЗадач);
	
	КоличествоСЗадачамиНаСегодня = ДанныеКоличества.КоличествоСЗадачамиНаСегодня;
	
	Форма.ЗадачиНаСегодняКоличество						 = КоличествоСЗадачамиНаСегодня;
	Форма.Элементы.ЗадачиНаСегодняКоличество.Ширина		 = СтрДлина(КоличествоСЗадачамиНаСегодня) / 2 + 1;
	Форма.Элементы.ЗадачиНаСегодняКоличество.ЦветРамки	 = ?(КоличествоСЗадачамиНаСегодня = 0, ЦветРамкиОтсутствиеЗадач, ЦветРамкиНаличиеЗадач);
	Форма.Элементы.ЗадачиНаСегодняКоличество.ЦветТекста	 = ?(КоличествоСЗадачамиНаСегодня = 0, ЦветТекстаОтсутствиеЗадач, ЦветТекстаНаличиеЗадач);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает количество сделок в дополнительных отборах "кол-во без сделок" и "кол-во с просроченными задачами".
//
Функция ПолучитьКоличествоСделокПоДополнительнымОтборам(СтруктураОтборов)
	
	СписокМенеджеров = СтруктураОтборов.ОтборМенеджер.ВыгрузитьЗначения();
	Если НЕ ЗначениеЗаполнено(СписокМенеджеров) Тогда
		 СписокМенеджеров = СтруктураОтборов.ОтборМенеджер.ДоступныеЗначения.ВыгрузитьЗначения();
	КонецЕсли;
	
	СписокКлиник = СтруктураОтборов.ОтборСтруктурнаяЕдиница.ВыгрузитьЗначения();
	Если НЕ ЗначениеЗаполнено(СписокКлиник) Тогда
		СписокКлиник = СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения.ВыгрузитьЗначения();
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭтапыСделок.Ссылка КАК ЭтапСделки
	|ПОМЕСТИТЬ ЭтапыСделок
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.ВидСделки В(&ВидСделки)
	|	И НЕ ЭтапыСделок.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЭтапыСделок.Ссылка
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.ИмяПредопределенныхДанных = ""Отказ""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЭтапыСделок.Ссылка
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.ИмяПредопределенныхДанных = ""Успех""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сделки.Ссылка КАК Сделка
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЭтапыСделок КАК ЭтапыСделок
	|		ПО Сделки.ЭтапСделки = ЭтапыСделок.ЭтапСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтрагентыСведенияДляСписка КАК КонтрагентыСведенияДляСписка
	|		ПО Сделки.Контрагент = КонтрагентыСведенияДляСписка.Контрагент
	|ГДЕ
	|	Сделки.ВидСделки = &ВидСделки
	|	И ВЫБОР
	|			КОГДА &СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КонтрагентыСведенияДляСписка.Статус = &СтатусПациента
	|		КОНЕЦ
	|	И Сделки.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
	|	И Сделки.СтруктурнаяЕдиница В(&СписокКлиник)
	|	И Сделки.Менеджер В(&СписокМенеджеров)
	|	И Сделки.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(СделкиСведенияДляСписка.Сделка) КАК КоличествоБезАктивности
	|ИЗ
	|	РегистрСведений.СделкиСведенияДляСписка КАК СделкиСведенияДляСписка
	|ГДЕ
	|	СделкиСведенияДляСписка.Сделка В
	|			(ВЫБРАТЬ
	|				ТаблицаСделок.Сделка
	|			ИЗ
	|				ТаблицаСделок)
	|	И СделкиСведенияДляСписка.ЗапланированнаяЗадача = ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)
	|	И СделкиСведенияДляСписка.ЗапланированнаяПредварительнаяЗапись = ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сделки.Сделка КАК Сделка,
	|	СделкиСведенияДляСписка.ЗапланированнаяЗадача КАК ЗапланированнаяЗадача
	|ПОМЕСТИТЬ СделкиЗапланированнаяЗадача
	|ИЗ
	|	ТаблицаСделок КАК Сделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СделкиСведенияДляСписка КАК СделкиСведенияДляСписка
	|		ПО Сделки.Сделка = СделкиСведенияДляСписка.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СделкиЗапланированнаяЗадача.Сделка КАК Ссылка,
	|	СделкиЗапланированнаяЗадача.ЗапланированнаяЗадача.ЗадачаНазначеннаяДата КАК ЗадачаНазначеннаяДата
	|ПОМЕСТИТЬ СделкиЗадачаНазначеннаяДата
	|ИЗ
	|	СделкиЗапланированнаяЗадача КАК СделкиЗапланированнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(СделкиЗадачаНазначеннаяДата.Ссылка) КАК КоличествоПросроченныхЗадач
	|ИЗ
	|	СделкиЗадачаНазначеннаяДата КАК СделкиЗадачаНазначеннаяДата
	|ГДЕ
	|	СделкиЗадачаНазначеннаяДата.ЗадачаНазначеннаяДата МЕЖДУ &ДатаНачалаЗапланированнойЗадачи И &ДатаОкончанияЗапланированнойЗадачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(СделкиЗадачаНазначеннаяДата.Ссылка) КАК КоличествоЗадач
	|ИЗ
	|	СделкиЗадачаНазначеннаяДата КАК СделкиЗадачаНазначеннаяДата
	|ГДЕ
	|	СделкиЗадачаНазначеннаяДата.ЗадачаНазначеннаяДата МЕЖДУ &НачалоДня И &КонецДня";
	
	Запрос.УстановитьПараметр("СписокМенеджеров"					, СписокМенеджеров);
	Запрос.УстановитьПараметр("ДатаНачалаЗапланированнойЗадачи"		, Дата(1,1,1));
	Запрос.УстановитьПараметр("ДатаОкончанияЗапланированнойЗадачи"	, КонецДня(ТекущаяДатаСеанса() - 86400));
	Запрос.УстановитьПараметр("НачалоДня"							, НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("КонецДня"							, КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("СписокКлиник"						, СписокКлиник);
	Запрос.УстановитьПараметр("ВидСделки"							, СтруктураОтборов.ВидСделки);
	Запрос.УстановитьПараметр("СтатусПациента"						, СтруктураОтборов.ОтборСтатусПациента);
	
	РезультатЗапроса 				   	= Запрос.ВыполнитьПакет();
	ВыборкаКоличестваБезАктивности 		= РезультатЗапроса[2].Выбрать();	
	ВыборкаКоличествоПросроченныхЗадач 	= РезультатЗапроса[5].Выбрать();
	ВыборкаКоличествоЗадачиНаСегодня 	= РезультатЗапроса[6].Выбрать();
	
	ДанныеКоличества = Новый Структура;
	ДанныеКоличества.Вставить("КоличествоБезАктивности", ?(ВыборкаКоличестваБезАктивности.Следующий(), ВыборкаКоличестваБезАктивности.КоличествоБезАктивности, 0));
	ДанныеКоличества.Вставить("КоличествоПросроченныхЗадач", ?(ВыборкаКоличествоПросроченныхЗадач.Следующий(), ВыборкаКоличествоПросроченныхЗадач.КоличествоПросроченныхЗадач, 0));
	ДанныеКоличества.Вставить("КоличествоСЗадачамиНаСегодня", ?(ВыборкаКоличествоЗадачиНаСегодня.Следующий(), ВыборкаКоличествоЗадачиНаСегодня.КоличествоЗадач, 0));
	
	Возврат ДанныеКоличества;
	
КонецФункции

#КонецОбласти

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
// Возвращает значение свойства структуры.
//
// Параметры:
//   Структура - Структура
//             - ФиксированнаяСтруктура - объект, из которого необходимо прочитать значение ключа.
//   Ключ - Строка - имя свойства структуры, для которого необходимо прочитать значение.
//   ЗначениеПоУмолчанию - Произвольный - необязательный. Возвращается когда в структуре нет значения по указанному
//                                        ключу.
//       Для скорости рекомендуется передавать только быстро вычисляемые значения (например примитивные типы),
//       а инициализацию более тяжелых значений выполнять после проверки полученного значения (только если это
//       требуется).
//
// Возвращаемое значение:
//   Произвольный - значение свойства структуры. ЗначениеПоУмолчанию если в структуре нет указанного свойства.
//
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
	
КонецФункции

#КонецОбласти
