#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьКлассификатор(Команда)
	
	РезультатЗагрузки = ДобавитьИзКлассификатораНаСервере();

	Описание = "В классификатор загружено " + РезультатЗагрузки.КолличествоЗагружено + " услуг." + 
		?(РезультатЗагрузки.КолличествоОбновлено <> 0, " Обновлено " + РезультатЗагрузки.КолличествоОбновлено + ".", "");
	
	ПоказатьОповещениеПользователя("Загрузка классификатора услуг",, Описание, БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное); 
	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДобавитьИзКлассификатораНаСервере()
	
	СтруктураДанных = Справочники.КлассификаторНоменклатурыМедицинскихУслуг.ЗаполнитьКлассификаторУслуг();
	Возврат СтруктураДанных;
	
КонецФункции

#КонецОбласти
