 
 #Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ЦветМетки) Тогда
		Элементы.УстановкаЦвет.ЦветФона = ЗначениеИзСтрокиВнутр(Объект.ЦветМетки);
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "НаименованиеПриИзменении".
//
Процедура НаименованиеПриИзменении(Элемент)
	
	Элементы.УстановкаЦвет.Заголовок = Объект.Наименование; 
	Элементы.УстановкаЦвет.ЦветТекста = ОбщегоНазначенияВызовСервера.ПолучитьЦветТекстаПоЦветуФона(Элементы.УстановкаЦвет.ЦветФона);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
// Процедура изменяет устанавливает в значение реквизита - цвет фона.
//
Процедура ИзменитьЦветМетки(Цвет)
	
	Объект.ЦветМетки = ЗначениеВСтрокуВнутр(Цвет);
	Элементы.УстановкаЦвет.ЦветФона = Цвет;
	ЦветТекста = ОбщегоНазначенияВызовСервера.ПолучитьЦветТекстаПоЦветуФона(Элементы.УстановкаЦвет.ЦветФона);
	
	Если ЦветТекста = Новый Цвет(64, 64, 64) Тогда
		Объект.ЦветТекстаБелый = Ложь;	
	Иначе
		Объект.ЦветТекстаБелый = Истина;	
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ЦветМетки".
//
Процедура ЦветМетки(Команда)
	
	ДиалогЦвета = Новый ДиалогВыбораЦвета();
	
	#Если Не ВебКлиент Тогда
		ДиалогЦвета.Цвет = Элементы.УстановкаЦвет.ЦветФона;
	#КонецЕсли
	
	ДиалогЦвета.Показать(Новый ОписаниеОповещения("ЦветМеткиЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветМеткиЗавершение(Цвет, ДополнительныеПараметры) Экспорт
	
	Если Цвет <> Неопределено Тогда
		ИзменитьЦветМетки(Цвет);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

