
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// если номенклатура не является запасом, то запретить работу со списком
	Если Параметры.Свойство("Номенклатура") тогда
		
		Если НЕ Параметры.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас 
			И НЕ Параметры.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал тогда
			КоманднаяПанель.Доступность = Ложь;
			Элементы.СписокКонтекстноеМеню.Доступность = Ложь;
			Элементы.Список.Доступность = Ложь;
		КонецЕсли;
		
		// передача номеклатуры для отбора критических остатков
		Элементы.Номенклатура.Видимость = Ложь;
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Номенклатура", Параметры.Номенклатура, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти