
#Область СлужебныйПрограммныйИнтерфейс

#Область __________________________OKTELL___________________________

// Функция - Тестирование сервера
// 
// Параметры:
//  ТипыПодключаемогоОборудования	 - 	 - 
//  Сервер							 - 	 - 
//  Порт							 - 	 - 
//  Логин							 - 	 - 
//  Пароль							 - 	 - 
//  ОписаниеОшибки					 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция OKTELL_ТестированиеСервера(Сервер, Порт, Логин, Пароль, ОписаниеОшибки = "") Экспорт
	
	MSXMLЗапрос = "name=Helix_Test&async=1&timeout=0";
	
	ФлагHTTPS = СтрНайти(Сервер, "https://");
	
	СайтАдрес = СтрЗаменить(Сервер	 , "http://" , "");
	СайтАдрес = СтрЗаменить(СайтАдрес, "https://", "");
	
	Попытка
		
	   Если ФлагHTTPS > 0 Тогда
		   Соединение = Новый HTTPСоединение(СайтАдрес, Порт, Логин, Пароль,,, Новый ЗащищенноеСоединениеOpenSSL());
	   Иначе
		   Соединение = Новый HTTPСоединение(СайтАдрес, Порт, Логин, Пароль);
	   КонецЕсли;
	   
	   HTTPЗапрос = Новый HTTPЗапрос("/execsvcscriptplain", ПолучитьЗаголовкиPOSTЗапроса());
	   HTTPЗапрос.УстановитьТелоИзСтроки(MSXMLЗапрос);
	   
	   // Отправка POST-запроса и получение ответа
	   СтруктураОтвета = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	   
	   Если СтруктураОтвета.КодСостояния <> 200 Тогда
		   ОписаниеОшибки = "Ошибка " + СтруктураОтвета.КодСостояния;
		   Возврат Ложь;
	   КонецЕсли;
	   
   Исключение
	   
	   ИнформацияОбОшибке = ИнформацияОбОшибке();
	   ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
	   Возврат Ложь;
	   
   КонецПопытки;
   
   Возврат Истина;
   
КонецФункции

// Функция - OKTELL событие звонок
// 
// Параметры:
//  ИмяФункции		 - 	 - 
//  ПараметрыJSON	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция OKTELL_СобытиеЗвонок(ПОIPТелефонии, ИмяФункции, ПараметрыJSON, ОписаниеОшибки = "") Экспорт
	
	Результат = Ложь;
	
	УнифицированнаяСтруктураСобытия 								= ПолучитьУнифицированнуюСтруктуруСобытия();
	УнифицированнаяСтруктураСобытия.ПОIPТелефонии 					= ПОIPТелефонии;
	УнифицированнаяСтруктураСобытия.ФинализирующееСобытие 			= Истина;
	УнифицированнаяСтруктураСобытия.ВремяЗавершенияВызова 			= ТекущаяДатаСеанса();
	УнифицированнаяСтруктураСобытия.IDЗвонка 						= Строка(Новый УникальныйИдентификатор);		
	
	Если ИмяФункции = "IncomingCall" Тогда
		
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 			= ПараметрыJSON.ExternalNumber;
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo   			= ?(ПараметрыJSON.Свойство("InternalNumberGroup"), ПараметрыJSON.InternalNumberGroup, Неопределено);
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 			= Перечисления.ВариантыНаправленияВызова.Входящий;
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 				= Перечисления.СтатусыЗвонка.Вызов;			
		УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова 		= ТекущаяДата();
		
		Результат = СобытиеЗвонокДозвон(, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
		
	ИначеЕсли ИмяФункции = "IncomingCallTalkStart" Тогда
		
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 			= ПараметрыJSON.ExternalNumber;
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo   			= ПараметрыJSON.InternalNumber;
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 			= Перечисления.ВариантыНаправленияВызова.Входящий;
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 				= Перечисления.СтатусыЗвонка.Разговор;			
		УнифицированнаяСтруктураСобытия.ВремяОтветаНаВызов	 		= ТекущаяДата();
		
		Результат = СобытиеЗвонокСоединение(, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
		
	ИначеЕсли ИмяФункции = "IncomingCallCompleted" Тогда
		
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 			= СокрЛП(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(Строка(ПараметрыJSON.ExternalNumber))));
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo   			= ?(ПараметрыJSON.InternalNumber = "", Неопределено, СокрЛП(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(Строка(ПараметрыJSON.InternalNumber)))));
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 			= Перечисления.ВариантыНаправленияВызова.Входящий;
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 				= ?(НЕ ЗначениеЗаполнено(ПараметрыJSON.Duration), Перечисления.СтатусыЗвонка.Пропущен, Перечисления.СтатусыЗвонка.Завершен);			
		УнифицированнаяСтруктураСобытия.ПринятДругимАбонентомГруппы = Ложь;
		УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова 		= УнифицированнаяСтруктураСобытия.ВремяЗавершенияВызова - ПараметрыJSON.Duration;
		УнифицированнаяСтруктураСобытия.ВремяОтветаНаВызов 			= ?(ЗначениеЗаполнено(ПараметрыJSON.Duration), УнифицированнаяСтруктураСобытия.ВремяЗавершенияВызова - ПараметрыJSON.Duration, Дата(1,1,1));
		УнифицированнаяСтруктураСобытия.Продолжительность	 		= ПараметрыJSON.Duration;		
		УнифицированнаяСтруктураСобытия.СсылкаНаЗаписьЗвонка 		= ПараметрыJSON.URLRecord;
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 		= НЕ ЗначениеЗаполнено(ПараметрыJSON.Duration);						
		
		Результат = СобытиеЗвонокЗавершен(, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
				
	ИначеЕсли ИмяФункции = "OutgoingCallCompleted" Тогда
		
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 			= СокрЛП(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(Строка(ПараметрыJSON.InternalNumber))));
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo   			= СокрЛП(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(Строка(ПараметрыJSON.ExternalNumber))));
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 			= Перечисления.ВариантыНаправленияВызова.Исходящий;
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 				= ?(НЕ ЗначениеЗаполнено(ПараметрыJSON.Duration), Перечисления.СтатусыЗвонка.НеДозвон, Перечисления.СтатусыЗвонка.Завершен);			
		УнифицированнаяСтруктураСобытия.ПринятДругимАбонентомГруппы = Ложь;
		УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова 		= УнифицированнаяСтруктураСобытия.ВремяЗавершенияВызова - ПараметрыJSON.Duration;
		УнифицированнаяСтруктураСобытия.ВремяОтветаНаВызов 			= ?(ЗначениеЗаполнено(ПараметрыJSON.Duration), УнифицированнаяСтруктураСобытия.ВремяЗавершенияВызова - ПараметрыJSON.Duration, Дата(1,1,1));		
		УнифицированнаяСтруктураСобытия.Продолжительность	 		= ПараметрыJSON.Duration;		
		УнифицированнаяСтруктураСобытия.СсылкаНаЗаписьЗвонка 		= ПараметрыJSON.URLRecord;
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 		= Ложь;						
							
		Результат = СобытиеЗвонокЗавершен(, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
		
	Иначе
		ОписаниеОшибки = "Функция не распознана '" + ИмяФункции + "'";
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

// Функция - Исходящий звонок осуществить
// 
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  ВнешнийНомерТелефона	 - 	 - 
//  ВнутреннийНомерТелефона	 - 	 - 
//  Контрагент				 - 	 - 
//  Сотрудник				 - 	 - 
//  ОписаниеОшибки			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция OKTELL_ИсходящийЗвонокОсуществить(ПОIPТелефонии, ВнутреннийНомерТелефона, ВнешнийНомерТелефона, Знач Контрагент = Неопределено, Знач Сотрудник = Неопределено, ОписаниеОшибки = "")
		
	IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
	
	Если IPТелефонияПараметры = Неопределено
		ИЛИ ТипЗнч(IPТелефонияПараметры) <> Тип("Структура")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Сервер")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Порт")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Логин")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Пароль") Тогда
		
		ОписаниеОшибки = "Ошибка! Необходимо произвести настройки сервера IP-телефонии в подключаемом оборудовании.";
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ExternalNumber", ВнешнийНомерТелефона);
	СтруктураПараметров.Вставить("InternalNumber", ВнутреннийНомерТелефона);
	СтруктураПараметров.Вставить("ID_Klient"	 , Строка(?(ЗначениеЗаполнено(Контрагент), Контрагент.УникальныйИдентификатор(), Неопределено)));
	СтруктураПараметров.Вставить("ID_Manager"	 , Строка(?(ЗначениеЗаполнено(Сотрудник), Сотрудник.УникальныйИдентификатор(), ПараметрыСеанса.ТекущийПользователь.УникальныйИдентификатор())));
	
	MSXMLЗапрос = "name=Helix_OutgoingCall&startparam1=" + КодироватьВJSON(СтруктураПараметров, Ложь) + "&async=1&timeout=0";
	
	ФлагHTTPS = СтрНайти(IPТелефонияПараметры.Сервер, "https://");
	
	СайтАдрес = СтрЗаменить(IPТелефонияПараметры.Сервер, "http://", "");
	СайтАдрес = СтрЗаменить(СайтАдрес				   , "https://", "");
	
	Попытка
			   	   
	   Если ФлагHTTPS > 0 Тогда
		   Соединение = Новый HTTPСоединение(СайтАдрес, IPТелефонияПараметры.Порт, IPТелефонияПараметры.Логин, IPТелефонияПараметры.Пароль,,, Новый ЗащищенноеСоединениеOpenSSL());
	   Иначе
		   Соединение = Новый HTTPСоединение(СайтАдрес, IPТелефонияПараметры.Порт, IPТелефонияПараметры.Логин, IPТелефонияПараметры.Пароль);
	   КонецЕсли;
	   
	   HTTPЗапрос = Новый HTTPЗапрос("/execsvcscriptplain", ПолучитьЗаголовкиPOSTЗапроса());
	   HTTPЗапрос.УстановитьТелоИзСтроки(MSXMLЗапрос);
	   
	   // Отправка POST-запроса и получение ответа
	   СтруктураОтвета = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	   
	   Если СтруктураОтвета.КодСостояния <> 200 Тогда
		   ОписаниеОшибки = "Ошибка сервиса IP-телефонии: " + СтруктураОтвета.КодСостояния;
		   Возврат Ложь;
	   КонецЕсли;
	   
	   ОтветHTTP 	 = СтруктураОтвета.ПолучитьТелоКакСтроку();
	   ПараметрыJSON = ДекодироватьИзJSON(ОтветHTTP);
	   
	   Если ПараметрыJSON.Success <> Истина Тогда
		   ОписаниеОшибки = "Ошибка при выполнении операции сервиса IP-телефонии: " + ПараметрыJSON.Description;
		   Возврат Ложь;
	   КонецЕсли;
	   
   Исключение
	   
	   ИнформацияОбОшибке = ИнформацияОбОшибке();
	   ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
	   Возврат Ложь;
	   
   КонецПопытки;
   
   Возврат Истина;
   
КонецФункции

// Функция - Исходящий звонок осуществить
// 
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  ВнешнийНомерТелефона	 - 	 - 
//  ВнутреннийНомерТелефона	 - 	 - 
//  Контрагент				 - 	 - 
//  Сотрудник				 - 	 - 
//  ОписаниеОшибки			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция OKTELL_ПереадресацияЗвонка(ПОIPТелефонии, IDЗвонка, СНомерТелефона, НаНомерТелефона, ОписаниеОшибки = "")
		
	Попытка
			   
		ВызватьИсключение "Не поддерживаемая функциональность";
		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ___________________________MANGO___________________________

////// / MANGO ////// /

// Функция - Тестирование сервера
// 
// Параметры:
//  ТипыПодключаемогоОборудования	 - 	 - 
//  Сервер							 - 	 - 
//  Порт							 - 	 - 
//  Логин							 - 	 - 
//  Пароль							 - 	 - 
//  ОписаниеОшибки					 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция MANGO_ТестированиеСервера(Сервер, Порт, КодПродукта, Ключ, ОписаниеОшибки = "") Экспорт
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("date_from" , "1072915200");
	СтруктураПараметров.Вставить("date_to"	 , "1072997812");
	СтруктураПараметров.Вставить("call_party", Новый Структура("number", "74956496783"));
	СтруктураПараметров.Вставить("request_id", "Test_Connection");
	
	JSONText = КодироватьВJSON(СтруктураПараметров, Ложь);
	MSXMLЗапрос = "vpbx_api_key=" + КодПродукта + "&"
					+ "sign=" + SHA256(КодПродукта + JSONText + Ключ) + "&"
					+ "json=" + JSONText;
	
	СайтАдрес = ПреобразоватьАдресСервера(Сервер);
	
	Попытка

		Соединение = Новый HTTPСоединение(СайтАдрес, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		HTTPЗапрос = Новый HTTPЗапрос("/vpbx/stats/request", ПолучитьЗаголовкиPOSTЗапроса());
		HTTPЗапрос.УстановитьТелоИзСтроки(MSXMLЗапрос);
		
		// Отправка POST-запроса и получение ответа.
		СтруктураОтвета = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		Если СтруктураОтвета.КодСостояния <> 200 Тогда
			
			ОписаниеОшибки = "Ошибка сервиса IP-телефонии: " + СтруктураОтвета.КодСостояния;
			ОтветHTTP = СтруктураОтвета.ПолучитьТелоКакСтроку();
			
			Если ОтветHTTP <> "" Тогда
				ПараметрыJSON  = ДекодироватьИзJSON(ОтветHTTP);
				ОписаниеОшибки = ОписаниеОшибки + " (" + ПараметрыJSON.Message + ")";
			КонецЕсли;
			
			Возврат Ложь;
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Функция - MANGO событие звонок
// 
// Параметры:
//  ИмяФункции		 - 	 - 
//  ПараметрыJSON	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция MANGO_СобытиеЗвонок(ПОIPТелефонии, ПараметрыJSON, ОписаниеОшибки = "") Экспорт
	
	УнифицированнаяСтруктураСобытия 							= ПолучитьУнифицированнуюСтруктуруСобытия();
	УнифицированнаяСтруктураСобытия.ПОIPТелефонии 				= ПОIPТелефонии;
	УнифицированнаяСтруктураСобытия.IDЗвонка 					= ПараметрыJSON.entry_id;
	УнифицированнаяСтруктураСобытия.IDПлеча 					= ПараметрыJSON.call_id;
	УнифицированнаяСтруктураСобытия.ФинализирующееСобытие 		= Ложь;
	
	УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 			= ?(ПараметрыJSON.From.Свойство("extension") И ЗначениеЗаполнено(ПараметрыJSON.From.Extension), ПараметрыJSON.From.Extension, ПараметрыJSON.From.Number);
	УнифицированнаяСтруктураСобытия.НомерТелефонаTo   			= ?(ПараметрыJSON.To.Свойство("extension"), ПараметрыJSON.To.Extension, ПараметрыJSON.To.Number);
	
	Если ПараметрыJSON.call_state = "Appeared" ИЛИ ПараметрыJSON.call_state = "Connected" Тогда 
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 		= ?(НЕ (ПараметрыJSON.from.Свойство("extension") И ПараметрыJSON.to.Свойство("number")), Перечисления.ВариантыНаправленияВызова.Входящий, Перечисления.ВариантыНаправленияВызова.Исходящий);
	Иначе
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 		= ?(НЕ (ПараметрыJSON.Свойство("command_id") И ПараметрыJSON.command_id = "OutgoingCall" ИЛИ ПараметрыJSON.From.Свойство("extension") И НЕ ПараметрыJSON.To.Свойство("extension")), Перечисления.ВариантыНаправленияВызова.Входящий, Перечисления.ВариантыНаправленияВызова.Исходящий);
	КонецЕсли;
	
	// ПризнакВходящийЗвонок = НЕ (НРег(ПараметрыJSON.location) = "abonent" И ПараметрыJSON.call_state = "Appeared" И ПараметрыJSON.from.Свойство("extension") И ПараметрыJSON.to.Свойство("number"));
	
	Если УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий Тогда 
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 	= (ПараметрыJSON.Свойство("disconnect_reason") И
							  	 (СтрЗаменить(ПараметрыJSON.Disconnect_Reason," ","") = 1100 ИЛИ СтрЗаменить(ПараметрыJSON.Disconnect_Reason," ","") = 1131));
	Иначе 
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 	= Ложь;						
	КонецЕсли;
	
	//// Временно для дебага	
	// Если НЕ СтрНайти(УнифицированнаяСтруктураСобытия.НомерТелефонаFrom, "sip:") = 0 ИЛИ НЕ СтрНайти(УнифицированнаяСтруктураСобытия.НомерТелефонаTo, "sip:") = 0 Тогда 
	// 	а = 0;
	// КонецЕсли;	
	
	// Если было перенаправление вызова - то находим первоначальный номер
	Если ПараметрыJSON.Свойство("taken_from_call_id") Тогда
		СтрокаТЗЗвонка = РегистрыСведений.ИсторияВызовов.ПолучитьПоIDЗвонка(ПараметрыJSON.taken_from_call_id);
		Если СтрокаТЗЗвонка <> Неопределено Тогда
			УнифицированнаяСтруктураСобытия.НомерТелефонаFrom = СтрокаТЗЗвонка.НомерТелефона;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыJSON.Свойство("Call_State") = Ложь
			ИЛИ ПараметрыJSON.Свойство("Call_State") И ПараметрыJSON.Call_State = "OnHold"
			ИЛИ ПараметрыJSON.Свойство("Location") И ПараметрыJSON.Location = "ivr" И ПараметрыJSON.Call_State <> "Appeared"
			ИЛИ ПараметрыJSON.From.Свойство("extension") = Ложь И ПараметрыJSON.Свойство("command_id") И ПараметрыJSON.command_id = "OutgoingCall" Тогда
		Возврат Истина;
	
	ИначеЕсли ПараметрыJSON.Свойство("Location") Тогда 
		
		Если ПараметрыJSON.Call_State = "Appeared" И (НРег(ПараметрыJSON.location) = "queue" ИЛИ НРег(ПараметрыJSON.location) = "abonent") И ПараметрыJSON.To.Свойство("acd_group") И ЗначениеЗаполнено(ПараметрыJSON.To.acd_group) И УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий Тогда   // очередь дозвона на группу
			СтруктураЛичныйМенеджер = Ложь;// IPТелефония.ПолучитьЛичногоМенеджераДляПереадресации(УнифицированнаяСтруктураСобытия.НомерТелефонаFrom, ОписаниеОшибки);
			Если СтруктураЛичныйМенеджер <> Ложь Тогда
				MANGO_ПереадресацияЗвонка(ПОIPТелефонии, ПараметрыJSON.call_id, "", ОписаниеОшибки);
				// MANGO_ПереадресацияЗвонка(ПОIPТелефонии, ПараметрыJSON.call_id, СтруктураЛичныйМенеджер.InternalNumberGroup, ОписаниеОшибки);
				Возврат Истина;
			ИначеЕсли ПараметрыJSON.Call_State = "Appeared" И НРег(ПараметрыJSON.location) = "abonent" Тогда
				УнифицированнаяСтруктураСобытия.СтатусЗвонка 			= Перечисления.СтатусыЗвонка.Вызов;							
				УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова 	= МестноеВремя(Дата(1970, 01, 01) + ПараметрыJSON.timestamp, ПолучитьЧасовойПоясИнформационнойБазы());
				Возврат СобытиеЗвонокДозвон(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
			Иначе
				Возврат Истина;
			КонецЕсли;
			
		ИначеЕсли ПараметрыJSON.Call_State = "Appeared" И НРег(ПараметрыJSON.location) = "abonent" Тогда
			
			УнифицированнаяСтруктураСобытия.СтатусЗвонка 				= Перечисления.СтатусыЗвонка.Вызов;			
			УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова 		= МестноеВремя(Дата(1970, 01, 01) + ПараметрыJSON.timestamp, ПолучитьЧасовойПоясИнформационнойБазы());
			Возврат СобытиеЗвонокДозвон(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);		
			
		ИначеЕсли ПараметрыJSON.Call_State = "Connected" И НРег(ПараметрыJSON.location) = "abonent" Тогда
			
			УнифицированнаяСтруктураСобытия.СтатусЗвонка 				= Перечисления.СтатусыЗвонка.Разговор;
			УнифицированнаяСтруктураСобытия.ВремяОтветаНаВызов 			= МестноеВремя(Дата(1970, 01, 01) + ПараметрыJSON.timestamp, ПолучитьЧасовойПоясИнформационнойБазы());			
			Возврат СобытиеЗвонокСоединение(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
			
		ИначеЕсли ПараметрыJSON.Call_State = "Disconnected" И НРег(ПараметрыJSON.location) = "abonent" Тогда
			
			УнифицированнаяСтруктураСобытия.СтатусЗвонка 				= ?(УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий И УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен, Перечисления.СтатусыЗвонка.Пропущен, Перечисления.СтатусыЗвонка.Завершен);
			УнифицированнаяСтруктураСобытия.ВремяЗавершенияВызова		= МестноеВремя(Дата(1970, 01, 01) + ПараметрыJSON.timestamp, ПолучитьЧасовойПоясИнформационнойБазы());
			УнифицированнаяСтруктураСобытия.ПринятДругимАбонентомГруппы = УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий И ПараметрыJSON.Свойство("disconnect_reason") И СтрЗаменить(ПараметрыJSON.Disconnect_Reason," ","") = 1100;
			
			Возврат СобытиеЗвонокЗавершен(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
			
		Иначе
			ОписаниеОшибки = "Функция не существует или не распознана.'";
			Возврат Истина;
			
		КонецЕсли;
	Иначе 
		ОписаниеОшибки = "Не передан ключевой параметр ""Location"".'";
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

// Функция - MANGO событие завершение звонка
// 
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  ПараметрыJSON	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция MANGO_СобытиеЗавершениеЗвонка(ПОIPТелефонии, ПараметрыJSON, ОписаниеОшибки = "") Экспорт
	
	УнифицированнаяСтруктураСобытия 							= ПолучитьУнифицированнуюСтруктуруСобытия();
	УнифицированнаяСтруктураСобытия.ПОIPТелефонии 				= ПОIPТелефонии;
	УнифицированнаяСтруктураСобытия.IDЗвонка 					= ПараметрыJSON.entry_id;
	УнифицированнаяСтруктураСобытия.ФинализирующееСобытие 		= Истина;

	// Определяем направление вызова
	Если ПараметрыJSON.call_direction = 0 Тогда 
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 		= Перечисления.ВариантыНаправленияВызова.Внутренний;
	ИначеЕсли ПараметрыJSON.call_direction = 1 Тогда 
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 		= Перечисления.ВариантыНаправленияВызова.Входящий;
	ИначеЕсли ПараметрыJSON.call_direction = 2 Тогда 
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 		= Перечисления.ВариантыНаправленияВызова.Исходящий;
	Иначе 
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 		= ?(ПараметрыJSON.From.Свойство("extension"), Перечисления.ВариантыНаправленияВызова.Исходящий, Перечисления.ВариантыНаправленияВызова.Входящий);
	КонецЕсли;	
	
	// Определяем результат вызова
	ПризнакЗвонокПропущен 	= Ложь;			
	Если ПараметрыJSON.entry_result = 0 Тогда 
		УнифицированнаяСтруктураСобытия.ЗвонокУспешен 			= Ложь;
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 	= УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий;
		УнифицированнаяСтруктураСобытия.СтатусЗвонка			= ?(УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий, Перечисления.СтатусыЗвонка.Пропущен, Перечисления.СтатусыЗвонка.НеДозвон);
	ИначеЕсли ПараметрыJSON.entry_result = 1 Тогда 
		УнифицированнаяСтруктураСобытия.ЗвонокУспешен 			= Истина;
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 	= Ложь;		
		УнифицированнаяСтруктураСобытия.СтатусЗвонка			= Перечисления.СтатусыЗвонка.Завершен;		
	КонецЕсли;	
	
	// УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 			= ?(ПараметрыJSON.From.Свойство("extension") И ЗначениеЗаполнено(ПараметрыJSON.From.Extension), ПараметрыJSON.From.Extension, ПараметрыJSON.From.Number);
	// УнифицированнаяСтруктураСобытия.НомерТелефонаTo   			= ?(ПараметрыJSON.To.Свойство("extension"), ПараметрыJSON.To.Extension, ПараметрыJSON.To.Number);
	
	FromExtension 	= ?(ПараметрыJSON.From.Свойство("extension"), ПараметрыJSON.From.Extension	, "");
	FromNumber 		= ?(ПараметрыJSON.From.Свойство("Number")	, ПараметрыJSON.From.Number		, "");
	ToExtension 	= ?(ПараметрыJSON.To.Свойство("extension")	, ПараметрыJSON.To.Extension	, "");
	ToNumber 		= ?(ПараметрыJSON.To.Свойство("Number")		, ПараметрыJSON.To.Number		, "");
	
	Если ЗначениеЗаполнено(FromExtension) Тогда 
		Если СтрНайти(FromExtension, "sip:") = 0 Тогда 
			УнифицированнаяСтруктураСобытия.НомерТелефонаFrom = FromExtension;
		ИначеЕсли ЗначениеЗаполнено(FromNumber) Тогда 
			УнифицированнаяСтруктураСобытия.НомерТелефонаFrom = FromNumber;
		Иначе 
			УнифицированнаяСтруктураСобытия.НомерТелефонаFrom = FromExtension;
		КонецЕсли;	
	Иначе 
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom = FromNumber;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ToExtension) Тогда 
		Если СтрНайти(ToExtension, "sip:") = 0 Тогда 
			УнифицированнаяСтруктураСобытия.НомерТелефонаTo = ToExtension;
		ИначеЕсли ЗначениеЗаполнено(ToNumber) Тогда 
			УнифицированнаяСтруктураСобытия.НомерТелефонаTo = ToNumber;
		Иначе 
			УнифицированнаяСтруктураСобытия.НомерТелефонаTo = ToExtension;
		КонецЕсли;	
	Иначе 
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo = ToNumber;
	КонецЕсли;
	
	// Определяем время поступления вызова
	Если ПараметрыJSON.Свойство("create_time") Тогда 
		УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова = МестноеВремя(Дата(1970, 01, 01) + ПараметрыJSON.create_time, ПолучитьЧасовойПоясИнформационнойБазы());
	КонецЕсли;
	
	// Определяем время ответа на вызов (Если в звонке не состоялся разговор, то равно нулю)
	Если ПараметрыJSON.Свойство("talk_time") Тогда
		Если ПараметрыJSON.talk_time = 0 ИЛИ ПризнакЗвонокПропущен = Истина Тогда 
			УнифицированнаяСтруктураСобытия.ВремяОтветаНаВызов 	= Неопределено;
		Иначе 	
			УнифицированнаяСтруктураСобытия.ВремяОтветаНаВызов 	= МестноеВремя(Дата(1970, 01, 01) + ПараметрыJSON.talk_time, ПолучитьЧасовойПоясИнформационнойБазы());
		КонецЕсли;	
	КонецЕсли;
	
	// Определяем  время завершения всего разговора
	Если ПараметрыJSON.Свойство("end_time") Тогда 
		УнифицированнаяСтруктураСобытия.ВремяЗавершенияВызова 	= МестноеВремя(Дата(1970, 01, 01) + ПараметрыJSON.end_time, ПолучитьЧасовойПоясИнформационнойБазы());
	КонецЕсли;
	
	//// Временно для дебага
	// Если НЕ СтрНайти(УнифицированнаяСтруктураСобытия.НомерТелефонаFrom, "sip:") = 0 ИЛИ НЕ СтрНайти(УнифицированнаяСтруктураСобытия.НомерТелефонаTo, "sip:") = 0 Тогда 
	// 	а = 0;
	// КонецЕсли;	
	
	Возврат СобытиеЗвонокЗавершен(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
			
	
КонецФункции

// Функция - MANGO событие звонок
// 
// Параметры:
//  ИмяФункции		 - 	 - 
//  ПараметрыJSON	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция MANGO_СобытиеЗаписьРазговора(ПОIPТелефонии, ПараметрыJSON, ОписаниеОшибки = "") Экспорт
	
	Результат = Истина;
	ФайлСсылка = Неопределено;
	
	IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
	Если ПараметрыJSON.Свойство("Recording_State") И ПараметрыJSON.Recording_State <> "Completed" Тогда
		Возврат Результат;
	КонецЕсли;
	
	УнифицированнаяСтруктураСобытия 							= ПолучитьУнифицированнуюСтруктуруСобытия();
	УнифицированнаяСтруктураСобытия.ПОIPТелефонии 				= ПОIPТелефонии;
	УнифицированнаяСтруктураСобытия.IDЗвонка 					= ПараметрыJSON.entry_id;
	УнифицированнаяСтруктураСобытия.СсылкаНаЗаписьЗвонка 		= IPТелефонияПараметры.Сервер + "/queries/recording/issa/" + ПараметрыJSON.Recording_ID + "/play";
	УнифицированнаяСтруктураСобытия.ФинализирующееСобытие 		= Ложь;
		
	ДобавитьОбновитьЗвонокВИсторию(ПараметрыJSON, УнифицированнаяСтруктураСобытия);
	
	Возврат Результат;
	
КонецФункции

// Функция - Исходящий звонок осуществить
// 
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  ВнешнийНомерТелефона	 - 	 - 
//  ВнутреннийНомерТелефона	 - 	 - 
//  Контрагент				 - 	 - 
//  Сотрудник				 - 	 - 
//  ОписаниеОшибки			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция MANGO_ИсходящийЗвонокОсуществить(ПОIPТелефонии, ВнутреннийНомерТелефона, ВнешнийНомерТелефона, ОписаниеОшибки = "")
		
	IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
	
	Если IPТелефонияПараметры = Неопределено
		ИЛИ ТипЗнч(IPТелефонияПараметры) <> Тип("Структура")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Сервер")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("КодПродукта")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Ключ") Тогда
		
		ОписаниеОшибки = "Ошибка! Необходимо произвести настройки сервера IP-телефонии в подключаемом оборудовании.";
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("command_id", "OutgoingCall");
	СтруктураПараметров.Вставить("from"		 , Новый Структура("extension", ВнутреннийНомерТелефона));
	СтруктураПараметров.Вставить("to_number" , ВнешнийНомерТелефона);
	
	JSONText 	= КодироватьВJSON(СтруктураПараметров, Ложь);
	MSXMLЗапрос = ПолучитьJSONСтрокуЗапроса(IPТелефонияПараметры, JSONText);
	СайтАдрес 	= ПреобразоватьАдресСервера(IPТелефонияПараметры.Сервер);
	
	Попытка
			   		
		Соединение = Новый HTTPСоединение(СайтАдрес, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		
		HTTPЗапрос = Новый HTTPЗапрос("/vpbx/commands/callback", ПолучитьЗаголовкиPOSTЗапроса());
		HTTPЗапрос.УстановитьТелоИзСтроки(MSXMLЗапрос);
		
		// Отправка POST-запроса и получение ответа.
		СтруктураОтвета = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ОтветHTTP 		= СтруктураОтвета.ПолучитьТелоКакСтроку();
		
		Если СтруктураОтвета.КодСостояния <> 200 Тогда
			
			ОписаниеОшибки = "Ошибка сервиса IP-телефонии: " + СтруктураОтвета.КодСостояния;
			
			Если ОтветHTTP <> "" Тогда
				ПараметрыJSON  = ДекодироватьИзJSON(ОтветHTTP);
				ОписаниеОшибки = ОписаниеОшибки + " : " + ПараметрыJSON.Message;
			КонецЕсли;
			
			Возврат Ложь;
		КонецЕсли;
		
		ПараметрыJSON = ДекодироватьИзJSON(ОтветHTTP);
		Если ПараметрыJSON.result <> 1000 Тогда
		    ОписаниеОшибки = "Ошибка при выполнении операции сервиса IP-телефонии: " + ПараметрыJSON.result;
			Возврат Ложь;
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Функция - Исходящий звонок осуществить
// 
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  ВнешнийНомерТелефона	 - 	 - 
//  ВнутреннийНомерТелефона	 - 	 - 
//  Контрагент				 - 	 - 
//  Сотрудник				 - 	 - 
//  ОписаниеОшибки			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция MANGO_ПереадресацияЗвонка(ПОIPТелефонии, IDЗвонка, НаНомерТелефона, ОписаниеОшибки = "")
		
	IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
	
	Если IPТелефонияПараметры = Неопределено
		ИЛИ ТипЗнч(IPТелефонияПараметры) <> Тип("Структура")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Сервер")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("КодПродукта")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Ключ") Тогда
		
		ОписаниеОшибки = "Ошибка! Необходимо произвести настройки сервера IP-телефонии в подключаемом оборудовании.";
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("call_id, to_number", IDЗвонка, НаНомерТелефона);
	
	JSONText 	= КодироватьВJSON(СтруктураПараметров, Ложь);
	MSXMLЗапрос = ПолучитьJSONСтрокуЗапроса(IPТелефонияПараметры, JSONText);
	СайтАдрес 	= ПреобразоватьАдресСервера(IPТелефонияПараметры.Сервер);
	
	Попытка
		
		Соединение = Новый HTTPСоединение(СайтАдрес, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		
		HTTPЗапрос = Новый HTTPЗапрос("/vpbx/commands/route", ПолучитьЗаголовкиPOSTЗапроса());
		HTTPЗапрос.УстановитьТелоИзСтроки(MSXMLЗапрос);
		
		// Отправка POST-запроса и получение ответа.
		СтруктураОтвета = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ОтветHTTP 		= СтруктураОтвета.ПолучитьТелоКакСтроку();
		
		Если СтруктураОтвета.КодСостояния <> 200 Тогда
			
			ОписаниеОшибки = "Ошибка сервиса IP-телефонии " + СтруктураОтвета.КодСостояния;
			
			Если ОтветHTTP <> "" Тогда
				ПараметрыJSON  = ДекодироватьИзJSON(ОтветHTTP);
				ОписаниеОшибки = ОписаниеОшибки + " : " + ПараметрыJSON.Message;
			КонецЕсли;
			
			Возврат Ложь;
		КонецЕсли;
		
		ПараметрыJSON = ДекодироватьИзJSON(ОтветHTTP);
		Если ОтветHTTP.result <> 1000 Тогда
		    ОписаниеОшибки = "Ошибка при выполнении операции сервиса IP-телефонии: " + ПараметрыJSON.result;
			Возврат Ложь;
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Функция - MANGO перевод текущего звонка
// 
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  IDПлеча			 - 	 - 
//  СНомерТелефона	 - 	 - 
//  НаНомерТелефона	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция MANGO_ПереводТекущегоЗвонка(ПОIPТелефонии, IDПлеча, СНомерТелефона, НаНомерТелефона, ОписаниеОшибки = "")
		
	IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
	Если IPТелефонияПараметры = Неопределено ИЛИ ТипЗнч(IPТелефонияПараметры) <> Тип("Структура")
			ИЛИ IPТелефонияПараметры.Свойство("Сервер") = Ложь ИЛИ IPТелефонияПараметры.Свойство("КодПродукта") = Ложь ИЛИ IPТелефонияПараметры.Свойство("Ключ") = Ложь Тогда
		ОписаниеОшибки = "Ошибка! Необходимо произвести настройки сервера IP-телефонии в подключаемом оборудовании.";
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("call_id, method, to_number, initiator", IDПлеча, "blind", НаНомерТелефона, СНомерТелефона);
	JSONText = КодироватьВJSON(СтруктураПараметров, Ложь);
	MSXMLЗапрос = "vpbx_api_key=" + IPТелефонияПараметры.КодПродукта + "&"
					+ "sign=" + SHA256(IPТелефонияПараметры.КодПродукта + JSONText + IPТелефонияПараметры.Ключ, "SHA_low_case") + "&"
					+ "json=" + JSONText;
	
	Попытка
			   
	   НомерШага = 1; // Создание КОМ объекта для отправки запроса
		MSXML = Новый COMОбъект("MSXML2.ServerXMLHTTP"); 
		MSXML.open("POST", IPТелефонияПараметры.Сервер + "/commands/transfer", 0);
		MSXML.setRequestHeader("Content-Type", "application/x-www-form-urlencoded");
		MSXML.setRequestHeader("Content-Charset", "utf-8");
		MSXML.setRequestHeader("outputencoding", "utf-8");
		
	   НомерШага = 2; // Отправка XML запроса на сервер и получение ответа
	    MSXML.send(MSXMLЗапрос);
		Если MSXML.status <> 200 Тогда
			ОписаниеОшибки = "Ошибка сервиса IP-телефонии " + MSXML.status + " - " + MSXML.statusText;
			Если MSXML.responseText <> "" Тогда
				ПараметрыJSON = ДекодироватьИзJSON(MSXML.responseText);
				ОписаниеОшибки = ОписаниеОшибки + " : " + ПараметрыJSON.Message;
			КонецЕсли;
			Возврат Ложь;
		КонецЕсли;	

	   НомерШага = 3; // Разбор XML ответа	
		MSXMLОтвет = ДекодироватьИзJSON(MSXML.ResponseText);
		Если MSXMLОтвет.result <> 1000 Тогда
			ОписаниеОшибки = "Ошибка при выполнении операции сервиса IP-телефонии: " + MSXMLОтвет.result;
			Возврат Ложь;
		КонецЕсли; 
				
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Ложь;
		
	КонецПопытки;
		
	Возврат Истина;
	
КонецФункции

// Функция - Тестирование сервера
// 
// Параметры:
//  ТипыПодключаемогоОборудования	 - 	 - 
//  Сервер							 - 	 - 
//  Порт							 - 	 - 
//  Логин							 - 	 - 
//  Пароль							 - 	 - 
//  ОписаниеОшибки					 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция MANGO_ПолучениеФайлаЗаписиРазговора(ПОIPТелефонии, IDЗаписи, ОписаниеОшибки = "", СтруктураПереадресации = Неопределено) Экспорт
	
	АдресВоВременномХранилище = "";
	               
	Если СтруктураПереадресации = Неопределено Тогда // 1 запрос
		IPТелефонияПараметры 		= ПОIPТелефонии.Параметры.Получить();
		СтруктураПараметров 		= Новый Структура("recording_id, action", IDЗаписи, "download");
		JSONText 					= КодироватьВJSON(СтруктураПараметров, Ложь);
		
		MSXMLЗапрос 				= "vpbx_api_key=" + IPТелефонияПараметры.КодПродукта + "&"
									+ "sign=" + SHA256(IPТелефонияПараметры.КодПродукта + JSONText + IPТелефонияПараметры.Ключ) + "&"
									+ "json=" + JSONText;
		
		СайтАдрес 					= ПреобразоватьАдресСервера(IPТелефонияПараметры.Сервер);
		
		Попытка
			HTTP_Соединение 		= Новый HTTPСоединение(СайтАдрес,,,,,, Новый ЗащищенноеСоединениеOpenSSL());		
			HTTP_Запрос 			= Новый HTTPЗапрос("/vpbx/queries/recording/post", ПолучитьЗаголовкиPOSTЗапроса());
			HTTP_Запрос.УстановитьТелоИзСтроки(MSXMLЗапрос);
			
			// Отправка POST-запроса и получение ответа
			СтруктураОтвета 		= HTTP_Соединение.ОтправитьДляОбработки(HTTP_Запрос);
		Исключение
			ИнформацияОбОшибке 		= ИнформацияОбОшибке();
			ОписаниеОшибки 			= ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
			Возврат Неопределено;
		КонецПопытки;
	Иначе                                          // запрос после переадресации
		АдресПереадресации 			= СтруктураПереадресации.СтруктураОтвета.Заголовки.Получить("Location"); // https://files.mango-office.ru/storage/api/1831ed2f38ca96f884797ee2fec18835
		Если АдресПереадресации = Неопределено Тогда
			ОписаниеОшибки 			= ВернутьОписаниеОшибки(СтруктураПереадресации.СтруктураОтвета, НСтр("ru = 'Ошибка переадресации. Сервер не сообщил адрес ресурса!'"));
			Возврат Неопределено;
		Иначе 	
			СтруктураURI 			= ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресПереадресации);
			Попытка
				HTTP_Соединение 	= Новый HTTPСоединение(СтруктураURI.Хост,,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 
				HTTP_Запрос 		= Новый HTTPЗапрос(СтруктураURI.ПутьНаСервере);
				// HTTP_Запрос.УстановитьТелоИзСтроки(СтруктураПереадресации.MSXMLЗапрос);
				
				// Отправка GET-запроса и получение ответа
				СтруктураОтвета 	= HTTP_Соединение.Получить(HTTP_Запрос);
			Исключение
				ИнформацияОбОшибке 	= ИнформацияОбОшибке();
				ОписаниеОшибки 		= ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
				Возврат Неопределено;
			КонецПопытки;
			
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураОтвета.КодСостояния >= 400 И СтруктураОтвета.КодСостояния < 600  Тогда
		ОписаниеОшибки = ВернутьОписаниеОшибки(СтруктураОтвета);
		Возврат Неопределено;
	ИначеЕсли СтруктураОтвета.КодСостояния = 301 ИЛИ СтруктураОтвета.КодСостояния = 302 Тогда  // перенаправление
		Если НЕ СтруктураПереадресации = Неопределено И СтруктураПереадресации.КоличествоПеренаправлений > 20 Тогда
			ОписаниеОшибки = ВернутьОписаниеОшибки(СтруктураОтвета, НСтр("ru = 'Ошибка переадресации. Обнаружена циклическая переадресация.'"));
			Возврат Неопределено;			
		КонецЕсли;		
		НоваяСтруктураПереадресации = Новый Структура;
		НоваяСтруктураПереадресации.Вставить("СайтАдрес"					, СайтАдрес);
		НоваяСтруктураПереадресации.Вставить("MSXMLЗапрос"					, MSXMLЗапрос);
		НоваяСтруктураПереадресации.Вставить("СтруктураОтвета"				, СтруктураОтвета);
		НоваяСтруктураПереадресации.Вставить("КоличествоПеренаправлений"	, ?(СтруктураПереадресации = Неопределено, 1, СтруктураПереадресации.КоличествоПеренаправлений + 1));
		Возврат MANGO_ПолучениеФайлаЗаписиРазговора(ПОIPТелефонии, IDЗаписи, ОписаниеОшибки = "", НоваяСтруктураПереадресации)
	ИначеЕсли СтруктураОтвета.КодСостояния = 200 Тогда 
		ДвоичныеДанныеФайла = СтруктураОтвета.ПолучитьТелоКакДвоичныеДанные();
		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла);
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат АдресВоВременномХранилище;
	
КонецФункции

// Процедура - Коллтрекинг mango
// 
Процедура MANGO_Коллтрекинг(Дата) Экспорт
	
	Попытка
		
		Запрос       = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ПодключаемоеОборудование.Параметры КАК Параметры
		|ИЗ
		|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|ГДЕ
		|	ПодключаемоеОборудование.УстройствоИспользуется
		|	И НЕ ПодключаемоеОборудование.ПометкаУдаления
		|	И ПодключаемоеОборудование.ДрайверОборудования.ИмяПредопределенныхДанных = ""ДрайверХеликсMANGO""";
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат;
		КонецЕсли; 
		
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			
			Параметры = Выборка.Параметры.Получить();
			Если Не Параметры.Свойство("ИспользоватьКоллтрекинг") Или Не Параметры.ИспользоватьКоллтрекинг Тогда
				Возврат;
			КонецЕсли; 
			
		КонецЕсли; 
		
		КоллтрекингАдресСервера = СтрЗаменить(Параметры.КоллтрекингАдресСервера, "https://", "");
		КоллтрекингНомерВиджета = Параметры.КоллтрекингНомерВиджета;
		КоллтрекингToken        = Параметры.КоллтрекингToken;
		
		ДатаНачала    = НачалоДня(Дата);
		ДатаОкончания = КонецДня(Дата);
		dateStart  = Формат(ДатаНачала   , "ДФ=yyyy-MM-ddTHH:mmZ");
		dateEnd    = Формат(ДатаОкончания, "ДФ=yyyy-MM-ddTHH:mmZ");

		ЗапросHTTP = "v1/calltracking/"+ КоллтрекингНомерВиджета + "/calls?dateStart=" + dateStart + "&dateEnd=" 
		+  dateEnd + "&access_token=" + КоллтрекингToken;
		
		Соединение = Новый HTTPСоединение(КоллтрекингАдресСервера,,,,,, Новый ЗащищенноеСоединениеOpenSSL);
		
		HTTPЗапрос = Новый HTTPЗапрос(ЗапросHTTP);
		ВозвращаемыйРезультат = Соединение.Получить(HTTPЗапрос);	        
		
		ТекстJSON = ВозвращаемыйРезультат.ПолучитьТелоКакСтроку();	
		Результат = ДекодироватьИзJSON(ТекстJSON);
		
		Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("message") Тогда		
			ЗаписьЖурналаРегистрации("КоллтрекингMango", УровеньЖурналаРегистрации.Ошибка,,, Результат.message);
			Возврат;
		ИначеЕсли ТипЗнч(Результат) <> Тип("Массив") Тогда
			ЗаписьЖурналаРегистрации("КоллтрекингMango", УровеньЖурналаРегистрации.Ошибка,,, "Неверный формат ответа");
			Возврат;
		КонецЕсли;	
		
		Если Результат.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;	
		
		ТаблицаДанных = Новый ТаблицаЗначений;
		ТаблицаДанных.Колонки.Добавить("НомерТелефона");
		ТаблицаДанных.Колонки.Добавить("РекламныйИсточникСтрока");
		
		Для Каждого ДанныеСтруктура Из Результат Цикл
			
			Если ДанныеСтруктура.callType = 2 Тогда  // исходящие
				 Продолжить;
			КонецЕсли;

			РекламныйИсточникСтрока = ДанныеСтруктура.utmSource;
			НомерТелефона           = Число(ДанныеСтруктура.callerNumber);
			НомерТелефона           = Формат(НомерТелефона, "ЧГ=0");
			Если ЗначениеЗаполнено(РекламныйИсточникСтрока) И РекламныйИсточникСтрока <> "(undefined)" Тогда
				
				НоваяСтрока                         = ТаблицаДанных.Добавить();
				НоваяСтрока.НомерТелефона           = НомерТелефона;
				НоваяСтрока.РекламныйИсточникСтрока = РекламныйИсточникСтрока;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтрокаТЧ Из ТаблицаДанных Цикл
			
			Запрос       = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИсторияВызовов.ОборудованиеТелефонии КАК ОборудованиеТелефонии,
			|	ИсторияВызовов.IDЗвонка КАК IDЗвонка,
			|	ИсторияВызовов.Визит КАК Визит
			|ИЗ
			|	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
			|ГДЕ
			|	ИсторияВызовов.НомерТелефона = &НомерТелефона
			|	И ИсторияВызовов.НачалоВызова >= &ДатаНачала
			|	И ИсторияВызовов.НачалоВызова <= &ДатаОкончания
			|	И НЕ ИсторияВызовов.ИсходящийЗвонок";
			
			Запрос.УстановитьПараметр("НомерТелефона", СтрокаТЧ.НомерТелефона);
			Запрос.УстановитьПараметр("ДатаНачала"   , ДатаНачала);
			Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = РегистрыСведений.ИсторияВызовов.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ОборудованиеТелефонии.Установить(Выборка.ОборудованиеТелефонии);
				НаборЗаписей.Отбор.IDЗвонка.Установить(Выборка.IDЗвонка);	
				НаборЗаписей.Прочитать();
				Визит = Неопределено;
				Для Каждого Запись Из НаборЗаписей Цикл
					
					РекламныйИсточник        = ПолучитьРекламныйИсточник(СтрокаТЧ.РекламныйИсточникСтрока);
					Запись.РекламныйИсточник = РекламныйИсточник;
					Визит                    = Запись.Визит;
					
				КонецЦикла;
				НаборЗаписей.Записать();   
				
				Если Не ЗначениеЗаполнено(Визит) Тогда
					Продолжить;
				КонецЕсли;
				
				ВизитОбъект                   = Визит.ПолучитьОбъект();
				ВизитОбъект.РекламныйИсточник = РекламныйИсточник;
				ВизитОбъект.Записать();
			
			КонецЦикла;
			
		КонецЦикла;
			
	Исключение
		
		ЗаписьЖурналаРегистрации("КоллтрекингMango", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

// Функция - Тестирование сервера
// 
// Параметры:
//  ТипыПодключаемогоОборудования	 - 	 - 
//  Сервер							 - 	 - 
//  Порт							 - 	 - 
//  Логин							 - 	 - 
//  Пароль							 - 	 - 
//  ОписаниеОшибки					 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция MANGO_ТестированиеКоллтрекинга(КоллтрекингАдресСервера, КоллтрекингToken, КоллтрекингНомерВиджета, ОписаниеОшибки = "") Экспорт
	
	Попытка
		
		dateStart  = Формат(НачалоДня(ТекущаяДата()), "ДФ=yyyy-MM-ddTHH:mmZ");
		dateEnd    = Формат(КонецДня(ТекущаяДата()), "ДФ=yyyy-MM-ddTHH:mmZ");
		ЗапросHTTP = "v1/calltracking/"+ КоллтрекингНомерВиджета + "/calls?dateStart=" + dateStart + "&dateEnd=" 
		+  dateEnd + "&access_token=" + КоллтрекингToken;
		
		Соединение = Новый HTTPСоединение(КоллтрекингАдресСервера,,,,,, Новый ЗащищенноеСоединениеOpenSSL);
		
		HTTPЗапрос = Новый HTTPЗапрос(ЗапросHTTP);
		Результат = Соединение.Получить(HTTPЗапрос);	        
		
		Если Результат.КодСостояния <> 200 Тогда
			
			ОписаниеОшибки = "Ошибка сервиса коллтрекинг IP-телефонии: " + Результат.КодСостояния;
			ОтветHTTP      = Результат.ПолучитьТелоКакСтроку();
			
			Если ОтветHTTP <> "" Тогда
				ПараметрыJSON  = ДекодироватьИзJSON(ОтветHTTP);
				ОписаниеОшибки = ОписаниеОшибки + " (" + ПараметрыJSON.Message + ")";
			КонецЕсли;
			
			Возврат Ложь;
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки     = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " 
			+ ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Функция - Получить рекламный источник
// 
Функция ПолучитьРекламныйИсточник(РекламныйИсточникСтрока)
	
	РекламныйИсточник = Справочники.РекламныеИсточники.НайтиПоНаименованию(РекламныйИсточникСтрока);
	
	Если Не ЗначениеЗаполнено(РекламныйИсточник) Тогда
		НовыйРекламныйИсточник              = Справочники.РекламныеИсточники.СоздатьЭлемент();
		НовыйРекламныйИсточник.Наименование = РекламныйИсточникСтрока;
		НовыйРекламныйИсточник.Записать();
		РекламныйИсточник = НовыйРекламныйИсточник.Ссылка;
	КонецЕсли;

	Возврат РекламныйИсточник;
	
КонецФункции

#КонецОбласти

#Область _________________________ITOOLABS__________________________

////// / ITOOLABS ////// /

// Функция - Тестирование сервера
// 
// Параметры:
//  ТипыПодключаемогоОборудования	 - 	 - 
//  Сервер							 - 	 - 
//  Порт							 - 	 - 
//  Логин							 - 	 - 
//  Пароль							 - 	 - 
//  ОписаниеОшибки					 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ITOOLABS_ТестированиеСервера(Сервер, Порт, Ключ, ОписаниеОшибки = "") Экспорт	
	 		
	MSXMLЗапрос = "cmd=accounts"
	+ "&token=" + Ключ;
	
	Попытка
		
		СайтАдрес = ПреобразоватьАдресСервера(Сервер);
		
		Если СтрНайти(Сервер, "https://") = 1 Тогда  
			Соединение = Новый HTTPСоединение(СайтАдрес, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		Иначе 
			Соединение = Новый HTTPСоединение(СайтАдрес, 80);
		КонецЕсли;		
		HTTPЗапрос = Новый HTTPЗапрос("/sys/crm_api.wcgp", ПолучитьЗаголовкиPOSTЗапроса());
		HTTPЗапрос.УстановитьТелоИзСтроки(MSXMLЗапрос);
		
		// Отправка POST-запроса и получение ответа
		СтруктураОтвета = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		Если СтруктураОтвета.КодСостояния <> 200 Тогда
			
			ОписаниеОшибки = "Ошибка сервиса IP-телефонии: " + СтруктураОтвета.КодСостояния;
			ОтветHTTP = СтруктураОтвета.ПолучитьТелоКакСтроку();
			
			Если ОтветHTTP <> "" Тогда
				ПараметрыJSON  = ДекодироватьИзJSON(ОтветHTTP);
				ОписаниеОшибки = ОписаниеОшибки + ?(ПараметрыJSON.Свойство("message"), " (" + ПараметрыJSON.message + ")", "");
			КонецЕсли;
			
			Возврат Ложь;
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Функция - событие звонок
// 
// Параметры:
//  ИмяФункции		 - 	 - 
//  ПараметрыJSON	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ITOOLABS_СобытиеЗвонок(ПОIPТелефонии, ПараметрыJSON, ОписаниеОшибки = "") Экспорт
	
	УнифицированнаяСтруктураСобытия 						  = ПолучитьУнифицированнуюСтруктуруСобытия();
	УнифицированнаяСтруктураСобытия.ПОIPТелефонии 			  = ПОIPТелефонии;
	УнифицированнаяСтруктураСобытия.IDЗвонка 				  = ПараметрыJSON.callid;
	УнифицированнаяСтруктураСобытия.ФинализирующееСобытие 	  = Ложь;
	
	УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 		  = ?(ЗначениеЗаполнено(ПараметрыJSON.phone) И ПараметрыJSON.phone <> "null", ПараметрыJSON.phone, Неопределено); 
	УнифицированнаяСтруктураСобытия.НомерТелефонаTo   		  = ?(ПараметрыJSON.Свойство("diversion"), ПараметрыJSON.diversion, Неопределено);
	УнифицированнаяСтруктураСобытия.ВнутреннийНомерСотрудника = ПараметрыJSON.ext;
	УнифицированнаяСтруктураСобытия.НомерКонтрагента 		  = ?(ЗначениеЗаполнено(ПараметрыJSON.phone) И ПараметрыJSON.phone <> "null", ПараметрыJSON.phone, Неопределено); 
	
	IPТелефонияПараметры 									  = ПОIPТелефонии.Параметры.Получить();
	ТелефонныйАппарат 										  = Справочники.ТелефонныеАппараты.ПолучитьТелефонныйАппаратПоНомеру(ПараметрыJSON.ext);
	
	УнифицированнаяСтруктураСобытия.СтруктурнаяЕдиница        = ?(ЗначениеЗаполнено(ТелефонныйАппарат), ТелефонныйАппарат.СтруктурнаяЕдиница, IPТелефонияПараметры.СтруктурнаяЕдиница);

	
	Если ВРег(ПараметрыJSON.type) = "INCOMING" Тогда 
		УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий;		
	ИначеЕсли ВРег(ПараметрыJSON.type) = "OUTGOING" Тогда 
		УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Исходящий;
	КонецЕсли;
	
	Если УнифицированнаяСтруктураСобытия.НаправлениеВызова    = Перечисления.ВариантыНаправленияВызова.Входящий Тогда 
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен = ВРег(ПараметрыJSON.type) = "CANCELLED";
	Иначе 
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен = Ложь;						
	КонецЕсли; 		
		
	Если ВРег(ПараметрыJSON.type) = "INCOMING"
		ИЛИ ВРег(ПараметрыJSON.type) = "OUTGOING" Тогда
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 		   = Перечисления.СтатусыЗвонка.Вызов;							
		УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова = ТекущаяДатаСеанса();
		Возврат СобытиеЗвонокДозвон(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);		
		
	ИначеЕсли ВРег(ПараметрыJSON.type) = "ACCEPTED" Тогда
		
		УнифицированнаяСтруктураСобытия.СтатусЗвонка       = Перечисления.СтатусыЗвонка.Разговор;
		УнифицированнаяСтруктураСобытия.ВремяОтветаНаВызов = ТекущаяДатаСеанса();			
		Возврат СобытиеЗвонокСоединение(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
		
	ИначеЕсли ВРег(ПараметрыJSON.type) = "COMPLETED" Тогда
		
		УнифицированнаяСтруктураСобытия.ЗвонокУспешен 		  = Истина;
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен = Ложь;	
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 		  = Перечисления.СтатусыЗвонка.Завершен;
		УнифицированнаяСтруктураСобытия.ВремяЗавершенияВызова = ТекущаяДатаСеанса();
		// УнифицированнаяСтруктураСобытия.ПринятДругимАбонентомГруппы = 
		Возврат СобытиеЗвонокЗавершен(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
		
	ИначеЕсли ВРег(ПараметрыJSON.type) = "CANCELLED" Тогда
		
		УнифицированнаяСтруктураСобытия.ЗвонокУспешен         = Ложь;
		УнифицированнаяСтруктураСобытия.СтатусЗвонка          = Перечисления.СтатусыЗвонка.Пропущен;
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен = УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий;
		Возврат СобытиеЗвонокЗавершен(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки); 		
		
	Иначе
		ОписаниеОшибки = "Функция не существует или не распознана.'";
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// Функция - событие завершение звонка
// 
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  ПараметрыJSON	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ITOOLABS_СобытиеЗавершениеЗвонка(ПОIPТелефонии, ПараметрыJSON, ОписаниеОшибки = "") Экспорт
	
	УнифицированнаяСтруктураСобытия 							= ПолучитьУнифицированнуюСтруктуруСобытия();
	УнифицированнаяСтруктураСобытия.ПОIPТелефонии 				= ПОIPТелефонии;
	УнифицированнаяСтруктураСобытия.IDЗвонка 					= ПараметрыJSON.callid;
	УнифицированнаяСтруктураСобытия.ФинализирующееСобытие 		= Истина;

	// Определяем направление вызова
	Если ПараметрыJSON.type = "INCOMING" Тогда 
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 		= Перечисления.ВариантыНаправленияВызова.Входящий;
	ИначеЕсли ПараметрыJSON.type = "OUTGOING" Тогда 
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 		= Перечисления.ВариантыНаправленияВызова.Исходящий;
	КонецЕсли;
	
	Если УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий Тогда 
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 	= ПараметрыJSON.type = "CANCELLED";
	Иначе 
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 	= Ложь;						
	КонецЕсли;	
	
	// Определяем результат вызова
	ПризнакЗвонокПропущен 	= Ложь;			
	Если ПараметрыJSON.type = "CANCELLED" Тогда 
		УнифицированнаяСтруктураСобытия.ЗвонокУспешен 			= Ложь;
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 	= УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий;
		УнифицированнаяСтруктураСобытия.СтатусЗвонка			= ?(УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий, Перечисления.СтатусыЗвонка.Пропущен, Перечисления.СтатусыЗвонка.НеДозвон);
	ИначеЕсли ПараметрыJSON.type = "COMPLETED" Тогда 
		УнифицированнаяСтруктураСобытия.ЗвонокУспешен 			= Истина;
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 	= Ложь;		
		УнифицированнаяСтруктураСобытия.СтатусЗвонка			= Перечисления.СтатусыЗвонка.Завершен;		
	КонецЕсли;	
			
	Возврат СобытиеЗвонокЗавершен(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);			
	
КонецФункции

// Функция - событие запись разговора
// 
// Параметры:
//  ИмяФункции		 - 	 - 
//  ПараметрыJSON	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ITOOLABS_СобытиеЗаписьРазговора(ПОIPТелефонии, ПараметрыJSON, ОписаниеОшибки = "") Экспорт
	
	УнифицированнаяСтруктураСобытия 					  = ПолучитьУнифицированнуюСтруктуруСобытия();
	ВремяОтветаНаВызов 									  = ПрочитатьДатуJSON(ПараметрыJSON.start, ФорматДатыJSON.ISO);
	УнифицированнаяСтруктураСобытия.ПОIPТелефонии 		  = ПОIPТелефонии;
	УнифицированнаяСтруктураСобытия.IDЗвонка 			  = ПараметрыJSON.callid;
	УнифицированнаяСтруктураСобытия.СсылкаНаЗаписьЗвонка  = ?(ПараметрыJSON.Свойство("link"), ПараметрыJSON.link, "");
	
	Если ПараметрыJSON.Свойство("status") И НРег(ПараметрыJSON.status) = "missed" Тогда 
		
		Если НРег(ПараметрыJSON.type) = "in" Тогда 
			УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий;		
		Иначе
			УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Исходящий;
		КонецЕсли;
		
		УнифицированнаяСтруктураСобытия.ЗвонокУспешен          = Ложь;
		УнифицированнаяСтруктураСобытия.СтатусЗвонка           = Перечисления.СтатусыЗвонка.Пропущен;
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен  = УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий;
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 	   = ПараметрыJSON.phone; 
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo		   = ПараметрыJSON.diversion;
		УнифицированнаяСтруктураСобытия.НомерКонтрагента	   = ПараметрыJSON.phone;
		УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова = ВремяОтветаНаВызов;
		УнифицированнаяСтруктураСобытия.ФинализирующееСобытие  = Истина
		
	Иначе
		
		УнифицированнаяСтруктураСобытия.ВремяОтветаНаВызов        = ВремяОтветаНаВызов;
		УнифицированнаяСтруктураСобытия.ВремяЗавершенияВызова     = ВремяОтветаНаВызов + ПараметрыJSON.duration;	
		УнифицированнаяСтруктураСобытия.ФинализирующееСобытие     = Ложь;
		
	КонецЕсли;
	
	ДобавитьОбновитьЗвонокВИсторию(ПараметрыJSON, УнифицированнаяСтруктураСобытия);
	
	Возврат Истина;
		
КонецФункции

// Функция - Исходящий звонок осуществить
// 
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  ВнешнийНомерТелефона	 - 	 - 
//  ВнутреннийНомерТелефона	 - 	 - 
//  Контрагент				 - 	 - 
//  Сотрудник				 - 	 - 
//  ОписаниеОшибки			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ITOOLABS_ИсходящийЗвонокОсуществить(ПОIPТелефонии, ВнутреннийНомерТелефона, ВнешнийНомерТелефона, ОписаниеОшибки = "")
		
	IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
	
	Если IPТелефонияПараметры = Неопределено
		ИЛИ ТипЗнч(IPТелефонияПараметры) <> Тип("Структура")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Сервер")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Ключ") Тогда
		
		ОписаниеОшибки = "Ошибка! Необходимо произвести настройки сервера IP-телефонии в подключаемом оборудовании.";
		Возврат Ложь;
	КонецЕсли;
	
	MSXMLЗапрос = "cmd=makeCall"
					+ "&phone="  + ВнешнийНомерТелефона 
					+ "&user="   + ВнутреннийНомерТелефона
					+ "&token="  + IPТелефонияПараметры.Ключ;
					
	Попытка
		
		СайтАдрес = ПреобразоватьАдресСервера(IPТелефонияПараметры.Сервер);
		
		Если СтрНайти(IPТелефонияПараметры.Сервер, "https://") = 1 Тогда  
			Соединение = Новый HTTPСоединение(СайтАдрес, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		Иначе 
			Соединение = Новый HTTPСоединение(СайтАдрес, 80);
		КонецЕсли;
		HTTPЗапрос = Новый HTTPЗапрос("/sys/crm_api.wcgp", ПолучитьЗаголовкиPOSTЗапроса());
		HTTPЗапрос.УстановитьТелоИзСтроки(MSXMLЗапрос);
		
		// Отправка POST-запроса и получение ответа
		СтруктураОтвета = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		Если СтруктураОтвета.КодСостояния <> 200 Тогда
			
			ОписаниеОшибки = "Ошибка сервиса IP-телефонии: " + СтруктураОтвета.КодСостояния;
			ОтветHTTP = СтруктураОтвета.ПолучитьТелоКакСтроку();
			
			Если ОтветHTTP <> "" Тогда
				ПараметрыJSON  = ДекодироватьИзJSON(ОтветHTTP);
				ОписаниеОшибки = ОписаниеОшибки + " (" + ПараметрыJSON.error + ")";
			КонецЕсли;
			
			Возврат Ложь;
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Ложь;
		
	КонецПопытки; 
		
	Возврат Истина;
	
КонецФункции

// Функция - Исходящий звонок осуществить
// 
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  ВнешнийНомерТелефона	 - 	 - 
//  ВнутреннийНомерТелефона	 - 	 - 
//  Контрагент				 - 	 - 
//  Сотрудник				 - 	 - 
//  ОписаниеОшибки			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ITOOLABS_ПереадресацияЗвонка(ПОIPТелефонии, ПараметрыJSON, ОписаниеОшибки = "") Экспорт
		
	IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
	
	Если IPТелефонияПараметры = Неопределено
		ИЛИ ТипЗнч(IPТелефонияПараметры) <> Тип("Структура")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Сервер")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Ключ") Тогда
		
		ОписаниеОшибки = "Ошибка! Необходимо произвести настройки сервера IP-телефонии в подключаемом оборудовании.";
		Возврат Ложь;
	КонецЕсли;
	
	ОбязательныйПараметр = "phone";
	Если Не ПараметрыJSON.Свойство(ОбязательныйПараметр) Тогда				
		ОписаниеОшибки = СтрШаблон(НСтр("ru='Отсутствует обязательный параметр %1.'"), ОбязательныйПараметр);
	КонецЕсли;
	
	// СтруктураЛичныйМенеджер = IPТелефония.ПолучитьЛичногоМенеджераДляПереадресации(ПараметрыJSON.phone, ОписаниеОшибки);
	СтруктураЛичныйМенеджер = Неопределено;
	ЗаписьJSON = Неопределено;
	Если СтруктураЛичныйМенеджер <> Неопределено Тогда
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("contact_name");
		ЗаписьJSON.ЗаписатьЗначение(СтруктураЛичныйМенеджер.Представление);
		
		Если СтруктураЛичныйМенеджер.Свойство("InternalNumberGroup") Тогда
			ЗаписьJSON.ЗаписатьИмяСвойства("responsible");
			ЗаписьJSON.ЗаписатьЗначение(СтруктураЛичныйМенеджер.InternalNumberGroup);
		КонецЕсли;
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		ПараметрыОтвета = ЗаписьJSON.Закрыть();
		
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Если ЗаписьJSON <> Неопределено Тогда
		Ответ.УстановитьТелоИзСтроки(ПараметрыОтвета);
	КонецЕсли;	
	
	Возврат Ответ;
	
КонецФункции

// Функция - ITOOLABS доступные АТС
// 
Функция ITOOLABS_ДоступныеАТС() Экспорт
	
	Ссылки = Новый ТаблицаЗначений;
	Ссылки.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Ссылки.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Ссылки.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("Строка"));
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "МегаФон";
	Ссылка.Представление = "МегаФон";
	Ссылка.Ссылка = "https://vats.megafon.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "VirginConnect";
	Ссылка.Представление = "Virgin Connect";
	Ссылка.Ссылка = "https://www.virginconnect.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Altegro";
	Ссылка.Представление = "Altegro";
	Ссылка.Ссылка = "http://altegrocloud.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "АльянсТелеком";
	Ссылка.Представление = "АльянсТелеком";
	Ссылка.Ссылка = "http://inetvl.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "ВАМтел";
	Ссылка.Представление = "ВАМтел";
	Ссылка.Ссылка = "http://vamtel.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "ВекторТел";
	Ссылка.Представление = "ВекторТел";
	Ссылка.Ссылка = "http://vectortel.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "КорпорацияVoIP";
	Ссылка.Представление = "Корпорация VoIP";
	Ссылка.Ссылка = "http://corpvoip.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "ИнтИнформ";
	Ссылка.Представление = "Инт-Информ";
	Ссылка.Ссылка = "http://intinform.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Интеграл";
	Ссылка.Представление = "Интеграл";
	Ссылка.Ссылка = "http://i-t.spb.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Кловертел";
	Ссылка.Представление = "Кловертел";
	Ссылка.Ссылка = "https://clovertel.pulscen.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Comiten";
	Ссылка.Представление = "Comiten";
	Ссылка.Ссылка = "http://comiten.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "SipVip";
	Ссылка.Представление = "SipVip";
	Ссылка.Ссылка = "https://sipvip.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Комфинанс";
	Ссылка.Представление = "Комфинанс";
	Ссылка.Ссылка = "http://www.comfinance.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "КонтинентКоннект";
	Ссылка.Представление = "Континент Коннект";
	Ссылка.Ссылка = "http://kkont.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "КРОК";
	Ссылка.Представление = "КРОК";
	Ссылка.Ссылка = "http://www.croc.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "КТелеком";
	Ссылка.Представление = "К Телеком";
	Ссылка.Ссылка = "https://ekaterinburg.k-telecom.org/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "МАТРИКСмобайл";
	Ссылка.Представление = "МАТРИКС мобайл";
	Ссылка.Ссылка = "http://matrixmobile.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Миран";
	Ссылка.Представление = "Миран";
	Ссылка.Ссылка = "http://miran.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "МортонТелеком";
	Ссылка.Представление = "Мортон Телеком";
	Ссылка.Ссылка = "http://www.mtel.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "САЛЬВАДОРтелефония";
	Ссылка.Представление = "САЛЬВАДОР телефония";
	Ссылка.Ссылка = "http://sip-melt.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Новотелс";
	Ссылка.Представление = "Новотелс";
	Ссылка.Ссылка = "http://novotels.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "TelefonCo";
	Ссылка.Представление = "TelefonCo";
	Ссылка.Ссылка = "http://telefonco.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Омскиекабельныесети";
	Ссылка.Представление = "Омские кабельные сети";
	Ссылка.Ссылка = "http://www.omkc.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Мегатон";
	Ссылка.Представление = "Мегатон";
	Ссылка.Ссылка = "http://megaton-net.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "CLOUDGATES";
	Ссылка.Представление = "CLOUDGATES";
	Ссылка.Ссылка = "https://cloudgates.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "РЕНЕТКОМ";
	Ссылка.Представление = "РЕНЕТ КОМ";
	Ссылка.Ссылка = "http://renet.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "РУКОМТЕХ";
	Ссылка.Представление = "РУКОМТЕХ";
	Ссылка.Ссылка = "http://www.rucom.tech/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Русскиесистемы";
	Ссылка.Представление = "Русские системы";
	Ссылка.Ссылка = "http://www.ru-sys.com/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "СвязьХолдинг";
	Ссылка.Представление = "Связь-Холдинг";
	Ссылка.Ссылка = "http://govorit.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "АОНорильскТелеком";
	Ссылка.Представление = "АО ""Норильск-Телеком""";
	Ссылка.Ссылка = "http://norcom.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "SMARTCARD";
	Ссылка.Представление = "SMARTCARD";
	Ссылка.Ссылка = "http://smcard.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "ТВИНГОтелеком";
	Ссылка.Представление = "ТВИНГО телеком";
	Ссылка.Ссылка = "http://tvingo.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Tekmi";
	Ссылка.Представление = "Tekmi";
	Ссылка.Ссылка = "http://tekmi.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "EVO";
	Ссылка.Представление = "EVO";
	Ссылка.Ссылка = "https://www.evo73.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Телемир";
	Ссылка.Представление = "Телемир";
	Ссылка.Ссылка = "http://telemir.net/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Телетай";
	Ссылка.Представление = "Телетай";
	Ссылка.Ссылка = "http://www.teletie.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "TelefonN";
	Ссылка.Представление = "TelefonN";
	Ссылка.Ссылка = "http://telefonn.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "OpenSpeak";
	Ссылка.Представление = "OpenSpeak";
	Ссылка.Ссылка = "http://openspeak.kz/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Ультрамарин";
	Ссылка.Представление = "Ультрамарин";
	Ссылка.Ссылка = "http://www.ul.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Щелковоnet";
	Ссылка.Представление = "Щелково•net";
	Ссылка.Ссылка = "http://www.schelkovo-net.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Эконотел";
	Ссылка.Представление = "Эконотел";
	Ссылка.Ссылка = "http://econotel.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "ЮГТЕЛЕКОМ";
	Ссылка.Представление = "ЮГ-ТЕЛЕКОМ";
	Ссылка.Ссылка = "http://www.southtel.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "DreamNet";
	Ссылка.Представление = "DreamNet";
	Ссылка.Ссылка = "https://dreamnet.su/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Easytel";
	Ссылка.Представление = "Easytel";
	Ссылка.Ссылка = "http://easytel.top/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Finenumbers";
	Ссылка.Представление = "Finenumbers";
	Ссылка.Ссылка = "http://finenumbers.com/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "НовыеТелефонныеСистемы";
	Ссылка.Представление = "Новые Телефонные Системы";
	Ссылка.Ссылка = "http://www.newtehno.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "PowerTelecom";
	Ссылка.Представление = "Power Telecom";
	Ссылка.Ссылка = "http://powertelecom.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Spacetel";
	Ссылка.Представление = "Spacetel";
	Ссылка.Ссылка = "http://spacetel.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "COMLINK";
	Ссылка.Представление = "COMLINK";
	Ссылка.Ссылка = "http://comlink.su/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Экомобайл";
	Ссылка.Представление = "Экомобайл";
	Ссылка.Ссылка = "http://www.ekomobile.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "TASHIRTELECOM";
	Ссылка.Представление = "TASHIR TELECOM";
	Ссылка.Ссылка = "https://tashirtelecom.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "TELEPRO";
	Ссылка.Представление = "TELEPRO";
	Ссылка.Ссылка = "http://www.telepro.pro/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Авантел";
	Ссылка.Представление = "Авантел";
	Ссылка.Ссылка = "http://avantel.ru/services/telephony/";
		
	Возврат Ссылки;
	
КонецФункции

#КонецОбласти

#Область _________________________ROSTELECOM__________________________

////// / ROSTELECOM ////// /

// Функция - Тестирование сервера
// 
// Параметры:
//  ТипыПодключаемогоОборудования	 - 	 - 
//  Сервер							 - 	 - 
//  Порт							 - 	 - 
//  Логин							 - 	 - 
//  Пароль							 - 	 - 
//  ОписаниеОшибки					 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ROSTELECOM_ТестированиеСервера(Код, Ключ, ТестовыйСервер, ОписаниеОшибки = "") Экспорт	
	
	Попытка
		
		Соединение = Новый HTTPСоединение(ТестовыйСервер); //"api-test.itapi.ru"
		
		ТелоЗапросаJSON = "{""request_number"": ""+74951234567"", ""from_sipuri"": ""test_user@cloudpbx.rt.ru""}"; // Тестовое тело, иногда без тела возвращает ошибку валидации.
		СтрокаХешированиеДанных = SHA256(Код + ТелоЗапросаJSON + Ключ);
		
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("Content-Type" , "application/json");
		ЗаголовкиHTTP.Вставить("X-Client-ID"  , Код);
		ЗаголовкиHTTP.Вставить("X-Client-Sign", СтрокаХешированиеДанных);
		
		HTTPЗапрос = Новый HTTPЗапрос("/call_back", ЗаголовкиHTTP);
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаJSON);
		
		// Отправка POST-запроса и получение ответа
		СтруктураОтвета = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		Если СтруктураОтвета.КодСостояния <> 200 Тогда
			
			ОписаниеОшибки = "Ошибка сервиса IP-телефонии: " + СтруктураОтвета.КодСостояния;
			ОтветHTTP = СтруктураОтвета.ПолучитьТелоКакСтроку();
			
			Если ОтветHTTP <> "" Тогда // Немного странно, ОтветHTTP может прилететь либо в json, либо строка.				
				
				Попытка
					ПараметрыJSON  = ДекодироватьИзJSON(ОтветHTTP);
					ОписаниеОшибки = ОписаниеОшибки + ?(ПараметрыJSON <> Неопределено И ПараметрыJSON.Свойство("resultMessage"), " (" + ПараметрыJSON.resultMessage + ")", "");
				Исключение
					ОписаниеОшибки = ОписаниеОшибки + " (" + ОтветHTTP + ")";
				КонецПопытки
				
			КонецЕсли;
			
			Возврат Ложь;
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Функция - событие звонок
// 
// Параметры:
//  ИмяФункции		 - 	 - 
//  ПараметрыJSON	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ROSTELECOM_СобытиеЗвонок(ПОIPТелефонии, ПараметрыJSON, IPТелефонияПараметры, ОписаниеОшибки = "") Экспорт
	
	УнифицированнаяСтруктураСобытия 						  = ПолучитьУнифицированнуюСтруктуруСобытия();
	УнифицированнаяСтруктураСобытия.ПОIPТелефонии 			  = ПОIPТелефонии;
	УнифицированнаяСтруктураСобытия.IDЗвонка 				  = ПараметрыJSON.session_id;
	УнифицированнаяСтруктураСобытия.ФинализирующееСобытие 	  = Ложь;
	
	Если НРег(ПараметрыJSON.type)      = "incoming" Тогда 
		УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий;				
	ИначеЕсли НРег(ПараметрыJSON.type) = "outbound" Тогда 		
		УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Исходящий;		
	ИначеЕсли НРег(ПараметрыJSON.type) = "internal" Тогда 		
		УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Внутренний;		
	КонецЕсли;

	Если УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий Тогда		
		
		УнифицированнаяСтруктураСобытия.ВнутреннийНомерСотрудника = ?(ПараметрыJSON.Свойство("request_pin"), Строка(ПараметрыJSON.request_pin), ""); // PIN вызываемого сотрудника. для вх и внутренних	
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom		  = СтрЗаменить(СтрРазделить(ПараметрыJSON.from_number, "@")[0], "sip:", "");  // номер вызывающего абонента для исх. Кому я звоню.
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo   		  = СтрЗаменить(СтрРазделить(ПараметрыJSON.request_number, "@")[0], "sip:", "");
		УнифицированнаяСтруктураСобытия.НомерКонтрагента		  = УнифицированнаяСтруктураСобытия.НомерТелефонаFrom;
		
	ИначеЕсли УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Исходящий Тогда
		
		УнифицированнаяСтруктураСобытия.ВнутреннийНомерСотрудника = ?(ПараметрыJSON.Свойство("from_pin"), Строка(ПараметрыJSON.from_pin), ""); // PIN сотрудника, который вызывает.
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 		  = УнифицированнаяСтруктураСобытия.ВнутреннийНомерСотрудника; 		
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo  		  = СтрЗаменить(СтрРазделить(ПараметрыJSON.request_number, "@")[0], "sip:", ""); // номер вызываемого абонента для исх. Кому я звоню.
	ИначеЕсли УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Внутренний Тогда	
		
		УнифицированнаяСтруктураСобытия.ВнутреннийНомерСотрудника = ?(ПараметрыJSON.Свойство("request_pin"), Строка(ПараметрыJSON.request_pin), "");
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom		  = ?(ПараметрыJSON.Свойство("from_pin"), Строка(ПараметрыJSON.from_pin), "");
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo   		  = УнифицированнаяСтруктураСобытия.ВнутреннийНомерСотрудника;	
		
	КонецЕсли;
	
	УнифицированнаяСтруктураСобытия.НомерТелефонаFrom = ?(СтрДлина(УнифицированнаяСтруктураСобытия.НомерТелефонаFrom) > 10 И Лев(УнифицированнаяСтруктураСобытия.НомерТелефонаFrom, 1) = "8", "7" + Сред(УнифицированнаяСтруктураСобытия.НомерТелефонаFrom,2), УнифицированнаяСтруктураСобытия.НомерТелефонаFrom);
	УнифицированнаяСтруктураСобытия.НомерТелефонаTo   = ?(СтрДлина(УнифицированнаяСтруктураСобытия.НомерТелефонаTo) > 10 И Лев(УнифицированнаяСтруктураСобытия.НомерТелефонаTo, 1) = "8", "7" + Сред(УнифицированнаяСтруктураСобытия.НомерТелефонаTo,2), УнифицированнаяСтруктураСобытия.НомерТелефонаTo);
	
	ТелефонныйАппарат 										  = Справочники.ТелефонныеАппараты.ПолучитьТелефонныйАппаратПоНомеру(?(ПараметрыJSON.Свойство("request_pin"), Строка(ПараметрыJSON.request_pin), Неопределено));	
	УнифицированнаяСтруктураСобытия.СтруктурнаяЕдиница        = ?(ЗначениеЗаполнено(ТелефонныйАппарат), ТелефонныйАппарат.СтруктурнаяЕдиница, IPТелефонияПараметры.СтруктурнаяЕдиница);
										
	Если НРег(ПараметрыJSON.state) = "new" ИЛИ НРег(ПараметрыJSON.state) = "calling" Тогда
		
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 		   = Перечисления.СтатусыЗвонка.Вызов;							
		УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова = ПривестиСтрокуВДатаCoMagic(ПараметрыJSON.timestamp);
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен  = Ложь;
		Возврат СобытиеЗвонокДозвон(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);		
		
	ИначеЕсли НРег(ПараметрыJSON.state) = "connected" Тогда
		
		УнифицированнаяСтруктураСобытия.СтатусЗвонка          = Перечисления.СтатусыЗвонка.Разговор;
		УнифицированнаяСтруктураСобытия.ВремяОтветаНаВызов    = ПривестиСтрокуВДатаCoMagic(ПараметрыJSON.timestamp);			
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен = Ложь;
		Возврат СобытиеЗвонокСоединение(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
		
	ИначеЕсли НРег(ПараметрыJSON.state) = "end" Тогда
		
		УнифицированнаяСтруктураСобытия.ЗвонокУспешен 		  = Истина;
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен = Ложь;	
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 		  = Перечисления.СтатусыЗвонка.Завершен;
		УнифицированнаяСтруктураСобытия.ВремяЗавершенияВызова = ПривестиСтрокуВДатаCoMagic(ПараметрыJSON.timestamp);
		Возврат СобытиеЗвонокЗавершен(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
		
	// ИначеЕсли НРег(ПараметрыJSON.state) = "disconnected" Тогда
	// 	
	// 	Если УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Исходящий Тогда
	// 		ОписаниеОшибки = "Данный запрос не используется";
	// 		Возврат Ложь;
	// 	КонецЕсли;
	// 	
	// 	УнифицированнаяСтруктураСобытия.ЗвонокУспешен         = Ложь;
	// 	УнифицированнаяСтруктураСобытия.СтатусЗвонка          = Перечисления.СтатусыЗвонка.Пропущен;
	// 	УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен = УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий;
	// 	Возврат СобытиеЗвонокЗавершен(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки); 		
		
	Иначе
		ОписаниеОшибки = "Функция не существует или не распознана.";
		Возврат Истина;		
	КонецЕсли;
	
КонецФункции

// Функция - событие завершение звонка
// 
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  ПараметрыJSON	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ROSTELECOM_СобытиеЗавершениеЗвонка(ПОIPТелефонии, ПараметрыJSON, ОписаниеОшибки = "") Экспорт
	
	УнифицированнаяСтруктураСобытия 							= ПолучитьУнифицированнуюСтруктуруСобытия();
	УнифицированнаяСтруктураСобытия.ПОIPТелефонии 				= ПОIPТелефонии;
	УнифицированнаяСтруктураСобытия.IDЗвонка 					= ПараметрыJSON.callid;
	УнифицированнаяСтруктураСобытия.ФинализирующееСобытие 		= Истина;

	// Определяем направление вызова
	Если ПараметрыJSON.type = "INCOMING" Тогда 
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 		= Перечисления.ВариантыНаправленияВызова.Входящий;
	ИначеЕсли ПараметрыJSON.type = "OUTGOING" Тогда 
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 		= Перечисления.ВариантыНаправленияВызова.Исходящий;
	КонецЕсли;
	
	Если УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий Тогда 
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 	= ПараметрыJSON.type = "CANCELLED";
	Иначе 
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 	= Ложь;						
	КонецЕсли;	
	
	// Определяем результат вызова
	ПризнакЗвонокПропущен 	= Ложь;			
	Если ПараметрыJSON.type = "CANCELLED" Тогда 
		УнифицированнаяСтруктураСобытия.ЗвонокУспешен 			= Ложь;
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 	= УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий;
		УнифицированнаяСтруктураСобытия.СтатусЗвонка			= ?(УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий, Перечисления.СтатусыЗвонка.Пропущен, Перечисления.СтатусыЗвонка.НеДозвон);
	ИначеЕсли ПараметрыJSON.type = "COMPLETED" Тогда 
		УнифицированнаяСтруктураСобытия.ЗвонокУспешен 			= Истина;
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 	= Ложь;		
		УнифицированнаяСтруктураСобытия.СтатусЗвонка			= Перечисления.СтатусыЗвонка.Завершен;		
	КонецЕсли;	
			
	Возврат СобытиеЗвонокЗавершен(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);			
	
КонецФункции

// Функция - событие запись разговора
// 
// Параметры:
//  ИмяФункции		 - 	 - 
//  ПараметрыJSON	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ROSTELECOM_СобытиеЗаписьРазговора(ПОIPТелефонии, ПараметрыJSON, IPТелефонияПараметры, ОписаниеОшибки = "") Экспорт
		
	Если НЕ IPТелефонияПараметры.Свойство("Сервер") ИЛИ НЕ IPТелефонияПараметры.Свойство("Ключ") Тогда		
		ОписаниеОшибки = "Ошибка! Необходимо произвести настройки сервера IP-телефонии в подключаемом оборудовании.";
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("session_id", ПараметрыJSON.session_id);
	                                                                                                                             
	СтрокаТелаJSON = КодироватьВJSON(СтруктураПараметров);
	
	Попытка
		
		СайтАдрес = ПреобразоватьАдресСервера(IPТелефонияПараметры.Сервер);
		
		Если СтрНайти(IPТелефонияПараметры.Сервер, "https://") = 1 Тогда  
			Соединение = Новый HTTPСоединение(СайтАдрес, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		Иначе 
			Соединение = Новый HTTPСоединение(СайтАдрес, 80);
		КонецЕсли;
		
		СтрокаХешированиеДанных = SHA256(IPТелефонияПараметры.Код + СтрокаТелаJSON + IPТелефонияПараметры.Ключ); 
		
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("Content-Type" , "application/json");
		ЗаголовкиHTTP.Вставить("X-Client-ID"  , IPТелефонияПараметры.Код);
		ЗаголовкиHTTP.Вставить("X-Client-Sign", СтрокаХешированиеДанных);
		
		HTTPЗапрос = Новый HTTPЗапрос("/get_record", ЗаголовкиHTTP);
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаТелаJSON);
		
		// Отправка POST-запроса и получение ответа
		СтруктураОтвета = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		ОтветHTTP = СтруктураОтвета.ПолучитьТелоКакСтроку();
		ДанныеJSON  = ДекодироватьИзJSON(ОтветHTTP);
		
		Если СтруктураОтвета.КодСостояния = 200 И ДанныеJSON <> Неопределено И ДанныеJSON.result = "0" Тогда
			
			УнифицированнаяСтруктураСобытия 					  = ПолучитьУнифицированнуюСтруктуруСобытия();
			УнифицированнаяСтруктураСобытия.ПОIPТелефонии 		  = ПОIPТелефонии;
			УнифицированнаяСтруктураСобытия.IDЗвонка 			  = ПараметрыJSON.session_id;
			УнифицированнаяСтруктураСобытия.СсылкаНаЗаписьЗвонка  = ДанныеJSON.url;
			УнифицированнаяСтруктураСобытия.ФинализирующееСобытие = Ложь;
			ДобавитьОбновитьЗвонокВИсторию(ПараметрыJSON, УнифицированнаяСтруктураСобытия);			
			Возврат Истина;
			
		Иначе			
			
			ОписаниеОшибки = "Ошибка сервиса IP-телефонии: " + СтруктураОтвета.КодСостояния;
			ОписаниеОшибки = ОписаниеОшибки + ?(ДанныеJSON <> Неопределено И ДанныеJSON.Свойство("resultMessage"), " (" + ДанныеJSON.resultMessage + ")", "");
			//ЗаписьЖурналаРегистрации("IP телефония", УровеньЖурналаРегистрации.Ошибка,,,ОтветHTTP);
			Возврат Ложь;
			
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		ЗаписьЖурналаРегистрации("IP телефония", УровеньЖурналаРегистрации.Ошибка,,,ОтветHTTP);
		Возврат Ложь;
		
	КонецПопытки; 
				
КонецФункции

// Функция - Исходящий звонок осуществить
// 
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  ВнешнийНомерТелефона	 - 	 - 
//  ВнутреннийНомерТелефона	 - 	 - 
//  Контрагент				 - 	 - 
//  Сотрудник				 - 	 - 
//  ОписаниеОшибки			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ROSTELECOM_ИсходящийЗвонокОсуществить(ПОIPТелефонии, ВнутреннийНомерТелефона, ВнешнийНомерТелефона, ОписаниеОшибки = "")
		
	IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
	
	Если IPТелефонияПараметры = Неопределено
		ИЛИ ТипЗнч(IPТелефонияПараметры) <> Тип("Структура")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Сервер")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Ключ") Тогда
		
		ОписаниеОшибки = "Ошибка! Необходимо произвести настройки сервера IP-телефонии в подключаемом оборудовании.";
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("request_number", ВнешнийНомерТелефона);
	СтруктураПараметров.Вставить("from_pin"      , ВнутреннийНомерТелефона);
	
	СтрокаТелаJSON = КодироватьВJSON(СтруктураПараметров);
	
	Попытка
		
		СайтАдрес = ПреобразоватьАдресСервера(IPТелефонияПараметры.Сервер);
		
		Если СтрНайти(IPТелефонияПараметры.Сервер, "https://") = 1 Тогда  
			Соединение = Новый HTTPСоединение(СайтАдрес, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		Иначе 
			Соединение = Новый HTTPСоединение(СайтАдрес, 80);
		КонецЕсли;
		
		СтрокаХешированиеДанных = SHA256(IPТелефонияПараметры.Код + СтрокаТелаJSON + IPТелефонияПараметры.Ключ); 
		
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("Content-Type" , "application/json");
		ЗаголовкиHTTP.Вставить("X-Client-ID"  , IPТелефонияПараметры.Код);
		ЗаголовкиHTTP.Вставить("X-Client-Sign", СтрокаХешированиеДанных);
		
		HTTPЗапрос = Новый HTTPЗапрос("/call_back", ЗаголовкиHTTP);
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаТелаJSON);
		
		// Отправка POST-запроса и получение ответа
		СтруктураОтвета = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		ОтветHTTP = СтруктураОтвета.ПолучитьТелоКакСтроку();
		ДанныеJSON  = ДекодироватьИзJSON(ОтветHTTP);
		
		Если СтруктураОтвета.КодСостояния = 200 И ДанныеJSON <> Неопределено И ДанныеJSON.result = "0" Тогда			
			Возврат Истина;			
		Иначе					
			ОписаниеОшибки = "Ошибка сервиса IP-телефонии: " + СтруктураОтвета.КодСостояния;
			ОписаниеОшибки = ОписаниеОшибки + ?(ДанныеJSON <> Неопределено И ДанныеJSON.Свойство("resultMessage"), " (" + ДанныеJSON.resultMessage + ")", "");
			Возврат Ложь;			
		КонецЕсли;
		
	Исключение		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Ложь;		
	КонецПопытки;
	
КонецФункции

// Функция - ROSTELECOM переадресация звонка
// 
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  ПараметрыJSON	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ROSTELECOM_ПереадресацияЗвонка(ПОIPТелефонии, ПараметрыJSON, ОписаниеОшибки = "") Экспорт
		
	IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
	
	Если IPТелефонияПараметры = Неопределено
		ИЛИ ТипЗнч(IPТелефонияПараметры) <> Тип("Структура")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Сервер")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Ключ") Тогда
		
		ОписаниеОшибки = "Ошибка! Необходимо произвести настройки сервера IP-телефонии в подключаемом оборудовании.";
		Возврат Ложь;
	КонецЕсли;
	
	ОбязательныйПараметр = "phone";
	Если Не ПараметрыJSON.Свойство(ОбязательныйПараметр) Тогда				
		ОписаниеОшибки = СтрШаблон(НСтр("ru='Отсутствует обязательный параметр %1.'"), ОбязательныйПараметр);
	КонецЕсли;
	
	// СтруктураЛичныйМенеджер = IPТелефония.ПолучитьЛичногоМенеджераДляПереадресации(ПараметрыJSON.phone, ОписаниеОшибки);
	СтруктураЛичныйМенеджер = Неопределено;
	ЗаписьJSON = Неопределено;
	Если СтруктураЛичныйМенеджер <> Неопределено Тогда
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("contact_name");
		ЗаписьJSON.ЗаписатьЗначение(СтруктураЛичныйМенеджер.Представление);
		
		Если СтруктураЛичныйМенеджер.Свойство("InternalNumberGroup") Тогда
			ЗаписьJSON.ЗаписатьИмяСвойства("responsible");
			ЗаписьJSON.ЗаписатьЗначение(СтруктураЛичныйМенеджер.InternalNumberGroup);
		КонецЕсли;
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		ПараметрыОтвета = ЗаписьJSON.Закрыть();
		
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Если ЗаписьJSON <> Неопределено Тогда
		Ответ.УстановитьТелоИзСтроки(ПараметрыОтвета);
	КонецЕсли;	
	
	Возврат Ответ;
	
КонецФункции

// Процедура - ROSTELECOM получить URLЗаписей по регламенту
// 
Процедура ROSTELECOM_ПолучитьURLЗаписейИЗаписатьВРегистр(ПОIPТелефонии = Неопределено, КоличествоЗаписей) Экспорт
	
	Если ПОIPТелефонии = Неопределено Тогда
		ПОIPТелефонии = ОпределитьПодключаемоеОборудование(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсROSTELECOM);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПОIPТелефонии) Тогда
		Возврат;
	КонецЕсли;
	
	IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
	
	Если IPТелефонияПараметры = Неопределено 
		ИЛИ ТипЗнч(IPТелефонияПараметры) <> Тип("Структура") 
		ИЛИ Не ЗначениеЗаполнено(IPТелефонияПараметры.Сервер) 
		ИЛИ Не ЗначениеЗаполнено(IPТелефонияПараметры.Код) 
		ИЛИ Не ЗначениеЗаполнено(IPТелефонияПараметры.Ключ) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КоличествоЗаписей) Тогда
		КоличествоЗаписей = 1;
	КонецЕсли;
	
	РезультатЗапроса = ROSTELECOM_ПолучитьТаблицуЗвонков(КоличествоЗаписей);
	
	Для Каждого Звонок Из РезультатЗапроса Цикл
		
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("session_id", Звонок.IDЗвонка);
		
		URLЗаписи = ROSTELECOM_HTTPЗапросНаПолучениеURLЗаписи(Звонок.IDЗвонка,,, IPТелефонияПараметры);
		
		Если ЗначениеЗаполнено(URLЗаписи) Тогда	
			УнифицированнаяСтруктураСобытия 					  = ПолучитьУнифицированнуюСтруктуруСобытия();
			УнифицированнаяСтруктураСобытия.ПОIPТелефонии 		  = ПОIPТелефонии;
			УнифицированнаяСтруктураСобытия.IDЗвонка 			  = Звонок.IDЗвонка;							
			УнифицированнаяСтруктураСобытия.СсылкаНаЗаписьЗвонка  = URLЗаписи;
			УнифицированнаяСтруктураСобытия.ФинализирующееСобытие = Ложь;
			ДобавитьОбновитьЗвонокВИсторию(, УнифицированнаяСтруктураСобытия);							
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Получить актуальный URLЗаписи ROSTELECOM
//
// Параметры:
//  АктуальныйURLЗаписи	 - 	 - 
//
Функция ПолучитьАктуальныйURLЗаписиROSTELECOMСервер(ИсходныйURLЗаписи, IDЗвонка, ВнешнийIPКлиента) Экспорт
	
	ПОIPТелефонии = IPТелефония.ОпределитьПодключаемоеОборудование(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсROSTELECOM);			
	URLЗаписи 	  = IPТелефония.ROSTELECOM_HTTPЗапросНаПолучениеURLЗаписи(IDЗвонка, ВнешнийIPКлиента, ПОIPТелефонии);
	
	Если ЗначениеЗаполнено(URLЗаписи) Тогда
		Возврат URLЗаписи;
	Иначе
		Возврат ИсходныйURLЗаписи;
	КонецЕсли;
	
КонецФункции

// Функция - ROSTELECOM HTTPЗапрос на получение URLЗаписи
//
// Параметры:
//  IDЗвонка			 - 	 - 
//  IPАдрес				 - 	 - 
//  IPТелефонияПараметры - 	 - 
//  ПОIPТелефонии		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ROSTELECOM_HTTPЗапросНаПолучениеURLЗаписи(IDЗвонка, IPАдрес = Неопределено, ПОIPТелефонии = Неопределено, IPТелефонияПараметры = Неопределено) Экспорт
	
	Если IPТелефонияПараметры = Неопределено И ПОIPТелефонии = Неопределено Тогда
		ПОIPТелефонии = ОпределитьПодключаемоеОборудование(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсROSTELECOM);
	КонецЕсли;
	
	Если IPТелефонияПараметры = Неопределено И ПОIPТелефонии <> Неопределено Тогда	
		IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();		
	КонецЕсли;
	
	Если IPТелефонияПараметры = Неопределено ИЛИ ТипЗнч(IPТелефонияПараметры) <> Тип("Структура") ИЛИ Не ЗначениеЗаполнено(IPТелефонияПараметры.Сервер) 
		ИЛИ Не ЗначениеЗаполнено(IPТелефонияПараметры.Код) ИЛИ Не ЗначениеЗаполнено(IPТелефонияПараметры.Ключ) Тогда
		
		Возврат Неопределено;		
	КонецЕсли;
		
	СайтАдрес = ПреобразоватьАдресСервера(IPТелефонияПараметры.Сервер);
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("session_id", IDЗвонка);
	
	Если IPАдрес <> Неопределено Тогда
		СтруктураПараметров.Вставить("ip_adress", IPАдрес);
	КонецЕсли;
	
	СтрокаТелаJSON = КодироватьВJSON(СтруктураПараметров);
	
	Попытка
		
		Если СтрНайти(IPТелефонияПараметры.Сервер, "https://") = 1 Тогда  
			Соединение = Новый HTTPСоединение(СайтАдрес, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		Иначе 
			Соединение = Новый HTTPСоединение(СайтАдрес, 80);
		КонецЕсли;
		
		СтрокаХешированиеДанных = SHA256(IPТелефонияПараметры.Код + СтрокаТелаJSON + IPТелефонияПараметры.Ключ); 
		
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("Content-Type" , "application/json");
		ЗаголовкиHTTP.Вставить("X-Client-ID"  , IPТелефонияПараметры.Код);
		ЗаголовкиHTTP.Вставить("X-Client-Sign", СтрокаХешированиеДанных);
		
		HTTPЗапрос = Новый HTTPЗапрос("/get_record", ЗаголовкиHTTP);
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаТелаJSON);
		
		HTTPОтвет   = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТелоЗапроса = HTTPОтвет.ПолучитьТелоКакСтроку();
		
		Если Не (HTTPОтвет.КодСостояния = 200 И ЗначениеЗаполнено(ТелоЗапроса)) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ДанныеJSON = ДекодироватьИзJSON(ТелоЗапроса);
		
		Если Не (ЗначениеЗаполнено(ДанныеJSON) И ДанныеJSON.result = "0") Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Возврат ДанныеJSON.url;
		
	Исключение
		
		Возврат Неопределено;
		
	КонецПопытки
	
КонецФункции

// Функция - Получить таблицу звонков ROSTELECOM
//
// Параметры:
//  КоличествоЗаписей	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ROSTELECOM_ПолучитьТаблицуЗвонков(КоличествоВыбираемыхЗаписей)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсторияВызовов.IDЗвонка КАК IDЗвонка
	|ИЗ
	|	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
	|ГДЕ
	|	ИсторияВызовов.IDЗвонка <> """"
	|	И ИсторияВызовов.URLЗаписи = """"
	|	И ИсторияВызовов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗвонка.Завершен)
	|	И ИсторияВызовов.ОкончаниеЗвонка >= ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, -1)
	|	И ИсторияВызовов.ОкончаниеЗвонка <= ДОБАВИТЬКДАТЕ(&ТекущаяДата, МИНУТА, -1)");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ РАЗРЕШЕННЫЕ", СтрШаблон("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ %1", КоличествоВыбираемыхЗаписей));
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция - Получить таблицу звонков ROSTELECOM
//
// Параметры:
//  КоличествоЗаписей	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЭтоОбработчикДрайвераПереданнойПОIPТелефонии(ПОIPТелефонии, ОбработчикДрайвераПеречисление) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПодключаемоеОборудование.ДрайверОборудования.ОбработчикДрайвера КАК ОбработчикДрайвера
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.Ссылка = &ПОIPТелефонии");
		
	Запрос.УстановитьПараметр("ПОIPТелефонии", ПОIPТелефонии);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ОбработчикДрайвера = ОбработчикДрайвераПеречисление;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Процедура - ROSTELECOM получитет рекламную компанию 
// 
Процедура ROSTELECOM_ДополнитьЗвонокРекламнойКомпанией(ПОIPТелефонии, ПараметрыJSON) Экспорт
	
	Если ПОIPТелефонии = Неопределено Тогда
		ПОIPТелефонии = ОпределитьПодключаемоеОборудование(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсROSTELECOM);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПОIPТелефонии) Тогда
		Возврат;
	КонецЕсли;
	
	IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
	
	Если IPТелефонияПараметры = Неопределено 
		ИЛИ ТипЗнч(IPТелефонияПараметры) <> Тип("Структура") 
		ИЛИ Не ЗначениеЗаполнено(IPТелефонияПараметры.Сервер) 
		ИЛИ Не ЗначениеЗаполнено(IPТелефонияПараметры.Код) 
		ИЛИ Не ЗначениеЗаполнено(IPТелефонияПараметры.Ключ) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ПараметрыJSON.Свойство("advertising_campaign") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИсторияВызовов.ОборудованиеТелефонии КАК ОборудованиеТелефонии,
		|	ИсторияВызовов.IDЗвонка КАК IDЗвонка,
		|	ИсторияВызовов.НомерТелефона КАК НомерТелефона,
		|	ИсторияВызовов.НачалоВызова КАК НачалоВызова
		|ИЗ
		|	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
		|ГДЕ
		|	ИсторияВызовов.НомерТелефона = &НомерТелефона
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИсторияВызовов.НачалоВызова УБЫВ";
		
		Запрос.УстановитьПараметр("НомерТелефона", "+" + ПараметрыJSON.contact_info.contact_phone_number);
		
		РезультатаЗапроса = Запрос.Выполнить().Выбрать();	
		
		Если РезультатаЗапроса.Следующий() Тогда 
			
			НаборЗаписей = РегистрыСведений.ИсторияВызовов.СоздатьНаборЗаписей(); 
			
			НаборЗаписей.Отбор.ОборудованиеТелефонии.Установить(ПОIPТелефонии);
			НаборЗаписей.Отбор.IDЗвонка.Установить(РезультатаЗапроса.IDЗвонка);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() > 0 Тогда 
				Запись = НаборЗаписей[0];
				Запись.КоллтрекингНомер = ПараметрыJSON.call_session_id;
				
				РекламнаяПлощадка = Справочники.КаналыПривлечения.НайтиПоНаименованию(ПараметрыJSON.advertising_campaign);
				Если НЕ ЗначениеЗаполнено(РекламнаяПлощадка) Тогда
					РекламнаяПлощадка = Справочники.КаналыПривлечения.СоздатьЭлемент();
					РекламнаяПлощадка.Наименование = ПараметрыJSON.advertising_campaign;
					РекламнаяПлощадка.Записать();
					РекламнаяПлощадка = РекламнаяПлощадка.Ссылка;
				КонецЕсли;
				
				Запись.ИсточникЗвонка = РекламнаяПлощадка;
				
				НаборЗаписей.Записать(Истина);
				
			КонецЕсли;

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область _________________________Callmart__________________________

////// / Callmart ////// /

// Функция - Тестирование сервера
// 
// Параметры:
//  ТипыПодключаемогоОборудования	 - 	 - 
//  Сервер							 - 	 - 
//  Порт							 - 	 - 
//  Логин							 - 	 - 
//  Пароль							 - 	 - 
//  ОписаниеОшибки					 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция Callmart_ТестированиеСервера(Сервер, Порт, Ключ, ОписаниеОшибки = "") Экспорт	
	 		
	MSXMLЗапрос = "cmd=accounts"
	+ "&token=" + Ключ;
	
	Попытка
		
		СайтАдрес = ПреобразоватьАдресСервера(Сервер);
		
		Если СтрНайти(Сервер, "https://") = 1 Тогда  
			Соединение = Новый HTTPСоединение(СайтАдрес, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		Иначе 
			Соединение = Новый HTTPСоединение(СайтАдрес, 80);
		КонецЕсли;		
		HTTPЗапрос = Новый HTTPЗапрос("/sys/crm_api.wcgp", ПолучитьЗаголовкиPOSTЗапроса());
		HTTPЗапрос.УстановитьТелоИзСтроки(MSXMLЗапрос);
		
		// Отправка POST-запроса и получение ответа
		СтруктураОтвета = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		Если СтруктураОтвета.КодСостояния <> 200 Тогда
			
			ОписаниеОшибки = "Ошибка сервиса IP-телефонии: " + СтруктураОтвета.КодСостояния;
			ОтветHTTP = СтруктураОтвета.ПолучитьТелоКакСтроку();
			
			Если ОтветHTTP <> "" Тогда
				ПараметрыJSON  = ДекодироватьИзJSON(ОтветHTTP);
				ОписаниеОшибки = ОписаниеОшибки + " (" + ПараметрыJSON.error + ")";
			КонецЕсли;
			
			Возврат Ложь;
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Функция - событие звонок
// 
// Параметры:
//  ИмяФункции		 - 	 - 
//  ПараметрыJSON	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция Callmart_СобытиеЗвонок(ПОIPТелефонии, ПараметрыJSON, ОписаниеОшибки = "") Экспорт
	
	УнифицированнаяСтруктураСобытия 						  = ПолучитьУнифицированнуюСтруктуруСобытия();
	УнифицированнаяСтруктураСобытия.ПОIPТелефонии 			  = ПОIPТелефонии;
	УнифицированнаяСтруктураСобытия.IDЗвонка 				  = Строка(ПараметрыJSON.id);
	УнифицированнаяСтруктураСобытия.ФинализирующееСобытие 	  = Ложь;  	
	УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 		  = ПараметрыJSON.phoneFrom; 
	УнифицированнаяСтруктураСобытия.НомерТелефонаTo   		  = ПараметрыJSON.phoneTo;
	
	Если ПараметрыJSON.phoneType = "in" Тогда 
		УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий;
		УнифицированнаяСтруктураСобытия.НомерКонтрагента 		  = ПараметрыJSON.phoneFrom;
		УнифицированнаяСтруктураСобытия.ВнутреннийНомерСотрудника = ПараметрыJSON.phoneTo;		
	ИначеЕсли ПараметрыJSON.phoneType = "out" Тогда 
		УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Исходящий;
		УнифицированнаяСтруктураСобытия.НомерКонтрагента 		  = ПараметрыJSON.phoneTo;
		УнифицированнаяСтруктураСобытия.ВнутреннийНомерСотрудника = ПараметрыJSON.phoneFrom;
	КонецЕсли;
	
	IPТелефонияПараметры 									  = ПОIPТелефонии.Параметры.Получить();
	ТелефонныйАппарат 										  = Справочники.ТелефонныеАппараты.ПолучитьТелефонныйАппаратПоНомеру(УнифицированнаяСтруктураСобытия.ВнутреннийНомерСотрудника);
	
	УнифицированнаяСтруктураСобытия.СтруктурнаяЕдиница        = ?(ЗначениеЗаполнено(ТелефонныйАппарат), ТелефонныйАппарат.СтруктурнаяЕдиница, IPТелефонияПараметры.СтруктурнаяЕдиница);

	Если УнифицированнаяСтруктураСобытия.НаправлениеВызова    = Перечисления.ВариантыНаправленияВызова.Входящий Тогда 
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен = ПараметрыJSON.phoneStatus = "busy";
	Иначе 
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен = Ложь;						
	КонецЕсли; 		
		
	Если ПараметрыJSON.phoneStatus = "calling"
		ИЛИ ПараметрыJSON.phoneStatus = "initialized" Тогда
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 		   = Перечисления.СтатусыЗвонка.Вызов;							
		УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова = ТекущаяДатаСеанса(); // ПараметрыJSON.dateCreated;
		Возврат СобытиеЗвонокДозвон(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);		
		
	ИначеЕсли ПараметрыJSON.phoneStatus = "connected" Тогда
		
		УнифицированнаяСтруктураСобытия.СтатусЗвонка       = Перечисления.СтатусыЗвонка.Разговор;
		УнифицированнаяСтруктураСобытия.ВремяОтветаНаВызов = ТекущаяДатаСеанса(); // ПараметрыJSON.lastUpdated;			
		Возврат СобытиеЗвонокСоединение(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
		
	ИначеЕсли ПараметрыJSON.phoneStatus = "answered" Тогда
		
		УнифицированнаяСтруктураСобытия.ЗвонокУспешен 		  = Истина;
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен = Ложь;	
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 		  = Перечисления.СтатусыЗвонка.Завершен;
		УнифицированнаяСтруктураСобытия.ВремяЗавершенияВызова = ТекущаяДатаСеанса(); // ПараметрыJSON.lastUpdated;
		УнифицированнаяСтруктураСобытия.СсылкаНаЗаписьЗвонка  = ?(ПараметрыJSON.Свойство("recordUrl"), ПараметрыJSON.recordUrl, "");
		Возврат СобытиеЗвонокЗавершен(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
		
	ИначеЕсли ПараметрыJSON.phoneStatus = "busy" Тогда
		
		УнифицированнаяСтруктураСобытия.ЗвонокУспешен         = Ложь;
		УнифицированнаяСтруктураСобытия.СтатусЗвонка          = Перечисления.СтатусыЗвонка.Пропущен;
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен = УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий;
		Возврат СобытиеЗвонокЗавершен(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки); 		
		
	Иначе
		ОписаниеОшибки = "Функция не существует или не распознана.'";
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область __________________________BINOTEL__________________________

////// / BINOTEL ////// /

// Функция - Тестирование сервера
// 
// Параметры:
//  ТипыПодключаемогоОборудования	 - 	 - 
//  Сервер							 - 	 - 
//  Порт							 - 	 - 
//  Логин							 - 	 - 
//  Пароль							 - 	 - 
//  ОписаниеОшибки					 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция BINOTEL_ТестированиеСервера(Сервер, Порт, key, secret, ОписаниеОшибки = "") Экспорт
	
	ТаблицаПараметров = Новый ТаблицаЗначений();
	ТаблицаПараметров.Колонки.Добавить("Ключ");
    ТаблицаПараметров.Колонки.Добавить("Значение");
	
	НоваяСтрока = ТаблицаПараметров.Добавить();
	НоваяСтрока.Ключ = "timestamp";
	НоваяСтрока.значение = 1390528860;
	
    СтрокаJSON = BINOTEL_ГенерацияSignature(key, secret, ТаблицаПараметров);
	
	Попытка
		
		СайтАдрес = ПреобразоватьАдресСервера(Сервер);
		
		Соединение = Новый HTTPСоединение(СайтАдрес, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());		
		HTTPЗапрос = Новый HTTPЗапрос("/api/3.0/stats/list-of-calls-per-day.json", ПолучитьЗаголовкиPOSTЗапроса());
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		// Отправка POST-запроса и получение ответа
		СтруктураОтвета = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		Если СтруктураОтвета.КодСостояния <> 200 Тогда
			
			ОписаниеОшибки = "Ошибка сервиса IP-телефонии: " + СтруктураОтвета.КодСостояния;
			ОтветHTTP = СтруктураОтвета.ПолучитьТелоКакСтроку();
			
			Если ОтветHTTP <> "" Тогда				
				ОписаниеОшибки = ОписаниеОшибки + " (" + ОтветHTTP + ")";
			КонецЕсли;
			
			Возврат Ложь;
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Функция - BINOTEL событие звонок
// 
// Параметры:
//  ИмяФункции		 - 	 - 
//  ПараметрыJSON	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция BINOTEL_СобытиеЗвонок(ПОIPТелефонии, ПараметрыJSON, ОписаниеОшибки = "") Экспорт
	
	requestType   = ?(ПараметрыJSON.Свойство("requestType"), ПараметрыJSON.requestType, Неопределено);	
	ПараметрыJSON = ?(ПараметрыJSON.Свойство("callDetails"), ПараметрыJSON.callDetails, ПараметрыJSON);
	
	УнифицированнаяСтруктураСобытия 					  = ПолучитьУнифицированнуюСтруктуруСобытия();
	УнифицированнаяСтруктураСобытия.ПОIPТелефонии 		  = ПОIPТелефонии;
	УнифицированнаяСтруктураСобытия.IDЗвонка 			  = ?(ПараметрыJSON.Свойство("generalCallID"), ПараметрыJSON.generalCallID, Неопределено);
	УнифицированнаяСтруктураСобытия.ФинализирующееСобытие = Ложь;
		
	callType = ?(ПараметрыJSON.Свойство("callType"), ПараметрыJSON.callType, Неопределено);
	Если callType = "0" Тогда 
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo   = ?(ПараметрыJSON.Свойство("internalNumber"), ПараметрыJSON.internalNumber, Неопределено);
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom = ?(ПараметрыJSON.Свойство("externalNumber"), ПараметрыJSON.externalNumber, Неопределено);
		УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий;
	ИначеЕсли callType = "1" Тогда 
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom = ?(ПараметрыJSON.Свойство("internalNumber"), ПараметрыJSON.internalNumber, Неопределено);
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo   = ?(ПараметрыJSON.Свойство("externalNumber"), ПараметрыJSON.externalNumber, Неопределено);
		УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Исходящий;
	КонецЕсли;
	
	disposition = ?(ПараметрыJSON.Свойство("disposition"), ПараметрыJSON.disposition, Неопределено); 
	
	Если УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий Тогда  			
		
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 	= (disposition = "CONGESTION" 
																	ИЛИ disposition = "CHANUNAVAIL"
																	ИЛИ disposition = "BUSY"
																	ИЛИ disposition = "NOANSWER"
																	ИЛИ disposition = "CANCEL");
	Иначе 
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 	= Ложь;						
	КонецЕсли; 
		
	    startTime = ?(ПараметрыJSON.Свойство("startTime"), ПараметрыJSON.startTime, 0);
		waitsec   = ?(ПараметрыJSON.Свойство("waitsec"), ПараметрыJSON.waitsec, 0);
	    billsec   = ?(ПараметрыJSON.Свойство("billsec"), ПараметрыJSON.billsec, 0);
		
	Если requestType = "receivedTheCall" Тогда // receivedTheCall
		
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 			= Перечисления.СтатусыЗвонка.Вызов;							
		УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова 	= ТекущаяДатаСеанса();
		Возврат СобытиеЗвонокДозвон(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);		
		
	ИначеЕсли requestType = "answeredTheCall" Тогда // answeredTheCall
		
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 				= Перечисления.СтатусыЗвонка.Разговор;
		УнифицированнаяСтруктураСобытия.ВремяОтветаНаВызов 			= ТекущаяДатаСеанса();			
		Возврат СобытиеЗвонокСоединение(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
		
	ИначеЕсли requestType = "apiCallCompleted" Тогда // apiCallCompleted
		
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 	       = ?(УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий И УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен, Перечисления.СтатусыЗвонка.Пропущен, Перечисления.СтатусыЗвонка.Завершен); 		
		УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова = МестноеВремя(Дата(1970, 01, 01) + startTime, ПолучитьЧасовойПоясИнформационнойБазы());
		УнифицированнаяСтруктураСобытия.ВремяОтветаНаВызов 	   = ?(УнифицированнаяСтруктураСобытия.СтатусЗвонка = Перечисления.СтатусыЗвонка.Пропущен, Неопределено, МестноеВремя(Дата(1970, 01, 01) + startTime + waitsec, ПолучитьЧасовойПоясИнформационнойБазы()));			
		УнифицированнаяСтруктураСобытия.ВремяЗавершенияВызова  = МестноеВремя(Дата(1970, 01, 01) + startTime + waitsec + billsec, ПолучитьЧасовойПоясИнформационнойБазы());
		// УнифицированнаяСтруктураСобытия.ПринятДругимАбонентомГруппы = УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий И ПараметрыJSON.Свойство("disconnect_reason") И СтрЗаменить(ПараметрыJSON.Disconnect_Reason," ","") = 1100;
		Возврат СобытиеЗвонокЗавершен(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);  
		
	Иначе		
		ОписаниеОшибки = "Функция не существует или не распознана.'";
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// Функция - BINOTEL событие звонок
// 
// Параметры:
//  ИмяФункции		 - 	 - 
//  ПараметрыJSON	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция BINOTEL_СобытиеЗаписьРазговора(ПОIPТелефонии, ПараметрыJSON, ОписаниеОшибки = "") Экспорт
	
	Результат = Истина;
	ФайлСсылка = Неопределено;
	
	IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
	
	Если IPТелефонияПараметры = Неопределено 
		ИЛИ ТипЗнч(IPТелефонияПараметры) <> Тип("Структура")
		ИЛИ IPТелефонияПараметры.Свойство("Сервер") = Ложь 
		ИЛИ IPТелефонияПараметры.Свойство("Пароль") = Ложь 
		ИЛИ IPТелефонияПараметры.Свойство("Ключ") = Ложь Тогда
		
		ОписаниеОшибки = "Ошибка! Необходимо произвести настройки сервера IP-телефонии в подключаемом оборудовании.";
		Возврат Ложь;
		
	КонецЕсли;
	
	ТаблицаПараметров = Новый ТаблицаЗначений();
	ТаблицаПараметров.Колонки.Добавить("Ключ");
	ТаблицаПараметров.Колонки.Добавить("Значение");
	
	НоваяСтрока = ТаблицаПараметров.Добавить();
	НоваяСтрока.Ключ = "generalCallID";
	НоваяСтрока.значение = ПараметрыJSON.generalCallID;
	
	СтрокаJSON = BINOTEL_ГенерацияSignature(IPТелефонияПараметры.Ключ, IPТелефонияПараметры.Пароль, ТаблицаПараметров);
	
	Попытка
		
		Сервер    = IPТелефонияПараметры.Сервер;
		СайтАдрес = ПреобразоватьАдресСервера(Сервер);
		
		Соединение = Новый HTTPСоединение(СайтАдрес, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());		
		HTTPЗапрос = Новый HTTPЗапрос("/api/3.0/stats/call-record.json", ПолучитьЗаголовкиPOSTЗапроса());
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		// Отправка POST-запроса и получение ответа
		СтруктураОтвета = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		Если СтруктураОтвета.КодСостояния <> 200 Тогда
			
			ОписаниеОшибки = "Ошибка сервиса IP-телефонии: " + СтруктураОтвета.КодСостояния;
			ОтветHTTP = СтруктураОтвета.ПолучитьТелоКакСтроку();
			
			Если ОтветHTTP <> "" Тогда				
				ОписаниеОшибки = ОписаниеОшибки + " (" + ОтветHTTP + ")";
			КонецЕсли;
			
			Возврат Ложь;
			
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Ложь;
		
	КонецПопытки;	               
	
	Если СтруктураОтвета.КодСостояния = 200 Тогда 
		
		ОтветHTTP = РаскодироватьСтроку(СтруктураОтвета.ПолучитьТелоКакСтроку(), СпособКодированияСтроки.КодировкаURL);	
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ОтветHTTP);
		ПараметрыОтветаJSON = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		ФайлСсылка = ?(ПараметрыОтветаJSON.Свойство("url"), ПараметрыОтветаJSON.url, Неопределено);		
		
	Иначе 
		Возврат Неопределено;
	КонецЕсли;	
	
	УнифицированнаяСтруктураСобытия 							= ПолучитьУнифицированнуюСтруктуруСобытия();
	УнифицированнаяСтруктураСобытия.ПОIPТелефонии 				= ПОIPТелефонии;
	УнифицированнаяСтруктураСобытия.IDЗвонка 					= ПараметрыJSON.generalCallID;
	УнифицированнаяСтруктураСобытия.СсылкаНаЗаписьЗвонка 		= ФайлСсылка;
	УнифицированнаяСтруктураСобытия.ФинализирующееСобытие 		= Ложь;
	
	ДобавитьОбновитьЗвонокВИсторию(ПараметрыJSON, УнифицированнаяСтруктураСобытия);
	
	Возврат Результат;
	
КонецФункции

// Функция - Исходящий звонок осуществить
// 
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  ВнешнийНомерТелефона	 - 	 - 
//  ВнутреннийНомерТелефона	 - 	 - 
//  Контрагент				 - 	 - 
//  Сотрудник				 - 	 - 
//  ОписаниеОшибки			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция BINOTEL_ИсходящийЗвонокОсуществить(ПОIPТелефонии, ВнутреннийНомерТелефона, ВнешнийНомерТелефона, ОписаниеОшибки = "")
		
	IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
	
	Если IPТелефонияПараметры = Неопределено
		ИЛИ ТипЗнч(IPТелефонияПараметры) <> Тип("Структура")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Сервер")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Пароль")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Ключ") Тогда
		
		ОписаниеОшибки = НСтр("ru= 'Ошибка! Необходимо произвести настройки сервера IP-телефонии в подключаемом оборудовании.';en= 'Error! It is necessary to configure the IP-telephony server in the connected equipment.'");
		Возврат Ложь;
		
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("externalNumber"	, ВнешнийНомерТелефона);
	СтруктураПараметров.Вставить("internalNumber"	, ВнутреннийНомерТелефона);
	СтруктураПараметров.Вставить("key"				, IPТелефонияПараметры.Ключ);
	СтруктураПараметров.Вставить("secret"			, IPТелефонияПараметры.Пароль);
	
	СтрокаJSON = КодироватьВJSON(СтруктураПараметров);
	
	Попытка
		
		Соединение = Новый HTTPСоединение("api.binotel.com", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		
		HTTPЗапрос = Новый HTTPЗапрос("/api/4.0/calls/internal-number-to-external-number.json", ПолучитьЗаголовкиPOSTЗапроса());
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		// Отправка POST-запроса и получение ответа
		СтруктураОтвета = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ОтветHTTP 		= СтруктураОтвета.ПолучитьТелоКакСтроку();
		
		Если СтруктураОтвета.КодСостояния <> 200 ИЛИ СтруктураОтвета.КодСостояния = 200 И СтрНайти(ОтветHTTP, """status"":""error""") <> 0 Тогда
			
			ОписаниеОшибки = НСтр("ru= 'Ошибка сервиса IP-телефонии: ';en= 'IP-telephony service error: '") + СтруктураОтвета.КодСостояния;
			
			Если ОтветHTTP <> "" Тогда
				ОписаниеОшибки = ОписаниеОшибки + " : " + ОтветHTTP;
			КонецЕсли;
			
			Возврат Ложь;
			
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Функция - Тестирование сервера
// 
// Параметры:
//  ТипыПодключаемогоОборудования	 - 	 - 
//  Сервер							 - 	 - 
//  Порт							 - 	 - 
//  Логин							 - 	 - 
//  Пароль							 - 	 - 
//  ОписаниеОшибки					 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция BINOTEL_ПолучениеФайлаЗаписиРазговора(ПОIPТелефонии, IDЗвонка, ОписаниеОшибки = "", СтруктураПереадресации = Неопределено) Экспорт
	
	АдресВоВременномХранилище = "";
	
	IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
	
	Если IPТелефонияПараметры = Неопределено 
		ИЛИ ТипЗнч(IPТелефонияПараметры) <> Тип("Структура")
		ИЛИ IPТелефонияПараметры.Свойство("Сервер") = Ложь 
		ИЛИ IPТелефонияПараметры.Свойство("Пароль") = Ложь 
		ИЛИ IPТелефонияПараметры.Свойство("Ключ") = Ложь Тогда
		
		ОписаниеОшибки = "Ошибка! Необходимо произвести настройки сервера IP-телефонии в подключаемом оборудовании.";
		Возврат Ложь;
		
	КонецЕсли;
	
	ТаблицаПараметров = Новый ТаблицаЗначений();
	ТаблицаПараметров.Колонки.Добавить("Ключ");
	ТаблицаПараметров.Колонки.Добавить("Значение");
	
	НоваяСтрока = ТаблицаПараметров.Добавить();
	НоваяСтрока.Ключ = "generalCallID";
	НоваяСтрока.значение = IDЗвонка;
	
	СтрокаJSON = BINOTEL_ГенерацияSignature(IPТелефонияПараметры.Ключ, IPТелефонияПараметры.Пароль, ТаблицаПараметров);
	
	Попытка
		
		Сервер    = IPТелефонияПараметры.Сервер;
		СайтАдрес = ПреобразоватьАдресСервера(Сервер);
		
		Соединение = Новый HTTPСоединение(СайтАдрес, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());		
		HTTPЗапрос = Новый HTTPЗапрос("/api/3.0/stats/call-record.json", ПолучитьЗаголовкиPOSTЗапроса());
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		// Отправка POST-запроса и получение ответа
		СтруктураОтвета = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		Если СтруктураОтвета.КодСостояния <> 200 Тогда
			
			ОписаниеОшибки = "Ошибка сервиса IP-телефонии: " + СтруктураОтвета.КодСостояния;
			ОтветHTTP = СтруктураОтвета.ПолучитьТелоКакСтроку();
			
			Если ОтветHTTP <> "" Тогда				
				ОписаниеОшибки = ОписаниеОшибки + " (" + ОтветHTTP + ")";
			КонецЕсли;
			
			Возврат Ложь;
			
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Ложь;
		
	КонецПопытки;	               
	
	Если СтруктураОтвета.КодСостояния = 200 Тогда 
		ДвоичныеДанныеФайла = СтруктураОтвета.ПолучитьТелоКакДвоичныеДанные();
		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла);
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат АдресВоВременномХранилище;
	
КонецФункции

// Функция - BINOTEL генерация signature
// 
Функция BINOTEL_ГенерацияSignature(key, secret, ТаблицаПараметров) Экспорт 
		
	СтрокаJSON = BINOTEL_ТаблицаПараметровВJSON(ТаблицаПараметров);
	
	signature = BINOTEL_ПолучитьMD5(secret + СтрокаJSON);
	
	НоваяСтрока = ТаблицаПараметров.Добавить();
	НоваяСтрока.Ключ = "signature";
	НоваяСтрока.значение = signature;
	
	НоваяСтрока = ТаблицаПараметров.Добавить();
	НоваяСтрока.Ключ = "key";
	НоваяСтрока.значение = key;
	
	Возврат BINOTEL_ТаблицаПараметровВJSON(ТаблицаПараметров); 
	
КонецФункции
 
// Функция - BINOTEL таблица параметров в JSON
// 
Функция BINOTEL_ТаблицаПараметровВJSON(ТаблицаПараметров)
		
	ТаблицаПараметров.Сортировать("Ключ");
	СтруктураПараметров = Новый Структура();
	
	Для Каждого СтрокаТЗ Из ТаблицаПараметров Цикл
		СтруктураПараметров.Вставить(СтрокаТЗ.Ключ, СтрокаТЗ.Значение);
	КонецЦикла;   
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);	
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи); 
	ЗаписатьJSON(ЗаписьJSON, СтруктураПараметров); 
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

// Функция - BINOTEL получить m d5
// 
Функция BINOTEL_ПолучитьMD5(Текст) Экспорт
	
	ОбъектХеш = Новый ХешированиеДанных(ХешФункция.MD5);
	ОбъектХеш.Добавить(Текст);  	
	Возврат НРег(СтрЗаменить(ОбъектХеш.ХешСумма, " ", "")); 
	
КонецФункции

#КонецОбласти

#Область __________________________CoMagic__________________________

////// / CoMagic ////// /

// Функция - Тестирование сервера
// 
// Параметры:
//  ТипыПодключаемогоОборудования	 - 	 - 
//  Сервер							 - 	 - 
//  Порт							 - 	 - 
//  Логин							 - 	 - 
//  Пароль							 - 	 - 
//  ОписаниеОшибки					 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция CoMagic_ТестированиеСервера(Сервер, Порт, Логин, КлючПродукта, ОписаниеОшибки = "") Экспорт

	СтруктураПараметров = Новый Структура("id, method, jsonrpc, params", "null", "list.calls", "2.0", Новый Структура());
	СтруктураПараметров.params.Вставить("access_token", КлючПродукта);
		
	JSONЗапрос = КодироватьВJSON(СтруктураПараметров, Ложь); 
	
	ПОПЫТКА
		
		СерверАдрес = ПреобразоватьАдресСервера(Сервер);
	
		// Создаем прокси для обращения к внешнему веб-сервису, передаем в функцию URI пространства имен, имя сервиса и порта.
		// SSL = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows(), Новый СертификатыУдостоверяющихЦентровWindows());
		SSL = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);
		HTTPСоединение = Новый HTTPСоединение(СерверАдрес, , , , , , SSL);
		
		// Создаем и устанавливаем данные в HTTP запрос
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("Content-Type", "application/json; charset=UTF-8");
		ЗаголовкиHTTP.Вставить("Content-Charset", "utf-8");
		
		// Формируем HTTP запрос
		HTTPЗапрос = Новый HTTPЗапрос("/v4.0", ЗаголовкиHTTP);	
		HTTPЗапрос.УстановитьТелоИзСтроки(JSONЗапрос);
		
		// Ответ от сервера получим в возвращаемом значении типа HTTPОтвет
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			ОписаниеОшибки = НСтр("ru= 'Ошибка ';en= 'Error '") + HTTPОтвет.КодСостояния;
			Возврат Ложь;
		КонецЕсли;
				
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Ложь;
		
	КонецПопытки;
		
	Возврат Истина;
	
КонецФункции

// Функция - CoMagic событие звонок
// 
// Параметры:
//  ИмяФункции		 - 	 - 
//  ПараметрыJSON	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция CoMagic_СобытиеЗвонок(ПОIPТелефонии, ПараметрыJSON, ОписаниеОшибки = "") Экспорт
	
	УнифицированнаяСтруктураСобытия 							= ПолучитьУнифицированнуюСтруктуруСобытия();
	УнифицированнаяСтруктураСобытия.ПОIPТелефонии 				= ПОIPТелефонии;
	УнифицированнаяСтруктураСобытия.ФинализирующееСобытие 		= Ложь;
	
	УнифицированнаяСтруктураСобытия.НаправлениеВызова 			= ?(ПараметрыJSON.Свойство("direction") И ПараметрыJSON.direction = "out"
									ИЛИ (ПараметрыJSON.Свойство("call_info") И ПараметрыJSON.call_info.Свойство("direction") И ПараметрыJSON.call_info.direction = "out")
							ИЛИ ПараметрыJSON.Method = "AppearedOut", Перечисления.ВариантыНаправленияВызова.Исходящий, Перечисления.ВариантыНаправленияВызова.Входящий);
							
	Если УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий Тогда 
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 	= ПараметрыJSON.Свойство("call_info") И ПараметрыJSON.call_info.Свойство("talk_time_duration") И ПараметрыJSON.call_info.talk_time_duration = 0;
	Иначе 
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 	= Ложь;						
	КонецЕсли;
		
	Если УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Исходящий Тогда 
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 			= ?(ПараметрыJSON.employee_info.Свойство("employee_phone_number"), СокрЛП(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(Строка(ПараметрыJSON.employee_info.employee_phone_number)))), Неопределено);
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo   			= СокрЛП(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(Строка(ПараметрыJSON.contact_info.contact_phone_number))));
		УнифицированнаяСтруктураСобытия.ВнутреннийНомерСотрудника 	= УнифицированнаяСтруктураСобытия.НомерТелефонаFrom;
		УнифицированнаяСтруктураСобытия.НомерКонтрагента 			= УнифицированнаяСтруктураСобытия.НомерТелефонаTo;		
	Иначе 
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 			= СокрЛП(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(Строка(ПараметрыJSON.contact_info.contact_phone_number))));
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo   			= ?(ПараметрыJSON.employee_info.Свойство("employee_phone_number"), СокрЛП(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(СокрЛП(Строка(ПараметрыJSON.employee_info.employee_phone_number)))), Неопределено);
		УнифицированнаяСтруктураСобытия.ВнутреннийНомерСотрудника 	= УнифицированнаяСтруктураСобытия.НомерТелефонаTo;		
		УнифицированнаяСтруктураСобытия.НомерКонтрагента 			= УнифицированнаяСтруктураСобытия.НомерТелефонаFrom;		
	КонецЕсли;	
	
	Если ПараметрыJSON.Method = "Appeared" Тогда
		УнифицированнаяСтруктураСобытия.IDЗвонка 				= Формат(ПараметрыJSON.call_session_id, "ЧРД=; ЧРГ=; ЧН=0; ЧГ=");		
		// УнифицированнаяСтруктураСобытия.НаправлениеВызова 		= Перечисления.ВариантыНаправленияВызова.Входящий;
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 			= Перечисления.СтатусыЗвонка.Вызов;		
		ВремяПоступленияВызова                                  = ПривестиСтрокуВДатаCoMagic(ПараметрыJSON.notification_time);
		УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова 	= ?(ЗначениеЗаполнено(ВремяПоступленияВызова), ВремяПоступленияВызова, ТекущаяДатаСеанса());
		
		Возврат СобытиеЗвонокДозвон(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);		
		
	ИначеЕсли ПараметрыJSON.Method = "AppearedOut" Тогда
		УнифицированнаяСтруктураСобытия.IDЗвонка 				= Формат(ПараметрыJSON.call_session_id, "ЧРД=; ЧРГ=; ЧН=0; ЧГ=");		
		// УнифицированнаяСтруктураСобытия.НаправлениеВызова 		= Перечисления.ВариантыНаправленияВызова.Исходящий;						
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 			= Перечисления.СтатусыЗвонка.Вызов;
		ВремяПоступленияВызова                                  = ПривестиСтрокуВДатаCoMagic(ПараметрыJSON.notification_time);
		УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова 	= ?(ЗначениеЗаполнено(ВремяПоступленияВызова), ВремяПоступленияВызова, ТекущаяДатаСеанса());
		
		Возврат СобытиеЗвонокДозвон(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);		
		
	ИначеЕсли ПараметрыJSON.Method = "Connected" Тогда
		УнифицированнаяСтруктураСобытия.IDЗвонка 				= Формат(ПараметрыJSON.call_session_id, "ЧРД=; ЧРГ=; ЧН=0; ЧГ=");				
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 			= Перечисления.СтатусыЗвонка.Разговор; 		
		ВремяОтветаНаВызов                                      = ПривестиСтрокуВДатаCoMagic(ПараметрыJSON.notification_time);
		УнифицированнаяСтруктураСобытия.ВремяОтветаНаВызов 	    = ?(ЗначениеЗаполнено(ВремяОтветаНаВызов), ВремяОтветаНаВызов, ТекущаяДатаСеанса());  		
		УнифицированнаяСтруктураСобытия.РекламныйИсточник 		= ?(ПараметрыJSON.Свойство("campaign_name") И ЗначениеЗаполнено(ПараметрыJSON.campaign_name), ПолучитьСоздатьРекламныйИсточник(ПараметрыJSON.campaign_name), Неопределено);
		
		Возврат СобытиеЗвонокСоединение(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);		
		
	ИначеЕсли ПараметрыJSON.Method = "Disconnected" Тогда
		УнифицированнаяСтруктураСобытия.IDЗвонка 					= Формат(ПараметрыJSON.call_info.call_session_id, "ЧРД=; ЧРГ=; ЧН=0; ЧГ=");				
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 				= ?(УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий И УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен, Перечисления.СтатусыЗвонка.Пропущен, Перечисления.СтатусыЗвонка.Завершен);
		ВремяЗавершенияВызова                                       = ПривестиСтрокуВДатаCoMagic(ПараметрыJSON.notification_time);
		УнифицированнаяСтруктураСобытия.ВремяЗавершенияВызова 	    = ?(ЗначениеЗаполнено(ВремяЗавершенияВызова), ВремяЗавершенияВызова, ТекущаяДатаСеанса());  		
		УнифицированнаяСтруктураСобытия.ПринятДругимАбонентомГруппы = Ложь;
		
		Возврат СобытиеЗвонокЗавершен(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);		
		
	ИначеЕсли ПараметрыJSON.Method = "RecordingFanal" Тогда
		УнифицированнаяСтруктураСобытия.IDЗвонка 				= Формат(ПараметрыJSON.call_session_id, "ЧРД=; ЧРГ=; ЧН=0; ЧГ=");				
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 		= Неопределено;
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo   		= Неопределено;
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 		= Неопределено;
		УнифицированнаяСтруктураСобытия.СсылкаНаЗаписьЗвонка 	= ?(ТипЗнч(ПараметрыJSON.call_record_file_info.file_link) = Тип("Массив") И ПараметрыJSON.call_record_file_info.file_link.Количество() > 0, ПараметрыJSON.call_record_file_info.file_link[0], ПараметрыJSON.call_record_file_info.file_link);
		
		Возврат ДобавитьОбновитьЗвонокВИсторию(ПараметрыJSON, УнифицированнаяСтруктураСобытия);
						
	Иначе
		ОписаниеОшибки = НСтр("ru= 'Функция не существует или не распознана.';en= 'The function does not exist or is not recognized.'");
		Возврат Ложь;
	
	КонецЕсли; 
	
КонецФункции

// Функция - Исходящий звонок осуществить
// 
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  ВнешнийНомерТелефона	 - 	 - 
//  ВнутреннийНомерТелефона	 - 	 - 
//  Контрагент				 - 	 - 
//  Сотрудник				 - 	 - 
//  ОписаниеОшибки			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция CoMagic_ИсходящийЗвонокОсуществить(ПОIPТелефонии, ВнутреннийНомерТелефона, ВнешнийНомерТелефона, ОписаниеОшибки = "")
		
	IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
	Если IPТелефонияПараметры = Неопределено ИЛИ ТипЗнч(IPТелефонияПараметры) <> Тип("Структура")
			ИЛИ IPТелефонияПараметры.Свойство("Сервер") = Ложь ИЛИ IPТелефонияПараметры.Свойство("Логин") = Ложь ИЛИ IPТелефонияПараметры.Свойство("Ключ") = Ложь Тогда
		ОписаниеОшибки = НСтр("ru= 'Ошибка! Необходимо произвести настройки сервера IP-телефонии в подключаемом оборудовании.';en= 'Error! It is necessary to configure the IP-telephony server in the connected equipment.'");
		Возврат Ложь;
	КонецЕсли;
	
	ВнутреннийНомерТелефонаСсылка = Справочники.ТелефонныеАппараты.НайтиПоРеквизиту("ВнутреннийНомер", ВнутреннийНомерТелефона);
	Если НЕ (ЗначениеЗаполнено(ВнутреннийНомерТелефонаСсылка.Родитель) И ЗначениеЗаполнено(ВнутреннийНомерТелефонаСсылка.Родитель.ВнутреннийНомер)) Тогда
		ОписаниеОшибки = НСтр("ru= 'Ошибка! телефонный номер обязательно должен быть в группе с указанным номером (Виртуальный номер, арендуемый клиентом).';en= 'Error! the phone number must be in the group with the specified number (Virtual number rented by the client).'");
		Возврат Ложь;		
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("id, method, jsonrpc, params", "null", "start.simple_call", "2.0", Новый Структура());
	СтруктураПараметров.params.Вставить("access_token", 		IPТелефонияПараметры.Ключ);
	СтруктураПараметров.params.Вставить("direction", 			"out");
	СтруктураПараметров.params.Вставить("first_call", 			"operator");
	СтруктураПараметров.params.Вставить("switch_at_once", 		Истина);
	СтруктураПараметров.params.Вставить("early_switching", 		Истина);
	СтруктураПараметров.params.Вставить("virtual_phone_number", ВнутреннийНомерТелефонаСсылка.Родитель.ВнутреннийНомер);
	СтруктураПараметров.params.Вставить("contact", 				ВнешнийНомерТелефона);
	СтруктураПараметров.params.Вставить("operator",				ВнутреннийНомерТелефона);
	
	JSONЗапрос = КодироватьВJSON(СтруктураПараметров, Ложь);
	
	Попытка
		
		СерверАдрес = ПреобразоватьАдресСервера(IPТелефонияПараметры.Сервер);
		
		// Создаем прокси для обращения к внешнему веб-сервису, передаем в функцию URI пространства имен, имя сервиса и порта.
		// SSL = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows(), Новый СертификатыУдостоверяющихЦентровWindows());
		SSL = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);
		HTTPСоединение = Новый HTTPСоединение(СерверАдрес,,,,, 120, SSL);
		
		// Создаем и устанавливаем данные в HTTP запрос
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("Content-Type", "application/json; charset=UTF-8");
		ЗаголовкиHTTP.Вставить("Content-Charset", "utf-8");
		
		// Формируем HTTP запрос
		HTTPЗапрос = Новый HTTPЗапрос("/v4.0", ЗаголовкиHTTP);	
		HTTPЗапрос.УстановитьТелоИзСтроки(JSONЗапрос);
		
		// Ответ от сервера получим в возвращаемом значении типа HTTPОтвет
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			ОписаниеОшибки = НСтр("ru= 'Ошибка сервиса IP-телефонии ';en= 'IP-telephony service error: '") + HTTPОтвет.КодСостояния;
			Возврат Ложь;
		КонецЕсли;
		
		// Разбор ответа
		JSONОтвет = ДекодироватьИзJSON(HTTPОтвет.ПолучитьТелоКакСтроку());
		Если JSONОтвет.Свойство("error") И ТипЗнч(JSONОтвет.error) = Тип("Структура") Тогда
			ОписаниеОшибки = НСтр("ru= 'Ошибка при выполнении операции сервиса IP-телефонии: ';en= 'Error performing IP-telephony service operation: '") + JSONОтвет.error.code + ", " + JSONОтвет.error.message;
			Возврат Ложь;
		КонецЕсли; 		
		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Ложь;
		
	КонецПопытки;
		
	Возврат Истина;

КонецФункции

// Функция - Co magic перевод текущего звонка
// 
// Параметры:
//  ПОIPТелефонии			 - 	 - 
//  ВнутреннийНомерТелефона	 - 	 - 
//  ВнешнийНомерТелефона	 - 	 - 
//  ОписаниеОшибки			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция CoMagic_ПереводТекущегоЗвонка(ПОIPТелефонии, call_session_id, НаНомерТелефона, ОписаниеОшибки = "")
	
	IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
	Если IPТелефонияПараметры = Неопределено ИЛИ ТипЗнч(IPТелефонияПараметры) <> Тип("Структура")
		ИЛИ IPТелефонияПараметры.Свойство("Сервер") = Ложь ИЛИ IPТелефонияПараметры.Свойство("Логин") = Ложь ИЛИ IPТелефонияПараметры.Свойство("Ключ") = Ложь Тогда
		ОписаниеОшибки = НСтр("ru= 'Ошибка! Необходимо произвести настройки сервера IP-телефонии в подключаемом оборудовании.';en= 'Error! It is necessary to configure the IP-telephony server in the connected equipment.'");
		Возврат Ложь;
	КонецЕсли;
	
	// hold.call
	СтруктураПараметров = Новый Структура("id, method, jsonrpc, params", "null", "hold.call", "2.0", Новый Структура());
	СтруктураПараметров.params.Вставить("access_token",      	 IPТелефонияПараметры.Ключ);
	СтруктураПараметров.params.Вставить("call_session_id", 		 call_session_id); 
	СтруктураПараметров.params.Вставить("contact_message", 		 Новый Структура());
	СтруктураПараметров.params.contact_message.Вставить("type",  "media");
	СтруктураПараметров.params.contact_message.Вставить("value", "2034");
	
	Если CoMagic_СформироватьИОтправитьЗапрос(IPТелефонияПараметры, СтруктураПараметров, ОписаниеОшибки) Тогда
		
		// make.call
		СтруктураПараметров = Новый Структура("id, method, jsonrpc, params", "null", "make.call", "2.0", Новый Структура());
		СтруктураПараметров.params.Вставить("access_token",    IPТелефонияПараметры.Ключ);
		СтруктураПараметров.params.Вставить("call_session_id", call_session_id); 
		СтруктураПараметров.params.Вставить("to", 		 	   НаНомерТелефона);
		Если CoMagic_СформироватьИОтправитьЗапрос(IPТелефонияПараметры, СтруктураПараметров, ОписаниеОшибки) Тогда    			
			
			// transfer.talk
			СтруктураПараметров = Новый Структура("id, method, jsonrpc, params", "null", "transfer.talk", "2.0", Новый Структура());
			СтруктураПараметров.params.Вставить("access_token",    IPТелефонияПараметры.Ключ);
			СтруктураПараметров.params.Вставить("call_session_id", call_session_id);	
			
			Если CoMagic_СформироватьИОтправитьЗапрос(IPТелефонияПараметры, СтруктураПараметров, ОписаниеОшибки) Тогда
				Возврат Истина;		
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли; 	
	
	Возврат Ложь;
	
КонецФункции

// Функция - Co magic сформировать и отправить запрос
// 
// Параметры:
//  IPТелефонияПараметры - 	 - 
//  СтруктураПараметров	 - 	 - 
//  ОписаниеОшибки		 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция CoMagic_СформироватьИОтправитьЗапрос(IPТелефонияПараметры, СтруктураПараметров, ОписаниеОшибки = "")
	
	JSONЗапрос = КодироватьВJSON(СтруктураПараметров, Ложь);
	
	Попытка
		
		СерверАдрес = ПреобразоватьАдресСервера(IPТелефонияПараметры.Сервер);
		
		// Создаем прокси для обращения к внешнему веб-сервису, передаем в функцию URI пространства имен, имя сервиса и порта.
		// SSL = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows(), Новый СертификатыУдостоверяющихЦентровWindows());
		SSL = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);
		HTTPСоединение = Новый HTTPСоединение(СерверАдрес,,,,, 120, SSL);
		
		// Создаем и устанавливаем данные в HTTP запрос
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("Content-Type", "application/json; charset=UTF-8");
		ЗаголовкиHTTP.Вставить("Content-Charset", "utf-8");
		
		// Формируем HTTP запрос
		HTTPЗапрос = Новый HTTPЗапрос("/v4.0", ЗаголовкиHTTP);	
		HTTPЗапрос.УстановитьТелоИзСтроки(JSONЗапрос);
		
		// Ответ от сервера получим в возвращаемом значении типа HTTPОтвет
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			ОписаниеОшибки = НСтр("ru= 'Ошибка сервиса IP-телефонии ';en= 'IP-telephony service error: '") + HTTPОтвет.КодСостояния;
			Возврат Ложь;
		КонецЕсли;
		
		// Разбор ответа
		JSONОтвет = ДекодироватьИзJSON(HTTPОтвет.ПолучитьТелоКакСтроку());
		Если JSONОтвет.Свойство("result") И ТипЗнч(JSONОтвет.result) = Тип("Структура") 
			И JSONОтвет.result.Свойство("data") И ТипЗнч(JSONОтвет.result.data) = Тип("Структура") 
			И JSONОтвет.result.data.Свойство("success") И JSONОтвет.result.data.success = "false" Тогда
			ОписаниеОшибки = НСтр("ru= 'Ошибка при выполнении операции сервиса IP-телефонии';en= 'Error performing IP-telephony service operation'");
			Возврат Ложь;
		КонецЕсли; 		
		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ______________________ПРОСТЫЕ_ЗВОНКИ_______________________

////// / ПРОСТЫЕ ЗВОНКИ ////// /

// Функция - OKTELL событие звонок
// 
// Параметры:
//  ИмяФункции		 - 	 - 
//  ПараметрыJSON	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПростыеЗвонки_СобытиеЗвонок(ПОIPТелефонии, ИмяФункции, Параметры, ОписаниеОшибки = "") Экспорт
	
	// ЗалогироватьСобытиеПростыхЗвонковВТрансляторе(ИмяФункции, Параметры); // Временно для дебага.
	Если Не ЗначениеЗаполнено(ПОIPТелефонии) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭтоЗавершениеЗвонка = (ИмяФункции = "IncomingCallCompleted" ИЛИ ИмяФункции = "OutgoingCallCompleted");
	
	Если ЭтоЗавершениеЗвонка И ЗвонокУжеЗаписанВБазуИНеТребуетсяЕгоПерезапись(Параметры.callID) Тогда
		Возврат Истина;		
	КонецЕсли;
	
	Результат = Ложь;
	
	УнифицированнаяСтруктураСобытия 							= ПолучитьУнифицированнуюСтруктуруСобытия();
	УнифицированнаяСтруктураСобытия.ПОIPТелефонии 				= ПОIPТелефонии;
	УнифицированнаяСтруктураСобытия.IDЗвонка 					= Параметры.callID;
	УнифицированнаяСтруктураСобытия.ФинализирующееСобытие 		= Ложь;
	УнифицированнаяСтруктураСобытия.Вставить("ЭтоЗавершениеЗвонка", ЭтоЗавершениеЗвонка);
	
	Если ИмяФункции = "IncomingCall" Тогда
		
#Область _____________________ВХОДЯЩИЙ_ДОЗВОН______________________
		
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 			= СокрЛП(УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ВернутьТелефонТолькоЦифрами(СокрЛП(Строка(Параметры.ExternalNumber))));
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo   			= СокрЛП(УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ВернутьТелефонТолькоЦифрами(СокрЛП(Строка(Параметры.InternalNumber))));
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 			= Перечисления.ВариантыНаправленияВызова.Входящий;
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 				= Перечисления.СтатусыЗвонка.Вызов;			
		УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова 		= ТекущаяДатаСеанса();
		
		Результат = СобытиеЗвонокДозвон(, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
		
#КонецОбласти
		
	ИначеЕсли ИмяФункции = "IncomingCallTalkStart" Тогда
		
#Область ___________________ВХОДЯЩИЙ_СОЕДИНЕНИЕ____________________
		
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 			= СокрЛП(УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ВернутьТелефонТолькоЦифрами(СокрЛП(Строка(Параметры.ExternalNumber))));
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo   			= СокрЛП(УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ВернутьТелефонТолькоЦифрами(СокрЛП(Строка(Параметры.InternalNumber))));
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 			= Перечисления.ВариантыНаправленияВызова.Входящий;
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 				= Перечисления.СтатусыЗвонка.Разговор;			
		УнифицированнаяСтруктураСобытия.ВремяОтветаНаВызов	 		= ТекущаяДатаСеанса();
		
		Результат = СобытиеЗвонокСоединение(, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
		
#КонецОбласти
		
	ИначеЕсли ИмяФункции = "IncomingCallCompleted" Тогда

#Область ___________________ВХОДЯЩИЙ_ЗАВЕРШЕНИЕ____________________
	
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 			= СокрЛП(УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ВернутьТелефонТолькоЦифрами(СокрЛП(Строка(Параметры.ExternalNumber))));
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo   			= СокрЛП(УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ВернутьТелефонТолькоЦифрами(СокрЛП(Строка(Параметры.InternalNumber))));
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 			= Перечисления.ВариантыНаправленияВызова.Входящий;
		УнифицированнаяСтруктураСобытия.ПринятДругимАбонентомГруппы = Ложь;
		
		Если НЕ ЗначениеЗаполнено(Параметры.Duration) Тогда
			УнифицированнаяСтруктураСобытия.СтатусЗвонка 			= Перечисления.СтатусыЗвонка.Вызов;
			УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова 	= МестноеВремя(Дата(1970, 01, 01) + Параметры.Start, ПолучитьЧасовойПоясИнформационнойБазы());
			
			ДобавитьОбновитьЗвонокВИсторию(, УнифицированнаяСтруктураСобытия);
		Иначе
			УнифицированнаяСтруктураСобытия.СтатусЗвонка 			= Перечисления.СтатусыЗвонка.Разговор;						
			УнифицированнаяСтруктураСобытия.ВремяОтветаНаВызов	 	= МестноеВремя(Дата(1970, 01, 01) + Параметры.Start, ПолучитьЧасовойПоясИнформационнойБазы());
			
			ДобавитьОбновитьЗвонокВИсторию(, УнифицированнаяСтруктураСобытия);							
		КонецЕсли;
		УнифицированнаяСтруктураСобытия.ВремяЗавершенияВызова 		= МестноеВремя(Дата(1970, 01, 01) + Параметры.End, ПолучитьЧасовойПоясИнформационнойБазы());		
		УнифицированнаяСтруктураСобытия.СсылкаНаЗаписьЗвонка 		= Параметры.URLRecord;
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 		= НЕ ЗначениеЗаполнено(Параметры.Duration);						
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 				= Перечисления.СтатусыЗвонка.Завершен;
		
		Результат = СобытиеЗвонокЗавершен(, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
		
#КонецОбласти
		
	ИначеЕсли ИмяФункции = "OutgoingCall" Тогда
		
#Область _____________________ИСХОДЯЩИЙ_ДОЗВОН_____________________
		
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 			= СокрЛП(УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ВернутьТелефонТолькоЦифрами(СокрЛП(Строка(Параметры.ExternalNumber))));
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo   			= СокрЛП(УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ВернутьТелефонТолькоЦифрами(СокрЛП(Строка(Параметры.InternalNumber))));
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 			= Перечисления.ВариантыНаправленияВызова.Исходящий;
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 				= Перечисления.СтатусыЗвонка.Вызов;					
		УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова 		= ТекущаяДатаСеанса();
		
		Результат = СобытиеЗвонокДозвон(, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
		
#КонецОбласти
		
	ИначеЕсли ИмяФункции = "OutgoingCallTalkStart" Тогда

#Область ___________________ИСХОДЯЩИЙ_СОЕДИНЕНИЕ___________________
	
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 			= СокрЛП(УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ВернутьТелефонТолькоЦифрами(СокрЛП(Строка(Параметры.ExternalNumber))));
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo   			= СокрЛП(УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ВернутьТелефонТолькоЦифрами(СокрЛП(Строка(Параметры.InternalNumber))));
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 			= Перечисления.ВариантыНаправленияВызова.Исходящий;
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 				= Перечисления.СтатусыЗвонка.Разговор;			
		УнифицированнаяСтруктураСобытия.ВремяОтветаНаВызов	 		= ТекущаяДатаСеанса();
		
		Результат = СобытиеЗвонокСоединение(, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
		
#КонецОбласти
		
	ИначеЕсли ИмяФункции = "OutgoingCallCompleted" Тогда
		
#Область ___________________ИСХОДЯЩИЙ_ЗАВЕРШЕНИЕ___________________
		
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 			= СокрЛП(УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ВернутьТелефонТолькоЦифрами(СокрЛП(Строка(Параметры.ExternalNumber))));
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo   			= СокрЛП(УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ВернутьТелефонТолькоЦифрами(СокрЛП(Строка(Параметры.InternalNumber))));
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 			= Перечисления.ВариантыНаправленияВызова.Исходящий;
		УнифицированнаяСтруктураСобытия.ПринятДругимАбонентомГруппы = Ложь;
		
		Если НЕ ЗначениеЗаполнено(Параметры.Duration) Тогда
			УнифицированнаяСтруктураСобытия.СтатусЗвонка 			= Перечисления.СтатусыЗвонка.Вызов;
			УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова 	= МестноеВремя(Дата(1970, 01, 01) + Параметры.Start, ПолучитьЧасовойПоясИнформационнойБазы());
			
			ДобавитьОбновитьЗвонокВИсторию(, УнифицированнаяСтруктураСобытия);			
		Иначе
			УнифицированнаяСтруктураСобытия.СтатусЗвонка 			= Перечисления.СтатусыЗвонка.Разговор;						
			УнифицированнаяСтруктураСобытия.ВремяОтветаНаВызов	 	= МестноеВремя(Дата(1970, 01, 01) + Параметры.Start, ПолучитьЧасовойПоясИнформационнойБазы());
			
			ДобавитьОбновитьЗвонокВИсторию(, УнифицированнаяСтруктураСобытия);			
		КонецЕсли;
		УнифицированнаяСтруктураСобытия.ВремяЗавершенияВызова 		= МестноеВремя(Дата(1970, 01, 01) + Параметры.End, ПолучитьЧасовойПоясИнформационнойБазы());		
		УнифицированнаяСтруктураСобытия.СсылкаНаЗаписьЗвонка 		= Параметры.URLRecord;
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 		= НЕ ЗначениеЗаполнено(Параметры.Duration);						
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 				= Перечисления.СтатусыЗвонка.Завершен;
		
		Результат = СобытиеЗвонокЗавершен(, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
		
#КонецОбласти
		
	Иначе
		ОписаниеОшибки = "Функция не распознана '" + ИмяФункции + "'";
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция - Исходящий звонок осуществить
// 
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  ВнешнийНомерТелефона	 - 	 - 
//  ВнутреннийНомерТелефона	 - 	 - 
//  Контрагент				 - 	 - 
//  Сотрудник				 - 	 - 
//  ОписаниеОшибки			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПростыеЗвонки_ПереадресацияЗвонка(ПОIPТелефонии, IDЗвонка, СНомерТелефона, НаНомерТелефона, ОписаниеОшибки = "")
		
	Попытка
			   
		ВызватьИсключение "Не поддерживаемая функциональность";
		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Функция - Проверить первый запуск
// 
// Возвращаемое значение:
//   - 
// 
Функция ПроверитьПервыйЗапуск() Экспорт	
	
	ПервыйЗапуск = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПростыеЗвонки", "ПервыйЗапуск",,, "ПростыеЗвонки");
	Если ПервыйЗапуск = Неопределено Тогда
		ИдентификаторБазы1С = СокрЛП(Новый УникальныйИдентификатор());
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиПростыеЗвонки", "ПервыйЗапуск", Истина,, "ПростыеЗвонки");
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиПростыеЗвонки", "ИдентификаторБазы1С", ИдентификаторБазы1С,, "ПростыеЗвонки");		
	КонецЕсли;
	
КонецФункции

// Функция - Проверить первый запуск
// 
// Возвращаемое значение:
//   - 
// 
Функция ПростыеЗвонки_ПроверитьВозможностьЗвонкаНаДанномПК(ПоРабочемуМесту = Ложь) Экспорт	
	Возврат Справочники.ТелефонныеАппараты.ПроверитьВозможностьЗвонкаНаДанномПК(ПоРабочемуМесту);	
КонецФункции

// Функция - Звонок уже записан в базу и не требуется его перезапись
//
// Параметры:
//  IDЗвонка - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЗвонокУжеЗаписанВБазуИНеТребуетсяЕгоПерезапись(IDЗвонка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ИсторияВызовов.IDЗвонка КАК IDЗвонка
	|ИЗ
	|	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
	|ГДЕ
	|	ИсторияВызовов.IDЗвонка = &IDЗвонка
	|	И (ИсторияВызовов.URLЗаписи <> """"
	|			ИЛИ ИсторияВызовов.НачалоВызова <= &ДатаПред
	|			ИЛИ ИсторияВызовов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗвонка.Завершен)
	|			ИЛИ ИсторияВызовов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗвонка.НеДозвон)
	|			ИЛИ ИсторияВызовов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗвонка.Пропущен))");
	
	Запрос.УстановитьПараметр("IDЗвонка"	, IDЗвонка);
	Запрос.УстановитьПараметр("ДатаПред"	, ТекущаяДатаСеанса() - 86400);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область ________________________IPТелефония_______________________ 

// Функция - Входщий звонок отвечен
// 
// Параметры:
//  ТипыПодключаемогоОборудования	 - 	 - 
//  НомерТелефонаFrom			 - 	 - 
//  НомерТелефонаTo				 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция СобытиеЗвонокДозвон(ПараметрыЗвонка = Неопределено, УнифицированнаяСтруктураСобытия, ОписаниеОшибки = "")
		
	// Создаем оповещение на клиент	
	Если УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий Тогда
		
		Если УнифицированнаяСтруктураСобытия.ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсBINOTEL Тогда
			СписокНомеровТелефонов = ПолучитьСписокНомеровТелефоновBINOTEL(УнифицированнаяСтруктураСобытия.НомерТелефонаFrom);
		Иначе
			СписокНомеровТелефонов = Неопределено;	
		КонецЕсли;
		
		Если УнифицированнаяСтруктураСобытия.ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсITOOLABS 
			ИЛИ УнифицированнаяСтруктураСобытия.ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсROSTELECOM
			ИЛИ УнифицированнаяСтруктураСобытия.ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсCoMagic Тогда
			
			СписокАктивныхПользователей 				= ПолучитьСписокАктивныхПользователей(УнифицированнаяСтруктураСобытия.ВнутреннийНомерСотрудника);
			УнифицированнаяСтруктураСобытия.Контрагент 	= ПолучитьКонтрагентаСотрудникаПоНомеруТелефона(УнифицированнаяСтруктураСобытия.НомерКонтрагента, СписокНомеровТелефонов);				
			
		Иначе 
			СписокАктивныхПользователей 				= ПолучитьСписокАктивныхПользователей(УнифицированнаяСтруктураСобытия.НомерТелефонаTo);
			УнифицированнаяСтруктураСобытия.Контрагент 	= ПолучитьКонтрагентаСотрудникаПоНомеруТелефона(УнифицированнаяСтруктураСобытия.НомерТелефонаFrom, СписокНомеровТелефонов);			
		КонецЕсли;	
		
		НомерТелефонаFromПредставление    = ВернутьПредставлениеНомераТелефона(СписокНомеровТелефонов);
		ИспользоватьСистемуВзаимодействия = ОбсужденияСистемыВзаимодействия.СистемаВзаимодействияВключена();
		
		ОбъектыОповещения 	 = Новый Массив;
		СотрудникиОповещения = Новый Массив;
		
		Для Каждого АктивныйСеансПользователя Из СписокАктивныхПользователей Цикл
			
			СообщениеОповещенияДействие = ?(ЗначениеЗаполнено(УнифицированнаяСтруктураСобытия.Контрагент), Символы.ПС + "Открыть карточку клиента", "");										
			СообщениеОповещения = "Клиент: " + ?(ЗначениеЗаполнено(УнифицированнаяСтруктураСобытия.Контрагент), УнифицированнаяСтруктураСобытия.Контрагент, "не найден" + ", тел. " + ?(ЗначениеЗаполнено(НомерТелефонаFromПредставление), НомерТелефонаFromПредставление, УнифицированнаяСтруктураСобытия.НомерТелефонаFrom)) + СообщениеОповещенияДействие;
			
			Если ИспользоватьСистемуВзаимодействия = Истина Тогда
				
				СотрудникиОповещения.Добавить(АктивныйСеансПользователя.Пользователь);
				
			Иначе
				
				ПараметрыОповещения = Новый_Массив(УнифицированнаяСтруктураСобытия.ПОIPТелефонии,
											   	   УнифицированнаяСтруктураСобытия.IDЗвонка,
												   УнифицированнаяСтруктураСобытия.НомерТелефонаFrom,
												   УнифицированнаяСтруктураСобытия.НомерТелефонаTo,
												   УнифицированнаяСтруктураСобытия.Контрагент);
				
				// Создаем оповещение через регистр сведений.
				РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(АктивныйСеансПользователя.РабочееМесто, 
																						Неопределено, 
																						"IPТелефония_ВходящийЗвонок",
																						ТекущаяДатаСеанса(), 
																						20,
																						"Входящий звонок", 
																						СообщениеОповещения,
																						ПараметрыОповещения);
			КонецЕсли;
		КонецЦикла; 
		
		Если ИспользоватьСистемуВзаимодействия = Истина И ЗначениеЗаполнено(СотрудникиОповещения) Тогда
			
			// Создаем оповещение через систему взаимодействия.
			ДанныеСообщения = Новый Структура;
			ДанныеСообщения.Вставить("Ключ"					, "IPТелефония_ВходящийЗвонок");
			ДанныеСообщения.Вставить("IPТелефония"			, ОбсужденияСистемыВзаимодействия.ПроверитьЗаполненностьЭлемента(УнифицированнаяСтруктураСобытия.ПОIPТелефонии));
			ДанныеСообщения.Вставить("IDЗвонка"	  			, УнифицированнаяСтруктураСобытия.IDЗвонка);
			ДанныеСообщения.Вставить("НомерТелефонаFrom"	, УнифицированнаяСтруктураСобытия.НомерТелефонаFrom);
			ДанныеСообщения.Вставить("НомерТелефонаTo"		, УнифицированнаяСтруктураСобытия.НомерТелефонаTo);
			ДанныеСообщения.Вставить("Контрагент"			, ОбсужденияСистемыВзаимодействия.ПроверитьЗаполненностьЭлемента(УнифицированнаяСтруктураСобытия.Контрагент));
			ДанныеСообщения.Вставить("Заголовок"			, "Входящий звонок");
			ДанныеСообщения.Вставить("ДатаНачалаЗвонка"		, УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова);
			ДанныеСообщения.Вставить("СообщениеОповещения"	, СообщениеОповещения);
			
			ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения, СотрудникиОповещения);	
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Если УнифицированнаяСтруктураСобытия.ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсOKTELL Тогда
		Возврат Истина;
	Иначе 	
		// Записываем в историю звонков
		ДобавитьОбновитьЗвонокВИсторию(ПараметрыЗвонка, УнифицированнаяСтруктураСобытия);
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

// Функция - Входщий звонок отвечен
// 
// Параметры:
//  ТипыПодключаемогоОборудования	 - 	 - 
//  НомерТелефонаFrom			 - 	 - 
//  НомерТелефонаTo				 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция СобытиеЗвонокСоединение(ПараметрыЗвонка = Неопределено, УнифицированнаяСтруктураСобытия, ОписаниеОшибки = "")	
	
	СтрокаТЗЗвонка = РегистрыСведений.ИсторияВызовов.ПолучитьПоIDЗвонка(УнифицированнаяСтруктураСобытия.IDЗвонка);
	ЭтоВходящийЗвонок = (ЗначениеЗаполнено(СтрокаТЗЗвонка) И СтрокаТЗЗвонка.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий);
	
	// При соединении завершаем оповещение пользователя
	Если УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий 
		ИЛИ ЭтоВходящийЗвонок Тогда
		Если УнифицированнаяСтруктураСобытия.ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсITOOLABS 
			ИЛИ УнифицированнаяСтруктураСобытия.ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсROSTELECOM
			ИЛИ УнифицированнаяСтруктураСобытия.ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсCoMagic Тогда

			СписокАктивныхПользователей = ПолучитьСписокАктивныхПользователей(УнифицированнаяСтруктураСобытия.ВнутреннийНомерСотрудника);
		Иначе 
			СписокАктивныхПользователей = ПолучитьСписокАктивныхПользователей(УнифицированнаяСтруктураСобытия.НомерТелефонаTo);
		КонецЕсли;
		
		ИспользоватьСистемуВзаимодействия = ОбсужденияСистемыВзаимодействия.СистемаВзаимодействияВключена();
		
		Если ИспользоватьСистемуВзаимодействия = Истина Тогда
		
      		Сотрудники 	 = Новый Массив;
			
			Для каждого АктивныйСеансПользователя Из СписокАктивныхПользователей Цикл
				Сотрудники.Добавить(АктивныйСеансПользователя.Пользователь);
			КонецЦикла;
			
			Если Сотрудники.Количество() > 0 Тогда
				
				ДанныеСообщения = Новый Структура;
				ДанныеСообщения.Вставить("Ключ"				, "IPТелефония_ОткрытьФормуВзаимодействияСКлиентом");
				ДанныеСообщения.Вставить("IPТелефония"		, ОбсужденияСистемыВзаимодействия.ПроверитьЗаполненностьЭлемента(УнифицированнаяСтруктураСобытия.ПОIPТелефонии));
				ДанныеСообщения.Вставить("IDЗвонка"			, УнифицированнаяСтруктураСобытия.IDЗвонка);
				ДанныеСообщения.Вставить("IDПлеча"			, УнифицированнаяСтруктураСобытия.IDПлеча);
				ДанныеСообщения.Вставить("НомерТелефонаFrom", УнифицированнаяСтруктураСобытия.НомерТелефонаFrom);
				ДанныеСообщения.Вставить("НомерТелефонаTo"	, УнифицированнаяСтруктураСобытия.НомерТелефонаTo);
				ДанныеСообщения.Вставить("ДатаНачалаЗвонка"	, УнифицированнаяСтруктураСобытия.ВремяОтветаНаВызов);
				
				ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения, Сотрудники); 
				
			КонецЕсли;
		
		Иначе
			
			// Оповещение через регистр сведений.
			Для Каждого АктивныйСеансПользователя Из СписокАктивныхПользователей Цикл
				
				// Завершаем оповещение пользователя
				РегистрыСведений.ОповещениеМониторингКлиента.ЗавершитьОповещениеКлиента(АктивныйСеансПользователя.РабочееМесто, Неопределено, "IPТелефония_ВходящийЗвонок");
				
				// Создаем оповещение открытия формы взаимодействия с клиентом
				МассивПараметров = Новый_Массив(УнифицированнаяСтруктураСобытия.ПОIPТелефонии,
												УнифицированнаяСтруктураСобытия.IDЗвонка,
												УнифицированнаяСтруктураСобытия.IDПлеча,
												УнифицированнаяСтруктураСобытия.НомерТелефонаFrom,
												УнифицированнаяСтруктураСобытия.НомерТелефонаTo);
				
				РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(АктивныйСеансПользователя.РабочееМесто,
																					   Неопределено, 
																					   "IPТелефония_ОткрытьФормуВзаимодействияСКлиентом",
																					   ТекущаяДатаСеанса(),
																					   60,,,
																					   МассивПараметров);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если УнифицированнаяСтруктураСобытия.ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсOKTELL Тогда
		Возврат Истина;
	Иначе 		
		// Записываем в историю звонков
		ДобавитьОбновитьЗвонокВИсторию(ПараметрыЗвонка, УнифицированнаяСтруктураСобытия);			
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Функция - Входщий звонок завершен
// 
// Параметры:
//  ТипыПодключаемогоОборудования	 - 	 - 
//  НомерТелефонаFrom			 - 	 - 
//  НомерТелефонаTo			 - 	 - 
//  ПродолжительностьЗвонка			 - 	 - 
//  СсылкаНаЗаписьЗвонка			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция СобытиеЗвонокЗавершен(ПараметрыЗвонка = Неопределено, УнифицированнаяСтруктураСобытия, ОписаниеОшибки = "")
	
	Результат = Истина;
	
	// При завершении звонка завершаем оповещение пользователя и создаем оповещение результата разговора
	Если УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий Тогда
		Если УнифицированнаяСтруктураСобытия.ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсITOOLABS 
			ИЛИ УнифицированнаяСтруктураСобытия.ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсROSTELECOM 
			ИЛИ УнифицированнаяСтруктураСобытия.ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсCoMagic Тогда

			СписокАктивныхПользователей = ПолучитьСписокАктивныхПользователей(УнифицированнаяСтруктураСобытия.ВнутреннийНомерСотрудника);
		Иначе 
			СписокАктивныхПользователей = ПолучитьСписокАктивныхПользователей(УнифицированнаяСтруктураСобытия.НомерТелефонаTo);
		КонецЕсли;	
		Для Каждого АктивныйСеансПользователя Из СписокАктивныхПользователей Цикл
			
			РегистрыСведений.ОповещениеМониторингКлиента.ЗавершитьОповещениеКлиента(АктивныйСеансПользователя.РабочееМесто, Неопределено, "IPТелефония_ВходящийЗвонок");
			
		КонецЦикла;
	КонецЕсли;	
	
	// Записываем в историю звонков
	ДобавитьОбновитьЗвонокВИсторию(ПараметрыЗвонка, УнифицированнаяСтруктураСобытия);
	
	Возврат Результат;
	
КонецФункции

// Функция - Исходящий звонок осуществить
// 
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  НомерТелефонаSIPСотрудник		 - 	 - 
//  ВнешнийНомерТелефонаКонтрагент	 - 	 - 
//  Сотрудник						 - 	 - 
//  Контрагент						 - 	 - 
//  ОписаниеОшибки					 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ИсходящийЗвонокОсуществить(ПОIPТелефонии, НомерТелефонаSIPСотрудник, ВнешнийНомерТелефонаКонтрагент, Знач Сотрудник = Неопределено, Знач Контрагент = Неопределено, ОписаниеОшибки = "") Экспорт
	
	// Получение номера телефона сотрудника
	НомерТелефонаSIP = "";
	Если ТипЗнч(НомерТелефонаSIPСотрудник) = Тип("СправочникСсылка.Сотрудники") 
		ИЛИ ТипЗнч(НомерТелефонаSIPСотрудник) = Тип("СправочникСсылка.Пользователи") Тогда
		МассивТелефонныхАппаратовСотрудника = ПолучитьСтруктуруВнутреннегоНомераПоПользователю(НомерТелефонаSIPСотрудник);
		Если МассивТелефонныхАппаратовСотрудника.Количество() = 0 Тогда
			ОписаниеОшибки = "Менеджер '" + ПараметрыСеанса.ТекущийПользователь + "' не в сети или внутренний номер телефона не зарегистрирован.";
			Возврат Ложь;
		ИначеЕсли Не ЗначениеЗаполнено(МассивТелефонныхАппаратовСотрудника[0].НомерТелефона) Тогда
			ОписаниеОшибки = "Внутренний номер телефона на менеджера '" + ПараметрыСеанса.ТекущийПользователь + "' не зарегистрирован.";
			Возврат Ложь;			
		КонецЕсли;
		Сотрудник = НомерТелефонаSIPСотрудник;
		НомерТелефонаSIP = МассивТелефонныхАппаратовСотрудника[0].НомерТелефона;
	Иначе
		НомерТелефонаSIP = НомерТелефонаSIPСотрудник;
	КонецЕсли;
	
	// Получение номера телефона контрагента
	ВнешнийНомерТелефона = "";
	Если ТипЗнч(ВнешнийНомерТелефонаКонтрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		НайденнаяСтрокаНомера = Контрагент.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонКлиента, "Вид");
		Если НайденнаяСтрокаНомера = Неопределено ИЛИ Не ЗначениеЗаполнено(НайденнаяСтрокаНомера.НомерТелефона) Тогда
			ОписаниеОшибки = "У контрагента не заполнен номер телефона";
			Возврат Ложь;
		КонецЕсли;
		Контрагент = ВнешнийНомерТелефонаКонтрагент;
		ВнешнийНомерТелефона = ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(НайденнаяСтрокаНомера.НомерТелефона);
	Иначе
		ВнешнийНомерТелефона = ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(ВнешнийНомерТелефонаКонтрагент, Ложь);
	КонецЕсли;
	
	Если НомерТелефонаSIP = "" Тогда
		ОписаниеОшибки = "Пустой номер телефона сотрудника";
		Возврат Ложь;
	ИначеЕсли ВнешнийНомерТелефона = "" Тогда
		ОписаниеОшибки = "Пустой номер телефона клиента";
		Возврат Ложь;	
	КонецЕсли;
	
	// Осуществляем звонок
	Если ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсOKTELL Тогда
		// Записываем в историю звонков
		УнифицированнаяСтруктураСобытия 								= ПолучитьУнифицированнуюСтруктуруСобытия();
		УнифицированнаяСтруктураСобытия.ПОIPТелефонии 					= ПОIPТелефонии;
		УнифицированнаяСтруктураСобытия.IDЗвонка 						= Строка(Новый УникальныйИдентификатор);
		УнифицированнаяСтруктураСобытия.ФинализирующееСобытие 			= Ложь;
		УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 				= НомерТелефонаSIP;
		УнифицированнаяСтруктураСобытия.НомерТелефонаTo   				= ВнешнийНомерТелефона;
		УнифицированнаяСтруктураСобытия.НаправлениеВызова 				= Перечисления.ВариантыНаправленияВызова.Исходящий;
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 					= Перечисления.СтатусыЗвонка.Вызов;			
		УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова 			= ТекущаяДатаСеанса();
		
		ДобавитьОбновитьЗвонокВИсторию(, УнифицированнаяСтруктураСобытия);

		Возврат OKTELL_ИсходящийЗвонокОсуществить(ПОIPТелефонии, НомерТелефонаSIP, ВнешнийНомерТелефона, Контрагент, Сотрудник, ОписаниеОшибки);
		
	ИначеЕсли ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсMANGO Тогда
		Возврат MANGO_ИсходящийЗвонокОсуществить(ПОIPТелефонии, НомерТелефонаSIP, ВнешнийНомерТелефона, ОписаниеОшибки);
		
	ИначеЕсли ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсITOOLABS Тогда
		Возврат ITOOLABS_ИсходящийЗвонокОсуществить(ПОIPТелефонии, НомерТелефонаSIP, ВнешнийНомерТелефона, ОписаниеОшибки);
		
	ИначеЕсли ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсBINOTEL Тогда
		Возврат BINOTEL_ИсходящийЗвонокОсуществить(ПОIPТелефонии, НомерТелефонаSIP, ВнешнийНомерТелефона, ОписаниеОшибки);
		
	ИначеЕсли ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсROSTELECOM Тогда
		Возврат ROSTELECOM_ИсходящийЗвонокОсуществить(ПОIPТелефонии, НомерТелефонаSIP, ВнешнийНомерТелефона, ОписаниеОшибки);
	
	ИначеЕсли ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсCoMagic Тогда
		Возврат CoMagic_ИсходящийЗвонокОсуществить(ПОIPТелефонии, НомерТелефонаSIP, ВнешнийНомерТелефона, ОписаниеОшибки);
		
	Иначе
		ОписаниеОшибки = "Тип оборудования IP-Телефонии '" + ПОIPТелефонии + "' не определен!";
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// Функция - Исходящий звонок осуществить
// 
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  НомерТелефонаSIPСотрудник		 - 	 - 
//  ВнешнийНомерТелефонаКонтрагент	 - 	 - 
//  Сотрудник						 - 	 - 
//  Контрагент						 - 	 - 
//  ОписаниеОшибки					 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПереадресацияЗвонка(ПОIPТелефонии, IDЗвонка, СНомерТелефона, НаНомерТелефона, ОписаниеОшибки = "") Экспорт
	
	Если ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсOKTELL Тогда
		Возврат OKTELL_ПереадресацияЗвонка(ПОIPТелефонии, IDЗвонка, СНомерТелефона, НаНомерТелефона, ОписаниеОшибки);
		
	ИначеЕсли ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсMANGO Тогда
		Возврат MANGO_ПереадресацияЗвонка(ПОIPТелефонии, IDЗвонка, НаНомерТелефона, ОписаниеОшибки);
		
	ИначеЕсли ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсCoMagic Тогда
		Возврат CoMagic_ПереводТекущегоЗвонка(ПОIPТелефонии, IDЗвонка, НаНомерТелефона, ОписаниеОшибки);
		
	ИначеЕсли ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВедисофтПростыеЗвонки Тогда
		Возврат ПростыеЗвонки_ПереадресацияЗвонка(ПОIPТелефонии, IDЗвонка, СНомерТелефона, НаНомерТелефона, ОписаниеОшибки);
		
	Иначе
		ОписаниеОшибки = "Тип оборудования IP-Телефонии '" + ПОIPТелефонии + "' не определен!";
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// Функция - Перевод текущего звонка
// 
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  IDЗвонка		 - 	 - 
//  СНомерТелефона	 - 	 - 
//  НаНомерТелефона	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПереводТекущегоЗвонка(ПОIPТелефонии, IDЗвонка, СНомерТелефона, НаНомерТелефона, ОписаниеОшибки = "") Экспорт
	
	Если ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсMANGO Тогда
		Возврат MANGO_ПереводТекущегоЗвонка(ПОIPТелефонии, IDЗвонка, СНомерТелефона, НаНомерТелефона, ОписаниеОшибки);
		
	ИначеЕсли ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсCoMagic Тогда
		Возврат CoMagic_ПереводТекущегоЗвонка(ПОIPТелефонии, IDЗвонка, НаНомерТелефона, ОписаниеОшибки); 
	
	Иначе
		ОписаниеОшибки = "Тип оборудования IP-Телефонии '" + ПОIPТелефонии + "' не определен!";
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// Функция - Проверка возможности переадресации звонка.
// 
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  IDЗвонка		 - 	 - 
//  СНомерТелефона	 - 	 - 
//  НаНомерТелефона	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ДоступнаПереадресацияЗвонка(ПОIPТелефонии, ОписаниеОшибки = "") Экспорт
	
	ОбработчикДрайвера = ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера;
	
	Если ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсOKTELL
		ИЛИ ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсMANGO
		ИЛИ ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВедисофтПростыеЗвонки
		ИЛИ ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсCoMagic Тогда
		
		Возврат Истина;
	Иначе
		ОписаниеОшибки = "Тип оборудования IP-Телефонии '" + ПОIPТелефонии + "' недоступен для переадресации звонка";
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// Функция - Проверка возможности перевода звонка.
// 
// Параметры:
//  ПОIPТелефонии	 - 	 - 
//  IDЗвонка		 - 	 - 
//  СНомерТелефона	 - 	 - 
//  НаНомерТелефона	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ДоступенПереводЗвонка(ПОIPТелефонии, ОписаниеОшибки = "") Экспорт
	
	ОбработчикДрайвера = ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера;
	
	Если ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсMANGO 
		ИЛИ ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсCoMagic Тогда
		
		Возврат Истина;
	Иначе
		ОписаниеОшибки = "Тип оборудования IP-Телефонии '" + ПОIPТелефонии + "' недоступен для перевода звонка";
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// Процедура - IPТелефония получение записей по регламенту
// 
Процедура IPТелефонияПолучениеЗаписейПоРегламенту() Экспорт
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено()
		И НЕ ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.IPТелефонияПолучениеЗаписей);
	
	ОтказВыполнения = Ложь;		
	РегламентныеЗаданияСерверСтоматология.АктуализироватьЗаданиеОчереди(Метаданные.РегламентныеЗадания.IPТелефонияПолучениеЗаписей, Истина, , ОтказВыполнения);
	Если ОтказВыполнения Тогда 
		Возврат;
	КонецЕсли;
	
	ПОIPТелефонии = ОпределитьПодключаемоеОборудование(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсROSTELECOM);
	Если ПОIPТелефонии <> Неопределено Тогда
		ROSTELECOM_ПолучитьURLЗаписейИЗаписатьВРегистр(ПОIPТелефонии, 100); // записи сразу не появляются на сайте, приходится через время получить ссылку на запись разговора.
	КонецЕсли;
	
	Если МенеджерОборудованияВызовСервера.ПолучитьСписокОборудования("IPТелефония").Количество() = 0 Тогда
		Возврат;
	ИначеЕсли Константы.ХранитьФайлыВТомахНаДиске.Получить() <> Истина Тогда
		ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.ПолучениеЗаписейПоРегламенту", УровеньЖурналаРегистрации.Предупреждение, , , "Для сохранения записей звонков необходимо включить параметр 'Хранение файлов в томах на диске'");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 100
	               |	ИсторияВызовов.ОборудованиеТелефонии,
	               |	ИсторияВызовов.IDЗвонка,
	               |	ИсторияВызовов.НомерТелефона,
	               |	ИсторияВызовов.ПользовательSip,
	               |	ИсторияВызовов.Пользователь,
	               |	ИсторияВызовов.URLЗаписи
	               |ИЗ
	               |	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
	               |ГДЕ
	               |	ИсторияВызовов.IDЗвонка <> """"
	               |	И ИсторияВызовов.URLЗаписи <> """"
	               |	И ИсторияВызовов.ФайлЗаписи = ЗНАЧЕНИЕ(Справочник.Файлы.ПустаяСсылка)
	               |	И ИсторияВызовов.ОкончаниеЗвонка <= ДОБАВИТЬКДАТЕ(&ТекущаяДата, МИНУТА, -5)
	               |	И ИсторияВызовов.ПопытокПолученияФайлаЗаписи < 5
	               |	И ИсторияВызовов.ОкончаниеЗвонка >= ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, -1)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИсторияВызовов.ОкончаниеЗвонка";
	
	ОжидатьПослеЗапроса = Ложь;
	ЗаписьСИсторииВыборка = Запрос.Выполнить().Выбрать();
	Пока ЗаписьСИсторииВыборка.Следующий() Цикл
		
		Если ОжидатьПослеЗапроса = Истина Тогда
			Пауза_WScript_Shell(5); // Гребанный MANGO выбивает ошибку если подряд получать записи
		КонецЕсли;
		
		ОписаниеОшибки = "";
		ОжидатьПослеЗапроса = Истина;
		ДобавитьПопыткуПолучениеФайла(ЗаписьСИсторииВыборка.ОборудованиеТелефонии, ЗаписьСИсторииВыборка.IDЗвонка);
		
		Если ЗаписьСИсторииВыборка.ОборудованиеТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсMANGO Тогда
			IDЗаписи = ЗаписьСИсторииВыборка.URLЗаписи;
			IDЗаписи = Сред(IDЗаписи, 1, СтрНайти(IDЗаписи, "/", НаправлениеПоиска.СКонца)-1);
			IDЗаписи = Сред(IDЗаписи, СтрНайти(IDЗаписи, "/", НаправлениеПоиска.СКонца)+1);
			АдресВоВременномХранилище = MANGO_ПолучениеФайлаЗаписиРазговора(ЗаписьСИсторииВыборка.ОборудованиеТелефонии, IDЗаписи, ОписаниеОшибки);
				
		Иначе
			СтруктураПолучениеФайла = ПолучениеФайловИзИнтернета.СкачатьФайлВоВременноеХранилище(ЗаписьСИсторииВыборка.URLЗаписи,, Ложь);
			Если СтруктураПолучениеФайла.Статус = Истина Тогда
				АдресВоВременномХранилище = СтруктураПолучениеФайла.Путь;
			Иначе
				ОписаниеОшибки = СтруктураПолучениеФайла.СообщениеОбОшибке;
			КонецЕсли; 			
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(АдресВоВременномХранилище) Тогда
			ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.ПолучениеЗаписейПоРегламенту", УровеньЖурналаРегистрации.Предупреждение, , , ОписаниеОшибки);
			Продолжить;
		КонецЕсли;
		
		ФайлСсылка = ПоместитьФайлВХранилищеФайлов(АдресВоВременномХранилище, ЗаписьСИсторииВыборка.ПользовательSip, ЗаписьСИсторииВыборка.НомерТелефона, ОписаниеОшибки);
		Если ФайлСсылка = Неопределено Тогда
			ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.ПолучениеЗаписейПоРегламенту", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
			Продолжить;
		КонецЕсли;		
		
		УнифицированнаяСтруктураСобытия 							= ПолучитьУнифицированнуюСтруктуруСобытия();		
		УнифицированнаяСтруктураСобытия.ПОIPТелефонии 				= ЗаписьСИсторииВыборка.ОборудованиеТелефонии;
		УнифицированнаяСтруктураСобытия.IDЗвонка 					= ЗаписьСИсторииВыборка.IDЗвонка;
		УнифицированнаяСтруктураСобытия.ФайлСсылкаЗаписиРазговора	= ФайлСсылка;
		УнифицированнаяСтруктураСобытия.ФинализирующееСобытие 		= Ложь;
		
		ДобавитьОбновитьЗвонокВИсторию(, УнифицированнаяСтруктураСобытия);

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область _________________________CallTouch__________________________

// Функция - Тестирование сервера
//
// Параметры:
//  ТипыПодключаемогоОборудования	 - 	 - 
//  Сервер							 - 	 - 
//  Порт							 - 	 - 
//  Логин							 - 	 - 
//  Пароль							 - 	 - 
//  ОписаниеОшибки					 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция CallTouch_ТестированиеСервера(Сервер, Порт, Ключ, ОписаниеОшибки = "") Экспорт	
	 		
	MSXMLЗапрос = "cmd=accounts"
	+ "&token=" + Ключ;
	
	Попытка
		
		СайтАдрес = ПреобразоватьАдресСервера(Сервер);
		
		Если СтрНайти(Сервер, "https://") = 1 Тогда  
			Соединение = Новый HTTPСоединение(СайтАдрес, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		Иначе 
			Соединение = Новый HTTPСоединение(СайтАдрес, 80);
		КонецЕсли;		
		HTTPЗапрос = Новый HTTPЗапрос("/sys/crm_api.wcgp", ПолучитьЗаголовкиPOSTЗапроса());
		HTTPЗапрос.УстановитьТелоИзСтроки(MSXMLЗапрос);
		
		// Отправка POST-запроса и получение ответа
		СтруктураОтвета = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		Если СтруктураОтвета.КодСостояния <> 200 Тогда
			
			ОписаниеОшибки = НСтр("ru= 'Ошибка сервиса IP-телефонии: ';en= 'IP-telephony service error: '") + СтруктураОтвета.КодСостояния;
			ОтветHTTP = СтруктураОтвета.ПолучитьТелоКакСтроку();
			
			Если ОтветHTTP <> "" Тогда
				ПараметрыJSON  = ДекодироватьИзJSON(ОтветHTTP);
				ОписаниеОшибки = ОписаниеОшибки + " (" + ПараметрыJSON.error + ")";
			КонецЕсли;
			
			Возврат Ложь;
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Функция - событие звонок
//
// Параметры:
//  ИмяФункции		 - 	 - 
//  ПараметрыJSON	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция CallTouch_СобытиеЗвонок(ПОIPТелефонии, ПараметрыJSON, ОписаниеОшибки = "") Экспорт
	
	УнифицированнаяСтруктураСобытия 							= ПолучитьУнифицированнуюСтруктуруСобытия();
	УнифицированнаяСтруктураСобытия.ПОIPТелефонии 				= ПОIPТелефонии;
	УнифицированнаяСтруктураСобытия.IDЗвонка 					= ПараметрыJSON.id;
	УнифицированнаяСтруктураСобытия.ФинализирующееСобытие 		= Ложь;
	
	УнифицированнаяСтруктураСобытия.НомерТелефонаFrom 			= ПараметрыJSON.callerphone; 
	УнифицированнаяСтруктураСобытия.НомерТелефонаTo   			= ПараметрыJSON.phonenumber;
	УнифицированнаяСтруктураСобытия.ВнутреннийНомерСотрудника   = ?(ПараметрыJSON.Свойство("redirectNumber"), ПараметрыJSON.redirectNumber, "");
	УнифицированнаяСтруктураСобытия.НомерКонтрагента 		    = ПараметрыJSON.redirectNumber;
	
	
	// Если ПараметрыJSON.callphase = "INCOMING" Тогда 
	УнифицированнаяСтруктураСобытия.НаправлениеВызова 		= Перечисления.ВариантыНаправленияВызова.Входящий;
	// ИначеЕсли ПараметрыJSON.callphase = "OUTGOING" Тогда 
	//	УнифицированнаяСтруктураСобытия.НаправлениеВызова 		= Перечисления.ВариантыНаправленияВызова.Исходящий;
	// КонецЕсли;
	
	Если УнифицированнаяСтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий 
		И ПараметрыJSON.callphase = "calldisconnected" Тогда 
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 	= ПараметрыJSON.status = "unsuccessful";
	Иначе 
		УнифицированнаяСтруктураСобытия.ПризнакЗвонокПропущен 	= Ложь;						
	КонецЕсли; 
	
	timestamp    = ?(ПараметрыJSON.Свойство("timestamp"), ПараметрыJSON.timestamp, 0);
	waiting_time = ?(ПараметрыJSON.Свойство("waiting_time"), ПараметрыJSON.waiting_time, 0);
	duration     = ?(ПараметрыJSON.Свойство("duration"), ПараметрыJSON.duration, 0);
	
	Если ПараметрыJSON.callphase = "callconnected" Тогда
		УнифицированнаяСтруктураСобытия.СтатусЗвонка 		   = Перечисления.СтатусыЗвонка.Вызов;							
		УнифицированнаяСтруктураСобытия.ВремяПоступленияВызова = МестноеВремя(Дата(1970, 01, 01) + timestamp, ПолучитьЧасовойПоясИнформационнойБазы());
		Возврат СобытиеЗвонокДозвон(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
		
	ИначеЕсли ПараметрыJSON.callphase = "calldisconnected" Тогда
		Если ПараметрыJSON.status = "successful" Тогда
			
			УнифицированнаяСтруктураСобытия.СтатусЗвонка 		  = Перечисления.СтатусыЗвонка.Разговор;	
			УнифицированнаяСтруктураСобытия.ВремяОтветаНаВызов 	  = МестноеВремя(Дата(1970, 01, 01) + timestamp + waiting_time, ПолучитьЧасовойПоясИнформационнойБазы());
			
			СобытиеЗвонокСоединение(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
			
			УнифицированнаяСтруктураСобытия.СтатусЗвонка 		  = Перечисления.СтатусыЗвонка.Завершен;
			// УнифицированнаяСтруктураСобытия.ВремяОтветаНаВызов 	  = МестноеВремя(Дата(1970, 01, 01) + timestamp + waiting_time, ПолучитьЧасовойПоясИнформационнойБазы());
			УнифицированнаяСтруктураСобытия.ВремяЗавершенияВызова = МестноеВремя(Дата(1970, 01, 01) + timestamp + waiting_time + duration, ПолучитьЧасовойПоясИнформационнойБазы());
			Возврат СобытиеЗвонокЗавершен(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
			
		ИначеЕсли ПараметрыJSON.status = "unsuccessful" Тогда		
			
			УнифицированнаяСтруктураСобытия.СтатусЗвонка  = Перечисления.СтатусыЗвонка.Пропущен;
			Возврат СобытиеЗвонокЗавершен(ПараметрыJSON, УнифицированнаяСтруктураСобытия, ОписаниеОшибки);
			
		КонецЕсли;
		
	Иначе
		
		ОписаниеОшибки = НСтр("ru= 'Функция не существует или не распознана.';en= 'The function does not exist or is not recognized.'");
		Возврат Ложь;	
		
	КонецЕсли;
	
КонецФункции

// Функция - событие запись разговора
//
// Параметры:
//  ИмяФункции		 - 	 - 
//  ПараметрыJSON	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция CallTouch_СобытиеЗаписьРазговора(ПОIPТелефонии, ПараметрыJSON, ОписаниеОшибки = "") Экспорт
	
	IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
	
	Если IPТелефонияПараметры = Неопределено
		ИЛИ ТипЗнч(IPТелефонияПараметры) <> Тип("Структура")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Сервер")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Токен")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("ИД") Тогда
		
		ОписаниеОшибки = НСтр("ru= 'Ошибка! Необходимо произвести настройки сервера IP-телефонии в подключаемом оборудовании.';en= 'Error! It is necessary to configure the IP-telephony server in the connected equipment.'");
		Возврат Ложь;
	КонецЕсли;
	
	// Https://api.calltouch.ru/calls-service/RestAPI/{ID сайта}/getnodeid/
	// Https://api-nodeX.calltouch.ru/
	// Https://api-node{номер сервера Calltouch}.calltouch.ru/calls-service/RestAPI/{идентификатор сайта}/calls-diary/calls/{callId}/download?clientApiId={токен}
	
	
	СсылкаНаЗаписьЗвонка = "http://api.calltouch.ru/calls-service/RestAPI/" + IPТелефонияПараметры.ИД + "/calls-diary/calls/" + ПараметрыJSON.id + "/download?clientApiId=" + IPТелефонияПараметры.Токен;	
	
	УнифицированнаяСтруктураСобытия 					  = ПолучитьУнифицированнуюСтруктуруСобытия();	
	УнифицированнаяСтруктураСобытия.ПОIPТелефонии 		  = ПОIPТелефонии;
	УнифицированнаяСтруктураСобытия.IDЗвонка 			  = ПараметрыJSON.id;
	УнифицированнаяСтруктураСобытия.СсылкаНаЗаписьЗвонка  = СсылкаНаЗаписьЗвонка;
	УнифицированнаяСтруктураСобытия.ФинализирующееСобытие = Ложь;
	
	ДобавитьОбновитьЗвонокВИсторию(ПараметрыJSON, УнифицированнаяСтруктураСобытия);
	
	//==========
	АдресСервера 			  = ПреобразоватьАдресСервера(IPТелефонияПараметры.Сервер);
	
	Попытка
		
		Соединение   		  = Новый HTTPСоединение(АдресСервера, 80); 
		HTTPЗапрос   		  = Новый HTTPЗапрос("/stat/getrecordedfile/?IDConnection=" );
		HTTPОтвет     		  = Соединение.Получить(HTTPЗапрос);
		ДвоичныеДанныеФайла   = HTTPОтвет.ПолучитьТелоКакДвоичныеДанные();
		
	Исключение
		
		ИнформацияОбОшибке 	  = ИнформацияОбОшибке();
		ОписаниеОшибки 		  = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Неопределено;
		
	КонецПопытки;
	
	АдресВоВременномХранилище =?(ЗначениеЗаполнено(ДвоичныеДанныеФайла), ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла), "");
	//==========
	
	Возврат Истина;
	
КонецФункции

// Функция, тестирование сервера.
//
// Параметры:
//  ТипыПодключаемогоОборудования	 - 	 - 
//  Сервер							 - 	 - 
//  Порт							 - 	 - 
//  Логин							 - 	 - 
//  Пароль							 - 	 - 
//  ОписаниеОшибки					 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция CallTouch_ПолучениеФайлаЗаписиРазговора(ПОIPТелефонии, IDЗаписи, ОписаниеОшибки = "", СтруктураПереадресации = Неопределено) Экспорт
	
	АдресВоВременномХранилище = "";
	IPТелефонияПараметры 	  = ПОIPТелефонии.Параметры.Получить();
	
	АдресСервера 			  = ПреобразоватьАдресСервера(IPТелефонияПараметры.Сервер);
	
	Попытка
		
		Соединение   		  = Новый HTTPСоединение(АдресСервера, 80); 
		HTTPЗапрос   		  = Новый HTTPЗапрос("/stat/getrecordedfile/?IDConnection=" + IDЗаписи);
		HTTPОтвет     		  = Соединение.Получить(HTTPЗапрос);
		ДвоичныеДанныеФайла   = HTTPОтвет.ПолучитьТелоКакДвоичныеДанные();
		
	Исключение
		
		ИнформацияОбОшибке 	  = ИнформацияОбОшибке();
		ОписаниеОшибки 		  = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Неопределено;
		
	КонецПопытки;
	
	АдресВоВременномХранилище =?(ЗначениеЗаполнено(ДвоичныеДанныеФайла), ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла), "");
	
	Возврат АдресВоВременномХранилище; 
		
КонецФункции

// Функция - Call touch получить информацию о посетителе сайта
//
// Параметры:
//  ПОIPТелефонии		 - 	 - 
//  НомерТелефонаКлиента - 	 - 
//  ОписаниеОшибки		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция CallTouch_ПолучитьИнформациюОПосетителеСайта(ПОIPТелефонии, НомерТелефона, ОписаниеОшибки = "") Экспорт
	
	IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
	
	Если IPТелефонияПараметры = Неопределено
		ИЛИ ТипЗнч(IPТелефонияПараметры) <> Тип("Структура")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Сервер")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("Токен")
		ИЛИ НЕ IPТелефонияПараметры.Свойство("ИД") Тогда
		
		ОписаниеОшибки = НСтр("ru= 'Ошибка! Необходимо произвести настройки сервера IP-телефонии в подключаемом оборудовании.';en= 'Error! It is necessary to configure the IP-telephony server in the connected equipment.'");
		Возврат Ложь;
	КонецЕсли;
	
	АдресСервера = ПреобразоватьАдресСервера(IPТелефонияПараметры.Сервер);
	
	Попытка
		
		ТекущаяДата = ТекущаяДатаСеанса();
	    ТекущаяДата = "" + День(ТекущаяДата) + "/" + Месяц(ТекущаяДата) + "/" + Год(ТекущаяДата);
		ТекущаяДата = СтрЗаменить(ТекущаяДата, Символы.НПП, "");
		ТекущаяДата = СтрЗаменить(ТекущаяДата, " ", "");
		
		Параметры = 
		"?clientApiId=" + IPТелефонияПараметры.Токен +
		"&dateFrom="    + ТекущаяДата +
		"&dateTo="      + ТекущаяДата +
		"&page="        + 1 +
		"&limit="       + 500 +
		"&attribution=" + 0 +
		"&ani.value="   + НомерТелефона;		
		
		Соединение    = Новый HTTPСоединение(АдресСервера, ,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 
		HTTPЗапрос    = Новый HTTPЗапрос("/calls-service/RestAPI/" + IPТелефонияПараметры.ИД + "/calls-diary/calls" + Параметры);
		HTTPОтвет     = Соединение.ВызватьHTTPМетод("GET", HTTPЗапрос);
		
		ПараметрыJSON = HTTPОтвет.ПолучитьТелоКакСтроку();
		
		ПараметрыJSON = ДекодироватьИзJSON(ПараметрыJSON);
		
		Если ПараметрыJSON.Свойство("records") Тогда 
			
		 	Индекс = ПараметрыJSON.records.Количество() - 1;
			ПоследнийЗвонок = ПараметрыJSON.records[Индекс];
			
		КонецЕсли;
				
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки 	   = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		Возврат Неопределено;
		
	КонецПопытки;
		
	Возврат ПоследнийЗвонок;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция - Получить телефонный аппарат по номеру
// 
// Параметры:
//  ВнутреннийНомер	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьТелефонныйАппаратПоНомеру(ВнутреннийНомер) Экспорт 
	Возврат Справочники.ТелефонныеАппараты.ПолучитьТелефонныйАппаратПоНомеру(ВнутреннийНомер); 	
КонецФункции

// Функция - Получить унифицированную структуру события
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьУнифицированнуюСтруктуруСобытия() Экспорт 
	
	УнифицированнаяСтруктураСобытия = Новый Структура;
	УнифицированнаяСтруктураСобытия.Вставить("ПОIPТелефонии"				, Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("IDЗвонка"						, Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("IDПлеча"						, Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("НаправлениеВызова"			, Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("ЗвонокУспешен"				, Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("ПризнакЗвонокПропущен"		, Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("СтатусЗвонка"					, Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("НомерТелефонаFrom"			, Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("НомерТелефонаTo"				, Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("ВнутреннийНомерСотрудника"	, Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("НомерКонтрагента"				, Неопределено);		
	УнифицированнаяСтруктураСобытия.Вставить("ВремяПоступленияВызова"		, Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("ВремяОтветаНаВызов"			, Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("ВремяЗавершенияВызова"		, Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("Продолжительность"			, Неопределено);	
	УнифицированнаяСтруктураСобытия.Вставить("ПринятДругимАбонентомГруппы"	, Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("Контрагент"					, Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("РекламныйИсточник"			, Неопределено);	
	УнифицированнаяСтруктураСобытия.Вставить("СсылкаНаЗаписьЗвонка"			, Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("ФайлСсылкаЗаписиРазговора"	, Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("ФинализирующееСобытие"		, Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("СтруктурнаяЕдиница"		    , Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("Заявка"		                , Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("ИсточникЗвонка"				, Неопределено);
	УнифицированнаяСтруктураСобытия.Вставить("КоллтрекингНомер"				, Неопределено);
	                                
	Возврат УнифицированнаяСтруктураСобытия;
	
КонецФункции

// Функция - Добавить обновить звонок в историю
// 
// Параметры:
//  НомерТелефонаИз	 - 	 - 
//  НомерТелефонаВ	 - 	 - 
//  ПризнакИсходящийЗвонок	 - 	 - 
//  Продолжительность		 - 	 - 
//  СсылкаНаЗаписьЗвонка	 - 	 - 
//  Статус					 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ДобавитьОбновитьЗвонокВИсторию(ПараметрыЗвонка = Неопределено, СтруктураСобытия) Экспорт  // , ПОТелефонии, IDЗвонка, НомерТелефонаИз, НомерТелефонаВ, ПризнакВходящийЗвонок, ДатаВремяИлиПродолжительность = 0, СсылкаНаЗаписьЗвонка = "", ФайлСсылкаЗаписиРазговора = Неопределено, Статус, ПринятДругимАбонентомГруппы = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если СтруктураСобытия.ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсITOOLABS 
			ИЛИ СтруктураСобытия.ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсROSTELECOM Тогда

		НомерТелефона	  = СтруктураСобытия.НомерТелефонаFrom;
		ПользовательSip	  = СтруктураСобытия.НомерТелефонаTo; 		
		// ТелефонныйАппарат = Справочники.ТелефонныеАппараты.ПолучитьТелефонныйАппаратПоНомеру(СтруктураСобытия.ВнутреннийНомерСотрудника);
	Иначе		
		НомерТелефона	  = ?(СтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий, СтруктураСобытия.НомерТелефонаFrom, СтруктураСобытия.НомерТелефонаTo);
		ПользовательSip	  = ?(СтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий, СтруктураСобытия.НомерТелефонаTo	, СтруктураСобытия.НомерТелефонаFrom);					
		IPТелефонияПараметры = СтруктураСобытия.ПОIPТелефонии.Параметры.Получить();		
	КонецЕсли; 		
	
	Контрагент = Неопределено;
	Если Не ЗначениеЗаполнено(СтруктураСобытия.ФайлСсылкаЗаписиРазговора) Тогда			
		ДанныеПоЗвонку = РегистрыСведений.ИсторияВызовов.ПолучитьПоIDЗвонка(СтруктураСобытия.IDЗвонка);
		Если НЕ ЗначениеЗаполнено(ДанныеПоЗвонку) ИЛИ НЕ ЗначениеЗаполнено(ДанныеПоЗвонку.Контрагент) Тогда
			НомерТелефонаДляПоиска	= ?(ЗначениеЗаполнено(НомерТелефона), НомерТелефона, ?(ЗначениеЗаполнено(ДанныеПоЗвонку), ДанныеПоЗвонку.НомерТелефона, ""));
			Контрагент				= ?(ЗначениеЗаполнено(СтруктураСобытия.Контрагент), СтруктураСобытия.Контрагент, ПолучитьКонтрагентаСотрудникаПоНомеруТелефона(НомерТелефонаДляПоиска));	
		КонецЕсли;		
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.ИсторияВызовов.СоздатьНаборЗаписей(); 
	
	НаборЗаписей.Отбор.ОборудованиеТелефонии.Установить(СтруктураСобытия.ПОIPТелефонии);
	НаборЗаписей.Отбор.IDЗвонка.Установить(СтруктураСобытия.IDЗвонка);
	
	НачатьТранзакцию();
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ИсторияВызовов");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("IDЗвонка", СтруктураСобытия.IDЗвонка);
	БлокировкаДанных.Заблокировать();
	
	НаборЗаписей.Прочитать();
	
	Запись 									= Неопределено;
	ПоказатьУведомлениеОПропущенном 		= Ложь;
	УдалитьЗапланированныеУведомления 		= Ложь;	
	Если НаборЗаписей.Количество() > 0 Тогда 
		Запись = НаборЗаписей[0];
	ИначеЕсли НаборЗаписей.Количество() = 0 Тогда 
		Запись = НаборЗаписей.Добавить();
	КонецЕсли;
	
	Если Запись <> Неопределено Тогда 
		
		Если НЕ (СтруктураСобытия.ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсITOOLABS 
					ИЛИ СтруктураСобытия.ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсROSTELECOM) Тогда
			
			ПользовательSip   = ?(ЗначениеЗаполнено(ПользовательSip), ПользовательSip, Запись.ПользовательSip);
			ТелефонныйАппарат = Справочники.ТелефонныеАппараты.ПолучитьТелефонныйАппаратПоНомеру(ПользовательSip);
			СтруктураСобытия.СтруктурнаяЕдиница = ?(ЗначениеЗаполнено(ТелефонныйАппарат), ТелефонныйАппарат.СтруктурнаяЕдиница, ?(IPТелефонияПараметры.Свойство("СтруктурнаяЕдиница"), IPТелефонияПараметры.СтруктурнаяЕдиница, Неопределено));
		КонецЕсли; 
		
		Если СтруктураСобытия.ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсITOOLABS
				ИЛИ СтруктураСобытия.ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсROSTELECOM Тогда
				
			СписокАктивныхПользователей = ПолучитьСписокАктивныхПользователей(СтруктураСобытия.ВнутреннийНомерСотрудника);
		Иначе
			СписокАктивныхПользователей = ПолучитьСписокАктивныхПользователей(ПользовательSip);
		КонецЕсли;
			
		Запись.ОборудованиеТелефонии 		= СтруктураСобытия.ПОIPТелефонии;
		Запись.IDЗвонка 					= СтруктураСобытия.IDЗвонка;
		Запись.НомерТелефона 				= ?(ЗначениеЗаполнено(НомерТелефона), НомерТелефона, Запись.НомерТелефона);
		Запись.ВнутреннийНомерСотрудника	= ?(ЗначениеЗаполнено(СтруктураСобытия.ВнутреннийНомерСотрудника), СтруктураСобытия.ВнутреннийНомерСотрудника, Запись.ВнутреннийНомерСотрудника);
		Запись.ПользовательSip 				= ?(ЗначениеЗаполнено(ПользовательSip), ПользовательSip, Запись.ПользовательSip);
		Запись.НаправлениеВызова			= ?(ЗначениеЗаполнено(СтруктураСобытия.НаправлениеВызова), СтруктураСобытия.НаправлениеВызова, Запись.НаправлениеВызова);
		Запись.СтруктурнаяЕдиница 			= ?(ЗначениеЗаполнено(СтруктураСобытия.СтруктурнаяЕдиница), СтруктураСобытия.СтруктурнаяЕдиница, Запись.СтруктурнаяЕдиница);
		Запись.Пользователь					= ?(СписокАктивныхПользователей.Количество() > 0, СписокАктивныхПользователей[0].Пользователь, Запись.Пользователь);
		Запись.URLЗаписи					= ?(ЗначениеЗаполнено(СтруктураСобытия.СсылкаНаЗаписьЗвонка), СтруктураСобытия.СсылкаНаЗаписьЗвонка, Запись.URLЗаписи);
		Запись.ФайлЗаписи					= ?(ЗначениеЗаполнено(СтруктураСобытия.ФайлСсылкаЗаписиРазговора), СтруктураСобытия.ФайлСсылкаЗаписиРазговора, Запись.ФайлЗаписи);
		// Запись.ИсточникЗвонка				= ?(ЗначениеЗаполнено(СтруктураСобытия.ИсточникЗвонка), СтруктураСобытия.ИсточникЗвонка, Запись.ИсточникЗвонка);
		Запись.ИсходящийЗвонок				= ?(ЗначениеЗаполнено(СтруктураСобытия.НаправлениеВызова), СтруктураСобытия.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Исходящий, Запись.ИсходящийЗвонок);
		
		Если СтруктураСобытия.СтатусЗвонка = Перечисления.СтатусыЗвонка.Вызов Тогда
			
			Если ЗначениеЗаполнено(СтруктураСобытия.ВремяПоступленияВызова) Тогда 
				Запись.НачалоВызова 		= Макс(Запись.НачалоВызова, СтруктураСобытия.ВремяПоступленияВызова);
			КонецЕсли; 
			Запись.Статус 					= ?(НЕ ЗначениеЗаполнено(Запись.Статус), Перечисления.СтатусыЗвонка.Вызов, Запись.Статус);

		ИначеЕсли СтруктураСобытия.СтатусЗвонка = Перечисления.СтатусыЗвонка.Разговор Тогда
			
			// Если пришел статус "Разговор" - то мы должны в любом случае заполнить ресурс "НачалоРазговора", чтобы понимать что трубку подняли
			Если ЗначениеЗаполнено(СтруктураСобытия.ВремяОтветаНаВызов) Тогда
				Если ЗначениеЗаполнено(Запись.НачалоРазговора) И ЗначениеЗаполнено(СтруктураСобытия.ВремяОтветаНаВызов) Тогда 
					Запись.НачалоРазговора 	= Мин(Запись.НачалоРазговора, СтруктураСобытия.ВремяОтветаНаВызов);
				Иначе 	
					Запись.НачалоРазговора 	= Макс(Запись.НачалоРазговора, СтруктураСобытия.ВремяОтветаНаВызов);
				КонецЕсли;	
			ИначеЕсли ЗначениеЗаполнено(СтруктураСобытия.Продолжительность) И ТипЗнч(СтруктураСобытия.Продолжительность) = Тип("Число") Тогда
				Запись.НачалоРазговора 		= Макс(Запись.НачалоВызова, Запись.НачалоРазговора) + СтруктураСобытия.Продолжительность;
			Иначе 
				Запись.НачалоРазговора 		= Макс(Запись.НачалоВызова, Запись.НачалоРазговора);
			КонецЕсли;
			Запись.Статус = Перечисления.СтатусыЗвонка.Разговор; 
			
		ИначеЕсли СтруктураСобытия.СтатусЗвонка = Перечисления.СтатусыЗвонка.Пропущен ИЛИ СтруктураСобытия.СтатусЗвонка = Перечисления.СтатусыЗвонка.Завершен Тогда
			
			Если СтруктураСобытия.ФинализирующееСобытие	= Истина Тогда
				// Актуализируем даты
				Если ЗначениеЗаполнено(СтруктураСобытия.ВремяПоступленияВызова) Тогда 
					Если ЗначениеЗаполнено(Запись.НачалоВызова) Тогда 
						Запись.НачалоВызова 	= Мин(Запись.НачалоВызова, СтруктураСобытия.ВремяПоступленияВызова);
					Иначе 
						Запись.НачалоВызова 	= СтруктураСобытия.ВремяПоступленияВызова;
					КонецЕсли;	
				КонецЕсли;
				Если ЗначениеЗаполнено(СтруктураСобытия.ВремяОтветаНаВызов) Тогда
					Запись.НачалоРазговора 	= СтруктураСобытия.ВремяОтветаНаВызов;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтруктураСобытия.ВремяЗавершенияВызова) Тогда
					Запись.ОкончаниеЗвонка 	= СтруктураСобытия.ВремяЗавершенияВызова;
				КонецЕсли;
			Иначе 
				Если ЗначениеЗаполнено(СтруктураСобытия.ВремяЗавершенияВызова) Тогда
					Запись.ОкончаниеЗвонка 	= Макс(Запись.ОкончаниеЗвонка, СтруктураСобытия.ВремяЗавершенияВызова);
				ИначеЕсли ЗначениеЗаполнено(СтруктураСобытия.Продолжительность) И ТипЗнч(СтруктураСобытия.Продолжительность) = Тип("Число") Тогда 
					Запись.ОкончаниеЗвонка 	= Макс(Запись.НачалоВызова, Запись.НачалоРазговора) + СтруктураСобытия.Продолжительность;
				Иначе 
					Запись.ОкончаниеЗвонка 	= Макс(Запись.НачалоВызова, Запись.НачалоРазговора);
				КонецЕсли;
			КонецЕсли;
			Запись.Статус 					= СтруктураСобытия.СтатусЗвонка;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураСобытия.ФайлСсылкаЗаписиРазговора) Тогда
			НаборЗаписей.Записать(Истина);
			ЗафиксироватьТранзакцию();
		Иначе 	
			// Ищем и заполняем контрагента если он есть в базе
			Если НЕ ЗначениеЗаполнено(Запись.Контрагент) Тогда
				
				Если СтруктураСобытия.ПОIPТелефонии.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсBINOTEL Тогда
					СписокНомеровТелефонов = ПолучитьСписокНомеровТелефоновBINOTEL(Запись.НомерТелефона);
				Иначе
					СписокНомеровТелефонов = Неопределено;
				КонецЕсли;
				
				Запись.Контрагент = ?(ЗначениеЗаполнено(СтруктураСобытия.Контрагент), СтруктураСобытия.Контрагент, ПолучитьКонтрагентаСотрудникаПоНомеруТелефона(Запись.НомерТелефона, СписокНомеровТелефонов));
				
			КонецЕсли;
			
			// Корректировка по статусу (Манго не возвращает статус что звонок пропущен или длительность его)
			Если Запись.Статус = Перечисления.СтатусыЗвонка.Завершен И НЕ ЗначениеЗаполнено(Запись.НачалоРазговора) Тогда
				Запись.Статус 		= ?(Запись.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Входящий, Перечисления.СтатусыЗвонка.Пропущен, Перечисления.СтатусыЗвонка.НеДозвон);
			ИначеЕсли (Запись.Статус = Перечисления.СтатусыЗвонка.Разговор ИЛИ Запись.Статус = Перечисления.СтатусыЗвонка.Завершен) И ЗначениеЗаполнено(Запись.НачалоРазговора) Тогда
				// Снимаем признак "Не обработан" с пропущенных ранее звонков
				АктуализироватьПропущенныеЗвонки(Запись);
			КонецЕсли;
			
			// Коррректировка по статусу "не дозвон", когда звонок исходящий и статус пропущен
			Если Запись.Статус = Перечисления.СтатусыЗвонка.Пропущен И Запись.НаправлениеВызова = Перечисления.ВариантыНаправленияВызова.Исходящий Тогда		
				Запись.Статус = Перечисления.СтатусыЗвонка.НеДозвон;					
			КонецЕсли;			
			
			// Проставляем признак "Не обработан"
			Если Запись.НеОбработан = Истина И ЗначениеЗаполнено(Запись.НачалоРазговора) Тогда
				// События приходили не по порядку. Снимаем ошибочно установленный флаг "НеОбработан".
				Запись.НеОбработан 					= Ложь;
				УдалитьЗапланированныеУведомления 	= Истина;
			Иначе 	
				Запись.НеОбработан 					= Запись.Статус = Перечисления.СтатусыЗвонка.Пропущен;
				ПоказатьУведомлениеОПропущенном 	= Запись.НеОбработан;			
			КонецЕсли;	
			
			// Если входящий звонок поступил на группу и был пропущен - то в качестве пользователя запишем группу
			Если НЕ ПараметрыЗвонка = Неопределено И Запись.ИсходящийЗвонок = Ложь Тогда 
				Если Запись.Статус = Перечисления.СтатусыЗвонка.Пропущен Тогда 
					Если ПараметрыЗвонка.Свойство("to") И ПараметрыЗвонка.to.Свойство("acd_group") И ЗначениеЗаполнено(ПараметрыЗвонка.to.acd_group) Тогда 
						Запись.ПользовательSip 	= СокрЛП(ПараметрыЗвонка.to.acd_group);
						Запись.Пользователь 	= Справочники.Сотрудники.ПустаяСсылка();
					КонецЕсли;
				ИначеЕсли Запись.Статус = Перечисления.СтатусыЗвонка.Завершен Тогда
					Запись.ПользовательSip 	= ?(ЗначениеЗаполнено(ПользовательSip), ПользовательSip, Запись.ПользовательSip);
					Запись.Пользователь		= ?(СписокАктивныхПользователей.Количество() > 0, СписокАктивныхПользователей[0].Пользователь, Запись.Пользователь);
				КонецЕсли;
			КонецЕсли;	
			
			ТелефонВЧС = РегистрыСведений.ЗаблокированныеНомераТелефонов.ТелефонВЧерномСписке(Запись.НомерТелефона);
			ЭтоГородской = УправлениеКонтактнойИнформациейСтоматология.ЭтоГородскойРФ(Запись.НомерТелефона);

			Если НЕ ТелефонВЧС И Не Запись.ИсходящийЗвонок И Не ЭтоГородской Тогда
				
				// Новая обработка
				
				ПреобразованныйНомер = СтрЗаменить(СтрСоединить(СтрРазделить(Запись.НомерТелефона, "+&<>`“‘|%/\@() "), ""), Символы.НПП, "");
				Заявка = Справочники.Заявки.ПолучитьЗаявкуПоНомеруТелефона(ПреобразованныйНомер);
				МассивПациентов = СписокПациентов(ПреобразованныйНомер);   
				
				Если ЗначениеЗаполнено(МассивПациентов) И МассивПациентов.Количество() > 0 Тогда
					
					Пациент = МассивПациентов[0];
					Сделка = Справочники.Сделки.ПолучитьАктуальнуюСделкуКлиента(Пациент);	
					
					Если ЗначениеЗаполнено(Сделка) Тогда
						Заявка = Сделка;
					Иначе
						ПриемСуществует = ?(ЗначениеЗаполнено(Пациент), ПриемСуществует(Пациент), Ложь);
						
						Если ПриемСуществует Тогда
							ДанныеЗаполнения = Новый Структура();
							ДанныеЗаполнения.Вставить("ВидСделки"         , ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты"));
							ДанныеЗаполнения.Вставить("Контрагент"        , Пациент);
							ДанныеЗаполнения.Вставить("СтруктурнаяЕдиница", Запись.СтруктурнаяЕдиница);
							ДанныеЗаполнения.Вставить("ЭтапСделки"        , Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(Справочники.ВидыСделок.НовыеПациенты, 1));
							
							МассивСтатусов = Новый Массив;
							МассивСтатусов.Добавить(Перечисления.СтатусыЗаявок.НеОбработана);
							ЗаявкаОснование = Справочники.Заявки.ПолучитьЗаявкуКонтрагента(Пациент, МассивСтатусов,,Истина);						
							ДанныеЗаполнения.Вставить("Заявка"            , ЗаявкаОснование);
							
							Заявка = Справочники.Сделки.СоздатьНовуюСделку(ДанныеЗаполнения, Истина);
						ИначеЕсли Не ЗначениеЗаполнено(Заявка) Тогда
							
							Заявка = Справочники.Заявки.СоздатьВходящуюЗаявку(,,,Пациент.Фамилия,Пациент.Имя,Пациент.Отчество,Запись.НомерТелефона,,, Справочники.КаналыПривлечения.ВходящийЗвонок,,,, Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(,Перечисления.ТипыВнешнихСистем.IPТелефония,Истина),,Пациент,Запись.СтруктурнаяЕдиница);
							
						КонецЕсли;
					КонецЕсли;
					
				Иначе	
					
					Если Не ЗначениеЗаполнено(Заявка) Тогда
						Заявка = Справочники.Заявки.СоздатьВходящуюЗаявку(,,,,,,Запись.НомерТелефона,,, Справочники.КаналыПривлечения.ВходящийЗвонок,,,, Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(,Перечисления.ТипыВнешнихСистем.IPТелефония,Истина),,,Запись.СтруктурнаяЕдиница);	
					ИначеЕсли ЗначениеЗаполнено(Заявка.НомерТелефона) 
						И Не Запись.ИсходящийЗвонок 
						И Заявка.Статус <> Перечисления.СтатусыЗаявок.Отклонена 
						И Заявка.Статус <> Перечисления.СтатусыЗаявок.Принята Тогда
						
						Если Запись.Статус = Перечисления.СтатусыЗвонка.Пропущен Тогда
							ЗаявкаОбъект = Заявка.ПолучитьОбъект();
							ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявок.ПропущенныйЗвонок;
							ЗаявкаОбъект.Записать();	
						ИначеЕсли СтруктураСобытия.СтатусЗвонка = Перечисления.СтатусыЗвонка.Разговор Тогда	
							ЗаявкаОбъект = Заявка.ПолучитьОбъект();
							ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявок.ОтвеченныйЗвонок;
							ЗаявкаОбъект.Записать(); 
							ОбсужденияСервер.ДобавитьСообщение("На звонок ответил: " + Запись.Пользователь,ЗаявкаОбъект.Ссылка,, Истина);	
						КонецЕсли; 
					КонецЕсли;
					
				КонецЕсли;
				
				
				      /// Старый вариант
				//Заявка = Справочники.Заявки.ПолучитьЗаявкуПоНомеруТелефона(ПреобразованныйНомер);
				//Если (НЕ ЗначениеЗаполнено(Заявка.НомерТелефона) ИЛИ СтруктураСобытия.СтатусЗвонка = Перечисления.СтатусыЗвонка.Завершен) И НЕ Запись.ИсходящийЗвонок Тогда //И Не ЗначениеЗаполнено(Запись.Заявка) Тогда
				//	
				//	Пациент = Справочники.Контрагенты.ПолучитьКонтрагентаПоНомеруТелефона(ПреобразованныйНомер); 
				//	
				//	ПриемСуществует = ?(ЗначениеЗаполнено(Пациент), ПриемСуществует(Пациент), Ложь);
				//	
				//	Если НЕ ЗначениеЗаполнено(Пациент) ИЛИ (ЗначениеЗаполнено(Пациент) И НЕ ПриемСуществует И НЕ ЗначениеЗаполнено(Заявка)) Тогда
				//		Пациент = Справочники.Контрагенты.ПустаяСсылка();
				//		Заявка = Справочники.Заявки.СоздатьВходящуюЗаявку(,,,Пациент.Фамилия, Пациент.Имя,Пациент.Отчество,Запись.НомерТелефона,,,,,,,,,Пациент,Запись.СтруктурнаяЕдиница);	
				//	Иначе
				//		Сделка = Справочники.Сделки.ПолучитьАктуальнуюСделкуКлиента(Пациент, Запись.СтруктурнаяЕдиница); 
				//		Если НЕ ЗначениеЗаполнено(Сделка) И НЕ ЗначениеЗаполнено(Заявка) Тогда
				//			Заявка = Справочники.Заявки.ПустаяСсылка();	
				//		Иначе
				//			Заявка = Сделка;
				//		КонецЕсли;
				//	КонецЕсли;
				//	
				//	
				//ИначеЕсли ЗначениеЗаполнено(Заявка.НомерТелефона) 
				//	И Не Запись.ИсходящийЗвонок 
				//	И Заявка.Статус <> Перечисления.СтатусыЗаявок.Отклонена 
				//	И Заявка.Статус <> Перечисления.СтатусыЗаявок.Принята Тогда
				//	
				//	Если Запись.Статус = Перечисления.СтатусыЗвонка.Пропущен Тогда
				//		
				//		ЗаявкаОбъект = Заявка.ПолучитьОбъект();
				//		ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявок.ПропущенныйЗвонок;
				//		ЗаявкаОбъект.Записать();	
				//		
				//	ИначеЕсли СтруктураСобытия.СтатусЗвонка = Перечисления.СтатусыЗвонка.Разговор Тогда	
				//		
				//		ЗаявкаОбъект = Заявка.ПолучитьОбъект();
				//		ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявок.ОтвеченныйЗвонок;
				//		ЗаявкаОбъект.Записать();
				//		
				//	КонецЕсли; 

				//КонецЕсли;
				
			Иначе
				
				Заявка = Справочники.Заявки.ПустаяСсылка();
			КонецЕсли;
			
			Запись.Заявка = Заявка;
			
			НаборЗаписей.Записать(Истина);
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	КонецЕсли;
	
	// Инициируем оповещение пользователю
	ИспользоватьСистемуВзаимодействия = ОбсужденияСистемыВзаимодействия.СистемаВзаимодействияВключена();
	Если ПоказатьУведомлениеОПропущенном = Истина Тогда 
		ТаблицаАктивныхПользователей = ПолучитьСписокАктивныхПользователейИГрупп(?(ЗначениеЗаполнено(СокрЛП(Запись.ПользовательSip)), СокрЛП(Запись.ПользовательSip), Неопределено));
		Если НЕ ТаблицаАктивныхПользователей.Количество() = 0 Тогда
			ТаблицаНеОбработанныхВРазрезеПользователей = ПолучитьТаблицуНеОбработанныхЗвонков();
			Для Каждого АктивныйСеансПользователя Из ТаблицаАктивныхПользователей Цикл
				КоличествоПропущенных = 0;
				Если ЗначениеЗаполнено(СокрЛП(Запись.ПользовательSip)) Тогда 
					СтрокаТЗ = ТаблицаНеОбработанныхВРазрезеПользователей.Найти(АктивныйСеансПользователя.ВнутреннийНомер, "ПользовательSip");
					Если НЕ СтрокаТЗ = Неопределено Тогда
						КоличествоПропущенных = КоличествоПропущенных + СтрокаТЗ.КоличествоНеОбработанных;
					КонецЕсли;
					СтрокаТЗ = ТаблицаНеОбработанныхВРазрезеПользователей.Найти(АктивныйСеансПользователя.ВнутреннийНомерРодителя, "ПользовательSip");
					Если НЕ СтрокаТЗ = Неопределено Тогда
						КоличествоПропущенных = КоличествоПропущенных + СтрокаТЗ.КоличествоНеОбработанных;
					КонецЕсли;
				Иначе 
					СтрокаТЗ = ТаблицаНеОбработанныхВРазрезеПользователей.Найти("", "ПользовательSip");
					Если НЕ СтрокаТЗ = Неопределено Тогда
						КоличествоПропущенных = КоличествоПропущенных + СтрокаТЗ.КоличествоНеОбработанных;
					КонецЕсли;
				КонецЕсли;				
				Если НЕ КоличествоПропущенных = 0 Тогда
					ЗаголовокСообщения = "У Вас " + Строка(КоличествоПропущенных) + " " + СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу("Пропущенный", КоличествоПропущенных) + " " + СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу("Звонок", КоличествоПропущенных);
					
					Если ИспользоватьСистемуВзаимодействия = Истина Тогда
						
						// Создаем оповещение в системе взаимодействия.
						ДанныеСообщения = Новый Структура;
						ДанныеСообщения.Вставить("Ключ"						, "IPТелефония_ПокзатьУведомлениеОПропущенном_" + Макс(СокрЛП(Запись.НомерТелефона), СокрЛП(Запись.ПользовательSip)));
						ДанныеСообщения.Вставить("ТелефонныйАппарат"		, ОбсужденияСистемыВзаимодействия.ПроверитьЗаполненностьЭлемента(АктивныйСеансПользователя.ТелефонныйАппарат, ""));
						ДанныеСообщения.Вставить("ВнутреннийНомер"			, АктивныйСеансПользователя.ВнутреннийНомер);
						ДанныеСообщения.Вставить("ВнутреннийНомерРодителя"	, ОбсужденияСистемыВзаимодействия.ПроверитьЗаполненностьЭлемента(АктивныйСеансПользователя.ВнутреннийНомерРодителя, ""));
						ДанныеСообщения.Вставить("Пользователь"				, Макс(СокрЛП(Запись.НомерТелефона), СокрЛП(Запись.ПользовательSip)));
						ДанныеСообщения.Вставить("КлючОповещения"			, "IPТелефония_ПокзатьУведомлениеОПропущенном_" + АктивныйСеансПользователя.ВнутреннийНомер);
						ДанныеСообщения.Вставить("ЗаголовокСообщения"		, ЗаголовокСообщения);
						ДанныеСообщения.Вставить("Сообщение"				, "Открыть список пропущенных");
						
						ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения, АктивныйСеансПользователя.Пользователь);
						
					Иначе
						
						// Создаем оповещение через регистр сведений.
						ПараметрыОповещения = Новый_Массив(?(ЗначениеЗаполнено(АктивныйСеансПользователя.ТелефонныйАппарат), АктивныйСеансПользователя.ТелефонныйАппарат, ""),
													       АктивныйСеансПользователя.ВнутреннийНомер, 
														   ?(ЗначениеЗаполнено(АктивныйСеансПользователя.ВнутреннийНомерРодителя), АктивныйСеансПользователя.ВнутреннийНомерРодителя, ""),
														   Макс(СокрЛП(Запись.НомерТелефона), СокрЛП(Запись.ПользовательSip)), 
														   "IPТелефония_ПокзатьУведомлениеОПропущенном_" + АктивныйСеансПользователя.ВнутреннийНомер);
														   
						РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(АктивныйСеансПользователя.РабочееМесто,
																							   Неопределено,
																							   "IPТелефония_ПокзатьУведомлениеОПропущенном_" + Макс(СокрЛП(Запись.НомерТелефона), СокрЛП(Запись.ПользовательSip)),
																							   ТекущаяДатаСеанса() + 60, 
																							   0,
																							   ЗаголовокСообщения, 
																							   "Открыть список пропущенных", 
																							   ПараметрыОповещения);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли УдалитьЗапланированныеУведомления И НЕ ИспользоватьСистемуВзаимодействия Тогда
		СписокАктивныхПользователей = ПолучитьСписокАктивныхПользователей(, Истина);		
		Для Каждого АктивныйСеансПользователя Из СписокАктивныхПользователей Цикл
			// Завершаем оповещение пользователя
			РегистрыСведений.ОповещениеМониторингКлиента.ЗавершитьОповещениеКлиента(АктивныйСеансПользователя.РабочееМесто, 
																					Неопределено,
																					"IPТелефония_ПокзатьУведомлениеОПропущенном_" + Макс(СокрЛП(Запись.НомерТелефона), СокрЛП(Запись.ПользовательSip)));
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

Функция СписокПациентов(Телефон)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|	И КонтрагентыКонтактнаяИнформация.НомерТелефона = &Телефон
		|	И НЕ КонтрагентыКонтактнаяИнформация.Ссылка.ПометкаУдаления"; 
	
	Запрос.УстановитьПараметр("Телефон", Телефон);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контрагент");

КонецФункции
		
// Функция - проверяет есть ли у пациента прием
// 
Функция ПриемСуществует(Пациент)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Прием.Ссылка КАК Ссылка,
		|	Прием.Контрагент КАК Контрагент
		|ИЗ
		|	Документ.Прием КАК Прием
		|ГДЕ
		|	Прием.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Пациент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ?(РезультатЗапроса.Пустой(), Ложь, Истина);
	
КонецФункции

// Функция - Добавить обновить звонок в историю
// 
// Параметры:
//  НомерТелефонаИз	 - 	 - 
//  НомерТелефонаВ	 - 	 - 
//  ПризнакИсходящийЗвонок	 - 	 - 
//  Продолжительность		 - 	 - 
//  СсылкаНаЗаписьЗвонка	 - 	 - 
//  Статус					 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ДобавитьПопыткуПолучениеФайла(ПОIPТелефонии, IDЗвонка)
	
	НаборЗаписей = РегистрыСведений.ИсторияВызовов.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.ОборудованиеТелефонии.Значение 		= ПОIPТелефонии;
	НаборЗаписей.Отбор.ОборудованиеТелефонии.Использование 	= Истина;
	НаборЗаписей.Отбор.IDЗвонка.Значение 					= IDЗвонка;
	НаборЗаписей.Отбор.IDЗвонка.Использование 				= Истина;
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		Запись = НаборЗаписей[0];
		Запись.ПопытокПолученияФайлаЗаписи = Запись.ПопытокПолученияФайлаЗаписи + 1;
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	
КонецФункции

// Функция - Получить контрагента по номеру телефона
// 
// Параметры:
//  НомерТелефона	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьКонтрагентаСотрудникаПоНомеруТелефона(НомерТелефона, СписокНомеровТелефонов = Неопределено) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СписокНомеровТелефонов) Тогда
		Получили_XDTO = Ложь;
		НомерТелефонаТолькоЦифры = СокрЛП(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(НомерТелефона));
		
		СписокНомеровТелефонов = Новый СписокЗначений;	
		СписокНомеровТелефонов.Добавить(НомерТелефона);
		СписокНомеровТелефонов.Добавить(?(Лев(НомерТелефонаТолькоЦифры, 1) = "8", "7" + Сред(НомерТелефонаТолькоЦифры, 2), НомерТелефонаТолькоЦифры));
		СписокНомеровТелефонов.Добавить(?(Лев(НомерТелефонаТолькоЦифры, 1) = "7", "8" + Сред(НомерТелефонаТолькоЦифры, 2), НомерТелефонаТолькоЦифры));
		
		Если ЗначениеЗаполнено(НомерТелефонаТолькоЦифры) И СтрДлина(СокрЛП(НомерТелефонаТолькоЦифры)) > 4 Тогда 
			СписокНомеровТелефонов.Добавить(НомерТелефонаТолькоЦифры);		
			Объект_XDTO_Телефон = ПолучитьСтруктуру_XDTO(СокрЛП(НомерТелефонаТолькоЦифры), Перечисления.ТипыКонтактнойИнформации.Телефон);
			Если НЕ Объект_XDTO_Телефон = Неопределено Тогда
				Получили_XDTO = Истина;				
				СписокНомеровТелефонов.Добавить(			Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
				СписокНомеровТелефонов.Добавить("8" 	+ 	Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
				СписокНомеровТелефонов.Добавить("7" 	+ 	Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
				СписокНомеровТелефонов.Добавить("+7" 	+ 	Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
				СписокНомеровТелефонов.Добавить(			Объект_XDTO_Телефон.Представление, , Истина);
				СписокНомеровТелефонов.Добавить(Объект_XDTO_Телефон.Состав.КодСтраны + Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
			КонецЕсли;	
		КонецЕсли;
		Если НЕ Получили_XDTO Тогда  
			ЭлементСписка = СписокНомеровТелефонов.НайтиПоЗначению(НомерТелефона);
			Если НЕ ЭлементСписка = Неопределено Тогда 
				ЭлементСписка.Пометка = Истина;
			КонецЕсли;
		КонецЕсли;			
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивНомеровТелефонов", СписокНомеровТелефонов.ВыгрузитьЗначения());
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	               |ГДЕ
	               |	КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКлиента)
	               |	И КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |	И КонтрагентыКонтактнаяИнформация.НомерТелефона В(&МассивНомеровТелефонов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СотрудникиКонтактнаяИнформация.Ссылка
	               |ИЗ
	               |	Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
	               |ГДЕ
	               |	СотрудникиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПользователя)
	               |	И СотрудникиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |	И СотрудникиКонтактнаяИнформация.НомерТелефона В(&МассивНомеровТелефонов)";
				   
	РезультатПоКонтрагентам = Запрос.Выполнить().Выбрать();
	
	Возврат ?(РезультатПоКонтрагентам.Следующий(), РезультатПоКонтрагентам.Ссылка, Справочники.Контрагенты.ПустаяСсылка());
	
КонецФункции

// Функция - Получить список номеров телефонов BINOTEL
// 
// Параметры:
//  НомерТелефона	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьСписокНомеровТелефоновBINOTEL(НомерТелефона) Экспорт 
	
	Получили_XDTO = Ложь;				
	СписокНомеровТелефонов = Новый СписокЗначений;	
	СписокНомеровТелефонов.Добавить(НомерТелефона);
	НомерТелефонаТолькоЦифры = СокрЛП(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(НомерТелефона));
	Если ЗначениеЗаполнено(НомерТелефонаТолькоЦифры) И СтрДлина(СокрЛП(НомерТелефонаТолькоЦифры)) > 4 Тогда 
		СписокНомеровТелефонов.Добавить(НомерТелефонаТолькоЦифры);		
		Объект_XDTO_Телефон = ПолучитьСтруктуру_XDTO(СокрЛП(НомерТелефонаТолькоЦифры), Перечисления.ТипыКонтактнойИнформации.Телефон);
		Если НЕ Объект_XDTO_Телефон = Неопределено Тогда
			Получили_XDTO = Истина;				
			СписокНомеровТелефонов.Добавить(			Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
			СписокНомеровТелефонов.Добавить("38" 	+ 	Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
			СписокНомеровТелефонов.Добавить("+38" 	+ 	Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
			СписокНомеровТелефонов.Добавить(			Объект_XDTO_Телефон.Представление, , Истина);
			СписокНомеровТелефонов.Добавить(Объект_XDTO_Телефон.Состав.КодСтраны + Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
		КонецЕсли;	
	КонецЕсли;
	Если НЕ Получили_XDTO Тогда  
		ЭлементСписка = СписокНомеровТелефонов.НайтиПоЗначению(НомерТелефона);
		Если НЕ ЭлементСписка = Неопределено Тогда 
			ЭлементСписка.Пометка = Истина;
		КонецЕсли;
	КонецЕсли;			
	
	Возврат СписокНомеровТелефонов;
	
КонецФункции

// Функция - Получить создать рекламный источник
//
// Параметры:
//  Наименование - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСоздатьРекламныйИсточник(Наименование)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Наименование", Наименование);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РекламныеИсточники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РекламныеИсточники КАК РекламныеИсточники
		|ГДЕ
		|	РекламныеИсточники.Наименование = &Наименование";
		
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Возврат Результат.Ссылка;
		Иначе
			РекламныйИсточникОбъект = Справочники.РекламныеИсточники.СоздатьЭлемент();
			РекламныйИсточникОбъект.Наименование = Наименование;
			РекламныйИсточникОбъект.Записать();
			Возврат РекламныйИсточникОбъект.Ссылка;
		КонецЕсли;
		
	Исключение
		
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции

// Функция - Получить внутреннего менеджера
// 
// Параметры:
//  ВнешнийНомерТелефона - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьЛичногоМенеджераДляПереадресации(ВнешнийНомерТелефона, ОписаниеОшибки = "") Экспорт
		
	Контрагент = ПолучитьКонтрагентаСотрудникаПоНомеруТелефона(ВнешнийНомерТелефона);
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		ОписаниеОшибки = "Contractor is not found";
		Возврат Ложь;
	ИначеЕсли Не ЗначениеЗаполнено(Контрагент.Менеджер) Тогда
		ОписаниеОшибки = "Contractor has no responsible manager";
		Возврат Ложь;
	КонецЕсли;
	
	МассивТелефонныхАппаратовСотрудника = ПолучитьСтруктуруВнутреннегоНомераПоПользователю(Контрагент.Менеджер);
	Если МассивТелефонныхАппаратовСотрудника.Количество() = 0 Тогда
		ОписаниеОшибки = "Manager is offline";
		Возврат Ложь;
	ИначеЕсли Не ЗначениеЗаполнено(МассивТелефонныхАппаратовСотрудника[0].НомерТелефона) Тогда
		ОписаниеОшибки = "Number is not registred";
		Возврат Ложь;		
	КонецЕсли;
	
	Результат = Новый Структура("InternalNumberGroup, FIO, ID, Оборудование", "", "", "");
	Результат.InternalNumberGroup = Строка(МассивТелефонныхАппаратовСотрудника[0].НомерТелефона);
	Результат.FIO = Строка(Контрагент.Менеджер.Наименование);
	Результат.ID = Строка(Контрагент.Менеджер.УникальныйИдентификатор());
	Результат.Оборудование = МассивТелефонныхАппаратовСотрудника[0].Оборудование;
	
	Возврат Результат;
	
КонецФункции

// Функция - Получить активные СИБСТелефонным аппаратом
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьСписокАктивныхПользователей(ВнутреннийНомерТелефонаГруппы = Неопределено, ВыбратьВсехАктивныхСотрудников = Ложь) Экспорт
	
	// так же для группы, могут быть несколько пользователей 
	Если Не ЗначениеЗаполнено(ВнутреннийНомерТелефонаГруппы) И Не ВыбратьВсехАктивныхСотрудников Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТелефонныеАппараты.Ссылка КАК ТелефонныйАппарат,
	|	ТелефонныеАппараты.ВнутреннийНомер КАК ВнутреннийНомер,
	|	СоединенияИнформационнойБазы.Пользователь КАК Пользователь,
	|	СоединенияИнформационнойБазы.РабочееМесто КАК РабочееМесто
	|ПОМЕСТИТЬ ТелефоныПоРабочимМестам
	|ИЗ
	|	Справочник.ТелефонныеАппараты КАК ТелефонныеАппараты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТелефонныеАппараты.ОбъектыПривязки КАК ТелефонныеАппаратыРабочиеМеста
	|		ПО ТелефонныеАппараты.Ссылка = ТелефонныеАппаратыРабочиеМеста.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоединенияИнформационнойБазы КАК СоединенияИнформационнойБазы
	|		ПО (СоединенияИнформационнойБазы.РабочееМесто = (ВЫРАЗИТЬ(ТелефонныеАппаратыРабочиеМеста.Объект КАК Справочник.РабочиеМеста)))
	|ГДЕ
	|	ТелефонныеАппараты.ПометкаУдаления = ЛОЖЬ
	|	И ТелефонныеАппараты.ВнутреннийНомер <> """"
	|	И ВЫБОР
	|			КОГДА &НомерТелефона <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ТелефонныеАппараты.ВнутреннийНомер = &НомерТелефона
	|						ИЛИ ТелефонныеАппараты.Ссылка В ИЕРАРХИИ
	|							(ВЫБРАТЬ
	|								ТелефонныеАппараты.Ссылка
	|							ИЗ
	|								Справочник.ТелефонныеАппараты КАК ТелефонныеАппараты
	|							ГДЕ
	|								ТелефонныеАппараты.ВнутреннийНомер = &НомерТелефона
	|								И ТелефонныеАппараты.ЭтоГруппа)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ СоединенияИнформационнойБазы.Пользователь.Служебный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТелефонныеАппараты.Ссылка КАК ТелефонныйАппарат,
	|	ТелефонныеАппараты.ВнутреннийНомер КАК ВнутреннийНомер,
	|	СоединенияИнформационнойБазы.Пользователь КАК Пользователь,
	|	СоединенияИнформационнойБазы.РабочееМесто КАК РабочееМесто
	|ПОМЕСТИТЬ ТелефоныПоСотрудникам
	|ИЗ
	|	Справочник.ТелефонныеАппараты КАК ТелефонныеАппараты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТелефонныеАппараты.ОбъектыПривязки КАК ТелефонныеАппаратыРабочиеМеста
	|		ПО ТелефонныеАппараты.Ссылка = ТелефонныеАппаратыРабочиеМеста.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоединенияИнформационнойБазы КАК СоединенияИнформационнойБазы
	|		ПО (СоединенияИнформационнойБазы.Пользователь = (ВЫРАЗИТЬ(ТелефонныеАппаратыРабочиеМеста.Объект КАК Справочник.Сотрудники)))
	|ГДЕ
	|	ТелефонныеАппараты.ПометкаУдаления = ЛОЖЬ
	|	И ТелефонныеАппараты.ВнутреннийНомер <> """"
	|	И ВЫБОР
	|			КОГДА &НомерТелефона <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ТелефонныеАппараты.ВнутреннийНомер = &НомерТелефона
	|						ИЛИ ТелефонныеАппараты.Ссылка В ИЕРАРХИИ
	|							(ВЫБРАТЬ
	|								ТелефонныеАппараты.Ссылка
	|							ИЗ
	|								Справочник.ТелефонныеАппараты КАК ТелефонныеАппараты
	|							ГДЕ
	|								ТелефонныеАппараты.ВнутреннийНомер = &НомерТелефона
	|								И ТелефонныеАппараты.ЭтоГруппа)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ СоединенияИнформационнойБазы.Пользователь.Служебный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТелефоныПоСотрудникам.ТелефонныйАппарат КАК ТелефонныйАппарат,
	|	ТелефоныПоСотрудникам.ВнутреннийНомер КАК ВнутреннийНомер,
	|	ТелефоныПоСотрудникам.Пользователь КАК Пользователь,
	|	ТелефоныПоСотрудникам.РабочееМесто КАК РабочееМесто
	|ИЗ
	|	ТелефоныПоСотрудникам КАК ТелефоныПоСотрудникам
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТелефоныПоРабочимМестам.ТелефонныйАппарат,
	|	ТелефоныПоРабочимМестам.ВнутреннийНомер,
	|	ТелефоныПоРабочимМестам.Пользователь,
	|	ТелефоныПоРабочимМестам.РабочееМесто
	|ИЗ
	|	ТелефоныПоРабочимМестам КАК ТелефоныПоРабочимМестам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТелефоныПоСотрудникам КАК ТелефоныПоСотрудникам
	|		ПО ТелефоныПоРабочимМестам.РабочееМесто = ТелефоныПоСотрудникам.РабочееМесто
	|ГДЕ
	|	ТелефоныПоСотрудникам.ТелефонныйАппарат ЕСТЬ NULL");
	
	Запрос.УстановитьПараметр("НомерТелефона", ВнутреннийНомерТелефонаГруппы);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция - Получить список активных пользователей и групп
// 
// Параметры:
//  ВнутреннийНомерТелефонаГруппы	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьСписокАктивныхПользователейИГрупп(ВнутреннийНомерТелефонаГруппы = Неопределено) Экспорт
	
	// так же для группы, могут быть несколько пользователей 	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерТелефона", ВнутреннийНомерТелефонаГруппы);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТелефонныеАппараты.Ссылка КАК ТелефонныйАппарат,
	               |	ТелефонныеАппараты.ВнутреннийНомер КАК ВнутреннийНомер,
	               |	СоединенияИнформационнойБазы.Пользователь КАК Пользователь,
	               |	СоединенияИнформационнойБазы.РабочееМесто КАК РабочееМесто
	               |ПОМЕСТИТЬ ТелефоныПоРабочимМестам
	               |ИЗ
	               |	Справочник.ТелефонныеАппараты КАК ТелефонныеАппараты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТелефонныеАппараты.ОбъектыПривязки КАК ТелефонныеАппаратыРабочиеМеста
	               |		ПО ТелефонныеАппараты.Ссылка = ТелефонныеАппаратыРабочиеМеста.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоединенияИнформационнойБазы КАК СоединенияИнформационнойБазы
	               |		ПО (СоединенияИнформационнойБазы.РабочееМесто = (ВЫРАЗИТЬ(ТелефонныеАппаратыРабочиеМеста.Объект КАК Справочник.РабочиеМеста)))
	               |ГДЕ
	               |	ТелефонныеАппараты.ПометкаУдаления = ЛОЖЬ
	               |	И ТелефонныеАппараты.ВнутреннийНомер <> """"
	               |	И ВЫБОР
	               |			КОГДА &НомерТелефона <> НЕОПРЕДЕЛЕНО
	               |				ТОГДА ТелефонныеАппараты.ВнутреннийНомер = &НомерТелефона
	               |						ИЛИ ТелефонныеАппараты.Ссылка В ИЕРАРХИИ
	               |							(ВЫБРАТЬ
	               |								ТелефонныеАппараты.Ссылка
	               |							ИЗ
	               |								Справочник.ТелефонныеАппараты КАК ТелефонныеАппараты
	               |							ГДЕ
	               |								ТелефонныеАппараты.ВнутреннийНомер = &НомерТелефона
	               |								И ТелефонныеАппараты.ЭтоГруппа)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТелефонныеАппараты.Ссылка КАК ТелефонныйАппарат,
	               |	ТелефонныеАппараты.ВнутреннийНомер КАК ВнутреннийНомер,
	               |	СоединенияИнформационнойБазы.Пользователь КАК Пользователь,
	               |	СоединенияИнформационнойБазы.РабочееМесто КАК РабочееМесто
	               |ПОМЕСТИТЬ ТелефоныПоСотрудникам
	               |ИЗ
	               |	Справочник.ТелефонныеАппараты КАК ТелефонныеАппараты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТелефонныеАппараты.ОбъектыПривязки КАК ТелефонныеАппаратыРабочиеМеста
	               |		ПО ТелефонныеАппараты.Ссылка = ТелефонныеАппаратыРабочиеМеста.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоединенияИнформационнойБазы КАК СоединенияИнформационнойБазы
	               |		ПО (СоединенияИнформационнойБазы.Пользователь = (ВЫРАЗИТЬ(ТелефонныеАппаратыРабочиеМеста.Объект КАК Справочник.Сотрудники)))
	               |ГДЕ
	               |	ТелефонныеАппараты.ПометкаУдаления = ЛОЖЬ
	               |	И ТелефонныеАппараты.ВнутреннийНомер <> """"
	               |	И ВЫБОР
	               |			КОГДА &НомерТелефона <> НЕОПРЕДЕЛЕНО
	               |				ТОГДА ТелефонныеАппараты.ВнутреннийНомер = &НомерТелефона
	               |						ИЛИ ТелефонныеАппараты.Ссылка В ИЕРАРХИИ
	               |							(ВЫБРАТЬ
	               |								ТелефонныеАппараты.Ссылка
	               |							ИЗ
	               |								Справочник.ТелефонныеАппараты КАК ТелефонныеАппараты
	               |							ГДЕ
	               |								ТелефонныеАппараты.ВнутреннийНомер = &НомерТелефона
	               |								И ТелефонныеАппараты.ЭтоГруппа)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.ТелефонныйАппарат КАК ТелефонныйАппарат,
	               |	ВложенныйЗапрос.ВнутреннийНомер КАК ВнутреннийНомер,
	               |	ВложенныйЗапрос.ВнутреннийНомерРодителя КАК ВнутреннийНомерРодителя,
	               |	ВложенныйЗапрос.Пользователь КАК Пользователь,
	               |	ВложенныйЗапрос.РабочееМесто КАК РабочееМесто
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТелефоныПоСотрудникам.ТелефонныйАппарат КАК ТелефонныйАппарат,
	               |		ТелефоныПоСотрудникам.ВнутреннийНомер КАК ВнутреннийНомер,
	               |		ТелефоныПоСотрудникам.ТелефонныйАппарат.Родитель.ВнутреннийНомер КАК ВнутреннийНомерРодителя,
	               |		ТелефоныПоСотрудникам.Пользователь КАК Пользователь,
	               |		ТелефоныПоСотрудникам.РабочееМесто КАК РабочееМесто
	               |	ИЗ
	               |		ТелефоныПоСотрудникам КАК ТелефоныПоСотрудникам
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ТелефоныПоРабочимМестам.ТелефонныйАппарат,
	               |		ТелефоныПоРабочимМестам.ВнутреннийНомер,
	               |		ТелефоныПоРабочимМестам.ТелефонныйАппарат.Родитель.ВнутреннийНомер,
	               |		ТелефоныПоРабочимМестам.Пользователь,
	               |		ТелефоныПоРабочимМестам.РабочееМесто
	               |	ИЗ
	               |		ТелефоныПоРабочимМестам КАК ТелефоныПоРабочимМестам
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ТелефоныПоСотрудникам КАК ТелефоныПоСотрудникам
	               |			ПО ТелефоныПоРабочимМестам.РабочееМесто = ТелефоныПоСотрудникам.РабочееМесто
	               |	ГДЕ
	               |		ТелефоныПоСотрудникам.ТелефонныйАппарат ЕСТЬ NULL) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.ВнутреннийНомерРодителя,
	               |	ВложенныйЗапрос.Пользователь,
	               |	ВложенныйЗапрос.ТелефонныйАппарат,
	               |	ВложенныйЗапрос.ВнутреннийНомер,
	               |	ВложенныйЗапрос.РабочееМесто";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция - Получить активные СИБСТелефонным аппаратом
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьСтруктуруВнутреннегоНомераПоПользователю(Пользователь, ОбработчикДрайвера = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	РабочееМестоКлиента = ПараметрыСеанса.РабочееМестоКлиента;
	
	Если Не ЗначениеЗаполнено(РабочееМестоКлиента) Тогда
		РабочееМестоКлиента = РегистрыСведений.РабочиеМестаАктивныхПользователей.ПолучитьРабочееМесто(Пользователь);		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь"       , Пользователь);
	Запрос.УстановитьПараметр("РабочееМестоКлиента", РабочееМестоКлиента);
	Запрос.УстановитьПараметр("ОбработчикДрайвера" , ОбработчикДрайвера);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТелефонныеАппаратыОбъектыПривязки.Ссылка КАК ТелефонныйАппарат,
	               |	ТелефонныеАппаратыОбъектыПривязки.Ссылка.ВнутреннийНомер КАК НомерТелефона,
	               |	ТелефонныеАппаратыОбъектыПривязки.Ссылка.Оборудование КАК Оборудование
	               |ИЗ
	               |	Справочник.ТелефонныеАппараты.ОбъектыПривязки КАК ТелефонныеАппаратыОбъектыПривязки
	               |ГДЕ
	               |	((ВЫРАЗИТЬ(ТелефонныеАппаратыОбъектыПривязки.Объект КАК Справочник.Сотрудники)) = &Пользователь
	               |			ИЛИ (ВЫРАЗИТЬ(ТелефонныеАппаратыОбъектыПривязки.Объект КАК Справочник.РабочиеМеста)) = &РабочееМестоКлиента)
	               |	И ВЫБОР
	               |			КОГДА &ОбработчикДрайвера <> НЕОПРЕДЕЛЕНО
	               |				ТОГДА ТелефонныеАппаратыОбъектыПривязки.Ссылка.Оборудование.ДрайверОборудования.ОбработчикДрайвера = &ОбработчикДрайвера
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
		
	Результат = Запрос.Выполнить().Выгрузить();
	
	МассивТелефонныхАппаратовСотрудника = Новый Массив();
	
	Если Результат.Количество() > 0 Тогда
		Для Каждого СтрокаТЧ Из Результат Цикл
			СтруктураОтвета = СтрокуТаблицыЗначенийВСтруктуру(СтрокаТЧ, "ТелефонныйАппарат, НомерТелефона, Оборудование");
			СтруктураОтвета.Вставить("РабочееМесто", РабочееМестоКлиента);
			МассивТелефонныхАппаратовСотрудника.Добавить(СтруктураОтвета);
		КонецЦикла; 	
	КонецЕсли;
	
	Возврат МассивТелефонныхАппаратовСотрудника;
	
КонецФункции

// Функция - SHA256
// 
// Параметры:
//  СтрокаВычисленияКэша - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция SHA256(СтрокаВычисленияКэша, Алгоритм = "SHA_low_case") Экспорт

	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеширование.Добавить(СтрокаВычисленияКэша);
	
	Результат = "";
	Если Алгоритм = "Base64" Тогда
		Результат = Base64Строка(Хеширование.ХешСумма);
	ИначеЕсли Алгоритм = "SHA_low_case" Тогда
		Результат = Строка(Хеширование.ХешСумма);
		Результат = СтрЗаменить(Результат, " ", "");
		Результат = НРег(Результат);
	Иначе
		Результат = Строка(Хеширование.ХешСумма);
		Результат = СтрЗаменить(Результат, " ", "");
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Функция - SHA256
// 
// Параметры:
//  СтрокаВычисленияКэша - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПоместитьФайлВХранилищеФайлов(АдресВоВременномХранилище, ПользовательSip, НомерТелефона = "", ОписаниеОшибки = "") Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		ФайлДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
		
		СведенияОФайле = РаботаСФайламиКлиентСервер.СведенияОФайле("ФайлСВерсией");
		СведенияОФайле.АдресВременногоХранилищаФайла = АдресВоВременномХранилище;
		СведенияОФайле.ЗаписатьВИсторию 			 = Истина;
		СведенияОФайле.ИмяБезРасширения				 = "Запись разговора от " + Формат(ТекущаяДата(), "ДФ='yyyy.MM.dd HH-mm'") + " (" + ПользовательSip + ", " + НомерТелефона + ")";
		СведенияОФайле.РасширениеБезТочки			 = "Mp3";
		СведенияОФайле.Размер						 = ФайлДвоичныеДанные.Размер();
		
		ФайлСсылка = РаботаСФайламиСлужебныйВызовСервера.СоздатьФайлСВерсией(
						Справочники.ПапкиФайлов.ЗаписиТелефонныхРазговоров,
						СведенияОФайле);
		
	Исключение
		// ОписаниеОшибки = ФайловыеФункцииСлужебныйКлиентСервер.ОшибкаСозданияНовогоФайла(ИнформацияОбОшибке());
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ФайлСсылка;

КонецФункции

// Функция формирует и возвращает структуру заголовков POST-запроса
// 
Функция ПолучитьЗаголовкиPOSTЗапроса()
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type"	, "application/x-www-form-urlencoded");
	ЗаголовкиHTTP.Вставить("Content-Charset", "utf-8");
	ЗаголовкиHTTP.Вставить("outputencoding" , "utf-8");
	
	Возврат ЗаголовкиHTTP;
	
КонецФункции

// Функция возвращает измененный адрес сервера
// 
Функция ПреобразоватьАдресСервера(АдресСервера)
	
	СайтАдрес = СтрЗаменить(АдресСервера, "http://", "");
	СайтАдрес = СтрЗаменить(СайтАдрес	, "https://", "");
	СайтАдрес = СтрЗаменить(СайтАдрес	, "/vpbx", "");
	СайтАдрес = СтрЗаменить(СайтАдрес	, "/sys/crm_api.wcgp", "");
	СайтАдрес = СтрЗаменить(СайтАдрес	, "/start-call.php", "");
	
	Возврат СайтАдрес;
	
КонецФункции

// Функция возвращает JSON строку запроса
// 
Функция ПолучитьJSONСтрокуЗапроса(IPТелефонияПараметры, JSONText)
	
	Возврат ("vpbx_api_key=" + IPТелефонияПараметры.КодПродукта + "&"
					+ "sign=" + SHA256(IPТелефонияПараметры.КодПродукта + JSONText + IPТелефонияПараметры.Ключ, "SHA_low_case") + "&"
					+ "json=" + JSONText);
	
КонецФункции

// Функция - SHA256
// 
// Параметры:
//  СтрокаВычисленияКэша - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПривестиСтрокуВДатаCoMagic(ДатаСтрокой) Экспорт
	
	// 2014-12-10 17:17:14.055
	Возврат Дата(Сред(ДатаСтрокой, 1, 4), Сред(ДатаСтрокой, 6, 2), Сред(ДатаСтрокой, 9, 2), Сред(ДатаСтрокой, 12, 2), Сред(ДатаСтрокой, 15, 2), Сред(ДатаСтрокой, 18, 2));

КонецФункции

// Процедура - Актуализировать пропущенные звонки
// 
// Параметры:
//  Запись	 - 	 - 
// 
Процедура АктуализироватьПропущенныеЗвонки(Запись)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ИсторияВызовов.ОборудованиеТелефонии КАК ОборудованиеТелефонии,
	|	ИсторияВызовов.IDЗвонка КАК IDЗвонка
	|ИЗ
	|	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
	|ГДЕ
	|	ИсторияВызовов.IDЗвонка <> &IDЗвонка
	|	И ИсторияВызовов.НомерТелефона = &НомерТелефона
	|	И ИсторияВызовов.НеОбработан = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсторияВызовов.ОборудованиеТелефонии,
	|	ИсторияВызовов.IDЗвонка
	|ИЗ
	|	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
	|ГДЕ
	|	ИсторияВызовов.IDЗвонка <> &IDЗвонка
	|	И ИсторияВызовов.ПользовательSip = &НомерТелефона
	|	И ИсторияВызовов.НеОбработан = ИСТИНА");
	
	Запрос.УстановитьПараметр("IDЗвонка"		, Запись.IDЗвонка);
	Запрос.УстановитьПараметр("НомерТелефона"	, Запись.НомерТелефона);
	
	ВыборкаНеобработанных = Запрос.Выполнить().Выбрать();
	
	Если НЕ ВыборкаНеобработанных.Количество() = 0 Тогда 
		НаборЗаписейИсторииВызовов = РегистрыСведений.ИсторияВызовов.СоздатьНаборЗаписей(); 
	КонецЕсли;
	
	Пока ВыборкаНеобработанных.Следующий() Цикл 
		НаборЗаписейИсторииВызовов.Отбор.ОборудованиеТелефонии.Значение 		= ВыборкаНеобработанных.ОборудованиеТелефонии;
		НаборЗаписейИсторииВызовов.Отбор.ОборудованиеТелефонии.Использование 	= Истина;
		НаборЗаписейИсторииВызовов.Отбор.IDЗвонка.Значение 						= ВыборкаНеобработанных.IDЗвонка;
		НаборЗаписейИсторииВызовов.Отбор.IDЗвонка.Использование 				= Истина;
		
		НаборЗаписейИсторииВызовов.Прочитать();
		
		Если НаборЗаписейИсторииВызовов.Количество() > 0 Тогда
			НаборЗаписейИсторииВызовов[0].НеОбработан 							= Ложь;
			НаборЗаписейИсторииВызовов[0].ИдентификаторОбрабатывающего 			= Запись.IDЗвонка;
		КонецЕсли;
		НаборЗаписейИсторииВызовов.Записать();
	КонецЦикла;	
	
КонецПроцедуры

// Функция - Получить структуру XDTO телефона
// 
// Параметры:
//  Телефон	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьСтруктуру_XDTO(Представление, ТипКИ)
	
	Если НЕ ЗначениеЗаполнено(Представление) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Объект_XDTO = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOПоПредставлению(Представление, ТипКИ);
	Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда 
		Если НЕ ЗначениеЗаполнено(Объект_XDTO.Состав.Номер) Тогда 
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Объект_XDTO;
	
КонецФункции

// Функция - Получить таблицу не обработанных звонков
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьТаблицуНеОбработанныхЗвонков()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсторияВызовов.ПользовательSip,
	               |	СУММА(1) КАК КоличествоНеОбработанных
	               |ИЗ
	               |	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
	               |ГДЕ
	               |	ИсторияВызовов.НеОбработан = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИсторияВызовов.ПользовательSip";
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

// Функция - Вернуть представление номера телефона
// 
// Параметры:
//  СписокНомеровТелефонов	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ВернутьПредставлениеНомераТелефона(Знач СписокНомеровТелефонов)
	
	ПредставлениеНомера = "";
	
	Для Каждого ЭлементСписка Из СписокНомеровТелефонов	Цикл 
		Если ЭлементСписка.Пометка = Истина Тогда 
			ПредставлениеНомера = ЭлементСписка.Значение;
		    Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ПредставлениеНомера;
	
КонецФункции

// Функция - Вернуть описание ошибки
// 
// Параметры:
//  СтруктураОтвета		 - 	 - 
//  ВидФатальнойОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ВернутьОписаниеОшибки(СтруктураОтвета, ОшибкаПереадресации = "")
	
	ОтветHTTP 	   = СтруктураОтвета.ПолучитьТелоКакСтроку();
	
	ОписаниеОшибки = "Ошибка сервиса IP-телефонии: " + СтруктураОтвета.КодСостояния;
	Если СтруктураОтвета.КодСостояния >= 400 И СтруктураОтвета.КодСостояния < 500 Тогда 
		ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + "Ошибки 4XX говорят о неправильном запросе - в широком смысле
	 													|Может быть неправильный адрес, ошибка аутентификации, плохой формат запроса
	 													|Подробнее смотри http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html#sec10.4";
	ИначеЕсли СтруктураОтвета.КодСостояния >= 500 И СтруктураОтвета.КодСостояния < 600 Тогда 
		ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + "Ошибки 5XX говорят о проблемах на сервере (возможно, прокси-сервер)
	 													|Это может быть программная ошибка, нехватка памяти, ошибка конфигурации и т.д.
	 													|Подробнее смотри http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html#sec10.5";
	ИначеЕсли СтруктураОтвета.КодСостояния >= 300 И СтруктураОтвета.КодСостояния < 400  Тогда
		ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + ОшибкаПереадресации;
	КонецЕсли;
	Если ТипЗнч(ОтветHTTP) = Тип("ЧтениеJSON") Тогда 
		ПараметрыJSON  = ?(ОтветHTTP <> "", ДекодироватьИзJSON(ОтветHTTP), Новый Структура);
		Если ПараметрыJSON.Свойство("Message") Тогда
			ОписаниеОшибки = ОписаниеОшибки + " (" + ПараметрыJSON.Message + ")";
		КонецЕсли;		
	КонецЕсли;	
	
	Возврат ОписаниеОшибки;
	
КонецФункции

// Функция - Проверить возможность звонка на данном ПК
// 
// Возвращаемое значение:
//   - 
// 
Функция ПроверитьВозможностьЗвонкаНаДанномПК() Экспорт
	
	Возврат Справочники.ТелефонныеАппараты.ПроверитьВозможностьЗвонкаНаДанномПК();
	
КонецФункции

// Функция - Определить подключаемое оборудование
// 
// Параметры:
//  ТипОборудования	 - 	 - 
//  Логин			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ОпределитьПодключаемоеОборудование(ТипОборудования, Логин = "") Экспорт
	
	Результат = Неопределено;
		
	// Получение подклчаемого оборудования
	ТаблицаПодключаемогоОборудованияТелефонии = ПолучитьСписокОборудованияIPТелефонии();
	Для Каждого СтрТаблицы ИЗ ТаблицаПодключаемогоОборудованияТелефонии Цикл
		
		Если СтрТаблицы.ОбработчикДрайвера <> ТипОборудования Тогда
			Продолжить
		КонецЕсли;
		
		Результат = СтрТаблицы.Ссылка;
		Прервать;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция - Получить параметры оборудования
// 
// Параметры:
//  Оборудование - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьПараметрыОборудования(Оборудование) Экспорт 
	
	ПараметрыОборудования = Новый Структура("Сервер, Пароль");
	Если ТипЗнч(Оборудование) = Тип("СправочникСсылка.ПодключаемоеОборудование") Тогда 
		ПараметрыОборудования =Оборудование.Параметры.Получить(); 
	КонецЕсли;
	
	Возврат ПараметрыОборудования; 
	
	
КонецФункции

// Процедура - Записать рабочее место сотрудника
// 
Процедура ОбновитьПоследниююАктивностьПользователя() Экспорт 	
	РегистрыСведений.РабочиеМестаАктивныхПользователей.ОбновитьПоследниююАктивностьПользователя();
КонецПроцедуры

// Функция - Получить оборудивание телефонного аппарата
// 
// Параметры:
//  Номер	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьОборудиваниеТелефонногоАппарата(ВнутреннийНомер) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТелефонныеАппараты.Оборудование КАК Оборудование
	|ИЗ
	|	Справочник.ТелефонныеАппараты КАК ТелефонныеАппараты
	|ГДЕ
	|	НЕ ТелефонныеАппараты.ПометкаУдаления
	|	И ТелефонныеАппараты.ВнутреннийНомер = &ВнутреннийНомер");
	
	Запрос.УстановитьПараметр("ВнутреннийНомер", ВнутреннийНомер);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Оборудование");
	
	Возврат  ?(Результат.Количество() > 0, Результат[0], Справочники.ПодключаемоеОборудование.ПустаяСсылка());	
	
КонецФункции

// Функция - Получить список оборудования IPТелефонии
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСписокОборудованияIPТелефонии()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодключаемоеОборудование.Ссылка КАК Ссылка,
	|	ПодключаемоеОборудование.ДрайверОборудования.ОбработчикДрайвера КАК ОбработчикДрайвера
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.УстройствоИспользуется
	|	И ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.IPТелефония)
	|	И НЕ ПодключаемоеОборудование.ПометкаУдаления");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция - Сформировать массив номеров телефонов по контрагенту
//
// Параметры:
//  Контрагент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьМассивНомеровТелефоновПоКонтрагентуИлиТелефону(Контрагент = Неопределено, Знач НомерТелефона = Неопределено) Экспорт
	
	// Либо передаем контрагента и по нему формируется список телефонов, либо передаем НомерТелефона и формируем список по конкретному номеру
	
	МассивНомеровТелефонов = Новый Массив;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтрагентыКонтактнаяИнформация.Представление КАК НомерТелефонаПредставление
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
		|	И КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)");
		
		Запрос.УстановитьПараметр("Контрагент", Контрагент);    
		
		Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерТелефонаПредставление");	
		
		Для Каждого НомерТелефона Из Результат Цикл  								
			ДобавитьНомераТелефоновВМассив(НомерТелефона, МассивНомеровТелефонов);			
		КонецЦикла;
		
	ИначеЕсли ЗначениеЗаполнено(НомерТелефона) Тогда		
		ДобавитьНомераТелефоновВМассив(НомерТелефона, МассивНомеровТелефонов, Истина);				
	КонецЕсли;
	
	Возврат МассивНомеровТелефонов;
	
КонецФункции

// Процедура - Добавить номера телефонов в массив
//
// Параметры:
//  НомерТелефона			 - 	 - 
//  МассивНомеровТелефонов	 - 	 - 
//
Процедура ДобавитьНомераТелефоновВМассив(НомерТелефона, МассивНомеровТелефонов, ПреобразоватьНомерТелефона = Ложь)
	
	МассивНомеровТелефонов.Добавить(УправлениеКонтактнойИнформацией.ВернутьТелефонТолькоЦифрами(НомерТелефона));
	
	Если ПреобразоватьНомерТелефона Тогда
		УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(НомерТелефона, Новый СписокЗначений);
	КонецЕсли;
	
	Объект_XDTO_Телефон = ПолучитьСтруктуру_XDTO(СокрЛП(НомерТелефона), Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	Если Объект_XDTO_Телефон <> Неопределено Тогда
		
		МассивНомеровТелефонов.Добавить(Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
		МассивНомеровТелефонов.Добавить(Объект_XDTO_Телефон.Представление);
		
		КодСтраны = Константы.СтранаУчета.Получить().Код;
		
		Если КодСтраны = "804" Тогда
			МассивНомеровТелефонов.Добавить("38"  + Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
			МассивНомеровТелефонов.Добавить("+38" + Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
		ИначеЕсли КодСтраны = "051" Тогда
			МассивНомеровТелефонов.Добавить("374"  + Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
			МассивНомеровТелефонов.Добавить("+374" + Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);	
		Иначе
			МассивНомеровТелефонов.Добавить("0"  + Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
			МассивНомеровТелефонов.Добавить("8"  + Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
			МассивНомеровТелефонов.Добавить("7"  + Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
			МассивНомеровТелефонов.Добавить("+7" + Объект_XDTO_Телефон.Состав.КодГорода + Объект_XDTO_Телефон.Состав.Номер);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция, преобразует строку в дату.
//
Функция ПолучитьДату(СтроковаяДата)
	
	Попытка
		
		СтроковаяДата = СтрЗаменить(СтроковаяДата , "-","");
		СтроковаяДата = СтрЗаменить(СтроковаяДата , ":","");
		СтроковаяДата = СтрЗаменить(СтроковаяДата , " ","");
		
		Возврат Дата(СтроковаяДата);
		
	Исключение
		Возврат Неопределено;		
	КонецПопытки;
	
КонецФункции

#КонецОбласти

