
 #Область СлужебныеПроцедурыИФункции
 
&НаСервере
// Функция возвращает рабочее место клиента
//
Функция РабочееМестоУстройства(Устройство)

	Возврат Устройство.РабочееМесто;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события ПриСозданииНаСервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Запись.РабочееМесто = Справочники.РабочиеМеста.ПустаяСсылка() Тогда
		Запись.РабочееМесто = ПараметрыСеанса.РабочееМестоКлиента;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события ОбработкаВыбора
//
Процедура УстройствоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если РабочееМестоУстройства(ВыбранноеЗначение) = Запись.РабочееМесто Тогда
		СтандартнаяОбработка = Ложь;
		ТекстСообщения = НСтр("ru = 'Выбранное устройство уже привязано к данному рабочему месту!
		                            |Укажите удаленное устройство для использования по сети'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , );
	КонецЕсли;

КонецПроцедуры

#КонецОбласти