	
#Область ОбработчикиКомандФормы	
	
&НаКлиенте
//
//
Процедура СоздатьПоСкладу(Команда)
	
	СоздатьСписаниеЗапасов(0);
	
КонецПроцедуры

&НаКлиенте
// Процедура создает новый документ "Расходный кассовый ордер".
//
Процедура СоздатьСписаниеЗапасов(ИндексОперации)
	
	ВидОперации = СписокОпераций[ИндексОперации].Значение;
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Основание", Новый Структура("ВидОперации, Отбор", ВидОперации, Новый Структура("Склад", СкладСотрудникОтбор)));
	// СтруктураПараметры.Вставить("Отбор", Новый Структура("Склад", СкладСотрудникОтбор));				
	ОткрытьФорму("Документ.СписаниеЗапасов.ФормаОбъекта", СтруктураПараметры);
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура СоздатьПоСотруднику(Команда)
	СоздатьСписаниеЗапасов(1);
КонецПроцедуры

&НаСервере
//
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокОпераций.Добавить(Перечисления.ВидыОпераций.ПоСкладу);
	СписокОпераций.Добавить(Перечисления.ВидыОпераций.ПоСотруднику);
	СтрЕдиницаОтбор = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница; 
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтрЕдиницаОтбор, ЗначениеЗаполнено(СтрЕдиницаОтбор));
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля СтрЕдиницаОтбор
//
Процедура СтрЕдиницаОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтрЕдиницаОтбор, ЗначениеЗаполнено(СтрЕдиницаОтбор));
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ВидОперацииОтбор
//
Процедура ВидОперацииОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ВидОперации", ВидОперацииОтбор, ЗначениеЗаполнено(ВидОперацииОтбор));
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля СкладСотрудникОтбор
//
Процедура СкладСотрудникОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Склад", СкладСотрудникОтбор, ЗначениеЗаполнено(СкладСотрудникОтбор));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - обработка команды "Создать"
//
Процедура КомандаСоздать(Команда)
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить("ПоСкладу", "По складу");
	СписокКнопок.Добавить("ПоПерсоналу", "По персоналу");
	
	Оповещение = Новый ОписаниеОповещения("КомандаСоздатьОбработкаВыбора", ЭтотОбъект, СписокКнопок);									
	ПоказатьВыборИзМеню(Оповещение, СписокКнопок, ТекущийЭлемент);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик выбора при нажатии на кнопку "Создать"
//
Процедура КомандаСоздатьОбработкаВыбора(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Значение = "ПоСкладу" Тогда
		СоздатьПоСкладу(Неопределено);	
		
	ИначеЕсли Результат.Значение = "ПоПерсоналу" Тогда
		СоздатьПоСотруднику(Неопределено);
				
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура печати.
//
Процедура ДокументПечать(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "СписаниеЗапасов");	
	Структура.Вставить("МассивДокументов", Элементы.Список.ВыделенныеСтроки);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ОбработкаКоманды", УправлениеПечатьюКлиентСтоматология, Структура);									

	ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, ТекущийЭлемент);

КонецПроцедуры

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()                           	
	Возврат Документы.СписаниеЗапасов.ПолучитьСписокПечатныхФорм();	
КонецФункции

#КонецОбласти