
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью" объекта
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ОбновлениеБезПроведения") Тогда
		Возврат;
	КонецЕсли;
		
	ЭтотОбъект.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	// Очищает ТЧ списания дней и закрытия членства
	СписаниеНачисленийБонусныхСчетов.Очистить();
	ЗакрытиеБонусныхСчетов.Очистить();
	
	// Заполняем табличные части по которым пойдут списания
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		ИЛИ РежимЗаписи = РежимЗаписиДокумента.Запись И Проведен = Истина Тогда
			
		Если Статус = Перечисления.СтатусыРабочегоДня.Закрыт Тогда
			ЗаполнитьЗакрытиеБонусныхСчетов();
			ЗаполнитьСписаниеНачисленийБонусныхСчетов();
		КонецЕсли;
	КонецЕсли;
	
	// ПостОбработка справочника БонусныеСчета
	ЗакрытьОтменитьЗакрытиеБонусныхСчетов(РежимЗаписи);
	 
КонецПроцедуры

// Процедура - При записи
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;  	
		
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ОбновлениеБезПроведения") Тогда
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаПроведения" объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ДвиженияДокументовСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.	
	Документы.ЗакрытиеДня.УстановитьНачальныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Движения по регистрам
	ДвиженияДокументовСервер.БонусныеСчета(ДополнительныеСвойства, Движения, Отказ);	
	
	// Запись наборов записей.
	ДвиженияДокументовСервер.ДобавитьНаборыЗаписей(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура, заполняет ТЧ истекшими начислениями бонусных счетов.
//
Процедура ЗаполнитьСписаниеНачисленийБонусныхСчетов(БонусныйСчетАктуализации = Неопределено, ПериодОстатков = Неопределено)
	
	Запрос = Новый Запрос;
	Если БонусныйСчетАктуализации = Неопределено Тогда
		МассивОтборБонусныхСчетов = ЗакрытиеБонусныхСчетов.ВыгрузитьКолонку("БонусныйСчет");
	Иначе
		МассивОтборБонусныхСчетов = Новый Массив;
		МассивОтборБонусныхСчетов.Добавить(БонусныйСчетАктуализации);
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка"				, Ссылка);	
	Запрос.УстановитьПараметр("МассивБонусныхСчетов", МассивОтборБонусныхСчетов);	
	Запрос.УстановитьПараметр("ДатаЗакрытияДня"		, НачалоДня(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата())));	
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БонусныеСчетаОстатки.ДокументНачисления КАК ДокументНачисления,
	|	БонусныеСчетаОстатки.БонусныйСчет КАК БонусныйСчет,
	|	СУММА(БонусныеСчетаОстатки.СуммаОборот) КАК Сумма
	|ИЗ
	|	РегистрНакопления.БонусныеСчета.Обороты(
	|			,
	|			&ПериодОстатков,
	|			Запись,
	|			БонусныйСчет В (&МассивБонусныхСчетов)
	|				ИЛИ НЕ БонусныйСчет В (&МассивБонусныхСчетов)
	|					И БонусныйСчет.ОграничениеНачисленийПоСрокуДействия <> ЗНАЧЕНИЕ(Перечисление.ТипыОграниченийСрокаДействия.Бессрочный)
	|					И ВЫБОР
	|						КОГДА БонусныйСчет.СрокДействияНачисленийТип = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	|							ТОГДА ДОБАВИТЬКДАТЕ(ДокументНачисления.Дата, ДЕНЬ, БонусныйСчет.СрокДействияНачислений) <= НАЧАЛОПЕРИОДА(&ДатаЗакрытияДня, ДЕНЬ)
	|						КОГДА БонусныйСчет.СрокДействияНачисленийТип = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|							ТОГДА ДОБАВИТЬКДАТЕ(ДокументНачисления.Дата, МЕСЯЦ, БонусныйСчет.СрокДействияНачислений) <= НАЧАЛОПЕРИОДА(&ДатаЗакрытияДня, ДЕНЬ)
	|						КОГДА БонусныйСчет.СрокДействияНачисленийТип = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
	|							ТОГДА ДОБАВИТЬКДАТЕ(ДокументНачисления.Дата, ГОД, БонусныйСчет.СрокДействияНачислений) <= НАЧАЛОПЕРИОДА(&ДатаЗакрытияДня, ДЕНЬ)
	|					КОНЕЦ) КАК БонусныеСчетаОстатки
	|ГДЕ
	|	БонусныеСчетаОстатки.Регистратор <> &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	БонусныеСчетаОстатки.ДокументНачисления,
	|	БонусныеСчетаОстатки.БонусныйСчет
	|
	|ИМЕЮЩИЕ
	|	СУММА(БонусныеСчетаОстатки.СуммаОборот) > 0";
	
	Если ЗначениеЗаполнено(ПериодОстатков) Тогда 
		Запрос.УстановитьПараметр("ПериодОстатков", ПериодОстатков);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПериодОстатков", "");
	КонецЕсли;   
	
	Если ЗначениеЗаполнено(БонусныйСчетАктуализации) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИЛИ НЕ БонусныйСчет В (&МассивБонусныхСчетов)", "");	
	КонецЕсли;
		
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если БонусныйСчетАктуализации = Неопределено Тогда
		СписаниеНачисленийБонусныхСчетов.Загрузить(РезультатЗапроса);
	Иначе
		// заменяем строки для конкретного бонусного счета.
	 	МассивУдаления = СписаниеНачисленийБонусныхСчетов.НайтиСтроки(Новый Структура("БонусныйСчет", БонусныйСчетАктуализации));
		Для Каждого ЭлементМ Из МассивУдаления Цикл
			СписаниеНачисленийБонусныхСчетов.Удалить(ЭлементМ);			
		КонецЦикла;
		
		Для Каждого СтрокаТЗ Из РезультатЗапроса Цикл
			ЗаполнитьЗначенияСвойств(СписаниеНачисленийБонусныхСчетов.Добавить(), СтрокаТЗ);			
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

// Процедура, заполняет ТЧ истекшими бонусными счетами.
//
Процедура ЗаполнитьЗакрытиеБонусныхСчетов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БонусныеСчета.Ссылка КАК БонусныйСчет,
	|	БонусныеСчета.ВладелецБонусногоСчета КАК Владелец,
	|	ИСТИНА КАК Закрыт
	|ИЗ
	|	Справочник.БонусныеСчета КАК БонусныеСчета
	|ГДЕ
	|	БонусныеСчета.ПометкаУдаления = ЛОЖЬ
	|	И НЕ БонусныеСчета.Закрыт
	|	И НЕ БонусныеСчета.СрокДействияКонец = ДАТАВРЕМЯ(1, 1, 1)
	|	И НАЧАЛОПЕРИОДА(БонусныеСчета.СрокДействияКонец, ДЕНЬ) <= &СрокДействияКонец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗакрытиеДняЗакрытиеБонусныхСчетов.БонусныйСчет,
	|	ЗакрытиеДняЗакрытиеБонусныхСчетов.Владелец,
	|	ЗакрытиеДняЗакрытиеБонусныхСчетов.Закрыт
	|ИЗ
	|	Документ.ЗакрытиеДня.ЗакрытиеБонусныхСчетов КАК ЗакрытиеДняЗакрытиеБонусныхСчетов
	|ГДЕ
	|	ЗакрытиеДняЗакрытиеБонусныхСчетов.Ссылка = &Ссылка";
				   
	Запрос.УстановитьПараметр("Ссылка"				, Ссылка);			   
	Запрос.УстановитьПараметр("СрокДействияКонец"	, НачалоДня(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата())));

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ЗакрытиеБонусныхСчетов.Загрузить(РезультатЗапроса);
	
КонецПроцедуры // ЗаполнитьЗакрытиеЧленствПакетовУслуг

// Процедура, закрывает бонусные счета.
//
Процедура ЗакрытьОтменитьЗакрытиеБонусныхСчетов(РежимЗаписи)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Для Каждого СтрокаТЧ Из ЗакрытиеБонусныхСчетов Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.БонусныйСчет)
					И (РежимЗаписи = РежимЗаписиДокумента.Проведение И СтрокаТЧ.БонусныйСчет.Закрыт <> Истина
						ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения И СтрокаТЧ.БонусныйСчет.Закрыт = Истина) Тогда
				БонусныйСчетОбъект = СтрокаТЧ.БонусныйСчет.ПолучитьОбъект();
				БонусныйСчетОбъект.Закрыт = (РежимЗаписи = РежимЗаписиДокумента.Проведение);
				БонусныйСчетОбъект.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
