
#Область СлужебныеПроцедурыИФункции

// Процедура обработчик редактирования кэщ списка
Процедура ОбработчикВызоваФормыРедактированияКэшСписка(Элемент,Форма) Экспорт
	
 	 ПараметрыФормы = Новый Структура("ИдентификаторПоля",Форма.ИмяФормы + "." +Элемент.Имя); 
	 Оповещение = Новый ОписаниеОповещения("ПослеВыбораПользователяКэшЛист", Форма);
	 ОбновитьСписокВыбораЭлемента(Элемент,Форма);
	 ОткрытьФорму("ОбщаяФорма.ФормаРедактированияСохраняемыхЗначений", ПараметрыФормы,,,,,Оповещение);
	 
КонецПроцедуры

// Процедура обновит список выбора элемента
Процедура ОбновитьСписокВыбораЭлемента(Элемент,Форма)
	
	СписокИсторииВвода = СохранениеВводимыхЗначений.ПолучитьСписокЗначенийИсторииВвода(Форма.ИмяФормы + "." + Элемент.Имя);			
	Если СписокИсторииВвода <> Неопределено Тогда
		
		СписокВыбора               = Элемент.СписокВыбора;		
		Элемент.КнопкаСпискаВыбора = ?(СписокИсторииВвода.Количество() > 0, Истина, Ложь);
		Элемент.КнопкаВыбора       =  ?(СписокИсторииВвода.Количество() > 0, Истина, Ложь);
		
		СписокВыбора.Очистить();
		Для Каждого ЭлементСпискаИсторииВыбора Из СписокИсторииВвода Цикл		
			НовыйЭлемент          = СписокВыбора.Добавить();
			НовыйЭлемент.Значение = ЭлементСпискаИсторииВыбора.Значение;			
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти