
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщееКоличествоАдресатов = Объект.ПолучателиПисьма.Количество();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрерватьОтправку(Команда)
	// Пока просто закрываем форму
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ВыполнитьОтправку", 0.01, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОтправку()
	
	Для каждого СтрокаПолучателя Из Объект.ПолучателиПисьма Цикл
		
		ТекущийАдресат = СтрокаПолучателя.НомерСтроки;
		Элементы.ТекстХодаОперации.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы.ТекстХодаОперации.Заголовок,
													ТекущийАдресат,
													ОбщееКоличествоАдресатов);
		ОбновитьИнтерфейс();										
		ОписаниеОшибки = "";
		ВыполнитьОтправкуНаСервере(ОписаниеОшибки);
		
	КонецЦикла;
												
	Закрыть(Истина);											
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьОтправкуНаСервере(ОписаниеОшибки)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Результат = Документы.ЭлектронноеПисьмоИсходящее.ВыполнитьОтправкуПисьма(ТекущийОбъект, ОписаниеОшибки, 1, ТекущийАдресат);
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	
	Возврат Результат;

КонецФункции

#КонецОбласти