
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТекстЗаметки"       , ТекстЗаметки);
	Параметры.Свойство("НавигационнаяСсылка", НавигационнаяСсылка);
		
	Если Параметры.Свойство("Заголовок") Тогда
		Параметры.Свойство("Заголовок", Заголовок);
	КонецЕсли;
	
	Если Параметры.Свойство("Контрагент") Тогда
		Запись.Объект = Параметры.Контрагент;
	КонецЕсли;
	
	Если Параметры.Свойство("ВзаимодействиеСделка") и Параметры.Свойство("Заголовок") И Параметры.Заголовок = "Редактирование заметки" Тогда
		ЭтотОбъект.ВзаимодействиеСделка = Параметры.ВзаимодействиеСделка;
		Элементы.ГруппаВаимодействиеСделкаПеремещаемая.Видимость = Ложь;
		//УстановитьАктуальнуюСделкуВзаимодействия();
	ИначеЕсли Параметры.Свойство("ВзаимодействиеСделка") Тогда
		ЭтотОбъект.ВзаимодействиеСделка = Параметры.ВзаимодействиеСделка;
		Элементы.ГруппаВаимодействиеСделкаПеремещаемая.Видимость = Истина;
		УстановитьАктуальнуюСделкуВзаимодействия();

	КонецЕсли;
		
	Элементы.ГруппаВаимодействиеСделкаПредставление.Видимость = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Редактировать заметку.
//
Процедура РедактироватьЗаметку(Команда)
	
	Закрыть(Новый Структура("ТекстЗаметки, УИД, ВзаимодействиеСделка", ТекстЗаметки, НавигационнаяСсылка, ЭтотОбъект.ВзаимодействиеСделка));	
	//Закрыть(Новый Структура("ТекстЗаметки, НавигационнаяСсылка, ВзаимодействиеСделка", ТекстЗаметки, НавигационнаяСсылка, ЭтотОбъект.ВзаимодействиеСделка));	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор сделки взаимодействия.
//
Процедура ВыборСделкиВзаимодействия(Команда)
	
	Если ТипЗнч(Запись.Объект) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(Запись.Объект) Тогда
		
		СписокВыбора = ВернутьСписокСделокКлиента(Запись.Объект);
		
		Если ЗначениеЗаполнено(СписокВыбора) Тогда
			
			Оповещение = Новый ОписаниеОповещения("ОбработчикВыбораСделкиВзаимодействия", ЭтотОбъект);
			ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Элементы.ВзаимодействиеСделка);
		Иначе
			ПоказатьПредупреждение(, НСтр("ru='Нет доступных сделок!';en='Not available deals!'"));
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция - Вернуть список сделок контрагента.
// 
Функция ВернутьСписокСделокКлиента(Контрагент)
		
	СписокСделок = Новый СписокЗначений;
	
	ТаблицаСделок = ПолучитьСделкиКлиента(Контрагент, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	Для Каждого СтрокаТ Из ТаблицаСделок Цикл
				
		ПараметрыСделки = Новый Структура;
		ПараметрыСделки.Вставить("Сделка"   , СтрокаТ.Ссылка);
		ПараметрыСделки.Вставить("ЦветЭтапа", СтрокаТ.ЦветЭтапа);
		
		СписокСделок.Добавить(ПараметрыСделки, СтрокаТ.Наименование);	
		
	КонецЦикла;	
		
	Возврат СписокСделок; 
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает сделки по контрагенту.
//
Функция ПолучитьСделкиКлиента(Контрагент, СтруктурнаяЕдиница = Неопределено)
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сделки.Ссылка КАК Ссылка,
	|	Сделки.Наименование КАК Наименование,
	|	Сделки.ЭтапСделки КАК ЭтапСделки,
	|	Сделки.ЭтапСделки.ЦветЭтапа КАК ЦветЭтапа
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Сделки.Контрагент = &Контрагент
	|	И НЕ Сделки.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделки.ДатаСделки");
	
	Если НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда 
		МассивСтруктурныхЕдиниц = Справочники.СтруктурныеЕдиницы.ВернутьМассивСтруктурныхЕдиниц(, Истина);
		Если МассивСтруктурныхЕдиниц.Найти(Справочники.СтруктурныеЕдиницы.ПустаяСсылка()) = Неопределено Тогда 
			МассивСтруктурныхЕдиниц.Добавить(Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
		КонецЕсли;		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "Сделки.СтруктурнаяЕдиница В(&СтруктурнаяЕдиница)");
	КонецЕсли; 
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, МассивСтруктурныхЕдиниц));
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции 

&НаКлиенте
// Процедура - Обработка сделки взаимодействия клиента завершение.
//
Процедура ОбработчикВыбораСделкиВзаимодействия(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		УстановитьСостояниеЭлементовСделкиВзаимодействия(Результат.Значение.Сделка, Результат.Значение.ЦветЭтапа);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Обработчик выбора сделки взаимодействия сервер.
//
// Параметры:
//  Сделка		 - 	 - 
//  ЦветЭтапа	 - 	 - 
//
Процедура УстановитьСостояниеЭлементовСделкиВзаимодействия(Сделка, ЦветЭтапа)
	
	ЦветФона = ?(ЗначениеЗаполнено(ЦветЭтапа), ЗначениеИзСтрокиВнутр(ЦветЭтапа), Новый Цвет());
	ЦветФона = ?(ЦветФона = Новый Цвет(), Новый Цвет(214, 234, 255), ЦветФона);
	
	Представление = ?(ЗначениеЗаполнено(Сделка), Строка(Сделка), НСтр("ru='Выбрать сделку';en='Select a deal'"));
	
	ЭтотОбъект.ВзаимодействиеСделка                          = Сделка; 
	Элементы.ВзаимодействиеСделка.Заголовок                  = Представление;
	ЭтаФорма.Команды["ВзаимодействиеСделка"].Подсказка       = Представление;
	Элементы.ГруппаВаимодействиеСделкаПредставление.ЦветФона = ЦветФона;
	Элементы.ВзаимодействиеСделка.ЦветТекста                 = ОбщегоНазначения.ПолучитьЦветТекстаПоЦветуФона(ЦветФона);

КонецПроцедуры

&НаСервере
// Процедура - Установить актуальную сделку взаимодействия.
//
Процедура УстановитьАктуальнуюСделкуВзаимодействия()
	
	// Установить актуальную сделку клиента.
	ЭтотОбъект.ВзаимодействиеСделка = Справочники.Сделки.ПолучитьАктуальнуюСделкуКлиента(Запись.Объект);
	
	УстановитьСостояниеЭлементовСделкиВзаимодействия(
		ЭтотОбъект.ВзаимодействиеСделка, 
		?(ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеСделка), ЭтотОбъект.ВзаимодействиеСделка.ЭтапСделки.ЦветЭтапа, Неопределено)
	);

КонецПроцедуры

#КонецОбласти
