
#Область ОписаниеПеременных

&НаКлиенте
Перем ИмяФайлаДляСохранения; // Полный путь к файлу загруженного дистрибутива СЛК

#КонецОбласти

#Область Обработчики_Событий_формы
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Если ВебКлиент Тогда
		Возврат;      	
	#КонецЕсли
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ВерсияСервераСЛК = ОпределитьВерсиюСервераСЛК();
	
	ЗаписьЖурналаРегистрации("Обновление СЛК", УровеньЖурналаРегистрации.Информация,,,НСтр("ru = 'Открытие помощника обновления СЛК...'"));
	// Пользователи.ПрерватьВыполнениеЕслиАвторизованВнешнийПользователь();
	
	ОписаниеОбновления = ПроверитьНаличиеТребуемойВерсииСЛК();
	
	Страницы = Элементы.Страницы.ПодчиненныеЭлементы;
	ИмяСтраницы = Страницы.СтраницаЗагрузкиОбновления.Имя;
	
	Если ОписаниеОбновления.КодСостояния = 501 Тогда // Обновление найдено
		Элементы.НадписьДоступноеОбновление.Заголовок = НСтр("ru = 'Версия'") + " " + ОписаниеОбновления.ВерсияСЛК;
		Элементы.НадписьРазмерОбновления.Заголовок = Строка(ОписаниеОбновления.РазмерФайла / (1024*1024)) + " Мбайт"; // Строка(РаботаСФайламиКлиентСервер.РазмерФайлаВКилоМегаГигаБайтах(ОписаниеОбновления.РазмерФайла, 2)) + " Мбайт";
	Иначе
		ИмяСтраницы = Страницы.СтраницаСообщенияОбОшибке.Имя;
		ПредставлениеОшибки = "Не удалось получить сведения о доступных обновлениях на сервере.";
		ТекстОшибки = ДополнитьОписаниеОшибки(ОписаниеОбновления.ОписаниеСостояния);
	КонецЕсли;
	
	// ++ Привелигированный режим
	УстановитьПривилегированныйРежим(Истина);
	
	ЗначениеХранилища = Константы.СтатусОбновленияКонфигурации.Получить();
	ОбновлениеВыполнено = Ложь;
	Если ЗначениеХранилища <> Неопределено Тогда
		СтатусОбновления = ЗначениеХранилища.Получить();
		ОбновлениеВыполнено = ?(СтатусОбновления = Неопределено, Ложь, СтатусОбновления.ОбновлениеВыполнено);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	// -- Привелигированный режим
	
	Элементы.Страницы.ТекущаяСтраница = Страницы[ИмяСтраницы];
	ПриИзмененииСтраницы();
	
	ОбновлениеУспешноПолучено = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЗаголовокФормы();
	
КонецПроцедуры

&НаСервере
////////////////////////////////////////////////////////////////////////////////
//
// Процедура ПриИзмененииСтраницы
//
// Описание: Производит необходимые действия при изменении страницы
//
Процедура ПриИзмененииСтраницы()
	
	Страницы = Элементы.Страницы;
	
	Если Страницы.ТекущаяСтраница = Страницы.ПодчиненныеЭлементы.ОбновлениеУспешноЗагружено Тогда
		
		МожноУстанавливать = СерверСЛКНаходитсяНаЭтомКомпьютере();
		
		Элементы.УстановитьОбновление.Видимость 			  = МожноУстанавливать;
		Элементы.НадписьПояснение.Видимость 				  = Не МожноУстанавливать;
		Элементы.НадписьПояснениеМожноУстанавливать.Видимость = МожноУстанавливать;
		
	КонецЕсли;
	
	ОбновитьЗаголовокФормы();
	
КонецПроцедуры // ПриИзмененииСтраницы

#КонецОбласти // Обработчики_Событий_формы

#Область Обработчики_Команд
// Обработчики команд формы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПапкуЗагрузки(Команда)
	Если СокрЛП(ПутьДляСохранения) <> "" Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗапускаПриложения",,,, ЭтотОбъект);
		НачатьЗапускПриложения(Оповещение, ПутьДляСохранения);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
// Процедура - После запуска приложения
//
// Параметры:
//  ВыбранныйЭлемент - 	 - 
//  Параметры		 - 	 - 
//
Процедура ПослеЗапускаПриложения(ВыбранныйЭлемент, Параметры) Экспорт
	// Процедура заглушка, т.к. НачатьЗапускПриложения требуется наличие обработчика оповещения.
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКФормеТехПоддержки(Команда = Неопределено)
	ОткрытьФорму("ОбщаяФорма.ФормаТехническаяПоддержка");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбновление(Команда)
	ВыполнитьКомандуЗагрузкиВерсииСЛК();
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВБуфер(Команда)
	ОбщегоНазначенияКлиент.УстановитьТекстВБуферОбмена(ТекстОшибки);
	ПоказатьОповещениеПользователя("Текст скопирован в буфер обмена.");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналРегистрации(Команда)
	ОткрытьФорму("Обработка.ЖурналРегистрации.Форма", Новый Структура("Пользователь", ИмяПользователя()));
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбновление(Команда)
	
	Перем КодВозврата; // Код, возвращаемый установщиком СЛК после его завершения
	
	ФайлАрхива = Новый Файл(ИмяФайлаДляСохранения);
	ФайлАрхива.НачатьПроверкуСуществования(Новый ОписаниеОповещения("УстановитьОбновлениеЗавершение2", ЭтотОбъект, Новый Структура("КодВозврата, ФайлАрхива", КодВозврата, ФайлАрхива)));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбновлениеЗавершение2(Существует, ДополнительныеПараметры) Экспорт
	
	КодВозврата = ДополнительныеПараметры.КодВозврата;
	ФайлАрхива = ДополнительныеПараметры.ФайлАрхива;
	
	
	Если НЕ Существует Тогда
		ПоказатьПредупреждение(Неопределено, "Ошибка. Загруженный файл не обнаружен.", 5, "Установка обновления");
		Возврат;
	КонецЕсли; 
	
	// Создаём каталог для извлечения. Имя каталога будет совпадать с именем архива
	// ПутьКаталогаДляИзвлечения = СоздатьКаталогДляИзвлечения(ФайлАрхива);
	КаталогДляИзвлечения = Новый Файл(ФайлАрхива.Путь + ФайлАрхива.ИмяБезРасширения);
	Инд = 1;
	КаталогДляИзвлечения = Новый Файл(ФайлАрхива.Путь + ФайлАрхива.ИмяБезРасширения + "(" + Инд + ")");	
	НачатьСозданиеКаталога(Новый ОписаниеОповещения("УстановитьОбновлениеЗавершение3", ЭтотОбъект, КодВозврата), КаталогДляИзвлечения.ПолноеИмя);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбновлениеЗавершение3(ПутьКаталогаДляИзвлечения, Параметры)  Экспорт

	ZIP = Новый ЧтениеZipФайла(ИмяФайлаДляСохранения);
	ZIP.ИзвлечьВсе(ПутьКаталогаДляИзвлечения, ПредопределенноеЗначение("РежимВосстановленияПутейФайловZIP.Восстанавливать"));
	
	МассивФайлов = Неопределено;
	
	НачатьПоискФайлов(Новый ОписаниеОповещения("УстановитьОбновлениеЗавершение1", ЭтотОбъект, Новый Структура("КодВозврата", Параметры)), ПутьКаталогаДляИзвлечения, "*setup*.exe", Ложь);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбновлениеЗавершение1(НайденныеФайлы, ДополнительныеПараметры) Экспорт
	
	КодВозврата = ДополнительныеПараметры.КодВозврата;
	МассивФайлов = НайденныеФайлы;
	
	Если МассивФайлов.Количество() <> 0 Тогда
		НачатьЗапускПриложения(Новый ОписаниеОповещения("УстановитьОбновлениеЗавершение", ЭтотОбъект, Новый Структура("КодВозврата", КодВозврата)),, МассивФайлов[0].ПолноеИмя, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбновлениеЗавершение(КодВозврата1, ДополнительныеПараметры) Экспорт
	
	КодВозврата = ДополнительныеПараметры.КодВозврата;
	
	
	ОбновлениеУспешноУстановлено = (КодВозврата = 0);
	Закрыть(ОбновлениеУспешноУстановлено);

КонецПроцедуры

#КонецОбласти // Обработчики_Команд

#Область Дополнительные_процедуры_и_функции

&НаСервере
// Проверяет наличие обновлений на веб-сервере
//
Функция ПроверитьНаличиеТребуемойВерсииСЛК()
	
	ДанныеРезультата = Новый Структура("КодСостояния, ОписаниеСостояния, ВерсияСЛК, Размерфайла, ПредупреждениеОРучномИзменении, РекомендуемаяРазработчикомВерсияСЛК");
	Попытка				
		// Получить WS-прокси
		Прокси                             = ЗащитаОбновлениеСЛК.ПолучитьWSПроксиRemoteAccessService();
		// Обращение к сервису
		ProtectionUpdateDescription        = Неопределено;
		Результат                          = Прокси.CheckForProtectionUpdate(Метаданные.Имя, Метаданные.Версия, ЗащитаСервер.Версия(Ложь), ProtectionUpdateDescription);
		// Получаем результат
		ДанныеРезультата.КодСостояния      = Результат.StateCode;
		ДанныеРезультата.ОписаниеСостояния = Результат.StateDescription;
		Если Результат.StateCode = 501 Тогда
			ДанныеРезультата.ВерсияСЛК 							 = ProtectionUpdateDescription.ProtectionVersion;
			ДанныеРезультата.РазмерФайла 						 = ProtectionUpdateDescription.FileSize;
			ДанныеРезультата.РекомендуемаяРазработчикомВерсияСЛК = ProtectionUpdateDescription.RecommendedProtectionVersion;
			ДанныеРезультата.ПредупреждениеОРучномИзменении 	 = ProtectionUpdateDescription.ManuallyChangesWarning;
		КонецЕсли;
	Исключение
		ДанныеРезультата.КодСостояния      = 100;
		ДанныеРезультата.ОписаниеСостояния = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат ДанныеРезультата;
	
КонецФункции

&НаСервере
// Получает данные для загрузки запрашиваемой версии СЛК
//
// Параметры:
//		ВерсияСЛК - (строка) - номер нужной версии
//
Функция ПолучитьДанныеДляЗагрузкиВерсииСЛК(ВерсияСЛК)
	
	ДанныеРезультата = Новый Структура("КодСостояния, ОписаниеСостояния, ВерсияСЛК, СсылкаДляЗагрузки");
	Попытка				
		// Получить WS-прокси
		Прокси                             = ЗащитаОбновлениеСЛК.ПолучитьWSПроксиRemoteAccessService();
		// Обращение к сервису
		ProtectionUpdateDescription        = Неопределено;
		Результат                          = Прокси.GetLinkToProtectionUpdate(Метаданные.Имя, Метаданные.Версия, ВерсияСЛК, ProtectionUpdateDescription);
		// Получаем результат
		ДанныеРезультата.КодСостояния      = Результат.StateCode;
		ДанныеРезультата.ОписаниеСостояния = Результат.StateDescription;
		Если Результат.StateCode = 501 Тогда
			ДанныеРезультата.ВерсияСЛК 		   = ProtectionUpdateDescription.ProtectionVersion;
			ДанныеРезультата.СсылкаДляЗагрузки = ProtectionUpdateDescription.UpdateLink;
		КонецЕсли;
	Исключение
		ДанныеРезультата.КодСостояния      = 100;
		ДанныеРезультата.ОписаниеСостояния = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат ДанныеРезультата;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьКомандуЗагрузкиВерсииСЛК(ВерсияСЛК = Неопределено)
	
	Если ВерсияСЛК = Неопределено Тогда
		ВерсияСЛК = ЗащитаСервер.Версия(Ложь);
	КонецЕсли; 
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталога.МножественныйВыбор = Истина;
	ДиалогВыбораКаталога.Заголовок = "Выберите путь для сохранения файлов";
	// ДиалогВыбораКаталога.ПроверятьСуществованиеФайла = Истина;
	
	ДиалогВыбораКаталога.Показать(Новый ОписаниеОповещения("ВыполнитьКомандуЗагрузкиВерсииСЛКЗавершение", ЭтотОбъект, Новый Структура("ВерсияСЛК, Каталог", ВерсияСЛК, ДиалогВыбораКаталога.Каталог)));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуЗагрузкиВерсииСЛКЗавершение(ВыбранныеФайлы, Параметры)  Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Каталог = Параметры.Каталог;
		ВерсияСЛК = Параметры.ВерсияСЛК;
		ПутьДляСохранения = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(Каталог);
		
		КаталогНаДиске = Новый Файл(ПутьДляСохранения);
		КаталогНаДиске.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ВыполнитьКомандуЗагрузкиВерсииСЛКЗавершениеЗавершение2", ЭтотОбъект, Новый Структура("ВерсияСЛК", ВерсияСЛК)));


	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуЗагрузкиВерсииСЛКЗавершениеЗавершение2(Существует, ДополнительныеПараметры) Экспорт
	
	ВерсияСЛК = ДополнительныеПараметры.ВерсияСЛК;
	
	
	Если НЕ Существует Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьКомандуЗагрузкиВерсииСЛКЗавершениеЗавершение1", ЭтотОбъект, Новый Структура("ВерсияСЛК", ВерсияСЛК)), "Указанного каталога не существует. Создать?", РежимДиалогаВопрос.ДаНет);
		Возврат; 
	КонецЕсли; 
	
	ВыполнитьКомандуЗагрузкиВерсииСЛКЗавершениеФрагмент1(ВерсияСЛК);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуЗагрузкиВерсииСЛКЗавершениеЗавершение1(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВерсияСЛК = ДополнительныеПараметры.ВерсияСЛК;
	
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		НачатьСозданиеКаталога(Новый ОписаниеОповещения("ВыполнитьКомандуЗагрузкиВерсииСЛКЗавершениеЗавершение", ЭтотОбъект, Новый Структура("ВерсияСЛК", ВерсияСЛК)), ПутьДляСохранения);
		Возврат;
	Иначе
		Возврат;
	КонецЕсли; 
	
	ВыполнитьКомандуЗагрузкиВерсииСЛКЗавершениеФрагмент1(ВерсияСЛК);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуЗагрузкиВерсииСЛКЗавершениеФрагмент1(ВерсияСЛК)
	
	ВыполнитьКомандуЗагрузкиВерсииСЛКЗавершениеФрагмент(ВерсияСЛК);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуЗагрузкиВерсииСЛКЗавершениеЗавершение(ИмяКаталога, ДополнительныеПараметры) Экспорт
	
	ВерсияСЛК = ДополнительныеПараметры.ВерсияСЛК;
	
	
	ВыполнитьКомандуЗагрузкиВерсииСЛКЗавершениеФрагмент(ВерсияСЛК);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуЗагрузкиВерсииСЛКЗавершениеФрагмент(ВерсияСЛК)
	
	Перем ИмяСтраницы;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.ДлительнаяОперация;
	ПриИзмененииСтраницы();
	
	// ** В зависимости от результата загрузки обновления переключаемся на нужную страницу
	// Функция вовзращает имя той страницы, на которую следует переключиться
	ИмяСтраницы = ЗагрузитьВерсиюСЛК(ВерсияСЛК);
	// Переключаемся на нужную страницу
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы[ИмяСтраницы];
	ПриИзмененииСтраницы();

КонецПроцедуры

&НаСервереБезКонтекста
Функция СерверСЛКНаходитсяНаЭтомКомпьютере()
	
	// это указывает, что сервер СЛК и сервер 1С находятся на одном и том же компьютере
	СерверНаходитсяЛокально = ЗащитаКлиентСервер.ПолучитьЗначениеИзСтрокиПараметровПодключения("host") = "localhost";
	// это указывает, что сервер 1С - это и есть этот компьютер
	ЭтоФайловаяИБ = ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
	Возврат ЭтоФайловаяИБ И СерверНаходитсяЛокально;
	
КонецФункции
 
&НаСервере
Процедура ОбновитьЗаголовокФормы()
	
	Страницы = Элементы.Страницы.ПодчиненныеЭлементы;
	ТекущаяСтраница = Элементы.Страницы.ТекущаяСтраница;
	
	// Устанавливаем заголовок формы в соответствии с открытой страницей
	Если ТекущаяСтраница = Страницы.СтраницаЗагрузкиОбновления Тогда
		Заголовок = "Требуется обновление защиты";
	ИначеЕсли ТекущаяСтраница = Страницы.ДлительнаяОперация Тогда
		Заголовок = "Пожалуйста, подождите...";
	ИначеЕсли ТекущаяСтраница = Страницы.СтраницаСообщенияОбОшибке Тогда
		Заголовок = "Не удалось обновить защиту конфигурации";
	ИначеЕсли ТекущаяСтраница = Страницы.ОбновлениеУспешноЗагружено Тогда
		Заголовок = "Обновление успешно загружено";
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ЗагрузитьВерсиюСЛК(ВерсияСЛК)
	
	ОписаниеОбновления = ПолучитьДанныеДляЗагрузкиВерсииСЛК(ВерсияСЛК);
	
	Страницы = Элементы.Страницы.ПодчиненныеЭлементы;
	ИмяСтраницы = Страницы.ОбновлениеУспешноЗагружено.Имя;
	
	Если ОписаниеОбновления.КодСостояния = 501 Тогда 
		
		Состояние("Загрузка дистрибутива СЛК...");
		ИмяФайлаДляСохранения = ПутьДляСохранения + "Protection_" + ОписаниеОбновления.ВерсияСЛК + ".zip";
		
		Результат = ПолучениеФайловИзИнтернетаКлиент.СкачатьФайлНаКлиенте(ОписаниеОбновления.СсылкаДляЗагрузки, Новый Структура("ПутьДляСохранения", ИмяФайлаДляСохранения));
		
		Если Результат.Статус Тогда	// Файл обновления получен успешно
			ИмяСтраницы = Страницы.ОбновлениеУспешноЗагружено.Имя;
			ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации("Обновление СЛК",
																		  "Информация",
																		  "Обновление успешно загружено на клиенте. Каталог загрузки:""" + ПутьДляСохранения + """");
			ОбновлениеУспешноПолучено = Истина;															  
																					 
		Иначе // Произошла ошибка при передаче файла
			ИмяСтраницы = Страницы.СтраницаСообщенияОбОшибке.Имя;
			ПредставлениеОшибки = "Возникла ошибка при загрузке обновления с сервера.";
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Результат.СообщениеОбОшибке,
																		  		  ОписаниеОбновления.СсылкаДляЗагрузки,
																		  		  ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации("Обновление СЛК", "Ошибка", ТекстОшибки);
			// Дополним описание ошибки доп. параметрами
			ТекстОшибки = ДополнитьОписаниеОшибки(ТекстОшибки);
		КонецЕсли;
	Иначе // Не удалось получить обновление на Веб-сервере
		ИмяСтраницы = Страницы.СтраницаСообщенияОбОшибке.Имя;
		ОписаниеОшибки  = "Не удалось получить обновление на удалённом сервере.";
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Не удалось получить обновление СЛК с Web-сервера. Сервер вернул следующее сообщение: %1 (Код:%2)",
																			  ОписаниеОбновления.ОписаниеСостояния,
																			  ОписаниеОбновления.КодСостояния);
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации("Обновление СЛК", "Ошибка", ТекстОшибки);
		// Дополним описание ошибки доп. параметрами
		ТекстОшибки = ДополнитьОписаниеОшибки(ТекстОшибки);
	КонецЕсли;
	
	Возврат ИмяСтраницы;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
//
// Функция ОпределитьВерсиюСервераСЛК
//
// Описание: Функция определяет текущую версию сервера СЛК
// Примечание: сейчас у Катрана предусмотрен только метод для получения версии внешней компоненты.
//             Версию сервера, по их же словам, можно определить только из текста ошибки о несоответствии версий.
//
// Возвращаемое значение: (Строка) версия сервера СЛК
//
Функция ОпределитьВерсиюСервераСЛК()
	
	Если Параметры.Свойство("ТекстПредупреждения") Тогда
		ТекстПредупреждения  = Параметры.ТекстПредупреждения;
	Иначе
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ЗащитаКлиентСервер.ЭтоОшибкаОНесоответствииВерсий(ТекстПредупреждения) Тогда
		Возврат "";
	КонецЕсли;               
	
	ТекстПредупреждения = СтрЗаменить(ТекстПредупреждения, "Версия сервера ", "");
	НайденныйТекст = Найти(ТекстПредупреждения, " не соответствует версии клиента");
	
	Возврат Лев(ТекстПредупреждения, НайденныйТекст-1);
	
КонецФункции // ОпределитьВерсиюСервераСЛК
 
////////////////////////////////////////////////////////////////////////////////
//
// Функция ДополнитьОписаниеОшибки
//
// Описание: Дополняет переданное в качестве параметра описание ошибки
//			 дополнительными данными
//
//
// Параметры
//		ОписаниеОшибки - строка - текст, содержащий описание ошибки, которое необходимо дополнить
//
// Возвращаемое значение: Строка, содержащая дополненное описание ошибки
//
Функция ДополнитьОписаниеОшибки(Знач ОписаниеОшибки)
	
	СисИнфо = Новый СистемнаяИнформация;
	
	ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + Символы.ПС;
	ОписаниеОшибки = ОписаниеОшибки + "---------------------------------" + Символы.ПС;
	ОписаниеОшибки = ОписаниеОшибки + "Версия сервера СЛК: " + ВерсияСервераСЛК + Символы.ПС;
	ОписаниеОшибки = ОписаниеОшибки + "Версия внешней компоненты: " + ЗащитаСервер.Версия(Истина) + Символы.ПС;
	ОписаниеОшибки = ОписаниеОшибки + "Расположение сервера СЛК: " + ?(ЗащитаКлиентСервер.ПолучитьЗначениеИзСтрокиПараметровПодключения("host") = "localhost", "Локально", "Удалённо") + Символы.ПС;
	ОписаниеОшибки = ОписаниеОшибки + "Тип ИБ: " + ?(ОбщегоНазначения.ИнформационнаяБазаФайловая(), "Файловая", "Клиент-сервер") + Символы.ПС;
	ОписаниеОшибки = ОписаниеОшибки + "Версия платформы: " + СисИнфо.ВерсияПриложения + Символы.ПС;
	ОписаниеОшибки = ОписаниеОшибки + "Версия ОС: " + СисИнфо.ВерсияОС;
	
	Возврат ОписаниеОшибки;
	
КонецФункции // ДополнитьОписаниеОшибки

#КонецОбласти 
