#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает код половой принадлежности в соответствии с кодировкой ФФОМС.
//
// Возвращает строку
//
// Параметры:
//  УсловиеОказанияМедПомощи  - ПеречислениеСсылка.ПолПациентов - условия оказания медицинской помощи.
//
// Возвращаемое значение:
//	Строка - Код в соответствии с кодировкой ФФОС при выбранном ПолПациентов.
//
Функция КодПоОМС(ТипПолиса) Экспорт
	
	Возврат ?(ТипПолиса = Перечисления.ТипыПолиса.ОбязательноеМедицинскоеСтрахование, 3, 0);
	
КонецФункции 

#КонецОбласти