
#Область ОбработкаСобытий

&НаКлиенте
// Процедура - обрабочтик комнады.
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДокументОснование = ПараметрКоманды;
	
	Если ЗначениеЗаполнено(ДокументОснование)
		И НЕ ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ДокументОснование, "Проведен") Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Документ основание не проведен.'"));
		Возврат;
	КонецЕсли;  	
	
	// Для предотвращения повторного открытия форм ввода чека коррекции по одному Документу расчетов
	// назначается ключ уникальности в виде УникальныйИдентификатора документа расчетов
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЧекКоррекции") Тогда
		
		РеквизитыОснования = ДанныеДокументаОснования(ДокументОснование);
		
		Если РеквизитыОснования.НеприменениеККТ Тогда
			ДокументРасчетов = ДокументОснование;
		Иначе
			ДокументРасчетов = РеквизитыОснования.ДокументРасчетов;
		КонецЕсли;
		
	Иначе
		
		ДокументРасчетов = ДокументОснование;
		
	КонецЕсли;
	
	КлючУникальности = ДокументРасчетов.УникальныйИдентификатор();
	
	ПараметрыФормы = Новый Структура("ДокументОснование", ДокументОснование);
	
	МассивДанныхФискальныхОпераций = ПолучитьДанныеФискальныхОпераций(ДокументРасчетов);
	
	Если МассивДанныхФискальныхОпераций.Количество() = 0 Тогда   		
		ПоказатьПредупреждение(, НСтр("ru = 'Нет сохраненной фискальной операции.'"));
	ИначеЕсли МассивДанныхФискальныхОпераций.Количество() = 1 Тогда
		
		ФискальнаяОперация = МассивДанныхФискальныхОпераций[0].ДанныеФискальнойОперации;
		Если ФискальнаяОперация.ЕстьКорректирующийДокумент Тогда      			
			ТекстСообщения = НСтр("ru = 'По данному документу ранее была создана корректировка документом %1. 
			|Создание повторной корректировки не возможно.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
			ФискальнаяОперация.ЧекКоррекции);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения); 			
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы.Вставить("Результат", МассивДанныхФискальныхОпераций[0]);
		ОткрытьФорму("Обработка.СозданиеЧековКоррекции.Форма", ПараметрыФормы
		,
		,
		КлючУникальности,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
	Иначе   	
		СтруктураПараметровОповещения = Новый Структура;
		СтруктураПараметровОповещения.Вставить("Окно"				, ПараметрыВыполненияКоманды.Окно);
		СтруктураПараметровОповещения.Вставить("НавигационнаяСсылка", ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		СтруктураПараметровОповещения.Вставить("ПараметрыФормы"		, ПараметрыФормы);

		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФискальнойОперацииЗавершение", ЭтотОбъект, СтруктураПараметровОповещения);
		
		ОткрытьФорму("Обработка.СозданиеЧековКоррекции.Форма.ФормаВыбораФискальнойОперации", 
			Новый Структура("МассивДанныхФискальныхОпераций", МассивДанныхФискальныхОпераций),,,,,
			ОписаниеОповещения,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);       		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаСервере
// Функция получает данные документа основания.
//
Функция ДанныеДокументаОснования(Основание)
	
	Возврат ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(Основание, "НеприменениеККТ, ДокументРасчетов");
	
КонецФункции

&НаКлиенте
// Процедура - обработчик оповещения "ВыборФискальнойОперации".
//
Процедура ВыборФискальнойОперацииЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено И ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("ДанныеФискальнойОперации") Тогда
		ПараметрыФормы = Параметры.ПараметрыФормы;
		ПараметрыФормы.Вставить("Результат", Результат);
		ОткрытьФорму("Обработка.СозданиеЧековКоррекции.Форма", ПараметрыФормы
					,
					,
					,
					Параметры.Окно,
					Параметры.НавигационнаяСсылка);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Функция получает данные фискальных операций.
//
Функция ПолучитьДанныеФискальныхОпераций(Основание)
	
	Возврат Обработки.СозданиеЧековКоррекции.ПолучитьДанныеФискальныхОпераций(Основание);
	
КонецФункции  

#КонецОбласти
