///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

// СтандартныеПодсистемы

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие - хранилище переменных, где:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Инициализация (на примере СообщенияДляЖурналаРегистрации):
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Использование (на примере СообщенияДляЖурналаРегистрации):
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;
Перем ПараметрыПриложения Экспорт; // Параметры приложения

// Конец СтандартныеПодсистемы

#Область ГлобальныеПеременные 

Перем ДоступноеОбновлениеКонфигурации 							Экспорт; // Переменная содержит данные о доступном обновлении.
Перем СообщенияДляЖурналаРегистрации 							Экспорт; // Переменная содержит список для регистрации в журнале.
Перем НастройкиОбновленияКонфигурации 							Экспорт; // Переменная содержит параметры обновления конфигурации.
Перем КомпонентаTwain 											Экспорт; // Переменная содержит компоненту "Twain" для работы со сканером.
Перем ОповещатьОРезервномКопированииПриЗавершенииСеанса 		Экспорт; // Переменная содержит признак резервного копирования.
Перем ПараметрыАдминистратораОбновления 						Экспорт; // Переменная содержит структуру с параметрами доступа к ИБ.
Перем ДатаОтложенногоРезервногоКопирования 						Экспорт; // Переменная содержит дата отложенного резервного копирования.
Перем ПроверкаДоступаКРабочемуКаталогуВыполнена 				Экспорт; // Переменная содержит путь для подключения к каталогу.
Перем ПараметрыРаботыКлиентаПриОбновлении 						Экспорт; // Структура, содержащая в себе время начала и окончания обновления программы.
Перем ПараметрыРаботыКлиентаПриЗавершении 						Экспорт; // Структура параметров для клиентской логики по завершению работы в программе.
Перем ПредлагатьОбновлениеИнформационнойБазыПриЗавершенииСеанса Экспорт; // Признак необходимости обновления конфигурации информационной базы при завершении сеанса.
Перем СофтФон 													Экспорт; // Софтфон
Перем КомпонентаПростыеЗвонки                          			Экспорт; // Переменная содержит данные для подключения к "простым звонкам".
Перем ПараметрыОповещенияОЗвонке                        		Экспорт; // Переменная содержит данные для оповещения о входящем звонке.
Перем ДанныеКлиентаСистемыВзаимодействия 						Экспорт; // Переменная содержит данные для оповещения клиента в системе взаимодействия. 

// СтандартныеПодсистемы.ПодключаемоеОборудование
Перем глПодключаемоеОборудование Экспорт; // для кэширования на клиенте
Перем глДоступныеТипыОборудования Экспорт; // ДоступныеТипыОборудования 
// Конец СтандартныеПодсистемы.ПодключаемоеОборудовани

#КонецОбласти


#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - Перед началом работы системы.
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПередНачаломРаботыСистемы()
	
	МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента();
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
	// РаботаСВнешнимОборудованием
	МенеджерОборудованияКлиент.ПередНачаломРаботыСистемы();
	МенеджерОборудованияКлиент.ПриНачалеРаботыСистемы(); 
		
	// Подключение внешнего оборудования
	МенеджерОборудованияКлиент.ПодключитьВнешнееОборудование();
	
	//
	УправлениеИнтерфейсамиСервер.ИнициализацияКонстантДополнительныхРасширенийHelix();
		
КонецПроцедуры 

// Процедура, обработчик события "ПриНачалеРаботыСистемы".
//
Процедура ПриНачалеРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
	// РаботаСВнешнимОборудованием
	МенеджерОборудованияКлиент.ПриНачалеРаботыСистемы(); // вернуть Диана.
	// МенеджерОборудованияКлиентСтоматология.ПриНачалеРаботыСистемы();
	// Конец РаботаСВнешнимОборудованием	
	
	#Если НЕ МобильныйКлиент Тогда
		
		#Область Запуск_СЛК
		
		ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиентаПриЗапуске();
		Если ПараметрыРаботыКлиента.Свойство("ПоказатьОкноНачалоРаботыСПрограммой") 
			И ПараметрыРаботыКлиента.ПоказатьОкноНачалоРаботыСПрограммой = Ложь Тогда 
			
			ОбщегоНазначенияКлиентПереопределяемый.ЗапускЗащитыПриНачалеРаботыСистемы();
			
		КонецЕсли;
		
		#КонецОбласти
		
		IPТелефонияКлиент.ПриНачалеРаботыСистемы(ПараметрыРаботыКлиента);

	#КонецЕсли
	
	КассовыйСерверКлиент.ПриНачалеРаботыСистемы();
	
	Если НЕ ОбщегоНазначенияПовтИсп.РазделениеВключено() 
		И ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() 
		И ПараметрыРаботыКлиента.Свойство("НачальноеЗаполнениеДанных") 
		И Не ПараметрыРаботыКлиента.НачальноеЗаполнениеДанных Тогда 
		
		// Запуск напоминаний пользователям
		ЗапуститьНапоминанияПользователюОЗадачах(); 		
		
	КонецЕсли;
	
	Если ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда   		
		
		// Сводный отчет при запуске	
		Если ОбщегоНазначенияСтоматология.ФормироватьСводныйОтчетПриЗапуске() Тогда
			
			ФормаОтчетаПриЗапуске = ПолучитьФорму("Отчет.СводныйОтчетПриЗапуске.Форма.ФормаОтчета", Новый Структура("Пользователь", ОбщегоНазначенияСтоматология.ТекущийПользователь()));
			Если НЕ ФормаОтчетаПриЗапуске.ДанныеКОтображениюОтсутствуют Тогда
				ФормаОтчетаПриЗапуске.Открыть();	
			КонецЕсли;
			
		КонецЕсли; 
		
		ТекущийПользователь = ОбщегоНазначения.ТекущийПользователь();
		
		ЗадачиВзаимодействиеКлиент.ПослеНачалаРаботыСистемы();
		
		Если Не ОбновлениеИнформационнойБазыВызовСервера.НеобходимоОбновлениеИнформационнойБазы() Тогда
			ИмяОбработкиОткрываемойПоУмолчанию = ОбщегоНазначения.ПолучитьИмяОбработкиОткрываемойПоУмолчанию(ТекущийПользователь);
			
			Если Пользователи.ОткрытьФормуВыбораСтруктурнойЕдиницы(ТекущийПользователь) Тогда				
				
				СтруктураПараметров = Новый Структура();
				СтруктураПараметров.Вставить("Заголовок", "Выберите клинику");
				
				ОбработкаОповещения = Новый ОписаниеОповещения("ПослеВыбораСтруктурнойЕдиницы", ОбщегоНазначенияСлужебныйКлиент, Новый Структура("ИмяОбработкиОткрываемойПоУмолчанию", ИмяОбработкиОткрываемойПоУмолчанию));
				
				ОткрытьФорму("Обработка.СменаСтруктурнойЕдиницы.Форма", СтруктураПараметров,,,,, ОбработкаОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);				
			Иначе
				Если ЗначениеЗаполнено(ИмяОбработкиОткрываемойПоУмолчанию) Тогда
					ОткрытьФорму(ИмяОбработкиОткрываемойПоУмолчанию);
				КонецЕсли;		
			КонецЕсли;
			
		КонецЕсли;
					
	КонецЕсли;	
	
КонецПроцедуры

// Процедура, обработчик события "ПередЗавершениемРаботыСистемы".
//
// Параметры:
//  Отказ				 - 	 - 
//  ТекстПредупреждения	 - 	 - 
//
Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);
	// Конец СтандартныеПодсистемы
	
КонецПроцедуры

// Процедура - Обработка получения формы выбора пользователей системы взаимодействия.
//
// Параметры:
//  НазначениеВыбора		 - 	 - 
//  Форма					 - 	 - 
//  ИдентификаторОбсуждения	 - 		 - 
//  Параметры				 - 		 - 
//  ВыбраннаяФорма			 - 		 - 
//  СтандартнаяОбработка	 - 		 - 
//
Процедура ОбработкаПолученияФормыВыбораПользователейСистемыВзаимодействия(НазначениеВыбора, Форма, ИдентификаторОбсуждения, Параметры, ВыбраннаяФорма, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Обсуждения
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Обсуждения") Тогда
	
		МодульОбсужденияСлужебныйКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбсужденияСлужебныйКлиент");
		МодульОбсужденияСлужебныйКлиент.ПриПолученииФормыВыбораПользователейСистемыВзаимодействия(НазначениеВыбора, Форма, ИдентификаторОбсуждения, Параметры, ВыбраннаяФорма, СтандартнаяОбработка);
	
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Обсуждения
		
КонецПроцедуры  

// Процедура, обработчик события "ОбработкаВнешнегоСобытия"
//
// Параметры:
//  Источник - 	 - 
//  Событие	 - 	 - 
//  Данные	 - 	 - 
//
Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	
	// РаботаСВнешнимОборудованием
	ОписаниеОшибки  = "";
	ОписаниеСобытия = Новый Структура("Источник, Событие, Данные", Источник, Событие, Данные);
	Результат = МенеджерОборудованияКлиент.ОбработатьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки);
	Если Результат = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='При обработке внешнего события от устройства произошла ошибка.'") + Символы.ПС + ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти