
#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
// Процедура, При содании на сервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	Элементы.КнопкаЦветФона.ЦветФона = ?(ЗначениеЗаполнено(Объект.ЦветФона), ЗначениеИзСтрокиВнутр(Объект.ЦветФона), Новый Цвет());
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();

КонецПроцедуры

&НаКлиенте 
// Процедура, После записи.
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмененаДолжность", Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура обработчик команды ИзменитьЦветФона.
//
Процедура ИзменитьЦветФона(Команда)
	
	ДиалогЦвета = Новый ДиалогВыбораЦвета();
	
	#Если Не ВебКлиент Тогда
		ДиалогЦвета.Цвет = Элементы.КнопкаЦветФона.ЦветФона;
	#КонецЕсли
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РезультатВыбораЦвета", ЭтотОбъект);
	ДиалогЦвета.Показать(ОписаниеОповещения);
	
	//Если ДиалогЦвета.Выбрать() = Истина Тогда
	//	ИзменитьЦветФонаНаСервере(ДиалогЦвета.Цвет);
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПройедурыИФункции

&НаКлиенте
// Процедура обработчик выбора цвета пользователем
//
Процедура РезультатВыбораЦвета(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ИзменитьЦветФонаНаСервере(Результат);	
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
// Процедура изменяет устанавливает в значение реквизита - цвет фона.
//
Процедура ИзменитьЦветФонаНаСервере(Цвет)
	
	Объект.ЦветФона = ЗначениеВСтрокуВнутр(Цвет);
	Элементы.КнопкаЦветФона.ЦветФона = Цвет;
	
КонецПроцедуры

#КонецОбласти
