
#Область СлужебныеПроцедурыИФункции

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ХозОперации.НомерСтроки) КАК НомерСтроки,
	|	ХозОперации.Ссылка.Дата КАК Период,
	|	ХозОперации.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ХозОперации.СчетДт КАК СчетДт,
	|	ХозОперации.СчетКт КАК СчетКт,
	|	ХозОперации.СубконтоДт1 КАК СубконтоДт1,
	|	ХозОперации.СубконтоДт2 КАК СубконтоДт2,
	|	ХозОперации.СубконтоКт1 КАК СубконтоКт1,
	|	ХозОперации.СубконтоКт2 КАК СубконтоКт2,
	|	СУММА(ХозОперации.Количество) КАК Количество,
	|	СУММА(ХозОперации.Сумма) КАК Сумма,
	|	ХозОперации.Содержание КАК Содержание
	|ПОМЕСТИТЬ ВременнаяТаблицаУправленческий
	|ИЗ
	|	Документ.ХозяйственныеОперации.Операции КАК ХозОперации
	|ГДЕ
	|	ХозОперации.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозОперации.Ссылка.Дата,
	|	ХозОперации.Ссылка.СтруктурнаяЕдиница,
	|	ХозОперации.СчетДт,
	|	ХозОперации.СчетКт,
	|	ХозОперации.СубконтоДт1,
	|	ХозОперации.СубконтоДт2,
	|	ХозОперации.СубконтоКт1,
	|	ХозОперации.СубконтоКт2,
	|	ХозОперации.Содержание";
		
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.ВыполнитьПакет();
	СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	
	"ВЫБРАТЬ   РАЗРЕШЕННЫЕ
	|	ВременнаяТаблицаУправленческий.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ВременнаяТаблицаУправленческий.СубконтоДт1,
	|	ВременнаяТаблицаУправленческий.СубконтоДт2,
	|	ВременнаяТаблицаУправленческий.СубконтоКт1,
	|	ВременнаяТаблицаУправленческий.СубконтоКт2,
	|	ВременнаяТаблицаУправленческий.Количество КАК Количество,
	|	ВременнаяТаблицаУправленческий.Сумма КАК Сумма,
	|	ВременнаяТаблицаУправленческий.Содержание
	|ИЗ
	|	ВременнаяТаблицаУправленческий КАК ВременнаяТаблицаУправленческий
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

#КонецОбласти