
#Область ОбработчикиСобытий

&НаКлиенте  
// Процедура - Обработка команды
//
// Параметры:
//  ПараметрКоманды				 - 	 - 
//  ПараметрыВыполненияКоманды	 - 	 - 
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Статус = ПолучитьСтатус(ПараметрКоманды);
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыПланЛечения.Рассматривается") Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("ПараметрКоманды, Статус", ПараметрКоманды, Статус)), "План лечения в статусе рассмотрения. Установить статус ""Принят"" и продолжить?",РежимДиалогаВопрос.ДаНет);
        Возврат;
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыПланЛечения.Закрыт") Тогда
		ПоказатьПредупреждение(, "План лечения закрыт. Создание наряд-заказа не возможно.");
		Возврат;
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыПланЛечения.Отвергнут") Тогда
		ПоказатьПредупреждение(, "План лечения отвергнут. Создание наряд-заказа не возможно.");
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуНарядЗаказ(ПараметрКоманды); 
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Обработка команды завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ОбработкаКомандыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПараметрКоманды = ДополнительныеПараметры.ПараметрКоманды;
	Статус = ДополнительныеПараметры.Статус;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		УстановитьСтатусПланаЛечения(ПараметрКоманды,ПредопределенноеЗначение("Перечисление.СтатусыПланЛечения.Принят"));
		ОповеститьОбИзменении(ПараметрКоманды);
	Иначе
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуНарядЗаказ(ПараметрКоманды);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - Открыть форму наряд заказ
//
// Параметры:
//  ПараметрКоманды	 - 	 - 
//
Процедура ОткрытьФормуНарядЗаказ(Знач ПараметрКоманды)
	
	ОткрытьФорму("Документ.НарядЗаказ.ФормаОбъекта",Новый Структура("Основание", ПараметрКоманды));

КонецПроцедуры

&НаСервере
// Получить статус плана
//
Функция ПолучитьСтатус(ДокСсылка)
	
	Возврат ДокСсылка.Статус;
	
КонецФункции	

&НаСервере
// Проставить статус плану лечения
//
Процедура УстановитьСтатусПланаЛечения(ДокСсылка,Статус)
	
	ДокОбъект        = ДокСсылка.ПолучитьОбъект();
	ДокОбъект.Статус = Статус;
    ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

#КонецОбласти