
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФлагПисьмо	 = Ложь;
	ФлагPush	 = Ложь;
	ФлагSMS		 = Ложь;
	
	Если Параметры.Свойство("ТипШаблона") Тогда
		
		Если Параметры.ТипШаблона = Перечисления.ТипыСобытий.Письмо Тогда
			ФлагПисьмо = Истина;
		ИначеЕсли Параметры.ТипШаблона = Перечисления.ТипыСобытий.SMS Тогда
			ФлагSMS = Истина;
		ИначеЕсли Параметры.ТипШаблона = Перечисления.ТипыСобытий.ПушУведомление Тогда
			ФлагPush = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ФлагПисьмо"	, ФлагПисьмо);
	Список.Параметры.УстановитьЗначениеПараметра("ФлагPush"		, ФлагPush);
	Список.Параметры.УстановитьЗначениеПараметра("ФлагSMS"		, ФлагSMS);
	
КонецПроцедуры

#КонецОбласти