
#Область ОбработчикиСобытий

// Процедура, обработчик события ПриКопировании
//
Процедура ПриКопировании(ОбъектКопирования)
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	Наименование = ?(ПустаяСтрока(Строка(Код)), "Рабочее место", Строка(Код))
	             + ?(ПустаяСтрока(Строка(Код)), ": ", "/")
	             + ?(ПустаяСтрока(Строка(ТекущийПользователь)), "Пользователь", Строка(ТекущийПользователь));

	// Добавить провеку наличия элемента с таким наименованием
	Запрос = Новый Запрос("ВЫБРАТЬ   РАЗРЕШЕННЫЕ
	                      |	КОЛИЧЕСТВО(*) КАК Количество
	                      |ИЗ
	                      |	Справочник.РабочиеМеста КАК РабочиеМеста
	                      |ГДЕ
	                      |	РабочиеМеста.Наименование ПОДОБНО &Наименование
	                      |	И РабочиеМеста.Ссылка <> &Ссылка");

	Запрос.УстановитьПараметр("Наименование", "%" + Наименование + "%");
	Запрос.УстановитьПараметр("Ссылка"      , Ссылка);

	Количество = Запрос.Выполнить().Выгрузить()[0].Количество;
	Если Количество > 0 Тогда
		Наименование = Наименование + " (" + Строка(Количество + 1) + ")";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти