
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.ТекущийПользователь = ПараметрыСеанса.ТекущийСотрудник;
	ЭтотОбъект.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
		
	УстановитьПривилегированныйРежим(Истина);
	                                          
	// Инициализируем настройки при первом открытии формы
	Если ХранилищеСистемныхНастроек.Загрузить("Справочник.Заявки.Форма.ФормаСписка/ТекущиеДанные") = Неопределено Тогда
		Настройки = Новый Соответствие;
		ХранилищеСистемныхНастроек.Сохранить("Справочник.Заявки.Форма.ФормаСписка/ТекущиеДанные", ,Настройки);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь); 
		
	// Механизм использования данной формы списка как формы выбора
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	Если Параметры.МножественныйВыбор <> Неопределено Тогда
		Элементы.Список.МножественныйВыбор = Параметры.МножественныйВыбор;
	КонецЕсли;    
	// Обход автоматического сохранения пользовательских настроек для разных режимов
	Если Параметры.РежимВыбора И Не ЗначениеЗаполнено(Параметры.КлючПользовательскихНастроек) Тогда
		Параметры.КлючПользовательскихНастроек = "РежимВыбора";
		Список.АвтоматическоеСохранениеПользовательскихНастроек = Ложь;
	КонецЕсли;	                                                                                    
	
КонецПроцедуры
	
&НаКлиенте
// Процедура - Обработка оповещения
//
// Параметры:
//  ИмяСобытия	 - 	 - 
//  Параметр	 - 	 - 
//  Источник	 - 	 - 
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОБНОВИТЬ_ОТБОРЫ_СПИСКА_ЗАЯВОК" Тогда 
		ИнициализироватьМеханизмФильтрацииДанных(Параметр.Отбор, Истина);
		
	ИначеЕсли ИмяСобытия = "ЗаписанаНоваяЗаявка" Тогда
		Элементы.Список.Обновить();
		
	ИначеЕсли ИмяСобытия = "ОбновленСтатусЗаявки" Тогда
		// Элементы.Список.Обновить();
		
	ИначеЕсли ИмяСобытия = "ОповещениеОНовыхЗаявках" Тогда
		// Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события при загрузке данных из настроек на сервере.
//
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Параметры.Свойство("ПараметрыОтбора") Тогда
		ОбновитьМеханизмФильтрацииДанных(Параметры.ПараметрыОтбора, Истина);
	Иначе
		ИнициализироватьМеханизмФильтрацииДанных(Параметры.Отбор, Истина);
	КонецЕсли;
	
	СоздатьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура УстановитьФильтрНеобработанные(Команда)
	
	УстановитьФильтрПоСтатусу();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ОткрытьКанбан(Команда)
	
	ФормаКанбана = ПолучитьОткрытуюФорму("Справочник.Заявки.Форма.ФормаСпискаКанбан");
	
	ПараметрыОтбора = ПараметрыВыбранныхФильтровКлиент();
	
	Если ФормаКанбана = Неопределено Тогда
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ПараметрыОтбора", ПараметрыОтбора);
		
		ОткрытьФорму("Справочник.Заявки.Форма.ФормаСпискаКанбан", ПараметрыОткрытия);
		
	Иначе
		ФормаКанбана.Активизировать();
		ФормаКанбана.УстановитьОтбор(ПараметрыОтбора);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СоздатьСделку".
//
Процедура СоздатьЗаявку(Команда)
	
	ОткрытьФорму("Справочник.Заявки.Форма.ФормаЭлемента",,, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервереБезКонтекста
// Процедура, обработчик события "ПриПолученииДанныхНаСервере".
//
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого Строка Из Строки Цикл
		
		Данные = Строка.Значение.Данные;
		
		Если ЗначениеЗаполнено(Данные.Обращение) И ТипЗнч(Данные.Обращение) = Тип("Строка") Тогда
			Данные.Обращение = "Обращение №" + ФормированиеПечатныхФорм.УдалитьЛидирующиеНулиИзНомераОбъекта(Данные.Обращение);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ____________________ОБРАБОТЧИКИ_МЕХАНИЗМА_ФИЛЬТРАЦИИ_ДАННЫХ________________________

#Область __________________ИНИЦИАЛИЗАЦИЯ_МЕХАНИЗМА_ФИЛЬТРАЦИИ______________________

&НаСервере
// Процедура - Инициализировать механизм фильтрации данных
//
// Параметры:
//  ПараметрыОтбора	 - 	 - 
//  ОбновитьСписок	 - 	 - 
//
Процедура ИнициализироватьМеханизмФильтрацииДанных(ПараметрыОтбора = Неопределено, ОбновитьСписок = Ложь)
	
	// Обновляем отборы согласно параметров, переданных из другой формы	и уходим	
	Если ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("ОчиститьВсеОтборы") И ПараметрыОтбора.ОчиститьВсеОтборы = Истина Тогда
		ОбновитьЗначенияФильтрацииДанных(ПараметрыОтбора); // Перешли из монитора при уже открытой текущей формы
		Возврат;
	КонецЕсли;
	
	РезультатПакетногоЗапроса = ПолучитьПакетЗапросаЗначенийДляОтборов(ТекущийПользователь);	
	
	// Отбор статус. 
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтатусов");	
	ОбновитьДинамическоеМенюФильтрации_Статус(РезультатПакетногоЗапроса[0].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда 	
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Статус", ПараметрыОтбора.МассивСтатусов, Истина);
	КонецЕсли;
	
	// Отбор структурная единица.
	ОбновитьДинамическоеМенюФильтрации_СтруктурнаяЕдиница(РезультатПакетногоЗапроса[1].Выгрузить(), Истина);
	Если ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтруктурныхЕдиниц") Тогда 
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтруктурнаяЕдиница", ПараметрыОтбора.МассивСтруктурныхЕдиниц, Истина);		
	Иначе 
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница, Истина);
	КонецЕсли;	
	
	ОбновитьДинамическоеМенюФильтрации_СотрудникРегистрации(РезультатПакетногоЗапроса[4].Выгрузить());
	ВыборкаКоличества = РезультатПакетногоЗапроса[5].Выбрать();
	Если ВыборкаКоличества.Следующий() Тогда 
		Если ВыборкаКоличества.Количество < 200 Тогда 
			ОбновитьДинамическоеМенюФильтрации_РекламныйИсточник(РезультатПакетногоЗапроса[3].Выгрузить());
		Иначе 
			ОбновитьДинамическоеМенюФильтрации_РекламныйИсточник();
		КонецЕсли;	
	Иначе 	
		ОбновитьДинамическоеМенюФильтрации_РекламныйИсточник(РезультатПакетногоЗапроса[3].Выгрузить());
	КонецЕсли;	
	
	// Отбор канал привлечения.
	ОбновитьДинамическоеМенюФильтрации_КаналПривлечения(РезультатПакетногоЗапроса[6].Выгрузить());
	
	// Отбор пометка удаления сделки.
	ОбновитьДинамическоеМенюФильтрации_ПометкаУдаленияЗаявки();
	
	// Отбор менеджеров.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивМенеджеров"); // Перешли из монитора, открывая форму
	ОбновитьДинамическоеМенюФильтрации_Менеджер(РезультатПакетногоЗапроса[2].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда 		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Менеджер", ПараметрыОтбора.МассивМенеджеров, Истина, НСтр("ru = '<не указан>'; en = '<not specified>'"));
		ОбновитьСписок = Истина;
	КонецЕсли;	
	
	ОбновитьДинамическоеМенюФильтрации_СозданаПериод();
	УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СозданаПериод", Новый СтандартныйПериод(ВариантСтандартногоПериода.Сегодня), Истина);		
	
	ОбновитьДинамическоеМенюФильтрации_ДатаОбработки();
	ОбновитьДинамическоеМенюФильтрации_СтатусПациента();
			
	Если ОбновитьСписок Тогда 
		АктуализироватьДанныеСпискаСогласноОтборов();	
	КонецЕсли; 	
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр статус.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Статус(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию	
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра	
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Статус'; en = 'Status'"));	
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Статус");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Статус");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Статус");	
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Статус");	
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Статус");	
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗаявок"));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)	
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра	
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																														
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр структурная единица.
//
// Параметры:
//  ТаблицаСтруктурныхЕдиниц - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_СтруктурнаяЕдиница(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Клиника'; en = 'Clinics'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));	

	// Если ЗначениеЗаполнено(КоллекцияЗначений) Тогда 
	//	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", Справочники.СтруктурныеЕдиницы.ПустаяСсылка(), "");
	// КонецЕсли;
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.СтруктурныеЕдиницы.ПустаяСсылка(), Нстр("ru = '<не указана>'; en = '<not indicated>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр сотрудник регистрации.
//
// Параметры:
//  ТаблицаСтатусов			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_СотрудникРегистрации(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Кем создан'; en = 'Who created'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_СотрудникРегистрации");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_СотрудникРегистрации");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_СотрудникРегистрации");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_СотрудникРегистрации");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_СотрудникРегистрации");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.Пользователи"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.Пользователи.ПустаяСсылка(), НСтр("ru = '<не указан>'; en = '<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр рекламный источник.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_РекламныйИсточник(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Источник'; en = 'Source'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_РекламныйИсточник");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_РекламныйИсточник");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_РекламныйИсточник");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_РекламныйИсточник");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_РекламныйИсточник");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.РекламныеИсточники"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.РекламныеИсточники.ПустаяСсылка(), НСтр("ru = '<не указан>'; en = '<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр рекламный источник.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_КаналПривлечения(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Рекламная площадка'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_КаналПривлечения");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_КаналПривлечения");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_КаналПривлечения");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_КаналПривлечения");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_КаналПривлечения");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.КаналыПривлечения"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.КаналыПривлечения.ПустаяСсылка(), НСтр("ru = '<не указан>'; en = '<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр менеджер.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Менеджер(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Куратор'; en = 'Curator'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Менеджер");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Менеджер");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Менеджер");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Менеджер");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Менеджер");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.Сотрудники.ПустаяСсылка(), НСтр("ru = '<не указан>'; en = '<not specified>'"), , Истина);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр менеджер.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_СтатусПациента(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Статус пациента'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_СтатусПациента");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_СтатусПациента");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_СтатусПациента");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_СтатусПациента");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_СтатусПациента");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыКонтрагентов"));	

	// Формируем коллекцию значений.
	КоллекцияЗначений = Новый ТаблицаЗначений;
	КоллекцияЗначений.Колонки.Добавить("Ссылка"			, Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыКонтрагентов"));
	КоллекцияЗначений.Колонки.Добавить("Представление"	, Новый ОписаниеТипов("Строка"));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", Перечисления.СтатусыКонтрагентов.Первичный, НСтр("ru= 'Новый'")));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", Перечисления.СтатусыКонтрагентов.Постоянный, НСтр("ru= 'Постоянный'")));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура - Обновить динамическое меню фильтрации пометка удаления заявки.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ПометкаУдаленияЗаявки(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Пометка удаления'; en = 'Delete mark'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ПометкаУдаленияЗаявки");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ПометкаУдаленияЗаявки");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ПометкаУдаленияЗаявки");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ПометкаУдаленияЗаявки");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ПометкаУдаленияЗаявки");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("Булево"));	
	СтруктураФильтра.Вставить("ВариантОтбора"							, Ложь);
	
	// Формируем коллекцию сами
	КоллекцияЗначений = Новый ТаблицаЗначений;
	КоллекцияЗначений.Колонки.Добавить("Ссылка"			, Новый ОписаниеТипов("Булево"));
	КоллекцияЗначений.Колонки.Добавить("Представление"	, Новый ОписаниеТипов("Строка"));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", Истина, НСтр("ru= 'Удалено'; en='Deleted'") ));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр период создана.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_СозданаПериод(ДанныеПериода = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Дата создания'"));
	СтруктураФильтра.Вставить("РеквизитДата"							, НачалоДня(ТекущаяДатаСеанса()));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_СозданаПериод");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_СозданаПериод");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_СозданаПериод");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_СозданаПериод");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_СозданаПериод");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СтандартныйПериод"));
	
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, , Новый СтандартныйПериод, НСтр("ru = 'За весь период'; en = 'For all period'"));
																												
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры 

&НаСервере
// Процедура, инициализировать фильтр период создана.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ДатаОбработки(ДанныеПериода = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Дата обработки'"));
	СтруктураФильтра.Вставить("РеквизитДата"							, НачалоДня(ТекущаяДатаСеанса()));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ДатаОбработки");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ДатаОбработки");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ДатаОбработки");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ДатаОбработки");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ДатаОбработки");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СтандартныйПериод"));
	
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, , Новый СтандартныйПериод, НСтр("ru = 'За весь период'; en = 'For all period'"));
																												
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры 

&НаСервере
// Процедура - Обновить значения фильтрации данных.
//
// Параметры:
//  ПараметрыОтбора				 - 	 - 
//  ОчиститьВсеФильтры			 - 	 - 
//  МассивИменОчищаемыхФильтров	 - 	 - 
//
Процедура ОбновитьЗначенияФильтрацииДанных(ПараметрыОтбора, ОчиститьВсеФильтры = Истина, МассивИменОчищаемыхФильтров = Неопределено)
	
	Если ОчиститьВсеФильтры Тогда 
		МассивИменОчищаемыхФильтров = Новый Массив();
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Статус");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_СтруктурнаяЕдиница");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Менеджер");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_СотрудникРегистрации");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_РекламныйИсточник"); 
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_КаналПривлечения");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_СозданаПериод");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ДатаОбработки");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПометкаУдаленияЗаявки");		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивИменОчищаемыхФильтров) Тогда 
		УправлениеИнтерфейсамиСервер.ДеактивироватьВсеЗначенияФильтрацииДанных(ЭтаФорма, МассивИменОчищаемыхФильтров);
	КонецЕсли;
	
	СписокСтатусовПометокУдаления = Новый СписокЗначений;
	СписокСтатусовПометокУдаления.Добавить(Истина, , Ложь);
	УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПометкаУдаленияЗаявки", СписокСтатусовПометокУдаления, Истина);		
	
	// Отбор статус. 
	Если ПараметрыОтбора.Свойство("МассивСтатусов") Тогда 	
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Статус", ПараметрыОтбора.МассивСтатусов, Истина);
	КонецЕсли;
	
	// Отбор структурная единица.
	Если ПараметрыОтбора.Свойство("МассивСтруктурныхЕдиниц") Тогда 
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтруктурнаяЕдиница", ПараметрыОтбора.МассивСтруктурныхЕдиниц);		
	Иначе 
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	КонецЕсли;

	// Отбор менеджеров.
	Если ПараметрыОтбора.Свойство("МассивМенеджеров") Тогда 		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Менеджер", ПараметрыОтбора.МассивМенеджеров);
	КонецЕсли;	
			
	АктуализироватьДанныеСпискаСогласноОтборов();
	
КонецПроцедуры

&НаСервере
// Процедура, актуализировать данные списка согласно отборов.
//
Процедура АктуализироватьДанныеСпискаСогласноОтборов()
	
	СтруктураОтборов				 = ПолучитьСтруктуруЗначенийОтбора();
	ЗапросДляДинамическогоСписка	 = ПолучитьЗапросДляДинамическогоСписка(СтруктураОтборов);
	
	// Цепляем наш запрос динамическому списку
	Список.ТекстЗапроса = ЗапросДляДинамическогоСписка.Текст;
	
	// Устанавливаем параметры динамическому списку
	Для Каждого ПараметрЗапроса Из ЗапросДляДинамическогоСписка.Параметры Цикл 
		Список.Параметры.УстановитьЗначениеПараметра(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Функция, возвращает структуру отборов формы.
//
Функция ПолучитьСтруктуруЗначенийОтбора()
	
	// Метод "ПолучитьЗначенияФильтра" возвращает список активированных значений фильтра.
	// У полученного списка значений есть свойство "ДоступныеЗначения", в котором хранится список всех значений.
	// Таким образом мы одним методом за одну итерацию получаем 2 списка значений(с активированными значениями и всеми значениями).
	// Вариант отбора передается в свойстве "ДоступныеЗначения" в представлении у любого элемента списка.
	
	СтруктураОтборов = Новый Структура();
	СтруктураОтборов.Вставить("ОтборСтатус"					, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Статус"));
	СтруктураОтборов.Вставить("ОтборСтруктурнаяЕдиница"		, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СтруктурнаяЕдиница"));
	СтруктураОтборов.Вставить("ОтборМенеджер"				, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Менеджер"));			
	СтруктураОтборов.Вставить("ОтборСотрудникРегистрации"	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СотрудникРегистрации"));
	СтруктураОтборов.Вставить("ОтборРекламныйИсточник"		, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_РекламныйИсточник"));
	СтруктураОтборов.Вставить("ОтборДатаСоздания"			, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СозданаПериод"));
	СтруктураОтборов.Вставить("ОтборДатаОбработки"			, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ДатаОбработки"));
	СтруктураОтборов.Вставить("ОтборКаналПривлечения"		, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_КаналПривлечения"));	
	СтруктураОтборов.Вставить("ОтборПометкаУдаления"		, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПометкаУдаленияЗаявки"));
	СтруктураОтборов.Вставить("ОтборСтатусПациента"			, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СтатусПациента"));
		
	Возврат СтруктураОтборов;
	
КонецФункции	

&НаСервере
// Функция, возвращает запрос с установленными параметрами, для списка формы.
//
Функция ПолучитьЗапросДляДинамическогоСписка(СтруктураОтборов)
	
	// Текст запроса без отборов (чистый).
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Заявки.ДатаСоздания КАК Дата,
	|	Заявки.ДатаОбработки КАК ДатаОбработки,
	|	Заявки.Ссылка КАК Ссылка,
	|	Заявки.ОсновнойМенеджер КАК Менеджер,
	|	Заявки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Заявки.РекламныйИсточник КАК РекламныйИсточник,
	|	Заявки.КаналПривлечения КАК КаналПривлечения,
	|	Заявки.КаналПривлеченияЗначение КАК КаналПривлеченияЗначение,
	|	ВЫРАЗИТЬ(Заявки.Код КАК Строка(100)) КАК Обращение,
	|	Заявки.Статус КАК Статус,
	|	Заявки.СтатусПациента КАК СтатусПациента,
	|	Заявки.Автор КАК Автор,
	|	Заявки.ОсновнойКлиент КАК ОсновнойКлиент,
	|	Заявки.НомерТелефона КАК НомерТелефона,
	|	Заявки.ct_cid КАК ct_cid,
	|	Заявки.ga_cid КАК ga_cid,
	|	Заявки.rs_cid КАК rs_cid,
	|	Заявки.rs_vid КАК rs_vid,
	|	Заявки.utm_campaign КАК utm_campaign,
	|	Заявки.utm_content КАК utm_content,
	|	Заявки.utm_medium КАК utm_medium,
	|	Заявки.utm_source КАК utm_source,
	|	Заявки.utm_term КАК utm_term,
	|	Заявки.ym_cid КАК ym_cid,
	|	Заявки.fitness1c_cid КАК fitness1c_cid,
	|	Заявки.ip КАК ip,
	|	Заявки.user_agent КАК user_agent,
	|	Заявки.Комментарий КАК Комментарий
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|ГДЕ
	|	&УсловиеПометкаУдаления
	|	И &УсловиеСтатус
	|	И &УсловиеСтруктурнаяЕдиница
	|	И &УсловиеМенеджер
	|	И &УсловиеРекламныйИсточник
	|	И &УсловиеКаналПривлечения
	|	И &УсловиеСотрудникРегистрации
	|	И &УсловиеДатаОбработки
	|	И &УсловиеСтатусПациента
	|	И &УсловиеДатаСоздания");
	
	// Отбор пометка удаления.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборПометкаУдаления)
		И СтруктураОтборов.ОтборПометкаУдаления[0].Значение = Истина Тогда
		
		УсловиеПометкаУдаления = СтруктураОтборов.ОтборПометкаУдаления.ДоступныеЗначения[0].Представление + "Заявки.ПометкаУдаления = ИСТИНА";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПометкаУдаления", УсловиеПометкаУдаления);
	Иначе		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПометкаУдаления", "ИСТИНА");
	КонецЕсли;	
	
	// Отбор статус
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборСтатус) Тогда		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтатус" + Символы.ПС, СтруктураОтборов.ОтборСтатус.ДоступныеЗначения[0].Представление + "Заявки.Статус В (&ОтборСтатус)" + Символы.ПС);
		Запрос.УстановитьПараметр("ОтборСтатус", СтруктураОтборов.ОтборСтатус.ВыгрузитьЗначения());		
	Иначе		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтатус" + Символы.ПС, "ИСТИНА" + Символы.ПС);
	КонецЕсли;
	
	// Отбор структурная единица.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборСтруктурнаяЕдиница) Тогда
		УсловиеСтруктурнаяЕдиница = СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения[0].Представление + "Заявки.СтруктурнаяЕдиница В (&ОтборСтруктурнаяЕдиница)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", УсловиеСтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("ОтборСтруктурнаяЕдиница", СтруктураОтборов.ОтборСтруктурнаяЕдиница.ВыгрузитьЗначения());
	Иначе
		Если СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения.Количество() <> 0 Тогда 
			ВариантОтбора = СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения[0].Представление;
		Иначе 
			ВариантОтбора = "";
		КонецЕсли;			
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", ВариантОтбора + "Заявки.СтруктурнаяЕдиница В (&ОтборСтруктурнаяЕдиница)");			
		Запрос.УстановитьПараметр("ОтборСтруктурнаяЕдиница", СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения.ВыгрузитьЗначения());				
		// Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", "ИСТИНА");
	КонецЕсли;
	
	// Отбор менеджер.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборМенеджер) Тогда
		УсловиеМенеджер = СтруктураОтборов.ОтборМенеджер.ДоступныеЗначения[0].Представление + "Заявки.ОсновнойМенеджер В (&ОтборМенеджер)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеМенеджер", УсловиеМенеджер);
		Запрос.УстановитьПараметр("ОтборМенеджер", СтруктураОтборов.ОтборМенеджер.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеМенеджер", "ИСТИНА");	
	КонецЕсли;
	
	// Отбор рекламный источник.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборРекламныйИсточник) Тогда
		УсловиеРекламныйИсточник = СтруктураОтборов.ОтборРекламныйИсточник.ДоступныеЗначения[0].Представление + "Заявки.РекламныйИсточник В (&ОтборРекламныйИсточник)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеРекламныйИсточник", УсловиеРекламныйИсточник);
		Запрос.УстановитьПараметр("ОтборРекламныйИсточник", СтруктураОтборов.ОтборРекламныйИсточник.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеРекламныйИсточник", "ИСТИНА");
	КонецЕсли;
	
	// Отбор канал привлечения.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборКаналПривлечения) Тогда
		УсловиеКаналПривлечения = СтруктураОтборов.ОтборКаналПривлечения.ДоступныеЗначения[0].Представление + "Заявки.КаналПривлечения В (&ОтборКаналПривлечения)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКаналПривлечения", УсловиеКаналПривлечения);
		Запрос.УстановитьПараметр("ОтборКаналПривлечения", СтруктураОтборов.ОтборКаналПривлечения.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКаналПривлечения", "ИСТИНА");
	КонецЕсли;
	
	// Отбор сотрудник регистрации.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборСотрудникРегистрации) Тогда
		УсловиеСотрудникРегистрации = СтруктураОтборов.ОтборСотрудникРегистрации.ДоступныеЗначения[0].Представление + "Заявки.Автор В (&ОтборСотрудникРегистрации)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСотрудникРегистрации", УсловиеСотрудникРегистрации);
		Запрос.УстановитьПараметр("ОтборСотрудникРегистрации", СтруктураОтборов.ОтборСотрудникРегистрации.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСотрудникРегистрации", "ИСТИНА");	
	КонецЕсли;
	
	// Отбор дата создания.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборДатаСоздания) Тогда   
		УсловиеДатаСоздания = "Заявки.ДатаСоздания МЕЖДУ &ДатаРегистрацииДатаНачала И &ДатаРегистрацииДатаОкончания"; 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДатаСоздания", УсловиеДатаСоздания);
		ДатаНачала = СтруктураОтборов.ОтборДатаСоздания[0].Значение.ДатаНачала;
		ДатаОкончания = СтруктураОтборов.ОтборДатаСоздания[0].Значение.ДатаОкончания;
		Запрос.УстановитьПараметр("ДатаРегистрацииДатаНачала"   , ?(ЗначениеЗаполнено(ДатаНачала),     ДатаНачала, Дата(01,01,0001)));
		Запрос.УстановитьПараметр("ДатаРегистрацииДатаОкончания", ?(ЗначениеЗаполнено(ДатаОкончания),  ДатаОкончания, Дата(3999,12,31)));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДатаСоздания", "ИСТИНА")
	КонецЕсли;
	
	// Отбор дата обработки.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборДатаОбработки) Тогда   
		УсловиеДатаОбработки = "Заявки.ДатаОбработки МЕЖДУ &ДатаОбработкиДатаНачала И &ДатаОбработкиДатаОкончания"; 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДатаОбработки", УсловиеДатаОбработки);
		ДатаНачала = СтруктураОтборов.ОтборДатаОбработки[0].Значение.ДатаНачала;
		ДатаОкончания = СтруктураОтборов.ОтборДатаОбработки[0].Значение.ДатаОкончания;
		Запрос.УстановитьПараметр("ДатаОбработкиДатаНачала"   , ?(ЗначениеЗаполнено(ДатаНачала),     ДатаНачала, Дата(01,01,0001)));
		Запрос.УстановитьПараметр("ДатаОбработкиДатаОкончания", ?(ЗначениеЗаполнено(ДатаОкончания),  ДатаОкончания, Дата(3999,12,31)));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДатаОбработки", "ИСТИНА")
	КонецЕсли;
	
	// Отбор статус пациента.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборСтатусПациента) Тогда
		УсловиеСтатусПациента = СтруктураОтборов.ОтборСтатусПациента.ДоступныеЗначения[0].Представление + "Заявки.СтатусПациента В (&ОтборСтатусПациента)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтатусПациента", УсловиеСтатусПациента);
		Запрос.УстановитьПараметр("ОтборСтатусПациента", СтруктураОтборов.ОтборСтатусПациента);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтатусПациента", "ИСТИНА")
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции	

&НаСервереБезКонтекста
// Функция, возвращает пакет запроса с элементами для создания отборов.
//
Функция ПолучитьПакетЗапросаЗначенийДляОтборов(ТекущийПользователь)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыЗаявок.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СтатусыЗаявок.Ссылка) КАК Представление
	|ИЗ
	|	Перечисление.СтатусыЗаявок КАК СтатусыЗаявок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СотрудникиМестаРаботы.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СотрудникиМестаРаботы.Ссылка) КАК Представление
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СотрудникиМестаРаботы
	|ГДЕ
	|	СотрудникиМестаРаботы.ПометкаУдаления = ЛОЖЬ
	|	И СотрудникиМестаРаботы.ЭтоГруппа = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Заявки.ОсновнойМенеджер КАК Ссылка,
	|	Заявки.ОсновнойМенеджер.Представление КАК Представление
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|ГДЕ
	|	НЕ Заявки.ОсновнойМенеджер.ПометкаУдаления
	|	И Заявки.ОсновнойМенеджер <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РекламныеИсточники.Ссылка КАК Ссылка,
	|	РекламныеИсточники.Представление КАК Представление
	|ИЗ
	|	Справочник.РекламныеИсточники КАК РекламныеИсточники
	|ГДЕ
	|	РекламныеИсточники.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Заявки.Автор КАК Ссылка,
	|	Заявки.Автор.Представление КАК Представление
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|ГДЕ
	|	НЕ Заявки.Автор.ПометкаУдаления
	|	И Заявки.Автор <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РекламныеИсточники.Ссылка) КАК Количество
	|ИЗ
	|	Справочник.РекламныеИсточники КАК РекламныеИсточники
	|ГДЕ
	|	РекламныеИсточники.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КаналыПривлечения.Ссылка КАК Ссылка,
	|	КаналыПривлечения.Представление КАК Представление
	|ИЗ
	|	Справочник.КаналыПривлечения КАК КаналыПривлечения
	|ГДЕ
	|	НЕ КаналыПривлечения.ПометкаУдаления");
	
	Возврат Запрос.ВыполнитьПакет();
		
КонецФункции

&НаСервере
// Процедура - Инициализировать механизм фильтрации данных
//
// Параметры:
//  ПараметрыОтбора	 - 	 - 
//  ОбновитьСписок	 - 	 - 
//
Процедура ОбновитьМеханизмФильтрацииДанных(ПараметрыОтбора = Неопределено, ОчиститьФильтры = Ложь)
	
	Для каждого Строка из ТаблицаФильтров Цикл
		Строка.Инициализирован = Ложь;
	КонецЦикла;
	
	МассивИменОчищаемыхФильтров = Новый Массив();
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Статус");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_СтруктурнаяЕдиница");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_СотрудникРегистрации");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_РекламныйИсточник");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_КаналПривлечения");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_СозданаПериод");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ДатаОбработки");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПометкаУдаленияЗаявки");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Менеджер");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_СтатусПациента");
	
	УправлениеИнтерфейсамиСервер.ДеактивироватьВсеЗначенияФильтрацииДанных(ЭтаФорма, МассивИменОчищаемыхФильтров);
	
	РезультатПакетногоЗапроса = ПолучитьПакетЗапросаЗначенийДляОтборов(ТекущийПользователь);	
	
	// Отбор статус.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтатусов");	
	ОбновитьДинамическоеМенюФильтрации_Статус(РезультатПакетногоЗапроса[0].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтатусов_ВариантОтбора"), ПараметрыОтбора.МассивСтатусов_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Статус", ПараметрыОтбора.МассивСтатусов, Истина,,,ВариантОтбора);		
	КонецЕсли;
	
	// Отбор структурная единица.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтруктурныхЕдиниц");	
	ОбновитьДинамическоеМенюФильтрации_СтруктурнаяЕдиница(РезультатПакетногоЗапроса[1].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтруктурныхЕдиниц_ВариантОтбора"), ПараметрыОтбора.МассивСтруктурныхЕдиниц_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтруктурнаяЕдиница", ПараметрыОтбора.МассивСтруктурныхЕдиниц, Истина,,, ВариантОтбора);		
	КонецЕсли;
	
	// Отбор сотрудника регистрации.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСотрудниковРегистрации");
	ОбновитьДинамическоеМенюФильтрации_СотрудникРегистрации(РезультатПакетногоЗапроса[4].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСотрудниковРегистрации_ВариантОтбора"), ПараметрыОтбора.МассивСотрудниковРегистрации_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СотрудникРегистрации", ПараметрыОтбора.МассивСотрудниковРегистрации, Истина,,, ВариантОтбора);	
	КонецЕсли;
	
	// Отбор рекламного источника.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивРекламныхИсточников");
	ОбновитьДинамическоеМенюФильтрации_РекламныйИсточник(РезультатПакетногоЗапроса[3].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивРекламныхИсточников_ВариантОтбора"), ПараметрыОтбора.МассивРекламныхИсточников_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_РекламныйИсточник", ПараметрыОтбора.МассивРекламныхИсточников, Истина,,, ВариантОтбора);	
	КонецЕсли;
	
	// Отбор канала привлечения.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивКаналовПривлечения");
	ОбновитьДинамическоеМенюФильтрации_КаналПривлечения(РезультатПакетногоЗапроса[6].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивКаналовПривлечения_ВариантОтбора"), ПараметрыОтбора.МассивКаналовПривлечения_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_КаналПривлечения", ПараметрыОтбора.МассивКаналовПривлечения, Истина,,, ВариантОтбора);	
	КонецЕсли;
	
	// Отбор пометка удаления сделки.         
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("СписокСтатусовПометокУдаления"); 
	ОбновитьДинамическоеМенюФильтрации_ПометкаУдаленияЗаявки(, УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("СписокСтатусовПометокУдаления_ВариантОтбора"), ПараметрыОтбора.СписокСтатусовПометокУдаления_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПометкаУдаленияЗаявки", ПараметрыОтбора.СписокСтатусовПометокУдаления, Истина,,, ВариантОтбора);				
	КонецЕсли;
	
	// Отбор менеджеров.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивМенеджеров"); 
	ОбновитьДинамическоеМенюФильтрации_Менеджер(РезультатПакетногоЗапроса[2].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивМенеджеров_ВариантОтбора"), ПараметрыОтбора.МассивМенеджеров_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Менеджер", ПараметрыОтбора.МассивМенеджеров, Истина, НСтр("ru = '<не указан>'; en = '<not specified>'"),, ВариантОтбора);
	КонецЕсли;	
	
	// Отбор дата создания.	
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("ПериодСозданияСделки");
	ОбновитьДинамическоеМенюФильтрации_СозданаПериод(, УстановитьОтбор);
	Если УстановитьОтбор Тогда
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СозданаПериод", ПараметрыОтбора.ПериодСозданияСделки);	
	КонецЕсли;
	
	// Отбор дата обработки.	
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("ПериодОбработки");
	ОбновитьДинамическоеМенюФильтрации_ДатаОбработки(, УстановитьОтбор);
	Если УстановитьОтбор Тогда
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ДатаОбработки", ПараметрыОтбора.ПериодОбработки);	
	КонецЕсли;
	
	// Отбор статус пациента.	
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтатусовПациента");
	ОбновитьДинамическоеМенюФильтрации_СтатусПациента(, УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтатусовПациента_ВариантОтбора"), ПараметрыОтбора.МассивСтатусовПациента_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтатусПациента", ПараметрыОтбора.МассивСтатусовПациента, Истина,,, ВариантОтбора);				
	КонецЕсли;
	
	АктуализироватьДанныеСпискаСогласноОтборов();
	
КонецПроцедуры

#КонецОбласти

#Область ___________________ОБРАБОТЧИКИ_МЕХАНИЗМА_ФИЛЬТРАЦИИ_______________________

&НаСервере
// Процедура - Применить механизм фильтрации данных.
//
// Параметры:
//  ДанныеЭлементаФильтрации - 	 - 
//
Процедура ПрименитьМеханизмФильтрацииДанных(ДанныеЭлементаФильтрации) Экспорт
	
	МассивСтрокОбрабатываемыхФильтров = ТаблицаФильтров.НайтиСтроки(Новый Структура("Применен", Ложь));
	Для Каждого СтрокаФильтра ИЗ МассивСтрокОбрабатываемыхФильтров Цикл
		УправлениеИнтерфейсамиСервер.ОбновитьГруппуАктивированныхЗначенийФильтра(ЭтаФорма, СтрокаФильтра);
	КонецЦикла;
	
	АктуализироватьДанныеСпискаСогласноОтборов();	
	ЭтаФорма.ТекущийЭлемент = Элементы.Список;
		
КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик нажатия элемента фильтрации данных.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОбработчикНажатияЭлементаФильтрацииДанных(Команда, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	МассивИмен = СтрРазделить(Команда.Имя,"_");
	
	Если МассивИмен.Количество() <> 0 Тогда 
		Если МассивИмен[0] = "Удалить" Тогда
			
			РезультатОбновления = УправлениеИнтерфейсамиКлиент.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, Команда.Имя, , ВыбранноеЗначение);
			Если РезультатОбновления.Свойство("ДействиеЭлемента") И РезультатОбновления.ДействиеЭлемента = "ОбработкаВыбора" Тогда 
				Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда 
					СтандартнаяОбработка = Ложь;
					// ВыбранноеЗначение = Неопределено;
					// ЭлементФормы.ОбновитьТекстРедактирования(); 			
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Отбор"				, ПараметрыВыбранныхФильтров(Новый Структура));
			ПараметрыФормы.Вставить("ИмяКоманды"		, Команда.Имя);
			ПараметрыФормы.Вставить("ВыбранноеЗначение" , ВыбранноеЗначение);
			
			ОткрытьФорму("Справочник.Заявки.Форма.ФормаФильтры",
						 ПараметрыФормы,,,,,
						 Новый ОписаниеОповещения("ОткрытиеФильтровЗавершение", ЭтотОбъект),
						 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - получение сведений о выбранных фильтрах.
//
Функция ПараметрыВыбранныхФильтров(ПараметрыОтбора)
	
	Для каждого Строка из ТаблицаФильтров Цикл
		Если Строка.КоличествоАктивированныхЗначений > 0 Тогда
			
			МассивДанных = ПолучениеЭлементовОтбора(Новый Массив, Строка.СписокЗначений, Строка.Наименование);
			
			Если Строка.Наименование = "Фильтр_Статус" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусов"			     			  , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусов_ВариантОтбора"				  , Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_СтруктурнаяЕдиница" Тогда
				ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц"					  , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц_ВариантОтбора"	  , Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Менеджер" Тогда
				ПараметрыОтбора.Вставить("МассивМенеджеров"				 			  , МассивДанных);
				ПараметрыОтбора.Вставить("МассивМенеджеров_ВариантОтбора"			  , Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_СотрудникРегистрации" Тогда
				ПараметрыОтбора.Вставить("МассивСотрудниковРегистрации"				  , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСотрудниковРегистрации_ВариантОтбора" , Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_РекламныйИсточник" Тогда
				ПараметрыОтбора.Вставить("МассивРекламныхИсточников"			  	  , МассивДанных);
				ПараметрыОтбора.Вставить("МассивРекламныхИсточников_ВариантОтбора"    , Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_КаналПривлечения" Тогда
				ПараметрыОтбора.Вставить("МассивКаналовПривлечения"				 	  , МассивДанных);
				ПараметрыОтбора.Вставить("МассивКаналовПривлечения_ВариантОтбора"	  , Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_СтатусПациента" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусовПациента"				, МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусовПациента_ВариантОтбора"	, Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_ПометкаУдаленияЗаявки" Тогда
				ПараметрыОтбора.Вставить("СписокСтатусовПометокУдаления"			  , МассивДанных);
				ПараметрыОтбора.Вставить("СписокСтатусовПометокУдаления_ВариантОтбора", Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_СозданаПериод" Тогда
				ПараметрыОтбора.Вставить("ПериодСозданияСделки", МассивДанных);

			ИначеЕсли Строка.Наименование = "Фильтр_ДатаОбработки" Тогда
				ПараметрыОтбора.Вставить("ПериодОбработки", МассивДанных);

			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ПараметрыОтбора, Новый УникальныйИдентификатор);
	
КонецФункции

&НаСервереБезКонтекста
// Функция - ПолучениеЭлементовОтбора
Функция ПолучениеЭлементовОтбора(Массив, СписокЗначений, НаименованиеФильтра)
	
	Если НаименованиеФильтра = "Фильтр_СозданаПериод" Или НаименованиеФильтра = "Фильтр_ДатаОбработки" Тогда
		Если СписокЗначений.Количество() > 0 Тогда
			ЗаданноеЗначение = СписокЗначений.Получить(0).Значение; 
			Массив.Добавить(ЗаданноеЗначение.ЗначениеФильтра);
		КонецЕсли;
	Иначе
		Если СписокЗначений.Количество() > 0 Тогда
			Для каждого Значение из СписокЗначений Цикл
				Если Значение.Значение.Выбран = Истина Тогда
					Массив.Добавить(Значение.Значение.ЗначениеФильтра);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
// Функция - Данные выбранных фильтров.
//
Функция ПараметрыВыбранныхФильтровКлиент()
	
	ПараметрыОтбора = Новый Структура;
	
	Для Каждого Строка из ТаблицаФильтров Цикл
		Если Строка.КоличествоАктивированныхЗначений > 0 Тогда
			
			МассивДанных = ПолучениеЭлементовОтбораКлиент(Новый Массив, Строка.СписокЗначений, Строка.Наименование);
			
			Если Строка.Наименование = "Фильтр_Статус" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусов"			   				  , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусов_ВариантОтбора"				  , Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_СтруктурнаяЕдиница" Тогда
				ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц"					  , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц_ВариантОтбора"	  , Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Менеджер" Тогда
				ПараметрыОтбора.Вставить("МассивМенеджеров"				 			  , МассивДанных);
				ПараметрыОтбора.Вставить("МассивМенеджеров_ВариантОтбора"			  , Строка.ВариантОтбора);
 
			ИначеЕсли Строка.Наименование = "Фильтр_СотрудникРегистрации" Тогда
				ПараметрыОтбора.Вставить("МассивСотрудниковРегистрации"				  , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСотрудниковРегистрации_ВариантОтбора" , Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_РекламныйИсточник" Тогда
				ПараметрыОтбора.Вставить("МассивРекламныхИсточников"			  	  , МассивДанных);
				ПараметрыОтбора.Вставить("МассивРекламныхИсточников_ВариантОтбора"	  , Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_КаналПривлечения" Тогда
				ПараметрыОтбора.Вставить("МассивКаналовПривлечения"				 	  , МассивДанных);
				ПараметрыОтбора.Вставить("МассивКаналовПривлечения_ВариантОтбора"	  , Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_СтатусПациента" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусовПациента"				, МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусовПациента_ВариантОтбора"	, Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_ПометкаУдаленияЗаявки" Тогда
				ПараметрыОтбора.Вставить("СписокСтатусовПометокУдаления"			  , МассивДанных);
				ПараметрыОтбора.Вставить("СписокСтатусовПометокУдаления_ВариантОтбора", Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_СозданаПериод" Тогда
				ПараметрыОтбора.Вставить("ПериодСозданияСделки", МассивДанных);

			ИначеЕсли Строка.Наименование = "Фильтр_ДатаОбработки" Тогда
				ПараметрыОтбора.Вставить("ПериодОбработки", МассивДанных);

			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПараметрыОтбора;
	
КонецФункции

&НаКлиенте
// Функция - ПолучениеЭлементовОтбора
Функция ПолучениеЭлементовОтбораКлиент(Массив, СписокЗначений, НаименованиеФильтра)
	
	Если НаименованиеФильтра = "Фильтр_СозданаПериод" Или НаименованиеФильтра = "Фильтр_ДатаОбработки" Тогда
		Если СписокЗначений.Количество() > 0 Тогда
			ЗаданноеЗначение = СписокЗначений.Получить(0).Значение; 
			Массив.Добавить(ЗаданноеЗначение.ЗначениеФильтра);
		КонецЕсли;
	Иначе
		Если СписокЗначений.Количество() > 0 Тогда
			Для каждого Значение из СписокЗначений Цикл
				Если Значение.Значение.Выбран = Истина Тогда
					Массив.Добавить(Значение.Значение.ЗначениеФильтра);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
// Процедура - ОткрытиеФильтровЗавершение.
//
Процедура ОткрытиеФильтровЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытиеФильтровНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
// Процедура - ОткрытиеФильтровНаСервере.
//
Процедура ОткрытиеФильтровНаСервере(Результат)
	
	ПараметрыОтбора = ПолучитьИзВременногоХранилища(Результат);
	ОбновитьМеханизмФильтрацииДанных(ПараметрыОтбора, Истина);	
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить свойства разделов фильтра.
//
// Параметры:
//  АктуализироватьФлаги - 	 - 
//
Процедура ОбновитьСвойстваРазделовФильтра(АктуализироватьФлаги = Ложь, ИмяСтраницыЗначенийФильтра = Неопределено) Экспорт
	
	Если ИмяСтраницыЗначенийФильтра <> Неопределено Тогда 
		Элементы.СтраницыЗначенийФильтров.ТекущаяСтраница = Элементы[ИмяСтраницыЗначенийФильтра];
	КонецЕсли;		
	УправлениеИнтерфейсамиСервер.ОбновитьСвойстваРазделовФильтра(ЭтаФорма, АктуализироватьФлаги);
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить группу значений фильтра.
//
// Параметры:
//  ИдентификаторСтрокиФильтра	 - 	 - 
//
Процедура ОбновитьГруппуЗначенийФильтра(ИдентификаторСтрокиФильтра, ИнициализироватьВыбранноеЗначение = Ложь, ВыбранноеЗначение = Неопределено) Экспорт
	
	СтрокаФильтра = ТаблицаФильтров.НайтиПоИдентификатору(ИдентификаторСтрокиФильтра);
	УправлениеИнтерфейсамиСервер.ОбновитьГруппуЗначенийФильтра(ЭтаФорма, СтрокаФильтра, ИнициализироватьВыбранноеЗначение, ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить свойства элемента значения.
//
// Параметры:
//  ДанныеЭлементаФильтрации - 	 - 
//
Процедура ОбновитьСвойстваЭлементаЗначения(ДанныеЭлементаФильтрации) Экспорт
	
	УправлениеИнтерфейсамиСервер.ОбновитьСвойстваЭлементаЗначения(ЭтаФорма, , , ДанныеЭлементаФильтрации);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор стандартного периода.
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВыборСтандартногоПериода(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ РезультатВыбора = Неопределено И НЕ ДополнительныеПараметры = Неопределено Тогда
		ЭлементВариантСтандартногоПериода = ЭтаФорма[ДополнительныеПараметры.ИмяТаблицы].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторФильтра).СписокЗначений[0].Значение.СписокСтандартныхПериодов.НайтиПоЗначению(РезультатВыбора.Значение);
		Если НЕ ЭлементВариантСтандартногоПериода = Неопределено Тогда
			ДополнительныеПараметры.Вставить("ИдентификаторЗначения", ЭлементВариантСтандартногоПериода.ПолучитьИдентификатор());
			ЭтаФорма[ДополнительныеПараметры.ИмяТаблицы].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторФильтра).СписокЗначений[0].Значение.СписокСтандартныхПериодов.ЗаполнитьПометки(Ложь);
			ЭлементВариантСтандартногоПериода.Пометка = Истина;
			РезультатОбновления = УправлениеИнтерфейсамиКлиент.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, "УстановитьСтандартныйПериод_ЗначениеФильтра_Идентификатор_" + ДополнительныеПараметры.ИдентификаторФильтра, ДополнительныеПараметры);
		КонецЕсли;	
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

&НаСервере
// Процедура, устанавливает фильтр по статусу.
//
Процедура УстановитьФильтрПоСтатусу()
	
	МассивИменОчищаемыхФильтров = Новый_Массив("Статус");
	УправлениеИнтерфейсамиСервер.ДеактивироватьВсеЗначенияФильтрацииДанных(ЭтаФорма, МассивИменОчищаемыхФильтров);
	
	МассивСтатусовВсе = Новый Массив;
	МассивСтатусовВсе.Добавить(Перечисления.СтатусыЗаявок.НеОбработана);
	МассивСтатусовВсе.Добавить(Перечисления.СтатусыЗаявок.ПропущенныйЗвонок);
	МассивСтатусовВсе.Добавить(Перечисления.СтатусыЗаявок.ОтвеченныйЗвонок);
	МассивСтатусовВсе.Добавить(Перечисления.СтатусыЗаявок.ОтвеченныйДиалог);
	МассивСтатусовВсе.Добавить(Перечисления.СтатусыЗаявок.Перезвонить);
	МассивСтатусовВсе.Добавить(Перечисления.СтатусыЗаявок.Принята);
	МассивСтатусовВсе.Добавить(Перечисления.СтатусыЗаявок.Отклонена);
	
	МассивСтатусовИсключаемые = Новый Массив;
	МассивСтатусовИсключаемые.Добавить(Перечисления.СтатусыЗаявок.Принята);
	МассивСтатусовИсключаемые.Добавить(Перечисления.СтатусыЗаявок.Отклонена);
	
	ОбновитьДинамическоеМенюФильтрации_Статус(МассивСтатусовВсе, Истина);
	УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Статус", МассивСтатусовИсключаемые, Истина,,, Ложь);		
	
	АктуализироватьДанныеСпискаСогласноОтборов();
	
КонецПроцедуры

#КонецОбласти

&НаСервере
// Процедура, задает условное оформление списка.
//
Процедура СоздатьУсловноеОформление()
	
	// Не обработана.
	ЭлементУсловногоОформления = ЭтотОбъект.Список.УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Статус");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Перечисления.СтатусыЗаявок.НеОбработана;
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона"  , Новый Цвет(0, 185, 97));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 255, 255));
	
	ПолеОформления				 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("Статус");
	ПолеОформления.Использование = Истина;
	
	// Пропущенный звонок.
	ЭлементУсловногоОформления = ЭтотОбъект.Список.УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Статус");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Перечисления.СтатусыЗаявок.ПропущенныйЗвонок;
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(253, 176, 81));
	
	ПолеОформления				 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("Статус");
	ПолеОформления.Использование = Истина;
	
	// Отвеченный диалог, отвеченный звонок.
	ЭлементУсловногоОформления = ЭтотОбъект.Список.УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Статус");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке; 
	ЭлементОтбора.ПравоеЗначение = Новый_Массив(Перечисления.СтатусыЗаявок.ОтвеченныйДиалог, Перечисления.СтатусыЗаявок.ОтвеченныйЗвонок);
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(163, 212, 155));
	
	ПолеОформления				 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("Статус");
	ПолеОформления.Использование = Истина;
	
	// Перезвонить.
	ЭлементУсловногоОформления = ЭтотОбъект.Список.УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Статус");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Перечисления.СтатусыЗаявок.Перезвонить;
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 238, 149));
	
	ПолеОформления				 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("Статус");
	ПолеОформления.Использование = Истина;
	
	// Качественная.
	ЭлементУсловногоОформления = ЭтотОбъект.Список.УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Статус");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Перечисления.СтатусыЗаявок.Принята;
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(47, 182, 100));
	
	ПолеОформления				 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("Статус");
	ПолеОформления.Использование = Истина;
	
	// Некачественная.
	ЭлементУсловногоОформления = ЭтотОбъект.Список.УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Статус");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Перечисления.СтатусыЗаявок.Отклонена;
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона"  , Новый Цвет(241, 23, 22));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 255, 255));
	
	ПолеОформления				 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("Статус");
	ПолеОформления.Использование = Истина;
	
	
КонецПроцедуры

&НаКлиенте
// Процедура, устанавливает отбор по статусу.
//
Процедура УстановитьОтбор(ПараметрыОтбора) Экспорт
	
	// Используется для установки фильтра из формы канбана.
	// См. ФормаСпискаКанбан.ПерейтиВСписок.
	ОбновитьМеханизмФильтрацииДанных(ПараметрыОтбора, Истина);
	
КонецПроцедуры

#КонецОбласти
