
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, "При создании на сервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Элементы.Код.Видимость = ?(ОтображниеКода, Истина, Ложь);
	Элементы.Код.ПоложениеЗаголовка = ?(ОтображниеКода,ПоложениеЗаголовкаЭлементаФормы.Авто, ПоложениеЗаголовкаЭлементаФормы.Нет);
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();  
	
	
	
КонецПроцедуры

#КонецОбласти