
#Область СлужебныйПрограммныйИнтерфейс

// Функция - Инициализировать причину отказа
//
// Параметры:
//  ПричинаОтмены		 - 	 - 
//  ГенерироватьАналог	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьПричинуОтказа(ПричинаОтмены, ГенерироватьАналог = Ложь) Экспорт 
	
	Если ТипЗнч(ПричинаОтмены) = Тип("Строка") Тогда 
		Если НЕ ЗначениеЗаполнено(СокрЛП(ПричинаОтмены)) Тогда 
			Возврат Неопределено;
		КонецЕсли;
		НаименованиеПричинаОтмены = ПричинаОтмены;
	Иначе 	
		НаименованиеПричинаОтмены = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ПричинаОтмены, "Наименование");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", СокрЛ(НаименованиеПричинаОтмены) + "%");
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПричиныОтказов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПричиныОтказов КАК ПричиныОтказов
	|ГДЕ
	|	ПричиныОтказов.Наименование ПОДОБНО &Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПричиныОтказов.Код УБЫВ";
	
	ВыборкаПричиныОтказа = Запрос.Выполнить().Выбрать();
	Если ВыборкаПричиныОтказа.Следующий() Тогда 
		Возврат ВыборкаПричиныОтказа.Ссылка;
	ИначеЕсли ГенерироватьАналог Тогда  
		ПричинаОтказа_Объект = СоздатьЭлемент();
		ПричинаОтказа_Объект.Наименование = СокрЛП(НаименованиеПричинаОтмены);
		ПричинаОтказа_Объект.УстановитьНовыйКод();
		Попытка
			ПричинаОтказа_Объект.ОбменДанными.Загрузка = Истина;
			ПричинаОтказа_Объект.Записать();
			Возврат ПричинаОтказа_Объект.Ссылка;
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции	

// Процедура - Инициализировать коллекцию причин отказов
//
// Параметры:
//  Форма					 - 	 - 
//  ВидСделки				 - 	 - 
//  ПричиныПредопределены	 - 	 - 
//
Процедура ИнициализироватьКоллекциюПричинОтказов(Форма, ВидСделки = Неопределено, ПричиныПредопределены = Ложь) Экспорт
	
	ПредопределенныйЭлемент_ЛюбаяПричина = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПричиныОтказов.ЛюбаяПричина");
	
	Если ЗначениеЗаполнено(ВидСделки) Тогда 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ВидСделки"	, ВидСделки);
		Запрос.УстановитьПараметр("ЛюбаяПричина", ПредопределенныйЭлемент_ЛюбаяПричина);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВидыСделокПричиныОтказов.ПричинаОтказа КАК Ссылка,
		|	ВидыСделокПричиныОтказов.ПричинаОтказа.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ВидыСделок.ПричиныОтказов КАК ВидыСделокПричиныОтказов
		|ГДЕ
		|	ВидыСделокПричиныОтказов.Ссылка = &ВидСделки
		|	И ВидыСделокПричиныОтказов.ПричинаОтказа <> &ЛюбаяПричина
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		
		Если ТипЗнч(Форма.ПричиныОтказов) = Тип("СписокЗначений") Тогда 
			Форма.ПричиныОтказов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		Иначе 	
			Форма.ПричиныОтказов.Загрузить(Запрос.Выполнить().Выгрузить());
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Форма.ПричиныОтказов) Тогда
			ПричиныПредопределены = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛюбаяПричина", ПредопределенныйЭлемент_ЛюбаяПричина);	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПричиныОтказов.Ссылка КАК Ссылка,
	|	ПричиныОтказов.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ПричиныОтказов КАК ПричиныОтказов
	|ГДЕ
	|	ПричиныОтказов.Ссылка <> &ЛюбаяПричина
	|	И НЕ ПричиныОтказов.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Если ТипЗнч(Форма.ПричиныОтказов) = Тип("СписокЗначений") Тогда 
		Форма.ПричиныОтказов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Иначе 		
		Форма.ПричиныОтказов.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция - Инициализировать предопределенную причину отказа
//
// Параметры:
//  ИмяПредопреленнойПричиныОтказа	 - 	 - 
//  НаименованиеДляПоиска			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьПредопределеннуюПричинуОтказа(ИмяПредопреленнойПричиныОтказа
													, НаименованиеДляПоиска = ""
													, НеобходимоОбновитьПовторноИспользуемыеЗначения = Ложь) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(ИмяПредопреленнойПричиныОтказа)) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	 
	ПричинаОтказа = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПричиныОтказов." + СокрЛП(ИмяПредопреленнойПричиныОтказа) + "");
	Если ЗначениеЗаполнено(ПричинаОтказа) Тогда 
		Возврат ПричинаОтказа;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", СокрЛП(НаименованиеДляПоиска) + "%");
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПричиныОтказов.Ссылка КАК Ссылка,
	|	ПричиныОтказов.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.ПричиныОтказов КАК ПричиныОтказов
	|ГДЕ
	|	ПричиныОтказов.Наименование ПОДОБНО &Наименование
	|	И ПричиныОтказов.Предопределенный = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПричиныОтказов.Код УБЫВ";
	
	ВыборкаПричиныОтказа = Запрос.Выполнить().Выбрать();
	Если ВыборкаПричиныОтказа.Следующий() Тогда
		ПричинаОтказа_Объект 							= ВыборкаПричиныОтказа.Ссылка.ПолучитьОбъект();
		ПричинаОтказа_Объект.ИмяПредопределенныхДанных 	= СокрЛП(ИмяПредопреленнойПричиныОтказа);
		Если ВыборкаПричиныОтказа.ПометкаУдаления = Истина Тогда 
			ПричинаОтказа_Объект.ПометкаУдаления 		= Ложь;
		КонецЕсли;
		ПричинаОтказа_Объект.ОбменДанными.Загрузка 		= Истина;
		Попытка
			ПричинаОтказа_Объект.Записать();
			НеобходимоОбновитьПовторноИспользуемыеЗначения = Истина;			
			Возврат ПричинаОтказа_Объект.Ссылка;
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru='Ошибка инициализации предопределенной причины отказа!';en='Error initializing predefined failure reason!'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ПричиныОтказов, , ОписаниеОшибки());			
			Возврат Неопределено;			
		КонецПопытки;	
	Иначе  
		ПричинаОтказа_Объект 							= СоздатьЭлемент();
		ПричинаОтказа_Объект.ИмяПредопределенныхДанных 	= СокрЛП(ИмяПредопреленнойПричиныОтказа);
		Если ЗначениеЗаполнено(СокрЛП(НаименованиеДляПоиска)) Тогда 
			ПричинаОтказа_Объект.Наименование 			= СокрЛП(НаименованиеДляПоиска);
		Иначе //Если СокрЛП(ИмяПредопреленнойПричиныОтказа) = "КлиентНеПришел" Тогда 
			ПричинаОтказа_Объект.Наименование 			= ПреобразованиеСтрокиБезПробелов(СокрЛП(ИмяПредопреленнойПричиныОтказа));	
		КонецЕсли;	
		ПричинаОтказа_Объект.УстановитьНовыйКод();
		Попытка
			ПричинаОтказа_Объект.ОбменДанными.Загрузка = Истина;
			ПричинаОтказа_Объект.Записать();
			НеобходимоОбновитьПовторноИспользуемыеЗначения = Истина;			
			Возврат ПричинаОтказа_Объект.Ссылка;
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru='Ошибка инициализации предопределенной причины отказа!';en='Error initializing predefined failure reason!'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ПричиныОтказов, , ОписаниеОшибки());			
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;	
	
КонецФункции

// Функция - Преобразование строки без пробелов
//
// Параметры:
//  СтрокаБезПробелов	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПреобразованиеСтрокиБезПробелов(СтрокаБезПробелов)
 
	СтрокаСПробелами = Лев(СтрокаБезПробелов, 1);
	
	Для К = 2 По СтрДлина(СтрокаБезПробелов) Цикл
		ТекущийЗнак = Сред(СтрокаБезПробелов, К, 1);
		КодСимвола = КодСимвола(ТекущийЗнак);
		Если (КодСимвола > 64 И КодСимвола < 91) Или (КодСимвола > 1039 И КодСимвола < 1072)  Тогда
			СтрокаСПробелами = СтрокаСПробелами + " " + НРег(ТекущийЗнак);
		Иначе
			СтрокаСПробелами = СтрокаСПробелами + ТекущийЗнак;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрокаСПробелами;
 
КонецФункции

#КонецОбласти