#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Добавить сообщение в регистра сведений ОчередьПередачиДанныхМДЛП.
//
// Параметры:
//  Сообщение - Справочник.МДЛППрисоединенныеФайлы - сообщение, которое добавляется в очередь.
//
Процедура ДобавитьСообщениеВОчередь(Сообщение, Реквизиты) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НоваяЗапись = РегистрыСведений.ОчередьПередачиДанныхМДЛП.СоздатьМенеджерЗаписи();
	НоваяЗапись.Сообщение = Сообщение;
	ЗаполнитьЗначенияСвойств(НоваяЗапись, Реквизиты);
	НоваяЗапись.Записать();
	
КонецПроцедуры

// Удалить сообщение из регистра сведений ОчередьПередачиДанныхМДЛП.
//
// Параметры:
//  Сообщение - Справочник.МДЛППрисоединенныеФайлы - сообщение, которое удаляется из очереди.
//
Процедура УдалитьСообщениеИзОчереди(Сообщение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = РегистрыСведений.ОчередьПередачиДанныхМДЛП.СоздатьНаборЗаписей();
	Набор.Отбор.Сообщение.Установить(Сообщение);
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли