
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ПАРАМЕТРЫ ПЕРЕДАВАЕМЫЕ ФОРМЕ
	                                        
	ЭтаФорма.Заголовок          = Параметры.Заголовок;		
	ОтборМассивРазрешенныхТипов = Неопределено;
	ВыбранныеЗначения           = Неопределено;	
	
	Параметры.Свойство("Сегмент"                                ,ОтборСегмент);
	Параметры.Свойство("СегментУслугПоСогласованию"             ,ОтборСегментУслугПоСогласованию);
	Параметры.Свойство("ОтборМассивРазрешенныхТипов"            ,ОтборМассивРазрешенныхТипов);
	Параметры.Свойство("СтруктурнаяЕдиница"                     ,ОтборСтруктурнаяЕдиница);
	Параметры.Свойство("ВидЦен"                                 ,ОтборВидЦен);
	Параметры.Свойство("Дата"                                   ,ОтборДата);
	Параметры.Свойство("ВыбранныеЗначения"                      ,ВыбранныеЗначения);
	Параметры.Свойство("БуферВыбранныхЗначенийИспользовать"     ,ТаблицаВыбранныхЗначенийИспользовать);
    Параметры.Свойство("МножественныйВыборИспользовать"         ,МножественныйВыборИспользовать);
	Параметры.Свойство("ОтбиратьТолькоРеализованныеСертификаты" ,ОтборОтбиратьТолькоРеализованныеСертификаты);
	Параметры.Свойство("Склад"                                  ,СкладПоУмолчанию);
	Параметры.Свойство("КолонкаСкладВидимость"                  ,КолонкаСкладВидимость);
	Параметры.Свойство("Сотрудник"                              ,ОтборСотрудник);
	Параметры.Свойство("ТипДок"                                 ,ТипДок);
    Параметры.Свойство("ДоговорПолисаМедСтрахования"            ,ДоговорПолисаМедСтрахования);
	Параметры.Свойство("ВозвращатьДанныеПоДоговоруПолиса"       ,ВозвращатьДанныеПоДоговоруПолиса);
	Параметры.Свойство("ПолисМедСтрахования"       				,ПолисМедСтрахования);
	
	ТипДок                             = ?(НЕ ЗначениеЗаполнено(ТипДок),Неопределено, ТипДок);	
	ОтборСотрудник                     = ?(НЕ ЗначениеЗаполнено(ОтборСотрудник),Неопределено, ОтборСотрудник);	
	ОтборСтруктурнаяЕдиница            = ?(НЕ ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница), ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница, ОтборСтруктурнаяЕдиница);
    ОтборДата                          = ?(НЕ ЗначениеЗаполнено(ОтборДата), ТекущаяДата(), ОтборДата);	
	МножественныйВыборИспользовать     = ?(ТаблицаВыбранныхЗначенийИспользовать, Истина, МножественныйВыборИспользовать);	
	СкладПоУмолчанию                   = ?(НЕ ЗначениеЗаполнено(СкладПоУмолчанию), ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.ОсновнойСклад, СкладПоУмолчанию);
	Если ЭтаФорма.Заголовок = "Выберите материал" Тогда
		СкладПоУмолчанию = Неопределено;
	КонецЕсли;
	
	Если ЭтаФорма.Заголовок = "Выберите материалы" Тогда
		Элементы.ТаблицаВыбранныхЗначенийНоменклатура.ТолькоПросмотр = Ложь;
		Элементы.ТаблицаВыбранныхЗначений.КоманднаяПанель.Видимость = Истина;		
	Иначе 
		Элементы.ТаблицаВыбранныхЗначений.КоманднаяПанель.Видимость = Ложь;
	КонецЕсли;
	
	// Определение текущих выбранных значений
	Если НЕ ВыбранныеЗначения = Неопределено Тогда  
		
		Если ТипЗнч(ВыбранныеЗначения) = Тип("СправочникСсылка.Номенклатура") Тогда
			НоменклатураНачальногоПозиционирования = ВыбранныеЗначения;			
			ПодборВызванИзНоменклатуры = Истина;
		// Если используется буфер выбранных значений и передан массив значений	
		ИначеЕсли ТипЗнч(ВыбранныеЗначения) = Тип("Массив") И МножественныйВыборИспользовать Тогда			
			Для Каждого СтрокаМ ИЗ ВыбранныеЗначения Цикл 				
				НоваяСтрока              = ТаблицаВыбранныхЗначений.Добавить();
				НоваяСтрока.Номенклатура = СтрокаМ.Номенклатура;
				НоваяСтрока.Количество   = ?(СтрокаМ.Свойство("Количество"),СтрокаМ.Количество, 1);
				НоваяСтрока.Упаковка     = ?(СтрокаМ.Свойство("Упаковка")  ,СтрокаМ.Упаковка, Неопределено);
				НоваяСтрока.Склад        = ?(СтрокаМ.Свойство("Склад")     ,СтрокаМ.Склад, Неопределено);
				НоваяСтрока.ХарактеристикиИспользуются = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаМ.Номенклатура, "ИспользоватьПартии");
				НоваяСтрока.Партия       = ?(СтрокаМ.Свойство("Партия")     ,СтрокаМ.Партия, Неопределено);
			КонецЦикла;
		КонецЕсли;
		 
	КонецЕсли;
	
	// Заполнение списка разрешенных типов
	Если НЕ ОтборМассивРазрешенныхТипов = Неопределено Тогда
		ОтборСписокРазрешенныхТипов.ЗагрузитьЗначения(ОтборМассивРазрешенныхТипов);
	КонецЕсли;
	
	// Если не был передан вид цен, брать его по умолчанию 
	Если ЗначениеЗаполнено(ДоговорПолисаМедСтрахования)	И ЗначениеЗаполнено(ДоговорПолисаМедСтрахования.ВидЦен) Тогда
		ОтборВидЦен = ДоговорПолисаМедСтрахования.ВидЦен;
	ИначеЕсли НЕ ЗначениеЗаполнено(ОтборВидЦен) И ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница.ВидЦенРеализации) Тогда	
		ОтборВидЦен	= ОтборСтруктурнаяЕдиница.ВидЦенРеализации;	
	ИначеЕсли НЕ ЗначениеЗаполнено(ОтборВидЦен) И НЕ ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница.ВидЦенРеализации) Тогда	
		ОтборВидЦен	= Справочники.ВидыЦен.Розничная;
	КонецЕсли;
	
	Элементы.СписокНормаВремени.Видимость               = Ложь;
	Элементы.СписокЦена.Видимость                       = Ложь;
	Элементы.СписокЕдиницаИзмерения.Видимость           = Ложь;
	Элементы.ГруппаТаблицаВыбранных.Видимость           = ТаблицаВыбранныхЗначенийИспользовать;
	Элементы.ТаблицаВыбранныхЗначенийСклад.Видимость    = КолонкаСкладВидимость;	
	Для Каждого ЭлТипа ИЗ Параметры.СписокРазрешенныхТипов Цикл		
		Если ЭлТипа.Значение = Перечисления.ТипыНоменклатуры.Запас ИЛИ ЭлТипа.Значение = Перечисления.ТипыНоменклатуры.Материал Тогда
            Элементы.СписокЕдиницаИзмерения.Видимость = Истина;
        ИначеЕсли ЭлТипа.Значение = Перечисления.ТипыНоменклатуры.Услуга Тогда
			Элементы.СписокНормаВремени.Видимость = Истина;
        КонецЕсли;	
	КонецЦикла;	
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) И ЗначениеЗаполнено(ОтборВидЦен) И ЗначениеЗаполнено(ОтборДата) Тогда
		 Элементы.СписокЦена.Видимость = Истина;
	КонецЕсли;	
	Элементы.Список.МножественныйВыбор = МножественныйВыборИспользовать;
	Элементы.Список.РежимВыделения     = ?(МножественныйВыборИспользовать , РежимВыделенияТаблицы.Множественный, РежимВыделенияТаблицы.Одиночный);

КонецПроцедуры

&НаКлиенте
// Обработчик открытия формы на клиенте
//
Процедура ПриОткрытии(Отказ)
	
	ОтображатьДеревом = НЕ ОтображатьДеревом;
	ВидОтображенияУстановить(Неопределено);	
	ДеревоРазвернуто = НЕ ДеревоРазвернуто;
	РазвернутьДерево(Неопределено);	
	Элементы.Список.ТекущаяСтрока = ИдентификаторЭлементаСтартовойФокусировки;	
	Если ТипЗнч(ЭтаФорма.ВладелецФормы) = Тип("УправляемаяФорма") И ЭтаФорма.ВладелецФормы.ИмяФормы = "Документ.Событие.Форма.ФормаДокумента" Тогда
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.СписокНоменклатурыВыбрать.Заголовок = "Выбрать и закрыть";
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
// Процедура строит дерево номенклатур
//
Процедура ЗаполнитьСписокНоменклатур(ВыводитьДеревом)
	
	ВыборкаГрупп = Неопределено;	
	Если ВыводитьДеревом Тогда		
		ЗапросГрупп = Новый Запрос;		
		ЗапросГрупп.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ИСТИНА
		|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ";
				
		ВыборкаГрупп = ЗапросГрупп.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);			
	КонецЕсли;
		
	// Отбираем номенклатуру по нужным параметра
	Если ЗначениеЗаполнено(ОтборСотрудник) Тогда	
		ВыборкаНоменклатур = Справочники.Номенклатура.ОтборНоменклатурПоУслугамСотрудника(ОтборДата, ОтборСтруктурнаяЕдиница, ОтборВидЦен, ОтборСотрудник, ОтборСегмент, ОтборСегментУслугПоСогласованию, ДоговорПолисаМедСтрахования, ПолисМедСтрахования); 	
	Иначе 
		ВыборкаНоменклатур = Справочники.Номенклатура.ОтборНоменклатур(ОтборДата, ОтборСтруктурнаяЕдиница, ОтборСегмент, ОтборСписокРазрешенныхТипов, ОтборВидЦен, ОтборОтбиратьТолькоРеализованныеСертификаты,,,,ОтборСегментУслугПоСогласованию, ?(ПодборВызванИзНоменклатуры, Ложь, Истина), ДоговорПолисаМедСтрахования, ПолисМедСтрахования);		
	КонецЕсли;
	Список.ПолучитьЭлементы().Очистить();	
	Если ВыводитьДеревом Тогда		
		СтроимДерево(ВыборкаГрупп,Список,ВыборкаНоменклатур);	
		// Вывести элементы не находящиеся ни в одной из групп
		НоменклатураБезГрупп = ВыборкаНоменклатур.НайтиСтроки(Новый Структура("Родитель",Справочники.Номенклатура.ПустаяСсылка()));		
	Иначе
		НоменклатураБезГрупп = ВыборкаНоменклатур;
	КонецЕсли;	
    Для Каждого СтрокаНоменклатуры Из НоменклатураБезГрупп Цикл		
		НоваяСтрока = Список.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНоменклатуры);
	КонецЦикла;

КонецПроцедуры

&НаСервере
// Процедура строить дерево номенклатур
//
Процедура СтроимДерево(ВыборкаСсылка,РодительСтроки,ВыбокаНоменклатур)
	
	Для Каждого СтрокаДерева ИЗ ВыборкаСсылка.Строки Цикл		
		НоваяСтрокаГруппы              = РодительСтроки.ПолучитьЭлементы().Добавить();
		НоваяСтрокаГруппы.Номенклатура = СтрокаДерева.Ссылка;		
		НоваяСтрокаГруппы.ЭтоГруппа    = Истина;		
		СтроимДерево(СтрокаДерева,НоваяСтрокаГруппы,ВыбокаНоменклатур);		
		НоменклатураПоРодителю = ВыбокаНоменклатур.НайтиСтроки(Новый Структура("Родитель",СтрокаДерева.Ссылка));
		
		// Удаляем узел группы если он не содержит элементы
		Если НоменклатураПоРодителю.Количество() = 0 И НоваяСтрокаГруппы.ПолучитьЭлементы().Количество() = 0 Тогда
			РодительСтроки.ПолучитьЭлементы().Удалить(НоваяСтрокаГруппы);
		КонецЕсли;
		
		// Заполняем номенклатуры
		Для А = 0 По НоменклатураПоРодителю.Количество() - 1 Цикл			
			НоваяСтрока = НоваяСтрокаГруппы.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,НоменклатураПоРодителю[А]);		
			Если ЗначениеЗаполнено(НоменклатураНачальногоПозиционирования) И НоменклатураНачальногоПозиционирования = НоваяСтрока.Номенклатура Тогда				
				ИдентификаторЭлементаСтартовойФокусировки = НоваяСтрока.ПолучитьИдентификатор();
				Элементы.Список.ТекущаяСтрока             = ИдентификаторЭлементаСтартовойФокусировки;			
			КонецЕсли;				
		КонецЦикла;
	КонецЦикла;	 
		
КонецПроцедуры

&НаКлиенте
// Обработчик команды развернуть/свернуть дерево
//
Процедура РазвернутьДерево(Команда)
	
	ДеревоРазвернуто                  = НЕ ДеревоРазвернуто;
	Элементы.Список.ТекущийЭлемент    = Неопределено;
	Элементы.Список.ТекущаяСтрока     = Неопределено;
	
	Если ДеревоРазвернуто Тогда
		ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы.Список,Список);
	Иначе
		
		ЗаполнитьСписокНоменклатур(ОтображатьДеревом);

	КонецЕсли;

	Элементы.РазвренутьДерево.Картинка  = ?(ДеревоРазвернуто, БиблиотекаКартинок.СвернутьВсе, БиблиотекаКартинок.РазвернутьВсе);
	Элементы.РазвренутьДерево.Заголовок = ?(ДеревоРазвернуто,"Свернуть все","Развернуть все");
		
КонецПроцедуры
                              
&НаКлиенте
// Обработчик установки видо отображения
//
Процедура ВидОтображенияУстановить(Команда)
	
	ОтображатьДеревом                   = НЕ ОтображатьДеревом;
	Элементы.Список.Отображение         = ?(ОтображатьДеревом,ОтображениеТаблицы.Дерево,ОтображениеТаблицы.Список);
    Элементы.ВидОтображения.Картинка    = ?(ОтображатьДеревом, БиблиотекаКартинок.РежимПросмотраСпискаСписок, БиблиотекаКартинок.РежимПросмотраСпискаДерево);
	Элементы.ВидОтображения.Заголовок   = ?(ОтображатьДеревом,"Список","Дерево");	
	Элементы.РазвренутьДерево.Видимость = ОтображатьДеревом;
	
	ЗаполнитьСписокНоменклатур(ОтображатьДеревом);
	
	Если Команда <> Неопределено Тогда
		
		ДеревоРазвернуто = НЕ ДеревоРазвернуто;
		РазвернутьДерево(Неопределено);
		
	КонецЕсли;	
		
	Элементы.Список.ТекущаяСтрока = ИдентификаторЭлементаСтартовойФокусировки;
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик команды выбора номенклатуры с закрытием формы подбора.
//
Процедура ВыбратьИЗакрыть(Команда)
	
	ЗавершитьВыборЗначенийЗакрытьформу(Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура завершает выбор значений и при необходимости закрывает форму.
// Ил заполняет буфер выбранных значений
Процедура ЗавершитьВыборЗначенийЗакрытьформу(ВыбратьЗначенияЗакрытьформу = Ложь)
	
	Если НЕ ТаблицаВыбранныхЗначенийИспользовать ИЛИ ВыбратьЗначенияЗакрытьформу Тогда		
		// Проверка на согласование со страховой компанией
		Для Каждого СтрокаТЧ ИЗ Элементы.Список.ВыделенныеСтроки Цикл
			ТекущаяСтрока = Список.НайтиПоИдентификатору(СтрокаТЧ);
			Если ТекущаяСтрока.НоменклатураПоСогласованию Тогда
				ПоказатьПредупреждение(,"Выбранная услуга(и) требует согласования со страховой компанией");
				Прервать;
            КонецЕсли;
		КонецЦикла;		
		// Если используется множественный выбор
		Если МножественныйВыборИспользовать Тогда			
			СписокЗначений = Новый Массив;
			Если НЕ ВыбратьЗначенияЗакрытьформу Тогда
				Для каждого СтрокаТЧ ИЗ Элементы.Список.ВыделенныеСтроки Цикл						
					ТекущаяСтрока = Список.НайтиПоИдентификатору(СтрокаТЧ);
					СписокЗначений.Добавить(ТекущаяСтрока.Номенклатура);					
				КонецЦикла;		
			Иначе		
				Для каждого СтрокаТЧ ИЗ ТаблицаВыбранныхЗначений Цикл					
					СписокЗначений.Добавить(Новый Структура("Номенклатура,Количество,Упаковка,Склад, Партия",СтрокаТЧ.Номенклатура,СтрокаТЧ.Количество,СтрокаТЧ.Упаковка,СтрокаТЧ.Склад, СтрокаТЧ.Партия));					
				КонецЦикла;					
			КонецЕсли;		
			ОповеститьОВыборе(СписокЗначений);			
		Иначе // Возврат одного значения	
			
			ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
			Если ТекущаяСтрока <> Неопределено 
				И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) 
				И НЕ ТекущаяСтрока.ЭтоГруппа Тогда   
				
				ВозвращаемоеЗначение = Новый Структура();
				ВозвращаемоеЗначение.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура); 
				
				Если ВозвращатьДанныеПоДоговоруПолиса И ЗначениеЗаполнено(ДоговорПолисаМедСтрахования) Тогда
					
					СтруктураПараметровВозврата = Новый Структура();
					СтруктураПараметровВозврата.Вставить("Номенклатура",				 ТекущаяСтрока.Номенклатура);
					СтруктураПараметровВозврата.Вставить("ПолисСогласование",			 ТекущаяСтрока.ПолисСогласование); 
					СтруктураПараметровВозврата.Вставить("ПолисКоличество",				 ТекущаяСтрока.ПолисКоличество);
					СтруктураПараметровВозврата.Вставить("ПолисКоличествоПриПревышении", ТекущаяСтрока.ПолисКоличествоПриПревышении);
					СтруктураПараметровВозврата.Вставить("ПолисНеограничено",			 ТекущаяСтрока.ПолисНеограничено); 
					СтруктураПараметровВозврата.Вставить("НаименованиеОграничения",		 ТекущаяСтрока.НаименованиеОграничения);
					СтруктураПараметровВозврата.Вставить("КоличествоЗубов",				 ТекущаяСтрока.КоличествоЗубов);
					СтруктураПараметровВозврата.Вставить("КоличествоВПриеме",			 ТекущаяСтрока.КоличествоВПриеме);
					СтруктураПараметровВозврата.Вставить("СкидкиЗапрещены",			 	 ТекущаяСтрока.СкидкиЗапрещены);
					
					ВозвращаемоеЗначение = СтруктураПараметровВозврата;
					
				КонецЕсли;    
				ОповеститьОВыборе(ВозвращаемоеЗначение);	
				
			КонецЕсли;
		КонецЕсли;	
	Иначе		
		// Заполнение буфера выбранных значений
		Для каждого ЭлементМассива из Элементы.Список.ВыделенныеСтроки Цикл			
			ТекущаяСтрока            = Список.НайтиПоИдентификатору(ЭлементМассива);
			Если НЕ ТекущаяСтрока.ЭтоГруппа Тогда			
				НайденныеСтроки = ТаблицаВыбранныхЗначений.НайтиСтроки(Новый Структура("Номенклатура",ТекущаяСтрока.Номенклатура));
				// Если добавляемая номенклатура уже существует в таблице нарасщиваем количество в существующей
				Если НайденныеСтроки.Количество() = 0 Тогда				
					НоваяСтрока              = ТаблицаВыбранныхЗначений.Добавить();
					НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
					НоваяСтрока.Упаковка     = ТекущаяСтрока.Упаковка;
					НоваяСтрока.Количество   = 1;	
					НоваяСтрока.Склад        = СкладПоУмолчанию;
					НоваяСтрока.ХарактеристикиИспользуются = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ТекущаяСтрока.Номенклатура, "ИспользоватьПартии");					
				Иначе
					НайденныеСтроки[0].Количество = НайденныеСтроки[0].Количество + 1;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
// Обработчик активации строки
//
Процедура СписокПриАктивизацииСтроки(Элемент)	
	 ИдентификаторЭлементаСтартовойФокусировки = Элементы.Список.ТекущаяСтрока;
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "Выбор" таблицы "СписокНоменклатуры"
//
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
   ЗавершитьВыборЗначенийЗакрытьформу();	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Обработчик окончания ввода текста поиска
//
Процедура БыстрыйПоискОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)

	ИдентификаторПоследнейНайденнойСтроки = ?(БыстрыйПоиск <> Текст,-1,ИдентификаторПоследнейНайденнойСтроки);
	БыстрыйПоиск = Текст;
	
    Поиск(Неопределено);
	
КонецПроцедуры

&НаСервере
// Рекусивная фкнция поиска в дереве значений
//
Функция БыстрыйПоиск(Знач ЭлементыДерева = Неопределено,ПоискВПеред,СтрокаПоиска)

	ИндексСтартовый = 0;
	// Оптимизация по границам поиска
	Если ЭлементыДерева = Неопределено Тогда	
				
		ЭлементыДерева  = Список.ПолучитьЭлементы();
		КоличествоЭл    = ЭлементыДерева.Количество() - 1;

		Если ПоискВПеред Тогда
			ИндексСтартовый = ИндексВерхнейГруппы; 
		Иначе
			КоличествоЭл    = ИндексВерхнейГруппы + 1; 
		КонецЕсли;

	Иначе
		КоличествоЭл = ЭлементыДерева.Количество() - 1;
	КонецЕсли;
	
	// Основной цикл поиска
	Для А = ИндексСтартовый  По КоличествоЭл Цикл
		
		ЭлементДерева =?(ПоискВПеред, ЭлементыДерева[А], ?(ЭлементыДерева.Количество() < КоличествоЭл - А, ЭлементыДерева[КоличествоЭл - А],ЭлементыДерева[А]));
		
		Если  ЭлементДерева.Номенклатура.ЭтоГруппа  Тогда
			
			// Рекурсивный вызов
			Результат = БыстрыйПоиск(ЭлементДерева.ПолучитьЭлементы(),ПоискВПеред,СтрокаПоиска);
			Если  Результат <> Неопределено Тогда
				
				ИндексПредВерхнейГруппы = А;
				Возврат Результат
				
			КонецЕсли;	
		Иначе
			// Проверка совпадения подстроки
			Если Найти(НРег(Строка(ЭлементДерева.Номенклатура)),НРег(СтрокаПоиска)) > 0 Тогда			
				
				ИД = ЭлементДерева.ПолучитьИдентификатор();
				Если  ИдентификаторПоследнейНайденнойСтроки = -1 ИЛИ (ПоискВПеред И ИД > ИдентификаторПоследнейНайденнойСтроки) ИЛИ (НЕ ПоискВПеред И ИД < ИдентификаторПоследнейНайденнойСтроки)  Тогда				
					Возврат ИД;			
				КонецЕсли;	
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
					
	Возврат Неопределено;
	
КонецФункции	

&НаКлиенте
// Процедура вызова поиска
//
Процедура ИскатьВДереве(ПоискДалее)
	
	Результат = БыстрыйПоиск(,ПоискДалее,БыстрыйПоиск);
	Если Результат <> Неопределено Тогда
		
		 Элементы.Список.ТекущаяСтрока         = Результат;
		 ИдентификаторПоследнейНайденнойСтроки = Результат;                                   

	 Иначе
		 
		ИндексПредВерхнейГруппы               = 0;
		ИдентификаторПоследнейНайденнойСтроки = -1;
		ПоказатьПредупреждение(,"Поиск не дал результата!"); 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработчик копки поиска
//
Процедура Поиск(Команда)
	
	ИндексПредВерхнейГруппы               = 0;
	ИдентификаторПоследнейНайденнойСтроки = -1;
	ИскатьВДереве(Истина);
	
КонецПроцедуры

&НаКлиенте
// Обработчик поиск Далее
//
Процедура ПоискДалее(Команда)
	
	ИскатьВДереве(Истина);
	
КонецПроцедуры

&НаКлиенте
// Обработчик поиск Предыдущее
//
Процедура ПоискПредыдущие(Команда)
	
	ИскатьВДереве(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаВыбранныхЗначений

&НаКлиенте
// Удалить строку таблицы
//
Процедура ТаблицаВыбранныхЗначенийУдалитьСтроку(Команда)
	
	Если НЕ Элементы.ТаблицаВыбранныхЗначений.ТекущиеДанные = Неопределено Тогда		
		ТаблицаВыбранныхЗначений.Удалить(Элементы.ТаблицаВыбранныхЗначений.ТекущиеДанные);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик перед началом выбора упаковки номенклатуры
//
Процедура ТаблицаВыбранныхЗначенийУпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные        = Элементы.ТаблицаВыбранныхЗначений.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.УпаковкиНоменклатуры.ПустаяСсылка"), "<без упаковки>");
		Если Не ОбщегоНазначенияСтоматология.ПроверитьИспользованиеУпаковокИПолучитьСписокДляВыбора(ТекущиеДанные.Номенклатура, ДанныеВыбора) Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'Для данной номенклатуры нет упаковок.'"));
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ТаблицаВыбранныхЗначенийПартияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.ТаблицаВыбранныхЗначений.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
		
		мПараметрыВыбора = Новый Структура;
		мПараметрыВыбора.Вставить("Владелец"                       , СтрокаТабличнойЧасти.Номенклатура);
		Если Не СкладПоУмолчанию = Неопределено Тогда
			мПараметрыВыбора.Вставить("Склад"                          , СтрокаТабличнойЧасти.Склад);
		КонецЕсли;
		мПараметрыВыбора.Вставить("СтруктурнаяЕдиница"             , ОтборСтруктурнаяЕдиница);
		мПараметрыВыбора.Вставить("Дата"                           , ОтборДата);
        мПараметрыВыбора.Вставить("МножественныйВыбор"             , Истина);

		ОписаниеОповещения = Новый ОписаниеОповещения("ТаблицаВыбранныхЗначенийПартияНачалоВыбораЗавершение", ЭтотОбъект, СтрокаТабличнойЧасти);
		ОткрытьФорму("Справочник.ПартииНоменклатуры.ФормаВыбора", мПараметрыВыбора,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		

	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Процедура - Таблица выбранных значений партия начало выбора завершение.
//
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
//
Процедура ТаблицаВыбранныхЗначенийПартияНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено И ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() <> 0 Тогда
		Параметры.Партия = Результат[0];
		// пересчет остатка
		Параметры.Остаток = ПолучитьОстаток(Параметры.Номенклатура, Параметры.Склад, Параметры.Упаковка, Параметры.Партия);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ТаблицаВыбранныхЗначенийНоменклатураПриИзменении(Элемент)
	
	СтрокаДанных =  Элементы.ТаблицаВыбранныхЗначений.ТекущиеДанные;
	Если Не СтрокаДанных = Неопределено Тогда
		СтрокаДанных.ХарактеристикиИспользуются = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаДанных.Номенклатура, "ИспользоватьПартии");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ТаблицаВыбранныхЗначенийНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметры     = Новый Структура();	
	МассивРазрешенныхТипов = Новый Массив;
	МассивРазрешенныхТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Материал"));
	
	СтруктураПараметры.Вставить("ОтборМассивРазрешенныхТипов", МассивРазрешенныхТипов); 
	СтруктураПараметры.Вставить("Заголовок"                  , "Выберите материал");	   
	СтруктураПараметры.Вставить("ВыбранныеЗначения"          , Элементы.ТаблицаВыбранныхЗначений.ТекущиеДанные.Номенклатура);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаПодбораНоменклатуры",
	СтруктураПараметры,,,,,
	Новый ОписаниеОповещения("ТаблицаВыбранныхЗначенийНоменклатураНачалоВыбораЗавершение", ЭтотОбъект), 
	РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	
КонецПроцедуры

&НаКлиенте
// Процедура - После выбора значений номенклатуры
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ТаблицаВыбранныхЗначенийНоменклатураНачалоВыбораЗавершение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) И РезультатВыбора.Свойство("Номенклатура") Тогда
		
		Номенклатура = РезультатВыбора.Номенклатура;
		
		Элементы.ТаблицаВыбранныхЗначений.ТекущиеДанные.Номенклатура = Номенклатура;
		Элементы.ТаблицаВыбранныхЗначений.ТекущиеДанные.Склад        = СкладПоУмолчанию;
		Элементы.ТаблицаВыбранныхЗначений.ТекущиеДанные.ХарактеристикиИспользуются = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Номенклатура, "ИспользоватьПартии");
		Если Элементы.ТаблицаВыбранныхЗначений.ТекущиеДанные.Номенклатура <> ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Элементы.ТаблицаВыбранныхЗначений.ТекущиеДанные.Упаковка, "Владелец") Тогда
			Элементы.ТаблицаВыбранныхЗначений.ТекущиеДанные.Упаковка = Неопределено;
		КонецЕсли; 			
		Если Не ЗначениеЗаполнено(Элементы.ТаблицаВыбранныхЗначений.ТекущиеДанные.Количество) Тогда
			Элементы.ТаблицаВыбранныхЗначений.ТекущиеДанные.Количество = 1;
		КонецЕсли;

	КонецЕсли; 	
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить остаток
//
Функция ПолучитьОстаток(Номенклатура, Склад, Упаковка, Партия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК Остаток
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(
	|			,
	|			Номенклатура = &Номенклатура
	|				И Склад = &Склад
	|				И Партия = &партия) КАК ЗапасыОстатки";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад"       , Склад);
	Запрос.УстановитьПараметр("Партия"		, Партия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), ?(Упаковка.Коэффициент <> 0, Выборка.Остаток / Упаковка.Коэффициент, Выборка.Остаток) , 0);
	
КонецФункции

#КонецОбласти