
#Область СлужебныеПроцедурыИФункции

&НаСервере
// Обработчик создания формы на сервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// Заполнение доступных полей
	СхемаКомпоновкиДанных = Справочники.ХранилищеШаблонов.ПолучитьМакет("ПоляШаблонаСертификата");
	АдресВХранилище = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
	Ист=Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВХранилище);
	КомпоновщикНастроек.Инициализировать(Ист);
	
	СтруктураШаблона = ПолучитьСтруктуруШаблона();
	
	Если СтруктураШаблона <> Неопределено Тогда
		// Загрузка шаблона.
		СтруктураШаблона.Свойство("МакетСертификата", ПолеТабличногоДокумента);
	Иначе                                                                                                   
		// Создание нового шаблона.
		ПолеТабличногоДокумента					= Новый ТабличныйДокумент;
		ПолеТабличногоДокумента.АвтоМасштаб		= Истина;
		ПолеТабличногоДокумента.РазмерСтраницы	= "A4";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перед закрытием
//
// Параметры:
//  Отказ				 - 	 - 
//  ЗавершениеРаботы	 - 	 - 
//  ТекстПредупреждения	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли; 			
	АдресШаблона = ДействиеОКСервер(Отказ);
	
	Если НЕ (Отказ ИЛИ АдресШаблона = Неопределено) Тогда
		Оповестить("ИзмененШаблон", АдресШаблона, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Доступные поля выбор
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбраннаяСтрока		 - 	 - 
//  Поле				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ДоступныеПоляВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	ВыборДоступногоПоля(ВыбраннаяСтрока);
			
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "Объединить".
//
Процедура Объединить(Команда)
	
	Если ПолеТабличногоДокумента.ВыделенныеОбласти.Количество() = 1
		И ТипЗнч(ПолеТабличногоДокумента.ВыделенныеОбласти[0]) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		
		ТекущаяОбласть = ПолеТабличногоДокумента.ТекущаяОбласть;
		ОбъединитьОбласть(ТекущаяОбласть.Имя);
		Модифицированность = Истина;
	Иначе
		
		ОчиститьСообщения();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Некорректная область!'");
		Сообщение.Поле = "ПолеТабличногоДокумента";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "Разъединить".
//
Процедура Разъединить(Команда)
	
	Если ПолеТабличногоДокумента.ВыделенныеОбласти.Количество() = 1
		И ТипЗнч(ПолеТабличногоДокумента.ВыделенныеОбласти[0]) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		
		ТекущаяОбласть = ПолеТабличногоДокумента.ТекущаяОбласть;
		РазъединитьОбласть(ТекущаяОбласть.Имя);
		Модифицированность = Истина;
	Иначе
		
		ОчиститьСообщения();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Некорректная область!'");
		Сообщение.Поле = "ПолеТабличногоДокумента";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Действие ОК
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ДействиеОК(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
// Обработчик кнопки добавления картинки
Процедура ДобавитьКартинку(Команда)
		
	ПолеШаблон            = ПолеТабличногоДокумента.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);       
	Индекс                = ПолеТабличногоДокумента.Рисунки.Индекс(ПолеШаблон); 	
		
	ПолеТабличногоДокумента.Рисунки[Индекс].Расположить(ПолеТабличногоДокумента.Область("R2C2"));
	ПолеТабличногоДокумента.Рисунки[Индекс].Высота = 30;
	ПолеТабличногоДокумента.Рисунки[Индекс].Ширина = 30;
	ПолеТабличногоДокумента.Рисунки[Индекс].Линия  = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);

	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
// Функция возвращает структуру шаблона
//
Функция ПолучитьСтруктуруШаблона()
	
	ШаблонОбъекта = ?(ПустаяСтрока(Параметры.АдресШаблона), Неопределено, ПолучитьИзВременногоХранилища(Параметры.АдресШаблона));
	
	СтруктураШаблона = Неопределено;
		
	Если ТипЗнч(ШаблонОбъекта) = Тип("Структура") Тогда
		СтруктураШаблона = ШаблонОбъекта;
	Иначе
		ЗначениеКопирования = Неопределено;
		Параметры.Свойство("ЗначениеКопирования", ЗначениеКопирования);
		Если ЗначениеКопирования <> Неопределено Тогда
			СтруктураШаблона = ЗначениеКопирования.Шаблон.Получить();
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураШаблона;
	
КонецФункции

&НаСервере
// Функция возвращает структуру макета шаблона ценников и этикеток.
//
Функция ПодготовитьСтруктуруМакетаШаблона()
	
	СтруктураМакетаШаблона = Новый Структура;		
	СтруктураМакетаШаблона.Вставить("МакетСертификата", ПолеТабличногоДокумента);
	
	Возврат СтруктураМакетаШаблона;
	
КонецФункции

&НаСервере
// Процедура объединяет ячейки области
//
// Параметры
//  ИмяОбласти  - Строка - Имя области для объединения
//
Процедура ОбъединитьОбласть(ИмяОбласти)
	
	Область = ПолеТабличногоДокумента.Область(ИмяОбласти);
	Область.Объединить();
	
КонецПроцедуры

&НаСервере
// Процедура разъедининяет ячейки области
//
// Параметры
//  ИмяОбласти  - Строка - Имя области для объединения
//
Процедура РазъединитьОбласть(ИмяОбласти)
	
	Область = ПолеТабличногоДокумента.Область(ИмяОбласти);
	Область.Разъединить();
	
КонецПроцедуры

&НаКлиенте
// Процедура осуществляет выбор доступного поля
//
// Параметры
//  Выбрать  - ИдентификаторКомпоновкиДанных - Идентификатор компоновки данных
//
Процедура ВыборДоступногоПоля(ВыбраннаяСтрока)
		
	ИмяПоляВШаблоне = Строка(КомпоновщикНастроек.Настройки.ДоступныеПоляПорядка.ПолучитьОбъектПоИдентификатору(ВыбраннаяСтрока).Поле);
	
	ЭтоQR = НРег(ИмяПоляВШаблоне) = НРег("QRКод");
	
	ПолеШаблон			= ПолеТабличногоДокумента.Рисунки.Добавить(?(ЭтоQR, ТипРисункаТабличногоДокумента.Картинка, ТипРисункаТабличногоДокумента.Текст));
	
	ПолеШаблон.Расположить(ПолеТабличногоДокумента.Область("R2C2"));
	
	ПолеШаблон.Высота	= ?(ЭтоQR, 30, 10);
	ПолеШаблон.Ширина	= ?(ЭтоQR, 30, 30);
	ПолеШаблон.Линия	= Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	ПолеШаблон.Имя		= ИмяПоляВШаблоне;
	
	Если ЭтоQR Тогда
		ПолеШаблон.Картинка = БиблиотекаКартинок.QRКодБольшой;
	Иначе		
		ПолеШаблон.Заполнение	= ТипЗаполненияОбластиТабличногоДокумента.Текст;					
		ПолеШаблон.Текст		= "{" + ИмяПоляВШаблоне + "}";	
		ПолеШаблон.Узор			= ТипУзораТабличногоДокумента.БезУзора;
	КонецЕсли;
				
КонецПроцедуры

&НаСервере
// Функция - Действие ОКСервер
//
// Параметры:
//  Отказ	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ДействиеОКСервер(Отказ)	
	Возврат ПоместитьВоВременноеХранилище(ПодготовитьСтруктуруМакетаШаблона(), Новый УникальныйИдентификатор);
КонецФункции

&НаКлиенте
// Процедура - Поле табличного документа при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ПолеТабличногоДокументаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти
