
&НаКлиенте
Перем ФлагОперацияВыбрана;

#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик создания формы на сервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДокументПродажиСсылка", ДокументПродажиСсылка);
	Параметры.Свойство("Касса"                , Касса);
	
	Если ЗначениеЗаполнено(Касса) Тогда
		Организация = Касса.СтруктурнаяЕдиница.Организация;
	КонецЕсли;
	
	ВидОперации = 1;
	ЗаписатьВЖурналРегистраций("Не удалось получить номер фискального чека. Запрос к пользователю о дальнейших действиях.");

КонецПроцедуры

&НаКлиенте
// Обработчик перед закрытием формы на клиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ФлагОперацияВыбрана) Тогда
	     ЗаписатьВЖурналРегистраций("Пользователь закрыл форму решения проблемы не выбрав операцию -> Операция по умолчанию 'Отмена'");
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Обработчик кнопки попытки повторного пробития чека
Процедура ДаЧекПробит(Команда)
	
	ЗаписатьВЖурналРегистраций("Пользователь выбрал операцию -> Чек пробит успешно! Присвоить номер чека [99999999]");
	ФлагОперацияВыбрана = Истина;
	Закрыть(99999999);
		
КонецПроцедуры

&НаКлиенте
// Обработчик кнопки повторного пробития чека
Процедура ПовторитьПробитиеЧека(Команда)
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения("ЗадатьВопросЗавершение", ЭтотОбъект), 
		Нстр("ru='Повторить попытку пробития чека?';en='Repeat attempt penetration check?'"), 
		РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ЗадатьВопросЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда	
		
		ЗаписатьВЖурналРегистраций("Пользователь выбрал операцию -> Попытка пробить чек повторно");
		ФлагОперацияВыбрана = Истина;
		Закрыть("ПРОБИТЬ_ЧЕК");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик кнопки отмены операции
Процедура Отмена(Команда)
	
	ЗаписатьВЖурналРегистраций("Пользователь выбрал операцию->Отмена операции.");
	ФлагОперацияВыбрана = Истина;
	Закрыть("ОТМЕНА");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Записать сообщение в журнал событий
Процедура ЗаписатьВЖурналРегистраций(ТексСообщения)
	
	ОбъектМетаданные = Неопределено;
	Если ЗначениеЗаполнено(ДокументПродажиСсылка) Тогда
		ОбъектМетаданные = ДокументПродажиСсылка.Метаданные();
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(Нстр("ru='Ошибка пробития чека ККМ';en='Error breaking the receipt (cash register)'"), УровеньЖурналаРегистрации.Предупреждение, ОбъектМетаданные, ДокументПродажиСсылка, ТексСообщения);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ВывестиХОтчет".
//
Процедура ВывестиХОтчет(Команда)
	
	ОповещениеПриЗавершении   = Новый ОписаниеОповещения("ОперацияЗавершение", ЭтотОбъект);
	ИдентификаторУстройстваФР = МенеджерОборудованияВызовСервера.ПолучитьИдентификаторФискальногоРегистратораДляКассы(Касса);
	ПараметрыОперации         = Новый Структура("Организация", Организация);	
	
	МенеджерОборудованияКлиент.НачатьФормированиеОтчетаБезГашения(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройстваФР);	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения операции х отчета.
//
Процедура ОперацияЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
