
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик создания формы на сервере.
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("ТипДенежныхСредств", ТипДенежныхСредств);
	Параметры.Свойство("СуммаПлатежа"      , ПлатежСумма);
	Параметры.Свойство("ПределПлатежа"     , Элементы.Сумма.МаксимальноеЗначение);
	
	Если ЗначениеЗаполнено(ТипДенежныхСредств) Тогда
		Если ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда
			ЭтаФорма.Заголовок = "Оплата наличными";
		ИначеЕсли ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ЛицевойСчет Тогда
			ЭтаФорма.Заголовок = "Оплата с лицевого счета";
		ИначеЕсли ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.БонусныйСчет Тогда
			ЭтаФорма.Заголовок = "Оплата с бонусного счета";   
		Иначе
			ЭтаФорма.Заголовок = "Вид оплаты: " + Строка(ТипДенежныхСредств);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыФункции

&НаКлиенте
// Подтвердить операцию.
Процедура ВыполнитьОперацию(Команда)

	Ошибки = "";
	Если ПлатежСумма = 0 Тогда
		Ошибки = НСтр("ru='Укажите размер платежа'");
	КонецЕсли;
	Если ПустаяСтрока(Ошибки) Тогда
		Параметры.ПараметрыФормы.Добавить(ПлатежСумма , "Сумма");
		ОчиститьСообщения();
		Закрыть(КодВозвратаДиалога.ОК);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// При изменении значения суммы.
Процедура СуммаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)

	Если НЕ Элементы.Сумма.МаксимальноеЗначение = Неопределено
	   И Элементы.Сумма.МаксимальноеЗначение < Число(Текст) Тогда
		СтандартнаяОбработка = Ложь;
		СтруктураЗначения    = Новый Структура;
		СтруктураЗначения.Вставить("Предупреждение", НСтр("ru = 'Указанная сумма превышает остаток средств.
		|Сумма оплаты будет изменена на имеющийся остаток.'"));
		СтруктураЗначения.Вставить("Значение", Формат(Элементы.Сумма.МаксимальноеЗначение, "ЧЦ=15; ЧДЦ=2; ЧН=0; ЧГ=0; ЧО=1"));
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.Добавить(СтруктураЗначения);
		ДанныеВыбора = СписокЗначений;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Отменить операцию.
Процедура Отмена(Команда)
	Закрыть(КодВозвратаДиалога.Нет);
КонецПроцедуры

#КонецОбласти