
#Область СлужебныйПрограммныйИнтерфейс

// Функция, возвращает менеджер объектов. 
//
// У модуля установлен режим повторного использования возращаемых объектов 
// "на время сеанса". Это значит, что  в рамках текущего сеанса после первого 
// вызова функции менеджер объектов будет сохранен и при повторных вызовах функции 
// будет возвращаться его сохраненнное значение.
//
// Код функции при этом выполняться не будет.
//
Функция Получить(Серия, ПараметрыСвязи = "host=localhost") Экспорт
	ЗащитаСервер.ПодключитьКомпоненту();
		
	// Создание объекта 
	МенеджерЛицензий = Новый("AddIn.Licence.LicenceExtension20");
	
	// Запуск
	МенеджерЛицензий.ОкноУстановкиСвязи = Ложь;
	МенеджерЛицензий.ПараметрыСвязи = ПараметрыСвязи;
	Если НЕ МенеджерЛицензий.Запуск(Серия, ЗащитаСервер.ТолькоНаличиеКлюча()) Тогда
		ВызватьИсключение МенеджерЛицензий.ПолучитьОписаниеОшибки();
	КонецЕсли;
	
	Защита = Неопределено;
	// Обход ошибки обычного приложения
	Если ТекущийРежимЗапуска() <> РежимЗапускаКлиентскогоПриложения.ОбычноеПриложение Тогда
		Попытка
			Защита = Новый ("ОписаниеЗащитыОтОпасныхДействий");
			Защита.ПредупреждатьОбОпасныхДействиях = Ложь;
		Исключение
			// Исключение возможно на предыдущих версиях платформы без механизма
			// защиты от опасных действий
		КонецПопытки;
	КонецЕсли;
	
	// Создание менеджера объектов
	Попытка
		Если Защита = Неопределено Тогда
			// Предыдущие версии платформы без механизма защиты
			МенеджерОбъектов = ВнешниеОбработки.Создать(МенеджерЛицензий.МенеджерОбъектов, БезопасныйРежим());
		Иначе
			МенеджерОбъектов = ВнешниеОбработки.Создать(
				ВнешниеОбработки.Подключить(
					ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(МенеджерЛицензий.МенеджерОбъектов)), , БезопасныйРежим(), Защита));
		КонецЕсли;
				
		// Настройка менеджера объектов
		МенеджерОбъектов.УстановитьМенеджерЛицензий(МенеджерЛицензий, Защита);
	Исключение
		ВызватьИсключение "Ошибка создания менеджера объектов СЛК: " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат МенеджерОбъектов;
	
КонецФункции

// Функция создания защищенного объекта
// 
Функция СоздатьОбъект(Имя) Экспорт
	
	Возврат ЗащитаСервер.МенеджерОбъектов().СоздатьОбъект(Имя);
	
КонецФункции

#КонецОбласти
