
////////////////////////////////////////////////////////////////////////////////
// КОД ПРОЦЕДУР И ФУНКЦИЙ модуля ДатыЗапретаИзмененияПереопределяемый
// для поддержки библиотечного подхода разработки
//

#Область СлужебныеПроцедурыИФункции

// Вызывается из переопределяемого модуля
//
Процедура НастройкаИнтерфейса(Знач НастройкиРаботыИнтерфейса) Экспорт
	
	НастройкиРаботыИнтерфейса.ИспользоватьВнешнихПользователей = Ложь;
	
КонецПроцедуры

// Вызывается из переопределяемого модуля
//
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(Знач ИсточникиДанных) Экспорт
	
	// Данные(Таблица, ПолеДаты, Раздел, ПолеОбъекта)
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РассылкаСообщений", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.АвансовыйОтчет", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.АктОказанияУслуг", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВводНачальныхОстатков", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Взаимодействие", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВозвратОтПокупателя", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВозвратПоставщику", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Договоры", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЕжедневныйОтчет", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаказПоставщику", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Затраты", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИнвентаризацияЗапасов", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КассоваяСмена", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НарядЗаказ", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НачислениеЗарплаты", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОприходованиеЗапасов", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеДенежныхСредств", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеЗапасов", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПланЛечения", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Поступление", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПоступлениеДенежныхСредств", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Прием", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Реализация", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Событие", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеДенежныхСредств", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеЗадолженности", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеЗапасов", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеМатериалов", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ТабельУчетаРабочегоВремени", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СправкаВНалоговую", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КассовыйЧекКоррекции", "Дата", "УправленческийУчет", "СтруктурнаяЕдиница");
	
КонецПроцедуры

#КонецОбласти