
#Область ОписаниеПеременных

&НаКлиенте
Перем ДоступностьКнопкиПечатьКМЗ; // Флаг для показа/скрытия печати ПМЗ 

&НаКлиенте
Перем ИскомыйКлиент;    

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик создания формы  
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимРаботыЕдинаяСеть = Константы.РежимРаботыСетиСтоматологий.Получить() = Перечисления.РежимРаботыСетиСтоматологий.ЕдинаяСеть; 
	// Если документ был создан на основании возврата получаем сумму сторнированного аванса
	Основание = Неопределено;
	Параметры.Свойство("Основание",Основание);
	Если ЗначениеЗаполнено(Основание) И ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
		СуммаСторнированныхАвансов = Основание.УчтенныеАвансы.Итог("СуммаАванса"); 
	КонецЕсли;
	ИспользоватьБезПодключенияОборудования 	= ?(ЗначениеЗаполнено(Объект.Касса), Объект.Касса.ИспользоватьБезПодключенияОборудования, Ложь);	
	ККТ                                     = Объект.Касса.ВнешнееОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;	
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
	// УстановитьОтображениеЭлементовПереключателя(); 
	
	СоздатьЭлементыРасшифровкиПлатежа();
	
	Элементы.Договор.Видимость = ЗначениеЗаполнено(Объект.Контрагент) 
		И ?(ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Контрагенты") 
		И Объект.Контрагент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты, Ложь, Истина);
		
КонецПроцедуры

&НаСервере
// Процедура, обработчик изменения видимости кнопок меню.
//
Процедура УстановитьОтображениеЭлементовПереключателя(ЭлементИмя = Неопределено)
	
	ВидыОпераций = Перечисления.ВидыОпераций;
	
	ОперацияБезТЧ = Объект.ВидОперации = ВидыОпераций.ВозвратСЛицевогоСчета Или Объект.ВидОперации = ВидыОпераций.СдачаНаличныхВБанк
	Или Объект.ВидОперации = ВидыОпераций.ВыдачаПодотчетнику Или Объект.ВидОперации = ВидыОпераций.ВозвратЗайма
	Или Объект.ВидОперации = ВидыОпераций.ВыплатаДивидендовУчредителю Или Объект.ВидОперации = ВидыОпераций.ВыбытиеВКассу;
	
	ОтобразитьДополнительно = ЭлементИмя = "_ГруппаДополнительно"; 
	ОтобразитьРасшифровку   = ЭлементИмя = "_ГруппаРасшифровка";
	ОтобразитьЗатраты       = ЭлементИмя = "_ГруппаЗатраты";
	
	Если ОперацияБезТЧ Тогда
		Элементы._Дополнительно.Видимость             = Истина; 
		Элементы.Дек_Дополнительно.Видимость          = Ложь;
		Элементы.ГруппаДополнительно.Видимость        = Не Элементы.ГруппаДополнительно.Видимость;
		Элементы._Дополнительно.ЦветТекста            = ?(Элементы.ГруппаДополнительно.Видимость, Новый Цвет(77, 77, 77), Новый Цвет(30, 144, 255)); 
		Элементы.Группа_Кнопки_Дополнительно.ЦветФона = ?(Элементы.ГруппаДополнительно.Видимость, Новый Цвет(242, 242, 242), Новый Цвет(255, 255, 255)); 
		
	ИначеЕсли Объект.ВидОперации = ВидыОпераций.ПрочееСписание Тогда
		
		Элементы._Затраты.Видимость                 = Не ОтобразитьЗатраты; 
		Элементы.Дек_Затраты.Видимость              = ОтобразитьЗатраты; 
		Элементы.ГруппаЗатраты.Видимость            = Не ОтобразитьДополнительно;
		Элементы._Расшифровка.Видимость             = Ложь;
		Элементы.Дек_Расшифровка.Видимость          = Ложь;   
		Элементы.ГруппаРасшифровкаПлатежа.Видимость = Ложь; 
		Элементы._Дополнительно.Видимость           = Не ОтобразитьДополнительно;
		Элементы.Дек_Дополнительно.Видимость        = ОтобразитьДополнительно; 
		Элементы.ГруппаДополнительно.Видимость      = Не ОтобразитьЗатраты;  
		
		Элементы.Группа_Кнопки_Затраты.ЦветФона		  = ?(ОтобразитьЗатраты, Новый Цвет(242, 242, 242), Новый Цвет(255, 255, 255));
		Элементы.Группа_Кнопки_Дополнительно.ЦветФона = ?(ОтобразитьДополнительно, Новый Цвет(242, 242, 242), Новый Цвет(255, 255, 255));
		
	Иначе
		Элементы.ГруппаЗатраты.Видимость	        = Ложь;
		Элементы.Дек_Затраты.Видимость	            = Ложь;
		Элементы._Затраты.Видимость	                = Ложь;
		Элементы._Расшифровка.Видимость             = Не ОтобразитьРасшифровку;
		Элементы.Дек_Расшифровка.Видимость          = ОтобразитьРасшифровку; 
		Элементы.ГруппаРасшифровкаПлатежа.Видимость = Не ОтобразитьДополнительно;
		Элементы._Дополнительно.Видимость           = Не ОтобразитьДополнительно; 
		Элементы.ГруппаДополнительно.Видимость      = Не ОтобразитьРасшифровку;
		Элементы.Дек_Дополнительно.Видимость        = ОтобразитьДополнительно; 
		
		Если Объект.ВидОперации = ВидыОпераций.ВозвратОплатыСтраховойКомпании Тогда
			Элементы.ГруппаРасшифровкаПлатежа.Видимость		 = Не ОтобразитьДополнительно;
			Элементы.ГруппаРасшифровкаДинамические.Видимость = Ложь;
		Иначе
			Элементы.ГруппаРасшифровкаПлатежа.Видимость		 = Ложь;
			Элементы.ГруппаРасшифровкаДинамические.Видимость = Не ОтобразитьДополнительно;
		КонецЕсли;
				
		Элементы.Группа_Кнопки_Расшифровка.ЦветФона	  = ?(ОтобразитьРасшифровку, Новый Цвет(242, 242, 242), Новый Цвет(255, 255, 255));
		Элементы.Группа_Кнопки_Дополнительно.ЦветФона = ?(ОтобразитьДополнительно, Новый Цвет(242, 242, 242), Новый Цвет(255, 255, 255));
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
// Процедура - обработчик события формы "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
		
	// Если при возврате был сторнирован аванс сообщить об этом
	Если СуммаСторнированныхАвансов > 0 Тогда
		ПоказатьПредупреждение(,"При возврате был учтен аванс на сумму " + СуммаСторнированныхАвансов + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти() + ", остаток к возврату " + Объект.СуммаДокумента + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти()+
		Символы.ПС +"Изменить сумму учтенного аванса можно на соответсвующей закладке документа возврата."); 
		// Если аванс покрыл всю сумму отменить создание документа
		Если Объект.СуммаДокумента = 0 Тогда
			Отказ = истина;
		КонецЕсли;	
	КонецЕсли;
	УстановитьВидимость();
	ВидимостькомандыПечатьКМ3();
	
	// ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
	НастройкаШириныЭлементовФормы();
		
КонецПроцедуры

&НаКлиенте
// После записи формы на клиенте 
//
Процедура ПослеЗаписи(ПараметрыЗаписи, ДопПараметрыОтвета = Неопределено) Экспорт
	
	// Обработка рез. вопроса, смотри код ниже!!!
	Если ТипЗнч(ПараметрыЗаписи) = Тип("КодВозвратаДиалога") И ПараметрыЗаписи = КодВозвратаДиалога.Да Тогда
		РазрешенаОтправкаКомандыНаФР = Истина;
	ИначеЕсли ТипЗнч(ПараметрыЗаписи) = Тип("КодВозвратаДиалога") И ПараметрыЗаписи = КодВозвратаДиалога.Нет Тогда
		РазрешенаОтправкаКомандыНаФР = Ложь;
	КонецЕсли;
	
	// Проверка необходимости печати чека выемки
	Если Объект.Проведен
		И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.СдачаРозничнойВыручкиВКассуПредприятия")
		И НЕ ЗначениеЗаполнено(Объект.НомерЧекаККМ)
		И РозничныеПродажи.ПроверитьИспользованиеФРвКассе(Объект.Касса) = Истина Тогда
		
		Если РазрешенаОтправкаКомандыНаФР = Неопределено Тогда
			Оповещение = Новый ОписаниеОповещения("ПослеЗаписи", ЭтаФорма);
			ПоказатьВопрос(Оповещение,"Необходимо выполнить команду выемки на фискальном регистраторе. Выполнить ?",РежимДиалогаВопрос.ДаНет,,,"Внимание");
			Возврат;
			
		ИначеЕсли РазрешенаОтправкаКомандыНаФР = Истина Тогда
			
			// Выполнить печать чека выемки
			НапечататьЧек(Неопределено);
			ЭтаФорма.ОбновитьОтображениеДанных();
			
		КонецЕсли; 
	КонецЕсли;
	
	УстановитьВидимость();
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратСЛицевогоСчета") Тогда
		Оповестить("ПРОВЕДЕН_ВОЗВРАТ_С_ЛИЦЕВОГО_СЧЕТА");
	КонецЕсли;  

	Оповестить("ПОСТУПЛЕНИЕ_СПИСАНИЕ_ИНКАССАЦИЯ");
	// Оповестить динамические списки
	МассивТипов = Новый Массив;
	Для Каждого СтрокаТ ИЗ Объект.РасшифровкаПлатежа Цикл
		Если ЗначениеЗаполнено(СтрокаТ.ДокументОснования) И МассивТипов.Найти(ТипЗнч(СтрокаТ.ДокументОснования)) = Неопределено Тогда
			ОповеститьОбИзменении(СтрокаТ.ДокументОснования);
			МассивТипов.Добавить(ТипЗнч(СтрокаТ.ДокументОснования));
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
// Перед записью формы на клиенте
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	// Проверка достстаочности средст на лицевом счете
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		// Если это лицевой счет
		Если (Объект.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ЛицевойСчет") 
			ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратСЛицевогоСчета")) Тогда
			// Получаем остаток лицевого счета
			Если РежимРаботыЕдинаяСеть Тогда
				ОстаткоНаЛС = ДенежныеСредстваСервер.ПолучитьОстаткиНаЛицевыхСчетахКонтрагента(Объект.Контрагент,Объект.Дата,Объект.Ссылка,,Объект.ЛицевойСчетКонтрагента,Истина);
			Иначе
				ОстаткоНаЛС = ДенежныеСредстваСервер.ПолучитьОстаткиНаЛицевыхСчетахКонтрагента(Объект.Контрагент,Объект.Дата,Объект.Ссылка,Объект.СтруктурнаяЕдиница,Объект.ЛицевойСчетКонтрагента,Истина);
			КонецЕсли;	 
			Если ОстаткоНаЛС < Объект.СуммаДокумента Тогда 
				ПоказатьПредупреждение(,"Остаток лицевого счета на " + Формат(ТекущаяДата(), "ДФ='дд:ММ:гггг ЧЧ:мм'") + " составляет " 
								+ ?(ОстаткоНаЛС = 0, "0,00", Формат(ОстаткоНаЛС, "ЧДЦ=2")) 
								+ СокрП(ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти()) 
								+ ", чего не хватает для списания " + Формат(Объект.СуммаДокумента, "ЧДЦ=2") 
								+ СокрП(ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти()));  
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			// Получаем разрешенный процент списания со счета
			РазрешенныйПроцентСписания = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.ЛицевойСчетКонтрагента,"ПроцентОграниченияСуммыСписанияСоСчета");
			// Если ограничений нет
			Если ЗначениеЗаполнено(РазрешенныйПроцентСписания) Тогда
				РазрешеннаяСуммаСписания = ПолучитьСуммуДокументовОснования() * (РазрешенныйПроцентСписания / 100);
				Если РазрешеннаяСуммаСписания < Объект.СуммаДокумента Тогда
					ПоказатьПредупреждение(,"Счет ограничен суммой списания, " + РазрешенныйПроцентСписания +"% от суммы оплаты. Разрешено списать: " + РазрешеннаяСуммаСписания + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти());
					Отказ = Истина;
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		Если Объект.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные") Тогда
			 ОстатокДС =  ДенежныеСредстваСервер.ПолучитьОстаткоДенежныхСредств(Объект.Дата,Объект.Касса,Объект.Ссылка);
			 Если ОстатокДС < Объект.СуммаДокумента Тогда
				  Отказ = Истина;
                  ПоказатьПредупреждение(,"Сумма документа больше остатка денежных средств в кассе. Остаток: " + ОстатокДС + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти());
			  КонецЕсли;
		ИначеЕсли Объект.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные") Тогда
			 ОстатокДС =  ДенежныеСредстваСервер.ПолучитьОстаткоДенежныхСредств(Объект.Дата,Объект.БанковскийСчет,Объект.Ссылка);
			 Если ОстатокДС < Объект.СуммаДокумента Тогда
				  Отказ = Истина;
                  ПоказатьПредупреждение(,"Сумма документа больше остатка денежных средств на счете. Остаток: " + ОстатокДС + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти());
			 КонецЕсли;
		КонецЕсли;
	КонецЕсли;  
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

 &НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "Дата".
//
Процедура ДатаПриИзменении(Элемент)

	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

 &НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "ВидОперации".
//
Процедура ВидОперацииПриИзменении(Элемент)
	
	ВидОперацииПриИзмененииСервер();	
	ВидимостькомандыПечатьКМ3();
	// ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	НастройкаШириныЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
// Обработчик изменения типа денежных средств
//
Процедура ТипДенежныхСредствПриИзменении(Элемент)	
	
	УстановитьВидимость();	
	// ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	НастройкаШириныЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора" поля "ВидОперации".
//
Процедура ВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущаяОперация = Объект.ВидОперации;
КонецПроцедуры

&НаСервере
// Процедура - обработчик события на сервере "ПриИзменении" поля "ВидОперации".
//
Процедура ВидОперацииПриИзмененииСервер()
		
	Если ТекущаяОперация <> Объект.ВидОперации Тогда		
		Если Объект.ВидОперации = Перечисления.ВидыОпераций.ВыдачаПодотчетнику Тогда			
			Объект.БанковскийСчет              = Неопределено;
			Объект.БанковскийСчетКонтрагента   = Неопределено;
			Объект.Касса	                   = Неопределено;		
			Если НЕ (Объект.ВидОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента
				ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет) Тогда
				Объект.Контрагент = Неопределено;
			КонецЕсли;
		КонецЕсли;
		Объект.Статья = Справочники.СтатьиДоходовИРасходов.ПолучитьСтатьюПоУмолчаниюДляОперации(Объект.ВидОперации);
		Для Каждого ЭлементТЧ Из Объект.РасшифровкаПлатежа Цикл 
			ЭлементТЧ.Статья = Объект.Статья;		
		КонецЦикла;	
		
		// Зачищаем таблицу расшифровки
		Объект.РасшифровкаПлатежа.Очистить();	
		СтрокаТаблицы        = Объект.РасшифровкаПлатежа.Добавить();
		СтрокаТаблицы.Сумма  = Объект.СуммаДокумента;	
		СтрокаТаблицы.Статья = Объект.Статья;
	КонецЕсли;
	
    УстановитьВидимость();
	
	ОчиститьЭлементыРасшифровки();
	СоздатьЭлементыРасшифровкиПлатежа();
	
КонецПроцедуры // ВидОперацииПриИзмененииСервер()

&НаКлиенте
// Обработчик при начале выбора банковского счета зачисления средств 
//
Процедура БанковскийСчетЗачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.БанковскиеСчета.ФормаВыбора",
	Новый Структура("Владелец", ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.СтруктурнаяЕдиница, "Организация")),,,,,
	Новый ОписаниеОповещения("БанковскийСчетПоУмолчаниюНачалоВыбораЗавершение", ЭтотОбъект), 
	РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После выбора банковского счета
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура БанковскийСчетПоУмолчаниюНачалоВыбораЗавершение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда
		Объект.БанковскийСчет = РезультатВыбора;
		Модифицированность = Истина;
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
// Обработчик при начале выбора банковского счета списания средств
//
Процедура БанковскийСчетСписанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РеквизитВладельца = Неопределено;
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
	    РеквизитВладельца = Объект.Контрагент;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.СдачаНаличныхВБанк") Тогда
		РеквизитВладельца = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.СтруктурнаяЕдиница, "Организация");
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(РеквизитВладельца) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОткрытьФорму("Справочник.БанковскиеСчета.ФормаВыбора",
		Новый Структура("Владелец", РеквизитВладельца),,,,,
		Новый ОписаниеОповещения("БанковскийСчетСписанияПоУмолчаниюНачалоВыбораЗавершение", ЭтотОбъект), 
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
// Процедура - После выбора банковского счета
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура БанковскийСчетСписанияПоУмолчаниюНачалоВыбораЗавершение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда
		Объект.БанковскийСчетКонтрагента = РезультатВыбора;
		Модифицированность = Истина;
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора" поля Касса.
//
Процедура КассаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	
	СтандартнаяОбработка = Ложь;
	мПараметрыВыбора = Новый Структура;
	мПараметрыВыбора.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	ОписаниеОповещения = Новый ОписаниеОповещения("КассаНачалоВыбораЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.Кассы.ФормаВыбора", мПараметрыВыбора,,,,,ОписаниеОповещения , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Касса начало выбора завершение
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура КассаНачалоВыбораЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда 
		Объект.Касса = ВыбранноеЗначение;		
		ККТ = ОпределитьТипОборудования(Объект.Касса);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработка изменения выбора сертификата
//
Процедура СертификатПриИзменении(Элемент)
	
	Объект.СертификатСерийныйНомер = Неопределено;
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
// Обработка начала выбора серийного номера сертификата
//
Процедура СертификатСерийныйНомерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вызов формы выбора серийного мера сертификата
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Владелец"             ,Объект.Сертификат);
	ПараметрыФормы.Вставить("Контрагент"           ,Объект.Контрагент);
	ПараметрыФормы.Вставить("ОтборСерииСертификата",Истина);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СертификатСерийныйНомерНачалоВыбораЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ПартииНоменклатуры.Форма.ФормаВыбора", ПараметрыФормы,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте 
// Процедура - Сертификат серийный номер начало выбора завершение
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура СертификатСерийныйНомерНачалоВыбораЗавершение(СерийныйНомерСертификата, ДополнительныеПараметры) Экспорт
					
	Если НЕ СерийныйНомерСертификата = Неопределено И СерийныйНомерСертификата.Количество() > 0 Тогда		
		Объект.СуммаДокумента           = ПолучитьСуммуСертификата(СерийныйНомерСертификата[0]);
		Объект.СертификатСерийныйНомер  = СерийныйНомерСертификата[0];
		СуммаДокументаПриИзменении(Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "ВТаблице".
//
Процедура ВТаблицеПриИзменении(Элемент)
	
	Элементы.Статья.Доступность = НЕ Объект.СтатьяВТаблице;
	Элементы.РасшифровкаПлатежаСтатья.Видимость = Объект.СтатьяВТаблице;
	Если НЕ Объект.Статья.Пустая() Тогда
		Для Каждого СтрокаТЧ Из Объект.РасшифровкаПлатежа Цикл
			СтрокаТЧ.Статья = Объект.Статья;
		КонецЦикла;
	КонецЕсли;
	
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОплатыСтраховойКомпании") Тогда
		ОчиститьЭлементыРасшифровки();
		СоздатьЭлементыРасшифровкиПлатежа();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещение = Новый ОписаниеОповещения("ДоговорНачалоВыбораЗавершение", ЭтаФорма); 
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", Новый Структура("Отбор", Новый Структура("Контрагент", Объект.Контрагент))
		,,,,, ОписаниеОповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаСобытийЭлементовОбслуживающихОперациюВыплатыЗП

&НаКлиенте
// При начале выбора режима заполнения данными 
//
Процедура ВыплатаЗПРежимФормированияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ВызовПослеВопроса = Ложь)

	Если Объект.РасшифровкаПлатежа.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь; 
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыплатаЗПРежимФормированияНачалоВыбораЗавершение", ЭтотОбъект,Новый Структура("Элемент, ДанныеВыбора",Элемент));
		ПоказатьВопрос(ОписаниеОповещения, "Будет очищена табличная часть расшифровки платежа документа. Продолжить?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выплата ЗПРежим формирования начало выбора завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВыплатаЗПРежимФормированияНачалоВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		объект.ВыплатаЗПМесяц             = Неопределено;
		Объект.ВыплатаЗПДокументОснования = Неопределено;
		Объект.РасшифровкаПлатежа.Очистить();
		Объект.СуммаДокумента = 0;   
		ОчиститьЭлементыРасшифровки();
		СоздатьЭлементыРасшифровкиПлатежа();
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПослеВыбораРежимаФормирования",ЭтотОбъект),
		ДополнительныеПараметры.Элемент.СписокВыбора,ДополнительныеПараметры.Элемент);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// При изменении выбора режима заполнения данными 
//
Процедура ВыплатаЗПРежимФормированияПриИзменении(Элемент)
	
	 УстановитьВидимость();
	
 КонецПроцедуры  
 
&НаКлиенте
// Процедура - После выбора режима формирования
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПослеВыбораРежимаФормирования(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.ВыплатаЗПРежимФормирования = Результат.Значение;
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик события При изменении поля ВыплатаЗПМесяцПредставление
//
Процедура ПериодПредставлениеПриИзменении(Элемент)
	
	Объект.ВыплатаЗПМесяц = НачалоМесяца(Объект.ВыплатаЗПМесяц);
	ВыплатаЗПМесяцПредставление = Формат(Объект.ВыплатаЗПМесяц, "ДФ='MMMM yyyy'");
	
	Если Объект.РасшифровкаПлатежа.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПериодПредставлениеПриИзмененииПослеВопроса", ЭтотОбъект), "Будет перезаполнена табличная часть расшифровки платежа документа. Продолжить?",РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	
	ПериодПредставлениеПриИзмененииЗавершение(); 
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Период представление при изменении после вопроса
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПериодПредставлениеПриИзмененииПослеВопроса(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ПериодПредставлениеПриИзмененииЗавершение();

КонецПроцедуры

&НаКлиенте
// Процедура - Период представление при изменении завершение
//
Процедура ПериодПредставлениеПриИзмененииЗавершение()
	
	ЗаполнитьРасшифровкуДокументаПоДаннымЧисленияЗП();           
	ОчиститьЭлементыРасшифровки();
	СоздатьЭлементыРасшифровкиПлатежа();
	ОткорректироватьСуммуЗатрат();

КонецПроцедуры

&НаКлиенте
// Процедура обработчик события НачалоВыбора поля ВыплатаЗПМесяцПредставление
//
Процедура ПериодПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	СтандартнаяОбработка = Ложь;	
	ОткрытьФорму("ОбщаяФорма.ВыборПериода", Новый Структура("Значение,РежимВыбораПериода,ЗапрашиватьРежимВыбораПериодаУВладельца", Объект.ВыплатаЗПМесяц, "Месяц", Ложь),,,,,Новый ОписаниеОповещения("ПослеВыбораПериода",ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
// Процедура - После выбора периода
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПослеВыбораПериода(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено И Результат <> Объект.ВыплатаЗПМесяц Тогда
		
		Объект.ВыплатаЗПМесяц = Результат;
		
		ЭтотОбъект.ВыплатаЗПМесяцПредставление = ОбщегоНазначенияКлиентСтоматология.ПолучитьПредставлениеМесяца(Результат);
		
		Модифицированность = Истина;
		ПериодПредставлениеПриИзменении(Элементы.ВыплатаЗПМесяцПредставление); 
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
// Процедура обработчик события регулирования поля ВыплатаЗПМесяцПредставление
//
Процедура ПериодПредставлениеРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Объект.ВыплатаЗПМесяц = ДобавитьМесяц(Объект.ВыплатаЗПМесяц, Направление);
	ПериодПредставлениеПриИзменении(Элемент);
	
КонецПроцедуры

 &НаКлиенте
// При изменении выбора флага признака авансового платежа
//
Процедура ВыплатаЗПАвансПриИзменении(Элемент)
	
	// Удалить документы основания из ТЧ расшифровки если они там присутсвуют
	Если Объект.ВыплатаЗПАванс Тогда
		Для Каждого СтрокаТЧ ИЗ Объект.РасшифровкаПлатежа Цикл
			СтрокаТЧ.ДокументОснования = Неопределено;
		КонецЦикла;	
	КонецЕсли;
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
// При изменении выбора документа начисления ЗП, который является основанием для заполнения
//
Процедура ВыплатаЗПДокументОснованияПриИзменении(Элемент)
	
	ЗаполнитьРасшифровкуДокументаПоДаннымЧисленияЗП();  	
	ОчиститьЭлементыРасшифровки();
	СоздатьЭлементыРасшифровкиПлатежа();
	ОткорректироватьСуммуЗатрат();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выплата ЗПДокумент основания обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ВыплатаЗПДокументОснованияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.РасшифровкаПлатежа.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыплатаЗПДокументОснованияОбработкаВыбораЗавершение", ЭтотОбъект,Новый Структура("ВыбранноеЗначение",ВыбранноеЗначение));
		ПоказатьВопрос(ОписаниеОповещения, "Будет перезаполнена табличная часть расшифровки платежа документа. Продолжить?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выплата ЗПДокумент основания обработка выбора завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВыплатаЗПДокументОснованияОбработкаВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.ВыплатаЗПДокументОснования = ДополнительныеПараметры.ВыбранноеЗначение;
		ВыплатаЗПДокументОснованияПриИзменении(Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура заполнения данных документа по указанным параметрам начисления ЗП.
//
Процедура ЗаполнитьРасшифровкуДокументаПоДаннымЧисленияЗП()
	
	Объект.РасшифровкаПлатежа.Очистить();
	
	// Если выполняется режим заполнения по остаткам на указанный месяц расчета
	Если Объект.ВыплатаЗПРежимФормирования = 0 И ЗначениеЗаполнено(Объект.ВыплатаЗПМесяц) Тогда		
		ТаблицаЗадолженностей = РегистрыНакопления.РасчетыСПерсоналом.ПолучитьТаблицуЗадолженностиПередПерсоналом(Объект.ВыплатаЗПМесяц,,Объект.СтруктурнаяЕдиница,,Объект.Ссылка);
		Если Объект.ВыплатаЗПАванс Тогда
			ТаблицаЗадолженностей.Свернуть("СтруктурнаяЕдиница, Сотрудник", "Сумма");
		КонецЕсли;	
		Объект.РасшифровкаПлатежа.Загрузить(ТаблицаЗадолженностей);		
		// Если выполняется режим заполнения по документу начисления 
	ИначеЕсли Объект.ВыплатаЗПРежимФормирования = 1 Тогда		
		ТаблицаЗадолженностей = РегистрыНакопления.РасчетыСПерсоналом.ПолучитьТаблицуЗадолженностиПередПерсоналом(,Объект.ВыплатаЗПДокументОснования,Объект.СтруктурнаяЕдиница,,Объект.Ссылка);
		Объект.РасшифровкаПлатежа.Загрузить(ТаблицаЗадолженностей);					
		Объект.ВыплатаЗПМесяц = НачалоМесяца(Объект.ВыплатаЗПДокументОснования.ДатаНачалаПериода);		
	КонецЕсли;		
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("Сумма");
		
КонецПроцедуры

 &НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "СуммаДокумента".
//
Процедура СуммаДокументаПриИзменении(Элемент)
	
	// ДенежныеСредстваСервер.ПересчетСуммыВСтрокеРасшифровкиПлатежа(Объект, Объект.СуммаДокумента);
	Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда		
		СтрокаТаблицы       = Объект.РасшифровкаПлатежа[0];
		СтрокаТаблицы.Сумма = Объект.СуммаДокумента;
	КонецЕсли;
	Если Объект.Затраты.Количество() = 0 И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПрочееСписание") Тогда
		Объект.Затраты.Добавить();
	КонецЕсли;
	ОткорректироватьСуммуЗатрат();
	
КонецПроцедуры // СуммаДокументаПриИзменении()

&НаКлиенте
// Процедура, обработчик события "ПослеУдаления" таблицы "РасшифровкаПлатежа".
//
Процедура РасшифровкаПлатежаПослеУдаления(Элемент)	
	
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("Сумма");
	ОткорректироватьСуммуЗатрат();	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриНачалеРедактирования" таблицы "РасшифровкаПлатежа".
//
Процедура РасшифровкаПлатежаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока = Истина Тогда
		Если Объект.СтатьяВТаблице = Ложь Тогда
			Элемент.ТекущиеДанные.Статья = Объект.Статья;
		Иначе
			Элемент.ТекущиеДанные.Статья = ПолучитьПредопределеннуюСтатьюДляОперации(Объект.ВидОперации,Ложь);
		КонецЕсли;
	КонецЕсли;
//	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
// При окончании редактирования ТЧ
//
Процедура РасшифровкаПлатежаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Элемент.ТекущийЭлемент = Элементы.РасшифровкаПлатежаСумма Тогда	
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("Сумма");
	КонецЕсли;
	УстановитьДоступностьПечатиЧека();
	ОткорректироватьСуммуЗатрат();
	// Проверка соответсвия статьи расходов
	ТекущиеДанные         = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Если ТекущиеДанные <> НЕопределено Тогда
		СтатьяРасходов = ПолучитьПредопределеннуюСтатьюДляОперации(Объект.ВидОперации,НЕ ЗначениеЗаполнено(ТекущиеДанные.ДокументОснования));
		МестоХраненияСтатьи = ?(Объект.СтатьяВТаблице,ТекущиеДанные,Объект);
		Если ЗначениеЗаполнено(СтатьяРасходов) И (НЕ ЗначениеЗаполнено(МестоХраненияСтатьи.Статья) ИЛИ СтатьяРасходов <> МестоХраненияСтатьи.Статья) Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("РасшифровкаПлатежаПриОкончанииРедактированияЗавершение", ЭтотОбъект, Новый Структура("МестоХраненияСтатьи, СтатьяРасходов", МестоХраненияСтатьи, СтатьяРасходов));
			ПоказатьВопрос(ОписаниеОповещения, "Статья расходов не соответсвует виду операции, сменить статью?",РежимДиалогаВопрос.ДаНет);	 
		КонецЕсли;
	КонецЕсли;
	
//	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Расшифровка платежа при окончании редактирования завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура РасшифровкаПлатежаПриОкончанииРедактированияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	МестоХраненияСтатьи = ДополнительныеПараметры.МестоХраненияСтатьи;
	СтатьяРасходов = ДополнительныеПараметры.СтатьяРасходов;
	
	Если НЕ ЗначениеЗаполнено(МестоХраненияСтатьи.Статья) ИЛИ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		МестоХраненияСтатьи.Статья = СтатьяРасходов; 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора" поля "РасшифровкаПлатежаЗаказПоступление".
//
Процедура РасшифровкаПлатежаЗаказРеализацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВыплатаЗаработнойПлаты") Тогда
		ПараметрыФормы   = Новый Структура;
		ПараметрыФормы.Вставить("Контрагент"         ,Объект.Контрагент);
		ПараметрыФормы.Вставить("ВидОперации"        ,Объект.ВидОперации);
		ПараметрыФормы.Вставить("КотрольКонтрагента" ,Истина);
		ПараметрыФормы.Вставить("СтруктурнаяЕдиница" ,Объект.СтруктурнаяЕдиница);
		
		ОткрытьФорму("ОбщаяФорма.ВыборДокументаРасчетов",ПараметрыФормы,Элемент);
	Иначе
		
		ОписаниеОповещения = Новый ОписаниеОповещения("РасшифровкаПлатежаЗаказРеализацияНачалоВыбораЗавершение", ЭтотОбъект,Новый Структура("ЭлементФормы",ТекущийЭлемент));
		ОткрытьФорму("Документ.НачислениеЗарплаты.ФормаВыбора",,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора" поля "РасшифровкаПлатежаЗаказПоступление".
//
Процедура РасшифровкаПлатежаЗаказРеализацияНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ЭлементФормы = ДополнительныеПараметры.ЭлементФормы;
	
	Если ЭлементФормы <> Неопределено Тогда
		ИндексСтроки = Число(Прав(ЭлементФормы.Имя, СтрДлина(ЭлементФормы.Имя) - (СтрДлина(ЭлементФормы.Имя) -1)));
		Объект.РасшифровкаПлатежа[ИндексСтроки].ДокументОснования = Результат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ОбработкаВыбора" поля "РасшифровкаПлатежаЗаказПоступление".
//
Процедура РасшифровкаПлатежаЗаказРеализацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	СуммуБратьПоКолонкеОплачено = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОплатыСтраховойКомпании");
	Если ВыбранноеЗначение <> Неопределено Тогда			
		Счетчик = 0;
		Для Каждого ЭлементМ ИЗ ВыбранноеЗначение Цикл
			
			РазрешитьДобавление = Истина;
			// Проверка существования строки с выбранными данными
			Для Каждого СтрокаТ ИЗ объект.РасшифровкаПлатежа Цикл
				Если СтрокаТ.ДокументОснования = ЭлементМ.ДокументОснования И СтрокаТ.ДокументАванса = ЭлементМ.ДокументАванса Тогда
					Если СуммуБратьПоКолонкеОплачено = Истина Тогда
						СтрокаТ.Сумма       = ЭлементМ.Оплачено;
					Иначе	
						СтрокаТ.Сумма       = ЭлементМ.Задолженность; 
					КонецЕсли;
					РазрешитьДобавление = Ложь;
					Прервать;
				КонецЕсли;	
			КонецЦикла;
			// Есди добавление данных в строку разрешено
			Если РазрешитьДобавление = Истина Тогда
				ОбрабатываемаяСтрока = Неопределено;
				
				Если Счетчик = 0 Тогда
					Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОплатыСтраховойКомпании") Тогда
						ОбрабатываемаяСтрока = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
					Иначе
						ОбрабатываемаяСтрока = Объект.РасшифровкаПлатежа[ПолучитьИндексСтроки(Элемент.Имя)];
					КонецЕсли;	
				Иначе
					ОбрабатываемаяСтрока = Объект.РасшифровкаПлатежа.Добавить();
				КонецЕсли;
		
				ОбрабатываемаяСтрока.ДокументОснования = ЭлементМ.ДокументОснования;
				ОбрабатываемаяСтрока.ДокументАванса    = ЭлементМ.ДокументАванса;
				
				Если СуммуБратьПоКолонкеОплачено = Истина Тогда
					ОбрабатываемаяСтрока.Сумма = ЭлементМ.Оплачено;
				Иначе	
					ОбрабатываемаяСтрока.Сумма = ЭлементМ.Задолженность; 
				КонецЕсли;
			
				Счетчик = Счетчик + 1;
			КонецЕсли;
		КонецЦикла;
		// Подсчет суммы документа
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("Сумма");
		ОткорректироватьСуммуЗатрат();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОкончаниеВводаТекста".
//
Процедура РасшифровкаПлатежаДинамическиеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ТекущиеДанные = Объект.РасшифровкаПлатежа[ПолучитьИндексСтроки(Элемент.Имя)];
	СтатьяРасходов = ПолучитьПредопределеннуюСтатьюДляОперации(Объект.ВидОперации, НЕ ЗначениеЗаполнено(ТекущиеДанные.ДокументОснования));
	МестоХраненияСтатьи = ?(Объект.СтатьяВТаблице,ТекущиеДанные,Объект);
	Если ЗначениеЗаполнено(СтатьяРасходов) И (НЕ ЗначениеЗаполнено(МестоХраненияСтатьи.Статья) ИЛИ СтатьяРасходов <> МестоХраненияСтатьи.Статья) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("РасшифровкаПлатежаПриОкончанииРедактированияЗавершение", ЭтотОбъект, Новый Структура("МестоХраненияСтатьи, СтатьяРасходов", МестоХраненияСтатьи, СтатьяРасходов));
		ПоказатьВопрос(ОписаниеОповещения, "Статья расходов не соответсвует виду операции, сменить статью?",РежимДиалогаВопрос.ДаНет);	 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура РасшифровкаПлатежаСуммаПриИзменении()
	
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора" поля "Сотрудник" ТЧ.
//
Процедура СотрудникТЧНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы       = Новый Структура;
	ПараметрыФормы.Вставить("БезОтбораПоРолям", Истина);
	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора",ПараметрыФормы,Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомнадФормы

 &НаКлиенте
// Процедура печати чека на фискальном регистраторе.
//
Процедура НапечататьЧек(Команда)
	
	Если ЗначениеЗаполнено(Объект.НомерЧекаККМ) Тогда
		ПоказатьПредупреждение(, "Документ уже пробит на фискальном регистраторе! Номер чека:" + Объект.НомерЧекаККМ);
		Возврат;
	КонецЕсли;  
	
	Если Объект.Проведен = Ложь 
		ИЛИ ЭтаФорма.Модифицированность = Истина Тогда
		
		ПоказатьПредупреждение(, НСтр("ru='Предварительно документ необходимо провести.';en='Pre document is necessary conduct.'"));
		Возврат;
	КонецЕсли;
	
	// Проверяем ставку НДС.
	СтавкаНДС = ОбщегоНазначенияСтоматология.ПолучитьСтавкуНДС(Объект.СтруктурнаяЕдиница);			
	Если Не ЗначениеЗаполнено(СтавкаНДС) Тогда
		ПоказатьПредупреждение(, "Заполните ставку НДС в организации и повторите операцию оплаты.");
		ОткрытьФорму("Справочник.Организации.Форма.ФормаЭлемента", 
					Новый Структура("Ключ", ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.СтруктурнаяЕдиница, "Организация")));
		Возврат;	
	КонецЕсли;  
	
	ВидНалога = Неопределено;
	
	// Проверка на применяемые налоги.	
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВзносНаЛицевойСчет") 
		И Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратСЛицевогоСчета")
		И Объект.Статья <> ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.ВозвратСЛицевогоСчета")
		И Объект.Статья <> ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.ВозвратАвансаКлиенту")
		И Объект.Статья <> ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.ВзносНалицевойСчет")
		И Объект.Статья <> ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.ВзносАвансаОтКлиента") Тогда
		
		Для Каждого СтрокаТЧ из Объект.РасшифровкаПлатежа Цикл
			ЭтоСтрокаАванса = СтрокаТЧ.ЭтоАванс
			ИЛИ СтрокаТЧ.Статья = ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.ВозвратАвансаКлиенту")
			ИЛИ СтрокаТЧ.Статья = ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.ВозвратСЛицевогоСчета") 
			ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратСЛицевогоСчета");
			
			Если ТипЗнч(СтрокаТЧ.ДокументОснования) = Тип("ДокументСсылка.Реализация")
				ИЛИ ТипЗнч(СтрокаТЧ.ДокументОснования) = Тип("ДокументСсылка.Прием")
				ИЛИ ТипЗнч(СтрокаТЧ.ДокументОснования) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
				Если ВидНалога = Неопределено Тогда
					ВидНалога = ?(ЭтоСтрокаАванса,
									ОбщегоНазначенияСтоматология.ПолучитьВидНалогаАванс(Объект.СтруктурнаяЕдиница),
									ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТЧ.ДокументОснования, "ВидНалога"));
					
				ИначеЕсли НЕ ВидНалога = ?(ЭтоСтрокаАванса,
					ОбщегоНазначенияСтоматология.ПолучитьВидНалогаАванс(Объект.СтруктурнаяЕдиница),
					ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТЧ.ДокументОснования, "ВидНалога")) Тогда // ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрокаТЧ.ДокументОснования, "ВидНалога") Тогда
					ТекстСообщения = "В одном документе, пробиваемом в ККТ с передачей данных, может пробиваться номенклатура, использующая один режим налогообложения.";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Возврат;										
				КонецЕсли;				
			КонецЕсли;		
			
			Если ЭтоСтрокаАванса Тогда
				ВидНалога = ОбщегоНазначенияСтоматология.ПолучитьВидНалогаАванс(Объект.СтруктурнаяЕдиница);
			КонецЕсли;		
			
		КонецЦикла;		
	Иначе
		ВидНалога = ОбщегоНазначенияСтоматология.ПолучитьВидНалогаАванс(Объект.СтруктурнаяЕдиница);
	КонецЕсли;     
	
	// Выполнить контроль кассовой смены
	ОписаниеОшибки					= Неопределено;
	ВыполнятьОперациюНаФискальнике  = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.Касса, "ИспользоватьБезПодключенияОборудования") = Ложь; 
	ПараметрыИспользованияКассовойСмены = Новый Структура("ВыполнятьОперациюНаФискальнике", ВыполнятьОперациюНаФискальнике);
	РозничныеПродажиКлиент.ВыполнитьКонтрольИспользованияКассовойСмены(ЭтотОбъект, Объект.Касса, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки);
	     
КонецПроцедуры

&НаКлиенте
// Процедура, команда добавления динамической строки расшифровки платежа.
//
Процедура ДобавитьСтрокуРасшифровки(Команда)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПрочееСписание") Тогда
		ИмяТЧ = "Затраты";
	Иначе
		ИмяТЧ = "РасшифровкаПлатежа";
	КонецЕсли;	
	
	НоваяСтрока = Объект[ИмяТЧ].Добавить();
	// НоваяСтрока.КлючСтроки	 = Новый УникальныйИдентификатор;
	
	СоздатьСтрокуЭлементовРасшифровки(Объект[ИмяТЧ].Количество() - 1);
	
КонецПроцедуры

&НаКлиенте
// Процедура, команда удаления динамической строки расшифровки платежа.
//
Процедура УдалитьСтрокуРасшифровки(Команда)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПрочееСписание") Тогда
		ИмяТЧ = "Затраты";
	Иначе
		ИмяТЧ = "РасшифровкаПлатежа";
	КонецЕсли;	
	
	ИндексСтроки = ПолучитьИндексСтроки(ЭтаФорма.ТекущийЭлемент.Имя);
	УдалитьЭлементыРасшифровкиПлатежа(ИндексСтроки);
	
	Если Объект[ИмяТЧ].Количество() = 0 Тогда
		ДобавитьСтрокуРасшифровки(Неопределено);
	КонецЕсли;
	
	Объект.СуммаДокумента = Объект[ИмяТЧ].Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
// Процедура печати.
//
Процедура ДокументПечать(Команда)

	МассивДокументов = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		МассивДокументов.Добавить(Объект.Ссылка);
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "СписаниеДенежныхСредств");	
	Структура.Вставить("МассивДокументов", МассивДокументов);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	
	Если ЭтотОбъект.ДоступностьКнопкиПечатьРКО = Истина Тогда	
		НайденнаяСтрокаРКО = СписокПечатныхФорм.НайтиПоЗначению("РКО");
		СписокПечатныхФорм.Удалить(НайденнаяСтрокаРКО);
	КонецЕсли;
	
	Если НЕ ДоступностьКнопкиПечатьКМЗ = Истина Тогда	
		НайденнаяСтрокаКМЗ = СписокПечатныхФорм.НайтиПоЗначению("КМ3");
		СписокПечатныхФорм.Удалить(НайденнаяСтрокаКМЗ);
	КонецЕсли;	
	
	// Делаем возврат если печатные формы не доступны
	Если НЕ ЗначениеЗаполнено(СписокПечатныхФорм) Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаКоманды", УправлениеПечатьюКлиентСтоматология, Структура);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		
		СтруктураВопроса = Новый Структура;
		СтруктураВопроса.Вставить("СписокПечатныхФорм", СписокПечатныхФорм);
		СтруктураВопроса.Вставить("Оповещение", Оповещение);
		ОповещениеДляВопроса = Новый ОписаниеОповещения("ПослеВопросаЗавершение", ЭтотОбъект, СтруктураВопроса);			
		ПоказатьВопрос(ОповещениеДляВопроса, "Данные ещё не записаны. Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе	
		
		ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, Элементы.ФормаДокументаПечать);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура Расшифровка(Команда)
	
	УстановитьОтображениеЭлементовПереключателя("_ГруппаРасшифровка");	
	
КонецПроцедуры

&НаКлиенте
Процедура Затраты(Команда)
	
	УстановитьОтображениеЭлементовПереключателя("_ГруппаЗатраты");
	
КонецПроцедуры

&НаКлиенте
Процедура Дополнительно(Команда)
	
	УстановитьОтображениеЭлементовПереключателя("_ГруппаДополнительно");	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ОчиститьЧекККМ".
//
Процедура ОчиститьЧекККМ(Команда)
		
	Если НЕ Объект.Ссылка.Пустая()
		И Объект.НомерЧекаККМ = 99999999 Тогда
		
		Объект.НомерЧекаККМ = 0;
		ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыФункции


#Область ПроцедурыФискализацииДокумента

&НаКлиенте
// Процедура, обработчик завершения выемки из кассы.
//
Процедура ИнкассацияНаФискальномУстройствеЗавершение(РезультатВыполнения, Параметры) Экспорт
		
	Если РезультатВыполнения.Результат Тогда		
		// Если чек пробился, то возвращаем номер чека ккм в документ (по умолчанию 88888888).
		Объект.НомерЧекаККМ = 88888888;
		ЭтаФорма.Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));	
		//УстановитьСостояниеЭлементовФормы();                                                                                  		
	Иначе
		ТекстСообщения = НСтр("ru='При выполнении операции произошла ошибка."
		"Чек не напечатан на фискальном устройстве."
		"Дополнительное описание: %ДополнительноеОписание%';en='With performing operations happened mistake."
		"Check not printedby on fiscal device."
		"Additional description: %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - После контроля использования кассовой смены
//
// Параметры:
//  ИспользованиеКассовойСменыРазрешено	 - 	 - 
//  ПараметрыИспользованияКассовойСмены	 - 	 - 
//  ОписаниеОшибки						 - 	 - 
//
Процедура ПослеКонтроляИспользованияКассовойСмены(ИспользованиеКассовойСменыРазрешено, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки) Экспорт 
	
	Если ИспользованиеКассовойСменыРазрешено = Ложь Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Списание денежных средств'; en = 'Debiting inflow'"),,
										НСтр("ru = 'Операция запрещена: '; en = 'Operation is prohibited: '") + ОписаниеОшибки, 
										БиблиотекаКартинок.Предупреждение32,
										СтатусОповещенияПользователя.Важное); 
		Возврат;
	КонецЕсли;
	
	Если ПараметрыИспользованияКассовойСмены.Свойство("ВыполнятьОперациюНаФискальнике") 
		И ПараметрыИспользованияКассовойСмены.ВыполнятьОперациюНаФискальнике Тогда
		
		Если КассаИспользуетсяККТ(Объект.Касса) = Истина Тогда
			Если Не ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				ПараметрыФормы	= Новый Структура("Клиент, Касса", Объект.Контрагент, Объект.Касса);
				Оповещение		= Новый ОписаниеОповещения("НапечататьЧекЗавершение", ЭтотОбъект);
				ОткрытьФорму("Обработка.ПомощникПроведенияОплаты.Форма.ФормаФормированиеЧека", 
					ПараметрыФормы,
					ЭтаФорма,,,,
					Оповещение, 
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
					
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ВыполнитьОперациюНаЭТиНапечататьЧекФР();
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
// Процедура - Напечатать чек завершение
//
 // Параметры:
 //  Результат	 - 	 - 
 //  ДопПараметры - 	 - 
//      
Процедура НапечататьЧекЗавершение(Результат, ДопПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ВыполнитьОперациюНаЭТиНапечататьЧекФР(Результат);
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
// Процедура - Напечатать чек обработка
// Завершение процедуры Напечатать чек ответ.
//
Процедура ВыполнитьОперациюНаЭТиНапечататьЧекФР(ДопПараметры = Неопределено)
	
	Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
		ПечататьЧек		= ?(ДопПараметры.Свойство("Печать"), ДопПараметры.Печать		  , Ложь);
		ПочтаКлиента	= ?(ДопПараметры.Свойство("ПокупательEmail"), ДопПараметры.ПокупательEmail, Неопределено);
		ТелефонКлиента	= ?(ДопПараметры.Свойство("ПокупательНомер"), ДопПараметры.ПокупательНомер, Неопределено);
	Иначе
		ПечататьЧек		= Истина;
		ПочтаКлиента	= Неопределено;
		ТелефонКлиента	= Неопределено;
	КонецЕсли;

	ДанныеЭквайринга = Неопределено;
	
	Если Не ЗначениеЗаполнено(Объект.НомерВходящегоДокумента)
		И ВыполнятьОперациюНаЭТ(Объект.ТипДенежныхСредств, Объект.ВидОперации, Объект.Касса, Объект.ЭквайрингТерминал) = Истина Тогда	
		ОписаниеОшибки = "";
		ДанныеЭквайринга = ВыполнитьОперациюНаЭТ(ОписаниеОшибки);
		Если НЕ ЗначениеЗаполнено(ДанныеЭквайринга) ИЛИ ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			Возврат;
		КонецЕсли; 	
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.СдачаРозничнойВыручкиВКассуПредприятия") Тогда		
		
		СтатусФР = РозничныеПродажи.ПроверитьИспользованиеФРвКассе(Объект.Касса);		
		Если СтатусФР Тогда			
			
			ДокументОснование = Новый Массив;
			ДокументОснование.Добавить(Объект.Ссылка);
			ИдентификаторУстройстваФР = МенеджерОборудованияВызовСервера.ПолучитьИдентификаторФискальногоРегистратораДляКассы(Объект.Касса);
			ПараметрыОперации = Новый Структура("ТипИнкассации, Сумма, ДокументОснование, Документ, Касса, Сотрудник",
			0, Объект.СуммаДокумента, ДокументОснование, Объект.Ссылка, Объект.Касса, Объект.АвторДокумента);
			ОповещениеПриЗавершении = Новый ОписаниеОповещения("ИнкассацияНаФискальномУстройствеЗавершение", ЭтотОбъект);
			МенеджерОборудованияКлиент.НачатьИнкассациюНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройстваФР);			
			
		КонецЕсли;	
	Иначе
		
		Если ИспользоватьСтаруюСистемуФормированияДляФРдляККТ(Объект.Касса) = Ложь Тогда
			ФормированиеЧека = ПодготовитьПараметрыЧекаДляККТ(ПочтаКлиента, ТелефонКлиента, ПечататьЧек);  		
		Иначе
			ФормированиеЧека = ПодготовитьПараметрыЧекаДляФР(ПочтаКлиента, ТелефонКлиента, ПечататьЧек); 
		КонецЕсли;
		
		Если ФормированиеЧека.Результат Тогда
			
			ИдентификаторУстройстваФР = МенеджерОборудованияВызовСервера.ПолучитьИдентификаторФискальногоРегистратораДляКассы(Объект.Касса);
			
			Если ФормированиеЧека.Свойство("ФискальныйЧек") Тогда		
				
				Контекст = Новый Структура();
				Контекст.Вставить("ТипЧека", Истина);			
				Оповещение            = Новый ОписаниеОповещения("ПробитьЧекЗавершение"            , ЭтотОбъект, Контекст);
				ПослеОткрытияЧека     = Новый ОписаниеОповещения("ПечатьЧека_ПослеОткрытияЧека"    , ЭтотОбъект, Контекст);
				ПослеОшибкиПечатиЧека = Новый ОписаниеОповещения("ПечатьЧека_ПослеОшибкиПечатиЧека", ЭтотОбъект, Контекст);
				
				ОбщиеПараметры = ФормированиеЧека.ФискальныйЧек;
				МенеджерОборудованияКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(Оповещение, УникальныйИдентификатор, ОбщиеПараметры, ИдентификаторУстройстваФР, , ПослеОткрытияЧека, ПослеОшибкиПечатиЧека);		
				
			КонецЕсли;			
			
			Если ФормированиеЧека.Свойство("НефискальныйЧек") Тогда
				
				ТекстЧека  = ФормированиеЧека.НефискальныйЧек;
				Контекст   = Новый Структура();
				Контекст.Вставить("ТипЧека", Ложь);
				Оповещение = Новый ОписаниеОповещения("ПробитьЧекЗавершение", ЭтотОбъект, Контекст);
				МенеджерОборудованияКлиент.НачатьПечатьТекста(Оповещение, УникальныйИдентификатор, ТекстЧека, ИдентификаторУстройстваФР);
				
			КонецЕсли;		
			
		Иначе
			
			ОписаниеОшибки = ФормированиеЧека.ОписаниеОшибки;
			ТекстСообщения = НСтр("ru='При проведение оплаты произошла ошибка.
			|Дополнительное описание: %ДополнительноеОписание%';
			|en='With holding payment happened mistake.
			|Additional description: %ДополнительноеОписание%'");
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);			
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НомерФискальногоЧека)
			ИЛИ ЗначениеЗаполнено(НомерНефискальногоЧека) Тогда
			
			Объект.НомерЧекаККМ = ?(ЗначениеЗаполнено(НомерФискальногоЧека), НомерФискальногоЧека, НомерНеФискальногоЧека);
			
			Если ЗначениеЗаполнено(НомерВходящегоДокумента) Тогда
				Объект.НомерВходящегоДокумента = НомерВходящегоДокумента;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеЭквайринга) 
				И ТипЗнч(ДанныеЭквайринга) = Тип("Структура") Тогда
				
				Объект.ЭквайрингСсылочныйНомер      = ДанныеЭквайринга.СсылочныйНомер;
				Объект.ЭквайрингКодАвторизации      = ДанныеЭквайринга.КодАвторизации;
				Объект.ЭквайрингНомерЧека           = ДанныеЭквайринга.НомерЧека;
				Объект.ЭквайрингНомерПлатежнойКарты = ДанныеЭквайринга.НомерКарты;
				
			КонецЕсли;  			
			
			// перезаписываем кассовую смену по факту пробития на ФР.
			Попытка
				Объект.КассоваяСмена = РозничныеПродажи.ПолучитьТекущуюОткрытуюКассовуюСмену(Объект.Касса);
			Исключение
			КонецПопытки;
			
			ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));	
			
			УстановитьВидимость();
			
		КонецЕсли;  
	КонецЕсли;
		
КонецПроцедуры	

&НаСервереБезКонтекста
// Функция - Выполнять операцию на ЭТ
//
// Параметры:
//  ТипДенежныхСредств	 - 	 - 
//  ВидОперации			 - 	 - 
//  Касса				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВыполнятьОперациюНаЭТ(ТипДенежныхСредств, ВидОперации, Касса, ТекущийЭТ)
	
	Разрешено = Ложь;
	Если ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта
		И (ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыКлиенту
		ИЛИ ВидОперации = Перечисления.ВидыОпераций.ВозвратОшибочнойОплатыКлиенту
		ИЛИ ВидОперации = Перечисления.ВидыОпераций.ВозвратСЛицевогоСчета) Тогда 
		
		//ЭТКассы = Справочники.ЭквайринговыеТерминалы.ПолучитьЭквайринговыйТерминалПоУмолчанию(Касса);
		Если ЗначениеЗаполнено(ТекущийЭТ) 
			И ЗначениеЗаполнено(ТекущийЭТ.ПодключаемоеОборудование)
			И ТекущийЭТ.ИспользоватьБезПодключенияОборудования = Ложь Тогда

			Разрешено = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Разрешено;
	
КонецФункции

&НаКлиенте
// Процедура - Выполинть операцию на ЭТ
//
Функция ВыполнитьОперациюНаЭТ(ОписаниеОшибки)
	
	//ЭТКассы = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.Касса, "ЭквайринговыйТерминал");
	ФРКассы = ПолучитьСсылкиНаОборудованиеФР();
		
	Возврат МенеджерОборудованияКлиент.ВыполнитьВозвратПлатежаЭквайринг(Объект.ЭквайрингТерминал, ФРКассы, ЭтаФорма.УникальныйИдентификатор, Объект.СуммаДокумента, ОписаниеОшибки);
	
КонецФункции  

&НаКлиенте
// Процедура, завершение пробития чека на ФР.
//
Процедура ПробитьЧекЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда		
		// Установить полученное значение номера чека реквизиту документа.
		Если РезультатВыполнения.ВыходныеПараметры <> Неопределено Тогда
			// Объект.НомерСменыККМ = РезультатВыполнения.ВыходныеПараметры[0];
			Если Параметры.ТипЧека Тогда
				  			
				НомерФискальногоЧека = РезультатВыполнения.ВыходныеПараметры[1];
				// ПодключенаКассаLifePay = ПодключенаКассаLifePay(Объект.Касса);
				// Если ПодключенаКассаLifePay = Истина Тогда
				//	НомерВходящегоДокумента = РезультатВыполнения.ВыходныеПараметры[7];
				// ИначеЕсли ПодключенаКассаCloudKassir(Объект.Касса) Тогда
				//	НомерВходящегоДокумента = РезультатВыполнения.ВыходныеПараметры[7];
				// ИначеЕсли ОбщегоНазначения.ПодключенаКассаЭвотор(Объект.Касса) Тогда
				//	НомерФискализацииЭвотор = РезультатВыполнения.ВыходныеПараметры[7];
				// КонецЕсли;  
				
				// запись номера с префиксом (для Топ Стречинга)
				// СтруктураДанныхПрефикса = ПолучитьПризнакЗаписыватьНомерЧекаСПрефиксомВНомерВходящегоДокумента(Объект.Касса); 
				// Если СтруктураДанныхПрефикса.ЗаписыватьНомерЧекаСПрефиксомВНомерВходящегоДокумента Тогда // и Префикс <> ""   					
				//	Объект.НомерВходящегоДокумента = "" + СтруктураДанныхПрефикса.Префикс + "" + НомерФискальногоЧека; 
				// КонецЕсли; 
				// ----------------------------------------------
				
				// Если ФискальныеОперации не был записан - произошла ошибка при записи.
				Если РезультатВыполнения.ВыходныеПараметры.Количество() > 8 Тогда
					ПараметрыФискализации = РезультатВыполнения.ВыходныеПараметры[8];
					Если НЕ ПараметрыФискализации.ОперацияЗаписана Тогда
						МенеджерОборудованияВызовСервера.ЗаписатьФискальнуюОперацию(ПараметрыФискализации);
					КонецЕсли;
					Если НЕ ПустаяСтрока(ПараметрыФискализации.ЧекКоррекцииСторно)
						И НЕ ПараметрыФискализации.ЧекКоррекцииСторно.ОперацияЗаписана Тогда
						МенеджерОборудованияВызовСервера.ЗаписатьФискальнуюОперацию(ПараметрыФискализации.ЧекКоррекцииСторно);
					КонецЕсли;
				КонецЕсли;       

			Иначе
				НомерНефискальногоЧека = РезультатВыполнения.ВыходныеПараметры[1];
			КонецЕсли;			
		КонецЕсли;
		
	Иначе 		
		ТекстСообщения = НСтр("ru='При печати чека произошла ошибка.
		|Чек не напечатан на фискальном регистраторе.
		|Дополнительное описание:
		|%ДополнительноеОписание%';
		|en='With print check happened mistake.
		|Check not printedby on fiscal registrar.
		|Additional description:
		|%ДополнительноеОписание%'");
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);                                         		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик описания оповещения.
//
Процедура ПечатьЧека_ПослеОткрытияЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	ШапкаЧека = ПараметрыВыполнения.ВходныеПараметры;
	
	Если ПараметрыВыполнения.НомерСмены <> 0 Тогда
		ШапкаЧека.НомерСмены = ПараметрыВыполнения.НомерСмены;
	КонецЕсли;
	
	Если ПараметрыВыполнения.НомерЧека <> 0 Тогда
		ШапкаЧека.НомерЧека = ПараметрыВыполнения.НомерЧека;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ПараметрыВыполнения.ОповещениеПродолжения, ПараметрыВыполнения);
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ПечатьЧека_ПослеОшибкиПечатиЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт

	ШапкаЧека = ПараметрыВыполнения.ВходныеПараметры;
	ШапкаЧека.НомерЧека = ШапкаЧека.НомерЧека + 1000000;

КонецПроцедуры
	
&НаСервереБезКонтекста
// Функция - Использовать старую систему формирования для ф рдля ККТ
 //
 // Возвращаемое значение:
 //  - 
 //
Функция ИспользоватьСтаруюСистемуФормированияДляФРдляККТ(Касса)	
	
	Возврат Справочники.Кассы.ИспользоватьСтаруюСистемуФормированияДляФРдляККТ(Касса);	
	
КонецФункции

&НаСервере
// Функция - подготавливает параметры чека ККТ.
//
Функция ПодготовитьПараметрыЧекаДляККТ(ПочтаКлиента, ТелефонКлиента, ПечататьЧек)
		
	МассивДокументовОплаты = Новый Массив;
	МассивДокументовОплаты.Добавить(Объект.Ссылка);
	Для Каждого СтрокаТЧ Из Объект.РасшифровкаПлатежа Цикл
		Если СтрокаТЧ.Сумма <> 0 И ЗначениеЗаполнено(СтрокаТЧ.ДокументОснования) Тогда
			МассивДокументовОплаты.Добавить(СтрокаТЧ.ДокументОснования);
		КонецЕсли;
	КонецЦикла;

	ПараметрыЧека = МенеджерОборудованияВызовСервера.ПустаяСтруктураПараметровЧека();
	
	
	ОперацияАванса = Ложь;
	Для Каждого СтрокаТЧ Из Объект.РасшифровкаПлатежа Цикл
		Если СтрокаТЧ.ЭтоАванс 
			ИЛИ СтрокаТЧ.Статья = Справочники.СтатьиДоходовИРасходов.ВозвратАвансаКлиенту
			ИЛИ СтрокаТЧ.Статья = Справочники.СтатьиДоходовИРасходов.ВозвратСЛицевогоСчета 
			ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратСЛицевогоСчета Тогда
			
			ОперацияАванса = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;                                        
	
	
	Если Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыКлиенту
		Или Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОшибочнойОплатыКлиенту
		Или Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратСЛицевогоСчета Тогда
		ПараметрыЧека.ТипЧека             = 1;
	Иначе                                     
		ПараметрыЧека.ТипЧека             = 0;		
	КонецЕсли;
	ПараметрыЧека.ВидОперации             = ?(ОперацияАванса, Перечисления.ВидыОпераций.ВозвратСЛицевогоСчета, Объект.ВидОперации);	
	ПараметрыЧека.СтруктурнаяЕдиница      = Объект.СтруктурнаяЕдиница;
	ПараметрыЧека.Организация             = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.СтруктурнаяЕдиница, "Организация");
	ПараметрыЧека.Сотрудник               = Объект.Сотрудник;
	ПараметрыЧека.Клиент                  = Объект.Контрагент;
	ПараметрыЧека.Дата                    = ТекущаяДатаСеанса();
	ПараметрыЧека.Касса                   = Объект.Касса;
	ПараметрыЧека.Количество              = 1;		
	ПараметрыЧека.СуммаОплачено           = Объект.СуммаДокумента;
	ПараметрыЧека.ВидНалога               = ВидНалога; 	
	ПараметрыЧека.ВыводитьЧекНаБумагу     = ПечататьЧек;
	ПараметрыЧека.ЭлектроннаяПочтаКлиента = ПочтаКлиента;
	ПараметрыЧека.НомерТелефонаКлиента    = ТелефонКлиента;
	
	ПараметрыЧека.МассивПараметровТовары  = ПолучитьМассивТоваровФискальногоЧекаОплатыВозвратаДляККТ();	
	ПараметрыЧека.МассивПараметровОплаты  = ПолучитьМассивОплатФискальногоЧекаВозвратаПродажи();	
	
	СуммаКОплатеПоТаблицеТоваров = 0;
	Для Каждого ЭлементМ Из ПараметрыЧека.МассивПараметровТовары Цикл
		СуммаКОплатеПоТаблицеТоваров = СуммаКОплатеПоТаблицеТоваров + ЭлементМ.СтоимостьСоСкидкой;
	КонецЦикла;
	
	ПараметрыЧека.СуммаКОплате = СуммаКОплатеПоТаблицеТоваров;  
	
	ПараметрыЧека.МассивДокументовОснований = МассивДокументовОплаты;
	
	ФормированиеЧека = МенеджерОборудованияВызовСервера.ПодготовитьДанныеДляПробитияФискальногоЧекаККТ(ПараметрыЧека);	

	Возврат ФормированиеЧека;

КонецФункции

&НаСервере
// Функция - подготавливает параметры чека ФР.
//
Функция ПодготовитьПараметрыЧекаДляФР(ПочтаКлиента, ТелефонКлиента, ПечататьЧек)
		
	МассивДокументовОплаты = Новый Массив;
	МассивДокументовОплаты.Добавить(Объект.Ссылка);
	Для Каждого СтрокаТЧ Из Объект.РасшифровкаПлатежа Цикл
		Если СтрокаТЧ.Сумма <> 0 И ЗначениеЗаполнено(СтрокаТЧ.ДокументОснования) Тогда
			МассивДокументовОплаты.Добавить(СтрокаТЧ.ДокументОснования);
		КонецЕсли;
	КонецЦикла;

	ПараметрыЧека = МенеджерОборудованияВызовСервера.ПустаяСтруктураПараметровЧека();
	
	ПараметрыЧека.ВидОперации             = Перечисления.ВидыОпераций.Продажа;
	ПараметрыЧека.СтруктурнаяЕдиница      = Объект.СтруктурнаяЕдиница;
	ПараметрыЧека.Организация             = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.СтруктурнаяЕдиница, "Организация");
	ПараметрыЧека.Сотрудник               = Объект.Сотрудник;
	ПараметрыЧека.Клиент                  = Объект.Контрагент;
	ПараметрыЧека.Дата                    = ТекущаяДатаСеанса();
	ПараметрыЧека.Касса                   = Объект.Касса;
	ПараметрыЧека.Количество              = 1;		
	ПараметрыЧека.СуммаОплачено           = Объект.СуммаДокумента;
	ПараметрыЧека.СтоимостьБезСкидки      = Объект.СуммаДокумента;		
	ПараметрыЧека.ТипЧека                 = 0;
	
	// ККТ-ые пар-ы
	ПараметрыЧека.ВидНалога               = ВидНалога; 	
	ПараметрыЧека.ВыводитьЧекНаБумагу     = ПечататьЧек;
	ПараметрыЧека.ЭлектроннаяПочтаКлиента = ПочтаКлиента;
	ПараметрыЧека.НомерТелефонаКлиента    = ТелефонКлиента;
	
	ПараметрыЧека.СуммаКОплате 			  = Объект.СуммаДокумента;  
	
	ПараметрыЧека.МассивДокументовОснований = МассивДокументовОплаты;
	
	ФормированиеЧека = МенеджерОборудованияВызовСервера.ПодготовитьДанныеДляПробитияФискальногоЧекаККТ(ПараметрыЧека);	

	Возврат ФормированиеЧека;

КонецФункции

&НаСервере
// Функция возвращает массив товаров для ККТ.
//
Функция ПолучитьМассивТоваровФискальногоЧекаОплатыВозвратаДляККТ() 
	
	МассивТоваров = Новый Массив;

	Для Каждого СтрокаТЧ из Объект.РасшифровкаПлатежа Цикл
		Если СтрокаТЧ.ЭтоАванс
			ИЛИ СтрокаТЧ.Статья = Справочники.СтатьиДоходовИРасходов.ВозвратАвансаКлиенту
			ИЛИ СтрокаТЧ.Статья = Справочники.СтатьиДоходовИРасходов.ВозвратСЛицевогоСчета 
			ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратСЛицевогоСчета Тогда
			
			МассивТоваров.Добавить(СформироватьПозициюАвансаЧека(СтрокаТЧ.Статья, СтрокаТЧ.Сумма));
		Иначе			
			МассивТоваровДокумента = ПолучитьМассивПараметровТовары(СтрокаТЧ.ДокументОснования, СтрокаТЧ.Сумма);
			ОбщегоНазначенияСтоматология.ДобавитьВМассив(МассивТоваров, МассивТоваровДокумента);																			
		КонецЕсли;		
	КонецЦикла; 
	
	Возврат МассивТоваров;
	
КонецФункции

&НаСервере
// Функция - Получить массив оплат на печать
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивОплатФискальногоЧекаВозвратаПродажи()
	
	МассивОплат = Новый Массив;		
	
	ПараметрыТипаОплаты = МенеджерОборудованияВызовСервера.ПустаяСтруктураСтрокиПлатежаЧека();
	ПараметрыТипаОплаты.ТипОплаты = Объект.ТипДенежныхСредств;
	ПараметрыТипаОплаты.Сумма     = Объект.СуммаДокумента;
	
	МассивОплат.Добавить(ПараметрыТипаОплаты);	
	
	Возврат МассивОплат;
	
КонецФункции

&НаСервере
// Функция, возвращает сформированную строку чека.
//
Функция СформироватьПозициюАвансаЧека(Статья, Сумма)
	
	НомерСекции = 2;  	
	СтавкаНДС    = ОбщегоНазначенияСтоматология.ПолучитьСтавкуНДСАванс(Объект.СтруктурнаяЕдиница);
	Наименование = ?(Статья = Справочники.СтатьиДоходовИРасходов.ВзносНалицевойСчет,
						НСтр("ru = 'Списание с лицевого счета:'"), НСтр("ru = 'Списание аванса:'"));
								
	ПозицияЧека = МенеджерОборудованияВызовСервера.ПустаяСтруктураСтрокиТоваровЧека();
	
	ПозицияЧека.Наименование		= Наименование + " " + Объект.Контрагент;
	ПозицияЧека.Количество			= 1; 
	ПозицияЧека.СтоимостьБезСкидки  = Сумма;
	ПозицияЧека.СуммаСкидки         = 0;
	ПозицияЧека.СтоимостьСоСкидкой	= Сумма;	
	ПозицияЧека.СуммаНДС     		= Ценообразование.РассчитатьСуммуНДС(Сумма, СтавкаНДС);
	ПозицияЧека.СтавкаНДС 			= МенеджерОборудованияВызовСервера.ПолучитьСтавкуНДСККТ(СтавкаНДС);
	ПозицияЧека.НомерСекции 		= НомерСекции;
	ПозицияЧека.Штрихкод 			= null; 
	ПозицияЧека.СуммаОплачено       = ?(ПозицияЧека.СтоимостьСоСкидкой > Сумма, Сумма, ПозицияЧека.СтоимостьСоСкидкой);
	ПозицияЧека.ЭтоОплатаКредита    = Ложь;

	Возврат ПозицияЧека;	
	
КонецФункции

&НаСервере
// Функция - возвращает массив параметров товаров.
//
Функция ПолучитьМассивПараметровТовары(ДокументОснования, Сумма)
	
	ОплаченоПоДокументу = 0;
	Если ЗначениеЗаполнено(ДокументОснования) Тогда
		Если ТипЗнч(ДокументОснования) = Тип("ДокументСсылка.НарядЗаказ") Тогда
			ОплаченоПоДокументу = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ДокументОснования, "СуммаОплаченоПродажи") - Сумма;
		ИначеЕсли ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("СуммаОплачено", ДокументОснования.Метаданные()) = Истина Тогда 
			ОплаченоПоДокументу = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ДокументОснования, "СуммаОплачено") - Сумма;
		КонецЕсли;
	КонецЕсли;

	МассивТоваровДокумента = Обработки.ПомощникПроведенияОплаты.ПолучитьМассивПараметровТоваровККТ(
																	ДокументОснования,
																	ОплаченоПоДокументу,
																	Сумма,
																	Объект.Касса);
																	
	Возврат МассивТоваровДокумента;
	
КонецФункции

#КонецОбласти


&НаСервереБезКонтекста  
// Функция, Получить данные даты при изменении.
//
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	РазностьДат = ДвиженияДокументовСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением);
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", РазностьДат);
			
	Возврат СтруктураДанные;
	
КонецФункции 

&НаСервере
Процедура НастройкаШириныЭлементовФормы()
		
	Элементы.КоманднаяПанельЗаглушкаВыравнивание.МаксимальнаяШирина = ?(Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыСтраховойКомпании, 83, 79);
	Элементы.Статья.МаксимальнаяШирина = ?(Элементы.ВТаблице.Видимость, 35, 46);
	Элементы.ВыплатаЗПМесяцПредставление.МаксимальнаяШирина = ?(Элементы.ВыплатаЗПАванс.Видимость, 37, 46);
	
КонецПроцедуры

&НаКлиенте
// Процедура После вопроса завврешение.
//
Процедура ПослеВопросаЗавершение(Результат, Параметры) Экспорт	
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ПроверитьЗаполнение() = Истина Тогда		
			ЭтаФорма.Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));			
		КонецЕсли; 		
		
	Иначе
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()
	Возврат Документы.СписаниеДенежныхСредств.ПолучитьСписокПечатныхФорм();	
КонецФункции

&НаСервереБезКонтекста
// Функция проверяет использует ли касса ККТ.
//
Функция КассаИспользуетсяККТ(Касса)
	
	Возврат Справочники.Кассы.КассаИспользуетсяККТ(Касса);
		
КонецФункции

&НаСервере
// Получает ссылки на внешнее оборудование.
//
Функция ПолучитьСсылкиНаОборудованиеФР()
	
	Возврат ?(ЗначениеЗаполнено(Объект.Касса)
	И ЗначениеЗаполнено(Объект.Касса.ВнешнееОборудование),
	Объект.Касса.ВнешнееОборудование.Ссылка,
	Справочники.ПодключаемоеОборудование.ПустаяСсылка());
	
КонецФункции

&НаСервере
// Процедура - устанавливает видимость реквизитов в зависимости от хозяйственной операции.
//
Процедура УстановитьВидимость()
	
	ЭтаФорма.ТолькоПросмотр = ЗначениеЗаполнено(Объект.НомерЧекаККМ); 
	Элементы.ГруппаБлокировкаДокумента.Видимость =  ЗначениеЗаполнено(Объект.НомерЧекаККМ);
	
	// Если выбран режим заполнения выплаты ЗП по документу начисления
	// сбросить флаг выплаты аванса
	Если Объект.ВыплатаЗПРежимФормирования = 1 Тогда
		Объект.ВыплатаЗПАванс = Ложь;
	Иначе
		ВыплатаЗПМесяцПредставление = Формат(Объект.ВыплатаЗПМесяц,"ДФ='MMММ yyyy'");
	КонецЕсли;
	
    // Установка первой части заголовка документа в зависимости от вида операции 	
	Если Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыКлиенту Тогда
		 ЭтаФорма.Заголовок = "Возврат оплаты клиенту";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ОплатаПоставщику Тогда
		 ЭтаФорма.Заголовок = "Оплата поставщику";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.СдачаНаличныхВБанк Тогда
		 ЭтаФорма.Заголовок = "Сдача наличных в банк";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ВыбытиеВКассу Тогда
		 ЭтаФорма.Заголовок = "Выбытие в кассу";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ВыплатаЗаработнойПлаты Тогда
		 ЭтаФорма.Заголовок = "Выплата заработной платы"+?(Объект.ВыплатаЗПАванс,"(аванс)","");
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратСЛицевогоСчета Тогда
		 ЭтаФорма.Заголовок = "Возврат с лицевого счета";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ВыдачаПодотчетнику Тогда
		 ЭтаФорма.Заголовок = "Выдача подотчетнику";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыСтраховойКомпании Тогда
		 ЭтаФорма.Заголовок = "Возврат оплаты страховой компании";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ВыдачаЗайма Тогда
		 ЭтаФорма.Заголовок = "Выдача, возврат займа";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ОплатаНалога Тогда
		 ЭтаФорма.Заголовок = "Оплата налога";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ВыплатаДивидендовУчредителю Тогда
		 ЭтаФорма.Заголовок = "Выплата дивидендов учредителю";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ПрочееСписание Тогда
		 ЭтаФорма.Заголовок = "Прочее списание";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОшибочнойОплатыКлиенту Тогда
		 ЭтаФорма.Заголовок = "Возврат ошибочной оплаты клиенту";
	КонецЕсли;
	
	// Изменение состава списка выбора операции
	Элементы.ВидОперации.СписокВыбора.Очистить();
	Если Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда		
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВозвратОплатыКлиенту);  
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВозвратОшибочнойОплатыКлиенту);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВозвратСЛицевогоСчета);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ОплатаПоставщику);
        Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.СдачаНаличныхВБанк);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВыдачаПодотчетнику);
        Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВыплатаЗаработнойПлаты);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВозвратОплатыСтраховойКомпании);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВыдачаЗайма);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВыплатаДивидендовУчредителю);
        Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ПрочееСписание);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВыбытиеВОперационнуюКассу);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.СдачаРозничнойВыручкиВКассуПредприятия);
		// Элементы.Печать_КО2.Доступность = Истина;
		ЭтотОбъект.ДоступностьКнопкиПечатьРКО = Ложь;
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " наличными средствами";	
	ИначеЕсли Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные Тогда		
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВозвратОплатыКлиенту);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВозвратОшибочнойОплатыКлиенту);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВозвратСЛицевогоСчета);
        Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ОплатаПоставщику);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВыплатаЗаработнойПлаты);
        Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВозвратОплатыСтраховойКомпании);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВыдачаЗайма);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВыдачаПодотчетнику);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ОплатаНалога);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВыплатаДивидендовУчредителю);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВыбытиеВКассу);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ПрочееСписание);
		// Элементы.Печать_КО2.Доступность = Ложь;
		ЭтотОбъект.ДоступностьКнопкиПечатьРКО = Истина;
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " безналичными средствами";
	ИначеЕсли Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта Тогда		
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВозвратОплатыКлиенту);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВозвратОшибочнойОплатыКлиенту);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ВозвратСЛицевогоСчета);
		// Элементы.Печать_КО2.Доступность = Ложь;
		ЭтотОбъект.ДоступностьКнопкиПечатьРКО = Истина;
		ЭтаФорма.Заголовок              = ЭтаФорма.Заголовок + " платежной картой";		
     ИначеЕсли Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ЛицевойСчет Тогда		
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ОплатаОтКлиента);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ПрочееСписание);
		// Элементы.Печать_КО2.Доступность = Ложь;
		ЭтотОбъект.ДоступностьКнопкиПечатьРКО = Истина;
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " с лицевого счета";		
      ИначеЕсли Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат Тогда		
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОпераций.ОплатаОтКлиента);
		// Элементы.Печать_КО2.Доступность = Ложь;
		ЭтотОбъект.ДоступностьКнопкиПечатьРКО = Истина;
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " подарочным сертификатом";
	КонецЕсли;	
	
	Если Элементы.ВидОперации.СписокВыбора.НайтиПоЗначению(Объект.ВидОперации) = Неопределено Тогда	
		Объект.ВидОперации = Неопределено;
		ЭтаФорма.Заголовок = "Списание денежных средств";
	КонецЕсли;	
	Если Объект.Ссылка.Пустая() Тогда
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " (создание)";
    КонецЕсли;
	Если ЗначениеЗаполнено(Объект.КассоваяСмена) Тогда
		Элементы.КассоваяСменаТекущая.Видимость = Истина;
		мНомер = ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Объект.КассоваяСмена.Номер, "");		
		КассоваяСменаТекущая    		= "Кассовая смена № " + ?(Найти(мНомер, "-") > 0, мНомер, "00"+мНомер) + " от " + Формат(Объект.КассоваяСмена.Дата,"ДФ=dd.MM.yyyy");
	Иначе
		Элементы.КассоваяСменаТекущая.Видимость = Ложь;
	КонецЕсли;
	
	// Установим видимость закладки Затраты. Она должна быть видна только при прочем списании или если есть хоть одна строка(Для старых документов)
	Если Объект.Затраты.Количество() > 0 Тогда
		Элементы.ГруппаЗатраты.Видимость = Истина;
	КонецЕсли;
	
	Элементы.Очистить_Чек.Доступность 			 = РольДоступна("ПолныеПрава") И Объект.НомерЧекаККМ = 99999999;
	Элементы.Очистить_Чек.Видимость				 = ЭтаФорма.ТолькоПросмотр;
	
	// Установка состояния элементов формы
	УправлениеИнтерфейсамиСервер.УстановкаСостоянийЭлементовФормы(ЭтаФорма,Объект);
    // Установка банковского счета контрагента по умолчанию(при указанных условиях)
	Если Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные
		И НЕ Объект.ВидОперации     = Перечисления.ВидыОпераций.ВозвратСЛицевогоСчета
		И НЕ Объект.ВидОперации     = Перечисления.ВидыОпераций.ВыплатаЗаработнойПлаты
		И НЕ Объект.ВидОперации     = Перечисления.ВидыОпераций.ВыдачаПодотчетнику
		И НЕ ЗначениеЗаполнено(Объект.БанковскийСчетКонтрагента) 
		И ЗначениеЗаполнено(Объект.Контрагент) Тогда	
		Объект.БанковскийСчетКонтрагента = Объект.Контрагент.БанковскийСчетПоУмолчанию;
	ИначеЕсли  (Объект.ВидОперации  = Перечисления.ВидыОпераций.СдачаНаличныхВБанк ИЛИ Объект.ВидОперации  = Перечисления.ВидыОпераций.ВыбытиеВКассу)
		И НЕ ЗначениеЗаполнено(Объект.БанковскийСчетКонтрагента) Тогда
		Объект.БанковскийСчетКонтрагента = Объект.СтруктурнаяЕдиница.Организация.БанковскийСчетПоУмолчанию;
	КонецЕсли;   
	Если Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные
		И НЕ ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда	
		Объект.БанковскийСчет = Объект.СтруктурнаяЕдиница.Организация.БанковскийСчетПоУмолчанию;
	КонецЕсли; 
	// Устанвоить доступность печати чека
	УстановитьДоступностьПечатиЧека();
	
	Элементы.РасшифровкаПлатежаСтатья.Видимость = Объект.СтатьяВТаблице;
	ОбновитьИнформациюПоОстаткамЛСиЗадолженностям();
	Если ЗначениеЗаполнено(Объект.НомерЧекаККМ) Тогда
		Элементы.СтруктурнаяЕдиница.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Элементы.ГруппаЛеваяЧасть.Видимость = ВидимостьГруппаОстатокНаЛС(объект.ВидОперации);
	Элементы.Декорация3.Видимость 		= Элементы.ГруппаЛеваяЧасть.Видимость;
	
	ОбновитьОтображениеРасшифровки(); 
	
	Если ВыполнятьОперациюНаЭТ(Объект.ТипДенежныхСредств, Объект.ВидОперации, Объект.Касса, Объект.ЭквайрингТерминал) = Истина Тогда
		Элементы.НапечататьЧек.Заголовок = Нстр("ru = 'Пробить на ФР и ЭТ'; en = 'Punch on FR and AT'");
	Иначе
		Элементы.НапечататьЧек.Заголовок = Нстр("ru = 'Пробить на ФР'; en = 'Punch on FR'");
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ВидимостькомандыПечатьКМ3()
	
	ДоступностьКнопкиПечатьКМЗ = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОплатыКлиенту")); 
	
	// Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОплатыКлиенту") Тогда
	//	Элементы.Печать_КМ3.Видимость = Истина;
	// Иначе
	//	Элементы.Печать_КМ3.Видимость = Ложь;
	// КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - устанавливает доступность кнопки "НапечататьЧек".
//
Процедура УстановитьДоступностьПечатиЧека()
	
	Разрешено = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.НомерЧекаККМ) Тогда		
		Если Объект.ВидОперации  = Перечисления.ВидыОпераций.ОплатаОтКлиента 
			ИЛИ Объект.ВидОперации  = Перечисления.ВидыОпераций.ВозвратСЛицевогоСчета
			ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОшибочнойОплатыКлиенту
			ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.СдачаРозничнойВыручкиВКассуПредприятия Тогда
			Разрешено = Истина;
		ИначеЕсли Объект.ВидОперации  = Перечисления.ВидыОпераций.ВозвратОплатыКлиенту
			ИЛИ (Объект.ВидОперации    = Перечисления.ВидыОпераций.ВозвратОплатыСтраховойКомпании
			  И Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные) Тогда
			
			Разрешено = Ложь;
			Для Каждого СтрокаТЧ ИЗ Объект.РасшифровкаПлатежа Цикл			
				Если ЗначениеЗаполнено(СтрокаТЧ.ДокументОснования) И НЕ НачалоДня(СтрокаТЧ.ДокументОснования.Дата) = НачалоДня(Объект.Дата) Тогда
					Разрешено = Ложь;
					Прервать;
				Иначе
					Разрешено = Истина;
				КонецЕсли;	
			КонецЦикла;
		Иначе
			Разрешено = Ложь;
		КонецЕсли;     
	КонецЕсли;
	Элементы.НапечататьЧек.Доступность = (Разрешено И Не Объект.Касса.ИспользоватьБезПодключенияОборудования);
		
КонецПроцедуры 

&НаКлиенте
//
//
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВзносУчредителя")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратНалога") Тогда
		
		СтруктураПараметры = Новый Структура;
				
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора",СтруктураПараметры,,,,, Новый ОписаниеОповещения("КонтрагентНачалоВыбораЗавершение", ЭтотОбъект));
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОплатыОтПоставщика")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратЗайма") 
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаПоставщику") Тогда
		
		СтруктураПараметры = Новый Структура;
		Массив = Новый Массив;
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Поставщик"));
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиенты"));
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.КорпоративныеКонтрагенты"));
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Лаборатория"));
		
		СтруктураПараметры = Новый Структура("Отбор", Новый Структура("ТипКонтрагента", Новый ФиксированныйМассив(Массив)));	
		
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора", СтруктураПараметры,,,,, Новый ОписаниеОповещения("КонтрагентНачалоВыбораЗавершение", ЭтотОбъект));
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОтПодотчетника")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВыдачаПодотчетнику") Тогда
		
		ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", Новый Структура("БезОтбораПоРолям", Истина),,,,, Новый ОписаниеОповещения("КонтрагентНачалоВыбораЗавершение", ЭтотОбъект));
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОплатыСтраховойКомпании") Тогда
		
		Массив = Новый Массив;
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.СтраховаяКомпания"));   
		СтруктураПараметры = Новый Структура("Отбор", Новый Структура("ТипКонтрагента", Новый ФиксированныйМассив(Массив)));	
		
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора",СтруктураПараметры,,,,, Новый ОписаниеОповещения("КонтрагентНачалоВыбораЗавершение", ЭтотОбъект));

	Иначе	
		
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораКлиенты",,,,,, Новый ОписаниеОповещения("КонтрагентНачалоВыбораЗавершение", ЭтотОбъект));
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.Контрагент = Результат;
		КонтрагентПриИзмененииСервер();
		ТекущийКонтрагент = Результат;		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
//
//
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииСервер();
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		ПроверитьТекущиеНапоминанияПоПосещениямСтоматология(Объект.Контрагент);
	КонецЕсли;
	ОткорректироватьСуммуЗатрат();
	
КонецПроцедуры

&НаСервере
// При изменении контрагента, сервер
//
Процедура КонтрагентПриИзмененииСервер()
	
	Если ТекущийКонтрагент <> Объект.Контрагент Тогда
		Объект.БанковскийСчетКонтрагента    = Неопределено;
		// Объект.ЛицевойСчетКонтрагента       = Неопределено;
		Объект.ЭквайрингВидПлатежнойКарты   = Неопределено;
		Объект.ЭквайрингНомерПлатежнойКарты = Неопределено;
		Объект.Сертификат                   = Неопределено;
		Объект.СертификатСерийныйНомер      = Неопределено;
		// Объект.СуммаДокумента               = 0;
		// Объект.РасшифровкаПлатежа.Очистить();
		// Установка банковского счета контрагента по умолчанию(при указанных условиях)
		Если Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные
		   И НЕ Объект.ВидОперации     = Перечисления.ВидыОпераций.ВозвратСЛицевогоСчета
		   И НЕ Объект.ВидОперации     = Перечисления.ВидыОпераций.ВыплатаЗаработнойПлаты 
		   И НЕ Объект.ВидОперации     = Перечисления.ВидыОпераций.ВыдачаПодотчетнику
		   И ЗначениеЗаполнено(Объект.Контрагент) Тогда	
			Объект.БанковскийСчетКонтрагента = Объект.Контрагент.БанковскийСчетПоУмолчанию;
		КонецЕсли;  
		ОбновитьИнформациюПоОстаткамЛСиЗадолженностям();
		Элементы.Договор.Видимость = ЗначениеЗаполнено(Объект.Контрагент) 
			И ?(ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Контрагенты") 
			И Объект.Контрагент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты, Ложь, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора"
//
Процедура КонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение = "СоздатьНовогоКлиента" Тогда
		ДобавитьИВыбратьКонтрагента(Неопределено);
		ВыбранноеЗначение = Объект.Контрагент;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "АвтоПодбор"
//
Процедура КонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ДанныеВыбора = ОбщегоНазначенияСтоматология.НайтиКонтрагентовПоСтроке(Текст, 10, Истина, Истина,,,,ПолучитьТипыКонтрагентовПоВидуОперации(Объект.ВидОперации, Объект.ТипДенежныхСредств));
	ИскомыйКлиент        = Текст;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОкончаниеВводаТекста"
//
Процедура КонтрагентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ДанныеВыбора = ОбщегоНазначенияСтоматология.НайтиКонтрагентовПоСтроке(Текст, , Истина, Истина,,,,ПолучитьТипыКонтрагентовПоВидуОперации(Объект.ВидОперации, Объект.ТипДенежныхСредств));
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Контрагент это клиент
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьТипыКонтрагентовПоВидуОперации(ВидОперации, ТипДенежныхСредств)
	
	Массив = Новый Массив;
	
	Если ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыОтПоставщика 
		Или ВидОперации = Перечисления.ВидыОпераций.ОплатаПоставщику Тогда
		
		 Массив.Добавить(Перечисления.ТипыКонтрагентов.Поставщик);
		 
	ИначеЕсли ВидОперации = Перечисления.ВидыОпераций.ВозвратЗайма Тогда
		
    	 Массив.Добавить(Перечисления.ТипыКонтрагентов.Поставщик);
		 Массив.Добавить(Перечисления.ТипыКонтрагентов.Клиенты);
		 Массив.Добавить(Перечисления.ТипыКонтрагентов.КорпоративныеКонтрагенты);

	Иначе
		
		Массив.Добавить(Перечисления.ТипыКонтрагентов.Клиенты);
		
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик команды ДобавитьИВыбратьКонтрагента
//
Процедура ДобавитьИВыбратьКонтрагента(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ГруппаКлиентов    = ВернутьГруппуКлиентов();  
	ПараметрыОткрытия.Вставить("Родитель", ГруппаКлиентов);
	ПараметрыОткрытия.Вставить("ТекстЗаполнения", ИскомыйКлиент);  
	ПараметрыЗаполнения = Новый Структура("Основание", ПараметрыОткрытия);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьИВыбратьКонтрагентаЗавершение", ЭтаФорма);
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаЭлементаКлиенты", ПараметрыЗаполнения,,,,,ОписаниеОповещения);
	
КонецПроцедуры 

&НаКлиенте
// Процедура - Добавить и выбрать контрагента завершение
// 
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
// 
Процедура ДобавитьИВыбратьКонтрагентаЗавершение(Результат, Параметры) Экспорт
	
	Если Не Результат.Пустая() Тогда
		Объект.Контрагент = Результат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция возвращает группу клиентов
//
Функция ВернутьГруппуКлиентов()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиПользователей.Значение
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Пользователь = &Пользователь
	|	И НастройкиПользователей.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И НастройкиПользователей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяГруппаКонтрагентов)");
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	Иначе 
		Возврат Справочники.Контрагенты.ПолучитьПапкуПоТипу(Перечисления.ТипыКонтрагентов.Клиенты);
	КонецЕсли;
	
КонецФункции

&НаСервере
// Обновить информацию остатка лицевого счета клиента и задолженности 
//
Процедура ОбновитьИнформациюПоОстаткамЛСиЗадолженностям()
	Долг 					= РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ПолучитьОстатокПоВзаиморасчетамСконтрагентом(Объект.Контрагент,, Объект.СтруктурнаяЕдиница);	
	ОстатокЛицевогоСчета    = 0;
	Если РежимРаботыЕдинаяСеть Тогда	
		ОстатокЛицевогоСчета 	= РегистрыНакопления.ДенежныеСредстваНаЛицевыхСчетах.ПолучитьОстаткиНаЛицевыхСчетахКонтрагента(Объект.Контрагент,ТекущаяДата(),,,,Истина);	
	Иначе
		ОстатокЛицевогоСчета 	= РегистрыНакопления.ДенежныеСредстваНаЛицевыхСчетах.ПолучитьОстаткиНаЛицевыхСчетахКонтрагента(Объект.Контрагент,ТекущаяДата(),,Объект.СтруктурнаяЕдиница,,Истина);	
	КонецЕсли;
	// Декорация задолженности контрагента
	Элементы.ДекорацияЗадолженностьСумма.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
	Если Долг > 0 Тогда
		Элементы.ДекорацияЗадолженностьСумма.Заголовок  = "Долг пациента:";
		Элементы.ДекорацияДолг.Заголовок                = Формат(Долг, "ЧЦ=15; ЧДЦ=2; ЧН=") + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
		Элементы.ДекорацияЗадолженностьСумма.ЦветТекста = WebЦвета.Красный;
		Элементы.ДекорацияДолг.ЦветТекста               = WebЦвета.Красный;		
	ИначеЕсли Долг < 0 Тогда
		Элементы.ДекорацияЗадолженностьСумма.Заголовок  = "Наш долг перед пациентом:";
		Элементы.ДекорацияДолг.Заголовок                = Формат(-Долг, "ЧЦ=15; ЧДЦ=2; ЧН=") + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
		Элементы.ДекорацияЗадолженностьСумма.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
		Элементы.ДекорацияДолг.ЦветТекста               = ЦветаСтиля.ПоясняющийТекст;
	Иначе
		Элементы.ДекорацияЗадолженностьСумма.Заголовок  = "Нет задолженности.";
		Элементы.ДекорацияДолг.Заголовок                = "";
		Элементы.ДекорацияЗадолженностьСумма.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
		Элементы.ДекорацияДолг.ЦветТекста               = ЦветаСтиля.ПоясняющийТекст;				
	КонецЕсли;
	// Декорация остатка лицевого счета
	Элементы.ДекорацияОстаткиНаЛицевыхсчетах.Заголовок = "Лицевой счет:";
	Элементы.ДекорацияОстатокЛицевогоСчета.Заголовок = Формат(ОстатокЛицевогоСчета, "ЧЦ=15; ЧДЦ=2; ЧН=") + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
	Если ОстатокЛицевогоСчета < 0 Тогда
		Элементы.ДекорацияОстаткиНаЛицевыхсчетах.ЦветТекста = WebЦвета.Красный;
		Элементы.ДекорацияОстатокЛицевогоСчета.ЦветТекста = WebЦвета.Красный;
	Иначе
		Элементы.ДекорацияОстаткиНаЛицевыхсчетах.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
		Элементы.ДекорацияОстатокЛицевогоСчета.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
	КонецЕсли; 			
КонецПроцедуры

&НаКлиенте
// Обработчик запуска формы расшифровки задолженности контрагента
//
Процедура КомандаРасшифровкаЗадолженности(Команда)
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПараметрыФормы = Новый Структура("Контрагент",Объект.Контрагент);
		ОткрытьФорму("Отчет.ВзаиморасчетыПодробно.Форма.ФормаОтчета", ПараметрыФормы);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Обработчик запуска формы расшифровки лицевых счетов контрагента
//
Процедура КомандаРасшифровкаОстатковНаЛС(Команда)
	// Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
	//	ПараметрыФормы = Новый Структура("Контрагент",Объект.Контрагент);
	//	ОткрытьФорму("Отчет.ПерейтиЛицевыеСчета.Форма.ФормаОтчетаЛицевыеСчета",ПараметрыФормы);
	// КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
		ОтборРасшифровки = Новый Соответствие;
		ОтборРасшифровки.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыОткрытия.Вставить("ОтборРасшифровки", ОтборРасшифровки);
		Вариант =  СсылкаВариантаОтчета("ПерейтиЛицевыеСчета", "Основной");
		ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтаФорма, Вариант, ПараметрыОткрытия);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "Статья".
//
Процедура СтатьяПриИзменении(Элемент)	
	// Корректировка статьи в ТЧ Расшифровка платежа
	Для Каждого СтрокаТЧ Из Объект.РасшифровкаПлатежа Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Статья) ИЛИ Объект.СтатьяВТаблице = Ложь Тогда 
			СтрокаТЧ.Статья = Объект.Статья;
		КонецЕсли;
	КонецЦикла;		
	// Корректировка статьи в ТЧ Затраты
	Если ЗначениеЗаполнено(Объект.Статья) Тогда
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПрочееСписание") Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("СтатьяПриИзмененииЗавершение", ЭтотОбъект), "Перезаполнять заполненные статьи затрат в табличной части ?",РежимДиалогаВопрос.ДаНет);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Процедура - Статья при изменении завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура СтатьяПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПерезаполнениеРазрешено = РезультатВопроса = КодВозвратаДиалога.Да;
	Для Каждого СтрокаТ ИЗ Объект.Затраты Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТ.СтатьяЗатрат) ИЛИ ПерезаполнениеРазрешено Тогда
			СтрокаТ.СтатьяЗатрат = Объект.Статья;
		КонецЕсли;	 
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриНачалеРедактирования"
//
Процедура ЗатратыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда		
		Если ЗначениеЗаполнено(Объект.Статья) Тогда
			Элемент.ТекущиеДанные.СтатьяЗатрат = Объект.Статья;
		КонецЕсли;
		
		Если Элемент.ТекущиеДанные.НомерСтроки = 1 Тогда	
			Элемент.ТекущиеДанные.Сумма = Объект.СуммаДокумента;
		КонецЕсли;
		
		Если Копирование Тогда 
			Элемент.ТекущиеДанные.Сумма = 0;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// При окончании редактирования суммы
//
Процедура ЗатратыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если Элемент.ТекущийЭлемент = Элементы.ЗатратыСумма Тогда	
		Объект.СуммаДокумента = Объект.Затраты.Итог("Сумма");
		Если Объект.РасшифровкаПлатежа.Количество() > 0 Тогда
			Объект.РасшифровкаПлатежа[0].Сумма = Объект.СуммаДокумента;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Перед удаление строки затрат  
//
Процедура ЗатратыПередУдалением(Элемент, Отказ)
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПрочееСписание") И  Объект.Затраты.Количество() = 1 Тогда
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
// При изменении сотрудника
Процедура ЗатратыСотрудникПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Затраты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Специализация = ПолучитьОсновнуюСпециализациюСотрудника(ТекущиеДанные.Сотрудник);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
// Процедура производит обновление суммы затрат в ТЧ
//
Процедура ОткорректироватьСуммуЗатрат()	
	Если Объект.Затраты.Количество() = 1 Тогда 
		Объект.Затраты[0].Сумма = Объект.СуммаДокумента;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
// Функция вернет сумму документов в основании платежа  
//
Функция ПолучитьСуммуДокументовОснования()
	СуммаДокументов = 0;
	Для Каждого СтрокаТ ИЗ Объект.РасшифровкаПлатежа Цикл
		Если ЗначениеЗаполнено(СтрокаТ.ДокументОснования) Тогда
			СуммаДокументов = СуммаДокументов + СтрокаТ.ДокументОснования.СуммаДокумента;
		ИначеЕсли ЗначениеЗаполнено(СтрокаТ.ДокументАванса) Тогда
			СуммаДокументов = СуммаДокументов + СтрокаТ.ДокументАванса.СуммаДокумента;
		КонецЕсли;   
	КонецЦикла;
	Возврат СуммаДокументов;
КонецФункции

&НаСервереБезконтекста
// Функция вернет предопределенную статью для данного вида операции  
//
Функция ПолучитьПредопределеннуюСтатьюДляОперации(ВидОперации,ЭтоАванс)
	Возврат Справочники.СтатьиДоходовИРасходов.ПолучитьСтатьюПоУмолчаниюДляОперации(ВидОперации,ЭтоАванс);	
КонецФункции

&НаСервереБезКонтекста
// Получить основную специализацию сотрудника   
//
Функция ПолучитьОсновнуюСпециализациюСотрудника(Сотрудник)
	 Возврат Справочники.Сотрудники.ПолучитьОсновнуюСпециализациюСотрудника(Сотрудник);	
КонецФункции

&НаСервереБезКонтекста
// Функция возвращает сумму сертификата с указанной серией.
//
Функция ПолучитьСуммуСертификата(СерийныйНомерСертификата)

	Возврат Справочники.ПартииНоменклатуры.ПолучитьСуммуСертификата(СерийныйНомерСертификата);	

КонецФункции 

&НаСервереБезконтекста
// Функция, возвращает признак ККТ
//
Функция ОпределитьТипОборудования(Касса)
	
	Возврат Касса.ВнешнееОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;	
	
КонецФункции

&НаКлиенте
// Процедура, обработчик события "ОкончаниеВводаТекста".
//
Процедура ЗатратыСуммаОкончаниеВводаТекста(Элемент)
		
	Индекс = ПолучитьИндексСтроки(Элемент.Имя);
	Объект.Затраты[Индекс].Сумма = Число(Элемент.ТекстРедактирования);
	
	Объект.СуммаДокумента = Объект.Затраты.Итог("Сумма");
	
	Если Объект.РасшифровкаПлатежа.Количество() > 0 Тогда
		Объект.РасшифровкаПлатежа[0].Сумма = Объект.СуммаДокумента;
	КонецЕсли;
	
	Если Объект.Затраты.Количество() = 1 Тогда
		Объект.Затраты[0].Сумма = Объект.СуммаДокумента;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура СтруктурнаяЕдиницаПриИзменении(Элемент)
	
	ОбновитьИнформациюПоОстаткамЛСиЗадолженностям();
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "АвтоПодбор"
//
Процедура СтруктурнаяЕдиницаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьДоступныеСтруктурныеЕдиницы(Текст);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция возвращает доступные структурные единицы
//
Функция ПолучитьДоступныеСтруктурныеЕдиницы(СтрокаПоиска)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	СтруктурныеЕдиницы.Ссылка В(&МассивСсылок)
	|	И &УсловиеСтрокаПоиска");
	
	Запрос.УстановитьПараметр("МассивСсылок", ОбщегоНазначенияСтоматология.ДоступныеСтруктурныеЕдиницы());
	Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СтрокаПоиска + "%");
	
	УсловиеСтрокаПоиска = ?(СтрДлина(СтрокаПоиска) >= 2, "И СтруктурныеЕдиницы.Наименование ПОДОБНО &СтрокаПоиска", "");
	Запрос.Текст		= СтрЗаменить(Запрос.Текст, "И &УсловиеСтрокаПоиска", УсловиеСтрокаПоиска);
	
    МассивСтруктурныхЕдиниц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
    
    СписокСтруктурныхЕдиниц = Новый СписокЗначений;
    СписокСтруктурныхЕдиниц.ЗагрузитьЗначения(МассивСтруктурныхЕдиниц);
	
	Возврат СписокСтруктурныхЕдиниц;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора".
//
Процедура СтруктурнаяЕдиницаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЭтоПользователь"			   , Истина);
	СтруктураПараметров.Вставить("Ссылка"					   , ОбщегоНазначенияСтоматология.ДоступныеСтруктурныеЕдиницы()); 
	СтруктураПараметров.Вставить("ВидСравненияКомпоновкиДанных", ВидСравненияКомпоновкиДанных.ВСписке);
	
	ОткрытьФорму("Справочник.СтруктурныеЕдиницы.ФормаВыбора", СтруктураПараметров, Элементы.СтруктурнаяЕдиница);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора".
//
Процедура СтруктурнаяЕдиницаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение  <> Объект.СтруктурнаяЕдиница Тогда
		
		Объект.Касса 			  = Неопределено;
		Объект.БанковскийСчет 	  = Неопределено;
		Объект.ЭквайрингТерминал  = Неопределено;
		Объект.СтруктурнаяЕдиница = ВыбранноеЗначение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, создает строку элементов расшифровки платежа.
//
Процедура СоздатьСтрокуЭлементовРасшифровки(Индекс)
	
	ВидыОпераций = Перечисления.ВидыОпераций;
	
	ИмяТЧ = "";
	Если Объект.ВидОперации = ВидыОпераций.ПрочееСписание Тогда
		ИмяТЧ = "Затраты";
	Иначе
		ИмяТЧ = "РасшифровкаПлатежа"
	КонецЕсли;	
	
	ИспользоватьАвансы = Константы.УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов.Получить() И Объект.ВидОперации = ВидыОпераций.ВозвратОплатыКлиенту;
	
	ГруппаНовыхЭл                         = Элементы.Добавить("Строка" + ИмяТЧ + "_" + Индекс, Тип("ГруппаФормы"), Элементы["ГруппаСтроки" + ИмяТЧ]);
	ГруппаНовыхЭл.Вид                     = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаНовыхЭл.Группировка             = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	ГруппаНовыхЭл.Отображение             = ОтображениеОбычнойГруппы.Нет;
	ГруппаНовыхЭл.Ширина				  = 114;
	ГруппаНовыхЭл.ОтображатьЗаголовок     = Ложь;
	ГруппаНовыхЭл.РастягиватьПоГоризонтали = Неопределено; // Неопределено
	
	ДекорацияНомерСтроки				  = Элементы.Добавить(ИмяТЧ + "ДекорацияНомер_" + Индекс, Тип("ДекорацияФормы"), ГруппаНовыхЭл);
	ДекорацияНомерСтроки.Заголовок        = Индекс + 1;
	ДекорацияНомерСтроки.Ширина			  = 2;  	
	
	Если ИмяТЧ = "Затраты" Тогда
	
		ПолеСтатья					 		 	= Элементы.Добавить(ИмяТЧ + "Статья_" + Индекс, Тип("ПолеФормы"), ГруппаНовыхЭл);
		ПолеСтатья.Вид				 		 	= ВидПоляФормы.ПолеВвода;
		ПолеСтатья.ПутьКДанным		 		 	= "Объект." + ИмяТЧ + "[" + Индекс +"].СтатьяЗатрат";
		ПолеСтатья.РастягиватьПоГоризонтали		= Неопределено;
		ПолеСтатья.АвтоМаксимальнаяШирина   	= Ложь;
		ПолеСтатья.Ширина  						= 0;
		ПолеСтатья.МаксимальнаяШирина  			= 35;
		ПолеСтатья.ПодсказкаВвода	 		 	= "Статья затрат";
		ПолеСтатья.ПоложениеЗаголовка		 	= ПоложениеЗаголовкаЭлементаФормы.Нет;
		Объект.Затраты[Индекс].СтатьяЗатрат	 	= Объект.Статья;
		
		ПолеСотрудник					 		 	= Элементы.Добавить(ИмяТЧ + "Сотрудник_" + Индекс, Тип("ПолеФормы"), ГруппаНовыхЭл);
		ПолеСотрудник.Вид				 		 	= ВидПоляФормы.ПолеВвода;
		ПолеСотрудник.РастягиватьПоГоризонтали		= Неопределено;
		ПолеСотрудник.АвтоМаксимальнаяШирина   		= Ложь;
		ПолеСотрудник.Ширина  						= 0;
		ПолеСотрудник.МаксимальнаяШирина  			= 25;
		ПолеСотрудник.ПутьКДанным		 		 	= "Объект." + ИмяТЧ + "[" + Индекс +"].Сотрудник";
		ПолеСотрудник.ПоложениеЗаголовка 		 	= ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеСотрудник.ПодсказкаВвода	 		 	= "Сотрудник";
		ПолеСотрудник.УстановитьДействие("ПриИзменении", "ЗатратыСотрудникПриИзменении");
		ПолеСотрудник.УстановитьДействие("НачалоВыбора", "СотрудникТЧНачалоВыбора");
		
	    ПолеСпециализация					 			= Элементы.Добавить(ИмяТЧ + "Специализация_" + Индекс, Тип("ПолеФормы"), ГруппаНовыхЭл);
		ПолеСпециализация.Вид				 			= ВидПоляФормы.ПолеВвода;
		ПолеСпециализация.РастягиватьПоГоризонтали		= Неопределено;
		ПолеСпециализация.АвтоМаксимальнаяШирина   		= Ложь;
		ПолеСпециализация.Ширина  						= 0;
		ПолеСпециализация.МаксимальнаяШирина  			= 25;
		ПолеСпециализация.ПоложениеЗаголовка 			= ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеСпециализация.ПутьКДанным		 			= "Объект." + ИмяТЧ + "[" + Индекс +"].Специализация";
		ПолеСпециализация.ПодсказкаВвода	 			= "Специализация";
			
		ПолеСумма               	 = Элементы.Добавить(ИмяТЧ + "Сумма_" + Индекс, Тип("ПолеФормы"), ГруппаНовыхЭл);
		ПолеСумма.Вид                = ВидПоляФормы.ПолеВвода;
		ПолеСумма.Ширина			 = 13;
		ПолеСумма.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеСумма.ПутьКДанным        = "Объект." + ИмяТЧ + "[" + Индекс +"].Сумма";
		ПолеСумма.ПодсказкаВвода	 = "Сумма";
		ПолеСумма.УстановитьДействие("ОкончаниеВводаТекста"	, "ЗатратыСуммаОкончаниеВводаТекста");
		
	КонецЕсли;	
	
	Если ИмяТЧ = "РасшифровкаПлатежа" Тогда
		ШиринаДопПолей = 0;
		
		ПолеСотрудник					 			= Элементы.Добавить(ИмяТЧ + "Сотрудник_" + Индекс, Тип("ПолеФормы"), ГруппаНовыхЭл);
		ПолеСотрудник.Вид				 			= ВидПоляФормы.ПолеВвода;
		ПолеСотрудник.РастягиватьПоГоризонтали		= Неопределено;
		ПолеСотрудник.АвтоМаксимальнаяШирина   		= Ложь;
		ПолеСотрудник.Ширина  						= 0;
		ПолеСотрудник.МаксимальнаяШирина  			= 25;
		ПолеСотрудник.ПутьКДанным		 			= "Объект." + ИмяТЧ + "[" + Индекс +"].Сотрудник";
		ПолеСотрудник.ПоложениеЗаголовка 			= ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеСотрудник.ПодсказкаВвода	 			= "Сотрудник";
		ПолеСотрудник.Видимость			 			= Объект.ВидОперации = ВидыОпераций.ВыплатаЗаработнойПлаты;
		ПолеСотрудник.УстановитьДействие("НачалоВыбора", "СотрудникТЧНачалоВыбора");

		ШиринаДопПолей = ШиринаДопПолей + ?(ПолеСотрудник.Видимость, ПолеСотрудник.МаксимальнаяШирина, 0);	
		
		Если Объект.ВидОперации = Перечисления.ВидыОпераций.ОплатаНалога Тогда
			
			// Вид налога
			ПолеФормы_Основание = Элементы.Добавить("ПолеФормы_Основание_ТЧ_РасшифровкаПлатежа_" + Индекс, Тип("ПолеФормы"), ГруппаНовыхЭл);
			ПолеФормы_Основание.Вид 													= ВидПоляФормы.ПолеВвода;
			ПолеФормы_Основание.ПутьКДанным 											= "Объект.РасшифровкаПлатежа["+ Строка(Индекс) + "]" + ".ВидНалога";
			ПолеФормы_Основание.Заголовок 										     	= "Вид налога";
			ПолеФормы_Основание.ПоложениеЗаголовка 									    = ?(Индекс = 0, ПоложениеЗаголовкаЭлементаФормы.Верх, ПоложениеЗаголовкаЭлементаФормы.Нет);
			ПолеФормы_Основание.КнопкаОткрытия 										    = Истина;
			ПолеФормы_Основание.КнопкаВыбора				    						= Истина;
			ПолеФормы_Основание.КнопкаВыпадающегоСписка 								= Истина;
			ПолеФормы_Основание.РежимВыбораИзСписка                                     = Ложь;
			ПолеФормы_Основание.АвтоМаксимальнаяШирина 							    	= Ложь;		
			ПолеФормы_Основание.МаксимальнаяШирина 								    	= 94;
			ПолеФормы_Основание.АвтоОтметкаНезаполненного 							    = Истина;
			ПолеФормы_Основание.РастягиватьПоГоризонтали                                = Истина; 
			
		Иначе
			
			ПолеДокумент                          		= Элементы.Добавить("Основание_" + Индекс, Тип("ПолеФормы"), ГруппаНовыхЭл);
			ПолеДокумент.Вид                      		= ВидПоляФормы.ПолеВвода;
			ПолеДокумент.ПоложениеЗаголовка       		= ПоложениеЗаголовкаЭлементаФормы.Нет;
			ПолеДокумент.РастягиватьПоГоризонтали		= Неопределено; // Неопределено
			ПолеДокумент.АвтоМаксимальнаяШирина   		= Ложь;
			ПолеДокумент.МаксимальнаяШирина  			= 90; // МаксимальнаяШирина корректируется ниже!
			ПолеДокумент.ПодсказкаВвода			  		= "Основание";
			ПолеДокумент.КнопкаВыпадающегоСписка  		= Ложь;
			ПолеДокумент.ПутьКДанным              		= "Объект." + ИмяТЧ + "[" + Индекс +"].ДокументОснования";
			ПолеДокумент.УстановитьДействие("НачалоВыбора"	 , "РасшифровкаПлатежаЗаказРеализацияНачалоВыбора");
			ПолеДокумент.УстановитьДействие("ОбработкаВыбора", "РасшифровкаПлатежаЗаказРеализацияОбработкаВыбора");  
			
			
			ПолеАванс						  		= Элементы.Добавить("ДокументАванса_" + Индекс, Тип("ПолеФормы"), ГруппаНовыхЭл);
			ПолеАванс.Вид					  		= ВидПоляФормы.ПолеВвода;
			ПолеАванс.ПоложениеЗаголовка	  		= ПоложениеЗаголовкаЭлементаФормы.Нет;
			ПолеАванс.РастягиватьПоГоризонтали		= Неопределено;
			ПолеАванс.АвтоМаксимальнаяШирина   		= Ложь;
			ПолеАванс.Ширина  						= 0;
			ПолеАванс.МаксимальнаяШирина  			= 25;
			ПолеАванс.ПутьКДанным			  		= "Объект.РасшифровкаПлатежа[" + Индекс +"].ДокументАванса";
			ПолеАванс.ПодсказкаВвода		  		= "Документ аванса";
			ПолеАванс.КнопкаВыпадающегоСписка 		= Ложь;
			ПолеАванс.Видимость				  		= ИспользоватьАвансы;
			ШиринаДопПолей = ШиринаДопПолей + ?(ПолеАванс.Видимость, ПолеАванс.МаксимальнаяШирина, 0);  		
			
			ПолеСтатья					  			= Элементы.Добавить(ИмяТЧ + "Статья_" + Индекс, Тип("ПолеФормы"), ГруппаНовыхЭл);
			ПолеСтатья.Вид				  			= ВидПоляФормы.ПолеВвода;
			ПолеСтатья.ПутьКДанным		  			= "Объект." + ИмяТЧ + "[" + Индекс +"].Статья";
			ПолеСтатья.РастягиватьПоГоризонтали		= Неопределено;
			ПолеСтатья.АвтоМаксимальнаяШирина   	= Ложь;
			ПолеСтатья.Ширина  						= 0;
			ПолеСтатья.МаксимальнаяШирина  			= 25;
			ПолеСтатья.ПодсказкаВвода	  			= "Статья дохода";
			ПолеСтатья.ПоложениеЗаголовка 			= ПоложениеЗаголовкаЭлементаФормы.Нет;
			ПолеСтатья.Видимость		  			= Объект.СтатьяВТаблице;
			ШиринаДопПолей = ШиринаДопПолей + ?(ПолеСтатья.Видимость, ПолеСтатья.МаксимальнаяШирина, 0);
		
	
			КоррекцияШирины = ШиринаДопПолей / 25;
			ПолеДокумент.МаксимальнаяШирина = ПолеДокумент.МаксимальнаяШирина - ШиринаДопПолей - ?(КоррекцияШирины >= 1, (КоррекцияШирины * 2), 1);		
		КонецЕсли;
		
		ПолеСумма               	 = Элементы.Добавить(ИмяТЧ + "Сумма_" + Индекс, Тип("ПолеФормы"), ГруппаНовыхЭл);
		ПолеСумма.Вид                = ВидПоляФормы.ПолеВвода;
		ПолеСумма.Ширина			 = 13;
		ПолеСумма.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеСумма.ПутьКДанным        = "Объект." + ИмяТЧ + "[" + Индекс +"].Сумма";
		ПолеСумма.ПодсказкаВвода	 = "Сумма";
		ПолеСумма.УстановитьДействие("ПриИзменении", "РасшифровкаПлатежаСуммаПриИзменении");
	
		Если Объект.СтатьяВТаблице Тогда
			Объект.РасшифровкаПлатежа[Индекс].Статья = Объект.Статья;		
		Иначе
			Объект.РасшифровкаПлатежа[Индекс].Статья = ПолучитьПредопределеннуюСтатьюДляОперации(Объект.ВидОперации, Ложь);	
		КонецЕсли;
		
		Если ИспользоватьАвансы Тогда
			ПолеСумма.УстановитьДействие("ОкончаниеВводаТекста"		, "РасшифровкаПлатежаДинамическиеОкончаниеВводаТекста");
		КонецЕсли;
			
	КонецЕсли;	
	
	КнопкаУдаления                  	  = Элементы.Добавить(ИмяТЧ + "УдалитьСтроку_" + Индекс, Тип("КнопкаФормы"), ГруппаНовыхЭл);
	КнопкаУдаления.Отображение     	      = ОтображениеКнопки.Картинка;
	КнопкаУдаления.Картинка				  = БиблиотекаКартинок.ОчиститьДанные;
	КнопкаУдаления.ОтображениеФигуры 	  = ОтображениеФигурыКнопки.Нет;
	КнопкаУдаления.ИмяКоманды      	      = "УдалитьСтрокуРасшифровки";
	
КонецПроцедуры

&НаСервере
// Процедура, создает динамические элементы расшифровки платежа.
//
Процедура СоздатьЭлементыРасшифровкиПлатежа()
	
	Если Объект.ВидОперации = Перечисления.ВидыОпераций.ПрочееСписание Тогда
		ИмяТЧ = "Затраты";
	Иначе
		ИмяТЧ = "РасшифровкаПлатежа";
	КонецЕсли;	
	
	Индекс = 0;
	Для Каждого СтрокаТЧ Из Объект[ИмяТЧ] Цикл
		
		СоздатьСтрокуЭлементовРасшифровки(Индекс);
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Если Объект[ИмяТЧ].Количество() = 0 Тогда
		НоваяСтрока = Объект[ИмяТЧ].Добавить();	
		СоздатьСтрокуЭлементовРасшифровки(0);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, удаляет динамическую строку расшифровки платежа.
//
Процедура УдалитьЭлементыРасшифровкиПлатежа(ИндексСтроки)
	
	Если Объект.ВидОперации = Перечисления.ВидыОпераций.ПрочееСписание Тогда
		ИмяТЧ = "Затраты";
	Иначе
		ИмяТЧ = "РасшифровкаПлатежа";
	КонецЕсли;	
	
	СтрокаДанных = Объект[ИмяТЧ][ИндексСтроки];	
	
	Если СтрокаДанных <> Неопределено Тогда 		
		
		Индекс = 0;
		Для Каждого СтрокаТЧ Из Объект[ИмяТЧ] Цикл
			Элементы.Удалить(Элементы["Строка" + ИмяТЧ + "_" + Индекс]);	
			Индекс = Индекс + 1;              
		КонецЦикла;				
		Объект[ИмяТЧ].Удалить(СтрокаДанных);		
		СоздатьЭлементыРасшифровкиПлатежа();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Процедура, удаляет динамически созданные элементы расшифровки платежа.
//
Процедура ОчиститьЭлементыРасшифровки()
	
	Количество = Элементы.ГруппаСтрокиРасшифровкаПлатежа.ПодчиненныеЭлементы.Количество();  // Элементы.ФС...	
	Если Количество <> 0 Тогда
		
		Для Индекс = 0 По Количество - 1 Цикл
			Элементы.Удалить(Элементы.Найти("СтрокаРасшифровкаПлатежа_" + Индекс));
		КонецЦикла;	
	
	КонецЕсли;
	
	Количество = Элементы.ГруппаСтрокиЗатраты.ПодчиненныеЭлементы.Количество();
	Если Количество <> 0 Тогда
		
		Для Индекс = 0 По Количество - 1 Цикл
			Элементы.Удалить(Элементы.Найти("СтрокаЗатраты_" + Индекс));
		КонецЦикла;	
	
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
// Процедура, устанавливает видимость элементов в зависимости от вида операции.
//
Процедура ОбновитьОтображениеРасшифровки()
	
	ВидыОпераций = Перечисления.ВидыОпераций;
	
	ОперацияБезТЧ = Объект.ВидОперации = ВидыОпераций.ВозвратСЛицевогоСчета Или Объект.ВидОперации = ВидыОпераций.СдачаНаличныхВБанк
		Или Объект.ВидОперации = ВидыОпераций.ВыдачаПодотчетнику Или Объект.ВидОперации = ВидыОпераций.ВозвратЗайма
		Или Объект.ВидОперации = ВидыОпераций.ВыплатаДивидендовУчредителю Или Объект.ВидОперации = ВидыОпераций.ВыбытиеВКассу;
	
	Если Объект.ВидОперации = ВидыОпераций.ПрочееСписание Тогда
		
		Элементы.ГруппаЗатраты.Видимость		 = Истина;
		Элементы.Дек_Затраты.Видимость			 = Истина;
		Элементы._Затраты.Видимость				 = Ложь;
		Элементы.ГруппаРасшифровка.Видимость  	 = Ложь;
		Элементы.ГруппаДополнительно.Видимость	 = Ложь;
		Элементы._Расшифровка.Видимость			 = Ложь;
		Элементы.Дек_Расшифровка.Видимость		 = Ложь;
		Элементы._Дополнительно.Видимость		 = Истина;
		Элементы.Дек_Дополнительно.Видимость	 = Ложь;
		
		Элементы.Группа_Кнопки_Затраты.ЦветФона			 = Новый Цвет(242, 242, 242);
		Элементы.Группа_Кнопки_Расшифровка.ЦветФона		 = Новый Цвет(255, 255, 255);
		Элементы.Группа_Кнопки_Дополнительно.ЦветФона	 = Новый Цвет(255, 255, 255);
		
	ИначеЕсли ОперацияБезТЧ Тогда
		
		Элементы.ГруппаЗатраты.Видимость		 = Ложь;
		Элементы.ГруппаРасшифровка.Видимость	 = Ложь;
		Элементы.ГруппаДополнительно.Видимость	 = Ложь;
		Элементы._Расшифровка.Видимость			 = Ложь;
		Элементы.Дек_Расшифровка.Видимость		 = Ложь;
		Элементы._Дополнительно.Видимость		 = Истина;
		Элементы.Дек_Дополнительно.Видимость	 = Ложь;
		Элементы._Затраты.Видимость				 = Ложь;
		Элементы.Дек_Затраты.Видимость			 = Ложь;
		
		Элементы.Группа_Кнопки_Дополнительно.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.Группа_Кнопки_Затраты.ЦветФона		  = Новый Цвет(255, 255, 255);
		Элементы.Группа_Кнопки_Расшифровка.ЦветФона	  = Новый Цвет(255, 255, 255);

	Иначе
		
		Элементы.ГруппаЗатраты.Видимость		 = Ложь;
		Элементы.Дек_Затраты.Видимость			 = Ложь;
		Элементы._Затраты.Видимость				 = Ложь;
		Элементы.ГруппаРасшифровка.Видимость	 = Истина;
		Элементы.ГруппаДополнительно.Видимость	 = Ложь;
		Элементы._Расшифровка.Видимость			 = Ложь;
		Элементы.Дек_Расшифровка.Видимость		 = Истина;
		Элементы._Дополнительно.Видимость		 = Истина;
		Элементы.Дек_Дополнительно.Видимость	 = Ложь;
		
		Элементы.Группа_Кнопки_Затраты.ЦветФона			 = Новый Цвет(255, 255, 255);
		Элементы.Группа_Кнопки_Расшифровка.ЦветФона		 = Новый Цвет(242, 242, 242);
		Элементы.Группа_Кнопки_Дополнительно.ЦветФона	 = Новый Цвет(255, 255, 255);
				
		Если Объект.ВидОперации = ВидыОпераций.ВозвратОплатыСтраховойКомпании Тогда
			Элементы.ГруппаРасшифровкаПлатежа.Видимость		 = Истина;
			Элементы.ГруппаРасшифровкаДинамические.Видимость = Ложь;
		Иначе
			Элементы.ГруппаРасшифровкаПлатежа.Видимость		 = Ложь;
			Элементы.ГруппаРасшифровкаДинамические.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает идентификатор строки данных по имени элемента.
//
Функция ПолучитьИндексСтроки(ИмяЭлемента)
	
	НомерСимвола = Найти(ИмяЭлемента,"_");
	Возврат Число(Прав(ИмяЭлемента,СтрДлина(ИмяЭлемента) - НомерСимвола)); 
	
КонецФункции

&НаСервере
// Функция возвращает ссылку на отчет
//
Функция СсылкаВариантаОтчета(ИмяОтчета, КлючВарианта)
	
	Отчет = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Отчет." + ИмяОтчета);
	Возврат ВариантыОтчетов.ВариантОтчета(Отчет, КлючВарианта);
	
КонецФункции

// Процедура - Договор начало выбора завершение
//
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
//
&НаКлиенте
Процедура ДоговорНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.Договор = Результат;
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Видимость группа остаток на ЛС
// 
// Возвращаемое значение:
//   - 
//
Функция ВидимостьГруппаОстатокНаЛС(ВидОперации)
	
	Если ВидОперации = Перечисления.ВидыОпераций.ОплатаПоставщику Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

#КонецОбласти 
