
#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Номенклатура")
		И ЗначениеЗаполнено(Параметры.Номенклатура) Тогда  		
		Номенклатура = Параметры.Номенклатура;	
	КонецЕсли;
	
	ЗаполнитьДеревоСостояний();
КонецПроцедуры

&НаКлиенте
// Процедура - Перед закрытием
//
// Параметры:
//  Отказ				 - 	 - 
//  ЗавершениеРаботы	 - 	 - 
//  ТекстПредупреждения	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если НЕ ЗавершениеРаботы Тогда
		Оповестить("ЗаписатьОбластиЗубнойФормулы", ДеревоСостояний, ЭтаФорма);
		// ЗаполнитьОбластиЗубнойФормулы();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

&НаКлиенте
// Процедура - Выделить все
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВыделитьВсе(Команда)
	
	Для Каждого СтрокаТЧ из ДеревоСостояний.ПолучитьЭлементы() Цикл
		СтрокаТЧ.Принадлежит = Истина;
		Для Каждого СтрокаДерева из СтрокаТЧ.ПолучитьЭлементы() Цикл
			СтрокаДерева.Принадлежит = Истина;
		КонецЦикла;		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
// Процедура - Снять все
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СнятьВсе(Команда)
	
	Для Каждого СтрокаТЧ из ДеревоСостояний.ПолучитьЭлементы() Цикл
		СтрокаТЧ.Принадлежит = Ложь;
		Для Каждого СтрокаДерева из СтрокаТЧ.ПолучитьЭлементы() Цикл
			СтрокаДерева.Принадлежит = Ложь;
		КонецЦикла;		
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
// Процедура - Развернуть
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Развернуть(Команда)
	
	Для а = 0 По ДеревоСостояний.ПолучитьЭлементы().Количество() - 1 Цикл
		Элементы.ДеревоСостояний.Развернуть(ДеревоСостояний.ПолучитьЭлементы()[а].ПолучитьИдентификатор());
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
// Процедура - Свернуть
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Свернуть(Команда)   
	
	Для а = 0 По ДеревоСостояний.ПолучитьЭлементы().Количество() - 1 Цикл
		Элементы.ДеревоСостояний.Свернуть(ДеревоСостояний.ПолучитьЭлементы()[а].ПолучитьИдентификатор());
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
// Процедура - Дерево состояний при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ДеревоСостоянийПриИзменении(Элемент)
	СтрокаРодитель = Элемент.ТекущиеДанные; 	
	Если СтрокаРодитель.Принадлежит = 2 Тогда
		СтрокаРодитель.Принадлежит = 0;
	КонецЕсли;

	Если Не СтрокаРодитель = Неопределено Тогда
		Если ТипЗнч(СтрокаРодитель.Состояние) = Тип("Строка") Тогда			
			Для Каждого СтрокаТЧ из СтрокаРодитель.ПолучитьЭлементы() Цикл
				СтрокаТЧ.Принадлежит = СтрокаРодитель.Принадлежит;
			КонецЦикла;
		Иначе 			
			Родитель = СтрокаРодитель.ПолучитьРодителя();
			СтрокиДерева = Родитель.ПолучитьЭлементы(); 			
			ЕстьВыбранные = Ложь;
			Количество = 0;
			КоличествоНевыбранных = 0;
			Для Каждого СтрокаТЧ из СтрокиДерева Цикл
				Если НЕ СтрокаТЧ.Принадлежит Тогда
					КоличествоНевыбранных = КоличествоНевыбранных + 1;						
				КонецЕсли;
				Количество = Количество + 1;
			КонецЦикла;
			Если Количество = КоличествоНевыбранных Тогда
				Родитель.Принадлежит = Ложь;
			ИначеЕсли Количество > КоличествоНевыбранных и КоличествоНевыбранных <> 0 Тогда
				Родитель.Принадлежит = 2;
			ИначеЕсли КоличествоНевыбранных = 0 Тогда
				Родитель.Принадлежит = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура, выполняет заполнение табличной части
//
Процедура ЗаполнитьОбластиЗубнойФормулы()

	ТекущийОбъект = Номенклатура.ПолучитьОбъект();
	ТекущийОбъект.ОбластиЗубнойФормулы.Очистить();
	Для Каждого СтрокаТЧ из ДеревоСостояний.ПолучитьЭлементы() Цикл		
		Если СтрокаТЧ.Принадлежит Тогда
			Для Каждого СтрокаДерева из СтрокаТЧ.ПолучитьЭлементы() Цикл
				Если СтрокаДерева.Принадлежит Тогда
					НоваяСтрока = ТекущийОбъект.ОбластиЗубнойФормулы.Добавить();
					НоваяСтрока.СостояниеЗубнойФормулы = СтрокаДерева.Состояние;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
	КонецЦикла;
	ТекущийОбъект.Записать();
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет заполнение дерева состояний зубной формулы
//
Процедура ЗаполнитьДеревоСостояний()
	
	Запрос = Новый Запрос();
	Запрос.Текст = ПолучитьТекстЗапроса();
	Запрос.УстановитьПараметр("Ссылка", Номенклатура.Ссылка);
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	Пока ВыборкаИтоги.Следующий() Цикл
		Родитель = ДеревоСостояний.ПолучитьЭлементы().Добавить();
		Родитель.Состояние = ВыборкаИтоги.ОбластьЗубнойФормулы;
		Родитель.Картинка = БиблиотекаКартинок.Папка;
		Выборка = ВыборкаИтоги.Выбрать();
		Количество = 0;
		КоличествоВыбранных = 0;
		Пока Выборка.Следующий() Цикл
			 НоваяСтрока = Родитель.ПолучитьЭлементы().Добавить();
			 НоваяСтрока.Состояние = Выборка.Состояние;
			 НоваяСтрока.Картинка = БиблиотекаКартинок.Картинка_Реквизит;
			 Количество = Количество + 1;
			 Если Выборка.Флаг Тогда
				 НоваяСтрока.Принадлежит = Истина;
				 КоличествоВыбранных = КоличествоВыбранных + 1;
				 // Родитель.Принадлежит = Истина;
			 КонецЕсли;
		 КонецЦикла;                      
		 Если Количество <> 0 и КоличествоВыбранных = Количество Тогда
			 Родитель.Принадлежит = Истина;
		 ИначеЕсли КоличествоВыбранных <> 0 и КоличествоВыбранных < Количество Тогда
			  Родитель.Принадлежит =  2;
		 КонецЕсли;
	КонецЦикла;                                        	
	
КонецПроцедуры

&НаСервере
// Функция, вовзащает текст запроса
//
Функция ПолучитьТекстЗапроса()
	
	Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	ВЫБОР
	        |		КОГДА Состояние.ОбластьЗубнойФормулы = ЗНАЧЕНИЕ(Перечисление.ОбластиЗубнойФормулы.ПоверхностьЦентр)
	        |			ТОГДА ""Поверхность""
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА Состояние.ОбластьЗубнойФормулы = ЗНАЧЕНИЕ(Перечисление.ОбластиЗубнойФормулы.Корень1)
	        |					ТОГДА ""Корень""
	        |				ИНАЧЕ ВЫБОР
	        |						КОГДА Состояние.ОбластьЗубнойФормулы = ЗНАЧЕНИЕ(Перечисление.ОбластиЗубнойФормулы.Канал1)
	        |							ТОГДА ""Канал""
	        |						ИНАЧЕ ВЫБОР
	        |								КОГДА Состояние.ОбластьЗубнойФормулы = ЗНАЧЕНИЕ(Перечисление.ОбластиЗубнойФормулы.Десна)
	        |									ТОГДА ""Десна""
	        |								ИНАЧЕ ВЫБОР
	        |										КОГДА Состояние.ОбластьЗубнойФормулы = ЗНАЧЕНИЕ(Перечисление.ОбластиЗубнойФормулы.Кость)
	        |											ТОГДА ""Кость""
	        |										ИНАЧЕ ВЫБОР
	        |												КОГДА Состояние.ОбластьЗубнойФормулы = ЗНАЧЕНИЕ(Перечисление.ОбластиЗубнойФормулы.КоронкаЗУб)
	        |													ТОГДА ""Коронка (зуб)""
	        |												ИНАЧЕ ВЫБОР
	        |														КОГДА Состояние.ОбластьЗубнойФормулы = ЗНАЧЕНИЕ(Перечисление.ОбластиЗубнойФормулы.КоронкаПротез)
	        |															ТОГДА ""Коронка (Протез)""
	        |														ИНАЧЕ ВЫБОР
	        |																КОГДА Состояние.ОбластьЗубнойФормулы = ЗНАЧЕНИЕ(Перечисление.ОбластиЗубнойФормулы.Штифт)
	        |																	ТОГДА ""Штифт""
	        |																ИНАЧЕ ВЫБОР
	        |																		КОГДА Состояние.ОбластьЗубнойФормулы = ЗНАЧЕНИЕ(Перечисление.ОбластиЗубнойФормулы.Абатмент)
	        |																			ТОГДА ""Абатмент""
	        |																	КОНЕЦ
	        |															КОНЕЦ
	        |													КОНЕЦ
	        |											КОНЕЦ
	        |									КОНЕЦ
	        |							КОНЕЦ
	        |					КОНЕЦ
	        |			КОНЕЦ
	        |	КОНЕЦ КАК ОбластьЗубнойФормулы,
	        |	Состояние.Ссылка КАК Состояние,
	        |	ВЫБОР
	        |		КОГДА Таблица.СостояниеЗубнойФормулы ЕСТЬ NULL 
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК Флаг
	        |ИЗ
	        |	Справочник.СостояниеЗубнойФормулы КАК Состояние
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			НоменклатураОбластиЗубнойФормулы.СостояниеЗубнойФормулы КАК СостояниеЗубнойФормулы
	        |		ИЗ
	        |			Справочник.Номенклатура.ОбластиЗубнойФормулы КАК НоменклатураОбластиЗубнойФормулы
	        |		ГДЕ
	        |			НоменклатураОбластиЗубнойФормулы.Ссылка = &Ссылка) КАК Таблица
	        |		ПО Состояние.Ссылка = Таблица.СостояниеЗубнойФормулы
	        |ГДЕ
	        |	НЕ Состояние.ПометкаУдаления
	        |ИТОГИ ПО
	        |	ОбластьЗубнойФормулы";
		Возврат Текст;
	
КонецФункции

&НаКлиенте
// Процедура - При открытии
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриОткрытии(Отказ)
	Развернуть(Неопределено);
КонецПроцедуры

#КонецОбласти

