
#Область СлужебныеПроцедурыИФункции

//
// <Описание Функции>
//
// Параметры
//  <Сотрудник>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <СтруктурнаяЕдиница>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Функция ПолучитьПомещениеСотрудникаПоУмолчанию(Сотрудник, СтруктурнаяЕдиница) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СвязкаПомещениеСотрудник.Помещение
		|ИЗ
		|	РегистрСведений.СвязкаПомещениеСотрудник КАК СвязкаПомещениеСотрудник
		|ГДЕ
		|	СвязкаПомещениеСотрудник.Сотрудник = &Сотрудник
		|	И СвязкаПомещениеСотрудник.Помещение.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И СвязкаПомещениеСотрудник.Основное = ИСТИНА";

	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Помещение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции // ПолучитьПомещениеПоУмолчанию()

#КонецОбласти