
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборПоНоменклатуре") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НоменклатураСегмента.Сегмент КАК Сегмент
			|ИЗ
			|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
			|ГДЕ
			|	НоменклатураСегмента.Номенклатура = &Номенклатура
			|
			|СГРУППИРОВАТЬ ПО
			|	НоменклатураСегмента.Сегмент";
		Запрос.УстановитьПараметр("Номенклатура", Параметры.ОтборПоНоменклатуре);
		СписокСегментов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сегмент");
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение = СписокСегментов;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти