
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
			
	#Если НЕ ВебКлиент Тогда

	ДанныеВыполнения = АвтозаполнениеШаблоновФайловКлиент.ВыполнитьАвтоЗаполнениеШаблона(ПараметрКоманды);
		
	Если ДанныеВыполнения.Результат = Истина Тогда
		ПутьКФайлу = ПолучитьИмяВременногоФайла(ДанныеВыполнения.РасширениеФайла);
		ДанныеВыполнения.ДвоичныеДанныеЗаполненногоФайла.Записать(ПутьКФайлу);
		ЗапуститьПриложение(ПутьКФайлу);
	Иначе
		ПоказатьПредупреждение(,ДанныеВыполнения.ОписаниеОшибки);
	КонецЕсли;
	
	Состояние();
	
	#КонецЕсли
		
КонецПроцедуры

#КонецОбласти