
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Идентификатор", Идентификатор);
	Заголовок = НСтр("ru='ФР'") + " """ + Строка(Идентификатор) + """";

	ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
	ЦветОшибки = ЦветаСтиля.ЦветОтрицательногоЧисла;
	
	СпМодель = Элементы.Модель.СписокВыбора;
    СпМодель.Добавить("Инкотекс-Меркурий-ФР");	
	//СпМодель.Добавить("Меркурий-114.1Ф");
	//СпМодель.Добавить("Меркурий-СИСТЕМА-Ф");
	//СпМодель.Добавить("Меркурий MS-K");
	//СпМодель.Добавить("Меркурий-114.1К");
	//СпМодель.Добавить("Меркурий-114.1ФMD (молдавская)");
	//СпМодель.Добавить("Меркурий-СИСТЕМА-К");
	//СпМодель.Добавить("Меркурий-118К");
	//СпМодель.Добавить("Меркурий-119К");
	//СпМодель.Добавить("Меркурий-119ФAZ (азербайджанская)");
	//СпМодель.Добавить("Гепард НТС-ФBY (белорусская)");
	//СпМодель.Добавить("MSTAR-ФKZ (казахская)");
	
	СпПорт = Элементы.Порт.СписокВыбора;
	Индекс = Неопределено;
	Для Индекс = 1 По 32 Цикл
		СпПорт.Добавить("COM" + СокрЛП(Индекс));
	КонецЦикла;

	СпСкорость = Элементы.Скорость.СписокВыбора;
	СпСкорость.Добавить("9600");
	СпСкорость.Добавить("19200");
	СпСкорость.Добавить("38400");
	СпСкорость.Добавить("57600");
	СпСкорость.Добавить("115200");

	времПорт                 = Неопределено;
	времСкорость             = Неопределено;
	времНомерЛУ              = Неопределено;
	времПароль               = Неопределено;
	времНаличнаяОплата       = Неопределено;
	времСекция               = Неопределено;
	времМодель               = Неопределено;

	Параметры.Свойство("Порт"              , времПорт);
	Параметры.Свойство("Скорость"          , времСкорость);
	Параметры.Свойство("НомерЛУ"           , времНомерЛУ);
	Параметры.Свойство("Пароль"            , времПароль);
	Параметры.Свойство("НаличнаяОплата"    , времНаличнаяОплата);
	Параметры.Свойство("Секция"            , времСекция);
	Параметры.Свойство("Модель"            , времМодель);

	Порт               = ?(времПорт                = Неопределено,   "СОМ1", времПорт);
	Скорость           = ?(времСкорость            = Неопределено,  "57600", времСкорость);
	НомерЛУ            = ?(времНомерЛУ             = Неопределено,        1, времНомерЛУ);
	Пароль             = ?(времПароль              = Неопределено,   "0000", времПароль);
	НаличнаяОплата     = ?(времНаличнаяОплата      = Неопределено,     Ложь, времНаличнаяОплата);
	Секция             = ?(времСекция              = Неопределено,        1, времСекция);
	Модель             = ?(времМодель              = Неопределено, Элементы.Модель.СписокВыбора[0], времМодель);

	Элементы.ТестУстройства.Видимость    = (ПараметрыСеанса.РабочееМестоКлиента
	                                        = Идентификатор.РабочееМесто);
	Элементы.УстановитьДрайвер.Видимость = (ПараметрыСеанса.РабочееМестоКлиента
	                                        = Идентификатор.РабочееМесто);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьИнформациюОДрайвере();

КонецПроцедуры

// Процедура представляет обработчик события "Нажатие" кнопки
// "ОК" командной панели "ОсновныеДействияФормы".
//
// Параметры:
//  Кнопка - <КнопкаКоманднойПанели>
//         - Кнопка, с которой связано данное событие (кнопка "ОК").
//
&НаКлиенте
Процедура ЗаписатьИЗакрытьВыполнить()

	Параметры.ПараметрыНастройки.Добавить(Порт              , "Порт");
	Параметры.ПараметрыНастройки.Добавить(Скорость          , "Скорость");
	Параметры.ПараметрыНастройки.Добавить(НомерЛУ           , "НомерЛУ");
	Параметры.ПараметрыНастройки.Добавить(Пароль            , "Пароль");
	Параметры.ПараметрыНастройки.Добавить(НаличнаяОплата    , "НаличнаяОплата");
	Параметры.ПараметрыНастройки.Добавить(Секция            , "Секция");
	Параметры.ПараметрыНастройки.Добавить(Модель            , "Модель");

	ОчиститьСообщения();
	Закрыть(КодВозвратаДиалога.ОК);

КонецПроцедуры // ОсновныеДействияФормыОК()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТестУстройства(Команда)

	РезультатТеста    = Неопределено;

	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;

	времПараметрыУстройства = Новый Структура();
	времПараметрыУстройства.Вставить("Порт"              , Порт);
	времПараметрыУстройства.Вставить("Скорость"          , Скорость);
	времПараметрыУстройства.Вставить("НомерЛУ"           , НомерЛУ);
	времПараметрыУстройства.Вставить("Пароль"            , Пароль);
	времПараметрыУстройства.Вставить("НаличнаяОплата"    , НаличнаяОплата);
	времПараметрыУстройства.Вставить("Секция"            , Секция);
	времПараметрыУстройства.Вставить("Модель"            , Модель);

	Результат = МенеджерОборудованияКлиент.ВыполнитьДополнительнуюКоманду("CheckHealth",
	                                                                      ВходныеПараметры,
	                                                                      ВыходныеПараметры,
	                                                                      Идентификатор,
	                                                                      времПараметрыУстройства);

	ДополнительноеОписание = ?(ТипЗнч(ВыходныеПараметры) = Тип("Массив")
	                           И ВыходныеПараметры.Количество() >= 2,
	                           НСтр("ru = 'Дополнительное описание:'") + " " + ВыходныеПараметры[1],
	                           "");
	Если Результат Тогда
		ТекстСообщения = НСтр("ru = 'Тест успешно выполнен.%ПереводСтроки%%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПереводСтроки%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                  "",
		                                                                  Символы.ПС));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                           "",
		                                                                           ДополнительноеОписание));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		ТекстСообщения = НСтр("ru = 'Тест не пройден.%ПереводСтроки%%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПереводСтроки%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                  "",
		                                                                  Символы.ПС));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                           "",
		                                                                           ДополнительноеОписание));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДрайвер(Команда)

	МенеджерОборудованияКлиент.УстановитьДрайвер(Идентификатор);

	ОбновитьИнформациюОДрайвере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьИнформациюОДрайвере()

	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;

	времПараметрыУстройства = Новый Структура();
	времПараметрыУстройства.Вставить("Порт"              , Порт);
	времПараметрыУстройства.Вставить("Скорость"          , Скорость);
	времПараметрыУстройства.Вставить("НомерЛУ"           , НомерЛУ);
	времПараметрыУстройства.Вставить("Пароль"            , Пароль);
    времПараметрыУстройства.Вставить("НаличнаяОплата"    , НаличнаяОплата);	
	времПараметрыУстройства.Вставить("Секция"            , Секция);
	времПараметрыУстройства.Вставить("Модель"            , Модель);

	Если МенеджерОборудованияКлиент.ВыполнитьДополнительнуюКоманду("ПолучитьВерсиюДрайвера",
	                                                               ВходныеПараметры,
	                                                               ВыходныеПараметры,
	                                                               Идентификатор,
	                                                               времПараметрыУстройства) Тогда
		Драйвер = ВыходныеПараметры[0];
		Версия  = ВыходныеПараметры[1];
	Иначе
		Если  ВыходныеПараметры <> Неопределено Тогда
			Драйвер = ВыходныеПараметры[2];
			Версия  = НСтр("ru='Не определена'");
		КонецЕсли;
	КонецЕсли;

	Элементы.Драйвер.ЦветТекста = ?(Драйвер = НСтр("ru='Не установлен'"), ЦветОшибки, ЦветТекста);
	Элементы.Версия.ЦветТекста  = ?(Версия  = НСтр("ru='Не определена'"), ЦветОшибки, ЦветТекста);

КонецПроцедуры

#КонецОбласти
