
#Область СлужебныйПрограммныйИнтерфейс     

// Возвращает номер версии библиотеки подключаемого оборудования.
//
// Возвращаемое значение:
// 	Строка - номер версии библиотеки подключаемого оборудования
Функция ВерсияБиблиотеки() Экспорт
	
	Возврат "2.1.6.16";
	
КонецФункции

// Получает ревизию требований для драйверов подключаемого оборудования.
//
// Возвращаемое значение:
// 	Число - ревизия требований для драйверов подключаемого оборудования
Функция РевизияИнтерфейсаДрайверов() Экспорт
	
	РевизияИнтерфейса = 3003;
	Возврат РевизияИнтерфейса;
	
КонецФункции

// Получает текущую дату сервера, приведенную к часовому поясу сеанса.
// Предназначена для использования вместо функции ТекущаяДатаСеанса.
//
// Возвращаемое значение:
//  Дата - текущая дата сеанса.
//
Функция ПолучитьДатаСеанса() Экспорт
	
#Если МобильноеПриложениеСервер Тогда
	Возврат ТекущаяДата();
#Иначе
	Возврат ТекущаяДатаСеанса();
#КонецЕсли

КонецФункции

// Функция возвращает список подключенного в справочнике ПО
//
//  Параметры:
// 	ТипыПО - Неопределено - Описание
// 	Идентификатор - Неопределено - Описание
// 	РабочееМесто - Неопределено - Описание
// 	ТолькоАвтоматическаяФискализация - Булево - Описание
// Возвращаемое значение:
// 	Массив из Структура - Описание:
// 	* Наименование - Строка - .
//
Функция ОборудованиеПоПараметрам(ТипыПО = Неопределено, Идентификатор = Неопределено,
	РабочееМесто = Неопределено, ТолькоАвтоматическаяФискализация = Ложь) Экспорт
	
	// Возврат Справочники.ПодключаемоеОборудование.ОборудованиеПоПараметрам(ТипыПО, Идентификатор, РабочееМесто, ТолькоАвтоматическаяФискализация);
	Возврат Справочники.ПодключаемоеОборудование.ПолучитьСписокОборудования(ТипыПО, Идентификатор, РабочееМесто);
	
КонецФункции

// Функция возвращает по идентификатору устройства его параметры.
//
Функция ПолучитьПараметрыУстройства(Идентификатор) Экспорт
	
	Возврат Справочники.ПодключаемоеОборудование.ПолучитьПараметрыУстройства(Идентификатор);
	
КонецФункции

// Функция возвращает по идентификатору устройства параметры регистрации.
//
Функция ПолучитьПараметрыРегистрацииУстройства(Идентификатор) Экспорт
	
	Возврат Справочники.ПодключаемоеОборудование.ПолучитьПараметрыРегистрацииУстройства(Идентификатор);
	
КонецФункции

// Процедура предназначена для сохранения параметров устройства
// в реквизит Параметры типа хранилище значения в элементе справочника.
//
Функция СохранитьПараметрыУстройства(Идентификатор, Параметры) Экспорт
	
	Возврат Справочники.ПодключаемоеОборудование.СохранитьПараметрыУстройства(Идентификатор, Параметры);
	
КонецФункции

// Функция возвращает поддерживает ли фискальное устройство.
//
Функция ФискальноеУстройствоПоддерживаетПроверкуКодовМаркировки(ИдентификаторУстройства) Экспорт
	
	Результат = Ложь;
	ПараметрыРегистрации = МенеджерОборудованияВызовСервера.ПолучитьПараметрыРегистрацииУстройства(ИдентификаторУстройства);
	Если ПараметрыРегистрации <> Неопределено Тогда
		Результат = ПараметрыРегистрации.Свойство("ВерсияФФДККТ") И ПараметрыРегистрации.ВерсияФФДККТ = "1.2"
			И ПараметрыРегистрации.Свойство("ВерсияФФДФН") И ПараметрыРегистрации.ВерсияФФДФН = "1.2";
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

// Функция возвращает для фискального устройства версию ФФД.
//
Функция ФискальноеУстройствоПоддерживаетВерсиюФФД(ИдентификаторУстройства) Экспорт
	
	Результат = Неопределено;
	ПараметрыРегистрации = МенеджерОборудованияВызовСервера.ПолучитьПараметрыРегистрацииУстройства(ИдентификаторУстройства);
	Если ПараметрыРегистрации <> Неопределено И ПараметрыРегистрации.Свойство("ВерсияФФДККТ") Тогда
		Результат = ПараметрыРегистрации.ВерсияФФДККТ;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

// Процедура предназначена для сохранения параметров регистрации устройства
//
Функция СохранитьПараметрыРегистрацииУстройства(Идентификатор, ПараметрыРегистрации) Экспорт
	
	Возврат Справочники.ПодключаемоеОборудование.СохранитьПараметрыРегистрацииУстройства(Идентификатор, ПараметрыРегистрации); 
	
КонецФункции

// Функция возвращает структуру с данными устройства.
//
// Параметры:
// 	Идентификатор - СправочникСсылка.ПодключаемоеОборудование - экземпляр подключаемого оборудования.
// Возвращаемое значение:
// 	Структура - Описание:
// *ОбработчикДрайвераИмя - Строка - имя драйвера.
// *ОбработчикДрайвера - Строка - обработчик драйвера. 
// *ИмяКомпьютера - Строка - наименование компьютера. 
// *РабочееМесто - СправочникСсылка.РабочиеМеста - рабочее место.
// *Параметры - Структура - структура с полями:
// **ДатаНачала - Дата - .
// **ДатаОкончания - Дата - .
// **ПериодВыгрузки - Структура - структура с полями:
// ***ДатаНачала - Дата - дата начала загрузки.
// ***ДатаОкончания - Дата - дата окончания загрузки. 
// *ИмяФайлаДрайвера - Строка - имя файла драйвера.
// *ИмяМакетаДрайвера - Строка - имя макета драйвера.
// *ПоставляетсяДистрибутивом - Булево - признак поставки дистрибутивом.
// *ИдентификаторОбъекта - Строка - идентификатор объекта строкой.
// *ВСоставеКонфигурации - Булево - признак поставке в составе конфигурации.
// *ДрайверОборудованияИмя - Строка - драйвер оборудования строкой.
// *ДрайверОборудования - СправочникСсылка.ПодключаемоеОборудование - драйвер оборудования.
// *ТипОборудованияИмя - Строка - тип опоборудования строкой.
// *ТипОборудования - ПеречислениеСсылка.ТипыПодключаемогоОборудования - тип оборудования.
// *Наименование - Строка - наименование оборудования.
// *ИдентификаторУстройства - Строка - идентификатор устройства.
// *Ссылка - СправочникСсылка.ПодключаемоеОборудование - экземпляр подключаемого оборудования.
//
Функция ПолучитьДанныеУстройства(Идентификатор) Экспорт

	Возврат Справочники.ПодключаемоеОборудование.ПолучитьДанныеУстройства(Идентификатор);

КонецФункции

// Функция возвращает структуру с данными драйвера.
// 
// Параметры:
// 	Идентификатор - СправочникСсылка.ПодключаемоеОборудование - экземпляр подключаемого оборудования.
// Возвращаемое значение:
// 	Структура - Описание:
// * ВерсияДрайвера 
// * ИмяФайлаДрайвера 
// * ИмяМакетаДрайвера 
// * ПоставляетсяДистрибутивом 
// * ОбработчикДрайвера 
// * ИдентификаторОбъекта 
// * ВСоставеКонфигурации 
// * ТипОборудования 
// * ДрайверОборудованияИмя 
// * ДрайверОборудования
// 
Функция ПолучитьДанныеДрайвера(Идентификатор) Экспорт
	
	Возврат Справочники.ДрайверыОборудования.ПолучитьДанныеДрайвера(Идентификатор);
	
КонецФункции

// Функция возвращает из переменной сеанса имя компьютера клиента.
//
Функция ПолучитьРабочееМестоКлиента() Экспорт

	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если ОбщегоНазначенияПовтИсп.ЭтоСеансРегламентногоЗадания() Тогда 
		Возврат Справочники.РабочиеМеста.ПустаяСсылка();
	Иначе 	
		Возврат ПараметрыСеанса.РабочееМестоКлиента;
	КонецЕсли;	

КонецФункции

// Функция возвращает список рабочих мест, соответствующих указанному имени компьютера.
//
Функция НайтиРабочиеМестаПоИД(ИдентификаторКлиента, ИмяКомпьютера) Экспорт
	
	Если Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат Новый Массив();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Заглушка, при первом входе не успевает инициализироваться параметр сеанса Текущий пользователь
	Если ЗначениеЗаполнено(Константы.ДатаПервогоВходаВСистему.Получить()) Тогда 
		РабочееМесто = Пользователи.ПолучитьЗначениеПоУмолчаниюПользователя(Неопределено, "ОсновноеРабочееМесто");
		
		Если ЗначениеЗаполнено(РабочееМесто) Тогда
			СписокКомпьютеров = Новый Массив;
			СписокКомпьютеров.Добавить(РабочееМесто);
			Возврат СписокКомпьютеров;
		КонецЕсли;
	КонецЕсли;
	
	// Проверяем рабочие места на наличие многопользовательского места.	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяКомпьютера", ИмяКомпьютера);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеМеста.Ссылка
	|ИЗ
	|	Справочник.РабочиеМеста КАК РабочиеМеста
	|ГДЕ
	|	НЕ РабочиеМеста.ПометкаУдаления
	|	И РабочиеМеста.Код = &ИмяКомпьютера
	|	И РабочиеМеста.МногопользовательскийРежим";
	
	СписокКомпьютеров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Если СписокКомпьютеров.Количество() = 0 Тогда 
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	РабочиеМеста.Ссылка
		|ИЗ
		|	Справочник.РабочиеМеста КАК РабочиеМеста
		|ГДЕ
		|	РабочиеМеста.Код = &Код
		|	И РабочиеМеста.ПометкаУдаления = ЛОЖЬ
		|");
		
		Запрос.УстановитьПараметр("Код", ИдентификаторКлиента);
		СписокКомпьютеров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат СписокКомпьютеров;
	
КонецФункции

// Функция устанавливает в переменную сеанса имя компьютера клиента.
//
Процедура УстановитьРабочееМестоКлиента(РабочееМестоКлиента) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСеанса.РабочееМестоКлиента = РабочееМестоКлиента;
	ОбновитьПовторноИспользуемыеЗначения();

КонецПроцедуры

// Функция получает макет драйвера и сохраняет его во временное хранилище,
// возвращая ссылку на временное хранилище.
Функция ПолучитьМакетССервера(ИмяМакета) Экспорт
	
	Ссылка = ПоместитьВоВременноеХранилище(Справочники.ДрайверыОборудования.ПолучитьМакет(ИмяМакета));
	Возврат Ссылка;
	
КонецФункции

// Получает ссылку предопределенного элемента по его полному имени.
//
// Параметры:
//  ПолноеИмяПредопределенного - Строка - Имя предопределенного элемента.
//
// Возвращаемое значение:
//  СправочникСсылка.ПодключаемоеОборудование - Описание  
//
Функция ПредопределенныйЭлемент(Знач ПолноеИмяПредопределенного) Экспорт
	
	ИмяПредопределенного = ВРег(ПолноеИмяПредопределенного);
	
	Точка = Найти(ИмяПредопределенного, ".");
	ИмяКоллекции = Лев(ИмяПредопределенного, Точка - 1);
	ИмяПредопределенного = Сред(ИмяПредопределенного, Точка + 1);
	
	Точка = Найти(ИмяПредопределенного, ".");
	ИмяТаблицы = Лев(ИмяПредопределенного, Точка - 1);
	ИмяПредопределенного = Сред(ИмяПредопределенного, Точка + 1);
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1 Ссылка ИЗ &ПолноеИмяТаблицы ГДЕ ИмяПредопределенныхДанных = &ИмяПредопределенного";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяТаблицы", ИмяКоллекции + "." + ИмяТаблицы);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ИмяПредопределенного", ИмяПредопределенного);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		СправочникСсылка = Результат.Выгрузить(); // ТаблицаЗначений: *Ссылка - СправочникСсылка.ПодключаемоеОборудование - .
		СтрокаТаблицы = СправочникСсылка[0];// Структура - где: *Ссылка -  СправочникСсылка.ПодключаемоеОборудование - .
		Ссылка = СтрокаТаблицы.Ссылка;
		Возврат Ссылка;
	КонецЕсли;
	
КонецФункции

// Функция возвращает доступность сохранение данных пользователя.
//
Функция ПравоДоступаСохранениеДанныхПользователя() Экспорт
	
	Возврат ПравоДоступа("СохранениеДанныхПользователя", Метаданные);
	
КонецФункции

// Функция возвращает имя перечисления из его метаданных.
//
Функция ПолучитьИмяТипаОборудования(ТипОборудования) Экспорт

	Результат = Неопределено;
	
	МетаОбъект = ТипОборудования.Метаданные(); // ОбъектМетаданных
	Индекс = Перечисления.ТипыПодключаемогоОборудования.Индекс(ТипОборудования);
	Результат = МетаОбъект.ЗначенияПеречисления[Индекс]; // ОбъектМетаданных - 
	Имя = Результат.Имя;

	Возврат Имя;

КонецФункции

// Функция возвращает перечисление по имени.
//
Функция ПолучитьТипОборудования(ТипОборудованияИмя) Экспорт
	
	Попытка
		Результат = Перечисления["ТипыПодключаемогоОборудования"][ТипОборудованияИмя]; 
	Исключение
		Результат = Перечисления.ТипыПодключаемогоОборудования.ПустаяСсылка();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает Тип подключаемого оборудования по ссылке.
//
Функция ПолучитьТипПодключаемогоОборудования(ПодключаемоеОборудование) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПодключаемоеОборудование, "ТипОборудования");
	
КонецФункции

// Функция возвращает созданное рабочее место клиента.
//
// Параметры:
// 	Параметры - Структура - где:
// 	*ИдентификаторКлиента - УникальныйИдентификатор - Идентификатор
// 	*ИмяКомпьютера - Строка - Имя компьютера
// Возвращаемое значение:
// 	СправочникСсылка.РабочиеМеста - Описание
Функция СоздатьРабочееМестоКлиента(Параметры) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	РабочееМесто = Справочники.РабочиеМеста.СоздатьЭлемент();
	РабочееМесто.Код           = Параметры.ИдентификаторКлиента;
	РабочееМесто.ИмяКомпьютера = Параметры.ИмяКомпьютера;
	МенеджерОборудованияКлиентСервер.ЗаполнитьНаименованиеРабочегоМеста(РабочееМесто, ПользователиИнформационнойБазы.ТекущийПользователь());
	РабочееМесто.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РабочееМесто.Ссылка;

КонецФункции // СоздатьРабочееМестоКлиентаПоИД()

// Процедура устанавливает значения параметров сеанса, относящихся к подключаемому оборудованию.
//
Процедура УстановитьПараметрыСеансаПодключаемогоОборудования(ИмяПараметра, УстановленныеПараметры) Экспорт

	Если ИмяПараметра = "РабочееМестоКлиента" Тогда
		
		// Если с идентификатором клиента текущего сеанса связано одно рабочее место,
		// то его сразу и запишем в параметры сеанса.
		ТекущееРабочиеМесто = Справочники.РабочиеМеста.ПустаяСсылка();
		
		// СписокРабочиеМеста = НайтиРабочиеМестаПоИД(МенеджерОборудованияКлиентСервер.ИдентификаторКлиентаДляРабочегоМеста());
		// Если СписокРабочиеМеста.Количество() = 0 Тогда
		//	// Будет создано с клиента.
		// Иначе
		//	ТекущееРабочиеМесто = СписокРабочиеМеста[0];
		// КонецЕсли;
		
		УстановитьРабочееМестоКлиента(ТекущееРабочиеМесто);
		
		Если ТипЗнч(УстановленныеПараметры) = Тип("Структура") Тогда
			УстановленныеПараметры.Вставить("РабочееМестоКлиента");
		Иначе
			УстановленныеПараметры.Добавить("РабочееМестоКлиента");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает список оборудования для которого необходима переустановка компоненты.
//
// Параметры:
//  РабочееМесто - СправочникСсылка.РабочиеМеста - Описание.
//
// Возвращаемое значение:
//  Массив - Описание
Функция ДрайвераДляПереустановки(РабочееМесто) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Список = Новый Массив;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	ПодключаемоеОборудование.ДрайверОборудования
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.РабочееМесто = &РабочееМесто 
	|	И ПодключаемоеОборудование.ТребуетсяПереустановка");
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Строка = Новый Структура("ДрайверОборудования, ДанныеДрайвера", Выборка.ДрайверОборудования, ПолучитьДанныеДрайвера(Выборка.ДрайверОборудования)); 
		Список.Добавить(Строка);
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

// Возвращает список оборудования для которого необходима установка компоненты.
//
// Параметры:
//  РабочееМесто - СправочникСсылка.РабочиеМеста - Описание
//
// Возвращаемое значение:
//  Массив - Описание
//
Функция ДрайвераДляУстановки(РабочееМесто) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Список = Новый Массив;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	ПодключаемоеОборудование.ДрайверОборудования
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.РабочееМесто = &РабочееМесто 
	|	И ПодключаемоеОборудование.ТребуетсяУстановка");
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Строка = Новый Структура("ДрайверОборудования, ДанныеДрайвера", Выборка.ДрайверОборудования, ПолучитьДанныеДрайвера(Выборка.ДрайверОборудования)); 
		Список.Добавить(Строка);
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

// Записывает изменения в переданном объекте.
// Для использования в обработчиках обновления.
//
// Параметры:
//   Данные                            - Произвольный - объект, набор записей или менеджер константы, который
//                                                      необходимо записать.
//   РегистрироватьНаУзлахПлановОбмена - Булево       - включает регистрацию на узлах планов обмена при записи объекта.
//   ВключитьБизнесЛогику              - Булево       - включает бизнес-логику при записи объекта.
//
Процедура ЗаписатьДанные(Знач Данные, Знач РегистрироватьНаУзлахПлановОбмена = Ложь, 
	Знач ВключитьБизнесЛогику = Ложь) Экспорт
	
	Данные.ОбменДанными.Загрузка = Не ВключитьБизнесЛогику;
	Если Не РегистрироватьНаУзлахПлановОбмена Тогда
		Данные.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
		Данные.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	КонецЕсли;
	
	Данные.Записать();
	
КонецПроцедуры

// Устанавливает признак необходимости переустановки оборудования для подключаемого оборудования на рабочем месте.
//
Процедура УстановитьПризнакПереустановкиДрайвера(РабочееМесто, ДрайверОборудования, Признак) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ  
	|	ПодключаемоеОборудование.Ссылка
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.РабочееМесто = &РабочееМесто
	|	И ПодключаемоеОборудование.ДрайверОборудования = &ДрайверОборудования
	|	И НЕ ПодключаемоеОборудование.ТребуетсяПереустановка = &ТребуетсяПереустановка"); 
	
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	Запрос.УстановитьПараметр("ДрайверОборудования", ДрайверОборудования);
	Запрос.УстановитьПараметр("ТребуетсяПереустановка", Признак);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.ТребуетсяПереустановка = Признак;
		ЗаписатьДанные(СправочникОбъект)
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает признак необходимости переустановки оборудования для подключаемого оборудования.
//
Процедура УстановитьПризнакПереустановкиДрайвераДляОборудования(ПодключаемоеОборудование, Признак) Экспорт
	
	УстановитьПризнакПереустановкиДрайвера(ПодключаемоеОборудование.РабочееМесто, ПодключаемоеОборудование.ДрайверОборудования, Признак);
	
КонецПроцедуры

// Обновить установленные драйвера по справочнику подключаемого оборудования.
//
Процедура ОбновитьУстановленныеДрайвера(ТипОборудования) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
							|	ПодключаемоеОборудование.Ссылка
							|ИЗ
							|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
							|ГДЕ
							|	(ПодключаемоеОборудование.ТипОборудования = &ТипОборудования)");
							
	Запрос.УстановитьПараметр("ТипОборудования", ТипОборудования);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.ТребуетсяПереустановка = Истина;
		ЗаписатьДанные(СправочникОбъект)
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает признак необходимости установки оборудования для подключаемого оборудования на рабочем месте.
//
Процедура УстановитьПризнакУстановкиДрайвера(РабочееМесто, ДрайверОборудования, Признак) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	ПодключаемоеОборудование.Ссылка
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.РабочееМесто = &РабочееМесто
	|	И ПодключаемоеОборудование.ДрайверОборудования = &ДрайверОборудования
	|	И НЕ ПодключаемоеОборудование.ТребуетсяУстановка = &ТребуетсяУстановка"); 
	
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	Запрос.УстановитьПараметр("ДрайверОборудования", ДрайверОборудования);
	Запрос.УстановитьПараметр("ТребуетсяУстановка", Признак);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.ТребуетсяУстановка = Признак;
		ЗаписатьДанные(СправочникОбъект)
	КонецЦикла;
	
КонецПроцедуры

// Сохраняет пользовательские настройки подключаемого оборудования.
//
Процедура СохранитьПользовательскиеНастройкиПодключаемогоОборудования(СписокНастроек) Экспорт
		
	Если НЕ ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Элемент Из СписокНастроек Цикл
		ХранилищеОбщихНастроек.Сохранить("ПользовательскиеНастройкиПодключаемогоОборудования", Элемент.Ключ, Элемент.Значение);
	КонецЦикла;  
		
	ОбновитьПовторноИспользуемыеЗначения();

КонецПроцедуры

// Функция возвращает типы используемого оборудования для текущего рабочего места.
// 
Функция ТипыИспользуемогоОборудованияТекущегоРабочегоМеста()  Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	
	Если ЗначениеЗаполнено(РабочееМесто) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПодключаемоеОборудование.ТипОборудования КАК ТипОборудования
		|ИЗ
		|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|ГДЕ
		|	ПодключаемоеОборудование.УстройствоИспользуется
		|	И ПодключаемоеОборудование.РабочееМесто = &РабочееМесто");
		
		Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
		
		Результат = Запрос.Выполнить();
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("ТипОборудования");
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Производит разложение данных дорожек магнитной карты по шаблонам.   
//
// На входе:
// ДанныеДорожек - массив строк. Значения полученные из дорожек.
// ПараметрыДорожек - массив структур содержащих параметры настройки устройства.
//  * Использовать, булево - признак использования дорожки.
//  * НомерДорожки, число - порядковый номер дорожки 1-3.
//
// На выходе:
// Массив структур содержащих расшифрованные данные по всем подходящим шаблонам со ссылкой на них.
// * Массив - шаблоны
//   * Структура - данные шаблона.
//     - Шаблон, СправочникСсылка.ШаблоныМагнитныхКарт
//     - ДанныеДорожек, массив полей всех дорожек.
//       * Структура - данные поля.
//         - Поле
//         - ЗначениеПоля
Функция РасшифроватьКодМагнитнойКарты(ДанныеДорожек, ПараметрыДорожек) Экспорт
	
	Возврат Справочники.ШаблоныМагнитныхКарт.РасшифроватьКодМагнитнойКарты(ДанныеДорожек, ПараметрыДорожек);
	
КонецФункции

// Получить описание драйвера XML пакета.
//
Функция ПолучитьОписаниеДрайвера(Данные) Экспорт
	
	Параметры = Новый Структура();
	Параметры.Вставить("НаименованиеДрайвера");
	Параметры.Вставить("ОписаниеДрайвера");
	Параметры.Вставить("ТипОборудования");
	Параметры.Вставить("ВерсияДрайвера");
	Параметры.Вставить("ВерсияИнтеграционногоКомпонента");
	Параметры.Вставить("ИнтеграционныйКомпонент");
	Параметры.Вставить("ОсновнойДрайверУстановлен");
	Параметры.Вставить("URLЗагрузкиДрайвера");

	
	Если Не ПустаяСтрока(Данные) Тогда
		ЧтениеXML = Новый ЧтениеXML; 
		ЧтениеXML.УстановитьСтроку(Данные);
		ЧтениеXML.ПерейтиКСодержимому();
		Если ЧтениеXML.Имя = "DriverDescription" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			НаименованиеДрайвера      = ЧтениеXML.ЗначениеАтрибута("Name");
			ОписаниеДрайвера          = ЧтениеXML.ЗначениеАтрибута("Description");
			ТипОборудования           = ЧтениеXML.ЗначениеАтрибута("EquipmentType");
			ВерсияДрайвера            = ЧтениеXML.ЗначениеАтрибута("DriverVersion");
			ВерсияИнтеграционногоКомпонента = ЧтениеXML.ЗначениеАтрибута("IntegrationComponentVersion");
			ИнтеграционныйКомпонент   = ВРег(ЧтениеXML.ЗначениеАтрибута("IntegrationComponent")) = "TRUE";
			ОсновнойДрайверУстановлен = ВРег(ЧтениеXML.ЗначениеАтрибута("MainDriverInstalled")) = "TRUE";
			URLЗагрузкиДрайвера       = ЧтениеXML.ЗначениеАтрибута("DownloadURL");
			Параметры.НаименованиеДрайвера = НаименованиеДрайвера;
			Параметры.ОписаниеДрайвера = ОписаниеДрайвера;
			Параметры.ТипОборудования = ТипОборудования;
			Параметры.ВерсияДрайвера = ВерсияДрайвера;
			Параметры.ВерсияИнтеграционногоКомпонента = ВерсияИнтеграционногоКомпонента;
			Параметры.ИнтеграционныйКомпонент = ИнтеграционныйКомпонент;
			Параметры.ОсновнойДрайверУстановлен = ОсновнойДрайверУстановлен;
			Параметры.URLЗагрузкиДрайвера = URLЗагрузкиДрайвера;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

#Область ПрограммныйИнтерфейсТСД   

// Получить таблицу товаров из XML структуры для ТСД.
//
// Возвращаемое значение
//  Массив
//
Функция ТоварыТСД(ДанныеЗагрузки, АлкогольнаяПродукция) Экспорт
	
	Результат = Новый Массив();
	
	АлкогольнаяПродукция = Ложь;
	
	Если НЕ ПустаяСтрока(ДанныеЗагрузки) Тогда
		
		ЧтениеXML = Новый ЧтениеXML; 
		ЧтениеXML.УстановитьСтроку(ДанныеЗагрузки);
		ЧтениеXML.ПерейтиКСодержимому();
		
		Если ЧтениеXML.Имя = "Table" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
			Пока ЧтениеXML.Прочитать() Цикл  
				Если ЧтениеXML.Имя = "Record" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
					ПозицияДанных = Новый Структура();
					
					Штрихкод = ЧтениеXML.ЗначениеАтрибута("BarCode");
					ШтрихкодBase64 = ЧтениеXML.ЗначениеАтрибута("BarCodeBase64");
					ШтрихкодУпаковки = ЧтениеXML.ЗначениеАтрибута("ContainerBarcode");
					ШтрихкодУпаковкиBase64 = ЧтениеXML.ЗначениеАтрибута("ContainerBarcodeBase64");
					
					Если Не ПустаяСтрока(ШтрихкодBase64) Тогда
						Штрихкод = Base64ВШтрихкод(ШтрихкодBase64);
					КонецЕсли;
					Если Не ПустаяСтрока(ШтрихкодУпаковкиBase64) Тогда
						ШтрихкодУпаковки = Base64ВШтрихкод(ШтрихкодУпаковкиBase64);
					КонецЕсли;
					
					ПозицияДанных.Вставить("Штрихкод"  , Штрихкод);
					ПозицияДанных.Вставить("Количество", ЧтениеXML.ЗначениеАтрибута("Quantity"));
					ПозицияДанных.Вставить("ШтрихкодУпаковки", ШтрихкодУпаковки);
					
					// Атрибуты для поддержки интеграции с ЕГАИС.
					ШтрихкодМаркиАлкогольнойПродукции = ЧтениеXML.ЗначениеАтрибута("AlcoholExciseStamp");
					Если Не ПустаяСтрока(ШтрихкодМаркиАлкогольнойПродукции) Тогда
						АлкогольнаяПродукция = Истина;
					КонецЕсли;
						
					ПозицияДанных.Вставить("ШтрихкодМаркиАлкогольнойПродукции", ШтрихкодМаркиАлкогольнойПродукции);
					ПозицияДанных.Вставить("НаименованиеАлкогольнойПродукции" , ЧтениеXML.ЗначениеАтрибута("AlcoholName"));
					ПозицияДанных.Вставить("СерийныйНомерАлкогольнойПродукции", ЧтениеXML.ЗначениеАтрибута("AlcoholSerialNumber"));
					ПозицияДанных.Вставить("КодВидаАлкогольнойПродукции", ЧтениеXML.ЗначениеАтрибута("AlcoholKindCode"));
					ПозицияДанных.Вставить("КодАлкогольнойПродукции"    , ЧтениеXML.ЗначениеАтрибута("AlcoholCode"));
					ПозицияДанных.Вставить("ЕмкостьТары"                , ЧтениеXML.ЗначениеАтрибута("AlcoholContainerSize"));
					ПозицияДанных.Вставить("Крепость"                   , ЧтениеXML.ЗначениеАтрибута("AlcoholStrength"));
					ПозицияДанных.Вставить("ИННПроизводителя"           , ЧтениеXML.ЗначениеАтрибута("VendorINNCode"));
					ПозицияДанных.Вставить("КПППроизводителя"           , ЧтениеXML.ЗначениеАтрибута("VendorKPPCode"));
					Результат.Добавить(ПозицияДанных);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Сформировать таблицу товаров в XML структуре для ТСД.
//
// Параметры:
//  ДанныеЗагрузки - Массив Из Структура - Данные загрузки:
//    * Наименование - Строка - Наименование позиции
//  ПолнаяВыгрузка - Булево - Полная выгрузка
//  РевизияИнтерфейса - Число - Ревизия интерфейса
// 
// Возвращаемое значение:
//  Строка - Сформировать таблицу товаров ТСД
Функция СформироватьТаблицуТоваровТСД(ДанныеЗагрузки, ПолнаяВыгрузка, РевизияИнтерфейса = 0) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Table");
	ЗаписьXML.ЗаписатьАтрибут("FullLoad", XMLСтрока(ПолнаяВыгрузка));
	
	Для Каждого Позиция Из ДанныеЗагрузки  Цикл
		
		НаименованиеНоменклатуры = "";
		Если Позиция.Свойство("Номенклатура") Тогда
			НаименованиеНоменклатуры = Строка(Позиция.Номенклатура);
		КонецЕсли;
		Если ПустаяСтрока(НаименованиеНоменклатуры) И Позиция.Свойство("Наименование") Тогда
			НаименованиеНоменклатуры = Позиция.Наименование;
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Record");
		Если РевизияИнтерфейса >= 3003 Тогда
			
			Если Позиция.Свойство("ШтрихкодBase64") И Не ПустаяСтрока(Позиция.ШтрихкодBase64) Тогда
				ШтрихкодBase64 = Позиция.ШтрихкодBase64
			Иначе
				ШтрихкодBase64 = ШтрихкодВBase64(Позиция.Штрихкод)
			КонецЕсли;
			ЗаписьXML.ЗаписатьАтрибут("BarCodeBase64" , XMLСтрока(ШтрихкодBase64));
			
			Если Позиция.Свойство("ШтрихкодУпаковкиBase64") И Не ПустаяСтрока(Позиция.ШтрихкодУпаковкиBase64) Тогда
				ШтрихкодУпаковкиBase64 = Позиция.ШтрихкодУпаковкиBase64
			ИначеЕсли Позиция.Свойство("ШтрихкодУпаковки") И Не ПустаяСтрока(Позиция.ШтрихкодУпаковки) Тогда
				ШтрихкодУпаковкиBase64 = ШтрихкодВBase64(Позиция.ШтрихкодУпаковки);
			КонецЕсли;
			Если Не ПустаяСтрока(ШтрихкодУпаковкиBase64) Тогда 
			ЗаписьXML.ЗаписатьАтрибут("ContainerBarcodeBase64", XMLСтрока(ШтрихкодУпаковкиBase64));
			КонецЕсли; 
			
		Иначе
			ЗаписьXML.ЗаписатьАтрибут("BarCode"         , XMLСтрока(?(Позиция.Свойство("Штрихкод"), Позиция.Штрихкод, "")));
			Если Позиция.Свойство("ШтрихкодУпаковки") И Не ПустаяСтрока(Позиция.ШтрихкодУпаковки) Тогда
				ЗаписьXML.ЗаписатьАтрибут("ContainerBarcode", XMLСтрока(Позиция.Свойство("ШтрихкодУпаковки")));
			КонецЕсли;
		КонецЕсли;
		ЗаписьXML.ЗаписатьАтрибут("Name" , XMLСтрока(НаименованиеНоменклатуры));
		ЗаписьXML.ЗаписатьАтрибут("UnitOfMeasurement"            , XMLСтрока(?(Позиция.Свойство("ЕдиницаИзмерения"), Позиция.ЕдиницаИзмерения, "")));
		ЗаписьXML.ЗаписатьАтрибут("CharacteristicOfNomenclature" , XMLСтрока(?(Позиция.Свойство("ХарактеристикаНоменклатуры"), Позиция.ХарактеристикаНоменклатуры, "")));
		ЗаписьXML.ЗаписатьАтрибут("SeriesOfNomenclature"         , XMLСтрока(?(Позиция.Свойство("СерияНоменклатуры"), Позиция.СерияНоменклатуры, "")));
		ЗаписьXML.ЗаписатьАтрибут("Quality"                      , XMLСтрока(?(Позиция.Свойство("Качество")  , Позиция.Качество, "")));
		ЗаписьXML.ЗаписатьАтрибут("Price"                        , XMLСтрока(?(Позиция.Свойство("Цена")      , Позиция.Цена, 0)));
		ЗаписьXML.ЗаписатьАтрибут("Quantity"                     , XMLСтрока(?(Позиция.Свойство("Количество"), Позиция.Количество, 0)));
		ЗаписьXML.ЗаписатьАтрибут("Article"                      , XMLСтрока(?(Позиция.Свойство("Артикул")   , Позиция.Артикул, "")));
		Алкоголь = ?(Позиция.Свойство("Алкоголь"), Позиция.Алкоголь, Ложь);
		ЗаписьXML.ЗаписатьАтрибут("Alcohol", XMLСтрока(Алкоголь));
		Если Алкоголь = Истина Тогда
			ЗаписьXML.ЗаписатьАтрибут("AlcoholExcisable"     , XMLСтрока(?(Позиция.Свойство("Маркируемый")                , Позиция.Маркируемый, Ложь)));
			ЗаписьXML.ЗаписатьАтрибут("AlcoholKindCode"      , XMLСтрока(?(Позиция.Свойство("КодВидаАлкогольнойПродукции"), Позиция.КодВидаАлкогольнойПродукции, "")));
			ЗаписьXML.ЗаписатьАтрибут("AlcoholCode"          , XMLСтрока(?(Позиция.Свойство("КодАлкогольнойПродукции")    , Позиция.КодАлкогольнойПродукции, "")));
			ЗаписьXML.ЗаписатьАтрибут("AlcoholContainerSize" , XMLСтрока(?(Позиция.Свойство("ЕмкостьТары")                , Позиция.ЕмкостьТары, Неопределено)));
			ЗаписьXML.ЗаписатьАтрибут("AlcoholStrength"      , XMLСтрока(?(Позиция.Свойство("Крепость")                   , Позиция.Крепость, Неопределено)));
			ЗаписьXML.ЗаписатьАтрибут("VendorINNCode"        , XMLСтрока(?(Позиция.Свойство("ИННПроизводителя")           , Позиция.ИННПроизводителя, Неопределено)));
			ЗаписьXML.ЗаписатьАтрибут("VendorKPPCode"        , XMLСтрока(?(Позиция.Свойство("КПППроизводителя")           , Позиция.КПППроизводителя, Неопределено)));
			Если РевизияИнтерфейса >= 3003 Тогда
				Если Позиция.Свойство("ШтрихкодМаркиАлкогольнойПродукцииBase64") И Не ПустаяСтрока(Позиция.ШтрихкодМаркиАлкогольнойПродукцииBase64) Тогда
					ШтрихкодМаркиАлкогольнойПродукцииBase64 = Позиция.ШтрихкодМаркиАлкогольнойПродукцииBase64
				Иначе
					ШтрихкодМаркиАлкогольнойПродукцииBase64 = ШтрихкодВBase64(Позиция.ШтрихкодМаркиАлкогольнойПродукции)
				КонецЕсли;
				ЗаписьXML.ЗаписатьАтрибут("AlcoholExciseStampBase64", XMLСтрока(ШтрихкодМаркиАлкогольнойПродукцииBase64));
			Иначе
				ЗаписьXML.ЗаписатьАтрибут("AlcoholExciseStamp", XMLСтрока(?(Позиция.Свойство("ШтрихкодМаркиАлкогольнойПродукции") , Позиция.ШтрихкодМаркиАлкогольнойПродукции, Неопределено)));
			КонецЕсли;
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

// Сформировать XML пакеты товаров для загрузки ТСД.
//
Функция ПодготовитьПакетыДляЗагрузкиТСД(ТаблицаВыгрузки, РазмерПакета, ПолнаяВыгрузка) Экспорт
	
	ПакетыДляВыгрузки = Новый Массив();
	МассивТоваров = Новый Массив;
	
	ЗаписьВПакете    = 0;
	ЗаписейВыгружено = 0;
	ЗаписейВсего     = ТаблицаВыгрузки.Количество();
	
	Для Каждого Позиция Из ТаблицаВыгрузки  Цикл
		
		Если ЗаписьВПакете = 0 Тогда
		    МассивТоваров.Очистить();
		КонецЕсли;
		МассивТоваров.Добавить(Позиция);
		
		ЗаписейВыгружено  = ЗаписейВыгружено + 1;
		ЗаписьВПакете = ЗаписьВПакете + 1;
		
		Если (ЗаписьВПакете = РазмерПакета) ИЛИ (ЗаписейВыгружено = ЗаписейВсего) Тогда  
			ДанныеДляВыгрузки = СформироватьТаблицуТоваровТСД(МассивТоваров, ПолнаяВыгрузка);
			ПакетыДляВыгрузки.Добавить(ДанныеДляВыгрузки);
			ЗаписьВПакете = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПакетыДляВыгрузки;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейсВесыСПечатьюЭтикеток  

// Сформировать таблицу товаров в XML структуре для весов с печатью этикеток.
//
Функция СформироватьТаблицуТоваровВесыСПечатьюЭтикеток(ДанныеЗагрузки) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Table");
	Для Каждого Позиция Из ДанныеЗагрузки  Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Record");
		ЗаписьXML.ЗаписатьАтрибут("PLU"          , XMLСтрока(Позиция[0].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Code"         , XMLСтрока(Позиция[1].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Name"         , XMLСтрока(Позиция[2].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Price"        , XMLСтрока(Позиция[3].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Description"  , XMLСтрока(Позиция[4].Значение));
		ЗаписьXML.ЗаписатьАтрибут("ShelfLife"    , XMLСтрока(Позиция[5].Значение));
		ЗаписьXML.ЗаписатьАтрибут("IsWeightGoods", XMLСтрока(Позиция[6].Значение));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
		
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

// Сформировать XML пакеты товаров для загрузки ТСД.
//      
Функция ПодготовитьПакетыДляЗагрузкиВВесыСПечатьюЭтикеток(ТаблицаВыгрузки, РазмерПакета) Экспорт
	
	ПакетыДляВыгрузки = Новый Массив();
	МассивТоваров = Новый Массив;
	
	ЗаписьВПакете    = 0;
	ЗаписейВыгружено = 0;
	ЗаписейВсего     = ТаблицаВыгрузки.Количество();
	
	Для Каждого Позиция Из ТаблицаВыгрузки  Цикл
		
		Если ЗаписьВПакете = 0 Тогда
		    МассивТоваров.Очистить();
		КонецЕсли;
		
		ВремНаименование = ?(Позиция.Свойство("Номенклатура"), Позиция.Номенклатура, "");
		ВремНаименование = ?(Позиция.Свойство("Наименование"), Позиция.Наименование, ВремНаименование);
		Если Позиция.Свойство("НаименованиеПолное") И Не ПустаяСтрока(Позиция.НаименованиеПолное) Тогда
			ВремНаименование = Позиция.НаименованиеПолное;
		КонецЕсли;
		
		СтрокаМассиваТоваров = Новый СписокЗначений; 
		СтрокаМассиваТоваров.Добавить(Число(Позиция.PLU));
		СтрокаМассиваТоваров.Добавить(Число(Позиция.Код));
		СтрокаМассиваТоваров.Добавить(ВремНаименование);
		СтрокаМассиваТоваров.Добавить(?(Позиция.Свойство("Цена"), Позиция.Цена, 0));
		СтрокаМассиваТоваров.Добавить(?(Позиция.Свойство("ОписаниеТовара"), Позиция.ОписаниеТовара, ""));
		СтрокаМассиваТоваров.Добавить(?(Позиция.Свойство("СрокХранения"), Позиция.СрокХранения, 0));
		СтрокаМассиваТоваров.Добавить(?(Позиция.Свойство("ВесовойТовар"), Позиция.ВесовойТовар, Истина));
		МассивТоваров.Добавить(СтрокаМассиваТоваров);
		
		ЗаписейВыгружено  = ЗаписейВыгружено + 1;
		ЗаписьВПакете = ЗаписьВПакете + 1;
		
		Если (ЗаписьВПакете = РазмерПакета) ИЛИ (ЗаписейВыгружено = ЗаписейВсего) Тогда  
			ДанныеДляВыгрузки = СформироватьТаблицуТоваровВесыСПечатьюЭтикеток(МассивТоваров);
			ПакетыДляВыгрузки.Добавить(ДанныеДляВыгрузки);
			ЗаписьВПакете = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПакетыДляВыгрузки;
	
КонецФункции

#КонецОбласти

// Получить таблицу меток RFID.
//
// Возвращаемое значение
//  Массив
// 
Функция МеткиRFID(ДанныеМеток) Экспорт
	
	Результат = Новый Массив();
	
	ЧтениеXML = Новый ЧтениеXML; 
	ЧтениеXML.УстановитьСтроку(ДанныеМеток);
	ЧтениеXML.ПерейтиКСодержимому();
	
	Если ЧтениеXML.Имя = "Table" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
		Пока ЧтениеXML.Прочитать() Цикл  
			Если ЧтениеXML.Имя = "Tag" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
				
				// Получение банков памяти считанной метки.
				TID = ЧтениеXML.ЗначениеАтрибута("TID");
				EPC = ЧтениеXML.ЗначениеАтрибута("EPC");
				USER = ЧтениеXML.ЗначениеАтрибута("USER");
				// Декодирование банка EPC по формату SGTIN.  
				ПозицияДанных = МенеджерОборудованияКлиентСервер.ДекодированиеДанныхSGTIN(EPC);
				ПозицияДанных.Вставить("TID" , TID);  // Добавляем в структура значения TID чипа метки.
				ПозицияДанных.Вставить("USER", USER); // Добавляем в структура значения банка USER.
				ПозицияДанных.Вставить("UserMemory", МенеджерОборудованияКлиентСервер.ПреобразоватьHEXВСтроку(USER));
				
				Результат.Добавить(ПозицияДанных);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция получает значение атрибута текущего элемента.
//
Функция ПрочитатьАтрибут(ЧтениеXML, ИмяАтрибута, ЗначениеАтрибута)
	
	Значение = ЧтениеXML.ЗначениеАтрибута(ИмяАтрибута);
	
	Если Значение = Неопределено Тогда
		ЗначениеАтрибута = Неопределено;
		Возврат Ложь;
	Иначе
		ЗначениеАтрибута = XMLЗначение(Тип("Строка"), Значение);
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ПрочитатьЭлементXML(ЧтениеXML, ТекстСообщенияОбОшибке)
	
	Попытка
		Результат = ЧтениеXML.Прочитать();
	Исключение
		ТекстСообщенияОбОшибке = НСтр("ru='При чтении XML-описания макета произошла ошибка.'");
		Результат = Ложь;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Процедура записывает значение атрибута текущего элемента.
//
Процедура ЗаписатьАтрибутЭлемента(ЗаписьXML, ИмяАтрибута, ЗначениеАтрибута, ФорматнаяСтрока="ЧРД=.; ЧН=0; ЧГ=0; БЛ=false; БИ=true")
	
	Если ЗначениеЗаполнено(ЗначениеАтрибута) ИЛИ ТипЗнч(ЗначениеАтрибута)=Тип("Число") ИЛИ ИмяАтрибута="Value" Тогда
		ЗаписьXML.ЗаписатьАтрибут(ИмяАтрибута, XMLСтрока(Формат(ЗначениеАтрибута, ФорматнаяСтрока)));
	КонецЕсли;
	
КонецПроцедуры

// Функция формирует структуру с описанием макета.
//
// Параметры:
//  Источник - Строка - источник события.
//  СообщениеОбОшибке - Строка - сообщение пользователю об ошибке
//  Результат - см. СоздатьОписаниеМакета
// Возвращаемое значение:
// 	Булево - результат выполнения операции.
//
Функция ПолучитьОписаниеМакета(Источник, СообщениеОбОшибке, Результат) Экспорт
	
	Результат = СоздатьОписаниеМакета();
	
	ЧтениеXML = Новый ЧтениеXML();
	ПараметрыЧтения = Новый ПараметрыЧтенияXML("1.0");
	ЧтениеXML.УстановитьСтроку(Источник, ПараметрыЧтения);
	
	ШаблонСообщенияОбОшибке = НСтр("ru='При чтении файла атрибута %1 элемента %2 произошла ошибка.'");
	ТекстСообщенияОбОшибке = "";
	
	Пока ПрочитатьЭлементXML(ЧтениеXML, ТекстСообщенияОбОшибке) Цикл
		
		ЗначениеАтрибута = Неопределено;
		Если ЧтениеXML.Имя="Formatting" И ЧтениеXML.ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда
			
			Если ПрочитатьАтрибут(ЧтениеXML, "Width", ЗначениеАтрибута) Тогда
				Результат.Ширина = Число(ЗначениеАтрибута);
			Иначе
				СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "Width", "Formatting");
				Возврат Ложь;
			КонецЕсли;
			
			Если ПрочитатьАтрибут(ЧтениеXML, "Height", ЗначениеАтрибута) Тогда
				Результат.Вставить("Высота", Число(ЗначениеАтрибута));
			Иначе
				СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "Height", "Formatting");
				Возврат Ложь;
			КонецЕсли;
			
			Если ПрочитатьАтрибут(ЧтениеXML, "Orientation", ЗначениеАтрибута) Тогда
				Результат.Вставить("Ориентация", Число(ЗначениеАтрибута));
			Иначе
				Результат.Вставить("Ориентация", 0);
			КонецЕсли;
			
			Если ПрочитатьАтрибут(ЧтениеXML, "Scale", ЗначениеАтрибута) Тогда
				Результат.Вставить("Масштаб", Число(ЗначениеАтрибута));
			Иначе
				Результат.Вставить("Масштаб", 1);
			КонецЕсли;
			
		ИначеЕсли (ЧтениеXML.Имя="Text" ИЛИ ЧтениеXML.Имя="Barcode" ИЛИ ЧтениеXML.Имя="Image" ИЛИ ЧтениеXML.Имя="UserData") И ЧтениеXML.ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда
			
			НовоеПоле = Новый Структура;
			НовоеПоле.Вставить("Тип", ЧтениеXML.Имя);
			
			Если ПрочитатьАтрибут(ЧтениеXML, "FieldName", ЗначениеАтрибута) Тогда
				НовоеПоле.Вставить("Наименование", ЗначениеАтрибута);
			Иначе
				СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "FieldName", "UserData");
				Возврат Ложь;
			КонецЕсли;
			
			Если ПрочитатьАтрибут(ЧтениеXML, "TypeFill", ЗначениеАтрибута) Тогда
				
				Если ЗначениеАтрибута=Неопределено Тогда
					СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "TypeFill", "UserData");
					Возврат Ложь;
				КонецЕсли;
				
				НовоеПоле.Вставить("ТипЗаполнения", ЗначениеАтрибута);
				
				Если ЗначениеАтрибута="Parameter" Тогда
					
					Если ПрочитатьАтрибут(ЧтениеXML, "ValueDefault", ЗначениеАтрибута) Тогда
						НовоеПоле.Вставить("ЗначениеПоУмолчанию", ЗначениеАтрибута);
					КонецЕсли;
					
					Если ПрочитатьАтрибут(ЧтениеXML, "Value", ЗначениеАтрибута) Тогда
						Если ЗначениеАтрибута=Неопределено Тогда
							СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "Value", "UserData");
							Возврат Ложь;
						Иначе
							НовоеПоле.Вставить("Значение", ЗначениеАтрибута);
						КонецЕсли;
					Иначе
						СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "Value", "UserData");
						Возврат Ложь;
					КонецЕсли;
				Иначе
					Если ПрочитатьАтрибут(ЧтениеXML, "Value", ЗначениеАтрибута) Тогда
						НовоеПоле.Вставить("Значение", ЗначениеАтрибута);
					КонецЕсли;
				КонецЕсли;
			Иначе
				СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "TypeFill", "UserData");
				Возврат Ложь;
			КонецЕсли;
			
			Если НовоеПоле.Тип<>"UserData" Тогда
				
				Если ПрочитатьАтрибут(ЧтениеXML, "Left", ЗначениеАтрибута) Тогда
					НовоеПоле.Вставить("Лево", Число(ЗначениеАтрибута));
				Иначе
					СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "Left", "Text");
					Возврат Ложь;
				КонецЕсли;
				
				Если ПрочитатьАтрибут(ЧтениеXML, "Top", ЗначениеАтрибута) Тогда
					НовоеПоле.Вставить("Верх", Число(ЗначениеАтрибута));
				Иначе
					СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "Top", "Text");
					Возврат Ложь;
				КонецЕсли;
				
				Если ПрочитатьАтрибут(ЧтениеXML, "Width", ЗначениеАтрибута) Тогда
					НовоеПоле.Вставить("Право", НовоеПоле.Лево + Число(ЗначениеАтрибута) - 1);
				Иначе
					СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "Width", "Text");
					Возврат Ложь;
				КонецЕсли;
				
				Если ПрочитатьАтрибут(ЧтениеXML, "Height", ЗначениеАтрибута) Тогда
					НовоеПоле.Вставить("Низ", НовоеПоле.Верх + Число(ЗначениеАтрибута) - 1);
				Иначе
					СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "Height", "Text");
					Возврат Ложь;
				КонецЕсли;
				
				Если ПрочитатьАтрибут(ЧтениеXML, "Orientation", ЗначениеАтрибута) Тогда
					НовоеПоле.Вставить("Ориентация", Число(ЗначениеАтрибута));
				КонецЕсли;
				
				Если НовоеПоле.Тип="Text" Тогда
					
					Если ПрочитатьАтрибут(ЧтениеXML, "FontName", ЗначениеАтрибута) Тогда
						НовоеПоле.Вставить("ИмяШрифта", ЗначениеАтрибута);
					КонецЕсли;
					
					Если ПрочитатьАтрибут(ЧтениеXML, "FontSize", ЗначениеАтрибута) Тогда
						НовоеПоле.Вставить("РазмерШрифта", Число(ЗначениеАтрибута));
					Иначе
						СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "FontSize", "Text");
						Возврат Ложь;
					КонецЕсли;
					
					Если ПрочитатьАтрибут(ЧтениеXML, "FontStyle", ЗначениеАтрибута) Тогда
						ЗначениеСтильШрифта = ЗначениеАтрибута;
						НовоеПоле.Вставить("Жирный", Найти(ЗначениеСтильШрифта, "Bold")>0);
						НовоеПоле.Вставить("Наклонный", Найти(ЗначениеСтильШрифта, "Italic")>0);
						НовоеПоле.Вставить("Подчеркивание",  Найти(ЗначениеСтильШрифта, "Underline")>0);
						НовоеПоле.Вставить("Зачеркивание", Найти(ЗначениеСтильШрифта, "Strikeout")>0);
					КонецЕсли;
					
					Если ПрочитатьАтрибут(ЧтениеXML, "Align", ЗначениеАтрибута) Тогда
						НовоеПоле.Вставить("ПоложениеПоГоризонтали", ЗначениеАтрибута);
					КонецЕсли;
					
					Если ПрочитатьАтрибут(ЧтениеXML, "VAlign", ЗначениеАтрибута) Тогда
						НовоеПоле.Вставить("ПоложениеПоВертикали", ЗначениеАтрибута);
					КонецЕсли;
					
					Если ПрочитатьАтрибут(ЧтениеXML, "Multiline", ЗначениеАтрибута) Тогда
						НовоеПоле.Вставить("Многострочность", ЗначениеАтрибута);
					КонецЕсли;
					
				ИначеЕсли НовоеПоле.Тип="Barcode" Тогда
					
					Если ПрочитатьАтрибут(ЧтениеXML, "Type", ЗначениеАтрибута) Тогда
						НовоеПоле.Вставить("ТипШтрихкода", ЗначениеАтрибута);
					Иначе
						СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "Type", "Barcode");
						Возврат Ложь;
					КонецЕсли;
					
					Если ПрочитатьАтрибут(ЧтениеXML, "PrintHRI", ЗначениеАтрибута) Тогда
						НовоеПоле.Вставить("ПодписьШтрихкода", ЗначениеАтрибута);
						ПодписьШтрихкода = ЗначениеАтрибута;
					Иначе
						ПодписьШтрихкода = Истина;
					КонецЕсли;
					
					Если ПрочитатьАтрибут(ЧтениеXML, "FontSize", ЗначениеАтрибута) Тогда
						Если ПодписьШтрихкода И ЗначениеАтрибута=Неопределено Тогда
							СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "FontSize", "Barcode");
							ШаблонДополнение = НСтр("ru='При значении атрибута %1 = %2 указание значения атрибута %3 обязательно.'");
							СообщениеОбОшибке = СообщениеОбОшибке + Символы.НПП + СтрШаблон(ШаблонДополнение, "PrintHRI", "True", "FontSize");
							Возврат Ложь;
						КонецЕсли;
						НовоеПоле.Вставить("РазмерШрифтаПодписи", Число(ЗначениеАтрибута));
					КонецЕсли;
					
					Если ПрочитатьАтрибут(ЧтениеXML, "CheckSymbol", ЗначениеАтрибута) Тогда
						НовоеПоле.Вставить("КонтрольныйСимвол", ЗначениеАтрибута);
					КонецЕсли;
					
				КонецЕсли;
				
				Если НовоеПоле.Тип = "Text" ИЛИ НовоеПоле.Тип = "Image" Тогда
					
					Если ПрочитатьАтрибут(ЧтениеXML, "Border", ЗначениеАтрибута) Тогда
						ЗначениеBorder = ЗначениеАтрибута;
						НовоеПоле.Вставить("РамкаСлева", Найти(ЗначениеBorder, "Left")>0);
						НовоеПоле.Вставить("РамкаСверху", Найти(ЗначениеBorder, "Top")>0);
						НовоеПоле.Вставить("РамкаСправа",  Найти(ЗначениеBorder, "Right")>0);
						НовоеПоле.Вставить("РамкаСнизу", Найти(ЗначениеBorder, "Bottom")>0);
						Если ЗначениеЗаполнено(ЗначениеBorder) Тогда
							Если ПрочитатьАтрибут(ЧтениеXML, "BorderStyle", ЗначениеАтрибута) Тогда
								НовоеПоле.Вставить("ТипРамки", ЗначениеАтрибута);
							КонецЕсли;
							Если ПрочитатьАтрибут(ЧтениеXML, "BorderWidth", ЗначениеАтрибута) Тогда
								НовоеПоле.Вставить("ТолщинаРамки", Число(ЗначениеАтрибута));
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если НовоеПоле.Тип="UserData" ИЛИ НовоеПоле.Тип="Text" Тогда
				Если ПрочитатьАтрибут(ЧтениеXML, "Format", ЗначениеАтрибута) Тогда
					НовоеПоле.Вставить("Формат", ЗначениеАтрибута);
				КонецЕсли;
			КонецЕсли;
			Результат.Поля.Добавить(НовоеПоле);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстСообщенияОбОшибке) Тогда
		СообщениеОбОшибке = ТекстСообщенияОбОшибке;
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

// Создает описание макета.
// 
// Возвращаемое значение:
// Структура - структура с полями:
//  * Поля - Массив - массив полей.
//  * Ширина - Число - ширина макета.
//  * Высота - Число - высота макета.
//  * Ориентация - Число - ориентация макета.
//  * Масштаб - Число - масштаб.
//
Функция СоздатьОписаниеМакета() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Поля", Новый Массив);
	Результат.Вставить("Ширина", 0);
	Результат.Вставить("Высота", 0);
	Результат.Вставить("Ориентация", 0);
	Результат.Вставить("Масштаб", 0);
	
	Возврат Результат;
	
КонецФункции

// Функция формирует текст XML для передачи его принтеру этикеток.
//
Функция СформироватьДанныеДляПринтераЭтикеток(МассивЭтикеток, МакетЭтикетки, РевизияИнтерфейса = 0) Экспорт
	
	ФорматыПолей = Новый Структура;
	
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();

	ЗаписьXML.ЗаписатьНачалоЭлемента("Data");

	Если ЗначениеЗаполнено(МакетЭтикетки) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Formatting");

		Если МакетЭтикетки.Ориентация = 0 ИЛИ МакетЭтикетки.Ориентация = 180 Тогда
			ЗаписатьАтрибутЭлемента(ЗаписьXML, "Width", МакетЭтикетки.Ширина);
			ЗаписатьАтрибутЭлемента(ЗаписьXML, "Height", МакетЭтикетки.Высота);
		Иначе
			ЗаписатьАтрибутЭлемента(ЗаписьXML, "Width", МакетЭтикетки.Высота);
			ЗаписатьАтрибутЭлемента(ЗаписьXML, "Height", МакетЭтикетки.Ширина);
		КонецЕсли;

		Для Каждого ТекЭлемент Из МакетЭтикетки.Поля Цикл

			ЗаписьXML.ЗаписатьНачалоЭлемента(ТекЭлемент.Тип);
			ЗаписатьАтрибутЭлемента(ЗаписьXML, "FieldName", ТекЭлемент.Наименование);

			Если ТекЭлемент.Тип <> "UserData" Тогда
				
				Если МакетЭтикетки.Ориентация = 0 Тогда
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "Left", ТекЭлемент.Лево-1);
				ИначеЕсли МакетЭтикетки.Ориентация = 90 Тогда
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "Left", ТекЭлемент.Верх-1);
				ИначеЕсли МакетЭтикетки.Ориентация = 180 Тогда
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "Left", МакетЭтикетки.Ширина - ТекЭлемент.Право);
				ИначеЕсли МакетЭтикетки.Ориентация = 270 Тогда
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "Left", МакетЭтикетки.Высота - ТекЭлемент.Низ);
				КонецЕсли;

				Если МакетЭтикетки.Ориентация = 0 Тогда
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "Top", ТекЭлемент.Верх-1);
				ИначеЕсли МакетЭтикетки.Ориентация = 90 Тогда
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "Top", МакетЭтикетки.Ширина - ТекЭлемент.Право);
				ИначеЕсли МакетЭтикетки.Ориентация = 180 Тогда
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "Top", МакетЭтикетки.Высота - ТекЭлемент.Низ);
				ИначеЕсли МакетЭтикетки.Ориентация = 270 Тогда
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "Top", ТекЭлемент.Лево-1);
				КонецЕсли;

				Если МакетЭтикетки.Ориентация = 0 ИЛИ МакетЭтикетки.Ориентация = 180 Тогда
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "Width", ТекЭлемент.Право - ТекЭлемент.Лево+1);
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "Height", ТекЭлемент.Низ - ТекЭлемент.Верх+1);
				Иначе
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "Width", ТекЭлемент.Низ - ТекЭлемент.Верх+1);
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "Height", ТекЭлемент.Право - ТекЭлемент.Лево+1);
				КонецЕсли;

				Если МакетЭтикетки.Ориентация <> 0 Тогда
					
					Если ТекЭлемент.Свойство("Ориентация") Тогда
						Если ЗначениеЗаполнено(ТекЭлемент.Ориентация) Тогда
							ОриентацияПоля = Число(ТекЭлемент.Ориентация);
						Иначе
							ОриентацияПоля = 0;
						КонецЕсли;
					Иначе
						ОриентацияПоля = 0;
					КонецЕсли;
					
					НовоеЗначениеОриентации = ОриентацияПоля + Число(МакетЭтикетки.Ориентация);
					НовоеЗначениеОриентации = Формат(?(НовоеЗначениеОриентации>270, НовоеЗначениеОриентации-360, НовоеЗначениеОриентации), "ЧГ=0");
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "Orientation", НовоеЗначениеОриентации);
					
				Иначе

					Если ТекЭлемент.Свойство("Ориентация") Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "Orientation", ТекЭлемент.Ориентация);
					КонецЕсли;

				КонецЕсли;
				
			КонецЕсли;
			
			Если ТекЭлемент.ТипЗаполнения = "Parameter" Тогда
				
				Если ТекЭлемент.Свойство("ЗначениеПоУмолчанию") Тогда
					Если ТекЭлемент.Тип = "Text"
						И ТекЭлемент.Свойство("Формат") И ЗначениеЗаполнено(ТекЭлемент.Формат) Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "Value", ТекЭлемент.ЗначениеПоУмолчанию, ТекЭлемент.Формат);
					ИначеЕсли ТекЭлемент.Тип = "Barcode" И РевизияИнтерфейса > 3002 Тогда
						ШтрихкодBase64 = ШтрихкодВBase64(ТекЭлемент.ЗначениеПоУмолчанию);
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "ValueBase64", ШтрихкодBase64);
					Иначе
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "Value", ТекЭлемент.ЗначениеПоУмолчанию);
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				
				ЗаписатьАтрибутЭлемента(ЗаписьXML, "Static", Истина);
				Если ТекЭлемент.Тип = "Text" И ТекЭлемент.Свойство("Формат") И ЗначениеЗаполнено(ТекЭлемент.Формат) Тогда
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "Value", ТекЭлемент.Значение, ТекЭлемент.Формат);
				ИначеЕсли ТекЭлемент.Тип = "Barcode" И РевизияИнтерфейса > 3002 Тогда
					ШтрихкодBase64 = ШтрихкодВBase64(ТекЭлемент.Значение);
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "ValueBase64", ШтрихкодBase64);
				Иначе
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "Value", ТекЭлемент.Значение);
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТекЭлемент.Тип = "Text" Тогда
				
				Если ТекЭлемент.Свойство("Формат") И ЗначениеЗаполнено(ТекЭлемент.Формат) Тогда
					ФорматыПолей.Вставить("Формат" + СтрЗаменить(ТекЭлемент.Наименование, "-", ""), ТекЭлемент.Формат);
				КонецЕсли;
				
				Если ТекЭлемент.Свойство("ИмяШрифта") Тогда
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "FontName", ТекЭлемент.ИмяШрифта);
				КонецЕсли;
				
				ЗаписатьАтрибутЭлемента(ЗаписьXML, "FontSize", ТекЭлемент.РазмерШрифта);
				
				СтильШрифта = "";
				Если ТекЭлемент.Свойство("Жирный") Тогда
					Если ТекЭлемент.Жирный Тогда
						СтильШрифта = "Bold";
					КонецЕсли;
				КонецЕсли;
				
				Если ТекЭлемент.Свойство("Наклонный") Тогда
					Если ТекЭлемент.Наклонный Тогда
						СтильШрифта = ?(СтильШрифта <> "", СтильШрифта + " ", "") + "Italic";
					КонецЕсли;
				КонецЕсли;
				
				Если ТекЭлемент.Свойство("Подчеркивание") Тогда
					Если ТекЭлемент.Подчеркивание Тогда
						СтильШрифта = ?(СтильШрифта <> "", СтильШрифта + " ", "") + "Underline";
					КонецЕсли;
				КонецЕсли;
				
				Если ТекЭлемент.Свойство("Зачеркивание") Тогда
					Если ТекЭлемент.Зачеркивание Тогда
						СтильШрифта = ?(СтильШрифта <> "", СтильШрифта + " ", "") + "StrikeOut";
					КонецЕсли;
				КонецЕсли;
				
				ЗаписатьАтрибутЭлемента(ЗаписьXML, "FontStyle", СтильШрифта);

				ВыравниваниеГоризонтальное = "Left";

				Если ТекЭлемент.Свойство("ПоложениеПоГоризонтали") Тогда
					Если ЗначениеЗаполнено(ТекЭлемент.ПоложениеПоГоризонтали) Тогда
						ВыравниваниеГоризонтальное = ТекЭлемент.ПоложениеПоГоризонтали;
					КонецЕсли;
				КонецЕсли;

				ВыравниваниеВертикальное = "Top";

				Если ТекЭлемент.Свойство("ПоложениеПоВертикали") Тогда
					Если ЗначениеЗаполнено(ТекЭлемент.ПоложениеПоВертикали) Тогда
						ВыравниваниеВертикальное = ТекЭлемент.ПоложениеПоВертикали;
					КонецЕсли;
				КонецЕсли;

				Если МакетЭтикетки.Ориентация = 0 Тогда
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "Align", ВыравниваниеГоризонтальное);
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "VAlign", ВыравниваниеВертикальное);
				ИначеЕсли МакетЭтикетки.Ориентация = 90 Тогда

					Если ВыравниваниеВертикальное="Top" Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "Align", "Left");
					ИначеЕсли ВыравниваниеВертикальное="Center" Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "Align", "Center");
					ИначеЕсли ВыравниваниеВертикальное="Bottom" Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "Align", "Right");
					КонецЕсли;

					Если ВыравниваниеГоризонтальное="Left" Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "VAlign", "Bottom");
					ИначеЕсли ВыравниваниеГоризонтальное="Center" Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "VAlign", "Center");
					ИначеЕсли ВыравниваниеГоризонтальное="Right" Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "VAlign", "Top");
					КонецЕсли;

				ИначеЕсли МакетЭтикетки.Ориентация = 180 Тогда

					Если ВыравниваниеГоризонтальное="Left" Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "Align", "Right");
					ИначеЕсли ВыравниваниеГоризонтальное="Center" Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "Align", "Center");
					ИначеЕсли ВыравниваниеГоризонтальное="Right" Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "Align", "Left");
					КонецЕсли;

					Если ВыравниваниеВертикальное="Top" Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "VAlign", "Bottom");
					ИначеЕсли ВыравниваниеВертикальное="Center" Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "VAlign", "Center");
					ИначеЕсли ВыравниваниеВертикальное="Bottom" Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "VAlign", "Top");
					КонецЕсли;

				ИначеЕсли МакетЭтикетки.Ориентация = 270 Тогда

					Если ВыравниваниеВертикальное="Top" Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "Align", "Right");
					ИначеЕсли ВыравниваниеВертикальное="Center" Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "Align", "Center");
					ИначеЕсли ВыравниваниеВертикальное="Bottom" Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "Align", "Left");
					КонецЕсли;

					Если ВыравниваниеГоризонтальное="Left" Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "VAlign", "Top");
					ИначеЕсли ВыравниваниеГоризонтальное="Center" Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "VAlign", "Center");
					ИначеЕсли ВыравниваниеГоризонтальное="Right" Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "VAlign", "Bottom");
					КонецЕсли;

				КонецЕсли;

				Если ТекЭлемент.Свойство("Многострочность") Тогда
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "Multiline", ТекЭлемент.Многострочность);
				КонецЕсли;

			ИначеЕсли ТекЭлемент.Тип = "Barcode" Тогда

				ЗаписатьАтрибутЭлемента(ЗаписьXML, "Type", ТекЭлемент.ТипШтрихкода);

				Если ТекЭлемент.Свойство("ПодписьШтрихкода") Тогда
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "PrintHRI", ТекЭлемент.ПодписьШтрихкода);

					Если ТекЭлемент.ПодписьШтрихкода Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "FontSize", ТекЭлемент.РазмерШрифтаПодписи);
					КонецЕсли;

				КонецЕсли;

				Если ТекЭлемент.Свойство("КонтрольныйСимвол") Тогда
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "CheckSymbol", ТекЭлемент.КонтрольныйСимвол);
				КонецЕсли;	

			КонецЕсли;

			Если ТекЭлемент.Тип = "Text" ИЛИ ТекЭлемент.Тип = "Image" Тогда

				Рамка = "";
				
				Если ТекЭлемент.Свойство("РамкаСлева") Тогда
					Если ТекЭлемент.РамкаСлева Тогда
						Рамка = "Left";
					КонецЕсли;
				КонецЕсли;
				
				Если ТекЭлемент.Свойство("РамкаСверху") Тогда
					Если ТекЭлемент.РамкаСверху Тогда
						Рамка = ?(Рамка <> "", Рамка + " ", "") + "Top";
					КонецЕсли;
				КонецЕсли;
				
				Если ТекЭлемент.Свойство("РамкаСправа") Тогда
					Если ТекЭлемент.РамкаСправа Тогда
						Рамка = ?(Рамка <> "", Рамка + " ", "") + "Right";
					КонецЕсли;
				КонецЕсли;
				
				Если ТекЭлемент.Свойство("РамкаСнизу") Тогда
					Если ТекЭлемент.РамкаСнизу Тогда
						Рамка = ?(Рамка <> "", Рамка + " ", "") + "Bottom";
					КонецЕсли;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Рамка) Тогда
					
					Если МакетЭтикетки.Ориентация = 0 Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "Border", Рамка);
					ИначеЕсли МакетЭтикетки.Ориентация = 90 Тогда
						Рамка=СтрЗаменить(Рамка, "Left", "B1ottom");
						Рамка=СтрЗаменить(Рамка, "Top", "L1eft");
						Рамка=СтрЗаменить(Рамка, "Right", "T1op");
						Рамка=СтрЗаменить(Рамка, "Bottom", "R1ight");
						Рамка=СтрЗаменить(Рамка, "1", "");
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "Border", Рамка);
					ИначеЕсли МакетЭтикетки.Ориентация = 180 Тогда
						Рамка=СтрЗаменить(Рамка, "Left", "R1ight");
						Рамка=СтрЗаменить(Рамка, "Top", "B1ottom");
						Рамка=СтрЗаменить(Рамка, "Right", "L1eft");
						Рамка=СтрЗаменить(Рамка, "Bottom", "T1op");
						Рамка=СтрЗаменить(Рамка, "1", "");
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "Border", Рамка);
					ИначеЕсли МакетЭтикетки.Ориентация = 270 Тогда
						Рамка=СтрЗаменить(Рамка, "Left", "T1op");
						Рамка=СтрЗаменить(Рамка, "Top", "R1ight");
						Рамка=СтрЗаменить(Рамка, "Right", "B1ottom");
						Рамка=СтрЗаменить(Рамка, "Bottom", "L1eft");
						Рамка=СтрЗаменить(Рамка, "1", "");
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "Border", Рамка);
					КонецЕсли;
					
					Если ТекЭлемент.Свойство("ТипРамки") Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "BorderStyle", ТекЭлемент.ТипРамки);
					КонецЕсли;
					
					Если ТекЭлемент.Свойство("ТолщинаРамки") Тогда
						ЗаписатьАтрибутЭлемента(ЗаписьXML, "BorderWidth", ТекЭлемент.ТолщинаРамки);
					КонецЕсли;
					
				КонецЕсли;

			КонецЕсли;

			ЗаписьXML.ЗаписатьКонецЭлемента();		

		КонецЦикла;

		ЗаписьXML.ЗаписатьКонецЭлемента();

	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Labels");
	
	Для Каждого ТекЭтикетка Из МассивЭтикеток Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Label");
		
		Если ТекЭтикетка.Свойство("Количество") Тогда
			ЗаписатьАтрибутЭлемента(ЗаписьXML, "Quantity", ТекЭтикетка.Количество);
		КонецЕсли;
		
		Для Каждого ТекПоле Из ТекЭтикетка.Поля Цикл
			
			ЗначениеЭлемента = Неопределено;
			Для Каждого ТекЭлемент Из МакетЭтикетки.Поля Цикл
				Если ТекЭлемент.Наименование = ТекПоле.ИмяПоля Тогда
					ЗначениеЭлемента = ТекЭлемент;
					Прервать;
				КонецЕсли
			КонецЦикла;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Record");
			ЗаписатьАтрибутЭлемента(ЗаписьXML, "FieldName", ТекПоле.ИмяПоля);
			Если ФорматыПолей.Свойство("Формат" + СтрЗаменить(ТекПоле.ИмяПоля, "-", "")) Тогда
				ЗаписатьАтрибутЭлемента(ЗаписьXML, "Value", ТекПоле.Значение, ФорматыПолей["Формат" + СтрЗаменить(ТекПоле.ИмяПоля, "-", "")]);
			Иначе
				Если РевизияИнтерфейса > 3002 И ЗначениеЭлемента <> Неопределено И ЗначениеЭлемента.Тип = "Barcode" Тогда
					ШтрихкодBase64 = ШтрихкодВBase64(ТекПоле.Значение);
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "ValueBase64", ШтрихкодBase64);
				Иначе
					ЗаписатьАтрибутЭлемента(ЗаписьXML, "Value", ТекПоле.Значение);
				КонецЕсли;
			КонецЕсли;
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Результат = ЗаписьXML.Закрыть(); 
	
	Возврат Результат;
	
КонецФункции

// Сформировать XML пакеты товаров для загрузки ТСД.
//
Функция ПодготовитьПакетыДляПринтераЭтикеток(МассивЭтикеток, РазмерПакета, МакетЭтикетки = Неопределено) Экспорт
	
	ПакетыДляВыгрузки = Новый Массив();  
	МассивТоваров = Новый Массив;
	
	ПервыйПакет      = Истина;
	ЗаписьВПакете    = 0;
	ЗаписейВыгружено = 0;
	ЗаписейВсего     = МассивЭтикеток.Количество();
	
	Для Каждого Позиция Из МассивЭтикеток Цикл
		
		Если ЗаписьВПакете = 0 Тогда
		    МассивТоваров.Очистить();
		КонецЕсли;
		
		МассивТоваров.Добавить(Позиция);
		
		ЗаписейВыгружено  = ЗаписейВыгружено + 1;
		ЗаписьВПакете = ЗаписьВПакете + 1;
		
		Если (ЗаписьВПакете = РазмерПакета) ИЛИ (ЗаписейВыгружено = ЗаписейВсего) Тогда  
			ДанныеДляВыгрузки = СформироватьДанныеДляПринтераЭтикеток(МассивТоваров, ?(ПервыйПакет, МакетЭтикетки, Неопределено));
			ПакетыДляВыгрузки.Добавить(ДанныеДляВыгрузки);
			ЗаписьВПакете = 0;
			ПервыйПакет   = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПакетыДляВыгрузки;
	
КонецФункции

// Функция формирует XML-описание макета.
//
Функция СохранитьXMLФайл(ШиринаЭтикетки, ВысотаЭтикетки, Ориентация, Поля) Экспорт

	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();

	ЗаписьXML.ЗаписатьНачалоЭлемента("Formatting");

	ЗаписатьАтрибутЭлемента(ЗаписьXML, "Width", ШиринаЭтикетки);
	ЗаписатьАтрибутЭлемента(ЗаписьXML, "Height", ВысотаЭтикетки);

	Если ЗначениеЗаполнено(Ориентация) Тогда
		ЗаписатьАтрибутЭлемента(ЗаписьXML, "Orientation", Ориентация);
	КонецЕсли;

	Для Каждого ТекЭлемент Из Поля Цикл

		ЗаписьXML.ЗаписатьНачалоЭлемента(ТекЭлемент.Тип);
		ЗаписатьАтрибутЭлемента(ЗаписьXML, "FieldName", ТекЭлемент.Наименование);

		Если ТекЭлемент.Тип <> "UserData" Тогда
			
			ЗаписатьАтрибутЭлемента(ЗаписьXML, "Left", ТекЭлемент.Лево);
			ЗаписатьАтрибутЭлемента(ЗаписьXML, "Top", ТекЭлемент.Верх);
			ЗаписатьАтрибутЭлемента(ЗаписьXML, "Width", ТекЭлемент.Право - ТекЭлемент.Лево + 1);
			ЗаписатьАтрибутЭлемента(ЗаписьXML, "Height", ТекЭлемент.Низ - ТекЭлемент.Верх + 1);

			Если ЗначениеЗаполнено(ТекЭлемент.Ориентация) Тогда
				ЗаписатьАтрибутЭлемента(ЗаписьXML, "Orientation", ТекЭлемент.Ориентация);
			КонецЕсли;
			
		Иначе
			ЗаписатьАтрибутЭлемента(ЗаписьXML, "Format", ТекЭлемент.Формат);
		КонецЕсли;

		Если ТекЭлемент.Тип = "Text" Тогда

			Если ЗначениеЗаполнено(ТекЭлемент.ИмяШрифта) Тогда
				ЗаписатьАтрибутЭлемента(ЗаписьXML, "FontName", ТекЭлемент.ИмяШрифта);
			КонецЕсли;

			ЗаписатьАтрибутЭлемента(ЗаписьXML, "FontSize", ТекЭлемент.РазмерШрифта);
			СтильШрифта = "";

			Если ТекЭлемент.Жирный Тогда
				СтильШрифта = "Bold";
			КонецЕсли;

			Если ТекЭлемент.Наклонный Тогда
				СтильШрифта = ?(ЗначениеЗаполнено(СтильШрифта), СтильШрифта + " ", "") + "Italic";
			КонецЕсли;

			Если ТекЭлемент.Подчеркивание Тогда
				СтильШрифта = ?(ЗначениеЗаполнено(СтильШрифта), СтильШрифта + " ", "") + "Underline";
			КонецЕсли;

			Если ТекЭлемент.Зачеркивание Тогда
				СтильШрифта = ?(ЗначениеЗаполнено(СтильШрифта), СтильШрифта + " ", "") + "Strikeout";
			КонецЕсли;

			Если ЗначениеЗаполнено(СтильШрифта) Тогда
				ЗаписатьАтрибутЭлемента(ЗаписьXML, "FontStyle", СтильШрифта);
			КонецЕсли;

			ЗаписатьАтрибутЭлемента(ЗаписьXML, "Align", ТекЭлемент.ПоложениеПоГоризонтали);
			ЗаписатьАтрибутЭлемента(ЗаписьXML, "VAlign", ТекЭлемент.ПоложениеПоВертикали);
			ЗаписатьАтрибутЭлемента(ЗаписьXML, "Multiline", ТекЭлемент.Многострочность);
			ЗаписатьАтрибутЭлемента(ЗаписьXML, "Format", ТекЭлемент.Формат);

		ИначеЕсли ТекЭлемент.Тип = "Barcode" Тогда

			Если ТекЭлемент.Тип = "Barcode" Тогда
				ЗаписатьАтрибутЭлемента(ЗаписьXML, "Type", ТекЭлемент.ТипШтрихкода);
			КонецЕсли;

			ЗаписатьАтрибутЭлемента(ЗаписьXML, "PrintHRI", ТекЭлемент.ПодписьШтрихкода);

			Если ТекЭлемент.ПодписьШтрихкода Тогда
				ЗаписатьАтрибутЭлемента(ЗаписьXML, "FontSize", ТекЭлемент.РазмерШрифтаПодписи);
				ЗаписатьАтрибутЭлемента(ЗаписьXML, "CheckSymbol", ТекЭлемент.КонтрольныйСимвол);
			КонецЕсли;

		КонецЕсли;

		Если ТекЭлемент.Тип = "Text" ИЛИ ТекЭлемент.Тип = "Image" Тогда

			Рамка = "";

			Если ТекЭлемент.РамкаСверху Тогда
				Рамка = "Top";
			КонецЕсли;

			Если ТекЭлемент.РамкаСлева Тогда
				Рамка = ?(ЗначениеЗаполнено(Рамка), Рамка + " ", "") + "Left";
			КонецЕсли;

			Если ТекЭлемент.РамкаСправа Тогда
				Рамка = ?(ЗначениеЗаполнено(Рамка), Рамка + " ", "") + "Right";
			КонецЕсли;

			Если ТекЭлемент.РамкаСнизу Тогда
				Рамка = ?(ЗначениеЗаполнено(Рамка), Рамка + " ", "") + "Bottom";
			КонецЕсли;

			Если ЗначениеЗаполнено(Рамка) Тогда
				ЗаписатьАтрибутЭлемента(ЗаписьXML, "Border", Рамка);
				ЗаписатьАтрибутЭлемента(ЗаписьXML, "BorderWidth", ТекЭлемент.ТолщинаРамки);
				ЗаписатьАтрибутЭлемента(ЗаписьXML, "BorderStyle", ТекЭлемент.ТипРамки);
			КонецЕсли;

		КонецЕсли;

		ЗаписатьАтрибутЭлемента(ЗаписьXML, "TypeFill", ТекЭлемент.ТипЗаполнения);
		ЗаписатьАтрибутЭлемента(ЗаписьXML, "Value", ТекЭлемент.Значение);

		Если ТекЭлемент.ТипЗаполнения<>"Constant" И ЗначениеЗаполнено(ТекЭлемент.ЗначениеПоУмолчанию) Тогда			
			ЗаписатьАтрибутЭлемента(ЗаписьXML, "ValueDefault", ТекЭлемент.ЗначениеПоУмолчанию);
		КонецЕсли;

		ЗаписьXML.ЗаписатьКонецЭлемента();

	КонецЦикла;

	ЗаписьXML.ЗаписатьКонецЭлемента();

	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

// Функция определяет тип штрихкода по значение кода.
// 
Функция ОпределитьТипШтрихкода(Штрихкод) Экспорт
	
	Возврат МенеджерОборудованияКлиентСервер.ОпределитьТипШтрихкода(Штрихкод);
	
КонецФункции

// Функция получения кодировки файла.
//
// Параметры:
//  Кодировка - КодировкаТекста - кодировка при чтении текстового файла, по умолчанию КодировкаТекста.UTF8.
//
// Возвращаемое значение:
//  КодировкаТекста 
//
Функция ПолучитьКодировкуФайла(Кодировка = Неопределено) Экспорт
	
	Если Кодировка = Неопределено ИЛИ Кодировка = "UTF8" Тогда
		Кодировка = КодировкаТекста.UTF8;
	ИначеЕсли Кодировка = "ANSI" Тогда
		Кодировка = КодировкаТекста.ANSI;
	ИначеЕсли Кодировка = "OEM" Тогда
		Кодировка = КодировкаТекста.OEM;
	ИначеЕсли Кодировка = "UTF16" Тогда
		Кодировка = КодировкаТекста.UTF16;
	КонецЕсли;
	
	Возврат Кодировка;
	
КонецФункции

// Процедура получения содержания текстовых файлов.
//
// Параметры:
//  ПомещаемыеФайлы - Массив, Массив из Файл- имя файла или массив с именами файлов.
//  Кодировка - КодировкаТекста - Кодировка при чтении текстового файла, по умолчанию КодировкаТекста.UTF8.
//
// Возвращаемое значение:
// Структура - 
//
Функция ПолучитьСодержаниеТекстовыхФайлов(ПомещаемыеФайлы, Кодировка = Неопределено) Экспорт
	
	СодержаниеФайлов = Новый Массив;
	РезультатЧтенияФайлов = Новый Структура;
	РезультатЧтенияФайлов.Вставить("СодержаниеФайлов", Неопределено);
	РезультатЧтенияФайлов.Вставить("Успешно", Ложь);
	РезультатЧтенияФайлов.Вставить("ТекстОшибки", "");
	
	Для Каждого Файл Из ПомещаемыеФайлы Цикл
		
		СтруктураСодержанияФайла = Новый Структура;
		
		Попытка
			ЧтениеТекста = Новый ЧтениеТекста(Файл.Имя, Кодировка);
			ТекстСодержания = ЧтениеТекста.Прочитать();
		Исключение
			
			ТекстСообщения =  НСтр("ru = 'При чтении файла %ИмяФайла% произошла ошибка'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяФайла%", Файл.Имя);
			
			РезультатЧтенияФайлов.ТекстОшибки = ТекстСообщения + Символы.ПС + ОписаниеОшибки();
			Возврат РезультатЧтенияФайлов;
			
		КонецПопытки;
		
		СтруктураСодержанияФайла.Вставить("ОписаниеПереданногоФайла", Файл);
		СтруктураСодержанияФайла.Вставить("ТекстСодержания",          ТекстСодержания);
		
		СодержаниеФайлов.Добавить(СтруктураСодержанияФайла);
		ЧтениеТекста.Закрыть();
		
	КонецЦикла;
	
	РезультатЧтенияФайлов.Успешно = Истина;
	РезультатЧтенияФайлов.СодержаниеФайлов = СодержаниеФайлов;
	
	Возврат РезультатЧтенияФайлов;
	
КонецФункции

// Функция получает содержание текстовых файлов из временного хранилища.
//
// Параметры: 
//   ПомещенныеФайлы - Массив Из ОписаниеПередаваемогоФайла - Массив, 
//   Содержащий элементы типа ОписаниеПередаваемогоФайла, из которых читается содержание.
//   Кодировка - Строка - Кодировка
// Возвращаемое значение: 
//   Структура:
//    * Успешно - булево.
//    * СодержаниеФайлов - Массив Из Структура - Структуры с ключами 
//    ОписаниеПереданногоФайла и ТекстСодержания или Неопределено, в случае Успешно = Ложь.
//    * ТекстОшибки - строка.
//
Функция ПолучитьСодержаниеТекстовыхФайловИзХранилища(ПомещенныеФайлы, Кодировка) Экспорт
	
	РезультатЧтения = Новый Структура;
	
	РезультатЧтения.Вставить("Успешно", Ложь);
	РезультатЧтения.Вставить("СодержаниеФайлов", Неопределено);
	РезультатЧтения.Вставить("ТекстОшибки", "");
	
	СодержаниеФайлов = Новый Массив;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	Для Каждого Файл Из ПомещенныеФайлы Цикл
		
		СтруктураСодержанияФайла = Новый Структура;
		
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(Файл.Хранение); // ТекстовыйДокумент
		
		Попытка
			
			ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
			
			ЧтениеТекста = Новый ЧтениеТекста(ИмяВременногоФайла, Кодировка);
			ТекстСодержания = ЧтениеТекста.Прочитать();
			
			ЧтениеТекста.Закрыть();
			
			СтруктураСодержанияФайла.Вставить("ОписаниеПереданногоФайла", Файл);
			СтруктураСодержанияФайла.Вставить("ТекстСодержания",          ТекстСодержания);
			
			СодержаниеФайлов.Добавить(СтруктураСодержанияФайла);
			
		Исключение
			
			РезультатЧтения.ТекстОшибки = ОписаниеОшибки();
			Возврат РезультатЧтения;
			
		КонецПопытки;
		
	КонецЦикла;
	
	РезультатЧтения.Успешно = Истина;
	РезультатЧтения.СодержаниеФайлов = СодержаниеФайлов;
	
	Возврат РезультатЧтения;
	
КонецФункции

// Функция выполняет проверку дублирования кодов в массивах групп товаров и товаров подготавливаемых для ККМ-Offline.
// Параметры: 
//   РасширеннаяВыгрузка  - булево, признак расширенной выгрузки.
//   ГруппыТоваров  - массив, список групп товаров.
//   Товары  - массив, список товаров.
//   Коды  - строка, строка в которую через ", " будут перечислены дублирующиеся коды.
// Возвращаемое значение: 
//   Булево - если есть дублирование, возвращает Истина, иначе Ложь.
//
Функция ПроверитьДублированиеКодов(РасширеннаяВыгрузка, ГруппыТоваров, Товары, Коды) Экспорт
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Код");
	ТЗ.Колонки.Добавить("Количество");
	
	Если РасширеннаяВыгрузка Тогда
		
		Для Каждого ТекГруппа Из ГруппыТоваров Цикл
			ДобавитьЭлементВКоллекцию(ТекГруппа, ТЗ);
		КонецЦикла;
		
		Для Каждого ТекТовар Из Товары Цикл
			ДобавитьКодыТоваров(ТЗ, ТекТовар, "Товар");
		КонецЦикла;
		
	Иначе
		
		Для Каждого ТекТовар Из Товары Цикл
			ДобавитьЭлементВКоллекцию(ТекТовар, ТЗ);
		КонецЦикла;
		
	КонецЕсли;
	
	ТЗ.Свернуть("Код", "Количество");
	
	ЕстьДублированиеКодов = Ложь;
	
	ДублирующиесяКоды = "";
	
	Для Каждого ТекСтрока Из ТЗ Цикл
		
		Если ТекСтрока.Количество > 1 Тогда
			
			Если НЕ ЕстьДублированиеКодов Тогда
				ЕстьДублированиеКодов = Истина;
				Коды = Формат(ТекСтрока.Код, "ЧН=0; ЧГ=0");
			Иначе
				Коды = Коды + ", " + Формат(ТекСтрока.Код, "ЧН=0; ЧГ=0");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьДублированиеКодов Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// Функция возвращает Истина, если функциональная подсистема существует в конфигурации.
//
// Параметры:
//  ПолноеИмяПодсистемы - Строка - полное имя объекта метаданных подсистема
//                        без слов "Подсистема." и с учетом регистра символов.
//                        Например: "СтандартныеПодсистемы.ВариантыОтчетов".
//  Возвращаемое значение:
//   Булево - Истина, если существует.
//
Функция ПодсистемаСуществует(ПолноеИмяПодсистемы) Экспорт
	
	Возврат ОбщегоНазначения.ПодсистемаСуществует(ПолноеИмяПодсистемы);
	
КонецФункции

#Область ПрограммныйИнтерфейсККТ

#Область ФискальныеОперации

// Записать операцию в журнал фискальных операций.
//
Процедура ЗаписатьФискальнуюОперацию(ПараметрыФискализации) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПустаяСтрока(ПараметрыФискализации.ИдентификаторФискальнойЗаписи) Тогда
		ПараметрыФискализации.ИдентификаторФискальнойЗаписи = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;	
	ИдентификаторЗаписи = ПараметрыФискализации.ИдентификаторФискальнойЗаписи;

	// ФискальныеОперации
	НаборЗаписей = РегистрыСведений.ФискальныеОперации.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЗаписи.Установить(ИдентификаторЗаписи, Истина);
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Дата							= ПараметрыФискализации.ДатаВремяЧека;
	НоваяСтрока.ИдентификаторЗаписи				= ИдентификаторЗаписи;                                 
	НоваяСтрока.ФискальныйПризнак				= ПараметрыФискализации.ФискальныйПризнак;
	НоваяСтрока.ТипДокумента					= ПараметрыФискализации.ТипДокумента; 
	НоваяСтрока.Организация    					= ПараметрыФискализации.Организация;
	НоваяСтрока.ТорговыйОбъект				    = ПараметрыФискализации.ТорговыйОбъект;
	НоваяСтрока.ТипРасчета						= ПараметрыФискализации.ТипРасчета;
	НоваяСтрока.НомерСменыККМ					= ПараметрыФискализации.НомерСменыККТ;
	НоваяСтрока.НомерЧекаККМ					= ПараметрыФискализации.НомерЧекаККТ;
	НоваяСтрока.Сумма							= ПараметрыФискализации.СуммаЧека;
	НоваяСтрока.ОплатаНаличные					= ПараметрыФискализации.ОплатаНаличные;
	НоваяСтрока.ОплатаЭлектронно				= ПараметрыФискализации.ОплатаЭлектронно;
	НоваяСтрока.ОплатаПостоплата  				= ПараметрыФискализации.ОплатаПостоплата;
	НоваяСтрока.ОплатаПредоплата				= ПараметрыФискализации.ОплатаПредоплата;
	НоваяСтрока.ОплатаВстречноеПредоставление	= ПараметрыФискализации.ОплатаВстречноеПредоставление;
	НоваяСтрока.ДополнительныйРеквизит  		= ПараметрыФискализации.ДополнительныйРеквизит;
	НоваяСтрока.АдресСайтаПроверки      		= ПараметрыФискализации.АдресСайтаПроверки;
	НоваяСтрока.ЗаводскойНомерФН        		= ПараметрыФискализации.ЗаводскойНомерФН;
	НоваяСтрока.РегистрационныйНомерККТ 		= ПараметрыФискализации.РегистрационныйНомерККТ; 
	// НоваяСтрока.КорректируемыйДокумент  		= ПараметрыФискализации.КорректируемыйДокумент;
	НоваяСтрока.СубъектПерсональныхДанных 		= ПараметрыФискализации.СубъектПерсональныхДанных;
	НоваяСтрока.ЕдиныйЧек				        = ПараметрыФискализации.ЕдиныйЧек;
	
	Если ПараметрыФискализации.ДанныеЧекаXML <> Неопределено Тогда
		НоваяСтрока.ДанныеXML = Новый ХранилищеЗначения(ПараметрыФискализации.ДанныеЧекаXML);
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
	// Записываем документы фискальной операции.
	Если ТипЗнч(ПараметрыФискализации.ДокументОснование) = Тип("Массив") 
		И ПараметрыФискализации.ДокументОснование.Количество() > 0 Тогда
		
		НаборЗаписей = РегистрыСведений.ФискальныеОперацииДокументы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторЗаписи.Установить(ИдентификаторЗаписи, Истина);
		
		Для Каждого ЭлементМ Из ПараметрыФискализации.ДокументОснование Цикл	
			НоваяСтрока = НаборЗаписей.Добавить();
			НоваяСтрока.ИдентификаторЗаписи = ИдентификаторЗаписи;
			НоваяСтрока.ДокументОснование	= ЭлементМ.Ссылка;
		КонецЦикла;    
		
		НаборЗаписей.Записать(); 
	КонецЕсли;

	// Записываем документы фискальной операции коррекции.
	Если ТипЗнч(ПараметрыФискализации.КорректируемыйДокумент) = Тип("Массив") 
		И ПараметрыФискализации.КорректируемыйДокумент.Количество() > 0 Тогда
		
		НаборЗаписей = РегистрыСведений.ФискальныеОперацииКорректируемыеДокументы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторЗаписи.Установить(ИдентификаторЗаписи, Истина);
		
		Для Каждого ЭлементМ Из ПараметрыФискализации.КорректируемыйДокумент Цикл	
			НоваяСтрока = НаборЗаписей.Добавить();
			НоваяСтрока.ИдентификаторЗаписи = ИдентификаторЗаписи;
			НоваяСтрока.ДокументОснование					= ЭлементМ.ДокументОснование;
			НоваяСтрока.Аванс								= ЭлементМ.Аванс;
			НоваяСтрока.ДатаПлатежа							= ЭлементМ.ДатаПлатежа;
			НоваяСтрока.ИдентификаторКорректируемойЗаписи	= ЭлементМ.ИдентификаторФискальнойЗаписи;  
			НоваяСтрока.СуммаАванса							= ЭлементМ.СуммаАванса;  
		КонецЦикла;    
		
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Получить данные журнала фискальных операций.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - Документ-основание.
// 
// Возвращаемое значение:
//  Структура - Структура по свойствами:
//   * НомерСменыККМ - Число - Номер чека ККМ.
//   * Сумма - Число - Сумма.
//   * ДокументОснование - ДокументСсылка - Документ-основание.
//   * ДанныеXML - ХранилищеЗначений - Данные чека, переданные в ККТ (XML).
//
Функция ДанныеФискальнойОперации(ИдентификаторЗаписи, ТипыДокументов = Неопределено, ТипРасчета = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФискальныеОперации.ИдентификаторЗаписи     КАК ИдентификаторЗаписи,  
	|	ФискальныеОперации.Дата                    КАК Дата,
	|	ФискальныеОперации.НомерЧекаККМ            КАК НомерЧекаККМ,
	|	ФискальныеОперации.НомерСменыККМ           КАК НомерСменыККМ,
	|	ФискальныеОперации.ТипДокумента            КАК ТипДокумента,
	|	ФискальныеОперации.ТипРасчета              КАК ТипРасчета,
	|	ФискальныеОперации.Организация             КАК Организация,
	|	ФискальныеОперации.ТорговыйОбъект          КАК ТорговыйОбъект,
	|	ФискальныеОперации.ЗаводскойНомерФН        КАК ЗаводскойНомерФН, 
	|	ФискальныеОперации.РегистрационныйНомерККТ КАК РегистрационныйНомерККТ,
	//|	ФискальныеОперации.ДокументОснование       КАК ДокументОснование, 
	//|	ФискальныеОперации.КорректируемыйДокумент  КАК КорректируемыйДокумент,
	|	ФискальныеОперации.Сумма                   КАК Сумма,         
	|	ФискальныеОперации.ФискальныйПризнак       КАК ФискальныйПризнак,
	|	ФискальныеОперации.ДополнительныйРеквизит  КАК ДополнительныйРеквизит,
	|	ФискальныеОперации.ЕдиныйЧек               КАК ЕдиныйЧек,  
	|	ФискальныеОперации.ДанныеXML               КАК ДанныеXML
	|ИЗ
	|	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	|ГДЕ
	|	(ФискальныеОперации.ИдентификаторЗаписи = &ИдентификаторЗаписи)"
		//+ ?(ИдентификаторЗаписи = Неопределено, "", " И (ФискальныеОперации.ИдентификаторЗаписи = &ИдентификаторЗаписи)")
		+ ?(ТипыДокументов = Неопределено, "", " И (ФискальныеОперации.ТипДокумента В (&ТипыДокументов))")
		+ ?(ТипРасчета = Неопределено, "", " И (ФискальныеОперации.ТипРасчета = &ТипРасчета)")
		+ " УПОРЯДОЧИТЬ ПО ФискальныеОперации.Дата УБЫВ, ФискальныеОперации.НомерСменыККМ УБЫВ");
		
	// Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	// Если ИдентификаторЗаписи <> Неопределено Тогда
		Запрос.УстановитьПараметр("ИдентификаторЗаписи", ИдентификаторЗаписи);
	// КонецЕсли;
	
	Если ТипыДокументов <> Неопределено Тогда
		// Подготовка типов документов для запроса.
		МассивТипыДокументов = Новый Массив();
		Если ТипЗнч(ТипыДокументов) = Тип("Массив") Тогда
			Для Каждого ТипДокумента Из ТипыДокументов Цикл
				МассивТипыДокументов.Добавить(ТипДокумента);
			КонецЦикла;
		Иначе
			МассивТипыДокументов.Добавить(ТипыДокументов);
		КонецЕсли;
		Запрос.УстановитьПараметр("ТипыДокументов", МассивТипыДокументов);
	КонецЕсли;
	
	Если ТипРасчета <> Неопределено Тогда
		Запрос.УстановитьПараметр("ТипРасчета", ТипРасчета);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ФискальнаяОперация = Новый Структура;
		ФискальнаяОперация.Вставить("ИдентификаторЗаписи");
		ФискальнаяОперация.Вставить("Дата");
		ФискальнаяОперация.Вставить("НомерЧекаККМ");
		ФискальнаяОперация.Вставить("НомерСменыККМ");
		ФискальнаяОперация.Вставить("ЗаводскойНомерФН");
		ФискальнаяОперация.Вставить("РегистрационныйНомерККТ");
		ФискальнаяОперация.Вставить("ТипДокумента");
		ФискальнаяОперация.Вставить("ТипРасчета");
		ФискальнаяОперация.Вставить("Организация");
		ФискальнаяОперация.Вставить("ТорговыйОбъект");
		ФискальнаяОперация.Вставить("Сумма");
		// ФискальнаяОперация.Вставить("ДокументОснование");
		ФискальнаяОперация.Вставить("КорректируемыйДокумент");
		ФискальнаяОперация.Вставить("ФискальныйПризнак");
		ФискальнаяОперация.Вставить("ДополнительныйРеквизит");
		ФискальнаяОперация.Вставить("ЕдиныйЧек");
		ФискальнаяОперация.Вставить("ДанныеXML");
		ЗаполнитьЗначенияСвойств(ФискальнаяОперация, Выборка);
		Возврат ФискальнаяОперация;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Получить данные журнала фискальных операций.
//
// Параметры:
//  ИдентификаторЗаписи - Идентификатор записи.
// 
Функция ФискальнаяОперацииПоИдентификатору(ИдентификаторЗаписи) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ФискальныеОперации.ИдентификаторЗаписи     КАК ИдентификаторЗаписи,
	|	ФискальныеОперации.Дата                    КАК Дата,
	|	ФискальныеОперации.НомерЧекаККМ            КАК НомерЧекаККМ,
	|	ФискальныеОперации.НомерСменыККМ           КАК НомерСменыККМ,
	|	ФискальныеОперации.ТипДокумента            КАК ТипДокумента,
	|	ФискальныеОперации.ТипРасчета              КАК ТипРасчета,
	|	ФискальныеОперации.Организация             КАК Организация,
	|	ФискальныеОперации.ТорговыйОбъект          КАК ТорговыйОбъект,
	|	ФискальныеОперации.ЗаводскойНомерФН        КАК ЗаводскойНомерФН, 
	|	ФискальныеОперации.РегистрационныйНомерККТ КАК РегистрационныйНомерККТ,
	//|	ФискальныеОперации.ДокументОснование       КАК ДокументОснование, 
	//|	ФискальныеОперации.КорректируемыйДокумент  КАК КорректируемыйДокумент,
	|	ФискальныеОперации.Сумма                   КАК Сумма, 
	|	ФискальныеОперации.ФискальныйПризнак       КАК ФискальныйПризнак,
	|	ФискальныеОперации.ДополнительныйРеквизит  КАК ДополнительныйРеквизит,  
	|	ФискальныеОперации.ЕдиныйЧек               КАК ЕдиныйЧек,  
	|	ФискальныеОперации.ДанныеXML               КАК ДанныеXML
	|ИЗ
	|	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	|ГДЕ
	|	(ФискальныеОперации.ИдентификаторЗаписи = &ИдентификаторЗаписи)");
	
	Запрос.УстановитьПараметр("ИдентификаторЗаписи", ИдентификаторЗаписи);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ФискальнаяОперация = Новый Структура;
		ФискальнаяОперация.Вставить("ИдентификаторЗаписи");
		ФискальнаяОперация.Вставить("Дата");
		ФискальнаяОперация.Вставить("НомерЧекаККМ");
		ФискальнаяОперация.Вставить("НомерСменыККМ");
		ФискальнаяОперация.Вставить("ЗаводскойНомерФН");
		ФискальнаяОперация.Вставить("РегистрационныйНомерККТ");
		ФискальнаяОперация.Вставить("ТипДокумента");
		ФискальнаяОперация.Вставить("ТипРасчета");
		ФискальнаяОперация.Вставить("Организация");
		ФискальнаяОперация.Вставить("ТорговыйОбъект");
		ФискальнаяОперация.Вставить("Сумма");
		ФискальнаяОперация.Вставить("ДокументОснование");
		ФискальнаяОперация.Вставить("КорректируемыйДокумент");
		ФискальнаяОперация.Вставить("ФискальныйПризнак");
		ФискальнаяОперация.Вставить("ДополнительныйРеквизит");
		ФискальнаяОперация.Вставить("ЕдиныйЧек");
		ФискальнаяОперация.Вставить("ДанныеXML");
		ЗаполнитьЗначенияСвойств(ФискальнаяОперация, Выборка);
		Возврат ФискальнаяОперация;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Получить список журнала фискальных операций.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - Документ-основание.
// 
// Возвращаемое значение:
//  Структура - Структура по свойствами:
//   * НомерСменыККМ - Число - Номер чека ККМ.
//   * Сумма - Число - Сумма.
//   * ДокументОснование - ДокументСсылка - Документ-основание.
//
Функция СписокФискальныхОпераций(ДокументСсылка, ТипыДокументов = Неопределено, ТипРасчета = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	ФискальныеОперации.ИдентификаторЗаписи     КАК ИдентификаторЗаписи,
	|	ФискальныеОперации.НомерЧекаККМ            КАК НомерЧекаККМ,
	|	ФискальныеОперации.НомерСменыККМ           КАК НомерСменыККМ,
	|	ФискальныеОперации.ТипДокумента            КАК ТипДокумента,
	|	ФискальныеОперации.ТипРасчета              КАК ТипРасчета,
	|	ФискальныеОперации.Организация             КАК Организация,
	|	ФискальныеОперации.ТорговыйОбъект          КАК ТорговыйОбъект,
	|	ФискальныеОперации.ЗаводскойНомерФН        КАК ЗаводскойНомерФН, 
	|	ФискальныеОперации.РегистрационныйНомерККТ КАК РегистрационныйНомерККТ,
	|	ФискальныеОперации.Сумма                   КАК Сумма, 
	|	ФискальныеОперации.ФискальныйПризнак       КАК ФискальныйПризнак,
	|	ФискальныеОперации.ДополнительныйРеквизит  КАК ДополнительныйРеквизит,
	|	ФискальныеОперации.ДанныеXML               КАК ДанныеXML
	|ИЗ
	|	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	|ГДЕ
	|	(ФискальныеОперации.ДокументОснование = &ДокументСсылка)"
		+ ?(ТипыДокументов = Неопределено, "", " И (ФискальныеОперации.ТипДокумента В (&ТипыДокументов))")
		+ ?(ТипРасчета = Неопределено, "", " И (ФискальныеОперации.ТипРасчета = &ТипРасчета)")
		+ " УПОРЯДОЧИТЬ ПО ФискальныеОперации.Дата УБЫВ, ФискальныеОперации.НомерСменыККМ УБЫВ");
		
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	Если ТипыДокументов <> Неопределено Тогда
		// Подготовка типов документов для запроса.
		МассивТипыДокументов = Новый Массив();
		Если ТипЗнч(ТипыДокументов) = Тип("Массив") Тогда
			Для Каждого ТипДокумента Из ТипыДокументов Цикл
				МассивТипыДокументов.Добавить(ТипДокумента);
			КонецЦикла;
		Иначе
			МассивТипыДокументов.Добавить(ТипыДокументов);
		КонецЕсли;
		Запрос.УстановитьПараметр("ТипыДокументов", МассивТипыДокументов);
	КонецЕсли;
	
	Если ТипРасчета <> Неопределено Тогда
		Запрос.УстановитьПараметр("ТипРасчета", ТипРасчета);
	КонецЕсли;
	
	СписокОпераций = Новый Массив(); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ФискальнаяОперация = Новый Структура;
		ФискальнаяОперация.Вставить("ИдентификаторЗаписи");
		ФискальнаяОперация.Вставить("НомерЧекаККМ");
		ФискальнаяОперация.Вставить("НомерСменыККМ");
		ФискальнаяОперация.Вставить("ЗаводскойНомерФН");
		ФискальнаяОперация.Вставить("РегистрационныйНомерККТ");
		ФискальнаяОперация.Вставить("ТипДокумента");
		ФискальнаяОперация.Вставить("ТипРасчета");
		ФискальнаяОперация.Вставить("Организация");
		ФискальнаяОперация.Вставить("ТорговыйОбъект");
		ФискальнаяОперация.Вставить("Сумма");
		ФискальнаяОперация.Вставить("ДокументОснование");
		ФискальнаяОперация.Вставить("КорректируемыйДокумент");
		ФискальнаяОперация.Вставить("ФискальныйПризнак");
		ФискальнаяОперация.Вставить("ДополнительныйРеквизит");
		ФискальнаяОперация.Вставить("ДанныеXML");
		ЗаполнитьЗначенияСвойств(ФискальнаяОперация, Выборка);
		СписокОпераций.Добавить(ФискальнаяОперация);
	КонецЦикла;
	
	Возврат СписокОпераций;
	
КонецФункции

#КонецОбласти

#Область ОчередьЧековККТ 

#КонецОбласти

#Область РаспределеннаяФискализации


#КонецОбласти

#Область ПодготовкаДанныхККТ

Функция ПодготовитьДанныеФискализацииЧека(ОбщиеПараметры, ПараметрыПодключения) Экспорт
	
	ПараметрыРегистрации = ПараметрыПодключения.ПараметрыРегистрации;
	ВерсияФФДККТ11 = ?(ПараметрыРегистрации.Свойство("ВерсияФФДККТ"), ПараметрыРегистрации.ВерсияФФДККТ, "1.0.5");
	ВерсияФФДККТ11 = ВерсияФФДККТ11 = "1.1" Или ВерсияФФДККТ11 = "1.2"; // Признак ФФД 1.1 или выше
	
	ПараметрыФискализации = МенеджерОборудованияКлиентСервер.ПараметрыФискализацииЧека();   
	ПараметрыФискализации.РегистрационныйНомерККТ = ?(ПараметрыРегистрации.Свойство("РегистрационныйНомерККТ"), ПараметрыРегистрации.РегистрационныйНомерККТ, "");
	ПараметрыФискализации.ЗаводскойНомерФН  = ?(ПараметрыРегистрации.Свойство("ЗаводскойНомерФН"), ПараметрыРегистрации.ЗаводскойНомерФН, "");
	ПараметрыФискализации.ШиринаСтроки      = ?(ПараметрыПодключения.Свойство("ШиринаСтроки"), ПараметрыПодключения.ШиринаСтроки, 32);
	ПараметрыФискализации.АвтономныйРежим   = ?(ПараметрыРегистрации.Свойство("ПризнакАвтономногоРежима"), ПараметрыРегистрации.ПризнакАвтономногоРежима, Ложь);
	ПараметрыФискализации.РевизияИнтерфейса = ПараметрыПодключения.РевизияИнтерфейса;
	ПараметрыФискализации.ДокументОснование = ОбщиеПараметры.ДокументОснование;
	ПараметрыФискализации.ИдентификаторФискальнойЗаписи = ОбщиеПараметры.ИдентификаторФискальнойЗаписи;
	ПараметрыФискализации.Организация       = ОбщиеПараметры.Организация;
	ПараметрыФискализации.ТорговыйОбъект    = ОбщиеПараметры.ТорговыйОбъект;
	ПараметрыФискализации.ДополнительныйРеквизит    = ОбщиеПараметры.ДополнительныйРеквизит;  
	ПараметрыФискализации.СубъектПерсональныхДанных = ОбщиеПараметры.СубъектПерсональныхДанных;
	ПараметрыФискализации.ЕстьПерсональныеДанные    = ОбщиеПараметры.ЕстьПерсональныеДанные;
	ПараметрыФискализации.ТипПерсональныхДанных     = ОбщиеПараметры.ТипПерсональныхДанных;
	 
	Если ОбщиеПараметры.Свойство("КорректируемыйДокумент") Тогда 
		ПараметрыФискализации.КорректируемыйДокумент = ОбщиеПараметры.КорректируемыйДокумент;
	КонецЕсли;
	Если ОбщиеПараметры.Свойство("ДанныеКоррекции") Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФискализации.ДанныеКоррекции, ОбщиеПараметры.ДанныеКоррекции);		
	КонецЕсли;
	ПараметрыФискализации.Кассир       = ОбщиеПараметры.Кассир;
	ПараметрыФискализации.Электронно   = ОбщиеПараметры.Электронно;
	ПараметрыФискализации.Отправляет1СSMS   = ОбщиеПараметры.Отправляет1СSMS;
	ПараметрыФискализации.Отправляет1СEmail = ОбщиеПараметры.Отправляет1СEmail;
	ПараметрыФискализации.ВерсияФФДККТ11    = ВерсияФФДККТ11;
	ПараметрыФискализации.ЕдиныйЧек    = ОбщиеПараметры.ЕдиныйЧек;
	НеприменениеККТ = ОбщиеПараметры.Свойство("НеприменениеККТ") И ОбщиеПараметры.НеприменениеККТ;
	
	Если ОбщиеПараметры.Свойство("СформироватьЧекКоррекции") И ОбщиеПараметры.СформироватьЧекКоррекции Тогда
		Если НеприменениеККТ Или ВерсияФФДККТ11 Тогда
			// Если неприменение ККТ или ФФД 1.1 
			ПараметрыФискализации.ТипДокумента = Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧекКоррекции;
			МенеджерОборудованияВызовСервера.СформироватьXMLПакетДляЧекаКоррекции(ОбщиеПараметры, ПараметрыФискализации);
			ПараметрыФискализации.СформироватьЧекКоррекции = Истина;
		Иначе // Для ФФД 1.0.5 и исправления ошибок ККТ - КассовыйЧек 
			ПараметрыФискализации.ТипДокумента = Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧек;
			МенеджерОборудованияВызовСервера.СформироватьXMLПакетДляФискализацияЧека(ОбщиеПараметры, ПараметрыФискализации);
		КонецЕсли;
	Иначе
		ПараметрыФискализации.ТипДокумента = Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧек;
		МенеджерОборудованияВызовСервера.СформироватьXMLПакетДляФискализацияЧека(ОбщиеПараметры, ПараметрыФискализации);
	КонецЕсли;
	
	Если ПараметрыФискализации.ЕстьПерсональныеДанные Тогда
		ДатаВремяЧека = ?(ПустаяСтрока(ПараметрыФискализации.ДатаВремяЧека), ТекущаяДата(), ПараметрыФискализации.ДатаВремяЧека);
		СведенияОПокупателе = МенеджерОборудованияКлиентСервер.ПараметрыПерсональныеДанныеПокупателя();
		МенеджерОборудованияВызовСервераПереопределяемый.ОбработкаЗаполненияПерсональныхДанных(СведенияОПокупателе, ПараметрыФискализации.СубъектПерсональныхДанных, 
			ПараметрыФискализации.ТипПерсональныхДанных, ДатаВремяЧека);
		МенеджерОборудованияВызовСервера.СформироватьXMLПакетДляФискализацияЧека(ОбщиеПараметры, ПараметрыФискализации, Истина, СведенияОПокупателе, ПараметрыФискализации.ТипПерсональныхДанных);
	КонецЕсли;
	
	Возврат ПараметрыФискализации;
	
КонецФункции

Процедура ПодготовитьЧекКоррекции(ОбщиеПараметры, ОбщиеПараметрыСторно, ФФДККТ11)
	
	// Меняем признак типа расчета на противоположный.
	Если ОбщиеПараметрыСторно.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств Тогда
		ОбщиеПараметрыСторно.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств;
	ИначеЕсли ОбщиеПараметрыСторно.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств Тогда
		ОбщиеПараметрыСторно.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств;
	ИначеЕсли ОбщиеПараметрыСторно.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств Тогда
		ОбщиеПараметрыСторно.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств;
	ИначеЕсли ОбщиеПараметрыСторно.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств Тогда
		ОбщиеПараметрыСторно.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств;
	КонецЕсли;
	
	// Для формата 1.0.5
	Если НЕ ФФДККТ11 Тогда            
		// Если не корректируются таблица оплат
		ТаблицаОплатИзмена = ОбщиеПараметрыСторно.ТаблицаОплат.Количество() <> ОбщиеПараметры.ТаблицаОплат.Количество();
		Если Не ТаблицаОплатИзмена Тогда
			Для Итератор = 0 По ОбщиеПараметрыСторно.ТаблицаОплат.Количество() - 1 Цикл 
				Если (ОбщиеПараметрыСторно.ТаблицаОплат[Итератор].ТипОплаты <> ОбщиеПараметры.ТаблицаОплат[Итератор].ТипОплаты)
					Или (ОбщиеПараметрыСторно.ТаблицаОплат[Итератор].Сумма <> ОбщиеПараметры.ТаблицаОплат[Итератор].Сумма) Тогда
					ТаблицаОплатИзмена = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// Необходимо изменить вид оплат на «ВстречноеПредоставление»	
		Если НЕ ТаблицаОплатИзмена Тогда
			Для Каждого ЭлементМассива Из ОбщиеПараметрыСторно.ТаблицаОплат Цикл 
				ЭлементМассива.ТипОплаты = Перечисления.ТипыОплатыККТ.ВстречноеПредоставление;
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПодготовитьДанныеЧекаКоррекции(ОбщиеПараметры, ПараметрыПодключения) Экспорт
	
	ПараметрыРегистрации = ПараметрыПодключения.ПараметрыРегистрации;
	ВерсияФФДККТ11 = ?(ПараметрыРегистрации.Свойство("ВерсияФФДККТ"), ПараметрыРегистрации.ВерсияФФДККТ, "1.0.5");
	ВерсияФФДККТ11 = ВерсияФФДККТ11 = "1.1" Или ВерсияФФДККТ11 = "1.2"; // Признак ФФД 1.1 и выше
	
	ПараметрыФискализации = МенеджерОборудованияКлиентСервер.ПараметрыФискализацииЧека();
	ПараметрыФискализации.НеприменениеККТ   = ОбщиеПараметры.НеприменениеККТ;
	ПараметрыФискализации.Кассир            = ОбщиеПараметры.Кассир;
	ПараметрыФискализации.Электронно        = ОбщиеПараметры.Электронно;
	ПараметрыФискализации.Отправляет1СSMS   = ОбщиеПараметры.Отправляет1СSMS;
	ПараметрыФискализации.Отправляет1СEmail = ОбщиеПараметры.Отправляет1СEmail;
	ПараметрыФискализации.Организация       = ОбщиеПараметры.Организация;
	ПараметрыФискализации.ТорговыйОбъект    = ОбщиеПараметры.ТорговыйОбъект;
	ПараметрыФискализации.ВерсияФФДККТ11    = ВерсияФФДККТ11; 
	ПараметрыФискализации.ЕдиныйЧек         = ОбщиеПараметры.ЕдиныйЧек;
	
	ПараметрыФискализации.РегистрационныйНомерККТ = ?(ПараметрыРегистрации.Свойство("РегистрационныйНомерККТ"), ПараметрыРегистрации.РегистрационныйНомерККТ, "");
	ПараметрыФискализации.ЗаводскойНомерФН  = ?(ПараметрыРегистрации.Свойство("ЗаводскойНомерФН"), ПараметрыРегистрации.ЗаводскойНомерФН, "");
	ПараметрыФискализации.ШиринаСтроки      = ?(ПараметрыПодключения.Свойство("ШиринаСтроки"), ПараметрыПодключения.ШиринаСтроки, 32);
	ПараметрыФискализации.РевизияИнтерфейса = ПараметрыПодключения.РевизияИнтерфейса;
	ПараметрыФискализации.ДокументОснование = ОбщиеПараметры.ДокументОснование;
	
	Если ОбщиеПараметры.НеприменениеККТ Тогда
		
		Если ПараметрыПодключения.РевизияИнтерфейса < 3000 
			И (ОбщиеПараметры.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств 
				 Или ОбщиеПараметры.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств) Тогда
			ПараметрыФискализации.Результат = Ложь;
			ПараметрыФискализации.ТекстОшибки = НСтр("ru='Для данного типа расчета нельзя сформировать чек коррекции для данного ККТ.'");
			Возврат ПараметрыФискализации;
		КонецЕсли;
			 
		// Сценарий 1 - непримененин ККТ. 
		Если ОбщиеПараметры.КорректируемыйДокумент.Количество() > 0 Тогда // Если НЕ ПустаяСтрока(ОбщиеПараметры.КорректируемыйДокумент) Тогда
			ПараметрыФискализации.Результат = Ложь;
			ПараметрыФискализации.ТекстОшибки = НСтр("ru='Чек коррекции «неприменение ККТ» нельзя сформировать для фискализированного ранее чека.'");
			Возврат ПараметрыФискализации;
		КонецЕсли;
		ПараметрыФискализации.ТипДокумента = Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧекКоррекции;
		МенеджерОборудованияВызовСервера.СформироватьXMLПакетДляЧекаКоррекции(ОбщиеПараметры, ПараметрыФискализации);
	Иначе  
		// Эта ветка не используется, т.к. эта функция вызывается только для НеприменениеККТ.
		
		//// Сценарий 2 - исправление нарушений применения ККТ.
		// Если ПустаяСтрока(ОбщиеПараметры.КорректируемыйДокумент) Тогда
		//	ПараметрыФискализации.Результат = Ложь; 
		//	ПараметрыФискализации.ТекстОшибки = НСтр("ru='Корректируемый документ не указан для формирования чека коррекции.'");
		//	Возврат ПараметрыФискализации;
		// КонецЕсли;
		//
		// ТипыДокументов = Новый Массив();
		// ТипыДокументов.Добавить(Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧек); // Для ФФД 1.0.5
		// ТипыДокументов.Добавить(Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧекКоррекции); // Для ФФД 1.1
		//
		// КорректируемыйДокументОперация = МенеджерОборудованияВызовСервера.ДанныеФискальнойОперации(ОбщиеПараметры.КорректируемыйДокумент, ,ТипыДокументов, ОбщиеПараметры.ТипРасчета); 
		// Если КорректируемыйДокументОперация = Неопределено Тогда
		//	ПараметрыФискализации.Результат = Ложь; 
		//	ПараметрыФискализации.ТекстОшибки = НСтр("ru='Не найден ранее фискализиронный кассовый чек для формирования чека коррекции.'");
		//	Возврат ПараметрыФискализации;
		// Иначе
		//	// В зависимости от версии ФФД формируем "Кассовый чек" или "Кассовый чек коррекции".
		//	ТипФискальногоДокументов = ?(ВерсияФФДККТ11, Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧекКоррекции, Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧек);
		//	
		//	// Дополнительный реквизит чека - фискальным признаком документа основания (по которому идет коррекция).
		//	ФискальныйПризнак = КорректируемыйДокументОперация.ФискальныйПризнак;
		//	
		//	// Формируем кассовый чек с корректными реквизитами.
		//	ОбщиеПараметры.ДополнительныйРеквизит = ФискальныйПризнак;
		//	ПараметрыФискализации.ДополнительныйРеквизит = ФискальныйПризнак;  
		//	ПараметрыФискализации.ТипДокумента = ТипФискальногоДокументов;
		//	ПараметрыФискализации.КорректируемыйДокумент = КорректируемыйДокументОперация.ДокументОснование;
		//	
		//	МенеджерОборудованияВызовСервера.СформироватьXMLПакетДляФискализацияЧека(ОбщиеПараметры, ПараметрыФискализации);
		//	
		//	// Формируем параметры фискализации для сторнирующего чека коррекции.
		//	ДанныеСторноЧекаXML = КорректируемыйДокументОперация.ДанныеXML.Получить();
		//	ЧекКоррекцииСторно = МенеджерОборудованияКлиентСервер.ПараметрыФискализацииЧека();
		//	ЗаполнитьЗначенияСвойств(ЧекКоррекцииСторно, ПараметрыФискализации);
		//	
		//	ОбщиеПараметрыСторно = МенеджерОборудованияВызовСервера.ЗагрузитьДанныеФискализацииИзXML(ДанныеСторноЧекаXML);
		//	ОбщиеПараметрыСторно.ДополнительныйРеквизит = ФискальныйПризнак;
		//	
		//	ЗаполнитьЗначенияСвойств(ОбщиеПараметрыСторно.ДанныеКоррекции, ОбщиеПараметры.ДанныеКоррекции);
		//	ПодготовитьЧекКоррекции(ОбщиеПараметры, ОбщиеПараметрыСторно, ВерсияФФДККТ11);
		//	
		//	МенеджерОборудованияВызовСервера.СформироватьXMLПакетДляФискализацияЧека(ОбщиеПараметрыСторно, ЧекКоррекцииСторно);
		//	
		//	ПараметрыФискализации.ЧекКоррекцииСторно = ЧекКоррекцииСторно;
		//	
		// КонецЕсли;
	КонецЕсли;
	
	Возврат ПараметрыФискализации;
	
КонецФункции

Функция ПодготовитьДанныеИнкасации(ОбщиеПараметры, ПараметрыПодключения) Экспорт
	
	ПараметрыФискализации = МенеджерОборудованияКлиентСервер.ПараметрыФискализацииЧека();
	Если ОбщиеПараметры.ТипИнкассации = 0 Тогда
		ПараметрыФискализации.ТипДокумента = Перечисления.ТипыФискальныхДокументовККТ.Выемка
	Иначе
		ПараметрыФискализации.ТипДокумента = Перечисления.ТипыФискальныхДокументовККТ.Внесение
	КонецЕсли;
	ПараметрыФискализации.ТипИнкассации = ОбщиеПараметры.ТипИнкассации; 
	
	ПараметрыРегистрации = ПараметрыПодключения.ПараметрыРегистрации;
	ПараметрыФискализации.РегистрационныйНомерККТ = ?(ПараметрыРегистрации.Свойство("РегистрационныйНомерККТ"), ПараметрыРегистрации.РегистрационныйНомерККТ, "");
	ПараметрыФискализации.ЗаводскойНомерФН  = ?(ПараметрыРегистрации.Свойство("ЗаводскойНомерФН"), ПараметрыРегистрации.ЗаводскойНомерФН, "");
	ПараметрыФискализации.ШиринаСтроки      = ?(ПараметрыПодключения.Свойство("ШиринаСтроки"), ПараметрыПодключения.ШиринаСтроки, 32);
	ПараметрыФискализации.РевизияИнтерфейса = ПараметрыПодключения.РевизияИнтерфейса;
	
	Если ОбщиеПараметры.Свойство("ДокументОснование") Тогда 
		ПараметрыФискализации.ДокументОснование = ОбщиеПараметры.ДокументОснование;
	КонецЕсли;
	
	Если ОбщиеПараметры.Свойство("Кассир") Тогда
		ПараметрыФискализации.Кассир = ОбщиеПараметры.Кассир;
	КонецЕсли;
	
	Если ОбщиеПараметры.Свойство("Организация") Тогда
		ПараметрыФискализации.Организация = ОбщиеПараметры.Организация;
	КонецЕсли;
	
	Если ОбщиеПараметры.Свойство("ТорговыйОбъект") Тогда
		ПараметрыФискализации.ТорговыйОбъект = ОбщиеПараметры.ТорговыйОбъект;
	КонецЕсли;
	
	ПараметрыФискализации.СуммаЧека      = ОбщиеПараметры.Сумма;
	ПараметрыФискализации.ОплатаНаличные = ОбщиеПараметры.Сумма;
	ПараметрыФискализации.ДанныеЧекаXML  = МенеджерОборудованияВызовСервера.ПолучитьXMLПакетДляОперации(ОбщиеПараметры);
	
	Возврат ПараметрыФискализации;
	
КонецФункции

Процедура ОбработатьДанныеФискализацииЧекаКоррекции(ПараметрыФискализации) Экспорт
	
	// Заполнить результаты фискализация чека из XML пакета.
	МенеджерОборудованияВызовСервера.ЗаполнитьРезультатыФискализацияЧекаИзXMLПакета(ПараметрыФискализации); 
	
	Если НЕ ПараметрыФискализации.НеприменениеККТ Тогда
		// Заполнить результаты фискализация чека из XML пакета.
		МенеджерОборудованияВызовСервера.ЗаполнитьРезультатыФискализацияЧекаИзXMLПакета(ПараметрыФискализации.ЧекКоррекцииСторно); 
		Попытка
			// Записать фискальную операцию - сторно.
			МенеджерОборудованияВызовСервера.ЗаписатьФискальнуюОперацию(ПараметрыФискализации.ЧекКоррекцииСторно);
		Исключение
			ПараметрыФискализации.ЧекКоррекцииСторно.ОперацияЗаписана = Ложь;
		КонецПопытки;
	КонецЕсли;
		
	Попытка
		// Записать фискальную операцию.
		МенеджерОборудованияВызовСервера.ЗаписатьФискальнуюОперацию(ПараметрыФискализации);
	Исключение
		ПараметрыФискализации.ОперацияЗаписана = Ложь;
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбработатьДанныеФискализацииЧека(ПараметрыФискализации) Экспорт
	
	// Заполнить результаты фискализация чека из XML пакета.
	МенеджерОборудованияВызовСервера.ЗаполнитьРезультатыФискализацияЧекаИзXMLПакета(ПараметрыФискализации); 
	
	Попытка
		// Записать фискальную операцию.
		МенеджерОборудованияВызовСервера.ЗаписатьФискальнуюОперацию(ПараметрыФискализации);
	Исключение
		ПараметрыФискализации.ОперацияЗаписана = Ложь;
	КонецПопытки;
	
	// Формируем текст сообщения с атрибутами фискального чека для отправки покупателю. 
	Если (ПараметрыФискализации.Отправляет1СSMS Или ПараметрыФискализации.Отправляет1СEmail) Тогда
		ПараметрыФискализации.ТекстСообщения = МенеджерОборудованияВызовСервера.ШаблонАтрибутовЧекаДляОтсылки(ПараметрыФискализации); 
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьДанныеИнкасации(ПараметрыФискализации) Экспорт
	
	// Записать фискальную операцию.
	МенеджерОборудованияВызовСервера.ЗаписатьФискальнуюОперацию(ПараметрыФискализации);
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеДанныхККТ

// Возвращает, для каких типов идентификаторов будет заполняться код товара.
//
// Возвращаемое значение: 
//  Массив - Массив Перечисления.ТипыИдентификаторовТовараККТ.
//
Функция КодТовараЗаполняетсяДляТиповИдентификаторов() Экспорт;
	
	ТипыИдентификаторов = Новый Массив();
	ТипыИдентификаторов.Добавить(Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеDataMatrixGS1);
	ТипыИдентификаторов.Добавить(Перечисления.ТипыИдентификаторовТовараККТ.ИзделияИзНатуральногоМеха);
	ТипыИдентификаторовОбработка = ТипыИдентификаторов;
	ВыполненаСтандартнаяОбработка = Истина; 
	МенеджерОборудованияВызовСервераПереопределяемый.КодТовараЗаполняетсяДляТиповИдентификаторов(ТипыИдентификаторовОбработка, ВыполненаСтандартнаяОбработка);
	Если ВыполненаСтандартнаяОбработка Тогда
		Результат = ТипыИдентификаторов
	Иначе
		Результат = ТипыИдентификаторовОбработка
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Идентифицирует ли код товара (значение тега 1162) экземпляр товара.
//
// Параметры:
//   РеквизитКодаТовара - Строка - Значение реквизита кода товара в BASE64.
//   ШтриховойКодТовара - Строка - Штриховой код товара.
//
// Возвращаемое значение:
//  Булево - Истина - Если код товара идентифицирует экземпляр товара.
//
Функция КодТовараИдентифицируетЭкземпляр(Знач РеквизитКодаТовара = Неопределено, Знач ШтриховойКодТовара = Неопределено) Экспорт
	
	Результат = Ложь;
	// Если реквизит кода товара (1162)  не передается в готовом виде
	Если ПустаяСтрока(РеквизитКодаТовара) Тогда
		ДанныеКодаТовара = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(ШтриховойКодТовара);
		РеквизитКодаТовара = ДанныеКодаТовара.РеквизитКодаТовара;
	КонецЕсли;
		
	Если НЕ ПустаяСтрока(РеквизитКодаТовара) Тогда
		ТипыИдентификаторов = КодТовараЗаполняетсяДляТиповИдентификаторов();
		НачалоРеквизитКодаТовара = Лев(РеквизитКодаТовара, 3); 
		Если НачалоРеквизитКодаТовара = "RE0" Тогда // GS1 Data Matrix или Data Matrix  - Если первые 2 байта значения кода товара имеют значения "44h4Dh".
			Результат = ТипыИдентификаторов.Найти(Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеDataMatrixGS1) <> Неопределено;
		ИначеЕсли НачалоРеквизитКодаТовара = "UkZ" Тогда // Меховые изделия - Если первые 2 байта значения кода товара имеют значения "52h46h".
			Результат = ТипыИдентификаторов.Найти(Перечисления.ТипыИдентификаторовТовараККТ.ИзделияИзНатуральногоМеха) <> Неопределено;
		ИначеЕсли НачалоРеквизитКодаТовара = "xRR" Тогда // ЕГАИС 2.0 - Если первые 2 байта значения кода товара имеют значения "C5h14h".
			Результат = ТипыИдентификаторов.Найти(Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеЕГАИС2) <> Неопределено;
		ИначеЕсли НачалоРеквизитКодаТовара = "xR4" Тогда // ЕГАИС 3.0 - Если первые 2 байта значения кода товара имеют значения "C5h1Eh".
			Результат = ТипыИдентификаторов.Найти(Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеЕГАИС3) <> Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Сформировать таблицу параметров в XML для операции с ФН.
//
// Возвращаемое значение:
// ЗаписьXML.
//
Функция СформироватьТаблицуПараметровДляОперацииФН(СтруктураПараметров, РевизияИнтерфейса = 0) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	Если РевизияИнтерфейса >= 3000 Тогда  // Версия стандарта 3.0 (ОФД 1.1)
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ParametersFiscal");
		ЗаписьXML.ЗаписатьАтрибут("CashierName" , XMLСтрока(?(СтруктураПараметров.Свойство("Кассир")   , XMLСтрока(СтруктураПараметров.Кассир), НСтр("ru='Администратор'"))));
		ЗаписьXML.ЗаписатьАтрибут("CashierINN"  , XMLСтрока(?(СтруктураПараметров.Свойство("КассирИНН"), XMLСтрока(СтруктураПараметров.КассирИНН), "")));
		// Код причины перерегистрации.
		ЗаписьXML.ЗаписатьАтрибут("RegistrationReasonCode", XMLСтрока(СтруктураПараметров.КодПричиныПеререгистрации));
		// Коды причин изменения сведений о ККТ.
		Если Не ПустаяСтрока(СтруктураПараметров.КодыПричинИзмененияСведений) Тогда
			ЗаписьXML.ЗаписатьАтрибут("RegistrationLabelCodes", XMLСтрока(СтруктураПараметров.КодыПричинИзмененияСведений));
		КонецЕсли;
		ЗаписьXML.ЗаписатьАтрибут("KKTNumber"         , XMLСтрока(СтруктураПараметров.РегистрационныйНомерККТ));
		ЗаписьXML.ЗаписатьАтрибут("CompanyName"       , XMLСтрока(СтруктураПараметров.ОрганизацияНазвание));
		ЗаписьXML.ЗаписатьАтрибут("INN"               , XMLСтрока(СтруктураПараметров.ОрганизацияИНН));
		ЗаписьXML.ЗаписатьАтрибут("SaleAddress"       , XMLСтрока(СтруктураПараметров.АдресПроведенияРасчетов));
		ЗаписьXML.ЗаписатьАтрибут("SaleLocation"      , XMLСтрока(СтруктураПараметров.МестоПроведенияРасчетов));
		ЗаписьXML.ЗаписатьАтрибут("TaxationSystems"   , XMLСтрока(СтруктураПараметров.КодыСистемыНалогообложения));
		ЗаписьXML.ЗаписатьАтрибут("IsOffline"         , XMLСтрока(СтруктураПараметров.ПризнакАвтономногоРежима));
		ЗаписьXML.ЗаписатьАтрибут("IsEncrypted"       , XMLСтрока(СтруктураПараметров.ПризнакШифрованиеДанных));
		ЗаписьXML.ЗаписатьАтрибут("IsService"         , XMLСтрока(СтруктураПараметров.ПризнакРасчетовЗаУслуги));
		ЗаписьXML.ЗаписатьАтрибут("IsExcisable"       , XMLСтрока(СтруктураПараметров.ПродажаПодакцизногоТовара));
		ЗаписьXML.ЗаписатьАтрибут("IsGambling"        , XMLСтрока(СтруктураПараметров.ПроведенияАзартныхИгр));
		ЗаписьXML.ЗаписатьАтрибут("IsLottery"         , XMLСтрока(СтруктураПараметров.ПроведенияЛотерей));
		ЗаписьXML.ЗаписатьАтрибут("AgentTypes"        , XMLСтрока(СтруктураПараметров.ПризнакиАгента));
		ЗаписьXML.ЗаписатьАтрибут("BSOSing"           , XMLСтрока(СтруктураПараметров.ПризнакФормированияБСО));
		ЗаписьXML.ЗаписатьАтрибут("IsOnlineOnly"      , XMLСтрока(СтруктураПараметров.ПризнакРасчетовТолькоВИнтернет));
		Если РевизияИнтерфейса >= 3004 Тогда  // Версия стандарта 3.4 (ОФД 1.2)
			ЗаписьXML.ЗаписатьАтрибут("IsOnline"    , XMLСтрока(СтруктураПараметров.ПроведенияРасчетаВИнтернет));
			ЗаписьXML.ЗаписатьАтрибут("IsMarking"   , XMLСтрока(СтруктураПараметров.ПродажаМаркированныхТоваров));
			ЗаписьXML.ЗаписатьАтрибут("IsPawnshop"  , XMLСтрока(СтруктураПараметров.ПризнакПримененияЛомбардами));
			ЗаписьXML.ЗаписатьАтрибут("IsAssurance" , XMLСтрока(СтруктураПараметров.ПризнакДеятельностиПоСтрахованию));
		КонецЕсли;
		ЗаписьXML.ЗаписатьАтрибут("IsAutomaticPrinter", XMLСтрока(СтруктураПараметров.УстановкаПринтераВАвтомате));
		ЗаписьXML.ЗаписатьАтрибут("IsAutomatic"       , XMLСтрока(СтруктураПараметров.ПризнакАвтоматическогоРежима));
		ЗаписьXML.ЗаписатьАтрибут("AutomaticNumber"   , XMLСтрока(СтруктураПараметров.НомерАвтоматаДляАвтоматическогоРежима));
		ЗаписьXML.ЗаписатьАтрибут("OFDCompany"        , XMLСтрока(СтруктураПараметров.ОрганизацияОФДНазвание));
		ЗаписьXML.ЗаписатьАтрибут("OFDCompanyINN"     , XMLСтрока(СтруктураПараметров.ОрганизацияОФДИНН));
		Если Не ПустаяСтрока(СтруктураПараметров.ОтправительEmail) Тогда
			ЗаписьXML.ЗаписатьАтрибут("SenderEmail", XMLСтрока(СтруктураПараметров.ОтправительEmail));
		КонецЕсли;
		Если Не ПустаяСтрока(СтруктураПараметров.АдресСайтаФНС) Тогда
			ЗаписьXML.ЗаписатьАтрибут("FNSURL", XMLСтрока(СтруктураПараметров.АдресСайтаФНС));
		КонецЕсли;
	
	Иначе
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Parameters");
		ЗаписьXML.ЗаписатьАтрибут("CashierName" , XMLСтрока(?(СтруктураПараметров.Свойство("Кассир")   , XMLСтрока(СтруктураПараметров.Кассир), НСтр("ru='Администратор'"))));
		ЗаписьXML.ЗаписатьАтрибут("CashierVATIN", XMLСтрока(?(СтруктураПараметров.Свойство("КассирИНН"), XMLСтрока(СтруктураПараметров.КассирИНН), "")));
		// ФФД 1.0.0
		ЗаписьXML.ЗаписатьАтрибут("KKTNumber"          , XMLСтрока(СтруктураПараметров.РегистрационныйНомерККТ));
		ЗаписьXML.ЗаписатьАтрибут("OFDVATIN"           , XMLСтрока(СтруктураПараметров.ОрганизацияОФДИНН));
		ЗаписьXML.ЗаписатьАтрибут("OFDOrganizationName", XMLСтрока(СтруктураПараметров.ОрганизацияОФДНазвание));
		ЗаписьXML.ЗаписатьАтрибут("OrganizationName"   , XMLСтрока(СтруктураПараметров.ОрганизацияНазвание));
		ЗаписьXML.ЗаписатьАтрибут("VATIN"              , XMLСтрока(СтруктураПараметров.ОрганизацияИНН));
		ЗаписьXML.ЗаписатьАтрибут("AddressSettle"      , XMLСтрока(СтруктураПараметров.АдресПроведенияРасчетов));
		ЗаписьXML.ЗаписатьАтрибут("TaxVariant"         , XMLСтрока(СтруктураПараметров.КодыСистемыНалогообложения));
		ЗаписьXML.ЗаписатьАтрибут("OfflineMode"        , XMLСтрока(СтруктураПараметров.ПризнакАвтономногоРежима));
		ЗаписьXML.ЗаписатьАтрибут("DataEncryption"     , XMLСтрока(СтруктураПараметров.ПризнакШифрованиеДанных));
		ЗаписьXML.ЗаписатьАтрибут("ServiceSign"        , XMLСтрока(СтруктураПараметров.ПризнакРасчетовЗаУслуги));
		ЗаписьXML.ЗаписатьАтрибут("BSOSing"            , XMLСтрока(СтруктураПараметров.ПризнакФормированияБСО));
		ЗаписьXML.ЗаписатьАтрибут("CalcOnlineSign"     , XMLСтрока(СтруктураПараметров.ПризнакРасчетовТолькоВИнтернет));
		ЗаписьXML.ЗаписатьАтрибут("AutomaticMode"      , XMLСтрока(СтруктураПараметров.ПризнакАвтоматическогоРежима));
		ЗаписьXML.ЗаписатьАтрибут("AutomaticNumber"    , XMLСтрока(СтруктураПараметров.НомерАвтоматаДляАвтоматическогоРежима));
		// ФФД 1.0.5 & 1.1
		ЗаписьXML.ЗаписатьАтрибут("PlaceSettle"        , XMLСтрока(СтруктураПараметров.МестоПроведенияРасчетов));
		ЗаписьXML.ЗаписатьАтрибут("SaleExcisableGoods" , XMLСтрока(СтруктураПараметров.ПродажаПодакцизногоТовара));
		ЗаписьXML.ЗаписатьАтрибут("SignOfGambling"     , XMLСтрока(СтруктураПараметров.ПроведенияАзартныхИгр));
		ЗаписьXML.ЗаписатьАтрибут("SignOfLottery"      , XMLСтрока(СтруктураПараметров.ПроведенияЛотерей));
		ЗаписьXML.ЗаписатьАтрибут("SignOfAgent"        , XMLСтрока(СтруктураПараметров.ПризнакиАгента));
		ЗаписьXML.ЗаписатьАтрибут("PrinterAutomatic"   , XMLСтрока(СтруктураПараметров.УстановкаПринтераВАвтомате));
		// Изменение параметров регистрации.
		ЗаписьXML.ЗаписатьАтрибут("ReasonCode"         , XMLСтрока(СтруктураПараметров.КодПричиныПеререгистрации));
		Если Не ПустаяСтрока(СтруктураПараметров.КодыПричинИзмененияСведений) Тогда
			ЗаписьXML.ЗаписатьАтрибут("InfoChangesReasonsCodes", XMLСтрока(СтруктураПараметров.КодыПричинИзмененияСведений));
		КонецЕсли;
		Если Не ПустаяСтрока(СтруктураПараметров.ОтправительEmail) Тогда
			ЗаписьXML.ЗаписатьАтрибут("SenderEmail", XMLСтрока(СтруктураПараметров.ОтправительEmail));
		КонецЕсли;
		Если Не ПустаяСтрока(СтруктураПараметров.АдресСайтаФНС) Тогда
			ЗаписьXML.ЗаписатьАтрибут("FNSWebSite", XMLСтрока(СтруктураПараметров.АдресСайтаФНС));
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

// Получить таблицу параметров из ККТ.
//
// Возвращаемое значение:
//  Структура
//
Функция ПараметрыИзXMLПакетаККТ(Данные, ИдентификаторУстройства = Неопределено, РевизияИнтерфейса = 0) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML; 
	ЧтениеXML.УстановитьСтроку(Данные);
	ЧтениеXML.ПерейтиКСодержимому();
	
	Параметры = МенеджерОборудованияКлиентСервер.ПараметрыРегистрацииККТ();
	Параметры.Вставить("ТипОборудования", Перечисления.ТипыПодключаемогоОборудования.ККТ);
	
	Если РевизияИнтерфейса >= 3000 Тогда  // Версия стандарта 3.0 (ОФД 1.1)
		
		Если (ЧтениеXML.Имя = "Parameters" Или ЧтениеXML.Имя = "TableParametersKKT") И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
			
			Параметры.ВерсияФФДФН = "1.1";
			ВерсияФФДФН = ЧтениеXML.ЗначениеАтрибута("FFDVersionFN");
			Если ВерсияФФДФН = "1.0" Тогда
				Параметры.ВерсияФФДФН = "1.0"
			ИначеЕсли ВерсияФФДФН = "1.0.5" Или ВерсияФФДФН = "1.05" Тогда
				Параметры.ВерсияФФДФН = "1.05"
			ИначеЕсли ВерсияФФДФН = "1.2" Тогда
				Параметры.ВерсияФФДФН = "1.2"
			КонецЕсли;
			
			Параметры.ВерсияФФДККТ = "1.1"; 
			ВерсияФФДККТ = ЧтениеXML.ЗначениеАтрибута("FFDVersionKKT");
			Если ВерсияФФДККТ = "1.0" Тогда
				Параметры.ВерсияФФДККТ = "1.0"
			ИначеЕсли ВерсияФФДККТ = "1.0.5" Или ВерсияФФДККТ = "1.05" Тогда
				Параметры.ВерсияФФДККТ = "1.05"
			ИначеЕсли ВерсияФФДККТ = "1.2" Тогда
				Параметры.ВерсияФФДККТ = "1.2"
			КонецЕсли;
			
			// ФФД 1.0
			Параметры.РегистрационныйНомерККТ    = СокрЛП(ЧтениеXML.ЗначениеАтрибута("KKTNumber"));
			Параметры.ЗаводскойНомерККТ          = СокрЛП(ЧтениеXML.ЗначениеАтрибута("KKTSerialNumber"));
			Параметры.ЗаводскойНомерФН           = СокрЛП(ЧтениеXML.ЗначениеАтрибута("FNSerialNumber"));
			Параметры.ОрганизацияНазвание        = ЧтениеXML.ЗначениеАтрибута("CompanyName");
			Параметры.ОрганизацияИНН             = СокрЛП(ЧтениеXML.ЗначениеАтрибута("INN"));
			Параметры.АдресПроведенияРасчетов    = ЧтениеXML.ЗначениеАтрибута("SaleAddress");
			Параметры.МестоПроведенияРасчетов    = ЧтениеXML.ЗначениеАтрибута("SaleLocation");
			Параметры.КодыСистемыНалогообложения = ЧтениеXML.ЗначениеАтрибута("TaxationSystems");
			Параметры.ПризнакАвтономногоРежима   = ВРег(ЧтениеXML.ЗначениеАтрибута("IsOffline")) = "TRUE";
			Параметры.ПризнакШифрованиеДанных    = ВРег(ЧтениеXML.ЗначениеАтрибута("IsEncrypted")) = "TRUE";
			Параметры.ПризнакРасчетовЗаУслуги    = ВРег(ЧтениеXML.ЗначениеАтрибута("IsService")) = "TRUE";
			Параметры.ПродажаПодакцизногоТовара  = ВРег(ЧтениеXML.ЗначениеАтрибута("IsExcisable")) = "TRUE";
			Параметры.ПроведенияАзартныхИгр      = ВРег(ЧтениеXML.ЗначениеАтрибута("IsGambling")) = "TRUE";
			Параметры.ПроведенияЛотерей          = ВРег(ЧтениеXML.ЗначениеАтрибута("IsLottery")) = "TRUE";
			Параметры.ПризнакиАгента             = ЧтениеXML.ЗначениеАтрибута("AgentTypes");
			Параметры.ПризнакФормированияБСО         = ВРег(ЧтениеXML.ЗначениеАтрибута("BSOSing")) = "TRUE";
			Параметры.ПризнакРасчетовТолькоВИнтернет = ВРег(ЧтениеXML.ЗначениеАтрибута("IsOnlineOnly")) = "TRUE";
			Параметры.УстановкаПринтераВАвтомате     = ВРег(ЧтениеXML.ЗначениеАтрибута("IsAutomaticPrinter")) = "TRUE";
			Параметры.ПризнакАвтоматическогоРежима   = ВРег(ЧтениеXML.ЗначениеАтрибута("IsAutomatic")) = "TRUE";
			Параметры.НомерАвтоматаДляАвтоматическогоРежима = ЧтениеXML.ЗначениеАтрибута("AutomaticNumber");
			Параметры.ОрганизацияОФДНазвание     = ЧтениеXML.ЗначениеАтрибута("OFDCompany");
			Параметры.ОрганизацияОФДИНН          = СокрЛП(ЧтениеXML.ЗначениеАтрибута("OFDCompanyINN"));
			Параметры.ПризнакФискализации        = ВРег(ЧтениеXML.ЗначениеАтрибута("Fiscal")) = "TRUE";
			Параметры.НомерДокументаФискализации = ЧтениеXML.ЗначениеАтрибута("DocumentNumber");
			Параметры.ДатаВремяФискализации      = ЧтениеXML.ЗначениеАтрибута("DateTime");
			Параметры.ОтправительEmail           = ЧтениеXML.ЗначениеАтрибута("SenderEmail");
			Параметры.АдресСайтаФНС              = ЧтениеXML.ЗначениеАтрибута("FNSURL");
			Если РевизияИнтерфейса >= 3004 Тогда  // Версия стандарта 3.4 (ОФД 1.2)
				Параметры.ПроведенияРасчетаВИнтернет  = ВРег(ЧтениеXML.ЗначениеАтрибута("IsOnline")) = "TRUE";
				Параметры.ПродажаМаркированныхТоваров = ВРег(ЧтениеXML.ЗначениеАтрибута("IsMarking")) = "TRUE"; 
				Параметры.ПризнакПримененияЛомбардами = ВРег(ЧтениеXML.ЗначениеАтрибута("IsPawnshop")) = "TRUE"; 
				Параметры.ПризнакДеятельностиПоСтрахованию = ВРег(ЧтениеXML.ЗначениеАтрибута("IsAssurance")) = "TRUE"; 
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		Если ЧтениеXML.Имя = "Parameters" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
			Параметры.ВерсияФФДФН   = ЧтениеXML.ЗначениеАтрибута("FFDVersionFN");
			Если ПустаяСтрока(Параметры.ВерсияФФДФН) Тогда
				Параметры.ВерсияФФДФН = "1.0";
			КонецЕсли;
			Параметры.ВерсияФФДККТ  = ЧтениеXML.ЗначениеАтрибута("FFDVersionKKT");
			Если ПустаяСтрока(Параметры.ВерсияФФДККТ) Тогда
				Параметры.ВерсияФФДККТ = "1.0";
			КонецЕсли;
			// ФФД 1.0
			Параметры.РегистрационныйНомерККТ        = СокрЛП(ЧтениеXML.ЗначениеАтрибута("KKTNumber"));
			Параметры.ОрганизацияНазвание            = ЧтениеXML.ЗначениеАтрибута("OrganizationName");
			Параметры.ОрганизацияИНН                 = СокрЛП(ЧтениеXML.ЗначениеАтрибута("VATIN"));
			Параметры.АдресПроведенияРасчетов        = ЧтениеXML.ЗначениеАтрибута("AddressSettle");
			Параметры.МестоПроведенияРасчетов        = ЧтениеXML.ЗначениеАтрибута("PlaceSettle");
			Параметры.КодыСистемыНалогообложения     = ЧтениеXML.ЗначениеАтрибута("TaxVariant");
			Если ПустаяСтрока(Параметры.КодыСистемыНалогообложения) Тогда
				Параметры.КодыСистемыНалогообложения = ЧтениеXML.ЗначениеАтрибута("TaxVarinat");
			КонецЕсли;
			Параметры.ПризнакАвтономногоРежима       = ВРег(ЧтениеXML.ЗначениеАтрибута("OfflineMode")) = "TRUE";
			Параметры.ПризнакАвтоматическогоРежима   = ВРег(ЧтениеXML.ЗначениеАтрибута("AutomaticMode")) = "TRUE";
			Параметры.НомерАвтоматаДляАвтоматическогоРежима = ЧтениеXML.ЗначениеАтрибута("AutomaticNumber");
			Параметры.ПризнакФормированияБСО         = ВРег(ЧтениеXML.ЗначениеАтрибута("BSOSing")) = "TRUE";
			Параметры.ПризнакРасчетовТолькоВИнтернет = ВРег(ЧтениеXML.ЗначениеАтрибута("CalcOnlineSign")) = "TRUE";
			Параметры.ПризнакШифрованиеДанных        = ВРег(ЧтениеXML.ЗначениеАтрибута("DataEncryption")) = "TRUE";
			Параметры.ОрганизацияОФДИНН          = СокрЛП(ЧтениеXML.ЗначениеАтрибута("OFDVATIN"));
			Параметры.ОрганизацияОФДНазвание     = ЧтениеXML.ЗначениеАтрибута("OFDOrganizationName");
			Параметры.ЗаводскойНомерККТ          = СокрЛП(ЧтениеXML.ЗначениеАтрибута("KKTSerialNumber"));
			Параметры.ПризнакФискализации        = ВРег(ЧтениеXML.ЗначениеАтрибута("Fiscal")) = "TRUE";
			Параметры.ЗаводскойНомерФН           = СокрЛП(ЧтениеXML.ЗначениеАтрибута("FNSerialNumber"));
			Параметры.НомерДокументаФискализации = ЧтениеXML.ЗначениеАтрибута("DocumentNumber");
			Параметры.ДатаВремяФискализации      = ЧтениеXML.ЗначениеАтрибута("DateTime");
			Параметры.ПризнакРасчетовЗаУслуги    = ВРег(ЧтениеXML.ЗначениеАтрибута("ServiceSign")) = "TRUE";
			Параметры.ПродажаПодакцизногоТовара  = ВРег(ЧтениеXML.ЗначениеАтрибута("SaleExcisableGoods")) = "TRUE";
			Параметры.ПроведенияАзартныхИгр      = ВРег(ЧтениеXML.ЗначениеАтрибута("SignOfGambling")) = "TRUE";
			Параметры.ПроведенияЛотерей          = ВРег(ЧтениеXML.ЗначениеАтрибута("SignOfLottery")) = "TRUE";
			Параметры.ПризнакиАгента             = ЧтениеXML.ЗначениеАтрибута("SignOfAgent");
			Параметры.УстановкаПринтераВАвтомате = ВРег(ЧтениеXML.ЗначениеАтрибута("PrinterAutomatic")) = "TRUE";
			Параметры.ОтправительEmail           = ЧтениеXML.ЗначениеАтрибута("SenderEmail");
			Параметры.АдресСайтаФНС              = ЧтениеXML.ЗначениеАтрибута("FNSWebSite");
		КонецЕсли;
		
	КонецЕсли;
	
	СистемыНалогообложения = Новый Массив();
	Если Не ПустаяСтрока(Параметры.КодыСистемыНалогообложения) Тогда
		СистемыНалогообложенияВрем = СтрРазделить(Параметры.КодыСистемыНалогообложения, ",");
		Для Каждого ВремСНО Из СистемыНалогообложенияВрем Цикл
			СНО = МенеджерОборудованияКлиентСервер.СистемаНалогообложенияККТПоКоду(Число(ВремСНО));
			СистемыНалогообложения.Добавить(СНО);
		КонецЦикла;
		Параметры.Вставить("СистемыНалогообложения", СистемыНалогообложения);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ИдентификаторУстройства) Тогда
		СохранитьПараметрыРегистрацииУстройства(ИдентификаторУстройства, Параметры);
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

Процедура ЗаписатьДанныеКоррекции(ЗаписьXML, ДанныеКоррекции)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CorrectionData");
	ТипКоррекции = ?(ПустаяСтрока(ДанныеКоррекции.ТипКоррекции), 0, ДанныеКоррекции.ТипКоррекции);   
	ЗаписьXML.ЗаписатьАтрибут("Type",  XMLСтрока(ТипКоррекции));
	Если Не ПустаяСтрока(ДанныеКоррекции.ДатаКоррекции) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Date",  XMLСтрока(НачалоДня(ДанныеКоррекции.ДатаКоррекции)));
	КонецЕсли;
	Если Не ПустаяСтрока(ДанныеКоррекции.НомерПредписания) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Number",  XMLСтрока(ДанныеКоррекции.НомерПредписания));
	КонецЕсли;
	Если Не ПустаяСтрока(ДанныеКоррекции.ОписаниеКоррекции) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Description",  XMLСтрока(ДанныеКоррекции.ОписаниеКоррекции));
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ЗаписатьДанныеАгента(ЗаписьXML, ДанныеАгента, РевизияИнтерфейса = 0)
	
	Если РевизияИнтерфейса >= 3000 Тогда  // Версия стандарта 3.0 (ОФД 1.1)
		ЗаписьXML.ЗаписатьНачалоЭлемента("AgentData");
		Если Не ПустаяСтрока(ДанныеАгента.ПлатежныйАгент.Операция) Тогда // Операция платежного агента
			ЗаписьXML.ЗаписатьАтрибут("AgentOperation" , XMLСтрока(ДанныеАгента.ПлатежныйАгент.Операция));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ПлатежныйАгент.Телефон) Тогда // Телефон платежного агента
			ЗаписьXML.ЗаписатьАтрибут("AgentPhone" , XMLСтрока(ДанныеАгента.ПлатежныйАгент.Телефон));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ОператорПоПриемуПлатежей.Телефон) Тогда // Телефон оператора по приему платежей
			ЗаписьXML.ЗаписатьАтрибут("PaymentProcessorPhone", XMLСтрока(ДанныеАгента.ОператорПоПриемуПлатежей.Телефон));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ОператорПеревода.Телефон) Тогда // Телефон оператора перевода
			ЗаписьXML.ЗаписатьАтрибут("AcquirerOperatorPhone" , XMLСтрока(ДанныеАгента.ОператорПеревода.Телефон));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ОператорПеревода.Наименование) Тогда // Наименование оператора перевода
			ЗаписьXML.ЗаписатьАтрибут("AcquirerOperatorName" , XMLСтрока(ДанныеАгента.ОператорПеревода.Наименование));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ОператорПеревода.Адрес) Тогда // Адрес оператора перевода
			ЗаписьXML.ЗаписатьАтрибут("AcquirerOperatorAddress" , XMLСтрока(ДанныеАгента.ОператорПеревода.Адрес));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ОператорПеревода.ИНН) Тогда // ИНН оператора перевода
			ЗаписьXML.ЗаписатьАтрибут("AcquirerOperatorINN" , XMLСтрока(ДанныеАгента.ОператорПеревода.ИНН));
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	Иначе
		ЗаписьXML.ЗаписатьНачалоЭлемента("AgentData");
		Если Не ПустаяСтрока(ДанныеАгента.ПлатежныйАгент.Операция) Тогда
			ЗаписьXML.ЗаписатьАтрибут("PayingAgentOperation" , XMLСтрока(ДанныеАгента.ПлатежныйАгент.Операция));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ПлатежныйАгент.Телефон) Тогда
			ЗаписьXML.ЗаписатьАтрибут("PayingAgentPhone" , XMLСтрока(ДанныеАгента.ПлатежныйАгент.Телефон));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ОператорПоПриемуПлатежей.Телефон) Тогда
			ЗаписьXML.ЗаписатьАтрибут("ReceivePaymentsOperatorPhone" , XMLСтрока(ДанныеАгента.ОператорПоПриемуПлатежей.Телефон));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ОператорПеревода.Телефон) Тогда
			ЗаписьXML.ЗаписатьАтрибут("MoneyTransferOperatorPhone" , XMLСтрока(ДанныеАгента.ОператорПеревода.Телефон));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ОператорПеревода.Наименование) Тогда
			ЗаписьXML.ЗаписатьАтрибут("MoneyTransferOperatorName" , XMLСтрока(ДанныеАгента.ОператорПеревода.Наименование));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ОператорПеревода.Адрес) Тогда
			ЗаписьXML.ЗаписатьАтрибут("MoneyTransferOperatorAddress" , XMLСтрока(ДанныеАгента.ОператорПеревода.Адрес));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ОператорПеревода.ИНН) Тогда
			ЗаписьXML.ЗаписатьАтрибут("MoneyTransferOperatorVATIN" , XMLСтрока(ДанныеАгента.ОператорПеревода.ИНН));
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьДанныеПоставщика(ЗаписьXML, ДанныеПоставщика, РевизияИнтерфейса = 0)
	
	Если РевизияИнтерфейса >= 3000 Тогда // Версия стандарта 3.0 (ОФД 1.1)
		ЗаписьXML.ЗаписатьНачалоЭлемента("VendorData");
		Если Не ПустаяСтрока(ДанныеПоставщика.Телефон) Тогда // Телефон поставщика
			ЗаписьXML.ЗаписатьАтрибут("VendorPhone" , XMLСтрока(ДанныеПоставщика.Телефон));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеПоставщика.Наименование) Тогда // Наименование поставщика
			ЗаписьXML.ЗаписатьАтрибут("VendorName" , XMLСтрока(ДанныеПоставщика.Наименование));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеПоставщика.ИНН) Тогда // ИНН поставщика
			ЗаписьXML.ЗаписатьАтрибут("VendorINN" , XMLСтрока(ДанныеПоставщика.ИНН));
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	Иначе
		ЗаписьXML.ЗаписатьНачалоЭлемента("PurveyorData");
		Если Не ПустаяСтрока(ДанныеПоставщика.Телефон) Тогда
			ЗаписьXML.ЗаписатьАтрибут("PurveyorPhone" , XMLСтрока(ДанныеПоставщика.Телефон));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеПоставщика.Наименование) Тогда
			ЗаписьXML.ЗаписатьАтрибут("PurveyorName" , XMLСтрока(ДанныеПоставщика.Наименование));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеПоставщика.ИНН) Тогда
			ЗаписьXML.ЗаписатьАтрибут("PurveyorVATIN" , XMLСтрока(ДанныеПоставщика.ИНН));
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьДанныеКодаТоварнойНоменклатуры(ЗаписьXML, Позиция, ПараметрыФискализации)
	
	ДанныеКодаТоварнойНоменклатуры = Позиция.ДанныеКодаТоварнойНоменклатуры;
	ДанныеКодаТовара = Неопределено;
	
	// Код товара заполняемся для "товара".   
	Если Позиция.ПризнакПредметаРасчета <> Перечисления.ПризнакиПредметаРасчета.Товар
		И Позиция.ПризнакПредметаРасчета <> Перечисления.ПризнакиПредметаРасчета.ПодакцизныйТовар Тогда
		Возврат;
	КонецЕсли;
	
	// Требования к разработке драйверов подключаемого оборудования, версия 3.2 и выше.
	Если ПараметрыФискализации.РевизияИнтерфейса > 3001 Тогда 
		
		Если НЕ ПустаяСтрока(Позиция.КодВидаНоменклатурнойКлассификации) Тогда
			ДанныеКодаТовара = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(Позиция.КодВидаНоменклатурнойКлассификации);
			РеквизитКодаТовара = ДанныеКодаТовара.РеквизитКодаТовара;
		ИначеЕсли НЕ ПустаяСтрока(Позиция.ШтрихкодBase64) Тогда
			ДанныеКодаТовара = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(Позиция.ШтрихкодBase64, Истина);
			РеквизитКодаТовара = ДанныеКодаТовара.РеквизитКодаТовара;
		ИначеЕсли НЕ ПустаяСтрока(Позиция.Штрихкод) Тогда
			ДанныеКодаТовара = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(Позиция.Штрихкод);
			РеквизитКодаТовара = ДанныеКодаТовара.РеквизитКодаТовара;
		КонецЕсли;
		
		Если ПараметрыФискализации.РевизияИнтерфейса > 3003 Тогда // 3.4 и выше
			// ФФД 1.2
			Если НЕ ПустаяСтрока(РеквизитКодаТовара) И Не ПустаяСтрока(ДанныеКодаТовара.ШтрихкодBase64) Тогда // Запись тега 1163
				Если ПустаяСтрока(Позиция.КонтрольнаяМарка) Тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("GoodCodeData");
					ЗаписьXML.ЗаписатьАтрибут(ДанныеКодаТовара.НаименованиеРеквизита, XMLСтрока(ДанныеКодаТовара.ШтрихкодBase64));
					ЗаписьXML.ЗаписатьКонецЭлемента();
				КонецЕсли;
			КонецЕсли; 
		Иначе
			// ФФД 1.1
			ТипыИдентификаторов = КодТовараЗаполняетсяДляТиповИдентификаторов();
			ФормироватьРеквизитКодаТовара = Ложь;
			НачалоРеквизитКодаТовара = Лев(РеквизитКодаТовара, 3); 
			Если НЕ ПустаяСтрока(Позиция.КодВидаНоменклатурнойКлассификации) Тогда // СИЗ
				ФормироватьРеквизитКодаТовара = Истина
			ИначеЕсли НачалоРеквизитКодаТовара = "RQg" Тогда // EAN8 - Если первые 2 байта значения кода товара имеют значения "45h08h".
				ФормироватьРеквизитКодаТовара = ТипыИдентификаторов.Найти(Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеEAN8) <> Неопределено;
			ИначеЕсли НачалоРеквизитКодаТовара = "RQ0" Тогда // EAN13 - Если первые 2 байта значения кода товара имеют значения "45h0Dh".
				ФормироватьРеквизитКодаТовара = ТипыИдентификаторов.Найти(Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеEAN8) <> Неопределено;
			ИначеЕсли НачалоРеквизитКодаТовара = "SQ4" Тогда // ITF-14 - Если первые 2 байта значения кода товара имеют значения "49h0Eh".
				ФормироватьРеквизитКодаТовара = ТипыИдентификаторов.Найти(Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеITF14) <> Неопределено;
			ИначеЕсли НачалоРеквизитКодаТовара = "RE0" Тогда // GS1 Data Matrix или Data Matrix  - Если первые 2 байта значения кода товара имеют значения "44h4Dh".
				ФормироватьРеквизитКодаТовара = ТипыИдентификаторов.Найти(Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеDataMatrixGS1) <> Неопределено;
			ИначеЕсли НачалоРеквизитКодаТовара = "UkZ" Тогда // Меховые изделия - Если первые 2 байта значения кода товара имеют значения "52h46h".
				ФормироватьРеквизитКодаТовара = ТипыИдентификаторов.Найти(Перечисления.ТипыИдентификаторовТовараККТ.ИзделияИзНатуральногоМеха) <> Неопределено;
			ИначеЕсли НачалоРеквизитКодаТовара = "xRR" Тогда // ЕГАИС 2.0 - Если первые 2 байта значения кода товара имеют значения "C5h14h".
				ФормироватьРеквизитКодаТовара = ТипыИдентификаторов.Найти(Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеЕГАИС2) <> Неопределено;
			ИначеЕсли НачалоРеквизитКодаТовара = "xR4" Тогда // ЕГАИС 3.0 - Если первые 2 байта значения кода товара имеют значения "C5h1Eh".
				ФормироватьРеквизитКодаТовара = ТипыИдентификаторов.Найти(Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеЕГАИС3) <> Неопределено;
			КонецЕсли;
		
			Если Не ФормироватьРеквизитКодаТовара Тогда
				Возврат;
			КонецЕсли;
			
			// Если первые 2 байта значения кода товара имеют значения "00h00h" в автономном режиме реквизит не включается.
			Если ПараметрыФискализации.АвтономныйРежим И Лев(РеквизитКодаТовара, 2) = "AA" Тогда
				Возврат;
			КонецЕсли;
		
			// Реквизит кода товара (1162) для стандарта 3.2 и выше в ККТ передается в готовом виде.
			Если НЕ ПустаяСтрока(РеквизитКодаТовара) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("GoodCodeData");
				ЗаписьXML.ЗаписатьАтрибут("MarkingCode", XMLСтрока(РеквизитКодаТовара));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
		КонецЕсли
	Иначе
		// Требования к разработке драйверов подключаемого оборудования, версяи 3.1 и ниже.
		Если ПустаяСтрока(ДанныеКодаТоварнойНоменклатуры.ТипМаркировки) Тогда // Необходимо всегда указывать тип маркировки. 
			Возврат;
		КонецЕсли;
		Если ПустаяСтрока(ДанныеКодаТоварнойНоменклатуры.КонтрольныйИдентификационныйЗнак)
			И ПустаяСтрока(ДанныеКодаТоварнойНоменклатуры.ГлобальныйИдентификаторТорговойЕдиницы)
			И ПустаяСтрока(ДанныеКодаТоварнойНоменклатуры.СерийныйНомер) Тогда
				Возврат;
		КонецЕсли;
		ЗаписьXML.ЗаписатьНачалоЭлемента("GoodCodeData");
		Если Не ПустаяСтрока(ДанныеКодаТоварнойНоменклатуры.ТипМаркировки) Тогда // Тип маркировки.
			ТипМаркировки = МенеджерОборудованияКлиентСервер.КодТипаМаркировкиККТ(ДанныеКодаТоварнойНоменклатуры.ТипМаркировки);
			ЗаписьXML.ЗаписатьАтрибут("StampType", XMLСтрока(ТипМаркировки));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеКодаТоварнойНоменклатуры.КонтрольныйИдентификационныйЗнак) Тогда // Контрольный идентификационный знак (КиЗ).
			ЗаписьXML.ЗаписатьАтрибут("Stamp" , XMLСтрока(ДанныеКодаТоварнойНоменклатуры.КонтрольныйИдентификационныйЗнак));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеКодаТоварнойНоменклатуры.ГлобальныйИдентификаторТорговойЕдиницы) Тогда // Глобальный идентификатор торговой единицы (GTIN).
			ЗаписьXML.ЗаписатьАтрибут("GTIN" , XMLСтрока(ДанныеКодаТоварнойНоменклатуры.ГлобальныйИдентификаторТорговойЕдиницы));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеКодаТоварнойНоменклатуры.СерийныйНомер) Тогда // Серийный номер.
			ЗаписьXML.ЗаписатьАтрибут("SerialNumber" , XMLСтрока(ДанныеКодаТоварнойНоменклатуры.СерийныйНомер));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеКодаТоварнойНоменклатуры.РеквизитКодаТовара) Тогда // Ревизит кода товара.
			ЗаписьXML.ЗаписатьАтрибут("MarkingCode", XMLСтрока(ДанныеКодаТоварнойНоменклатуры.РеквизитКодаТовара));
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьДополнительныйРеквизитПользователя(ЗаписьXML, ДополнительныйРеквизитПользователя);
	
	Если ПустаяСтрока(ДополнительныйРеквизитПользователя.Наименование) 
		И ПустаяСтрока(ДополнительныйРеквизитПользователя.Значение) Тогда
			Возврат;
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("UserAttribute");
	Если Не ПустаяСтрока(ДополнительныйРеквизитПользователя.Наименование) Тогда // Наименование дополнительного реквизита пользователя.
		ЗаписьXML.ЗаписатьАтрибут("Name" , XMLСтрока(ДополнительныйРеквизитПользователя.Наименование));
	КонецЕсли;
	Если Не ПустаяСтрока(ДополнительныйРеквизитПользователя.Значение) Тогда // Значение дополнительного реквизита пользователя.
		ЗаписьXML.ЗаписатьАтрибут("Value", XMLСтрока(ДополнительныйРеквизитПользователя.Значение));
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ЗаписатьОперационныйРеквизит(ЗаписьXML, ОперационныйРеквизит)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("OperationalAttribute");
	
	Если Не ПустаяСтрока(ОперационныйРеквизит.ДатаВремяОперации) Тогда
		ЗаписьXML.ЗаписатьАтрибут("DateTime",  XMLСтрока(ОперационныйРеквизит.ДатаВремяОперации));
	КонецЕсли;
	Если Не ПустаяСтрока(ОперационныйРеквизит.ИдентификаторОперации) Тогда
		ЗаписьXML.ЗаписатьАтрибут("OperationID",  XMLСтрока(ОперационныйРеквизит.ИдентификаторОперации));
	КонецЕсли;
	Если Не ПустаяСтрока(ОперационныйРеквизит.ДанныеОперации) Тогда
		ЗаписьXML.ЗаписатьАтрибут("OperationData",  XMLСтрока(ОперационныйРеквизит.ДанныеОперации));
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ЗаписатьОтраслевойРеквизит(ЗаписьXML, ОтраслевойРеквизит)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("IndustryAttribute");
	
	Если Не ПустаяСтрока(ОтраслевойРеквизит.ИдентификаторФОИВ) Тогда
		ЗаписьXML.ЗаписатьАтрибут("IdentifierFOIV",  XMLСтрока(ОтраслевойРеквизит.ИдентификаторФОИВ));
	КонецЕсли;
	Если Не ПустаяСтрока(ОтраслевойРеквизит.ДатаДокументаОснования) Тогда
		ДатаДокументаОснования = Формат(ОтраслевойРеквизит.ДатаДокументаОснования, "ДФ=""дд.ММ.гггг""");
		ЗаписьXML.ЗаписатьАтрибут("DocumentDate",  ДатаДокументаОснования);
	КонецЕсли;
	Если Не ПустаяСтрока(ОтраслевойРеквизит.НомерДокументаОснования) Тогда
		ЗаписьXML.ЗаписатьАтрибут("DocumentNumber",  XMLСтрока(ОтраслевойРеквизит.НомерДокументаОснования));
	КонецЕсли;
	Если Не ПустаяСтрока(ОтраслевойРеквизит.ЗначениеРеквизита) Тогда
		ЗаписьXML.ЗаписатьАтрибут("AttributeValue",  XMLСтрока(ОтраслевойРеквизит.ЗначениеРеквизита));
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ЗаписатьСведенияОПокупателе(ЗаписьXML, ОбщиеПараметры, ПерсональныеДанные = Неопределено, ТипПерсональныхДанных = Неопределено);
	
	СведенияОПокупателе = ОбщиеПараметры.СведенияОПокупателе; 
	
	Покупатель = СведенияОПокупателе.Покупатель;
	Если ПустаяСтрока(Покупатель) Тогда
		Покупатель = ОбщиеПараметры.Получатель;
	КонецЕсли;
	
	Если ПерсональныеДанные <> Неопределено И ТипПерсональныхДанных <> Неопределено И ТипПерсональныхДанных = Перечисления.ТипыПерсональныхДанныхККТ.ИНН Тогда
		ПокупательИНН = ПерсональныеДанные.ИНН
	Иначе
		ПокупательИНН = СведенияОПокупателе.ПокупательИНН;
	КонецЕсли;
	
	Если ПустаяСтрока(ПокупательИНН) Тогда
		ПокупательИНН = ОбщиеПараметры.ПолучательИНН;
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CustomerDetail");
	
	Если Не ПустаяСтрока(Покупатель) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Info",  XMLСтрока(Покупатель));
	КонецЕсли;
	Если Не ПустаяСтрока(ПокупательИНН) Тогда
		ЗаписьXML.ЗаписатьАтрибут("INN",  XMLСтрока(ПокупательИНН));
	КонецЕсли;
	Если Не ПустаяСтрока(СведенияОПокупателе.ПокупательАдрес) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Address",  XMLСтрока(СведенияОПокупателе.ПокупательАдрес));
	КонецЕсли;
	
	Если ПерсональныеДанные <> Неопределено И ТипПерсональныхДанных <> Неопределено И ТипПерсональныхДанных = Перечисления.ТипыПерсональныхДанныхККТ.ПаспортныеДанные Тогда
		
		Если Не ПустаяСтрока(ПерсональныеДанные.Гражданство) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Citizenship",  XMLСтрока(ПерсональныеДанные.Гражданство));
		КонецЕсли;
		
		Если Не ПустаяСтрока(ПерсональныеДанные.ВидДокумента) Тогда
			ВидДокумента = МенеджерОборудованияКлиентСервер.КодВидДокументаУдостоверяющегоЛичность(ПерсональныеДанные.ВидДокумента);
			ЗаписьXML.ЗаписатьАтрибут("DocumentTypeCode",  XMLСтрока(ВидДокумента));
		КонецЕсли;
		
		Если Не ПустаяСтрока(ПерсональныеДанные.ДанныеДокумента) Тогда
			ЗаписьXML.ЗаписатьАтрибут("DocumentData",  XMLСтрока(ПерсональныеДанные.ДанныеДокумента));
		КонецЕсли;
		
		Если Не ПустаяСтрока(ПерсональныеДанные.ДатаРождения) Тогда
			ДатаРождения = Формат(ПерсональныеДанные.ДатаРождения, "ДФ=""дд.ММ.гггг""");
			ЗаписьXML.ЗаписатьАтрибут("DateOfBirth",  ДатаРождения);
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

// Процедура формирует XML пакет для Фискализация чека.
// Параметры: 
//   ОбщиеПараметры - Структура - параметры чека.
//   ПараметрыФискализации - Структура - параметры фискализации чека.
//   ВключатьПерсональныеДанные - Булево - признак использования персональных данных.
//   ПерсональныеДанные - Структура - .
//   ТипПерсональныхДанных - ПеречислениеСсылка.ТипыПерсональныхДанныхККТ - тип персональных данных. 
//
Процедура СформироватьXMLПакетДляФискализацияЧека(ОбщиеПараметры, ПараметрыФискализации, ВключатьПерсональныеДанные = Ложь, 
	ПерсональныеДанные = Неопределено, ТипПерсональныхДанных = Неопределено) Экспорт
	
	ПозицииЧека  = ОбщиеПараметры.ПозицииЧека;
	ТаблицаОплат = ОбщиеПараметры.ТаблицаОплат;
	Электронно   = ОбщиеПараметры.Электронно;
	
	ТипРасчета = МенеджерОборудованияКлиентСервер.КодРасчетаДенежнымиСредствами(ОбщиеПараметры.ТипРасчета);
	// СистемаНалогообложения = МенеджерОборудованияКлиентСервер.КодСистемыНалогообложенияККТ(ОбщиеПараметры.СистемаНалогообложения);
	СистемаНалогообложения = ОбщиеПараметры.КодСистемыНалогообложения;
	
	// Таблица оплат
	СуммаЧека = 0;
	СуммаНаличные       = 0;
	СуммаЭлектронно     = 0;
	СуммаПредоплата     = 0;
	СуммаПостоплата     = 0;
	СуммаПредоставление = 0;

	Если ТаблицаОплат <> Неопределено Тогда
		Для ИндексОплаты = 0 По ТаблицаОплат.Количество() - 1 Цикл
			Если ТаблицаОплат[ИндексОплаты].ТипОплаты = Перечисления.ТипыОплатыККТ.Электронно Тогда
				СуммаЭлектронно = СуммаЭлектронно + ТаблицаОплат[ИндексОплаты].Сумма;
			ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = Перечисления.ТипыОплатыККТ.Предоплата Тогда
				СуммаПредоплата = СуммаПредоплата + ТаблицаОплат[ИндексОплаты].Сумма;
			ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = Перечисления.ТипыОплатыККТ.Постоплата Тогда
				СуммаПостоплата = СуммаПостоплата + ТаблицаОплат[ИндексОплаты].Сумма;
			ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = Перечисления.ТипыОплатыККТ.ВстречноеПредоставление Тогда
				СуммаПредоставление = СуммаПредоставление + ТаблицаОплат[ИндексОплаты].Сумма;
			Иначе
				СуммаНаличные = СуммаНаличные + ТаблицаОплат[ИндексОплаты].Сумма;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ОплатаНеНаличными = СуммаЭлектронно + СуммаПостоплата + СуммаПредоплата + СуммаПредоставление; 

	// Пакетная печать чека. Подготовка пакета.
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CheckPackage");
	
	Если ПараметрыФискализации.РевизияИнтерфейса >= 3000 Тогда  // Версия стандарта 3.0 (ОФД 1.1)
		ЗаписьXML.ЗаписатьНачалоЭлемента("Parameters");
		ЗаписьXML.ЗаписатьАтрибут("CashierName",  XMLСтрока(ОбщиеПараметры.Кассир));
		Если Не ПустаяСтрока(ОбщиеПараметры.КассирИНН) Тогда 
			ЗаписьXML.ЗаписатьАтрибут("CashierINN", XMLСтрока(ОбщиеПараметры.КассирИНН));
		КонецЕсли;
		ЗаписьXML.ЗаписатьАтрибут("OperationType", XMLСтрока(ТипРасчета));
		ЗаписьXML.ЗаписатьАтрибут("TaxationSystem" , XMLСтрока(СистемаНалогообложения));
		
		Если Не ПустаяСтрока(ОбщиеПараметры.ОтправительEmail) И Электронно Тогда // Отправитель Email указывается только для Электронно.
			ЗаписьXML.ЗаписатьАтрибут("SenderEmail", XMLСтрока(ОбщиеПараметры.ОтправительEmail));
		КонецЕсли;
		
		Если ОбщиеПараметры.Свойство("АдресРасчетов") И НЕ ПустаяСтрока(ОбщиеПараметры.АдресРасчетов) Тогда   
			ЗаписьXML.ЗаписатьАтрибут("SaleAddress", XMLСтрока(ОбщиеПараметры.АдресРасчетов));
		КонецЕсли;
		Если ОбщиеПараметры.Свойство("МестоРасчетов") И НЕ ПустаяСтрока(ОбщиеПараметры.МестоРасчетов) Тогда  
			ЗаписьXML.ЗаписатьАтрибут("SaleLocation", XMLСтрока(ОбщиеПараметры.МестоРасчетов));
		КонецЕсли;
		
		// Email отправляет средствами 1C
		Если ОбщиеПараметры.Свойство("Отправляет1СEmail") И НЕ ОбщиеПараметры.Отправляет1СEmail Тогда
			ЗаписьXML.ЗаписатьАтрибут("CustomerEmail", XMLСтрока(?(ОбщиеПараметры.Свойство("ПокупательEmail"), ОбщиеПараметры.ПокупательEmail, "")));
		КонецЕсли;
		// SMS отправляет средствами 1C
		Если ОбщиеПараметры.Свойство("Отправляет1СSMS") И НЕ ОбщиеПараметры.Отправляет1СSMS Тогда
			ПокупательНомер = ?(ОбщиеПараметры.Свойство("ПокупательНомер"), ОбщиеПараметры.ПокупательНомер, "");
			Если Не ПустаяСтрока(ПокупательНомер) И Лев(ПокупательНомер, 1) <> "+" Тогда
				ПокупательНомер = "+" + ПокупательНомер;
			КонецЕсли;
			ЗаписьXML.ЗаписатьАтрибут("CustomerPhone", XMLСтрока(ПокупательНомер));
		КонецЕсли;
		
		Если ПараметрыФискализации.РевизияИнтерфейса < 3004 Тогда
			
			Получатель = ОбщиеПараметры.Получатель;
			Если ПустаяСтрока(Получатель) Тогда
				Получатель = ОбщиеПараметры.СведенияОПокупателе.Покупатель;
			КонецЕсли;
			ПолучательИНН = ОбщиеПараметры.ПолучательИНН;
			Если ПустаяСтрока(ПолучательИНН) Тогда
				ПолучательИНН = ОбщиеПараметры.СведенияОПокупателе.ПокупательИНН;
			КонецЕсли;
			Если ПерсональныеДанные <> Неопределено Тогда
				Если ТипПерсональныхДанных = Перечисления.ТипыПерсональныхДанныхККТ.ИНН Тогда
					ПокупательИНН = ПерсональныеДанные.ИНН;
				Иначе      
					Получатель = Получатель + Символы.НПП + ПерсональныеДанные.ДанныеДокумента;
				КонецЕсли;
			КонецЕсли;
			Если Не ПустаяСтрока(Получатель) Тогда
				ЗаписьXML.ЗаписатьАтрибут("CustomerInfo", XMLСтрока(Получатель));
			КонецЕсли;
			Если Не ПустаяСтрока(ПолучательИНН) Тогда
				ЗаписьXML.ЗаписатьАтрибут("CustomerINN", XMLСтрока(ПолучательИНН));
			КонецЕсли;
			
		Иначе
			Если ОбщиеПараметры.Свойство("НомерАвтомата") И НЕ ПустаяСтрока(ОбщиеПараметры.НомерАвтомата) Тогда
				ЗаписьXML.ЗаписатьАтрибут("AutomatNumber", XMLСтрока(ОбщиеПараметры.НомерАвтомата));
			КонецЕсли;
		КонецЕсли;
		
		Если ОбщиеПараметры.Свойство("ПризнакАгента") И НЕ ПустаяСтрока(ОбщиеПараметры.ПризнакАгента) Тогда
			ПризнакАгента = МенеджерОборудованияКлиентСервер.КодПризнакаАгента(ОбщиеПараметры.ПризнакАгента);
			ЗаписьXML.ЗаписатьАтрибут("AgentType", XMLСтрока(ПризнакАгента));
		КонецЕсли;
		
		Если ОбщиеПараметры.Свойство("ДополнительныйРеквизит") И НЕ ПустаяСтрока(ОбщиеПараметры.ДополнительныйРеквизит) Тогда  
			ЗаписьXML.ЗаписатьАтрибут("AdditionalAttribute", XMLСтрока(ОбщиеПараметры.ДополнительныйРеквизит));
		КонецЕсли;
		
		Если ОбщиеПараметры.Свойство("ДанныеКоррекции") Тогда
			ЗаписатьДанныеКоррекции(ЗаписьXML, ОбщиеПараметры.ДанныеКоррекции);
		КонецЕсли;
		
		Если ОбщиеПараметры.Свойство("ДополнительныйРеквизитПользователя") Тогда
			ЗаписатьДополнительныйРеквизитПользователя(ЗаписьXML, ОбщиеПараметры.ДополнительныйРеквизитПользователя);
		КонецЕсли;
		
		ЗаписатьДанныеАгента(ЗаписьXML, ОбщиеПараметры.ДанныеАгента, ПараметрыФискализации.РевизияИнтерфейса);
		ЗаписатьДанныеПоставщика(ЗаписьXML, ОбщиеПараметры.ДанныеПоставщика, ПараметрыФискализации.РевизияИнтерфейса);
		
		Если ПараметрыФискализации.РевизияИнтерфейса >= 3004 Тогда
			ЗаписатьСведенияОПокупателе(ЗаписьXML, ОбщиеПараметры, ПерсональныеДанные, ТипПерсональныхДанных);
			ЗаписатьОперационныйРеквизит(ЗаписьXML, ОбщиеПараметры.ОперационныйРеквизит);
			ЗаписатьОтраслевойРеквизит(ЗаписьXML, ОбщиеПараметры.ОтраслевойРеквизит);
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		// Табличная часть
		Если ОбщиеПараметры.ПозицииЧека <> Неопределено Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Positions");
			Для ИндексМассива = 0 По ОбщиеПараметры.ПозицииЧека.Количество() - 1 Цикл
				ТекущаяПозиция = ОбщиеПараметры.ПозицииЧека[ИндексМассива]; // см. МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека
				
				Если ТекущаяПозиция.Свойство("ФискальнаяСтрока") Тогда // Фискальная строка
					
					Если ТекущаяПозиция.ЦенаСоСкидками = 0 И ТекущаяПозиция.Сумма > 0 И ТекущаяПозиция.Количество > 0 Тогда
						ЦенаСоСкидками = Окр(ТекущаяПозиция.Сумма / ТекущаяПозиция.Количество, 2); 
					Иначе
						ЦенаСоСкидками = ТекущаяПозиция.ЦенаСоСкидками; 
					КонецЕсли;
					ЗаписьXML.ЗаписатьНачалоЭлемента("FiscalString");
					ЗаписьXML.ЗаписатьАтрибут("Name"              , XMLСтрока(ТекущаяПозиция.Наименование)); // Наименование товара.
					ЗаписьXML.ЗаписатьАтрибут("Quantity"          , XMLСтрока(ТекущаяПозиция.Количество)); // Количество товара.
					ЗаписьXML.ЗаписатьАтрибут("PriceWithDiscount" , XMLСтрока(ЦенаСоСкидками)); // Цена единицы товара с учетом скидок/наценок.
					ЗаписьXML.ЗаписатьАтрибут("AmountWithDiscount", XMLСтрока(ТекущаяПозиция.Сумма)); // Конечная сумма по позиции чека с учетом всех скидок/наценок.
					ЗаписьXML.ЗаписатьАтрибут("DiscountAmount"    , XMLСтрока(ТекущаяПозиция.СуммаСкидок)); // Сумма скидок и наценок.
					ЗаписьXML.ЗаписатьАтрибут("Department"        , XMLСтрока(ТекущаяПозиция.НомерСекции)); // Отдел, по которому ведется продажа
					
					Если НЕ ПустаяСтрока(ТекущаяПозиция.СтавкаНДС) Тогда 
						Если ТекущаяПозиция.СтавкаНДС = 118 Тогда
							ЗначениеСтавкаНДС = "18/118";
						ИначеЕсли ТекущаяПозиция.СтавкаНДС = 110 Тогда
							ЗначениеСтавкаНДС = "10/110";
						ИначеЕсли ТекущаяПозиция.СтавкаНДС = 120 Тогда
							ЗначениеСтавкаНДС = "20/120";
						Иначе
							ЗначениеСтавкаНДС = ТекущаяПозиция.СтавкаНДС;
						КонецЕсли;
					Иначе
						ЗначениеСтавкаНДС = "none";
					КонецЕсли;
					
					ЗаписьXML.ЗаписатьАтрибут("VATRate", XMLСтрока(ЗначениеСтавкаНДС)); // Ставка НДС
					Если ТекущаяПозиция.Свойство("СуммаНДС") Тогда
						ЗаписьXML.ЗаписатьАтрибут("VATAmount", XMLСтрока(ТекущаяПозиция.СуммаНДС));
					КонецЕсли;
					
					Если ТекущаяПозиция.Свойство("ПризнакСпособаРасчета") И НЕ ПустаяСтрока(ТекущаяПозиция.ПризнакСпособаРасчета) Тогда
						ПризнакСпособаРасчета = МенеджерОборудованияКлиентСервер.КодПризнакаСпособаРасчета(ТекущаяПозиция.ПризнакСпособаРасчета);
						ЗаписьXML.ЗаписатьАтрибут("PaymentMethod", XMLСтрока(ПризнакСпособаРасчета));
					КонецЕсли;
					Если ТекущаяПозиция.Свойство("ПризнакПредметаРасчета") И НЕ ПустаяСтрока(ТекущаяПозиция.ПризнакПредметаРасчета) Тогда
						ПризнакПредметаРасчета = МенеджерОборудованияКлиентСервер.КодПризнакаПредметаРасчета(ТекущаяПозиция.ПризнакПредметаРасчета, ПараметрыФискализации.РевизияИнтерфейса);
						Если ПризнакПредметаРасчета <> Неопределено Тогда
							ЗаписьXML.ЗаписатьАтрибут("CalculationSubject", XMLСтрока(ПризнакПредметаРасчета));
						КонецЕсли;
					КонецЕсли;
					Если ТекущаяПозиция.Свойство("ПризнакАгентаПоПредметуРасчета") И НЕ ПустаяСтрока(ТекущаяПозиция.ПризнакАгентаПоПредметуРасчета) Тогда
						ПризнакАгентаПоПредметуРасчета = МенеджерОборудованияКлиентСервер.КодПризнакаАгента(ТекущаяПозиция.ПризнакАгентаПоПредметуРасчета);
						ЗаписьXML.ЗаписатьАтрибут("CalculationAgent", XMLСтрока(ПризнакАгентаПоПредметуРасчета));
					КонецЕсли;
					
					Если ТекущаяПозиция.Свойство("ЕдиницаИзмерения") И ТекущаяПозиция.ЕдиницаИзмерения <> Неопределено Тогда
						ЗаписьXML.ЗаписатьАтрибут("MeasurementUnit", XMLСтрока(Лев(ТекущаяПозиция.ЕдиницаИзмерения, 16)));
					КонецЕсли;
					
					Если ТекущаяПозиция.Свойство("КодСтраныПроисхожденияТовара") И НЕ ПустаяСтрока(ТекущаяПозиция.КодСтраныПроисхожденияТовара) Тогда
						ЗаписьXML.ЗаписатьАтрибут("CountryOfOrigin", XMLСтрока(ТекущаяПозиция.КодСтраныПроисхожденияТовара));
					КонецЕсли;
					
					Если ТекущаяПозиция.Свойство("НомерТаможеннойДекларации") И НЕ ПустаяСтрока(ТекущаяПозиция.НомерТаможеннойДекларации) Тогда
						ЗаписьXML.ЗаписатьАтрибут("CustomsDeclaration", XMLСтрока(ТекущаяПозиция.НомерТаможеннойДекларации));
					КонецЕсли;
					
					Если ТекущаяПозиция.Свойство("СуммаАкциза") И ТекущаяПозиция.СуммаАкциза <> Неопределено Тогда
						ЗаписьXML.ЗаписатьАтрибут("ExciseAmount", XMLСтрока(ТекущаяПозиция.СуммаАкциза));
					КонецЕсли;
					
					Если ТекущаяПозиция.Свойство("ДополнительныйРеквизит") Тогда // Тэг 1191
						ДополнительныйРеквизит = "";
						Если НЕ ПустаяСтрока(ТекущаяПозиция.ДополнительныйРеквизит) Тогда
							ДополнительныйРеквизит = ТекущаяПозиция.ДополнительныйРеквизит;
						ИначеЕсли ТекущаяПозиция.Свойство("ДробноеКоличество") И ПараметрыФискализации.РевизияИнтерфейса < 3004  Тогда
							// Дробное количество, рекомендации ЦРПТ "ВЫВОД ТОВАРА ИЗ ОБОРОТА ПРИ РЕАЛИЗАЦИИ КОНЕЧНЫМ ПОТРЕБИТЕЛЯМ (ЧАСТИЧНАЯ ПРОДАЖА)"
							// для 1.0.5 и 1.1 - пишем в 1191, Формирование и  передача фискального  документав ГИС МТ 
							Если Не ПустаяСтрока(ТекущаяПозиция.ДробноеКоличество.Числитель) И Не ПустаяСтрока(ТекущаяПозиция.ДробноеКоличество.Знаменатель) Тогда
								Числитель = Число(ТекущаяПозиция.ДробноеКоличество.Числитель);
								Знаменатель = Число(ТекущаяПозиция.ДробноеКоличество.Знаменатель);
								ДополнительныйРеквизит = "mrk"; // Префикс «mrk», если  после «mrk» указание  дробной  части  отсутствует, упаковка считается выведенной из оборота полностью.
								Если Числитель <> Знаменатель Тогда
									ДополнительныйРеквизит = ДополнительныйРеквизит + Строка(Числитель) + "/" + Строка(Знаменатель) + "&"; 
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						Если Не ПустаяСтрока(ДополнительныйРеквизит) Тогда 
							ЗаписьXML.ЗаписатьАтрибут("AdditionalAttribute", XMLСтрока(ДополнительныйРеквизит));  // Тэг 1191
						КонецЕсли;
					КонецЕсли;
					
					Если ПараметрыФискализации.РевизияИнтерфейса >= 3004 Тогда
						
						Если Не ПустаяСтрока(ТекущаяПозиция.КонтрольнаяМарка) Тогда
							ЗаписьXML.ЗаписатьАтрибут("MarkingCode", XMLСтрока(ТекущаяПозиция.КонтрольнаяМарка));
						КонецЕсли;
						
						ДробноеКоличество = ТекущаяПозиция.ДробноеКоличество;
						Если Не ПустаяСтрока(ДробноеКоличество.Числитель) И Не ПустаяСтрока(ДробноеКоличество.Знаменатель) Тогда
							Если Не ПустаяСтрока(ТекущаяПозиция.КодЕдиницыИзмерения) Тогда
								МераКоличестваПредметаРасчета = МенеджерОборудованияКлиентСервер.МераКоличестваПредметаРасчетаПоКодуЕдиницыИзмерения(ТекущаяПозиция.КодЕдиницыИзмерения);
								МераКоличестваПредметаРасчета = МенеджерОборудованияКлиентСервер.КодМерыКоличестваПредметаРасчетаККТ(МераКоличестваПредметаРасчета);
								ЗаписьXML.ЗаписатьАтрибут("MeasureOfQuantity", XMLСтрока(МераКоличестваПредметаРасчета));
							КонецЕсли;
							Если Число(ДробноеКоличество.Числитель) > 0 И Число(ДробноеКоличество.Знаменатель) > 0 Тогда
								ЗаписьXML.ЗаписатьНачалоЭлемента("FractionalQuantity");
								ЗаписьXML.ЗаписатьАтрибут("Numerator", XMLСтрока(ДробноеКоличество.Числитель));
								ЗаписьXML.ЗаписатьАтрибут("Denominator", XMLСтрока(ДробноеКоличество.Знаменатель));
								ЗаписьXML.ЗаписатьКонецЭлемента();
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					ЗаписатьДанныеКодаТоварнойНоменклатуры(ЗаписьXML, ТекущаяПозиция, ПараметрыФискализации);
					ЗаписатьДанныеАгента(ЗаписьXML, ТекущаяПозиция.ДанныеАгента, ПараметрыФискализации.РевизияИнтерфейса);
					ЗаписатьДанныеПоставщика(ЗаписьXML, ТекущаяПозиция.ДанныеПоставщика, ПараметрыФискализации.РевизияИнтерфейса);
					Если ПараметрыФискализации.РевизияИнтерфейса >= 3004 Тогда
						ЗаписатьОтраслевойРеквизит(ЗаписьXML, ТекущаяПозиция.ОтраслевойРеквизит);
					КонецЕсли;
					ЗаписьXML.ЗаписатьКонецЭлемента();
					СуммаЧека = СуммаЧека + ТекущаяПозиция.Сумма;
			
				ИначеЕсли ТекущаяПозиция.Свойство("ТекстоваяСтрока") Тогда // Текстовая строка
					Если ТекущаяПозиция.Свойство("ПереносСтроки") И ТекущаяПозиция.ПереносСтроки Тогда 
						ТекстовыеСтроки = МенеджерОборудованияКлиентСервер.ПостроитьПолеПереносом(ТекущаяПозиция.Текст, ПараметрыФискализации.ШиринаСтроки);
					Иначе
						ТекстовыеСтроки = ТекущаяПозиция.Текст;
					КонецЕсли;
					Выравнивание = ?(ТекущаяПозиция.Свойство("Выравнивание"),  ТекущаяПозиция.Выравнивание, "Лево"); 
					Для НомерСтроки = 1 По СтрЧислоСтрок(ТекстовыеСтроки) Цикл
						ВыделеннаяСтрока = СтрПолучитьСтроку(ТекстовыеСтроки, НомерСтроки);
						ВыделеннаяСтрока = МенеджерОборудованияКлиентСервер.ВыравнитьПоле(ВыделеннаяСтрока, ПараметрыФискализации.ШиринаСтроки, Выравнивание); 
						ЗаписьXML.ЗаписатьНачалоЭлемента("TextString");
						ЗаписьXML.ЗаписатьАтрибут("Text", XMLСтрока(ВыделеннаяСтрока));
						ЗаписьXML.ЗаписатьКонецЭлемента();  
					КонецЦикла;
					
				ИначеЕсли ТекущаяПозиция.Свойство("ШтрихКод") Тогда // Штрихкод
					ЗаписьXML.ЗаписатьНачалоЭлемента("Barcode");
					ЗаписьXML.ЗаписатьАтрибут("Type" , XMLСтрока(ТекущаяПозиция.ТипШтрихкода));
					// Значение штрихкода. Штрихкод кодируется текстом в кодировке Base64.
					Если ПараметрыФискализации.РевизияИнтерфейса >= 3003 Тогда
						ШтрихКодBase64 = ШтрихкодВBase64(ТекущаяПозиция.ШтрихКод);
						Если ТекущаяПозиция.Свойство("ШтрихКодBase64") И 
							НЕ ПустаяСтрока(ТекущаяПозиция.ШтрихКодBase64) Тогда
							ШтрихКодBase64 = ТекущаяПозиция.ШтрихКодBase64;
						КонецЕсли;
						ЗаписьXML.ЗаписатьАтрибут("ValueBase64", XMLСтрока(ШтрихКодBase64));
					Иначе
						ЗаписьXML.ЗаписатьАтрибут("Value", XMLСтрока(ТекущаяПозиция.ШтрихКод));
					КонецЕсли;
					ЗаписьXML.ЗаписатьКонецЭлемента();
				КонецЕсли;
			КонецЦикла;
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		// Таблица оплат
		Если ТаблицаОплат <> Неопределено Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Payments");
			ЗаписьXML.ЗаписатьАтрибут("Cash", XMLСтрока(СуммаНаличные));
			ЗаписьXML.ЗаписатьАтрибут("ElectronicPayment", XMLСтрока(СуммаЭлектронно));
			ЗаписьXML.ЗаписатьАтрибут("PrePayment", XMLСтрока(СуммаПредоплата));
			ЗаписьXML.ЗаписатьАтрибут("PostPayment", XMLСтрока(СуммаПостоплата));
			ЗаписьXML.ЗаписатьАтрибут("Barter", XMLСтрока(СуммаПредоставление));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
	ИначеЕсли ПараметрыФискализации.РевизияИнтерфейса > 2001 Тогда  // Версия стандарта 2.2 и выше
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Parameters");
		ЗаписьXML.ЗаписатьАтрибут("PaymentType" , XMLСтрока(ТипРасчета));
		ЗаписьXML.ЗаписатьАтрибут("TaxVariant"  , XMLСтрока(СистемаНалогообложения));
		ЗаписьXML.ЗаписатьАтрибут("CashierName" , XMLСтрока(ОбщиеПараметры.Кассир));
		ЗаписьXML.ЗаписатьАтрибут("CashierVATIN", ?(ОбщиеПараметры.Свойство("КассирИНН"), XMLСтрока(ОбщиеПараметры.КассирИНН), ""));
		Если Не ПустаяСтрока(ОбщиеПараметры.ОтправительEmail) И Электронно Тогда // Отправитель Email указывается только для Электронно.
			ЗаписьXML.ЗаписатьАтрибут("SenderEmail", XMLСтрока(ОбщиеПараметры.ОтправительEmail));
		КонецЕсли;
		// Email отправляет средствами 1C
		Если ОбщиеПараметры.Свойство("Отправляет1СEmail") И НЕ ОбщиеПараметры.Отправляет1СEmail Тогда
			ЗаписьXML.ЗаписатьАтрибут("CustomerEmail", XMLСтрока(?(ОбщиеПараметры.Свойство("ПокупательEmail"), ОбщиеПараметры.ПокупательEmail, "")));
		КонецЕсли;
		// SMS отправляет средствами 1C
		Если ОбщиеПараметры.Свойство("Отправляет1СSMS") И НЕ ОбщиеПараметры.Отправляет1СSMS Тогда
			ПокупательНомер = ?(ОбщиеПараметры.Свойство("ПокупательНомер"), ОбщиеПараметры.ПокупательНомер, "");
			Если Не ПустаяСтрока(ПокупательНомер) И Лев(ПокупательНомер, 1) <> "+" Тогда
				ПокупательНомер = "+" + ПокупательНомер;
			КонецЕсли;
			ЗаписьXML.ЗаписатьАтрибут("CustomerPhone", XMLСтрока(ПокупательНомер));
		КонецЕсли;
			
		Если ОбщиеПараметры.Свойство("ПризнакАгента") И НЕ ПустаяСтрока(ОбщиеПараметры.ПризнакАгента) Тогда  // Атрибут с ФФД 1.0.5 
			ПризнакАгента = МенеджерОборудованияКлиентСервер.КодПризнакаАгента(ОбщиеПараметры.ПризнакАгента);
			ЗаписьXML.ЗаписатьАтрибут("AgentSign", XMLСтрока(ПризнакАгента));
		КонецЕсли;
		
		Если ОбщиеПараметры.Свойство("АдресРасчетов") И НЕ ПустаяСтрока(ОбщиеПараметры.АдресРасчетов) Тогда   
			ЗаписьXML.ЗаписатьАтрибут("AddressSettle", XMLСтрока(ОбщиеПараметры.АдресРасчетов));
		КонецЕсли;
		Если ОбщиеПараметры.Свойство("МестоРасчетов") И НЕ ПустаяСтрока(ОбщиеПараметры.МестоРасчетов) Тогда  
			ЗаписьXML.ЗаписатьАтрибут("PlaceSettle", XMLСтрока(ОбщиеПараметры.МестоРасчетов));
		КонецЕсли;
		
		Если Не ПустаяСтрока(ОбщиеПараметры.Получатель) Тогда
			ЗаписьXML.ЗаписатьАтрибут("CustomerInfo", XMLСтрока(ОбщиеПараметры.Получатель));
		КонецЕсли;
		Если Не ПустаяСтрока(ОбщиеПараметры.ПолучательИНН) Тогда
			ЗаписьXML.ЗаписатьАтрибут("CustomerINN", XMLСтрока(ОбщиеПараметры.ПолучательИНН));
		КонецЕсли;
		
		Если ОбщиеПараметры.Свойство("ДополнительныйРеквизит") И НЕ ПустаяСтрока(ОбщиеПараметры.ДополнительныйРеквизит) Тогда  
			ЗаписьXML.ЗаписатьАтрибут("AdditionalAttribute", XMLСтрока(ОбщиеПараметры.ДополнительныйРеквизит));
		КонецЕсли;
		
		Если ОбщиеПараметры.Свойство("ДополнительныйРеквизитПользователя") Тогда
			ЗаписатьДополнительныйРеквизитПользователя(ЗаписьXML, ОбщиеПараметры.ДополнительныйРеквизитПользователя);
		КонецЕсли;
		
		ЗаписатьДанныеАгента(ЗаписьXML, ОбщиеПараметры.ДанныеАгента);
		ЗаписатьДанныеПоставщика(ЗаписьXML, ОбщиеПараметры.ДанныеПоставщика);
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		// Табличная часть
		Если ОбщиеПараметры.ПозицииЧека <> Неопределено Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Positions");
			Для ИндексМассива = 0 По ОбщиеПараметры.ПозицииЧека.Количество() - 1 Цикл
				ТекущаяПозиция = ОбщиеПараметры.ПозицииЧека[ИндексМассива]; // см. МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека
				
				Если ТекущаяПозиция.Свойство("ФискальнаяСтрока") Тогда
						Если ТекущаяПозиция.ЦенаСоСкидками = 0 И ТекущаяПозиция.Сумма > 0 И ТекущаяПозиция.Количество > 0 Тогда
							ЦенаСоСкидками = Окр(ТекущаяПозиция.Сумма / ТекущаяПозиция.Количество, 2); 
						Иначе
							ЦенаСоСкидками = ТекущаяПозиция.ЦенаСоСкидками; 
						КонецЕсли;
						ЗаписьXML.ЗаписатьНачалоЭлемента("FiscalString");
						ЗаписьXML.ЗаписатьАтрибут("Name"             , XMLСтрока(ТекущаяПозиция.Наименование));
						ЗаписьXML.ЗаписатьАтрибут("Quantity"         , XMLСтрока(ТекущаяПозиция.Количество));
						ЗаписьXML.ЗаписатьАтрибут("PriceWithDiscount", XMLСтрока(ЦенаСоСкидками));
						ЗаписьXML.ЗаписатьАтрибут("SumWithDiscount"  , XMLСтрока(ТекущаяПозиция.Сумма));
						ЗаписьXML.ЗаписатьАтрибут("DiscountSum"      , XMLСтрока(ТекущаяПозиция.СуммаСкидок));
						ЗаписьXML.ЗаписатьАтрибут("Department"       , XMLСтрока(ТекущаяПозиция.НомерСекции));
						
						Если НЕ ПустаяСтрока(ТекущаяПозиция.СтавкаНДС) Тогда 
							Если ТекущаяПозиция.СтавкаНДС = 118 Тогда
								ЗначениеСтавкаНДС = "18/118";
							ИначеЕсли ТекущаяПозиция.СтавкаНДС = 110 Тогда
								ЗначениеСтавкаНДС = "10/110";
							ИначеЕсли ТекущаяПозиция.СтавкаНДС = 120 Тогда
								ЗначениеСтавкаНДС = "20/120";
							Иначе
								ЗначениеСтавкаНДС = ТекущаяПозиция.СтавкаНДС;
							КонецЕсли;
						Иначе
							ЗначениеСтавкаНДС = "none";
						КонецЕсли;
						ЗаписьXML.ЗаписатьАтрибут("Tax", XMLСтрока(ЗначениеСтавкаНДС));
						
						Если ТекущаяПозиция.Свойство("ПризнакСпособаРасчета") И НЕ ПустаяСтрока(ТекущаяПозиция.ПризнакСпособаРасчета) Тогда
							ПризнакСпособаРасчета = МенеджерОборудованияКлиентСервер.КодПризнакаСпособаРасчета(ТекущаяПозиция.ПризнакСпособаРасчета);
							ЗаписьXML.ЗаписатьАтрибут("SignMethodCalculation", XMLСтрока(ПризнакСпособаРасчета));
						КонецЕсли;
						Если ТекущаяПозиция.Свойство("ПризнакПредметаРасчета") И НЕ ПустаяСтрока(ТекущаяПозиция.ПризнакПредметаРасчета) Тогда
							ПризнакПредметаРасчета = МенеджерОборудованияКлиентСервер.КодПризнакаПредметаРасчета(ТекущаяПозиция.ПризнакПредметаРасчета);
							Если ПризнакПредметаРасчета <> Неопределено Тогда
								ЗаписьXML.ЗаписатьАтрибут("SignCalculationObject", XMLСтрока(ПризнакПредметаРасчета));
							КонецЕсли;
						КонецЕсли;
						
						Если ТекущаяПозиция.Свойство("СуммаНДС") И НЕ ПустаяСтрока(ТекущаяПозиция.СуммаНДС) Тогда
						ЗаписьXML.ЗаписатьАтрибут("TaxSum", XMLСтрока(ТекущаяПозиция.СуммаНДС));
						КонецЕсли;
						
						Если ТекущаяПозиция.Свойство("ПризнакАгентаПоПредметуРасчета") И НЕ ПустаяСтрока(ТекущаяПозиция.ПризнакАгентаПоПредметуРасчета) Тогда
							ПризнакАгентаПоПредметуРасчета = МенеджерОборудованияКлиентСервер.КодПризнакаАгента(ТекущаяПозиция.ПризнакАгентаПоПредметуРасчета);
							ЗаписьXML.ЗаписатьАтрибут("SignSubjectCalculationAgent", XMLСтрока(ПризнакАгентаПоПредметуРасчета));
						КонецЕсли;
						
						Если ТекущаяПозиция.Свойство("ЕдиницаИзмерения") И ТекущаяПозиция.ЕдиницаИзмерения <> Неопределено Тогда
							ЗаписьXML.ЗаписатьАтрибут("MeasurementUnit", XMLСтрока(Лев(ТекущаяПозиция.ЕдиницаИзмерения, 16)));
						КонецЕсли;
						
						Если ТекущаяПозиция.Свойство("КодСтраныПроисхожденияТовара") И НЕ ПустаяСтрока(ТекущаяПозиция.КодСтраныПроисхожденияТовара) Тогда
							ЗаписьXML.ЗаписатьАтрибут("CountryOfOrigin", XMLСтрока(ТекущаяПозиция.КодСтраныПроисхожденияТовара));
						КонецЕсли;
						Если ТекущаяПозиция.Свойство("НомерТаможеннойДекларации") И НЕ ПустаяСтрока(ТекущаяПозиция.НомерТаможеннойДекларации) Тогда
							ЗаписьXML.ЗаписатьАтрибут("CustomsDeclaration", XMLСтрока(ТекущаяПозиция.НомерТаможеннойДекларации));
						КонецЕсли;
						Если ТекущаяПозиция.Свойство("СуммаАкциза") И ТекущаяПозиция.СуммаАкциза <> Неопределено Тогда
							ЗаписьXML.ЗаписатьАтрибут("ExciseAmount", XMLСтрока(XMLСтрока(ТекущаяПозиция.СуммаАкциза)));
						КонецЕсли;
						
						Если ТекущаяПозиция.Свойство("ДополнительныйРеквизит") И НЕ ПустаяСтрока(ТекущаяПозиция.ДополнительныйРеквизит) Тогда
							ЗаписьXML.ЗаписатьАтрибут("AdditionalAttribute", XMLСтрока(XMLСтрока(ТекущаяПозиция.ДополнительныйРеквизит)));
						КонецЕсли;
						
						ЗаписатьДанныеАгента(ЗаписьXML, ТекущаяПозиция.ДанныеАгента);
						ЗаписатьДанныеПоставщика(ЗаписьXML, ТекущаяПозиция.ДанныеПоставщика);
						ЗаписатьДанныеКодаТоварнойНоменклатуры(ЗаписьXML, ТекущаяПозиция, ПараметрыФискализации);
						
						ЗаписьXML.ЗаписатьКонецЭлемента();
						СуммаЧека = СуммаЧека + ТекущаяПозиция.Сумма;
						
					ИначеЕсли ТекущаяПозиция.Свойство("ТекстоваяСтрока") Тогда
						
						Если ТекущаяПозиция.Свойство("ПереносСтроки") И ТекущаяПозиция.ПереносСтроки Тогда 
							ТекстовыеСтроки = МенеджерОборудованияКлиентСервер.ПостроитьПолеПереносом(ТекущаяПозиция.Текст, ПараметрыФискализации.ШиринаСтроки);
						Иначе
							ТекстовыеСтроки = ТекущаяПозиция.Текст;
						КонецЕсли;
						Выравнивание = ?(ТекущаяПозиция.Свойство("Выравнивание"),  ТекущаяПозиция.Выравнивание, "Лево"); 
						Для НомерСтроки = 1 По СтрЧислоСтрок(ТекстовыеСтроки) Цикл
							ВыделеннаяСтрока = СтрПолучитьСтроку(ТекстовыеСтроки, НомерСтроки);
							ВыделеннаяСтрока = МенеджерОборудованияКлиентСервер.ВыравнитьПоле(ВыделеннаяСтрока, ПараметрыФискализации.ШиринаСтроки, Выравнивание); 
							ЗаписьXML.ЗаписатьНачалоЭлемента("TextString");
							ЗаписьXML.ЗаписатьАтрибут("Text", XMLСтрока(ВыделеннаяСтрока));
							ЗаписьXML.ЗаписатьКонецЭлемента();  
						КонецЦикла;
						
					ИначеЕсли ТекущаяПозиция.Свойство("ШтрихКод") Тогда
						ЗаписьXML.ЗаписатьНачалоЭлемента("Barcode");
						ЗаписьXML.ЗаписатьАтрибут("BarcodeType", XMLСтрока(ТекущаяПозиция.ТипШтрихкода));
						ЗаписьXML.ЗаписатьАтрибут("Barcode", XMLСтрока(ТекущаяПозиция.ШтрихКод));
						ЗаписьXML.ЗаписатьКонецЭлемента();
					КонецЕсли;
			КонецЦикла;
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		// Таблица оплат
		Если ТаблицаОплат <> Неопределено Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Payments");
			ЗаписьXML.ЗаписатьАтрибут("Cash"             , XMLСтрока(СуммаНаличные));
			ЗаписьXML.ЗаписатьАтрибут("ElectronicPayment", XMLСтрока(СуммаЭлектронно));
			ЗаписьXML.ЗаписатьАтрибут("Credit"           , XMLСтрока(СуммаПостоплата));
			ЗаписьXML.ЗаписатьАтрибут("AdvancePayment"   , XMLСтрока(СуммаПредоплата));
			ЗаписьXML.ЗаписатьАтрибут("CashProvision"    , XMLСтрока(СуммаПредоставление));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ДанныеЧекаXML = ЗаписьXML.Закрыть();
	
	Если ВключатьПерсональныеДанные Тогда
		ПараметрыФискализации.ДанныеЧекаXMLПерсональныеДанные = ДанныеЧекаXML;
	Иначе
		ПараметрыФискализации.ДанныеЧекаXML = ДанныеЧекаXML;
		ПараметрыФискализации.ТипРасчета = ОбщиеПараметры.ТипРасчета;
		ПараметрыФискализации.СуммаЧека = СуммаЧека;
		ПараметрыФискализации.ОплатаНаличные    = ?(СуммаНаличные + ОплатаНеНаличными > СуммаЧека, СуммаЧека - ОплатаНеНаличными, СуммаНаличные); 
		ПараметрыФискализации.ОплатаЭлектронно  = СуммаЭлектронно;
		ПараметрыФискализации.ОплатаПостоплата  = СуммаПостоплата;
		ПараметрыФискализации.ОплатаПредоплата  = СуммаПредоплата;
		ПараметрыФискализации.ОплатаВстречноеПредоставление = СуммаПредоставление;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьXMLПакетДляЧекаКоррекции(ОбщиеПараметры, ПараметрыФискализации) Экспорт
	
	Если ПараметрыФискализации.РевизияИнтерфейса >= 3000 Тогда  // Версия стандарта 3.0 (ОФД 1.1)
		 
		СформироватьXMLПакетДляФискализацияЧека(ОбщиеПараметры, ПараметрыФискализации);
		
	Иначе
		ТипРасчета = МенеджерОборудованияКлиентСервер.КодРасчетаДенежнымиСредствами(ОбщиеПараметры.ТипРасчета);
		СистемаНалогообложения = МенеджерОборудованияКлиентСервер.КодСистемыНалогообложенияККТ(ОбщиеПараметры.СистемаНалогообложения);
		
		ЗаписьXML = Новый ЗаписьXML();
		ЗаписьXML.УстановитьСтроку("UTF-8");
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("CheckCorrectionPackage");
		ЗаписьXML.ЗаписатьНачалоЭлемента("Parameters");
		ЗаписьXML.ЗаписатьАтрибут("PaymentType", XMLСтрока(ТипРасчета));
		ЗаписьXML.ЗаписатьАтрибут("TaxVariant" , XMLСтрока(СистемаНалогообложения));
		ЗаписьXML.ЗаписатьАтрибут("CashierName",  XMLСтрока(ОбщиеПараметры.Кассир));
		ЗаписьXML.ЗаписатьАтрибут("CashierVATIN", ?(ОбщиеПараметры.Свойство("КассирИНН"), XMLСтрока(ОбщиеПараметры.КассирИНН), ""));
		
		Если ОбщиеПараметры.Свойство("ДанныеКоррекции") Тогда
			ДанныеКоррекции = ОбщиеПараметры.ДанныеКоррекции;
			ТипКоррекции = ?(ПустаяСтрока(ДанныеКоррекции.ТипКоррекции), 0, ДанныеКоррекции.ТипКоррекции);   
			ЗаписьXML.ЗаписатьАтрибут("CorrectionType",  XMLСтрока(ТипКоррекции));
			Если Не ПустаяСтрока(ДанныеКоррекции.ДатаКоррекции) Тогда
				ЗаписьXML.ЗаписатьАтрибут("CorrectionBaseDate",  XMLСтрока(НачалоДня(ДанныеКоррекции.ДатаКоррекции)));
			КонецЕсли;
			Если Не ПустаяСтрока(ДанныеКоррекции.НомерПредписания) Тогда
				ЗаписьXML.ЗаписатьАтрибут("CorrectionBaseNumber",  XMLСтрока(ДанныеКоррекции.НомерПредписания));
			КонецЕсли;
			Если Не ПустаяСтрока(ДанныеКоррекции.ОписаниеКоррекции) Тогда
				ЗаписьXML.ЗаписатьАтрибут("CorrectionBaseName",  XMLСтрока(ДанныеКоррекции.ОписаниеКоррекции));
			КонецЕсли;
		КонецЕсли;
		
		Если ОбщиеПараметры.Свойство("ДополнительныйРеквизит") И НЕ ПустаяСтрока(ОбщиеПараметры.ДополнительныйРеквизит) Тогда  
			ЗаписьXML.ЗаписатьАтрибут("AdditionalAttribute", XMLСтрока(ОбщиеПараметры.ДополнительныйРеквизит));
		КонецЕсли;
		
		СуммаЧека   = 0;
		СуммаНДС10  = 0;
		СуммаНДС18  = 0;
		СуммаНДС20  = 0;
		СуммаНДС110 = 0;
		СуммаНДС118 = 0;
		СуммаНДС120 = 0;
		СуммаНДС0   = 0;
		СуммаБезНДС = 0;
		
		Если ОбщиеПараметры.ПозицииЧека <> Неопределено Тогда
			Для ИндексМассива = 0 По ОбщиеПараметры.ПозицииЧека.Количество() - 1 Цикл
				ПозицияЧека = ОбщиеПараметры.ПозицииЧека[ИндексМассива];
				Если ПозицияЧека.Свойство("ФискальнаяСтрока") Тогда
					
					СуммаЧека = СуммаЧека + ПозицияЧека.Сумма; // Сумма позиции
					СтавкаНДС = ПозицияЧека.СтавкаНДС; // Ставка НДС
					СуммаНДС = ?(ПустаяСтрока(ПозицияЧека.СуммаНДС), 0, ПозицияЧека.СуммаНДС);  // Сумма НДС
					Если СтавкаНДС = 10 Тогда
						СуммаНДС10 = СуммаНДС10 + ?(СуммаНДС > 0, СуммаНДС, ПозицияЧека.Сумма / 110 * 10);
					ИначеЕсли СтавкаНДС = 18 Тогда
						СуммаНДС18 = СуммаНДС18 + ?(СуммаНДС > 0, СуммаНДС, ПозицияЧека.Сумма / 118 * 18);
					ИначеЕсли СтавкаНДС = 20 Тогда
						СуммаНДС20 = СуммаНДС20 + ?(СуммаНДС > 0, СуммаНДС, ПозицияЧека.Сумма / 120 * 20);
					ИначеЕсли СтавкаНДС = 0 Тогда
						СуммаНДС0 = СуммаНДС0 + ПозицияЧека.Сумма;
					ИначеЕсли СтавкаНДС = 110 Тогда
						СуммаНДС110 = СуммаНДС110 + ?(СуммаНДС > 0, СуммаНДС, ПозицияЧека.Сумма / 110 * 10);
					ИначеЕсли СтавкаНДС = 118 Тогда
						СуммаНДС118 = СуммаНДС118 + ?(СуммаНДС > 0, СуммаНДС, ПозицияЧека.Сумма / 118 * 18);
					ИначеЕсли СтавкаНДС = 120 Тогда
						СуммаНДС120 = СуммаНДС120 + ?(СуммаНДС > 0, СуммаНДС, ПозицияЧека.Сумма / 120 * 20);
					Иначе 
						СуммаБезНДС = СуммаБезНДС + ПозицияЧека.Сумма;
					КонецЕсли;
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли;
		
		СуммаНаличные       = 0;
		СуммаЭлектронно     = 0;
		СуммаПостоплата     = 0;
		СуммаПредоплата     = 0;
		СуммаПредоставление = 0;
		ТаблицаОплат = ОбщиеПараметры.ТаблицаОплат; 
		Для ИндексОплаты = 0 По ТаблицаОплат.Количество() - 1 Цикл
			Если ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно") Тогда
				СуммаЭлектронно = СуммаЭлектронно + ТаблицаОплат[ИндексОплаты].Сумма;
			ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Предоплата") Тогда
				СуммаПредоплата = СуммаПредоплата + ТаблицаОплат[ИндексОплаты].Сумма;
			ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата") Тогда
				СуммаПостоплата = СуммаПостоплата + ТаблицаОплат[ИндексОплаты].Сумма;
			ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.ВстречноеПредоставление") Тогда
				СуммаПредоставление = СуммаПредоставление + ТаблицаОплат[ИндексОплаты].Сумма;
			Иначе
				СуммаНаличные = СуммаНаличные + ТаблицаОплат[ИндексОплаты].Сумма;
			КонецЕсли;
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьАтрибут("Sum"       , XMLСтрока(СуммаЧека));
		ЗаписьXML.ЗаписатьАтрибут("SumTAXNone", XMLСтрока(СуммаБезНДС)); 
		ЗаписьXML.ЗаписатьАтрибут("SumTAX0"   , XMLСтрока(Окр(СуммаНДС0, 2)));
		ЗаписьXML.ЗаписатьАтрибут("SumTAX10"  , XMLСтрока(Окр(СуммаНДС10, 2))); 
		ЗаписьXML.ЗаписатьАтрибут("SumTAX18"  , XMLСтрока(Окр(СуммаНДС18, 2))); 
		ЗаписьXML.ЗаписатьАтрибут("SumTAX20"  , XMLСтрока(Окр(СуммаНДС20, 2))); 
		ЗаписьXML.ЗаписатьАтрибут("SumTAX110" , XMLСтрока(Окр(СуммаНДС110, 2))); 
		ЗаписьXML.ЗаписатьАтрибут("SumTAX118" , XMLСтрока(Окр(СуммаНДС118, 2)));
		ЗаписьXML.ЗаписатьАтрибут("SumTAX120" , XMLСтрока(Окр(СуммаНДС120, 2)));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Payments");
		ЗаписьXML.ЗаписатьАтрибут("Cash"             , XMLСтрока(СуммаНаличные));
		ЗаписьXML.ЗаписатьАтрибут("ElectronicPayment", XMLСтрока(СуммаЭлектронно));
		ЗаписьXML.ЗаписатьАтрибут("Credit"           , XMLСтрока(СуммаПостоплата));
		ЗаписьXML.ЗаписатьАтрибут("AdvancePayment"   , XMLСтрока(СуммаПредоплата));
		ЗаписьXML.ЗаписатьАтрибут("CashProvision"    , XMLСтрока(СуммаПредоставление));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ПараметрыФискализации.ДанныеЧекаXML = ЗаписьXML.Закрыть();
		ПараметрыФискализации.ТипРасчета = ОбщиеПараметры.ТипРасчета;
		ПараметрыФискализации.СуммаЧека = СуммаЧека;
		ПараметрыФискализации.ОплатаНаличные    = СуммаНаличные; 
		ПараметрыФискализации.ОплатаЭлектронно  = СуммаЭлектронно;
		ПараметрыФискализации.ОплатаПостоплата  = СуммаПостоплата;
		ПараметрыФискализации.ОплатаПредоплата  = СуммаПредоплата;
		ПараметрыФискализации.ОплатаВстречноеПредоставление = СуммаПредоставление;

	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьXMLПакетДляТекста(СтрокаТекста, РевизияИнтерфейса = 0) Экспорт
	
	Результат = Новый Массив();
	
	// Пакетная печать чека. Подготовка пакета.
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("Document");
	                              
	Если НЕ ПустаяСтрока(СтрокаТекста) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Positions");
		
		Для НомерСтроки = 1 По СтрЧислоСтрок(СтрокаТекста) Цикл
			
			ВыделеннаяСтрока = СтрПолучитьСтроку(СтрокаТекста, НомерСтроки);
			
			Если (Найти(ВыделеннаяСтрока, "[отрезка]") > 0)
				 Или (Найти(ВыделеннаяСтрока, "[cut]") > 0) Тогда
				 
				// Завершаем запись текущего пакета. 
				ЗаписьXML.ЗаписатьКонецЭлемента();
				ЗаписьXML.ЗаписатьКонецЭлемента();
				Текст = ЗаписьXML.Закрыть();
				Результат.Добавить(Текст);
				
				// Новый пакет.
				ЗаписьXML = Новый ЗаписьXML();
				ЗаписьXML.УстановитьСтроку("UTF-8");
				ЗаписьXML.ЗаписатьОбъявлениеXML();
				ЗаписьXML.ЗаписатьНачалоЭлемента("Document");
				ЗаписьXML.ЗаписатьНачалоЭлемента("Positions");
				
			ИначеЕсли (Найти(ВыделеннаяСтрока, "|ШтрихКод|") > 0) Тогда
				ВыделеннаяСтрока = Сред(ВыделеннаяСтрока, СтрДлина("|ШтрихКод|") + 1);
				ВремТипШтрихкода = Сред(ВыделеннаяСтрока, 1, Найти(ВыделеннаяСтрока, "|") - 1);
	 			ВремШтрихКод = Сред(ВыделеннаяСтрока, Найти(ВыделеннаяСтрока, "|") + 1); 
				ЗаписьXML.ЗаписатьНачалоЭлемента("Barcode");
				Если РевизияИнтерфейса >= 3000 Тогда  // Версия стандарта 3.0 (ОФД 1.1)
					ЗаписьXML.ЗаписатьАтрибут("Type", XMLСтрока(ВремТипШтрихкода));
					// Значение штрихкода. Штрихкод кодируется текстом в кодировке Base64.
					Если РевизияИнтерфейса >= 3003 Тогда
						ШтрихКодBase64 = ШтрихкодВBase64(ВремШтрихКод);
						ЗаписьXML.ЗаписатьАтрибут("ValueBase64", XMLСтрока(ШтрихКодBase64));
					Иначе
						ЗаписьXML.ЗаписатьАтрибут("Value", XMLСтрока(ВремШтрихКод));
					КонецЕсли;
				Иначе
					ЗаписьXML.ЗаписатьАтрибут("BarcodeType", XMLСтрока(ВремТипШтрихкода));
					ЗаписьXML.ЗаписатьАтрибут("Barcode", XMLСтрока(ВремШтрихКод));
				КонецЕсли;
				ЗаписьXML.ЗаписатьКонецЭлемента();
			Иначе
				ЗаписьXML.ЗаписатьНачалоЭлемента("TextString");
				ЗаписьXML.ЗаписатьАтрибут("Text", XMLСтрока(ВыделеннаяСтрока));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
		
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Текст = ЗаписьXML.Закрыть();
	
	Результат.Добавить(Текст);
	
	Возврат Результат;

КонецФункции   

Функция ПолучитьXMLПакетДляТекстовогоДокумента(НефискальныеДокументы, ВыходныеПараметры, ШиринаСтроки = 32, РевизияИнтерфейса = 0) Экспорт
	
	Результат = Новый Массив();
	
	Для Каждого ПозицииЧека Из НефискальныеДокументы Цикл
		
		// Пакетная печать чека. Подготовка пакета.
		ЗаписьXML = Новый ЗаписьXML();
		ЗаписьXML.УстановитьСтроку("UTF-8");
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		ЗаписьXML.ЗаписатьНачалоЭлемента("Document");
		
		// Табличная часть
		Если ПозицииЧека <> Неопределено Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Positions");
			Для ИндексМассива = 0 По ПозицииЧека.Количество() - 1 Цикл
				ТекущаяПозиция = ПозицииЧека[ИндексМассива]; // см. МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека
				Если ТекущаяПозиция.Свойство("ФискальнаяСтрока") Тогда
						ЗаписьXML.ЗаписатьНачалоЭлемента("FiscalString");
						ЗаписьXML.ЗаписатьАтрибут("Name"      , XMLСтрока(ТекущаяПозиция.Наименование));
						ЗаписьXML.ЗаписатьАтрибут("Quantity"  , XMLСтрока(ТекущаяПозиция.Количество));
						ЗаписьXML.ЗаписатьАтрибут("Price"     , XMLСтрока(ТекущаяПозиция.Цена));
						ЗаписьXML.ЗаписатьАтрибут("Amount"    , XMLСтрока(ТекущаяПозиция.Сумма));
						ЗаписьXML.ЗаписатьАтрибут("Department", XMLСтрока(ТекущаяПозиция.НомерСекции));
						Если НЕ ПустаяСтрока(ТекущаяПозиция.СтавкаНДС) Тогда 
							ЗаписьXML.ЗаписатьАтрибут("Tax"   , XMLСтрока(ТекущаяПозиция.СтавкаНДС));
						Иначе
							ЗаписьXML.ЗаписатьАтрибут("Tax"   , "none");
						КонецЕсли;
						ЗаписьXML.ЗаписатьКонецЭлемента();
					ИначеЕсли ТекущаяПозиция.Свойство("ТекстоваяСтрока") Тогда
						Если ТекущаяПозиция.Свойство("ПереносСтроки") И ТекущаяПозиция.ПереносСтроки Тогда 
							ТекстовыеСтроки = МенеджерОборудованияКлиентСервер.ПостроитьПолеПереносом(ТекущаяПозиция.Текст, ШиринаСтроки);
						Иначе
							ТекстовыеСтроки = ТекущаяПозиция.Текст;
						КонецЕсли;
						Выравнивание = ?(ТекущаяПозиция.Свойство("Выравнивание"),  ТекущаяПозиция.Выравнивание, "Лево"); 
						Для НомерСтроки = 1 По СтрЧислоСтрок(ТекстовыеСтроки) Цикл
							ВыделеннаяСтрока = СтрПолучитьСтроку(ТекстовыеСтроки, НомерСтроки);
							ВыделеннаяСтрока = МенеджерОборудованияКлиентСервер.ВыравнитьПоле(ВыделеннаяСтрока, ШиринаСтроки, Выравнивание); 
							ЗаписьXML.ЗаписатьНачалоЭлемента("TextString");
							ЗаписьXML.ЗаписатьАтрибут("Text", XMLСтрока(ВыделеннаяСтрока));
							ЗаписьXML.ЗаписатьКонецЭлемента();  
						КонецЦикла;
					ИначеЕсли ТекущаяПозиция.Свойство("ШтрихКод") Тогда
						ЗаписьXML.ЗаписатьНачалоЭлемента("Barcode");
						Если РевизияИнтерфейса >= 3000 Тогда  // Версия стандарта 3.0 (ОФД 1.1)
							ЗаписьXML.ЗаписатьАтрибут("Type", XMLСтрока(ТекущаяПозиция.ТипШтрихкода));
							// Значение штрихкода. Штрихкод кодируется текстом в кодировке Base64.
							Если РевизияИнтерфейса >= 3003 Тогда
								ШтрихКодBase64 = ШтрихкодВBase64(ТекущаяПозиция.ШтрихКод);
								Если ТекущаяПозиция.Свойство("ШтрихКодBase64") И 
									НЕ ПустаяСтрока(ТекущаяПозиция.ШтрихКодBase64) Тогда
									ШтрихКодBase64 = ТекущаяПозиция.ШтрихКодBase64;
								КонецЕсли;
								ЗаписьXML.ЗаписатьАтрибут("ValueBase64", XMLСтрока(ШтрихКодBase64));
							Иначе
								ЗаписьXML.ЗаписатьАтрибут("Value", XMLСтрока(ТекущаяПозиция.ШтрихКод));
							КонецЕсли;
						Иначе
							ЗаписьXML.ЗаписатьАтрибут("BarcodeType", XMLСтрока(ТекущаяПозиция.ТипШтрихкода));
							ЗаписьXML.ЗаписатьАтрибут("Barcode", XMLСтрока(ТекущаяПозиция.ШтрихКод));
						КонецЕсли;
						ЗаписьXML.ЗаписатьКонецЭлемента();
					Иначе
						ТекстОшибки = НСтр("ru='Не определен тип позиции чека.'"); 
						ВыходныеПараметры.Очистить();
						ВыходныеПараметры.Вставить("ТекстОшибки", ТекстОшибки);
						Результат = Ложь;  
						Возврат Результат;
				КонецЕсли;
			КонецЦикла;
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		Текст = ЗаписьXML.Закрыть();
		Результат.Добавить(Текст);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции  

// Получить параметры состояния из XML пакета.
//
Функция ПолучитьПараметрыСостоянияИзXMLПакета(Данные, НомерСмены = Неопределено) Экспорт
	
	Параметры = МенеджерОборудованияКлиентСервер.ПараметрыНормализуемыхФискальныхДанных();
	Параметры.НомерСменыККТ = НомерСмены;
	
	Если Не ПустаяСтрока(Данные) Тогда
		ЧтениеXML = Новый ЧтениеXML; 
		ЧтениеXML.УстановитьСтроку(Данные);
		ЧтениеXML.ПерейтиКСодержимому();
		Если ЧтениеXML.Имя = "StatusParameters" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если ЧтениеXML.Прочитать() И ЧтениеXML.Имя = "Parameters" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
				КоличествоНепереданныхФД = ЧтениеXML.ЗначениеАтрибута("BacklogDocumentsCounter");
				Параметры.КоличествоНепереданныхФД    = ?(ПустаяСтрока(КоличествоНепереданныхФД), 0, Число(КоличествоНепереданныхФД));
				Параметры.НомерПервогоНепереданногоФД = ЧтениеXML.ЗначениеАтрибута("BacklogDocumentFirstNumber");
				ДатаПервогоНепереданногоФД = ЧтениеXML.ЗначениеАтрибута("BacklogDocumentFirstDateTime");
				Если НЕ ПустаяСтрока(ДатаПервогоНепереданногоФД) Тогда
					Параметры.ДатаПервогоНепереданногоФД = XMLЗначение(Тип("Дата"), ДатаПервогоНепереданногоФД);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

// Получить таблицу параметров смены из ККТ.
//
// Возвращаемое значение:
// Структура.
//
Функция ПолучитьПараметрыСменыИзXMLПакета(ДанныеXML, РевизияИнтерфейса = 0) Экспорт
	
	Параметры = МенеджерОборудованияКлиентСервер.ПараметрыНормализуемыхФискальныхДанных();
	
	Если Не ПустаяСтрока(ДанныеXML) Тогда
		
		ЧтениеXML = Новый ЧтениеXML; 
		ЧтениеXML.УстановитьСтроку(ДанныеXML);
		ЧтениеXML.ПерейтиКСодержимому();
		
		Если РевизияИнтерфейса >= 3000 Тогда  // Версия стандарта 3.0 (ОФД 1.1)
			
			Если ЧтениеXML.Имя = "OutputParameters" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				Если ЧтениеXML.Прочитать() И ЧтениеXML.Имя = "Parameters" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
					Параметры.НомерСменыККТ = ЧтениеXML.ЗначениеАтрибута("ShiftNumber");
					Параметры.НомерЧекаККТ  = ЧтениеXML.ЗначениеАтрибута("CheckNumber");
					ДатаСменыККТ = ЧтениеXML.ЗначениеАтрибута("DateTime");
					Если НЕ ПустаяСтрока(ДатаСменыККТ) Тогда
						Параметры.ДатаСменыККТ = XMLЗначение(Тип("Дата"), ДатаСменыККТ);
					КонецЕсли;
					Параметры.НомерЧекаЗаСмену = ЧтениеXML.ЗначениеАтрибута("ShiftClosingCheckNumber");
					Параметры.СтатусСмены      = Число(ЧтениеXML.ЗначениеАтрибута("ShiftState"));
					Параметры.ОстатокНаличных  = ЧтениеXML.ЗначениеАтрибута("CashBalance");
					Параметры.НеобходимаСтрочнаяЗаменаФН = ВРег(ЧтениеXML.ЗначениеАтрибута("FNError")) = "TRUE";
					Параметры.ПамятьФНПереполнена        = ВРег(ЧтениеXML.ЗначениеАтрибута("FNOverflow")) = "TRUE";
					Параметры.РесурсФНИсчерпан           = ВРег(ЧтениеXML.ЗначениеАтрибута("FNFail")) = "TRUE";
					КоличествоНепереданныхФД = ЧтениеXML.ЗначениеАтрибута("BacklogDocumentsCounter");
					Параметры.КоличествоНепереданныхФД    = ?(ПустаяСтрока(КоличествоНепереданныхФД), 0, Число(КоличествоНепереданныхФД));
					Параметры.НомерПервогоНепереданногоФД = ЧтениеXML.ЗначениеАтрибута("BacklogDocumentFirstNumber");
					ДатаПервогоНепереданногоФД = ЧтениеXML.ЗначениеАтрибута("BacklogDocumentFirstDateTime");
					Если НЕ ПустаяСтрока(ДатаПервогоНепереданногоФД) Тогда
						Параметры.ДатаПервогоНепереданногоФД = XMLЗначение(Тип("Дата"), ДатаПервогоНепереданногоФД);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			Если ЧтениеXML.Имя = "OutputParameters" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				Если ЧтениеXML.Прочитать() И ЧтениеXML.Имя = "Parameters" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
					Параметры.ПревышеноВремяОжиданияОтветаОФД = ВРег(ЧтениеXML.ЗначениеАтрибута("OFDtimeout")) = "TRUE";
					Параметры.НеобходимаСтрочнаяЗаменаФН = ВРег(ЧтениеXML.ЗначениеАтрибута("UrgentReplacementFN")) = "TRUE";
					Параметры.ПамятьФНПереполнена        = ВРег(ЧтениеXML.ЗначениеАтрибута("MemoryOverflowFN")) = "TRUE";
					Параметры.РесурсФНИсчерпан           = ВРег(ЧтениеXML.ЗначениеАтрибута("ResourcesExhaustionFN")) = "TRUE";
					КоличествоНепереданныхФД = ЧтениеXML.ЗначениеАтрибута("BacklogDocumentsCounter");
					Параметры.КоличествоНепереданныхФД    = ?(ПустаяСтрока(КоличествоНепереданныхФД), 0, Число(КоличествоНепереданныхФД));
					Параметры.НомерПервогоНепереданногоФД = ЧтениеXML.ЗначениеАтрибута("BacklogDocumentFirstNumber");
					ДатаПервогоНепереданногоФД = ЧтениеXML.ЗначениеАтрибута("BacklogDocumentFirstDateTime");
					Если НЕ ПустаяСтрока(ДатаПервогоНепереданногоФД) Тогда
						Параметры.ДатаПервогоНепереданногоФД = XMLЗначение(Тип("Дата"), ДатаПервогоНепереданногоФД);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

// Заполнить результаты фискализация чека из XML пакета.
//
Процедура ЗаполнитьРезультатыФискализацияЧекаИзXMLПакета(ПараметрыФискализации) Экспорт
	
	Если  ОбщегоНазначенияСтоматология.ПолучитьЗначениеКонстанты("РежимТестированияККТ") Тогда 
		
		ПараметрыФискализации.НомерСменыККТ = 1;
		ПараметрыФискализации.НомерЧекаККТ  = 1; 
		
		Возврат;
		
	КонецЕсли;        	
	
	Если Не ПустаяСтрока(ПараметрыФискализации.РезультатОперацииXML) Тогда
		ЧтениеXML = Новый ЧтениеXML; 
		ЧтениеXML.УстановитьСтроку(ПараметрыФискализации.РезультатОперацииXML);
		ЧтениеXML.ПерейтиКСодержимому();
		Если ЧтениеXML.Имя = "DocumentOutputParameters" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если ЧтениеXML.Прочитать() И ЧтениеXML.Имя = "Parameters" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
				ПараметрыФискализации.НомерСменыККТ = ЧтениеXML.ЗначениеАтрибута("ShiftNumber");
				ПараметрыФискализации.НомерЧекаККТ  = ЧтениеXML.ЗначениеАтрибута("CheckNumber");
				ПараметрыФискализации.НомерЧекаЗаСмену   = ЧтениеXML.ЗначениеАтрибута("ShiftClosingCheckNumber");
				ПараметрыФискализации.ФискальныйПризнак  = ЧтениеXML.ЗначениеАтрибута("FiscalSign");
				ПараметрыФискализации.АдресСайтаПроверки = ЧтениеXML.ЗначениеАтрибута("AddressSiteInspections");
				ДатаВремяЧека = ЧтениеXML.ЗначениеАтрибута("DateTime");
				Если НЕ ПустаяСтрока(ДатаВремяЧека) Тогда
					ПараметрыФискализации.ДатаВремяЧека = XMLЗначение(Тип("Дата"), ДатаВремяЧека);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Функция формирует шаблон чека.
//
Функция СформироватьШаблонЧека(ОбщиеПараметры, ДополнительныйТекст = Неопределено, ИдентификаторУстройства = Неопределено) Экспорт
	
	СтандартнаяОбработка = Истина;
	ТипОборудования = "ККТ";
	
	ШаблонЧека = МенеджерОборудованияВызовСервераПереопределяемый.СформироватьШаблонЧека(ОбщиеПараметры, ДополнительныйТекст, СтандартнаяОбработка, ТипОборудования); 
	Если СтандартнаяОбработка Тогда
		Возврат ОбщиеПараметры;
	Иначе
		Возврат ШаблонЧека;
	КонецЕсли;
	
КонецФункции

// Получить шаблон атрибутов чека для отсылки.
// 
Функция ШаблонАтрибутовЧекаДляОтсылки(ПараметрыФискализации) Экспорт 
	
	ТекстСообщения  = НСтр("ru='ККТ№:'") + ПараметрыФискализации.РегистрационныйНомерККТ + ";" + Символы.НПП 
		+ НСтр("ru='СУММА:'") + Формат(ПараметрыФискализации.СуммаЧека, "ЧРД=.;ЧЦ=12;ЧДЦ=2;ЧН=0.00;ЧГ=0") + ";" + Символы.НПП 
		+ НСтр("ru='ДФ:'")  + Формат(ПараметрыФискализации.ДатаВремяЧека, "дд.ММ.гггг ЧЧ:мм") + ";" + Символы.НПП 
		+ НСтр("ru='ФН№:'") + ПараметрыФискализации.ЗаводскойНомерФН + ";" + Символы.НПП 
		+ НСтр("ru='ФД№:'") + ПараметрыФискализации.НомерЧекаККТ + ";" + Символы.НПП 
		+ НСтр("ru='ФПД:'") + ПараметрыФискализации.ФискальныйПризнак + ";" + Символы.НПП 
		+ НСтр("ru='САЙТ:'") + ПараметрыФискализации.АдресСайтаПроверки;
		
	Возврат ТекстСообщения;
	
КонецФункции 

Функция ЗначениеXMLАтрибута(ЧтениеXML, ИмяАтрибута, ДопИмяАтрибута = Неопределено, ЗначениеПоУмолчанию = Неопределено)
	
	Результат = ЗначениеПоУмолчанию;
	Если ЧтениеXML.ЗначениеАтрибута(ИмяАтрибута) <> Неопределено Тогда  
		Результат = ЧтениеXML.ЗначениеАтрибута(ИмяАтрибута);
	ИначеЕсли НЕ ПустаяСтрока(ДопИмяАтрибута) И ЧтениеXML.ЗначениеАтрибута(ДопИмяАтрибута) <> Неопределено Тогда
		Результат = ЧтениеXML.ЗначениеАтрибута(ДопИмяАтрибута);
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

// Получить структуру чека из XML.
//
// Возвращаемое значение:
// Структура 
//
Функция ЗагрузитьДанныеФискализацииИзXML(ДанныеXML) Экспорт
	
	ОбщиеПараметры = МенеджерОборудованияКлиентСервер.ПараметрыОперацииЧекаКоррекции();
	
	СтавкиНДС = Новый Соответствие();
	СтавкиНДС.Вставить("10", 10); 
	СтавкиНДС.Вставить("18", 18);
	СтавкиНДС.Вставить("20", 20);
	СтавкиНДС.Вставить("0", 0);
	СтавкиНДС.Вставить("10/110", 110);
	СтавкиНДС.Вставить("18/118", 118);
	СтавкиНДС.Вставить("20/120", 120);
	СтавкиНДС.Вставить("none", Неопределено);
	ФискальнаяСтрока = Неопределено;
	
	Если Не ПустаяСтрока(ДанныеXML) Тогда
		ЧтениеXML = Новый ЧтениеXML; 
		ЧтениеXML.УстановитьСтроку(ДанныеXML);
		ЧтениеXML.ПерейтиКСодержимому();
		Если ЧтениеXML.Имя = "CheckPackage" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Пока ЧтениеXML.Прочитать() Цикл
				Если ЧтениеXML.Имя = "Parameters" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
					ТипРасчета = ?(ЧтениеXML.ЗначениеАтрибута("PaymentType") <> Неопределено, ЧтениеXML.ЗначениеАтрибута("PaymentType"), ЧтениеXML.ЗначениеАтрибута("OperationType"));
					ОбщиеПараметры.ТипРасчета = МенеджерОборудованияКлиентСервер.РасчетДенежнымиСредствамиПоКоду(Число(ТипРасчета));
					
					СистемаНалогообложения = ?(ЧтениеXML.ЗначениеАтрибута("TaxVariant") <> Неопределено, ЧтениеXML.ЗначениеАтрибута("TaxVariant"), ЧтениеXML.ЗначениеАтрибута("TaxationSystem"));
					ОбщиеПараметры.СистемаНалогообложения = МенеджерОборудованияКлиентСервер.СистемаНалогообложенияККТПоКоду(Число(СистемаНалогообложения));
					
					ОбщиеПараметры.Кассир = ЧтениеXML.ЗначениеАтрибута("CashierName");
					ОбщиеПараметры.КассирИНН = ЗначениеXMLАтрибута(ЧтениеXML, "CashierVATIN", "CashierINN", Неопределено);
					
					ОбщиеПараметры.ОтправительEmail = ЧтениеXML.ЗначениеАтрибута("SenderEmail");
					ОбщиеПараметры.ПокупательEmail = ЧтениеXML.ЗначениеАтрибута("CustomerEmail");
					ОбщиеПараметры.ПокупательНомер = ЧтениеXML.ЗначениеАтрибута("CustomerPhone");
					ОбщиеПараметры.ПризнакАгента = ЧтениеXML.ЗначениеАтрибута("AgentSign");
					ОбщиеПараметры.АдресРасчетов = ЗначениеXMLАтрибута(ЧтениеXML, "SaleAddress", "AddressSettle");
					ОбщиеПараметры.МестоРасчетов = ЗначениеXMLАтрибута(ЧтениеXML, "SaleLocation", "PlaceSettle");
					
					ОбщиеПараметры.ДополнительныйРеквизит = ЧтениеXML.ЗначениеАтрибута("AdditionalAttribute");
					Если ЧтениеXML.ЗначениеАтрибута("AgentSign") <> Неопределено Тогда  
						ПризнакАгента = Число(ЧтениеXML.ЗначениеАтрибута("AgentSign"));
						ОбщиеПараметры.ПризнакАгента = МенеджерОборудованияКлиентСервер.ПризнакАгентаПоКоду(ПризнакАгента);
					КонецЕсли;
					ОбщиеПараметры.Получатель    = ЧтениеXML.ЗначениеАтрибута("CustomerInfo");
					ОбщиеПараметры.ПолучательИНН = ЧтениеXML.ЗначениеАтрибута("CustomerINN");
				КонецЕсли;
				
				Если ЧтениеXML.Имя = "PurveyorData" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда   
					ОбщиеПараметры.ДанныеПоставщика.Наименование = ЗначениеXMLАтрибута(ЧтениеXML, "PurveyorName");
					ОбщиеПараметры.ДанныеПоставщика.Телефон = ЗначениеXMLАтрибута(ЧтениеXML, "PurveyorPhone");
					ОбщиеПараметры.ДанныеПоставщика.ИНН = ЗначениеXMLАтрибута(ЧтениеXML, "PurveyorVATIN");
				КонецЕсли;
				
				Если ЧтениеXML.Имя = "VendorData" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда   
					ОбщиеПараметры.ДанныеПоставщика.Наименование = ЗначениеXMLАтрибута(ЧтениеXML, "VendorName");
					ОбщиеПараметры.ДанныеПоставщика.Телефон = ЗначениеXMLАтрибута(ЧтениеXML, "VendorPhone");
					ОбщиеПараметры.ДанныеПоставщика.ИНН = ЗначениеXMLАтрибута(ЧтениеXML, "VendorINN");
				КонецЕсли;
				
				Если ЧтениеXML.Имя = "CustomerDetail" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда   
					ОбщиеПараметры.СведенияОПокупателе.Покупатель = ЗначениеXMLАтрибута(ЧтениеXML, "Info");
					ОбщиеПараметры.СведенияОПокупателе.ПокупательИНН = ЗначениеXMLАтрибута(ЧтениеXML, "INN");
					ОбщиеПараметры.СведенияОПокупателе.ПокупательАдрес = ЗначениеXMLАтрибута(ЧтениеXML, "Address");
				КонецЕсли;
				
				Если ЧтениеXML.Имя = "AgentData" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда   
					ДанныеАгента = ОбщиеПараметры.ДанныеАгента;
					ДанныеАгента.ПлатежныйАгент.Операция = ЗначениеXMLАтрибута(ЧтениеXML, "AgentOperation", "PayingAgentOperation");
					ДанныеАгента.ПлатежныйАгент.Телефон  = ЗначениеXMLАтрибута(ЧтениеXML, "AgentPhone", "PayingAgentPhone");
					ДанныеАгента.ОператорПеревода.Телефон      = ЗначениеXMLАтрибута(ЧтениеXML, "AcquirerOperatorPhone", "MoneyTransferOperatorPhone");
					ДанныеАгента.ОператорПеревода.Наименование = ЗначениеXMLАтрибута(ЧтениеXML, "AcquirerOperatorName", "MoneyTransferOperatorName");
					ДанныеАгента.ОператорПеревода.Адрес        = ЗначениеXMLАтрибута(ЧтениеXML, "AcquirerOperatorAddress", "MoneyTransferOperatorAddress");
					ДанныеАгента.ОператорПеревода.ИНН          = ЗначениеXMLАтрибута(ЧтениеXML, "AcquirerOperatorINN", "MoneyTransferOperatorVATIN");
					ДанныеАгента.ОператорПоПриемуПлатежей.Телефон = ЗначениеXMLАтрибута(ЧтениеXML, "PaymentProcessorPhone", "ReceivePaymentsOperatorPhone");
				КонецЕсли;
				
				Если ЧтениеXML.Имя = "UserAttribute" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда   
					ОбщиеПараметры.ДополнительныйРеквизитПользователя.Наименование = ЗначениеXMLАтрибута(ЧтениеXML, "Name");
					ОбщиеПараметры.ДополнительныйРеквизитПользователя.Значение = ЗначениеXMLАтрибута(ЧтениеXML, "Value");
				КонецЕсли;
		
				Если ЧтениеXML.Имя = "Positions" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
					
					Пока ЧтениеXML.Прочитать() И НЕ (ЧтениеXML.Имя = "Positions" И ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента) Цикл
						
						Если ЧтениеXML.Имя = "FiscalString" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
							ФискальнаяСтрока = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
							
							ФискальнаяСтрока.Наименование =  ЗначениеXMLАтрибута(ЧтениеXML, "Name");
							ФискальнаяСтрока.Количество   =  Число(ЗначениеXMLАтрибута(ЧтениеXML, "Quantity", , 0));
							
							ФискальнаяСтрока.ЦенаСоСкидками =  Число(ЗначениеXMLАтрибута(ЧтениеXML, "PriceWithDiscount", , 0));
							ФискальнаяСтрока.Сумма          =  Число(ЗначениеXMLАтрибута(ЧтениеXML, "AmountWithDiscount", "SumWithDiscount", 0));
							СуммаСкидок = ЗначениеXMLАтрибута(ЧтениеXML, "DiscountAmount", "DiscountSum", 0);
							Если Не ПустаяСтрока(СуммаСкидок) Тогда
								ФискальнаяСтрока.СуммаСкидок  =  Число(СуммаСкидок);
							КонецЕсли;
							ФискальнаяСтрока.НомерСекции = Число(ЗначениеXMLАтрибута(ЧтениеXML, "Department", , 0));
							ФискальнаяСтрока.ЕдиницаИзмерения = ЗначениеXMLАтрибута(ЧтениеXML, "MeasurementUnit");
								
							СтавкаНДС = ЗначениеXMLАтрибута(ЧтениеXML, "VATRate", "Tax");
							ФискальнаяСтрока.СтавкаНДС = СтавкиНДС.Получить(СтавкаНДС);
							
							СуммаНДС = ЗначениеXMLАтрибута(ЧтениеXML, "VATAmount", "TaxSum", 0);
							Если Не ПустаяСтрока(СуммаНДС) Тогда
								ФискальнаяСтрока.СуммаНДС = Число(СуммаНДС);
							КонецЕсли;
							
							ПризнакСпособаРасчета = Число(ЗначениеXMLАтрибута(ЧтениеXML, "SignMethodCalculation", "PaymentMethod", 0));
							ФискальнаяСтрока.ПризнакСпособаРасчета = МенеджерОборудованияКлиентСервер.ПризнакСпособаРасчетаПоКоду(ПризнакСпособаРасчета);
							
							ПризнакПредметаРасчета = Число(ЗначениеXMLАтрибута(ЧтениеXML, "SignCalculationObject", "CalculationSubject", 0));
							ФискальнаяСтрока.ПризнакПредметаРасчета =  МенеджерОборудованияКлиентСервер.ПризнакПредметаРасчетаПоКоду(ПризнакПредметаРасчета);
							
							Если ЧтениеXML.ЗначениеАтрибута("SignSubjectCalculationAgent") <> Неопределено Или ЧтениеXML.ЗначениеАтрибута("CalculationAgent") <> Неопределено Тогда
								ПризнакАгента = Число(ЗначениеXMLАтрибута(ЧтениеXML, "SignSubjectCalculationAgent", "CalculationAgent", 0));
								ФискальнаяСтрока.ПризнакАгентаПоПредметуРасчета = МенеджерОборудованияКлиентСервер.ПризнакАгентаПоКоду(ПризнакАгента);
							КонецЕсли;
								
							ФискальнаяСтрока.КодСтраныПроисхожденияТовара = ЗначениеXMLАтрибута(ЧтениеXML, "CountryOfOrigin");
							ФискальнаяСтрока.НомерТаможеннойДекларации = ЗначениеXMLАтрибута(ЧтениеXML, "CustomsDeclaration");
							ФискальнаяСтрока.ДополнительныйРеквизит = ЗначениеXMLАтрибута(ЧтениеXML, "AdditionalAttribute");
							
							СуммаАкциза = ЗначениеXMLАтрибута(ЧтениеXML, "ExciseAmount");
							Если НЕ ПустаяСтрока(СуммаАкциза) Тогда
								Если Число(СуммаАкциза) > 0 Тогда 
									ФискальнаяСтрока.СуммаАкциза = Число(СуммаАкциза);
								КонецЕсли;
							КонецЕсли;
							
							Если ЧтениеXML.ЗначениеАтрибута("MarkingCode") <> Неопределено Тогда
								ФискальнаяСтрока.КонтрольнаяМарка = ЧтениеXML.ЗначениеАтрибута("MarkingCode"); 
							КонецЕсли;
							
							ОбщиеПараметры.ПозицииЧека.Добавить(ФискальнаяСтрока);
						КонецЕсли;
						
						Если ЧтениеXML.Имя = "AgentData" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда   
							Если ФискальнаяСтрока <> Неопределено Тогда
								ДанныеАгента = ФискальнаяСтрока.ДанныеАгента;
								ДанныеАгента.ПлатежныйАгент.Операция = ЗначениеXMLАтрибута(ЧтениеXML, "AgentOperation", "PayingAgentOperation");
								ДанныеАгента.ПлатежныйАгент.Телефон  = ЗначениеXMLАтрибута(ЧтениеXML, "AgentPhone", "PayingAgentPhone");
								ДанныеАгента.ОператорПеревода.Телефон      = ЗначениеXMLАтрибута(ЧтениеXML, "AcquirerOperatorPhone", "MoneyTransferOperatorPhone");
								ДанныеАгента.ОператорПеревода.Наименование = ЗначениеXMLАтрибута(ЧтениеXML, "AcquirerOperatorName", "MoneyTransferOperatorName");
								ДанныеАгента.ОператорПеревода.Адрес        = ЗначениеXMLАтрибута(ЧтениеXML, "AcquirerOperatorAddress", "MoneyTransferOperatorAddress");
								ДанныеАгента.ОператорПеревода.ИНН          = ЗначениеXMLАтрибута(ЧтениеXML, "AcquirerOperatorINN", "MoneyTransferOperatorVATIN");
								ДанныеАгента.ОператорПоПриемуПлатежей.Телефон = ЗначениеXMLАтрибута(ЧтениеXML, "PaymentProcessorPhone", "ReceivePaymentsOperatorPhone");
							КонецЕсли;
						КонецЕсли;
							
						Если ЧтениеXML.Имя = "PurveyorData" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда   
							Если ФискальнаяСтрока <> Неопределено Тогда
								ФискальнаяСтрока.ДанныеПоставщика.Наименование = ЗначениеXMLАтрибута(ЧтениеXML, "PurveyorName");
								ФискальнаяСтрока.ДанныеПоставщика.Телефон = ЗначениеXMLАтрибута(ЧтениеXML, "PurveyorPhone");
								ФискальнаяСтрока.ДанныеПоставщика.ИНН = ЗначениеXMLАтрибута(ЧтениеXML, "PurveyorVATIN");
							КонецЕсли;
						КонецЕсли;
						
						Если ЧтениеXML.Имя = "VendorData" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда   
							Если ФискальнаяСтрока <> Неопределено Тогда
								ФискальнаяСтрока.ДанныеПоставщика.Наименование = ЗначениеXMLАтрибута(ЧтениеXML, "VendorName");
								ФискальнаяСтрока.ДанныеПоставщика.Телефон = ЗначениеXMLАтрибута(ЧтениеXML, "VendorPhone");
								ФискальнаяСтрока.ДанныеПоставщика.ИНН = ЗначениеXMLАтрибута(ЧтениеXML, "VendorINN");
							КонецЕсли;
						КонецЕсли;
						
						Если ЧтениеXML.Имя = "GoodCodeData" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда   
							Если ФискальнаяСтрока <> Неопределено Тогда
								ФискальнаяСтрока.ДанныеКодаТоварнойНоменклатуры.ГлобальныйИдентификаторТорговойЕдиницы = ЗначениеXMLАтрибута(ЧтениеXML, "GTIN");
								ФискальнаяСтрока.ДанныеКодаТоварнойНоменклатуры.КонтрольныйИдентификационныйЗнак = ЗначениеXMLАтрибута(ЧтениеXML, "Stamp");
								ФискальнаяСтрока.ДанныеКодаТоварнойНоменклатуры.СерийныйНомер = ЗначениеXMLАтрибута(ЧтениеXML, "SerialNumber");
								ТипМаркировки = ЗначениеXMLАтрибута(ЧтениеXML, "StampType");
								ФискальнаяСтрока.ДанныеКодаТоварнойНоменклатуры.ТипМаркировки = МенеджерОборудованияКлиентСервер.ТипМаркировкиККТПоКоду(ТипМаркировки);
								ФискальнаяСтрока.ДанныеКодаТоварнойНоменклатуры.РеквизитКодаТовара = ЗначениеXMLАтрибута(ЧтениеXML, "MarkingCode");
							КонецЕсли
						КонецЕсли;
						
						Если ЧтениеXML.Имя = "TextString" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
							Текст = ЗначениеXMLАтрибута(ЧтениеXML, "Text");
							ТекстоваяСтрока = МенеджерОборудованияКлиентСервер.ПараметрыТекстовойСтрокиЧека(Текст);
							ОбщиеПараметры.ПозицииЧека.Добавить(ТекстоваяСтрока);
						КонецЕсли;
						
					КонецЦикла;  
					
				КонецЕсли;
				
				Если ЧтениеXML.Имя = "Payments" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
					
					СуммаНаличные   = Число(ЗначениеXMLАтрибута(ЧтениеXML, "Cash", , 0));
					СуммаЭлектронно = Число(ЗначениеXMLАтрибута(ЧтениеXML, "ElectronicPayment", , 0));
					СуммаПостоплата = Число(ЗначениеXMLАтрибута(ЧтениеXML, "Credit", "PostPayment", 0));
					СуммаПредоплата = Число(ЗначениеXMLАтрибута(ЧтениеXML, "AdvancePayment", "PrePayment", 0));
					СуммаПредоставление = Число(ЗначениеXMLАтрибута(ЧтениеXML, "CashProvision", "Barter", 0));
					
					Если СуммаНаличные > 0 Тогда
						СтрокаОплаты = Новый Структура();
						СтрокаОплаты.Вставить("ТипОплаты", ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Наличные"));
						СтрокаОплаты.Вставить("Сумма", СуммаНаличные);
						ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
					КонецЕсли;
					
					Если СуммаЭлектронно > 0 Тогда
						СтрокаОплаты = Новый Структура();
						СтрокаОплаты.Вставить("ТипОплаты", ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно"));
						СтрокаОплаты.Вставить("Сумма", СуммаЭлектронно);
						ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
					КонецЕсли;
					
					Если СуммаПостоплата > 0 Тогда
						СтрокаОплаты = Новый Структура();
						СтрокаОплаты.Вставить("ТипОплаты", ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата"));
						СтрокаОплаты.Вставить("Сумма", СуммаПостоплата);
						ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
					КонецЕсли;
					
					Если СуммаПредоплата > 0 Тогда
						СтрокаОплаты = Новый Структура();
						СтрокаОплаты.Вставить("ТипОплаты", ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Предоплата"));
						СтрокаОплаты.Вставить("Сумма", СуммаПредоплата);
						ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
					КонецЕсли;
					
					Если СуммаПредоставление > 0 Тогда
						СтрокаОплаты = Новый Структура();
						СтрокаОплаты.Вставить("ТипОплаты", ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.ВстречноеПредоставление"));
						СтрокаОплаты.Вставить("Сумма", СуммаПредоставление);
						ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла; 
			
		ИначеЕсли ЧтениеXML.Имя = "CheckCorrectionPackage" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Пока ЧтениеXML.Прочитать() Цикл
				Если ЧтениеXML.Имя = "Parameters" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
					
					ТипРасчета = ЧтениеXML.ЗначениеАтрибута("PaymentType");
					ОбщиеПараметры.ТипРасчета = МенеджерОборудованияКлиентСервер.РасчетДенежнымиСредствамиПоКоду(Число(ТипРасчета));
					
					ОбщиеПараметры.Кассир = ЧтениеXML.ЗначениеАтрибута("CashierName");
					ОбщиеПараметры.КассирИНН = ЧтениеXML.ЗначениеАтрибута("CashierVATIN");
					
					СистемаНалогообложения = ЧтениеXML.ЗначениеАтрибута("TaxVariant");
					ОбщиеПараметры.СистемаНалогообложения = МенеджерОборудованияКлиентСервер.СистемаНалогообложенияККТПоКоду(Число(СистемаНалогообложения));
					
					СуммаДокумента  = Число(ЗначениеXMLАтрибута(ЧтениеXML, "Sum"   , , 0));
					СуммаБезНДС = Число(ЗначениеXMLАтрибута(ЧтениеXML, "SumTAXNone", , 0));
					СуммаНДС0   = Число(ЗначениеXMLАтрибута(ЧтениеXML, "SumTAX0"   , , 0));
					
					СуммаНДС10  = Число(ЗначениеXMLАтрибута(ЧтениеXML, "SumTAX10"  , , 0));
					СуммаНДС18  = Число(ЗначениеXMLАтрибута(ЧтениеXML, "SumTAX18"  , , 0));
					СуммаНДС20  = Число(ЗначениеXMLАтрибута(ЧтениеXML, "SumTAX20"  , , 0));
					СуммаНДС110 = Число(ЗначениеXMLАтрибута(ЧтениеXML, "SumTAX110" , , 0));
					СуммаНДС118 = Число(ЗначениеXMLАтрибута(ЧтениеXML, "SumTAX118" , , 0));
					СуммаНДС120 = Число(ЗначениеXMLАтрибута(ЧтениеXML, "SumTAX120" , , 0));
					
					Если СуммаБезНДС > 0 Тогда
						ФискальнаяСтрока = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
						ФискальнаяСтрока.Наименование = НСтр("ru='Фискальная позиция без НДС'");
						ФискальнаяСтрока.Количество   = 1;
						ФискальнаяСтрока.ЦенаСоСкидками = СуммаБезНДС;
						ФискальнаяСтрока.Сумма          = ФискальнаяСтрока.ЦенаСоСкидками;
						ФискальнаяСтрока.СтавкаНДС      = Неопределено;
						ОбщиеПараметры.ПозицииЧека.Добавить(ФискальнаяСтрока);
					КонецЕсли;
					
					Если СуммаНДС0 > 0 Тогда
						ФискальнаяСтрока = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
						ФискальнаяСтрока.Наименование = НСтр("ru='Фискальная позиция НДС 0%'");
						ФискальнаяСтрока.Количество   = 1;
						ФискальнаяСтрока.ЦенаСоСкидками = СуммаНДС0;
						ФискальнаяСтрока.Сумма          = ФискальнаяСтрока.ЦенаСоСкидками;
						ФискальнаяСтрока.СтавкаНДС      = 0;
						ОбщиеПараметры.ПозицииЧека.Добавить(ФискальнаяСтрока);
					КонецЕсли;
					
					Если СуммаНДС10 > 0 Тогда
						ФискальнаяСтрока = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
						ФискальнаяСтрока.Наименование = НСтр("ru='Фискальная позиция НДС 10%'");
						ФискальнаяСтрока.Количество   = 1;
						ФискальнаяСтрока.ЦенаСоСкидками = Мин(СуммаНДС10 * 110 / 10, СуммаДокумента);
						ФискальнаяСтрока.Сумма          = ФискальнаяСтрока.ЦенаСоСкидками;
						ФискальнаяСтрока.СтавкаНДС      = 10;
						ОбщиеПараметры.ПозицииЧека.Добавить(ФискальнаяСтрока);
					КонецЕсли;
					
					Если СуммаНДС20 > 0 Тогда
						ФискальнаяСтрока = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
						ФискальнаяСтрока.Наименование = НСтр("ru='Фискальная позиция НДС 20%'");
						ФискальнаяСтрока.Количество   = 1;
						ФискальнаяСтрока.ЦенаСоСкидками = Мин(СуммаНДС20 * 120 / 20, СуммаДокумента);
						ФискальнаяСтрока.Сумма          = ФискальнаяСтрока.ЦенаСоСкидками;
						ФискальнаяСтрока.СтавкаНДС      = 20;
						ОбщиеПараметры.ПозицииЧека.Добавить(ФискальнаяСтрока);
					КонецЕсли;
					
					Если СуммаНДС18 > 0 Тогда
						ФискальнаяСтрока = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
						ФискальнаяСтрока.Наименование = НСтр("ru='Фискальная позиция НДС 18%'");
						ФискальнаяСтрока.Количество   = 1;
						ФискальнаяСтрока.ЦенаСоСкидками = Мин(СуммаНДС18 * 118 / 18, СуммаДокумента);
						ФискальнаяСтрока.Сумма          = ФискальнаяСтрока.ЦенаСоСкидками;
						ФискальнаяСтрока.СтавкаНДС      = 18;
						ОбщиеПараметры.ПозицииЧека.Добавить(ФискальнаяСтрока);
					КонецЕсли;
		
					Если СуммаНДС110 > 0 Тогда
						ФискальнаяСтрока = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
						ФискальнаяСтрока.Наименование = НСтр("ru='Фискальная позиция НДС 10/110'");
						ФискальнаяСтрока.Количество   = 1;
						ФискальнаяСтрока.ЦенаСоСкидками = Мин(СуммаНДС110 * 110 / 10, СуммаДокумента);
						ФискальнаяСтрока.Сумма          = ФискальнаяСтрока.ЦенаСоСкидками;
						ФискальнаяСтрока.СтавкаНДС      = 110;
						ОбщиеПараметры.ПозицииЧека.Добавить(ФискальнаяСтрока);
					КонецЕсли;
					
					Если СуммаНДС120 > 0 Тогда
						ФискальнаяСтрока = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
						ФискальнаяСтрока.Наименование = НСтр("ru='Фискальная позиция НДС 20/120'");
						ФискальнаяСтрока.Количество   = 1;
						ФискальнаяСтрока.ЦенаСоСкидками = Мин(СуммаНДС120 * 120 / 20, СуммаДокумента);
						ФискальнаяСтрока.Сумма          = ФискальнаяСтрока.ЦенаСоСкидками;
						ФискальнаяСтрока.СтавкаНДС      = 120;
						ОбщиеПараметры.ПозицииЧека.Добавить(ФискальнаяСтрока);
					КонецЕсли;
					
					Если СуммаНДС118 > 0 Тогда
						ФискальнаяСтрока = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
						ФискальнаяСтрока.Наименование = НСтр("ru='Фискальная позиция НДС 18/118'");
						ФискальнаяСтрока.Количество   = 1;
						ФискальнаяСтрока.ЦенаСоСкидками = Мин(СуммаНДС118 * 118 / 18, СуммаДокумента);
						ФискальнаяСтрока.Сумма          = ФискальнаяСтрока.ЦенаСоСкидками;
						ФискальнаяСтрока.СтавкаНДС      = 118;
						ОбщиеПараметры.ПозицииЧека.Добавить(ФискальнаяСтрока);
					КонецЕсли;
					
					СуммаПозиций = 0;
					Для Каждого ПозицияЧека Из ОбщиеПараметры.ПозицииЧека Цикл
						СуммаПозиций = СуммаПозиций + ПозицияЧека.Сумма;
					КонецЦикла;
					
					Если СуммаПозиций > СуммаДокумента Тогда
						Пока СуммаПозиций > СуммаДокумента Цикл
							Для Каждого ПозицияЧека Из ОбщиеПараметры.ПозицииЧека Цикл
								Если ПозицияЧека.СтавкаНДС <> 0 И ПозицияЧека.СтавкаНДС <> Неопределено Тогда
									ПозицияЧека.Сумма = ПозицияЧека.Сумма - 0.01;
									ПозицияЧека.ЦенаСоСкидками = ПозицияЧека.Сумма;
									СуммаПозиций = 0;
									Для Каждого ПозицияЧека Из ОбщиеПараметры.ПозицииЧека Цикл
										СуммаПозиций = СуммаПозиций + ПозицияЧека.Сумма;
									КонецЦикла;
								КонецЕсли;
							КонецЦикла;
						КонецЦикла;
					Иначе
						Пока СуммаДокумента > СуммаПозиций Цикл
							Для Каждого ПозицияЧека Из ОбщиеПараметры.ПозицииЧека Цикл
								Если ПозицияЧека.СтавкаНДС <> 0 И ПозицияЧека.СтавкаНДС <> Неопределено Тогда
									ПозицияЧека.Сумма = ПозицияЧека.Сумма + 0.01;
									ПозицияЧека.ЦенаСоСкидками = ПозицияЧека.Сумма;
									СуммаПозиций = 0;
									Для Каждого ПозицияЧека Из ОбщиеПараметры.ПозицииЧека Цикл
										СуммаПозиций = СуммаПозиций + ПозицияЧека.Сумма;
									КонецЦикла;
								КонецЕсли;
							КонецЦикла;
						КонецЦикла;
					КонецЕсли;
					
				КонецЕсли;
				
				Если ЧтениеXML.Имя = "Payments" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
					
					СуммаНаличные   = Число(ЗначениеXMLАтрибута(ЧтениеXML, "Cash", , 0));
					СуммаЭлектронно = Число(ЗначениеXMLАтрибута(ЧтениеXML, "ElectronicPayment", , 0));
					СуммаПостоплата = Число(ЗначениеXMLАтрибута(ЧтениеXML, "Credit", "PostPayment", 0));
					СуммаПредоплата = Число(ЗначениеXMLАтрибута(ЧтениеXML, "AdvancePayment", "PrePayment", 0));
					СуммаПредоставление = Число(ЗначениеXMLАтрибута(ЧтениеXML, "CashProvision", "Barter", 0));
					
					Если СуммаНаличные > 0 Тогда
						СтрокаОплаты = Новый Структура();
						СтрокаОплаты.Вставить("ТипОплаты", ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Наличные"));
						СтрокаОплаты.Вставить("Сумма", СуммаНаличные);
						ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
					КонецЕсли;
					
					Если СуммаЭлектронно > 0 Тогда
						СтрокаОплаты = Новый Структура();
						СтрокаОплаты.Вставить("ТипОплаты", ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно"));
						СтрокаОплаты.Вставить("Сумма", СуммаЭлектронно);
						ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
					КонецЕсли;
					
					Если СуммаПостоплата > 0 Тогда
						СтрокаОплаты = Новый Структура();
						СтрокаОплаты.Вставить("ТипОплаты", ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата"));
						СтрокаОплаты.Вставить("Сумма", СуммаПостоплата);
						ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
					КонецЕсли;
					
					Если СуммаПредоплата > 0 Тогда
						СтрокаОплаты = Новый Структура();
						СтрокаОплаты.Вставить("ТипОплаты", ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Предоплата"));
						СтрокаОплаты.Вставить("Сумма", СуммаПредоплата);
						ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
					КонецЕсли;
					
					Если СуммаПредоставление > 0 Тогда
						СтрокаОплаты = Новый Структура();
						СтрокаОплаты.Вставить("ТипОплаты", ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.ВстречноеПредоставление"));
						СтрокаОплаты.Вставить("Сумма", СуммаПредоставление);
						ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла; 
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат ОбщиеПараметры;
	
КонецФункции

// Сформировать XML для запроса КМ.
// 
// Параметры:
//  ПараметрыОперации - Структура - Параметры операции.  
// 
// Возвращаемое значение:
//   Строка
//
Функция СформироватьXMLДляЗапросаКМ(ПараметрыОперации) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("RequestKM");
	
	ИдентификаторЗапроса = ПараметрыОперации.ИдентификаторЗапроса;
	Если ПустаяСтрока(ИдентификаторЗапроса) Тогда
		ИдентификаторЗапроса =Новый УникальныйИдентификатор;
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьАтрибут("GUID", XMLСтрока(ИдентификаторЗапроса));
	Если Не ПараметрыОперации.ОжидатьПолучениеОтветаОИСМ Тогда
		ЗаписьXML.ЗаписатьАтрибут("WaitForResult", "False");
	КонецЕсли;
	ЗаписьXML.ЗаписатьАтрибут("MarkingCode", XMLСтрока(ПараметрыОперации.КонтрольнаяМарка));
	
	ПланируемыйСтатусТовара = МенеджерОборудованияКлиентСервер.КодПланируемыйСтатусМаркируемогоТовара(ПараметрыОперации.ПланируемыйСтатусТовара);
	ЗаписьXML.ЗаписатьАтрибут("PlannedStatus", XMLСтрока(ПланируемыйСтатусТовара));
	
	// Реквизиты "количество предмета расчета" (тег 1023) и "мера количества предмета расчета" (тег 2108) включаются в состав запроса о коде маркировки
	// в случае, если реквизит "планируемый статус товара" (тег 2003) принимает значения "2" или "4".
	Если ПланируемыйСтатусТовара = 2 Или ПланируемыйСтатусТовара = 4 Тогда    
		ЗаписьXML.ЗаписатьАтрибут("Quantity", XMLСтрока(ПараметрыОперации.Количество)); // тег 1023
		Если Не ПустаяСтрока(ПараметрыОперации.КодЕдиницыИзмерения) Тогда
			МераКоличестваПредметаРасчета = МенеджерОборудованияКлиентСервер.МераКоличестваПредметаРасчетаПоКодуЕдиницыИзмерения(ПараметрыОперации.КодЕдиницыИзмерения)
		Иначе
			МераКоличестваПредметаРасчета = ПараметрыОперации.МераКоличестваПредметаРасчета; 
		КонецЕсли;
		Если Не ПустаяСтрока(МераКоличестваПредметаРасчета) Тогда  // тег 2108
			МераКоличестваПредметаРасчета = МенеджерОборудованияКлиентСервер.КодМерыКоличестваПредметаРасчетаККТ(МераКоличестваПредметаРасчета);
			ЗаписьXML.ЗаписатьАтрибут("MeasureOfQuantity", XMLСтрока(МераКоличестваПредметаРасчета));
		КонецЕсли;
	КонецЕсли;
	
	// Реквизит "дробное количество маркированного товара" (тег 1291) включается в состав запроса о коде маркировки только в случае если 
	// значение реквизита "мера количества предмета расчета" (тег 2108) принимает значение равное "0".
	Если МераКоличестваПредметаРасчета = 0 Тогда
		ДробноеКоличество = ПараметрыОперации.ДробноеКоличество;
		Если Не ПустаяСтрока(ДробноеКоличество.Числитель) И Не ПустаяСтрока(ДробноеКоличество.Знаменатель) Тогда
			Если Число(ДробноеКоличество.Числитель) > 0 И Число(ДробноеКоличество.Знаменатель) > 0 Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("FractionalQuantity");
				ЗаписьXML.ЗаписатьАтрибут("Numerator", XMLСтрока(ДробноеКоличество.Числитель));
				ЗаписьXML.ЗаписатьАтрибут("Denominator", XMLСтрока(ДробноеКоличество.Знаменатель));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции  

// Получить результаты запроса КМ из XML пакета.
// 
// Параметры:
//  ДанныеXML - Строка - XML.  
// 
// Возвращаемое значение:
//  Структура
//
Функция ПолучитьРезультатыЗапросаКМИзXMLПакета(ДанныеXML) Экспорт
	
	Параметры = Новый Структура();
	Параметры.Вставить("КодМаркировкиПроверен", Ложь);
	Параметры.Вставить("РезультатПроверки", Ложь);
	
	Если Не ПустаяСтрока(ДанныеXML) Тогда
		ЧтениеXML = Новый ЧтениеXML; 
		ЧтениеXML.УстановитьСтроку(ДанныеXML);
		ЧтениеXML.ПерейтиКСодержимому();
		Если ЧтениеXML.Имя = "RequestKMResult" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Параметры.КодМаркировкиПроверен = ВРег(ЧтениеXML.ЗначениеАтрибута("Checking")) = "TRUE";
			Параметры.РезультатПроверки = ВРег(ЧтениеXML.ЗначениеАтрибута("CheckingResult")) = "TRUE";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

// Получить результаты запроса ОИСМ КМ из XML пакета.
// 
// Параметры:
//  ДанныеXML - Строка - XML.  
// 
// Возвращаемое значение:
//  Структура
//
Функция ПолучитьРезультатыОИСМКМИзXMLПакета(ДанныеXML) Экспорт
	
	Параметры = Новый Структура();
	Параметры.Вставить("ИдентификаторЗапроса");   
	Параметры.Вставить("СтатусРезультата");
	Параметры.Вставить("РезультатПроверкиОИСМ", Ложь);
	Параметры.Вставить("КодРезультатаПроверкиОИСМ", 0);
	Параметры.Вставить("РезультатПроверкиОИСМПредставление", "00000000");
	
	Параметры.Вставить("РезультатПроверкиСведенийОТоваре");
	Параметры.Вставить("РезультатПроверкиСведенийОТовареПФ");
	Параметры.Вставить("КодОбработкиЗапроса");
	Параметры.Вставить("СтатусОбработкиЗапроса");

	Параметры.Вставить("СтатусТовара", Неопределено);
	
	Если Не ПустаяСтрока(ДанныеXML) Тогда
		ЧтениеXML = Новый ЧтениеXML; 
		ЧтениеXML.УстановитьСтроку(ДанныеXML);
		ЧтениеXML.ПерейтиКСодержимому();
		Если ЧтениеXML.Имя = "ProcessingKMResult" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Параметры.РезультатПроверкиОИСМ = ВРег(ЧтениеXML.ЗначениеАтрибута("Result")) = "TRUE";
			Параметры.КодРезультатаПроверкиОИСМ = ЧтениеXML.ЗначениеАтрибута("ResultCode");
			Если ЧтениеXML.ЗначениеАтрибута("ResultCode") <> Неопределено Тогда
				Параметры.КодРезультатаПроверкиОИСМ = Число(ЧтениеXML.ЗначениеАтрибута("ResultCode"));
			    Параметры.РезультатПроверкиОИСМПредставление = МенеджерОборудованияКлиентСервер.ПреобразоватьЧислоВБинарнуюСтроку(Параметры.КодРезультатаПроверкиОИСМ, 8);
			КонецЕсли;
			Если ЧтениеXML.ЗначениеАтрибута("StatusInfo") <> Неопределено Тогда
				СтатусТовара = Число(ЧтениеXML.ЗначениеАтрибута("StatusInfo"));
				Параметры.СтатусТовара = МенеджерОборудованияКлиентСервер.ОтветОИСМОСтатусеТовараПоКоду(СтатусТовара);
			КонецЕсли;
			Параметры.ИдентификаторЗапроса = ЧтениеXML.ЗначениеАтрибута("GUID");
			КодОбработкиЗапроса = ЧтениеXML.ЗначениеАтрибута("HandleCode");
			Если Не ПустаяСтрока(КодОбработкиЗапроса) Тогда
				Параметры.КодОбработкиЗапроса = Число(КодОбработкиЗапроса);
				Параметры.СтатусОбработкиЗапроса = СтатусОбработкиЗапросаКМПоКоду(Параметры.КодОбработкиЗапроса);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Параметры.РезультатПроверкиСведенийОТоваре = РезультатПроверкиСведенийОТоваре(Параметры.РезультатПроверкиОИСМПредставление);
	Параметры.РезультатПроверкиСведенийОТовареПФ = РезультатПроверкиСведенийОТовареПФ(Параметры.РезультатПроверкиОИСМПредставление);

	Возврат Параметры;
	
КонецФункции

// Возвращает Истина, если используется подсистемы фискальных устройств и эти подсистемы существует в конфигурации.
// Предназначена для реализации вызова необязательной подсистемы (условного вызова).
//
// У хотя бы одной "функциональной" подсистемы включен флажок "Включать в командный интерфейс".
//
// Возвращаемое значение:
//  Булево.
//
Функция ИспользуетсяПодсистемыФискальныхУстройств() Экспорт
	
	Результат = ОбщегоНазначения.ПодсистемаСуществует("ПодключаемоеОборудование.ККТ")
		Или ОбщегоНазначения.ПодсистемаСуществует("ПодключаемоеОборудование.ФискальныеРегистраторы")
		Или ОбщегоНазначения.ПодсистемаСуществует("ПодключаемоеОборудование.ПринтерЧеков");
	Возврат Результат;
	
КонецФункции

// Выполняет проверку обязательности заполняет тэгов.
// 
// Параметры:
//  Параметры - Параметры фискального чека.  
//  ИдентификаторУстройства - Идентификатор устройства ККТ.
//  ОписаниеОшибки - Описание ошибки.
// 
// Возвращаемое значение:
//   Результат операции
//
Функция ВыполненаПроверкаОбязательностиИПравильностиЗаполненияТэгов(Параметры, ИдентификаторУстройства, ОписаниеОшибки) Экспорт
	
	Если ИспользуетсяПодсистемыФискальныхУстройств() Тогда
		МодульФорматноЛогическийКонтрольВызовСервера = ОбщегоНазначения.ОбщийМодуль("ФорматноЛогическийКонтрольВызовСервера");
		МодульФорматноЛогическийКонтрольВызовСервера.ВыполненитьКоррекциюЗаполненияТэгов(Параметры, ИдентификаторУстройства, ОписаниеОшибки);
		Возврат МодульФорматноЛогическийКонтрольВызовСервера.ВыполненаПроверкаОбязательностиИПравильностиЗаполненияТэгов(Параметры, ИдентификаторУстройства, ОписаниеОшибки);
	Иначе
		ВызватьИсключение НСтр("ru='Выполнение команды невозможно, поскольку подсистемы ККТ, ФР, Принтер чеков недоступны.'");
	КонецЕсли;
	
КонецФункции

// Процедура приводит к формату согласованному с ФНС.
// 
// Параметры:
//  ОсновныеПараметры - Параметры фискального чека.  
//  Отказ - Отказ при выполнении операции.
//  ОписаниеОшибки - Описание ошибки.
//  ИсправленыОсновныеПараметры - Были исправлены основные параметры
//
Процедура ПривестиДанныеКТребуемомуФормату(ОсновныеПараметры, Отказ, ОписаниеОшибки, ИсправленыОсновныеПараметры) Экспорт
	
	Если ИспользуетсяПодсистемыФискальныхУстройств() Тогда
		МодульФорматноЛогическийКонтрольКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ФорматноЛогическийКонтрольКлиентСервер");
		МодульФорматноЛогическийКонтрольКлиентСервер.ПривестиДанныеКТребуемомуФормату(ОсновныеПараметры, Отказ, ОписаниеОшибки, ИсправленыОсновныеПараметры);
	Иначе
		ВызватьИсключение НСтр("ru='Выполнение команды невозможно, поскольку подсистемы ККТ, ФР, Принтер чеков недоступны.'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Процедура получает xml пакет для операции.
//                                                 
Функция ПолучитьXMLПакетДляОперации(ОбщиеПараметры_, РевизияИнтерфейса = 0) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("InputParameters");
	ЗаписьXML.ЗаписатьНачалоЭлемента("Parameters");
	
	// Стомалогия.
	Если ТипЗнч(ОбщиеПараметры_) = Тип("Массив") и ОбщиеПараметры_.Количество() > 0 Тогда
		ОбщиеПараметры = ОбщиеПараметры_[0];
	Иначе
		ОбщиеПараметры = ОбщиеПараметры_;
	КонецЕсли;
	
	Если РевизияИнтерфейса >= 3000 Тогда  // Версия стандарта 3.0 (ОФД 1.1)
		ЗаписьXML.ЗаписатьАтрибут("CashierName", ?(ТипЗнч(ОбщиеПараметры) = Тип("Структура") И ОбщиеПараметры.Свойство("Кассир"), XMLСтрока(ОбщиеПараметры.Кассир), НСтр("ru='Администратор'")));
		ЗаписьXML.ЗаписатьАтрибут("CashierINN" , ?(ТипЗнч(ОбщиеПараметры) = Тип("Структура") И ОбщиеПараметры.Свойство("КассирИНН"), XMLСтрока(ОбщиеПараметры.КассирИНН), ""));
		Если ТипЗнч(ОбщиеПараметры) = Тип("Структура") 
			И ОбщиеПараметры.Свойство("АдресРасчетов") 
			И НЕ ПустаяСтрока(ОбщиеПараметры.АдресРасчетов) Тогда
			
			ЗаписьXML.ЗаписатьАтрибут("SaleAddress", XMLСтрока(ОбщиеПараметры.АдресРасчетов));
		КонецЕсли;
		Если ТипЗнч(ОбщиеПараметры) = Тип("Структура") 
			И ОбщиеПараметры.Свойство("МестоРасчетов")
			И НЕ ПустаяСтрока(ОбщиеПараметры.МестоРасчетов) Тогда  
			
			ЗаписьXML.ЗаписатьАтрибут("SaleLocation", XMLСтрока(ОбщиеПараметры.МестоРасчетов));
		КонецЕсли;
	Иначе
		ЗаписьXML.ЗаписатьАтрибут("CashierName" , ?(ТипЗнч(ОбщиеПараметры) = Тип("Структура") И ОбщиеПараметры.Свойство("Кассир"), XMLСтрока(ОбщиеПараметры.Кассир), НСтр("ru='Администратор'")));
		ЗаписьXML.ЗаписатьАтрибут("CashierVATIN", ?(ТипЗнч(ОбщиеПараметры) = Тип("Структура") И ОбщиеПараметры.Свойство("КассирИНН"), XMLСтрока(ОбщиеПараметры.КассирИНН), ""));
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции   

// Возвращает Истина, если используется подсистема Офлайн оборудование и эта подсистемы существует в конфигурации.
// Предназначена для реализации вызова необязательной подсистемы (условного вызова).
//
// Возвращаемое значение:
//  Булево.
//
Функция ИспользуетсяПодсистемаОфлайнОборудования() Экспорт
	
	// Результат = ОбщегоНазначения.ПодсистемаСуществует("ПодключаемоеОборудование.ОфлайнОборудование");
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область ЗащитаПерсональныхДанных

// См. ЗащитаПерсональныхДанныхПереопределяемый.ЗаполнитьСведенияОПерсональныхДанных.
Процедура ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений) Экспорт
	
	Если ТаблицаСведений.Найти("РегистрСведений.ФискальныеОперации", "Объект") = Неопределено Тогда
		НовыеСведения = ТаблицаСведений.Добавить();
		НовыеСведения.Объект          = "РегистрСведений.ФискальныеОперации";
		НовыеСведения.ПоляРегистрации = "СубъектПерсональныхДанных";
		НовыеСведения.ПоляДоступа     = "ДанныеXML";
		НовыеСведения.ОбластьДанных   = "ПаспортныеДанные";
	КонецЕсли;
	
	// Если ТаблицаСведений.Найти("РегистрСведений.ОчередьЧековККТ", "Объект") = Неопределено Тогда
	//	НовыеСведения = ТаблицаСведений.Добавить();
	//	НовыеСведения.Объект          = "РегистрСведений.ОчередьЧековККТ";
	//	НовыеСведения.ПоляРегистрации = "СубъектПерсональныхДанных";
	//	НовыеСведения.ПоляДоступа     = "ДанныеЧека";
	//	НовыеСведения.ОбластьДанных   = "ПаспортныеДанные";
	// КонецЕсли;
	
КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ЗаполнитьОбластиПерсональныхДанных.
Процедура ЗаполнитьОбластиПерсональныхДанных(ОбластиПерсональныхДанных) Экспорт
	
	Если ОбластиПерсональныхДанных.Найти("ПаспортныеДанные", "Имя") = Неопределено Тогда
		НоваяОбласть = ОбластиПерсональныхДанных.Добавить();
		НоваяОбласть.Имя			= "ПаспортныеДанные";
		НоваяОбласть.Представление	= НСтр("ru = 'Паспортные данные'");
		НоваяОбласть.Родитель		= "ЛичныеДанные";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИнтерфейсныйПроцедурыИФункции

Процедура ПодготовитьЭлементУправления(ЭлементУправления) Экспорт
	
	СтандартнаяОбработка = Истина;
	
	МенеджерОборудованияВызовСервераПереопределяемый.ПодготовитьЭлементУправления(ЭлементУправления, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда    
		Если ОбщегоНазначенияКлиентСервер.ЭтоМобильныйКлиент() Тогда
			Если ЭлементУправления.Вид <> ВидПоляФормы.ПолеФлажка Тогда
				ЭлементУправления.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
			КонецЕсли;
			ЭлементУправления.ШрифтЗаголовка = ШрифтыСтиля.МелкийШрифтТекста;
		КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

// Выполняет подключение внешней компоненты.
//
// Возвращаемое значение: 
//   ОбъектВнешнейКомпоненты
//   Неопределено - если компоненту не удалось загрузить.
//
Процедура ПодключитьКомпонентуГенерацииИзображенияШтрихкода() Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПодключаемоеОборудование.ГенерацияШтрихкода") Тогда
		МодульГенерацияШтрихкода = ОбщегоНазначения.ОбщийМодуль("ГенерацияШтрихкода");
		КомпонентуГенерацииИзображения = МодульГенерацияШтрихкода.ПодключитьКомпонентуГенерацииИзображенияШтрихкода();
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать ГенерацияШтрихкода.ИзображениеШтрихкода()
// Формирование изображения штрихкода.
//
// Параметры: 
//   ПараметрыШтрихкода - Структура (Конструктор ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода())
//
// Возвращаемое значение: 
//   Картинка - Картинка со сформированным штрихкодом или НЕОПРЕДЕЛЕНО.
//
Функция ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода) Экспорт
	
	РезультатОперации = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
	Если  РезультатОперации.ДвоичныеДанные <> Неопределено Тогда
		Возврат РезультатОперации.Картинка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область КодаВидаНоменклатурнойКлассификации

// Возвращает класификатор кода вида номенклатурной классификации
//
// Возвращаемое значение:
//  ТаблицаЗначений.
//
Функция КодыВидаНоменклатурнойКлассификации() Экспорт
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("НаименованиеВидаНоменклатурнойКлассификации",,"НаименованиеВидаНоменклатурнойКлассификации");
	ТаблицаЗначений.Колонки.Добавить("КодВидаНоменклатурнойКлассификации",,"КодВидаНоменклатурнойКлассификации");
	
	УстановитьПривилегированныйРежим(Истина);
	
	Данные = ПолучитьОбщийМакет("КодВидаНоменклатурнойКлассификации").ПолучитьТекст() ;
	Если Не ПустаяСтрока(Данные) Тогда
		ЧтениеXML = Новый ЧтениеXML; 
		ЧтениеXML.УстановитьСтроку(Данные);
		ЧтениеXML.ПерейтиКСодержимому();
		Если ЧтениеXML.Имя = "КодВидаНоменклатурнойКлассификации" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
			Пока ЧтениеXML.Прочитать() Цикл  
				Если ЧтениеXML.Имя = "ВидНоменклатурнойКлассификации" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
					ВидНоменклатурнойКлассификации = ТаблицаЗначений.Добавить();
					ВидНоменклатурнойКлассификации.НаименованиеВидаНоменклатурнойКлассификации = ЧтениеXML.ЗначениеАтрибута("Имя");
					ВидНоменклатурнойКлассификации.КодВидаНоменклатурнойКлассификации = ЧтениеXML.ЗначениеАтрибута("КодВида");
				КонецЕсли;
			КонецЦикла;           
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТаблицаЗначений;
	
КонецФункции

#КонецОбласти

// Функция возвращает параметры драйвера по наименованию обработчика.
//
Функция ПараметрыДрайвераПоОбработчику(НаименованиеОбработчикаДрайвера) Экспорт

	Результат = Новый Структура;
	
	Для каждого ИмяПеречисления Из Метаданные.Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ЗначенияПеречисления Цикл
		Если НаименованиеОбработчикаДрайвера = ИмяПеречисления.Синоним Тогда
			Результат.Вставить("Имя"            , ИмяПеречисления.Имя);
			Результат.Вставить("Наименование"   , ИмяПеречисления.Синоним);
			Результат.Вставить("ТипОборудования", Перечисления["ТипыПодключаемогоОборудования"][ИмяПеречисления.Комментарий]);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

// Получить таблицу меток RFID.
//
Функция ПолучитьТаблицуМетокRFID(ДанныеМеток) Экспорт

	Возврат МеткиRFID(ДанныеМеток);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКодыТоваров(ТЗ, Элемент, Уровень = "Товар")
	
	Если Уровень = "Товар" Тогда
		
		Если Элемент.ИмеетХарактеристики Тогда
			
			Для Каждого ТекХарактеристика Из Элемент.Характеристики Цикл
				ДобавитьКодыТоваров(ТЗ, ТекХарактеристика, "Характеристика");
			КонецЦикла;
			
		ИначеЕсли Элемент.ИмеетУпаковки Тогда
			
			Для Каждого ТекУпаковка Из Элемент.Упаковки Цикл
				ДобавитьКодыТоваров(ТЗ, ТекУпаковка, "Упаковка");
			КонецЦикла;
			
		Иначе
			
			ДобавитьЭлементВКоллекцию(Элемент, ТЗ);
			
		КонецЕсли;
		
	ИначеЕсли Уровень = "Характеристика" Тогда
		
		Если Элемент.ИмеетУпаковки Тогда
			
			Для Каждого ТекУпаковка Из Элемент.Упаковки Цикл
				ДобавитьКодыТоваров(ТЗ, ТекУпаковка, "Упаковка");
			КонецЦикла;
			
		Иначе
			
			ДобавитьЭлементВКоллекцию(Элемент, ТЗ);
			
		КонецЕсли;
		
	ИначеЕсли Уровень = "Упаковка" Тогда
		
		ДобавитьЭлементВКоллекцию(Элемент, ТЗ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьЭлементВКоллекцию(Элемент, Коллекция)
	
	НоваяСтрока = Коллекция.Добавить();
	
	Попытка
		НоваяСтрока.Код = Число(Элемент.Код);
	Исключение
		НоваяСтрока.Код = 0;
	КонецПопытки;
	
	НоваяСтрока.Количество = 1;
	
КонецПроцедуры

// Для внутреннего использования
//
Функция ПолучитьСтатусПоследнейСмены(ИдентификаторУстройства) Экспорт
	
	// Если ИспользуетсяПодсистемыФискальныхУстройств() Тогда
	//	МодульКассовыеСменыВызовСервера = ОбщегоНазначения.ОбщийМодуль("КассовыеСменыВызовСервера");
	//	Возврат МодульКассовыеСменыВызовСервера.СтатусПоследнейСмены(ИдентификаторУстройства);
	// Иначе
	//	ВызватьИсключение НСтр("ru='Выполнение команды невозможно, поскольку подсистемы ККТ, ФР, Принтер чеков недоступны.'");
	// КонецЕсли;
	
КонецФункции

// Для внутреннего использования
///
Функция ТребуетсяЗакрытиеСмены(ИдентификаторУстройства) Экспорт
	
	// Если ИспользуетсяПодсистемыФискальныхУстройств() Тогда
	//		МодульКассовыеСменыВызовСервера = ОбщегоНазначения.ОбщийМодуль("КассовыеСменыВызовСервера");
	//		Если МодульКассовыеСменыВызовСервера.ОписаниеПоследнейКассовойСмены(ИдентификаторУстройства) = Неопределено
	//			И ПолучитьТипПодключаемогоОборудования(ИдентификаторУстройства) = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ККТ") Тогда
	//			Возврат Истина;
	//	Иначе
	//		Возврат Ложь;
	//	КонецЕсли;
	// Иначе
	//	ВызватьИсключение НСтр("ru='Выполнение команды невозможно, поскольку подсистемы ККТ, ФР, Принтер чеков недоступны.'");
	// КонецЕсли;
	
КонецФункции

// Для внутреннего использования
///
Функция НоваяКассоваяСмена(ФискальноеУстройство) Экспорт
	
	// Если ИспользуетсяПодсистемыФискальныхУстройств() Тогда
	//	МодульКассовыеСменыВызовСервера = ОбщегоНазначения.ОбщийМодуль("КассовыеСменыВызовСервера");
	//	Возврат МодульКассовыеСменыВызовСервера.НоваяКассоваяСмена(ФискальноеУстройство);
	// Иначе
	//	ВызватьИсключение НСтр("ru='Выполнение команды невозможно, поскольку подсистемы ККТ, ФР, Принтер чеков недоступны.'");
	// КонецЕсли;
	
КонецФункции

// Для внутреннего использования
///
Функция ОписаниеПоследнейКассовойСмены(ФискальноеУстройство) Экспорт
	
	// Если ИспользуетсяПодсистемыФискальныхУстройств() Тогда
	//	МодульКассовыеСменыВызовСервера = ОбщегоНазначения.ОбщийМодуль("КассовыеСменыВызовСервера");
	//	Возврат МодульКассовыеСменыВызовСервера.ОписаниеПоследнейКассовойСмены(ФискальноеУстройство);
	// Иначе
	//	ВызватьИсключение НСтр("ru='Выполнение команды невозможно, поскольку подсистемы ККТ, ФР, Принтер чеков недоступны.'");
	// КонецЕсли;
	
КонецФункции

// Для внутреннего использования
///
Функция ИнкрементироватьТекущийНомерЧекаККТ(ФискальноеУстройство, КассоваяСмена) Экспорт
	
	// Если ИспользуетсяПодсистемыФискальныхУстройств() Тогда
	//	МодульКассовыеСменыВызовСервера = ОбщегоНазначения.ОбщийМодуль("КассовыеСменыВызовСервера");
	//	МодульКассовыеСменыВызовСервера.ИнкрементироватьТекущийНомерЧекаККТ(ФискальноеУстройство, КассоваяСмена);
	// Иначе
	//	ВызватьИсключение НСтр("ru='Выполнение команды невозможно, поскольку подсистемы ККТ, ФР, Принтер чеков недоступны.'");
	// КонецЕсли;
	
КонецФункции

// Для внутреннего использования
Процедура ПослеВыполненияКомандыФискальнымУстройством(ПараметрыКоманды) Экспорт
	
	// Если ИспользуетсяПодсистемыФискальныхУстройств() Тогда
	//		МодульКассовыеСменыВызовСервера = ОбщегоНазначения.ОбщийМодуль("КассовыеСменыВызовСервера");
	//		МодульКассовыеСменыВызовСервера.ПослеВыполненияКомандыФискальнымУстройством(ПараметрыКоманды);
	// Иначе
	//	ВызватьИсключение НСтр("ru='Выполнение команды невозможно, поскольку подсистемы ККТ, ФР, Принтер чеков недоступны.'");
	// КонецЕсли;
	
КонецПроцедуры

Функция Base64ВШтрихкод(ШтрихкодВBase64) Экспорт
	
	ДвоичныеДанные = Base64Значение(ШтрихкодВBase64);
	Если ДвоичныеДанные = Неопределено Тогда
		Штрихкод = ШтрихкодВBase64;
	Иначе
		Штрихкод = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные);
	КонецЕсли;
	
	Возврат Штрихкод;
	
КонецФункции

Функция ШтрихкодВBase64(Штрихкод) Экспорт
	
	Если Штрихкод = Неопределено Тогда 
		ДвоичныеДанныеСтроки = Неопределено;
	Иначе
		ДвоичныеДанныеСтроки = ПолучитьДвоичныеДанныеИзСтроки(Штрихкод);
		ШтрихкодBase64 = Base64Строка(ДвоичныеДанныеСтроки);
		ШтрихкодBase64 = СтрЗаменить(ШтрихкодBase64, Символы.ПС, "");
		ШтрихкодBase64 = СтрЗаменить(ШтрихкодBase64, Символы.ВК, "");
	КонецЕсли;
	
	Возврат ШтрихкодBase64;
	
КонецФункции


#Область Служебные

// Получить обработки запроса КМ по коду.
//
Функция СтатусОбработкиЗапросаКМПоКоду(КодОбработкиЗапроса) 
	
	СтатусОбработки = Новый Соответствие(); 
	
	СтатусОбработки.Вставить(0, ПредопределенноеЗначение("Перечисление.СтатусОбработкиЗапросаКМ.КорректныйФормат"));
	СтатусОбработки.Вставить(1, ПредопределенноеЗначение("Перечисление.СтатусОбработкиЗапросаКМ.НекорректныйФормат"));
	СтатусОбработки.Вставить(2, ПредопределенноеЗначение("Перечисление.СтатусОбработкиЗапросаКМ.НекорректныйФорматКМ"));
	
	Возврат СтатусОбработки.Получить(Число(КодОбработкиЗапроса));
	
КонецФункции

// Получить результат проверки сведений о товаре.
//
Функция РезультатПроверкиСведенийОТоваре(РезультатПроверки)
	
	РезультатыПроверки = Новый Соответствие();
	
	РезультатыПроверки.Вставить("00000000", НСтр("ru='Проверка КП КМ не выполнена, статус товара ОИСМ не проверен'"));
	РезультатыПроверки.Вставить("00000001", НСтр("ru='Проверка КП КМ выполнена в ФН с отрицательным результатом, статус товара ОИСМ не проверен'"));
	РезультатыПроверки.Вставить("00000011", НСтр("ru='Проверка КП КМ выполнена с положительным результатом, статус товара ОИСМ не проверен'"));
	РезультатыПроверки.Вставить("00010000", НСтр("ru='Проверка КП КМ не выполнена, статус товара ОИСМ не проверен (ККТ функционирует в автономном режиме)'"));
	РезультатыПроверки.Вставить("00010001", НСтр("ru='Проверка КП КМ выполнена в ФН с отрицательным результатом, статус товара ОИСМ не проверен (ККТ функционирует в автономном режиме)'"));
	РезультатыПроверки.Вставить("00010011", НСтр("ru='Проверка КП КМ выполнена в ФН с положительным результатом, статус товара ОИСМ не проверен (ККТ функционирует в автономном режиме)'"));
	РезультатыПроверки.Вставить("00000101", НСтр("ru='Проверка КП КМ выполнена с отрицательным результатом, статус товара у ОИСМ некорректен'"));
	РезультатыПроверки.Вставить("00000111", НСтр("ru='Проверка КП КМ выполнена с положительным результатом, статус товара у ОИСМ некорректен'"));
	РезультатыПроверки.Вставить("00001111", НСтр("ru='Проверка КП КМ выполнена с положительным результатом, статус товара у ОИСМ корректен'"));
	
	Возврат РезультатыПроверки.Получить(РезультатПроверки);
	
КонецФункции

// Получить результат проверки сведений о товаре.
//
Функция РезультатПроверкиСведенийОТовареПФ(РезультатПроверки)
	
	РезультатыПроверки = Новый Соответствие();
	
	РезультатыПроверки.Вставить("00000000", "[М]");  // Не локализовывать, утверждено ФФД.
	РезультатыПроверки.Вставить("00000001", "[М-]"); // Не локализовывать, утверждено ФФД.
	РезультатыПроверки.Вставить("00000011", "[М]");  // Не локализовывать, утверждено ФФД.
	РезультатыПроверки.Вставить("00010000", "[М]");  // Не локализовывать, утверждено ФФД.
	РезультатыПроверки.Вставить("00010001", "[М-]"); // Не локализовывать, утверждено ФФД.
	РезультатыПроверки.Вставить("00010011", "[М]");  // Не локализовывать, утверждено ФФД.
	РезультатыПроверки.Вставить("00000101", "[М-]"); // Не локализовывать, утверждено ФФД.
	РезультатыПроверки.Вставить("00000111", "[М-]"); // Не локализовывать, утверждено ФФД.
	РезультатыПроверки.Вставить("00001111", "[М+]"); // Не локализовывать, утверждено ФФД.
	
	Возврат РезультатыПроверки.Получить(РезультатПроверки);
	
КонецФункции

#КонецОбласти

// Функция возвращает список подключенного в справочнике ПО
// 
Функция ПолучитьСписокОборудования(ТипыПО = Неопределено, Идентификатор = Неопределено, РабочееМесто = Неопределено) Экспорт
	
	Возврат Справочники.ПодключаемоеОборудование.ПолучитьСписокОборудования(ТипыПО, Идентификатор, РабочееМесто);
	
КонецФункции

// Возвращает доступные версии форматов обмена.
//
Функция ДоступныеВерсииФорматовОбмена() Экспорт
	
	ВерсииФорматовОбмена = Новый СписокЗначений();
	ВерсииФорматовОбмена.Добавить(1005, "1.5");
	ВерсииФорматовОбмена.Добавить(1006, "1.6");
	ВерсииФорматовОбмена.Добавить(1007, "1.7");
	Возврат ВерсииФорматовОбмена;
	
КонецФункции

// Возвращает список оборудования для которого необходима переустановка компоненты.
// устаревшая.
//
Функция ПолучитьСписокДрайверовДляПереустановки(РабочееМесто) Экспорт
	
	Возврат МенеджерОборудованияВызовСервера.ДрайвераДляПереустановки(РабочееМесто);
	
КонецФункции

// Возвращает список оборудования для которого необходима установка компоненты.
// устаревшая.
//
Функция ПолучитьСписокДрайверовДляУстановки(РабочееМесто) Экспорт
	
	Возврат МенеджерОборудованияВызовСервера.ДрайвераДляУстановки(РабочееМесто);
	
КонецФункции

// Функция возвращает параметры драйвера по наименованию обработчика.
// устаревшая.
//
Функция ПолучитьПараметрыДрайвераПоОбработчику(НаименованиеОбработчикаДрайвера) Экспорт
		
	Возврат МенеджерОборудованияВызовСервера.ПараметрыДрайвераПоОбработчику(НаименованиеОбработчикаДрайвера);

КонецФункции

// Функция, возвращает, тип кассы.
//
Функция ПолучитьТипККТ(ККТ) Экспорт
	
	// Если ККТ.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикLifePayККТ54ФЗ Тогда
	//	ТипККТ = "LifePayККТ";
	// ИначеЕсли ККТ.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикCloudKassirККТ54ФЗ Тогда
	//	ТипККТ = "CloudKassirККТ";
	// Иначе
		ТипККТ = "ККТ";
	// КонецЕсли;
	
	Возврат ТипККТ;	
	
КонецФункции

// Функция вернет признак использоватия ТО в указанной кассек ККМ.
//
Функция ПроверитьИспользованиеФРвКассе(Касса, РабочееМесто, ВернутьСтруктуру = Ложь) Экспорт
	
	Если ВернутьСтруктуру = Ложь Тогда
		
		Если Касса.ИспользоватьБезПодключенияОборудования = Ложь 
			И ЗначениеЗаполнено(Касса.ВнешнееОборудование)
			И Касса.ВнешнееОборудование.УстройствоИспользуется = Истина Тогда
			
			Если Касса.ВнешнееОборудование.ДрайверОборудования.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолККТ54ФЗ Тогда
				Возврат Истина;
			Иначе 
				Возврат (Касса.ВнешнееОборудование.РабочееМесто = РабочееМесто);
			КонецЕсли;
			
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	Иначе
		
		Результат = Новый Структура("Используется, ДоступностьПробития, ДоступностьСмены", Истина, Истина, Истина);
		
		Если Касса.ВнешнееОборудование.Пустая() ИЛИ Касса.ВнешнееОборудование.УстройствоОтключено Тогда
			Результат.Используется			= Ложь;
			Результат.ДоступностьПробития	= Истина;
			Результат.ДоступностьСмены		= Истина;
		ИначеЕсли Касса.ИспользоватьБезПодключенияОборудования = ЛОЖЬ Тогда
			Результат.Используется = ?(ПараметрыСеанса.РабочееМестоКлиента = Касса.ВнешнееОборудование.РабочееМесто, Истина, "ИспользуетсяУдаленно");
			Результат.ДоступностьСмены = ?(ПараметрыСеанса.РабочееМестоКлиента = Касса.ВнешнееОборудование.РабочееМесто, Истина, Ложь);
			Результат.ДоступностьПробития = ?(ПараметрыСеанса.РабочееМестоКлиента = Касса.ВнешнееОборудование.РабочееМесто 
			ИЛИ ПараметрыСеанса.РабочееМестоКлиента <> Касса.ВнешнееОборудование.РабочееМесто И ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьОплатуПоНеФискальнымВидамОплатСЛюбогоРабочегоМеста, Ложь), Истина, Ложь);
		ИначеЕсли Касса.ИспользоватьБезПодключенияОборудования = ИСТИНА Тогда
			Результат.Используется = ?(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница = Касса.СтруктурнаяЕдиница, Ложь, "ИспользуетсяУдаленно");
			Результат.ДоступностьСмены = ?(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница = Касса.СтруктурнаяЕдиница, Истина, Ложь);
			Результат.ДоступностьПробития = ?(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница = Касса.СтруктурнаяЕдиница 
			ИЛИ ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница <> Касса.СтруктурнаяЕдиница И ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьОплатуПоНеФискальнымВидамОплатСЛюбогоРабочегоМеста, Ложь), Истина, Ложь);
		КонецЕсли;
		
		Возврат Результат; 
		
	КонецЕсли;
	
КонецФункции

// Функция выполняет получение параметров кассы ККМ.
//
Функция ПолучитьИдентификаторФискальногоРегистратораДляКассы(Касса) Экспорт
	
	Если ЗначениеЗаполнено(Касса.ВнешнееОборудование) И
		Касса.ИспользоватьБезПодключенияОборудования = Ложь
		И Касса.ВнешнееОборудование.УстройствоОтключено = Ложь
		И Касса.ВнешнееОборудование.ПометкаУдаления = Ложь Тогда
		
		Возврат Касса.ВнешнееОборудование;
	Иначе
		Возврат Неопределено;		
	КонецЕсли;
		
КонецФункции 

// Вернет признак фискальности указанного вида оплаты для данной кассы.
//
Функция ПолучитьПризнакФискальностиВидаОплатыПоКассе(Касса, ВидОплаты) Экспорт
	
	Возврат Справочники.Кассы.ПолучитьПризнакФискальностиВидаОплатыПоКассе(Касса, ВидОплаты);	
	
КонецФункции 

// Функция возвращает макет слип чека по наименованию макета
//
Функция ПолучитьПреЧек(ТаблицаТоваров, ТаблицаОплат = Неопределено, ШиринаПреЧека,  Клиент = Неопределено,ДокументОперации = Неопределено) Экспорт

	Документ = Новый ТекстовыйДокумент();
	ПреЧек  = "";

	Макет    = Справочники.ДрайверыОборудования.ПолучитьМакет("Пречек");
	Область  = Макет.ПолучитьОбласть("ЧекШапка"+ШиринаПреЧека);
	Документ.Вывести(Область);
	
	СуммаЧека = 0;
	Область       = Макет.ПолучитьОбласть("ЧекСтрока"+ШиринаПреЧека);
	ОбластьСкидки = Макет.ПолучитьОбласть("ЧекСкидка"+ШиринаПреЧека); 
	Для Каждого Элемент Из ТаблицаТоваров Цикл
		Область.Параметры.Наименование = ""+Элемент[0].Значение;
		Область.Параметры.Количество   = Элемент[5].Значение;
		Область.Параметры.Цена         = "="+ФОрмат((Элемент[9].Значение+Элемент[7].Значение),"ЧДЦ=2; ЧРД=.; ЧГ=");
		Документ.Вывести(Область);		
		
		// Если ЗначениеЗаполнено(ДокументОперации) И ТипЗнч(ДокументОперации) = Тип("ДокументСсылка.ПродажаАбонементов") Тогда
		//	Область   = Макет.ПолучитьОбласть("ЧекСтрока"+ШиринаПреЧека);
		//	Абонемент = ?(ДокументОперации.Запасы.Количество()>0,ДокументОперации.Запасы[0].Абонемент,Неопределено); 
		//	Если ЗначениеЗаполнено(Абонемент) И Абонемент.Номенклатура.СрокДействияАбонемента > 1  Тогда
		//		ДатаАктивации = Неопределено;
		//		Если  ЗначениеЗаполнено(Абонемент.ДатаАктивации) Тогда
		//			ДатаАктивации = Абонемент.ДатаАктивации;
		//		ИначеЕсли ЗначениеЗаполнено(ДокументОперации.ДатаАктивации) Тогда
		//			ДатаАктивации = ДокументОперации.ДатаАктивации;
		//		КонецЕсли;
		//		Если ЗначениеЗаполнено(ДатаАктивации) Тогда
		//			Область.Параметры.Наименование = "Активация: " + Формат(ДатаАктивации,"ДФ=dd.MM.yyyy");
		//			Документ.Вывести(Область);
		//		КонецЕсли;
		//	КонецЕсли;
		//	Если ЗначениеЗаполнено(Абонемент) И ЗначениеЗаполнено(ДатаАктивации) И Абонемент.Номенклатура.СрокДействияАбонемента > 1 Тогда
		//		СтрокаДанных = "";
		//		ДоступныйПериод =  РаботаСАбонементами.ВернутьСрокДействияДни(Абонемент, ДатаАктивации);
		//		Если ЗначениеЗаполнено(ДоступныйПериод)  Тогда
		//			Область.Параметры.Наименование =  "Окончание: " + Формат((ДатаАктивации + (ДоступныйПериод * 24 *60 *60 -1)),"ДФ=dd.MM.yyyy");
		//			Документ.Вывести(Область);
		//		КонецЕсли;
		//	КонецЕсли;
		// КонецЕсли;
		Если Элемент[8].Значение > 0 Тогда
			ОбластьСкидки.Параметры.Скидка = "="+ФОрмат(Элемент[8].Значение,"ЧДЦ=2; ЧРД=.; ЧГ=") + "%";
			Документ.Вывести(ОбластьСкидки);
		КонецЕсли;		
		СуммаЧека = СуммаЧека + Элемент[9].Значение; 
	КонецЦикла;
	
	Область                 = Макет.ПолучитьОбласть("ЧекПодвал"+ШиринаПреЧека);
	Область.Параметры.Итого = "="+ФОрмат(СуммаЧека,"ЧДЦ=2; ЧРД=.; ЧГ=");		
	Документ.Вывести(Область);
	
	Если ТаблицаОплат <> Неопределено Тогда		
		Область  = Макет.ПолучитьОбласть("ЧекОплата" + ШиринаПреЧека);		
		Для Каждого СтрокаОплаты ИЗ ТаблицаОплат Цикл
			Если СтрокаОплаты[1].Значение > 0 ТОгда
			  Область.Параметры.Оплата = ""+СтрокаОплаты[2].Значение;
			  Область.Параметры.Сумма  = "="+ФОрмат(СтрокаОплаты[1].Значение,"ЧДЦ=2; ЧРД=.; ЧГ=");; 
			  Документ.Вывести(Область);
			КОнецЕсли;
		КонецЦикла;		
	КонецЕсли;
	
	Если Не Клиент = Неопределено Тогда
		Область  = Макет.ПолучитьОбласть("ЧекРазделение"+ШиринаПреЧека);
		Документ.Вывести(Область);
		Область  = Макет.ПолучитьОбласть("ЧекСтрока"+ШиринаПреЧека);
		Область.Параметры.Наименование = "Клиент: "+Клиент;	
		Документ.Вывести(Область);
		
		Область  = Макет.ПолучитьОбласть("ЧекРазделение"+ШиринаПреЧека);
		Документ.Вывести(Область);
	КонецЕсли;
	
	Для Индекс = 1 По Документ.КоличествоСтрок() Цикл
		ПреЧек = ПреЧек + Документ.ПолучитьСтроку(Индекс)
				+ ?(Индекс = Документ.КоличествоСтрок(), "", Символ(13) + Символ(10));
	КонецЦикла;
	

	Возврат ПреЧек;

КонецФункции

// Функция возвращает макет слип чека по наименованию макета
//
Функция ПолучитьПречекКассира(Знач СписокДокументов = Неопределено, Параметры) Экспорт
	
	
	ЭтоУкраина = Справочники.СтруктурныеЕдиницы.ВернутьРегиональныеНастройки().Код = "804";
	Ширина 	   = ПолучитьШиринуПречека(Параметры.ИспользоватьФР, Параметры.ШиринаЧекаФР);
	ТабДок     = ?(Параметры.ИспользоватьФР, Новый ТекстовыйДокумент, Новый ТабличныйДокумент);
	Макет      = ПолучитьМакетПречека(Параметры.ИспользоватьФР, ЭтоУкраина);
	
	Клиент = ?(СписокДокументов = Неопределено Или ТипЗнч(СписокДокументов[0]) = Тип("ДокументСсылка.ВводНачальныхОстатков"), Параметры.Клиент, СписокДокументов[0].Контрагент);
	
	ОблЗаголовка     = Макет.ПолучитьОбласть("Заголовок" + Ширина);
	ОблДата          = Макет.ПолучитьОбласть("ИнформацияПоЧеку" + Ширина);
	ОблРазделение    = Макет.ПолучитьОбласть("Разделение" + Ширина);
	НомерЧека        = Макет.ПолучитьОбласть("НомерЧека" + Ширина);
	ОблСтрЕд         = Макет.ПолучитьОбласть("ИнформацияПоСтруктрнойЕдинице" + Ширина);
	ОблТовара        = Макет.ПолучитьОбласть("ИнформацияОТоваре" + Ширина);
	ОблСумма         = Макет.ПолучитьОбласть("ИнформацияПоСумме" + Ширина);
	ОблСкидка        = Макет.ПолучитьОбласть("ИнформацияПоСкидке" + Ширина);
	ОбщийИтог        = Макет.ПолучитьОбласть("ИнформацияОбщийИтог" + Ширина);
	ОблПодвал        = Макет.ПолучитьОбласть("Подвал" + Ширина);
	ОбластьВидыОплат = Макет.ПолучитьОбласть("ВидОплаты" + Ширина);
	ОблЛицевойСчет 	 = Макет.ПолучитьОбласть("ЛицевойСчет" + Ширина);
	ОблШапкаЛС   	 = Макет.ПолучитьОбласть("ШапкаЛицевогоСчета" + Ширина);
	ОблКомментарий	 = Макет.ПолучитьОбласть("Комментарий" + Ширина);
	ОблСотрудник	 = Макет.ПолучитьОбласть("ИнформацияПоМастеру" + Ширина);
	
	Попытка
		ОблСтол		= Макет.ПолучитьОбласть("ИнформацияПоСтолу" + Ширина);
	Исключение
		ОблСтол		= Неопределено;
	КонецПопытки;
	
	Если Не Параметры.ИспользоватьФР И Параметры.Свойство("ЛоготипОрганизации") И ЗначениеЗаполнено(Параметры.ЛоготипОрганизации) Тогда
		ВывестиОбластьЛоготипа(ТабДок, Макет, Параметры);
	КонецЕсли;
	
	мОбщийИтог     = 0;
	мОплаченоРанее = 0;
	ТабДок.Вывести(ОблЗаголовка);
	
	СтруктурнаяЕдиница = Неопределено;
	
	Если Параметры.Свойство("ТаблицаШапкаЧека") Тогда
		Для Каждого СтрокаШапки Из Параметры.ТаблицаШапкаЧека Цикл
			Если ЗначениеЗаполнено(СокрЛП(СтрокаШапки)) Тогда
				ОблЗаголовка.Параметры.ТекстЗаголовка = СокрЛП(СтрокаШапки);
				ТабДок.Вывести(ОблЗаголовка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОблДата.Параметры.Дата  = ТекущаяДатаСеанса();
	ОблДата.Параметры.Время = Формат(ТекущаяДатаСеанса(),"ДЛФ=T");
	ТабДок.Вывести(ОблДата);
	
	Если НЕ ОбщегоНазначенияПовтИсп.ЭтоСеансРегламентногоЗадания() И ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь) Тогда
		ОблДопИнформации = Макет.ПолучитьОбласть("ДопИнформация" + Ширина);
		ОблДопИнформации.Параметры.ТекстДопИнформации = ПараметрыСеанса.ТекущийПользователь;
		ТабДок.Вывести(ОблДопИнформации);
	КонецЕсли;
	
	ТабДок.Вывести(ОблРазделение);
		
	Если СписокДокументов = Неопределено Тогда
		
		СтруктурнаяЕдиница = Параметры.СтруктурнаяЕдиница;
		
		Если Параметры.Свойство("ВыводитьСтруктурнуюЕдиницу")
			И Параметры.ВыводитьСтруктурнуюЕдиницу = Истина Тогда
			
			ОблСтрЕд.Параметры.СтруктурнаяЕдиница = Параметры.СтруктурнаяЕдиница;
			ТабДок.Вывести(ОблСтрЕд);
			
		КонецЕсли;    		
						
		Для Каждого СтрокаТЧ из Параметры.МассивПараметровТовары Цикл
			ОблТовара.Параметры.Товар = СокрЛП(СтрокаТЧ.Наименование);			
			ТабДок.Вывести(ОблТовара);		
			ОблСумма.Параметры.ТекстСуммы = Строка(СтрокаТЧ.Количество) + " * " + Формат(СтрокаТЧ.СтоимостьСоСкидкой/СтрокаТЧ.Количество, "ЧЦ=12; ЧДЦ=2; ЧН=0,00; ЧГ=0") + " = " + Формат(СтрокаТЧ.СтоимостьСоСкидкой, "ЧЦ=15; ЧДЦ=2; ЧН=0,00; ЧГ=0");
			
			ТабДок.Вывести(ОблСумма);
			мОбщийИтог = мОбщийИтог + СтрокаТЧ.СтоимостьСоСкидкой;
		КонецЦикла;
		
	Иначе
		
		// Сортировка документов по дате.
		ТаблицаДокументов = Новый ТаблицаЗначений;
		ТаблицаДокументов.Колонки.Добавить("Дата");
		ТаблицаДокументов.Колонки.Добавить("Документ");
		
		Для Каждого Элемент Из СписокДокументов Цикл
			
			НоваяСтрока = ТаблицаДокументов.Добавить();
			НоваяСтрока.Дата 	 = Элемент.Дата;
			НоваяСтрока.Документ = Элемент.Ссылка;
			
		КонецЦикла;
		
		ТаблицаДокументов.Сортировать("Дата Возр");
		
		МассивДокументов = ТаблицаДокументов.ВыгрузитьКолонку("Документ");
		//
		
		Для Каждого Документ Из МассивДокументов Цикл
			
			НомерЧека.Параметры.НомерЧека = ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Документ.Номер, Неопределено);
			НомерЧека.Параметры.Дата = Документ.Дата;
			
			ТабДок.Вывести(НомерЧека);
			
			СтруктурнаяЕдиница = Документ.СтруктурнаяЕдиница;
			
			Если Параметры.Свойство("ВыводитьСтруктурнуюЕдиницу")
				И Параметры.ВыводитьСтруктурнуюЕдиницу = Истина Тогда
				
				ОблСтрЕд.Параметры.СтруктурнаяЕдиница = Документ.СтруктурнаяЕдиница;
				ТабДок.Вывести(ОблСтрЕд);
				
			КонецЕсли;     	
			
			// Если Параметры.Свойство("ИспользоватьСтолы") И Параметры.ИспользоватьСтолы И ОблСтол <> Неопределено И ТипЗнч(Документ) = Тип("ДокументСсылка.Реализация") Тогда
			//	
			//	ОблСтол.Параметры.Стол = "Стол: " + ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Документ, "Стол");
			//	ТабДок.Вывести(ОблСтол);
			//	
			// КонецЕсли; 
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РеализацияЗапасы.Номенклатура КАК Номенклатура,
			|	РеализацияЗапасы.Номенклатура.Наименование КАК Наименование,
			|	РеализацияЗапасы.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
			|	РеализацияЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
			|	РеализацияЗапасы.КоличествоУпаковок КАК Количество,
			|	РеализацияЗапасы.Цена КАК Цена,
			|	РеализацияЗапасы.Сумма КАК Сумма,
			|	РеализацияЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
			|	РеализацияЗапасы.СуммаАвтоматическойСкидкиНаценки КАК СуммаАвтоматическойСкидкиНаценки,
			|	РеализацияЗапасы.СтавкаНДС.Ставка КАК СтавкаНДС,
			|	РеализацияЗапасы.Сотрудник КАК Сотрудник,
			|	РеализацияЗапасы.Партия КАК Партия,
			|	РеализацияЗапасы.Номенклатура.Подразделение КАК Подразделение,
			|	РеализацияЗапасы.Всего КАК Всего
			|ИЗ
			|	Документ.Реализация.Запасы КАК РеализацияЗапасы
			|ГДЕ
			|	РеализацияЗапасы.Ссылка = &Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""Взнос на лиц. счет: "" + ПоступлениеДенежныхСредств.Контрагент.Наименование,
			|	"""",
			|	"""",
			|	NULL,
			|	1,
			|	ПоступлениеДенежныхСредств.СуммаДокумента,
			|	ПоступлениеДенежныхСредств.СуммаДокумента,
			|	0,
			|	0,
			|	NULL,
			|	ПоступлениеДенежныхСредств.Сотрудник,
			|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка),
			|	"""",
			|	ПоступлениеДенежныхСредств.СуммаДокумента
			|ИЗ
			|	Документ.ПоступлениеДенежныхСредств КАК ПоступлениеДенежныхСредств
			|ГДЕ
			|	ПоступлениеДенежныхСредств.Ссылка = &Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	Подразделение
			|ИТОГИ ПО
			|	Подразделение");
			
			Запрос.УстановитьПараметр("Ссылка", Документ);
			
			ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Итог = 0;
			
			Пока ВыборкаИтоги.Следующий() Цикл
				
				Если ЗначениеЗаполнено(ВыборкаИтоги.Подразделение) Тогда
					ОблПодвал.Параметры.ТекстПодвала = ВыборкаИтоги.Подразделение;
					ТабДок.Вывести(ОблПодвал);
					ОблПодвал.Параметры.ТекстПодвала = "";
				КонецЕсли;			
				
				Выборка = ВыборкаИтоги.Выбрать();				
				Пока Выборка.Следующий() Цикл
					
					Если НЕ ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
						Продолжить;
					КонецЕсли;
					
					
					ФорматЧисла = "ЧЦ=15; ЧДЦ=2; ЧН=0,00; ЧГ=0";
					
					НаименованиеНоменклатуры = ?(ЗначениеЗаполнено(Выборка.НаименованиеПолное), СокрЛП(Выборка.НаименованиеПолное), СокрЛП(Выборка.Наименование));
					
					ОблТовара.Параметры.Товар = НаименованиеНоменклатуры + ?(ЗначениеЗаполнено(Выборка.Партия), " ("+Выборка.Партия+")", "");
					ТабДок.Вывести(ОблТовара);
					
					Если ЗначениеЗаполнено(Выборка.Сотрудник)
						И (Выборка.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга) Тогда
						
						ПредставлениеСотрудника = " (" + Справочники.Сотрудники.ПредставлениеФИОСотрудника(Выборка.Сотрудник) + ")";
						
						ОблСотрудник.Параметры.Сотрудник = ПредставлениеСотрудника;
						ТабДок.Вывести(ОблСотрудник);
					
					КонецЕсли;
					
					ОблСумма.Параметры.ТекстСуммы = Строка(Выборка.Количество) + " * " + Формат(Выборка.Цена, ФорматЧисла) + " = " + Формат(Выборка.Количество * Выборка.Цена, ФорматЧисла);
					
					ТабДок.Вывести(ОблСумма);
					СкидкаНаценка = Выборка.Сумма - Выборка.Цена*Выборка.Количество;
					
					КоэфСкидки = Выборка.Цена*Выборка.Количество / 100;
					КоэфСкидки = ?(КоэфСкидки = 0, 1, КоэфСкидки);
					ПроцентСкидки = Окр(СкидкаНаценка * -1/КоэфСкидки , 2, РежимОкругления.Окр15как20);
					
					Если СкидкаНаценка < 0 Тогда
						ОблСкидка.Параметры.ТекстСкидки = ПолучитьСловоСУчетомЯзыка("Скидка", ЭтоУкраина) + " (" + ПроцентСкидки + "%)" + ": " + Формат(СкидкаНаценка, ФорматЧисла);
						ТабДок.Вывести(ОблСкидка);
					ИначеЕсли СкидкаНаценка > 0 Тогда
						ОблСкидка.Параметры.ТекстСкидки = ПолучитьСловоСУчетомЯзыка("Наценка", ЭтоУкраина) + " (" + ПроцентСкидки + "%)" + ": " + Формат(-СкидкаНаценка, ФорматЧисла);
						ТабДок.Вывести(ОблСкидка);
					КонецЕсли;
					
					Если Не Выборка.СтавкаНДС = Null и Выборка.СтавкаНДС > 0 Тогда
						ОблСумма.Параметры.ТекстСуммы = ПолучитьСловоСУчетомЯзыка("НДС", ЭтоУкраина) + ": " + Выборка.СтавкаНДС + "%" + Символы.ПС;
						ТабДок.Вывести(ОблСумма);
					КонецЕсли;
					
					Итог = Итог + Выборка.Всего;
					мОбщийИтог = мОбщийИтог + Выборка.Всего;
					
				КонецЦикла;
				
			КонецЦикла;
			
			// Если Не ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств") Тогда
			//	мОплаченоРанее = мОплаченоРанее + РегистрыНакопления.Оплаты.ПолучитьСуммуОплатыПоДокументу(Документ);
			// КонецЕсли;
			
			ВывестиИтог(ТабДок, Макет, Ширина, Итог, ОблРазделение);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбщийИтог.Параметры.Всего = Формат(мОбщийИтог, "ЧЦ=15; ЧДЦ=2; ЧН=0,00; ЧГ=0");

	ТабДок.Вывести(ОбщийИтог);
	ТабДок.Вывести(ОблРазделение);	

	Если Параметры.Свойство("СтруктураОплаты") Тогда
		Если Параметры.СтруктураОплаты = Неопределено Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СУММА(ПоступлениеДенежныхСредствРасшифровкаПлатежа.Сумма) КАК Сумма,
			|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипДенежныхСредств КАК Вид
			|ИЗ
			|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеДенежныхСредствРасшифровкаПлатежа
			|ГДЕ
			|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Основание В(&Реализация)
			|	И ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
			|
			|СГРУППИРОВАТЬ ПО
			|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипДенежныхСредств
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СУММА(СписаниеДенежныхСредствРасшифровкаПлатежа.Сумма),
			|	СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипДенежныхСредств
			|ИЗ
			|	Документ.СписаниеДенежныхСредств.РасшифровкаПлатежа КАК СписаниеДенежныхСредствРасшифровкаПлатежа
			|ГДЕ
			|	СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
			|	И СписаниеДенежныхСредствРасшифровкаПлатежа.Основание В(&Реализация)
			|
			|СГРУППИРОВАТЬ ПО
			|	СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипДенежныхСредств");
			
			Запрос.УстановитьПараметр("Реализация", СписокДокументов);
			
			ТипыОплат = Запрос.Выполнить().Выгрузить();
			
			Для Каждого СтрокаТЧ из ТипыОплат Цикл
				ВывестиОбластьВидыОплат(ТабДок, ОбластьВидыОплат, СтрокаТЧ.Вид, СтрокаТЧ.Сумма, ЭтоУкраина);
			КонецЦикла;
			Если ТипыОплат.Количество() > 0 Тогда
				ТабДок.Вывести(ОблРазделение);
			КонецЕсли;
			
		Иначе
			
			мВнесено     = 0;			
			Для Каждого СтрокаТЧ из Параметры.СтруктураОплаты Цикл
				
				ВывестиОбластьВидыОплат(ТабДок, ОбластьВидыОплат, СтрокаТЧ.ТипДенежныхСредств, СтрокаТЧ.Внесено, ЭтоУкраина);
				
				мВнесено = мВнесено + СтрокаТЧ.Внесено;
				Если СтрокаТЧ.Свойство("ЧекПробит") И СтрокаТЧ.ЧекПробит Тогда
					мОплаченоРанее = мОплаченоРанее - мВнесено; 
				КонецЕсли;
				
			КонецЦикла;
			
			Если мОплаченоРанее > 0 Тогда
				ВывестиОбластьВидыОплат(ТабДок, ОбластьВидыОплат, "Оплачено ранее: ", мОплаченоРанее, ЭтоУкраина);
			КонецЕсли;
			мОбщийИтог = мОбщийИтог - мОплаченоРанее; 
			Если мОбщийИтог < мВнесено Тогда
				ВывестиОбластьВидыОплат(ТабДок, ОбластьВидыОплат, "Сдача: ", (мВнесено - мОбщийИтог), ЭтоУкраина);
			ИначеЕсли мОбщийИтог > мВнесено Тогда
				ВывестиОбластьВидыОплат(ТабДок, ОбластьВидыОплат, "Долг: ", (мОбщийИтог - мВнесено), ЭтоУкраина);
			КонецЕсли;
			
			ТабДок.Вывести(ОблРазделение);
			
		КонецЕсли;
		
		Если Параметры.Свойство("ВыводитьОстаткиНаЛицевыхСчетах")
			И Параметры.ВыводитьОстаткиНаЛицевыхСчетах Тогда 
			ВывестиЛицевыеСчетаВПречек(Клиент, СтруктурнаяЕдиница, ТабДок, ОблЛицевойСчет, ОблШапкаЛС, ОблРазделение);
		КонецЕсли;
		
		ВывестиОбластьКлиента(ТабДок, Макет, Ширина, Клиент, ОблПодвал);
		
		Если Параметры.Свойство("ВыводитьКомментарий")
			И Параметры.ВыводитьКомментарий = Истина Тогда
			
			// ТабДок.Вывести(ОблРазделение);
			ОблКомментарий.Параметры.Комментарий = Документ.Комментарий;
			ТабДок.Вывести(ОблКомментарий);
			// ТабДок.Вывести(ОблРазделение);
			
		КонецЕсли;
		
		Для Каждого СтрокаПодвала Из Параметры.ТаблицаПодвалЧека Цикл
			ОблПодвал.Параметры.ТекстПодвала = СокрЛП(СтрокаПодвала);
			ТабДок.Вывести(ОблПодвал); 	
		КонецЦикла;
		
	Иначе		
		
		Для Каждого СтрокаТЧ из Параметры.МассивПараметровОплаты Цикл
			ВывестиОбластьВидыОплат(ТабДок, ОбластьВидыОплат, СтрокаТЧ.ТипОплаты, СтрокаТЧ.Сумма, ЭтоУкраина);
		КонецЦикла;
		
		Если Параметры.Свойство("ВыводитьОстаткиНаЛицевыхСчетах")
			И Параметры.ВыводитьОстаткиНаЛицевыхСчетах Тогда
			ВывестиЛицевыеСчетаВПречек(Клиент, СтруктурнаяЕдиница, ТабДок, ОблЛицевойСчет, ОблШапкаЛС, ОблРазделение);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВернутьОтформатированныйТабличныйДокументИлиПречек(ТабДок, Параметры, Истина);	
		
КонецФункции      

// Процедуры выводить область видов оплаты.
//
Процедура ВывестиОбластьВидыОплат(ТабДок, ОбластьВидыОплат, ВидОплаты, СуммаОплаты, ЭтоУкраина)
	
	ОбластьВидыОплат.Параметры.ВидОплаты = ПолучитьСловоСУчетомЯзыка(ВидОплаты, ЭтоУкраина);
	ОбластьВидыОплат.Параметры.Сумма 	 = Формат(СуммаОплаты, "ЧЦ=15; ЧДЦ=2; ЧН=0,00; ЧГ=0");
	ТабДок.Вывести(ОбластьВидыОплат);
	
КонецПроцедуры

// Функция - получает слово с учетом языка.
//
Функция ПолучитьСловоСУчетомЯзыка(ВидОплаты, ЭтоУкраина = Неопределено) Экспорт
	
	Если ЭтоУкраина = Неопределено Тогда
		ЭтоУкраина = Справочники.СтруктурныеЕдиницы.ВернутьРегиональныеНастройки().Код = "804";
	КонецЕсли;
	
	Если ЭтоУкраина Тогда
		// Для україномовних хлопцев)
		Если ВидОплаты = "Отдел" Тогда
			Возврат "Відділ";
		ИначеЕсли ВидОплаты = "Кассир" Тогда
			Возврат "Касир";
		ИначеЕсли ВидОплаты = "Возврат оплаты: " Тогда
			Возврат "Повернення оплати: ";
		ИначеЕсли ВидОплаты = "Открытие чека возврата" Тогда
			Возврат "Відкриття чека повернення";
		ИначеЕсли ВидОплаты = "Открытие чека продажи" Тогда
			Возврат "Відкриття чека продажу";
		ИначеЕсли ВидОплаты = "Фискальный режим" Тогда
			Возврат "Фіскальний режим";
		ИначеЕсли ВидОплаты = "Нефискальный режим" Тогда
			Возврат "Нефіскальний режим";
		ИначеЕсли ВидОплаты = "смены" Тогда
			Возврат "зміни";
		ИначеЕсли ВидОплаты = "Скидка" Тогда
			Возврат "Знижка";
		ИначеЕсли ВидОплаты = "Наценка" Тогда
			Возврат "Націнка";
		ИначеЕсли ВидОплаты = "НДС" Тогда
			Возврат "ПДВ";
		ИначеЕсли ВидОплаты = "Оплачено ранее: " Тогда
			Возврат "Оплачено раніше: ";
		ИначеЕсли ВидОплаты = "Сдача: " Тогда
			Возврат "Решта: ";
		ИначеЕсли ВидОплаты = "Долг: " Тогда
			Возврат "Борг: ";
		ИначеЕсли ВидОплаты = "ИТОГО" Тогда
			Возврат "РАЗОМ";
		ИначеЕсли ВидОплаты = "Продажа №" Тогда
			Возврат "Продаж №";
		ИначеЕсли ВидОплаты = "(Пакет услуг)" Тогда
			Возврат "(Пакет послуг)";
		ИначеЕсли ВидОплаты = "(Членство)" Тогда
			Возврат "(Членство)";
		ИначеЕсли ВидОплаты = "неогр." Тогда
			Возврат "необм.";
		ИначеЕсли ВидОплаты = Перечисления.ТипыДенежныхСредств.Наличные ИЛИ ВидОплаты = "Наличная оплата" Тогда
			Возврат "Готівка";
		ИначеЕсли ВидОплаты = Перечисления.ТипыДенежныхСредств.ЛицевойСчет Тогда
			Возврат "Особовий рахунок";
		ИначеЕсли ВидОплаты = Перечисления.ТипыДенежныхСредств.Безналичные ИЛИ ВидОплаты = "Безналичная оплата" Тогда
			Возврат "Безготівковий розрахунок";
		// ИначеЕсли ВидОплаты = Перечисления.ТипыДенежныхСредств.БонусныйСчет Тогда
		//	Возврат "Бонусний рахунок";
		// ИначеЕсли ВидОплаты = Перечисления.ТипыДенежныхСредств.КорпоративныйДоговор Тогда
		//	Возврат "Корпоративний договір";
		ИначеЕсли ВидОплаты = Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта ИЛИ ВидОплаты = "Платежная карта" Тогда
			Возврат "Платіжна картка";
		ИначеЕсли ВидОплаты = Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат Тогда
			Возврат "Подарунковий сертифікат"; 
		ИначеЕсли ВидОплаты = "Взнос на лицевой счет" Тогда
			Возврат "Тренування";    
		ИначеЕсли ВидОплаты = "Оплата от:" Тогда
			Возврат "Тренування:";  
		ИначеЕсли ВидОплаты = "Возврат с лицевого счета" Тогда
			Возврат "Тренування:";  
		ИначеЕсли ВидОплаты = "Аванс от: " Тогда
			Возврат "Аванс від: ";  
		Иначе
			Возврат "";
		КонецЕсли;
		
	ИначеЕсли ПользователиСлужебныйПовтИсп.ЯзыкИнтерфейсаАнглийский() Тогда
		
		Если ВидОплаты = "Отдел" Тогда
			Возврат "Department";
		ИначеЕсли ВидОплаты = "Кассир" Тогда
			Возврат "Cashier";
		ИначеЕсли ВидОплаты = "Возврат оплаты: " Тогда
			Возврат "Payment refund: ";
		ИначеЕсли ВидОплаты = "Открытие чека возврата" Тогда
			Возврат "Opening of the refund receipt";
		ИначеЕсли ВидОплаты = "Открытие чека продажи" Тогда
			Возврат "Opening of the sale receipt";
		ИначеЕсли ВидОплаты = "Фискальный режим" Тогда
			Возврат "Fiscal mode";
		ИначеЕсли ВидОплаты = "Нефискальный режим" Тогда
			Возврат "Non-fiscal mode";
		ИначеЕсли ВидОплаты = "смены" Тогда
			Возврат "shift";
		ИначеЕсли ВидОплаты = "Скидка" Тогда
			Возврат "Discount";
		ИначеЕсли ВидОплаты = "Наценка" Тогда
			Возврат "Mark-up";
		ИначеЕсли ВидОплаты = "НДС" Тогда
			Возврат "VAT";
		ИначеЕсли ВидОплаты = "Оплачено ранее: " Тогда
			Возврат "Paid earlier: ";
		ИначеЕсли ВидОплаты = "Сдача: " Тогда
			Возврат "Change: ";
		ИначеЕсли ВидОплаты = "Долг: " Тогда
			Возврат "Debt: ";
		ИначеЕсли ВидОплаты = "ИТОГО" Тогда
			Возврат "TOTAL";
		ИначеЕсли ВидОплаты = "Продажа №" Тогда
			Возврат "Sale №";
		ИначеЕсли ВидОплаты = "(Пакет услуг)" Тогда
			Возврат "(Package of services)";
		ИначеЕсли ВидОплаты = "(Членство)" Тогда
			Возврат "(Membership)";
		ИначеЕсли ВидОплаты = "неогр." Тогда
			Возврат "unlim.";
		ИначеЕсли ВидОплаты = Перечисления.ТипыДенежныхСредств.Наличные ИЛИ ВидОплаты = "Наличная оплата" Тогда
			Возврат "Cash funds";
		ИначеЕсли ВидОплаты = Перечисления.ТипыДенежныхСредств.ЛицевойСчет Тогда
			Возврат "Personal account";
		ИначеЕсли ВидОплаты = Перечисления.ТипыДенежныхСредств.Безналичные ИЛИ ВидОплаты = "Безналичная оплата" Тогда
			Возврат "Cashless funds";
		ИначеЕсли ВидОплаты = Перечисления.ТипыДенежныхСредств.БонусныйСчет Тогда
			Возврат "Bonus account";
		ИначеЕсли ВидОплаты = Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта ИЛИ ВидОплаты = "Платежная карта" Тогда
			Возврат "Payment card";
		ИначеЕсли ВидОплаты = Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат Тогда
			Возврат "Gift certificate"; 
		ИначеЕсли ВидОплаты = "Взнос на лицевой счет" Тогда
			Возврат "Personal account fee";    
		ИначеЕсли ВидОплаты = "Оплата от:" Тогда
			Возврат "Payment from:";  
		ИначеЕсли ВидОплаты = "Возврат с лицевого счета" Тогда
			Возврат "Personal account refund:";  
		ИначеЕсли ВидОплаты = "ФИО: " Тогда
			Возврат "Member: ";  
		ИначеЕсли ВидОплаты = "Аванс от: " Тогда
			Возврат "Advance payment from: ";  


		Иначе
			Возврат "";
		КонецЕсли;		
		
	Иначе
		Возврат "" + ВидОплаты;
	КонецЕсли;
	
КонецФункции

// Процедура выводит лицевые счета клиента в пречек.
//
Процедура ВывестиЛицевыеСчетаВПречек(Клиент, СтруктурнаяЕдиница, ТабДок, ОблЛицевойСчет, ОблШапкаЛС, ОблРазделение)
	
	// СтруктурнаяЕдиница = ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);	
	//
	// ТаблицаЛС = РегистрыНакопления.РасчетыСПокупателями.ПолучитьОстаткиНаЛицевыхСчетахКонтрагента(ТекущаяДатаСеанса(), СтруктурнаяЕдиница.Организация, Клиент,,,, Ложь, Истина, Ложь);
	//
	// Если ТипЗнч(ТаблицаЛС) = Тип("ТаблицаЗначений") и  ТаблицаЛС.Количество() > 0 Тогда
	//	
	//	ТабДок.Вывести(ОблШапкаЛС);
	//	
	//	Для Каждого ЛицевойСчет Из ТаблицаЛС Цикл
	//		
	//		ОблЛицевойСчет.Параметры.ЛицевойСчет = ЛицевойСчет.ВидСчета;
	//		ОблЛицевойСчет.Параметры.Сумма  	 = Формат(ЛицевойСчет.СуммаОстаток, "ЧЦ=15; ЧДЦ=2; ЧН=0,00");
	//		ТабДок.Вывести(ОблЛицевойСчет);
	//		
	//	КонецЦикла;
	//	
	//	ТабДок.Вывести(ОблРазделение);
	//	
	// КонецЕсли; 
	
КонецПроцедуры

// Функция, возвращает ширину пречека.
//
Функция ПолучитьШиринуПречека(ИспользоватьФР, ШиринаЧекаФР)
	
	Если ИспользоватьФР Тогда
		Возврат ?(ЗначениеЗаполнено(ШиринаЧекаФР), ШиринаЧекаФР, "32");
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции   

// Функция, возвращает макет пречека.
//
Функция ПолучитьМакетПречека(ИспользоватьФР, ЭтоУкраина)
	
	Если ИспользоватьФР Тогда
		
		Возврат Справочники.ДрайверыОборудования.ПолучитьМакет("ХеликсПречек");
		
	ИначеЕсли ЭтоУкраина Тогда
		// Для рідной країны мы сделали отдельный макет на украинском. Баст.
		Возврат Справочники.ДрайверыОборудования.ПолучитьМакет("ПречекWinPrintUA");
	Иначе
		Возврат Справочники.ДрайверыОборудования.ПолучитьМакет("ПречекWinPrint");
	КонецЕсли;
	
КонецФункции

// Процедура, выводит область логотипа.
//
Процедура ВывестиОбластьЛоготипа(ТабДок, Макет, Параметры) Экспорт
	
	Возврат;
	
	// разобраться Диана.
	
	// ОбластьЛоготипОрганизации = Неопределено;
	// Попытка
	//	ОбластьЛоготипОрганизации = Макет.ПолучитьОбласть("ОбластьЛоготипОрганизации");
	// Исключение КонецПопытки;
	//
	// Если ОбластьЛоготипОрганизации = Неопределено Тогда
	//	Возврат;
	// КонецЕсли;
	//
	// ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(Параметры.ЛоготипОрганизации);
	//
	// Логотип = ОбластьЛоготипОрганизации.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	// Логотип.Высота 		   = 30;
	// Логотип.Ширина 		   = 59;
	// Логотип.ГраницаСверху  = Ложь;
	// Логотип.ГраницаСнизу   = Ложь;
	// Логотип.ГраницаСлева   = Ложь;
	// Логотип.ГраницаСправа  = Ложь;
	// Логотип.РазмерКартинки = РазмерКартинки.Пропорционально;
	//
	// Если ЗначениеЗаполнено(ДанныеФайла.ТекущаяВерсия.Том) Тогда
	//	
	//	ПолныйПуть = ФайловыеФункцииСлужебный.ПолныйПутьТома(ДанныеФайла.ТекущаяВерсия.Том) + ДанныеФайла.ТекущаяВерсия.ПутьКФайлу; 
	//	Попытка
	//		Логотип.Картинка = Новый Картинка(Новый ДвоичныеДанные(ПолныйПуть));
	//	Исключение
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось получить картинку логотипа!';en='Not succeeded receive picture logo!'"));
	//	КонецПопытки;
	//	
	// Иначе
	//	Логотип.Картинка 	 = Новый Картинка(РаботаСФайламиСлужебныйВызовСервера.ПолучитьХранилищеФайлаИзИнформационнойБазы(ДанныеФайла.Версия).Получить());
	//	ДвоичныеДанныеФайла_М = РаботаСФайламиВызовСервераСтоматология.ПолучитьДвоичныеДанныеФайла(Параметры.ЛоготипОрганизации);
	//	Если ЗначениеЗаполнено(ДвоичныеДанныеФайла_М) Тогда 
	//		Логотип.Картинка 	 = Новый Картинка(ДвоичныеДанныеФайла_М);
	//	КонецЕсли;	
	// КонецЕсли;
	//
	// ТабДок.Вывести(ОбластьЛоготипОрганизации);
	
КонецПроцедуры

// Процедура, выводит область клиента.
//
Процедура ВывестиОбластьКлиента(ТабДок, Макет, ШиринаПречека, Клиент, ОблПодвал = Неопределено)
	
	ОблКлиент  = Макет.ПолучитьОбласть("ИнформацияПоКлиенту" + ШиринаПречека);
	ОблПодпись = Макет.ПолучитьОбласть("Подпись" + ШиринаПречека);
	
	ОблКлиент.Параметры.Клиент = Клиент;
	ТабДок.Вывести(ОблКлиент);
	Если ОблПодвал <> Неопределено Тогда
		ТабДок.Вывести(ОблПодвал);
	КонецЕсли;
	ТабДок.Вывести(ОблПодпись);
	Если ОблПодвал <> Неопределено Тогда
		ТабДок.Вывести(ОблПодвал);
	КонецЕсли;
	
КонецПроцедуры

// Процедура, выводит область услуги.
//
Процедура ВывестиУслугуИСотрудника(ТабДок, ОбластьИнформацияПоУслуге, ОбластьСотрудника, ПредставлениеНоменклатуры, Количество, Тренер, ВыводитьСотрудника = Истина)
	
	ОбластьИнформацияПоУслуге.Параметры.Услуга	= ПредставлениеНоменклатуры;
	ОбластьИнформацияПоУслуге.Параметры.Кол		= Количество;
	ТабДок.Вывести(ОбластьИнформацияПоУслуге);
	
	Если ВыводитьСотрудника Тогда
		ОбластьСотрудника.Параметры.Сотрудник = "(вр. " + Тренер + ")";
		ТабДок.Вывести(ОбластьСотрудника);
	КонецЕсли;
	
КонецПроцедуры

// Процедура, выводит область итога.
//
Процедура ВывестиИтог(ТабДок, Макет, ШиринаПречека, Итог, ОблРазделение)
	
	ОблИтого = Макет.ПолучитьОбласть("ИнформацияИтого" + ШиринаПречека);
	ОблИтого.Параметры.Всего = Формат(Итог, "ЧЦ=15; ЧДЦ=2; ЧН=0,00; ЧГ=0");
	ТабДок.Вывести(ОблИтого);
	ТабДок.Вывести(ОблРазделение);
	
КонецПроцедуры

// Функция, устанавливает поля табличного документа.
//
Функция ВернутьОтформатированныйТабличныйДокументИлиПречек(ТабДок, Параметры, ПечатьПречекаКассира)
	
	Если Не Параметры.ИспользоватьФР Тогда
		ТабДок.ПолеСверху = 0.5;
		ТабДок.ПолеСнизу  = 0.5;
		ТабДок.ПолеСлева  = 0.1;
		ТабДок.ПолеСправа = 0.1;
		ТабДок.РазмерКолонтитулаСверху = 0.5;
		ТабДок.РазмерКолонтитулаСнизу = 0.5;
		
		// Если Не ПечатьПречекаКассира Тогда
		//	
		//	ЧислоКопий = Константы.ЧислоКопийКвитанцииРегистрации.Получить();
		//	
		//	Если ЗначениеЗаполнено(ЧислоКопий) Тогда
		//		ТабДок.КоличествоЭкземпляров = ЧислоКопий;
		//	КонецЕсли;
		//	
		// КонецЕсли;
		
		// Если ПечатьПречекаКассира И Параметры.ПечатьПриПробитии
		//	ИЛИ Не ПечатьПречекаКассира И ЗначениеЗаполнено(ЧислоКопий) Тогда
		//	
		//	ТабДок.КоличествоЭкземпляров = ?(ПечатьПречекаКассира, Параметры.ЧислоКопий, ЧислоКопий);
		// КонецЕсли;
		
		Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("Ширина") И Параметры.Ширина = 80 Тогда
			ТабДок.Область("C15:C15").ШиринаКолонки = 8;
		ИначеЕсли ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("Ширина") И Параметры.Ширина = 100 Тогда
			ТабДок.Область("C15:C15").ШиринаКолонки = 18;
		КонецЕсли;
		
		Возврат ТабДок;
		
	Иначе
		
		Пречек = "";
		Для Индекс = 1 По ТабДок.КоличествоСтрок() Цикл
			ПреЧек = ПреЧек + ТабДок.ПолучитьСтроку(Индекс) + ?(Индекс = ТабДок.КоличествоСтрок(), "", Символ(13) + Символ(10));
		КонецЦикла;
		
		Возврат ПреЧек;
		
	КонецЕсли;
	
КонецФункции   

// Процедура, заполняет параметры области, если они не были удалены в пользовательском макете.
//
Процедура ЗаполнитьПараметрОбласти(ОбластьМакета, НаименованиеПараметра, Значение)
	
	Попытка
		ОбластьМакета.Параметры[НаименованиеПараметра] = Значение;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

// Функция - Получить параметры экварийнга
//
// Параметры:
//  Эквайринг	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьИдетификаторЭкварийнговогоТерминала(Эквайринг) Экспорт
			
	Если ЗначениеЗаполнено(Эквайринг.ПодключаемоеОборудование)
		И Эквайринг.ИспользоватьБезПодключенияОборудования = Ложь
		И Эквайринг.ПодключаемоеОборудование.УстройствоИспользуется = Истина
		И Эквайринг.ПодключаемоеОборудование.ПометкаУдаления = Ложь Тогда
		
		Возврат Эквайринг.ПодключаемоеОборудование;
	Иначе
		Возврат Неопределено;		
	КонецЕсли;	
	
КонецФункции 

// Функция - Пустая структура параметров чека
// 
// Возвращаемое значение:
//   - 
//
Функция ПустаяСтруктураПараметровЧека() Экспорт
				
	ПараметрыЧека = Новый Структура;
	ПараметрыЧека.Вставить("ВидОперации");
	ПараметрыЧека.Вставить("СтруктурнаяЕдиница");
	ПараметрыЧека.Вставить("Организация");
	ПараметрыЧека.Вставить("Сотрудник");
	ПараметрыЧека.Вставить("Клиент");
	ПараметрыЧека.Вставить("Дата");
	ПараметрыЧека.Вставить("Касса");
	ПараметрыЧека.Вставить("СуммаКОплате");
	ПараметрыЧека.Вставить("СуммаОплачено");
	ПараметрыЧека.Вставить("МассивПараметровОплаты");               
	ПараметрыЧека.Вставить("МассивПараметровТовары");
	ПараметрыЧека.Вставить("ТипЧека");	
	ПараметрыЧека.Вставить("ВидНалога");
	ПараметрыЧека.Вставить("ВыводитьЧекНаБумагу");
    ПараметрыЧека.Вставить("ЭлектроннаяПочтаКлиента");
    ПараметрыЧека.Вставить("НомерТелефонаКлиента");

	// Для поддержки ФР
	ПараметрыЧека.Вставить("СтоимостьБезСкидки");
	ПараметрыЧека.Вставить("Количество");
	ПараметрыЧека.Вставить("Наименование");
	ПараметрыЧека.Вставить("ТипОплаты");
	
	ПараметрыЧека.Вставить("МассивДокументовОснований", Новый Массив());	
	
	ПараметрыЧека.Вставить("ПризнакАгента"     , Неопределено); 				// Перечисление - Признак агента (Тег 1057).
	ПараметрыЧека.Вставить("ДанныеАгента"      , ПараметрыДанныеАгента());     	// Структура,Заполнение необязательно - Данные агента.
	ПараметрыЧека.Вставить("ДанныеПоставщика"  , ПараметрыДанныеПоставщика()); 	// Структура,Заполнение необязательно - Данные поставщика.
	
	ПараметрыЧека.Вставить("СформироватьЧекКоррекции"	, Ложь);

	ПараметрыЧека.Вставить("ЕдиныйЧек"					, Ложь);       	
	ПараметрыЧека.Вставить("ДополнительныйРеквизит" 	, Неопределено); 
		
	Возврат ПараметрыЧека;
	
КонецФункции

// Функция возвращает струкутру параметров чека коррекции.
//
Функция ПустаяСтруктураПараметровЧекаКоррекции() Экспорт 
	
	ПараметрыЧека = ПустаяСтруктураПараметровЧека();
	ПараметрыЧека.Вставить("КорректируемыйДокумент"	, Новый Массив());
	ПараметрыЧека.Вставить("НеприменениеККТ"		, Ложь); 
	ПараметрыЧека.Вставить("ДанныеКоррекции"		, ПараметрыДанныеКоррекции()); 
	
	Возврат ПараметрыЧека; 
	
КонецФункции

// Заполняет структуру данных агента.
//
// Описание
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * ОператорПоПриемуПлатежей - Структура -:
// ** Телефон - Неопределено -
// * ОператорПеревода - Структура - структура данных с полями:
// ** Телефон - Строка - 
// ** Наименование - Строка -
// ** Адрес - Строка - 
// ** ИНН - Строка - 
// * ПлатежныйАгент - Структура - структура данных с полями:
// ** Операция - Строка - 
// ** Телефон - Строка - 
//
Функция ПараметрыДанныеАгента()
	
	// ФФД - Значения реквизита «данные агента» (тег 1223) указаны в таблице 22.
	Параметры = Новый Структура();
	
	ПлатежныйАгент = Новый Структура();
	ПлатежныйАгент.Вставить("Операция", Неопределено);  // Строка - Операция платежного агента.
	ПлатежныйАгент.Вставить("Телефон" , Неопределено);  // Строка - Телефон платежного агента. В формате +{Ц}.
	Параметры.Вставить("ПлатежныйАгент", ПлатежныйАгент);
	
	ОператорПеревода = Новый Структура();
	ОператорПеревода.Вставить("Телефон"     , Неопределено); // Строка - Телефон оператора перевода. В формате +{Ц}.
	ОператорПеревода.Вставить("Наименование", Неопределено); // Строка - Наименование оператора перевода.
	ОператорПеревода.Вставить("Адрес"       , Неопределено); // Строка - Адрес оператора перевода.
	ОператорПеревода.Вставить("ИНН"         , Неопределено); // Строка - ИНН оператора перевода.
	Параметры.Вставить("ОператорПеревода", ОператорПеревода);
	
	ОператорПоПриемуПлатежей = Новый Структура();
	ОператорПоПриемуПлатежей.Вставить("Телефон", Неопределено); // Строка - Телефон оператора по приему платежей. В формате +{Ц}.
	Параметры.Вставить("ОператорПоПриемуПлатежей", ОператорПоПриемуПлатежей);
	
	Возврат Параметры; 
	
КонецФункции

// Заполняет структуру данных поставщика.
//
// Возвращаемое значение:
// 	Структура - Описание:
// * ИНН 
// * Наименование 
// * Телефон 
Функция ПараметрыДанныеПоставщика() 
	
	Параметры = Новый Структура();
	Параметры.Вставить("Телефон");      // Строка - Телефон поставщика. В формате +{Ц}.
	Параметры.Вставить("Наименование"); // Строка - Наименование поставщика.
	Параметры.Вставить("ИНН");          // Строка - ИНН поставщика.
	Возврат Параметры; 
	
КонецФункции

// Заполняет структуру параметров строки оплаты.
//
Функция ПараметрыДанныеКоррекции()
	
	ДанныеКоррекции = Новый Структура();
	ДанныеКоррекции.Вставить("ТипКоррекции"			, 0);   // Число,Обязательно     - Тип коррекции: 0-самостоятельно, 1-по предписанию.
	ДанныеКоррекции.Вставить("ОписаниеКоррекции"	); // Строка,Необязательно  - Описание коррекции.
	ДанныеКоррекции.Вставить("ДатаКоррекции"		);     // ДатаВремя,Обязательно - Дата совершения корректируемого расчета.
	ДанныеКоррекции.Вставить("НомерПредписания"		);  // Строка,Обязательно    - Номер предписания налогового органа.
	
	Возврат ДанныеКоррекции; 
	
КонецФункции  

// Функция - Пустая структура строки товаров чека
// 
// Возвращаемое значение:
//   - 
//
Функция ПустаяСтруктураСтрокиТоваровЧека() Экспорт

	СтруктураСтрокиТоваровЧека = Новый Структура(
	"Номенклатура,
	|Наименование,
	|СтоимостьБезСкидки, 
	|СтоимостьСоСкидкой,
	|СуммаСкидки, 
	|ПроцентСкидки,
	|Количество, 
	|СтавкаНДС,
	|СуммаНДС,
	|НомерСекции,
	|Штрихкод,
	|ПризнакСпособаРасчета,
	|ПризнакПредметаРасчета,
	|ЭтоОплатаКредита,
	|СуммаОплачено,
	|Дата,
	//|ЧПУ,
	|СуммаВключаетНДС",
	Неопределено,
	Неопределено,
	0,
	0,
	0,
	0,
	1,
	Неопределено,
	0,
	1,
	Неопределено,
	Неопределено,
	Неопределено,
	Ложь,
	Неопределено,
	Неопределено,
	// Неопределено,
	Истина);
	
	// Перечисление - ПризнакиАгента - (ФФД, Тег 1222, Расшифровка - таблица 21)
	СтруктураСтрокиТоваровЧека.Вставить("ПризнакАгентаПоПредметуРасчета");  // Необязательно, Признак агента по предмету расчета, Тег 1222.
	СтруктураСтрокиТоваровЧека.Вставить("ДанныеАгента"     , ПараметрыДанныеАгента());     // Структура - Данные агента, Тег 1223. Заполнение необязательно.
	СтруктураСтрокиТоваровЧека.Вставить("ДанныеПоставщика" , ПараметрыДанныеПоставщика()); // Структура - Данные агента, Тег 1224. Заполнение необязательно.
	
	СтруктураСтрокиТоваровЧека.Вставить("ДанныеКодаТоварнойНоменклатуры", МенеджерОборудованияКлиентСервер.ПараметрыДанныеКодаТоварнойНоменклатуры());  // Коды товарной номенклатуры.
	
	Возврат СтруктураСтрокиТоваровЧека;

	//	Реквизиты «адрес оператора перевода» (тег 1005), «ИНН оператора перевода» (тег 1016), «наименование оператора перевода» (тег 1026), «операция
	// платежного агента» (тег 1044), «признак агента» (тег 1057), «телефон платежного агента» (тег 1073), «телефон оператора по приему платежей» (тег 1074),
	// «телефон оператора перевода» (тег 1075), «телефон поставщика» (тег 1171) включаются в состав кассового чека (БСО) в случае, если данные этих
	// реквизитов идентичны для каждого из реквизитов «предмет расчета» (тег 1059), входящего в состав кассового чека (БСО), который содержит сведения о
	// расчетах пользователя, являющегося платежным агентом (субагентом), банковским платежным агентом (субагентом).
	// Реквизиты «признак агента» (тег 1057), «телефон платежного агента» (тег 1073), «телефон оператора по приему платежей» (тег 1074) и «телефон
	// поставщика» (тег 1171) включаются в состав кассового чека (БСО), который содержит сведения о расчетах пользователя, являющегося платежным
	// агентом или платежным субагентом.
	// Реквизиты «адрес оператора перевода» (тег 1005), «ИНН оператора перевода» (тег 1016), «наименование оператора перевода» (тег 1026), «операция
	// платежного агента» (тег 1044), «признак агента» (тег 1057), «телефон платежного агента» (тег 1073), «телефон оператора перевода» (тег 1075) и «телефон
	// поставщика» (тег 1171) включаются в состав кассового чека (БСО), который содержит сведения о расчетах пользователя, являющегося банковским
	// платежным агентом или банковским платежным субагентом.
	// Реквизит «признак агента» (тег 1057) включается в состав кассового чека (БСО), который содержит сведения о расчетах пользователя, являющегося
	// комиссионером, поверенным или иным агентом.
	
КонецФункции

// Функция - Пустая структура строки платежа чека
// 
// Возвращаемое значение:
//   - 
//
Функция ПустаяСтруктураСтрокиПлатежаЧека() Экспорт
	
	ПараметрыТипаОплаты = Новый Структура;
	ПараметрыТипаОплаты.Вставить("ТипОплаты");
	ПараметрыТипаОплаты.Вставить("Сумма");

	Возврат ПараметрыТипаОплаты;
	
КонецФункции

// Функция, выполняет формирование общих параметров для пробития чека. 
//
Функция ПолучитьОбщиеПараметрыПробитияЧека(ПараметрыЧека) Экспорт
	
	ОбщиеПараметры = МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека();
	
	Если Не ЗначениеЗаполнено(ПараметрыЧека.Сотрудник) Тогда
		ПараметрыЧека.Сотрудник = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Наименование");
	СтруктураРеквизитов.Вставить("ИНН");
	СтруктураРеквизитов.Вставить("КПП");
	РеквизитыОрганизация = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыЧека.Организация, СтруктураРеквизитов);
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ЭлектронныйЧекSMSПередаютсяПрограммой1С");
	СтруктураРеквизитов.Вставить("ЭлектронныйЧекEmailПередаютсяПрограммой1С");
	СтруктураРеквизитов.Вставить("ККМНомерПроизводителя");
	РеквизитыКассыККМ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыЧека.Касса, СтруктураРеквизитов);	
	
	ОбщиеПараметры.ТипРасчета = МенеджерОборудованияКлиентСервер.ПолучитьТипРасчетаДенежнымиСредствами(ПараметрыЧека.ТипЧека); //?(ПараметрыЧека.ТипЧека = 0, Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств, Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств); // 0 - продажа, 1 - возврат

	ОбщиеПараметры.Электронно = Ложь;    
	
	ДанныеКассира = ОбщегоНазначенияСтоматология.ПолучитьКассира(ПараметрыЧека.Касса, ПараметрыЧека.Сотрудник);  
	ОбщиеПараметры.Вставить("ИмяКассира", ДанныеКассира.Наименование);
	ОбщиеПараметры.КассирИНН 		   = ДанныеКассира.ИНН; 	
	ОбщиеПараметры.Кассир 			   = ДанныеКассира.Наименование;
	
	ОбщиеПараметры.Организация		   = ПараметрыЧека.Организация; 
	ОбщиеПараметры.ОрганизацияНазвание = РеквизитыОрганизация.Наименование;
	ОбщиеПараметры.ОрганизацияИНН      = РеквизитыОрганизация.ИНН;
	ОбщиеПараметры.ОрганизацияКПП      = РеквизитыОрганизация.КПП;
	ОбщиеПараметры.НомерКассы          = "00001";
	ОбщиеПараметры.НомерЧека           = "1";
	ОбщиеПараметры.НомерСмены          = "1";

	СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ПараметрыЧека.Организация, ПараметрыЧека.Дата);
	АдресМагазина         = ФормированиеПечатныхФорм.ПолучитьАдресИзКонтактнойИнформации(ПараметрыЧека.СтруктурнаяЕдиница, "Фактический");
		
	СерийныйНомер = РеквизитыКассыККМ.ККМНомерПроизводителя;
	Если НЕ ЗначениеЗаполнено(СерийныйНомер) Тогда
		СерийныйНомер = "1";
	КонецЕсли;
	
	ОбщиеПараметры.АдресМагазина        = АдресМагазина;
	ОбщиеПараметры.НаименованиеМагазина = Строка(ПараметрыЧека.СтруктурнаяЕдиница);
	ОбщиеПараметры.СерийныйНомер        = СерийныйНомер;
	ОбщиеПараметры.Вставить("КодСистемыНалогообложения", 0);
	
	Если ПараметрыЧека.Свойство("ВидНалога") Тогда
		ОбщиеПараметры.КодСистемыНалогообложения = МенеджерОборудованияВызовСервера.КодСистемыНалогообложения(ПараметрыЧека.Организация, ПараметрыЧека.ВидНалога); 		
		ОбщиеПараметры.СистемаНалогообложения    = ПараметрыЧека.ВидНалога;
	КонецЕсли;
	
	ОбщиеПараметры.Вставить("ВидОперации"  , ПараметрыЧека.ВидОперации);
	ОбщиеПараметры.Вставить("СуммаКОплате" , ПараметрыЧека.СуммаКОплате);
	ОбщиеПараметры.Вставить("СуммаОплачено", ПараметрыЧека.СуммаОплачено);
	ОбщиеПараметры.Вставить("Касса"        , ПараметрыЧека.Касса);
	
	ОбщиеПараметры.Электронно      = ПараметрыЧека.ВыводитьЧекНаБумагу <> Истина;
    ОбщиеПараметры.ПокупательEmail = ПараметрыЧека.ЭлектроннаяПочтаКлиента;	
	ОбщиеПараметры.ПокупательНомер = ПараметрыЧека.НомерТелефонаКлиента;
	
	ОбщиеПараметры.Вставить("Контрагент", ?(ПараметрыЧека.Свойство("Клиент"), ПараметрыЧека.Клиент, ""));
	
	ЗаполнитьДанныеПокупателя(ОбщиеПараметры, ПараметрыЧека); // теги 1227 и 1228.
	
	Если ОбщиеПараметры.Свойство("ДокументОснование") И ПараметрыЧека.Свойство("МассивДокументовОснований") Тогда
		ОбщиеПараметры.ДокументОснование = ПараметрыЧека.МассивДокументовОснований;         
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка указания документов основания при пробитии чека");
	КонецЕсли; 
	
	Если ПараметрыЧека.Свойство("ДополнительныйРеквизит") Тогда
		ОбщиеПараметры.ДополнительныйРеквизит = ПараметрыЧека.ДополнительныйРеквизит;	
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура(ОбщиеПараметры);
	
КонецФункции

// Процедура - заполняет данные покупателя (теги 1227 и 1228).
//
Процедура ЗаполнитьДанныеПокупателя(ОбщиеПараметры, ПараметрыЧека)
	
	// В соответствии с подп. «д» п. 15 ст. 1 Закона от 03.07.2018 № 192-ФЗ (ССЫЛКА) в положениях ст. 4.7 Закона № 54-ФЗ (ССЫЛКА) появится новый пункт 6.1:
	// «6.1. Кассовый чек или бланк строгой отчетности, сформированные при осуществлении расчетов между организациями и (или) индивидуальными 
	// Предпринимателями с использованием наличных денег и (или) с предъявлением электронных средств платежа, наряду с реквизитами, указанными в пункте 1 
	// Настоящей статьи, должен содержать следующие реквизиты:
	// 1) наименование покупателя (клиента) (наименование организации, фамилия, имя, отчество (при наличии) индивидуального предпринимателя);
	// 2) идентификационный номер налогоплательщика покупателя (клиента);
	// 3) сведения о стране происхождения товара (при осуществлении расчетов за товар);
	// 4) сумма акциза (если применимо);
	// 5) регистрационный номер таможенной декларации (при осуществлении расчетов за товар) (если применимо).»
	// соответствии с которым в кассовом чеке (БСО), что формируется при расчетах между хозяйствующими субъектами (ИП, юрлицами) с помощью наличных или по карте, обязательно должны быть отражены следующие реквизиты (наряду с теми, что предусмотрены п. 1 ст. 4.7):
	// наименование покупателя или клиента (ФИО ИП);
	// ИНН покупателя или клиента;
	// данные о стране происхождения реализованного товара;
	// величина акциза (по подакцизному товару);
	// номер таможенной декларации (если она применяется в правоотношениях между покупателем и продавцом).
	
	Если ПараметрыЧека.Свойство("Клиент") 
		И ТипЗнч(ПараметрыЧека.Клиент) = Тип("СправочникСсылка.Контрагенты") 
		И ЗначениеЗаполнено(ПараметрыЧека.Клиент) Тогда
		
		РеквизитыПокупателя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
								ПараметрыЧека.Клиент,
								"НаименованиеПолное, ИНН, ТипКонтрагента");
		
		Если РеквизитыПокупателя.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты Тогда
			Возврат;											
		КонецЕсли;      		
		
		ДокументУдостоверяющийЛичность	= РегистрыСведений.ДокументыФизическихЛиц.ДокументУдостоверяющийЛичностьФизлица(ПараметрыЧека.Клиент);
		
		Если ЗначениеЗаполнено(ДокументУдостоверяющийЛичность) Тогда
			ДокументУдостоверяющийЛичность = " " + СокрЛП(ДокументУдостоверяющийЛичность);
		КонецЕсли;
		
		ОбщиеПараметры.Вставить("Получатель"	, РеквизитыПокупателя.НаименованиеПолное + ДокументУдостоверяющийЛичность);
		ОбщиеПараметры.Вставить("ПолучательИНН"	, РеквизитыПокупателя.ИНН);
		
	КонецЕсли;  
	
КонецПроцедуры

// Функция, выполняет формирование общих параметров для пробития чека. 
//
Функция ПолучитьОбщиеПараметрыПробитияЧекаКоррекции(ПараметрыЧека) Экспорт
	
	ОбщиеПараметры = МенеджерОборудованияКлиентСервер.ПараметрыОперацииЧекаКоррекции();
	
	ОбщиеПараметрыЧека = Новый Структура(ПолучитьОбщиеПараметрыПробитияЧека(ПараметрыЧека));
	// ЗаполнитьЗначенияСвойств(ОбщиеПараметры, ОбщиеПараметрыЧека);
	// надо добавлять, т.к. ряд свойств добавляется в функции ПолучитьОбщиеПараметрыПробитияЧека.
	Для Каждого ЭлементСтруктуры Из ОбщиеПараметрыЧека Цикл
		Если Не ОбщиеПараметры.Свойство(ЭлементСтруктуры.Ключ) Тогда
			 ОбщиеПараметры.Вставить(ЭлементСтруктуры.Ключ);
		 КонецЕсли;
		 ОбщиеПараметры[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ОбщиеПараметры, ПараметрыЧека, "СформироватьЧекКоррекции, НеприменениеККТ, КорректируемыйДокумент"); 
	ЗаполнитьЗначенияСвойств(ОбщиеПараметры.ДанныеКоррекции, ПараметрыЧека.ДанныеКоррекции); 
		
	Возврат Новый ФиксированнаяСтруктура(ОбщиеПараметры);
	
КонецФункции  

// Процедура, добавляет товары в общие параметры чека.
//
Процедура ДобавитьТоварыВОбщиеПараметрыЧека(ОбщиеПараметры, МассивТоваров)
	
	ИспользоватьСтаруюСистемуФормированияДляФРдляККТ = Справочники.Кассы.ИспользоватьСтаруюСистемуФормированияДляФРдляККТ(ОбщиеПараметры.Касса);
		    	
	Для Каждого СтрокаМ ИЗ МассивТоваров Цикл		
		
		Цена = СтрокаМ.СтоимостьБезСкидки / СтрокаМ.Количество;		
		
		СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 	
		
		СтрокаПозицииЧека.Вставить("Номенклатура", СтрокаМ.Номенклатура);
		СтрокаПозицииЧека.Наименование     = СтрокаМ.Наименование;
		СтрокаПозицииЧека.Количество       = СтрокаМ.Количество;
		СтрокаПозицииЧека.Цена             = Цена;		
		// СтрокаПозицииЧека.Сумма            = СтрокаМ.СтоимостьСоСкидкой;
		СтрокаПозицииЧека.Сумма            = СтрокаМ.СтоимостьСоСкидкой  
												+ ?((СтрокаМ.Свойство("СуммаВключаетНДС") и СтрокаМ.СуммаВключаетНДС) 
														Или НЕ СтрокаМ.Свойство("СуммаВключаетНДС"), 0, СтрокаМ.СуммаНДС);
		СтрокаПозицииЧека.ЦенаСоСкидками   = Окр(СтрокаПозицииЧека.Сумма / СтрокаПозицииЧека.Количество, 2, 1); // - ?((СтрокаМ.Свойство("СуммаВключаетНДС") и СтрокаМ.СуммаВключаетНДС) или НЕ СтрокаМ.Свойство("СуммаВключаетНДС"), 0, СтрокаМ.СуммаНДС);
		СтрокаПозицииЧека.СуммаСкидок      = СтрокаМ.СуммаСкидки;
		СтрокаПозицииЧека.НомерСекции      = СтрокаМ.НомерСекции;		
		
		Если ОбщиеПараметры.Касса.ВнешнееОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ Тогда
			СтрокаПозицииЧека.СтавкаНДС        = ПолучитьСтавкуНДСККТ(СтрокаМ.СтавкаНДС); 
		Иначе
			СтрокаПозицииЧека.СтавкаНДС        = ПолучитьСтавкуНДСККТ(СтрокаМ.СтавкаНДС);// СтрокаМ.СтавкаНДС.Ставка;  // возможно необходимо умножать на 100
		КонецЕсли;
		
		СтрокаПозицииЧека.СуммаНДС         = СтрокаМ.СуммаНДС;
		СтрокаПозицииЧека.Штрихкод         = СтрокаМ.Штрихкод;	
		СтрокаПозицииЧека.Вставить("ЭтоОплатаКредита", СтрокаМ.ЭтоОплатаКредита);
		
		СтрокаПозицииЧека.ПризнакАгентаПоПредметуРасчета		= СтрокаМ.ПризнакАгентаПоПредметуРасчета; 
		// СтрокаПозицииЧека.ДанныеАгента.ПлатежныйАгент.Телефон 	= СтрокаМ.ДанныеПоставщика.Телефон;
		СтрокаПозицииЧека.ДанныеПоставщика.ИНН					= СтрокаМ.ДанныеПоставщика.ИНН;		
		СтрокаПозицииЧека.ДанныеПоставщика.Наименование 		= СтрокаМ.ДанныеПоставщика.Наименование;
		СтрокаПозицииЧека.ДанныеПоставщика.Телефон				= СтрокаМ.ДанныеПоставщика.Телефон;
		
		СтрокаПозицииЧека.СуммаВключаетНДС						= СтрокаМ.СуммаВключаетНДС;
		
		Если СтрокаПозицииЧека.Свойство("ДанныеКодаТоварнойНоменклатуры") И СтрокаМ.Свойство("ДанныеКодаТоварнойНоменклатуры") Тогда
			ЗаполнитьЗначенияСвойств(СтрокаПозицииЧека.ДанныеКодаТоварнойНоменклатуры, СтрокаМ.ДанныеКодаТоварнойНоменклатуры); 
		КонецЕсли;
		
		Если Не ИспользоватьСтаруюСистемуФормированияДляФРдляККТ Тогда
			
			Если (ОбщиеПараметры.ВидОперации = Перечисления.ВидыОпераций.Продажа
				ИЛИ ОбщиеПараметры.ВидОперации = Перечисления.ВидыОпераций.Возврат
				ИЛИ ОбщиеПараметры.ВидОперации = Перечисления.ВидыОпераций.ВозвратОшибочнойОплатыКлиенту) Тогда
				
				СтрокаПозицииЧека.ПризнакПредметаРасчета = ПризнакПредметаРасчетаПриПродажеИлиВозврате(
																СтрокаПозицииЧека.Номенклатура, 
																СтрокаПозицииЧека.ЭтоОплатаКредита); 
				
												
				Если ЗначениеЗаполнено(СтрокаМ.Номенклатура) 
					И ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаМ.Номенклатура, "ТипНоменклатуры") = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат Тогда
					
					СтрокаПозицииЧека.ПризнакСпособаРасчета  = ПризнакСпособаРасчетаПриПродажеИлиВозвратеСертификата();
					
				Иначе
					
					Если ОбщиеПараметры.ВидОперации = Перечисления.ВидыОпераций.Продажа
						Или ОбщиеПараметры.ВидОперации = Перечисления.ВидыОпераций.ВозвратОшибочнойОплатыКлиенту Тогда
						
						СтрокаПозицииЧека.ПризнакСпособаРасчета  = ПризнакСпособаРасчетаПриПродажеИлиВозвратеУслугиТовара(
																		СтрокаМ.СтоимостьСоСкидкой, 
																		СтрокаМ.СуммаОплачено, 
																		СтрокаПозицииЧека.ЭтоОплатаКредита); 
						
					Иначе
						
						СтрокаПозицииЧека.ПризнакСпособаРасчета  = ПризнакСпособаРасчетаПриПродажеИлиВозвратеУслугиТовара(
																		ОбщиеПараметры.СуммаКОплате, 
																		ОбщиеПараметры.СуммаОплачено, 
																		Ложь); 
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаМ.Номенклатура)
					И (СтрокаМ.Наименование = МенеджерОборудованияВызовСервера.ПолучитьСловоСУчетомЯзыка("Взнос на лицевой счет") 
					Или СтрНайти(СтрокаМ.Наименование, МенеджерОборудованияВызовСервера.ПолучитьСловоСУчетомЯзыка("Аванс от:")) <> 0)  Тогда
					
					СтрокаПозицииЧека.ПризнакПредметаРасчета = ПризнакПредметаРасчетаПриВзносеНаЛицевойСчетИлиВозврате();
					СтрокаПозицииЧека.ПризнакСпособаРасчета  = ПризнакСпособаРасчетаПриВзносееНаЛицевойСчетИлиВозврате();
					
				КонецЕсли;
				
			ИначеЕсли ОбщиеПараметры.ВидОперации = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет
				ИЛИ ОбщиеПараметры.ВидОперации = Перечисления.ВидыОпераций.ВозвратСЛицевогоСчета Тогда
				
				СтрокаПозицииЧека.ПризнакПредметаРасчета = ПризнакПредметаРасчетаПриВзносеНаЛицевойСчетИлиВозврате();
				СтрокаПозицииЧека.ПризнакСпособаРасчета  = ПризнакСпособаРасчетаПриВзносееНаЛицевойСчетИлиВозврате();
				
			// ИначеЕсли ОбщиеПараметры.ВидОперации = Перечисления.ВидыОпераций.ЗачетАванса Тогда
			//	
			//	СтрокаПозицииЧека.ПризнакСпособаРасчета  = ?(ЗначениеЗаполнено(СтрокаМ.ПризнакСпособаРасчета) , СтрокаМ.ПризнакСпособаРасчета, Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой);
			//	СтрокаПозицииЧека.ПризнакПредметаРасчета = ?(ЗначениеЗаполнено(СтрокаМ.ПризнакПредметаРасчета),СтрокаМ.ПризнакПредметаРасчета,Перечисления.ПризнакиПредметаРасчета.Услуга);
				
			КонецЕсли;
			
		// ИначеЕсли ЗначениеЗаполнено(СтрокаМ.ПризнакПредметаРасчета) И ЗначениеЗаполнено(СтрокаМ.ПризнакСпособаРасчета) Тогда
		//	// в чеке коррекции сами указывают.
		//	 СтрокаПозицииЧека.ПризнакПредметаРасчета	= СтрокаМ.ПризнакПредметаРасчета;
		//	 СтрокаПозицииЧека.ПризнакСпособаРасчета	= СтрокаМ.ПризнакСпособаРасчета;
		КонецЕсли;

		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
		
	КонецЦикла;	
	
КонецПроцедуры

// Процедура, добавляет оплаты в общие параметры чека.
//
Процедура ДобавитьОплатуВОбщиеПараметрыЧека(ОбщиеПараметры, МассивОплат)
	
	ЭтоККТ = ОбщиеПараметры.Касса.ВнешнееОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
    ИспользоватьСтаруюСистемуФормированияДляФРдляККТ = Справочники.Кассы.ИспользоватьСтаруюСистемуФормированияДляФРдляККТ(ОбщиеПараметры.Касса);
	
	Для Каждого СтрокаМ ИЗ МассивОплат Цикл
		
		ТипОплаты     = Неопределено;
		ОплатаСумма   = СтрокаМ.Сумма;
		ТипОплаты     = ПолучитьТипОплатыПоТипуДенежныхСредств(ЭтоККТ, СтрокаМ.ТипОплаты);		
		
		СтрокаОплаты = Новый Структура();
		СтрокаОплаты.Вставить("ТипОплаты", ТипОплаты);
		СтрокаОплаты.Вставить("Сумма"    , ОплатаСумма);
		
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);			
		
	КонецЦикла;
	
	// При не полной оплате добавляем строку постоплаты(долг, рассрочка, кредит)
	Если ЭтоККТ = Истина 
		И ИспользоватьСтаруюСистемуФормированияДляФРдляККТ = Ложь
		И ОбщиеПараметры.СуммаКОплате > ОбщиеПараметры.СуммаОплачено Тогда
		
		СтрокаОплаты = Новый Структура();
		СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Постоплата);
		СтрокаОплаты.Вставить("Сумма"    , ОбщиеПараметры.СуммаКОплате - ОбщиеПараметры.СуммаОплачено);
		
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);	
		
	КонецЕсли;
	
КонецПроцедуры

// Функция, формирует таблицы товаров и оплат.
//
Функция СформироватьТаблицыТоваровИОплат(ПараметрыЧека, ОписаниеОшибки)
	
	ПроизошлоИсключение = Ложь;
	СуммаЧекаБезСкидок  = 0;
	СуммаЧекаСоСкидками = 0;
	Счетчик             = 1;
	ТаблицаТовары       = Новый Массив;
	
	///////////////// ПОДГОТОВКА МАССИВА ПАРАМЕТРОВ ТОВАРОВ ///////////////////////	
	
	// Если передана таблица товаров значения берутся из нее
	Если ПараметрыЧека.Свойство("МассивПараметровТовары")
		И ЗначениеЗаполнено(ПараметрыЧека.МассивПараметровТовары) Тогда
		
		// Заполнение массива параметров товаров
		Для Каждого СтрокаМ ИЗ ПараметрыЧека.МассивПараметровТовары Цикл
			
			Если СтрокаМ.СтоимостьБезСкидки = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыТовара  = ПустаяСтруктураСтрокиТоваровЧека();
			
			ЗаполнитьЗначенияСвойств(ПараметрыТовара, СтрокаМ);
			
			ПараметрыТовара.Наименование       = ?(СтрокаМ.Свойство("Наименование")      , СтрокаМ.Наименование,"Позиция №" + Счетчик);		
			ПараметрыТовара.НомерСекции        = ?(СтрокаМ.Свойство("НомерСекции")       , СтрокаМ.НомерСекции, 1);
			ПараметрыТовара.СтоимостьБезСкидки = ?(СтрокаМ.Свойство("СтоимостьБезСкидки"), СтрокаМ.СтоимостьБезСкидки,0);
			ПараметрыТовара.СуммаСкидки        = ?(СтрокаМ.Свойство("СуммаСкидки")       , СтрокаМ.СуммаСкидки,0);
			ПараметрыТовара.Количество         = ?(СтрокаМ.Свойство("Количество")        , СтрокаМ.Количество,0);
			ПараметрыТовара.СтавкаНДС          = ?(СтрокаМ.Свойство("СтавкаНДС")         , СтрокаМ.СтавкаНДС, ПараметрыЧека.Организация.СтавкаНДС);
			ПараметрыТовара.Штрихкод           = ?(СтрокаМ.Свойство("Штрихкод")          , СтрокаМ.Штрихкод, Null);  
			
			Счетчик = Счетчик + 1;
			ТаблицаТовары.Добавить(ПараметрыТовара);
			
		КонецЦикла;		  
		 
	// Если переданы одничные параметры товара
	Иначе
		
		ПараметрыТовара = ПустаяСтруктураСтрокиТоваровЧека();
				
		ПараметрыТовара.Наименование       = ?(ПараметрыЧека.Свойство("Наименование")      , ПараметрыЧека.Наименование,"Позиция №1");
		ПараметрыТовара.НомерСекции        = ?(ПараметрыЧека.Свойство("НомерСекции")       , ПараметрыЧека.НомерСекции, 1);
        ПараметрыТовара.СтоимостьБезСкидки = ?(ПараметрыЧека.Свойство("СтоимостьБезСкидки") И ЗначениеЗаполнено(ПараметрыЧека.СтоимостьБезСкидки), ПараметрыЧека.СтоимостьБезСкидки, 0);
		// Если НЕ ЗначениеЗаполнено(ПараметрыТовара.СтоимостьБезСкидки) Тогда
		//	ПараметрыТовара.СтоимостьБезСкидки = ПараметрыЧека.СуммаКОплате;
		// КонецЕсли;
		
		ПараметрыТовара.СуммаСкидки        = ?(ПараметрыЧека.Свойство("СуммаСкидки")       , ПараметрыЧека.СуммаСкидки, 0);
		ПараметрыТовара.Количество         = ?(ПараметрыЧека.Свойство("Количество")        , ПараметрыЧека.Количество,0);
		ПараметрыТовара.СтавкаНДС          = ?(ПараметрыЧека.Свойство("СтавкаНДС")         , ПараметрыЧека.СтавкаНДС, ПараметрыЧека.Организация.СтавкаНДС);
		ПараметрыТовара.Штрихкод           = ?(ПараметрыЧека.Свойство("Штрихкод")          , ПараметрыЧека.Штрихкод, Null);
		ПараметрыТовара.СуммаНДС           = Ценообразование.РассчитатьСуммуНДС(
												?(ПараметрыЧека.Свойство("СтоимостьСоСкидкой"), ПараметрыЧека.СтоимостьСоСкидкой, ПараметрыТовара.СтоимостьБезСкидки), 
												ПараметрыТовара.СтавкаНДС);
		
		ТаблицаТовары.Добавить(ПараметрыТовара);

	КонецЕсли;

	// Подготовка таблицы товароа и проверка правильности заполнения	
	Счетчик = 1;
	Для Каждого СтрокаМ ИЗ ТаблицаТовары Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаМ.Наименование) Тогда
			 СтрокаМ.Наименование = "Позиция №" + Счетчик;
		КонецЕсли;
		
		// Обработка исключительных ситуаций
		Если НЕ ЗначениеЗаполнено(СтрокаМ.СтоимостьБезСкидки) Тогда
			
			ОписаниеОшибки      = НСтр("ru= 'Не указана стоимость для позиции: ';en= 'No value for position: '") + СтрокаМ.Наименование;
			ПроизошлоИсключение = Истина;
			Прервать;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаМ.Количество) Тогда
			
			ОписаниеОшибки      = НСтр("ru= 'Не указано количество для позиции: ';en= 'Not specified quantity for item: '") + СтрокаМ.Наименование;
			ПроизошлоИсключение = Истина;
			Прервать;
			
		КонецЕсли;
		
		// Расчет процента скидки
		Если ЗначениеЗаполнено(СтрокаМ.СуммаСкидки) Тогда		
			
			СтрокаМ.СтоимостьСоСкидкой = СтрокаМ.СтоимостьБезСкидки - СтрокаМ.СуммаСкидки; 
			СтрокаМ.ПроцентСкидки      = (СтрокаМ.СуммаСкидки / СтрокаМ.СтоимостьБезСкидки) % 10;
			
		Иначе
			
			СтрокаМ.СтоимостьСоСкидкой = СтрокаМ.СтоимостьБезСкидки;
			СтрокаМ.ПроцентСкидки      = 0;
			
		КонецЕсли;
		
		// Подсчет суммы чека
		СуммаЧекаБезСкидок   = СуммаЧекаБезСкидок  +  СтрокаМ.СтоимостьБезСкидки; //(СтрокаМ.Количество *
		СуммаЧекаСоСкидками  = СуммаЧекаСоСкидками +  СтрокаМ.СтоимостьСоСкидкой + ?(СтрокаМ.СуммаВключаетНДС, 0, СтрокаМ.СуммаНДС); //(СтрокаМ.Количество * 
		Счетчик              = Счетчик + 1;
		
	КонецЦикла;
	
	Если ПараметрыЧека.Свойство("МассивПараметровТовары") Тогда
		ПараметрыЧека.МассивПараметровТовары = ТаблицаТовары;
	Иначе
		ПараметрыЧека.Вставить("МассивПараметровТовары",ТаблицаТовары);
	КонецЕсли;
	
    ///////////////// ПОДГОТОВКА МАССИВА ПАРАМЕТРОВ ОПЛАТЫ ///////////////////////	
	
	// Подготовка таблицы оплат. Группировка и суммирование одинаковых типов
	Если ПараметрыЧека.Свойство("МассивПараметровОплаты")
		И ЗначениеЗаполнено(ПараметрыЧека.МассивПараметровОплаты) Тогда
		
		МассивДанных = ПараметрыЧека.МассивПараметровОплаты;
		Для А = 0 По МассивДанных.Количество() - 2 Цикл
						
			Счетчик = А + 1;
			Пока  Счетчик <= МассивДанных.Количество() - 1 Цикл
				Если МассивДанных[А].ТипОплаты = МассивДанных[Счетчик].ТипОплаты Тогда
					МассивДанных[А].Сумма =  МассивДанных[А].Сумма +  МассивДанных[Счетчик].Сумма;
					МассивДанных.Удалить(Счетчик);
				Иначе
					Счетчик = Счетчик + 1;
				КонецЕсли;	 
			КонецЦикла;
		КонецЦикла;
		
	Иначе // Если не указан массив параметров оплаты создаем его
		
		Если НЕ ПараметрыЧека.Свойство("ТипОплаты") Тогда
			
			ОписаниеОшибки      = НСтр("ru= 'В параметрах переданных для печати чека не указан тип денежных средств.';en= 'In the parameters of the check sent for printing, the type of funds is not indicated.'");
			ПроизошлоИсключение = Истина;
			
		ИначеЕсли ЗначениеЗаполнено(ПараметрыЧека.ТипОплаты) Тогда
			
			ПараметрыОплаты = Новый Структура; 
			ПараметрыОплаты.Вставить("ТипОплаты", ПараметрыЧека.ТипОплаты);
			ПараметрыОплаты.Вставить("Сумма"    , СуммаЧекаСоСкидками);
			
			МассивПараметровОплаты = Новый Массив;
			МассивПараметровОплаты.Добавить(ПараметрыОплаты);
			
			ПараметрыЧека.Вставить("МассивПараметровОплаты", МассивПараметровОплаты);
			
		Иначе
			
			ПараметрыЧека.Вставить("МассивПараметровОплаты", Новый Массив);
			
		КонецЕсли;
		
	КонецЕсли;	
	
	 ///////////////// ЗАВЕРШЕНИЕ ОПЕРАЦИИ ПОДГОТОВКИ ///////////////////////	
	
	// Операция подготовки проведена успешно
	Если НЕ ПроизошлоИсключение Тогда
				
		ПараметрыЧека.Вставить("СуммаЧекаБезСкидок" ,СуммаЧекаБезСкидок);
		ПараметрыЧека.Вставить("СуммаЧекаСоСкидками",СуммаЧекаСоСкидками);
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// Функция - Подготовить данные для пробития фискального чека
//
// Параметры:
//  ПараметрыЧека	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПодготовитьДанныеДляПробитияФискальногоЧекаККТ(ПараметрыЧека) Экспорт
	
	РезультатОперации  = Новый Структура("Результат, ОписаниеОшибки", Истина, Неопределено);
	
	Попытка
		
		Касса				= ?(ПараметрыЧека.Свойство("Касса"), ПараметрыЧека.Касса, Неопределено);
		ПроизошлоИсключение	= Ложь;
		
		Если Касса = Неопределено Тогда
			
			РезультатОперации.Результат      = Ложь;
			РезультатОперации.ОписаниеОшибки = НСтр("ru = 'Для данной операции необходимо указать кассу!'; en = 'For this operation, you must specify the cashbox!'");
			Возврат РезультатОперации;		
			
		КонецЕсли;
		
		// Если в кассе не используется оборудование отменить операцию.
		Если Касса.ИспользоватьБезПодключенияОборудования Тогда
			
			РезультатОперации.Результат      = Ложь;
			РезультатОперации.ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Касса: %1 используется без подключения оборудования!';en= 'Cashbox: %1 is used without connecting equipment!'"), Касса);
			Возврат РезультатОперации;
			
		КонецЕсли;		
		
		// Если ПараметрыЧека.ВыводитьЧекНаБумагу <> Истина
		//	И НЕ ЗначениеЗаполнено(ПараметрыЧека.ЭлектроннаяПочтаКлиента)
		//	И НЕ ЗначениеЗаполнено(ПараметрыЧека.НомерТелефонаКлиента) Тогда
		//	
		//	РезультатОперации.Результат      = Ложь;
		//	РезультатОперации.ОписаниеОшибки = "Необходимо выбрать хотя бы один из методов вывода чека ККТ. На бумагу, эл. почту или телефон клиента";
		//	Возврат РезультатОперации;
		
		// КонецЕсли;
		
		// Предварительная подготовка товаров и оплат.
		ОписаниеОшибки = "";
		Если СформироватьТаблицыТоваровИОплат(ПараметрыЧека, ОписаниеОшибки) = Ложь Тогда
			
			РезультатОперации.Результат      = Ложь;
			РезультатОперации.ОписаниеОшибки = ОписаниеОшибки;
			Возврат РезультатОперации;
			
		КонецЕсли;
		
		// Получаем общие параметры для пробития чека на ФР (ФИКСИРОВАННАЯ СТРУКТУРА).
		ОбщиеПараметры = ПолучитьОбщиеПараметрыПробитияЧека(ПараметрыЧека);  	
		
		// Копируем основные параметры чека.
		ФискальныйЧек = Новый Структура(ОбщиеПараметры);
		ФискальныйЧек.ПозицииЧека  = Новый Массив;
		ФискальныйЧек.ТаблицаОплат = Новый Массив;
		
		ДобавитьТоварыВОбщиеПараметрыЧека(ФискальныйЧек, ПараметрыЧека.МассивПараметровТовары);
		ДобавитьОплатуВОбщиеПараметрыЧека(ФискальныйЧек, ПараметрыЧека.МассивПараметровОплаты);		
		
		// При необходимости будет проведен формато-логический контроль
		Если ЗначениеЗаполнено(ФискальныйЧек.Касса.ВнешнееОборудование) Тогда 
			РеквизитыОборудования  = ФорматноЛогическийКонтрольВызовСервера.СтруктураДанныхФорматноЛогическогоКонтроля(ФискальныйЧек.Касса.ВнешнееОборудование);
			ФискальныйЧек.СпособФорматноЛогическогоКонтроля				= РеквизитыОборудования.СпособФорматноЛогическогоКонтроля;
			ФискальныйЧек.ДопустимоеРасхождениеФорматноЛогическогоКонтроля = РеквизитыОборудования.ДопустимоеРасхождениеФорматноЛогическогоКонтроля;
		Иначе
			ФискальныйЧек.СпособФорматноЛогическогоКонтроля = Перечисления.СпособыФорматноЛогическогоКонтроля.РазделятьСтроки;
		КонецЕсли;
		
		ФорматноЛогическийКонтрольКлиентСервер.ПровестиФорматноЛогическийКонтроль(ФискальныйЧек, ФискальныйЧек.Касса.ВнешнееОборудование);
		
		// ФискальныйЧек.СпособФорматоЛогическогоКонтроля = ФискальныйЧек.Касса.ВнешнееОборудование.СпособФорматоЛогическогоКонтроля;
		// ФискальныйЧек.ДопустимоеРасхождениеФорматоЛогическогоКонтроля = ФискальныйЧек.Касса.ВнешнееОборудование.ДопустимоеРасхождениеФорматоЛогическогоКонтроля;
		// Если МенеджерОборудованияКлиентСервер.НуженФорматоЛогическийКонтроль(ФискальныйЧек) Тогда
		//	МенеджерОборудованияКлиентСервер.ПровестиФорматоЛогическийКонтроль(ФискальныйЧек);
		// КонецЕсли; 
		
		РезультатОперации.Вставить("ФискальныйЧек", ФискальныйЧек);
		
	Исключение
		ОписаниеОшибки				= ОписаниеОшибки();
		СтрокаДокументовОснований	= "";
		Если ПараметрыЧека.Свойство("МассивДокументовОснований") Тогда
			Для Каждого ЭлементМ Из ПараметрыЧека.МассивДокументовОснований Цикл
				СтрокаДокументовОснований = СтрокаДокументовОснований + ?(ЗначениеЗаполнено(СтрокаДокументовОснований), ", ", "") + ЭлементМ;
			КонецЦикла;
		КонецЕсли;
		СтрокаТоваров = "";
		Если ПараметрыЧека.Свойство("МассивПараметровТовары") Тогда
			Если ЗначениеЗаполнено(ПараметрыЧека.МассивПараметровТовары) Тогда
				Для Каждого ЭлементМ Из ПараметрыЧека.МассивПараметровТовары Цикл
					СтрокаТоваров = СтрокаТоваров +
										?(ЗначениеЗаполнено(СтрокаТоваров), ", ", "") +
										?(ЭлементМ.Свойство("Наименование"), ЭлементМ.Наименование, "<не указано>");
				КонецЦикла;
			Иначе
				СтрокаТоваров = "<не указано>";
			КонецЕсли;
		КонецЕсли;
		
		ТекстСообщения = СтрШаблон("Ошибка формирования параметров чека для документов оплаты: %1. Список товаров: %2. Описание ошибки %3",
							СтрокаДокументовОснований, СтрокаТоваров, ОписаниеОшибки);
		ЗаписьЖурналаРегистрации("Ошибка пробития чека ККМ", УровеньЖурналаРегистрации.Предупреждение,,, ТекстСообщения);
		
		РезультатОперации = Новый Структура("Результат, ОписаниеОшибки", Ложь, ТекстСообщения);
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Признак способа расчета при продаже
//
// Параметры:
//  СуммаКОплате	 - 	 - 
//  СуммаПлатежа	 - 	 - 
//  ЭтоОплатаКредита - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПризнакСпособаРасчетаПриПродажеИлиВозвратеУслугиТовара(СуммаКОплате, СуммаПлатежа, ЭтоОплатаКредита = Ложь)
	
	Если ЭтоОплатаКредита Тогда
		
		Возврат Перечисления.ПризнакиСпособаРасчета.ОплатаКредита;
		
	КонецЕсли;
	
	Если СуммаКОплате <= СуммаПлатежа Тогда
		
		Возврат Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
		
	ИначеЕсли СуммаПлатежа > 0 И СуммаПлатежа < СуммаКОплате Тогда
		
		Возврат Перечисления.ПризнакиСпособаРасчета.ПередачаСЧастичнойОплатой;
		
	ИначеЕсли СуммаПлатежа = 0 Тогда
		
		Возврат Перечисления.ПризнакиСпособаРасчета.ПередачаБезОплаты;
		
	КонецЕсли;
	
КонецФункции

// Функция - Признак предмета расчета при продаже
//
// Параметры:
//  Номенклатура - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПризнакПредметаРасчетаПриПродажеИлиВозврате(Номенклатура, ЭтоОплатаКредита = Ложь)
	
	ТипНоменклатуры = Неопределено;
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		ТипНоменклатуры = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Номенклатура, "ТипНоменклатуры"); 
	КонецЕсли;
	
	Если ЭтоОплатаКредита <> Истина
		И (ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга
		ИЛИ ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор) Тогда
		
		Возврат Перечисления.ПризнакиПредметаРасчета.Услуга;
		
	ИначеЕсли ЭтоОплатаКредита <> Истина
		И (ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас
		ИЛИ ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал) Тогда
		
		Возврат Перечисления.ПризнакиПредметаРасчета.Товар;

	ИначеЕсли ЭтоОплатаКредита = Истина 
		ИЛИ ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат Тогда
		
	    Возврат Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;

	КонецЕсли;
	
КонецФункции

// Функция - Признак способа расчета при взносе на лицевой счет
// 
// Возвращаемое значение:
//   - 
//
Функция ПризнакСпособаРасчетаПриВзносееНаЛицевойСчетИлиВозврате() 
		
	Возврат Перечисления.ПризнакиСпособаРасчета.Аванс;
			
КонецФункции

// Функция - Признак способа расчета при продаже или возврате сертификата.
// 
// Возвращаемое значение:
//   - 
//
Функция ПризнакСпособаРасчетаПриПродажеИлиВозвратеСертификата()
		
	Возврат Перечисления.ПризнакиСпособаРасчета.Аванс;
			
КонецФункции

// Функция - Признак предмета расчета при взносе на лицевой счет
// 
// Возвращаемое значение:
//   - 
//
Функция ПризнакПредметаРасчетаПриВзносеНаЛицевойСчетИлиВозврате() 
	
	Возврат Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
	
КонецФункции

// Функция - Получить НДСПри взносе на лицевой счет
//
// Параметры:
//  Организация	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьНДСПриВзносеНаЛицевойСчет(Организация) Экспорт
	
	Если ЗначениеЗаполнено(Организация.СистемаНалогообложенияДляАвансов) Тогда 
		
		Возврат ?(ЗначениеЗаполнено(Организация.СтавкаНДСДляАвансов), Организация.СтавкаНДСДляАвансов, Перечисления.СтавкиНДС.БезНДС);
		
	ИначеЕсли Организация.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая
		И ЗначениеЗаполнено(Организация.СтавкаНДС) Тогда
		
		Возврат Организация.СтавкаНДС;
		
	Иначе
		Возврат Перечисления.СтавкиНДС.БезНДС;
		
	КонецЕсли;
		
КонецФункции

// Функция - Код системы налогообложения
//
// Параметры:
//  Организация	 - 	 - 
//  ВидНалога	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция КодСистемыНалогообложения(Организация, ВидНалога) Экспорт
	
	Если ТипЗнч(ВидНалога) = Тип("ПеречислениеСсылка.ВидыНалогов") Тогда
		
		Если Организация = Неопределено Тогда
			Организация = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.Организация;
		КонецЕсли;
		
		Если ВидНалога = Перечисления.ВидыНалогов.ОСН Тогда		
			Возврат 0;
		ИначеЕсли ВидНалога = Перечисления.ВидыНалогов.УСНДоход Тогда
			Возврат 1;
		ИначеЕсли ВидНалога = Перечисления.ВидыНалогов.УСНДоходРасход Тогда
			Возврат 2;
		ИначеЕсли ВидНалога = Перечисления.ВидыНалогов.ЕНВД Тогда
			Возврат 3;
		ИначеЕсли ВидНалога = Перечисления.ВидыНалогов.ЕСХН Тогда
			Возврат 4;
		ИначеЕсли ВидНалога = Перечисления.ВидыНалогов.ПСН Тогда
			Возврат 5;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Организация.СистемаНалогообложенияДляТоваров) Тогда
			Возврат 0;
		Иначе
			Если Организация.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая Тогда
				Возврат 0;
			ИначеЕсли Организация.ОбъектНалогообложения = Перечисления.ОбъектыНалогообложенияПоУСН.Доходы Тогда
				Возврат 1;
			Иначе
				Возврат 2;
			КонецЕсли;	
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ВидНалога) = Тип("ПеречислениеСсылка.ТипыСистемНалогообложенияККТ") Тогда	
		
		Если ВидНалога = Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД Тогда
			Возврат 3;
		ИначеЕсли ВидНалога = Перечисления.ТипыСистемНалогообложенияККТ.ЕСН Тогда
			Возврат 4;
		ИначеЕсли ВидНалога = Перечисления.ТипыСистемНалогообложенияККТ.Патент Тогда
			Возврат 5;
		ИначеЕсли ВидНалога = Перечисления.ТипыСистемНалогообложенияККТ.ОСН Тогда
			Возврат 0;
		ИначеЕсли ВидНалога = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход Тогда
			Возврат 1;
		ИначеЕсли ВидНалога = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход Тогда
			Возврат 2;
		КонецЕсли;
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(Организация.СистемаНалогообложенияДляТоваров) Тогда
			Возврат 0;
		Иначе    
			Если Организация.СистемаНалогообложенияДляТоваров = Перечисления.ТипыСистемНалогообложенияККТ.ОСН Тогда
				Возврат 0;
			ИначеЕсли Организация.СистемаНалогообложенияДляТоваров = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход Тогда
				Возврат 1;
			ИначеЕсли Организация.СистемаНалогообложенияДляТоваров = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход Тогда
				Возврат 2;
			ИначеЕсли Организация.СистемаНалогообложенияДляТоваров = Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД Тогда
				Возврат 3;
			ИначеЕсли Организация.СистемаНалогообложенияДляТоваров = Перечисления.ТипыСистемНалогообложенияККТ.ЕСН Тогда
				Возврат 4;
			ИначеЕсли Организация.СистемаНалогообложенияДляТоваров = Перечисления.ТипыСистемНалогообложенияККТ.Патент Тогда
				Возврат 5;
			КонецЕсли;			
				
		КонецЕсли;

	КонецЕсли;
	
КонецФункции

// Функция, возвращает ставку НДС для ККТ.
//
Функция ПолучитьСтавкуНДСККТ(СтавкаНДС) Экспорт
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		Возврат 10;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда 		
		Возврат 18;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда 		
		Возврат 20;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
		Возврат 0;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		Возврат Неопределено;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;       
	
КонецФункции

// Функция - Получить тип оплаты по типу денежных средств
//
// Параметры:
//  ЭтоККТ			 - 	 - 
//  ТипДенСредств	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТипОплатыПоТипуДенежныхСредств(ЭтоККТ, ТипДенСредств) Экспорт
	
	Если ТипДенСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные") Тогда
		
		ТипОплаты = Перечисления.ТипыОплатыККТ.Наличные;			
		
	ИначеЕсли ТипДенСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ПлатежнаяКарта") 
		// ИЛИ ТипДенСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.КорпоративныйДоговор")
		ИЛИ ТипДенСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные") Тогда
		
		ТипОплаты = Перечисления.ТипыОплатыККТ.Электронно;			
		
	ИначеЕсли ТипДенСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ЛицевойСчет")
		ИЛИ ТипДенСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Аванс") 
		ИЛИ ТипДенСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ПодарочныйСертификат") Тогда
		
		ТипОплаты = Перечисления.ТипыОплатыККТ.Предоплата;
		
	ИначеЕсли ТипДенСредств = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата") Тогда
		
		ТипОплаты = Перечисления.ТипыОплатыККТ.Постоплата;
		
	ИначеЕсли ТипДенСредств = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.ВстречноеПредоставление") Тогда
		
		ТипОплаты = Перечисления.ТипыОплатыККТ.ВстречноеПредоставление;    
		
	ИначеЕсли ТипЗнч(ТипДенСредств) = Тип("ПеречислениеСсылка.ТипыОплатыККТ") Тогда
		
		ТипОплаты = ТипДенСредств;
		
	КонецЕсли;				
	
	Возврат ТипОплаты;
	
КонецФункции

// Функция, возвращает данные для пробития чека на ФР.
//
Функция ПодготовитьДанныеДляПробитияЧека(ПараметрыЧека) Экспорт
	
	РезультатОперации  = Новый Структура("Результат, ОписаниеОшибки", Истина, "");
	Касса              = ?(ПараметрыЧека.Свойство("Касса"), ПараметрыЧека.Касса, Неопределено);
		
	Если Касса = Неопределено Тогда		
		
		РезультатОперации.Результат      = Ложь;
		РезультатОперации.ОписаниеОшибки = НСтр("ru = 'Для данной операции необходимо указать кассу!'; en = 'For this operation, you must specify the cashbox!'");
		Возврат РезультатОперации;		
		
	КонецЕсли;
	
	// Если в кассе не используется оборудование отменить операцию.
	Если Касса.ИспользоватьБезПодключенияОборудования Тогда
		
		РезультатОперации.Результат      = Ложь;
		РезультатОперации.ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Касса: %1 используется без подключения оборудования!';en= 'Cashbox: %1 is used without connecting equipment!'"), Касса);
		Возврат РезультатОперации;
		
	КонецЕсли;	
	
	Если Касса.ВнешнееОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ Тогда
		
	     Возврат ПодготовитьДанныеДляПробитияФискальногоЧекаККТ(ПараметрыЧека);

	Иначе
		
		Возврат ПодготовитьДанныеДляПробитияФискальногоИНеФискальногоЧекаФР(ПараметрыЧека);		
		
	КонецЕсли;
			
КонецФункции

// Функция - Подготовить данные для пробития не фискального чека
//
// Параметры:
//  ПараметрыЧека	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПодготовитьДанныеДляПробитияНеФискальногоЧека(ПараметрыЧека) Экспорт
	
	РезультатОперации                  = Новый Структура("Результат, ОписаниеОшибки, Параметры", Истина, "", Новый Структура());
	
	ЧекТип                             = ?(ПараметрыЧека.Свойство("ТипЧека")	  , ПараметрыЧека.ТипЧека, 0); // 0 - приход, 1 - возврат
	Касса                              = ?(ПараметрыЧека.Свойство("Касса")        , ПараметрыЧека.Касса, Неопределено);
	
	МассивНефискальныхПараметровОплаты = Новый Массив;
	СуммаНЕФискальныхТиповОплат        = 0;
	СуммаЧекаБезСкидок                 = 0;
	СуммаЧекаСоСкидками                = 0;
	ПроизошлоИсключение                = Ложь;

	Если Касса = Неопределено Тогда		
		
		РезультатОперации.Результат      = Ложь;
		РезультатОперации.ОписаниеОшибки = НСтр("ru = 'Для данной операции необходимо указать кассу!'; en = 'For this operation, you must specify the cashbox!'");
		Возврат РезультатОперации;		
		
	КонецЕсли;
	
	// Если в кассе не используется оборудование отменить операцию.
	Если Касса.ИспользоватьБезПодключенияОборудования Тогда
		
		РезультатОперации.Результат      = Ложь;
		РезультатОперации.ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Касса: %1 используется без подключения оборудования!';en= 'Cashbox: %1 is used without connecting equipment!'"), Касса);
		Возврат РезультатОперации;
		
	КонецЕсли;		
		
	// Получаем общие параметры для пробития чека на ФР (ФИКСИРОВАННАЯ СТРУКТУРА).
	ОбщиеПараметры = ПолучитьОбщиеПараметрыПробитияЧека(ПараметрыЧека); 
	
	// Предварительная подготовка товаров и оплат.
	ОписаниеОшибки = "";
	Если Не СформироватьТаблицыТоваровИОплат(ПараметрыЧека, ОписаниеОшибки) Тогда
		
		РезультатОперации.Результат      = Ложь;
		РезультатОперации.ОписаниеОшибки = ОписаниеОшибки;
		Возврат РезультатОперации;
		
	КонецЕсли;
	
	// Разбиение фискальных и не фискальных видов оплаты.
	МассивПараметровОплаты = ПараметрыЧека.МассивПараметровОплаты;
	Для Каждого ЭлементМ ИЗ МассивПараметровОплаты Цикл		
		
		МассивНефискальныхПараметровОплаты.Добавить(ЭлементМ);
		СуммаНЕФискальныхТиповОплат = СуммаНЕФискальныхТиповОплат + ЭлементМ.Сумма;
		
	КонецЦикла;
	
	СуммаЧекаБезСкидок   = ПараметрыЧека.СуммаЧекаБезСкидок; 
	СуммаЧекаСоСкидками  = ПараметрыЧека.СуммаЧекаСоСкидками;
	МассивТоваров        = ПараметрыЧека.МассивПараметровТовары;
	
	ПараметрыПечатиЧека = Новый Структура();
	ПараметрыПечатиЧека.Вставить("ИспользоватьФР"        , Истина);
	ПараметрыПечатиЧека.Вставить("ШиринаЧекаФР"          , 32);
	ПараметрыПечатиЧека.Вставить("СтруктурнаяЕдиница"    , ПараметрыЧека.СтруктурнаяЕдиница);
	ПараметрыПечатиЧека.Вставить("Клиент"                , ПараметрыЧека.Клиент);
	ПараметрыПечатиЧека.Вставить("Дата"                  , ПараметрыЧека.Дата);
	ПараметрыПечатиЧека.Вставить("СуммаЧекаБезСкидок"    , СуммаЧекаБезСкидок);
	ПараметрыПечатиЧека.Вставить("СуммаЧекаСоСкидками"   , СуммаЧекаСоСкидками);
	ПараметрыПечатиЧека.Вставить("МассивПараметровТовары", МассивТоваров);
	ПараметрыПечатиЧека.Вставить("МассивПараметровОплаты", МассивНефискальныхПараметровОплаты);			
	
	ТекстНефискальноЧека = МенеджерОборудованияВызовСервера.ПолучитьПречекКассира(,ПараметрыПечатиЧека);
	
	РезультатОперации.Вставить("ДанныеЧека", ТекстНефискальноЧека);
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Подготовить данные для пробития фискального чека
//
// Параметры:
//  ПараметрыЧека	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПодготовитьДанныеДляПробитияФискальногоИНеФискальногоЧекаФР(ПараметрыЧека) Экспорт
	
	РезультатОперации                  = Новый Структура("Результат, ОписаниеОшибки", Истина, "");
	
	ЧекТип                             = ?(ПараметрыЧека.Свойство("ТипЧека")	  , ПараметрыЧека.ТипЧека, 0); // 0 - приход, 1 - возврат
	ЧекПризнакфискальности             = ?(ПараметрыЧека.Свойство("ЧекФискальный"), ПараметрыЧека.ЧекФискальный, Истина);	
	Касса                              = ?(ПараметрыЧека.Свойство("Касса")        , ПараметрыЧека.Касса, Неопределено);
	
	МассивфискальныхПараметровОплаты   = Новый Массив;
	МассивНефискальныхПараметровОплаты = Новый Массив;
	СуммаФискальныхТиповОплат          = 0;
	СуммаНЕФискальныхТиповОплат        = 0;
	СуммаЧекаБезСкидок                 = 0;
	СуммаЧекаСоСкидками                = 0;
	ПроизошлоИсключение                = Ложь;
	
	Если Касса = Неопределено Тогда
		
		РезультатОперации.Результат      = Ложь;
		РезультатОперации.ОписаниеОшибки = НСтр("ru = 'Для данной операции необходимо указать кассу!'; en = 'For this operation, you must specify the cashbox!'");
		Возврат РезультатОперации;		
		
	КонецЕсли;
	
	// Если в кассе не используется оборудование отменить операцию.
	Если Касса.ИспользоватьБезПодключенияОборудования Тогда
		
		РезультатОперации.Результат      = Ложь;
		РезультатОперации.ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Касса: %1 используется без подключения оборудования!';en= 'Cashbox: %1 is used without connecting equipment!'"), Касса);
		Возврат РезультатОперации;
		
	КонецЕсли;	
	
	// Получаем общие параметры для пробития чека на ФР (ФИКСИРОВАННАЯ СТРУКТУРА).
	ОбщиеПараметры = ПолучитьОбщиеПараметрыПробитияЧека(ПараметрыЧека); 
	
	// Предварительная подготовка товаров и оплат.
	ОписаниеОшибки = "";
	Если Не СформироватьТаблицыТоваровИОплат(ПараметрыЧека, ОписаниеОшибки) Тогда
		
		РезультатОперации.Результат      = Ложь;
		РезультатОперации.ОписаниеОшибки = ОписаниеОшибки;
		Возврат РезультатОперации;
		
	КонецЕсли;
	
	// Разбиение фискальных и не фискальных видов оплаты.
	МассивПараметровОплаты = ПараметрыЧека.МассивПараметровОплаты;
	Для Каждого ЭлементМ ИЗ МассивПараметровОплаты Цикл
		
		Если ЧекПризнакфискальности  И ПолучитьПризнакФискальностиВидаОплатыПоКассе(ПараметрыЧека.Касса, ЭлементМ.ТипОплаты)  Тогда			
			
			МассивфискальныхПараметровОплаты.Добавить(ЭлементМ);		
			СуммаФискальныхТиповОплат = СуммаФискальныхТиповОплат + ЭлементМ.Сумма;
			
		Иначе	
			
			МассивНефискальныхПараметровОплаты.Добавить(ЭлементМ);
			СуммаНЕФискальныхТиповОплат = СуммаНЕФискальныхТиповОплат + ЭлементМ.Сумма;
			
		КонецЕсли;		
		
	КонецЦикла;
	
	Если СуммаФискальныхТиповОплат > 0 Тогда
		
		// Копируем основные параметры чека.
		ФискальныйЧек = Новый Структура(ОбщиеПараметры);
		ФискальныйЧек.ПозицииЧека  = Новый Массив;
		ФискальныйЧек.ТаблицаОплат = Новый Массив;
		
		// Если сумма фискальных видов оплат отличается от общей суммы чека проводим корректировку в стоимости товаров.
		Если ПараметрыЧека.СуммаЧекаСоСкидками > СуммаФискальныхТиповОплат Тогда
			
			СтруктураТоваров    = СформироватьФискальнуюТаблицуТоваров(ПараметрыЧека.МассивПараметровТовары, СуммаФискальныхТиповОплат);
			СуммаЧекаБезСкидок  = СтруктураТоваров.СуммаЧекаБезСкидок;
			СуммаЧекаСоСкидками = СтруктураТоваров.СуммаЧекаСоСкидками;
			МассивТоваров       = СтруктураТоваров.МассивТоваров;
			
		Иначе
			
			СуммаЧекаБезСкидок   = ПараметрыЧека.СуммаЧекаБезСкидок; 
			СуммаЧекаСоСкидками  = ПараметрыЧека.СуммаЧекаСоСкидками;
			МассивТоваров        = ПараметрыЧека.МассивПараметровТовары;			
			
		КонецЕсли; 			
		
		// Сохраняем массив для нефискальных видов оплаты.
		МассивФискальныхТоваров  = МассивТоваров;
		
		ДобавитьТоварыВОбщиеПараметрыЧека(ФискальныйЧек, МассивТоваров);
		ДобавитьОплатуВОбщиеПараметрыЧека(ФискальныйЧек, МассивфискальныхПараметровОплаты);		
		
		РезультатОперации.Вставить("ФискальныйЧек", ФискальныйЧек);
		
	КонецЕсли;
	
	Если СуммаНЕФискальныхТиповОплат > 0 Тогда
		
		// Если сумма НЕ фискальных видов оплат отличается от общей суммы чека проводим корректировку в стоимости товаров.
		Если ПараметрыЧека.СуммаЧекаСоСкидками > СуммаНЕФискальныхТиповОплат Тогда	
			СтруктураТоваров    = СформироватьНефискальнуюТаблицуТоваров(ПараметрыЧека.МассивПараметровТовары, МассивФискальныхТоваров, СуммаНЕФискальныхТиповОплат);
			СуммаЧекаБезСкидок  = СтруктураТоваров.СуммаЧекаБезСкидок;
			СуммаЧекаСоСкидками = СтруктураТоваров.СуммаЧекаСоСкидками;
			МассивТоваров       = СтруктураТоваров.МассивТоваров;			
		Иначе
			СуммаЧекаБезСкидок   = ПараметрыЧека.СуммаЧекаБезСкидок; 
			СуммаЧекаСоСкидками  = ПараметрыЧека.СуммаЧекаСоСкидками;
			МассивТоваров        = ПараметрыЧека.МассивПараметровТовары;
		КонецЕсли;
		
		ПараметрыПечатиЧека = Новый Структура();
		ПараметрыПечатиЧека.Вставить("ИспользоватьФР"        , Истина);
		ПараметрыПечатиЧека.Вставить("ШиринаЧекаФР"          , 32);
		ПараметрыПечатиЧека.Вставить("СтруктурнаяЕдиница"    , ПараметрыЧека.СтруктурнаяЕдиница);
		ПараметрыПечатиЧека.Вставить("Клиент"                , ПараметрыЧека.Клиент);
		ПараметрыПечатиЧека.Вставить("Дата"                  , ПараметрыЧека.Дата);
		ПараметрыПечатиЧека.Вставить("СуммаЧекаБезСкидок"    , СуммаЧекаБезСкидок);
		ПараметрыПечатиЧека.Вставить("СуммаЧекаСоСкидками"   , СуммаЧекаСоСкидками);
		ПараметрыПечатиЧека.Вставить("МассивПараметровТовары", МассивТоваров);
		ПараметрыПечатиЧека.Вставить("МассивПараметровОплаты", МассивНефискальныхПараметровОплаты);			
		
		ТекстНефискальноЧека = МенеджерОборудованияВызовСервера.ПолучитьПречекКассира(,ПараметрыПечатиЧека);
		
		РезультатОперации.Вставить("НефискальныйЧек", ТекстНефискальноЧека);
		
	КонецЕсли;	
	
	Возврат РезультатОперации;

КонецФункции

// Функция, формирует талицу товаров, на фискальную сумму.
//
Функция СформироватьФискальнуюТаблицуТоваров(МассивТоваров, СуммаФискальныхТиповОплат)
	
	СуммаЧекаБезСкидок   = 0;
	СуммаЧекаСоСкидками  = 0;	
	
	ВременныйМассивТоваров     = КопироватьМассивПарамтеровТоваров(МассивТоваров);	
	мСуммаФискальныхТиповОплат = СуммаФискальныхТиповОплат;
	
	Для НомерСтроки = 0 По ВременныйМассивТоваров.Количество() - 1 Цикл
		
		Если мСуммаФискальныхТиповОплат > 0 
			И мСуммаФискальныхТиповОплат > ВременныйМассивТоваров[НомерСтроки].СтоимостьБезСкидки Тогда
			
			мСуммаФискальныхТиповОплат = мСуммаФискальныхТиповОплат - ВременныйМассивТоваров[НомерСтроки].СтоимостьБезСкидки;						
			СуммаЧекаБезСкидок  = СуммаЧекаБезСкидок  + ВременныйМассивТоваров[НомерСтроки].СтоимостьБезСкидки;
			СуммаЧекаСоСкидками = СуммаЧекаСоСкидками + ВременныйМассивТоваров[НомерСтроки].СтоимостьСоСкидкой;
			
		ИначеЕсли мСуммаФискальныхТиповОплат > 0 Тогда
			
			ВременныйМассивТоваров[НомерСтроки].СтоимостьБезСкидки = мСуммаФискальныхТиповОплат;
			ВременныйМассивТоваров[НомерСтроки].СтоимостьСоСкидкой = мСуммаФискальныхТиповОплат;
			СуммаЧекаБезСкидок  = СуммаЧекаБезСкидок  + ВременныйМассивТоваров[НомерСтроки].СтоимостьБезСкидки;
			СуммаЧекаСоСкидками = СуммаЧекаСоСкидками + ВременныйМассивТоваров[НомерСтроки].СтоимостьСоСкидкой;
			мСуммаФискальныхТиповОплат = 0;					
			
		Иначе
			
			ВременныйМассивТоваров.Удалить(НомерСтроки);
			Если НомерСтроки <= ВременныйМассивТоваров.Количество() - 1 Тогда
				НомерСтроки = НомерСтроки - 1;
			Иначе
				Прервать;
			КонецЕсли;
			
		КонецЕсли;					
		
	КонецЦикла;  	
	
	Возврат Новый Структура("МассивТоваров, СуммаЧекаБезСкидок, СуммаЧекаСоСкидками", ВременныйМассивТоваров, СуммаЧекаБезСкидок, СуммаЧекаСоСкидками);
	
КонецФункции

// Функция, формирует таблицу товаров на нефискальную сумму.
//
Функция СформироватьНефискальнуюТаблицуТоваров(МассивТоваров, МассивФискальныхТоваров, СуммаНЕФискальныхТиповОплат)
		
	ВременныйМассивТоваров = КопироватьМассивПарамтеровТоваров(МассивТоваров);		
	
	СуммаЧекаБезСкидок  = 0;
	СуммаЧекаСоСкидками = 0;
	
	МассивФискальныхОплат = МассивФискальныхТоваров;
	
	Если ЗначениеЗаполнено(МассивТоваров) Тогда
		
		Для НомерСтроки = 0 По МассивФискальныхОплат.Количество() - 1 Цикл
			ВременныйМассивТоваров[НомерСтроки].СтоимостьБезСкидки = ВременныйМассивТоваров[НомерСтроки].СтоимостьБезСкидки - МассивФискальныхОплат[НомерСтроки].СтоимостьБезСкидки;
			ВременныйМассивТоваров[НомерСтроки].СтоимостьСоСкидкой = ВременныйМассивТоваров[НомерСтроки].СтоимостьСоСкидкой - МассивФискальныхОплат[НомерСтроки].СтоимостьСоСкидкой;						
		КонецЦикла;	


		
		// удаляем нулевые строки из массива
		НомерСтроки = 0;
		Пока НомерСтроки < ВременныйМассивТоваров.Количество() Цикл
			Если ВременныйМассивТоваров[НомерСтроки].СтоимостьБезСкидки = 0 Тогда					
				ВременныйМассивТоваров.Удалить(НомерСтроки);
			Иначе
				НомерСтроки = НомерСтроки + 1;
			КонецЕсли;
		КонецЦикла;  
		
	КонецЕсли;
	
	мСуммаНЕФискальныхТиповОплат = СуммаНЕФискальныхТиповОплат;
	Для НомерСтроки = 0 По ВременныйМассивТоваров.Количество() - 1 Цикл
		Если мСуммаНЕФискальныхТиповОплат > 0 и мСуммаНЕФискальныхТиповОплат > ВременныйМассивТоваров[НомерСтроки].СтоимостьБезСкидки Тогда

			мСуммаНЕФискальныхТиповОплат = мСуммаНЕФискальныхТиповОплат - ВременныйМассивТоваров[НомерСтроки].СтоимостьБезСкидки;						
			СуммаЧекаБезСкидок  = СуммаЧекаБезСкидок  + ВременныйМассивТоваров[НомерСтроки].СтоимостьБезСкидки;
			СуммаЧекаСоСкидками = СуммаЧекаСоСкидками + ВременныйМассивТоваров[НомерСтроки].СтоимостьСоСкидкой;

		ИначеЕсли мСуммаНЕФискальныхТиповОплат > 0 Тогда

			ВременныйМассивТоваров[НомерСтроки].СтоимостьБезСкидки = мСуммаНЕФискальныхТиповОплат;
			ВременныйМассивТоваров[НомерСтроки].СтоимостьСоСкидкой = мСуммаНЕФискальныхТиповОплат;
			СуммаЧекаБезСкидок  = СуммаЧекаБезСкидок  + ВременныйМассивТоваров[НомерСтроки].СтоимостьБезСкидки;
			СуммаЧекаСоСкидками = СуммаЧекаСоСкидками + ВременныйМассивТоваров[НомерСтроки].СтоимостьСоСкидкой;
			мСуммаНЕФискальныхТиповОплат = 0;					

		Иначе

			ВременныйМассивТоваров.Удалить(НомерСтроки);

			Если НомерСтроки <= ВременныйМассивТоваров.Количество() - 1 Тогда
				НомерСтроки = НомерСтроки - 1;
			Иначе
				Прервать;
			КонецЕсли;

		КонецЕсли;					

	КонецЦикла;  
	
	Возврат Новый Структура("МассивТоваров, СуммаЧекаБезСкидок, СуммаЧекаСоСкидками", ВременныйМассивТоваров, СуммаЧекаБезСкидок, СуммаЧекаСоСкидками);
	
КонецФункции

// Функция, копирует массив параметров чека
//
Функция КопироватьМассивПарамтеровТоваров(ИсходныйМассив)
	
	НовыйМассив = Новый Массив;
	Для Каждого ЭлементМ ИЗ ИсходныйМассив Цикл
		
		СтрДанных = ПустаяСтруктураСтрокиТоваровЧека();
		ЗаполнитьЗначенияСвойств(СтрДанных,ЭлементМ);
	    НовыйМассив.Добавить(СтрДанных);
		
	КонецЦикла;
	
	Возврат НовыйМассив;
	
КонецФункции

// Функция, возвращает структуру контактной информации.
//
Функция ПолучитьКонтактнуюИнформацию(Клиент, НормализоватьНомерТелефона = Истина, Касса = Неопределено) Экспорт
	
	EmailСтроки = Клиент.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
	Email = Неопределено;
	Если EmailСтроки.Количество() > 0 Тогда
	  Email = EmailСтроки[0].АдресЭП;
	КонецЕсли;
	
	ТелефонСтроки = Клиент.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
	НомерТелефона = Неопределено;
	Если ТелефонСтроки.Количество() > 0 Тогда
		
		НомерТелефона = ТелефонСтроки[0].НомерТелефона;
		
		Если НормализоватьНомерТелефона = Истина Тогда
			
			СписокПолей = Новый СписокЗначений;
			УправлениеКонтактнойИнформацией.ПреобразоватьНомерТелефона(НомерТелефона, СписокПолей, Касса); 
			Если Не ЗначениеЗаполнено(Касса) Тогда
				НомерТелефона = СписокПолей[1].Значение + СписокПолей[2].Значение;
			Иначе
				НомерТелефона = СписокПолей[0].Значение + СписокПолей[1].Значение + СписокПолей[2].Значение;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Новый Структура("Email, Телефон", Email, НомерТелефона);
	
КонецФункции

// Функция - Признак способа расчета при продаже или возврате членства, пакет услуг.
// 
Функция ПризнакСпособаРасчетаПриПродажеИлиВозвратеЧПУ(ЭтоОплатаКредита = Ложь) 
	
	Если ЭтоОплатаКредита Тогда
		Возврат Перечисления.ПризнакиСпособаРасчета.ОплатаКредита;
	КонецЕсли;
	
	Возврат Перечисления.ПризнакиСпособаРасчета.ПредоплатаПолная;
			
КонецФункции

// Функция возвращает по идентификатору наименование драйвера устройства.
//
Функция ПолучитьИмяДрайвераЭкземпляра(НаименованиеОбработчикаДрайвера) Экспорт

	Результат = "";

	Для каждого ИмяПеречисления Из Метаданные.Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ЗначенияПеречисления Цикл
		Если НаименованиеОбработчикаДрайвера = ИмяПеречисления.Синоним Тогда
			Результат = ИмяПеречисления.Имя;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Функция возвращает из переменной сеанса имя компьютера клиента.
//
Функция НайтиРабочиеМестаПоИмениКомпьютера(ИмяКомпьютера) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РабочиеМеста.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РабочиеМеста КАК РабочиеМеста
	|ГДЕ
	|	(РабочиеМеста.Код = &Код
	|			ИЛИ РабочиеМеста.ИмяКомпьютера = &Код)
	|	И РабочиеМеста.ПометкаУдаления = ЛОЖЬ");

	Запрос.УстановитьПараметр("Код", ИмяКомпьютера);
	Выборка = Запрос.Выполнить().Выбрать();

	СписокКомпьютеров = Новый СписокЗначений();
	Пока Выборка.Следующий() Цикл
		СписокКомпьютеров.Добавить(Выборка.Ссылка);
	КонецЦикла;

	Возврат СписокКомпьютеров;

КонецФункции

// Функция возвращает макет слип чека по наименованию макета
//
Функция ПолучитьСлипЧек(ИмяМакета, ШиринаСлипЧека, Параметры) Экспорт

	Документ = Новый ТекстовыйДокумент();
	СлипЧек  = "";

	Макет    = Справочники.ПодключаемоеОборудование.ПолучитьМакет(ИмяМакета);
	Область  = Макет.ПолучитьОбласть("Чек" + ШиринаСлипЧека);

	Для Каждого Параметр Из Параметры Цикл
		Область.Параметры[Параметр.Ключ] = Параметр.Значение;
	КонецЦикла;

	Если Область <> Неопределено Тогда
		Документ.Вывести(Область);

		Для Индекс = 1 По Документ.КоличествоСтрок() Цикл
			СлипЧек = СлипЧек + Документ.ПолучитьСтроку(Индекс)
			        + ?(Индекс = Документ.КоличествоСтрок(), "", Символ(13) + Символ(10));
		КонецЦикла;
	КонецЕсли;

	Возврат СлипЧек;

КонецФункции

// Функция, устанавливет пробелы до и после указанных символов.
//  Параметры: 
//   СтрокаПоиска - тип "Строка", строка источник для поиска символов;
//   МассивСимволов - тип "Массив", содержит символы для поиска в строке.
//  Возвращаемое значение: 
//   ИсходнаяСтрока - тип "Строка", отредактированная строка. 
//
Функция ПоискСимволовПоСтроке(СтрокаПоиска, МассивСимволов)
	
	ИсходнаяСтрока  = "";
	Для Каждого СтрокаМассив ИЗ МассивСимволов Цикл
		Если Найти(СтрокаПоиска,СтрокаМассив) = 0 Тогда	
			Продолжить;
		КонецЕсли;
		
		Если ПустаяСтрока(ИсходнаяСтрока) Тогда
			ТекСтрока       = СтрЗаменить(СтрокаПоиска," ","");
		Иначе
			ТекСтрока = ИсходнаяСтрока;
		КонецЕсли;
		
		ПравЧастьСтроки = СтрокаМассив+" " + Сред(ТекСтрока,Найти(ТекСтрока, СтрокаМассив)+1);
		ЛевЧастьСтроки  = Сред(ТекСтрока,0,Найти(ТекСтрока, СтрокаМассив)-1) + " ";
		ИсходнаяСтрока =  ЛевЧастьСтроки + ПравЧастьСтроки;
		    		
	КонецЦикла;
	
	Возврат ?(ПустаяСтрока(ИсходнаяСтрока),СтрокаПоиска,ИсходнаяСтрока);
	
КонецФункции     

// Функция возвращает макет слип чека по наименованию макета
//
Функция ПолучитьПреЧекККТ(ПараметрыЧека, ШиринаПреЧека) Экспорт

	Документ = Новый ТекстовыйДокумент();
	ПреЧек  = "";

	Макет    = Справочники.ПодключаемоеОборудование.ПолучитьМакет("Пречек");
	Область  = Макет.ПолучитьОбласть("ЧекШапка" + ШиринаПреЧека);
	Документ.Вывести(Область);
	
	Область  = Макет.ПолучитьОбласть("ЧекЗаголовок" + ШиринаПреЧека);
	Область.Параметры.СтруктурнаяЕдиница  = ПараметрыЧека.Организация;
	Документ.Вывести(Область);
	
	Область  = Макет.ПолучитьОбласть("Дата");	
	Область.Параметры.Дата  = Формат(ТекущаяДатаСеанса(), "ДФ='dd.MM.yyyy hh:mm'");	
	Документ.Вывести(Область);
	
	Область  = Макет.ПолучитьОбласть("Кассир" + ШиринаПреЧека);	
	Область.Параметры.Кассир  = ПараметрыЧека.Кассир;	
	Документ.Вывести(Область);
	
	Область  = Макет.ПолучитьОбласть("ПустаяСтрока");	
	Документ.Вывести(Область);
	
	СуммаЧека = 0;
	Область  = Макет.ПолучитьОбласть("ЧекСтрока"+ШиринаПреЧека);
	ОбластьСкидки = Макет.ПолучитьОбласть("ЧекСкидка"+ШиринаПреЧека); 
	Для Каждого Элемент Из ПараметрыЧека.Запасы Цикл
		Область.Параметры.Наименование = Элемент.Наименование;
		Область.Параметры.Количество   = Элемент.Количество;
		Область.Параметры.Цена         = "="+Формат(Элемент.Цена,"ЧДЦ=2; ЧРД=.; ЧГ=");
		Документ.Вывести(Область);
		
		Если Элемент.СуммаСкидок > 0 Тогда
			ОбластьСкидки.Параметры.Скидка = "="+ФОрмат(Элемент.СуммаСкидок,"ЧДЦ=2; ЧРД=.; ЧГ=");// + "%";
			Документ.Вывести(ОбластьСкидки);
		КонецЕсли;
		
		СуммаЧека = СуммаЧека + Элемент.Сумма; 
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("ЧекПодвал"+ШиринаПреЧека);
	Область.Параметры.Итого = "="+Формат(СуммаЧека,"ЧДЦ=2; ЧРД=.; ЧГ=");		
	Документ.Вывести(Область);
	
	Если НЕ ПараметрыЧека.Свойство("Пречек") Тогда
		
		Область  = Макет.ПолучитьОбласть("ЧекОплата" + ШиринаПреЧека);
		
		Для Каждого СтрокаОплаты ИЗ ПараметрыЧека.Оплата Цикл			
			Область.Параметры.Оплата = "" + СтрокаОплаты.ТипОплаты;
			Область.Параметры.Сумма  = "=" + Формат(СтрокаОплаты.Сумма, "ЧДЦ=2; ЧРД=.; ЧГ="); 
			Документ.Вывести(Область);               			
		КонецЦикла;
		
	КонецЕсли;	
	
	Для Индекс = 1 По Документ.КоличествоСтрок() Цикл
		ПреЧек = ПреЧек + Документ.ПолучитьСтроку(Индекс)
				+ ?(Индекс = Документ.КоличествоСтрок(), "", Символ(13) + Символ(10));
	КонецЦикла;

	Возврат ПреЧек;

КонецФункции

// Процедура устанавливает значения параметров сеанса, относящихся к внешнему оборудованию.
//
Процедура УстановитьПараметрыСеансаВнешнегоОборудования(ИмяПараметра, УстановленныеПараметры) Экспорт

	Если ИмяПараметра = "РабочееМестоКлиента" Тогда
		УстановитьРабочееМестоКлиента(Справочники.РабочиеМеста.ПустаяСсылка());
		УстановленныеПараметры.Добавить("РабочееМестоКлиента");
	КонецЕсли;

КонецПроцедуры

// Функция возвращает пользовательские настройки внешнего оборудования.
//
Функция ПолучитьПользовательскиеНастройкиВнешнегоОборудования() Экспорт

	СписокНастроек = ХранилищеОбщихНастроек.ПолучитьСписок("ПользовательскиеНастройкиВнешнегоОборудования");

	Настройки = Новый СписокЗначений();

	Для Каждого Элемент из СписокНастроек Цикл
		КлючНастройки = Элемент.Значение;
		ЗначениеНастройки = ХранилищеОбщихНастроек.Загрузить("ПользовательскиеНастройкиВнешнегоОборудования", КлючНастройки);
		Если ЗначениеНастройки <> Неопределено Тогда
			Настройки.Добавить(ЗначениеНастройки, КлючНастройки);
		КонецЕсли;
	КонецЦикла;

	Возврат Настройки;

КонецФункции

// Процедура сохраняет указанные пользовательские настройки внешнего оборудования.
//
Процедура СохранитьПользовательскиеНастройкиВнешнегоОборудования(СписокНастроек) Экспорт
    	
	Для Каждого Элемент Из СписокНастроек Цикл
		ХранилищеОбщихНастроек.Сохранить("ПользовательскиеНастройкиВнешнегоОборудования", Элемент.Представление, Элемент.Значение);
	КонецЦикла;

КонецПроцедуры

// Функция выполняет получение параметров кассы.
//
Функция ПолучитьПараметрыКассы(Касса) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИСТИНА КАК ЭтоФискальныйРегистратор,
	|	Кассы.ВнешнееОборудование КАК ИдентификаторУстройства,
	|	Кассы.ИспользоватьБезПодключенияОборудования КАК ИспользоватьБезПодключенияОборудования,
	|	Кассы.ВнешнееОборудование.ТипОборудования КАК ТипОборудования
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	Кассы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Касса);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Новый Структура("ИдентификаторУстройства,
		                       |ИспользоватьБезПодключенияОборудования,
		                       |ЭтоФискальныйРегистратор,
							   |ТипОборудованияИмя",
		                       Выборка.ИдентификаторУстройства,
		                       Выборка.ИспользоватьБезПодключенияОборудования,
		                       Выборка.ЭтоФискальныйРегистратор,
							  ?(Выборка.ТипОборудования <> Null, МенеджерОборудованияВызовСервера.ПолучитьИмяТипаОборудования(Выборка.ТипОборудования), Неопределено)
		        );
		
	Иначе
		
		Возврат Новый Структура("ИдентификаторУстройства,
		                        |ИспользоватьБезПодключенияОборудования,
		                        |ЭтоФискальныйРегистратор,
								|ТипОборудованияИмя",
		                        Справочники.ПодключаемоеОборудование.ПустаяСсылка(),
		                        Ложь,
		                        Ложь,
								""
		        );
		
	КонецЕсли;
	
КонецФункции // ПолучитьПараметрыКассы()

// Получить таблицу доп.реквизитов из XML структуры
//
Функция ПолучитьТаблицуДопРеквизитов(ДанныеЗагрузки) Экспорт
	
	Результат = Новый Массив();
	
	Если НЕ ПустаяСтрока(ДанныеЗагрузки) Тогда
		
		ЧтениеXML = Новый ЧтениеXML; 
		ЧтениеXML.УстановитьСтроку(ДанныеЗагрузки);
		ЧтениеXML.ПерейтиКСодержимому();
		
		Если ЧтениеXML.Имя = "Table" и ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
			Пока ЧтениеXML.Прочитать() Цикл  
				Если ЧтениеXML.Имя = "Record" и ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
					Результат.Добавить(ЧтениеXML.ЗначениеАтрибута("VAT"));
					Результат.Добавить(Булево(ЧтениеXML.ЗначениеАтрибута("IsExcisable")));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Сформировать таблицу доп.реквизитов для реализации
//
Функция СформироватьТаблицуДопРеквизитов(ДанныеЗагрузки) Экспорт
	
	Результат = Новый Массив();
	
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();

	ЗаписьXML.ЗаписатьНачалоЭлемента("Table");
	Для Каждого Позиция Из ДанныеЗагрузки  Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Record");
		ЗаписьXML.ЗаписатьАтрибут("VAT", Позиция[0]);
		ЗаписьXML.ЗаписатьАтрибут("IsExcisable", Строка(Формат(Позиция[1], "БЛ=False; БИ=True")));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
    	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

// Функция - "ПолучитьПризнакСпособаРасчетаДляПечати".
//
Функция ПолучитьПризнакСпособаРасчетаДляПечати(ПризнакСпособаРасчета) Экспорт
	
	Если ПризнакСпособаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная") Тогда
		ПризнакСпособаРасчетаДляПечати = "[ПрОп100]"   
	ИначеЕсли ПризнакСпособаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная") Тогда
		ПризнакСпособаРасчетаДляПечати = "[ПрОпл]"
	ИначеЕсли ПризнакСпособаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.Аванс") Тогда
		ПризнакСпособаРасчетаДляПечати = "[Аванс]"
	ИначеЕсли ПризнакСпособаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой") Тогда
		ПризнакСпособаРасчетаДляПечати = "[ПОпл]"
	ИначеЕсли ПризнакСпособаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ПередачаСЧастичнойОплатой") Тогда
		ПризнакСпособаРасчетаДляПечати = "[ЧОпл]"
	ИначеЕсли ПризнакСпособаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ПередачаБезОплаты") Тогда
		ПризнакСпособаРасчетаДляПечати = "[БезОп]" 
	ИначеЕсли ПризнакСпособаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ОплатаКредита") Тогда
		ПризнакСпособаРасчетаДляПечати = "[Кред]"
	КонецЕсли;
	
	Возврат ПризнакСпособаРасчетаДляПечати;
	
КонецФункции

// Получить наименование системы налогообложения по коду.
//
Функция ПолучитьНаименованиеСистемыНалогообложения(СистемаНалогообложения, Кратко = Ложь) Экспорт;
	
	СистемыНалогообложения = Новый Соответствие();
	Если Кратко Тогда
		СистемыНалогообложения.Вставить(0, НСтр("ru='ОСН'"));
		СистемыНалогообложения.Вставить(1, НСтр("ru='УСН доход'"));
		СистемыНалогообложения.Вставить(2, НСтр("ru='УСН доход-расход'"));
		СистемыНалогообложения.Вставить(3, НСтр("ru='ЕНВД'"));
		СистемыНалогообложения.Вставить(4, НСтр("ru='ЕСН'"));
		СистемыНалогообложения.Вставить(5, НСтр("ru='Патент'"));
	Иначе
		СистемыНалогообложения.Вставить(0, НСтр("ru='Общая'"));
		СистемыНалогообложения.Вставить(1, НСтр("ru='Упрощенная Доход'"));
		СистемыНалогообложения.Вставить(2, НСтр("ru='Упрощенная Доход минус Расход'"));
		СистемыНалогообложения.Вставить(3, НСтр("ru='Единый налог на вмененный доход'"));
		СистемыНалогообложения.Вставить(4, НСтр("ru='Единый сельскохозяйственный налог'"));
		СистемыНалогообложения.Вставить(5, НСтр("ru='Патентная система налогообложения'"));
	КонецЕсли;
	
	Возврат СистемыНалогообложения.Получить(СистемаНалогообложения);
	
КонецФункции

// Скопировать cтруктуру.
//
Функция СкопироватьСтруктуру(ТекущаяПозиция) Экспорт
	
	НоваяПозиция = Новый Структура;
	Для Каждого ЭлементСтруктуры Из ТекущаяПозиция Цикл
		НоваяПозиция.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;
	
	Возврат НоваяПозиция;
	
КонецФункции

// Функция, возвращает штрихкод номенклатуры для ККТ
//
Функция ПолучитьШтрихкодНоменклатуры(Номенклатура, Партия, Упаковка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Партия"      , Партия);
	Запрос.УстановитьПараметр("Упаковка"    , Упаковка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Штрихкоды.Штрихкод
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект = &Номенклатура
	|	И Штрихкоды.ПартииНоменклатуры = &Партия
	|	И Штрихкоды.Упаковка = &Упаковка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Штрихкод;
	Иначе
		Возврат null;
	КонецЕсли;
	
КонецФункции

// Функция, возвращает данные карты клиента
//
Функция ПолучитьДанныеМагнитнойКарты(Знач КодКарты) Экспорт
	
	Карта = Справочники.Карты.ПолучитьДанныеМагнитнойКарты(КодКарты);
	
	// Интеграция с 1С:Отель.
	// ПараметрыПодключения = Справочники.ПодключаемоеОборудование.ПолучитьПараметрыОбменаДаннымиОтель();
	// Если Не ПараметрыПодключения = Неопределено Тогда
	//	ДанныеКлиента = ОбменДаннымиСерверСтоматология.ПолучитьДанныеМагнитнойКартыОтель(КодКарты, ПараметрыПодключения);
	//	Если НЕ ДанныеКлиента = Неопределено Тогда
	//		// 1. Если Карты не существует создаем ее.
	//		Если Карта = Неопределено Тогда	
	//			ДанныеКлиента.Вставить("Фото", ОбменДаннымиСерверСтоматология.ПолучитьФотоКлиентаОтель(ДанныеКлиента.КодКлиента, ПараметрыПодключения));
	//			Карта = ОбменДаннымиСерверСтоматология.СоздатьОбновитьКлиентаОтель(ДанныеКлиента);	
	//			
	//		// 2. Если карта существует в Стоматология, то сравниваем коды владельцев карт.
	//		ИначеЕсли Не Карта.ВладелецКарты.КодКлиента = ДанныеКлиента.КодКлиента Тогда			
	//			ДанныеКлиента.Вставить("Фото" , ОбменДаннымиСерверСтоматология.ПолучитьФотоКлиентаОтель(ДанныеКлиента.КодКлиента, ПараметрыПодключения));
	//			ДанныеКлиента.Вставить("Карта", Карта);
	//			Карта = ОбменДаннымиСерверСтоматология.СоздатьОбновитьКлиентаОтель(ДанныеКлиента);				
	//		КонецЕсли;
	//	КонецЕсли;
	// КонецЕсли;  
	
    СтруктураВозврата = Новый Структура("КодШифра, Карта, ТипДанных, Клиент, Сотрудник, Ключ, ЗакрепленЗаКлиентом", КодКарты);

	Если ЗначениеЗаполнено(Карта) Тогда
		СтруктураВозврата.Вставить("Карта", Карта); 
		Если ТипЗнч(Карта.ВладелецКарты) = Тип("СправочникСсылка.Контрагенты") Тогда
			СтруктураВозврата.Клиент     = Карта.ВладелецКарты;
			СтруктураВозврата.ТипДанных  = "КАРТА_КЛИЕНТА";
		// ИначеЕсли ТипЗнч(Карта.ВладелецКарты) = Тип("СправочникСсылка.Сотрудники") Тогда
		//	СтруктураВозврата.Сотрудник  = Карта.ВладелецКарты;
		//	СтруктураВозврата.Клиент     = Карта.ВладелецКарты.Контрагент;
		//	СтруктураВозврата.ТипДанных  = "КАРТА_СОТРУДНИКА";
		КонецЕсли;
	// Иначе
		// Ключ = Справочники.Ключи.НайтиКлюч(КодКарты); 
		// Если  Ключ <> Неопределено Тогда		
		//	СтруктураВозврата.Ключ                = Ключ;
		//	СтруктураВозврата.Клиент              = Ключ.ЗанятКлиентом;	
		//	СтруктураВозврата.ЗакрепленЗаКлиентом = Ключ.ЗакрепленЗаКлиентом;
		//	СтруктураВозврата.ТипДанных           = "КЛЮЧ_КЛИЕНТА";
		// КонецЕсли;
	КонецЕсли;

	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция - Получить данные штрих кода
//
// Параметры:
//  Штрихкод - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеШтрихКода(Знач Штрихкод, ИскатьВСериях = Истина) Экспорт
	
	Найден = Ложь;
	Карта = Справочники.Карты.ПолучитьДанныеМагнитнойКарты(Штрихкод);
	СтруктураВозврата = Новый Структура("КодШифра,Карта,ТипДанных,Клиент,Сотрудник,Ключ,ЗакрепленЗаКлиентом,Сертификат,ПартияСертификата", Штрихкод);

	Если ЗначениеЗаполнено(Карта) Тогда
		
		СтруктураВозврата.Вставить("Карта", Карта); 
		Если ТипЗнч(Карта.ВладелецКарты) = Тип("СправочникСсылка.Контрагенты") Тогда
			СтруктураВозврата.Клиент     = Карта.ВладелецКарты;
			СтруктураВозврата.ТипДанных  = "КАРТА_КЛИЕНТА";
		// ИначеЕсли ТипЗнч(Карта.ВладелецКарты) = Тип("СправочникСсылка.Сотрудники") Тогда
		//	СтруктураВозврата.Сотрудник  = Карта.ВладелецКарты;
		//	СтруктураВозврата.ТипДанных  = "КАРТА_СОТРУДНИКА";
		КонецЕсли;
		
		Найден = Истина;
	КонецЕсли;
	
	// Если Найден = Ложь Тогда
	//	
	//	Ключ = Справочники.Ключи.НайтиКлюч(Штрихкод); 
	//	Если  ЗначениеЗаполнено(Ключ) Тогда		
	//		
	//		СтруктураВозврата.Ключ                = Ключ;
	//		СтруктураВозврата.Клиент              = Ключ.ЗанятКлиентом;	
	//		СтруктураВозврата.ЗакрепленЗаКлиентом = Ключ.ЗакрепленЗаКлиентом;
	//		СтруктураВозврата.ТипДанных           = "КЛЮЧ_КЛИЕНТА";
	//		
	//		Найден = Истина;
	//	КонецЕсли;
	//	
	// КонецЕсли;
	
	Если Найден = Ложь Тогда
		
		ЗапросШтрихкодов =  РегистрыСведений.Штрихкоды.ПолучитьДанныеПоШтрихкодам(Штрихкод, ИскатьВСериях); 
		
		Если ЗначениеЗаполнено(ЗапросШтрихкодов) 
			И ЗначениеЗаполнено(ЗапросШтрихкодов.Партия) Тогда
			
			
			СтруктураВозврата.Сертификат        = ЗапросШтрихкодов.Партия.Владелец;
			СтруктураВозврата.ПартияСертификата = ЗапросШтрихкодов.Партия;
			СтруктураВозврата.ТипДанных         = "СЕРТИФИКАТ_НА_СУММУ";

			// Если ЗапросШтрихкодов.Партия.Владелец.СертификатТип = Перечисления.ТипыПодарочныхСертификатов.НаСумму Тогда
			//	
			//	СтруктураВозврата.Сертификат        = ЗапросШтрихкодов.Партия.Владелец;
			//	СтруктураВозврата.ПартияСертификата = ЗапросШтрихкодов.Партия;
			//	СтруктураВозврата.ТипДанных         = "СЕРТИФИКАТ_НА_СУММУ";
			//	
			// ИначеЕсли ЗапросШтрихкодов.Партия.Владелец.СертификатТип = Перечисления.ТипыПодарочныхСертификатов.НаПакетУслуг Тогда
			//	
			//	СтруктураВозврата.Сертификат        = ЗапросШтрихкодов.Партия.Владелец;
			//	СтруктураВозврата.ПартияСертификата = ЗапросШтрихкодов.Партия;
			//	СтруктураВозврата.ТипДанных         = "СЕРТИФИКАТ_НА_ПАКЕТ_УСЛУГ";
			//	
			// КонецЕсли;
			
			Найден = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#Область КассовыйСервер

// Функция - Получить обработчик драйвера кассового сервера
//
// Параметры:
//  ОбработчикДрайвера	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьОбработчикДрайвераКассовогоСервера(ОбработчикДрайвера) Экспорт
	
	Если ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикКассовогоСервера Тогда
		
		Возврат ПодключаемоеОборудованиеКассовыйСервер;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти
