#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте 
// Процедура - Отбор структурная единица при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ОтборСтруктурнаяЕдиницаПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница, ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Отбор контрагент при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ОтборКонтрагентПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", ОтборКонтрагент, ЗначениеЗаполнено(ОтборКонтрагент));

КонецПроцедуры

&НаКлиенте
// Процедура - Отбор статус при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ОтборСтатусПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Статус", ОтборСтатус, ЗначениеЗаполнено(ОтборСтатус));

КонецПроцедуры

&НаКлиенте
// Процедура - Отбор тип ссылки на оплату при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ОтборТипСсылкиНаОплатуПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ТипСсылкиНаОплату", ОтборТипСсылкиНаОплату, ЗначениеЗаполнено(ОтборТипСсылкиНаОплату));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Отбор эквайринговый терминал при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ОтборЭквайринговыйТерминалПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ЭквайринговыйТерминал", ОтборЭквайринговыйТерминал, ЗначениеЗаполнено(ОтборЭквайринговыйТерминал));

КонецПроцедуры

&НаКлиенте
// Процедура - Отбор ид заказа при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ОтборИдЗаказаПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "НомерЗаказа", ОтборНомерЗаказа, ЗначениеЗаполнено(ОтборНомерЗаказа));

КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Обновить cтатус
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОбновитьCтатус(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ВывестиКнопкуОбновленияЗаказа(ТекущиеДанные) Тогда		
		ОбновитьCтатусНаСервере(ТекущиеДанные.НомерЗаказа);  
		Элементы.Список.Обновить();		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
// Процедура - Обновить cтатус на сервере
//
// Параметры:
//  НомерЗаказа			 - 	 - 
//  ТипСсылкиНаОплату	 - 	 - 
//
Процедура ОбновитьCтатусНаСервере(НомерЗаказа)   	
	РегламентныеЗаданияСерверСтоматология.ОбработатьНеОплаченныеЗаказыСБП(НомерЗаказа);
КонецПроцедуры

// Процедура - Список при активизации строки
//
// Параметры:
//  Элемент	 - 	 - 
//
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные												= Элементы.Список.ТекущиеДанные; 	
	Элементы.ОбновитьСтатус.Доступность							= ВывестиКнопкуОбновленияЗаказа(ТекущиеДанные);		
	Элементы.СписокКонтекстноеМенюОткрытьФормуЗаказа.Видимость	= РольДоступнаПолныеПрава();	

КонецПроцедуры

&НаКлиенте
// Функция - Вывести кнопку обновления заказа
// 
// Возвращаемое значение:
//   - 
//
Функция ВывестиКнопкуОбновленияЗаказа(ТекущиеДанные)
	
	Возврат ТекущиеДанные <> Неопределено 
		И ЗначениеЗаполнено(ТекущиеДанные.НомерЗаказа) 
		И (ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовОнлайнОплаты.НеОплачено")
		ИЛИ ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовОнлайнОплаты.ОжидаетВозврата"))
		И (ТекущиеДанные.ТипСсылкиНаОплату = ПредопределенноеЗначение("Перечисление.ТипыСсылокНаОплату.СбербанкПлатиQR")
		ИЛИ ТекущиеДанные.ТипСсылкиНаОплату = ПредопределенноеЗначение("Перечисление.ТипыСсылокНаОплату.СБПАльфаБанк") 
		ИЛИ ТекущиеДанные.ТипСсылкиНаОплату = ПредопределенноеЗначение("Перечисление.ТипыСсылокНаОплату.СБПРайффайзенБанк")
		ИЛИ ТекущиеДанные.ТипСсылкиНаОплату = ПредопределенноеЗначение("Перечисление.ТипыСсылокНаОплату.СБПСбербанк")
		ИЛИ ТекущиеДанные.ТипСсылкиНаОплату = ПредопределенноеЗначение("Перечисление.ТипыСсылокНаОплату.СБПСДМ")
		ИЛИ ТекущиеДанные.ТипСсылкиНаОплату = ПредопределенноеЗначение("Перечисление.ТипыСсылокНаОплату.СБПТинькофф"));
		
КонецФункции

&НаКлиенте
// Процедура - Открыть форму заказа
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОткрытьФормуЗаказа(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПередаваемыеПараметры = Новый Структура; 	
	ПередаваемыеПараметры.Вставить("НомерЗаказа"	, ТекущиеДанные.НомерЗаказа);
	ПередаваемыеПараметры.Вставить("Основание"		, ТекущиеДанные.Основание);
	
	ПараметрыМассив = Новый Массив;
	ПараметрыМассив.Добавить(ПередаваемыеПараметры); 		
	КлючЗаписиРегистра = Новый("РегистрСведенийКлючЗаписи.СтатусыОплатыЗаказов", ПараметрыМассив); 
		
	ОткрытьФорму("РегистрСведений.СтатусыОплатыЗаказов.ФормаЗаписи", Новый Структура("Ключ", КлючЗаписиРегистра), ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Роль доступна полные права
// 
// Возвращаемое значение:
//   - 
//
Функция РольДоступнаПолныеПрава()
	Возврат РольДоступна("ПолныеПрава");	
КонецФункции

#КонецОбласти