
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрЕдиницаОтбор = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;  
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтрЕдиницаОтбор, ЗначениеЗаполнено(СтрЕдиницаОтбор));
	 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля СтрЕдиницаОтбор.
//
Процедура СтрЕдиницаОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтрЕдиницаОтбор, ЗначениеЗаполнено(СтрЕдиницаОтбор));
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля СкладОтбор.
//
Процедура СкладОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Склад", СкладОтбор, ЗначениеЗаполнено(СкладОтбор));
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля КонтрагентОтбор.
//
Процедура КонтрагентОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", КонтрагентОтбор, ЗначениеЗаполнено(КонтрагентОтбор));
КонецПроцедуры

&НаКлиенте
// Обработчик кнопки проведения оплаты документа.
Процедура ОплатитьДокумент(Команда)	
	
	УстановитьФункциональнуюОпцию_ОбменДаннымиВключен(Истина);	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;	
	Если НЕ ТекущиеДанные = Неопределено Тогда		
		Если ТекущиеДанные.Проведен Тогда
			
			ПараметрыОплаты = Новый Структура;
			ПараметрыОплаты.Вставить("ДатаПродажи"                       , ТекущиеДанные.Дата);
			ПараметрыОплаты.Вставить("СтруктурнаяЕдиница"                , ТекущиеДанные.СтруктурнаяЕдиница);
            ПараметрыОплаты.Вставить("Касса"                             , ТекущиеДанные.Касса);			
			ПараметрыОплаты.Вставить("ВидОперации"                       , ПредопределенноеЗначение("Перечисление.ВидыОпераций.Продажа"));
			ПараметрыОплаты.Вставить("Контрагент"                        , ТекущиеДанные.Контрагент);
			ПараметрыОплаты.Вставить("ДокументыПродажи"                  , ТекущиеДанные.Ссылка);
			ПараметрыОплаты.Вставить("ЗакрытьФормуАвтоматически"         , Истина);

			// ФормаОплаты = ПолучитьФорму("Обработка.ПомощникПроведенияОплаты.Форма.ФормаОплаты", ПараметрыОплаты);
			// ФормаОплаты.ОткрытьМодально(); 

			ОткрытьФорму("Обработка.ПомощникПроведенияОплаты.Форма.ФормаОплаты", 
			ПараметрыОплаты,,,,, Новый ОписаниеОповещения("ОплатитьЗавершение", ЭтотОбъект), 
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

		Иначе
			ПоказатьПредупреждение(,"Предварительно необходимо провести документ!");
		КонецЕсли;		
	КонецЕсли;
	УстановитьФункциональнуюОпцию_ОбменДаннымиВключен(Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - устанавливает функциональую опцию.
//
Процедура УстановитьФункциональнуюОпцию_ОбменДаннымиВключен(Параметр)
	
	ПараметрыСеанса.ОбменДаннымиВключен = Параметр;
	
КонецПроцедуры

&НаКлиенте
// Процедура печати.
//
Процедура ДокументПечать(Команда)	
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "Реализация");	
	Структура.Вставить("МассивДокументов", Элементы.Список.ВыделенныеСтроки);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ОбработкаКоманды", УправлениеПечатьюКлиентСтоматология, Структура);									
	// ПоказатьВыборИзСписка(Оповещение, СписокПечатныхФорм, ТекущийЭлемент);
	ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, ТекущийЭлемент);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()                           	
	Возврат Документы.Реализация.ПолучитьСписокПечатныхФорм();	
КонецФункции


&НаКлиенте
// Процедура - Оплатить завершение
//
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
//
Процедура ОплатитьЗавершение(Результат, Параметры)  Экспорт
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если Не Элементы.Найти("Оплатить") = Неопределено Тогда
		Элементы.Оплатить.Доступность = ТекущиеДанные.СуммаДокумента > ТекущиеДанные.СуммаОплачено; 
	КонецЕсли;
   УстановитьФункциональнуюОпцию_ОбменДаннымиВключен(Ложь);
   
КонецПроцедуры

&НаКлиенте
// При активации строки
//
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		Если Не Элементы.Найти("Оплатить") = Неопределено Тогда
			Элементы.Оплатить.Доступность = Элемент.ТекущиеДанные.СуммаДокумента > Элемент.ТекущиеДанные.СуммаОплачено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
