
#Область СлужебныйПрограммныйИнтерфейс

// Процедура формирует таблицу движений по регистру накопления ПартииТоваров
// Параметры:
// 		ТаблицаСписанияНоменклатуры - Таблица или табличная часть с номенклатурой;
//		СтруктураДополнительныеСвойства - структура, дополнительные свойства;
//      Движения - Движения документа по регистрам;
//      Отказ    - Отказ продедения;
Процедура СформироватьСписаниеТаблицаПартииТоваров(ТаблицаСписанияНоменклатуры, СтруктураДополнительныеСвойства, Движения, Отказ) Экспорт
	
	НаборДвижений   = Движения.ПартииТоваров;
    ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки("НомерСтроки,Период, ВидДвижения, ДокументПоступления, Номенклатура, Склад, СтруктурнаяЕдиница, Партия, Количество, Стоимость");
	
	Если  СтруктураДополнительныеСвойства.ДляПроведения.Свойство("ВыполнятьДвиженияСебестоимость") Тогда
		НаборДвижений   = Движения.ПродажиСебестоимость;
		ТаблицаДвиженийПродажи = НаборДвижений.ВыгрузитьКолонки("НомерСтроки,Период, Контрагент, ДокументПродажи, Номенклатура, Склад, Партия, СтруктурнаяЕдиница, Сотрудник, Ассистент, ЗубнойТехник, Материал, Количество, Стоимость");
	КонецЕсли;
	
	СпособОценкиМПЗ = Константы.СпособОценкиМПЗ.Получить();
	Если Не ЗначениеЗаполнено(СпособОценкиМПЗ) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена стратегия списания партий товаров!");
        СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваров", ТаблицаДвижений);
		Если  СтруктураДополнительныеСвойства.ДляПроведения.Свойство("ВыполнятьДвиженияСебестоимость") Тогда
			  СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажиСебестоимость", ТаблицаДвиженийПродажи);
        КонецЕсли;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТаблицаНоменклатуры = ПодготовитьТалицуКСписаниюОприходованиюПартий(ТаблицаСписанияНоменклатуры,СтруктураДополнительныеСвойства);			
	ТаблицаНоменклатуры.Сортировать("ОснованиеВозврата Возр");
	
	ЗапросПоПартиям = ПолучитьЗапросПартийДляСписания(СпособОценкиМПЗ);
	МенеджерВременнойТаблицы = ВыбратьТЗВВременнуюТаблицу(ТаблицаНоменклатуры, "ТаблицаНоменклатуры");
	Граница = Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.ссылка.МоментВремени(), ВидГраницы.Исключая); 
	ЗапросПоПартиям.УстановитьПараметр("Дата", Граница);
	ЗапросПоПартиям.УстановитьПараметр("Регистратор", СтруктураДополнительныеСвойства.ДляПроведения.ссылка);
	ЗапросПоПартиям.МенеджерВременныхТаблиц = МенеджерВременнойТаблицы;     
	ОстаткиПартий = ЗапросПоПартиям.Выполнить().Выгрузить();
    Таблица = Новый ТаблицаЗначений;	
    НеКонтроллироватьОстатки = Константы.НеКонтроллироватьОстатки.Получить();
	
	Счетчик = 0;
    Для Каждого СтрокаНоменклатуры Из ТаблицаНоменклатуры Цикл 		
			
		ОсталосьСписатьКоличество = СтрокаНоменклатуры.Количество;
		
		Если ОсталосьСписатьКоличество <=0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОтборПоНоменклатуре = Новый Структура("Номенклатура, СтруктурнаяЕдиница, Склад, Партия", СтрокаНоменклатуры.Номенклатура, СтрокаНоменклатуры.СтруктурнаяЕдиница, СтрокаНоменклатуры.Склад, СтрокаНоменклатуры.Партия );
		Если ЗначениеЗаполнено(СтрокаНоменклатуры.ОснованиеВозврата) Тогда
			ОтборПоНоменклатуре.Вставить("ДокументПоступления", СтрокаНоменклатуры.ОснованиеВозврата)
		КонецЕсли;
		НоменклатураТаблицаПартий = ОстаткиПартий.НайтиСтроки(ОтборПоНоменклатуре);		
		
		НомерПартии = 0;
		Пока ОсталосьСписатьКоличество > 0 И НомерПартии < (НоменклатураТаблицаПартий.Количество())  Цикл
			ТекущаяПартия = НоменклатураТаблицаПартий[НомерПартии];
			Если ТекущаяПартия.Количество > 0 Тогда
			  	СписываемоеКоличество = ?( ОсталосьСписатьКоличество <= ТекущаяПартия.Количество, ОсталосьСписатьКоличество, ТекущаяПартия.Количество);	
				
				НоваяСтрока                     = ТаблицаДвижений.Добавить();
				НоваяСтрока.Период              = СтруктураДополнительныеСвойства.ДляПроведения.Дата;
				НоваяСтрока.ВидДвижения         = ВидДвиженияНакопления.Расход;
				НоваяСтрока.ДокументПоступления = ТекущаяПартия.ДокументПоступления;
				НоваяСтрока.Номенклатура        = ТекущаяПартия.Номенклатура;
				НоваяСтрока.СтруктурнаяЕдиница  = ТекущаяПартия.СтруктурнаяЕдиница;
				НоваяСтрока.Склад               = ТекущаяПартия.Склад;
				НоваяСтрока.Партия              = ТекущаяПартия.Партия;
				НоваяСтрока.Количество          = СписываемоеКоличество;	
				
				Если СпособОценкиМПЗ = Перечисления.СпособОценки.ПоСредней Тогда
					Если (НомерПартии = НоменклатураТаблицаПартий.Количество()-1)
						И (ТекущаяПартия.Количество = СписываемоеКоличество) Тогда
						СтоимостьСредняя =0;
						Для Каждого СтрокаМассив Из НоменклатураТаблицаПартий Цикл   			
							СтоимостьСредняя = СтоимостьСредняя   + СтрокаМассив.Стоимость;
						КонецЦикла;	
						НоваяСтрока.Стоимость = СтоимостьСредняя;	 						
					Иначе
						НоваяСтрока.Стоимость = ТекущаяПартия.Цена * СписываемоеКоличество;
					КонецЕсли;
				Иначе
					Если СписываемоеКоличество = ТекущаяПартия.Количество Тогда
						НоваяСтрока.Стоимость = ТекущаяПартия.Стоимость;                     
					Иначе
						НоваяСтрока.Стоимость = СписываемоеКоличество * (ТекущаяПартия.Стоимость / ?(ТекущаяПартия.Количество = 0, 1, ТекущаяПартия.Количество));				
					КонецЕсли;
				КонецЕсли;
				
				Если СтруктураДополнительныеСвойства.ДляПроведения.Свойство("ВыполнятьДвиженияСебестоимость")
					И (СтрокаНоменклатуры.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас
					ИЛИ СтрокаНоменклатуры.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал) Тогда
					мНоваяСтрока = ТаблицаДвиженийПродажи.Добавить();
					мНоваяСтрока.ДокументПродажи    = СтрокаНоменклатуры.ДокументПродажиСебестоимость;
					мНоваяСтрока.Период             = СтруктураДополнительныеСвойства.ДляПроведения.Дата;
					мНоваяСтрока.СтруктурнаяЕдиница = СтрокаНоменклатуры.СтруктурнаяЕдиница;
					мНоваяСтрока.Контрагент         = СтрокаНоменклатуры.Контрагент;
					Если ЗначениеЗаполнено(СтрокаНоменклатуры.Услуга) Тогда
						мНоваяСтрока.Номенклатура = СтрокаНоменклатуры.Услуга;
						мНоваяСтрока.Материал     = ТекущаяПартия.Номенклатура;
						мНоваяСтрока.Склад        = Справочники.Склады.ПустаяСсылка();
					Иначе
						мНоваяСтрока.Номенклатура       = ТекущаяПартия.Номенклатура;
						мНоваяСтрока.Склад              = ТекущаяПартия.Склад;
					КонецЕсли;
					мНоваяСтрока.Партия             = ТекущаяПартия.Партия;
					мНоваяСтрока.Количество         = СписываемоеКоличество;
					мНоваяСтрока.Сотрудник          = СтрокаНоменклатуры.Сотрудник;
					мНоваяСтрока.Ассистент          = СтрокаНоменклатуры.Ассистент;
					мНоваяСтрока.ЗубнойТехник       = СтрокаНоменклатуры.ЗубнойТехник;
					Если СпособОценкиМПЗ = Перечисления.СпособОценки.ПоСредней Тогда
						Если (НомерПартии = НоменклатураТаблицаПартий.Количество()-1)
							И (ТекущаяПартия.Количество = СписываемоеКоличество) Тогда
							мНоваяСтрока.Стоимость = ОстаткиПартий.Итог("Стоимость"); 						
						Иначе
							мНоваяСтрока.Стоимость = ТекущаяПартия.Цена * СписываемоеКоличество;
						КонецЕсли;
					Иначе
						Если СписываемоеКоличество = ТекущаяПартия.Количество Тогда
							мНоваяСтрока.Стоимость = ТекущаяПартия.Стоимость;
						Иначе
							мНоваяСтрока.Стоимость = СписываемоеКоличество * (ТекущаяПартия.Стоимость / ?(ТекущаяПартия.Количество = 0, 1, ТекущаяПартия.Количество));				
						КонецЕсли;
					КонецЕсли;					
				КонецЕсли;
				
				
				ТекущаяПартия.Стоимость   = ТекущаяПартия.Стоимость - НоваяСтрока.Стоимость;
				ТекущаяПартия.Количество  = ТекущаяПартия.Количество - НоваяСтрока.Количество;				
				ОсталосьСписатьКоличество = ОсталосьСписатьКоличество - СписываемоеКоличество;
			КонецЕсли;
			НомерПартии = НомерПартии + 1;
		КонецЦикла;		
			
		Если ОсталосьСписатьКоличество > 0 Тогда
			
			Отказ = Не НеКонтроллироватьОстатки;
			КоличествоДосупнойНоменклатуры = СтрокаНоменклатуры.Количество - ОсталосьСписатьКоличество;
			
			Если Отказ = Истина Тогда 
				
				СтрокаПартия = ?(ЗначениеЗаполнено(СтрокаНоменклатуры.Партия), "<"+СтрокаНоменклатуры.Партия+">", "");
				ЕИ = Справочники.КлассификаторЕдиницИзмерения.ПолучитьНаименованиеЕдиницыИзмеренияНоменклатуры(СтрокаНоменклатуры.Номенклатура,"шт");
				
				ТекстОшибки = "Не списано по партиям! """+ СтрокаНоменклатуры.Номенклатура + """ "+ СтрокаПартия +" на складе " + СтрокаНоменклатуры.Склад + " в структурной единице " + СтрокаНоменклатуры.СтруктурнаяЕдиница + " недостаточно.
				|		Остаток " + КоличествоДосупнойНоменклатуры +  " " + ЕИ +"; Требуется " + СтрокаНоменклатуры.Количество + " " + ЕИ + "; Не хватает " + (ОсталосьСписатьКоличество) + " " + ЕИ;						
				ОбменДаннымиСервер.СообщитьОбОшибке(ТекстОшибки);
				
			КонецЕсли;

		КонецЕсли; 
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	ТаблицаДвижений.Свернуть("Период, ВидДвижения, ДокументПоступления, Номенклатура, Склад, СтруктурнаяЕдиница, Партия", "Количество, Стоимость");
	
	Если СтруктураДополнительныеСвойства.ДляПроведения.Свойство("СкладПолучатель") И СтруктураДополнительныеСвойства.ДляПроведения.Свойство("СтруктурнаяЕдиницаПолучатель") Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СкладПолучатель",СтруктураДополнительныеСвойства.ДляПроведения.СкладПолучатель);
		Запрос.УстановитьПараметр("СтруктурнаяЕдиницаПолучатель",СтруктураДополнительныеСвойства.ДляПроведения.СтруктурнаяЕдиницаПолучатель);
		Запрос.МенеджерВременныхТаблиц = ВыбратьТЗВВременнуюТаблицу(ТаблицаДвижений, "ТаблицаДвижений");
		Запрос.Текст = ПолучитьЗапросПартийДляПеремещения();
		ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
    СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваров", ТаблицаДвижений);
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажиСебестоимость", ТаблицаДвиженийПродажи);
	 
КонецПроцедуры

// Процедура выполняет возврат товаров по партиям
// Параметры:
// 		ТаблицаСписанияНоменклатуры - Таблица или табличная часть с номенклатурой;
//		СтруктураДополнительныеСвойства - структура, дополнительные свойства;
//      Движения - Движения документа по регистрам;
//      Отказ    - Отказ продедения;
Процедура СформироватьТаблицуВозвратаПартииТоваров(ТаблицаСписанияНоменклатуры, СтруктураДополнительныеСвойства, Движения, Отказ) Экспорт
	
	НаборДвижений   = Движения.ПартииТоваров;
    ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки("НомерСтроки,Период, ВидДвижения, ДокументПоступления, Номенклатура, Склад, СтруктурнаяЕдиница, Партия, Количество, Стоимость");
	
	Если  СтруктураДополнительныеСвойства.ДляПроведения.Свойство("ВыполнятьДвиженияСебестоимость") Тогда
		НаборДвижений   = Движения.ПродажиСебестоимость;
		ТаблицаДвиженийПродажи = НаборДвижений.ВыгрузитьКолонки("НомерСтроки,Период, Контрагент, ДокументПродажи, Номенклатура, Склад, Партия, СтруктурнаяЕдиница, Сотрудник, Ассистент, ЗубнойТехник, Количество, Стоимость");
	КонецЕсли;
	
	СпособОценкиМПЗ = Константы.СпособОценкиМПЗ.Получить();
	Если Не ЗначениеЗаполнено(СпособОценкиМПЗ) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена стратегия списания партий товаров!");
        СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваров", ТаблицаДвижений);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ТаблицаНоменклатуры = ПодготовитьТалицуКСписаниюОприходованиюПартий(ТаблицаСписанияНоменклатуры,СтруктураДополнительныеСвойства);		

	ЗапросПоПартиям = ПолучитьЗапросПартийДляВозврата(СпособОценкиМПЗ);
	МенеджерВременнойТаблицы = ВыбратьТЗВВременнуюТаблицу(ТаблицаНоменклатуры, "ТаблицаНоменклатуры");
	ЗапросПоПартиям.МенеджерВременныхТаблиц = МенеджерВременнойТаблицы;
	ТаблицаПартий = ЗапросПоПартиям.Выполнить().Выгрузить();	
	
	Для Каждого СтрокаНоменклатуры Из ТаблицаНоменклатуры Цикл
		
		Если ЗначениеЗаполнено(СтрокаНоменклатуры.ОснованиеВозврата) Тогда			
			
			ОсталосьВернутьКоличество = СтрокаНоменклатуры.Количество; 			
			
			ОтборПоНоменклатуре = Новый Структура("Номенклатура, Партия", СтрокаНоменклатуры.Номенклатура, СтрокаНоменклатуры.Партия);	
			ОтборПоНоменклатуре.Вставить("ОснованиеВозврата", СтрокаНоменклатуры.ОснованиеВозврата);
			НоменклатураТаблицаПартий = ТаблицаПартий.НайтиСтроки(ОтборПоНоменклатуре);			
			
			Если ОсталосьВернутьКоличество <=0 Тогда
				Продолжить;
			КонецЕсли;
			
			НомерПартии = 0;
			Пока  ОсталосьВернутьКоличество > 0 и НомерПартии < (НоменклатураТаблицаПартий.Количество())  Цикл
				ТекущаяПартия = НоменклатураТаблицаПартий[НомерПартии];
				Если ТекущаяПартия.Количество > 0 Тогда
					СписываемоеКоличество = ?( ОсталосьВернутьКоличество <= ТекущаяПартия.Количество, ОсталосьВернутьКоличество, ТекущаяПартия.Количество);				
					НоваяСтрока = ТаблицаДвижений.Добавить();
					НоваяСтрока.Период              = СтруктураДополнительныеСвойства.ДляПроведения.Дата;
        			НоваяСтрока.ВидДвижения         = ВидДвиженияНакопления.Приход;
					НоваяСтрока.ДокументПоступления = ТекущаяПартия.ДокументПоступления;
					НоваяСтрока.Номенклатура        = ТекущаяПартия.Номенклатура;
					НоваяСтрока.Партия              = ТекущаяПартия.Партия;
					НоваяСтрока.Количество          = СписываемоеКоличество;
					НоваяСтрока.СтруктурнаяЕдиница  = СтрокаНоменклатуры.СтруктурнаяЕдиница;
					НоваяСтрока.Склад               = СтрокаНоменклатуры.Склад;
					Если СписываемоеКоличество = ТекущаяПартия.Количество Тогда
						НоваяСтрока.Стоимость = ТекущаяПартия.Стоимость;
					Иначе
						НоваяСтрока.Стоимость = СписываемоеКоличество * (ТекущаяПартия.Стоимость / ТекущаяПартия.Количество);				
					КонецЕсли;
					
					Если  СтруктураДополнительныеСвойства.ДляПроведения.Свойство("ВыполнятьДвиженияСебестоимость") и (СтрокаНоменклатуры.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас
						ИЛИ СтрокаНоменклатуры.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал) Тогда
						мНоваяСтрока                    = ТаблицаДвиженийПродажи.Добавить();
						мНоваяСтрока.Период             = СтруктураДополнительныеСвойства.ДляПроведения.Дата;						
						мНоваяСтрока.Номенклатура       = СтрокаНоменклатуры.Номенклатура;
						мНоваяСтрока.Количество         = СписываемоеКоличество * (-1);
						Если СписываемоеКоличество = ТекущаяПартия.Количество Тогда
							мНоваяСтрока.Стоимость = ТекущаяПартия.Стоимость * (-1);
						Иначе
							мНоваяСтрока.Стоимость = СписываемоеКоличество * (ТекущаяПартия.Стоимость / ТекущаяПартия.Количество)*(-1);				
						КонецЕсли;			
						мНоваяСтрока.Контрагент         = СтрокаНоменклатуры.Контрагент;
						мНоваяСтрока.СтруктурнаяЕдиница = СтрокаНоменклатуры.СтруктурнаяЕдиница;
						мНоваяСтрока.ДокументПродажи    = СтрокаНоменклатуры.ДокументПродажи;
						мНоваяСтрока.Склад              = СтрокаНоменклатуры.Склад;
						мНоваяСтрока.Сотрудник          = СтрокаНоменклатуры.Сотрудник; 
						мНоваяСтрока.Ассистент          = СтрокаНоменклатуры.Ассистент;
						мНоваяСтрока.ЗубнойТехник       = СтрокаНоменклатуры.ЗубнойТехник;
					КонецЕсли;
					
					ТекущаяПартия.Стоимость = ТекущаяПартия.Стоимость - НоваяСтрока.Стоимость;
					ТекущаяПартия.Количество = ТекущаяПартия.Количество - НоваяСтрока.Количество;				
					ОсталосьВернутьКоличество = ОсталосьВернутьКоличество - СписываемоеКоличество;
				КонецЕсли;
				НомерПартии = НомерПартии + 1;
				
			КонецЦикла;
		Иначе
			НоваяСтрокаТовара = ТаблицаДвижений.Добавить(); 
			НоваяСтрокаТовара.Период             = СтруктураДополнительныеСвойства.ДляПроведения.Дата;
			НоваяСтрокаТовара.ВидДвижения        = ВидДвиженияНакопления.Приход;
			НоваяСтрокаТовара.ДокументПоступления= СтруктураДополнительныеСвойства.ДляПроведения.Ссылка;
			НоваяСтрокаТовара.СтруктурнаяЕдиница = СтрокаНоменклатуры.СтруктурнаяЕдиница;
			НоваяСтрокаТовара.Склад		 	 	 = СтрокаНоменклатуры.Склад;
			НоваяСтрокаТовара.Номенклатура    	 = СтрокаНоменклатуры.Номенклатура;
			НоваяСтрокаТовара.Партия             = СтрокаНоменклатуры.Партия;
			НоваяСтрокаТовара.Количество         = СтрокаНоменклатуры.Количество;
			НоваяСтрокаТовара.Стоимость	     	 = СтрокаНоменклатуры.Себестоимость*СтрокаНоменклатуры.Количество;			
			ОсталосьВернутьКоличество = 0;
			
			Если  СтруктураДополнительныеСвойства.ДляПроведения.Свойство("ВыполнятьДвиженияСебестоимость") и (СтрокаНоменклатуры.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас
				ИЛИ СтрокаНоменклатуры.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал) Тогда
				мНоваяСтрока                    = ТаблицаДвиженийПродажи.Добавить();
				мНоваяСтрока.Период             = СтруктураДополнительныеСвойства.ДляПроведения.Дата;		
				мНоваяСтрока.Номенклатура       = СтрокаНоменклатуры.Номенклатура;
				мНоваяСтрока.Количество         = СтрокаНоменклатуры.Количество * (-1);
				мНоваяСтрока.Стоимость          = СтрокаНоменклатуры.Себестоимость*СтрокаНоменклатуры.Количество * (-1);				
				мНоваяСтрока.Контрагент         = СтрокаНоменклатуры.Контрагент;
				мНоваяСтрока.СтруктурнаяЕдиница = СтрокаНоменклатуры.СтруктурнаяЕдиница;
				мНоваяСтрока.ДокументПродажи    = СтрокаНоменклатуры.ДокументПродажи;
				мНоваяСтрока.Сотрудник          = СтрокаНоменклатуры.Сотрудник;
				мНоваяСтрока.Ассистент          = СтрокаНоменклатуры.Ассистент;
				мНоваяСтрока.ЗубнойТехник       = СтрокаНоменклатуры.ЗубнойТехник;
			КонецЕсли;

		КонецЕсли;
		
		// Если  ОсталосьВернутьКоличество > 0 Тогда
		//	Отказ = Истина;
		//	КоличествоДосупнойНоменклатуры = СтрокаНоменклатуры.Количество - ОсталосьВернутьКоличество;
		//	
		//	СтрокаПартия = ?(ЗначениеЗаполнено(СтрокаНоменклатуры.Партия), "<"+СтрокаНоменклатуры.Партия+">", "");
		//	ЕИ = Справочники.КлассификаторЕдиницИзмерения.ПолучитьНаименованиеЕдиницыИзмеренияНоменклатуры(СтрокаНоменклатуры.Номенклатура,"шт");
		//	
		//	ТекстОшибки = "Остатка " + СтрокаНоменклатуры.Номенклатура + """ "+СтрокаПартия+" на складе " + СтрокаНоменклатуры.Склад + " в структурной единице " + СтрокаНоменклатуры.СтруктурнаяЕдиница
		//			+ ?(ЗначениеЗаполнено(СтрокаНоменклатуры.ОснованиеВозврата), " с основанием " + СтрокаНоменклатуры.ОснованиеВозврата, "") + " недостаточно.
		//			|		Остаток " + КоличествоДосупнойНоменклатуры +" " + ЕИ + "; Требуется " + СтрокаНоменклатуры.Количество + " " + ЕИ +"; Не хватает " + (ОсталосьВернутьКоличество) + " " + ЕИ;
		//	ОбменДаннымиСервер.СообщитьОбОшибке(ТекстОшибки);

		// КонецЕсли; 		
	КонецЦикла;

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваров", ТаблицаДвижений);
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажиСебестоимость", ТаблицаДвиженийПродажи);
	
КонецПроцедуры
 
// Функция возвращает запрос по партиям товаров для списания
// Параметры:
// 		СпособОценкиМПЗ - Способ списания
//
Функция ПолучитьЗапросПартийДляСписания(СпособОценкиМПЗ)

	Запрос = Новый Запрос;
	Если  СпособОценкиМПЗ = Перечисления.СпособОценки.ПоСредней Тогда
    Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                 |	х_ПартииТоваровОбороты.Номенклатура КАК Номенклатура,
                 |	х_ПартииТоваровОбороты.СтруктурнаяЕдиница,
				 |	х_ПартииТоваровОбороты.Склад,
                 |	х_ПартииТоваровОбороты.Партия,
                 |	СУММА(х_ПартииТоваровОбороты.КоличествоОборот) КАК Количество,
                 |	СУММА(х_ПартииТоваровОбороты.СтоимостьОборот) КАК Стоимость,
                 |	ВЫРАЗИТЬ(ЦенаНоменклатуры.ЦЕНА КАК ЧИСЛО(15, 2)) КАК Цена,
                 |	х_ПартииТоваровОбороты.ДокументПоступления КАК ДокументПоступления
                 |ИЗ
                 |	РегистрНакопления.ПартииТоваров.Обороты(
                 |			,
                 |			&Дата,
                 |			Регистратор,
                 |			(Номенклатура, СтруктурнаяЕдиница, Склад) В
                 |				(ВЫБРАТЬ
                 |					ТаблицаНоменклатуры.Номенклатура,
                 |					ТаблицаНоменклатуры.СтруктурнаяЕдиница,
				 |					ТаблицаНоменклатуры.Склад
                 |				ИЗ
                 |					ТаблицаНоменклатуры)) КАК х_ПартииТоваровОбороты
                 |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                 |			х_ПартииТоваровОстаткиИОбороты.Номенклатура КАК Номенклатура,
                 |			х_ПартииТоваровОстаткиИОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
				 |			х_ПартииТоваровОстаткиИОбороты.Склад КАК Склад,
                 |			х_ПартииТоваровОстаткиИОбороты.Партия КАК Партия,
                 |			СУММА(х_ПартииТоваровОстаткиИОбороты.СтоимостьОборот) / ВЫБОР КОГДА ЕСТЬNULL(СУММА(х_ПартииТоваровОстаткиИОбороты.КоличествоОборот), 1)=0 ТОГДА 1 ИНАЧЕ  ЕСТЬNULL(СУММА(х_ПартииТоваровОстаткиИОбороты.КоличествоОборот), 1) КОНЕЦ КАК ЦЕНА
                 |		ИЗ
                 |			РегистрНакопления.ПартииТоваров.ОстаткиИОбороты(
                 |					,
                 |					&Дата,
                 |					Регистратор,
                 |					,
                 |					(Номенклатура, СтруктурнаяЕдиница, Склад) В
                 |						(ВЫБРАТЬ
                 |							ТаблицаНоменклатуры.Номенклатура,
				 |							ТаблицаНоменклатуры.СтруктурнаяЕдиница,				 
                 |							ТаблицаНоменклатуры.Склад
                 |						ИЗ
                 |							ТаблицаНоменклатуры)) КАК х_ПартииТоваровОстаткиИОбороты
                 |		ГДЕ
                 |			х_ПартииТоваровОстаткиИОбороты.Регистратор <> &Регистратор
                 |		
                 |		СГРУППИРОВАТЬ ПО
                 |			х_ПартииТоваровОстаткиИОбороты.Номенклатура,
                 |			х_ПартииТоваровОстаткиИОбороты.СтруктурнаяЕдиница,
				 |			х_ПартииТоваровОстаткиИОбороты.Склад,
                 |			х_ПартииТоваровОстаткиИОбороты.Партия) КАК ЦенаНоменклатуры
                 |		ПО х_ПартииТоваровОбороты.Номенклатура = ЦенаНоменклатуры.Номенклатура
				 |			И х_ПартииТоваровОбороты.СтруктурнаяЕдиница = ЦенаНоменклатуры.СтруктурнаяЕдиница
                 |			И х_ПартииТоваровОбороты.Склад = ЦенаНоменклатуры.Склад
                 |			И х_ПартииТоваровОбороты.Партия = ЦенаНоменклатуры.Партия
                 |ГДЕ
                 |	х_ПартииТоваровОбороты.Регистратор <> &Регистратор
                 |
                 |СГРУППИРОВАТЬ ПО
                 |	х_ПартииТоваровОбороты.ДокументПоступления,
                 |	х_ПартииТоваровОбороты.Номенклатура,
				 |	х_ПартииТоваровОбороты.СтруктурнаяЕдиница,
                 |	х_ПартииТоваровОбороты.Склад,
                 |	х_ПартииТоваровОбороты.Партия,
                 |	ВЫРАЗИТЬ(ЦенаНоменклатуры.ЦЕНА КАК ЧИСЛО(15, 2))
                 |
                 |УПОРЯДОЧИТЬ ПО
                 |	Номенклатура,
                 |	х_ПартииТоваровОбороты.ДокументПоступления.Дата,
                 |	ДокументПоступления";  	
		
	Иначе
	Запрос.Текст = "ВЫБРАТЬ
	             |	ПартииТоваровОстатки.ДокументПоступления КАК ДокументПоступления,
	             |	ПартииТоваровОстатки.Номенклатура КАК Номенклатура,
	             |	СУММА(ПартииТоваровОстатки.КоличествоОборот) КАК Количество,
	             |	СУММА(ПартииТоваровОстатки.СтоимостьОборот) КАК Стоимость,
	             |	ПартииТоваровОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
				 |	ПартииТоваровОстатки.Склад КАК Склад,
	             |	ПартииТоваровОстатки.Партия
	             |ИЗ
	             |	РегистрНакопления.ПартииТоваров.ОстаткиИОбороты(, &Дата, Регистратор, , ) КАК ПартииТоваровОстатки
	             |ГДЕ
	             |	(ПартииТоваровОстатки.Номенклатура, ПартииТоваровОстатки.СтруктурнаяЕдиница, ПартииТоваровОстатки.Склад) В
	             |			(ВЫБРАТЬ
	             |				ТаблицаНоменклатуры.Номенклатура,
	             |				ТаблицаНоменклатуры.СтруктурнаяЕдиница,
				 |				ТаблицаНоменклатуры.Склад
	             |			ИЗ
	             |				ТаблицаНоменклатуры)
	             |	И ПартииТоваровОстатки.Регистратор <> &Регистратор
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ПартииТоваровОстатки.ДокументПоступления,
	             |	ПартииТоваровОстатки.Номенклатура,
	             |	ПартииТоваровОстатки.СтруктурнаяЕдиница,
				 |	ПартииТоваровОстатки.Склад,
	             |	ПартииТоваровОстатки.Партия          
			     |УПОРЯДОЧИТЬ ПО
			     |  Номенклатура,
			   	 |	ПартииТоваровОстатки.ДокументПоступления.Дата,
			     |	ПартииТоваровОстатки.ДокументПоступления";	
	КонецЕсли;

	Возврат Запрос;
	
КонецФункции // ПолучитьЗапросПартийДляСписания()

// Функция возвращает запрос по партиям товаров для возврата
// Параметры:
// 		СпособОценкиМПЗ - Способ списания
//
Функция ПолучитьЗапросПартийДляВозврата(СпособОценкиМПЗ)
	
	Запрос=новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ПартииТоваров.Регистратор КАК ОснованиеВозврата,
	             |	ПартииТоваров.Партия,
	             |	ПартииТоваров.ДокументПоступления,
	             |	ПартииТоваров.Номенклатура,
	             |	ПартииТоваров.Количество,
	             |	ПартииТоваров.Стоимость
	             |ИЗ
	             |	РегистрНакопления.ПартииТоваров КАК ПартииТоваров
	             |ГДЕ
	             |	(ПартииТоваров.Регистратор, ПартииТоваров.Номенклатура) В
	             |			(ВЫБРАТЬ
	             |				ТаблицаНоменклатуры.ОснованиеВозврата,
	             |				ТаблицаНоменклатуры.Номенклатура
	             |			ИЗ
	             |				ТаблицаНоменклатуры)"; 
	
	Возврат Запрос;

	
КонецФункции

// Процедура подготавливает табличную часть или таблицу к списанию, записывая результат в ТаблицаСписания
// Параметры:
// 		ТаблицаСписанияНоменклатуры - Таблица или табличная часть с номенклатурой;
// 		СтруктураДополнительныеСвойства - структура, дополнительные свойства.
//
Функция ПодготовитьТалицуКСписаниюОприходованиюПартий(ТаблицаСписанияНоменклатуры, СтруктураДополнительныеСвойства)
	
	СтруктураПолей = Новый Структура("Номенклатура, Склад, Количество, ОснованиеВозврата, Себестоимость, Партия, СтруктурнаяЕдиница", "Номенклатура", "ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)","Количество", """""", """""", "Партия", "ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)");
	СтруктураПолей.Вставить("ДокументПродажи", """""");
	СтруктураПолей.Вставить("ДокументПродажиСебестоимость", """""");
	СтруктураПолей.Вставить("Контрагент", "ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)");
	СтруктураПолей.Вставить("Сотрудник", "ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)");
	СтруктураПолей.Вставить("Ассистент", "ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)");
	СтруктураПолей.Вставить("ЗубнойТехник", "ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)");
	СтруктураПолей.Вставить("Услуга", "ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)");
	
	Если  СтруктураДополнительныеСвойства.Свойство("СтруктураПолейПерегрузка") и СтруктураДополнительныеСвойства.СтруктураПолейПерегрузка <> Неопределено Тогда
		Для каждого Реквизит Из СтруктураДополнительныеСвойства.СтруктураПолейПерегрузка Цикл
			Если СтруктураПолей.Свойство(Реквизит.Ключ) = Истина Тогда
				СтруктураПолей.Удалить(Реквизит.Ключ);
				СтруктураПолей.Вставить(Реквизит.Ключ, Реквизит.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ВыбранныеПоляЗапроса = "";
	Для Каждого Реквизит Из СтруктураПолей Цикл
		ВыбранныеПоляЗапроса  = ВыбранныеПоляЗапроса + ",
			|	" + Реквизит.Значение + " КАК " + СокрЛП(Реквизит.Ключ);
	КонецЦикла;

	Запрос = Новый Запрос;	
	Запрос.Текст = "
		|ВЫБРАТЬ 
		|	0 КАК НомерСтроки" + ВыбранныеПоляЗапроса + "
		|ПОМЕСТИТЬ Таб
		|ИЗ &ТаблицаСписанияНоменклатуры КАК ТабНом";
	Запрос.УстановитьПараметр("ТаблицаСписанияНоменклатуры", ТаблицаСписанияНоменклатуры);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Склад", СтруктураДополнительныеСвойства.ДляПроведения.Склад);
	Если  ТипЗнч(СтруктураДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.Реализация") или ТипЗнч(СтруктураДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.Прием") Тогда
		Запрос.УстановитьПараметр("Сотрудник", СтруктураДополнительныеСвойства.ДляПроведения.Ссылка.Сотрудник);
	Иначе
		Запрос.УстановитьПараметр("Сотрудник", Справочники.Сотрудники.ПустаяСсылка());
	КонецЕсли;	
	Если  ТипЗнч(СтруктураДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.ВозвратОтПокупателя") или ТипЗнч(СтруктураДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.Прием") Тогда
		Запрос.УстановитьПараметр("Ассистент", СтруктураДополнительныеСвойства.ДляПроведения.Ссылка.Ассистент);
	Иначе
		Запрос.УстановитьПараметр("Ассистент", Справочники.Сотрудники.ПустаяСсылка());
	КонецЕсли;
	Если  ТипЗнч(СтруктураДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.ПеремещениеЗапасов") или 
		  ТипЗнч(СтруктураДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.СписаниеМатериалов") или
		  ТипЗнч(СтруктураДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.СписаниеЗапасов")Тогда
		Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	Иначе
		Запрос.УстановитьПараметр("Контрагент", СтруктураДополнительныеСвойства.ДляПроведения.Ссылка.Контрагент);
	КонецЕсли;
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктураДополнительныеСвойства.ДляПроведения.Ссылка.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ДокументПродажи", СтруктураДополнительныеСвойства.ДляПроведения.Ссылка);
	Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ		
		|	Номенклатура 		КАК Номенклатура,
		|   ВЫБОР КОГДА Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) ИЛИ Склад = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) ИЛИ Склад ЕСТЬ NULL ИЛИ Склад = НЕОПРЕДЕЛЕНО ТОГДА
		|   &Склад ИНАЧЕ Склад  КОНЕЦ КАК Склад,
		|   Количество          КАК Количество,
		|   ОснованиеВозврата   КАК ОснованиеВозврата,
		|   Себестоимость       КАК Себестоимость,
		|   Партия              КАК Партия,
		|   Услуга              КАК Услуга,
		|   ВЫБОР КОГДА СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) ТОГДА
		|   &СтруктурнаяЕдиница ИНАЧЕ СтруктурнаяЕдиница КОНЕЦ КАК СтруктурнаяЕдиница,
		|   ВЫБОР КОГДА Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|   &Контрагент ИНАЧЕ Контрагент КОНЕЦ КАК Контрагент,
		|   ВЫБОР КОГДА Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) ТОГДА
		|   &Сотрудник ИНАЧЕ Сотрудник КОНЕЦ КАК Сотрудник,
		|   ВЫБОР КОГДА Ассистент = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|		ТОГДА " + ?(ТипЗнч(СтруктураДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.СписаниеМатериалов"), "ДокументПродажи.Ассистент", "&Ассистент") + " 
		|	ИНАЧЕ Ассистент Конец КАК Ассистент,
		|   ЗубнойТехник КАК ЗубнойТехник,
		|   ВЫБОР КОГДА ДокументПродажи = """" ТОГДА &ДокументПродажи 
		|   ИНАЧЕ ДокументПродажи КОНЕЦ КАК ДокументПродажи,
		|   ВЫБОР КОГДА ДокументПродажиСебестоимость = """" ТОГДА
		|   ВЫБОР КОГДА ДокументПродажи = """" ТОГДА &ДокументПродажи 
		|   ИНАЧЕ ДокументПродажи КОНЕЦ
		|   ИНАЧЕ ДокументПродажиСебестоимость КОНЕЦ КАК ДокументПродажиСебестоимость
		|ИЗ Таб КАК ТабСпис
		|ГДЕ Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас) ИЛИ Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Материал) ИЛИ Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат) ИЛИ Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Имущество) 
		|";
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Возврат Таблица;
	
КонецФункции

// Функция загружает Табличную часть во временную таблицу
// Параметры:
// 		ТаблицаЗначений - Таблица значений для загрузки во временную таблицу
// 		ИмяТаблицы - Строка, Имя ттаблицы в которую следует загрузить таблицу значений
// Возвращаемое значение:
//		МенеджерВременныхТаблиц, Менеджер временных таблиц с временной таблицой
//
Функция ВыбратьТЗВВременнуюТаблицу(ТаблицаЗначений, ИмяТаблицы) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаЗначений", ТаблицаЗначений);
	Запрос.Текст = "
		|ВЫБРАТЬ ТаблицаЗначений.*
		|ПОМЕСТИТЬ " + ИмяТаблицы + "
		|ИЗ &ТаблицаЗначений КАК ТаблицаЗначений";
	Запрос.Выполнить();
	
	Возврат(Запрос.МенеджерВременныхТаблиц);
	
КонецФункции // ВыбратьТЗВВременнуюТаблицу()

// Функция возвращает запрос по партиям товаров для перемещения
// Параметры:
Функция ПолучитьЗапросПартийДляПеремещения()
	
	Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	ТаблицаДвижений.Период,
	        |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	        |	ТаблицаДвижений.ДокументПоступления,
	        |	ТаблицаДвижений.Номенклатура,
	        |	ТаблицаДвижений.СтруктурнаяЕдиница,
			|	ТаблицаДвижений.Склад,
	        |	ТаблицаДвижений.Партия,
	        |	ТаблицаДвижений.Количество,
	        |	ТаблицаДвижений.Стоимость
	        |ИЗ
	        |	ТаблицаДвижений КАК ТаблицаДвижений
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ТаблицаДвижений.Период,
	        |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	        |	ТаблицаДвижений.ДокументПоступления,
	        |	ТаблицаДвижений.Номенклатура,
			|	&СтруктурнаяЕдиницаПолучатель,
			|	&СкладПолучатель,
	        |	ТаблицаДвижений.Партия,
	        |	ТаблицаДвижений.Количество,
	        |	ТаблицаДвижений.Стоимость
	        |ИЗ
	        |	ТаблицаДвижений КАК ТаблицаДвижений";
	Возврат Текст;
	
КонецФункции

// Функция - Контроль отрицательных остатков
//
// Параметры:
//  ЭтотОбъект	 - 	 - 
//  ТекстОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция КонтрольОтрицательныхОстатков(ЭтотОбъект) Экспорт

	Если ЭтотОбъект.Дата > ТекущаяДатаСеанса() Или НачалоДня(ЭтотОбъект.Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда
		ДатаОстатков			= ТекущаяДатаСеанса();
		ИсключитьРегистратор	= ЭтотОбъект.Проведен;
	Иначе
		ДатаОстатков			= Новый Граница(ЭтотОбъект.Дата, ВидГраницы.Исключая);
		ИсключитьРегистратор	= Ложь;
	КонецЕсли;

		
	НеКонтролироватьОстатки  = Константы.НеКонтроллироватьОстатки.Получить();
	Запрос       			 = Новый Запрос;
    ТекстЗапроса 			 = ПолучитьТекстЗапроса(ЭтотОбъект, ИсключитьРегистратор);
	Запрос.Текст 			 = ТекстЗапроса; 
	ТаблицаЗапасы 			 = ЭтотОбъект.Запасы.Выгрузить();
	
	ТаблицаЗапасы.Колонки.Добавить("ТипНоменклатуры");
	
	Если ТаблицаЗапасы.Колонки.Найти("Склад") = Неопределено Тогда
		
		ТаблицаЗапасы.Колонки.Добавить("Склад");
		
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ТаблицаЗапасы Цикл
		
		СтрокаТЧ.ТипНоменклатуры  = СтрокаТЧ.Номенклатура.ТипНоменклатуры;
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Склад) Тогда
			
			СтрокаТЧ.Склад = ЭтотОбъект.Склад;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница" 				   , ЭтотОбъект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Склад"              				   , ЭтотОбъект.Склад);
	Запрос.УстановитьПараметр("Дата"              				   , ДатаОстатков);
	Запрос.УстановитьПараметр("ТаблицаЗапасы"      				   , ТаблицаЗапасы);
	Запрос.УстановитьПараметр("НеКонтролироватьОстаткиЗапасов"     , НеКонтролироватьОстатки);
	Запрос.УстановитьПараметр("Регистратор"                        , ЭтотОбъект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		//СтрокаПартия = ?(ЗначениеЗаполнено(Выборка.Партия), " <"+Выборка.Партия+">", "");
		СтрокаПартия = "";
		ЕИ           = Справочники.КлассификаторЕдиницИзмерения.ПолучитьНаименованиеЕдиницыИзмеренияНоменклатуры(Выборка.Номенклатура, "шт");
		ТекстОшибки  = "Остатка """ + Выборка.Номенклатура + """" + СтрокаПартия + 
			?(ЗначениеЗаполнено(Выборка.Склад), ?(ТипЗнч(Выборка.Склад) = Тип("СправочникСсылка.Склады"),
			" на складе ", " у сотрудника ") + Выборка.Склад, "") + " в клинике " + ЭтотОбъект.СтруктурнаяЕдиница + " недостаточно.
			|Остаток " + Выборка.КоличествоДосупнойНоменклатуры + " " + ЕИ + "; Требуется " + Выборка.Количество + " " + ЕИ + "; 
			|Не хватает " + (Выборка.ОсталосьСписать) + " "+ ЕИ;						
		
		Если Выборка.НомерСтроки > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Запасы["+(Выборка.НомерСтроки - 1)+"].КоличествоУпаковок", "Объект");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Не Результат.Пустой();
	
КонецФункции

// Функция - Получить текст запроса
//
// Параметры:
//  ЭтотОбъект			 - 	 - 
//  ИсключитьРегистратор - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТекстЗапроса(ЭтотОбъект, ИсключитьРегистратор)
	
	Если ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.ПеремещениеЗапасов") Тогда
		
		Текст  = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Склад КАК Склад,
		|	Запасы.Номенклатура КАК Номенклатура,
		|	Запасы.Партия КАК Партия,
		|	Запасы.Количество КАК Количество,
		|	Запасы.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ТаблицаНоменклатурыБезГруппировки
		|ИЗ
		|	&ТаблицаЗапасы КАК Запасы
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &НеКонтролироватьОстаткиЗапасов = ЛОЖЬ
		|				ТОГДА Запасы.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
		|						ИЛИ Запасы.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Имущество)
		|						ИЛИ Запасы.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Материал)
		|						ИЛИ Запасы.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Запасы.Склад КАК Склад,
		|	Запасы.Номенклатура КАК Номенклатура,
		|	Запасы.Партия КАК Партия,
		|	СУММА(Запасы.Количество) КАК Количество,
		|	МАКСИМУМ(Запасы.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ ТаблицаНоменклатуры
		|ИЗ
		|	ТаблицаНоменклатурыБезГруппировки КАК Запасы
		|
		|СГРУППИРОВАТЬ ПО
		|	Запасы.Номенклатура,
		|	Запасы.Склад,
		|	Запасы.Партия";
		
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Склад КАК Склад,
	|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТаблицаНоменклатуры.Партия КАК Партия,
	|	ТаблицаНоменклатуры.Количество КАК Количество,
	|	ЕСТЬNULL(ТаблицаОстатки.Количество, 0) КАК КоличествоДосупнойНоменклатуры,
	|	ТаблицаНоменклатуры.Количество - ЕСТЬNULL(ТаблицаОстатки.Количество, 0) КАК ОсталосьСписать,
	|	ТаблицаНоменклатуры.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатки КАК ТаблицаОстатки
	|		ПО ТаблицаНоменклатуры.Номенклатура = ТаблицаОстатки.Номенклатура
	|			И ТаблицаНоменклатуры.Склад = ТаблицаОстатки.Склад
	|			И ТаблицаНоменклатуры.Партия = ТаблицаОстатки.Партия
	|ГДЕ
	|	ТаблицаНоменклатуры.Количество > ЕСТЬNULL(ТаблицаОстатки.Количество, 0)";	
	
	Если Не ИсключитьРегистратор Тогда
		
		ТекстЗапросаОстатков =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗапасыОстатки.Склад КАК Склад,
		|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыОстатки.Партия КАК Партия,
		|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК Количество
		|ПОМЕСТИТЬ ТаблицаОстатки
		|ИЗ
		|	РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|			&Дата,
		|			(Номенклатура, Склад) В
		|					(ВЫБРАТЬ
		|						ТаблицаНоменклатуры.Номенклатура,
		|						ТаблицаНоменклатуры.Склад
		|					ИЗ
		|						ТаблицаНоменклатуры)
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ЗапасыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыОстатки.Партия,
		|	ЗапасыОстатки.Номенклатура,
		|	ЗапасыОстатки.Склад";

	Иначе
		
		ТекстЗапросаОстатков =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗапасыОбороты.Склад КАК Склад,
		|	ЗапасыОбороты.Номенклатура КАК Номенклатура,
		|	ЗапасыОбороты.Партия КАК Партия,
		|	СУММА(ЗапасыОбороты.КоличествоОборот) КАК Количество
		|ПОМЕСТИТЬ ТаблицаОстатки
		|ИЗ
		|	РегистрНакопления.ЗапасыНаСкладах.Обороты(
		|			,
		|			&Дата,
		|			Авто,
		|			(Номенклатура, Склад) В
		|					(ВЫБРАТЬ
		|						ТаблицаНоменклатуры.Номенклатура,
		|						ТаблицаНоменклатуры.Склад
		|					ИЗ
		|						ТаблицаНоменклатуры)
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ЗапасыОбороты
		|ГДЕ
		|	ЗапасыОбороты.Регистратор <> &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыОбороты.Партия,
		|	ЗапасыОбороты.Номенклатура,
		|	ЗапасыОбороты.Склад";
		
	КонецЕсли;
	
	ТекстЗапроса = Текст + Символы.ПС + ";" + Символы.ПС + ТекстЗапросаОстатков + Символы.ПС + ";" + Символы.ПС + ТекстЗапроса;  
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти
