#Область ОбработчикиСобытийФормы 

&НаСервере
// Обработчик создания формы на сервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка текущего выбранного элемента
	Если Параметры.Свойство("Ключ") И Параметры.Ключ <> Неопределено И ТипЗнч(Параметры.Ключ) = Тип("СправочникСсылка.Пользователи") Тогда
		
		ТекущийЭлемент               = Элементы.ТаблицаПользователи;
		ТекущийЭлемент.ТекущаяСтрока = Параметры.Ключ;  
		
	ИначеЕсли Параметры.Свойство("Ключ") И Параметры.Ключ <> Неопределено И ТипЗнч(Параметры.Ключ) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
		
		Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаГруппыПользователей;
		ТекущийЭлемент                         = Элементы.ТаблицаГруппыПользователей;
		ТекущийЭлемент.ТекущаяСтрока           = Параметры.Ключ;  
      
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПользователи

&НаКлиенте
// Обработчик выбора 
Процедура Выбрать(Команда)
		
	Если ТекущийЭлемент.ТекущиеДанные <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		Закрыть(ТекущийЭлемент.ТекущиеДанные.Ссылка);
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
// Обработка выбора в таблице пользователи
Процедура ТаблицаПользователиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТекущийЭлемент.ТекущиеДанные <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		Закрыть(ТекущийЭлемент.ТекущиеДанные.Ссылка);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработка выбора в таблице группы пользователи
Процедура ТаблицаГруппыПользователейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТекущийЭлемент.ТекущиеДанные <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		Закрыть(ТекущийЭлемент.ТекущиеДанные.Ссылка);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


