#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	Если ЭтотОбъект.Ссылка.Пустая() Тогда
		ЭтотОбъект.УстановитьНовыйКод();
	КонецЕсли;   
	КодБезНулей = ФормированиеПечатныхФорм.УдалитьЛидирующиеНулиИзНомераОбъекта(ЭтотОбъект.Код);
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда		
		Наименование = "Курс лечения №" + Строка(КодБезНулей) + ", " + Строка(Контрагент) + " от " + Формат(ДатаНачала,  "ДФ=dd.MM.yyyy") + 
		?(ЗначениеЗаполнено(ДатаОкончания), " до " + Формат(ДатаОкончания, "ДФ=dd.MM.yyyy"), "");
	КонецЕсли;

КонецПроцедуры 

#КонецОбласти

