   
#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Перед записью
//
// Параметры:
//  Отказ		 - 	 - 
//  Замещение	 - 	 - 
//
Процедура ПередЗаписью(Отказ, Замещение)

	Если ЭтотОбъект.ОбменДанными.Загрузка = Истина  Тогда 
		Возврат;
	КонецЕсли;	
	
	Если ЭтотОбъект.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;	
	
	ИнициализироватьПредопределеннуюСделку();
	
КонецПроцедуры

// Процедура - При записи
//
// Параметры:
//  Отказ		 - 	 - 
//  Замещение	 - 	 - 
//
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка = Истина  Тогда 
		Возврат;
	КонецЕсли;	

	Если НЕ ЭтотОбъект.Количество() = 0 И НЕ ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.ДополнительныеСвойства, "СсылкаНовойСделки", Неопределено) = Неопределено Тогда
		ДанныеЗаполнения = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(ЭтотОбъект.ДополнительныеСвойства));
		ДанныеЗаполнения.Вставить("ВидСделки"				, ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты"));
		ДанныеЗаполнения.Вставить("СтруктурнаяЕдиница"		, ЭтотОбъект[0].СтруктурнаяЕдиница);
		ДанныеЗаполнения.Вставить("Контрагент"				, ЭтотОбъект[0].Контрагент);		
		ДанныеЗаполнения.Вставить("ЭтапСделки"				, Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ДанныеЗаполнения.ВидСделки, 1));
		Если ЗначениеЗаполнено(ЭтотОбъект[0].Сотрудник) Тогда 
			ДанныеЗаполнения.Вставить("Врач"				, ЭтотОбъект[0].Сотрудник);
		КонецЕсли;
		ДанныеЗаполнения.Вставить("ВидОсмотра"				, ЭтотОбъект[0].ВидОсмотра);				
		Если ЭтотОбъект[0].ВидОсмотра = Перечисления.ВидыОсмотров.Направление ИЛИ ЭтотОбъект[0].ВидОсмотра = Перечисления.ВидыОсмотров.ПовторныйПрием Тогда 
			ДанныеЗаполнения.Вставить("Специализация"		, ЭтотОбъект[0].Специализация);
			ДанныеЗаполнения.Вставить("Описание"			, СформироватьОписаниеСделки(ЭтотОбъект[0].ВидОсмотра));			
		КонецЕсли;
		ДанныеЗаполнения.Вставить("ПредыдущийПрием"			, ЭтотОбъект[0].Прием);
		ДанныеЗаполнения.Вставить("СтатусПациента"			, ?(ЗначениеЗаполнено(ЭтотОбъект[0].Прием) И ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект[0].Прием, "Проведен"), Перечисления.СтатусыКонтрагентов.Постоянный, Перечисления.СтатусыКонтрагентов.Первичный));
		ДанныеЗаполнения.Вставить("ИнтерактивнаяЗапись"		, Истина);
		ДанныеЗаполнения.Вставить("СформироватьНаименование", Истина);
		Если ЭтотОбъект[0].ВидОсмотра = Перечисления.ВидыОсмотров.ПовторныйПрием ИЛИ ЭтотОбъект[0].ВидОсмотра = Перечисления.ВидыОсмотров.Направление Тогда
			ДанныеЗаполнения.Вставить("СгенерироватьЗадачу"	, Истина);
		КонецЕсли;
		Если ЭтотОбъект[0].ВидОсмотра = Перечисления.ВидыОсмотров.Направление Тогда
			ДанныеЗаполнения.Вставить("НаправившийВрач"		, ЭтотОбъект[0].НаправившийВрач);
		КонецЕсли;	
		
		НоваяСделка = Справочники.Сделки.СоздатьНовуюСделку(ДанныеЗаполнения, Истина);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Инициализировать предопределенную сделку
//
Процедура ИнициализироватьПредопределеннуюСделку()
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект[0].Сделка)
		ИЛИ НЕ (ЭтотОбъект[0].ВидОсмотра = Перечисления.ВидыОсмотров.Направление ИЛИ ЭтотОбъект[0].ВидОсмотра = Перечисления.ВидыОсмотров.ПовторныйПрием)
		ИЛИ ЭтотОбъект[0].Статус = Перечисления.СтатусыПрофосмотров.Отказался Тогда 
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект[0].ПредварительнаяЗапись) Тогда 
		СделкаПЗ = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект[0].ПредварительнаяЗапись, "Сделка");	
		Если ЗначениеЗаполнено(СделкаПЗ) Тогда 
			ЭтотОбъект[0].Сделка = СделкаПЗ;
			ЭтотОбъект[0].Статус = Перечисления.СтатусыПрофосмотров.Согласился;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	МассивСделокИсключения = Неопределено;
	Если ЗначениеЗаполнено(ЭтотОбъект[0].Прием) Тогда 
		СделкаПриема = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект[0].Прием, "Сделка");
		Если ЗначениеЗаполнено(СделкаПриема) Тогда 
			МассивСделокИсключения = Новый Массив;
			МассивСделокИсключения.Добавить(СделкаПриема);
		КонецЕсли;	
	КонецЕсли;	
	
	Записан = ЗначениеЗаполнено(ЭтотОбъект[0].ПредварительнаяЗапись);
	ЭтотОбъект[0].Сделка = Справочники.Сделки.ИнициализироватьПредопределеннуюСделку(ЭтотОбъект[0].Контрагент
																					, ЭтотОбъект[0].СтруктурнаяЕдиница
																					, ЭтотОбъект[0].Сотрудник
																					, ЭтотОбъект[0].Специализация
																					, ЭтотОбъект[0].ВидОсмотра
																					, Записан
																					, 
																					, 
																					, МассивСделокИсключения);
															
	Если ЗначениеЗаполнено(ЭтотОбъект[0].Сделка) Тогда
		Если Записан И НЕ ЗначениеЗаполнено(ЭтотОбъект[0].ПредварительнаяЗапись) Тогда
			ЭтотОбъект[0].ПредварительнаяЗапись = Документы.Событие.ПолучитьПредварительнуюЗаписьПоСделке(ЭтотОбъект[0].Сделка);
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ПредварительнаяЗапись", ЭтотОбъект[0].ПредварительнаяЗапись);
			Если ЗначениеЗаполнено(ЭтотОбъект[0].ПредварительнаяЗапись) Тогда 
				ЭтотОбъект[0].Статус = Перечисления.СтатусыПрофосмотров.Согласился;
			КонецЕсли;	
		КонецЕсли;	
		Если ЭтотОбъект[0].ВидОсмотра = Перечисления.ВидыОсмотров.Направление И (ЗначениеЗаполнено(СокрЛП(ЭтотОбъект[0].ПричинаНаправления)) ИЛИ ЗначениеЗаполнено(СокрЛП(ЭтотОбъект[0].Комментарий))) Тогда 
			Если НЕ ЗначениеЗаполнено(СокрЛП(ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект[0].Сделка, "Описание"))) Тогда
				АктуализироватьОписаниеСделки(ЭтотОбъект[0].ВидОсмотра);
			КонецЕсли;	
		КонецЕсли;	
		Возврат;
	КонецЕсли;
	
	// Помещаем ссылку, генерируемой сделки
	СсылкаНовойСделки = Справочники.Сделки.ПолучитьСсылку(Новый УникальныйИдентификатор);
	ЭтотОбъект.ДополнительныеСвойства.Вставить("СсылкаНовойСделки", СсылкаНовойСделки);
	ЭтотОбъект[0].Сделка = СсылкаНовойСделки;				
	
КонецПроцедуры

// Процедура - Актуализировать описание сделки
//
Процедура АктуализироватьОписаниеСделки(ВидОсмотра)
	
	Если ЭтотОбъект.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;

	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Попытка
			Сделка_Объект = ЭтотОбъект[0].Сделка.ПолучитьОбъект();
			Сделка_Объект.Описание = СформироватьОписаниеСделки(ВидОсмотра);
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Сделка_Объект);
		Исключение
			
		КонецПопытки;	
	#КонецЕсли  
	
КонецПроцедуры

// Функция - Сформировать описание сделки
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьОписаниеСделки(ВидОсмотра)
	
	Если ЭтотОбъект.Количество() = 0 Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если ВидОсмотра = Перечисления.ВидыОсмотров.ПовторныйПрием Тогда
		Описание = НСтр("ru='Пациент продолжает лечение, запишите на повторный приём.';en='The patient is continuing treatment, make an appointment for a follow-up appointment.'");		
		Возврат Описание 	+ ?(ЗначениеЗаполнено(СокрЛП(ЭтотОбъект[0].Комментарий))		, Символы.ПС + СокрЛП(ЭтотОбъект[0].Комментарий)		, "");			
	ИначеЕсли ВидОсмотра = Перечисления.ВидыОсмотров.Направление Тогда	
		НаименованиеВрача = ?(ЗначениеЗаполнено(ЭтотОбъект[0].НаправившийВрач)
							, ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект[0].НаправившийВрач, "НаименованиеСокращенное")
							, СокрЛП(Строка(ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект[0].Прием, "Сотрудник"))));
		Описание = СтрШаблон(НСтр("ru='По направлению от %1';en='In the direction from %1'"), НаименованиеВрача);
		Возврат Описание 	+ ?(ЗначениеЗаполнено(СокрЛП(ЭтотОбъект[0].ПричинаНаправления))	, Символы.ПС + СокрЛП(ЭтотОбъект[0].ПричинаНаправления)	, "")
							+ ?(ЗначениеЗаполнено(СокрЛП(ЭтотОбъект[0].Комментарий))		, Символы.ПС + СокрЛП(ЭтотОбъект[0].Комментарий)		, "");			
	КонецЕсли;
					
КонецФункции

#КонецОбласти
