
#Область ОбработчикиСобытий 

&НаКлиенте
// Процедура - Обработка команды
//
// Параметры:
//  ПараметрКоманды				 - 	 - 
//  ПараметрыВыполненияКоманды	 - 	 - 
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Клиент", ПараметрКоманды);
	ОткрытьФорму("РегистрСведений.ИсторияВызовов.Форма.ФормаСпискаПоКлиенту", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти