
#Область ОбработчикиСобытийЭлементовФормы

&НаСервере 
// Процедура, Обработчик события "ПриСозданииНаСервере" 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дерево = РеквизитФормыВЗначение("ОбъектДеревоРеквизитов");	
	
	РодительСтрок = ДобавитьСтрокуВДеревоЗначений(Дерево, "Договор", Ложь, "");
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Номер договора" , "Договор", ТипЗнч(""));
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Дата договора"  , "Договор", ТипЗнч(ТекущаяДата()));	
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Врач"           , "Договор", ТипЗнч(Справочники.Сотрудники.ПустаяСсылка()));
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Автор документа", "Договор", ТипЗнч(Справочники.Пользователи.ПустаяСсылка()));
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Комментарий"    , "Договор", ТипЗнч(""));
	
	Тип = ТипЗнч(Справочники.Контрагенты.ПустаяСсылка());
	РодительСтрок = ДобавитьСтрокуВДеревоЗначений(Дерево, "Пациент", Ложь, "");
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Фамилия"          , "Пациент", Тип);
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Имя"              , "Пациент", Тип);
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Отчество"         , "Пациент", Тип);
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "ФИО"              , "Пациент", Тип);
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Дата рождения"    , "Пациент", ТипЗнч(ТекущаяДата()));
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Пол"              , "Пациент", Тип);
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Телефон"          , "Пациент", ТипЗнч(""));
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Адрес"            , "Пациент", ТипЗнч(""));
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Емайл"            , "Пациент", ТипЗнч(""));
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Паспортные данные", "Пациент", ТипЗнч(""));
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Личный врач"      , "Пациент", Тип);
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Номер мед. карты" , "Пациент", Тип);
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "ИНН"              , "Пациент", Тип);

	РодительСтрок = ДобавитьСтрокуВДеревоЗначений(Дерево, "Законный представитель", Ложь, "");	
	//ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Законный представитель", "Договор", ТипЗнч(Справочники.Контрагенты.ПустаяСсылка()));
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Фамилия"          , "Законный представитель", Тип);
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Имя"              , "Законный представитель", Тип);
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Отчество"         , "Законный представитель", Тип);
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "ФИО"              , "Законный представитель", Тип);
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Дата рождения"    , "Законный представитель", ТипЗнч(ТекущаяДата()));
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Телефон"          , "Законный представитель", ТипЗнч(""));
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Адрес"            , "Законный представитель", ТипЗнч(""));
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Емайл"            , "Законный представитель", ТипЗнч(""));
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Паспортные данные", "Законный представитель", ТипЗнч(""));
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Личный врач"      , "Законный представитель", Тип);
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Номер мед. карты" , "Законный представитель", Тип);
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "ИНН"              , "Законный представитель", Тип);
	
	РодительСтрок = ДобавитьСтрокуВДеревоЗначений(Дерево, "Организация", Ложь, "");  
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Наименование юр. лица", "Организация", ТипЗнч(""));
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Телефон"          	, "Организация", ТипЗнч(""));	
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Емайл"            	, "Организация", ТипЗнч(""));
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Юридический адрес"	, "Организация", ТипЗнч(""));
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Фактический адрес"	, "Организация", ТипЗнч(""));
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Почтовый адрес"   	, "Организация", ТипЗнч(""));
	ДобавитьСтрокуВДеревоЗначений(РодительСтрок, "Факс"            	 	, "Организация", ТипЗнч(""));
	
	
	//// Заполняем реквизитами файла
	//НоваяСтрокаФайл = Дерево.Строки.Добавить();
	//НоваяСтрокаФайл.Наименование = "Файл";
	//НоваяСтрокаФайл.Тип = Тип("СправочникСсылка.Файлы");
	//ЗаполнитьДеревоРеквизитов(НоваяСтрокаФайл, Метаданные.Справочники.Файлы.СтандартныеРеквизиты, "Файл", 1);
	//ЗаполнитьДеревоРеквизитов(НоваяСтрокаФайл, Метаданные.Справочники.Файлы.Реквизиты, "Файл", 1);
	 	
	//МетаданныеВладелецаФайла = Метаданные.НайтиПоТипу(Параметры.ТипВладелецаФайла);
	//Если МетаданныеВладелецаФайла <> Неопределено Тогда
	//	
	//	// Заполняем реквизитами владельца файла
	//	НоваяСтрокаВладелецФайла = Дерево.Строки.Добавить();
	//	НоваяСтрокаВладелецФайла.Наименование = Строка(МетаданныеВладелецаФайла.Имя);
	//	НоваяСтрокаВладелецФайла.Тип = Параметры.ТипВладелецаФайла;
	//   	ЗаполнитьДеревоРеквизитов(НоваяСтрокаВладелецФайла, МетаданныеВладелецаФайла.СтандартныеРеквизиты,  Строка(НоваяСтрокаВладелецФайла.Наименование), 1);
	//	ЗаполнитьДеревоРеквизитов(НоваяСтрокаВладелецФайла,  МетаданныеВладелецаФайла.Реквизиты,  Строка(НоваяСтрокаВладелецФайла.Наименование), 1);
	//	
	//	// Заполняем дополнительными реквизитами владельца файла
	//	НоваяСтрокаДопРеквизиты = НоваяСтрокаВладелецФайла.Строки.Добавить();
	//	НоваяСтрокаДопРеквизиты.Наименование = "ДопРеквизиты";
	//	НоваяСтрокаДопРеквизиты.Тип = "";
	//	Для Каждого ДопРеквизит Из Справочники.НаборыСвойств.Документ_Договоры.ДополнительныеРеквизиты Цикл
	//		НоваяСтрокаДопРеквизит = НоваяСтрокаДопРеквизиты.Строки.Добавить();
	//		НоваяСтрокаДопРеквизит.Наименование = ДопРеквизит.Свойство.Наименование;
	//		НоваяСтрокаДопРеквизит.Тип = ДопРеквизит.Свойство.ТипЗначения;
	//		НоваяСтрокаДопРеквизит.ОбъектРодитель =  Строка(НоваяСтрокаВладелецФайла.Наименование) + ".ДопРеквизиты";
	//	КонецЦикла;		
	//	
	//	//НоваяСтрока = Дерево.Строки.Добавить();
	//	//НоваяСтрока.Наименование = "Номер договора без префикса";
	//	//НоваяСтрока.Тип = ТипЗнч(""); 
	//	//НоваяСтрока.ОбъектРодитель = Строка(НоваяСтрокаВладелецФайла.Наименование) + ".НомерДоговора";				
	//КонецЕсли;
	//  
	
	// Заполняем данными с регистра ОтветственныеЛица
	НоваяСтрока = Дерево.Строки.Добавить();
	НоваяСтрока.Наименование = "Ответственные лица";
	НоваяСтрока.Тип = "";
	Для Каждого ПеречислениеТипыОтветственныхЛиц Из Метаданные.Перечисления.ТипыОтветственныхЛиц.ЗначенияПеречисления Цикл
		НоваяСтрокаВложение                = НоваяСтрока.Строки.Добавить();
		НоваяСтрокаВложение.Наименование   = ПеречислениеТипыОтветственныхЛиц.Синоним;
		НоваяСтрокаВложение.Тип            = ТипЗнч(Справочники.Сотрудники.ПустаяСсылка());		
		НоваяСтрокаВложение.ОбъектРодитель = "Ответственные лица";		
	КонецЦикла;
		
	ЗначениеВРеквизитФормы(Дерево, "ОбъектДеревоРеквизитов");
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
		
КонецПроцедуры

#КонецОбласти   

#Область ОбработчикиСобытийЭлементовШапкиФормы   

&НаКлиенте 
// Процедура, Обработчик события "ДеревоРеквизитовВыборЗначения".
//
Процедура ДеревоРеквизитовВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьВыборЭлемента(Элемент);
	
КонецПроцедуры

&НаКлиенте
// Процедура, Обработчик события "ДеревоРеквизитовВыбор".
//
Процедура ДеревоРеквизитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьВыборЭлемента(Элемент);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Функция, Обработчик события "ДобавитьСтрокуВДеревоЗначений".
//
Функция ДобавитьСтрокуВДеревоЗначений(РодительСтроки, ПредставлениеПоля, ОбъектРодитель, Тип)
	
	НоваяСтрока = РодительСтроки.Строки.Добавить();
	НоваяСтрока.Наименование   = ПредставлениеПоля;
	НоваяСтрока.Тип = Тип;
	НоваяСтрока.ОбъектРодитель = ОбъектРодитель;
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаСервере 
// Процедура, Обработчик события "ЗаполнитьДеревоРеквизитов".
//
Процедура ЗаполнитьДеревоРеквизитов(Родитель, НаборРеквизитов, Путь, УровеньВложенности)
	
	Если УровеньВложенности > 2 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Реквизит Из НаборРеквизитов Цикл
		Если НЕ (Реквизит.Имя = "Дата" или Реквизит.Имя = "Номер" или Реквизит.Имя = "Контрагент") и Не УровеньВложенности = 2 Тогда
			Продолжить;
		КонецЕсли;	
		Если Путь = "Договоры.Контрагент" и не (Реквизит.Имя = "Фамилия" или Реквизит.Имя = "Имя" или Реквизит.Имя = "Отчество" или Реквизит.Имя = "Телефон" или Реквизит.Имя = "Наименование" или Реквизит.Имя = "ДатаРожденияКлиента") Тогда
			Продолжить; 
		КонецЕсли;
		Строка = Родитель.Строки.Добавить();
		Строка.Наименование = Реквизит.Имя;
		Строка.Тип = Реквизит.Тип;
		Строка.ОбъектРодитель = Путь;
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(Реквизит.Тип.Типы()[0]);
		Если МетаданныеОбъекта <> Неопределено И (Путь + "." + Реквизит.Имя) <> "Договоры.Ссылка"
				И (Найти(МетаданныеОбъекта.ПолноеИмя(), "Справочник.") > 0 ИЛИ Найти(МетаданныеОбъекта.ПолноеИмя(), "Документ.") > 0) Тогда
			ЗаполнитьДеревоРеквизитов(Строка, МетаданныеОбъекта.СтандартныеРеквизиты, Путь + "." + Строка.Наименование, УровеньВложенности + 1);
			ЗаполнитьДеревоРеквизитов(Строка, МетаданныеОбъекта.Реквизиты, Путь + "." + Строка.Наименование, УровеньВложенности + 1);
			Если МетаданныеОбъекта.ТабличныеЧасти.Найти("ДополнительныеРеквизиты") <> Неопределено Тогда
				ЗаполнитьСписокДопРеквизитов(Строка, МетаданныеОбъекта, Путь + "." + Реквизит.Имя);		
			КонецЕсли;
			Если МетаданныеОбъекта.ТабличныеЧасти.Найти("КонтактнаяИнформация") <> Неопределено Тогда
				ЗаполнитьСписокКонтактнойИнформации(Строка, МетаданныеОбъекта, Путь + "." + Реквизит.Имя);		
			КонецЕсли;
			Если МетаданныеОбъекта.ПолноеИмя() = "Справочник.ФизическиеЛица" ИЛИ МетаданныеОбъекта.ПолноеИмя() = "Справочник.Сотрудники" ИЛИ МетаданныеОбъекта.ПолноеИмя() = "Справочник.Контрагенты" Тогда
				ЗаполнитьСписокУдостоверенияЛичности(Строка, МетаданныеОбъекта, Путь + "." + Реквизит.Имя);		
			КонецЕсли;			
		КонецЕсли
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура, Обработчик события "ЗаполнитьСписокДопРеквизитов".
//
Процедура ЗаполнитьСписокДопРеквизитов(Строка, МетаданныеОбъекта, Путь)
	
	УстановитьПривилегированныйРежим(Истина);
	Объект = Справочники[МетаданныеОбъекта.Имя].СоздатьЭлемент();
	Попытка
		НаборСвойств = УправлениеСвойствами.ПолучитьДоступныеНаборыСвойств(Объект);
		Если ТипЗнч(НаборСвойств) = Тип("СписокЗначений")
			И НаборСвойств.Количество() > 0 Тогда
			НоваяСтрокаДопРеквизиты = Строка.Строки.Добавить();
			НоваяСтрокаДопРеквизиты.Наименование = "ДопРеквизиты";
			НоваяСтрокаДопРеквизиты.Тип = "";
			Для Каждого ВложенныйНаборСвойств Из НаборСвойств Цикл
				НоваяСтрокаВложенныеДопРеквизиты = НоваяСтрокаДопРеквизиты.Строки.Добавить();
				НоваяСтрокаВложенныеДопРеквизиты.Наименование = ВложенныйНаборСвойств.Значение.Наименование;
				НоваяСтрокаВложенныеДопРеквизиты.Тип = "";
				Для Каждого ДопРеквизит Из ВложенныйНаборСвойств.Значение.ДополнительныеРеквизиты Цикл
					НоваяСтрокаДопРеквизит = НоваяСтрокаВложенныеДопРеквизиты.Строки.Добавить();
					НоваяСтрокаДопРеквизит.Наименование = ДопРеквизит.Свойство.Наименование;
					НоваяСтрокаДопРеквизит.Тип = ДопРеквизит.Свойство.ТипЗначения;
					НоваяСтрокаДопРеквизит.ОбъектРодитель = Путь + "." + НоваяСтрокаДопРеквизиты.Наименование + "." + ВложенныйНаборСвойств.Значение.Наименование;
					НоваяСтрокаДопРеквизит.ОбъектРодитель = СтрЗаменить(НоваяСтрокаДопРеквизит.ОбъектРодитель, "Доп. свойства", "ДопСвойства");
				КонецЦикла;
			КонецЦикла;
			
		Иначе
			Если НаборСвойств.ДополнительныеРеквизиты.Количество() > 0 Тогда
				НоваяСтрокаДопРеквизиты = Строка.Строки.Добавить();
				НоваяСтрокаДопРеквизиты.Наименование = НаборСвойств.Наименование;
				НоваяСтрокаДопРеквизиты.Тип = "";
				Для Каждого ДопРеквизит Из НаборСвойств.ДополнительныеРеквизиты Цикл
					НоваяСтрокаДопРеквизит = НоваяСтрокаДопРеквизиты.Строки.Добавить();
					НоваяСтрокаДопРеквизит.Наименование = ДопРеквизит.Свойство.Наименование;
					НоваяСтрокаДопРеквизит.Тип = ДопРеквизит.Свойство.ТипЗначения;
					НоваяСтрокаДопРеквизит.ОбъектРодитель = Путь + "." + НаборСвойств.Наименование;
					НоваяСтрокаДопРеквизит.ОбъектРодитель = СтрЗаменить(НоваяСтрокаДопРеквизит.ОбъектРодитель, "Доп. свойства", "ДопСвойства");
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	Исключение
		Инфо = ИнформацияОбОшибке();
		ТекстСообщения = НСтр("ru = 'Во время получения дополнительных реквизитов при создании правила автозаполнения файлов возникло исключение:" + Символы.ВК + Инфо.Описание + "'");
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Построение дерева реквизитов'"), УровеньЖурналаРегистрации.Информация, , , ТекстСообщения);
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере 
// Процедура, Обработчик события "ЗаполнитьСписокКонтактнойИнформации".
//
Процедура ЗаполнитьСписокКонтактнойИнформации(Строка, МетаданныеОбъекта, Путь)
	
	Попытка
		НаборСвойств = Метаданные.Перечисления.ТипыКонтактнойИнформации;
		НоваяСтрокаДопКонтактнаяИнформация = Строка.Строки.Добавить();
		НоваяСтрокаДопКонтактнаяИнформация.Наименование = "ДопКонтактнаяИнформация";
		НоваяСтрокаДопКонтактнаяИнформация.Тип = "";
		Для Каждого ДопНаборСвойств Из НаборСвойств.ЗначенияПеречисления Цикл
			НоваяСтрокаДопНаборСвойств = НоваяСтрокаДопКонтактнаяИнформация.Строки.Добавить();
			НоваяСтрокаДопНаборСвойств.Наименование = ДопНаборСвойств.Имя;
			НоваяСтрокаДопНаборСвойств.Тип = ТипЗнч(Перечисления.ТипыКонтактнойИнформации.ПустаяСсылка());
			НоваяСтрокаДопНаборСвойств.ОбъектРодитель = Путь + "." + НоваяСтрокаДопКонтактнаяИнформация.Наименование;
		КонецЦикла;
	Исключение
		Инфо = ИнформацияОбОшибке();
		ТекстСообщения = НСтр("ru = 'Во время получения дополнительных реквизитов при создании правила автозаполнения файлов возникло исключение:" + Символы.ВК + Инфо.Описание + "'");
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Построение дерева контактной информации'"), УровеньЖурналаРегистрации.Информация, , , ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

&НаСервере 
// Процедура, Обработчик события "ЗаполнитьСписокУдостоверенияЛичности".
//
Процедура ЗаполнитьСписокУдостоверенияЛичности(Строка, МетаданныеОбъекта, Путь)
	
	Попытка
		НаборСвойств = Справочники.ВидыДокументовФизическихЛиц;
		НоваяСтрокаДопКонтактнаяИнформация = Строка.Строки.Добавить();
		НоваяСтрокаДопКонтактнаяИнформация.Наименование = "ДопУдостоверенияЛичности";
		НоваяСтрокаДопКонтактнаяИнформация.Тип = "";
		НаборСвойствВыборка = НаборСвойств.Выбрать();
		Пока НаборСвойствВыборка.Следующий() Цикл
			НоваяСтрокаДопНаборСвойств = НоваяСтрокаДопКонтактнаяИнформация.Строки.Добавить();
			НоваяСтрокаДопНаборСвойств.Наименование = НаборСвойствВыборка.Наименование;
			НоваяСтрокаДопНаборСвойств.Тип = ТипЗнч(НаборСвойствВыборка.Ссылка);
			НоваяСтрокаДопНаборСвойств.ОбъектРодитель = Путь + "." + НоваяСтрокаДопКонтактнаяИнформация.Наименование;
		КонецЦикла;
	Исключение
		Инфо = ИнформацияОбОшибке();
		ТекстСообщения = НСтр("ru = 'Во время получения дополнительных реквизитов при создании правила автозаполнения файлов возникло исключение:" + Символы.ВК + Инфо.Описание + "'");
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Построение дерева контактной информации'"), УровеньЖурналаРегистрации.Информация, , , ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте 
// Процедура, Обработчик события "ОбработатьВыборЭлемента".
//
Процедура ОбработатьВыборЭлемента(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Тип) Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеЗамены = Элемент.ТекущиеДанные.ОбъектРодитель + "." + Элемент.ТекущиеДанные.Наименование;
	
	ОповеститьОВыборе(Новый Структура("Значение, Тип", ЗначениеЗамены, Элемент.ТекущиеДанные.Тип));	
	
КонецПроцедуры

#КонецОбласти 