
#Область ОбработчикиСобытий

&НаСервере
// Процедура, При создании на сервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
		
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();     
	
КонецПроцедуры

&НаСервереБезКонтекста 
// Процедура - Список при получении данных на сервере.
//
// Параметры:
//  ИмяЭлемента	 - 	 - 
//  Настройки	 - 	 - 
//  Строки		 - 	 - 
//
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого Строка Из Строки Цикл
		
		Если ЗначениеЗаполнено(Строка.Ключ.ЦветФона) Тогда
			
			ОформлениеКолонкиКратко = Строка.Значение.Оформление["НаименованиеКратко"]; 
			ОформлениеКолонкиКратко.УстановитьЗначениеПараметра("ЦветФона", ЗначениеИзСтрокиВнутр(Строка.Ключ.ЦветФона));
			
			Если Строка.Ключ.ЦветТекстаБелый = Истина Тогда
				ОформлениеКолонкиКратко.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255,255,255));	
			КонецЕсли;
		
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти