
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик при создании формы на сервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Загрузить таблицу значениями
	Если Параметры.Свойство("Задачи") Тогда
			
		Для Каждого ЭлМассива ИЗ Параметры.Задачи Цикл
			
			НоваяСтрока               = ТаблицаЗадач.Добавить();
			НоваяСтрока.Задача        = ЭлМассива;
			НоваяСтрока.Представление = ?(ТипЗнч(ЭлМассива) = Тип("ЗадачаСсылка.Взаимодействие"), ЭлМассива.ВзаимодействиеПредставление, ЭлМассива.ЗадачаИсполнителяПредставление);
			НоваяСтрока.Картинка      = Истина;

		КонецЦикла;
		
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработка оповещения формы
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Оповещение об изменении состояния задачи пользователя
	Если ИмяСобытия = "ЗадачаПользователя" И ТипЗнч(Параметр) = Тип("ЗадачаСсылка.Взаимодействие") Тогда
					
	     ПриИзмененеииСостоянияЗадачи(Параметр);

		 Если ТаблицаЗадач.Количество() = 0 Тогда
			Закрыть();
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадачи

&НаКлиенте
// Выбор задачи в таблице
Процедура ЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// Открываем форму задачи
    ФормаЗадачи = ПолучитьФорму("Задача.Взаимодействие.ФормаОбъекта",Новый Структура("Ключ", Элементы.Задачи.ТекущиеДанные.Задача));
    ФормаЗадачи.Открыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
                                       
&НаКлиенте
// Обработчик выполнения задачи
Процедура ВыполнитьЗадачу(Команда)
	
	ТекущиеДанные = Элементы.Задачи.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 

       ВыполнитьЗадачуСервер(ТекущиеДанные.Задача);
	   
	   ОповеститьОбИзменении(ПредопределенноеЗначение("Задача.Взаимодействие.ПустаяСсылка"));
	    
	   ТаблицаЗадач.Удалить(ТекущиеДанные);
	   
	   Если ТаблицаЗадач.Количество() = 0 Тогда
			Закрыть();
	   КонецЕсли;

	   Оповестить("ИзменениеСпискаВзаимодействий");
	   
     КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработчик прекращения напоминания о задаче
Процедура ПрекратитьНапоминания(Команда)
	
	ТекущиеДанные = Элементы.Задачи.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 
		
	    ПрекратитьНапоминанияСервер(ТекущиеДанные.Задача);
	    ОповеститьОбИзменении(ТекущиеДанные.Задача);
	    ТаблицаЗадач.Удалить(ТекущиеДанные);
		
        Если ТаблицаЗадач.Количество() = 0 Тогда
			Закрыть();
		КонецЕсли;

    КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработчик откладывания выполнения задачи
Процедура Перенести(Команда)
	
	ТекущиеДанные = Элементы.Задачи.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 

		ПеренестиСервер(Команда.Имя, ТекущиеДанные.Задача);
		ТаблицаЗадач.Удалить(ТекущиеДанные);

		Если ТаблицаЗадач.Количество() = 0 Тогда
			Закрыть();
		КонецЕсли;
	
    КонецЕсли;
  
КонецПроцедуры

&НаКлиенте
// Процедура - Перенести все
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПеренестиВсе(Команда)
	
	Если ТаблицаЗадач.Количество() <> 0 Тогда 
		ПеренестиСервер(Команда.Имя, , Истина);
		ТаблицаЗадач.Очистить();

		Если ТаблицаЗадач.Количество() = 0 Тогда
			Закрыть();
		КонецЕсли;
    КонецЕсли;
  
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Выполинть задачу, записать объект 
Процедура ВыполнитьЗадачуСервер(Задача)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗадачаОбъект                = Задача.ПолучитьОбъект();
	ЗадачаОбъект.ДатаИсполнения = ТекущаяДата();
	ЗадачаОбъект.Выполнена      = Истина;
	ЗадачаОбъект.Записать();

КонецПроцедуры

&НаСервере
// Прекратить напоминание о задаче, записать объект
Процедура ПрекратитьНапоминанияСервер(Задача)
	
	ЗадачаОбъект                         = Задача.ПолучитьОбъект();
	ЗадачаОбъект.НапоминаниеИспользовать = Ложь;
	ЗадачаОбъект.Записать();
	
КонецПроцедуры

&НаСервере
// Отложить напоминание о задаче, записать объект
Процедура ПеренестиСервер(Интервал, Задача = Неопределено, Все = Ложь)
	
	Если НЕ Задача = Неопределено Тогда 
		ЗадачаОбъект                       = Задача.ПолучитьОбъект();
	КонецЕсли;
	Если Все = Истина Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ИмяКоманды"			, Интервал);
		СтруктураПараметров.Вставить("ТаблицаЗадач"			, ДанныеФормыВЗначение(ЭтаФорма.ТаблицаЗадач, Тип("ТаблицаЗначений")));
		СтруктураПараметров.Вставить("ТочкаНаВременнойШкале", ТекущаяДатаСеанса());
		ПараметрыДлительнойОперации = ЗагрузкаПроведениеДокументов.ПеренестиНапоминанияПоЗадачам(Строка(УникальныйИдентификатор), СтруктураПараметров);
	Иначе
		ТочкаНаВременнойШкале = ТекущаяДатаСеанса();
		Если Интервал = "Завтра" Тогда
			ЗадачаОбъект.НапоминаниеДатаНачала = ТочкаНаВременнойШкале + 60*60*24;
			ЗадачаОбъект.ЗадачаНазначеннаяДата = ТочкаНаВременнойШкале + 60*60*24;
		ИначеЕсли Интервал = "Послезавтра" Тогда
			ЗадачаОбъект.НапоминаниеДатаНачала = ТочкаНаВременнойШкале + 60*60*24*2;
			ЗадачаОбъект.ЗадачаНазначеннаяДата = ТочкаНаВременнойШкале + 60*60*24*2
		ИначеЕсли Интервал = "Неделя"Тогда
			ЗадачаОбъект.НапоминаниеДатаНачала = ТочкаНаВременнойШкале + 60*60*24*7;
			ЗадачаОбъект.ЗадачаНазначеннаяДата = ТочкаНаВременнойШкале + 60*60*24*7;
		ИначеЕсли Интервал = "Месяц" Тогда
			ЗадачаОбъект.НапоминаниеДатаНачала = ДобавитьМесяц(ТочкаНаВременнойШкале, 1);
			ЗадачаОбъект.ЗадачаНазначеннаяДата = ДобавитьМесяц(ТочкаНаВременнойШкале, 1);
		КонецЕсли;
		Попытка
			ЗадачаОбъект.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
// При изменении состояния задачи обновить список задач
Процедура ПриИзмененеииСостоянияЗадачи(Задача)
	
	Если Задача.Выполнена ИЛИ  НЕ Задача.НапоминаниеИспользовать Тогда

		СтрокиУдаления = ТаблицаЗадач.НайтиСтроки(Новый Структура("Задача",Задача));
		Для А = 0 По  СтрокиУдаления.Количество()-1 Цикл
			
			ТаблицаЗадач.Удалить(СтрокиУдаления[А]);
			
		КонецЦикла;
							
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Выполинть задачу, записать объект 
Процедура ЗагрузитьЗадачи(МассивЗадач) Экспорт
	
	ТаблицаЗадач.Очистить();
	
	Для Каждого ЭлМассива ИЗ МассивЗадач Цикл
			
		НоваяСтрока               = ТаблицаЗадач.Добавить();
		НоваяСтрока.Задача        = ЭлМассива;
		НоваяСтрока.Представление = ЭлМассива.Наименование;
		НоваяСтрока.Картинка      = Истина;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
