
#Область СлужебныеПроцедурыИФункции

// Функция - Получить табличную часть договора по ссылке.
//
Функция ПолучитьТабличнуюЧастьДоговораПоСсылке(СсылкаНаДоговор) Экспорт
	
	Если НЕ СсылкаНаДоговор = Неопределено
		ИЛИ НЕ СсылкаНаДоговор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда

		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ДоговорыКонтрагентовУслугиПоДоговору.НомерСтроки КАК НомерСтроки,
			|	ДоговорыКонтрагентовУслугиПоДоговору.Номенклатура КАК Номенклатура,
			|	ДоговорыКонтрагентовУслугиПоДоговору.Согласование КАК Согласование,
			|	ДоговорыКонтрагентовУслугиПоДоговору.Количество КАК Количество
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов.УслугиПоДоговору КАК ДоговорыКонтрагентовУслугиПоДоговору
			|ГДЕ
			|	ДоговорыКонтрагентовУслугиПоДоговору.Ссылка = &Ссылка");	
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаДоговор);	
		
		Возврат (Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;

КонецФункции

// Функция - Получить информацию номенклатуры по договору.
//
// Параметры:
//  ДоговорКонтрагента	 - 	 - 
//  Номенклатура		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьИнформациюНоменклатурыПоДоговору(ДоговорКонтрагента, Номенклатура) Экспорт 
	
	Если Не ЗначениеЗаполнено(ДоговорКонтрагента)
		ИЛИ Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДоговорыКонтрагентовУслугиПоДоговору.Номенклатура КАК Номенклатура,
	|	ДоговорыКонтрагентовУслугиПоДоговору.Согласование КАК Согласование,
	|	ДоговорыКонтрагентовУслугиПоДоговору.Количество КАК Количество,
	|	ДоговорыКонтрагентовУслугиПоДоговору.КоличествоПриПревышении КАК КоличествоПриПревышении
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.УслугиПоДоговору КАК ДоговорыКонтрагентовУслугиПоДоговору
	|ГДЕ
	|	ДоговорыКонтрагентовУслугиПоДоговору.Ссылка = &ДоговорКонтрагента
	|	И ДоговорыКонтрагентовУслугиПоДоговору.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	ИнфаПоНоменклатуре = Новый Структура("Номенклатура, Согласование, Количество, КоличествоПриПревышении");	
	Если ВыборкаЗапроса.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ИнфаПоНоменклатуре, ВыборкаЗапроса); 
		Возврат ИнфаПоНоменклатуре;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

// Функция - Получить договор по лаборатории
//
// Параметры:
//  Лаборатория	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеДоговораПоЛаборатории(Лаборатория, ДатаДокумента) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.ВидЦен КАК ВидЦен
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Контрагент = &Лаборатория
		|	И ВЫБОР
		|			КОГДА ДоговорыКонтрагентов.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ДоговорыКонтрагентов.ДатаОкончания >= &ДатаДокумента
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА ДоговорыКонтрагентов.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ДоговорыКонтрагентов.ДатаНачала <= &ДатаДокумента
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.УстановитьПараметр("Лаборатория", Лаборатория);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Новый Структура("Договор, ВидЦен",Выборка.Договор, Выборка.ВидЦен);
		
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

// Процедура - Получить список выбора договоров по лаборатории
//
Функция ПолучитьМассивЗначенийСпискаВыбораДоговоровПоЛаборатории(Лаборатория, ДатаДокумента) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ДоговорыКонтрагентов.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ДоговорыКонтрагентов.ДатаОкончания >= &ДатаДокумента
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА ДоговорыКонтрагентов.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ДоговорыКонтрагентов.ДатаНачала <= &ДатаДокумента
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ДоговорыКонтрагентов.Контрагент = &Лаборатория";
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.УстановитьПараметр("Лаборатория", Лаборатория);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти