
#Область СлужебныйПрограммныйИнтерфейс

// Процедура, обработчик события "ПриКопировании".
//
Процедура ПриКопировании(ОбъектКопирования)
	
	КодСинхронизации = ""; 
	Наименование 	 = "";
	
КонецПроцедуры

// Процедура, обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

 #КонецОбласти
 
 #Область ОбработчикиПроведения
 
 #КонецОбласти
 
 #Область ОбработчикиСобытий
 
 #КонецОбласти
 
 #Область СлужебныеПроцедурыИФункции
 
 #КонецОбласти
 
 
 