
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
// Обработчик события ОбработкаЗаписиНового.
//
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Элементы.Список.ТекущаяСтрока = НовыйОбъект;
	
КонецПроцедуры

&НаСервере
// Процедура, "При создании на сервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.СписокКод.Видимость = Истина;
		Элементы.СписокКод.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.СписокКод.Видимость = Ложь;
		Элементы.СписокКод.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Обработчик события Действие команды КомандаПодборИзКлассификатора.
//
Процедура КомандаПодборИзКлассификатора(Команда)
	
	ОткрытьФорму("Справочник.КлассификаторЕдиницИзмерения.Форма.ФормаПодбораИзКлассификатора");
	
КонецПроцедуры

#КонецОбласти