
#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Обработка получения представления
//
// Параметры:
//  Данные				 - 	 - 
//  Представление		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Представление = "" + Данные.Наименование + " (эквайринг)";

КонецПроцедуры

// Функция - Получить блокируемые реквизиты объекта
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Владелец");
	Возврат Результат; 
	
КонецФункции

// Функция определяет эквайринговый терминал по выбранной кассе или организации.
//
// Возвращает эквайринговый терминал, если найден один эквайринговый терминал.
// Возвращает Неопределено, если эквайринговый терминал не найден или эквайринговых терминалов больше одного.
//
// Параметры:
//  Касса - СправочникСсылка.Кассы (СправочникСсылка.КассыККМ) - Выбранная касса
//  Организация - СправочникСсылка.Организации - Выбранная организация
//
// Возвращаемое значение:
//	СправочникСсылка.ЭквайринговыеТерминалы - Найденный эквайринговый терминал
//
Функция ПолучитьЭквайринговыйТерминалПоУмолчанию(Касса) Экспорт
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Кассы.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	Кассы.Ссылка = &Ссылка
	|	И НЕ Кассы.ЭквайринговыйТерминал.Код ЕСТЬ NULL");
	
	Запрос.УстановитьПараметр("Ссылка", Касса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.ЭквайринговыйТерминал, Неопределено);
	
КонецФункции

// Функция - Получить эквайринговые терминалы для рабочего места
//
// Параметры:
//  РабочееМесто - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЭквайринговыеТерминалыДляРабочегоМеста(ОтборКассы, РабочееМесто) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЭквайринговыеТерминалы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы
	|ГДЕ
	|	ЭквайринговыеТерминалы.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &РабочееМесто <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ЭквайринговыеТерминалы.ПодключаемоеОборудование.РабочееМесто = &РабочееМесто
	|						ИЛИ ЭквайринговыеТерминалы.ПодключаемоеОборудование.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяСсылка)
	|						ИЛИ ЭквайринговыеТерминалы.ИспользоватьБезПодключенияОборудования = ИСТИНА
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ЭквайринговыеТерминалы.Ссылка В
	|			(ВЫБРАТЬ
	|				Кассы.ЭквайринговыйТерминал
	|			ИЗ
	|				Справочник.Кассы КАК Кассы
	|			ГДЕ
	|				Кассы.Ссылка В (&ОтборКассы))");
	
	Запрос.УстановитьПараметр("ОтборКассы"  , ОтборКассы);
	Запрос.УстановитьПараметр("РабочееМесто", ?(ЗначениеЗаполнено(РабочееМесто), РабочееМесто, Неопределено));     
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	
	
КонецФункции

// Функция - Получить эквайринговые терминалы СБП и ссылок на оплату
//
// Параметры:
//  Касса				 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЭквайринговыеТерминалыСБП_И_СсылокНаОплату(Касса, СтруктурнаяЕдиница, ЭтоВзносНаЛс = Ложь) Экспорт
	
	МассивТиповБанка = Новый Массив;
	МассивТиповБанка.Добавить(Перечисления.ПлатежныеШлюзы.СБПАльфаБанк);	
	МассивТиповБанка.Добавить(Перечисления.ПлатежныеШлюзы.СБПРайффайзенБанк);
	МассивТиповБанка.Добавить(Перечисления.ПлатежныеШлюзы.СБПТинькофф);
	МассивТиповБанка.Добавить(Перечисления.ПлатежныеШлюзы.СБПСбербанк);
	МассивТиповБанка.Добавить(Перечисления.ПлатежныеШлюзы.СбербанкПлатиQR);
	МассивТиповБанка.Добавить(Перечисления.ПлатежныеШлюзы.СБПСДМ);
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КассыЭквайринговыеТерминалы.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	|	КассыЭквайринговыеТерминалы.ЭквайринговыйТерминал.Наименование КАК Наименование,
	|	КассыЭквайринговыеТерминалы.ЭквайринговыйТерминал.ТипБанка КАК ТипБанка
	|ИЗ
	|	Справочник.Кассы.ЭквайринговыеТерминалы КАК КассыЭквайринговыеТерминалы
	|ГДЕ
	|	КассыЭквайринговыеТерминалы.Ссылка = &Касса
	|	И КассыЭквайринговыеТерминалы.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И КассыЭквайринговыеТерминалы.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И КассыЭквайринговыеТерминалы.ЭквайринговыйТерминал.ПометкаУдаления = ЛОЖЬ
	|	И КассыЭквайринговыеТерминалы.ЭквайринговыйТерминал.Организация = КассыЭквайринговыеТерминалы.Ссылка.Организация
	|	И (КассыЭквайринговыеТерминалы.ЭквайринговыйТерминал.ТипБанка В (&МассивТиповБанка)
	|			ИЛИ &УсловиеОплатаПоСсылке)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование");
	
	УсловиеОплатаПоСсылке = ?(ЭтоВзносНаЛс, "ЛОЖЬ", "КассыЭквайринговыеТерминалы.ЭквайринговыйТерминал.ИспользоватьОплатуПоСсылке"); 
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОплатаПоСсылке", УсловиеОплатаПоСсылке); 
	
	Запрос.УстановитьПараметр("Касса"					, Касса);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"		, СтруктурнаяЕдиница);
    Запрос.УстановитьПараметр("МассивТиповБанка"		, МассивТиповБанка);
	Запрос.УстановитьПараметр("Сотрудник"			    , ПараметрыСеанса.ТекущийСотрудник);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
 
// Функция, возвращает эквайинговые терминалы для ссылки на оплату сбербанк.
//
Функция НаличиеЭквайринговыхТерминаловДляСсылкиНаОплату(Организация, ТипБанка = Неопределено) Экспорт
	
	Запрос = Новый Запрос( 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭквайринговыеТерминалы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы
	|ГДЕ
	|	НЕ ЭквайринговыеТерминалы.ПометкаУдаления
	|	И ЭквайринговыеТерминалы.ИспользоватьОплатуПоСсылке
	|	И ЭквайринговыеТерминалы.Организация = &Организация
	|	И &УсловиеТипБанка");
	
	Если ТипБанка <> Неопределено Тогда
		Если ТипЗнч(ТипБанка) = Тип("Массив") Тогда
			УсловиеТипБанка = "ЭквайринговыеТерминалы.ТипБанка В (&ТипБанка)";
		Иначе
			УсловиеТипБанка = "ЭквайринговыеТерминалы.ТипБанка = &ТипБанка";
		КонецЕсли;
	Иначе
		УсловиеТипБанка = "Истина";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеТипБанка", УсловиеТипБанка);
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТипБанка"   , ТипБанка);

	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти
