
#Область ОбработчикиСобытий

//Процедура, обработчик события "ОбработкаЗаполнения"
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИспользоватьБезПодключенияОборудования = Истина;
	
КонецПроцедуры

//Процедура, обработчик события "ОбработкаПроверкиЗаполнения"
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ИспользоватьБезПодключенияОборудования ИЛИ ТипЭквайринга = Перечисления.ТипыЭквайринговыхТерминалов.Онлайн Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПодключаемоеОборудование"));
	КонецЕсли;
	
	Если ПометкаУдаления = Ложь И ИспользоватьБезПодключенияОборудования = Ложь И ЗначениеЗаполнено(ПодключаемоеОборудование) Тогда
		
		// Поиск подкл. оборудования у других эквайрингов
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭквайринговыеТерминалы.Ссылка
		|ИЗ
		|	Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы
		|ГДЕ
		|	ЭквайринговыеТерминалы.ПометкаУдаления = ЛОЖЬ
		|	И ЭквайринговыеТерминалы.ИспользоватьБезПодключенияОборудования = ЛОЖЬ
		|	И ЭквайринговыеТерминалы.ПодключаемоеОборудование = &ПодключаемоеОборудование
		|	И ЭквайринговыеТерминалы.Ссылка <> &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ПодключаемоеОборудование", ПодключаемоеОборудование);
		
		РезультатДублированияПодключенныхОборудований = Запрос.Выполнить().Выбрать();
		
		Если РезультатДублированияПодключенныхОборудований.Следующий() Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Подключаемое оборудование уже используется в эквайринге '" + РезультатДублированияПодключенныхОборудований.Ссылка + "'");
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//Процедура, обработчик события "ПередЗаписью"
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Отказ = НЕ ПроверитьЗаполнение();
	
КонецПроцедуры

// Процедура - При записи
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриЗаписи(Отказ)
	
	Идентификатор = Строка(Новый УникальныйИдентификатор);
	
КонецПроцедуры

// Процедура - При копировании
//
// Параметры:
//  ОбъектКопирования	 - 	 - 
//
Процедура ПриКопировании(ОбъектКопирования)
	
	КодСинхронизации = "";
	
КонецПроцедуры

#КонецОбласти
