
#Область ОбработчикиСобытий

// Процедура - Обработка команды
//
// Параметры:
//  ПараметрКоманды				 - 	 - 
//  ПараметрыВыполненияКоманды	 - 	 - 
//
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВыполняемаяКоманда = ДанныеКомандыВнешнегоОтчета(ПараметрКоманды);
	
	Если ВыполняемаяКоманда.Контекстный Тогда
		Состояние(НСтр("ru = 'Отчет можно открыть только из объектов БД'"));
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыполняемаяКоманда.Автор) И ВыполняемаяКоманда.ТолькоДляАвтора И НЕ ВыполняемаяКоманда.ЭтоПолноправныйПользователь И НЕ ВыполняемаяКоманда.ТекущийПользователь=ВыполняемаяКоманда.Автор Тогда
		Состояние(НСтр("ru = 'Нарушение прав доступа'"));
		Возврат;
	КонецЕсли; 
	
	Если ВыполняемаяКоманда.ВариантЗапуска = ПредопределенноеЗначение("Перечисление.СпособыВызоваДополнительныхОбработок.ОткрытиеФормы") Тогда
		
		ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьОткрытиеФормыОбработки(ВыполняемаяКоманда, ПараметрыВыполненияКоманды.Источник, ВыполняемаяКоманда.ОбъектыНазначения);
		
	ИначеЕсли ВыполняемаяКоманда.ВариантЗапуска = ПредопределенноеЗначение("Перечисление.СпособыВызоваДополнительныхОбработок.ВызовКлиентскогоМетода") Тогда
		
		ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьКлиентскийМетодОбработки(ВыполняемаяКоманда, ПараметрыВыполненияКоманды.Источник, ВыполняемаяКоманда.ОбъектыНазначения);
		
	ИначеЕсли ВыполняемаяКоманда.ВариантЗапуска = ПредопределенноеЗначение("Перечисление.СпособыВызоваДополнительныхОбработок.ВызовСерверногоМетода")
		Или ВыполняемаяКоманда.ВариантЗапуска = ПредопределенноеЗначение("Перечисление.СпособыВызоваДополнительныхОбработок.СценарийВБезопасномРежиме") Тогда
		
		ПараметрыВызоваСервера = Новый Структура("ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ОбъектыНазначения");
		ПараметрыВызоваСервера.ДополнительнаяОбработкаСсылка = ВыполняемаяКоманда.Ссылка;
		ПараметрыВызоваСервера.ИдентификаторКоманды   = ВыполняемаяКоманда.Идентификатор;
		ПараметрыВызоваСервера.ОбъектыНазначения      = ВыполняемаяКоманда.ОбъектыНазначения;
		
		Задание = ОбработкаКомандыСервер(ПараметрыВызоваСервера);
	
		Если Задание.Завершено Тогда
			ПоказатьРезультатВыполненияОбработки(Задание, ВыполняемаяКоманда, ПараметрыВыполненияКоманды.Источник);
		Иначе
			Состояние(НСтр("ru = 'Выполняется команда...'"),,, БиблиотекаКартинок.ДлительнаяОперация48);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция - Обработка команды сервер
//
// Параметры:
//  ПараметрыВызоваСервера	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаСервере
Функция ОбработкаКомандыСервер(ПараметрыВызоваСервера)
	
	Возврат ДополнительныеОтчетыИОбработки.ВыполнитьКоманду(ПараметрыВызоваСервера);	
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Функция - Данные команды внешнего отчета
//
// Параметры:
//  Вариант	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаСервере
Функция ДанныеКомандыВнешнегоОтчета(Вариант)
	
	ВыполняемаяКоманда = Новый Структура(
		"Ссылка, Представление, Автор, ТолькоДляАвтора, 
		|Идентификатор, ВариантЗапуска, ПоказыватьОповещение, 
		|Модификатор, ОбъектыНазначения, ЭтоОтчет, Вид, Контекстный");
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вариант", Вариант);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеОтчетыИОбработкиКоманды.Ссылка,
	|	ДополнительныеОтчетыИОбработкиКоманды.Идентификатор,
	|	ДополнительныеОтчетыИОбработкиКоманды.ВариантЗапуска,
	|	ДополнительныеОтчетыИОбработкиКоманды.Представление,
	|	ДополнительныеОтчетыИОбработкиКоманды.ПоказыватьОповещение,
	|	ДополнительныеОтчетыИОбработкиКоманды.Модификатор,
	|	ДополнительныеОтчетыИОбработкиКоманды.Ссылка.Вид КАК Вид,
	|	ВариантыДополнительныхОтчетов.Контекстный,
	|	ВариантыДополнительныхОтчетов.Автор,
	|	ВариантыДополнительныхОтчетов.ТолькоДляАвтора
	|ИЗ
	|	Справочник.ВариантыДополнительныхОтчетов КАК ВариантыДополнительныхОтчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки.Команды КАК ДополнительныеОтчетыИОбработкиКоманды
	|		ПО ВариантыДополнительныхОтчетов.Отчет = ДополнительныеОтчетыИОбработкиКоманды.Ссылка
	|			И ВариантыДополнительныхОтчетов.ИдентификаторКоманды = ДополнительныеОтчетыИОбработкиКоманды.Идентификатор
	|ГДЕ
	|	ВариантыДополнительныхОтчетов.Ссылка = &Вариант";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		ЗаполнитьЗначенияСвойств(ВыполняемаяКоманда, Выборка);
		ВыполняемаяКоманда.ЭтоОтчет = Истина;
	КонецЕсли;
	ВыполняемаяКоманда.Вставить("ТекущийПользователь", Пользователи.ТекущийПользователь());	
	ВыполняемаяКоманда.Вставить("ЭтоПолноправныйПользователь", Пользователи.ЭтоПолноправныйПользователь(ВыполняемаяКоманда.ТекущийПользователь));	
	Возврат ВыполняемаяКоманда;
	
КонецФункции

// Процедура - Показать результат выполнения обработки
//
// Параметры:
//  Задание				 - 	 - 
//  ВыполняемаяКоманда	 - 	 - 
//  ВладелецФормы		 - 	 - 
//
&НаКлиенте
Процедура ПоказатьРезультатВыполненияОбработки(Задание, ВыполняемаяКоманда, ВладелецФормы)
	
	// Добавление оповещения в результат выполнения (если требуется).
	РезультатВыполнения = Задание.Значение;
	Если РезультатВыполнения = Неопределено Тогда
		РезультатВыполнения = Новый Структура;
	КонецЕсли;
	
	Если Задание.Успешно Тогда
		// Показать всплывающее оповещение.
		Если ВыполняемаяКоманда.ПоказыватьОповещение Тогда
			ВывестиОповещение(
				РезультатВыполнения,
				НСтр("ru = 'Команда выполнена'"),
				ВыполняемаяКоманда.Представление);
		КонецЕсли;
		
		// Обновить форму владельца
		Попытка
			ВладелецФормы.Прочитать();
		Исключение
			// Действие не требуется.
		КонецПопытки;
	КонецЕсли;
	
	// Вывод результата выполнения.
	УправлениеИнтерфейсамиКлиент.ПоказатьРезультатВыполнения(ВладелецФормы, РезультатВыполнения);
	
КонецПроцедуры

Процедура ВывестиОповещение(ОбъектыНазначения, ЗаголовокОповещения, Ошибки = Неопределено)
	Всего = ОбъектыНазначения.Количество();
	Ошибок = ?(Ошибки <> Неопределено, Ошибки.Количество(), 0);
	Заполнено = Всего - Ошибок;
	
	Если Всего = 1 Тогда
		Если Ошибок > 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Ошибки[0];
			Сообщение.Поле = "Объект.НаименованиеПолное";
			Сообщение.Сообщить();
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ЗаголовокОповещения;
			Сообщение.Сообщить();
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Ошибок = 0 Тогда
		ТекстОповещения = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';Обработан %1 объект;; Обработано %1 объекта; Обработано %1 объектов; Обработано %1 объекта'"),
			Всего);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОповещения;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Кратко = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Всего объектов: %1
			|Успешно заполнено: %2
			|Ошибок: %3'"),
		Формат(Всего,     "ЧН=0; ЧГ=0"),
		Формат(Заполнено, "ЧН=0; ЧГ=0"), 
		Формат(Ошибок,    "ЧН=0; ЧГ=0"));
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Кратко;
	Сообщение.Сообщить();
	
	Подробно = "";
	Для Каждого ТекстОшибки Из Ошибки Цикл
		Подробно = Подробно + "---" + Символы.ПС + Символы.ПС + ТекстОшибки + Символы.ПС + Символы.ПС;
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Обработка заполнения справочника Демо: Контрагенты'", ОбщегоНазначения.КодОсновногоЯзыка()), 
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники._ДемоКонтрагенты,
		,
		Подробно);
КонецПроцедуры

#КонецОбласти 



