
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановленнаяСтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяСтруктурнаяЕдиница",УстановленнаяСтруктурнаяЕдиница);
	
	ТекущийПользователь            = Неопределено;
	СтруктурныеЕдиницыПользователя = Новый Массив;
	
	Если ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь) И НЕ ПараметрыСеанса.ТекущийПользователь.Наименование = "<Не указан>"
		И Не ПараметрыСеанса.ТекущийПользователь.Наименование = "<Служебный пользователь 2>" Тогда
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
		СтруктурныеЕдиницыПользователя = Справочники.СтруктурныеЕдиницы.ПолучитьМассивСтруктурныхЕдиницСотрудника(ТекущийПользователь);
	КонецЕсли;
	
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список,"Ссылка",СтруктурныеЕдиницыПользователя,ВидСравненияКомпоновкиДанных.ВСписке);
		
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик нажатия на строку таблицы.
//
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	УстановитьКлинику(Неопределено);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "УстановитьКлинику".
//
Процедура УстановитьКлинику(Команда)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбраннаяСтруктурнаяЕдиница = СтрокаТаблицы.Ссылка;
	УстановитьСтруктурнуюЕдиницу(ВыбраннаяСтруктурнаяЕдиница);
	
	Оповестить("ИзмененаСтруктурнаяЕдиница", Новый Структура("ТекущаяСтруктурнаяЕдиница", ВыбраннаяСтруктурнаяЕдиница)); 
	
	СтандартныеПодсистемыКлиент.УстановитьРасширенныйЗаголовокПриложения();  
	
	РабочееМесто = Пользователи.ПолучитьЗначениеПоУмолчаниюПользователя(Неопределено, "ОсновноеРабочееМесто");
	Если Не ЗначениеЗаполнено(РабочееМесто) Тогда
		
		СистемнаяИнформация = Новый СистемнаяИнформация();
		ИмяКомпьютера = "";
		
		#Если НЕ ВебКлиент Тогда
			ИмяКомпьютера = ИмяКомпьютера();
		#КонецЕсли
		
		МассивРабочихМест = МенеджерОборудованияКлиентПовтИсп.НайтиРабочиеМестаПоИД(ВРег(СистемнаяИнформация.ИдентификаторКлиента), ИмяКомпьютера);
		Если МассивРабочихМест.Количество() = 0 Тогда
			ПараметрыРабочегоМеста = Новый Структура;
			ПараметрыРабочегоМеста.Вставить("ИмяКомпьютера");
			ПараметрыРабочегоМеста.Вставить("ИдентификаторКлиента");
			
			#Если Не ВебКлиент Тогда
				ПараметрыРабочегоМеста.ИмяКомпьютера = ИмяКомпьютера();
			#КонецЕсли
			
			ПараметрыРабочегоМеста.ИдентификаторКлиента = ВРег(СистемнаяИнформация.ИдентификаторКлиента);
			РабочееМесто = МенеджерОборудованияВызовСервера.СоздатьРабочееМестоКлиента(ПараметрыРабочегоМеста);
		Иначе
			РабочееМесто = МассивРабочихМест[0];
		КонецЕсли;
		
	КонецЕсли;
	
	Если РабочееМесто <> МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента() Тогда
		МенеджерОборудованияКлиент.УстановитьРабочееМесто(РабочееМесто);
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура - устанавливает активную структурную единицу текущей.
//
Процедура УстановитьСтруктурнуюЕдиницу(Знач СтруктурнаяЕдиница)
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница = СтруктурнаяЕдиница;
	УстановленнаяСтруктурнаяЕдиница = СтруктурнаяЕдиница;

	ОбщегоНазначения.СохранитьПоследнююИспСтрЕдиницу(ПараметрыСеанса.ТекущийПользователь);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

