
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборКлиентПриИзменении(Элемент)

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", ОтборКлиент, ЗначениеЗаполнено(ОтборКлиент));
	
КонецПроцедуры


&НаКлиенте
Процедура ОтборВидВзаимодействияПриИзменении(Элемент)

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ВидВзаимодействия", ОтборВидВзаимодействия, ЗначениеЗаполнено(ОтборВидВзаимодействия));
	
КонецПроцедуры


&НаКлиенте
Процедура ОтборАвторЗадачиПриИзменении(Элемент)

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Автор", ОтборАвторЗадачи, ЗначениеЗаполнено(ОтборАвторЗадачи));
	
КонецПроцедуры


&НаКлиенте
Процедура ОтборВыполненаПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Выполнена", ОтборВыполнена, ЗначениеЗаполнено(ОтборВыполнена));
	
КонецПроцедуры

#КонецОбласти