
#Область ОбработчикиСобытийФормы

///////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// обработчик создания формы на сервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборСтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница; 
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница, ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница));
	Элементы.ОтборВидлицеаогоСчета.Видимость = Ложь;

КонецПроцедуры

&НаСервере
// Обработчик после загрузки настроек формы на сервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Элементы.ОтборВидлицеаогоСчета.Видимость = Ложь;

	Если ОтборТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные") Тогда
	 	 Элементы.ОтборИсточникСредств.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Кассы");
		 Элементы.ОтборИсточникСредств.Заголовок       = "Касса";
	ИначеЕсли ОтборТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ЛицевойСчет") Тогда
	     Элементы.ОтборИсточникСредств.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		 Элементы.ОтборИсточникСредств.Заголовок       = "Контрагент";
		 Элементы.ОтборВидлицеаогоСчета.Видимость      = Истина;
	ИначеЕсли ОтборТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные") Тогда
	     Элементы.ОтборИсточникСредств.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
		 Элементы.ОтборИсточникСредств.Заголовок       = "Банковский счет";
	Иначе		 
		Элементы.ОтборИсточникСредств.ОграничениеТипа = Новый ОписаниеТипов;
		Элементы.ОтборИсточникСредств.Заголовок       = "Источник средств";
	КонецЕсли;	
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница, ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница));
    ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ТипДенежныхСредств", ОтборТипДенежныхСредств, ЗначениеЗаполнено(ОтборТипДенежныхСредств));
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ИсточникСписанияСредств", ОтюборИсточникСредств, ЗначениеЗаполнено(ОтюборИсточникСредств));
    ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ИсточникВидЛицевогоСчета", ОтборИсточникВидЛицевогоСчета, ЗначениеЗаполнено(ОтборИсточникВидЛицевогоСчета));
		 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

/////////////////////// УПРАВЛЕНИЕ ПАРАМЕТРАМИ ОТБОРА ///////////////////////////

&НаКлиенте
// При изменении выбора СЕ
Процедура ОтборСтруктурнаяЕдиницаПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница, ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница));
КонецПроцедуры

&НаКлиенте
// При изменении выбора типа денежных средств
Процедура ОтборТипДенежныхСредствПриИзменении(Элемент)
	
	Если ОтборТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные") Тогда
		
		Элементы.ОтборИсточникСредств.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Кассы");
		Элементы.ОтборИсточникСредств.Заголовок       = "Касса";
		ОтборИсточникВидЛицевогоСчета                 = Неопределено;
		Элементы.ОтборВидлицеаогоСчета.Видимость      = Ложь;
		
	 ИначеЕсли ОтборТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ЛицевойСчет") Тогда
		 
		 Элементы.ОтборИсточникСредств.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		 Элементы.ОтборИсточникСредств.Заголовок       = "Контрагент";
		 Элементы.ОтборВидлицеаогоСчета.Видимость      = Истина;
		
	ИначеЕсли ОтборТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные") Тогда
		
		Элементы.ОтборИсточникСредств.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
		Элементы.ОтборИсточникСредств.Заголовок       = "Банковский счет";
		ОтборИсточникВидЛицевогоСчета                 = Неопределено;
		Элементы.ОтборВидлицеаогоСчета.Видимость      = Ложь;

	Иначе
		
		Элементы.ОтборИсточникСредств.ОграничениеТипа = Новый ОписаниеТипов;
		Элементы.ОтборИсточникСредств.Заголовок       = "Источник средств";
		ОтборИсточникВидЛицевогоСчета                 = Неопределено;
		Элементы.ОтборВидлицеаогоСчета.Видимость      = Ложь;
		
	КонецЕсли;	
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ТипДенежныхСредств", ОтборТипДенежныхСредств, ЗначениеЗаполнено(ОтборТипДенежныхСредств));
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ИсточникВидЛицевогоСчета", ОтборИсточникВидЛицевогоСчета, ЗначениеЗаполнено(ОтборИсточникВидЛицевогоСчета));
 
КонецПроцедуры

&НаКлиенте
// При изменении выбора источника средств
Процедура ОтборИсточникСредствПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ИсточникСписанияСредств", ОтюборИсточникСредств, ЗначениеЗаполнено(ОтюборИсточникСредств));
КонецПроцедуры

&НаКлиенте
// При изменении выбора вида лицевого счета
Процедура ОтборИсточникВидЛицевогоСчетаПриИзменении(Элемент)
	 ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ИсточникВидЛицевогоСчета", ОтборИсточникВидЛицевогоСчета, ЗначениеЗаполнено(ОтборИсточникВидЛицевогоСчета));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////// ОБРАБОТЧИК КНОПОК СОЗДАНИЯ ДОКУМЕНТОВ ///////////////////

 &НаКлиенте
// Процедура вызывается обработчиком любой кнопки создания документа 
Процедура ОбщийОбработчикСозданияДокументов(Команда)
	
	ПараметрТипДенСредств = Неопределено;
	ПараметрТипДенСредств = ?(СтрЧислоВхождений(Команда.Имя,"ЛицевойСчет")                 >0 ,ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ЛицевойСчет"),ПараметрТипДенСредств);
	ПараметрТипДенСредств = ?(СтрЧислоВхождений(Команда.Имя,"Безналичные")                 >0 ,ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные"),ПараметрТипДенСредств);
    ПараметрТипДенСредств = ?(СтрЧислоВхождений(Команда.Имя,"Наличные")                    >0 ,ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные"),ПараметрТипДенСредств);
			
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Основание", Новый Структура("ТипДенежныхСредств",ПараметрТипДенСредств));
	ОткрытьФорму("Документ.ПеремещениеДенежныхСредств.ФормаОбъекта", СтруктураПараметры);

КонецПроцедуры

&НаКлиенте
// Процедура - обработка команды "Создать"
//
Процедура КомандаСоздать(Команда)
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить("Наличные", "Наличные");
	СписокКнопок.Добавить("ЛицевойСчет", "Лицевой счет");
	СписокКнопок.Добавить("Безналичные", "Безналичные");
	
	Оповещение = Новый ОписаниеОповещения("КомандаСоздатьОбработкаВыбора", ЭтотОбъект, СписокКнопок);									
	ПоказатьВыборИзМеню(Оповещение, СписокКнопок, ТекущийЭлемент);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик выбора при нажатии на кнопку "Создать"
//
Процедура КомандаСоздатьОбработкаВыбора(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли Параметры.НайтиПоЗначению(Результат.Значение) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Команда = Новый Структура;
	Команда.Вставить("Имя", Результат.Значение);
	ОбщийОбработчикСозданияДокументов(Команда);
	
КонецПроцедуры

 #КонецОбласти