
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОбратнуюСтепеньРодства(СтепеньРодства, ПолКлиента) Экспорт

	ОбратнаяСтепеньРодства = Справочники.СтепеньРодства.ПустаяСсылка();
	
	Если ПолКлиента = Перечисления.ПолФизическогоЛица.Мужской Тогда
		ОбратнаяСтепеньРодства = СтепеньРодства.ОбратнаяСвязьМуж;
	ИначеЕсли ПолКлиента = Перечисления.ПолФизическогоЛица.Женский Тогда
		ОбратнаяСтепеньРодства = СтепеньРодства.ОбратнаяСвязьЖен;
	КонецЕсли;
	
	Возврат ОбратнаяСтепеньРодства;
	
КонецФункции

Функция ПолучитьКодСтепениРодства(СтепеньРодства) Экспорт

	Если СтепеньРодства = Справочники.СтепеньРодства.Жена Или СтепеньРодства = Справочники.СтепеньРодства.Муж Тогда
		КодСтепениРодства = "29";
	ИначеЕсли СтепеньРодства = Справочники.СтепеньРодства.Дочь Или СтепеньРодства = Справочники.СтепеньРодства.Сын Тогда
		КодСтепениРодства = "2";
	ИначеЕсли СтепеньРодства = Справочники.СтепеньРодства.Брат Тогда
		КодСтепениРодства = "20";
	ИначеЕсли СтепеньРодства = Справочники.СтепеньРодства.Внук Или СтепеньРодства = Справочники.СтепеньРодства.Внучка Тогда
		КодСтепениРодства = "9";
	ИначеЕсли СтепеньРодства = Справочники.СтепеньРодства.Дедушка Тогда
		КодСтепениРодства = "10";
	ИначеЕсли СтепеньРодства = Справочники.СтепеньРодства.Мать Тогда
		КодСтепениРодства = "31";
	ИначеЕсли СтепеньРодства = Справочники.СтепеньРодства.Отец Тогда
		КодСтепениРодства = "32";
	ИначеЕсли СтепеньРодства = Справочники.СтепеньРодства.Племянник Или СтепеньРодства = Справочники.СтепеньРодства.Племянница Тогда
		КодСтепениРодства = "21";
	Иначе
		КодСтепениРодства = "3"; // Законный представитель
	КонецЕсли;
	
	Возврат КодСтепениРодства;
	
КонецФункции

#КонецОбласти