
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Получим настройки из константы
	ХранилищеСтруктураОбязательныеПоля = Константы.ОбязательныеПоляКлиенты.Получить();
	СтруктураОбязательныеПоля = ХранилищеСтруктураОбязательныеПоля.Получить();	
	СписокПолей = СоздатьСписокОбязательныхПолей();
    Обязательно = Ложь;
	
	Если СтруктураОбязательныеПоля <> Неопределено И ТипЗнч(СтруктураОбязательныеПоля) = Тип("Структура") Тогда
		// Загрузим настройки в тч "обязательные поля"	
		ОбязательныеПоля.Очистить();		
		Для Каждого ОбязательноеПоле Из СписокПолей Цикл
			НС = ОбязательныеПоля.Добавить();
	        НС.Поле = ОбязательноеПоле.Значение;
			НС.ПредставлениеПоля = ОбязательноеПоле.Представление;
			СтруктураОбязательныеПоля.Свойство(НС.Поле,Обязательно);
			НС.Обязательно = ?(Обязательно <> Неопределено, Обязательно, Ложь);
		КонецЦикла;
	
	Иначе
		// Создадим "обязателные поля" вручную		
		Для Каждого Поле Из СписокПолей Цикл
			НС = ОбязательныеПоля.Добавить();
			НС.Поле = Поле.Значение;
			НС.ПредставлениеПоля = Поле.Представление;
			НС.Обязательно = Ложь;
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	
	СтруктураОбязательныеПоля = Новый Структура;
	
	Для Каждого СтрокаПоля Из ОбязательныеПоля Цикл
		
		СтруктураОбязательныеПоля.Вставить(СтрокаПоля.Поле, СтрокаПоля.Обязательно);	
		
	КонецЦикла;
	
	СохранитьОбязательныеПоля(СтруктураОбязательныеПоля);
	
	Оповестить("ОБНОВИТЬ_ОБЯЗАТЕЛЬНЫЕ_ПОЛЯ");
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьОбязательныеПоля(СтруктураОбязательныеПоля)
	
	Хранилище = Новый ХранилищеЗначения(СтруктураОбязательныеПоля);
	
	Константы.ОбязательныеПоляКлиенты.Установить(Хранилище);
	
КонецПроцедуры

&НаСервере
Функция СоздатьСписокОбязательныхПолей()
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("КЛИЕНТ_Фамилия", "Фамилия");
	СписокПолей.Добавить("КЛИЕНТ_Имя", "Имя");
	СписокПолей.Добавить("КЛИЕНТ_Отчество", "Отчество");
	СписокПолей.Добавить("КЛИЕНТ_Пол", "Пол");
	СписокПолей.Добавить("КЛИЕНТ_ДатаРождения", "Дата рождения пациента");
	СписокПолей.Добавить("КЛИЕНТ_Родитель", "Группа пациентов");
	СписокПолей.Добавить("КЛИЕНТ_СоциальныйСтатус", "Социальный статус");
	СписокПолей.Добавить("КЛИЕНТ_ИсточникИнформации", "Источник информации");
	СписокПолей.Добавить("КЛИЕНТ_ПредставлениеКИ_2", "Адрес");
	СписокПолей.Добавить("КЛИЕНТ_ПредставлениеКИ_0", "Телефон");
	СписокПолей.Добавить("КЛИЕНТ_ПредставлениеКИ_1", "Email");
	СписокПолей.Добавить("КЛИЕНТ_ВидДокумента", "Вид документа");
	СписокПолей.Добавить("КЛИЕНТ_Серия", "Серия");
	СписокПолей.Добавить("КЛИЕНТ_Номер", "Номер");
	СписокПолей.Добавить("КЛИЕНТ_ДатаВыдачи", "Дата выдачи");
	СписокПолей.Добавить("КЛИЕНТ_КодПодразделения", "Код подразделения");
	СписокПолей.Добавить("КЛИЕНТ_КемВыдан", "Кем выдан");	
	СписокПолей.Добавить("КЛИЕНТ_Куратор", "Куратор");
	
	Возврат СписокПолей;
	
КонецФункции	

#КонецОбласти

