#Область СлужебныеПроцедурыИФункции

// Получить текущие задачи для пользователя определенных временем срабатывания 
Функция ПолучитьТекущиеЗадачиДляПользователяПоВремени(Пользователь = Неопределено, СтруктурнаяЕдиница = Неопределено) Экспорт
	
	ЗапросВыборка = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                             |	ЗадачаПользователей.Ссылка
	                             |ИЗ
	                             |	Задача.ЗадачаПользователей КАК ЗадачаПользователей
	                             |ГДЕ
								 |	ЗадачаПользователей.ПометкаУдаления = ЛОЖЬ
								 |	И ЗадачаПользователей.Выполнена = ЛОЖЬ
	                             |	И ЗадачаПользователей.НапоминаниеИспользовать = ИСТИНА
	                             |	И ЗадачаПользователей.НапоминаниеДатаНачала < &ТекущаяДата
								 |	И ВЫБОР
	                             |		КОГДА &ИсполнительИспользовать = ИСТИНА
	                             |			ТОГДА ВЫБОР
	                             |					КОГДА ЗадачаПользователей.Исполнитель ССЫЛКА Справочник.Пользователи И ЗадачаПользователей.Исполнитель <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	                             |						ТОГДА ЗадачаПользователей.Исполнитель = &Исполнитель
	                             |					КОГДА ЗадачаПользователей.Исполнитель ССЫЛКА Справочник.ГруппыПользователей И ЗадачаПользователей.Исполнитель <> ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ПустаяСсылка)
	                             |						ТОГДА &Исполнитель В
	                             |								(ВЫБРАТЬ
	                             |									СоставГруппыПользователей.Пользователь
	                             |								ИЗ
	                             |									Справочник.ГруппыПользователей.Состав КАК СоставГруппыПользователей
	                             |								ГДЕ
	                             |									СоставГруппыПользователей.Ссылка = ЗадачаПользователей.Исполнитель)
	                             |							ИЛИ ЗадачаПользователей.Исполнитель = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)
	                             |					ИНАЧЕ ИСТИНА
	                             |				КОНЕЦ
	                             |		ИНАЧЕ ИСТИНА
	                             |		КОНЕЦ
	                             |	И ВЫБОР
	                             |			КОГДА &СтруктурнаяЕдиницаИспользовать = ИСТИНА
	                             |				ТОГДА ЗадачаПользователей.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                             |			ИНАЧЕ ИСТИНА
	                             |		КОНЕЦ
	                             |	И ВЫБОР
	                             |			КОГДА ЗадачаПользователей.НапоминаниеРежим <> ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ПоСобытию)
	                             |					И ЗадачаПользователей.НапоминаниеДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
	                             |				ТОГДА &ТекущаяДата > ЗадачаПользователей.НапоминаниеДатаНачала
	                             |			ИНАЧЕ ЛОЖЬ
	                             |		КОНЕЦ");
	
	
	ЗапросВыборка.УстановитьПараметр("ТекущаяДата", ТекущаяДата());							 
	ЗапросВыборка.УстановитьПараметр("ИсполнительИспользовать", 		Пользователь <> Null);							 
	ЗапросВыборка.УстановитьПараметр("Исполнитель", 					?(ЗначениеЗаполнено(Пользователь), Пользователь, ПараметрыСеанса.ТекущийПользователь));
	ЗапросВыборка.УстановитьПараметр("СтруктурнаяЕдиницаИспользовать",  СтруктурнаяЕдиница <> Null);
	ЗапросВыборка.УстановитьПараметр("СтруктурнаяЕдиница", 				?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница));
	Задача = ЗапросВыборка.Выполнить().Выгрузить();
	   
    Возврат Задача.ВыгрузитьКолонку("Ссылка");
   
КонецФункции

// Получить задачи для пользователя по клиенту
Функция ПолучитьТекущиеЗадачиДляПользователяПоПосещениюКлиента(Клиент, Пользователь = Неопределено, СтруктурнаяЕдиница = Неопределено) Экспорт
	
	ЗапросВыборка = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                             |	ЗадачаПользователей.Ссылка
	                             |ИЗ
	                             |	Задача.ЗадачаПользователей КАК ЗадачаПользователей
	                             |ГДЕ
	                             |	ЗадачаПользователей.Выполнена = ЛОЖЬ
								 |	И ЗадачаПользователей.ПометкаУдаления = ЛОЖЬ
	                             |	И ЗадачаПользователей.НапоминаниеИспользовать = ИСТИНА
								 |	И ЗадачаПользователей.НапоминаниеРежим = ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ПоСобытию)
								 |	И ЗадачаПользователей.ЗадачаПредмет = &Клиент
	                             |	И ВЫБОР
	                             |		КОГДА &ИсполнительИспользовать = ИСТИНА
	                             |			ТОГДА ВЫБОР
	                             |					КОГДА ЗадачаПользователей.Исполнитель ССЫЛКА Справочник.Пользователи И ЗадачаПользователей.Исполнитель <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	                             |						ТОГДА ЗадачаПользователей.Исполнитель = &Исполнитель
	                             |					КОГДА ЗадачаПользователей.Исполнитель ССЫЛКА Справочник.ГруппыПользователей И ЗадачаПользователей.Исполнитель <> ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ПустаяСсылка)
	                             |						ТОГДА &Исполнитель В
	                             |								(ВЫБРАТЬ
	                             |									СоставГруппыПользователей.Пользователь
	                             |								ИЗ
	                             |									Справочник.ГруппыПользователей.Состав КАК СоставГруппыПользователей
	                             |								ГДЕ
	                             |									СоставГруппыПользователей.Ссылка = ЗадачаПользователей.Исполнитель)
	                             |							ИЛИ ЗадачаПользователей.Исполнитель = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)
	                             |					ИНАЧЕ ИСТИНА
	                             |				КОНЕЦ
	                             |		ИНАЧЕ ИСТИНА
	                             |		КОНЕЦ								 
	                             |	И ВЫБОР
	                             |			КОГДА &СтруктурнаяЕдиницаИспользовать = ИСТИНА
	                             |				ТОГДА ЗадачаПользователей.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                             |			ИНАЧЕ ИСТИНА
	                             |		КОНЕЦ");
	
	ЗапросВыборка.УстановитьПараметр("Клиент",							Клиент);							 
	ЗапросВыборка.УстановитьПараметр("ИсполнительИспользовать", 		Пользователь <> Null);							 
	ЗапросВыборка.УстановитьПараметр("Исполнитель", 					?(ЗначениеЗаполнено(Пользователь), Пользователь, ПараметрыСеанса.ТекущийПользователь));
	ЗапросВыборка.УстановитьПараметр("СтруктурнаяЕдиницаИспользовать",  СтруктурнаяЕдиница <> Null);
	ЗапросВыборка.УстановитьПараметр("СтруктурнаяЕдиница", 				?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница));
	Задача = ЗапросВыборка.Выполнить().Выгрузить();
	   
    Возврат Задача.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Полуить неактивные задачи для пользователя
//
Функция ПолучитьСписокНеАктивныхЗадачПользователя() Экспорт
	
	ЗапросВыборка = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                             |	ЗадачаПользователей.Ссылка
	                             |ИЗ
	                             |	Задача.ЗадачаПользователей КАК ЗадачаПользователей
	                             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                             |			ГруппыПользователейСостав.Пользователь КАК Пользователь,
	                             |			ГруппыПользователейСостав.Ссылка КАК Ссылка
	                             |		ИЗ
	                             |			Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав) КАК ВложенныйЗапрос
	                             |		ПО (ВЫБОР
	                             |				КОГДА ЗадачаПользователей.Исполнитель ССЫЛКА Справочник.ГруппыПользователей
	                             |					ТОГДА ЗадачаПользователей.Исполнитель = ВложенныйЗапрос.Ссылка.Ссылка
	                             |				ИНАЧЕ ЛОЖЬ
	                             |			КОНЕЦ)
	                             |ГДЕ
	                             |	ВЫБОР
	                             |			КОГДА ЗадачаПользователей.Исполнитель ССЫЛКА Справочник.Пользователи
	                             |				ТОГДА ЗадачаПользователей.Исполнитель = &Исполнитель
	                             |			ИНАЧЕ ВЫБОР
	                             |					КОГДА ЗадачаПользователей.Исполнитель = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)
	                             |						ТОГДА ИСТИНА
	                             |					ИНАЧЕ &Исполнитель В (ВложенныйЗапрос.Пользователь)
	                             |				КОНЕЦ
	                             |		КОНЕЦ
	                             |	И ЗадачаПользователей.Выполнена = ЛОЖЬ
	                             |	И ЗадачаПользователей.НапоминаниеИспользовать = ЛОЖЬ");
	
	
	ЗапросВыборка.УстановитьПараметр("Исполнитель", ПараметрыСеанса.ТекущийПользователь);
	Задача = ЗапросВыборка.Выполнить().Выгрузить();
	   
    Возврат Задача.ВыгрузитьКолонку("Ссылка");	
	
КонецФункции

// Получить выполненые задачи для пользователя
//
Функция ПолучитьСписокВыполненныхЗадачПользователя() Экспорт
	
	ЗапросВыборка = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                             |	ЗадачаПользователей.Ссылка
	                             |ИЗ
	                             |	Задача.ЗадачаПользователей КАК ЗадачаПользователей
	                             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                             |			ГруппыПользователейСостав.Пользователь КАК Пользователь,
	                             |			ГруппыПользователейСостав.Ссылка КАК Ссылка
	                             |		ИЗ
	                             |			Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав) КАК ВложенныйЗапрос
	                             |		ПО (ВЫБОР
	                             |				КОГДА ЗадачаПользователей.Исполнитель ССЫЛКА Справочник.ГруппыПользователей
	                             |					ТОГДА ЗадачаПользователей.Исполнитель = ВложенныйЗапрос.Ссылка.Ссылка
	                             |				ИНАЧЕ ЛОЖЬ
	                             |			КОНЕЦ)
	                             |ГДЕ
	                             |	ВЫБОР
	                             |			КОГДА ЗадачаПользователей.Исполнитель ССЫЛКА Справочник.Пользователи
	                             |				ТОГДА ЗадачаПользователей.Исполнитель = &Исполнитель
	                             |			ИНАЧЕ ВЫБОР
	                             |					КОГДА ЗадачаПользователей.Исполнитель = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)
	                             |						ТОГДА ИСТИНА
	                             |					ИНАЧЕ &Исполнитель В (ВложенныйЗапрос.Пользователь)
	                             |				КОНЕЦ
	                             |		КОНЕЦ
	                             |	И ЗадачаПользователей.Выполнена = ИСТИНА");
	
	
	ЗапросВыборка.УстановитьПараметр("Исполнитель", ПараметрыСеанса.ТекущийПользователь);
	Задача = ЗапросВыборка.Выполнить().Выгрузить();
	   
    Возврат Задача.ВыгрузитьКолонку("Ссылка");	
	
КонецФункции

#КонецОбласти

