#Область ОбработчикиСобытий

// Обработчик заполнения объекта данными
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Дата                    = ТекущаяДата();
	СтруктурнаяЕдиница      = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	Исполнитель             = ПараметрыСеанса.ТекущийПользователь;
	ЗадачаАвтор             = ПараметрыСеанса.ТекущийПользователь;
	НапоминаниеИспользовать = Истина;
	НапоминаниеРежим        = Перечисления.ВариантыНапоминаний.ЧерезУказанноеВремя;
	НапоминаниеДатаНачала   = Дата + 3600;

	// На основании документа взаимодействия
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Взаимодействие") Тогда
		
		Дата                            = ДанныеЗаполнения.Дата;
		Наименование					= Строка(ДанныеЗаполнения.ВидОперации) + ": " + ДанныеЗаполнения.Тема;
		СтруктурнаяЕдиница              = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
		Исполнитель             		= ДанныеЗаполнения.АвторДокумента;
		ЗадачаТема                      = Строка(ДанныеЗаполнения.ВидОперации) + ": " + ДанныеЗаполнения.Тема;
		ЗадачаОписание                  = ДанныеЗаполнения.Содержание;
		ЗадачаПредмет                   = ДанныеЗаполнения;  
		ЗадачаАвтор                     = ДанныеЗаполнения.АвторДокумента;
		НапоминаниеИспользовать         = ДанныеЗаполнения.НапоминаниеИспользовать;
		НапоминаниеРежим        		= ДанныеЗаполнения.НапоминаниеРежим;
		НапоминаниеДатаНачала   		= ДанныеЗаполнения.НапоминаниеДатаНачала;		
		ЗадачаНазначеннаяДатаВыполнения = ДанныеЗаполнения.ДатаНапоминания;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда	
		Если ДанныеЗаполнения.Свойство("ЗадачаПредмет") И ЗначениеЗаполнено(ДанныеЗаполнения.ЗадачаПредмет) Тогда
			ЭтотОбъект.ЗадачаПредмет = ДанныеЗаполнения.ЗадачаПредмет;		
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

// Обработка проверки заполнения
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Наименование  = ЗадачаТема;
	  
КонецПроцедуры

// Обработка перед записью объекта
Процедура ПередЗаписью(Отказ)
	
	ПредставлениеЗадачи = ЗадачаТема+?(ЗадачаПредмет<>Неопределено,", "+Строка(ЗадачаПредмет),"");
	
	Если Выполнена Тогда
		ДатаИсполнения  = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

// Обработчик при записи объекта
Процедура ПриЗаписи(Отказ)
	
	Если Выполнена Тогда
				
		// Если предметом задачи я вляется взаимодействие, выполнить его.
		Если ТипЗнч(ЗадачаПредмет) = Тип("ДокументСсылка.Взаимодействие") Тогда // И НЕ ЗадачаПредмет.ЗадачаОтработана  Тогда 
			ОбъектДокумента = ЗадачаПредмет.ПолучитьОбъект();
			ОбъектДокумента.ЗадачаОтработана = Истина;
			ОбъектДокумента.Записать();
		КонецЕсли;	
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
