
#Область СлужебныеПроцедурыИФункции

// Процедура - Актуализировать загруженность всех врачей.
//
// Параметры:
//  ОповещатьОХодеВыполнения - 	 - 
//
Процедура АктуализироватьЗагруженностьВсехВрачей(ОповещатьОХодеВыполнения = Ложь) Экспорт
	
	// Используется для регламентного задания "АктуализацияЗагруженностиВрачей"
	
	Если НЕ ПривилегированныйРежим() Тогда 															
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	ТекущаяДата = ТекущаяДатаСеанса();
	НачалоПериода = ТекущаяДата - (86400 * 15); // 15 дней до.
	КонецПериода = ТекущаяДата + (86400 * 7); // 7 дней после.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВремяРаботыСотрудниковПлан.Сотрудник КАК Врач,
	|	ВремяРаботыСотрудниковПлан.Минуты / 60 КАК ПоПлану,
	|	0 КАК ПоФакту
	|ПОМЕСТИТЬ ВТ_Итогов
	|ИЗ
	|	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
	|ГДЕ
	|	ВремяРаботыСотрудниковПлан.ДатаВремяНачала >= &НачПериода
	|	И ВремяРаботыСотрудниковПлан.ДатаВремяНачала <= &КонПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СобытиеУслуги.Ссылка.СтруктурнаяЕдиница,
	|	СобытиеУслуги.Сотрудник,
	|	0,
	|	РАЗНОСТЬДАТ(СобытиеУслуги.ДатаНачала, СобытиеУслуги.ДатаОкончания, МИНУТА) / 60
	|ИЗ
	|	Документ.Событие.Услуги КАК СобытиеУслуги
	|ГДЕ
	|	СобытиеУслуги.Ссылка.Проведен
	|	И НЕ СобытиеУслуги.Ссылка.ПометкаУдаления
	|	И НЕ СобытиеУслуги.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ СобытиеУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|	И НЕ СобытиеУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемНеСостоялся)
	|	И СобытиеУслуги.ДатаНачала >= &НачПериода
	|	И СобытиеУслуги.ДатаНачала <= &КонПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итогов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТ_Итогов.Врач КАК Сотрудник,
	|	ВЫРАЗИТЬ(СУММА(ВТ_Итогов.ПоПлану) КАК ЧИСЛО(15, 2)) КАК ВремяРаботы,
	|	ВЫРАЗИТЬ(СУММА(ВТ_Итогов.ПоФакту) КАК ЧИСЛО(15, 2)) КАК ВремяПриемов,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ_Итогов.ПоПлану) = 0
	|			ТОГДА СУММА(ВТ_Итогов.ПоПлану)
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВТ_Итогов.ПоФакту) * 100 / СУММА(ВТ_Итогов.ПоПлану) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ПроцентЗагрузки
	|ИЗ
	|	ВТ_Итогов КАК ВТ_Итогов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Итогов.СтруктурнаяЕдиница,
	|	ВТ_Итогов.Врач";
	Запрос.УстановитьПараметр("НачПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонПериода", КонецПериода);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 

	НаборЗписей = РегистрыСведений.ЗагруженностьВрачей.СоздатьНаборЗаписей();
	
	НаборЗписей.Загрузить(РезультатЗапроса);
	НаборЗписей.ОбменДанными.Загрузка = Истина;
	
	Попытка
		НаборЗписей.Записать(Истина);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'АктуализацияЗагруженностиВрачей'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,
								,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
		
КонецПроцедуры

#КонецОбласти
