			   
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда
	
#Область СлужебныеПроцедурыИФункции
	
// Функция - Получить стурктуру фото картинки чат бота
//
// Параметры:
//  СотрудникЧатБота		 - 	 - 
//  УникальныйИдентификатор	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтурктуруФотоКартинкиЧатБота(СотрудникЧатБота = Неопределено, УникальныйИдентификатор) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	СтурктураФото = Новый Структура;
	СтурктураФото.Вставить("Видимость"		, Ложь);
	СтурктураФото.Вставить("АдресКартинки"	, Неопределено);
	СтурктураФото.Вставить("РазмерКартинки"	, РазмерКартинки.АвтоРазмер);
	
	ФайлКартинки = Неопределено;
	Если ЗначениеЗаполнено(СотрудникЧатБота) Тогда 
		ФайлКартинки = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СотрудникЧатБота, "ФайлКартинки");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФайлКартинки) Тогда 
		СтурктураФото.Вставить("Видимость"		, Истина);
		СсылкаНаДвоичныеДанные = РаботаСФайламиВызовСервераСтоматология.СсылкаНаДвоичныеДанныеФайла(ФайлКартинки, УникальныйИдентификатор);
		СтурктураФото.Вставить("АдресКартинки"	, ?(СсылкаНаДвоичныеДанные = Неопределено, "", СсылкаНаДвоичныеДанные));
		СтурктураФото.Вставить("РазмерКартинки"	, РазмерКартинки.Пропорционально);
	Иначе 
		СтурктураФото.Вставить("АдресКартинки"	, ПоместитьВоВременноеХранилище(БиблиотекаКартинок.ФотоПоУмолчанию.ПолучитьДвоичныеДанные(), УникальныйИдентификатор));
		СтурктураФото.Вставить("РазмерКартинки"	, РазмерКартинки.РеальныйРазмер);
	КонецЕсли;
		
	Возврат СтурктураФото;

КонецФункции	

#КонецОбласти

#КонецЕсли