
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	Сотрудники.Ссылка КАК Количество,
		|	Сотрудники.ЭтоГруппа КАК ЭтоГруппа,
		|	Сотрудники.Наименование КАК Наименование,
		|	Сотрудники.Родитель КАК Родитель,
		|	НастройкиСотрудников.ДатаПриема КАК ДатаПриема,
		|	НастройкиСотрудников.ДатаУвольнения КАК ДатаУвольнения
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
		|		ПО Сотрудники.Ссылка = НастройкиСотрудников.Сотрудник
		|ГДЕ
		|	НЕ Сотрудники.ПометкаУдаления
		|	И НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И Сотрудники.ЭтоГруппа = ЛОЖЬ
		|	И Сотрудники.Ссылка В(&СписокСотрудников)
		|	И ВЫБОР
		|			КОГДА &ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 31, 23, 59, 59)
		|					И НастройкиСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА НастройкиСотрудников.ДатаПриема <= &ДатаОкончания
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
		|					И НастройкиСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА НастройкиСотрудников.ДатаУвольнения >= &ДатаНачала
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Количество УБЫВ,
		|	ЭтоГруппа
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Количество)
		|ПО
		|	Сотрудник ИЕРАРХИЯ";  
	
	Запрос.УстановитьПараметр("ДатаНачала"			, Параметры.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"		, Параметры.ДатаОкончания);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, Параметры.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("СписокСотрудников"	, Параметры.СписокСотрудников);
	
	РезультатДеревоСотрудников = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ГруппаВсе                 		= ДеревоСотрудников.ПолучитьЭлементы().Добавить();
	ГруппаВсе.Сотрудник       		= "Все";
	ГруппаВсе.ВариантКартинки 		= 0;				
	ГруппаВсе.СотрудникНаименование = "Все";
	
	Для Каждого СтрокаТЧ Из РезультатДеревоСотрудников.Строки Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Родитель) Тогда  
		
			Группа = ГруппаВсе.ПолучитьЭлементы().Добавить();
			Группа.Сотрудник       			= СтрокаТЧ.Сотрудник; 	 
			Группа.ВариантКартинки 		 	= ?(СтрокаТЧ.ЭтоГруппа = Истина, 0, 1);
            Группа.СотрудникНаименование 	= ?(СтрокаТЧ.ЭтоГруппа = Истина, СтрокаТЧ.Наименование + "(" + СтрокаТЧ.Количество + ")", СтрокаТЧ.Наименование);		
		КонецЕсли; 
		
		Если СтрокаТЧ.ЭтоГруппа = Истина И СтрокаТЧ.Строки.Количество() > 0 Тогда
			ОбходДереваРекурсивно(Группа, СтрокаТЧ);	
		КонецЕсли;
  		
	КонецЦикла;

КонецПроцедуры 

&НаСервере
// Функция - Обход дерева детально.
// 
// Возвращаемое значение:
//   - 
//
Функция ОбходДереваРекурсивно(РодительДерева, СтрокаДереваРодитель)
	
	Для Каждого СтрокаДерева Из СтрокаДереваРодитель.Строки Цикл 	
		Группа = РодительДерева.ПолучитьЭлементы().Добавить();
		Группа.Сотрудник       			= СтрокаДерева.Сотрудник; 	 
		Группа.ВариантКартинки 		 	= ?(СтрокаДерева.ЭтоГруппа = Истина, 0, 1);
		Группа.СотрудникНаименование 	= ?(СтрокаДерева.ЭтоГруппа = Истина, СтрокаДерева.Наименование + "(" + СтрокаДерева.Количество + ")", СтрокаДерева.Наименование);
		
		Если СтрокаДерева.ЭтоГруппа = Истина И СтрокаДерева.Строки.Количество() > 0 Тогда
			ОбходДереваРекурсивно(Группа, СтрокаДерева);	
		КонецЕсли;
	КонецЦикла;	
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - Дерево сотрудников выбор
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбраннаяСтрока		 - 	 - 
//  Поле				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ДеревоСотрудниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработкаВыбора(СтандартнаяОбработка);	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Дерево сотрудников выбор значения
//
// Параметры:
//  Элемент				 - 	 - 
//  Значение			 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ДеревоСотрудниковВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ОбработкаВыбора(СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - Обработка выбора
//
// Параметры:
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаВыбора(СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ДеревоСотрудников.ТекущиеДанные;
	ЭтаФорма.Закрыть(Новый Структура("Значение", ТекДанные.Сотрудник)); 
	
КонецПроцедуры

#КонецОбласти