
&НаКлиенте
Перем ФлагОткрытия;

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		СКДНастройки = Объект.Ссылка.СхемаКомпоновкиДанных.Получить();
		СКД			 = Объект.Ссылка.СхемаКомпоновкиДанных.Получить();
		// Добавлено по тикету 321976 
		Если Найти(СКД.НаборыДанных[0].Запрос, "Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения") <> 0 Тогда 
			СКДНастройки = Справочники.СегментыНоменклатуры.ПолучитьМакет("ОсновнаяСхема");
			СКД			 = Справочники.СегментыНоменклатуры.ПолучитьМакет("ОсновнаяСхема");	
		КонецЕсли;
	Иначе
		СКДНастройки = Справочники.СегментыНоменклатуры.ПолучитьМакет("ОсновнаяСхема");
		СКД			 = Справочники.СегментыНоменклатуры.ПолучитьМакет("ОсновнаяСхема");
	КонецЕсли;
	
	АдресСКД = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор);
	АдресСКДНастройки = ПоместитьВоВременноеХранилище(СКДНастройки, Новый УникальныйИдентификатор);	
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		Сегменты.СкомпоноватьПоСегменту(Объект.Ссылка, Результат, ДанныеРасшифровки);
	КонецЕсли;
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриОткрытии"
//
Процедура ПриОткрытии(Отказ)

	УправлениеДекорациейНадписью();
	
КонецПроцедуры

&НаСервере
// Процедура - При чтении на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.СпособФормирования = ПредопределенноеЗначение("Перечисление.СпособыФормированияСегментов.ПериодическиОбновлять")
			И Сегменты.ПолучитьПризнакЗаполненностиНастроек(Объект.Ссылка, АдресСКД) = Ложь Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Правила формирования сегмента не указаны. Предварительно необходимо их настроить!';en='Rules formations segment not specified. Pre is necessary their tune!'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
// Процедура - обработчик события "ПередЗаписьюНаСервере"
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресСКД));	
	Если Объект.СпособФормирования = Перечисления.СпособыФормированияСегментов.ПериодическиОбновлять Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("Расписание", Расписание);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - При записи на сервере
//
// Параметры:
//  Отказ			 - 	 - 
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПослеЗаписи"
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Сегменты.СкомпоноватьПоСегменту(Объект.Ссылка, Результат, ДанныеРасшифровки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработчик события "ПриИзменении"
//
Процедура СпособФормированияПриИзменении(Элемент)

	УправлениеДекорациейНадписью();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаРасшифровки".
//
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка) <> Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Элемент = РасшифроватьЭлемент(Расшифровка);
	Если ЗначениеЗаполнено(Элемент) Тогда
		ПоказатьЗначение(,Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "Декорация_Состав_ПравилаНажатие"
//
Процедура Декорация_Состав_ПравилаНажатие(Элемент)
	
	Если Объект.СпособФормирования = ПредопределенноеЗначение("Перечисление.СпособыФормированияСегментов.ПериодическиОбновлять") Тогда 
		
		ЗаголовокФормыНастройкиСхемыКомпоновкиДанных = НСтр("ru = 'Настройки сегмента ""%ИмяСегмента%""'");
		ЗаголовокФормыНастройкиСхемыКомпоновкиДанных = СтрЗаменить(ЗаголовокФормыНастройкиСхемыКомпоновкиДанных, "%ИмяСегмента%", Объект.Наименование);
		
		Если ФлагОткрытия = Ложь Тогда
			ФлагОткрытия = Истина;
		Иначе
			АдресСКДНастройки = АдресСКД;	
		КонецЕсли;
		
		ОткрытьФорму("ОбщаяФорма.УпрощеннаяНастройкаСхемыКомпоновкиДанных",
			Новый Структура("АдресСхемыКомпоновкиДанных, АдресСхемыКомпоновкиДанныхНастройки, ИсточникШаблонов, Заголовок",
			АдресСКД, АдресСКДНастройки,
			Объект.Ссылка,
			ЗаголовокФормыНастройкиСхемыКомпоновкиДанных),,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);		
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ДобавитьВСегмент(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = НСтр("ru='Для выполнения данной операции необходимо записать элемент. Записать?';en='For run given operations is necessary writedown element. WriteDown?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьВСегментОтвет", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;	
	
	ДобавитьВСегментОбработка();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура УдалитьИзСегмента(Команда)
	
	мРасшифровки = Новый Массив();
	Области = Результат.ВыделенныеОбласти;
	
	Для Каждого Область Из Области Цикл
		Для Строка = Область.Верх По Область.Низ Цикл
			Для Столбец = 1 По 200 Цикл
				Расшифровка = Результат.Область("R" + Строка + "C" + Столбец).Расшифровка;
				Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
					мРасшифровки.Добавить(Расшифровка);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	УдалитьЭлементы(мРасшифровки);
	Сегменты.СкомпоноватьПоСегменту(Объект.Ссылка, Результат, ДанныеРасшифровки);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура СформироватьСегмент(Команда)
	
	Если Объект.СпособФормирования = ПредопределенноеЗначение("Перечисление.СпособыФормированияСегментов.ПериодическиОбновлять")
			И Сегменты.ПолучитьПризнакЗаполненностиНастроек(Объект.Ссылка, АдресСКД) = Ложь Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Правила формирования сегмента не указаны. Предварительно необходимо их настроить!';en='Rules formations segment not specified. Pre is necessary their tune!'"));
		Возврат;
	КонецЕсли;
	
	Сегменты.СкомпоноватьПоСегменту(Объект.Ссылка, Результат, ДанныеРасшифровки, АдресСКД);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - Добавить в сегмент обработка.
// Завершение процедуры - Добавить в сегмент ответ
Процедура ДобавитьВСегментОбработка() 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьВСегментОбработкаЗавершение", ЭтаФорма);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", Новый Структура("МножественныйВыбор", Истина) , ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить в сегмент обработка завершение
// Завершение немодального открытия окна формы - Справочник Номенклатура - ФормаВыбора
// Параметры:
//  РезультатВыбора	 - 	 Результат Оповещения 
//  Параметры		 - 	 Параметры Оповещения
//
Процедура ДобавитьВСегментОбработкаЗавершение(РезультатВыбора, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда
		ДобавитьЭлемент(РезультатВыбора);
		Сегменты.СкомпоноватьПоСегменту(Объект.Ссылка, Результат, ДанныеРасшифровки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура формирует заголовок декорации
//
Процедура УправлениеДекорациейНадписью()
	
	Если Объект.СпособФормирования = ПредопределенноеЗначение("Перечисление.СпособыФормированияСегментов.ПериодическиОбновлять") Тогда 
		//Элементы.Декорация_Состав_Правила.Заголовок = "Правила";
		Элементы.Декорация_Состав_Правила.Доступность = Истина;
		Элементы.СформироватьСегмент.Доступность 	= Истина;
		Элементы.ДобавитьВСегмент.Доступность 		= Ложь;	
		Элементы.УдалитьИзСегмента.Доступность 		= Ложь;		
	Иначе 
		//Элементы.Декорация_Состав_Правила.Заголовок = "Состав";
		Элементы.Декорация_Состав_Правила.Доступность = Ложь;		
		Элементы.СформироватьСегмент.Доступность 	= Ложь;
		Элементы.ДобавитьВСегмент.Доступность 		= Истина;	
		Элементы.УдалитьИзСегмента.Доступность 		= Истина;		
		//Элементы.Правила.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Удаляет выбранные элементы из состава сегмента
//
Процедура УдалитьЭлементы(Расшифровки)
	
	ДанныеРасшифровкиОтчета = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	
	Для Каждого Расшифровка Из Расшифровки Цикл
		ЭлементРасшифровки = ДанныеРасшифровкиОтчета.Элементы[Расшифровка];
		Для Каждого ЗначениеПоляРасшифровки Из ЭлементРасшифровки.ПолучитьПоля() Цикл
			Значение = ЗначениеПоляРасшифровки.Значение;
			Если ТипЗнч(Значение) = Тип("СправочникСсылка.Номенклатура") И Значение.ЭтоГруппа Тогда 
				МассивЭлементов = ПолучитьМассивЭлементов(Значение);
				Для Каждого ЭлементМассива Из МассивЭлементов Цикл 
					НаборЗаписей = РегистрыСведений.НоменклатураСегмента.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Сегмент.Установить(Объект.Ссылка);
					НаборЗаписей.Отбор.Номенклатура.Установить(ЭлементМассива);
					НаборЗаписей.Записать();
				КонецЦикла;
			Иначе 	
				НаборЗаписей = РегистрыСведений.НоменклатураСегмента.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Сегмент.Установить(Объект.Ссылка);
				НаборЗаписей.Отбор.Номенклатура.Установить(Значение);
				Попытка
					ЗначениеСледущейРасшифровки = ДанныеРасшифровкиОтчета.Элементы[Расшифровка+1].ПолучитьПоля()[0].Значение;
				Исключение					
				КонецПопытки;									
				НаборЗаписей.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Добавляет элемент в состав сегмента
//
Процедура ДобавитьЭлемент(Элемент)
	
	Если ТипЗнч(Элемент) = Тип("Массив") Тогда
		Для каждого ЭлементМассива Из Элемент Цикл
			ДобавитьЭлемент(ЭлементМассива);		
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Если Элемент.ЭтоГруппа Тогда 
		МассивЭлементов = ПолучитьМассивЭлементов(Элемент);
		Для каждого ЭлементМассива Из МассивЭлементов Цикл
			ДобавитьЭлемент(ЭлементМассива);		
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Запись = РегистрыСведений.НоменклатураСегмента.СоздатьМенеджерЗаписи();
	Запись.Сегмент = Объект.Ссылка;
	Запись.Номенклатура = Элемент;
	
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(Строка(Элемент.Наименование) +  НСтр("ru=' уже включен в сегмент.'"))); 
	Иначе
		Запись.Сегмент = Объект.Ссылка;
		Запись.Номенклатура = Элемент;
		Запись.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Возвращает возможный для просмотра элемент
//
Функция РасшифроватьЭлемент(Расшифровка)
	
	ДанныеРасшифровкиОтчета = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	ЭлементРасшифровки = ДанныеРасшифровкиОтчета.Элементы[Расшифровка];
	
	Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
		Для Каждого ЗначениеПоляРасшифровки Из ЭлементРасшифровки.ПолучитьПоля() Цикл
			Значение = ЗначениеПоляРасшифровки.Значение;
			Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение))
				ИЛИ Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
				Возврат Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
// Функция, возвращает массив подчиненных элементов.
//
Функция ПолучитьМассивЭлементов(Элемент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Номенклатура.Ссылка КАК ЭлементНоменклатура
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Ссылка В ИЕРАРХИИ(&Группа)
	               |	И НЕ Номенклатура.ЭтоГруппа
	               |	И НЕ Номенклатура.ПометкаУдаления";
				   
	Запрос.УстановитьПараметр("Группа", Элемент);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЭлементНоменклатура");
				   
КонецФункции

&НаКлиенте
// Процедура - Добавить в сегмент ответ
// Завершение немодального открытия окна "ПоказатьВопрос()"
// Параметры:
//  РезультатВопроса - 	 Ответ на вопрос 
//  Параметры		 - 	 Параметры вопроса 
Процедура ДобавитьВСегментОтвет(РезультатВопроса, Параметры)  Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	Иначе
		Записать();
	КонецЕсли;
    ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", Новый Структура("МножественныйВыбор", Истина),,,,, Новый ОписаниеОповещения("ДобавитьВСегментЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить в сегмент завершение
// Завершение немодального открытия окна формы -  Справочник Контрагенты - ФормаВыбора
// Параметры:
//  Элемент		 - 	 Результат закрытия формы 
//  Параметры	 - 	 Параметры Оповещения
//
Процедура ДобавитьВСегментЗавершение(Элемент, Параметры)  Экспорт

	Если ЗначениеЗаполнено(Элемент) Тогда
		ДобавитьЭлемент(Элемент);
		Сегменты.СкомпоноватьПоСегменту(Объект.Ссылка, Результат, ДанныеРасшифровки);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
