
#Область ОбработчикиСобытий

// Процедура, обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Дата                    = ТекущаяДатаСеанса();
	ВариантНапоминания      = Перечисления.ВариантыНапоминаний.ЗаВремяОтносительноСобытия;	
	НапоминаниеИспользовать = Ложь;
	ВидВзаимодействия		= Перечисления.ВидыВзаимодействия.ЗвонокИсходящий;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ДополнительнаяЗадача") Тогда 
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
			//ИначеЕсли ДанныеЗаполнения.Свойство("БизнесПроцесс") И ЗначениеЗаполнено(ДанныеЗаполнения.БизнесПроцесс) Тогда
			//	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		ИначеЕсли ДанныеЗаполнения.Свойство("ЗадачаПредмет") И ЗначениеЗаполнено(ДанныеЗаполнения.ЗадачаПредмет) Тогда
			ЭтотОбъект.ЗадачаПредмет = ДанныеЗаполнения.ЗадачаПредмет;
		ИначеЕсли ДанныеЗаполнения.Свойство("Контрагент") И ЗначениеЗаполнено(ДанныеЗаполнения.Контрагент) Тогда
			ЭтотОбъект.ЗадачаПредмет = ДанныеЗаполнения.Контрагент;
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Контрагент") 
			И ЗначениеЗаполнено(ДанныеЗаполнения.Контрагент) 
			И ТипЗнч(ДанныеЗаполнения.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			ЭтотОбъект.Контрагент = ДанныеЗаполнения.Контрагент;
		КонецЕсли;
		
		ЭтотОбъект.СтруктурнаяЕдиница          = ?(ДанныеЗаполнения.Свойство("СтруктурнаяЕдиница")         , ДанныеЗаполнения.СтруктурнаяЕдиница         , ЭтотОбъект.СтруктурнаяЕдиница);		
		ЭтотОбъект.ЗадачаНазначеннаяДата       = ?(ДанныеЗаполнения.Свойство("ЗадачаНазначеннаяДата")      , ДанныеЗаполнения.ЗадачаНазначеннаяДата      , ЭтотОбъект.ЗадачаНазначеннаяДата);
		ЭтотОбъект.ВидВзаимодействия           = ?(ДанныеЗаполнения.Свойство("ВидВзаимодействия")          , ДанныеЗаполнения.ВидВзаимодействия          , ЭтотОбъект.ВидВзаимодействия);
		ЭтотОбъект.ВидВзаимодействияСправочник = ?(ДанныеЗаполнения.Свойство("ВидВзаимодействияСправочник"), ДанныеЗаполнения.ВидВзаимодействияСправочник, ЭтотОбъект.ВидВзаимодействияСправочник);
		ЭтотОбъект.ЗадачаТема                  = ?(ДанныеЗаполнения.Свойство("ЗадачаТема")                 , ДанныеЗаполнения.ЗадачаТема                 , ЭтотОбъект.ЗадачаТема);
		ЭтотОбъект.ЗадачаОписание              = ?(ДанныеЗаполнения.Свойство("ЗадачаОписание")             , ДанныеЗаполнения.ЗадачаОписание             , ЭтотОбъект.ЗадачаОписание);
		ЭтотОбъект.Сделка                      = ?(ДанныеЗаполнения.Свойство("Сделка")                     , ДанныеЗаполнения.Сделка                     , ЭтотОбъект.Сделка);
		ЭтотОбъект.Исполнитель                 = ?(ДанныеЗаполнения.Свойство("Исполнитель")                , ДанныеЗаполнения.Исполнитель                , ЭтотОбъект.Исполнитель);
		ЭтотОбъект.ЗадачаАвтор                 = ?(ДанныеЗаполнения.Свойство("ЗадачаАвтор")                , ДанныеЗаполнения.ЗадачаАвтор                , ЭтотОбъект.ЗадачаАвтор);		
		ЭтотОбъект.Выполнена                   = ?(ДанныеЗаполнения.Свойство("Выполнена")                  , ДанныеЗаполнения.Выполнена                  , ЭтотОбъект.Выполнена);
		
	КонецЕсли;	
	
	ЭтотОбъект.ЗадачаАвтор             			= ?(ЗначениеЗаполнено(ЭтотОбъект.ЗадачаАвтор)		, ЭтотОбъект.ЗадачаАвтор		, ПараметрыСеанса.ТекущийСотрудник);
	ЭтотОбъект.Исполнитель            			= ?(ЗначениеЗаполнено(ЭтотОбъект.Исполнитель)		, ЭтотОбъект.Исполнитель		, ПараметрыСеанса.ТекущийСотрудник);
	ЭтотОбъект.СтруктурнаяЕдиница 				= ?(ЗначениеЗаполнено(ЭтотОбъект.СтруктурнаяЕдиница), ЭтотОбъект.СтруктурнаяЕдиница	, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	ЗадачаТема = ?(ЗначениеЗаполнено(ЗадачаТема), ЗадачаТема, НСтр("ru = 'Без темы.'; en = 'No subject.'")); 
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Наименование) Тогда 		
		ЭтотОбъект.Наименование = ?(ЗначениеЗаполнено(ЭтотОбъект.ЗадачаТема), ЭтотОбъект.ЗадачаТема + " (" + СокрЛП(Строка(ЭтотОбъект.ВидВзаимодействияСправочник)) + ")", СокрЛП(Строка(ЭтотОбъект.ВидВзаимодействияСправочник)));		
	КонецЕсли;	
	
	СинхронизироватьСтруктурнуюЕдиницуСРодительскимОбъектом();
	
КонецПроцедуры

// Процедура - Обработка проверки выполнения
//
// Параметры:
//  Результат	 - 	 - 
//
Процедура ОбработкаПроверкиВыполнения(Результат)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Истина;
	ДатаПроверкиИсполнения = ТекущаяДатаСеанса();
	Если ДополнительныеСвойства.Свойство("ЭтоОбновлениеИнформационнойБазы") Тогда
		Записать();
	Иначе 
		ДополнительныеСвойства.Вставить("ЭтоОбновлениеИнформационнойБазы", Истина);
		Записать();
		ДополнительныеСвойства.Удалить("ЭтоОбновлениеИнформационнойБазы");
	КонецЕсли;
	
КонецПроцедуры

// Процедура, обработчик события "ПередЗаписью"
//
Процедура ПередЗаписью(Отказ)
	
	Если ДополнительныеСвойства.Свойство("ЭтоОбновлениеИнформационнойБазы") Тогда 
		Возврат;
	КонецЕсли;
	
	Если Ссылка.Пустая() Тогда
		// Проставляем признак того что объект новый		
		ДополнительныеСвойства.Вставить("ОбъектНовый", Истина);
	ИначеЕсли НЕ ЭтотОбъект.Выполнена И ЭтотОбъект.Ссылка.Выполнена И НЕ ЭтотОбъект.ПометкаУдаления Тогда 
		// Проставляем признак того что выполнение отменено				
		ДополнительныеСвойства.Вставить("ОтменаВыполнения", Истина);
	ИначеЕсли НЕ ЭтотОбъект.Выполнена И ЭтотОбъект.Ссылка.ЗадачаНазначеннаяДата <> ЭтотОбъект.ЗадачаНазначеннаяДата Тогда  
		// Проставляем признак того что необходимо актуализировать дату оповещения в стеке				
		ДополнительныеСвойства.Вставить("АктуализироватьДатуОповещенияВСтеке", Истина);
	ИначеЕсли НЕ ЭтотОбъект.Выполнена И ЭтотОбъект.Ссылка.Исполнитель <> ЭтотОбъект.Исполнитель Тогда  
		// Проставляем признак того что необходимо актуализировать исполнителя в стеке				
		ДополнительныеСвойства.Вставить("АктуализироватьИсполнителяВСтеке", Истина);
	ИначеЕсли НЕ ЭтотОбъект.Выполнена И (ЭтотОбъект.Ссылка.НапоминаниеИспользовать <> ЭтотОбъект.НапоминаниеИспользовать ИЛИ ЭтотОбъект.Ссылка.ВариантНапоминания <> ЭтотОбъект.ВариантНапоминания ИЛИ ЭтотОбъект.Ссылка.НапоминаниеДатаНачала <> ЭтотОбъект.НапоминаниеДатаНачала) Тогда
		// Проставляем признак того что необходимо актуализировать дату оповещения в стеке				
		ДополнительныеСвойства.Вставить("АктуализироватьУникальноеОповещениеВСтеке", Истина);
	ИначеЕсли НЕ ЭтотОбъект.Ссылка.ПометкаУдаления И ЭтотОбъект.ПометкаУдаления Тогда
		ДополнительныеСвойства.Вставить("ПомеченаНаУдаление", Истина);
	КонецЕсли;
	
	ПроверитьВозможностьРаботыСПометкойУдаления(Отказ);
	
	Если ЭтотОбъект.Выполнена Тогда
		//ЭтоВерсияКОРП = ОбщегоНазначенияПовтИсп.ЭтоВерсияКОРП();
		// Заполним дату исполнения
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаИсполнения) Тогда
			ЭтотОбъект.ДатаИсполнения = ТекущаяДатаСеанса();
		КонецЕсли;	
		// Заполним исполнителя фактического
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ИсполнительФактический) И НЕ ДополнительныеСвойства.Свойство("НеИнициализироватьСделку") Тогда //И НЕ РегламентнаяЗадача Тогда 
			ЭтотОбъект.ИсполнительФактический = ПараметрыСеанса.ТекущийСотрудник;
		КонецЕсли;
	ИначеЕсли НЕ ЭтотОбъект.Выполнена И НЕ ЭтотОбъект.Ссылка.Пустая() Тогда
		Если НЕ ДополнительныеСвойства.Свойство("ЭтоАктуализацияДатЗадачи") Тогда
			// Определяем и записываем кол-во переносов
			Если НЕ ЭтотОбъект.Ссылка.ЗадачаНазначеннаяДата = ЭтотОбъект.ЗадачаНазначеннаяДата Тогда
				//Если НЕ ЭтотОбъект.Ссылка.Черновик Тогда 
				ЭтотОбъект.КоличествоПереносов = ЭтотОбъект.КоличествоПереносов + 1;
				//КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ЭтотОбъект.ДатаИсполнения = Неопределено;
		ЭтотОбъект.ИсполнительФактический = Неопределено;
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("НеИнициализироватьСделку") Тогда 	
		Справочники.Сделки.ИнициализироватьСделкуСогласноПредмета(СтруктурнаяЕдиница, Контрагент, ЗадачаПредмет, Сделка);
	КонецЕсли;
	
	Если Не ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеИзСтруктуры(ДополнительныеСвойства, "НеСинхронизироватьСтруктурнуюЕдиницу", Ложь) Тогда 	
		СинхронизироватьСтруктурнуюЕдиницуСРодительскимОбъектом();
	КонецЕсли;
	
	ВзаимодействиеПредставление = ЭтотОбъект.ЗадачаТема;
	ЭтотОбъект.Наименование     = ВзаимодействиеПредставление;
	// Стандартный реквизит задачи "Дата" не меняем никогда.
	// Также он является одним из ключей для синхронизации
	// сущностей "ЗадачаИсполнителя" и "Взаимодействие"
	Если ЗначениеЗаполнено(Ссылка) Тогда 
		Дата = Ссылка.Дата;
	КонецЕсли;
	
КонецПроцедуры

// Процедура, обработчик события "ПриЗаписи"
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина И НЕ ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ПомеченаНаУдаление", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ЭтоОбновлениеИнформационнойБазы") Тогда 
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПараметрыРегистрацииТриггера") Тогда
		ДополнительныеСвойства.ПараметрыРегистрацииТриггера.Вставить("ОбъектГенерации", ЭтотОбъект.Ссылка);
		РегистрыСведений.ЖурналРегистрацииТриггерныхСобытий.ЗарегистрироватьСобытиеТриггера(ДополнительныеСвойства.ПараметрыРегистрацииТриггера);
	КонецЕсли;
	
	//Если Не РегламентнаяЗадача И ЗначениеЗаполнено(Исполнитель) Тогда
	Если ЗначениеЗаполнено(Исполнитель) Тогда
		УстановитьПривилегированныйРежим(Истина);		
		
		ТаблицаИсполнителей = Новый ТаблицаЗначений;
		ТаблицаИсполнителей.Колонки.Добавить("Сотрудник"	, Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
		ТаблицаИсполнителей.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("УникальныйИдентификатор"));		
		
		Если ТипЗнч(Исполнитель) = Тип("СправочникСсылка.Сотрудники") Тогда 
			Если Исполнитель.ЭтоПользовательИБ = Истина Тогда			
				НоваяСтрока = ТаблицаИсполнителей.Добавить();
				НоваяСтрока.Сотрудник     = Исполнитель;
				НоваяСтрока.Идентификатор = Исполнитель.ИдентификаторПользователяИБ;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Исполнитель) = Тип("СправочникСсылка.СегментыСотрудников") Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	СотрудникиСегмента.Сотрудник КАК Сотрудник,
			|	СотрудникиСегмента.Сотрудник.ИдентификаторПользователяИБ КАК Идентификатор
			|ИЗ
			|	РегистрСведений.СотрудникиСегмента КАК СотрудникиСегмента
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
			|		ПО Пользователи.Сотрудник = СотрудникиСегмента.Сотрудник
			|ГДЕ
			|	СотрудникиСегмента.Сегмент = &Сегмент
			|	И Пользователи.ИдентификаторПользователяИБ <> &ПустойУИД");
			Запрос.УстановитьПараметр("Сегмент", Исполнитель);
			Запрос.УстановитьПараметр("ПустойУИД", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
			
			ТаблицаИсполнителей = Запрос.Выполнить().Выгрузить();					
		КонецЕсли;
		МассивСотрудников = Новый Массив;
		СоединенияИнформационнойБазы = ПолучитьСоединенияИнформационнойБазы();
		
		Для Каждого СтрокаМ из СоединенияИнформационнойБазы Цикл
			
			НайденнаяСтрока = ТаблицаИсполнителей.Найти(СтрокаМ.Пользователь.УникальныйИдентификатор, "Идентификатор");
			
			Если Не НайденнаяСтрока = Неопределено
				И МассивСотрудников.Найти(НайденнаяСтрока.Сотрудник) = Неопределено Тогда
				
				МассивСотрудников.Добавить(НайденнаяСтрока.Сотрудник);
			КонецЕсли;
			
		КонецЦикла;
		
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(ЭтотОбъект.Контрагент);
		Для Каждого СтрокаМС Из МассивСотрудников Цикл
			РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(СтрокаМС,,"ОбновлениеМонитораЗадач", ТекущаяДата(),,,, МассивПараметров);
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 
	
	Задачи.Взаимодействие.ОбновитьСведенияОЗадачахВРегистре(ЭтотОбъект.Контрагент);
	РегистрыСведений.СделкиСведенияДляСписка.АктуализироватьСведенияДляСписка(ЭтотОбъект.Сделка);
	// Актуализируем стек оповещений
	РегистрыСведений.СтекОповещенийПоВзаимодействиям.АктуализироватьСтекОповещений(ЭтотОбъект);
	
	ОбновитьЗадачиКанбан();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура, оповещает сеансы об изменении задачи.
//
Процедура ОбновитьЗадачиКанбан()
	
	// Задача не связана со сделкой, незачем что-либо обновлять.
	Если Не ЗначениеЗаполнено(Сделка) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Оповещаем сеансы об изменении задачи.
	НомерТекущегоСеанса	 = НомерСеансаИнформационнойБазы();
	ТекущиеСеансы		 = ПолучитьСеансыИнформационнойБазы();
	
	ВидСделки		 = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект.Сделка, "ВидСделки");
	УдалениеЗадачи	 = (ЭтотОбъект.Выполнена Или ЭтотОбъект.ПометкаУдаления);
	КлючОповещения	 = "ОбновитьЗадачуКанбан";
	
	// Если активен только один сеанс (текущий) - никого не оповещаем.
	Если ТекущиеСеансы.Количество() > 1 Тогда
		
		СистемаВзаимодействияПодключена = ОбсужденияСистемыВзаимодействия.СистемаВзаимодействияВключена() = Истина;
		
		Если Не СистемаВзаимодействияПодключена Тогда
			
			ПараметрыОповещения = Новый Массив;
			ПараметрыОповещения.Добавить(ЭтотОбъект.Ссылка);
			ПараметрыОповещения.Добавить(ЭтотОбъект.Сделка);
			ПараметрыОповещения.Добавить(ВидСделки);
			ПараметрыОповещения.Добавить(УдалениеЗадачи);
			
		КонецЕсли;
		
		ПользователиОповещения = Новый Массив;
		
		Для Каждого Сеанс Из ТекущиеСеансы Цикл
			
			Если (Сеанс.ИмяПриложения = "1CV8C"
				Или Сеанс.ИмяПриложения = "WebClient") Тогда
			
				Если НомерТекущегоСеанса = Сеанс.НомерСеанса Тогда
					// Текущий сеанс оповещаем с клиента.
					Продолжить;
				КонецЕсли;
				
				Если СистемаВзаимодействияПодключена Тогда
					ПользователиОповещения.Добавить(Сеанс.Пользователь);
				Иначе
					РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(
						Сеанс.НомерСеанса,,
						КлючОповещения,
						ТекущаяДатаСеанса(),,,,
						ПараметрыОповещения
					);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если СистемаВзаимодействияПодключена И ЗначениеЗаполнено(ПользователиОповещения) Тогда
			
			ДанныеСообщения = Новый Структура;
			ДанныеСообщения.Вставить("Ключ"					, КлючОповещения);
			ДанныеСообщения.Вставить("Задача"				, ЭтотОбъект.Ссылка);
			ДанныеСообщения.Вставить("Сделка"				, ЭтотОбъект.Сделка);
			ДанныеСообщения.Вставить("ВидСделки"			, ?(ВидСделки.Пустая(), Неопределено, ВидСделки));
			ДанныеСообщения.Вставить("УдалениеЗадачи"		, УдалениеЗадачи);
			
			ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения,, ПользователиОповещения);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура, проверяет возможность изменения пометки удаления задачи.
//
Процедура ПроверитьВозможностьРаботыСПометкойУдаления(Отказ)
	
	Если НЕ ПометкаУдаления = Ссылка.ПометкаУдаления Тогда 
		Если РольДоступна(Метаданные.Роли.ПолныеПрава) 
			ИЛИ РольДоступна(Метаданные.Роли.АдминистраторСистемы) 
			ИЛИ РольДоступна(Метаданные.Роли.Администрирование) 
			ИЛИ РольДоступна(Метаданные.Роли.ИзменениеВыполнениеЗадачДругихПользователей)
			ИЛИ НЕ ЗначениеЗаполнено(Ссылка) Тогда
			
			Отказ = Ложь;
		ИначеЕсли РольДоступна(Метаданные.Роли.ИзменениеСвоихКлиентовКуратором) Тогда 
			Если ПараметрыСеанса.ТекущийСотрудник = Исполнитель Тогда 
				Отказ = Ложь;
			Иначе 
				Отказ = Истина;
				ТекстСообщения = НСтр("ru='Не достаточно прав для установки/снятия пометки удаления у задачи'; en='Not enough is right for installing removing tagging removal from tasks'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект);
			КонецЕсли;	
		Иначе
			Отказ = Истина;
			ТекстСообщения = НСтр("ru='Не достаточно прав для установки/снятия пометки удаления у задачи'; en='Not enough is right for installing removing tagging removal from tasks'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

// Процедура, синхронизирует СЕ задачи с СЕ родительского объекта.
//
Процедура СинхронизироватьСтруктурнуюЕдиницуСРодительскимОбъектом()
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Сделка) Тогда
		
		ЭтотОбъект.СтруктурнаяЕдиница = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект.Сделка, "СтруктурнаяЕдиница");
		
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.ЗадачаПредмет) Тогда
		
		// Проверяем наличие реквизита "СтруктурнаяЕдиница" в родительском объекте.
		МетаданныеПредметаЗадачи = ЭтотОбъект.ЗадачаПредмет.Метаданные();
		
		Если (Метаданные.Справочники.Содержит(МетаданныеПредметаЗадачи)
			Или Метаданные.Документы.Содержит(МетаданныеПредметаЗадачи))
			И МетаданныеПредметаЗадачи.Реквизиты.Найти("СтруктурнаяЕдиница") <> Неопределено Тогда
			
			ЭтотОбъект.СтруктурнаяЕдиница = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект.ЗадачаПредмет, "СтруктурнаяЕдиница");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
