#Область СлужебныйПрограммныйИнтерфейс

#Область ФормированиеДанных

// Функция - Получить данные воронок.
//
// Параметры:
//  Параметры					 - 	 - 
//  ВременноеХранилищеРезультата - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеВоронок(Параметры, ВременноеХранилищеРезультата) Экспорт		
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктурнаяЕдиница 		= Параметры.СтруктурнаяЕдиница;
	ПериодРасчетаНачало 	= Параметры.ПериодРасчета.ДатаНачала;
	ПериодРасчетаОкончание 	= Параметры.ПериодРасчета.ДатаОкончания;
	ОтборПериодТип			= Параметры.ОтборПериодТип; 
	ПредопределеныйВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты");  
	
	Если Не ЗначениеЗаполнено(ПредопределеныйВидСделки) Тогда            
		Возврат Неопределено;
	КонецЕсли;
			
	СоответствиеЭтаповСделок = ПолучитьЭтапыСделок(ПредопределеныйВидСделки);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	ЭтапыСделок.Ссылка КАК Этап,
	 |	ВЫБОР
	 |		КОГДА ЭтапыСделок.Ссылка = &ЭтапПациентПодтвердил
	 |			ТОГДА 4
	 |		КОГДА ЭтапыСделок.Ссылка = &ЭтапПациентЗаписан
	 |			ТОГДА 3
	 |		КОГДА ЭтапыСделок.Ссылка = &ЭтапПредложениеОзвучено
	 |			ТОГДА 2
	 |		КОГДА ЭтапыСделок.Ссылка = &ЭтапПотенциальныйПрием
	 |			ТОГДА 1
	 |	КОНЕЦ КАК НомерЭтапаПриведенный,
	 |	ВЫБОР
	 |		КОГДА ЭтапыСделок.Ссылка = &ЭтапПредложениеОзвучено
	 |				ИЛИ ЭтапыСделок.Ссылка = &ЭтапПотенциальныйПрием
	 |			ТОГДА ИСТИНА
	 |		ИНАЧЕ ЛОЖЬ
	 |	КОНЕЦ КАК ЭтапПодходитДляОтказа,
	 |	ИСТИНА КАК ЭтапПодходитДляУспеха
	 |ПОМЕСТИТЬ ВТЭтапыСделок
	 |ИЗ
	 |	Справочник.ЭтапыСделок КАК ЭтапыСделок
	 |ГДЕ
	 |	ЭтапыСделок.ВидСделки = &ВидСделки
	 |	И ЭтапыСделок.ПометкаУдаления = ЛОЖЬ
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.Успех),
	 |	5,
	 |	ЛОЖЬ,
	 |	ИСТИНА
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.Отказ),
	 |	10,
	 |	ИСТИНА,
	 |	ЛОЖЬ
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	Сделки.Ссылка КАК Сделка,
	 |	ВЫБОР
	 |		КОГДА Сделки.ЭтапСделки = ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.Отказ)
	 |			ТОГДА Сделки.ЭтапОтказа
	 |		ИНАЧЕ Сделки.ЭтапСделки
	 |	КОНЕЦ КАК ТекущийЭтапСделки,
	 |	Сделки.Заявка КАК Заявка,
	 |	ВТЭтапыСделок.НомерЭтапаПриведенный КАК НомерЭтапаПриведенный,
	 |	Сделки.ЭтапСделки = ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.Отказ) КАК СделкаВОтказе,
	 |	ВЫБОР
	 |		КОГДА Сделки.Заявка = ЗНАЧЕНИЕ(Справочник.Заявки.ПустаяСсылка)
	 |			ТОГДА 1
	 |		ИНАЧЕ 0
	 |	КОНЕЦ КАК СделкаБезЗаявки
	 |ПОМЕСТИТЬ ВтАнализируемыеСделки
	 |ИЗ
	 |	Справочник.Сделки КАК Сделки
	 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЭтапыСделок КАК ВТЭтапыСделок
	 |		ПО (ВЫБОР
	 |				КОГДА Сделки.ЭтапСделки = ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.Отказ)
	 |					ТОГДА Сделки.ЭтапОтказа
	 |				ИНАЧЕ Сделки.ЭтапСделки
	 |			КОНЕЦ = ВТЭтапыСделок.Этап)
	 |ГДЕ
	 |	Сделки.ПометкаУдаления = ЛОЖЬ
	 |	И Сделки.ВидСделки = &ВидСделки
	 |	И Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	 |	И ВЫБОР
	 |			КОГДА Сделки.СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Первичный)
	 |					И Сделки.Заявка <> ЗНАЧЕНИЕ(Справочник.Заявки.ПустаяСсылка)
	 |				ТОГДА Сделки.Заявка.ДатаСоздания
	 |			ИНАЧЕ Сделки.ДатаСделки
	 |		КОНЕЦ МЕЖДУ &ДатаНачала И &ДатаОкончания
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	Заявки.Ссылка КАК Заявка
	 |ПОМЕСТИТЬ ВТЗаявки
	 |ИЗ
	 |	Справочник.Заявки КАК Заявки
	 |ГДЕ
	 |	Заявки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	 |	И Заявки.ПометкаУдаления = ЛОЖЬ
	 |	И Заявки.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
	 |
	 |ОБЪЕДИНИТЬ
	 |
	 |ВЫБРАТЬ
	 |	ВтАнализируемыеСделки.Заявка
	 |ИЗ
	 |	ВтАнализируемыеСделки КАК ВтАнализируемыеСделки
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТЗаявки.Заявка.Ссылка КАК ЗаявкаСсылка,
	 |	ВТЗаявки.Заявка.Статус КАК ЗаявкаСтатус,
	 |	ВТЗаявки.Заявка.ДатаСоздания КАК ЗаявкаДатаСоздания,
	 |	ВЫБОР
	 |		КОГДА ВТЗаявки.Заявка.ДатаОбработки <> ДАТАВРЕМЯ(1, 1, 1)
	 |			ТОГДА ЕСТЬNULL(РАЗНОСТЬДАТ(ВТЗаявки.Заявка.ДатаСоздания, ВТЗаявки.Заявка.ДатаОбработки, МИНУТА), 0)
	 |		ИНАЧЕ 0
	 |	КОНЕЦ КАК ВремяОбработки,
	 |	ВЫБОР
	 |		КОГДА ВТЗаявки.Заявка.ДатаОбработки <> ДАТАВРЕМЯ(1, 1, 1)
	 |			ТОГДА 1
	 |		ИНАЧЕ 0
	 |	КОНЕЦ КАК Обработано,
	 |	ВЫБОР
	 |		КОГДА ВТЗаявки.Заявка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.Принята)
	 |			ТОГДА 1
	 |		ИНАЧЕ 0
	 |	КОНЕЦ КАК ЗаявкаКачественная
	 |ПОМЕСТИТЬ ВтБазоваяТаблицаЗаявок
	 |ИЗ
	 |	ВТЗаявки КАК ВТЗаявки
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ЗаявкиИсторияИзмененияСтатусов.Ссылка КАК Ссылка,
	 |	МИНИМУМ(ЗаявкиИсторияИзмененияСтатусов.Дата) КАК Дата
	 |ПОМЕСТИТЬ ВтКачественныеЗаявки
	 |ИЗ
	 |	ВтБазоваяТаблицаЗаявок КАК ВтБазоваяТаблицаЗаявок
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Заявки.ИсторияИзмененияСтатусов КАК ЗаявкиИсторияИзмененияСтатусов
	 |		ПО ВтБазоваяТаблицаЗаявок.ЗаявкаСсылка = ЗаявкиИсторияИзмененияСтатусов.Ссылка
	 |ГДЕ
	 |	ЗаявкиИсторияИзмененияСтатусов.ПереходВСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.Принята)
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ЗаявкиИсторияИзмененияСтатусов.Ссылка
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ЕСТЬNULL(СУММА(ВтБазоваяТаблицаЗаявок.ЗаявкаКачественная), 0) + ВложенныйЗапрос.СуммаСделокБезЗаявок КАК КоличествоКачественныхЗаявок,
	 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВтБазоваяТаблицаЗаявок.ЗаявкаСсылка) + ВложенныйЗапрос.СуммаСделокБезЗаявок КАК ОбщееКоличествоЗаявок,
	 |	ЕСТЬNULL(СУММА(ВтБазоваяТаблицаЗаявок.ВремяОбработки), 0) КАК ВремяОбработки,
	 |	ЕСТЬNULL(СУММА(ВтБазоваяТаблицаЗаявок.Обработано), 0) КАК ОбработаноКоличество
	 |ПОМЕСТИТЬ КоличественныеПоказателиЗаявок
	 |ИЗ
	 |	ВтБазоваяТаблицаЗаявок КАК ВтБазоваяТаблицаЗаявок
	 |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	 |			СУММА(ВтАнализируемыеСделки.СделкаБезЗаявки) КАК СуммаСделокБезЗаявок
	 |		ИЗ
	 |			ВтАнализируемыеСделки КАК ВтАнализируемыеСделки) КАК ВложенныйЗапрос
	 |		ПО (ИСТИНА)
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВложенныйЗапрос.СуммаСделокБезЗаявок
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ЕСТЬNULL(ВЫБОР
	 |			КОГДА КоличественныеПоказателиЗаявок.ОбработаноКоличество = 0
	 |				ТОГДА 0
	 |			ИНАЧЕ ВЫРАЗИТЬ(КоличественныеПоказателиЗаявок.ВремяОбработки / КоличественныеПоказателиЗаявок.ОбработаноКоличество КАК ЧИСЛО(15, 0))
	 |		КОНЕЦ, 0) КАК СреднееВремяОбработкиЗаявок,
	 |	ВЫБОР
	 |		КОГДА КоличественныеПоказателиЗаявок.ОбщееКоличествоЗаявок = 0
	 |			ТОГДА 0
	 |		ИНАЧЕ ВЫРАЗИТЬ(КоличественныеПоказателиЗаявок.КоличествоКачественныхЗаявок / КоличественныеПоказателиЗаявок.ОбщееКоличествоЗаявок * 100 КАК ЧИСЛО(15, 0))
	 |	КОНЕЦ КАК ПроцентКачественныхЗаявок
	 |ПОМЕСТИТЬ ВтПроцентныеПоказателиЗаявок
	 |ИЗ
	 |	КоличественныеПоказателиЗаявок КАК КоличественныеПоказателиЗаявок
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВтАнализируемыеСделки.Сделка КАК Сделка,
	 |	ВТЭтапыСделок.Этап КАК ЭтапСделки,
	 |	ВТЭтапыСделок.НомерЭтапаПриведенный КАК НомерЭтапаПриведенный,
	 |	ВтАнализируемыеСделки.СделкаВОтказе КАК СделкаВОтказе
	 |ПОМЕСТИТЬ ВтНедостающиеЭтапыСделок
	 |ИЗ
	 |	ВТЭтапыСделок КАК ВТЭтапыСделок
	 |		ПОЛНОЕ СОЕДИНЕНИЕ ВтАнализируемыеСделки КАК ВтАнализируемыеСделки
	 |		ПО ВТЭтапыСделок.НомерЭтапаПриведенный <= ВтАнализируемыеСделки.НомерЭтапаПриведенный
	 |			И (ВЫБОР
	 |				КОГДА ВтАнализируемыеСделки.ТекущийЭтапСделки = ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.Успех)
	 |					ТОГДА ВТЭтапыСделок.ЭтапПодходитДляУспеха = ИСТИНА
	 |				ИНАЧЕ ИСТИНА
	 |			КОНЕЦ)
	 |ГДЕ
	 |	НЕ ВтАнализируемыеСделки.Сделка ЕСТЬ NULL
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	СделкиИсторияИзмененияЭтапов.Ссылка КАК Сделка,
	 |	СделкиИсторияИзмененияЭтапов.ПереходНаЭтап КАК ЭтапСделки,
	 |	МИНИМУМ(СделкиИсторияИзмененияЭтапов.Дата) КАК ДатаЭтапа
	 |ПОМЕСТИТЬ ВтСуществующиеЭтапыСделки
	 |ИЗ
	 |	Справочник.Сделки.ИсторияИзмененияЭтапов КАК СделкиИсторияИзмененияЭтапов
	 |ГДЕ
	 |	СделкиИсторияИзмененияЭтапов.Ссылка В
	 |			(ВЫБРАТЬ
	 |				ВтАнализируемыеСделки.Сделка КАК Сделка
	 |			ИЗ
	 |				ВтАнализируемыеСделки КАК ВтАнализируемыеСделки)
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	СделкиИсторияИзмененияЭтапов.Ссылка,
	 |	СделкиИсторияИзмененияЭтапов.ПереходНаЭтап
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВтНедостающиеЭтапыСделок.Сделка КАК Сделка,
	 |	ВтНедостающиеЭтапыСделок.ЭтапСделки КАК ЭтапСделки,
	 |	ВтНедостающиеЭтапыСделок.НомерЭтапаПриведенный КАК НомерЭтапаПриведенный,
	 |	МИНИМУМ(ЕСТЬNULL(ВтСуществующиеЭтапыСделки.ДатаЭтапа, ВтНедостающиеЭтапыСделок.Сделка.ДатаСделки)) КАК ДатаЭтапа,
	 |	ВтНедостающиеЭтапыСделок.Сделка.Заявка.ДатаСоздания КАК ДатаСозданияЗаявки,
	 |	ВтНедостающиеЭтапыСделок.Сделка.Прием.Дата КАК ДатаПриема,
	 |	ВтНедостающиеЭтапыСделок.Сделка.ДатаСделки КАК ДатаСозданияСделки,
	 |	ВЫБОР
	 |		КОГДА ВтНедостающиеЭтапыСделок.Сделка.Заявка.ДатаСоздания ЕСТЬ NULL
	 |			ТОГДА 0
	 |		ИНАЧЕ 1
	 |	КОНЕЦ КАК ЕстьОбращение,
	 |	ВтНедостающиеЭтапыСделок.СделкаВОтказе КАК СделкаВОтказе
	 |ПОМЕСТИТЬ БазоваяТаблицаСделок
	 |ИЗ
	 |	ВтНедостающиеЭтапыСделок КАК ВтНедостающиеЭтапыСделок
	 |		ЛЕВОЕ СОЕДИНЕНИЕ ВтСуществующиеЭтапыСделки КАК ВтСуществующиеЭтапыСделки
	 |		ПО ВтНедостающиеЭтапыСделок.Сделка = ВтСуществующиеЭтапыСделки.Сделка
	 |			И ВтНедостающиеЭтапыСделок.ЭтапСделки = ВтСуществующиеЭтапыСделки.ЭтапСделки
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВтНедостающиеЭтапыСделок.Сделка,
	 |	ВтНедостающиеЭтапыСделок.ЭтапСделки,
	 |	ВтНедостающиеЭтапыСделок.НомерЭтапаПриведенный,
	 |	ВтНедостающиеЭтапыСделок.Сделка.Прием.Дата,
	 |	ВтНедостающиеЭтапыСделок.Сделка.ДатаСделки,
	 |	ВтНедостающиеЭтапыСделок.Сделка.Заявка.ДатаСоздания,
	 |	ВтНедостающиеЭтапыСделок.СделкаВОтказе
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	БазоваяТаблицаСделок.Сделка КАК Сделка,
	 |	МИНИМУМ(БазоваяТаблицаСделок.ДатаСозданияЗаявки) КАК ДатаСозданияЗаявки,
	 |	МИНИМУМ(БазоваяТаблицаСделок.ДатаЭтапа) КАК ДатаЭтапа,
	 |	МИНИМУМ(БазоваяТаблицаСделок.ДатаПриема) КАК ДатаПриема,
	 |	МАКСИМУМ(БазоваяТаблицаСделок.ЕстьОбращение) КАК ЕстьОбращение,
	 |	МИНИМУМ(ВЫБОР
	 |			КОГДА БазоваяТаблицаСделок.ЭтапСделки = &ЭтапПациентЗаписан
	 |				ТОГДА БазоваяТаблицаСделок.ДатаЭтапа
	 |		КОНЕЦ) КАК ДатаЭтапаПациентЗаписан,
	 |	СУММА(ВЫБОР
	 |			КОГДА БазоваяТаблицаСделок.ЭтапСделки = &ЭтапПациентЗаписан
	 |				ТОГДА 1
	 |			ИНАЧЕ 0
	 |		КОНЕЦ) КАК ЕстьЭтапКлиентЗаписан,
	 |	МАКСИМУМ(ВЫБОР
	 |			КОГДА БазоваяТаблицаСделок.ЭтапСделки = &ЭтапПациентПодтвердил
	 |				ТОГДА 1
	 |			ИНАЧЕ 0
	 |		КОНЕЦ) КАК ЕстьЭтапКлиентПодтвердил,
	 |	МАКСИМУМ(ВЫБОР
	 |			КОГДА БазоваяТаблицаСделок.ЭтапСделки = ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.Успех)
	 |				ТОГДА 1
	 |			ИНАЧЕ 0
	 |		КОНЕЦ) КАК ЕстьЭтапКлиентПришел,
	 |	МАКСИМУМ(ВЫБОР
	 |			КОГДА БазоваяТаблицаСделок.СделкаВОтказе = ИСТИНА
	 |				ТОГДА 1
	 |			ИНАЧЕ 0
	 |		КОНЕЦ) КАК ЕстьЭтапОтказ,
	 |	МАКСИМУМ(ВЫБОР
	 |			КОГДА НЕ БазоваяТаблицаСделок.ДатаПриема ЕСТЬ NULL
	 |				ТОГДА 1
	 |			ИНАЧЕ 0
	 |		КОНЕЦ) КАК ЕстьПрием
	 |ПОМЕСТИТЬ БазоваяТаблицаПервичныеПациенты
	 |ИЗ
	 |	БазоваяТаблицаСделок КАК БазоваяТаблицаСделок
	 |ГДЕ
	 |	БазоваяТаблицаСделок.Сделка.СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Первичный)
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	БазоваяТаблицаСделок.Сделка
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	БазоваяТаблицаСделок.Сделка КАК Сделка,
	 |	МИНИМУМ(БазоваяТаблицаСделок.ДатаПриема) КАК ДатаПриема,
	 |	МИНИМУМ(БазоваяТаблицаСделок.ДатаСозданияСделки) КАК ДатаСозданияСделки,
	 |	МИНИМУМ(ВЫБОР
	 |			КОГДА БазоваяТаблицаСделок.ЭтапСделки = &ЭтапПотенциальныйПрием
	 |				ТОГДА БазоваяТаблицаСделок.ДатаЭтапа
	 |		КОНЕЦ) КАК ДатаЭтапаПотенциальныйПрием,
	 |	МИНИМУМ(ВЫБОР
	 |			КОГДА БазоваяТаблицаСделок.ЭтапСделки = &ЭтапПациентЗаписан
	 |				ТОГДА БазоваяТаблицаСделок.ДатаЭтапа
	 |		КОНЕЦ) КАК ДатаЭтапаПациентЗаписан,
	 |	МАКСИМУМ(ВЫБОР
	 |			КОГДА НЕ БазоваяТаблицаСделок.ДатаПриема ЕСТЬ NULL
	 |				ТОГДА 1
	 |			ИНАЧЕ 0
	 |		КОНЕЦ) КАК ЕстьПрием,
	 |	МАКСИМУМ(ВЫБОР
	 |			КОГДА БазоваяТаблицаСделок.ЭтапСделки = &ЭтапПотенциальныйПрием
	 |				ТОГДА 1
	 |			ИНАЧЕ 0
	 |		КОНЕЦ) КАК ЕстьЭтапПотенциальныйПрием,
	 |	МАКСИМУМ(ВЫБОР
	 |			КОГДА БазоваяТаблицаСделок.ЭтапСделки = &ЭтапПредложениеОзвучено
	 |				ТОГДА 1
	 |			ИНАЧЕ 0
	 |		КОНЕЦ) КАК ЕстьЭтапПредложениеОзвучено,
	 |	МАКСИМУМ(ВЫБОР
	 |			КОГДА БазоваяТаблицаСделок.ЭтапСделки = &ЭтапПациентЗаписан
	 |				ТОГДА 1
	 |			ИНАЧЕ 0
	 |		КОНЕЦ) КАК ЕстьЭтапПациентЗаписан,
	 |	МАКСИМУМ(ВЫБОР
	 |			КОГДА БазоваяТаблицаСделок.ЭтапСделки = &ЭтапПациентПодтвердил
	 |				ТОГДА 1
	 |			ИНАЧЕ 0
	 |		КОНЕЦ) КАК ЕстьЭтапПациентПодтвердил,
	 |	МАКСИМУМ(ВЫБОР
	 |			КОГДА БазоваяТаблицаСделок.ЭтапСделки = ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.Успех)
	 |				ТОГДА 1
	 |			ИНАЧЕ 0
	 |		КОНЕЦ) КАК ЕстьЭтапПациентПришел,
	 |	МАКСИМУМ(ВЫБОР
	 |			КОГДА БазоваяТаблицаСделок.СделкаВОтказе = ИСТИНА
	 |				ТОГДА 1
	 |			ИНАЧЕ 0
	 |		КОНЕЦ) КАК ЕстьЭтапПациентОтказ
	 |ПОМЕСТИТЬ БазоваяТаблицаПовторныеПациенты
	 |ИЗ
	 |	БазоваяТаблицаСделок КАК БазоваяТаблицаСделок
	 |ГДЕ
	 |	БазоваяТаблицаСделок.Сделка.СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Постоянный)
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	БазоваяТаблицаСделок.Сделка
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ЕСТЬNULL(КоличественныеПоказателиЗаявок.ОбщееКоличествоЗаявок, 0) КАК ОбщееКоличествоПервичных,
	 |	ЕСТЬNULL(СУММА(БазоваяТаблицаПервичныеПациенты.ЕстьОбращение), 0) КАК КоличествоЗаявок,
	 |	ЕСТЬNULL(СУММА(БазоваяТаблицаПервичныеПациенты.ЕстьЭтапКлиентЗаписан), 0) КАК КоличествоПервичныеЗаписано,
	 |	ЕСТЬNULL(СУММА(БазоваяТаблицаПервичныеПациенты.ЕстьЭтапКлиентПодтвердил), 0) КАК КоличествоПервичныеПодтвердило,
	 |	ЕСТЬNULL(СУММА(БазоваяТаблицаПервичныеПациенты.ЕстьЭтапКлиентПришел), 0) КАК КоличествоПервичныеПришло,
	 |	ЕСТЬNULL(СУММА(БазоваяТаблицаПервичныеПациенты.ЕстьЭтапОтказ), 0) КАК КоличествоПервичныеОтказ,
	 |	ЕСТЬNULL(СУММА(ВЫБОР
	 |				КОГДА БазоваяТаблицаПервичныеПациенты.ЕстьОбращение = 1
	 |						И БазоваяТаблицаПервичныеПациенты.ЕстьЭтапКлиентЗаписан = 1
	 |					ТОГДА РАЗНОСТЬДАТ(БазоваяТаблицаПервичныеПациенты.ДатаСозданияЗаявки, БазоваяТаблицаПервичныеПациенты.ДатаЭтапаПациентЗаписан, МИНУТА)
	 |			КОНЕЦ), 0) КАК ПервичныеКоличествоМинутОтСозданияЗаявкиДоЗаписи,
	 |	ЕСТЬNULL(СУММА(ВЫБОР
	 |				КОГДА БазоваяТаблицаПервичныеПациенты.ЕстьПрием = 1
	 |						И БазоваяТаблицаПервичныеПациенты.ЕстьЭтапКлиентЗаписан = 1
	 |					ТОГДА РАЗНОСТЬДАТ(БазоваяТаблицаПервичныеПациенты.ДатаЭтапаПациентЗаписан, БазоваяТаблицаПервичныеПациенты.ДатаПриема, МИНУТА)
	 |			КОНЕЦ), 0) КАК ПервичныеКоличествоМинутОтЗаписиДоПриема,
	 |	ЕСТЬNULL(СУММА(БазоваяТаблицаПервичныеПациенты.ЕстьПрием), 0) КАК ПервичныеКоличествоПриемов
	 |ПОМЕСТИТЬ КоличественныеПоказателиПервичных
	 |ИЗ
	 |	БазоваяТаблицаПервичныеПациенты КАК БазоваяТаблицаПервичныеПациенты
	 |		ЛЕВОЕ СОЕДИНЕНИЕ КоличественныеПоказателиЗаявок КАК КоличественныеПоказателиЗаявок
	 |		ПО (ИСТИНА)
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	КоличественныеПоказателиЗаявок.ОбщееКоличествоЗаявок
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БазоваяТаблицаПовторныеПациенты.Сделка) КАК ОбщееКоличествоПвторных,
	 |	ЕСТЬNULL(СУММА(БазоваяТаблицаПовторныеПациенты.ЕстьПрием), 0) КАК ПовторныеКоличествоПриемов,
	 |	ЕСТЬNULL(СУММА(БазоваяТаблицаПовторныеПациенты.ЕстьЭтапПотенциальныйПрием), 0) КАК КоличествоПовторныеПотенциальныйПрием,
	 |	ЕСТЬNULL(СУММА(БазоваяТаблицаПовторныеПациенты.ЕстьЭтапПредложениеОзвучено), 0) КАК КоличествоПовторныеПредложениеОзвучено,
	 |	ЕСТЬNULL(СУММА(БазоваяТаблицаПовторныеПациенты.ЕстьЭтапПациентЗаписан), 0) КАК КоличествоПовторныеЗаписано,
	 |	ЕСТЬNULL(СУММА(БазоваяТаблицаПовторныеПациенты.ЕстьЭтапПациентПодтвердил), 0) КАК КоличествоПовторныеПодтвердило,
	 |	ЕСТЬNULL(СУММА(БазоваяТаблицаПовторныеПациенты.ЕстьЭтапПациентПришел), 0) КАК КоличествоПовторныеПришло,
	 |	ЕСТЬNULL(СУММА(БазоваяТаблицаПовторныеПациенты.ЕстьЭтапПациентОтказ), 0) КАК КоличествоПовторныеОтказ,
	 |	ЕСТЬNULL(СУММА(ВЫБОР
	 |				КОГДА БазоваяТаблицаПовторныеПациенты.ЕстьЭтапПотенциальныйПрием = 1
	 |						И БазоваяТаблицаПовторныеПациенты.ЕстьЭтапПациентЗаписан = 1
	 |					ТОГДА РАЗНОСТЬДАТ(БазоваяТаблицаПовторныеПациенты.ДатаЭтапаПотенциальныйПрием, БазоваяТаблицаПовторныеПациенты.ДатаЭтапаПациентЗаписан, МИНУТА)
	 |			КОНЕЦ), 0) КАК ПовторныеКоличествоМинутОтЭтапаПотенциальныйПриемДоЗаписи,
	 |	ЕСТЬNULL(СУММА(ВЫБОР
	 |				КОГДА БазоваяТаблицаПовторныеПациенты.ЕстьЭтапПациентЗаписан = 1
	 |						И БазоваяТаблицаПовторныеПациенты.ЕстьПрием = 1
	 |					ТОГДА РАЗНОСТЬДАТ(БазоваяТаблицаПовторныеПациенты.ДатаЭтапаПациентЗаписан, БазоваяТаблицаПовторныеПациенты.ДатаПриема, МИНУТА)
	 |			КОНЕЦ), 0) КАК ПовторныеКоличествоМинутОтЗаписиДоПриема,
	 |	КОЛИЧЕСТВО(БазоваяТаблицаПовторныеПациенты.Сделка) КАК Сделка
	 |ПОМЕСТИТЬ КоличественныеПоказателиПовторных
	 |ИЗ
	 |	БазоваяТаблицаПовторныеПациенты КАК БазоваяТаблицаПовторныеПациенты
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВЫБОР
	 |		КОГДА КоличественныеПоказателиПервичных.ОбщееКоличествоПервичных = 0
	 |			ТОГДА 0
	 |		ИНАЧЕ ВЫРАЗИТЬ(КоличественныеПоказателиПервичных.КоличествоПервичныеЗаписано / КоличественныеПоказателиПервичных.ОбщееКоличествоПервичных * 100 КАК ЧИСЛО(15, 0))
	 |	КОНЕЦ КАК ПроцентПервичныхПациентовЗаписано,
	 |	ВЫБОР
	 |		КОГДА КоличественныеПоказателиПервичных.ОбщееКоличествоПервичных = 0
	 |			ТОГДА 0
	 |		ИНАЧЕ ВЫРАЗИТЬ(КоличественныеПоказателиПервичных.КоличествоПервичныеПодтвердило / КоличественныеПоказателиПервичных.ОбщееКоличествоПервичных * 100 КАК ЧИСЛО(15, 0))
	 |	КОНЕЦ КАК ПроцентПервичныхПациентовПодтвердило,
	 |	ВЫБОР
	 |		КОГДА КоличественныеПоказателиПервичных.ОбщееКоличествоПервичных = 0
	 |			ТОГДА 0
	 |		ИНАЧЕ ВЫРАЗИТЬ(КоличественныеПоказателиПервичных.КоличествоПервичныеПришло / КоличественныеПоказателиПервичных.ОбщееКоличествоПервичных * 100 КАК ЧИСЛО(15, 0))
	 |	КОНЕЦ КАК ПроцентПервичныхПациентовПришло,
	 |	ВЫБОР
	 |		КОГДА КоличественныеПоказателиПервичных.ОбщееКоличествоПервичных = 0
	 |			ТОГДА 0
	 |		ИНАЧЕ ВЫРАЗИТЬ(КоличественныеПоказателиПервичных.КоличествоПервичныеОтказ / КоличественныеПоказателиПервичных.ОбщееКоличествоПервичных * 100 КАК ЧИСЛО(15, 0))
	 |	КОНЕЦ КАК ПроцентПервичныхПациентовОтказ
	 |ПОМЕСТИТЬ ПроцентныеПоказателиПервичныхПациентов
	 |ИЗ
	 |	КоличественныеПоказателиПервичных КАК КоличественныеПоказателиПервичных
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВЫБОР
	 |		КОГДА КоличественныеПоказателиПовторных.ОбщееКоличествоПвторных = 0
	 |			ТОГДА 0
	 |		ИНАЧЕ ВЫРАЗИТЬ(КоличественныеПоказателиПовторных.КоличествоПовторныеПредложениеОзвучено / КоличественныеПоказателиПовторных.ОбщееКоличествоПвторных * 100 КАК ЧИСЛО(15, 0))
	 |	КОНЕЦ КАК ПроцентПостоянныхПредложениеОзвучено,
	 |	ВЫБОР
	 |		КОГДА КоличественныеПоказателиПовторных.ОбщееКоличествоПвторных = 0
	 |			ТОГДА 0
	 |		ИНАЧЕ ВЫРАЗИТЬ(КоличественныеПоказателиПовторных.КоличествоПовторныеЗаписано / КоличественныеПоказателиПовторных.ОбщееКоличествоПвторных * 100 КАК ЧИСЛО(15, 0))
	 |	КОНЕЦ КАК ПроцентПостоянныхЗаписано,
	 |	ВЫБОР
	 |		КОГДА КоличественныеПоказателиПовторных.ОбщееКоличествоПвторных = 0
	 |			ТОГДА 0
	 |		ИНАЧЕ ВЫРАЗИТЬ(КоличественныеПоказателиПовторных.КоличествоПовторныеПодтвердило / КоличественныеПоказателиПовторных.ОбщееКоличествоПвторных * 100 КАК ЧИСЛО(15, 0))
	 |	КОНЕЦ КАК ПроцентПостоянныхПодтвердило,
	 |	ВЫБОР
	 |		КОГДА КоличественныеПоказателиПовторных.ОбщееКоличествоПвторных = 0
	 |			ТОГДА 0
	 |		ИНАЧЕ ВЫРАЗИТЬ(КоличественныеПоказателиПовторных.КоличествоПовторныеПришло / КоличественныеПоказателиПовторных.ОбщееКоличествоПвторных * 100 КАК ЧИСЛО(15, 0))
	 |	КОНЕЦ КАК ПроцентПостоянныхПришло,
	 |	ВЫБОР
	 |		КОГДА КоличественныеПоказателиПовторных.ОбщееКоличествоПвторных = 0
	 |			ТОГДА 0
	 |		ИНАЧЕ ВЫРАЗИТЬ(КоличественныеПоказателиПовторных.КоличествоПовторныеОтказ / КоличественныеПоказателиПовторных.ОбщееКоличествоПвторных * 100 КАК ЧИСЛО(15, 0))
	 |	КОНЕЦ КАК ПроцентПостоянныхОтказ
	 |ПОМЕСТИТЬ ПроцентныеПоказателиПостоянныхПациентов
	 |ИЗ
	 |	КоличественныеПоказателиПовторных КАК КоличественныеПоказателиПовторных
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВЫБОР
	 |		КОГДА КоличественныеПоказателиПервичных.КоличествоЗаявок = 0
	 |			ТОГДА 0
	 |		ИНАЧЕ ВЫРАЗИТЬ(КоличественныеПоказателиПервичных.ПервичныеКоличествоМинутОтСозданияЗаявкиДоЗаписи / КоличественныеПоказателиПервичных.КоличествоЗаявок КАК ЧИСЛО(15, 0))
	 |	КОНЕЦ КАК ПервичныеСреднееВремяОтСозданияЗаявкиДоЗаписи,
	 |	ВЫБОР
	 |		КОГДА КоличественныеПоказателиПервичных.ПервичныеКоличествоПриемов = 0
	 |			ТОГДА 0
	 |		ИНАЧЕ ВЫРАЗИТЬ(КоличественныеПоказателиПервичных.ПервичныеКоличествоМинутОтЗаписиДоПриема / КоличественныеПоказателиПервичных.ПервичныеКоличествоПриемов КАК ЧИСЛО(15, 0))
	 |	КОНЕЦ КАК ПервичныеСреднееВремяОтЗаписиДоПриема,
	 |	ВЫБОР
	 |		КОГДА КоличественныеПоказателиПервичных.КоличествоЗаявок = 0
	 |			ТОГДА 0
	 |		ИНАЧЕ ВЫРАЗИТЬ(КоличественныеПоказателиПервичных.ПервичныеКоличествоМинутОтСозданияЗаявкиДоЗаписи / КоличественныеПоказателиПервичных.КоличествоЗаявок КАК ЧИСЛО(15, 0))
	 |	КОНЕЦ + ВЫБОР
	 |		КОГДА КоличественныеПоказателиПервичных.ПервичныеКоличествоПриемов = 0
	 |			ТОГДА 0
	 |		ИНАЧЕ ВЫРАЗИТЬ(КоличественныеПоказателиПервичных.ПервичныеКоличествоМинутОтЗаписиДоПриема / КоличественныеПоказателиПервичных.ПервичныеКоличествоПриемов КАК ЧИСЛО(15, 0))
	 |	КОНЕЦ КАК ПервичныеСреднееВремяОтСозданияЗаявкиДоПриема
	 |ПОМЕСТИТЬ ВтВременныеПоказателиПервичныхСделок
	 |ИЗ
	 |	КоличественныеПоказателиПервичных КАК КоличественныеПоказателиПервичных
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВЫБОР
	 |		КОГДА КоличественныеПоказателиПовторных.КоличествоПовторныеЗаписано = 0
	 |			ТОГДА 0
	 |		ИНАЧЕ ВЫРАЗИТЬ(КоличественныеПоказателиПовторных.ПовторныеКоличествоМинутОтЭтапаПотенциальныйПриемДоЗаписи / КоличественныеПоказателиПовторных.КоличествоПовторныеЗаписано КАК ЧИСЛО(15, 0))
	 |	КОНЕЦ КАК ПовторныеСреднееВремяОтПотенциальногоПриемаДоЗаписи,
	 |	ВЫБОР
	 |		КОГДА КоличественныеПоказателиПовторных.ПовторныеКоличествоПриемов = 0
	 |			ТОГДА 0
	 |		ИНАЧЕ ВЫРАЗИТЬ(КоличественныеПоказателиПовторных.ПовторныеКоличествоМинутОтЗаписиДоПриема / КоличественныеПоказателиПовторных.ПовторныеКоличествоПриемов КАК ЧИСЛО(15, 0))
	 |	КОНЕЦ КАК ПовторныеСреднееВремяОтЗаписиДоПриема,
	 |	ВЫБОР
	 |		КОГДА КоличественныеПоказателиПовторных.КоличествоПовторныеЗаписано = 0
	 |			ТОГДА 0
	 |		ИНАЧЕ ВЫРАЗИТЬ(КоличественныеПоказателиПовторных.ПовторныеКоличествоМинутОтЭтапаПотенциальныйПриемДоЗаписи / КоличественныеПоказателиПовторных.КоличествоПовторныеЗаписано КАК ЧИСЛО(15, 0))
	 |	КОНЕЦ + ВЫБОР
	 |		КОГДА КоличественныеПоказателиПовторных.ПовторныеКоличествоПриемов = 0
	 |			ТОГДА 0
	 |		ИНАЧЕ ВЫРАЗИТЬ(КоличественныеПоказателиПовторных.ПовторныеКоличествоМинутОтЗаписиДоПриема / КоличественныеПоказателиПовторных.ПовторныеКоличествоПриемов КАК ЧИСЛО(15, 0))
	 |	КОНЕЦ КАК ПовторныеСреднееВремяОтПотенциальногоПриемаДоПриема
	 |ПОМЕСТИТЬ ВтВременныеПоказателиПостоянныхСделок
	 |ИЗ
	 |	КоличественныеПоказателиПовторных КАК КоличественныеПоказателиПовторных";		
	
	Запрос.УстановитьПараметр("ВидСделки"				, ПредопределеныйВидСделки);
	Запрос.УстановитьПараметр("ЭтапПотенциальныйПрием"	, СоответствиеЭтаповСделок.Получить(1));
	Запрос.УстановитьПараметр("ЭтапПредложениеОзвучено"	, СоответствиеЭтаповСделок.Получить(2));
	Запрос.УстановитьПараметр("ЭтапПациентЗаписан"		, СоответствиеЭтаповСделок.Получить(3));
    Запрос.УстановитьПараметр("ЭтапПациентПодтвердил"	, СоответствиеЭтаповСделок.Получить(4)); 	
	Запрос.УстановитьПараметр("ДатаНачала"				, ПериодРасчетаНачало);
	Запрос.УстановитьПараметр("ДатаОкончания"			, ПериодРасчетаОкончание);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"		, СтруктурнаяЕдиница);
		
	Результат = ПолучитьРезультатыПакетногоЗапроса(Новый_Массив(5, 6, 12, 13, 14, 15, 16, 17), Запрос.ВыполнитьПакетСПромежуточнымиДанными());  
			
	ПоместитьВоВременноеХранилище(Результат, ВременноеХранилищеРезультата);
		
КонецФункции  

// Функция возвращает этапы сделок по виду сделки.
//
Функция ПолучитьЭтапыСделок(ПредопределенныйВидСделки)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭтапыСделок.Ссылка КАК Ссылка,
	|	ЭтапыСделок.НомерЭтапа КАК НомерЭтапа
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.ВидСделки = &ВидСделки
	|	И ЭтапыСделок.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЭтапа"; 
	
	Запрос.УстановитьПараметр("ВидСделки", ПредопределенныйВидСделки); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СоответствиеРезультат = Новый Соответствие; 
	
	Пока Выборка.Следующий() Цикл
		
		СоответствиеРезультат.Вставить(Выборка.НомерЭтапа, Выборка.Ссылка); 
		
	КонецЦикла;	
		
	Возврат СоответствиеРезультат;
	
КонецФункции

// Функция - Получить результаты пакетного запроса.
//
// Параметры:
//  ИндексыРезультатов	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьРезультатыПакетногоЗапроса(МассивИндексовРезультатов, МассивРезультатовЗапроса)
	
	Результат = Новый Соответствие();
	
	Для Каждого Индекс Из МассивИндексовРезультатов Цикл
		
		Выборка = МассивРезультатовЗапроса[Индекс].Выбрать(); 	
		
		Пока Выборка.Следующий() Цикл 
			Для Каждого Колонка Из МассивРезультатовЗапроса[Индекс].Колонки Цикл		
				Результат.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти
