
#Область ОбработчикиСобытийФормы

// Поцедура - обработчик события формы "ПриСозданииНаСервере"
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЭлементыТолькоПросмотр") Тогда
		
		СтруктураДоступностиЭлементов = Параметры.ЭлементыТолькоПросмотр;
		
		Для Каждого ЗаписьДоступностиЭлементов Из СтруктураДоступностиЭлементов Цикл
			
			НайденныйЭлемент = Элементы.Найти(ЗаписьДоступностиЭлементов.Ключ);
			
			Если НайденныйЭлемент <> Неопределено Тогда
				НайденныйЭлемент.ТолькоПросмотр = ?(ЗаписьДоступностиЭлементов.Значение = Неопределено, Истина, (НЕ ЗаписьДоступностиЭлементов.Значение));
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Поцедура - обработчик события "ПриИзменении" элемента формы "Основная"
//
&НаКлиенте
Процедура ОсновнаяПриИзменении(Элемент)
	
	Если Запись.Основная = Истина И ЗначениеЗаполнено(Запись.Пользователь) Тогда
		ОсновнаяПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОсновнаяПриИзмененииНаСервере()
	
	СтруктураДанныхРегистра = Новый Структура("УчетнаяЗапись, Пользователь", Запись.УчетнаяЗапись, Запись.Пользователь);
	КлючЗаписиРегистра = РегистрыСведений.УчетныеЗаписиЭлектроннойПочты.СоздатьКлючЗаписи(СтруктураДанныхРегистра);
	
	// Снимаем отметку "Основная" у всех других записей данного пользователя
	РегистрыСведений.УчетныеЗаписиЭлектроннойПочты.ПриУстановкеФлагаОсновная(Запись.Пользователь, КлючЗаписиРегистра);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмененыУчетныеЗаписиПользователей");
	
КонецПроцедуры

#КонецОбласти