
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Контрагенты") Тогда
		ПараметрыФормы = Новый Структура("Контрагент", ПараметрКоманды);
	Иначе
		ПараметрыФормы = Новый Структура("Контрагент", ПараметрКоманды.Контрагент);
	КонецЕсли;
	
	ОткрытьФорму("Отчет.ВзаиморасчетыПодробно.Форма.ФормаОтчета", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти