 
 
#Область СлужебныеПроцедурыИФункции
 
 // Функция вернет остатко на ЛС клиента
 //
 Функция ПолучитьОстаткиНаЛицевыхСчетахКонтрагента(Контрагент
	                                              ,Период = Неопределено
	                                              ,НеУчитыватьРегистратор = Неопределено
												  ,СтруктурнаяЕдиница = Неопределено
												  ,ВидСчета = Неопределено
												  ,ВозвратТолькоСуммы = Ложь
												  ,ВключатьВсеСчетаРодственников = Ложь) Экспорт
	
	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЛицевыхСчетов.Ссылка КАК ВидСчета,
	|	ЕСТЬNULL(ДенежныеСредстваНаЛицевыхСчетахОбороты.Контрагент, &Клиент) КАК Контрагент,
	|	СУММА(ЕСТЬNULL(ДенежныеСредстваНаЛицевыхСчетахОбороты.СуммаОборот, 0)) КАК СуммаОстаток
	|ИЗ
	|	Справочник.ВидыЛицевыхСчетов КАК ВидыЛицевыхСчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДенежныеСредстваНаЛицевыхСчетахОбороты.ВидСчета КАК ВидСчета,
	|			ДенежныеСредстваНаЛицевыхСчетахОбороты.Контрагент КАК Контрагент,
	|			ДенежныеСредстваНаЛицевыхСчетахОбороты.СуммаОборот КАК СуммаОборот
	|		ИЗ
	|			РегистрНакопления.ДенежныеСредстваНаЛицевыхСчетах.Обороты(
	|					,
	|					&Период,
	|					Регистратор,
	|					(Контрагент = &Клиент
	|						ИЛИ &ВключатьВсеСчетаРодственников = ИСТИНА
	|							И Контрагент В
	|								(ВЫБРАТЬ
	|									РегистрСведений.РодственныеСвязи.Родственник
	|								ИЗ
	|									РегистрСведений.РодственныеСвязи
	|								ГДЕ
	|									РегистрСведений.РодственныеСвязи.Контрагент = &Клиент
	|									И РегистрСведений.РодственныеСвязи.ОбщийЛицевойСчет = ИСТИНА))
	|						И ВЫБОР
	|							КОГДА &СтруктурнаяЕдиница <> НЕОПРЕДЕЛЕНО
	|									И &СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|								ТОГДА СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ
	|						И ВЫБОР
	|							КОГДА &ВидСчета <> НЕОПРЕДЕЛЕНО
	|								ТОГДА ВидСчета = &ВидСчета
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ) КАК ДенежныеСредстваНаЛицевыхСчетахОбороты
	|		ГДЕ
	|			НЕ ДенежныеСредстваНаЛицевыхСчетахОбороты.Регистратор В (&Регистратор)) КАК ДенежныеСредстваНаЛицевыхСчетахОбороты
	|		ПО (ДенежныеСредстваНаЛицевыхСчетахОбороты.ВидСчета = ВидыЛицевыхСчетов.Ссылка)
	|ГДЕ
	|	ВидыЛицевыхСчетов.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &ВидСчета <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ВидыЛицевыхСчетов.Ссылка = &ВидСчета
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВидыЛицевыхСчетов.Ссылка,
	|	ДенежныеСредстваНаЛицевыхСчетахОбороты.Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидСчета,
	|	Контрагент";						  
	
	МассивИсключаемыхДок = Новый Массив;
	Если ЗначениеЗаполнено(НеУчитыватьРегистратор) Тогда
		Если ТипЗнч(НеУчитыватьРегистратор) = Тип("Массив") Тогда
			МассивИсключаемыхДок = НеУчитыватьРегистратор;
		ИначеЕсли ТипЗнч(НеУчитыватьРегистратор) = Тип("СписокЗначений") Тогда
			МассивИсключаемыхДок = НеУчитыватьРегистратор.ВыгрузитьЗначения();
		Иначе
			 МассивИсключаемыхДок.Добавить(НеУчитыватьРегистратор);
		КонецЕсли;   	
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Период"              		 , ?(Период = Неопределено,Дата(0001,01,01,0,0,0),Период));
	Запрос.УстановитьПараметр("Регистратор"         		 , МассивИсключаемыхДок);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"  		 , СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Клиент"              		 , Контрагент);
	Запрос.УстановитьПараметр("ВключатьВсеСчетаРодственников", ВключатьВсеСчетаРодственников);
	Запрос.УстановитьПараметр("ВидСчета"            		 , ВидСчета);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() >0 Тогда
		Возврат ?(ВозвратТолькоСуммы,Выборка.Итог("СуммаОстаток"),Выборка);
	Иначе 
		Возврат 0;
	КонецЕсли;	
	
КонецФункции

// Функция вернет остатки на лицевых счетах контрагента в разрезе структурных единиц
Функция ПолучитьОстаткиНаЛицевымСчетахКонтрагентаПоСЕ(Контрагент
	                                                 ,Период = Неопределено
	                                                 ,НеУчитыватьРегистратор = Неопределено
												     ,СтруктурнаяЕдиница = Неопределено
												     ,ВидСчета = Неопределено
												     ,ВозвратТолькоСуммы = Ложь
												     ,ВключатьВсеСчетаРодственников = Ложь) Экспорт
	
	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДенежныеСредстваНаЛицевыхСчетахОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВидыЛицевыхСчетов.Ссылка КАК ВидСчета,
	|	СУММА(ЕСТЬNULL(ДенежныеСредстваНаЛицевыхСчетахОбороты.СуммаОборот, 0)) КАК СуммаОстаток
	|ИЗ
	|	Справочник.ВидыЛицевыхСчетов КАК ВидыЛицевыхСчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДенежныеСредстваНаЛицевыхСчетахОбороты.ВидСчета КАК ВидСчета,
	|			ДенежныеСредстваНаЛицевыхСчетахОбороты.Контрагент КАК Контрагент,
	|			ДенежныеСредстваНаЛицевыхСчетахОбороты.СуммаОборот КАК СуммаОборот,
	|			ДенежныеСредстваНаЛицевыхСчетахОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|		ИЗ
	|			РегистрНакопления.ДенежныеСредстваНаЛицевыхСчетах.Обороты(
	|					,
	|					&Период,
	|					Регистратор,
	|					(Контрагент = &Клиент
	|						ИЛИ &ВключатьВсеСчетаРодственников = ИСТИНА
	|							И Контрагент В
	|								(ВЫБРАТЬ
	|									РегистрСведений.РодственныеСвязи.Родственник
	|								ИЗ
	|									РегистрСведений.РодственныеСвязи
	|								ГДЕ
	|									РегистрСведений.РодственныеСвязи.Контрагент = &Клиент
	|									И РегистрСведений.РодственныеСвязи.ОбщийЛицевойСчет = ИСТИНА))
	|						И ВЫБОР
	|							КОГДА &СтруктурнаяЕдиница <> НЕОПРЕДЕЛЕНО
	|									И &СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|								ТОГДА СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ
	|						И ВЫБОР
	|							КОГДА &ВидСчета <> НЕОПРЕДЕЛЕНО
	|								ТОГДА ВидСчета = &ВидСчета
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ) КАК ДенежныеСредстваНаЛицевыхСчетахОбороты
	|		ГДЕ
	|			НЕ ДенежныеСредстваНаЛицевыхСчетахОбороты.Регистратор В (&Регистратор)) КАК ДенежныеСредстваНаЛицевыхСчетахОбороты
	|		ПО (ДенежныеСредстваНаЛицевыхСчетахОбороты.ВидСчета = ВидыЛицевыхСчетов.Ссылка)
	|ГДЕ
	|	ВидыЛицевыхСчетов.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &ВидСчета <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ВидыЛицевыхСчетов.Ссылка = &ВидСчета
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВидыЛицевыхСчетов.Ссылка,
	|	ДенежныеСредстваНаЛицевыхСчетахОбороты.Контрагент,
	|	ДенежныеСредстваНаЛицевыхСчетахОбороты.СтруктурнаяЕдиница
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтруктурнаяЕдиница,
	|	ВидСчета,
	|	ДенежныеСредстваНаЛицевыхСчетахОбороты.Контрагент";						  
	
	МассивИсключаемыхДок = Новый Массив;
	Если ЗначениеЗаполнено(НеУчитыватьРегистратор) Тогда
		Если ТипЗнч(НеУчитыватьРегистратор) = Тип("Массив") Тогда
			МассивИсключаемыхДок = НеУчитыватьРегистратор;
		ИначеЕсли ТипЗнч(НеУчитыватьРегистратор) = Тип("СписокЗначений") Тогда
			МассивИсключаемыхДок = НеУчитыватьРегистратор.ВыгрузитьЗначения();
		Иначе
			 МассивИсключаемыхДок.Добавить(НеУчитыватьРегистратор);
		КонецЕсли;   	
	КонецЕсли;	

	Запрос.УстановитьПараметр("Период"              		 , ?(Период = Неопределено,Дата(0001,01,01,0,0,0),Период));
	Запрос.УстановитьПараметр("Регистратор"         		 , МассивИсключаемыхДок);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"  		 , СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Клиент"              		 , Контрагент);
	Запрос.УстановитьПараметр("ВключатьВсеСчетаРодственников", ВключатьВсеСчетаРодственников);
	Запрос.УстановитьПараметр("ВидСчета"            		 , ВидСчета);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти