
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Регистратор = ?(ЭтотОбъект.Отбор.Найти("Регистратор") <> Неопределено, ЭтотОбъект.Отбор.Найти("Регистратор").Значение, Неопределено);
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ДенежныеСредстваНаЛицевыхСчетах.Период,
	                      |	ДенежныеСредстваНаЛицевыхСчетах.Регистратор,
	                      |	ДенежныеСредстваНаЛицевыхСчетах.НомерСтроки,
	                      |	ДенежныеСредстваНаЛицевыхСчетах.Активность,
	                      |	ДенежныеСредстваНаЛицевыхСчетах.ВидДвижения,
	                      |	ДенежныеСредстваНаЛицевыхСчетах.Контрагент,
	                      |	ДенежныеСредстваНаЛицевыхСчетах.СтруктурнаяЕдиница,
						  |	ДенежныеСредстваНаЛицевыхСчетах.ВидСчета,
	                      |	ДенежныеСредстваНаЛицевыхСчетах.Сумма,
	                      |	ДенежныеСредстваНаЛицевыхСчетах.МоментВремени
	                      |ИЗ
	                      |	РегистрНакопления.ДенежныеСредстваНаЛицевыхСчетах КАК ДенежныеСредстваНаЛицевыхСчетах
	                      |ГДЕ
	                      |	ДенежныеСредстваНаЛицевыхСчетах.Регистратор = &Регистратор");
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	ДвиженияПередЗаписью = Запрос.Выполнить().Выгрузить();
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ДвиженияПередЗаписью", ДвиженияПередЗаписью);
	
КонецПроцедуры

#КонецОбласти