
#Область Обработчики_событий_формы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВнешняяСистемаWallet = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.Wallet);
	
	Элементы.ФормаЗагрузитьОбновитьВидыКартWallet.Видимость = Константы.ИспользоватьWallet.Получить() И ЗначениеЗаполнено(ВнешняяСистемаWallet.ТокенДоступа) И ЗначениеЗаполнено(ВнешняяСистемаWallet.КлючШифрования);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ЗагрузитьОбновитьВидыКартWallet(Команда)
	
	СинхронизироватьВидыКарт();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаСервере
// Функция - Разобрать json
//
// Параметры:
//  РезультатЗапроса - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция РазобратьJson(РезультатЗапроса)
	
	ТекстJSON  = РезультатЗапроса.ПолучитьТелоКакСтроку();	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);
	
	Возврат ПараметрыJSON;
	
КонецФункции

&НаСервере
// Процедура, выполняет синхронизацию видов карт.
//
Процедура СинхронизироватьВидыКарт()
	
	ПараметрыВнешнейСистемы = ВнешняяСистемаWallet.Параметры.Получить();
	
	Если ПараметрыВнешнейСистемы <> Неопределено И ПараметрыВнешнейСистемы.Свойство("АдресAPI") Тогда
		АдресAPI = ПараметрыВнешнейСистемы.АдресAPI;
	Иначе
		АдресAPI = "api.webcitrus.app";
	КонецЕсли;
	
	Попытка
		Соединение = Новый HTTPСоединение(АдресAPI,,,,,,Новый ЗащищенноеСоединениеOpenSSL()); 
		Заголовки  = Новый Соответствие;    
		Заголовки.Вставить("X-Client-Id"    , ВнешняяСистемаWallet.ТокенДоступа);
		Заголовки.Вставить("X-Client-Secret", ВнешняяСистемаWallet.КлючШифрования);
		ЗапросНаСозданиеКарты = Новый HTTPЗапрос("/v1/projects", Заголовки); 
		Результат = Соединение.Получить(ЗапросНаСозданиеКарты);					
	Исключение	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	ПараметрыJson = РазобратьJson(Результат);
	
	Если Результат.КодСостояния = 200 Тогда
		
		Если ПараметрыJson.data.Количество() > 0 Тогда
			
			ВидыКарт = Новый СписокЗначений();
			МассивСуществующихВидовКарт = Новый	Массив();
			
			Для Каждого ВидКарты Из ПараметрыJson.data Цикл
				ВидыКарт.Добавить(ВидКарты.id, ВидКарты.name);	
			КонецЦикла;
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВидыКарт.Ссылка КАК Ссылка,
			|	ВидыКарт.ИдентификаторПроекта КАК ИдентификаторПроекта
			|ИЗ
			|	Справочник.ВидыКарт КАК ВидыКарт
			|ГДЕ
			|	ВидыКарт.ИдентификаторПроекта В(&МассивИдентификаторов)");
			
			Запрос.УстановитьПараметр("МассивИдентификаторов", ВидыКарт.ВыгрузитьЗначения());
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если Не РезультатЗапроса.Пустой() Тогда
				
				ТаблицаВидовКарт = РезультатЗапроса.Выгрузить();
				
				МассивСуществующихВидовКарт = ТаблицаВидовКарт.ВыгрузитьКолонку("ИдентификаторПроекта");
				
				// обновить существующие виды карт
				Для Каждого ВидКарты Из ТаблицаВидовКарт Цикл
					
					ВидКартыОбъект = ВидКарты.Ссылка.ПолучитьОбъект();
					ВидКартыОбъект.Наименование = ВидыКарт.НайтиПоЗначению(ВидКарты.ИдентификаторПроекта).Представление;
					ВидКартыОбъект.Именная		= Истина;
					ВидКартыОбъект.Записать();
					
				КонецЦикла;
				
			КонецЕсли;
			
			// добавить новые виды карт
			Для Каждого ВидКарты Из ВидыКарт Цикл
				
				Если МассивСуществующихВидовКарт.Найти(ВидКарты.Значение) = Неопределено Тогда
					
					ВидКартыОбъект = Справочники.ВидыКарт.СоздатьЭлемент();
					ВидКартыОбъект.ИдентификаторПроекта = ВидКарты.Значение;
					ВидКартыОбъект.Наименование			= ВидКарты.Представление;
					ВидКартыОбъект.Именная				= Истина;
					ВидКартыОбъект.Записать();
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Элементы.Список.Обновить();
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПараметрыJson.error.message);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обоработчик события "ПриАктивизацииСтроки".
//
Процедура СписокПриАктивизацииСтроки(Элемент)
  
	ВидКарты = Элемент.ТекущиеДанные;
	
	РеквизитыВнешнейСистемы = ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(ВнешняяСистемаWallet, "ТокенДоступа, КлючШифрования");
	
	Если НЕ ВидКарты = Неопределено И ЗначениеЗаполнено(ВидКарты.ИдентификаторПроекта)
		И ЗначениеЗаполнено(РеквизитыВнешнейСистемы.ТокенДоступа)
		И ЗначениеЗаполнено(РеквизитыВнешнейСистемы.КлючШифрования) Тогда
		
		Элементы.ФормаНастроитьКарту.Видимость = Истина;
		Элементы.ФормаНастроитьКарту.Доступность = ПолныеПрава();
	Иначе 
		Элементы.ФормаНастроитьКарту.Видимость = Ложь;
	КонецЕсли;
  
КонецПроцедуры

&НаСервере
// Функция, возвращает Истина если пользователь имеет Роль - Полные права, в противном случае возвращает Ложь.
//
Функция ПолныеПрава()
	
	Возврат РольДоступна("ПолныеПрава");
	
КонецФункции

&НаКлиенте
// Процедура - Настроить карту
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура НастроитьКарту(Команда)
  
	ВидКарты = Элементы.Список.ТекущиеДанные;
	
	Если ВидКарты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Ссылка = "https://webcitrus.app/tools/{client_id}/pass-designer/{project_id}?client_secret={client_secret}&1c";
	//
	//РеквизитыВнешнейСистемы = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ВнешняяСистемаWallet, "ТокенДоступа, КлючШифрования");
	//
	//Ссылка = СтрЗаменить(Ссылка, "{client_id}"    , РеквизитыВнешнейСистемы.ТокенДоступа);
	//Ссылка = СтрЗаменить(Ссылка, "{project_id}"   , ВидКарты.ИдентификаторПроекта);
	//Ссылка = СтрЗаменить(Ссылка, "{client_secret}", РеквизитыВнешнейСистемы.КлючШифрования);
	//
	//ПерейтиПоНавигационнойСсылке(Ссылка);
	
	ОткрытьФорму("Справочник.ВнешниеСистемы.Форма.ФормаНастройкиЭлектронныхКартWallet", Новый Структура("ИдПроекта, Ключ", ВидКарты.ИдентификаторПроекта, ЭтотОбъект.ВнешняяСистемаWallet));
  
КонецПроцедуры

#КонецОбласти
