
#Область ОбработчикиСобытий

// Процедура - обработчик события "ПередЗаписью" объекта.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	

	// Очищаем неиспользуемые реквизиты
	Если Не ЭтоГруппа Тогда
		
		Возможны_СегментНоменклатуры = ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Тариф И (ТипТарифа = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаЧасАссистирования Или ТипТарифа = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.АвторуЗаОплаченныйПрием)
										ИЛИ ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Процент;
		Возможны_СегментКонтрагента  = (ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Процент);
		Возможны_УчитыватьМатериалы  = (ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Процент);
		Возможны_ОтСуммы			 = (ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Процент);
		Возможны_УсловиеПродажи		 = (ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Тариф И ТипТарифа = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаЧас)
										ИЛИ (ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Тариф И ТипТарифа = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаЧасАссистирования)
										ИЛИ (ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Процент);
										
										
		Если Возможны_СегментНоменклатуры = Ложь Тогда
			СегментНоменклатуры = Неопределено;
		КонецЕсли;
		Если Возможны_СегментКонтрагента = Ложь Тогда
			СегментКонтрагента = Неопределено;
		КонецЕсли;
		Если Возможны_УчитыватьМатериалы = Ложь Тогда
			ВидЦен = Неопределено;
			СегментПередаваемыхМатериалов = Неопределено;
		КонецЕсли;
		Если Возможны_ОтСуммы = Ложь Тогда
			ВидЦенСуммы = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.БезСкидки;
			ОтСуммы = Неопределено;
		КонецЕсли;
		Если Возможны_УсловиеПродажи = Ложь Тогда
			СуммаПродаж = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти