
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылкаРеализация, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваров.Ссылка КАК Документ,
	|	РеализацияТоваров.Ссылка.Дата КАК Период,
	|	РеализацияТоваров.Ссылка.Склад КАК Склад,
	|	РеализацияТоваров.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	РеализацияТоваров.Ссылка.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	РеализацияТоваров.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваров.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА РеализацияТоваров.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	РеализацияТоваров.Количество КАК Количество,
	|	РеализацияТоваров.СтавкаНДС КАК СтавкаНДС,
	|	РеализацияТоваров.Сумма КАК Сумма,
	|	РеализацияТоваров.Ссылка.КартаКонтрагента КАК КартаКонтрагента
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	(ВЫБРАТЬ
	|		РеализацияТоваровЗапасы.Ссылка КАК Ссылка,
	|		РеализацияТоваровЗапасы.НомерСтроки КАК НомерСтроки,
	|		РеализацияТоваровЗапасы.Номенклатура КАК Номенклатура,
	|		РеализацияТоваровЗапасы.Партия КАК Партия,
	|		РеализацияТоваровЗапасы.Количество КАК Количество,
	|		РеализацияТоваровЗапасы.СтавкаНДС КАК СтавкаНДС,
	|		РеализацияТоваровЗапасы.Всего КАК Сумма
	|	ИЗ
	|		Документ.Реализация.Запасы КАК РеализацияТоваровЗапасы
	|	ГДЕ
	|		РеализацияТоваровЗапасы.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РеализацияТоваровПодарки.Ссылка,
	|		РеализацияТоваровПодарки.НомерСтроки,
	|		РеализацияТоваровПодарки.Номенклатура,
	|		РеализацияТоваровПодарки.Партия,
	|		РеализацияТоваровПодарки.Количество,
	|		ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС),
	|		0
	|	ИЗ
	|		Документ.Реализация.Подарки КАК РеализацияТоваровПодарки
	|	ГДЕ
	|		РеализацияТоваровПодарки.Ссылка = &Ссылка
	|		И РеализацияТоваровПодарки.Использование = ИСТИНА) КАК РеализацияТоваров
	|ГДЕ
	|	РеализацияТоваров.Ссылка = &Ссылка
	|	И РеализацияТоваров.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровПродажи.Ссылка КАК ДокументПродажи,
	|	РеализацияТоваровПродажи.Ссылка.Дата КАК Период,
	|	РеализацияТоваровПродажи.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	РеализацияТоваровПродажи.Ссылка.Сотрудник КАК Сотрудник,
	|	РеализацияТоваровПродажи.Ссылка.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровПродажи.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|		ИНАЧЕ РеализацияТоваровПродажи.Ссылка.Склад
	|	КОНЕЦ КАК Склад,
	|	РеализацияТоваровПродажи.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваровПродажи.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА РеализацияТоваровПродажи.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	РеализацияТоваровПродажи.Количество КАК Количество,
	|	РеализацияТоваровПродажи.СтоимостьБезСкидки КАК СтоимостьБезСкидки,
	|	РеализацияТоваровПродажи.Стоимость КАК Стоимость,
	|	РеализацияТоваровПродажи.Ссылка.КартаКонтрагента КАК КартаКонтрагента
	|ПОМЕСТИТЬ ВременнаяТаблицаПродажи
	|ИЗ
	|	(ВЫБРАТЬ
	|		РеализацияТоваровЗапасы.Ссылка КАК Ссылка,
	|		РеализацияТоваровЗапасы.НомерСтроки КАК НомерСтроки,
	|		РеализацияТоваровЗапасы.Номенклатура КАК Номенклатура,
	|		РеализацияТоваровЗапасы.Партия КАК Партия,
	|		РеализацияТоваровЗапасы.Количество КАК Количество,
	|		РеализацияТоваровЗапасы.Сумма + РеализацияТоваровЗапасы.СуммаАвтоматическойСкидкиНаценки + РеализацияТоваровЗапасы.Цена * РеализацияТоваровЗапасы.КоличествоУпаковок * РеализацияТоваровЗапасы.ПроцентСкидкиНаценки / 100 КАК СтоимостьБезСкидки,
	|		РеализацияТоваровЗапасы.Сумма КАК Стоимость
	|	ИЗ
	|		Документ.Реализация.Запасы КАК РеализацияТоваровЗапасы
	|	ГДЕ
	|		РеализацияТоваровЗапасы.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РеализацияТоваровПодарки.Ссылка,
	|		РеализацияТоваровПодарки.НомерСтроки,
	|		РеализацияТоваровПодарки.Номенклатура,
	|		РеализацияТоваровПодарки.Партия,
	|		РеализацияТоваровПодарки.КоличествоУпаковок * РеализацияТоваровПодарки.Упаковка.Коэффициент,
	|		0,
	|		0
	|	ИЗ
	|		Документ.Реализация.Подарки КАК РеализацияТоваровПодарки
	|	ГДЕ
	|		РеализацияТоваровПодарки.Ссылка = &Ссылка
	|		И РеализацияТоваровПодарки.Использование = ИСТИНА
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РеализацияУслуги.Ссылка,
	|		РеализацияУслуги.НомерСтроки,
	|		РеализацияУслуги.Номенклатура,
	|		РеализацияУслуги.Партия,
	|		РеализацияУслуги.Количество,
	|		РеализацияУслуги.Цена * РеализацияУслуги.КоличествоУпаковок,
	|		РеализацияУслуги.Сумма
	|	ИЗ
	|		Документ.Реализация.Услуги КАК РеализацияУслуги
	|	ГДЕ
	|		РеализацияУслуги.Ссылка = &Ссылка) КАК РеализацияТоваровПродажи
	|ГДЕ
	|	РеализацияТоваровПродажи.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровВзаморасчетыКонрагентов.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваровВзаморасчетыКонрагентов.Ссылка КАК Документ,
	|	РеализацияТоваровВзаморасчетыКонрагентов.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	РеализацияТоваровВзаморасчетыКонрагентов.Ссылка.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровВзаморасчетыКонрагентов.Ссылка.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяССылка)
	|			ТОГДА РеализацияТоваровВзаморасчетыКонрагентов.Ссылка.СтруктурнаяЕдиница.Организация
	|		ИНАЧЕ РеализацияТоваровВзаморасчетыКонрагентов.Ссылка.Организация
	|	КОНЕЦ КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	РеализацияТоваровВзаморасчетыКонрагентов.Ссылка.Дата КАК Период,
	|	РеализацияТоваровВзаморасчетыКонрагентов.Сумма КАК Сумма,
	|	РеализацияТоваровВзаморасчетыКонрагентов.Ссылка.Договор КАК Договор
	|ПОМЕСТИТЬ ВременнаяТаблицаВзаиморасчетыКонтрагентов
	|ИЗ
	|	Документ.Реализация.Запасы КАК РеализацияТоваровВзаморасчетыКонрагентов
	|ГДЕ
	|	РеализацияТоваровВзаморасчетыКонрагентов.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияУслуги.НомерСтроки,
	|	РеализацияУслуги.Ссылка,
	|	РеализацияУслуги.Ссылка.СтруктурнаяЕдиница,
	|	РеализацияУслуги.Ссылка.Контрагент,
	|	ВЫБОР
	|		КОГДА РеализацияУслуги.Ссылка.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяССылка)
	|			ТОГДА РеализацияУслуги.Ссылка.СтруктурнаяЕдиница.Организация
	|		ИНАЧЕ РеализацияУслуги.Ссылка.Организация
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	РеализацияУслуги.Ссылка.Дата,
	|	РеализацияУслуги.Сумма,
	|	РеализацияУслуги.Ссылка.Договор
	|ИЗ
	|	Документ.Реализация.Услуги КАК РеализацияУслуги
	|ГДЕ
	|	РеализацияУслуги.Ссылка = &Ссылка
	|
	|;
	|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	//|	РеализацияСкидкиНаценки.Ссылка.Дата КАК Период,
	//|	РеализацияСкидкиНаценки.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|	РеализацияСкидкиНаценки.Ссылка.Контрагент КАК Контрагент,
	//|	ВЫБОР
	//|		КОГДА РеализацияСкидкиНаценки.СкидкаНаценка.ВидЛицевогоСчета = ЗНАЧЕНИЕ(Справочник.ВидыЛицевыхСчетов.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЛицевыхСчетов.ОсновнойЛицевойСчет)
	//|		ИНАЧЕ РеализацияСкидкиНаценки.СкидкаНаценка.ВидЛицевогоСчета
	//|	КОНЕЦ КАК ВидСчета,
	//|	ВЫБОР
	//|		КОГДА РеализацияСкидкиНаценки.Ссылка.СуммаОплачено < РеализацияСкидкиНаценки.Ссылка.СуммаДокумента
	//|			ТОГДА РеализацияСкидкиНаценки.Сумма * РеализацияСкидкиНаценки.Ссылка.СуммаОплачено / РеализацияСкидкиНаценки.Ссылка.СуммаДокумента
	//|		ИНАЧЕ РеализацияСкидкиНаценки.Сумма
	//|	КОНЕЦ КАК Сумма
	//|ПОМЕСТИТЬ ТаблицаДенежныеСредстваНаЛицевыхСчетах
	//|ИЗ
	//|	Документ.Реализация.СкидкиНаценки КАК РеализацияСкидкиНаценки
	//|ГДЕ
	//|	РеализацияСкидкиНаценки.Ссылка = &Ссылка
	//|	И РеализацияСкидкиНаценки.НачислениеНаЛицевойСчетУдалить = ИСТИНА
	//|	И РеализацияСкидкиНаценки.Использование = ИСТИНА
	//|
	//|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровПродажи.Ссылка.Дата КАК Период,
	|	РеализацияТоваровПродажи.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	РеализацияТоваровПродажи.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваровПродажи.Номенклатура КАК Сертификат,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА РеализацияТоваровПродажи.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	РеализацияТоваровПродажи.Количество КАК Количество,
	|	РеализацияТоваровПродажи.Сумма КАК Сумма,
	|	РеализацияТоваровПродажи.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ВременнаяТаблицаСертификатыПродажи
	|ИЗ
	|	(ВЫБРАТЬ
	|		РеализацияТоваровЗапасы.Ссылка КАК Ссылка,
	|		РеализацияТоваровЗапасы.НомерСтроки КАК НомерСтроки,
	|		РеализацияТоваровЗапасы.Номенклатура КАК Номенклатура,
	|		РеализацияТоваровЗапасы.Партия КАК Партия,
	|		РеализацияТоваровЗапасы.КоличествоУпаковок КАК Количество,
	|		ВЫБОР
	|			КОГДА РеализацияТоваровЗапасы.Номенклатура.ВидНоминала
	|				ТОГДА РеализацияТоваровЗапасы.Цена * РеализацияТоваровЗапасы.КоличествоУпаковок
	|			ИНАЧЕ РеализацияТоваровЗапасы.Номенклатура.Номинал
	|		КОНЕЦ КАК Сумма,
	|		ВЫБОР
	|			КОГДА РеализацияТоваровЗапасы.Номенклатура.ЭтоИменнойСертификат
	|				ТОГДА РеализацияТоваровЗапасы.Ссылка.Контрагент
	|		КОНЕЦ КАК Контрагент
	|	ИЗ
	|		Документ.Реализация.Запасы КАК РеализацияТоваровЗапасы
	|	ГДЕ
	|		РеализацияТоваровЗапасы.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РеализацияТоваровПодарки.Ссылка,
	|		РеализацияТоваровПодарки.НомерСтроки,
	|		РеализацияТоваровПодарки.Номенклатура,
	|		РеализацияТоваровПодарки.Партия,
	|		РеализацияТоваровПодарки.КоличествоУпаковок,
	|		ВЫБОР
	|			КОГДА РеализацияТоваровПодарки.Номенклатура.ВидНоминала = ИСТИНА
	|				ТОГДА РеализацияТоваровПодарки.СуммаПодарочногоСертификата
	|			ИНАЧЕ РеализацияТоваровПодарки.Номенклатура.Номинал
	|		КОНЕЦ,
	|		РеализацияТоваровПодарки.Контрагент
	|	ИЗ
	|		Документ.Реализация.Подарки КАК РеализацияТоваровПодарки
	|	ГДЕ
	|		РеализацияТоваровПодарки.Ссылка = &Ссылка
	|		И РеализацияТоваровПодарки.Использование = ИСТИНА) КАК РеализацияТоваровПродажи
	|ГДЕ
	|	РеализацияТоваровПродажи.Ссылка = &Ссылка
	|	И РеализацияТоваровПродажи.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияСкидкиНаценки.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	РеализацияСкидкиНаценки.Ссылка.Ссылка КАК ДокументПродажи,
	|	РеализацияСкидкиНаценки.Ссылка.Дата КАК Период,
	|	ВЫБОР
	|		КОГДА РеализацияСкидкиНаценки.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияСкидкиНаценки.Контрагент
	|		ИНАЧЕ РеализацияСкидкиНаценки.Ссылка.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	РеализацияСкидкиНаценки.Ссылка.Сотрудник КАК Сотрудник,
	|	РеализацияСкидкиНаценки.НоменклатураСкидки КАК Номенклатура,
	|	NULL КАК НоменклатураПодарок,
	|	ЕСТЬNULL(РеализацияСкидкиНаценки.СкидкаНаценка, ЗНАЧЕНИЕ(Справочник.СкидкиНаценки.ПустаяСсылка)) КАК СкидкаНаценка,
	|	РеализацияСкидкиНаценки.СкидкаНаценка.НачислениеБонусами КАК НаБонусныйСчет,
	|	ВЫБОР
	|		КОГДА РеализацияСкидкиНаценки.СкидкаНаценка.СпособПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.СпособПредоставленияСкидки.Сумма)
	|				ИЛИ РеализацияСкидкиНаценки.СкидкаНаценка.СпособПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.СпособПредоставленияСкидки.СуммаНаДокумент)
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ РеализацияЗапасы.КлючСтроки ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА РеализацияЗапасы.Количество * РеализацияЗапасы.Цена > 0
	|									ТОГДА РеализацияСкидкиНаценки.Сумма / (РеализацияЗапасы.Количество * РеализацияЗапасы.Цена) * 100
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					КОГДА НЕ РеализацияУслуги.КлючСтроки ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА РеализацияУслуги.Количество * РеализацияУслуги.Цена > 0
	|									ТОГДА РеализацияСкидкиНаценки.Сумма / (РеализацияУслуги.Количество * РеализацияУслуги.Цена) * 100
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ РеализацияСкидкиНаценки.СкидкаНаценка.ЗначениеСкидкиНаценки
	|	КОНЕЦ КАК ПроцентСкидкиНаценки,
	|	РеализацияСкидкиНаценки.Сумма КАК СуммаСкидки,
	|	ВЫБОР
	|		КОГДА НЕ РеализацияЗапасы.КлючСтроки ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(РеализацияЗапасы.Количество, 0) * ЕСТЬNULL(РеализацияЗапасы.Цена, 0)
	|		КОГДА НЕ РеализацияУслуги.КлючСтроки ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(РеализацияУслуги.Количество, 0) * ЕСТЬNULL(РеализацияУслуги.Цена, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПродажи
	|ПОМЕСТИТЬ ТаблицаПредоставленныеСкидки
	|ИЗ
	|	Документ.Реализация.СкидкиНаценки КАК РеализацияСкидкиНаценки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Реализация.Запасы КАК РеализацияЗапасы
	|		ПО РеализацияСкидкиНаценки.Ссылка.Ссылка = РеализацияЗапасы.Ссылка
	|			И РеализацияСкидкиНаценки.КлючСтроки = РеализацияЗапасы.КлючСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Реализация.Услуги КАК РеализацияУслуги
	|		ПО РеализацияСкидкиНаценки.Ссылка.Ссылка = РеализацияУслуги.Ссылка
	|			И РеализацияСкидкиНаценки.КлючСтроки = РеализацияУслуги.КлючСтроки
	|ГДЕ
	|	РеализацияСкидкиНаценки.Ссылка = &Ссылка
	|	И ЕСТЬNULL(РеализацияСкидкиНаценки.Сумма, 0) <> 0
	|	И РеализацияСкидкиНаценки.Использование = ИСТИНА
	|	И РеализацияСкидкиНаценки.ПризнакОплатыБонусом = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	РеализацияЗапасы.Ссылка,
	|	РеализацияЗапасы.Ссылка.Дата,
	|	РеализацияЗапасы.Ссылка.Контрагент,
	|	РеализацияЗапасы.Ссылка.Сотрудник,
	|	РеализацияЗапасы.Номенклатура,
	|	NULL,
	|	ЗНАЧЕНИЕ(Справочник.СкидкиНаценки.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА РеализацияЗапасы.Цена * РеализацияЗапасы.КоличествоУпаковок > 0
	|			ТОГДА РеализацияЗапасы.СуммаРучнойСкидки / (РеализацияЗапасы.Цена * РеализацияЗапасы.КоличествоУпаковок) * 100
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	РеализацияЗапасы.СуммаРучнойСкидки,
	|	РеализацияЗапасы.Цена * РеализацияЗапасы.КоличествоУпаковок
	|ИЗ
	|	Документ.Реализация.Запасы КАК РеализацияЗапасы
	|ГДЕ
	|	РеализацияЗапасы.Ссылка = &Ссылка
	|	И РеализацияЗапасы.СуммаРучнойСкидки > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияУслуги.Ссылка.СтруктурнаяЕдиница,
	|	РеализацияУслуги.Ссылка,
	|	РеализацияУслуги.Ссылка.Дата,
	|	РеализацияУслуги.Ссылка.Контрагент,
	|	РеализацияУслуги.Ссылка.Сотрудник,
	|	РеализацияУслуги.Номенклатура,
	|	NULL,
	|	ЗНАЧЕНИЕ(Справочник.СкидкиНаценки.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА РеализацияУслуги.Цена * РеализацияУслуги.КоличествоУпаковок > 0
	|			ТОГДА РеализацияУслуги.СуммаРучнойСкидки / (РеализацияУслуги.Цена * РеализацияУслуги.КоличествоУпаковок) * 100
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	РеализацияУслуги.Количество * РеализацияУслуги.Цена * РеализацияУслуги.ПроцентСкидкиНаценки * 0.01,
	|	РеализацияУслуги.Цена * РеализацияУслуги.КоличествоУпаковок
	|ИЗ
	|	Документ.Реализация.Услуги КАК РеализацияУслуги
	|ГДЕ
	|	РеализацияУслуги.Ссылка = &Ссылка
	|	И РеализацияУслуги.СуммаРучнойСкидки > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияСкидкиНаценкиПодарки.Ссылка.СтруктурнаяЕдиница,
	|	РеализацияСкидкиНаценкиПодарки.Ссылка,
	|	РеализацияСкидкиНаценкиПодарки.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА РеализацияСкидкиНаценкиПодарки.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияСкидкиНаценкиПодарки.Контрагент
	|		ИНАЧЕ РеализацияСкидкиНаценкиПодарки.Ссылка.Контрагент
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ РеализацияЗапасы.КлючСтроки ЕСТЬ NULL
	|			ТОГДА РеализацияЗапасы.Ссылка.Сотрудник
	|		ИНАЧЕ РеализацияУслуги.Ссылка.Сотрудник
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ РеализацияЗапасы.КлючСтроки ЕСТЬ NULL
	|			ТОГДА РеализацияЗапасы.Номенклатура
	|		КОГДА НЕ РеализацияУслуги.КлючСтроки ЕСТЬ NULL
	|			ТОГДА РеализацияУслуги.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	РеализацияСкидкиНаценкиПодарки.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.СкидкиНаценки.ПустаяСсылка),
	|	ЛОЖЬ,
	|	РеализацияСкидкиНаценкиПодарки.Количество,
	|	0,
	|	0
	|ИЗ
	|	Документ.Реализация.Подарки КАК РеализацияСкидкиНаценкиПодарки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Реализация.Запасы КАК РеализацияЗапасы
	|		ПО (РеализацияЗапасы.Ссылка = РеализацияСкидкиНаценкиПодарки.Ссылка)
	|			И (РеализацияЗапасы.КлючСтроки = РеализацияСкидкиНаценкиПодарки.КлючСтроки)
	|			И (РеализацияСкидкиНаценкиПодарки.КлючСтроки <> &ПустойУникальныйИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Реализация.Услуги КАК РеализацияУслуги
	|		ПО (РеализацияУслуги.Ссылка = РеализацияСкидкиНаценкиПодарки.Ссылка)
	|			И (РеализацияУслуги.КлючСтроки = РеализацияСкидкиНаценкиПодарки.КлючСтроки)
	|			И (РеализацияСкидкиНаценкиПодарки.КлючСтроки <> &ПустойУникальныйИдентификатор)
	|ГДЕ
	|	РеализацияСкидкиНаценкиПодарки.Ссылка = &Ссылка
	|	И РеализацияСкидкиНаценкиПодарки.Использование = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	РеализацияСкидкиНаценки.Ссылка.Дата КАК Период,
	|	РеализацияСкидкиНаценки.БонусныйСчет КАК БонусныйСчет,
	|	РеализацияСкидкиНаценки.Ссылка КАК ДокументНачисления,
	|	ВЫБОР
	|		КОГДА &СуммаОплачено < РеализацияСкидкиНаценки.Ссылка.СуммаДокумента
	|				И РеализацияСкидкиНаценки.Ссылка.СуммаДокумента > 0
	|			ТОГДА РеализацияСкидкиНаценки.Сумма * &СуммаОплачено / РеализацияСкидкиНаценки.Ссылка.СуммаДокумента
	|		ИНАЧЕ РеализацияСкидкиНаценки.Сумма
	|	КОНЕЦ КАК Сумма
	|ПОМЕСТИТЬ ВременнаяТаблицаНачислениеБонусов
	|ИЗ
	|	Документ.Реализация.СкидкиНаценки КАК РеализацияСкидкиНаценки
	|ГДЕ
	|	РеализацияСкидкиНаценки.Ссылка = &Ссылка
	|	И РеализацияСкидкиНаценки.Использование = ИСТИНА
	|	И РеализацияСкидкиНаценки.ПризнакОплатыБонусом = ЛОЖЬ
	|	И РеализацияСкидкиНаценки.СкидкаНаценка.НачислениеБонусами = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	РеализацияСкидкиНаценки.Ссылка.Дата КАК Период,
	|	РеализацияСкидкиНаценки.БонусныйСчет КАК БонусныйСчет,
	|	NULL КАК ДокументНачисления,
	|	РеализацияСкидкиНаценки.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВременнаяТаблицаСписаниеБонусов
	|ИЗ
	|	Документ.Реализация.СкидкиНаценки КАК РеализацияСкидкиНаценки
	|ГДЕ
	|	РеализацияСкидкиНаценки.Ссылка = &Ссылка
	|	И РеализацияСкидкиНаценки.Использование = ИСТИНА
	|	И РеализацияСкидкиНаценки.ПризнакОплатыБонусом = ИСТИНА
	|	И РеализацияСкидкиНаценки.Сумма > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(РеализацияУслуги.НомерСтроки) КАК НомерСтроки,
	|	РеализацияУслуги.Ссылка.Дата КАК Период,
	|	РеализацияУслуги.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели) КАК СчетДт,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ДоходыВыручка) КАК СчетКт,
	|	РеализацияУслуги.Ссылка.Контрагент КАК СубконтоДт1,
	|	РеализацияУслуги.Номенклатура.Специализация КАК СубконтоКт1,
	|	РеализацияУслуги.Номенклатура КАК СубконтоКт2,
	|	РеализацияУслуги.Ссылка.Сотрудник КАК СубконтоКт3,
	|	РеализацияУслуги.Ссылка.Контрагент КАК СубконтоКт4,
	|	СУММА(РеализацияУслуги.Сумма) КАК Сумма,
	|	СУММА(РеализацияУслуги.Количество) КАК Количество,
	|	""Реализация(Лечение)"" КАК Содержание
	|ПОМЕСТИТЬ ВременнаяТаблицаУправленческий
	|ИЗ
	|	Документ.Реализация.Услуги КАК РеализацияУслуги
	|ГДЕ
	|	РеализацияУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияУслуги.Ссылка.Дата,
	|	РеализацияУслуги.Ссылка.СтруктурнаяЕдиница,
	|	РеализацияУслуги.Ссылка.Контрагент,
	|	РеализацияУслуги.Номенклатура,
	|	РеализацияУслуги.Номенклатура.Специализация,
	|	РеализацияУслуги.Ссылка.Сотрудник,
	|	РеализацияУслуги.Ссылка.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(РеализацияЗапасы.НомерСтроки),
	|	РеализацияЗапасы.Ссылка.Дата,
	|	РеализацияЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ДоходыВыручка),
	|	РеализацияЗапасы.Ссылка.Контрагент,
	|	РеализацияЗапасы.Номенклатура.Специализация,
	|	РеализацияЗапасы.Номенклатура,
	|	РеализацияЗапасы.Ссылка.Сотрудник,
	|	РеализацияЗапасы.Ссылка.Контрагент,
	|	СУММА(РеализацияЗапасы.Сумма),
	|	СУММА(РеализацияЗапасы.Количество),
	|	""Реализация(Запасы)""
	|ИЗ
	|	Документ.Реализация.Запасы КАК РеализацияЗапасы
	|ГДЕ
	|	РеализацияЗапасы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияЗапасы.Ссылка.Дата,
	|	РеализацияЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	РеализацияЗапасы.Ссылка.Контрагент,
	|	РеализацияЗапасы.Номенклатура,
	|	РеализацияЗапасы.Номенклатура.Специализация,
	|	РеализацияЗапасы.Ссылка.Сотрудник,
	|	РеализацияЗапасы.Ссылка.Контрагент";
		
	Запрос.УстановитьПараметр("Ссылка"            , ДокументСсылкаРеализация);
	Запрос.УстановитьПараметр("Контрагент"        , ДокументСсылкаРеализация.Контрагент);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
 	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", Новый УникальныйИдентификатор);
	Запрос.УстановитьПараметр("СуммаОплачено"	  ,СтруктураДополнительныеСвойства.ДляПроведения.СуммаОплачено);

	Запрос.ВыполнитьПакет();
	
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаРеализация, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВзаиморасчетыСКонтрагентами(ДокументСсылкаРеализация, СтруктураДополнительныеСвойства);	
	СформироватьТаблицаПродажи(ДокументСсылкаРеализация, СтруктураДополнительныеСвойства);
//	СформироватьТаблицаДенежныеСредстваНаЛицевыхСчетах(ДокументСсылкаРеализация, СтруктураДополнительныеСвойства);
	СформироватьТаблицаСертификатыПродажи(ДокументСсылкаРеализация, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПредоставленныеСкидки(СтруктураДополнительныеСвойства);
	СформироватьТаблицаБонусныеСчета(ДокументСсылкаРеализация, СтруктураДополнительныеСвойства);	
	СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства);	
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыСКонтрагентами(ДокументСсылкаРеализация, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ТаблицаВзаиморасчетыСКонтрагентами.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ВидДвижения КАК ВидДвижения,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Документ КАК ДокументРеализации,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Период КАК Период,
	|	ТаблицаВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Контрагент КАК Контрагент,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Организация КАК Организация,
	|	СУММА(ТаблицаВзаиморасчетыСКонтрагентами.Сумма) КАК Сумма,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Договор КАК Договор
	|ИЗ
	|	ВременнаяТаблицаВзаиморасчетыКонтрагентов КАК ТаблицаВзаиморасчетыСКонтрагентами
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаВзаиморасчетыСКонтрагентами.Документ,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Период,
	|	ТаблицаВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Контрагент,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Организация,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ВидДвижения,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Договор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыСКонтрагентами", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры	

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаРеализация, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ТаблицаЗапасыНаСкладах.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасыНаСкладах.Период КАК Период,
	|	ТаблицаЗапасыНаСкладах.Склад КАК Склад,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Партия КАК Партия,
	|	СУММА(ТаблицаЗапасыНаСкладах.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыНаСкладах
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыНаСкладах.Период,
	|	ТаблицаЗапасыНаСкладах.Склад,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Партия";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасыНаСкладах()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПродажи(ДокументСсылкаРеализация, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ТаблицаПродажи.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаПродажи.Период КАК Период,
	|	ТаблицаПродажи.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаПродажи.Склад КАК Склад,
	|	ТаблицаПродажи.Номенклатура КАК Номенклатура,
	|	ТаблицаПродажи.Партия КАК Партия,
	|	ТаблицаПродажи.ДокументПродажи КАК ДокументПродажи,
	|	ТаблицаПродажи.Сотрудник КАК Сотрудник,
	|	ТаблицаПродажи.Контрагент КАК Контрагент,
	|	ТаблицаПродажи.КартаКонтрагента КАК КартаКонтрагента,
	|	СУММА(ТаблицаПродажи.Количество) КАК Количество,
	|	СУММА(ТаблицаПродажи.СтоимостьБезСкидки) КАК СтоимостьБезСкидки,
	|	СУММА(ТаблицаПродажи.Стоимость) КАК Стоимость
	|ИЗ
	|	ВременнаяТаблицаПродажи КАК ТаблицаПродажи
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродажи.Период,
	|	ТаблицаПродажи.СтруктурнаяЕдиница,
	|	ТаблицаПродажи.Номенклатура,
	|	ТаблицаПродажи.Склад,
	|	ТаблицаПродажи.Партия,
	|	ТаблицаПродажи.ДокументПродажи,
	|	ТаблицаПродажи.Сотрудник,
	|	ТаблицаПродажи.Контрагент,
	|	ТаблицаПродажи.КартаКонтрагента";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажи", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСертификатыПродажи(ДокументСсылкаРеализация, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ТаблицаПродажи.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаПродажи.Период,
	|	ТаблицаПродажи.СтруктурнаяЕдиница,
	|	ТаблицаПродажи.Сертификат,
	|	ТаблицаПродажи.Партия КАК СерийныйНомер,
	|	СУММА(ТаблицаПродажи.Количество) КАК Количество,
	|	СУММА(ТаблицаПродажи.Сумма) КАК Сумма,
	|	ТаблицаПродажи.Контрагент
	|ИЗ
	|	ВременнаяТаблицаСертификатыПродажи КАК ТаблицаПродажи
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродажи.Период,
	|	ТаблицаПродажи.СтруктурнаяЕдиница,
	|	ТаблицаПродажи.Сертификат,
	|	ТаблицаПродажи.Партия,
	|	ТаблицаПродажи.Контрагент";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСертификаты", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДенежныеСредстваНаЛицевыхСчетах(ДокументСсылкаПриходныйКассовыйОрдер, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДенежныеСредстваНаЛицевыхСчетах.ВидДвижения,
	|	ДенежныеСредстваНаЛицевыхСчетах.Период,
	|	ДенежныеСредстваНаЛицевыхСчетах.СтруктурнаяЕдиница,
	|	ДенежныеСредстваНаЛицевыхСчетах.Контрагент,
	|	ДенежныеСредстваНаЛицевыхСчетах.ВидСчета,
	|	СУММА(ДенежныеСредстваНаЛицевыхСчетах.Сумма) КАК Сумма
	|ИЗ
	|	ТаблицаДенежныеСредстваНаЛицевыхСчетах КАК ДенежныеСредстваНаЛицевыхСчетах
	|ГДЕ
	|	ДенежныеСредстваНаЛицевыхСчетах.Сумма > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ДенежныеСредстваНаЛицевыхСчетах.ВидДвижения,
	|	ДенежныеСредстваНаЛицевыхСчетах.Период,
	|	ДенежныеСредстваНаЛицевыхСчетах.СтруктурнаяЕдиница,
	|	ДенежныеСредстваНаЛицевыхСчетах.Контрагент,
	|	ДенежныеСредстваНаЛицевыхСчетах.ВидСчета";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредстваНаЛицевыхСчетах", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПредоставленныеСкидки(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаПредоставленныеСкидки.Период КАК Период,
	|	ТаблицаПредоставленныеСкидки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаПредоставленныеСкидки.ДокументПродажи КАК ДокументПродажи,
	|	ТаблицаПредоставленныеСкидки.Контрагент КАК Контрагент,
	|	ТаблицаПредоставленныеСкидки.Сотрудник КАК Сотрудник,
	|	ТаблицаПредоставленныеСкидки.Номенклатура КАК Номенклатура,
	|	ТаблицаПредоставленныеСкидки.СкидкаНаценка КАК СкидкаНаценка,
	|	СУММА(ТаблицаПредоставленныеСкидки.СуммаСкидки) КАК СуммаСкидки,
	|	СУММА(ТаблицаПредоставленныеСкидки.СуммаПродажи) КАК СуммаПродажи,
	|	ТаблицаПредоставленныеСкидки.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ТаблицаПредоставленныеСкидки.НоменклатураПодарок КАК НоменклатураПодарок,
	|	ТаблицаПредоставленныеСкидки.НаБонусныйСчет КАК НаБонусныйСчет
	|ИЗ
	|	ТаблицаПредоставленныеСкидки КАК ТаблицаПредоставленныеСкидки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПредоставленныеСкидки.Период,
	|	ТаблицаПредоставленныеСкидки.СтруктурнаяЕдиница,
	|	ТаблицаПредоставленныеСкидки.ДокументПродажи,
	|	ТаблицаПредоставленныеСкидки.Контрагент,
	|	ТаблицаПредоставленныеСкидки.Сотрудник,
	|	ТаблицаПредоставленныеСкидки.Номенклатура,
	|	ТаблицаПредоставленныеСкидки.СкидкаНаценка,
	|	ТаблицаПредоставленныеСкидки.ПроцентСкидкиНаценки,
	|	ТаблицаПредоставленныеСкидки.НоменклатураПодарок,
	|	ТаблицаПредоставленныеСкидки.НаБонусныйСчет";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПредоставленныеСкидки", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВременнаяТаблицаУправленческий.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ВременнаяТаблицаУправленческий.СубконтоДт1,
	|	NULL КАК СубконтоДт2,
	|	NULL КАК СубконтоДт3,
	|	NULL КАК СубконтоДт4,
	|	ВременнаяТаблицаУправленческий.СубконтоКт1,
	|	ВременнаяТаблицаУправленческий.СубконтоКт2,
	|	ВременнаяТаблицаУправленческий.СубконтоКт3,
	|	ВременнаяТаблицаУправленческий.СубконтоКт4,
	|	ВременнаяТаблицаУправленческий.Сумма,
	|	ВременнаяТаблицаУправленческий.Количество,
	|	ВременнаяТаблицаУправленческий.Содержание КАК Содержание
	|ИЗ
	|	ВременнаяТаблицаУправленческий КАК ВременнаяТаблицаУправленческий
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаУправленческий.НомерСтроки,
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ЗНАЧЕНИЕ(Справочник.Специализации.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
	|	NULL,
	|	NULL,
	|	ВременнаяТаблицаУправленческий.Сумма,
	|	ВременнаяТаблицаУправленческий.Количество,
	|	ВременнаяТаблицаУправленческий.Содержание
	|ИЗ
	|	ВременнаяТаблицаУправленческий КАК ВременнаяТаблицаУправленческий
	|ГДЕ
	|	ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	// ВНИМАНИЕ!!! ДОП. ОБЪНДИНЕНИЕ НЕОБХОДИМО ДЛЯ ПРОСТАВЛЕНИЯ НЕОБХОДИМЫХ ТИПОВ В КОЛОНКИ
	
	РезультатЗапроса = Запрос.Выполнить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Процедура производит запись номинала партии сертификата.
//
Процедура ЗаписатьНоминалСертификатаПриПродаже(ДокументСсылкаРеализация) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияЗапасы.Партия КАК Партия,
	|	РеализацияЗапасы.Цена
	|ИЗ
	|	Документ.Реализация.Запасы КАК РеализацияЗапасы
	|ГДЕ
	|	РеализацияЗапасы.Ссылка = &Ссылка
	|	И РеализацияЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|	И РеализацияЗапасы.Номенклатура.ВидНоминала
	|	И РеализацияЗапасы.Ссылка.Проведен");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРеализация);
	СписокЗапасов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаЗапасов Из СписокЗапасов Цикл
		Если ЗначениеЗаполнено(СтрокаЗапасов.Партия) Тогда
			Партия = СтрокаЗапасов.Партия.ПолучитьОбъект();
			Партия.Номинал = СтрокаЗапасов.Цена;
			Партия.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура, формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаБонусныеСчета(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	РегистрыНакопления.БонусныеСчета.СформироватьТаблицуБонусныеСчета(СтруктураДополнительныеСвойства);
	
	// Запрос = Новый Запрос;
	// Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	// Запрос.Текст =
	// "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ТаблицаБонусныеСчета.Период КАК Период,
	//|	ТаблицаБонусныеСчета.ВидДвижения КАК ВидДвижения,
	//|	ТаблицаБонусныеСчета.БонусныйСчет КАК БонусныйСчет,
	//|	ТаблицаБонусныеСчета.ДокументНачисления КАК ДокументНачисления,
	//|	СУММА(ТаблицаБонусныеСчета.Сумма) КАК Сумма
	//|ИЗ
	//|	ТаблицаБонусныеСчета КАК ТаблицаБонусныеСчета
	//|ГДЕ
	//|	ТаблицаБонусныеСчета.Сумма > 0
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТаблицаБонусныеСчета.Период,
	//|	ТаблицаБонусныеСчета.ВидДвижения,
	//|	ТаблицаБонусныеСчета.БонусныйСчет,
	//|	ТаблицаБонусныеСчета.ДокументНачисления
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ ПЕРВЫЕ 0
	//|	ДАТАВРЕМЯ(1, 1, 1),
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	//|	ЗНАЧЕНИЕ(Справочник.БонусныеСчета.ПустаяСсылка),
	//|	ОперацияПоБонусномуСчету.Ссылка,
	//|	0
	//|ИЗ
	//|	Документ.ОперацияПоБонусномуСчету КАК ОперацияПоБонусномуСчету
	//|ГДЕ
	//|	ЛОЖЬ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ ПЕРВЫЕ 0
	//|	ДАТАВРЕМЯ(1, 1, 1),
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	//|	ЗНАЧЕНИЕ(Справочник.БонусныеСчета.ПустаяСсылка),
	//|	Посещение.Ссылка,
	//|	0
	//|ИЗ
	//|	Документ.Посещение КАК Посещение
	//|ГДЕ
	//|	ЛОЖЬ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ ПЕРВЫЕ 0
	//|	ДАТАВРЕМЯ(1, 1, 1),
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	//|	ЗНАЧЕНИЕ(Справочник.БонусныеСчета.ПустаяСсылка),
	//|	ПоступлениеДенежныхСредств.Ссылка,
	//|	0
	//|ИЗ
	//|	Документ.ПоступлениеДенежныхСредств КАК ПоступлениеДенежныхСредств
	//|ГДЕ
	//|	ЛОЖЬ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ ПЕРВЫЕ 0
	//|	ДАТАВРЕМЯ(1, 1, 1),
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	//|	ЗНАЧЕНИЕ(Справочник.БонусныеСчета.ПустаяСсылка),
	//|	ВводНачальныхОстатков.Ссылка,
	//|	0
	//|ИЗ
	//|	Документ.ВводНачальныхОстатков КАК ВводНачальныхОстатков
	//|ГДЕ
	//|	ЛОЖЬ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ТаблицаОплатаБонуснымиСчетами.Период КАК Период,
	//|	ТаблицаОплатаБонуснымиСчетами.ВидДвижения КАК ВидДвижения,
	//|	ТаблицаОплатаБонуснымиСчетами.БонусныйСчет КАК БонусныйСчет,
	//|	СУММА(ТаблицаОплатаБонуснымиСчетами.Сумма) КАК Сумма
	//|ИЗ
	//|	ТаблицаОплатаБонуснымиСчетами КАК ТаблицаОплатаБонуснымиСчетами
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТаблицаОплатаБонуснымиСчетами.Период,
	//|	ТаблицаОплатаБонуснымиСчетами.ВидДвижения,
	//|	ТаблицаОплатаБонуснымиСчетами.БонусныйСчет
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	БонусныеСчетаОстатки.БонусныйСчет КАК БонусныйСчет,
	//|	БонусныеСчетаОстатки.ДокументНачисления КАК ДокументНачисления,
	//|	БонусныеСчетаОстатки.СуммаОстаток КАК СуммаОстаток
	//|ИЗ
	//|	РегистрНакопления.БонусныеСчета.Остатки(
	//|			&ПериодОстатков,
	//|			БонусныйСчет В
	//|				(ВЫБРАТЬ
	//|					ТаблицаОплатаБонуснымиСчетами.БонусныйСчет
	//|				ИЗ
	//|					ТаблицаОплатаБонуснымиСчетами)) КАК БонусныеСчетаОстатки
	//|ГДЕ
	//|	БонусныеСчетаОстатки.СуммаОстаток > 0
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	БонусныеСчетаОстатки.ДокументНачисления.Дата";
	//
	// Если СтруктураДополнительныеСвойства.Свойство("ДатаРасчетаОстатковНаБонусныхСчетах") 
	//	И ЗначениеЗаполнено(СтруктураДополнительныеСвойства.ДатаРасчетаОстатковНаБонусныхСчетах) Тогда 
	//	Запрос.УстановитьПараметр("ПериодОстатков", СтруктураДополнительныеСвойства.ДатаРасчетаОстатковНаБонусныхСчетах);
	// Иначе
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПериодОстатков", "");
	// КонецЕсли;         
	//
	// РезультатЗапроса     = Запрос.ВыполнитьПакет();
	// ТаблицаБонусныеСчета = РезультатЗапроса[0].Выгрузить();
	//
	// ТаблицаОплатаБонуснымиСчетами = РезультатЗапроса[1].Выгрузить();
	// ОстатокНаБонусныхСчетах       = РезультатЗапроса[2].Выгрузить();
	//
	// Для Каждого СтрокаТЗОплата Из ТаблицаОплатаБонуснымиСчетами Цикл
	//	
	//	ОстатокНаБонусномСчете = ОстатокНаБонусныхСчетах.НайтиСтроки(Новый Структура("БонусныйСчет", СтрокаТЗОплата.БонусныйСчет));
	//	Для Каждого СтрокаТЗОстаток Из ОстатокНаБонусномСчете Цикл
	//		
	//		СуммаОплатаБонусамиПоПартии     = ?(СтрокаТЗОстаток.СуммаОстаток > СтрокаТЗОплата.Сумма, СтрокаТЗОплата.Сумма, СтрокаТЗОстаток.СуммаОстаток);
	//		НоваяСтрока                     = ТаблицаБонусныеСчета.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗОплата);
	//		
	//		НоваяСтрока.ДокументНачисления = СтрокаТЗОстаток.ДокументНачисления;
	//		НоваяСтрока.Сумма              = СуммаОплатаБонусамиПоПартии;
	//		СтрокаТЗОплата.Сумма           = СтрокаТЗОплата.Сумма - СуммаОплатаБонусамиПоПартии;
	//		СтрокаТЗОстаток.СуммаОстаток   = СтрокаТЗОстаток.СуммаОстаток - СуммаОплатаБонусамиПоПартии;			
	//		
	//		Если СтрокаТЗОплата.Сумма = 0 Тогда
	//			Прервать;
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	// КонецЦикла;
	//
	//// если что-то есть не списанное по партиям, списать без документа основания.
	// Если ТаблицаОплатаБонуснымиСчетами.Итог("Сумма") > 0 Тогда
	//	Для Каждого СтрокаТЗОплата Из ТаблицаОплатаБонуснымиСчетами Цикл
	//		Если СтрокаТЗОплата.Сумма = 0 Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		ЗаполнитьЗначенияСвойств(ТаблицаБонусныеСчета.Добавить(), СтрокаТЗОплата);
	//	КонецЦикла;
	// КонецЕсли;   	
	//
	// СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаБонусныеСчета", ТаблицаБонусныеСчета);	
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыФункцииФормированияПечтаныхФорм

// Функция формирует печатную форму Накладная документа.
//
Функция СформироватьПечатнуюФормуНакладная(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Реализация.Ссылка КАК Ссылка,
	|	Реализация.Номер,
	|	Реализация.Дата,
	|	Реализация.Контрагент КАК Получатель,
	|	Реализация.СтруктурнаяЕдиница.Организация КАК Организация,
	|	Реализация.СтруктурнаяЕдиница.Организация.Префикс КАК Префикс,
	|	Реализация.СтруктурнаяЕдиница.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств КАК Валюта,
	|	Реализация.ВидЦен.ЦенаВключаетНДС КАК ЦенаВключаетНДС
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.НоменклатураНаименованиеПолное КАК ТоварНаименованиеПолное,
	|	ВложенныйЗапрос.НоменклатураКод КАК Код,
	|	ВложенныйЗапрос.НоменклатураЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.НоменклатураЕдиницаИзмеренияНаименование КАК ЕдиницаЦены,
	|	ВложенныйЗапрос.СтавкаНДС,
	|	ВложенныйЗапрос.Цена,
	|	ВложенныйЗапрос.Сумма,
	|	ВложенныйЗапрос.СуммаСкидки,
	|	ВложенныйЗапрос.СуммаНДС,
	|	ВложенныйЗапрос.СуммаБезСкидки,
	|	ЛОЖЬ КАК ЭтоВозвратнаяТара,
	|	ВложенныйЗапрос.Упаковка,
	|	ВложенныйЗапрос.Количество,
	|	ВложенныйЗапрос.Партия
	|ИЗ
	|	(ВЫБРАТЬ
	|		Реализация.Ссылка КАК Ссылка,
	|		РеализацияЗапасы.Номенклатура КАК Номенклатура,
	|		РеализацияЗапасы.Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
	|		РеализацияЗапасы.Номенклатура.Код КАК НоменклатураКод,
	|		РеализацияЗапасы.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|		РеализацияЗапасы.Номенклатура.ЕдиницаИзмерения.Наименование КАК НоменклатураЕдиницаИзмеренияНаименование,
	|		РеализацияЗапасы.СтавкаНДС КАК СтавкаНДС,
	|		РеализацияЗапасы.Цена КАК Цена,
	|		РеализацияЗапасы.Сумма КАК Сумма,
	|		РеализацияЗапасы.СуммаНДС КАК СуммаНДС,
	|		РеализацияЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|		РеализацияЗапасы.СуммаАвтоматическойСкидкиНаценки КАК СуммаАвтоматическойСкидкиНаценки,
	|		РеализацияЗапасы.Количество * РеализацияЗапасы.Цена * РеализацияЗапасы.ПроцентСкидкиНаценки / 100 + РеализацияЗапасы.СуммаАвтоматическойСкидкиНаценки КАК СуммаСкидки,
	|		РеализацияЗапасы.Сумма + (РеализацияЗапасы.Количество * РеализацияЗапасы.Цена * РеализацияЗапасы.ПроцентСкидкиНаценки / 100 + РеализацияЗапасы.СуммаАвтоматическойСкидкиНаценки) КАК СуммаБезСкидки,
	|		РеализацияЗапасы.Упаковка КАК Упаковка,
	|		РеализацияЗапасы.КоличествоУпаковок КАК Количество,
	|		РеализацияЗапасы.Партия КАК Партия
	|	ИЗ
	|		Документ.Реализация.Запасы КАК РеализацияЗапасы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Реализация КАК Реализация
	|			ПО РеализацияЗапасы.Ссылка = Реализация.Ссылка) КАК ВложенныйЗапрос
	|ИТОГИ ПО
	|	Ссылка");
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_Накладная";
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	МассивРезультатов   = Запрос.ВыполнитьПакет();
	ДанныеПечати        = МассивРезультатов[0].Выбрать();
	ВыборкаПоДокументам = МассивРезультатов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		// Найдем в выборке товары по текущему документу
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		НайденСледующий = ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска);
		
		// Если в накладной только услуги - перейдем к следующему документу
		
		Если НайденСледующий Тогда
			ВыборкаПоТоварам = ВыборкаПоДокументам.Выбрать();
			ЕстьСкидки = ФормированиеПечатныхФорм.НужноВыводитьСкидки(ВыборкаПоТоварам,Истина);
			ВыборкаПоТоварам.Сбросить();
		Иначе
			Продолжить;
		КонецЕсли;
		
		// Макет необходимо получать для каждого документа, т.к. размеры колонок изменяются динамически
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Реализация.ПФ_MXL_Накладная");
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент    = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Выводим шапку накладной
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
		ТекстЗаголовка = НСтр("ru='Расходная накладная № %НомерДокумента% от %ДатаДокумента% г.'");
		ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%НомерДокумента%", ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(ДанныеПечати.Номер, ДанныеПечати.Префикс));
		ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%ДатаДокумента%",  Формат(ДанныеПечати.Дата, "ДФ='дд ММММ гггг'"));
		
		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                   = Макет.ПолучитьОбласть("Поставщик");
		ПредставлениеПоставщика                         = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата), "ПолноеНаименование");
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеПоставщика;
		ОбластьМакета.Параметры.Поставщик               = ДанныеПечати.Организация;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                   = Макет.ПолучитьОбласть("Покупатель");
		ПредставлениеПолучателя                         = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Получатель, ДанныеПечати.Дата), "ПолноеНаименование");
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеПолучателя;
		ОбластьМакета.Параметры.Получатель              = ДанныеПечати.Получатель;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим заголовок таблицы Товары
		
		Если ЕстьСкидки Тогда
			ОбластьКолонкаТовар = Макет.Область("ТоварСоСкидкой");
		Иначе
			ОбластьКолонкаТовар = Макет.Область("Товар");
		КонецЕсли;
		
		Если ЕстьСкидки Тогда
			ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки * 1.35;
		Иначе
			ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки * 1.2;
		КонецЕсли;
		
		Если ЕстьСкидки Тогда
			
			ОбластьНомера  = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|НомерСтроки");
			ОбластьКодов   = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|КолонкаКодов");
			ОбластьТовар   = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|ТоварСоСкидкой");
			ОбластьДанных  = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|ДанныеСоСкидкой");
			
		Иначе
			
			ОбластьНомера  = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
			ОбластьКодов   = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
			ОбластьТовар   = Макет.ПолучитьОбласть("ШапкаТаблицы|Товар");
			ОбластьДанных  = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		Если ЕстьСкидки Тогда
			ОбластьНомера  = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой1|НомерСтроки");
			ОбластьКодов   = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой1|КолонкаКодов");
			ОбластьТовар   = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой1|ТоварСоСкидкой");
			ОбластьДанных  = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой1|ДанныеСоСкидкой");
		Иначе
			ОбластьНомера  = Макет.ПолучитьОбласть("СтрокаТаблицы1|НомерСтроки");
			ОбластьКодов   = Макет.ПолучитьОбласть("СтрокаТаблицы1|КолонкаКодов");
			ОбластьТовар   = Макет.ПолучитьОбласть("СтрокаТаблицы1|Товар");
			ОбластьДанных  = Макет.ПолучитьОбласть("СтрокаТаблицы1|Данные");
		КонецЕсли;
		
		Сумма          = 0;
		СуммаНДС       = 0;
		ВсегоСкидок    = 0;
		НомерСтроки    = 0;
		ВсегоБезСкидок = 0;
		
		// Выводим строки таблицы Товары
		
		Пока ВыборкаПоТоварам.Следующий() Цикл
			
			НомерСтроки = НомерСтроки + 1;
			
			ОбластьНомера.Параметры.НомерСтроки = НомерСтроки;
			ТабличныйДокумент.Вывести(ОбластьНомера);
			
			ОбластьТовар.Параметры.Заполнить(ВыборкаПоТоварам);
			ОбластьТовар.Параметры.Товар = ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(ВыборкаПоТоварам.ТоварНаименованиеПолное, Неопределено)
			+ ?(ВыборкаПоТоварам.ЭтоВозвратнаяТара, НСтр("ru=' (возвратная тара)'"), "");
			
			ТабличныйДокумент.Присоединить(ОбластьТовар);
			
			ОбластьДанных.Параметры.Заполнить(ВыборкаПоТоварам);
			
			Если НЕ ВыборкаПоТоварам.Упаковка = Справочники.УпаковкиНоменклатуры.ПустаяСсылка() Тогда
				ОбластьДанных.Параметры.ЕдиницаЦены = ВыборкаПоТоварам.Упаковка.Наименование + "(" + ВыборкаПоТоварам.Упаковка.Коэффициент + ")";
			КонецЕсли;
			
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			
			Сумма          = Сумма          + ВыборкаПоТоварам.Сумма;
			СуммаНДС       = СуммаНДС       + ВыборкаПоТоварам.СуммаНДС;
			
			Если ЕстьСкидки Тогда
				ВсегоСкидок    = ВсегоСкидок    + ВыборкаПоТоварам.СуммаСкидки;
				ВсегоБезСкидок = ВсегоБезСкидок + ВыборкаПоТоварам.СуммаБезСкидки;
			КонецЕсли;
			
		КонецЦикла;
		
		// Выводим подвал
		
		Если ЕстьСкидки Тогда
			
			ОбластьНомера  = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|НомерСтроки");
			ОбластьКодов   = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|КолонкаКодов");
			ОбластьТовар   = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|ТоварСоСкидкой");
			ОбластьДанных  = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|ДанныеСоСкидкой");
			
		Иначе
			
			ОбластьНомера  = Макет.ПолучитьОбласть("ПодвалТаблицы|НомерСтроки");
			ОбластьКодов   = Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаКодов");
			ОбластьТовар   = Макет.ПолучитьОбласть("ПодвалТаблицы|Товар");
			ОбластьДанных  = Макет.ПолучитьОбласть("ПодвалТаблицы|Данные");
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		
		Если ЕстьСкидки Тогда
			
			ОбластьДанных.Параметры.ВсегоСкидок    = ВсегоСкидок;
			ОбластьДанных.Параметры.ВсегоБезСкидок = ВсегоБезСкидок;
			
		КонецЕсли;
		
		ОбластьДанных.Параметры.Всего = ФормированиеПечатныхФорм.ФорматСумм(Сумма);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		// Выводим ИтогоНДС
		
		Если ЕстьСкидки Тогда
			
			ОбластьНомера  = Макет.ПолучитьОбласть("ПодвалТаблицыНДССоСкидкой|НомерСтроки");
			ОбластьКодов   = Макет.ПолучитьОбласть("ПодвалТаблицыНДССоСкидкой|КолонкаКодов");
			ОбластьТовар   = Макет.ПолучитьОбласть("ПодвалТаблицыНДССоСкидкой|ТоварСоСкидкой");
			ОбластьДанных  = Макет.ПолучитьОбласть("ПодвалТаблицыНДССоСкидкой|ДанныеСоСкидкой");
			
		Иначе
			
			ОбластьНомера  = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|НомерСтроки");
			ОбластьКодов   = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|КолонкаКодов");
			ОбластьТовар   = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|Товар");
			ОбластьДанных  = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|Данные");
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		
		ОбластьДанных.Параметры.ВсегоНДС = ФормированиеПечатныхФорм.ФорматСумм(СуммаНДС);
		ОбластьДанных.Параметры.НДС = ?(ДанныеПечати.ЦенаВключаетНДС, НСтр("ru='В том числе НДС:'"), НСтр("ru='Сумма НДС:'"));
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		// Выводим Сумму прописью
		
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		СуммаКПрописи = Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС);
		
		ИтоговаяСтрока = НСтр("ru='Всего наименований %КоличествоНаименований%, на сумму %СуммаДокумента% '");
		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%КоличествоНаименований%", ВыборкаПоТоварам.Количество());
		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%СуммаДокумента%", ФормированиеПечатныхФорм.СуммаРубКоп(СуммаКПрописи, ,));// ФормированиеПечатныхФорм.ФорматСумм(СуммаКПрописи, ДанныеПечати.Валюта));
		
		ОбластьМакета.Параметры.ИтоговаяСтрока = ИтоговаяСтрока;
		ОбластьМакета.Параметры.СуммаПрописью  = ФормированиеПечатныхФорм.СформироватьСуммуПрописью(СуммаКПрописи, ДанныеПечати.Валюта);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим подписи
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		Кладовщик=ОбщегоНазначенияСтоматология.ПолучитьСрезПоследнихПоОтветсвеннымЛицам(ДанныеПечати.Организация,Перечисления.ТипыОтветственныхЛиц.Кладовщик,ДанныеПечати.Дата);
		Если Кладовщик.Количество()>0 Тогда		
			ОбластьМакета.Параметры.ОтпускПроизвел=ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(Кладовщик[0].Сотрудник));
		КонецЕсли;	 
		
		ТабличныйДокумент.Вывести(ОбластьМакета);	
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФормуНакладная()

// Функция формирует печатную форму Счета-фактуры.
//
Функция СформироватьПечатнуюФормуСчетФактура(МассивОбъектов, ОбъектыПечати)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РеализацияЗапасы.Ссылка КАК Ссылка,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА РеализацияЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	                      |				ТОГДА ИСТИНА
	                      |			ИНАЧЕ ЛОЖЬ
	                      |		КОНЕЦ) КАК ЕстьУслуги,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА РеализацияЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	                      |					ИЛИ РеализацияЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Материал)
	                      |				ТОГДА ИСТИНА
	                      |			ИНАЧЕ ЛОЖЬ
	                      |		КОНЕЦ) КАК ЕстьТовары
	                      |ПОМЕСТИТЬ НоменклатураДокументов
	                      |ИЗ
	                      |	Документ.Реализация.Запасы КАК РеализацияЗапасы
	                      |ГДЕ
	                      |	РеализацияЗапасы.Ссылка В(&МассивДокументов)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	РеализацияЗапасы.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Реализация.Ссылка КАК Ссылка,
	                      |	Реализация.Номер КАК Номер,
	                      |	Реализация.Дата КАК Дата,
	                      |	"""""""" КАК СтрокаПоДокументу,
	                      |	Реализация.Контрагент КАК Контрагент,
	                      |	Реализация.СтруктурнаяЕдиница.Организация КАК Организация,
	                      |	"""""""" КАК Руководитель,
	                      |	"""""""" КАК ДолжностьРуководителя,
	                      |	"""""""" КАК ГлавныйБухгалтер,
	                      |	Реализация.СтруктурнаяЕдиница.Организация.Префикс КАК Префикс,
	                      |	Реализация.Контрагент КАК Грузополучатель,
	                      |	Реализация.Номер КАК НомерПлатежноРасчетногоДокумента,
	                      |	Реализация.Дата КАК ДатаПлатежноРасчетногоДокумента,
	                      |	Реализация.СтруктурнаяЕдиница.Организация КАК Грузоотправитель,
	                      |	НЕОПРЕДЕЛЕНО КАК АдресДоставки,
	                      |	ИСТИНА КАК ЦенаВключаетНДС,
	                      |	ВЫБОР
	                      |		КОГДА НоменклатураДокументов.ЕстьУслуги
	                      |				И НЕ НоменклатураДокументов.ЕстьТовары
	                      |			ТОГДА ИСТИНА
	                      |		ИНАЧЕ ЛОЖЬ
	                      |	КОНЕЦ КАК ТолькоУслуги,
	                      |	ЛОЖЬ КАК ЭтоПередачаНаКомиссию,
	                      |	Реализация.СтруктурнаяЕдиница.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств КАК Валюта
	                      |ИЗ
	                      |	НоменклатураДокументов КАК НоменклатураДокументов
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Реализация КАК Реализация
	                      |		ПО НоменклатураДокументов.Ссылка = Реализация.Ссылка
	                      |ГДЕ
	                      |	Реализация.Ссылка В(&МассивДокументов)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ВложенныйЗапрос.Ссылка КАК Ссылка,
	                      |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	                      |	ВложенныйЗапрос.Характеристика КАК Характеристика,
	                      |	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
	                      |	ВложенныйЗапрос.Цена КАК Цена,
	                      |	ВложенныйЗапрос.Количество КАК Количество,
	                      |	ВложенныйЗапрос.Сумма КАК Сумма,
	                      |	ВложенныйЗапрос.СуммаНДС КАК СуммаНДС,
	                      |	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	                      |	ВложенныйЗапрос.Количество КАК КоличествоМест,
	                      |	ЛОЖЬ КАК ЭтоВозвратнаяТара,
	                      |	ВложенныйЗапрос.ТоварНаименование КАК ТоварНаименование
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		РеализацияЗапасы.Ссылка КАК Ссылка,
	                      |		РеализацияЗапасы.Номенклатура КАК Номенклатура,
	                      |		ВЫБОР
	                      |			КОГДА РеализацияЗапасы.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	                      |				ТОГДА ВЫРАЗИТЬ(РеализацияЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(150))
	                      |			ИНАЧЕ ""Предварительная оплата""
	                      |		КОНЕЦ КАК ТоварНаименование,
	                      |		НЕОПРЕДЕЛЕНО КАК Коэффициент,
	                      |		НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмерения,
	                      |		НЕОПРЕДЕЛЕНО КАК Характеристика,
	                      |		РеализацияЗапасы.СтавкаНДС КАК СтавкаНДС,
	                      |		РеализацияЗапасы.Цена КАК Цена,
	                      |		РеализацияЗапасы.Количество КАК Количество,
	                      |		РеализацияЗапасы.Сумма КАК Сумма,
	                      |		РеализацияЗапасы.СуммаНДС КАК СуммаНДС,
	                      |		РеализацияЗапасы.НомерСтроки КАК НомерСтроки
	                      |	ИЗ
	                      |		Документ.Реализация.Запасы КАК РеализацияЗапасы
	                      |	ГДЕ
	                      |		РеализацияЗапасы.Ссылка В(&МассивДокументов)
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		РеализацияУслуги.Ссылка,
	                      |		РеализацияУслуги.Номенклатура,
	                      |		ВЫБОР
	                      |			КОГДА РеализацияУслуги.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	                      |				ТОГДА ВЫРАЗИТЬ(РеализацияУслуги.Номенклатура.НаименованиеПолное КАК СТРОКА(150))
	                      |			ИНАЧЕ ""Предварительная оплата""
	                      |		КОНЕЦ,
	                      |		НЕОПРЕДЕЛЕНО,
	                      |		НЕОПРЕДЕЛЕНО,
	                      |		НЕОПРЕДЕЛЕНО,
	                      |		РеализацияУслуги.СтавкаНДС,
	                      |		РеализацияУслуги.Цена,
	                      |		РеализацияУслуги.Количество,
	                      |		РеализацияУслуги.Сумма,
	                      |		РеализацияУслуги.СуммаНДС,
	                      |		РеализацияУслуги.НомерСтроки
	                      |	ИЗ
	                      |		Документ.Реализация.Услуги КАК РеализацияУслуги) КАК ВложенныйЗапрос
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВложенныйЗапрос.Ссылка,
	                      |	ВложенныйЗапрос.Номенклатура,
	                      |	ВложенныйЗапрос.Характеристика,
	                      |	ВложенныйЗапрос.СтавкаНДС,
	                      |	ВложенныйЗапрос.Цена,
	                      |	ВложенныйЗапрос.Количество,
	                      |	ВложенныйЗапрос.Сумма,
	                      |	ВложенныйЗапрос.СуммаНДС,
	                      |	ВложенныйЗапрос.НомерСтроки,
	                      |	ВложенныйЗапрос.ТоварНаименование,
	                      |	ВложенныйЗапрос.Количество
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Ссылка,
	                      |	НомерСтроки
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	НЕОПРЕДЕЛЕНО КАК Ссылка,
	                      |	НЕОПРЕДЕЛЕНО КАК Номенклатура,
	                      |	НЕОПРЕДЕЛЕНО КАК Характеристика,
	                      |	НЕОПРЕДЕЛЕНО КАК НомерГТД,
	                      |	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения
	                      |ИТОГИ ПО
	                      |	Ссылка");
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	// ВалютаРеглУчета = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ВалютаРегламентированногоУчета");
	// Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРеглУчета);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданныйАванс_СчетФактура";
	
	ФормированиеПечатныхФорм.ЗаполнитьТабличныйДокументСчетФактура(ТабличныйДокумент, Запрос, Неопределено, ОбъектыПечати);
	
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФормуСчетФактура()

// Функция генерации печатной формы "АктОВыполненныхРаботах"
//
Функция СформироватьПечатнуюФорму_АктОВыполненныхРаботах(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПФ_MXL_АктОВыполненныхРаботах";
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Реализация.Номер КАК Номер,
		|	Реализация.Дата КАК Дата,
		|	Реализация.СтруктурнаяЕдиница.Организация КАК Организация,
		|	Реализация.Контрагент КАК Пациент,
		|	Реализация.Сотрудник КАК Врач,
		|	Реализация.СуммаДокумента КАК ОбщееИтогоСоСкидкой,
		|	Реализация.СтруктурнаяЕдиница.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств КАК Валюта
		|ИЗ
		|	Документ.Реализация КАК Реализация
		|ГДЕ
		|	Реализация.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеализацияУслуги.Номенклатура КАК Услуга,
		|	СУММА(РеализацияУслуги.КоличествоУпаковок) КАК Количество,
		|	МАКСИМУМ(РеализацияУслуги.Цена) КАК Цена,
		|	СУММА(РеализацияУслуги.Цена * ЕСТЬNULL(РеализацияУслуги.КоличествоУпаковок, 1)) КАК СуммаБезСкидки,
		|	СУММА(РеализацияУслуги.Цена * РеализацияУслуги.КоличествоУпаковок / 100 * РеализацияУслуги.ПроцентСкидкиНаценки + РеализацияУслуги.СуммаАвтоматическойСкидкиНаценки) КАК СуммаСкидки,
		|	СУММА(ВЫБОР
		|			КОГДА РеализацияУслуги.КоличествоУпаковок * РеализацияУслуги.Цена - РеализацияУслуги.Сумма = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА РеализацияУслуги.КоличествоУпаковок * РеализацияУслуги.Цена / 100 <> 0
		|						ТОГДА (РеализацияУслуги.КоличествоУпаковок * РеализацияУслуги.Цена - РеализацияУслуги.Сумма) / (РеализацияУслуги.КоличествоУпаковок * РеализацияУслуги.Цена / 100)
		|				КОНЕЦ
		|		КОНЕЦ) КАК ПроцентСкидки,
		|	СУММА(РеализацияУслуги.Сумма) КАК Сумма,
		|	РеализацияУслуги.Ссылка КАК Ссылка,
		|	РеализацияУслуги.Номенклатура.Артикул
		|ПОМЕСТИТЬ вртаб
		|ИЗ
		|	Документ.Реализация.Услуги КАК РеализацияУслуги
		|ГДЕ
		|	РеализацияУслуги.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияУслуги.Ссылка,
		|	РеализацияУслуги.Номенклатура,
		|	РеализацияУслуги.Номенклатура.Артикул
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вртаб.Услуга,
		|	вртаб.Количество,
		|	вртаб.Цена,
		|	вртаб.СуммаБезСкидки,
		|	вртаб.СуммаСкидки,
		|	вртаб.ПроцентСкидки КАК ПроцентСкидки,
		|	вртаб.Сумма КАК Сумма,
		|	вртаб.Ссылка КАК Ссылка,
		|	вртаб.НоменклатураАртикул
		|ИЗ
		|	вртаб КАК вртаб
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Реализация.Услуги КАК РеализацияУслуги
		|		ПО вртаб.Ссылка = РеализацияУслуги.Ссылка
		|			И вртаб.Услуга = РеализацияУслуги.Номенклатура";
		
		Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
		ПакетЗапросов 		= Запрос.ВыполнитьПакет();
		
		Реализация_Шапка 	= ПакетЗапросов[0].Выбрать();
		ВыборкаУслуги       = ПакетЗапросов[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ТаблицаУслуги	 	= ПакетЗапросов[2].Выгрузить();
		
		Макет = Документы.Реализация.ПолучитьМакет("ПФ_MXL_АктОВыполненныхРаботах");
		
		//==============================================================ЗАПОЛНЕНИЕ ШАПКИ====================================================================
		Реализация_Шапка.Следующий();		
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТекстЗаголовка = "Акт № " + ФормированиеПечатныхФорм.ПолучитьНомерНаПечатьПосле2011г(Реализация_Шапка.Номер, Истина, Истина) + " от " +Формат(Реализация_Шапка.Дата, "ДЛФ=DD");
		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		ПредставлениеПоставщика = ?(ЗначениеЗаполнено(Реализация_Шапка.Организация.ПолноеНаименование), Реализация_Шапка.Организация.ПолноеНаименование, Реализация_Шапка.Организация.Наименование);
		ЮрАдрес 				= Реализация_Шапка.Организация.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, "Вид");
		
		Если ЮрАдрес <> Неопределено Тогда
			ПредставлениеПоставщика = ПредставлениеПоставщика + ", Адрес: " + ЮрАдрес.Представление;
		КонецЕсли;
		Если Реализация_Шапка.Организация.ИНН <> "" Тогда 
			ПредставлениеПоставщика = ПредставлениеПоставщика + ", ИНН: " + Реализация_Шапка.Организация.ИНН;
		КонецЕсли;		
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеПоставщика;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		ОбластьМакета.Параметры.ПредставлениеПолучателя = Реализация_Шапка.Пациент;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		//=============================================================ЗАПОЛНЕНИЕ ТАБЛИЦЫ===================================================================		
		ЕстьСкидки   = ТаблицаУслуги.Итог("ПроцентСкидки") <> 0;
		Если ЕстьСкидки  Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой");
			ОбластьСтроки = Макет.ПолучитьОбласть("СтрокаСоСкидкой");
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		НомерСтроки = 0;
		СуммаДокумента = 0;
		Пока ВыборкаУслуги.СледующийПоЗначениюПоля("Услуга") Цикл
			ОбластьСтроки.Параметры.Заполнить(ВыборкаУслуги);			
			Если ВыборкаУслуги.Сумма <> 0 и  ЕстьСкидки Тогда
				ОбластьСтроки.Параметры.ПроцентСкидки = (ВыборкаУслуги.СуммаБезСкидки - ВыборкаУслуги.Сумма) / ВыборкаУслуги.СуммаБезСкидки * 100;
			КонецЕсли;
			НомерСтроки = НомерСтроки + 1;
			ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;
			СуммаДокумента =  СуммаДокумента + ВыборкаУслуги.Сумма;
			ТабличныйДокумент.Вывести(ОбластьСтроки);
		КонецЦикла;
		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.Всего = СуммаДокумента;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		ОбластьМакета.Параметры.ИтоговаяСтрока ="Всего оказано услуг " + НомерСтроки + ", на сумму: " + ФормированиеПечатныхФорм.СуммаРубКоп(СуммаДокумента, ,);// Формат(ТаблицаУслуги.Итог("Сумма"), "ЧЦ=15; ЧДЦ=2; ЧН=") + " руб." ;
		ОбластьМакета.Параметры.СуммаПрописью = ФормированиеПечатныхФорм.СформироватьСуммуПрописью(СуммаДокумента);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");		
		ТабличныйДокумент.Вывести(ОбластьМакета);		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент; 	
	
КонецФункции

Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_РасходнаяНакладная";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ИмяМакета = "ТОРГ12" ИЛИ ИмяМакета = "ТОРГ12СУслугами" Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Реализация.Дата КАК ДатаДокумента,
			|	Реализация.Номер КАК Номер,
			|	Реализация.СтруктурнаяЕдиница,
			|	Реализация.СтруктурнаяЕдиница.Организация.Префикс КАК Префикс,
			|	Реализация.СтруктурнаяЕдиница.Организация КАК Организация,
			|	Реализация.Контрагент КАК Контрагент,
			|   Реализация.Контрагент КАК Грузополучатель,
			|   Реализация.СтруктурнаяЕдиница.Организация КАК Грузоотправитель,
			|	Реализация.Контрагент КАК Плательщик,
			|	Реализация.СуммаДокумента
			|ИЗ
			|	Документ.Реализация КАК Реализация
			|ГДЕ
			|	Реализация.Ссылка = &ТекущийДокумент";
			Шапка = Запрос.Выполнить().Выбрать();
			
			Шапка.Следующий();
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
			Запрос.УстановитьПараметр("Услуга", Перечисления.ТипыНоменклатуры.Услуга);
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
			|	ВЫБОР
			|		КОГДА (ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
			|			ТОГДА ВложенныйЗапрос.Номенклатура.Наименование
			|		ИНАЧЕ ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
			|	КОНЕЦ КАК ЗапасНаименование,
			|	ВложенныйЗапрос.Партия,
			|	ВложенныйЗапрос.Номенклатура.Код КАК ЗапасКод,
			|	ВложенныйЗапрос.Номенклатура.ЕдиницаИзмерения.Наименование КАК БазоваяЕдиницаНаименование,
			|	ВложенныйЗапрос.Номенклатура.ЕдиницаИзмерения.Код КАК БазоваяЕдиницаКодПоОКЕИ,
			|	ВложенныйЗапрос.ЕдиницаИзмерения КАК ВидУпаковки,
			|	1 КАК КоличествоВОдномМесте,
			|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
			|	ВложенныйЗапрос.Цена КАК Цена,
			|	ВложенныйЗапрос.Количество КАК Количество,
			|	ВложенныйЗапрос.Количество КАК КоличествоМест,
			|	ВложенныйЗапрос.Сумма КАК Сумма,
			|	ВложенныйЗапрос.СуммаНДС КАК СуммаНДС,
			|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
			|	1 КАК ID
			|ИЗ
			|	(ВЫБРАТЬ
			|		РеализацияЗапасы.Номенклатура КАК Номенклатура,
			|		РеализацияЗапасы.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|		РеализацияЗапасы.СтавкаНДС КАК СтавкаНДС,
			|		РеализацияЗапасы.Цена КАК Цена,
			|		СУММА(РеализацияЗапасы.Количество) КАК Количество,
			|		СУММА(РеализацияЗапасы.Сумма) КАК Сумма,
			|		СУММА(РеализацияЗапасы.СуммаНДС) КАК СуммаНДС,
			|		МИНИМУМ(РеализацияЗапасы.НомерСтроки) КАК НомерСтроки,
			|		РеализацияЗапасы.Партия КАК Партия
			|	ИЗ
			|		Документ.Реализация.Запасы КАК РеализацияЗапасы
			|	ГДЕ
			|		РеализацияЗапасы.Ссылка = &ТекущийДокумент
			|	
			|	СГРУППИРОВАТЬ ПО
			|		РеализацияЗапасы.Номенклатура,
			|		РеализацияЗапасы.Номенклатура.ЕдиницаИзмерения,
			|		РеализацияЗапасы.СтавкаНДС,
			|		РеализацияЗапасы.Цена,
			|		РеализацияЗапасы.Партия)
			|   КАК ВложенныйЗапрос
			|" + ?(ИмяМакета = "ТОРГ12", "ГДЕ
			|	ВложенныйЗапрос.Номенклатура.ТипНоменклатуры <> &Услуга
			|", "") + "
			|УПОРЯДОЧИТЬ ПО
			|	ID,
			|	НомерСтроки";
			
			ЗапросЗапасы = Запрос.Выполнить().Выгрузить();
			
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Реализация_ТОРГ12";
			
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Реализация.ПФ_MXL_ТОРГ12");
			
			ОбластьМакетаШапка            = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакетаЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаб");
			ОбластьМакетаСтрока           = Макет.ПолучитьОбласть("Строка");
			ОбластьМакетаИтогоПоСтранице  = Макет.ПолучитьОбласть("ИтогоПоСтранице");
			ОбластьМакетаВсего            = Макет.ПолучитьОбласть("Всего");
			ОбластьМакетаПодвал           = Макет.ПолучитьОбласть("Подвал");
			
			// Выводим общие реквизиты шапки
			
			СведенияОПоставщике       = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Организация,      Шапка.ДатаДокумента, ,);
			СведенияОГрузоотправителе = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Грузоотправитель, Шапка.ДатаДокумента, ,);
			СведенияОПокупателе       = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Контрагент,       Шапка.ДатаДокумента, ,);
			СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Грузополучатель,  Шапка.ДатаДокумента, ,);
			
			ОбластьМакетаШапка.Параметры.Заполнить(Шапка);
			
			Если Шапка.ДатаДокумента < Дата('20110101') Тогда
				НомерДокумента = ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
			Иначе
				НомерДокумента = ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Шапка.Номер,Шапка.Префикс, Истина);
			КонецЕсли;		
			
			ОбластьМакетаШапка.Параметры.НомерДокумента = НомерДокумента;
			ОбластьМакетаШапка.Параметры.ДатаДокумента  = Шапка.ДатаДокумента;
			
			Если Шапка.Организация = Шапка.Грузоотправитель Тогда
				ОбластьМакетаШапка.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
			Иначе
				ОбластьМакетаШапка.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправителе, "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
			КонецЕсли;
			
			ОбластьМакетаШапка.Параметры.ПредставлениеПодразделения= Шапка.СтруктурнаяЕдиница;
			ОбластьМакетаЗаголовокТаблицы.Параметры.Ценарубкоп1= "Цена"+ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти()+","+ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыДробнойЧасти();
			ОбластьМакетаЗаголовокТаблицы.Параметры.Суммарубкоп1= "Сумма"+ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти()+","+ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыДробнойЧасти();
			ОбластьМакетаЗаголовокТаблицы.Параметры.Суммарубкоп2= "Сумма"+Символы.ПС+ "без учета НДС"+Символы.ПС+ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти()+","+ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыДробнойЧасти();
			ОбластьМакетаЗаголовокТаблицы.Параметры.Суммарубкоп3= "Сумма"+Символы.ПС+"с учетом НДС"+Символы.ПС+ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти()+","+ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыДробнойЧасти();
			ОбластьМакетаШапка.Параметры.ПредставлениеГрузополучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
			ОбластьМакетаШапка.Параметры.ПредставлениеПоставщика      = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике,"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
			ОбластьМакетаШапка.Параметры.ПредставлениеПлательщика     = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
			
			// Выводим всевозможные коды
			ОбластьМакетаШапка.Параметры.ОрганизацияПоОКПО     = СведенияОГрузоотправителе.КодПоОКПО;
			ОбластьМакетаШапка.Параметры.ВидДеятельностиПоОКДП = "";
			ОбластьМакетаШапка.Параметры.ГрузополучательПоОКПО = СведенияОГрузополучателе.КодПоОКПО;
			ОбластьМакетаШапка.Параметры.ПоставщикПоОКПО  = СведенияОПоставщике.КодПоОКПО;
			ОбластьМакетаШапка.Параметры.ПлательщикПоОКПО = СведенияОПокупателе.КодПоОКПО;
			ОбластьМакетаШапка.Параметры.ОснованиеНомер   = "";
			ОбластьМакетаШапка.Параметры.ОснованиеДата    = "";
			ОбластьМакетаШапка.Параметры.ТранспортнаяНакладнаяНомер = "";
			ОбластьМакетаШапка.Параметры.ТранспортнаяНакладнаяДата  = "";
			
			ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
			
			// Инициализация счетчика страниц
			НомерСтраницы = 1;                   
			
			// Инициализация итогов по странице
			ИтогоМестНаСтранице       = 0;
			ИтогоКоличествоНаСтранице = 0;
			ИтогоСуммаНаСтранице      = 0;
			ИтогоНДСНаСтранице        = 0;
			ИтогоСуммаСНДСНаСтранице  = 0;
			
			// Инициализация итогов по документу
			ИтогоМест       = 0;
			ИтогоКоличество = 0;
			ИтогоСуммаСНДС  = 0;
			ИтогоСумма      = 0;
			ИтогоНДС        = 0;
			
			// Инициализация счетчика строк
			НомерСтроки     = 0;
			КоличествоСтрок = ЗапросЗапасы.Количество();
			
			// Выводим заголовок многострочной части
			ОбластьМакетаЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
			ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
			
			// Выводим многострочную часть докмента
			Для Каждого ВыборкаСтрок Из ЗапросЗапасы Цикл
				
				НомерСтроки = НомерСтроки + 1;
				
				ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаСтрок);
				
				ОбластьМакетаСтрока.Параметры.Номер = НомерСтроки;
				
				Если НЕ ЗначениеЗаполнено(ВыборкаСтрок.КоличествоМест) Тогда
					ОбластьМакетаСтрока.Параметры.ВидУпаковки           = "";
					ОбластьМакетаСтрока.Параметры.КоличествоВОдномМесте = "";
				КонецЕсли;
				
				ОбластьМакетаСтрока.Параметры.ЗапасНаименование = ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(ВыборкаСтрок.ЗапасНаименование, 
				ВыборкаСтрок.Партия);
				
				
				СуммаСНДС = ВыборкаСтрок.Сумма;
				
				КоличествоМест = ВыборкаСтрок.КоличествоМест;
				Количество     = ВыборкаСтрок.Количество;
				СуммаНДС       = ВыборкаСтрок.СуммаНДС;
				СуммаБезНДС    = СуммаСНДС - СуммаНДС;
				
				ОбластьМакетаСтрока.Параметры.СуммаСНДС   = СуммаСНДС;
				ОбластьМакетаСтрока.Параметры.СуммаНДС    = СуммаНДС;
				ОбластьМакетаСтрока.Параметры.СтавкаНДС   = ВыборкаСтрок.СтавкаНДС;
				ОбластьМакетаСтрока.Параметры.СуммаБезНДС = СуммаБезНДС;
				ОбластьМакетаСтрока.Параметры.Цена        = СуммаБезНДС / ?(Количество = 0, 1, Количество);
				
				// Проверим вывод
				СтрокаСПодвалом = Новый Массив;
				Если НомерСтроки = 1 Тогда
					СтрокаСПодвалом.Добавить(ОбластьМакетаЗаголовокТаблицы); // если первая строка, то должен
				КонецЕсли;                                                   // помещаться заголовок
				СтрокаСПодвалом.Добавить(ОбластьМакетаСтрока);
				СтрокаСПодвалом.Добавить(ОбластьМакетаИтогоПоСтранице);
				Если НомерСтроки = КоличествоСтрок Тогда           // если последняя строка, должен
					СтрокаСПодвалом.Добавить(ОбластьМакетаВсего);  // помещаться и подвал документа
					СтрокаСПодвалом.Добавить(ОбластьМакетаПодвал);
				КонецЕсли;
				
				Если НомерСтроки <> 1 И НЕ ТабличныйДокумент.ПроверитьВывод(СтрокаСПодвалом) Тогда
					
					// Выводим итоги по странице
					ОбластьМакетаИтогоПоСтранице.Параметры.ИтогМестПоСтранице       = ИтогоМестНаСтранице;
					ОбластьМакетаИтогоПоСтранице.Параметры.ИтогКоличествоПоСтранице = ИтогоКоличествоНаСтранице;
					ОбластьМакетаИтогоПоСтранице.Параметры.ИтогСуммыПоСтранице      = ИтогоСуммаНаСтранице;
					ОбластьМакетаИтогоПоСтранице.Параметры.ИтогНДСПоСтранице        = ИтогоНДСНаСтранице;
					ОбластьМакетаИтогоПоСтранице.Параметры.ИтогСуммыСНДСПоСтранице  = ИтогоСуммаСНДСНаСтранице;
					ТабличныйДокумент.Вывести(ОбластьМакетаИтогоПоСтранице);
					
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					
					// Очистим итоги по странице
					ИтогоМестНаСтранице       = 0;
					ИтогоКоличествоНаСтранице = 0;
					ИтогоСуммаНаСтранице      = 0;
					ИтогоНДСНаСтранице        = 0;
					ИтогоСуммаСНДСНаСтранице  = 0;
					
					// Выведем заголовок таблицы
					НомерСтраницы = НомерСтраницы + 1;
					ОбластьМакетаЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
					ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
					
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
				
				// Увеличим итоги по странице
				ИтогоМестНаСтранице       = ИтогоМестНаСтранице       + КоличествоМест;
				ИтогоКоличествоНаСтранице = ИтогоКоличествоНаСтранице + Количество;
				ИтогоСуммаНаСтранице      = ИтогоСуммаНаСтранице      + СуммаБезНДС;
				ИтогоНДСНаСтранице        = ИтогоНДСНаСтранице        + СуммаНДС;
				ИтогоСуммаСНДСНаСтранице  = ИтогоСуммаСНДСНаСтранице  + СуммаСНДС;
				
				// Увеличим итоги по документу
				ИтогоМест       = ИтогоМест       + КоличествоМест;
				ИтогоКоличество = ИтогоКоличество + Количество;
				ИтогоСумма      = ИтогоСумма      + СуммаБезНДС;
				ИтогоНДС        = ИтогоНДС        + СуммаНДС;
				ИтогоСуммаСНДС  = ИтогоСуммаСНДС  + СуммаСНДС;
				
			КонецЦикла;
			
			// Выводим итоги по странице
			ОбластьМакетаИтогоПоСтранице.Параметры.ИтогМестПоСтранице       = ИтогоМестНаСтранице;
			ОбластьМакетаИтогоПоСтранице.Параметры.ИтогКоличествоПоСтранице = ИтогоКоличествоНаСтранице;
			ОбластьМакетаИтогоПоСтранице.Параметры.ИтогСуммыПоСтранице      = ИтогоСуммаНаСтранице;
			ОбластьМакетаИтогоПоСтранице.Параметры.ИтогНДСПоСтранице        = ИтогоНДСНаСтранице;
			ОбластьМакетаИтогоПоСтранице.Параметры.ИтогСуммыСНДСПоСтранице  = ИтогоСуммаСНДСНаСтранице;
			
			ТабличныйДокумент.Вывести(ОбластьМакетаИтогоПоСтранице);
			
			// Выводим итоги по документу в целом
			ОбластьМакетаВсего.Параметры.ИтогМест       = ИтогоМест;
			ОбластьМакетаВсего.Параметры.ИтогКоличество = ИтогоКоличество;
			ОбластьМакетаВсего.Параметры.ИтогСуммы      = ИтогоСумма;
			ОбластьМакетаВсего.Параметры.ИтогНДС        = ИтогоНДС;
			ОбластьМакетаВсего.Параметры.ИтогСуммыСНДС  = ИтогоСуммаСНДС;
			
			ТабличныйДокумент.Вывести(ОбластьМакетаВсего);
			
			// Выводим подвал документа
			// Руководители = ФормированиеПечатныхФорм.ОтветственныеЛицаОрганизационнойЕдиницы(Шапка.Руководители, Шапка.ДатаДокумента);
			
			Руководитель=ОбщегоНазначенияСтоматология.ПолучитьСрезПоследнихПоОтветсвеннымЛицам(Шапка.Организация,Перечисления.ТипыОтветственныхЛиц.Руководитель, Шапка.ДатаДокумента);
			Если Руководитель.Количество()>0 Тогда
				ОбластьМакетаПодвал.Параметры.ФИОРуководителя =ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(Руководитель[0].Сотрудник));
				ОбластьМакетаПодвал.Параметры.ДолжностьРуководителя =Руководитель[0].Должность;
			КонецЕсли;
			
			ГлавБух=ОбщегоНазначенияСтоматология.ПолучитьСрезПоследнихПоОтветсвеннымЛицам(Шапка.Организация,Перечисления.ТипыОтветственныхЛиц.ГлавныйБухгалтер, Шапка.ДатаДокумента);
			Если ГлавБух.Количество()>0  Тогда
				ОбластьМакетаПодвал.Параметры.ФИОГлавБухгалтера=ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(ГлавБух[0].Сотрудник));
			КонецЕсли;
			
			Кладовщик=ОбщегоНазначенияСтоматология.ПолучитьСрезПоследнихПоОтветсвеннымЛицам(Шапка.Организация,Перечисления.ТипыОтветственныхЛиц.Кладовщик, Шапка.ДатаДокумента);		
			Если Кладовщик.Количество()>0 Тогда
				ОбластьМакетаПодвал.Параметры.ФИОКладовщика=ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(Кладовщик[0].Сотрудник));
				ОбластьМакетаПодвал.Параметры.ДолжностьКладовщика=Кладовщик[0].Должность;
			КонецЕсли;
			
			ОбластьМакетаПодвал.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(КоличествоСтрок, ,",,,,,,,,0");
			ОбластьМакетаПодвал.Параметры.ВсегоМестПрописью                          = ?(ИтогоМест = 0, "", ЧислоПрописью(ИтогоМест, ,",,,С,,,,,0")); 
			ОбластьМакетаПодвал.Параметры.СуммаПрописью                              = ФормированиеПечатныхФорм.СформироватьСуммуПрописью(ИтогоСуммаСНДС);
			
			ПолнаяДатаДокумента = Формат(Шапка.ДатаДокумента, "ДФ=""дд ММММ гггг """"года""""""");
			ДлинаСтроки         = СтрДлина(ПолнаяДатаДокумента);
			ПервыйРазделитель   = Найти(ПолнаяДатаДокумента," ");
			ВторойРазделитель   = Найти(Прав(ПолнаяДатаДокумента,ДлинаСтроки - ПервыйРазделитель), " ") + ПервыйРазделитель;
			
			ОбластьМакетаПодвал.Параметры.ДатаДокументаДень  = """" + Лев(ПолнаяДатаДокумента, ПервыйРазделитель - 1) + """";
			ОбластьМакетаПодвал.Параметры.ДатаДокументаМесяц = Сред(ПолнаяДатаДокумента, ПервыйРазделитель + 1, ВторойРазделитель - ПервыйРазделитель - 1);
			ОбластьМакетаПодвал.Параметры.ДатаДокументаГод   = Прав(ПолнаяДатаДокумента, ДлинаСтроки - ВторойРазделитель);	
			
			ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Функция получения списка печатных форм.
//
Функция ПолучитьСписокПечатныхФорм() Экспорт
	
	Список = Новый СписокЗначений;
	Список.Добавить("ТОРГ12", "Товарная накладная (ТОРГ-12)", , БиблиотекаКартинок.Документ);
	Список.Добавить("СчетФактура", "Счет-фактура", , БиблиотекаКартинок.Документ);
	Список.Добавить("Накладная", "Расходная накладная", , БиблиотекаКартинок.Документ);
	Список.Добавить("ПФ_MXL_АктОВыполненныхРаботах", "Акт о выполненных работах", , БиблиотекаКартинок.Документ);
	Список.Добавить("ПФ_MXL_УниверсальныйПередаточныйДокумент", "Универсальный передаточный документ (УПД)", , БиблиотекаКартинок.Документ);
	
	Возврат Список;
		
КонецФункции

#КонецОбласти

#Область ПроцедурыФункцииПечати

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Накладная") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Накладная", "Расходная накладная", СформироватьПечатнуюФормуНакладная(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетФактура", "Счет фактура", СформироватьПечатнуюФормуСчетФактура(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТОРГ12") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТОРГ12", "Расходная накладная", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ТОРГ12"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктОВыполненныхРаботах") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_АктОВыполненныхРаботах", "Акт о выполненных работах", СформироватьПечатнуюФорму_АктОВыполненныхРаботах(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_АктОВыполненныхРаботах"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_УниверсальныйПередаточныйДокумент") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_УниверсальныйПередаточныйДокумент", "Универсальный передаточный документ (УПД)", СформироватьПечатнуюФормуУПД(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры // Печать()

#КонецОбласти

#Область Сформировать_УПД

// Функция, формирует печатную форму УниверсальныйПередаточныйДокумент документа.
// 
Функция СформироватьПечатнуюФормуУПД(МассивДокументовПродажи, ОбъектыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент                     = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт; 	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УПД";
	
	НомерТипаДокумента = 0;
	
	Для Каждого ДокументПродажа Из МассивДокументовПродажи Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыУПД(ДокументПродажа);
		
		ЗаполнитьТабличныйДокументУПД(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, Неопределено);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция получает данные для печатной формы УПД.
// 
Функция ПолучитьДанныеДляПечатнойФормыУПД(МассивОбъектов) Экспорт
	
	КолонкаКодов = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	
	Если Не ЗначениеЗаполнено(КолонкаКодов) Тогда
		КолонкаКодов = "Код";
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеДокументов.Ссылка КАК Ссылка,
	               |	ДанныеДокументов.СтруктурнаяЕдиница.Организация КАК Организация,
	               |	ДанныеДокументов.Склад КАК Склад,
	               |	ИСТИНА КАК ЦенаВключаетНДС
	               |ПОМЕСТИТЬ ТаблицаДанныхДокументов
	               |ИЗ
	               |	Документ.Реализация КАК ДанныеДокументов
	               |ГДЕ
	               |	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Выполнить();
	
	ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, МассивОбъектов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	&ПредставлениеСчетФактура КАК ПредставлениеДокумента,
	|	1 КАК СтатусУПД,
	|	ИСТИНА КАК УчитыватьНДС,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК НомерИсправления,
	|	НЕОПРЕДЕЛЕНО КАК ДатаИсправления,
	|	ЛОЖЬ КАК Исправление,
	|	НЕОПРЕДЕЛЕНО КАК НомерСчетаФактуры,
	|	НЕОПРЕДЕЛЕНО КАК ДатаСчетаФактуры,
	|	НЕОПРЕДЕЛЕНО КАК НомерИсправленияСчетаФактуры,
	|	НЕОПРЕДЕЛЕНО КАК ДатаИсправленияСчетаФактуры,
	|	"""" КАК СтрокаПоДокументу,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаСчетаФактуры,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.СтруктурнаяЕдиница.Организация КАК Организация,
	|	ДанныеДокумента.СтруктурнаяЕдиница.Организация.Префикс КАК Префикс,
	|	ДанныеДокумента.Контрагент КАК Грузополучатель,
	|	ДанныеДокумента.СтруктурнаяЕдиница.Организация КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки,
	|	ДанныеДокумента.Ссылка КАК Основание,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьНомер,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьДата,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьВыдана,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьЛицо,
	|	"""" КАК Кладовщик
	|ИЗ
	|	Документ.Реализация КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеДокументов
	|		ПО ДанныеДокумента.Ссылка = ДанныеДокументов.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.Номенклатура.НаименованиеПолное КАК НоменклатураНаименование,
	|	ВЫБОР
	|		КОГДА &КолонкаКодов = ""Артикул""
	|			ТОГДА ТаблицаДокумента.Номенклатура.Артикул
	|		ИНАЧЕ ТаблицаДокумента.Номенклатура.Код
	|	КОНЕЦ КАК ТоварКод,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ТаблицаДокумента.Упаковка.Владелец.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения.Код
	|		ИНАЧЕ ТаблицаДокумента.Упаковка.Владелец.ЕдиницаИзмерения.Код
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	ТаблицаДокумента.Характеристика КАК Характеристика,
	|	ТаблицаДокумента.Характеристика.Наименование КАК ХарактеристикаНаименование,
	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокумента.КоличествоУпаковок КАК Количество,
	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЦенаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ КАК Всего,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЦенаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС - ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ КАК Стоимость,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЦенаВключаетНДС
	|			ТОГДА (ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС) / ТаблицаДокумента.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаДокумента.Цена
	|	КОНЕЦ КАК Цена,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("ПредставлениеСчетФактура", НСтр("ru='счет-фактура'"));
	Запрос.УстановитьПараметр("КолонкаКодов", КолонкаКодов);
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧасти = МассивРезультатов[1];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти",
	РезультатПоШапке, РезультатПоТабличнойЧасти);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

// Процедура, заполняет универсальный передаточный документ.
// 
Процедура ЗаполнитьТабличныйДокументУПД(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, КомплектыПечати = Неопределено) Экспорт
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Реализация.ПФ_MXL_УниверсальныйПередаточныйДокумент");
	ДанныеПечати        = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ВыборкаПоДокументам = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		// Для печати комплектов
		Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено Тогда
			
			КомплектПечатиПоСсылке = КомплектыПечати.Найти(ДанныеПечати.Ссылка,"Ссылка");
			
			Если КомплектПечатиПоСсылке = Неопределено Тогда
				КомплектПечатиПоСсылке = КомплектыПечати[0];
			КонецЕсли;
			
			Если КомплектПечатиПоСсылке.Экземпляров = 0 Тогда
				Продолжить
			КонецЕсли;
			
		КонецЕсли;
		
		Если ДанныеПечати.УчитыватьНДС И (ДанныеПечати.СтатусУПД = 2 ИЛИ ДанныеПечати.Номер = Неопределено) Тогда
			
			Если ДанныеПечати.Номер = Неопределено Тогда
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для документа %1 не введен %2'"),
				ДанныеПечати.Ссылка,
				ДанныеПечати.ПредставлениеДокумента);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДанныеПечати.Ссылка,
				,
				"ТекстСчетФактура");
			Иначе
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для документа %1 не заполнены данные предъявленной счет-фактуры поставщика'"),
				ДанныеПечати.Ссылка);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДанныеПечати.Ссылка,
				"ПредъявленСчетФактура");
			КонецЕсли;
			
		Иначе
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент = Ложь;
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			// Выводим общие реквизиты шапки.
			СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата);
			СведенияОКонтрагенте = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата);
			ЗаполнитьРеквизитыШапкиУПД(ДанныеПечати, СведенияОбОрганизации, СведенияОКонтрагенте, Макет, ТабличныйДокумент);
			
			// Выводим заголовок таблицы
			ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
			
			НомерСтраницы = 1;
			
			// Инициализация итогов в документе.
			ИтоговыеСуммы = СтруктураИтоговыеСуммы();
			
			// Создаем массив для проверки вывода.
			МассивВыводимыхОбластей = Новый Массив;
			
			// Выводим многострочную часть документа.
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ОбластьИтого  = Макет.ПолучитьОбласть("Итого");
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
			ОбластьПодвалНакладной = Макет.ПолучитьОбласть("ПодвалНакладной");
			
			ЗаполнитьРеквизитыПодвалаУПД(ОбластьПодвал, ДанныеПечати, СведенияОбОрганизации, СведенияОКонтрагенте, ОбластьПодвалНакладной);
			
			СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
			ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска);
			
			СтрокаТовары = ВыборкаПоДокументам.Выбрать();
			КоличествоСтрок = СтрокаТовары.Количество();
			ТолькоСтавкаБезНДС = Истина;
			НомерСтроки = 0;
			
			Пока СтрокаТовары.Следующий() Цикл
				
				НомерСтроки = НомерСтроки + 1;
				
				ЗаполнитьРеквизитыСтрокиТовара(СтрокаТовары, ОбластьСтрока, НомерСтроки);
				
				ПроставитьПрочеркиВПустыеПоляСтроки(ОбластьСтрока);
				
				СтруктураПараметров = Новый Структура;
				
				Если СтрокаТовары.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
					СтруктураПараметров.Вставить("СтавкаНДС", НСтр("ru='без НДС'"));
					СтруктураПараметров.Вставить("СуммаНДС", НСтр("ru='без НДС'"));
				ИначеЕсли СтрокаТовары.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
					СтруктураПараметров.Вставить("СуммаНДС", 0);
					ТолькоСтавкаБезНДС = Ложь;
				Иначе
					ТолькоСтавкаБезНДС = Ложь;
				КонецЕсли;
				
				ОбластьСтрока.Параметры.Заполнить(СтруктураПараметров);
				
				МассивВыводимыхОбластей.Очистить();
				МассивВыводимыхОбластей.Добавить(ОбластьСтрока);
				
				Если НомерСтроки = КоличествоСтрок Тогда
					МассивВыводимыхОбластей.Добавить(ОбластьИтого);
					МассивВыводимыхОбластей.Добавить(ОбластьПодвал);
					МассивВыводимыхОбластей.Добавить(ОбластьПодвалНакладной);
				КонецЕсли;
				
				Если НомерСтроки <> 1 И НЕ ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
					НомерСтраницы = НомерСтраницы + 1;
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ОбластьНумерацияЛистов = Макет.ПолучитьОбласть("НумерацияЛистов");
					ОбластьНумерацияЛистов.Параметры.Номер      = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Универсальный передаточный документ № %1 от %2 г.", ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(ДанныеПечати.Номер, ""), Формат(ДанныеПечати.Дата, "ДФ='дд ММММ гггг'")); 
					ОбластьНумерацияЛистов.Параметры.НомерЛиста = НомерСтраницы;
					ТабличныйДокумент.Вывести(ОбластьНумерацияЛистов);
					ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				РассчитатьИтоговыеСуммы(ИтоговыеСуммы, СтрокаТовары);
				
			КонецЦикла;
			
			// Выводим итоги по документу
			ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, НомерСтроки);
			
			Если ТолькоСтавкаБезНДС Тогда
				ИтоговыеСуммы.ИтогоСуммаНДС = НСтр("ru='без НДС'");
			КонецЕсли;
			
			ОбластьИтого.Параметры.Заполнить(ИтоговыеСуммы);
			ПроставитьПрочеркиВПустыеПоляСтроки(ОбластьИтого);
			ТабличныйДокумент.Вывести(ОбластьИтого);
			
			КоличествоСтраниц = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Документ составлен на %1 %2'"),
			НомерСтраницы,
			ФормаМножественногоЧисла(
			НСтр("ru = 'листе'"), НСтр("ru = 'листах'"), НСтр("ru = 'листах'"), НомерСтраницы));
			СтруктураПараметров = Новый Структура("КоличествоЛистов", КоличествоСтраниц);
			ОбластьПодвал.Параметры.Заполнить(СтруктураПараметров);
			ТабличныйДокумент.Вывести(ОбластьПодвал);
			ТабличныйДокумент.Вывести(ОбластьПодвалНакладной);
			
			// Выведем нужное количество экземпляров (при печати комплектов).
			Если КомплектыПечати <> Неопределено
				И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено
				И КомплектПечатиПоСсылке.Экземпляров > 1 Тогда
				
				ОбластьКопирования = ТабличныйДокумент.ПолучитьОбласть(НомерСтрокиНачало,,ТабличныйДокумент.ВысотаТаблицы);
				Для Итератор = 2 По КомплектПечатиПоСсылке.Экземпляров Цикл
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент.Вывести(ОбластьКопирования);
				КонецЦикла;
				
			КонецЕсли;
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати,
			ДанныеПечати.Ссылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура, заполняет подвал табличного документа.
// 
Процедура ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, ВсегоНомеров)
	
	ИтоговыеСуммы.Вставить("КоличествоПорядковыхНомеровЗаписейПрописью", ЧислоПрописью(ВсегоНомеров, ,",,,,,,,,0"));
	ИтоговыеСуммы.Вставить("СуммаПрописью", ФормированиеПечатныхФорм.СформироватьСуммуПрописью(ИтоговыеСуммы.ИтогоВсего));
	
КонецПроцедуры

// Процедура, рассчитывает итоговые суммы.
// 
Процедура РассчитатьИтоговыеСуммы(ИтоговыеСуммы, СтрокаТовары)
	
	СтруктураСуммПоСтроке = СтруктураРесурсовДляИтогов();
	
	ЗаполнитьЗначенияСвойств(СтруктураСуммПоСтроке, СтрокаТовары);
	
	Для Каждого Элемент Из СтруктураСуммПоСтроке Цикл
		
		Если ЗначениеЗаполнено(Элемент.Значение) Тогда
			ИтоговыеСуммы["Итого"+Элемент.Ключ+"НаСтранице"] 	= ИтоговыеСуммы["Итого"+Элемент.Ключ+"НаСтранице"] + Элемент.Значение;
			ИтоговыеСуммы["Итого"+Элемент.Ключ] 				= ИтоговыеСуммы["Итого"+Элемент.Ключ] + Элемент.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция, возвращает структуру ресурсов для итогов.
// 
Функция СтруктураРесурсовДляИтогов()
	
	Структура = Новый Структура;
	
	Структура.Вставить("Стоимость",       0);
	Структура.Вставить("СуммаНДС",          0);
	Структура.Вставить("Всего",         0);
	Структура.Вставить("Количество",        0);
	Структура.Вставить("КоличествоМест",    0);
	Структура.Вставить("КоличествоПринято", 0);
	Структура.Вставить("МассаБрутто",       0);
	Структура.Вставить("МассаНетто",        0);
	
	Структура.Вставить("РазницаБезНДСУвеличение", 0);
	Структура.Вставить("РазницаБезНДСУменьшение", 0);
	Структура.Вставить("РазницаНДСУвеличение",    0);
	Структура.Вставить("РазницаНДСУменьшение",    0);
	Структура.Вставить("РазницаСНДСУвеличение",   0);
	Структура.Вставить("РазницаСНДСУменьшение",   0);
	
	Возврат Структура;
	
КонецФункции

// Процедура, проставляет прочерки в пустые поля строки.
// 
Процедура ПроставитьПрочеркиВПустыеПоляСтроки(ОбластьМакета)
	
	Для ПараметрМакета = 0 По ОбластьМакета.Параметры.Количество() - 1 Цикл
		
		ТекПараметр = ОбластьМакета.Параметры.Получить(ПараметрМакета);
		
		Если НЕ ЗначениеЗаполнено(ТекПараметр) Тогда
			ОбластьМакета.Параметры.Установить(ПараметрМакета, "--");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура, заполняет реквизиты строки.
// 
Процедура ЗаполнитьРеквизитыСтрокиТовара(СтрокаТовары, ОбластьМакета, НомерСтроки)
	
	ОбластьМакета.Параметры.Заполнить(СтрокаТовары);
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("НомерСтроки", НомерСтроки);
	СтруктураПараметров.Вставить("ТоварНаименование", ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(
	СтрокаТовары.НоменклатураНаименование,
	СтрокаТовары.ХарактеристикаНаименование));
	
	ОбластьМакета.Параметры.Заполнить(СтруктураПараметров);
	
КонецПроцедуры

// Процедура, заполняет реквизиты подвала универсального передаточного документа.
// 
Процедура ЗаполнитьРеквизитыПодвалаУПД(ОбластьПодвала, ДанныеПечати, СведенияОбОрганизации, СведенияОКонтрагенте, ОбластьПодвалНакладной)
	
	ОбластьПодвала.Параметры.Заполнить(ДанныеПечати);
	ОбластьПодвалНакладной.Параметры.Заполнить(ДанныеПечати);
	
	СтруктураПараметров = Новый Структура;
	
	// Руководители = ФормированиеПечатныхФорм.ОтветственныеЛицаОрганизаций(ДанныеПечати.Организация, ДанныеПечати.Дата);
	
	Руководитель = ОбщегоНазначенияСтоматология.ПолучитьСрезПоследнихПоОтветсвеннымЛицам(ДанныеПечати.Организация,Перечисления.ТипыОтветственныхЛиц.Руководитель, ДанныеПечати.Дата);
	ГлавныйБухгалтер = ОбщегоНазначенияСтоматология.ПолучитьСрезПоследнихПоОтветсвеннымЛицам(ДанныеПечати.Организация,Перечисления.ТипыОтветственныхЛиц.ГлавныйБухгалтер, ДанныеПечати.Дата);
	
	Если СведенияОбОрганизации.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		
		Если Руководитель.Количество() > 0 Тогда
			СтруктураПараметров.Вставить("ФИОРуководителя", ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(Руководитель[0].Сотрудник)));
			СтруктураПараметров.Вставить("ДолжностьРуководителя", ФормированиеПечатныхФорм.ПредставлениеДолжностиОтветственногоЛица(Перечисления.ТипыОтветственныхЛиц.Руководитель, ДанныеПечати.Организация, ДанныеПечати.Дата));
		КонецЕсли;
		
		Если ГлавныйБухгалтер.Количество() > 0 Тогда
			СтруктураПараметров.Вставить("ФИОГлавногоБухгалтера", ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(ГлавныйБухгалтер[0].Сотрудник)));
		КонецЕсли;
		
	Иначе
		
		Если Руководитель.Количество() > 0 Тогда
			СтруктураПараметров.Вставить("ФИОПБОЮЛ", ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(Руководитель[0].Сотрудник)));
		КонецЕсли;
		
		СтруктураПараметров.Вставить("Свидетельство", СведенияОбОрганизации.Свидетельство);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПечати.Кладовщик) Тогда
		СтруктураПараметров.Вставить("ФИОКладовщика", ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(ДанныеПечати.Кладовщик)));
	Иначе
		
		Кладовщик = ОбщегоНазначенияСтоматология.ПолучитьСрезПоследнихПоОтветсвеннымЛицам(ДанныеПечати.Организация,Перечисления.ТипыОтветственныхЛиц.Кладовщик, ДанныеПечати.Дата);
		
		Если Кладовщик.Количество() > 0 Тогда 	
			СтруктураПараметров.Вставить("ФИОКладовщика", ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(Кладовщик[0].Сотрудник)));
			СтруктураПараметров.Вставить("ДолжностьКладовщика", ФормированиеПечатныхФорм.ПредставлениеДолжностиОтветственногоЛица(Перечисления.ТипыОтветственныхЛиц.Кладовщик, ДанныеПечати.Организация, ДанныеПечати.Дата));
		КонецЕсли;
		
	КонецЕсли;
	
	ПолнаяДатаДокумента = Формат(ДанныеПечати.Дата, "ДФ=""дд ММММ гггг """"года""""""");
	ДлинаСтроки = СтрДлина(ПолнаяДатаДокумента);
	ПервыйРазделитель = Найти(ПолнаяДатаДокумента, " ");
	ВторойРазделитель = Найти(Прав(ПолнаяДатаДокумента, ДлинаСтроки - ПервыйРазделитель), " ") + ПервыйРазделитель;
	СтруктураПараметров.Вставить("ДатаОтгрузкиПередачи",
	"«" + Лев(ПолнаяДатаДокумента, ПервыйРазделитель -1 ) + "» "
	+ Сред(ПолнаяДатаДокумента, ПервыйРазделитель + 1, ВторойРазделитель - ПервыйРазделитель - 1) + " "
	+ Прав(ПолнаяДатаДокумента, ДлинаСтроки - ВторойРазделитель));
	
	КПППоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "КПП,", Ложь);
	ИННПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ИНН,", Ложь);
	
	Если ЗначениеЗаполнено(КПППоставщика) Тогда
		ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН/КПП %2/%3'"),
		СведенияОбОрганизации.ОфициальноеНаименование,
		ИННПоставщика,
		КПППоставщика);
	ИначеЕсли ЗначениеЗаполнено(ИННПоставщика) Тогда
		ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН %2'"),
		СведенияОбОрганизации.ОфициальноеНаименование,
		ИННПоставщика);
	Иначе
		ПредставлениеОрганизации = СведенияОбОрганизации.ОфициальноеНаименование;
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
	
	КПППокупателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКонтрагенте, "КПП,", Ложь);
	ИННПокупателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКонтрагенте, "ИНН,", Ложь);
	
	Если ЗначениеЗаполнено(КПППокупателя) Тогда
		ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН/КПП %2/%3'"),
		ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКонтрагенте, "ПолноеНаименование", Ложь),
		ИННПокупателя,
		КПППокупателя);
	ИначеЕсли ЗначениеЗаполнено(ИННПокупателя) Тогда
		ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН %2'"),
		ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКонтрагенте, "ПолноеНаименование", Ложь),
		ИННПокупателя);
	Иначе
		ПредставлениеКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКонтрагенте, "ПолноеНаименование", Ложь);
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ПредставлениеКонтрагента", ПредставлениеКонтрагента);
	
	Если ЗначениеЗаполнено(ДанныеПечати.ДоверенностьНомер) И ЗначениеЗаполнено(ДанныеПечати.ДоверенностьДата)
		И (ЗначениеЗаполнено(ДанныеПечати.ДоверенностьВыдана) Или ЗначениеЗаполнено(ДанныеПечати.ДоверенностьЛицо)) Тогда
		
		ТекстОснования = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'по доверенности №%1 от %2, выданной %3 %4'"),
		ДанныеПечати.ДоверенностьНомер,
		Формат(ДанныеПечати.ДоверенностьДата, "ДФ='дд ММММ гггг'"),
		ДанныеПечати.ДоверенностьВыдана,
		ДанныеПечати.ДоверенностьЛицо)
		;
		СтруктураПараметров.Вставить("Основание", ТекстОснования);
		
	КонецЕсли;
	
	ОбластьПодвала.Параметры.Заполнить(СтруктураПараметров);
	ОбластьПодвалНакладной.Параметры.Заполнить(СтруктураПараметров);
	
КонецПроцедуры

// Функция, заполняет структуру итоговые суммы.
// 
Функция СтруктураИтоговыеСуммы()
	
	Структура = Новый Структура;
	
	СтруктураРесурсовДляИтогов = СтруктураРесурсовДляИтогов();
	
	Для Каждого Элемент Из СтруктураРесурсовДляИтогов Цикл
		Структура.Вставить("Итого"+Элемент.Ключ+"НаСтранице", 0);
		Структура.Вставить("Итого"+Элемент.Ключ, 0);
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

// Процедура, заполняет реквизиты шапки универсального передаточного документа.
// 
Процедура ЗаполнитьРеквизитыШапкиУПД(ДанныеПечати, СведенияОПоставщике, СведенияОПокупателе, Макет, ТабличныйДокумент)
	
	СведенияОГрузоотправителе = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузоотправитель, ДанныеПечати.Дата); 
	
	СведенияОГрузополучателе = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузополучатель, ДанныеПечати.Дата);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
	
	ПараметрыШапки = Новый Структура;
	
	ПараметрыШапки.Вставить("Номер", ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(ДанныеПечати.Номер, ""));
	
	Если Лев(ПараметрыШапки.Номер, 1) = "И" Тогда
		ПараметрыШапки.Номер = Прав(ПараметрыШапки.Номер, СтрДлина(ПараметрыШапки.Номер)-1);
	КонецЕсли;
	
	ПараметрыШапки.Вставить("Дата", Формат(ДанныеПечати.Дата, "ДФ='дд ММММ гггг'")+ " г.");
	ПараметрыШапки.Вставить("НомерИсправления", ?(ДанныеПечати.Исправление, ДанныеПечати.НомерИсправления, "--"));
	ПараметрыШапки.Вставить("ДатаИсправления",
	?(ДанныеПечати.Исправление, Формат(ДанныеПечати.ДатаИсправления, "ДФ='дд ММММ гггг'")+ " г.", "--"));
	
	// Выводим данные о поставщике
	ПараметрыШапки.Вставить("ПредставлениеПоставщика", "Продавец: " + СведенияОПоставщике.ПолноеНаименование);
	ПараметрыШапки.Вставить("АдресПоставщика", "Адрес: "
	+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес"));
	
	КПП = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "КПП,", Ложь);
	ПараметрыШапки.Вставить("ИННПоставщика", "ИНН/КПП продавца: " 
	+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ИНН", Ложь)
	+ ?(Не ПустаяСтрока(КПП), "/" + КПП, ""));
	
	// Выводим данные грузоотправителя
	ПредставлениеГрузоотправителя = "Грузоотправитель и его адрес: ";
	
	ТолькоУслуги = ДанныеПечати.Основание.Запасы.Количество() = 0;
	Если ТолькоУслуги ИЛИ ДанныеПечати.Грузоотправитель = Неопределено Тогда
		ПредставлениеГрузоотправителя = ПредставлениеГрузоотправителя + "--";
	ИначеЕсли ДанныеПечати.Организация = ДанныеПечати.Грузоотправитель Тогда
		ПредставлениеГрузоотправителя = ПредставлениеГрузоотправителя + "он же";
	Иначе
		ПредставлениеГрузоотправителя = ПредставлениеГрузоотправителя 
		+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправителе, "ПолноеНаименование,ФактическийАдрес");
	КонецЕсли;
	
	ПараметрыШапки.Вставить("ПредставлениеГрузоотправителя", ПредставлениеГрузоотправителя);
	
	// Выводим данные грузополучателя и покупателя
	ПредставлениеГрузополучателя = "Грузополучатель и его адрес: ";
	
	Если ТолькоУслуги ИЛИ ДанныеПечати.Грузополучатель = Неопределено Тогда
		ПредставлениеГрузополучателя = ПредставлениеГрузополучателя + "--";
	Иначе
		
		Если Не ПустаяСтрока(ДанныеПечати.АдресДоставки) Тогда
			ПредставлениеГрузополучателя = ПредставлениеГрузополучателя
			+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование", Ложь)
			+ ", " + СокрЛП(ДанныеПечати.АдресДоставки);
		Иначе
			ПредставлениеГрузополучателя = ПредставлениеГрузополучателя
			+ ФормированиеПечатныхФорм.ОписаниеОрганизации(
			СведенияОГрузополучателе,
			"ПолноеНаименование,ФактическийАдрес",
			Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыШапки.Вставить("ПредставлениеГрузополучателя", ПредставлениеГрузополучателя);
	
	Если Не ПустаяСтрока(ДанныеПечати.СтрокаПоДокументу) Тогда
		ПараметрыШапки.Вставить("ПоДокументу", "К платежно-расчетному документу № " + ДанныеПечати.СтрокаПоДокументу);
	Иначе
		ПараметрыШапки.Вставить("ПоДокументу", "К платежно-расчетному документу № -- от --");
	КонецЕсли;
	
	ПараметрыШапки.Вставить("ПредставлениеПокупателя", "Покупатель: " 
	+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование", Ложь));
	ПараметрыШапки.Вставить("АдресПокупателя", "Адрес: "
	+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, ?(СведенияОПокупателе.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо, "ЮридическийАдрес", "ФактическийАдрес"), Ложь));
	
	КПП = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "КПП,", Ложь);
	ПараметрыШапки.Вставить("ИННПокупателя", "ИНН/КПП покупателя: "
	+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ИНН,", Ложь)
	+ ?(Не ПустаяСтрока(КПП), "/" + КПП, ""));
	
	ПараметрыШапки.Вставить("Валюта", НСтр("ru='Валюта: наименование, код Российский рубль, 643'"));
	
	ОбластьМакета.Параметры.Заполнить(ПараметрыШапки);
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры

// Формирует временную таблицу, содержащую табличную часть по таблице данных документов.
// 
// Параметры:
//   МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц, содержащий таблицу
//                                                       ТаблицаДанныхДокументов с полями: Ссылка.
// 
Процедура ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, МассивДокументов) Экспорт
  
  Запрос = Новый Запрос;
  Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
  
  Запрос.Текст = 
  "ВЫБРАТЬ
  |  ВложенныйЗапрос.Ссылка,
  |  ВложенныйЗапрос.НомерСтроки,
  |  ВложенныйЗапрос.Номенклатура,
  |  ВложенныйЗапрос.Партия КАК Характеристика,
  |  ВложенныйЗапрос.Количество,
  |  ВложенныйЗапрос.Упаковка,
  |  ВложенныйЗапрос.КоличествоУпаковок,
  |  ВложенныйЗапрос.Цена,
  |  ВложенныйЗапрос.Сумма,
  |  ВложенныйЗапрос.СтавкаНДС,
  |  ВложенныйЗапрос.СуммаНДС,
  |  ДанныеДокументов.ЦенаВключаетНДС,
  |  ВЫБОР
  |    КОГДА ВложенныйЗапрос.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
  |      ТОГДА ИСТИНА
  |    ИНАЧЕ ЛОЖЬ
  |  КОНЕЦ КАК ЭтоТовар
  |ПОМЕСТИТЬ ТаблицаТоваров
  |ИЗ
  |  (ВЫБРАТЬ
  |    РеализацияЗапасы.Ссылка КАК Ссылка,
  |    РеализацияЗапасы.НомерСтроки КАК НомерСтроки,
  |    РеализацияЗапасы.Номенклатура КАК Номенклатура,
  |    РеализацияЗапасы.Упаковка КАК Упаковка,
  |    РеализацияЗапасы.Количество КАК Количество,
  |    РеализацияЗапасы.КоличествоУпаковок КАК КоличествоУпаковок,
  |    РеализацияЗапасы.Цена КАК Цена,
  |    РеализацияЗапасы.Партия КАК Партия,
  |    РеализацияЗапасы.Сумма КАК Сумма,
  |    РеализацияЗапасы.СтавкаНДС КАК СтавкаНДС,
  |    РеализацияЗапасы.СуммаНДС КАК СуммаНДС
  |  ИЗ
  |    Документ.Реализация.Запасы КАК РеализацияЗапасы
  |  ГДЕ
  |    РеализацияЗапасы.Ссылка В(&МассивДокументов)
  |  
  |  ОБЪЕДИНИТЬ ВСЕ
  |  
  |  ВЫБРАТЬ
  |    РеализацияУслуги.Ссылка,
  |    РеализацияУслуги.НомерСтроки,
  |    РеализацияУслуги.Номенклатура,
  |    РеализацияУслуги.Упаковка,
  |    РеализацияУслуги.Количество,
  |    РеализацияУслуги.КоличествоУпаковок,
  |    РеализацияУслуги.Цена,
  |    РеализацияУслуги.Партия,
  |    РеализацияУслуги.Сумма,
  |    РеализацияУслуги.СтавкаНДС,
  |    РеализацияУслуги.СуммаНДС
  |  ИЗ
  |    Документ.Реализация.Услуги КАК РеализацияУслуги
  |  ГДЕ
  |    РеализацияУслуги.Ссылка В(&МассивДокументов)) КАК ВложенныйЗапрос
  |    ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеДокументов
  |    ПО ВложенныйЗапрос.Ссылка = ДанныеДокументов.Ссылка";
  
  Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
    
  Запрос.Выполнить();
  
КонецПроцедуры

// Функция преобразует строку к множественному числу.
// 
// Параметры: 
//  Слово1 - форма слова в ед числе      ("шкаф").
//  Слово2 - форма слова для числит 2-4  ("шкафа").
//  Слово3 - форма слова для числит 5-10 ("шкафов").
//  ЦелоеЧисло - целое число.
// 
// Возвращаемое значение:
//  строку - одну из строк в зависимости от параметра ЦелоеЧисло
// 
// Описание:
//  Предназначена для формирования "правильной" подписи к числительным
// 
Функция ФормаМножественногоЧисла(Слово1, Слово2, Слово3, Знач ЦелоеЧисло) Экспорт
	
	// Изменим знак целого числа, иначе отрицательные числа будут неправильно преобразовываться
	Если ЦелоеЧисло < 0 Тогда
		ЦелоеЧисло = -1 * ЦелоеЧисло;
	КонецЕсли;
	
	Если ЦелоеЧисло <> Цел(ЦелоеЧисло) Тогда 
		// Для нецелых чисел - всегда вторая форма
		Возврат Слово2;
	КонецЕсли;
	
	// остаток
	Остаток = ЦелоеЧисло%10;
	Если (ЦелоеЧисло >10) И (ЦелоеЧисло<20) Тогда
		// Для второго десятка - всегда третья форма
		Возврат Слово3;
	ИначеЕсли Остаток=1 Тогда
		Возврат Слово1;
	ИначеЕсли (Остаток>1) И (Остаток<5) Тогда
		Возврат Слово2;
	Иначе
		Возврат Слово3;
	КонецЕсли;
	
КонецФункции


#КонецОбласти

#КонецОбласти

#КонецЕсли
