
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("Сделка") 
		И ДанныеЗаполнения.Свойство("Номенклатура") Тогда 
		
		ЭтотОбъект.Запасы.Очистить();
		
		НоваяСтрока                    		= Запасы.Добавить();
		НоваяСтрока.КлючСтроки         		= Новый УникальныйИдентификатор;
		НоваяСтрока.Номенклатура       		= ДанныеЗаполнения.Номенклатура;
		// НоваяСтрока.Продавец           		= АвторДокумента;
		// НоваяСтрока.Сотрудник          		= НоваяСтрока.Сотрудник;
		НоваяСтрока.ВидЦен             		= ЭтотОбъект.ВидЦен;
		НоваяСтрока.КоличествоУпаковок 		= 1;
		НоваяСтрока.Количество         		= НоваяСтрока.КоличествоУпаковок;
		
		СтруктураДанные = Новый Структура();
		СтруктураДанные.Вставить("ДатаОбработки"     , ТекущаяДатаСеанса());
		СтруктураДанные.Вставить("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
		СтруктураДанные.Вставить("ВидЦен"            , НоваяСтрока.ВидЦен);	
		СтруктураДанные.Вставить("Номенклатура"      , НоваяСтрока.Номенклатура);
		СтруктураДанные.Вставить("Упаковка"          , НоваяСтрока.Упаковка);
		
		СтруктураДанные       = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);			
		НоваяСтрока.Цена      = СтруктураДанные.Цена;
		НоваяСтрока.СтавкаНДС = ДанныеЗаполнения.Номенклатура.СтавкаНДС; // почему берется не из СтруктураДанные (Ставка НДС расчитывается в ПолучитьДанныеНоменклатураПриИзменении)
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	
	СуммаОплачено	= 0;
	НомерЧекаККМ	= 0;
	Договор 		= Неопределено;
	
	Для Каждого СтрокаЗапасы из Запасы Цикл  // при копировании нужно найти все ключи связи и обновить их		
		// запомним исходный ключ
		КлючСтокиДельта = СтрокаЗапасы.КлючСтроки; 
		
		// назначим новый ключ
		СтрокаЗапасы.КлючСтроки = Новый УникальныйИдентификатор; 
		
		// найдем старый ключ во всех табличных частях и обновим его
		СтруктураПоиска = Новый Структура("КлючСтроки", КлючСтокиДельта); 
		
		// 1. Таблица "СерийныеНомераСертификатов"
		МассивСерийныеНомера = СерийныеНомераСертификатов.НайтиСтроки(СтруктураПоиска);  
		Для каждого МассивСтрСН из МассивСерийныеНомера Цикл
			МассивСтрСН.КлючСтроки = СтрокаЗапасы.КлючСтроки;
		КонецЦикла;  		
			
		//// 2. Таблица "Материалы"
		// МассивМатериалы = Материалы.НайтиСтроки(СтруктураПоиска);  
		// Для каждого МассивСтрМатериалы из МассивМатериалы Цикл
		//	МассивСтрМатериалы.КлючСтроки = СтрокаЗапасы.КлючСтроки;
		// КонецЦикла;
		
		// 3. Таблица "СкидкиНаценки"
		МассивСкидкиНаценки = СкидкиНаценки.НайтиСтроки(СтруктураПоиска);  
		Для каждого МассивСтрСкидкиНаценки из МассивСкидкиНаценки Цикл
			МассивСтрСкидкиНаценки.КлючСтроки = СтрокаЗапасы.КлючСтроки;
		КонецЦикла;  		
		
	КонецЦикла;
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	                       
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью" объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Создаем или подхватываем бонусный счет
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		УправлениеМаркетинговымиАкциями.УстановитьБонусныйСчетНачисленияВСкидках(
				ЭтотОбъект, 
				"СкидкиНаценки",
				Контрагент, 
				КартаКонтрагента,
				Отказ);
	КонецЕсли;	
	
	ОбработкаПроверкиЗаполненияРаботаССертификатами(Отказ);
	
	ОбновитьСделкуВПродаже();
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаПроверкиЗаполнения".
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка табличной части на разрешения по значениям 
	Если ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьНулевуюСумму, Ложь) Тогда
		УдаляемыйЭлемент = ПроверяемыеРеквизиты.Найти("Запасы.Сумма");
		Если УдаляемыйЭлемент <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(УдаляемыйЭлемент);
		КонецЕсли;
	КонецЕсли;
	
	// Проверка табличной части на разрешения по значениям 
	Если ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьНулевуюСумму, Ложь) Тогда
		УдаляемыйЭлемент = ПроверяемыеРеквизиты.Найти("Услуги.Сумма");
		Если УдаляемыйЭлемент <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(УдаляемыйЭлемент);
		КонецЕсли;
	КонецЕсли;

	// Определяем вид налога если он не заполнен, для старых документов.	
	Если Запасы.Количество() > 0 Тогда
		ВидНалога    = Справочники.Номенклатура.ПолучитьВидНалогаНоменклатуры(Запасы[0].Номенклатура, СтруктурнаяЕдиница); 
		Номенклатура = Запасы[0].Номенклатура;
	ИначеЕсли Услуги.Количество() > 0 Тогда
		ВидНалога    = Справочники.Номенклатура.ПолучитьВидНалогаНоменклатуры(Услуги[0].Номенклатура, СтруктурнаяЕдиница); 
		Номенклатура = Услуги[0].Номенклатура;
	Иначе
		Возврат;
	КонецЕсли;
	
	ЕстьРазличия = Ложь;
	Для Каждого СтрокаТЧ из Запасы Цикл
		Если НЕ Справочники.Номенклатура.ПолучитьВидНалогаНоменклатуры(СтрокаТЧ.Номенклатура, СтруктурнаяЕдиница) = ВидНалога Тогда
			ЕстьРазличия = Истина;	
			мНоменклатура = СтрокаТЧ.Номенклатура;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьРазличия Тогда
		Для Каждого СтрокаТЧ из Услуги Цикл
			Если НЕ Справочники.Номенклатура.ПолучитьВидНалогаНоменклатуры(СтрокаТЧ.Номенклатура, СтруктурнаяЕдиница) = ВидНалога Тогда
				ЕстьРазличия = Истина;
				мНоменклатура = СтрокаТЧ.Номенклатура;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЕстьРазличия Тогда
		Отказ = Истина;
		ТекстСообщения = "В одном документе, пробиваемом в ККТ с передачей данных, может пробиваться номенклатура, использующая один режим налогообложения. Номенклатура '%1' и '%2' используют разные режимы налогообложения";
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Номенклатура, мНоменклатура);	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);		
	КонецЕсли;	   	
	
	// Проверка на "Бесплатно".
	Для Каждого СтрокаТЧ из Запасы Цикл
		Бесплатность = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТЧ.Номенклатура, "Бесплатно");
		НомерСтр = СтрокаТЧ.НомерСтроки;
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Сумма) И (Бесплатность = Истина ИЛИ СтрокаТЧ.ПроцентСкидкиНаценки = 100) Тогда   			
			УдаляемыйЭлемент = ПроверяемыеРеквизиты.Найти("Запасы.Сумма");
			Если УдаляемыйЭлемент <> Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(УдаляемыйЭлемент);
			КонецЕсли;	
		Иначе 
			Если Не ЗначениеЗаполнено(СтрокаТЧ.Сумма) И (Бесплатность = Ложь ИЛИ СтрокаТЧ.ПроцентСкидкиНаценки < 100) Тогда   						
				// ТекстСообщения = ""+ТекстСообщения + "Не заполнена колонка 'Сумма' в строке "+ НомерСтр + " списка 'Запасы'" + Символы.ПС;		  	  				
				ТекстСообщения = "Не заполнена колонка 'Сумма' в строке "+ НомерСтр + " списка 'Запасы'" + Символы.ПС;		  	  				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, Режим)

	// Инициализация дополнительных свойств для проведения документа.
	ДвиженияДокументовСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);	
	
	// Запись номинала серии сертификата в элемент справочника "ПартииНоменклатуры".
	Документы.Реализация.ЗаписатьНоминалСертификатаПриПродаже(Ссылка);
	
    // Инициализация данных документа.	
	Документы.Реализация.УстановитьНачальныеДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	
	ДополнительныеСвойства.ДляПроведения.Вставить("ВыполнятьДвиженияСебестоимость", Истина);
	
	ТаблицаСписанияНоменклатуры = Ссылка.Запасы.ВыгрузитьКолонки();
	ОбщегоНазначенияКлиентСерверСтоматология.ЗагрузитьВТаблицуЗначений(Ссылка.Запасы, ТаблицаСписанияНоменклатуры);
	ОбщегоНазначенияКлиентСерверСтоматология.ЗагрузитьВТаблицуЗначений(Ссылка.Подарки, ТаблицаСписанияНоменклатуры);
	УправлениеЗапасамиПартионныйУчет.СформироватьСписаниеТаблицаПартииТоваров(ТаблицаСписанияНоменклатуры, ДополнительныеСвойства, Движения, Отказ);
	
	КонтрольСертификатов(Отказ);
	
	// Движения по регистрам
	ДвиженияДокументовСервер.ЗапасыНаСкладах(ДополнительныеСвойства, Движения, Отказ);   	
	ДвиженияДокументовСервер.ВзаиморасчетыСКонтрагентами(ДополнительныеСвойства, Движения, Отказ);
    ДвиженияДокументовСервер.ПартииТоваров(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.ПродажиСебестоимость(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.Продажи(ДополнительныеСвойства, Движения, Отказ);
//	ДвиженияДокументовСервер.ДенежныеСредстваНаЛицевыхСчетах(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.Сертификаты(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.ОборотыПредоставленныеСкидки(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.БонусныеСчета(ДополнительныеСвойства, Движения, Отказ);
	ТаблицаУправленческийДобавитьДвиженияПоПартиям(ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий
	                                              ,ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПартииТоваров);
	ДвиженияДокументовСервер.Управленческий(ДополнительныеСвойства, Движения, Отказ);
	
    // Запись наборов записей.
	ДвиженияДокументовСервер.ДобавитьНаборыЗаписей(ЭтотОбъект);	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура проверяет заполнение сертификатов.
//
Процедура ОбработкаПроверкиЗаполненияРаботаССертификатами(Отказ)
	
	Для Каждого СтрокаЗапасы Из Запасы Цикл				
		Если СтрокаЗапасы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат
		   И СтрокаЗапасы.Номенклатура.ИспользоватьПартии
		   И СтрокаЗапасы.Партия.Пустая() Тогда	
		   
		   Отказ = Истина;
		   ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке № " + СтрокаЗапасы.НомерСтроки + " табличной части " + """" + "Запасы" + """" + " не заполнено поле " + """"+ "Характеристика, серия" + """");
		КонецЕсли; 		
	КонецЦикла;   
	
	Для Каждого СтрокаПодарки Из Подарки Цикл	
		
		Если НЕ СтрокаПодарки.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		РеквизитыНоменклатуры = ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(
									СтрокаПодарки.Номенклатура, 
									"ТипНоменклатуры, ВидНоминала, ИспользоватьПартии");  
		
		 Если РеквизитыНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат
			И РеквизитыНоменклатуры.ВидНоминала = Истина // определяется при продаже.
			И СтрокаПодарки.СуммаПодарочногоСертификата = 0 Тогда	
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru='В строке № %1 табличной части ""Подарки"" не указана сумма подарочного сертификата.';en='In line № %1 of the tabular parts ""Presents"" the indicated amount of gift certificate.'"), СтрокаПодарки.НомерСтроки));			
			Отказ = Истина;  			
		КонецЕсли;     	
		
		Если РеквизитыНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат
		   И РеквизитыНоменклатуры.ИспользоватьПартии
		   И НЕ ЗначениеЗаполнено(СтрокаПодарки.Партия) Тогда	
		   
		   ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru='В строке № %1 табличной части ""Подарки"" не заполнено поле Характеристика/серия.';en='In line № %1 of the tabular parts ""Presents"" the indicated amount of gift certificate.'"), СтрокаПодарки.НомерСтроки));
   		   Отказ = Истина;
		КонецЕсли; 		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура выполняет проверку наличия свободных серийных номеров
//
Процедура КонтрольСертификатов(Отказ)
	
  Запрос = Новый Запрос("ВЫБРАТЬ   РАЗРЕШЕННЫЕ
                        |	СерийныеНомераСертификатов.Номенклатура,
                        |	СерийныеНомераСертификатов.СерийныйНомер,
                        |	СерийныеНомераСертификатов.ВидДвиженияСертификата,
                        |	СерийныеНомераСертификатов.Реализован,
                        |	СерийныеНомераСертификатов.Погашен
                        |ИЗ
                        |	РегистрСведений.СерийныеНомераСертификатов КАК СерийныеНомераСертификатов
                        |ГДЕ
                        |	СерийныеНомераСертификатов.Регистратор <> &Регистратор
                        |	И СерийныеНомераСертификатов.СерийныйНомер В(&СписокНомеров)");
						
  Запрос.УстановитьПараметр("Регистратор"  ,Ссылка);
  Запрос.УстановитьПараметр("СписокНомеров",СерийныеНомераСертификатов.ВыгрузитьКолонку("СерийныйНомер")); 
  Результат = Запрос.Выполнить().Выгрузить();
  
  Если Результат.Количество() > 0 Тогда
	  
	  Отказ = Истина;
	  Для Каждого Строка из Результат Цикл		  
		  ТекстСообщения = ""+ТекстСообщения + "серийный номер "+Строка.СерийныйНомер+" номенклатуры "+Строка.Номенклатура +" уже был продан"+ Символы.ПС;		  
	  КонецЦикла;
	  
	  ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);	  
  КонецЕсли;
	
КонецПроцедуры

// Процедура добавляет необходимы движения по партиям 
// в таблицу движений регистра управленческий
Процедура ТаблицаУправленческийДобавитьДвиженияПоПартиям(ТаблицаУправленческий, ТаблицаПартии)	
	Для Каждого СтрокаТ ИЗ ТаблицаПартии Цикл
		НоваяСтрока                    = ТаблицаУправленческий.Добавить();
		НоваяСтрока.НомерСтроки        = ТаблицаУправленческий.Количество();
		НоваяСтрока.Период             = ЭтотОбъект.Дата;
		НоваяСтрока.СтруктурнаяЕдиница = ЭтотОбъект.СтруктурнаяЕдиница;
		НоваяСтрока.СчетДт             = ПланыСчетов.Управленческий.РасходыСебестоимость;
		НоваяСтрока.СчетКт             = ПланыСчетов.Управленческий.Запасы;
        НоваяСтрока.СубконтоДт1        = СтрокаТ.Номенклатура.Специализация;
		НоваяСтрока.СубконтоДт2        = ЭтотОбъект.Контрагент;
		НоваяСтрока.СубконтоДт3        = ЭтотОбъект.Сотрудник;
		НоваяСтрока.СубконтоДт4        = Справочники.СтатьиДоходовИРасходов.СебестоимостьТоваров;
		НоваяСтрока.СубконтоКт1        = СтрокаТ.Номенклатура;
		НоваяСтрока.СубконтоКт2        = СтрокаТ.Склад;
        НоваяСтрока.Сумма              = СтрокаТ.Стоимость;
	    НоваяСтрока.Количество         = СтрокаТ.Количество;
		НоваяСтрока.Содержание         = "Реализация(Запасы)";
	КонецЦикла;		
КонецПроцедуры

// Процедура - Обновить сделку в продаже
//
Процедура ОбновитьСделкуВПродаже()
	
	// Если ЗначениеЗаполнено(ЭтотОбъект.Сделка) ИЛИ НЕ ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда 
	//	Возврат;
	// КонецЕсли;
	//
	// Если НЕ ПривилегированныйРежим() Тогда 
	//	УстановитьПривилегированныйРежим(Истина);
	// КонецЕсли;
	//
	// Запрос = Новый Запрос;
	// Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//               |	Сделки.Ссылка КАК Сделка
	//               |ИЗ
	//               |	Справочник.Сделки КАК Сделки
	//               |ГДЕ
	//               |	Сделки.ПометкаУдаления = ЛОЖЬ
	//               |	И Сделки.Реализация = &Реализация
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	Сделки.ДатаЗавершенияСделки УБЫВ";
	//
	// Запрос.УстановитьПараметр("Реализация", ЭтотОбъект.Ссылка);
	//
	// ВыборкаСделка = Запрос.Выполнить().Выбрать();
	//
	// Если ВыборкаСделка.Следующий() Тогда 
	//	ЭтотОбъект.Сделка = ВыборкаСделка.Сделка;
	// КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти
