
////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ СЛК
//
////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает все серии ключей защиты с которыми может работать конфигурация
//
Функция ПолучитьИспользуемыеСерииКлючей() Экспорт
	
	МассивСерий = Новый Массив; 	
	МассивСерий.Добавить("4FB1"); // для 1С:Медицины
	МассивСерий.Добавить("C24C"); // для Поликлиники (при упаковке передвинуть выше 4fb1)	
	МассивСерий.Добавить("5415"); // для старых клиентов Хеликс
	
	Возврат МассивСерий;

КонецФункции

// Тип контроля лицензий
Функция ТолькоНаличиеКлюча() Экспорт
	// Если проверяем только наличие ключа, без ограничения 
	// доступа по количеству лицензий
	
	//Возврат Истина; 
	
	Возврат Ложь;
КонецФункции

// Подключение компоненты СЛК.
//
Процедура ПодключитьКомпоненту() Экспорт
	
	Если НЕ ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаСЛК", "Licence") Тогда
		СисИнфо = Новый СистемнаяИнформация;
		ВызватьИсключение "Ошибка подключения компоненты СЛК " + СисИнфо.ТипПлатформы;
	КонецЕсли;
	
КонецПроцедуры

// Получение менеджера защищенных объектов СЛК
//
Функция МенеджерОбъектов(Серия = Неопределено, Режим = Ложь) Экспорт
	
	ПараметрыСвязи = Константы.ПараметрыСоединенияСЛК.Получить();
	ПараметрыСвязи = ?(СокрЛП(ПараметрыСвязи) = "", "host=localhost", ПараметрыСвязи);
	
	Если Серия = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Серия) Тогда
		Серия = Константы.ИспользуемаяСерияКлючей.Получить();	// Получаем серию, с которой предыдущий раз всё работало
		Если НЕ ЗначениеЗаполнено(Серия) Тогда
			Серия = ПолучитьИспользуемыеСерииКлючей()[0];	// Используем ту серию, которая первой указана для данной конфигурации
		КонецЕсли;
	КонецЕсли;
	
	// Для оптимизации получаем менеджер объектов из специального модуля, у которого
	// установлен режим повторного использования возращаемых объектов "на время сеанса" 
	//
	Возврат ЗащитаПовтИсп.Получить(Серия, ПараметрыСвязи);

КонецФункции

// Возврат версии компоненты СЛК
//
Функция Версия(ДобавлятьТипПлатформы = Истина) Экспорт
	ПодключитьКомпоненту();
	СисИнфо = Новый СистемнаяИнформация;
	МенеджерЛицензий = Новый("AddIn.Licence.LicenceExtension20");
	Возврат МенеджерЛицензий.Версия + ?(ДобавлятьТипПлатформы, " (" + СисИнфо.ТипПлатформы + ")", "");
КонецФункции

// Проверка версии компоненты СЛК
Функция ПроверитьВерсию(Версия) Экспорт
	
	ПодключитьКомпоненту();
	МенеджерЛицензий = Новый("AddIn.Licence.LicenceExtension20");
	
	Попытка
		Возврат МенеджерЛицензий.ПроверитьВерсию(Версия);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

// Информация о текущем сеансе работы
//
Функция ДанныеСеанса() Экспорт
	НомерСеанса = НомерСеансаИнформационнойБазы();
	
	Сеансы = ПолучитьСеансыИнформационнойБазы();
	Для Каждого С Из Сеансы Цикл
		Если С.НомерСеанса = НомерСеанса Тогда
			Сеанс = С;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Строка(Сеанс.НомерСеанса) + "," + Сеанс.ИмяКомпьютера + "," + Сеанс.ИмяПриложения + "," + Сеанс.Пользователь;
КонецФункции

// Запуск СЛК
Функция  Запуск() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Сначала проверяем для сохраненной серии (той, с которой в последний раз все работало)
	ПоследняяИспользуемаяСерия = Константы.ИспользуемаяСерияКлючей.Получить();
	СтруктураРезультата = ПроверитьЛицензию(ПоследняяИспользуемаяСерия);
	
	Если СтруктураРезультата.РезультатПроверки Тогда
		Возврат СтруктураРезультата;
	Иначе
		
		МассивСерий = ПолучитьИспользуемыеСерииКлючей();
		Для Каждого Серия Из МассивСерий Цикл
			Если Серия <> ПоследняяИспользуемаяСерия Тогда
				
				СтруктураРезультата = ПроверитьЛицензию(Серия);
				
				Если СтруктураРезультата.РезультатПроверки
					ИЛИ ЗащитаКлиентСервер.ЭтоОшибкаОНесоответствииВерсий(СтруктураРезультата) Тогда
					// Выходим, возвращая структуру результата родителю, если проверка на какой-то из серий прошла успешно.
					// Также выходим, если словили ошибку о несоответствии версий между сервером СЛК и внешней компонентой,
					// т.к. ошибка будет при любой серии.
					Возврат СтруктураРезультата;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Загрузка данных из общего макета
	//Менеджер.ЗагрузитьИзОбщегоМакета(Метаданные.ОбщиеМакеты.ДанныеСЛК);
	
	// Возможна загрузка как по объекту описания метаданных, так и по имени макета:
	//Менеджер.ЗагрузитьИзОбщегоМакета("ДанныеСЛК");
	
	Возврат СтруктураРезультата;
		
КонецФункции

// Проверка лицензии сеанса
//
Функция ПроверитьЛицензию(Серия = Неопределено) Экспорт
	
	Попытка
		
		МенеджерОбъектов(Серия).ПроверитьЛицензиюСеанса(ТолькоНаличиеКлюча());
		
		ТекстПредупреждения = "Проверка лицензии выполнена успешно!";
		Результат = Истина;
		
		// Сохраняем серию, для того чтобы в след. раз начать проверку именно с нее
		Константы.ИспользуемаяСерияКлючей.Установить(Серия);
		
	Исключение
		
		Результат = Ложь;
		ТекстПредупреждения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстПредупреждения = ?(ТекстПредупреждения = "", "Ключ серии " + Серия + " не найден.", ТекстПредупреждения);
		
	КонецПопытки;
	
	Возврат Новый Структура("РезультатПроверки, Серия, ТекстПредупреждения", Результат, Серия, ТекстПредупреждения);
	
КонецФункции

// Завершение работы СЛК
Процедура Стоп() Экспорт
	ЭтоКлиентСервернаяБаза = Не Найти(ВРег(СтрокаСоединенияИнформационнойБазы()), "FILE=");
	Если ЭтоКлиентСервернаяБаза Тогда
		Попытка
			МенеджерОбъектов().ОсвободитьЛицензиюСеанса();
		Исключение
			//
		КонецПопытки
	КонецЕсли;
КонецПроцедуры

// Отладочная информация
Функция ПолучитьОтладочнуюСтроку() Экспорт
	Возврат МенеджерОбъектов().ПолучитьОтладочнуюСтроку();
КонецФункции

// Создание объекта по его имени в файле данных
//
Функция СоздатьОбъект(Имя) Экспорт
	
	// Получение объекта помещено в модуль, у которого
	// установлен режим повторного использования возращаемых объектов "на время сеанса" 
	// (аналогично получению менеджера объектов).
	Возврат ЗащитаПовтИсп.СоздатьОбъект(Имя);
	
КонецФункции

//  Получение значений лицензионных параметров
// 
Функция ПолучитьЗначениеПараметра(Имя) Экспорт
	Возврат МенеджерОбъектов().ПолучитьЗначениеПараметра(Имя);
КонецФункции

// Чтение памяти ключа защиты
Функция ПрочитатьПамятьКлюча(Пароль) Экспорт
	Возврат МенеджерОбъектов().ПрочитатьПамятьКлюча(Пароль);
КонецФункции

// Запись памяти ключа защиты
Процедура ЗаписатьПамятьКлюча(Пароль, Данные) Экспорт
	МенеджерОбъектов().ЗаписатьПамятьКлюча(Пароль, Данные);
КонецПроцедуры

// Установка паролей на память ключа
Процедура УстановитьПаролиНаПамятьКлюча(НаЧтениеСтарый, НаЗаписьСтарый, НаЧтениеНовый, НаЗаписьНовый) Экспорт
	МенеджерОбъектов().УстановитьПаролиНаПамятьКлюча(НаЧтениеСтарый, НаЗаписьСтарый, НаЧтениеНовый, НаЗаписьНовый);
КонецПроцедуры

// Обнуление памяти ключа защиты и сброс паролей
Процедура ОбнулитьПамятьКлюча() Экспорт
	МенеджерОбъектов().ОбнулитьПамятьКлюча();
КонецПроцедуры

// Получение списка ключей на сервере СЛК
Функция ПолучитьСписокКлючей() Экспорт
	Возврат МенеджерОбъектов().ПолучитьСписокКлючей();
КонецФункции

// Получение общего количество лицензий на сервере СЛК
Функция ПолучитьОбщееКоличествоЛицензий(Тип = 0) Экспорт
	Возврат МенеджерОбъектов().ПолучитьОбщееКоличествоЛицензий(Тип);
КонецФункции

// Получение номера ключа, лицензию которого занял сеанс
Функция ПолучитьНомерКлюча() Экспорт
	Возврат МенеджерОбъектов().ПолучитьНомерКлюча();
КонецФункции

// Проверка лицензии сеанса
Процедура ПроверитьЛицензиюРегламентноеЗадание() Экспорт
	
	Если НЕ ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ПроверкаЛицензииСеанса);	
	
	Если Не ОбщегоНазначения.ИнформационнаяБазаФайловая() И Метаданные.ОбщиеМодули.Найти("Helix") = Неопределено Тогда 
		ПроверитьЛицензию();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
