
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура - При определении настроек отчета
//
// Параметры:
//  НастройкиОтчета		 - 	 - 
//  НастройкиВариантов	 - 	 - 
//
Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиВариантов["СУчетомПартий"].Рекомендуемый    = Истина;
	НастройкиВариантов["БезУчетаПартий"].Рекомендуемый    = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли