
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработкиСтоматология.ПриСозданииНаСервере(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктурнаяЕдиницаОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтруктурнаяЕдиницаОтбор, ЗначениеЗаполнено(СтруктурнаяЕдиницаОтбор));
	
КонецПроцедуры

#КонецОбласти
