
#Область СлужебныйПрограммныйИнтерфейс

// Интерфейсная клиентская функция поддерживающая упрощенный вызов формы редактирования
// нового письма.
// Параметры
// Отправитель*  - СписокЗначений, СправочникСсылка.УчетныеЗаписиЭлектроннойПочты - 
//                 учетная запись (список) с которой[ых] может быть отправленно
//                 почтовое сообщение. Если тип список значений, тогда
//                   представление - наименование учетной записи,
//                   значение - ссылка на учетную запись
//
// Получатель      - СписокЗначений, Строка:
//                   если список значений, то представление - имя получателя
//                                            значение      - почтовый адрес
//                   если строка то список почтовых адресов,
//                   в формате правильного e-mail адреса*
//
// Тема            - Строка - тема письма
// Текст           - Строка - тело письма
//
// СписокФайлов    - СписокЗначений, где
//                   представление - строка - наименование вложения
//                   значение      - ДвоичныеДанные - двоичные данные вложения
//                                 - Строка - адрес файла во временном хранилище
//                                 - Строка - путь к файлу на клиенте
//
// УдалятьФайлыПослеОтправки - булево - удалять временные файлы после отправки сообщения
//
Процедура ОткрытьФормуОтправкиПочтовогоСообщения(знач Отправитель = Неопределено,
                                                 Получатель = Неопределено,
                                                 Тема = "",
                                                 Текст = "",
                                                 СписокФайлов = Неопределено,
                                                 УдалятьФайлыПослеОтправки = Ложь) Экспорт
	
	ПараметрыПисьма = Новый Структура;
	
	ПараметрыПисьма.Вставить("УчетнаяЗапись", Отправитель);
	ПараметрыПисьма.Вставить("Кому", Получатель);
	ПараметрыПисьма.Вставить("Тема", Тема);
	ПараметрыПисьма.Вставить("Тело", Текст);
	ПараметрыПисьма.Вставить("Вложения", СписокФайлов);
	ПараметрыПисьма.Вставить("УдалятьФайлыПослеОтправки", УдалятьФайлыПослеОтправки);
	
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаДокумента", ПараметрыПисьма);
	
КонецПроцедуры

// Процедура, открывает вложение
//
Процедура ОткрытьВложение(Ссылка) Экспорт

	РаботаСФайламиКлиент.ОткрытьФайл(РаботаСФайламиВызовСервера.ПолучитьДанныеФайлаДляОткрытия(Ссылка));

КонецПроцедуры

// Процедура, сохраняет вложение
//
Процедура СохранитьВложение(Ссылка) Экспорт

	//ДанныеДокумента = РаботаСФайламиВызовСервера.ПолучитьДанныеФайла(Ссылка); // Ошибка 1С ?
	ДанныеДокумента = РаботаСФайламиВызовСервера.ПолучитьДанныеФайлаДляСохранения(Ссылка);
	Если Не ДанныеДокумента.Версия.Пустая() Тогда
		РаботаСФайламиКлиент.СохранитьФайлКак(ДанныеДокумента);	
	КонецЕсли;
			
КонецПроцедуры

// Функция, возвращает таблицу контактов массивом.
//
Функция ТаблицуКонтактовВМассив(ТаблицаКонтактов) Экспорт
	
	Если ТаблицаКонтактов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Массив;
	Для Каждого Стр Из ТаблицаКонтактов Цикл
		Контакт = Новый Структура;
		Контакт.Вставить("Адрес", Стр.Адрес);
		Контакт.Вставить("Представление", Стр.Представление);
		Контакт.Вставить("Контакт", Стр.Контакт);

		Результат.Добавить(Контакт);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Выполнить получение почты по всем доступным учетным записям
//
Процедура ЗагрузитьПочтуПользователя(ЭлементСписок = Неопределено) Экспорт

	ПолученоПисем = 0;
	ДоступноУчетныхЗаписей = 0;
	масОшибок = Новый Массив;
	
	Состояние(НСтр("ru = 'Идет получение электронной почты ...'"));
	УправлениеЭлектроннойПочтой.ЗагрузитьПочтуПользователя(ПолученоПисем, ДоступноУчетныхЗаписей, масОшибок);
	Состояние("");
	
	Стр = НСтр("ru = 'Получено писем:'") + " " + ПолученоПисем;
	Если ДоступноУчетныхЗаписей > 1 Тогда
		Стр = Стр + " " + НСтр("ru = '(учетных записей:'") + " " + ДоступноУчетныхЗаписей + ")";
	КонецЕсли;
	
	Если масОшибок.Количество() > 0 Тогда
		Стр = Стр + Символы.ПС;
		Для Каждого Ошибка Из масОшибок Цикл
			Стр = Стр + Символы.ПС + Ошибка;
		КонецЦикла;
	КонецЕсли;
	
	Если ЭлементСписок <> Неопределено Тогда
		ЭлементСписок.Обновить();
	КонецЕсли;
	
	ПоказатьПредупреждение(,Стр);
	
КонецПроцедуры

// Функция, возвращает представление по адресу.
//
Функция ПолучитьПолноеПредставлениеПоАдресуИПредставлению(Адрес, Представление) Экспорт
	
	Если ПустаяСтрока(Представление) Тогда
		Возврат Адрес;
	ИначеЕсли ПустаяСтрока(Адрес) Тогда
		Возврат Представление;
	Иначе
		Возврат Представление + " <" + Адрес + ">";
	КонецЕсли;
	
КонецФункции

#КонецОбласти
