#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ДатаРегистрации = ТекущаяДата();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Код) Тогда
		Код = Справочники.МедицинскиеКарты.СгенерироватьКодМедКарты(ВидМедицинскойКарты.ДлинаНомера, ВидМедицинскойКарты.Префикс, ВидМедицинскойКарты.Суффикс);
	Иначе
		Если Справочники.МедицинскиеКарты.НомерМедКартСуществует(Код, Ссылка) Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Медицинская карта с указанным номером существует!" + Символы.ПС + "Введите другой номер!";
			Сообщение.Поле = "Объект.Код";
			Сообщение.УстановитьДанные(Ссылка);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(КодБезНулей) Тогда
		
		КодБезНулей = ФормированиеПечатныхФорм.УдалитьЛидирующиеНулиИзНомераОбъекта(Код);
		                          
	КонецЕсли;
	
	Наименование = "Карта №" + КодБезНулей + ", " + ?(ДополнительныеСвойства.Свойство("ВладелецКартыНаименование"), ДополнительныеСвойства.ВладелецКартыНаименование, ВладелецКарты);
	
	Если Не ЗначениеЗаполнено(ДатаРегистрации) Тогда
		ДатаРегистрации = ТекущаяДата();
	КонецЕсли; 	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	

	Если Не ПометкаУдаления Тогда 		
		Если ЗначениеЗаполнено(Штрихкод) Тогда
			ДанныеШтрихкода = РегистрыСведений.Штрихкоды.ПолучитьДанныеПоШтрихкодам(Штрихкод);
			Если ДанныеШтрихкода.Свойство("Объект") И ДанныеШтрихкода.Объект <> Ссылка Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Штрихкод " + Штрихкод + " уже назначен " + ДанныеШтрихкода.Объект);
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Использование = Истина;
			НаборЗаписей.Отбор.Объект.Значение      = Ссылка;
			НоваяЗапись = НаборЗаписей.Добавить();	
			НоваяЗапись.Объект = Ссылка;
			НоваяЗапись.Штрихкод = Штрихкод;
			НаборЗаписей.Записать();		
		КонецЕсли;
	Иначе
		НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Использование = Истина;
		НаборЗаписей.Отбор.Объект.Значение      = Ссылка;
		НаборЗаписей.Записать();		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Код = "";
	КодБезНулей = "";
	КодСинхронизации = "";
КонецПроцедуры

#КонецОбласти
