
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Функция, возвращает список сегментов сотудников.
//
Функция ПолучитьСегментыСотрудника(знач Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СоставСегментов.Сегмент
	|ИЗ
	|	РегистрСведений.СоставСегментов КАК СоставСегментов
	|ГДЕ
	|	(ВЫРАЗИТЬ(СоставСегментов.ОбъектСегмента КАК Справочник.Сотрудники)) = &Сотрудник";
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
