
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	// Установить дату создания
	Если НЕ ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДата();
	КонецЕсли;
	
	// Заполнение реквизитов объектов по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Заполнение реквизитов объекта по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	                       
КонецПроцедуры

// Процедура - обработчик события "ПередУдалением"
//
Процедура ПередУдалением(Отказ)

	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Сегменты.Очистить(Ссылка);

КонецПроцедуры

// Процедура - Перед записью
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница) И НЕ ЭтоГруппа Тогда
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли; 
	
	//ЭтотОбъект.СхемаКомпоновкиДанных = ПоместитьВоВременноеХранилище(Справочники.СегментыСотрудников.ПолучитьМакет("ОсновнаяСхема"), Новый УникальныйИдентификатор);
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаЗаполнения"
//
Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если СпособФормирования = Перечисления.СпособыФормированияСегментов.ПериодическиОбновлять
			И Сегменты.ПолучитьПризнакЗаполненностиНастроек(Ссылка) = Истина Тогда 
		Сегменты.Сформировать(Ссылка);
		РегистрыСведений.СтекОповещенийПоВзаимодействиям.АктуализироватьИсполнителейВСтекеОповещений(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
