
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокОрганизаций(ЭтотОбъект.СписокОрганизаций);
	
КонецПроцедуры

&НаКлиенте
// Процедура - При открытии.
//
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьОтбор();	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка оповещения.
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОповещениеОбИзмененииДолга" Тогда
		Подключаемый_ОбработатьАктивизациюСтрокиСписка();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещения()

&НаСервере
// Процедура - Перед загрузкой данных из настроек на сервере.
//
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	СтруктурнаяЕдиница = Настройки.Получить("СтруктурнаяЕдиница");
	БанковскийСчет = Настройки.Получить("БанковскийСчет");
	Контрагент = Настройки.Получить("Контрагент");
	
	Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", СтруктурнаяЕдиница);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.БанковскийСчет.ПараметрыВыбора = НовыеПараметры;
	Иначе
		НовыйМассив = Новый Массив();
		Для каждого Элемент Из СписокОрганизаций Цикл
			НовыйМассив.Добавить(Элемент.Значение);
		КонецЦикла;
		ФиксированныйМассивОрганизации = Новый ФиксированныйМассив(НовыйМассив);
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", ФиксированныйМассивОрганизации);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.БанковскийСчет.ПараметрыВыбора = НовыеПараметры;
	КонецЕсли;
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокДокументов, "БанковскийСчет", БанковскийСчет, ЗначениеЗаполнено(БанковскийСчет));
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокДокументов, "Контрагент", Контрагент, ЗначениеЗаполнено(Контрагент));
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокДокументов, "СтруктурнаяЕдиница", СтруктурнаяЕдиница, ЗначениеЗаполнено(СтруктурнаяЕдиница));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - Банковский счет при изменении.
//
Процедура БанковскийСчетПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокДокументов, "БанковскийСчет", БанковскийСчет, ЗначениеЗаполнено(БанковскийСчет));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Касса при изменении.
//
Процедура КассаПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокДокументов, "Касса", Касса, ЗначениеЗаполнено(Касса));
КонецПроцедуры

&НаКлиенте
// Процедура - Контрагент при изменении.
//
Процедура КонтрагентПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокДокументов, "Контрагент", Контрагент, ЗначениеЗаполнено(Контрагент));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Структурная единица при изменении.
//
Процедура СтруктурнаяЕдиницаПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокДокументов, "СтруктурнаяЕдиница", СтруктурнаяЕдиница, ЗначениеЗаполнено(СтруктурнаяЕдиница));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Банковский счет начало выбора.
//
Процедура БанковскийСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		СтандартнаяОбработка = Ложь;	
		ПараметрыФормы = Новый Структура("Владелец", ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтруктурнаяЕдиница, "Организация"));
		ОткрытьФорму("Справочник.БанковскиеСчета.ФормаВыбора", ПараметрыФормы,,,,, Новый ОписаниеОповещения("БанковскийСчетНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		ОткрытьФорму("Справочник.БанковскиеСчета.ФормаВыбора",,,,,, Новый ОписаниеОповещения("БанковскийСчетНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Касса начало выбора.
//
Процедура КассаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		СтандартнаяОбработка = Ложь;	
		ПараметрыФормы = Новый Структура("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
		ОткрытьФорму("Справочник.Кассы.ФормаВыбора", ПараметрыФормы,,,,, Новый ОписаниеОповещения("КассаОтборНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		СтандартнаяОбработка = Истина; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Банковский счет очистка.
//
Процедура БанковскийСчетОчистка(Элемент, СтандартнаяОбработка)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокДокументов, "БанковскийСчет", БанковскийСчет, Ложь);
КонецПроцедуры

&НаКлиенте
// Процедура - Касса очистка.
//
Процедура КассаОчистка(Элемент, СтандартнаяОбработка)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокДокументов, "Касса", Касса, Ложь);
КонецПроцедуры

&НаКлиенте
// Процедура - Контрагент очистка.
//
Процедура КонтрагентОчистка(Элемент, СтандартнаяОбработка)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокДокументов, "Контрагент", Контрагент, Ложь);
КонецПроцедуры

&НаКлиенте
// Процедура - Структурная единица очистка.
//
Процедура СтруктурнаяЕдиницаОчистка(Элемент, СтандартнаяОбработка)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокДокументов, "СтруктурнаяЕдиница", СтруктурнаяЕдиница, Ложь);
КонецПроцедуры

&НаКлиенте
// Процедура - Переключатель касса банк при изменении.
//
Процедура ПереключательКассаБанкПриИзменении(Элемент)
	
	УстановитьВидимостьОтбор();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДокументов

&НаКлиенте
// Процедура - Банковские выписки при активизации строки.
//
Процедура БанковскиеВыпискиПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбработатьАктивизациюСтрокиСписка", 0.2, Истина);
	Если Элементы.СписокДокументов.ТекущиеДанные <> Неопределено Тогда
		Если ПереключательКассаБанк = 0 Тогда
			ИтогиПоКассеСчету = Элементы.СписокДокументов.ТекущиеДанные.Касса;
		ИначеЕсли  ПереключательКассаБанк = 1 Тогда 
			ИтогиПоКассеСчету = Элементы.СписокДокументов.ТекущиеДанные.БанковскийСчет;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Ведомость перейти.
//
Процедура ВедомостьПерейти(Команда)
	
	ФормаОтчета = ПолучитьФорму("Отчет.ВедомостьПоДенежнымСредствам.ФормаОбъекта");
	ФормаОтчета.Открыть(); 
	ФормаОтчета.СкомпоноватьРезультат();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Общий обработчик создания документов поступления.
//
Процедура ОбщийОбработчикСозданияДокументовПоступления(Команда)
	
	ЭтоКасса = (ПереключательКассаБанк = 0);
	ПараметрВидОперации   = Неопределено;
		
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ОплатаОтКлиента")				>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаОтКлиента"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВзносНаЛицевойСчет")			>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВзносНаЛицевойСчет"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ПоступлениеИзБанка")			>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоступлениеИзБанка"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВозвратОтПоставщика")			>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОплатыОтПоставщика"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВозвратОтПодотчетника")		>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОтПодотчетника"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ОплатаОтСтраховойКомпании")	>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаОтСтраховойКомпании"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ПоступлениеОтЭквайера")		>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоступлениеОтЭквайера"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВозвратНалога")				>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратНалога"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВозвратЗайма")					>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратЗайма"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВозвратЗаработнойПлаты")		>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратЗаработнойПлаты"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВводОстатков")					>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВводОстатков"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВзносУчредителя")				>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВзносУчредителя"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ПоступлениеИзКассы")			>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоступлениеИзКассы"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ПрочееПоступление")			>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПрочееПоступление"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ПоступлениеРозничнойВыручки")  >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоступлениеРозничнойВыручкиИзОперационнойКассы"), ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ПоступлениеИзКассыПредприятия")>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоступлениеИзКассыПредприятия"), ПараметрВидОперации);
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Основание", Новый Структура("ВидОперации, ТипДенежныхСредств, Отбор", ПараметрВидОперации, ЭтотОбъект.ТипДенежныхСредств, Новый Структура("Контрагент, СтруктурнаяЕдиница, Касса", Контрагент, СтруктурнаяЕдиница, Касса)));			
	СтруктураПараметры.Основание.Отбор.Вставить(?(ЭтоКасса, "Касса", "БанковскийСчет"), ?(ЭтоКасса, Касса, БанковскийСчет));	
	ОткрытьФорму("Документ.ПоступлениеДенежныхСредств.ФормаОбъекта", СтруктураПараметры);
		
КонецПроцедуры

&НаКлиенте
// Процедура - Общий обработчик создания документов списания.
//
Процедура ОбщийОбработчикСозданияДокументовСписания(Команда)
	
	ЭтоКасса = (ПереключательКассаБанк = 0);
	ПараметрВидОперации   = Неопределено;
	
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВозвратОплатыКлиенту")				>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОплатыКлиенту"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВозвратСЛицевогоСчета")			>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратСЛицевогоСчета"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ОплатаПоставщику")					>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаПоставщику"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"СдачаНаличныхВБанк")				>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.СдачаНаличныхВБанк"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВыдачаПодотчетнику")				>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВыдачаПодотчетнику"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ЗарплатаСотруднику")				>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВыплатаЗаработнойПлаты"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВозвратОплатыСтраховойКомпании")	>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОплатыСтраховойКомпании"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВыдачаЗайма")						>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВыдачаЗайма"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ОплатаНалога")						>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаНалога"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВыплатаДивидендовУчредителю")		>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВыплатаДивидендовУчредителю"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВыбытиеВКассу")					>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВыбытиеВКассу"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ПрочееСписание")					>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПрочееСписание"),ПараметрВидОперации);	
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"СдачаРозничнойВыручкиВКассуПредприятия") >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.СдачаРозничнойВыручкиВКассуПредприятия"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВыбытиеВОперационнуюКассу")        >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВыбытиеВОперационнуюКассу"),ПараметрВидОперации);


	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Основание", Новый Структура("ВидОперации, ТипДенежныхСредств, Отбор", ПараметрВидОперации, ЭтотОбъект.ТипДенежныхСредств, Новый Структура("Контрагент, СтруктурнаяЕдиница, Касса", Контрагент, СтруктурнаяЕдиница, Касса)));			
	СтруктураПараметры.Основание.Отбор.Вставить(?(ЭтоКасса, "Касса", "БанковскийСчет"), ?(ЭтоКасса, Касса, БанковскийСчет));	
	
	ОткрытьФорму("Документ.СписаниеДенежныхСредств.ФормаОбъекта", СтруктураПараметры);

КонецПроцедуры

&НаКлиенте
// Процедура - Создать перемещение.
//
Процедура СоздатьПеремещение(Команда)
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Основание", Новый Структура("ТипДенежныхСредств, Отбор", ТипДенежныхСредств, Новый Структура("СтруктурнаяЕдиница", СтруктурнаяЕдиница)));
	ОткрытьФорму("Документ.ПеремещениеДенежныхСредств.ФормаОбъекта", СтруктураПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Процедура - Заполнить список организаций.
//
Процедура ЗаполнитьСписокОрганизаций(СписокОрганизаций)
	
	СписокЗначений = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации";
	ВыборкаОрганизаций = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаОрганизаций.Следующий() Цикл
		СписокЗначений.Добавить(ВыборкаОрганизаций.Ссылка);
	КонецЦикла;
	СписокОрганизаций = СписокЗначений;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый обработать активизацию строки списка.
//
Процедура Подключаемый_ОбработатьАктивизациюСтрокиСписка()
	
	ТекущаяСтрока = Элементы.СписокДокументов.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		СтруктураДанные = ПолучитьДанныеПоКассеБанковскомуСчету(ТекущаяСтрока.Дата, ?(ПереключательКассаБанк = 0, ТекущаяСтрока.Касса, ТекущаяСтрока.БанковскийСчет), ТипДенежныхСредств);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураДанные);
		Дата = Формат(ТекущаяСтрока.Дата, "ДЛФ=D");
	Иначе
		ИнформацияСуммаКонечныйОстаток = 0;
		ИнформацияСуммаНачальныйОстаток = 0;
		ИнформацияСуммаПриход = 0;
		ИнформацияСуммаРасход = 0;
		Дата = "";
	Конецесли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
// Функция - Получить данные по кассе банковскому счету.
//
Функция ПолучитьДанныеПоКассеБанковскомуСчету(Период, КассаБанковскийСчет, ТипДенежныхСредств)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДенежныеСредстваОстаткиИОбороты.СуммаНачальныйОстаток КАК ИнформацияСуммаНачальныйОстаток,
	|	ДенежныеСредстваОстаткиИОбороты.СуммаПриход КАК ИнформацияСуммаПриход,
	|	ДенежныеСредстваОстаткиИОбороты.СуммаРасход КАК ИнформацияСуммаРасход,
	|	ДенежныеСредстваОстаткиИОбороты.СуммаКонечныйОстаток КАК ИнформацияСуммаКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			День,
	|			,
	|			БанковскийСчетКасса = &КассаБанковскийСчет
	|				И ТипДенежныхСредств = &ТипДенежныхСредств) КАК ДенежныеСредстваОстаткиИОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода",      НачалоДня(Период));
	Запрос.УстановитьПараметр("КонецПериода",       КонецДня(Период));
	Запрос.УстановитьПараметр("КассаБанковскийСчет",КассаБанковскийСчет);
	Запрос.УстановитьПараметр("ТипДенежныхСредств", ТипДенежныхСредств);
	
	ВыборкаРезультата = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаРезультата.Следующий() Тогда
		СтруктураВозврата = Новый Структура("ИнформацияСуммаНачальныйОстаток, ИнформацияСуммаКонечныйОстаток, ИнформацияСуммаПриход, ИнформацияСуммаРасход");
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, ВыборкаРезультата);
		Возврат СтруктураВозврата;
	Иначе
		Возврат Новый Структура(
		"ИнформацияСуммаКонечныйОстаток, ИнформацияСуммаНачальныйОстаток, ИнформацияСуммаПриход, ИнформацияСуммаРасход",
		0,0,0,0,Ложь
		);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Процедура - Установить видимость отбор.
//
Процедура УстановитьВидимостьОтбор()
	
	ЭтоКасса = (ПереключательКассаБанк = 0);
	
	Если ЭтоКасса Тогда
		ТипДенежныхСредств =  ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные");		
		ЭтаФорма.Заголовок = Нстр("ru = 'Документы по кассе'; en = 'Cashbox documents'");	
	Иначе
		ТипДенежныхСредств =  ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные");
		ЭтаФорма.Заголовок = Нстр("ru = 'Документы по банку'; en = 'Bank documents'");		
	КонецЕсли;
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокДокументов, "ТипДенежныхСредств", ЭтаФорма.ТипДенежныхСредств, Истина);
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокДокументов, "БанковскийСчет", ЭтаФорма.БанковскийСчет, ?(ЭтоКасса, Ложь, ЗначениеЗаполнено(ЭтаФорма.БанковскийСчет)));
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокДокументов, "Касса", ЭтаФорма.Касса, ?(ЭтоКасса, ЗначениеЗаполнено(ЭтаФорма.Касса), Ложь));	
	
	Элементы.Касса.Видимость = ЭтоКасса;
	Элементы.СписокКасса.Видимость = ЭтоКасса;	
	Элементы.ФормаСоздатьВозвратОтПодотчетника.Видимость = ЭтоКасса;
	Элементы.ФормаСоздатьВозвратОтПодотчетникаКонтекстноеМеню.Видимость = ЭтоКасса;	
	Элементы.ФормаСоздатьПоступлениеИзБанка.Видимость = ЭтоКасса;
	Элементы.ФормаСоздатьПоступлениеИзБанкаКонтекстноеМеню.Видимость = ЭтоКасса;	
	Элементы.ФормаСоздатьВыдачаПодотчетнику.Видимость = ЭтоКасса;
	Элементы.ФормаСоздатьВыдачаПодотчетникуКонтекстноеМеню.Видимость = ЭтоКасса;	
	Элементы.ФормаСоздатьСдачаНаличныхВБанк.Видимость = ЭтоКасса;	
	Элементы.ФормаСоздатьСдачаНаличныхВБанкКонтекстноеМеню.Видимость = ЭтоКасса;
	
	Элементы.ФормаСоздатьПоступлениеРозничнойВыручкиИзОперационнойКассы.Видимость = ЭтоКасса;
	Элементы.ФормаСоздатьПоступлениеРозничнойВыручкиИзОперационнойКассыКонтекстноеМеню.Видимость = ЭтоКасса;	
	Элементы.ФормаСоздатьПоступлениеИзКассыПредприятия.Видимость = ЭтоКасса;	
	Элементы.ФормаСоздатьПоступлениеИзКассыПредприятияКонтекстноеМеню.Видимость = ЭтоКасса;                 
	Элементы.ФормаСоздатьВыбытиеВОперационнуюКассу.Видимость = ЭтоКасса;     
	Элементы.ФормаСоздатьВыбытиеВОперационнуюКассуКонтекстноеМеню.Видимость = ЭтоКасса;                     
	Элементы.ФормаСоздатьСдачаРозничнойВыручкиВКассуПредприятия.Видимость = ЭтоКасса;
	Элементы.ФормаСоздатьСдачаРозничнойВыручкиВКассуПредприятияКонтекстноеМеню.Видимость = ЭтоКасса;
	
	Элементы.БанковскийСчет.Видимость = НЕ ЭтоКасса;
	Элементы.СписокБанковскийСчет.Видимость = НЕ ЭтоКасса;		
	Элементы.ФормаСоздатьПоступлениеОтЭквайера.Видимость = НЕ ЭтоКасса;
	Элементы.ФормаСоздатьПоступлениеОтЭквайераКонтекстноеМеню.Видимость = НЕ ЭтоКасса;	
	Элементы.ФормаСоздатьВозвратНалога.Видимость = НЕ ЭтоКасса;
	Элементы.ФормаСоздатьВозвратНалогаКонтекстноеМеню.Видимость = НЕ ЭтоКасса; 	
	Элементы.ФормаСоздатьПоступлениеИзКассы.Видимость = НЕ ЭтоКасса;
	Элементы.ФормаСоздатьПоступлениеИзКассыКонтекстноеМеню.Видимость = НЕ ЭтоКасса;	
	Элементы.ФормаСоздатьОплатаНалога.Видимость = НЕ ЭтоКасса;
	Элементы.ФормаСоздатьОплатаНалогаКонтекстноеМеню.Видимость = НЕ ЭтоКасса;	
	Элементы.ФормаСоздатьВыбытиеВКассу.Видимость = НЕ ЭтоКасса;
	Элементы.ФормаСоздатьВыбытиеВКассуКонтекстноеМеню.Видимость = НЕ ЭтоКасса;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Касса отбор начало выбора завершение.
//
Процедура КассаОтборНачалоВыбораЗавершение(Результат, Параметры)  Экспорт
	
	Если Результат <> Неопределено Тогда 
		Касса = Результат;
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокДокументов, "Касса", Касса, ЗначениеЗаполнено(Касса));
	КонецЕсли;
   
КонецПроцедуры

&НаКлиенте
// Процедура - Банковский счет начало выбора завершение.
//
Процедура БанковскийСчетНачалоВыбораЗавершение(Результат, Параметры)  Экспорт
	
	Если Результат <> Неопределено Тогда 
		БанковскийСчет = Результат;
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокДокументов, "БанковскийСчет", БанковскийСчет, ЗначениеЗаполнено(БанковскийСчет));
	КонецЕсли;
   
КонецПроцедуры

#КонецОбласти