
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктурнаяЕдиницаОтбор = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	ОрганизацияОтбор		= СтруктурнаяЕдиницаОтбор.Организация;
	КассаОтбор				= СтруктурнаяЕдиницаОтбор.ОсновнаяКасса;
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница"	, СтруктурнаяЕдиницаОтбор	, ЗначениеЗаполнено(СтруктурнаяЕдиницаОтбор));
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация"			, ОрганизацияОтбор			, ЗначениеЗаполнено(ОрганизацияОтбор));
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Касса"				, КассаОтбор				, ЗначениеЗаполнено(КассаОтбор));

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура СтруктурнаяЕдиницаОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтруктурнаяЕдиницаОтбор, ЗначениеЗаполнено(СтруктурнаяЕдиницаОтбор));
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура ОрганизацияОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", ОрганизацияОтбор, ЗначениеЗаполнено(ОрганизацияОтбор));
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура КассаОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Касса", КассаОтбор, ЗначениеЗаполнено(КассаОтбор));
	
КонецПроцедуры

#КонецОбласти
