
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик события ПриСозданииНаСервере формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	// При вызове из классификатора.
	Если Параметры.Свойство("Код") Тогда
		Объект.Код = Параметры.Код;
	КонецЕсли;	
	
	Если Параметры.Свойство("Наименование") Тогда
		Объект.Наименование = Параметры.Наименование;
	КонецЕсли;
	
	Если Параметры.Свойство("МеждународноеСокращение") Тогда
		Объект.МеждународноеСокращение = Параметры.МеждународноеСокращение;
	КонецЕсли;
	
	Если Параметры.Свойство("НаименованиеПолное") Тогда
		Объект.НаименованиеПолное = Параметры.НаименованиеПолное;
	КонецЕсли;	
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СкрытьПоказатьДополнительно(Команда)
	
	Элементы.ГруппаДополнительно.Видимость = НЕ Элементы.ГруппаДополнительно.Видимость;
	
КонецПроцедуры

#КонецОбласти