
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктурнаяЕдиницаОтбор	= ОбщегоНазначенияСтоматология.ПолучитьЗначениеПараметровСеанса("ТекущаяСтруктурнаяЕдиница");
	ОрганизацияОтбор		= СтруктурнаяЕдиницаОтбор.Организация;
	КассаОтбор				= СтруктурнаяЕдиницаОтбор.ОсновнаяКасса;
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация"			, ОрганизацияОтбор			, ЗначениеЗаполнено(ОрганизацияОтбор));
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Касса"				, КассаОтбор				, ЗначениеЗаполнено(КассаОтбор));
   	// СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

&НаКлиенте
// Процедура - обработчик команды "СоздатьЧекКоррекции".
//
Процедура СоздатьЧекКоррекции(Команда)
	
	ОткрытьФорму("Документ.ЧекКоррекции.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "СкопироватьЧекКоррекции".
//
Процедура СкопироватьЧекКоррекции(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.КассовыйЧекКоррекции") Тогда
		ОткрытьФорму("Документ.ЧекКоррекции.ФормаОбъекта");
	Иначе
        ОткрытьФорму("Документ.ЧекКоррекции.ФормаОбъекта", Новый Структура("ЗначениеКопирования", ТекущиеДанные.Ссылка), ЭтаФорма);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура СтруктурнаяЕдиницаОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтруктурнаяЕдиницаОтбор, ЗначениеЗаполнено(СтруктурнаяЕдиницаОтбор));
	
	ОрганизацияОтбор = Неопределено;
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", ОрганизацияОтбор, ЗначениеЗаполнено(ОрганизацияОтбор));
	
	КассаОтбор = Неопределено;
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Касса", КассаОтбор, ЗначениеЗаполнено(КассаОтбор));
		
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура ОрганизацияОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", ОрганизацияОтбор, ЗначениеЗаполнено(ОрганизацияОтбор));
	КассаОтбор = Неопределено;
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Касса", КассаОтбор, ЗначениеЗаполнено(КассаОтбор));
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура КассаОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Касса", КассаОтбор, ЗначениеЗаполнено(КассаОтбор));
	
КонецПроцедуры

#КонецОбласти



