
#Область ОписаниеПеременных

&НаКлиенте
// Флаг указывающий что это форма нового документа
Перем ЭтоНовыйДок;     

#КонецОбласти     

#Область ОбработчикиСобытийФормы
////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РеквизитФормыВЗначение("Объект").ЭтоНовый() Тогда
		
		Если Объект.СтруктурнаяЕдиница.Пустая() = Истина Тогда
			Объект.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
		КонецЕсли;
		
		Если Объект.АвторДокумента.Пустая() = Истина Тогда
			Объект.АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
	
		Если Объект.ТипСобытия.Пустая() = Истина Тогда
			Объект.ТипСобытия = Перечисления.ТипыСобытий.ПредварительнаяЗапись;
		КонецЕсли;
		
		Если Объект.ВидЦен.Пустая() = Истина Тогда
			Объект.ВидЦен = ?(Не Объект.СтруктурнаяЕдиница.ВидЦенРеализации.Пустая(), Объект.СтруктурнаяЕдиница.ВидЦенРеализации, Справочники.ВидыЦен.Розничная);
		КонецЕсли;
		
		Если Параметры.Свойство("Резерв") Тогда 
			Если Параметры.Резерв Тогда 
				Объект.Резерв = Параметры.Резерв;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.ДатаНачала) И ЗначениеЗаполнено(Параметры.ДатаОкончания)  Тогда
			
			НоваяСтрока               = Объект.Услуги.Добавить();
			НоваяСтрока.ДатаНачала    = Параметры.ДатаНачала;
			НоваяСтрока.ДатаОкончания = Параметры.ДатаОкончания;
			НоваяСтрока.НормаВремени  = (Параметры.ДатаОкончания - Параметры.ДатаНачала) / 60;
			НоваяСтрока.Сотрудник 	  = ?(Параметры.Свойство("Сотрудник"), Параметры.Сотрудник, Справочники.Сотрудники.ПустаяСсылка());
			НоваяСтрока.Помещение     = ?(Параметры.Свойство("Помещение"), Параметры.Помещение, Справочники.Помещения.ПустаяСсылка());
			
			ДатаНачала 		= Параметры.ДатаНачала;
			ДатаОкончания 	= Параметры.ДатаОкончания;
			НормаВремени 	= (Параметры.ДатаОкончания - Параметры.ДатаНачала) / 60;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьДаты();
	
	РаботаСДиалогами.УстановитьДоступностьЭлементовФормДокументаПоПравамПользователя(ЭтаФорма, Объект);	
	
	Если Объект.Услуги.Количество() > 0 Тогда
		ДатаСобытия = Объект.Услуги[0].ДатаНачала;
	ИначеЕсли ЗначениеЗаполнено(Параметры.ДатаНачала) Тогда
		ДатаСобытия = Параметры.ДатаНачала;
	Иначе
		ДатаСобытия = ТекущаяДата();		
	КонецЕсли;
		
	// Сохранение вводимых значений
	СохранениеВводимыхЗначений.ЗаполнитьСписокВыбора(ЭтаФорма, ЭлементыДляСохранения(), ЭтаФорма.ИмяФормы);
	Элементы.ОснованиеРезерва.КнопкаВыбора = Ложь;
	
	УстановитьВидимостьЭлементов();
	
	// Отображение информации о дате создания документа
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Элементы.ДекорацияДатаСоздания.Видимость 	= Истина;
		// Элементы.Декорация_Заглушка.Видимость 		= Истина;
		Элементы.ДекорацияДатаСоздания.Заголовок = "Создан: " + Формат(Объект.Дата, "ДФ='дд ММММ ""в"" ЧЧ:мм, '") + Объект.АвторДокумента;
	Иначе
	    Элементы.ДекорацияДатаСоздания.Видимость 	= Ложь;
	//	Элементы.Декорация_Заглушка.Видимость 		= Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриОткрытии.
// В процедуре устанавливается текущая страница в зависимости от операции.
//
Процедура ПриОткрытии(Отказ)
	
	ЭтоНовыйДок = НЕ ЗначениеЗаполнено(Объект.Ссылка);
	
	#Если ВебКлиент Тогда
		ЗапускВэбКлиент = Истина;
	#КонецЕсли	
	
	// МеханизмВнешнегоОборудования
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ОписаниеОшибки = "";
		
		ПоддерживаемыеТипыВО = Новый Массив();
		// ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
		ПоддерживаемыеТипыВО.Добавить("СчитывательМагнитныхКарт");
		
		Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:
			|""%ОписаниеОшибки%"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	// Конец МеханизмВнешнегоОборудования 
	
	УстановкаЦвета(ЦветФонаРезерваФорма);
	
	// Зададим списки выбора для элементов выбора времени начала и окончания услуг
	// Это вынужденная мера, т.к. в платформе 8.3.4 есть косяк со списками выбора
	ПроинициализироватьЭлементыВыбораВремени();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, 
//
Процедура УстановкаЦвета(ЦветФонаРезерваФорма)
	
	// Установка цвета
	Если ЗначениеЗаполнено(Объект.ЦветФонаРезерва) Тогда
		ЦветФонаРезерваФорма = Объект.ЦветФонаРезерва;
		Элементы.УстановкаЦвет.ЦветФона = ЗначениеИзСтрокиВнутр(Объект.ЦветФонаРезерва);
	ИначеЕсли ЗначениеЗаполнено(ЦветФонаРезерваФорма) Тогда  
		Объект.ЦветФонаРезерва = ЦветФонаРезерваФорма;
		Элементы.УстановкаЦвет.ЦветФона = ЗначениеИзСтрокиВнутр(Объект.ЦветФонаРезерва);
	Иначе 
		Объект.ЦветФонаРезерва = ЗначениеВСтрокуВнутр(WebЦвета.Хаки);
		ЦветФонаРезерваФорма = Объект.ЦветФонаРезерва;
		Элементы.УстановкаЦвет.ЦветФона = WebЦвета.Хаки;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Обработчик события "ПриЗаписиНаСервре"
//
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Сохранение вводимых значений
	СохранениеВводимыхЗначений.ОбновитьСпискиВыбора(ЭтаФорма, ЭлементыДляСохранения(), ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик команды ПослеЗаписиНаСервере
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПослеЗаписи.
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмененоСобытие");
	Если ЭтоНовыйДок Тогда 
	     ОповеститьОЗаписиНового(Объект);
	КонецЕсли;	 
	
КонецПроцедуры

&НаСервере
// Процедура - обработчик события ОбработкаПроверкиЗаполненияНаСервере формы
//
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка на работу структурной единицы
	Если Объект.Услуги.Количество() > 0 Тогда
		ПериодРаботы = ОбщегоНазначенияСтоматология.ПолучитьВремяРаботыСтруктурнойЕдиницы(Объект.Услуги[0].ДатаНачала, Объект.СтруктурнаяЕдиница); 
		Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
			Если СтрокаТЧ.ДатаОкончания = НачалоДня(СтрокаТЧ.ДатаОкончания) Тогда 
				СтрокаТЧ.ДатаОкончания = СтрокаТЧ.ДатаОкончания - 1;
			КонецЕсли;						
			Если СтрокаТЧ.ДатаНачала < ПериодРаботы.ДатаНачала ИЛИ СтрокаТЧ.ДатаНачала >= ПериодРаботы.ДатаОкончания
				ИЛИ СтрокаТЧ.ДатаОкончания <= ПериодРаботы.ДатаНачала ИЛИ СтрокаТЧ.ДатаОкончания > ПериодРаботы.ДатаОкончания Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Строка " + СтрокаТЧ.НомерСтроки + ":Структурная единица не работает " + ПредставлениеПериода(СтрокаТЧ.ДатаНачала, СтрокаТЧ.ДатаОкончания) + "!");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода Дата.
//
Процедура ДатаПриИзменении(Элемент)
	
	Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
		СтрокаТЧ.ДатаНачала = НачалоДня(ДатаСобытия) + (СтрокаТЧ.ДатаНачала - НачалоДня(СтрокаТЧ.ДатаНачала));
		СтрокаТЧ.ДатаОкончания = НачалоДня(ДатаСобытия) + (СтрокаТЧ.ДатаОкончания - НачалоДня(СтрокаТЧ.ДатаОкончания));
	КонецЦикла;
	
КонецПроцедуры // ДатаНачалаПриИзменении()	

&НаСервере
// Процедура устанавливает видимость элементов.
//
Процедура УстановитьВидимостьЭлементов()
	
	Если Объект.Ссылка.Проведен = Истина И (Объект.Ссылка.Статус = Перечисления.СтатусыСобытия.НеПодтверждена ИЛИ Объект.Ссылка.Статус = Перечисления.СтатусыСобытия.Подтверждена) Тогда
		Элементы.ГруппаОтменаРезерва.Видимость = Истина;
	Иначе
		Элементы.ГруппаОтменаРезерва.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
//
//
Процедура УстановитьДаты()
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) И НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда 
		Если Объект.Услуги.Количество() <> 0 Тогда
			ДатаНачала 		= Объект.Услуги[0].ДатаНачала;
			ДатаОкончания 	= Объект.Услуги[0].ДатаОкончания;
			НормаВремени 	= (Объект.Услуги[0].ДатаОкончания - Объект.Услуги[0].ДатаНачала) / 60;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды ОтменитьСобытие
//
Процедура КомандаОтменитьСобытие(Команда)
	
	Если Модифицированность = Истина Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОСохраненииИзменений", ЭтотОбъект), "Событие было модифицировано, перед отменой события все изменения сохраняться.", РежимДиалогаВопрос.ОКОтмена);
        Возврат;
	КонецЕсли;
	
	КомандаОтменитьСобытиеФрагмент(); 
	
КонецПроцедуры

&НаКлиенте
// Процедура - После вопроса о сохранении изменений
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПослеВопросаОСохраненииИзменений(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
		Записать();
	Иначе
		Возврат;
	КонецЕсли;
	
	КомандаОтменитьСобытиеФрагмент();

КонецПроцедуры

&НаКлиенте
// Процедура - Команда отменить событие фрагмент
//
Процедура КомандаОтменитьСобытиеФрагмент()
	
	ОбщегоНазначенияКлиентСтоматология.ОтменитьСобытие(Объект.Ссылка,, Новый ОписаниеОповещения("КомандаОтменитьСобытиеЗавершение", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
// Процедура - Команда отменить событие завершение.
//
Процедура КомандаОтменитьСобытиеЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Истина Тогда
		Оповестить("ИзмененоСобытие");
		Закрыть();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Команда, обработчик установки цвета
//
Процедура ЦветРезерва(Команда)
	
	ДиалогЦвета = Новый ДиалогВыбораЦвета();
	
	#Если Не ВебКлиент Тогда
		ДиалогЦвета.Цвет = Элементы.УстановкаЦвет.ЦветФона;
	#КонецЕсли
	
	ДиалогЦвета.Показать(Новый ОписаниеОповещения("ЦветРезерваЗавершение", ЭтотОбъект));	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Цвет резерва завершение
//
// Параметры:
//  Цвет					 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ЦветРезерваЗавершение(Цвет, ДополнительныеПараметры) Экспорт
	
	Если Цвет <> Неопределено Тогда
		ИзменитьЦветФонаРезерва(Цвет);
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура изменяет устанавливает в значение реквизита - цвет фона.
//
Процедура ИзменитьЦветФонаРезерва(Цвет)
	
	Объект.ЦветФонаРезерва = ЗначениеВСтрокуВнутр(Цвет);
	ЦветФонаРезерваФорма = Объект.ЦветФонаРезерва;
	Элементы.УстановкаЦвет.ЦветФона = Цвет;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении элемента ДатаНачала.
//
Процедура УслугиВремяПриИзменении(Элемент)
	
	ЭтоВремяНачала = Найти(Элемент.Имя, "ДатаНачала") <> 0;
	ИмяРеквизита = ?(ЭтоВремяНачала, "ДатаНачала", "ДатаОкончания");
	
	Если ДатаОкончания <= ДатаНачала Тогда
		ЭтаФорма[ИмяРеквизита] = Дата("00010101");
	КонецЕсли;
	
	Объект.Услуги[0][ИмяРеквизита] = ЭтаФорма[ИмяРеквизита];
	
	Объект.Услуги[0].НормаВремени = (ДатаОкончания - ДатаНачала) / 60;
	НормаВремени = (ДатаОкончания - ДатаНачала) / 60;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении элемента НормаВремени.
//
Процедура УслугиНормаВремениПолемПриИзменении(Элемент)
	
	Объект.Услуги[0].ДатаОкончания = ДатаНачала + НормаВремени * 60;
	ДатаОкончания = ДатаНачала + НормаВремени * 60; 	
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события НачалоВыбораИзСписка поля ввода ДатаНачала.
//
Процедура УслугиДатаНачалаПолемНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 	
	
	МассивПериодов = Новый Массив;
	МассивПериодов.Добавить(ОбщегоНазначенияСтоматология.ПолучитьВремяРаботыСтруктурнойЕдиницы(ДатаСобытия, Объект.СтруктурнаяЕдиница));
	
	СписокВеремени 		= РаботаСДиалогами.ВернутьСписокВремени(МассивПериодов, Истина);		
	НачальноеЗначение 	= СписокВеремени.НайтиПоЗначению(ДатаНачала);		
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("УслугиДатаНачалаЗавершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), СписокВеремени, Элемент, НачальноеЗначение);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Услуги дата начала полем начало выбора из списка завершение
//
// Параметры:
//  ВыбранныйЭлемент		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура УслугиДатаНачалаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Объект.Услуги[0].ДатаНачала = ВыбранныйЭлемент.Значение;
		ДатаНачала = ВыбранныйЭлемент.Значение;
		ВремяПриИзменении(ДополнительныеПараметры.Элемент);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события НачалоВыбораИзСписка поля ДатаОкончания.
//
Процедура УслугиДатаОкончанияПолемНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Счетчик = 0;		
	МассивПериодов = Новый Массив;
	МассивПериодов.Добавить(ОбщегоНазначенияСтоматология.ПолучитьВремяРаботыСтруктурнойЕдиницы(ДатаСобытия, Объект.СтруктурнаяЕдиница));
	
	СписокВеремени = РаботаСДиалогами.ВернутьСписокВремени(МассивПериодов, Ложь);
	Пока Счетчик = 0 И СписокВеремени.Количество() > 0 И СписокВеремени[Счетчик].Значение < ДатаНачала Цикл
		СписокВеремени.Удалить(Счетчик);
	КонецЦикла;	
	
	НачальноеЗначение 	= СписокВеремени.НайтиПоЗначению(ДатаОкончания);	
	ВыбранноеВремя = Неопределено;
	
	ЭтаФорма.ПоказатьВыборИзСписка(Новый ОписаниеОповещения("УслугиДатаОкончанияЗавершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), СписокВеремени, Элемент, НачальноеЗначение); 	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Услуги дата окончания завершение
//
// Параметры:
//  ВыбранныйЭлемент		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура УслугиДатаОкончанияЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Объект.Услуги[0].ДатаОкончания = ВыбранныйЭлемент.Значение;
		ДатаОкончания = ВыбранныйЭлемент.Значение;
		ВремяПриИзменении(ДополнительныеПараметры.Элемент);
	КонецЕсли;

КонецПроцедуры

 &НаКлиенте
// Процедура - обработчик события ПриИзменении таблицы значений Услуги, элемента Время.
//
Процедура ВремяПриИзменении(Элемент)
	
	Если Объект.Резерв Тогда 
		Объект.Услуги[0].НормаВремени = (ДатаОкончания - ДатаНачала) / 60;
		НормаВремени = (ДатаОкончания - ДатаНачала) / 60;
	Иначе 
		ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;	
		ТекущаяСтрока.НормаВремени = (ТекущаяСтрока.ДатаОкончания - ТекущаяСтрока.ДатаНачала) / 60;
		НормаВремени = (ДатаОкончания - ДатаНачала) / 60;
	КонецЕсли;	
	
КонецПроцедуры

//&НаКлиенте
//// Обработчик открытия формы кэш списка вводимых значений
////
// Процедура Подключаемый_ОбработчикКэшЛист(Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
//	
//	СтандартнаяОбработка = Ложь;
//	Объект.ОснованиеРезерва = СохранениеВводимыхЗначенийКлиент.ОбработчикВызоваФормыРедактированияКэшСписка(Элемент, ЭтаФорма);
//	
// КонецПроцедуры

&НаСервере
// Веренет таблицу сохраняемых элементов
//
Функция ЭлементыДляСохранения()
	
	СохраняемыеЭлементы = Новый Структура("ОснованиеРезерва", Объект.ОснованиеРезерва);
	
	Возврат СохранениеВводимыхЗначений.СформироватьТаблицуСохраненяемыхЭлементов(СохраняемыеЭлементы);
	
КонецФункции

&НаКлиенте
// Устанавливает списки выбора для элементов выбора времени начала и окончания услуг
// Это вынужденная мера, т.к. в платформе 8.3.4 есть косяк со списками выбора
//
Процедура ПроинициализироватьЭлементыВыбораВремени()

	МассивИнициализируемыхЭлементов = Новый Массив;
	МассивИнициализируемыхЭлементов.Добавить("УслугиДатаНачалаПолем");
	МассивИнициализируемыхЭлементов.Добавить("УслугиДатаОкончанияПолем");
	
	МассивПериодов = Новый Массив;
	МассивПериодов.Добавить(ОбщегоНазначенияСтоматология.ПолучитьВремяРаботыСтруктурнойЕдиницы(ДатаСобытия, Объект.СтруктурнаяЕдиница));
	СписокВремени = РаботаСДиалогами.ВернутьСписокВремени(МассивПериодов, Истина);
	
	Для Каждого ИмяЭлемента Из МассивИнициализируемыхЭлементов Цикл
		
		Элементы[ИмяЭлемента].СписокВыбора.Очистить();
		Для Каждого ПредставлениеВремени Из СписокВремени Цикл
			Элементы[ИмяЭлемента].СписокВыбора.Добавить(ПредставлениеВремени.Значение, ПредставлениеВремени.Представление);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ПроинициализироватьЭлементыВыбораВремени()

#КонецОбласти 
