
#Область ПрограммныйИнтерфейс

// Процедура - Обработчик ожидания проверить очередь кассового сервера
//
Процедура ОбработчикОжиданияПроверитьОчередьКассовогоСервера() Экспорт
	
	КассаОплаты = КассовыйСерверПовтИсп.КассаКассовогоСервера();
	ДатаОтбора  = КассовыйСерверПовтИсп.ПолучитьДатуОтбораИзОчередиКассовогоСервера(КассаОплаты);
	
	Если ОбщегоНазначения.ПроверитьСсылкаБитаяСервер(КассаОплаты) = Ложь Тогда
		
		//ДатаОтборв 		
		КоличествоДокВОчереди = КассовыйСервер.КоличествоДокументовВОчередиДляТекущегоСеанса(ДатаОтбора, КассаОплаты);
		
		Если КоличествоДокВОчереди > 0 Тогда
			
			Оповещение = Новый ОписаниеОповещения("ОткрытьФормуКассовогоСервер", КассовыйСерверКлиент);
			
			ПоказатьОповещениеПользователя(
			НСтр("ru = 'Кассовый сервер'; en = 'Cash server'"),
			Оповещение,
			СтрШаблон(НСтр("ru = 'Поступило %1 документ(ов) онлайн оплаты для фискализации'; en = 'Received %1 online payment document(s) for fiscalization'"), КоличествоДокВОчереди),
			БиблиотекаКартинок.РазделОтчетность,
			СтатусОповещенияПользователя.Важное,
			Новый УникальныйИдентификатор("6596e18a-bb2e-4d18-8adf-46488e67ea71"));
			
		КонецЕсли;
		
	Иначе
		
		КоличествоДокВОчереди = 0;
		
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияПроверитьОчередьКассовогоСервера", 60, Истина);
	
КонецПроцедуры

#КонецОбласти
