
#Область СлужебныеПроцедурыИФункции

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРаботыСотрудника(ДокументСсылка, СтруктураДополнительныеСвойства)
	
    Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремяРаботыСотрудниковФакт.СтруктурнаяЕдиница,
	|	ВремяРаботыСотрудниковФакт.Сотрудник,
	|	ВремяРаботыСотрудниковФакт.ДатаВремяНачала,
	|	ВремяРаботыСотрудниковФакт.ДатаВремяОкончания,
	|	ВремяРаботыСотрудниковФакт.Минуты
	|ИЗ
	|	ВременнаяТаблицаВремяРаботыСотрудниковФакт КАК ВремяРаботыСотрудниковФакт";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВремяРаботыСотрудниковФакт", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремяРаботыСотрудниковФакт.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ДОБАВИТЬКДАТЕ(ВремяРаботыСотрудниковФакт.Ссылка.ДатаОтчета, МИНУТА, РАЗНОСТЬДАТ(&ПустаяДата, ВремяРаботыСотрудниковФакт.Начало, МИНУТА)) КАК ДатаВремяНачала,
	|	ВЫБОР
	|		КОГДА ВремяРаботыСотрудниковФакт.Окончание <> &ПустаяДата
	|			ТОГДА ДОБАВИТЬКДАТЕ(ВремяРаботыСотрудниковФакт.Ссылка.ДатаОтчета, МИНУТА, РАЗНОСТЬДАТ(&ПустаяДата, ВремяРаботыСотрудниковФакт.Окончание, МИНУТА))
	|		ИНАЧЕ &ПустаяДата
	|	КОНЕЦ КАК ДатаВремяОкончания,
	|   РАЗНОСТЬДАТ(ВремяРаботыСотрудниковФакт.Начало, ВремяРаботыСотрудниковФакт.Окончание, МИНУТА) КАК Минуты,
	|	ВремяРаботыСотрудниковФакт.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВременнаяТаблицаВремяРаботыСотрудниковФакт
	|ИЗ
	|	Документ.ЕжедневныйОтчет.ОтработанноеВремя КАК ВремяРаботыСотрудниковФакт
	|ГДЕ
	|	ВремяРаботыСотрудниковФакт.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка"            , ДокументСсылка);
	Запрос.УстановитьПараметр("ПустаяДата"        , Дата(01, 01, 01));
	
	
	Запрос.ВыполнитьПакет();
	СформироватьТаблицаРаботыСотрудника(ДокументСсылка, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти