
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено Тогда 
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Поступление") Тогда
			Контрагент         = ДанныеЗаполнения.Контрагент;
			Склад              = ДанныеЗаполнения.Склад;
			СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиница;
			ОснованиеВозврата  = ДанныеЗаполнения.Ссылка;
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
			                      |	ПоступлениеЗапасы.Номенклатура КАК Номенклатура,
			                      |	ПоступлениеЗапасы.Партия КАК Партия,
			                      |	ПоступлениеЗапасы.Количество КАК Количество,
			                      |	ПоступлениеЗапасы.Цена КАК Цена,
			                      |	ПоступлениеЗапасы.Сумма КАК Сумма,
			                      |	ПоступлениеЗапасы.СтавкаНДС КАК СтавкаНДС,
			                      |	ПоступлениеЗапасы.СуммаНДС КАК СуммаНДС,
			                      |	ПоступлениеЗапасы.Всего КАК Всего,
			                      |	ПоступлениеЗапасы.Упаковка КАК Упаковка,
			                      |	ПоступлениеЗапасы.КоличествоУпаковок КАК КоличествоУпаковок,
			                      |	ПоступлениеЗапасы.Ссылка КАК ОснованиеВозврата,
			                      |	ПоступлениеЗапасы.Ссылка.Договор КАК Договор
			                      |ИЗ
			                      |	Документ.Поступление.Запасы КАК ПоступлениеЗапасы
			                      |ГДЕ
			                      |	ПоступлениеЗапасы.Ссылка = &ДокументОснование");
			Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения.Ссылка);
			
			Запасы.Загрузить(Запрос.Выполнить().Выгрузить());
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств") Тогда	
			Контрагент = ДанныеЗаполнения.Контрагент;			
		КонецЕсли;
	КонецЕсли;

	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	
	СуммаОплачено = 0;
	Договор       = Неопределено; 
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	// Инициализация дополнительных свойств для проведения документа.
	ДвиженияДокументовСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.ВозвратПоставщику.УстановитьНачальныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ДополнительныеСвойства.Вставить("СтруктураПолейПерегрузка", Новый Структура("ОснованиеВозврата", "ОснованиеВозврата"));
	УправлениеЗапасамиПартионныйУчет.СформироватьСписаниеТаблицаПартииТоваров(Ссылка.Запасы, ДополнительныеСвойства, Движения, Отказ);	
	// Движения по регистрам
	ДвиженияДокументовСервер.ЗапасыНаСкладах(ДополнительныеСвойства, Движения, Отказ);   	
	ДвиженияДокументовСервер.ВзаиморасчетыСКонтрагентами(ДополнительныеСвойства, Движения, Отказ); 
	ДвиженияДокументовСервер.ПартииТоваров(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.Управленческий(ДополнительныеСвойства, Движения, Отказ);

	// Запись наборов записей.
	ДвиженияДокументовСервер.ДобавитьНаборыЗаписей(ЭтотОбъект);
	
	
КонецПроцедуры

// Обработка проверки заполнения объекта
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка табличной части на разрешения по значениям 
	Если ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьНулевуюСумму, Ложь) Тогда
		УдаляемыйЭлемент = ПроверяемыеРеквизиты.Найти("Запасы.Сумма");
		Если УдаляемыйЭлемент <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(УдаляемыйЭлемент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

