#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик при создании формы на сервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Загрузить таблицу значениями
	Если Параметры.Свойство("Задачи") И ТипЗнч(Параметры.Задачи) = Тип("Массив") Тогда
		ЗагрузитьЗадачи(Параметры.Задачи);
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработка оповещения формы
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Оповещение об изменении состояния задачи пользователя
	Если (ИмяСобытия = "ЗадачаПользователя" ИЛИ ИмяСобытия = "ЗадачаИзменена" ИЛИ ИмяСобытия = "ЗадачаВыполнена")
			И ТипЗнч(Параметр) = Тип("ЗадачаСсылка.ЗадачаПользователей") Тогда
		ПриИзмененеииСостоянияЗадачи(Параметр);
	ИначеЕсли ИмяСобытия = "ИзмененоСобытие" Тогда	
		ПриИзмененеииСостоянияЗадачи(Параметр);
	КонецЕсли;
	
	// Если ТаблицаЗадач.Количество() = 0 Тогда
	//	Закрыть();
	// КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовУправления   

&НаКлиенте
// Выбор задачи в таблице
Процедура ЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Задачи.ТекущиеДанные;
	
	ТаблицаЗадач.Удалить(ТекущиеДанные);
	Если ТаблицаЗадач.Количество() = 0 Тогда
		Закрыть();
	КонецЕсли;	
	
	ЗадачаПредмет = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ТекущиеДанные.Задача, "ЗадачаПредмет");
	Если ЗначениеЗаполнено(ЗадачаПредмет) Тогда
		ПоказатьЗначение(,ЗадачаПредмет);
	Иначе
		// Открываем форму задачи
    	ФормаЗадачи = ПолучитьФорму("Задача.ЗадачаПользователей.Форма.ФормаЗадачи",Новый Структура("Ключ",ТекущиеДанные.Задача));
    	ФормаЗадачи.Открыть();		
	КонецЕсли;
	
КонецПроцедуры
                                       
&НаКлиенте
// Обработчик выполнения задачи
Процедура ВыполнитьЗадачу(Команда)
	
	ТекущиеДанные = Элементы.Задачи.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 

       ВыполнитьЗадачуСервер(ТекущиеДанные.Задача);
	   
	   ОповеститьОбИзменении(ПредопределенноеЗначение("Задача.ЗадачаПользователей.ПустаяСсылка"));
	   ОповеститьОбИзменении(ПредопределенноеЗначение("Документ.Взаимодействие.ПустаяСсылка"));
   
	   ТаблицаЗадач.Удалить(ТекущиеДанные);
	   
	   Если ТаблицаЗадач.Количество() = 0 Тогда
			Закрыть();
	   КонецЕсли;

	   Оповестить("ИзменениеСпискаВзаимодействий");
	   
     КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработчик прекращения напоминания о задаче
Процедура ПрекратитьНапоминания(Команда)
	
	ТекущиеДанные = Элементы.Задачи.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 
		
	    ПрекратитьНапоминанияСервер(ТекущиеДанные.Задача);
	    ОповеститьОбИзменении(ТекущиеДанные.Задача);
	    ТаблицаЗадач.Удалить(ТекущиеДанные);
		
        Если ТаблицаЗадач.Количество() = 0 Тогда
			Закрыть();
		КонецЕсли;

    КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработчик откладывания выполнения задачи
Процедура ОтложитьНаВремя(Команда)
	
	ТекущиеДанные = Элементы.Задачи.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 

		Интервал = СтрЗаменить(Команда.Имя,"ОтложитьНа","");
		ОтлажитьНаВремяСервер(Интервал,ТекущиеДанные.Задача);
		ТаблицаЗадач.Удалить(ТекущиеДанные);

		Если ТаблицаЗадач.Количество() = 0 Тогда
			Закрыть();
		КонецЕсли;
	
    КонецЕсли;
  
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

&НаСервере
// Выполинть задачу, записать объект 
Процедура ВыполнитьЗадачуСервер(Задача)
	
	ЗадачаОбъект                = Задача.ПолучитьОбъект();
	ЗадачаОбъект.ДатаИсполнения = ТекущаяДата();
	ЗадачаОбъект.Выполнена      = Истина;
	ЗадачаОбъект.Записать();

КонецПроцедуры

&НаСервере
// Прекратить напоминание о задаче, записать объект
Процедура ПрекратитьНапоминанияСервер(Задача)
	
	ЗадачаОбъект                         = Задача.ПолучитьОбъект();
	ЗадачаОбъект.НапоминаниеИспользовать = Ложь;
	ЗадачаОбъект.Записать();
	
КонецПроцедуры

&НаСервере
// Отложить напоминание о задаче, записать объект
Процедура ОтлажитьНаВремяСервер(ОткладываетсяНаВремя,Задача)
	
	ЗадачаОбъект            		   = Задача.ПолучитьОбъект();
	ЗадачаОбъект.НапоминаниеДатаНачала = ТекущаяДата() + ОткладываетсяНаВремя;
	ЗадачаОбъект.Записать();
	
КонецПроцедуры

&НаСервере
// При изменении состояния задачи обновить список задач
Процедура ПриИзмененеииСостоянияЗадачи(Задача)
	
	Если ТипЗнч(Задача) = Тип("ЗадачаСсылка.ЗадачаПользователей") Тогда
		Если Задача.Выполнена ИЛИ НЕ Задача.ИспользоватьНапоминание Тогда
			СтрокиУдаления = ТаблицаЗадач.НайтиСтроки(Новый Структура("Задача",Задача));
			Для Каждого ЭлементМассива Из СтрокиУдаления Цикл
				ТаблицаЗадач.Удалить(ЭлементМассива);
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Задача) = Тип("ДокументСсылка.Событие") Тогда
		Счетчик = 0;
		Пока Счетчик <= ТаблицаЗадач.Количество() - 1 Цикл
			Если ТаблицаЗадач[Счетчик].Задача.ЗадачаПредмет = Задача И Задача.Статус <> Перечисления.СтатусыСобытия.НеПодтверждена Тогда
				ТаблицаЗадач.Удалить(ТаблицаЗадач[Счетчик]);
				Счетчик = Счетчик - 1;
			КонецЕсли;
			Счетчик = Счетчик + 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Выполинть задачу, записать объект 
Процедура ЗагрузитьЗадачи(МассивЗадач) Экспорт
	
	ТаблицаЗадач.Очистить();
	
	Для Каждого ЭлМассива ИЗ МассивЗадач Цикл
			
		НоваяСтрока               = ТаблицаЗадач.Добавить();
		НоваяСтрока.Задача        = ЭлМассива;
		НоваяСтрока.Представление = ЭлМассива.Наименование;
		НоваяСтрока.Картинка      = Истина;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

