
// Функция - Получить количество пациентов из листа ожидания по сотруднику на дату.
//
Функция ПолучитьКоличествоПациентовИзЛистаОжиданияПоСотрудникуНаДату(СтруктурнаяЕдиница, Сотрудник, Дата, ПериодДня = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Дата) ИЛИ НЕ ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИнтервалыЛистаОжидания.Контрагент) КАК КоличествоПациентов
	|ИЗ
	|	РегистрСведений.ИнтервалыЛистаОжидания КАК ИнтервалыЛистаОжидания
	|ГДЕ
	|	ИнтервалыЛистаОжидания.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ИнтервалыЛистаОжидания.Сотрудник = &Сотрудник
	|	И ИнтервалыЛистаОжидания.Дата = &Дата
	|	И &УсловиеПериодДня");
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(Дата));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница));
	
	Запрос.УстановитьПараметр("ПериодДня", ПериодДня);
	
	УсловиеПериодДня = "ИСТИНА";
	Если ЗначениеЗаполнено(ПериодДня) Тогда
		
		Если ТипЗнч(ПериодДня) = Тип("Массив") Тогда
			УсловиеПериодДня = "ИнтервалыЛистаОжидания.ПериодДня В (&ПериодДня)";	
		Иначе
			УсловиеПериодДня = "ИнтервалыЛистаОжидания.ПериодДня = &ПериодДня";	
		КонецЕсли;

		Запрос.УстановитьПараметр("ПериодДня", ПериодДня);
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПериодДня", УсловиеПериодДня);
		
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
	Возврат ?(ЗначениеЗаполнено(РезультатЗапроса), РезультатЗапроса[0].КоличествоПациентов, 0);
			
КонецФункции

// Процедура - Удалить пациента из листа ожидания.
//
Процедура УдалитьПациентаИзЛистаОжидания(СтруктурнаяЕдиница, Сотрудник, Контрагент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница) ИЛИ НЕ ЗначениеЗаполнено(Сотрудник) ИЛИ НЕ ЗначениеЗаполнено(Контрагент) Тогда 
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ИнтервалыЛистаОжидания.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(СтруктурнаяЕдиница);
	НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
	НаборЗаписей.Отбор.Контрагент.Установить(Контрагент);
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	
	Попытка		
		НаборЗаписей.Записать();
	Исключение
	КонецПопытки;
		
КонецПроцедуры

// Функция, возвращает массив актуальных периодов дня по дате.
// 
// Возвращаемое значение:
//   - Массив перечислений ПериодыДня в соответствии с переданной датой.
//	   Если дата не передана, то используется текущая дата сеанса.
//
Функция ПолучитьМассивАктуальныхПериодовДняПоДате(Дата = Неопределено) Экспорт
	
	Результат = Новый_Массив(Перечисления.ПериодыДня.ВесьДень);
	
	Дата = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());
	
	Если Дата >= (НачалоДня(Дата) + 15*60*60) Тогда
		Результат.Добавить(Перечисления.ПериодыДня.Вечер);	
		
	ИначеЕсли Дата >= (НачалоДня(Дата) + 12*60*60) Тогда 
	//	И ТекущаяДата < (НачалоДняДаты + 15*60*60)
		
		Результат.Добавить(Перечисления.ПериодыДня.День);
		Результат.Добавить(Перечисления.ПериодыДня.Вечер);
		
	Иначе
		
		Результат.Добавить(Перечисления.ПериодыДня.Утро);
		Результат.Добавить(Перечисления.ПериодыДня.День);
		Результат.Добавить(Перечисления.ПериодыДня.Вечер);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедура, проверяет и удаляет неактуальные записи листа ожидания.
//
Процедура ПроверитьИУдалитьНеактуальныеЗаписиЛистаОжидания() Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос( 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИнтервалыЛистаОжидания.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ИнтервалыЛистаОжидания.Контрагент КАК Контрагент,
	|	ИнтервалыЛистаОжидания.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(ИнтервалыЛистаОжидания.Дата) КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.ИнтервалыЛистаОжидания КАК ИнтервалыЛистаОжидания
	|
	|СГРУППИРОВАТЬ ПО
	|	ИнтервалыЛистаОжидания.СтруктурнаяЕдиница,
	|	ИнтервалыЛистаОжидания.Контрагент,
	|	ИнтервалыЛистаОжидания.Сотрудник
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ИнтервалыЛистаОжидания.Дата) < &Дата");
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		УдалитьПациентаИзЛистаОжидания(Выборка.СтруктурнаяЕдиница, Выборка.Сотрудник, Выборка.Контрагент);			
	КонецЦикла;
	
КонецПроцедуры
