
#Область СлужебныйПрограммныйИнтерфейс

//////////////// ПРОСТЫЕ ТИПЫ

// Возвращает остаток от деления
// 
// Параметры:
//  Число1 - Число, числитель.
//  Число2 - Число, знаменатель.
// 
// Возвращаемое значение:
//  Число, оостаток от деления.
// 
Функция Ост(Число1, Число2) Экспорт

	Возврат Число1 - Цел(Число1 / Число2) * Число2;

КонецФункции

// Возвращает время с нулевой датой
// 
Функция ВыделитьВремя(ДатаВремя) Экспорт
	
	Возврат Дата(01, 01, 01) + (ДатаВремя - НачалоДня(ДатаВремя));
	
КонецФункции

// Процедура выполняет паузу с указанной длительностью
// 
Процедура Пауза_WScript_Shell(ПродолжительностьСекунд = 1) Экспорт
	
	#Если Не МобильныйКлиент И Не ВебКлиент Тогда
		Системнаяинформация = Новый Системнаяинформация;
		Попытка
			
			Если Системнаяинформация.ТипПлатформы = ТипПлатформы.Windows_x86 Или Системнаяинформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
				ОбъектShell = Новый COMОбъект("WScript.Shell");
				ОбъектShell.Run("ping -n " + СокрЛП(Число(ПродолжительностьСекунд) + 1) + " 127.0.0.1", 0, 1);
			КонецЕсли;
			
		Исключение
			
		КонецПопытки;
	#КонецЕсли

КонецПроцедуры

// Возвращает остаток от деления
// 
// Параметры:
//  Число1 - Число, числитель.
//  Число2 - Число, знаменатель.
// 
// Возвращаемое значение:
//  Число, оостаток от деления.
// 
Функция ПолучитьЗначенияРеквизитовПоСсылке(Ссылка, ПутьКРеквизитам) Экспорт

	// МассивПутьКРеквизитам = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПутьКРеквизитам, ",");
	// Если МассивПутьКРеквизитам.Количество() > 1 Тогда
	// 	// Результат = Новый Структура(ПутьКРеквизитам);
	// 	// Выполнить("Результат = Ссылка." + ПутьКРеквизитам);
	// Иначе
	// 	Результат = Неопределено;
	//    Выполнить("Результат = Ссылка." + ПутьКРеквизитам);
	// КонецЕсли; 
	// 
	// Возврат Результат;
	Возврат ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизитаПоПути(Ссылка, ПутьКРеквизитам);

КонецФункции

// Возвращает остаток от деления
// 
// Параметры:
//  Число1 - Число, числитель.
//  Число2 - Число, знаменатель.
// 
// Возвращаемое значение:
//  Число, оостаток от деления.
// 
Функция ТекущаяСервернаяДата() Экспорт

	Возврат ОбщегоНазначенияСтоматология.ТекущаяСервернаяДатаНаСервере();

КонецФункции

// Возвращает остаток от деления
// 
// Параметры:
//  Число1 - Число, числитель.
//  Число2 - Число, знаменатель.
// 
// Возвращаемое значение:
//  Число, оостаток от деления.
// 
Функция ДатаДокумента(ОбъектДокумент) Экспорт

	Возврат ?(ОбъектДокумент.Ссылка.Пустая() ИЛИ День(ОбъектДокумент.Дата) = День(ТекущаяДата()), ОбщегоНазначенияСтоматология.ТекущаяСервернаяДатаНаСервере(), ОбъектДокумент.Дата);

КонецФункции

// Функция - Конвертировать hex в dec
// 
Функция КонвертироватьHexВDec(Знач ЧислоСтрокой) Экспорт
	
	Результат = 0;
	Шаблон = "0123456789ABCDEF";
	
	ЧислоСтрокой = ВРег(Строка(ЧислоСтрокой));
    Для ТекущийСимвол = 1 По СтрДлина(ЧислоСтрокой) Цикл
        ПозицияВШаблоне = Найти(Шаблон, Сред(ЧислоСтрокой, ТекущийСимвол, 1))-1;
        Результат = Результат * СтрДлина(Шаблон) + ПозицияВШаблоне;
    КонецЦикла;

    Возврат Результат;

КонецФункции

// Функция, конвертирует dec в hex.
//
Функция КонвертироватьDecВHex(Знач Число) Экспорт
	
	Результат = "";
	Шаблон = "0123456789ABCDEF";
	
	Пока Число > 0 Цикл
		ЦифраHex	 = Сред(Шаблон, (Число % 16) + 1, 1);
		Результат	 = ЦифраHex + Результат;
		Число		 = Цел(Число / 16);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
// Функция - Получить RGBЦвет
//
// Параметры:
//  Цвет		 - 	 - 
//  Вернуть_HEX	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьRGBЦвет(Знач Цвет, Вернуть_HEX = Ложь, МакетСоответствиеЦветовWebИRGB = Неопределено, ВернутьСтруктуру = Ложь, ВернутьHTMLЦвет = Ложь) Экспорт
	
	ЦветРезультат = ?(ВернутьСтруктуру, Неопределено, "");
	
	// Переменная Цвет не определена
	Если Цвет = Неопределено Тогда
		Возврат ЦветРезультат;
	КонецЕсли;
	
	//ЦветНайден = Ложь;
	//// Приводим цвет стиля к простому RGB, Абсолютному, Windows-цвету
	//Если Цвет.Вид = ВидЦвета.ЭлементСтиля Тогда 
	//	
	//	ОбъектМетаданныхСтиля = Метаданные.ЭлементыСтиля.Найти(Сред(Строка(Цвет), 8));
	//	
	//	Если ОбъектМетаданныхСтиля <> Неопределено Тогда 
	//		Цвет = ОбъектМетаданныхСтиля.Значение;
	//	Иначе
	//		ЦветРезультат = СокрЛП(ПолучитьЦветИзСтиляПлатформы(Цвет)); // вернёт hex, т.е. 16-ричный;
	//		
	//		Если ЗначениеЗаполнено(ЦветРезультат) Тогда
	//			
	//			Красный = КонвертироватьHexВDec(Сред(ЦветРезультат, 2, 2)); 
	//			Зеленый = КонвертироватьHexВDec(Сред(ЦветРезультат, 4, 2));
	//			Синий   = КонвертироватьHexВDec(Сред(ЦветРезультат, 6, 2));
	//			
	//			Если ВернутьСтруктуру Тогда 
	//				ЦветРезультат = Новый Структура("Красный, Зеленый, Синий", Красный, Зеленый, Синий);	
	//			Иначе	
	//				ЦветРезультат = "" + Красный + "," + Зеленый + "," + Синий;
	//			КонецЕсли;
	//			ЦветНайден = Истина; // что бы не зашел в последнее условие
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//			
	//КонецЕсли;	
	//
	//Если Цвет.Вид = ВидЦвета.Абсолютный Тогда
	//	
	//	Если ВернутьСтруктуру Тогда 
	//		ЦветРезультат = Новый Структура("Красный, Зеленый, Синий", Цвет.Красный, Цвет.Зеленый, Цвет.Синий);	
	//	Иначе	
	//		ЦветРезультат = Строка(Цвет.Красный) + "," + Строка(Цвет.Зеленый) + "," + Строка(Цвет.Синий);
	//	КонецЕсли;
	//	
	//// Получаем RGB цвет из макета
	//ИначеЕсли Цвет.Вид = ВидЦвета.WebЦвет Тогда
	//	
	//	Если МакетСоответствиеЦветовWebИRGB = Неопределено Тогда 
	//		МакетСоответствиеЦветовWebИRGB = ПолучитьОбщийМакет("СоответствиеЦветовWebИRGB");
	//	КонецЕсли;

	//	ЦветИмяПриведеное = Строка(Цвет);
	//	ЦветИмяПриведеное = Сред(ЦветИмяПриведеное, СтрНайти(ЦветИмяПриведеное, "(") + 1);
	//	ЦветИмяПриведеное = Сред(ЦветИмяПриведеное, 1, СтрНайти(ЦветИмяПриведеное, ")") - 1);
	//	НайденнаяОбластьСоответствияИмениЦвета = МакетСоответствиеЦветовWebИRGB.НайтиТекст(ЦветИмяПриведеное, , МакетСоответствиеЦветовWebИRGB.Область("ДанныеСоответствияЦветов|ИмяЦвета"), , Истина, , Истина);
	//	
	//	Если НайденнаяОбластьСоответствияИмениЦвета <> Неопределено Тогда
	//		
	//		НайденнаяОбластьСоответствияRGB = МакетСоответствиеЦветовWebИRGB.Область(НайденнаяОбластьСоответствияИмениЦвета.Верх, МакетСоответствиеЦветовWebИRGB.Область("RGB").Лево);
	//		
	//		Если НайденнаяОбластьСоответствияRGB <> Неопределено Тогда
	//			
	//			ЦветРезультат = НайденнаяОбластьСоответствияRGB.Текст;
	//			Если ВернутьСтруктуру Тогда 
	//				
	//				МассивЦветов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ЦветРезультат);	
	//				Если ЗначениеЗаполнено(МассивЦветов) 
	//					И МассивЦветов.Количество() = 3 Тогда   
	//					
	//					ЦветРезультат = Новый Структура("Красный, Зеленый, Синий", Число(МассивЦветов[0]), Число(МассивЦветов[1]), Число(МассивЦветов[2]));	
	//				КонецЕсли;

	//			КонецЕсли;	
	//							
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//ИначеЕсли Цвет.Вид = ВидЦвета.WindowsЦвет 
	//	ИЛИ Цвет.Вид = ВидЦвета.ЭлементСтиля И Не ЦветНайден Тогда
	
	ТекстХТМЛДокумента = "";
	Шаблон = "0123456789ABCDEF";
	ФорматированныйДокумент = Новый ФорматированныйДокумент; 
	ФорматированныйДокумент.Добавить("ОпределениеЦвета", Тип("ТекстФорматированногоДокумента")); 
	ФорматированныйДокумент.Элементы[0].Элементы[0].ЦветФона = Новый Цвет(1, 1, 1); 
	ФорматированныйДокумент.Элементы[0].Элементы[0].ЦветФона = Цвет; 
	ФорматированныйДокумент.ПолучитьHTML(ТекстХТМЛДокумента, Новый Структура); 
	НомерСимволаЦвета = СтрНайти(ТекстХТМЛДокумента, "background-color: #"); 
	
	// Если не удалось определить цвет (не найдена искомая подстрока) - берем серый.
	ЦветРезультатHex = ?(НомерСимволаЦвета, Сред(ТекстХТМЛДокумента, НомерСимволаЦвета + 19, 6), "f2f2f2");
	
	Если ВернутьHTMLЦвет = Истина Тогда
		Возврат "#" + ЦветРезультатHex;
	КонецЕсли;
	
	Красный = КонвертироватьHexВDec(Сред(ЦветРезультатHex, 1, 2)); 
	Зеленый = КонвертироватьHexВDec(Сред(ЦветРезультатHex, 3, 2));
	Синий   = КонвертироватьHexВDec(Сред(ЦветРезультатHex, 5, 2));
	
	Если ВернутьСтруктуру Тогда 
		ЦветРезультат = Новый Структура("Красный, Зеленый, Синий", Красный, Зеленый, Синий);	
	Иначе	
		ЦветРезультат = "" + Красный + "," + Зеленый + "," + Синий;
	КонецЕсли;
		
	//ИначеЕсли Цвет.Вид = ВидЦвета.АвтоЦвет Тогда
	//	// Пустой цвет (определяется элементом владельцем, не содержит сам цвет)
	//КонецЕсли;
	
	Возврат ЦветРезультат;

КонецФункции

&НаСервере
// Функция - Получить цвет из стиля платформы
//
// Параметры:
//  Цвет - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЦветИзСтиляПлатформы(Цвет) Экспорт
	
	Попытка
		
		ТабДок = Новый ТабличныйДокумент;
		
		ТабДок.Область(1,1,1,1).ЦветФона = Цвет;
		ВремФайл = ПолучитьИмяВременногоФайла("htm");
		ТабДок.Записать(ВремФайл,ТипФайлаТабличногоДокумента.HTML);
		
		КодПоиска = "tr.R0 td.R0C0{ background-color:"; // если 1С изменит формат, эту строку придётся поменять
		
		ТабДок = Новый ТекстовыйДокумент;
		
		ТабДок.Прочитать(ВремФайл);
		Стр = ТабДок.ПолучитьТекст();
		Позиция = Найти(Стр,КодПоиска);
		
		Если Позиция <> 0 Тогда	
			Возврат ВРег(Сред(Стр, Позиция + СтрДлина(КодПоиска),8));
		КонецЕсли;
		
		Возврат "";	
	Исключение
		Возврат "";	
	КонецПопытки;
	
КонецФункции

&НаСервере
// Функция - Получить структурную единицу
// 
// Параметры:
//  IDUnit	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПроверитьСсылкаБитая(Ссылка) Экспорт
	
	// Без прив. режима пытаемся получить ссылку, если запрос пустой, значит ссылка не доступна сотруднику
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|    Ссылка
	|ИЗ
	|    [ИмяТаблицы]
	|ГДЕ
	|    Ссылка = &Ссылка
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[ИмяТаблицы]", Метаданные.НайтиПоТипу(ТипЗнч(Ссылка)).ПолноеИмя());
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции

//////////// ТАБЛИЦЫ

// Функция выполняет добавление номенклатуры в ТЧ
// 
Функция ТаблицуЗначенийВМассивСтруктур(ТаблицаЗначений, ИменаКолонок = Неопределено, СтруктураОтбора = Неопределено) Экспорт 
	
	Результат = Новый Массив;
	Если ИменаКолонок = Неопределено Тогда
		ИменаКолонок = "";
		Если ТипЗнч(ТаблицаЗначений) = Тип("ТаблицаЗначений") Тогда
			Для Каждого КолонкаТЗ Из ТаблицаЗначений.Колонки Цикл
				ИменаКолонок = ИменаКолонок + КолонкаТЗ.Имя + ",";
			КонецЦикла;
		Иначе // Табличная часть
			Для Каждого КолонкаТЗ Из ТаблицаЗначений.Выгрузить().Колонки Цикл
				ИменаКолонок = ИменаКолонок + КолонкаТЗ.Имя + ",";
			КонецЦикла;
		КонецЕсли;
		ИменаКолонок = Сред(ИменаКолонок, 1, СтрДлина(ИменаКолонок) - 1);
	КонецЕсли;
	
	Для Каждого СтрокаТЗ Из ТаблицаЗначений Цикл
		СтрокаТЗСтруктура = Новый Структура(ИменаКолонок);
		ЗаполнитьЗначенияСвойств(СтрокаТЗСтруктура, СтрокаТЗ);
		СтрокаУдовлетворяетОтбору = Истина;
		Если СтруктураОтбора <> Неопределено Тогда
			Для каждого ЭлементОтбора Из СтруктураОтбора Цикл
				Если СтрокаТЗ[ЭлементОтбора.Ключ] <> ЭлементОтбора.Значение Тогда
					СтрокаУдовлетворяетОтбору = Ложь;
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли;
		Если СтрокаУдовлетворяетОтбору = Истина Тогда
			Результат.Добавить(СтрокаТЗСтруктура);
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция выполняет добавление номенклатуры в ТЧ
// 
Функция СтрокуТаблицыЗначенийВСтруктуру(СтрокаТЗ, ИменаКолонокТаблицаЗначений) Экспорт 
	
	Если ТипЗнч(ИменаКолонокТаблицаЗначений) = Тип("Строка") Тогда
	    ИменаКолонок = ИменаКолонокТаблицаЗначений;
	ИначеЕсли ТипЗнч(ИменаКолонокТаблицаЗначений) = Тип("ТаблицаЗначений") Тогда
		ИменаКолонок = "";
		Для Каждого КолонкаТЗ Из ИменаКолонокТаблицаЗначений.Колонки Цикл
			ИменаКолонок = ИменаКолонок + КолонкаТЗ.Имя + ",";
		КонецЦикла;
		ИменаКолонок = Сред(ИменаКолонок, 1, СтрДлина(ИменаКолонок) - 1);
	Иначе
		ИменаКолонок = "";
	КонецЕсли;
	
	Результат = Новый Структура(ИменаКолонок);
	ЗаполнитьЗначенияСвойств(Результат, СтрокаТЗ);
	
	Возврат Результат;
	
КонецФункции

// Возвращает результат проверки равенства таблиц
// 
Функция СравнитьТаблицы(Знач ТаблицаЗначений1, Знач ТаблицаЗначений2, СовпадениеПоПозициям = Истина, СписокКолонокСтрокой = "") Экспорт

	Если ТипЗнч(ТаблицаЗначений1) <> Тип("ТаблицаЗначений") Тогда
		ТаблицаЗначений1 = ТаблицаЗначений1.Выгрузить();
	КонецЕсли;
	Если ТипЗнч(ТаблицаЗначений2) <> Тип("ТаблицаЗначений") Тогда
		ТаблицаЗначений2 = ТаблицаЗначений2.Выгрузить();
	КонецЕсли;
	
	Если СписокКолонокСтрокой = "" Тогда
		Для Каждого КолонкаТаблицы Из ТаблицаЗначений1.Колонки Цикл
			СписокКолонокСтрокой = СписокКолонокСтрокой + ?(ЗначениеЗаполнено(СписокКолонокСтрокой), ",", "") + КолонкаТаблицы.Имя;
		КонецЦикла;		
	КонецЕсли; 
	
	// Таблица 1 к таблице 2
	Для а = 1 По ТаблицаЗначений1.Количество() Цикл
		ВремСтруктураПоиска = Новый Структура(СписокКолонокСтрокой);
		ЗаполнитьЗначенияСвойств(ВремСтруктураПоиска, ТаблицаЗначений1[а-1]);
		Если ТаблицаЗначений2.Количество() < а 
				ИЛИ СовпадениеПоПозициям = Ложь И ТаблицаЗначений2.НайтиСтроки(ВремСтруктураПоиска).Количество() = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		Для Каждого ИмяКолонки Из СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокКолонокСтрокой, ",") Цикл			
			Если ТаблицаЗначений2.Колонки.Найти(ИмяКолонки) = Неопределено
					ИЛИ СовпадениеПоПозициям = Истина И ТаблицаЗначений1[а-1][ИмяКолонки] <> ТаблицаЗначений2[а-1][ИмяКолонки] Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Таблица 2 к таблице 1
	Для а = 1 По ТаблицаЗначений2.Количество() Цикл
		ВремСтруктураПоиска = Новый Структура(СписокКолонокСтрокой);
		ЗаполнитьЗначенияСвойств(ВремСтруктураПоиска, ТаблицаЗначений2[а-1]);
		Если ТаблицаЗначений1.Количество() < а 
				ИЛИ СовпадениеПоПозициям = Ложь И ТаблицаЗначений1.НайтиСтроки(ВремСтруктураПоиска).Количество() = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		Для Каждого ИмяКолонки Из СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокКолонокСтрокой, ",") Цикл			
			Если ТаблицаЗначений1.Колонки.Найти(ИмяКолонки) = Неопределено
					ИЛИ СовпадениеПоПозициям = Истина И ТаблицаЗначений2[а-1][ИмяКолонки] <> ТаблицаЗначений1[а-1][ИмяКолонки] Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Истина;

КонецФункции

// Возвращает результат проверки равенства таблиц
// 
Функция МассивСтрокТаблицыВТаблицуЗначений(Знач МассивСтрокТаблицыЗначений, ЗначТаблицаЗначений) Экспорт

	РезультатТаблицаЗначений = ЗначТаблицаЗначений.СкопироватьКолонки();
	
	Для Каждого ЭлементСтроки Из ЗначТаблицаЗначений Цикл
		НоваяСтрока = РезультатТаблицаЗначений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементСтроки);
	КонецЦикла;		
		
	Возврат РезультатТаблицаЗначений;

КонецФункции

// Дополняет таблицу значений-приемник данными из таблицы значений-источник
// 
// Параметры:
//  ТаблицаИсточник - Таблица значений - таблица из которой будут браться строки для заполнения
//  ТаблицаПриемник - Таблица значений - таблица в которую будут добавлены строки из таблицы-источника
//  
Процедура ДополнитьТаблицуИсточником(ТаблицаИсточник, ТаблицаПриемник, ДобавитьСсылкуНаСтрокуИсточник_Имя = "") Экспорт
	
	Для каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
		НоваяСтрока = ТаблицаПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыИсточник);
		Если ДобавитьСсылкуНаСтрокуИсточник_Имя <> "" Тогда
			Если ТипЗнч(ТаблицаПриемник) = Тип("ТаблицаЗначений") И ТаблицаПриемник.Колонки.Найти(ДобавитьСсылкуНаСтрокуИсточник_Имя) = Неопределено Тогда
				ТаблицаПриемник.Колонки.Добавить(ДобавитьСсылкуНаСтрокуИсточник_Имя);
			КонецЕсли; 
			НоваяСтрока[ДобавитьСсылкуНаСтрокуИсточник_Имя] = СтрокаТаблицыИсточник;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Последовательности пакеты услуг при записи
// 
// Параметры:
//  Источник - 	 - 
//  Отказ	 - 	 - 
// 
Процедура ДобавитьСтрокуВТаблицу(Таблица, ИменаКолонок, Поле_1 = Неопределено, Поле_2 = Неопределено, Поле_3 = Неопределено, Поле_4 = Неопределено, Поле_5 = Неопределено) Экспорт
	
	НоваяСтрока = Таблица.Добавить();
	
	МассивИменКолонок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаКолонок, ",");
	МассивЗначений = Новый_Массив(Поле_1, Поле_2, Поле_3, Поле_4, Поле_5);
	ИндексЗначения = 0;
	Для Каждого ИмяКолонки Из МассивИменКолонок Цикл
		НоваяСтрока[ИмяКолонки] = МассивЗначений[ИндексЗначения];
		ИндексЗначения = ИндексЗначения + 1;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
// Функция - Проверка наличия колонки
// 
Функция ПроверкаНаличияКолонки(Таблица, ИмяКолонки) Экспорт
    
	Если ТипЗнч(Таблица) = Тип("ТаблицаЗначений") Тогда
		Возврат (Таблица.Колонки.Найти(ИмяКолонки) <> Неопределено);
		
	ИначеЕсли СтрНайти(Строка(ТипЗнч(Таблица)), "табличная часть:") > 0 Тогда
		Возврат (Таблица.ВыгрузитьКолонки().Колонки.Найти(ИмяКолонки) <> Неопределено);
		
	Иначе
		Возврат ЛОЖЬ;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
// Функция - Получить таблицу из динамического списка
// 
Функция ПолучитьТаблицуИзДинамическогоСписка(ДинамическийСписок) Экспорт
    
	Запрос = Новый Запрос;
	
	// Текст запроса
	Запрос.Текст = ДинамическийСписок.ТекстЗапроса;
	
	// Заполняем параметры
	Для Каждого ПараметрДС Из ДинамическийСписок.Параметры.Элементы Цикл
		Если ПараметрДС.Использование = Истина Тогда
			Запрос.УстановитьПараметр(Строка(ПараметрДС.Параметр), ПараметрДС.Значение);
		КонецЕсли;
	КонецЦикла;
	// Разобраться с вложенными параметрами
	
	// Заполняем отборы
	Для Каждого ОтборДС Из ДинамическийСписок.Отбор.Элементы Цикл
		Если ОтборДС.Использование = Истина Тогда
			// пока не реализованно
		КонецЕсли;
	КонецЦикла;	
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции


//////////// ДЕРЕВО ЗНАЧЕНИЙ

// Процедура - Скопировать строку дерева значений
// 
Процедура СкопироватьСтрокуДереваЗначений(Дерево, КопируемаяСтрока, НовыйРодитель) Экспорт
    
	НоваяСтрока = НовыйРодитель.Строки.Добавить(); 
	ЗаполнитьЗначенияСвойств(НоваяСтрока, КопируемаяСтрока); 
	
	Для Каждого СтрокаКопируемойСтроки ИЗ КопируемаяСтрока.Строки Цикл 
		СкопироватьСтрокуДереваЗначений(Дерево, СтрокаКопируемойСтроки, НоваяСтрока); 
	КонецЦикла; 
	
КонецПроцедуры

// Процедура - Переместить строку дерева значений
// 
Процедура ПереместитьСтрокуДереваЗначений(Дерево, ПеремещаемаяСтрока, НовыйРодитель) Экспорт
    
	НоваяСтрока = НовыйРодитель.Строки.Добавить(); 
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ПеремещаемаяСтрока); 
	
	МассивПеремещаемаяСтрокаСтроки = Новый Массив;     // Механизм что б после удаление не пропускать следущие элементы-строки
	Для Каждого СтрокаПеремещаемойСтроки ИЗ ПеремещаемаяСтрока.Строки Цикл 
		МассивПеремещаемаяСтрокаСтроки.Добавить(СтрокаПеремещаемойСтроки);
	КонецЦикла;
	Для Каждого СтрокаПеремещаемойСтроки ИЗ МассивПеремещаемаяСтрокаСтроки Цикл 
		ПереместитьСтрокуДереваЗначений(Дерево, СтрокаПеремещаемойСтроки, НоваяСтрока); 
	КонецЦикла; 
	
	Дерево.Строки.Удалить(ПеремещаемаяСтрока); 
        
КонецПроцедуры

// Устанавливает значение реквизита в дереве, возможно рекурсивное заполнение внутрь дерева
// 
Функция УстановитьЗначениеДерева(Дерево, ИмяПоля, ЗначениеПоля, Рекурсивно = Ложь) Экспорт

	Дерево[ИмяПоля] = ЗначениеПоля;
	
	Для каждого СтрокаДерева Из Дерево.Строки Цикл
		Если Рекурсивно = Истина Тогда
			УстановитьЗначениеДерева(СтрокаДерева, ИмяПоля, ЗначениеПоля, Истина);
		КонецЕсли;
	КонецЦикла; 

КонецФункции
 
&НаСервере
// Функция - Выгрузить дерево значений в таблицу
// 
Функция ВыгрузитьДеревоЗначенийВТаблицу(Дерево, ВыгружатьГруппы = Истина, Результат = Неопределено) Экспорт

	Если Результат = Неопределено Тогда
		Результат = Новый ТаблицаЗначений;
		Для каждого Колонка Из Дерево.Колонки Цикл
			Результат.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;		
	КонецЕсли; 
	
	Если НЕ (ВыгружатьГруппы = Ложь И Дерево.Строки.Количество() > 0)
			И ТипЗнч(Дерево) = Тип("СтрокаДереваЗначений") Тогда
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Дерево);
	КонецЕсли;
		
	Для каждого СтрокаДерева Из Дерево.Строки Цикл
		ВыгрузитьДеревоЗначенийВТаблицу(СтрокаДерева, ВыгружатьГруппы, Результат);
	КонецЦикла;
	
	Возврат Результат;

КонецФункции


//////////// МАССИВЫ

// См. Об.ОбщегоНазначения.СравнитьМассивы
// Функция выполняет добавление номенклатуры в ТЧ 
// 
//Функция СравнитьМассивы(Массив1, Массив2, СравнитьПоэлементно = Истина) Экспорт 
//	
//	Если СравнитьПоэлементно = Истина Тогда
//		
//		Если Массив1.Количество() <> Массив2.Количество() Тогда
//			Возврат Ложь;
//		КонецЕсли;
//		Для а=0 По Массив1.Количество()-1 Цикл
//			Если Массив1[а] <> Массив2[а] Тогда
//				Возврат Ложь;
//			КонецЕсли;
//		КонецЦикла;
//		
//	Иначе
//		
//		Для Каждого ЭлементМассива Из Массив1 Цикл
//			Если Массив2.Найти(ЭлементМассива) = Неопределено Тогда
//				Возврат Ложь;
//			КонецЕсли;
//		КонецЦикла;
//				
//		Для Каждого ЭлементМассива Из Массив2 Цикл
//			Если Массив1.Найти(ЭлементМассива) = Неопределено Тогда
//				Возврат Ложь;
//			КонецЕсли;
//		КонецЦикла;
//		
//	КонецЕсли; 
//	
//	Возврат Истина;
//	
//КонецФункции

// Функция создает массив сразу с элементами, до 25 штук
// 
Функция Новый_Массив(Знач П1=Null, Знач П2=Null, Знач П3=Null, Знач П4=Null, Знач П5=Null, Знач П6=Null, Знач П7=Null, Знач П8=Null, Знач П9=Null, 
				Знач П10=Null, Знач П11=Null, Знач П12=Null, Знач П13=Null, Знач П14=Null, Знач П15=Null) Экспорт
	
	Результат = Новый Массив;
	
	Если П1<>Null Тогда
		Результат.Добавить(П1);
	КонецЕсли;
	Если П2<>Null Тогда
		Результат.Добавить(П2);
	КонецЕсли;
	Если П3<>Null Тогда
		Результат.Добавить(П3);
	КонецЕсли;
	Если П4<>Null Тогда
		Результат.Добавить(П4);
	КонецЕсли;
	Если П5<>Null Тогда
		Результат.Добавить(П5);
	КонецЕсли;
	Если П6<>Null Тогда
		Результат.Добавить(П6);
	КонецЕсли;
	Если П7<>Null Тогда
		Результат.Добавить(П7);
	КонецЕсли;
	Если П8<>Null Тогда
		Результат.Добавить(П8);
	КонецЕсли;
	Если П9<>Null Тогда
		Результат.Добавить(П9);
	КонецЕсли;
	Если П10<>Null Тогда
		Результат.Добавить(П10);
	КонецЕсли;
	Если П11<>Null Тогда
		Результат.Добавить(П11);
	КонецЕсли;
	Если П12<>Null Тогда
		Результат.Добавить(П12);
	КонецЕсли;
	Если П13<>Null Тогда
		Результат.Добавить(П13);
	КонецЕсли;
	Если П14<>Null Тогда
		Результат.Добавить(П14);
	КонецЕсли;
	Если П15<>Null Тогда
		Результат.Добавить(П15);
	КонецЕсли;
	// Если П16<>Null Тогда
	// 	Результат.Добавить(П16);
	// КонецЕсли;
	// Если П17<>Null Тогда
	// 	Результат.Добавить(П17);
	// КонецЕсли;
	// Если П18<>Null Тогда
	// 	Результат.Добавить(П18);
	// КонецЕсли;
	// Если П19<>Null Тогда
	// 	Результат.Добавить(П19);
	// КонецЕсли;
	// Если П20<>Null Тогда
	// 	Результат.Добавить(П20);
	// КонецЕсли;
	// Если П21<>Null Тогда
	// 	Результат.Добавить(П21);
	// КонецЕсли;
	// Если П22<>Null Тогда
	// 	Результат.Добавить(П22);
	// КонецЕсли;
	// Если П23<>Null Тогда
	// 	Результат.Добавить(П23);
	// КонецЕсли;
	// Если П24<>Null Тогда
	// 	Результат.Добавить(П24);
	// КонецЕсли;
	// Если П25<>Null Тогда
	// 	Результат.Добавить(П25);
	// КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Функция - Итого в массиве строк
// 
Функция ИтогоВМассивеСтрок(МассивСтрокТаблицы, ИмяКолонки) Экспорт

	Результат = 0;
	
	Для каждого ЭлементМассив Из МассивСтрокТаблицы Цикл
		Результат = Результат + ЭлементМассив[ИмяКолонки];
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

// Функция выполняет добавление номенклатуры в ТЧ
// 
Функция ПроверитьВхождениеМассива(МассивИсточник, МассивПриемник) Экспорт 
	
	Для Каждого ЭлементМассива Из МассивИсточник Цикл
		Если МассивПриемник.Найти(ЭлементМассива) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
// Функция преобразует массив структур с одинаковым набором параметров в таблицу значений.
//
Функция МассивСтруктурВТаблицуЗначенийСтоматология(МассивСтруктур, МассивКолонок = Неопределено) Экспорт
		
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	Если МассивСтруктур.Количество() > 0 Тогда
					
		Для Каждого РеквизитСтруктуры Из МассивСтруктур[0] Цикл
			
			Если НЕ МассивКолонок = Неопределено И ТипЗнч(МассивКолонок) = Тип("Массив") Тогда 
				Если МассивКолонок.Найти(РеквизитСтруктуры.Ключ) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ТипЗнч(РеквизитСтруктуры.Значение));
			ТаблицаЗначений.Колонки.Добавить(РеквизитСтруктуры.Ключ, Новый ОписаниеТипов(МассивТипов,,,, Новый КвалификаторыСтроки(1024)));
		КонецЦикла;
		
		Для Каждого Структура Из МассивСтруктур Цикл
			НоваяСтрока = ТаблицаЗначений.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Структура);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаЗначений;
		
КонецФункции

//////////// JSON

// Функция - Кодировать в JSON
// 
Функция КодироватьВJSON(Объект, ИспользоватьПереносСтроки = Истина, НастройкиСериализацииJSON = Неопределено) Экспорт
	
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(?(ИспользоватьПереносСтроки = Ложь, ПереносСтрокJSON.Нет, ПереносСтрокJSON.Авто));		
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
		ЗаписатьJSON(ЗаписьJSON, Объект, НастройкиСериализацииJSON);		
		Возврат ЗаписьJSON.Закрыть();
		
	#Иначе
		Возврат "";		
	#КонецЕсли
 
КонецФункции
 
// Функция - Декодировать из JSON
// 
Функция ДекодироватьИзJSON(ТекстJSON, ИменаСвойствСоЗначениямиДата = Неопределено) Экспорт
	
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент  Тогда		
		// Создание и открытие для работы JSON
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстJSON);
		
		// Чтение данных JSON из тела
		Возврат ПрочитатьJSON(ЧтениеJSON,,ИменаСвойствСоЗначениямиДата);
	#Иначе
		Возврат Неопределено;
		
	#КонецЕсли

КонецФункции

// Функция конвертирует результат выполнения функции XTDO в структуру
// 
Функция ФабрикаXDTOВСтроковоеПредставление(СтруктураXDTO, Отступ = "") Экспорт
	
	Результат = "";
	
	Если ТипЗнч(СтруктураXDTO) = Тип("СписокXDTO") Тогда
		Результат = "(Список - " + СтруктураXDTO.Количество() + " стр.)";
		Для Каждого ЭлементСпискаСвойстваXTDO Из СтруктураXDTO Цикл
			Результат = Результат + Символы.ПС + Отступ + "	" + ФабрикаXDTOВСтроковоеПредставление(ЭлементСпискаСвойстваXTDO, Отступ + "	");
		КонецЦикла;
	ИначеЕсли ТипЗнч(СтруктураXDTO) = Тип("ОбъектXDTO") Тогда
		Результат = "(Структура - " + СтруктураXDTO.Свойства().Количество() + " Эл.)";
		Для Каждого СвойствоXTDO Из СтруктураXDTO.Свойства() Цикл
			Результат = Результат + Символы.ПС + Отступ + "	" + СвойствоXTDO.Имя + ": " + ФабрикаXDTOВСтроковоеПредставление(СтруктураXDTO[СвойствоXTDO.Имя], Отступ + "	");
		КонецЦикла;
	ИначеЕсли ТипЗнч(СтруктураXDTO) = Тип("ДвоичныеДанные") Тогда
		Результат = "...";
	Иначе
		Результат = Строка(СтруктураXDTO);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


// ПРОЧЕЕ

&НаСервере
// Функция - Получить структурную единицу
// 
// Параметры:
//  IDUnit	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьСсылкуОбъектаПоUID(ВидОбъекта, ИмяОбъекта, ID, ВызыватьИсключение = Ложь, Отказ = Ложь) Экспорт
	
	Результат = Неопределено;
	
	ПОПЫТКА
		
		IDСсылка = Новый УникальныйИдентификатор(ID);
		
		Если ВидОбъекта = "Справочники" Тогда
			Результат = Справочники[ИмяОбъекта].ПолучитьСсылку(IDСсылка);
		ИначеЕсли ВидОбъекта = "Документы" Тогда
			Результат = Документы[ИмяОбъекта].ПолучитьСсылку(IDСсылка);
		ИначеЕсли ВидОбъекта = "Задачи" Тогда
			Результат = Задачи[ИмяОбъекта].ПолучитьСсылку(IDСсылка);
		Иначе
			Отказ = Истина;
		КонецЕсли;
		
		Если Результат <> Неопределено И Результат.ПолучитьОбъект() = Неопределено Тогда
			Отказ = Истина;
		КонецЕсли;
		
	ИСКЛЮЧЕНИЕ
		Отказ = Истина;
		
	КОНЕЦПОПЫТКИ;
		
	Если Отказ = Истина И ВызыватьИсключение = Истина Тогда
		ВызватьИсключение "Ссылка на объект '" + ИмяОбъекта + "' по uID='" + ID + "' не найдена!"
	КонецЕсли;
	
	// Если Результат = Неопределено Тогда
	// 	Результат = Справочники[ИмяОбъекта].ПустаяСсылка();
	// КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции

// Возвращает остаток от деления
// 
// Параметры:
//  Число1 - Число, числитель.
//  Число2 - Число, знаменатель.
// 
// Возвращаемое значение:
//  Число, оостаток от деления.
// 
Функция ТекущаяДатаСервера() Экспорт

	Возврат ОбщегоНазначенияСтоматология.ТекущаяСервернаяДатаНаСервере();

КонецФункции

&НаКлиенте
// Функция, возвращает форму, если она открыта.
//
// Параметры:
//  ИмяФормы - Строка - Имя формы, которую нужно получить - совпадает со 
//  Значение реквизита формы "ИмяФормы". Возвращается первая найденная форма.
// 
// Возвращаемое значение:
//  ФормаКлиентскогоПриложения, Неопределено - Объект найденной открытой 
//  Формы или значение "Неопределено", если форма не найдена.
//
Функция ПолучитьОткрытуюФорму(ИмяФормы) Экспорт
	
	ОкнаКлиентскогоПриложения = ПолучитьОкна();
	
	Для Каждого ОкноКлиентскогоПриложения Из ОкнаКлиентскогоПриложения Цикл
		Для Каждого Форма Из ОкноКлиентскогоПриложения.Содержимое Цикл
			Если Форма.ИмяФормы = ИмяФормы Тогда
				Возврат Форма;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Не удалось найти открытую форму.
	Возврат Неопределено;
	
КонецФункции

// Функция, возвращает строку без недопустимых символов справа.
//
Функция УдалитьНедопустимыеСимволыСправа(Знач Строка) Экспорт
	
	Если Не ЗначениеЗаполнено(Строка) Или ТипЗнч(Строка) = Тип("Строка") Тогда
		Возврат Строка;
	КонецЕсли;
	
	Пока Истина Цикл
		
		Если Не ЗначениеЗаполнено(Строка) Тогда
			Возврат НСтр("ru = '(недопустимые символы)'; en = '(forbidden symbols)'");
		КонецЕсли;
		
		ДлинаСтроки = СтрДлина(Строка);
		
		КодСимвола = КодСимвола(Строка, ДлинаСтроки);
		
		Если Не (КодСимвола = 0 Или КодСимвола = 9 Или КодСимвола = 10 Или КодСимвола = 13
			Или (КодСимвола >= 32 И КодСимвола <= 55295)
			Или (КодСимвола >= 57344 И КодСимвола <= 65533)) Тогда
			
			Строка = Лев(Строка, ДлинаСтроки - 1);
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Строка;
	
КонецФункции

// Функция, преобразует кодовые точки Unicode в строку.
//
// Параметры:
//	КодыСимволовUnicode - Строка - Один или несколько шестнадцатеричных кодов символов Unicode (без "U+"), соединенных символом "-".
// Разбивает исходную строку на подстроки. Разделителем является символ "-".
// В итоговой строке разделители преобразуется в объединитель нулевой ширины (ZWJ - 8205).
//
Функция КодовыеТочкиUnicodeВСтроку(КодыСимволовUnicode) Экспорт
	
	ФрагментыСтроки			 = Новый Массив;
	НомераСимволовUnicode	 = СтрРазделить(КодыСимволовUnicode, "-", Ложь);
	
	Для Каждого НомерСимволаUnicode Из НомераСимволовUnicode Цикл
		
		КодСимвола = КонвертироватьHexВDec(НомерСимволаUnicode);
		ФрагментыСтроки.Добавить(?(
			КодСимвола > 65535,
			Символ(ПобитовыйСдвигВправо(КодСимвола, 10) + 55232) + Символ(ПобитовоеИ(КодСимвола, 1023) + 56320),
			Символ(КодСимвола)
		));
		
	КонецЦикла;
	
	Возврат СтрСоединить(ФрагментыСтроки, Символ(8205));
	
КонецФункции

// Функция - Возвращает значение реквизита.
// 
// Возвращаемое значение:
//   - 
//
Функция ЗначениеРеквизита(Ссылка, ИмяРеквизита, ИмяПсевдонимаРеквизита = Неопределено) Экспорт
	Возврат ОбщегоНазначения.ПолучитьЗначениеРеквизита(Ссылка, ИмяРеквизита, ИмяПсевдонимаРеквизита);	
КонецФункции

// Функция - Возвращает значения реквизитов.
// 
// Возвращаемое значение:
//   - 
//
Функция ЗначенияРеквизитов(Ссылка, ИменаРеквизитов, ИмяПсевдонимаРеквизита = Неопределено) Экспорт
	Возврат ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, ИменаРеквизитов, ИмяПсевдонимаРеквизита);	
КонецФункции 

#КонецОбласти
