#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обрабочтик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;	
	
	Элементы.ВнешнийКаталог.Видимость = ЗначениеЗаполнено(Объект.ИДКаталога);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды "СкрытьПоказатьДополнительно".
//
Процедура СкрытьПоказатьДополнительно(Команда)
	
	Элементы.ГруппаДополнительно.Видимость = НЕ Элементы.ГруппаДополнительно.Видимость;
	
КонецПроцедуры

#КонецОбласти
