
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоляКонтроляДублированияКлиентов = ?(Параметры.Свойство("ПоляКонтроляДублированияКлиентов"), Параметры.ПоляКонтроляДублированияКлиентов, "");
	
	
	// Заполнение доступных клиентов
	СписокДоступныхПолей.Добавить("Фамилия", "Фамилия");
	СписокДоступныхПолей.Добавить("Имя", "Имя");
	СписокДоступныхПолей.Добавить("Отчество", "Отчество");
	СписокДоступныхПолей.Добавить("ДатаРожденияКлиента", "Дата рождения клиента");
	СписокДоступныхПолей.Добавить("Телефон", "Телефон");
	
	// Заполнение выбранных полей
	МассивВыбранныхПолей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПоляКонтроляДублированияКлиентов, ";");
	СписокВыбранныхПолей.ЗагрузитьЗначения(МассивВыбранныхПолей);
	Для Каждого ЭлементСписка Из СписокВыбранныхПолей Цикл
		ЭлементСпискаДоступногоПоля = СписокДоступныхПолей.НайтиПоЗначению(ЭлементСписка.Значение);
		Если ЭлементСпискаДоступногоПоля <> Неопределено Тогда
			ЭлементСписка.Представление = ЭлементСпискаДоступногоПоля.Представление;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура оработчик команды "ДобавитьВВыбранные"
//
Процедура ДобавитьВВыбранные(Команда)
	
	ТекущиеДанные = Элементы.СписокДоступныхПолей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или СписокВыбранныхПолей.НайтиПоЗначению(ТекущиеДанные.Значение) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбранныхПолей.Добавить(ТекущиеДанные.Значение, ТекущиеДанные.Представление);

КонецПроцедуры

&НаКлиенте
// Процедура оработчик команды "УдалитьИзВыбранных"
//
Процедура УдалитьИзВыбранных(Команда)
	
	ТекущиеДанные = Элементы.СписокВыбранныхПолей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбранныхПолей.Удалить(СписокВыбранныхПолей.НайтиПоЗначению(ТекущиеДанные.Значение));
	
КонецПроцедуры

&НаКлиенте
// Процедура оработчик команды "ВыбратьИЗакрыть"
//
Процедура ВыбратьИЗакрыть(Команда)
	
	МассивВыбранныхПолей = СписокВыбранныхПолей.ВыгрузитьЗначения();
	СтрокаВыбранныхПолей = СтроковыеФункцииКлиентСерверСтоматология.ПолучитьСтрокуИзМассиваПодстрок(МассивВыбранныхПолей, ";");
	
	Закрыть(СтрокаВыбранныхПолей);
	
КонецПроцедуры

&НаКлиенте
// Процедура оработчик команды "Закрыть"
//
Процедура КомандаЗакрыть(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДоступныхПолей

&НаКлиенте
// Процедура - обработчик события Выбор ТЧ СписокДоступныхПолей.
//
Процедура СписокДоступныхПолейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДобавитьВВыбранные(Неопределено);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события Выбор ТЧ СписокВыбранныхПолей.
//
Процедура СписокВыбранныхПолейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	УдалитьИзВыбранных(Неопределено);
	
КонецПроцедуры

#КонецОбласти
