
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Заголовок") Тогда
		ЭтаФорма.Заголовок		= Параметры.Заголовок;
		ЭтаФорма.АвтоЗаголовок	= Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ОткрытиеПриНачалеРаботыСистемы")
		И ТипЗнч(Параметры.ОткрытиеПриНачалеРаботыСистемы) = Тип("Булево") Тогда
		
		ОткрытиеПриНачалеРаботыСистемы = Параметры.ОткрытиеПриНачалеРаботыСистемы;
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаКлиенте
// Обработчик события ПриОткрытии.
//
Процедура ПриОткрытии(Отказ)
	
	ВыделитьТекущееРабочееМестоВСписке();
	     	
КонецПроцедуры

&НаКлиенте
// Обработчик события СписокПередНачаломДобавления.
//
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	СистемнаяИнформация = Новый СистемнаяИнформация();
	ИдентификаторКлиента = ВРег(СистемнаяИнформация.ИдентификаторКлиента);
	
	РабочееМесто = ПолучитьРабочееМестоПоИдентификаторуКлиента(ИдентификаторКлиента);
	
	Если НЕ РабочееМесто = Неопределено Тогда
		
		Отказ = Истина;
		
		Текст = НСтр("ru='Создание рабочего места не требуется, так для такого идентификатора клиента оно уже было создано."
"Открыть существующее рабочее место?';en='creation worker places not required so for such an identifier client it already it was created."
"Open existing working aplace?'");
		Оповещение = Новый ОписаниеОповещения("СписокПередНачаломДобавленияЗавершение", ЭтотОбъект, РабочееМесто);
		ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Обработчик события СписокПередНачаломДобавленияЗавершение.
//
Процедура СписокПередНачаломДобавленияЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да И Не ПустаяСтрока(Параметры) Тогда
		ПоказатьЗначение(, Параметры);
	КонецЕсли;  
	
КонецПроцедуры 

&НаСервере
// Обработчик события ПолучитьРабочееМестоПоИдентификаторуКлиента.
//
Функция ПолучитьРабочееМестоПоИдентификаторуКлиента(Идентификатор)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|    РабочиеМеста.Ссылка
	|ИЗ
	|    Справочник.РабочиеМеста КАК РабочиеМеста
	|ГДЕ
	|    РабочиеМеста.Код = &Идентификатор");
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
// Процедура - обработчик события "Выбор".
//
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ОткрытиеПриНачалеРаботыСистемы Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		УстановитьРабочееМесто(ТекущиеДанные.Ссылка);		
		ВыделитьТекущееРабочееМестоВСписке();		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - устанавливает текущее рабочее место.
//
Процедура УстановитьРабочееМесто(РабочееМесто)
	
	МенеджерОборудованияВызовСервера.УстановитьРабочееМестоКлиента(РабочееМесто);
	
КонецПроцедуры    

&НаКлиенте
// Процедура - выделяет текущее рабочее место в списке.
//
Процедура ВыделитьТекущееРабочееМестоВСписке() 
	
	ТекущееРабочееМесто = МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента();
	Список.Параметры.УстановитьЗначениеПараметра("ТекущееРабочееМесто", ТекущееРабочееМесто); 
	
КонецПроцедуры       

#КонецОбласти