
&НаКлиенте
перем ТекФамилия; // Хранит текущую фамилию
&НаКлиенте
перем ТекОтчество; // Хранит текущее отчество
&НаКлиенте
перем ТекИмя; // Хранит текущее имя
&НаКлиенте
перем ПредупреждениеДублирование; // Переменная для хранения данных о дублировании записи
&НаКлиенте
Перем СтруктураОбязательныеПоля; // Хранит обязательные поля
&НаКлиенте
Перем КонтактнаяИнформацияОчистить; // Хранит данные контактной информации для очистки

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
	ЭтаФорма.Заголовок = Строка(Объект.Ссылка) + " (Пациент)";
	
	Если (Параметры.Свойство("ТекущийРодитель")) И (НЕ ЗначениеЗаполнено(Объект.Ссылка)) Тогда // это новый, тогда заполним родителя
		Объект.Родитель = Параметры.ТекущийРодитель;
	КонецЕсли;
	
	ЭтотОбъект.ТекущийПользователь       = ПараметрыСеанса.ТекущийСотрудник;
	ЭтотОбъект.ТекущаяСтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ЮрФизЛицо                        = Перечисления.ЮрФизЛицо.ФизЛицо;
		Объект.ДатаРегистрации                  = ТекущаяДата();
		
		Если Параметры.Свойство("Фамилия") Тогда
			Объект.Фамилия = Параметры.Фамилия;
		КонецЕсли;
			
		Если Параметры.Свойство("Имя") Тогда
			Объект.Имя = Параметры.Имя;
		КонецЕсли;
		
		Если Параметры.Свойство("Отчество") Тогда
			Объект.Отчество = Параметры.Отчество;
		КонецЕсли;
		
		Если Параметры.Свойство("Родитель") Тогда
		     Объект.Родитель = Параметры.Родитель;
		КонецЕсли;
		 
		// Объект.Фамилия      = ?(Параметры.Свойство("Фамилия")  	   , Параметры.фамилия 		, "");
		// Объект.Имя          = ?(Параметры.Свойство("Имя")		   , Параметры.Имя     		, "");
		// Объект.Отчество     = ?(Параметры.Свойство("Отчество")	   , Параметры.Отчество		, "");
		Объект.Телефон      = ?(Параметры.Свойство("НомерТелефона"), Параметры.НомерТелефона, ""); 
		Объект.ПолКлиента   = ?(Параметры.Свойство("Пол")		   , Параметры.Пол		    , "");
		Объект.Наименование = ?(Параметры.Свойство("Наименование") , Параметры.Наименование , "");
		
		Элементы.ФормаСоздатьПрием.Доступность = Ложь;
		Элементы.ФормаСоздатьПрием.Видимость   = Ложь;
		
	КонецЕсли;
	
	//// Обработчик механизма "Контактная информация".
	// УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтаФорма, Объект, "ГруппаКонтактнаяИнформацияКлиенты");
		
	// Контактная информация
	УправлениеКонтактнойИнформациейСтоматология.ПриСозданииПриЧтенииНаСервере(ЭтотОбъект);
	// Конец Контактная информация.
	Автокоррекция = Объект.Родитель.Автокоррекция;

	Если Объект.Ссылка.Пустая() Тогда
		Элементы.ГруппаУдостоверенияЛичности.Видимость = Ложь;
		Элементы.ГруппаУдостоверениеЛичности.Видимость = Истина;
		Элементы.ОткрытьИсториюСтатусов.Доступность    = Ложь;
		СтатусКлиента = Перечисления.СтатусыКонтрагентов.Потенциальный;
		СформироватьСтруктуруДанныхВсплывающихГрупп();
	Иначе
		Элементы.ГруппаУдостоверенияЛичности.Видимость = Истина;
		Элементы.ГруппаУдостоверениеЛичности.Видимость = Ложь;
		СтатусКлиента = Справочники.Контрагенты.ПолучитьСтатус(Объект.Ссылка);
		Если СтатусКлиента = Перечисления.СтатусыКонтрагентов.ПустаяСсылка() Тогда
			СтатусКлиента = Перечисления.СтатусыКонтрагентов.Потенциальный;
		КонецЕсли;
		
		СформироватьСтруктуруДанныхВсплывающихГрупп();
		ВывестиИсториюСтатусовКонтрагента();
		ОтобразитьЗаявкуКонтрагента();
		
	КонецЕсли;
	
	// Добавление телефонного номера в дополнительные реквизиты
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Параметры.Свойство("НомерТелефона") Тогда
		Справочники.Контрагенты.ДобавитьНомерТелефона(ЭтаФорма, Параметры.НомерТелефона);		
	КонецЕсли;    	
	
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, Объект, "ГруппаДополнительныеРеквизиты");	
		
	// -------------------------
	// УправлениеСвойствамиСтома.ПриСозданииНаСервере(ЭтаФорма, Объект, "ГруппаДополнительнаяИнформация");
	
	// Установим отбор на записи удостоверения личности контрагента и прочитаем его
	// УдостоверениеЛичностиКонтрагентаЗапись = РеквизитФормыВЗначение("УдостоверениеЛичностиКонтрагента");
	// УдостоверениеЛичностиКонтрагентаЗапись.Период = ТекущаяДата();
	// УдостоверениеЛичностиКонтрагентаЗапись.ФизЛицо = Объект.Ссылка;
	// УдостоверениеЛичностиКонтрагентаЗапись.ВидДокумента = ВернутьВидДокументаДФЛДляВывода(Объект.Ссылка);
	// Если НЕ УдостоверениеЛичностиКонтрагентаЗапись.ВидДокумента.Пустая() Тогда // Считываем значение, только если есть необходимые документы
	//	УдостоверениеЛичностиКонтрагентаЗапись.Прочитать();
	// КонецЕсли;
	// ЗначениеВРеквизитФормы(УдостоверениеЛичностиКонтрагентаЗапись, "УдостоверениеЛичностиКонтрагента");
	
	ЗаполнитьТаблицуМеток();
	ОбновитьМетки(НЕ Объект.Ссылка.Пустая());
	УправлениеЭлементамиФормы();
	
	ЗаполненПол = ?(ЗначениеЗаполнено(Объект.ПолКлиента), Истина, ЗаполненПол);
	
	Если РольДоступна("Администрирование") ИЛИ РольДоступна("ПолныеПрава") Тогда
		Элементы.ОбязательныеПоля.Видимость = Истина;
	КонецЕсли;	

	ЗаполнитьСписокВыбораРежимаНапоминания();
	ЗаполнитьСписокВыбораВзаимодействияЗадача();	
	
	УстановитьОтборВСпискеПолисов();
	УправлениеЭлементамиФормы();
	ПриСозданииПриЧтенииНаСервере();
	
	ВремСписокФильтрацииИсторииВзаимодействия = ХранилищеСистемныхНастроек.Загрузить("Справочники.Контрагенты.Форма.ФормаЭлементаКлиенты", "НастройкиФильтрации");	
	ОбщегоНазначенияКлиентСерверСтоматология.ЗаполнитьСписокФильтрацииИсторииВзаимодействияПоУмолчанию(СписокФильтрацииИсторииВзаимодействия, Неопределено, ВремСписокФильтрацииИсторииВзаимодействия, Объект.Ссылка);	
	
	ФильтрПрименен = ФильтрПрименен(СписокФильтрацииИсторииВзаимодействия);	
	Элементы.ОчиститьФильтры.Видимость	= ФильтрПрименен;
	Элементы.ПоказатьФильтры.Картинка	= ?(ФильтрПрименен, БиблиотекаКартинок.ФильтрУстановлен, БиблиотекаКартинок.ФильтрНеУстановлен); 
	
	Если НЕ Объект.Ссылка.Пустая() Тогда		
		СформироватьИсториюВзаимодействияСКлиентом();
	КонецЕсли;
	
	УстановитьОбязательныеПоля();
	ЗаполнитьСписокВыбораШаблоновSMSСообщений();
	ОбновитьОформлениеКнопкиСтатусаКлиента();
	
	Если Параметры.Свойство("Сделка") 
		И ЗначениеЗаполнено(Параметры.Сделка) Тогда
		
		ЭтотОбъект.Сделка = Параметры.Сделка;
		УправлениеИнтерфейсамиСервер.ОбновитьВиджетСделки(ЭтаФорма,, Параметры.Сделка);
		
		ЭтотОбъект.ВзаимодействиеСделка = Параметры.Сделка;
		УстановитьСостояниеЭлементовСделкиВзаимодействия(ЭтотОбъект.ВзаимодействиеСделка, ЭтотОбъект.ВзаимодействиеСделка.ЭтапСделки.ЦветЭтапа);
	Иначе 	
		ОбновитьВиджетСделки();			
	КонецЕсли;
	
	ПроизвестиАвтокоррекциюФИО();			
	
	ЗаполнитьДанныеТелефоновДоИзменения();
	
	Элементы.ДекорацияГруппаКровиСтрокой.Видимость = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.ГруппаКрови) И ЗначениеЗаполнено(Объект.ГруппаКрови_Удалить) Тогда
		Элементы.ДекорацияГруппаКровиСтрокой.Видимость = Истина;
		Элементы.ДекорацияГруппаКровиСтрокой.Заголовок = Объект.ГруппаКрови_Удалить;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриЗакрытии" формы
//
Процедура ПриЗакрытии()
	
	Оповестить("ДанныеКлиентаМодифицированы");	

	Если ЭтаФорма.ОписаниеОповещенияОЗакрытии <> Неопределено И ЭтаФорма.ОписаниеОповещенияОЗакрытии.ИмяПроцедуры = "ДобавитьИВыбратьКонтрагентаЗавершение" Тогда
		ОповеститьОВыборе(Объект.Ссылка);
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаОповещения".
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Обработчик механизма "Свойства".
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьДополнительныеРеквизиты();
	КонецЕсли;
	
	Если ИмяСобытия = "ПРОВЕДЕН_ВЗНОС_НА_ЛИЦЕВОЙ_СЧЕТ" И Источник = Объект.Ссылка Тогда 
		
		// Дополнительная информация
		МассивРодителей = Новый Массив();
		МассивРодителей.Добавить("ГруппаЛицевыеБонусныеСчетаСуществующие");	
		ОтображениеДополнительнойИнформации(МассивРодителей);
		ПоказатьОповещениеПользователя(,,"Зачислено на лицевой счет: " + Строка(Параметр.СуммаВзноса) + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольноеПредставлениеВалюты(), БиблиотекаКартинок.Информация32, СтатусОповещенияПользователя.Информация);
		
	КонецЕсли;
	
	Если ИмяСобытия = "ОБНОВЛЕНЫ_МЕТКИ_КЛИЕНТА" Тогда
		ОбновитьМетки();
	ИначеЕсли (ИмяСобытия = "ОБНОВЛЕНА_ТЕКУЩАЯ_МЕДИЦИНСКАЯ_КАРТА_КЛИЕНТА" ИЛИ ИмяСобытия = "ОБНОВЛЕНЫ_МЕДИЦИНСКИЕ_КАРТЫ_КЛИЕНТА")
		И Параметр = Объект.Ссылка Тогда
		
		Если ЗначениеЗаполнено(Источник) 
			И Не ЗначениеЗаполнено(Объект.ТекущаяМедицинскаяКарта) Тогда
			Объект.ТекущаяМедицинскаяКарта = Источник;
			Записать();
		КонецЕсли;
		
		Прочитать();
		УправлениеЭлементамиФормы();
		
	ИначеЕсли ИмяСобытия = "ОчиститьПолеКИ"
		И КонтактнаяИнформацияОчистить <> Неопределено Тогда
		
		Результат = ЭтаФорма.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид, Представление", КонтактнаяИнформацияОчистить.Вид, КонтактнаяИнформацияОчистить.Представление));
		
		Если Результат.Количество() > 0 Тогда 			
			ЭтаФорма.КонтактнаяИнформация.Удалить(Результат[0]);			
		КонецЕсли;
		
		КонтактнаяИнформацияОчистить = Неопределено;
		
	ИначеЕсли ИмяСобытия = "ОбновленыУдостоверения" Тогда
		МассивРодителей = Новый Массив();
		МассивРодителей.Добавить("ГруппаУдостоверенияЛичностиСуществующие");
		ОтображениеДополнительнойИнформации(МассивРодителей);  
	ИначеЕсли ИмяСобытия = "СозданаНоваяКарта" ИЛИ ИмяСобытия = "ИзмененаКарта" Тогда
		МассивРодителей = Новый Массив();
		МассивРодителей.Добавить("ГруппаКартыСуществующие");
		ОтображениеДополнительнойИнформации(МассивРодителей);	
	ИначеЕсли ИмяСобытия = "ЗаписанаСкидка" Тогда
		МассивРодителей = Новый Массив();
		МассивРодителей.Добавить("ГруппаСкидкиСуществующие");
		ОтображениеДополнительнойИнформации(МассивРодителей);
	ИначеЕсли ИмяСобытия = "ОбновленыПолисы" Тогда
		МассивРодителей = Новый Массив();
		МассивРодителей.Добавить("ГруппаПолисыСуществующие");
		ОтображениеДополнительнойИнформации(МассивРодителей);
	ИначеЕсли ИмяСобытия = "ОбновитьИсториюВзаимодействияКонтрагента" Тогда
		Если ЗначениеЗаполнено(Параметр) И ТипЗнч(Параметр) = Тип("Структура") Тогда 
			Если Параметр.Свойство("Пациент") И Параметр.Пациент = Объект.Ссылка Тогда
				// Фильтры = Новый Структура();
				СформироватьИсториюВзаимодействияСКлиентом();
				// УстановитьФильтрИсторииВзаимодействияНаСервере();
			КонецЕсли;
		КонецЕсли;	
	ИначеЕсли ИмяСобытия = "СозданаИзмененаУчетнаяЗапись" Тогда		
		ВзаимодействиеПисьмоНастроитьАккаунтЗавершение(Параметр);
	КонецЕсли; 
	
	Если ИмяСобытия = "ОбновленаРодственнаяСвязь" Тогда 
		МассивРодителей = Новый Массив();
		МассивРодителей.Добавить("ГруппаРодственникиСуществующие");
		ОтображениеДополнительнойИнформации(МассивРодителей);
	КонецЕсли;
	
	Если ИмяСобытия = "ОБНОВИТЬ_ВИДЖЕТ_СДЕЛКИ" Тогда
		УстановитьФокусЭлемента();
		ОбновитьВиджетИСтатусКонтрагента();
		УстановитьАктуальнуюСделкуВзаимодействия();
	КонецЕсли;	
	
	Если ИмяСобытия = "ОбновленыПолисы" Тогда
		
	КонецЕсли;
	
	Если ИмяСобытия = "ОБНОВИТЬ_ОБЯЗАТЕЛЬНЫЕ_ПОЛЯ" Тогда
		УстановитьОбязательныеПоля();
		ЭтаФорма.ОтключитьОтметкуНезаполненного();
	КонецЕсли; 
	
	Если ИмяСобытия = "ОбновленыПромокоды" Тогда	
		
		МассивРодителей = Новый Массив();
		МассивРодителей.Добавить("ГруппаПромокодыСуществующие");
		
		ОтображениеДополнительнойИнформации(МассивРодителей);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПриЧтенииНаСервере".
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
	ЗаполнитьСписокТелефоновДляWhatsApp();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПередЗаписью" формы
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	УстановитьОбязательныеПоля();
	СтруктураОбязательныхДинамПолей = ПолучитьОбязательныеДинамПоля();
	СтруктураФлаговДинамПолей       = Неопределено;
	
	Для Каждого ЭлементФормы Из Элементы Цикл
		
		Если ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") И ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода  И ЭлементФормы.АвтоОтметкаНезаполненного = Истина Тогда			
			
			Если Найти(ЭлементФормы.Имя, "ДатаРождения") <> 0 И ЭлементФормы.ТекстРедактирования = "  .  .    " 
				И НЕ ЗначениеЗаполнено(Объект.ДатаРожденияКлиента) Тогда
				
				Если ЭлементФормы.Имя = "ДатаРождения" Тогда
					ИмяЭлемента = "Дата рождения";				
				КонецЕсли;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле дата рождения пациента!");
				Отказ = Истина;
				Прервать; 
			
			КонецЕсли;
			
			Если ЭлементФормы.ТекстРедактирования = "" Тогда
				
				Если ЭлементФормы.Имя = "Наименование" Тогда
					
					Если Объект.Наименование <> "" Тогда
						Продолжить;
					КонецЕсли;
					ИмяЭлемента = "Имя";
					
				ИначеЕсли СтрНачинаетсяС(ЭлементФормы.Имя, "ПредставлениеКИ_") = Истина Тогда
					Продолжить;  
					
				ИначеЕсли ЭлементФормы.Имя = "ВидДокумента" ИЛИ ЭлементФормы.Имя = "Серия" ИЛИ ЭлементФормы.Имя = "Номер"  
					ИЛИ ЭлементФормы.Имя = "КемВыдан" ИЛИ ЭлементФормы.Имя = "КодПодразделения" ИЛИ ЭлементФормы.Имя = "ДатаВыдачи" Тогда 
					
					Если ЭлементФормы.Имя = "ВидДокумента" Тогда
						ИмяЭлемента = "вид документа"; 
					ИначеЕсли ЭлементФормы.Имя = "КодПодразделения" Тогда
						ИмяЭлемента = "код подразделения";
					ИначеЕсли ЭлементФормы.Имя = "ДатаВыдачи" Тогда
						ИмяЭлемента = "дата выдачи";
					ИначеЕсли ЭлементФормы.Имя = "КемВыдан" Тогда
						ИмяЭлемента = "кем выдан"; 
					Иначе
						ИмяЭлемента = НРег(ЭлементФормы.Имя);
					КонецЕсли; 
					ЗначениеЭлемента = ВернутьВидДокументаДФЛДляВывода(Объект.Ссылка, ЭлементФормы.Имя);
					Если ЗначениеЗаполнено(ЗначениеЭлемента) Тогда
						Продолжить;
					КонецЕсли;	
					
				ИначеЕсли ЭлементФормы.Имя = "Куратор" ИЛИ ЭлементФормы.Имя = "Родитель" ИЛИ ЭлементФормы.Имя = "МестоРождения"
					ИЛИ ЭлементФормы.Имя = "СоциальныйСтатус" Тогда 
					Если ЭлементФормы.Имя = "МестоРождения" Тогда
						ИмяЭлемента = "место рождения";
					ИначеЕсли ЭлементФормы.Имя = "Родитель" Тогда
						ИмяЭлемента = "группа пациентов"; 
					ИначеЕсли ЭлементФормы.Имя = "СоциальныйСтатус" Тогда
						ИмяЭлемента = "социальный статус";
					Иначе
						ИмяЭлемента = НРег(ЭлементФормы.Имя);
					КонецЕсли;  
					
					Если ЗначениеЗаполнено(Объект[ЭлементФормы.Имя]) Тогда
						Продолжить;
					КонецЕсли;	
					
				Иначе
					ИмяЭлемента = ЭлементФормы.Имя;	
					Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, ЭлементФормы.Имя) И ЗначениеЗаполнено(Объект[ЭлементФормы.Имя]) Тогда 					
						Продолжить;	
					КонецЕсли;
					
				КонецЕсли;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле " + ИмяЭлемента + "!");
				Отказ = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") И ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода Тогда
			Если СтрНачинаетсяС(ЭлементФормы.Имя, "ПредставлениеКИ_") = Истина Тогда
				СтруктураФлаговДинамПолей = ПроверитьОбязательныеДинамПоля(ЭлементФормы, СтруктураФлаговДинамПолей);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла; 
	
	Если СтруктураФлаговДинамПолей = Неопределено Тогда
		СтруктураФлаговДинамПолей = СоздатьОбнуленнуюСтруктуруФлаговДинамПолей();
	КонецЕсли;
	
	// Проверка динамических полей, обязательных для заполнения, на заполненность
	// Если внесено несколько полей для телефонов, необходимо, чтобы хотя бы одно из полей было заполнено. С Email то же самое
	// Проверка осуществляется выше, и выставляются Флаги. Здесь флаги просто проверяются для вывода сообщения об ошибке
	Если СтруктураОбязательныхДинамПолей.ФлагТелефон = Истина 
		И СтруктураФлаговДинамПолей.ХотяБыОдинТелефон = Ложь Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле Телефон!");
		Отказ = Истина;
		
	ИначеЕсли СтруктураОбязательныхДинамПолей.ФлагEmail = Истина 
		И СтруктураФлаговДинамПолей.ХотяБыОдинEmail = Ложь Тогда 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле Email!");
		Отказ = Истина;
		
	ИначеЕсли СтруктураОбязательныхДинамПолей.ФлагАдрес = Истина 
		И СтруктураФлаговДинамПолей.ХотяБыОдинАдрес = Ложь Тогда 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле Адрес!");
		Отказ = Истина;
		
	КонецЕсли;
	
	// Страховые метки выводятся из полиса, нет необходимость хранить их в метках клиента.
	//
	//	МеткаСтраховая = ПолучитьСсылкуМеткиПоНаименованию("Страховая");
	//	Если ЕстьДействующийПолис() И НЕ МеткаСтраховая.Пустая() Тогда
	//		МеткаДляУстановки = ТаблицаМеток.НайтиСтроки(Новый Структура("Метка", МеткаСтраховая));
	//		Для Каждого Метка Из МеткаДляУстановки Цикл
	//			Метка.Активна = Истина;
	//		КонецЦикла;
	//	КонецЕсли;
	
	Если Объект.ЮрФизЛицо.Пустая() Тогда
		Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо");
	КонецЕсли;
	
	Объект.Наименование = Объект.Фамилия + ?(ЗначениеЗаполнено(Объект.Фамилия), " ", "") + Объект.Имя + ?(ЗначениеЗаполнено(Объект.Имя), " ", "") + Объект.Отчество;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПередЗаписьюНаСервере".
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Заполним служебный реквизит номера телефонов
	НомераТелефонов = Новый Массив;
	Для Каждого СтрокаКИ Из ТекущийОбъект["КонтактнаяИнформация"] Цикл
		Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И НЕ ПустаяСтрока(СтрокаКИ.Представление) Тогда
			НомераТелефонов.Добавить(СтрокаКИ.Представление);
		КонецЕсли;
	КонецЦикла;
	
	ТекущийОбъект.Телефон = СтрСоединить(НомераТелефонов, ", ");
	
	// КонтактнаяИнформация
	УправлениеКонтактнойИнформациейСтоматология.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец КонтактнаяИнформация
	
	// Обработчик механизма "Свойства".
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// Синхронизация данных контактов мессенджеров с телефонами клиентов.
	ЗаполнитьДанныеТелефоновПередЗаписью();
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ИзмененныеТелефоны", ЭтотОбъект.ИзменяемыеТелефоныМессенджера);
	
	ТекущийСтатус = Справочники.Контрагенты.ПолучитьСтатус(Объект.Ссылка);
	Если НЕ ЗначениеЗаполнено(ТекущийСтатус) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("Статус", СтатусКлиента);
	Иначе 
		ТекущийОбъект.ДополнительныеСвойства.Вставить("Статус", ТекущийСтатус);
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
// Процедура, обработчик события "ПослеЗаписиНаСервере"
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	// Если контрагент был пустой, то обновляем в наборах записей на ссылку созданного контрагента
	Если УдостоверениеЛичностиКонтрагента.Физлицо <> Объект.Ссылка Тогда
		УдостоверениеЛичностиКонтрагента.Физлицо = Объект.Ссылка;
	КонецЕсли;
	
	// Запись данных Удостоверения личности
	Если Не УдостоверениеЛичностиКонтрагента.ВидДокумента.Пустая() И ЗначениеЗаполнено(УдостоверениеЛичностиКонтрагента.Физлицо) Тогда
		УдостоверениеЛичностиКонтрагентаЗапись = РеквизитФормыВЗначение("УдостоверениеЛичностиКонтрагента");
		УдостоверениеЛичностиКонтрагентаЗапись.Записать();
		ЗначениеВРеквизитФормы(УдостоверениеЛичностиКонтрагентаЗапись, "УдостоверениеЛичностиКонтрагента");
		// ИначеЕсли Не УдостоверениеЛичностиКонтрагента.ИсходныйКлючЗаписи.Пустой() И УдостоверениеЛичностиКонтрагента.ВидДокумента.Пустая() Тогда
		//	УдостоверениеЛичностиКонтрагентаЗапись = РеквизитФормыВЗначение("УдостоверениеЛичностиКонтрагента");
		//	ЗаполнитьЗначенияСвойств(УдостоверениеЛичностиКонтрагентаЗапись, УдостоверениеЛичностиКонтрагента.ИсходныйКлючЗаписи);
		//	УдостоверениеЛичностиКонтрагентаЗапись.Удалить();
		//	ЗначениеВРеквизитФормы(УдостоверениеЛичностиКонтрагентаЗапись, "УдостоверениеЛичностиКонтрагента");
	КонецЕсли;
	
	УправлениеЭлементамиФормы(); 
	
	// Обработчик механизма "Свойства".
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеЗаписи".
//
Процедура ПослеЗаписи(ПараметрыЗаписи)

	Оповестить("ЗаписанНовыйКлиент", Объект.Ссылка, ЭтаФорма); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаСобытийЭлементовФормы

&НаКлиенте
// Процедура, "ФИО При изменении".
//
Процедура ФИОПриИзменении(Элемент)
	
	Если Автокоррекция = 2 Тогда
		Объект.Фамилия	= ВРег(СокрЛП(Объект.Фамилия));
		Объект.Имя		= ВРег(СокрЛП(Объект.Имя));
		Объект.Отчество = ВРег(СокрЛП(Объект.Отчество));
	ИначеЕсли Автокоррекция = 1 Тогда
		Объект.Фамилия	= ТРег(СокрЛП(Объект.Фамилия));// ВРег(Сред(Объект.Фамилия, 1, 1)) + НРег(Сред(Объект.Фамилия, 2));
		Объект.Имя		= ТРег(СокрЛП(Объект.Имя));// ВРег(Сред(Объект.Имя, 1, 1)) + НРег(Сред(Объект.Имя, 2));
		Объект.Отчество = ТРег(СокрЛП(Объект.Отчество));// ВРег(Сред(Объект.Отчество, 1, 1)) + НРег(Сред(Объект.Отчество, 2));
	КонецЕсли;
	
	// Заполняем пол клиента, если он не был заполнен ранее
	Если Объект.Ссылка.Пустая() ИЛИ (НЕ Объект.Ссылка.Пустая() И НЕ ЗаполненПол)Тогда
		ПолКлиента = ОбщегоНазначенияКлиентПовтИспСтоматология.ОпределитьПолКлиента(Объект.Фамилия, Объект.Имя, Объект.Отчество);
		Если ПолКлиента = "Мужской" Тогда
			Объект.ПолКлиента = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской");
		ИначеЕсли ПолКлиента = "Женский" Тогда
			Объект.ПолКлиента = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Женский");
		КонецЕсли;
	КонецЕсли;		
	
	Объект.Наименование = Объект.Фамилия + ?(ЗначениеЗаполнено(Объект.Фамилия), " ", "") + Объект.Имя + ?(ЗначениеЗаполнено(Объект.Имя), " ", "") + Объект.Отчество;
	ПроверкаДублированияКлиента(Неопределено);
	
КонецПроцедуры

&НаКлиенте
// Процедура, "Дата рождения при изменении".
//
Процедура ДатаРожденияПриИзменении(Элемент)
	
	Если Объект.ДатаРожденияКлиента > ТекущаяДата() ИЛИ Год(Объект.ДатаРожденияКлиента) < 1900 Тогда
		Объект.ДатаРожденияКлиента = Дата(1,1,1); 
		Текст = ?(Объект.ДатаРожденияКлиента > ТекущаяДата(), "Дата рождения не может быть больше текущей даты!", "Неверно указана дата рождения!"); 
		ПоказатьПредупреждение(, Текст,,"Внимание!");
	Иначе  	
		ПроверкаДублированияКлиента(Новый ОписаниеОповещения("ДатаРожденияПриИзмененииЗавершение", ЭтотОбъект)); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаРожденияПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	УправлениеЭлементамиФормы();

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" элемента формы "НедееспособныйГражданин"
//
Процедура НедееспособныйГражданинПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Законный представитель создание
//
// Параметры:
//  Элемент				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ЗаконныйПредставительСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ГруппаКлиентов = Объект.Родитель;
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", Новый Структура("Родитель", ГруппаКлиентов)), , Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура, "Текущая медицинская карта код нажатие".
//
Процедура ТекущаяМедицинскаяКартаКодНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 	
	ПоказатьЗначение(, Объект.ТекущаяМедицинскаяКарта);
	
КонецПроцедуры

&НаКлиенте
// Процедура, "Социальный статус при изменении".
//
Процедура СоциальныйСтатусПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Куратор начало выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеВыбора		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура КураторНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    мПараметрыВыбора = Новый Структура;
	мПараметрыВыбора.Вставить("СтруктурнаяЕдиница" , Объект.СтруктурнаяЕдиница);
	мПараметрыВыбора.Вставить("ДатаДокумента"      , ТекущаяДата());
    мПараметрыВыбора.Вставить("БезОтбораПоРолям"   , Истина);
	ВыбранноеЗначение = Неопределено;
	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", мПараметрыВыбора,,,,, Новый ОписаниеОповещения("КураторНачалоВыбораЗавершение",ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поля "ИсточникИнформации"
//
Процедура ИсточникИнформацииПриИзменении(Элемент)
	
	Элементы.КлиентИсточникИнформации.Видимость = (Объект.ИсточникИнформации = ПредопределенноеЗначение("Справочник.РекламныеИсточники.ДругойПациент"));
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриНажатии" поля формы "ИсторияВзаимодействия".
//
Процедура ИсторияВзаимодействияПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	// Элемент.Доступность = Ложь; // Прыгает вся история, зачем менять?
	ЭлементHTML 		= ДанныеСобытия.Element; 
	ДанныеСсылкиHTML 	= ДанныеСобытия.Anchor;
	Документ 			= Элемент.Документ;
	
	Попытка 
		
		Если ДанныеСсылкиHTML = Неопределено Тогда 				// Нажали в пустое место.	
			Возврат;	
		ИначеЕсли ДанныеСсылкиHTML.name = "more" Тогда
			СтандартнаяОбработка = Ложь;
			
			ЭтотОбъект.ВыводитьВсеВзаимодействия = Истина;
			СформироватьИсториюВзаимодействияСКлиентом();
						
		ИначеЕсли СтрНайти(ДанныеСсылкиHTML.name, "note") Тогда  // редактировать заметку.
			
			СтандартнаяОбработка = Ложь;
			
			СтрокаТЗ = ЭтотОбъект.ИсторияВзаимодействий.НайтиПоИдентификатору(ДанныеСсылкиHTML.id);
			
			Если РольДоступнаКлиентСервер("ПолныеПрава")
				ИЛИ РольДоступнаКлиентСервер("ДобавлениеИзменениеКлиентов") Тогда
				
				МассивЭлементовHTML = ДанныеСсылкиHTML.getElementsByClassName("text-message");
				
				Если МассивЭлементовHTML.length > 0 Тогда
					РедактироватьЗаметку(МассивЭлементовHTML[0], СтрокаТЗ.Заметка, СтрокаТЗ);
				КонецЕсли;
								
			КонецЕсли;
			
		ИначеЕсли СтрНайти(ДанныеСсылкиHTML.name, "call_comment") Тогда // редактировать коментарий звонка
			
			СтандартнаяОбработка = Ложь;
			
			МассивЭлементовHTML = ДанныеСсылкиHTML.getElementsByClassName("text-message");
			
			Если МассивЭлементовHTML.length > 0 Тогда
				РедактироватьЗаметкуЗвонок(МассивЭлементовHTML[0],  ДанныеСсылкиHTML.id);
			КонецЕсли;
	
		ИначеЕсли СтрНайти(ДанныеСсылкиHTML.name, "profs") Тогда  // редактировать профосмотр.		
			
			СтандартнаяОбработка = Ложь;
			
			РедактироватьПрофосмотр(ДанныеСсылкиHTML);	
			
		ИначеЕсли СтрНайти(ЭлементHTML.className, "task") > 0 Тогда 
			СтандартнаяОбработка = Ложь;

			Ссылка = ПолучитьСсылкуНаЗадачуПоУид(Новый УникальныйИдентификатор(ЭлементHTML.id));
			ОбновитьФорму = ОтметитьЗадачуКакВыполненую(Ссылка);
			Если ОбновитьФорму Тогда
				УстановитьФильтрИсторииВзаимодействияНаСервере();	
			КонецЕсли; 
			
		ИначеЕсли СтрНайти(ЭлементHTML.className, "listen_call") Тогда // прослущать звонок	
				
			СтандартнаяОбработка = Ложь;
			
			СтрокаТЗ = ЭтотОбъект.ИсторияВзаимодействий.НайтиПоИдентификатору(ЭлементHTML.id);
			Сообщение = "";
			
			ДанныеВызова = ПолучитьДанныеИсторииВызова(СтрокаТЗ.Взаимодействие, Сообщение);
			
			Если Не ЗначениеЗаполнено(ДанныеВызова) Тогда 
				Если ЗначениеЗаполнено(Сообщение) Тогда 
					ПоказатьПредупреждение(,Сообщение);
				КонецЕсли;
				Возврат;
			ИначеЕсли ЗначениеЗаполнено(ДанныеВызова.ФайлЗаписи) Тогда					
				СсылкаНаФайл = ПолучитьСсылкуПоУид(ДанныеВызова.ФайлЗаписи.УникальныйИдентификатор(), ЭлементHTML.name);
				
				ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(СсылкаНаФайл);
				
				РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
				
			ИначеЕсли ЗначениеЗаполнено(ДанныеВызова.URLЗаписи) Тогда
				АктуальныйURLЗаписи = IPТелефонияКлиент.ПолучитьАктуальныйURLЗаписиROSTELECOMКлиент(ДанныеВызова.URLЗаписи, ДанныеВызова.IDЗвонка, ДанныеВызова.ОборудованиеТелефонии);
				НачатьЗапускПриложения(Новый ОписаниеОповещения("ИсторияВзаимодействияПослеОткрытияПриложенияЗаглушка", ЭтотОбъект), АктуальныйURLЗаписи);
   			Иначе
				Возврат;
			КонецЕсли;
			
		ИначеЕсли СтрНайти(ДанныеСсылкиHTML.name, "open_dialog") Тогда  // Открыть диалог.
			
			СтандартнаяОбработка = Ложь;
			
			ИдКлиента 			= Лев(ДанныеСсылкиHTML.id, СтрНайти(ДанныеСсылкиHTML.id, "_") - 1);	
			UidВнешнейСистемы 	= Сред(ДанныеСсылкиHTML.id, СтрНайти(ДанныеСсылкиHTML.id, "_") + 1, СтрДлина(ДанныеСсылкиHTML.id));
			
			ПерейтиВЧат(ИдКлиента, UidВнешнейСистемы);
	
		ИначеЕсли СтрНайти(ДанныеСсылкиHTML.name, "clip") Тогда // закрепить/открепить
			
			СтандартнаяОбработка = Ложь;
			
			СтрокаТЗ = ЭтотОбъект.ИсторияВзаимодействий.НайтиПоИдентификатору(ДанныеСсылкиHTML.id);
			
			ЗакрепитьОткрепитьЗаметку(СтрокаТЗ.ИДЗаметки, СтрНайти(ДанныеСсылкиHTML.name, "off"));
			СформироватьИсториюВзаимодействияСКлиентом();
	
		ИначеЕсли ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
			
			СтандартнаяОбработка = Ложь;
			ПерейтиПоНавигационнойСсылке(ДанныеСобытия.Href);
			
			
		Иначе
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	// Элемент.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте 
// Процедура - История взаимодействия после открытия приложения заглушка
//
// Параметры:
//  КодВозврата				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ИсторияВзаимодействияПослеОткрытияПриложенияЗаглушка(КодВозврата, ДополнительныеПараметры) Экспорт
	
	// Заглушка после открытия приложения	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура КаналПривлеченияПриИзменении(Элемент)
	
	УстановитьВидимостьЗначенияКаналаПривлечения(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Подробно
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеПодробно(Команда)
	
	УстановитьФокусЭлемента();
	
	Элементы.КнопкаПодробно.Пометка   = Не Элементы.КнопкаПодробно.Пометка;
	Элементы.КнопкаПодробно.Заголовок = ?(Элементы.КнопкаПодробно.Пометка, НСтр("ru = 'Кратко'; en = 'Short'"), НСтр("ru = 'Подробно'; en = 'In detail'"));
	
	СформироватьИсториюВзаимодействияСКлиентом();
	
КонецПроцедуры

&НаКлиенте
// Обработчик события "Открыть историю статусов".
//
Процедура ОткрытьИсториюСтатусов(Команда)
	
	Если Объект.Ссылка.Пустая() И Не ПроверитьЗаполнение() Тогда 	
		Возврат;
	КонецЕсли;	
	
	// Если НЕ Элементы.ГруппаИсторияСтатусовВсплывающая.Видимость Тогда
	//	Элементы.ГруппаИсторияСтатусовВсплывающая.Видимость = Истина;	
	// КонецЕсли;
	
	Если ПроверитьВидимостьВсплывающихГрупп("ИсторияСтатусов") Тогда				
		УстановитьВидимостьВсплывающихГрупп("ИсторияСтатусов");
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
// Обработчик события "Текущая медицинская карта создать нажатие".
//
Процедура ТекущаяМедицинскаяКартаСоздатьНажатие(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Пациент не сохранен, сохранить изменения ?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
		
	Иначе
		ТекущаяМедицинскаяКартаСоздать();	
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте 
// Процедура, После ответа на вопрос.
//
Процедура ПослеОтветаНаВопрос(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда		
		Возврат;
	Иначе
		Записать();
		ТекущаяМедицинскаяКартаСоздать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
// Процедура, Текущая медицинская карта создать.
//
 Процедура ТекущаяМедицинскаяКартаСоздать()  
	 
	 СтандартнаяОбработка = Ложь;
	 ПараметрыОткрытия = Новый Структура("ВладелецКарты", Объект.Ссылка);
	 
	 ОткрытьФорму("Справочник.МедицинскиеКарты.ФормаОбъекта",
	 Новый Структура("Основание", ПараметрыОткрытия),,,,,
	 Новый ОписаниеОповещения("ТекущаяМедицинскаяКартаСоздатьНажатиеЗавершение", ЭтотОбъект), 
	 РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);   
	 
КонецПроцедуры	 

&НаКлиенте
// Процедура - После выбора мед карты
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ТекущаяМедицинскаяКартаСоздатьНажатиеЗавершение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда
		Объект.ТекущаяМедицинскаяКарта = РезультатВыбора;
		Модифицированность = Истина;
		УправлениеЭлементамиФормы();
		Записать();
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить родственника
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ДобавитьРодственника(Команда)

	ТипДопИнформации = Новый Структура;
	ТипДопИнформации.Вставить("ЭтоРодственник", Истина);
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОткрытьФормуВводаДопИнформации", ЭтотОбъект, ТипДопИнформации), НСтр("ru='Для ввода родственника необходимо произвести запись нового клиента. Записать?';en='For relative input is necessary toproduce record new client. WriteDown?'"), РежимДиалогаВопрос.ДаНет);
	Иначе 
		ОткрытьФормуВводаДопИнформации(, ТипДопИнформации);
	КонецЕсли;		

КонецПроцедуры

&НаКлиенте
// Обработчик события "Добавить удостоверение личности".
//
Процедура ДобавитьУдостоверениеЛичности(Команда)
	
	ТипДопИнформации = Новый Структура;
	ТипДопИнформации.Вставить("ЭтоУдостоверениеЛичности", Истина);
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОткрытьФормуВводаДопИнформации", ЭтотОбъект, ТипДопИнформации), "Для ввода удостоверения личности необходимо произвести запись нового клиента. Записать?", РежимДиалогаВопрос.ДаНет);		
	Иначе 
		ОткрытьФормуВводаДопИнформации(, ТипДопИнформации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик события " Добавить полис".
//
Процедура ДобавитьПолис(Команда)
	
	ТипДопИнформации = Новый Структура;
	ТипДопИнформации.Вставить("ЭтоПолис", Истина);
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОткрытьФормуВводаДопИнформации", ЭтотОбъект, ТипДопИнформации), "Перед добавлением скидки необходимо произвести запись нового клиента. Записать?", РежимДиалогаВопрос.ДаНет);
	Иначе 
		ОткрытьФормуВводаДопИнформации(, ТипДопИнформации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик события "Добавить скидку".
//
Процедура ДобавитьСкидку(Команда)
	
	ТипДопИнформации = Новый Структура;
	ТипДопИнформации.Вставить("ЭтоСкидка", Истина);
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОткрытьФормуВводаДопИнформации", ЭтотОбъект, ТипДопИнформации), "Перед добавлением скидки необходимо произвести запись нового клиента. Записать?", РежимДиалогаВопрос.ДаНет);
	Иначе 
		ОткрытьФормуВводаДопИнформации(, ТипДопИнформации);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взнос на лицевой счет
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзносНаЛицевойСчет(Команда)
	
	ТипДопИнформации = Новый Структура;
	ТипДопИнформации.Вставить("ЭтоВзносНаЛицевойСчет", Истина);
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОткрытьФормуВводаДопИнформации", ЭтотОбъект, ТипДопИнформации), "Перед взносом на лицевой счет необходимо сохранить клиента. Сохранить?", РежимДиалогаВопрос.ДаНет);
	Иначе 
		ОткрытьФормуВводаДопИнформации(, ТипДопИнформации);
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
// Обработчик события "Скрыть показать дополнительно".
//
Процедура СкрытьПоказатьДополнительно(Команда)
	
	Элементы.ГруппаДополнительно.Видимость = Не Элементы.ГруппаДополнительно.Видимость;
	
КонецПроцедуры   

&НаКлиенте
// Обработчик события "СогласиеНаОбработкуПерсональныхДанных".
//
Процедура СогласиеНаОбработкуПерсональныхДанных(Команда)
	
	Субъекты = Новый  Массив();
	Субъекты.Добавить(Объект.Ссылка);
	ОткрытьФорму("Обработка.СогласиеНаОбработкуПерсональныхДанных.Форма", Новый Структура("Субъекты", Субъекты), ЭтаФорма);

КонецПроцедуры  

&НаКлиенте
// Процедура - Добавить карту
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ДобавитьКарту(Команда)
	
	ТипДопИнформации = Новый Структура;
	ТипДопИнформации.Вставить("ЭтоКарта", Истина);
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОткрытьФормуВводаДопИнформации", ЭтотОбъект, ТипДопИнформации), "Перед добавлением карты необходимо произвести запись нового клиента. Записать?", РежимДиалогаВопрос.ДаНет);
	Иначе 
		ОткрытьФормуВводаДопИнформации(, ТипДопИнформации);
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
// Процедура - Объединение клиентов
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОбъединениеКлиентов(Команда)
	
	ОткрытьФорму("Обработка.ОбъединениеКлиентов.Форма", Новый Структура("Контрагент", Объект.Ссылка));
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "СоздатьПрием"
//
Процедура СоздатьПрием(Команда)
	
	ОткрытьФорму("Документ.Прием.ФормаОбъекта", Новый Структура("Основание", Новый Структура("Контрагент", Объект.Ссылка)));
	
КонецПроцедуры

#Область ФильтрацияДанныхИсторииВзаимодействия

&НаКлиенте 
// Процедура - Показать фильтры.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПоказатьФильтры(Команда)  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыФормы.Вставить("СписокФильтрацииИсторииВзаимодействия", СписокФильтрацииИсторииВзаимодействия);
	
	ФормаФильтровОписаниеОповещения = Новый ОписаниеОповещения("ВыборФильтровИсторииВзаимодействияЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаФильтровИсторииВзаимодействия", ПараметрыФормы,,,,, ФормаФильтровОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
		
КонецПроцедуры

&НаСервере 
// Процедура - Выбор фильтров истории взаимодействия завершение.
//
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
//
Процедура ВыборФильтровИсторииВзаимодействияЗавершение(Результат, Параметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СписокФильтрацииИсторииВзаимодействия = Результат;	
	
	Если НЕ Объект.Ссылка.Пустая() Тогда		
		СформироватьИсториюВзаимодействияСКлиентом();
	КонецЕсли;
	
	ФильтрПрименен = ФильтрПрименен(СписокФильтрацииИсторииВзаимодействия);	
	Элементы.ОчиститьФильтры.Видимость	= ФильтрПрименен;
	Элементы.ПоказатьФильтры.Картинка	= ?(ФильтрПрименен, БиблиотекаКартинок.ФильтрУстановлен, БиблиотекаКартинок.ФильтрНеУстановлен);
	
	ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить("Справочники.Контрагенты.Форма.ФормаЭлементаКлиенты", "НастройкиФильтрации", СписокФильтрацииИсторииВзаимодействия);
		
КонецПроцедуры

&НаКлиенте 
// Процедура - Декорация фильтры очистить нажатие.
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ОчиститьФильтры(Команда)
	
	ОбщегоНазначенияКлиентСерверСтоматология.ЗаполнитьСписокФильтрацииИсторииВзаимодействияПоУмолчанию(СписокФильтрацииИсторииВзаимодействия,,, Объект.Ссылка);	
	
	Элементы.ОчиститьФильтры.Видимость	= Ложь;
	Элементы.ПоказатьФильтры.Картинка	= БиблиотекаКартинок.ФильтрНеУстановлен;
	
	ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить("Справочники.Контрагенты.Форма.ФормаЭлементаКлиенты", "НастройкиФильтрации", СписокФильтрацииИсторииВзаимодействия);

	Если НЕ Объект.Ссылка.Пустая() Тогда		
		СформироватьИсториюВзаимодействияСКлиентом();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
// Процедура - Добавить промокод
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ДобавитьПромокод(Команда)

	СписокДоступныхПромокодов = ПолучитьСписокДоступныхПромокодов(ЭтотОбъект.ПромокодыСуществующие);
	
	Если СписокДоступныхПромокодов.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВыбораПромокода", ЭтотОбъект);
		ЭтаФорма.ПоказатьВыборИзМеню(ОписаниеОповещения, СписокДоступныхПромокодов, Элементы.ДобавитьПромокод);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Редактировать состав свойств
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура РедактироватьСоставСвойств(Команда)
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОповещенийАсинхронныхСобытий

&НаКлиенте
// Процедура проверяет дублирование клиента по телефони и E-mail.
//
Процедура ПроверкаДублированияКлиентаКонтактнаяИнформация(ДанныеКИ, ТекстРедактирования) Экспорт
	
	// Если (ПредупреждениеДублирование <> Неопределено И ПредупреждениеДублирование = Истина) Тогда
	//	Возврат;	
	// КонецЕсли;
	
	ТипКИ = ДанныеКИ.Тип;
	
	МассивКлиентов = ПроверитьНаДублированиеКлиентаКИ(Объект.Ссылка, ТипКИ, ТекстРедактирования);
	
	Если МассивКлиентов <> Неопределено 
		И МассивКлиентов.Количество() > 0 Тогда		
		
		// Текст = ?(МассивКлиентов.Количество() > 1,"Клиенты с такими данными уже существуют, открыть список клиентов?", "Клиент с такими данными уже существует, открыть существующего клиента?");		
		// ПоказатьВопрос(Новый ОписаниеОповещения("ПроверкаДублированияКлиентаКонтактнаяИнформацияОтвет", ЭтотОбъект, МассивКлиентов), Текст, РежимДиалогаВопрос.ДаНет);		
		
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Да';en='Yes'"));
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Нет';en='Not'"));
		СписокКнопок.Добавить(КодВозвратаДиалога.Нет, НСтр("ru='Открыть существующего';en='Open existing'"));
		
		
		Оповещение = Новый ОписаниеОповещения("ПроверкаДублированияКлиентаКонтактнаяИнформацияОтвет", ЭтотОбъект, Новый Структура("МассивКлиентов, ДанныеКИ", МассивКлиентов, ДанныеКИ));
		
		ПоказатьВопрос(Оповещение, НСтр("ru='Клиент с такими данными уже существует. Продолжить?';en='Client with such data already exists. Continue?'"), СписокКнопок);
		
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
// Процедура - Проверка дублирования клиента контактная информация ответ
// Завершение немодального открытия окна "ПоказатьВопрос()" 
// Параметры:
//  РезультатВопроса - Ответ на вопрос
//  Параметры	     - Параметры вопроса 
//
Процедура ПроверкаДублированияКлиентаКонтактнаяИнформацияОтвет(РезультатВопроса, Параметры)  Экспорт
	
	// Если РезультатВопроса = КодВозвратаДиалога.Да  Тогда
	//	Модифицированность = Ложь; 
	//	Закрыть();
	//	МассивКлиентов = Параметры;
	//	Если МассивКлиентов.Количество() > 1 Тогда
	//		ФормаКлиенты = ПолучитьФорму("Справочник.Контрагенты.Форма.ФормаСписка");
	//		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ФормаКлиенты.Список, "Ссылка", МассивКлиентов, Истина, ВидСравненияКомпоновкиДанных.ВСписке);
	//		ФормаКлиенты.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	//		ФормаКлиенты.Открыть();
	//	Иначе
	//		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(МассивКлиентов[0]);
	//		ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);
	//	КонецЕсли;                                            		
	// Иначе
	//	ПредупреждениеДублирование = Истина;
	// КонецЕсли; 
	
	Если РезультатВопроса = КодВозвратаДиалога.Да  Тогда		
		
		// Если Объект.Ссылка.Пустая() Тогда
		//	
		//	Оповещение = Новый ОписаниеОповещения("ПоказатьРодственнуюСвязьПослеВопросаОЗаписиКлиента", ЭтотОбъект, Параметры);
		//	ПоказатьВопрос(Оповещение, НСтр("ru='Для продолжения необходимо произвести запись нового клиента. Записать?';en='For create interactions is necessary toproduce record new client. WriteDown?'"), РежимДиалогаВопрос.ДаНет);
		// Иначе		
		//	ПоказатьРодственнуюСвязь(Параметры);	
		// КонецЕсли;    		
		
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Отмена Тогда 
		
		Параметры.ДанныеКИ.ЗначенияПолей = "";
		Параметры.ДанныеКИ.Представление = "";	
		
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		
		Модифицированность = Ложь; 
		Закрыть();
		МассивКлиентов = Параметры.МассивКлиентов;
		
		Если МассивКлиентов.Количество() > 1 Тогда
			
			ФормаКлиенты = ПолучитьФорму("Справочник.Контрагенты.Форма.ФормаСписка");
			ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ФормаКлиенты.Список, "Ссылка", МассивКлиентов, Истина, ВидСравненияКомпоновкиДанных.ВСписке);
			ФормаКлиенты.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
			ФормаКлиенты.Открыть();
			
		Иначе
			
			НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(МассивКлиентов[0]);
			ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Куратор начало выбора завершение
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура КураторНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда 
		Объект.Куратор = Результат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Открыть форму ввода доп информации
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ОткрытьФормуВводаДопИнформации(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	УправлениеСвойствамиКлиентСтоматология.ОткрытьФормуВводаДопИнформации(Результат, ДополнительныеПараметры, ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
// Процедура "После вопроса о продолжении удаления скидки".
//
Процедура ПослеВопросаОПродолженииУдаленияСкидки(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ИДСтрокиДанных = ИдентификаторСтрокиДанныхПоИмениЭлемента(ЭтаФорма.ТекущийЭлемент.Имя);	
		СтрокаДанных   = ЭтаФорма.СкидкиСуществующие.НайтиПоИдентификатору(ИДСтрокиДанных);
		
		Если СтрокаДанных <> Неопределено Тогда
			
			СкидкаУдалена = УдалитьСкидку(Объект.Ссылка, СтрокаДанных.Скидка);
			
			Если СкидкаУдалена Тогда
				МассивРодителей = Новый Массив();
				МассивРодителей.Добавить("ГруппаСкидкиСуществующие");
				ОтображениеДополнительнойИнформации(МассивРодителей);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ПослеВопросаОЗаписиКлиента(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Результат = ЭтаФорма.Записать();
		
		Если Результат Тогда
			
			Если Параметры.ВыполнитьДействие = "ЗаписьНаПрием" Тогда
				СоздатьПриемНаКлиенте();
			ИначеЕсли Параметры.ВыполнитьДействие = "СозданиеПланаЛечения" Тогда
				СоздатьПланЛеченияНаКлиенте();
			ИначеЕсли Параметры.ВыполнитьДействие = "ДобавитьПредварительнуюЗапись" Тогда
				ОткрытьЖурналЗаписиПоКлиенту(Объект.Ссылка);
			ИначеЕсли Параметры.ВыполнитьДействие = "СоздатьSMS" Тогда
				СоздатьSMSРассылкуНаКлиенте();
	        ИначеЕсли Параметры.ВыполнитьДействие = "СоздатьПисьмо" Тогда
				СоздатьПисьмоНаКлиенте(); 
			 ИначеЕсли Параметры.ВыполнитьДействие = "ОтправитьПоПочте" Тогда
				ОтправитьПоПочте(Параметры.ИндексЭлемента);
			ИначеЕсли Параметры.ВыполнитьДействие = "ПерейтиКДиалогу" Тогда
				Подключаемый_ПерейтиКДиалогу(Параметры.Элемент);
			КонецЕсли;
			
		КонецЕсли;
		
КонецЕсли;

КонецПроцедуры  

#КонецОбласти

#Область ВзаимодействияСКлиентом

#Область Задачи

&НаКлиенте
// Процедура - Выбор сделки взаимодействия.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВыборСделкиВзаимодействия(Команда)
	
	СписокВыбора = ВернутьСписокСделокКлиента(Объект.ссылка);
	
	Если ЗначениеЗаполнено(СписокВыбора) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ОбработчикВыбораСделкиВзаимодействия", ЭтотОбъект);
		ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Элементы.ВзаимодействиеСделка);
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Нет доступных сделок!'; en = 'No deals available!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка сделки взаимодействия клиента завершение.
//
Процедура ОбработчикВыбораСделкиВзаимодействия(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда 		
		УстановитьСостояниеЭлементовСделкиВзаимодействия(Результат.Значение.Сделка, Результат.Значение.ЦветЭтапа);  		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// обработчик события "Взаимодействие задача режим напоминания".
//
Процедура ВзаимодействиеЗадачаРежимНапоминания(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыборРежимаНапоминанияЗавершение", ЭтотОбъект);
	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора, Элементы.ВзаимодействиеЗадачаНапоминание);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор взаимодействия завершение
//
Процедура ВыборРежимаНапоминанияЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания    = Результат.Значение;
		Элементы.ВзаимодействиеЗадачаНапоминание.Заголовок = Результат.Представление; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие Письмо отправить.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура ВзаимодействиеПисьмоОтправить(Команда)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеПисьмоТема)
		И ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеПисьмоТекст)
		И ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП) Тогда
		
		ВзаимодействиеПисьмоОтправитьСервер();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнены данные письма!';en='Data letters are not filled!'"));
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//// Обработчик события "Взаимодействие задача статус не выполнена".
////
//Процедура ВзаимодействиеЗадачаСтатусНеВыполнена(Команда)
//	
//	ЭтотОбъект.ВзаимодействиеЗадачаВыполнена = Ложь;
//	
//	УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(
//	Элементы.ГруппаВзаимодействиеЗадачаСтатусНеВыполнена,
//	Элементы.ГруппаВзаимодействиеЗадачаСтатусВыполнена,
//	Ложь
//	);
//	
//КонецПроцедуры

&НаКлиенте
// Процедура - Задача выполнена при изменении.
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ЗадачаВыполненаПриИзменении(Элемент)
	
	Если ЭтотОбъект.ВзаимодействиеЗадачаВыполнена = Ложь Тогда
		УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(
		Элементы.ГруппаВзаимодействиеЗадачаСтатусНеВыполнена,
		Элементы.ГруппаВзаимодействиеЗадачаСтатусВыполнена,
		Ложь
		);
		
	Иначе
		ЭтотОбъект.ВзаимодействиеЗадачаДата      = ПолучитьОкругленноеВремяВзаимодействия(Истина);
		ЭтотОбъект.ВзаимодействиеЗадачаВыполнена = Истина;
		
		УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(
		Элементы.ГруппаВзаимодействиеЗадачаСтатусВыполнена,
		Элементы.ГруппаВзаимодействиеЗадачаСтатусНеВыполнена,
		Истина
		);
		
		ВзаимодействиеЗадачаДатаПриИзмененииНаСервере();
				
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//// Обработчик события "Взаимодействие задача статус выполнена".
////
//Процедура ВзаимодействиеЗадачаСтатусВыполнена(Команда)
//	
//	ЭтотОбъект.ВзаимодействиеЗадачаДата      = ПолучитьОкругленноеВремяВзаимодействия(Истина);
//	ЭтотОбъект.ВзаимодействиеЗадачаВыполнена = Истина;
//	
//	УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(
//	Элементы.ГруппаВзаимодействиеЗадачаСтатусВыполнена,
//	Элементы.ГруппаВзаимодействиеЗадачаСтатусНеВыполнена,
//	Истина
//	);
//	
//	ВзаимодействиеЗадачаДатаПриИзмененииНаСервере();
//	
//КонецПроцедуры

&НаСервере
// Процедура - Взаимодействие задача звонок дата при изменении на сервере.
//
// Параметры:
//  Элемент	 - 	 -
//
Процедура ВзаимодействиеЗадачаДатаПриИзмененииНаСервере()
	
	ЗаполнитьСписокВыбораВремениЭлемента("ВзаимодействиеЗадачаВремя", ЭтотОбъект.ВзаимодействиеЗадачаДата);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда взаимодействие создать.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеЗадачаСоздать(Команда)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеЗадачаДата) Тогда
		ВзаимодействиеЗадачаСоздатьСервер();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнены данные взаимодействия!'; en = 'Interaction data is not filled!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик оповещения.
//
Процедура ВзаимодействиеЗадачаСоздатьСервер()
	
	ДанныеЗаполнения = Новый Структура;
	// ДанныеЗаполнения.Вставить("ЗадачаПредмет"              , Объект.Ссылка);
	ДанныеЗаполнения.Вставить("Контрагент"                 , Объект.Ссылка);
	ДанныеЗаполнения.Вставить("ВидВзаимодействия"          , ЭтотОбъект.ВзаимодействиеПараметры.ВидВзаимодействия);
	ДанныеЗаполнения.Вставить("ВидВзаимодействияСправочник", ЭтотОбъект.ВзаимодействиеПараметры.Взаимодействие);
	ДанныеЗаполнения.Вставить("Исполнитель"                , ЭтотОбъект.ВзаимодействиеЗадачаИсполнитель);
	ДанныеЗаполнения.Вставить("ЗадачаНазначеннаяДата"      , ЭтотОбъект.ВзаимодействиеЗадачаДата);
	ДанныеЗаполнения.Вставить("ЗадачаТема"                 , ?(ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеЗадачаТема), ЭтотОбъект.ВзаимодействиеЗадачаТема, ""));
	ДанныеЗаполнения.Вставить("ЗадачаОписание"             , ЭтотОбъект.ВзаимодействиеЗадачаТекст);
	ДанныеЗаполнения.Вставить("Сделка"                     , ЭтотОбъект.ВзаимодействиеСделка);
	ДанныеЗаполнения.Вставить("Выполнена"                  , ЭтотОбъект.ВзаимодействиеЗадачаВыполнена);
	
	НоваяЗадача = Задачи.Взаимодействие.СоздатьЗадачу();
	НоваяЗадача.Заполнить(ДанныеЗаполнения);	
	
	Задачи.Взаимодействие.ЗаполнитьПараметрыНапоминания(НоваяЗадача, Новый Структура("ЗадачаРежимНапоминания", ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания));	
	
	НоваяЗадача.Записать();
	
	// ОбновитьИсториюВзаимодействияСКлиентом(, Элементы.КнопкаПодробно.Пометка);
	// Фильтры = Новый Структура();
	СформироватьИсториюВзаимодействияСКлиентом();
	
	ВзаимодействиеЗадачаТема  = "";
	ВзаимодействиеЗадачаТекст = "";
	
	СнятьВидимостьВсплывающихГруппСервер("ВзаимодействиеЗадача");
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить задачу
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ДобавитьЗадачу(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыборВзаимодействиеЗадачаЗавершение", ЭтотОбъект);
	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеСписокВыбора);

КонецПроцедуры

&НаКлиенте
// Процедура, оброботчик оповещения.
//
Процедура ВзаимодействиеПослеВопросаОЗаписиКлиента(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да 
		И ЭтаФорма.Записать() Тогда 		
		Действие = ДопПараметры.ВыполнитьДействие; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Промокоды 

&НаСервереБезКонтекста
// Функция - Получить список доступных мест работы
//
// Параметры:
//  ТЧ_МестаРаботы	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСписокДоступныхПромокодов(Знач ТаблицаПромокодов)
	
	СписокДоступныхПромокодовДляВыбора = Новый СписокЗначений;
	
	МассивДобавленныхПромокодов = ТаблицаПромокодов.Выгрузить().ВыгрузитьКолонку("ПромокодСсылка");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Промокоды.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Промокоды КАК Промокоды
	|ГДЕ
	|	Промокоды.Реферальный
	|	И НЕ Промокоды.ПометкаУдаления
	|	И НЕ Промокоды.Ссылка В (&МассивСсылок)
	|	И НЕ Промокоды.Владельцы");
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивДобавленныхПромокодов);
	
	МассивДобавляемыхПромокодов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Для Каждого ЭлементМассива Из МассивДобавляемыхПромокодов Цикл
		СписокДоступныхПромокодовДляВыбора.Добавить(ЭлементМассива, Строка(ЭлементМассива),, БиблиотекаКартинок.Реквизит);
	КонецЦикла;	
	
	Возврат СписокДоступныхПромокодовДляВыбора;
	
КонецФункции

&НаКлиенте 
// Процедура - Завершения выбора промокода.
//
Процедура ЗавершениеВыбораПромокода(ВыбранныйЭлемент, Параметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда 
		
		Возврат;
		
	ИначеЕсли ЗначениеЗаполнено(ВыбранныйЭлемент.Значение) Тогда 
		
		НоваяСтрока		 		 	 = ЭтотОбъект.ПромокодыСуществующие.Добавить();
		НоваяСтрока.ПромокодСсылка	 = ВыбранныйЭлемент.Значение;
		НоваяСтрока.Промокод		 = ЗаписатьИПолучитьПромокод(Объект.Ссылка, ВыбранныйЭлемент.Значение);
		НоваяСтрока.Активен			 = Истина;
		
		Оповестить("ОбновленыПромокоды"); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Завершение выбора промокода на сервере
//
// Параметры:
//  ВыбранныйЭлемент		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Функция ЗаписатьИПолучитьПромокод(Владелец, Вид)
	
	Возврат РегистрыСведений.Промокоды.ЗаписатьИПолучитьРеферальныйКод(Владелец, Вид);
	
КонецФункции

#КонецОбласти

&НаСервереБезКонтекста
// Функция, возвращает данные внешних систем мессенджера.
//
Функция ПолучитьДоступныеВнешниеСистемыМессенджера(Клиент, СтруктурнаяЕдиница, ДляОтправкиПервым = Ложь, МассивТребуемыхНомеров = Неопределено)
	
	Возврат Справочники.ВнешниеСистемы.ПолучитьДоступныеВнешниеСистемыМессенджера(Клиент,СтруктурнаяЕдиница,ДляОтправкиПервым, МассивТребуемыхНомеров);
	
КонецФункции

&НаСервере
// Процедура, производит автокоррекцию ФИО.
//
Процедура ПроизвестиАвтокоррекциюФИО()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Автокоррекция = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.Родитель, "Автокоррекция");	
	Если Автокоррекция = 2 Тогда
		Объект.Фамилия	= ВРег(СокрЛП(Объект.Фамилия));
		Объект.Имя		= ВРег(СокрЛП(Объект.Имя));
		Объект.Отчество = ВРег(СокрЛП(Объект.Отчество));
	ИначеЕсли Автокоррекция = 1 Тогда
		Объект.Фамилия	= ТРег(СокрЛП(Объект.Фамилия));// ВРег(Сред(Объект.Фамилия, 1, 1)) + НРег(Сред(Объект.Фамилия, 2));
		Объект.Имя		= ТРег(СокрЛП(Объект.Имя));// ВРег(Сред(Объект.Имя, 1, 1)) + НРег(Сред(Объект.Имя, 2));
		Объект.Отчество = ТРег(СокрЛП(Объект.Отчество));// ВРег(Сред(Объект.Отчество, 1, 1)) + НРег(Сред(Объект.Отчество, 2));
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
// Процедура, проверяет обязательные поля для заполнения из установленных настроек.
//
Процедура УстановитьОбязательныеПоля() 
	
	ХранилищеСтруктураОбязательныеПоля = Константы.ОбязательныеПоляКлиенты.Получить();
	СтруктураОбязательныеПоля = ХранилищеСтруктураОбязательныеПоля.Получить();	
	
	Если СтруктураОбязательныеПоля = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Для Каждого ОбязательноеПоле Из СтруктураОбязательныеПоля Цикл
		
		Если Лев(ОбязательноеПоле.Ключ, 6) <> "КЛИЕНТ" Тогда 
			Продолжить;	
		КонецЕсли;	
		
		ИзмененноеОбязательноеПоле = СтрЗаменить(ОбязательноеПоле.Ключ, "КЛИЕНТ_", "");
		
		Если СтрЗаменить(ИзмененноеОбязательноеПоле, Прав(ИзмененноеОбязательноеПоле, 1), "") = "ПредставлениеКИ_" И ОбязательноеПоле.Значение = Истина Тогда 
			
			КоличествоЭлементовКИ = Элементы.КонтактнаяИнформация.ПодчиненныеЭлементы.Количество();
			ИндексЭлементаКИ = 0;
			
			Пока КоличествоЭлементовКИ <> 0 Цикл
				
				ТекЭлемент = Элементы.Найти(СтрЗаменить(ИзмененноеОбязательноеПоле, Прав(ИзмененноеОбязательноеПоле, 1), "") + ИндексЭлементаКИ);
				Если ТекЭлемент <> Неопределено Тогда 
					
					Если ОбязательноеПоле.Ключ = "КЛИЕНТ_ПредставлениеКИ_0" 
						ИЛИ ОбязательноеПоле.Ключ = "КЛИЕНТ_ПредставлениеКИ_1"
						ИЛИ ОбязательноеПоле.Ключ = "КЛИЕНТ_ПредставлениеКИ_2" Тогда
						
						ТекЭлемент.АвтоОтметкаНезаполненного = ОбязательноеПоле.Значение;
					КонецЕсли;
					
					КоличествоЭлементовКИ = КоличествоЭлементовКИ - 1;
					
				КонецЕсли;
				
				ИндексЭлементаКИ = ИндексЭлементаКИ + 1;
				
			КонецЦикла;
			
		Иначе
			
			ТекЭлемент = Элементы.Найти(ИзмененноеОбязательноеПоле);
			Если ТекЭлемент <> Неопределено И Не ТекЭлемент = Элементы.Пол Тогда 
				ТекЭлемент.АвтоОтметкаНезаполненного = ОбязательноеПоле.Значение;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик события Выполнить команды РедактироватьСоставСвойств.
//
Процедура Подключаемый_СвойстваВыполнитьКоманду(Команда)
	
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры // РедактироватьСоставСвойств()

&НаКлиенте
// Процедура - Подключаемый декорация формы представление нажатие
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ДекорацияФормы_Представление_Нажатие(Элемент)
	
	УправлениеСвойствамиКлиентСтоматология.ДействиеДополнительнойИнформацииНажатие(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый декорация формы представление обработка навигационной ссылки
//
// Параметры:
//  Элемент				 - 	 - 
//  НавигационнаяСсылка	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура Подключаемый_ДекорацияФормы_Представление_ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	УправлениеСвойствамиКлиентСтоматология.ДействиеДополнительнойИнформацииНажатие(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаСервере
// Процедура, обновляет элементы дополнительных реквизитов.
//
Процедура ОбновитьДополнительныеРеквизиты()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры // ОбновитьЭлементыДополнительныхРеквизитов()

&НаСервере
// Процедура - управляет отображением элементов формы
//
Процедура УправлениеЭлементамиФормы()
	
	Элементы.КлиентИсточникИнформации.Видимость = (Объект.ИсточникИнформации = Справочники.РекламныеИсточники.ДругойПациент);
	
	Элементы.Организация.Видимость = (Объект.СоциальныйСтатус = Справочники.СоциальныеСтатусыКонтрагентов.Военнослужащий 
										ИЛИ Объект.СоциальныйСтатус = Справочники.СоциальныеСтатусыКонтрагентов.Работающий 
										ИЛИ Объект.СоциальныйСтатус = Справочники.СоциальныеСтатусыКонтрагентов.Учащийся);
	Элементы.Профессия.Видимость    = (Объект.СоциальныйСтатус = Справочники.СоциальныеСтатусыКонтрагентов.Работающий);									
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Элементы.ФормаСоздатьПрием.Доступность = Истина;
		// Элементы.ФормаСоздатьПрием.Видимость   = Истина;
		// Скроем для Врача контактную информацию
		Если ПараметрыСеанса.ТекущийПользователь.РольПользователя = Перечисления.РольПользователя.Врач Тогда 
		//	Элементы.ДатаРождения.Видимость 						= Ложь;
			Элементы.ГруппаКонтактнаяИнформацияКлиенты.Видимость			= Ложь;
			Элементы.ГруппаКонтактнаяИнформацияСправочникКлиенты.Видимость	= Ложь;
			Элементы.КомандыДобавленияКонтактнойИнформации.Видимость		= Ложь;
			Элементы.ГруппаУдостоверениеЛичности.Видимость					= Ложь;
			Элементы.ГруппаСоциальныйСтатус.Видимость						= Ложь;
			Для Каждого ЭлементФормы Из Элементы.ГруппаОсновнаяКонтИнф.ПодчиненныеЭлементы Цикл 
				Если Найти(ЭлементФормы.Имя, "КИ_Поле") <> 0 Тогда 
					ЭлементФормы.Видимость = Ложь;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;	
	
	// Если ЗначениеЗаполнено(УдостоверениеЛичностиКонтрагента.ВидДокумента) Тогда
	//	Элементы.ВидДокумента.ТолькоПросмотр = Истина;
	// КонецЕсли;
	
	Элементы.ДобавитьМедКарту.Видимость = Объект.ТекущаяМедицинскаяКарта.Пустая();
	Элементы.ТекущаяМедицинскаяКартаКод.Видимость = Не Объект.ТекущаяМедицинскаяКарта.Пустая();
	
	// Отображение информации о дате создания документа
	
	// Элементы.ДекорацияДатаСоздания.Видимость = НЕ Объект.Ссылка.Пустая();
	// Элементы.ДекорацияДатаСоздания.Заголовок = "Создан: " + Формат(Объект.ДатаРегистрации, "ДФ='дд ММММ ""в"" ЧЧ:мм, '") + Объект.СотрудникРегистрации;	
	
	Если Объект.ДатаРожденияКлиента <> Дата(1,1,1) Тогда
		
		Элементы.ЗаконныйПредставитель.Видимость = Справочники.Контрагенты.ПолучитьВидимостьЗаконногоПредставителя(Объект.ДатаРожденияКлиента, Объект.НедееспособныйГражданин);

	Иначе
		
		Элементы.ЗаконныйПредставитель.Видимость = Ложь;
		
	КонецЕсли;	
	
	Элементы.ГруппаМеткиКлиента.Видимость = Истина;  
	
	УстановитьВидимостьЗначенияКаналаПривлечения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВозраст(ДатаРожденияКлиента)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РАЗНОСТЬДАТ(&ДатаРожденияКлиента, &ТекущаяДата, ГОД) КАК Возраст";
	
	Запрос.УстановитьПараметр("ДатаРожденияКлиента"	, ДатаРожденияКлиента);
	Запрос.УстановитьПараметр("ТекущаяДата"			, ТекущаяДата());
	
	Возраст = 0;
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		 Возраст = Выборка.Возраст;
	КонецЦикла;
	
	Возврат Возраст;
	
КонецФункции

&НаСервере
// Процедура, задает оформление статуса контрагента.
//
Процедура ОбновитьОформлениеКнопкиСтатусаКлиента()
	
	СоответствиеЦветов  			   = ПолучитьСоответствиеЦветовИСтатусовКлиентов();	
	Элементы.ГруппаСтатус.ЦветФона 	   = СоответствиеЦветов.Получить(ЭтотОбъект.СтатусКлиента);	 
	Элементы.ОткрытьИсториюСтатусов.Заголовок = Строка(ЭтотОбъект.СтатусКлиента);
	
КонецПроцедуры

&НаСервере
// Функция, возвращает цвета бизнес процессов.
//
Функция ПолучитьСоответствиеЦветовИСтатусовКлиентов()
	
	СоответствиеЦветовИСтатусовКлиентов = Новый Соответствие();                                                           
	СоответствиеЦветовИСтатусовКлиентов.Вставить(Перечисления.СтатусыКонтрагентов.Потенциальный	, Новый Цвет(3  , 156, 253)); // Голубой
	СоответствиеЦветовИСтатусовКлиентов.Вставить(Перечисления.СтатусыКонтрагентов.Первичный    	, Новый Цвет(0  , 112, 210)); // Синий
	СоответствиеЦветовИСтатусовКлиентов.Вставить(Перечисления.СтатусыКонтрагентов.Постоянный   	, Новый Цвет(136, 191, 136)); // Зеленый
	СоответствиеЦветовИСтатусовКлиентов.Вставить(Перечисления.СтатусыКонтрагентов.НеВернувшийся	, Новый Цвет(152, 59 , 69));  // Бордовый
	СоответствиеЦветовИСтатусовКлиентов.Вставить(Перечисления.СтатусыКонтрагентов.Отказ     	, Новый Цвет(255, 0  , 0));
	
	СоответствиеЦветовИСтатусовКлиентов.Вставить(Перечисления.СтатусыКонтрагентов.ПустаяСсылка(), Новый Цвет());
		
	Возврат СоответствиеЦветовИСтатусовКлиентов;
		
КонецФункции

&НаСервереБезКонтекста
// Функция возвращает ключ записи регистра.
//
Функция ВернутьВидДокументаДФЛДляВывода(Ссылка, Реквизит)
	
	Запрос = Новый Запрос(
	   "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	   |	ДокументыФизическихЛиц.Физлицо КАК Физлицо,
	   |	ДокументыФизическихЛиц.ВидДокумента КАК ВидДокумента,
	   |	ДокументыФизическихЛиц.Серия КАК Серия,
	   |	ДокументыФизическихЛиц.Номер КАК Номер,
	   |	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачи,
	   |	ДокументыФизическихЛиц.СрокДействия КАК СрокДействия,
	   |	ДокументыФизическихЛиц.КемВыдан КАК КемВыдан,
	   |	ДокументыФизическихЛиц.КодПодразделения КАК КодПодразделения,
	   |	ДокументыФизическихЛиц.ЯвляетсяДокументомУдостоверяющимЛичность КАК ЯвляетсяДокументомУдостоверяющимЛичность,
	   |	ДокументыФизическихЛиц.Представление КАК Представление 
	   |ИЗ
	   |	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	   |ГДЕ
	   |	ДокументыФизическихЛиц.Физлицо = &Физлицо");

	Запрос.УстановитьПараметр("Физлицо", Ссылка);  
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка[Реквизит], Неопределено);
	
КонецФункции // ПолучитьКлючЗаписи()

&НаКлиенте
//
//
Процедура ПроверкаДублированияКлиента(Знач Оповещение)
	
	Если (ПредупреждениеДублирование <> Неопределено И ПредупреждениеДублирование = Истина) И Оповещение <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(Оповещение);
		Возврат;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Фамилия) И ЗначениеЗаполнено(Объект.Имя) И ЗначениеЗаполнено(Объект.Отчество) И ЗначениеЗаполнено(Объект.ДатаРожденияКлиента) Тогда	
		
		Поля = "Фамилия;Имя;Отчество;ДатаРожденияКлиента";
		
		МассивКлиентов = ПроверитьНаДублированиеКлиентаПоля(Поля);
		Если МассивКлиентов <> Неопределено И МассивКлиентов.Количество() > 0 Тогда
        	Результат = Неопределено;

        	ПоказатьВопрос(Новый ОписаниеОповещения("ПроверкаДублированияКлиентаЗавершение", ЭтотОбъект, Новый Структура("МассивКлиентов, Оповещение", МассивКлиентов, Оповещение)), "Клиент с такими данными уже существует, открыть существующего клиента ?", РежимДиалогаВопрос.ДаНет);
            Возврат;                                       

		КонецЕсли;
		
	КонецЕсли;  
	
	ВыполнитьОбработкуОповещения(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаДублированияКлиентаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	МассивКлиентов = ДополнительныеПараметры.МассивКлиентов;
	Оповещение = ДополнительныеПараметры.Оповещение;

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь; Закрыть();
		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(МассивКлиентов[0]);
		ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);
	Иначе
		ПредупреждениеДублирование = Истина;
	КонецЕсли;                                       
	
	
	ВыполнитьОбработкуОповещения(Оповещение);

КонецПроцедуры

&НаСервере
//
//
Функция ПроверитьНаДублированиеКлиентаПоля(Поля)
	
	Возврат Справочники.Контрагенты.ПроверитьНаДублированиеКлиентаПоля(Объект, Поля);
		
КонецФункции
                                
&НаКлиенте
//
//
Функция ПолучитьСтруктуруПараметров(Элемент)
	
	КодСтраны = "";
	КодГорода = "";
	НомерТелефона = "";

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИмяЭлемента", 		Элемент.Имя);
	СтруктураПараметров.Вставить("ЗначениеЭлемента", 	Элемент.ТекстРедактирования);
	
	Если Элемент.Имя = "__КИ_Поле1" Тогда  // т.е. это телефон
		МассивСтрок = Этаформа.__КИ_ОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("ИмяРеквизита", Элемент.Имя)); 
		Если МассивСтрок.Количество() > 0 Тогда 
			СписокЗначений = МассивСтрок[0].ЗначенияПолей;
			Для Каждого ЭлементСписка Из МассивСтрок[0].ЗначенияПолей Цикл 
				Если ЭлементСписка.Представление = "КодСтраны" Тогда 
					КодСтраны = ЭлементСписка.Значение;
				КонецЕсли;
				Если ЭлементСписка.Представление = "КодГорода" Тогда 
					КодГорода = ЭлементСписка.Значение;
				КонецЕсли;
				Если ЭлементСписка.Представление = "НомерТелефона" Тогда
					НомерТелефона = ЭлементСписка.Значение;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;		
	КонецЕсли;
	
	СтруктураПараметров.Вставить("КодСтраны", 		КодСтраны);
	СтруктураПараметров.Вставить("КодГорода", 		КодГорода);
	СтруктураПараметров.Вставить("НомерТелефона", 	НомерТелефона);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервереБезКонтекста
// Функция проверяет на дубликат контрагента по контактной информации.
//
Функция ПроверитьНаДублированиеКлиентаКИ(Знач Ссылка, Знач ТипКИ, Знач ЗначениеЭлемента)
	
	Возврат Справочники.Контрагенты.ПроверитьНаДублированиеКлиентаКИ(Ссылка, ТипКИ, ЗначениеЭлемента);
	
КонецФункции


////////////////////////////////// ОБРАБОТЧИКИ ТАБЛИЦЫ ПОЛИСЫ МЕД. СТРАХОВАНИЯ ////////////////////////

&НаКлиенте
// Обработчик начала добавления полиса страхования
Процедура ПолисыМедицинскогоСтрахованияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ     = Истина;

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		ПоказатьВопрос(Новый ОписаниеОповещения("ПолисыМедицинскогоСтрахованияПередНачаломДобавленияЗавершение", ЭтотОбъект), "Предварительно необходимо сохрнить данные формы. Продолжить?",РежимДиалогаВопрос.ДаНет);
        Возврат;			
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ПолисыМедицинскогоСтрахования.ФормаОбъекта",Новый Структура("Основание,КотрагентТолькоПросмотр",Новый Структура("Контрагент",Объект.Ссылка),Истина));

КонецПроцедуры

&НаКлиенте
// Процедура - Полисы медицинского страхования перед началом добавления завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПолисыМедицинскогоСтрахованияПередНачаломДобавленияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЭтаФорма.Записать();
	Иначе
		Возврат;
	КонецЕсли;			
	
	ОткрытьФорму("Справочник.ПолисыМедицинскогоСтрахования.ФормаОбъекта",Новый Структура("Основание,КотрагентТолькоПросмотр",Новый Структура("Контрагент",Объект.Ссылка),Истина));

КонецПроцедуры

&НаКлиенте
// Обработчик выбора строки полиса
Процедура ПолисыМедицинскогоСтрахованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    ОткрытьФорму("Справочник.ПолисыМедицинскогоСтрахования.ФормаОбъекта",Новый Структура("Ключ,КотрагентТолькоПросмотр",ВыбраннаяСтрока,Истина));	
КонецПроцедуры

&НаКлиенте
// Обработчик перед началом изменения строки полиса
Процедура ПолисыМедицинскогоСтрахованияПередНачаломИзменения(Элемент, Отказ)
	Отказ         = Истина;
	ТекущаяСтрока = Элементы.ПолисыМедицинскогоСтрахования.ТекущаяСтрока;
	ОткрытьФорму("Справочник.ПолисыМедицинскогоСтрахования.ФормаОбъекта",Новый Структура("Ключ,КотрагентТолькоПросмотр",ТекущаяСтрока,Истина));
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении"
//
Процедура ПолисыМедицинскогоСтрахованияПриИзменении(Элемент)
	
	УстановитьОтборВСпискеПолисов();	
	
КонецПроцедуры

&НаСервере
//
//
Процедура УстановитьОтборВСпискеПолисов()
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ПолисыМедицинскогоСтрахования, "Контрагент", Объект.Ссылка, Истина, ВидСравненияКомпоновкиДанных.Равно);	
	
КонецПроцедуры

///////////////////////////////// СТРАНИЦА СКИДКИ ПАЦИЕНТА ////////////////////////////////////////

&НаСервереБезКонтекста
// Получить текущую СЕ 
//
Функция ТекущаяСтруктурнаяЕдиница()
	Возврат ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
КонецФункции

&НаСервереБезКонтекста
// Вернуть описание скидки
//
Функция ВернутьОписаниеСкидки(Скидка)
	Описание = новый Структура;
	Описание.Вставить("ТипСкидки"     ,?(Скидка.ТипПолучателя = 2,"Персональная","Общая"));
	Описание.Вставить("ТипПолучателя" ,Скидка.ТипПолучателя);
	Описание.Вставить("Скидка"        ,Скидка);
	Описание.Вставить("РазмерСкидки"  ,Строка(Скидка.ЗначениеСкидкиНаценки) + "%");
	ОписаниеСкидки = РегистрыСведений.ДействиеСкидокНаценок.ПолучитьПарамтерыДействияСкидки(Скидка,ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
    Описание.Вставить("ДатаНачала"    ,?(ОписаниеСкидки.Количество() > 0,ОписаниеСкидки[0].ДатаНачала,Неопределено));
    Описание.Вставить("ДатаОкончания" ,?(ОписаниеСкидки.Количество() > 0,ОписаниеСкидки[0].ДатаОкончания,Неопределено));
	Возврат Описание;
КонецФункции

&НаСервереБезКонтекста
// Изменить состав получателя скидки
//
Процедура ИзменитьСоставПолучателейСкидки(Скидка, Клиент, Добавить)	
	
	Скидкаобъект = Скидка.Получитьобъект();
	Если Добавить Тогда
		НоваяСтрока            = Скидкаобъект.Получатели.Добавить();
		НоваяСтрока.Получатель = Клиент;
	Иначе
		НайденнаяСтрока = Скидкаобъект.Получатели.НайтиСтроки(Новый Структура("Получатель", Клиент));
		Если НайденнаяСтрока.Количество() > 0 Тогда
			Скидкаобъект.Получатели.Удалить(НайденнаяСтрока[0]);
		КонецЕсли;
	КонецЕсли;
	Скидкаобъект.Записать();
	
КонецПроцедуры

#Область МеткиКлиента

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ОбработчикРедактированияМеток(Команда)
	
	ОбновитьМетки(Ложь);

КонецПроцедуры
 
&НаКлиенте
// Процедура, обработчик команды подключаемый "ОтображатьМеткуПриНажатии".
//
Процедура Подключаемый_ОтображатьМеткуПриНажатии(Команда)
	
	КнопкаМетки = ТекущийЭлемент;
	ГруппаМетки = КнопкаМетки.Родитель;
	
 	ИндексМетки = Число(СтрЗаменить(КнопкаМетки.Имя, Лев(КнопкаМетки.Имя, Найти(КнопкаМетки.Имя, "_")), ""));
	ДанныеМетки = ЭтотОбъект.ТаблицаМеток.НайтиПоИдентификатору(ИндексМетки);
	
	Если ДанныеМетки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовоеЗначениеАктивности = Не ДанныеМетки.Активна;
	
	ЗаписатьИзменениеМетки(ДанныеМетки.Метка, Объект.Ссылка, НовоеЗначениеАктивности);
	
	ДанныеМетки.Активна = НовоеЗначениеАктивности;
	
	КнопкаМетки.ЦветТекста	 = ?(НовоеЗначениеАктивности И ДанныеМетки.ЦветТекстаБелый, Новый Цвет(255, 255, 255), Новый Цвет(77, 77, 77));
	ГруппаМетки.ЦветФона	 = ?(НовоеЗначениеАктивности, ДанныеМетки.ЦветФона, Новый Цвет(255, 255, 255));

КонецПроцедуры

&НаСервере
// Процедура, инициирует обновление меток клиента.
//
Процедура ОбновитьМетки(СоздатьСсылкуРедактирования = Истина)
	
	РегистрыСведений.МеткиКлиентов.СоздатьВизуальныеЭлементыМеток(
		Объект.Ссылка,
		ЭтаФорма,
		Элементы.ГруппаМеткиКлиента,
		СоздатьСсылкуРедактирования
	);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, записывает изменение метки в регистр.
//
Процедура ЗаписатьИзменениеМетки(Метка, Клиент, Активна)
	
	НаборЗаписей = РегистрыСведений.МеткиКлиентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Клиент.Установить(Клиент);
	НаборЗаписей.Отбор.Метка.Установить(Метка);
	
	Если Активна = Истина Тогда
		
		НоваяЗапись			 = НаборЗаписей.Добавить();
		НоваяЗапись.Период	 = ТекущаяДатаСеанса();
		НоваяЗапись.Клиент	 = Клиент;
		НоваяЗапись.Метка	 = Метка;
		НоваяЗапись.Активна	 = Активна;
		НоваяЗапись.Автор	 = ПараметрыСеанса.ТекущийПользователь;
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет таблицу меток разрешенными метками и устанавливает значения их активности.
//
Процедура ЗаполнитьТаблицуМеток()
	
	ТаблицаМеток.Очистить();
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Метки.Ссылка КАК Метка,
	|	ВЫБОР
	|		КОГДА МеткиДокументаКлиента.Активна
	|			ТОГДА МеткиДокументаКлиента.Активна
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Активна,
	|	Метки.ЦветМетки КАК ЦветМетки,
	|	Метки.ЦветТекстаБелый КАК ЦветТекстаБелый,
	|	Метки.Наименование КАК ПредставлениеМетки
	|ИЗ
	|	Справочник.Метки КАК Метки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МеткиКлиентов.Метка.Ссылка КАК МеткаСсылка,
	|			МеткиКлиентов.Активна КАК Активна
	|		ИЗ
	|			РегистрСведений.МеткиКлиентов КАК МеткиКлиентов
	|		ГДЕ
	|			МеткиКлиентов.Клиент = &Ссылка
	|			И МеткиКлиентов.Активна) КАК МеткиДокументаКлиента
	|		ПО Метки.Ссылка = МеткиДокументаКлиента.МеткаСсылка.Ссылка
	|ГДЕ
	|	Метки.ИспользоватьДляПациентов
	|
	|СГРУППИРОВАТЬ ПО
	|	Метки.Ссылка,
	|	ВЫБОР
	|		КОГДА МеткиДокументаКлиента.Активна
	|			ТОГДА МеткиДокументаКлиента.Активна
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Метки.Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Метка Из Результат Цикл
		
		СтрокаТаблицы = ТаблицаМеток.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Метка);
		
		Если ЗначениеЗаполнено(Метка.ЦветМетки) Тогда
			
			ЦветМетки = ЗначениеИзСтрокиВнутр(Метка.ЦветМетки);
			
			Если ЦветМетки.Вид = ВидЦвета.АвтоЦвет Или (ЦветМетки.Красный = 255 И ЦветМетки.Зеленый = 255 И ЦветМетки.Синий = 255) Тогда
				ЦветФона = Новый Цвет(242, 242, 242);
			Иначе
				ЦветФона = ЦветМетки;
			КонецЕсли;
			
		Иначе
			ЦветФона = Новый Цвет(242, 242, 242);
			
		КонецЕсли;
		
		СтрокаТаблицы.ЦветФона = ЦветФона;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОткрытьНастройкаОбязательныеПоля(Команда)
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаНастройкаОбязательныеПоля",,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаСервере
// Функция возвращает булево значение о наличии действующего медицинского страхового полиса клиента.
//
Функция ЕстьДействующийПолис()
	
	Запрос = Новый Запрос("ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	                      |	ПолисыМедицинскогоСтрахования.Ссылка
	                      |ИЗ
	                      |	Справочник.ПолисыМедицинскогоСтрахования КАК ПолисыМедицинскогоСтрахования
	                      |ГДЕ
	                      |	ПолисыМедицинскогоСтрахования.Контрагент = &Контрагент
	                      |	И &ТекущаяДата МЕЖДУ ПолисыМедицинскогоСтрахования.ДанаНачала И ПолисыМедицинскогоСтрахования.ДатаОкончания");
	Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат Результат.Следующий();
	
КонецФункции

&НаКлиенте
// Функция - Проверить видимость всплывающей группы.
//
// Параметры:
//  ИмяВзаимодействия	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПроверитьВидимостьВсплывающихГрупп(ИмяЭлемента, ИндексЭлемента = Неопределено, СменитьФокус = Истина)
	
	Результат = ОбщегоНазначенияКлиентСтоматология.ПроверитьВидимостьВсплывающихГрупп(ЭтаФорма, ИмяЭлемента, ИндексЭлемента);
	
	Если СменитьФокус И Результат = Ложь Тогда 
		УстановитьФокусЭлемента();
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

&НаСервере
// Процедура - Снять видимость всплывающих групп на сервере.
//
// Параметры:
//  ИмяВзаимодействия	 - 	 - 
//  Видимость			 - 	 - 
//
Процедура СнятьВидимостьВсплывающихГруппСервер(ИмяЭлемента, ЭлементФокуса = Неопределено)
	
	УправлениеИнтерфейсамиСервер.СнятьВидимостьВсплывающихГрупп(ЭтаФорма, ИмяЭлемента); 
	
	УстановитьФокусЭлементаСервер(ЭлементФокуса);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Установить фокус элемента.
//
Процедура УстановитьФокусЭлемента(ЭлементФокуса = Неопределено)
	
	ЭтаФорма.ТекущийЭлемент = ?(ЭлементФокуса <> Неопределено, Элементы[ЭлементФокуса], Элементы.Имя);
	
КонецПроцедуры    

&НаСервере
// Процедура - Установить фокус элемента на сервере.
//
Процедура УстановитьФокусЭлементаСервер(ЭлементФокуса = Неопределено)
	
	ЭтаФорма.ТекущийЭлемент = ?(ЭлементФокуса <> Неопределено, ЭлементФокуса, Элементы.Имя);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Установить видимость всплывающих групп.
//
// Параметры:
//  ИмяВзаимодействия	 - 	 - 
//  Видимость			 - 	 - 
//
Процедура УстановитьВидимостьВсплывающихГрупп(ИмяЭлемента, ИндексЭлемента = Неопределено)
	
	ОбщегоНазначенияКлиентСтоматология.УстановитьВидимостьВсплывающихГрупп(ЭтаФорма, ИмяЭлемента, ИндексЭлемента);
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить значения структуры данных всплывающих групп.
//
Процедура СформироватьСтруктуруДанныхВсплывающихГрупп()
	
	ПараметрыВидимости = Новый Структура;		
	ПараметрыВидимости.Вставить("ИсторияСтатусов"     , Ложь);
	ПараметрыВидимости.Вставить("ВзаимодействиеЗадача", Ложь);
	ПараметрыВидимости.Вставить("SMS"                 , Ложь);
	ПараметрыВидимости.Вставить("Письмо"              , Ложь);
		
	УправлениеИнтерфейсамиСервер.СформироватьРеквизитСтруктурыДанныхВсплывающихГрупп(ЭтаФорма, ПараметрыВидимости);
	
КонецПроцедуры

#Область Статусы

&НаСервере
// Процедура, добавляет на форму статусы контрагента.
//
Процедура ВывестиИсториюСтатусовКонтрагента()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыКонтрагентов.Период КАК Период,
	|	СтатусыКонтрагентов.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыКонтрагентов КАК СтатусыКонтрагентов
	|ГДЕ
	|	СтатусыКонтрагентов.Контрагент = &Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ");
	
	Запрос.УстановитьПараметр("Контрагент",	Объект.Ссылка);
	
	ТаблицаСтатусов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТ Из ТаблицаСтатусов Цикл
		
		НоваяСтрока = ЭтотОбъект.СтатусыКлиента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТ);
		
		ИндексЭлементов = НоваяСтрока.ПолучитьИдентификатор(); 
		
		СкопироватьЭлементФормыРекурсивно(Элементы.ГруппаСтатус_Шаблон, Элементы.ГруппаИсторияСтатусов, ИндексЭлементов);						
		
		Элементы["ДекорацияПериод_" + ИндексЭлементов].Заголовок = Формат(СтрокаТ.Период, "ДФ='д МММ гггг'"); 
		
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВРеквизитСтруктурыДанныхВсплывающихГрупп(ЭтаФорма, "Статус_" + ИндексЭлементов);	
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
// Процедура, копирует элементы формы.
//
Процедура СкопироватьЭлементФормыРекурсивно(Источник, Родитель, Индекс)
	
	Если ТипЗнч(Источник) = Тип("ГруппаФормы") Тогда
		
		ГруппаРодитель = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(ЭтаФорма, Источник, Индекс, Родитель);
		
		Для Каждого Элемент Из Источник.ПодчиненныеЭлементы Цикл
			СкопироватьЭлементФормыРекурсивно(Элемент, ГруппаРодитель, Индекс);	
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("КнопкаФормы") Тогда 
		
		УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(ЭтаФорма, Источник, Индекс, Родитель);
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДекорацияФормы") Тогда	
		
		УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(ЭтаФорма, Источник, Индекс, Тип("ДекорацияФормы"), Родитель);				
	Иначе		
		УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(ЭтаФорма, Источник, Индекс, Тип("ПолеФормы"), Родитель, ВернутьПутьКДанным(Источник, Индекс));				
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - Вернуть путь к данным
//
// Параметры:
//  ИмяЭлемента	 - 	 - 
//  Индекс		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьПутьКДанным(Источник, Индекс)
	
	ИмяЭлемента = Источник.Имя;
	
	Если СтрНайти(ИмяЭлемента, "Документ") > 0 Тогда 
		
		ПутьКДанным = Источник.ПутьКДанным;
	Иначе
		ПутьКДанным = СтрЗаменить(Источник.ПутьКДанным, "[0]", "[" + Индекс + "]");
	КонецЕсли;
	
	Возврат ПутьКДанным;
	
КонецФункции

#Область КонтактнаяИнформация

&НаКлиенте
// Процедура - Добавить контактную информацию
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ДобавитьКонтактнуюИнформацию(Команда)

	Если РазрешеноДобавлятьКИ() Тогда
		ДобавитьКонтактнуюИнформациюНажатие();
	Иначе
		ПоказатьПредупреждение(,НСтр("ru='Ограничение прав доступа.';en='Limitation is right access.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКонтактнуюИнформациюНажатие() 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьКонтактнуюИнформациюВидВыбран", ЭтотОбъект);
	СписокДоступныхВидов = УправлениеКонтактнойИнформациейКлиентСерверСтоматология.СписокВидовДляДобавленияКонтактнойИнформации(ЭтаФорма.СвойстваВидовКонтактнойИнформации, ЭтаФорма.КонтактнаяИнформация);
	ЭтаФорма.ПоказатьВыборИзМеню(ОписаниеОповещения, СписокДоступныхВидов, Элементы.КнопкаДобавитьКонтактнуюИнформацию);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКонтактнуюИнформациюВидВыбран(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("Вид", ВыбранныйЭлемент.Значение);
	
	НайденныеСтроки = ЭтаФорма.СвойстваВидовКонтактнойИнформации.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	СвойстваВида = НайденныеСтроки[0];
	
	ДобавитьКонтактнуюИнформациюСервер(ВыбранныйЭлемент.Значение);
	
	ЗначениеКонстантыОбязательныеПоля = ВернутьЗначениеКонстантыОбязательныеПоля();
	Если ЗначениеКонстантыОбязательныеПоля <>  Неопределено Тогда
	    Оповестить("ОБНОВИТЬ_ОБЯЗАТЕЛЬНЫЕ_ПОЛЯ");
	КонецЕсли;
	
	Если СвойстваВида.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
		ОбновитьДанныеИзменяемыхТелефонов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Добавить контактную информацию сервер
//
// Параметры:
//  ДобавляемыйВид				 - 	 - 
//  УстановитьВыводВФормеВсегда	 - 	 - 
//
Процедура ДобавитьКонтактнуюИнформациюСервер(ДобавляемыйВид, УстановитьВыводВФормеВсегда = Ложь) Экспорт
	
	УправлениеКонтактнойИнформациейСтоматология.ДобавитьКонтактнуюИнформацию(ЭтаФорма, Объект, ДобавляемыйВид, УстановитьВыводВФормеВсегда);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый представление КИПри изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ПредставлениеКИПриИзменении(Элемент)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ПредставлениеКИПриИзменении(ЭтотОбъект, Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый представление КИНачало выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеВыбора		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура Подключаемый_ПредставлениеКИНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ПредставлениеКИНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеКИРедактированиеВДиалогеЗавершено(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеКИ = ЭтаФорма.КонтактнаяИнформация[ДополнительныеПараметры.ИндексКИ];
	
	ДанныеКИ.Представление	 = РезультатЗакрытия.Представление;
	ДанныеКИ.ЗначенияПолей	 = РезультатЗакрытия.КонтактнаяИнформация;
	ДанныеКИ.Комментарий	 = РезультатЗакрытия.Комментарий;
	
	Модифицированность = Истина;
	
	Если ДанныеКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ЗаполнитьСписокВыбораАдресов(ЭтаФорма);
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ОповещениеОЗакрытииДиалога") Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗакрытииДиалога, РезультатЗакрытия.Представление);
	КонецЕсли;
	
	ПроверкаДублированияКлиентаКонтактнаяИнформация(ДанныеКИ, ДанныеКИ.Представление);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеКИПриИзменении(Элемент) Экспорт
	
	ИндексКИ = Число(Сред(Элемент.Имя, СтрДлина("ПредставлениеКИ_")+1));
	ДанныеКИ = ЭтаФорма.КонтактнаяИнформация[ИндексКИ];
	
	Если ПустаяСтрока(ДанныеКИ.Представление) Тогда
		ДанныеКИ.ЗначенияПолей = "";
	Иначе
		ДанныеКИ.ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(ДанныеКИ.Представление, ДанныеКИ.Вид);
	КонецЕсли;
	
	Если ДанныеКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ЗаполнитьСписокВыбораАдресов(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый представление КИОчистка
//
// Параметры:
//  Элемент				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура Подключаемый_ПредставлениеКИОчистка(Элемент, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ПредставлениеКИОчистка(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый контактная информация авто подбор
//
// Параметры:
//  Элемент					 - 	 - 
//  Текст					 - 	 - 
//  ДанныеВыбора			 - 	 - 
//  ПараметрыПолученияДанных - 	 - 
//  Ожидание				 - 	 - 
//  СтандартнаяОбработка	 - 	 - 
//
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.АвтоПодбор(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый контактная информация обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый комментарий КИПри изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_КомментарийКИПриИзменении(Элемент)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.КомментарийКИПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый контактная информация выполнить команду
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Подключаемый_КонтактнаяИнформация_ВыполнитьКоманду(Команда)
	
	КонтактнаяИнформацияКлиент.ВыполнитьКоманду(ЭтаФорма, Команда);

КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый обработка нажатия динамической кнопки запрещения рассылки
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ОбработкаНажатияДинамическойКнопкиЗапрещенияРассылки(Элемент)	
	
	ИндексСтроки = Число(Сред(Элемент.Имя, СтрДлина("РазрешитьЗапретитьРассылку_")+1));
	НеУчаствоватьВРассылке = Не ЭтаФорма.КонтактнаяИнформация[ИндексСтроки].НеУчаствоватьВРассылке;
	ЭтаФорма.КонтактнаяИнформация[ИндексСтроки].НеУчаствоватьВРассылке = НеУчаствоватьВРассылке;	
	Элемент.Картинка = ПолучитьКартинку(НеУчаствоватьВРассылке);
	Элемент.Подсказка = ПолучитьПодсказку(НеУчаствоватьВРассылке);
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый обработка нажатия динамической кнопки запрещения рассылки
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ОбработкаНажатияДинамическойКнопкиЗапрещенияРассылкиМессенджер(Элемент)	
	
	ИндексСтроки = Число(Сред(Элемент.Имя, СтрДлина("ЗапретРассылки_")+1));
	НеУчаствоватьВРассылке = Не ЭтотОбъект.КонтактыМессенджеров[ИндексСтроки].НеУчаствоватьВРассылке;
	ЭтаФорма.КонтактыМессенджеров[ИндексСтроки].НеУчаствоватьВРассылке = НеУчаствоватьВРассылке;	
	Элемент.Картинка = ПолучитьКартинку(НеУчаствоватьВРассылке);
	Элемент.Подсказка = ПолучитьПодсказку(НеУчаствоватьВРассылке);
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Подключаемый перейти к диалогу
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ПерейтиКДиалогу(Элемент)	
	
	Если Объект.Ссылка.Пустая() Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаОЗаписиКлиента", ЭтотОбъект, Новый Структура("ВыполнитьДействие, Элемент", "ПерейтиКДиалогу", Элемент));
		ПоказатьВопрос(Оповещение, "Для перехода в мессенджер необходимо произвести запись нового клиента. Записать?", РежимДиалогаВопрос.ДаНет);
	Иначе
		
		Если Модифицированность И Не ЭтаФорма.Записать() Тогда
			Возврат;
		КонецЕсли;
		
		ИндексСтроки = Число(Сред(Элемент.Имя, СтрДлина("ПерейтиКДиалогу_")+1));
		ДанныеКИ     = ЭтотОбъект.КонтактнаяИнформация[ИндексСтроки];
		
		ПредставлениеНомераТелефона = ДанныеКИ.Представление;
		ПредставлениеНомераТелефона = СтрЗаменить(ПредставлениеНомераТелефона, " ", "");
		ПредставлениеНомераТелефона = СтрЗаменить(ПредставлениеНомераТелефона, "(", "");
		ПредставлениеНомераТелефона = СтрЗаменить(ПредставлениеНомераТелефона, ")", "");
		ПредставлениеНомераТелефона = СтрЗаменить(ПредставлениеНомераТелефона, "+", "");
		
		Если НЕ ЗначениеЗаполнено(ПредставлениеНомераТелефона) Тогда
			ОбщегоНазначения.СообщитьПользователю("Пустой номер телефона клиента");
			Возврат;
		КонецЕсли;
	
		ДанныеВнешнихСистемМессенджера = ПолучитьДоступныеВнешниеСистемыМессенджера(Объект.Ссылка, ТекущаяСтруктурнаяЕдиница, Истина, ПредставлениеНомераТелефона);
					
		Если ДанныеВнешнихСистемМессенджера.Количество() = 0 Тогда
			Возврат;
		ИначеЕсли ДанныеВнешнихСистемМессенджера.Количество() = 1 Тогда
			Подключаемый_ПерейтиКДиалогуЗавершение(ДанныеВнешнихСистемМессенджера[0],Неопределено);
			Возврат;
		КонецЕсли;

		ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ПерейтиКДиалогуЗавершение", ЭтотОбъект);
	
		ПоказатьВыборИзМеню(ОписаниеОповещения, ДанныеВнешнихСистемМессенджера, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения асинхронного события.
//
Процедура Подключаемый_ПерейтиКДиалогуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = Результат.Значение.Идентификатор;
	ВнешняяСистема= Результат.Значение.ВнешняяСистема;
	
	ОписаниеОшибки = "";
	
	ИдСообщения = УстановитьОжиданиеСообщения(Идентификатор,ВнешняяСистема,ОписаниеОшибки,Объект.Ссылка,Результат.Значение.НомерМессенджера);
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ДанныеКанала = Новый Структура;
	ДанныеКанала.Вставить("ИдКлиента"		, Идентификатор);
	ДанныеКанала.Вставить("ВнешняяСистема"	, ВнешняяСистема);
	ДанныеКанала.Вставить("ИдСообщения"		, ИдСообщения);
	
	ПараметрыОткрытия = Новый Структура("ДанныеКанала", ДанныеКанала);
	
	Оповестить("ОткрытьДиалог", ПараметрыОткрытия);
	ОткрытьФорму("Обработка.Мессенджер_Стоматология.Форма", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

#Область ОтправлениеПоПочтеСКонтактнойИнформации
&НаКлиенте
// Процедура - Подключаемый отправить по почте
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ОтправитьПоПочте(Элемент)
	
	ИндексЭлемента = Число(Сред(Элемент.Имя, СтрДлина("ОтправитьПоПочте_") + 1));
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОЗаписиКлиента", ЭтотОбъект, Новый Структура("ВыполнитьДействие, ИндексЭлемента", "ОтправитьПоПочте",ИндексЭлемента));
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Для отправки электронного письма нужно произвести запись пациента. Записать?'; en = 'To send an email you need to record the patient. To record?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		Если Модифицированность И Не ЭтаФорма.Записать() Тогда
			Возврат;
		КонецЕсли;
		
		ОтправитьПоПочте(ИндексЭлемента);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, создает исходящее электронное письмо.
//
Процедура ОтправитьПоПочте(ИндексЭлемента)
	
	ДанныеКИ     = ЭтотОбъект.КонтактнаяИнформация[ИндексЭлемента];

	Если Не ЗначениеЗаполнено(ДанныеКИ.Представление) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='У клиента не задан адрес электронной почты';en='Client does not have set email address of mail'"));
		Возврат;
	КонецЕсли;
	
	Если ДанныеКИ.НеУчаствоватьВРассылке = Истина Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='У клиента запрещена рассылка электронных писем';en='Client is prohibited newsletter electronic of letters'"));
		Возврат;
	КонецЕсли;    
	
	СписокАдресовЭП = Новый Массив;
	СписокАдресовЭП.Добавить(ДанныеКИ.Представление);
	
	ПараметрыПисьма = Новый Структура("Получатель,АдресЭП", Объект.Ссылка, ДанныеКИ.Представление);
	
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаДокумента", ПараметрыПисьма,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	
#КонецОбласти

//================================================================================================================

&НаСервере
// Процедура - Добавить реквизиты формы контактной информации
//
// Параметры:
//  Форма	 - 	 - 
//
Процедура ДобавитьРеквизитыФормыКонтактнойИнформации()
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	СписокРеквизитовФормы = ЭтаФорма.ПолучитьРеквизиты();
	
	СоздатьТаблицуКонтактнаяИнформация = Истина;
	СоздатьТаблицуСвойстваВидовКонтактнойИнформации = Истина;
	
	Для Каждого Реквизит Из СписокРеквизитовФормы Цикл
		Если Реквизит.Имя = "КонтактнаяИнформация" Тогда
			СоздатьТаблицуКонтактнаяИнформация = Ложь;
		ИначеЕсли Реквизит.Имя = "СвойстваВидовКонтактнойИнформации" Тогда
			СоздатьТаблицуСвойстваВидовКонтактнойИнформации = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	ОписаниеСтрока = Новый ОписаниеТипов("Строка");
	ОписаниеБулево = Новый ОписаниеТипов("Булево");
	
	Если СоздатьТаблицуКонтактнаяИнформация Тогда
		
		ИмяТаблицы = "КонтактнаяИнформация";
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений"),,, Истина));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Вид", Новый ОписаниеТипов("СправочникСсылка.ВидыКонтактнойИнформации"), ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Тип", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"), ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Представление", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500)), ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Комментарий", ОписаниеСтрока, ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЗначенияПолей", ОписаниеСтрока, ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("НеУчаствоватьВРассылке", ОписаниеБулево, ИмяТаблицы));		
		
	КонецЕсли;
	
	Если СоздатьТаблицуСвойстваВидовКонтактнойИнформации Тогда
		
		ИмяТаблицы = "СвойстваВидовКонтактнойИнформации";
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений"),,, Истина));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Вид", Новый ОписаниеТипов("СправочникСсылка.ВидыКонтактнойИнформации"), ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПредставлениеВида", ОписаниеСтрока, ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Тип", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"), ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВыводитьВФормеВсегда", ОписаниеБулево, ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("РазрешитьВводНесколькихЗначений", ОписаниеБулево, ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ОбязательноеЗаполнение", ОписаниеБулево, ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Подсказка", ОписаниеСтрока, ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПроверятьКорректность", ОписаниеБулево, ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("РедактированиеТолькоВДиалоге", ОписаниеБулево, ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("МногострочноеПоле", ОписаниеБулево, ИмяТаблицы));
		
	КонецЕсли;
	
	Если МассивДобавляемыхРеквизитов.Количество() > 0 Тогда
		ЭтаФорма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Прочитать свойства видов контактной информации
//
// Параметры:
//  Форма			 - 	 - 
//  ГруппаВидовКИ	 - 	 - 
//
Процедура ПрочитатьСвойстваВидовКонтактнойИнформации(ГруппаВидовКИ)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПорядокТиповКИ.Тип,
	|	ПорядокТиповКИ.Порядок
	|ПОМЕСТИТЬ втПорядокТипов
	|ИЗ
	|	&ПорядокТиповКИ КАК ПорядокТиповКИ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка КАК Вид,
	|	ПРЕДСТАВЛЕНИЕ(ВидыКонтактнойИнформации.Ссылка) КАК ПредставлениеВида,
	|	ВидыКонтактнойИнформации.Тип КАК Тип,
	|	ВидыКонтактнойИнформации.ВыводитьПоУмолчанию КАК ВыводитьВФормеВсегда,
	|	ВидыКонтактнойИнформации.РазрешитьВводНесколькихЗначений КАК РазрешитьВводНесколькихЗначений,
	|	ВидыКонтактнойИнформации.ОбязательноеЗаполнение,
	|	ВидыКонтактнойИнформации.Подсказка,
	|	ВидыКонтактнойИнформации.ПроверятьКорректность,
	|	ВидыКонтактнойИнформации.РедактированиеТолькоВДиалоге,
	|	ВидыКонтактнойИнформации.МногострочноеПоле
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПорядокТипов КАК втПорядокТипов
	|		ПО ВидыКонтактнойИнформации.Тип = втПорядокТипов.Тип
	|ГДЕ
	|	ВидыКонтактнойИнформации.ПометкаУдаления = ЛОЖЬ
	|	И ВидыКонтактнойИнформации.Родитель = &ГруппаВидовКИ
	|	И ВидыКонтактнойИнформации.Используется
	|
	|УПОРЯДОЧИТЬ ПО
	|	втПорядокТипов.Порядок,
	|	ВидыКонтактнойИнформации.РеквизитДопУпорядочивания");
	
	Запрос.УстановитьПараметр("ПорядокТиповКИ", ПорядокТиповКИ());
	Запрос.УстановитьПараметр("ГруппаВидовКИ" , ГруппаВидовКИ);
	
	ТаблицаСвойств = Запрос.Выполнить().Выгрузить();
	
	СтруктураОбязательныхПолей = ВернутьЗначениеКонстантыОбязательныеПоля();
	
	Если ЗначениеЗаполнено(СтруктураОбязательныхПолей) Тогда
		
		Если СтруктураОбязательныхПолей.Свойство("КЛИЕНТ_ПредставлениеКИ_0") Тогда
			МассивСтрок = ТаблицаСвойств.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонКлиента));
			Если МассивСтрок.Количество() > 0 Тогда
				МассивСтрок[0].ОбязательноеЗаполнение = СтруктураОбязательныхПолей.КЛИЕНТ_ПредставлениеКИ_0;
			КонецЕсли;
		КонецЕсли;
		
		Если СтруктураОбязательныхПолей.Свойство("КЛИЕНТ_ПредставлениеКИ_1") Тогда
			МассивСтрок = ТаблицаСвойств.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.EmailКлиента));
			Если МассивСтрок.Количество() > 0 Тогда
				МассивСтрок[0].ОбязательноеЗаполнение = СтруктураОбязательныхПолей.КЛИЕНТ_ПредставлениеКИ_1;
			КонецЕсли;
		КонецЕсли;
		
		Если СтруктураОбязательныхПолей.Свойство("КЛИЕНТ_ПредставлениеКИ_2") Тогда
			МассивСтрок = ТаблицаСвойств.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.АдресКлиента));
			Если МассивСтрок.Количество() > 0 Тогда
				МассивСтрок[0].ОбязательноеЗаполнение = СтруктураОбязательныхПолей.КЛИЕНТ_ПредставлениеКИ_2;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтаФорма.СвойстваВидовКонтактнойИнформации.Загрузить(ТаблицаСвойств);
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить таблицу контактной информации
//
// Параметры:
//  Форма		 - 	 - 
//  ВладелецКИ	 - 	 - 
//
Процедура ЗаполнитьТаблицуКонтактнойИнформации(СтруктураНовогоТелефонногоНомера = Неопределено)
	
	ЭтаФорма.КонтактнаяИнформация.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорядокТипов.Тип КАК Тип,
	|	ПорядокТипов.Порядок КАК Порядок
	|ПОМЕСТИТЬ втПорядокТипов
	|ИЗ
	|	&ПорядокТипов КАК ПорядокТипов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка КАК Вид,
	|	ВидыКонтактнойИнформации.Тип КАК Тип,
	|	ВидыКонтактнойИнформации.РеквизитДопУпорядочивания КАК ПорядокВидов,
	|	втПорядокТипов.Порядок КАК ПорядокТипов
	|ПОМЕСТИТЬ втВсегдаВыводимыеВиды
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПорядокТипов КАК втПорядокТипов
	|		ПО ВидыКонтактнойИнформации.Тип = втПорядокТипов.Тип
	|ГДЕ
	|	ВидыКонтактнойИнформации.Ссылка В(&ВсегдаВыводимыеВиды)
	|	И ВидыКонтактнойИнформации.Используется
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Вид
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВладелецКонтактнаяИнформация.Вид КАК Вид,
	|	ВладелецКонтактнаяИнформация.Тип КАК Тип,
	|	ВладелецКонтактнаяИнформация.Представление КАК Представление,
	|	ВладелецКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
	|	ВладелецКонтактнаяИнформация.Вид.РеквизитДопУпорядочивания КАК ПорядокВидов,
	|	втПорядокТипов.Порядок КАК ПорядокТипов,
	|	ВладелецКонтактнаяИнформация.НеУчаствоватьВРассылке КАК НеУчаствоватьВРассылке
	|ПОМЕСТИТЬ втДанныеКИ
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК ВладелецКонтактнаяИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПорядокТипов КАК втПорядокТипов
	|		ПО ВладелецКонтактнаяИнформация.Тип = втПорядокТипов.Тип
	|ГДЕ
	|	ВладелецКонтактнаяИнформация.Ссылка = &ВладелецКИ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Вид
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(втДанныеКИ.Вид, втВсегдаВыводимыеВиды.Вид) КАК Вид,
	|	ЕСТЬNULL(втДанныеКИ.Тип, втВсегдаВыводимыеВиды.Тип) КАК Тип,
	|	ЕСТЬNULL(втДанныеКИ.Представление, """") КАК Представление,
	|	ЕСТЬNULL(втДанныеКИ.ЗначенияПолей, """") КАК ЗначенияПолей,
	|	ЕСТЬNULL(втДанныеКИ.ПорядокТипов, втВсегдаВыводимыеВиды.ПорядокТипов) КАК ПорядокТипов,
	|	ЕСТЬNULL(втДанныеКИ.ПорядокВидов, втВсегдаВыводимыеВиды.ПорядокВидов) КАК ПорядокВидов,
	|	ЕСТЬNULL(втДанныеКИ.НеУчаствоватьВРассылке, ЛОЖЬ) КАК НеУчаствоватьВРассылке
	|ИЗ
	|	втВсегдаВыводимыеВиды КАК втВсегдаВыводимыеВиды
	|		ПОЛНОЕ СОЕДИНЕНИЕ втДанныеКИ КАК втДанныеКИ
	|		ПО втВсегдаВыводимыеВиды.Вид = втДанныеКИ.Вид
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокТипов,
	|	ПорядокВидов";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.Контрагенты", Объект.Ссылка.Метаданные().ПолноеИмя());
	Запрос.УстановитьПараметр("ВладелецКИ",		Объект.Ссылка);
	Запрос.УстановитьПараметр("ПорядокТипов",	ПорядокТиповКИ());
	Запрос.УстановитьПараметр("ВсегдаВыводимыеВиды", 
	ЭтаФорма.СвойстваВидовКонтактнойИнформации.Выгрузить(Новый Структура("ВыводитьВФормеВсегда", Истина), "Вид"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если (ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Выборка.ЗначенияПолей)) 
			ИЛИ Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			
			НоваяСтрока = ЭтаФорма.КонтактнаяИнформация.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Комментарий = УправлениеКонтактнойИнформацией.КомментарийКонтактнойИнформации(Выборка.ЗначенияПолей);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ СтруктураНовогоТелефонногоНомера = Неопределено Тогда 
		Если СтруктураНовогоТелефонногоНомера.Свойство("ДобавитьНомерТелефона") И СтруктураНовогоТелефонногоНомера.Свойство("НомерТелефона") Тогда
			НоваяСтрока = Неопределено;
			МассивСтрокИмеющейсяКИ 		= ЭтаФорма.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
			Если НЕ МассивСтрокИмеющейсяКИ.Количество() = 0 Тогда 
				Для Каждого СтрокаМассива Из МассивСтрокИмеющейсяКИ Цикл 
					Если НЕ ЗначениеЗаполнено(СтрокаМассива.ЗначенияПолей) И НЕ ЗначениеЗаполнено(СтрокаМассива.Представление) Тогда
						НоваяСтрока 	= СтрокаМассива;
						Прервать;
					КонецЕсли;
				КонецЦикла;	
			КонецЕсли;
			Если НоваяСтрока = Неопределено Тогда 
				НоваяСтрока 			= ЭтаФорма.КонтактнаяИнформация.Добавить();
				НоваяСтрока.Вид 		= ?(Объект.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты, Справочники.ВидыКонтактнойИнформации.ТелефонКлиента, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);				
			КонецЕсли;
			НоваяСтрока.Тип 			= Перечисления.ТипыКонтактнойИнформации.Телефон;
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.Вид) Тогда 
				НоваяСтрока.Вид 		= ?(Объект.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты, Справочники.ВидыКонтактнойИнформации.ТелефонКлиента, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);				
			КонецЕсли;	
			НоваяСтрока.Представление 	= СтруктураНовогоТелефонногоНомера.НомерТелефона;
			НоваяСтрока.ЗначенияПолей 	= КонтактнаяИнформацияXMLПоПредставлению(НоваяСтрока.Представление, НоваяСтрока.Вид);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КонтактнаяИнформацияXMLПоПредставлению(Представление, ОжидаемыйВид)
	
	Возврат УправлениеКонтактнойИнформациейСлужебныйВызовСервераСтоматология.КонтактнаяИнформацияXMLПоПредставлению(Представление, ОжидаемыйВид);
	
КонецФункции

&НаСервере
// Функция - Есть другие заполненные строки вида КИ
//
// Параметры:
//  Форма					 - 	 - 
//  ПроверяемаяСтрока		 - 	 - 
//  ВидКонтактнойИнформации	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЕстьДругиеЗаполненныеСтрокиВидаКИ(Знач ПроверяемаяСтрока, Знач ВидКонтактнойИнформации)
	
	ВсеСтрокиЭтогоВида = ЭтаФорма.КонтактнаяИнформация.НайтиСтроки(
	Новый Структура("Вид", ВидКонтактнойИнформации));
	
	Для Каждого СтрокаВида Из ВсеСтрокиЭтогоВида Цикл
		
		Если СтрокаВида <> ПроверяемаяСтрока И Не ПустаяСтрока(СтрокаВида.Представление) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
// Процедура - Добавить команду контекстного меню
//
// Параметры:
//  Форма		 - 	 - 
//  ИмяКоманды	 - 	 - 
//  Картинка	 - 	 - 
//  Заголовок	 - 	 - 
//  Подсказка	 - 	 - 
//  ПолеВладелец - 	 - 
//
Процедура ДобавитьКомандуКонтекстногоМеню(ИмяКоманды, Картинка, Заголовок, Подсказка, ПолеВладелец)
	
	Если ЭтаФорма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		Команда = ЭтаФорма.Команды.Добавить(ИмяКоманды);
		Команда.Картинка = Картинка;
		Команда.Заголовок = Заголовок;
		Команда.Подсказка = Подсказка;
		Команда.Действие = "Подключаемый_КонтактнаяИнформация_ВыполнитьКоманду";
	КонецЕсли;
	
	Кнопка = ЭтаФорма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ПолеВладелец.КонтекстноеМеню);
	Кнопка.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

&НаСервере
// Процедура - Добавить команду контекстного меню
//
// Параметры:
//  Форма		 - 	 - 
//  ИмяКоманды	 - 	 - 
//  Картинка	 - 	 - 
//  Заголовок	 - 	 - 
//  Подсказка	 - 	 - 
//  ПолеВладелец - 	 - 
//
Процедура ДобавитьКомандуКнопкой(ИмяКоманды, Картинка, Заголовок, Подсказка, ГруппаДействий)
	
	Если ЭтаФорма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		Команда = ЭтаФорма.Команды.Добавить(ИмяКоманды);
		Команда.Отображение = ОтображениеКнопки.Картинка;
		Команда.Картинка = Картинка;
		Команда.Заголовок = Заголовок;
		Команда.Подсказка = Подсказка;
		Команда.Действие = "Подключаемый_КонтактнаяИнформация_ВыполнитьКоманду";
	КонецЕсли;
	
	Кнопка = ЭтаФорма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ГруппаДействий);
	Кнопка.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Процедура обработки нажатия динамической кнопки.
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ПроцедураОбработкиНажатияДинамическойКнопки(Элемент)	
	
	ИндексСтроки      = Число(Сред(Элемент.Имя, СтрДлина("РазрешитьЗапретитьРассылку_")+1));// Цел(Прав(Элемент.имя, 1));
	ЭтаФорма.КонтактнаяИнформация[ИндексСтроки].НеУчаствоватьВРассылке = Не ЭтаФорма.КонтактнаяИнформация[ИндексСтроки].НеУчаствоватьВРассылке;
	Элемент.Картинка  = ПолучитьКартинку(ЭтаФорма.КонтактнаяИнформация[ИндексСтроки].НеУчаствоватьВРассылке);
	Элемент.Подсказка = ПолучитьПодсказку(ЭтаФорма.КонтактнаяИнформация[ИндексСтроки].НеУчаствоватьВРассылке);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает картинку для кнопки отключения рассылки.
//
Функция ПолучитьКартинку(Флаг)
	
	Возврат ?(Флаг, БиблиотекаКартинок.РассылкаЗапрещена, БиблиотекаКартинок.РассылкаРазрешена);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает Текст подсказки для кнопки отключения рассылки.
//
Функция ПолучитьПодсказку(Флаг)
	
	Возврат ?(Флаг, НСтр("ru='Рассылка запрещена';en='Newsletter is prohibited'"), НСтр("ru='Рассылка разрешена';en='Newsletter is allowed'"));
	
КонецФункции

&НаСервере
// Функция возвращает таблицу типов контактной информации в порядке по умолчанию
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Стандартный порядок типов контактной информации для отображения в интерфейсе
//
Функция ПорядокТиповКИ()
	
	ПорядокТиповКИ = Новый ТаблицаЗначений;
	ПорядокТиповКИ.Колонки.Добавить("Тип"	 , Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"));
	ПорядокТиповКИ.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	
	ДобавитьТипКонтактнойИнформации(ПорядокТиповКИ, Перечисления.ТипыКонтактнойИнформации.Телефон			   , 1);
	ДобавитьТипКонтактнойИнформации(ПорядокТиповКИ, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, 2);
	ДобавитьТипКонтактнойИнформации(ПорядокТиповКИ, Перечисления.ТипыКонтактнойИнформации.Адрес				   , 3);
	ДобавитьТипКонтактнойИнформации(ПорядокТиповКИ, Перечисления.ТипыКонтактнойИнформации.Факс				   , 4);
	ДобавитьТипКонтактнойИнформации(ПорядокТиповКИ, Перечисления.ТипыКонтактнойИнформации.Skype				   , 5);
	ДобавитьТипКонтактнойИнформации(ПорядокТиповКИ, Перечисления.ТипыКонтактнойИнформации.СоциальнаяСеть	   , 6);
	ДобавитьТипКонтактнойИнформации(ПорядокТиповКИ, Перечисления.ТипыКонтактнойИнформации.МобильноеПриложение  , 7);
	
	Возврат ПорядокТиповКИ;
	
КонецФункции

&НаСервере
// Процедура, добавляет тип контактной информации в таблицу значений.
//
Процедура ДобавитьТипКонтактнойИнформации(ПорядокТиповКИ, ТипКонтактнойИнформации, ИндексПорядка)
	
	СтрокаТипов 		= ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип 	= ТипКонтактнойИнформации;
	СтрокаТипов.Порядок = ИндексПорядка;
	
КонецПроцедуры

&НаСервере
// Функция - Получить параметры свойств полей КИ
//
// Параметры:
//  ВладелецКИ	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПараметрыСвойствПолейКИ(Знач ВладелецКИ)
	
	ПараметрыСвойствПолейКИ = Новый Структура("Надпись_МаксимальнаяШирина, Представление_МаксимальнаяШирина_БезКомм, Представление_МаксимальнаяШирина_СКомм, Комментарий_МаксимальнаяШирина, ТолькоПросмотр");
	
	Если ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.Контрагенты") Тогда 
		
		Если РольДоступна(Метаданные.Роли.ПолныеПрава) ИЛИ РольДоступна(Метаданные.Роли.ИзменениеКлиентов) ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			КИ_ТолькоПросмотр = Ложь;
		ИначеЕсли РольДоступна(Метаданные.Роли.ИзменениеСвоихКлиентовКуратором) Тогда 
			Если ЭтотОбъект.ТекущийПользователь = Объект.Куратор Тогда 
				КИ_ТолькоПросмотр = Ложь;
			Иначе 
				КИ_ТолькоПросмотр = Истина;
			КонецЕсли;			
		ИначеЕсли РольДоступна(Метаданные.Роли.ДобавлениеКлиентов) Тогда
			КИ_ТолькоПросмотр = Истина;
		Иначе 
			КИ_ТолькоПросмотр = Ложь;
		КонецЕсли;	
		
		ПараметрыСвойствПолейКИ.Надпись_МаксимальнаяШирина 					= 9;
		ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_БезКомм 	= 60;
		ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_СКомм 		= 40;
		ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина 				= 9;
		ПараметрыСвойствПолейКИ.ТолькоПросмотр 								= КИ_ТолькоПросмотр;
		
	ИначеЕсли ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.Сотрудники") Тогда	
		
		ПараметрыСвойствПолейКИ.Надпись_МаксимальнаяШирина 					= 6;
		ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_БезКомм 	= 41;
		ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_СКомм 		= 31;
		ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина 				= 8;
		ПараметрыСвойствПолейКИ.ТолькоПросмотр 								= Ложь;
		
	ИначеЕсли ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.СтруктурныеЕдиницы") Тогда	
		
		ПараметрыСвойствПолейКИ.Надпись_МаксимальнаяШирина 					= 13;
		ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_БезКомм 	= 79;
		ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_СКомм 		= 58;
		ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина 				= 19;
		ПараметрыСвойствПолейКИ.ТолькоПросмотр 								= Ложь;
		
	ИначеЕсли ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.Организации") Тогда	
		
		ПараметрыСвойствПолейКИ.Надпись_МаксимальнаяШирина 					= 10;
		ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_БезКомм 	= 46;
		ПараметрыСвойствПолейКИ.Представление_МаксимальнаяШирина_СКомм 		= 35;
		ПараметрыСвойствПолейКИ.Комментарий_МаксимальнаяШирина 				= 9;
		ПараметрыСвойствПолейКИ.ТолькоПросмотр 								= Ложь;
		
	КонецЕсли;
	
	Возврат ПараметрыСвойствПолейКИ;
	
КонецФункции

//================================================================================================================
//================================================================================================================

#КонецОбласти


&НаСервереБезКонтекста
// Функция - Вернуть знач константы обяз поля
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьЗначКонстантыОбязПоля()
	
	ХранилищеЗначений = Константы.ОбязательныеПоляКлиенты.Получить();
	Возврат ХранилищеЗначений.Получить();
	
КонецФункции

&НаКлиенте
// Функция - Установить обязательные динам поля
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьОбязательныеДинамПоля()
	
	СтруктураОбязательныхДинамПолей = Новый Структура();
	СтруктураОбязательныхДинамПолей.Вставить("ФлагТелефон", Ложь);
	СтруктураОбязательныхДинамПолей.Вставить("ФлагEmail"  , Ложь);
	СтруктураОбязательныхДинамПолей.Вставить("ФлагАдрес"  , Ложь);
	
	СтруктураОбязательныеПоля = ВернутьЗначКонстантыОбязПоля();
	
	Если СтруктураОбязательныеПоля <> Неопределено Тогда
		
		Для Каждого ОбязательноеПоле Из СтруктураОбязательныеПоля Цикл
			
			Если ОбязательноеПоле.Значение = Истина Тогда
				
				Если ОбязательноеПоле.Ключ = "КЛИЕНТ_ПредставлениеКИ_0" Тогда
					СтруктураОбязательныхДинамПолей.ФлагТелефон = Истина;
				ИначеЕсли ОбязательноеПоле.Ключ = "КЛИЕНТ_ПредставлениеКИ_1" Тогда
					СтруктураОбязательныхДинамПолей.ФлагEmail   = Истина;
				ИначеЕсли ОбязательноеПоле.Ключ = "КЛИЕНТ_ПредставлениеКИ_2" Тогда
					СтруктураОбязательныхДинамПолей.ФлагАдрес   = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтруктураОбязательныхДинамПолей;
	
КонецФункции

&НаКлиенте
// Функция - Проверить обязательные динам поля
//
// Параметры:
//  Элемент						 - 	 - 
//  СтруктураФлаговДинамПолей	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПроверитьОбязательныеДинамПоля(Элемент, СтруктураФлаговДинамПолей)
	
	Если СтруктураФлаговДинамПолей = Неопределено Тогда
		СтруктураФлаговДинамПолей = СоздатьОбнуленнуюСтруктуруФлаговДинамПолей();
	КонецЕсли;
	
	Попытка
		ИДСтроки = Число(СтрРазделить(Элемент.Имя, "_")[1]);
		ТипКИ    = ЭтаФорма.КонтактнаяИнформация[ИДСтроки].Тип;
	Исключение
		Возврат СтруктураФлаговДинамПолей;
	КонецПопытки;
	
	Если ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда 
		
		Если СтруктураФлаговДинамПолей.ХотяБыОдинТелефон = Ложь Тогда
			СтруктураФлаговДинамПолей.ХотяБыОдинТелефон  = ЗначениеЗаполнено(Элемент.ТекстРедактирования);
		КонецЕсли;
		
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты") Тогда 
		
		Если СтруктураФлаговДинамПолей.ХотяБыОдинEmail = Ложь Тогда
			СтруктураФлаговДинамПолей.ХотяБыОдинEmail  = ЗначениеЗаполнено(Элемент.ТекстРедактирования);
		КонецЕсли;
		
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда 
		
		Если СтруктураФлаговДинамПолей.ХотяБыОдинАдрес = Ложь Тогда
			СтруктураФлаговДинамПолей.ХотяБыОдинАдрес  = ЗначениеЗаполнено(Элемент.ТекстРедактирования);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураФлаговДинамПолей;
	
КонецФункции

&НаКлиенте
// Функция - Создать обнуленную структуру флагов динам полей
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьОбнуленнуюСтруктуруФлаговДинамПолей()
	
	ОбнуленнаяСтруктураФлагов = Новый Структура();
	ОбнуленнаяСтруктураФлагов.Вставить("ХотяБыОдинТелефон", Ложь);
	ОбнуленнаяСтруктураФлагов.Вставить("ХотяБыОдинEmail"  , Ложь);
	ОбнуленнаяСтруктураФлагов.Вставить("ХотяБыОдинАдрес"  , Ложь);
	
	Возврат ОбнуленнаяСтруктураФлагов;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает признак доступности добавления КИ.
//
Функция РазрешеноДобавлятьКИ()
	
	Возврат ПравоДоступа("Добавление", Метаданные.Справочники.Контрагенты);
	
КонецФункции

&НаСервере
// Функция, возвращает значение константы.
// 
// Возвращаемое значение:
//   - Структура - Значение, хранящееся в константе. 
//
Функция ВернутьЗначениеКонстантыОбязательныеПоля()
	
	ХранилищеЗначений = Константы.ОбязательныеПоляКлиенты.Получить();	
	СтруктураОбязательныеПоля = ХранилищеЗначений.Получить();
	ОбязательныеПоля = Неопределено;
	
	Если СтруктураОбязательныеПоля = Неопределено Тогда
		Возврат ОбязательныеПоля;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() ИЛИ КонецДня(Объект.ДатаРегистрации) = КонецДня(ТекущаяДатаСеанса()) Тогда		
		СтруктураОбязательныеПоля.Свойство("ОбязательныеПоляДляНовых", ОбязательныеПоля);		
	Иначе		
		СтруктураОбязательныеПоля.Свойство("ОбязательныеПоляДляВсех", ОбязательныеПоля);		
	КонецЕсли;
	
	Возврат ОбязательныеПоля;
	
КонецФункции

&НаСервере
// Процедура - При создании при чтении на сервере
//
// Параметры:
//  СозданиеНового		 - 	 - 
//  ЧтениеСуществующего	 - 	 - 
//
Процедура ПриСозданииПриЧтенииНаСервере()
	
	// Дополнительная информация
	МассивРодителей = Новый Массив();
	МассивРодителей.Добавить("ГруппаУдостоверенияЛичностиСуществующие");
	МассивРодителей.Добавить("ГруппаКартыСуществующие");
	// МассивРодителей.Добавить("ГруппаРодственникиСуществующие");
	МассивРодителей.Добавить("ГруппаЛицевыеБонусныеСчетаСуществующие");
	// МассивРодителей.Добавить("ГруппаЗаписиСуществующие");
	МассивРодителей.Добавить("ГруппаСкидкиСуществующие");
	МассивРодителей.Добавить("ГруппаПолисыСуществующие");
	МассивРодителей.Добавить("ГруппаРодственникиСуществующие");
	МассивРодителей.Добавить("ГруппаПромокодыСуществующие");
	
	ОтображениеДополнительнойИнформации(МассивРодителей);
	
КонецПроцедуры

&НаСервере
// Процедура - Отображение дополнительной информации
//
// Параметры:
//  МассивРодителей	 - 	 - 
//
Процедура ОтображениеДополнительнойИнформации(МассивРодителей)
	
	УправлениеСвойствамиСтоматология.ОтображениеДополнительнойИнформации(ЭтаФорма, , МассивРодителей);
	
	ОтображениеДополнительныхДанных(МассивРодителей);
	
КонецПроцедуры 

&НаСервере
// Процедура - Отображение дополнительной информации тестовый.
//
Процедура ОтображениеДополнительныхДанных(МассивРодителей)
	
	Для Каждого ЭлементРодитель Из МассивРодителей Цикл     
		
		Если ЭлементРодитель = "ГруппаПромокодыСуществующие" Тогда 
			Элементы.ДобавитьПромокод.Видимость = ПолучитьСписокДоступныхПромокодов(ЭтотОбъект.ПромокодыСуществующие).Количество() > 0;			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуСкидка(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОПродолженииУдаленияСкидки", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Будет удалена скидка. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УдалитьСкидку(Клиент, Скидка)
	
	СкидкаУдалена = Ложь;
	ТаблицаСкидок = Справочники.СкидкиНаценки.ПолучитьСкидкиДоступныеДляКлиента(Клиент);
	
	Если ТаблицаСкидок.Количество() <> 0 И ЗначениеЗаполнено(Скидка) Тогда
		
		СкидкаСуществует = ТаблицаСкидок.Найти(Скидка, "Скидка");
		Если СкидкаСуществует <> Неопределено Тогда
			
			СкидкаОбъект    = Скидка.ПолучитьОбъект();
			НайденнаяСтрока = СкидкаОбъект.Получатели.НайтиСтроки(Новый Структура("Получатель", Клиент));
			Если НайденнаяСтрока.Количество() > 0 Тогда
				
				СкидкаОбъект.Получатели.Удалить(НайденнаяСтрока[0]);
				СкидкаОбъект.Записать();
				СкидкаУдалена = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СкидкаУдалена;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик оповещения выбора скидки.
//
Процедура ВыборСкидкиЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ДобавитьСкидкуКлиенту(Результат, Объект.Ссылка);
		Оповестить("ЗаписанаСкидка");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, добавляет клиента в список получателей скидки.
//
Процедура ДобавитьСкидкуКлиенту(Скидка, Клиент)
	
	Справочники.СкидкиНаценки.ДобавитьСкидкуКлиенту(Скидка, Клиент);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает идентификатор строки данных по имени элемента.
//
Функция ИдентификаторСтрокиДанныхПоИмениЭлемента(ИмяЭлемента)
	
	НомерСимвола = Найти(ИмяЭлемента,"_");
	Возврат Число(Прав(ИмяЭлемента,СтрДлина(ИмяЭлемента) - НомерСимвола)); 
	
КонецФункции

&НаКлиенте
Процедура УдалитьСтрокуУдостоверенияЛичности(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОПродолженииУдаленияУдостоверенияЛичности", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Будет удалено удостоверение личности. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОПродолженииУдаленияУдостоверенияЛичности(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ИДСтрокиДанных = ИдентификаторСтрокиДанныхПоИмениЭлемента(ЭтаФорма.ТекущийЭлемент.Имя);	
		СтрокаДанных   = ЭтаФорма.УдостоверенияЛичностиСуществующие.НайтиПоИдентификатору(ИДСтрокиДанных);
		
		Если СтрокаДанных <> Неопределено Тогда
			
			ОписаниеОшибки = "";
			
			УдостоверениеУдалено = УдалитьСтрокуУдостоверениеЛичностиСервер(СтрокаДанных.ФизЛицо, СтрокаДанных.ВидДокумента, ОписаниеОшибки);
			
			Если УдостоверениеУдалено Тогда
				МассивРодителей = Новый Массив();
				МассивРодителей.Добавить("ГруппаУдостоверенияЛичностиСуществующие");
				ОтображениеДополнительнойИнформации(МассивРодителей);
			Иначе 
				ПоказатьПредупреждение(,"Не удалось удалить удостоверение личности. " + ОписаниеОшибки);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УдалитьСтрокуУдостоверениеЛичностиСервер(ФизЛицо, ВидДокумента, ОписаниеОшибки = "")
	
	Попытка 
		Запись = РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи();
		Запись.Физлицо = ФизЛицо;
		Запись.ВидДокумента = ВидДокумента;
		Запись.Удалить();		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура УдалитьСтрокуПолис(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОПродолженииУдаленияПолиса", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Будет удален медицинский полис. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОПродолженииУдаленияПолиса(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ИДСтрокиДанных = ИдентификаторСтрокиДанныхПоИмениЭлемента(ЭтаФорма.ТекущийЭлемент.Имя);	
		СтрокаДанных   = ЭтаФорма.ПолисыСуществующие.НайтиПоИдентификатору(ИДСтрокиДанных);
		
		Если СтрокаДанных <> Неопределено Тогда
			
			ОписаниеОшибки = "";
			
			ПолисУдален = УдалитьСтрокуПолисСервер(СтрокаДанных.Полис, ОписаниеОшибки);
			
			Если ПолисУдален Тогда
				МассивРодителей = Новый Массив();
				МассивРодителей.Добавить("ГруппаПолисыСуществующие");
				ОтображениеДополнительнойИнформации(МассивРодителей);
			Иначе 
				ПоказатьПредупреждение(,"Не удалось удалить полис. " + ОписаниеОшибки);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УдалитьСтрокуПолисСервер(Полис, ОписаниеОшибки = "")
	
	Попытка 
		ОбъектПолис = Полис.ПолучитьОбъект();
		ОбъектПолис.Заблокировать();
		ОбъектПолис.УстановитьПометкуУдаления(Истина);
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;

КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает доступность роли.
//
Функция РольТекущегоПользтователяДоступна()
	
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ИзменениеКлиентов") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

&НаСервере
Функция ПолучитьДанныеОЗаметке(ИД)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Заметки.Автор КАК Автор
	               |ИЗ
	               |	РегистрСведений.Заметки КАК Заметки";
	Запрос.УстановитьПараметр("ИД", ИД);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Автор, Неопределено);
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает ссылку на документ по ид.
//
Функция ПолучитьСсылкуПоУид(Уид, ТипСобытия)
	
	Если ТипСобытия = "ЗадачаИсполнителя" Тогда
		Возврат Задачи.ЗадачаИсполнителя.ПолучитьСсылку(Уид);
	ИначеЕсли ТипСобытия = "Звонок" Тогда
		Возврат Справочники.Файлы.ПолучитьСсылку(Уид);
	ИначеЕсли ТипСобытия = "Событие" Тогда
		Возврат Документы.Событие.ПолучитьСсылку(Уид);	
	Иначе
		Возврат Задачи.Взаимодействие.ПолучитьСсылку(Уид);
	КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает ссылку на документ по ид.
//
Функция ПолучитьСсылкуНаЗадачуПоУид(Уид)
	Возврат Задачи.Взаимодействие.ПолучитьСсылку(Уид);
КонецФункции

&НаСервереБезКонтекста
// Функция, отмечает задачу как выполненую.
//
Функция ОтметитьЗадачуКакВыполненую(Задача)
	
	ЗадачаОбъект = Задача.ПолучитьОбъект();
	ЗадачаОбъект.Выполнена = Истина;
	
	Попытка
		ЗадачаОбъект.Записать();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
// Процедура, формирует историю взаимодействия с контрагентом.
//
Процедура СформироватьИсториюВзаимодействияСКлиентом()   
	
	УстановитьПривилегированныйРежим(Истина);
	
	Фильтры = Новый Структура();
		
	ОбщегоНазначенияКлиентСерверСтоматология.ЗаполнитьСтруктуруФильтрациИсторииВзаимодйствия(СписокФильтрацииИсторииВзаимодействия, Фильтры);
	
	ПараметрыДанных = Новый Структура;
	ПараметрыДанных.Вставить("ДатаРожденияКлиента"		, Объект.Ссылка.ДатаРожденияКлиента);
	ПараметрыДанных.Вставить("ДатаРегистрацииКлиента"	, Объект.Ссылка.ДатаРегистрации);
	ПараметрыДанных.Вставить("Контрагент"				, Объект.Ссылка);
			
	ТаблицаИсторииВзаимодействий = Справочники.Контрагенты.ПолучитьИсториюВзаимодействияКлиента(ПараметрыДанных, Элементы.КнопкаПодробно.Пометка, Фильтры);	
	ЭтотОбъект.ИсторияВзаимодействий.Загрузить(ТаблицаИсторииВзаимодействий);	
	ТекстHTML = УправлениеИнтерфейсамиСервер.СформироватьИсториюВзаимодействий(ЭтаФорма, ПараметрыДанных, Элементы.КнопкаПодробно.Пометка, ЭтотОбъект.ВыводитьВсеВзаимодействия); 	
	ЭтотОбъект.ИсторияВзаимодействия = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(ТекстHTML);	
		
КонецПроцедуры

&НаСервере
// Процедура, выводит блок информации.
//
Процедура ВывестиБлокИнформация(ТекстHTML, Текст, ЦветФона = "#ffffff", РазмерШрифта = 16, ОтступСверху = 0, ОтступСнизу = 0)
	
	БлокИнформация =   
	"<tr style='background-color: {ЦветФона};'>
	|<td colspan='3'>
	|<p class='info' style='color: #1fa3ff; font: {РазмерШрифта}px arial; margin: {ОтступСверху}px 0px {ОтступСнизу}px 0px;'>{Текст}</p>
	|</td>	                               
	|</tr>";
	
	БлокИнформация = СтрЗаменить(БлокИнформация, "{ЦветФона}"    , ЦветФона);
	БлокИнформация = СтрЗаменить(БлокИнформация, "{РазмерШрифта}", РазмерШрифта);
	БлокИнформация = СтрЗаменить(БлокИнформация, "{ОтступСверху}", ОтступСверху);
	БлокИнформация = СтрЗаменить(БлокИнформация, "{ОтступСнизу}" , ОтступСнизу);
	БлокИнформация = СтрЗаменить(БлокИнформация, "{Текст}"       , Текст);
	
	ТекстHTML = ТекстHTML + БлокИнформация;
	
КонецПроцедуры

&НаСервере
// Функция, формирует блок визит.
//
Функция СформироватьБлокПланЛечения(ПланЛечения, Статус, ЦветФона = "", Запланировано = Ложь)
	
	ТекстHTML = 
	"<tr>
	|<td align='right' class='left_col' style='background-color: inherit;'>
	|<img alt='Прием' src='data:image/png;base64, {Картинка}'/>
	|</td>
	|<td class='center_col'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|<p class='content'><a href='{Ссылка}' title='Открыть план лечения'>{Представление}</a>({Статус}) Сумма: {Сумма} Оплачено: {Оплачено}</p>";
	
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Ссылка}"        , ПолучитьНавигационнуюСсылку(ПланЛечения));
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Представление}" , ПолучитьПредставлениеПланаЛечения(ПланЛечения, Статус, Запланировано));
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Картинка}"		 , Base64Строка(БиблиотекаКартинок.PNG_ПланЛечения_16х16.ПолучитьДвоичныеДанные()));
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Статус}"		 , ПланЛечения.Статус);
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Оплачено}"		 , "" + ПланЛечения.СуммаОплачено + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольноеПредставлениеВалюты());
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Сумма}"		 , "" + ПланЛечения.СуммаДокумента + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольноеПредставлениеВалюты());
	
	ВремЗапасы = ПланЛечения.Лечение.Выгрузить().Скопировать(); 
	ВремЗапасы.Свернуть("Номенклатура");                 
	
	Для Каждого Номенклатура Из ВремЗапасы.ВыгрузитьКолонку("Номенклатура") Цикл
		
		Шаблон = "<p class='content' title='{Номенклатура}'>{Номенклатура}</p>";
		ТекстHTML = ТекстHTML + Символы.ПС + СтрЗаменить(Шаблон, "{Номенклатура}", Строка(Номенклатура));			 	
		
	КонецЦикла;
	
	
	ТекстHTML = ТекстHTML + 
	"</td>
	|<td class='right_col' align='right'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|";
	
	УстановитьПривилегированныйРежим(Истина);
	
	СотрудникHTML = ""; 		
	
	СотрудникHTML = "<p class='author' title='{Сотрудник}'>{Сотрудник}</p>";
	СотрудникHTML = СтрЗаменить(СотрудникHTML, "{Сотрудник}", ПредставлениеФИОСотрудника(ПланЛечения.Сотрудник));			
	
	ТекстHTML = ТекстHTML + СотрудникHTML + Символы.ПС;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТекстHTML + "</td>" + Символы.ПС + "</tr>";
	
КонецФункции

&НаСервере
// Функция, возвращает представление визита.
//
Функция ПолучитьПредставлениеПланаЛечения(ПланЛечения, СтатусВизита, Запланировано = Ложь)
	
	Представление = "";
		
	Состояние = "";
	Если ПланЛечения.ПометкаУдаления Тогда
		Состояние = НСтр("ru='(удален)'");
	ИначеЕсли НЕ ПланЛечения.Проведен Тогда
		Состояние = НСтр("ru='(не проведен)'");
	КонецЕсли;
	
	Статус = "План лечения";
	ДатаДокумента = Формат(ПланЛечения.Дата, "ДЛФ=DD") + " в " + Формат(ПланЛечения.Дата, "ДФ=HH:мм");
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru='%1 %2 %3'"),
	Статус,
	ДатаДокумента,
	Состояние);
	
	Возврат Представление;
	
КонецФункции

// Функция - Сформировать блок задача
//
// Параметры:
//  СтрокаТЗ - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаСервере
Функция СформироватьБлокЗадача(Задача)
	
	ЦветФона = "";
	ШаблонЗадача = 
	"<tr valign='middle'>
	|<td class='left_col' td align='right'>
	|<img alt='Задача' src='data:image/png;base64, {Картинка}'/>
	|</td>
	|<td class='center_col' style='vertical-align: middle;" + ?(ЗначениеЗаполнено(ЦветФона), " background-color: " + ЦветФона + ";'", "'") + ">
	|<input {Чекнут} title='{ДопОписание}' type='checkbox' class='task' id='{УИд}'/>
	|<p class='content'><a href='{Ссылка}' title='Открыть задачу'>{Дата} {Представление}{ДопИнформация}.</a> {Описание}</p>
	|</td>
	|<td class='right_col' align='right'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|<p title='{Автор}' class='author'>{Автор}</p>
	|</td>
	|</tr>";
	
	УИд = Задача.УникальныйИдентификатор();
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{Описание}" 	  , ?(ЗначениеЗаполнено(Задача.ЗадачаОписание), Задача.ЗадачаОписание, ""));
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{Тема}"     	  , Задача.ЗадачаТема);
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{Дата}"     	  , ?(Задача.Выполнена, "", Формат(Задача.ЗадачаНазначеннаяДатаВыполнения, "ДФ='d MMMM'") + ","));
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{Автор}"    	  , Справочники.Сотрудники.ПредставлениеФИОСотрудника(Задача.ЗадачаАвтор.Сотрудник));
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{Представление}", Строка(Задача.Ссылка));
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{Ссылка}"       , ПолучитьНавигационнуюСсылку(Задача));
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{ДопОписание}"  , ?(Задача.Выполнена, "", "Отметить как выполнено"));
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{Чекнут}"   	  , ?(Задача.Выполнена, "checked disabled", ""));
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{УИд}"     	  , УИд);
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{Картинка}"	  , Base64Строка(БиблиотекаКартинок.PNG_ЗадачаНовый_16х16.ПолучитьДвоичныеДанные()));  	
	ШаблонЗадача = СтрЗаменить(ШаблонЗадача, "{ДопИнформация}", ?(Не Задача.Выполнена И Задача.ЗадачаНазначеннаяДатаВыполнения < ТекущаяДатаСеанса(), " <span style='color: red;'>(Просрочена)</span>", ""));
	
	Возврат ШаблонЗадача;	

КонецФункции

// Функция - Сформировать блок заметка
//
// Параметры:
//  СтрокаТЗ - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаСервере
Функция СформироватьБлокЗаметка(СтрокаТЗ)
	
	ЦветФона = "";
	ШаблонЗаметка = 
	"<tr>
	|<td align='right' class='left_col' style='background-color: inherit;'>
	|<img alt='Заметка' src='data:image/png;base64, {КартинкаЗаметки}'/>
	|</td>
	|<td class='center_col'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|<p class='content'><a href= '{Ссылка}' class='note' title='Открыть заметку' id='{ИдЗаметки}'>{ТекстЗаметки}</a>
	|<img alt='Заметка' src='data:image/png;base64, {КартинкаКарандаша}'/>
	|</p>
	|</td>
	|	<td class='right_col' align='right'>
	|		<p title='{ПодсказкаДаты}' class='author'>{АвторДокумента}</p>
	|		<a class='reference' style='background:' href=''</a>
	|	</td>
	//|	<td style='vertical-align: top;'>
	//|		<img id='{Уид}' class='{Стиль}' src='{Картинка}' title='{Подсказка}'/>
	//|	</td>
	|</tr>";
	Уид = СтрокаТЗ.ИдЗаметки;		
	
	Если ЗначениеЗаполнено(СтрокаТЗ.Ссылка) Тогда
		ТекстЗаметки = ?(СтрДлина(СтрокаТЗ.Ссылка) > 200, Лев(СтрокаТЗ.Ссылка, 200) + "...", СтрокаТЗ.Ссылка);
	Иначе
		ТекстЗаметки = "...";
	КонецЕсли;	                             
	
	ШаблонЗаметка = СтрЗаменить(ШаблонЗаметка, "{КартинкаЗаметки}"         ,  Base64Строка(БиблиотекаКартинок.PNG_ЗаметкаКарточка_16х16.ПолучитьДвоичныеДанные()));
	ШаблонЗаметка = СтрЗаменить(ШаблонЗаметка, "{КартинкаКарандаша}"         ,  Base64Строка(БиблиотекаКартинок.PNG_Редактировать_16х16.ПолучитьДвоичныеДанные()));
	ШаблонЗаметка = СтрЗаменить(ШаблонЗаметка, "{ТекстЗаметки}"          , ТекстЗаметки);
	ШаблонЗаметка = СтрЗаменить(ШаблонЗаметка, "{АвторДокумента}"        , СтрокаТЗ.Автор);
	ШаблонЗаметка = СтрЗаменить(ШаблонЗаметка, "{ИдЗаметки}"             , Уид);
	ШаблонЗаметка = СтрЗаменить(ШаблонЗаметка, "{ПодсказкаДаты}"         , Формат(СтрокаТЗ.Дата, "ДФ='dd.MM.yyyy HH:mm'"));		
	ШаблонЗаметка = СтрЗаменить(ШаблонЗаметка, "{КартинкаРедактирования}",  Base64Строка(БиблиотекаКартинок.PNG_Редактировать_16х16.ПолучитьДвоичныеДанные()));
	ШаблонЗаметка = СтрЗаменить(ШаблонЗаметка, "{Заголовок}"     		 , Нстр("ru='Редактировать заметку';en='Edit note'"));
	ШаблонЗаметка = СтрЗаменить(ШаблонЗаметка, "{Заметка}"	     		 , Нстр("ru='Заметка';en='Note'"));	
	
	// СобытиеЗакреплено = (СтрокаТЗ.ТипВзаимодействия = "Закреплен");
	// ВывестиСкрепку(ШаблонЗаметка, СобытиеЗакреплено, Уид);
	
	Возврат ШаблонЗаметка;	
	
КонецФункции

// Процедура - Вывести скрепку.
//
// Параметры:
//  ТекстHTML			 - 	 - 
//  СобытиеЗакреплено	 - 	 - 
//  Уид					 - 	 - 
//
Процедура ВывестиСкрепку(ТекстHTML, СобытиеЗакреплено, Уид)
	
	// Не работает пока.
	// Если СобытиеЗакреплено Тогда		
	//	// БиблиотекаКартинок.ОткрепитьСобытие
	//	АдресКартинки = Base64Строка(БиблиотекаКартинок.ОткрепитьСобытие.ПолучитьДвоичныеДанные());
	//	КлассСтиля    = "clip on"; 
	//	Подсказка     = Нстр("ru='Открепить';en='Unpin'");	
	// Иначе
	//	// БиблиотекаКартинок.ЗакрепитьСобытие
	//	АдресКартинки = Base64Строка(БиблиотекаКартинок.ЗакрепитьСобытие.ПолучитьДвоичныеДанные());
	//	КлассСтиля    = "clip off";
	//	Подсказка     = Нстр("ru='Закрепить';en='ToFasten'");			
	// КонецЕсли;

	// ТекстHTML = СтрЗаменить(ТекстHTML, "{Уид}"      , Уид); 
	// ТекстHTML = СтрЗаменить(ТекстHTML, "{Стиль}"    , КлассСтиля); 
	// ТекстHTML = СтрЗаменить(ТекстHTML, "{Подсказка}", Подсказка);
	// ТекстHTML = СтрЗаменить(ТекстHTML, "{Картинка}" , АдресКартинки);
	
КонецПроцедуры

&НаСервере
// Функция, формирует блок sms.
//
Функция СформироватьБлокSMS(ДокументSMSРассылки, Автор, Статус)
	
	ШаблонSMS = 
	"<tr>
	|<td align='right' class='left_col'>
	|<img alt='SMS' src='data:image/png;base64, {Картинка}'/>
	|</td>
	|<td class='center_col'>
	|<p class='content'>
	|<a href='{Ссылка}' title='Открыть сообщение'>{Прдставление}.</a>
	|{ТекстSMS}</p>
	|</td>
	|<td class='right_col' align='right' title='{АвторДокумента}'>{АвторДокумента}</td>
	|</tr>";
	
	ШаблонSMS = СтрЗаменить(ШаблонSMS, "{Прдставление}"  , ПолучитьПредставлениеИсходящегоСообщения(ДокументSMSРассылки, "SMS"));
	ШаблонSMS = СтрЗаменить(ШаблонSMS, "{ТекстSMS}"      , ДокументSMSРассылки.Содержание);
	// ШаблонSMS = СтрЗаменить(ШаблонSMS, "{Статус}"        , Статус);
	ШаблонSMS = СтрЗаменить(ШаблонSMS, "{АвторДокумента}", Автор);
	ШаблонSMS = СтрЗаменить(ШаблонSMS, "{Ссылка}"        , ПолучитьНавигационнуюСсылку(ДокументSMSРассылки));
	ШаблонSMS = СтрЗаменить(ШаблонSMS, "{Картинка}"		 , Base64Строка(БиблиотекаКартинок.PNG_ПациентыСообщениеОбсуждение_16х16.ПолучитьДвоичныеДанные()));

	Возврат ШаблонSMS;	
	
КонецФункции

&НаСервере
// Функция, формирует блок sms.
//
Функция СформироватьБлокПисьмо(ДокументSMSРассылки, Автор, Статус)
	
	ШаблонПисьмо = 
	"<tr>
	|<td align='right' class='left_col'>
	|<img alt='Письмо' src='data:image/png;base64, {Картинка}'/>
	|</td>
	|<td class='center_col'>
	|<p class='content'>
	|<a href='{Ссылка}' title='Открыть письмо'>{Прдставление}.</a>
	|{ТекстПисьмо}</p>
	|</td>
	|<td class='right_col' align='right' title='{АвторДокумента}'>{АвторДокумента}</td>
	|</tr>";
	
	ШаблонПисьмо = СтрЗаменить(ШаблонПисьмо, "{Прдставление}"  , ПолучитьПредставлениеИсходящегоСообщения(ДокументSMSРассылки, "Письмо"));
	ШаблонПисьмо = СтрЗаменить(ШаблонПисьмо, "{ТекстПисьмо}"      , ДокументSMSРассылки.ТекстHTML);
	// ШаблонSMS = СтрЗаменить(ШаблонSMS, "{Статус}"        , Статус);
	ШаблонПисьмо = СтрЗаменить(ШаблонПисьмо, "{АвторДокумента}", Автор);
	ШаблонПисьмо = СтрЗаменить(ШаблонПисьмо, "{Ссылка}"        , ПолучитьНавигационнуюСсылку(ДокументSMSРассылки));
	ШаблонПисьмо = СтрЗаменить(ШаблонПисьмо, "{Картинка}"	   , Base64Строка(БиблиотекаКартинок.PNG_Письмо_16х16.ПолучитьДвоичныеДанные()));

	Возврат ШаблонПисьмо;	
	
КонецФункции

&НаСервере
// Функция, возвращает представление документа sms рассылки.
//
Функция ПолучитьПредставлениеИсходящегоСообщения(SMSРассылка, ТиСообщения)

	Представление = "";
	
	Представление = ТиСообщения;
	
	Если SMSРассылка.Ссылка.Пустая() Тогда
		Представление = Представление + " (создание)";
	КонецЕсли;
	
	Состояние = "";
	Если SMSРассылка.ПометкаУдаления Тогда
		Состояние = НСтр("ru='(удален)'");
	ИначеЕсли НЕ SMSРассылка.Проведен Тогда
		Состояние = НСтр("ru='(не проведен)'");
	КонецЕсли;
	
	ДатаДокумента = "в " + Формат(SMSРассылка.Дата, "ДФ=HH:мм");
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru='%1 %2 %3'"),
	Представление,
	ДатаДокумента,
	Состояние);
	
	Возврат СокрЛП(Представление);
	
КонецФункции

&НаСервере
// Процедура, выводит блок дата.
//
Процедура ВывестиДату(ТекстHTML, Дата)
	
	ШаблонДаты = 
	"<tr>
	|<td colspan='3'>
	|<p class='date'>{Дата}</p>
	|</td>	
	|</tr>";
	
	Индекс   = СтрНайти(ТекстHTML, "<tr>", НаправлениеПоиска.СКонца);
	ДатаHTML = СтрЗаменить(ШаблонДаты, "{Дата}", ПолучитьПредставлениеДаты(Дата));
	Если Индекс > 0 Тогда
		ТекстHTML = Сред(ТекстHTML, 1, Индекс - 1) + СокрЛП(ДатаHTML); // заменяем последнюю пустую строку на дату, иначе получаем лишнюю строку
	Иначе
		ТекстHTML = ТекстHTML + ДатаHTML;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция, формирует блок визит.
//
Функция СформироватьБлокПредварительнаяЗапись(Запись, Статус, ЦветФона = "", Запланировано = Ложь)
	
	ТекстHTML = 
	"<tr>
	|<td align='right' class='left_col' style='background-color: inherit;'>
	|<img alt='Визит' src='data:image/png;base64, {Картинка}'/>
	|</td>
	|<td class='center_col'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|<p class='content'><a href='{Ссылка}' title='Открыть предварительную запись'>{Представление}</a></p>";
	
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Ссылка}"        , ПолучитьНавигационнуюСсылку(Запись));
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Представление}" , ПолучитьПредставлениеПредварительнойЗаписи(Запись, Статус, Запланировано));
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Картинка}"		 , Base64Строка(БиблиотекаКартинок.PNG_КалендарьПредварительнаяЗапись_16х16.ПолучитьДвоичныеДанные()));
		
	ВремЗапасы = Запись.Услуги.Выгрузить().Скопировать(); 
	ВремЗапасы.Свернуть("Номенклатура");                 
	
	Для Каждого Номенклатура Из ВремЗапасы.ВыгрузитьКолонку("Номенклатура") Цикл
		
		Шаблон = "<p class='content' title='{Номенклатура}'>{Номенклатура}</p>";
		ТекстHTML = ТекстHTML + Символы.ПС + СтрЗаменить(Шаблон, "{Номенклатура}", Строка(Номенклатура));			 	
		
	КонецЦикла;
	
	//|	<td class='right_col' align='right'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	//|		<p title='{Автор}' class='author'>{Автор}</p>
	//|		<p title='{АвторВзаимодействия}' class='authoroftheinteraction'>{АвторВзаимодействия}</p>		
	//|		<a class='reference' style='background: {НавигационнаяСсылкаЦвет}' href='{НавигационнаяСсылка}' title='{НавигационнаяСсылкаПодсказка}'>{НавигационнаяСсылкаПредставление}</a>
	//|	</td>
	
	ТекстHTML = ТекстHTML + 
	"</td>
	|<td class='right_col' align='right'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|";
	
	УстановитьПривилегированныйРежим(Истина);
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СобытиеУслуги.Сотрудник КАК Сотрудник,
	|	СобытиеУслуги.Сотрудник.Должность КАК СотрудникДолжность
	|ИЗ
	|	Документ.Событие.Услуги КАК СобытиеУслуги
	|ГДЕ
	|	СобытиеУслуги.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	СотрудникДолжность");
	
	Запрос.УстановитьПараметр("Ссылка", Запись);
	ВыборкаПоДолжностям = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Пока ВыборкаПоДолжностям.Следующий() Цикл
		
		СотрудникHTML = "";	
		
		УровеньСотрудник = ВыборкаПоДолжностям.Выбрать();		
		Пока УровеньСотрудник.Следующий() Цикл
			СотрудникHTML = СотрудникHTML + "<p class='author' title='{Сотрудник}'>{Сотрудник}</p>";
			СотрудникHTML = СтрЗаменить(СотрудникHTML, "{Сотрудник}", Запись.АвторДокумента);
		КонецЦикла;
		
		ТекстHTML = ТекстHTML + СотрудникHTML + Символы.ПС;
		
	КонецЦикла;
		
	ТекстHTML = ТекстHTML + "<a class='reference' style='background: {НавигационнаяСсылкаЦвет}' href='{НавигационнаяСсылка}' title='{НавигационнаяСсылкаПодсказка}'>{НавигационнаяСсылкаПредставление}</a>";
	
	ФормированиеБлокаВзаимодействияУстановитьЗначенияНавигационнойСсылки(ТекстHTML, Запись.Сделка, Запись);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТекстHTML + "</td>" + Символы.ПС + "</tr>";
	
КонецФункции

&НаСервере
// Функция, формирует блок визит.
//
Функция СформироватьБлокПрием(Прием, Статус, ЦветФона = "", Запланировано = Ложь)
	
	ТекстHTML = 
	"<tr>
	|<td align='right' class='left_col' style='background-color: inherit;'>
	|<img alt='Прием' src='data:image/png;base64, {Картинка}'/>
	|</td>
	|<td class='center_col'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|<p class='content'><a href='{Ссылка}' title='Открыть прием'>{Представление}</a>Сумма: {Сумма} Оплачено: {Оплачено}</p>";
	
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Ссылка}"        , ПолучитьНавигационнуюСсылку(Прием));
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Представление}" , ПолучитьПредставлениеПриема(Прием, Статус, Запланировано));
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Картинка}"		 , Base64Строка(БиблиотекаКартинок.PNG_СтетоскопПриемВрача_16х16.ПолучитьДвоичныеДанные()));
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Оплачено}"		 , "" + Прием.СуммаОплачено + ОбщегоНазначенияСтоматология.ПолучитьСимвольноеПредставлениеВалюты());
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Сумма}"		 , "" + Прием.СуммаДокумента + ОбщегоНазначенияСтоматология.ПолучитьСимвольноеПредставлениеВалюты());
	
	ВремЗапасы = Прием.Лечение.Выгрузить().Скопировать(); 
	ВремЗапасы.Свернуть("Номенклатура");                 
	
	Для Каждого Номенклатура Из ВремЗапасы.ВыгрузитьКолонку("Номенклатура") Цикл
		
		Шаблон = "<p class='content' title='{Номенклатура}'>{Номенклатура}</p>";
		ТекстHTML = ТекстHTML + Символы.ПС + СтрЗаменить(Шаблон, "{Номенклатура}", Строка(Номенклатура));			 	
		
	КонецЦикла;
	
	
	ТекстHTML = ТекстHTML + 
	"</td>
	|<td class='right_col' align='right'" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|";
	
	УстановитьПривилегированныйРежим(Истина);
	
	СотрудникHTML = ""; 		
	
	СотрудникHTML = "<p class='author' title='{Сотрудник}'>{Сотрудник}</p>";
	СотрудникHTML = СтрЗаменить(СотрудникHTML, "{Сотрудник}", ПредставлениеФИОСотрудника(Прием.Сотрудник));
	Если ЗначениеЗаполнено(Прием.Ассистент) Тогда
		СотрудникHTML = СотрудникHTML + "<p class='author' title='{Ассистент}'>{Ассистент}</p>";
		СотрудникHTML = СтрЗаменить(СотрудникHTML, "{Ассистент}", ПредставлениеФИОСотрудника(Прием.Ассистент));
	КонецЕсли;			
	
	ТекстHTML = ТекстHTML + СотрудникHTML + Символы.ПС;
		
	ТекстHTML = ТекстHTML + "<a class='reference' style='background: {НавигационнаяСсылкаЦвет}' href='{НавигационнаяСсылка}' title='{НавигационнаяСсылкаПодсказка}'>{НавигационнаяСсылкаПредставление}</a>";
	
	ФормированиеБлокаВзаимодействияУстановитьЗначенияНавигационнойСсылки(ТекстHTML, Прием.Сделка, Прием);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТекстHTML + "</td>" + Символы.ПС + "</tr>";
	
КонецФункции

// Процедура - Сформировать блок взаимодействия получить значения навигационной ссылки.
//
// Параметры:
//  Задача					 - 	 - 
//  ТипЗадачи				 - 	 - 
//  ДопДанныеПодсказка		 - 	 - 
//  ДопДанныеПредставление	 - 	 - 
//  ДопДанныеЦвет			 - 	 - 
//  НавигационнаяСсылка		 - 	 - 
//  ЦветФона				 - 	 - 
//
Процедура ФормированиеБлокаВзаимодействияУстановитьЗначенияНавигационнойСсылки(ШаблонБлока, СделкаВзаимодействия = Неопределено, ОбъектВзаимодействия = Неопределено)
	
	// Если передана сделка взаимодействия.
	Если ЗначениеЗаполнено(СделкаВзаимодействия) И ТипЗнч(СделкаВзаимодействия) = Тип("СправочникСсылка.Сделки") Тогда
		ДанныеСделки 		= ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(СделкаВзаимодействия, "Наименование, Код, ВидСделки, ЭтапСделки, Врач");
		ВидСделки 			= ДанныеСделки.ВидСделки;
		Врач 				= ДанныеСделки.Врач;
		
		НаименованиеСделки 	= Справочники.Сделки.ИнициализироватьСокращенноеНаименованиеСделки(ДанныеСделки, Истина, , Истина);
		
		Если НЕ ЗначениеЗаполнено(НаименованиеСделки) Тогда 
			НаименованиеСделки = ?(ЗначениеЗаполнено(ДанныеСделки.Наименование), ДанныеСделки.Наименование, Справочники.Сделки.СоздатьНаименованиеСделки(СделкаВзаимодействия));
			НаименованиеСделки = СокрЛП(НаименованиеСделки) + " " + Справочники.Сделки.ПолучитьСокращенноеНаименованиеВрача(, ДанныеСделки.Врач); 
		КонецЕсли;	
		НавигационнаяСсылкаПредставление = НаименованиеСделки;
		НавигационнаяСсылкаПодсказка     = НавигационнаяСсылкаПредставление;
		НавигационнаяСсылкаЦвет          = ПолучитьЦветДляСделки(, ДанныеСделки.ЭтапСделки);
		НавигационнаяСсылка              = ПолучитьНавигационнуюСсылку(СделкаВзаимодействия);  
	ИначеЕсли ЗначениеЗаполнено(ОбъектВзаимодействия) Тогда 
		Если ОбщегоНазначенияСтоматология.ЕстьРеквизитОбъекта("Сделка", , ОбъектВзаимодействия) Тогда
			Сделка = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ОбъектВзаимодействия, "Сделка");
			Если ЗначениеЗаполнено(Сделка) Тогда
				ДанныеСделки 		= ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(Сделка, "Наименование, Код, ВидСделки, ЭтапСделки, Врач");
				ВидСделки 			= ДанныеСделки.ВидСделки;
				Врач 				= ДанныеСделки.Врач;
				
				НаименованиеСделки 	= Справочники.Сделки.ИнициализироватьСокращенноеНаименованиеСделки(ДанныеСделки, Истина, , Истина);
				
				Если НЕ ЗначениеЗаполнено(НаименованиеСделки) Тогда 
					НаименованиеСделки = ?(ЗначениеЗаполнено(ДанныеСделки.Наименование), ДанныеСделки.Наименование, Справочники.Сделки.СоздатьНаименованиеСделки(Сделка));
					НаименованиеСделки = СокрЛП(НаименованиеСделки) + " " + Справочники.Сделки.ПолучитьСокращенноеНаименованиеВрача(, ДанныеСделки.Врач); 
				КонецЕсли;	
				НавигационнаяСсылкаПредставление = НаименованиеСделки;
				НавигационнаяСсылкаПодсказка     = НавигационнаяСсылкаПредставление;
				НавигационнаяСсылкаЦвет          = "rgb(236, 236, 159)";
				НавигационнаяСсылка              = ПолучитьНавигационнуюСсылку(Сделка);  
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ШаблонБлока = СтрЗаменить(ШаблонБлока, "{НавигационнаяСсылкаПредставление}", НавигационнаяСсылкаПредставление);
	ШаблонБлока = СтрЗаменить(ШаблонБлока, "{НавигационнаяСсылкаПодсказка}"    , НавигационнаяСсылкаПодсказка);
	ШаблонБлока = СтрЗаменить(ШаблонБлока, "{НавигационнаяСсылкаЦвет}"         , НавигационнаяСсылкаЦвет);
	ШаблонБлока = СтрЗаменить(ШаблонБлока, "{НавигационнаяСсылка}"             , НавигационнаяСсылка);	
		
КонецПроцедуры

// Функция - Получить цвет для бизнес процесса.
//
// Параметры:
//  БизнесПроцесс	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЦветДляСделки(Сделка = Неопределено, ЭтапСделки = Неопределено)
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Сделка) И НЕ ЗначениеЗаполнено(ЭтапСделки) Тогда
		Возврат "";
	КонецЕсли;
	
	ЦветЭтапа = "";
	Если НЕ ЗначениеЗаполнено(ЭтапСделки) Тогда 
		ЭтапСделки 	= ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Сделка, "ЭтапСделки");
		Если ЗначениеЗаполнено(ЭтапСделки) Тогда
			Если ЭтапСделки = Справочники.ЭтапыСделок.Успех Тогда 
				ЦветЭтапа = Новый Цвет(72, 193, 123);
			ИначеЕсли ЭтапСделки = Справочники.ЭтапыСделок.Отказ Тогда 
				ЦветЭтапа = Новый Цвет(246, 110, 110);
			Иначе 	
				ЦветЭтапа 	= ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ЭтапСделки, "ЦветЭтапа");
			КонецЕсли;	
		Иначе 
			ЦветЭтапа 	= "";
		КонецЕсли;	
	Иначе 
		Если ЭтапСделки = Справочники.ЭтапыСделок.Успех Тогда 
			ЦветЭтапа = Новый Цвет(72, 193, 123);
		ИначеЕсли ЭтапСделки = Справочники.ЭтапыСделок.Отказ Тогда 
			ЦветЭтапа = Новый Цвет(246, 110, 110);
		Иначе 	
			ЦветЭтапа 	= ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ЭтапСделки, "ЦветЭтапа");
		КонецЕсли;	
	КонецЕсли;	
	Цвет      		= ?(ТипЗнч(ЦветЭтапа) = Тип("Цвет"), ЦветЭтапа, ?(ТипЗнч(ЦветЭтапа) = Тип("Строка") И ЗначениеЗаполнено(ЦветЭтапа), ЗначениеИзСтрокиВнутр(ЦветЭтапа), Неопределено));	
		
	Возврат ?(Цвет <> Неопределено, СтрШаблон("rgb(%1,%2,%3)", Цвет.Красный, Цвет.Зеленый, Цвет.Синий), "");
	
КонецФункции

&НаСервере
// Функция, выводит пустую строку.
//
Функция ДобавитьПустуюСтроку(ЦветФона = "")
	
	Возврат 
	"<tr" + ?(ЗначениеЗаполнено(ЦветФона), " style='background-color: " + ЦветФона + ";'", "") + ">
	|<td colspan='3' style='height: 8px;'>
	|</td>	
	|</tr>";
	
КонецФункции

&НаСервере
// Функция, формирует блок показать еще.
//
Функция ВывестиБлокПоказатьЕще(ТекстHTML, Текст)
	
	БлокИнформация =   
	"<tr>
	|<td colspan='3'>
	|<p class='info' style='color: #1fa3ff; font: 16px arial;'><a style='color: #1fa3ff;' id='more' href=''>{Текст}</a></p>
	|</td>	                               
	|</tr>";
	
	БлокИнформация = СтрЗаменить(БлокИнформация, "{Текст}", Текст);	
	ТекстHTML = ТекстHTML + БлокИнформация;	
	
КонецФункции

&НаСервере
// Функция, проверяет отключены ли все фильтры.
//
Функция ВсеФильтрыОтключены(Фильтры)
	
	Для Каждого Фильтр Из Фильтры Цикл
		Если Фильтр.Значение = Истина Тогда
			Возврат Ложь;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
// Функция - Получить представление даты
//
// Параметры:
//  Период	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПредставлениеДаты(Период)
	
	Если НачалоДня(ТекущаяДатаСеанса()) = НачалоДня(Период) Тогда
		
		Дата = "Сегодня";
		
	ИначеЕсли НачалоДня(НачалоДня(ТекущаяДатаСеанса())-1) = НачалоДня(Период) Тогда
		
		Дата = "Вчера";
		
	ИначеЕсли НачалоДня(КонецДня(ТекущаяДатаСеанса())+1) = НачалоДня(Период) Тогда
		
		Дата = "Завтра";
		
	Иначе
		
		Дата = Формат(Период, "ДЛФ=DD");
		
	КонецЕсли;
	
	Возврат Дата;

КонецФункции

&НаСервере
// Функция, возвращает представление визита.
//
Функция ПолучитьПредставлениеПредварительнойЗаписи(Событие, СтатусЗаписи, Запланировано = Ложь)
	
	Представление = "";
		
	Состояние = "";
	Если Событие.ПометкаУдаления Тогда
		Состояние = НСтр("ru='(удален)'");
	ИначеЕсли НЕ Событие.Проведен Тогда
		Состояние = НСтр("ru='(не проведен)'");
	КонецЕсли;
	
	Статус = "Предварительная запись";
	
	ДатаДокумента = "на " + Формат(Событие.Дата, "ДФ=HH:мм") + ?(Запланировано, ", " + Формат(Событие.Дата, "ДЛФ=DD"), "") + " {Статус}";
	
	Если СтатусЗаписи = Перечисления.СтатусыСобытия.ПриемОтменен
		Или СтатусЗаписи = Перечисления.СтатусыСобытия.ПриемНеСостоялся Тогда 
		ДатаДокумента = СтрЗаменить(ДатаДокумента, "{Статус}", "<span style='color: red;'>(" + СокрЛП(Строка(СтатусЗаписи)) + ")</span>");	
	Иначе
		ДатаДокумента = СтрЗаменить(ДатаДокумента, "{Статус}", "(" + СокрЛП(Строка(СтатусЗаписи)) + ")");
	КонецЕсли;
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru='%1 %2 %3'"),
	Статус,
	ДатаДокумента,
	Состояние);
	
	Возврат Представление;
	
КонецФункции

&НаСервере
// Функция, возвращает представление визита.
//
Функция ПолучитьПредставлениеПриема(Прием, СтатусВизита, Запланировано = Ложь)
	
	Представление = "";
		
	Состояние = "";
	Если Прием.ПометкаУдаления Тогда
		Состояние = НСтр("ru='(удален)'");
	ИначеЕсли НЕ Прием.Проведен Тогда
		Состояние = НСтр("ru='(не проведен)'");
	КонецЕсли;
	
	Статус = "Прием";
	ДатаДокумента = "в " + Формат(Прием.ВремяНачалаПриема, "ДФ=HH:мм") + ?(Запланировано, ", " + Формат(Прием.ВремяНачалаПриема, "ДЛФ=DD"), "");
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru='%1 %2 %3'"),
	Статус,
	ДатаДокумента,
	Состояние);
	
	Возврат Представление;
	
КонецФункции

&НаСервере
// Функция - Представление ФИОСотрудника
//
// Параметры:
//  Сотрудник	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПредставлениеФИОСотрудника(Сотрудник) 
	
	УстановитьПривилегированныйРежим(Истина);
	Если ЗначениеЗаполнено(Сотрудник.Фамилия) ИЛИ ЗначениеЗаполнено(Сотрудник.Имя) Тогда 
		Возврат ?(ЗначениеЗаполнено(Сотрудник.Фамилия), Сотрудник.Фамилия + "","")
		+ ?(ЗначениеЗаполнено(Сотрудник.Имя)," " + Лев(СокрЛП(Сотрудник.Имя), 1) + ".","")
		+ ?(ЗначениеЗаполнено(Сотрудник.Отчество)," " + Лев(СокрЛП(Сотрудник.Отчество), 1) + ".", "");
	Иначе
		Возврат Сотрудник.Наименование;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
// Процедура, устанавливает фильтр истории взаимодействия.
//
Процедура УстановитьФильтрИсторииВзаимодействия(Элемент)
	
	УстановитьФильтрИсторииВзаимодействияНаСервере(Элемент.Имя);
	
КонецПроцедуры

&НаСервере
// Процедура, устанавливает фильтр истории взаимодействия на сервере.
//
Процедура УстановитьФильтрИсторииВзаимодействияНаСервере(ИмяЭлемента = Неопределено)
	
	Если ЗначениеЗаполнено(ИмяЭлемента) Тогда
		Фильтр = Элементы[ИмяЭлемента];
		УстановитьФильтр = СтрНайти(Фильтр.Подсказка, "Установить") > 0;
		Фильтр.Картинка  = ?(УстановитьФильтр, БиблиотекаКартинок.ФильтрОчистить, БиблиотекаКартинок.Фильтр);
		Фильтр.Подсказка = ?(УстановитьФильтр, "Очистить фильтр", "Установить фильтр"); 
	КонецЕсли;
	
	Если Не Объект.Ссылка.Пустая() Тогда
				
		СформироватьИсториюВзаимодействияСКлиентом();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция, возвращает значение фильтра.
//
Функция ПолучитьЗначениеФильтра(ИмяФильтр)
	
	НайденныйЭлемент = Элементы.Найти("ДекорацияФильтр" + ИмяФильтр);
	Если НЕ НайденныйЭлемент = Неопределено Тогда
		
		Фильтр = Элементы["ДекорацияФильтр" + ИмяФильтр];
		Возврат СтрНайти(Фильтр.Подсказка, "Очистить") > 0;
		// Возврат Истина;
		
	КонецЕсли;

КонецФункции

&НаКлиенте
// Процедура - Запись на прием
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ЗаписьНаПрием(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОЗаписиКлиента", ЭтотОбъект, Новый Структура("ВыполнитьДействие", "ЗаписьНаПрием"));
		ПоказатьВопрос(ОписаниеОповещения, "Для записи на визит нужно произвести запись нового клиента. Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе 		
		СоздатьПриемНаКлиенте(); 		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Создать прием на клиенте
//
Процедура СоздатьПриемНаКлиенте()
	
	ОткрытьФорму("Документ.Прием.ФормаОбъекта", Новый Структура("Основание", Новый Структура("Контрагент", Объект.Ссылка)));  	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Создать план лечения
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СоздатьПланЛечения(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОЗаписиКлиента", ЭтотОбъект, Новый Структура("ВыполнитьДействие", "СозданиеПланаЛечения"));
		ПоказатьВопрос(ОписаниеОповещения, "Для записи на визит нужно произвести запись нового клиента. Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе 		
		СоздатьПланЛеченияНаКлиенте(); 		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Создать план лечения на клиенте
//
Процедура СоздатьПланЛеченияНаКлиенте()
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Контрагент", Объект.Ссылка);
	Если ЭтотОбъект.ПолисыСуществующие.Количество() = 1
		И ЗначениеЗаполнено(ЭтотОбъект.ПолисыСуществующие[0].Полис) Тогда
		СтруктураПараметров.Вставить("ПолисМедСтрахования",ЭтотОбъект.ПолисыСуществующие[0].Полис);
	КонецЕсли;
	ОткрытьФорму("Документ.ПланЛечения.ФормаОбъекта", Новый Структура("Основание", СтруктураПараметров));  	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить предварительную запись
//
Процедура ДобавитьПредварительнуюЗапись()
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОЗаписиКлиента", ЭтотОбъект, Новый Структура("ВыполнитьДействие", "ДобавитьПредварительнуюЗапись"));
		ПоказатьВопрос(ОписаниеОповещения, "Для записи на прием нужно произвести запись нового пациента. Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ОткрытьЖурналЗаписиПоКлиенту(Объект.Ссылка);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие лист ожидания.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеЛистОжидания(Команда)
	
	// Открыть форму записи в лист ожидания.
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент"        , Объект.Ссылка);
	ПараметрыФормы.Вставить("СтруктурнаяЕдиница", ТекущаяСтруктурнаяЕдиница);
	
	ОткрытьФорму("РегистрСведений.Профосмотры.Форма.ФормаЗаписиВЛистОжидания", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналЗаписиПоКлиенту(Контрагент)
	
	ПараметрыОткрытия = Новый Структура("Контрагент ,ЗаписьИзДругойФормы, ЗакрыватьПриИзмененииСобытия", Контрагент, Истина, Ложь);
	
	ИмяФормыПланировщика = ОбщегоНазначенияКлиент.ПолучитьИмяФормыПланировщика(ПараметрыОткрытия, "ФормаЗаписи");
	ОткрытьФорму(ИмяФормыПланировщика, ПараметрыОткрытия,, Новый УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	// ПараметрыОткрытия = Новый Структура("Контрагент, ЗаписьИзКарточкиКлиента", Объект.Ссылка, Истина);
	// ОткрытьФорму("Обработка.РабочийКалендарь.Форма.ФормаЗаписи", ПараметрыОткрытия,, Новый УникальныйИдентификатор);  	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Создать SMSРассылку
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СоздатьSMSРассылку(Команда) 
	
	ЭтотОбъект.ТипСообщенияPushSMSМессенджер = ПредопределенноеЗначение("Перечисление.ТипыСобытий.SMS");
	Если Объект.Ссылка.Пустая() Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаОЗаписиКлиента", ЭтотОбъект, Новый Структура("ВыполнитьДействие", "СоздатьSMS"));
		ПоказатьВопрос(Оповещение, "Для отправки sms/push/сообщения в мессенджер необходимо произвести запись нового клиента. Записать?", РежимДиалогаВопрос.ДаНет);
	Иначе
		Если Модифицированность И Не ЭтаФорма.Записать() Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыОткрытия = Новый Структура;
		ПодготовкаКОтправкеСообщения(ПараметрыОткрытия);
		
		ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаОтправкиСообщения", 
					 ПараметрыОткрытия,,,,,,
					 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, собирает данные для открытия формы ОтправкиСообщения.
//
Процедура ПодготовкаКОтправкеСообщения(ПараметрыОткрытия)
	
	// Получаем данные контактной информации.
	МассивНомеровТелефонов = ЭтотОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид, НеУчаствоватьВРассылке", Справочники.ВидыКонтактнойИнформации.ТелефонКлиента, Ложь));
	МассивАдресовЭП 	   = ЭтотОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.EmailКлиента));
	
	ДоступнаОтправкаВМессенджер = ПолучитьПризнакДоступностиОтправкиВМессенджер(Объект.Ссылка, МассивНомеровТелефонов);
	
	ДоступныеНомераТелефонов = Новый Массив;
	ДоступныеАдресаЭП		 = Новый Массив;
	ДоступныеКаналыРассылки  = Новый Массив;
	КартыКлиента		  	 = Новый Массив;
	
	Для Каждого СтрокаКИ Из МассивНомеровТелефонов Цикл
		Если СтрокаКИ.НеУчаствоватьВРассылке = Ложь И ЗначениеЗаполнено(СтрокаКИ.Значение) Тогда
			ДоступныеНомераТелефонов.Добавить(СтрокаКИ.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаКИ Из МассивАдресовЭП Цикл
		Если СтрокаКИ.НеУчаствоватьВРассылке = Ложь Тогда
			ДоступныеАдресаЭП.Добавить(СтрокаКИ.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ДоступныеНомераТелефонов) 
		И Не ЗначениеЗаполнено(ДоступныеАдресаЭП)  
		И ДоступнаОтправкаВМессенджер = Ложь Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='У клиента нет доступных каналов для рассылки sms сообщений, push-уведомлений и электронных писем'; en='The client has no available channels for newsletter sms posts, push notifications and electronic letters'"));
		Возврат;
		
	КонецЕсли;
	
	ЭтотОбъект.ВзаимодействиеПисьмоСписокАдресовЭП.ЗагрузитьЗначения(ДоступныеАдресаЭП);
	ЭтотОбъект.ВзаимодействиеSMSСписокНомеровТелефонов.ЗагрузитьЗначения(ДоступныеНомераТелефонов);
	
	Если Не (ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеSMSНомерТелефона)
		И ДоступныеНомераТелефонов.Найти(ЭтотОбъект.ВзаимодействиеSMSНомерТелефона) <> Неопределено)
		И ДоступныеНомераТелефонов.Количество() > 0 Тогда
		
		ЭтотОбъект.ВзаимодействиеSMSНомерТелефона = ДоступныеНомераТелефонов[0];
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Контрагент"						, Объект.Ссылка);
	ПараметрыОткрытия.Вставить("ДоступныеНомераТелефонов"		, ЭтотОбъект.ВзаимодействиеSMSСписокНомеровТелефонов);
	ПараметрыОткрытия.Вставить("ШаблоныSms"						, ЭтотОбъект.ВзаимодействиеSMSСписокШаблонов);
	ПараметрыОткрытия.Вставить("ВзаимодействиеSMSНомерТелефона" , ЭтотОбъект.ВзаимодействиеSMSНомерТелефона); 
	ПараметрыОткрытия.Вставить("ДоступныеАдресаЭП"				, ЭтотОбъект.ВзаимодействиеПисьмоСписокАдресовЭП);
	ПараметрыОткрытия.Вставить("ШаблоныПисьма"					, ЭтотОбъект.ВзаимодействиеПисьмоСписокШаблонов);
	ПараметрыОткрытия.Вставить("ВзаимодействиеСделка"			, ЭтотОбъект.ВзаимодействиеСделка);
	ПараметрыОткрытия.Вставить("МессенджерВключен"				, ДоступнаОтправкаВМессенджер);
	ПараметрыОткрытия.Вставить("ШаблоныМессенджера"			    , ЭтотОбъект.ВзаимодействиеМессенджерСписокШаблонов);
	
КонецПроцедуры

// Функция проверяет существование расширения
//
Функция ИспользуетсяРасширение(ИмяРасширения)
    
    // Получить само расширение
    УстановитьПривилегированныйРежим(Истина);
	
    МассивРасширений = РасширенияКонфигурации.Получить();
	НужноеРасширение = Новый Массив;  
	
	Для Каждого ЭлементМ Из МассивРасширений Цикл
		Если СтрЧислоВхождений(ЭлементМ.Имя, ИмяРасширения) > 0 Тогда
			НужноеРасширение.Добавить(ЭлементМ);
		КонецЕсли;
	КонецЦикла;
	
	Если НужноеРасширение.Количество() <> 1 Тогда
        Возврат Ложь;
    КонецЕсли;
    Расширение = НужноеРасширение[0];
    
    // Проверить активность

    Если НЕ Расширение.Активно Тогда
        Возврат Ложь;
    КонецЕсли;
    
    // Проверить возможность применения
    ПроблемыПрименимости = Расширение.ПроверитьВозможностьПрименения();
	Если ПроблемыПрименимости.Количество() > 0 Тогда
		Для Каждого ЭлементМ Из ПроблемыПрименимости Цикл
			Если Не Строка(ЭлементМ.Расширение.ОбластьДействия) = "Информационная база" Тогда	
				Возврат Ложь;       
			КонецЕсли;
		КонецЦикла;
    КонецЕсли;
    
    Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКартыКлиента(Клиент)
	
	Возврат Справочники.Карты.ПолучитьКартыКлиента(Клиент,, Перечисления.ВидыКарт.Электронная, Ложь,, Ложь, Истина);
	
КонецФункции

&НаКлиенте
// Процедура - Создать письмо.
//
Процедура СоздатьПисьмо()
	
	// Если Не ПроверитьВидимостьВсплывающихГрупп("Письмо") Тогда
	//	Возврат;
	// КонецЕсли;	
	Если Объект.Ссылка.Пустая() Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаОЗаписиКлиента", ЭтотОбъект, Новый Структура("ВыполнитьДействие", "СоздатьПисьмо"));
		ПоказатьВопрос(Оповещение, НСтр("ru='Для отправки электронного письма необходимо произвести запись нового клиента. Записать?';en='For sending electronic letters is necessary toproduce record new client. To record?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		Если Модифицированность И Не ЭтаФорма.Записать() Тогда
			Возврат;
		КонецЕсли;
		Элементы.ГруппаПисьмоВсплывающая.Видимость = Истина;
		СоздатьПисьмоНаКлиенте();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, создает исходящее электронное письмо.
//
Процедура СоздатьПисьмоНаКлиенте()
	
	НайденныеСтрокиКИ = ЭтотОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailКлиента")));
	
	Если ЗначениеЗаполнено(НайденныеСтрокиКИ) и ЗначениеЗаполнено(НайденныеСтрокиКИ[0].ЗначенияПолей) Тогда
		
		МассивАдресовЭП = Новый Массив;
		
		Для Каждого СтрокаКИ Из НайденныеСтрокиКИ Цикл
			Если СтрокаКИ.НеУчаствоватьВРассылке = Ложь Тогда
				МассивАдресовЭП.Добавить(СтрокаКИ.Представление);
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(МассивАдресовЭП) Тогда
			
			ЭтотОбъект.ВзаимодействиеПисьмоСписокАдресовЭП.ЗагрузитьЗначения(МассивАдресовЭП);
			
			Если Не (ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП)
				И МассивАдресовЭП.Найти(ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП) <> Неопределено) Тогда
				
				ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП = МассивАдресовЭП[0];
			КонецЕсли;
			
			Элементы.ВзаимодействиеПисьмоВыбратьАдресЭП.Заголовок = ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП;
			Элементы.ГруппаВзаимодействиеПисьмоНастроитьАккаунт.Видимость = Не НаличиеПочтовогоАккаунта();
			Элементы.ГруппаВзаимодействиеПисьмоОсновная.Видимость         = Не Элементы.ГруппаВзаимодействиеПисьмоНастроитьАккаунт.Видимость;
			
			ЭтаФорма.ТекущийЭлемент = Элементы.ГруппаПисьмоВсплывающая;
			УстановитьВидимостьВсплывающихГрупп("Письмо");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У клиента запрещена рассылка электронных писем");
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У клиента не задан адрес электронной почты");
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Проверить наличие почтового аккаунта.
//
// Возвращаемое значение:
//   -
//
Функция НаличиеПочтовогоАккаунта()
	
	Возврат ЗначениеЗаполнено(УправлениеЭлектроннойПочтой.ПолучитьУчетнуюЗаписьДляОтправкиПоУмолчанию());
	
КонецФункции 

&НаКлиенте
// Процедура, создает sms рассылку.
//
Процедура СоздатьSMSРассылкуНаКлиенте()
	
	Если ЭтотОбъект.ТипСообщенияPushSMSМессенджер = ПредопределенноеЗначение("Перечисление.ТипыСобытий.SMS") Тогда
		
		НайденныеСтрокиКИ = ЭтотОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКлиента")));
		
		Если ЗначениеЗаполнено(НайденныеСтрокиКИ) и ЗначениеЗаполнено(НайденныеСтрокиКИ[0].ЗначенияПолей) Тогда
			
			МассивНомеровТелефонов = Новый Массив;

			Для Каждого СтрокаКИ Из НайденныеСтрокиКИ Цикл
				Если СтрокаКИ.НеУчаствоватьВРассылке = Ложь Тогда
					МассивНомеровТелефонов.Добавить(СтрокаКИ.Представление);
				КонецЕсли;
			КонецЦикла;
			
			Если ЗначениеЗаполнено(МассивНомеровТелефонов) Тогда
				
				ЭтотОбъект.ВзаимодействиеSMSСписокНомеровТелефонов.ЗагрузитьЗначения(МассивНомеровТелефонов);
				
				Если Не (ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеSMSНомерТелефона)
					И МассивНомеровТелефонов.Найти(ЭтотОбъект.ВзаимодействиеSMSНомерТелефона) <> Неопределено) Тогда
					
					ЭтотОбъект.ВзаимодействиеSMSНомерТелефона = МассивНомеровТелефонов[0];
				КонецЕсли;
				
				Элементы.ВзаимодействиеSMSВыбратьНомерТелефона.Заголовок  = ЭтотОбъект.ВзаимодействиеSMSНомерТелефона;
				// Элементы.ГруппаВзаимодействиеSMSОсновная.Видимость        = Не Элементы.ГруппаВзаимодействиеSMSНастроитьСервис.Видимость;
				
				// ЭтаФорма.ТекущийЭлемент = Элементы.ГруппаSMSВсплывающая;
				ЭтаФорма.ТекущийЭлемент = Элементы.ВзаимодействиеSMSТекст;
				УстановитьВидимостьВсплывающихГрупп("SMS");
				
				УстановитьДанныеМессенджераНаСервере();
					
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У клиента запрещена рассылка sms сообщений");
			КонецЕсли;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У клиента не задан номер телефона");
		КонецЕсли;
		
	ИначеЕсли ЭтотОбъект.ТипСообщенияPushSMSМессенджер = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ПушУведомление") Тогда
		
		// Обработка для отправки Пуш уведомлений	
		
	ИначеЕсли ЭтотОбъект.ТипСообщенияPushSMSМессенджер = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Мессенджер") Тогда
		
		НайденныеСтрокиКИ = ЭтотОбъект.ВзаимодействиеSMSСписокНомеровТелефонов;
		
		Если НЕ ЗначениеЗаполнено(НайденныеСтрокиКИ) ИЛИ НЕ ЗначениеЗаполнено(НайденныеСтрокиКИ[0].Значение) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У клиента не задан номер телефона");
		КонецЕсли;
		
		ЭтотОбъект.ВзаимодействиеSMSНомерТелефона = НайденныеСтрокиКИ[0].Значение;
		
		// УстановитьВидимостьВсплывающихГрупп("SMS"); // было закомменчено
		
	КонецЕсли;

КонецПроцедуры

#Область ОбработчикиПереключателейSMSPushМессенджер

&НаСервере
// Процедура устанавливанет данные мессенджера
//
Процедура УстановитьДанныеМессенджераНаСервере()
	
	УстановитьАктивностьПереключателямSmsPushMessage();
	УстановитьВидимостьОтправкиВМессенджер();
	УстановитьВидимостьМобильногоПриложения();
	
КонецПроцедуры

&НаСервере
// Процедура устанавливает активность переключателей
//
Процедура УстановитьАктивностьПереключателямSmsPushMessage()
	
	Для Каждого ЭлементГруппа Из Элементы.ГруппаПереключатели.ПодчиненныеЭлементы Цикл
		ЭлементГруппа.ЦветФона = Новый Цвет(242, 242, 242);	
		ЭлементГруппа.ПодчиненныеЭлементы[0].ЦветТекста        = Новый Цвет(0 ,0 ,0);
    КонецЦикла;
		
	Если ЭтотОбъект.ТипСообщенияPushSMSМессенджер = ПредопределенноеЗначение("Перечисление.ТипыСобытий.SMS") Тогда
		НазваниеЭлемента = "СМС";
	ИначеЕсли ЭтотОбъект.ТипСообщенияPushSMSМессенджер = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ПушУведомление") Тогда
		НазваниеЭлемента = "Push";
	ИначеЕсли ЭтотОбъект.ТипСообщенияPushSMSМессенджер = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Мессенджер") Тогда
		НазваниеЭлемента = "Мессенджер";	
	КонецЕсли;
		
	Элементы["ГруппаПереключатель"+НазваниеЭлемента].ЦветФона    = Новый Цвет(25 , 116, 206);		
	Элементы["КнопкаПереключатель"+НазваниеЭлемента].ЦветТекста = Новый Цвет(255, 255, 255);
	
	
	Элементы.ВзаимодействиеSMSВыбратьНомерТелефона.Видимость = ?(НЕ НазваниеЭлемента = "Мессенджер", Истина, Ложь);
    Элементы.ГруппаВыбораВнешнейСистемыМессенджера.Видимость = ?(НазваниеЭлемента = "Мессенджер", Истина, Ложь);
	
	КнопкаПерейтиВЧат = Элементы.Найти("ГруппаКнопкиМессенджер");
	Если НЕ КнопкаПерейтиВЧат = Неопределено Тогда
		КнопкаПерейтиВЧат.Видимость = ?(НазваниеЭлемента = "Мессенджер", Истина, Ложь);		
	КонецЕсли;
	
КонецПроцедуры	


&НаКлиенте
// Процедура, обработчик переключателя типа отправляемого сообщения.
//
Процедура ПереключательТипаСообщения(Команда)

	Если ТекущийЭлемент.Имя = "КнопкаПереключательСМС" Тогда
		ТипСообщенияПользователю = ПредопределенноеЗначение("Перечисление.ТипыСобытий.SMS");	
	ИначеЕсли ТекущийЭлемент.Имя = "КнопкаПереключательPush" Тогда
		ТипСообщенияПользователю = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ПушУведомление");	
	ИначеЕсли ТекущийЭлемент.Имя = "КнопкаПереключательМессенджер" Тогда
		ТипСообщенияПользователю =  ПредопределенноеЗначение("Перечисление.ТипыСобытий.Мессенджер");	
	Иначе
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ТипСообщенияPushSMSМессенджер = ТипСообщенияПользователю;
	
	УстановитьАктивностьПереключателямSmsPushMessage();

	Если НЕ ТипСообщенияПользователю = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ПушУведомление") Тогда	
		ВзаимодействиеSMSОбновитьСтатусВведеныхСимволов();
	КонецЕсли;
		
	СоздатьSMSРассылкуНаКлиенте();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОтправкиВМессенджер()
	
	// ВнешниеСистемы = Справочники.ВнешниеСистемы.Мессенджер_ПолучитьВнешниеСистемыМессенджераChatApi(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	//
	// Если ЗначениеЗаполнено(ВнешниеСистемы) Тогда
	//	
	//	Элементы.ВнешниеСистемыМессенджера.СписокВыбора.Очистить();

	//	Для Каждого СтрокаТЧ Из ВнешниеСистемы Цикл
	//		Элементы.ВнешниеСистемыМессенджера.СписокВыбора.Добавить(СтрокаТЧ.Ссылка, Строка(СтрокаТЧ.Ссылка),, БиблиотекаКартинок.Whatsapp16);
	//	КонецЦикла;	
	//	СсылкаВнешняяСистема = ВнешниеСистемы[0].Ссылка;
	//	ЭтотОбъект.ВнешняяСистемаМессенджера = СсылкаВнешняяСистема;
	//	
	//	Элементы.КнопкаПереключательМессенджер.Доступность = Истина;
	//	
	// Иначе
	//	Элементы.КнопкаПереключательМессенджер.Доступность = Ложь;
	// КонецЕсли;		
	
КонецПроцедуры

&НаСервере
// Процедура, устананвливает видость мобильного приложения клиента если оно есть.
//
Процедура УстановитьВидимостьМобильногоПриложения()
	
	// ЭтотОбъект.ВнешняяСистемаWallet = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.Wallet);
	// ЭтотОбъект.ВнешняяСистемаМП = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.МобильноеПриложениеКлиента);
	// ЭтотОбъект.НомерТелефонаМП  = РегистрыСведений.КлючиВнешнихСистем.ПолучитьНомерТелефонаКлиента(Контрагент, ВнешняяСистемаМП);
	//
	// Если ЗначениеЗаполнено(ЭтотОбъект.НомерТелефонаМП) Тогда
	//	
	//	ЭтотОбъект.НомерТелефонаМП = УправлениеКонтактнойИнформациейКлиентСерверСалон.ВернутьТелефонТолькоЦифрами(ЭтотОбъект.НомерТелефонаМП);
	//	Префикс       = "+" + Сред(ЭтотОбъект.НомерТелефонаМП, 0, 1);
	//	КодТелефона   = Сред(ЭтотОбъект.НомерТелефонаМП, 2, 3);
	//	НомерТелефона = Сред(ЭтотОбъект.НомерТелефонаМП, 5);
	//	ЭтотОбъект.НомерТелефонаМП = Префикс + " (" + КодТелефона + ") " + НомерТелефона; 
	//	
	// ИначеЕсли Не (ЗначениеЗаполнено(ЭтотОбъект.ВнешняяСистемаWallet) И Справочники.Карты.КлиентУчаствуетВРассылкеWallet(Контрагент)) Тогда
	
		Элементы.КнопкаПереключательPush.Доступность = Ложь;
		
	// КонецЕсли;		
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
// Процедура - Взаимодействие Письмо, выбрать адрес ЭП.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура ВзаимодействиеПисьмоВыбратьАдресЭП(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВзаимодействиеПисьмоВыбратьАдресЭПЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеПисьмоСписокАдресовЭП);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие Письмо, выбрать адрес ЭП завершение.
//
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
//
Процедура ВзаимодействиеПисьмоВыбратьАдресЭПЗавершение(Результат, ДопПараметры) Экспорт
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ВзаимодействиеПисьмоТекст;
	
	Если Результат <> Неопределено  Тогда
		
		ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП = Результат;
		
		Элементы.ВзаимодействиеПисьмоВыбратьАдресЭП.Заголовок = Результат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие письмо выбрать шаблон
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеПисьмоВыбратьШаблон(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВзаимодействиеПисьмоВыбратьШаблонЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеПисьмоСписокШаблонов);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие ПИСЬМО выбрать шаблон текста завершение.
//
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
//
Процедура ВзаимодействиеПисьмоВыбратьШаблонЗавершение(Результат, ДопПараметры) Экспорт
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ВзаимодействиеПисьмоТекст;
	
	Если Результат <> Неопределено  Тогда		
		ЭтотОбъект.ВзаимодействиеПисьмоТекст = Результат.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие письмо отправить сервер.
//
Процедура ВзаимодействиеПисьмоОтправитьСервер()
		
	ОписаниеОшибки = "";
	
	ДокументСоздан = СоздатьДокументИсходящееПисьмоОтправитьПисьмоНаСервере(
		Объект.Ссылка, 
		ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП,
		ЭтотОбъект.ВзаимодействиеПисьмоТема,
		ЭтотОбъект.ВзаимодействиеПисьмоТекст,
		ОписаниеОшибки
	);
	
	Если ДокументСоздан = Ложь Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	// ОбновитьИсториюВзаимодействияСКлиентом(Элементы.КнопкаПодробно.Пометка);
	СформироватьИсториюВзаимодействияСКлиентом();
	
	ЭтотОбъект.ВзаимодействиеПисьмоТема    = "";
	ЭтотОбъект.ВзаимодействиеПисьмоТекст   = "";
	ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП = "";
	
	СнятьВидимостьВсплывающихГруппСервер("Письмо");
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Создать документ исходящее письмо отправить письмо на сервере.
//
// Параметры:
//  МассивСтруктурПолучателей	 - 	 -
//  Содержание					 - 	 -
//  Тема						 - 	 -
//  ОписаниеОшибки				 - 	 -
//
// Возвращаемое значение:
//   -
//
Функция СоздатьДокументИсходящееПисьмоОтправитьПисьмоНаСервере(Контакт, Адрес, Тема, Содержание, ОписаниеОшибки)
	
	МассивСтруктурПолучателей = Новый Массив;
	МассивСтруктурПолучателей.Добавить(Новый Структура("Контакт, Адрес", Контакт, Адрес));
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Дата"             , ТекущаяДатаСеанса());
	ДанныеЗаполнения.Вставить("Тема"             , Тема);
	ДанныеЗаполнения.Вставить("Тело"             , Содержание);
	ДанныеЗаполнения.Вставить("МассивПолучателей", МассивСтруктурПолучателей);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИсходящееЭлектронноеПисьмо = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
	ИсходящееЭлектронноеПисьмо.Заполнить(ДанныеЗаполнения);
	
	Возврат Документы.ЭлектронноеПисьмоИсходящее.ВыполнитьОтправкуПисьма(ИсходящееЭлектронноеПисьмо, ОписаниеОшибки);
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Проверить наличие сервиса SMSРассылки.
//
// Возвращаемое значение:
//   -
//
Функция НаличиеСервисаSMSРассылки()
	
	Возврат Не Константы.СервисSMSРассылкиПоУмолчанию.Получить().Пустая();
	
КонецФункции

&НаСервере
// Заполнить список выбора взаимодействия.
//
Процедура ЗаполнитьСписокВыбораШаблоновSMSСообщений()
	
	// SMS
	ЭтотОбъект.ВзаимодействиеSMSСписокШаблонов.Очистить();
	
	МассивШаблонов = Справочники.ШаблоныСообщений.ПолучитьШаблоныСообщений(Перечисления.ТипыСобытий.SMS);
	
	Для Каждого Шаблон Из МассивШаблонов Цикл
		ЭтотОбъект.ВзаимодействиеSMSСписокШаблонов.Добавить(Шаблон.Содержание, Шаблон.Наименование);	
	КонецЦикла;
	
	// Мессенджер
	ЭтотОбъект.ВзаимодействиеМессенджерСписокШаблонов.Очистить();
	
	МассивШаблонов = Справочники.ШаблоныСообщений.ПолучитьШаблоныСообщений(Перечисления.ТипыСобытий.Мессенджер);
	
	Для Каждого Шаблон Из МассивШаблонов Цикл
		ЭтотОбъект.ВзаимодействиеМессенджерСписокШаблонов.Добавить(Шаблон.СодержаниеМессенджер, Шаблон.Наименование);	
	КонецЦикла;                                                           
	
	// Письмо
	ЭтотОбъект.ВзаимодействиеПисьмоСписокШаблонов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ШаблоныЭлектронныхПисем.Наименование КАК Наименование,
	|	ШаблоныЭлектронныхПисем.ТекстHTML КАК Содержание
	|ИЗ
	|	Справочник.ШаблоныЭлектронныхПисем КАК ШаблоныЭлектронныхПисем
	|ГДЕ
	|	НЕ ШаблоныЭлектронныхПисем.ПометкаУдаления";
	
	ТЗШаблонов = Запрос.Выполнить().Выгрузить();
	Для Каждого Шаблон Из ТЗШаблонов Цикл
		ЭтотОбъект.ВзаимодействиеПисьмоСписокШаблонов.Добавить(Шаблон.Содержание, Шаблон.Наименование);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMSВыбрать телефон
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеSMSВыбратьТелефон(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВзаимодействиеSMSВыбратьТелефонЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеSMSСписокНомеровТелефонов);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMSВыбрать телефон завершение.
//
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
//
Процедура ВзаимодействиеSMSВыбратьТелефонЗавершение(Результат, ДопПараметры) Экспорт
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ВзаимодействиеSMSТекст;
	
	Если Результат <> Неопределено  Тогда
		
		ЭтотОбъект.ВзаимодействиеSMSНомерТелефона = Результат;
		
		Элементы.ВзаимодействиеSMSВыбратьНомерТелефона.Заголовок = Результат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMSВыбрать шаблон
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеSMSВыбратьШаблон(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВзаимодействиеSMSВыбратьШаблонЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеSMSСписокШаблонов);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMS выбрать шаблон текста завершение.
//
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
//
Процедура ВзаимодействиеSMSВыбратьШаблонЗавершение(Результат, ДопПараметры) Экспорт
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ВзаимодействиеSMSТекст;
	
	Если Результат <> Неопределено  Тогда
		
		Содержание = "";
		Если ЗначениеЗаполнено(Результат.Значение) Тогда
			 Содержание = ПолучитьТекстСообщенияБезПараметров(Результат.Значение, Объект.Ссылка);
		КонецЕсли;
					
		ЭтотОбъект.ВзаимодействиеSMSТекст = Содержание;
		ВзаимодействиеSMSОбновитьСтатусВведеныхСимволов();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция, "Получить текст сообщения без парметров".
//
Функция ПолучитьТекстСообщенияБезПараметров(Текст, Получатель)
	
	Сообщение = Справочники.ШаблоныСообщений.ПреобразоватьСодержаниеСПараметрамиВТекст(Текст, ,Получатель, ,);
	Возврат Сообщение;
	
КонецФункции	

&НаКлиенте
// Процедура, обновляет колличество введенных символов.
//
Процедура ВзаимодействиеSMSОбновитьСтатусВведеныхСимволов()
	
	// Удаляем символы переноса строки.
	мТекст = НРег(ЭтотОбъект.ВзаимодействиеSMSТекст);
	
	// 1-sms это 160 символов, если больше 160 символов, тогда 1 sms = 153.
	РазмерностьСообщения = ?(СтрДлина(мТекст) > 160, 153, 160);
	КоличествоСМС = 0;

	СтрокаСимволов = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя@_$^~`№";
	
	Для а = 1 По СтрДлина(СтрокаСимволов) Цикл
		
		Если Найти(мТекст, Сред(СтрокаСимволов, а, 1)) > 0 Тогда
			
			// 1-sms это 70 символов, если больше 70 символов, тогда 1 sms = 67.
			РазмерностьСообщения = ?(СтрДлина(мТекст) > 70, 67, 70);
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	КоличествоСимволов = СтрДлина(мТекст);
	КоличествоСМС      = Цел(СтрДлина(мТекст) / РазмерностьСообщения) + ?(СтрДлина(мТекст) % РазмерностьСообщения > 0, 1, 0);
	
	ПредставлениеСимволов = СтрокаСЧислом(Нстр("ru = ';%1 символ;;%1 символа; %1 символов;%1 символа'; en = ';%1 character;;;;%1 characters'"),
							КоличествоСимволов,
							ВидЧисловогоЗначения.Количественное,
							НСтр("ru='L=ru'; en='L=en'")); 
	
	ЭтотОбъект.ВзаимодействиеSMSСтатусВведенныхСимволов = ?(КоличествоСимволов = 0, "0" + ПредставлениеСимволов, ПредставлениеСимволов) + ", " + КоличествоСМС + " sms";
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMSОтправить
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеSMSОтправить(Команда)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеSMSТекст) Тогда
					
		Если (ЭтотОбъект.ТипСообщенияPushSMSМессенджер <> ПредопределенноеЗначение("Перечисление.ТипыСобытий.Мессенджер")
				И ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеSMSНомерТелефона)) 
			ИЛИ (ЭтотОбъект.ТипСообщенияPushSMSМессенджер = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Мессенджер")
				И ЗначениеЗаполнено(ЭтотОбъект.ВнешняяСистемаМессенджера)) Тогда
			
			ВзаимодействиеSMSPushОтправитьСервер();	
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены параметры сообщения!");	
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены данные сообщения!");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMS Отправить сервер.
//
Процедура ВзаимодействиеSMSPushОтправитьСервер()
	
	ОписаниеОшибки = "";
	
	ДокументSMSPushРассылкаСоздан = СоздатьДокументSMSPushРассылкаИОтправитьНаСервере(
		Объект.Ссылка, 
		ЭтотОбъект.ВзаимодействиеSMSНомерТелефона, 
		ЭтотОбъект.ВзаимодействиеSMSТекст, 
		ОписаниеОшибки,
		ЭтотОбъект.ТипСообщенияPushSMSМессенджер,
		ЭтотОбъект.ВнешняяСистемаМессенджера,
		ЭтотОбъект.ВнешняяСистемаМП,
		ЭтотОбъект.ВнешняяСистемаWallet,	
		ТипЗнч(ЭтотОбъект.ВзаимодействиеSMSНомерТелефона) = Тип("Строка"),
		ЭтаФорма.УникальныйИдентификатор); 
	
	Если ДокументSMSPushРассылкаСоздан = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	СформироватьИсториюВзаимодействияСКлиентом();
	
	ЭтотОбъект.ВзаимодействиеSMSТекст         = "";
	ЭтотОбъект.ВзаимодействиеSMSНомерТелефона = "";
	
	СнятьВидимостьВсплывающихГруппСервер("SMS");	
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, создает документ  SMS/Push Рассылка и отправляет его.
//
Функция СоздатьДокументSMSPushРассылкаИОтправитьНаСервере(
		Получатель,
		НомерТелефона,
		Содержание,
		ОписаниеОшибки,
		ТипСобытия, 
		ВнешняяСистемаМессенджера, 
		ВНМП, 
		ВНWallet, 
		ПушНаНомерТелефона = Истина,
		УИДФормы)
	
	СтруктураПолучателя = Новый Структура("Получатель, Карта, НомерТелефона, СервисРассылки", Получатель);
	
	Если ПушНаНомерТелефона Тогда
		СтруктураПолучателя.НомерТелефона = НомерТелефона;	
	Иначе
		СтруктураПолучателя.Карта         = НомерТелефона;
	КонецЕсли;
	
	СтруктураПолучателя.СервисРассылки = ?(ПушНаНомерТелефона, ВНМП, ВНWallet);
	
	МассивСтруктурПолучателей = Новый_Массив(СтруктураПолучателя);
	
	Возврат Документы.РассылкаСообщений.СоздатьДокументSMSPushРассылкаИОтправить(
		МассивСтруктурПолучателей, 
		Содержание, 
		ОписаниеОшибки, 
		ТипСобытия, 
		ВнешняяСистемаМессенджера,
		ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница,
		УИДФормы);

КонецФункции

&НаКлиенте
// Процедура - Взаимодействие SMSТекст при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ВзаимодействиеSMSТекстПриИзменении(Элемент)
	
	ВзаимодействиеSMSОбновитьСтатусВведеныхСимволов();

КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие письмо настроить аккаунт
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеПисьмоНастроитьАккаунт(Команда)
	
	ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.ФормаОбъекта", Новый Структура("ПользовательУчетнойЗаписи", ОбщегоНазначенияСтоматология.ТекущийПользователь()), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие письмо настроить аккаунт завершение.
//
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
//
Процедура ВзаимодействиеПисьмоНастроитьАккаунтЗавершение(Результат)
	
	Если Результат <> Неопределено Тогда
		
		Элементы.ГруппаВзаимодействиеПисьмоНастроитьАккаунт.Видимость = Ложь;
		Элементы.ГруппаВзаимодействиеПисьмоОсновная.Видимость         = Истина;
		УстановитьВидимостьВсплывающихГрупп("Письмо");
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Добавить заметку
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура ДобавитьЗаметку(Команда)  
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВзаимодействиеПослеВопросаОЗаписиКлиента", ЭтотОбъект, Новый Структура("ВыполнитьДействие", "СоздатьЗаметку"));
		ПоказатьВопрос(Оповещение, НСтр("ru='Для добавления заметки необходимо произвести запись нового клиента. Записать?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		
		Обработчик = Новый ОписаниеОповещения("ЗавершитьДобавлениеЗаметки", ЭтотОбъект);
		
		ОткрытьФорму("РегистрСведений.Заметки.Форма.ФормаРедактированияЗаметки", Новый Структура("Контрагент", Объект.Ссылка),ЭтаФорма,,,,Обработчик,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ЗавершитьДобавлениеЗаметки(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЭтотОбъект.ВзаимодействиеЗаметкаТекст = Результат.ТекстЗаметки;		
		ВзаимодействиеЗаметкаДобавитьСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, редактирует заметку.
//
Процедура РедактироватьЗаметку(ЭлементHTML, ТекстЗаметки, СтрокаТЗ)	
	
	Обработчик = Новый ОписаниеОповещения("ЗавершитьРедактированиеЗаметки", ЭтотОбъект, Новый Структура("ЭлементHTML, СтрокаТЗ", ЭлементHTML, СтрокаТЗ));
	
	КлючЗаписи = ПолучитьКлючЗаписи(СтрокаТЗ.ИДЗаметки);
	
	ОткрытьФорму("РегистрСведений.Заметки.Форма.ФормаРедактированияЗаметки", Новый Структура("ТекстЗаметки, Заголовок, Контрагент, ВзаимодействиеСделка, Ключ", ТекстЗаметки, "Редактирование заметки", Объект.Ссылка, ЭтотОбъект.ВзаимодействиеСделка, КлючЗаписи),,,,, Обработчик, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить ключ записи.
//
// Параметры:
//  ЗаметкаИД	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКлючЗаписи(ЗаметкаИД)
		
	Выборка = РегистрыСведений.Заметки.Выбрать(,,Новый Структура ("ИД", Новый УникальныйИдентификатор(ЗаметкаИД)));
	Если Выборка.Следующий() Тогда
		
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("Объект"			, Выборка.Объект);
		СтруктураОтбора.Вставить("АктивностьЗаметки", Выборка.АктивностьЗаметки);
		СтруктураОтбора.Вставить("Автор"			, Выборка.Автор);
		СтруктураОтбора.Вставить("Период"			, Выборка.Период);
		СтруктураОтбора.Вставить("ИД"				, Выборка.ИД);
		
	КонецЕсли; 	
	
	МассивСтруктураЗаписи = Новый Массив;
	МассивСтруктураЗаписи.Добавить(СтруктураОтбора);
	
	Возврат Новый("РегистрСведенийКлючЗаписи.Заметки", МассивСтруктураЗаписи);

КонецФункции

&НаКлиенте
// Процедура, редактирует заметку.
//
Процедура РедактироватьЗаметкуЗвонок(ЭлементHTML, ИдЗвонка)
	
	Обработчик = Новый ОписаниеОповещения("ЗавершитьРедактированиеЗаметкиЗвонок", ЭтотОбъект, Новый Структура("ЭлементHTML, ИдЗвонка", ЭлементHTML, ИдЗвонка));
	
	СокращенныйТекстЗаметки = ЭлементHTML.innerHTML;
	
	СтрокаТЗ = ЭтотОбъект.ИсторияВзаимодействий.НайтиПоИдентификатору(ИдЗвонка);
	
	ТекстЗаметки = ПолучитьПолныйТекстЗаметкиЗвонка(СтрокаТЗ.Взаимодействие, Объект.Ссылка, СокращенныйТекстЗаметки);
	
	ОткрытьФорму("РегистрСведений.Заметки.Форма.ФормаРедактированияЗаметки", Новый Структура("ТекстЗаметки", ТекстЗаметки),,,,, Обработчик, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить ключ записи.
//
// Параметры:
//  ЗаметкаИД	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПолныйТекстЗаметкиЗвонка(IDЗвонка, Контрагент, ТекстЗаметки)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ИсторияВызовов.Заметка КАК Заметка
	|ИЗ
	|	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
	|ГДЕ
	|	ИсторияВызовов.Контрагент = &Контрагент
	|	И ИсторияВызовов.IDЗвонка = &IDЗвонка";
	
	Запрос.УстановитьПараметр("IDЗвонка"	, IDЗвонка);
	Запрос.УстановитьПараметр("Контрагент"	, Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда	
		Возврат Выборка.Заметка;	
	КонецЕсли;
	
	Возврат ТекстЗаметки;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ЗавершитьРедактированиеЗаметкиЗвонок(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ТекстЗаметки     = Результат.ТекстЗаметки; 	
		ЭлементHTML      = ДопПараметры.ЭлементHTML;	
		СтрокаТЗ         = ЭтотОбъект.ИсторияВзаимодействий.НайтиПоИдентификатору(ДопПараметры.ИдЗвонка);
		СтрокаТЗ.Заметка = ТекстЗаметки; 
		
		ЗавершитьРедактированиеЗаметкиЗвонокНаСервере(ТекстЗаметки, СтрокаТЗ.Взаимодействие);
		
		Если ЗначениеЗаполнено(ТекстЗаметки) Тогда
			ЭлементHTML.innerHTML = ?(СтрДлина(ТекстЗаметки) > 200, Лев(Результат.ТекстЗаметки, 200) + "...", ТекстЗаметки);
		Иначе
			ЭлементHTML.innerHTML = "...";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, обработчик оповещения.
//
Процедура ЗавершитьРедактированиеЗаметкиЗвонокНаСервере(ТекстЗаметки, ИдЗвонка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсторияВызовов.ОборудованиеТелефонии КАК ОборудованиеТелефонии,
	|	ИсторияВызовов.IDЗвонка КАК IDЗвонка,
	|	ИсторияВызовов.НаправлениеВызова КАК НаправлениеВызова,
	|	ИсторияВызовов.ИсходящийЗвонок КАК ИсходящийЗвонок,
	|	ИсторияВызовов.НомерТелефона КАК НомерТелефона,
	|	ИсторияВызовов.ПользовательSip КАК ПользовательSip,
	|	ИсторияВызовов.НачалоВызова КАК НачалоВызова,
	|	ИсторияВызовов.НачалоРазговора КАК НачалоРазговора,
	|	ИсторияВызовов.ОкончаниеЗвонка КАК ОкончаниеЗвонка,
	|	ИсторияВызовов.Статус КАК Статус,
	|	ИсторияВызовов.URLЗаписи КАК URLЗаписи,
	|	ИсторияВызовов.ФайлЗаписи КАК ФайлЗаписи,
	|	ИсторияВызовов.ПринятДругимАбонентомГруппы КАК ПринятДругимАбонентомГруппы,
	|	ИсторияВызовов.Заявка КАК Заявка,
	|	ИсторияВызовов.НеОбработан КАК НеОбработан,
	|	ИсторияВызовов.ИдентификаторОбрабатывающего КАК ИдентификаторОбрабатывающего,
	|	ИсторияВызовов.ИсточникЗвонка КАК ИсточникЗвонка,
	|	ИсторияВызовов.Пользователь КАК Пользователь,
	|	ИсторияВызовов.Контрагент КАК Контрагент,
	|	ИсторияВызовов.ПопытокПолученияФайлаЗаписи КАК ПопытокПолученияФайлаЗаписи,
	|	ИсторияВызовов.Заметка КАК Заметка
	|ИЗ
	|	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
	|ГДЕ
	|	ИсторияВызовов.IDЗвонка = &IDЗвонка");
	
	Запрос.УстановитьПараметр("IDЗвонка", ИдЗвонка); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		МенеджерЗаписи = РегистрыСведений.ИсторияВызовов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);	
		МенеджерЗаписи.Заметка = ТекстЗаметки;
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, редактирует заметку.
//
Процедура РедактироватьПрофосмотр(ДанныеСсылкиHTML)
	
	Обработчик = Новый ОписаниеОповещения("ЗавершитьРедактированиеПрофосмотра", ЭтотОбъект, Новый Структура("ДанныеСсылкиHTML", ДанныеСсылкиHTML));
	
	СтрокаТЗ 				= ЭтотОбъект.ИсторияВзаимодействий.НайтиПоИдентификатору(ДанныеСсылкиHTML.id);
	КлючЗаписиПрофосмотра 	= ПолучитьПараметрыОткрытияФормыПрофосмотр(СтрокаТЗ);
	
	ОткрытьФорму("РегистрСведений.Профосмотры.Форма.ФормаРедактированияЗаписиПлана", Новый Структура("Ключ", КлючЗаписиПрофосмотра),,,,,Обработчик, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	                                	
КонецПроцедуры  

&НаКлиенте  
// Функция - Получить параметры открытия формы профосмотр
//
// Параметры:
//  СтрокаТЗ - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПараметрыОткрытияФормыПрофосмотр(СтрокаТЗ)
		
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("СтруктурнаяЕдиница"	, СтрокаТЗ.СтруктурнаяЕдиница);
	СтруктураОтбора.Вставить("Сотрудник"			, СтрокаТЗ.Сотрудник);
	СтруктураОтбора.Вставить("ВидОсмотра"			, СтрокаТЗ.ВидОсмотра);
	СтруктураОтбора.Вставить("Контрагент"			, Объект.Ссылка);
	СтруктураОтбора.Вставить("Период"				, СтрокаТЗ.Начало);
	
	МассивСтруктураЗаписи = Новый Массив;
	МассивСтруктураЗаписи.Добавить(СтруктураОтбора);

	Возврат Новый("РегистрСведенийКлючЗаписи.Профосмотры", МассивСтруктураЗаписи);
	
КонецФункции

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ЗавершитьРедактированиеЗаметки(Результат, Параметры) Экспорт 	
	
	Если Результат <> Неопределено Тогда
		
		ЭлементHTML = Параметры.ЭлементHTML;
		СтрокаТЗ = Параметры.СтрокаТЗ;
		СтрокаТЗ.Заметка = Результат.ТекстЗаметки;  // обновляем данные в таблице
		//СтрокаТЗ.Сделка  = Результат.Сделка;
		ЗавершитьРедактированиеЗаметкиНаСервере(Результат.ТекстЗаметки, СтрокаТЗ.ИДЗаметки, СтрокаТЗ.Сделка); // обновляем данные в регистре
		
		Если ЗначениеЗаполнено(Результат.ТекстЗаметки) Тогда
			ЭлементHTML.innerHTML = ?(СтрДлина(Результат.ТекстЗаметки) > 200, Лев(Результат.ТекстЗаметки, 200) + "...", Результат.ТекстЗаметки);
		Иначе
			ЭлементHTML.innerHTML = "...";
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
// Процедура, обработчик оповещения.
//
Процедура ЗавершитьРедактированиеЗаметкиНаСервере(ТекстЗаметки, ИдЗаметки, Сделка)
		
	Выборка = РегистрыСведений.Заметки.Выбрать(,,Новый Структура ("ИД", Новый УникальныйИдентификатор(ИдЗаметки)));	
	Пока Выборка.Следующий() Цикл
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("Объект"			, Выборка.Объект);
		СтруктураОтбора.Вставить("АктивностьЗаметки", Выборка.АктивностьЗаметки);
		СтруктураОтбора.Вставить("Автор"			, Выборка.Автор);
		СтруктураОтбора.Вставить("Период"			, Выборка.Период);
		СтруктураОтбора.Вставить("Заметка"			, ТекстЗаметки);
		СтруктураОтбора.Вставить("Сделка"			, Сделка);
		СтруктураОтбора.Вставить("ИД"				, Выборка.ИД);
		СтруктураОтбора.Вставить("Закреплена"		, Выборка.Закреплена);
	КонецЦикла;
	
	ОбъектРегистрСведенийЗаметка = РегистрыСведений.Заметки.СоздатьНаборЗаписей();
	ОбъектРегистрСведенийЗаметка.ОбменДанными.Загрузка = Истина; 
	ОбъектРегистрСведенийЗаметка.Отбор.ИД.Установить(СтруктураОтбора.ИД);
	ЗаполнитьЗначенияСвойств(ОбъектРегистрСведенийЗаметка.Добавить(), СтруктураОтбора);
	ОбъектРегистрСведенийЗаметка.Записать(Истина);
	
КонецПроцедуры 

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ЗавершитьРедактированиеПрофосмотра(Результат, ДопПараметры) Экспорт 	
	
	Если Результат <> Неопределено Тогда
		// Фильтры = Новый Структура();	
		СформироватьИсториюВзаимодействияСКлиентом();	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик оповещения.
//
Процедура ВзаимодействиеЗаметкаДобавитьСервер()
	
	СоздатьЗаметкуНаСервере(ЭтотОбъект.ВзаимодействиеЗаметкаТекст, Объект.Ссылка);
	// Фильтры = Новый Структура();
	СформироватьИсториюВзаимодействияСКлиентом();  
	ЭтотОбъект.ВзаимодействиеЗаметкаТекст = "";	
	
КонецПроцедуры

&НаСервере
// Процедура, добавляет заметку на сервере.
//
Процедура СоздатьЗаметкуНаСервере(ТекстЗаметки, Контрагент)
		
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("Объект"			, Контрагент);
	СтруктураОтбора.Вставить("АктивностьЗаметки", Истина);
	СтруктураОтбора.Вставить("Автор"			, ПараметрыСеанса.ТекущийПользователь);
	СтруктураОтбора.Вставить("Период"			, ТекущаяДатаСеанса());
	СтруктураОтбора.Вставить("Заметка"			, ТекстЗаметки);	
	СтруктураОтбора.Вставить("ИД"				, Новый УникальныйИдентификатор);
	
	ОбъектРегистрСведенийЗаметка = РегистрыСведений.Заметки.СоздатьНаборЗаписей();
	ОбъектРегистрСведенийЗаметка.ОбменДанными.Загрузка = Истина;
	ОбъектРегистрСведенийЗаметка.Отбор.ИД.Установить(СтруктураОтбора.ИД);
	
	ЗаполнитьЗначенияСвойств(ОбъектРегистрСведенийЗаметка.Добавить(), СтруктураОтбора);	
	ОбъектРегистрСведенийЗаметка.Записать(Истина);
	
КонецПроцедуры

//////////////////////////////////// Сформировать список выбора задачи взаимодействия.//////////////////////////////
///////////////////////////////////                                                  //////////////////////////////

&НаСервере
// Заполнить список выбора взаимодействия.
//
Процедура ЗаполнитьСписокВыбораВзаимодействияЗадача()
	
	ЭтотОбъект.ВзаимодействиеСписокВыбора.Очистить();	
	ЭтотОбъект.ВзаимодействиеСписокВыбора = Справочники.ВидыВзаимодействий.ПолучитьСписокВзаимодействий("Пациент");
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор взаимодействия завершение
//
Процедура ВыборВзаимодействиеЗадачаЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда 
		
		Если Объект.Ссылка.Пустая() Тогда
			
			Оповещение = Новый ОписаниеОповещения("ВзаимодействиеПослеВопросаОЗаписиКлиента", ЭтотОбъект, Новый Структура("ВыполнитьДействие", "ВыборВзаимодействия"));
			ПоказатьВопрос(Оповещение, НСтр("ru='Для создания взаимодействия необходимо произвести запись нового пациента. Записать?';en='For create interactions is necessary toproduce record new client. WriteDown?'"), РежимДиалогаВопрос.ДаНет);
		Иначе
			
			ЭтотОбъект.ВзаимодействиеПараметры = Новый Структура;
			ЭтотОбъект.ВзаимодействиеПараметры.Вставить("Взаимодействие"   , Результат.Значение.Взаимодействие);
			ЭтотОбъект.ВзаимодействиеПараметры.Вставить("ВидВзаимодействия", Результат.Значение.ВидВзаимодействия);
			ЭтотОбъект.ВзаимодействиеПараметры.Вставить("ТемаПоУмолчанию"  , Результат.Значение.ТемаПоУмолчанию);
			ЭтотОбъект.ВзаимодействиеПараметры.Вставить("Представление"    , Результат.Представление);
			ЭтотОбъект.ВзаимодействиеПараметры.Вставить("Картинка"         , Результат.Картинка);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыборВзаимодействиеЗадачаЗавершение2", ЭтаФорма);
			
			Предмет = Новый Структура("Контрагент, ВидВзаимодействия", Объект.Ссылка, Результат.Значение.ВидВзаимодействия);			 	
			                           ОткрытьФорму("Задача.Взаимодействие.Форма.ФормаЗадачиБыстрая", 
			                           Новый Структура("ЗначенияЗаполнения, ВзаимодействиеСделка, ВзаимодействиеЗадачаПараметры", 
			                           Предмет, ЭтотОбъект.ВзаимодействиеСделка, ЭтотОбъект.ВзаимодействиеПараметры),,,,,ОписаниеОповещения,
			                           РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте 
// Процедура, обработчик события "ВыборВзаимодействиеЗадачаЗавершение2".
//
Процедура ВыборВзаимодействиеЗадачаЗавершение2(Результат, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
	    ОбновитьИсториюВзаимодействияВыборочно("Задача", Результат);
	КонецЕсли;

КонецПроцедуры 

&НаСервере 
// Процедура - Обновить историю взаимодействия выборочно
//
Процедура ОбновитьИсториюВзаимодействияВыборочно(ТипСобытия, Взаимодействие = "", ВзаимодействиеИд = "", Тип = "")
	
	УстановитьПривилегированныйРежим(Истина);

	Если ЗначениеЗаполнено(ВзаимодействиеИд) Тогда
		НайденныеСтроки = ИсторияВзаимодействий.НайтиСтроки(Новый Структура("ВзаимодействиеИд", ВзаимодействиеИд));
		Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
			ИсторияВзаимодействий.Удалить(СтрокаТЧ);
		КонецЦикла;
		СтрокаИстории = ИсторияВзаимодействий.Добавить();
		
	Иначе
		НайденныеСтроки = ИсторияВзаимодействий.НайтиСтроки(Новый Структура("Взаимодействие", Взаимодействие));
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаИстории = ИсторияВзаимодействий.Добавить();
		Иначе
			СтрокаИстории = НайденныеСтроки[0];
		КонецЕсли;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Если ТипСобытия = "Задача" Тогда 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаВзаимодействие.Ссылка КАК Взаимодействие,
		|	ВЫБОР
		|		КОГДА ЗадачаВзаимодействие.Выполнена
		|			ТОГДА ЗадачаВзаимодействие.ДатаИсполнения
		|		ИНАЧЕ ЗадачаВзаимодействие.ЗадачаНазначеннаяДата
		|	КОНЕЦ КАК Дата,
		|	""Задача"" КАК ТипСобытия,
		|	ВЫБОР
		|		КОГДА ЗадачаВзаимодействие.Выполнена
		|			ТОГДА ""История""
		|		ИНАЧЕ ""Запланировано""
		|	КОНЕЦ КАК ТипВзаимодействия,
		|	ВЫБОР
		|		КОГДА ЗадачаВзаимодействие.Выполнена
		|			ТОГДА ЗадачаВзаимодействие.ИсполнительФактический
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗадачаВзаимодействие.Исполнитель ССЫЛКА Справочник.Сотрудники
		|					ТОГДА ЗадачаВзаимодействие.Исполнитель
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|			КОНЕЦ
		|	КОНЕЦ КАК Автор,
		|	ВЫБОР
		|		КОГДА ЗадачаВзаимодействие.Выполнена
		|			ТОГДА ЗадачаВзаимодействие.ИсполнительФактический.НаименованиеСокращенное
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗадачаВзаимодействие.Исполнитель ССЫЛКА Справочник.Сотрудники
		|					ТОГДА ЗадачаВзаимодействие.Исполнитель.НаименованиеСокращенное
		|				ИНАЧЕ ЗадачаВзаимодействие.Исполнитель.Наименование
		|			КОНЕЦ
		|	КОНЕЦ КАК АвторПредставление,
		|	ВЫБОР
		|		КОГДА ЗадачаВзаимодействие.Исполнитель = ЗадачаВзаимодействие.ЗадачаАвтор
		|				ИЛИ ЗадачаВзаимодействие.ЗадачаАвтор.Служебный
		|			ТОГДА NULL
		|		ИНАЧЕ ЗадачаВзаимодействие.ЗадачаАвтор.НаименованиеСокращенное
		|	КОНЕЦ КАК АвторВзаимодействияПредставление,
		|	""Взаимодействие"" КАК ТипЗадачи,
		|	ЗадачаВзаимодействие.ВидВзаимодействияСправочник.ИндексКартинки КАК ИндексКартинкиВзаимодействия,
		|	ВЫБОР
		|		КОГДА ЗадачаВзаимодействие.Сделка = ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
		|		ИНАЧЕ ЗадачаВзаимодействие.Сделка
		|	КОНЕЦ КАК Сделка
		|ИЗ
		|	Задача.Взаимодействие КАК ЗадачаВзаимодействие
		|ГДЕ
		|	ЗадачаВзаимодействие.Ссылка = &Ссылка
		|	И (ЗадачаВзаимодействие.Контрагент = &Контрагент
		|			ИЛИ ЗадачаВзаимодействие.ЗадачаПредмет = &Контрагент)";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);  	

	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Ссылка", Взаимодействие);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтрокаИстории, Выборка); 
	КонецЦикла;
	ИсторияВзаимодействий.Сортировать("ТипВзаимодействия, Дата Убыв");
	Фильтры = ПолучитьФильтры();
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Контрагент"              , Объект.Ссылка);
	ПараметрыПроцедуры.Вставить("СтатусКлиента"           , ЭтотОбъект.СтатусКлиента);
	ПараметрыПроцедуры.Вставить("ДатаРожденияКлиента"     , Объект.ДатаРожденияКлиента);
	ПараметрыПроцедуры.Вставить("РежимПодробно"           , Элементы.КнопкаПодробно.Пометка);
	ПараметрыПроцедуры.Вставить("ВыводитьВсе"             , ВыводитьВсеВзаимодействия);
	ПараметрыПроцедуры.Вставить("Фильтры"                 , Фильтры);

	ТекстHTML = УправлениеИнтерфейсамиСервер.СформироватьИсториюВзаимодействий(ЭтаФорма, ПараметрыПроцедуры, 
		ПараметрыПроцедуры.РежимПодробно, ПараметрыПроцедуры.ВыводитьВсе); 
	ЭтотОбъект.ИсторияВзаимодействия = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(ТекстHTML);

КонецПроцедуры  

&НаСервере  
// Функция, Получить Фильтры.
//
Функция ПолучитьФильтры()
	
	Фильтры = Новый Структура();
	Фильтры.Вставить("Взаимодействие", ПолучитьЗначениеФильтра("Взаимодействие")); 	
	Фильтры.Вставить("Заметка"       , ПолучитьЗначениеФильтра("Заметка")); 
	Фильтры.Вставить("ПробныйПакет"	 , ПолучитьЗначениеФильтра("ПробныйПакет"));
	Фильтры.Вставить("Занятие"     	 , ПолучитьЗначениеФильтра("Занятие"));
	Фильтры.Вставить("Сообщение"     , ПолучитьЗначениеФильтра("Сообщение"));
	
	Если ВсеФильтрыОтключены(Фильтры) Тогда
		Фильтры = Новый Структура();
	КонецЕсли;
	
	Возврат Фильтры;
	
КонецФункции

&НаКлиенте
// Процедура, добавляет заметку.
//
Процедура СозадтьЗаметкуНаКлиенте()
	
	ПереместитьЭлементСделкиВзаимодействия("ГруппаВзаимодействиеЗаметкаШапка");
	
	УстановитьВидимостьВсплывающихГрупп("Заметка");
	
КонецПроцедуры

&НаСервере
// Процедура - Выбор взаимодействия на клиенте
//
Процедура ВыборВзаимодействиеЗадачаНаСервере()
	
	Элементы.ДекорацияВзаимодействиеЗадачаИконка.Картинка     = ЭтотОбъект.ВзаимодействиеПараметры.Картинка;
	Элементы.ДекорацияВзаимодействиеЗадачаИконка.Видимость    = ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеПараметры.Картинка);
	Элементы.ДекорацияВзаимодействиеЗадачаЗаголовок.Заголовок = ЭтотОбъект.ВзаимодействиеПараметры.Представление;
	
	УстановитьВидимостьВсплывающихГруппСервер("ВзаимодействиеЗадача");
	
	ЭтотОбъект.ВзаимодействиеЗадачаТема  = ?(ЗначениеЗаполнено(ВзаимодействиеЗадачаТема) , ВзаимодействиеЗадачаТема	, ЭтотОбъект.ВзаимодействиеПараметры.ТемаПоУмолчанию);
	ЭтотОбъект.ВзаимодействиеЗадачаТекст = ?(ЗначениеЗаполнено(ВзаимодействиеЗадачаТекст), ВзаимодействиеЗадачаТекст, "");
	 
	// Установить дату взаимодействия.
	ЭтотОбъект.ВзаимодействиеЗадачаДата = ПолучитьОкругленноеВремяВзаимодействия(ЭтотОбъект.ВзаимодействиеЗадачаВыполнена);	
	ВзаимодействиеЗадачаДатаПриИзмененииНаСервере();
	
	// Обновить исполнителя взаимодействия.
	ЭтотОбъект.ВзаимодействиеЗадачаИсполнитель         = Объект.Куратор;	
	Элементы.ВзаимодействиеЗадачаИсполнитель.Заголовок = ПолучитьПредставлениеФИОСотрудника(Объект.Куратор);
		
	// Обновить режим напоминания взаимодействия.
	РежимНапоминанияПоУмолчанию = ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора[0];		
	
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания    = РежимНапоминанияПоУмолчанию.Значение;
	Элементы.ВзаимодействиеЗадачаНапоминание.Заголовок = РежимНапоминанияПоУмолчанию.Представление;
	
	ПереместитьЭлементСделкиВзаимодействия("ГруппаВзаимодействиеЗадачаШапка");
	
	АктивныйЭлемент   = ?(ЭтотОбъект.ВзаимодействиеЗадачаВыполнена, Элементы.ГруппаВзаимодействиеЗадачаСтатусВыполнена, Элементы.ГруппаВзаимодействиеЗадачаСтатусНеВыполнена);
	НеактивныйЭлемент = ?(Не ЭтотОбъект.ВзаимодействиеЗадачаВыполнена, Элементы.ГруппаВзаимодействиеЗадачаСтатусВыполнена, Элементы.ГруппаВзаимодействиеЗадачаСтатусНеВыполнена);
	УправлениеИнтерфейсамиСервер.ИзменитьАктивностьПереключателяФормы(АктивныйЭлемент, НеактивныйЭлемент, ЭтотОбъект.ВзаимодействиеЗадачаВыполнена);
	
КонецПроцедуры	

&НаСервереБезКонтекста
// Функция - Получить округленное время взаимодействия
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьОкругленноеВремяВзаимодействия(ПолучитьТекДату = Ложь)
		
	ДатаВремя = ТекущаяДатаСеанса() + ?(ПолучитьТекДату, 0, 86400);
	
	КоличествоИнтервалов      = (ДатаВремя - НачалоДня(ДатаВремя)) / 1800;
	КоличествоЦелыхИнтервалов = Цел(КоличествоИнтервалов);
	
	// Округлить в большую сторону.
	Если ПолучитьТекДату = Ложь
		И КоличествоИнтервалов <> КоличествоЦелыхИнтервалов Тогда
		
		Возврат НачалоДня(ДатаВремя) + (КоличествоЦелыхИнтервалов + 1) * 1800;
	Иначе
		Возврат НачалоДня(ДатаВремя) + КоличествоЦелыхИнтервалов * 1800;
	КонецЕсли;
	
КонецФункции

&НаСервере
// Процедура - Заполнить списки выбора времени окончания работы.
//
// Параметры:
//  ВремяНачала	 - 	 -
//  ЭлементФормы - 	 -
//
Процедура ЗаполнитьСписокВыбораВремениЭлемента(ИмяЭлементаФормы, Знач ДатаНачала)
	
	ЭлементФормы = Элементы[ИмяЭлементаФормы];
	
	ПериодРаботы = Новый Структура;
	ПериодРаботы.Вставить("ДатаНачала"   , НачалоДня(ДатаНачала));
	ПериодРаботы.Вставить("ДатаОкончания", ДатаНачала + 86400);
	
	МассивПериодов = Новый Массив;
	МассивПериодов.Добавить(ПериодРаботы);
	
	СписокВремени = РаботаСДиалогами.ВернутьСписокВремениДляНачалаРаботыСервер(МассивПериодов, Ложь, 30);
	
	ЭлементФормы.СписокВыбора.Очистить();
	
	Для Каждого Элемент Из СписокВремени Цикл
		
		Представление = ?(Минута(Элемент.Значение) = 0, Элемент.Представление, Новый ФорматированнаяСтрока(Элемент.Представление,, Новый Цвет(100, 100, 100)));
		ЭлементФормы.СписокВыбора.Добавить(Элемент.Значение, Представление);
		
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Вернуть список сделок контрагента.
// 
Функция ВернутьСписокСделокКлиента(Контрагент)
		
	СписокСделок = Новый СписокЗначений;
	
	ТаблицаСделок = ПолучитьСделкиКлиента(Контрагент, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	Для Каждого СтрокаТ Из ТаблицаСделок Цикл
				
		ПараметрыСделки = Новый Структура;
		ПараметрыСделки.Вставить("Сделка"   , СтрокаТ.Ссылка);
		ПараметрыСделки.Вставить("ЦветЭтапа", СтрокаТ.ЦветЭтапа);
		
		СписокСделок.Добавить(ПараметрыСделки, СтрокаТ.Наименование);	
		
	КонецЦикла;	
		
	Возврат СписокСделок; 
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает сделки по контрагенту.
//
Функция ПолучитьСделкиКлиента(Контрагент, СтруктурнаяЕдиница = Неопределено)
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сделки.Ссылка КАК Ссылка,
	|	Сделки.Наименование КАК Наименование,
	|	Сделки.ЭтапСделки КАК ЭтапСделки,
	|	Сделки.ЭтапСделки.ЦветЭтапа КАК ЦветЭтапа
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	НЕ Сделки.ПометкаУдаления
	|	И Сделки.Контрагент = &Контрагент
	|	И &УсловиеСтруктурнаяЕдиница
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделки.ДатаСделки");
	
	Запрос.УстановитьПараметр("Контрагент", 		Контрагент);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	УсловиеСтруктурнаяЕдиница = ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), "И Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "");
	Запрос.Текст              = СтрЗаменить(Запрос.Текст, "И &УсловиеСтруктурнаяЕдиница", УсловиеСтруктурнаяЕдиница);	
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить представление ФИОСотрудника.
//
Функция ПолучитьПредставлениеФИОСотрудника(Сотрудник)
	
	Возврат Справочники.Сотрудники.ПредставлениеФИОСотрудника(Сотрудник);		
	
КонецФункции

&НаСервере
// Процедура - Переместить элемент сделки.
//
// Параметры:
//  ИмяРодителя	 - 	 - 
//
Процедура ПереместитьЭлементСделкиВзаимодействия(ИмяРодителя)
		
	Элементы.Переместить(Элементы.ГруппаВаимодействиеСделкаПеремещаемая, Элементы[ИмяРодителя]);
		
КонецПроцедуры

&НаСервере
// Процедура - Установить видимость всплывающих групп на сервере.
//
// Параметры:
//  ИмяВзаимодействия	 - 	 - 
//  Видимость			 - 	 - 
//
Процедура УстановитьВидимостьВсплывающихГруппСервер(ИмяЭлемента, ИндексЭлемента = Неопределено)
	
	УправлениеИнтерфейсамиСервер.УстановитьВидимостьВсплывающихГрупп(ЭтаФорма, ИмяЭлемента, ИндексЭлемента);
	
КонецПроцедуры

#Область ВиджетСделки

&НаСервере
// Процедура, ОбновитьВиджетСделки.
//
Процедура ОбновитьВиджетСделки()
	
	УправлениеИнтерфейсамиСервер.ОбновитьВиджетСделки(ЭтаФорма, Объект.Ссылка);		
	
КонецПроцедуры

&НаКлиенте
// Процедура, ОбработчикНажатиДинамическогоЭлементаВиджета.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Процедура ОбработчикНажатиДинамическогоЭлементаВиджета(Команда) Экспорт
	
	Если ЭтаФорма.Модифицированность Тогда
		
		Оповещение = Новый ОписаниеОповещения("ОбработчикНажатияДинамическогоЭлементаВиджетаЗавершение", ЭтотОбъект, Новый Структура("ИмяКоманды", Команда.Имя));
		ПоказатьВопрос(Оповещение, НСтр("ru='Клиент изменен. Сохранить изменения?';en='Client changed. Save changes?'"), РежимДиалогаВопрос.ДаНет);
		
	Иначе
		ВыполнитьНажатиеНаВиджетСделки(Команда.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет нажатие на виджет сделки после вопроса о записи.
//  
//  Описание:
//  
//  
//  Параметры (название, тип, дифференцированное значение)
//
// Параметры:
//  Результат	 - КодВозвратаДиалога	 -  да/нет.
//  ДопПараметры - Структура			 -  содержит доп. параметры.
//
Процедура ОбработчикНажатияДинамическогоЭлементаВиджетаЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да
		И ТипЗнч(ДопПараметры) = Тип("Структура")
		И ДопПараметры.Свойство("ИмяКоманды") Тогда
		
		ЭтаФорма.Записать();
		ВыполнитьНажатиеНаВиджетСделки(ДопПараметры.ИмяКоманды);

	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
// Процедура, обработка нажатия на виджет сделки.
//  
//  Описание: обрабаытвает нажатие на элемент формы, виджет сделки.
//  
//  
//  Параметры (название, тип, дифференцированное значение)
//
// Параметры:
//  ИмяКоманды	 - строка - имя выполненной команды.
//
Процедура ВыполнитьНажатиеНаВиджетСделки(ИмяКоманды)
	
	Если СтрНайти(ИмяКоманды, "КомандаОткрытьПродажу") Тогда 
		
		ИндексСтроки = ПолучитьИндексСтроки(ИмяКоманды);
		Прием		 = ЭтаФорма.ТаблицаСделок[ИндексСтроки].Прием;
		
		Если ЗначениеЗаполнено(Прием) Тогда
			ПоказатьЗначение(,Прием);
		КонецЕсли;
		
	ИначеЕсли СтрНайти(ИмяКоманды, "КомандаСоздатьСделку") Тогда
		
		МассивВидовСделок = ПолучитьВидыСделок(Объект.Ссылка, ЭтотОбъект.СтатусКлиента);
		
		СписокВыбора 	  = Новый СписокЗначений();		
		СписокВыбора.ЗагрузитьЗначения(МассивВидовСделок);
		
		Для Каждого ЭлементСписка Из СписокВыбора Цикл		
			ЭлементСписка.Представление = ЭлементСписка.Значение; 			
		КонецЦикла;
		
		Оповещение = Новый ОписаниеОповещения("СоздатьСделкуИзСписка", ЭтотОбъект);		
		ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Элементы.КнопкаСоздатьСделку);

	Иначе
		
		Если СтрНайти(ИмяКоманды, "КомандаСделка") Тогда
			
			ИндексГурппы  = ПолучитьИндексСтроки(ИмяКоманды, Ложь);
			ИмяГруппыРодителя = Элементы["ГруппаТелоВиджета_" + ИндексГурппы].Родитель.Имя;
			СтрокаТаблицы = ЭтаФорма.ТаблицаСделок[ИндексГурппы];
			// Если НЕ ИмяГруппыРодителя = "ВиджетСделки" Тогда
				ПоказатьЗначение(,СтрокаТаблицы.Сделка);
				Возврат;
			// КонецЕсли;

		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Контрагент"	, Объект.Ссылка);
		ПараметрыФормы.Вставить("ВыбратьЭтап"	, СтрНайти(ИмяКоманды, "КомандаТекущийЭтап") > 0);
		// ПараметрыФормы.Вставить("Врач"			, Объект.Куратор);
		
		ИндексГурппы  = ПолучитьИндексСтроки(ИмяКоманды, Ложь);
		СтрокаТаблицы = ЭтаФорма.ТаблицаСделок[ИндексГурппы];
		ПараметрыФормы.Вставить("Сделка", СтрокаТаблицы.Сделка);
		
		ОткрытьФорму("Справочник.Сделки.Форма.ФормаВиджета", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик динамической команды "Подключаемый_ОткрытьСделку".
//
Процедура Подключаемый_ОткрытьСделку(Команда)
	
	ИндексГруппы  = ПолучитьИндексСтроки(Команда.Имя, Ложь);
	СтрокаТаблицы = ЭтаФорма.ТаблицаСделок[ИндексГруппы];
	СменитьФокусЭлемента(ИндексГруппы);
	ПоказатьЗначение(,СтрокаТаблицы.Сделка);
    
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик динамической команды "Подключаемый_СменитьСделку".
//
Процедура Подключаемый_СменитьСделку(Команда)
	
	ИндексГурппы = ПолучитьИндексСтроки(Команда.Имя);
	СменитьФокусЭлемента(ИндексГурппы);
	
	Элементы["ГруппаВсплывающаяВидСделки_"+ИндексГурппы].Показать();
	
КонецПроцедуры

&НаКлиенте
// Процедура, работчик динамической команды "Подключаемый_СменитьВидСделки".
//
Процедура Подключаемый_СменитьВидСделки(Команда)
	
	ИндексВида  	= ПолучитьИндексСтроки(Команда.Имя);
	ИндексВиджета  	= ПолучитьИндексСтроки(Команда.Имя, Ложь);
	СтрокаТаблицы 	= ЭтаФорма.ТаблицаСделок[ИндексВиджета];
	ТекстОшибки		= "";
	УправлениеИнтерфейсамиСервер.ИзменитьВидСделки(СтрокаТаблицы.Сделка, ИндексВида, ТекстОшибки);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	Иначе
		СменитьФокусЭлемента(ИндексВиджета);
		ОбновитьСделку(Команда.Имя, Объект.Ссылка);
		Оповестить("ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ");
		Оповестить("ОБНОВИТЬ_ВИДЖЕТ_СДЕЛКИ");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик динамического элемента "ПриИзменении".
//
Процедура Подключаемый_ПолеВводаСуммыСделкиПриИзменении(Элемент)
	
	ИзменитьСуммуСделки(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
// Процедура, ИзменитьСуммуСделки.
//
Процедура ИзменитьСуммуСделки(ИмяЭлемента)
	
	ИндексВиджета = ПолучитьИндексСтроки(ИмяЭлемента, Ложь);
	СтрокаТаблицы = ЭтаФорма.ТаблицаСделок[ИндексВиджета];
	
	УправлениеИнтерфейсамиСервер.ИзменитьСуммуСделки(СтрокаТаблицы.Сделка, ЭтотОбъект.ПолеВводаСуммыСделки);
	
	СтрокаТаблицы.СуммаСделки = ЭтотОбъект.ПолеВводаСуммыСделки;
	
	УстановитьФокусЭлемента();

	ПоказатьВсплывающуюГруппуСделки(ИндексВиджета);
	
КонецПроцедуры

&НаКлиенте
// Процедура, изменяет видимость элементов суммы сделки в виджете.
// Значения реквизита "сумма сделки" и в "таблице сделок" (динамических), изменяется перед процедурой. 
// т.к. процедура предназначена для изменения видимости элементов, а не значений реквизитов формы.
//
// Параметры:
//	ИндексВиджета - Число  - индекс виджета.
//	ВводДоступен  - Булево - признак отображения поле ввода.
//
Процедура ПоказатьВсплывающуюГруппуСделки(ИндексВиджета)
	
	Элементы["ГруппаВсплывающаяСделка_"+ИндексВиджета].Показать();

КонецПроцедуры

&НаКлиенте
// Процедура, СоздатьСделкуИзСписка.
//
Процедура СоздатьСделкуИзСписка(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипЗнч(Результат.Значение) = Тип("СправочникСсылка.ВидыСделок") Тогда
		
		Если Объект.Ссылка.Пустая() Тогда
			
			Оповещение = Новый ОписаниеОповещения("СоздатьСделкуИзСпискаПослеВопросаОЗаписиКлиента", ЭтотОбъект, Новый Структура("ВидСделки", Результат.Значение));
			ПоказатьВопрос(Оповещение, НСтр("ru='Для создания сделки необходимо произвести запись нового клиента. Записать?';en='For create deals is necessary toproduce record new client. WriteDown?'"), РежимДиалогаВопрос.ДаНет);
			
		Иначе
			СоздатьСделку(Объект.Ссылка, Результат.Значение); 			
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - После вопроса о записи клиента создать сделку из списка.
//
Процедура СоздатьСделкуИзСпискаПослеВопросаОЗаписиКлиента(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да 
		И ЭтаФорма.Записать() Тогда
		
		СоздатьСделку(Объект.Ссылка, ДопПараметры.ВидСделки);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, ОбработчикНажатияИзменитьЭтап.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Процедура ОбработчикНажатияИзменитьЭтап(Команда) Экспорт

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент", Объект.Ссылка);
	ПараметрыФормы.Вставить("ИзменитьЭтапОтказ", СтрНайти(Команда.Имя, "КомандаИзменитьЭтапОтказ") > 0);
	
	ИндексГурппы  = ПолучитьИндексСтроки(Команда.Имя, Ложь);
	СтрокаТаблицы = ЭтаФорма.ТаблицаСделок[ИндексГурппы];
	ПараметрыФормы.Вставить("Сделка", СтрокаТаблицы.Сделка);
	
	ОткрытьФорму("Справочник.Сделки.Форма.ФормаВиджета", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура, ОбработчикТаблицаОтказовВыбор.
//
Процедура ОбработчикТаблицаОтказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
	
	ПричинаОтказа = Элемент.ТекущиеДанные.Ссылка;
	ИмяЭлемента   = Элемент.Имя;
	
	ИндексВиджета = ПолучитьИндексСтроки(ИмяЭлемента, Ложь);
	СменитьФокусЭлемента(ИндексВиджета);
	
	ОбновитьПричинуОтказаВыборНаСервере(ПричинаОтказа, ИмяЭлемента);	
	Оповестить("ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ");
	Оповестить("ОБНОВИТЬ_ВИДЖЕТ_СДЕЛКИ");
	    
КонецПроцедуры

&НаСервере
// Процедура, ОбновитьПричинуОтказаВыборНаСервере.
//
Процедура ОбновитьПричинуОтказаВыборНаСервере(ПричинаОтказа, ИмяЭлемента)	
	
	УправлениеИнтерфейсамиСервер.ОбновитьПричинуОтказа(ЭтаФорма, ПричинаОтказа, ИмяЭлемента);
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ЭтотОбъект.Статус = Перечисления.СтатусыКонтрагентов.Отказ;
		ОбновитьОформлениеКнопкиСтатусаКлиента();
		
	Иначе 
		
		ЭтотОбъект.Статус = Справочники.Контрагенты.ПолучитьСтатус(Объект.Ссылка);
		ОбновитьОформлениеКнопкиСтатусаКлиента();
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, ОбновитьСделку.
//
Процедура ОбновитьСделку(ИмяКоманды, Контрагент)
	
	Если СтрНайти(ИмяКоманды, "КомандаЭтап") > 0 Тогда		
		
		ИндексВиджета 	= ПолучитьИндексСтроки(ИмяКоманды, Ложь);
		ИндексЭтапа     = ПолучитьИндексСтроки(ИмяКоманды);
		НайденнаяСделка = ЭтотОбъект.ТаблицаСделок[ИндексВиджета].Сделка;

		УправлениеИнтерфейсамиСервер.ОбновитьЭтапСделки(НайденнаяСделка, ИндексЭтапа);
		
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() 
		И ЭтотОбъект.Статус <> Перечисления.СтатусыКонтрагентов.Потенциальный Тогда
		
		ЭтотОбъект.Статус = Перечисления.СтатусыКонтрагентов.Потенциальный;
		ОбновитьОформлениеКнопкиСтатусаКлиента();
		
	Иначе 
		
		ЭтотОбъект.Статус = Справочники.Контрагенты.ПолучитьСтатус(Объект.Ссылка);
		ОбновитьОформлениеКнопкиСтатусаКлиента();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает идентификатор строки данных по имени элемента.
//
// Параметры:
//	 ИмяЭлемента 	- Строка - имя элемента.
//   ИндексЭлемента - Булево - признак чего получаем индекс (Элемента или Виджета).
//
Функция ПолучитьИндексСтроки(ИмяЭлемента, ИндексЭлемента = Истина)
	
	Если ИндексЭлемента Тогда
		НомерСимвола = СтрНайти(ИмяЭлемента,"_");
		
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Сред(ИмяЭлемента, НомерСимвола + 1, 2)) Тогда
			Возврат Число(Сред(ИмяЭлемента, НомерСимвола + 1, 2));
		Иначе		
			Возврат Число(Сред(ИмяЭлемента, НомерСимвола + 1, 1));	
		КонецЕсли;		
		
	Иначе
		НомерСимвола = СтрНайти(ИмяЭлемента,"_", НаправлениеПоиска.СКонца);
		Возврат Число(Сред(ИмяЭлемента, НомерСимвола + 1));
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Процедура, СменитьФокусЭлемента.
Процедура СменитьФокусЭлемента(Знач ИндексГурппы)
	
	ЭтаФорма.ТекущийЭлемент = Элементы["КнопкаТекущийЭтап_" + ИндексГурппы];
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, ПолучитьВидыСделок.
//
Функция ПолучитьВидыСделок(Пациент, Статус, ЛичныйВрач = Неопределено)
	
	Если Статус = Перечисления.СтатусыКонтрагентов.Потенциальный Тогда
		Возврат Справочники.ВидыСделок.ПолучитьДоступныеДляГенерацииВидыСделок(, Пациент, Статус, ЛичныйВрач);
	Иначе
		Возврат Справочники.ВидыСделок.ПолучитьДоступныеДляГенерацииВидыСделок(, Пациент, Статус, ЛичныйВрач);		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Процедура, создает новую сделку клиенту.
//
Процедура СоздатьСделку(Клиент, ВидСделки, ЧленствоПакетУслуг = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(Клиент)
		И НЕ ЗначениеЗаполнено(ВидСделки) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидСделкиПродление(ВидСделки)
		И Не ЗначениеЗаполнено(ЧленствоПакетУслуг) Тогда
		
		ВыбратьЧленствоПакетУслугИзСписка(ВидСделки);
	Иначе		
		НоваяСделка = СоздатьСделкуНаСервере(ВидСделки, Клиент, ЧленствоПакетУслуг);
		Если ЗначениеЗаполнено(НоваяСделка) Тогда 
			Оповестить("ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ");
			Оповестить("ОБНОВИТЬ_СВЕДЕНИЯ_ПО_СДЕЛКАМ", НоваяСделка);
		КонецЕсли;	
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, определяет является ли переданный вид сделки продлением.
//
// Параметры:
//  ВидСделки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВидСделкиПродление(ВидСделки)
   Возврат ВидСделки.ТипСделки = Перечисления.ТипыСделок.Продление;
КонецФункции

&НаСервере
// Функция - Создать сделку на сервере
//
// Параметры:
//  ВидСделки			 - 	 - 
//  Клиент				 - 	 - 
//  ЧленствоПакетУслуг	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьСделкуНаСервере(Знач ВидСделки, Знач Клиент, Знач ЧленствоПакетУслуг)
	
	НоваяСделка = Неопределено;
	
	ДанныеЗаполнения = Новый Структура();
	ДанныеЗаполнения.Вставить("Контрагент"					, Клиент);
	ДанныеЗаполнения.Вставить("ВидСделки"					, ВидСделки);
	ДанныеЗаполнения.Вставить("ЭтапСделки"					, Справочники.ВидыСделок.ПолучитьСтартовыйЭтапВидаСделки(ВидСделки));
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения.ЭтапСделки) Тогда
		ПричинаНеУказаныЭтапы = НСтр("ru='Для данного вида сделки не указаны этапы.';en='No stages are specified for this type of transaction'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось создать сделку по причине: ';en='Failed to create deal for the reason:'") + Символы.ПС + ПричинаНеУказаныЭтапы);
		Возврат НоваяСделка;
	КонецЕсли;		
	ДанныеЗаполнения.Вставить("ДатаСделки"					, ТекущаяДатаСеанса());
	ДанныеЗаполнения.Вставить("ЧленствоПакетУслуг"			, ЧленствоПакетУслуг);
	ДанныеЗаполнения.Вставить("ИсточникИнформации"			, Объект.ИсточникИнформации);
	ДанныеЗаполнения.Вставить("СтруктурнаяЕдиница"			, ЭтотОбъект.ТекущаяСтруктурнаяЕдиница);
	ДанныеЗаполнения.Вставить("ИсточникИнформацииЗначение"	, ?(ЗначениеЗаполнено(Объект.КлиентИсточникИнформации), Объект.КлиентИсточникИнформации, Неопределено));
	ДанныеЗаполнения.Вставить("Менеджер"					, Объект.Куратор);
 	ДанныеЗаполнения.Вставить("СформироватьНаименование"	, Истина);		

	Попытка
		НоваяСделка = Справочники.Сделки.СоздатьНовуюСделку(ДанныеЗаполнения, Истина);
		ОбновитьВиджетИСтатусКонтрагента();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось создать сделку по причине: ';en='Failed to create deal for the reason:'") + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат НоваяСделка;
	
КонецФункции

&НаКлиенте
// Процедура - Выбрать членство пакет услуг из списка.
//
Процедура ВыбратьЧленствоПакетУслугИзСписка(знач ВидСделки)
	
	ЧПУ = ПолучитьЧПУКлиента(Объект.Ссылка);
	
	Если ЧПУ.Количество() > 0 Тогда
		
		СписокВыбора = Новый СписокЗначений();		
		СписокВыбора.ЗагрузитьЗначения(ЧПУ);
		
		Для Каждого ЭлементСписка Из СписокВыбора Цикл		
			ЭлементСписка.Представление = ЭлементСписка.Значение; 			
		КонецЦикла;
		
		Оповещение = Новый ОписаниеОповещения("ОбработкаВыборкаЧленстваПакетаУслугЗавершение", ЭтотОбъект, ВидСделки);		
		ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Элементы.КнопкаСоздатьСделку);
		
	Иначе
		ПоказатьПредупреждение(,НСтр("ru='У клиента нет членств и пакетов для продления';en='Client not memberships and packages for extension'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Обработка выборка членства пакета услуг завершение.
//
// Параметры:
//  Результат	 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура ОбработкаВыборкаЧленстваПакетаУслугЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		СоздатьСделку(Объект.Ссылка, ДопПараметры, Результат.Значение); 			
	КонецЕсли;
	   
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить Членство пакеты услуг клиента.
//
// Параметры:
//  Контрагент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЧПУКлиента(Контрагент)
	
     Возврат РегистрыСведений.ЧленстваПакетыУслугИтоги.ПолучитьНеПродленныеЧленстваПакетыУслугПоКлиенту(Контрагент);
	 
КонецФункции

&НаСервереБезКонтекста
// Функция, ПолучитьПоследнююПродажуПоСделке.
//
Функция ПолучитьПоследнююПродажуПоСделке(Сделка)
	
	Если НЕ ЗначениеЗаполнено(Сделка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Реализация.Ссылка КАК Продажа
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.Сделка = &Сделка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Реализация.Дата УБЫВ";
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗначениеВозврата = ?( Выборка.Следующий(), Выборка.Продажа, Неопределено);
	
	Возврат ЗначениеВозврата;
		
КонецФункции

&НаКлиенте
// Процедура, ПоказатьСделкиАрхива.
//
Процедура ПоказатьСделкиАрхива(Команда) Экспорт
	
	ГруппаАрхивСделокСвертываемая = ЭтаФорма.Элементы.Найти("ГруппаСвертываемаяАрхивСделок");	
	Если НЕ ГруппаАрхивСделокСвертываемая = Неопределено Тогда
		ГруппаАрхивСделокСвертываемая.Видимость = НЕ ГруппаАрхивСделокСвертываемая.Видимость;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, ОбновитьВиджетИСтатусКонтрагента.
//
Процедура ОбновитьВиджетИСтатусКонтрагента()
	
	ЭтаФорма.Прочитать();
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда		
		
		ЭтотОбъект.СтатусКлиента = РегистрыСведений.СтатусыКонтрагентов.ПолучитьСтатусКлиента(Объект.Ссылка);
		ОбновитьОформлениеКнопкиСтатусаКлиента();
		ОбновитьВиджетСделки();
		
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.Сделка) Тогда
		
		УправлениеИнтерфейсамиСервер.ОбновитьВиджетСделки(ЭтаФорма, , ЭтотОбъект.Сделка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить актуальную сделку взаимодействия.
//
Процедура УстановитьАктуальнуюСделкуВзаимодействия()
	
	// Установить актуальную сделку клиента.
	ЭтотОбъект.ВзаимодействиеСделка = Справочники.Сделки.ПолучитьАктуальнуюСделкуКлиента(Объект.Ссылка);
	
	УстановитьСостояниеЭлементовСделкиВзаимодействия(
		ЭтотОбъект.ВзаимодействиеСделка, 
		?(ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеСделка), ЭтотОбъект.ВзаимодействиеСделка.ЭтапСделки.ЦветЭтапа, Неопределено)
	);

КонецПроцедуры

&НаСервере
// Процедура - Обработчик выбора сделки взаимодействия сервер.
//
// Параметры:
//  Сделка		 - 	 - 
//  ЦветЭтапа	 - 	 - 
//
Процедура УстановитьСостояниеЭлементовСделкиВзаимодействия(Сделка, ЦветЭтапа)
	
	ЦветФона = ?(ЗначениеЗаполнено(ЦветЭтапа), ЗначениеИзСтрокиВнутр(ЦветЭтапа), Новый Цвет());
	ЦветФона = ?(ЦветФона = Новый Цвет(), Новый Цвет(214, 234, 255), ЦветФона);
	
	Представление = ?(ЗначениеЗаполнено(Сделка), Строка(Сделка), НСтр("ru='Выбрать сделку';en='Select a deal'"));
	
	ЭтотОбъект.ВзаимодействиеСделка                           = Сделка; 
	Элементы.ВзаимодействиеСделка.Заголовок                  = Представление;
	ЭтаФорма.Команды["ВзаимодействиеСделка"].Подсказка        = Представление;
	Элементы.ГруппаВаимодействиеСделкаПредставление.ЦветФона = ЦветФона;
	Элементы.ВзаимодействиеСделка.ЦветТекста                  = ОбщегоНазначенияВызовСервера.ПолучитьЦветТекстаПоЦветуФона(ЦветФона);

КонецПроцедуры


&НаКлиенте
// Процедура - Команда взаимодействие исполнитель
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеЗадачаИсполнитель(Команда)
	
	Оповещение     = Новый ОписаниеОповещения("ОбработчикВыбораИсполнителяЗадачи", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("Ключ", ЭтотОбъект.ВзаимодействиеЗадачаИсполнитель);	
	
	ОткрытьФорму("Задача.Взаимодействие.Форма.ФормаВыбораИсполнителя", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик выбора исполнителя взаимодействия
//
// Параметры:
//  Результат	 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура ОбработчикВыбораИсполнителяЗадачи(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если ТипЗнч(Результат) = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка") Тогда
			Представление = ПолучитьПредставлениеФИОСотрудника(Результат);
		Иначе
			Представление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Результат, "Наименование");		
		КонецЕсли;

		ЭтотОбъект.ВзаимодействиеЗадачаИсполнитель         = Результат;	
		Элементы.ВзаимодействиеЗадачаИсполнитель.Заголовок = Представление;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Заполнить список выбора режима напоминания
//
Процедура ЗаполнитьСписокВыбораРежимаНапоминания()
	
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Очистить();
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(-1	   , НСтр("ru = 'не напоминать'; en = 'do not remind'"));
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(0     , НСтр("ru = 'в момент события'; en = 'at the time of the event'"));
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(300   , НСтр("ru = 'за 5 минут'; en = 'in 5 minutes'"));
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(600   , НСтр("ru = 'за 10 минут'; en = 'in 10 minutes'"));
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(900   , НСтр("ru = 'за 15 минут'; en = 'in 15 minutes'"));
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(1800  , НСтр("ru = 'за 30 минут'; en = 'in 30 minutes'"));     
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(3600  , НСтр("ru = 'за 1 час'; en = 'in 1 hour'"));
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(7200  , НСтр("ru = 'за 2 часа'; en = 'in 2 hours'"));
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(86400 , НСтр("ru = 'за 1 день'; en = 'in 1 day'"));
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(172800, НСтр("ru = 'за 2 дня'; en = 'in 2 days'"));
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(604800, НСтр("ru = 'за 1 неделю'; en = 'in 1 week'"));
	
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания = -1;
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет список телефонов, которые связаны с  контактами мессенджерамов.
//
Процедура ЗаполнитьСписокТелефоновДляWhatsApp()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
	|		ПО КонтрагентыКонтактнаяИнформация.Ссылка = КонтактыМессенджеров.ОбъектИдентификации
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
	|	И КонтрагентыКонтактнаяИнформация.НомерТелефона <> """"
	|	И КонтрагентыКонтактнаяИнформация.НомерТелефона = КонтактыМессенджеров.НомерМессенджера");
	
	Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЭтотОбъект.СписокТелефоновДляWhatsApp.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("НомерТелефона"));
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет данные телефонов для проверки изменения.
//
Процедура ЗаполнитьДанныеТелефоновДоИзменения()
	
	Для Каждого СтрокаКИ Из ЭтотОбъект.КонтактнаяИнформация Цикл
		
		Если СтрокаКИ.Тип <> Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			Продолжить;
		КонецЕсли;
		
		НомерТелефона = УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ВернутьТелефонТолькоЦифрами(СтрокаКИ.Представление);
		
		ДанныеНомера = Новый Структура;
		ДанныеНомера.Вставить("Идентификатор"	, СтрокаКИ.ПолучитьИдентификатор());
		ДанныеНомера.Вставить("НомерТелефона"	, НомерТелефона);
		ДанныеНомера.Вставить("ИзмененныйНомер"	, "");
		
		ЭтотОбъект.ИзменяемыеТелефоныМессенджера.Добавить(ДанныеНомера);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обновляет данные изменяемых телефонов.
//
Процедура ОбновитьДанныеИзменяемыхТелефонов()
	
	Для Каждого СтрокаКИ Из ЭтотОбъект.КонтактнаяИнформация Цикл
		
		Если СтрокаКИ.Тип <> ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавлятьНомер = Истина;
		ИдентификаторСтроки = СтрокаКИ.ПолучитьИдентификатор();
		
		Для Каждого ЭлементСписка Из ЭтотОбъект.ИзменяемыеТелефоныМессенджера Цикл
			
			ДанныеНомера = ЭлементСписка.Значение;
			
			Если ДанныеНомера.Идентификатор = ИдентификаторСтроки Тогда
				ДобавлятьНомер = Ложь;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ДобавлятьНомер = Истина Тогда
			
			ДанныеНомера = Новый Структура;
			ДанныеНомера.Вставить("Идентификатор"	, ИдентификаторСтроки);
			ДанныеНомера.Вставить("НомерТелефона"	, "");
			ДанныеНомера.Вставить("ИзмененныйНомер"	, "");
			
			ЭтотОбъект.ИзменяемыеТелефоныМессенджера.Добавить(ДанныеНомера);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет данные телефонов для проверки изменения.
//
Процедура ЗаполнитьДанныеТелефоновПередЗаписью()
	
	Для Каждого ЭлементСписка Из ЭтотОбъект.ИзменяемыеТелефоныМессенджера Цикл
		
		ДанныеТелефона = ЭлементСписка.Значение;
		
		СтрокаКИ = ЭтотОбъект.КонтактнаяИнформация.НайтиПоИдентификатору(ДанныеТелефона.Идентификатор);
		
		Если СтрокаКИ = Неопределено Тогда
			ДанныеТелефона.ИзмененныйНомер = "";
			Продолжить;
		КонецЕсли;
		
		ДанныеТелефона.ИзмененныйНомер = УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ВернутьТелефонТолькоЦифрами(СтрокаКИ.Представление);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура, "Вид документа При изменении".
//
Процедура ВидДокументаПриИзменении(Элемент)  
	
	Если Объект.Ссылка.Пустая() Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОЗаписиКлиентаДокумент", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Для выбора документа необходимо произвести запись нового клиента. Записать?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ПослеВопросаОЗаписиКлиентаДокумент(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЭтаФорма.Записать();
	Иначе	
		УдостоверениеЛичностиКонтрагента.ВидДокумента = Неопределено;
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте                          
// Процедура, отобразить все полисы.
//
Процедура ПоказатьВсеПолисы(Команда)
	
	Параметр = Новый Структура("Контрагент", Объект.Ссылка);
	ОткрытьФорму("Справочник.ПолисыМедицинскогоСтрахования.ФормаСписка",Параметр,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
// Функция, возвращает признак доступности отправки в мессенджер.
//
Функция ПолучитьПризнакДоступностиОтправкиВМессенджер(Клиент, МассивНомеров)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтактыМессенджеров.ВнешняяСистема КАК ВнешняяСистема,
	|	КонтактыМессенджеров.Идентификатор КАК Идентификатор
	|ИЗ
	|	РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
	|ГДЕ
	|	КонтактыМессенджеров.ОбъектИдентификации = &ОбъектИдентификации
	|	И КонтактыМессенджеров.ВнешняяСистема.СтруктурнаяЕдиница В(&СтруктурныеЕдиницы)
	|	И КонтактыМессенджеров.ВнешняяСистема.Используется
	|	И НЕ КонтактыМессенджеров.ВнешняяСистема.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВнешниеСистемы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.GreenApi)
	|	И ВнешниеСистемы.СтруктурнаяЕдиница В(&СтруктурныеЕдиницы)
	|	И ВнешниеСистемы.Используется
	|	И НЕ ВнешниеСистемы.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("ОбъектИдентификации"	, Клиент);
	Запрос.УстановитьПараметр("СтруктурныеЕдиницы"	, Новый_Массив(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница, Справочники.СтруктурныеЕдиницы.ПустаяСсылка()));
	
	Результат = Запрос.ВыполнитьПакет();
	
	// Нашелся контакт мессенджера.
	Если ЗначениеЗаполнено(Результат[0].Выгрузить()) Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Есть внешняя система GreenApi и есть хотя бы 1 номер для отправки.
	Если ЗначениеЗаполнено(Результат[1].Выгрузить()) И ЗначениеЗаполнено(МассивНомеров) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, проверяет роль доступность роли.
//
// Параметры:
// 	Роль - Строка - Роль метаданных в строковом представлении.
//
Функция РольДоступнаКлиентСервер(Роль)
	
    Возврат РольДоступна(Роль);
	
КонецФункции 

&НаСервереБезКонтекста
// Функция - Получить данные истории вызова
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеИсторииВызова(IDЗвонка, Сообщение = "")
	
	СтруктураВызова = РегистрыСведений.ИсторияВызовов.ПолучитьПоIDЗвонка(IDЗвонка);
	Если ЗначениеЗаполнено(СтруктураВызова) Тогда  
		
		Если Справочники.ТелефонныеАппараты.ЗаписьРазговораДоступна(ПараметрыСеанса.ТекущийПользователь, СтруктураВызова.ПользовательSip) Тогда
			
			Возврат СтруктураВызова; 
		Иначе
			Сообщение = НСтр("ru='Нет прав на прослушивание текущей записи';en='Not is right to listen to current records'");
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат Неопределено;	
	
КонецФункции

&НаКлиенте
// Процедура, обработчик завершения перехода в чат мессенджера.
//
Процедура ПерейтиВЧат(ИдКлиента, ВнешняяСистема)
	
	// Проверим подключенно ли расширение мессенджера.
	Если НЕ ОбщегоНазначенияСтоматология.ИспользуетсяРасширение("Мессенджер") Тогда 
		Возврат;
	КонецЕсли;
	
	ИдСообщения = УстановитьОжиданиеСообщения(ИдКлиента, ВнешняяСистема);
	
	ДанныеКаналаСтруктура = Новый Структура;
	ДанныеКаналаСтруктура.Вставить("ИдКлиента"		, ИдКлиента);
	ДанныеКаналаСтруктура.Вставить("ВнешняяСистема"	, ВнешняяСистема);
	ДанныеКаналаСтруктура.Вставить("ИдСообщения"	, ИдСообщения);
	
	ПараметрыОткрытия = Новый Структура("ДанныеКанала", ДанныеКаналаСтруктура);
	
	Оповестить("ОткрытьДиалог", ПараметрыОткрытия);
	ОткрытьФорму("Обработка.Мессенджер_Стоматология.Форма.ФормаЧатаНовая", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, создает сообщение с признаком ожидания сообщения.
//
Функция УстановитьОжиданиеСообщения(ИдКлиента, ВнешняяСистема, ОписаниеОшибки = "", Объект = Неопределено, НомерТелефона = "")
	
	Если ТипЗнч(ВнешняяСистема) = Тип("Строка") Тогда
		ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьСсылку(Новый УникальныйИдентификатор(ВнешняяСистема));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдКлиента) и ЗначениеЗаполнено(Объект) Тогда
		
		ДанныеКонтакта	 = СоздатьКонтактМессенджера(ВнешняяСистема, Объект, НомерТелефона);
		ИдКлиента		 = ДанныеКонтакта.ИдКлиента;
		ИдСообщения		 = ДанныеКонтакта.ИдСообщения;
		
	Иначе
		
		ИдСообщения = МессенджерСтоматология.ПолучитьИдОжидающегоСообщенияВМесенджер(ИдКлиента, ВнешняяСистема);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдКлиента) Тогда
		ОписаниеОшибки = НСтр("ru = 'Не удалось создать клиента в мессенджере.'; en = 'Failed to create messenger client.'");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ИдСообщения;

	
КонецФункции

&НаСервереБезКонтекста
// Функция, создает канал мессенджера.
//
Функция СоздатьКонтактМессенджера(ВнешняяСистема, Контрагент, Знач НомерТелефона)
	
	Если ВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi Тогда
		
		НомерТелефона = ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(НомерТелефона, Ложь);
		НомерТелефона = ?(СтрДлина(НомерТелефона) > 10 И Лев(НомерТелефона, 1) = "8", "7" + Сред(НомерТелефона, 2), НомерТелефона);
		
		ИдКлиента = НомерТелефона + "@c.us";
		
	КонецЕсли;
	
	ИдКлиента	 = ИдКлиента;
	ИдСообщения	 = Строка(Новый УникальныйИдентификатор);
	
	Если ЗначениеЗаполнено(ИдКлиента) Тогда
		
		НовыйДиалог					 = РегистрыСведений.Диалоги.СоздатьМенеджерЗаписи();
		НовыйДиалог.ИдДиалога		 = Строка(Новый УникальныйИдентификатор);
		НовыйДиалог.ВнешняяСистема	 = ВнешняяСистема;
		НовыйДиалог.ИдКлиента		 = ИдКлиента;
		НовыйДиалог.Начало			 = Дата(2022, 1, 1);
		НовыйДиалог.Окончание		 = Дата(2022, 1, 1);
		
		НовыйДиалог.Записать();
		
		РегистрыСведений.КонтактыМессенджеров.ЗаписатьИдентификаторМессенджера(
			ИдКлиента,
			Контрагент,
			НомерТелефона,,
			ВнешняяСистема,
			ОбщегоНазначения.ПолучитьЗначениеРеквизита(Контрагент, "Наименование"),,,,
			НовыйДиалог.ИдДиалога
		);
		
		РегистрыСведений.ЖурналСообщений.ДобавитьЗапистьЖурналСообщений(
			ИдКлиента,
			ИдСообщения,,,
			НСтр("ru = 'Создан контакт'"),
			Истина,
			Перечисления.Мессенджеры.whatsapp,
			Ложь,
			ТекущаяДатаСеанса(),
			ВнешняяСистема,,,,,,,,,
			НовыйДиалог.ИдДиалога,
			Истина
		);
		
	КонецЕсли;
	
	ДанныеКонтакта = Новый Структура;
	ДанныеКонтакта.Вставить("ИдКлиента"		, ИдКлиента);
	ДанныеКонтакта.Вставить("ИдСообщения"	, ИдСообщения);
	
	Возврат ДанныеКонтакта;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Процедура, устанавливает видимость элемента "КаналПривлеченияЗначение".
//
Процедура УстановитьВидимостьЗначенияКаналаПривлечения(Форма)
	
	Форма.Элементы.КаналПривлеченияЗначение.Видимость = (Форма.Объект.КаналПривлечения = ПредопределенноеЗначение("Справочник.КаналыПривлечения.ЧатСКлиентом"));
	
КонецПроцедуры

#Область Печать

&НаКлиенте
// Процедура печати документов.
//
Процедура ДокументПечать(Команда)
	
	МассивДокументов = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		МассивДокументов.Добавить(Объект.Ссылка);
	КонецЕсли;
		
	СписокПечатныхФорм = ПолучитьСписокПечати(); 	
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "Событие");
	Структура.Вставить("МассивДокументов", МассивДокументов);
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаКоманды", УправлениеПечатьюКлиентСтоматология, Структура);	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) ИЛИ ЭтаФорма.Модифицированность Тогда	
		
		СтруктураВопроса = Новый Структура;
		СтруктураВопроса.Вставить("СписокПечатныхФорм", СписокПечатныхФорм);
		СтруктураВопроса.Вставить("Оповещение", Оповещение);
		ОповещениеДляВопроса = Новый ОписаниеОповещения("ПослеВопросаЗавершение", ЭтотОбъект, СтруктураВопроса);
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ПоказатьВопрос(ОповещениеДляВопроса, "Данные ещё не записаны. Записать?", РежимДиалогаВопрос.ДаНет);
		Иначе
			ПоказатьВопрос(ОповещениеДляВопроса, "Данные изменены. Записать?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
		
	Иначе
		
		ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, Элементы.ФормаДокументаПечать);
		
	КонецЕсли;   				
	
КонецПроцедуры

&НаКлиенте
// Процедура После вопроса завврешение.
//
Процедура ПослеВопросаЗавершение(Результат, Параметры) Экспорт	
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ПроверитьЗаполнение() = Истина Тогда		
			ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));			
		КонецЕсли; 				
	Иначе
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()
	Возврат Справочники.Контрагенты.ПолучитьСписокПечатныхФорм();	
КонецФункции

#КонецОбласти

&НаСервере
// Процедура Обработки заполнения на сервере.
//
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	УправлениеКонтактнойИнформациейСтоматология.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, закрепляет/открепляет заметку. 
//
Процедура ЗакрепитьОткрепитьЗаметку(ИдЗаметки, Закреплена);
	
	РегистрыСведений.Заметки.ЗакрепитьОткрепитьЗаметку(ИдЗаметки, Закреплена);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция - Фильтр применен.
//
// Параметры:
//  СписокФильтрации - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ФильтрПрименен(СписокФильтрации)
	
	Для Каждого Фильтр Из СписокФильтрации Цикл
		Если Фильтр.Пометка = Истина Тогда
			Возврат Истина;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере 
// Функция - Отобразить заявку контрагента
// 
// Возвращаемое значение:
//   - 
//
Функция ОтобразитьЗаявкуКонтрагента()
	
	ЭтотОбъект.ЗаявкаКонтрагента = Справочники.Заявки.ПолучитьЗаявкуКонтрагента(Объект.Ссылка,,ЭтотОбъект.ТекущаяСтруктурнаяЕдиница);
	Элементы.ЗаявкаКонтрагента.Видимость = ЗначениеЗаполнено(ЭтотОбъект.ЗаявкаКонтрагента);
	
КонецФункции

#КонецОбласти
