
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Канал") Тогда 
		ЭтотОбъект.Канал =  Параметры.Канал;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаСобытийЭлементовФормы

&НаКлиенте
// Процедура - Канал при изменении.
//
Процедура КаналПриИзменении(Элемент)
	
	Если ЭтаФорма.Открыта() Тогда
		ЭтаФорма.Закрыть(Канал);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

