
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элемент.ДанныеСтроки(Значение);
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("СобственнаяОрганизация"        , ТекущаяСтрока.СобственнаяОрганизация);
	ВозвращаемоеЗначение.Вставить("Организация"                   , ТекущаяСтрока.Организация);
	ВозвращаемоеЗначение.Вставить("МестоДеятельности"             , ТекущаяСтрока.МестоДеятельности);
	ВозвращаемоеЗначение.Вставить("ИдентификаторСубъектаОбращения", ТекущаяСтрока.ИдентификаторСубъектаОбращения);
	ВозвращаемоеЗначение.Вставить("ИдентификаторОрганизации"      , ТекущаяСтрока.ИдентификаторОрганизации);
	
	ОповеститьОВыборе(ВозвращаемоеЗначение);
	
КонецПроцедуры

#КонецОбласти
