

#Область СлужебныеПроцедурыИФункции

// Функция - Добавить
//
// Параметры:
//  Параметры	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Добавить(Параметры) Экспорт	
	
	МенеджерЗаписи              = РегистрыСведений.СквознаяАналитика.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.IDЗвонка     = ?(Параметры.Свойство("callid")      , Параметры.callid      , "");
	МенеджерЗаписи.gcid         = ?(Параметры.Свойство("gcid")        , Параметры.gcid        , "");
	МенеджерЗаписи.ref          = ?(Параметры.Свойство("ref")         , Параметры.ref         , "");
	МенеджерЗаписи.source       = ?(Параметры.Свойство("source")      , Параметры.source      , "");
	МенеджерЗаписи.url          = ?(Параметры.Свойство("url")         , Параметры.url         , "");
	МенеджерЗаписи.utm_campaign = ?(Параметры.Свойство("utm_campaign"), Параметры.utm_campaign, ?(Параметры.Свойство("utmCampaign"), Параметры.utmCampaign, ""));
	МенеджерЗаписи.utm_content  = ?(Параметры.Свойство("utm_content") , Параметры.utm_content , ?(Параметры.Свойство("utmContent") , Параметры.utmContent , ""));
	МенеджерЗаписи.utm_medium   = ?(Параметры.Свойство("utm_medium")  , Параметры.utm_medium  , ?(Параметры.Свойство("utmMedium")  , Параметры.utmMedium  , ""));
	МенеджерЗаписи.utm_medium   = ?(ЗначениеЗаполнено(МенеджерЗаписи.utm_medium) И Не МенеджерЗаписи.utm_medium = "<не заполнено>", МенеджерЗаписи.utm_medium, ?(Параметры.Свойство("medium"), Параметры.medium, ""));
	МенеджерЗаписи.utm_source   = ?(Параметры.Свойство("utm_source")  , Параметры.utm_source  , ?(Параметры.Свойство("utmSource")  , Параметры.utmSource  , ""));
	МенеджерЗаписи.utm_term     = ?(Параметры.Свойство("utm_term")    , Параметры.utm_term    , ?(Параметры.Свойство("utmTerm")    , Параметры.utmTerm    , ""));
	МенеджерЗаписи.yaClientId   = ?(Параметры.Свойство("yaClientId")  , Параметры.yaClientId  , "");
	
	Попытка 		
		МенеджерЗаписи.Записать();
	Исключение 		
		Возврат ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Функция - Получить запись по ID
//
// Параметры:
//  IDЗвонка - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЗаписьПоID(IDЗвонка) Экспорт 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СквознаяАналитика.IDЗвонка КАК IDЗвонка,
	|	СквознаяАналитика.gcid КАК gcid,
	|	СквознаяАналитика.ref КАК ref,
	|	СквознаяАналитика.source КАК source,
	|	СквознаяАналитика.url КАК url,
	|	СквознаяАналитика.utm_campaign КАК utm_campaign,
	|	СквознаяАналитика.utm_content КАК utm_content,
	|	СквознаяАналитика.utm_medium КАК utm_medium,
	|	СквознаяАналитика.utm_source КАК utm_source,
	|	СквознаяАналитика.utm_term КАК utm_term,
	|	СквознаяАналитика.yaClientId КАК yaClientId
	|ИЗ
	|	РегистрСведений.СквознаяАналитика КАК СквознаяАналитика
	|ГДЕ
	|	СквознаяАналитика.IDЗвонка = &IDЗвонка");
	
	Запрос.УстановитьПараметр("IDЗвонка", IDЗвонка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда 
		Возврат СтрокуТаблицыЗначенийВСтруктуру(Результат[0], Результат);		
	Иначе 
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

#КонецОбласти
