
#Область ОбработчикиСобытий

&НаСервере
// Устанавливает флаг "обработано" для необработанных документов
// и снимает его у обработанных
//
// Параметры:
//  МассивДокументов - массив выбранных документов
Процедура УстановитьФлагОбработано(Знач МассивДокументов)

	Для Каждого ТекущийДокумент Из МассивДокументов Цикл
		
		Если ЗначениеЗаполнено(ТекущийДокумент) Тогда
			
			Попытка
				ТекущийДокументОбъект = ТекущийДокумент.ПолучитьОбъект();
				ТекущийДокументОбъект.Обработано = (НЕ ТекущийДокументОбъект.Обработано);
				ТекущийДокументОбъект.Записать();
			Исключение
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьФлагОбработано(ПараметрКоманды);
	Оповестить("УстановленФлагОбработано", ПараметрКоманды);
	
КонецПроцедуры

#КонецОбласти