  
#Область ОбработчикиСобытийФормы
  
&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	ЗапросПрием = Новый Запрос();
	Если Параметры.Свойство("Прием") И ТипЗнч(Параметры.Прием) = Тип("ДокументСсылка.Прием") Тогда
		ЗапросПрием.УстановитьПараметр("Прием", Параметры.Прием);
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗапросПрием.Текст = 
	"ВЫБРАТЬ
	|	ПриемЛечение.Ссылка КАК Прием,
	|	ЛОЖЬ КАК Пометка,
	|	ПриемЛечение.НомерСтроки,
	|	ПриемЛечение.ВидЦен,
	|	ПриемЛечение.Всего,
	|	ПриемЛечение.Зуб,
	|	ПриемЛечение.КлючСтроки,
	|	ПриемЛечение.Количество,
	|	ПриемЛечение.КоличествоУпаковок,
	|	ПриемЛечение.Номенклатура,
	|	ПриемЛечение.ПроцентСкидкиНаценки,
	|	ПриемЛечение.СтавкаНДС,
	|	ПриемЛечение.Сумма,
	|	ПриемЛечение.СуммаАвтоматическойСкидкиНаценки,
	|	ПриемЛечение.СуммаНДС,
	|	ПриемЛечение.Упаковка,
	|	ПриемЛечение.Цена,
	|	ПриемЛечение.Гарантия
	|ИЗ
	|	Документ.Прием.Лечение КАК ПриемЛечение
	|ГДЕ
	|	ПриемЛечение.Ссылка = &Прием";
	
	РезультатЗапрос = ЗапросПрием.Выполнить().Выгрузить();
	ТаблицаУслуги.Загрузить(РезультатЗапрос);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(ВыбратьСервер());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыбратьСервер()
	
	ОтборСписок = Новый Структура("Пометка",Истина);
	РезультатВыбора = ТаблицаУслуги.Выгрузить(ОтборСписок);
	
	Возврат ПоместитьВоВременноеХранилище(РезультатВыбора);
	
КонецФункции	

 #КонецОбласти