
#Область СлужебныеПроцедурыИФункции

#Область ПредопределенныеПроцедурыСЛК

// Ссылка на менеджер объектов, который создал этот объект, получена 
// в предопредленной процедуре "ПриСозданииОбъекта"
// Раскомментировать при создании защищенной обработки через License edit
// Перем _менджерОбъектов;

//
// Предопределенная процедура, вызывающаяся при создании объекта методом "СоздатьОбъект"
//
// Позволяет разработчику запретить создание обаботки, для чего 
// необходимо установить значение параметра "Отказ" в "Истина"
//
// МенеджерЛицензий - ссылка на менеджре лицензий, которым создан объект
// Отказ            - признак запрета создания
// ОписаниеОшибки   - описание ошибки, устанавливаемое разработчиком в случае запрета 
// создания объекта
// 
// В этой процедуре рекомендуется проверять значения лицензионных 
// параметров и в зависимости от них разрешить или запретить создание 
// объекта.
//
Процедура ПриСозданииОбъекта(МенеджерОбъектов, Отказ, ОписаниеОшибки) Экспорт
	ПростоПеременная = "";
	// Раскомментировать при создании защищенной обработки через License edit
	//	_менеджерОбъектов = МенеджерОбъектов;
КонецПроцедуры

//
// Предопределенная процедура, вызывающаяся при создании объекта методом 
// "СоздатьОбъект" перед проверкой лицензии сеанса
//
// Позволяет разработчику отказаться от проверки лицензии, для чего 
// необходимо установить значение параметра "Отказ" в "Истина".
//
// Используется в случае когда достаточно только защитить код и данные объекта и 
// нет необходимости в контроле лицензий
//
Процедура ПередКонтролемЛицензии(Отказ) Экспорт
	Отказ = Ложь;
КонецПроцедуры

//
// Предопределенная процедура, вызывающаяся при создании объекта методами 
// "Создать" и "СоздатьПоСсылке"
//
Процедура ПриСоздании(МенеджерЛицензий, КлиентскаяСылка, Отказ, ОписаниеОшибки) Экспорт
	// Контроль лицензий сеанса выполняется при создании объекта методом 
	// "СоздатьОбъект". 
	//
	// Чтобы объект было невозможно создать старвми методами без контроля 
	// лицензий сеанса запрещаем создание
	Отказ = Истина;
КонецПроцедуры

//
// Пример функции, использующей значение лицензионного параметра. Для получения 
// значения используется менеджер объектов, установленный в предопредленной 
// процедуре "ПриСозданииОбъекта" (см. выше)
//
Функция МетодОбъекта() Экспорт
	Стр = "";
	// Раскомментировать при создании защищенной обработки через License edit
	// Стр = 
	//  ЭтотОбъект.Метаданные().ПолноеИмя() + Символы.ПС +
	//  "Ключ = " + Строка(_менеджерОбъектов.ПолучитьНомерКлюча()) +
	//  ", ТипПриложения=" + _менеджерОбъектов.ПолучитьЗначениеПараметра("ТипПриложения");
	Возврат Стр;
КонецФункции

#КонецОбласти


#Область ПроцедурыОбъектаГрафикРаботыСотрудников

&НаСервере
// Процедура считывает данные с регистра и заполняет ими Таблицу значений ГрафикПериодовРаботы
//
Функция ПрочитатьИЗаполнитьГрафикРаботыИзРегистра(ГрафикПериодовРаботы, Параметры) Экспорт
	
	ГрафикПериодовРаботы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.СтруктурнаяЕдиница,
	|	ВложенныйЗапрос.Сотрудник,
	|	ВложенныйЗапрос.Должность,
	|	ВремяРаботыСотрудниковПлан.ДатаВремяНачала,
	|	ВремяРаботыСотрудниковПлан.ДатаВремяОкончания,
	|	ВремяРаботыСотрудниковПлан.Минуты,
	|	НАЧАЛОПЕРИОДА(ЕСТЬNULL(ВремяРаботыСотрудниковПлан.ДатаВремяНачала, &НачалоМесяца), МЕСЯЦ) КАК Период
	|ИЗ
	|	(ВЫБРАТЬ
	|		&СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		Сотрудники.Ссылка КАК Сотрудник,
	|		Сотрудники.Должность КАК Должность
	|	ИЗ
	|		Справочник.Сотрудники КАК Сотрудники
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|			ПО Сотрудники.Ссылка = НастройкиСотрудников.Сотрудник
	|	ГДЕ
	|		НЕ Сотрудники.ЭтоГруппа
	|		И НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|		И ВЫБОР
	|				КОГДА НастройкиСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА НастройкиСотрудников.ДатаУвольнения > &НачалоМесяца
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		И НЕ Сотрудники.ПометкаУдаления) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
	|		ПО ВложенныйЗапрос.Сотрудник = ВремяРаботыСотрудниковПлан.Сотрудник
	|			И (ВремяРаботыСотрудниковПлан.ДатаВремяНачала МЕЖДУ &НачалоМесяца И &КонецМесяца)
	|			И ВложенныйЗапрос.СтруктурнаяЕдиница = ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрСведений.ВремяРаботыСотрудниковПлан
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Сотрудник.Наименование";
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Параметры.Месяц));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Параметры.Месяц));
	Запрос.УстановитьПараметр("ПустаяДата", Дата(01, 01, 01));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Параметры.СтруктурнаяЕдиница);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	
	// Заполняем график работы
	
	Для Каждого СтрокаПериодРаботы Из ТаблицаРезультата Цикл
		
		ПараметрыОтбора = Новый Структура("Сотрудник", СтрокаПериодРаботы.Сотрудник);
		СтрокаГрафикаРаботы = ГрафикПериодовРаботы.НайтиСтроки(ПараметрыОтбора);
		Если СтрокаГрафикаРаботы.Количество() = 0 Тогда
			СтрокаГрафикаРаботы = ГрафикПериодовРаботы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаГрафикаРаботы, СтрокаПериодРаботы);
		Иначе
			СтрокаГрафикаРаботы = СтрокаГрафикаРаботы[0];
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаПериодРаботы.ДатаВремяНачала) Тогда
			Продолжить;
		КонецЕсли;
		
		ПериодСтруктура = Новый Структура("НачалоСмены, ОкончаниеСмены", СтрокаПериодРаботы.ДатаВремяНачала, СтрокаПериодРаботы.ДатаВремяОкончания);
		СтрокаГрафикаРаботы["День" + День(СтрокаПериодРаботы.ДатаВремяНачала)].Добавить(ПериодСтруктура, Формат(ПериодСтруктура.НачалоСмены, "ДФ='ЧЧ:мм'") + " - " + Формат(ПериодСтруктура.ОкончаниеСмены, "ДФ='ЧЧ:мм'"));
		
	КонецЦикла;	
	
КонецФункции

&НаСервере
// Процедура обрабатывает видимость, заголовок колонок таблицы
//
Процедура ОбновитьПредставлениеДняВКолонках(ГрафикПериодовРаботы, Параметры) Экспорт
	
	// ИЗ ЗА ЭТИХ СТРОЧЕК ПРОИСХОДИТ 4 РАЗА ВЫЗОВЫ СЕРВЕРА ----------
	Для а = 1 По 31 Цикл
		ДатаДня = НачалоМесяца(Параметры.Месяц) + (а - 1) * 60 * 60 * 24;
		ПолеЭлемента = ГрафикПериодовРаботы.ПодчиненныеЭлементы["ТаблицаГрафикаДень" + а];
		ПолеЭлемента.Заголовок = Строка(а);
		
		Если Не ЗначениеЗаполнено(Параметры.Месяц) Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеЭлемента.Видимость = (а <= День(КонецМесяца(Параметры.Месяц)));
		ПолеЭлемента.Заголовок = ПолеЭлемента.Заголовок + Символы.ПС + Формат(ДатаДня, "ДФ=ддд");
		Если ДеньНедели(ДатаДня) = 6 Или ДеньНедели(ДатаДня) = 7 Тогда 
			ПолеЭлемента.ЦветФонаЗаголовка = Новый Цвет(255, 255, 255);
			ПолеЭлемента.ЦветФона = Новый Цвет(255, 192, 203);
		Иначе
			ПолеЭлемента.ЦветФонаЗаголовка = Новый Цвет(255, 255, 255);
			ПолеЭлемента.ЦветФона = Новый Цвет;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура, записывает внешнюю систему.
// 
Процедура ЗаписатьВнешнююСистему(ВнешняяСистема, АвторизацияПоКодуБезСМС, ПараметрыВС = Неопределено) Экспорт
	
	ВнешняяСистемаОбъект = ВнешняяСистема.ПолучитьОбъект();
	
	Если АвторизацияПоКодуБезСМС <> ВнешняяСистема.АвторизацияПоКодуБезСМС Тогда
		ВнешняяСистемаОбъект.АвторизацияПоКодуБезСМС = АвторизацияПоКодуБезСМС;     
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыВС) И ТипЗнч(ПараметрыВС) = Тип("Структура") Тогда
		
		ПараметрыВнешнейСистемы = ВнешняяСистемаОбъект.Параметры.Получить();
		
		Если ПараметрыВнешнейСистемы = Неопределено Тогда 
			ПараметрыВнешнейСистемы = Новый Структура();
		КонецЕсли;
		
		Для Каждого ПараметрВС Из ПараметрыВС Цикл
			
			Если ПараметрыВнешнейСистемы.Свойство(ПараметрВС.Ключ) Тогда 
				ПараметрыВнешнейСистемы[ПараметрВС.Ключ] = ПараметрВС.Значение;
			Иначе
				ПараметрыВнешнейСистемы.Вставить(ПараметрВС.Ключ, ПараметрВС.Значение);
			КонецЕсли;
			
		КонецЦикла;		
		
		ВнешняяСистемаОбъект.Параметры = Новый ХранилищеЗначения(ПараметрыВнешнейСистемы);
		
	КонецЕсли;
	
	ВнешняяСистемаОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти 
	
#КонецОбласти 
