
#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// + Функция возвращает ссылку на агента для скачки
Функция		ПолучитьСсылкуНаАгента()	Экспорт
	
	Возврат "http://backup.1c.ru/agent/BackupAgent_en-US.msi";
	
КонецФункции

// Функция возвращает ложь в случае отсутствия установленного агента, или путь до агента
Функция 	ПроверитьУстановленностьАгента()	Экспорт
	
	УстановленАгент = Ложь; ПутьДоАгента = "";
	
	// Возврат;
	
	РаботаетWSShell = Истина;
	Попытка
		//WshShell = Новый COMОбъект("Wscript.Shell"); 
		// ЗначениеИзРеестра = WshShell.RegRead("HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Installer\UserData\S-1-5-18\Products\F79FE3FDC0AF08A4E88A0DF92921E93B\InstallProperties");
		// ЗначениеИзРеестра = WshShell.RegRead("HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\ComputerName\ComputerName");
		// ЗначениеИзРеестра = WshShell.RegRead("HKEY_CURRENT_USER\Volatile Environment\USERNAME");		
		// Сообщить(ЗначениеИзРеестра);
		// Путь до BackupAgent.exe будет здесь 
		// ключ HKLM/Software/Acronis/CommonComponents
		// значение BackupAgent.exe тип String

		// Версия будет здесь
		// ключ HKLM/Software/Acronis/CommonComponents
		// значение BackupAgentVersion тип String		
		ПутьДоАгента = "";
		ВызватьИсключение "фыва";
		УстановленАгент = Истина;
	Исключение
		РаботаетWSShell = Ложь;
		// Сообщить("ВСШел не работает" + ОписаниеОшибки());
	КонецПопытки; 
	
	// Пытаемся определить без WSShell, по стандартным путям к агенту (в случаях когда компонента не работает)
	Если НЕ РаботаетWSShell Тогда
		// Рассматриваем в порядке очевидности
		
		// В ProgramFiles
		ПутьДоАгента = "C:\Program files\Acronis\BackupAgent";
		Файлы = НайтиФайлы(ПутьДоАгента,"BackupAgent.exe");		
		УстановленАгент = НЕ (Файлы.Количество() = 0);
		
		// В ProgramFiles x86
		Если Не УстановленАгент Тогда
			ПутьДоАгента = "C:\Program Files (x86)\Acronis\BackupAgent";
			Файлы = НайтиФайлы(ПутьДоАгента,"BackupAgent.exe");
			УстановленАгент = НЕ (Файлы.Количество() = 0);
		КонецЕсли; 
		
	КонецЕсли;
	
	Если Не УстановленАгент Тогда
		Возврат Ложь;
	Иначе
		Возврат ПутьДоАгента;
	КонецЕсли;
	
КонецФункции

// + Процедура вносит изменения в расписание регламентного задания согласно установленному в полях
Процедура	ВнестиИзмененияВРегламентноеЗадание(Использование,ВремяКопирования)	Экспорт
	
	Попытка
		РегламентноеЗаданиеОбъект = РегламентныеЗадания.НайтиПредопределенное("ПроверкаНеобходимостиЗавершенияРаботы");
	Исключение
		Возврат;
	КонецПопытки;
	
	РегламентноеЗаданиеОбъект.Использование = Использование;
	
	РегламентноеЗаданиеОбъект.Расписание.ВремяНачала = ВремяКопирования - 120;
	РегламентноеЗаданиеОбъект.Расписание.ВремяКонца = ВремяКопирования + 180;
	
	РегламентноеЗаданиеОбъект.Записать();

КонецПроцедуры

// + Функция проверяет наличие выданных сертификатов для агента и возвращает ложь/истина по результату
Функция 	ПроверитьНаличиеСертификатаСервиса(ПутьДоАгента)	Экспорт
	
	СертификатНайден = Ложь;	
	
	// Проверяем наличие приватного ключа private_key.pem
	ПутьДоФайлаСертификата = "" + ПутьДоАгента + "\config\private_key.pem"; 
	ФайлСертификата = Новый Файл(ПутьДоФайлаСертификата);
	СертификатНайден = ФайлСертификата.Существует();
	
	// Проверяем наличие сертификата certificate.pem
	Если СертификатНайден = Истина Тогда
		ПутьДоФайлаСертификата = "" + ПутьДоАгента + "\config\certificate.pem"; 
		ФайлСертификата = Новый Файл(ПутьДоФайлаСертификата);
		СертификатНайден = ФайлСертификата.Существует();
	КонецЕсли;	
	
	Возврат СертификатНайден;
	
КонецФункции

// + Функция возвращает ошибку, если не удалось записать начальные настройки агента
Функция		УстановитьНачальныеНастройкиАгента(ПутьДоАгента)	Экспорт
	
	Попытка
		ПутьДоФайлаНастроекАгента = "" + ПутьДоАгента + "\config\BackupAgent.xml";
		ЗаписьНастройкиXML = Новый ЗаписьXML;
		ЗаписьНастройкиXML.ОткрытьФайл(ПутьДоФайлаНастроекАгента);
		ЗаписьНастройкиXML.ЗаписатьОбъявлениеXML();
		ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("EnvironmentConfiguration");
			// <!-- Separate log file per day. File name will have date postfix -->
			ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("Log");
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("LogPath");
					ЗаписьНастройкиXML.ЗаписатьТекст("C:\BackupAgent\logs");
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("MaxLogStackSize");
					ЗаписьНастройкиXML.ЗаписатьАтрибут("units","MB");
					ЗаписьНастройкиXML.ЗаписатьТекст("150");
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();				
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("LifeTime");
					ЗаписьНастройкиXML.ЗаписатьАтрибут("units","days");
					ЗаписьНастройкиXML.ЗаписатьТекст("7");
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("Level");
					ЗаписьНастройкиXML.ЗаписатьТекст("Debug");
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();				
			ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
			
			// <!-- Task statuses and other data that can be used by the 1C application -->
			ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("Statistics");
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("StatPath");
					ЗаписьНастройкиXML.ЗаписатьТекст("C:\BackupAgent\statistics");
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();	
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("DumpPeriod");
					ЗаписьНастройкиXML.ЗаписатьАтрибут("units","days");
					ЗаписьНастройкиXML.ЗаписатьТекст("7");
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();					
			ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
			
			// <!-- DB access retry policy -->
			ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("DBAccessPolicy");
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("Attempts");
					ЗаписьНастройкиXML.ЗаписатьТекст("5");
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();	
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("Timeout");
					ЗаписьНастройкиXML.ЗаписатьАтрибут("units","seconds");
					ЗаписьНастройкиXML.ЗаписатьТекст("900");
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();					
			ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
 
			// <!-- Temporary directory for local operations with the DB file-->
			ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("OperationDirectory");
				ЗаписьНастройкиXML.ЗаписатьТекст("C:\BackupAgent\workingDirectory");
			ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
			
			// <!-- Rules for processing multiple backup tasks and upload tasks -->
			ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("BackupPoolSize");
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("SimultaneousUpload");
					ЗаписьНастройкиXML.ЗаписатьТекст("2");
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();	
			ЗаписьНастройкиXML.ЗаписатьКонецЭлемента(); 			
			
			// <!-- Rules for processing multiple backup tasks and upload tasks -->
			ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("Servers");
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("AccessServer");
					ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("ip");
						ЗаписьНастройкиXML.ЗаписатьТекст("spirit.it-lite.ru");
					ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();		
					ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("port");
						ЗаписьНастройкиXML.ЗаписатьТекст("8000");
					ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();							
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();	
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("FrontEndServer");
					ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("ip");
						ЗаписьНастройкиXML.ЗаписатьТекст("fes.it-lite.ru");
					ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();		
					ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("port");
						ЗаписьНастройкиXML.ЗаписатьТекст("44445");
					ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();							
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();				
			ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();    			
			
			// <!-- encoded login:password -->
			ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("AccountInfo");
				ЗаписьНастройкиXML.ЗаписатьТекст("login:password");
			ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
		
		ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
		ЗаписьНастройкиXML.Закрыть();	
	
	
		ПутьДоФайлаНастроекАплоадера = "" + ПутьДоАгента + "\config\uploader.xml";			
		ЗаписьНастройкиXML = Новый ЗаписьXML;
		ЗаписьНастройкиXML.ОткрытьФайл(ПутьДоФайлаНастроекАплоадера);
		ЗаписьНастройкиXML.ЗаписатьОбъявлениеXML();
		ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("ArchivingStorageSystemConfiguration");
			ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("Uploader");
			
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("Upload");				
					ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("MaxThreads"); // на каждые 320 мб может порождаться свой паралельный поток закачки. 0 кол во потоков вычисляется из размера файла				
						ЗаписьНастройкиXML.ЗаписатьТекст("4");  
					ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
					ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("MaxAttempts"); // колличество попыток для закачки каждого куска в 320mb				
						ЗаписьНастройкиXML.ЗаписатьТекст("5");  
					ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();					
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("NetworkOptions");				
					ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("ThreadCount");				
						ЗаписьНастройкиXML.ЗаписатьТекст("3");
					ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
					ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("InterruptTimeout");				
						ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("Milliseconds");				
							ЗаписьНастройкиXML.ЗаписатьТекст("10");
						ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();						
					ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
					ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("UseSelect");				
						ЗаписьНастройкиXML.ЗаписатьТекст("");
					ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
				
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("ThreadCount");				
					ЗаписьНастройкиXML.ЗаписатьТекст("3");
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
				
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("RequestTimeout");				
					ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("Minutes");				
						ЗаписьНастройкиXML.ЗаписатьТекст("1");
					ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();				
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
				
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("KeepConnectionTime");				
					ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("Seconds");				
						ЗаписьНастройкиXML.ЗаписатьТекст("20");
					ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();					
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();	
				
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("Security");				
					ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("CertificatePath");				
						ЗаписьНастройкиXML.ЗаписатьТекст("config/certificate.pem");
					ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();	
					ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("PrivateKeyPath");				
						ЗаписьНастройкиXML.ЗаписатьТекст("config/private_key.pem");
					ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();						
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();	
				
			ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
		ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
		ЗаписьНастройкиXML.Закрыть();
		
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		МассивОшибок = Новый Массив;
		Если НЕ Найти(ОписаниеОшибки,"Ошибка доступа к файлу") = 0 Тогда
			МассивОшибок.Добавить("Для настройки резервного копирования необходимо запустить 1С:Предприятие с административными правами.");	
		Иначе
			МассивОшибок.Добавить(ОписаниеОшибки);	
		КонецЕсли;
		Возврат Новый Структура("Результат,Ошибки",Истина,МассивОшибок);
	КонецПопытки;	
	
	Возврат Новый Структура("Результат,Ошибки",Ложь,Новый Массив);
	
КонецФункции

// Функция возвращает XML настроек агента в виде структуры
Функция		ПолучитьНастройкиАгента(ПутьДоАгента) 	Экспорт
	
	// Нет проверки, что такие файлы существуют
	
	НаВозврат = Новый Структура("backupagent,uploader",
								ЗаполнитьСтруктуруИзXML("" + ПутьДоАгента + "\config\BackupAgent.xml"),
								ЗаполнитьСтруктуруИзXML("" + ПутьДоАгента + "\config\uploader.xml")
								);
								
	Возврат НаВозврат;
	
КонецФункции

// Функция возвращает ошибку, если не удалось активировать подписку через агента с данных в параметрах
Функция		АктивироватьПодпискуЧерезАгента(ПутьДоАгента,Логин,КодДоступа)	Экспорт
	
	НаВозврат = Новый Структура("Результат,Ошибки",Ложь,Новый Массив());
	
	Попытка
		
		#Если не ВебКлиент Тогда
			Системнаяинформация = Новый Системнаяинформация;
			Если Системнаяинформация.ТипПлатформы = ТипПлатформы.Windows_x86 Или Системнаяинформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда 
				WshShell = Новый COMОбъект("Wscript.Shell"); 
				СтрокаВыполнения = "" + ПутьДоАгента + "\BackupAgent.exe -activate_account -login="+Логин+" -password="+КодДоступа+"";
				Процесс = WshShell.Exec(СтрокаВыполнения);		
				Результат = СТДПолучитьСообщениеУПроцесса(Процесс);		
				Ошибка = СТДПолучитьОшибкуУПроцесса(Процесс);
				КодВыхода = Процесс.ExitCode;
			КонецЕсли;
		#Конецесли	
		
	Исключение
		Результат = ""; Ошибка = ""; КодВыхода = ""; НеудачнаяПопытка = ОписаниеОшибки();
		Если НЕ Найти(НеудачнаяПопытка,"Запрошенная операция требует повышения") = 0 Тогда
			НаВозврат.Ошибки.Добавить("Для данной операции необходимо запустить 1С:Предприятие с правами администратора.");
			НаВозврат.Результат = Истина;
			Возврат НаВозврат;
		КонецЕсли;
	КонецПопытки;
	
	// Исправить по кодам возвратов
	Если СокрЛП(КодВыхода) = "4" Тогда
		НаВозврат.Ошибки.Добавить("Для указанных Логина / пароля активации нет свободных подписок сервиса.");
		НаВозврат.Результат = Истина;
		Возврат НаВозврат; 
	ИначеЕсли НЕ СокрЛП(КодВыхода) = "0" Тогда
		НаВозврат.Ошибки.Добавить("Не удалось выполнить активацию сервиса 1С:Облачный архив." + Символы.ПС + "Проверьте подключение к интернету, введенные данные и повторите попытку.");
		НаВозврат.Результат = Истина;
		Возврат НаВозврат; 
	КонецЕсли;
	
	Возврат НаВозврат;
	
КонецФункции

// + Функция возвращает путь к информационной базе
Функция		ПолучитьПутьКИнформационнойБазе()	Экспорт
	
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	
	// файловая система
	Если Лев(СтрокаСоединения,5) = "File=" Тогда
		СтрокаСоединения = Прав(СтрокаСоединения,СтрДлина(СтрокаСоединения) - 6);
		СтрокаСоединения = Лев(СтрокаСоединения,СтрДлина(СтрокаСоединения) - 2);
	КонецЕсли;
	
	Возврат СтрокаСоединения;
	
КонецФункции

// Функция возвращает структуру настройки копирования по входящим параметрам и сохраняет во временный файл
Функция		ПолучитьСтруктуруНастройкиКопированияИБ(ИДИнформационнойБазы,ПутьКИБ = Неопределено,НаименованиеИБ = Неопределено,Расписание = Неопределено)	Экспорт
	
	ПутьДоФайла = КаталогВременныхФайлов();
	Если Не Прав(ПутьДоФайла,1) = "\" Тогда
		ПутьДоФайла = ПутьДоФайла + "\"; 
	КонецЕсли;
	Папка = Новый Файл(ПутьДоФайла);
	
	НаВозврат = Новый Структура("Результат,Ошибка,Предупреждение",Новый Структура(),Новый Массив(),Новый Массив());	
	
	Если ПутьКИБ = Неопределено Тогда
		ПутьКИБ = ПолучитьПутьКИнформационнойБазе();
	КонецЕсли;
	
	Если НаименованиеИБ = Неопределено Тогда
		НаименованиеИБ = Метаданные.Синоним;
	КонецЕсли;
	
	Если Папка.Существует() И Папка.ЭтоКаталог() Тогда
		ИмяФайлаНастройки = "" + ПутьДоФайла + ИДИнформационнойБазы + ".xml"; 
		ФайлНастройки = Новый Файл(ИмяФайлаНастройки);
		
		Если ФайлНастройки.Существует() Тогда
			Попытка
				НаВозврат.Результат = ЗаполнитьСтруктуруИзXML(ИмяФайлаНастройки);
			Исключение
				НаВозврат.Результат = ПолучитьНастройкиКопированияИБПоУмолчанию(ИДИнформационнойБазы,ПутьКИБ,НаименованиеИБ,Расписание);
				ЗаписатьИзСтруктурыВXML(ИмяФайлаНастройки,НаВозврат.Результат);
				НаВозврат.Предупреждение.Добавить("Настройка копирования текущей ИБ имеет ошибки. Настройка исправлена." + Символы.ПС + ОписаниеОшибки());
			КонецПопытки;
		Иначе
			НаВозврат.Результат = ПолучитьНастройкиКопированияИБПоУмолчанию(ИДИнформационнойБазы,ПутьКИБ,НаименованиеИБ,Расписание);
			ЗаписатьИзСтруктурыВXML(ИмяФайлаНастройки,НаВозврат.Результат);
		КонецЕсли;		
	КонецЕсли;
	
	Если НЕ ПроверитьВалидностьНастройкиКопированияИБ(НаВозврат.Результат) Тогда
		НаВозврат.Предупреждение.Добавить("Настройка копирования текущей ИБ имеет ошибки. Настройка исправлена.");
		НаВозврат.Результат = ПолучитьНастройкиКопированияИБПоУмолчанию(ИДИнформационнойБазы,ПутьКИБ,НаименованиеИБ,Расписание);
		ЗаписатьИзСтруктурыВXML(ИмяФайлаНастройки,НаВозврат.Результат);
	КонецЕсли;	
	
	Возврат НаВозврат;
	
КонецФункции

// Функция возвращает структуру настроект со значениями по умолчанию или указанными в параметрах
Функция		ПолучитьНастройкиКопированияИБПоУмолчанию(ИДИнформационнойБазы,ПутьКИБ,НаименованиеИБ,ВремяКопирования = Неопределено) Экспорт

	// Не передаются настройки по ко ретеншену
	
	Если ВремяКопирования = Неопределено Тогда
		ВремяКопирования = Дата('00010101220000');
	КонецЕсли;
	
	СтруктураИзXML = Новый Структура("Элемент,Значение,Атрибуты,Строки","xml",,,Новый Структура());
	
	пСтрокаДерева = Новый Структура("Элемент,Значение,Атрибуты,Строки","DatabaseBackupConfiguration",,,Новый Структура());
	СтруктураИзXML.Строки.Вставить("DatabaseBackupConfiguration",пСтрокаДерева);
	
	ппСтрокаДерева = Новый Структура("Элемент,Значение,Атрибуты,Строки","Database",,,Новый Структура());
	пСтрокаДерева.Строки.Вставить("Database",ппСтрокаДерева);	
	пппСтрокаДерева = Новый Структура("Элемент,Значение,Атрибуты,Строки","DB_ID",ИДИнформационнойБазы,,Новый Структура());
	ппСтрокаДерева.Строки.Вставить("DB_ID",пппСтрокаДерева);	
	пппСтрокаДерева = Новый Структура("Элемент,Значение,Атрибуты,Строки","DBName",?(СокрЛП(НаименованиеИБ) = "","Информационная база",НаименованиеИБ),,Новый Структура());
	ппСтрокаДерева.Строки.Вставить("DBName",пппСтрокаДерева);		
	пппСтрокаДерева = Новый Структура("Элемент,Значение,Атрибуты,Строки","DBFolder",ПутьКИБ,,Новый Структура());
	ппСтрокаДерева.Строки.Вставить("DBFolder",пппСтрокаДерева);		
	
	ппСтрокаДерева = Новый Структура("Элемент,Значение,Атрибуты,Строки","Schedule",,,Новый Структура());
	пСтрокаДерева.Строки.Вставить("Schedule",ппСтрокаДерева);		
	пппСтрокаДерева = Новый Структура("Элемент,Значение,Атрибуты,Строки","Time",Формат((ВремяКопирования+24*3600)-(4*3600),"ДФ=""ЧЧ:мм:сс"""),,Новый Структура());
	ппСтрокаДерева.Строки.Вставить("Time",пппСтрокаДерева);		
	
	ппСтрокаДерева = Новый Структура("Элемент,Значение,Атрибуты,Строки","RetentionRule",,,Новый Структура());
	пСтрокаДерева.Строки.Вставить("RetentionRule",ппСтрокаДерева);			
	пппСтрокаДерева = Новый Структура("Элемент,Значение,Атрибуты,Строки","Daily","5",,Новый Структура());
	ппСтрокаДерева.Строки.Вставить("Daily",пппСтрокаДерева);	
	пппСтрокаДерева = Новый Структура("Элемент,Значение,Атрибуты,Строки","Weekly","3",,Новый Структура());
	ппСтрокаДерева.Строки.Вставить("Weekly",пппСтрокаДерева);		
	пппСтрокаДерева = Новый Структура("Элемент,Значение,Атрибуты,Строки","Monthly","2",,Новый Структура());
	ппСтрокаДерева.Строки.Вставить("Monthly",пппСтрокаДерева);		
	
	ппСтрокаДерева = Новый Структура("Элемент,Значение,Атрибуты,Строки","UseIt","0",,Новый Структура());
	пСтрокаДерева.Строки.Вставить("UseIt",ппСтрокаДерева); 	
	
	Возврат СтруктураИзXML;
		
КонецФункции

// Функция првоеряет правильность структуры настройки копирования и возвращает ложь/истина по результату
Функция		ПроверитьВалидностьНастройкиКопированияИБ(СтруктураНастройкиБэкапаИнфБазы)	Экспорт
	
	// Нет доп проверок на полное сотстветствие
	
	Если НЕ СтруктураНастройкиБэкапаИнфБазы.Свойство("Значение") ИЛИ НЕ СтруктураНастройкиБэкапаИнфБазы.Элемент = "xml" ИЛИ НЕ СтруктураНастройкиБэкапаИнфБазы.Свойство("Строки") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ СтруктураНастройкиБэкапаИнфБазы.Строки.DatabaseBackupConfiguration.Строки.Свойство("UseIt") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Функция обновляет расписание Агента по путям к настройке копирования ИБ
Функция		ОбновитьРасписаниеАгентаПоНастройкеКопированияИБ(ИДИнформационнойБазы,ПутьДоАгента)	Экспорт
	
	НаВозврат = Новый Структура("Результат,Ошибки",Ложь,Новый Массив());
	
 	ПутьДоФайла = КаталогВременныхФайлов();
	Если Не Прав(ПутьДоФайла,1) = "\" Тогда 
		ПутьДоФайла = ПутьДоФайла + "\"; 
	КонецЕсли;
	ИмяФайлаНастройки = "" + ПутьДоФайла + ИДИнформационнойБазы + ".xml"; 	
	
	Попытка
		
		#Если не ВебКлиент Тогда
			Системнаяинформация = Новый Системнаяинформация;
			Если Системнаяинформация.ТипПлатформы = ТипПлатформы.Windows_x86 Или Системнаяинформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда 
				
				WshShell = Новый COMОбъект("Wscript.Shell"); 
				СтрокаВыполнения = "" + ПутьДоАгента + "\BackupAgent.exe -update_task_config -path="+ИмяФайлаНастройки;
				Процесс = WshShell.Exec(СтрокаВыполнения);		
				Результат = СТДПолучитьСообщениеУПроцесса(Процесс);		
				Ошибка = СТДПолучитьОшибкуУПроцесса(Процесс);
				КодВыхода = Процесс.ExitCode;
			КонецЕсли;
		#Конецесли
		
	Исключение
		Результат = ""; Ошибка = ""; КодВыхода = ""; НеудачнаяПопытка = ОписаниеОшибки();
		
		Если НЕ Найти(НеудачнаяПопытка,"Запрошенная операция требует повышения") = 0 Тогда
			НаВозврат.Ошибки.Добавить("Для данной операции необходимо запустить 1С:Предприятие с правами администратора.");
			НаВозврат.Результат = Истина;
			Возврат НаВозврат;			
		КонецЕсли;
	КонецПопытки;
	
	НаВозврат.Результат = Ложь;
	Возврат НаВозврат;

КонецФункции

// + Функция сравнивает передаваемые версии и возвращает Ложь если не по формату или Разницу в версии в виде числа
Функция		СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
 
	Строка1 = ?(ПустаяСтрока(СтрокаВерсии1), "0.0.0.0", СтрокаВерсии1);
	Строка2 = ?(ПустаяСтрока(СтрокаВерсии2), "0.0.0.0", СтрокаВерсии2);
	Версия1 = РазложитьСтрокуВМассивПодстрок(Строка1, ".");
	Если Версия1.Количество() <> 4 Тогда
		Возврат Ложь;		
	КонецЕсли;
	Версия2 = РазложитьСтрокуВМассивПодстрок(Строка2, ".");
	Если Версия2.Количество() <> 4 Тогда
		Возврат Ложь;	
	КонецЕсли;

	Результат = 0;
	Для Разряд = 0 По 3 Цикл
		Попытка
			Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
			Если Результат <> 0 Тогда
				Возврат Результат;
			КонецЕсли;
		Исключение
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	Возврат Результат;
 
КонецФункции

// + Разбивает строку на несколько строк по разделителю. Разделитель может иметь любую длину.
//
// Параметры:
//  Строка                 - Строка - текст с разделителями;
//  Разделитель            - Строка - разделитель строк текста, минимум 1 символ;
//  ПропускатьПустыеСтроки - Булево - признак необходимости включения в результат пустых строк.
//    Если параметр не задан, то функция работает в режиме совместимости со своей предыдущей версией:
//     - для разделителя-пробела пустые строки не включаются в результат, для остальных разделителей пустые строки
//       включаются в результат.
//     - если параметр Строка не содержит значащих символов или не содержит ни одного символа (пустая строка), то в
//       случае разделителя-пробела результатом функции будет массив, содержащий одно значение "" (пустая строка), а
//       при других разделителях результатом функции будет пустой массив.
//
//
// Возвращаемое значение:
//  Массив - массив строк.
//
// Примеры:
//  РазложитьСтрокуВМассивПодстрок(",один,,два,", ",") - возвратит массив из 5 элементов, три из которых  - пустые строки;
//  РазложитьСтрокуВМассивПодстрок(",один,,два,", ",", Истина) - возвратит массив из двух элементов;
//  РазложитьСтрокуВМассивПодстрок(" один   два  ", " ") - возвратит массив из двух элементов;
//  РазложитьСтрокуВМассивПодстрок("") - возвратит пустой массив;
//  РазложитьСтрокуВМассивПодстрок("",,Ложь) - возвратит массив с одним элементом "" (пустой строкой);
//  РазложитьСтрокуВМассивПодстрок("", " ") - возвратит массив с одним элементом "" (пустой строкой);
//
Функция 	РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено) Экспорт
 
	Результат = Новый Массив;
	 
	// для обеспечения обратной совместимости
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;

	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;

	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Результат.Добавить(Строка);
	КонецЕсли;

	Возврат Результат;
 
КонецФункции

// + Функция возвращает Истина, если версия пригодна для работы обработки,
// И сообщение текстом, если не пригодна и какая минимальная
Функция		ПроверитьВерсиюПлатформы()	Экспорт
	
	РекомендуемаяВерсияПлатформы = "8.2.19.68";
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, РекомендуемаяВерсияПлатформы) >= 0 Тогда
		Возврат Истина;
	Иначе
		Возврат "Минимальная версия платформы 1С:Предприятие, при которой гарантируется корректная работа: " + РекомендуемаяВерсияПлатформы + ". Ваша версия платформы: " + СистемнаяИнформация.ВерсияПриложения + "."; 
	КонецЕсли;
	
КонецФункции	

// + Функция возвращает Истина, если версия не отличается от актуальной или сообщение об отличии
Функция		ПроверитьНаАктуальнуюВерсиюКонфигурации()	Экспорт

	Попытка
		ВерсияПодсистемы = "0.0.0.0";
		Выполнить("ВерсияПодсистемы = ОблачныйАрхивСервер.ПолучитьВерсиюПодсистемы();");
	Исключение
		Возврат Истина;
	КонецПопытки;  	
	
	Результат = ПолучитьДанныеПоHTTP("backup.1c.ru","cf/version.php");
	Если Результат = Ложь Тогда
		Возврат Истина;
	Иначе
		Версия = Лев(Результат,Найти(Результат,"</cur_version>") - 1);
		РекомендуемаяВерсия = Прав(Версия,СтрДлина(Версия) - Найти(Версия,"<cur_version>") - 12);
    КонецЕсли;
		
	Если СравнитьВерсии(ВерсияПодсистемы, РекомендуемаяВерсия) >= 0 Тогда
		Возврат Истина;
	Иначе
		Возврат "Версия подсистемы ""1С Облачный Архив"", встроенная в Вашу конфигурацию отличается от актуальной версии: " + РекомендуемаяВерсия + ". Ваша версия подсистемы: " + ВерсияПодсистемы + "." + Символы.ПС +
				"Рекомендуем обновить подсистему. Получить актуальную версию подсистемы можно по ссылке: http://backup.1C.ru/cf/Subsystem1CCloudBackup.zip" + Символы.ПС + 
				"Инструкцию по обновлению/установке можно получить по ссылке: http://backup.1C.ru/info/Instructions1CCloudBackup.docx"; 
	КонецЕсли;

КонецФункции

// + Функция возвращает Истина, если версия не отличается от актуальной или сообщение об отличии
Функция		ПроверитьНаАктуальнуюВерсиюОбработки()	Экспорт

	ВерсияОбработки = "1.0.0.0";
	
	Результат = ПолучитьДанныеПоHTTP("backup.1c.ru","/epf/version.php");
	Если Результат = Ложь Тогда
		Возврат Истина;
	Иначе
		Версия = Лев(Результат,Найти(Результат,"</cur_version>") - 1);
		РекомендуемаяВерсия = Прав(Версия,СтрДлина(Версия) - Найти(Версия,"<cur_version>") - 12);
    КонецЕсли;
	
	Если СравнитьВерсии(ВерсияОбработки, РекомендуемаяВерсия) >= 0 Тогда
		Возврат Истина;
	Иначе
		Возврат "Версия обработки ""1С Облачный Архив"", которую Вы сейчас используете отличается от актуальной: " + РекомендуемаяВерсия + ". Ваша версия обработки: " + ВерсияОбработки + "." + Символы.ПС +
				"Рекомендуем обновить обработку." + Символы.ПС + 
				"Инструкцию по обновлению/установке можно получить по ссылке: http://backup.1C.ru/info/Instructions1CCloudBackup.docx"; 
	КонецЕсли;

КонецФункции

// + Функция возвращает Истина, если версия не отличается от актуальной или сообщение об отличии
Функция		ПроверитьНаАктуальнуюВерсиюАгента()	Экспорт

	ВерсияАгента = "1.0.20.0";
	
	
	Результат = ПолучитьДанныеПоHTTP("backup.1c.ru","/agent/version.php");
	Если Результат = Ложь Тогда
		Возврат Истина;
	Иначе
		Версия = Лев(Результат,Найти(Результат,"</cur_version>") - 1);
		РекомендуемаяВерсия = Прав(Версия,СтрДлина(Версия) - Найти(Версия,"<cur_version>") - 12);
    КонецЕсли;
	
	Если СравнитьВерсии(ВерсияАгента, РекомендуемаяВерсия) >= 0 Тогда
		Возврат Истина;
	Иначе
		Возврат "Версия агента ""1С Облачный Архив"", которую Вы сейчас используете отличается от актуальной: " + РекомендуемаяВерсия + ". Ваша версия агента: " + ВерсияАгента + "." + Символы.ПС +
				"Рекомендуем обновить агента." + Символы.ПС + 
				"Инструкцию по обновлению/установке можно получить по ссылке: http://backup.1C.ru/info/Instructions1CCloudBackup.docx"; 
	КонецЕсли;

КонецФункции

// Функция получает по HTTP данные
Функция		ПолучитьДанныеПоHTTP(АдресРесурса,ПутьЗапроса)  Экспорт
	
	Ошибка = Ложь; НаВозврат = "";
	
	HTTPСоединение = Новый HTTPСоединение(АдресРесурса);
	// Не работает на 8.2.15 и ранних версиях, поэтому запускается так, чтобы при запуски и компиляции не выдавать ошибку.
	Попытка
		КодПолучения = "
						|HTTPЗапрос = Новый HTTPЗапрос(ПутьЗапроса);
						|Результат = HTTPСоединение.Получить(HTTPЗапрос);
						|НаВозврат = Результат.ПолучитьТелоКакСтроку();
						|";
		Выполнить(КодПолучения);
	Исключение
		Ошибка = Истина;
	КонецПопытки;
	
	Если НаВозврат = "" И Ошибка Тогда
		
		Попытка
			ВремФайл = КаталогВременныхФайлов() + "/ОтветОтСайта.txt";
			HTTPСоединение.Получить(ПутьЗапроса,ВремФайл);
			ЧтениеФайла = Новый ЧтениеТекста(ВремФайл);
			Стр = ЧтениеФайла.ПрочитатьСтроку(); Результат = "";
			Пока Стр <> Неопределено Цикл
				Результат = Результат + Символы.ПС + Стр;
			    Стр = ЧтениеФайла.ПрочитатьСтроку();
			КонецЦикла;	
		
		    НаВозврат = Результат;
			// Удаляем файл
			
		Исключение
			Ошибка = Истина;
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат ?(Ошибка ИЛИ СокрЛП(НаВозврат) = "",Ложь,НаВозврат); 		
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Работа с XML

// Процедура записывает НЕ произвольный набор (формат) ключей структуры
Процедура	ЗаписатьИзСтруктурыВXML(ПутьКФайлу,Структура)	Экспорт
	
	// НЕТ Исключения о недостаче прав к записи и прочее
	
	ЗаписьНастройкиXML = Новый ЗаписьXML;
		ЗаписьНастройкиXML.ОткрытьФайл(ПутьКФайлу);
		ЗаписьНастройкиXML.ЗаписатьОбъявлениеXML();
		ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("DatabaseBackupConfiguration");
		// Основное
			ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("Database");
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("DB_ID");
					ЗаписьНастройкиXML.ЗаписатьТекст(Структура.Строки.DatabaseBackupConfiguration.Строки.DataBase.Строки.DB_ID.Значение);
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("DBName");
					ЗаписьНастройкиXML.ЗаписатьТекст(Структура.Строки.DatabaseBackupConfiguration.Строки.DataBase.Строки.DBName.Значение);
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();				
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("DBFolder");
					ЗаписьНастройкиXML.ЗаписатьТекст(Структура.Строки.DatabaseBackupConfiguration.Строки.DataBase.Строки.DBFolder.Значение);
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();									
			ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
			
		// Расписание
			ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("Schedule");
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("Time");
					ЗаписьНастройкиXML.ЗаписатьТекст(Структура.Строки.DatabaseBackupConfiguration.Строки.Schedule.Строки.Time.Значение);
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();			
			ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
			
		// Расписание хранения
			ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("RetentionRule");
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("Daily");
					ЗаписьНастройкиXML.ЗаписатьТекст(СокрЛП(Структура.Строки.DatabaseBackupConfiguration.Строки.RetentionRule.Строки.Daily.Значение));
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();			
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("Weekly");
					ЗаписьНастройкиXML.ЗаписатьТекст(СокрЛП(Структура.Строки.DatabaseBackupConfiguration.Строки.RetentionRule.Строки.Weekly.Значение));
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();			
				ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("Monthly");
					ЗаписьНастройкиXML.ЗаписатьТекст(СокрЛП(Структура.Строки.DatabaseBackupConfiguration.Строки.RetentionRule.Строки.Monthly.Значение));
				ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();			
			ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
			
			ЗаписьНастройкиXML.ЗаписатьНачалоЭлемента("UseIt");
				ЗаписьНастройкиXML.ЗаписатьТекст(Структура.Строки.DatabaseBackupConfiguration.Строки.UseIt.Значение);
			ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();			
		ЗаписьНастройкиXML.ЗаписатьКонецЭлемента();
		
		ЗаписьНастройкиXML.Закрыть();
	
КонецПроцедуры

// Функция возвращает структуру со всеми значениями XML из файла по пути "ПутьКФайлу"
Функция 	ЗаполнитьСтруктуруИзXML(ПутьКФайлу)	Экспорт
	
	// Нет исключения и обработки ошибки в случае отсутствия доступа к файлу
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлу);
	
	СтруктураИзXML = Новый Структура("Элемент,Значение,Атрибуты,Строки","xml", , ,Новый Структура());
	ОбработатьВнутрилежащие(ЧтениеXML,СтруктураИзXML);
	
	ЧтениеXML.Закрыть();

	Возврат СтруктураИзXML;
	
КонецФункции

// + Процедура обрабатывает рекурсивно данные XML и добавляют в структуру "СтруктураXML" в элемент "Строки"
Процедура 	ОбработатьВнутрилежащие(ЧтениеXML,СтруктураXML)	Экспорт
 
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			пСТрока = Новый Структура("Элемент,Значение,Атрибуты,Строки",ЧтениеXML.Имя,"",,Новый Структура());
			СтруктураXML.Строки.Вставить(ЧтениеXML.Имя,пСтрока);			
			ОбработатьВнутрилежащие(ЧтениеXML,пСтрока);
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст И ЧтениеXML.ИмеетЗначение Тогда
			СтруктураXML.Значение = ЧтениеXML.Значение;
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Возврат;
		КонецЕсли;  
	КонецЦикла;
 
КонецПроцедуры

 
////////////////////////////////////////////////////////////////////////////////
// Работа с WSh Shell 

// + Функция возвращает сообщение выводимое в StdOut процесса после выполнения команды черз WSh Shell
Функция		СТДПолучитьСообщениеУПроцесса(Процесс)	Экспорт

	СТДСообщение = "";
	
	КолИтераций = 0;
	Пока НЕ Процесс.StdOut.AtEndOfStream Цикл КолИтераций = КолИтераций + 1; Если КолИтераций > 50 Тогда Прервать; КонецЕсли;
		СТДСообщение = СТДСообщение + Символы.ПС + Процесс.StdOut.ReadLine();
	КонецЦикла;
	
	Возврат СокрЛП(СТДСообщение);
	
КонецФункции

// + Функция возвращает ошибку процесса после выполнения команды черз WSh Shell
Функция		СТДПолучитьОшибкуУПроцесса(Процесс) Экспорт

	СТДСообщение = "";
	
	КолИтераций = 0;
	Пока НЕ Процесс.StdERR.AtEndOfStream Цикл КолИтераций = КолИтераций + 1; Если КолИтераций > 50 Тогда Прервать; КонецЕсли;
		СТДСообщение = СТДСообщение + Символы.ПС + Процесс.StdERR.ReadLine();
	КонецЦикла;
	
	Возврат СокрЛП(СТДСообщение);
	
КонецФункции

#КонецОбласти
