
#Область СлужебныйПрограммныйИнтерфейс

// Получить статью по умолчанию для указанного вида операции
Функция ПолучитьСтатьюПоУмолчаниюДляОперации(ВидОперации, ЭтоВзносАванса = Ложь) Экспорт	
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатьиДоходовИРасходов.Ссылка
	|ИЗ
	|	Справочник.СтатьиДоходовИРасходов КАК СтатьиДоходовИРасходов
	|ГДЕ
	|	СтатьиДоходовИРасходов.Предопределенный = ИСТИНА
	|	И СтатьиДоходовИРасходов.ПоУмолчаниюДляОперации = &ПоУмолчаниюДляОперации
	|	И ВЫБОР
	|			КОГДА &ПоУмолчаниюДляОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтКлиента)
	|				ТОГДА ВЫБОР
	|						КОГДА &ЭтоВзносАванса = ИСТИНА
	|							ТОГДА СтатьиДоходовИРасходов.Ссылка = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ВзносАвансаОтКлиента)
	|						ИНАЧЕ СтатьиДоходовИРасходов.Ссылка = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ОплатаОтКлиента)
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА &ПоУмолчаниюДляОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыКлиенту)
	|						ТОГДА ВЫБОР
	|								КОГДА &ЭтоВзносАванса = ИСТИНА
	|									ТОГДА СтатьиДоходовИРасходов.Ссылка = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ВозвратАвансаКлиенту)
	|								ИНАЧЕ СтатьиДоходовИРасходов.Ссылка = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ВозвратОплатыКлиенту)
	|							КОНЕЦ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		КОНЕЦ
	|	И СтатьиДоходовИРасходов.ПометкаУдаления = ЛОЖЬ");
	Запрос.УстановитьПараметр("ПоУмолчаниюДляОперации",ВидОперации);
	Запрос.УстановитьПараметр("ЭтоВзносАванса",ЭтоВзносАванса);
    РезВыборки = Запрос.Выполнить().Выбрать();
	
	Возврат ?(РезВыборки.Следующий(),РезВыборки.Ссылка,Неопределено);
КонецФункции

#КонецОбласти