#Область СобытияФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере"
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТипЗаменяемойСтроки"	 		, ТипЗаменяемойСтроки);
	Параметры.Свойство("ЗаменяемоеЗначение"		 		, ЗаменяемоеЗначение);
	Параметры.Свойство("ТипЗначенияЗамены"		 		, ТипЗначенияЗамены);
	Параметры.Свойство("ЗначениеЗамены"			 		, ЗначениеЗамены);
	Параметры.Свойство("ФорматЗначенияЗамены"	 		, ФорматЗначенияЗамены);
	Параметры.Свойство("ТипРеквизитаЗамены"		 		, ТипРеквизитаЗамены);
	Параметры.Свойство("ШаблонФайла"			 		, ШаблонФайла);
	Параметры.Свойство("КэшСписокаПолей"		 		, КэшСписокаПолей);
	Параметры.Свойство("ТипЗаменыПустогоЗначения"		, ТипЗаменыПустогоЗначения);
	Параметры.Свойство("ЗначениеЗаменыНезаполненного"	, ЗначениеЗаменыНезаполненного);
	Параметры.Свойство("КоличествоСимволовПрочерков" 	, КоличествоСимволовПрочерков);
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();

КонецПроцедуры

&НаКлиенте
// Процедура - При открытии
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаКлиенте 
// Процедура - Установить формат
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура УстановитьФормат(Команда)
	
	СтандартнаяОбработка 		= Ложь;
	Конструктор 				= Новый КонструкторФорматнойСтроки(ФорматЗначенияЗамены);
	Конструктор.ДоступныеТипы 	= Новый ОписаниеТипов(ТипРеквизитаЗамены);
	Конструктор.Показать(Новый ОписаниеОповещения("ФорматНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Конструктор", Конструктор)));

		
КонецПроцедуры

&НаКлиенте
// Процедура - Формат начало выбора завершение
//
// Параметры:
//  Текст					 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ФорматНачалоВыбораЗавершение(Текст, ДополнительныеПараметры) Экспорт
	
	Конструктор = ДополнительныеПараметры.Конструктор;
	Если Текст <> Неопределено Тогда
		ФорматЗначенияЗамены = Конструктор.Текст;
	КонецЕсли;

КонецПроцедуры // ФорматНачалоВыбора()

&НаКлиенте
// Процедура - Заменяемое значение начало выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеВыбора		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ЗаменяемоеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗаменяемойСтроки = Истина Тогда
		МассивПолей = ВернутьСписокПолейВФайле();
		ДанныеВыбора = Новый СписокЗначений();
		ДанныеВыбора.ЗагрузитьЗначения(МассивПолей);			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Установить видимость доступность элементов
//
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	Элементы.ЗаменяемоеЗначение.КнопкаВыбора = ?(ТипЗаменяемойСтроки = Ложь, Ложь, Истина);
	
	Элементы.ГруппаЗначениеЗаменыРеквизит.Видимость  = ?(ТипЗначенияЗамены = Ложь, Истина, Ложь);
	Элементы.ГруппаЗначениеЗаменыВыражение.Видимость = Не Элементы.ГруппаЗначениеЗаменыРеквизит.Видимость;
	
	Элементы.УстановитьФормат.Видимость = ?(ТипРеквизитаЗамены = "Дата" ИЛИ ТипРеквизитаЗамены = "Булево" ИЛИ ТипРеквизитаЗамены = "Число", Истина, Ложь);
	
	Элементы.ЗначениеЗаменыНезаполненного.Видимость = ТипЗаменыПустогоЗначения = Ложь;
	Элементы.КоличествоСимволовПрочерков.Видимость  = ТипЗаменыПустогоЗначения = Истина;
	
КонецПроцедуры

&НаКлиенте
 // Функция получает и возвращает список полей в файле.
//
Функция ВернутьСписокПолейВФайле(ИзКэша = Истина)
	
	СписокПолей = Новый Массив;
	
	Если ШаблонФайла.Пустая() Тогда
		Возврат СписокПолей;
	КонецЕсли;
	
	РасширениеФайла = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ШаблонФайла, "ТекущаяВерсияРасширение");
	ДвоичныеДанныеФайла = АвтозаполнениеШаблоновФайловСервер.ПолучитьДвоичныеДанныеФайла(ШаблонФайла);
	
	Если ИзКэша = Истина И КэшСписокаПолей.Количество() > 0 Тогда
		
		СписокПолей = КэшСписокаПолей.ВыгрузитьЗначения();
	
	ИначеЕсли РасширениеФайла = "odt" Тогда
		
		СписокПолей = АвтозаполнениеШаблоновФайловКлиент.НайтиВсеПоляВФайлеOpenOfficeWriter(РасширениеФайла, ДвоичныеДанныеФайла);
		
		КэшСписокаПолей.Очистить();
		КэшСписокаПолей.ЗагрузитьЗначения(СписокПолей);
		
	ИначеЕсли РасширениеФайла = "doc" ИЛИ РасширениеФайла = "dot" ИЛИ РасширениеФайла = "docx" ИЛИ РасширениеФайла = "dotx" Тогда
		
		СписокПолей = АвтозаполнениеШаблоновФайловКлиент.НайтиВсеПоляВФайлеMSWord(РасширениеФайла, ДвоичныеДанныеФайла);
		
		КэшСписокаПолей.Очистить();
		КэшСписокаПолей.ЗагрузитьЗначения(СписокПолей);
		
	КонецЕсли;
	
	Возврат СписокПолей;
	
КонецФункции

&НаКлиенте
// Процедура - Значение замены реквизит начало выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеВыбора		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ЗначениеЗаменыРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗначенияЗамены = Ложь Тогда
		ПараметрыФормы = Новый Структура("ЗначениеРеквизита, ТипВладелецаФайла", ЗначениеЗамены, Тип("ДокументСсылка.Договоры"));
		ОткрытьФорму("Справочник.ШаблоныДоговоров.Форма.ФормаВыбораРеквизита", ПараметрыФормы,,,,,Новый ОписаниеОповещения("ЗначениеЗаменыРеквизитНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ЗначениеЗаменыРеквизитНачалоВыбораЗавершение"
//
Процедура ЗначениеЗаменыРеквизитНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЗначениеЗамены = Результат.Значение;
		ТипРеквизитаЗамены = Результат.Тип;
		УстановитьВидимостьДоступностьЭлементов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Тип значения замены при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ТипЗначенияЗаменыПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Тип заменяемой строки при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ТипЗаменяемойСтрокиПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбрать
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Выбрать(Команда)
	
	Если НРег(Команда.Имя) = "ок" Тогда
		
		СтруктураВозврата = Новый Структура;

		СтруктураВозврата.Вставить("ТипЗаменяемойСтроки"	 		, ТипЗаменяемойСтроки);
		СтруктураВозврата.Вставить("ЗаменяемоеЗначение"		 		, ЗаменяемоеЗначение);
		СтруктураВозврата.Вставить("ТипЗначенияЗамены" 		 		, ТипЗначенияЗамены);
		СтруктураВозврата.Вставить("ЗначениеЗамены"			 		, ЗначениеЗамены);
		СтруктураВозврата.Вставить("ФорматЗначенияЗамены"	 		, ФорматЗначенияЗамены);
		СтруктураВозврата.Вставить("ТипРеквизитаЗамены"	 	 		, ТипРеквизитаЗамены);
		СтруктураВозврата.Вставить("КэшСписокаПолей"	 	 		, КэшСписокаПолей);
        СтруктураВозврата.Вставить("ТипЗаменыПустогоЗначения"		, ТипЗаменыПустогоЗначения);
		СтруктураВозврата.Вставить("ЗначениеЗаменыНезаполненного"	, ЗначениеЗаменыНезаполненного);
		СтруктураВозврата.Вставить("КоличествоСимволовПрочерков" 	, КоличествоСимволовПрочерков);
		Модифицированность = Ложь;
		ОповеститьОЗаписиНового(СтруктураВозврата);
		Закрыть(СтруктураВозврата);
	Иначе
		Модифицированность = Ложь;
		Закрыть(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗаменыПустогоЗначенияПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьЭлементов();	
	
КонецПроцедуры

#КонецОбласти