
 #Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтруктурнаяЕдиница") Тогда
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", Параметры.СтруктурнаяЕдиница, Истина, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;

    Если Параметры.Свойство("Контрагент") Тогда
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", Параметры.Контрагент, Истина, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;	
	
	// Прием, который не должен отображаться в форме выбора, т.к. из этого приема, делается рекламация.
	Если Параметры.Свойство("ПриемИсключение") Тогда
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Ссылка", Параметры.ПриемИсключение, Истина, ВидСравненияКомпоновкиДанных.НеРавно);
	КонецЕсли;
	
	// Приемы, которые не должны отображаться в форме выбора, отбор нужен для отображения приемов данные которых еще не были отображены в зубной формуле
	Если Параметры.Свойство("СписокПриемов") Тогда		
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Ссылка", Параметры.СписокПриемов, Истина, ВидСравненияКомпоновкиДанных.НеВСписке);
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
// Процедура печати.
//
Процедура ДокументПечать(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "Прием");	
	Структура.Вставить("МассивДокументов", Элементы.Список.ВыделенныеСтроки);
	Структура.Вставить("ТолькоПроведенныеДокументы", Истина);
	Структура.Вставить("Контрагент", Элементы.Список.ТекущиеДанные.Контрагент);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ОбработкаКоманды", УправлениеПечатьюКлиентСтоматология, Структура);									
	//ПоказатьВыборИзСписка(Оповещение, СписокПечатныхФорм, ТекущийЭлемент);
	ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, ТекущийЭлемент);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()
	Возврат Документы.Прием.ПолучитьСписокПечатныхФорм();	
КонецФункции

#КонецОбласти