
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, "При создании на сервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поле ввода "ОкончаниеСмены"
// 
Процедура ОкончаниеСменыПриИзменении(Элемент)
	
	Объект.НачалоСмены = НачалоДня(ТекущаяДата()) + (Объект.НачалоСмены - НачалоДня(Объект.НачалоСмены));
	Объект.ОкончаниеСмены = НачалоДня(ТекущаяДата()) + (Объект.ОкончаниеСмены - НачалоДня(Объект.ОкончаниеСмены));
	
	//Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Наименование = Формат(Объект.НачалоСмены,"ДФ=ЧЧ:мм; ДП=00:00") + " - " + Формат(Объект.ОкончаниеСмены,"ДФ=ЧЧ:мм; ДП=23:59");
	//КонецЕсли;
		  
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поле ввода "НачалоСмены"
//
Процедура НачалоСменыПриИзменении(Элемент)
	
	Объект.НачалоСмены = НачалоДня(ТекущаяДата()) + (Объект.НачалоСмены - НачалоДня(Объект.НачалоСмены));
	Объект.ОкончаниеСмены = НачалоДня(ТекущаяДата()) + (Объект.ОкончаниеСмены - НачалоДня(Объект.ОкончаниеСмены));
	
	//Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Наименование = Формат(Объект.НачалоСмены,"ДФ=ЧЧ:мм; ДП=00:00") + " - " + Формат(Объект.ОкончаниеСмены,"ДФ=ЧЧ:мм; ДП=23:59");
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбораИзСписка" поле ввода "НачалоСмены"
//
Процедура НачалоСменыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	СписокВеремени = ОбщегоНазначенияКлиентПовтИспСтоматология.ВыбратьСменуПоСтруктурнойЕдинице(СтандартнаяОбработка, Объект.СтруктурнаяЕдиница, Истина);
	
	Если СписокВеремени <> Неопределено Тогда
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("НачалоВыбораИзСпискаЗавершение", ЭтотОбъект, Новый Структура("Элемент, НачалоСмены", Элемент, Истина)), СписокВеремени, Элемент); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Начало смены начало выбора из списка завершение
//
// Параметры:
//  ВыбранноеВремя			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура НачалоВыбораИзСпискаЗавершение(ВыбранноеВремя, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	Если ДополнительныеПараметры.Свойство("НачалоСмены") Тогда
		Если ВыбранноеВремя <> Неопределено Тогда
			Объект.НачалоСмены = ВыбранноеВремя.Значение;
			НачалоСменыПриИзменении(Элемент);
		КонецЕсли;
	ИначеЕсли  ДополнительныеПараметры.Свойство("КонецСмены") Тогда
		
		Если ВыбранноеВремя.Значение = НачалоДня(ВыбранноеВремя.Значение) Тогда 
			ВыбранноеВремя.Значение = ВыбранноеВремя.Значение - 1;
		КонецЕсли;  		
		Объект.ОкончаниеСмены = ВыбранноеВремя.Значение;
		ОкончаниеСменыПриИзменении(Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбораИзСписка" поле ввода "ОкончаниеСмены"
//
Процедура ОкончаниеСменыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокВеремени = ОбщегоНазначенияКлиентПовтИспСтоматология.ВыбратьСменуПоСтруктурнойЕдинице(СтандартнаяОбработка, Объект.СтруктурнаяЕдиница, Ложь, Объект.НачалоСмены);
	
	Если СписокВеремени <> Неопределено Тогда
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("НачалоВыбораИзСпискаЗавершение", ЭтотОбъект, Новый Структура("Элемент, КонецСмены", Элемент, Истина)), СписокВеремени, Элемент);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти