#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСоздании(Отказ, СтандартнаяОбработка)
	Перем КлючТекущихНастроек;
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	
	ЕстьПравоИзменения  = ПравоДоступа("Добавление", Метаданные.Справочники.ВариантыОтчетов);
	ЕстьПравоДобавления = ПравоДоступа("Изменение", Метаданные.Справочники.ВариантыОтчетов);
	
	Элементы.ФормаДалее.Доступность = Истина;
	Элементы.ФормаНазад.Доступность = Ложь;
	
	
	ТипВариантаОтчета = Перечисления.ТипыВариантовОтчетов.Предопределенный;
	
	НовыеИлиСохранитьСуществ = 2;
	
	КлючОбъекта = Параметры.КлючОбъекта;                            
	КлючТекущихНастроек = Параметры.КлючТекущихНастроек;
	ТекущийПользователь = ОбщегоНазначения.ТекущийПользователь();
	
	ЗаполнитьСписок();
	
	СтрокиТаблицы = ВариантыОтчетовТ.НайтиСтроки(Новый Структура("КлючОбъекта", КлючТекущихНастроек));
	Если СтрокиТаблицы.Количество() > 0 тогда
		СтрокаСписка = СтрокиТаблицы[0];
		Описание = СтрокаСписка.Описание;
		
		ТЗ = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВариантыОтчетовПодсистемы.Подсистема,
		|	ВариантыОтчетовПодсистемы.Название,
		|	ВариантыОтчетовПодсистемы.Предопределенная,
		|	ВариантыОтчетовПодсистемы.Ссылка.ТипВариантаОтчета КАК ТипВариантаОтчета
		|ИЗ
		|	Справочник.ВариантыОтчетов.Подсистемы КАК ВариантыОтчетовПодсистемы
		|ГДЕ
		|	ВариантыОтчетовПодсистемы.Ссылка = &Вариант";
		
		Запрос = Новый Запрос(ТЗ);
		Запрос.УстановитьПараметр("Вариант", СтрокаСписка.Ссылка);
		УстановитьПривилегированныйРежим(истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(ложь);
		
		Пока Выборка.Следующий() Цикл
			СтрокаПодсистемы                 = Подсистемы.Добавить();
			СтрокаПодсистемы.Подсистема      = Выборка.Подсистема;
			СтрокаПодсистемы.Название        = Выборка.Название;
			СтрокаПодсистемы.Предопределенная = Выборка.Предопределенная;
		КонецЦикла;
		
		ТЗ = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВариантыОтчетовПодсистемы.Подсистема,
		|	ВариантыОтчетовПодсистемы.Название,
		|	ВариантыОтчетовПодсистемы.Предопределенная,
		|	ВариантыОтчетовПодсистемы.Ссылка.КлючОбъекта + ""\"" + ВариантыОтчетовПодсистемы.Ссылка.КлючВарианта КАК Ключ,
		|	ВариантыОтчетовПодсистемы.Ссылка.ТипВариантаОтчета КАК ТипВариантаОтчета
		|ИЗ
		|	Справочник.ВариантыОтчетов.Подсистемы КАК ВариантыОтчетовПодсистемы
		|ГДЕ
		|	ВариантыОтчетовПодсистемы.Ссылка.КлючОбъекта В(&КлючОбъекта)";
		
		Запрос = Новый Запрос(ТЗ);
		Запрос.УстановитьПараметр("КлючОбъекта", КлючОбъекта);
		УстановитьПривилегированныйРежим(истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(ложь);
		
		Пока Выборка.Следующий() Цикл
			СтрокаПодсистемы                       = ПодсистемыВариантов.Добавить();
			СтрокаПодсистемы.Подсистема            = Выборка.Подсистема;
			СтрокаПодсистемы.Название              = Выборка.Название;
			СтрокаПодсистемы.Предопределенная = Выборка.Предопределенная;
			СтрокаПодсистемы.Ключ                  = Выборка.Ключ;
		КонецЦикла;
		
		
		ТЗ = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВариантыОтчетовНастройкаВидимости.Пользователь,
		|	(НЕ ВариантыОтчетовНастройкаВидимости.Ссылка.Видимость) КАК Видимость,
		|	ВариантыОтчетовНастройкаВидимости.Ссылка.Видимость КАК ВидимостьОбщая,
		|	ВариантыОтчетовНастройкаВидимости.Ссылка.КлючОбъекта + ""\"" + ВариантыОтчетовНастройкаВидимости.Ссылка.КлючВарианта КАК Ключ
		|ИЗ
		|	Справочник.ВариантыОтчетов.НастройкаВидимости КАК ВариантыОтчетовНастройкаВидимости
		|ГДЕ
		|	ВариантыОтчетовНастройкаВидимости.Ссылка.КлючОбъекта В(&КлючОбъекта)";
		
		Запрос = Новый Запрос(ТЗ);
		Запрос.УстановитьПараметр("КлючОбъекта", КлючОбъекта);
		УстановитьПривилегированныйРежим(истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(ложь);
		
		Пока Выборка.Следующий() Цикл
			СтрокаПодсистемы              = ВидимостьНастройкиВариантов.Добавить();
			СтрокаПодсистемы.Пользователь = Выборка.Пользователь;
			СтрокаПодсистемы.Видимость    = Выборка.Видимость;
			СтрокаПодсистемы.Ключ         = Выборка.Ключ;
		КонецЦикла;
		
		Элементы.ВариантыОтчета.ТекущаяСтрока = СтрокаСписка.ПолучитьИдентификатор();
	КонецЕсли;
	
	ЗаполнитьПодсистемы();
	
	СтрокаУО = ЭтаФорма.УсловноеОформление.Элементы[0];
	
	ЗначениеОтбора = СтрокаУО.Отбор.Элементы[0];
	ЗначениеОтбора.ПравоеЗначение = ТекущийПользователь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьВидимостьВариантаУПользователя(Команда)
	
	СписокПользователей = Новый СписокЗначений;
	Для каждого СтрокаПользователь из НастройкаВидимости Цикл
		СписокПользователей.Добавить(СтрокаПользователь.Пользователь);
	КонецЦикла;
	ПараметрыФормы = Новый Структура("Пользователи", СписокПользователей);
	
	ОткрытьФорму("Справочник.ВариантыОтчетов.Форма.РедактированиеВидимости", ПараметрыФормы, ЭтаФорма,,,, 
	Новый ОписаниеОповещения("НастроитьВидимостьВариантаУПользователяЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьВариантаУПользователяЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат= Неопределено тогда
		Возврат;
	КонецЕсли;
	
	СписокПользователей = Результат.Пользователи;
	
	НастройкаВидимости.Очистить();
	
	Для каждого ЭлементПользователи из СписокПользователей Цикл
		СтрокаПользователи              = НастройкаВидимости.Добавить();
		СтрокаПользователи.Пользователь = ЭлементПользователи.Значение;
		СтрокаПользователи.Видимость    = Истина;
	КонецЦикла;
	
	Элементы.Использование.Заголовок = ОписаниеПользователей();
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	Если НовыеИлиСохранитьСуществ = 2 тогда
		НастройкаВидимости.Очистить();
		Видимость = Ложь;
		Описание = "";
		Автор = ТекущийПользователь; 
		СтрокаПользователя              = НастройкаВидимости.Добавить();
		СтрокаПользователя.Пользователь = ТекущийПользователь;
		СтрокаПользователя.Видимость    = истина;
		Подсистемы.Очистить();
		Для каждого СтрокаПодсистемы из ДеревоПодсистем.ПолучитьЭлементы() Цикл
			СтрокаПодсистемы.Использование = СтрокаПодсистемы.Предопределенная;
			УстановитьГруппировкуПоУмолчанию(СтрокаПодсистемы, истина);
			Если СтрокаПодсистемы.Использование тогда
				СтрокаПодсистем = Подсистемы.Добавить();
				СтрокаПодсистем.Подсистема = СтрокаПодсистемы.ПутьКПодсистеме;
				СтрокаПодсистем.Название = СтрокаПодсистемы.Название;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли НовыеИлиСохранитьСуществ = 1 тогда
		ИмяСохраняемойНастройки = Элементы.ВариантыОтчета.ТекущиеДанные.Представление;
		Описание                = Элементы.ВариантыОтчета.ТекущиеДанные.Описание;
		Автор                   = Элементы.ВариантыОтчета.ТекущиеДанные.Ответственный;
		Вариант                 = Элементы.ВариантыОтчета.ТекущиеДанные.Ссылка;
		Если ТипВариантаОтчета = Элементы.ВариантыОтчета.ТекущиеДанные.ТипВариантаОтчета тогда
			Элементы.Описание.ТолькоПросмотр = Истина;
		КонецЕсли;
		
		Подсистемы.Очистить();
		
		// устновить текущих пользователей
		Видимость = Элементы.ВариантыОтчета.ТекущиеДанные.Видимость;
		Для каждого СтрокаПодсистемы из ДеревоПодсистем.ПолучитьЭлементы() Цикл
			МассивСтрок = ПодсистемыВариантов.НайтиСтроки(Новый Структура("Ключ, Подсистема", Элементы.ВариантыОтчета.ТекущиеДанные.КлючОбъекта, СтрокаПодсистемы.ПутьКПодсистеме));
			Если МассивСтрок.Количество() > 0 тогда
				СтрокаПодсистемы.Использование = истина;
			КонецЕсли;
			УстановитьГруппировкуПоУмолчанию(СтрокаПодсистемы, ложь);
		КонецЦикла;
		
		МассивСтрок = ВидимостьНастройкиВариантов.НайтиСтроки(Новый Структура("Ключ", КлючОбъекта + "\" + Элементы.ВариантыОтчета.ТекущиеДанные.КлючОбъекта));
		
		НастройкаВидимости.Очистить();
		
		Для каждого СтрокаПользователя из МассивСтрок Цикл
			НоваяСтрока              = НастройкаВидимости.Добавить();
			НоваяСтрока.Пользователь = СтрокаПользователя.Пользователь;
			НоваяСтрока.Видимость    = НЕ Видимость;
		КонецЦикла;
		
		
		
	КонецЕсли;
	
	Элементы.Конструктор.ТекущаяСтраница = Элементы.Новый;
	Элементы.ФормаДалее.Доступность  = Ложь;
	Элементы.ФормаНазад.Доступность  = Истина;
	Элементы.ФормаГотово.Доступность = Истина;
	
	Элементы.Подсистемы.Заголовок = ОписаниеПодсистем();
	Элементы.Использование.Заголовок = ОписаниеПользователей();
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	Элементы.Конструктор.ТекущаяСтраница = Элементы.СохранениеСущ;
	Элементы.ФормаДалее.Доступность = Истина;
	Элементы.ФормаНазад.Доступность = Ложь;
	Элементы.Описание.ТолькоПросмотр = ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	СохранитьВыполнить();	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПодсистемы(Команда)
	
	ПараметрыФормы = Новый Структура("ДеревоПодсистем, НовыйЭлементСправочника", ДеревоПодсистем,  НовыеИлиСохранитьСуществ = 2);
	
	ОткрытьФорму("Справочник.ВариантыОтчетов.Форма.РедактированиеПодсистемы", ПараметрыФормы, ЭтаФорма,,,, Новый ОписаниеОповещения("НастроитьПодсистемыЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПодсистемыЗавершение(ВозвращаемыеПараметры, ДополнительныеПараметры) Экспорт
	
	Если ВозвращаемыеПараметры <> Неопределено тогда
		Подсистемы.Очистить();
		Для каждого ОписаниеПодсистема из ВозвращаемыеПараметры.СписокПодсистем Цикл
			СтрокаПодсистемы = Подсистемы.Добавить();
			СтрокаПодсистемы.Подсистема            = ОписаниеПодсистема.Подсистема;
			СтрокаПодсистемы.Название              = ОписаниеПодсистема.Название;
			СтрокаПодсистемы.Предопределенная = ОписаниеПодсистема.Предопределенная;
		КонецЦикла;
		
		Элементы.Подсистемы.Заголовок = ОписаниеПодсистем();
		
		ПоместитьДеревоЗначенийВформу(ВозвращаемыеПараметры.ДеревоПодсистем);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НовыеИлиСохранитьСуществПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ВариантыОтчета.ТекущиеДанные;
	Если НовыеИлиСохранитьСуществ = 1 Тогда
		Если ТекущиеДанные <> Неопределено тогда
			Если ТекущийПользователь <> ТекущиеДанные.Ответственный тогда
				Элементы.ФормаГотово.Доступность = ложь;
				Элементы.ФормаДалее.Доступность = ложь;
			Иначе
				Элементы.ФормаГотово.Доступность = Истина;
				Элементы.ФормаДалее.Доступность = истина;
			КонецЕсли;
			Элементы.ВариантыОтчета.Доступность = истина;
		Иначе
			Элементы.ФормаГотово.Доступность    = ложь;
			Элементы.ФормаДалее.Доступность     = ложь;
			Элементы.ВариантыОтчета.Доступность = ложь;
		КонецЕсли;
	Иначе
		Элементы.ФормаГотово.Доступность    = ложь;
		Элементы.ФормаДалее.Доступность     = истина;
		Элементы.ВариантыОтчета.Доступность = ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВариантыОтчетаПриАктивизацииСтроки(Элемент)
	Если Элементы.Конструктор.ТекущаяСтраница = Элементы.Новый тогда
		Возврат;
	КонецЕсли;
	Если НовыеИлиСохранитьСуществ = 1 Тогда
		Если Элемент.ТекущиеДанные <> Неопределено тогда
			Если ТекущийПользователь <> Элемент.ТекущиеДанные.Ответственный тогда
				Элементы.ФормаГотово.Доступность = ложь;
				Элементы.ФормаДалее.Доступность = ложь;
			Иначе
				Элементы.ФормаГотово.Доступность = истина;
				Элементы.ФормаДалее.Доступность = истина;
			КонецЕсли;
		Иначе
			Элементы.ФормаГотово.Доступность    = ложь;
			Элементы.ФормаДалее.Доступность     = ложь;
			Элементы.ВариантыОтчета.Доступность = ложь;
		КонецЕсли;
	Иначе
		Элементы.ФормаГотово.Доступность = ложь;
		Элементы.ФормаДалее.Доступность = истина;
		ВариантыОтчетаОбработчикАктивизацииСтроки(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыОтчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СохранитьВыполнить();	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СохранитьВыполнить()
	
	Если ИмяСохраняемойНастройки = "" тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не задано название варианта отчета.'"), ,"НазваниеВараинтаОтчета");
		Возврат;
	КонецЕсли;
	// Еще не было настройки с таким именем - сделаем новую
	КодСохраняемойНастройки = СоздатьНовуюНастройку(ИмяСохраняемойНастройки);
	Если КодСохраняемойНастройки = Неопределено тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Вам запрещено сохранять свои варианты отчета.'"));
		Возврат;
	КонецЕсли;
	Оповестить("ОбновитьПанельОтчетов", , ЭтаФорма);
	Закрыть(Новый ВыборНастроек(КодСохраняемойНастройки));
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьДеревоЗначенийВформу(ДеревоПодсистем)
	
	ДеревоПодсистемЗначение = ДанныеФормыВЗначение(ДеревоПодсистем, Тип("ДеревоЗначений"));
	ЗначениеВРеквизитФормы(ДеревоПодсистемЗначение, "ДеревоПодсистем");
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьСвободноеНаименование(Вариант, ВариантыОтчета)
	ШаблонИмениВарианта = СокрЛП(Вариант.Представление) +" - "+ НСтр("ru = 'копия'");
	
	СвободноеНаименование = ШаблонИмениВарианта;
	Найденные = ВариантыОтчета.НайтиСтроки(Новый Структура("Представление", СвободноеНаименование));
	Если Найденные.Количество() = 0 Тогда
		Возврат СвободноеНаименование;
	КонецЕсли;
	
	НомерВарианта = 1;
	Пока Истина Цикл
		НомерВарианта = НомерВарианта + 1;
		СвободноеНаименование = ШаблонИмениВарианта +" (" + Формат(НомерВарианта, "") + ")";
		Найденные = ВариантыОтчета.НайтиСтроки(Новый Структура("Представление", СвободноеНаименование));
		Если Найденные.Количество() = 0 Тогда
			Возврат СвободноеНаименование;
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаКлиенте
Функция ОписаниеПользователей()
	
	ОписаниеПользователя = "";
	Для каждого СтрокаПользователя из НастройкаВидимости Цикл
		ОписаниеПользователя = ОписаниеПользователя + СтрокаПользователя.Пользователь + ", ";
	КонецЦикла;
	ОписаниеПользователя = Лев(ОписаниеПользователя, СтрДлина(ОписаниеПользователя)-2);
	
	Возврат ОписаниеПользователя;
	
КонецФункции

&НаКлиенте
Функция ОписаниеПодсистем()
	
	СписокПодсистем = "";
	
	Для каждого Подсистема из Подсистемы Цикл
		СписокПодсистем = СписокПодсистем + Подсистема.Название + ", ";
	КонецЦикла;
	
	Возврат Лев(СписокПодсистем, СтрДлина(СписокПодсистем)-2)
	
КонецФункции

&НаКлиенте
Процедура УстановитьГруппировкуПоУмолчанию(СтрокаПодсистемы, Предопределенная = истина)
	
	Для каждого СтрокаПодсистемыПодчиненной из СтрокаПодсистемы.ПолучитьЭлементы() Цикл
		Если НЕ Предопределенная тогда
			МассивСтрок = ПодсистемыВариантов.НайтиСтроки(Новый Структура("Ключ, Подсистема", Элементы.ВариантыОтчета.ТекущиеДанные.КлючОбъекта, СтрокаПодсистемы.ПутьКПодсистеме));
			Если МассивСтрок.Количество() > 0 тогда
				СтрокаПодсистемыПодчиненной.Использование = истина;
			КонецЕсли;
		Иначе
			СтрокаПодсистемыПодчиненной.Использование = СтрокаПодсистемыПодчиненной.Предопределенная;
		КонецЕсли;
		Если СтрокаПодсистемыПодчиненной.Использование тогда
			СтрокаПодсистем = Подсистемы.Добавить();
			СтрокаПодсистем.Подсистема = СтрокаПодсистемыПодчиненной.ПутьКПодсистеме;
			СтрокаПодсистем.Название = СтрокаПодсистемыПодчиненной.Название;
			СтрокаПодсистем.Предопределенная = СтрокаПодсистемыПодчиненной.Предопределенная;
		КонецЕсли;
		
		УстановитьГруппировкуПоУмолчанию(СтрокаПодсистемыПодчиненной);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодсистемы()
	
	Для каждого Подсистема из Метаданные.Подсистемы Цикл
		
		Если Не Подсистема.ВключатьВКомандныйИнтерфейс тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПодсистемы = ДеревоПодсистем.ПолучитьЭлементы().Добавить();
		
		СтрокаПодсистемы.ПутьКПодсистеме = Подсистема.Имя;
		СтрокаПодсистемы.Название        = Подсистема.Синоним;
		
		МассивСтрок                    = Подсистемы.НайтиСтроки(Новый Структура("Подсистема", СтрокаПодсистемы.ПутьКПодсистеме));
		СтрокаПодсистемы.Использование = МассивСтрок.Количество() > 0;
		Если СтрокаПодсистемы.Использование тогда
			СтрокаПодсистемы.Предопределенная = МассивСтрок[0].Предопределенная;
		КонецЕсли;
		
		ДобавитьДеревоПодсистем(Подсистема, СтрокаПодсистемы);
		
	КонецЦикла;
	
	ВиртуальныеПодсистемы = ВариантыОтчетов.ПолучитьВиртуальныеПодсистемы(Подсистема);
	
	Для каждого Подсистема из ВиртуальныеПодсистемы Цикл
		
		СтрокаПодсистемы = ДеревоПодсистем.Строки.Добавить();
		
		СтрокаПодсистемы.ПутьКПодсистеме = Подсистема.Значение;
		СтрокаПодсистемы.Название        = Подсистема.Представлени;
		
		МассивСтрок                    = Подсистемы.НайтиСтроки(Новый Структура("Подсистема", Подсистема.Значение));
		СтрокаПодсистемы.Использование = МассивСтрок.Количество() > 0;
		Если СтрокаПодсистемы.Использование тогда
			СтрокаПодсистемы.Предопределенная = МассивСтрок[0].Предопределенная;
		КонецЕсли;
		
		ДобавитьДеревоВиртуальныхПодсистем(Подсистема.Значение, СтрокаПодсистемы);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьДеревоПодсистем(Подсистема, СтрокаПодсистемы)
	
	Для каждого ПодсистемаПодчиненная из Подсистема.Подсистемы Цикл
		
		Если Не ПодсистемаПодчиненная.ВключатьВКомандныйИнтерфейс тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПодсистемыПодчиненой               = СтрокаПодсистемы.ПолучитьЭлементы().Добавить();
		СтрокаПодсистемыПодчиненой.Название      = ПодсистемаПодчиненная.Синоним;
		МассивСтрок                              = Подсистемы.НайтиСтроки(Новый Структура("Подсистема", СтрокаПодсистемы.ПутьКПодсистеме + "\" + ПодсистемаПодчиненная.Имя));
		СтрокаПодсистемыПодчиненой.Использование = МассивСтрок.Количество() > 0;
		Если СтрокаПодсистемыПодчиненой.Использование тогда
			СтрокаПодсистемыПодчиненой.Предопределенная = МассивСтрок[0].Предопределенная;
		КонецЕсли;
		СтрокаПодсистемыПодчиненой.ПутьКПодсистеме = СтрокаПодсистемы.ПутьКПодсистеме + "\" + ПодсистемаПодчиненная.Имя;
		ДобавитьДеревоПодсистем(ПодсистемаПодчиненная, СтрокаПодсистемыПодчиненой);
		
	КонецЦикла;
	
	ВиртуальныеПодсистемы = ВариантыОтчетов.ПолучитьВиртуальныеПодсистемы(СтрокаПодсистемы.ПутьКПодсистеме);
	
	Для каждого ПодсистемаПодчиненная из ВиртуальныеПодсистемы Цикл
		
		СтрокаПодсистемыПодчиненой               = СтрокаПодсистемы.ПолучитьЭлементы().Добавить();
		СтрокаПодсистемыПодчиненой.Название      = ПодсистемаПодчиненная.Представление;
		МассивСтрок                              = Подсистемы.НайтиСтроки(Новый Структура("Подсистема", ПодсистемаПодчиненная.Значение));
		СтрокаПодсистемыПодчиненой.Использование = МассивСтрок.Количество() > 0;
		Если СтрокаПодсистемыПодчиненой.Использование тогда
			СтрокаПодсистемыПодчиненой.Предопределенная = МассивСтрок[0].Предопределенная;
		КонецЕсли;
		СтрокаПодсистемыПодчиненой.ПутьКПодсистеме = ПодсистемаПодчиненная.Значение;
		ДобавитьДеревоВиртуальныхПодсистем(ПодсистемаПодчиненная.Значение, СтрокаПодсистемыПодчиненой);
		
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьДеревоВиртуальныхПодсистем(Подсистема, СтрокаПодсистемы)
	
	ВиртуальныеПодсистемы = ВариантыОтчетов.ПолучитьВиртуальныеПодсистемы(Подсистема);
	
	Для каждого ПодсистемаПодчиненная из ВиртуальныеПодсистемы Цикл
		
		СтрокаПодсистемыПодчиненой               = СтрокаПодсистемы.ПолучитьЭлементы().Добавить();
		СтрокаПодсистемыПодчиненой.Название      = ПодсистемаПодчиненная.Представление;
		МассивСтрок                              = Подсистемы.НайтиСтроки(Новый Структура("Подсистема", ПодсистемаПодчиненная.Значение));
		СтрокаПодсистемыПодчиненой.Использование = МассивСтрок.Количество() > 0;
		Если СтрокаПодсистемыПодчиненой.Использование тогда
			СтрокаПодсистемыПодчиненой.Предопределенная = МассивСтрок[0].Предопределенная;
		КонецЕсли;
		СтрокаПодсистемыПодчиненой.ПутьКПодсистеме = ПодсистемаПодчиненная.Значение;
		ДобавитьДеревоВиртуальныхПодсистем(ПодсистемаПодчиненная.Значение, СтрокаПодсистемыПодчиненой);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВариантыОтчета.Ссылка КАК Ссылка,
	|	ВариантыОтчета.Наименование КАК Наименование,
	|	ВариантыОтчета.КлючОбъекта,
	|	ВариантыОтчета.Администратор,
	|	ВариантыОтчета.Администратор.Наименование КАК ОтветственныйПредставление,
	|	ВариантыОтчета.КлючВарианта,
	|	ПОДСТРОКА(ВариантыОтчета.Описание, 0, 1000) КАК Описание,
	|	ВариантыОтчета.Видимость КАК Видимость,
	|	ВариантыОтчета.ТипВариантаОтчета
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК ВариантыОтчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыОтчетов.Подсистемы КАК ВариантыОтчетаПодсистемы
	|	ПО ВариантыОтчетаПодсистемы.Ссылка = ВариантыОтчета.Ссылка
	|
	|ГДЕ
	|	ВариантыОтчета.КлючОбъекта = &КлючОбъекта
	|	И НЕ ВариантыОтчета.ПометкаУдаления
	|	И (НЕ ВариантыОтчетаПодсистемы.Подсистема ЕСТЬ NULL
	|		ИЛИ ВариантыОтчета.ТипВариантаОтчета = ЗНАЧЕНИЕ(Перечисление.ТипыВариантовОтчетов.ВнешнийОтчет)
	|		ИЛИ ВариантыОтчета.ТипВариантаОтчета = ЗНАЧЕНИЕ(Перечисление.ТипыВариантовОтчетов.Предопределенный)
	|		)
	|";
	
	Если ЕстьПравоИзменения и НЕ ЕстьПравоДобавления тогда
		Запрос.Текст = Запрос.Текст + " И (ВариантыОтчета.Администратор = &Пользователь)";
		Запрос.Параметры.Вставить("Пользователь", ТекущийПользователь);
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО ВариантыОтчета.Наименование";
	
	Запрос.Параметры.Вставить("КлючОбъекта", КлючОбъекта);
	
	УстановитьПривилегированныйРежим(истина);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	УстановитьПривилегированныйРежим(ложь);
	
	ВариантыОтчетовТ.Очистить();
	Пока Выборка.Следующий() Цикл
		Строкаварианта               	 = ВариантыОтчетовТ.Добавить();
		Строкаварианта.КлючОбъекта  	 = Выборка.КлючВарианта;
		Строкаварианта.Представление	 = Выборка.Наименование;
		Строкаварианта.Ответственный  	 = Выборка.Администратор;
		Строкаварианта.Ссылка        	 = Выборка.Ссылка;
		Строкаварианта.Описание      	 = Выборка.Описание;
		Строкаварианта.Видимость     	 = Выборка.Видимость;
		Строкаварианта.ТипВариантаОтчета = Выборка.ТипВариантаОтчета;
		Строкаварианта.ОтветственныйПредставление = Выборка.ОтветственныйПредставление;
	КонецЦикла;                                                       
	
	ВариантыОтчетовТ.Сортировать("Представление");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВариантыОтчетаОбработчикАктивизацииСтроки(ЭтаФорма)
	Вариант = ЭтаФорма.ВариантыОтчетовТ.НайтиПоИдентификатору(ЭтаФорма.Элементы.ВариантыОтчета.ТекущаяСтрока);
	Если Вариант = Неопределено Тогда
		Возврат;
	КонецЕсли;
	НовоеНазвание = СформироватьСвободноеНаименование(Вариант, ЭтаФорма.ВариантыОтчетовТ);
	ЭтаФорма.ИмяСохраняемойНастройки = НовоеНазвание;
КонецПроцедуры

&НаСервере
Функция СоздатьНовуюНастройку(ИмяНастройки)
	
	ИмяОтчета = СтрЗаменить(КлючОбъекта, "Отчет.", "");
	МетаданныеОтчета = Метаданные.Отчеты.Найти(ИмяОтчета);
	
	ЭтоВнешнийОтчет = (МетаданныеОтчета = Неопределено);
	
	УстановитьПривилегированныйРежим(истина);
	Элемент = Справочники.ВариантыОтчетов.СоздатьЭлемент();
	Элемент.Наименование      = ИмяНастройки;
	Элемент.Описание          = Описание;
	Элемент.Администратор     = Автор;
	Элемент.КлючОбъекта       = КлючОбъекта;
	Элемент.КлючВарианта      = Строка(Новый УникальныйИдентификатор());
	Элемент.ТипВариантаОтчета = ?(ЭтоВнешнийОтчет, Перечисления.ТипыВариантовОтчетов.ВнешнийОтчет, Перечисления.ТипыВариантовОтчетов.Пользовательский);
	
	Если Не ЭтоВнешнийОтчет тогда
		Элемент.ПредставлениеОбъекта = МетаданныеОтчета.Синоним;
	КонецЕсли;
	
	Для каждого ЭлементПользователи из НастройкаВидимости Цикл
		СтрокаПользователи           = Элемент.НастройкаВидимости.Добавить();
		СтрокаПользователи.Пользователь      = ЭлементПользователи.Пользователь;
	КонецЦикла;
	
	Элемент.Подсистемы.Очистить();
	Для каждого ЭлементПользователи из Подсистемы Цикл
		СтрокаПользователи                 = Элемент.Подсистемы.Добавить();
		СтрокаПользователи.Подсистема      = ЭлементПользователи.Подсистема;
		СтрокаПользователи.Название        = ЭлементПользователи.Название;
		СтрокаПользователи.Предопределенная = ЭлементПользователи.Предопределенная;
	КонецЦикла;
	
	Элемент.Записать();
	Возврат Элемент.КлючВарианта;
	
КонецФункции

#КонецОбласти

