
#Область ПрограммныйИнтерфейс

// Функция - Параметры кассовго сервера
// 
// Возвращаемое значение:
//   - 
//
Функция ПараметрыКассовогоСервера(Организация = Неопределено) Экспорт
	
	мКассовыйСервер = ИспользуемыйВСистемеКассовыйСервер(Организация); 
	Если мКассовыйСервер <> Неопределено Тогда
		Возврат МенеджерОборудованияВызовСервера.ПолучитьПараметрыУстройства(мКассовыйСервер);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить используемый в системе сервис рекурр платежей
// 
// Возвращаемое значение:
//   - 
//
Функция ИспользуемыйВСистемеКассовыйСервер(Организация = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодключаемоеОборудование.Ссылка КАК Ссылка,
	|	ПодключаемоеОборудование.Организация КАК Организация
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ККТ)
	|	И ПодключаемоеОборудование.УстройствоИспользуется
	|	И ПодключаемоеОборудование.ДрайверОборудования.ИмяПредопределенныхДанных = ""ДрайверКассовогоСервера""
	|	И НЕ ПодключаемоеОборудование.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &РабочееМесто <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ПодключаемоеОборудование.РабочееМесто = &РабочееМесто
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ");   	
	
	// доработка Юля
	Запрос.УстановитьПараметр("РабочееМесто", ?(ЗначениеЗаполнено(Организация), Неопределено, ПараметрыСеанса.РабочееМестоКлиента));
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Организация = Организация Тогда
				Возврат Выборка.Ссылка;
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат Неопределено;
		
	Иначе
		// к одному рабочему месту может быть привязан один кассовый сервер
		Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	КонецЕсли;
	
КонецФункции

// Функция - Получить кассовый сервер по кассе.
//
// Параметры:
//  КассаОплаты	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКассовыйСерверПоКассе(КассаОплаты) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодключаемоеОборудование.Ссылка КАК КассовыйСервер,
	|	ПодключаемоеОборудование.Параметры КАК Параметры
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	НЕ ПодключаемоеОборудование.ПометкаУдаления
	|	И ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ККТ)
	|	И ПодключаемоеОборудование.УстройствоИспользуется
	|	И ПодключаемоеОборудование.ДрайверОборудования.ИмяПредопределенныхДанных = ""ДрайверКассовогоСервера""");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыСервера = Выборка.Параметры.Получить();
		
		Если ПараметрыСервера.Свойство("КассаОплаты")
			И ПараметрыСервера.КассаОплаты = КассаОплаты Тогда
			
			Возврат Выборка.КассовыйСервер;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Функция - Получить рабочее место кассового сервера
//
// Параметры:
//  ИдентификаторУстройства	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьРабочееМестоКассовогоСервера() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодключаемоеОборудование.РабочееМесто КАК РабочееМесто
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ККТ)
	|	И ПодключаемоеОборудование.ДрайверОборудования.ИмяПредопределенныхДанных = ""ДрайверКассовогоСервера""
	|	И ПодключаемоеОборудование.УстройствоИспользуется = ИСТИНА");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.РабочееМесто, Неопределено);
	
КонецФункции

// Функция - Это пользователь кассового сервера
//
// Параметры:
//  Пользователь - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЭтоПользовательКассовогоСервера(Пользователь) Экспорт
	
	ПараметрыКассвогоСервера = ПараметрыКассовогоСервера();
	
	Возврат ПараметрыКассвогоСервера <> Неопределено
	    И ПараметрыКассвогоСервера.Свойство("Пользователь")
		И ПараметрыКассвогоСервера.Пользователь = Пользователь;
	
КонецФункции

// Функция - Режим работы кассового сервера
// 
// Возвращаемое значение:
//   - 
//
Функция РежимРаботыКассовогоСервера() Экспорт
	
	ПараметрыКассвогоСервера = ПараметрыКассовогоСервера();
	
	Возврат ?(ПараметрыКассвогоСервера <> Неопределено И  ПараметрыКассвогоСервера.Свойство("РежимРаботыСеанса"), ПараметрыКассвогоСервера.РежимРаботыСеанса, Неопределено);
		
КонецФункции

// Функция - Кассовы сервер работает в режиме сеанс пользователя
// 
// Возвращаемое значение:
//   - 
//
Функция КассовыСерверРаботаетВРежимеСеансПользователя() Экспорт
	
	Возврат РежимРаботыКассовогоСервера() = 2;
	
КонецФункции

// Функция - Пустая структура параметров кассовго сервера
// 
// Возвращаемое значение:
//   - 
//
Функция ПустаяСтруктураПараметровКассовогоСервера() Экспорт
	
	СтрктураПараметров = Новый Структура;
	СтрктураПараметров.Вставить("КассаОплаты"                    , Неопределено);
	СтрктураПараметров.Вставить("Пользователь"                   , Неопределено);
	СтрктураПараметров.Вставить("ОтправлятьЧекПоСмс"             , Неопределено);
	СтрктураПараметров.Вставить("ОтправлятьЧекПоЭлектроннойПочте", Неопределено);
    СтрктураПараметров.Вставить("ИнтервалВремениПроверкиОчереди" , 60);
	СтрктураПараметров.Вставить("ИнтервалПробитияЧеков"          , 25);
	СтрктураПараметров.Вставить("РежимРаботыСеанса"              , 0);   
	СтрктураПараметров.Вставить("ПечатьНаБумаге"                 , Неопределено);   
	
	Возврат СтрктураПараметров;
	
КонецФункции

#КонецОбласти
