
#Область СлужебныйПрограммныйИнтерфейс

// Функция, получает текущие задачи для пользователя определенных временем срабатывания.
//
Функция ПолучитьАктивныеОповещенияКлиента() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОповещениеМониторингКлиента.Старт КАК Старт,
	|	ОповещениеМониторингКлиента.ПериодОповещения КАК ПериодОповещения,
	|	ОповещениеМониторингКлиента.ОбъектОповещения КАК ОбъектОповещения,
	|	ОповещениеМониторингКлиента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ОповещениеМониторингКлиента.Ключ КАК Ключ,
	|	ОповещениеМониторингКлиента.ЗаголовокОкна КАК ЗаголовокОкна,
	|	ОповещениеМониторингКлиента.Сообщение КАК Сообщение,
	|	ОповещениеМониторингКлиента.Параметр_1 КАК Параметр_1,
	|	ОповещениеМониторингКлиента.Параметр_2 КАК Параметр_2,
	|	ОповещениеМониторингКлиента.Параметр_3 КАК Параметр_3,
	|	ОповещениеМониторингКлиента.Параметр_4 КАК Параметр_4,
	|	ОповещениеМониторингКлиента.Параметр_5 КАК Параметр_5
	|ИЗ
	|	РегистрСведений.ОповещениеМониторингКлиента КАК ОповещениеМониторингКлиента
	|ГДЕ
	|	ОповещениеМониторингКлиента.Старт <= &ТекущаяДата
	|	И ВЫБОР
	|			КОГДА ОповещениеМониторингКлиента.ПериодОповещения > 0
	|				ТОГДА &ТекущаяДата <= ДОБАВИТЬКДАТЕ(ОповещениеМониторингКлиента.Старт, СЕКУНДА, ОповещениеМониторингКлиента.ПериодОповещения)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ОповещениеМониторингКлиента.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|				ТОГДА ОповещениеМониторингКлиента.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ОповещениеМониторингКлиента.ОбъектОповещения) = ТИП(Справочник.Сотрудники)
	|				ТОГДА ОповещениеМониторингКлиента.ОбъектОповещения = &ТекущийСотрудник
	|			КОГДА ТИПЗНАЧЕНИЯ(ОповещениеМониторингКлиента.ОбъектОповещения) = ТИП(Справочник.Пользователи)
	|				ТОГДА ОповещениеМониторингКлиента.ОбъектОповещения = &ТекущийПользователь
	|			КОГДА ТИПЗНАЧЕНИЯ(ОповещениеМониторингКлиента.ОбъектОповещения) = ТИП(Справочник.РабочиеМеста)
	|				ТОГДА ОповещениеМониторингКлиента.ОбъектОповещения = &РабочееМесто
	|			КОГДА ТИПЗНАЧЕНИЯ(ОповещениеМониторингКлиента.ОбъектОповещения) = ТИП(ЧИСЛО)
	|				ТОГДА ОповещениеМониторингКлиента.ОбъектОповещения = &НомерСеанса
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ");	
	
	//И ОповещениеМониторингКлиента.ОбъектОповещения = &НомерСеанса");
	
	Запрос.УстановитьПараметр("ТекущаяДата"		   , ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница" , ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("НомерСеанса"		   , НомерСеансаИнформационнойБазы());
	Запрос.УстановитьПараметр("РабочееМесто"       , ПараметрыСеанса.РабочееМестоКлиента);
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("ТекущийСотрудник"   , ПараметрыСеанса.ТекущийСотрудник);	
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицуЗначенийВМассивСтруктур(Результат);
   
КонецФункции

// Процедура, очищает устаревшие оповещения клиента.
//
Процедура ОчиститьУстаревшиеОповещенияКлиента() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	*
	|ИЗ
	|	РегистрСведений.ОповещениеМониторингКлиента КАК ОповещениеМониторингКлиента
	|ГДЕ
	|	ОповещениеМониторингКлиента.Старт <= &ТекущаяДата
	|	И (РАЗНОСТЬДАТ(ОповещениеМониторингКлиента.Старт, &ТекущаяДата, ДЕНЬ) >= 2
	|		ИЛИ ОповещениеМониторингКлиента.ПериодОповещения > 0
	|			И ДОБАВИТЬКДАТЕ(ОповещениеМониторингКлиента.Старт, СЕКУНДА, ОповещениеМониторингКлиента.ПериодОповещения) <= &ТекущаяДата)");
	
    Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТЗ ИЗ Результат Цикл
		ОповещениеМониторингКлиентаМенеджерЗаписи = РегистрыСведений.ОповещениеМониторингКлиента.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ОповещениеМониторингКлиентаМенеджерЗаписи, СтрокаТЗ);
		ОповещениеМониторингКлиентаМенеджерЗаписи.Удалить();
	КонецЦикла;
	
КонецПроцедуры

// Процедура, добавляет оповещение клиента.
//
Процедура ДобавитьОповещениеКлиента(ОбъектОповещения, СтруктурнаяЕдиница = Неопределено, Ключ, Старт = Неопределено, ПериодОповещения = 0, ЗаголовокОкна = "", Сообщение = "", МассивПараметров = Неопределено) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОповещениеМониторингКлиента.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.ОбъектОповещения 	= ОбъектОповещения;
	МенеджерЗаписи.СтруктурнаяЕдиница 	= СтруктурнаяЕдиница;
	МенеджерЗаписи.Ключ 				= Ключ;
	
	МенеджерЗаписи.Старт 				= ?(ЗначениеЗаполнено(Старт), Старт, ТекущаяДата());
	МенеджерЗаписи.ПериодОповещения 	= ПериодОповещения;
	
	МенеджерЗаписи.ЗаголовокОкна 		= ЗаголовокОкна;
	МенеджерЗаписи.Сообщение			= Сообщение;
	
	Если МассивПараметров <> Неопределено Тогда
		
		Счетчик = 0;
		Для Каждого ЭлементПараметра Из МассивПараметров Цикл
			Счетчик = Счетчик + 1;
			МенеджерЗаписи["Параметр_" + Счетчик]	= ЭлементПараметра;
		КонецЦикла;
		
	КонецЕсли; 
	
	МенеджерЗаписи.Записать();
   
КонецПроцедуры

// Процедура, завершает оповещение клиента.
//
Процедура ЗавершитьОповещениеКлиента(ОбъектОповещения, СтруктурнаяЕдиница = Неопределено, Ключ) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОповещениеМониторингКлиента.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.ОбъектОповещения 	= ОбъектОповещения;
	МенеджерЗаписи.СтруктурнаяЕдиница 	= ?(СтруктурнаяЕдиница <> Неопределено, СтруктурнаяЕдиница, Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
	МенеджерЗаписи.Ключ 				= Ключ;
	
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
   
КонецПроцедуры

// Процедура, переводит оповещение на 10 секуд вперед.
// 
// Описание: переводит оповещение на 10 секунд вперед и уменьшаяет время жизини оповещения.
//			 Это требуется, что бы оповещене показывалось на время жизни, т.к. само по себе оно быстро скрывается.
//
Процедура ПеревестиОповещениеКлиентаНа10Сек(ОбъектОповещения, СтруктурнаяЕдиница = Неопределено, Ключ) Экспорт
	
	НачатьТранзакцию();
	
	УстановитьБлокировкуДанных(ОбъектОповещения, СтруктурнаяЕдиница, Ключ);
	
	МенеджерЗаписи = РегистрыСведений.ОповещениеМониторингКлиента.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.ОбъектОповещения 	= ОбъектОповещения;
	МенеджерЗаписи.СтруктурнаяЕдиница 	= ?(СтруктурнаяЕдиница <> Неопределено, СтруктурнаяЕдиница, Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
	МенеджерЗаписи.Ключ 				= Ключ;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Старт 		= ТекущаяДатаСеанса() + 9;
		//МенеджерЗаписи.ОповещатьДо 	= МенеджерЗаписи.ОповещатьДо - 10;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

// Процедура, устанавливает блокировку данных.
//
Процедура УстановитьБлокировкуДанных(ОбъектОповещения, СтруктурнаяЕдиница, Ключ)
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОповещениеМониторингКлиента");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ОбъектОповещения", ОбъектОповещения);
	
	Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		ЭлементБлокировки.УстановитьЗначение("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	КонецЕсли;
	
	ЭлементБлокировки.УстановитьЗначение("Ключ", Ключ);
	
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры

#КонецОбласти
