
#Область ОбработчикиСобытий    

&НаКлиенте
// Процедура обработки команды "ПечатьПКО"
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если УправлениеПечатьюКлиентСтоматология.ПроверитьДокументыПроведены(ПараметрКоманды) Тогда
		Структура = ОтсортироватьМассивОбъектов(ПараметрКоманды);
		Если Структура.МассивОбъектов.Количество() = 0 Тогда 
			ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаКомандыОтвет", ЭтотОбъект), "Приходный кассовый ордер печатается только в случае поступления наличных денежных средств.", РежимДиалогаВопрос.ОК, , , "Сообщение");
			Возврат;
		ИначеЕсли Структура.МассивОбъектов.Количество() > 0 И Структура.МассивУдаленных.Количество() > 0 Тогда	
			ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("ПараметрыВыполненияКоманды, Структура", ПараметрыВыполненияКоманды, Структура)), "Приходный кассовый ордер печатается только в случае поступления наличных денежных средств." + Символы.ПС + "Следующие документы содержат другой тип денежных средств, и не будут отправлены на печать:" + Символы.ПС + Структура.Сообщение, РежимДиалогаВопрос.ОК, , , "Сообщение");			
			Возврат;
		Иначе 
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Документ.ПоступлениеДенежныхСредств",
			"КО1",
			ПараметрКоманды,
			ПараметрыВыполненияКоманды.Источник,
			Неопределено
			);			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Обработка команды завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ОбработкаКомандыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПараметрыВыполненияКоманды = ДополнительныеПараметры.ПараметрыВыполненияКоманды;
	Структура = ДополнительныеПараметры.Структура;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
	"Документ.ПоступлениеДенежныхСредств",
	"КО1",
	Структура.МассивОбъектов,
	ПараметрыВыполненияКоманды.Источник,
	Неопределено
	);

КонецПроцедуры // ОбработкаКоманды()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
//
//
Функция ОтсортироватьМассивОбъектов(МассивОбъектов) 
	
	Счетчик = 0;
	КоличествоЭлементов = МассивОбъектов.Количество();
	МассивУдаленных = Новый Массив;
	Пока Счетчик < КоличествоЭлементов Цикл 
		Если ЗначениеЗаполнено(МассивОбъектов[Счетчик].ТипДенежныхСредств) И МассивОбъектов[Счетчик].ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда 
			Счетчик = Счетчик + 1;
		Иначе
			МассивУдаленных.Добавить(МассивОбъектов[Счетчик]);
			МассивОбъектов.Удалить(Счетчик);
			КоличествоЭлементов = КоличествоЭлементов - 1;
			Если Счетчик <> 0 Тогда 
				Счетчик = Счетчик - 1;
			КонецЕсли;			
		КонецЕсли;	
	КонецЦикла;
	
	Сообщение ="";
	Для Каждого ЭлементМассива Из МассивУдаленных Цикл
		Сообщение = Сообщение + Символы.ПС + Строка(ЭлементМассива);
	КонецЦикла;	
	Структура = Новый Структура;
	Структура.Вставить("МассивУдаленных", МассивУдаленных);
	Структура.Вставить("МассивОбъектов", МассивОбъектов);
	Структура.Вставить("Сообщение", Сообщение);
	
	Возврат Структура;
	
КонецФункции	

&НаКлиенте
Процедура ОбработкаКомандыОтвет(Результат, Параметры) Экспорт
   Ответ = Результат;
КонецПроцедуры

#КонецОбласти