
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	РазделУчета = "Продажи";
	
КонецПроцедуры

// Процедура, обработчик события "ПередЗаписью".
////
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Для Каждого СтрокаТ Из ЭтотОбъект.БонусныеСчета Цикл    		
		Если Не ЗначениеЗаполнено(СтрокаТ.БонусныйСчет) Тогда  			
			СтрокаТ.БонусныйСчет = НайтиИлиСоздатьБонусныйСчет(СтрокаТ);   
		КонецЕсли;          	
	КонецЦикла;       
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	                       
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ДвиженияДокументовСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Запись номинала серии сертификата в элемент справочника "ПартииНоменклатуры".
	Документы.ВводНачальныхОстатков.ЗаписатьНоминалСертификатаПриПродаже(Ссылка);
	
	 // Инициализация данных документа.	
	Документы.ВводНачальныхОстатков.УстановитьНачальныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Движения документа
	//ДвиженияДокументовСервер.СерийныеНомераСертификатов(ДополнительныеСвойства, Движения, Отказ);  
	ДвиженияДокументовСервер.Сертификаты(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.ДенежныеСредстваНаЛицевыхСчетах(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.ВзаиморасчетыСКонтрагентами(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.Продажи(ДополнительныеСвойства, Движения, Отказ);  
	ДвиженияДокументовСервер.РасчетыСПодотчетниками(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.РасчетыСПерсоналом(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.БонусныеСчета(ДополнительныеСвойства, Движения, Отказ);    
	ДвиженияДокументовСервер.Управленческий(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	ДвиженияДокументовСервер.ДобавитьНаборыЗаписей(ЭтотОбъект);	
	
КонецПроцедуры

// Обработчик проверки заполнения объекта
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ИндексРеквизита = ПроверяемыеРеквизиты.Найти("ДенежныеСредстваНаЛицевыхСчетах.ВидЛицевогоСчета");
	Если ИндексРеквизита <> Неопределено И Константы.ИспользоватьВидыЛицевыхСчетов.Получить() = Ложь Тогда
		ПроверяемыеРеквизиты.Удалить(ИндексРеквизита);
	КонецЕсли;	
	
	Для Каждого СтрокаСертификат из СерийныеНомераСертификатов Цикл
		Если СтрокаСертификат.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат
			И СтрокаСертификат.Номенклатура.ИспользоватьПартии
			И СтрокаСертификат.Партия.Пустая() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке № " + СтрокаСертификат.НомерСтроки + " табличной части " + """" + "Сертификаты в обращении" + """" + " не заполнено поле " + """"+ "Характеристика, серия" + """");
			Отказ = Истина;
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция - Найти или создать бонусный счет
//
// Параметры:
//  СтрокаТ	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция НайтиИлиСоздатьБонусныйСчет(СтрокаТ)
	
	МассивБонусныхСчетов = Справочники.БонусныеСчета.ВернутьБонусныеСчетаВладельца(
														СтрокаТ.Контрагент,
														?(ЭтотОбъект.ЭтоНовый(), ТекущаяДатаСеанса(), ЭтотОбъект.Дата),
														СтрокаТ.ВидБонусногоСчета);
	
	Если МассивБонусныхСчетов.Количество() = 0 Тогда
		
		БонусныйСчетСсылка = Справочники.БонусныеСчета.СоздатьБонусныйСчетВладельца(
														СтрокаТ.Контрагент,
														СтрокаТ.Карта,
														СтрокаТ.ВидБонусногоСчета,
														?(ЭтотОбъект.ЭтоНовый(), ТекущаяДатаСеанса(), ЭтотОбъект.Дата));
		
	Иначе
		БонусныйСчетСсылка = МассивБонусныхСчетов[0];
	КонецЕсли;
	
	Возврат БонусныйСчетСсылка;
	
КонецФункции

#КонецОбласти
