
#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытийФормы

// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АктивацияПриложения") Тогда
		ЭтотОбъект.АктивацияПриложения = Параметры.АктивацияПриложения;
	КонецЕсли;
	
	Если ЭтотОбъект.АктивацияПриложения Тогда
		ЭтаФорма.Заголовок = "Для активации настройте внешнюю публикацию";
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Перед записью
//
// Параметры:
//  Отказ			 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	УстановитьСлужебногоПользователя();
	
	РезультатПроверки = ЛичныйКабинет.ПроверитьПубликациюВнешнейСистемы(ЭтотОбъект.ВнешняяПубликацияАдрес.ВнешняяПубликацияАдрес);
	
	Если РезультатПроверки.ВыполненоУспешно = Истина Тогда
		
		Если РезультатПроверки.ПубликацияВерна = Ложь Тогда
			
			Отказ = Истина;
			ПоказатьПредупреждение(,"Публикация не подтверждена. Проверьте правильность указанного адреса");
			
		КонецЕсли;
		
	Иначе
		
		Отказ = Истина;
		ПоказатьПредупреждение(,"При проверке публикации возникла ошибка: " + РезультатПроверки.ОписаниеОшибки);

	КонецЕсли;

КонецПроцедуры

// Процедура - Перед записью на сервере
//
// Параметры:
//  Отказ			 - 	 - 
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЭтотОбъект.ОшибкаОбновленияВнешнейСистемы = Ложь;
		
КонецПроцедуры

// Процедура - После записи на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтотОбъект.АктивацияПриложения = Ложь Тогда
		
		РезультатОбновления = ЛичныйКабинет.ОбновитьДанныеПубликацииВнешнейСистемы(
		,,ЛичныйКабинет.УидТекущейСессии());
		
		Если РезультатОбновления.ВыполненоУспешно = Ложь Тогда
			
			ЭтотОбъект.ОшибкаОбновленияВнешнейСистемы = Истина;
		    ЭтотОбъект.ОписаниеОшибкиПубликации       = РезультатОбновления.ОписаниеОшибки;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Процедура - После записи
//
// Параметры:
//  ПараметрыЗаписи	 - 	 - 
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ОшибкаОбновленияВнешнейСистемы = Истина Тогда
		
		ПоказатьПредупреждение(,"При при обнолвении публикации в CRM: " + ЭтотОбъект.ОписаниеОшибкиПубликации)
		
	КонецЕсли;
	
	Оповестить("ВнешняяПубликацияНастроена");
	
КонецПроцедуры

// Процедура - Перед закрытием
//
// Параметры:
//  Отказ				 - 	 - 
//  ЗавершениеРаботы	 - 	 - 
//  ТекстПредупреждения	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Отказ = ЭтотОбъект.ОшибкаОбновленияВнешнейСистемы;
	
	ЭтотОбъект.ОшибкаОбновленияВнешнейСистемы = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

#Область ОбработчикиСобытийЭлементовФормы

// Процедура - Внешняя публикация адрес внешняя публикация адрес при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
&НаКлиенте
Процедура ВнешняяПубликацияАдресВнешняяПубликацияАдресПриИзменении(Элемент)
	
	Если СтрЗаканчиваетсяНа(ВнешняяПубликацияАдрес.ВнешняяПубликацияАдрес, "/") Тогда
		
		ВнешняяПубликацияАдрес.ВнешняяПубликацияАдрес = Лев(ВнешняяПубликацияАдрес.ВнешняяПубликацияАдрес, СтрДлина(ВнешняяПубликацияАдрес.ВнешняяПубликацияАдрес) - 1);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Процедура - Установить служебного пользователя
//
&НаСервереБезКонтекста
Процедура УстановитьСлужебногоПользователя()
	
	Если НЕ ЗначениеЗаполнено(Константы.ВнешняяПубликацияПользователь.Получить()) Тогда
		                         
		СлужебныйПользователь = ПользователиСтоматология.СлужебныйПользовательAPI();
		
		Если НЕ ЗначениеЗаполнено(СлужебныйПользователь) Тогда
			
			СлужебныйПользователь = ПользователиСтоматология.СоздатьСлужебногоПользователяAPI();
			
		КонецЕсли;
		
		Константы.ВнешняяПубликацияПользователь.Установить(СлужебныйПользователь);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
