///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https:// creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ПараметрыРазмещения = Новый Структура("Источники, КоманднаяПанель, ПрефиксГрупп", Неопределено, Элементы.ФормаГруппа3, "");
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	Оповестить("ИзмененаДатаСкрытияПерсональныхДанных");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "Список.Дата", Элементы.Дата.Имя);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
 
&НаКлиенте
// Процедура печати документов.
//
Процедура ДокументПечать(Команда)

	СписокПечатныхФорм = Новый СписокЗначений;	
	Для Каждого ГруппаПечати Из Элементы.ПодменюПечать.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ГруппаПечати.Вид) = Тип("ВидГруппыФормы") Тогда
			
			Для Каждого КнопкаПечати Из ГруппаПечати.ПодчиненныеЭлементы Цикл	
				СписокПечатныхФорм.Добавить(КнопкаПечати.ИмяКоманды, "");		
			КонецЦикла;
	
		ИначеЕсли ТипЗнч(ГруппаПечати.Вид) = Тип("ВидКнопкиФормы") Тогда			
			Если ГруппаПечати.Имя = "ПодменюПечатьЗаглушка" Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;	
	КонецЦикла;
	
	СписокПечатныхФорм = ПолучитьЗаголовокКоманды(СписокПечатныхФорм);	
		
	Оповещение = Новый ОписаниеОповещения("ОбработкаКомандыПечатиЗавершение", ЭтотОбъект);	
	ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, Элементы.ФормаДокументаПечать); 				
	
КонецПроцедуры

&НаСервере
// Функция получает заголовки команд по их имени
//
Функция ПолучитьЗаголовокКоманды(СписокПечатныхФорм)
	
	Для Каждого ЭлементСписка Из СписокПечатныхФорм Цикл 
		НайденнаяКоманда = ЭтотОбъект.Команды.Найти(ЭлементСписка.Значение);
		
		Если НЕ НайденнаяКоманда = Неопределено Тогда
			ЭлементСписка.Представление = НайденнаяКоманда.Заголовок;
		Иначе
			СписокПечатныхФорм.Удалить(ЭлементСписка);
		КонецЕсли;
		
	КонецЦикла;
	Возврат СписокПечатныхФорм; // НайденнаяКоманда.Заголовок;
	
КонецФункции

&НаКлиенте
// Процедура - Обработка выбора документа на печать
//
Процедура ОбработкаКомандыПечатиЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Команда = Новый Структура("Имя", Результат.Значение);		
	Подключаемый_ВыполнитьКоманду(Команда);
	
КонецПроцедуры


#КонецОбласти
