
#Область ОбработчикиСобытийФормы

// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Идентификатор", ЭтотОбъект.Идентификатор);
	ЭтаФорма.Заголовок = Строка(Идентификатор);

	Параметры.ПараметрыОборудования.Свойство("КассаОплаты"                      , ЭтотОбъект.КассаОплаты);
	Параметры.ПараметрыОборудования.Свойство("Пользователь"                     , ЭтотОбъект.Пользователь);
	Параметры.ПараметрыОборудования.Свойство("ОтправлятьЧекПоСмс"               , ЭтотОбъект.ОтправлятьЧекПоСмс);
    Параметры.ПараметрыОборудования.Свойство("ОтправлятьЧекПоЭлектроннойПочте"  , ЭтотОбъект.ОтправлятьЧекПоЭлектроннойПочте);
    Параметры.ПараметрыОборудования.Свойство("ИнтервалВремениПроверкиОчереди"   , ЭтотОбъект.ИнтервалВремениПроверкиОчереди);
    Параметры.ПараметрыОборудования.Свойство("ИнтервалПробитияЧеков"            , ЭтотОбъект.ИнтервалПробитияЧеков);
    Параметры.ПараметрыОборудования.Свойство("РежимРаботыСеанса"                , ЭтотОбъект.РежимРаботыСеанса);
	Параметры.ПараметрыОборудования.Свойство("ПечатьНаБумаге"					, ЭтотОбъект.ПечататьЧекНаБумаге);
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ИнтервалВремениПроверкиОчереди) Тогда
		ЭтотОбъект.ИнтервалВремениПроверкиОчереди = 60;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ИнтервалПробитияЧеков) Тогда
		ЭтотОбъект.ИнтервалПробитияЧеков = 25;
	КонецЕсли;

	// Доработка Юля
	ЭтотОбъект.РабочееМесто = ЭтотОбъект.Идентификатор.РабочееМесто;//ПодключаемоеОборудованиеКассовыйСервер.ПолучитьРабочееМестоКассовогоСервера();
	// конец
	
	Элементы.Пользователь.Видимость = НЕ ЗначениеЗаполнено(ЭтотОбъект.РежимРаботыСеанса) ИЛИ ЭтотОбъект.РежимРаботыСеанса < 2;

КонецПроцедуры

#КонецОбласти

// Процедура - Режим работы при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
&НаКлиенте
Процедура РежимРаботыПриИзменении(Элемент)
	
	Элементы.Пользователь.Видимость = ЭтотОбъект.РежимРаботыСеанса < 2;
	
КонецПроцедуры

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Записать и закрыть
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.РежимРаботыСеанса) Тогда
		
		ПоказатьПредупреждение(,НСтр("ru='Выберите желаемый сеанс работы кассового сервера!';en='Select the desired session work cash register server!'"));
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.КассаОплаты) Тогда
		
		ПоказатьПредупреждение(,НСтр("ru='Выберите кассу для фискализации!';en='Select cashier for fiscalization!'"));
		Возврат;
		
	КонецЕсли;
	
	Если РабочееМестоКассы(ЭтотОбъект.КассаОплаты) <> ЭтотОбъект.РабочееМесто Тогда
		
		ПоказатьПредупреждение(,НСтр("ru='Рабочее место кассового сервера и ФР в кассе не совпадают!';en='Working aplace cash register server and FR in checkout counter do not match up!'"));
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ИнтервалВремениПроверкиОчереди) Тогда
		
		ПоказатьПредупреждение(,НСтр("ru='Интервал проверки очереди не может быть нулевым!';en='Interval queue checks cannot be null!'"));
		Возврат;
		
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ИнтервалПробитияЧеков) Тогда
		
		ПоказатьПредупреждение(,НСтр("ru='Интервал пробития чеков не может быть нулевым!';en='Interval penetration checks cannot be null!'"));
		Возврат;
		
	КонецЕсли;

	НовыеЗначениеПараметров = ПодключаемоеОборудованиеКассовыйСервер.ПустаяСтруктураПараметровКассовогоСервера();
	
	НовыеЗначениеПараметров.КассаОплаты                      = ЭтотОбъект.КассаОплаты;
	НовыеЗначениеПараметров.Пользователь                     = ЭтотОбъект.Пользователь;
	НовыеЗначениеПараметров.ОтправлятьЧекПоСмс               = ЭтотОбъект.ОтправлятьЧекПоСмс;
	НовыеЗначениеПараметров.ОтправлятьЧекПоЭлектроннойПочте  = ЭтотОбъект.ОтправлятьЧекПоЭлектроннойПочте;
	НовыеЗначениеПараметров.ИнтервалВремениПроверкиОчереди   = ЭтотОбъект.ИнтервалВремениПроверкиОчереди;
	НовыеЗначениеПараметров.ИнтервалПробитияЧеков            = ЭтотОбъект.ИнтервалПробитияЧеков;
    НовыеЗначениеПараметров.РежимРаботыСеанса                = ЭтотОбъект.РежимРаботыСеанса;    
	НовыеЗначениеПараметров.ПечатьНаБумаге					 = ЭтотОбъект.ПечататьЧекНаБумаге;

	Результат = Новый Структура;
	Результат.Вставить("Идентификатор"        , Идентификатор);
	Результат.Вставить("ПараметрыОборудования", НовыеЗначениеПараметров);
	
	Закрыть(Результат);

КонецПроцедуры   

#КонецОбласти

// Функция - Рабочее место кассы
//
// Параметры:
//  Касса	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
&НаСервереБезКонтекста
Функция РабочееМестоКассы(Касса)
	  Возврат Касса.ВнешнееОборудование.РабочееМесто;
КонецФункции