
&НаКлиенте
Перем ПредупреждениеДублирование; // Переменная для хранения данных о дублировании записи.     

&НаКлиенте
Перем ЗаписьНаПрием;

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода                               = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Элементы.Код.Видимость                       = ОтображниеКода;
	Элементы.Дата.ГоризонтальноеПоложениеВГруппе = ?(Не ОтображниеКода, ГоризонтальноеПоложениеЭлемента.Лево, ГоризонтальноеПоложениеЭлемента.Право);
		
	Параметры.Свойство("ПОIPТелефонии"	 , ПОIPТелефонии);
	Параметры.Свойство("IDЗвонка"		 , IDЗвонка);
	Параметры.Свойство("КоллтрекингНомер", КоллтрекингНомер);
	
	ЭтотОбъект.ТекущийПользователь       = ПараметрыСеанса.ТекущийСотрудник;
	ЭтотОбъект.ТекущаяСтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;

	Если Объект.Ссылка.Пустая() Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Статус) Тогда
			Объект.Статус = Перечисления.СтатусыЗаявок.НеОбработана;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ОсновнойМенеджер) Тогда
			Объект.ОсновнойМенеджер = ЭтотОбъект.ТекущийПользователь;
		КонецЕсли;
	КонецЕсли;

	// Не нужно перетирать исходные данные заявки.
	//// Синхронизация с клиентом. Заполняется реквизит справочника.
	// Если ЗначениеЗаполнено(Объект.ОсновнойКлиент) Тогда
	//	Объект.Фамилия  = Объект.ОсновнойКлиент.Фамилия;
	//	Объект.Имя      = Объект.ОсновнойКлиент.Имя;
	//	Объект.Отчество = Объект.ОсновнойКлиент.Отчество;
	//	
	//	Объект.Наименование = СокрЛП(Объект.Фамилия + ?(ЗначениеЗаполнено(Объект.Фамилия), " ", "") 
	//							+ Объект.Имя + ?(ЗначениеЗаполнено(Объект.Имя), " ", "") + Объект.Отчество);		
	// КонецЕсли;
	
	ЭтотОбъект.СтатусЗаявки = Объект.Статус;	
		
	ВремСписокФильтрацииИсторииВзаимодействия = ХранилищеСистемныхНастроек.Загрузить("Справочники.Заявки.Форма.ФормаЭлемента", "НастройкиФильтрации");	
	ОбщегоНазначенияКлиентСерверСтоматология.ЗаполнитьСписокФильтрацииИсторииВзаимодействияПоУмолчанию(СписокФильтрацииИсторииВзаимодействия, Неопределено, ВремСписокФильтрацииИсторииВзаимодействия, Объект.Ссылка);
	
	ФильтрПрименен = ФильтрПрименен(СписокФильтрацииИсторииВзаимодействия);	
	Элементы.ОчиститьФильтры.Видимость	= ФильтрПрименен;
	Элементы.ПоказатьФильтры.Картинка	= ?(ФильтрПрименен, БиблиотекаКартинок.ФильтрУстановлен, БиблиотекаКартинок.ФильтрНеУстановлен);
	
	СформироватьСтруктуруДанныхВсплывающихГрупп();	
	
	УстановитьСостояниеЭлементовФормы();
	
	// Видимость элементов UTM.
	УстановитьСостояниеЭлементовUTM();
	// Видимость элементов Client ID.
	УстановитьСостояниеЭлементовClientID();
	
	// Контактная информация.
	Если Параметры.Ключ.Пустая() Тогда
		УправлениеКонтактнойИнформациейСтоматология.ПриСозданииПриЧтенииНаСервере(ЭтотОбъект);
	КонецЕсли;
	
	ПроверкаДублированияКлиентаКонтактнаяИнформацияНаСервере();
	
	ЗаполнитьСписокВыбораВзаимодействия();
	ЗаполнитьСписокВыбораРежимаНапоминания();
	ЗаполнитьСписокВыбораШаблоновSMSСообщений();
	
	// Блок истории взаимодействия.
	Если Не Объект.Ссылка.Пустая() Тогда
		
		// Заполняется реквизит формы.
		ЭтотОбъект.Фамилия  = Объект.Фамилия;
		ЭтотОбъект.Имя      = Объект.Имя;
		ЭтотОбъект.Отчество = Объект.Отчество;	

		ОбновитьИсториюВзаимодействияСКлиентом();	
		СоздатьВиджетСделки();
		УстановитьАктуальнуюСделкуВзаимодействия();

	КонецЕсли;
	
	ОбновитьЗаголовокЗаявки();
	
	Элементы.Комментарий.МаксимальнаяВысота = Мин(Макс((СтрЧислоСтрок(Объект.Комментарий) / 1.5) + 1, 3), 14);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ЗаписьНаПрием = Ложь;
	
КонецПроцедуры                

&НаСервере
// Процедура - При чтении на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Контактная информация
	УправлениеКонтактнойИнформациейСтоматология.ПриСозданииПриЧтенииНаСервере(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события формы "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	УстановитьСостояниеЭлементовФормыСтатусыЗаявки();
	КомментарийПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события формы "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Статус <> ЭтотОбъект.СтатусЗаявки Тогда
		Объект.Статус = ЭтотОбъект.СтатусЗаявки;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события формы "ПередЗаписьюНаСервере".
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ИнтерактивнаяЗапись", Истина);
	
	//// Заполнить контактную информацию.
	УправлениеКонтактнойИнформациейСтоматология.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец КонтактнаяИнформация
	
	Если ЭтотОбъект.ОповеститьОНовойЗаявке = Истина
		ИЛИ Объект.Ссылка.Пустая() = Истина Тогда
		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ОповеститьОНовойЗаявке", Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - После записи на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ПОIPТелефонии) И ЗначениеЗаполнено(IDЗвонка) Тогда
		ЗаписатьЗаявкуВРегистрИсторияВызовов();
	КонецЕсли;
	
	ОбновитьЗаголовокЗаявки();
	
КонецПроцедуры

&НаКлиенте
// Процедура - После записи.
//
// Параметры:
//  ПараметрыЗаписи	 - 	 -
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписанаНоваяЗаявка", Объект.Ссылка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка оповещения.
//
// Параметры:
//  ИмяСобытия	 - 	 - 
//  Параметр	 - 	 - 
//  Источник	 - 	 - 
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОБНОВИТЬ_ОБЯЗАТЕЛЬНЫЕ_ПОЛЯ" Тогда
		
		УстановитьОбязательныеПоля();
		ЭтаФорма.ОтключитьОтметкуНезаполненного();

	ИначеЕсли ИмяСобытия = "ОБНОВИТЬ_ВИДЖЕТ_СДЕЛКИ" Тогда
		
		СоздатьВиджетСделки();		
		УстановитьАктуальнуюСделкуВзаимодействия();
		
	ИначеЕсли ИмяСобытия = "СозданИзмененСервисSMSРассылки" Тогда
		
		ВзаимодействиеSMSНастроитьСервисЗавершение(Параметр);
		
	ИначеЕсли ИмяСобытия = "СозданаИзмененаУчетнаяЗапись" Тогда
		
		ВзаимодействиеПисьмоНастроитьАккаунтЗавершение(Параметр);
		
	ИначеЕсли ИмяСобытия = "ЗаписанНовыйКлиент" Тогда
		
		УстановитьСостояниеЭлементовФормы();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Процедура - Установить видимость элементов формы.
//
Процедура УстановитьСостояниеЭлементовФормы()
		
	Элементы.СтатусНекачественная.Заголовок	 = НСтр("ru = 'Некачественное'");
	Элементы.СтатусОбработана.Заголовок		 = НСтр("ru = 'Качественное'");
	Элементы.СтатусОбработана.Отображение	 = ОтображениеКнопки.КартинкаИТекст;
	
	// Если заявка обработана.
	Если Не Объект.Ссылка.Пустая() Тогда 
				
		Если ЭтотОбъект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Принята
			Или ЭтотОбъект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Отклонена Тогда
			
			Элементы.ПоказатьНаличиеДублейКлиентов.Видимость = Ложь;
			Элементы.ОткрытьКонтрагента.Видимость 			 = Ложь;
			Элементы.СтатусОбработана.Отображение            = ОтображениеКнопки.Текст;
			
			Элементы.ОткрытьКонтрагентаНеОбработана.Видимость = Ложь;
			Элементы.СтатусНеОбработана.Заголовок = НСтр("ru = 'Новое обращение'");

			Если ЭтотОбъект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Принята
				И ЗначениеЗаполнено(Объект.ОсновнойКлиент) Тогда
				
				Элементы.СтатусОбработана.Заголовок   = НСтр("ru = 'Качественное'; en = 'Received: '");
				Элементы.ОткрытьКонтрагента.Заголовок = Объект.ОсновнойКлиент.Наименование;
				Элементы.ОткрытьКонтрагента.Видимость = Истина;
								
			ИначеЕсли ЭтотОбъект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Отклонена Тогда
				
				Элементы.СтатусНекачественная.Заголовок      = НСтр("ru = 'Некачественное '; en = 'Poor application '") + Объект.ОценкаЗаявки;
				Элементы.СтатусНекачественная.ЦветТекста	 = Новый Цвет(255, 255, 255);
				Элементы.ГруппаСтатусНекачественная.ЦветФона = Новый Цвет(241, 23, 22);
				
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(Объект.ОсновнойКлиент) Тогда
			
			// Элементы.ОткрытьКонтрагентаНеОбработана.Заголовок = Объект.ОсновнойКлиент.Наименование;
			// Элементы.ОткрытьКонтрагентаНеОбработана.Видимость = Истина;
			
			Элементы.СтатусНеОбработана.Заголовок = НСтр("ru = 'Новое обращение'");
			
		КонецЕсли;	
		
	Иначе	
		Элементы.РекламнаяСсылка.Видимость   = Ложь;
		Элементы.ГруппаUTM.Видимость         = Ложь;
		// Элементы.ГруппаФИО.Видимость         = Ложь;
		// Элементы.ГруппаФИО.Видимость = Истина;
		
	КонецЕсли;
	
	РекламныйИсточникДругойПациент = (Объект.РекламныйИсточник = Справочники.РекламныеИсточники.ДругойПациент);
	Элементы.ИсточникИнформацииЗначение.Видимость = РекламныйИсточникДругойПациент;	
	Если РекламныйИсточникДругойПациент Тогда
		Элементы.ИсточникИнформацииЗначение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	КонецЕсли;
	
	
	// Если Объект.РекламнаяПлощадка = Справочники.КаналыПривлечения.ЛидФорма Тогда
	//	Элементы.КаналПривлеченияЗначение.Видимость       = Истина;
	//	Элементы.КаналПривлеченияЗначение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ЛидФормы");
	//	Элементы.КаналПривлеченияЗначение.Заголовок       = НСтр("ru = 'Лид форма'; en = 'Lead form'");		
	// Иначе
	//	Элементы.КаналПривлеченияЗначение.Видимость       = Ложь;
	// КонецЕсли;
	
	// Видимость элементов взаимодействий.
	Элементы.ГруппаSMS.Видимость = РазрешенаОтправкаSMSСообщений();
	
	Элементы.ГруппаВзаимодействиеSMSНастроитьСервис.Видимость     = Не НаличиеСервисаSMSРассылки();
	Элементы.ГруппаВзаимодействиеSMSОсновная.Видимость            = Не Элементы.ГруппаВзаимодействиеSMSНастроитьСервис.Видимость;	
	
	Элементы.ГруппаВзаимодействиеПисьмоНастроитьАккаунт.Видимость = Не НаличиеПочтовогоАккаунта();
	Элементы.ГруппаВзаимодействиеПисьмоОсновная.Видимость         = Не Элементы.ГруппаВзаимодействиеПисьмоНастроитьАккаунт.Видимость;
	
	УстановитьВидимостьЗначенияКаналаПривлечения(ЭтотОбъект);

	УстановитьФокусЭлементаСервер();
	
	Элементы.ГруппаПерсональныеДанные.Видимость = ЗначениеЗаполнено(Объект.ОсновнойКлиент);
	
	Если ЗначениеЗаполнено(Объект.ОсновнойКлиент) Тогда
		
		ЭтотОбъект.СтатусКонтрагента = Справочники.Контрагенты.ПолучитьСтатус(Объект.ОсновнойКлиент);
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СтатусКонтрагента) Тогда
			ЭтотОбъект.СтатусКонтрагента = Перечисления.СтатусыКонтрагентов.Первичный;
		КонецЕсли;
		
		ЗаполнитьТаблицуМеток();
		ОбновитьМетки();
		
		ФИОКонтрагента = ПолучитьПолноеФИООбъекта(ЭтотОбъект);
		Элементы.ОткрытьКонтрагента.Заголовок = ?(ЗначениеЗаполнено(ФИОКонтрагента), ФИОКонтрагента, Объект.ОсновнойКлиент.Наименование);		
		
		СоответствиеЦветов  = ПолучитьСоответствиеЦветовИСтатусовКлиентов();
		СтатусПредставление = ?(ЭтотОбъект.СтатусКонтрагента = Перечисления.СтатусыКонтрагентов.Потенциальный, Нстр("ru = 'Потенциальный'; en = 'Potential'"), ЭтотОбъект.СтатусКонтрагента); 
		
		Элементы.ГруппаСтатус.ЦветФона            = СоответствиеЦветов.Получить(ЭтотОбъект.СтатусКонтрагента);	
		Элементы.ОткрытьИсториюСтатусов.Заголовок = СтатусПредставление; 
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить состояние элементов UTM.
//
Процедура УстановитьСостояниеЭлементовUTM()
	
	ОтображениеГруппыUTM = Ложь;
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		ОтображениеUtmSource   = ЗначениеЗаполнено(Объект.utm_source);
		ОтображениеUtmMedium   = ЗначениеЗаполнено(Объект.utm_medium);
		ОтображениеUtmCampaign = ЗначениеЗаполнено(Объект.utm_campaign);
		ОтображениеUtmTerm     = ЗначениеЗаполнено(Объект.utm_term);
		ОтображениеUtmContent  = ЗначениеЗаполнено(Объект.utm_content);
		
		Если ОтображениеUtmSource
			ИЛИ ОтображениеUtmMedium
			ИЛИ ОтображениеUtmCampaign
			ИЛИ ОтображениеUtmTerm
			ИЛИ ОтображениеUtmContent Тогда
			
			ОтображениеГруппыUTM = Истина;
			
			Элементы.utm_source.Видимость   = ОтображениеUtmSource;
			Элементы.utm_medium.Видимость   = ОтображениеUtmMedium;
			Элементы.utm_campaign.Видимость = ОтображениеUtmCampaign;
			Элементы.utm_term.Видимость     = ОтображениеUtmTerm;
			Элементы.utm_content.Видимость  = ОтображениеUtmContent;
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	Элементы.ГруппаUTM.Видимость = ОтображениеГруппыUTM;
	
	
			
						
				
	
	
КонецПроцедуры

&НаСервере
// Процедура - Установить состояние элементов UTM.
//
Процедура УстановитьСостояниеЭлементовClientID()
				
			Элементы.ym_cid.Видимость   		= ЗначениеЗаполнено(Объект.ym_cid);
			Элементы.ga_cid.Видимость   		= ЗначениеЗаполнено(Объект.ga_cid);
			Элементы.fitness1c_cid.Видимость   	= ЗначениеЗаполнено(Объект.fitness1c_cid);
			Элементы.ct_cid.Видимость     		= ЗначениеЗаполнено(Объект.ct_cid);
			Элементы.rs_cid.Видимость  			= ЗначениеЗаполнено(Объект.rs_cid);
			Элементы.rs_vid.Видимость  			= ЗначениеЗаполнено(Объект.rs_vid);
			Элементы.fbc.Видимость  			= ЗначениеЗаполнено(Объект.fbc);
			Элементы.fbp.Видимость  			= ЗначениеЗаполнено(Объект.fbp);
						
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура РекламныйИсточникПриИзменении(Элемент)
	
	ТипДругойПациент = ПредопределенноеЗначение("Справочник.РекламныеИсточники.ДругойПациент");
	Элементы.ИсточникИнформацииЗначение.Видимость = (Объект.РекламныйИсточник = ТипДругойПациент);
	
	Если Объект.РекламныйИсточник = ТипДругойПациент Тогда
		Элементы.ИсточникИнформацииЗначение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ИсточникИнформацииЗначениеНачалоВыбора".
//
Процедура ИсточникИнформацииЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ИсточникИнформацииЗначениеНачалоВыбораЗавершение", ЭтаФорма);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораКлиенты",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Клиент источник информации начало выбора завершение
// Завершение немодального открытия окна формы - Справочник Контрагенты - ФормаВыбораКлиенты
// Параметры:
//  Результат	 - 	 Результат Оповещения 
//  Параметры	 - 	 Параметры Оповещения 
//
Процедура ИсточникИнформацииЗначениеНачалоВыбораЗавершение(Результат, Параметры)  Экспорт
	
	ЗначениеКонтрагент = Результат;
	Если ЗначениеКонтрагент <> Неопределено Тогда
		Если ЗначениеКонтрагент <> Объект.ОсновнойКлиент Тогда
			Объект.ИсточникИнформацииЗначение = ЗначениеКонтрагент;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Клиент не может быть источником информации для самого себя.
																		 |Следует выбрать другого клиента.'; 
																   |en = 'The client cannot be a source of information for himself.
																   		 |You should choose another client.'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ОбработкаПроверкиЗаполненияНаСервере".
//
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// КонтактнаяИнформация
	УправлениеКонтактнойИнформациейСтоматология.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Отказ);
	// Конец КонтактнаяИнформация	
	
	// Проверка заполнения настроенных обязательных полей.
	// Сделано в модуле формы, т.к. в обработке проверки заполнения в модуле объекта не доступны данные контактной информации.
	ОбязательныеПоля = Константы.ОбязательныеПоляЗаявки.Получить().Получить();
	
	Если ЗначениеЗаполнено(ОбязательныеПоля) Тогда
		
		Для Каждого ДанныеПоля Из ОбязательныеПоля Цикл
			
			Если ДанныеПоля.Обязательно = Ложь Тогда
				Продолжить;
			КонецЕсли;
			
			Если ДанныеПоля.Поле = "НомерТелефона" Или ДанныеПоля.Поле = "АдресЭП" Тогда
				
				ПроверитьЗаполнениеКонтактнойИнформации(Отказ, ДанныеПоля);
				
			ИначеЕсли Не ЗначениеЗаполнено(Объект[ДанныеПоля.Поле]) Тогда

				ТекстСообщения = СтрШаблон(НСтр("ru = 'Поле ""%1"" не заполнено'"), ДанныеПоля.ПредставлениеПоля);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект." + ДанныеПоля.Поле,, Отказ);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура КаналПривлеченияПриИзменении(Элемент)
	
	УстановитьВидимостьЗначенияКаналаПривлечения(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик события "ПриИзменении";
//
Процедура КомментарийПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Комментарий) Тогда
		Элементы.ОткрытьКомментарий.Заголовок = Объект.Комментарий;
	Иначе
		Элементы.ОткрытьКомментарий.Заголовок = НСтр("ru = 'не указан'; en = 'not specified'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ОткрытьКомментарий".
//
Процедура ОткрытьКомментарий(Команда)
	Элементы.ГруппаКомментарий_Всплывающая.Показать();
КонецПроцедуры

&НаКлиенте
// Процедура - Скрыть показать дополнительно.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура СкрытьПоказатьДополнительно(Команда)
	
	Элементы.ГруппаДополнительно.Видимость = Не Элементы.ГруппаДополнительно.Видимость;
	
	ОчиститьСообщения();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Основной менеджер при изменении.
//
// Параметры:
//  Элемент	 - 	 -
//
Процедура ОсновнойМенеджерПриИзменении(Элемент)
	
	Если ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.Ссылка, "ОсновнойМенеджер") <> Объект.ОсновнойМенеджер Тогда
		ЭтотОбъект.ОповеститьОНовойЗаявке = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Клиент создать нового.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура КлиентСоздатьНового()

	Если ЗаполненоФИО() = Истина Тогда
		
		Если Объект.Ссылка.Пустая()
			Или Модифицированность = Истина Тогда
			
			Оповещение = Новый ОписаниеОповещения("СозданиеКлиентаОбработкаОповещения", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Для продолжения операции необходимо сохранить обращение. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
			Возврат;
			
		КонецЕсли;
		
		СоздатьКлиентаЗавершение();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнено имя, фамилия или отчество! '; en = 'The field is not filled '"));		
		Возврат;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Создание клиента завершение.
//
// Параметры:
//  Результат	 - 	 -
//  Параметры	 - 	 -
//
Процедура СозданиеКлиентаОбработкаОповещения(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Записан = ЭтаФорма.Записать();
		      
		Если Записан Тогда
			СоздатьКлиентаЗавершение();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Создать клиента по входящей заявке.
//
Процедура СоздатьКлиентаЗавершение()
	
	ОписаниеОшибки = "";
	Результат 	   = ОбработкаСозданияКлиентаИСделки(ОписаниеОшибки, ЗаписьНаПрием);
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ПоказатьПредупреждение(, ?(ЗначениеЗаполнено(ОписаниеОшибки), ОписаниеОшибки, НСтр("ru = 'Не удалось создать клиента!'; en = 'Failed to create client!'")));
	Иначе
		
		УстановитьСостояниеЭлементовФормыСтатусыЗаявки();
		Оповестить("ЗаписанНовыйКлиент", Результат, ЭтаФорма);
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Заявка"				, Объект.Ссылка);
		ПараметрыОповещения.Вставить("ОсновнойМенеджер"		, Объект.ОсновнойМенеджер);
		ПараметрыОповещения.Вставить("СтруктурнаяЕдиница"	, Объект.СтруктурнаяЕдиница);
		
		Оповестить("ОбновленСтатусЗаявки", ПараметрыОповещения);
		
		Если ЗаписьНаПрием = Истина Тогда
			
			ПараметрыОткрытия = Новый Структура("ЗаписьИзДругойФормы, Контрагент", Истина, Результат);
			 
			ИмяФормыПланировщика = ОбщегоНазначенияКлиент.ПолучитьИмяФормыПланировщика(ПараметрыОткрытия, "ФормаЗаписи");
			ОткрытьФорму(ИмяФормыПланировщика, ПараметрыОткрытия,, Новый УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Иначе 
			
			ПоказатьЗначение(,Результат);
			ЭтаФорма.Закрыть();

		КонецЕсли;
	
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
// Функция, создает клиента и сделку.
//
Функция ОбработкаСозданияКлиентаИСделки(ОписаниеОшибки, ЗаписьНаПрием)
	
	ОсновнойКлиент = СоздатьПотенциальногоКлиентаПоВходящейЗаявке(Объект.Ссылка, ОписаниеОшибки);
	
	Если ЗначениеЗаполнено(ОсновнойКлиент) Тогда
		
		Объект.ОсновнойКлиент   = ОсновнойКлиент;
		ЭтотОбъект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Принята;
		
		Если Объект.Статус <> ЭтотОбъект.СтатусЗаявки Тогда
			Объект.Статус = ЭтотОбъект.СтатусЗаявки;
		КонецЕсли;
		
		ЭтотОбъект.ОповеститьОНовойЗаявке = Истина;
		ЭтаФорма.Записать();
		
		УстановитьСостояниеЭлементовФормы();
		
		Сделка = Неопределено;
		
		Если НЕ ЗаписьНаПрием = Истина Тогда
			
			Если ЗначениеЗаполнено(ЭтаФорма.ВидСделки) Тогда
				Сделка = СоздатьСделку(Объект.ОсновнойКлиент, ЭтаФорма.ВидСделки);					
			КонецЕсли;
			
		КонецЕсли;
		
		Задачи.Взаимодействие.ОбновитьЗадачиПоЗаявке(Объект.Ссылка, ОсновнойКлиент, Сделка);
		
		Возврат ОсновнойКлиент;
		
	Иначе
		Возврат ОписаниеОшибки;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Процедура - Выбор существующего клиента.
//
Процедура ВыбратьСуществующегоКлиента()
		
	Оповещение = Новый ОписаниеОповещения("ВыбратьСуществующегоКлиентаЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	МассивДублей   = СписокДублей.ВыгрузитьЗначения();
	
	Если ЗначениеЗаполнено(МассивДублей) Тогда
		ПараметрыФормы.Вставить("МассивДублей", МассивДублей);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ВыборКлиента"  , Истина);
	ПараметрыФормы.Вставить("ЗаголовокФормы", НСтр("ru='Список дублей по номеру телефона и электронной почте клиента';en='List duplicates by phone number and email client'"));
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораКлиенты", ПараметрыФормы,,,,, Оповещение);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ОткрытьКонтрагента".
//
Процедура ОткрытьКонтрагента(Команда)
	
	ОткрытьПотенциальногоКлиента();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Клиент выбрать существующего завершение.
//
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
//
Процедура ВыбратьСуществующегоКлиентаЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ФИОКлиента = ПолучитьФИОКлиента(Результат);
	
	Объект.ОсновнойКлиент	 = Результат;
	Объект.Имя				 = ФИОКлиента.Имя;
	Объект.Фамилия			 = ФИОКлиента.Фамилия;
	Объект.Отчество			 = ФИОКлиента.Отчество;
	Объект.Наименование		 = СокрЛП(Объект.Фамилия + ?(ЗначениеЗаполнено(Объект.Фамилия), " ", "") + Объект.Имя + ?(ЗначениеЗаполнено(Объект.Имя), " ", "") + Объект.Отчество);
	
	//Если СделкиУКлиентаСуществуют(, , Объект.ОсновнойКлиент) Тогда 
	//	ЭтотОбъект.СтатусЗаявки = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Принята");
	//КонецЕсли;
	
	ЭтаФорма.Записать();
	Элементы.ПоказатьНаличиеДублейКлиентов.Видимость = Ложь; 
	Элементы.ОткрытьКонтрагента.Заголовок = Объект.Наименование;
	СоздатьВиджетСделки();
	
	УстановитьСостояниеЭлементовФормыСтатусыЗаявки();
	УстановитьСостояниеЭлементовФормы();
	//ЭтаФорма.Прочитать();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Наличие дублей клиентов.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура ПоказатьНаличиеДублейКлиентов(Команда)
		
	ВыбратьСуществующегоКлиента();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Статус не обработана.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура СтатусНеОбработана(Команда)
	
	ЭтотОбъект.СтатусЗаявки = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.НеОбработана");
	
	РезультатОперации = УстановитьСтатусИЗаписатьФорму();
	
	Если РезультатОперации.ВыполненоУспешно = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Заявка"				, Объект.Ссылка);
	ПараметрыОповещения.Вставить("ОсновнойМенеджер"		, Объект.ОсновнойМенеджер);
	ПараметрыОповещения.Вставить("СтруктурнаяЕдиница"	, Объект.СтруктурнаяЕдиница);
	
	Оповестить("ОбновленСтатусЗаявки", ПараметрыОповещения);
	
	УстановитьСостояниеЭлементаФормыСтатусЗаявки(Неопределено);
	Элементы.ГруппаСтатусНеОбработана.ЦветФона	 = ПолучитьЦветСтатусаЗаявки(ЭтотОбъект.СтатусЗаявки);
	Элементы.СтатусНеОбработана.ЦветТекста		 = Новый Цвет(255, 255, 255);
	
	УстановитьСостояниеЭлементовФормы();

КонецПроцедуры

&НаКлиенте
// Процедура - Статус в работе.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура СтатусПропущенныйЗвонок(Команда)
	
	ЭтотОбъект.СтатусЗаявки = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ПропущенныйЗвонок");
	
	РезультатОперации = УстановитьСтатусИЗаписатьФорму();
	
	Если РезультатОперации.ВыполненоУспешно = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Заявка"				, Объект.Ссылка);
	ПараметрыОповещения.Вставить("ОсновнойМенеджер"		, Объект.ОсновнойМенеджер);
	ПараметрыОповещения.Вставить("СтруктурнаяЕдиница"	, Объект.СтруктурнаяЕдиница);
	
	Оповестить("ОбновленСтатусЗаявки", ПараметрыОповещения);
	
	УстановитьСостояниеЭлементаФормыСтатусЗаявки(Неопределено);
	Элементы.ГруппаСтатусПропущенныйЗвонок.ЦветФона = Новый Цвет(253, 176, 81);
	
	УстановитьСостояниеЭлементовФормы();

КонецПроцедуры

&НаКлиенте
// Процедура - Статус в работе.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура СтатусОтвеченныйЗвонок(Команда)
	
	ЭтотОбъект.СтатусЗаявки = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ОтвеченныйЗвонок");
	
	РезультатОперации = УстановитьСтатусИЗаписатьФорму();
	
	Если РезультатОперации.ВыполненоУспешно = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Заявка"				, Объект.Ссылка);
	ПараметрыОповещения.Вставить("ОсновнойМенеджер"		, Объект.ОсновнойМенеджер);
	ПараметрыОповещения.Вставить("СтруктурнаяЕдиница"	, Объект.СтруктурнаяЕдиница);
	
	Оповестить("ОбновленСтатусЗаявки", ПараметрыОповещения);
	
	УстановитьСостояниеЭлементаФормыСтатусЗаявки(Неопределено);
	Элементы.ГруппаСтатусОтвеченныйЗвонок.ЦветФона = Новый Цвет(163, 212, 155);
	
	УстановитьСостояниеЭлементовФормы();

КонецПроцедуры

&НаКлиенте
// Процедура - Статус в работе.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура СтатусОтвеченныйДиалог(Команда)
	
	ЭтотОбъект.СтатусЗаявки = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ОтвеченныйДиалог");
	
	РезультатОперации = УстановитьСтатусИЗаписатьФорму();
	
	Если РезультатОперации.ВыполненоУспешно = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Заявка"				, Объект.Ссылка);
	ПараметрыОповещения.Вставить("ОсновнойМенеджер"		, Объект.ОсновнойМенеджер);
	ПараметрыОповещения.Вставить("СтруктурнаяЕдиница"	, Объект.СтруктурнаяЕдиница);
	
	Оповестить("ОбновленСтатусЗаявки", ПараметрыОповещения);
	
	УстановитьСостояниеЭлементаФормыСтатусЗаявки(Неопределено);
	Элементы.ГруппаСтатусОтвеченныйДиалог.ЦветФона = Новый Цвет(163, 212, 155);
	
	УстановитьСостояниеЭлементовФормы();

КонецПроцедуры

&НаКлиенте
// Процедура - Статус в работе.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура СтатусПерезвонить(Команда)
	
	ЭтотОбъект.СтатусЗаявки = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Перезвонить");
	
	РезультатОперации = УстановитьСтатусИЗаписатьФорму();
	
	Если РезультатОперации.ВыполненоУспешно = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Заявка"				, Объект.Ссылка);
	ПараметрыОповещения.Вставить("ОсновнойМенеджер"		, Объект.ОсновнойМенеджер);
	ПараметрыОповещения.Вставить("СтруктурнаяЕдиница"	, Объект.СтруктурнаяЕдиница);
	
	Оповестить("ОбновленСтатусЗаявки", ПараметрыОповещения);
	
	УстановитьСостояниеЭлементаФормыСтатусЗаявки(Неопределено);
	Элементы.ГруппаСтатусПерезвонить.ЦветФона = Новый Цвет(255, 238, 149);
	
	УстановитьСостояниеЭлементовФормы();

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура СтатусНекачественная(Команда)
	
	ОценкаЗаявкиНачалоВыбора();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Статус обработана.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура СтатусОбработана(Команда)
	
	УстановитьФокусЭлемента();
	
	Если Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Принята") Тогда
		
		ВидыСделокСписок = ПолучитьВидыСделок(, Объект.СтруктурнаяЕдиница);
		СписокВыбора 	 = Новый СписокЗначений();
		
		СписокВыбора.Добавить("НазначитьПрием", НСтр("ru = 'Записать на прием'"));
		СписокВыбора.Добавить("СоздатьКлиента", НСтр("ru = 'Записать на прием позже'"));
		
		Для каждого ЭлементСписка Из ВидыСделокСписок Цикл
			СписокВыбора.Добавить(ЭлементСписка.Значение, НСтр("ru = 'Записать на прием + '; en = 'Make an appointment + '") + ЭлементСписка.Представление); 
		КонецЦикла;
			
		СписокВыбора.Добавить("ВыбратьСуществующего", НСтр("ru = 'Существующий пациент'"));
		
		Оповещение = Новый ОписаниеОповещения("СтатусОбработанЗавершение", ЭтотОбъект);
		ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Элементы.СтатусОбработана);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Открыть потенциального клиента.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура ОткрытьПотенциальногоКлиента()

	УстановитьФокусЭлемента();
	
	Если ЗначениеЗаполнено(Объект.ОсновнойКлиент) Тогда
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаЭлементаКлиенты", Новый Структура("Ключ", Объект.ОсновнойКлиент),,,,,, РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Статус обработана.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура СтатусОбработанЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли Результат.Значение = "СоздатьКлиента" Тогда
		
		КлиентСоздатьНового(); 
		
	ИначеЕсли Результат.Значение = "НазначитьПрием" Тогда
		
		ЗаписьНаПрием = Истина;
		КлиентСоздатьНового();
		                                             
	ИначеЕсли Результат.Значение = "ВыбратьСуществующего" Тогда
		
		ВыбратьСуществующегоКлиента();
		
	ИначеЕсли Результат.Значение = "НекачественнаяЗаявка" Тогда
		
		ОценкаЗаявкиНачалоВыбора();
		Возврат;
		
	ИначеЕсли ТипЗнч(Результат.Значение) = Тип("СправочникСсылка.ВидыСделок") Тогда
		
		Если Объект.Ссылка.Пустая()
			ИЛИ Объект.ОсновнойКлиент.Пустая() Тогда
			
			КлиентСоздатьНового();
			
		Иначе
			
			ЭтотОбъект.СтатусЗаявки = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Принята");
			
			Если Объект.Статус <> ЭтотОбъект.СтатусЗаявки Тогда
				Объект.Статус = ЭтотОбъект.СтатусЗаявки;
			КонецЕсли;
			
			ЭтаФорма.Записать();
			
		КонецЕсли;
		
		УстановитьСостояниеЭлементовФормыСтатусыЗаявки();
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ЗаписьИзДругойФормы", Истина);
		ПараметрыОткрытия.Вставить("Контрагент"			, Объект.ОсновнойКлиент);
		ПараметрыОткрытия.Вставить("Сделка"				, СоздатьСделку(Объект.ОсновнойКлиент, Результат.Значение));
		
		Оповестить("ОБНОВИТЬ_СВЕДЕНИЯ_ПО_СДЕЛКАМ", ПараметрыОткрытия.Сделка);
		
		ИмяФормыПланировщика = ОбщегоНазначенияКлиент.ПолучитьИмяФормыПланировщика(ПараметрыОткрытия, "ФормаЗаписи");
		ОткрытьФорму(ИмяФормыПланировщика, ПараметрыОткрытия,, Новый УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;

	УстановитьСостояниеЭлементовФормы();

КонецПроцедуры

&НаКлиенте
// Процедура - Оценка заявки начало выбора.
//
// Параметры:
//  Элемент				 - 	 -
//  ДанныеВыбора		 - 	 -
//  СтандартнаяОбработка - 	 -
//
Процедура ОценкаЗаявкиНачалоВыбора()
		
	ОткрытьФорму("Справочник.ОценкиКачестваЗаявок.ФормаВыбора",,,,,, Новый ОписаниеОповещения("ОценкаЗаявкиВыборЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Оценка заявки выбор завершение.
//
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
//
Процедура ОценкаЗаявкиВыборЗавершение(Результат, ДопПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.СтатусЗаявки = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Отклонена");
	Объект.ОценкаЗаявки  	= Результат;
	Объект.ОсновнойМенеджер = ?(Объект.ОсновнойМенеджер <> ЭтотОбъект.ТекущийПользователь, ЭтотОбъект.ТекущийПользователь, Объект.ОсновнойМенеджер);
	
	РезультатОперации = УстановитьСтатусИЗаписатьФорму();
	
	Если РезультатОперации.ВыполненоУспешно = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Заявка"				, Объект.Ссылка);
	ПараметрыОповещения.Вставить("ОсновнойМенеджер"		, Объект.ОсновнойМенеджер);
	ПараметрыОповещения.Вставить("СтруктурнаяЕдиница"	, Объект.СтруктурнаяЕдиница);
	
	Оповестить("ОбновленСтатусЗаявки", ПараметрыОповещения);
	
	УстановитьСостояниеЭлементовФормыСтатусыЗаявки();
	УстановитьСостояниеЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" полей "Фамилия", "Имя", "Отчество".
//
Процедура ФИОПриИзменении(Элемент = Неопределено)
		
	// Фамилия.
	Объект.Фамилия = СокрЛП(Объект.Фамилия);
	Объект.Фамилия = ВРег(Сред(Объект.Фамилия, 1, 1)) + НРег(Сред(Объект.Фамилия, 2));
	// Имя.
	Объект.Имя = СокрЛП(Объект.Имя);
	Объект.Имя = ВРег(Сред(Объект.Имя, 1, 1)) + НРег(Сред(Объект.Имя, 2));
	// Отчество.
	Объект.Отчество = СокрЛП(Объект.Отчество);
	Объект.Отчество = ВРег(Сред(Объект.Отчество, 1, 1)) + НРег(Сред(Объект.Отчество, 2));
	
	Объект.Наименование = СокрЛП(Объект.Фамилия + ?(ЗначениеЗаполнено(Объект.Фамилия), " ", "") + Объект.Имя + ?(ЗначениеЗаполнено(Объект.Имя), " ", "") + Объект.Отчество);
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ОткрытьНастройкаОбязательныеПоля".
//
Процедура ОткрытьНастройкаОбязательныеПоля(Команда)
	
	ОткрытьФорму("Справочник.Заявки.Форма.ФормаНастройкиОбязательныхПолей");
	
КонецПроцедуры

#Область ФильтрацияДанныхИсторииВзаимодействия

&НаКлиенте 
// Процедура - Показать фильтры.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПоказатьФильтры(Команда)  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыФормы.Вставить("СписокФильтрацииИсторииВзаимодействия", СписокФильтрацииИсторииВзаимодействия);
	
	ФормаФильтровОписаниеОповещения = Новый ОписаниеОповещения("ВыборФильтровИсторииВзаимодействияЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаФильтровИсторииВзаимодействия", ПараметрыФормы,,,,, ФормаФильтровОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
		
КонецПроцедуры  

&НаСервере 
// Процедура - Выбор фильтров истории взаимодействия завершение.
//
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
//
Процедура ВыборФильтровИсторииВзаимодействияЗавершение(Результат, Параметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СписокФильтрацииИсторииВзаимодействия = Результат;	
	
	Если НЕ Объект.Ссылка.Пустая() Тогда		
		ОбновитьИсториюВзаимодействияСКлиентом();
	КонецЕсли;
	
	ФильтрПрименен = ФильтрПрименен(СписокФильтрацииИсторииВзаимодействия);	
	Элементы.ОчиститьФильтры.Видимость	= ФильтрПрименен;
	Элементы.ПоказатьФильтры.Картинка	= ?(ФильтрПрименен, БиблиотекаКартинок.ФильтрУстановлен, БиблиотекаКартинок.ФильтрНеУстановлен);
	
	ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить("Справочники.Заявки.Форма.ФормаЭлемента", "НастройкиФильтрации", СписокФильтрацииИсторииВзаимодействия);
		
КонецПроцедуры

&НаКлиенте 
// Процедура - Декорация фильтры очистить нажатие.
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ОчиститьФильтры(Команда)
	
	ОбщегоНазначенияКлиентСерверСтоматология.ЗаполнитьСписокФильтрацииИсторииВзаимодействияПоУмолчанию(СписокФильтрацииИсторииВзаимодействия,,, Объект.Ссылка);	
	Элементы.ОчиститьФильтры.Видимость	= Ложь;
	Элементы.ПоказатьФильтры.Картинка	= БиблиотекаКартинок.ФильтрНеУстановлен;
	
	ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить("Справочники.Заявки.Форма.ФормаЭлемента", "НастройкиФильтрации", СписокФильтрацииИсторииВзаимодействия);

	Если НЕ Объект.Ссылка.Пустая() Тогда		
		ОбновитьИсториюВзаимодействияСКлиентом();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область КонтактнаяИнформация

&НаКлиенте
// Процедура - Добавить контактную информацию.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура ДобавитьКонтактнуюИнформацию(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьКонтактнуюИнформациюВидВыбран", ЭтотОбъект);
	СписокДоступныхВидов = УправлениеКонтактнойИнформациейКлиентСерверСтоматология.СписокВидовДляДобавленияКонтактнойИнформации(ЭтаФорма.СвойстваВидовКонтактнойИнформации, ЭтаФорма.КонтактнаяИнформация);
	ЭтаФорма.ПоказатьВыборИзМеню(ОписаниеОповещения, СписокДоступныхВидов, Элементы.КнопкаДобавитьКонтактнуюИнформацию);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить контактную информацию вид выбран.
//
// Параметры:
//  ВыбранныйЭлемент		 - 	 -
//  ДополнительныеПараметры	 - 	 -
//
Процедура ДобавитьКонтактнуюИнформациюВидВыбран(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("Вид", ВыбранныйЭлемент.Значение);
	
	НайденныеСтроки = ЭтаФорма.СвойстваВидовКонтактнойИнформации.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	ДобавитьКонтактнуюИнформациюСервер(ВыбранныйЭлемент.Значение);
	
КонецПроцедуры

&НаСервере
// Процедура - Добавить контактную информацию сервер.
//
// Параметры:
//  ДобавляемыйВид				 - 	 -
//  УстановитьВыводВФормеВсегда	 - 	 -
//
Процедура ДобавитьКонтактнуюИнформациюСервер(ДобавляемыйВид, УстановитьВыводВФормеВсегда = Ложь) Экспорт
		
	УправлениеКонтактнойИнформациейСтоматология.ДобавитьКонтактнуюИнформацию(ЭтаФорма, Объект, ДобавляемыйВид, УстановитьВыводВФормеВсегда);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый представление КИПри изменении.
//
// Параметры:
//  Элемент	 - 	 -
//
Процедура Подключаемый_ПредставлениеКИПриИзменении(Элемент)
		
	УправлениеКонтактнойИнформациейКлиентСтоматология.ПредставлениеКИПриИзменении(ЭтотОбъект, Элемент, Истина);


	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый представление КИНачало выбора.
//
// Параметры:
//  Элемент				 - 	 -
//  ДанныеВыбора		 - 	 -
//  СтандартнаяОбработка - 	 -
//
Процедура Подключаемый_ПредставлениеКИНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	УправлениеКонтактнойИнформациейКлиентСтоматология.ПредставлениеКИНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Значение КИРедактирование в диалоге завершено.
//
// Параметры:
//  РезультатЗакрытия		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ЗначениеКИРедактированиеВДиалогеЗавершено(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеКИ = ЭтаФорма.КонтактнаяИнформация[ДополнительныеПараметры.ИндексКИ];
	
	ДанныеКИ.Представление	 = РезультатЗакрытия.Представление;
	ДанныеКИ.ЗначенияПолей	 = РезультатЗакрытия.КонтактнаяИнформация;
	ДанныеКИ.Комментарий	 = РезультатЗакрытия.Комментарий;
	
	Модифицированность = Истина;
	
	Если ДанныеКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ЗаполнитьСписокВыбораАдресов(ЭтаФорма);
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ОповещениеОЗакрытииДиалога") Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗакрытииДиалога, РезультатЗакрытия.Представление);
	КонецЕсли;
	
	ПроверкаДублированияКлиентаКонтактнаяИнформация(ДанныеКИ, ДанныеКИ.Представление);
		

КонецПроцедуры

&НаКлиенте
// Процедура - Представление КИПри изменении.
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ПредставлениеКИПриИзменении(Элемент) Экспорт
	
	ИндексКИ = Число(Сред(Элемент.Имя, СтрДлина("ПредставлениеКИ_")+1));
	ДанныеКИ = ЭтаФорма.КонтактнаяИнформация[ИндексКИ];
	
	Если ПустаяСтрока(ДанныеКИ.Представление) Тогда
		ДанныеКИ.ЗначенияПолей = "";
	Иначе
		ДанныеКИ.ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(ДанныеКИ.Представление, ДанныеКИ.Вид);
	КонецЕсли;
	
	Если ДанныеКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ЗаполнитьСписокВыбораАдресов(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый представление КИОчистка.
//
// Параметры:
//  Элемент				 - 	 -
//  СтандартнаяОбработка - 	 -
//
Процедура Подключаемый_ПредставлениеКИОчистка(Элемент, СтандартнаяОбработка)
		
	УправлениеКонтактнойИнформациейКлиентСтоматология.ПредставлениеКИОчистка(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый контактная информация авто подбор
//
// Параметры:
//  Элемент					 - 	 - 
//  Текст					 - 	 - 
//  ДанныеВыбора			 - 	 - 
//  ПараметрыПолученияДанных - 	 - 
//  Ожидание				 - 	 - 
//  СтандартнаяОбработка	 - 	 - 
//
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.АвтоПодбор(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый контактная информация обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый комментарий КИПри изменении.
//
// Параметры:
//  Элемент	 - 	 -
//
Процедура Подключаемый_КомментарийКИПриИзменении(Элемент)
		
	УправлениеКонтактнойИнформациейКлиентСтоматология.КомментарийКИПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый контактная информация выполнить команду.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура Подключаемый_КонтактнаяИнформация_ВыполнитьКоманду(Команда)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ВыполнитьКоманду(ЭтотОбъект, Команда);
		
КонецПроцедуры

&НаКлиенте 
// Процедура - Подключаемый перейти к диалогу
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ПерейтиКДиалогу(Элемент)	
	
	Если Объект.Ссылка.Пустая() Тогда
		Оповещение = Новый ОписаниеОповещения("ВзаимодействиеПослеВопросаОЗаписиЗаявки", ЭтотОбъект, Новый Структура("ВыполнитьДействие, Элемент", "ПерейтиКДиалогу", Элемент));
		ПоказатьВопрос(Оповещение, "Для перехода в мессенджер необходимо произвести запись новой заявки. Записать?", РежимДиалогаВопрос.ДаНет);
	Иначе
		
		Если Модифицированность И Не ЭтаФорма.Записать() Тогда
			Возврат;
		КонецЕсли;
		
		ИндексСтроки = Число(Сред(Элемент.Имя, СтрДлина("ПерейтиКДиалогу_")+1));
		ДанныеКИ     = ЭтотОбъект.КонтактнаяИнформация[ИндексСтроки];
		
		ПредставлениеНомераТелефона = ДанныеКИ.Представление;
		ПредставлениеНомераТелефона = СтрЗаменить(ПредставлениеНомераТелефона, " ", "");
		ПредставлениеНомераТелефона = СтрЗаменить(ПредставлениеНомераТелефона, "(", "");
		ПредставлениеНомераТелефона = СтрЗаменить(ПредставлениеНомераТелефона, ")", "");
		ПредставлениеНомераТелефона = СтрЗаменить(ПредставлениеНомераТелефона, "+", "");
		
		Если НЕ ЗначениеЗаполнено(ПредставлениеНомераТелефона) Тогда
			ОбщегоНазначения.СообщитьПользователю("Пустой номер телефона клиента");
			Возврат;
		КонецЕсли;

		ДанныеВнешнихСистемМессенджера = ПолучитьДоступныеВнешниеСистемыМессенджера(Объект.Ссылка, ТекущаяСтруктурнаяЕдиница, Истина, ПредставлениеНомераТелефона);
					
		Если ДанныеВнешнихСистемМессенджера.Количество() = 0 Тогда
			Возврат;
		ИначеЕсли ДанныеВнешнихСистемМессенджера.Количество() = 1 Тогда
			Подключаемый_ПерейтиКДиалогуЗавершение(ДанныеВнешнихСистемМессенджера[0],Неопределено);
			Возврат;
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ПерейтиКДиалогуЗавершение", ЭтотОбъект);
		
		ПоказатьВыборИзМеню(ОписаниеОповещения, ДанныеВнешнихСистемМессенджера, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения асинхронного события.
//
Процедура Подключаемый_ПерейтиКДиалогуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = Результат.Значение.Идентификатор;
	ВнешняяСистема= Результат.Значение.ВнешняяСистема;
	
	ОписаниеОшибки = "";
	
	ИдСообщения = УстановитьОжиданиеСообщения(Идентификатор,ВнешняяСистема,ОписаниеОшибки,Объект.Ссылка,Результат.Значение.НомерМессенджера);
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ДанныеКанала = Новый Структура;
	ДанныеКанала.Вставить("ИдКлиента"		, Идентификатор);
	ДанныеКанала.Вставить("ВнешняяСистема"	, ВнешняяСистема);
	ДанныеКанала.Вставить("ИдСообщения"		, ИдСообщения);
	
	ПараметрыОткрытия = Новый Структура("ДанныеКанала", ДанныеКанала);
	
	Оповестить("ОткрытьДиалог", ПараметрыОткрытия);
	ОткрытьФорму("Обработка.Мессенджер_Стоматология.Форма", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаСервере
// Процедура - Добавить реквизиты формы контактной информации.
//
// Параметры:
//  Форма	 - 	 -
//
Процедура ДобавитьРеквизитыФормыКонтактнойИнформации()

// МассивДобавляемыхРеквизитов = Новый Массив;
// СписокРеквизитовФормы = ЭтаФорма.ПолучитьРеквизиты();
//
// СоздатьТаблицуКонтактнаяИнформация = Истина;
// СоздатьТаблицуСвойстваВидовКонтактнойИнформации = Истина;
//
// Для Каждого Реквизит Из СписокРеквизитовФормы Цикл
//	Если Реквизит.Имя = "КонтактнаяИнформация" Тогда
//		СоздатьТаблицуКонтактнаяИнформация = Ложь;
//	ИначеЕсли Реквизит.Имя = "СвойстваВидовКонтактнойИнформации" Тогда
//		СоздатьТаблицуСвойстваВидовКонтактнойИнформации = Ложь;
//	КонецЕсли;
// КонецЦикла;
//
// ОписаниеСтрока = Новый ОписаниеТипов("Строка");
// ОписаниеБулево = Новый ОписаниеТипов("Булево");
//
// Если СоздатьТаблицуКонтактнаяИнформация Тогда
//	
//	ИмяТаблицы = "КонтактнаяИнформация";
//	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений"),,, Истина));
//	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Вид", Новый ОписаниеТипов("СправочникСсылка.ВидыКонтактнойИнформации"), ИмяТаблицы));
//	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Тип", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"), ИмяТаблицы));
//	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Представление", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500)), ИмяТаблицы));
//	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Комментарий", ОписаниеСтрока, ИмяТаблицы));
//	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЗначенияПолей", ОписаниеСтрока, ИмяТаблицы));
//	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("НеУчаствоватьВРассылке", ОписаниеБулево, ИмяТаблицы));
//	
// КонецЕсли;
//
// Если СоздатьТаблицуСвойстваВидовКонтактнойИнформации Тогда
//	
//	ИмяТаблицы = "СвойстваВидовКонтактнойИнформации";
//	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений"),,, Истина));
//	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Вид", Новый ОписаниеТипов("СправочникСсылка.ВидыКонтактнойИнформации"), ИмяТаблицы));
//	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПредставлениеВида", ОписаниеСтрока, ИмяТаблицы));
//	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Тип", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"), ИмяТаблицы));
//	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВыводитьВФормеВсегда", ОписаниеБулево, ИмяТаблицы));
//	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("РазрешитьВводНесколькихЗначений", ОписаниеБулево, ИмяТаблицы));
//	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ОбязательноеЗаполнение", ОписаниеБулево, ИмяТаблицы));
//	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Подсказка", ОписаниеСтрока, ИмяТаблицы));
//	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПроверятьКорректность", ОписаниеБулево, ИмяТаблицы));
//	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("РедактированиеТолькоВДиалоге", ОписаниеБулево, ИмяТаблицы));
//	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("МногострочноеПоле", ОписаниеБулево, ИмяТаблицы));
//	
// КонецЕсли;
//
// Если МассивДобавляемыхРеквизитов.Количество() > 0 Тогда
//	ЭтаФорма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
// КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура - Прочитать свойства видов контактной информации.
//
// Параметры:
//  Форма			 - 	 -
//  ГруппаВидовКИ	 - 	 -
//
Процедура ПрочитатьСвойстваВидовКонтактнойИнформации(ГруппаВидовКИ)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПорядокТиповКИ.Тип КАК Тип,
	|	ПорядокТиповКИ.Порядок КАК Порядок
	|ПОМЕСТИТЬ втПорядокТипов
	|ИЗ
	|	&ПорядокТиповКИ КАК ПорядокТиповКИ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка КАК Вид,
	|	ПРЕДСТАВЛЕНИЕ(ВидыКонтактнойИнформации.Ссылка) КАК ПредставлениеВида,
	|	ВидыКонтактнойИнформации.Тип КАК Тип,
	|	ВидыКонтактнойИнформации.ВыводитьПоУмолчанию КАК ВыводитьВФормеВсегда,
	|	ВидыКонтактнойИнформации.РазрешитьВводНесколькихЗначений КАК РазрешитьВводНесколькихЗначений,
	|	ВидыКонтактнойИнформации.ОбязательноеЗаполнение КАК ОбязательноеЗаполнение,
	|	ВидыКонтактнойИнформации.Подсказка КАК Подсказка,
	|	ВидыКонтактнойИнформации.ПроверятьКорректность КАК ПроверятьКорректность,
	|	ВидыКонтактнойИнформации.РедактированиеТолькоВДиалоге КАК РедактированиеТолькоВДиалоге,
	|	ВидыКонтактнойИнформации.МногострочноеПоле КАК МногострочноеПоле
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПорядокТипов КАК втПорядокТипов
	|		ПО ВидыКонтактнойИнформации.Тип = втПорядокТипов.Тип
	|ГДЕ
	|	ВидыКонтактнойИнформации.ПометкаУдаления = ЛОЖЬ
	|	И ВидыКонтактнойИнформации.Родитель = &ГруппаВидовКИ
	|	И ВидыКонтактнойИнформации.Используется
	|
	|УПОРЯДОЧИТЬ ПО
	|	втПорядокТипов.Порядок,
	|	ВидыКонтактнойИнформации.РеквизитДопУпорядочивания");
	
	Запрос.УстановитьПараметр("ПорядокТиповКИ", ПорядокТиповКИ());
	Запрос.УстановитьПараметр("ГруппаВидовКИ" , ГруппаВидовКИ);
	
	ТаблицаСвойств = Запрос.Выполнить().Выгрузить();
	ЭтаФорма.СвойстваВидовКонтактнойИнформации.Загрузить(ТаблицаСвойств);
	
КонецПроцедуры

&НаСервере
// Функция - Есть другие заполненные строки вида КИ.
//
// Параметры:
//  Форма					 - 	 -
//  ПроверяемаяСтрока		 - 	 -
//  ВидКонтактнойИнформации	 - 	 -
//
// Возвращаемое значение:
//   -
//
Функция ЕстьДругиеЗаполненныеСтрокиВидаКИ(Знач ПроверяемаяСтрока, Знач ВидКонтактнойИнформации)

ВсеСтрокиЭтогоВида = ЭтаФорма.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", ВидКонтактнойИнформации));

Для Каждого СтрокаВида Из ВсеСтрокиЭтогоВида Цикл
	
	Если СтрокаВида <> ПроверяемаяСтрока 
		И Не ПустаяСтрока(СтрокаВида.Представление) Тогда
		
		Возврат Истина;
	КонецЕсли;
	
КонецЦикла;

Возврат Ложь;

КонецФункции

&НаСервере
// Процедура - Добавить команду контекстного меню.
//
// Параметры:
//  Форма		 - 	 -
//  ИмяКоманды	 - 	 -
//  Картинка	 - 	 -
//  Заголовок	 - 	 -
//  Подсказка	 - 	 -
//  ПолеВладелец - 	 -
//
Процедура ДобавитьКомандуКонтекстногоМеню(ИмяКоманды, Картинка, Заголовок, Подсказка, ПолеВладелец)

Если ЭтаФорма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
	
	Команда = ЭтаФорма.Команды.Добавить(ИмяКоманды);
	Команда.Картинка  = Картинка;
	Команда.Заголовок = Заголовок;
	Команда.Подсказка = Подсказка;
	Команда.Действие  = "Подключаемый_КонтактнаяИнформация_ВыполнитьКоманду";
	
КонецЕсли;

Кнопка = ЭтаФорма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ПолеВладелец.КонтекстноеМеню);
Кнопка.ИмяКоманды = ИмяКоманды;

КонецПроцедуры

&НаСервере
// Процедура - Добавить команду контекстного меню.
//
// Параметры:
//  Форма		 - 	 -
//  ИмяКоманды	 - 	 -
//  Картинка	 - 	 -
//  Заголовок	 - 	 -
//  Подсказка	 - 	 -
//  ПолеВладелец - 	 -
//
Процедура ДобавитьКомандуКнопкой(ИмяКоманды, Картинка, Заголовок, Подсказка, ГруппаДействий)

Если ЭтаФорма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
	
	Команда = ЭтаФорма.Команды.Добавить(ИмяКоманды);
	Команда.Отображение = ОтображениеКнопки.Картинка;
	Команда.Картинка    = Картинка;
	Команда.Заголовок   = Заголовок;
	Команда.Подсказка   = Подсказка;
	Команда.Действие    = "Подключаемый_КонтактнаяИнформация_ВыполнитьКоманду";
	
КонецЕсли;

Кнопка = ЭтаФорма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ГруппаДействий);
Кнопка.ИмяКоманды = ИмяКоманды;

КонецПроцедуры

&НаКлиенте
// Процедура - Процедура обработки нажатия динамической кнопки.
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ПроцедураОбработкиНажатияДинамическойКнопки(Элемент)
		
	ИндексСтроки = Число(Сред(Элемент.Имя, СтрДлина("РазрешитьЗапретитьРассылку_") + 1));
	
	ЭтаФорма.КонтактнаяИнформация[ИндексСтроки].НеУчаствоватьВРассылке = Не ЭтаФорма.КонтактнаяИнформация[ИндексСтроки].НеУчаствоватьВРассылке;
	
	Элемент.Картинка  = ПолучитьКартинку(ЭтаФорма.КонтактнаяИнформация[ИндексСтроки].НеУчаствоватьВРассылке);
	Элемент.Подсказка = ПолучитьПодсказку(ЭтаФорма.КонтактнаяИнформация[ИндексСтроки].НеУчаствоватьВРассылке);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция - Получить картинку.
//
// Параметры:
//  Флаг - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКартинку(Флаг)
	
	Возврат ?(Флаг, БиблиотекаКартинок.РассылкаЗапрещена, БиблиотекаКартинок.РассылкаРазрешена);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Функция - Получить подсказку.
//
// Параметры:
//  Флаг - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПодсказку(Флаг)
	
	Возврат ?(Флаг, НСтр("ru = 'Рассылка запрещена'; en = 'Distribution prohibited'"), НСтр("ru = 'Рассылка разрешена'; en = 'Distribution allowed'"));

КонецФункции

&НаСервере
// Функция возвращает таблицу типов контактной информации в порядке по умолчанию.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Стандартный порядок типов контактной информации для отображения в интерфейсе.
//
Функция ПорядокТиповКИ() 
	
	ПорядокТиповКИ = Новый ТаблицаЗначений;
	ПорядокТиповКИ.Колонки.Добавить("Тип", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"));
	ПорядокТиповКИ.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	СтрокаТипов.Порядок = 1;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	СтрокаТипов.Порядок = 2;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	СтрокаТипов.Порядок = 3;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.Факс;
	СтрокаТипов.Порядок = 4;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.Skype;
	СтрокаТипов.Порядок = 5;
	
	СтрокаТипов = ПорядокТиповКИ.Добавить();
	СтрокаТипов.Тип = Перечисления.ТипыКонтактнойИнформации.СоциальнаяСеть;
	СтрокаТипов.Порядок = 6;

	Возврат ПорядокТиповКИ;
	
КонецФункции

#КонецОбласти

#Область ИсторияВзаимодействия

&НаСервере
// Процедура - Обновить историю взаимодействия.
//
// Параметры:
//  РежимПодробно	 - 	 -
//  ВыводитьВсе		 - 	 -
//
Процедура ОбновитьИсториюВзаимодействияСКлиентом(Фильтры = Неопределено, РежимПодробно = Ложь, ВыводитьВсе = Ложь)
		
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Фильтры = Новый Структура();
	
	ОбщегоНазначенияКлиентСерверСтоматология.ЗаполнитьСтруктуруФильтрациИсторииВзаимодйствия(СписокФильтрацииИсторииВзаимодействия, Фильтры);
	
	ПараметрыДанных = Новый Структура;
	
	ПараметрыДанных.Вставить("Ссылка"						, Объект.Ссылка);
	ПараметрыДанных.Вставить("ОсновнойКлиент"       		, Объект.ОсновнойКлиент);
	ПараметрыДанных.Вставить("РежимПодробно"    			, Истина);
	ПараметрыДанных.Вставить("ВыводитьВсе"      			, ВыводитьВсеВзаимодействия);
	ПараметрыДанных.Вставить("Фильтры"          			, Фильтры);
	ПараметрыДанных.Вставить("ВнешняяСистема"   			, Объект.ВнешняяСистема);
	ПараметрыДанных.Вставить("ТекущаяСтруктурнаяЕдиница"	, ЭтотОбъект.ТекущаяСтруктурнаяЕдиница);
	ПараметрыДанных.Вставить("ДатаРожденияКлиента"			, Объект.ОсновнойКлиент.ДатаРожденияКлиента);
	ПараметрыДанных.Вставить("ДатаРегистрацииКлиента"		, Объект.ОсновнойКлиент.ДатаРегистрации);
	ПараметрыДанных.Вставить("ВходящийНомерТелефона"		, Объект.ВходящийНомерТелефона);

	ТаблицаИсторииВзаимодействий = Справочники.Заявки.ПолучитьИсториюВзаимодействияЗаявки(ПараметрыДанных, Истина, ПараметрыДанных.Фильтры);	
	ЭтотОбъект.ИсторияВзаимодействий.Загрузить(ТаблицаИсторииВзаимодействий);	
	ТекстHTML = УправлениеИнтерфейсамиСервер.СформироватьИсториюВзаимодействий(ЭтаФорма, ПараметрыДанных, Истина, ПараметрыДанных.ВыводитьВсе); 	
	ЭтотОбъект.ИсторияВзаимодействия = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(ТекстHTML);
	
КонецПроцедуры

&НаСервере
// Функция, формирует таблицу истории взаимодействия.
//
Функция СформироватьТаблицуИсторииВзаимодействия(РежимПодробно)
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|ПОМЕСТИТЬ ВТТелефоны
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаявкиКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|	ИЗ
	|		Справочник.Заявки.КонтактнаяИнформация КАК ЗаявкиКонтактнаяИнформация
	|	ГДЕ
	|		ЗаявкиКонтактнаяИнформация.Ссылка = &Заявка
	|		И ЗаявкиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КонтрагентыКонтактнаяИнформация.НомерТелефона
	|	ИЗ
	|		Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|	ГДЕ
	|		&ВыводИнформацииКлиента
	|		И КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
	|		И КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)) КАК КонтактнаяИнформация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Заявки.Ссылка КАК Взаимодействие,
	|	Заявки.ДатаСоздания КАК Дата,
	|	""ДатаРегистрацииЗаявки"" КАК ТипСобытия,
	|	NULL КАК ТипВзаимодействия,
	|	NULL КАК Автор,
	|	NULL КАК АвторПредставление,
	|	NULL КАК Заметка,
	|	NULL КАК Длительность,
	|	NULL КАК Начало,
	|	NULL КАК Окончание,
	|	NULL КАК Статус,
	|	NULL КАК ВзаимодействиеИД,
	|	""Заметка"" КАК ТипЗадачи,
	|	NULL КАК URLЗаписи,
	|	NULL КАК ФайлЗаписи,
	|	NULL КАК ТекстСообщения,
	|	NULL КАК Сделка
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|ГДЕ
	|	Заявки.Ссылка = &Заявка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка,
	|	Контрагенты.ДатаРожденияКлиента,
	|	""ДеньРожденияКлиента"",
	|	ВЫБОР
	|		КОГДА Контрагенты.ДатаРожденияКлиента = &ТекущаяДата
	|			ТОГДА ""История""
	|		ИНАЧЕ ""Запланировано""
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	&ВыводИнформацииКлиента
	|	И Контрагенты.Ссылка = &Контрагент
	|	И &ДатаРожденияКлиента МЕЖДУ &ТекущаяДата И ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка,
	|	НАЧАЛОПЕРИОДА(Контрагенты.ДатаРегистрации, ДЕНЬ),
	|	""ДатаРегистрацииКлиента"",
	|	""История"",
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	&ВыводИнформацииКлиента
	|	И Контрагенты.Ссылка = &Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка,
	|	ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка.Дата,
	|	""Письмо"",
	|	""История"",
	|	ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка.Автор,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка.Автор),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка.СтатусПисьма,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.ЭлектронноеПисьмоИсходящее.ПолучателиПисьма КАК ЭлектронноеПисьмоИсходящееПолучателиПисьма
	|ГДЕ
	|	НЕ ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка.ПометкаУдаления
	|	И ЭлектронноеПисьмоИсходящееПолучателиПисьма.Контакт В(&ОбъектыОтбора)
	|	И ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	Заметки.Период,
	|	""Заметка"",
	|	""История"",
	|	Заметки.Автор,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Заметки.Автор),
	|	ВЫРАЗИТЬ(Заметки.Заметка КАК СТРОКА(1000)),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	Заметки.ИД,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.Заметки КАК Заметки
	|ГДЕ
	|	Заметки.Объект В(&ОбъектыОтбора)
	|	И Заметки.АктивностьЗаметки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсторияЗвонков.IDЗвонка,
	|	ИсторияЗвонков.НачалоВызова,
	|	ВЫБОР
	|		КОГДА ИсторияЗвонков.ИсходящийЗвонок = ИСТИНА
	|			ТОГДА ""ИсходящийЗвонок""
	|		КОГДА ИсторияЗвонков.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗвонка.Пропущен)
	|			ТОГДА ""ПропущенныйЗвонок""
	|		ИНАЧЕ ""ВходящийЗвонок""
	|	КОНЕЦ,
	|	""История"",
	|	ИсторияЗвонков.Пользователь,
	|	ИсторияЗвонков.Пользователь.НаименованиеСокращенное,
	|	ВЫРАЗИТЬ(ИсторияЗвонков.Заметка КАК СТРОКА(200)),
	|	ВЫБОР
	|		КОГДА ИсторияЗвонков.НачалоРазговора <> ДАТАВРЕМЯ(1, 1, 1)
	|				И ИсторияЗвонков.ОкончаниеЗвонка <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РАЗНОСТЬДАТ(ИсторияЗвонков.НачалоРазговора, ИсторияЗвонков.ОкончаниеЗвонка, СЕКУНДА)
	|		КОГДА ИсторияЗвонков.НачалоВызова <> ДАТАВРЕМЯ(1, 1, 1)
	|				И ИсторияЗвонков.ОкончаниеЗвонка <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РАЗНОСТЬДАТ(ИсторияЗвонков.НачалоВызова, ИсторияЗвонков.ОкончаниеЗвонка, СЕКУНДА)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсторияЗвонков.НачалоРазговора <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ИсторияЗвонков.НачалоРазговора
	|		ИНАЧЕ ИсторияЗвонков.НачалоВызова
	|	КОНЕЦ,
	|	ИсторияЗвонков.ОкончаниеЗвонка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ИсторияЗвонков.URLЗаписи,
	|	ИсторияЗвонков.ФайлЗаписи,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.ИсторияВызовов КАК ИсторияЗвонков
	|ГДЕ
	|	ИсторияЗвонков.НомерТелефона В
	|			(ВЫБРАТЬ
	|				ВТТелефоны.НомерТелефона
	|			ИЗ
	|				ВТТелефоны)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗадачаВзаимодействие.Ссылка,
	|	ВЫБОР
	|		КОГДА ЗадачаВзаимодействие.Выполнена
	|			ТОГДА ЗадачаВзаимодействие.ДатаИсполнения
	|		ИНАЧЕ ЗадачаВзаимодействие.ЗадачаНазначеннаяДата
	|	КОНЕЦ,
	|	""Задача"",
	|	ВЫБОР
	|		КОГДА ЗадачаВзаимодействие.Выполнена
	|			ТОГДА ""История""
	|		ИНАЧЕ ""Запланировано""
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗадачаВзаимодействие.Выполнена
	|			ТОГДА ЗадачаВзаимодействие.ИсполнительФактический
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЗадачаВзаимодействие.Исполнитель ССЫЛКА Справочник.Сотрудники
	|					ТОГДА ЗадачаВзаимодействие.Исполнитель
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗадачаВзаимодействие.Выполнена
	|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗадачаВзаимодействие.ИсполнительФактический)
	|		ИНАЧЕ ЗадачаВзаимодействие.Исполнитель.Наименование
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	""Взаимодействие"",
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЗадачаВзаимодействие.Сделка
	|ИЗ
	|	Задача.Взаимодействие КАК ЗадачаВзаимодействие
	|ГДЕ
	|	НЕ ЗадачаВзаимодействие.ПометкаУдаления
	|	И ЗадачаВзаимодействие.ЗадачаПредмет В(&ОбъектыОтбора)
	|	И ЗадачаВзаимодействие.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ");
	
	ДатаРождения = Неопределено;
	
	ОбъектыОтбора = Новый Массив;
	ОбъектыОтбора.Добавить(Объект.Ссылка);
	
	Если ЗначениеЗаполнено(Объект.ОсновнойКлиент) Тогда
		
		ОбъектыОтбора.Добавить(Объект.ОсновнойКлиент);
		
		ДатаРождения = Объект.ОсновнойКлиент.ДатаРожденияКлиента;
		
		// Если год не высокосный, тогда передвигаем дату рождения на один день. 
		Если ЗначениеЗаполнено(ДатаРождения) 
			И Месяц(ДатаРождения) = 2 
			И День(ДатаРождения) = 29 
			И Не ДеньГода(КонецГода(ТекущаяДатаСеанса())) = 366 Тогда
			
			ДатаРождения = ДатаРождения + 86400;		
		КонецЕсли;
		
	КонецЕсли;
	
	МассивВнешнихСистем = Новый Массив;
	// Если ЗначениеЗаполнено(Объект.ВнешняяСистема) Тогда
	//	МассивВнешнихСистем.Добавить(Объект.ВнешняяСистема);	
	// КонецЕсли;	
	// Если Не ЗначениеЗаполнено(МассивВнешнихСистем) Тогда
	//	МассивВнешнихСистем.Добавить(Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.JivoSite));	
	// КонецЕсли;
	//
	// МассивВнешнихСистемМессенджера = Справочники.ВнешниеСистемы.ПолучитьВнешниеСистемыМессенджера();
	// ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВнешнихСистем, МассивВнешнихСистемМессенджера);
	
	Запрос.УстановитьПараметр("Заявка"                  , Объект.Ссылка);
	Запрос.УстановитьПараметр("Контрагент"              , Объект.ОсновнойКлиент);
	Запрос.УстановитьПараметр("ДатаРожденияКлиента"     , ДатаРождения);
	Запрос.УстановитьПараметр("ВыводИнформацииКлиента"  , ЗначениеЗаполнено(Объект.ОсновнойКлиент));
	Запрос.УстановитьПараметр("ОбъектыОтбора"           , ОбъектыОтбора);
	Запрос.УстановитьПараметр("ТекущаяДата"             , НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	    , ЭтотОбъект.ТекущаяСтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ВнешняяСистема"	  	    , МассивВнешнихСистем);
	
	УсловиеРассылкаSMS = "";
	Если Не РежимПодробно Тогда
		
		УсловиеРассылкаSMS = "И СтатусыSMSСообщений.РассылкаСообщений.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидОперацииОтправкаСообщений.ОтправкаПолучателю)
		                     |И СтатусыSMSСообщений.РассылкаСообщений.НазначениеЗадачи = """"";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеРассылкаSMS", УсловиеРассылкаSMS);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#Область ОбработчикиСобытийИсторииВзаимодействия

&НаКлиенте
// Процедура, обработчик события "ПриНажатии" поля формы "ИсторияВзаимодействия".
//
Процедура ИсторияВзаимодействияПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
		
	ЭлементHTML 		= ДанныеСобытия.Element; 
	ДанныеСсылкиHTML 	= ДанныеСобытия.Anchor;
	Документ 			= Элемент.Документ;
		
	Попытка
		
		Если ДанныеСсылкиHTML = Неопределено Тогда 				// Нажали в пустое место.	
			Возврат;		
		ИначеЕсли СтрНайти(ЭлементHTML.className, "task") Тогда  // изменить статус задачи
			
			Ссылка = ПолучитьСсылкуПоУид(Новый УникальныйИдентификатор(ЭлементHTML.id), ЭлементHTML.name);
			ОбновитьФорму = ОтметитьЗадачуКакВыполненую(Ссылка);
			Если ОбновитьФорму Тогда
				ОбновитьИсториюВзаимодействияСКлиентом(, Элементы.КнопкаПодробно.Пометка);
			КонецЕсли;
			
		ИначеЕсли СтрНайти(ДанныеСсылкиHTML.name, "note") Тогда  // редактировать заметку.
			
			СтандартнаяОбработка = Ложь;
			
			СтрокаТЗ = ЭтотОбъект.ИсторияВзаимодействий.НайтиПоИдентификатору(ДанныеСсылкиHTML.id);
			
			Если РольДоступнаКлиентСервер("ПолныеПрава")
				ИЛИ РольДоступнаКлиентСервер("ДобавлениеИзменениеКлиентов") Тогда
				
				МассивЭлементовHTML = ДанныеСсылкиHTML.getElementsByClassName("text-message");
				
				Если МассивЭлементовHTML.length > 0 Тогда
					РедактироватьЗаметку(МассивЭлементовHTML[0], СтрокаТЗ.Заметка, СтрокаТЗ);
				КонецЕсли;
								
			КонецЕсли;  
			
		ИначеЕсли ДанныеСсылкиHTML.name = "more" Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыводитьВсеВзаимодействия = Истина;
			ОбновитьИсториюВзаимодействияСКлиентом(, Элементы.КнопкаПодробно.Пометка, Истина);
			
		ИначеЕсли СтрНайти(ЭлементHTML.className, "listen_call") Тогда // прослушать звонок
			
			СтандартнаяОбработка = Ложь;
			
			СтрокаТЗ = ЭтотОбъект.ИсторияВзаимодействий.НайтиПоИдентификатору(ЭлементHTML.id);
			Сообщение = "";
			
			ДанныеВызова = ПолучитьДанныеИсторииВызова(СтрокаТЗ.Взаимодействие, Сообщение);
			
			Если Не ЗначениеЗаполнено(ДанныеВызова) Тогда 
				Если ЗначениеЗаполнено(Сообщение) Тогда 
					ПоказатьПредупреждение(,Сообщение);
				КонецЕсли;
				Возврат;
			ИначеЕсли ЗначениеЗаполнено(ДанныеВызова.ФайлЗаписи) Тогда					
				СсылкаНаФайл = ПолучитьСсылкуПоУид(ДанныеВызова.ФайлЗаписи.УникальныйИдентификатор(), ЭлементHTML.name);
				
				ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(СсылкаНаФайл);
				
				РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
				
			ИначеЕсли ЗначениеЗаполнено(ДанныеВызова.URLЗаписи) Тогда
				АктуальныйURLЗаписи = IPТелефонияКлиент.ПолучитьАктуальныйURLЗаписиROSTELECOMКлиент(ДанныеВызова.URLЗаписи, ДанныеВызова.IDЗвонка, ДанныеВызова.ОборудованиеТелефонии);
				НачатьЗапускПриложения(Новый ОписаниеОповещения("ИсторияВзаимодействияПослеЗапускаПриложения", ЭтотОбъект), АктуальныйURLЗаписи);
				Возврат;
			Иначе
				Возврат;
			КонецЕсли;
			
		ИначеЕсли СтрНайти(ДанныеСсылкиHTML.name, "call_comment") Тогда // редактировать коментарий звонка
			
			СтандартнаяОбработка = Ложь;
			
			МассивЭлементовHTML = ДанныеСсылкиHTML.getElementsByClassName("text-message");
			
			Если МассивЭлементовHTML.length > 0 Тогда
				РедактироватьЗаметкуЗвонок(МассивЭлементовHTML[0],  ДанныеСсылкиHTML.id);
			КонецЕсли;
	
		ИначеЕсли СтрНайти(ДанныеСсылкиHTML.name, "clip") Тогда // закрепить/открепить
			
			СтандартнаяОбработка = Ложь;
			
			СтрокаТЗ = ЭтотОбъект.ИсторияВзаимодействий.НайтиПоИдентификатору(ДанныеСсылкиHTML.id);			
			ЗакрепитьОткрепитьЗаметку(СтрокаТЗ.ИДЗаметки, СтрНайти(ДанныеСсылкиHTML.name, "off")); 
			
			ОбновитьИсториюВзаимодействияСКлиентом();
			
		ИначеЕсли СтрНайти(ДанныеСсылкиHTML.name, "open_dialog") Тогда  // Открыть диалог.
			
			СтандартнаяОбработка = Ложь;
			
			ИдКлиента 			= Лев(ДанныеСсылкиHTML.id, СтрНайти(ДанныеСсылкиHTML.id, "_") - 1);	
			UidВнешнейСистемы 	= Сред(ДанныеСсылкиHTML.id, СтрНайти(ДанныеСсылкиHTML.id, "_") + 1, СтрДлина(ДанныеСсылкиHTML.id));
			
			ПерейтиВЧат(ИдКлиента, UidВнешнейСистемы);
						
		ИначеЕсли ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
			
			СтандартнаяОбработка = Ложь;
			ПерейтиПоНавигационнойСсылке(ДанныеСобытия.Href);
			
			
		Иначе
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
	Исключение
	КонецПопытки;
			
КонецПроцедуры

&НаКлиенте
// Процедура - История взаимодействия после запуска приложения
//
// Параметры:
//  КодВозврата				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ИсторияВзаимодействияПослеЗапускаПриложения(КодВозврата, ДополнительныеПараметры) Экспорт
	
	// Процедура - заглушка
	Возврат;
	
КонецПроцедуры   

&НаСервереБезКонтекста
// Функция - Получить данные истории вызова
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеИсторииВызова(IDЗвонка, Сообщение = "")
	
	СтруктураВызова = РегистрыСведений.ИсторияВызовов.ПолучитьПоIDЗвонка(IDЗвонка);
	Если ЗначениеЗаполнено(СтруктураВызова) Тогда  
		
		Если Справочники.ТелефонныеАппараты.ЗаписьРазговораДоступна(ПараметрыСеанса.ТекущийСотрудник, СтруктураВызова.ПользовательSip) Тогда
			
			Возврат СтруктураВызова; 
		Иначе
			Сообщение = НСтр("ru = 'Нет прав на прослушивание текущей записи'; en = 'No rights to listen to the current recording'");
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат Неопределено;	
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает ссылку на документ по ид.
//
Функция ПолучитьСсылкуПоУид(Уид, ТипСобытия)
	
	Если ТипСобытия = "ЗадачаИсполнителя" Тогда
		Возврат Задачи.ЗадачаИсполнителя.ПолучитьСсылку(Уид);
	ИначеЕсли ТипСобытия = "Звонок" Тогда
		Возврат Справочники.Файлы.ПолучитьСсылку(Уид);
	Иначе
		Возврат Задачи.Взаимодействие.ПолучитьСсылку(Уид);
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, отмечает задачу как выполненую.
//
Функция ОтметитьЗадачуКакВыполненую(Задача)
	
	ЗадачаОбъект = Задача.ПолучитьОбъект();
	ЗадачаОбъект.Выполнена = Истина;
	
	Попытка
		ЗадачаОбъект.Записать();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
// Процедура, редактирует заметку.
//
Процедура РедактироватьЗаметку(ЭлементHTML, ТекстЗаметки, СтрокаТЗ)	
	
	Обработчик = Новый ОписаниеОповещения("ЗавершитьРедактированиеЗаметки", ЭтотОбъект, Новый Структура("ЭлементHTML, СтрокаТЗ", ЭлементHTML, СтрокаТЗ));
	
	КлючЗаписи = ПолучитьКлючЗаписи(СтрокаТЗ.ИДЗаметки);
	
	ОткрытьФорму("РегистрСведений.Заметки.Форма.ФормаРедактированияЗаметки", Новый Структура("ТекстЗаметки, Заголовок, Контрагент, ВзаимодействиеСделка, Ключ", ТекстЗаметки, "Редактирование заметки", Объект.Ссылка, ЭтотОбъект.ВзаимодействиеСделка, КлючЗаписи),,,,, Обработчик, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры 

&НаСервереБезКонтекста
// Процедура, закрепляет/открепляет заметку. 
//
Процедура ЗакрепитьОткрепитьЗаметку(ИдЗаметки, Закреплена);
	
	РегистрыСведений.Заметки.ЗакрепитьОткрепитьЗаметку(ИдЗаметки, Закреплена);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить ключ записи.
//
// Параметры:
//  ЗаметкаИД	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКлючЗаписи(ЗаметкаИД)
		
	Выборка = РегистрыСведений.Заметки.Выбрать(,,Новый Структура ("ИД", Новый УникальныйИдентификатор(ЗаметкаИД)));
	Если Выборка.Следующий() Тогда	
		СтруктураОтбора = РегистрыСведений.Заметки.ПустойКлюч();
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("Объект"			, Выборка.Объект);
		СтруктураОтбора.Вставить("АктивностьЗаметки", Выборка.АктивностьЗаметки);
		СтруктураОтбора.Вставить("Автор"			, Выборка.Автор);
		СтруктураОтбора.Вставить("Период"			, Выборка.Период);
		СтруктураОтбора.Вставить("ИД"				, Выборка.ИД);
	КонецЕсли; 	
	
	МассивСтруктураЗаписи = Новый Массив;
	МассивСтруктураЗаписи.Добавить(СтруктураОтбора);
	
	Возврат Новый("РегистрСведенийКлючЗаписи.Заметки", МассивСтруктураЗаписи);

КонецФункции

&НаСервереБезКонтекста
// Функция - Структура записи заметки.
// 
// Возвращаемое значение:
//   - 
//
Функция СтруктураЗаписиЗаметки()
	
	Возврат Новый Структура("
	|Взаимодействие,
	|ВзаимодействиеИд,
	|Контрагент,
	|Дата,
	|ТипВзаимодействия,
	|ТипСобытия,
	|Автор,
	|Длительность,
	|Начало,
	|Окончание,
	|Статус,
	|Заметка,
	|ТипЗадачи,
	|ФайлЗаписи,
	|URLЗаписи,
	|Сделка");
	
КонецФункции

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ЗавершитьРедактированиеЗаметки(Результат, Параметры) Экспорт 	
	
	Если Результат <> Неопределено Тогда
		
		ЭлементHTML = Параметры.ЭлементHTML;
		СтрокаТЗ = Параметры.СтрокаТЗ;
		СтрокаТЗ.Заметка = Результат.ТекстЗаметки;  // обновляем данные в таблице
		//СтрокаТЗ.Сделка  = Результат.Сделка;
		ЗавершитьРедактированиеЗаметкиНаСервере(Результат.ТекстЗаметки, СтрокаТЗ.ИДЗаметки, СтрокаТЗ.Сделка); // обновляем данные в регистре
		
		Если ЗначениеЗаполнено(Результат.ТекстЗаметки) Тогда
			ЭлементHTML.innerHTML = ?(СтрДлина(Результат.ТекстЗаметки) > 200, Лев(Результат.ТекстЗаметки, 200) + "...", Результат.ТекстЗаметки);
		Иначе
			ЭлементHTML.innerHTML = "...";
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
// Процедура, обработчик оповещения.
//
Процедура ЗавершитьРедактированиеЗаметкиНаСервере(ТекстЗаметки, ИдЗаметки, Сделка)
		
	Выборка = РегистрыСведений.Заметки.Выбрать(,,Новый Структура ("ИД", Новый УникальныйИдентификатор(ИдЗаметки)));
	Пока Выборка.Следующий() Цикл
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("Объект"			, Выборка.Объект);
		СтруктураОтбора.Вставить("АктивностьЗаметки", Выборка.АктивностьЗаметки);
		СтруктураОтбора.Вставить("Автор"			, Выборка.Автор);
		СтруктураОтбора.Вставить("Период"			, Выборка.Период);
		СтруктураОтбора.Вставить("Заметка"			, ТекстЗаметки);
		СтруктураОтбора.Вставить("Сделка"			, Сделка);
		СтруктураОтбора.Вставить("ИД"				, Выборка.ИД);
	КонецЦикла;
	
	ОбъектРегистрСведенийЗаметка = РегистрыСведений.Заметки.СоздатьНаборЗаписей();
	ОбъектРегистрСведенийЗаметка.ОбменДанными.Загрузка = Истина; 
	ОбъектРегистрСведенийЗаметка.Отбор.ИД.Установить(СтруктураОтбора.ИД);
	ЗаполнитьЗначенияСвойств(ОбъектРегистрСведенийЗаметка.Добавить(), СтруктураОтбора);
	ОбъектРегистрСведенийЗаметка.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура, редактирует заметку.
//
Процедура РедактироватьЗаметкуЗвонок(ЭлементHTML, ИдЗвонка)
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ЗавершитьРедактированиеЗаметкиЗвонок", ЭтотОбъект, Новый Структура("ЭлементHTML, ИдЗвонка", ЭлементHTML, ИдЗвонка));
	
	СокращенныйТекстЗаметки = ЭлементHTML.innerHTML;
	
	СтрокаТЗ = ЭтотОбъект.ИсторияВзаимодействий.НайтиПоИдентификатору(ИдЗвонка);
	
	ТекстЗаметки = ПолучитьПолныйТекстЗаметкиЗвонка(СтрокаТЗ.Взаимодействие, Объект.Ссылка, СокращенныйТекстЗаметки);
	
	ОткрытьФорму("РегистрСведений.Заметки.Форма.ФормаРедактированияЗаметки", Новый Структура("ТекстЗаметки", ТекстЗаметки),,,,, ОбработчикОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить полный текст заметки звонка.
//
// Параметры:
//  ЗаметкаИД	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПолныйТекстЗаметкиЗвонка(IDЗвонка, Контрагент, ТекстЗаметки)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ИсторияВызовов.Заметка КАК Заметка
	|ИЗ
	|	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
	|ГДЕ
	|	ИсторияВызовов.Контрагент = &Контрагент
	|	И ИсторияВызовов.IDЗвонка = &IDЗвонка";
	
	Запрос.УстановитьПараметр("IDЗвонка"	, IDЗвонка);
	Запрос.УстановитьПараметр("Контрагент"	, Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда	
		Возврат Выборка.Заметка;	
	КонецЕсли;
	
	Возврат ТекстЗаметки;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ЗавершитьРедактированиеЗаметкиЗвонок(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ТекстЗаметки     = Результат.ТекстЗаметки; 	
		ЭлементHTML      = ДопПараметры.ЭлементHTML;	
		СтрокаТЗ         = ЭтотОбъект.ИсторияВзаимодействий.НайтиПоИдентификатору(ДопПараметры.ИдЗвонка);
		СтрокаТЗ.Заметка = ТекстЗаметки; 
		
		ЗавершитьРедактированиеЗаметкиЗвонокНаСервере(ТекстЗаметки, СтрокаТЗ.Взаимодействие);
		
		Если ЗначениеЗаполнено(ТекстЗаметки) Тогда
			ЭлементHTML.innerHTML = ?(СтрДлина(ТекстЗаметки) > 200, Лев(Результат.ТекстЗаметки, 200) + "...", ТекстЗаметки);
		Иначе
			ЭлементHTML.innerHTML = "...";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик оповещения.
//
Процедура ЗавершитьРедактированиеЗаметкиЗвонокНаСервере(ТекстЗаметки, ИдЗвонка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсторияВызовов.ОборудованиеТелефонии КАК ОборудованиеТелефонии,
	|	ИсторияВызовов.IDЗвонка КАК IDЗвонка,
	|	ИсторияВызовов.НаправлениеВызова КАК НаправлениеВызова,
	|	ИсторияВызовов.ИсходящийЗвонок КАК ИсходящийЗвонок,
	|	ИсторияВызовов.НомерТелефона КАК НомерТелефона,
	|	ИсторияВызовов.ПользовательSip КАК ПользовательSip,
	|	ИсторияВызовов.НачалоВызова КАК НачалоВызова,
	|	ИсторияВызовов.НачалоРазговора КАК НачалоРазговора,
	|	ИсторияВызовов.ОкончаниеЗвонка КАК ОкончаниеЗвонка,
	|	ИсторияВызовов.Статус КАК Статус,
	|	ИсторияВызовов.URLЗаписи КАК URLЗаписи,
	|	ИсторияВызовов.ФайлЗаписи КАК ФайлЗаписи,
	|	ИсторияВызовов.ПринятДругимАбонентомГруппы КАК ПринятДругимАбонентомГруппы,
	|	ИсторияВызовов.Заявка КАК Заявка,
	|	ИсторияВызовов.НеОбработан КАК НеОбработан,
	|	ИсторияВызовов.ИдентификаторОбрабатывающего КАК ИдентификаторОбрабатывающего,
	|	ИсторияВызовов.ИсточникЗвонка КАК ИсточникЗвонка,
	|	ИсторияВызовов.Пользователь КАК Пользователь,
	|	ИсторияВызовов.Контрагент КАК Контрагент,
	|	ИсторияВызовов.ПопытокПолученияФайлаЗаписи КАК ПопытокПолученияФайлаЗаписи,
	|	ИсторияВызовов.Заметка КАК Заметка
	|ИЗ
	|	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
	|ГДЕ
	|	ИсторияВызовов.IDЗвонка = &IDЗвонка");
	
	Запрос.УстановитьПараметр("IDЗвонка", ИдЗвонка); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		МенеджерЗаписи = РегистрыСведений.ИсторияВызовов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);	
		МенеджерЗаписи.Заметка = ТекстЗаметки;
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФильтрыПоВзаимодействиямСКлиентом

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ВзаимодействиеПодробно(Команда)
	
	УстановитьФокусЭлемента();
	
	Элементы.КнопкаПодробно.Пометка   = Не Элементы.КнопкаПодробно.Пометка;
	Элементы.КнопкаПодробно.Заголовок = ?(Элементы.КнопкаПодробно.Пометка, НСтр("ru = 'Кратко'; en = 'Short'"), НСтр("ru = 'Подробно'; en = 'In detail'"));
	
	ОбновитьИсториюВзаимодействияСКлиентом(, Элементы.КнопкаПодробно.Пометка, ЭтотОбъект.ВыводитьВсеВзаимодействия);
	
КонецПроцедуры

&НаКлиенте
// Процедура, оброботчик оповещения.
//
Процедура ВзаимодействиеПослеВопросаОЗаписиЗаявки(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да 
		И ЭтаФорма.Записать() Тогда
		
		Действие = ДопПараметры.ВыполнитьДействие; 
		
		Если Действие = "ДобавитьЗаметку" Тогда
			СозадтьЗаметкуНаКлиенте();
		ИначеЕсли Действие = "СоздатьПисьмо" Тогда
			СоздатьПисьмоНаКлиенте();
		ИначеЕсли Действие = "СоздатьSMS" Тогда
			СоздатьSMSРассылкуНаКлиенте();
		ИначеЕсли Действие = "ВыборВзаимодействия" Тогда
			ВыборВзаимодействиеЗадачаНаСервере();
		ИначеЕсли Действие = "ПерейтиКДиалогу" Тогда
			Подключаемый_ПерейтиКДиалогу(Параметры.Элемент);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ВзаимодействиеЗадача

&НаСервере
// Заполнить список выбора взаимодействия.
//
Процедура ЗаполнитьСписокВыбораВзаимодействия()
	
	ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора.Очистить();
	
	ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора = Справочники.ВидыВзаимодействий.ПолучитьСписокВзаимодействий("Обращение");
	
КонецПроцедуры

&НаСервере
// Заполнить список выбора режима напоминания
//
Процедура ЗаполнитьСписокВыбораРежимаНапоминания()
	
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Очистить();
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(-1	   , НСтр("ru = 'не напоминать'; en = 'do not remind'"));
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(0     , НСтр("ru = 'в момент события'; en = 'at the time of the event'"));
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(300   , НСтр("ru = 'за 5 минут'; en = 'in 5 minutes'"));
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(600   , НСтр("ru = 'за 10 минут'; en = 'in 10 minutes'"));
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(900   , НСтр("ru = 'за 15 минут'; en = 'in 15 minutes'"));
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(1800  , НСтр("ru = 'за 30 минут'; en = 'in 30 minutes'"));     
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(3600  , НСтр("ru = 'за 1 час'; en = 'in 1 hour'"));
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(7200  , НСтр("ru = 'за 2 часа'; en = 'in 2 hours'"));
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(86400 , НСтр("ru = 'за 1 день'; en = 'in 1 day'"));
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(172800, НСтр("ru = 'за 2 дня'; en = 'in 2 days'"));
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(604800, НСтр("ru = 'за 1 неделю'; en = 'in 1 week'"));
	
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания = -1;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда взаимодействие выбрать.
//
Процедура ВзаимодействиеЗадачаВыбрать(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыборВзаимодействиеЗадачаЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора, Элементы.ВзаимодействиеЗадачаВыбрать);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор взаимодействия завершение
//
Процедура ВыборВзаимодействиеЗадачаЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЭтотОбъект.ВзаимодействиеЗадачаТема = "";
		ЭтотОбъект.ВзаимодействиеЗадачаПараметры = Новый Структура;
		ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Вставить("Взаимодействие"   , Результат.Значение.Взаимодействие);
		ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Вставить("ВидВзаимодействия", Результат.Значение.ВидВзаимодействия);
		ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Вставить("ТемаПоУмолчанию"  , Результат.Значение.ТемаПоУмолчанию);
		ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Вставить("Представление"    , Результат.Представление);
		ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Вставить("Картинка"         , Результат.Картинка);
		
		Если Объект.Ссылка.Пустая() Тогда
						
			Оповещение = Новый ОписаниеОповещения("ВзаимодействиеПослеВопросаОЗаписиЗаявки", ЭтотОбъект, Новый Структура("ВыполнитьДействие", "ВыборВзаимодействия"));
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Для создания взаимодействия необходимо произвести запись заявки. Записать?'; en = 'To create an interaction, you must record the application. To record?'"), РежимДиалогаВопрос.ДаНет);
		Иначе
			ВыборВзаимодействиеЗадачаНаСервере();		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Выбор взаимодействия на клиенте
//
Процедура ВыборВзаимодействиеЗадачаНаСервере()
	
	Элементы.ДекорацияВзаимодействиеЗадачаИконка.Картинка     = ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Картинка;
	Элементы.ДекорацияВзаимодействиеЗадачаИконка.Видимость    = ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Картинка);
	Элементы.ДекорацияВзаимодействиеЗадачаЗаголовок.Заголовок = ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Представление;
	
	УстановитьВидимостьВсплывающихГруппСервер("ВзаимодействиеЗадача");
	
	ЭтотОбъект.ВзаимодействиеЗадачаТема  = ?(ЗначениеЗаполнено(ВзаимодействиеЗадачаТема) , ВзаимодействиеЗадачаТема	, ЭтотОбъект.ВзаимодействиеЗадачаПараметры.ТемаПоУмолчанию);
	ЭтотОбъект.ВзаимодействиеЗадачаТекст = ?(ЗначениеЗаполнено(ВзаимодействиеЗадачаТекст), ВзаимодействиеЗадачаТекст, "");
	
	// Установить дату взаимодействия.
	ЭтотОбъект.ВзаимодействиеЗадачаДата = ПолучитьОкругленноеВремяВзаимодействия(ЭтотОбъект.ВзаимодействиеЗадачаВыполнена);	
	ВзаимодействиеЗадачаДатаПриИзмененииНаСервере();
	
	// Обновить исполнителя взаимодействия.
	ЭтотОбъект.ВзаимодействиеЗадачаИсполнитель         = Объект.ОсновнойМенеджер;	
	Элементы.ВзаимодействиеЗадачаИсполнитель.Заголовок = ПолучитьПредставлениеФИОСотрудника(Объект.ОсновнойМенеджер);
		
	// Обновить режим напоминания взаимодействия.
	РежимНапоминанияПоУмолчанию = ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора[0];		
	
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания    = РежимНапоминанияПоУмолчанию.Значение;
	Элементы.ВзаимодействиеЗадачаНапоминание.Заголовок = РежимНапоминанияПоУмолчанию.Представление;
	
	ПереместитьЭлементСделкиВзаимодействия("ГруппаВзаимодействиеЗадачаШапка");
	
	АктивныйЭлемент   = ?(ЭтотОбъект.ВзаимодействиеЗадачаВыполнена, Элементы.ГруппаВзаимодействиеЗадачаСтатусВыполнена, Элементы.ГруппаВзаимодействиеЗадачаСтатусНеВыполнена);
	НеактивныйЭлемент = ?(Не ЭтотОбъект.ВзаимодействиеЗадачаВыполнена, Элементы.ГруппаВзаимодействиеЗадачаСтатусВыполнена, Элементы.ГруппаВзаимодействиеЗадачаСтатусНеВыполнена);
	УправлениеИнтерфейсамиСервер.ИзменитьАктивностьПереключателяФормы(АктивныйЭлемент, НеактивныйЭлемент, ЭтотОбъект.ВзаимодействиеЗадачаВыполнена);
	
КонецПроцедуры	

&НаКлиенте
// Процедура - Взаимодействие задача звонок дата при изменении.
//
// Параметры:
//  Элемент	 - 	 -
//
Процедура ВзаимодействиеЗадачаДатаПриИзменении(Элемент)
	
	ВзаимодействиеЗадачаДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
// Процедура - Взаимодействие задача звонок дата при изменении на сервере.
//
// Параметры:
//  Элемент	 - 	 -
//
Процедура ВзаимодействиеЗадачаДатаПриИзмененииНаСервере()
	
	ЗаполнитьСписокВыбораВремениЭлемента("ВзаимодействиеЗадачаВремя", ЭтотОбъект.ВзаимодействиеЗадачаДата);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие задача дата обработка выбора.
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ВзаимодействиеЗадачаДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЭтотОбъект.ВзаимодействиеЗадачаВыполнена Тогда
		
		СтандартнаяОбработка = ВзаимодействиеЗадачаРазрешеноСозданиеНаУказаннуюДату(ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие задача дата окончание ввода текста.
//
// Параметры:
//  Элемент					 - 	 - 
//  Текст					 - 	 - 
//  ДанныеВыбора			 - 	 - 
//  ПараметрыПолученияДанных - 	 - 
//  СтандартнаяОбработка	 - 	 - 
//
Процедура ВзаимодействиеЗадачаДатаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если ЭтотОбъект.ВзаимодействиеЗадачаВыполнена Тогда
		
		Попытка
			СтандартнаяОбработка = ВзаимодействиеЗадачаРазрешеноСозданиеНаУказаннуюДату(Дата(Текст + " 00:00:00"));	
		Исключение
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие задача время обработка выбора.
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ВзаимодействиеЗадачаВремяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЭтотОбъект.ВзаимодействиеЗадачаВыполнена Тогда
		
		СтандартнаяОбработка = ВзаимодействиеЗадачаРазрешеноСозданиеНаУказаннуюДату(ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Функция - Взаимодействие задача разрешено создание на указанную дату.
//
// Параметры:
//  ВыбраннаяДата	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВзаимодействиеЗадачаРазрешеноСозданиеНаУказаннуюДату(ВыбраннаяДата)
	
	Если ВыбраннаяДата > ТекущаяДата() Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Создание выполненных задач будущей датой запрещено!'; en = 'Creating completed tasks by a future date is prohibited!'"));
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
// Процедура - Команда взаимодействие исполнитель
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеЗадачаИсполнитель(Команда)
	
	Оповещение     = Новый ОписаниеОповещения("ОбработчикВыбораИсполнителяЗадачи", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("Ключ", ЭтотОбъект.ВзаимодействиеЗадачаИсполнитель);	
	
	ОткрытьФорму("Задача.Взаимодействие.Форма.ФормаВыбораИсполнителя", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик выбора исполнителя взаимодействия
//
// Параметры:
//  Результат	 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура ОбработчикВыбораИсполнителяЗадачи(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если ТипЗнч(Результат) = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка") Тогда
			Представление = ПолучитьПредставлениеФИОСотрудника(Результат);
		Иначе
			Представление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Результат, "Наименование");		
		КонецЕсли;

		ЭтотОбъект.ВзаимодействиеЗадачаИсполнитель         = Результат;	
		Элементы.ВзаимодействиеЗадачаИсполнитель.Заголовок = Представление;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить представление ФИОСотрудника.
//
Функция ПолучитьПредставлениеФИОСотрудника(Сотрудник)
	
	Возврат Справочники.Сотрудники.ПредставлениеФИОСотрудника(Сотрудник);		
	
КонецФункции

&НаКлиенте
Процедура ВзаимодействиеЗадачаСтатусНеВыполнена(Команда)
	
	ЭтотОбъект.ВзаимодействиеЗадачаВыполнена = Ложь;
	
	УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(
		Элементы.ГруппаВзаимодействиеЗадачаСтатусНеВыполнена,
		Элементы.ГруппаВзаимодействиеЗадачаСтатусВыполнена,
		Ложь
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ВзаимодействиеЗадачаСтатусВыполнена(Команда)
	
	ЭтотОбъект.ВзаимодействиеЗадачаДата      = ПолучитьОкругленноеВремяВзаимодействия(Истина);
	ЭтотОбъект.ВзаимодействиеЗадачаВыполнена = Истина;
	
	УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(
		Элементы.ГруппаВзаимодействиеЗадачаСтатусВыполнена,
		Элементы.ГруппаВзаимодействиеЗадачаСтатусНеВыполнена,
		Истина
	);
	
	ВзаимодействиеЗадачаДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда взаимодействие задача режим напоминания.
//
Процедура ВзаимодействиеЗадачаРежимНапоминания(Команда)

	Оповещение = Новый ОписаниеОповещения("ВыборРежимаНапоминанияЗавершение", ЭтотОбъект);
	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора, Элементы.ВзаимодействиеЗадачаНапоминание);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор взаимодействия завершение
//
Процедура ВыборРежимаНапоминанияЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания    = Результат.Значение;
		Элементы.ВзаимодействиеЗадачаНапоминание.Заголовок = Результат.Представление; 

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда взаимодействие создать.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеЗадачаСоздать(Команда)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеЗадачаДата) Тогда
		ВзаимодействиеЗадачаСоздатьСервер();
		ЭтотОбъект.ВзаимодействиеЗадачаПараметры = Новый Структура;		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнены данные взаимодействия!'; en = 'Interaction data is not filled!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик оповещения.
//
Процедура ВзаимодействиеЗадачаСоздатьСервер()
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ЗадачаПредмет"              , Объект.Ссылка);
	ДанныеЗаполнения.Вставить("Контрагент"                 , Объект.ОсновнойКлиент);
	ДанныеЗаполнения.Вставить("ВидВзаимодействия"          , ЭтотОбъект.ВзаимодействиеЗадачаПараметры.ВидВзаимодействия);
	ДанныеЗаполнения.Вставить("ВидВзаимодействияСправочник", ЭтотОбъект.ВзаимодействиеЗадачаПараметры.Взаимодействие);
	ДанныеЗаполнения.Вставить("Исполнитель"                , ЭтотОбъект.ВзаимодействиеЗадачаИсполнитель);
	ДанныеЗаполнения.Вставить("ЗадачаНазначеннаяДата"      , ЭтотОбъект.ВзаимодействиеЗадачаДата);
	ДанныеЗаполнения.Вставить("ЗадачаТема"                 , ?(ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеЗадачаТема), ЭтотОбъект.ВзаимодействиеЗадачаТема, ""));
	ДанныеЗаполнения.Вставить("ЗадачаОписание"             , ЭтотОбъект.ВзаимодействиеЗадачаТекст);
	ДанныеЗаполнения.Вставить("Сделка"                     , ЭтотОбъект.ВзаимодействиеСделка);
	ДанныеЗаполнения.Вставить("Выполнена"                  , ЭтотОбъект.ВзаимодействиеЗадачаВыполнена);
	
	НоваяЗадача = Задачи.Взаимодействие.СоздатьЗадачу();
	НоваяЗадача.Заполнить(ДанныеЗаполнения);	
	
	Задачи.Взаимодействие.ЗаполнитьПараметрыНапоминания(НоваяЗадача, Новый Структура("ЗадачаРежимНапоминания", ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания));	
	
	НоваяЗадача.Записать();
	
	ОбновитьИсториюВзаимодействияВыборочно("Задача", НоваяЗадача.Ссылка);
	ОбновитьИсториюВзаимодействияСКлиентом(, Элементы.КнопкаПодробно.Пометка);
	
	ВзаимодействиеЗадачаТема  = "";
	ВзаимодействиеЗадачаТекст = "";
	
	СнятьВидимостьВсплывающихГруппСервер("ВзаимодействиеЗадача");
	
КонецПроцедуры

// Процедура - Обновить историю взаимодействия выборочно
//
&НаСервере 
Процедура ОбновитьИсториюВзаимодействияВыборочно(ТипСобытия, Взаимодействие = "", ВзаимодействиеИд = "", Тип = "")
	
	УстановитьПривилегированныйРежим(Истина);
	
	// заметка
	Если ЗначениеЗаполнено(ВзаимодействиеИд) Тогда
		НайденныеСтроки = ИсторияВзаимодействий.НайтиСтроки(Новый Структура("ВзаимодействиеИд", ВзаимодействиеИд));
		Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
			ИсторияВзаимодействий.Удалить(СтрокаТЧ);
		КонецЦикла;
		СтрокаИстории = ИсторияВзаимодействий.Добавить();
		
	Иначе
		НайденныеСтроки = ИсторияВзаимодействий.НайтиСтроки(Новый Структура("Взаимодействие", Взаимодействие));
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаИстории = ИсторияВзаимодействий.Добавить();
		Иначе
			СтрокаИстории = НайденныеСтроки[0];
		КонецЕсли;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Если ТипСобытия = "Задача" Тогда 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаВзаимодействие.Ссылка КАК Взаимодействие,
		|	ВЫБОР
		|		КОГДА ЗадачаВзаимодействие.Выполнена
		|			ТОГДА ЗадачаВзаимодействие.ДатаИсполнения
		|		ИНАЧЕ ЗадачаВзаимодействие.ЗадачаНазначеннаяДата
		|	КОНЕЦ КАК Дата,
		|	""Задача"" КАК ТипСобытия,
		|	ВЫБОР
		|		КОГДА ЗадачаВзаимодействие.Выполнена
		|			ТОГДА ""История""
		|		ИНАЧЕ ""Запланировано""
		|	КОНЕЦ КАК ТипВзаимодействия,
		|	ВЫБОР
		|		КОГДА ЗадачаВзаимодействие.Выполнена
		|			ТОГДА ЗадачаВзаимодействие.ИсполнительФактический
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗадачаВзаимодействие.Исполнитель ССЫЛКА Справочник.Сотрудники
		|					ТОГДА ЗадачаВзаимодействие.Исполнитель
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|			КОНЕЦ
		|	КОНЕЦ КАК Автор,
		|	ВЫБОР
		|		КОГДА ЗадачаВзаимодействие.Выполнена
		|			ТОГДА ЗадачаВзаимодействие.ИсполнительФактический.НаименованиеСокращенное
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗадачаВзаимодействие.Исполнитель ССЫЛКА Справочник.Сотрудники
		|					ТОГДА ЗадачаВзаимодействие.Исполнитель.НаименованиеСокращенное
		|				ИНАЧЕ ЗадачаВзаимодействие.Исполнитель.Наименование
		|			КОНЕЦ
		|	КОНЕЦ КАК АвторПредставление,
		|	ВЫБОР
		|		КОГДА ЗадачаВзаимодействие.Исполнитель = ЗадачаВзаимодействие.ЗадачаАвтор
		|				ИЛИ ЗадачаВзаимодействие.ЗадачаАвтор.Служебный
		|			ТОГДА NULL
		|		ИНАЧЕ ЗадачаВзаимодействие.ЗадачаАвтор.НаименованиеСокращенное
		|	КОНЕЦ КАК АвторВзаимодействияПредставление,
		|	""Взаимодействие"" КАК ТипЗадачи,
		|	ЗадачаВзаимодействие.ВидВзаимодействияСправочник.ИндексКартинки КАК ИндексКартинкиВзаимодействия,
		|	ВЫБОР
		|		КОГДА ЗадачаВзаимодействие.Сделка = ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
		|		ИНАЧЕ ЗадачаВзаимодействие.Сделка
		|	КОНЕЦ КАК Сделка
		|ИЗ
		|	Задача.Взаимодействие КАК ЗадачаВзаимодействие
		|ГДЕ
		|	ЗадачаВзаимодействие.Ссылка = &Ссылка
		|	И (ЗадачаВзаимодействие.Контрагент = &Контрагент
		|			ИЛИ ЗадачаВзаимодействие.ЗадачаПредмет = &Контрагент)";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);

	// ИначеЕсли ТипСобытия = "Заметка" Тогда
	//	
	//	Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	ЗакрепленныеВзаимодействия.ВзаимодействиеИд КАК ВзаимодействиеИд,
	//	|	ЗакрепленныеВзаимодействия.Взаимодействие КАК Взаимодействие
	//	|ПОМЕСТИТЬ ЗакрепленныеЗаметкиДляИсключения
	//	|ИЗ
	//	|	РегистрСведений.ЗакрепленныеВзаимодействия КАК ЗакрепленныеВзаимодействия
	//	|ГДЕ
	//	|	ЗакрепленныеВзаимодействия.ВзаимодействиеИд = &ИД
	//	|	И ЗакрепленныеВзаимодействия.ТипСобытия = ""Заметка""
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	NULL КАК Взаимодействие,
	//	|	Заметки.Период КАК Дата,
	//	|	""Заметка"" КАК ТипСобытия,
	//	|	""История"" КАК ТипВзаимодействия,
	//	|	Заметки.Автор КАК Автор,
	//	|	Заметки.Автор.НаименованиеСокращенное КАК АвторПредставление,
	//	|	ВЫРАЗИТЬ(Заметки.Заметка КАК СТРОКА(1000)) КАК Заметка,
	//	|	NULL КАК Длительность,
	//	|	NULL КАК Начало,
	//	|	NULL КАК Окончание,
	//	|	NULL КАК Статус,
	//	|	Заметки.ИД КАК ВзаимодействиеИд,
	//	|	NULL КАК ТипЗадачи,
	//	|	NULL КАК ИндексКартинкиВзаимодействия,
	//	|	NULL КАК URLЗаписи,
	//	|	NULL КАК ФайлЗаписи,
	//	|	Заметки.Сделка КАК Сделка
	//	|ИЗ
	//	|	РегистрСведений.Заметки КАК Заметки
	//	|ГДЕ
	//	|	Заметки.ИД = &ИД
	//	|	И Заметки.АктивностьЗаметки
	//	|	И НЕ Заметки.ИД В
	//	|				(ВЫБРАТЬ
	//	|					ЗакрепленныеЗаметкиДляИсключения.ВзаимодействиеИд
	//	|				ИЗ
	//	|					ЗакрепленныеЗаметкиДляИсключения)
	//	|	И &ВыводитьЗакрепленные = ЛОЖЬ
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ЗакрепленныеВзаимодействия.Взаимодействие,
	//	|	ЗакрепленныеВзаимодействия.Дата,
	//	|	ЗакрепленныеВзаимодействия.ТипСобытия,
	//	|	""Закреплен"",
	//	|	ВЫБОР
	//	|		КОГДА ЗакрепленныеВзаимодействия.Автор ССЫЛКА Справочник.Сотрудники
	//	|			ТОГДА ЗакрепленныеВзаимодействия.Автор
	//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	//	|	КОНЕЦ,
	//	|	ВЫБОР
	//	|		КОГДА ЗакрепленныеВзаимодействия.Автор ССЫЛКА Справочник.Сотрудники
	//	|			ТОГДА ЗакрепленныеВзаимодействия.Автор.НаименованиеСокращенное
	//	|		ИНАЧЕ ЗакрепленныеВзаимодействия.Автор
	//	|	КОНЕЦ,
	//	|	ЗакрепленныеВзаимодействия.Заметка,
	//	|	ЗакрепленныеВзаимодействия.Длительность,
	//	|	ЗакрепленныеВзаимодействия.Начало,
	//	|	ЗакрепленныеВзаимодействия.Окончание,
	//	|	ЗакрепленныеВзаимодействия.Статус,
	//	|	ЗакрепленныеВзаимодействия.ВзаимодействиеИд,
	//	|	ЗакрепленныеВзаимодействия.ТипЗадачи,
	//	|	ВЫРАЗИТЬ(ЗакрепленныеВзаимодействия.Взаимодействие КАК Задача.Взаимодействие).ВидВзаимодействияСправочник.ИндексКартинки,
	//	|	ЗакрепленныеВзаимодействия.URLЗаписи,
	//	|	ЗакрепленныеВзаимодействия.ФайлЗаписи,
	//	|	ЗакрепленныеВзаимодействия.Сделка
	//	|ИЗ
	//	|	РегистрСведений.ЗакрепленныеВзаимодействия КАК ЗакрепленныеВзаимодействия
	//	|ГДЕ
	//	|	ЗакрепленныеВзаимодействия.ВзаимодействиеИд = &ИД
	//	|	И ЗакрепленныеВзаимодействия.ТипСобытия = ""Заметка""
	//	|	И &ВыводитьЗакрепленные = ИСТИНА"; 
	//	
	// ИначеЕсли ТипСобытия = "Занятие" Тогда
	//	
	//	Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	ЗанятиеСоставЗанятия.Ссылка КАК Взаимодействие ,
	//	|	ЗанятиеСоставЗанятия.Ссылка.Дата КАК Дата,
	//	|	""Занятие"" КАК ТипСобытия,
	//	|	""История"" КАК ТипВзаимодействия,
	//	|	ЗанятиеСоставЗанятия.Ссылка.АвторДокумента КАК Автор,
	//	|	ЗанятиеСоставЗанятия.Ссылка.АвторДокумента.НаименованиеСокращенное КАК АвторПредставление,
	//	|	ЗанятиеСоставЗанятия.Ссылка.СтатусЗанятия КАК Статус
	//	|ИЗ
	//	|	Документ.Занятие.СоставЗанятия КАК ЗанятиеСоставЗанятия
	//	|ГДЕ
	//	|	ЗанятиеСоставЗанятия.Ссылка = &Ссылка";

	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Ссылка", Взаимодействие);
	Если ТипСобытия = "Заметка" И ЗначениеЗаполнено(ВзаимодействиеИд) Тогда
		Запрос.УстановитьПараметр("ИД" , Новый УникальныйИдентификатор(ВзаимодействиеИд));
		Запрос.УстановитьПараметр("ВыводитьЗакрепленные", Тип = "Закреплен");		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтрокаИстории, Выборка); 
	КонецЦикла;
	ИсторияВзаимодействий.Сортировать("ТипВзаимодействия, Дата Убыв");
	Фильтры = ПолучитьФильтры();
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Контрагент"              , Объект.Ссылка);
	// ПараметрыПроцедуры.Вставить("СтатусКлиента"           , Справочники.Контрагенты.ПолучитьСтатус(Объект.ОсновнойКлиент, Объект.СтруктурнаяЕдиница));
	// ПараметрыПроцедуры.Вставить("ДатаРожденияКлиента"     , Объект.ДатаРожденияКлиента);
	ПараметрыПроцедуры.Вставить("РежимПодробно"           , Элементы.КнопкаПодробно.Пометка);
	ПараметрыПроцедуры.Вставить("ВыводитьВсе"             , ВыводитьВсеВзаимодействия);
	ПараметрыПроцедуры.Вставить("Фильтры"                 , Фильтры);

	ТекстHTML = УправлениеИнтерфейсамиСервер.СформироватьИсториюВзаимодействий(ЭтаФорма, ПараметрыПроцедуры, 
		ПараметрыПроцедуры.РежимПодробно, ПараметрыПроцедуры.ВыводитьВсе); 
	ЭтотОбъект.ИсторияВзаимодействия = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(ТекстHTML);

КонецПроцедуры

&НаСервере
Функция ПолучитьФильтры()
	
	Фильтры = Новый Структура();
	Фильтры.Вставить("Взаимодействие", ПолучитьЗначениеФильтра("Взаимодействие")); 	
	Фильтры.Вставить("Заметка"       , ПолучитьЗначениеФильтра("Заметка")); 
	// Фильтры.Вставить("Сообщение"     , ПолучитьЗначениеФильтра("Сообщение"));
	// Фильтры.Вставить("SMS"	 		 , ПолучитьЗначениеФильтра("SMS"));
	// Фильтры.Вставить("Письмо"     	 , ПолучитьЗначениеФильтра("Письмо"));
	
	Если ВсеФильтрыОтключены(Фильтры) Тогда
		Фильтры = Новый Структура();
	КонецЕсли;
	
	Возврат Фильтры;
	
КонецФункции

&НаСервере
// Функция, возвращает значение фильтра.
//
Функция ПолучитьЗначениеФильтра(ИмяФильтр)
	
	Фильтр = Элементы["ДекорацияФильтр" + ИмяФильтр];
	Возврат СтрНайти(Фильтр.Подсказка, "Очистить") > 0;
	
КонецФункции

&НаСервере
// Функция, проверяет отключены ли все фильтры.
//
Функция ВсеФильтрыОтключены(Фильтры)
	
	Для Каждого Фильтр Из Фильтры Цикл
		Если Фильтр.Значение = Истина Тогда
			Возврат Ложь;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции


#КонецОбласти

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура СозадтьЗаметку(Команда)
	
	Если Не ПроверитьВидимостьВсплывающихГрупп("Заметка") Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВзаимодействиеПослеВопросаОЗаписиЗаявки", ЭтотОбъект, Новый Структура("ВыполнитьДействие", "ДобавитьЗаметку"));
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Для добавления заметки нужно произвести запись заявки. Записать?'; en = 'To add a note, you need to record the application. To record?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		Обработчик = Новый ОписаниеОповещения("ЗавершитьДобавлениеЗаметки", ЭтотОбъект);
		ОткрытьФорму("РегистрСведений.Заметки.Форма.ФормаРедактированияЗаметки", Новый Структура("Контрагент", Объект.Ссылка),ЭтаФорма,,,,Обработчик,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ЗавершитьДобавлениеЗаметки(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЭтотОбъект.ВзаимодействиеЗаметкаТекст = Результат.ТекстЗаметки;		
		ВзаимодействиеЗаметкаДобавитьСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, добавляет заметку.
//
Процедура СозадтьЗаметкуНаКлиенте()
	
	ПереместитьЭлементСделкиВзаимодействия("ГруппаВзаимодействиеЗаметкаШапка");
	
	УстановитьВидимостьВсплывающихГрупп("Заметка");
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие добавить заметку.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура ВзаимодействиеЗаметкаДобавить(Команда)
		
	Если ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеЗаметкаТекст) Тогда
		ВзаимодействиеЗаметкаДобавитьСервер();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнены данные заметки!'; en = 'Not filled out these notes!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик оповещения.
//
Процедура ВзаимодействиеЗаметкаДобавитьСервер()
	
	ДобавитьЗаметкуЗаявкиКлиента(ЭтотОбъект.ВзаимодействиеЗаметкаТекст, Объект.Ссылка);
	
	ОбновитьИсториюВзаимодействияСКлиентом(, Элементы.КнопкаПодробно.Пометка);
		
	ЭтотОбъект.ВзаимодействиеЗаметкаТекст = "";
	
	СнятьВидимостьВсплывающихГруппСервер("Заметка");
	
КонецПроцедуры

&НаСервере
// Процедура, добавляет заметку на сервере.
//
Процедура ДобавитьЗаметкуЗаявкиКлиента(ТекстЗаметки, ЗаявкаКлиента)
	
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("Объект"			, ЗаявкаКлиента);
	СтруктураОтбора.Вставить("АктивностьЗаметки", Истина);
	СтруктураОтбора.Вставить("Автор"			, ЭтотОбъект.ТекущийПользователь);
	СтруктураОтбора.Вставить("Период"			, ТекущаяДатаСеанса());
	СтруктураОтбора.Вставить("Заметка"			, ТекстЗаметки);
	СтруктураОтбора.Вставить("Сделка"			, ЭтотОбъект.ВзаимодействиеСделка);
	СтруктураОтбора.Вставить("ИД"				, Новый УникальныйИдентификатор);
	
	ОбъектРегистрСведенийЗаметка = РегистрыСведений.Заметки.СоздатьНаборЗаписей();
	ОбъектРегистрСведенийЗаметка.ОбменДанными.Загрузка = Истина;
	ОбъектРегистрСведенийЗаметка.Отбор.ИД.Установить(СтруктураОтбора.ИД);
	
	ЗаполнитьЗначенияСвойств(ОбъектРегистрСведенийЗаметка.Добавить(), СтруктураОтбора);
	
	ОбъектРегистрСведенийЗаметка.Записать(Истина);
	
КонецПроцедуры

&НаСервере
// Заполнить список выбора взаимодействия.
//
Процедура ЗаполнитьСписокВыбораШаблоновSMSСообщений()
	
	ЭтотОбъект.ВзаимодействиеSMSСписокШаблонов.Очистить();
	
	МассивШаблонов = Справочники.ШаблоныСообщений.ПолучитьШаблоныСообщений(Перечисления.ТипыСобытий.SMS);
	
	Для Каждого Шаблон Из МассивШаблонов Цикл
		ЭтотОбъект.ВзаимодействиеSMSСписокШаблонов.Добавить(Шаблон.Содержание, Шаблон.Наименование);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура СоздатьSMSРассылку(Команда)
	
	Если Не ПроверитьВидимостьВсплывающихГрупп("SMS") Тогда
		Возврат;
	КонецЕсли;

	Если Объект.Ссылка.Пустая() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВзаимодействиеПослеВопросаОЗаписиЗаявки", ЭтотОбъект, Новый Структура("ВыполнитьДействие", "СоздатьSMS"));
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Для отправки sms сообщения нужно произвести запись заявки. Записать?'; en = 'To send an sms message, you need to record the application. To record?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		Если Модифицированность И Не ЭтаФорма.Записать() Тогда
			Возврат;
		КонецЕсли;

		СоздатьSMSРассылкуНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, создает sms рассылку.
//
Процедура СоздатьSMSРассылкуНаКлиенте()
	
	МассивНомеровТелефонов = ПолучитьНомераТелефоновЗаявкиКлиента(Объект.Ссылка);
	
	Если ЗначениеЗаполнено(МассивНомеровТелефонов) Тогда
		
		ЭтотОбъект.ВзаимодействиеSMSСписокНомеровТелефонов.ЗагрузитьЗначения(МассивНомеровТелефонов);
		
		Если Не (ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеSMSНомерТелефона)
			И МассивНомеровТелефонов.Найти(ЭтотОбъект.ВзаимодействиеSMSНомерТелефона) <> Неопределено) Тогда
			
			ЭтотОбъект.ВзаимодействиеSMSНомерТелефона = МассивНомеровТелефонов[0];
		КонецЕсли;
		
		Элементы.ВзаимодействиеSMSВыбратьНомерТелефона.Заголовок = ЭтотОбъект.ВзаимодействиеSMSНомерТелефона;
		
		ПереместитьЭлементСделкиВзаимодействия("ГруппаВзаимодействиеSMSШапка");
		
		УстановитьВидимостьВсплывающихГрупп("SMS");
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'У клиента не задан номер телефона, или рассылка запрещена'; en = 'The client does not have a phone number or mailing is prohibited'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMSВыбрать телефон.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура ВзаимодействиеSMSВыбратьТелефон(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВзаимодействиеSMSВыбратьТелефонЗавершение", ЭтотОбъект);

	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеSMSСписокНомеровТелефонов);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMSВыбрать телефон завершение.
//
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
//
Процедура ВзаимодействиеSMSВыбратьТелефонЗавершение(Результат, ДопПараметры) Экспорт
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ВзаимодействиеSMSТекст;
	
	Если Результат <> Неопределено  Тогда
		
		ЭтотОбъект.ВзаимодействиеSMSНомерТелефона = Результат;
		
		Элементы.ВзаимодействиеSMSВыбратьНомерТелефона.Заголовок = Результат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMS выбрать шаблон текста.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура ВзаимодействиеSMSВыбратьШаблон(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВзаимодействиеSMSВыбратьШаблонЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеSMSСписокШаблонов);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMS выбрать шаблон текста завершение.
//
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
//
Процедура ВзаимодействиеSMSВыбратьШаблонЗавершение(Результат, ДопПараметры) Экспорт
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ВзаимодействиеSMSТекст;
	
	Если Результат <> Неопределено  Тогда		
		ЭтотОбъект.ВзаимодействиеSMSТекст = Результат.Значение;
		ВзаимодействиеSMSОбновитьСтатусВведеныхСимволов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMSНастроить сервис.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура ВзаимодействиеSMSНастроитьСервис(Команда)

	Если НаличиеСервисовSMSРассылки() Тогда
		Оповещение = Новый ОписаниеОповещения("ВзаимодействиеSMSНастроитьСервисЗавершение", ЭтотОбъект);
		ОткрытьФорму("Справочник.СервисыРассылки.ФормаВыбора",, ЭтаФорма,,,, Оповещение);
	Иначе
		ОткрытьФорму("Справочник.СервисыРассылки.ФормаОбъекта",, ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMSНастроить сервис завершение.
//
// Параметры:
//  Результат	 - 	 -
//  ДопПаарметры - 	 -
//
Процедура ВзаимодействиеSMSНастроитьСервисЗавершение(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ЗаполнитьСервисSMSРассылкиПоУмолчанию(Результат);
		Элементы.ГруппаВзаимодействиеSMSНастроитьСервис.Видимость = Ложь;
		Элементы.ГруппаВзаимодействиеSMSОсновная.Видимость        = Истина;
		УстановитьВидимостьВсплывающихГрупп("SMS");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - Заполнить сервис SMSРассылки по умолчанию.
//
// Параметры:
//  СервисSMSРассылки	 - 	 -
//
Процедура ЗаполнитьСервисSMSРассылкиПоУмолчанию(СервисSMSРассылки)
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.СервисSMSРассылкиПоУмолчанию.Установить(СервисSMSРассылки);

КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMSТекст при изменении.
//
Процедура ВзаимодействиеSMSТекстПриИзменении(Элемент)
	
	ВзаимодействиеSMSОбновитьСтатусВведеныхСимволов();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обновляет колличество введенных символов.
//
Процедура ВзаимодействиеSMSОбновитьСтатусВведеныхСимволов()
	
	// Удаляем символы переноса строки.
	мТекст = НРег(ЭтотОбъект.ВзаимодействиеSMSТекст);
	
	// 1-sms это 160 символов, если больше 160 символов, тогда 1 sms = 153.
	РазмерностьСообщения = ?(СтрДлина(мТекст) > 160, 153, 160);
	КоличествоСМС = 0;

	СтрокаСимволов = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя@_$^~`№";
	
	Для а = 1 По СтрДлина(СтрокаСимволов) Цикл
		
		Если Найти(мТекст, Сред(СтрокаСимволов, а, 1)) > 0 Тогда
			
			// 1-sms это 70 символов, если больше 70 символов, тогда 1 sms = 67.
			РазмерностьСообщения = ?(СтрДлина(мТекст) > 70, 67, 70);
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	КоличествоСимволов = СтрДлина(мТекст);
	КоличествоСМС      = Цел(СтрДлина(мТекст) / РазмерностьСообщения) + ?(СтрДлина(мТекст) % РазмерностьСообщения > 0, 1, 0);
	
	ПредставлениеСимволов = СтрокаСЧислом(Нстр("ru = ';%1 символ;;%1 символа; %1 символов;%1 символа'; en = ';%1 character;;;;%1 characters'"),
							КоличествоСимволов,
							ВидЧисловогоЗначения.Количественное,
							НСтр("ru='L=ru'; en='L=en'")); 
	
	ЭтотОбъект.ВзаимодействиеSMSСтатусВведенныхСимволов = ПредставлениеСимволов + ", " + КоличествоСМС + " sms";	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMS Отправить.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура ВзаимодействиеSMSОтправить(Команда)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеSMSТекст)
		И ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеSMSНомерТелефона) Тогда
		
		ВзаимодействиеSMSОтправитьСервер();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнены данные sms сообщения!'; en = 'Not filled in sms message data!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMS Отправить сервер.
//
Процедура ВзаимодействиеSMSОтправитьСервер()
		
	ОписаниеОшибки = "";
	
	ДокументSMSРассылкаСоздан = СоздатьДокументSMSРассылкаИОтправитьSMSНаСервере(
		Объект.Ссылка, 
		ЭтотОбъект.ВзаимодействиеSMSНомерТелефона, 
		ЭтотОбъект.ВзаимодействиеSMSТекст,
		ЭтотОбъект.ВзаимодействиеСделка,
		ЭтотОбъект.ТекущаяСтруктурнаяЕдиница,
		ОписаниеОшибки
	); 
	
	Если ДокументSMSРассылкаСоздан = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ОбновитьИсториюВзаимодействияСКлиентом(, Элементы.КнопкаПодробно.Пометка);
	
	ЭтотОбъект.ВзаимодействиеSMSТекст         = "";
	ЭтотОбъект.ВзаимодействиеSMSНомерТелефона = "";
	
	СнятьВидимостьВсплывающихГруппСервер("SMS");

КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Создать документ РассылкаСообщений и отправить SMS.
//
// Параметры:
//  МассивСтруктурПолучателей	 - 	 -
//  Содержание					 - 	 -
//  ОписаниеОшибки				 - 	 -
//
// Возвращаемое значение:
//   -
//
Функция СоздатьДокументSMSРассылкаИОтправитьSMSНаСервере(Заявка, НомерТелефона, Содержание, Сделка, СтруктурнаяЕдиница, ОписаниеОшибки)
	
	МассивСтруктурПолучателей = Новый Массив;
	МассивСтруктурПолучателей.Добавить(Новый Структура("Получатель, НомерТелефона", Заявка, НомерТелефона));
	
	ПараметрыРассылки = Новый Структура;
	ПараметрыРассылки.Вставить("Получатели"        , МассивСтруктурПолучателей);
	ПараметрыРассылки.Вставить("Содержание"        , Содержание);
	ПараметрыРассылки.Вставить("Сделка"            , Сделка);
	ПараметрыРассылки.Вставить("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	ПараметрыРассылки.Вставить("ОтправкаSMS"       , Истина);
	
	Возврат Документы.РассылкаСообщений.СоздатьДокументРассылкаСообщений(ПараметрыРассылки, ОписаниеОшибки);
	
КонецФункции

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура СоздатьПисьмо(Команда)
	
	Если Не ПроверитьВидимостьВсплывающихГрупп("Письмо") Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВзаимодействиеПослеВопросаОЗаписиЗаявки", ЭтотОбъект, Новый Структура("ВыполнитьДействие", "СоздатьПисьмо"));
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Для отправки электронного письма нужно произвести запись заявки. Записать?'; en = 'To send an email you need to record the application. To record?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		Если Модифицированность И Не ЭтаФорма.Записать() Тогда
			Возврат;
		КонецЕсли;
		
		СоздатьПисьмоНаКлиенте();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, создает исходящее электронное письмо.
//
Процедура СоздатьПисьмоНаКлиенте()
	
	МассивАдресовЭП = ПолучитьАдресаЭПЗаявкиКлиента(Объект.Ссылка);
	
	Если ЗначениеЗаполнено(МассивАдресовЭП) Тогда
		
		ЭтотОбъект.ВзаимодействиеПисьмоСписокАдресовЭП.ЗагрузитьЗначения(МассивАдресовЭП);
		
		Если Не (ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП)
			И МассивАдресовЭП.Найти(ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП) <> Неопределено) Тогда
			
			ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП = МассивАдресовЭП[0];
		КонецЕсли;
		
		Элементы.ВзаимодействиеПисьмоВыбратьАдресЭП.Заголовок = ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП;
		
		ПереместитьЭлементСделкиВзаимодействия("ГруппаВзаимодействиеПисьмоШапка");
		
		УстановитьВидимостьВсплывающихГрупп("Письмо");
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'У клиента не задан адрес электронной почты, или рассылка запрещена'; en = 'The client does not have an email address or mailing is prohibited'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие Письмо, выбрать адрес ЭП.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура ВзаимодействиеПисьмоВыбратьАдресЭП(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВзаимодействиеПисьмоВыбратьАдресЭПЗавершение", ЭтотОбъект);

	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеПисьмоСписокАдресовЭП);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие Письмо, выбрать адрес ЭП завершение.
//
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
//
Процедура ВзаимодействиеПисьмоВыбратьАдресЭПЗавершение(Результат, ДопПараметры) Экспорт
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ВзаимодействиеПисьмоТекст;
	
	Если Результат <> Неопределено  Тогда
		
		ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП = Результат;
		
		Элементы.ВзаимодействиеПисьмоВыбратьАдресЭП.Заголовок = Результат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие письмо настроить аккаунт.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура ВзаимодействиеПисьмоНастроитьАккаунт(Команда)
		
	ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.ФормаОбъекта", Новый Структура("ПользовательУчетнойЗаписи", ОбщегоНазначенияСтоматология.ТекущийПользователь()), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие письмо настроить аккаунт завершение.
//
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
//
Процедура ВзаимодействиеПисьмоНастроитьАккаунтЗавершение(Результат)
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Элементы.ГруппаВзаимодействиеПисьмоНастроитьАккаунт.Видимость = Ложь;
		Элементы.ГруппаВзаимодействиеПисьмоОсновная.Видимость         = Истина;
		УстановитьВидимостьВсплывающихГрупп("Письмо");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие Письмо отправить.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура ВзаимодействиеПисьмоОтправить(Команда)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеПисьмоТема)
		И ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеПисьмоТекст)
		И ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП) Тогда
		
		ВзаимодействиеПисьмоОтправитьСервер();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнены данные письма!'; en = 'The letter data is not filled in!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие письмо отправить сервер.
//
Процедура ВзаимодействиеПисьмоОтправитьСервер()
	
	ОписаниеОшибки = "";
	
	ДокументСоздан = СоздатьДокументИсходящееПисьмоОтправитьПисьмоНаСервере(
		Объект.Ссылка, 
		ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП,
		ЭтотОбъект.ВзаимодействиеПисьмоТема,
		ЭтотОбъект.ВзаимодействиеПисьмоТекст,
		ЭтотОбъект.ВзаимодействиеСделка,
		ОписаниеОшибки
	);
	
	Если ДокументСоздан = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ОбновитьИсториюВзаимодействияСКлиентом(, Элементы.КнопкаПодробно.Пометка);
	
	ЭтотОбъект.ВзаимодействиеПисьмоТема    = "";
	ЭтотОбъект.ВзаимодействиеПисьмоТекст   = "";
	ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП = "";
	
	СнятьВидимостьВсплывающихГруппСервер("Письмо");
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Создать документ исходящее письмо отправить письмо на сервере.
//
// Параметры:
//  МассивСтруктурПолучателей	 - 	 - 
//  Содержание					 - 	 - 
//  Тема						 - 	 - 
//  ОписаниеОшибки				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьДокументИсходящееПисьмоОтправитьПисьмоНаСервере(Заявка, Адрес, Тема, Содержание, Сделка, ОписаниеОшибки)
	
	МассивСтруктурПолучателей = Новый Массив;
	МассивСтруктурПолучателей.Добавить(Новый Структура("Контакт, Адрес", Заявка, Адрес));
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Дата"             , ТекущаяДатаСеанса());
	ДанныеЗаполнения.Вставить("Тема"             , Тема);
	ДанныеЗаполнения.Вставить("Тело"             , Содержание);
	ДанныеЗаполнения.Вставить("МассивПолучателей", МассивСтруктурПолучателей);
	ДанныеЗаполнения.Вставить("Сделка"           , Сделка);
		
	УстановитьПривилегированныйРежим(Истина);
	
	ИсходящееЭлектронноеПисьмо = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
	ИсходящееЭлектронноеПисьмо.Заполнить(ДанныеЗаполнения);
	
	Возврат Документы.ЭлектронноеПисьмоИсходящее.ВыполнитьОтправкуПисьма(ИсходящееЭлектронноеПисьмо, ОписаниеОшибки);

КонецФункции

&НаСервере
// Процедура - Установить актуальную сделку взаимодействия.
//
Процедура УстановитьАктуальнуюСделкуВзаимодействия()
	
	// Установить актуальную сделку клиента.
	ЭтотОбъект.ВзаимодействиеСделка = Справочники.Сделки.ПолучитьАктуальнуюСделкуКлиента(Объект.ОсновнойКлиент, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	УстановитьСостояниеЭлементовСделкиВзаимодействия(
		ЭтотОбъект.ВзаимодействиеСделка, 
		?(ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеСделка), ЭтотОбъект.ВзаимодействиеСделка.ЭтапСделки.ЦветЭтапа, Неопределено)
	);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор сделки взаимодействия.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВыборСделкиВзаимодействия(Команда)
	
	СписокВыбора = ВернутьСписокСделокКлиента(Объект.ОсновнойКлиент);
	
	Если ЗначениеЗаполнено(СписокВыбора) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ОбработчикВыбораСделкиВзаимодействия", ЭтотОбъект);
		ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Элементы.ВзаимодействиеСделка);
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Нет доступных сделок!'; en = 'No deals available!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка сделки взаимодействия клиента завершение.
//
Процедура ОбработчикВыбораСделкиВзаимодействия(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		УстановитьСостояниеЭлементовСделкиВзаимодействия(Результат.Значение.Сделка, Результат.Значение.ЦветЭтапа);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Обработчик выбора сделки взаимодействия сервер.
//
// Параметры:
//  Сделка		 - 	 - 
//  ЦветЭтапа	 - 	 - 
//
Процедура УстановитьСостояниеЭлементовСделкиВзаимодействия(Сделка, ЦветЭтапа)
	
	ЦветФона = ?(ЗначениеЗаполнено(ЦветЭтапа), ЗначениеИзСтрокиВнутр(ЦветЭтапа), Новый Цвет());
	ЦветФона = ?(ЦветФона = Новый Цвет(), Новый Цвет(214, 234, 255), ЦветФона);
	
	Представление = ?(ЗначениеЗаполнено(Сделка), Строка(Сделка), НСтр("ru = 'Выбрать сделку'; en = 'Choose a deal'"));
	
	ЭтотОбъект.ВзаимодействиеСделка                          = Сделка; 
	Элементы.ВзаимодействиеСделка.Заголовок                  = Представление;
	ЭтаФорма.Команды["ВзаимодействиеСделка"].Подсказка       = Представление;
	Элементы.ГруппаВаимодействиеСделкаПредставление.ЦветФона = ЦветФона;
	Элементы.ВзаимодействиеСделка.ЦветТекста                 = ОбщегоНазначенияСтоматология.ПолучитьЦветТекстаПоЦветуФона(ЦветФона, Истина);

КонецПроцедуры

&НаСервере
// Процедура - Переместить элемент сделки.
//
// Параметры:
//  ИмяРодителя	 - 	 - 
//
Процедура ПереместитьЭлементСделкиВзаимодействия(ИмяРодителя)
		
	Элементы.Переместить(Элементы.ГруппаВаимодействиеСделкаПеремещаемая, Элементы[ИмяРодителя]);
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Виджет

&НаСервере
// Процедура, СоздатьВиджетСделки.
//
Процедура СоздатьВиджетСделки()
	
	Если ЗначениеЗаполнено(Объект.ОсновнойКлиент) Тогда	
		УправлениеИнтерфейсамиСервер.ОбновитьВиджетСделки(ЭтаФорма, Объект.ОсновнойКлиент);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура, ОбработчикНажатиДинамическогоЭлементаВиджета.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Процедура ОбработчикНажатиДинамическогоЭлементаВиджета(Команда) Экспорт
	
	ИмяКоманды = Команда.Имя;
	Если СтрНайти(ИмяКоманды, "КомандаОткрытьПродажу") Тогда 
		
		ИндексСтроки = ПолучитьИндексСтроки(ИмяКоманды);
		Прием		 = ЭтаФорма.ТаблицаСделок[ИндексСтроки].Прием;
		
		Если ЗначениеЗаполнено(Прием) Тогда
			ПоказатьЗначение(,Прием);
		КонецЕсли;
		
	ИначеЕсли СтрНайти(ИмяКоманды, "КомандаСоздатьСделку") Тогда
		
		ВидыСделок = ПолучитьВидыСделок(Объект.ОсновнойКлиент, Объект.СтруктурнаяЕдиница);
		
		Оповещение = Новый ОписаниеОповещения("СтатусОбработанЗавершение", ЭтотОбъект);		
		ПоказатьВыборИзМеню(Оповещение, ВидыСделок, Элементы.КнопкаСоздатьСделку);

	Иначе
		
		Если СтрНайти(ИмяКоманды, "КомандаСделка") Тогда
			
			ИндексГурппы  = ПолучитьИндексСтроки(ИмяКоманды, Ложь);
			ИмяГруппыРодителя = Элементы["ГруппаТелоВиджета_" + ИндексГурппы].Родитель.Имя;
			СтрокаТаблицы = ЭтаФорма.ТаблицаСделок[ИндексГурппы];
			Если НЕ ИмяГруппыРодителя = "ВиджетСделки" Тогда
				ПоказатьЗначение(,СтрокаТаблицы.Сделка);
				Возврат;
			КонецЕсли;

		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Контрагент", Объект.ОсновнойКлиент);
		ПараметрыФормы.Вставить("ВыбратьЭтап", СтрНайти(ИмяКоманды, "КомандаТекущийЭтап") > 0);
		
		ИндексГурппы  = ПолучитьИндексСтроки(ИмяКоманды, Ложь);
		СтрокаТаблицы = ЭтаФорма.ТаблицаСделок[ИндексГурппы];
		ПараметрыФормы.Вставить("Сделка", СтрокаТаблицы.Сделка);
		
		ОткрытьФорму("Справочник.Сделки.Форма.ФормаВиджета", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;

	// Если СтрНайти(Команда.Имя, "КомандаТекущийЭтап") > 0 Тогда
	//	
	//	ИндексГурппы = ПолучитьИндексСтроки(Команда.Имя);	
	//		
	//	Если Элементы["ГруппаПричиныОтказа_" + ИндексГурппы].Видимость
	//		ИЛИ Элементы["ГруппаРеализация_"+ ИндексГурппы].Видимость Тогда
	//		
	//		Элементы["ГруппаЭтапы_" + ИндексГурппы].Видимость   	  = Истина;
	//		Элементы["ГруппаПричиныОтказа_" + ИндексГурппы].Видимость = Ложь;
	//		Элементы["ГруппаРеализация_"+ ИндексГурппы].Видимость	  = Ложь;
	//		
	//	КонецЕсли;

	//	СменитьФокусЭлемента(ИндексГурппы);

	//	Элементы["ГруппаВсплывающая_" + ИндексГурппы].Показать(); 
	//	
	// ИначеЕсли СтрНайти(Команда.Имя, "КомандаСделка") Тогда 
	//	
	//	ИндексСтроки  = ПолучитьИндексСтроки(Команда.Имя);
	//	СтрокаТаблицы = ЭтаФорма.ТаблицаСделок[ИндексСтроки];
	//	
	//	ПоказатьЗначение(,СтрокаТаблицы.Сделка);
	//	
	// ИначеЕсли СтрНайти(Команда.Имя, "КомандаОткрытьПродажу") Тогда 
	//	
	//	ИндексСтроки = ПолучитьИндексСтроки(Команда.Имя);
	//	Реализация   = ЭтаФорма.ТаблицаСделок[ИндексСтроки].Реализация;
	//	
	//	Если ЗначениеЗаполнено(Реализация) Тогда
	//		ПоказатьЗначение(,Реализация);
	//	КонецЕсли;
	//	
	// ИначеЕсли СтрНайти(Команда.Имя, "КомандаСоздатьСделку") Тогда
	//	
	//	МассивВидовСделок = ПолучитьВидыСделок(Объект.ОсновнойКлиент);		
	//	СписокВыбора 	  = Новый СписокЗначений();		
	//	СписокВыбора.ЗагрузитьЗначения(МассивВидовСделок);
	//	
	//	Для Каждого ЭлементСписка Из СписокВыбора Цикл		
	//		ЭлементСписка.Представление = ЭлементСписка.Значение; 			
	//	КонецЦикла;

	//	Оповещение = Новый ОписаниеОповещения("СтатусОбработанЗавершение", ЭтотОбъект);		
	//	ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Элементы.КнопкаСоздатьСделку);
	//	
	// КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, ОбработчикНажатияИзменитьЭтап.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Процедура ОбработчикНажатияИзменитьЭтап(Команда) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент", Объект.ОсновнойКлиент);
	ПараметрыФормы.Вставить("ИзменитьЭтапОтказ", СтрНайти(Команда.Имя, "КомандаИзменитьЭтапОтказ") > 0);
	
	ИндексГурппы  = ПолучитьИндексСтроки(Команда.Имя, Ложь);
	СтрокаТаблицы = ЭтаФорма.ТаблицаСделок[ИндексГурппы];
	ПараметрыФормы.Вставить("Сделка", СтрокаТаблицы.Сделка);
	
	ОткрытьФорму("Справочник.Сделки.Форма.ФормаВиджета", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	 
КонецПроцедуры

&НаКлиенте
// Процедура, ОбработчикТаблицаОтказовВыбор.
//
Процедура ОбработчикТаблицаОтказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
	
	ПричинаОтказа = Элемент.ТекущиеДанные.Ссылка;
	ИмяЭлемента   = Элемент.Имя;
	
	ИндексВиджета = ПолучитьИндексСтроки(ИмяЭлемента, Ложь);
	СменитьФокусЭлемента(ИндексВиджета);
	
	ОбновитьПричинуОтказаВыборНаСервере(ПричинаОтказа, ИмяЭлемента);	
	Оповестить("ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ");
	Оповестить("ОБНОВИТЬ_ВИДЖЕТ_СДЕЛКИ");
    
КонецПроцедуры

&НаСервере
// Процедура, ОбновитьПричинуОтказаВыборНаСервере.
//
Процедура ОбновитьПричинуОтказаВыборНаСервере(ПричинаОтказа, ИмяЭлемента)	
	
	УправлениеИнтерфейсамиСервер.ОбновитьПричинуОтказа(ЭтаФорма, ПричинаОтказа, ИмяЭлемента);
	
КонецПроцедуры

&НаСервере
// Процедура, ОбновитьСделку.
//
Процедура ОбновитьСделку(ИмяКоманды, Контрагент)
		
	Если СтрНайти(ИмяКоманды, "КомандаЭтап") > 0 Тогда		
		
		ИндексВиджета 	= ПолучитьИндексСтроки(ИмяКоманды, Ложь);
		ИндексЭтапа     = ПолучитьИндексСтроки(ИмяКоманды);
		НайденнаяСделка = ЭтотОбъект.ТаблицаСделок[ИндексВиджета].Сделка;
		
		УправлениеИнтерфейсамиСервер.ОбновитьЭтапСделки(НайденнаяСделка, ИндексЭтапа);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает идентификатор строки данных по имени элемента.
//
// Параметры:
//	 ИмяЭлемента 	- Строка - имя элемента.
//   ИндексЭлемента - Булево - признак чего получаем индекс (Элемента или Виджета).
//
Функция ПолучитьИндексСтроки(ИмяЭлемента, ИндексЭлемента = Истина)
	
	Если ИндексЭлемента Тогда
		НомерСимвола = СтрНайти(ИмяЭлемента,"_");
		Возврат Число(Сред(ИмяЭлемента, НомерСимвола + 1, 1));
	Иначе
		НомерСимвола = СтрНайти(ИмяЭлемента,"_", НаправлениеПоиска.СКонца);
		Возврат Число(Сред(ИмяЭлемента, НомерСимвола + 1, 1));
	КонецЕсли;
	 	
КонецФункции

&НаКлиенте
// Процедура, СменитьФокусЭлемента.
Процедура СменитьФокусЭлемента(Знач ИндексГурппы)
	
	ЭтаФорма.ТекущийЭлемент = Элементы["КнопкаТекущийЭтап_" + ИндексГурппы];

КонецПроцедуры

&НаСервереБезКонтекста
// Функция, ПолучитьВидыСделок.
//
Функция ПолучитьВидыСделок(Клиент = Неопределено, СтруктурнаяЕдиница = Неопределено)
	
	Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда 
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		ДоступныеВидыСделок = Справочники.ВидыСделок.ПолучитьДоступныеДляГенерацииВидыСделок(СтруктурнаяЕдиница, Клиент,,,,, Истина);
	Иначе
		ДоступныеВидыСделок = Справочники.ВидыСделок.ПолучитьДоступныеДляГенерацииВидыСделок(СтруктурнаяЕдиница, Неопределено,,,, Истина, Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыСделок.Ссылка КАК Ссылка,
	|	ВидыСделок.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВидыСделок КАК ВидыСделок
	|ГДЕ
	|	ВидыСделок.Ссылка В (&ДоступныеВидыСделок)");
	
	Запрос.УстановитьПараметр("ДоступныеВидыСделок", ДоступныеВидыСделок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
// Функция, создает новую сделку клиенту.
//
Функция СоздатьСделку(Клиент, ВидСделки)
		
	Если НЕ ЗначениеЗаполнено(Клиент)
		И НЕ ЗначениеЗаполнено(ВидСделки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НоваяСделка   = Справочники.Сделки.СоздатьЭлемент();		
	ТаблицаЭтапов = Справочники.ВидыСделок.ПолучитьЭтапыПоВидуСделки(ВидСделки);
	
	ДанныеЗаполнения = Новый Структура();
	ДанныеЗаполнения.Вставить("Контрагент"					, Клиент);
	ДанныеЗаполнения.Вставить("ВидСделки"					, ВидСделки);
	ДанныеЗаполнения.Вставить("Заявка"						, Объект.Ссылка);
	ДанныеЗаполнения.Вставить("ЭтапСделки"					, ?(ТаблицаЭтапов.Количество()> 0, ТаблицаЭтапов[0].ЭтапСделки, Неопределено));
	ДанныеЗаполнения.Вставить("ДатаСделки"					, ТекущаяДатаСеанса());
	ДанныеЗаполнения.Вставить("СтруктурнаяЕдиница"			, ЭтотОбъект.ТекущаяСтруктурнаяЕдиница);
	ДанныеЗаполнения.Вставить("ИсточникИнформации"			, Объект.РекламныйИсточник);
	ДанныеЗаполнения.Вставить("ИсточникИнформацииЗначение"	, Объект.ИсточникИнформацииЗначение);
	ДанныеЗаполнения.Вставить("КаналПривлечения"			, Объект.КаналПривлечения);
	ДанныеЗаполнения.Вставить("КаналПривлеченияЗначение"	, Объект.КаналПривлеченияЗначение);
	
	НоваяСделка.Заполнить(ДанныеЗаполнения);
	
	Попытка
		
		НоваяСделка.Записать();
		СоздатьВиджетСделки();
		Возврат НоваяСделка.Ссылка;
		
	Исключение
		
	    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось создать сделку'; en = 'Failed to create a deal.'"));
		
	КонецПопытки;
		
КонецФункции

&НаКлиенте
// Процедура, ПоказатьСделкиАрхива.
//
Процедура ПоказатьСделкиАрхива(Команда) Экспорт
	
	ГруппаАрхивСделокСвертываемая = ЭтаФорма.Элементы.Найти("ГруппаСвертываемаяАрхивСделок");	
	Если НЕ ГруппаАрхивСделокСвертываемая = Неопределено Тогда
		ГруппаАрхивСделокСвертываемая.Видимость = НЕ ГруппаАрхивСделокСвертываемая.Видимость;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция, возвращает данные внешних систем мессенджера.
//
Функция ПолучитьДоступныеВнешниеСистемыМессенджера(Клиент, СтруктурнаяЕдиница, ДляОтправкиПервым = Ложь, МассивТребуемыхНомеров = Неопределено)
	
	Возврат Справочники.ВнешниеСистемы.ПолучитьДоступныеВнешниеСистемыМессенджера(Клиент,СтруктурнаяЕдиница,ДляОтправкиПервым, МассивТребуемыхНомеров);
	
КонецФункции

&НаСервере
// Процедура - Обновить заголовок заявки
//
Процедура ОбновитьЗаголовокЗаявки()
	
	Если Объект.Ссылка.Пустая() Тогда 
		ЭтаФорма.Заголовок = НСтр("ru = 'Обращение (создание)'; en = 'Application (creation)'");
	ИначеЕсли Объект.ПометкаУдаления Тогда 
		ЭтаФорма.Заголовок = СокрЛП(Объект.Наименование) + НСтр("ru=' (Обращение № '; en=' (Application № '") + ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Объект.Код, "") + ") " + НСтр("ru='(удалена)'; en='(deleted)'");
	Иначе 	
		ЭтаФорма.Заголовок = СокрЛП(Объект.Наименование) + НСтр("ru=' (Обращение № '; en=' (Application № '") + ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Объект.Код, "") + ")";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Создать клиента по входящей заявке.
//
// Параметры:
//  Заявка			 - 	 -
//  ОписаниеОшибки	 - 	 -
//
// Возвращаемое значение:
//   -
//
Функция СоздатьПотенциальногоКлиентаПоВходящейЗаявке(Заявка, ОписаниеОшибки)
	
	Возврат Справочники.Заявки.СоздатьПотенциальногоКлиентаПоВходящейЗаявке(Заявка, ОписаниеОшибки);
	
КонецФункции

&НаСервере
// Процедура - Заполнить значения структуры данных всплывающих групп.
//
Процедура СформироватьСтруктуруДанныхВсплывающихГрупп()
			
	ПараметрыВидимости = Новый Структура;		
	ПараметрыВидимости.Вставить("Заметка"             , Ложь);
	ПараметрыВидимости.Вставить("ВзаимодействиеЗадача", Ложь);
	ПараметрыВидимости.Вставить("SMS"                 , Ложь);
	ПараметрыВидимости.Вставить("Письмо"              , Ложь);
	ПараметрыВидимости.Вставить("ФИО"                 , Ложь);
	ПараметрыВидимости.Вставить("ИсторияСтатусов"     , Ложь);

	УправлениеИнтерфейсамиСервер.СформироватьРеквизитСтруктурыДанныхВсплывающихГрупп(ЭтаФорма, ПараметрыВидимости);

КонецПроцедуры

&НаКлиенте
// Процедура - Проверка дублирования клиента контактная информация
//
// Параметры:
//  ДанныеКИ			 - 	 - 
//  ТекстРедактирования	 - 	 - 
//
Процедура ПроверкаДублированияКлиентаКонтактнаяИнформация(ДанныеКИ, ТекстРедактирования) Экспорт 
	
	ПроверкаДублированияКлиентаКонтактнаяИнформацияНаСервере();
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет проверку на дублирование клиентов.
//
Процедура ПроверкаДублированияКлиентаКонтактнаяИнформацияНаСервере(Знач ДанныеКИ = Неопределено, Знач ТекстРедактирования = Неопределено)
	
	Если (ЭтотОбъект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Отклонена
		  Или ЭтотОбъект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Принята)
		ИЛИ Не ЗначениеЗаполнено(ЭтаФорма.КонтактнаяИнформация) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПоказатьНаличиеДублейКлиентов.Видимость = Ложь;

	МассивДублей     = ПроверитьНаДублированиеКлиента();
	КоличествоДублей = МассивДублей.Количество();
	
	Если КоличествоДублей > 0 Тогда
		
		// Формирование представления проверки дублей.
		СтруктураПараметровСообщенияОДублях = Новый Структура;
		СтруктураПараметровСообщенияОДублях.Вставить("ЭлектроннаяПочта", НСтр("ru='почтой';en='by mail'"));
		СтруктураПараметровСообщенияОДублях.Вставить("НомерТелефона"   , НСтр("ru='номером телефона';en='number phone'"));
		
		Если КоличествоДублей = 1 Тогда
			
			СтруктураПараметровСообщенияОДублях.Вставить("КоличествоДублей" , НСтр("ru='один';en='one'"));
			СтруктураПараметровСообщенияОДублях.Вставить("СклонениеКлиентов", НСтр("ru='клиент';en='client'"));
			
		ИначеЕсли КоличествоДублей < 5 Тогда
			
			СтруктураПараметровСообщенияОДублях.Вставить("КоличествоДублей" , КоличествоДублей);
			СтруктураПараметровСообщенияОДублях.Вставить("СклонениеКлиентов", НСтр("ru='клиента';en='client'"));
		Иначе
			СтруктураПараметровСообщенияОДублях.Вставить("КоличествоДублей" , КоличествоДублей);
			СтруктураПараметровСообщенияОДублях.Вставить("СклонениеКлиентов", НСтр("ru='клиентов';en='clients'"));
			
		КонецЕсли;
		
		ОписаниеПредставления = НСтр("ru='С такой [ЭлектроннаяПочта] и [НомерТелефона] есть [КоличествоДублей] [СклонениеКлиентов]';en='With this [ЭлектроннаяПочта] and [НомерТелефона] there is [КоличествоДублей] [СклонениеКлиентов]'");
		ОписаниеПредставления = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ОписаниеПредставления, СтруктураПараметровСообщенияОДублях);
		
		ЭтотОбъект.СписокДублей.ЗагрузитьЗначения(МассивДублей);
		
		Элементы.ПоказатьНаличиеДублейКлиентов.Видимость = Истина;
		Элементы.ПоказатьНаличиеДублейКлиентов.Заголовок = ОписаниеПредставления;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция, выполняет проверку на дубли клиента.
//
Функция ПроверитьНаДублированиеКлиента()
	
	МассивКлиентов = Новый Массив;
	
	Для Каждого СтрокаКИ Из ЭтаФорма.КонтактнаяИнформация Цикл
		
		Если ЗначениеЗаполнено(Объект.ОсновнойКлиент) Тогда 
			ДублиКлиентов = Справочники.Контрагенты.ПроверитьНаДублированиеКлиентаКИ(Объект.ОсновнойКлиент, СтрокаКИ.Тип, СтрокаКИ.Представление);
		Иначе 	
			ДублиКлиентов = Справочники.Контрагенты.ПроверитьНаДублированиеКлиентаКИ(Неопределено, СтрокаКИ.Тип, СтрокаКИ.Представление);
		КонецЕсли;
	
		Если ЗначениеЗаполнено(ДублиКлиентов) Тогда
			ОбщегоНазначенияСтоматология.ДобавитьВМассив(МассивКлиентов, ДублиКлиентов, Истина);
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат МассивКлиентов;

КонецФункции
	
&НаКлиенте
// Процедура - Установить фокус элемента.
//
Процедура УстановитьФокусЭлемента()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.КнопкаДополнительно;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить фокус элемента на сервере.
//
Процедура УстановитьФокусЭлементаСервер()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.КнопкаДополнительно;
	
КонецПроцедуры

&НаКлиенте
// Функция - Проверить видимость всплывающей группы.
//
// Параметры:
//  ИмяВзаимодействия	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПроверитьВидимостьВсплывающихГрупп(ИмяЭлемента)
	
	Результат = УправлениеИнтерфейсамиКлиент.ПроверитьВидимостьВсплывающихГрупп(ЭтаФорма, ИмяЭлемента);
	
	Если Результат = Ложь Тогда 
		УстановитьФокусЭлемента();
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

&НаКлиенте
// Процедура - Установить видимость всплывающих групп.
//
// Параметры:
//  ИмяВзаимодействия	 - 	 - 
//  Видимость			 - 	 - 
//
Процедура УстановитьВидимостьВсплывающихГрупп(ИмяЭлемента)
	
	УправлениеИнтерфейсамиКлиент.УстановитьВидимостьВсплывающихГрупп(ЭтаФорма, ИмяЭлемента);
	
КонецПроцедуры

&НаСервере
// Процедура - Установить видимость всплывающих групп на сервере.
//
// Параметры:
//  ИмяВзаимодействия	 - 	 - 
//  Видимость			 - 	 - 
//
Процедура УстановитьВидимостьВсплывающихГруппСервер(ИмяЭлемента, ИндексЭлемента = Неопределено)
	
	УправлениеИнтерфейсамиСервер.УстановитьВидимостьВсплывающихГрупп(ЭтаФорма, ИмяЭлемента, ИндексЭлемента);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Снять видимость всплывающих групп.
//
// Параметры:
//  ИмяВзаимодействия	 - 	 - 
//  Видимость			 - 	 - 
//
Процедура СнятьВидимостьВсплывающихГрупп(ИмяЭлемента)
	
	УправлениеИнтерфейсамиКлиент.СнятьВидимостьВсплывающихГрупп(ЭтаФорма, ИмяЭлемента); 
	УстановитьФокусЭлемента();	
	
КонецПроцедуры

&НаСервере
// Процедура - Снять видимость всплывающих групп на сервере.
//
// Параметры:
//  ИмяВзаимодействия	 - 	 - 
//  Видимость			 - 	 - 
//
Процедура СнятьВидимостьВсплывающихГруппСервер(ИмяЭлемента)
	
	УправлениеИнтерфейсамиСервер.СнятьВидимостьВсплывающихГрупп(ЭтаФорма, ИмяЭлемента); 
	УстановитьФокусЭлементаСервер();	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Установить состояние элементов формы статусы заявок.
//
Процедура УстановитьСостояниеЭлементовФормыСтатусыЗаявки()
	
	// Установить значение статуса Заявки.
	Если ЭтотОбъект.СтатусЗаявки = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.НеОбработана") Тогда
		
		УстановитьСостояниеЭлементаФормыСтатусЗаявки(Неопределено);
		Элементы.ГруппаСтатусНеОбработана.ЦветФона	 = ПолучитьЦветСтатусаЗаявки(ЭтотОбъект.СтатусЗаявки);
		Элементы.СтатусНеОбработана.ЦветТекста		 = Новый Цвет(255, 255, 255);
		
	ИначеЕсли ЭтотОбъект.СтатусЗаявки = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ПропущенныйЗвонок") Тогда
		
		УстановитьСостояниеЭлементаФормыСтатусЗаявки(Неопределено);
		Элементы.ГруппаСтатусПропущенныйЗвонок.ЦветФона = ПолучитьЦветСтатусаЗаявки(ЭтотОбъект.СтатусЗаявки);
		
	ИначеЕсли ЭтотОбъект.СтатусЗаявки = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ОтвеченныйЗвонок") Тогда
		
		УстановитьСостояниеЭлементаФормыСтатусЗаявки(Неопределено);
		Элементы.ГруппаСтатусОтвеченныйЗвонок.ЦветФона = ПолучитьЦветСтатусаЗаявки(ЭтотОбъект.СтатусЗаявки);
		
	ИначеЕсли ЭтотОбъект.СтатусЗаявки = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ОтвеченныйДиалог") Тогда
		
		УстановитьСостояниеЭлементаФормыСтатусЗаявки(Неопределено);
		Элементы.ГруппаСтатусОтвеченныйДиалог.ЦветФона = ПолучитьЦветСтатусаЗаявки(ЭтотОбъект.СтатусЗаявки);
		
	ИначеЕсли ЭтотОбъект.СтатусЗаявки = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Перезвонить") Тогда
		
		УстановитьСостояниеЭлементаФормыСтатусЗаявки(Неопределено);
		Элементы.ГруппаСтатусПерезвонить.ЦветФона = ПолучитьЦветСтатусаЗаявки(ЭтотОбъект.СтатусЗаявки);
		
	ИначеЕсли ЭтотОбъект.СтатусЗаявки = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Отклонена") Тогда
		
		УстановитьСостояниеЭлементаФормыСтатусЗаявки(Неопределено, Истина);
		Элементы.ГруппаСтатусНекачественная.ЦветФона = ПолучитьЦветСтатусаЗаявки(ЭтотОбъект.СтатусЗаявки);
		Элементы.СтатусНекачественная.ЦветТекста	 = Новый Цвет(255, 255, 255);
		
		Элементы.СтатусНеОбработана.Доступность		 = Ложь;
		Элементы.СтатусПропущенныйЗвонок.Доступность = Ложь;
		Элементы.СтатусОтвеченныйЗвонок.Доступность	 = Ложь;
		Элементы.СтатусОтвеченныйДиалог.Доступность	 = Ложь;
		Элементы.СтатусПерезвонить.Доступность		 = Ложь;
		
	ИначеЕсли ЭтотОбъект.СтатусЗаявки = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Принята") Тогда
		
		УстановитьСостояниеЭлементаФормыСтатусЗаявки(Неопределено);
		Элементы.ГруппаСтатусОбработана.ЦветФона = ПолучитьЦветСтатусаЗаявки(ЭтотОбъект.СтатусЗаявки);
		
		Элементы.СтатусНеОбработана.Доступность		 = Ложь;
		Элементы.СтатусПропущенныйЗвонок.Доступность = Ложь;
		Элементы.СтатусОтвеченныйЗвонок.Доступность	 = Ложь;
		Элементы.СтатусОтвеченныйДиалог.Доступность	 = Ложь;
		Элементы.СтатусПерезвонить.Доступность		 = Ложь;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Установить состояние элемента формы интервал времени записи.
//
// Параметры:
//  АтивныйЭлемент	 - 	 -
//
Процедура УстановитьСостояниеЭлементаФормыСтатусЗаявки(АктивныйЭлемент, ПрименитьТемуНеобработаннойЗаявки = Ложь)
		
	МассивПодчиненныхЭлементов = ПолучитьМассивПодчиненныхЭлементов(
		Элементы.ГруппаСтатусыЗаявок.ПодчиненныеЭлементы,
		АктивныйЭлемент
	);
	
	УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(
		АктивныйЭлемент,
		МассивПодчиненныхЭлементов,,,,
		?(ПрименитьТемуНеобработаннойЗаявки, 2, Неопределено)
	);
	
	УстановитьФокусЭлемента();

КонецПроцедуры

&НаСервере
// Процедура - Заполнить списки выбора времени окончания работы.
//
// Параметры:
//  ВремяНачала	 - 	 -
//  ЭлементФормы - 	 -
//
Процедура ЗаполнитьСписокВыбораВремениЭлемента(ИмяЭлементаФормы, Знач ДатаНачала)
	
	ЭлементФормы = Элементы[ИмяЭлементаФормы];
	
	ПериодРаботы = Новый Структура;
	ПериодРаботы.Вставить("ДатаНачала"   , НачалоДня(ДатаНачала));
	ПериодРаботы.Вставить("ДатаОкончания", ДатаНачала + 86400);
	
	МассивПериодов = Новый Массив;
	МассивПериодов.Добавить(ПериодРаботы);
	
	СписокВремени = РаботаСДиалогами.ВернутьСписокВремениДляНачалаРаботыСервер(МассивПериодов, Ложь, 30);
	
	ЭлементФормы.СписокВыбора.Очистить();
	
	Для Каждого Элемент Из СписокВремени Цикл
		
		Представление = ?(Минута(Элемент.Значение) = 0, Элемент.Представление, Новый ФорматированнаяСтрока(Элемент.Представление,, Новый Цвет(100, 100, 100)));
		ЭлементФормы.СписокВыбора.Добавить(Элемент.Значение, Представление);
		
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Вернуть список сделок контрагента.
// 
Функция ВернутьСписокСделокКлиента(Контрагент)
		
	СписокСделок = Новый СписокЗначений;
	
	ТаблицаСделок = ПолучитьСделкиКлиента(Контрагент, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	Для Каждого СтрокаТ Из ТаблицаСделок Цикл
				
		ПараметрыСделки = Новый Структура;
		ПараметрыСделки.Вставить("Сделка"   , СтрокаТ.Ссылка);
		ПараметрыСделки.Вставить("ЦветЭтапа", СтрокаТ.ЦветЭтапа);
		
		СписокСделок.Добавить(ПараметрыСделки, СтрокаТ.Наименование);	
		
	КонецЦикла;	
		
	Возврат СписокСделок; 
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает сделки по контрагенту.
//
Функция ПолучитьСделкиКлиента(Контрагент, СтруктурнаяЕдиница = Неопределено)
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сделки.Ссылка КАК Ссылка,
	|	Сделки.Наименование КАК Наименование,
	|	Сделки.ЭтапСделки КАК ЭтапСделки,
	|	Сделки.ЭтапСделки.ЦветЭтапа КАК ЦветЭтапа
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	НЕ Сделки.ПометкаУдаления
	|	И Сделки.Контрагент = &Контрагент
	|	И &УсловиеСтруктурнаяЕдиница
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделки.ДатаСделки");
	
	Запрос.УстановитьПараметр("Контрагент", 		Контрагент);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	УсловиеСтруктурнаяЕдиница = ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), "И Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "");
	Запрос.Текст              = СтрЗаменить(Запрос.Текст, "И &УсловиеСтруктурнаяЕдиница", УсловиеСтруктурнаяЕдиница);	
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

&НаКлиенте
// Функция - Получить массив подчиненных элементов.
//
// Параметры:
//  ПодчиненныеЭлементы	 - 	 -
//
// Возвращаемое значение:
//   -
//
Функция ПолучитьМассивПодчиненныхЭлементов(ПодчиненныеЭлементы, ИсключаемыйЭлемент = Неопределено)
	
	МассивЭлементов = Новый Массив;
	
	Если ИсключаемыйЭлемент <> Неопределено Тогда
		
		Для Каждого Элемент Из ПодчиненныеЭлементы Цикл
			
			Если Элемент <> ИсключаемыйЭлемент Тогда
				МассивЭлементов.Добавить(Элемент);
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		Для Каждого Элемент Из ПодчиненныеЭлементы Цикл
			МассивЭлементов.Добавить(Элемент);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МассивЭлементов;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить округленное время взаимодействия
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьОкругленноеВремяВзаимодействия(ПолучитьТекДату = Ложь)
		
	ДатаВремя = ТекущаяДатаСеанса() + ?(ПолучитьТекДату, 0, 86400);
	
	КоличествоИнтервалов      = (ДатаВремя - НачалоДня(ДатаВремя)) / 1800;
	КоличествоЦелыхИнтервалов = Цел(КоличествоИнтервалов);
	
	// Округлить в большую сторону.
	Если ПолучитьТекДату = Ложь
		И КоличествоИнтервалов <> КоличествоЦелыхИнтервалов Тогда
		
		Возврат НачалоДня(ДатаВремя) + (КоличествоЦелыхИнтервалов + 1) * 1800;
	Иначе
		Возврат НачалоДня(ДатаВремя) + КоличествоЦелыхИнтервалов * 1800;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Функция - Получить структуру строки ТЗ.
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтруктуруСтрокиТЗ()
	
	Возврат Новый Структура("
	|Взаимодействие,
	|ВзаимодействиеИд,
	|Контрагент,
	|Дата,
	|ТипВзаимодействия,
	|ТипСобытия,
	|Автор,
	|Длительность,
	|Начало,
	|Окончание,
	|Статус,
	|Заметка,
	|ТипЗадачи,
	|ФайлЗаписи,
	|URLЗаписи,
	|Сделка");
	
КонецФункции

&НаСервере
// Процедура - Записать заявку в регистр история вызовов.
//
Процедура ЗаписатьЗаявкуВРегистрИсторияВызовов()
	
	НаборЗаписей = РегистрыСведений.ИсторияВызовов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОборудованиеТелефонии.Значение 		= ПОIPТелефонии;
	НаборЗаписей.Отбор.ОборудованиеТелефонии.Использование 	= Истина;
	НаборЗаписей.Отбор.IDЗвонка.Значение 					= IDЗвонка;
	НаборЗаписей.Отбор.IDЗвонка.Использование 				= Истина;
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		Запись = НаборЗаписей[0];
		Запись.Заявка = Объект.Ссылка;
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает номера телефонов контрагента.
//
Функция ПолучитьНомераТелефоновЗаявкиКлиента(Заявка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаявкиКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	Справочник.Заявки.КонтактнаяИнформация КАК ЗаявкиКонтактнаяИнформация
	|ГДЕ
	|	ЗаявкиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКлиента)
	|	И ЗаявкиКонтактнаяИнформация.НомерТелефона <> """"
	|	И ЗаявкиКонтактнаяИнформация.НеУчаствоватьВРассылке = ЛОЖЬ
	|	И ЗаявкиКонтактнаяИнформация.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Заявка);
		
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерТелефона");
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает номера телефонов контрагента.
//
Функция ПолучитьАдресаЭПЗаявкиКлиента(Заявка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаявкиКонтактнаяИнформация.АдресЭП КАК АдресЭП
	|ИЗ
	|	Справочник.Заявки.КонтактнаяИнформация КАК ЗаявкиКонтактнаяИнформация
	|ГДЕ
	|	ЗаявкиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКлиента)
	|	И ЗаявкиКонтактнаяИнформация.АдресЭП <> """"
	|	И ЗаявкиКонтактнаяИнформация.НеУчаствоватьВРассылке = ЛОЖЬ
	|	И ЗаявкиКонтактнаяИнформация.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Заявка);
		
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("АдресЭП");
	
КонецФункции

&НаСервереБезКонтекста
// Процедура - Удалить из избранного.
//
// Параметры:
//  СтрокаТЗ	 - 	 - 
//  Контрагент	 - 	 - 
//
Процедура УдалитьИзИзбранного(СтрокаТЗ, Заявка);

	МенеджерЗаписи = РегистрыСведений.ЗакрепленныеВзаимодействия.СоздатьМенеджерЗаписи();		
	
	Если СтрокаТЗ.ТипСобытия = "Заметка" Тогда
		МенеджерЗаписи.ВзаимодействиеИд = Новый УникальныйИдентификатор(СтрокаТЗ.ВзаимодействиеИд);
	Иначе
		МенеджерЗаписи.Взаимодействие = СтрокаТЗ.Взаимодействие;
	КонецЕсли;
	
	МенеджерЗаписи.Контрагент = Заявка;
	
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();	
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
// Функция, проверить менеджера и записать форму.
//
Функция УстановитьСтатусИЗаписатьФорму()
	
	РезультатОперации = Новый Структура;
	РезультатОперации.Вставить("ОписаниеОшибки"		, "");
	РезультатОперации.Вставить("ВыполненоУспешно"	, Ложь);
	
	Объект.ОсновнойКлиент 	= ?(Объект.Ссылка.Пустая(), Неопределено, Объект.ОсновнойКлиент);	
	Объект.Статус 			= ?(Объект.Статус <> ЭтотОбъект.СтатусЗаявки, ЭтотОбъект.СтатусЗаявки, Объект.Статус);
	// Объект.ОсновнойМенеджер = ?(Объект.ОсновнойМенеджер <> ЭтотОбъект.ТекущийПользователь, ЭтотОбъект.ТекущийПользователь, Объект.ОсновнойМенеджер);		
	
	Попытка
		ЭтаФорма.Записать();
		РезультатОперации.ВыполненоУспешно = Истина;
	Исключение
		ТекстОшибки = НСтр("ru = 'Не удалось установить статус заявки. Текст ошибки: '") + ОписаниеОшибки();
		РезультатОперации.ОписаниеОшибки = ТекстОшибки;
	КонецПопытки;
	
	Если РезультатОперации.ВыполненоУспешно = Истина Тогда
		
		// Создаем оповещение других сеансов о заявке.
		УстановитьПривилегированныйРежим(Истина);
		
		НомерТекущегоСеанса	 = НомерСеансаИнформационнойБазы();
		ТекущиеСеансы		 = ПолучитьСеансыИнформационнойБазы();
		
		// Если активен только один сеанс (текущий) - никого не оповещаем.
		Если ТекущиеСеансы.Количество() > 1 Тогда
			
			СистемаВзаимодействияПодключена = ОбсужденияСистемыВзаимодействия.СистемаВзаимодействияВключена() = Истина;
			
			Если Не СистемаВзаимодействияПодключена Тогда
				
				ПараметрыОповещения = Новый Массив;
				ПараметрыОповещения.Добавить(Объект.Ссылка);
				ПараметрыОповещения.Добавить(Объект.ОсновнойМенеджер);
				ПараметрыОповещения.Добавить(Объект.СтруктурнаяЕдиница);
				
			КонецЕсли;
			
			ПользователиОповещения = Новый Массив;
			
			Для Каждого Сеанс Из ТекущиеСеансы Цикл
				
				Если (Сеанс.ИмяПриложения = "1CV8C"
					Или Сеанс.ИмяПриложения = "WebClient") Тогда
				
					Если НомерТекущегоСеанса = Сеанс.НомерСеанса Тогда
						Продолжить;
					КонецЕсли;
					
					Если СистемаВзаимодействияПодключена Тогда
						ПользователиОповещения.Добавить(Сеанс.Пользователь);
					Иначе
						РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(
							Сеанс.НомерСеанса,,
							"ОбновленСтатусЗаявки",
							ТекущаяДатаСеанса(),,,,
							ПараметрыОповещения
						);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если СистемаВзаимодействияПодключена И ЗначениеЗаполнено(ПользователиОповещения) Тогда
				
				ДанныеСообщения = Новый Структура;
				ДанныеСообщения.Вставить("Ключ"					, "ОбновленСтатусЗаявки");
				ДанныеСообщения.Вставить("Заявка"				, Объект.Ссылка);
				ДанныеСообщения.Вставить("Сотрудник"			, ?(Объект.ОсновнойМенеджер.Пустая(), Неопределено, Объект.ОсновнойМенеджер));
				ДанныеСообщения.Вставить("СтруктурнаяЕдиница"	, ?(Объект.СтруктурнаяЕдиница.Пустая(), Неопределено, Объект.СтруктурнаяЕдиница));
				
				ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения,, ПользователиОповещения);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Проверить наличие сервиса SMSРассылки.
//
// Возвращаемое значение:
//   -
//
Функция НаличиеСервисаSMSРассылки()
	
	Возврат Не Константы.СервисSMSРассылкиПоУмолчанию.Получить().Пустая();
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Проверить наличие сервиса SMSРассылки.
//
// Возвращаемое значение:
//   -
//
Функция НаличиеСервисовSMSРассылки()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СервисыРассылки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СервисыРассылки КАК СервисыРассылки
	|ГДЕ
	|	СервисыРассылки.ПометкаУдаления = ЛОЖЬ");

	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Проверить наличие почтового аккаунта.
//
// Возвращаемое значение:
//   -
//
Функция НаличиеПочтовогоАккаунта()
	
	Возврат ЗначениеЗаполнено(УправлениеЭлектроннойПочтой.ПолучитьУчетнуюЗаписьДляОтправкиПоУмолчанию());
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Разрешена отправка SMSСообщений.
// 
// Возвращаемое значение:
//   - 
//
Функция РазрешенаОтправкаSMSСообщений()
	
	Возврат РольДоступна(Метаданные.Роли.ПолныеПрава);
	
КонецФункции

&НаСервере
// Процедура, устанавливает обязательные поля.
//
Процедура УстановитьОбязательныеПоля() 
	
	СтруктураОбязательныеПоля = ВернутьЗначениеКонстантыОбязательныеПоля();
		
	Если СтруктураОбязательныеПоля = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбязательныеПоля = Неопределено;
	
	Если Объект.Ссылка.Пустая() 
		И ТипЗнч(СтруктураОбязательныеПоля) = Тип("Структура") Тогда
		
		СтруктураОбязательныеПоля.Свойство("ОбязательныеПоляДляНовых", ОбязательныеПоля);		
		
	КонецЕсли;
	
	Если ОбязательныеПоля = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Для Каждого ОбязательноеПоле Из ОбязательныеПоля Цикл
		
		Если Лев(ОбязательноеПоле.Ключ, 6) <> "ЗАЯВКА" Тогда 
			Продолжить;	
		КонецЕсли;	
		
		ИзмененноеОбязательноеПоле = СтрЗаменить(ОбязательноеПоле.Ключ, "ЗАЯВКА_", "");
		
		Если СтрЗаменить(ИзмененноеОбязательноеПоле, Прав(ИзмененноеОбязательноеПоле, 1), "") = "ПредставлениеКИ_" И ОбязательноеПоле.Значение = Истина Тогда 
			
			КоличествоЭлементовКИ = Элементы.КонтактнаяИнформация.ПодчиненныеЭлементы.Количество();
			ИндексЭлементаКИ = 0;
			
			Пока КоличествоЭлементовКИ <> 0 Цикл
				
				ТекЭлемент = Элементы.Найти(СтрЗаменить(ИзмененноеОбязательноеПоле, Прав(ИзмененноеОбязательноеПоле, 1), "") + ИндексЭлементаКИ);
				
				Если ТекЭлемент <> Неопределено Тогда 
					
					Если(ОбязательноеПоле.Ключ = "ЗАЯВКА_ПредставлениеКИ_0" И ТекЭлемент.Подсказка = "Телефон") 
						ИЛИ (ОбязательноеПоле.Ключ = "ЗАЯВКА_ПредставлениеКИ_1" И ТекЭлемент.Подсказка = "Адрес электронной почты")
						ИЛИ (ОбязательноеПоле.Ключ = "ЗАЯВКА_ПредставлениеКИ_2" И ТекЭлемент.Подсказка = "Адрес") Тогда
						
						ТекЭлемент.АвтоОтметкаНезаполненного = Истина;
					КонецЕсли;
					
					КоличествоЭлементовКИ = КоличествоЭлементовКИ - 1;
					
				КонецЕсли;
				
				ИндексЭлементаКИ = ИндексЭлементаКИ + 1;
				
			КонецЦикла;
			
		Иначе
									
			ТекЭлемент = Элементы.Найти(ИзмененноеОбязательноеПоле);
			Если ТекЭлемент <> Неопределено Тогда 
				ТекЭлемент.АвтоОтметкаНезаполненного = ОбязательноеПоле.Значение;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Вернуть значение константы обязательные поля.
// 
// Возвращаемое значение:
//   - Структура - Значение константы.
//
Функция ВернутьЗначениеКонстантыОбязательныеПоля()
	
	ХранилищеЗначений = Константы.ОбязательныеПоляКлиенты.Получить();
	Возврат ХранилищеЗначений.Получить();
	
КонецФункции

&НаКлиенте
// Функция - Установить обязательные динамические поля.
// 
// Возвращаемое значение:
//   - СтруктураОбязательныхДинамическихПолей - Структура - Структура обязательных полей контактной информации.
//
Функция ПолучитьОбязательныеДинамическиеПоля()
	
	СтруктураОбязательныхДинамическихПолей = Новый Структура();
	СтруктураОбязательныхДинамическихПолей.Вставить("ФлагТелефон", Ложь);
	СтруктураОбязательныхДинамическихПолей.Вставить("ФлагEmail"  , Ложь);
	СтруктураОбязательныхДинамическихПолей.Вставить("ФлагАдрес"  , Ложь);
	
	СтруктураОбязательныеПоля = ВернутьЗначениеКонстантыОбязательныеПоля();
	
	ОбязательныеПоля = Неопределено;
	
	Если Объект.Ссылка.Пустая()		
		И ТипЗнч(СтруктураОбязательныеПоля) = Тип("Структура") Тогда
		
		СтруктураОбязательныеПоля.Свойство("ОбязательныеПоляДляНовых", ОбязательныеПоля);		
		
	КонецЕсли;
		
	Если ОбязательныеПоля <> Неопределено Тогда
		
		Для Каждого ОбязательноеПоле Из ОбязательныеПоля Цикл
			
			Если ОбязательноеПоле.Значение = Истина Тогда
				
				Если ОбязательноеПоле.Ключ = "ЗАЯВКА_ПредставлениеКИ_0" Тогда
					СтруктураОбязательныхДинамическихПолей.ФлагТелефон = Истина;
				ИначеЕсли ОбязательноеПоле.Ключ = "ЗАЯВКА_ПредставлениеКИ_1" Тогда
					СтруктураОбязательныхДинамическихПолей.ФлагEmail   = Истина;
				ИначеЕсли ОбязательноеПоле.Ключ = "ЗАЯВКА_ПредставлениеКИ_2" Тогда
					СтруктураОбязательныхДинамическихПолей.ФлагАдрес   = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтруктураОбязательныхДинамическихПолей;
	
КонецФункции

&НаКлиенте
// Функция - Проверить обязательные динамические поля.
//
// Параметры:
//  Элемент						 - Элемент формы - 
//  СтруктураФлаговДинамПолей	 - Структура	 - 
// 
// Возвращаемое значение:
//   - СтруктураФлаговДинамическихПолей - Структура
//
Функция ПроверитьОбязательныеДинамическиеПоля(Элемент, СтруктураФлаговДинамическихПолей)
	
	Если СтруктураФлаговДинамическихПолей = Неопределено Тогда
		СтруктураФлаговДинамическихПолей = СоздатьОбнуленнуюСтруктуруФлаговДинамическихПолей();
	КонецЕсли;
	
	Если Элемент.Подсказка = "Телефон" Тогда 
		
		Если СтруктураФлаговДинамическихПолей.ХотяБыОдинТелефон = Ложь Тогда
			СтруктураФлаговДинамическихПолей.ХотяБыОдинТелефон  = ЗначениеЗаполнено(Элемент.ТекстРедактирования);
		КонецЕсли;
		
	ИначеЕсли Элемент.Подсказка = "Адрес электронной почты" Тогда
		
		Если СтруктураФлаговДинамическихПолей.ХотяБыОдинEmail = Ложь Тогда
			СтруктураФлаговДинамическихПолей.ХотяБыОдинEmail  = ЗначениеЗаполнено(Элемент.ТекстРедактирования);
		КонецЕсли;
		
	ИначеЕсли Элемент.Подсказка = "Адрес" Тогда
		
		Если СтруктураФлаговДинамическихПолей.ХотяБыОдинАдрес = Ложь Тогда
			СтруктураФлаговДинамическихПолей.ХотяБыОдинАдрес  = ЗначениеЗаполнено(Элемент.ТекстРедактирования);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураФлаговДинамическихПолей;
	
КонецФункции

&НаКлиенте
// Функция - Создать обнуленную структуру флагов динам полей.
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьОбнуленнуюСтруктуруФлаговДинамическихПолей()
	
	ОбнуленнаяСтруктураФлагов = Новый Структура();
	ОбнуленнаяСтруктураФлагов.Вставить("ХотяБыОдинТелефон", Ложь);
	ОбнуленнаяСтруктураФлагов.Вставить("ХотяБыОдинEmail"  , Ложь);
	ОбнуленнаяСтруктураФлагов.Вставить("ХотяБыОдинАдрес"  , Ложь);
	
	Возврат ОбнуленнаяСтруктураФлагов;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, проверяет роль доступность роли.
//
// Параметры:
// 	Роль - Строка - Роль метаданных в строковом представлении.
//
Функция РольДоступнаКлиентСервер(Роль)
	
    Возврат РольДоступна(Роль);
	
КонецФункции

&НаКлиенте
// Функция, проверяет заполнено ли имя, фамилия или отчество.
//
Функция ЗаполненоФИО()
	
	Если ЗначениеЗаполнено(Объект.Фамилия) 
		ИЛИ ЗначениеЗаполнено(Объект.Имя) 
		  ИЛИ ЗначениеЗаполнено(Объект.Отчество) Тогда		
		Возврат Истина;		
	Иначе
		Возврат Ложь; 	
	КонецЕсли;	                                      
	
КонецФункции

&НаКлиенте
// Процедура, обработчик завершения перехода в чат мессенджера.
//
Процедура ПерейтиВЧат(ИдКлиента, ВнешняяСистема)
	
	ОписаниеОшибки = "";
			
	ИдСообщения = УстановитьОжиданиеСообщения(ИдКлиента, ВнешняяСистема);
	
	ДанныеКаналаСтруктура = Новый Структура;
	ДанныеКаналаСтруктура.Вставить("ИдКлиента"		, ИдКлиента);
	ДанныеКаналаСтруктура.Вставить("ВнешняяСистема"	, ВнешняяСистема);
	ДанныеКаналаСтруктура.Вставить("ИдСообщения"	, ИдСообщения);
	
	ПараметрыОткрытия = Новый Структура("ДанныеКанала", ДанныеКаналаСтруктура);
	
	Оповестить("ОткрытьДиалог", ПараметрыОткрытия);
	ОткрытьФорму("Обработка.Мессенджер_Стоматология.Форма.ФормаЧатаНовая", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры 

&НаСервереБезКонтекста
// Функция, создает сообщение с признаком ожидания сообщения.
//
Функция УстановитьОжиданиеСообщения(ИдКлиента, ВнешняяСистема, ОписаниеОшибки = "", Объект = Неопределено, НомерТелефона = "")
	
	Если ТипЗнч(ВнешняяСистема) = Тип("Строка") Тогда
		ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьСсылку(Новый УникальныйИдентификатор(ВнешняяСистема));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдКлиента) и ЗначениеЗаполнено(Объект) Тогда
		
		ДанныеКонтакта	 = СоздатьКонтактМессенджера(ВнешняяСистема, Объект, НомерТелефона);
		ИдКлиента		 = ДанныеКонтакта.ИдКлиента;
		ИдСообщения		 = ДанныеКонтакта.ИдСообщения;
		
	Иначе
		
		ИдСообщения = МессенджерСтоматология.ПолучитьИдОжидающегоСообщенияВМесенджер(ИдКлиента, ВнешняяСистема);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдКлиента) Тогда
		ОписаниеОшибки = НСтр("ru = 'Не удалось создать клиента в мессенджере.'; en = 'Failed to create messenger client.'");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ИдСообщения;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, создает канал мессенджера.
//
Функция СоздатьКонтактМессенджера(ВнешняяСистема, Контрагент, Знач НомерТелефона)
	
	Если ВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi Тогда
		
		НомерТелефона = ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(НомерТелефона, Ложь);
		НомерТелефона = ?(СтрДлина(НомерТелефона) > 10 И Лев(НомерТелефона, 1) = "8", "7" + Сред(НомерТелефона, 2), НомерТелефона);
		
		ИдКлиента = НомерТелефона + "@c.us";
		
	КонецЕсли;
	
	ИдКлиента	 = ИдКлиента;
	ИдСообщения	 = Строка(Новый УникальныйИдентификатор);
	
	Если ЗначениеЗаполнено(ИдКлиента) Тогда
		
		НовыйДиалог					 = РегистрыСведений.Диалоги.СоздатьМенеджерЗаписи();
		НовыйДиалог.ИдДиалога		 = Строка(Новый УникальныйИдентификатор);
		НовыйДиалог.ВнешняяСистема	 = ВнешняяСистема;
		НовыйДиалог.ИдКлиента		 = ИдКлиента;
		НовыйДиалог.Начало			 = Дата(2022, 1, 1);
		НовыйДиалог.Окончание		 = Дата(2022, 1, 1);
		
		НовыйДиалог.Записать();
		
		РегистрыСведений.КонтактыМессенджеров.ЗаписатьИдентификаторМессенджера(
			ИдКлиента,
			Контрагент,
			НомерТелефона,,
			ВнешняяСистема,
			ОбщегоНазначения.ПолучитьЗначениеРеквизита(Контрагент, "Наименование"),,,,
			НовыйДиалог.ИдДиалога
		);
		
		РегистрыСведений.ЖурналСообщений.ДобавитьЗапистьЖурналСообщений(
			ИдКлиента,
			ИдСообщения,,,
			НСтр("ru = 'Создан контакт'"),
			Истина,
			Перечисления.Мессенджеры.whatsapp,
			Ложь,
			ТекущаяДатаСеанса(),
			ВнешняяСистема,,,,,,,,,
			НовыйДиалог.ИдДиалога,
			Истина
		);
		
	КонецЕсли;
	
	ДанныеКонтакта = Новый Структура;
	ДанныеКонтакта.Вставить("ИдКлиента"		, ИдКлиента);
	ДанныеКонтакта.Вставить("ИдСообщения"	, ИдСообщения);
	
	Возврат ДанныеКонтакта;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Процедура, устанавливает видимость поля "КаналПривлеченияЗначение".
//
Процедура УстановитьВидимостьЗначенияКаналаПривлечения(Форма)
	
	Форма.Элементы.КаналПривлеченияЗначение.Видимость = (Форма.Объект.КаналПривлечения = ПредопределенноеЗначение("Справочник.КаналыПривлечения.ЧатСКлиентом"));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает цвет, соответствующий статусу заявки.
//
Функция ПолучитьЦветСтатусаЗаявки(Статус)
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.НеОбработана") Тогда
		Цвет = Новый Цвет(0, 185, 97);
		
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ПропущенныйЗвонок") Тогда
		Цвет = Новый Цвет(253, 176, 81);
		
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ОтвеченныйЗвонок") Тогда
		Цвет = Новый Цвет(163, 212, 155);
		
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ОтвеченныйДиалог") Тогда
		Цвет = Новый Цвет(163, 212, 155);
		
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Перезвонить") Тогда
		Цвет = Новый Цвет(255, 238, 149);
		
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Принята") Тогда
		Цвет = Новый Цвет(47, 182, 68);
		
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Отклонена") Тогда
		Цвет = Новый Цвет(241, 23, 22);
		
	Иначе
		Цвет = Новый Цвет(242, 242, 242);
		
	КонецЕсли;
	
	Возврат Цвет;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает ФИО клиента.
//
Функция ПолучитьФИОКлиента(Клиент)
	
	Возврат ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Клиент, "Имя, Фамилия, Отчество");
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Сделки у клиента существуют
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  ВидыСделок			 - 	 - 
//  Контрагент			 - 	 - 
//  РезультатСделки		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СделкиУКлиентаСуществуют(СтруктурнаяЕдиница = Неопределено
								, ВидыСделок = Неопределено
								, Контрагент
								, РезультатСделки = Неопределено)

	Возврат Справочники.Сделки.НаличиеАктуальныхСделокПоКлиенту(СтруктурнаяЕдиница
																, ВидыСделок
																, Контрагент
																, РезультатСделки);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьИсториюСтатусов(Команда)
	
	Если ПроверитьВидимостьВсплывающихГрупп("ИсторияСтатусов") Тогда				
		УстановитьВидимостьВсплывающихГрупп("ИсторияСтатусов");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция, ПолучитьПолноеФИООбъекта.
//
Функция ПолучитьПолноеФИООбъекта(ОбъектПараметр)
	
	Возврат ОбъектПараметр.Фамилия + 
			?(ЗначениеЗаполнено(ОбъектПараметр.Фамилия), " ", "") + ОбъектПараметр.Имя + 
			?(ЗначениеЗаполнено(ОбъектПараметр.Имя), " ", "") + ОбъектПараметр.Отчество;

КонецФункции

&НаСервере
// Функция, возвращает цвета бизнес процессов.
//
Функция ПолучитьСоответствиеЦветовИСтатусовКлиентов()
	
	СоответствиеЦветовИСтатусовКлиентов = Новый Соответствие();                                                           
	СоответствиеЦветовИСтатусовКлиентов.Вставить(Перечисления.СтатусыКонтрагентов.Потенциальный			, Новый Цвет(3  , 156, 253)); // Голубой
	СоответствиеЦветовИСтатусовКлиентов.Вставить(Перечисления.СтатусыКонтрагентов.Первичный           	, Новый Цвет(0  , 112, 210)); // Синий
	СоответствиеЦветовИСтатусовКлиентов.Вставить(Перечисления.СтатусыКонтрагентов.Постоянный            , Новый Цвет(136, 191, 136)); // Зеленый
	СоответствиеЦветовИСтатусовКлиентов.Вставить(Перечисления.СтатусыКонтрагентов.НеВернувшийся       	, Новый Цвет(152, 59 , 69));  // Бордовый
	СоответствиеЦветовИСтатусовКлиентов.Вставить(Перечисления.СтатусыКонтрагентов.Отказ     			, Новый Цвет(255, 0  , 0));
		
	Возврат СоответствиеЦветовИСтатусовКлиентов;
	
КонецФункции

&НаСервере
// Процедура, обновляет текущего клиента или создает нового.
//
Процедура ОбновитьДанныеКлиента(ТекущийОбъект)
	
	ОбъектКонтрагент = ТекущийОбъект.ОсновнойКлиент.ПолучитьОбъект();
	
	Для Каждого СтрокаТЗ Из ЭтотОбъект.ОбновляемыеДанные Цикл
		
		Если СтрокаТЗ.ОбъектОбновления = "ФИО" Тогда
			
			ОбъектКонтрагент.ДополнительныеСвойства.Вставить("МодифицироватьНаименованиеКонтрагента");
			
			ОбъектКонтрагент.Фамилия  = ЭтотОбъект.Фамилия;
			ОбъектКонтрагент.Имя 	  = ЭтотОбъект.Имя;
			ОбъектКонтрагент.Отчество = ЭтотОбъект.Отчество;	
			
		КонецЕсли;
		
		Если СтрокаТЗ.ОбъектОбновления = "КонтактнаяИнформация" Тогда
			
			// КонтактнаяИнформация
			УправлениеКонтактнойИнформациейСтоматология.ПередЗаписьюНаСервере(ЭтотОбъект, ОбъектКонтрагент);
			// Конец КонтактнаяИнформация
	
			ОбъектКонтрагент.ДополнительныеСвойства.Вставить("КонтактнаяИнформацияПоменялась", Истина);
			// ОбъектКонтрагент.КонтактнаяИнформация.Очистить();
			// ОбъектКонтрагент.КонтактнаяИнформация.Загрузить(ЭтотОбъект.КонтактнаяИнформация.Выгрузить());
			
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка
		ОбъектКонтрагент.Записать();	
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось записать клиента'; en = 'Failed to record client'") + ОписаниеОшибки());		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
// Процедура, проверяет заполнение контактной информации.
//
Процедура ПроверитьЗаполнениеКонтактнойИнформации(Отказ, ДанныеПоля)
	
	Если ДанныеПоля.Поле = "НомерТелефона" Тогда
		ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон;
		
	ИначеЕсли ДанныеПоля.Поле = "АдресЭП" Тогда
		ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		
	КонецЕсли;
	
	КонтактнаяИнформацияЗаполнена = Ложь;
	
	Для Каждого СтрокаКИ Из ЭтотОбъект.КонтактнаяИнформация Цикл
		
		Если СтрокаКИ.Тип = ТипКонтактнойИнформации И ЗначениеЗаполнено(СтрокаКИ.Представление) Тогда
			КонтактнаяИнформацияЗаполнена = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не КонтактнаяИнформацияЗаполнена Тогда
		ТекстСообщения = ДанныеПоля.ПредставлениеПоля + НСтр("ru = ' обязателен для заполнения'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - После запуска приложения
//
// Параметры:
//  ВыбранныйЭлемент - 	 - 
//  Параметры		 - 	 - 
//
Процедура ПослеЗапускаПриложения(ВыбранныйЭлемент, Параметры) Экспорт
	// Процедура заглушка, т.к. НачатьЗапускПриложения требуется наличие обработчика оповещения.
	Возврат;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция - Фильтр применен.
//
// Параметры:
//  СписокФильтрации - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ФильтрПрименен(СписокФильтрации)
	
	Для Каждого Фильтр Из СписокФильтрации Цикл
		Если Фильтр.Пометка = Истина Тогда
			Возврат Истина;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;	
КонецФункции

#Область МеткиКлиента

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ОбработчикРедактированияМеток(Команда)
	
	ОбновитьМетки(Ложь);

КонецПроцедуры
 
&НаКлиенте
// Процедура, обработчик команды подключаемый "ОтображатьМеткуПриНажатии".
//
Процедура Подключаемый_ОтображатьМеткуПриНажатии(Команда)
	
	КнопкаМетки = ТекущийЭлемент;
	ГруппаМетки = КнопкаМетки.Родитель;
	
 	ИндексМетки = Число(СтрЗаменить(КнопкаМетки.Имя, Лев(КнопкаМетки.Имя, Найти(КнопкаМетки.Имя, "_")), ""));
	ДанныеМетки = ЭтотОбъект.ТаблицаМеток.НайтиПоИдентификатору(ИндексМетки);
	
	Если ДанныеМетки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовоеЗначениеАктивности = Не ДанныеМетки.Активна;
	
	ЗаписатьИзменениеМетки(ДанныеМетки.Метка, Объект.ОсновнойКлиент, НовоеЗначениеАктивности);
	
	ДанныеМетки.Активна = НовоеЗначениеАктивности;
	
	КнопкаМетки.ЦветТекста	 = ?(НовоеЗначениеАктивности И ДанныеМетки.ЦветТекстаБелый, Новый Цвет(255, 255, 255), Новый Цвет(77, 77, 77));
	ГруппаМетки.ЦветФона	 = ?(НовоеЗначениеАктивности, ДанныеМетки.ЦветФона, Новый Цвет(255, 255, 255));

КонецПроцедуры

&НаСервере
// Процедура, инициирует обновление меток клиента.
//
Процедура ОбновитьМетки(СоздатьСсылкуРедактирования = Истина)
	
	РегистрыСведений.МеткиКлиентов.СоздатьВизуальныеЭлементыМеток(
		Объект.ОсновнойКлиент,
		ЭтаФорма,
		Элементы.ГруппаМеткиКлиента,
		СоздатьСсылкуРедактирования
	);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, записывает изменение метки в регистр.
//
Процедура ЗаписатьИзменениеМетки(Метка, Клиент, Активна)
	
	НаборЗаписей = РегистрыСведений.МеткиКлиентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Клиент.Установить(Клиент);
	НаборЗаписей.Отбор.Метка.Установить(Метка);
	
	Если Активна = Истина Тогда
		
		НоваяЗапись			 = НаборЗаписей.Добавить();
		НоваяЗапись.Период	 = ТекущаяДатаСеанса();
		НоваяЗапись.Клиент	 = Клиент;
		НоваяЗапись.Метка	 = Метка;
		НоваяЗапись.Активна	 = Активна;
		НоваяЗапись.Автор	 = ПараметрыСеанса.ТекущийПользователь;
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет таблицу меток разрешенными метками и устанавливает значения их активности.
//
Процедура ЗаполнитьТаблицуМеток()
	
	ТаблицаМеток.Очистить();
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Метки.Ссылка КАК Метка,
	|	ВЫБОР
	|		КОГДА МеткиДокументаКлиента.Активна
	|			ТОГДА МеткиДокументаКлиента.Активна
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Активна,
	|	Метки.ЦветМетки КАК ЦветМетки,
	|	Метки.ЦветТекстаБелый КАК ЦветТекстаБелый,
	|	Метки.Наименование КАК ПредставлениеМетки
	|ИЗ
	|	Справочник.Метки КАК Метки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МеткиКлиентов.Метка.Ссылка КАК МеткаСсылка,
	|			МеткиКлиентов.Активна КАК Активна
	|		ИЗ
	|			РегистрСведений.МеткиКлиентов КАК МеткиКлиентов
	|		ГДЕ
	|			МеткиКлиентов.Клиент = &Ссылка
	|			И МеткиКлиентов.Активна) КАК МеткиДокументаКлиента
	|		ПО Метки.Ссылка = МеткиДокументаКлиента.МеткаСсылка.Ссылка
	|ГДЕ
	|	Метки.ИспользоватьДляПациентов
	|
	|СГРУППИРОВАТЬ ПО
	|	Метки.Ссылка,
	|	ВЫБОР
	|		КОГДА МеткиДокументаКлиента.Активна
	|			ТОГДА МеткиДокументаКлиента.Активна
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Метки.Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ОсновнойКлиент);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Метка Из Результат Цикл
		
		СтрокаТаблицы = ТаблицаМеток.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Метка);
		
		Если ЗначениеЗаполнено(Метка.ЦветМетки) Тогда
			
			ЦветМетки = ЗначениеИзСтрокиВнутр(Метка.ЦветМетки);
			
			Если ЦветМетки.Вид = ВидЦвета.АвтоЦвет Или (ЦветМетки.Красный = 255 И ЦветМетки.Зеленый = 255 И ЦветМетки.Синий = 255) Тогда
				ЦветФона = Новый Цвет(242, 242, 242);
			Иначе
				ЦветФона = ЦветМетки;
			КонецЕсли;
			
		Иначе
			ЦветФона = Новый Цвет(242, 242, 242);
			
		КонецЕсли;
		
		СтрокаТаблицы.ЦветФона = ЦветФона;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
