
#Область ОбработчикиСобытий

// Процедура, обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	// установить ответственного по умолчанию
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
		Сотрудник = ПараметрыСеанса.ТекущийПользователь.Сотрудник;
	КонецЕсли;

	// установить дату создания
	Если НЕ ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДата();
	КонецЕсли;

КонецПроцедуры

// Процедура, обработчик события "ПриЗаписи".
//
Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;

	Если СпособФормирования = Перечисления.СпособыФормированияСегментов.ПериодическиОбновлять
			И Сегменты.ПолучитьПризнакЗаполненностиНастроек(Ссылка) = Истина Тогда 
		Сегменты.Сформировать(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

// Процедура, обработчик события "ПередУдалением".
//
Процедура ПередУдалением(Отказ)

	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Сегменты.Очистить(Ссылка);

КонецПроцедуры

#КонецОбласти
