///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Получает наименования видов контактной информации на разных языках.
//
// Параметры:
//  Наименования - Соответствие - представление вида контактной информации на переданном языке:
//     * Ключ     - Строка - Имя вида контактной информации. Например, "_ДемоАдресПартнера".
//     * Значение - Строка - Наименование вида контактной информации для переданного кода языка.
//  КодЯзыка - Строка - Код языка. Например, "en".
//
// Пример:
//  Наименования["_ДемоАдресПартнера"] = НСтр("ru='Адрес'; en='Address';", КодЯзыка);
//
Процедура ПриПолученииНаименованийВидовКонтактнойИнформации(Наименования, КодЯзыка) Экспорт
	
	//// Контактная информация справочника "Клиенты"
	//Наименования["АдресКлиента"]   							= НСтр("ru = 'Адрес'", КодЯзыка);
	//Наименования["ТелефонКлиента"] 							= НСтр("ru = 'Телефон клиента'", КодЯзыка);
	//Наименования["ТелефонКлиентаДополнительный"] 			= НСтр("ru = 'Телефон клиента (дополнительный)'", КодЯзыка);	
	//Наименования["EmailКлиента"]   							= НСтр("ru = 'Электронная почта клиента'", КодЯзыка);
	//Наименования["СоциальнаяСетьКлиента"] 					= НСтр("ru = 'Социальная сеть'", КодЯзыка);
	//Наименования["SkypeКлиента"] 							= НСтр("ru = 'Skype'", КодЯзыка);
	//
	//// Контактная информация справочника "Контрагенты"
	//Наименования["ПочтовыйАдресКонтрагента"] 				= НСтр("ru = 'Почтовый адрес'", КодЯзыка);
	//Наименования["ФактАдресКонтрагента"] 					= НСтр("ru = 'Фактический адрес'", КодЯзыка);
	//Наименования["ЮрАдресКонтрагента"] 						= НСтр("ru = 'Юридический адрес'", КодЯзыка);	
	//Наименования["ТелефонКонтрагента"] 						= НСтр("ru = 'Телефон'", КодЯзыка);
	//Наименования["ФаксКонтрагента"] 						= НСтр("ru = 'Факс'", КодЯзыка);	
	//Наименования["EmailКонтрагента"] 						= НСтр("ru = 'Электронная почта'", КодЯзыка);
	//	
	//// Контактная информация справочника "Организации"
	//Наименования["ЮрАдресОрганизации"]   					= НСтр("ru = 'Юридический адрес'", КодЯзыка);
	//Наименования["ФактАдресОрганизации"]   					= НСтр("ru = 'Фактический адрес'", КодЯзыка);
	//Наименования["ПочтовыйАдресОрганизации"]      			= НСтр("ru = 'Почтовый адрес'", КодЯзыка);
	//Наименования["ТелефонОрганизации"]            			= НСтр("ru = 'Телефон'", КодЯзыка);
	//Наименования["ФаксОрганизации"]               			= НСтр("ru = 'Факс'", КодЯзыка);
	//Наименования["EmailОрганизации"]              			= НСтр("ru = 'Электронная почта'", КодЯзыка);
	//
	//// Контактная информация справочника "Структутрные единицы"
	//Наименования["ФактАдресСтруктурнойЕдиницы"]   			= НСтр("ru = 'Фактический адрес'", КодЯзыка);
	//Наименования["ТелефонСтруктурнойЕдиницы"]            	= НСтр("ru = 'Телефон'", КодЯзыка);
	//Наименования["EmailСтруктурнойЕдиницы"]              	= НСтр("ru = 'Электронная почта'", КодЯзыка);
	//
	//// Контактная информация справочника "Сотрудники"
	//Наименования["АдресПользователя"]   					= НСтр("ru = 'Адрес по прописке'", КодЯзыка);
	//Наименования["ТелефонПользователя"] 					= НСтр("ru = 'Телефон сотрудника'", КодЯзыка);
	//Наименования["EmailПользователя"]   					= НСтр("ru = 'Электронная почта сотрудника'", КодЯзыка);
	//Наименования["SkypeПользователя"] 						= НСтр("ru = 'Skype'", КодЯзыка);
	
КонецПроцедуры

#КонецОбласти
