
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.Контрагент = ?(Параметры.Отбор.Свойство("МассивКлиентов"), ?(Параметры.Отбор.МассивКлиентов.Количество() > 0, Параметры.Отбор.МассивКлиентов[0], Неопределено), Неопределено);
	
	МассивСтруктурныхЕдиниц = Справочники.Сотрудники.ПолучитьМестаРаботыСотрудника(ПараметрыСеанса.ТекущийСотрудник, "Массив");
	ДатаРегистрации = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект.Контрагент, "ДатаРегистрации");
	ДатаНачала = ?(ЗначениеЗаполнено(ЭтотОбъект.Контрагент) И ЗначениеЗаполнено(ДатаРегистрации), ДатаРегистрации, Дата(1,1,1));
	Список.Параметры.УстановитьЗначениеПараметра("ПериодОтбораДатаНачала" 	, ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ПериодОтбораДатаОкончания", ТекущаяДатаСеанса());
	
	Если Не ЗначениеЗаполнено(МассивСтруктурныхЕдиниц) Тогда		
		МассивСтруктурныхЕдиниц.Добавить(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);			
	КонецЕсли;
	
	ЭтотОбъект.ОтборСтруктурныеЕдиницы = Новый ФиксированныйМассив(МассивСтруктурныхЕдиниц);	
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Инициализируем настройки при первом открытии формы
	Если ХранилищеСистемныхНастроек.Загрузить("Задача.Взаимодействие.Форма.ФормаСпискаПерейти/ТекущиеДанные") = Неопределено Тогда
		Настройки = Новый Соответствие;
		ХранилищеСистемныхНастроек.Сохранить("Задача.Взаимодействие.Форма.ФормаСпискаПерейти/ТекущиеДанные", ,Настройки);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	ЭтоКорп = ОбщегоНазначенияПовтИсп.ЭтоВерсияКОРП();
	
КонецПроцедуры

&НаСервере
// Процедура - При загрузке данных из настроек на сервере
//
// Параметры:
//  Настройки	 - 	 - 
//
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ИнициализироватьМеханизмФильтрацииДанных(Параметры.Отбор, Истина);
	СоздатьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаОповещения".
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОБНОВИТЬ_ОТБОРЫ_СПИСКА_ВЗАИМОДЕЙСТВИЙ" Тогда 
	КонецЕсли;
	
	Если ИмяСобытия = "ИзменениеЗадачи" Тогда		

	ИначеЕсли ИмяСобытия = "ОбновлениеМонитораЗадач" Тогда
		ПолучитьЗначенияОтборов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Процедура, обработчик события "СписокВыбор".
//
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока 		 = Элементы.Список.ТекущиеДанные;
	
	Если Поле.Имя = "Сделка"
		И ЗначениеЗаполнено(ТекущаяСтрока.Сделка) Тогда
		
		ПоказатьЗначение(,ТекущаяСтрока.Сделка);
		
	ИначеЕсли Поле.Имя = "Контрагент" 
		И ЗначениеЗаполнено(ТекущаяСтрока.Контрагент)Тогда
		
		ПоказатьЗначение(,ТекущаяСтрока.Контрагент);
		
	Иначе
		
		ПоказатьЗначение(,ТекущаяСтрока.Ссылка);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Список перед началом добавления
//
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Контрагент) Тогда 
		
		ОткрытьФорму("Задача.Взаимодействие.Форма.ФормаЗадачи", Новый Структура("ЗначенияЗаполнения", Новый Структура("Контрагент", ЭтотОбъект.Контрагент)), ЭтаФорма);
		Отказ = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора".
//
Процедура ДействиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УстановитьВидмостьВсплывающейГруппы(ВыбранноеЗначение);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ТаблицаДействияПроцентПриИзменении(Элемент)
	
	СуммаПроцентов   = ЭтотОбъект.ТаблицаДействия.Итог("Пропорция");
	ОстатокПроцентов = 100 - СуммаПроцентов;
	
	Если ОстатокПроцентов = 0 Тогда
		
		Элементы.ОстаточныйПроцент.Видимость = НЕ Элементы.ОстаточныйПроцент.Видимость;
		
	Иначе
		
		ЭтотОбъект.ОстаточныйПроцентОтДеления = ОстатокПроцентов;
		Элементы.ОстаточныйПроцент.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ТаблицаДействияСотрудникПриИзменении(Элемент)
	
	ЗаполнитьПроцентомСтрокиТЗ();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Создать
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Создать(Команда)
	
	ОткрытьФорму("Задача.Взаимодействие.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", Новый Структура("Контрагент", ?(Этаформа.ВладелецФормы.Параметры.Свойство("Ключ"), Этаформа.ВладелецФормы.Параметры.Ключ, Неопределено))));	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события команды "Изменить".
//
Процедура Изменить(Команда)
	
	ЭтотОбъект.Действие = "Исполнитель";	
	УстановитьВидмостьВсплывающейГруппы(ЭтотОбъект.Действие);
	
	ВыделенныеЭлементы = Элементы.Список.ВыделенныеСтроки.Количество();
	Если ВыделенныеЭлементы > 1 Тогда
		Элементы.Применить.Заголовок = Нстр("ru = 'Применить к '; en = 'Apply to '") + ВыделенныеЭлементы; 
	Иначе
		Элементы.Применить.Заголовок = Нстр("ru = 'Применить к '; en = 'Apply to '") + ЭтотОбъект.КоличествоЗадач;	
	КонецЕсли;
	
	Элементы.ГруппаИзменитьВсплывающая.Показать();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ДействияДобавить".
//
Процедура ДействияДобавить(Команда)
	
	НоваяСтрока = ЭтотОбъект.ТаблицаДействия.Добавить();	
	Элементы.ТаблицаДействия.ТекущаяСтрока = ЭтотОбъект.ТаблицаДействия.Индекс(НоваяСтрока);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ДействияУдалить".
//
Процедура ДействияУдалить(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаДействия.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		ЭтотОбъект.ТаблицаДействия.Удалить(ТекущиеДанные);
		ЗаполнитьПроцентомСтрокиТЗ();

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события команды "Применить".
//
Процедура Применить(Команда)
	
	ВопросОбИзменении()	
		
КонецПроцедуры

&НаКлиенте
// Процедура, ВопросОИзменении.
//
Процедура ВопросОбИзменении()
	
	ВыделенныеЭлементы = Элементы.Список.ВыделенныеСтроки.Количество();
	Если ВыделенныеЭлементы > 1 Тогда
		Вопрос = СтрШаблон(НСтр("ru='Внимание!!! Изменения будут применены ко всем %1 выделенным строкам в списке. Эти изменения необратимы. Продолжить?';en='Attention!!! Changes will be applied to to all %1 selected lines in list. These changes are irreversible. Continue?'"), ВыделенныеЭлементы);
	Иначе
		Вопрос = СтрШаблон(НСтр("ru = 'Внимание!!! Изменения будут применены ко всем %1 видимым строкам в списке (даже не выделенным). Эти изменения необратимы. Продолжить?'; en = 'text %1 text'"), ЭтотОбъект.КоличествоЗадач);
	КонецЕсли;

	
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбИзменении", ЭтотОбъект, Новый Структура("КоличествоВыделенныхСтрок", ВыделенныеЭлементы)); 
	ПоказатьВопрос(Оповещение,
	Вопрос,
	РежимДиалогаВопрос.ДаНет,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	НСтр("ru = 'Вопрос пользователю'; en = 'Question to user'") // (необ.) заголовок
	); 	
	
КонецПроцедуры

&НаКлиенте
// Процедура, ПослеВопросаОбИзменении.
//
Процедура ПослеВопросаОбИзменении(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ПрименитьНаСервере(ДопПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновитьДинамическоеМеню

&НаСервере
// Процедура - Инициализировать механизм фильтрации данных
//
// Параметры:
//  ПараметрыОтбора	 - 	 - 
//  ОбновитьСписок	 - 	 - 
//
Процедура ИнициализироватьМеханизмФильтрацииДанных(ПараметрыОтбора = Неопределено, ОбновитьСписок = Ложь)
	
	// Обновляем отборы согласно параметров, переданных из другой формы	и уходим	
 	Если ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("ОчиститьВсеОтборы") И ПараметрыОтбора.ОчиститьВсеОтборы = Истина Тогда
		ОбновитьЗначенияФильтрацииДанных(ПараметрыОтбора); // Перешли из монитора при уже открытой текущей формы
		Возврат;
	КонецЕсли; 
	
	МассивКлиентов = Новый Массив;
	Если ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивКлиентов") Тогда
	   МассивКлиентов = ПараметрыОтбора.МассивКлиентов; 
	КонецЕсли;
		
	РезультатПакетногоЗапроса = ПолучитьПакетЗапросаЗначенийДляОтборов();	
	
	// Отбор статус. 
 	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтатусовЗадач");	
	ОбновитьДинамическоеМенюФильтрации_Статус(, УстановитьОтбор);
	Если УстановитьОтбор Тогда 	
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Статус", ПараметрыОтбора.МассивСтатусовЗадач, Истина);
	КонецЕсли;
		
	// Отбор вид взаимодействия. 
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивВидовВзаимодействия");
	ОбновитьДинамическоеМенюФильтрации_ВидВзаимодействия(РезультатПакетногоЗапроса[2].Выгрузить(), Истина);
	Если УстановитьОтбор Тогда 
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ВидВзаимодействия", ПараметрыОтбора.МассивВидовВзаимодействия, Истина);		
	КонецЕсли;
	
	Если ЭтоКорп Тогда
		// Отбор Вид сделки. 
		УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивВидовСделок");
		ОбновитьДинамическоеМенюФильтрации_ВидСделки(РезультатПакетногоЗапроса[3].Выгрузить(), УстановитьОтбор);
		Если УстановитьОтбор Тогда 		
			УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ВидСделки", ПараметрыОтбора.МассивВидовСделок, Истина);
			ОбновитьСписок = Истина;		
		КонецЕсли;
		
		// Отбор этап. 
		УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивЭтапов");
		ОбновитьДинамическоеМенюФильтрации_Этап(РезультатПакетногоЗапроса[0].Выгрузить(), УстановитьОтбор);
		Если УстановитьОтбор Тогда 		
			УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Этап", ПараметрыОтбора.МассивЭтапов, Истина);
			ОбновитьСписок = Истина;		
		КонецЕсли;
	КонецЕсли;
	
	// Отбор контрагент. 
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивКлиентов");
	ОбновитьДинамическоеМенюФильтрации_Контрагент(, УстановитьОтбор);
	Если УстановитьОтбор Тогда 		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Контрагент", ПараметрыОтбора.МассивКлиентов, Ложь);
		ОбновитьСписок = Истина;		
	КонецЕсли;
	
	// Отбор структурная единица.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтруктурныхЕдиниц");
	Если УстановитьОтбор И НЕ ЗначениеЗаполнено(ПараметрыОтбора.МассивСтруктурныхЕдиниц) Тогда	
		ОбновитьДинамическоеМенюФильтрации_СтруктурнаяЕдиница(РезультатПакетногоЗапроса[6].Выгрузить(), УстановитьОтбор);
	Иначе 
		ОбновитьДинамическоеМенюФильтрации_СтруктурнаяЕдиница(РезультатПакетногоЗапроса[5].Выгрузить(), УстановитьОтбор);
	КонецЕсли;	
	Если УстановитьОтбор Тогда 	
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтруктурнаяЕдиница", ПараметрыОтбора.МассивСтруктурныхЕдиниц, Истина);
	КонецЕсли;
	
	Если ЭтоКорп Тогда
		// Отбор признак наличия сделки. 
		УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтатусовНаличияСделок");
		ОбновитьДинамическоеМенюФильтрации_Сделка(,УстановитьОтбор);
		Если УстановитьОтбор Тогда 
			
			МассивСтатусовНаличияСделок = Новый Массив();
			Если ЗначениеЗаполнено(ПараметрыОтбора.МассивСтатусовНаличияСделок) 
				И ПараметрыОтбора.МассивСтатусовНаличияСделок[0] = Нстр("ru = 'Нет сделок'; en = 'No deals'") Тогда
				
				МассивСтатусовНаличияСделок.Добавить(Ложь);
			Иначе
				МассивСтатусовНаличияСделок.Добавить(Истина);		
			КонецЕсли;
			
			УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Сделка", МассивСтатусовНаличияСделок, Истина);
			ОбновитьСписок = Истина;
		КонецЕсли;
	КонецЕсли;

	// Отбор пометка удаления задачи.
	УстановитьОтбор = Ложь;// Истина; 
	ОбновитьДинамическоеМенюФильтрации_ПометкаУдаленияЗадачи(, УстановитьОтбор);
	Если УстановитьОтбор Тогда
		СписокСтатусовПометокУдаления = Новый СписокЗначений;
		СписокСтатусовПометокУдаления.Добавить(Истина, , Ложь);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПометкаУдаленияЗадачи", СписокСтатусовПометокУдаления, Истина);		
		ОбновитьСписок = Истина;		
	КонецЕсли;
	
	// Отбор исполнитель. 
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивИсполнителей"); // Перешли из монитора, открывая форму
	ОбновитьДинамическоеМенюФильтрации_Исполнитель(РезультатПакетногоЗапроса[1].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда 		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Исполнитель", ПараметрыОтбора.МассивИсполнителей, Истина, НСтр("ru = '<не указан>'; en = '<not specified>'"));
		ОбновитьСписок = Истина;
	КонецЕсли;
	
	// Отбор кто выполнил.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивКтоВыполнил"); // Перешли из монитора, открывая форму
	ОбновитьДинамическоеМенюФильтрации_КтоВыполнил(РезультатПакетногоЗапроса[1].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда 		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_КтоВыполнил", ПараметрыОтбора.МассивКтоВыполнил, Истина, НСтр("ru = '<не указан>'; en = '<not specified>'"));
		ОбновитьСписок = Истина;
	КонецЕсли;
	
	// Отбор пеориод тип.
	Если ПараметрыОтбора <> Неопределено И ТипЗнч(ПараметрыОтбора) = Тип("Структура") И (ПараметрыОтбора.Свойство("ОтборПериодТип") И ПараметрыОтбора.Свойство("ОтборПериодЗначение") ИЛИ ПараметрыОтбора.Свойство("МассивСтатусовЗадач")) Тогда 
		Если УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Статус").НайтиПоЗначению("Просрочена") <> Неопределено Тогда 
			ПериодОтбора.ДатаНачала    	= Дата(01, 01, 0001);
			ПериодОтбора.ДатаОкончания 	= НачалоДня(ТекущаяДатаСеанса()) - 1;
			ВыбранныйПериод 			= 4;
			УстановитьСвойстваОтображенияЭлементов();
		ИначеЕсли ПараметрыОтбора.Свойство("ОтборПериодТип") И ПараметрыОтбора.Свойство("ОтборПериодЗначение") Тогда 
			Если ПараметрыОтбора.ОтборПериодТип = Перечисления.Периодичность.День Тогда 
				ВыбранныйПериод 		= 0;
				ПериодОтбора 			= ПараметрыОтбора.ОтборПериодЗначение;
				ПериодОтбора.Вариант 	= ПараметрыОтбора.ОтборПериодЗначение.Вариант;				
			ИначеЕсли ПараметрыОтбора.ОтборПериодТип = Перечисления.Периодичность.Неделя Тогда
				ВыбранныйПериод 		= 2;
				ПериодОтбора 			= ПараметрыОтбора.ОтборПериодЗначение;				
				ПериодОтбора.Вариант 	= ПараметрыОтбора.ОтборПериодЗначение.Вариант;								
			ИначеЕсли ПараметрыОтбора.ОтборПериодТип = Перечисления.Периодичность.Месяц Тогда
				ВыбранныйПериод 		= 3;
				ПериодОтбора 			= ПараметрыОтбора.ОтборПериодЗначение;
				ПериодОтбора.Вариант 	= ПараметрыОтбора.ОтборПериодЗначение.Вариант;								
			ИначеЕсли ПараметрыОтбора.ОтборПериодТип = Перечисления.Периодичность.Час Тогда
				ВыбранныйПериод 		= 4;
				ПериодОтбора 			= ПараметрыОтбора.ОтборПериодЗначение;				
			КонецЕсли;
		КонецЕсли;
		ОбновитьСписок = Истина;
		УстановитьСвойстваОтображенияЭлементов();		
	КонецЕсли;
	
	Если ОбновитьСписок Тогда 
		АктуализироватьДанныеСпискаСогласноОтборов();	
	КонецЕсли; 	
	
КонецПроцедуры   

&НаСервере
// Процедура - Обновить значения фильтрации данных.
//
// Параметры:
//  ПараметрыОтбора				 - 	 - 
//  ОчиститьВсеФильтры			 - 	 - 
//  МассивИменОчищаемыхФильтров	 - 	 - 
//
Процедура ОбновитьЗначенияФильтрацииДанных(ПараметрыОтбора, ОчиститьВсеФильтры = Истина, МассивИменОчищаемыхФильтров = Неопределено)
	
	Если ОчиститьВсеФильтры Тогда 
		МассивИменОчищаемыхФильтров = Новый Массив();
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Статус");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ВидВзаимодействия");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Контрагент");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_СтатусКлиента");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ВидСделки");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ВидСделки");		
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Этап");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_СотрудникРегистрации");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_РекламныйИсточник");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Исполнитель");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_КтоВыполнил"); 
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Сделка"); 
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_КаналПривлечения");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПризнакВыполненияСделки");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПометкаУдаленияЗадачи");		
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_СозданаПериод");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ЗавершенаПериод"); 
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПериодЗапланированнойЗадачи");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_СтруктурнаяЕдиница");
	КонецЕсли;

	Если ЗначениеЗаполнено(МассивИменОчищаемыхФильтров) Тогда 
		УправлениеИнтерфейсамиСервер.ДеактивироватьВсеЗначенияФильтрацииДанных(ЭтаФорма, МассивИменОчищаемыхФильтров);
	КонецЕсли;
	
	СписокСтатусовПометокУдаления = Новый СписокЗначений;
	СписокСтатусовПометокУдаления.Добавить(Истина, , Ложь);
	УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПометкаУдаленияЗадачи", СписокСтатусовПометокУдаления, Истина);		
	
	// Отбор СЕ.
	Если ПараметрыОтбора.Свойство("МассивСтруктурныхЕдиниц") Тогда 	
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтруктурнаяЕдиница", ПараметрыОтбора.МассивСтруктурныхЕдиниц);		
	КонецЕсли;
	
	// Отбор статус.
	Если ПараметрыОтбора.Свойство("МассивСтатусовЗадач") Тогда 	
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Статус", ПараметрыОтбора.МассивСтатусовЗадач);		
	КонецЕсли;
	
	// Отбор Вид сделки. 
	Если ПараметрыОтбора.Свойство("МассивВидовСделок") Тогда 		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ВидСделки", ПараметрыОтбора.МассивВидовСделок);
	КонецЕсли;
	
	// Отбор этапы.
	Если ПараметрыОтбора.Свойство("МассивЭтапов") Тогда 		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Этап", ПараметрыОтбора.МассивЭтапов);		
	КонецЕсли;	
	
	//// Отбор статус клиента
	//Если ПараметрыОтбора.Свойство("МассивСтатусовКлиентов") Тогда 	
	//	УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтатусКлиента", ПараметрыОтбора.МассивСтатусовКлиентов);
	//КонецЕсли;
	
	// Отбор признак наличия задач.
	Если ПараметрыОтбора.Свойство("МассивСтатусовНаличияЗадач") Тогда 
		
		МассивСтатусовНаличияЗадач = Новый Массив();
		Если ЗначениеЗаполнено(ПараметрыОтбора.МассивСтатусовНаличияЗадач) 
			И ПараметрыОтбора.МассивСтатусовНаличияЗадач[0] = Нстр("ru = 'Нет задач'; en = 'No tasks'") Тогда
			
			МассивСтатусовНаличияЗадач.Добавить(Ложь);
		Иначе
			МассивСтатусовНаличияЗадач.Добавить(Истина);		
		КонецЕсли;
		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Задача", МассивСтатусовНаличияЗадач);
		ОбновитьСписок = Истина;
	КонецЕсли;
	
	// Отбор статусов сделки.
	Если ПараметрыОтбора.Свойство("МассивСтатусовСделок") Тогда
		
		МассивСтатусовСделок = Новый Массив();
		Если ЗначениеЗаполнено(ПараметрыОтбора.МассивСтатусовСделок) 
			И ПараметрыОтбора.МассивСтатусовСделок[0] = "Нет" Тогда
			
			МассивСтатусовСделок.Добавить(Ложь);
		Иначе
			МассивСтатусовСделок.Добавить(Истина);		
		КонецЕсли;
		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПризнакВыполненияСделки", МассивСтатусовСделок);
		
	КонецЕсли;
	
	// Отбор менеджеров.
	Если ПараметрыОтбора.Свойство("МассивИсполнителей") Тогда 		
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Исполнитель", ПараметрыОтбора.МассивИсполнителей);
	КонецЕсли;	
	
	Если ПараметрыОтбора <> Неопределено И ТипЗнч(ПараметрыОтбора) = Тип("Структура") И (ПараметрыОтбора.Свойство("ОтборПериодТип") ИЛИ ПараметрыОтбора.Свойство("МассивСтатусовЗадач")) Тогда 
		Если УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Статус").НайтиПоЗначению("Просрочена") <> Неопределено Тогда 
			Если ЭтаФорма.РежимОтображенияФормы = 1 Тогда
				РежимОтображенияФормы 		= 0;
				ПериодОтбора.ДатаНачала    	= Дата(01, 01, 0001);
				ПериодОтбора.ДатаОкончания 	= НачалоДня(ТекущаяДатаСеанса()) - 1;
				ВыбранныйПериод 			= 4;
				УстановтьРежимОтображения(Ложь);
			Иначе 	
				ПериодОтбора.ДатаНачала    	= Дата(01, 01, 0001);
				ПериодОтбора.ДатаОкончания 	= НачалоДня(ТекущаяДатаСеанса()) - 1;
				ВыбранныйПериод 			= 4;
			КонецЕсли;
			УстановитьСвойстваОтображенияЭлементов();
		ИначеЕсли ПараметрыОтбора.Свойство("ОтборПериодТип") И ПараметрыОтбора.Свойство("ОтборПериодЗначение") Тогда 
			Если ПараметрыОтбора.ОтборПериодТип = Перечисления.Периодичность.День Тогда 
				ВыбранныйПериод = 0;
				ПериодОтбора = ПараметрыОтбора.ОтборПериодЗначение;								
			ИначеЕсли ПараметрыОтбора.ОтборПериодТип = Перечисления.Периодичность.Неделя Тогда
				ВыбранныйПериод = 2;
				ПериодОтбора = ПараметрыОтбора.ОтборПериодЗначение;								
			ИначеЕсли ПараметрыОтбора.ОтборПериодТип = Перечисления.Периодичность.Месяц Тогда
				ВыбранныйПериод = 3;
				ПериодОтбора = ПараметрыОтбора.ОтборПериодЗначение;								
			ИначеЕсли ПараметрыОтбора.ОтборПериодТип = Перечисления.Периодичность.Час Тогда
				ВыбранныйПериод = 4;
				ПериодОтбора = ПараметрыОтбора.ОтборПериодЗначение;
			КонецЕсли;
		КонецЕсли;
		ОбновитьСписок = Истина;		
		УстановитьСвойстваОтображенияЭлементов();		
	КонецЕсли;
	
	АктуализироватьДанныеСпискаСогласноОтборов();
	
КонецПроцедуры  

&НаСервере
// Процедура, УстановтьРежимОтображения.
//
Процедура УстановтьРежимОтображения(ОбновитьДанные = Истина)
	
	Если ЭтаФорма.РежимОтображенияФормы = 0 Тогда
		
		Элементы.ГруппаСписок.Видимость 		 	   = Истина;
		Элементы.СтраницаПланировщик.Видимость 	 	   = Ложь;   
		Элементы.ГруппаКоманднаяПанель.Видимость 	   = Истина;
		ОбновитьДанныеДляОтображения(Ложь,,,, ОбновитьДанные);
		
	ИначеЕсли ЭтаФорма.РежимОтображенияФормы = 1 Тогда
		
		Элементы.ГруппаСписок.Видимость 			   = Ложь;
		Элементы.СтраницаПланировщик.Видимость 		   = Истина;
		Элементы.ГруппаКоманднаяПанель.Видимость 	   = Ложь;
		СписокОтборСтатус = УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Статус");
		СтатусПросрочена = СписокОтборСтатус.НайтиПоЗначению("Просрочена");
		Если СтатусПросрочена <> Неопределено Тогда 
			СписокОтборСтатус.Удалить(СтатусПросрочена);
			УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Статус", СписокОтборСтатус);		
		КонецЕсли;	
		ОбновитьДанныеДляОтображения(Истина,,, ОбновитьДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр статус.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Статус(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию	
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра	
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru= 'Статус'; en='Status'"));	
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Статус");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Статус");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Статус");	
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Статус");	
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Статус");	
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("Строка"));  
	
	// Формируем коллекцию сами
	КоллекцияЗначений = Новый ТаблицаЗначений;
	КоллекцияЗначений.Колонки.Добавить("Ссылка"			, Новый ОписаниеТипов("Строка"));
	КоллекцияЗначений.Колонки.Добавить("Представление"	, Новый ОписаниеТипов("Строка"));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", "Выполнена"		, Нстр("ru = 'Выполнена'; en = 'Completed'")));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", "Не выполнена"	, Нстр("ru = 'Не выполнена'; en = 'Not completed'")));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", "Просрочена"	, Нстр("ru = 'Просрочена'; en = 'Expired'")));
		
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)	
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра	
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																														
	
КонецПроцедуры

&НаСервере
// Процедура, актуализировать данные списка согласно отборов.
//
Процедура АктуализироватьДанныеСпискаСогласноОтборов()
	
	СтруктураОтборов 				= ПолучитьСтруктуруЗначенийОтбора();
	ЗапросДляДинамическогоСписка 	= ПолучитьЗапросДляДинамическогоСписка(СтруктураОтборов);
	
	// Цепляем наш запрос динамическому списку
	Список.ТекстЗапроса = ЗапросДляДинамическогоСписка.Текст;
	
	// Устанавливаем параметры динамическому списку
	Для Каждого ПараметрЗапроса Из ЗапросДляДинамическогоСписка.Параметры Цикл 
		Список.Параметры.УстановитьЗначениеПараметра(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);		
	КонецЦикла;
	
КонецПроцедуры  

&НаСервере
// Функция, возвращает запрос с установленными параметрами, для списка формы.
//
Функция ПолучитьЗапросДляДинамическогоСписка(ЗНАЧ СтруктураОтборов)
	
	// текст запроса без отборов (чистый)
	Запрос = Новый Запрос(	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка КАК Исполнитель
	|ПОМЕСТИТЬ ТаблицаИсполнителей
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	&УсловиеСотрудники
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СотрудникиСегмента.Сегмент
	|ИЗ
	|	РегистрСведений.СотрудникиСегмента КАК СотрудникиСегмента
	|ГДЕ
	|	&УсловиеСегментСотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Взаимодействие.ВидВзаимодействияСправочник.ИндексКартинки КАК ИндексКартинкиВзаимодействия,
	|	Взаимодействие.Ссылка КАК Ссылка,
	|	Взаимодействие.Выполнена КАК Выполнена,
	|	Взаимодействие.ДатаИсполнения КАК ДатаРаботы,
	|	НАЧАЛОПЕРИОДА(Взаимодействие.ДатаИсполнения, ДЕНЬ) = Взаимодействие.ДатаИсполнения КАК ПустоеВремяДатаРаботы,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодВыполнения,
	|	ЗНАЧЕНИЕ(Перечисление.Периодичность.Час) КАК Периодичность,
	|	Взаимодействие.ЗадачаНазначеннаяДата КАК ЗадачаНазначеннаяДата,
	|	Взаимодействие.КоличествоПереносов КАК КоличествоПереносов,
	|	Взаимодействие.ВидВзаимодействияСправочник КАК ВидВзаимодействия,
	|	ВЫБОР
	|		КОГДА Взаимодействие.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(Взаимодействие.ЗадачаПредмет КАК Справочник.Заявки)
	|		ИНАЧЕ Взаимодействие.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ЕСТЬNULL(КонтрагентыСведенияДляСписка.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)) КАК СтатусКонтрагента,
	|	Взаимодействие.Сделка КАК Сделка,
	|	ВЫБОР
	|		КОГДА Взаимодействие.Сделка = ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыСделок.ПустаяСсылка)
	|		ИНАЧЕ Взаимодействие.Сделка.ВидСделки
	|	КОНЕЦ КАК ВидСделки,
	|	ВЫБОР
	|		КОГДА Взаимодействие.Сделка = ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.ПустаяСсылка)
	|		ИНАЧЕ Взаимодействие.Сделка.ЭтапСделки
	|	КОНЕЦ КАК СделкаЭтапСделки,
	|	Взаимодействие.ЗадачаТема КАК ЗадачаТема,
	|	Взаимодействие.ТриггерноеСобытие КАК ТриггерноеСобытие,
	|	Взаимодействие.ЗадачаОписание КАК ЗадачаОписание,
	|	Взаимодействие.ДатаИсполнения КАК ДатаИсполнения,
	|	Взаимодействие.ЗадачаПредмет КАК ЗадачаПредмет,
	|	Взаимодействие.ИсполнительФактический КАК ИсполнительФактический,
	|	Взаимодействие.Исполнитель КАК Исполнитель,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Взаимодействие.Сделка КАК Справочник.Сделки).ЭтапСделки.ЦветЭтапа КАК СТРОКА(150)) КАК ЦветЭтапа,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(Взаимодействие.ЗадачаНазначеннаяДата, ДЕНЬ), Взаимодействие.ЗадачаНазначеннаяДата, МИНУТА) > 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПустоеВремя,
	|	"""" КАК Просрочена
	|ИЗ
	|	Задача.Взаимодействие КАК Взаимодействие
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтрагентыСведенияДляСписка КАК КонтрагентыСведенияДляСписка
	|		ПО Взаимодействие.Контрагент = КонтрагентыСведенияДляСписка.Контрагент
	|ГДЕ
	|	&УсловиеПометкаУдаления
	|	И Взаимодействие.Выполнена = ИСТИНА
	|	И Взаимодействие.ДатаИсполнения МЕЖДУ &ПериодОтбораДатаНачала И &ПериодОтбораДатаОкончания
	|	И &УсловиеВидВзаимодействия
	|	И &УсловиеКонтрагент
	|	И &УсловиеСделки
	|	И &УсловиеВидСделки
	|	И &УсловиеЭтап
	|	И &УсловиеИсполнительФактический
	|	И Взаимодействие.Исполнитель В
	|			(ВЫБРАТЬ
	|				ТаблицаИсполнителей.Исполнитель
	|			ИЗ
	|				ТаблицаИсполнителей КАК ТаблицаИсполнителей)
	|	И &УсловиеСтатус
	|	И &УсловиеСтруктурнаяЕдиница
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Взаимодействие.ВидВзаимодействияСправочник.ИндексКартинки,
	|	Взаимодействие.Ссылка,
	|	Взаимодействие.Выполнена,
	|	Взаимодействие.ЗадачаНазначеннаяДата,
	|	НАЧАЛОПЕРИОДА(Взаимодействие.ЗадачаНазначеннаяДата, ДЕНЬ) = Взаимодействие.ЗадачаНазначеннаяДата,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ЗНАЧЕНИЕ(Перечисление.Периодичность.Час),
	|	Взаимодействие.ЗадачаНазначеннаяДата,
	|	Взаимодействие.КоличествоПереносов,
	|	Взаимодействие.ВидВзаимодействияСправочник,
	|	ВЫБОР
	|		КОГДА Взаимодействие.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(Взаимодействие.ЗадачаПредмет КАК Справочник.Заявки)
	|		ИНАЧЕ Взаимодействие.Контрагент
	|	КОНЕЦ,
	|	ЕСТЬNULL(КонтрагентыСведенияДляСписка.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)),
	|	Взаимодействие.Сделка,
	|	ВЫБОР
	|		КОГДА Взаимодействие.Сделка = ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыСделок.ПустаяСсылка)
	|		ИНАЧЕ Взаимодействие.Сделка.ВидСделки
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Взаимодействие.Сделка = ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.ПустаяСсылка)
	|		ИНАЧЕ Взаимодействие.Сделка.ЭтапСделки
	|	КОНЕЦ,
	|	Взаимодействие.ЗадачаТема,
	|	Взаимодействие.ТриггерноеСобытие,
	|	Взаимодействие.ЗадачаОписание,
	|	Взаимодействие.ДатаИсполнения,
	|	Взаимодействие.ЗадачаПредмет,
	|	Взаимодействие.ИсполнительФактический,
	|	Взаимодействие.Исполнитель,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Взаимодействие.Сделка КАК Справочник.Сделки).ЭтапСделки.ЦветЭтапа КАК СТРОКА(150)),
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(Взаимодействие.ЗадачаНазначеннаяДата, ДЕНЬ), Взаимодействие.ЗадачаНазначеннаяДата, МИНУТА) > 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	""""
	|ИЗ
	|	Задача.Взаимодействие КАК Взаимодействие
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтрагентыСведенияДляСписка КАК КонтрагентыСведенияДляСписка
	|		ПО Взаимодействие.Контрагент = КонтрагентыСведенияДляСписка.Контрагент
	|ГДЕ
	|	&УсловиеПометкаУдаления
	|	И Взаимодействие.Выполнена = ЛОЖЬ
	|	И Взаимодействие.ЗадачаНазначеннаяДатаНачало = ДАТАВРЕМЯ(1, 1, 1)
	|	И Взаимодействие.ЗадачаНазначеннаяДата МЕЖДУ &ПериодОтбораДатаНачала И &ПериодОтбораДатаОкончания
	|	И &УсловиеВидВзаимодействия
	|	И &УсловиеКонтрагент
	|	И &УсловиеСделки
	|	И &УсловиеВидСделки
	|	И &УсловиеЭтап
	|	И &УсловиеИсполнительФактический
	|	И Взаимодействие.Исполнитель В
	|			(ВЫБРАТЬ
	|				ТаблицаИсполнителей.Исполнитель
	|			ИЗ
	|				ТаблицаИсполнителей КАК ТаблицаИсполнителей)
	|	И &УсловиеСтатус
	|	И &УсловиеСтруктурнаяЕдиница
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Взаимодействие.ВидВзаимодействияСправочник.ИндексКартинки,
	|	Взаимодействие.Ссылка,
	|	Взаимодействие.Выполнена,
	|	Взаимодействие.ЗадачаНазначеннаяДатаНачало,
	|	НАЧАЛОПЕРИОДА(Взаимодействие.ЗадачаНазначеннаяДатаНачало, ДЕНЬ) = Взаимодействие.ЗадачаНазначеннаяДатаНачало,
	|	Взаимодействие.ЗадачаНазначеннаяДата,
	|	ВЫБОР
	|		КОГДА Взаимодействие.ЗадачаНазначеннаяДата <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА НАЧАЛОПЕРИОДА(Взаимодействие.ЗадачаНазначеннаяДатаНачало, ДЕНЬ) = НАЧАЛОПЕРИОДА(Взаимодействие.ЗадачаНазначеннаяДата, ДЕНЬ)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Час)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.Периодичность.Час)
	|	КОНЕЦ,
	|	Взаимодействие.ЗадачаНазначеннаяДата,
	|	Взаимодействие.КоличествоПереносов,
	|	Взаимодействие.ВидВзаимодействияСправочник,
	|	ВЫБОР
	|		КОГДА Взаимодействие.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(Взаимодействие.ЗадачаПредмет КАК Справочник.Заявки)
	|		ИНАЧЕ Взаимодействие.Контрагент
	|	КОНЕЦ,
	|	ЕСТЬNULL(КонтрагентыСведенияДляСписка.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)),
	|	Взаимодействие.Сделка,
	|	ВЫБОР
	|		КОГДА Взаимодействие.Сделка = ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыСделок.ПустаяСсылка)
	|		ИНАЧЕ Взаимодействие.Сделка.ВидСделки
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Взаимодействие.Сделка = ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.ПустаяСсылка)
	|		ИНАЧЕ Взаимодействие.Сделка.ЭтапСделки
	|	КОНЕЦ,
	|	Взаимодействие.ЗадачаТема,
	|	Взаимодействие.ТриггерноеСобытие,
	|	Взаимодействие.ЗадачаОписание,
	|	Взаимодействие.ДатаИсполнения,
	|	Взаимодействие.ЗадачаПредмет,
	|	Взаимодействие.ИсполнительФактический,
	|	Взаимодействие.Исполнитель,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Взаимодействие.Сделка КАК Справочник.Сделки).ЭтапСделки.ЦветЭтапа КАК СТРОКА(150)),
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(Взаимодействие.ЗадачаНазначеннаяДата, ДЕНЬ), Взаимодействие.ЗадачаНазначеннаяДата, МИНУТА) > 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	""""
	|ИЗ
	|	Задача.Взаимодействие КАК Взаимодействие
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтрагентыСведенияДляСписка КАК КонтрагентыСведенияДляСписка
	|		ПО Взаимодействие.Контрагент = КонтрагентыСведенияДляСписка.Контрагент
	|ГДЕ
	|	&УсловиеПометкаУдаления
	|	И Взаимодействие.Выполнена = ЛОЖЬ
	|	И Взаимодействие.ЗадачаНазначеннаяДатаНачало <> ДАТАВРЕМЯ(1, 1, 1)
	|	И (Взаимодействие.ЗадачаНазначеннаяДатаНачало МЕЖДУ &ПериодОтбораДатаНачала И &ПериодОтбораДатаОкончания
	|			ИЛИ Взаимодействие.ЗадачаНазначеннаяДата МЕЖДУ &ПериодОтбораДатаНачала И &ПериодОтбораДатаОкончания
	|			ИЛИ &ПериодОтбораДатаНачала >= Взаимодействие.ЗадачаНазначеннаяДатаНачало
	|				И &ПериодОтбораДатаОкончания <= Взаимодействие.ЗадачаНазначеннаяДата)
	|	И &УсловиеВидВзаимодействия
	|	И &УсловиеКонтрагент
	|	И &УсловиеСделки
	|	И &УсловиеВидСделки
	|	И &УсловиеЭтап
	|	И &УсловиеИсполнительФактический
	|	И Взаимодействие.Исполнитель В
	|			(ВЫБРАТЬ
	|				ТаблицаИсполнителей.Исполнитель
	|			ИЗ
	|				ТаблицаИсполнителей КАК ТаблицаИсполнителей)
	|	И &УсловиеСтатус
	|	И &УсловиеСтруктурнаяЕдиница");				  
	
	// Отбор пометка удаления.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборПометкаУдаления)
		И СтруктураОтборов.ОтборПометкаУдаления[0].Значение = Истина Тогда
		
		УсловиеПометкаУдаления = СтруктураОтборов.ОтборПометкаУдаления.ДоступныеЗначения[0].Представление + "Взаимодействие.ПометкаУдаления = ИСТИНА";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПометкаУдаления", УсловиеПометкаУдаления);
	Иначе		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПометкаУдаления", "ИСТИНА");
	КонецЕсли;	
	
	// Отбор вид взаимодействия.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборВидВзаимодействия) Тогда
		УсловиеВидВзаимодействия = СтруктураОтборов.ОтборВидВзаимодействия.ДоступныеЗначения[0].Представление +  "Взаимодействие.ВидВзаимодействияСправочник В (&ОтборВидВзаимодействия)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВидВзаимодействия", УсловиеВидВзаимодействия);
		Запрос.УстановитьПараметр("ОтборВидВзаимодействия", СтруктураОтборов.ОтборВидВзаимодействия.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВидВзаимодействия", "ИСТИНА");
	КонецЕсли;
	
	// Отбор вид сделки. 
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборВидСделки) Тогда
		МассивЗначений = СтруктураОтборов.ОтборВидСделки.ВыгрузитьЗначения();
		Если МассивЗначений.Найти(Справочники.ВидыСделок.ПустаяСсылка()) = Неопределено Тогда 
			УсловиеВидСделки = СтруктураОтборов.ОтборВидСделки.ДоступныеЗначения[0].Представление +  "Взаимодействие.Сделка.ВидСделки В (&ОтборВидСделки)";
			Запрос.УстановитьПараметр("ОтборВидСделки", МассивЗначений);			
		ИначеЕсли СтруктураОтборов.ОтборВидСделки.Количество() = 1 Тогда 
			УсловиеВидСделки = СтруктураОтборов.ОтборВидСделки.ДоступныеЗначения[0].Представление +  "Взаимодействие.Сделка = ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)";
		Иначе
			МассивЗначений.Удалить(МассивЗначений.Найти(Справочники.ВидыСделок.ПустаяСсылка()));
			УсловиеВидСделки = СтруктураОтборов.ОтборВидСделки.ДоступныеЗначения[0].Представление +  "(Взаимодействие.Сделка = ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка) ИЛИ Взаимодействие.Сделка.ВидСделки В (&ОтборВидСделки))";
			Запрос.УстановитьПараметр("ОтборВидСделки", МассивЗначений);			
		КонецЕсли;	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВидСделки", УсловиеВидСделки);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВидСделки", "ИСТИНА");
	КонецЕсли;
	
	// Отбор этап. 
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборЭтап) Тогда
		УсловиеЭтап = СтруктураОтборов.ОтборЭтап.ДоступныеЗначения[0].Представление +  "Взаимодействие.Сделка.ЭтапСделки В (&ОтборЭтап)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЭтап", УсловиеЭтап);
		Запрос.УстановитьПараметр("ОтборЭтап", СтруктураОтборов.ОтборЭтап.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЭтап", "ИСТИНА");
	КонецЕсли;
	
	// Отбор исполнитель.
	ВариантВыбора = СтруктураОтборов.ОтборИсполнитель.ДоступныеЗначения[0].Представление;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСотрудники"		, ВариантВыбора + "Сотрудники.Ссылка В(&МассивСотрудников)");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСегментСотрудники", ВариантВыбора + "СотрудникиСегмента.Сотрудник В(&МассивСотрудников)");
	
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборИсполнитель) Тогда	
		Запрос.УстановитьПараметр("МассивСотрудников", СтруктураОтборов.ОтборИсполнитель.ВыгрузитьЗначения());
	Иначе
		Запрос.УстановитьПараметр("МассивСотрудников", СтруктураОтборов.ОтборИсполнитель.ДоступныеЗначения.ВыгрузитьЗначения());		
	КонецЕсли;
	
	// Отбор кто выполнил. 
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборКтоВыполнил) Тогда
		УсловиеИсполнитель = СтруктураОтборов.ОтборКтоВыполнил.ДоступныеЗначения[0].Представление + "Взаимодействие.ИсполнительФактический В (&ОтборИсполнительФактический)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИсполнительФактический", УсловиеИсполнитель);
		Запрос.УстановитьПараметр("ОтборИсполнительФактический" , СтруктураОтборов.ОтборКтоВыполнил.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИсполнительФактический", "ИСТИНА");
	КонецЕсли;
	
	// Отбор структурная единица. 
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборСтруктурнаяЕдиница) Тогда
		УсловиеСтруктурнаяЕдиница = СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения[0].Представление + "Взаимодействие.СтруктурнаяЕдиница В (&ОтборСтруктурнаяЕдиница)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", УсловиеСтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("ОтборСтруктурнаяЕдиница" , СтруктураОтборов.ОтборСтруктурнаяЕдиница.ВыгрузитьЗначения());
	Иначе
		УсловиеСтруктурнаяЕдиница = СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения[0].Представление + "Взаимодействие.СтруктурнаяЕдиница В (&ОтборСтруктурнаяЕдиница)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", УсловиеСтруктурнаяЕдиница);		
		Запрос.УстановитьПараметр("ОтборСтруктурнаяЕдиница" , СтруктураОтборов.ОтборСтруктурнаяЕдиница.ДоступныеЗначения.ВыгрузитьЗначения());		
	КонецЕсли;
	
	//// Отбор контрагент.	
	//Если ЗначениеЗаполнено(СтруктураОтборов.ОтборКонтрагент) Тогда
	//	УсловиеКонтрагент = СтруктураОтборов.ОтборКонтрагент.ДоступныеЗначения[0].Представление + "Взаимодействие.Контрагент В (&ОтборКонтрагент)";
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонтрагент", УсловиеКонтрагент);
	//	Запрос.УстановитьПараметр("ОтборКонтрагент", СтруктураОтборов.ОтборКонтрагент.ВыгрузитьЗначения());
	//Иначе
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонтрагент", "ИСТИНА");
	//КонецЕсли; 
	
	// Отбор контрагент.	
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборКонтрагент) ИЛИ ЗначениеЗаполнено(ЭтотОбъект.Контрагент) Тогда  
		КонтрагентДляОтбора = ?(ЗначениеЗаполнено(СтруктураОтборов.ОтборКонтрагент), СтруктураОтборов.ОтборКонтрагент.ВыгрузитьЗначения(), ЭтотОбъект.Контрагент);
		УсловиеКонтрагент = СтруктураОтборов.ОтборКонтрагент.ДоступныеЗначения[0].Представление + "Взаимодействие.Контрагент В (&ОтборКонтрагент)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонтрагент", УсловиеКонтрагент);
		Запрос.УстановитьПараметр("ОтборКонтрагент", КонтрагентДляОтбора);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонтрагент", "ИСТИНА");
	КонецЕсли;
	
	// Отбор сделка.  
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборСделка)
		И СтруктураОтборов.ОтборСделка[0].Значение = Ложь Тогда 	
		
		УсловиеСделки = СтруктураОтборов.ОтборСделка.ДоступныеЗначения[0].Представление + "Взаимодействие.Сделка = ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСделки", УсловиеСделки);
	Иначе		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСделки", "ИСТИНА");
	КонецЕсли;	
	
	// Отбор статус задачи. 	
	МассивСтатусов = Новый Массив;	
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборСтатус) Тогда
		Если СтруктураОтборов.ОтборСтатус.НайтиПоЗначению("Выполнена") <> Неопределено Тогда 
			МассивСтатусов.Добавить(Истина);
		КонецЕсли;
		Если СтруктураОтборов.ОтборСтатус.НайтиПоЗначению("Не выполнена") <> Неопределено ИЛИ СтруктураОтборов.ОтборСтатус.НайтиПоЗначению("Просрочена") <> Неопределено Тогда 
			МассивСтатусов.Добавить(Ложь);
		КонецЕсли;
		УсловиеСтатус = СтруктураОтборов.ОтборСтатус.ДоступныеЗначения[0].Представление + "Взаимодействие.Выполнена В(&МассивСтатусов)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтатус", УсловиеСтатус);
		Запрос.УстановитьПараметр("МассивСтатусов", МассивСтатусов);
		Если СтруктураОтборов.ОтборСтатус.НайтиПоЗначению("Просрочена") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "(Взаимодействие.ЗадачаНазначеннаяДатаНачало МЕЖДУ &ПериодОтбораДатаНачала И &ПериодОтбораДатаОкончания
			|			ИЛИ Взаимодействие.ЗадачаНазначеннаяДата МЕЖДУ &ПериодОтбораДатаНачала И &ПериодОтбораДатаОкончания
			|			ИЛИ &ПериодОтбораДатаНачала >= Взаимодействие.ЗадачаНазначеннаяДатаНачало
			|				И &ПериодОтбораДатаОкончания <= Взаимодействие.ЗадачаНазначеннаяДата)", "ИСТИНА");			
				
		КонецЕсли;	
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтатус", "ИСТИНА");			
	КонецЕсли;
	
	Если СтруктураОтборов.ОтборСтатус.НайтиПоЗначению("Просрочена") <> Неопределено Тогда
		ДатаНачала    	= Дата(01,01,0001);
		ДатаОкончания 	= НачалоДня(ТекущаяДатаСеанса()) - 1;     		
		Запрос.УстановитьПараметр("ПериодОтбораДатаНачала",    ДатаНачала);
		Запрос.УстановитьПараметр("ПериодОтбораДатаОкончания", ДатаОкончания);
	Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Взаимодействие.ДатаИсполнения МЕЖДУ &ПериодОтбораДатаНачала И &ПериодОтбораДатаОкончания", "ИСТИНА");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Взаимодействие.ЗадачаНазначеннаяДата МЕЖДУ &ПериодОтбораДатаНачала И &ПериодОтбораДатаОкончания", "ИСТИНА");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "(Взаимодействие.ЗадачаНазначеннаяДатаНачало МЕЖДУ &ПериодОтбораДатаНачала И &ПериодОтбораДатаОкончания
			|			ИЛИ Взаимодействие.ЗадачаНазначеннаяДата МЕЖДУ &ПериодОтбораДатаНачала И &ПериодОтбораДатаОкончания
			|			ИЛИ &ПериодОтбораДатаНачала >= Взаимодействие.ЗадачаНазначеннаяДатаНачало
			|				И &ПериодОтбораДатаОкончания <= Взаимодействие.ЗадачаНазначеннаяДата)", "ИСТИНА");
					
	КонецЕсли; 
	
	Возврат Запрос;
	
КонецФункции 

&НаКлиенте
// Процедура - Обработчик нажатия элемента фильтрации данных.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОбработчикНажатияЭлементаФильтрацииДанных(Команда, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	МассивИмен = СтрРазделить(Команда.Имя,"_");
	
	Если МассивИмен.Количество() <> 0 Тогда 
		
		Если МассивИмен[0] = "Удалить" Тогда
			
			РезультатОбновления = УправлениеИнтерфейсамиКлиент.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, Команда.Имя, , ВыбранноеЗначение);
			Если РезультатОбновления.Свойство("ДействиеЭлемента") И РезультатОбновления.ДействиеЭлемента = "ОбработкаВыбора" Тогда 
				Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда 
					СтандартнаяОбработка = Ложь;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Отбор"				, ПараметрыВыбранныхФильтров(Новый Структура));
			ПараметрыФормы.Вставить("ИмяКоманды"		, Команда.Имя);
			ПараметрыФормы.Вставить("ВыбранноеЗначение" , ВыбранноеЗначение);
			ПараметрыФормы.Вставить("ФормаСпискаПерейти", Истина);
			
			ОткрытьФорму("Задача.Взаимодействие.Форма.ФормаФильтры",
						 ПараметрыФормы,,,,,
						 Новый ОписаниеОповещения("ОткрытиеФильтровЗавершение", ЭтотОбъект),
						 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
// Процедура - ОткрытиеФильтровЗавершение.
//
Процедура ОткрытиеФильтровЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОткрытиеФильтровНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
// Процедура - ОткрытиеФильтровНаСервере.
//
Процедура ОткрытиеФильтровНаСервере(Результат)
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ПараметрыОтбора = ПолучитьИзВременногоХранилища(Результат);
		ОбновитьМеханизмФильтрацииДанных(ПараметрыОтбора, Истина);	
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
// Процедура - Инициализировать механизм фильтрации данных
//
// Параметры:
//  ПараметрыОтбора	 - 	 - 
//  ОбновитьСписок	 - 	 - 
//
Процедура ОбновитьМеханизмФильтрацииДанных(ПараметрыОтбора = Неопределено, ОчиститьФильтры = Ложь)
	
	Для каждого Строка из ТаблицаФильтров Цикл
		Строка.Инициализирован = Ложь;
	КонецЦикла;
	
	МассивИменОчищаемыхФильтров = Новый Массив();
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Статус");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ВидВзаимодействия");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ВидСделки");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Этап");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Контрагент");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_СтатусКлиента");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_СтруктурнаяЕдиница");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Сделка"); 
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ПометкаУдаленияЗадачи"); 
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Исполнитель");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_КтоВыполнил"); 
	
	УправлениеИнтерфейсамиСервер.ДеактивироватьВсеЗначенияФильтрацииДанных(ЭтаФорма, МассивИменОчищаемыхФильтров);

	РезультатПакетногоЗапроса = ПолучитьПакетЗапросаЗначенийДляОтборов();	
	
	// Отбор статус.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтатусовЗадач");	
	ОбновитьДинамическоеМенюФильтрации_Статус(, УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтатусовЗадач_ВариантОтбора"), ПараметрыОтбора.МассивСтатусовЗадач_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Статус", ПараметрыОтбора.МассивСтатусовЗадач, Истина,,,ВариантОтбора);		
	КонецЕсли;
	
	// Отбор видов взаимодействия.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивВидовВзаимодействия");	
	ОбновитьДинамическоеМенюФильтрации_ВидВзаимодействия(РезультатПакетногоЗапроса[2].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивВидовВзаимодействия_ВариантОтбора"), ПараметрыОтбора.МассивВидовВзаимодействия_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ВидВзаимодействия", ПараметрыОтбора.МассивВидовВзаимодействия, Истина,,, ВариантОтбора);		
	КонецЕсли;
	
	// Отбор вид сделки.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивВидовСделок");
	ОбновитьДинамическоеМенюФильтрации_ВидСделки(РезультатПакетногоЗапроса[3].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда 
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивВидовСделок_ВариантОтбора"), ПараметрыОтбора.МассивВидовСделок_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ВидСделки", ПараметрыОтбора.МассивВидовСделок, Истина,,, ВариантОтбора);		
	КонецЕсли;

	// Отбор этап.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивЭтапов");
	ОбновитьДинамическоеМенюФильтрации_Этап(РезультатПакетногоЗапроса[0].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда 
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивЭтапов_ВариантОтбора"), ПараметрыОтбора.МассивЭтапов_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Этап", ПараметрыОтбора.МассивЭтапов, Истина,,, ВариантОтбора);	
	КонецЕсли;	
	
	// Отбор по контрагентам.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивКлиентов") ИЛИ ЗначениеЗаполнено(ЭтотОбъект.Контрагент);
	ОбновитьДинамическоеМенюФильтрации_Контрагент(, УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивКонтрагентов_ВариантОтбора"), ПараметрыОтбора.МассивКонтрагентов_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Контрагент", ?(ЗначениеЗаполнено(ЭтотОбъект.Контрагент), ЭтотОбъект.Контрагент, ПараметрыОтбора.МассивКлиентов), Ложь,,, ВариантОтбора);	
	КонецЕсли;
	
	// Отбор СЕ.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтруктурныхЕдиниц");
	Если УстановитьОтбор И НЕ ЗначениеЗаполнено(ПараметрыОтбора.МассивСтруктурныхЕдиниц) Тогда	
		ОбновитьДинамическоеМенюФильтрации_СтруктурнаяЕдиница(РезультатПакетногоЗапроса[6].Выгрузить(), УстановитьОтбор);
	Иначе 
		ОбновитьДинамическоеМенюФильтрации_СтруктурнаяЕдиница(РезультатПакетногоЗапроса[5].Выгрузить(), УстановитьОтбор);
	КонецЕсли;
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтруктурныхЕдиниц_ВариантОтбора"), ПараметрыОтбора.МассивСтруктурныхЕдиниц_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтруктурнаяЕдиница", ПараметрыОтбора.МассивСтруктурныхЕдиниц, Истина,,, ВариантОтбора);	
	КонецЕсли;

	// Отбор итересов.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтатусовНаличияСделок");
	ОбновитьДинамическоеМенюФильтрации_Сделка(,УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтатусовНаличияСделок_ВариантОтбора"), ПараметрыОтбора.МассивСтатусовНаличияСделок_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Сделка", ПараметрыОтбора.МассивСтатусовНаличияСделок, Истина,,, ВариантОтбора);	
	КонецЕсли;
	
	// Отбор пометка удаления сделки.         
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("СписокСтатусовПометокУдаления"); 
	ОбновитьДинамическоеМенюФильтрации_ПометкаУдаленияЗадачи(, УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("СписокСтатусовПометокУдаления_ВариантОтбора"), ПараметрыОтбора.СписокСтатусовПометокУдаления_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПометкаУдаленияЗадачи", ПараметрыОтбора.СписокСтатусовПометокУдаления, Истина,,, ВариантОтбора);				
	КонецЕсли;
	
	// Отбор исполнителей.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивИсполнителей"); 
	ОбновитьДинамическоеМенюФильтрации_Исполнитель(РезультатПакетногоЗапроса[1].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивИсполнителей_ВариантОтбора"), ПараметрыОтбора.МассивИсполнителей_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Исполнитель", ПараметрыОтбора.МассивИсполнителей, Истина, НСтр("ru = '<не указан>'; en = '<not specified>'"),, ВариантОтбора);
	КонецЕсли;	
	
	// Отбор исполнителей.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивКтоВыполнил"); 
	ОбновитьДинамическоеМенюФильтрации_КтоВыполнил(РезультатПакетногоЗапроса[1].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивКтоВыполнил_ВариантОтбора"), ПараметрыОтбора.МассивКтоВыполнил_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_КтоВыполнил", ПараметрыОтбора.МассивКтоВыполнил, Истина, НСтр("ru = '<не указан>'; en = '<not specified>'"),, ВариантОтбора);
	КонецЕсли;
	
	Если ЭтаФорма.РежимОтображенияФормы = 0 Тогда 		
		АктуализироватьДанныеСпискаСогласноОтборов();
	ИначеЕсли ЭтаФорма.РежимОтображенияФормы = 1 Тогда
		СтруктураОтборов = ПолучитьСтруктуруЗначенийОтбора();		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - Данные выбранных фильтров.
//
Функция ПараметрыВыбранныхФильтров(ПараметрыОтбора)
	
	Для каждого Строка из ТаблицаФильтров Цикл
		Если Строка.КоличествоАктивированныхЗначений > 0 Тогда
			
			МассивДанных = ПолучениеЭлементовОтбора(Новый Массив, Строка.СписокЗначений, Строка.Наименование);
			
			Если Строка.Наименование = "Фильтр_Статус" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусовЗадач"			   				, МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусовЗадач_ВариантОтбора"			, Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_ВидВзаимодействия" Тогда
				ПараметрыОтбора.Вставить("МассивВидовВзаимодействия"					, МассивДанных);
				ПараметрыОтбора.Вставить("МассивВидовВзаимодействия_ВариантОтбора"		, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_ВидСделки" Тогда
				ПараметрыОтбора.Вставить("МассивВидовСделок"			  				, МассивДанных);
				ПараметрыОтбора.Вставить("МассивВидовСделок_ВариантОтбора"				, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Этап" Тогда
				ПараметрыОтбора.Вставить("МассивЭтапов"			     					, МассивДанных);
				ПараметрыОтбора.Вставить("МассивЭтапов_ВариантОтбора"					, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Контрагент" Тогда
				ПараметрыОтбора.Вставить("МассивКлиентов"							    , МассивДанных);
				ПараметрыОтбора.Вставить("МассивКонтрагентов_ВариантОтбора"				, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_СтруктурнаяЕдиница" Тогда
				ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц"						, МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц_ВариантОтбора"		, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Сделка" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусовНаличияСделок"					, МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусовНаличияСделок_ВариантОтбора"	, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_ПометкаУдаленияЗадачи" Тогда
				ПараметрыОтбора.Вставить("СписокСтатусовПометокУдаления"				, МассивДанных);
				ПараметрыОтбора.Вставить("СписокСтатусовПометокУдаления_ВариантОтбора"	, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Исполнитель" Тогда
				ПараметрыОтбора.Вставить("МассивИсполнителей"			   				, МассивДанных);
				ПараметрыОтбора.Вставить("МассивИсполнителей_ВариантОтбора"				, Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_КтоВыполнил" Тогда
				ПараметрыОтбора.Вставить("МассивКтоВыполнил"							, МассивДанных);
				ПараметрыОтбора.Вставить("МассивКтоВыполнил_ВариантОтбора"				, Строка.ВариантОтбора);	
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ПараметрыОтбора, Новый УникальныйИдентификатор);
	
КонецФункции 

&НаСервереБезКонтекста
// Функция - ПолучениеЭлементовОтбора
Функция ПолучениеЭлементовОтбора(Массив, СписокЗначений, НаименованиеФильтра)
	
	Если СписокЗначений.Количество() > 0 Тогда
		Для каждого Значение из СписокЗначений Цикл
			Если Значение.Значение.Выбран = Истина Тогда
				Массив.Добавить(Значение.Значение.ЗначениеФильтра);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

&НаСервере
// Функция, возвращает структуру отборов формы.
//
Функция ПолучитьСтруктуруЗначенийОтбора()
	
	// Метод "ПолучитьЗначенияФильтра" возвращает список активированных значений фильтра.
	// У полученного списка значений есть свойство "ДоступныеЗначения", в котором хранится список всех значений.
	// Таким образом мы одним методом за одну итерацию получаем 2 списка значений(с активированными значениями и всеми значениями).
	// Вариант отбора передается в свойстве "ДоступныеЗначения" в представлении у любого элемента списка.
	
	СтруктураОтборов = Новый Структура();
	СтруктураОтборов.Вставить("ОтборСтатус"					  	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Статус"));
	СтруктураОтборов.Вставить("ОтборВидВзаимодействия"		  	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ВидВзаимодействия"));
	СтруктураОтборов.Вставить("ОтборКонтрагент"				  	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Контрагент"));		
	СтруктураОтборов.Вставить("ОтборВидСделки"				  	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ВидСделки"));	
	СтруктураОтборов.Вставить("ОтборЭтап"					  	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Этап"));
	СтруктураОтборов.Вставить("ОтборСотрудникРегистрации"	  	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СотрудникРегистрации"));
	СтруктураОтборов.Вставить("ОтборРекламныйИсточник"		  	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_РекламныйИсточник"));
	СтруктураОтборов.Вставить("ОтборИсполнитель"			  	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Исполнитель"));
	СтруктураОтборов.Вставить("ОтборКтоВыполнил"	 		  	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_КтоВыполнил"));
	СтруктураОтборов.Вставить("ОтборСделка"	 				  	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Сделка"));	
	СтруктураОтборов.Вставить("ОтборЗавершена"				  	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПризнакВыполненияСделки"));
	СтруктураОтборов.Вставить("ОтборДатаСоздания"			  	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СозданаПериод"));
	СтруктураОтборов.Вставить("ОтборДатаЗавершенияСделки"	  	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ЗавершенаПериод"));
	СтруктураОтборов.Вставить("ОтборДатаЗапланированнойЗадачи"	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПериодЗапланированнойЗадачи"));
	СтруктураОтборов.Вставить("ОтборСтруктурнаяЕдиница"       	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СтруктурнаяЕдиница"));
	СтруктураОтборов.Вставить("ОтборПометкаУдаления"			, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПометкаУдаленияЗадачи"));
	
	Возврат СтруктураОтборов;
	
КонецФункции   

&НаСервере
// Процедура - Обновить динамическое меню фильтрации вид сделки
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ВидСделки(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, Нстр("ru = 'Вид сделки'; en = 'Deal type'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ВидСделки");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ВидСделки");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ВидСделки");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ВидСделки");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ВидСделки");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.ВидыСделок"));	
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.ВидыСделок.ПустаяСсылка(), НСтр("ru= '<не указан>'; en='<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр этап.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Этап(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, Нстр("ru = 'Этап'; en = 'Stage'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Этап");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Этап");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Этап");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Этап");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Этап");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.ЭтапыСделок"));	
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр структурная единица.
//
// Параметры:
//  ТаблицаСтруктурныхЕдиниц - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ВидВзаимодействия(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, Нстр("ru = 'Вид взаимодействия'; en = 'Interaction type'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ВидВзаимодействия");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ВидВзаимодействия");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ВидВзаимодействия");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ВидВзаимодействия");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ВидВзаимодействия");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.ВидыВзаимодействий"));	
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр исполнитель.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Исполнитель(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, Нстр("ru = 'Исполнитель'; en = 'Contractor'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Исполнитель");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Исполнитель");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Исполнитель");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Исполнитель");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Исполнитель"); 
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));	
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.Сотрудники.ПустаяСсылка(), НСтр("ru= '<не указан>'; en='<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр кто выполнил.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_КтоВыполнил(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, Нстр("ru = 'Кто выполнил'; en = 'Completed by'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_КтоВыполнил");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_КтоВыполнил");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_КтоВыполнил");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_КтоВыполнил");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_КтоВыполнил");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));	
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.Сотрудники.ПустаяСсылка(), НСтр("ru= '<не указан>'; en='<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр сделка.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Сделка(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, Нстр("ru = 'Сделка'; en = 'Deal'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Сделка");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Сделка");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Сделка");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Сделка");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Сделка");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("Булево"));	
	
	// Формируем коллекцию сами
	КоллекцияЗначений = Новый ТаблицаЗначений;
	КоллекцияЗначений.Колонки.Добавить("Ссылка"			, Новый ОписаниеТипов("Булево"));
	КоллекцияЗначений.Колонки.Добавить("Представление"	, Новый ОписаниеТипов("Строка"));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", Ложь, Нстр("ru = 'Нет сделок'; en = 'No deals'")));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр контрагент.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Контрагент(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, Нстр("ru = 'Пациент'; en = 'Patient'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Контрагент");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Контрагент");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Контрагент");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Контрагент");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Контрагент");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ТолькоПолеВыбора"						, Истина);	
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));	
	
	// Если фильтрация происходит с использованием поля выбора - можем накинуть на поле выбора параметры выбора
	УправлениеИнтерфейсамиСервер.ДобавитьПараметрыВыбора(СтруктураФильтра, Новый Структура("ЭтоГруппа, ПометкаУдаления, ТипКонтрагента", Ложь, Ложь, Перечисления.ТипыКонтрагентов.Клиенты));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.Контрагенты.ПустаяСсылка(), Нстр("ru = '<не указан>'; en = '<not specified>'"), , Истина);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить динамическое меню фильтрации пометка удаления задачи
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ПометкаУдаленияЗадачи(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, Нстр("ru = 'Пометка удаления'; en = 'Deletion mark'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ПометкаУдаленияЗадачи");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ПометкаУдаленияЗадачи");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ПометкаУдаленияЗадачи");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ПометкаУдаленияЗадачи");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ПометкаУдаленияЗадачи");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("Булево"));	
	СтруктураФильтра.Вставить("ВариантОтбора"							, Ложь);
	
	// Формируем коллекцию сами
	КоллекцияЗначений = Новый ТаблицаЗначений;
	КоллекцияЗначений.Колонки.Добавить("Ссылка"			, Новый ОписаниеТипов("Булево"));
	КоллекцияЗначений.Колонки.Добавить("Представление"	, Новый ОписаниеТипов("Строка"));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", Истина, НСтр("ru = 'Удалена'; en = 'Deleted'")));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура - Обновить динамическое меню фильтрации структурная единица.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_СтруктурнаяЕдиница(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, Нстр("ru = 'Клиника'; en = 'Clinic'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));	
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.СтруктурныеЕдиницы.ПустаяСсылка(), Нстр("ru = '<не указана>'; en = '<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает пакет запроса с элементами для создания отборов.
//
Функция ПолучитьПакетЗапросаЗначенийДляОтборов()
	
	МассивСтруктурныхЕдиниц 	= Справочники.Сотрудники.ПолучитьМестаРаботыСотрудника(ПараметрыСеанса.ТекущийСотрудник, "Массив");		
	МассивВидовСделок 			= Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(, МассивСтруктурныхЕдиниц);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивВидовСделок"		, МассивВидовСделок);
	Запрос.УстановитьПараметр("МассивСтруктурныхЕдиниц"	, МассивСтруктурныхЕдиниц);
	Запрос.УстановитьПараметр("ТекущийСотрудник"		, ПараметрыСеанса.ТекущийСотрудник);	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЭтапыСделок.Ссылка КАК Ссылка,
	|	ЭтапыСделок.Представление КАК Представление
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	НЕ ЭтапыСделок.ПометкаУдаления
	|	И ЭтапыСделок.ВидСделки В(&МассивВидовСделок)
	|	И ЭтапыСделок.Ссылка <> ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтапыСделок.НомерЭтапа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Сотрудники.Ссылка) КАК Представление
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО Сотрудники.ИдентификаторПользователяИБ = Пользователи.ИдентификаторПользователяИБ
	|ГДЕ
	|	Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И Сотрудники.ЭтоГруппа = ЛОЖЬ
	|	И (Сотрудники.Роль В (ЗНАЧЕНИЕ(Перечисление.РольПользователя.АдминистраторБазыДанных), ЗНАЧЕНИЕ(Перечисление.РольПользователя.Регистратура), ЗНАЧЕНИЕ(Перечисление.РольПользователя.ГлавныйВрач), ЗНАЧЕНИЕ(Перечисление.РольПользователя.Врач), ЗНАЧЕНИЕ(Перечисление.РольПользователя.Руководитель), ЗНАЧЕНИЕ(Перечисление.РольПользователя.Управляющий))
	|			ИЛИ Пользователи.РольПользователя В (ЗНАЧЕНИЕ(Перечисление.РольПользователя.АдминистраторБазыДанных), ЗНАЧЕНИЕ(Перечисление.РольПользователя.Регистратура), ЗНАЧЕНИЕ(Перечисление.РольПользователя.ГлавныйВрач), ЗНАЧЕНИЕ(Перечисление.РольПользователя.Врач), ЗНАЧЕНИЕ(Перечисление.РольПользователя.Руководитель), ЗНАЧЕНИЕ(Перечисление.РольПользователя.Управляющий))
	|			ИЛИ Сотрудники.Ссылка = &ТекущийСотрудник)
	|
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудники.Представление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВидыВзаимодействий.Ссылка КАК Ссылка,
	|	ВидыВзаимодействий.Представление КАК Представление
	|ИЗ
	|	Справочник.ВидыВзаимодействий КАК ВидыВзаимодействий
	|ГДЕ
	|	НЕ ВидыВзаимодействий.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВидыСделок.Ссылка КАК Ссылка,
	|	ВидыСделок.Представление КАК Представление
	|ИЗ
	|	Справочник.ВидыСделок КАК ВидыСделок
	|ГДЕ
	|	ВидыСделок.ПометкаУдаления = ЛОЖЬ
	|	И ВидыСделок.Ссылка В(&МассивВидовСделок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СтатусыКлиентов.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СтатусыКлиентов.Ссылка) КАК Представление
	|ИЗ
	|	Перечисление.СтатусыКонтрагентов КАК СтатусыКлиентов
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыКлиентов.Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СотрудникиМестаРаботы.Ссылка КАК Ссылка,
	|	СотрудникиМестаРаботы.Представление КАК Представление
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СотрудникиМестаРаботы
	|ГДЕ
	|	СотрудникиМестаРаботы.Ссылка В(&МассивСтруктурныхЕдиниц)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Ссылка,
	|	СтруктурныеЕдиницы.Представление КАК Представление
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	НЕ СтруктурныеЕдиницы.ПометкаУдаления
	|	И НЕ СтруктурныеЕдиницы.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление";
		
	Возврат Запрос.ВыполнитьПакет(); 
	
КонецФункции

&НаКлиенте
// Процедура, обработчик нажатия элемента динамического меню.
//
Процедура ОбработчикНажатияЭлементаДинамическогоМеню(Команда) Экспорт
		
	ПриИзмененииОтборовСервер(Команда.Имя);
		
КонецПроцедуры

&НаСервере
// Процедура, получить значения отборов динамических списков.
//
Процедура ПолучитьЗначенияОтборов()
	
	СтруктураОтборов = ПолучитьСтруктуруЗначенийОтбора();
	
	АктуализироватьДанныеСпискаСогласноОтборов(); 
	
КонецПроцедуры

&НаСервере
// При изменении состава отборов.
//
Процедура ПриИзмененииОтборовСервер(Знач ИмяКоманды)
			
	ЭлементФормы        = УправлениеИнтерфейсамиСервер.ЭлементФормыПоИмениЭлемента(ЭтаФорма, ИмяКоманды);
	ИмяЭлемента         = ЭлементФормы.Имя;
	ОбновитьОтборы 		= УправлениеИнтерфейсамиСервер.ОбработчикЭлементаДинамическогоМенюПриНажатии(ЭтаФорма, ИмяЭлемента);
	 
	// Селектирование страниц филтров в зависимости от переключателей
	Если УправлениеИнтерфейсамиСервер.ЭтоЭлементБыстрогоВыбора(ИмяЭлемента) Тогда
		
		ИмяМеню = УправлениеИнтерфейсамиСервер.ИмяДинамическогоМенюФормыИзЭлемента(ИмяЭлемента);
		                    		
		Если ИмяМеню = "ПодчиненноеМенюОтборСтатусЗадачи" И (СтрНайти(ИмяЭлемента,"КнопкаПрименить") > 0 ИЛИ СтрНайти(ИмяЭлемента,"КнопкаСкрыть") > 0) Тогда
			ЭтаФорма.ТекущийЭлемент = Элементы.Список;
		КонецЕсли; 
		
	КонецЕсли;

	Если ОбновитьОтборы Тогда 
		ПолучитьЗначенияОтборов();
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура - Обновить все отборы формы
//
// Параметры:
//  ПараметрыОтбора	 - 	 - 
//
Процедура ОбновитьВсеОтборыФормы(ПараметрыОтбора)
	
	МассивИменМеню = Новый Массив();
	МассивИменМеню.Добавить("МенюОтборСтатусЗадачи");
	МассивИменМеню.Добавить("МенюОтборВидВзаимодействия");
	МассивИменМеню.Добавить("МенюОтборЭтап");
	МассивИменМеню.Добавить("МенюОтборИсполнитель");
	МассивИменМеню.Добавить("МенюОтборКтоВыполнил");
	МассивИменМеню.Добавить("МенюОтборКонтрагенты");
	МассивИменМеню.Добавить("МенюОтборСделки");
	
	УправлениеИнтерфейсамиСервер.СнятьВыборВДинамическомМенюФормы(ЭтаФорма, МассивИменМеню);
	Если ТипЗнч(ПараметрыОтбора) = Тип("Структура") И ПараметрыОтбора.Свойство("МассивМенеджеров") Тогда 
		УправлениеИнтерфейсамиСервер.УстановитьВыборВДинамическомМенюФормы(ЭтаФорма, "МенюОтборИсполнитель", ПараметрыОтбора.МассивМенеджеров, Истина);
	КонецЕсли;	
	Если ТипЗнч(ПараметрыОтбора) = Тип("Структура") И ПараметрыОтбора.Свойство("МассивСтатусовЗадач") Тогда 
		УправлениеИнтерфейсамиСервер.УстановитьВыборВДинамическомМенюФормы(ЭтаФорма, "МенюОтборСтатусЗадачи", ПараметрыОтбора.МассивСтатусовЗадач, Истина);
	КонецЕсли;		
	ПолучитьЗначенияОтборов();
	
КонецПроцедуры

#КонецОбласти

#Область ВсплывающаяГруппаИзменить

&НаКлиенте
// Процедура, устанавливает видимость групп и элементов.
//
Процедура УстановитьВидмостьВсплывающейГруппы(Знач ВыбранноеЗначение)
	
	Если ВыбранноеЗначение = "Исполнитель" Тогда
		
		ВидимостьТаблицыДействий(ВыбранноеЗначение);
		
	ИначеЕсли ВыбранноеЗначение = "ДатаВыполнения"
		ИЛИ  ВыбранноеЗначение = "ДатаНазначено" Тогда 
		
		ЭтотОбъект.ЗначениеДействия = Дата(01,01,0001);
		ВидимостьТаблицыДействий(ВыбранноеЗначение);
		Элементы.ПодДействие.Видимость = Ложь;
		
	ИначеЕсли ВыбранноеЗначение = "ВидВзаимодействия"  Тогда
		
		ЭтотОбъект.ЗначениеДействия = ПредопределенноеЗначение("Перечисление.ВидыВзаимодействия.ПустаяСсылка");		
		ВидимостьТаблицыДействий(ВыбранноеЗначение);
		Элементы.ПодДействие.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, устанавливает видимость таблицы действий.
//
Процедура ВидимостьТаблицыДействий(Знач ВыбранноеЗначение)
	
	Если ВыбранноеЗначение = "Исполнитель" Тогда
		
		Элементы.ГруппаПодДействия.Видимость 	= Ложь;
		Элементы.ГруппаКнопокДействия.Видимость = Истина;
		Элементы.ТаблицаДействия.Видимость		= Истина;
		Элементы.ЗаглушкаДействие.Видимость 	= Истина;
		
	Иначе
		
		Элементы.ГруппаПодДействия.Видимость 	= Истина;
		Элементы.ГруппаКнопокДействия.Видимость = Ложь;
		Элементы.ТаблицаДействия.Видимость		= Ложь;
		Элементы.ЗаглушкаДействие.Видимость 	= Ложь;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура, ЗаполнитьПроцентомСтрокиТЗ.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Процедура ЗаполнитьПроцентомСтрокиТЗ()
	
	Элементы.ОстаточныйПроцент.Видимость = Ложь;
	
	КолвоЭлементов = ЭтотОбъект.ТаблицаДействия.Количество();
	
	Если КолвоЭлементов > 0 Тогда
		
		Процентов  		   = Цел(100/КолвоЭлементов);
		НедостающийПроцент = 100 - (Процентов*КолвоЭлементов);
		
		Для Каждого СтрокаТЗ Из ЭтотОбъект.ТаблицаДействия Цикл
			СтрокаТЗ.Пропорция = Процентов;
		КонецЦикла;
		
		Если НедостающийПроцент > 0 Тогда
			
			Элементы.ОстаточныйПроцент.Видимость  = Не Элементы.ОстаточныйПроцент.Видимость;
			ЭтотОбъект.ОстаточныйПроцентОтДеления = НедостающийПроцент;
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события команды на сервере "Применить".
//
Процедура ПрименитьНаСервере(ДопПараметры)
	
	Перем КоличествоВыделенныхСтрок;
	
	ДопПараметры.Свойство("КоличествоВыделенныхСтрок", КоличествоВыделенныхСтрок);
	
	УстановитьФокусЭлементаСервер();
	
	Если КоличествоВыделенныхСтрок > 1 Тогда
		
		ТЗДинамическогоСписка = Новый ТаблицаЗначений();
		ТЗДинамическогоСписка.Колонки.Добавить("Ссылка");
		
		ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
		Для Каждого ЭлементМассива Из ВыделенныеСтроки Цикл
			
			НоваяСтрока = ТЗДинамическогоСписка.Добавить();
			НоваяСтрока.Ссылка = ЭлементМассива;
			
		КонецЦикла;
		
	Иначе
		ТЗДинамическогоСписка = ПолучитьТаблицуЗначенийДинамическогоСписка();
	КонецЕсли;

	Если ЭтотОбъект.Действие = "Исполнитель" Тогда
		
		ИсполнителиРаспределитьВПропорции(ТЗДинамическогоСписка);
		
	ИначеЕсли ЭтотОбъект.Действие = "ДатаВыполнения" Тогда
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ЗначениеДействия) Тогда
			
			Для Каждого СтрокаТЗ Из ТЗДинамическогоСписка Цикл
				
				ОбъектЗадача 				  		= СтрокаТЗ.Ссылка.ПолучитьОбъект();
				ОбъектЗадача.ДатаИсполнения   		= ЭтотОбъект.ЗначениеДействия;
				ОбъектЗадача.Наименование	  		= ОбъектЗадача.ЗадачаТема + " (" + Строка(ОбъектЗадача.ВидВзаимодействияСправочник) + ")";
				ОбъектЗадача.ИсполнительФактический = ПараметрыСеанса.ТекущийСотрудник;
				ОбъектЗадача.Выполнена				= Истина;
				
				Если ОбъектЗадача.ПроверитьЗаполнение() Тогда
					
					Попытка
						ОбъектЗадача.Записать();	
					Исключение
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось записать задачу, по причине:';en='Succeeded writedown task for the reason:'") + ОписаниеОшибки());
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выберите дату';en='Select date'"));
			Возврат;
			
		КонецЕсли;
		
	ИначеЕсли ЭтотОбъект.Действие = "ДатаНазначено" Тогда
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ЗначениеДействия) Тогда
			
			Для Каждого СтрокаТЗ Из ТЗДинамическогоСписка Цикл
				
				Если НЕ СтрокаТЗ.Ссылка.Выполнена Тогда
					
					ОбъектЗадача 				  		= СтрокаТЗ.Ссылка.ПолучитьОбъект();
					ОбъектЗадача.ЗадачаНазначеннаяДата	= ЭтотОбъект.ЗначениеДействия;
					
					Если ОбъектЗадача.ПроверитьЗаполнение() Тогда
						
						Попытка
							ОбъектЗадача.Записать();	
						Исключение
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось записать задачу, по причине:';en='Succeeded writedown task for the reason:'") + ОписаниеОшибки());
						КонецПопытки;
						
					КонецЕсли;

				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выберите дату';en='Select date'"));
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ЭтотОбъект.Действие = "ВидВзаимодействия" Тогда
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ЗначениеДействия) Тогда
			Для Каждого СтрокаТЗ Из ТЗДинамическогоСписка Цикл
				
				ОбъектЗадача 				   = СтрокаТЗ.Ссылка.ПолучитьОбъект();
				ОбъектЗадача.ВидВзаимодействия = ЭтотОбъект.ЗначениеДействия;
				ОбъектЗадача.Записать();
				
			КонецЦикла;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выберите значение';en='Select value'"));
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

	ОбновитьВсеОтборыФормы(Неопределено);
	ПолучитьПервоначальноеКоличествоЗадач();
			
КонецПроцедуры

&НаСервере
// Процедура, Распределяет мененеджеров в пропорции.
//
Процедура ИсполнителиРаспределитьВПропорции(Знач ТЗДинамическогоСписка)
	
	КоличествоСотрудников = ЭтотОбъект.ТаблицаДействия.Количество();
	
	Если КоличествоСотрудников <= 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТипЧисло = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(3));
	
	ТЗСотрудников = ЭтотОбъект.ТаблицаДействия.Выгрузить();
	ТЗСотрудников.Колонки.Добавить("КоличествоЗадач"	, ТипЧисло);
	ТЗСотрудников.Колонки.Добавить("ПроцентТекущий"		, ТипЧисло);
	ТЗСотрудников.Колонки.Добавить("Дельта"				, ТипЧисло);
	
	ТЗКлиентовСотрудников = ТЗДинамическогоСписка.Скопировать(,"Ссылка");
	ТЗКлиентовСотрудников.Колонки.Добавить("Исполнитель");
	
	НачатьТранзакцию();
	
	Для Каждого СтрокаТЗ Из ТЗКлиентовСотрудников Цикл
		
		ПриоритетныйСотрудник = Неопределено;
		ПриоритетныйПроцент   = 0;
		
		Для Каждого СтрокаСотрудников Из ТЗСотрудников Цикл
			
			Если СтрокаСотрудников.Дельта >= ПриоритетныйПроцент Тогда
				
				ПриоритетныйСотрудник = СтрокаСотрудников.Сотрудник;
				ПриоритетныйПроцент   = СтрокаСотрудников.Дельта;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбъектКлиент = СтрокаТЗ.Ссылка.ПолучитьОбъект();
		ОбъектКлиент.Исполнитель = ПриоритетныйСотрудник;
		ОбъектКлиент.Записать();
		
		СтрокаТЗСотрудников = ТЗСотрудников.Найти(ПриоритетныйСотрудник);
		
		Если СтрокаТЗСотрудников <> Неопределено Тогда
			
			СтрокаТЗСотрудников.КоличествоЗадач = СтрокаТЗСотрудников.КоличествоЗадач + 1;
			СтрокаТЗСотрудников.ПроцентТекущий 	= СтрокаТЗСотрудников.КоличествоЗадач/ТЗСотрудников.Итог("КоличествоЗадач")*100; 
			СтрокаТЗСотрудников.Дельта 		    = СтрокаТЗСотрудников.Пропорция - СтрокаТЗСотрудников.ПроцентТекущий;
			
		КонецЕсли;
		
		// Обновляем данные в таблице значений.
		Для Каждого СтрокаСотрудников Из ТЗСотрудников Цикл
			
			СтрокаСотрудников.ПроцентТекущий 	   = СтрокаСотрудников.КоличествоЗадач/ТЗСотрудников.Итог("КоличествоЗадач")*100; 
			СтрокаСотрудников.Дельта 		       = СтрокаСотрудников.Пропорция - СтрокаСотрудников.ПроцентТекущий;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура получает количество строк в динамическом списке .
//
Процедура УстановитьЗаголовокКоличествоЗадач(КоличествоЗадач, ЕстьОтборы = Ложь)
		
	Если КоличествоЗадач > 0 Тогда
		
		Если ЕстьОтборы Тогда
			
			Строка = СтрокаСЧислом(Нстр("ru = ';Найдена: %1 задача;;Найдено: %1 задачи;Найдено: %1 задач;Найдено: %1 задачи'; en = ';Found: %1 task;;;;Found: %1 tasks'"),
			КоличествоЗадач,
			ВидЧисловогоЗначения.Количественное,
			НСтр("ru='L=ru'; en='L=en'")); 
		Иначе
			Строка = Нстр("ru = 'Всего: '; en = 'Total: '") + КоличествоЗадач;
			
		КонецЕсли;
		
		Элементы.КоличествоОтобранныхЗадач.Заголовок = "(" + Строка + ")";		
	Иначе		
		Элементы.КоличествоОтобранныхЗадач.Заголовок = Нстр("ru = '(Задачи не найдены)'; en = '(Tasks not found)'");		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить данные для отображения
//
// Параметры:
//  СформироватьПериод	 - 	 - 
//
Процедура ОбновитьДанныеДляОтображения(Знач СформироватьПериод = Ложь, Знач СдвинутьВременнойИнтервал = Ложь, Знач НаправлениеДвиженияВременногоИнтервала = "", ОтобразитьНеРаспределенныхКлиентов = Ложь, ОбновитьДанные = Истина)
	
	УстановитьСвойстваОтображенияЭлементов();
	Если ОбновитьДанные Тогда 
		ПолучитьЗначенияОтборов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить видимость элементов
//
Процедура УстановитьСвойстваОтображенияЭлементов()
	
	Элементы.Изменить.Видимость = РольДоступна(Метаданные.Роли.ДобавлениеИзменениеКлиентов) ИЛИ РольДоступна(Метаданные.Роли.ПолныеПрава);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Отбор периода планировании при изменении
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ОтборПериодаПланированииПриИзменении(Результат, ДополнительныеПараметры) Экспорт 
	
	Если НЕ Результат = Неопределено Тогда
		ВыбранныйПериод = 4;		
		ПериодОтбора 	= Результат;
		ОбновитьДанныеДляОтображения(Истина);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, СоздатьУсловноеОформление.
//
Процедура СоздатьУсловноеОформление()
	
	// Дата
	ЭлементУФ = Список.УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПустоеВремя");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра("Формат", "ДФ=dd.MM.yyyy");
	
	ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("ЗадачаНазначеннаяДата");
	ПолеОформления.Использование = Истина;
	
	// Дата работы
	ЭлементУФ = Список.УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПустоеВремяДатаРаботы");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра("Формат", "ДФ=dd.MM.yyyy");
	
	ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("ДатаРаботы");
	ПолеОформления.Использование = Истина;
	
	// Просроченная задача.
	ЭлементУФ 						= Список.УсловноеОформление.Элементы.Добавить();
	
	ГруппаОтбора 					= ЭлементУФ.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы 			= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаОтбора.Использование 		= Истина;
	
	ЭлементОтбора 					= ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  	= Новый ПолеКомпоновкиДанных("ЗадачаНазначеннаяДата");
	ЭлементОтбора.ВидСравнения   	= ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.ПравоеЗначение 	= НачалоДня(ТекущаяДатаСеанса());
	ЭлементОтбора.Использование  	= Истина;
	
	ЭлементОтбора 					= ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  	= Новый ПолеКомпоновкиДанных("Выполнена");
	ЭлементОтбора.ВидСравнения   	= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= Ложь;
	ЭлементОтбора.Использование  	= Истина;
	
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ЦветТекста",(Новый Цвет(255, 0, 0)));
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра("Текст", Нстр("ru = 'Просрочена'; en = 'Expired'"));
	
	ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("Просрочена");
	ПолеОформления.Использование = Истина;

КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить текст запрса для подсчета количества.
// 
Функция ПолучитьТекстЗапрсаДляПодсчетаКоличества()
	 
	// Текст запроса без отборов (чистый).
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Исполнитель
	|ПОМЕСТИТЬ ТаблицаИсполнителей
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В(&МассивСотрудников)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоставСегментов.Сегмент
	|ИЗ
	|	РегистрСведений.СоставСегментов КАК СоставСегментов
	|ГДЕ
	|	СоставСегментов.ОбъектСегмента В(&МассивСотрудников)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиСотрудников.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ТаблицаСотрудниковПоОтборуСтруктурнойЕдиницы
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НастройкиСотрудников.СтруктурнаяЕдиница В(&МассивСтруктурныхЕдиниц)
	|	И НастройкиСотрудников.Сотрудник.ЭтоГруппа = ЛОЖЬ
	|	И НастройкиСотрудников.Сотрудник.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Взаимодействие.Ссылка КАК Ссылка,
	|	Взаимодействие.Выполнена КАК Выполнена,
	|	Взаимодействие.ЗадачаНазначеннаяДатаНачало КАК ЗадачаНазначеннаяДатаНачало
	|ПОМЕСТИТЬ ТаблицаВзаимодействий
	|ИЗ
	|	Задача.Взаимодействие КАК Взаимодействие
	|ГДЕ
	|	(Взаимодействие.СтруктурнаяЕдиница В (&МассивСтруктурныхЕдиниц)
	|			ИЛИ ВЫРАЗИТЬ(Взаимодействие.Исполнитель КАК Справочник.Сотрудники) В
	|				(ВЫБРАТЬ
	|					ТаблицаСотрудниковПоОтборуСтруктурнойЕдиницы.Сотрудник
	|				ИЗ
	|					ТаблицаСотрудниковПоОтборуСтруктурнойЕдиницы)
	|			ИЛИ ВЫРАЗИТЬ(Взаимодействие.Исполнитель КАК Справочник.СегментыСотрудников).СтруктурнаяЕдиница В (&МассивСтруктурныхЕдиниц)
	|			ИЛИ ВЫРАЗИТЬ(Взаимодействие.Исполнитель КАК Справочник.Заявки).СтруктурнаяЕдиница В (&МассивСтруктурныхЕдиниц)
	|			ИЛИ Взаимодействие.ИсполнительФактический В
	|				(ВЫБРАТЬ
	|					ТаблицаСотрудниковПоОтборуСтруктурнойЕдиницы.Сотрудник
	|				ИЗ
	|					ТаблицаСотрудниковПоОтборуСтруктурнойЕдиницы))
	|	И Взаимодействие.Исполнитель В
	|			(ВЫБРАТЬ
	|				ТаблицаИсполнителей.Исполнитель
	|			ИЗ
	|				ТаблицаИсполнителей КАК ТаблицаИсполнителей)
	|	И &УсловиеВидВзаимодействия
	|	И &УсловиеКонтрагент
	|	И &УсловиеИсполнительФактический
	|	И &УсловиеСтатус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаЗадач.Ссылка) КАК КоличествоЗадач
	|ИЗ
	|	(ВЫБРАТЬ
	|		Взаимодействие.Ссылка КАК Ссылка
	|	ИЗ
	|		ТаблицаВзаимодействий КАК Взаимодействие
	|	ГДЕ
	|		Взаимодействие.Выполнена = ИСТИНА
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Взаимодействие.Ссылка
	|	ИЗ
	|		ТаблицаВзаимодействий КАК Взаимодействие
	|	ГДЕ
	|		Взаимодействие.Выполнена = ЛОЖЬ
	|		И Взаимодействие.ЗадачаНазначеннаяДатаНачало = ДАТАВРЕМЯ(1, 1, 1)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Взаимодействие.Ссылка
	|	ИЗ
	|		ТаблицаВзаимодействий КАК Взаимодействие
	|	ГДЕ
	|		Взаимодействие.Выполнена = ЛОЖЬ
	|		И Взаимодействие.ЗадачаНазначеннаяДатаНачало <> ДАТАВРЕМЯ(1, 1, 1)) КАК ТаблицаЗадач";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
// Процедура - Получить первоначальное количество задач.
//
Процедура ПолучитьПервоначальноеКоличествоЗадач()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(Взаимодействие.Ссылка) КАК КоличествоЗадач
	|ИЗ
	|	Задача.Взаимодействие КАК Взаимодействие";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		УстановитьЗаголовокКоличествоЗадач(Выборка.КоличествоЗадач);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Функция получает таблицу значений из динамического списка.
//
Функция ПолучитьТаблицуЗначенийДинамическогоСписка()
	
	// Получаем схему компановки данных (здесь хранится текст запроса)
	Схема 	  = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();	
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();

	// Выводим динамический список в таблицу значений
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(Схема, Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Возврат ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
КонецФункции

&НаСервере
// Процедура - Установить фокус элемента на сервере.
//
Процедура УстановитьФокусЭлементаСервер()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.Список;
	
КонецПроцедуры

#КонецОбласти

