
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает остаток от деления
//
// Параметры:
//  Число1 - Число, числитель.
//  Число2 - Число, знаменатель.
//
// Возвращаемое значение:
//  Число, оостаток от деления.
//
Функция ТекущаяСервернаяДатаНаСервере() Экспорт

	Возврат ТекущаяДатаСеанса();

КонецФункции

&НаСервере
// Функция возвращает группу клиентов
//
Функция ВернутьГруппуКлиентов() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	                      |	НастройкиПользователей.Значение
	                      |ИЗ
	                      |	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	                      |ГДЕ
	                      |	НастройкиПользователей.Пользователь = &Пользователь
	                      |	И НастройкиПользователей.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                      |	И НастройкиПользователей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяГруппаКонтрагентов)");
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	Иначе 
		Возврат  Неопределено;
	КонецЕсли;
	
КонецФункции

// Процедура, выполняет обновление состояние кассы
//
Функция ОбновитьСостояниеКассыИзменение(СтруктураПроверки) Экспорт
	
	СтруктураСостояниеКассовойСмены = РозничныеПродажи.ПолучитьСостояниеКассовойСмены(СтруктураПроверки.Касса); 	
	СтатусСмены = ?(СтруктураСостояниеКассовойСмены <> Неопределено, Строка(СтруктураСостояниеКассовойСмены.СтатусыКассовойСмены), "");
	
	Если СтатусСмены <> СтруктураПроверки.СтатусСмены Тогда
		СтруктураВозврата = Новый Структура("Изменять", Истина);	
		СтруктураВозврата.Вставить("СтатусСмены"	, СтатусСмены);
		СтруктураВозврата.Вставить("ВремяИзменения" , ?(СтруктураСостояниеКассовойСмены <> Неопределено, 
														Формат(СтруктураСостояниеКассовойСмены.ДатаИзмененияСтатуса,"ДФ='dd MMMM ""в ""ЧЧ:мм'"),
														Неопределено));
	Иначе
		СтруктураВозврата = Новый Структура("Изменять", Ложь);
	КонецЕсли;	
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция выполняет поиск контрагентов
//
Функция НайтиКонтрагентовПоСтроке(
	СтрокаПоиска,
	РазмерПорции = 200,
	ВПапкеКлиентов = Ложь,
	ДобавлятьЭлементСоздания = Ложь,
	ВыводитьНомерТелефона = Истина,
	ВыводитьНомерМедКарты = Истина,
	ПереноситьЭлементПоиска = Ложь,
	ТипКонтрагента = Неопределено,
	ВыводитьВсе = Ложь,
	ВернутьВыборкуЗапроса = Ложь) Экспорт
	 	
	СтрокаПоиска = СокрЛ(СтрокаПоиска);
	Если СокрЛ(СтрокаПоиска) = "" ИЛИ СтрДлина(СтрокаПоиска) < 3 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Для роли врач вывод номера телефона запрещен
	Если ПараметрыСеанса.ТекущийПользователь.РольПользователя = Перечисления.РольПользователя.Врач Тогда 		
		ВыводитьНомерТелефона = Ложь; 
	КонецЕсли;
	
	СтрокаПоиска = СокрЛ(СтрокаПоиска);
	СтрокаПоиска = ?(Лев(СтрокаПоиска, 1) = "+", Сред(СтрокаПоиска, 2), СтрокаПоиска);
	
	Если Не ЗначениеЗаполнено(СтрокаПоиска) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// =======================АНАЛИЗ ВВЕДЕННЫХ СИМВОЛОВ=======================
	НаличиеЦифр    = Ложь;
	КоличествоЦифр = 0;
	НаличиеБукв    = Ложь;
	КоличествоБукв = 0;
	
	Для Индекс = 1 По СтрДлина(СтрокаПоиска) Цикл 
		
		Если Найти("0123456789", Сред(СтрокаПоиска, Индекс, 1)) <> 0 Тогда 
			НаличиеЦифр = Истина;
			КоличествоЦифр = КоличествоЦифр + 1;
		Иначе 
			НаличиеБукв = Истина;
			КоличествоБукв = КоличествоБукв + 1;
		КонецЕсли;
		
	КонецЦикла;	
	
	Если Не ЗначениеЗаполнено(ТипКонтрагента) Тогда
		ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты;
	КонецЕсли;		
	
	// ============ВЫБОРКА ДАННЫХ НА ОСНОВЕ АНАЛИЗА ВВЕДЕННЫХ СИМВОЛОВ=============	
	Если НаличиеБукв И Не НаличиеЦифр Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 20
		|	ВложенныйЗапрос.Ссылка КАК Ссылка,
		|	МИНИМУМ(ВложенныйЗапрос.Индекс) КАК Индекс,
		|	ВложенныйЗапрос.Фамилия КАК Фамилия,
		|	ВложенныйЗапрос.Имя КАК Имя,
		|	ВложенныйЗапрос.Отчество КАК Отчество,
		|	ВложенныйЗапрос.ТекущаяМедицинскаяКартаКод КАК ТекущаяМедицинскаяКартаКод,
		|	ВложенныйЗапрос.ДатаРождения КАК ДатаРождения,
		|	ВложенныйЗапрос.Телефон КАК Телефон
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 20
		|		Контрагенты.Ссылка КАК Ссылка,
		|		1 КАК Индекс,
		|		Контрагенты.Фамилия КАК Фамилия,
		|		Контрагенты.Имя КАК Имя,
		|		Контрагенты.Отчество КАК Отчество,
		|		Контрагенты.ТекущаяМедицинскаяКарта.КодБезНулей КАК ТекущаяМедицинскаяКартаКод,
		|		Контрагенты.ДатаРожденияКлиента КАК ДатаРождения,
		|		Контрагенты.Телефон КАК Телефон
		|	ИЗ
		|		Справочник.Контрагенты КАК Контрагенты
		|	ГДЕ
		|		Контрагенты.ЭтоГруппа = ЛОЖЬ
		|		И Контрагенты.ПометкаУдаления = ЛОЖЬ
		|		И Контрагенты.ТипКонтрагента В(&ТипКонтрагента)
		|		И Контрагенты.Фамилия ПОДОБНО &Поиск
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ ПЕРВЫЕ 20
		|		Контрагенты.Ссылка,
		|		2,
		|		Контрагенты.Фамилия,
		|		Контрагенты.Имя,
		|		Контрагенты.Отчество,
		|		Контрагенты.ТекущаяМедицинскаяКарта.КодБезНулей,
		|		Контрагенты.ДатаРожденияКлиента,
		|		Контрагенты.Телефон
		|	ИЗ
		|		Справочник.Контрагенты КАК Контрагенты
		|	ГДЕ
		|		Контрагенты.ЭтоГруппа = ЛОЖЬ
		|		И Контрагенты.ПометкаУдаления = ЛОЖЬ
		|		И Контрагенты.ТипКонтрагента В(&ТипКонтрагента)
		|		И Контрагенты.Имя ПОДОБНО &Поиск
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ ПЕРВЫЕ 20
		|		Контрагенты.Ссылка,
		|		3,
		|		Контрагенты.Фамилия,
		|		Контрагенты.Имя,
		|		Контрагенты.Отчество,
		|		Контрагенты.ТекущаяМедицинскаяКарта.КодБезНулей,
		|		Контрагенты.ДатаРожденияКлиента,
		|		Контрагенты.Телефон
		|	ИЗ
		|		Справочник.Контрагенты КАК Контрагенты
		|	ГДЕ
		|		Контрагенты.ЭтоГруппа = ЛОЖЬ
		|		И Контрагенты.ПометкаУдаления = ЛОЖЬ
		|		И Контрагенты.ТипКонтрагента В(&ТипКонтрагента)
		|		И Контрагенты.Отчество ПОДОБНО &Поиск
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ ПЕРВЫЕ 20
		|		Контрагенты.Ссылка,
		|		4,
		|		Контрагенты.Фамилия,
		|		Контрагенты.Имя,
		|		Контрагенты.Отчество,
		|		Контрагенты.ТекущаяМедицинскаяКарта.КодБезНулей,
		|		Контрагенты.ДатаРожденияКлиента,
		|		Контрагенты.Телефон
		|	ИЗ
		|		Справочник.Контрагенты КАК Контрагенты
		|	ГДЕ
		|		Контрагенты.ЭтоГруппа = ЛОЖЬ
		|		И Контрагенты.ПометкаУдаления = ЛОЖЬ
		|		И Контрагенты.ТипКонтрагента В(&ТипКонтрагента)
		|		И Контрагенты.Наименование ПОДОБНО &СтрокаПоискаНаименование) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Ссылка,
		|	ВложенныйЗапрос.Фамилия,
		|	ВложенныйЗапрос.Имя,
		|	ВложенныйЗапрос.Отчество,
		|	ВложенныйЗапрос.ТекущаяМедицинскаяКартаКод,
		|	ВложенныйЗапрос.ДатаРождения,
		|	ВложенныйЗапрос.Телефон
		|
		|УПОРЯДОЧИТЬ ПО
		|	Индекс,
		|	Фамилия,
		|	Имя,
		|	Отчество";
				
	ИначеЕсли НаличиеЦифр И Не НаличиеБукв Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 20
		|	ВложенныйЗапрос.Ссылка КАК Ссылка,
		|	МИНИМУМ(ВложенныйЗапрос.Индекс) КАК Индекс,
		|	ВложенныйЗапрос.Фамилия КАК Фамилия,
		|	ВложенныйЗапрос.Имя КАК Имя,
		|	ВложенныйЗапрос.Отчество КАК Отчество,
		|	ВложенныйЗапрос.Телефон КАК Телефон,
		|	ВложенныйЗапрос.ТекущаяМедицинскаяКартаКодБезНулей КАК ТекущаяМедицинскаяКартаКод,
		|	ВложенныйЗапрос.ДатаРожденияКлиента КАК ДатаРождения
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 20
		|		Контрагенты.Ссылка КАК Ссылка,
		|		1 КАК Индекс,
		|		Контрагенты.Фамилия КАК Фамилия,
		|		Контрагенты.Имя КАК Имя,
		|		Контрагенты.Отчество КАК Отчество,
		|		Контрагенты.Телефон КАК Телефон,
		|		Контрагенты.Ссылка.ДатаРожденияКлиента КАК ДатаРожденияКлиента,
		|		Контрагенты.Ссылка.ТекущаяМедицинскаяКарта.КодБезНулей КАК ТекущаяМедицинскаяКартаКодБезНулей
		|	ИЗ
		|		Справочник.Контрагенты КАК Контрагенты
		|	ГДЕ
		|		Контрагенты.Наименование ПОДОБНО &СтрокаПоискаНаименование
		|		И Контрагенты.ЭтоГруппа = ЛОЖЬ
		|		И Контрагенты.ПометкаУдаления = ЛОЖЬ
		|		И Контрагенты.ТипКонтрагента В(&ТипКонтрагента)
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ ПЕРВЫЕ 20
		|		Контрагенты.Ссылка,
		|		2,
		|		Контрагенты.Ссылка.Фамилия,
		|		Контрагенты.Ссылка.Имя,
		|		Контрагенты.Ссылка.Отчество,
		|		Контрагенты.Ссылка.Телефон,
		|		Контрагенты.Ссылка.ДатаРожденияКлиента,
		|		Контрагенты.Ссылка.ТекущаяМедицинскаяКарта.КодБезНулей
		|	ИЗ
		|		Справочник.Контрагенты.КонтактнаяИнформация КАК Контрагенты
		|	ГДЕ
		|		Контрагенты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|		И Контрагенты.Ссылка.ЭтоГруппа = ЛОЖЬ
		|		И Контрагенты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|		И Контрагенты.Ссылка.ТипКонтрагента В(&ТипКонтрагента)
		|		И Контрагенты.НомерТелефона ПОДОБНО &Поиск
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ ПЕРВЫЕ 20
		|		Контрагенты.Ссылка,
		|		3,
		|		Контрагенты.Ссылка.Фамилия,
		|		Контрагенты.Ссылка.Имя,
		|		Контрагенты.Ссылка.Отчество,
		|		Контрагенты.Ссылка.Телефон,
		|		Контрагенты.Ссылка.ДатаРожденияКлиента,
		|		Контрагенты.Ссылка.ТекущаяМедицинскаяКарта.КодБезНулей
		|	ИЗ
		|		Справочник.Контрагенты.КонтактнаяИнформация КАК Контрагенты
		|	ГДЕ
		|		Контрагенты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|		И Контрагенты.Ссылка.ЭтоГруппа = ЛОЖЬ
		|		И Контрагенты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|		И Контрагенты.Ссылка.ТипКонтрагента В(&ТипКонтрагента)
		|		И Контрагенты.НомерТелефонаБезКодаСтраны ПОДОБНО &Поиск
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ ПЕРВЫЕ 20
		|		Контрагенты.Ссылка,
		|		3,
		|		Контрагенты.Ссылка.Фамилия,
		|		Контрагенты.Ссылка.Имя,
		|		Контрагенты.Ссылка.Отчество,
		|		Контрагенты.Ссылка.Телефон,
		|		Контрагенты.Ссылка.ДатаРожденияКлиента,
		|		Контрагенты.Ссылка.ТекущаяМедицинскаяКарта.КодБезНулей
		|	ИЗ
		|		Справочник.Контрагенты.КонтактнаяИнформация КАК Контрагенты
		|	ГДЕ
		|		Контрагенты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|		И Контрагенты.Ссылка.ЭтоГруппа = ЛОЖЬ
		|		И Контрагенты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|		И Контрагенты.Ссылка.ТипКонтрагента В(&ТипКонтрагента)
		|		И Контрагенты.НомерТелефонаПоследниеЦифры ПОДОБНО &Поиск
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ ПЕРВЫЕ 20
		|		Контрагенты.Ссылка,
		|		4,
		|		Контрагенты.Ссылка.Фамилия,
		|		Контрагенты.Ссылка.Имя,
		|		Контрагенты.Ссылка.Отчество,
		|		Контрагенты.Ссылка.Телефон,
		|		Контрагенты.Ссылка.ДатаРожденияКлиента,
		|		Контрагенты.Ссылка.ТекущаяМедицинскаяКарта.КодБезНулей
		|	ИЗ
		|		Справочник.Контрагенты.КонтактнаяИнформация КАК Контрагенты
		|	ГДЕ
		|		Контрагенты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|		И Контрагенты.Ссылка.ЭтоГруппа = ЛОЖЬ
		|		И Контрагенты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|		И Контрагенты.Ссылка.ТипКонтрагента В(&ТипКонтрагента)
		|		И Контрагенты.НомерТелефонаБезКодов ПОДОБНО &Поиск
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		Контрагенты.Ссылка,
		|		6,
		|		Контрагенты.Фамилия,
		|		Контрагенты.Имя,
		|		Контрагенты.Отчество,
		|		Контрагенты.Телефон,
		|		Контрагенты.ДатаРожденияКлиента,
		|		Контрагенты.ТекущаяМедицинскаяКарта.КодБезНулей
		|	ИЗ
		|		Справочник.Контрагенты КАК Контрагенты
		|	ГДЕ
		|		Контрагенты.ТекущаяМедицинскаяКарта.КодБезНулей ПОДОБНО &Поиск
		|		И Контрагенты.Родитель.ТипКонтрагента В(&ТипКонтрагента)
		|		И Контрагенты.ЭтоГруппа = ЛОЖЬ
		|		И Контрагенты.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Ссылка,
		|	ВложенныйЗапрос.Фамилия,
		|	ВложенныйЗапрос.Имя,
		|	ВложенныйЗапрос.Отчество,
		|	ВложенныйЗапрос.Телефон,
		|	ВложенныйЗапрос.ДатаРожденияКлиента,
		|	ВложенныйЗапрос.ТекущаяМедицинскаяКартаКодБезНулей
		|
		|УПОРЯДОЧИТЬ ПО
		|	Индекс,
		|	ВложенныйЗапрос.Фамилия,
		|	ВложенныйЗапрос.Имя,
		|	ВложенныйЗапрос.Отчество";
				
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 20
		|	ВложенныйЗапрос.Ссылка КАК Ссылка,
		|	МИНИМУМ(ВложенныйЗапрос.Индекс) КАК Индекс,
		|	ВложенныйЗапрос.Фамилия КАК Фамилия,
		|	ВложенныйЗапрос.Имя КАК Имя,
		|	ВложенныйЗапрос.Отчество КАК Отчество,
		|	ВложенныйЗапрос.ТекущаяМедицинскаяКартаКод КАК ТекущаяМедицинскаяКартаКод,
		|	ВложенныйЗапрос.ДатаРождения КАК ДатаРождения,
		|	ВложенныйЗапрос.Телефон КАК Телефон
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 20
		|		Контрагенты.Ссылка КАК Ссылка,
		|		1 КАК Индекс,
		|		Контрагенты.Фамилия КАК Фамилия,
		|		Контрагенты.Имя КАК Имя,
		|		Контрагенты.Отчество КАК Отчество,
		|		Контрагенты.ТекущаяМедицинскаяКарта.КодБезНулей КАК ТекущаяМедицинскаяКартаКод,
		|		Контрагенты.ДатаРожденияКлиента КАК ДатаРождения,
		|		Контрагенты.Телефон КАК Телефон
		|	ИЗ
		|		Справочник.Контрагенты КАК Контрагенты
		|	ГДЕ
		|		Контрагенты.Фамилия ПОДОБНО &Поиск
		|		И Контрагенты.ТипКонтрагента В(&ТипКонтрагента)
		|		И Контрагенты.ЭтоГруппа = ЛОЖЬ
		|		И Контрагенты.ПометкаУдаления = ЛОЖЬ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ ПЕРВЫЕ 20
		|		Контрагенты.Ссылка,
		|		2,
		|		Контрагенты.Фамилия,
		|		Контрагенты.Имя,
		|		Контрагенты.Отчество,
		|		Контрагенты.ТекущаяМедицинскаяКарта.КодБезНулей,
		|		Контрагенты.ДатаРожденияКлиента,
		|		Контрагенты.Телефон
		|	ИЗ
		|		Справочник.Контрагенты КАК Контрагенты
		|	ГДЕ
		|		Контрагенты.Имя ПОДОБНО &Поиск
		|		И Контрагенты.ТипКонтрагента В(&ТипКонтрагента)
		|		И Контрагенты.ЭтоГруппа = ЛОЖЬ
		|		И Контрагенты.ПометкаУдаления = ЛОЖЬ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ ПЕРВЫЕ 20
		|		Контрагенты.Ссылка,
		|		3,
		|		Контрагенты.Фамилия,
		|		Контрагенты.Имя,
		|		Контрагенты.Отчество,
		|		Контрагенты.ТекущаяМедицинскаяКарта.КодБезНулей,
		|		Контрагенты.ДатаРожденияКлиента,
		|		Контрагенты.Телефон
		|	ИЗ
		|		Справочник.Контрагенты КАК Контрагенты
		|	ГДЕ
		|		Контрагенты.Отчество ПОДОБНО &Поиск
		|		И Контрагенты.ТипКонтрагента В(&ТипКонтрагента)
		|		И Контрагенты.ЭтоГруппа = ЛОЖЬ
		|		И Контрагенты.ПометкаУдаления = ЛОЖЬ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ ПЕРВЫЕ 20
		|		Контрагенты.Ссылка,
		|		4,
		|		Контрагенты.Фамилия,
		|		Контрагенты.Имя,
		|		Контрагенты.Отчество,
		|		Контрагенты.ТекущаяМедицинскаяКарта.КодБезНулей,
		|		Контрагенты.ДатаРожденияКлиента,
		|		Контрагенты.Телефон
		|	ИЗ
		|		Справочник.Контрагенты КАК Контрагенты
		|	ГДЕ
		|		Контрагенты.Наименование ПОДОБНО &СтрокаПоискаНаименование
		|		И Контрагенты.ТипКонтрагента В(&ТипКонтрагента)
		|		И Контрагенты.ЭтоГруппа = ЛОЖЬ
		|		И Контрагенты.ПометкаУдаления = ЛОЖЬ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ ПЕРВЫЕ 20
		|		Контрагенты.Ссылка,
		|		6,
		|		Контрагенты.Фамилия,
		|		Контрагенты.Имя,
		|		Контрагенты.Отчество,
		|		Контрагенты.ТекущаяМедицинскаяКарта.КодБезНулей,
		|		Контрагенты.ДатаРожденияКлиента,
		|		Контрагенты.Телефон
		|	ИЗ
		|		Справочник.Контрагенты КАК Контрагенты
		|	ГДЕ
		|		Контрагенты.ТекущаяМедицинскаяКарта.КодБезНулей ПОДОБНО &Поиск
		|		И Контрагенты.ТипКонтрагента В(&ТипКонтрагента)
		|		И Контрагенты.ЭтоГруппа = ЛОЖЬ
		|		И Контрагенты.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Ссылка,
		|	ВложенныйЗапрос.Фамилия,
		|	ВложенныйЗапрос.Имя,
		|	ВложенныйЗапрос.Отчество,
		|	ВложенныйЗапрос.ТекущаяМедицинскаяКартаКод,
		|	ВложенныйЗапрос.ДатаРождения,
		|	ВложенныйЗапрос.Телефон
		|
		|УПОРЯДОЧИТЬ ПО
		|	Индекс,
		|	Фамилия,
		|	Имя,
		|	Отчество";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Поиск"         			, СокрЛ(СтрокаПоиска) + "%");
	Запрос.УстановитьПараметр("СтрокаПоискаНаименование", "" + СокрЛ(СтрокаПоиска) + "%");
	Запрос.УстановитьПараметр("ТипКонтрагента"			, ТипКонтрагента);
	
	Если ВыводитьВсе = Истина Тогда	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 20", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Контрагенты.Ссылка.ПометкаУдаления = ЛОЖЬ", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Контрагенты.ПометкаУдаления = ЛОЖЬ", ""); 	
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если ВернутьВыборкуЗапроса = Истина Тогда
		Возврат Результат;
	КонецЕсли;
	
	СписокКонтрагентов = Новый СписокЗначений;
	
	Если Результат.Количество() > РазмерПорции Тогда		
		СписокКонтрагентов.Добавить(Справочники.Контрагенты.ПустаяСсылка(), "Найдено более " + РазмерПорции + " клиентов, уточните поиск.");		
		Возврат СписокКонтрагентов;
	КонецЕсли;
	
	Пока Результат.Следующий() Цикл
 			
		Представление = "" + Результат.Ссылка + 
						?(ЗначениеЗаполнено(Результат.ДатаРождения), ", " + Формат(Результат.ДатаРождения, "ДФ=dd.MM.yyyy") + 
																	 " (" + ВозвратитьВозрастСтрокой(Результат.ДатаРождения) + ")", "") +
		                ?(ВыводитьНомерТелефона И ЗначениеЗаполнено(Результат.Телефон), ", тел.:" + Результат.Телефон, "") +
						?(ВыводитьНомерМедКарты И ЗначениеЗаполнено(Результат.ТекущаяМедицинскаяКартаКод), "      № " + Результат.ТекущаяМедицинскаяКартаКод, "");
				
		СписокКонтрагентов.Добавить(Результат.Ссылка, Представление);
		
	КонецЦикла;
	
	Если СписокКонтрагентов.Количество() = 0 Тогда 
		
		// Добавляем строку создания нового клиента.
		Если ДобавлятьЭлементСоздания И ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты Тогда
			СписокКонтрагентов.Добавить("СоздатьНовогоКлиента", "Пациент не найден. Создать нового пациента.");
		КонецЕсли;
		
		// Добавляем строку переноса нового клиента.
		Если ПереноситьЭлементПоиска Тогда
			СписокКонтрагентов.Добавить("ПеренестиИскомогоКлиента", "Клиент не найден. Создать нового клиента позже.");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СписокКонтрагентов;
	
КонецФункции

// Функция, возвращает ставку НДС по умолчанию
//
Функция ПолучитьСтавкуНДС(СтруктурнаяЕдиница = Неопределено) Экспорт
	
	Если СтруктурнаяЕдиница = Неопределено Тогда
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	Возврат СтруктурнаяЕдиница.Организация.СтавкаНДС;	
	
КонецФункции

// Функция, возвращает ставку НДС для авансов.
//
Функция ПолучитьСтавкуНДСАванс(СтруктурнаяЕдиница = Неопределено) Экспорт
	
	Если СтруктурнаяЕдиница = Неопределено Тогда
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	Организация			= ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтруктурнаяЕдиница, "Организация");
	ДанныеОрганизации	= ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(Организация, "СтавкаНДСДляАвансов, СтавкаНДС");
	
	Возврат ?(ЗначениеЗаполнено(ДанныеОрганизации.СтавкаНДСДляАвансов), ДанныеОрганизации.СтавкаНДСДляАвансов, ДанныеОрганизации.СтавкаНДС);	
	
КонецФункции   

// Функция, возвращает вид налога для авансов.
//
Функция ПолучитьВидНалогаАванс(СтруктурнаяЕдиница = Неопределено) Экспорт
	
	Если СтруктурнаяЕдиница = Неопределено Тогда
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	Организация			= ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтруктурнаяЕдиница, "Организация");
	ДанныеОрганизации	= ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(Организация, "СистемаНалогообложенияДляАвансов, СистемаНалогообложенияДляТоваров");
	
	Возврат ?(ЗначениеЗаполнено(ДанныеОрганизации.СистемаНалогообложенияДляАвансов),
				ДанныеОрганизации.СистемаНалогообложенияДляАвансов, 
				ДанныеОрганизации.СистемаНалогообложенияДляТоваров);	
	
КонецФункции  

// Функция, вернуть текущую структурную единицу
//
Функция ПолучитьТекущуюСтруктурнуюЕдиницу() Экспорт
	
	Возврат ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	
КонецФункции

// Функция ПолучитьЗначениеРеквизита возвращает значение
// реквизита, прочитанного из информационной базы по ссылке на объект.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита - Строка, например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ПолучитьЗначениеРеквизита(Ссылка, ИмяРеквизита) Экспорт
	
	Результат = ПолучитьЗначенияРеквизитов(Ссылка, ИмяРеквизита);
	Возврат Результат[ИмяРеквизита];
	
КонецФункции 

// Функция ПолучитьЗначенияРеквизитов возвращает структуру,
// содержащую значения реквизитов прочитанные из информационной базы
// по ссылке на объект.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИменаРеквизитов - Строка, имена реквизитов перечисленные через запятую,
//               в формате требований к свойствам структуры.
//               Например, "Код, Наименование, Родитель".
// 
// Возвращаемое значение:
//  Структура    - содержит список свойств, как список имен в строке
//                 ИменаРеквизитов, со значениям реквизитов, прочитанных
//                 из информационной базы.
// 
Функция ПолучитьЗначенияРеквизитов(Ссылка, ИменаРеквизитов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
		|	" + ИменаРеквизитов + "
		|ИЗ
		|	" + Ссылка.Метаданные().ПолноеИмя() + " КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Результат = Новый Структура(ИменаРеквизитов);
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

// Функция, проверяет наличие упаковок у номенклатуры и возвращает список упаковок.
//  Параметры:
//   Номенклатура - ссылка номенклатура, позиция номенклатуры, по которой надо получить список упаковок.
//   ДанныеВыбора - структура, выбор данных по упаковкам.
//  Возвращаемое значение:
//   Признак наличия упаковок - булево.
//
Функция ПроверитьИспользованиеУпаковокИПолучитьСписокДляВыбора(Номенклатура, ДанныеВыбора, СтрокаПоиска = Неопределено) Экспорт
	

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Ссылка, НЕОПРЕДЕЛЕНО) КАК Упаковка,
	|	ПРЕДСТАВЛЕНИЕ(УпаковкиНоменклатуры.Ссылка) КАК УпаковкаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(УпаковкиНоменклатуры.Коэффициент) КАК КоэффициентПредставление
	|ИЗ
	|	Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|ГДЕ
	|	УпаковкиНоменклатуры.Владелец = &ВладелецНоменклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	УпаковкиНоменклатуры.Коэффициент,
	|	УпаковкиНоменклатуры.Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ");
	
	Запрос.УстановитьПараметр("ВладелецНоменклатура", Номенклатура);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() = 0 Тогда
		Возврат Ложь;
	Иначе
		Для каждого СтрокаТЗ из ТЗ Цикл
			Если СтрокаТЗ.Упаковка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеВыбора.Добавить(СтрокаТЗ.Упаковка, СтрокаТЗ.УпаковкаПредставление
			+ " (" + СтрокаТЗ.КоэффициентПредставление+ ")");
		КонецЦикла;
	КонецЕсли;
			
	Возврат Истина;
	
КонецФункции

// Функция вернет признак оказания стоматологических услуг
//
Функция ПолучитьПризнакОказанияСтоматологическихУслуг(Сотрудник_ = Неопределено) Экспорт
	ЭтоСтоматологическиеУслуги = Истина;
	Возврат ЭтоСтоматологическиеУслуги;
КонецФункции

// Процедура, выполняет инициализацию реквизита "ХарактеристикиИспользуются" ТЧ "Запасы"
//
Процедура ЗаполнитьПризнакИспользованияХарактеристик(Запасы) Экспорт
	
	Если Запасы.Количество() > 0 Тогда					
		Если Запасы[0].Свойство("Номенклатура") Тогда
			ВыбираемоеПоле = "Номенклатура";
		ИначеЕсли Запасы[0].Свойство("НСМНоменклатура") Тогда
			ВыбираемоеПоле = "НСМНоменклатура";
		ИначеЕсли Запасы[0].Свойство("СННоменклатура") Тогда
			ВыбираемоеПоле = "СННоменклатура";
		Иначе
			ВыбираемоеПоле = "Сертификат";	
		КонецЕсли;		
	КонецЕсли;
	
	Для Каждого СтрокаЗапасы из Запасы Цикл 		
		СтрокаЗапасы.ХарактеристикиИспользуются = СтрокаЗапасы[ВыбираемоеПоле].ИспользоватьПартии;				
	КонецЦикла;
	
КонецПроцедуры

// Функция ИнформационнаяБазаФайловая определяет режим эксплуатации
// информационной базы файловый (Истина) или Серверный (Ложь).
//  При проверке используется СтрокаСоединенияИнформационнойБазы, которую
// можно указать явно.
//
// Параметры:
//  СтрокаСоединенияИнформационнойБазы - Строка - параметр используется, если
//                 нужно проверить строку соединения не текущей информационной базы.
//
// Возвращаемое значение:
//  Булево.
//
Функция ИнформационнаяБазаФайловая(Знач СтрокаСоединенияИнформационнойБазы = "") Экспорт
			
	Если ПустаяСтрока(СтрокаСоединенияИнформационнойБазы) Тогда
		СтрокаСоединенияИнформационнойБазы =  СтрокаСоединенияИнформационнойБазы();
	КонецЕсли;
	Возврат Найти(Врег(СтрокаСоединенияИнформационнойБазы), "FILE=") = 1;
	
КонецФункции 

&НаСервере
// Функция возвращает значение константы
//
Функция ПолучитьЗначениеКонстанты(ИмяКонстанты, ИмяРеквизита = "") Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	Константы."+ИмяКонстанты+" КАК Константа
	                      |ИЗ
	                      |	Константы КАК Константы");
	Выборка = Запрос.Выполнить().Выбрать();
	Если  Выборка.Следующий() Тогда
		Возврат ?(ЗначениеЗаполнено(ИмяРеквизита), Выборка.Константа[ИмяРеквизита], Выборка.Константа); 
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция возвращающая символьный код валюты
// данные берутся и константы ВалютаУчета
Функция ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти() Экспорт
	
	ТекущаяВалюта    = Константы.ВалютаУчета.Получить();
	СтрокаПараметров = СтрЗаменить(ТекущаяВалюта.ПараметрыПрописи, ",", Символы.ПС);
	ЦелаяЧасть       = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров,10));
	Если  ЦелаяЧасть ="" тогда
		Возврат " "+Строка(ТекущаяВалюта)+" ";
	Иначе Возврат " "+ЦелаяЧасть+" ";
	Конецесли;
	
КонецФункции

// Функция возвращает сивольный код дробной части используемой валюты.
// 
Функция ПолучитьСимвольныйКодИспользуемойВалютыДробнойЧасти() Экспорт
	
	ТекущаяВалюта    = Константы.ВалютаУчета.Получить();
	СтрокаПараметров = СтрЗаменить(ТекущаяВалюта.ПараметрыПрописи, ",", Символы.ПС);
	ЦелаяЧасть       = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров,11));
	Если  ЦелаяЧасть = "" тогда
		Возврат "";
	Иначе Возврат " "+ЦелаяЧасть+" ";
	Конецесли;
	
КонецФункции

// Функции вовращащие соращенное наименование текущей валюты  целой и дробной части(руб. коп.)
//
Функция ПолучитьСимвольныйКодЦелойчастиВалюты(ВалютаПоУмолчанию = "Руб.", ВернутьМеждународныйСимвол = Ложь) Экспорт
	
	ТекущаяВалюта = Константы.ВалютаУчета.Получить();
	Если НЕ ЗначениеЗаполнено(ТекущаяВалюта) Тогда
		Возврат  " " + ВалютаПоУмолчанию + " ";
	КонецЕсли;
	
	ТекущаяВалютаСтруктура = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ТекущаяВалюта, "СимвольноеПредставление, ПараметрыПрописи");
	
	Если ВернутьМеждународныйСимвол Тогда 
		Если ЗначениеЗаполнено(СокрЛП(ТекущаяВалютаСтруктура.СимвольноеПредставление)) Тогда 
			Возврат " " + СокрЛП(ТекущаяВалютаСтруктура.СимвольноеПредставление) + " ";
		КонецЕсли;	
	КонецЕсли;
	
	СтрокаПараметров = СтрЗаменить(ТекущаяВалютаСтруктура.ПараметрыПрописи, ",", Символы.ПС);
	ЦелаяЧасть = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров,10));
	Если ЦелаяЧасть = "" тогда
		Возврат Строка(ТекущаяВалюта);
	Иначе 
		Возврат ЦелаяЧасть;
	Конецесли;
	
КонецФункции

// Функция, возвращает символьный код валюты
//  Параметры:
//    Нет;
//
Функция ПолучитьСимвольныйКодДробнойчастВалюты() Экспорт
	
	ТекущаяВалюта = Константы.ВалютаУчета.Получить();
	СтрокаПараметров = СтрЗаменить(ТекущаяВалюта.ПараметрыПрописи, ",", Символы.ПС);
	ЦелаяЧасть = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров,11));
	Если  ЦелаяЧасть = "" Тогда
		// Возврат " коп. ";
		Возврат "";
	Иначе Возврат " "+ЦелаяЧасть+" ";
	Конецесли;
	
КонецФункции

// Функция возвращает символьное представление используемой валюты.
// 
Функция ПолучитьСимвольноеПредставлениеВалюты() Экспорт
	
	Валюта = Константы.ВалютаУчета.Получить();	
	Если НЕ ЗначениеЗаполнено(Валюта) ИЛИ ТипЗнч(Валюта)<>Тип("СправочникСсылка.Валюты") Тогда
		Возврат "";
	КонецЕсли; 
	
	Если Валюта.СимвольноеПредставление <> "" Тогда	
		Возврат Валюта.СимвольноеПредставление;
	Иначе
		СтрокаПараметров = СтрЗаменить(Валюта.ПараметрыПрописи, ",", Символы.ПС);
		ЦелаяЧасть       = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров,10));
		Возврат ?(ЦелаяЧасть ="", " "+Строка(Валюта)+" ", " "+ЦелаяЧасть+" ");
	КонецЕсли;
	
КонецФункции 

// Модифицирована слиянием механизма БСП с неким, используемым ранее
// 
Функция ЕстьРеквизитОбъекта(ИмяРеквизита, МетаданныеОбъекта = Неопределено, Объект = Неопределено) Экспорт
	
	Если МетаданныеОбъекта = Неопределено И НЕ Объект = Неопределено Тогда 
		КлючУникальности   = Новый УникальныйИдентификатор;
		СтруктураРеквизита = Новый Структура(ИмяРеквизита, КлючУникальности);
		ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Объект);
		
		Возврат СтруктураРеквизита[ИмяРеквизита] <> КлючУникальности;
		
	ИначеЕсли НЕ МетаданныеОбъекта = Неопределено Тогда
		
		Возврат НЕ (МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита) = Неопределено);
		
	КонецЕсли;
		
	Возврат Ложь;		

КонецФункции

// Модифицирована слиянием механизма БСП с неким, используемым ранее
// 
Функция ЕстьРеквизитОбъектаМодифицирована(ИмяРеквизита, МетаданныеОбъекта = Неопределено, Объект = Неопределено) Экспорт
	
	Если МетаданныеОбъекта = Неопределено И НЕ Объект = Неопределено Тогда 
		КлючУникальности   = Новый УникальныйИдентификатор;
		СтруктураРеквизита = Новый Структура(ИмяРеквизита, КлючУникальности);
		ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Объект);
		
		Возврат СтруктураРеквизита[ИмяРеквизита] <> КлючУникальности;
		
	ИначеЕсли НЕ МетаданныеОбъекта = Неопределено Тогда
		
		Возврат НЕ (МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита) = Неопределено);
		
	КонецЕсли;
		
	Возврат Ложь;		

КонецФункции

// Функция - Есть реквизит формы
//
// Параметры:
//  Объект		 - 	 - 
//  ИмяРеквизита - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЕстьРеквизитФормы(Объект, ИмяРеквизита) Экспорт
	
	КлючУникальности   = Новый УникальныйИдентификатор;

	СтруктураРеквизита = Новый Структура(ИмяРеквизита, КлючУникальности);

	ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Объект);
	
	Возврат СтруктураРеквизита[ИмяРеквизита] <> КлючУникальности;
	
КонецФункции

#Область ПроцедурыОтносящиесяКОбработкеЗаполненияОбъектов


// Процедура предназначена для заполнения общих реквизитов документов,
// вызывается в обработчиках событий "ОбработкаЗаполнения" И "ПриКопировании"
// в модулях объектов всех документов.
//
// Параметры:
//
// 1. Объект                 - объект редактируемого документа,
// 2. ПараметрКопирования    - указывает что документ создан копированием
// 3. ПараметрыЗаполнения    - ссылка на документ сонование
//
Процедура ЗаполнитьРеквизитыОбъектаПоУмолчанию(Объект, ПараметрКопирования = Неопределено, ПараметрыЗаполнения = Неопределено, ОбщиеПараметры = Неопределено) Экспорт
	
	Пользователь        = ТекущийПользователь();
	МетаданныеДокумента = Объект.Ссылка.Метаданные();
	// РазрешеноПроведение = МетаданныеДокумента.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить;
	
	ПараметрЗначениеКопирования = Неопределено;
	ПараметрыЗначенияЗаполнения = Новый Структура;	
	Если ПараметрКопирования = Неопределено Тогда 
		Если ПараметрыЗаполнения <> Неопределено Тогда 
			Если ТипЗнч(ПараметрыЗаполнения) = Тип("Структура") Тогда 
				Если ПараметрыЗаполнения.Свойство("Отбор") Тогда 
					ПараметрыЗначенияЗаполнения = ПараметрыЗаполнения.Отбор;
				Иначе 
					ПараметрыЗначенияЗаполнения = ПараметрыЗаполнения;
				КонецЕсли;	
			КонецЕсли;		
		КонецЕсли;
	Иначе 
		ПараметрЗначениеКопирования = ПараметрКопирования.Ссылка;
	КонецЕсли;
		
	// Заполнение реквизитов по-умолчанию
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если НЕ ЗначениеЗаполнено(ПараметрЗначениеКопирования) Тогда
			
			Контрагент = ПолучитьИмяРеквизитаКонтрагент(МетаданныеДокумента);
			Если ОбщиеПараметры = Неопределено ИЛИ НЕ ОбщиеПараметры.Свойство("ПараметрыЗаполнения") Тогда
				Если Контрагент <> Неопределено Тогда 
					Если НЕ ЗначениеЗаполнено(Объект[Контрагент]) Тогда
						ЗаполнитьРеквизитКонтрагент(Объект, МетаданныеДокумента, ПараметрыЗначенияЗаполнения, Контрагент);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если Контрагент <> Неопределено Тогда
				КартаКлиента = ПолучитьИмяРеквизитаКартаКлиента(МетаданныеДокумента);
				Если КартаКлиента <> Неопределено Тогда				
					ЗаполнитьРеквизитКартаКлиента(Объект, МетаданныеДокумента, ПараметрыЗначенияЗаполнения, КартаКлиента, Контрагент);
				КонецЕсли;
			КонецЕсли;	
							
			Если ЕстьРеквизитДокумента("СервисSMSРассылки", МетаданныеДокумента) И НЕ ЗначениеЗаполнено(Объект.СервисSMSРассылки) Тогда
				Объект.СервисSMSРассылки = Константы.СервисSMSРассылкиПоУмолчанию.Получить();									
			КонецЕсли;
			
			Если ЕстьРеквизитДокумента("СтруктурнаяЕдиница", МетаданныеДокумента) И НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
				ЗаполнитьРеквизитСтруктурнаяЕдиница(Объект, ПараметрыЗначенияЗаполнения);									
			КонецЕсли;
			
			Если ЕстьРеквизитДокумента("Организация", МетаданныеДокумента) И НЕ ЗначениеЗаполнено(Объект.Организация) Тогда 
				ЗначениеНастройки = ПользователиСтоматология.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнаяОрганизация");
				Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
					Объект.Организация = ЗначениеНастройки;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
					Если ЕстьРеквизитДокумента("СтруктурнаяЕдиница", МетаданныеДокумента) И ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) И ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница.Организация) Тогда 
						Объект.Организация = Объект.СтруктурнаяЕдиница.Организация;
					ИначеЕсли ЗначениеЗаполнено(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница) Тогда 					
						Объект.Организация = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.Организация;                                         
					КонецЕсли;
				КонецЕсли;
			КонецЕсли; 

			Если ЕстьРеквизитДокумента("СтруктурнаяЕдиницаПолучатель", МетаданныеДокумента) И НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаПолучатель) Тогда
				Объект.СтруктурнаяЕдиницаПолучатель = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;									
			КонецЕсли;			
			
			Если ЕстьРеквизитДокумента("БанковскийСчет", МетаданныеДокумента) И НЕ ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда 
				ЗаполнитьРеквизитБанковскийСчет(Объект, ПараметрыЗначенияЗаполнения)				
			КонецЕсли;
			
			Если ЕстьРеквизитДокумента("Касса", МетаданныеДокумента) И НЕ ЗначениеЗаполнено(Объект.Касса) Тогда
				ЗаполнитьРеквизитКасса(Объект, Пользователь, ПараметрыЗначенияЗаполнения);					
			КонецЕсли; 			
			
			Если ЕстьРеквизитДокумента("ЭквайрингТерминал", МетаданныеДокумента) И НЕ ЗначениеЗаполнено(Объект.ЭквайрингТерминал) Тогда
				Объект.ЭквайрингТерминал  = Справочники.ЭквайринговыеТерминалы.ПолучитьЭквайринговыйТерминалПоУмолчанию(Объект.Касса);					
			КонецЕсли;
			
			Если ЕстьРеквизитДокумента("КассоваяСмена", МетаданныеДокумента) И НЕ ЗначениеЗаполнено(Объект.КассоваяСмена) Тогда
				СостояниеКассовойСмены = РозничныеПродажи.ПолучитьСостояниеКассовойСмены(Объект.Касса);
				Если СостояниеКассовойСмены <> Неопределено Тогда
					Объект.КассоваяСмена = СостояниеКассовойСмены.КассоваяСмена;
				КонецЕсли;
			КонецЕсли;
			
			Если ЕстьРеквизитДокумента("СотрудникРегистрации", МетаданныеДокумента) И НЕ ЗначениеЗаполнено(Объект.СотрудникРегистрации) И НЕ (ТипЗнч(Объект) = Тип("СправочникОбъект.Контрагенты") И Объект.ЭтоГруппа) Тогда
				Объект.СотрудникРегистрации = ПараметрыСеанса.ТекущийПользователь;
			КонецЕсли;
			
			Если ЕстьРеквизитДокумента("Сотрудник", МетаданныеДокумента) И НЕ ЗначениеЗаполнено(Объект.Сотрудник) Тогда
				ЗаполнитьРеквизитСотрудник(Объект, ПараметрыЗначенияЗаполнения);				
			КонецЕсли;
			
			Если ЕстьРеквизитДокумента("Ассистент", МетаданныеДокумента) И НЕ ЗначениеЗаполнено(Объект.Ассистент) Тогда
				ЗаполнитьРеквизитАссистент(Объект, ПараметрыЗначенияЗаполнения);				
			КонецЕсли;
			
			Если ЕстьРеквизитДокумента("Склад", МетаданныеДокумента) И НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
				ЗаполнитьРеквизитСклад(Объект, МетаданныеДокумента, Пользователь, ПараметрыЗначенияЗаполнения);
			КонецЕсли;
			
			Если ЕстьРеквизитДокумента("ШаблонОбследования", МетаданныеДокумента) И НЕ ЗначениеЗаполнено(Объект.ШаблонОбследования) И ЗначениеЗаполнено(Объект.Контрагент) Тогда
				ЗаполнитьРеквизитШаблонОбследования(Объект);
			КонецЕсли;
			
			Если ЕстьРеквизитДокумента("Статус", МетаданныеДокумента) И НЕ ЗначениеЗаполнено(Объект.Статус) Тогда
				ЗаполнитьРеквизитСтатус(Объект);
			КонецЕсли;
			
			// Заполним автора документа
			Если ЕстьРеквизитДокумента("АвторДокумента", МетаданныеДокумента) Тогда
				Объект.АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
			КонецЕсли;   			
			
			// Заполним автора документа
			Если ЕстьРеквизитДокумента("Автор", МетаданныеДокумента) Тогда
				Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
			КонецЕсли;
			
		   // Заполним статьи документа
		   Если ЕстьРеквизитДокумента("ВидОперации", МетаданныеДокумента) И ЕстьРеквизитДокумента("Статья", МетаданныеДокумента)
			  И ЗначениеЗаполнено(Объект.ВидОперации) И Не ЗначениеЗаполнено(Объект.Статья) Тогда
				Объект.Статья = Справочники.СтатьиДоходовИРасходов.ПолучитьСтатьюПоУмолчаниюДляОперации(Объект.ВидОперации);
			КонецЕсли;

		ИначеЕсли ЕстьРеквизитДокумента("АвторДокумента", МетаданныеДокумента) Тогда
			Объект.АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
		ИначеЕсли ЕстьРеквизитДокумента("Автор", МетаданныеДокумента) Тогда
			Объект.Автор = ПараметрыСеанса.ТекущийПользователь;			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьШапкуДокумента()

// Процедура, осуществляет заполнение реквизита СтруктурнаяЕдиница
//
Процедура ЗаполнитьРеквизитСтруктурнаяЕдиница(Объект, ПараметрыЗначенияЗаполнения)
	
	Если ПараметрыЗначенияЗаполнения <> Неопределено Тогда
		Если ПараметрыЗначенияЗаполнения.Свойство("СтруктурнаяЕдиница") Тогда 
			Если ЗначениеЗаполнено(ПараметрыЗначенияЗаполнения.СтруктурнаяЕдиница) Тогда 
				Объект.СтруктурнаяЕдиница = ПараметрыЗначенияЗаполнения.СтруктурнаяЕдиница;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ВсеСсылки = Справочники.ТипВсеСсылки(); 
	Если НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) И ((ВсеСсылки.СодержитТип(ТипЗнч(Объект.Ссылка)) И НЕ Объект.ЭтоГруппа) ИЛИ НЕ ВсеСсылки.СодержитТип(ТипЗнч(Объект.Ссылка))) Тогда 
		Объект.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;									
	КонецЕсли;	
	
КонецПроцедуры

// Процедура, осуществляет заполнение реквизита Касса
//
Процедура ЗаполнитьРеквизитКасса(Объект, Пользователь, ПараметрыЗначенияЗаполнения)
	
	Если ПараметрыЗначенияЗаполнения <> Неопределено Тогда
		Если ПараметрыЗначенияЗаполнения.Свойство("Касса") Тогда 
			Если ЗначениеЗаполнено(ПараметрыЗначенияЗаполнения.Касса) Тогда 
				Объект.Касса = ПараметрыЗначенияЗаполнения.Касса;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Касса) Тогда 
		ЗначениеНастройки = ПользователиСтоматология.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнаяКасса", Объект.СтруктурнаяЕдиница);				
		Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
			Объект.Касса = ЗначениеНастройки;
		Иначе	
			Объект.Касса =  Объект.СтруктурнаяЕдиница.ОсновнаяКасса;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

// Процедура, осуществляет заполнение реквизита БанковскийСчет
//
Процедура ЗаполнитьРеквизитКартаКлиента(Объект, МетаданныеДокумента, ПараметрыЗначенияЗаполнения, КартаКлиента, Контрагент)
	
	Если ЗначениеЗаполнено(Объект[Контрагент]) Тогда
		Если НЕ ЗначениеЗаполнено(Объект[КартаКлиента]) Тогда			
			Если ПараметрыЗначенияЗаполнения <> Неопределено Тогда 
				Если ПараметрыЗначенияЗаполнения.Свойство(КартаКлиента) Тогда
					Объект[КартаКлиента] = ПараметрыЗначенияЗаполнения[КартаКлиента];					
				КонецЕсли;	
			КонецЕсли;	
			
			Если Не ЗначениеЗаполнено(Объект[КартаКлиента]) Тогда	
				Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект[Контрагент]) Тогда 
					Объект[КартаКлиента] = Справочники.Карты.ПолучитьКартуКлиента(Объект[Контрагент]);
				КонецЕсли;	
			КонецЕсли;			
		КонецЕсли;	
	Иначе
		Объект[КартаКлиента] = Справочники.Карты.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

// Процедура, осуществляет заполнение реквизита БанковскийСчет
//
Процедура ЗаполнитьРеквизитБанковскийСчет(Объект, ПараметрыЗначенияЗаполнения)
	
	Если ПараметрыЗначенияЗаполнения <> Неопределено Тогда 
		Если ПараметрыЗначенияЗаполнения.Свойство("БанковскийСчет") Тогда
			Объект.БанковскийСчет = ПараметрыЗначенияЗаполнения.БанковскийСчет;					
		КонецЕсли;	
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда 	
		Объект.БанковскийСчет = Объект.СтруктурнаяЕдиница.Организация.БанковскийСчетПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

// Процедура, осуществляет заполнение реквизита Сотрудник
//
Процедура ЗаполнитьРеквизитСотрудник(Объект, ПараметрыЗначенияЗаполнения)
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств") 
		ИЛИ ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.СписаниеДенежныхСредств") Тогда 					
		Объект.Сотрудник = Неопределено;
	ИначеЕсли ПараметрыЗначенияЗаполнения <> Неопределено Тогда 
		Если ПараметрыЗначенияЗаполнения.Свойство("Сотрудник") Тогда
			Объект.Сотрудник = ПараметрыЗначенияЗаполнения.Сотрудник;					
		КонецЕсли;	
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.Сотрудник) Тогда 	
		Объект.Сотрудник = ПараметрыСеанса.ТекущийПользователь.Сотрудник;
	КонецЕсли;
	
КонецПроцедуры

//
//
Процедура ЗаполнитьРеквизитАссистент(Объект, ПараметрыЗначенияЗаполнения)
	
	Если ПараметрыЗначенияЗаполнения <> Неопределено Тогда 
		Если ПараметрыЗначенияЗаполнения.Свойство("Ассистент") Тогда
			Объект.Ассистент = ПараметрыЗначенияЗаполнения.Ассистент;					
		КонецЕсли;	
	КонецЕсли;
		
КонецПроцедуры

// Процедура, осуществляет заполнение реквизита Контрагент
//
Процедура ЗаполнитьРеквизитКонтрагент(Объект, МетаданныеДокумента, ПараметрыЗначенияЗаполнения, Контрагент)
	
	Если ПараметрыЗначенияЗаполнения <> Неопределено Тогда 
		Если ПараметрыЗначенияЗаполнения.Свойство(Контрагент) И ПараметрыЗначенияЗаполнения[Контрагент] <> Неопределено Тогда			
			Если ЕстьРеквизитДокумента("ВидОперации", МетаданныеДокумента) Тогда
				Если ЗначениеЗаполнено(Объект.ВидОперации) Тогда  
					Если Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратПоставщику ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ОплатаПоставщику ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыОтПоставщика Тогда 
						Если НЕ ПараметрыЗначенияЗаполнения[Контрагент].ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты Тогда 
							Объект[Контрагент] = ПараметрыЗначенияЗаполнения[Контрагент];
						КонецЕсли;	
					ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыКлиенту Тогда 
						Если ПараметрыЗначенияЗаполнения[Контрагент].ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты Тогда
							Объект[Контрагент] = ПараметрыЗначенияЗаполнения[Контрагент];
						КонецЕсли;
					ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ПоступлениеИзБанка ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ПрочееПоступление ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОтПодотчетника
						ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.СдачаНаличныхВБанк ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ПрочееСписание ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ВыдачаПодотчетнику Тогда
						Объект[Контрагент] = Справочники.Контрагенты.ПустаяСсылка();										
					Иначе 
						Объект[Контрагент] = ПараметрыЗначенияЗаполнения[Контрагент];
					КонецЕсли;
				Иначе
					Объект[Контрагент] = ПараметрыЗначенияЗаполнения[Контрагент];
				КонецЕсли;	
			Иначе 
				Объект[Контрагент] = ПараметрыЗначенияЗаполнения[Контрагент];
			КонецЕсли;			
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры	

// Процедура, осуществляет заполнение реквизита склад
//
Процедура ЗаполнитьРеквизитСклад(Объект, МетаданныеДокумента, Пользователь, ПараметрыЗначенияЗаполнения)
	
	ЗначениеНастройки = ПользователиСтоматология.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнойСклад", Объект.СтруктурнаяЕдиница);
	
	Если ПараметрыЗначенияЗаполнения <> Неопределено Тогда 
		Если ПараметрыЗначенияЗаполнения.Свойство("Склад") Тогда
			Если ЕстьРеквизитДокумента("ВидОперации", МетаданныеДокумента) Тогда
				Если ЗначениеЗаполнено(Объект.ВидОперации) Тогда  
					Если Объект.ВидОперации = Перечисления.ВидыОпераций.ПоСкладу ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ПеремещениеМеждуСкладами ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ПередачаСотруднику Тогда 
						Если ТипЗнч(ПараметрыЗначенияЗаполнения.Склад) = Тип("СправочникСсылка.Склады") Тогда 
							Объект.Склад = ПараметрыЗначенияЗаполнения.Склад;
						ИначеЕсли ЗначениеЗаполнено(ЗначениеНастройки) Тогда 
							Объект.Склад = ЗначениеНастройки;
						КонецЕсли;	
					ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ПоСотруднику ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОтСотрудника ИЛИ Объект.ВидОперации = Перечисления.ВидыОпераций.ПеремещенияМеждуСотрудниками Тогда 
						Если ТипЗнч(ПараметрыЗначенияЗаполнения.Склад) = Тип("СправочникСсылка.Сотрудники") Тогда
							Объект.Склад = ПараметрыЗначенияЗаполнения.Склад;
						// ИначеЕсли ЗначениеЗаполнено(ЗначениеНастройки) Тогда 
						//	Объект.Склад = ЗначениеНастройки;
						КонецЕсли;						
					Иначе 
						Объект.Склад = ПараметрыЗначенияЗаполнения.Склад;
					КонецЕсли;
				Иначе
					Объект.Склад = ПараметрыЗначенияЗаполнения.Склад;
				КонецЕсли;	
			Иначе 
				Объект.Склад = ПараметрыЗначенияЗаполнения.Склад;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.Склад) Тогда 	
		Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
			Объект.Склад = ЗначениеНастройки;
		ИначеЕсли ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда  
			Объект.Склад = Объект.СтруктурнаяЕдиница.ОсновнойСклад;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

// Процедура, осуществляет заполнение реквизита статус
//
Процедура ЗаполнитьРеквизитСтатус(Объект)
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПланЛечения") Тогда 
		Объект.Статус = Перечисления.СтатусыПланЛечения.Рассматривается;
	КонецЕсли;
	
КонецПроцедуры	

// Заполнить реквизит ШаблонОбследования приема
//
Процедура ЗаполнитьРеквизитШаблонОбследования(Объект)
	
	Если ОбщегоНазначенияСтоматология.ПолучитьПризнакОказанияСтоматологическихУслуг(Объект.Сотрудник) = Истина Тогда
		Если Объект.ЭтоПервичныйПациентДляВрача = Истина Тогда
			Объект.ШаблонОбследования = Справочники.ШаблоныОбследований.ПервичныйСтоматологическийОсмотр;
		Иначе
			Объект.ШаблонОбследования = Справочники.ШаблоныОбследований.ПовторныйСтоматологическийОсмотр;
        КонецЕсли;
	Иначе	
		Объект.ШаблонОбследования = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизитаСотрудника(Объект.Сотрудник, Объект.СтруктурнаяЕдиница , "ОсновнойШаблонОбследований");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Функция, формирует сводный отчет при запуске системы
//  Параметры:
// 
Функция ФормироватьСводныйОтчетПриЗапуске() Экспорт
	
	Если ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.ДниРождения, Ложь)
		ИЛИ ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.КритическиеОстатки, Ложь)
		ИЛИ ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.ЛистОжидания, Ложь) Тогда	
		Возврат Истина;	
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

// Позволяет определить есть ли среди реквизитов шапки документа
// реквизит с переданным именем.
//
// Параметры: 
//  ИмяРеквизита - строковое имя искомого реквизита, 
//  МетаданныеДокумента - объект описания метаданных документа, среди реквизитов которого производится поиск.
//
// Возвращаемое значение:
//  Истина - нашли реквизит с таким именем, Ложь - не нашли.
//
Функция ЕстьРеквизитДокумента(ИмяРеквизита, МетаданныеДокумента)  Экспорт 

	Возврат НЕ (МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизита) = Неопределено);

КонецФункции // ЕстьРеквизитДокумента()

// Функция, определяет, есть ли среди табличных частей, табличная часть с данным именем.
//  Параметры:
//   ИмяТабЧасти - строковое имя искомой табличной части, 
//   МетаданныеДокумента - объект описания метаданных документа, среди табличных частей которого производится поиск.
//
//  Возвращаемое значение:
//   Истина - нашли табличную часть с таким именем, Ложь - не нашли.
//  
Функция ЕстьТабличнаяЧастьДокумента(ИмяТабЧасти, МетаданныеДокумента) Экспорт
	
	 Возврат НЕ (МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабЧасти) = Неопределено);
	
КонецФункции

// Функция ПолучитьЗначениеРеквизита возвращает значение.
// реквизита, прочитанного из информационной базы по ссылке на объект.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита - Строка, например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ПолучитьЗначениеРеквизитаСотрудника(Ссылка, СтруктурнаяЕдиница, ИмяРеквизита) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НастройкиСотрудников."+ИмяРеквизита+"
	                      |ИЗ
	                      |	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	                      |ГДЕ
	                      |	НастройкиСотрудников.Сотрудник = &Сотрудник
	                      |	И НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
	Запрос.УстановитьПараметр("Сотрудник", Ссылка);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Новый Структура(ИмяРеквизита);
	Если Выборка.Следующий() Тогда		
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	Иначе
		Результат.Вставить(ИмяРеквизита, Неопределено);
	КОнецЕсли;
	
	Возврат Результат[ИмяРеквизита];
	
КонецФункции 

// Функция - Получить значения реквизитов сотрудника
//
// Параметры:
//  Ссылка				 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//  ИменаРеквизитов		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЗначенияРеквизитовСотрудника(Сотрудник, СтруктурнаяЕдиница, ИменаРеквизитов) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	" + ИменаРеквизитов + "
	                      |ИЗ
	                      |	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	                      |ГДЕ
	                      |	НастройкиСотрудников.Сотрудник = &Сотрудник
	                      |	И НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Результат = Новый Структура(ИменаРеквизитов);
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

//
//
Функция ПолучитьИмяРеквизитаКонтрагент(МетаданныеДокумента)
	
	Если ЕстьРеквизитДокумента("Контрагент", МетаданныеДокумента) Тогда
		Возврат "Контрагент";
	ИначеЕсли ЕстьРеквизитДокумента("Клиент", МетаданныеДокумента) Тогда
		Возврат "Клиент";
	ИначеЕсли ЕстьРеквизитДокумента("КлиентИсточник", МетаданныеДокумента) Тогда
		Возврат "КлиентИсточник";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

//
//
Функция ПолучитьИмяРеквизитаКартаКлиента(МетаданныеДокумента)
	
	Если ЕстьРеквизитДокумента("КартаКлиента", МетаданныеДокумента) Тогда
		Возврат "КартаКлиента";
	ИначеЕсли ЕстьРеквизитДокумента("Карта", МетаданныеДокумента) Тогда
		Возврат "Карта";
	ИначеЕсли ЕстьРеквизитДокумента("КартаКонтрагента", МетаданныеДокумента) Тогда
		Возврат "КартаКонтрагента";
	ИначеЕсли ЕстьРеквизитДокумента("КартаИсточник", МетаданныеДокумента) Тогда
		Возврат "КартаИсточник";
	ИначеЕсли ЕстьРеквизитДокумента("КартаКлиента", МетаданныеДокумента) Тогда
		Возврат "КартаКлиента";		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция возвращает ссылку на текущего пользователя базы данных,
// установленного по учетной записи пользователя конфигурации.
//
// Возвращаемое значение:
//  СправочникСсылка.Пользователи
//
Функция ТекущийПользователь() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат ПараметрыСеанса.ТекущийСотрудник;
	
КонецФункции 

// Функция возвращает объект метаданных по полному имени
//
// Не обрабатываются точки маршрутов бизнес-процессов.
//
// Параметры:
//  ПолноеИмя    - Строка, полное имя объекта метаданных,
//                 например, "Справочник.Организации".
//
// Возвращаемое значение:
//  ОбъектМетаданных
// 
Функция ПолучитьОбъектМетаданныхПоПолномуИмени(ПолноеИмя) Экспорт
	
	ЧастиИмени = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолноеИмя, ".");
	
	КлассОМ = ЧастиИмени[0];
	ИмяОМ	= ЧастиИмени[1];
	
	Если      ВРег(КлассОМ) = "СПРАВОЧНИК" Тогда
		Возврат Метаданные.Справочники[ИмяОМ];
	ИначеЕсли ВРег(КлассОМ) = "ДОКУМЕНТ" Тогда
		Возврат Метаданные.Документы[ИмяОМ];
	ИначеЕсли ВРег(КлассОМ) = "БИЗНЕСПРОЦЕСС" Тогда
		Возврат Метаданные.БизнесПроцессы[ИмяОМ];
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВХАРАКТЕРИСТИК" Тогда
		Возврат Метаданные.ПланыВидовХарактеристик[ИмяОМ];
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНСЧЕТОВ" Тогда
		Возврат Метаданные.ПланыСчетов[ИмяОМ];
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВРАСЧЕТА" Тогда
		Возврат Метаданные.ПланЫВидовРасчета[ИмяОМ];
	ИначеЕсли ВРег(КлассОМ) = "ЗАДАЧА" Тогда
		Возврат Метаданные.Задачи[ИмяОМ];
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНОБМЕНА" Тогда
		Возврат Метаданные.ПланыОбмена[ИмяОМ];
	ИначеЕсли ВРег(КлассОМ) = "ПЕРЕЧИСЛЕНИЕ" Тогда
		Возврат Метаданные.Перечисления[ИмяОМ];
	ИначеЕсли ВРег(КлассОМ) = "ОБРАБОТКА" Тогда
		Возврат Метаданные.Обработки[ИмяОМ];
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Неизвестный тип объекта метаданных (%1)'"), КлассОМ);
	КонецЕсли;
	
КонецФункции // МенеджерОбъектаПоПолномуИмени()

// Процедура, выполняет стандартные действия перед записью документов.
//
Процедура ПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	                 
	МетаданныеДокумента = Источник.Метаданные();	
	Если ЕстьРеквизитДокумента("СуммаДокумента", МетаданныеДокумента) Тогда		
		СуммаДокумента = 0;
		ОбновитьСумму  = Ложь;
		Если ЕстьТабличнаяЧастьДокумента("Запасы", МетаданныеДокумента) Тогда
			СуммаДокумента = Источник.Запасы.Итог("Сумма");
			ОбновитьСумму  = Истина;
		КонецЕсли;		
		Если ЕстьТабличнаяЧастьДокумента("Расходы", МетаданныеДокумента) Тогда
			СуммаДокумента = СуммаДокумента + Источник.Расходы.Итог("Сумма");
			ОбновитьСумму  = Истина;
		КонецЕсли;		
		Если ЕстьТабличнаяЧастьДокумента("Лечение", МетаданныеДокумента) Тогда   
			Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.Прием") Тогда
				СуммаДокумента = СуммаДокумента + Источник.Лечение.Итог("Всего");   
			Иначе
				СуммаДокумента = СуммаДокумента + Источник.Лечение.Итог("Сумма");
			КонецЕсли;	
			ОбновитьСумму  = Истина;
		КонецЕсли;
		Если ЕстьТабличнаяЧастьДокумента("Услуги", МетаданныеДокумента) Тогда
			СуммаДокумента = СуммаДокумента + Источник.Услуги.Итог("Сумма");
			ОбновитьСумму  = Истина;
		КонецЕсли;	
		Если ОбновитьСумму Тогда
		     Источник.СуммаДокумента = СуммаДокумента;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура добавления данных перед изменением/перед записью.
//
Процедура ДобавлениеДанныхПередИзменениемПередЗаписью(Источник, Отказ, РежимЗаписи = Неопределено, РежимПроведения = Неопределено) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Добавляем данные которые были перед записью
	Источник.ДополнительныеСвойства.Вставить("ДанныеПередЗаписью", Новый Структура);
	Для каждого РеквизитМетаданные Из Источник.Метаданные().СтандартныеРеквизиты Цикл
		Источник.ДополнительныеСвойства.ДанныеПередЗаписью.Вставить(РеквизитМетаданные.Имя, Источник.Ссылка[РеквизитМетаданные.Имя]);
	КонецЦикла;
	Для каждого РеквизитМетаданные Из Источник.Метаданные().Реквизиты Цикл
		Источник.ДополнительныеСвойства.ДанныеПередЗаписью.Вставить(РеквизитМетаданные.Имя, Источник.Ссылка[РеквизитМетаданные.Имя]);
		Если РеквизитМетаданные.Имя = "ИдентификаторДиалога" Тогда 
			Если Источник.Ссылка[РеквизитМетаданные.Имя] <> Источник[РеквизитМетаданные.Имя] Тогда 
				Источник.ДополнительныеСвойства.Вставить("РаботаСЧатБотом", Истина);
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	Для каждого РеквизитМетаданные Из Источник.Метаданные().ТабличныеЧасти Цикл
		Источник.ДополнительныеСвойства.ДанныеПередЗаписью.Вставить(РеквизитМетаданные.Имя, Источник.Ссылка[РеквизитМетаданные.Имя].Выгрузить());
	КонецЦикла;	
	
	Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Источник.Ссылка)) Тогда
		Источник.ДополнительныеСвойства.ДанныеПередЗаписью.Вставить("РежимЗаписи", РежимЗаписи);
	КонецЕсли;
	
	Источник.ДополнительныеСвойства.ДанныеПередЗаписью.Вставить("ЭтоНовый", Источник.ЭтоНовый());
	
КонецПроцедуры

// Процедура получает доступные СтруктурныеЕдиницы
//
Функция ДоступныеСтруктурныеЕдиницы() Экспорт
	
	Запрос = Новый Запрос( 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ИЗ
	|	Справочник.Сотрудники.ДоступныеСтруктурныеЕдиницы КАК СотрудникиДоступныеСтруктурныеЕдиницы
	|ГДЕ
	|	СотрудникиДоступныеСтруктурныеЕдиницы.Ссылка = &Сотрудник
	|	И НЕ СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.ТекущийСотрудник);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат  РезультатЗапроса.ВыгрузитьКолонку("СтруктурнаяЕдиница");
	
КонецФункции

// Функция, возвращает коэффициент для упаковки.
//  Параметры:
//    Упаковка - справочник ссылка "Упаковки номенклатуры", по которому надо вернуть коэффициент.
//  Возвращаемое значение:
//    коэффициент - число.
//
Функция ВернутьКоэффициентУпаковки(Упаковка) Экспорт
	
	Возврат ?(Не ЗначениеЗаполнено(Упаковка.Коэффициент), 1, Упаковка.Коэффициент); 
	
КонецФункции

// Функция возращает номенклатуру и упаковку по штрихкоду.
//
Функция ВернутьНоменклатуруПоШтрихкоду(ДанныеШтрихкода, СообщатьОбОшибки = Истина) Экспорт
	
	 ДанныеПоШтрихкодам = РегистрыСведений.Штрихкоды.ПолучитьДанныеПоШтрихкодам(ДанныеШтрихкода);
	 Если ДанныеПоШтрихкодам.Свойство("Объект") Тогда
		 Возврат ДанныеПоШтрихкодам;		 
	 Иначе
		 Если СообщатьОбОшибки = Истина Тогда
			 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Номенклатура со штриховым кодом "+ДанныеШтрихкода+" не найдена");
		 КонецЕсли;
		 Возврат Неопределено;
	 КонецЕсли;
	
КонецФункции

&НаСервере
// Функция, выполняет проверку типа номенклатуры
//
Функция ПроверитьТипНоменклатуры(Документ, Номенклатура) Экспорт
	
	Если (ТипЗнч(Документ) = Тип("ДокументСсылка.ОприходованиеЗапасов") ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.Поступление") 
			или ТипЗнч(Документ) = Тип("ДокументСсылка.ИнвентаризацияЗапасов") или ТипЗнч(Документ) = Тип("ДокументСсылка.СписаниеЗапасов") 
			или ТипЗнч(Документ) = Тип("ДокументСсылка.ВозвратОтПокупателя") или ТипЗнч(Документ) = Тип("ДокументСсылка.ВозвратПоставщику") 
			или ТипЗнч(Документ) = Тип("ДокументСсылка.ПеремещениеЗапасов")) 
			И (Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Запас
			И Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Материал
			И Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.ПодарочныйСертификат) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В данном документе нельзя добавлять "+Номенклатура.ТипНоменклатуры);
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
	
КонецФункции

//
//
Функция ПолучитьМассивЗубов(Детская) Экспорт
	
	Массив = Новый Массив();
	
	Если Детская Тогда
		Массив.Добавить(Перечисления.Зубы.Зуб51);
		Массив.Добавить(Перечисления.Зубы.Зуб52);
		Массив.Добавить(Перечисления.Зубы.Зуб53);
		Массив.Добавить(Перечисления.Зубы.Зуб54);
		Массив.Добавить(Перечисления.Зубы.Зуб55);
		
		Массив.Добавить(Перечисления.Зубы.Зуб61);
		Массив.Добавить(Перечисления.Зубы.Зуб62);
		Массив.Добавить(Перечисления.Зубы.Зуб63);
		Массив.Добавить(Перечисления.Зубы.Зуб64);
		Массив.Добавить(Перечисления.Зубы.Зуб65);
		
		Массив.Добавить(Перечисления.Зубы.Зуб81);
		Массив.Добавить(Перечисления.Зубы.Зуб82);
		Массив.Добавить(Перечисления.Зубы.Зуб83);
		Массив.Добавить(Перечисления.Зубы.Зуб84);
		Массив.Добавить(Перечисления.Зубы.Зуб85);
		
		Массив.Добавить(Перечисления.Зубы.Зуб71);
		Массив.Добавить(Перечисления.Зубы.Зуб72);
		Массив.Добавить(Перечисления.Зубы.Зуб73);
		Массив.Добавить(Перечисления.Зубы.Зуб74);
		Массив.Добавить(Перечисления.Зубы.Зуб75);
	Иначе
		Массив = Новый Массив;
		Массив.Добавить(Перечисления.Зубы.Зуб38);
		Массив.Добавить(Перечисления.Зубы.Зуб37);
		Массив.Добавить(Перечисления.Зубы.Зуб36);
		Массив.Добавить(Перечисления.Зубы.Зуб35);
		Массив.Добавить(Перечисления.Зубы.Зуб34);
		Массив.Добавить(Перечисления.Зубы.Зуб33);
		Массив.Добавить(Перечисления.Зубы.Зуб32);
		Массив.Добавить(Перечисления.Зубы.Зуб31);
		Массив.Добавить(Перечисления.Зубы.Зуб41);
		Массив.Добавить(Перечисления.Зубы.Зуб42);
		Массив.Добавить(Перечисления.Зубы.Зуб43);
		Массив.Добавить(Перечисления.Зубы.Зуб44);
		Массив.Добавить(Перечисления.Зубы.Зуб45);
		Массив.Добавить(Перечисления.Зубы.Зуб46);
		Массив.Добавить(Перечисления.Зубы.Зуб47);
		Массив.Добавить(Перечисления.Зубы.Зуб48);
		
		Массив.Добавить(Перечисления.Зубы.Зуб28);
		Массив.Добавить(Перечисления.Зубы.Зуб27);
		Массив.Добавить(Перечисления.Зубы.Зуб26);
		Массив.Добавить(Перечисления.Зубы.Зуб25);
		Массив.Добавить(Перечисления.Зубы.Зуб24);
		Массив.Добавить(Перечисления.Зубы.Зуб23);
		Массив.Добавить(Перечисления.Зубы.Зуб22);
		Массив.Добавить(Перечисления.Зубы.Зуб21);
		Массив.Добавить(Перечисления.Зубы.Зуб11);
		Массив.Добавить(Перечисления.Зубы.Зуб12);
		Массив.Добавить(Перечисления.Зубы.Зуб13);
		Массив.Добавить(Перечисления.Зубы.Зуб14);
		Массив.Добавить(Перечисления.Зубы.Зуб15);
		Массив.Добавить(Перечисления.Зубы.Зуб16);
		Массив.Добавить(Перечисления.Зубы.Зуб17);
		Массив.Добавить(Перечисления.Зубы.Зуб18);	
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции 

// Функция, возвращает состав набора
//
Функция ПолучитьСоставНабора(Набор) Экспорт
	
	Массив = Новый Массив();
	Для Каждого СтрокаТЧ из Набор.СоставНабора Цикл
		Массив.Добавить(Новый Структура("Номенклатура, Количество",СтрокаТЧ.СННоменклатура, СтрокаТЧ.СНКоличество)); 
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

// Процедура возвращает сумму запланированных оплат пациента
//
Функция ВернутьЗапланированныеОплаты(Контрагент = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланыЛечения.Период КАК Период,
	|	ПланыЛечения.Регистратор КАК Документ,
	|	ПланыЛечения.Регистратор.Сотрудник КАК Сотрудник,
	|	ПланыЛечения.Контрагент КАК Контрагент,
	|	ПланыЛечения.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СУММА(ПланыЛечения.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ТаблицаПланируемыеОплаты
	|ИЗ
	|	РегистрНакопления.ПланыЛечения КАК ПланыЛечения
	|ГДЕ
	|	ПланыЛечения.Контрагент = &Контрагент
	|	И ПланыЛечения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ВЫБОР
	|			КОГДА ПланыЛечения.Регистратор ССЫЛКА Документ.ПланЛечения
	|				ТОГДА ПланыЛечения.Регистратор.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланЛечения.Принят)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланыЛечения.Регистратор,
	|	ПланыЛечения.Контрагент,
	|	ПланыЛечения.Период,
	|	ПланыЛечения.СтруктурнаяЕдиница,
	|	ПланыЛечения.Регистратор.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НарядЗаказЗапасы.Ссылка.Дата,
	|	НарядЗаказЗапасы.Ссылка,
	|	НарядЗаказЗапасы.Ссылка.Сотрудник,
	|	НарядЗаказЗапасы.Ссылка.Контрагент,
	|	НарядЗаказЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	СУММА(НарядЗаказЗапасы.СуммаПродажи)
	|ИЗ
	|	Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
	|ГДЕ
	|	НарядЗаказЗапасы.Ссылка.Контрагент = &Контрагент
	|	И НарядЗаказЗапасы.Ссылка.Проведен
	|	И НЕ НарядЗаказЗапасы.Ссылка.ПометкаУдаления
	|	И НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.ПланЛечения.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	НарядЗаказЗапасы.Ссылка,
	|	НарядЗаказЗапасы.Ссылка.Контрагент,
	|	НарядЗаказЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	НарядЗаказЗапасы.Ссылка.Дата,
	|	НарядЗаказЗапасы.Ссылка.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентами.Контрагент КАК Контрагент,
	|	ВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВзаиморасчетыСКонтрагентами.ДокументАванса.Сотрудник КАК Сотрудник,
	|	ВзаиморасчетыСКонтрагентами.ДокументАванса КАК ДокументАванса,
	|	СУММА(ВзаиморасчетыСКонтрагентами.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ТаблицаФактическиеОплаты
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами КАК ВзаиморасчетыСКонтрагентами
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентами.Контрагент = &Контрагент
	|	И ВзаиморасчетыСКонтрагентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И НЕ ВзаиморасчетыСКонтрагентами.ДокументАванса = ЗНАЧЕНИЕ(Документ.ПланЛечения.ПустаяСсылка)
	|	И НЕ ВзаиморасчетыСКонтрагентами.ДокументАванса = ЗНАЧЕНИЕ(Документ.НарядЗаказ.ПустаяСсылка)
	|	И НЕ ВзаиморасчетыСКонтрагентами.ДокументАванса = НЕОПРЕДЕЛЕНО
	|	И ВЫБОР
	|			КОГДА ВзаиморасчетыСКонтрагентами.ДокументАванса ССЫЛКА Документ.ПланЛечения
	|				ТОГДА ВзаиморасчетыСКонтрагентами.ДокументАванса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланЛечения.Принят)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыСКонтрагентами.Контрагент,
	|	ВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница,
	|	ВзаиморасчетыСКонтрагентами.ДокументАванса,
	|	ВзаиморасчетыСКонтрагентами.ДокументАванса.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТаблицаПланируемыеОплаты.Период, ГОД) КАК Год,
	|	НАЧАЛОПЕРИОДА(ТаблицаПланируемыеОплаты.Период, МЕСЯЦ) КАК Месяц,
	|	НАЧАЛОПЕРИОДА(ТаблицаПланируемыеОплаты.Период, НЕДЕЛЯ) КАК Неделя,
	|	НАЧАЛОПЕРИОДА(ТаблицаПланируемыеОплаты.Период, ДЕНЬ) КАК День,
	|	НАЧАЛОПЕРИОДА(ТаблицаПланируемыеОплаты.Период, КВАРТАЛ) КАК Квартал,
	|	ТаблицаПланируемыеОплаты.Период КАК Период,
	|	ТаблицаПланируемыеОплаты.Документ КАК Документ,
	|	ТаблицаПланируемыеОплаты.Сотрудник КАК Сотрудник,
	|	ТаблицаПланируемыеОплаты.Контрагент КАК Контрагент,
	|	ТаблицаПланируемыеОплаты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СУММА(ТаблицаПланируемыеОплаты.Сумма) КАК СуммаПланируемойОплаты,
	|	СУММА(ЕСТЬNULL(ТаблицаФактическиеОплаты.Сумма, 0)) КАК СуммаФактическойОплаты,
	|	СУММА(ТаблицаПланируемыеОплаты.Сумма - ЕСТЬNULL(ТаблицаФактическиеОплаты.Сумма, 0)) КАК ПланируемыйОстаток
	|ИЗ
	|	ТаблицаПланируемыеОплаты КАК ТаблицаПланируемыеОплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаФактическиеОплаты КАК ТаблицаФактическиеОплаты
	|		ПО ТаблицаПланируемыеОплаты.Документ = ТаблицаФактическиеОплаты.ДокументАванса
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПланируемыеОплаты.Сотрудник,
	|	ТаблицаПланируемыеОплаты.Период,
	|	ТаблицаПланируемыеОплаты.Документ,
	|	ТаблицаПланируемыеОплаты.Контрагент,
	|	ТаблицаПланируемыеОплаты.СтруктурнаяЕдиница";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);  
		
	Таблица = Запрос.Выполнить().Выгрузить();	 
	
	Если Таблица.Количество() > 0 Тогда 
		Возврат Таблица.Итог("ПланируемыйОстаток");
	Иначе 
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Функция возвращает строку только с цифрами
//
Функция ТолькоЦифры(Строка) Экспорт
	
  СтрокаЧисел = "";

   Для Индекс = 1 По СтрДлина(Строка) Цикл
   
      Символ = Сред(Строка, Индекс, 1); // Перебираем все сиволы из нашей строки

      Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда // Код нуля - 48, код 9-ки - 57
         СтрокаЧисел = СтрокаЧисел + Символ;
      КонецЕсли;
   
   КонецЦикла;

   Возврат СтрокаЧисел;	
	
КонецФункции

// Функция  складывает дату и время
//
Функция СложитьДатуИВремя(Дата,Время)Экспорт
	
	Возврат  Дата(Год(Дата),Месяц(Дата),День(Дата)) + ПолучитьВремяВСекундах(Время);	
		
КонецФункции	

// Функция вернет представление времени в секундах
//
Функция ПолучитьВремяВСекундах(Время)Экспорт

     Возврат (ДеньГода(Время)-1)*24*60*60+((Час(Время)*60)*60)+(Минута(Время)*60);
	
 КонецФункции

// Функция ПолучитьЗначениеРеквизита возвращает значение
// реквизита, прочитанного из информационной базы по ссылке на объект.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита - Строка, например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ПолучитьЗначениеРеквизитаПоПути(Ссылка, ПутьКРеквизиту) Экспорт
	
	Результат = Неопределено;
	Выполнить("Результат = Ссылка." + ПутьКРеквизиту);
	
	Возврат Результат;
	
КонецФункции

// Функция выполняет открытие кассовой смены на сервере.
//
Функция ОткрытьКассовуюСменуНаСервереБезКонтекста(Касса, ОписаниеОшибки = "")  Экспорт 
	
	Возврат РозничныеПродажи.ОткрытьКассовуюСмену(Касса, ОписаниеОшибки);
	
КонецФункции // ОткрытьКассовуюСменуНаСервере()

// Процедура выполняет закрытие кассовой смены на сервере.
//
Функция ЗакрытьКассовуюСменуНаСервереБезКонтекста(Касса, ОшибкаПриСнятииZОтчета, ОписаниеОшибки = "") Экспорт
	
	Возврат РозничныеПродажи.ВыполнитьОперациюЗакрытияКассовойСмены(Касса, ОшибкаПриСнятииZОтчета, ОписаниеОшибки);
	
КонецФункции // ЗакрытьКассовуюСменуНаСервере()

// Процедура устанавливает видимость закладок скидки/наценки и подарки в форме документа.
//
Процедура УстановитьОтображениеЗакладокСкидкиНаценкиПодарки(Форма, ПолучатьДанныеИзФормы = Ложь) Экспорт
	
	Объект = ?(ПолучатьДанныеИзФормы, Форма, Форма.Объект);
	
	// Закладка скидки/наценки.
	Если Форма.Элементы.Найти("ГруппаСкидкиНаценки") <> Неопределено Тогда	
		
		ЭтоФормаРеализации = СтрНайти(Форма.ИмяФормы, "Реализация") > 0 Или СтрНайти(Форма.ИмяФормы, "Прием") > 0;
		КоличествоСтрокСкидкиНаценки = ?(ЭтоФормаРеализации,
										Объект.СкидкиНаценки.НайтиСтроки(Новый Структура("ПризнакОплатыБонусом", Ложь)).Количество(), 
										Объект.СкидкиНаценки.Количество());
		
		Форма.Элементы.Группа_Кнопки_СкидкиНаценки.Видимость = КоличествоСтрокСкидкиНаценки > 0;
	КонецЕсли;
	
	// Закладки подарки.
	Если Форма.Элементы.Найти("ГруппаПодарки") <> Неопределено
		И Форма.Элементы.Найти("_Подарки") <> Неопределено Тогда
		
		Форма.Элементы.Группа_Кнопки_Подарки.Видимость = Объект.Подарки.Количество() > 0;
	КонецЕсли;
	
	// Учтенные Авансы.
	Если Форма.Элементы.Найти("ГруппаУчтенныеАвансы") <> Неопределено
		И Форма.Элементы.Найти("_УчтенныеАвансы") <> Неопределено Тогда
		
		Форма.Элементы.Группа_Кнопки_УчтенныеАвансы.Видимость = Объект.УчтенныеАвансы.Количество() > 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет отправку смс сообщения на сайт smsmm.ru.
//  Параметры:
//   ДокументСсылка: ссылка на докумет, который выполняет отправку смс.
//   
Процедура ОтправитьSMSПоДокументу(Документ, ПереотправитьНедоставленные = Истина, Отказ = Ложь) Экспорт
	
	// Подключаем обработку сервиса
	ОбработкаСервисSMSРассылки = ОбщегоНазначенияСтоматология.ОбработкаСервисаSMSРассылки(Документ.СервисSMSРассылки);
	Если ОбработкаСервисSMSРассылки = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Выгружаем номера получателей SMS
	Получатели = РегистрыСведений.СтатусыСообщений.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	Получатели.Колонки.Добавить("Содержание");		
	Для Каждого Получатель Из Документ.Получатели Цикл
		НоваяСтрока = Получатели.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Получатель, "КлючСтроки, НомерТелефона");
		НоваяСтрока.Содержание = Документы.РассылкаСообщений.ПреобразоватьСодержаниеСПараметрамиВТекст(Документ.Содержание, Документ, Получатель.Получатель);				
	КонецЦикла;
	
	// Удаляем строки из ПолучателейSMS, которым SMS уже было отправленно
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатусыSMSСообщенийСрезПоследних.КлючСтроки,
		|	СтатусыSMSСообщенийСрезПоследних.IDСообщения,
		|	СтатусыSMSСообщенийСрезПоследних.СтатусСообщения,
		|	СтатусыSMSСообщенийСрезПоследних.СтатусДействия
		|ИЗ
		|	РегистрСведений.СтатусыСообщений.СрезПоследних(, КлючСтроки В (&МассикКлючСтроки)) КАК СтатусыSMSСообщенийСрезПоследних
		|ГДЕ
		|	НЕ (СтатусыSMSСообщенийСрезПоследних.IDСообщения = """"
		|	ИЛИ (&ПереотправитьНедоставленные И СтатусыSMSСообщенийСрезПоследних.СтатусДействия = -2))";
	Запрос.УстановитьПараметр("МассикКлючСтроки", Получатели.ВыгрузитьКолонку("КлючСтроки"));
	Запрос.УстановитьПараметр("ПереотправитьНедоставленные", ПереотправитьНедоставленные);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультат Из Результат Цикл
		Пока Получатели.Найти(СтрокаРезультат.КлючСтроки, "КлючСтроки") <> Неопределено Цикл
			Получатели.Удалить(Получатели.Найти(СтрокаРезультат.КлючСтроки, "КлючСтроки"));
		КонецЦикла;
	КонецЦикла;	
	
	// Отправка запроса
	ПолучателиСодержание = Получатели.Скопировать();
	ПолучателиСодержание.Свернуть("Содержание");
	ПолучателиСодержание = ПолучателиСодержание.ВыгрузитьКолонку("Содержание");
	
	Для Каждого СодержаниеЭлемент Из ПолучателиСодержание Цикл
		ВременнаяПолучатели = Получатели.Скопировать(Получатели.НайтиСтроки(Новый Структура("Содержание", СодержаниеЭлемент)));
		ВыдаватьСообщенияОбОшибке = (Найти(Документ.Комментарий, "{Сформирован автоматически}") = 0);
		Результат = ОбработкаСервисSMSРассылки.ОтправитьSMS(СодержаниеЭлемент, ВременнаяПолучатели, ВыдаватьСообщенияОбОшибке);
		Если ВыдаватьСообщенияОбОшибке И Отказ = Ложь Тогда
			Отказ = Не Результат;
		КонецЕсли;
		Для Каждого СтрокаТЗ Из ВременнаяПолучатели Цикл
			НайденнаяСтрока = Получатели.Найти(СтрокаТЗ.КлючСтроки, "КлючСтроки");
			ЗаполнитьЗначенияСвойств(НайденнаяСтрока, СтрокаТЗ);
		КонецЦикла;
	КонецЦикла;	
	Получатели.ЗаполнитьЗначения(ТекущаяДата(), "Период");
	
	// Проведение по регистру
	ТекущиеДвижениеПоРегистру = РегистрыСведений.СтатусыСообщений.СоздатьНаборЗаписей();
	ТекущиеДвижениеПоРегистру.Прочитать();
	ТекущиеДвижениеПоРегистру = ТекущиеДвижениеПоРегистру.Выгрузить();
	
	ДвижениеПоРегистру = РегистрыСведений.СтатусыСообщений.СоздатьНаборЗаписей();
	Для Каждого СтрокаТЗ Из Получатели Цикл
		СтруктураПоиска = Новый Структура("КлючСтроки, СтатусДействия, СтатусСообщения, IDСообщения, НомерТелефона", СтрокаТЗ.КлючСтроки, СтрокаТЗ.СтатусДействия, СтрокаТЗ.СтатусСообщения, СтрокаТЗ.IDСообщения, СтрокаТЗ.НомерТелефона);
		Если ТекущиеДвижениеПоРегистру.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
			НоваяСтрока = ДвижениеПоРегистру.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);			
		КонецЕсли;
	КонецЦикла;
	Если ДвижениеПоРегистру.Количество() > 0 Тогда
		ДвижениеПоРегистру.Записать(Ложь);
	КонецЕсли;
			
КонецПроцедуры // ОтправитьSMSПоДокументу()

&НаСервере
// Процедура, выполняет отправку смс сообщения на сайт smsmm.ru.
//  Параметры:
//   ДокументСсылка: ссылка на докумет, который выполняет отправку смс.
//   
Процедура ПроверитьСтатусыSMSПоДокументу(Документ, Отказ = Ложь) Экспорт

	// Подключаем обработку сервиса
	ОбработкаСервисSMSРассылки = ОбщегоНазначенияСтоматология.ОбработкаСервисаSMSРассылки(Документ.СервисSMSРассылки);
	Если ОбработкаСервисSMSРассылки = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Выгружаем номера получателей SMS
	Получатели = РегистрыСведений.СтатусыСообщений.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	Для Каждого ПолучательSMS Из Документ.Получатели Цикл
		НоваяСтрока = Получатели.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПолучательSMS, "КлючСтроки");
		// Если Документ.ПолучателиSMS.Колонки.Найти("IDСообщения") <> Неопределено Тогда
		//	НоваяСтрока.IDСообщения = ПолучательSMS.IDСообщения;
		// КонецЕсли;
	КонецЦикла;
	
	// Удаляем строки из ПолучателейSMS, которые проверять нет смысла или уже проверенны
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатусыSMSСообщенийСрезПоследних.КлючСтроки,
		|	СтатусыSMSСообщенийСрезПоследних.IDСообщения,
		|	СтатусыSMSСообщенийСрезПоследних.СтатусСообщения,
		|	СтатусыSMSСообщенийСрезПоследних.СтатусДействия
		|ИЗ
		|	РегистрСведений.СтатусыСообщений.СрезПоследних(, КлючСтроки В (&МассикКлючСтроки)) КАК СтатусыSMSСообщенийСрезПоследних
		|ГДЕ
		|	СтатусыSMSСообщенийСрезПоследних.IDСообщения = """"
		|	ИЛИ СтатусыSMSСообщенийСрезПоследних.СтатусДействия <> 0";
	Запрос.УстановитьПараметр("МассикКлючСтроки", Получатели.ВыгрузитьКолонку("КлючСтроки"));
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультат Из Результат Цикл
		Пока Получатели.Найти(СтрокаРезультат.КлючСтроки, "КлючСтроки") <> Неопределено Цикл
			Получатели.Удалить(Получатели.Найти(СтрокаРезультат.КлючСтроки, "КлючСтроки"));
		КонецЦикла;
	КонецЦикла;
	
	// Заполняем IDСообщение и номер если необходимо
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатусыSMSСообщенийСрезПоследних.КлючСтроки,
		|	СтатусыSMSСообщенийСрезПоследних.IDСообщения,
		|	СтатусыSMSСообщенийСрезПоследних.НомерТелефона
		|ИЗ
		|	РегистрСведений.СтатусыСообщений.СрезПоследних(, КлючСтроки В (&МассикКлючСтроки)) КАК СтатусыSMSСообщенийСрезПоследних";
	Запрос.УстановитьПараметр("МассикКлючСтроки", Получатели.ВыгрузитьКолонку("КлючСтроки"));
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ПолучательSMS Из Получатели Цикл
		СтрокаРезультата = Результат.Найти(ПолучательSMS.КлючСтроки, "КлючСтроки");
		Если Не ЗначениеЗаполнено(ПолучательSMS.IDСообщения) И СтрокаРезультата <> Неопределено Тогда
			ПолучательSMS.IDСообщения = СтрокаРезультата.IDСообщения;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ПолучательSMS.НомерТелефона) И СтрокаРезультата <> Неопределено Тогда
			ПолучательSMS.НомерТелефона = СтрокаРезультата.НомерТелефона;
		КонецЕсли;		
	КонецЦикла;	
	
	// Отправка запроса
	Отказ = Не ОбработкаСервисSMSРассылки.ПолучитьСтатусSMS(Получатели);
	Получатели.ЗаполнитьЗначения(ТекущаяДата(), "Период");
	
	// Проведение по регистру
	ТекущиеДвижениеПоРегистру = РегистрыСведений.СтатусыСообщений.СоздатьНаборЗаписей();
	ТекущиеДвижениеПоРегистру.Прочитать();
	ТекущиеДвижениеПоРегистру = ТекущиеДвижениеПоРегистру.Выгрузить();
	
	ДвижениеПоРегистру = РегистрыСведений.СтатусыСообщений.СоздатьНаборЗаписей();
	Для Каждого СтрокаТЗ Из Получатели Цикл
		СтруктураПоиска = Новый Структура("КлючСтроки, СтатусДействия, СтатусСообщения, IDСообщения, НомерТелефона", СтрокаТЗ.КлючСтроки, СтрокаТЗ.СтатусДействия, СтрокаТЗ.СтатусСообщения, СтрокаТЗ.IDСообщения, СтрокаТЗ.НомерТелефона);
		Если ТекущиеДвижениеПоРегистру.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
			НоваяСтрока = ДвижениеПоРегистру.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);			
		КонецЕсли;
	КонецЦикла;
	Если ДвижениеПоРегистру.Количество() > 0 Тогда
		ДвижениеПоРегистру.Записать(Ложь);
	КонецЕсли;

КонецПроцедуры // ПроверитьСтатусыSMSПоДокументу()

&НаСервере
// Функция, возвращает текущий остаток денежных средств по отправке смс-сообщений.
//  Параметры:
//
Функция ПолучитьБалансАккаунтаSMS(СервисSMSРассылки = Неопределено, ПоказыватьСообщения = Истина) Экспорт

	ОбработкаСервисSMSРассылки = ОбщегоНазначенияСтоматология.ОбработкаСервисаSMSРассылки(СервисSMSРассылки, ПоказыватьСообщения);
	Если ОбработкаСервисSMSРассылки = Неопределено Тогда
		Возврат Новый Структура("Баланс, Валюта", Неопределено, Неопределено);
	КонецЕсли;
	
	СтруктураОтвета = ОбработкаСервисSMSРассылки.ПолучитьБалансАккаунтаSMS(ПоказыватьСообщения);
	
	Возврат СтруктураОтвета;
	
КонецФункции // ПолучитьБалансАккаунтаSMS()

&НаСервере
// Процедура, выполняет отправку смс сообщения на сайт smsmm.ru.
//  Параметры:
//   ДокументСсылка: ссылка на докумет, который выполняет отправку смс.
//   
Функция ОбработкаСервисаSMSРассылки(СервисSMSРассылкиСсылка, ПоказыватьСообщения = Истина) Экспорт

	// Если Не ЗначениеЗаполнено(СервисSMSРассылкиСсылка) Тогда 
	//	СервисSMSРассылкиСсылка = Константы.СервисSMSРассылкиПоУмолчанию.Получить();
	// КонецЕсли;
	
	Если СервисSMSРассылкиСсылка.Пустая() Тогда
		Если ПоказыватьСообщения = Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет доступных обработок сервисов SMS-рассылки");
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяВнешнейОбработкиСервиса = СервисSMSРассылкиСсылка.ИмяОбработки;
	
	НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(СервисSMSРассылкиСсылка, "ХранилищеОбработки");
	ИмяВнешнейОбработкиСервиса = ВнешниеОбработки.Подключить(НавигационнаяСсылка, , Ложь);
	ОбработкаСервиса = ВнешниеОбработки.Создать(ИмяВнешнейОбработкиСервиса);
	
	ОбработкаСервиса.Пользователь = СервисSMSРассылкиСсылка.Пользователь;
	ОбработкаСервиса.Пароль = СервисSMSРассылкиСсылка.Пароль;
	ОбработкаСервиса.Подпись = СервисSMSРассылкиСсылка.Подпись;	
		                         
	Возврат ОбработкаСервиса;
	
КонецФункции // ОбработкаСервисаSMSРассылки()

// Получает и возвращает макет компоновки данных для схемы компоновки
//
// Параметры:
//  СхемаКомпоновки - схема компоновки данных, для которой получается макет компоновки
//  Настройки - настройки компоновки, применяемые к схеме
//
// Возвращаемое значение:
//  Макет компоновки данных
//
Функция ПолучитьМакетКомпоновки(СхемаКомпоновки, Настройки) Экспорт

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	Возврат КомпоновщикМакета.Выполнить(СхемаКомпоновки, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

КонецФункции

// Получает и возвращает запрос из переданного макета компоновки данных
//
// Параметры:
//  Макет - макет компоновки данных, из которого требуется получить запрос.
//  ИмяНабораДанных - имя набора данных из макета, для которого получается запрос.
//
// Возвращаемое значение:
//  Запрос, сформированный на основании макета компоновки
//
Функция ПолучитьЗапросИзМакетаКомпоновки(Макет, ИмяНабораДанных) Экспорт

	Запрос = Новый Запрос(Макет.НаборыДанных[ИмяНабораДанных].Запрос);

	Для Каждого Параметр Из Макет.ЗначенияПараметров Цикл
		Запрос.УстановитьПараметр(Параметр.Имя, Параметр.Значение);
	КонецЦикла;

	Возврат Запрос;

КонецФункции

// Вернет сотрудника являющегося ответсвенным в данной организации по данному типу должности
//
Функция ПолучитьСрезПоследнихПоОтветсвеннымЛицам(Организация, ТипОтветственногоЛица, НаДату = Неопределено, ПолучитьСотрудника = Ложь) Экспорт
	
	СтруктураВыборки = Новый Структура();
	СтруктураВыборки.Вставить("Организация"			  , Организация);
	СтруктураВыборки.Вставить("ТипОтветственногоЛица" , ТипОтветственногоЛица);
	
	Если НаДату <> Неопределено Тогда
		ТаблицаЗначений = РегистрыСведений.ОтветственныеЛица.СрезПоследних(НаДату, СтруктураВыборки);		 
		Если ПолучитьСотрудника Тогда
			Возврат ?(ЗначениеЗаполнено(ТаблицаЗначений), ТаблицаЗначений[0].Сотрудник, Неопределено);
		Иначе
			Возврат ТаблицаЗначений;	
		КонецЕсли;
	Иначе	 
		ТаблицаЗначений = РегистрыСведений.ОтветственныеЛица.СрезПоследних(, СтруктураВыборки);
		Если ПолучитьСотрудника Тогда
			Возврат ?(ЗначениеЗаполнено(ТаблицаЗначений), ТаблицаЗначений[0].Сотрудник, Неопределено);
		Иначе
			Возврат ТаблицаЗначений;	
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

// Функция - проверяет наличие предварительной записи сотрудника
//
Функция ПроверитьНаличиеПредварительнойЗаписи(Сотрудник, Период, МассивПериодов, СтруктурнаяЕдиница) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.ДатаНачала,
		|	ВложенныйЗапрос.ДатаОкончания
		|ИЗ
		|	(ВЫБРАТЬ
		|		МИНИМУМ(МинимальнаяДата.ДатаНачала) КАК ДатаНачала,
		|		МАКСИМУМ(МаксимальнаяДата.ДатаОкончания) КАК ДатаОкончания
		|	ИЗ
		|		Документ.Событие.Услуги КАК МинимальнаяДата
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Событие.Услуги КАК МаксимальнаяДата
		|			ПО МинимальнаяДата.Ссылка = МаксимальнаяДата.Ссылка
		|				И МинимальнаяДата.Сотрудник = МаксимальнаяДата.Сотрудник
		|	ГДЕ
		|		МинимальнаяДата.Сотрудник = &Сотрудник
		|		И НАЧАЛОПЕРИОДА(МинимальнаяДата.ДатаНачала, ДЕНЬ) = &Период
		|		И МинимальнаяДата.ДатаНачала ЕСТЬ НЕ NULL 
		|		И (НЕ МаксимальнаяДата.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен))
		|		И (НЕ МинимальнаяДата.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен))
		|		И МаксимальнаяДата.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|		И МинимальнаяДата.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВложенныйЗапрос.ДатаНачала ЕСТЬ НЕ NULL 
		|	И ВложенныйЗапрос.ДатаОкончания ЕСТЬ НЕ NULL "; 

	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	Результат = Запрос.Выполнить().Выбрать();
	ЕстьЗаписи = Истина;
	
	Если Результат.Следующий() Тогда 
		
		Если МассивПериодов.Количество() > 0 Тогда
			Если Результат.ДатаНачала >= (Период + (МассивПериодов[0].НачалоСмены - Дата(01,01,01))) 
				И Результат.ДатаОкончания <= (Период + (МассивПериодов[МассивПериодов.Количество() - 1].ОкончаниеСмены - Дата(01,01,01))) Тогда 
				ЕстьЗаписи = Ложь;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ЕстьЗаписи = Ложь;
	КонецЕсли;
	
	Возврат ЕстьЗаписи;
	
КонецФункции

// Функция, проверяет не работает ли сотрудник в данный период в др. структурной единице
//
Функция ПроверитьЗанятостьСотрудника(МассивПериодов, Сотрудник, СтруктурнаяЕдиница, Дата) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ВремяРаботыСотрудниковПлан.ДатаВремяНачала КАК ВремяНачала,
	                      |	ВремяРаботыСотрудниковПлан.ДатаВремяОкончания КАК ВремяОкончания
	                      |ИЗ
	                      |	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
	                      |ГДЕ
	                      |	ВремяРаботыСотрудниковПлан.Сотрудник = &Сотрудник
	                      |	И ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница <> &СтруктурнаяЕдиница
	                      |	И НАЧАЛОПЕРИОДА(ВремяРаботыСотрудниковПлан.ДатаВремяНачала, ДЕНЬ) = &Дата");
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТЧ из Результат Цикл
		Для Каждого СтрокаПериода из МассивПериодов Цикл
			Если  (СтрокаТЧ.ВремяНачала > Дата + (СтрокаПериода.НачалоСмены - Дата(01, 01, 01)) и СтрокаТЧ.ВремяНачала < Дата + (СтрокаПериода.ОкончаниеСмены - Дата(01, 01, 01))) 
				   или (СтрокаТЧ.ВремяОкончания >  Дата + (СтрокаПериода.НачалоСмены - Дата(01, 01, 01)) и СтрокаТЧ.ВремяОкончания < Дата + (СтрокаПериода.ОкончаниеСмены - Дата(01, 01, 01))) Тогда
				   Возврат Истина;
			КонецЕсли;
		КонецЦикла;		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции
  
&НаСервере
// Функция возвращает признак работы сотрудника
//
Функция ПроверитьДатуУвольнения(Сотрудник, ТекущаяДата, СтруктурнаяЕдиница) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	НастройкиСотрудников.Сотрудник
	                      |ИЗ
	                      |	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	                      |ГДЕ
	                      |	НастройкиСотрудников.Сотрудник = &Сотрудник
	                      |	И НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                      |	И ВЫБОР
	                      |			КОГДА НастройкиСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
	                      |				ТОГДА НастройкиСотрудников.ДатаУвольнения > &ТекущаяДата
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ");
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
	
КонецФункции

&НаСервере
// Функция выполняет отмену события
//
Функция ОтменитьВосстановитьСобытие(СобытиеСсылка, ПричинаОтменыЗаписи,ВосстановитьСобытие = Ложь) Экспорт 
	
	Если НЕ ВосстановитьСобытие Тогда
		Если ТипЗнч(ПричинаОтменыЗаписи) <> Тип("СправочникСсылка.ПричиныОтменыЗаписи") ИЛИ ПричинаОтменыЗаписи.Пустая() Тогда
			Возврат Ложь;
		КонецЕсли;
		// Нафиг два раза проверять!!!
		// Результат = ОбщегоНазначения.ПроверитьВозможностьОтменыСобытия(СобытиеСсылка);
		// Если Результат <> Истина Тогда
		//	Сообщить(Результат);
		//	Возврат Ложь;
		// КонецЕсли;	
	КонецЕсли;
	
	ПОПЫТКА
		ОбъектРасшифровки               = СобытиеСсылка.ПолучитьОбъект();
		ОбъектРасшифровки.Статус        = ?(НЕ ВосстановитьСобытие, Перечисления.СтатусыСобытия.ПриемОтменен, Перечисления.СтатусыСобытия.Подтверждена);
		ОбъектРасшифровки.ПричинаОтмены = ?(НЕ ВосстановитьСобытие,ПричинаОтменыЗаписи,Неопределено);
		ОбъектРасшифровки.Записать();
	ИСКЛЮЧЕНИЕ
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат Ложь;
	КОНЕЦПОПЫТКИ;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
// Функция выполняет проверку возможности отмены события.
//
Функция ПроверитьВозможностьОтменыСобытия(СобытиеСсылка) Экспорт
	
	Если СобытиеСсылка.Проведен = Ложь Тогда
		ТекстОшибки = "Отменить можно только проведенное событие!";
		Возврат ТекстОшибки;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Функция выполняет получение цвета фона события.
//
Функция ПолучитьЦветФонаСобытия(Статус = Неопределено, Событие = Неопределено, ТаблицаЦветов = Неопределено, ЭтоПеренос = Ложь) Экспорт
			
	Если ТаблицаЦветов = Неопределено Тогда  
		
		СтруктураЦветов = РегистрыСведений.НастройкиИнтерфейсов.ПолучитьНастройкиЦветаЖурналаЗаписи(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
		
		Если ЭтоПеренос = Истина Тогда
			ЦветФона = СтруктураЦветов.ЦветПриемПеренесен;
		ИначеЕсли Статус = Перечисления.СтатусыСобытия.ПриемНачат Тогда
			ЦветФона = СтруктураЦветов.ЦветПриемНачат;
		ИначеЕсли Статус = Перечисления.СтатусыСобытия.ПриемНеСостоялся Тогда
			ЦветФона = СтруктураЦветов.ЦветПриемНеСостоялся;
		ИначеЕсли Статус = Перечисления.СтатусыСобытия.ПриемОкончен Тогда
			ЦветФона = СтруктураЦветов.ЦветПриемОкончен;
		ИначеЕсли Статус = Перечисления.СтатусыСобытия.ПриемОтменен Тогда
			ЦветФона = СтруктураЦветов.ЦветПриемОтменен;
		ИначеЕсли Статус = Перечисления.СтатусыСобытия.НеПодтверждена Тогда
			ЦветФона = СтруктураЦветов.ЦветНеПодтверждена;
		ИначеЕсли Статус = Перечисления.СтатусыСобытия.Подтверждена Тогда
			ЦветФона = СтруктураЦветов.ЦветПодтверждена; 
		ИначеЕсли Статус = Перечисления.СтатусыСобытия.ПациентОжидает Тогда
			ЦветФона = СтруктураЦветов.ЦветПациентОжидает;
		ИначеЕсли Событие <> Неопределено И Событие.Ссылка.Пустая() Тогда
			ЦветФона = СтруктураЦветов.ЦветПодтверждена;;
		Иначе
			Возврат Новый Цвет();
		КонецЕсли;
		
	Иначе
		
		Если ЭтоПеренос = Истина Тогда
			ИмяНастройки = "ЦветПриемПеренесен";
		ИначеЕсли Статус = Перечисления.СтатусыСобытия.Подтверждена Тогда
			ИмяНастройки = "ЦветСобытияЗапланировано";
		ИначеЕсли Статус = Перечисления.СтатусыСобытия.ПациентОжидает Тогда
			ИмяНастройки = "ЦветСобытияПациентОжидает";
		ИначеЕсли Статус = Перечисления.СтатусыСобытия.ПриемНачат Тогда
			ИмяНастройки = "ЦветСобытияПациентВКресле";
		ИначеЕсли Статус = Перечисления.СтатусыСобытия.ПриемОкончен Тогда
			ИмяНастройки = "ЦветСобытияПриемОкончен";
		ИначеЕсли Статус = Перечисления.СтатусыСобытия.ПриемНеСостоялся Тогда
			ИмяНастройки = "ЦветСобытияПриемНеСостоялся";
		ИначеЕсли Статус = Перечисления.СтатусыСобытия.ПриемОтменен Тогда
			ИмяНастройки = "ЦветСобытияПриемОтменен";
		ИначеЕсли Статус = Перечисления.СтатусыСобытия.НеПодтверждена Тогда
			ИмяНастройки = "ЦветСобытияНеПодтверждено";			
		ИначеЕсли Событие <> Неопределено И Событие.Ссылка.Пустая() Тогда
			ИмяНастройки = "ЦветСобытияЗапланировано";		
		Иначе
			Возврат Новый Цвет(); 
		КонецЕсли;
		
		ЦветФона = ТаблицаЦветов.Найти(ИмяНастройки, "Имя").Цветфона;
		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ЦветФона) Тогда
		ЦветФона = ЗначениеИзСтрокиВнутр(ЦветФона);
	Иначе 
		
		ЦветФонаПоУмолчанию = Новый Структура("ЦветСобытияЗапланировано, ЦветСобытияПациентОжидает, ЦветСобытияПациентВКресле, ЦветСобытияПриемОкончен, ЦветСобытияПриемНеСостоялся, ЦветСобытияПриемОтменен, ЦветСобытияНеПодтверждено, ЦветПриемПеренесен",
							WebЦвета.БледноЗолотистый,WebЦвета.БледноСиреневый, WebЦвета.ГолубойСоСтальнымОттенком, WebЦвета.СветлоЗеленый, WebЦвета.СветлоКоралловый, WebЦвета.СветлоКоралловый, WebЦвета.НейтральноПурпурный, Новый Цвет(230, 127, 106));

							
		ЦветФона = ЦветФонаПоУмолчанию[ИмяНастройки];
		
	КонецЕсли;
	
	Возврат ЦветФона;
		
КонецФункции

// Функция выполняет установку цвета фона события.
//
Процедура УстановитьЦветФонаСобытия(Статус, Событие = Неопределено, Знач Значение, ЭтоПеренос = Ложь) Экспорт
	
	Если Статус = Перечисления.СтатусыСобытия.Подтверждена Тогда
		Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПодтверждена;
	ИначеЕсли Статус = Перечисления.СтатусыСобытия.ПациентОжидает Тогда
		Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПациентОжидает;
	ИначеЕсли Статус = Перечисления.СтатусыСобытия.ПриемНачат Тогда
		Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемНачат;
	ИначеЕсли Статус = Перечисления.СтатусыСобытия.ПриемОкончен Тогда
		Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемОкончен;
	ИначеЕсли Статус = Перечисления.СтатусыСобытия.ПриемНеСостоялся Тогда
		Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемНеСостоялся;
	ИначеЕсли Статус = Перечисления.СтатусыСобытия.ПриемОтменен Тогда
		Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемОтменен;
  	ИначеЕсли Статус = Перечисления.СтатусыСобытия.НеПодтверждена Тогда
		Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветНеПодтверждена;		
	ИначеЕсли ЭтоПеренос = Истина Тогда
		Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемПеренесен;	
	ИначеЕсли Событие <> Неопределено И Событие.Ссылка.Пустая() Тогда
		Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПодтверждена;;			
	КонецЕсли;
	
	Если ТипЗнч(Значение) =  Тип("Цвет") Тогда
		Значение = ЗначениеВСтрокуВнутр(Значение);
	КонецЕсли;
	
	РегистрыСведений.НастройкиИнтерфейсов.ЗаписатьЗначениеНастройки(, Настройка, Значение);
	
КонецПроцедуры

// Функция возвращает периоды работы.
//
Функция	ВернутьПериодыРаботы(ОбъектСсылка, ПериодДень, Параметры = Неопределено) Экспорт
	
	Результат = Неопределено;
	
	Если ТипЗнч(ОбъектСсылка) = Тип("СписокЗначений") Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВремяРаботыСотрудниковПлан.ДатаВремяНачала КАК Начало,
		|	ВЫБОР
		|		КОГДА ВремяРаботыСотрудниковПлан.ДатаВремяОкончания = НАЧАЛОПЕРИОДА(ВремяРаботыСотрудниковПлан.ДатаВремяОкончания, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ВремяРаботыСотрудниковПлан.ДатаВремяОкончания, ДЕНЬ)
		|		ИНАЧЕ ВремяРаботыСотрудниковПлан.ДатаВремяОкончания
		|	КОНЕЦ КАК Окончание,
		|	ВремяРаботыСотрудниковПлан.Сотрудник
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы.РасписаниеРаботы КАК РасписаниеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
		|		ПО РасписаниеРаботы.Ссылка = ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница
		|ГДЕ
		|	ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И ВремяРаботыСотрудниковПлан.Сотрудник В (&СписокСотрудников)
		|	И &ДатаДня МЕЖДУ НАЧАЛОПЕРИОДА(ВремяРаботыСотрудниковПлан.ДатаВремяОкончания, ДЕНЬ) И КОНЕЦПЕРИОДА(ВремяРаботыСотрудниковПлан.ДатаВремяОкончания, ДЕНЬ)
		|	И РасписаниеРаботы.Активность = ИСТИНА
		|	И ДЕНЬНЕДЕЛИ(РасписаниеРаботы.ДеньНедели) = &ДеньНедели";
		
		Запрос.УстановитьПараметр("ДатаДня", ПериодДень);
		Запрос.УстановитьПараметр("СписокСотрудников", ОбъектСсылка);
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Параметры.СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("ДеньНедели", ДеньНедели(ПериодДень));
		
		Результат = Запрос.Выполнить().Выгрузить();
		
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.Сотрудники") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВремяРаботыСотрудниковПлан.ДатаВремяНачала КАК Начало,
		|	ВЫБОР
		|		КОГДА ВремяРаботыСотрудниковПлан.ДатаВремяОкончания = НАЧАЛОПЕРИОДА(ВремяРаботыСотрудниковПлан.ДатаВремяОкончания, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ВремяРаботыСотрудниковПлан.ДатаВремяОкончания, ДЕНЬ)
		|		ИНАЧЕ ВремяРаботыСотрудниковПлан.ДатаВремяОкончания
		|	КОНЕЦ КАК Окончание
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы.РасписаниеРаботы КАК РасписаниеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
		|		ПО РасписаниеРаботы.Ссылка = ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница
		|ГДЕ
		|	ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И ВремяРаботыСотрудниковПлан.Сотрудник = &Сотрудник
		|	И &ДатаДня МЕЖДУ НАЧАЛОПЕРИОДА(ВремяРаботыСотрудниковПлан.ДатаВремяОкончания, ДЕНЬ) И КОНЕЦПЕРИОДА(ВремяРаботыСотрудниковПлан.ДатаВремяОкончания, ДЕНЬ)
		|	И РасписаниеРаботы.Активность = ИСТИНА
		|	И ДЕНЬНЕДЕЛИ(РасписаниеРаботы.ДеньНедели) = &ДеньНедели";
		
		Запрос.УстановитьПараметр("ДатаДня", ПериодДень);
		Запрос.УстановитьПараметр("Сотрудник", ОбъектСсылка);
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Параметры.СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("ДеньНедели", ДеньНедели(ПериодДень));
		
		Результат = Запрос.Выполнить().Выгрузить();
		
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.СтруктурныеЕдиницы") ИЛИ ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.Помещения") Тогда
		
		ОтображаемоеКоличествоДней = ?(Параметры <> Неопределено И Параметры.Свойство("КолДней"), Параметры.КолДней - 1, 0); // Если КолДней = 0 (1 День).
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасписаниеРаботы.ДеньНедели КАК ДеньНедели,
		|	ВЫБОР
		|		КОГДА РасписаниеРаботы.НачалоРаботы = &ПустаяДата
		|			ТОГДА &НачалоРаботы
		|		ИНАЧЕ РасписаниеРаботы.НачалоРаботы
		|	КОНЕЦ КАК Начало,
		|	ВЫБОР
		|		КОГДА РасписаниеРаботы.ОкончаниеРаботы = &ПустаяДата
		|			ТОГДА &ОкончаниеРаботы
		|		ИНАЧЕ РасписаниеРаботы.ОкончаниеРаботы
		|	КОНЕЦ КАК Окончание
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы.РасписаниеРаботы КАК РасписаниеРаботы
		|ГДЕ
		|	РасписаниеРаботы.Активность = ИСТИНА
		|	И ДЕНЬНЕДЕЛИ(РасписаниеРаботы.ДеньНедели) МЕЖДУ &ДеньНеделиОт И &ДеньНеделиПо
		|	И РасписаниеРаботы.Ссылка = &СтруктурнаяЕдиница";
		
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ОбъектСсылка);
		Запрос.УстановитьПараметр("ПустаяДата", Дата(01,01,01));
		Запрос.УстановитьПараметр("НачалоРаботы", Дата(01,01,01,00,00,01)); 
		Запрос.УстановитьПараметр("ОкончаниеРаботы",  Дата(01,01,01,23,59,59));
		Запрос.УстановитьПараметр("ДеньНеделиОт", ДеньНедели(ПериодДень));
		Запрос.УстановитьПараметр("ДеньНеделиПо", ДеньНедели(ПериодДень) + ОтображаемоеКоличествоДней);
		
		Результат = Запрос.Выполнить().Выгрузить();
	Иначе
		Результат = Новый ТаблицаЗначений;
	КонецЕсли;
	
	Возврат Результат;   	
	
КонецФункции

// Процедура обновляет данные в календаря дня.
//
Функция СформироватьГрафикСобытий(ПараметрыЗнач, МассивСотрудниковИОбластей = Неопределено, ИнтервалВремени = Неопределено, ВыводНаПечать = Ложь) Экспорт
	
	Параметры = Новый Структура;
	Для Каждого ЭлементСтруктуры Из ПараметрыЗнач Цикл
		Параметры.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Вычисляем какую область графика  по времени показывать
	Если ИнтервалВремени = Неопределено ИЛИ ИнтервалВремени = 15 Тогда
		Параметры.Вставить("МакетДня", Обработки.РабочийКалендарь.ПолучитьМакет("МакетДень"));
	ИначеЕсли ИнтервалВремени = 5 Тогда
		Параметры.Вставить("МакетДня", Обработки.РабочийКалендарь.ПолучитьМакет("МакетДень5"));
	Иначе
		Параметры.Вставить("МакетДня", Обработки.РабочийКалендарь.ПолучитьМакет("МакетДень10"));
	КонецЕсли;
		
	// 1. Получаем данные событий
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Услуги.Ссылка КАК Событие,
	|	Услуги.Ссылка.Контрагент КАК Контрагент,
	|	Услуги.Ссылка.Контрагент.ДатаРожденияКлиента КАК ДатаРожденияКлиента,
	|	Услуги.Ссылка.ТелефонныйЗвонок,
	|	Услуги.Ссылка.ОснованиеРезерва,
	|	Услуги.Ссылка.Комментарий КАК Комментарий,
	|	Услуги.ДатаНачала КАК ДатаНачала,
	|	Услуги.ДатаОкончания,
	|	Услуги.Сотрудник КАК Сотрудник,
	|	Услуги.Помещение КАК Помещение,
	|	Услуги.Номенклатура КАК Услуга,
	|	Услуги.ПричинаЗаписи КАК ПричинаЗаписи,
	|	Услуги.ПризнакЗаблокированно КАК ПризнакЗаблокированно,
	|	Услуги.НомерСтроки - 1 КАК ИндексВТЧ,
	|	0 КАК НомерБлокаСобытий,
	|	Услуги.Ссылка.АвторДокумента,
	|	Услуги.Ссылка.Дата КАК ДатаСобытия,
	|	Услуги.Ссылка.Резерв,
	|	Услуги.Ссылка.Статус,
	|	Услуги.Ссылка.ЦветФонаРезерва,
	|	ЛОЖЬ КАК ЕстьЗадолженность,
	|	ЛОЖЬ КАК ЕстьНезавершенныеНарядЗаказы,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыНарядЗаказа.Заказано) КАК ОбщийСтатусНезавершенныхНарядЗаказов,
	|	Услуги.Ссылка.Контрагент.Наименование КАК ФИОПациента,
	|	Услуги.Ссылка.Контрагент.ТекущаяМедицинскаяКарта.КодБезНулей,
	|	Услуги.Ссылка.Контрагент.ТекущаяМедицинскаяКарта,
	|	Услуги.Ссылка.Контрагент.Телефон
	|ИЗ
	|	Документ.Событие.Услуги КАК Услуги
	|ГДЕ
	|	Услуги.Ссылка.Проведен
	|	И Услуги.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Услуги.Ссылка.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
	|	И НЕ Услуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|	И Услуги.ДатаНачала МЕЖДУ &ДатаОт И &ДатаПо
	|	И (&Контрагенты = НЕОПРЕДЕЛЕНО
	|			ИЛИ Услуги.Ссылка.Контрагент = &Контрагенты)
	|	И (""Все"" В (&Сотрудники)
	|			ИЛИ Услуги.Сотрудник В (&Сотрудники)
	|			ИЛИ Услуги.Сотрудник.Должность В (&Сотрудники))
	|	И (""Все"" В (&Помещения)
	|			ИЛИ Услуги.Помещение В (&Помещения)
	|			ИЛИ Услуги.Помещение.Родитель В (&Помещения))
	|	И НЕ Услуги.Ссылка В (&МассивИсключаемыхСобытий)
	|	И ВЫБОР
	|			КОГДА НЕ Услуги.Сотрудник.Должность = ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
	|				ТОГДА Услуги.Сотрудник.Должность.ОтображатьВЖурналеПредварительнойЗаписи = ИСТИНА
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Событие,
	|	Сотрудник,
	|	Контрагент,
	|	Помещение,
	|	ДатаНачала");
	
	Если Параметры.Свойство("ОтмененныеЗаписи")
		И Параметры.ОтмененныеЗаписи = Истина Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НЕ Услуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)", "Услуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)"); 	
		Статус  = Перечисления.СтатусыСобытия.ПриемОтменен;
	КонецЕсли;
	
	ДатаНачала 			= ?(Параметры.СтраницаМенеджера = "Неделя",НачалоНедели(Параметры.Дата), НачалоДня(Параметры.Дата));
	ДатаОкончания		= ?(Параметры.СтраницаМенеджера = "Неделя",КонецНедели(Параметры.Дата), КонецДня(Параметры.Дата));
	ВыбранныеКлиенты 	= ?(Параметры.Свойство("ВыбранныеКонтрагенты"), Параметры.ВыбранныеКонтрагенты, Неопределено);
	
	Запрос.УстановитьПараметр("МассивИсключаемыхСобытий", ?(Параметры.Свойство("ИсключаемыеСобытий"), Параметры.ИсключаемыеСобытий, Новый Массив));	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"      , Параметры.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Контрагенты"             , ВыбранныеКлиенты);
	Запрос.УстановитьПараметр("Сотрудники"              , Параметры.ВыбранныеСотрудники);
	Запрос.УстановитьПараметр("Помещения"               , Параметры.ВыбранныеПомещения);
	Запрос.УстановитьПараметр("ДатаОт"					, ДатаНачала);
	Запрос.УстановитьПараметр("ДатаПо"					, ДатаОкончания);
	
	ТаблицаСобытий = Запрос.Выполнить().Выгрузить();
	
	РегистрыСведений.ИсторияПереносовСобытий.ДополнитьТаблицуСобытийПереносами( ДатаНачала,
																				ДатаОкончания, 
																				Параметры.СтруктурнаяЕдиница, 
																				Параметры.ВыбранныеСотрудники, 
																				Параметры.ВыбранныеПомещения, 
																				Статус, 
																				ВыбранныеКлиенты, 
																				ТаблицаСобытий);  
	
	Если ТаблицаСобытий.Количество() > 0 Тогда 
		ПроставимНекоторыеСтатусы(ТаблицаСобытий, Параметры.СтруктурнаяЕдиница);
	КонецЕсли;
	
	Если Параметры.Свойство("ВиртуальныеСобытия") = Истина Тогда
		Для Каждого СтрокаТаблицы Из Параметры.ВиртуальныеСобытия Цикл
			НоваяСтрока = ТаблицаСобытий.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		КонецЦикла;
	КонецЕсли;
		
	// Делаем колонку услуги не привязанным к типу
	ТаблицаСобытий.Колонки.Услуга.Имя = "УслугаДел";
	ТаблицаСобытий.Колонки.Добавить("Услуга");
	ТаблицаСобытий.ЗагрузитьКолонку(ТаблицаСобытий.ВыгрузитьКолонку("УслугаДел"), "Услуга");
	ТаблицаСобытий.Колонки.Удалить("УслугаДел");
	// Делаем колонку услуги не привязанным к типу
	ТаблицаСобытий.Колонки.ИндексВТЧ.Имя = "ИндексВТЧДел";
	ТаблицаСобытий.Колонки.Добавить("ИндексВТЧ");
	ТаблицаСобытий.ЗагрузитьКолонку(ТаблицаСобытий.ВыгрузитьКолонку("ИндексВТЧДел"), "ИндексВТЧ");
	ТаблицаСобытий.Колонки.Удалить("ИндексВТЧДел");
	
	// Группируем события по блокам
	ИндексСтроки = 0;
	Если Параметры.Свойство("ВиртуальныеСобытия") = Истина Тогда
	  ТаблицаСобытий.Сортировать("Событие, Сотрудник, Контрагент, Помещение, ДатаНачала");
    КонецЕсли;
  
	Пока ИндексСтроки < ТаблицаСобытий.Количество() - 1 Цикл
		СтрокаТаблицаСобытий = ТаблицаСобытий[ИндексСтроки];
		СтрокаТаблицаСобытийСледующая = ТаблицаСобытий[ИндексСтроки + 1];
		Если СтрокаТаблицаСобытий.Событие = СтрокаТаблицаСобытийСледующая.Событие И СтрокаТаблицаСобытий.Сотрудник = СтрокаТаблицаСобытийСледующая.Сотрудник И СтрокаТаблицаСобытий.Помещение = СтрокаТаблицаСобытийСледующая.Помещение
				И СтрокаТаблицаСобытий.Контрагент = СтрокаТаблицаСобытийСледующая.Контрагент И СтрокаТаблицаСобытий.ПризнакЗаблокированно = СтрокаТаблицаСобытийСледующая.ПризнакЗаблокированно
				И СтрокаТаблицаСобытийСледующая.ДатаНачала >= СтрокаТаблицаСобытий.ДатаНачала И СтрокаТаблицаСобытийСледующая.ДатаНачала <= СтрокаТаблицаСобытий.ДатаОкончания Тогда
			СтрокаТаблицаСобытий.ДатаОкончания = ?(СтрокаТаблицаСобытийСледующая.ДатаОкончания < СтрокаТаблицаСобытий.ДатаОкончания, СтрокаТаблицаСобытий.ДатаОкончания, СтрокаТаблицаСобытийСледующая.ДатаОкончания);
			Если ТипЗнч(СтрокаТаблицаСобытий.Услуга) = Тип("Массив") Тогда
				СтрокаТаблицаСобытий.Услуга.Добавить(СтрокаТаблицаСобытийСледующая.Услуга);
			Иначе
				НовыйМассив = Новый Массив;
				НовыйМассив.Добавить(СтрокаТаблицаСобытий.Услуга);
				НовыйМассив.Добавить(СтрокаТаблицаСобытийСледующая.Услуга);
				СтрокаТаблицаСобытий.Услуга = НовыйМассив;
			КонецЕсли;
			Если ТипЗнч(СтрокаТаблицаСобытий.ИндексВТЧ) = Тип("Массив") Тогда
				СтрокаТаблицаСобытий.ИндексВТЧ.Добавить(СтрокаТаблицаСобытийСледующая.ИндексВТЧ);
			Иначе
				НовыйМассив = Новый Массив;
				НовыйМассив.Добавить(СтрокаТаблицаСобытий.ИндексВТЧ);
				НовыйМассив.Добавить(СтрокаТаблицаСобытийСледующая.ИндексВТЧ);
				СтрокаТаблицаСобытий.ИндексВТЧ = НовыйМассив;
			КонецЕсли;
			ТаблицаСобытий.Удалить(СтрокаТаблицаСобытийСледующая);
		Иначе
			ИндексСтроки = ИндексСтроки + 1;
		КонецЕсли;
	КонецЦикла;
	
	
	// Получим метки для всех событий
	ТаблицаДляФильтра = ТаблицаСобытий.ВыгрузитьКолонку("СОбытие");
	
	ЗапросМеток = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлиентскиеМеткиСрезПоследних.Клиент КАК Событие,
	|	КлиентскиеМеткиСрезПоследних.Метка,
	|	КлиентскиеМеткиСрезПоследних.Активна
	|ИЗ
	|	РегистрСведений.МеткиКлиентов.СрезПоследних(, Клиент В (&Клиент)) КАК КлиентскиеМеткиСрезПоследних
	|ГДЕ
	|	КлиентскиеМеткиСрезПоследних.Активна = ИСТИНА
	|	И КлиентскиеМеткиСрезПоследних.Метка.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	КлиентскиеМеткиСрезПоследних.Метка");
	

	ЗапросМеток.УстановитьПараметр("Клиент", ТаблицаДляФильтра);
	ТаблицаМеток = ЗапросМеток.Выполнить().Выгрузить();
	
	Параметры.Вставить("ТаблицаМеток", ТаблицаМеток);
	
	// Высчитываем номер блока, для вывода надписи в событии
	Для Каждого СтрокаТаблицы Из ТаблицаСобытий Цикл
		МассивБлокаСобытий = ТаблицаСобытий.НайтиСтроки(Новый Структура("Событие", СтрокаТаблицы.Событие));
		Если МассивБлокаСобытий.Количество() > 1 И СтрокаТаблицы.НомерБлокаСобытий = 0 Тогда
			Для а = 0 По МассивБлокаСобытий.Количество() - 1 Цикл
				МассивБлокаСобытий[а].НомерБлокаСобытий = а + 1;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаСобытий.Сортировать("ДатаНачала");
	
	// 2. Распределяем событие по периодам дня
	ТаблицаИнтервалов = ТаблицаСобытий.СкопироватьКолонки();
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));
	ОписаниеТиповЧисло = Новый ОписаниеТипов(МассивТипов);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов);
	
	ТаблицаИнтервалов.Колонки.Добавить("НомерНачальнойСтроки", 					ОписаниеТиповЧисло);
	ТаблицаИнтервалов.Колонки.Добавить("НомерКонечнойСтроки" , 					ОписаниеТиповЧисло);
	ТаблицаИнтервалов.Колонки.Добавить("НомерНачальнойКолонки", 				ОписаниеТиповЧисло);
	ТаблицаИнтервалов.Колонки.Добавить("НомерКонечнойКолонки" , 				ОписаниеТиповЧисло);
	ТаблицаИнтервалов.Колонки.Добавить("ПорядковыйНомерВДне" , 					ОписаниеТиповЧисло);
	ТаблицаИнтервалов.Колонки.Добавить("ДатаИнтервала" , 						ОписаниеТиповДата);
	ТаблицаИнтервалов.Колонки.Добавить("КоличествоОдновременныхДокументов" , 	ОписаниеТиповЧисло);
	ТаблицаИнтервалов.Колонки.Добавить("ИндексСтроки" , 						ОписаниеТиповЧисло);
	
	Для каждого СтрокаТаблицы Из ТаблицаСобытий Цикл
		
		НачальнаяСтрока = ОбщегоНазначенияКлиентСерверСтоматология.ВозвратитьНомерСтрокиПоСоставнойДаты(Формат(СтрокаТаблицы.ДатаНачала,"ДФ=Ч"), Формат(СтрокаТаблицы.ДатаНачала,"ДФ=м"), СтрокаТаблицы.ДатаНачала, Истина, СтрокаТаблицы.ДатаНачала, ИнтервалВремени);
		Если Формат(СтрокаТаблицы.ДатаНачала,"ДФ=Ч") = Формат(СтрокаТаблицы.ДатаОкончания,"ДФ=Ч") И Формат(СтрокаТаблицы.ДатаНачала,"ДФ=м") = Формат(СтрокаТаблицы.ДатаОкончания,"ДФ=м") Тогда
			КонечнаяСтрока  = НачальнаяСтрока;
		Иначе
			Если НачалоДня(СтрокаТаблицы.ДатаОкончания) = СтрокаТаблицы.ДатаОкончания Тогда
				СтрокаТаблицы.ДатаОкончания = КонецДня(СтрокаТаблицы.ДатаОкончания);
			КонецЕсли;			
			КонечнаяСтрока  = ОбщегоНазначенияКлиентСерверСтоматология.ВозвратитьНомерСтрокиПоСоставнойДаты(Формат(СтрокаТаблицы.ДатаОкончания,"ДФ=Ч"), Формат(СтрокаТаблицы.ДатаОкончания,"ДФ=м"), СтрокаТаблицы.ДатаОкончания, Ложь, СтрокаТаблицы.ДатаОкончания, ИнтервалВремени);
		КонецЕсли; 
		
		Если НачалоДня(СтрокаТаблицы.ДатаНачала) <> НачалоДня(СтрокаТаблицы.ДатаОкончания) Тогда
			
			КоличествоИнтерваловМеждуДнями = Цел((НачалоДня(СтрокаТаблицы.ДатаОкончания) - КонецДня(СтрокаТаблицы.ДатаНачала) + 1)/(60*60*24));
			Для а = 1 По КоличествоИнтерваловМеждуДнями Цикл
				ДатаИнтервала                     = НачалоДня(СтрокаТаблицы.ДатаНачала) + (60*60*24)*а;							
				НоваяСтрока                       = ТаблицаИнтервалов.Добавить();
				НоваяСтрока.ИндексСтроки          = ТаблицаИнтервалов.Индекс(НоваяСтрока);
				НоваяСтрока.ДатаИнтервала         = ДатаИнтервала;
				НоваяСтрока.НомерНачальнойСтроки  = 1;
				НоваяСтрока.НомерКонечнойСтроки   = 96;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);				
			КонецЦикла;
			
			НоваяСтрока                      = ТаблицаИнтервалов.Добавить();
			НоваяСтрока.ИндексСтроки         = ТаблицаИнтервалов.Индекс(НоваяСтрока);
			НоваяСтрока.ДатаИнтервала        = НачалоДня(СтрокаТаблицы.ДатаНачала);
			НоваяСтрока.НомерНачальнойСтроки = НачальнаяСтрока;
			НоваяСтрока.НомерКонечнойСтроки  = 96;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
			НоваяСтрока                      = ТаблицаИнтервалов.Добавить();
			НоваяСтрока.ИндексСтроки         = ТаблицаИнтервалов.Индекс(НоваяСтрока);
			НоваяСтрока.ДатаИнтервала        = НачалоДня(СтрокаТаблицы.ДатаОкончания);
			НоваяСтрока.НомерНачальнойСтроки = 1;
			НоваяСтрока.НомерКонечнойСтроки  = КонечнаяСтрока;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		Иначе
			НоваяСтрока                      = ТаблицаИнтервалов.Добавить();
			НоваяСтрока.ИндексСтроки         = ТаблицаИнтервалов.Индекс(НоваяСтрока);
			НоваяСтрока.ДатаИнтервала        = НачалоДня(СтрокаТаблицы.ДатаНачала);
			НоваяСтрока.НомерНачальнойСтроки = НачальнаяСтрока;
			НоваяСтрока.НомерКонечнойСтроки  = КонечнаяСтрока;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);		
		КонецЕсли;
		
	КонецЦикла;
	
	ПериодыРаботыСтруктурнойЕдиницы = ОбщегоНазначенияСтоматология.ВернутьПериодыРаботы(Параметры.СтруктурнаяЕдиница, ?(Параметры.СтраницаМенеджера = "Неделя", НачалоНедели(Параметры.Дата), Параметры.Дата), Новый Структура("КолДней" , ?(Параметры.СтраницаМенеджера = "Неделя", 7, 1)));
	
	Если ПериодыРаботыСтруктурнойЕдиницы.Количество() > 0 Тогда
		Параметры.Вставить("ОграничениеВремениС" ,ПериодыРаботыСтруктурнойЕдиницы[0].Начало);
		Параметры.Вставить("ОграничениеВремениПО",ПериодыРаботыСтруктурнойЕдиницы[0].Окончание);
	Иначе
		Параметры.Вставить("ОграничениеВремениС" ,Дата(01, 01, 01, 0, 0, 0));
		Параметры.Вставить("ОграничениеВремениПО",Дата(01, 01, 01, 23, 59, 59));
	КОнецЕсли;
	
	// 3. Выполняем процедуру распределения событий на графике
	Параметры.Вставить("ВыводитьСтрокуЛистОжидания", ВыводНаПечать = Ложь И Параметры.СтраницаМенеджера = "Сотрудники");
	
	Если Параметры.СтраницаМенеджера = "ДеньСотрудника" Тогда		
		
		Если Параметры.ВыбранныеСотрудники.Количество() = 0 Тогда
			Параметры.ВыбранныеСотрудники.Добавить(Неопределено);
		КонецЕсли;
		
		Для Счетчик = 1 По Параметры.ВыбранныеСотрудники.Количество() Цикл
			ГруппировкаСсылка            = Параметры.ВыбранныеСотрудники[Счетчик - 1];
			ТаблицаИнтерваловГруппировки = ТаблицаИнтервалов.Скопировать(Новый Структура("ДатаИнтервала, Сотрудник", Параметры.Дата, ГруппировкаСсылка));
			ЗаполнитьГрафикСобытийПоГруппам(ТабличныйДокумент, ТаблицаИнтерваловГруппировки, Счетчик, Параметры.ВыбранныеСотрудники.Количество(), ГруппировкаСсылка, Ложь, Параметры, Неопределено, ИнтервалВремени, ВыводНаПечать);
		КонецЦикла;

	ИначеЕсли Параметры.СтраницаМенеджера = "Неделя" Тогда
		
		Параметры.Вставить("ОграничениеВремениС" , Неопределено);
		Параметры.Вставить("ОграничениеВремениПО", Неопределено);
		
		// Определяем максимальное время начала и окончания дня.
		Для Каждого СтрокаТЗ Из ПериодыРаботыСтруктурнойЕдиницы Цикл			
			Если Параметры.ОграничениеВремениС = Неопределено И Параметры.ОграничениеВремениПО = Неопределено Тогда
				Параметры.ОграничениеВремениС  = СтрокаТЗ.Начало;
				Параметры.ОграничениеВремениПО = СтрокаТЗ.Окончание;
			Иначе
				Если Параметры.ОграничениеВремениС > СтрокаТЗ.Начало Тогда
					Параметры.ОграничениеВремениС  = СтрокаТЗ.Начало;
				КонецЕсли;	
				Если Параметры.ОграничениеВремениПО < СтрокаТЗ.Окончание Тогда
					Параметры.ОграничениеВремениПО = СтрокаТЗ.Окончание;
				КонецЕсли;				
			КонецЕсли;			
		КонецЦикла;		
		
		Для Счетчик = 1 По 7 Цикл
			ДеньРабочий = Ложь;
			// Параметры.Вставить("ОграничениеВремениС", Дата(01, 01, 01, 0, 0, 0));
			// Параметры.Вставить("ОграничениеВремениПО", Дата(01, 01, 01, 23, 59, 59));			
			Для Каждого СтрокаТЗ Из ПериодыРаботыСтруктурнойЕдиницы Цикл
				Если ДеньНедели(СтрокаТЗ.ДеньНедели) = ДеньНедели(Дата(2001, 1, Счетчик)) Тогда
					ДеньРабочий = Истина;
					// Параметры.Вставить("ОграничениеВремениС", СтрокаТЗ.Начало);
					// Параметры.Вставить("ОграничениеВремениПО", СтрокаТЗ.Окончание);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ДеньРабочий = Истина Тогда
				ГруппировкаСсылка = НачалоНедели(Параметры.Дата) + (Счетчик - 1) * 60 * 60 * 24;						
				ЗаполнитьГрафикСобытийПоГруппам(ТабличныйДокумент, ТаблицаИнтервалов.Скопировать(Новый Структура("ДатаИнтервала", ГруппировкаСсылка)), Счетчик, 7, ГруппировкаСсылка, Ложь, Параметры, Неопределено, ИнтервалВремени, ВыводНаПечать);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли Параметры.СтраницаМенеджера = "Сотрудники" Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИнтервалыЛистаОжидания.Контрагент) КАК КоличествоВЛистеОжидания
		|ИЗ
		|	РегистрСведений.НастройкиСотрудников КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнтервалыЛистаОжидания КАК ИнтервалыЛистаОжидания
		|		ПО Сотрудники.Сотрудник = ИнтервалыЛистаОжидания.Сотрудник
		|			И (ИнтервалыЛистаОжидания.Дата = &Дата)
		|			И (ИнтервалыЛистаОжидания.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)
		|ГДЕ
		|	Сотрудники.Сотрудник.ПометкаУдаления = ЛОЖЬ
		|	И НЕ Сотрудники.Сотрудник.Служебный
		|	И Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И (""Все"" В (&Сотрудники)
		|			ИЛИ Сотрудники.Сотрудник В (&Сотрудники)
		|			ИЛИ Сотрудники.Сотрудник.Должность В (&Сотрудники))
		|	И ВЫБОР
		|			КОГДА &УчитыватьГрафикРаботы = ИСТИНА
		|				ТОГДА Сотрудники.Сотрудник В
		|						(ВЫБРАТЬ
		|							РабочиеДниСотрудников.Сотрудник
		|						ИЗ
		|							РегистрСведений.ВремяРаботыСотрудниковПлан КАК РабочиеДниСотрудников
		|						ГДЕ
		|							НАЧАЛОПЕРИОДА(РабочиеДниСотрудников.ДатаВремяНачала, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
		|							И РабочиеДниСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА НЕ Сотрудники.Сотрудник.Должность = ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
		|				ТОГДА Сотрудники.Сотрудник.Должность.ОтображатьВЖурналеПредварительнойЗаписи = ИСТИНА
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И (Сотрудники.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(Сотрудники.ДатаУвольнения КАК ДАТА), ДЕНЬ) > НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
		|			ИЛИ Сотрудники.ДатаУвольнения ЕСТЬ NULL)
		|
		|СГРУППИРОВАТЬ ПО
		|	Сотрудники.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудники.Сотрудник.Должность.Наименование,
		|	Сотрудники.Сотрудник.Наименование");
					
		Запрос.УстановитьПараметр("УчитыватьГрафикРаботы",?(ПараметрыЗнач.Свойство("УчитыватьГрафикРаботыСотрудников"),ПараметрыЗнач.УчитыватьГрафикРаботыСотрудников,Ложь));
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	 , Параметры.СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("Сотрудники"			 , Параметры.ВыбранныеСотрудники);
		Запрос.УстановитьПараметр("Дата"				 , Параметры.Дата);
		
		ТЗСотрудников = Запрос.Выполнить().Выгрузить();
		
		Параметры.ВыводитьСтрокуЛистОжидания = Параметры.ВыводитьСтрокуЛистОжидания И ТЗСотрудников.Итог("КоличествоВЛистеОжидания") > 0;	
		ТабличныйДокумент.ФиксацияСверху = ?(Параметры.ВыводитьСтрокуЛистОжидания, 2, 0);
		
		КоличествоВТЗ = ТЗСотрудников.Количество(); 
		Если КоличествоВТЗ = 0 Тогда
			НовСтрокаТЗСотрудников = ТЗСотрудников.Добавить();
			НовСтрокаТЗСотрудников.Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
			НовСтрокаТЗСотрудников.КоличествоВЛистеОжидания = 0;
			КоличествоВТЗ = 1;
		КонецЕсли;
				
		// Юля
		Если Параметры.Свойство("Дата") и Параметры.Дата <> Дата(1,1,1) Тогда
			ДатаРаботы = Параметры.Дата;
		Иначе
			ДатаРаботы = НачалоДня(ТекущаяДата());
		КонецЕсли;   		
		Сп_Сотрудников = Новый СписокЗначений;
		Сп_Сотрудников.ЗагрузитьЗначения(ТЗСотрудников.ВыгрузитьКолонку("Сотрудник")); 		
		ТаблицаВремяРаботыСотрудников = ОбщегоНазначенияСтоматология.ВернутьПериодыРаботы(Сп_Сотрудников, ДатаРаботы, Новый Структура("СтруктурнаяЕдиница, КолДней", Параметры.СтруктурнаяЕдиница, 1)); 
		// Конец
		
		ЗаполнитьСписокСотрудниковЛистаОжидания = ПараметрыЗнач.Свойство("СписокСотрудниковВЛистеОжидания") И ТипЗнч(ПараметрыЗнач.СписокСотрудниковВЛистеОжидания) = Тип("СписокЗначений");
		
		Счетчик = 0;
		Для Каждого СтрокаТЗ Из ТЗСотрудников Цикл
			
			Счетчик = Счетчик + 1; 			
			ТаблицаИнтерваловГруппировки = ТаблицаИнтервалов.Скопировать(Новый Структура("ДатаИнтервала, Сотрудник", Параметры.Дата, СтрокаТЗ.Сотрудник));
			// Юля
			Если ТаблицаВремяРаботыСотрудников.Количество() <> 0 Тогда
				МассивВремяРаботыСотрудника = ТаблицаВремяРаботыСотрудников.НайтиСтроки(Новый Структура("Сотрудник", СтрокаТЗ.Сотрудник));
			Иначе
				МассивВремяРаботыСотрудника = Неопределено;
			КонецЕсли;
			//
			
			Параметры.Вставить("КоличествоПациентовВЛистеОжидания", СтрокаТЗ.КоличествоВЛистеОжидания);
			
			ЗаполнитьГрафикСобытийПоГруппам(
			ТабличныйДокумент, 
			ТаблицаИнтерваловГруппировки, 
			Счетчик, 
			КоличествоВТЗ, 
			СтрокаТЗ.Сотрудник, 
			Ложь, 
			Параметры, 
			МассивСотрудниковИОбластей, 
			ИнтервалВремени,
			ВыводНаПечать,
			МассивВремяРаботыСотрудника);
			
			Если ЗаполнитьСписокСотрудниковЛистаОжидания И ЗначениеЗаполнено(СтрокаТЗ.КоличествоВЛистеОжидания) Тогда
				ПараметрыЗнач.СписокСотрудниковВЛистеОжидания.Добавить(СтрокаТЗ.Сотрудник);		
			КонецЕсли;
				
		КонецЦикла;			
		
	ИначеЕсли Параметры.СтраницаМенеджера = "Помещения" Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Помещения.Родитель КАК Родитель,
		|	Помещения.Ссылка КАК Помещения
		|ИЗ
		|	Справочник.Помещения КАК Помещения
		|ГДЕ
		|	Помещения.ПометкаУдаления = ЛОЖЬ
		|	И Помещения.ОтображатьВРасписанииЗанятий = ИСТИНА
		|	И Помещения.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И (""Все"" В (&Помещения)
		|			ИЛИ Помещения.Ссылка В (&Помещения)
		|			ИЛИ Помещения.Ссылка.Родитель В (&Помещения))
		|	И Помещения.ЭтоГруппа = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	Помещения.Ссылка,
		|	Помещения.Родитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	Родитель,
		|	Помещения.Наименование");		
		
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Параметры.СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("Помещения"		  , Параметры.ВыбранныеПомещения);
		МассивГруппировок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Помещения");
		
		Если МассивГруппировок.Количество() = 0 Тогда
			МассивГруппировок.Добавить(Справочники.Помещения.ПустаяСсылка());
		КонецЕсли;	
		Счетчик = 0;
		Для Каждого ГруппировкаСсылка Из МассивГруппировок Цикл
			Счетчик = Счетчик + 1;
			ТаблицаИнтерваловГруппировки = ТаблицаИнтервалов.Скопировать(Новый Структура("ДатаИнтервала, Помещение", Параметры.Дата, ГруппировкаСсылка));
			ЗаполнитьГрафикСобытийПоГруппам(ТабличныйДокумент, ТаблицаИнтерваловГруппировки, Счетчик, МассивГруппировок.Количество(), ГруппировкаСсылка, Ложь, Параметры, Неопределено, ИнтервалВремени, ВыводНаПечать);
			
		КонецЦикла;		
	КонецЕсли;
	
	// Форматирование документа устанавливаем
	ТабличныйДокумент.Область(2, 3,ТабличныйДокумент.ВысотаТаблицы,ТабличныйДокумент.ШиринаТаблицы).РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	ТабличныйДокумент.Область(2,,ТабличныйДокумент.ВысотаТаблицы,).ВысотаСтроки = 10;
	
	Если Параметры.Свойство("ОграничениеНаШиринуДня") Тогда
		ПараметрыЗнач.Вставить("ОграничениеНаШиринуДня", Параметры.ОграничениеНаШиринуДня);
	КонецЕсли;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Процедура заполняет данными поле табличного документа ПолеТабличногоДокументаДень.
//
// Параметры
//  НЕТ
//
// Возвращаемое значение
//  НЕТ
Процедура ЗаполнитьГрафикСобытийПоГруппам(
	ТабличныйДокумент, 
	ТаблицаИнтервалов, 
	НомерГруппы, 
	ВсегоГрупп, 
	ГруппировкаСсылка, 
	ВставитьРазделительДней = Ложь, 
	Параметры, 
	МассивСотрудниковИОбластей,
	ИнтервалВремени, 
	ВыводНаПечать = Ложь,
	МассивВремяРаботыСотрудника = Неопределено)
	
	Если ИнтервалВремени = Неопределено Тогда
		ИнтервалВремени = 15;
	КонецЕсли;
	Если ТипЗнч(ГруппировкаСсылка) = Тип("Дата") Тогда
		ДатаРаботы = ГруппировкаСсылка;
	Иначе
		ДатаРаботы = Параметры.Дата;
	КонецЕсли;
	
	ЦветРабочегоВремени 	= Новый Цвет(255, 255, 255);	
	ШиринаЭкранаСтрокой		= Сред(Параметры.РазрешениеЭкрана, 1, Найти(Параметры.РазрешениеЭкрана, "*") - 1);
	ШиринаЭкрана 			= ?(ЗначениеЗаполнено(ШиринаЭкранаСтрокой), Число(ШиринаЭкранаСтрокой), 640);	
	// 3. Определение места в периоде
	ТаблицаКобработке = ТаблицаИнтервалов.Скопировать();	
	НомерСтрокиНачало = 0;
	НомерСтрокиКонец  = 0;	
	ДобавочнаяШиринаПоследнейЯчеки = 0;	
	Если ТаблицаКобработке.Количество() > 0 Тогда		
		КопияТаблицаКобработке = ТаблицаКобработке.Скопировать();		
		КопияТаблицаКобработке.Сортировать("НомерНачальнойСтроки ВОЗР");
		НомерСтрокиНачало = КопияТаблицаКобработке[0].НомерНачальнойСтроки;		
		КопияТаблицаКобработке.Сортировать("НомерКонечнойСтроки УБЫВ");
		НомерСтрокиКонец = КопияТаблицаКобработке[0].НомерКонечнойСтроки;		
	КонецЕсли; 
	
	КоличествоСтрок = (60/ИнтервалВремени) * 24;
	СписокЗначенийВремен = Новый СписокЗначений;	
	Если НомерСтрокиНачало <> 0 И НомерСтрокиКонец <> 0 Тогда		
		Для а=1 По КоличествоСтрок Цикл
			НовыйСписок = Новый СписокЗначений;
			СписокЗначенийВремен.Добавить(НовыйСписок);
		КонецЦикла;		
		Для а=НомерСтрокиНачало По НомерСтрокиКонец Цикл			
			НовыйСписок = СписокЗначенийВремен[а-1].Значение;			
			ИндексСтрокиТаблицы = 0;
			Пока Истина Цикл				
				Если ИндексСтрокиТаблицы > ТаблицаКобработке.Количество() - 1 Тогда
					Прервать;
				КонецЕсли; 				
				СтрокаТаблицы = ТаблицаКобработке[ИндексСтрокиТаблицы];				
				Если СтрокаТаблицы.НомерНачальнойСтроки <= а И СтрокаТаблицы.НомерКонечнойСтроки >= а Тогда					
					ЕстьСвободноеМесто = Ложь;					
					Для каждого ЭлементНовогоСписка Из НовыйСписок Цикл						
						Если ЭлементНовогоСписка.Значение = Неопределено Тогда							
							ЭлементНовогоСписка.Значение = СтрокаТаблицы.ИндексСтроки;							
							ЕстьСвободноеМесто = Истина;
							ИндексСписка = НовыйСписок.Индекс(ЭлементНовогоСписка);
							Прервать;							
						КонецЕсли;						
					КонецЦикла;					
					Если НЕ ЕстьСвободноеМесто Тогда						
						Если НовыйСписок.Количество() >= 18 Тогда
							Прервать;
						КонецЕсли; 						
						ВновьВведенныйЭлемент = НовыйСписок.Добавить(СтрокаТаблицы.ИндексСтроки);
						ИндексСписка = НовыйСписок.Индекс(ВновьВведенныйЭлемент);						
					КонецЕсли;					
					Если а <= СписокЗначенийВремен.Количество() Тогда						
						ИндексТекущегоСписка = а - 1 + 1;
						Для б = а По СтрокаТаблицы.НомерКонечнойСтроки - 1 Цикл							
							ТекущийСписок = СписокЗначенийВремен[б].Значение;							
							Если ТекущийСписок.Количество() < (ИндексСписка + 1) Тогда								
								Для с = (ТекущийСписок.Количество() + 1) По (ИндексСписка + 1) Цикл									
									ТекущийСписок.Добавить(Неопределено);									
								КонецЦикла;								
							КонецЕсли;						
							ТекущийСписок[ИндексСписка].Значение = СтрокаТаблицы.ИндексСтроки;							
						КонецЦикла; 						
					КонецЕсли; 					
					ТаблицаКобработке.Удалить(СтрокаТаблицы);
					Продолжить;					
				КонецЕсли;				
				ИндексСтрокиТаблицы = ИндексСтрокиТаблицы + 1;				
			КонецЦикла; 			
		КонецЦикла;		
	КонецЕсли; 
	
	// Проведем распределение заново
	МаксимальноеКоличество = 0;
	Для каждого СтрокаВремени Из СписокЗначенийВремен Цикл
		СписокТекущегоВремени = СтрокаВремени.Значение;
		Если СписокТекущегоВремени.Количество() > МаксимальноеКоличество Тогда
			МаксимальноеКоличество = СписокТекущегоВремени.Количество();		
		КонецЕсли;
	КонецЦикла;	
	Для каждого СтрокаВремени Из СписокЗначенийВремен Цикл		
		СписокТекущегоВремени = СтрокаВремени.Значение;	
		Если ТипЗнч(СписокТекущегоВремени) = Тип("СписокЗначений") И СписокТекущегоВремени.Количество() > 0 Тогда		
			Для каждого ЭлементДокумента Из СписокТекущегоВремени Цикл			
				СтрокиТаблицыИнтервалов = ТаблицаИнтервалов.НайтиСтроки(Новый Структура("ИндексСтроки", ЭлементДокумента.Значение));
				Для каждого СтрокаТаблицы Из СтрокиТаблицыИнтервалов Цикл				
					СтрокаТаблицы.ПорядковыйНомерВДне = СписокТекущегоВремени.Индекс(ЭлементДокумента) + 1;				
				КонецЦикла;								
			КонецЦикла; 			
		КонецЕсли; 		
	КонецЦикла;	
	
    ИндексНачалаГруппы = -1;
	ИндексОкончанияГруппы = -1;
	Для ИнтексСписокЗначенийВремен = 0 По СписокЗначенийВремен.Количество() - 1 Цикл
		Если ИндексНачалаГруппы = -1 И СписокЗначенийВремен[ИнтексСписокЗначенийВремен].Значение.Количество() > 0 Тогда
			ИндексНачалаГруппы = ИнтексСписокЗначенийВремен;
		КонецЕсли;
		СовпаденияВСледующейСтроке = Ложь;
		Для Каждого ЭлементСписка Из СписокЗначенийВремен[ИнтексСписокЗначенийВремен].Значение Цикл
			Если ИнтексСписокЗначенийВремен < СписокЗначенийВремен.Количество() - 1 И СписокЗначенийВремен[ИнтексСписокЗначенийВремен + 1].Значение.НайтиПоЗначению(ЭлементСписка.Значение) <> Неопределено Тогда
				СовпаденияВСледующейСтроке = Истина;
			КонецЕсли;
		КонецЦикла;
		Если ИндексНачалаГруппы > 0 И (ИнтексСписокЗначенийВремен = СписокЗначенийВремен.Количество() - 1 ИЛИ Не СовпаденияВСледующейСтроке) Тогда
			ИндексОкончанияГруппы = ИнтексСписокЗначенийВремен;
		КонецЕсли;		
		Если ИндексНачалаГруппы >= 0 И ИндексОкончанияГруппы >= 0 Тогда
			КоличествоОдновременныхДокументов = 0;
			Для а = ИндексНачалаГруппы По ИндексОкончанияГруппы Цикл
				Если КоличествоОдновременныхДокументов < СписокЗначенийВремен[а].Значение.Количество() Тогда
					КоличествоОдновременныхДокументов = СписокЗначенийВремен[а].Значение.Количество();
				КонецЕсли;
			КонецЦикла;
			Для а = ИндексНачалаГруппы По ИндексОкончанияГруппы Цикл
				Для Каждого ЭлементСписка Из СписокЗначенийВремен[а].Значение Цикл
					Для каждого СтрокаТаблицы Из ТаблицаИнтервалов.НайтиСтроки(Новый Структура("ИндексСтроки", ЭлементСписка.Значение)) Цикл
						СтрокаТаблицы.КоличествоОдновременныхДокументов = КоличествоОдновременныхДокументов;	
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			ИндексНачалаГруппы = -1;
			ИндексОкончанияГруппы = -1;
		КонецЕсли;
	КонецЦикла;
	
	// Построение
	
	СмещениеОтНачалаПервойЯчейкиДня = Час(Параметры.ОграничениеВремениС) * (60/ИнтервалВремени);
	НомерПоследнейЯчейкиДня         = Час(Параметры.ОграничениеВремениПо)* (60/ИнтервалВремени) + ?(Минута(Параметры.ОграничениеВремениПо) > 0, (60/ИнтервалВремени), 0);

	КоэфРазрешения = КоэффициентЭкранаПоРазрешению(ШиринаЭкрана);
	
	ШиринаТабличногоПоляДня = Цел(ШиринаЭкрана / КоэфРазрешения) - 4 - 2 - ?(ВставитьРазделительДней, 4 + 2, 0) + ?(Параметры.Свойство("НаВсюФорму") И Параметры.НаВсюФорму = Истина, 34, 0); 
	//	ШиринаТабличногоПоляДня = 140; // Цел(ШиринаЭкрана / КоэфРазрешения) - 4 - 2 - ?(ВставитьРазделительДней, 4 + 2, 0) + ?(Параметры.Свойство("НаВсюФорму") И Параметры.НаВсюФорму = Истина, 34, 0); 
	ОбщаяШиринаДня = Цел(ШиринаТабличногоПоляДня / (ВсегоГрупп * 4));
	
	Если НомерГруппы >= (ВсегоГрупп - (ШиринаТабличногоПоляДня - (ОбщаяШиринаДня * 4) * ВсегоГрупп) / 4) + 1 Тогда
		ОбщаяШиринаДня = ОбщаяШиринаДня + 1;
	КонецЕсли;
	ДобавочнаяШиринаПоследнейЯчеки = ШиринаТабличногоПоляДня % 1;
	Если ШиринаТабличногоПоляДня / (ВсегоГрупп * 4) < 4 Тогда
		ОбщаяШиринаДня = 4;
		Если Не Параметры.Свойство("ОграничениеНаШиринуДня") Тогда
			Параметры.Вставить("ОграничениеНаШиринуДня", 4);
		КонецЕсли;
	КонецЕсли;	
	
	ВыводитьСтрокуЛистОжидания = Ложь;
	Параметры.Свойство("ВыводитьСтрокуЛистОжидания", ВыводитьСтрокуЛистОжидания);
	
	РазмерШапки      = ?(ВыводитьСтрокуЛистОжидания = Истина, 2, 1);	
	СмещениеДняСлева = ТабличныйДокумент.ШиринаТаблицы;
	
	// Вставляем область времени
	Если НомерГруппы = 1 Или ВставитьРазделительДней Тогда
		ТабличныйДокумент.ВставитьОбласть(Параметры.МакетДня.Область(СмещениеОтНачалаПервойЯчейкиДня + 1, 1, НомерПоследнейЯчейкиДня, 2), ТабличныйДокумент.Область(1 + РазмерШапки, 1 + СмещениеДняСлева, НомерПоследнейЯчейкиДня - СмещениеОтНачалаПервойЯчейкиДня + РазмерШапки, 2 + СмещениеДняСлева));
		ТабличныйДокумент.Область(, 1 + СмещениеДняСлева, , 1 + СмещениеДняСлева).ШиринаКолонки  = 4;
		ТабличныйДокумент.Область(, 2 + СмещениеДняСлева, , 2 + СмещениеДняСлева).ШиринаКолонки  = 2;
		Для а = РазмерШапки + 1 По ТабличныйДокумент.ВысотаТаблицы Цикл
			ТабличныйДокумент.Область(а, СмещениеДняСлева + 2).Расшифровка = Дата(01,01,01) + ((СмещениеОтНачалаПервойЯчейкиДня - РазмерШапки) + а - 1) * ИнтервалВремени * 60;
		КонецЦикла;
	КонецЕсли;	
	
	Если НомерГруппы = 1 Тогда
		ШиринаЧасов = 2;
	ИначеЕсли ВставитьРазделительДней Тогда
		ШиринаЧасов = 2;
	Иначе
		ШиринаЧасов = 0;
	КонецЕсли;
	
	// Вставляем область группы из макента
	ТабличныйДокумент.ВставитьОбласть(Параметры.МакетДня.Область(СмещениеОтНачалаПервойЯчейкиДня + 1, 2 + 1, НомерПоследнейЯчейкиДня, 2 + ОбщаяШиринаДня), ТабличныйДокумент.Область(РазмерШапки + 1, ШиринаЧасов + СмещениеДняСлева + 1, НомерПоследнейЯчейкиДня - СмещениеОтНачалаПервойЯчейкиДня + РазмерШапки, ШиринаЧасов + СмещениеДняСлева + ОбщаяШиринаДня));
	// ТабличныйДокумент.Область(РазмерШапки + 1, , НомерПоследнейЯчейкиДня - СмещениеОтНачалаПервойЯчейкиДня + РазмерШапки, ).ВысотаСтроки = 11;
	ТабличныйДокумент.Область(, ШиринаЧасов + СмещениеДняСлева + 1, , ШиринаЧасов + СмещениеДняСлева + ОбщаяШиринаДня).ШиринаКолонки = 4;
	Если НомерГруппы = ВсегоГрупп И ЗначениеЗаполнено(ДобавочнаяШиринаПоследнейЯчеки) Тогда
		ТабличныйДокумент.Область(, ШиринаЧасов + СмещениеДняСлева + ОбщаяШиринаДня, , ШиринаЧасов + СмещениеДняСлева + ОбщаяШиринаДня).ШиринаКолонки = 4 + ДобавочнаяШиринаПоследнейЯчеки;
	КонецЕсли;
	
	// Наименование дня
	ЗаполнениеГрафикаСобытийПоГруппамСформироватьОбластьНаименованияДняНедели(
	ТабличныйДокумент,	
	ГруппировкаСсылка, 
	МассивСотрудниковИОбластей,
	Параметры,
	ВыводНаПечать, 
	ОбщаяШиринаДня, 
	РазмерШапки, 
	СмещениеДняСлева, 
	ШиринаЧасов,
	ВсегоГрупп);
	
	// Вывод событий дня		
	ОбластьРабочегоДня = ТабличныйДокумент.Область(1 + РазмерШапки, 1 + ШиринаЧасов + СмещениеДняСлева,НомерПоследнейЯчейкиДня-СмещениеОтНачалаПервойЯчейкиДня + РазмерШапки, ОбщаяШиринаДня + ШиринаЧасов + СмещениеДняСлева);
	ОбластьРабочегоДня.ЦветФона = Новый Цвет(218, 212, 205);
	
	// Устанавливаем цвет работы сотрудника
	Если Параметры.ВыбранныеСотрудники.Количество() = 1 И ТипЗнч(Параметры.ВыбранныеСотрудники[0]) = Тип("СправочникСсылка.Сотрудники") Тогда
		ОбъектРасскрашивания = Параметры.ВыбранныеСотрудники[0];
	ИначеЕсли ТипЗнч(ГруппировкаСсылка) = Тип("СправочникСсылка.Сотрудники") Тогда
		ОбъектРасскрашивания = ГруппировкаСсылка;
	ИначеЕсли ТипЗнч(ГруппировкаСсылка) = Тип("Дата") Или ТипЗнч(ГруппировкаСсылка) = Тип("СправочникСсылка.Помещения") Тогда
		ОбъектРасскрашивания = Параметры.СтруктурнаяЕдиница;
	Иначе
		ОбъектРасскрашивания = ГруппировкаСсылка;
	КонецЕсли;	
	
	НомерНачалоПериодаРаботыСтоматологии = ОбщегоНазначенияКлиентСерверСтоматология.ВозвратитьНомерСтрокиПоДате(Параметры.ОграничениеВремениС, Ложь) - СмещениеОтНачалаПервойЯчейкиДня;
	НомерОкончанияПериодаРаботыСтоматологии = ОбщегоНазначенияКлиентСерверСтоматология.ВозвратитьНомерСтрокиПоДате(Параметры.ОграничениеВремениПО, Истина) - СмещениеОтНачалаПервойЯчейкиДня;
		
	// Юля 	
	Если Параметры.СтраницаМенеджера = "Сотрудники"  Тогда
		Если Не МассивВремяРаботыСотрудника = Неопределено Тогда
			Для Каждого ПериодРаботыГруппы Из МассивВремяРаботыСотрудника Цикл
				НомерНачалоПериода = ОбщегоНазначенияКлиентСерверСтоматология.ВозвратитьНомерСтрокиПоДате(ПериодРаботыГруппы.Начало, Ложь, ИнтервалВремени) - СмещениеОтНачалаПервойЯчейкиДня;
				НомерОкончанияПериода = ОбщегоНазначенияКлиентСерверСтоматология.ВозвратитьНомерСтрокиПоДате(ПериодРаботыГруппы.Окончание, Истина, ИнтервалВремени) - СмещениеОтНачалаПервойЯчейкиДня;		
				Если (НомерНачалоПериода < 0 И НомерОкончанияПериода < 0) Или (НомерНачалоПериода > НомерПоследнейЯчейкиДня - СмещениеОтНачалаПервойЯчейкиДня И НомерОкончанияПериода > НомерПоследнейЯчейкиДня - СмещениеОтНачалаПервойЯчейкиДня) Тогда 
					Продолжить;
				КонецЕсли;	
				НомерНачалаРаботыСтруктурнойЕдиницы = ?(НомерНачалоПериода < НомерНачалоПериодаРаботыСтоматологии, НомерНачалоПериодаРаботыСтоматологии, НомерНачалоПериода);
				НомерОкончанияРаботыСтруктурнойЕдиницы =  ?(НомерОкончанияПериода > НомерОкончанияПериодаРаботыСтоматологии, НомерОкончанияПериодаРаботыСтоматологии, НомерОкончанияПериода);	
				ОбластьРабочегоДня = ТабличныйДокумент.Область(РазмерШапки + НомерНачалоПериода, 1 + ШиринаЧасов + СмещениеДняСлева, РазмерШапки + НомерОкончанияПериода, ОбщаяШиринаДня + ШиринаЧасов + СмещениеДняСлева);
				ОбластьРабочегоДня.ЦветФона = ЦветРабочегоВремени;// ЦветаСтиля.ЦветФонаКнопки;		
			КонецЦикла;
		КонецЕсли;
	Иначе 		
		Для Каждого ПериодРаботыГруппы Из ОбщегоНазначенияСтоматология.ВернутьПериодыРаботы(ОбъектРасскрашивания, ДатаРаботы, Новый Структура("СтруктурнаяЕдиница, КолДней", Параметры.СтруктурнаяЕдиница, 1)) Цикл
			НомерНачалоПериода = ОбщегоНазначенияКлиентСерверСтоматология.ВозвратитьНомерСтрокиПоДате(ПериодРаботыГруппы.Начало, Ложь, ИнтервалВремени) - СмещениеОтНачалаПервойЯчейкиДня;
			НомерОкончанияПериода = ОбщегоНазначенияКлиентСерверСтоматология.ВозвратитьНомерСтрокиПоДате(ПериодРаботыГруппы.Окончание, Истина, ИнтервалВремени) - СмещениеОтНачалаПервойЯчейкиДня;		
			Если (НомерНачалоПериода < 0 И НомерОкончанияПериода < 0) Или (НомерНачалоПериода > НомерПоследнейЯчейкиДня - СмещениеОтНачалаПервойЯчейкиДня И НомерОкончанияПериода > НомерПоследнейЯчейкиДня - СмещениеОтНачалаПервойЯчейкиДня) Тогда 
				Продолжить;
			КонецЕсли;	
			НомерНачалаРаботыСтруктурнойЕдиницы = ?(НомерНачалоПериода < НомерНачалоПериодаРаботыСтоматологии, НомерНачалоПериодаРаботыСтоматологии, НомерНачалоПериода);
			НомерОкончанияРаботыСтруктурнойЕдиницы =  ?(НомерОкончанияПериода > НомерОкончанияПериодаРаботыСтоматологии, НомерОкончанияПериодаРаботыСтоматологии, НомерОкончанияПериода);	
			ОбластьРабочегоДня = ТабличныйДокумент.Область(РазмерШапки + НомерНачалоПериода, 1 + ШиринаЧасов + СмещениеДняСлева, РазмерШапки + НомерОкончанияПериода, ОбщаяШиринаДня + ШиринаЧасов + СмещениеДняСлева);
			ОбластьРабочегоДня.ЦветФона = ЦветРабочегоВремени;// ЦветаСтиля.ЦветФонаКнопки;		
		КонецЦикла;	
	КонецЕсли;
	// Конец
	
	КонечнаяСтрокаРабочегоДня  = Неопределено;
	НачальнаяСтрокаРабочегоДня = Неопределено;
    // СтруктураРасшифровки       = Новый Структура("Дата,Интервал,Сотрудник, РабочееВремя,Событие, ИндексВТЧ");         
	Для а = СмещениеОтНачалаПервойЯчейкиДня + 1 По НомерПоследнейЯчейкиДня Цикл			
		ТекОбласть = ТабличныйДокумент.Область(а - СмещениеОтНачалаПервойЯчейкиДня + РазмерШапки, СмещениеДняСлева + ШиринаЧасов + 1, а - СмещениеОтНачалаПервойЯчейкиДня + РазмерШапки, СмещениеДняСлева + ШиринаЧасов + ОбщаяШиринаДня);
		Объединять = Истина;
		Для Каждого СтрокаТИ Из ТаблицаИнтервалов Цикл
			Если СтрокаТИ.НомерНачальнойСтроки <= а
				И СтрокаТИ.НомерКонечнойСтроки >= а Тогда
				Объединять = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Объединять Тогда
			ТекОбласть.Объединить();	
		КонецЕсли;
		Интервал     = а - 1;
		ПараметрОснования = Неопределено;
		Если ТипЗнч(ГруппировкаСсылка) = Тип("Дата") Тогда
			Дата = ГруппировкаСсылка;
		Иначе
			Дата              = ДатаРаботы;
			ПараметрОснования = ГруппировкаСсылка;			
		КонецЕсли;
		РабочееВремя   = ТекОбласть.ЦветФона = ЦветРабочегоВремени;	
		СтрокаВозврата = "" + Дата 
		              + "," + Интервал 
	                  + "," + ?(ЗначениеЗаполнено(ПараметрОснования),ПараметрОснования.УникальныйИдентификатор(),"")
		              + "," + РабочееВремя;	
		ТекОбласть.Расшифровка = СтрокаВозврата;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СписокЗначенийВремен) Тогда		
		Если ТипЗнч(ТаблицаИнтервалов) = Тип("ТаблицаЗначений") Тогда
			Если ТаблицаИнтервалов.Колонки.Найти("ИндексСтроки")<>Неопределено ТОгда
				ТаблицаИнтервалов.Индексы.Добавить("ИндексСтроки");
			КонецЕсли;
		КонецЕсли;		
		ОбщаяШиринаДняДляРаспределенияСобытий = ОбщаяШиринаДня;		
		// определим колонки для таблицы событий (независимо от диапазона показа)
		Для а = 0 По КоличествоСтрок-1 Цикл		
			ПоследнийСтолбец = 0;		
			СписокТекущихДокументов = СписокЗначенийВремен.Получить(а).Значение;		
			Для каждого ТекДокумент Из СписокТекущихДокументов Цикл			
				СтрокаТаблицыДокументов = ТаблицаИнтервалов.Найти(ТекДокумент.Значение, "ИндексСтроки");
				Если СтрокаТаблицыДокументов <> Неопределено Тогда
					ШиринаТекущегоДокумента = Цел(ОбщаяШиринаДняДляРаспределенияСобытий/?(СтрокаТаблицыДокументов.КоличествоОдновременныхДокументов=0, 1, СтрокаТаблицыДокументов.КоличествоОдновременныхДокументов));
				Иначе
					ШиринаТекущегоДокумента = 0;
					Продолжить;
				КонецЕсли;			
				Если СтрокаТаблицыДокументов.ПорядковыйНомерВДне = СтрокаТаблицыДокументов.КоличествоОдновременныхДокументов Тогда
					ШиринаТекущегоДокумента = ОбщаяШиринаДняДляРаспределенияСобытий - ПоследнийСтолбец;
				КонецЕсли;  			
				Если СтрокаТаблицыДокументов.НомерНачальнойКолонки = 0 И СтрокаТаблицыДокументов.НомерКонечнойКолонки = 0 Тогда
					СтрокаТаблицыДокументов.НомерНачальнойКолонки = ПоследнийСтолбец + 1;
					СтрокаТаблицыДокументов.НомерКонечнойКолонки = ПоследнийСтолбец + ШиринаТекущегоДокумента;
				КонецЕсли;			
				ПоследнийСтолбец = СтрокаТаблицыДокументов.НомерНачальнойКолонки - 1 + ШиринаТекущегоДокумента;				
			КонецЦикла; 			
		КонецЦикла;   
		
		ИндексСтрокиТаблицы = 0;
		// СтруктураДанных     = Новый Структура("Событие, ИндексВТЧ,РабочееВремя");
		Пока Истина Цикл		
			Если ИндексСтрокиТаблицы > ТаблицаИнтервалов.Количество() - 1 Тогда
				Прервать;
			КонецЕсли; 		
			СтрокаТаблицы = ТаблицаИнтервалов[ИндексСтрокиТаблицы];		
			Если СтрокаТаблицы.НомерНачальнойКолонки = 0 ИЛИ СтрокаТаблицы.НомерКонечнойКолонки = 0 Тогда
				ТаблицаИнтервалов.Удалить(СтрокаТаблицы);
			Иначе
				ИндексСтрокиТаблицы = ИндексСтрокиТаблицы + 1;
			КонецЕсли; 			
		КонецЦикла; 		
		Для каждого СтрокаТаблицы Из ТаблицаИнтервалов Цикл		
			ПерваяСтрокаОбласти    = СтрокаТаблицы.НомерНачальнойСтроки-СмещениеОтНачалаПервойЯчейкиДня;
			ПоследняяСтрокаОбласти = СтрокаТаблицы.НомерКонечнойСтроки-СмещениеОтНачалаПервойЯчейкиДня;
			Если ПерваяСтрокаОбласти < 1 Тогда
				Если ПоследняяСтрокаОбласти < 1 Тогда
					Продолжить;
				Иначе
					ПерваяСтрокаОбласти = 1;
				КонецЕсли;
			ИначеЕсли ПерваяСтрокаОбласти > НомерПоследнейЯчейкиДня-СмещениеОтНачалаПервойЯчейкиДня Тогда
				Продолжить;
			КонецЕсли;		
			Если ПоследняяСтрокаОбласти > НомерПоследнейЯчейкиДня-СмещениеОтНачалаПервойЯчейкиДня Тогда
				ПоследняяСтрокаОбласти = НомерПоследнейЯчейкиДня-СмещениеОтНачалаПервойЯчейкиДня;
			КонецЕсли;			
				
			ВысотаГруппы = (ПоследняяСтрокаОбласти + РазмерШапки) - (ПерваяСтрокаОбласти + РазмерШапки);
			
			Отбор = Новый Структура("Событие",СтрокаТаблицы.Событие);
			
			МассивМетокСобытия = Параметры.ТаблицаМеток.НайтиСтроки(Отбор);
			
			// ТаблицаМетокСобытия = РегистрыСведений.МеткиКлиентов.ПолучитьМеткиКлиента(СтрокаТаблицы.Событие,ТекущаяДата());
			// Если ТаблицаМетокСобытия.Количество() > 0 Тогда
			Если МассивМетокСобытия.Количество() > 0 Тогда
				СдвигДляМетки = Цел(МассивМетокСобытия.Количество() / (ВысотаГруппы+1))+?((МассивМетокСобытия.Количество() / (ВысотаГруппы+1))-Цел(МассивМетокСобытия.Количество() / (ВысотаГруппы+1)) > 0, 1, 0);
			Иначе
				СдвигДляМетки = 1;
			КонецЕсли;                              			
			СтолбецМетки    = 0;
			СтрокаМетки     = 0;      
			
			// Для Индекс = 0 По ВысотаГруппы Цикл
			//	ОбластьМеток = ТабличныйДокумент.Область(ПерваяСтрокаОбласти + РазмерШапки + Индекс, СтрокаТаблицы.НомерНачальнойКолонки + СмещениеДняСлева + ШиринаЧасов, ПерваяСтрокаОбласти + РазмерШапки + Индекс, СтрокаТаблицы.НомерНачальнойКолонки + 6 + СмещениеДняСлева + ШиринаЧасов);			
			//	ОбластьМеток.Разъединить();
			// КонецЦикла;
			
			Для Индекс = 0 По СдвигДляМетки*(ВысотаГруппы+1)-1 Цикл
				Если СтолбецМетки < Цел(Индекс/(ВысотаГруппы+1)) Тогда
					СтолбецМетки = Цел(Индекс/(ВысотаГруппы+1));
					СтрокаМетки = 0;
				КонецЕсли;
				ОбластьМетки = ТабличныйДокумент.Область(ПерваяСтрокаОбласти + РазмерШапки + СтрокаМетки, СтрокаТаблицы.НомерНачальнойКолонки + СмещениеДняСлева + ШиринаЧасов + СтолбецМетки, ПерваяСтрокаОбласти + РазмерШапки + СтрокаМетки, СтрокаТаблицы.НомерНачальнойКолонки + СмещениеДняСлева + ШиринаЧасов + СтолбецМетки);
				Если СтрокаМетки < ВысотаГруппы Тогда
					ОбластьМетки.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
					ОбластьМетки.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
				Иначе
					ОбластьМетки.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
				КонецЕсли;
				ОбластьМетки.Текст = "";
				
				Если Индекс <= МассивМетокСобытия.Количество()-1 Тогда				
					Если ЗначениеЗаполнено(МассивМетокСобытия[Индекс].Метка.ЦветМетки) Тогда
						ОбластьМетки.ЦветФона = ЗначениеИзСтрокиВнутр(МассивМетокСобытия[Индекс].Метка.ЦветМетки);		
					Иначе
						ОбластьМетки.ЦветФона = Новый Цвет();
					КонецЕсли;	
				Иначе 
					ОбластьМетки.ЦветФона = ОбщегоНазначенияСтоматология.ПолучитьЦветФонаСобытия(СтрокаТаблицы.Статус, СтрокаТаблицы.Событие, , СтрокаТаблицы.ЭтоПеренос);
				КонецЕсли;
				СтрокаМетки    = СтрокаМетки + 1;
				Интервал       = "";
				Дата           = "";
				РабочееВремя   = Истина;	
				// Преобразование массива в строку
				ИндексВТЧМассив = "";
				Если  ТипЗнч(СтрокаТаблицы.ИндексВТЧ) = Тип("Массив") Тогда
					Для Каждого Элемент ИЗ СтрокаТаблицы.ИндексВТЧ Цикл
						ИндексВТЧМассив = ИндексВТЧМассив + Элемент + ";";	
					КонецЦикла;	 
				Иначе
					ИндексВТЧМассив = "" + СтрокаТаблицы.ИндексВТЧ + ";";
				КонецЕсли;				
				Если ТипЗнч(СтрокаТаблицы.Событие) = Тип("Структура") Тогда
					Дата                   = СтрокаТаблицы.Событие.ДатаВремяНачала;
					Интервал               = СтрокаТаблицы.Событие.ДатаВремяОкончания - СтрокаТаблицы.Событие.ДатаВремяНачала;
					ПараметрОснования      = ?(ЗначениеЗаполнено(СтрокаТаблицы.Событие.Сотрудник),СтрокаТаблицы.Событие.Сотрудник.УникальныйИдентификатор(),"");
					РабочееВремя           = СтрокаТаблицы.Событие.ПризнакДежурства;
					ОбластьМетки.Расшифровка = "" +Дата+ "," +Интервал+  "," +ПараметрОснования +"," +РабочееВремя+ ",,,," + СтрокаТаблицы.ЭтоПеренос;
				Иначе
					Дата                   = СтрокаТаблицы.ДатаИнтервала;
					Интервал               = СтрокаТаблицы.НомерНачальнойСтроки - 1;
					ПараметрОснования      = ?(ЗначениеЗаполнено(СтрокаТаблицы.Сотрудник),СтрокаТаблицы.Сотрудник.УникальныйИдентификатор(),"");			
					ДокументЗаписи         = ?(ЗначениеЗаполнено(СтрокаТаблицы.Событие),СтрокаТаблицы.Событие.УникальныйИдентификатор(),"");
					Резерв                 = ?(ТипЗнч(СтрокаТаблицы.Событие) = Тип("ДокументСсылка.Событие"), СтрокаТаблицы.Резерв, "");	
					ОбластьМетки.Расшифровка = "" +Дата+ "," +Интервал+ "," +ПараметрОснования+ ",Да," +ДокументЗаписи+ "," +ИндексВТЧМассив+","+Резерв+","+ СтрокаТаблицы.ЭтоПеренос;
				КонецЕсли;				
			КонецЦикла;
			
//=====================================================РАБОТА С ПИКТОГРАММАМИ В ЯЧЕЙКЕ ПРЕДВАРИТЕЛЬНОЙ ЗАПИСИ=======================================================
			СдвигДляКартинкиЗадолженность 				= 0;
			СдвигДляКартинкиНезавершенныеНарядЗаказы 	= 0;
			Если Параметры.Свойство("ВыводитьКартинки") И Параметры.ВыводитьКартинки = Истина Тогда 
				СдвигДляКартинкиЗадолженность 				= ?(СтрокаТаблицы.ЕстьЗадолженность, 1, 0);
				СдвигДляКартинкиНезавершенныеНарядЗаказы 	= ?(СтрокаТаблицы.ЕстьНезавершенныеНарядЗаказы, 1, 0);
			КонецЕсли;
			ТекОбласть = ТабличныйДокумент.Область(ПерваяСтрокаОбласти + РазмерШапки, СтрокаТаблицы.НомерНачальнойКолонки + СмещениеДняСлева + ШиринаЧасов + СдвигДляМетки, ПоследняяСтрокаОбласти + РазмерШапки, СтрокаТаблицы.НомерКонечнойКолонки + СмещениеДняСлева + ШиринаЧасов);
			ТекОбластьДляКартинок1 = ТабличныйДокумент.Область(ПерваяСтрокаОбласти + РазмерШапки, СтрокаТаблицы.НомерНачальнойКолонки + СмещениеДняСлева + ШиринаЧасов + СдвигДляМетки, ПерваяСтрокаОбласти + РазмерШапки, СтрокаТаблицы.НомерНачальнойКолонки + СмещениеДняСлева + ШиринаЧасов + СдвигДляМетки);
			ТекОбластьДляКартинок2 = ТабличныйДокумент.Область(ПерваяСтрокаОбласти + РазмерШапки, СтрокаТаблицы.НомерНачальнойКолонки + СмещениеДняСлева + ШиринаЧасов + СдвигДляМетки + СдвигДляКартинкиЗадолженность, ПерваяСтрокаОбласти + РазмерШапки, СтрокаТаблицы.НомерНачальнойКолонки + СмещениеДняСлева + ШиринаЧасов + СдвигДляМетки + СдвигДляКартинкиЗадолженность);			
			ТекОбластьДляКартинок3 = ТабличныйДокумент.Область(ПерваяСтрокаОбласти + РазмерШапки, СтрокаТаблицы.НомерНачальнойКолонки + СмещениеДняСлева + ШиринаЧасов + СдвигДляМетки + СдвигДляКартинкиЗадолженность + СдвигДляКартинкиНезавершенныеНарядЗаказы, ПерваяСтрокаОбласти + РазмерШапки, СтрокаТаблицы.НомерНачальнойКолонки + СмещениеДняСлева + ШиринаЧасов + СдвигДляМетки + СдвигДляКартинкиЗадолженность + СдвигДляКартинкиНезавершенныеНарядЗаказы);			
			ТекстЯчейки = "";			
			// Вставляем в область картинку состояния блокировки услуги
			Если СтрокаТаблицы.ПризнакЗаблокированно = 1 И Параметры.Свойство("ВыводитьКартинки") И Параметры.ВыводитьКартинки = Истина Тогда
				// Добавляем новый Рисунок типа Картинка
				РисунокТД = ТабличныйДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка); 
				// выводим рисунов в область документа
				РисунокТД.Расположить(ТекОбласть);
				РисунокТД.Высота   = 4; РисунокТД.Ширина = 4;	
				РисунокТД.Линия    = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
				РисунокТД.Узор     = ТипУзораТабличногоДокумента.БезУзора;
				РисунокТД.Картинка = ?(СтрокаТаблицы.ПризнакЗаблокированно = 1, БиблиотекаКартинок.ЗамокБлокировкаБелая, БиблиотекаКартинок.КартинкаОсвободить);
				ТекстЯчейки        = ТекстЯчейки + "     ";
			КонецЕсли;			
			Если СтрокаТаблицы.ТелефонныйЗвонок И Параметры.Свойство("ВыводитьКартинки") И Параметры.ВыводитьКартинки = Истина Тогда
				// Добавляем новый Рисунок типа Картинка для телефонного звонка
				РисунокТД = ТабличныйДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка); 
				// выводим рисунов в область документа
			   	РисунокТД.РазмерКартинки = РазмерКартинки.АвтоРазмер;
				РисунокТД.Линия    = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
				РисунокТД.Узор     = ТипУзораТабличногоДокумента.БезУзора;
				РисунокТД.Картинка = БиблиотекаКартинок.ВидВзаимодействияБелая_21;
				РисунокТД.Расположить(ТекОбластьДляКартинок1);
		       	ТекстЯчейки        = ТекстЯчейки + "         ";
			КонецЕсли;	
			
			
			Если СтрокаТаблицы.ЕстьЗадолженность И Параметры.Свойство("ВыводитьКартинки") И Параметры.ВыводитьКартинки = Истина Тогда
				// Добавляем новый Рисунок типа Картинка для задолженности
				РисунокТД = ТабличныйДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка); 
				// выводим рисунов в область документа
			   	РисунокТД.РазмерКартинки = РазмерКартинки.АвтоРазмер;
				РисунокТД.Линия    = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
				РисунокТД.Узор     = ТипУзораТабличногоДокумента.БезУзора;
				РисунокТД.Картинка = БиблиотекаКартинок.ВидВзаимодействияБелая_12;
				РисунокТД.Расположить(?(СтрокаТаблицы.ТелефонныйЗвонок, ТекОбластьДляКартинок2, ТекОбластьДляКартинок1));
		       	ТекстЯчейки        = ?(СтрокаТаблицы.ТелефонныйЗвонок, ТекстЯчейки + "           ", ТекстЯчейки + "         ");
			КонецЕсли;
			Если СтрокаТаблицы.ЕстьНезавершенныеНарядЗаказы И Параметры.Свойство("ВыводитьКартинки") И Параметры.ВыводитьКартинки = Истина Тогда
				// Добавляем новый Рисунок типа Картинка для отображения статуса незавершенных наряд-заказов
				РисунокТД = ТабличныйДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка); 
				// выводим рисунов в область документа
			   	РисунокТД.РазмерКартинки = РазмерКартинки.АвтоРазмер;
				РисунокТД.Линия    = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
				РисунокТД.Узор     = ТипУзораТабличногоДокумента.БезУзора;
				Если СтрокаТаблицы.ОбщийСтатусНезавершенныхНарядЗаказов = Перечисления.СтатусыНарядЗаказа.Заказано Тогда 
					РисунокТД.Картинка = БиблиотекаКартинок.СтатусЗаказаноБелая;
				ИначеЕсли СтрокаТаблицы.ОбщийСтатусНезавершенныхНарядЗаказов = Перечисления.СтатусыНарядЗаказа.ВРаботе Тогда	
					РисунокТД.Картинка = БиблиотекаКартинок.СтатусВРаботеБелая;
				ИначеЕсли СтрокаТаблицы.ОбщийСтатусНезавершенныхНарядЗаказов = Перечисления.СтатусыНарядЗаказа.Выполнено Тогда
					РисунокТД.Картинка = БиблиотекаКартинок.СтатусВыполненоБелая;
				КонецЕсли;	
				Если СтрокаТаблицы.ТелефонныйЗвонок Тогда 
					Если СтрокаТаблицы.ЕстьЗадолженность Тогда 
						РисунокТД.Расположить(ТекОбластьДляКартинок3);
						ТекстЯчейки = ТекстЯчейки + "         ";
					Иначе 
						РисунокТД.Расположить(ТекОбластьДляКартинок3);
						ТекстЯчейки = ТекстЯчейки + "           ";
					КонецЕсли;
				Иначе 
					Если СтрокаТаблицы.ЕстьЗадолженность Тогда
						РисунокТД.Расположить(ТекОбластьДляКартинок2);
						ТекстЯчейки = ТекстЯчейки + "           ";
					Иначе 
						РисунокТД.Расположить(ТекОбластьДляКартинок1);
						ТекстЯчейки = ТекстЯчейки + "         ";
					КонецЕсли;	
				КонецЕсли;		
			КонецЕсли;	
			
			//=======================================================РАБОТА С ТЕКСТОМ В ЯЧЕЙКЕ ПРЕДВАРИТЕЛЬНОЙ ЗАПИСИ=========================================================
			
			ТекстЯчейки = ТекстЯчейки + ?(СтрокаТаблицы.ЭтоПеренос, "[Перенос] ", "");
			
			// Вставляем в область номер услуги в ТЧ
			Если СтрокаТаблицы.НомерБлокаСобытий > 0 Тогда
				ТекстЯчейки = ТекстЯчейки + "[ " + Строка(СтрокаТаблицы.НомерБлокаСобытий) + " ]" + " ";
			КонецЕсли;
			// Вставляем номер мед.карты, ФИО и телефон
			Если ЗначениеЗаполнено(СтрокаТаблицы.Контрагент) Тогда
				Если Найти(СтрокаТаблицы.Комментарий, СтрокаТаблицы.ФИОПациента) > 0 Тогда // Если комментарий заполнен контактной информацией, сформированной в ПЗ
					Комментарий = СтрокаТаблицы.Комментарий;					
					Если ПараметрыСеанса.ТекущийПользователь.РольПользователя = Перечисления.РольПользователя.Врач Тогда // Если это врач вырезаем телефон
						Комментарий = СтрЗаменить(Комментарий, ", тел. " + СтрокаТаблицы.Контрагент.Телефон, "");
					КонецЕсли;
					
					Телефон     = ?(Константы.НеВыводитьТелефонКлиентаВЖурнале.Получить(), "", СтрокаТаблицы.Контрагент.Телефон);
					ТекстЯчейки = ТекстЯчейки + Комментарий;
					
				Иначе // Сформируем контактную информацию сами
					Если НЕ СтрокаТаблицы.КонтрагентТекущаяМедицинскаяКарта.Пустая() Тогда 
						ТекстЯчейки = ТекстЯчейки + "№ " + Строка(СтрокаТаблицы.КонтрагентТекущаяМедицинскаяКартаКодБезНулей) + ", ";
					КонецЕсли;
					
					Телефон 	= ?(Константы.НеВыводитьТелефонКлиентаВЖурнале.Получить(), "", СтрокаТаблицы.Контрагент.Телефон);
					ТекстЯчейки = ТекстЯчейки + СтрокаТаблицы.ФИОПациента;
					
					Если ПараметрыСеанса.ТекущийПользователь.РольПользователя <> Перечисления.РольПользователя.Врач // Для врача телефон не отображаем
						И ЗначениеЗаполнено(Телефон) Тогда
						
						ТекстЯчейки = ТекстЯчейки + ", тел. " + Телефон;
					КонецЕсли;
				КонецЕсли;
			Иначе
				ТекстЯчейки = ТекстЯчейки + СтрокаТаблицы.Комментарий;
			КонецЕсли;
			// Дополним текст причиной записи
			Если ЗначениеЗаполнено(СтрокаТаблицы.ПричинаЗаписи) Тогда
				ТекстЯчейки = ТекстЯчейки + ?(ЗначениеЗаполнено(ТекстЯчейки), ": ", "") + СтрокаТаблицы.ПричинаЗаписи;
			КонецЕсли;
			// Дополним текст возростом клиента
			ТекстЯчейки = ТекстЯчейки + "" + ВозвратитьВозрастСтрокой(СтрокаТаблицы.ДатаРожденияКлиента, ", ");
			// Дополним текст комментариями
			Если ЗначениеЗаполнено(СтрокаТаблицы.Контрагент) И Найти(СтрокаТаблицы.Комментарий, СтрокаТаблицы.ФИОПациента) = 0 Тогда
				ТекстЯчейки = ТекстЯчейки + Символы.ПС + СтрокаТаблицы.Комментарий;
			КонецЕсли;	
			ТекстЯчейки = ТекстЯчейки + Символы.ПС + "Создана: " + Формат(СтрокаТаблицы.Событие.ДатаСоздания, "ДФ='дд ММММ ""в"" ЧЧ:мм, '") + СтрокаТаблицы.АвторДокумента;
			
			//==============================================================================================================================================================
			
			// Если СтрокаТаблицы.КонтактнаяИнформация <> "" Тогда
			//	// Если это врач вырезаем телефон
			//	КонтактнаяИнформация = СтрокаТаблицы.КонтактнаяИнформация;
			//	Если ПараметрыСеанса.ТекущийПользователь.РольПользователя = Перечисления.РольПользователя.Врач Тогда 
			//		КонтактнаяИнформация = СтрЗаменить(КонтактнаяИнформация, ", тел. " + СтрокаТаблицы.Контрагент.Телефон, "");
			//		// И СтрЧислоВхождений(СтрокаТаблицы.КонтактнаяИнформация,", тел") > 0 Тогда
			//		// КонтактнаяИнформация = Лев(СтрокаТаблицы.КонтактнаяИнформация, Найти(СтрокаТаблицы.КонтактнаяИнформация, ", тел") - 1);
			//	КонецЕсли;	
			//	ТекстЯчейки = ТекстЯчейки + КонтактнаяИнформация;
			// КонецЕсли;
			//// Формируем текст ячейки.
			//// Если ТипЗнч(СтрокаТаблицы.Услуга) = Тип("Массив") Тогда
			////	ТекстЯчейки = ТекстЯчейки + ?(ЗначениеЗаполнено(ТекстЯчейки), ": ", "") + АнкетированиеКлиентСервер.ПреобразоватьМассивВСтроку(СтрокаТаблицы.Услуга, ",");
			//// ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.Услуга) Тогда
			////	ТекстЯчейки = ТекстЯчейки + ?(ЗначениеЗаполнено(ТекстЯчейки), ": ", "") + СтрокаТаблицы.Услуга;
			//// КонецЕсли;

			// Если ЗначениеЗаполнено(СтрокаТаблицы.ПричинаЗаписи) Тогда
			//	ТекстЯчейки = ТекстЯчейки + ?(ЗначениеЗаполнено(ТекстЯчейки), ": ", "") + СтрокаТаблицы.ПричинаЗаписи;
			// КонецЕсли;
			//
			// ТекстЯчейки = ТекстЯчейки + "" + ВозвратитьВозрастСтрокой(СтрокаТаблицы.ДатаРожденияКлиента, ", ");
			//			
			// ТекстЯчейки = ТекстЯчейки + Символы.ПС + "Создана: " + Формат(СтрокаТаблицы.ДатаСобытия, "ДФ='дд ММММ ""в"" ЧЧ:мм, '") + СтрокаТаблицы.АвторДокумента;
			
			
			Если СдвигДляМетки = 0 Тогда    // Определяем наличие меток у события
				ТекОбласть.ГраницаСлева = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
			Иначе
				ТекОбласть.ГраницаСлева = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
			КонецЕсли;
			ТекОбласть.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
			ТекОбласть.ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
			ТекОбласть.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
			ТекОбласть.Объединить();
			Если ЗначениеЗаполнено(СтрокаТаблицы.Событие) Тогда 
				Если СтрокаТаблицы.Резерв Тогда
					ТекстЯчейки = СтрокаТаблицы.ОснованиеРезерва;					
					Если МногоТекста(СтрокаТаблицы.ОснованиеРезерва, Параметры) Тогда 
						ТекОбласть.ВертикальноеПоложение 	= ВертикальноеПоложение.Верх;
					Иначе 
					    ТекОбласть.ВертикальноеПоложение 	= ВертикальноеПоложение.Центр;
					КонецЕсли;	
					ТекОбласть.ГоризонтальноеПоложение 	= ГоризонтальноеПоложение.Центр;
					ТекОбласть.ЦветТекста 				= WebЦвета.Черный;
					ТекОбласть.Шрифт 					= Новый Шрифт(ТекОбласть.Шрифт, , 9, Истина);
					Если ЗначениеЗаполнено(СтрокаТаблицы.ЦветФонаРезерва) Тогда 
						ТекОбласть.ЦветФона 				= ?(ВыводНаПечать, ТекОбласть.ЦветФона, ЗначениеИзСтрокиВнутр(СтрокаТаблицы.ЦветФонаРезерва));
					Иначе 
						ТекОбласть.ЦветФона 				= ?(ВыводНаПечать, ТекОбласть.ЦветФона, WebЦвета.Хаки);
					КонецЕсли;	
				Иначе 	
					ТекОбласть.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
					ТекОбласть.ЦветФона = ?(ВыводНаПечать, ТекОбласть.ЦветФона, ОбщегоНазначенияСтоматология.ПолучитьЦветФонаСобытия(СтрокаТаблицы.Статус, СтрокаТаблицы.Событие, , СтрокаТаблицы.ЭтоПеренос));
					ТекОбласть.ЦветТекста = WebЦвета.Черный;
					ТекОбласть.Шрифт = Новый Шрифт(ТекОбласть.Шрифт,,8);
				КонецЕсли;
			КонецЕсли;			
			ТекОбласть.Текст = ТекстЯчейки;
			Если (ТекОбласть.Низ - ТекОбласть.Верх + 1) < 2 Тогда
				ТекОбласть.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Авто;
			Иначе
				ТекОбласть.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			КонецЕсли; 
			ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
			ТекОбласть.ПоВыделеннымКолонкам     = Истина;	
			// Преобразование массива в строку
			ИндексВТЧМассив = "";
			Если  ТипЗнч(СтрокаТаблицы.ИндексВТЧ) = Тип("Массив") Тогда
				Для Каждого Элемент ИЗ СтрокаТаблицы.ИндексВТЧ Цикл
					ИндексВТЧМассив = ИндексВТЧМассив + Элемент + ";";	
				КонецЦикла;	 
			Иначе
				ИндексВТЧМассив = "" + СтрокаТаблицы.ИндексВТЧ + ";";
			КонецЕсли;	
			Если ТипЗнч(СтрокаТаблицы.Событие) = Тип("Структура") Тогда
				Дата                   = СтрокаТаблицы.Событие.ДатаВремяНачала;
				Интервал               = СтрокаТаблицы.Событие.ДатаВремяОкончания - СтрокаТаблицы.Событие.ДатаВремяНачала;
				ПараметрОснования      = ?(ЗначениеЗаполнено(СтрокаТаблицы.Событие.Сотрудник),СтрокаТаблицы.Событие.Сотрудник.УникальныйИдентификатор(),"");
				РабочееВремя           = СтрокаТаблицы.Событие.ПризнакДежурства;
				ТекОбласть.Расшифровка = "" +Дата+ "," +Интервал+  "," +ПараметрОснования +"," +РабочееВремя+ ",,,,"+ СтрокаТаблицы.ЭтоПеренос;
			Иначе
				Дата                   = СтрокаТаблицы.ДатаИнтервала;
				Интервал               = СтрокаТаблицы.НомерНачальнойСтроки - 1;
				ПараметрОснования      = ?(ЗначениеЗаполнено(СтрокаТаблицы.Сотрудник),СтрокаТаблицы.Сотрудник.УникальныйИдентификатор(),"");			
				ДокументЗаписи         = ?(ЗначениеЗаполнено(СтрокаТаблицы.Событие),СтрокаТаблицы.Событие.УникальныйИдентификатор(),"");
				Резерв                 = ?(ТипЗнч(СтрокаТаблицы.Событие) = Тип("ДокументСсылка.Событие"), СтрокаТаблицы.Резерв, "");	
				ТекОбласть.Расшифровка = "" +Дата+ "," +Интервал+ "," +ПараметрОснования+ ",Да," +ДокументЗаписи+ "," +ИндексВТЧМассив +"," +Резерв+","+СтрокаТаблицы.ЭтоПеренос;
			КонецЕсли;	
		КонецЦикла;				
	КонецЕсли;
	Линия      = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);	
	ТекОбласть = ТабличныйДокумент.Область(1 + РазмерШапки, 1+ ШиринаЧасов + СмещениеДняСлева, НомерПоследнейЯчейкиДня-СмещениеОтНачалаПервойЯчейкиДня + РазмерШапки, ОбщаяШиринаДня + ШиринаЧасов + СмещениеДняСлева);
	ТекОбласть.Обвести(Линия, Линия, Линия, Линия);
	ТекОбласть.ЦветРамки = ЦветаСтиля.ЦветТекстаКнопки;
	
КонецПроцедуры

// Процедура - Заполнение графика событий по группам сформировать область наименования дня недели.
//
// Параметры:
//  ВыводНаПечать				 - 	 - 
//  ГруппировкаСсылка			 - 	 - 
//  МассивСотрудниковИОбластей	 - 	 - 
//  ОбщаяШиринаДня				 - 	 - 
//  РазмерШапки					 - 	 - 
//  СмещениеДняСлева			 - 	 - 
//  ТабличныйДокумент			 - 	 - 
//  ШиринаЧасов					 - 	 - 
//
Процедура ЗаполнениеГрафикаСобытийПоГруппамСформироватьОбластьНаименованияДняНедели(
	ТабличныйДокумент,	
	ГруппировкаСсылка, 
	МассивСотрудниковИОбластей,
	Параметры,
	ВыводНаПечать, 
	ОбщаяШиринаДня, 
	РазмерШапки, 
	СмещениеДняСлева, 
	ШиринаЧасов,
	ВсегоГрупп)
	
	ВыводитьСтрокуЛистОжидания = Ложь;
	Параметры.Свойство("ВыводитьСтрокуЛистОжидания", ВыводитьСтрокуЛистОжидания);	
	КорректорВысотыШапки = ?(ВыводитьСтрокуЛистОжидания, 1, 0);
	
	ОбластьНаименованияДняНедели = ТабличныйДокумент.Область(РазмерШапки-КорректорВысотыШапки, 1 + ШиринаЧасов + СмещениеДняСлева, РазмерШапки-КорректорВысотыШапки, ОбщаяШиринаДня+ ШиринаЧасов + СмещениеДняСлева);
	ОбластьНаименованияДняНедели.Объединить();
		
	ВысотаСтрокиОбласти = 22;
	ЦветРамкиОбласти    = ЦветаСтиля.ЦветТекстаКнопки;	
	ТолщинаЛинииГраницы = 1;
	
	ЛинияГраницы = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, ТолщинаЛинииГраницы);
	НулеваяЛинияГраницы = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии, 0);
	
	Если ТипЗнч(ГруппировкаСсылка) = Тип("Дата") Тогда
		
		ОбластьНаименованияДняНедели.Текст    = ОбщегоНазначенияКлиентСерверСтоматология.ОпределитьДеньНедели(ДеньНедели(ГруппировкаСсылка)) + Символы.ПС + Формат(ГруппировкаСсылка,"ДФ='d MMMM'");
		ОбластьНаименованияДняНедели.ЦветФона = Новый Цвет(255, 255, 255);
		
	ИначеЕсли ТипЗнч(ГруппировкаСсылка) = Тип("СправочникСсылка.Сотрудники") Тогда		
		
		ВысотаСтрокиОбласти = 37;
		
		ЦветФонаЯчейки = ?(ЗначениеЗаполнено(ГруппировкаСсылка.Должность.ЦветФона) И Не ВыводНаПечать, ЗначениеИзСтрокиВнутр(ГруппировкаСсылка.Должность.ЦветФона), Новый Цвет());
		
		ОбластьНаименованияДняНедели.Текст    = ГруппировкаСсылка.Наименование + ?(ГруппировкаСсылка.Должность.ОтображатьВЖурналеПредварительнойЗаписи, Символы.ПС + ГруппировкаСсылка.Должность, "");
		ОбластьНаименованияДняНедели.ЦветФона = ЦветФонаЯчейки;
				
		// СотрудникНовый = Справочники.Сотрудники.ПроверитьСотрудникЯвляетсяНовымДляСтруктурнойЕдиницы(ГруппировкаСсылка, Параметры.СтруктурнаяЕдиница);
		
		// Если СотрудникНовый Тогда 
		//	ТолщинаЛинииГраницы = 2;
		//	ЦветРамкиОбласти    = WebЦвета.Красный;	
		// КонецЕсли;
		
		Если МассивСотрудниковИОбластей <> Неопределено Тогда 
			
			СтруктураСотрудниковИОбластей = Новый Структура;
			
			СтруктураСотрудниковИОбластей.Вставить("Область"       , ОбластьНаименованияДняНедели.Имя);
			СтруктураСотрудниковИОбластей.Вставить("Сотрудник"     , ГруппировкаСсылка);
			// СтруктураСотрудниковИОбластей.Вставить("СотрудникНовый", СотрудникНовый);	
			
			МассивСотрудниковИОбластей.Добавить(СтруктураСотрудниковИОбластей);
			
		КонецЕсли;
		
		// Заполнение количества пациентов в листе ожидания				
		
		Если ВыводитьСтрокуЛистОжидания Тогда
			
			ОбластьЛистОжидания = ТабличныйДокумент.Область(РазмерШапки, 1 + ШиринаЧасов + СмещениеДняСлева, РазмерШапки, ОбщаяШиринаДня + ШиринаЧасов + СмещениеДняСлева);
			ОбластьЛистОжидания.Объединить();
			
			ОбластьЛистОжидания.ЦветФона = ЦветФонаЯчейки;
			ОбластьЛистОжидания.Шрифт                   = Новый Шрифт(, 7, Ложь);
			ОбластьЛистОжидания.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ОбластьЛистОжидания.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
			ОбластьЛистОжидания.ВысотаСтроки            = 1;
			ОбластьЛистОжидания.РазмещениеТекста        = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			ОбластьЛистОжидания.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Текст;
			ОбластьЛистОжидания.Расшифровка             = "" +Параметры.Дата+ ",," +ГруппировкаСсылка.УникальныйИдентификатор()+ ",,,,,,"+Параметры.КоличествоПациентовВЛистеОжидания;
			ОбластьЛистОжидания.ГиперСсылка             = Истина;
			ОбластьЛистОжидания.ГраницаСверху           = НулеваяЛинияГраницы;
			ОбластьЛистОжидания.ГраницаСнизу            = ЛинияГраницы;
			ОбластьЛистОжидания.ГраницаСлева            = ЛинияГраницы;
			ОбластьЛистОжидания.ГраницаСправа           = ЛинияГраницы;	
			ОбластьЛистОжидания.ЦветРамки               = ЦветРамкиОбласти;
			ОбластьЛистОжидания.ЦветТекста				= ЦветаСтиля.ЦветОсобогоТекста;
			
			Если Параметры.Свойство("КоличествоПациентовВЛистеОжидания") И НЕ Параметры.КоличествоПациентовВЛистеОжидания = 0 Тогда
				ОбластьЛистОжидания.Текст = "Лист ожидания ("+Параметры.КоличествоПациентовВЛистеОжидания+")";
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ГруппировкаСсылка) = Тип("СправочникСсылка.Помещения") Тогда
		
		ОбластьНаименованияДняНедели.Текст    = ГруппировкаСсылка.Наименование;
		ОбластьНаименованияДняНедели.ЦветФона = ?(ЗначениеЗаполнено(ГруппировкаСсылка.ЦветФона), ЗначениеИзСтрокиВнутр(ГруппировкаСсылка.ЦветФона), Новый Цвет());
	Иначе
		ОбластьНаименованияДняНедели.Текст    = ГруппировкаСсылка;
		ОбластьНаименованияДняНедели.ЦветФона = Новый Цвет(255, 255, 255);
		
	КонецЕсли;
	
	ОбластьНаименованияДняНедели.Шрифт                   = Новый Шрифт(, 7, Ложь);
	ОбластьНаименованияДняНедели.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ОбластьНаименованияДняНедели.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
	ОбластьНаименованияДняНедели.ВысотаСтроки            = ВысотаСтрокиОбласти;
	ОбластьНаименованияДняНедели.РазмещениеТекста        = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	ОбластьНаименованияДняНедели.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ОбластьНаименованияДняНедели.Расшифровка             = ГруппировкаСсылка;
	ОбластьНаименованияДняНедели.ГиперСсылка             = Истина;
	ОбластьНаименованияДняНедели.ГраницаСверху           = ЛинияГраницы;
	ОбластьНаименованияДняНедели.ГраницаСнизу            = ?(ВыводитьСтрокуЛистОжидания, НулеваяЛинияГраницы, ЛинияГраницы);
	ОбластьНаименованияДняНедели.ГраницаСлева            = ЛинияГраницы;
	ОбластьНаименованияДняНедели.ГраницаСправа           = ЛинияГраницы;	
	ОбластьНаименованияДняНедели.ЦветРамки               = ЦветРамкиОбласти;
		
КонецПроцедуры

// Привести набор данных в строку.
//
Функция ПривестиНаборДанныхВСтроку(СтруктураДанных) Экспорт
	
	СтрокаВозврата = "";
	ПервоеЗначение = Истина;
	ПустоеЗначение = Истина;
	Для Каждого ЭлементМ ИЗ СтруктураДанных Цикл
		СтрокаВозврата = СтрокаВозврата + ?(НЕ ПервоеЗначение,",","");
		Если НЕ ЭлементМ.Значение = Неопределено И НЕ ЭлементМ.Значение = "" Тогда
			ПустоеЗначение = Ложь;
			Если НЕ Метаданные.НайтиПоТипу(ТипЗнч(ЭлементМ.Значение)) = Неопределено Тогда
				СтрокаВозврата = СтрокаВозврата + ЭлементМ.Значение.УникальныйИдентификатор();
			Иначе
				СтрокаВозврата = СтрокаВозврата + Строка(ЭлементМ.Значение);
			КонецЕсли;
		Иначе
			ПустоеЗначение = Истина;
		КонецЕсли;
		ПервоеЗначение = Ложь;
	КонецЦикла;
	// Если последнее значение было пустым проставить доп. запятую
	СтрокаВозврата = СтрокаВозврата + ?(ПустоеЗначение,",","");
	
	Возврат СтрокаВозврата;
	
КонецФункции

// Привести из строки в набор данных.
//
Функция ПривестиСтрокуВНаборДанных(СтрокаДанных,ШаблонТипов) Экспорт
	
	Индекс            = 0;
	СтруктураВозврата = Новый Структура;
	// Разложить строку на массив элементов
	МассивЭлементов   = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаДанных,",");
	Для Каждого ЭлементС ИЗ ШаблонТипов Цикл
		Если  Индекс < МассивЭлементов.Количество() И Не МассивЭлементов[Индекс] = Неопределено И Не МассивЭлементов[Индекс] = "" Тогда
			
			Если ЭлементС.Значение = Неопределено Тогда
				Продолжить;
			КонецЕсли;
				
			НайденныйОбъект = Метаданные.НайтиПоТипу(ЭлементС.Значение);
			// Приведение к ссылочному типу
			Если НЕ НайденныйОбъект = Неопределено Тогда
				ПолноеИмя          = НайденныйОбъект.ПолноеИмя();
				СоставноеИмя       = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолноеИмя,".");
				ИдентифкаторСсылки = Новый УникальныйИдентификатор(МассивЭлементов[Индекс]);
				Если СоставноеИмя[0] = "Справочник" Тогда
					СтруктураВозврата.Вставить(ЭлементС.Ключ,Справочники[СоставноеИмя[1]].ПолучитьСсылку(ИдентифкаторСсылки));
				ИначеЕсли СоставноеИмя[0] = "Документ" Тогда
	                СтруктураВозврата.Вставить(ЭлементС.Ключ,Документы[СоставноеИмя[1]].Получитьссылку(ИдентифкаторСсылки));
				Иначе
					СтруктураВозврата.Вставить(ЭлементС.Ключ,Неопределено);
				КонецЕсли;
			Иначе
				// Приведение к значимому типу данных
				Если ЭлементС.Значение = Тип("Дата") Тогда
					СтруктураВозврата.Вставить(ЭлементС.Ключ,Дата(МассивЭлементов[Индекс])); 
				ИначеЕсли ЭлементС.Значение = Тип("Число") Тогда
					СтруктураВозврата.Вставить(ЭлементС.Ключ,Число(МассивЭлементов[Индекс]));
				ИначеЕсли ЭлементС.Значение = Тип("Булево") Тогда
					СтруктураВозврата.Вставить(ЭлементС.Ключ,Булево(МассивЭлементов[Индекс])); 
				ИначеЕсли ЭлементС.Значение = Тип("Строка") Тогда
					СтруктураВозврата.Вставить(ЭлементС.Ключ,МассивЭлементов[Индекс]); 
				ИначеЕсли ЭлементС.Значение = Тип("Массив") Тогда		  	
					ВременныйМассив = СтроковыеФункцииКлиентСерверСтоматология.РазложитьСтрокуВМассивПодстрок(МассивЭлементов[Индекс],";");
					МассивЗначений  = Новый Массив;
					Для Каждого Эл ИЗ ВременныйМассив Цикл
						МассивЗначений.Добавить(Число(Эл));   
					КонецЦикла;
					СтруктураВозврата.Вставить(ЭлементС.Ключ,МассивЗначений); 
				КонецЕсли;	
			КонецЕсли;	
		Иначе
			СтруктураВозврата.Вставить(ЭлементС.Ключ,Неопределено); 
		КонецЕсли;
	   Индекс = Индекс + 1;		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция возвращает коэффициент разрешения по разрешению экрана.
//
Функция КоэффициентЭкранаПоРазрешению(ШиринаЭкрана = Неопределено) Экспорт
	
	Настройки = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения");
	
	Если Настройки <> Неопределено Тогда
		НастройкиСостава = Настройки.ПолучитьСостав();
		
		Если НастройкиСостава.Лево.Количество() > 0 Тогда
			Увеличить = 1;
		Иначе
			Увеличить = 0;
		КонецЕсли;
	Иначе 
		Увеличить = 1;
	КонецЕсли;

	КоэфРазрешения = 0;
	
	Если ШиринаЭкрана = Неопределено Тогда
		ШиринаЭкрана = 1920;
	КонецЕсли;
	
	Если ШиринаЭкрана = 640 Тогда 
		КоэфРазрешения = 9.10;
	ИначеЕсли ШиринаЭкрана = 800 Тогда 
		КоэфРазрешения = 10.32 + Увеличить*0.8;		
	ИначеЕсли ШиринаЭкрана = 1024 Тогда 
		КоэфРазрешения = 9.60 + Увеличить*0.8;		
	ИначеЕсли ШиринаЭкрана = 1152 Тогда 
		КоэфРазрешения = 9.14 + Увеличить*0.8;		
	ИначеЕсли ШиринаЭкрана = 1280 Тогда 
		КоэфРазрешения = 8.95 + Увеличить*0.5;  
	ИначеЕсли ШиринаЭкрана = 1360 Тогда 
		КоэфРазрешения = 9.29 + Увеличить*0.56;	
	ИначеЕсли ШиринаЭкрана = 1366 Тогда 
		КоэфРазрешения = 9.59 + Увеличить*0.3;	
	ИначеЕсли ШиринаЭкрана = 1400 Тогда 
		КоэфРазрешения = 9.81 + Увеличить*0.3;		
	ИначеЕсли ШиринаЭкрана = 1440 Тогда 
		КоэфРазрешения = 10.05 + Увеличить*0.4;	
	ИначеЕсли ШиринаЭкрана = 1600 Тогда 
		КоэфРазрешения = 11.00 + Увеличить*0.35;		
	ИначеЕсли ШиринаЭкрана = 1680 Тогда 
		КоэфРазрешения = 11.56 + Увеличить*0.6;     
	ИначеЕсли ШиринаЭкрана = 1920 Тогда 
		КоэфРазрешения = 10.60 + Увеличить*0.4;		  
	ИначеЕсли ШиринаЭкрана = 2048 Тогда 
		КоэфРазрешения = 10.42 + Увеличить*0.3;
	ИначеЕсли ШиринаЭкрана = 2560 Тогда 
		КоэфРазрешения = 10.31 + Увеличить*0.3;		
	ИначеЕсли ШиринаЭкрана = 3200 Тогда 
		КоэфРазрешения = 10.15 + Увеличить*0.2;		
	Иначе 
		КоэфРазрешения = -0.003734375 * ШиринаЭкрана + 14.2675 + Увеличить*0.8;
	КонецЕсли;	
	
	
	Возврат КоэфРазрешения;
	
КонецФункции

&НаСервере
// Функция возвращает значение "Истина" в том случе, если строка "КонтактнаяИнформация" является многострочной
// или ее длина превышает установленное значение (23 или 35).
//
Функция МногоТекста(КонтактнаяИнформация, Параметры)
	
	Если Параметры.СтраницаМенеджера = "Неделя" Тогда		
		Если СтрЧислоСтрок(КонтактнаяИнформация) > 1 ИЛИ СтрДлина(КонтактнаяИнформация)	> 23 Тогда 
			Возврат Истина;
		Иначе 
			Возврат Ложь;
		КонецЕсли;
	Иначе 
		Если СтрЧислоСтрок(КонтактнаяИнформация) > 1 ИЛИ СтрДлина(КонтактнаяИнформация)	> 35 Тогда 
			Возврат Истина;
		Иначе 
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервере
//
//
Процедура ПроставимНекоторыеСтатусы(ТаблицаСобытий, СтруктурнаяЕдиница) Экспорт
	
	// Подготовим таблицу задолженностей
	Таблица = ТаблицаСобытий.Скопировать();
	Таблица.Свернуть("Контрагент");
	МассивКонтрагентов = Таблица.ВыгрузитьКолонку("Контрагент");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент КАК Контрагент,
	               |	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток КАК ОбщийБаланс
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	               |			,
	               |			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |				И Контрагент В (&МассивКонтрагентов)) КАК ВзаиморасчетыСКонтрагентамиОстатки";			   
	
	Запрос.УстановитьПараметр("МассивКонтрагентов", МассивКонтрагентов);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	ТаблицаЗадолженностей = Запрос.Выполнить().Выгрузить();
	
	// Подготовим таблицу незавершенных наряд-заказов
	МассивСтруктурныхЕдиниц = Новый Массив;
	МассивСтруктурныхЕдиниц.Добавить(СтруктурнаяЕдиница);
	ТаблицаНезавершенныхНарядЗаказов = ВернутьТаблицуНезавершенныхНарядЗаказов(МассивКонтрагентов, МассивСтруктурныхЕдиниц);
	// ТаблицаНезавершенныхНарядЗаказов.Свернуть("Контрагент");
	
	// Проставим статусы	
	Для Каждого Событие Из ТаблицаСобытий Цикл 
		СтрокаТаблицыЗадолженностей 					= ТаблицаЗадолженностей.Найти(Событие.Контрагент, "Контрагент");
		МассивСтрок_ТаблицыНезавершенныхНарядЗаказов 	= ТаблицаНезавершенныхНарядЗаказов.НайтиСтроки(Новый Структура("Контрагент", Событие.Контрагент));
		Если СтрокаТаблицыЗадолженностей <> Неопределено Тогда 
			Событие.ЕстьЗадолженность = СтрокаТаблицыЗадолженностей.ОбщийБаланс < 0;
		КонецЕсли;
		Если МассивСтрок_ТаблицыНезавершенныхНарядЗаказов.Количество() <> 0 Тогда 
			Событие.ЕстьНезавершенныеНарядЗаказы = Истина;
			Если МассивСтрок_ТаблицыНезавершенныхНарядЗаказов.Количество() = 1 Тогда 
				Событие.ОбщийСтатусНезавершенныхНарядЗаказов = МассивСтрок_ТаблицыНезавершенныхНарядЗаказов[0].Статус;
			Иначе 
				Событие.ОбщийСтатусНезавершенныхНарядЗаказов = Перечисления.СтатусыНарядЗаказа.ВРаботе;
			КонецЕсли;
		Иначе 
			Событие.ЕстьНезавершенныеНарядЗаказы = Ложь;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

Функция ВозвратитьВозрастСтрокой(ДатаРожденияКлиента, Префикс = "") Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаРожденияКлиента)  Тогда
		Возврат "";
	КонецЕсли;
	                                 
	Возраст = Год(Дата(01, 01, 01) + (ТекущаяДата() - ДатаРожденияКлиента)) - 1;
	ВозрастСтрока = Строка(Возраст);
	
	ПоследняяЦифра = Сред(Строка(Возраст), СтрДлина(Строка(Возраст)));
	ПредпоследняяЦифра = Сред("0" + Строка(Возраст), СтрДлина("0" + Строка(Возраст)) - 1, 1);
	
	Если (ПоследняяЦифра = "1") И ПредпоследняяЦифра <> "1" Тогда
		ВозрастСтрока = ВозрастСтрока + " год";
	ИначеЕсли (ПоследняяЦифра = "2" ИЛИ ПоследняяЦифра = "3" ИЛИ ПоследняяЦифра = "4") И ПредпоследняяЦифра <> "1" Тогда
		ВозрастСтрока = ВозрастСтрока + " года";
	Иначе
		ВозрастСтрока = ВозрастСтрока + " лет";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВозрастСтрока) Тогда
		ВозрастСтрока = Префикс + ВозрастСтрока;
	КонецЕсли;
	
	Возврат ВозрастСтрока;
	
КонецФункции

// Функция возвращает таблицу с незавершенными наряд-заказами
//
Функция ВернутьТаблицуНезавершенныхНарядЗаказов(МассивКонтрагентов, МассивСтруктурныхЕдиниц) Экспорт
	
	Запрос = Новый Запрос;
	// Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//               |	НарядЗаказ.Ссылка КАК НарядЗаказ,
	//               |	НарядЗаказ.Контрагент КАК Контрагент,
	//               |	НарядЗаказ.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//               |	НарядЗаказ.Дата КАК Дата,
	//               |	"""" КАК СтрокаКлюч				   
	//               |ИЗ
	//               |	Документ.НарядЗаказ КАК НарядЗаказ
	//               |ГДЕ
	//               |	НЕ НарядЗаказ.Статус
	//               |	И НарядЗаказ.Проведен
	//               |	И НЕ НарядЗаказ.ПометкаУдаления
	//               |	И НарядЗаказ.Контрагент В(&МассивКонтрагентов)
	//               |	И НарядЗаказ.СтруктурнаяЕдиница В(&МассивСтруктурныхЕдиниц)";
	//			   
				   
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НарядЗаказЗапасы.Ссылка.Контрагент КАК Контрагент,
	               |	НарядЗаказЗапасы.Статус КАК Статус
	               |ИЗ
	               |	Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
	               |ГДЕ
	               |	НарядЗаказЗапасы.Ссылка.Проведен
	               |	И НЕ НарядЗаказЗапасы.Ссылка.ПометкаУдаления
	               |	И (НарядЗаказЗапасы.Прием = ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
	               |			ИЛИ НарядЗаказЗапасы.Прием = НЕОПРЕДЕЛЕНО
	               |			ИЛИ НарядЗаказЗапасы.Прием = NULL)
	               |	И НарядЗаказЗапасы.Ссылка.Контрагент В(&МассивКонтрагентов)
	               |	И НарядЗаказЗапасы.Ссылка.СтруктурнаяЕдиница В(&МассивСтруктурныхЕдиниц)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НарядЗаказЗапасы.Статус,
	               |	НарядЗаказЗапасы.Ссылка.Контрагент";
	
	
	Запрос.УстановитьПараметр("МассивКонтрагентов"		, МассивКонтрагентов);
	Запрос.УстановитьПараметр("МассивСтруктурныхЕдиниц"	, МассивСтруктурныхЕдиниц);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	// Таблица.Сортировать("Дата");
	
	Возврат Таблица;	
	
КонецФункции

// Выполняет установку параметра сеанса ПредлагатьУстановкуРасширенияРаботыСФайлами 
// при начале работы системы.
//
// Параметры
//  ИмяПараметра  			- Строка - имя устанавливаемого параметра
//  УстановленныеПараметры  - Массив - массив, в котором собираются 
//                 имена установленных параметров сеанса
//
Процедура НачальнаяУстановкаПараметраСеанса(ИмяПараметра, УстановленныеПараметры) Экспорт

	Если ИмяПараметра <> "ПредлагатьУстановкуРасширенияРаботыСФайлами" Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);   
	
	Если ИмяПараметра = "ПредлагатьУстановкуРасширенияРаботыСФайлами" Тогда
		
		ПредлагатьУстановку = ХранилищеОбщихНастроек.Загрузить("НастройкиПрограммы", 
			"ПредлагатьУстановкуРасширенияРаботыСФайлами");
		Если ПредлагатьУстановку = Неопределено Тогда
			ПредлагатьУстановку = Истина;
			ХранилищеОбщихНастроек.Сохранить("НастройкиПрограммы", 
				"ПредлагатьУстановкуРасширенияРаботыСФайлами", ПредлагатьУстановку);
		КонецЕсли;
		
		ПараметрыСеанса.ПредлагатьУстановкуРасширенияРаботыСФайлами = ПредлагатьУстановку;
		УстановленныеПараметры.Добавить(ИмяПараметра);
		
	КонецЕсли;
	
КонецПроцедуры 

// Процедура, определяет структурную единицу, под которым запущен сеанс и пытается
// найти соответсвие ему в справочнике "СтруктурныеЕдиницы". Параметр сеанса ТекущаяСтруктурнаяЕдиница
// устанавливается как ссылка на найденный (созданный) элемент справочника.
//
Процедура ОпределитьТекущуюСтруктурнуюЕдиницу(Знач ИмяПараметра, УстановленныеПараметры) Экспорт
	  	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ИмяПараметра <> "ТекущаяСтруктурнаяЕдиница" Тогда
		Возврат;
	КонецЕсли;
		
	ПоследняяЗакрытаяСтрЕд = ХранилищеСистемныхНастроек.Загрузить(ПараметрыСеанса.ТекущийПользователь.УникальныйИдентификатор(), "СтруктрнаяЕдиница");
		
	СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	
	МассивСтруктурныхЕдиниц = Новый Массив; 		
	ВыборкаСтруктурныхЕд = Справочники.СтруктурныеЕдиницы.Выбрать();
	Пока ВыборкаСтруктурныхЕд.Следующий() Цикл   				
		Если ВыборкаСтруктурныхЕд.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;  				
		МассивСтруктурныхЕдиниц.Добавить(ВыборкаСтруктурныхЕд.Ссылка);  				
	КонецЦикла;
	
	ТекущийСотрудник = ПараметрыСеанса.ТекущийСотрудник;
	Если ЗначениеЗаполнено(ТекущийСотрудник) Тогда   		
		Если ТекущийСотрудник.ДоступныеСтруктурныеЕдиницы.Количество() = 0 Тогда 		
		    МассивСтруктурныхЕдДоступныхВСеансе  = МассивСтруктурныхЕдиниц;
		Иначе
			
			МассивСтруктурныхЕдДоступныхВСеансе = Новый Массив;   			
			Для Каждого СтруктурныеЕдСтрока Из МассивСтруктурныхЕдиниц Цикл   				
				Если ТекущийСотрудник.ДоступныеСтруктурныеЕдиницы.Найти(СтруктурныеЕдСтрока, "СтруктурнаяЕдиница") <> Неопределено Тогда
					МассивСтруктурныхЕдДоступныхВСеансе.Добавить(СтруктурныеЕдСтрока);
				КонецЕсли;  				
			КонецЦикла; 	
		КонецЕсли;	
		
		
		Если МассивСтруктурныхЕдДоступныхВСеансе.Количество() > 0 Тогда
			
			Если ЗначениеЗаполнено(ПоследняяЗакрытаяСтрЕд) Тогда
				ТекущаяСтруктурнаяЕд = ПоследняяЗакрытаяСтрЕд;
			Иначе
				ТекущаяСтруктурнаяЕд = МассивСтруктурныхЕдДоступныхВСеансе[0];
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	
	ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница = ?(ТекущаяСтруктурнаяЕд = Неопределено, Справочники.СтруктурныеЕдиницы.ПустаяСсылка(), ТекущаяСтруктурнаяЕд);
	
КонецПроцедуры 

// Функция ПолучитьЗначениеРеквизита возвращает значение
// реквизита, прочитанного из информационной базы по ссылке на объект.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита - Строка, например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ПолучитьСтарыйНаборПередЗаписьюРегистра(Объект, Замещение = Истина) Экспорт
	
	СтарыйНаборЗаписей = РегистрыСведений[Объект.Метаданные().Имя].СоздатьНаборЗаписей();
	Для Каждого ЗначениеОтбора Из Объект.Отбор Цикл
		СтрокаОтбора = СтарыйНаборЗаписей.Отбор.Найти(ЗначениеОтбора.Имя);
		СтрокаОтбора.Значение = ЗначениеОтбора.Значение;
		СтрокаОтбора.Использование = ЗначениеОтбора.Использование;
	КонецЦикла;
	Если Замещение = Истина Тогда // Если незамещаются, считаем что записей не было. Если записи нужны в любом случае - параметр не передавать
		СтарыйНаборЗаписей.Прочитать();
	КонецЕсли;
	
	Возврат СтарыйНаборЗаписей;
	
КонецФункции

// Функция ПолучитьЗначениеПараметровСеанса возвращает значение реквизита параметра сеанса
// 
Функция ПолучитьЗначениеПараметровСеанса(ИмяРеквизита) Экспорт
	
	Результат = ПараметрыСеанса[ИмяРеквизита];
	
	Возврат Результат;
	
КонецФункции

// Процедура добавления движений перед изменением/при записи.
//
Процедура ДобавлениеДвиженийПередИзменениемПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	СтарыйНаборПередЗаписью = ОбщегоНазначенияСтоматология.ПолучитьСтарыйНаборПередЗаписьюРегистра(Источник, Замещение);
	Источник.ДополнительныеСвойства.Вставить("ДвиженияПередЗаписью", СтарыйНаборПередЗаписью.Выгрузить());
	
КонецПроцедуры

//
//
Функция ВернутьТаблицуСтатусовНарядЗаказов(МассивДокументов) Экспорт
	
	ТаблицаДокументов = Новый ТаблицаЗначений;
	ТаблицаДокументов.Колонки.Добавить("НарядЗаказ");
	ТаблицаДокументов.Колонки.Добавить("СтатусПоОстаткам");
	
	Для Каждого ЭлементМассива Из МассивДокументов Цикл 
		НоваяСтрока = ТаблицаДокументов.Добавить();
		НоваяСтрока.НарядЗаказ 			= ЭлементМассива;
		НоваяСтрока.СтатусПоОстаткам 	= "";
	КонецЦикла;
	
	// ТаблицаДокументов.ЗагрузитьКолонку(МассивДокументов, "НарядЗаказ");		
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НарядЗаказыОстатки.НарядЗаказ КАК НарядЗаказ
	               |ИЗ
	               |	РегистрНакопления.НарядЗаказы.Остатки(
	               |			,
	               |			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |				И НарядЗаказ В (&МассивДокументов)) КАК НарядЗаказыОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НарядЗаказыОстатки.НарядЗаказ";
				   
	Запрос.УстановитьПараметр("МассивДокументов"	, МассивДокументов);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, ?(МассивДокументов.Количество() > 0, МассивДокументов[0].СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница));
	
	ТаблицаОткрытыхНЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицаДокументов Из ТаблицаДокументов Цикл 
		Если ТаблицаОткрытыхНЗ.Найти(СтрокаТаблицаДокументов.НарядЗаказ) = Неопределено Тогда 
			СтрокаТаблицаДокументов.СтатусПоОстаткам = "Закрыт";
		Иначе 
			СтрокаТаблицаДокументов.СтатусПоОстаткам = "Открыт";
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаДокументов;
	
КонецФункции

Процедура ИнформированиеКлиентаПодтверждениеОнЛайнЗаписиПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	// УстановитьПривилегированныйРежим(Истина);
	//	
	// Если Источник.Ссылка.Статус = Перечисления.СтатусыСобытия.НеПодтверждена
	//		И Источник.Статус = Перечисления.СтатусыСобытия.Подтверждена Тогда
	//	Источник.ДополнительныеСвойства.Вставить("ПроизвестиИнформированиеКлиентаПодтверждениеОнЛайнЗаписи", Истина);
	// КонецЕсли; 
	
КонецПроцедуры

// Функция ПолучитьЗначениеПараметровСеанса возвращает значение реквизита параметра сеанса
//
Функция ВернутьНастройкиПараметровУчета() Экспорт
	
	Возврат Новый Структура("СтранаУчета, Код, ФорматТелНомера", Константы.СтранаУчета.Получить(), ?(Константы.СтранаУчета.Получить().Пустая(), 0, Константы.СтранаУчета.Получить().Код), Константы.ФорматТелефонныхНомеров.Получить());
	
КонецФункции

// Функция возвращает период работы структурной единицы в определенный день недели
//
// Параметры:
// ДеньНедели - Дата на которую необходимо получить период работы
// СтруктурнаяЕдиница
//
// Возвращаемое значение
//  Период работы структурной единицы
Функция ПолучитьВремяРаботыСтруктурнойЕдиницы(Дата, СтруктурнаяЕдиница) Экспорт
	
	ПериодРаботы = Новый Структура("ДатаНачала, ДатаОкончания");
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	РасписаниеРаботы.НачалоРаботы КАК НачалоРаботы,
	                      |	ВЫБОР
	                      |		КОГДА РасписаниеРаботы.ОкончаниеРаботы = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	                      |			ТОГДА КОНЕЦПЕРИОДА(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ДЕНЬ)
	                      |		ИНАЧЕ РасписаниеРаботы.ОкончаниеРаботы
	                      |	КОНЕЦ КАК ОкончаниеРаботы
	                      |ИЗ
	                      |	Справочник.СтруктурныеЕдиницы.РасписаниеРаботы КАК РасписаниеРаботы
	                      |ГДЕ
	                      |	РасписаниеРаботы.Ссылка = &СтруктурнаяЕдиница
	                      |	И ДЕНЬНЕДЕЛИ(РасписаниеРаботы.ДеньНедели) = ДЕНЬНЕДЕЛИ(&Дата)
	                      |	И РасписаниеРаботы.Активность = ИСТИНА");
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Дата", Дата);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		ПериодРаботы.ДатаНачала 	= НачалоДня(Дата) + (Результат.НачалоРаботы - Дата(01, 01, 01));
		ПериодРаботы.ДатаОкончания 	= НачалоДня(Дата) + (Результат.ОкончаниеРаботы - Дата(01, 01, 01));
	Иначе 
		ПериодРаботы.ДатаНачала 	= НачалоДня(Дата) + (Дата(1, 1, 1, 01, 00, 00) - Дата(01, 01, 01));
		ПериодРаботы.ДатаОкончания 	= НачалоДня(Дата) + (Дата(1, 1, 1, 23, 00, 00) - Дата(01, 01, 01));
	КонецЕсли;
		
	Возврат ПериодРаботы;	
	
КонецФункции

// Функция - Вернуть кратную текущую дату сеанса
// 
// Возвращаемое значение:
//   - 
// 
Функция ВернутьКратнуюТекущуюДатуСеанса() Экспорт
	
	ТекущаяДатаКлиента 		= ТекущаяДатаСеанса();
	ВременнойРазделитель 	= НачалоЧаса(ТекущаяДатаКлиента) + 60*30;
	
	Если КонецЧаса(ТекущаяДатаКлиента) - ТекущаяДатаКлиента > ТекущаяДатаКлиента - НачалоЧаса(ТекущаяДатаКлиента) Тогда 
		Если ВременнойРазделитель - ТекущаяДатаКлиента > ТекущаяДатаКлиента - НачалоЧаса(ТекущаяДатаКлиента) Тогда 
			ТекущаяДатаКлиента = НачалоЧаса(ТекущаяДатаКлиента);
		Иначе 
			ТекущаяДатаКлиента = ВременнойРазделитель;
		КонецЕсли;
	ИначеЕсли КонецЧаса(ТекущаяДатаКлиента) - ТекущаяДатаКлиента < ТекущаяДатаКлиента - НачалоЧаса(ТекущаяДатаКлиента) Тогда 
		Если КонецЧаса(ТекущаяДатаКлиента) - ТекущаяДатаКлиента > ТекущаяДатаКлиента - ВременнойРазделитель Тогда 
			ТекущаяДатаКлиента = ВременнойРазделитель;
		Иначе 
			ТекущаяДатаКлиента = ВременнойРазделитель + 60*30;
		КонецЕсли;
	Иначе 
		ТекущаяДатаКлиента = НачалоДня(ТекущаяДатаКлиента);
	КонецЕсли;
	
	Возврат ТекущаяДатаКлиента;
	
КонецФункции

&НаСервере
// Функция, возвращает кассу, при закрытии кассовой смены и закрывает смену.
//  Параметры:
//   КассаККМ - касса ККМ, по которой выполняется закрытие смены;
//   ОписаниеОшибки - строка, содержит описание ошибок при закрытии смены.
//  Возвращаемое значение:
//   КассоваяСмена - в случае закрытия возвращается касса.
//
Функция ВернутьКассуИВыполнитьЗакрытиеСмены(Касса, ОписаниеОшибки) Экспорт
	
	КассоваяСмена = РозничныеПродажи.ЗакрытьКассовуюСмену(Касса, ОписаниеОшибки);
	
	Возврат КассоваяСмена;
	
КонецФункции

// Проверяет проведенность документов.
// Параметры
//  Документы - массив - документы, проведенность которых необходимо проверить
// Возвращаемое значение
//  Массив - непроведенные документы из массива Документы
//
Функция ПроверитьПроведенностьДокументов(знач Документы) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
		|	Документ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.[ИмяДокумента] КАК Документ
		|ГДЕ
		|	Документ.Ссылка В (&МассивДокументов)
		|	И НЕ Документ.Проведен";
	
	ИмяДокумента = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		Документы[0].Метаданные().ПолноеИмя(), ".")[1];
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[ИмяДокумента]", ИмяДокумента);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивДокументов", Документы);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Процедура выполняет проведение документов перед формированием печатной формы.
//
// Параметры:
//	Документы - Массив - Документы, которые необходимо провести
//
// Возвращаемое значение:
//	Массив - документы, которые провести не удалось
//
Функция ПровестиДокументы(Документы, ТипПроведенныхДокументов) Экспорт
	
	ИмяДокумента = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
						Документы[0].Метаданные().ПолноеИмя(), ".")[1];
	
	ТипПроведенныхДокументов = ТипЗнч(Документы[0]);
	
	НепроведенныеДокументы = Новый Массив;
	
	Для Каждого ДокументСсылка Из Документы Цикл
		
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		
		ВыполненоУспешно = Ложь;
		
		Если ДокументОбъект.ПроверитьЗаполнение() Тогда
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				ВыполненоУспешно = Истина;
			Исключение
				ПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
				ТекстСообщенияОбОшибке = НСтр("ru = 'Ошибка при попытке проведения документа: %1'");
				ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщенияОбОшибке, ПредставлениеОшибки);
				ЗаписьЖурналаРегистрации("Проведение документов при печати",
					УровеньЖурналаРегистрации.Информация,
					ДокументОбъект.Метаданные(),
					ДокументСсылка,
					ТекстСообщенияОбОшибке);
			КонецПопытки;
		КонецЕсли;
		
		Если Не ВыполненоУспешно Тогда
			НепроведенныеДокументы.Добавить(ДокументСсылка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НепроведенныеДокументы;
	
КонецФункции 

// Возвращает значение параметра сеанса ПредлагатьУстановкуРасширенияРаботыСФайлами.
// Возвращаемое значение:
//  Булево - значение параметра сеанса ПредлагатьУстановкуРасширенияРаботыСФайлами.
//
Функция ПараметрыСеансаПредлагатьУстановкуРасширенияРаботыСФайлами() Экспорт
	УстановитьПривилегированныйРежим(Истина);   
	Возврат ПараметрыСеанса.ПредлагатьУстановкуРасширенияРаботыСФайлами;
КонецФункции

// Устанавливает значение параметра сеанса ПредлагатьУстановкуРасширенияРаботыСФайлами.
// Параметры:
//  Предлагать  - Булево - новое значение параметра сеанса ПредлагатьУстановкуРасширенияРаботыСФайлами.
//
Процедура УстановитьПараметрСеансаПредлагатьУстановкуРасширенияРаботыСФайлами(Предлагать) Экспорт
	УстановитьПривилегированныйРежим(Истина);   
	ПараметрыСеанса.ПредлагатьУстановкуРасширенияРаботыСФайлами = Предлагать;
КонецПроцедуры	

// Сохраняет ПредлагатьУстановкуРасширенияРаботыСФайлами в настройках и параметре сеанса
Процедура СохранитьПредлагатьУстановкуРасширенияРаботыСФайлами(Предлагать) Экспорт
	
	ХранилищеОбщихНастроек.Сохранить("НастройкиПрограммы", "ПредлагатьУстановкуРасширенияРаботыСФайлами", 
		Предлагать);	
	
	 // Здесь всегда ставим Ложь, чтобы в этом сеансе больше не беспокоить.
	 //  А вот в ХранилищеОбщихНастроек можем записать и Истина
	 //   - и на следующем запуске снова будем предлагать установку
	УстановитьПараметрСеансаПредлагатьУстановкуРасширенияРаботыСФайлами(Ложь);
КонецПроцедуры	

// Передает с клиента на сервер для записи настройку и обновляет повторно используемые значения
Процедура ХранилищеОбщихНастроекСохранитьИОбновитьПовторноИспользуемыеЗначения(Объект, Настройка, Значение) Экспорт
	ХранилищеОбщихНастроек.Сохранить(Объект, Настройка, Значение);
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

// Функция возвращает дробное значение от указанного числа.
//
Функция Дроб(Число) Экспорт
	
	Возврат Число - Цел(Число);
	
КонецФункции

// Процедура пакетной записи сообщений в журнал регистрации
// 
// Параметры: СобытияДляЖурналаРегистрации - массив структур, клиентская глобальная переменная 
// Каждая структура - сообщение для журнала регистрации.
// После записи переменная очищается.
Процедура ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации) Экспорт
	
	Если ТипЗнч(СобытияДляЖурналаРегистрации) <> Тип("СписокЗначений") Тогда
		Возврат;
	КонецЕсли;	
	
	Если СобытияДляЖурналаРегистрации.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СообщениеЖурнала Из СобытияДляЖурналаРегистрации Цикл
		ЗначениеСообщения = СообщениеЖурнала.Значение;
		ИмяСобытия = ЗначениеСообщения.ИмяСобытия;
		УровеньСобытия = ПолучитьУровеньСобытияПоПредставлению(ЗначениеСообщения.ПредставлениеУровня);
		Комментарий = ЗначениеСообщения.Комментарий;
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньСобытия,,, Комментарий);
	КонецЦикла;
	СобытияДляЖурналаРегистрации.Очистить();
	
КонецПроцедуры

Функция ПолучитьУровеньСобытияПоПредставлению(ПредставлениеУровня)
	Если ПредставлениеУровня = "Информация" Тогда
		Возврат УровеньЖурналаРегистрации.Информация;
	ИначеЕсли ПредставлениеУровня = "Ошибка" Тогда
		Возврат УровеньЖурналаРегистрации.Ошибка;
	ИначеЕсли ПредставлениеУровня = "Предупреждение" Тогда
		Возврат УровеньЖурналаРегистрации.Предупреждение; 
	ИначеЕсли ПредставлениеУровня = "Примечание" Тогда
		Возврат УровеньЖурналаРегистрации.Примечание;
	КонецЕсли;	
КонецФункции

// Процедура заполняет справчник "Метки" при первом запуске системы значениями по умолчанию.
//
Процедура ЗаполнитьМеткиПЗИКлиентовПоУмолчанию() Экспорт
	
	Если Справочники.Метки.НайтиПоНаименованию("Острая боль").Пустая() Тогда
		НовыйЭлементМетка = Справочники.Метки.СоздатьЭлемент();
		НовыйЭлементМетка.Наименование = "Острая боль";
		НовыйЭлементМетка.ИспользоватьДляПредварительнойЗаписи = Истина;
		НовыйЭлементМетка.ЦветМетки = ЗначениеВСтрокуВнутр(WebЦвета.СветлоКоралловый);
		НовыйЭлементМетка.Записать();
	КонецЕсли;
	// Если Справочники.Метки.НайтиПоНаименованию("Первичный прием").Пустая() Тогда
	//	НовыйЭлементМетка = Справочники.Метки.СоздатьЭлемент();
	//	НовыйЭлементМетка.Наименование = "Первичный прием";
	//	НовыйЭлементМетка.ИспользоватьДляПредварительнойЗаписи = Истина;
	//	НовыйЭлементМетка.ЦветМетки = ЗначениеВСтрокуВнутр(WebЦвета.Голубой);
	//	НовыйЭлементМетка.Записать();
	// КонецЕсли;
	// Если Справочники.Метки.НайтиПоНаименованию("Повторный прием").Пустая() Тогда
	//	НовыйЭлементМетка = Справочники.Метки.СоздатьЭлемент();
	//	НовыйЭлементМетка.Наименование = "Повторный прием";
	//	НовыйЭлементМетка.ИспользоватьДляПредварительнойЗаписи = Истина;
	//	НовыйЭлементМетка.ЦветМетки = ЗначениеВСтрокуВнутр(WebЦвета.НейтральноЗеленый);
	//	НовыйЭлементМетка.Записать();
	// КонецЕсли;
	Если Справочники.Метки.НайтиПоНаименованию("Страховая").Пустая() Тогда
		НовыйЭлементМетка = Справочники.Метки.СоздатьЭлемент();
		НовыйЭлементМетка.Наименование = "Страховая";
		НовыйЭлементМетка.ИспользоватьДляПредварительнойЗаписи = Истина;
		НовыйЭлементМетка.ИспользоватьДляПациентов = Истина;
		НовыйЭлементМетка.ЦветМетки = ЗначениеВСтрокуВнутр(WebЦвета.ПесочноКоричневый);
		НовыйЭлементМетка.Записать();
	КонецЕсли;
 
КонецПроцедуры

// Функция, проверяет наличие времени у структурной единицы и возвращает список возможных смен.
//  Параметры:
// СтруктурнаяЕдиница - ссылка структурная единица, позиция  структурной единицы, по которой надо получить список смен.
//   ДанныеВыбора - структура, выбор данных по упаковкам.
//  Возвращаемое значение:
//   Признак наличия времени - булево.
//
Функция ПроверитьНаличиеВремениИПолучитьСписокДляВыбора(СтруктурнаяЕдиница, ДанныеВыбора, ДатаНачала, СтрокаПоиска = Неопределено, ВыбраннаяДатаНачала = Неопределено) Экспорт
	
	Период = ПолучитьНаибольшееВремяРаботы(СтруктурнаяЕдиница);
		
	Если Период <> неопределено Тогда
		Если НЕ ЗначениеЗаполнено(Период.НачалоРаботы) и Не ЗначениеЗаполнено(Период.ОкончаниеРаботы) Тогда
			возврат Ложь;
		КонецЕсли;
	Иначе
		возврат Ложь;
	КонецЕсли; 	
	
	Интервал = 15;
	мФормат = "ДФ=ЧЧ:мм";
	Если ДатаНачала Тогда
			Счетчик = 0;
		Иначе
			Счетчик = 1;
	КонецЕсли;	

	Если ДатаНачала Тогда
		Период.НачалоРаботы = НачалоЧаса(Период.НачалоРаботы) + Цел (Минута(Период.НачалоРаботы) / 15) * 15 * 60;
	ИначеЕсли Период.НачалоРаботы <= ВыбраннаяДатаНачала Тогда 
		Период.НачалоРаботы = ВыбраннаяДатаНачала;
	КонецЕсли;
	Пока Период.НачалоРаботы + Интервал * 60 * Счетчик <= Период.ОкончаниеРаботы Цикл
		Время = Период.НачалоРаботы + Интервал * 60 * Счетчик;
		Если ДанныеВыбора.НайтиПоЗначению(Время) = Неопределено Тогда
			Если не ЗначениеЗаполнено(Время) Тогда
				ДанныеВыбора.Добавить(Время, "00:00");
			Иначе
				ДанныеВыбора.Добавить(Время, Формат(Время, мФормат));
			КонецЕсли;
		КонецЕсли;			
		Счетчик = Счетчик + 1;
	КонецЦикла;
	Если Период.ОкончаниеРаботы = Дата(01,01,01,23,59,59) и не ДатаНачала Тогда
		ДанныеВыбора.Добавить(Период.НачалоРаботы + Интервал * 60 * Счетчик, "24:00");
	КонецЕсли;
	
	Возврат Истина;  
	
КонецФункции

// Функция возвращает наибольщий интервал работы структурной единицы
//
Функция ПолучитьНаибольшееВремяРаботы(СтруктурнаяЕдиница) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	МИНИМУМ(ВложенныйЗапрос.НачалоРаботы) КАК НачалоРаботы,
	                      |	МАКСИМУМ(ВложенныйЗапрос.ОкончаниеРаботы) КАК ОкончаниеРаботы
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		РасписаниеРаботы.НачалоРаботы КАК НачалоРаботы,
	                      |		ВЫБОР
	                      |			КОГДА РасписаниеРаботы.ОкончаниеРаботы = &ПустаяДата
	                      |				ТОГДА &ДатаОкончания
	                      |			ИНАЧЕ РасписаниеРаботы.ОкончаниеРаботы
	                      |		КОНЕЦ КАК ОкончаниеРаботы
	                      |	ИЗ
	                      |		Справочник.СтруктурныеЕдиницы.РасписаниеРаботы КАК РасписаниеРаботы
	                      |	ГДЕ
	                      |		РасписаниеРаботы.Активность = ИСТИНА
	                      |		И РасписаниеРаботы.Ссылка = &СтруктурнаяЕдиница) КАК ВложенныйЗапрос");
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(01,01,01));
	Запрос.УстановитьПараметр("ДатаОкончания", Дата(01,01,01,23,59,59));
 	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		ПериодРаботы = Новый Структура;
		ПериодРаботы.Вставить("НачалоРаботы",Выборка.НачалоРаботы);
		ПериодРаботы.Вставить("ОкончаниеРаботы",  Выборка.ОкончаниеРаботы); 
		Возврат ПериодРаботы;
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

// Функция определяет пол клиента по ФИО
// 
Функция ОпределитьПолКлиента(Фамилия, Имя, Отчество) Экспорт
	
	Фамилия = СокрЛП(Фамилия);
	Имя = СокрЛП(Имя);
	Отчество = СокрЛП(Отчество);
	Если Отчество <> "" Тогда
		Окончание_1_буква = НРег(Сред(Отчество, СтрДлина(Отчество)));
		Если Окончание_1_буква = "ч" ИЛИ Окончание_1_буква = "в" Тогда
			Возврат "Мужской";
		ИначеЕсли Окончание_1_буква = "а" Тогда
			Возврат "Женский";
		КонецЕсли;
	КонецЕсли;
	
	Окончание_1_буква = НРег(Сред(Фамилия, СтрДлина(Фамилия)));
	Окончание_2_буквы = НРег(Сред(Фамилия, СтрДлина(Фамилия) - 1));
	Окончание_3_буквы = НРег(Сред(Фамилия, СтрДлина(Фамилия) - 2));
	окончанияМужскихФамилий=",ов,ев,ий,ин,";
	окончанияЖенскихФамилий=",ова,ева,ина,ая,";
	Если Найти(окончанияМужскихФамилий, "," + Окончание_2_буквы + ",") > 0 Тогда
		Возврат "Мужской";
	ИначеЕсли Найти(окончанияЖенскихФамилий, "," + Окончание_2_буквы + ",") > 0 
		ИЛИ Найти(окончанияЖенскихФамилий, "," + Окончание_3_буквы + ",") > 0 
		Тогда
		Возврат "Женский";
	КонецЕсли;
	
	Если Имя <> "" Тогда
		Окончание_1_буква = НРег(Сред(Имя, СтрДлина(Имя)));
		Если Окончание_1_буква = "а" ИЛИ Окончание_1_буква = "я"  ИЛИ Окончание_1_буква = "е" Тогда
			Возврат "Женский";
		Иначе
			Возврат "Мужской";
		КонецЕсли;
	КонецЕсли;
	
	
	Возврат "";
КонецФункции

// Функция, возвращает массив сжатых картинок.
// 
Функция СжатьКартинки(МассивКартинокДляСжатия) Экспорт
	
	МассивСжатыхКартинок = Новый Массив;
	
	Для Каждого Картинка Из МассивКартинокДляСжатия Цикл
		
		ОбрабатываемаяКартинка = Новый ОбрабатываемаяКартинка(Картинка);
		
		ОбрабатываемаяКартинка.УстановитьФормат(ФорматКартинки.JPEG);
		
		КартинкаШирина = Картинка.Ширина();
		КартинкаВысота = Картинка.Высота();
		
		Если КартинкаШирина > 768 Или КартинкаВысота > 768 Тогда
			Если КартинкаШирина > КартинкаВысота Тогда
				ОбрабатываемаяКартинка.УстановитьРазмер(768, 0);
			Иначе
				ОбрабатываемаяКартинка.УстановитьРазмер(0, 768);
			КонецЕсли;
		КонецЕсли;
		
		Если Картинка.ГлубинаЦвета() = ГлубинаЦвета.БитНаПиксел32 Тогда
			ОбрабатываемаяКартинка.УстановитьГлубинуЦвета(ГлубинаЦвета.БитНаПиксел24);
		КонецЕсли;
	
		МассивСжатыхКартинок.Добавить(ОбрабатываемаяКартинка.ПолучитьКартинку());
		
	КонецЦикла;
	
	Возврат МассивСжатыхКартинок;
	
КонецФункции

// Функция, возвращает кассира.
//
Функция ПолучитьКассира(Касса = Неопределено, Сотрудник = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);     
	
	// Определим, как должно выглядеть представление кассира.
	// 0 - по умолчанию "Фамилия Имя Отчество".	
	ЗначениеПредставленияКассира = ?(ЗначениеЗаполнено(Касса) И ЗначениеЗаполнено(Касса.ПредставлениеКассира), Касса.ПредставлениеКассира, 0);	
	
	Кассир 			 	 = "";
	ДолжностьКассира	 = "";
	ПредставлениеКассира = "";

	// 1. Если в организации заполнен кассир, то берем его	
	Если ЗначениеЗаполнено(Касса) И ЗначениеЗаполнено(Касса.Организация.ФИОКассира) Тогда
		Кассир = Касса.Организация.ФИОКассира;                                           		
		ДолжностьКассира = Касса.Организация.ДолжностьКассира;
		
	ИначеЕсли ЗначениеЗаполнено(Сотрудник) Тогда                                        
		// Если сотрудник служебный, то меняем его на текущего,
		// чтобы в чеке не было "serviceUserApi" и подобных.
		Кассир = ?(Сотрудник.Служебный, ПараметрыСеанса.ТекущийПользователь, Сотрудник);      		
	Иначе
		// Если ничего не передали, берем текущего пользователя.
		Кассир = ПараметрыСеанса.ТекущийПользователь;                                		
	КонецЕсли;             	
	
	// Формирование представления кассира: если сотрудник без нужных данных в представлении будет наименование	
	Если ЗначениеЗаполнено(Кассир) Тогда   
		Если ТипЗнч(Кассир)	= Тип("СправочникСсылка.Пользователи") Тогда
			Кассир = Кассир.Сотрудник;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДолжностьКассира) Тогда
			ДолжностьКассира = Кассир.Должность;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Кассир.Фамилия) И НЕ ЗначениеЗаполнено(Кассир.Имя) И НЕ ЗначениеЗаполнено(Кассир.Отчество) Тогда
			ПредставлениеКассира = Кассир.Наименование;
			
		Иначе
			// Иначе будет формироваться по настройке.
			Если ЗначениеПредставленияКассира = 0 Тогда
				ПредставлениеКассира = СокрЛП(Кассир.Фамилия) + " " + СокрЛП(Кассир.Имя) + " " + СокрЛП(Кассир.Отчество);
				
			ИначеЕсли ЗначениеПредставленияКассира = 1 Тогда                                     
				ПредставлениеКассира = СокрЛП(Кассир.Фамилия) + " " + СокрЛП(Кассир.Имя);		
				
			ИначеЕсли ЗначениеПредставленияКассира = 2 Тогда                   
				Имя = ?(ЗначениеЗаполнено(Кассир.Имя), " " + ЛЕВ(СокрЛП(Кассир.Имя), 1)+".", "");
				Отчество = ?(ЗначениеЗаполнено(Кассир.Отчество), " " +  ЛЕВ(СокрЛП(Кассир.Отчество), 1)+".", "");
				ПредставлениеКассира = СокрЛП(Кассир.Фамилия) + Имя + Отчество;		
				
			ИначеЕсли ЗначениеПредставленияКассира = 3 Тогда     		
				Имя = ?(ЗначениеЗаполнено(Кассир.Имя), " " + ЛЕВ(СокрЛП(Кассир.Имя), 1)+".", "");
				ПредставлениеКассира = СокрЛП(Кассир.Фамилия) + Имя;
				
			ИначеЕсли ЗначениеПредставленияКассира = 4 Тогда
				ПредставлениеКассира = СокрЛП(Кассир.Фамилия);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Передача наименования должности.
	Если ЗначениеЗаполнено(Касса) И Касса.ПередаватьДолжность Тогда					
		НаименованиеДолжности = ?(ЗначениеЗаполнено(ДолжностьКассира), "" + ДолжностьКассира + ": ", "");
		ПредставлениеКассира  = НаименованиеДолжности + ПредставлениеКассира;		
	КонецЕсли;	
	
	// Заполним структуру по умолчанию.
	СтруктураКассира 		   = Новый Структура("Наименование, ИНН",  НСтр("ru='Администратор';en='Administrator'"), "");	
	СтруктураКассира.Наименование    = ПредставлениеКассира;
	СтруктураКассира.ИНН = ?(ЗначениеЗаполнено(Кассир.ИНН), Кассир.ИНН, "");	 
	
	Возврат СтруктураКассира; 
	
КонецФункции

// Процедура добавляет запись в журнал регистрации.
//
Процедура ДобавитьЗаписьВЖурналРегистрации(
	ИмяСобытия,
	Комментарий,	 
	Уровень			 = Неопределено, 
	ОбъектМетаданных = Неопределено, 
	Данные			 = Неопределено, 
	РежимТранзакции  = Неопределено) Экспорт
	
	Уровень = ?(ЗначениеЗаполнено(Уровень), Уровень, УровеньЖурналаРегистрации.Ошибка);
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень, ОбъектМетаданных, Данные, Комментарий, РежимТранзакции);
	
КонецПроцедуры

// Функция - Добавить массив
//
// Параметры:
//  ИсходныйМассив	 - 	 - 
//  НовыеДанные		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ДобавитьВМассив(ИсходныйМассив, НовыеДанные, КонтрольУникальности = Ложь) Экспорт
	
	Если ТипЗнч(НовыеДанные) = Тип("Массив") 
		ИЛИ ТипЗнч(НовыеДанные) = Тип("ФиксированныйМассив") Тогда
		
		Для Каждого ЭлементМ ИЗ НовыеДанные Цикл
			Если КонтрольУникальности = Истина Тогда
				Если ИсходныйМассив.Найти(ЭлементМ) = Неопределено Тогда
					ИсходныйМассив.Добавить(ЭлементМ);
				КонецЕсли;
			Иначе
				ИсходныйМассив.Добавить(ЭлементМ);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		Если КонтрольУникальности = Истина Тогда
			Если ИсходныйМассив.Найти(НовыеДанные) = Неопределено Тогда
				ИсходныйМассив.Добавить(НовыеДанные);
			КонецЕсли;
		Иначе
			ИсходныйМассив.Добавить(НовыеДанные);
		КонецЕсли;
	КонецЕсли;
			
	Возврат ИсходныйМассив;
	
КонецФункции  

// Функция, возвращает массив значений из таблицы значений
//  Параметры:
//    ТаблицаЗначений - Таблица значений;
Функция ПреобразоватьТЗвМассивСтруктуры(ТаблицаЗначений) Экспорт
	
	Результат = Новый Массив;
	СтрокаКолонок = "";
	Для Каждого КолонкаТЗ Из ТаблицаЗначений.Колонки Цикл
		СтрокаКолонок = СтрокаКолонок + ?(ЗначениеЗаполнено(СтрокаКолонок), ",", "") + КолонкаТЗ.Имя;
	КонецЦикла;
	
	Для Каждого СтрокаТЗ Из ТаблицаЗначений Цикл
		НоваяСтрокаСтруктурой = Новый Структура(СтрокаКолонок);
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСтруктурой, СтрокаТЗ);
		Результат.Добавить(НоваяСтрокаСтруктурой);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Функции для работы с цветами стиля в клиентском коде.

// Функция получает цвет стиля по имени элемента стиля.
// 
// Параметры:
// ИмяЦветаСтиля - Строка -  Имя элемента стиля.
// 
// Возвращаемое значение:
// Цвет.
// 
Функция ЦветСтиля(ИмяЦветаСтиля) Экспорт
	
	Возврат ЦветаСтиля[ИмяЦветаСтиля];
	
КонецФункции

// Функция получает шрифт стиля по имени элемента стиля.
// 
// Параметры:
// ИмяШрифтаСтиля - Строка - Имя шрифта стиля.
// 
// Возвращаемое значение:
// Шрифт.
// 
Функция ШрифтСтиля(ИмяШрифтаСтиля) Экспорт
	
	Возврат ШрифтыСтиля[ИмяШрифтаСтиля];
	
КонецФункции

// Функция, возвращает RGB код цвета по его названию
//
Функция ПолучитьЦвет(НазваниеЦвета)Экспорт
	
	Если НЕ НазваниеЦвета = "" и НазваниеЦвета.Вид = ВидЦвета.Абсолютный Тогда
		Красный = НазваниеЦвета.Красный;
		Зеленый = НазваниеЦвета.Зеленый;
		Синий   = НазваниеЦвета.Синий;
		Red   = КонвертацияСистемСчисления(Красный, Истина);
		Green = КонвертацияСистемСчисления(Зеленый, Истина);
		Blue  = КонвертацияСистемСчисления(Синий, Истина);
		Возврат "#"+Red+Green+Blue;
	ИначеЕсли НЕ НазваниеЦвета = "" и НазваниеЦвета.Вид = ВидЦвета.ЭлементСтиля Тогда
		НазваниеЦвета = Сред(НазваниеЦвета, 8, 100);
		Если НазваниеЦвета = "Фон формы" Тогда
			Возврат "#FCFAEB";
		ИначеЕсли НазваниеЦвета = "Текст формы" Тогда
			Возврат "#413003";
		ИначеЕсли НазваниеЦвета = "Фон кнопки" Тогда
			Возврат "#F5F2DD";
		ИначеЕсли НазваниеЦвета = "Текст кнопки" Тогда
			Возврат "#896704";
		ИначеЕсли НазваниеЦвета = "Фон редактирования" Тогда
			Возврат "#FFFFFF";
		ИначеЕсли НазваниеЦвета = "Текст редактирования" Тогда
			Возврат "#000000";
		ИначеЕсли НазваниеЦвета = "Фон выделения редактирования" Тогда
			Возврат "#536AC2";
		ИначеЕсли НазваниеЦвета = "Текст выделения редактирования" Тогда
			Возврат "#FFFFFF";
		ИначеЕсли НазваниеЦвета = "Альтернативный фон редактирования" Тогда
			Возврат "#F5FBF7";
		ИначеЕсли НазваниеЦвета = "Фон подсказки" Тогда
			Возврат "#FFFAD9";
		ИначеЕсли НазваниеЦвета = "Текст подсказки" Тогда
			Возврат "#000000";	
		ИначеЕсли НазваниеЦвета = "Особый текст" Тогда
			Возврат "#FF0000";	
		ИначеЕсли НазваниеЦвета = "Отрицательное число" Тогда
			Возврат "#FF0000";	
		ИначеЕсли НазваниеЦвета = "Рамка" Тогда
			Возврат "#B3AC86";	
		ИначеЕсли НазваниеЦвета = "Фон шапки отчета" Тогда
			Возврат "#F4ECC5";	
		ИначеЕсли НазваниеЦвета = "Фон группировки отчета 1" Тогда
			Возврат "#F8F2D8";	
		ИначеЕсли НазваниеЦвета = "Фон группировки отчета 2" Тогда
			Возврат "#F8F9EC";	
		ИначеЕсли НазваниеЦвета = "Линия отчета" Тогда
			Возврат "#CCC085";	
		ИначеЕсли НазваниеЦвета = "ВыполненнаяЗадача" Тогда
			Возврат "#2F4F4F";
		ИначеЕсли НазваниеЦвета = "ЗавершенныйБизнесПроцесс" Тогда
			Возврат "#808080";
		ИначеЕсли НазваниеЦвета = "НеСтартованныйБизнесПроцесс" Тогда
			Возврат "#B22222";	
		ИначеЕсли НазваниеЦвета = "ПользовательВыбранный" Тогда
			Возврат "#DCDCDC";
		ИначеЕсли НазваниеЦвета = "ПоясняющийТекст" Тогда
			Возврат "#1955AE";	
		ИначеЕсли НазваниеЦвета = "ПросроченнаяЗадача" Тогда
			Возврат "#800000";	
		ИначеЕсли НазваниеЦвета = "РольБезИсполнителей" Тогда
			Возврат "#800000";	
		ИначеЕсли НазваниеЦвета = "УдаленныйДополнительныйРеквизитЦвет" Тогда
			Возврат "#FF0000";
		ИначеЕсли НазваниеЦвета = "ФайлЗанятыйДругимПользователем" Тогда
			Возврат "#808080";	
		ИначеЕсли НазваниеЦвета = "ФайлЗанятыйТекущимПользователем" Тогда
			Возврат "#008000";		
		КонецЕсли;		
	ИначеЕсли НЕ НазваниеЦвета = "" Тогда	
		Возврат Сред(НазваниеЦвета, Найти(НазваниеЦвета, "(")+1, СтрДлина(НазваниеЦвета) - Найти(НазваниеЦвета, "(")-1); 			
	КонецЕсли;	
		
КонецФункции

// Функция - возвращает цвет текста для указанного цвета фона.
//
// Параметры:
//  ЦветФона - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЦветТекстаПоЦветуФона(ЦветФона, ВернутьСтруктуру = Ложь) Экспорт
	
	RGBЦвет = ПолучитьRGBЦвет(ЦветФона,,, ВернутьСтруктуру);
		
	Если ЗначениеЗаполнено(RGBЦвет) Тогда
		
		// Если цвет белый.
		Если RGBЦвет.Красный = 255
			И RGBЦвет.Зеленый = 255
			И RGBЦвет.Синий = 255 Тогда
			
			ЦветТекста = Новый Цвет(128, 128, 128);
			
		ИначеЕсли (1 - (0.299 * RGBЦвет.Красный + 0.587 * RGBЦвет.Зеленый + 0.114 * RGBЦвет.Синий) / 255) > 0.5 Тогда
				
			ЦветТекста = Новый Цвет(250, 250, 250);
		Иначе
			ЦветТекста = Новый Цвет(64, 64, 64);
		КонецЕсли;
		
	Иначе
		ЦветТекста = Новый Цвет(64, 64, 64);
	КонецЕсли;
	
	Возврат ЦветТекста;
	
КонецФункции	

// Функция возвращает конвертированное значеие кода карты
//
Функция КонвертацияСистемСчисления(Код, ПервоеЧисло) Экспорт
	
	ЧислоHex = "";
	Если Код < 16 Тогда
		ЧислоHex = ЧислоHex + ОпределениеЦифрыHEXпоDEC(Код);
	Иначе	
		Пока Код > 15 Цикл 
			Остаток = Цел(Код/16);
			Код = Код - (Остаток * 16);
			Если (Код < 16) и (Остаток < 16) Тогда 
				КодКопия = код;
				ЧислоHex = ЧислоHex + ОпределениеЦифрыHEXпоDEC(КодКопия);
			КонецЕсли;
			Если Остаток < 16 Тогда 
				ОстатокКопия = Остаток;
				ЧислоHex = ЧислоHex + ОпределениеЦифрыHEXпоDEC(ОстатокКопия);
			Иначе 
				ЧислоHex = ЧислоHex + ОпределениеЦифрыHEXпоDEC(Код);
				Код = Остаток;
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	
	ДлинаЧисла = СтрДлина(ЧислоHex);
	КодHex = "";
	Пока ДлинаЧисла > 0 Цикл			   
		КодHex = КодHex + Сред(ЧислоHex,ДлинаЧисла,1);
		ДлинаЧисла = ДлинаЧисла - 1; 		
	КонецЦикла;
	
	а = ?(ПервоеЧисло, 2, 4);
	
	Пока СтрДлина(КодHex) < а Цикл
		КодHex = "0" + КодHex;
	КонецЦикла;
		
	Возврат КодHex;
	
КонецФункции 

// Функция возвращает число в шестнадцатеричной системе счисления
//
Функция ОпределениеЦифрыHEXпоDEC(Знак)
	
	Если Знак < 10 Тогда
	ИначеЕсли Знак = 10 Тогда 
		Знак = "A";		
	ИначеЕсли Знак = 11 Тогда
		Знак = "B";		
	ИначеЕсли  Знак = 12 Тогда
		Знак = "C";		
	ИначеЕсли Знак = 13 Тогда
		Знак = "D";		
	ИначеЕсли Знак = 14 Тогда
		Знак = "E";		
	ИначеЕсли Знак = 15 Тогда 
		Знак = "F";					
	КонецЕсли;
	
	Возврат Строка(Знак);
	
КонецФункции

#Область ПодпискаНаСобытия

// Переопределяет стандартное представление ссылки.
//
Процедура ПолучитьПредставлениеПолейДокумента(Источник, Поля, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Ссылка");
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("Проведен");
	Поля.Добавить("ПометкаУдаления");
	
КонецПроцедуры // ПолучитьПредставлениеДокумента()

// Переопределяет стандартное представление ссылки.
//
Процедура ПолучитьПредставлениеПолейДокументаТолькоЗапись(Источник, Поля, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Ссылка");
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("ПометкаУдаления");
	
КонецПроцедуры // ПолучитьПредставлениеДокумента()

// Переопределяет стандартное представление ссылки.
//
Процедура ПолучитьПредставлениеДокумента(Источник, Данные, Представление, СтандартнаяОбработка) Экспорт
	
	Если // ПараметрыСеанса.ОбменДаннымиВключен = Истина
		 Данные.Номер = Null
		ИЛИ НЕ ЗначениеЗаполнено(Данные.Ссылка) Тогда
		
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Состояние = "";
	Если Данные.ПометкаУдаления Тогда
		Состояние = НСтр("ru='(удален)';en='(deleted)'");
	ИначеЕсли Данные.Свойство("Проведен") И НЕ Данные.Проведен Тогда
		Состояние = НСтр("ru='(не проведен)';en='(not held)'");
	КонецЕсли;
			
	Если ТипЗнч(Источник) = Тип("ДокументМенеджер.ЧекКоррекции") и Данные.ЭтоСторно = Истина Тогда
		Состояние = Нстр("ru = '(сторно)'; en = '(storno)'") + Состояние;
	КонецЕсли;   
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='%1 %2 от %3 %4';en=' %1 %2 from %3 %4'"),
		?(ЗначениеЗаполнено(Представление), Представление, Данные.Ссылка.Метаданные().Представление()),
		?(Данные.Свойство("Номер"), ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Данные.Номер, ""), ""),
		Формат(Данные.Дата, "ДЛФ=D"),
		Состояние);
	
КонецПроцедуры

// Переопределяет стандартное представление ссылки.
//
Процедура ПолучитьПредставлениеПолейСправочника(Источник, Поля, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Ссылка");
	Поля.Добавить("Наименование");
	Поля.Добавить("ПометкаУдаления");
	
КонецПроцедуры // ПолучитьПредставлениеДокумента()

// Переопределяет стандартное представление ссылки.
//
Процедура ПолучитьПредставлениеСправочника(Источник, Данные, Представление, СтандартнаяОбработка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Данные.Ссылка) ИЛИ НЕ ЗначениеЗаполнено(Данные.Наименование) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Состояние = "";
	Если Данные.ПометкаУдаления Тогда
		Состояние = НСтр("ru='(удален)';en='(deleted)'");
	КонецЕсли;
		
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		?(ЗначениеЗаполнено(Состояние),НСтр("ru='%1 %2';en=' %1 %2'"), НСтр("ru='%1%2';en=' %1 %2'")),
		?(ЗначениеЗаполнено(Представление), Представление, Данные.Наименование),
		Состояние);
	
КонецПроцедуры // ПолучитьПредставлениеДокумента()

#КонецОбласти

#Область Гипертекст

// Функция - Получить адрес картинки HTML.
//
Функция ПолучитьАдресКартинкиHTMLВызовСервера(Картинка) Экспорт
		
	Возврат Гипертекст.ПолучитьАдресКартинкиHTML(Картинка);
	
КонецФункции

#КонецОбласти

// Процедура - Запись журнала регистрации на сервере
//
// Параметры:
//  ИмяСобытия		 - 	 - 
//  ОписаниеОшибки	 - 	 - 
//
Процедура ЗаписьЖурналаРегистрацииНаСервере(ИмяСобытия, ОписаниеОшибки) Экспорт

	ЗаписьЖурналаРегистрации(ИмяСобытия, 
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ОписаниеОшибки);

КонецПроцедуры

// Функция проверяет существование расширения
//
Функция ИспользуетсяРасширение(ИмяРасширения) Экспорт
    
	Возврат ОбщегоНазначенияПовтИспСтоматология.ИспользуетсяРасширение(ИмяРасширения);
	
КонецФункции

#КонецОбласти 
