
#Область СлужебныеПроцедурыИФункции

// Функция определяет пол клиента по ФИО
//
Функция ОпределитьПолКлиента(Фамилия, Имя, Отчество) Экспорт
	
	Фамилия = СокрЛП(Фамилия);
	Имя = СокрЛП(Имя);
	Отчество = СокрЛП(Отчество);
	Если Отчество <> "" Тогда
		Окончание_1_буква = НРег(Сред(Отчество, СтрДлина(Отчество)));
		Если Окончание_1_буква = "ч" ИЛИ Окончание_1_буква = "в" Тогда
			Возврат "Мужской";
		ИначеЕсли Окончание_1_буква = "а" Тогда
			Возврат "Женский";
		КонецЕсли;
	КонецЕсли;
	
	Окончание_1_буква = НРег(Сред(Фамилия, СтрДлина(Фамилия)));
	Окончание_2_буквы = НРег(Сред(Фамилия, СтрДлина(Фамилия) - 1));
	Окончание_3_буквы = НРег(Сред(Фамилия, СтрДлина(Фамилия) - 2));
	окончанияМужскихФамилий=",ов,ев,ий,ин,";
	окончанияЖенскихФамилий=",ова,ева,ина,ая,";
	Если Найти(окончанияМужскихФамилий, "," + Окончание_2_буквы + ",") > 0 Тогда
		Возврат "Мужской";
	ИначеЕсли Найти(окончанияЖенскихФамилий, "," + Окончание_2_буквы + ",") > 0 
		ИЛИ Найти(окончанияЖенскихФамилий, "," + Окончание_3_буквы + ",") > 0 
		Тогда
		Возврат "Женский";
	КонецЕсли;
	
	Если Имя <> "" Тогда
		Окончание_1_буква = НРег(Сред(Имя, СтрДлина(Имя)));
		Если Окончание_1_буква = "а" ИЛИ Окончание_1_буква = "я"  ИЛИ Окончание_1_буква = "е" Тогда
			Возврат "Женский";
		Иначе
			Возврат "Мужской";
		КонецЕсли;
	КонецЕсли;
	
	
	Возврат "";
КонецФункции

// Возвращает Истина, если этот веб клиент не поддерживает расширение работы с файлами.
Функция ЭтоВебКлиентБезПоддержкиРасширенияРаботыСФайлами() Экспорт
	
	#Если Не ВебКлиент Тогда
		Возврат Ложь;
	#КонецЕсли
	
	// Если ОбщегоНазначенияКлиентСервер.ЭтоПлатформа83() Тогда
	//	Возврат Ложь;
	// КонецЕсли;
	
	СистемнаяИнфо = Новый СистемнаяИнформация;
	
	Если Найти(СистемнаяИнфо.ИнформацияПрограммыПросмотра, "Safari") <> 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Найти(СистемнаяИнфо.ИнформацияПрограммыПросмотра, "Chrome") <> 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Процедура, выполняет выбор времени по структурной единице.
//  Параметры:
//   ДанныеВыбора         - структура выбора;
//   СтандартнаяОбработка - признак выполнения стандартной обработки выбора.
//   ТекущийЭлемент       - текущая строка табличной части, в которой осуществляется выбор значения.
//
Функция ВыбратьСменуПоСтруктурнойЕдинице(СтандартнаяОбработка, ТекущийЭлемент, ДатаНачала, ВыбраннаяДатаНачала = Неопределено) Экспорт

	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ТекущийЭлемент) Тогда
		ДанныеВыбора = Новый СписокЗначений;
		Если Не ОбщегоНазначенияСтоматология.ПроверитьНаличиеВремениИПолучитьСписокДляВыбора(ТекущийЭлемент, ДанныеВыбора, ДатаНачала, , ВыбраннаяДатаНачала) Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'Для данной структурной единицы не установлено время работы.'"));
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДанныеВыбора;

КонецФункции

#КонецОбласти