
#Область СлужебныйПрограммныйИнтерфейс

Процедура АвторизоватьсяНаСайте(ТранспортныйМодуль, ОповещениеПриЗавершении) Экспорт
	
	УстановитьТекущийКлючСессии(ТранспортныйМодуль, Неопределено);
	Если ТранспортныйМодуль.ТипАутентификации = ПредопределенноеЗначение("Перечисление.ТипыАутентификацииМДЛП.ЭП") Тогда
		АвторизоватьсяЧерезПодпись(ТранспортныйМодуль, ОповещениеПриЗавершении);
	Иначе
		АвторизоватьсяСУказаниемПароля(ТранспортныйМодуль, ОповещениеПриЗавершении);
	КонецЕсли;
	
КонецПроцедуры

// Отправляет сообщение через транспортный модуль.
//
// Параметры:
//  ТранспортныйМодуль - Структура - транспортный модуль, через который нужно отправить сообщение.
//  Сообщение          - Строка - отправляемое сообщение.
//  ОповещениеПриЗавершении - ОписаниеОповещения - куда вернуть результат отправки.
//
Процедура ОтправитьСообщение(ТранспортныйМодуль, Сообщение, ОповещениеПриЗавершении) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("Сообщение", Сообщение);
	Контекст.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	
	Оповещение = Новый ОписаниеОповещения("ОтправитьСообщение_ПослеПопыткиАвторизации", ЭтотОбъект, Контекст);
	ПолучитьТекущийКлючСессии(ТранспортныйМодуль, Оповещение);
	
КонецПроцедуры

// Получает входящие сообщения через транспортный модуль.
//
// Параметры:
//  ТранспортныйМодуль - Структура - транспортный модуль, через который нужно отправить сообщение.
//  ОповещениеПриЗавершении - ОписаниеОповещения - куда вернуть результат операции.
//
Процедура ПолучитьВходящиеСообщения(ТранспортныйМодуль, ОповещениеПриЗавершении) Экспорт
	
	ВыполнитьАвторизованныйЗапрос(ТранспортныйМодуль, ОповещениеПриЗавершении, "ПолучитьВходящиеСообщения");
	
КонецПроцедуры

Процедура ПолучитьИнформациюОСубъектахОбращения(ТранспортныйМодуль, Отбор, ОповещениеПриЗавершении) Экспорт
	
	ВыполнитьАвторизованныйЗапрос(
		ТранспортныйМодуль,
		ОповещениеПриЗавершении,
		"ПолучитьИнформациюОСубъектахОбращения",
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Отбор));
	
КонецПроцедуры

Процедура ПолучитьИнформациюОбУчастнике(ТранспортныйМодуль, ОповещениеПриЗавершении) Экспорт
	
	ВыполнитьАвторизованныйЗапрос(ТранспортныйМодуль, ОповещениеПриЗавершении, "ПолучитьИнформациюОбУчастнике");
	
КонецПроцедуры

Процедура ПолучитьДетальнуюИнформациюОКИЗ(ТранспортныйМодуль, КИЗ, ОповещениеПриЗавершении) Экспорт
	
	ВыполнитьАвторизованныйЗапрос(
		ТранспортныйМодуль,
		ОповещениеПриЗавершении,
		"ПолучитьДетальнуюИнформациюОКИЗ",
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КИЗ));
	
КонецПроцедуры

Процедура ЗакрытьСесию(ТранспортныйМодуль) Экспорт
	
	КлючСессии = ТекущийКлючСессии(ТранспортныйМодуль);
	Если КлючСессии <> Неопределено Тогда
		ТранспортныйМодуль.Вставить("КлючСессии", КлючСессии);
		ТранспортМДЛПАПИВызовСервера.ВыполнитьМетодАПИ(ТранспортныйМодуль, "ЗакрытьСессию");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьТекущийКлючСессии(ТранспортныйМодуль, Оповещение) Экспорт
	
	ДанныеСертификата = СертификатСессии(ТранспортныйМодуль);
	Если ДанныеСертификата <> Неопределено Тогда
		ТранспортныйМодуль.Вставить("Сертификат", ДанныеСертификата);
	КонецЕсли;
	
	КлючСессии = ТекущийКлючСессии(ТранспортныйМодуль);
	Если КлючСессии = Неопределено Тогда
		АвторизоватьсяНаСайте(ТранспортныйМодуль, Оповещение);
	Иначе
		ТранспортныйМодуль.Вставить("КлючСессии", КлючСессии);
		Результат = Новый Структура("Статус", "Успешно");
		Результат.Вставить("КлючСессии", КлючСессии);
		Результат.Вставить("ТранспортныйМодуль", ТранспортныйМодуль);
		ВыполнитьОбработкуОповещения(Оповещение, Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьАвторизованныйЗапрос(ТранспортныйМодуль, ОповещениеПриЗавершении, ИмяМетода, Параметры = Неопределено) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ИмяМетода", ИмяМетода);
	Если Параметры <> Неопределено Тогда
		Контекст.Вставить("ПараметрыМетода", Параметры);
	КонецЕсли;
	Контекст.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	
	Оповещение = Новый ОписаниеОповещения("ВыполнитьМетодАПИ_ПослеПопыткиАвторизации", ЭтотОбъект, Контекст);
	ПолучитьТекущийКлючСессии(ТранспортныйМодуль, Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьСообщение_ПослеПопыткиАвторизации(РезультатАвторизации, Контекст) Экспорт
	
	Если РезультатАвторизации.Статус = "Ошибка" Тогда
		ОповеститьОРезультатеОтправкиСообщения(РезультатАвторизации, Контекст);
		Возврат;
	КонецЕсли;
	
	ТранспортныйМодуль = РезультатАвторизации.ТранспортныйМодуль;
	Контекст.Вставить("ТранспортныйМодуль", ТранспортныйМодуль);
	Если ТранспортныйМодуль.ТипАутентификации = ПредопределенноеЗначение("Перечисление.ТипыАутентификацииМДЛП.ЭП")
	   И Не ЗначениеЗаполнено(Контекст.Сообщение.Подпись) Тогда
		ОписаниеДанных = Новый Структура;
		ОписаниеДанных.Вставить("Операция", НСтр("ru = 'Подписание сообщения для отправки в ""ИС ""Маркировка.""МДЛП""'"));
		ОписаниеДанных.Вставить("ЗаголовокДанных", Строка(Контекст.Сообщение.Операция));
		Если ТранспортныйМодуль.Свойство("Сертификат") Тогда
			ОписаниеДанных.Вставить("ОтборСертификатов", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТранспортныйМодуль.Сертификат.Ссылка));
		ИначеЕсли ТранспортныйМодуль.Свойство("Организация") И ЗначениеЗаполнено(ТранспортныйМодуль.Организация) И ТипЗнч(ТранспортныйМодуль.Организация) <> Тип("Строка") Тогда
			ОписаниеДанных.Вставить("ОтборСертификатов", Новый Структура("Организация", ТранспортныйМодуль.Организация));
		КонецЕсли;
		ОписаниеДанных.Вставить("ПоказатьКомментарий", Ложь);
		ОписаниеДанных.Вставить("БезПодтверждения", Истина);
		
		ОписаниеДанных.Вставить("Данные", ПолучитьДвоичныеДанныеИзСтроки(Контекст.Сообщение.ТекстСообщения));
		ОписаниеДанных.Вставить("Представление", Контекст.Сообщение.Документ);
		
		Оповестить = Новый ОписаниеОповещения("ОтправитьСообщение_ПослеПодписания", ЭтотОбъект, Контекст);
		ЭлектроннаяПодписьКлиент.Подписать(ОписаниеДанных,, Оповестить);
	Иначе
		ОтправитьПодписанноеСообщение(Контекст);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьСообщение_ПослеПодписания(РезультатПодписания, Контекст) Экспорт
	
	Если Не РезультатПодписания.Успех Тогда
		Результат = Новый Структура;
		Результат.Вставить("Статус", "Ошибка");
		Результат.Вставить("ОписаниеОшибки", НСтр("ru = 'Ошибка подписания сообщения.'"));
		ОповеститьОРезультатеОтправкиСообщения(Результат, Контекст);
	Иначе
		Контекст.Сообщение.Вставить("Подпись", Base64Строка(ПолучитьСвойстваПодписи(РезультатПодписания).Подпись));
		ОтправитьПодписанноеСообщение(Контекст);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьПодписанноеСообщение(Контекст)
	
	ТранспортныйМодуль = Контекст.ТранспортныйМодуль;
	Результат = ТранспортМДЛПАПИВызовСервера.ВыполнитьМетодАПИ(
		ТранспортныйМодуль, "ОтправитьСообщение", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Контекст.Сообщение));
	Если Результат.Статус = "Ошибка" Тогда
		Если Результат.ТребуетсяАвторизация Тогда
			Оповещение = Новый ОписаниеОповещения("ОтправитьСообщение_ПослеПопыткиАвторизации", ЭтотОбъект, Контекст);
			АвторизоватьсяНаСайте(ТранспортныйМодуль, Оповещение);
			Возврат;
		КонецЕсли;
	Иначе
		Результат.Вставить("Подпись", Контекст.Сообщение.Подпись);
	КонецЕсли;
	
	ОповеститьОРезультатеОтправкиСообщения(Результат, Контекст);
	
КонецПроцедуры

Процедура ОповеститьОРезультатеОтправкиСообщения(Результат, Контекст)
	
	ВыполнитьОбработкуОповещения(Контекст.ОповещениеПриЗавершении, Результат);
	
КонецПроцедуры


Процедура ВыполнитьМетодАПИ_ПослеПопыткиАвторизации(РезультатАвторизации, Контекст) Экспорт
	
	Если РезультатАвторизации.Статус = "Ошибка" Тогда
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеПриЗавершении, РезультатАвторизации);
		Возврат;
	КонецЕсли;
	
	ТранспортныйМодуль = РезультатАвторизации.ТранспортныйМодуль;
	ПараметрыМетода = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Контекст, "ПараметрыМетода");
	Результат = ТранспортМДЛПАПИВызовСервера.ВыполнитьМетодАПИ(ТранспортныйМодуль, Контекст.ИмяМетода, ПараметрыМетода);
	Если Результат.Статус = "Ошибка" Тогда
		Если Результат.ТребуетсяАвторизация Тогда
			Оповещение = Новый ОписаниеОповещения("ВыполнитьМетодАПИ_ПослеПопыткиАвторизации", ЭтотОбъект, Контекст);
			АвторизоватьсяНаСайте(ТранспортныйМодуль, Оповещение);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Контекст.ОповещениеПриЗавершении, Результат);
	
КонецПроцедуры


Процедура АвторизоватьсяЧерезПодпись(ТранспортныйМодуль, ОповещениеПриЗавершении)
	
	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("Операция", НСтр("ru = 'Авторизация в ""ИС ""Маркировка.""МДЛП""'"));
	ОписаниеДанных.Вставить("ЗаголовокДанных", "");
	Если ТранспортныйМодуль.Свойство("Сертификат") Тогда
		ОписаниеДанных.Вставить("ОтборСертификатов", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТранспортныйМодуль.Сертификат.Ссылка));
	КонецЕсли;
	ОписаниеДанных.Вставить("ПоказатьКомментарий", Ложь);
	ОписаниеДанных.Вставить("БезПодтверждения", Истина);
	
	ОписаниеДанных.Вставить("Данные", Новый ОписаниеОповещения("АвторизоватьсяЧерезПодпись_ПолучитьКодАутентификации", ЭтотОбъект, ТранспортныйМодуль));
	Если ТранспортныйМодуль.Свойство("Организация") И ЗначениеЗаполнено(ТранспортныйМодуль.Организация) Тогда
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Организация: %1'"), ТранспортныйМодуль.Организация);
	Иначе
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Идентификатор организации: %1'"), ТранспортныйМодуль.ИдентификаторОрганизации);
	КонецЕсли;
	ОписаниеДанных.Вставить("Представление", Представление);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТранспортныйМодуль", ТранспортныйМодуль);
	ДополнительныеПараметры.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	Оповестить = Новый ОписаниеОповещения("АвторизоватьсяЧерезПодпись_ПослеПодписания", ЭтотОбъект, ДополнительныеПараметры);
	ЭлектроннаяПодписьКлиент.Подписать(ОписаниеДанных,, Оповестить);
	
КонецПроцедуры

Процедура АвторизоватьсяЧерезПодпись_ПолучитьКодАутентификации(Параметры, ТранспортныйМодуль) Экспорт
	
	РезультатОперации = Новый Структура;
	РезультатОперации.Вставить("Данные");
	
	ТранспортныйМодуль.Вставить("Сертификат", Параметры.ОписаниеДанных.ВыбранныйСертификат);
	Результат = ТранспортМДЛПАПИВызовСервера.ВыполнитьМетодАПИ(ТранспортныйМодуль, "ПолучитьКодАутентификации");
	ТранспортныйМодуль.Удалить("Сертификат");
	Если Результат.Статус = "Ошибка" Тогда
		РезультатОперации.Вставить("ОписаниеОшибки", Результат.ОписаниеОшибки);
	Иначе
		РезультатОперации.Вставить("Данные", ПолучитьДвоичныеДанныеИзСтроки(Результат.КодАутентификации));
		Параметры.ОписаниеДанных.Вставить("КодАутентификации", Результат.КодАутентификации);
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Параметры.Оповещение, РезультатОперации);
	
КонецПроцедуры

Процедура АвторизоватьсяЧерезПодпись_ПослеПодписания(РезультатПодписания, Контекст) Экспорт
	
	Если Не РезультатПодписания.Успех Тогда
		Результат = Новый Структура;
		Результат.Вставить("Статус", "Ошибка");
		Результат.Вставить("ОписаниеОшибки", НСтр("ru = 'Ошибка авторизации.'"));
	Иначе
		Подпись = ПолучитьСвойстваПодписи(РезультатПодписания).Подпись;
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(РезультатПодписания.КодАутентификации);
		ПараметрыМетода.Добавить(Подпись);
		Результат = ТранспортМДЛПАПИВызовСервера.ВыполнитьМетодАПИ(Контекст.ТранспортныйМодуль, "ПолучитьКлючСессии", ПараметрыМетода);
	КонецЕсли;
	
	ТранспортныйМодуль = Контекст.ТранспортныйМодуль;
	Если Результат.Статус <> "Ошибка" Тогда
		ТранспортныйМодуль.Вставить("Сертификат", РезультатПодписания.ВыбранныйСертификат);
		ТранспортныйМодуль.Вставить("КлючСессии", Результат.КлючСессии);
		УстановитьТекущийКлючСессии(ТранспортныйМодуль, Результат.КлючСессии, Результат.ВремяЖизни);
		УстановитьСертификатСессии(ТранспортныйМодуль, РезультатПодписания.ВыбранныйСертификат);
		Результат.Вставить("ТранспортныйМодуль", ТранспортныйМодуль);
	Иначе
		УстановитьСертификатСессии(ТранспортныйМодуль, Неопределено);
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Контекст.ОповещениеПриЗавершении, Результат);
	
КонецПроцедуры

Процедура АвторизоватьсяСУказаниемПароля(ТранспортныйМодуль, ОповещениеПриЗавершении)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторОрганизации", ТранспортныйМодуль.ИдентификаторОрганизации);
	ПараметрыФормы.Вставить("ПараметрыПодключения"    , ТранспортныйМодуль);
	
	Контекст = Новый Структура;
	Контекст.Вставить("ТранспортныйМодуль"     , ТранспортныйМодуль);
	Контекст.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	Обработчик = Новый ОписаниеОповещения("АвторизоватьсяСУказаниемПароля_ПослеАвторизации", ЭтотОбъект, Контекст);
	ОткрытьФорму("ОбщаяФорма.АвторизацияАПИМДЛП", ПараметрыФормы,,,,, Обработчик);
	
КонецПроцедуры

Процедура АвторизоватьсяСУказаниемПароля_ПослеАвторизации(Результат, Контекст) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Результат = Новый Структура;
		Результат.Вставить("Статус", "Ошибка");
		Результат.Вставить("ОписаниеОшибки", НСтр("ru = 'Ошибка авторизации.'"));
	Иначе
		ТранспортныйМодуль = Контекст.ТранспортныйМодуль;
		ТранспортныйМодуль.Вставить("КлючСессии", Результат.КлючСессии);
		УстановитьТекущийКлючСессии(ТранспортныйМодуль, Результат.КлючСессии, Результат.ВремяЖизни);
		Результат.Вставить("ТранспортныйМодуль", ТранспортныйМодуль);
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Контекст.ОповещениеПриЗавершении, Результат);
	
КонецПроцедуры

Функция ТекущийКлючСессии(ТранспортныйМодуль)
	
	ИмяПараметра = "ИнтеграцияМДЛП.КлючСессии";
	
	КлючиСессий = ПараметрыПриложения[ИмяПараметра];
	Если КлючиСессий = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыКлючаСессии = КлючиСессий[ТранспортныйМодуль.ИдентификаторОрганизации];
	Если ПараметрыКлючаСессии = Неопределено Или ПараметрыКлючаСессии.ДатаИстеченияСрока < ТекущаяДата() Тогда
		Возврат Неопределено;
	Иначе
		Возврат ПараметрыКлючаСессии.КлючСессии;
	КонецЕсли;
	
КонецФункции

Процедура УстановитьТекущийКлючСессии(ТранспортныйМодуль, КлючСессии, ВремяЖизни = Неопределено)
	
	ИмяПараметра = "ИнтеграцияМДЛП.КлючСессии";
	
	КлючиСессий = ПараметрыПриложения[ИмяПараметра];
	Если КлючиСессий = Неопределено Тогда
		КлючиСессий = Новый Соответствие;
		ПараметрыПриложения.Вставить(ИмяПараметра, КлючиСессий);
	КонецЕсли;
	
	Если КлючСессии = Неопределено Тогда
		КлючиСессий.Вставить(ТранспортныйМодуль.ИдентификаторОрганизации, Неопределено);
	Иначе
		КлючиСессий.Вставить(
			ТранспортныйМодуль.ИдентификаторОрганизации,
			Новый Структура(
				"КлючСессии, ДатаИстеченияСрока",
				КлючСессии,
				ТекущаяДата() + ВремяЖизни * 60));
	КонецЕсли;
	
КонецПроцедуры

Функция СертификатСессии(ТранспортныйМодуль)
	
	ИмяПараметра = "ИнтеграцияМДЛП.СертификатСессии";
	
	Сертификаты = ПараметрыПриложения[ИмяПараметра];
	Если Сертификаты = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Сертификаты[ТранспортныйМодуль.ИдентификаторОрганизации];
	
КонецФункции

Процедура УстановитьСертификатСессии(ТранспортныйМодуль, Сертификат)
	
	ИмяПараметра = "ИнтеграцияМДЛП.СертификатСессии";
	
	Сертификаты = ПараметрыПриложения[ИмяПараметра];
	
	Если Сертификат = Неопределено И Сертификаты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Сертификаты = Неопределено Тогда
		Сертификаты = Новый Соответствие;
		ПараметрыПриложения.Вставить(ИмяПараметра, Сертификаты);
	КонецЕсли;
	
	Если Сертификат <> Неопределено Тогда
		Сертификаты.Вставить(ТранспортныйМодуль.ИдентификаторОрганизации, Сертификат);
	ИначеЕсли Сертификаты[ТранспортныйМодуль.ИдентификаторОрганизации] <> Неопределено Тогда
		Сертификаты.Удалить(ТранспортныйМодуль.ИдентификаторОрганизации);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСвойстваПодписи(РезультатПодписания)
	
	Если ЭтоАдресВременногоХранилища(РезультатПодписания.СвойстваПодписи) Тогда
		СвойстваПодписи = ПолучитьИзВременногоХранилища(РезультатПодписания.СвойстваПодписи);
	Иначе
		СвойстваПодписи = РезультатПодписания.СвойстваПодписи;
	КонецЕсли;
	
	Возврат СвойстваПодписи;
	
КонецФункции

#КонецОбласти
