
#Область СлужебныеПроцедурыИФункции

// Заполняет регистр сведений объектами, вошедшими в сегмент
//
//	ОбъектСегмента - Передается при необходимости обновить (добавить, удалить) только данный объект в сегменте
Процедура Сформировать(СегментСсылка, ОбъектСегмента = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		НачатьТранзакцию();
		
		Если ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
			НаименованиеРегистра = "НоменклатураСегмента";
			НаименованиеОбъекта	 = "Номенклатура";
		ИначеЕсли ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыКонтрагентов") Тогда
			НаименованиеРегистра = "КонтрагентыСегмента";
			НаименованиеОбъекта	 = "Контрагент";
		ИначеЕсли ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыСотрудников") Тогда
			НаименованиеРегистра = "СотрудникиСегмента";
			НаименованиеОбъекта	 = "Сотрудник";
		Иначе 
			Возврат;
		КонецЕсли;
		
		// Получаем актуальный состав сегмента
		СписокНовыйСоставСегмента = СписокЭлементовСКД(СегментСсылка, ОбъектСегмента, НаименованиеОбъекта);
		
		// Блокируем данные по ИД транзакци
		// Блокировка = Новый БлокировкаДанных;
		// ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СоставСегментов");
		// ЭлементБлокировки.УстановитьЗначение("Сегмент", СегментСсылка);
		//
		// Если ЗначениеЗаполнено(ОбъектСегмента) Тогда
		//	ЭлементБлокировки.УстановитьЗначение("ОбъектСегмента", ОбъектСегмента);
		// КонецЕсли;
		//
		// ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		// Блокировка.Заблокировать();
		
		МассивОтбораОбъектов = Новый Массив;
		Если ЗначениеЗаполнено(ОбъектСегмента) Тогда
			
			Если ТипЗнч(ОбъектСегмента) = Тип("Массив") Тогда
				МассивОтбораОбъектов = ОбъектСегмента;
			Иначе
				МассивОтбораОбъектов.Добавить(ОбъектСегмента);
			КонецЕсли;
		Иначе
			МассивОтбораОбъектов.Добавить(Неопределено);
		КонецЕсли;
				
		// Анализируем и получаем строки которые надо удалить
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СоставСегментов.Сегмент КАК Сегмент,
		|	СоставСегментов.&НаименованиеОбъекта КАК ОбъектСегмента
		|ИЗ
		|	РегистрСведений.&НаименованиеРегистра КАК СоставСегментов
		|ГДЕ
		|	СоставСегментов.Сегмент = &Сегмент
		|	И ВЫБОР
		|			КОГДА НЕ НЕОПРЕДЕЛЕНО В (&ОбъектСегмента)
		|				ТОГДА СоставСегментов.&НаименованиеОбъекта В (&ОбъектСегмента)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И НЕ СоставСегментов.&НаименованиеОбъекта В (&МассивОбъектовСегмента)");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НаименованиеОбъекта"	, НаименованиеОбъекта);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НаименованиеРегистра", НаименованиеРегистра);
		
		Запрос.УстановитьПараметр("Сегмент"               , СегментСсылка);
		Запрос.УстановитьПараметр("ОбъектСегмента"        , МассивОтбораОбъектов);
		Запрос.УстановитьПараметр("МассивОбъектовСегмента", СписокНовыйСоставСегмента.ВыгрузитьКолонку(НаименованиеОбъекта));	
		
		ТаблицаСоставаДляУдаления = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаТЗ Из ТаблицаСоставаДляУдаления Цикл
			
			ЗаписьСоставаСегмента               		 = РегистрыСведений[НаименованиеРегистра].СоздатьМенеджерЗаписи();
			ЗаписьСоставаСегмента.Сегмент       	  	 = СегментСсылка;
			ЗаписьСоставаСегмента[НаименованиеОбъекта]	 = СтрокаТЗ.ОбъектСегмента;
			ЗаписьСоставаСегмента.Удалить();
			
		КонецЦикла;
		
		// Анализируем и получаем строки которые надо добавляем
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	&Сегмент КАК Сегмент,
		|	АктуальныеОбъектыСегмента.&НаименованиеОбъекта КАК &НаименованиеОбъекта
		|ПОМЕСТИТЬ АктуальныеОбъектыСегмента
		|ИЗ
		|	&ТаблицаОбъектовСегмента КАК АктуальныеОбъектыСегмента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АктуальныеОбъектыСегмента.Сегмент КАК Сегмент,
		|	АктуальныеОбъектыСегмента.&НаименованиеОбъекта КАК &НаименованиеОбъекта
		|ИЗ
		|	АктуальныеОбъектыСегмента КАК АктуальныеОбъектыСегмента
		|ГДЕ
		|	АктуальныеОбъектыСегмента.Сегмент = &Сегмент
		|	И ВЫБОР
		|			КОГДА НЕ НЕОПРЕДЕЛЕНО В (&ОбъектСегмента)
		|				ТОГДА АктуальныеОбъектыСегмента.&НаименованиеОбъекта В (&ОбъектСегмента)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И НЕ АктуальныеОбъектыСегмента.&НаименованиеОбъекта В
		|				(ВЫБРАТЬ
		|					СоставСегментов.&НаименованиеОбъекта
		|				ИЗ
		|					РегистрСведений.&НаименованиеРегистра КАК СоставСегментов
		|				ГДЕ
		|					СоставСегментов.Сегмент = &Сегмент
		|					И ВЫБОР
		|						КОГДА НЕ НЕОПРЕДЕЛЕНО В (&ОбъектСегмента)
		|							ТОГДА СоставСегментов.&НаименованиеОбъекта В (&ОбъектСегмента)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ)");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НаименованиеОбъекта"	, НаименованиеОбъекта);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НаименованиеРегистра", НаименованиеРегистра);
		
		Запрос.УстановитьПараметр("Сегмент"                , СегментСсылка);
		Запрос.УстановитьПараметр("ОбъектСегмента"         , МассивОтбораОбъектов);
		Запрос.УстановитьПараметр("ТаблицаОбъектовСегмента", СписокНовыйСоставСегмента);	
		
		ТаблицаСоставаДляДобавления = Запрос.Выполнить().Выгрузить();
		
		Если ТаблицаСоставаДляДобавления.Количество() > 0 Тогда
			
			НаборЗаписейСоставСегментов = РегистрыСведений[НаименованиеРегистра].СоздатьНаборЗаписей();
			НаборЗаписейСоставСегментов.Отбор.Сегмент.Установить(СегментСсылка);
			НаборЗаписейСоставСегментов.Загрузить(ТаблицаСоставаДляДобавления);		
			НаборЗаписейСоставСегментов.Записать(Ложь);
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию(); 	
		
	Исключение
		
		ОписОшибки = ОписаниеОшибки();
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры

// Заполняет регистр сведений объектами, вошедшими в сегмент.
//
Процедура СформироватьПоМассиву(СегментСсылка, МассивКлиентов) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
		НаименованиеРегистра = "НоменклатураСегмента";
		НаименованиеОбъекта	 = "Номенклатура";
	ИначеЕсли ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыКонтрагентов") Тогда
		НаименованиеРегистра = "КонтрагентыСегмента";
		НаименованиеОбъекта	 = "Контрагент";
	ИначеЕсли ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыСотрудников") Тогда
		НаименованиеРегистра = "СотрудникиСегмента";
		НаименованиеОбъекта	 = "Сотрудник";
	Иначе 
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений[НаименованиеРегистра].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сегмент.Установить(СегментСсылка);
	
	ТаблицаСегмента = НаборЗаписей.ВыгрузитьКолонки();
	Для Каждого СтрокаТЧ из МассивКлиентов Цикл
		НоваяСтрока               		 = ТаблицаСегмента.Добавить();
		НоваяСтрока.Сегмент       		 = СегментСсылка;
		НоваяСтрока[НаименованиеОбъекта] = СтрокаТЧ;		
	КонецЦикла;	
	
	НаборЗаписей.Загрузить(ТаблицаСегмента);		
	НаборЗаписей.Записать(Ложь);
	
КонецПроцедуры

// Заполняет регистр сведений объектами, вошедшими в сегмент
//
//	ОбъектСегмента - Передается при необходимости обновить (добавить, удалить) только данный объект в сегменте
Процедура ОбновитьСегментПоМассиву(СегментСсылка, НовыйМассивКлиентов) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		НачатьТранзакцию();	
		
		// Анализируем и получаем строки которые надо удалить.
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Сегмент"            , СегментСсылка);
		Запрос.УстановитьПараметр("НовыйСоставСегмента", НовыйМассивКлиентов);	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СоставСегментов.Сегмент КАК Сегмент,
		|	СоставСегментов.Контрагент КАК ОбъектСегмента
		|ИЗ
		|	РегистрСведений.КонтрагентыСегмента КАК СоставСегментов
		|ГДЕ
		|	СоставСегментов.Сегмент = &Сегмент
		|	И НЕ СоставСегментов.Контрагент В (&НовыйСоставСегмента)";
		
		ТаблицаСоставаДляУдаления = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаТЗ Из ТаблицаСоставаДляУдаления Цикл
			
			ЗаписьСоставаСегмента            = РегистрыСведений.КонтрагентыСегмента.СоздатьМенеджерЗаписи();
			ЗаписьСоставаСегмента.Сегмент    = СегментСсылка;
			ЗаписьСоставаСегмента.Контрагент = СтрокаТЗ.ОбъектСегмента;
			ЗаписьСоставаСегмента.Удалить();
			
		КонецЦикла;
		
		// Анализируем и получаем строки которые надо добавить.
		НовыйСоставСегмента = Новый ТаблицаЗначений;		
		НовыйСоставСегмента.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		
		Для Каждого СтрокаМ из НовыйМассивКлиентов Цикл
			НоваяСтрока				 = НовыйСоставСегмента.Добавить();
			НоваяСтрока.Контрагент	 = СтрокаМ;
		КонецЦикла;  		
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Сегмент"            , СегментСсылка);
		Запрос.УстановитьПараметр("НовыйСоставСегмента", НовыйСоставСегмента);
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	&Сегмент КАК Сегмент,
		|	АктуальныеОбъектыСегмента.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ АктуальныеОбъектыСегмента
		|ИЗ
		|	&НовыйСоставСегмента КАК АктуальныеОбъектыСегмента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АктуальныеОбъектыСегмента.Сегмент КАК Сегмент,
		|	АктуальныеОбъектыСегмента.Контрагент КАК Контрагент
		|ИЗ
		|	АктуальныеОбъектыСегмента КАК АктуальныеОбъектыСегмента
		|ГДЕ
		|	НЕ АктуальныеОбъектыСегмента.Контрагент В
		|				(ВЫБРАТЬ
		|					СоставСегментов.Контрагент
		|				ИЗ
		|					РегистрСведений.КонтрагентыСегмента КАК СоставСегментов
		|				ГДЕ
		|					СоставСегментов.Сегмент = &Сегмент)";
		
		ТаблицаСоставаДляДобавления = Запрос.Выполнить().Выгрузить();
		
		Если ТаблицаСоставаДляДобавления.Количество() > 0 Тогда
			
			НаборЗаписейСоставСегментов = РегистрыСведений.КонтрагентыСегмента.СоздатьНаборЗаписей();
			НаборЗаписейСоставСегментов.Отбор.Сегмент.Установить(СегментСсылка);
			НаборЗаписейСоставСегментов.Загрузить(ТаблицаСоставаДляДобавления);		
			НаборЗаписейСоставСегментов.Записать(Ложь);
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ОтменитьТранзакцию();		
	КонецПопытки;
	
КонецПроцедуры

// Удаляет из регистра сведений записи, относящиеся к сегменту
//
Процедура Очистить(СегментСсылка) Экспорт
	
	Если ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
		НаименованиеРегистра = "НоменклатураСегмента";
	ИначеЕсли ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыКонтрагентов") Тогда
		НаименованиеРегистра = "КонтрагентыСегмента";
	ИначеЕсли ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыСотрудников") Тогда
		НаименованиеРегистра = "СотрудникиСегмента";
	Иначе 
		Возврат;
	КонецЕсли;
	
	НаборСегмента = РегистрыСведений[НаименованиеРегистра].СоздатьНаборЗаписей();
	НаборСегмента.Отбор.Сегмент.Установить(СегментСсылка);
	НаборСегмента.Записать();
	
КонецПроцедуры

// Формирует табличный документ с элементами по правилам формирования сегмента
//
Процедура СкомпоноватьПоСегменту(СегментСсылка, ТабличныйДокумент, АдресРасшифровки = Неопределено, АдресСКД = Неопределено) Экспорт

	ТабличныйДокумент.Очистить();
	
	СхемаКомпоновкиДанных = ?(АдресСКД = Неопределено, Сегменты.ПолучитьСКД(СегментСсылка), ПолучитьИзВременногоХранилища(АдресСКД));
	
	Если Не СхемаКомпоновкиДанных.Параметры.Найти("СтруктурнаяЕдиница") = Неопределено Тогда 
			СхемаКомпоновкиДанных.Параметры.СтруктурнаяЕдиница.Значение = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
                                                                                    
	
	// Добавлено в связи с тем, что в регистре СтатусыКонтрагентов теперь отсутствует измерение СтруктурнаяЕдиница, а в макете некоторых старых сегментов обращение еще есть.
	Если Найти(СхемаКомпоновкиДанных.НаборыДанных[0].Запрос, "СтатусыКонтрагентов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница") <> 0 Тогда 
		СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = СтрЗаменить(СхемаКомпоновкиДанных.НаборыДанных[0].Запрос, "СтатусыКонтрагентов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "ЛОЖЬ");
	КонецЕсли;         
	
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;	
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
	ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	ПроцессорВывода.ЗакончитьВывод();
	
	АдресРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, Новый УникальныйИдентификатор);

КонецПроцедуры

// Возвращает схему компоновки данных сегмента с учетом способа формирования сегмента
//
Функция ПолучитьСКД(СегментСсылка) Экспорт
	
	СКД = СегментСсылка.СхемаКомпоновкиДанных.Получить();
	
	Если СКД = Неопределено Тогда
		
		Тип = ТипЗнч(СегментСсылка);
		Если ОбщегоНазначения.ЭтоСсылка(Тип) Тогда
			ПолноеИмя = Метаданные.НайтиПоТипу(Тип).ПолноеИмя();
			ИмяОбъекта = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолноеИмя, ".")[1];
			Попытка
				СКД = Справочники[ИмяОбъекта].ПолучитьМакет("ОсновнаяСхема");	
			Исключение
				// СКД = Справочники.СегментыНоменклатуры.ПолучитьМакет("ОсновнаяСхема");
			КонецПопытки;
		Иначе
			// СКД = Справочники.СегментыНоменклатуры.ПолучитьМакет("ОсновнаяСхема");
		КонецЕсли; 
		
	КонецЕсли;
	
	ОтключитьКолонку("Полное наименование", СКД);
	
	НаборСписка = СКД.НаборыДанных.Найти("СписокСегмента");
	
	// заменить запрос списка на обращение к регистру
	Если ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
		
		НаборСписка.Запрос = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоменклатураСегмента.Номенклатура КАК ЭлементСписка,
		|	НоменклатураСегмента.Сегмент
		|ИЗ
		|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента";
		
	ИначеЕсли ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыКонтрагентов") Тогда
		
		НаборСписка.Запрос =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтрагентСегмента.Контрагент КАК Контрагент,
		|	КонтрагентСегмента.Сегмент
		|ИЗ
		|	РегистрСведений.КонтрагентыСегмента КАК КонтрагентСегмента";
		
	ИначеЕсли ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыСотрудников") Тогда
		
		НаборСписка.Запрос =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СотрудникиСегмента.Сотрудник КАК ЭлементСписка,
		|	СотрудникиСегмента.Сегмент
		|ИЗ
		|	РегистрСведений.СотрудникиСегмента КАК СотрудникиСегмента";
		
		
	КонецЕсли;
	
	// удалить отбор, соответствующий старому запросу
	ЭлементыОтбора = СКД.НастройкиПоУмолчанию.Отбор.Элементы;
	ЭлементыОтбора.Очистить();
	
	// добавить отбор по сегменту
	ОбщегоНазначенияКлиентСерверСтоматология.ДобавитьОтбор(СКД.НастройкиПоУмолчанию, Новый ПолеКомпоновкиДанных("Сегмент"), СегментСсылка);
	
	// включить автозаполнение полей
	СКД.НаборыДанных.СписокСегмента.АвтоЗаполнениеДоступныхПолей = Истина;
	
	Возврат(СКД);
		
КонецФункции

// Сохраняет схему компоновки данных сегмента в новое хранилище значения
//
Функция СохранитьСКД(ДанныеФормыОбъект, СхемаКомпоновки) Экспорт
	
	ДанныеФормыОбъект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СхемаКомпоновки);
	ДанныеФормыОбъект.Записать();
	
	Возврат ДанныеФормыОбъект;
	
КонецФункции

// Возвращает таблицу значений, содержащую элементы, входящие в сегмент,
// с учетом способа формирования сегмента
//
Функция ТаблицаЗначенийСегмента(СегментСсылка) Экспорт
	         
	Возврат ВыборкаИзРегистра(СегментСсылка).Выгрузить();
	
КонецФункции

// Возвращает список значений, содержащий элементы, входящие в сегмент,
// с учетом способа формирования сегмента
//
Функция СписокЗначенийСегмента(СегментСсылка) Экспорт
	
	Список = Новый СписокЗначений();
	Список.ЗагрузитьЗначения(ТаблицаЗначенийСегмента(СегментСсылка).ВыгрузитьКолонку("ОбъектСегмента"));
	
	Возврат Список;
	
КонецФункции

// Возвращает массив элементов, входящих в сегмент,
// с учетом способа формирования сегмента
//
Функция МассивЭлементовСегмента(СегментСсылка) Экспорт
	
	Возврат ТаблицаЗначенийСегмента(СегментСсылка).ВыгрузитьКолонку("ОбъектСегмента");
	
КонецФункции

// Возвращает количество объектов, отнесенных к сегменту,
// с учетом способа формирования сегмента
//
Функция КоличествоЭлементовСегмента(СегментСсылка) Экспорт
	
	Выборка = ВыборкаИзРегистра(СегментСсылка);
	Если Выборка.Пустой() Тогда
		Возврат 0;
	Иначе
		Возврат Выборка.Выбрать().Количество();
	КонецЕсли;
	
КонецФункции

// Возвращает результат запроса, определяющего набор элементов сегмента,
// из регистров сведений (применяется для нединамических сегментов)
//
Функция ВыборкаИзРегистра(СегментСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СоставСегментов.Сегмент,
				   |	СоставСегментов.ОбъектСегмента
	               |ИЗ
	               |	РегистрСведений.СоставСегментов КАК СоставСегментов
	               |ГДЕ
	               |	СоставСегментов.Сегмент = &Сегмент";
	Запрос.УстановитьПараметр("Сегмент", СегментСсылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Возвращает таблицу значений, содержащую ссылки на элементы,
// входящие в сегмент, по настройкам СКД
//
Функция СписокЭлементовСКД(СегментСсылка, ОбъектСегмента = Неопределено, ТипОбъекта)
	
	Настройки = ПолучитьНастройкиСписка(СегментСсылка, ОбъектСегмента,, ТипОбъекта);
	Возврат ТаблицаСКД(Настройки.СКД, Настройки.Настройки, ТипОбъекта);
	
КонецФункции

// Возвращает таблицу значений, содержащую ссылки на элементы,
// входящие в сегмент, по настройкам СКД
//
Функция ПолучитьПризнакЗаполненностиНастроек(СегментСсылка, АдресСКД = Неопределено) Экспорт
	
	Результат = Ложь;
	
	Настройки = ПолучитьНастройкиСписка(СегментСсылка, , АдресСКД);
	Для Каждого НастройкаЭлемент Из Настройки.Настройки.Отбор.Элементы Цикл
		Если НастройкаЭлемент.Использование = Истина Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру, содержащую СКД сегмента и настройки варианта,
// содержащего список элементов. При этом подключаются поля запроса списка.
//
Функция ПолучитьНастройкиСписка(СегментСсылка, ОбъектСегмента = Неопределено, АдресСКД = Неопределено, ТипОбъекта = "")
	
	// СКД = СегментСсылка.СхемаКомпоновкиДанных.Получить();
	СКД = ?(АдресСКД = Неопределено, СегментСсылка.СхемаКомпоновкиДанных.Получить(), ПолучитьИзВременногоХранилища(АдресСКД));
	
	// подключить поля запроса списка
	Поля = СКД.НаборыДанных.СписокСегмента.Поля;
	Для Каждого Поле Из Поля Цикл
		Поле.ОграничениеИспользования.Поле = Ложь;
	КонецЦикла;// подключить поля запроса списка
	
	НастройкиСписка = СКД.ВариантыНастроек.Список.Настройки;
	Настройки = СКД.НастройкиПоУмолчанию;
	ОбщегоНазначенияКлиентСерверСтоматология.СкопироватьЭлементы(НастройкиСписка.ПараметрыДанных, Настройки.ПараметрыДанных);
	ОбщегоНазначенияКлиентСерверСтоматология.СкопироватьЭлементы(НастройкиСписка.Отбор, Настройки.Отбор);
	
	Если ЗначениеЗаполнено(ОбъектСегмента) Тогда 
		
		Если ТипЗнч(ОбъектСегмента) = Тип("Массив") Тогда
			
			ЭлементОтбора = НастройкиСписка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных(ТипОбъекта);
			ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение	= ОбъектСегмента;
			ЭлементОтбора.Использование		= Истина;
			
		Иначе
			
			ЭлементОтбора = НастройкиСписка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных(ТипОбъекта);
			ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение	= ОбъектСегмента;
			ЭлементОтбора.Использование		= Истина;

		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("СКД, Настройки", СКД, НастройкиСписка);
	
КонецФункции

// Формирует и возвращает таблицу значений по СКД и настройкам
// Параметры:
// СКД - схема компоновки данных,
// Настройки - вариант настроек схемы, по которым необходимо сформировать таблицу
//
Функция ТаблицаСКД(СКД, Настройки, ТипОбъекта)
	
	УстановитьПривилегированныйРежим(Истина);
	КомпоновщикМакета 			= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 			= КомпоновщикМакета.Выполнить(СКД,Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода				= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаЗначений 			= Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ТаблицаЗначений.Свернуть(ТипОбъекта);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТаблицаЗначений;
	
КонецФункции

// Процедура отключает колонку
//
Процедура ОтключитьКолонку(ИмяКолонки, СКД)
	
	Для Каждого Вариант Из СКД.ВариантыНастроек Цикл 
		Если Вариант.Имя = "Основной" Тогда 
			Для Каждого Колонка Из СКД.ВариантыНастроек.Основной.Настройки.Выбор.Элементы Цикл 
				Если Колонка.Заголовок = ИмяКолонки Тогда 
					Колонка.Использование = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

// Возвращает результат запроса, определяющего набор элементов сегмента,
// из регистров сведений (применяется для нединамических сегментов)
//
Функция ПроверитьВхождениеВСегмент(ОбъектСсылка, СегментСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сегмент", СегментСсылка);
	Запрос.УстановитьПараметр("Объект", ОбъектСсылка);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СоставСегментов.Сегмент,
				   |	СоставСегментов.ОбъектСегмента
	               |ИЗ
	               |	РегистрСведений.СоставСегментов КАК СоставСегментов
	               |ГДЕ
	               |	СоставСегментов.Сегмент = &Сегмент
				   |	И СоставСегментов.ОбъектСегмента = &Объект";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();			   
	
	Возврат РезультатЗапроса.Следующий();
	
КонецФункции

#Область ОбработчикиСобытий

// Выполняет формирование периодических сегментов
//
Процедура ВыполнитьПериодическоеФормирование(Сегмент = Неопределено, ОбъектСегмента = Неопределено) Экспорт
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() И НЕ ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ТипСегмента = Неопределено;
	
	Если ЗначениеЗаполнено(ОбъектСегмента) Тогда
		
		Если ТипЗнч(ОбъектСегмента) = Тип("Массив") Тогда
			ТипСегмента = ОбъектСегмента[0];
		Иначе
			ТипСегмента = ОбъектСегмента;
		КонецЕсли;
		
	КонецЕсли;
	
	// выбрать сегменты, формируемые периодически	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СегментыНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СегментыНоменклатуры КАК СегментыНоменклатуры
	|ГДЕ
	|	СегментыНоменклатуры.СпособФормирования = ЗНАЧЕНИЕ(Перечисление.СпособыФормированияСегментов.ПериодическиОбновлять)
	|	И ВЫБОР
	|			КОГДА &Сегмент <> НЕОПРЕДЕЛЕНО
	|				ТОГДА СегментыНоменклатуры.Ссылка = &Сегмент
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ТипСегмента <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ТИПЗНАЧЕНИЯ(&ТипСегмента) = ТИП(Справочник.Номенклатура)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СегментыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.СегментыКонтрагентов КАК СегментыКонтрагентов
	|ГДЕ
	|	СегментыКонтрагентов.СпособФормирования = ЗНАЧЕНИЕ(Перечисление.СпособыФормированияСегментов.ПериодическиОбновлять)
	|	И ВЫБОР
	|			КОГДА &Сегмент <> НЕОПРЕДЕЛЕНО
	|				ТОГДА СегментыКонтрагентов.Ссылка = &Сегмент
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ТипСегмента <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ТИПЗНАЧЕНИЯ(&ТипСегмента) = ТИП(Справочник.Контрагенты)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СегментыСотрудников.Ссылка
	|ИЗ
	|	Справочник.СегментыСотрудников КАК СегментыСотрудников
	|ГДЕ
	|	СегментыСотрудников.СпособФормирования = ЗНАЧЕНИЕ(Перечисление.СпособыФормированияСегментов.ПериодическиОбновлять)
	|	И ВЫБОР
	|			КОГДА &Сегмент <> НЕОПРЕДЕЛЕНО
	|				ТОГДА СегментыСотрудников.Ссылка = &Сегмент
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ТипСегмента <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ТИПЗНАЧЕНИЯ(&ТипСегмента) = ТИП(Справочник.Сотрудники)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ");
	
	Запрос.УстановитьПараметр("Сегмент"    , Сегмент);
	Запрос.УстановитьПараметр("ТипСегмента", ТипСегмента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сформировать(Выборка.Ссылка, ОбъектСегмента); // Сформировать выбранные сегменты
	КонецЦикла;

КонецПроцедуры

// Выполняет очистку нединамических сегментов по запланированым датам
//
Процедура ВыполнитьПлановуюОчистку() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	// выбрать сегменты, формируемые вручную с подходящей датой очистки
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СегментыНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СегментыНоменклатуры КАК СегментыНоменклатуры
	|ГДЕ
	|	СегментыНоменклатуры.СпособФормирования = ЗНАЧЕНИЕ(Перечисление.СпособыФормированияСегментов.ФормироватьВручную)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СегментыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.СегментыКонтрагентов КАК СегментыКонтрагентов
	|ГДЕ
	|	СегментыКонтрагентов.СпособФормирования = ЗНАЧЕНИЕ(Перечисление.СпособыФормированияСегментов.ФормироватьВручную)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СегментыСотрудников.Ссылка
	|ИЗ
	|	Справочник.СегментыСотрудников КАК СегментыСотрудников
	|ГДЕ
	|	СегментыСотрудников.СпособФормирования = ЗНАЧЕНИЕ(Перечисление.СпособыФормированияСегментов.ФормироватьВручную)");
	
	Выборка = Запрос.Выполнить().Выбрать();

	// очистить выбранные сегменты
	Пока Выборка.Следующий() Цикл
		Очистить(Выборка.Ссылка);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
                               
#КонецОбласти
