#Область ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
&НаКлиенте
Перем ВнесеноПередРедактированием;  // ВнесеноПередРедактированием
&НаКлиенте
Перем ТекДокументСписка;

&НаСервере
// Создание формы на сервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОтборДокумент", ОтборДокумент);	
	// ПодготовкаТаблицуЗадолженностей(ПриСтарте);	
	Если ТипЗнч(ОтборДокумент) = Тип("ДокументСсылка.ПланЛечения") Тогда
		Элементы.ТаблицаДокументовПродажиПартия.Видимость           = Ложь;
		Элементы.ТаблицаДокументовПродажиНоменклатура.Заголовок     = "Услуга";
		Элементы.ТаблицаДокументовПродажиНомерЗаказа.Заголовок      = "Номер приема";
	ИначеЕсли ТипЗнч(ОтборДокумент) = Тип("ДокументСсылка.НарядЗаказ") Тогда
		Элементы.ТаблицаДокументовПродажиНомерЗаказа.Заголовок  = "Номер заказа";
	ИначеЕсли ТипЗнч(ОтборДокумент) = Тип("ДокументСсылка.Прием") Тогда
		Элементы.ТаблицаДокументовПродажиНомерЗаказа.Видимость = Ложь;
	КонецЕсли;
	
	Параметры.Свойство("ОтборСотрудник", ЭтотОбъект.ОтборСотрудник);
	Параметры.Свойство("ОтборСтруктурнаяЕдиница", ЭтотОбъект.ОтборСтруктурнаяЕдиница);
	
	ЭтотОбъект.ОтборСотрудник = ?(ЗначениеЗаполнено(ЭтотОбъект.ОтборСотрудник), ЭтотОбъект.ОтборСотрудник, ПараметрыСеанса.ТекущийСотрудник);
	ЭтотОбъект.ОтборСтруктурнаяЕдиница = ?(ЗначениеЗаполнено(ЭтотОбъект.ОтборСтруктурнаяЕдиница)
										 , ЭтотОбъект.ОтборСтруктурнаяЕдиница
										 , ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
		
	ОбновитьФормуСервер(?(Параметры.Свойство("МассивУжеДобавленныхСтрок"), Параметры.МассивУжеДобавленныхСтрок, Новый Массив));
	
КонецПроцедуры

&НаСервере
// Реинициализация формы, сброс всех выбранных параметров
//
Процедура ОбновитьФормуСервер(МассивУжеДобавленныхСтрок = Неопределено)
		
	Если ТипЗнч(ОтборДокумент) = Тип("ДокументСсылка.ПланЛечения") Тогда	
		Запрос       = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
		              |	ПланЛеченияОстатки.ПланЛечения,
		              |	ПланЛеченияОстатки.НомерПриема КАК НомерЗаказаПриема,
		              |	ПланЛеченияОстатки.Зуб,
		              |	ПланЛеченияОстатки.Номенклатура,
		              |	СУММА(ПланЛеченияОстатки.Количество) КАК Количество,
		              |	СУММА(ПланЛеченияОстатки.Сумма) КАК Сумма,
		              |	ПланЛеченияОстатки.КлючСтроки,
		              |	ДокументПланЛечение.Цена,
		              |	ДокументПланЛечение.ПроцентСкидкиНаценки,
		              |	ДокументПланЛечение.СуммаАвтоматическойСкидкиНаценки
		              |ИЗ
		              |	(ВЫБРАТЬ
		              |		ПланыЛечения.ПланЛечения КАК ПланЛечения,
		              |		ПланыЛечения.НомерПриема КАК НомерПриема,
		              |		ПланыЛечения.Зуб КАК Зуб,
		              |		ПланыЛечения.Номенклатура КАК Номенклатура,
		              |		СУММА(ВЫБОР
		              |				КОГДА ПланыЛечения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		              |					ТОГДА ПланыЛечения.Количество
		              |				ИНАЧЕ -ПланыЛечения.Количество
		              |			КОНЕЦ) КАК Количество,
		              |		СУММА(ВЫБОР
		              |				КОГДА ПланыЛечения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		              |					ТОГДА ПланыЛечения.Сумма
		              |				ИНАЧЕ -ПланыЛечения.Сумма
		              |			КОНЕЦ) КАК Сумма,
		              |		ПланыЛечения.КлючСтроки КАК КлючСтроки
		              |	ИЗ
		              |		РегистрНакопления.ПланыЛечения КАК ПланыЛечения
		              |	ГДЕ
		              |		ПланыЛечения.ПланЛечения = &ОтборДокумент
		              |	
		              |	СГРУППИРОВАТЬ ПО
		              |		ПланыЛечения.КлючСтроки,
		              |		ПланыЛечения.Номенклатура,
		              |		ПланыЛечения.ПланЛечения,
		              |		ПланыЛечения.НомерПриема,
		              |		ПланыЛечения.Зуб) КАК ПланЛеченияОстатки
		              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		              |			ПланЛеченияЛечение.Ссылка КАК Ссылка,
		              |			ПланЛеченияЛечение.НомерПриема КАК НомерПриема,
		              |			ПланЛеченияЛечение.Зуб КАК Зуб,
		              |			ПланЛеченияЛечение.Номенклатура КАК Номенклатура,
		              |			ПланЛеченияЛечение.Цена КАК Цена,
		              |			ПланЛеченияЛечение.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
		              |			СУММА(ПланЛеченияЛечение.СуммаАвтоматическойСкидкиНаценки) КАК СуммаАвтоматическойСкидкиНаценки,
		              |			ПланЛеченияЛечение.КлючСтроки КАК КлючСтроки
		              |		ИЗ
		              |			Документ.ПланЛечения.Лечение КАК ПланЛеченияЛечение
		              |		ГДЕ
		              |			ПланЛеченияЛечение.Ссылка = &ОтборДокумент
		              |		
		              |		СГРУППИРОВАТЬ ПО
		              |			ПланЛеченияЛечение.Ссылка,
		              |			ПланЛеченияЛечение.Номенклатура,
		              |			ПланЛеченияЛечение.НомерПриема,
		              |			ПланЛеченияЛечение.Зуб,
		              |			ПланЛеченияЛечение.Цена,
		              |			ПланЛеченияЛечение.ПроцентСкидкиНаценки,
		              |			ПланЛеченияЛечение.КлючСтроки) КАК ДокументПланЛечение
		              |		ПО ПланЛеченияОстатки.КлючСтроки = ДокументПланЛечение.КлючСтроки
		              |ГДЕ
		              |	ПланЛеченияОстатки.Количество > 0
		              |	И НЕ ПланЛеченияОстатки.КлючСтроки В (&МассивУжеДобавленныхСтрок)
					  |	И ПланЛеченияОстатки.Номенклатура В (&УсловиеНоменклатураСотрудника)
		              |
		              |СГРУППИРОВАТЬ ПО
		              |	ПланЛеченияОстатки.ПланЛечения,
		              |	ПланЛеченияОстатки.НомерПриема,
		              |	ПланЛеченияОстатки.Зуб,
		              |	ПланЛеченияОстатки.Номенклатура,
		              |	ПланЛеченияОстатки.КлючСтроки,
		              |	ДокументПланЛечение.Цена,
		              |	ДокументПланЛечение.ПроцентСкидкиНаценки,
		              |	ДокументПланЛечение.СуммаАвтоматическойСкидкиНаценки";
		
#Область _______________________________________________________СтарыйМеханизм_______________________________________________________________		
		
		// Запрос.Текст =		
		// "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ПланыЛеченияОстатки.ПланЛечения,
		//|	ПланыЛеченияОстатки.Номенклатура,
		//|	ПланыЛеченияОстатки.Зуб,
		//|	СУММА(ПланыЛеченияОстатки.КоличествоОстаток) КАК Количество,
		//|	СУММА(ПланыЛеченияОстатки.СуммаОстаток) КАК Сумма,
		//|	ВложенныйЗапрос.Цена,
		//|	ВложенныйЗапрос.ПроцентСкидкиНаценки,
		//|	ВложенныйЗапрос.СуммаАвтоматическойСкидкиНаценки,
		//|	ПланыЛеченияОстатки.НомерПриема КАК НомерЗаказаПриема
		//|ИЗ
		//|	РегистрНакопления.ПланыЛечения.Остатки(&ОтборПериод, ПланЛечения = &ОтборДокумент) КАК ПланыЛеченияОстатки
		//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|			ПланЛеченияЛечение.Ссылка КАК Ссылка,
		//|			ПланЛеченияЛечение.Зуб КАК Зуб,
		//|			СУММА(ПланЛеченияЛечение.СуммаАвтоматическойСкидкиНаценки) КАК СуммаАвтоматическойСкидкиНаценки,
		//|			ПланЛеченияЛечение.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
		//|			ПланЛеченияЛечение.Номенклатура КАК Номенклатура,
		//|			ПланЛеченияЛечение.НомерПриема КАК НомерПриема,
		//|			ПланЛеченияЛечение.Цена КАК Цена
		//|		ИЗ
		//|			Документ.ПланЛечения.Лечение КАК ПланЛеченияЛечение
		//|		ГДЕ
		//|			ПланЛеченияЛечение.Ссылка = &ОтборДокумент
		//|		
		//|		СГРУППИРОВАТЬ ПО
		//|			ПланЛеченияЛечение.Ссылка,
		//|			ПланЛеченияЛечение.Зуб,
		//|			ПланЛеченияЛечение.ПроцентСкидкиНаценки,
		//|			ПланЛеченияЛечение.Номенклатура,
		//|			ПланЛеченияЛечение.НомерПриема,
		//|			ПланЛеченияЛечение.Цена) КАК ВложенныйЗапрос
		//|		ПО ПланыЛеченияОстатки.ПланЛечения = ВложенныйЗапрос.Ссылка
		//|			И ПланыЛеченияОстатки.Номенклатура = ВложенныйЗапрос.Номенклатура
		//|			И ПланыЛеченияОстатки.Зуб = ВложенныйЗапрос.Зуб
		//|			И ПланыЛеченияОстатки.НомерПриема = ВложенныйЗапрос.НомерПриема
		//|ГДЕ
		//|	ВложенныйЗапрос.Ссылка = &ОтборДокумент
		//|	И ПланыЛеченияОстатки.КоличествоОстаток > 0
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ПланыЛеченияОстатки.ПланЛечения,
		//|	ПланыЛеченияОстатки.Номенклатура,
		//|	ПланыЛеченияОстатки.Зуб,
		//|	ПланыЛеченияОстатки.НомерПриема,
		//|	ВложенныйЗапрос.Цена,
		//|	ВложенныйЗапрос.ПроцентСкидкиНаценки,
		//|	ВложенныйЗапрос.СуммаАвтоматическойСкидкиНаценки
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	НомерЗаказаПриема";
		
#КонецОбласти

	ИначеЕсли ТипЗнч(ОтборДокумент) = Тип("ДокументСсылка.НарядЗаказ") Тогда
		Запрос       = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	УслугиСотрудника.Номенклатура КАК Номенклатура
		               |ПОМЕСТИТЬ ВТУслугиСотрудника
		               |ИЗ
		               |	РегистрСведений.УслугиСотрудника КАК УслугиСотрудника
		               |ГДЕ
		               |	УслугиСотрудника.Сотрудник = &Сотрудник
		               |	И УслугиСотрудника.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Номенклатура
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	НарядЗаказОстатки.НарядЗаказ КАК НарядЗаказ,
		               |	НарядЗаказОстатки.НомерЗаказа КАК НомерЗаказаПриема,
		               |	НарядЗаказОстатки.НомерЗуба КАК Зуб,
		               |	НарядЗаказОстатки.Номенклатура КАК Номенклатура,
		               |	НарядЗаказОстатки.Количество КАК Количество,
		               |	ДокументНарядЗаказ.ЦенаПродажи КАК Цена,
		               |	ДокументНарядЗаказ.СуммаПродажи КАК Сумма,
		               |	ДокументНарядЗаказ.Партия КАК Партия,
		               |	НарядЗаказОстатки.КлючСтроки КАК КлючСтроки,
		               |	НарядЗаказОстатки.Номенклатура.КодУслуги КАК КодУслуги
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		НарядЗаказы.НарядЗаказ КАК НарядЗаказ,
		               |		НарядЗаказы.НомерЗаказа КАК НомерЗаказа,
		               |		НарядЗаказы.НомерЗуба КАК НомерЗуба,
		               |		НарядЗаказы.Номенклатура КАК Номенклатура,
		               |		СУММА(ВЫБОР
		               |				КОГДА НарядЗаказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |					ТОГДА НарядЗаказы.Количество
		               |				ИНАЧЕ -НарядЗаказы.Количество
		               |			КОНЕЦ) КАК Количество,
		               |		НарядЗаказы.КлючСтроки КАК КлючСтроки
		               |	ИЗ
		               |		РегистрНакопления.НарядЗаказы КАК НарядЗаказы
		               |	ГДЕ
		               |		НарядЗаказы.НарядЗаказ = &ОтборДокумент
		               |	
		               |	СГРУППИРОВАТЬ ПО
		               |		НарядЗаказы.КлючСтроки,
		               |		НарядЗаказы.Номенклатура,
		               |		НарядЗаказы.НарядЗаказ,
		               |		НарядЗаказы.НомерЗаказа,
		               |		НарядЗаказы.НомерЗуба) КАК НарядЗаказОстатки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			НарядЗаказЗапасы.Ссылка КАК Ссылка,
		               |			НарядЗаказЗапасы.Партия КАК Партия,
		               |			СУММА(НарядЗаказЗапасы.ЦенаПродажи) КАК ЦенаПродажи,
		               |			СУММА(НарядЗаказЗапасы.СуммаПродажи) КАК СуммаПродажи,
		               |			НарядЗаказЗапасы.КлючСтроки КАК КлючСтроки
		               |		ИЗ
		               |			Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
		               |		ГДЕ
		               |			НарядЗаказЗапасы.Ссылка = &ОтборДокумент
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			НарядЗаказЗапасы.КлючСтроки,
		               |			НарядЗаказЗапасы.Партия,
		               |			НарядЗаказЗапасы.Ссылка) КАК ДокументНарядЗаказ
		               |		ПО НарядЗаказОстатки.КлючСтроки = ДокументНарядЗаказ.КлючСтроки
		               |ГДЕ
		               |	НарядЗаказОстатки.Количество > 0
		               |	И НЕ НарядЗаказОстатки.КлючСтроки В (&МассивУжеДобавленныхСтрок)
		               |	И ВЫБОР
		               |			КОГДА НарядЗаказОстатки.Номенклатура.ЭтоУслуга
		               |				ТОГДА НарядЗаказОстатки.Номенклатура В
		               |						(ВЫБРАТЬ
		               |							Т.Номенклатура
		               |						ИЗ
		               |							ВТУслугиСотрудника КАК Т)
		               |			ИНАЧЕ ИСТИНА
		               |		КОНЕЦ";
		
#Область _______________________________________________________СтарыйМеханизм_______________________________________________________________		
		
		// Запрос.Текст = 
		// "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	НарядЗаказыОстатки.НарядЗаказ,
		//|	НарядЗаказыОстатки.Номенклатура,
		//|	НарядЗаказыОстатки.НомерЗуба КАК Зуб,
		//|	НарядЗаказЗапасы.ЦенаПродажи КАК Цена,
		//|	НарядЗаказыОстатки.НомерЗаказа КАК НомерЗаказаПриема,
		//|	НарядЗаказЗапасы.СуммаПродажи КАК Сумма,
		//|	СУММА(НарядЗаказыОстатки.КоличествоОстаток) КАК Количество,
		//|	НарядЗаказЗапасы.Партия
		//|ИЗ
		//|	РегистрНакопления.НарядЗаказы.Остатки(&ОтборПериод, НарядЗаказ = &ОтборДокумент) КАК НарядЗаказыОстатки
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
		//|		ПО НарядЗаказыОстатки.НарядЗаказ = НарядЗаказЗапасы.Ссылка
		//|			И НарядЗаказыОстатки.Номенклатура = НарядЗаказЗапасы.Номенклатура
		//|			И НарядЗаказыОстатки.НомерЗуба = НарядЗаказЗапасы.Зуб
		//|			И НарядЗаказыОстатки.НомерЗаказа = НарядЗаказЗапасы.НомерЗаказа
		//|ГДЕ
		//|	НарядЗаказЗапасы.Ссылка = &ОтборДокумент
		//|	И НарядЗаказыОстатки.КоличествоОстаток > 0
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	НарядЗаказыОстатки.НарядЗаказ,
		//|	НарядЗаказыОстатки.Номенклатура,
		//|	НарядЗаказыОстатки.НомерЗуба,
		//|	НарядЗаказЗапасы.ЦенаПродажи,
		//|	НарядЗаказыОстатки.НомерЗаказа,
		//|	НарядЗаказЗапасы.СуммаПродажи,
		//|	НарядЗаказЗапасы.Партия
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	НомерЗаказаПриема";
		
#КонецОбласти
		
	ИначеЕсли ТипЗнч(ОтборДокумент) = Тип("ДокументСсылка.Прием") Тогда
		Запрос       = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПриемЛечение.Ссылка,
		|	ПриемЛечение.Зуб,
		|	ПриемЛечение.Номенклатура,
		|	СУММА(ПриемЛечение.КоличествоУпаковок) КАК Количество,
		|	СУММА(ПриемЛечение.Сумма) КАК Сумма,
		|	ПриемЛечение.Цена,
		|	ПриемЛечение.ПроцентСкидкиНаценки,
		|	ПриемЛечение.СуммаАвтоматическойСкидкиНаценки,
		|	ПриемЛечение.КлючСтроки
		|ИЗ
		|	Документ.Прием.Лечение КАК ПриемЛечение
		|ГДЕ
		|	ПриемЛечение.Ссылка = &ОтборДокумент
		|	И (ПриемЛечение.ДокументАванса = ЗНАЧЕНИЕ(Документ.ПланЛечения.ПустаяСсылка)
		|			ИЛИ ПриемЛечение.ДокументАванса = ЗНАЧЕНИЕ(Документ.НарядЗаказ.ПустаяСсылка)
		|			ИЛИ ПриемЛечение.ДокументАванса = НЕОПРЕДЕЛЕНО)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриемЛечение.Ссылка,
		|	ПриемЛечение.Номенклатура,
		|	ПриемЛечение.Зуб,
		|	ПриемЛечение.Цена,
		|	ПриемЛечение.ПроцентСкидкиНаценки,
		|	ПриемЛечение.СуммаАвтоматическойСкидкиНаценки,
		|	ПриемЛечение.КлючСтроки";		
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ОтборПериод", ТекущаяДата());
	Запрос.УстановитьПараметр("ОтборДокумент", ОтборДокумент);
	Запрос.УстановитьПараметр("МассивУжеДобавленныхСтрок", ?(МассивУжеДобавленныхСтрок = Неопределено, Новый Массив, МассивУжеДобавленныхСтрок));
	
	УсловиеНоменклатураСотрудника = 
	"ВЫБРАТЬ
	|	УслугиСотрудника.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.УслугиСотрудника КАК УслугиСотрудника
	|ГДЕ
	|	УслугиСотрудника.Сотрудник = &Сотрудник
	|	И УслугиСотрудника.СтруктурнаяЕдиница = &СтруктурнаяЕдиница";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНоменклатураСотрудника", УсловиеНоменклатураСотрудника);
	
	Запрос.УстановитьПараметр("Сотрудник", ЭтотОбъект.ОтборСотрудник);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ЭтотОбъект.ОтборСтруктурнаяЕдиница);
	
	РезЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаУслугИТоваров.Очистить();
	Для Каждого СтрокаР ИЗ РезЗапроса Цикл
		НоваяСтрока = ТаблицаУслугИТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаР);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадолженностей

//////////////////////////////////////////////////////////////////////////////////////////////
//////////////////// ПРОЦЕДУРЫ И ФУНКЦИИ ОБСЛУЖИВАНИЯ ТАБЛИЦЫ ЗАДОЛЖЕННОСТЕЙ /////////////////

&НаКлиенте
// Обработчик команды печати справки
//
Процедура ДобавитьУслугиВПрием(Команда)

	МассивВозврата = новый Массив;
	Для Каждого СтрокаТ ИЗ ТаблицаУслугИТоваров Цикл
		Если СтрокаТ.ПризнакВыбора Тогда
			МассивВозврата.Добавить(Новый Структура("КлючСтроки, Номенклатура", СтрокаТ.КлючСтроки, СтрокаТ.Номенклатура));
		КонецЕсли;
	КонецЦикла;
	ЭтаФорма.Закрыть(МассивВозврата);
	
КонецПроцедуры  

&НаКлиенте
// При изменении выбора состояния галочки флажков
//
Процедура ТаблицаЗадолженностейСнятьГалочки(Команда)	
	
	Для Каждого СтрокаТабличнойЧасти Из ТаблицаУслугИТоваров Цикл
		Если Элементы.ТаблицаДокументовПродажи.ПроверитьСтроку(СтрокаТабличнойЧасти.ПолучитьИдентификатор()) Тогда
			СтрокаТабличнойЧасти.ПризнакВыбора = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	СуммаВыбранныхСтрок = 0;
	
КонецПроцедуры

&НаКлиенте
// При изменении выбора состояния галочки флажков
//
Процедура ТаблицаЗадолженностейУстановитьГалочки(Команда)
	
	СуммаВыбранныхСтрок = 0;
	Для Каждого СтрокаТабличнойЧасти Из ТаблицаУслугИТоваров Цикл
		Если Элементы.ТаблицаДокументовПродажи.ПроверитьСтроку(СтрокаТабличнойЧасти.ПолучитьИдентификатор()) Тогда
			СтрокаТабличнойЧасти.ПризнакВыбора = Истина;
			СуммаВыбранныхСтрок = СуммаВыбранныхСтрок + СтрокаТабличнойЧасти.Сумма;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
//
//
Процедура ПосчитатьСуммуВыбранныхСтрок()
	
	СуммаВыбранныхСтрок = 0;
	Для Каждого СтрокаТабличнойЧасти Из ТаблицаУслугИТоваров Цикл
		Если СтрокаТабличнойЧасти.ПризнакВыбора Тогда 
			СуммаВыбранныхСтрок = СуммаВыбранныхСтрок + СтрокаТабличнойЧасти.Сумма;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении"
//
Процедура ТаблицаДокументовПродажиПризнакВыбораПриИзменении(Элемент)

	ПосчитатьСуммуВыбранныхСтрок();	
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
// Обработчик вызова обновления таблицы задолженностей
//
Процедура ТаблицаЗадолженностейОбновить(Команда)		
	
	ОбновитьФормуСервер();
	
КонецПроцедуры

&НаКлиенте
// Отмена выбора
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

#КонецОбласти
