
#Область ОбработчикиСобытийЭлементовФормы

&НаСервере 
// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Кодировка") Тогда
		Кодировка = Параметры.Кодировка;
	Иначе
		Элементы.Кодировка.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ВерсияФормата") Тогда
		ВерсияФормата = Параметры.ВерсияФормата;
	Иначе
		Элементы.ВерсияФормата.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("Программа") Тогда
		Программа = Параметры.Программа;
	Иначе
		Элементы.Программа.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("СтатьяДДСИсходяший") Тогда
		СтатьяДДСИсходяший = Параметры.СтатьяДДСИсходяший;
	Иначе
		Элементы.СтатьяДДСИсходяший.Видимость = Ложь;
	КонецЕсли;

	Если Параметры.Свойство("СтатьяДДСВходящий") Тогда
		СтатьяДДСВходящий = Параметры.СтатьяДДСВходящий;
	Иначе
		Элементы.СтатьяДДСВходящий.Видимость = Ложь;
	КонецЕсли;

	Если Параметры.Свойство("ПроводитьЗагружаемые") Тогда
		ПроводитьЗагружаемые = Параметры.ПроводитьЗагружаемые;
	Иначе
		Элементы.ПроводитьЗагружаемые.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаполнятьДолгиАвтоматически") Тогда
		ЗаполнятьДолгиАвтоматически = Параметры.ЗаполнятьДолгиАвтоматически; 
		Элементы.ЗаполнятьДолгиАвтоматически.Видимость = Ложь;
	Иначе
		Элементы.ЗаполнятьДолгиАвтоматически.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ФайлВыгрузки") Тогда
		ФайлВыгрузки = Параметры.ФайлВыгрузки;
	Иначе
		Элементы.ФайлВыгрузки.Видимость = Ложь;
	КонецЕсли;

	Если Параметры.Свойство("ФайлЗагрузки") Тогда
		ФайлЗагрузки = Параметры.ФайлЗагрузки;
	Иначе
		Элементы.ФайлЗагрузки.Видимость = Ложь;
	КонецЕсли;
	
	ИдентификаторВладельца = Параметры.УникальныйИдентификатор;  
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();	
	
КонецПроцедуры // ПриСозданииНаСервере

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии" формы.
//
Процедура ПриОткрытии(Отказ)
	
	Если ОбщегоНазначенияКлиентПовтИспСтоматология.ЭтоВебКлиентБезПоддержкиРасширенияРаботыСФайлами() Тогда
		Элементы.ФайлЗагрузки.КнопкаВыбора = Ложь;
		Элементы.ФайлВыгрузки.КнопкаВыбора = Ложь;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
// Процедура, Обработчик события "ПередЗакрытием" формы.
//
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если (Кодировка = "Другая") И НЕ ЗначениеЗаполнено(КодировкаПроизвольная) Тогда
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Выберите кодировку'");
		Сообщение.Поле = "КодировкаПроизвольная";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, Файл загрузки начало выбора.
//
Процедура ФайлЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("ФайлЗагрузкиНачалоВыбораПродолжение", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
// Процедура - Файл загрузки начало выбора продолжение
//
// Параметры:
//  Подключено				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ФайлЗагрузкиНачалоВыбораПродолжение(Подключено, ДополнительныеПараметры) Экспорт
	
	Если НЕ Подключено Тогда
		ТекстСообщения = НСтр(
		"ru='Для данной операции необходимо
		|установить расширение работы с файлами!
		|Установка выполняется в разделе
		|""Администрирование""/
		|""Настройка""/""Персональные настройки""/""Общие"".'"
		);
		ПоказатьПредупреждение(Неопределено,ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = ФайлЗагрузки;
	Фильтр = "Текстовый файл(*.txt)|*.txt";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите файл'");
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ФайлЗагрузкиНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ДиалогОткрытияФайла", ДиалогОткрытияФайла)));

КонецПроцедуры

&НаКлиенте
// Процедура - Файл загрузки начало выбора завершение
//
// Параметры:
//  ВыбранныеФайлы			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ФайлЗагрузкиНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогОткрытияФайла = ДополнительныеПараметры.ДиалогОткрытияФайла;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		ФайлЗагрузки = ДиалогОткрытияФайла.ПолноеИмяФайла; 
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте 
// Процедура - обработка команды Ок.
//
Процедура Ок(Команда)
	
	ВозвращаемыеПараметры = Новый Структура(
		"Кодировка, Программа, СтатьяДДСВходящий, СтатьяДДСИсходяший, ПроводитьЗагружаемые, ЗаполнятьДолгиАвтоматически, ФайлВыгрузки, ФайлЗагрузки, ВерсияФормата",
		Кодировка, Программа, СтатьяДДСВходящий, СтатьяДДСИсходяший, ПроводитьЗагружаемые, ЗаполнятьДолгиАвтоматически, 
		ФайлВыгрузки, ФайлЗагрузки, ВерсияФормата);
	Оповестить("ИзменениеНастроек" + ИдентификаторВладельца, ВозвращаемыеПараметры);
	Закрыть();
	
КонецПроцедуры // Ок()

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
 

#КонецОбласти