#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, "При создании на сервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти      

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ШаблонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ВыборШаблона, ТекущаяСтрока, РежимВыбора", Истина, Объект.ШаблонФайла, Истина);
	ОткрытьФорму("Справочник.Файлы.Форма.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора"
//
Процедура ШаблонОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РасширениеФайла = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ВыбранноеЗначение, "ТекущаяВерсияРасширение");
	Если РасширениеФайла = "" Тогда
		РасширениеФайла = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ВыбранноеЗначение, "Расширение");
	КонецЕсли;
	ЕстьТерДляЗамены = НЕ (РасширениеФайла = "txt" ИЛИ РасширениеФайла = "html" ИЛИ РасширениеФайла = "htm");
	
	Счетчик = 0;
	Пока Счетчик <= Объект.ДанныеДляАвтозаполнения.Количество() - 1 И НЕ ЕстьТерДляЗамены цикл
		Если ЗначениеЗаполнено(Объект.ДанныеДляАвтозаполнения[Счетчик].ТермДляЗамены) Тогда
			Объект.ДанныеДляАвтозаполнения.Удалить(Счетчик);
			Счетчик = Счетчик - 1;
		КонецЕсли;
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ДанныеДляАвтозаполненияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ ЗначениеЗаполнено(Объект.ШаблонФайла) Тогда
		ТекстСообщения = "Поле ""Шаблон файла"" не заполнено" ;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = '" + ТекстСообщения + "'"),, "Объект.ШаблонФайла", ,Отказ);
	КонецЕсли;
	
	Если Отказ <> Истина Тогда
		ПараметрыОткрытияФормы = Новый Структура("ТипЗаменяемойСтроки, ЗаменяемоеЗначение, ТипЗначенияЗамены, ЗначениеЗамены, ФорматЗначенияЗамены, ТипРеквизитаЗамены, КэшСписокаПолей, ШаблонФайла, ТипЗаменыПустогоЗначения, ЗначениеЗаменыНезаполненного, КоличествоСимволовПрочерков");
		ПараметрыОткрытияФормы.КэшСписокаПолей = КэшСписокаПолей;
		ПараметрыОткрытияФормы.ШаблонФайла = Объект.ШаблонФайла;
		Если Копирование Тогда
			ЗаполнитьЗначенияСвойств(ПараметрыОткрытияФормы, Элементы.ДанныеДляАвтозаполнения.ТекущиеДанные);
		КонецЕсли;
		ОткрытьФорму("Справочник.ШаблоныДоговоров.Форма.ФормаНастройкиЗамены", ПараметрыОткрытияФормы,,,,,Новый ОписаниеОповещения("ФормаНастройкиЗаменыЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ФормаНастройкиЗаменыЗавершение"
//
Процедура ФормаНастройкиЗаменыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
		Если Результат <> Неопределено Тогда
			НоваяСтрока = Объект.ДанныеДляАвтозаполнения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат);
			Результат.Свойство("КэшСписокаПолей", КэшСписокаПолей);
			Модифицированность = Истина;
		КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды "ПроверитьПравило"
//
Процедура ПроверитьПравило(Команда)
	
	#Если ВебКлиент Тогда
		
		Сообщение = "При использовании web-клиента нельзя осуществлять проверку правил.";		
		ОбщегоНазначения.СообщитьПользователю(Сообщение);
		Возврат;
		
	#Иначе

		ОткрытьФорму("Документ.Договоры.ФормаВыбора",,,,,,Новый ОписаниеОповещения("ПроверитьПравилоЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
		
	#КонецЕсли
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПроверитьПравилоЗавершение"
//
Процедура ПроверитьПравилоЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			Возврат;
		КонецЕсли;
		
		Состояние(НСтр("ru = 'Выполняется заполнение шаблона файла. Пожалуйста, подождите...'"));
		
		РезультатЗаполненияФайла = АвтозаполнениеШаблоновФайловКлиент.ВыполнитьАвтоЗаполнениеШаблона(Результат, Объект);
		
		Если РезультатЗаполненияФайла.Результат = Истина Тогда
			ПутьКФайлу = ПолучитьИмяВременногоФайла(РезультатЗаполненияФайла.РасширениеФайла);
			РезультатЗаполненияФайла.ДвоичныеДанныеЗаполненногоФайла.Записать(ПутьКФайлу);
			ЗапуститьПриложение(ПутьКФайлу);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатЗаполненияФайла.ОписаниеОшибки);
		КонецЕсли;
		
		Состояние(); 
	#КонецЕсли 
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ДобавитьВсеПоля"
//
Процедура ДобавитьВсеПоля(Команда)
		
	ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьВсеПоляЗавершение", ЭтотОбъект), 
	"Очистить таблицу правил перед добавлением?", РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить все поля завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ДобавитьВсеПоляЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.ДанныеДляАвтозаполнения.Очистить();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	МассивПолей = ВернутьСписокПолейВФайле(Ложь);
	Для Каждого ЭлементМассива Из МассивПолей Цикл
		НоваяСтрока = Объект.ДанныеДляАвтозаполнения.Добавить();
		НоваяСтрока.ТипЗаменяемойСтроки = Истина;
		НоваяСтрока.ЗаменяемоеЗначение = ЭлементМассива;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
 // Функция получает и возвращает список полей в файле.
//
Функция ВернутьСписокПолейВФайле(ИзКэша = Истина)
	
	СписокПолей = Новый Массив;
	
	Если Объект.ШаблонФайла.Пустая() Тогда
		Возврат СписокПолей;
	КонецЕсли;	
	
	РасширениеФайла = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.ШаблонФайла, "ТекущаяВерсияРасширение");
	ДвоичныеДанныеФайла = АвтозаполнениеШаблоновФайловСервер.ПолучитьДвоичныеДанныеФайла(Объект.ШаблонФайла);
	
	Если ИзКэша = Истина И КэшСписокаПолей.Количество() > 0 Тогда
		
		СписокПолей = КэшСписокаПолей.ВыгрузитьЗначения();
	
	ИначеЕсли РасширениеФайла = "odt" Тогда
		
		СписокПолей = АвтозаполнениеШаблоновФайловКлиент.НайтиВсеПоляВФайлеOpenOfficeWriter(РасширениеФайла, ДвоичныеДанныеФайла);
		
		КэшСписокаПолей.Очистить();
		КэшСписокаПолей.ЗагрузитьЗначения(СписокПолей);
		
	ИначеЕсли РасширениеФайла = "doc" ИЛИ РасширениеФайла = "dot" ИЛИ РасширениеФайла = "docx" ИЛИ РасширениеФайла = "dotx" Тогда
		
		СписокПолей = АвтозаполнениеШаблоновФайловКлиент.НайтиВсеПоляВФайлеMSWord(РасширениеФайла, ДвоичныеДанныеФайла);
		
		КэшСписокаПолей.Очистить();
		КэшСписокаПолей.ЗагрузитьЗначения(СписокПолей);
		
	КонецЕсли;
	
	Возврат СписокПолей;
	
КонецФункции

&НаКлиенте
Процедура ДанныеДляАвтозаполненияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ПараметрыОткрытияФормы = Новый Структура("ТипЗаменяемойСтроки, ЗаменяемоеЗначение, ТипЗначенияЗамены, ЗначениеЗамены, ФорматЗначенияЗамены, ТипРеквизитаЗамены, КэшСписокаПолей, ШаблонФайла, ТипЗаменыПустогоЗначения, ЗначениеЗаменыНезаполненного, КоличествоСимволовПрочерков");
	ПараметрыОткрытияФормы.КэшСписокаПолей = КэшСписокаПолей;
	ПараметрыОткрытияФормы.ШаблонФайла = Объект.ШаблонФайла;
	ЗаполнитьЗначенияСвойств(ПараметрыОткрытияФормы, Элементы.ДанныеДляАвтозаполнения.ТекущиеДанные);
	ОткрытьФорму("Справочник.ШаблоныДоговоров.Форма.ФормаНастройкиЗамены", ПараметрыОткрытияФормы,,,,,Новый ОписаниеОповещения("ДанныеДляАвтозаполненияВыборЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ДанныеДляАвтозаполненияВыборЗавершение"
//
Процедура ДанныеДляАвтозаполненияВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Элементы.ДанныеДляАвтозаполнения.ТекущиеДанные, Результат);
		Результат.Свойство("КэшСписокаПолей", КэшСписокаПолей);
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляАвтозаполненияОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	НоваяСтрока = Объект.ДанныеДляАвтозаполнения.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, НовыйОбъект);
	НовыйОбъект.Свойство("КэшСписокаПолей", КэшСписокаПолей);
	
	Модифицированность = Истина;
		
КонецПроцедуры

#КонецОбласти
