#Область СлужебныеПроцедурыИФункции

// Процедура, добавляет запись в регистр.
//
Процедура ДобавитьЗапись(Пользователь, Дата = Неопределено) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	
	Запись = НаборЗаписей.Добавить();
	Запись.Пользователь 	= Пользователь;
	Запись.Дата				= ?(Дата = Неопределено, ТекущаяДатаСеанса(), Дата);
	Запись.АватарСотрудника = ОбработатьАватар(ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Пользователь, "ФайлКартинки"));
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Процедура, обновляет аватар сотрудника.
//
Процедура ОбновитьАватарСотрудника(Сотрудник, ФайлКартинки = Неопределено) Экспорт
	
	Если ФайлКартинки = Неопределено Тогда
		ФайлКартинки = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Сотрудник, "ФайлКартинки");
	КонецЕсли;
	
	НовыйАватарСотрудника = ?(ЗначениеЗаполнено(ФайлКартинки), ОбработатьАватар(ФайлКартинки), "");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АктивныеПользователиМессенджер.Дата КАК Дата
	|ИЗ
	|	РегистрСведений.АктивныеПользователиМессенджер КАК АктивныеПользователиМессенджер
	|ГДЕ
	|	АктивныеПользователиМессенджер.Пользователь = &Пользователь");
	
	Запрос.УстановитьПараметр("Пользователь", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Сотрудник);
	
	НоваяЗапись					 = НаборЗаписей.Добавить();
	НоваяЗапись.Пользователь	 = Сотрудник;
	НоваяЗапись.АватарСотрудника = НовыйАватарСотрудника;
	
	Если Выборка.Следующий() Тогда
		НоваяЗапись.Дата = Выборка.Дата;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Функция, возвращает пустой аватар.
//
Функция ПолучитьАватарПоУмолчанию() Экспорт
	
	Возврат СтрЗаменить("data:image/png;base64," + Base64Строка(БиблиотекаКартинок.ФотоПоУмолчанию.ПолучитьДвоичныеДанные()), Символы.ВК + Символы.ПС, "");
	
КонецФункции

// Функция, возвращает обработанную картинку в формате base64(data: URL).
//
Функция ОбработатьАватар(ФайлКартинки)
	
	Если Не ЗначениеЗаполнено(ФайлКартинки) Тогда
		Возврат "";
	КонецЕсли;
	
	Попытка
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			Картинка = Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(ФайлКартинки), Истина);
		#Иначе 
			Возврат "";
		#КонецЕсли

		ОбрабатываемаяКартинка = Новый ОбрабатываемаяКартинка(Картинка);
		
		Высота = Картинка.Высота();
		Ширина = Картинка.Ширина();
		
		Если Высота <> Ширина Тогда
			
			Если Высота > Ширина Тогда
				
				Разница = Высота - Ширина;
				ОбрабатываемаяКартинка.ВыделитьОбласть(0, Цел(Разница / 2), Ширина, Ширина);
				
			Иначе
				
				Разница = Ширина - Высота;
				ОбрабатываемаяКартинка.ВыделитьОбласть(Цел(Разница / 2), 0, Высота, Высота);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ОбрабатываемаяКартинка.УстановитьРазмер(100, 100);
		ОбрабатываемаяКартинка.УстановитьФормат(ФорматКартинки.JPEG);
		
		ОбработаннаяКартинка = ОбрабатываемаяКартинка.ПолучитьКартинку();
		
		Возврат СтрЗаменить(СтрЗаменить("data:image/jpeg;base64," + Base64Строка(ОбработаннаяКартинка.ПолучитьДвоичныеДанные()), Символы.ПС, ""), Символы.ВК, "");
		
	Исключение
		Возврат "";
		
	КонецПопытки;
	
КонецФункции

// Функция, возвращает значение картинки аватара сотрудника.
//
Функция ПолучитьАватарСотрудника(Сотрудник) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	АктивныеПользователиМессенджер.АватарСотрудника КАК АватарСотрудника
	|ИЗ
	|	РегистрСведений.АктивныеПользователиМессенджер КАК АктивныеПользователиМессенджер
	|ГДЕ
	|	АктивныеПользователиМессенджер.Пользователь = &Пользователь");
	
	Запрос.УстановитьПараметр("Пользователь", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.АватарСотрудника, Неопределено);
	
КонецФункции

#КонецОбласти  

