&НаСервере
Перем мДерево; // Переменная содержит дерево значений.
Перем мУжеВСписке; // Переменная содержит признак в списке.

&НаСервере
Перем мКэшРеквизитовДокумента; // Переменная содержит реквизиты документа.

#Область ОбработчикиСобытийФормы

&НаСервере                                                                                       
// Процедура - обработчик события ПриСозданииНаСервере формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ДокументСсылка = Неопределено ИЛИ Параметры.ДокументСсылка.Пустая() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ДокументСсылка = Параметры.ДокументСсылка; 
	
	ВывестиДеревоДокументов();

КонецПроцедуры

&НаКлиенте                                                                                       
// Процедура - обработчик события ПриОткрытии формы.
//
Процедура ПриОткрытии(Отказ)
	 
	Элементы.ДеревоДокументов.ТекущаяСтрока = ДеревоДокументов.ПолучитьЭлементы()[0];

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоДокументов

&НаКлиенте
// Процедура - обработчик события Перед началом изменения табличного поля ДеревоДокументов.
//
Процедура ДеревоДокументовПередНачаломИзменения(Элемент, Отказ)	
	ОткрытьФормуДокумента();
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте                                                                                        
// Процедура - обработчик события ПриАктивизацииСтроки реквизита ДеревоДокументов.
//
Процедура ДеревоДокументовПриАктивизацииСтроки(Элемент)
	ОбновитьДоступностьКнопок();	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик действия Выбор дерева документов.
//
Процедура ДеревоДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.ДеревоДокументов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте                                                                                        
// Процедура - обработчик действия Открыть.
//
Процедура ОткрытьДокумент(Команда)
	
	Если Элементы.ДеревоДокументов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуДокумента();	 
	
КонецПроцедуры

&НаКлиенте                                                                                        
// Процедура - обработчик действия Обновить.
//
Процедура Обновить(Команда)
	
	Если ОсновнойДокументЕщеДоступен() Тогда
		ВывестиДеревоДокументов(); 
		ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы.ДеревоДокументов, ДеревоДокументов, Истина);
	Иначе
		ЗакрытьФормуСПредупреждением(НСтр("ru = 'Документ, для которого сформирован отчет о структуре
									 |подчиненности был удален, или же стал недоступен.'"));
	КонецЕсли;		
	
	
КонецПроцедуры

&НаКлиенте                                                                                        
// Процедура - обработчик действия ВывестиДляТекущего.
//
Процедура ВывестиДляТекущего(Команда)	
	
	Если Элементы.ДеревоДокументов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументСсылка = Элементы.ДеревоДокументов.ТекущиеДанные.Ссылка;
	Если ОсновнойДокументЕщеДоступен() Тогда
		ДеревоДокументов.ПолучитьЭлементы().Очистить();	
		ВывестиДеревоДокументов();
		ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы.ДеревоДокументов, ДеревоДокументов, Истина);
	Иначе
		ЗакрытьФормуСПредупреждением(НСтр("ru = 'Документ, для которого сформирован отчет о структуре
									 |подчиненности был удален, или же стал недоступен.'"));
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте                                                                                        
// Процедура - обработчик действия НайтиВСписке.
//
Процедура НайтиВСписке(Команда)	
	
	Если Элементы.ДеревоДокументов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяОбъекта = ПолучитьИмяОбъекта(Элементы.ДеревоДокументов.ТекущиеДанные.Ссылка);		
	ОткрытьФорму(Имяобъекта + "." + Элементы.ДеревоДокументов.ТекущиеДанные.ВидДокумента + ".ФормаСписка", Новый Структура("ТекущаяСтрока", Элементы.ДеревоДокументов.ТекущиеДанные.Ссылка));

КонецПроцедуры

&НаКлиенте                                                                                        
// Процедура - обработчик действия Провести.
//
Процедура Провести(Кнопка)
		
	Если Элементы.ДеревоДокументов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка       
		Элементы.ДеревоДокументов.ТекущиеДанные.Проведен = ПровестиСервер(Элементы.ДеревоДокументов.ТекущиеДанные.Ссылка);
		Элементы.ДеревоДокументов.ТекущиеДанные.Картинка = НомерКартинки(Элементы.ДеревоДокументов.ТекущиеДанные);
	Исключение
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Не удалось провести документ %Документ%!'");;
		Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%Документ%", Элементы.ДеревоДокументов.ТекущиеДанные.ДокументПредставление);
		Сообщение.Сообщить();
		
	КонецПопытки;
		 
	ОповеститьОбИзменении(Элементы.ДеревоДокументов.ТекущиеДанные.Ссылка);	
	РодительДанные = ДеревоДокументов.НайтиПоИдентификатору(Элементы.ДеревоДокументов.ТекущаяСтрока).Получитьродителя();
	Если РодительДанные <> Неопределено Тогда
		ОповеститьОбИзменении(РодительДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте                                                                                        
// Процедура - обработчик действия Отмена проведения.
//
Процедура ОтменаПроведения(Кнопка)
		
	Если Элементы.ДеревоДокументов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Элементы.ДеревоДокументов.ТекущиеДанные.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Элементы.ДеревоДокументов.ТекущиеДанные.Проведен = ОтменаПроведенияСервер(Элементы.ДеревоДокументов.ТекущиеДанные.Ссылка);
		Элементы.ДеревоДокументов.ТекущиеДанные.Картинка = НомерКартинки(Элементы.ДеревоДокументов.ТекущиеДанные);
	Исключение
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Не удалось сделать непроведенным документ %Документ%!'");;
		Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%Документ%", Элементы.ДеревоДокументов.ТекущиеДанные.ДокументПредставление);
		Сообщение.Сообщить();
		
	КонецПопытки;
	
	ОповеститьОбИзменении(Элементы.ДеревоДокументов.ТекущиеДанные.Ссылка);	
	РодительДанные = ДеревоДокументов.НайтиПоИдентификатору(Элементы.ДеревоДокументов.ТекущаяСтрока).Получитьродителя();
	Если РодительДанные <> Неопределено Тогда
		ОповеститьОбИзменении(РодительДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте                                                                                         
// Процедура - обработчик действия УстановитьПометкуУдаления.
//
Процедура УстановитьПометкуУдаления(Кнопка)	
	
	Если Элементы.ДеревоДокументов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПометкаУдаления = УстановитьПометкуУдаленияСервер(Элементы.ДеревоДокументов.ТекущиеДанные.Ссылка);
		Элементы.ДеревоДокументов.ТекущиеДанные.ПометкаУдаления = ПометкаУдаления;
		Элементы.ДеревоДокументов.ТекущиеДанные.Проведен = Ложь;
		Элементы.ДеревоДокументов.ТекущиеДанные.Картинка = НомерКартинки(Элементы.ДеревоДокументов.ТекущиеДанные);
		ОбновитьДоступностьКнопок();
	Исключение
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Не удалось установить пометку удаления на документ %Документ%!'");;
		Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%Документ%", Элементы.ДеревоДокументов.ТекущиеДанные.ДокументПредставление);
		Сообщение.Сообщить();
		
	КонецПопытки;
		
	ОповеститьОбИзменении(Элементы.ДеревоДокументов.ТекущиеДанные.Ссылка);	
	РодительДанные = ДеревоДокументов.НайтиПоИдентификатору(Элементы.ДеревоДокументов.ТекущаяСтрока).Получитьродителя();
	Если РодительДанные <> Неопределено Тогда
		ОповеститьОбИзменении(РодительДанные.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДокумента(Команда)

	ТекущиеДанные = Элементы.ДеревоДокументов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
	   ОткрытьФорму("Отчет.ДвиженияДокумента.Форма", Новый Структура("Документ", Элементы.ДеревоДокументов.ТекущиеДанные.Ссылка), , Истина);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура вывода дерева структуры подчиненности документа.
//
Процедура ВывестиДеревоДокументов()
	
	Попытка
		
		мДерево = ДеревоДокументов;	
		мУжеВСписке = Новый Соответствие;
		мКэшРеквизитовДокумента = Новый Соответствие;
		
		ДеревоДокументов.ПолучитьЭлементы().Очистить();
		
		ВывестиРодительскиеДокументы(ДокументСсылка);	
		ВывестиПодчиненныеДокументы(мДерево);
		
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
// Процедура выполняет вывод родительских документов.
//
Процедура ВывестиРодительскиеДокументы(ДокументСсылка)
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	СписокРеквизитов = Новый СписокЗначений;
	
	Для Каждого Реквизит ИЗ МетаданныеДокумента.Реквизиты Цикл
		ТипыРеквизита = Реквизит.Тип.Типы();
		Для Каждого ТекущийТип ИЗ ТипыРеквизита Цикл
			МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
			
			//Если МетаданныеРеквизита<>Неопределено И (Метаданные.Документы.Содержит(МетаданныеРеквизита) 
			//	 Или Метаданные.Справочники.Содержит(МетаданныеРеквизита) И Метаданные.КритерииОтбора.СтруктураПодчиненности.Тип.СодержитТип(ТекущийТип))
			Если МетаданныеРеквизита<>Неопределено И Метаданные.Документы.Содержит(МетаданныеРеквизита)
			И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
				Попытка
					ЗначениеРеквизита = ДокументСсылка[Реквизит.Имя];
				Исключение
					Прервать;
				КонецПопытки;
				ЕСли ЗначениеРеквизита<>Неопределено И НЕ ЗначениеРеквизита.Пустая() И ТипЗнч(ЗначениеРеквизита) = ТекущийТип 
					 И мУжеВСписке[ЗначениеРеквизита] = Неопределено И СписокРеквизитов.НайтиПоЗначению(ДокументСсылка[Реквизит.Имя]) = Неопределено Тогда
					Попытка
						СписокРеквизитов.Добавить(ЗначениеРеквизита,?(Не ОбщегоНазначения.ЭтоСправочник(МетаданныеРеквизита), Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"), ЗначениеРеквизита));
					Исключение
						 ОтладкаТекстОшибки = ОписаниеОшибки();
					КонецПопытки;	
				КонецЕсли;
			КонецЕсли;			
			
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого ТЧ Из МетаданныеДокумента.ТабличныеЧасти Цикл
		СтрРеквизитов = "";
		
		Попытка
			СодержимоеТЧ = ДокументСсылка[ТЧ.Имя].Выгрузить();
		Исключение
			Прервать;
		КонецПопытки;
		
		Для Каждого Реквизит ИЗ ТЧ.Реквизиты Цикл
			ТипыРеквизита = Реквизит.Тип.Типы();
			Для Каждого ТекущийТип ИЗ ТипыРеквизита Цикл
				МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);				
				Если МетаданныеРеквизита<>Неопределено И Метаданные.Документы.Содержит(МетаданныеРеквизита)
					И МетаданныеДокумента.ВводитсяНаОсновании.Содержит(МетаданныеРеквизита)
					И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
					СтрРеквизитов = СтрРеквизитов + ?(СтрРеквизитов = "", "", ", ") + Реквизит.Имя;
					Прервать;
				КонецЕсли;						
			КонецЦикла;
		КонецЦикла;
		
		СодержимоеТЧ.Свернуть(СтрРеквизитов);
		Для Каждого КолонкаТЧ ИЗ СодержимоеТЧ.Колонки Цикл
			Для Каждого СтрокаТЧ ИЗ СодержимоеТЧ Цикл
				Попытка
					ЗначениеРеквизита = СтрокаТЧ[КолонкаТЧ.Имя];
				Исключение
					Продолжить;
				КонецПопытки;
				МетаданныеЗначения = Метаданные.НайтиПоТипу(ТипЗнч(ЗначениеРеквизита));
				Если МетаданныеЗначения = Неопределено 
						ИЛИ МетаданныеДокумента.ВводитсяНаОсновании.Содержит(МетаданныеЗначения) = Ложь Тогда
					// базовый тип
					Продолжить;
				КонецЕсли;
				
				ЕСли ЗначениеРеквизита<>Неопределено И НЕ ЗначениеРеквизита.Пустая()
					 И Метаданные.Документы.Содержит(МетаданныеЗначения)
					 И мУжеВСписке[ЗначениеРеквизита] = Неопределено Тогда
					Если СписокРеквизитов.НайтиПоЗначению(ЗначениеРеквизита) = Неопределено Тогда
						Попытка
							СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"));
						Исключение
							ОтладкаТекстОшибки = ОписаниеОшибки();
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;		
	КонецЦикла;
	СписокРеквизитов.СортироватьПоПредставлению();
	мУжеВСписке.Вставить(ДокументСсылка, Истина);
	
	Если СписокРеквизитов.Количество() = 1 Тогда
		ВывестиРодительскиеДокументы(СписокРеквизитов[0].Значение);
	ИначеЕсли СписокРеквизитов.Количество() > 1 Тогда
		ВывестиБезРодителей(СписокРеквизитов);		
	КонецЕсли;

	ИмяОбъекта = ПолучитьИмяОбъекта(ДокументСсылка);	
	
	СтрокаДерева = мДерево.ПолучитьЭлементы().Добавить();
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка, " + ?(ИмяОбъекта = "Документ", "Проведен", "Ложь Как Проведен") + ", ПометкаУдаления, Представление, #Сумма, """ + МетаданныеДокумента.Имя + """ КАК Метаданные
		| ИЗ " + ИмяОбъекта  + "." + МетаданныеДокумента.Имя + " ГДЕ Ссылка = &Ссылка");
	
 	Если МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "СуммаДокумента КАК СуммаДокумента");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "0 КАК СуммаДокумента");
	КонецЕсли;
						   
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Выборка  = Запрос.Выполнить().Выбрать();
	ЕСли Выборка.Следующий() Тогда		
		СтрокаДерева.Ссылка= Выборка.Ссылка;
		СтрокаДерева.ДокументПредставление = Выборка.Представление;
		СтрокаДерева.ВидДокумента = Выборка.Метаданные;
		СтрокаДерева.СуммаДокумента = Выборка.СуммаДокумента;
		СтрокаДерева.Проведен = Выборка.Проведен;
		СтрокаДерева.ПометкаУдаления = Выборка.ПометкаУдаления;
		СтрокаДерева.Картинка = НомерКартинки(СтрокаДерева);
		СтрокаДерева.ПроведениеРазрешено = ?(Не ОбщегоНазначения.ЭтоСправочник(Выборка.Ссылка.Метаданные()),
			Выборка.Ссылка.Метаданные().Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить, Ложь);
	Иначе
		СтрокаДерева.Ссылка= ДокументСсылка;
		СтрокаДерева.ДокументПредставление = Строка(ДокументСсылка);
		СтрокаДерева.СуммаДокумента = Выборка.СуммаДокумента;
		СтрокаДерева.Проведен = Выборка.Проведен;
		СтрокаДерева.ПометкаУдаления = Выборка.ПометкаУдаления;
		СтрокаДерева.Картинка = НомерКартинки(СтрокаДерева);
		СтрокаДерева.ПроведениеРазрешено = ДокументСсылка.Метаданные().Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить;
	КонецЕсли;
	
	мДерево = СтрокаДерева;
		
КонецПроцедуры

&НаСервере
// Процедура осуществляет вывод родительских документов с ограничением по уровню в дереве.
//
Процедура ВывестиБезРодителей(СписокДокументов)
	
	Для Каждого ЭлементСписка Из СписокДокументов Цикл
		
		МетаданныеДокумента = ЭлементСписка.Значение.Метаданные();
		ИмяОбъекта = ПолучитьИмяОбъекта(ЭлементСписка.Значение.Ссылка);	
			
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка, " + ?(ИмяОбъекта = "Документ", "Проведен", "Ложь Как Проведен") + ", ПометкаУдаления, Представление, #Сумма, """ + МетаданныеДокумента.Имя + """ КАК Метаданные
		| ИЗ " + ИмяОбъекта  + "." + МетаданныеДокумента.Имя + " ГДЕ Ссылка = &Ссылка");
		
		Если МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "СуммаДокумента КАК СуммаДокумента");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "0 КАК СуммаДокумента");
		КонецЕсли;
						   
	Запрос.УстановитьПараметр("Ссылка", ЭлементСписка.Значение);
		
		Выборка  = Запрос.Выполнить().Выбрать();
		ЕСли Выборка.Следующий() Тогда		
			Если мУжеВСписке[Выборка.Ссылка] = Неопределено Тогда
	            СтрокаДерева = мДерево.ПолучитьЭлементы().Добавить();
				СтрокаДерева.Ссылка= Выборка.Ссылка;
				СтрокаДерева.СуммаДокумента= Выборка.СуммаДокумента;
				СтрокаДерева.ДокументПредставление = Выборка.Представление;
				СтрокаДерева.ВидДокумента = Выборка.Метаданные;
				СтрокаДерева.Проведен = Выборка.Проведен;
				СтрокаДерева.ПометкаУдаления = Выборка.ПометкаУдаления;			
				СтрокаДерева.ОграничениеПоРодителям = Истина;
				СтрокаДерева.Картинка = НомерКартинки(СтрокаДерева);
				мУжеВСписке.Вставить(Выборка.Ссылка, Истина);
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;

	мДерево = СтрокаДерева;
	
КонецПроцедуры

&НаСервере
// Процедура осуществляет вывод подчиненных документов.
//
Процедура ВывестиПодчиненныеДокументы(СтрокаДерева)
	
	ТекущийДокумент = СтрокаДерева.Ссылка;	
	КэшПоТипамДокументов = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ТекущийДокумент);
	Для Каждого ЭлементСостава ИЗ Метаданные.КритерииОтбора.СвязанныеДокументы.Состав Цикл
		
		ПутьКДанным = ЭлементСостава.ПолноеИмя();
		СтруктураПутьКДанным = РазобратьПутьКОбъектуМетаданных(ПутьКДанным);
		
		ЕСли НЕ ПравоДоступа("Чтение", СтруктураПутьКДанным.Метаданные) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяОбъекта = СтруктураПутьКДанным.ТипОбъекта + "." + СтруктураПутьКДанным.ВидОбъекта;
		ИмяТЧ = Лев(СтруктураПутьКДанным.ИмяРеквизита, Найти(СтруктураПутьКДанным.ИмяРеквизита, ".")-1);
		ИмяРеквизита = Лев(СтруктураПутьКДанным.ИмяРеквизита, Найти(СтруктураПутьКДанным.ИмяРеквизита, ".")-1);
		
		Запрос.Текст = Запрос.Текст + ?(Запрос.Текст = "", "ВЫБРАТЬ РАЗРЕШЕННЫЕ", Символы.ПС + "ОБЪЕДИНИТЬ
		|ВЫБРАТЬ") + " " + СтруктураПутьКДанным.ВидОбъекта +".Ссылка" + "
		|" + "ИЗ " + ИмяОбъекта + "." + СтруктураПутьКДанным.ИмяТаблЧасти + " КАК " + СтруктураПутьКДанным.ВидОбъекта + "
		|" + СтрЗаменить("ГДЕ " + СтруктураПутьКДанным.ВидОбъекта + "." + СтруктураПутьКДанным.ИмяРеквизита + " = &ЗначениеКритерияОтбора", "..", ".");
		
	КонецЦикла;
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицы ИЗ Таблица Цикл
		МетаданныеДокумента = СтрокаТаблицы.Ссылка.Метаданные();
		Если НЕ ПравоДоступа("Чтение", МетаданныеДокумента) Тогда
			Продолжить;
		КонецЕсли;			
		ИмяДокумента = МетаданныеДокумента.Имя;
		СинонимДокумента = МетаданныеДокумента.Синоним;
				
		ДополнитьКэшМетаданных(МетаданныеДокумента, ИмяДокумента);
		
		СтруктураТипа = КэшПоТипамДокументов[ИмяДокумента];
		Если СтруктураТипа = Неопределено Тогда
			СтруктураТипа = Новый Структура("Синоним, МассивСсылок", СинонимДокумента, Новый Массив);
			КэшПоТипамДокументов.Вставить(ИмяДокумента, СтруктураТипа);
		КонецЕсли;
		СтруктураТипа.МассивСсылок.Добавить(СтрокаТаблицы.Ссылка);		
	КонецЦикла;
	
	ЕСли КэшПоТипамДокументов.Количество() = 0 ТОгда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаНачало = "ВЫБРАТЬ РАЗРЕШЕННЫЕ *" + Символы.ПС + "ИЗ (";
	ТекстЗапросаКонец = ") КАК ПодчиненныеДокументы" + Символы.ПС + "УПОРЯДОЧИТЬ ПО ПодчиненныеДокументы.Дата";
	Запрос = Новый Запрос;
	Для Каждого КлючИЗначение ИЗ КэшПоТипамДокументов Цикл
		Если Метаданные.Справочники.Найти(КлючИЗначение.Ключ) <> Неопределено Тогда
			ИмяОбъекта = "Справочник";
		ИначеЕсли Метаданные.Документы.Найти(КлючИЗначение.Ключ) <> Неопределено Тогда
			ИмяОбъекта = "Документ";
		ИначеЕсли Метаданные.БизнесПроцессы.Найти(КлючИЗначение.Ключ) <> Неопределено Тогда
			ИмяОбъекта = "БизнесПроцесс";
		ИначеЕсли Метаданные.Задачи.Найти(КлючИЗначение.Ключ) <> Неопределено Тогда
			ИмяОбъекта = "Задача";			
		Иначе
			Продолжить;
		КонецЕсли; 
		Запрос.Текст = Запрос.Текст + Символы.ПС + ?(Запрос.Текст = "", 
					"ВЫБРАТЬ ",
					"ОБЪЕДИНИТЬ ВСЕ
					|ВЫБРАТЬ") + Символы.ПС + 
					"Ссылка, " + ?(ИмяОбъекта <> "Справочник", "Дата, ", "ДАТАВРЕМЯ(1,1,1) КАК Дата, ") + ?(ИмяОбъекта = "Документ", "Проведен", "Ложь КАК Проведен") + ", ПометкаУдаления, " + ?(ИмяОбъекта = "Справочник" ИЛИ ИмяОбъекта = "Документ", "Представление", """" + ИмяОбъекта + """" + " КАК Представление") + ",  """ + КлючИЗначение.Ключ + """ КАК Метаданные, #Сумма
					|ИЗ " + ИмяОбъекта + "." + КлючИЗначение.Ключ + "
					|ГДЕ Ссылка В (&" + КлючИЗначение.Ключ + ")";
					
		Если мКэшРеквизитовДокумента[КлючИЗначение.Ключ]["СуммаДокумента"] Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "СуммаДокумента КАК СуммаДокумента");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "0 КАК СуммаДокумента");
		КонецЕсли;			
					
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение.МассивСсылок);		
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапросаНачало + Запрос.Текст + ТекстЗапросаКонец;
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		Если мУжеВСписке[Выборка.Ссылка] = Неопределено Тогда
			НоваяСтрока = СтрокаДерева.ПолучитьЭлементы().Добавить();
			НоваяСтрока.Ссылка = Выборка.Ссылка;
			НоваяСтрока.СуммаДокумента = Выборка.СуммаДокумента;
			НоваяСтрока.ДокументПредставление = Выборка.Представление;
			НоваяСтрока.Проведен = Выборка.Проведен;
			НоваяСтрока.ПометкаУдаления = Выборка.ПометкаУдаления;
			НоваяСтрока.Картинка = НомерКартинки(НоваяСтрока);
			НоваяСтрока.ВидДокумента = Выборка.Метаданные;
			НоваяСтрока.ПроведениеРазрешено = Выборка.Ссылка.Метаданные().Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить;
			мУжеВСписке.Вставить(Выборка.Ссылка, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого НоваяСтрока Из СтрокаДерева.ПолучитьЭлементы() Цикл
		ВывестиПодчиненныеДокументы(НоваяСтрока);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте                                                                                       
// Процедура выполняет открытие формы текущего документа.
//                                                         
Процедура ОткрытьФормуДокумента()
	
	Попытка
		
		СтруктураОткрытия = Новый Структура("Ключ", Элементы.ДеревоДокументов.ТекущиеДанные.Ссылка);
		ИмяОбъекта		  = ПолучитьИмяОбъекта(Элементы.ДеревоДокументов.ТекущиеДанные.Ссылка);			
		
		Форма = ПолучитьФорму(Имяобъекта + "." + Элементы.ДеревоДокументов.ТекущиеДанные.ВидДокумента + ".ФормаОбъекта", СтруктураОткрытия);
		
		Если Элементы.ДеревоДокументов.ТекущиеДанные.Ссылка = ДокументСсылка И Форма.Открыта() Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Документ уже открыт!'");
			Сообщение.Сообщить();
		КонецЕсли; 
		
		Форма.Открыть();
		
	Исключение
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры


&НаСервере
// Функция возвращает путь к объекту метаданных
// ТипОбъектаМетаданных.ИмяДокумента.ТабличнаяЧасть.ИмяТабличнойЧасти.Реквизит.ИмяРеквизита.
// ТипОбъектаМетаданных должен быть Справочник или Документ.
//
// Параметры:
//  ПутьКДанным - строка.
//
// Возвращаемое значение:
//  Структура - путь к объекту метаданных
//
Функция РазобратьПутьКОбъектуМетаданных(ПутьКДанным)
	
	Структура = Новый Структура;
	
	СоответствиеИмен = Новый Массив();
	СоответствиеИмен.Добавить("ТипОбъекта");
	СоответствиеИмен.Добавить("ВидОбъекта");
	СоответствиеИмен.Добавить("ПутьКДанным");
	СоответствиеИмен.Добавить("ИмяТаблЧасти");
	СоответствиеИмен.Добавить("ИмяРеквизита");
	
	Для индекс = 1 по 3 Цикл
		
		Точка = Найти(ПутьКДанным, ".");
		ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
		Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
		ПутьКДанным = Сред(ПутьКДанным, Точка+1);
		
	КонецЦикла;
	
	ПутьКДанным = СтрЗаменить(ПутьКДанным, "Реквизит.", "");
	
	Если Структура.ПутьКДанным = "ТабличнаяЧасть" Тогда
		
		Для индекс = 4 по 5  Цикл 
			
			Точка = Найти(ПутьКДанным, ".");
			Если Точка = 0 Тогда
				ТекущееЗначение = ПутьКДанным;
			Иначе
				ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
			КонецЕсли;
			
			Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
			ПутьКДанным = Сред(ПутьКДанным,  Точка+1);
			
		КонецЦикла;
		
	Иначе
		
		Структура.Вставить(СоответствиеИмен[3], "");
		Структура.Вставить(СоответствиеИмен[4], ПутьКДанным);
		
	КонецЕсли;
	
	Если Структура.ТипОбъекта = "Документ" Тогда
		Структура.Вставить("Метаданные", Метаданные.Документы[Структура.ВидОбъекта]);
	ИначеЕсли Структура.ТипОбъекта = "Справочник" Тогда
		Структура.Вставить("Метаданные", Метаданные.Справочники[Структура.ВидОбъекта]);
	ИначеЕсли Структура.ТипОбъекта = "БизнесПроцесс" Тогда
		Структура.Вставить("Метаданные", Метаданные.БизнесПроцессы[Структура.ВидОбъекта]);
	ИначеЕсли Структура.ТипОбъекта = "Задача" Тогда
		Структура.Вставить("Метаданные", Метаданные.Задачи[Структура.ВидОбъекта]);
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции // РазобратьПутьКОбъектуМетаданных()

&НаКлиенте                                                                                       
// Процедура закрывает форму с предупреждением.
//
Процедура ЗакрытьФормуСПредупреждением(ТекстПредупреждения)
	
	ЭтаФорма.Закрыть();
	ПоказатьПредупреждение(, ТекстПредупреждения);
	
КонецПроцедуры

&НаСервере                                                                                       
// Процедура дополняет кэш метаданных.
//
Процедура ДополнитьКэшМетаданных(МетаданныеДокумента, ИмяДокумента)
	
	РеквизитыДокумента = мКэшРеквизитовДокумента[ИмяДокумента];
	Если РеквизитыДокумента = Неопределено Тогда
		РеквизитыДокумента = Новый Соответствие;		
		РеквизитыДокумента.Вставить("СуммаДокумента", МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено);		
		мКэшРеквизитовДокумента.Вставить(ИмяДокумента, РеквизитыДокумента);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере                                                                                       
// Функция проверяет доступность изменяемого документа.
//
Функция ОсновнойДокументЕщеДоступен()
	
	Если ДокументСсылка = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;
	ИмяТекущегоДокумента = ДокументСсылка.Метаданные().Имя;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ Представление ИЗ Документ." + ИмяТекущегоДокумента + " ГДЕ Ссылка = &ТекущийДокумент";
	Запрос.УстановитьПараметр("ТекущийДокумент", ДокументСсылка);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста                                                                                       
// Функция возвращает номер картинки.
//
Функция НомерКартинки(СтрокаДерева)
	
	Если СтрокаДерева.ПометкаУдаления Тогда
		Возврат 3;
	ИначеЕсли СтрокаДерева.Проведен Тогда
		Возврат 1;
	Иначе	
	    Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте                                                                                       
// Процедура обновляет доступность кнопок Провести и Отменить проведение.
//
Процедура ОбновитьДоступностьКнопок()
	
	Элементы.Провести.        Доступность = Элементы.ДеревоДокументов.ТекущиеДанные.ПроведениеРазрешено;
	Элементы.ОтменаПроведения.Доступность = Элементы.ДеревоДокументов.ТекущиеДанные.ПроведениеРазрешено;
	
КонецПроцедуры 

&НаСервере                                                                                       
// Функция осуществляет проведение выбранного документа.
//
Функция ПровестиСервер(ДокументСсылка)
	
	Объект = ДокументСсылка.ПолучитьОбъект();
	Попытка
	    Объект.Заблокировать();
		Объект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Объект.Разблокировать();
	Исключение
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Невозможно заблокировать документ.'");
		Сообщение.Сообщить();
	КонецПопытки; 

	Возврат Объект.Проведен;
	
КонецФункции

&НаСервере                                                                                       
// Функция осуществляет отмену проведения выбранного документа.
//
Функция ОтменаПроведенияСервер(ДокументСсылка)
	
	Объект = ДокументСсылка.ПолучитьОбъект();
	Попытка
	    Объект.Заблокировать();
		Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Объект.Разблокировать();
	Исключение
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Невозможно заблокировать документ.'");
		Сообщение.Сообщить();
	КонецПопытки; 

	Возврат Объект.Проведен;
	
КонецФункции

&НаСервере                                                                                       
// Функция устанавливает пометку на удаление выбранного документа.
//
Функция УстановитьПометкуУдаленияСервер(ДокументСсылка)
	
	Объект = ДокументСсылка.ПолучитьОбъект();
	Попытка
	    Объект.Заблокировать();
		Объект.УстановитьПометкуУдаления(НЕ Объект.ПометкаУдаления);
		Объект.Разблокировать();
	Исключение
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Невозможно заблокировать документ.'");
		Сообщение.Сообщить();
	КонецПопытки; 

	Возврат Объект.ПометкаУдаления;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИмяОбъекта(Ссылка)

	ОбъектМетаданных = Ссылка.Метаданные();
	ИмяОбъекта = "";
	Если ОбщегоНазначения.ЭтоДокумент(ОбъектМетаданных) Тогда 
		ИмяОбъекта = "Документ";
	ИначеЕсли ОбщегоНазначения.ЭтоСправочник(ОбъектМетаданных) Тогда 
		ИмяОбъекта = "Справочник";
	ИначеЕсли ОбщегоНазначения.ЭтоЗадача(ОбъектМетаданных) Тогда 
		ИмяОбъекта = "Задача";
	ИначеЕсли ОбщегоНазначения.ЭтоБизнесПроцесс(ОбъектМетаданных) Тогда 
		ИмяОбъекта = "БизнесПроцесс";
	КонецЕсли;
	Возврат ИмяОбъекта;
	
КонецФункции 

#КонецОбласти
