
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущееРабочееМесто = МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента();
	Список.Параметры.УстановитьЗначениеПараметра("ТекущееРабочееМесто", ТекущееРабочееМесто);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
		ИмяКомпьютера = "";
	
	#Если НЕ ВебКлиент Тогда
		ИмяКомпьютера = ИмяКомпьютера();
	#КонецЕсли
	
	РабочееМесто = ПолучитьМногопользовательскоеРабочееМесто(ИмяКомпьютера);
	
	Если НЕ РабочееМесто = Неопределено Тогда
		Отказ = Истина;
		
		Текст = НСтр("ru='Создание рабочего места не требуется, для этого компьютера оно уже было создано."
					"Открыть существующее рабочее место?';en='creation worker places not required for this computer it already it was created."
					"Open existing working aplace?'");
		Оповещение = Новый ОписаниеОповещения("СписокПередНачаломДобавленияЗавершение", ЭтотОбъект, РабочееМесто);
		ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет);
	Иначе	
		СистемнаяИнформация = Новый СистемнаяИнформация();
		ИдентификаторКлиента = ВРег(СистемнаяИнформация.ИдентификаторКлиента);
		
		РабочееМесто = ПолучитьРабочееМестоПоИдентификаторуКлиента(ИдентификаторКлиента);
		
		Если НЕ РабочееМесто = Неопределено Тогда
			
			Отказ = Истина;
			
			Текст = НСтр("ru='Создание рабочего места не требуется, так для такого идентификатора клиента оно уже было создано."
					"Открыть существующее рабочее место?';en='creation worker places not required so for such an identifier client it already it was created."
					"Open existing working aplace?'");
			Оповещение = Новый ОписаниеОповещения("СписокПередНачаломДобавленияЗавершение", ЭтотОбъект, РабочееМесто);
			ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура СписокПередНачаломДобавленияЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да И Не ПустаяСтрока(Параметры) Тогда
		ПоказатьЗначение(, Параметры);
	КонецЕсли;  
	
КонецПроцедуры 


&НаСервере
Функция ПолучитьРабочееМестоПоИдентификаторуКлиента(Идентификатор)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|    РабочиеМеста.Ссылка
	|ИЗ
	|    Справочник.РабочиеМеста КАК РабочиеМеста
	|ГДЕ
	|    РабочиеМеста.Код = &Идентификатор");
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьМногопользовательскоеРабочееМесто(ИмяКомпьютера)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РабочиеМеста.Ссылка
	                      |ИЗ
	                      |	Справочник.РабочиеМеста КАК РабочиеМеста
	                      |ГДЕ
	                      |	РабочиеМеста.Код = &ИмяКомпьютера
	                      |	И РабочиеМеста.МногопользовательскийРежим");
	
	Запрос.УстановитьПараметр("ИмяКомпьютера", ИмяКомпьютера);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

