
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, "При создании на сервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;

	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.ИЭМК, Истина);
	
	Если ЗначениеЗаполнено(ВнешняяСистема) Тогда
		Элементы.КомандаПодборИзКлассификатора.Видимость = Истина;
		ПараметрыВнешнейСистемы = ВнешняяСистема.Параметры.Получить();		
		Если ЗначениеЗаполнено(ПараметрыВнешнейСистемы) И ТипЗнч(ПараметрыВнешнейСистемы) = Тип("Структура") Тогда
			ПараметрыВнешнейСистемы.Свойство("guid"					, ЭтотОбъект.guid);
			ПараметрыВнешнейСистемы.Свойство("idLPU"				, ЭтотОбъект.idLPU); 
			ПараметрыВнешнейСистемы.Свойство("РаботаВРежимеДемо"	, ЭтотОбъект.Демо);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Обработчик события Действие команды КомандаПодборИзКлассификатора.
//
Процедура ОбновитьИЭМК(Команда)
	
	ПараметрыЗапроса = "{
	|""resourceType"": ""Parameters"",
	|""parameter"": [{
	|	""name"": ""system"",
	|	""valueString"": ""urn:oid:1.2.643.5.1.13.13.11.1002""
	|}]
	|}";
	
	ОтветОтИЭМК = ПолучитьОтветОтИЭМК(ПараметрыЗапроса);
	
	ЗаполнитьСправочникСпециальностей(ОтветОтИЭМК);

	ОбновитьИнтерфейс();

КонецПроцедуры

&НаСервере
// Процедура заполняет справочник Специальностей врача.
//
Процедура ЗаполнитьСправочникСпециальностей(ОтветОтИЭМК);

	Если ТипЗнч(ОтветОтИЭМК) = Тип("Структура") И  ОтветОтИЭМК.parameter.Количество() > 0 Тогда
		Справочники.КлассификаторДолжностей.ЗаполнитьСправочникДолжностей(ОтветОтИЭМК.parameter[0].resource.expansion.contains);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Функция, возвращает ответ от сервиса ИЭМК, с данными справочников.
//
Функция ПолучитьОтветОтИЭМК(ПараметрыЗапроса)
	
	//ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows(), Новый СертификатыУдостоверяющихЦентровWindows());  
	#Если Не ВебКлиент Тогда 

		Если ЭтотОбъект.Демо Тогда
			АдресСтенда = "b2b-demo.n3health.ru";
		Иначе
			АдресСтенда = "b2b.n3health.ru";
		КонецЕсли;
		HTTPСоединение = Новый HTTPСоединение("АдресСтенда",,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		
		ЗаголовкиHTTP  = Новый Соответствие; 
		ЗаголовкиHTTP.Вставить("Content-Type","application/json");
		Авторизация = "N3 "+ ЭтотОбъект.guid;
		ЗаголовкиHTTP.Вставить("Authorization", Авторизация);
		
		HTTPЗапрос  = Новый HTTPЗапрос("/nsi/fhir/term/ValueSet/$expand?_format=json", ЗаголовкиHTTP);	
		мДатаНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
		HTTPЗапрос.УстановитьТелоИзСтроки(?(ЗначениеЗаполнено(ПараметрыЗапроса), ПараметрыЗапроса, ""));
		
		Запрос = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		мДатаКонца = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ВремяВыполненияЗапроса = (мДатаКонца - мДатаНачала) /1000;
		
		ТекстJSON  = Запрос.ПолучитьТелоКакСтроку(); 
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстJSON);
		ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);	
		
		Возврат ПараметрыJSON;
	#КонецЕсли
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти