
#Область ОбработчикиСобытийФормы

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ВидОперацииОтбор
//
Процедура ВидОперацииОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ВидОперации", ВидОперацииОтбор, ЗначениеЗаполнено(ВидОперацииОтбор));
КонецПроцедуры

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработкиСтоматология.ПриСозданииНаСервере(ЭтаФорма);	
	ОбновитьБалансАккаунтаSMS(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Обновить баланс
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОбновитьБаланс(Команда)
	
	ОбновитьБалансАккаунтаSMS();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Пополнить баланс
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПополнитьБаланс(Команда)
	
	ОткрытьФорму("Справочник.СервисыРассылки.Форма.ФормаЗапросаПополненияБалансаСмсСервиса",,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаСервере
// Процедура, обновляет баланс аккаунта.
//  Параметры:
//   ВыдаватьСообщенияОбОшибке - Булево;
//
Процедура ОбновитьБалансАккаунтаSMS(ВыдаватьСообщенияОбОшибке = Истина)
	
	СервисSMSРассылки = Константы.СервисSMSРассылкиПоУмолчанию.Получить();

	Если ЗначениеЗаполнено(СервисSMSРассылки) Тогда
		
		Результат = Справочники.СервисыРассылки.ПолучитьБалансАккаунтаSMS(СервисSMSРассылки);
		БалансSMS = СервисSMSРассылки.Наименование + ". Баланс: " + Строка(Результат.Баланс) + " " + НРег(Результат.Валюта);
		
		Элементы.ПополнитьБаланс.Доступность = ЗначениеЗаполнено(Результат.Баланс);
	Иначе
		БалансSMS = "Сервис sms-рассылки не задан!";
		Элементы.ПополнитьБаланс.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.БалансSMS.Подсказка = БалансSMS;

КонецПроцедуры

#КонецОбласти