
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Элементы.ФормаДобавитьСобственнуюОрганизацию.Видимость = ПравоДоступа("Добавление", Метаданные.Справочники.ОрганизацииМДЛП);
	Элементы.ФормаЗапроситьДанныеОрганизации.Видимость = ПравоДоступа("Добавление", Метаданные.Справочники.ОрганизацииМДЛП);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьСобственнуюОрганизацию(Команда)
	
	ОткрытьФорму("Справочник.ОрганизацииМДЛП.Форма.ФормаДобавленияСобственнойОрганизации");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьДанныеОрганизации(Команда)
	
	ОткрытьФорму("Справочник.ОрганизацииМДЛП.Форма.ЗапросДанныхКонтрагента");
	
КонецПроцедуры

#КонецОбласти