
#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
// Выполняем пересчет цены табличной части документа после изменений в форме 
// "Цены и валюта".
//
Процедура ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ФормаДокумента, ИмяТабличнойЧасти, ПересчитатьСкидки = Ложь, ПерезаполнитьЦенуЗакупки = Ложь) Экспорт
	
	СтруктураДанных = Новый Структура;
	ТабличнаяЧастьДокумента = Новый Массив;

	СтруктураДанных.Вставить("Дата",				ФормаДокумента.Объект.Дата);
	СтруктураДанных.Вставить("СтруктурнаяЕдиница",	ФормаДокумента.Объект.СтруктурнаяЕдиница);
	СтруктураДанных.Вставить("ВидЦен",				ФормаДокумента.Объект.ВидЦен);
	
	//Если ПересчитатьСкидки Тогда
	//	СтруктураДанных.Вставить("ВидСкидкиНаценки", ФормаДокумента.Объект.ВидСкидкиНаценки);
	//	СтруктураДанных.Вставить("ПроцентСкидкиНаценки", 0);
	//КонецЕсли;
	
	Для каждого СтрокаТЧ Из ФормаДокумента.Объект[ИмяТабличнойЧасти] Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			Продолжить;	
		КонецЕсли; 
		
		СтрокаТабличнойЧасти = Новый Структура();
		СтрокаТабличнойЧасти.Вставить("Номенклатура",		СтрокаТЧ.Номенклатура);
		СтрокаТабличнойЧасти.Вставить("Упаковка",			СтрокаТЧ.Упаковка);
		Если СтрокаТЧ.Свойство("СтавкаНДС") Тогда
			СтрокаТабличнойЧасти.Вставить("СтавкаНДС",			СтрокаТЧ.СтавкаНДС);
		КонецЕсли;
		СтрокаТабличнойЧасти.Вставить("Цена",				0);
		
		ТабличнаяЧастьДокумента.Добавить(СтрокаТабличнойЧасти);
		
	КонецЦикла;
		
	Ценообразование.ПолучитьЦеныТабличнойЧастиПоВидуЦен(СтруктураДанных, ТабличнаяЧастьДокумента);
		
	Для каждого СтрокаТЧ Из ТабличнаяЧастьДокумента Цикл

		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура",		СтрокаТЧ.Номенклатура);
		СтруктураПоиска.Вставить("Упаковка",			СтрокаТЧ.Упаковка);
		Если СтрокаТЧ.Свойство("СтавкаНДС") Тогда 
			СтруктураПоиска.Вставить("СтавкаНДС",			СтрокаТЧ.СтавкаНДС);
		КонецЕсли;
		
		РезультатПоиска = ФормаДокумента.Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураПоиска);
		
		Для каждого СтрокаРезультат Из РезультатПоиска Цикл
			
			СтрокаРезультат.Цена = СтрокаТЧ.Цена;
			
			Если СтрокаРезультат.Свойство("Сумма") Тогда
				Если ПерезаполнитьЦенуЗакупки Тогда 
					СтруктураПараметров = Новый Структура;
					СтруктураПараметров.Вставить("ЕстьКолонкаПроцентСкидкиНаценки"				, Ложь);
					СтруктураПараметров.Вставить("ЕстьКолонкаСуммаАвтоматическойСкидкиНаценки"	, Ложь);
				Иначе 
					СтруктураПараметров = Неопределено;
				КонецЕсли;	
				ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуТабЧасти(СтрокаРезультат, СтруктураПараметров);
			КонецЕсли;
			Если СтрокаРезультат.Свойство("СуммаНДС") Тогда
				ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуНДСТабЧасти(СтрокаРезультат);
			КонецЕсли;
			Если СтрокаРезультат.Свойство("Всего") Тогда
				ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуВКолонкеВсегоТабЧасти(СтрокаРезультат);
			КонецЕсли;			
			
		КонецЦикла;
		
	КонецЦикла;
	
	//Если ПересчитатьСкидки Тогда
	//	Для каждого СтрокаТабличнойЧасти Из ФормаДокумента.Объект[ИмяТабличнойЧасти] Цикл
	//		СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = СтруктураДанных.ПроцентСкидкиНаценки;
	//		РассчитатьСуммуСтрокиТабличнойЧасти(ФормаДокумента, СтрокаТабличнойЧасти);
	//	КонецЦикла;
	//КонецЕсли;
	
КонецПроцедуры // ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен()

#КонецОбласти
