
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Обновить регистр сделки сведения для списка
//
Процедура ОбновитьРегистрСделкиСведенияДляСписка(Порция = 500) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 															
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	ЕстьДанныеДляОбработки = Истина;
	МассивПациентов = Новый Массив;
	МассивПациентов.Добавить(Справочники.Контрагенты.ПустаяСсылка());
	
	МетаданныеРегистра 		= Неопределено;
	ПредставлениеРегистра 	= Неопределено;
	
	Пока ЕстьДанныеДляОбработки Цикл 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МассивПациентов", МассивПациентов);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 500
		|	Сделки.Контрагент КАК Пациент
		|ИЗ
		|	Справочник.Сделки КАК Сделки
		|ГДЕ
		|	НЕ Сделки.ПометкаУдаления 
		|	И НЕ Сделки.Контрагент В(&МассивПациентов)";
		
		МассивПациентовДляОбработки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пациент");
		ЕстьДанныеДляОбработки = МассивПациентовДляОбработки.Количество() > 0;
		Если ЕстьДанныеДляОбработки Тогда 
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПациентов, МассивПациентовДляОбработки);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МассивПациентовДляОбработки", МассивПациентовДляОбработки);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сделки.Ссылка КАК Сделка,
		|	Сделки.ВидСделки КАК ВидСделки,
		|	Сделки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Сделки.Контрагент КАК Пациент,
		|	Сделки.ДатаСделки КАК ДатаСделки,
		|	Сделки.ДатаЗавершенияСделки КАК ДатаЗавершенияСделки,
		|	Сделки.Врач КАК Врач,
		|	Сделки.РезультатСделки КАК РезультатСделки,
		|	Сделки.ЭтапСделки КАК ЭтапСделки,
		|	Сделки.ЭтапУспеха КАК ЭтапУспеха,
		|	Сделки.ЭтапОтказа КАК ЭтапОтказа,
		|	Сделки.Предопределенный КАК Предопределенный,
		|	Сделки.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ПОМЕСТИТЬ СтартоваяТаблицаСделокПациента
		|ИЗ
		|	Справочник.Сделки КАК Сделки
		|ГДЕ
		|	Сделки.Контрагент В(&МассивПациентовДляОбработки)
		|	И НЕ Сделки.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(СтартоваяТаблицаСделокПациента1.Сделка) КАК НомерПоПорядку,
		|	СтартоваяТаблицаСделокПациента.Сделка КАК Сделка,
		|	СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	СтартоваяТаблицаСделокПациента.Врач КАК Врач
		|ПОМЕСТИТЬ ТаблицаПорядковыхНомеровСделокПоПациенту
		|ИЗ
		|	СтартоваяТаблицаСделокПациента КАК СтартоваяТаблицаСделокПациента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтартоваяТаблицаСделокПациента КАК СтартоваяТаблицаСделокПациента1
		|		ПО СтартоваяТаблицаСделокПациента.Пациент = СтартоваяТаблицаСделокПациента1.Пациент
		|			И СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница = СтартоваяТаблицаСделокПациента1.СтруктурнаяЕдиница
		|			И СтартоваяТаблицаСделокПациента.ДатаЗавершенияСделки >= СтартоваяТаблицаСделокПациента1.ДатаЗавершенияСделки
		|			И (ВЫБОР
		|				КОГДА СтартоваяТаблицаСделокПациента.ДатаЗавершенияСделки = СтартоваяТаблицаСделокПациента1.ДатаЗавершенияСделки
		|					ТОГДА СтартоваяТаблицаСделокПациента.ДатаСделки >= СтартоваяТаблицаСделокПациента1.ДатаСделки
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтартоваяТаблицаСделокПациента.Сделка,
		|	СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница,
		|	СтартоваяТаблицаСделокПациента.Врач
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(СтартоваяТаблицаСделокПациента1.Сделка) КАК НомерПоПорядку,
		|	СтартоваяТаблицаСделокПациента.Сделка КАК Сделка,
		|	СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	СтартоваяТаблицаСделокПациента.Врач КАК Врач
		|ПОМЕСТИТЬ ТаблицаПорядковыхНомеровСделокПоВрачу
		|ИЗ
		|	СтартоваяТаблицаСделокПациента КАК СтартоваяТаблицаСделокПациента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтартоваяТаблицаСделокПациента КАК СтартоваяТаблицаСделокПациента1
		|		ПО СтартоваяТаблицаСделокПациента.Пациент = СтартоваяТаблицаСделокПациента1.Пациент
		|			И СтартоваяТаблицаСделокПациента.Врач = СтартоваяТаблицаСделокПациента1.Врач
		|			И СтартоваяТаблицаСделокПациента.ДатаЗавершенияСделки >= СтартоваяТаблицаСделокПациента1.ДатаЗавершенияСделки
		|			И (ВЫБОР
		|				КОГДА СтартоваяТаблицаСделокПациента.ДатаЗавершенияСделки = СтартоваяТаблицаСделокПациента1.ДатаЗавершенияСделки
		|					ТОГДА СтартоваяТаблицаСделокПациента.ДатаСделки >= СтартоваяТаблицаСделокПациента1.ДатаСделки
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтартоваяТаблицаСделокПациента.Сделка,
		|	СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница,
		|	СтартоваяТаблицаСделокПациента.Врач
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументСобытие.Дата КАК Дата,
		|	ДокументСобытие.Ссылка КАК ПредварительнаяЗапись,
		|	ДокументСобытие.Контрагент КАК Контрагент,
		|	ДокументСобытие.Сделка КАК Сделка,
		|	ДокументСобытие.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|ПОМЕСТИТЬ ТаблицаПредварительныхЗаписейПоСделкам
		|ИЗ
		|	Документ.Событие КАК ДокументСобытие
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтартоваяТаблицаСделокПациента КАК СтартоваяТаблицаСделокПациента
		|		ПО ДокументСобытие.СтруктурнаяЕдиница = СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница
		|			И ДокументСобытие.Сделка = СтартоваяТаблицаСделокПациента.Сделка
		|			И (ДокументСобытие.Проведен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Взаимодействие.Ссылка КАК Задача,
		|	ВЫБОР
		|		КОГДА Взаимодействие.ЗадачаНазначеннаяДатаНачало <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Взаимодействие.ЗадачаНазначеннаяДатаНачало
		|		ИНАЧЕ Взаимодействие.ЗадачаНазначеннаяДата
		|	КОНЕЦ КАК ДатаНазначенная,
		|	Взаимодействие.Выполнена КАК Выполнена,
		|	Взаимодействие.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Взаимодействие.Сделка КАК Сделка
		|ПОМЕСТИТЬ ТаблицаЗадачПоСделкам
		|ИЗ
		|	Задача.Взаимодействие КАК Взаимодействие
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтартоваяТаблицаСделокПациента КАК СтартоваяТаблицаСделокПациента
		|		ПО Взаимодействие.СтруктурнаяЕдиница = СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница
		|			И Взаимодействие.Сделка = СтартоваяТаблицаСделокПациента.Сделка
		|			И (НЕ Взаимодействие.ПометкаУдаления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ТаблицаПредварительныхЗаписейПоСделкам.ПредварительнаяЗапись) КАК ЗапланированнаяПредварительнаяЗапись,
		|	ТаблицаПредварительныхЗаписейПоСделкам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаПредварительныхЗаписейПоСделкам.Сделка КАК Сделка
		|ПОМЕСТИТЬ ТаблицаЗапланированныхПредварительныхЗаписей
		|ИЗ
		|	ТаблицаПредварительныхЗаписейПоСделкам КАК ТаблицаПредварительныхЗаписейПоСделкам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МАКСИМУМ(ТаблицаПредварительныхЗаписейПоСделкам.Дата) КАК Дата,
		|			ТаблицаПредварительныхЗаписейПоСделкам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|			ТаблицаПредварительныхЗаписейПоСделкам.Сделка КАК Сделка
		|		ИЗ
		|			ТаблицаПредварительныхЗаписейПоСделкам КАК ТаблицаПредварительныхЗаписейПоСделкам
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТаблицаПредварительныхЗаписейПоСделкам.СтруктурнаяЕдиница,
		|			ТаблицаПредварительныхЗаписейПоСделкам.Сделка) КАК ЗапланированнаяПредварительнаяЗаписьПоСделке
		|		ПО ТаблицаПредварительныхЗаписейПоСделкам.СтруктурнаяЕдиница = ЗапланированнаяПредварительнаяЗаписьПоСделке.СтруктурнаяЕдиница
		|			И ТаблицаПредварительныхЗаписейПоСделкам.Сделка = ЗапланированнаяПредварительнаяЗаписьПоСделке.Сделка
		|			И ТаблицаПредварительныхЗаписейПоСделкам.Дата = ЗапланированнаяПредварительнаяЗаписьПоСделке.Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПредварительныхЗаписейПоСделкам.СтруктурнаяЕдиница,
		|	ТаблицаПредварительныхЗаписейПоСделкам.Сделка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ТаблицаЗадачПоСделкам.Задача) КАК ПоследняяВыполненная,
		|	ТаблицаЗадачПоСделкам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаЗадачПоСделкам.Сделка КАК Сделка
		|ПОМЕСТИТЬ ТаблицаПоследнихВыполненныхЗадач
		|ИЗ
		|	ТаблицаЗадачПоСделкам КАК ТаблицаЗадачПоСделкам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МАКСИМУМ(ТаблицаЗадачПоСделкам.ДатаНазначенная) КАК ДатаНазначенная,
		|			ТаблицаЗадачПоСделкам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|			ТаблицаЗадачПоСделкам.Сделка КАК Сделка
		|		ИЗ
		|			ТаблицаЗадачПоСделкам КАК ТаблицаЗадачПоСделкам
		|		ГДЕ
		|			ТаблицаЗадачПоСделкам.Выполнена
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТаблицаЗадачПоСделкам.СтруктурнаяЕдиница,
		|			ТаблицаЗадачПоСделкам.Сделка) КАК ПоследняяВыполненнаяЗадача
		|		ПО ТаблицаЗадачПоСделкам.СтруктурнаяЕдиница = ПоследняяВыполненнаяЗадача.СтруктурнаяЕдиница
		|			И ТаблицаЗадачПоСделкам.Сделка = ПоследняяВыполненнаяЗадача.Сделка
		|			И ТаблицаЗадачПоСделкам.ДатаНазначенная = ПоследняяВыполненнаяЗадача.ДатаНазначенная
		|			И (ТаблицаЗадачПоСделкам.Выполнена)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаЗадачПоСделкам.СтруктурнаяЕдиница,
		|	ТаблицаЗадачПоСделкам.Сделка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ТаблицаЗадачПоСделкам.Задача) КАК ПоследняяНеВыполненная,
		|	ТаблицаЗадачПоСделкам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаЗадачПоСделкам.Сделка КАК Сделка
		|ПОМЕСТИТЬ ТаблицаПоследнихНеВыполненныхЗадач
		|ИЗ
		|	ТаблицаЗадачПоСделкам КАК ТаблицаЗадачПоСделкам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МАКСИМУМ(ТаблицаЗадачПоСделкам.ДатаНазначенная) КАК ДатаНазначенная,
		|			ТаблицаЗадачПоСделкам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|			ТаблицаЗадачПоСделкам.Сделка КАК Сделка
		|		ИЗ
		|			ТаблицаЗадачПоСделкам КАК ТаблицаЗадачПоСделкам
		|		ГДЕ
		|			НЕ ТаблицаЗадачПоСделкам.Выполнена
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТаблицаЗадачПоСделкам.СтруктурнаяЕдиница,
		|			ТаблицаЗадачПоСделкам.Сделка) КАК ПоследняяНеВыполненнаяЗадача
		|		ПО ТаблицаЗадачПоСделкам.СтруктурнаяЕдиница = ПоследняяНеВыполненнаяЗадача.СтруктурнаяЕдиница
		|			И ТаблицаЗадачПоСделкам.Сделка = ПоследняяНеВыполненнаяЗадача.Сделка
		|			И ТаблицаЗадачПоСделкам.ДатаНазначенная = ПоследняяНеВыполненнаяЗадача.ДатаНазначенная
		|			И (НЕ ТаблицаЗадачПоСделкам.Выполнена)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаЗадачПоСделкам.СтруктурнаяЕдиница,
		|	ТаблицаЗадачПоСделкам.Сделка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтартоваяТаблицаСделокПациента.Сделка КАК Сделка,
		|	СтартоваяТаблицаСделокПациента.ВидСделки КАК ВидСделки,
		|	ТаблицаПорядковыхНомеровСделокПоПациенту.НомерПоПорядку КАК Номер,
		|	ТаблицаПорядковыхНомеровСделокПоВрачу.НомерПоПорядку = 1 КАК ПерваяДляВрача,
		|	ЕСТЬNULL(ТаблицаЗапланированныхПредварительныхЗаписей.ЗапланированнаяПредварительнаяЗапись, ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка)) КАК ЗапланированнаяПредварительнаяЗапись,
		|	ЕСТЬNULL(ТаблицаПоследнихНеВыполненныхЗадач.ПоследняяНеВыполненная, ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)) КАК ЗапланированнаяЗадача,
		|	ЕСТЬNULL(ТаблицаПоследнихВыполненныхЗадач.ПоследняяВыполненная, ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)) КАК ПоследняяЗадача
		|ИЗ
		|	СтартоваяТаблицаСделокПациента КАК СтартоваяТаблицаСделокПациента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПорядковыхНомеровСделокПоПациенту КАК ТаблицаПорядковыхНомеровСделокПоПациенту
		|		ПО СтартоваяТаблицаСделокПациента.Сделка = ТаблицаПорядковыхНомеровСделокПоПациенту.Сделка
		|			И СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница = ТаблицаПорядковыхНомеровСделокПоПациенту.СтруктурнаяЕдиница
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПорядковыхНомеровСделокПоВрачу КАК ТаблицаПорядковыхНомеровСделокПоВрачу
		|		ПО СтартоваяТаблицаСделокПациента.Сделка = ТаблицаПорядковыхНомеровСделокПоВрачу.Сделка
		|			И СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница = ТаблицаПорядковыхНомеровСделокПоВрачу.СтруктурнаяЕдиница
		|			И СтартоваяТаблицаСделокПациента.Врач = ТаблицаПорядковыхНомеровСделокПоВрачу.Врач
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЗапланированныхПредварительныхЗаписей КАК ТаблицаЗапланированныхПредварительныхЗаписей
		|		ПО СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница = ТаблицаЗапланированныхПредварительныхЗаписей.СтруктурнаяЕдиница
		|			И СтартоваяТаблицаСделокПациента.Сделка = ТаблицаЗапланированныхПредварительныхЗаписей.Сделка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПоследнихВыполненныхЗадач КАК ТаблицаПоследнихВыполненныхЗадач
		|		ПО СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница = ТаблицаПоследнихВыполненныхЗадач.СтруктурнаяЕдиница
		|			И СтартоваяТаблицаСделокПациента.Сделка = ТаблицаПоследнихВыполненныхЗадач.Сделка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПоследнихНеВыполненныхЗадач КАК ТаблицаПоследнихНеВыполненныхЗадач
		|		ПО СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница = ТаблицаПоследнихНеВыполненныхЗадач.СтруктурнаяЕдиница
		|			И СтартоваяТаблицаСделокПациента.Сделка = ТаблицаПоследнихНеВыполненныхЗадач.Сделка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер";
		
		ТаблицаСведений = Запрос.Выполнить().Выгрузить();
		
		Если МетаданныеРегистра = Неопределено Тогда 
			МетаданныеРегистра 		= Метаданные.РегистрыСведений.СделкиСведенияДляСписка;
			ПредставлениеРегистра 	= МетаданныеРегистра.Представление();
		КонецЕсли;
		
		Для Каждого СтрокаСведения Из ТаблицаСведений Цикл 
			НаборЗаписей = РегистрыСведений.СделкиСведенияДляСписка.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Сделка.Установить(СтрокаСведения.Сделка);
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), СтрокаСведения);
			Попытка
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);			
			Исключение
				ШаблонКомментария = НСтр("ru = 'Не удалось обновить сведения сделки ""%1"" в регистре ""%2""
				|по причине: %3'");
				
				Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонКомментария,
				Строка(СтрокаСведения.Сделка),
				ПредставлениеРегистра,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				МетаданныеРегистра,
				СтрокаСведения.Сделка,
				Комментарий);
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

// Процедура - Актуализировать сведения для списка
//
// Параметры:
//  Контрагент		 - 	 - 
//  ИсключаемыйПрием - 	 - 
//
Процедура АктуализироватьСведенияДляСписка(Сделка, Пациент = Неопределено, ИсключаемыйПрием = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Сделка) ИЛИ НЕ ТипЗнч(Сделка) = Тип("СправочникСсылка.Сделки") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Пациент) Тогда 
		Пациент = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Сделка, "Контрагент");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Пациент) Тогда 
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пациент", Пациент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сделки.Ссылка КАК Сделка,
	|	Сделки.ВидСделки КАК ВидСделки,
	|	Сделки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Сделки.Контрагент КАК Пациент,
	|	Сделки.ДатаСделки КАК ДатаСделки,
	|	Сделки.ДатаЗавершенияСделки КАК ДатаЗавершенияСделки,
	|	Сделки.Врач КАК Врач,
	|	Сделки.РезультатСделки КАК РезультатСделки,
	|	Сделки.ЭтапСделки КАК ЭтапСделки,
	|	Сделки.ЭтапУспеха КАК ЭтапУспеха,
	|	Сделки.ЭтапОтказа КАК ЭтапОтказа,
	|	Сделки.Предопределенный КАК Предопределенный,
	|	Сделки.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ПОМЕСТИТЬ СтартоваяТаблицаСделокПациента
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.Контрагент = &Пациент
	|	И НЕ Сделки.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(СтартоваяТаблицаСделокПациента1.Сделка) КАК НомерПоПорядку,
	|	СтартоваяТаблицаСделокПациента.Сделка КАК Сделка,
	|	СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СтартоваяТаблицаСделокПациента.Врач КАК Врач
	|ПОМЕСТИТЬ ТаблицаПорядковыхНомеровСделокПоПациенту
	|ИЗ
	|	СтартоваяТаблицаСделокПациента КАК СтартоваяТаблицаСделокПациента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтартоваяТаблицаСделокПациента КАК СтартоваяТаблицаСделокПациента1
	|		ПО СтартоваяТаблицаСделокПациента.Пациент = СтартоваяТаблицаСделокПациента1.Пациент
	|			И СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница = СтартоваяТаблицаСделокПациента1.СтруктурнаяЕдиница
	|			И СтартоваяТаблицаСделокПациента.ДатаЗавершенияСделки >= СтартоваяТаблицаСделокПациента1.ДатаЗавершенияСделки
	|			И (ВЫБОР
	|				КОГДА СтартоваяТаблицаСделокПациента.ДатаЗавершенияСделки = СтартоваяТаблицаСделокПациента1.ДатаЗавершенияСделки
	|					ТОГДА СтартоваяТаблицаСделокПациента.ДатаСделки >= СтартоваяТаблицаСделокПациента1.ДатаСделки
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтартоваяТаблицаСделокПациента.Сделка,
	|	СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница,
	|	СтартоваяТаблицаСделокПациента.Врач
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(СтартоваяТаблицаСделокПациента1.Сделка) КАК НомерПоПорядку,
	|	СтартоваяТаблицаСделокПациента.Сделка КАК Сделка,
	|	СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СтартоваяТаблицаСделокПациента.Врач КАК Врач
	|ПОМЕСТИТЬ ТаблицаПорядковыхНомеровСделокПоВрачу
	|ИЗ
	|	СтартоваяТаблицаСделокПациента КАК СтартоваяТаблицаСделокПациента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтартоваяТаблицаСделокПациента КАК СтартоваяТаблицаСделокПациента1
	|		ПО СтартоваяТаблицаСделокПациента.Пациент = СтартоваяТаблицаСделокПациента1.Пациент
	|			И СтартоваяТаблицаСделокПациента.Врач = СтартоваяТаблицаСделокПациента1.Врач
	|			И СтартоваяТаблицаСделокПациента.ДатаЗавершенияСделки >= СтартоваяТаблицаСделокПациента1.ДатаЗавершенияСделки
	|			И (ВЫБОР
	|				КОГДА СтартоваяТаблицаСделокПациента.ДатаЗавершенияСделки = СтартоваяТаблицаСделокПациента1.ДатаЗавершенияСделки
	|					ТОГДА СтартоваяТаблицаСделокПациента.ДатаСделки >= СтартоваяТаблицаСделокПациента1.ДатаСделки
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтартоваяТаблицаСделокПациента.Сделка,
	|	СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница,
	|	СтартоваяТаблицаСделокПациента.Врач
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументСобытие.Дата КАК Дата,
	|	ДокументСобытие.Ссылка КАК ПредварительнаяЗапись,
	|	ДокументСобытие.Контрагент КАК Контрагент,
	|	ДокументСобытие.Сделка КАК Сделка,
	|	ДокументСобытие.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ТаблицаПредварительныхЗаписейПоСделкам
	|ИЗ
	|	Документ.Событие КАК ДокументСобытие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтартоваяТаблицаСделокПациента КАК СтартоваяТаблицаСделокПациента
	|		ПО ДокументСобытие.СтруктурнаяЕдиница = СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница
	|			И ДокументСобытие.Сделка = СтартоваяТаблицаСделокПациента.Сделка
	|			И (ДокументСобытие.Проведен)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взаимодействие.Ссылка КАК Задача,
	|	ВЫБОР
	|		КОГДА Взаимодействие.ЗадачаНазначеннаяДатаНачало <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Взаимодействие.ЗадачаНазначеннаяДатаНачало
	|		ИНАЧЕ Взаимодействие.ЗадачаНазначеннаяДата
	|	КОНЕЦ КАК ДатаНазначенная,
	|	Взаимодействие.Выполнена КАК Выполнена,
	|	Взаимодействие.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Взаимодействие.Сделка КАК Сделка
	|ПОМЕСТИТЬ ТаблицаЗадачПоСделкам
	|ИЗ
	|	Задача.Взаимодействие КАК Взаимодействие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтартоваяТаблицаСделокПациента КАК СтартоваяТаблицаСделокПациента
	|		ПО Взаимодействие.СтруктурнаяЕдиница = СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница
	|			И Взаимодействие.Сделка = СтартоваяТаблицаСделокПациента.Сделка
	|			И (НЕ Взаимодействие.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаПредварительныхЗаписейПоСделкам.ПредварительнаяЗапись) КАК ЗапланированнаяПредварительнаяЗапись,
	|	ТаблицаПредварительныхЗаписейПоСделкам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаПредварительныхЗаписейПоСделкам.Сделка КАК Сделка
	|ПОМЕСТИТЬ ТаблицаЗапланированныхПредварительныхЗаписей
	|ИЗ
	|	ТаблицаПредварительныхЗаписейПоСделкам КАК ТаблицаПредварительныхЗаписейПоСделкам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(ТаблицаПредварительныхЗаписейПоСделкам.Дата) КАК Дата,
	|			ТаблицаПредварительныхЗаписейПоСделкам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|			ТаблицаПредварительныхЗаписейПоСделкам.Сделка КАК Сделка
	|		ИЗ
	|			ТаблицаПредварительныхЗаписейПоСделкам КАК ТаблицаПредварительныхЗаписейПоСделкам
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТаблицаПредварительныхЗаписейПоСделкам.СтруктурнаяЕдиница,
	|			ТаблицаПредварительныхЗаписейПоСделкам.Сделка) КАК ЗапланированнаяПредварительнаяЗаписьПоСделке
	|		ПО ТаблицаПредварительныхЗаписейПоСделкам.СтруктурнаяЕдиница = ЗапланированнаяПредварительнаяЗаписьПоСделке.СтруктурнаяЕдиница
	|			И ТаблицаПредварительныхЗаписейПоСделкам.Сделка = ЗапланированнаяПредварительнаяЗаписьПоСделке.Сделка
	|			И ТаблицаПредварительныхЗаписейПоСделкам.Дата = ЗапланированнаяПредварительнаяЗаписьПоСделке.Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПредварительныхЗаписейПоСделкам.СтруктурнаяЕдиница,
	|	ТаблицаПредварительныхЗаписейПоСделкам.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаЗадачПоСделкам.Задача) КАК ПоследняяВыполненная,
	|	ТаблицаЗадачПоСделкам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗадачПоСделкам.Сделка КАК Сделка
	|ПОМЕСТИТЬ ТаблицаПоследнихВыполненныхЗадач
	|ИЗ
	|	ТаблицаЗадачПоСделкам КАК ТаблицаЗадачПоСделкам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(ТаблицаЗадачПоСделкам.ДатаНазначенная) КАК ДатаНазначенная,
	|			ТаблицаЗадачПоСделкам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|			ТаблицаЗадачПоСделкам.Сделка КАК Сделка
	|		ИЗ
	|			ТаблицаЗадачПоСделкам КАК ТаблицаЗадачПоСделкам
	|		ГДЕ
	|			ТаблицаЗадачПоСделкам.Выполнена
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТаблицаЗадачПоСделкам.СтруктурнаяЕдиница,
	|			ТаблицаЗадачПоСделкам.Сделка) КАК ПоследняяВыполненнаяЗадача
	|		ПО ТаблицаЗадачПоСделкам.СтруктурнаяЕдиница = ПоследняяВыполненнаяЗадача.СтруктурнаяЕдиница
	|			И ТаблицаЗадачПоСделкам.Сделка = ПоследняяВыполненнаяЗадача.Сделка
	|			И ТаблицаЗадачПоСделкам.ДатаНазначенная = ПоследняяВыполненнаяЗадача.ДатаНазначенная
	|			И (ТаблицаЗадачПоСделкам.Выполнена)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗадачПоСделкам.СтруктурнаяЕдиница,
	|	ТаблицаЗадачПоСделкам.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаЗадачПоСделкам.Задача) КАК ПоследняяНеВыполненная,
	|	ТаблицаЗадачПоСделкам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗадачПоСделкам.Сделка КАК Сделка
	|ПОМЕСТИТЬ ТаблицаПоследнихНеВыполненныхЗадач
	|ИЗ
	|	ТаблицаЗадачПоСделкам КАК ТаблицаЗадачПоСделкам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(ТаблицаЗадачПоСделкам.ДатаНазначенная) КАК ДатаНазначенная,
	|			ТаблицаЗадачПоСделкам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|			ТаблицаЗадачПоСделкам.Сделка КАК Сделка
	|		ИЗ
	|			ТаблицаЗадачПоСделкам КАК ТаблицаЗадачПоСделкам
	|		ГДЕ
	|			НЕ ТаблицаЗадачПоСделкам.Выполнена
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТаблицаЗадачПоСделкам.СтруктурнаяЕдиница,
	|			ТаблицаЗадачПоСделкам.Сделка) КАК ПоследняяНеВыполненнаяЗадача
	|		ПО ТаблицаЗадачПоСделкам.СтруктурнаяЕдиница = ПоследняяНеВыполненнаяЗадача.СтруктурнаяЕдиница
	|			И ТаблицаЗадачПоСделкам.Сделка = ПоследняяНеВыполненнаяЗадача.Сделка
	|			И ТаблицаЗадачПоСделкам.ДатаНазначенная = ПоследняяНеВыполненнаяЗадача.ДатаНазначенная
	|			И (НЕ ТаблицаЗадачПоСделкам.Выполнена)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗадачПоСделкам.СтруктурнаяЕдиница,
	|	ТаблицаЗадачПоСделкам.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтартоваяТаблицаСделокПациента.Сделка КАК Сделка,
	|	СтартоваяТаблицаСделокПациента.ВидСделки КАК ВидСделки,
	|	ТаблицаПорядковыхНомеровСделокПоПациенту.НомерПоПорядку КАК Номер,
	|	ТаблицаПорядковыхНомеровСделокПоВрачу.НомерПоПорядку = 1 КАК ПерваяДляВрача,
	|	ЕСТЬNULL(ТаблицаЗапланированныхПредварительныхЗаписей.ЗапланированнаяПредварительнаяЗапись, ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка)) КАК ЗапланированнаяПредварительнаяЗапись,
	|	ЕСТЬNULL(ТаблицаПоследнихНеВыполненныхЗадач.ПоследняяНеВыполненная, ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)) КАК ЗапланированнаяЗадача,
	|	ЕСТЬNULL(ТаблицаПоследнихВыполненныхЗадач.ПоследняяВыполненная, ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)) КАК ПоследняяЗадача
	|ИЗ
	|	СтартоваяТаблицаСделокПациента КАК СтартоваяТаблицаСделокПациента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПорядковыхНомеровСделокПоПациенту КАК ТаблицаПорядковыхНомеровСделокПоПациенту
	|		ПО СтартоваяТаблицаСделокПациента.Сделка = ТаблицаПорядковыхНомеровСделокПоПациенту.Сделка
	|			И СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница = ТаблицаПорядковыхНомеровСделокПоПациенту.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПорядковыхНомеровСделокПоВрачу КАК ТаблицаПорядковыхНомеровСделокПоВрачу
	|		ПО СтартоваяТаблицаСделокПациента.Сделка = ТаблицаПорядковыхНомеровСделокПоВрачу.Сделка
	|			И СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница = ТаблицаПорядковыхНомеровСделокПоВрачу.СтруктурнаяЕдиница
	|			И СтартоваяТаблицаСделокПациента.Врач = ТаблицаПорядковыхНомеровСделокПоВрачу.Врач
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЗапланированныхПредварительныхЗаписей КАК ТаблицаЗапланированныхПредварительныхЗаписей
	|		ПО СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница = ТаблицаЗапланированныхПредварительныхЗаписей.СтруктурнаяЕдиница
	|			И СтартоваяТаблицаСделокПациента.Сделка = ТаблицаЗапланированныхПредварительныхЗаписей.Сделка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПоследнихВыполненныхЗадач КАК ТаблицаПоследнихВыполненныхЗадач
	|		ПО СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница = ТаблицаПоследнихВыполненныхЗадач.СтруктурнаяЕдиница
	|			И СтартоваяТаблицаСделокПациента.Сделка = ТаблицаПоследнихВыполненныхЗадач.Сделка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПоследнихНеВыполненныхЗадач КАК ТаблицаПоследнихНеВыполненныхЗадач
	|		ПО СтартоваяТаблицаСделокПациента.СтруктурнаяЕдиница = ТаблицаПоследнихНеВыполненныхЗадач.СтруктурнаяЕдиница
	|			И СтартоваяТаблицаСделокПациента.Сделка = ТаблицаПоследнихНеВыполненныхЗадач.Сделка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер";
		
	ТаблицаСведений = Запрос.Выполнить().Выгрузить();

	МетаданныеРегистра 		= Неопределено;
	ПредставлениеРегистра 	= Неопределено;
	
	Для Каждого СтрокаСведения Из ТаблицаСведений Цикл 
		НаборЗаписей = РегистрыСведений.СделкиСведенияДляСписка.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сделка.Установить(СтрокаСведения.Сделка);
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), СтрокаСведения);
		Попытка
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
		Исключение
			Если МетаданныеРегистра = Неопределено Тогда 
				МетаданныеРегистра 		= Метаданные.РегистрыСведений.СделкиСведенияДляСписка;
				ПредставлениеРегистра 	= МетаданныеРегистра.Представление();
			КонецЕсли;	
			ШаблонКомментария = НСтр("ru = 'Не удалось обновить сведения сделки ""%1"" в регистре ""%2""
			|по причине: %3'");
			
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонКомментария,
			СтрокаСведения.Сделка,
			ПредставлениеРегистра,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление сведений для сделок в регистре'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			МетаданныеРегистра,
			СтрокаСведения.Сделка,
			Комментарий);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
