
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ПАРАМЕТРЫ ПЕРЕДАВАЕМЫЕ ФОРМЕ
	
	// ЭтаФорма.Заголовок          = Параметры.Заголовок;		
	
	Параметры.Свойство("Сегмент"                                ,ОтборСегмент); 
	Параметры.Свойство("СтруктурнаяЕдиница"                     ,ОтборСтруктурнаяЕдиница);
	Параметры.Свойство("ВидЦен"                                 ,ОтборВидЦен);
	Параметры.Свойство("Дата"                                   ,ОтборДата);
	
	ОтборСтруктурнаяЕдиница            = ?(НЕ ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница), ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница,ОтборСтруктурнаяЕдиница);
    ОтборДата                          = ?(НЕ ЗначениеЗаполнено(ОтборДата), ТекущаяДата(),ОтборДата);	
	
	// Если не был передан вид цен, брать его по умолчанию
	Если НЕ ЗначениеЗаполнено(ОтборВидЦен) И ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница.ВидЦенРеализации) Тогда	
		ОтборВидЦен	= ОтборСтруктурнаяЕдиница.ВидЦенРеализации;	
	ИначеЕсли НЕ ЗначениеЗаполнено(ОтборВидЦен) И НЕ ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница.ВидЦенРеализации) Тогда	
		ОтборВидЦен	= Справочники.ВидыЦен.Розничная;
	КонецЕсли;
	
			
КонецПроцедуры 

&НаКлиенте
// Обработчик открытия формы на клиенте
Процедура ПриОткрытии(Отказ)
	
	ОтображатьДеревом = НЕ ОтображатьДеревом;
	ВидОтображенияУстановить(Неопределено);
	
	ДеревоРазвернуто = НЕ ДеревоРазвернуто;
	РазвернутьДерево(Неопределено);
	
	Элементы.Список.ТекущаяСтрока = ИдентификаторЭлементаСтартовойФокусировки;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура строит дерево номенклатур
Процедура ЗаполнитьСписокНоменклатур(ВыводитьДеревом)
	
	ВыборкаГрупп = Неопределено;
	
	Если ВыводитьДеревом Тогда
		
		ЗапросГрупп = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ИСТИНА
		|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ");
		
		ВыборкаГрупп = ЗапросГрупп.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);	
		
	КонецЕсли;
     
	// Отбираем номенклатуру по нужным параметрам
	ВыборкаНоменклатур = Справочники.Номенклатура.ОтборНоменклатурЗубнаяФормула(ОтборДата,ОтборСтруктурнаяЕдиница,ОтборСегмент,ОтборВидЦен);	
	// ВыборкаНоменклатур = "";
	Список.ПолучитьЭлементы().Очистить();
	
	Если ВыводитьДеревом Тогда
		
		СтроимДерево(ВыборкаГрупп,Список,ВыборкаНоменклатур);	
		// Вывести элементы не находящиеся ни в одной из групп
		НоменклатураБезГрупп = ВыборкаНоменклатур.НайтиСтроки(Новый Структура("Родитель",Справочники.Номенклатура.ПустаяСсылка()));	
		
	Иначе
		НоменклатураБезГрупп = ВыборкаНоменклатур;
	КонецЕсли;
	
    Для Каждого СтрокаНоменклатуры ИЗ НоменклатураБезГрупп Цикл
		
		НоваяСтрока                  = Список.ПолучитьЭлементы().Добавить();
		НоваяСтрока.Артикул     	 = СтрокаНоменклатуры.Артикул;
		НоваяСтрока.Номенклатура     = СтрокаНоменклатуры.Номенклатура;
		НоваяСтрока.ЕдиницаИзмерения = СтрокаНоменклатуры.ЕдиницаИзмерения;
		НоваяСтрока.Цена             = СтрокаНоменклатуры.Цена;
		НоваяСтрока.ИндКартинки      = СтрокаНоменклатуры.ИндКартинки;
		НоваяСтрока.НормаВремени     = СтрокаНоменклатуры.НормаВремени;
		НайденныйЭлемент = СписокВыбранныхЗначений.НайтиПоЗначению(НоваяСтрока.Номенклатура);
		Если НайденныйЭлемент <> Неопределено Тогда
			НоваяСтрока.Флаг = Истина; 
		КонецЕсли;			
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
// Процедура строить дерево номенклатур
Процедура СтроимДерево(ВыборкаСсылка,РодительСтроки,ВыбокаНоменклатур)
	
	Для Каждого СтрокаДерева ИЗ ВыборкаСсылка.Строки Цикл
		
		НоваяСтрокаГруппы              = РодительСтроки.ПолучитьЭлементы().Добавить();
		НоваяСтрокаГруппы.Номенклатура = СтрокаДерева.Ссылка;		
		НоваяСтрокаГруппы.ЭтоГруппа    = Истина;		
		СтроимДерево(СтрокаДерева,НоваяСтрокаГруппы,ВыбокаНоменклатур);
		
		НоменклатураПоРодителю = ВыбокаНоменклатур.НайтиСтроки(Новый Структура("Родитель",СтрокаДерева.Ссылка));
		
		// Удаляем узел группы если он не содержит элементы
		Если НоменклатураПоРодителю.Количество() = 0 И НоваяСтрокаГруппы.ПолучитьЭлементы().Количество() = 0 Тогда
			РодительСтроки.ПолучитьЭлементы().Удалить(НоваяСтрокаГруппы);
		КонецЕсли;
		
		// Заполняем номенклатуры
		Для А = 0 По НоменклатураПоРодителю.Количество() - 1 Цикл
			
			НоваяСтрока                  = НоваяСтрокаГруппы.ПолучитьЭлементы().Добавить();
			НоваяСтрока.Артикул     	 = НоменклатураПоРодителю[А].Артикул;
			НоваяСтрока.Номенклатура     = НоменклатураПоРодителю[А].Номенклатура;
			НоваяСтрока.ЕдиницаИзмерения = НоменклатураПоРодителю[А].ЕдиницаИзмерения;
			НоваяСтрока.Цена             = НоменклатураПоРодителю[А].Цена;
			НоваяСтрока.ИндКартинки      = НоменклатураПоРодителю[А].ИндКартинки;
			НоваяСтрока.НормаВремени     = НоменклатураПоРодителю[А].НормаВремени;
			
			Если ЗначениеЗаполнено(НоменклатураНачальногоПозиционирования) И НоменклатураНачальногоПозиционирования = НоваяСтрока.Номенклатура Тогда
				
				ИдентификаторЭлементаСтартовойФокусировки = НоваяСтрока.ПолучитьИдентификатор();
				Элементы.Список.ТекущаяСтрока             = ИдентификаторЭлементаСтартовойФокусировки;
				
			КонецЕсли;	
			
			НайденныйЭлемент = СписокВыбранныхЗначений.НайтиПоЗначению(НоваяСтрока.Номенклатура);
			Если НайденныйЭлемент <> Неопределено Тогда
				НоваяСтрока.Флаг = Истина;
			    ВыделитьРодителяНаСервере(НоваяСтрока);
			КонецЕсли;	
			
		КонецЦикла;

	КонецЦикла;	 
		
КонецПроцедуры

&НаКлиенте
// Обработчик команды развернуть/свернуть дерево
Процедура РазвернутьДерево(Команда)
	
	ДеревоРазвернуто                  = НЕ ДеревоРазвернуто;
	Элементы.Список.ТекущийЭлемент    = Неопределено;
	Элементы.Список.ТекущаяСтрока     = Неопределено;
	
	Если ДеревоРазвернуто Тогда
		ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы.Список,Список);
	Иначе
		
		ЗаполнитьСписокНоменклатур(ОтображатьДеревом);

	КонецЕсли;

	Элементы.РазвренутьДерево.Картинка  = ?(ДеревоРазвернуто, БиблиотекаКартинок.СвернутьВсе, БиблиотекаКартинок.РазвернутьВсе);
	Элементы.РазвренутьДерево.Заголовок = ?(ДеревоРазвернуто,"Свернуть все","Развернуть все");
		
КонецПроцедуры
                              
&НаКлиенте
// Обработчик установки видо отображения
Процедура ВидОтображенияУстановить(Команда)
	
	ОтображатьДеревом                   = НЕ ОтображатьДеревом;
	Элементы.Список.Отображение         = ?(ОтображатьДеревом,ОтображениеТаблицы.Дерево,ОтображениеТаблицы.Список);
    Элементы.ВидОтображения.Картинка    = ?(ОтображатьДеревом, БиблиотекаКартинок.РежимПросмотраСпискаСписок, БиблиотекаКартинок.РежимПросмотраСпискаДерево);
	Элементы.ВидОтображения.Заголовок   = ?(ОтображатьДеревом,"Список","Дерево");	
	Элементы.РазвренутьДерево.Видимость = ОтображатьДеревом;
	
	ЗаполнитьСписокНоменклатур(ОтображатьДеревом);
	
	Если Команда <> Неопределено Тогда
		
		ДеревоРазвернуто = НЕ ДеревоРазвернуто;
		РазвернутьДерево(Неопределено);
		
	КонецЕсли;	
		
	Элементы.Список.ТекущаяСтрока = ИдентификаторЭлементаСтартовойФокусировки;
	
КонецПроцедуры



&НаКлиенте
// Процедура обработчик команды выбора номенклатуры с закрытием формы подбора.
//
Процедура ВыбратьИЗакрыть(Команда) 	
	
	ЭтаФорма.Закрыть(СписокВыбранныхЗначений.ВыгрузитьЗначения());
	
КонецПроцедуры


&НаКлиенте
// Процедура, обработчик события "ПриИзмененииы"
//
Процедура БольшеНеПоказыватьПриИзменении(Элемент)
	
	Оповестить("ФлагПодбора", БольшеНеПоказывать);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "Выбор"
//
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаТЧ = Элемент.ТекущиеДанные;
	Если Не СтрокаТЧ = Неопределено и Не ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТЧ.Номенклатура, "ЭтоГруппа") Тогда
		МассивВозврата = Новый Массив;
		МассивВозврата.Добавить(СтрокаТЧ.Номенклатура);
		ЭтаФорма.Закрыть(МассивВозврата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура СписокПриИзменении(Элемент)
	
	Если Не Элемент.ТекущиеДанные = Неопределено и  Элемент.ТекущиеДанные.ЭтоГруппа Тогда		
		ВыделитьПодчиненныеЭлементы(Элемент.ТекущиеДанные, ?(Элемент.ТекущиеДанные.Флаг = 2, 0, 1));
		ВыделитьРодителя(Элемент.ТекущиеДанные,  Элемент.ТекущиеДанные.Флаг);
	ИначеЕсли  Не Элемент.ТекущиеДанные = Неопределено Тогда
		Если  Элемент.ТекущиеДанные.Флаг Тогда
			СписокВыбранныхЗначений.Добавить(Элемент.ТекущиеДанные.Номенклатура);
		Иначе
			НайденныйЭлемент = СписокВыбранныхЗначений.НайтиПоЗначению( Элемент.ТекущиеДанные.Номенклатура);
			Если НайденныйЭлемент <> Неопределено Тогда
				СписокВыбранныхЗначений.Удалить(НайденныйЭлемент);
			КонецЕсли;			
		КонецЕсли;
		Элемент.ТекущиеДанные.Флаг = ?(Элемент.ТекущиеДанные.Флаг = 2, 0, 1);
		ВыделитьРодителя(Элемент.ТекущиеДанные,  Элемент.ТекущиеДанные.Флаг);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Функция, выполняет установку флагов
//
Функция ВыделитьПодчиненныеЭлементы(СтрокаДерева, Флаг)
	
	СтрокаДерева.Флаг = Флаг;
	Если СтрокаДерева.ЭтоГруппа Тогда
		Для Каждого СтрокаТЧ из СтрокаДерева.ПолучитьЭлементы() Цикл
			ВыделитьПодчиненныеЭлементы(СтрокаТЧ, Флаг);			
		КонецЦикла;
	Иначе
		Если Флаг Тогда
			СписокВыбранныхЗначений.Добавить(СтрокаДерева.Номенклатура);
		Иначе
			НайденныйЭлемент = СписокВыбранныхЗначений.НайтиПоЗначению(СтрокаДерева.Номенклатура);
			Если НайденныйЭлемент <> Неопределено Тогда
				СписокВыбранныхЗначений.Удалить(НайденныйЭлемент);
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Процедура, выполняет выделение родителя
//
Процедура ВыделитьРодителя(СтрокаДерева, Флаг)
	
	Родитель = СтрокаДерева.ПолучитьРодителя();
	Если Не Родитель = Неопределено Тогда
		СтрокиРодителя = Родитель.ПолучитьЭлементы();
		Количество = 0;
		КоличествоВыделенных = 0;
		Для Каждого СтрокаТЧ из СтрокиРодителя Цикл
			Если СтрокаТЧ.Флаг Тогда
				КоличествоВыделенных = КоличествоВыделенных + 1;
			КонецЕсли;
			Количество = Количество + 1;
		КонецЦикла;	
		Если Количество <> 0 и Количество = КоличествоВыделенных Тогда			
			Родитель.Флаг = Флаг;
			ВыделитьРодителя(Родитель, Флаг);
		ИначеЕсли  КоличествоВыделенных <> 0 и Количество > КоличествоВыделенных Тогда
			Родитель.Флаг = 2;
			ВыделитьРодителя(Родитель, Флаг);
		Иначе
            Родитель.Флаг = Флаг;
			ВыделитьРодителя(Родитель, Флаг);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет выделение родителя
//
Процедура ВыделитьРодителяНаСервере(СтрокаДерева)
	
	Родитель = СтрокаДерева.ПолучитьРодителя();
	Если Не Родитель = Неопределено Тогда
		Родитель.Флаг = Истина;
		ВыделитьРодителяНаСервере(Родитель);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти