
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТипВнешнейСистемы				 = Перечисления.ТипыВнешнихСистем.Calltouch;
		Объект.КлючПриложения					 = Строка(Новый УникальныйИдентификатор);
		Элементы.ГруппаУдалить.Видимость 		 = Ложь;
		СформироватьНаименование();
	Иначе
		ПараметрыВнешнейСистемы = Объект.Ссылка.Параметры.Получить();
		Если ЗначениеЗаполнено(ПараметрыВнешнейСистемы) И ТипЗнч(ПараметрыВнешнейСистемы) = Тип("Структура") Тогда
			ПараметрыВнешнейСистемы.Свойство("ApiToken"	, ЭтотОбъект.ApiToken);
			ПараметрыВнешнейСистемы.Свойство("UrlApi"	, ЭтотОбъект.UrlApi);
		КонецЕсли;
	КонецЕсли;
	
	ЭтотОбъект.Webhook = "https://cloud.stoma1c.ru/api/hs/mas/Calltouch/" + Объект.КлючПриложения;
	
	УидСессии = ЛичныйКабинет.УидТекущейСессии();
	ЭтоОблако = ПараметрыСеанса.ОбластьДанныхИспользование;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПриЧтенииНаСервере".
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьОтображениеЭлементов(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЭтотОбъект.UrlApi = "" Или ЭтотОбъект.ApiToken = "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поля ""Сервер"" и ""Токен"" обязательны для заполнения.",,,, Отказ);
	КонецЕсли;
	
	ПроверитьНастройкиЛичногоКабинетаПередЗаписью(Отказ);
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПередЗаписьюНаСервере".
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьПараметрыВнешнейСистемы(ТекущийОбъект);
	
	Справочники.ВнешниеСистемы.ПодключитьВнешнююСистему(РеквизитФормыВЗначение("Объект"), Отказ, УИДСессии);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеЗаписи".
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписанаВнешняяСистема", Новый Структура("ВнешняяСистема, ТипВнешнейСистемы", Объект.Ссылка, Объект.ТипВнешнейСистемы));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура КомандаПодключить(Команда)
	
	ПодключитьВнешнююСистему();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура КомандаОтключить(Команда)
	
	ЗадатьВопросОЗаписиДанных();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ПоказатьИнструкцию(Команда)
	
	Элементы.ПоказатьИнструкцию.Пометка = Не Элементы.ПоказатьИнструкцию.Пометка;
	Элементы.ГруппаИнструкция.Видимость = Элементы.ПоказатьИнструкцию.Пометка;
	
КонецПроцедуры

&НаКлиенте
// Процедура, копирует URL.
//
Процедура СкопироватьURL(Команда)
	
	ОбщегоНазначенияКлиент.УстановитьТекстВБуферОбмена(ЭтотОбъект.Webhook);	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Скопировано'; en = 'Copied'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура, задает вопрос о записи объекта.
//
Процедура ЗадатьВопросОЗаписиДанных()
	
	Если ЭтотОбъект.Модифицированность Тогда
		ТекстВопроса = НСтр("ru='Для отключения внешней системы необходимо записать внесенные изменения. Записать данные?'");
	Иначе
		ТекстВопроса = СтрШаблон(НСтр("ru = 'Внешняя система %1 будет отключена. Продолжить?'"), Объект.Наименование);
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОЗаписиДанных", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик асинхронного события.
//
Процедура ПослеВопросаОЗаписиДанных(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЭтотОбъект.Модифицированность = Ложь;
		Объект.Используется = Ложь;
		Если Записать() Тогда
			Прочитать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, выставляет признак использования и записывает внешнюю систему.
//
Процедура ПодключитьВнешнююСистему()
	
	ЭтотОбъект.Модифицированность = Ложь;
	Объект.Используется = Истина;
	Если Записать() Тогда
		Прочитать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет проверку перед записью объекта.
//
Процедура ПроверитьНастройкиЛичногоКабинетаПередЗаписью(Отказ)
	
	Если Не ЭтоОблако Тогда
		
		РезультатПроверки = ПроверитьПубликациюИнформационнойБазы();
		Если Не РезультатПроверки Тогда
			
			ИмяФормыОбработки = "Обработка.ЛичныйКабинет.Форма.ФормаНастройкиВнешнейПубликации";
			ОткрытьФорму(ИмяФормыОбработки,,ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
			Пояснение		 = НСтр("ru = 'Необходимо настроить внешнюю публикацию'");
			СтатусОповещения = СтатусОповещенияПользователя.Важное;
			ПоказатьОповещениеПользователя(,,Пояснение, БиблиотекаКартинок.Предупреждение32, СтатусОповещения);
			
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УидСессии) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОРегистрацииВЛК", ЭтотОбъект);
		ТекстВопроса = Нстр("ru = 'Необходимо авторизоваться в личном кабинете. Открыть личный кабинет?';
							|en = 'Is necessary to log in to your account. Open private cabinet?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ПослеВопросаОРегистрацииВЛК(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОткрытьФорму("Обработка.ЛичныйКабинет.Форма");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, проверяет публикацию информационной базы.
//
Функция ПроверитьПубликациюИнформационнойБазы()
	
	УстановитьСлужебногоПользователя();
	
	РезультатПроверки = ЛичныйКабинет.ПроверитьПубликациюВнешнейСистемы(Константы.ВнешняяПубликацияАдрес.Получить());
	
	Если РезультатПроверки.ВыполненоУспешно Тогда
		Возврат РезультатПроверки.ПубликацияВерна;  
	КонецЕсли;  
	
	Если НЕ (РезультатПроверки.ВыполненоУспешно И РезультатПроверки.ПубликацияВерна = Истина) Тогда    
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='При проверке публикации возникла ошибка: ';en='With checking publications originated mistake:'") + РезультатПроверки.ОписаниеОшибки);
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Процедура, устанавливает служебного пользователя.
//
Процедура УстановитьСлужебногоПользователя()
	
	Если НЕ ЗначениеЗаполнено(Константы.ВнешняяПубликацияПользователь.Получить()) Тогда
		
		СлужебныйПользователь = ПользователиСтоматология.СлужебныйПользовательAPI();
		
		Если НЕ ЗначениеЗаполнено(СлужебныйПользователь) Тогда
			
			СлужебныйПользователь = ПользователиСтоматология.СоздатьСлужебногоПользователяAPI();
			
		КонецЕсли;
		
		Константы.ВнешняяПубликацияПользователь.Установить(СлужебныйПользователь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет параметры внешней системы.
//
Процедура ЗаполнитьПараметрыВнешнейСистемы(ТекущийОбъект)
	
	ПараметрыВнешнейСистемы = Новый Структура;
	ПараметрыВнешнейСистемы.Вставить("UrlApi"	, ЭтотОбъект.UrlApi);
	ПараметрыВнешнейСистемы.Вставить("ApiToken"	, ЭтотОбъект.ApiToken);
	
	ТекущийОбъект.Параметры = Новый ХранилищеЗначения(ПараметрыВнешнейСистемы);
	
КонецПроцедуры

&НаСервере
// Процедура, устанавливает отображение кнопок при чтении формы.
//
Процедура УстановитьОтображениеЭлементов(ТекущийОбъект)
	
	Элементы.Наименование.Видимость		= Истина;
	Элементы.КлючПриложения.Видимость	= Истина;
	Элементы.ГруппаУправление.Видимость = Истина;
	
	Если ТекущийОбъект.ПометкаУдаления = Истина Тогда
		Элементы.ГруппаКнопкиУдалить.ЦветФона	= Новый Цвет(255, 200, 200);
		Элементы.КнопкаУдалить.Заголовок		= НСтр("ru = 'Удалена'");
	Иначе
		Элементы.ГруппаКнопкиУдалить.ЦветФона	= Новый Цвет(242, 242, 242);
		Элементы.КнопкаУдалить.Заголовок		= НСтр("ru = 'Удалить'");
	КонецЕсли;
	
	Элементы.ГруппаКнопкиПодключить.Видимость	= Не ТекущийОбъект.Используется;
	Элементы.ГруппаКнопкиОтключить.Видимость	= ТекущийОбъект.Используется;
	
КонецПроцедуры

// Процедура, формирует наименование.
//
Процедура СформироватьНаименование() 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВнешниеСистемы.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы = &ТипВнешнейСистемы");
	
	Запрос.УстановитьПараметр("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	
	ТаблицаВнешнихСистем = Запрос.Выполнить().Выгрузить();

	Объект.Наименование = Строка(Объект.ТипВнешнейСистемы) + ?(ТаблицаВнешнихСистем.Количество() > 1, "-" + Строка(ТаблицаВнешнихСистем.Количество()), ""); 
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СоздатьКлюч" 
//
Процедура СоздатьКлюч(Команда)
	
	Объект.КлючПриложения = Строка(Новый УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти
