
#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСДинамическимиМенюФормы

// Функция - Имя меню из элемента меню
//
// Параметры:
//  ИмяЭлементаМеню	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИмяМенюИзЭлементаМеню(ИмяЭлементаМеню) Экспорт	
	Возврат УправлениеИнтерфейсамиСервер.ИмяДинамическогоМенюФормыИзЭлемента(ИмяЭлементаМеню);
КонецФункции
																			
// Функция - Данные привязанные к элементу меню
//
// Параметры:
//  ИмяМеню			 - 	 - 
//  ИмяЭлементаМеню	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ДанныеПривязанныеКЭлементуДинамическогоМеню(Форма, ИмяЭлементаМеню) Экспорт	
	Возврат УправлениеИнтерфейсамиСервер.ДанныеПривязанныеКЭлементуДинамическогоМеню(Форма, ИмяЭлементаМеню);	
КонецФункции

// Функция - Это элемент быстрого выбора
//
// Параметры:
//  ИмяЭлементаМеню	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЭтоЭлементБыстрогоВыбора(ИмяЭлементаМеню) Экспорт
    Возврат СтрНайти(ИмяЭлементаМеню, "_ID_Еще") = 0;	
КонецФункции

// Функция - Имя реквизита по имени элемента
//
// Параметры:
//  ИмяЭлемента	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИмяРеквизитаДанныхПоИмениЭлемента(ИмяЭлемента) Экспорт
	Возврат СтрЗаменить(ИмяЭлемента, "Поле_", "");
КонецФункции

// Функция - Имя реквизита представления по имени элемента
//
// Параметры:
//  ИмяЭлемента	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИмяРеквизитаПредставленияПоИмениЭлемента(ИмяЭлемента) Экспорт
	Возврат СтрЗаменить(ИмяЭлемента, "Поле_", "") + "_Представление";
КонецФункции

// Процедура - Обработчик элемента начало выбора
//
// Параметры:
//  Форма				 - 	 - 
//  Элемент				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработчикЭлементаНачалоВыбора(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ТипПериода           = Сред(Элемент.Имя, СтрНайти(Элемент.Имя, "_Тип_") + 5);
	ТипПериода           = Лев(ТипПериода, СтрНайти(ТипПериода, "_") - 1);
	
	НачалоПериода = ТекущаяДата();
	
	Если НачалоПериода = '00010101' тогда
		НачалоПериода = ФункцииОтчетовКлиентСервер.НачалоПериодаОтчета("Перечисление.ДоступныеПериодыОтчета.День", ОбщегоНазначенияКлиент.ДатаСеанса());
	КонецЕсли;
	
	Если ТипПериода = "ВыборПериодаДень" Тогда
		ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.День");
	ИначеЕсли ТипПериода = "ВыборПериодаНеделя" Тогда
		ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Неделя");
	ИначеЕсли ТипПериода = "ВыборПериодаМесяц" Тогда
		ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц");
	КонецЕсли;
	
	// Выбор периода из выпадающего списка.
	РезультатВыбора = ВыбратьПериодИзВыпадающегоСписка(Форма, Элемент, ВидПериода, НачалоПериода, ВариантСтандартногоПериода.ПроизвольныйПериод, Неопределено);
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбраннаяДата = ФункцииОтчетовКлиентСервер.НачалоПериодаОтчета(ВидПериода, РезультатВыбора.Значение);
	Если ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.День") Тогда
		Форма[ИмяРеквизитаДанныхПоИмениЭлемента(Элемент.Имя)] = Новый СтандартныйПериод(ВыбраннаяДата, КонецДня(ВыбраннаяДата));  
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Неделя") Тогда                        
		Форма[ИмяРеквизитаДанныхПоИмениЭлемента(Элемент.Имя)] = Новый СтандартныйПериод(ВыбраннаяДата, КонецНедели(ВыбраннаяДата));
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц") Тогда
		Форма[ИмяРеквизитаДанныхПоИмениЭлемента(Элемент.Имя)] = Новый СтандартныйПериод(ВыбраннаяДата, КонецМесяца(ВыбраннаяДата));   
	КонецЕсли;   
	
	Форма[ИмяРеквизитаПредставленияПоИмениЭлемента(Элемент.Имя)] = РезультатВыбора.Представление;                                  
	
КонецПроцедуры

// Процедура - Обработчик кнопки переключения периода
//
// Параметры:
//  Форма	 - 	 - 
//  Команда	 - 	 - 
//
Процедура ОбработчикКнопкиПереключенияПериода(Форма, Команда) Экспорт
	
	ТипПериода           = Сред(Команда.Имя, СтрНайти(Команда.Имя, "_Тип_") + 5);
	ТипПериода           = Лев(ТипПериода, СтрНайти(ТипПериода, "_") - 1);
	
	ТипКнопки            = ?(СтрНайти(Команда.Имя, "КомандаНазад_ME") > 0, "Назад", "Вперед");
	
	ИмяРеквизитаДанных    = ?(ТипКнопки = "Назад",ИмяРеквизитаДанныхПоИмениЭлемента(СтрЗаменить(Команда.Имя, "КомандаНазад_","" )), ИмяРеквизитаДанныхПоИмениЭлемента(СтрЗаменить(Команда.Имя, "КомандаВперед_","" ))); 
    ИмяРеквизиатДанныПредставления = ИмяРеквизитаДанных + "_Представление";	
	ТекущийПериод        = Форма[ИмяРеквизитаДанных];
	
	Если ТипКнопки = "Назад" Тогда
		
		Если ТипПериода = "ВыборПериодаДень" Тогда
			
			Форма[ИмяРеквизитаДанных] = Новый СтандартныйПериод(ТекущийПериод.ДатаНачала - 86400, ТекущийПериод.ДатаОкончания - 86400);
 			
		ИначеЕсли ТипПериода = "ВыборПериодаНеделя" Тогда
			
			Форма[ИмяРеквизитаДанных] = Новый СтандартныйПериод(ТекущийПериод.ДатаНачала - 604800, ТекущийПериод.ДатаОкончания - 604800);

		ИначеЕсли ТипПериода = "ВыборПериодаМесяц" Тогда
			
			Форма[ИмяРеквизитаДанных] = Новый СтандартныйПериод(ДобавитьМесяц(ТекущийПериод.ДатаНачала, - 1), КонецМесяца(ДобавитьМесяц(ТекущийПериод.ДатаОкончания, -1)));

		КонецЕсли;		
	Иначе
		
		Если ТипПериода = "ВыборПериодаДень" Тогда
			
			Форма[ИмяРеквизитаДанных] = Новый СтандартныйПериод(ТекущийПериод.ДатаНачала + 86400, ТекущийПериод.ДатаОкончания + 86400);

		ИначеЕсли ТипПериода = "ВыборПериодаНеделя" Тогда
			
			Форма[ИмяРеквизитаДанных] = Новый СтандартныйПериод(ТекущийПериод.ДатаНачала + 604800, ТекущийПериод.ДатаОкончания + 604800);

		ИначеЕсли ТипПериода = "ВыборПериодаМесяц" Тогда
			
			Форма[ИмяРеквизитаДанных] = Новый СтандартныйПериод(ДобавитьМесяц(ТекущийПериод.ДатаНачала, 1), КонецМесяца(ДобавитьМесяц(ТекущийПериод.ДатаОкончания, 1)));
			
		КонецЕсли;	
	КонецЕсли;

	Если ТипПериода = "ВыборПериодаДень" Тогда
		
		Форма[ИмяРеквизиатДанныПредставления] = Формат(Форма[ИмяРеквизитаДанных].ДатаНачала,"ДФ='dd MMMM yyyy, dddd'");
			
	ИначеЕсли ТипПериода = "ВыборПериодаНеделя" Тогда
		
		Форма[ИмяРеквизиатДанныПредставления] = Строка(Форма[ИмяРеквизитаДанных]);
				
	ИначеЕсли ТипПериода = "ВыборПериодаМесяц" Тогда
		
		Форма[ИмяРеквизиатДанныПредставления] =  Формат(Форма[ИмяРеквизитаДанных].ДатаНачала,"ДФ='MMMM yyyy'" );
			
	КонецЕсли;
	
КонецПроцедуры

#Конецобласти

#Область ОбработчикиОтображенияПереключателей

// Процедура, изменяет видимость элементов переключателей.
//
Процедура ИзменитьАктивностьПереключателяФормы(
	АктивныйЭлемент    = Неопределено, 
	НеактивныеЭлементы = Неопределено, 
	Активировать       = Истина, 
	Форма              = Неопределено, 
	ЭлементФокуса      = Неопределено,
	ТемаОформления     = 1) Экспорт
	
	ЦветТекста              = Новый Цвет(77 , 77 , 77);  // Черный.
	ЦветТекстаАктивирован   = Новый Цвет(255, 255, 255); // Белый.
	ЦветТекстаНеАктивирован = Новый Цвет(192, 192, 192); // Серый.
	ЦветФона                = Новый Цвет(242, 242, 242); // Светло-серый.
	
	Если Не ЗначениеЗаполнено(ТемаОформления) ИЛИ ТемаОформления = 1 Тогда
		ЦветФонаАктивирован = Новый Цвет(25, 116, 206); // Синий.
		
	ИначеЕсли ТемаОформления = 2 Тогда
		ЦветФонаАктивирован = Новый Цвет(225, 40, 40); // Красный.
		
	ИначеЕсли ТемаОформления = 3 Тогда
		ЦветФонаАктивирован	  = Новый Цвет(242, 242, 242); // Светло-серый.
		ЦветФона			  = Новый Цвет(255, 255, 255);
		ЦветТекстаАктивирован = Новый Цвет(0, 0, 0);
		ЦветТекста 			  = Новый Цвет(51, 102, 187);
	ИначеЕсли ТемаОформления = 4 Тогда
		//ЦветФонаАктивирован	  	= Новый Цвет(75 , 202, 129);
		ЦветФонаАктивирован	  	= Новый Цвет(25, 116, 206);
		
		ЦветФона			  	= Новый Цвет(235, 235, 237);
		ЦветТекстаНеАктивирован	= Новый Цвет(77 , 77 , 77);
	КонецЕсли;	
		
	Если АктивныйЭлемент <> Неопределено Тогда
		
		ПереданаКнопка = ТипЗнч(АктивныйЭлемент) <> Тип("ГруппаФормы");
		
		АктивнаяГруппа = ?(Не ПереданаКнопка, АктивныйЭлемент, АктивныйЭлемент.Родитель);
		АктивнаяГруппа.ЦветФона = ?(Активировать, ЦветФонаАктивирован, ЦветФона);
		АктивныйЭлемент.Ширина	= ?(ПереданаКнопка, 3, АктивныйЭлемент.Ширина);
		
		Если ПереданаКнопка Тогда
			АктивныйЭлемент.ЦветТекста = ?(Активировать, ЦветТекстаАктивирован, ЦветТекстаНеАктивирован);
			АктивныйЭлемент.Шрифт 	   = Новый Шрифт("Arial", 11);
		Иначе
			Для Каждого АктивныйПодчиненныйЭлемент Из АктивныйЭлемент.ПодчиненныеЭлементы Цикл			
				АктивныйПодчиненныйЭлемент.ЦветТекста = ?(Активировать, ЦветТекстаАктивирован, ЦветТекстаНеАктивирован);		
			КонецЦикла;	
		КонецЕсли;
		
	КонецЕсли;
	
	Если НеактивныеЭлементы <> Неопределено Тогда
		
		Если ТипЗнч(НеактивныеЭлементы) <> Тип("Массив") Тогда
			МассивНеактивныхЭлементов = Новый Массив;
			МассивНеактивныхЭлементов.Добавить(НеактивныеЭлементы);
		Иначе
			МассивНеактивныхЭлементов = НеактивныеЭлементы;
		КонецЕсли;
		
		Для Каждого НеактивныйЭлемент Из МассивНеактивныхЭлементов Цикл
			
			ПереданаКнопка = ТипЗнч(НеактивныйЭлемент) <> Тип("ГруппаФормы");
			
			НеАктивнаяГруппа = ?(Не ПереданаКнопка, НеактивныйЭлемент, НеактивныйЭлемент.Родитель);
			НеАктивнаяГруппа.ЦветФона = ЦветФона;
			НеактивныйЭлемент.Ширина  = ?(ПереданаКнопка, 3, НеактивныйЭлемент.Ширина);
			
			Если ПереданаКнопка Тогда
				НеактивныйЭлемент.ЦветТекста = ЦветТекста;
				НеактивныйЭлемент.Шрифт 	 = Новый Шрифт("Arial", 11);			
			Иначе
				Для Каждого НеактивныйЭлементПодчиненныйЭлемент Из НеактивныйЭлемент.ПодчиненныеЭлементы Цикл			
					НеактивныйЭлементПодчиненныйЭлемент.ЦветТекста = ЦветТекста;		
				КонецЦикла;		
			КонецЕсли;
					
		КонецЦикла;
		
	КонецЕсли;
	
	Если Форма <> Неопределено
		И ЭлементФокуса <> Неопределено Тогда
		
		Форма.ТекущийЭлемент = ЭлементФокуса;
	КонецЕсли;
	
КонецПроцедуры

//// Процедура, изменяет видимость элементов переключателей.
////
// Процедура ИзменитьАктивностьПереключателяФормы(
//	АктивныйЭлемент    = Неопределено, 
//	НеактивныеЭлементы = Неопределено, 
//	Активировать       = Истина, 
//	Форма              = Неопределено, 
//	ЭлементФокуса      = Неопределено,
//	ТемаОформления     = 1) Экспорт
//	
//	ЦветТекста              = Новый Цвет(77 , 77 , 77);  // Черный.
//	ЦветТекстаАктивирован   = Новый Цвет(255, 255, 255); // Белый.
//	ЦветТекстаНеАктивирован = Новый Цвет(192, 192, 192); // Серый.
//	ЦветФона                = Новый Цвет(242, 242, 242); // Светло-серый.
//	
//	// Тема оформления переключателей по умолчанию.
//	Если Не ЗначениеЗаполнено(ТемаОформления) ИЛИ ТемаОформления = 1 Тогда
//		ЦветФонаАктивирован = Новый Цвет(25, 116, 206); // Синий.
//		
//	ИначеЕсли ТемаОформления = 2 Тогда
//		ЦветФонаАктивирован = Новый Цвет(225, 40, 40); // Красный.
//		
//	ИначеЕсли ТемаОформления = 3 Тогда
//		ЦветФонаАктивирован	  = Новый Цвет(242, 242, 242); // Светло-серый.
//		ЦветФона			  = Новый Цвет(255, 255, 255);
//		ЦветТекстаАктивирован = Новый Цвет(0, 0, 0);
//		ЦветТекста 			  = Новый Цвет(51, 102, 187);
//	ИначеЕсли ТемаОформления = 4 Тогда
//		ЦветФонаАктивирован	  	= Новый Цвет(75 , 202, 129);
//		ЦветФона			  	= Новый Цвет(235, 235, 237);
//		ЦветТекстаНеАктивирован	= Новый Цвет(77 , 77 , 77);
//	КонецЕсли;	
//	
//	Если АктивныйЭлемент <> Неопределено Тогда
//		
//		ПереданаКнопка = ТипЗнч(АктивныйЭлемент) <> Тип("ГруппаФормы");
//		
//		АктивнаяГруппа = ?(Не ПереданаКнопка, АктивныйЭлемент, АктивныйЭлемент.Родитель);
//		АктивнаяГруппа.ЦветФона = ?(Активировать, ЦветФонаАктивирован, ЦветФона);
//		АктивныйЭлемент.Ширина	= ?(ПереданаКнопка, 3, АктивныйЭлемент.Ширина);
//		
//		Если ПереданаКнопка Тогда
//			АктивныйЭлемент.ЦветТекста = ?(Активировать, ЦветТекстаАктивирован, ЦветТекстаНеАктивирован);
//			АктивныйЭлемент.Шрифт 	   = Новый Шрифт("Arial", 11);
//		Иначе
//			Для Каждого АктивныйПодчиненныйЭлемент Из АктивныйЭлемент.ПодчиненныеЭлементы Цикл			
//				АктивныйПодчиненныйЭлемент.ЦветТекста = ?(Активировать, ЦветТекстаАктивирован, ЦветТекстаНеАктивирован);		
//			КонецЦикла;	
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	Если НеактивныеЭлементы <> Неопределено Тогда
//		
//		Если ТипЗнч(НеактивныеЭлементы) <> Тип("Массив") Тогда
//			МассивНеактивныхЭлементов = Новый Массив;
//			МассивНеактивныхЭлементов.Добавить(НеактивныеЭлементы);
//		Иначе
//			МассивНеактивныхЭлементов = НеактивныеЭлементы;
//		КонецЕсли;
//		
//		Для Каждого НеактивныйЭлемент Из МассивНеактивныхЭлементов Цикл
//			
//			ПереданаКнопка = ТипЗнч(НеактивныйЭлемент) <> Тип("ГруппаФормы");
//			
//			НеАктивнаяГруппа = ?(Не ПереданаКнопка, НеактивныйЭлемент, НеактивныйЭлемент.Родитель);
//			НеАктивнаяГруппа.ЦветФона = ЦветФона;
//			НеактивныйЭлемент.Ширина  = ?(ПереданаКнопка, 3, НеактивныйЭлемент.Ширина);
//			
//			Если ПереданаКнопка Тогда
//				НеактивныйЭлемент.ЦветТекста = ЦветТекста;
//				НеактивныйЭлемент.Шрифт 	 = Новый Шрифт("Arial", 11);			
//			Иначе
//				Для Каждого НеактивныйЭлементПодчиненныйЭлемент Из НеактивныйЭлемент.ПодчиненныеЭлементы Цикл			
//					НеактивныйЭлементПодчиненныйЭлемент.ЦветТекста = ЦветТекста;		
//				КонецЦикла;		
//			КонецЕсли;
//					
//		КонецЦикла;
//		
//	КонецЕсли;
//	
//	Если Форма <> Неопределено
//		И ЭлементФокуса <> Неопределено Тогда
//		
//		Форма.ТекущийЭлемент = ЭлементФокуса;
//	КонецЕсли;
//	
// КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОтображенияВсплывающихГрупп

// Функция - Проверить видимость всплывающей группы.
//
// Параметры:
//  ИмяВзаимодействия	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПроверитьВидимостьВсплывающихГрупп(Форма, Знач ИмяЭлемента, Знач ИндексЭлемента = Неопределено) Экспорт
	
	ИндексЭлемента = ?(ЗначениеЗаполнено(ИндексЭлемента), "_" + ИндексЭлемента, ""); 	
	
	Для Каждого ЭлементС Из Форма.ВидимостьВсплывающихГрупп Цикл
		
		Если ЭлементС.Ключ <> ИмяЭлемента + ИндексЭлемента Тогда 
			Форма.ВидимостьВсплывающихГрупп[ЭлементС.Ключ] = Ложь;
		КонецЕсли;	
		
	КонецЦикла;	
	
	Если Форма.ВидимостьВсплывающихГрупп[ИмяЭлемента + ИндексЭлемента] = Истина Тогда
		
		Форма.ВидимостьВсплывающихГрупп[ИмяЭлемента + ИндексЭлемента] = Ложь;
		
		ИмяВсплывающейГруппы = "Группа" + ИмяЭлемента + "Всплывающая" + ИндексЭлемента;
	
		Форма.Элементы[ИмяВсплывающейГруппы].Скрыть();	

		Возврат Ложь;
		
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции

// Процедура - Установить видимость всплывающих групп.
//
// Параметры:
//  ИмяВзаимодействия	 - 	 - 
//  Видимость			 - 	 - 
//
Процедура УстановитьВидимостьВсплывающихГрупп(Форма, Знач ИмяЭлемента, Знач ИндексЭлемента = Неопределено, Знач ТолькоПросмотр = Неопределено) Экспорт
	
	ИндексЭлемента = ?(ЗначениеЗаполнено(ИндексЭлемента), "_" + ИндексЭлемента, ""); 
	
	Форма.ВидимостьВсплывающихГрупп[ИмяЭлемента + ИндексЭлемента] = Истина; 
	
	ИмяВсплывающейГруппы = "Группа" + ИмяЭлемента + "Всплывающая" + ИндексЭлемента;
	
	Если ТолькоПросмотр <> Неопределено Тогда
		Форма.Элементы[ИмяВсплывающейГруппы].ТолькоПросмотр = ТолькоПросмотр;		
	КонецЕсли;
	
	Форма.Элементы[ИмяВсплывающейГруппы].Показать();	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Снять видимость всплывающих групп.
//
// Параметры:
//  ИмяВзаимодействия	 - 	 - 
//  Видимость			 - 	 - 
//
Процедура СнятьВидимостьВсплывающихГрупп(Форма, Знач ИмяЭлемента) Экспорт
	
	ИндексЭлемента = ?(ЗначениеЗаполнено(ИндексЭлемента), "_" + ИндексЭлемента, ""); 

	Форма.ВидимостьВсплывающихГрупп[ИмяЭлемента + ИндексЭлемента] = Ложь; 
		
КонецПроцедуры

#КонецОбласти

#Область ОбработкаРезультатаВыполнения

// Выводит результат выполнения какой-либо операции.
// 
// Предназначена только для отображения результата работы сервера на клиенте,
// Не предназначена для отображения промежуточных стадий - диалогов и т.п..
// 
// См. также:
//   СтандартныеПодсистемыКлиентСервер.НовыйРезультатВыполнения()
//   СтандартныеПодсистемыКлиентСервер.ПодготовитьОповещениеДинамическихСписков()
// 
// Параметры:
//   Форма - УправляемаяФорма - Форма, для которой требуется вывод.
//   Результат - Структура - Результат выполнения операции, который необходимо вывести.
//       * ВыводОповещения - Структура - Всплывающее оповещение.
//           ** Использование - Булево - Выводить оповещение.
//           ** Заголовок     - Строка - Заголовок оповещения.
//           ** Текст         - Строка - Текст оповещения.
//           ** Ссылка        - Строка - Навигационная гиперссылка текста.
//           ** Картинка      - Картинка - Картинка оповещения.
//       * ВыводСообщения - Структура - Сообщение формы, привязанное к реквизиту.
//           ** Использование       - Булево - Выводить сообщение.
//           ** Текст               - Строка - Текст сообщения.
//           ** ПутьКРеквизитуФормы - Строка - Путь к реквизиту формы, к которому относится сообщение.
//       * ВыводПредупреждения - Структура - Окно предупреждения, блокирующее весь интерфейс.
//           ** Использование       - Булево - Выводить предупреждение.
//           ** Заголовок           - Строка - Заголовок окна.
//           ** Текст               - Строка - Текст предупреждения.
//           ** ТекстОшибок- Строка- Необязательный. Тексты ошибок, которые при желании может просмотреть пользователь.
//           ** ПутьКРеквизитуФормы - Строка-Необязательный. Путь к реквизиту формы, значение которого вызывало ошибку.
//       * ОповещениеФорм - Структура, Массив из Структура - см. справку к методу глобального контекста Оповестить().
//           ** Использование - Булево - Оповещать открытые формы.
// ** ИмяСобытия- Строка- Имя события, которое используется для первичной идентификации сообщений принимающими формами.
//           ** Параметр- Произвольный - Набор данных, которые используются принимающей формой для обновления состава.
//           ** Источник      - Произвольный - Источник оповещения, например форма-источником.
//       * ОповещениеДинамическихСписков-Структура-см. справку к методу глобального контекста ОповеститьОбИзменении().
//           ** Использование - Булево - Оповещать динамические списки.
//           ** СсылкаИлиТип  - Произвольный - Ссылка, тип, или массив типов, которые необходимо обновить.
// 
Процедура ПоказатьРезультатВыполнения(Форма, Результат) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") И ТипЗнч(Результат) <> Тип("ФиксированнаяСтруктура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("ВыводОповещения") И Результат.ВыводОповещения.Использование Тогда
		Оповещение = Результат.ВыводОповещения;
		ПоказатьОповещениеПользователя(Оповещение.Заголовок, Оповещение.Ссылка, Оповещение.Текст, Оповещение.Картинка);
	КонецЕсли;
	
	Если Результат.Свойство("ВыводСообщения") И Результат.ВыводСообщения.Использование Тогда
		Сообщение = Новый СообщениеПользователю;
		Если ТипЗнч(Форма) = Тип("УправляемаяФорма") Тогда
			Сообщение.ИдентификаторНазначения = Форма.УникальныйИдентификатор;
		КонецЕсли;
		Сообщение.Текст = Результат.ВыводСообщения.Текст;
		Сообщение.Поле  = Результат.ВыводСообщения.ПутьКРеквизитуФормы;
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если Результат.Свойство("ВыводПредупреждения") И Результат.ВыводПредупреждения.Использование Тогда
		ВыводПредупреждения = Результат.ВыводПредупреждения;
		Если ЗначениеЗаполнено(ВыводПредупреждения.ТекстОшибок) Тогда
			Кнопки = Новый СписокЗначений;
			Кнопки.Добавить(1, НСтр("ru = 'Показать ошибки'"));
			Если ТипЗнч(Форма) = Тип("УправляемаяФорма") И ЗначениеЗаполнено(ВыводПредупреждения.ПутьКРеквизитуФормы) Тогда
				Кнопки.Добавить(2, НСтр("ru = 'Перейти к реквизиту'"));
			КонецЕсли;
			Кнопки.Добавить(0, НСтр("ru = 'Продолжить'"));
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ВыводПредупреждения", ВыводПредупреждения);
			ДополнительныеПараметры.Вставить("Форма", Форма);
			Обработчик = Новый ОписаниеОповещения("ПоказатьРезультатВыполненияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			
			ПоказатьВопрос(Обработчик, ВыводПредупреждения.Текст, Кнопки, , 1, ВыводПредупреждения.Заголовок);
		Иначе
			ПоказатьПредупреждение(, ВыводПредупреждения.Текст, , ВыводПредупреждения.Заголовок);
		КонецЕсли;
	КонецЕсли;
	
	Если Результат.Свойство("ОповещениеФорм") Тогда
		Если ТипЗнч(Результат.ОповещениеФорм) = Тип("Структура") Или ТипЗнч(Результат.ОповещениеФорм) = Тип("ФиксированнаяСтруктура") Тогда
			ОповещениеФорм = Результат.ОповещениеФорм;
			Если ОповещениеФорм.Использование Тогда
				Оповестить(ОповещениеФорм.ИмяСобытия, ОповещениеФорм.Параметр, ОповещениеФорм.Источник);
			КонецЕсли;
		Иначе
			Для Каждого ОповещениеФорм Из Результат.ОповещениеФорм Цикл
				Если ОповещениеФорм.Использование Тогда
					Оповестить(ОповещениеФорм.ИмяСобытия, ОповещениеФорм.Параметр, ОповещениеФорм.Источник);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если Результат.Свойство("ОповещениеДинамическихСписков") И Результат.ОповещениеДинамическихСписков.Использование Тогда
		Если ТипЗнч(Результат.ОповещениеДинамическихСписков.СсылкаИлиТип) = Тип("Массив") Тогда
			Для Каждого СсылкаИлиТип Из Результат.ОповещениеДинамическихСписков.СсылкаИлиТип Цикл
				ОповеститьОбИзменении(СсылкаИлиТип);
			КонецЦикла;
		Иначе
			ОповеститьОбИзменении(Результат.ОповещениеДинамическихСписков.СсылкаИлиТип);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик ответа на вопрос при выводе результата выполнения.
// 
Процедура ПоказатьРезультатВыполненияЗавершение(Ответ, Результат) Экспорт
	
	Если Ответ = 1 Тогда
		
		ЗаголовокДокумента = Результат.ВыводПредупреждения.Текст;
		ЗаголовокДокумента = СтрЗаменить(ЗаголовокДокумента, Символы.ПС, "; ");
		Если СтрДлина(ЗаголовокДокумента) > 75 Тогда
			ЗаголовокДокумента = Лев(ЗаголовокДокумента, 72) + "...";
		КонецЕсли;
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(Результат.ВыводПредупреждения.ТекстОшибок);
		ТекстовыйДокумент.Показать(ЗаголовокДокумента);
		
	ИначеЕсли Ответ = 2 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ИдентификаторНазначения = Результат.Форма.УникальныйИдентификатор;
		Сообщение.Текст = Результат.ВыводПредупреждения.Текст;
		Сообщение.Поле  = Результат.ВыводПредупреждения.ПутьКРеквизитуФормы;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выбрать период из спсика
Функция ВыбратьПериодИзВыпадающегоСписка(Форма, Элемент, ВидПериода, НачалоПериода, Вариант, ИндексНачальногоЗначения)
	
	СписокПериодов = ФункцииОтчетовКлиентСервер.СписокФиксированныхПериодов(НачалоПериода, ВидПериода);	
	Если ИндексНачальногоЗначения = Неопределено Тогда
		ИндексНачальногоЗначения = СписокПериодов.НайтиПоЗначению(НачалоПериода);
	КонецЕсли;
	
	Если ИндексНачальногоЗначения = Неопределено Тогда
		ИндексНачальногоЗначения = СписокПериодов.Количество() - 1;
	КонецЕсли;
	
	РезультатВыбора = Форма.ВыбратьИзСписка(СписокПериодов, Элемент, ИндексНачальногоЗначения);
	// Обрабатываем результат выбора
	Если РезультатВыбора = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Если выбран пункт следующего блока периодов
	Индекс = СписокПериодов.Индекс(РезультатВыбора);
	Если Индекс = 0 Или Индекс = СписокПериодов.Количество() - 1 Тогда
		Возврат ВыбратьПериодИзВыпадающегоСписка(Форма, Элемент, ВидПериода, РезультатВыбора.Значение, Вариант, Индекс);
	КонецЕсли;
	
	Возврат РезультатВыбора;
	
КонецФункции

#Область ОбработчикиМеханизмаФильтрацииДанных

// Функция - Обновить элементы фильтрации данных
//
// Параметры:
//  Форма					 - 	 - 
//  ИмяКоманды				 - 	 - 
//  ДанныеЭлементаФильтрации - 	 - 
//  ВыбранноеЗначение		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОбновитьЭлементыФильтрацииДанных(Форма, ИмяКоманды, ДанныеЭлементаФильтрации = Неопределено, ВыбранноеЗначение = Неопределено) Экспорт
	
	Если ДанныеЭлементаФильтрации = Неопределено Тогда 
		ДанныеЭлементаФильтрации = ПолучитьДанныеЭлементаФильтрации(Форма, ИмяКоманды);
	КонецЕсли;
	
	// ----------------------------Отображение виджета фильтрации-----------------------------------
	Если ДанныеЭлементаФильтрации.ДействиеЭлемента = "ПоказатьМенюФильтрации" Тогда
		Если ДанныеЭлементаФильтрации.ТипЭлемента = "АктивированныеЗначенияФильтра" Тогда 
			Форма.Элементы.СтраницыЗначенийФильтров.ТекущаяСтраница = Форма.Элементы[ДанныеЭлементаФильтрации.СтрокаФильтра.ИмяСтраницыЗначенийФильтра];
			Форма.ОбновитьСвойстваРазделовФильтра(Истина, ДанныеЭлементаФильтрации.СтрокаФильтра.ИмяСтраницыЗначенийФильтра);
		Иначе 	
			Форма.ОбновитьСвойстваРазделовФильтра(Истина);
		КонецЕсли;
		// Если Форма.Элементы.МенюФильтрацииДанных.Скрыта() Тогда 
		//	Форма.Элементы.МенюФильтрацииДанных.Показать();		
		//	Форма.ТекущийЭлемент = Форма.Элементы.СтраницыЗначенийФильтров.ТекущаяСтраница;
		// Иначе 
		//	Форма.Элементы.МенюФильтрацииДанных.Скрыть();		
		// КонецЕсли;
	// ----------------------------Применение настроек фильтрации------------------------------------
	ИначеЕсли ДанныеЭлементаФильтрации.ДействиеЭлемента = "ПрименитьНастройкиФильтрации" Тогда
		Для Каждого СтрокаФильтра ИЗ Форма.ТаблицаФильтров Цикл
			ЕстьАктивированные = Ложь;
			Если СтрНайти(СтрокаФильтра.Наименование, "Вероятность") <> 0 И СтрокаФильтра.ОписаниеТипаЗначения.СодержитТип(Тип("Число")) Тогда 
				Если СтрокаФильтра.НачалоЧисловогоДиапазона <> 0 ИЛИ СтрокаФильтра.КонецЧисловогоДиапазона <> 0 Тогда 
					СтрокаФильтра.Применен 				= Ложь;
					ЕстьАктивированные 					= Истина;					
				КонецЕсли;	
			КонецЕсли;	
			Для Каждого ЭлементСписка Из СтрокаФильтра.СписокЗначений Цикл
				Если ЭлементСписка.Значение.Выбран <> ЭлементСписка.Значение.Активирован Тогда
					ЭлементСписка.Значение.Активирован 	= ЭлементСписка.Значение.Выбран;
					СтрокаФильтра.Применен 				= Ложь;
					// ДанныеЭлементаФильтрации.Вставить("АктуализироватьДанныеВСписке"	, Истина); 
				КонецЕсли;
				Если ЭлементСписка.Значение.Активирован Тогда 
					ЕстьАктивированные = Истина;
				КонецЕсли;					
			КонецЦикла;
			Если НЕ ЕстьАктивированные Тогда 
				СтрокаФильтра.ВариантОтбора 			= Истина;
			КонецЕсли;	
			Если НЕ СтрокаФильтра.РеквизитДата = Дата(1,1,1) И ТипЗнч(СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра) = Тип("СтандартныйПериод") Тогда
				Если НЕ СтрокаФильтра.СписокЗначений[0].Значение.ПрошлоеЗначениеФильтра.Вариант = СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.Вариант ИЛИ
					НЕ СтрокаФильтра.СписокЗначений[0].Значение.ПрошлоеЗначениеФильтра.ДатаНачала = СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.ДатаНачала ИЛИ
					НЕ СтрокаФильтра.СписокЗначений[0].Значение.ПрошлоеЗначениеФильтра.ДатаОкончания = СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.ДатаОкончания Тогда 
					ЗаполнитьЗначенияСвойств(СтрокаФильтра.СписокЗначений[0].Значение.ПрошлоеЗначениеФильтра, СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра);
					СтрокаФильтра.СписокЗначений[0].Значение.ПрошлоеЗначениеФильтра.Вариант = СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.Вариант;
					СтрокаФильтра.Применен 				= Ложь;					
					// ДанныеЭлементаФильтрации.Вставить("АктуализироватьДанныеВСписке"	, Истина); 
				КонецЕсли;
			КонецЕсли;
			Если НЕ СтрокаФильтра.Применен Тогда 
				ДанныеЭлементаФильтрации.Вставить("АктуализироватьДанныеВСписке", Истина); 
			КонецЕсли;	
		КонецЦикла;
		
		// Форма.Элементы.МенюФильтрацииДанных.Скрыть();
		Если ДанныеЭлементаФильтрации.АктуализироватьДанныеВСписке Тогда // ИЛИ НЕ СтрокаФильтра.Применен Тогда 
			Форма.ПрименитьМеханизмФильтрацииДанных(ДанныеЭлементаФильтрации);
		КонецЕсли;
		
	// -------------------------Сброс активированных значений определенного фильтра------------------	
	ИначеЕсли ДанныеЭлементаФильтрации.ДействиеЭлемента = "УдалитьАктивированныеЗначенияФильтра" Тогда
		СтрокаФильтра = Форма[ДанныеЭлементаФильтрации.ИмяТаблицы].НайтиПоИдентификатору(ДанныеЭлементаФильтрации.ИдентификаторФильтра);
		Если СтрокаФильтра = Неопределено Тогда 
			Возврат ДанныеЭлементаФильтрации;
		КонецЕсли;
		Если СтрНайти(СтрокаФильтра.Наименование, "Вероятность") <> 0 И СтрокаФильтра.ОписаниеТипаЗначения.СодержитТип(Тип("Число")) Тогда 
			СтрокаФильтра.НачалоЧисловогоДиапазона = 0;
			СтрокаФильтра.КонецЧисловогоДиапазона = 0;
		КонецЕсли;	
		Для Каждого ЭлементСписка Из СтрокаФильтра.СписокЗначений Цикл
			ЭлементСписка.Значение.Выбран 		= Ложь;
			ЭлементСписка.Значение.Активирован 	= Ложь;
		КонецЦикла;
		СтрокаФильтра.КоличествоАктивированныхЗначений 	= 0;
		СтрокаФильтра.Применен 							= Ложь;
		СтрокаФильтра.ВариантОтбора 					= Истина;
		Если НЕ СтрокаФильтра.РеквизитДата = Дата(1,1,1) И СтрокаФильтра.СписокЗначений.Количество() > 0 И ТипЗнч(СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра) = Тип("СтандартныйПериод") Тогда 
			СтрокаФильтра.РеквизитДата = НачалоДня(ТекущаяДата());
			СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра = Новый СтандартныйПериод;
			ЗаполнитьЗначенияСвойств(СтрокаФильтра.СписокЗначений[0].Значение.ПрошлоеЗначениеФильтра, СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра);
			СтрокаФильтра.СписокЗначений[0].Значение.ПрошлоеЗначениеФильтра.Вариант = СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.Вариант;			
			СтрокаФильтра.СписокЗначений[0].Значение.СписокСтандартныхПериодов.ЗаполнитьПометки(Ложь);
			СтрокаФильтра.СписокЗначений[0].Представление = СтрокаФильтра.СписокЗначений[0].Значение.ПредставлениеПустогоПериода;
			Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].ВыделенныеДаты.Очистить();
		КонецЕсли;	
		
		ОбновитьСвойстваЭлементаЗначения(Форма, СтрокаФильтра, СтрокаФильтра.СписокЗначений[0]);
		
		ДанныеЭлементаФильтрации.Вставить("АктуализироватьДанныеВСписке", Истина); 
		Если ДанныеЭлементаФильтрации.АктуализироватьДанныеВСписке Тогда
			Форма.ПрименитьМеханизмФильтрацииДанных(ДанныеЭлементаФильтрации);
		КонецЕсли;
		
	// -----------------------------Селектирование разделов фильтра---------------------------------------	
	ИначеЕсли ДанныеЭлементаФильтрации.ТипЭлемента = "ТипФильтра" Тогда 
		Если ДанныеЭлементаФильтрации.ДействиеЭлемента = "Активировать" Тогда
			Если НЕ Форма.Элементы.СтраницыЗначенийФильтров.ТекущаяСтраница.Имя = ДанныеЭлементаФильтрации.СтрокаФильтра.ИмяСтраницыЗначенийФильтра Тогда 
				// Форма.Элементы.СтраницыЗначенийФильтров.ТекущаяСтраница = Форма.Элементы[ДанныеЭлементаФильтрации.СтрокаФильтра.ИмяСтраницыЗначенийФильтра];
				Форма.ОбновитьСвойстваРазделовФильтра(, ДанныеЭлементаФильтрации.СтрокаФильтра.ИмяСтраницыЗначенийФильтра);
			КонецЕсли;	
		ИначеЕсли ДанныеЭлементаФильтрации.ДействиеЭлемента = "Очистить" Тогда
			
		ИначеЕсли ДанныеЭлементаФильтрации.ДействиеЭлемента = "ИзменитьВариантОтбора" Тогда
			ДанныеЭлементаФильтрации.СтрокаФильтра.ВариантОтбора 	= НЕ ДанныеЭлементаФильтрации.СтрокаФильтра.ВариантОтбора;
			ДанныеЭлементаФильтрации.СтрокаФильтра.Применен 		= Ложь;
			ДанныеЭлементаФильтрации.Вставить("АктуализироватьДанныеВСписке"	, Истина); 
			ОбновитьСвойстваЭлементаВариантаОтбора(Форма, ДанныеЭлементаФильтрации.СтрокаФильтра);
		КонецЕсли;
		// Форма.ТекущийЭлемент = Форма.Элементы.СтраницыЗначенийФильтров.ТекущаяСтраница;	
		Форма.ТекущийЭлемент = Форма.Элементы["Кнопка_ПрименитьНастройкиФильтрации"];		
		
	// -----------------------------Активация, выбор значения фильтра------------------------------------	
	ИначеЕсли ДанныеЭлементаФильтрации.ТипЭлемента = "ЗначениеФильтра" Тогда	
		Если ДанныеЭлементаФильтрации.ДействиеЭлемента = "Активировать" Тогда
			Если ДанныеЭлементаФильтрации.СтрокаФильтра <> Неопределено Тогда 
				ЭлементСпискаЗначенийФильтра = ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений.НайтиПоИдентификатору(ДанныеЭлементаФильтрации.ИдентификаторЗначения);
				Если ЭлементСпискаЗначенийФильтра <> Неопределено Тогда 
					ЭлементСпискаЗначенийФильтра.Значение.Выбран		 = НЕ ЭлементСпискаЗначенийФильтра.Значение.Выбран;
					ЭлементСпискаЗначенийФильтра.Значение.Активирован	 = ЭлементСпискаЗначенийФильтра.Значение.Выбран;
					ДанныеЭлементаФильтрации.СтрокаФильтра.КоличествоАктивированныхЗначений = 0;					
					Для Каждого ЭлементСписка Из ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений Цикл 
						Если ЭлементСписка.Значение.Выбран Тогда 
							ДанныеЭлементаФильтрации.СтрокаФильтра.КоличествоАктивированныхЗначений = ДанныеЭлементаФильтрации.СтрокаФильтра.КоличествоАктивированныхЗначений + 1;
						КонецЕсли;	
					КонецЦикла;	
					ОбновитьСвойстваЭлементаЗначения(Форма, ДанныеЭлементаФильтрации.СтрокаФильтра, ЭлементСпискаЗначенийФильтра);
			    КонецЕсли;
			КонецЕсли;
		ИначеЕсли ДанныеЭлементаФильтрации.ДействиеЭлемента = "ОбработкаВыбора" Тогда
			Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда 
        		Форма.ОбновитьГруппуЗначенийФильтра(ДанныеЭлементаФильтрации.ИдентификаторФильтра, Истина, ВыбранноеЗначение);
			КонецЕсли;	
		ИначеЕсли ДанныеЭлементаФильтрации.ДействиеЭлемента = "УстановитьПериод" Тогда
			Если ДанныеЭлементаФильтрации.СтрокаФильтра <> Неопределено Тогда 
				Если ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.ДатаОкончания - ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.ДатаНачала > 86400 Тогда 
					Форма.Элементы[ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].ВыделенныеДаты.Очистить();
					Форма.Элементы[ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].ВыделенныеДаты.Добавить(ДанныеЭлементаФильтрации.СтрокаФильтра.РеквизитДата);
					
					ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.ДатаНачала 	= ДанныеЭлементаФильтрации.СтрокаФильтра.РеквизитДата;
					ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.ДатаОкончания = ДанныеЭлементаФильтрации.СтрокаФильтра.РеквизитДата;
				Иначе
					// Форма.Элементы[ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].ВыделенныеДаты.Очистить();
					Если ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра = Новый СтандартныйПериод Тогда 
						ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.ДатаНачала 	= ДанныеЭлементаФильтрации.СтрокаФильтра.РеквизитДата;
						ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.ДатаОкончания = ДанныеЭлементаФильтрации.СтрокаФильтра.РеквизитДата;
					КонецЕсли;	
				    МинимальнаяДата 	= Мин(ДанныеЭлементаФильтрации.СтрокаФильтра.РеквизитДата, ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.ДатаНачала);
					МаксимальнаяДата 	= Макс(ДанныеЭлементаФильтрации.СтрокаФильтра.РеквизитДата, ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.ДатаНачала);
					ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.ДатаНачала 	= МинимальнаяДата;
					ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.ДатаОкончания = МаксимальнаяДата;
					Если Форма.Элементы[ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].ВыделенныеДаты.Количество() <> 0 Тогда 
						Если Форма.Элементы[ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].ВыделенныеДаты[0] = МинимальнаяДата Тогда 
							МинимальнаяДата = МинимальнаяДата + 86400;
						Иначе 
							Форма.Элементы[ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].ВыделенныеДаты.Очистить();
						КонецЕсли;	
					КонецЕсли;	
					Пока МинимальнаяДата <= МаксимальнаяДата Цикл 
						Форма.Элементы[ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].ВыделенныеДаты.Добавить(МинимальнаяДата);
						МинимальнаяДата = МинимальнаяДата + 86400;
					КонецЦикла;	
				КонецЕсли;
				ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Представление 			 = ПолучитьПредставлениеПериода(ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение);
				ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.Выбран 		 = Истина;
				ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.Активирован	 = Истина;
				ДанныеЭлементаФильтрации.СтрокаФильтра.КоличествоАктивированныхЗначений 		 = 1;
				
				ОбновитьСвойстваЭлементаЗначения(Форма, ДанныеЭлементаФильтрации.СтрокаФильтра, ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0]);
			КонецЕсли;
		ИначеЕсли ДанныеЭлементаФильтрации.ДействиеЭлемента = "ПоказатьВыборСтандартногоПериода" Тогда
			ПарметрыОповещения = Новый ФиксированнаяСтруктура(ДанныеЭлементаФильтрации);
			ПарметрыОповещения = Новый Структура(ПарметрыОповещения);
			ПарметрыОповещения.Вставить("ДействиеЭлемента", "УстановитьСтандартныйПериод");
			ПарметрыОповещения.Удалить("СтрокаФильтра");
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыборСтандартногоПериода", Форма, ПарметрыОповещения);
			Форма.ПоказатьВыборИзМеню(ОписаниеОповещения, ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.СписокСтандартныхПериодов, Форма.Элементы[ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ИмяКнопкиВыбораСтандартногоПериода]);
		ИначеЕсли ДанныеЭлементаФильтрации.ДействиеЭлемента = "УстановитьСтандартныйПериод" Тогда
			СтрокаФильтра = Форма[ДанныеЭлементаФильтрации.ИмяТаблицы].НайтиПоИдентификатору(ДанныеЭлементаФильтрации.ИдентификаторФильтра);
			СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.Вариант = СтрокаФильтра.СписокЗначений[0].Значение.СписокСтандартныхПериодов.НайтиПоИдентификатору(ДанныеЭлементаФильтрации.ИдентификаторЗначения).Значение; 
			СтрокаФильтра.СписокЗначений[0].Представление = СтрокаФильтра.СписокЗначений[0].Значение.СписокСтандартныхПериодов.НайтиПоИдентификатору(ДанныеЭлементаФильтрации.ИдентификаторЗначения).Представление; 
			СтрокаФильтра.РеквизитДата = СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.ДатаНачала;
			МинимальнаяДата 	= СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.ДатаНачала;
			МаксимальнаяДата 	= СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.ДатаОкончания;
			// Обновляем видимость нужных нам месяцев в календаре путем устаовки ограничений на календарь
			Если Макс(МинимальнаяДата, НачалоМесяца(ТекущаяДата())) < Мин(НачалоДня(МаксимальнаяДата), ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), 2)) Тогда
				Если МинимальнаяДата < НачалоМесяца(ТекущаяДата()) Тогда 
					Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].НачалоПериодаОтображения 	= МинимальнаяДата;
					Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].КонецПериодаОтображения 	= ДобавитьМесяц(МинимальнаяДата, 2);
				Иначе 	
					Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].НачалоПериодаОтображения 	= НачалоМесяца(ТекущаяДата());
					Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].КонецПериодаОтображения 	= ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), 2);
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(МинимальнаяДата) И ЗначениеЗаполнено(МаксимальнаяДата) Тогда 
				Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].НачалоПериодаОтображения 	= МинимальнаяДата;
				Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].КонецПериодаОтображения 	= ДобавитьМесяц(МинимальнаяДата, 2);
			КонецЕсли;
			// После обновления - сбрасываем ограничения календаря
			Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].НачалоПериодаОтображения 	= Дата(1,1,1);
			Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].КонецПериодаОтображения 	= Дата(1,1,1);
			// Очищаем массив выделенных дат в календаре
			Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].ВыделенныеДаты.Очистить();
			// Накидываем в массив выделенных дат календаря новые даты
			Пока МинимальнаяДата <= МаксимальнаяДата Цикл 
				Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].ВыделенныеДаты.Добавить(МинимальнаяДата);
				МинимальнаяДата = МинимальнаяДата + 86400;
			КонецЦикла;	
			СтрокаФильтра.СписокЗначений[0].Значение.Выбран		 = Истина;
			СтрокаФильтра.СписокЗначений[0].Значение.Активирован = Истина;
			СтрокаФильтра.КоличествоАктивированныхЗначений		 = 1;
			Форма.ОбновитьГруппуАктивированныхЗначенийФильтра(ДанныеЭлементаФильтрации.ИдентификаторФильтра);
		ИначеЕсли ДанныеЭлементаФильтрации.ДействиеЭлемента = "СброситьПериод" Тогда
			Если ДанныеЭлементаФильтрации.СтрокаФильтра <> Неопределено Тогда 
				Если НЕ ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра = Новый СтандартныйПериод Тогда 
					ДанныеЭлементаФильтрации.СтрокаФильтра.РеквизитДата = НачалоДня(ТекущаяДата());
					ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.Выбран			 = Ложь;
					ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.Активирован		 = Ложь;
					ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра	 = Новый СтандартныйПериод;
					ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.СписокСтандартныхПериодов.ЗаполнитьПометки(Ложь);
					ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Представление = ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ПредставлениеПустогоПериода;
					Форма.Элементы[ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].ВыделенныеДаты.Очистить();
					ДанныеЭлементаФильтрации.СтрокаФильтра.КоличествоАктивированныхЗначений = 0;
					ОбновитьСвойстваЭлементаЗначения(Форма, ДанныеЭлементаФильтрации.СтрокаФильтра, ДанныеЭлементаФильтрации.СтрокаФильтра.СписокЗначений[0]);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеЭлементаФильтрации.Свойство("СтрокаФильтра") Тогда
			Форма.ОбновитьГруппуАктивированныхЗначенийФильтра(ДанныеЭлементаФильтрации.СтрокаФильтра.ПолучитьИдентификатор());
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеЭлементаФильтрации;
	
КонецФункции

// Функция - Получить данные элемента фильтрации
//
// Параметры:
//  Форма		 - 	 - 
//  ИмяКоманды	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеЭлементаФильтрации(Форма, ИмяКоманды) Экспорт

	СтруктураДанныхЭлемента = Новый Структура;
	СтруктураДанныхЭлемента.Вставить("ИмяТаблицы"					, "");
	СтруктураДанныхЭлемента.Вставить("ИдентификаторФильтра"			, 0);
	СтруктураДанныхЭлемента.Вставить("ИдентификаторЗначения"		, 0);	
	СтруктураДанныхЭлемента.Вставить("СтрокаФильтра"				, Неопределено);
	СтруктураДанныхЭлемента.Вставить("ТипЭлемента"					, "");
	СтруктураДанныхЭлемента.Вставить("ДействиеЭлемента"				, ""); 
	СтруктураДанныхЭлемента.Вставить("АктуализироватьДанныеВСписке"	, Ложь); 
	
	Если СтрНайти(ИмяКоманды, "ПоказатьМенюФильтрацииДанных") <> 0 Тогда 
		СтруктураДанныхЭлемента.Вставить("ДействиеЭлемента"			, "ПоказатьМенюФильтрации");
	ИначеЕсли СтрНайти(ИмяКоманды, "Показать_Активированные_ЗначенияФильтра_") Тогда	
		СтруктураДанныхЭлемента.Вставить("ИмяТаблицы"				, "ТаблицаФильтров");
		СтруктураДанныхЭлемента.Вставить("ИдентификаторФильтра"		, Число(Сред(ИмяКоманды, СтрНайти(ИмяКоманды, "_Идентификатор_") + СтрДлина("_Идентификатор_"))));
		СтруктураДанныхЭлемента.Вставить("СтрокаФильтра"			, Форма.ТаблицаФильтров.НайтиПоИдентификатору(СтруктураДанныхЭлемента.ИдентификаторФильтра));
		СтруктураДанныхЭлемента.Вставить("ТипЭлемента"				, "АктивированныеЗначенияФильтра");
		СтруктураДанныхЭлемента.Вставить("ДействиеЭлемента"			, "ПоказатьМенюФильтрации");
	ИначеЕсли СтрНайти(ИмяКоманды, "ПрименитьНастройкиФильтрации") <> 0 Тогда 
		СтруктураДанныхЭлемента.Вставить("ДействиеЭлемента"			, "ПрименитьНастройкиФильтрации");
	ИначеЕсли СтрНайти(ИмяКоманды, "Удалить_Активированные_ЗначенияФильтра_") <> 0 Тогда 
		СтруктураДанныхЭлемента.Вставить("ИмяТаблицы"				, "ТаблицаФильтров");
		СтруктураДанныхЭлемента.Вставить("ИдентификаторФильтра"		, Число(Сред(ИмяКоманды, СтрНайти(ИмяКоманды, "_Идентификатор_") + СтрДлина("_Идентификатор_"))));
		// СтруктураДанныхЭлемента.Вставить("СтрокаФильтра"			, Форма.ТаблицаФильтров.НайтиПоИдентификатору(СтруктураДанныхЭлемента.ИдентификаторФильтра));
		СтруктураДанныхЭлемента.Вставить("ТипЭлемента"				, "АктивированныеЗначенияФильтра");		
		СтруктураДанныхЭлемента.Вставить("ДействиеЭлемента"			, "УдалитьАктивированныеЗначенияФильтра");	
	ИначеЕсли СтрНайти(ИмяКоманды, "_ТипФильтра_") <> 0 Тогда
		Если СтрНайти(ИмяКоманды, "Активировать_") <> 0 Тогда
			СтруктураДанныхЭлемента.Вставить("ИмяТаблицы"			, "ТаблицаФильтров");
			СтруктураДанныхЭлемента.Вставить("ИдентификаторФильтра"	, Число(Сред(ИмяКоманды, СтрНайти(ИмяКоманды, "_Идентификатор_") + СтрДлина("_Идентификатор_"))));
		    СтруктураДанныхЭлемента.Вставить("СтрокаФильтра"		, Форма.ТаблицаФильтров.НайтиПоИдентификатору(СтруктураДанныхЭлемента.ИдентификаторФильтра));
			СтруктураДанныхЭлемента.Вставить("ТипЭлемента"			, "ТипФильтра");
			СтруктураДанныхЭлемента.Вставить("ДействиеЭлемента"		, "Активировать");
		ИначеЕсли СтрНайти(ИмяКоманды, "Очистить_") <> 0 Тогда
			СтруктураДанныхЭлемента.Вставить("ИмяТаблицы"			, "ТаблицаФильтров");
			СтруктураДанныхЭлемента.Вставить("ИдентификаторФильтра"	, Число(Сред(ИмяКоманды, СтрНайти(ИмяКоманды, "_Идентификатор_") + СтрДлина("_Идентификатор_"))));
		    СтруктураДанныхЭлемента.Вставить("СтрокаФильтра"		, Форма.ТаблицаФильтров.НайтиПоИдентификатору(СтруктураДанныхЭлемента.ИдентификаторФильтра));
			СтруктураДанныхЭлемента.Вставить("ТипЭлемента"			, "ТипФильтра");
			СтруктураДанныхЭлемента.Вставить("ДействиеЭлемента"		, "Очистить");
		ИначеЕсли СтрНайти(ИмяКоманды, "ИзменитьВариантОтбора_") <> 0 Тогда
			СтруктураДанныхЭлемента.Вставить("ИмяТаблицы"			, "ТаблицаФильтров");
			СтруктураДанныхЭлемента.Вставить("ИдентификаторФильтра"	, Число(Сред(ИмяКоманды, СтрНайти(ИмяКоманды, "_Идентификатор_") + СтрДлина("_Идентификатор_"))));
		    СтруктураДанныхЭлемента.Вставить("СтрокаФильтра"		, Форма.ТаблицаФильтров.НайтиПоИдентификатору(СтруктураДанныхЭлемента.ИдентификаторФильтра));
			СтруктураДанныхЭлемента.Вставить("ТипЭлемента"			, "ТипФильтра");
			СтруктураДанныхЭлемента.Вставить("ДействиеЭлемента"		, "ИзменитьВариантОтбора");	
		КонецЕсли;	
	ИначеЕсли СтрНайти(ИмяКоманды, "_ЗначениеФильтра_") <> 0 Тогда
		Если СтрНайти(ИмяКоманды, "Активировать_") <> 0 Тогда
			СтруктураДанныхЭлемента.Вставить("ИмяТаблицы"			, "ТаблицаФильтров");
			МассивСтрокФильтра = Форма.ТаблицаФильтров.НайтиСтроки(Новый Структура("ИмяСтраницыЗначенийФильтра", Форма.Элементы.СтраницыЗначенийФильтров.ТекущаяСтраница.Имя));
			Если МассивСтрокФильтра.Количество() <> 0 Тогда 
				СтруктураДанныхЭлемента.Вставить("ИдентификаторФильтра"	, МассивСтрокФильтра[0].ПолучитьИдентификатор());
		   		СтруктураДанныхЭлемента.Вставить("СтрокаФильтра"		, МассивСтрокФильтра[0]);				
			КонецЕсли;	
			СтруктураДанныхЭлемента.Вставить("ИдентификаторЗначения", Число(Сред(ИмяКоманды, СтрНайти(ИмяКоманды, "_Идентификатор_") + СтрДлина("_Идентификатор_"))));
			СтруктураДанныхЭлемента.Вставить("ТипЭлемента"			, "ЗначениеФильтра");
			СтруктураДанныхЭлемента.Вставить("ДействиеЭлемента"		, "Активировать");
		ИначеЕсли СтрНайти(ИмяКоманды, "Выбрать_") <> 0 Тогда
			СтруктураДанныхЭлемента.Вставить("ИмяТаблицы"			, "ТаблицаФильтров");
			СтруктураДанныхЭлемента.Вставить("ИдентификаторФильтра"	, Число(Сред(ИмяКоманды, СтрНайти(ИмяКоманды, "_Идентификатор_") + СтрДлина("_Идентификатор_"))));
			// СтруктураДанныхЭлемента.Вставить("СтрокаФильтра"		, Форма.ТаблицаФильтров.НайтиПоИдентификатору(СтруктураДанныхЭлемента.ИдентификаторФильтра));
			СтруктураДанныхЭлемента.Вставить("ТипЭлемента"			, "ЗначениеФильтра");
			СтруктураДанныхЭлемента.Вставить("ДействиеЭлемента"		, "ОбработкаВыбора");	
		ИначеЕсли СтрНайти(ИмяКоманды, "УстановитьПериод_") <> 0 Тогда
			СтруктураДанныхЭлемента.Вставить("ИмяТаблицы"			, "ТаблицаФильтров");
			СтруктураДанныхЭлемента.Вставить("ИдентификаторФильтра"	, Число(Сред(ИмяКоманды, СтрНайти(ИмяКоманды, "_Идентификатор_") + СтрДлина("_Идентификатор_"))));
		    СтруктураДанныхЭлемента.Вставить("СтрокаФильтра"		, Форма.ТаблицаФильтров.НайтиПоИдентификатору(СтруктураДанныхЭлемента.ИдентификаторФильтра));
			СтруктураДанныхЭлемента.Вставить("ТипЭлемента"			, "ЗначениеФильтра");
			СтруктураДанныхЭлемента.Вставить("ДействиеЭлемента"		, "УстановитьПериод");	
		ИначеЕсли СтрНайти(ИмяКоманды, "ПоказатьВыборСтандартногоПериода_") <> 0 Тогда
			СтруктураДанныхЭлемента.Вставить("ИмяТаблицы"			, "ТаблицаФильтров");
			СтруктураДанныхЭлемента.Вставить("ИдентификаторФильтра"	, Число(Сред(ИмяКоманды, СтрНайти(ИмяКоманды, "_Идентификатор_") + СтрДлина("_Идентификатор_"))));
		    СтруктураДанныхЭлемента.Вставить("СтрокаФильтра"		, Форма.ТаблицаФильтров.НайтиПоИдентификатору(СтруктураДанныхЭлемента.ИдентификаторФильтра));
			СтруктураДанныхЭлемента.Вставить("ТипЭлемента"			, "ЗначениеФильтра");
			СтруктураДанныхЭлемента.Вставить("ДействиеЭлемента"		, "ПоказатьВыборСтандартногоПериода");	
		ИначеЕсли СтрНайти(ИмяКоманды, "УстановитьСтандартныйПериод_") <> 0 Тогда
			СтруктураДанныхЭлемента.Вставить("ИмяТаблицы"			, "ТаблицаФильтров");
			СтруктураДанныхЭлемента.Вставить("ИдентификаторФильтра"	, Число(Сред(ИмяКоманды, СтрНайти(ИмяКоманды, "_Идентификатор_") + СтрДлина("_Идентификатор_"))));
		    СтруктураДанныхЭлемента.Вставить("СтрокаФильтра"		, Форма.ТаблицаФильтров.НайтиПоИдентификатору(СтруктураДанныхЭлемента.ИдентификаторФильтра));
			СтруктураДанныхЭлемента.Вставить("ТипЭлемента"			, "ЗначениеФильтра");
			СтруктураДанныхЭлемента.Вставить("ДействиеЭлемента"		, "УстановитьСтандартныйПериод");	
		ИначеЕсли СтрНайти(ИмяКоманды, "ОчисткаПериода_") <> 0 Тогда
			СтруктураДанныхЭлемента.Вставить("ИмяТаблицы"			, "ТаблицаФильтров");
			СтруктураДанныхЭлемента.Вставить("ИдентификаторФильтра"	, Число(Сред(ИмяКоманды, СтрНайти(ИмяКоманды, "_Идентификатор_") + СтрДлина("_Идентификатор_"))));
		    СтруктураДанныхЭлемента.Вставить("СтрокаФильтра"		, Форма.ТаблицаФильтров.НайтиПоИдентификатору(СтруктураДанныхЭлемента.ИдентификаторФильтра));
			СтруктураДанныхЭлемента.Вставить("ТипЭлемента"			, "ЗначениеФильтра");
			СтруктураДанныхЭлемента.Вставить("ДействиеЭлемента"		, "СброситьПериод");	
		КонецЕсли;
		
		
		

	КонецЕсли;
	
	Возврат СтруктураДанныхЭлемента;
	
КонецФункции

// Процедура - Обновить свойства разделов фильтра
//
// Параметры:
//  Форма				 - 	 - 
//  АктуализироватьФлаги - 	 - 
//
Процедура ОбновитьСвойстваРазделовФильтра(Форма, АктуализироватьФлаги = Ложь) Экспорт
	
	ИнициализироватьЗначенияФильтра = Ложь;
	АктуализироватьЗначенияФильтра 	= Ложь;
	ИмяТекущейСтраницы 				= Форма.Элементы.СтраницыЗначенийФильтров.ТекущаяСтраница.Имя;
	Для Каждого СтрокаФильтра Из Форма.ТаблицаФильтров Цикл
		Если АктуализироватьФлаги Тогда
			СтрокаФильтра.КоличествоАктивированныхЗначений = 0;
			Для Каждого ЭлементСпискаЗначенийФильтра Из СтрокаФильтра.СписокЗначений Цикл
				Если ЭлементСпискаЗначенийФильтра.Значение.Выбран <> ЭлементСпискаЗначенийФильтра.Значение.Активирован Тогда 
					ЭлементСпискаЗначенийФильтра.Значение.Выбран = ЭлементСпискаЗначенийФильтра.Значение.Активирован;
					СтрокаФильтра.Актуализирован = Ложь;
				КонецЕсли;
				Если ЭлементСпискаЗначенийФильтра.Значение.Выбран Тогда 
					СтрокаФильтра.КоличествоАктивированныхЗначений = СтрокаФильтра.КоличествоАктивированныхЗначений + 1;
				КонецЕсли;
				Если НЕ СтрокаФильтра.РеквизитДата = Дата(1,1,1) И ТипЗнч(СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра) = Тип("СтандартныйПериод") Тогда 
					Если НЕ СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра = СтрокаФильтра.СписокЗначений[0].Значение.ПрошлоеЗначениеФильтра Тогда 
						СтрокаФильтра.РеквизитДата = ?(СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.ДатаНачала = Дата(1,1,1), НачалоДня(ТекущаяДата()), СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.ДатаНачала);
						ЗаполнитьЗначенияСвойств(СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра, СтрокаФильтра.СписокЗначений[0].Значение.ПрошлоеЗначениеФильтра);
						СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.Вариант = СтрокаФильтра.СписокЗначений[0].Значение.ПрошлоеЗначениеФильтра.Вариант;
 						ОбновитьСвойстваКалендаря(Форма, СтрокаФильтра);
					КонецЕсли;
				Иначе
					Если СтрокаФильтра.КоличествоАктивированныхЗначений > 0 Тогда
						СтрокаФильтра.ВариантОтбора = Истина;
						Для Каждого ЭлементАктивированный Из Форма.Элементы[СтрокаФильтра.ИмяГруппыАктивированныхЗначенийФильтра].ПодчиненныеЭлементы Цикл 
							Если СтрНайти(ЭлементАктивированный.Заголовок, "Не ") <> 0 Тогда //(СтрНайти(ЭлементАктивированный.Заголовок, "Не ") <> 0 И СтрНайти(ЭлементАктивированный.Заголовок, "Не проведено") = 0) ИЛИ СтрНайти(ЭлементАктивированный.Заголовок, "Не Не проведено") <> 0 Тогда 
								СтрокаФильтра.ВариантОтбора = Ложь;
								Прервать;
							КонецЕсли;
						КонецЦикла;	
					Иначе 	
						СтрокаФильтра.ВариантОтбора = Истина;
					КонецЕсли;
					Форма.Элементы[СтрокаФильтра.ИмяКнопкиВариантОтбора].Заголовок = ?(СтрокаФильтра.ВариантОтбора = Истина, Нстр("ru = 'Равно'; en = 'Equals'"), Нстр("ru = 'Не равно'; en = 'Not equals'"));	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
		Если СтрокаФильтра.ИмяСтраницыЗначенийФильтра = ИмяТекущейСтраницы Тогда
			Если НЕ СтрокаФильтра.Инициализирован Тогда 
				ИнициализироватьЗначенияФильтра = Истина;
				ИдентификаторСтрокиФильтра 		= СтрокаФильтра.ПолучитьИдентификатор();
			ИначеЕсли НЕ СтрокаФильтра.Актуализирован Тогда 
				АктуализироватьЗначенияФильтра 	= Истина;
				ИдентификаторСтрокиФильтра 		= СтрокаФильтра.ПолучитьИдентификатор();
			КонецЕсли;	
			// Форма.Элементы[СтрокаФильтра.ИмяГруппыТипФильтра].ЦветФона 		= Новый Цвет(218, 230, 244);
			Форма.Элементы[СтрокаФильтра.ИмяТипФильтра].Родитель.ЦветФона 	= СтрокаФильтра.ЦветВыбранногоЗначения;// Новый Цвет(218, 230, 244);			
		    Форма.Элементы[СтрокаФильтра.ИмяТипФильтра].ЦветТекста 			= Новый Цвет();
			Форма.Элементы[СтрокаФильтра.ИмяКнопкиВариантОтбора].Видимость	= ?(СтрокаФильтра.РеквизитДата = Дата(1,1,1), Истина, Ложь);
			Форма.Элементы["ДекорацияКоличествоАктивированных_" + СтрокаФильтра.Наименование + "_Идентификатор_" + СтрокаФильтра.ПолучитьИдентификатор()].ЦветТекста = Новый Цвет();			
			// Форма.Элементы[СтрокаФильтра.ИмяТипФильтра].Заголовок 			= ?(СтрокаФильтра.КоличествоАктивированныхЗначений = 0, СтрокаФильтра.Представление, СтрокаФильтра.Представление + " (" + Строка(СтрокаФильтра.КоличествоАктивированныхЗначений) + ")");			
		Иначе 
			// Форма.Элементы[СтрокаФильтра.ИмяГруппыТипФильтра].ЦветФона 		= Новый Цвет(255, 255, 255);
			Форма.Элементы[СтрокаФильтра.ИмяТипФильтра].Родитель.ЦветФона 	= Новый Цвет(255, 255, 255);
		    Форма.Элементы[СтрокаФильтра.ИмяТипФильтра].ЦветТекста 			= Новый Цвет(0, 112, 210);
			Форма.Элементы[СтрокаФильтра.ИмяКнопкиВариантОтбора].Видимость	= Ложь;			
			// Форма.Элементы[СтрокаФильтра.ИмяТипФильтра].Заголовок 			= СтрокаФильтра.Представление;
			Форма.Элементы["ДекорацияКоличествоАктивированных_" + СтрокаФильтра.Наименование + "_Идентификатор_" + СтрокаФильтра.ПолучитьИдентификатор()].ЦветТекста = Новый Цвет(0, 128, 0);						
		КонецЕсли;
		Если СтрНайти(СтрокаФильтра.Наименование, "Вероятность") И СтрокаФильтра.ОписаниеТипаЗначения.СодержитТип(Тип("Число")) Тогда
			Форма.Элементы["ДекорацияКоличествоАктивированных_" + СтрокаФильтра.Наименование + "_Идентификатор_" + СтрокаФильтра.ПолучитьИдентификатор()].Заголовок = ?(СтрокаФильтра.НачалоЧисловогоДиапазона = 0 И СтрокаФильтра.КонецЧисловогоДиапазона = 0, "", "(1)");		
		Иначе 			
			Форма.Элементы["ДекорацияКоличествоАктивированных_" + СтрокаФильтра.Наименование + "_Идентификатор_" + СтрокаФильтра.ПолучитьИдентификатор()].Заголовок = ?(СтрокаФильтра.КоличествоАктивированныхЗначений = 0, "", "(" + Строка(СтрокаФильтра.КоличествоАктивированныхЗначений) + ")");		
		КонецЕсли;
		Если СтрНайти(СтрокаФильтра.Наименование, "Вероятность") И СтрокаФильтра.ОписаниеТипаЗначения.СодержитТип(Тип("Число")) Тогда
			Форма.Элементы["ДекорацияКоличествоАктивированных_" + СтрокаФильтра.Наименование + "_Идентификатор_" + СтрокаФильтра.ПолучитьИдентификатор()].Видимость = ?(СтрокаФильтра.НачалоЧисловогоДиапазона = 0 И СтрокаФильтра.КонецЧисловогоДиапазона = 0, Ложь, Истина);		
		ИначеЕсли СтрокаФильтра.КоличествоАктивированныхЗначений = 0 Тогда
			Форма.Элементы["ДекорацияКоличествоАктивированных_" + СтрокаФильтра.Наименование + "_Идентификатор_" + СтрокаФильтра.ПолучитьИдентификатор()].Видимость = Ложь;
			// Форма.Элементы[СтрокаФильтра.ИмяТипФильтра].Заголовок 			= СтрокаФильтра.Представление;
		Иначе
			Форма.Элементы["ДекорацияКоличествоАктивированных_" + СтрокаФильтра.Наименование + "_Идентификатор_" + СтрокаФильтра.ПолучитьИдентификатор()].Видимость = Истина;			
			// Форма.Элементы[СтрокаФильтра.ИмяТипФильтра].Заголовок 			= СтрокаФильтра.Представление; // + " (" + Строка(СтрокаФильтра.КоличествоАктивированныхЗначений) + ")";
		КонецЕсли;
	КонецЦикла;
	
	Если ИнициализироватьЗначенияФильтра Тогда 
		Форма.ОбновитьГруппуЗначенийФильтра(ИдентификаторСтрокиФильтра);
	ИначеЕсли АктуализироватьЗначенияФильтра Тогда
		ОбновитьСвойстваГруппыЗначенийФильтра(Форма, , ИдентификаторСтрокиФильтра);
	КонецЕсли;	
	
КонецПроцедуры	

// Процедура - Обновить свойства группы значений фильтра
//
// Параметры:
//  Форма						 - 	 - 
//  СтрокаФильтра				 - 	 - 
//  ИдентификаторСтрокиФильтра	 - 	 - 
//
Процедура ОбновитьСвойстваГруппыЗначенийФильтра(Форма, СтрокаФильтра = Неопределено, ИдентификаторСтрокиФильтра = Неопределено)
	
	Если СтрокаФильтра = Неопределено Тогда
		Если ИдентификаторСтрокиФильтра = Неопределено Тогда 
			Возврат;
		КонецЕсли;	
		СтрокаФильтра = Форма.ТаблицаФильтров.НайтиПоИдентификатору(ИдентификаторСтрокиФильтра);
	КонецЕсли;
	Если НЕ СтрокаФильтра.РеквизитДата = Дата(1,1,1) И ТипЗнч(СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра) = Тип("СтандартныйПериод") Тогда 
		ОбновитьСвойстваЭлементаЗначения(Форма, СтрокаФильтра, СтрокаФильтра.СписокЗначений[0]);
	Иначе 	
		Для Каждого ЭлементСпискаЗначенийФильтра Из СтрокаФильтра.СписокЗначений Цикл 
			Форма.Элементы[ЭлементСпискаЗначенийФильтра.Значение.ИмяГруппыЗначенияФильтра].ЦветФона 	= ?(ЭлементСпискаЗначенийФильтра.Значение.Выбран, СтрокаФильтра.ЦветВыбранногоЗначения, Новый Цвет(255, 255, 255));// Новый Цвет(218, 230, 244), Новый Цвет(255, 255, 255));	
			// Форма.Элементы[ЭлементСпискаЗначенийФильтра.Значение.ИмяКнопкиЗначенияФильтра].Отображение 	= ?(ЭлементСпискаЗначенийФильтра.Значение.Выбран, ОтображениеКнопки.КартинкаИТекст, ОтображениеКнопки.Текст);	
			// Форма.Элементы[ЭлементСпискаЗначенийФильтра.Значение.ИмяКнопкиЗначенияФильтра].ЦветТекста 	= ?(ЭлементСпискаЗначенийФильтра.Значение.Выбран, Новый Цвет(255, 255, 255), Новый Цвет());		
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры	

// Процедура - Обновить свойства элемента значения
//
// Параметры:
//  Форма						 - 	 - 
//  СтрокаФильтра				 - 	 - 
//  ЭлементСпискаЗначенийФильтра - 	 - 
//  ДанныеЭлементаФильтрации	 - 	 - 
//
Процедура ОбновитьСвойстваЭлементаЗначения(Форма, СтрокаФильтра = Неопределено, ЭлементСпискаЗначенийФильтра = Неопределено, ДанныеЭлементаФильтрации = Неопределено)
	
	Если СтрокаФильтра = Неопределено Тогда
		Если ДанныеЭлементаФильтрации = Неопределено ИЛИ ДанныеЭлементаФильтрации.Свойство("ИдентификаторФильтра") = Ложь Тогда 
			Возврат;
		КонецЕсли;			
		СтрокаФильтра = Форма[ДанныеЭлементаФильтрации.ИмяТаблицы].НайтиПоИдентификатору(ДанныеЭлементаФильтрации.ИдентификаторФильтра);
	КонецЕсли;	
	Если ЭлементСпискаЗначенийФильтра = Неопределено Тогда 
		Если НЕ СтрокаФильтра.РеквизитДата = Дата(1,1,1) И СтрокаФильтра.СписокЗначений.Количество() > 0 И ТипЗнч(СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра) = Тип("СтандартныйПериод") Тогда
			ЭлементСпискаЗначенийФильтра = СтрокаФильтра.СписокЗначений[0];
		ИначеЕсли ДанныеЭлементаФильтрации.Свойство("ИдентификаторЗначения") Тогда  	
			ЭлементСпискаЗначенийФильтра = СтрокаФильтра.СписокЗначений.НайтиПоИдентификатору(ДанныеЭлементаФильтрации.ИдентификаторЗначения);
		Иначе 
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
	
	ИмяТекущейСтраницы = Форма.Элементы.СтраницыЗначенийФильтров.ТекущаяСтраница.Имя;	
	
	// Форма.Элементы[СтрокаФильтра.ИмяТипФильтра].Заголовок 			= ?(СтрокаФильтра.КоличествоАктивированныхЗначений = 0, СтрокаФильтра.Представление, СтрокаФильтра.Представление + " (" + Строка(СтрокаФильтра.КоличествоАктивированныхЗначений) + ")");	
	Если СтрНайти(СтрокаФильтра.Наименование, "Вероятность") И СтрокаФильтра.ОписаниеТипаЗначения.СодержитТип(Тип("Число")) Тогда	
		Форма.Элементы["ДекорацияКоличествоАктивированных_" + СтрокаФильтра.Наименование + "_Идентификатор_" + СтрокаФильтра.ПолучитьИдентификатор()].Заголовок = ?(СтрокаФильтра.НачалоЧисловогоДиапазона = 0 И СтрокаФильтра.КонецЧисловогоДиапазона = 0, "", "(1)");		
		Форма.Элементы["ДекорацияКоличествоАктивированных_" + СтрокаФильтра.Наименование + "_Идентификатор_" + СтрокаФильтра.ПолучитьИдентификатор()].Видимость = ?(СтрокаФильтра.НачалоЧисловогоДиапазона = 0 И СтрокаФильтра.КонецЧисловогоДиапазона = 0, Ложь, Истина);				
	Иначе 
		Форма.Элементы["ДекорацияКоличествоАктивированных_" + СтрокаФильтра.Наименование + "_Идентификатор_" + СтрокаФильтра.ПолучитьИдентификатор()].Заголовок = ?(СтрокаФильтра.КоличествоАктивированныхЗначений = 0, "", "(" + Строка(СтрокаФильтра.КоличествоАктивированныхЗначений) + ")");		
		Форма.Элементы["ДекорацияКоличествоАктивированных_" + СтрокаФильтра.Наименование + "_Идентификатор_" + СтрокаФильтра.ПолучитьИдентификатор()].Видимость = ?(СтрокаФильтра.КоличествоАктивированныхЗначений = 0, Ложь, Истина);				
	КонецЕсли;	
	Если ТипЗнч(ЭлементСпискаЗначенийФильтра.Значение.ЗначениеФильтра) = Тип("СтандартныйПериод") Тогда
		Форма.Элементы[СтрокаФильтра.ИмяКнопкиВариантОтбора].Видимость	= Ложь;
	Иначе 	
		Форма.Элементы[СтрокаФильтра.ИмяКнопкиВариантОтбора].Видимость	= ?(СтрокаФильтра.КоличествоАктивированныхЗначений > 0 ИЛИ СтрокаФильтра.ИмяСтраницыЗначенийФильтра = ИмяТекущейСтраницы, Истина, Ложь);			
	КонецЕсли;
	
	Форма.Элементы[ЭлементСпискаЗначенийФильтра.Значение.ИмяГруппыЗначенияФильтра].ЦветФона 	= ?(ЭлементСпискаЗначенийФильтра.Значение.Выбран, СтрокаФильтра.ЦветВыбранногоЗначения, Новый Цвет(255, 255, 255));// Новый Цвет(218, 230, 244), Новый Цвет(255, 255, 255));	
	Если ТипЗнч(ЭлементСпискаЗначенийФильтра.Значение.ЗначениеФильтра) = Тип("СтандартныйПериод") Тогда
		Форма.Элементы[ЭлементСпискаЗначенийФильтра.Значение.ИмяКнопкиПериодаФильтра].Заголовок 	= ЭлементСпискаЗначенийФильтра.Представление;			
		Форма.Элементы[ЭлементСпискаЗначенийФильтра.Значение.ИмяКнопкиПериодаФильтра].ЦветТекста 	= ?(ЭлементСпискаЗначенийФильтра.Значение.Выбран, Новый Цвет(), Новый Цвет(65, 137, 199));	
	КонецЕсли;	
	// Форма.Элементы[ЭлементСпискаЗначенийФильтра.Значение.ИмяКнопкиЗначенияФильтра].Отображение 	= ?(ЭлементСпискаЗначенийФильтра.Значение.Выбран, ОтображениеКнопки.КартинкаИТекст, ОтображениеКнопки.Текст);	
	// Форма.Элементы[ЭлементСпискаЗначенийФильтра.Значение.ИмяКнопкиЗначенияФильтра].ЦветТекста 	= ?(ЭлементСпискаЗначенийФильтра.Значение.Выбран, Новый Цвет(255, 255, 255), Новый Цвет());		
	
КонецПроцедуры

// Процедура - Обновить свойства элемента варианта отбора
//
// Параметры:
//  Форма			 - 	 - 
//  СтрокаФильтра	 - 	 - 
//
Процедура ОбновитьСвойстваЭлементаВариантаОтбора(Форма, СтрокаФильтра)
	
	Форма.Элементы[СтрокаФильтра.ИмяКнопкиВариантОтбора].Заголовок = ?(СтрокаФильтра.ВариантОтбора = Истина, Нстр("ru = 'Равно'; en = 'Equals'"), Нстр("ru = 'Не равно'; en = 'Not equals'"));	
	
КонецПроцедуры	

// Процедура - Обновить свойства календаря
//
// Параметры:
//  Форма			 - 	 - 
//  СтрокаФильтра	 - 	 - 
//  Актуализирован	 - 	 - 
//
Процедура ОбновитьСвойстваКалендаря(Форма, СтрокаФильтра, Актуализирован = Ложь)
	
	СтрокаФильтра.СписокЗначений[0].Представление 				= ПолучитьПредставлениеПериода(СтрокаФильтра.СписокЗначений[0].Значение);
	Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяКнопкиПериодаФильтра].Заголовок = СтрокаФильтра.СписокЗначений[0].Представление;
	МинимальнаяДата 	= СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.ДатаНачала;
	МаксимальнаяДата 	= СтрокаФильтра.СписокЗначений[0].Значение.ЗначениеФильтра.ДатаОкончания;
	// Обновляем видимость нужных нам месяцев в календаре путем устаовки ограничений на календарь
	Если Макс(МинимальнаяДата, НачалоМесяца(ТекущаяДата())) < Мин(НачалоДня(МаксимальнаяДата), ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), 2)) Тогда
		Если МинимальнаяДата < НачалоМесяца(ТекущаяДата()) Тогда 
			Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].НачалоПериодаОтображения 	= МинимальнаяДата;
			Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].КонецПериодаОтображения 	= ДобавитьМесяц(МинимальнаяДата, 2);
		Иначе 	
			Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].НачалоПериодаОтображения 	= НачалоМесяца(ТекущаяДата());
			Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].КонецПериодаОтображения 	= ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), 2);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(МинимальнаяДата) И ЗначениеЗаполнено(МаксимальнаяДата) Тогда 
		Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].НачалоПериодаОтображения 	= МинимальнаяДата;
		Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].КонецПериодаОтображения 	= ДобавитьМесяц(МинимальнаяДата, 2);
	КонецЕсли;
	// После обновления - сбрасываем ограничения календаря
	Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].НачалоПериодаОтображения 	= Дата(1,1,1);
	Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].КонецПериодаОтображения 	= Дата(1,1,1);
	// Очищаем массив выделенных дат в календаре
	Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].ВыделенныеДаты.Очистить();
	// Накидываем в массив выделенных дат календаря новые даты
	Если ЗначениеЗаполнено(МинимальнаяДата) И ЗначениеЗаполнено(МаксимальнаяДата) Тогда
		Пока МинимальнаяДата <= МаксимальнаяДата Цикл 
			Форма.Элементы[СтрокаФильтра.СписокЗначений[0].Значение.ИмяПоляКалендаряФильтра].ВыделенныеДаты.Добавить(МинимальнаяДата);
			МинимальнаяДата = МинимальнаяДата + 86400;
		КонецЦикла;
	КонецЕсли;
	СтрокаФильтра.Актуализирован = Актуализирован;
	
КонецПроцедуры

// Функция - Получить представление периода
//
// Параметры:
//  СтруктураЗначения	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПредставлениеПериода(СтруктураЗначения)
	
	ПредставлениеПериода = "";
	СтруктураЗначения.СписокСтандартныхПериодов.ЗаполнитьПометки(Ложь);
	Если СтруктураЗначения.ЗначениеФильтра.ДатаНачала = Дата(1,1,1) И СтруктураЗначения.ЗначениеФильтра.ДатаОкончания = Дата(1,1,1) Тогда 
		ПредставлениеПериода = СтруктураЗначения.ПредставлениеПустогоПериода;
	Иначе
		Если СтруктураЗначения.ЗначениеФильтра.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда 
			Если ЗначениеЗаполнено(СтруктураЗначения.ЗначениеФильтра.ДатаНачала) И ЗначениеЗаполнено(СтруктураЗначения.ЗначениеФильтра.ДатаОкончания) Тогда
				ПериодНеПроизвольный = Новый СтандартныйПериод();
				Для Каждого ВариантаП Из ВариантСтандартногоПериода Цикл
					Если ВариантаП = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда 
						Продолжить;
					КонецЕсли;	
					ПериодНеПроизвольный.Вариант = ВариантаП; 
					Если ПериодНеПроизвольный.ДатаНачала = СтруктураЗначения.ЗначениеФильтра.ДатаНачала И ПериодНеПроизвольный.ДатаОкончания = СтруктураЗначения.ЗначениеФильтра.ДатаОкончания Тогда
						СтруктураЗначения.ЗначениеФильтра.Вариант = ВариантаП;
						ПредставлениеПериода = Строка(СтруктураЗначения.ЗначениеФильтра.Вариант);
						ЭлементСтандартныйПериод = СтруктураЗначения.СписокСтандартныхПериодов.НайтиПоЗначению(СтруктураЗначения.ЗначениеФильтра.Вариант);
						Если НЕ ЭлементСтандартныйПериод = Неопределено Тогда 
							ЭлементСтандартныйПериод.Пометка = Истина;
						КонецЕсли;	
						Прервать;
					КонецЕсли;	
				КонецЦикла;
				Если НЕ ЗначениеЗаполнено(ПредставлениеПериода) Тогда 
					Если НачалоДня(СтруктураЗначения.ЗначениеФильтра.ДатаНачала) = СтруктураЗначения.ЗначениеФильтра.ДатаНачала
								И КонецДня(СтруктураЗначения.ЗначениеФильтра.ДатаОкончания) = СтруктураЗначения.ЗначениеФильтра.ДатаОкончания
								И КонецДня(СтруктураЗначения.ЗначениеФильтра.ДатаНачала) = СтруктураЗначения.ЗначениеФильтра.ДатаОкончания Тогда 
						ПредставлениеПериода = Формат(СтруктураЗначения.ЗначениеФильтра.ДатаНачала, "ДФ='д ММММ гггг'");				
					ИначеЕсли НачалоМесяца(СтруктураЗначения.ЗначениеФильтра.ДатаНачала) = СтруктураЗначения.ЗначениеФильтра.ДатаНачала
								И КонецМесяца(СтруктураЗначения.ЗначениеФильтра.ДатаОкончания) = СтруктураЗначения.ЗначениеФильтра.ДатаОкончания
								И КонецМесяца(СтруктураЗначения.ЗначениеФильтра.ДатаНачала) = СтруктураЗначения.ЗначениеФильтра.ДатаОкончания Тогда 
						ПредставлениеПериода = Формат(СтруктураЗначения.ЗначениеФильтра.ДатаНачала, "ДФ='ММММ гггг'");
					Иначе 	
						ПредставлениеПериода = Формат(СтруктураЗначения.ЗначениеФильтра.ДатаНачала, "ДФ=d.MM.yy") + " - " + Формат(СтруктураЗначения.ЗначениеФильтра.ДатаОкончания, "ДФ=dd.MM.yy");			
					КонецЕсли;
				КонецЕсли;
			Иначе 
				Если НЕ ЗначениеЗаполнено(СтруктураЗначения.ЗначениеФильтра.ДатаНачала) Тогда 
					ПредставлениеПериода = Нстр("ru = 'по '; en = 'to '") + Формат(СтруктураЗначения.ЗначениеФильтра.ДатаОкончания, "ДФ=d.MM.yy");			
				ИначеЕсли НЕ ЗначениеЗаполнено(СтруктураЗначения.ЗначениеФильтра.ДатаОкончания) Тогда 	
					ПредставлениеПериода = Нстр("ru = 'с '; en = 'from '") + Формат(СтруктураЗначения.ЗначениеФильтра.ДатаНачала, "ДФ=d.MM.yy");			
				КонецЕсли;	
			КонецЕсли;	
		Иначе
			СтруктураЗначения.СписокСтандартныхПериодов.ЗаполнитьПометки(Ложь);			
			ЭлементСтандартныйПериод = СтруктураЗначения.СписокСтандартныхПериодов.НайтиПоЗначению(СтруктураЗначения.ЗначениеФильтра.Вариант);
			Если НЕ ЭлементСтандартныйПериод = Неопределено Тогда 
				ЭлементСтандартныйПериод.Пометка = Истина;
			КонецЕсли;				
			ПредставлениеПериода = Строка(СтруктураЗначения.ЗначениеФильтра.Вариант);
		КонецЕсли;
	КонецЕсли;	

	Возврат ПредставлениеПериода;
	
КонецФункции	

// Функция - Получить значения фильтра
//
// Параметры:
//  ТаблицаФильтров		 - 	 - 
//  НаименованиеФильтра	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЗначенияФильтра(ТаблицаФильтров, НаименованиеФильтра = "") Экспорт
	
	СписокЗначенийФильтрации = Новый СписокЗначений;
	
	#Если ВебКлиент Тогда
		ИмяСвойства = ?(
			ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СписокЗначенийФильтрации, "ДопустимыеЗначения"),
			"ДопустимыеЗначения",
			"ДоступныеЗначения"
		);
	#Иначе
		ИмяСвойства = "ДоступныеЗначения";
	#КонецЕсли
	
	СписокЗначенийФильтрации[ИмяСвойства] = Новый СписокЗначений;
	
	Если НЕ ЗначениеЗаполнено(НаименованиеФильтра) Тогда 
		Возврат СписокЗначенийФильтрации;
	КонецЕсли;
	
	МассивСтрокФильтра = ТаблицаФильтров.НайтиСтроки(Новый Структура("Наименование, Применен", НаименованиеФильтра, Истина));
	Если МассивСтрокФильтра.Количество() = 0 ИЛИ МассивСтрокФильтра.Количество() > 1 Тогда 
		Возврат СписокЗначенийФильтрации;
	КонецЕсли;
	
	СписокЗначенийФильтрации.ТипЗначения = МассивСтрокФильтра[0].ОписаниеТипаЗначения;
	
	МассивДопустимыхЗначений = Новый Массив;
	Если МассивСтрокФильтра[0].ТолькоПолеВыбора Тогда 
		Если ТипЗнч(МассивСтрокФильтра[0].ПараметрыПолеВыбора.ПараметрыВыбора) = Тип("ФиксированныйМассив") И МассивСтрокФильтра[0].ПараметрыПолеВыбора.ПараметрыВыбора.Количество() > 0 Тогда 
			Для Каждого ЭлементОтбора Из МассивСтрокФильтра[0].ПараметрыПолеВыбора.ПараметрыВыбора Цикл 
				Если ЭлементОтбора.Имя = "Отбор.Ссылка" И ТипЗнч(ЭлементОтбора.Значение) = Тип("ФиксированныйМассив") Тогда 
					МассивДопустимыхЗначений = Новый Массив(ЭлементОтбора.Значение);
					Прервать;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;	
	Для Каждого ЭлементСписка Из МассивСтрокФильтра[0].СписокЗначений Цикл 
		СписокЗначенийФильтрации[ИмяСвойства].Добавить(ЭлементСписка.Значение.ЗначениеФильтра, ?(МассивСтрокФильтра[0].ВариантОтбора, "", "НЕ "));
		Если ЭлементСписка.Значение.Активирован Тогда 
			СписокЗначенийФильтрации.Добавить(ЭлементСписка.Значение.ЗначениеФильтра, ЭлементСписка.Представление);
		КонецЕсли;
	КонецЦикла;	
	Для Каждого ЭлементМассива Из МассивДопустимыхЗначений Цикл
		ЭлементСписка = СписокЗначенийФильтрации[ИмяСвойства].НайтиПоЗначению(ЭлементМассива);
		Если ЭлементСписка = Неопределено Тогда 
			СписокЗначенийФильтрации[ИмяСвойства].Добавить(ЭлементМассива, ?(МассивСтрокФильтра[0].ВариантОтбора, "", "НЕ "));
			//Если ЭлементСписка.Значение.Активирован Тогда 
			//	СписокЗначенийФильтрации.Добавить(ЭлементСписка.Значение.ЗначениеФильтра, ЭлементСписка.Представление);
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат СписокЗначенийФильтрации;
	
КонецФункции

#КонецОбласти

#КонецОбласти
