
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) И НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		
		ДатаНачала    = НачалоГода(ТекущаяДата());
		ДатаОкончания = ТекущаяДата();
		
	КонецЕсли;
	
	// Устанавливаем значение параметра "Организация".
	Если Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация")) <> Неопределено Тогда
		Идентификатор = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация")).ИдентификаторПользовательскойНастройки;
		Параметр = ЭтаФорма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
		Если Параметр <> Неопределено И Параметр.Значение.Пустая() Тогда
			ЗначениеНастройки = ПользователиСтоматология.ПолучитьЗначениеПоУмолчаниюПользователя(ОбщегоНазначения.ТекущийПользователь(), "ОсновнаяОрганизация");
			Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
				Параметр.Значение = ЗначениеНастройки;
			Иначе
				Параметр.Значение = ПолучитьОрганизациюПоСтруктурнойЕдинице();
			КонецЕсли;
			Параметр.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Устанавливаем значение параметра "СтруктурнаяЕдиница".
	Если  Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтруктурнаяЕдиница")) <> Неопределено Тогда
		Идентификатор = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтруктурнаяЕдиница")).ИдентификаторПользовательскойНастройки;
		Параметр = ЭтаФорма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
		Если Параметр <> Неопределено И Параметр.Значение.Пустая() Тогда
			ЗначениеНастройки = ПолучитьСтруктурнуюЕдиницуПоТекущемуПользователю();
			Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
				Параметр.Значение = ЗначениеНастройки;
			Иначе
				Параметр.Значение = ПолучитьТекущуюСтруктурнуюЕдиницу();
			КонецЕсли;
			Параметр.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.СтруктурнаяЕдиницаНадпись.Заголовок = Параметр.Значение;
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "УстановитьИнтервал".
//
&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	
	Диалог.Период.ДатаНачала    = ДатаНачала;
	Диалог.Период.ДатаОкончания = ДатаОкончания;
	
	Диалог.Показать(Новый ОписаниеОповещения("ПослеРедактированияДиалога",ЭтотОбъект,Новый Структура("ДиалогПериода",Диалог)));		
			
КонецПроцедуры // УстановитьИнтервал()

&НаКлиенте
Процедура ПослеРедактированияДиалога(Период,ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Период) Тогда
		ДатаНачала    = Период.ДатаНачала;
		ДатаОкончания = Период.ДатаОкончания;
	КонецЕсли;
	
Конецпроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Функция возвращает организацию по текущей структурной единице.
//
Функция ПолучитьОрганизациюПоСтруктурнойЕдинице()
	
	Возврат ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.Организация;
	
КонецФункции

&НаСервере
// Функция возвращает текущую структурную единицу.
//
Функция ПолучитьТекущуюСтруктурнуюЕдиницу()
	
	Возврат ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	
КонецФункции

&НаСервере
// Функция возвращает структурную единицу по текущему пользователю.
//
Функция ПолучитьСтруктурнуюЕдиницуПоТекущемуПользователю()
	
	ДоступныеСтруктурныеЕдиницы = Справочники.Сотрудники.ПолучитьМестаРаботыСотрудника(ПараметрыСеанса.ТекущийСотрудники,"Массив");
	Возврат ?(ДоступныеСтруктурныеЕдиницы.Количество() > 0, ДоступныеСтруктурныеЕдиницы[0], Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
	
КонецФункции

#КонецОбласти
