
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Открытие формы выбора клиентов
//
Процедура КлиентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура("ТекущаяСтрока", Клиент);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораКлиенты", ПараметрыОткрытия,,,,, Новый ОписаниеОповещения("КлиентНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(Результат) Тогда
		ЭтотОбъект.Клиент = Результат;
	КонецЕсли;      
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
//
//
Процедура ВывестиИнформациюПоКлиенту(Команда)
//	СформироватьОтчет();
	ВывестиОтчет();
	
КонецПроцедуры

 #КонецОбласти
 
#Область СлужебныеПроцедурыИФункции
 
&НаСервере
//
//
Процедура ВывестиОтчет()
	
	Отчеты.ИнформацияПоКлиенту.ВывестиИнформациюПоКонграгенту(Клиент, СтруктурнаяЕдиница, ДанныеОКлиенте);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаРасшифровки"
//
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Клик по пиктограмме печати документа
	Если  ТипЗнч(Расшифровка)=Тип("Строка") И Расшифровка="ПечатьОтчета" Тогда
		СтандартнаяОбработка=Ложь;
		ДанныеОКлиенте.Напечатать(РежимИспользованияДиалогаПечати.Использовать);
	КонецЕсли;  	
	
КонецПроцедуры 

#КонецОбласти