
#Область ОбработчикиСобытийЭлементовШапкиФормы
////////////////////// ОБРАБОТЧИКИ ЭЛЕМЕНТОВ ОТБОРА /////////////////////////

&НаКлиенте
// При изменении отбора по СЕ
Процедура СтрЕдиницаОтборПриИзменении(Элемент)
      ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", ОтборСтрЕдиница, ЗначениеЗаполнено(ОтборСтрЕдиница));
КонецПроцедуры

&НаКлиенте
// При изменении отбора по контрагенту
Процедура КонтрагентОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", ОтборКонтрагент, ЗначениеЗаполнено(ОтборКонтрагент));
КонецПроцедуры

#КонецОбласти
