
#Область ОбработчикиСобытий

 // Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылкаСписаниеЗапасов, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписаниеМатериаловЗапасы.НомерСтроки КАК НомерСтроки,
	|	СписаниеМатериаловЗапасы.Ссылка КАК Документ,
	|	СписаниеМатериаловЗапасы.Склад КАК Склад,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	СписаниеМатериаловЗапасы.Ссылка.Дата КАК Период,
	|	СписаниеМатериаловЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СписаниеМатериаловЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА СписаниеМатериаловЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	СписаниеМатериаловЗапасы.Количество КАК Количество
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.СписаниеМатериалов.Запасы КАК СписаниеМатериаловЗапасы
	|ГДЕ
	|	СписаниеМатериаловЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписаниеМатериаловЗапасы.НомерСтроки КАК НомерСтроки,
	|	СписаниеМатериаловЗапасы.Номенклатура КАК Материал,
	|	СписаниеМатериаловЗапасы.Услуга,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	СписаниеМатериаловЗапасы.Ссылка.Дата КАК Период,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА СписаниеМатериаловЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	СписаниеМатериаловЗапасы.Количество КАК Количество,
	|	СписаниеМатериаловЗапасы.Склад,
	|	СписаниеМатериаловЗапасы.Контрагент,
	|	СписаниеМатериаловЗапасы.Сотрудник,
	|	СписаниеМатериаловЗапасы.ДокументПродажи,
	|	СписаниеМатериаловЗапасы.СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасыМатериалыКСписанию
	|ИЗ
	|	Документ.СписаниеМатериалов.Запасы КАК СписаниеМатериаловЗапасы
	|ГДЕ
	|	СписаниеМатериаловЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(СписаниеМатериаловЗапасы.НомерСтроки) КАК НомерСтроки,
	|	СписаниеМатериаловЗапасы.Ссылка.Дата КАК Период,
	|	СписаниеМатериаловЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.РасходыСебестоимость) КАК СчетДт,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Запасы) КАК СчетКт,
	|	СписаниеМатериаловЗапасы.Услуга.Специализация КАК СубконтоДт1,
	|	ВЫБОР
	|		КОГДА СписаниеМатериаловЗапасы.ДокументПродажи.ПолисМедСтрахования <> ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяССылка)
	|			ТОГДА СписаниеМатериаловЗапасы.ДокументПродажи.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ СписаниеМатериаловЗапасы.Контрагент
	|	КОНЕЦ КАК СубконтоДт2,
	|	ВЫБОР
	|		КОГДА СписаниеМатериаловЗапасы.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА СписаниеМатериаловЗапасы.Сотрудник
	|		ИНАЧЕ СписаниеМатериаловЗапасы.ДокументПродажи.Сотрудник
	|	КОНЕЦ КАК СубконтоДт3,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.Материалы) КАК СубконтоДт4,
	|	СписаниеМатериаловЗапасы.Номенклатура КАК СубконтоКт1,
	|	СписаниеМатериаловЗапасы.Склад КАК СубконтоКт2,
	|	0 КАК Сумма,
	|	СУММА(СписаниеМатериаловЗапасы.Количество) КАК Количество,
	|	""Списание материалов"" КАК Содержание
	|ПОМЕСТИТЬ ВременнаяТаблицаУправленческий
	|ИЗ
	|	Документ.СписаниеМатериалов.Запасы КАК СписаниеМатериаловЗапасы
	|ГДЕ
	|	СписаниеМатериаловЗапасы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СписаниеМатериаловЗапасы.Ссылка.Дата,
	|	СписаниеМатериаловЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	СписаниеМатериаловЗапасы.Номенклатура,
	|	СписаниеМатериаловЗапасы.Склад,
	|	ВЫБОР
	|		КОГДА СписаниеМатериаловЗапасы.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА СписаниеМатериаловЗапасы.Сотрудник
	|		ИНАЧЕ СписаниеМатериаловЗапасы.ДокументПродажи.Сотрудник
	|	КОНЕЦ,
	|	СписаниеМатериаловЗапасы.Услуга.Специализация,
	|	ВЫБОР
	|		КОГДА СписаниеМатериаловЗапасы.ДокументПродажи.ПолисМедСтрахования <> ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяССылка)
	|			ТОГДА СписаниеМатериаловЗапасы.ДокументПродажи.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ СписаниеМатериаловЗапасы.Контрагент
	|	КОНЕЦ";
			
	Запрос.УстановитьПараметр("Ссылка"            , ДокументСсылкаСписаниеЗапасов);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	
	Запрос.ВыполнитьПакет();
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаСписаниеЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаМатериалыКСписанию(ДокументСсылкаСписаниеЗапасов, СтруктураДополнительныеСвойства);	
	СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства);

	
КонецПроцедуры // ИнициализироватьДанныеДокумента()


// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаСписаниеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	ТаблицаЗапасыНаСкладах.ВидДвижения,
	|	ТаблицаЗапасыНаСкладах.Период,
	|	ТаблицаЗапасыНаСкладах.Склад,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Партия,
	|	СУММА(ТаблицаЗапасыНаСкладах.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыНаСкладах
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыНаСкладах.Период,
	|	ТаблицаЗапасыНаСкладах.ВидДвижения,
	|	ТаблицаЗапасыНаСкладах.Склад,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Партия";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасыНаСкладах()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
// 
Процедура СформироватьТаблицаМатериалыКСписанию(ДокументСсылкаСписаниеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ТаблицаЗапасыНаСкладах.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасыНаСкладах.Период,
	|	ТаблицаЗапасыНаСкладах.Склад,
	|	ТаблицаЗапасыНаСкладах.Материал,
	|	ТаблицаЗапасыНаСкладах.Услуга,
	|	ТаблицаЗапасыНаСкладах.Сотрудник,
	|	ТаблицаЗапасыНаСкладах.Контрагент КАК Клиент,
	|	ТаблицаЗапасыНаСкладах.ДокументПродажи,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Партия КАК Партия,
	|	СУММА(ТаблицаЗапасыНаСкладах.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасыМатериалыКСписанию КАК ТаблицаЗапасыНаСкладах
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыНаСкладах.Период,
	|	ТаблицаЗапасыНаСкладах.Склад,
	|	ТаблицаЗапасыНаСкладах.Материал,
	|	ТаблицаЗапасыНаСкладах.Партия,
	|	ТаблицаЗапасыНаСкладах.Сотрудник,
	|	ТаблицаЗапасыНаСкладах.Контрагент,
	|	ТаблицаЗапасыНаСкладах.ДокументПродажи,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Услуга";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаМатериалыКСписанию", РезультатЗапроса.Выгрузить());
	
	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	ВременнаяТаблицаУправленческий.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ВременнаяТаблицаУправленческий.СубконтоДт1,
	|   ВременнаяТаблицаУправленческий.СубконтоДт2,
	|	ВременнаяТаблицаУправленческий.СубконтоДт3,
	|   ВременнаяТаблицаУправленческий.СубконтоДт4, 
	|	ВременнаяТаблицаУправленческий.СубконтоКт1,
	|	ВременнаяТаблицаУправленческий.СубконтоКт2,
	|	ВременнаяТаблицаУправленческий.Сумма КАК Сумма,
	|	ВременнаяТаблицаУправленческий.Количество КАК Количество,
	|	ВременнаяТаблицаУправленческий.Содержание
	|ИЗ
	|	ВременнаяТаблицаУправленческий КАК ВременнаяТаблицаУправленческий
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

#КонецОбласти