
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)  Экспорт
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
			И ДанныеЗаполнения.Свойство("ВидОперации") Тогда
			
			ВидОперации = ДанныеЗаполнения.ВидОперации;
			Если ВидОперации = Перечисления.ВидыОпераций.ПоСкладу Тогда
				Склад        = Справочники.Склады.ПустаяСсылка();
			ИначеЕсли ВидОперации = Перечисления.ВидыОпераций.ПоСотруднику Тогда
				Склад        = Справочники.Сотрудники.ПустаяСсылка();
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	                       
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	// Инициализация дополнительных свойств для проведения документа.
	ДвиженияДокументовСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.СписаниеМатериалов.УстановитьНачальныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ДополнительныеСвойства.ДляПроведения.Вставить("ВыполнятьДвиженияСебестоимость", Истина);
    ДополнительныеСвойства.Вставить("СтруктураПолейПерегрузка", Новый Структура("Склад, СтруктурнаяЕдиница, Сотрудник, ДокументПродажи, Контрагент, Услуга", "Склад", "СтруктурнаяЕдиница", "Сотрудник", "ДокументПродажи", "Контрагент", "Услуга"));	
	УправлениеЗапасамиПартионныйУчет.СформироватьСписаниеТаблицаПартииТоваров(Ссылка.Запасы, ДополнительныеСвойства, Движения, Отказ);
	// Движения по регистрам
	ДвиженияДокументовСервер.ЗапасыНаСкладах(ДополнительныеСвойства, Движения, Отказ);   	
	ДвиженияДокументовСервер.ПартииТоваров(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.ПродажиСебестоимость(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.МатериалыКСписанию(ДополнительныеСвойства, Движения, Отказ);
	ТаблицаУправленческийДобавитьДвиженияПоПартиям(ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий
	                                              ,ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПартииТоваров);
	ДвиженияДокументовСервер.Управленческий(ДополнительныеСвойства, Движения, Отказ);

	// Запись наборов записей.
	ДвиженияДокументовСервер.ДобавитьНаборыЗаписей(ЭтотОбъект);
	
	
КонецПроцедуры

  #КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура добавляет необходимы движения по партиям 
// в таблицу движений регистра управленческий
Процедура ТаблицаУправленческийДобавитьДвиженияПоПартиям(ТаблицаУправленческий, ТаблицаПартии)
	
	ВременнаяТаблица = ТаблицаПартии.Скопировать();
    ВременнаяТаблица.Свернуть("Номенклатура,Склад","Стоимость,Количество");	
	Для Каждого СтрокаТ ИЗ ВременнаяТаблица Цикл	
		НайденныеСтроки = ТаблицаУправленческий.НайтиСтроки(Новый Структура("СубконтоКт1,СубконтоКт2",СтрокаТ.Номенклатура,СтрокаТ.Склад));
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденныеСтроки[0].Сумма              = СтрокаТ.Стоимость;
			НайденныеСтроки[0].Количество         = СтрокаТ.Количество;
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры

#КонецОбласти
