
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	Список.Параметры.УстановитьЗначениеПараметра("НаДату", ТекущаяДатаСеанса());
	
	Если Параметры.Свойство("Цена") Тогда
		
		МодифицироватьЗапрос();
		Элементы.ТипНоменклатуры.Видимость = Ложь;
		Список.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиница", Параметры.СтруктурнаяЕдиница);
		Список.Параметры.УстановитьЗначениеПараметра("ВидЦен", Параметры.ВидЦен);
		Список.Параметры.УстановитьЗначениеПараметра("НаДату", Параметры.Дата);
		Элементы.Цена.Видимость = Истина;
		
	ИначеЕсли Параметры.Свойство("ТипНоменклатуры") Тогда 
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипНоменклатуры");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ; // Опционально
		ЭлементОтбора.ПравоеЗначение = Параметры.ТипНоменклатуры;
		
	КонецЕсли;
	
	Если Параметры.Свойство("МножественныйВыбор") Тогда
		Элементы.Список.МножественныйВыбор = ?(НЕ Параметры.МножественныйВыбор = Неопределено, Параметры.МножественныйВыбор, Ложь);
	КонецЕсли;
	
	Если Параметры.Свойство("ВыборЭлементов") Тогда
		Элементы.Список.ВыборГруппИЭлементов = ?(НЕ Параметры.ВыборЭлементов = Неопределено, ИспользованиеГруппИЭлементов.Элементы, ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	КонецЕсли;
	
	Если Параметры.Свойство("МассивНоменклатур") Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ; // Опционально
		ЭлементОтбора.ПравоеЗначение = Параметры.МассивНоменклатур;
		
		// Начало УО Видимость.
		РодительМассивНоменклатур = ПолучитьРодителейНоменклатур(Параметры.МассивНоменклатур);
		
		СписокНоменклатур = Новый СписокЗначений();
		СписокНоменклатур.ЗагрузитьЗначения(Параметры.МассивНоменклатур);
		Для каждого СтрокаМассива Из РодительМассивНоменклатур Цикл
			СписокНоменклатур.Добавить(СтрокаМассива);
		КонецЦикла;
			
		ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Отображать",Ложь);
		
		ОтборПоГруппе = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоГруппе.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ОтборПоГруппе.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
		ОтборПоГруппе.ПравоеЗначение = СписокНоменклатур;
		// Конец УО Видимость.
				
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереФрагмент(ЭлементМассива, ЭлементОформления)
	
	ОтборПоГруппе = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоГруппе.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ОтборПоГруппе.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборПоГруппе.ПравоеЗначение = ЭлементМассива; 
	
	Если ЭлементМассива.ЭтоГруппа 
		И ЗначениеЗаполнено(ЭлементМассива.Родитель) Тогда
		
		ПриСозданииНаСервереФрагмент(ЭлементМассива.Родитель, ЭлементОформления);  
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии"
//
Процедура ПриОткрытии(Отказ)
	
	Если ТипЗнч(ЭтаФорма.ВладелецФормы) = Тип("УправляемаяФорма") И ЭтаФорма.ВладелецФормы.ИмяФормы = "Документ.Событие.Форма.ФормаДокумента" Тогда
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаВыбрать.Заголовок = "Выбрать и закрыть";
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаВыбратьМножественно.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура выполняет изменение запроса динамического списка
//
Процедура МодифицироватьЗапрос()
	
	Список.ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникНоменклатура.Ссылка КАК Ссылка,
	|	СправочникНоменклатура.Артикул КАК Артикул,
	|	СправочникНоменклатура.ПометкаУдаления КАК ПометкаУдаления,
	|	СправочникНоменклатура.Предопределенный КАК Предопределенный,
	|	СправочникНоменклатура.Родитель КАК Родитель,
	|	СправочникНоменклатура.ЭтоГруппа КАК ЭтоГруппа,
	|	СправочникНоменклатура.Код КАК Код,
	|	СправочникНоменклатура.Наименование КАК Наименование,
	|	СправочникНоменклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	СправочникНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	СправочникНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СправочникНоменклатура.УпаковкаДляОтчета КАК УпаковкаДляОтчета,
	|	СправочникНоменклатура.СтавкаНДС КАК СтавкаНДС,
	|	СправочникНоменклатура.ИспользоватьПартии КАК ИспользоватьПартии,
	|	СправочникНоменклатура.Номинал КАК Номинал,
	|	СправочникНоменклатура.ВестиСерийныеНомера КАК ВестиСерийныеНомера,
	|	СправочникНоменклатура.ТипСрокаДействия КАК ТипСрокаДействия,
	|	СправочникНоменклатура.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	СправочникНоменклатура.Периодичность КАК Периодичность,
	|	СправочникНоменклатура.КоличествоПериодовДействия КАК КоличествоПериодовДействия,
	|	СправочникНоменклатура.НормаВремени КАК НормаВремени,
	|	СправочникНоменклатура.Специализация КАК Специализация,
	|	ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент, 1) КАК Цена,
	|	ВЫБОР
	|		КОГДА СправочникНоменклатура.ЭтоГруппа
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ЕСТЬNULL(СтатусыНоменклатурыСрезПоследних.ВПродаже, ИСТИНА)
	|	КОНЕЦ КАК ВПродаже
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&НаДату,
	|				Актуальность = ИСТИНА
	|					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|					И ВидЦен = &ВидЦен
	|					И Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО СправочникНоменклатура.Ссылка = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыНоменклатуры.СрезПоследних(&НаДату, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК СтатусыНоменклатурыСрезПоследних
	|				ПО (СтатусыНоменклатурыСрезПоследних.Номенклатура = СправочникНоменклатура.Ссылка)";
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик команды выбора номенклатуры.
//
Процедура ВыбратьМножественно(Команда)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено И Элементы.Список.ТекущиеДанные.ЭтоГруппа = Ложь И Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		Оповестить("ВыборНоменклатуры", Элементы.Список.ТекущаяСтрока, ЭтаФорма.ВладелецФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - Получить родителей номенклатур.
//
// Параметры:
//  МассивНоменклатур	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
 Функция ПолучитьРодителейНоменклатур(МассивНоменклатур)
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	 |	Номенклатура.Родитель КАК Родитель
	 |ИЗ
	 |	Справочник.Номенклатура КАК Номенклатура
	 |ГДЕ
	 |	Номенклатура.Ссылка В(&МассивНоменклатур)";
	 Запрос.УстановитьПараметр("МассивНоменклатур", МассивНоменклатур);
	 
	 ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	 
	 МассивГруппНоменклатур = Новый Массив();
	 
	 Пока ВыборкаЗапроса.Следующий() Цикл
		 ДобавитьВМассивРекурсивно(ВыборкаЗапроса.Родитель, МассивГруппНоменклатур);	 
	 КонецЦикла;	 
	 
	 Возврат МассивГруппНоменклатур;
	 
 КонецФункции
 
&НаСервере
// Процедура - Добавить в массив рекурсивно.
//
// Параметры:
//  ЭлементВыборки			 - 	 - 
//  МассивГруппНоменклатур	 - 	 - 
//
 Процедура ДобавитьВМассивРекурсивно(ЭлементВыборки, МассивГруппНоменклатур)
	 
	 МассивГруппНоменклатур.Добавить(ЭлементВыборки);
	 Если ЗначениеЗаполнено(ЭлементВыборки.Родитель) Тогда 
		 
		 НайденнаяСтрока = МассивГруппНоменклатур.Найти(ЭлементВыборки.Родитель);
		 Если НайденнаяСтрока = Неопределено Тогда
			 ДобавитьВМассивРекурсивно(ЭлементВыборки.Родитель, МассивГруппНоменклатур);
		 КонецЕсли;
		 
	 КонецЕсли;	
	 
 КонецПроцедуры

 #КонецОбласти