
#Область ОбработчикиСобытийФормы

&НаСервере
//
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокОпераций.Добавить(Перечисления.ВидыОпераций.ПоСкладу);
	СписокОпераций.Добавить(Перечисления.ВидыОпераций.ПоСотруднику);
	СтрЕдиницаОтбор = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтрЕдиницаОтбор, ЗначениеЗаполнено(СтрЕдиницаОтбор));

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля СтрЕдиницаОтбор
//
Процедура СтрЕдиницаОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтрЕдиницаОтбор, ЗначениеЗаполнено(СтрЕдиницаОтбор));
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля СкладОтбор
//
Процедура СкладОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Склад", СкладОтбор, ЗначениеЗаполнено(СкладОтбор));
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ВидОперацииОтбор
//
Процедура ВидОперацииОтборПриИзменении(Элемент)
	
	ТипСтр = "СправочникСсылка.";
	Если ВидОперацииОтбор = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоСкладу") Тогда
		ТипСтр = ТипСтр + "Склады";
		Элементы.СкладОтбор.Заголовок = "Склад";
	ИначеЕсли ВидОперацииОтбор = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоСотруднику") Тогда
		ТипСтр                                     = ТипСтр + "Сотрудники";
		Элементы.СкладОтбор.Заголовок              = "Персонал";
	Иначе
		Возврат;
	КонецЕсли;	
	Элементы.СкладОтбор.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ВидОперации", ВидОперацииОтбор, ЗначениеЗаполнено(ВидОперацииОтбор));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
//
//
Процедура СоздатьПоСотруднику(Команда)
	
	СоздатьСписаниеЗапасов(1);
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура СоздатьПоСкладу(Команда)
	
	СоздатьСписаниеЗапасов(0);
	
КонецПроцедуры

&НаКлиенте
// Процедура создает новый документ "Расходный кассовый ордер".
//
Процедура СоздатьСписаниеЗапасов(ИндексОперации)
	
	ВидОперации = СписокОпераций[ИндексОперации].Значение;
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Основание", Новый Структура("ВидОперации, Отбор", ВидОперации, Новый Структура("Склад", СкладОтбор)));
	//СтруктураПараметры.Вставить("Отбор", Новый Структура("Склад", СкладОтбор));		
	ОткрытьФорму("Документ.СписаниеМатериалов.ФормаОбъекта", СтруктураПараметры);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработка команды "Создать"
//
Процедура КомандаСоздать(Команда)
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить("ПоСкладу", "По складу");
	СписокКнопок.Добавить("ПоПерсоналу", "По персоналу");
	
	Оповещение = Новый ОписаниеОповещения("КомандаСоздатьОбработкаВыбора", ЭтотОбъект, СписокКнопок);									
	ПоказатьВыборИзМеню(Оповещение, СписокКнопок, ТекущийЭлемент);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик выбора при нажатии на кнопку "Создать"
//
Процедура КомандаСоздатьОбработкаВыбора(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Значение = "ПоСкладу" Тогда
		СоздатьПоСкладу(Неопределено);	
		
	ИначеЕсли Результат.Значение = "ПоПерсоналу" Тогда
		СоздатьПоСотруднику(Неопределено);
				
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти