
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ИнтервалГрафика", ИнтервалГрафика); 
	ДобавитьДинамическиЛегендыПоКатегорям();	
	УстановитьАктивностьТумблеров();
	ЗаполнитьГруппуДлительностиПриемов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Обработчик нажатия по кнопке цветового статуса
//
Процедура ЛегендаЦветаНажатие(Команда)
	
	ЛегендаЭлемент = ТекущийЭлемент;
	Если Найти(ЛегендаЭлемент.Имя, "КнопкаСтатус_") = Неопределено ИЛИ Найти(ЛегендаЭлемент.Имя, "КнопкаСтатус_") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДиалогЦвета = Новый ДиалогВыбораЦвета();
	#Если Не ВебКлиент Тогда
		ДиалогЦвета.Цвет = ЛегендаЭлемент.ЦветФона;
	#КонецЕсли                                     
	
	ДиалогЦвета.Показать(Новый ОписаниеОповещения("ЛегендаЦветаНажатиеЗавершение", ЭтотОбъект, Новый Структура("ЛегендаЭлемент", ЛегендаЭлемент)));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Легенда цвета нажатие завершение
//
// Параметры:
//  Цвет					 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ЛегендаЦветаНажатиеЗавершение(Цвет, ДополнительныеПараметры) Экспорт
	
	ЛегендаЭлемент = ДополнительныеПараметры.ЛегендаЭлемент;
	
	Если (Цвет <> Неопределено) = Истина Тогда
		ЛегендаЭлемент.ЦветФона = Цвет;	
		Если ЛегендаЭлемент.Имя = "КнопкаСтатус_8" Тогда 
			ОбщегоНазначенияСтоматология.УстановитьЦветФонаСобытия(, , Цвет, Истина);
		Иначе			
			НаименованиеСтатуса     = ЛегендаЭлемент.Заголовок;		
			ОбщегоНазначенияСтоматология.УстановитьЦветФонаСобытия(ПолучитьСтатусСобытияПоНаименованию(НаименованиеСтатуса), , Цвет);
		КонецЕсли;
	
		Оповестить("ОбновлениеСтраницыЖурналПредварительнойЗаписи");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Вернет перечисление статуса события по его наименованию
//
Функция ПолучитьСтатусСобытияПоНаименованию(НаименованиеСтатуса)
	
	Если НаименованиеСтатуса      = "Подтверждена" Тогда
		НаименованиеСтатуса = "Прием подтвержден";
	ИначеЕсли НаименованиеСтатуса = "Не подтверждена" Тогда
		НаименованиеСтатуса = "Прием не подтвержден";	
	КонецЕсли;
	
	Для Каждого Статус Из Перечисления.СтатусыСобытия Цикл			
			Если Строка(Статус) = НаименованиеСтатуса Тогда
				Возврат Статус;
			КонецЕсли;
		КонецЦикла;	
	КонецФункции

&НаСервере
// Процедура прорисовки панели расшифровки статусов
Процедура ДобавитьДинамическиЛегендыПоКатегорям()
	
	Для Индекс = 1 По 7 Цикл
		СтатусСобытия = Перечисления.СтатусыСобытия[СТРЗаменить(Элементы["КнопкаСтатус_"+Строка(Индекс)].Заголовок, " ", "")];
		// СтатусСобытия = Перечисления.СтатусыСобытия[Элементы["КнопкаСтатус_"+Строка(Индекс)].Заголовок];
		Элементы["КнопкаСтатус_"+Строка(Индекс)].ЦветФона = ОбщегоНазначенияСтоматология.ПолучитьЦветФонаСобытия(СтатусСобытия);
	КонецЦикла;;
	
	Элементы.КнопкаСтатус_8.ЦветФона = ОбщегоНазначенияСтоматология.ПолучитьЦветФонаСобытия(,,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалГрафикаЗанятий(Команда)
	
	НеактивныеЭлементы = Новый Массив;
	НеактивныеЭлементы.Добавить(Элементы.ГруппаИнтервал15);
	НеактивныеЭлементы.Добавить(Элементы.ГруппаИнтервал10);
	НеактивныеЭлементы.Добавить(Элементы.ГруппаИнтервал5);

	Если ТекущийЭлемент.Имя = "УстановитьИнтервалГрафика15" Тогда
		
		ИнтервалГрафика = 0;
		АктивныйЭлемент = Элементы.ГруппаИнтервал15;
		
	ИначеЕсли ТекущийЭлемент.Имя = "УстановитьИнтервалГрафика10" Тогда
		
		ИнтервалГрафика = 1;
		АктивныйЭлемент = Элементы.ГруппаИнтервал10;
		
	ИначеЕсли ТекущийЭлемент.Имя = "УстановитьИнтервалГрафика5" Тогда
		
		ИнтервалГрафика = 2;
		АктивныйЭлемент = Элементы.ГруппаИнтервал5;
		
	КонецЕсли;
	
	ИндексЭлемента = НеактивныеЭлементы.Найти(АктивныйЭлемент);
	Если ИндексЭлемента <> Неопределено Тогда
		НеактивныеЭлементы.Удалить(ИндексЭлемента);
	КонецЕсли;
	
	ИзменитьАктивностьПереключателяФормы(АктивныйЭлемент, НеактивныеЭлементы);
	
	Оповестить("ОбновлениеСтраницыЖурналПредварительнойЗаписи", Новый Структура("ИнтервалГрафика", ИнтервалГрафика));
	
КонецПроцедуры

&НаКлиенте
// Процедура, изменяет видимость элементов переключателей.
//
Процедура ИзменитьАктивностьПереключателяФормы(
	АктивныйЭлемент    = Неопределено, 
	НеактивныеЭлементы = Неопределено, 
	Активировать       = Истина, 
	Форма              = Неопределено, 
	ЭлементФокуса      = Неопределено,
	ТемаОформления     = 1)
	
	ЦветТекста              = Новый Цвет(77 , 77 , 77);  // Черный.
	ЦветТекстаАктивирован   = Новый Цвет(255, 255, 255); // Белый.
	ЦветТекстаНеАктивирован = Новый Цвет(192, 192, 192); // Серый.
	ЦветФона                = Новый Цвет(242, 242, 242); // Светло-серый.
	
	// Тема оформления переключателей по умолчанию.
	Если Не ЗначениеЗаполнено(ТемаОформления) ИЛИ ТемаОформления = 1 Тогда
		ЦветФонаАктивирован = Новый Цвет(75 , 202, 129); // Зеленый.
		
	ИначеЕсли ТемаОформления = 2 Тогда
		ЦветФонаАктивирован = Новый Цвет(225, 40, 40); // Красный.
		
	ИначеЕсли ТемаОформления = 3 Тогда
		ЦветФонаАктивирован	  = Новый Цвет(242, 242, 242); // Светло-серый.
		ЦветФона			  = Новый Цвет(255, 255, 255);
		ЦветТекстаАктивирован = Новый Цвет(0, 0, 0);
		ЦветТекста 			  = Новый Цвет(51, 102, 187);
	КонецЕсли;	
		
	Если АктивныйЭлемент <> Неопределено Тогда
		
		ПереданаКнопка = ТипЗнч(АктивныйЭлемент) <> Тип("ГруппаФормы");
		
		АктивнаяГруппа = ?(Не ПереданаКнопка, АктивныйЭлемент, АктивныйЭлемент.Родитель);
		АктивнаяГруппа.ЦветФона = ?(Активировать, ЦветФонаАктивирован, ЦветФона);
		АктивныйЭлемент.Ширина	= ?(ПереданаКнопка, 3, АктивныйЭлемент.Ширина);
		
		АктивнаяКнопка = ?(ТипЗнч(АктивныйЭлемент) = Тип("ГруппаФормы"), АктивныйЭлемент.ПодчиненныеЭлементы[0], АктивныйЭлемент);
		АктивнаяКнопка.ЦветТекста = ?(Активировать, ЦветТекстаАктивирован, ЦветТекстаНеАктивирован);
		АктивнаяКнопка.Шрифт 	  = ?(ПереданаКнопка, Новый Шрифт("Arial", 11), АктивнаяКнопка.Шрифт);
		
	КонецЕсли;
	
	Если НеактивныеЭлементы <> Неопределено Тогда
		
		Если ТипЗнч(НеактивныеЭлементы) <> Тип("Массив") Тогда
			МассивНеактивныхЭлементов = Новый Массив;
			МассивНеактивныхЭлементов.Добавить(НеактивныеЭлементы);
		Иначе
			МассивНеактивныхЭлементов = НеактивныеЭлементы;
		КонецЕсли;
		
		Для Каждого НеактивныйЭлемент Из МассивНеактивныхЭлементов Цикл
			
			ПереданаКнопка = ТипЗнч(НеактивныйЭлемент) <> Тип("ГруппаФормы");
			
			НеАктивнаяГруппа = ?(Не ПереданаКнопка, НеактивныйЭлемент, НеактивныйЭлемент.Родитель);
			НеАктивнаяГруппа.ЦветФона = ЦветФона;
			НеактивныйЭлемент.Ширина  = ?(ПереданаКнопка, 3, НеактивныйЭлемент.Ширина);
			
			НеактивнаяКнопка = ?(ТипЗнч(НеактивныйЭлемент) = Тип("ГруппаФормы"), НеактивныйЭлемент.ПодчиненныеЭлементы[0], НеактивныйЭлемент);
			НеактивнаяКнопка.ЦветТекста = ЦветТекста;
			НеактивнаяКнопка.Шрифт 	    = ?(ПереданаКнопка, Новый Шрифт("Arial", 11), НеактивнаяКнопка.Шрифт);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Форма <> Неопределено
		И ЭлементФокуса <> Неопределено Тогда
		
		Форма.ТекущийЭлемент = ЭлементФокуса;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, устанавливает активность тумблеров.
//
Процедура УстановитьАктивностьТумблеров()
	
	НеактивныеЭлементы = Новый Массив;
	НеактивныеЭлементы.Добавить(Элементы.ГруппаИнтервал15);
	НеактивныеЭлементы.Добавить(Элементы.ГруппаИнтервал10);
	НеактивныеЭлементы.Добавить(Элементы.ГруппаИнтервал5);

	Если ЭтотОбъект.ИнтервалГрафика = 0 Тогда
		АктивныйЭлемент = Элементы.ГруппаИнтервал15;
	ИначеЕсли ЭтотОбъект.ИнтервалГрафика = 1 Тогда
		АктивныйЭлемент = Элементы.ГруппаИнтервал10;
	ИначеЕсли ЭтотОбъект.ИнтервалГрафика = 2 Тогда
		АктивныйЭлемент = Элементы.ГруппаИнтервал5;
	КонецЕсли;
	
	ИндексЭлемента = НеактивныеЭлементы.Найти(АктивныйЭлемент);
	Если ИндексЭлемента <> Неопределено Тогда
		НеактивныеЭлементы.Удалить(ИндексЭлемента);
	КонецЕсли;
	
	ИзменитьАктивностьПереключателяФормыНаСервере(АктивныйЭлемент, НеактивныеЭлементы);
		
КонецПроцедуры

&НаСервере
// Процедура, изменяет видимость групп переключателей.
//
Процедура ИзменитьАктивностьПереключателяФормыНаСервере(АктивныйЭлемент = Неопределено, НеактивныйЭлемент = Неопределено, Активировать = Истина)
	
	УправлениеИнтерфейсамиСервер.ИзменитьАктивностьПереключателяФормы(АктивныйЭлемент, НеактивныйЭлемент, Активировать, ЭтаФорма);
	
КонецПроцедуры

#Область НастройкаДлительностейПриема

&НаСервере
// Процедура - Заполнить группу длительности приемов
//
Процедура ЗаполнитьГруппуДлительностиПриемов()
    	
	УправлениеСвойствамиСтоматология.ЗаполнитьШкалуДлительностиПриема(ЭтаФорма, "ГруппаВыводаКнопокДлительности", Неопределено, Неопределено, Истина, Ложь);  
		
КонецПроцедуры

&НаКлиенте
// Процедура - Удалить длительность приема
//
Процедура Подключаемый_УдалитьДлительностьПриема(Команда)
	
	Если ТекущийЭлемент.Имя = "УдалитьЭлементДлительностиПриема" Тогда		
		СкрытьИнтерфейсДобавленияДлительностиПриема(Неопределено);
		Возврат;
	КонецЕсли;
	
	НажатаяКнопка = ТекущийЭлемент.Имя;
	
	Если НЕ ЗначениеЗаполнено(НажатаяКнопка) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеКнопки = СтрРазделить(НажатаяКнопка, "_", Ложь);
	
	Если НЕ ДанныеКнопки.Количество() = 2 Тогда
		Возврат;	
	КонецЕсли;
	
	Длительность = Число(ДанныеКнопки[1]);
	
	Подключаемый_УдалитьДлительностьПриемаНаСервере(Длительность);
		
КонецПроцедуры

&НаСервере
// Процедура - Подключаемый удалить длительность приема на сервере
//
Процедура Подключаемый_УдалитьДлительностьПриемаНаСервере(Длительность)
	
	Если НЕ ЗначениеЗаполнено(Длительность) Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.ДлительностиПриемов.УдалитьДлительностьПриема(Длительность);
	ГруппаКнопкиДлительности = Элементы.Найти("ВыравниваниеГруппаВыводаКнопокДлительности_" + Длительность);
	УправлениеСвойствамиСтоматология.ЗаполнитьШкалуДлительностиПриема(ЭтаФорма, "ГруппаВыводаКнопокДлительности", Неопределено, Неопределено, Истина, Ложь);
	
	// Если НЕ ГруппаКнопкиДлительности = Неопределено Тогда	
	//	ЭтаФорма.Элементы.Удалить(ГруппаКнопкиДлительности);				
	// КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура - Установить время длительности
//
Процедура Подключаемый_УстановитьВремяДлительности(Команда)

	СкрытьИнтерфейсДобавленияДлительностиПриема(Неопределено);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Длительность приема добавить
//
Процедура ДлительностьПриемаДобавить(Команда)
	
	ПолеВводаНовыйЭлементДлительностиПриема = Элементы.Найти("НовыйЭлементДлительностиПриема");
	Если НЕ ПолеВводаНовыйЭлементДлительностиПриема = Неопределено Тогда
		ПолеВводаНовыйЭлементДлительностиПриема.Видимость = Истина;
		ЭтаФорма.ТекущийЭлемент =  ПолеВводаНовыйЭлементДлительностиПриема;
	КонецЕсли;
	ЭтотОбъект.НовыйЭлементДлительностиПриема = 0;
	
	КнопкаСохранитьЭлементДлительностиПриема = Элементы.Найти("СохранитьЭлементДлительностиПриема");
	Если НЕ КнопкаСохранитьЭлементДлительностиПриема = Неопределено Тогда
		КнопкаСохранитьЭлементДлительностиПриема.Видимость = Истина;	
	КонецЕсли;
	
	КнопкаУдалитьЭлементДлительностиПриема = Элементы.Найти("УдалитьЭлементДлительностиПриема");
	Если НЕ КнопкаУдалитьЭлементДлительностиПриема = Неопределено Тогда
		КнопкаУдалитьЭлементДлительностиПриема.Видимость = Истина;	
	КонецЕсли;
	
	КнопкаКнопкаДлительности_N = Элементы.Найти("КнопкаДлительности_N");
	Если НЕ КнопкаКнопкаДлительности_N = Неопределено Тогда
		КнопкаКнопкаДлительности_N.Видимость = Ложь;	
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
// Процедура - Скрыть интерфейс добавления длительности приема
//
Процедура СкрытьИнтерфейсДобавленияДлительностиПриема(НоваяДлительность) 

	Если НЕ ЗначениеЗаполнено(НоваяДлительность) Тогда
		
		
		ПолеВводаНовыйЭлементДлительностиПриема = Элементы.Найти("НовыйЭлементДлительностиПриема");
		Если НЕ ПолеВводаНовыйЭлементДлительностиПриема = Неопределено Тогда
			ПолеВводаНовыйЭлементДлительностиПриема.Видимость = Ложь;
		КонецЕсли;
		ЭтотОбъект.НовыйЭлементДлительностиПриема = 0;
		
		КнопкаСохранитьЭлементДлительностиПриема = Элементы.Найти("СохранитьЭлементДлительностиПриема");
		Если НЕ КнопкаСохранитьЭлементДлительностиПриема = Неопределено Тогда
			КнопкаСохранитьЭлементДлительностиПриема.Видимость = Ложь;	
		КонецЕсли;
		
		КнопкаУдалитьЭлементДлительностиПриема = Элементы.Найти("УдалитьЭлементДлительностиПриема");
		Если НЕ КнопкаУдалитьЭлементДлительностиПриема = Неопределено Тогда
			КнопкаУдалитьЭлементДлительностиПриема.Видимость = Ложь;	
		КонецЕсли;
		
		КнопкаКнопкаДлительности_N = Элементы.Найти("КнопкаДлительности_N");
		Если НЕ КнопкаКнопкаДлительности_N = Неопределено Тогда
			КнопкаКнопкаДлительности_N.Видимость = Истина;	
		КонецЕсли;

		ЭтаФорма.ТекущийЭлемент = Элементы.ДекорацияНастройкаДлительностиПриемов;	
			
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
// Процедура - Длительность приема сохранить
//
Процедура ДлительностьПриемаСохранить(Команда)
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.НовыйЭлементДлительностиПриема) Тогда
		СкрытьИнтерфейсДобавленияДлительностиПриема(Неопределено);
		Возврат;
	КонецЕсли;
	
	ДлительностьПриемаСохранитьНаСервере();
	
КонецПроцедуры

&НаСервере
// Процедура - Длительность приема сохранить на сервере
//
Процедура ДлительностьПриемаСохранитьНаСервере()
		
	// МаксимальнаяДлительность = Справочники.СтруктурныеЕдиницы.ВремяРаботыСтруктурнойЕдиницы(,,, Ложь);
	
	// ПродолжительРаботыСЕ = ?(МаксимальнаяДлительность.Свойство("НачалоРаботы") И МаксимальнаяДлительность.Свойство("ОкончаниеРаботы"),
	//						 Число((МаксимальнаяДлительность.ОкончаниеРаботы - МаксимальнаяДлительность.НачалоРаботы) / 60), 999);
	//						 
	// ПродолжительРаботыСЕ = ?(ПродолжительРаботыСЕ > 999, 999, ПродолжительРаботыСЕ);
	
	// Если ЭтотОбъект.НовыйЭлементДлительностиПриема > ПродолжительРаботыСЕ Тогда
	//	ЭтотОбъект.НовыйЭлементДлительностиПриема = ПродолжительРаботыСЕ;
	// КонецЕсли;
	
	РегистрыСведений.ДлительностиПриемов.ДобавитьДлительностьПриема(ЭтотОбъект.НовыйЭлементДлительностиПриема);
	
	УправлениеСвойствамиСтоматология.ЗаполнитьШкалуДлительностиПриема(ЭтаФорма, "ГруппаВыводаКнопокДлительности", Неопределено, Неопределено, Истина, Ложь);
	
	СкрытьИнтерфейсДобавленияДлительностиПриема(Неопределено);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый новый элемент длительности приема при изменении
//
Процедура Подключаемый_НовыйЭлементДлительностиПриемаПриИзменении(Элемент)	
	// ДлительностьПриемаСохранить(Неопределено);
КонецПроцедуры

#КонецОбласти

#КонецОбласти
