///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Задает настройки, применяемые как стандартные для объектов подсистемы.
//
// Параметры:
//   Настройки - Структура - коллекция настроек подсистемы. Реквизиты:
//       * ВыводитьОтчетыВместоВариантов - Булево - умолчание для вывода гиперссылок в панели отчетов:
//           Истина - варианты отчетов по умолчанию скрыты, а отчеты включены и видимы.
//           Ложь   - варианты отчетов по умолчанию видимы, а отчеты отключены.
//           Значение по умолчанию: Ложь.
//       * ВыводитьОписания - Булево - умолчание для вывода описаний в панели отчетов:
//           Истина - значение по умолчанию. Выводить описания в виде подписей под гиперссылками вариантов
//           Ложь   - выводить описания в виде всплывающих подсказок
//           Значение по умолчанию: Истина.
//       * Поиск - Структура - настройки поиска вариантов отчетов.
//           ** ПодсказкаВвода - Строка - текст подсказки выводится в поле поиска когда поиск не задан.
//               В качестве примера рекомендуется указывать часто используемые термины прикладной конфигурации.
//       * ДругиеОтчеты - Структура - настройки формы "Другие отчеты":
//           ** ЗакрыватьПослеВыбора - Булево - закрывать ли форму после выбора гиперссылки отчета.
//               Истина - закрывать "Другие отчеты" после выбора.
//               Ложь   - не закрывать.
//               Значение по умолчанию: Истина.
//           ** ПоказыватьФлажок - Булево - показывать ли флажок ЗакрыватьПослеВыбора.
//               Истина - показывать флажок "Закрывать это окно после перехода к другому отчету".
//               Ложь   - не показывать флажок.
//               Значение по умолчанию: Ложь.
//       * РазрешеноИзменятьВарианты - Булево - показывать расширенные настройки отчета
//               и команды изменения варианта отчета.
//
// Пример:
//	Настройки.Поиск.ПодсказкаВвода = НСтр("ru = 'Например, себестоимость'");
//	Настройки.ДругиеОтчеты.ЗакрыватьПослеВыбора = Ложь;
//	Настройки.ДругиеОтчеты.ПоказыватьФлажок = Истина;
//	Настройки.РазрешеноИзменятьВарианты = Ложь;
//
Процедура ПриОпределенииНастроек(Настройки) Экспорт

	// _Демо начало примера
	Настройки.ВыводитьОтчетыВместоВариантов = Истина;
	Настройки.ВыводитьОписания = Ложь;
	Настройки.ДругиеОтчеты.ПоказыватьФлажок = Истина;
	// _Демо конец примера
	
КонецПроцедуры

#Область НастройкиРазмещенияОтчетов

// Определяет разделы командного интерфейса, в которых предусмотрены панели отчетов.
// В Разделы необходимо добавить метаданные тех подсистем первого уровня,
// в которых размещены команды вызова панелей отчетов.
//
// Параметры:
//  Разделы - СписокЗначений - разделы, в которые выведены команды открытия панели отчетов.
//      * Значение - ОбъектМетаданных: Подсистема, Строка - подсистема раздела глобального командного интерфейса,
//                   либо ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы для начальной страницы.
//      * Представление - Строка - заголовок панели отчетов в этом разделе.
//
// Пример:
//	Разделы.Добавить(Метаданные.Подсистемы.Анкетирование, НСтр("ru = 'Отчеты по анкетированию'"));
//	Разделы.Добавить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы(), НСтр("ru = 'Основные отчеты'"));
//
Процедура ОпределитьРазделыСВариантамиОтчетов(Разделы) Экспорт
	
	Разделы.Добавить(Метаданные.Подсистемы.ОказаниеУслуг    , НСтр("ru = 'Отчеты по оказанию услуг'"));
	Разделы.Добавить(Метаданные.Подсистемы.Маркетинг        , НСтр("ru = 'Отчеты по продажам'"));
	Разделы.Добавить(Метаданные.Подсистемы.Запасы   	    , НСтр("ru = 'Отчеты по запасам'"));
	Разделы.Добавить(Метаданные.Подсистемы.Финансы  	    , НСтр("ru = 'Отчеты по финансам'"));	
	Разделы.Добавить(Метаданные.Подсистемы.Персонал 	    , НСтр("ru = 'Отчеты по персоналу'"));
		
	Разделы.Добавить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы(), НСтр("ru = 'Отчеты'"));
	
КонецПроцедуры

// Задает настройки размещения вариантов отчетов в панели отчетов.
//   Отчет выступает в качестве контейнера вариантов.
//     Изменяя настройки отчета можно сразу изменять настройки всех его вариантов.
//     Однако, если явно получить настройки варианта отчета, то они станут самостоятельными,
//     т.е. более не будут наследовать изменения настроек от отчета.
//   
//   Начальная настройка размещения отчетов по подсистемам зачитывается из метаданных,
//     ее дублирование в коде не требуется.
//   
//   Функциональные опции варианта объединяются с функциональными опциями этого отчета по следующим правилам:
//     (ФО1_Отчета ИЛИ ФО2_Отчета) И (ФО3_Варианта ИЛИ ФО4_Варианта).
//   Функциональные опции отчетов не зачитываются из метаданных,
//     они применяются на этапе использования подсистемы пользователем.
//   Через ОписаниеОтчета можно добавлять функциональные опции, которые будут соединяться по указанным выше правилам,
//     но надо помнить, что эти функциональные опции будут действовать только для предопределенных вариантов отчетов.
//   Для пользовательских вариантов отчета действуют только функциональные опции отчета
//     - они отключаются только с отключением всего отчета.
//
// Параметры:
//   Настройки - Коллекция - настройки отчетов и вариантов отчетов конфигурации.
//                           Для их изменения предназначены следующие вспомогательные процедуры и функции:
//                           ВариантыОтчетов.ОписаниеОтчета, 
//                           ВариантыОтчетов.ОписаниеВарианта, 
//                           ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов, 
//                           ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера.
//
// Пример:
//
//  //Добавление варианта отчета в подсистему.
//	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ИмяОтчета, "<ИмяВарианта>");
//	НастройкиВарианта.Размещение.Вставить(Метаданные.Подсистемы.ИмяРаздела.Подсистемы.ИмяПодсистемы);
//
//  //Отключение варианта отчета.
//	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ИмяОтчета, "<ИмяВарианта>");
//	НастройкиВарианта.Включен = Ложь;
//
//  //Отключение всех вариантов отчета, кроме одного.
//	НастройкиОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ИмяОтчета);
//	НастройкиОтчета.Включен = Ложь;
//	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//	НастройкиВарианта.Включен = Истина;
//
//  //Заполнение настроек для поиска - наименования полей, параметров и отборов:
//	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ИмяОтчетаБезСхемы, "");
//	НастройкиВарианта.НастройкиДляПоиска.НаименованияПолей =
//		НСтр("ru = 'Контрагент
//		|Договор
//		|Ответственный
//		|Скидка
//		|Дата'");
//	НастройкиВарианта.НастройкиДляПоиска.НаименованияПараметровИОтборов =
//		НСтр("ru = 'Период
//		|Ответственный
//		|Контрагент
//		|Договор'");
//
//  //Переключение режима вывода в панелях отчетов:
//  //Группировка вариантов отчета по этому отчету:
//	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, Метаданные.Отчеты.ИмяОтчета, Истина);
//  //Без группировки по отчету:
//	Отчет = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ИмяОтчета);
//	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, Отчет, Ложь);
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
			
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализЖурналаРегистрации, "АнализАктивностиПользователей");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для анализа журнала регистрации действий пользователей системы и регламентных заданий'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализЖурналаРегистрации, "КонтрольЖурналаРегистрации");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для анализа журнала регистрации действий пользователей системы и регламентных заданий'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализЖурналаРегистрации, "ПродолжительностьРаботыРегламентныхЗаданий");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для анализа журнала регистрации действий пользователей системы и регламентных заданий'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализКлиентскойБазы, "СоотношениеПритокаИОттокаКлиентов");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для анализа данных количества новых (первичных) пациентов и количества не вернувшихся пациентов'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализОплатПоВрачам, "АнализОплатПоВрачам");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для анализа оплат услуг, оказанных врачами'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализОплатПоПервичнымПостояннымИПотеряннымПациентам, "АнализОплатПоПервичнымПостояннымИПотеряннымПациентам");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для анализа оплат услуг, оказанных врачами с детализицией по статусам пациентов'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализРаботыПоЗаписиНаПрофосмотры, "АнализРаботыПоЗаписиНаПрофосмотры");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для анализа результатов записи и явки пациентов на профосмотры'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализРаботыСВходящимиЗвонками, "АнализРаботыСВходящимиЗвонками");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для анализа зарегистрированных входящих и исходящих звонков, и результатах разговоров'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализЯвкиПоЗаписи, "АнализЯвкиПоЗаписи");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для анализа результатов данных о сформированных предварительных записях и явки по ним'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.Баланс, "УправленческийБаланс");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для вывода управленческого баланса по выбранной организации'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВедомостьНачисленияАмортизации, "ВедомостьНачисленияАмортизации");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для вывода данных об уменьшении стоимости основных средств за счет начисления амортизации'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВедомостьПоДенежнымСредствам, "Ведомость");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для вывода данных движения денежных средств – наличных, безналичных, переводы в пути, деньги в пути (эквайринг)'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВедомостьПоДенежнымСредствам, "АнализДвиженияДенежныхСредств");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для анализа данных движения денежных средств – наличных, безналичных, переводы в пути, деньги в пути (эквайринг)'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВедомостьПоПартиям, "ОстаткиПоПартиям");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для вывода данных об остатках партий товаров на складах организации'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВедомостьПоПартиям, "ВедомостьПоПартиям");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для вывода данных о партиях товаров на складах организации'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВедомостьПоРеализованнымСертификатам, "ВедомостьПоРеализованнымСертификатам");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для вывода сведения обо всех подарочных сертификатах, которые были реализованы клиентам'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВедомостьПоСертификатам, "ОстаткиСертификатовНаСкладе");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для вывода информации о приходе и расходе сертификатов, а так же о начальном и конечном остатке'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВедомостьПоСертификатам, "ДвиженияСертификатов");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для вывода информации о приходе и расходе сертификатов, а так же о начальном и конечном остатке'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВедомостьПоТоварамНаСкладах, "ОстаткиНаСкладах");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для получения информации о приходе и расходе товарно-материальных ценностей, а так же о начальном и конечном остатке'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВедомостьПоТоварамНаСкладах, "ОстаткиИОборотыСГруппировкойПоСкладам");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для получения информации о приходе и расходе товарно-материальных ценностей, а так же о начальном и конечном остатке на складе'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.Взаиморасчеты, "Взаиморасчеты");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для получения данных касающихся взаиморасчетов с пациентами'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВзаиморасчетыСоСтраховымиКомпаниями, "Взаиморасчеты со страховыми компаниями");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для получения данных касающихся взаиморасчетов со страховыми компаниями'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВзаиморасчетыСПациентами, "ВзаиморасчетыСПациентамиПоСотрудникам");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для получения данных состояния и динамику взаиморасчетов с пациентами сводно'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВзаиморасчетыСПациентами, "ВзаиморасчетыСПациентами");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для получения данных состояния и динамику взаиморасчетов с пациентами сводно'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВозвратПервичныхПациентовКВрачам, "ВозвращаемостьПациентов");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для анализ данных по возврату первичных пациентов к врачу'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВходящиеЗвонки, "ВходящиеЗвонки");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для анализа информации о зарегистрированных входящих звонках с разбивкой по месяцам'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ДвижениеДенежныхСредств, "ДвижениеДенежныхСредств");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для анализа сводной информации о движениях денежных средств организации за указанный период: денежные средства на начало и конец периода, поступления и выбытия, сгруппированные по статьям движения денежных средств'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ДенежныеСредстваНаЛицевыхСчетах, "ЛицевыеСчета");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для получения данных о текущем состоянии лицевых счетов пациентов, а также сведения о поступлении и расходовании средств лицевых счетов пациентов'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ДоляПостоянныхКлиентов, "ДоляПостоянныхПациентов");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для получения данных структуры клиентской базы по статусам пациентов'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ДоходыРасходы, "ДоходыРасходы");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для получения данных о доходах и расходах'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ЗагруженностьПоКабинетам, "ЗагруженностьСтоматологи");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для получения данных об уровне загруженности кабинетов клиники'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ЗагруженностьСтоматологии, "ЗагруженностьСтоматологии");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для получения данных об уровне загруженности клиники'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ЗагруженностьСтоматологии, "ПоЧасам");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для получения данных об уровне загруженности клиники в разрезе разных периодов времени (по часам)'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ЗагруженностьСтоматологии, "ПоДням");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для получения данных об уровне загруженности клиники в разрезе разных периодов времени (по дням)'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ЗагруженностьСтоматологии, "ПоМесяцам");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для получения данных об уровне загруженности клиники в разрезе разных периодов времени (по месяцам)'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ЗагрузкаРабочегоВремениВрача, "ЗагрузкаРабочегоВремениВрача");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для получения данных планового рабочего времени врача и время начала и окончания каждого приема, исходя из этих данных вычисляется процент загрузки'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.Затраты, "Затраты");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для получения данных о затратах организации'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ИсточникиИнформации, "ИсточникиИнформации");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для оценки количества пациентов, привлеченных тем или иным способом'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.КритическиеОстатки, "НеобходимоОбеспечить");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения списка номенклатуры, у которой текущий остаток на складе меньше либо равен заданному критическому остатку'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.МатериалыВРаботеУСотрудников, "ОстаткиМатериалов");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения остатков материалов, которые были выданы сотрудникам для лечения пациентов'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.МатериалыВРаботеУСотрудников, "ВедомостьПоМатериалам");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения ведомости материалов, которые были выданы сотрудникам для лечения пациентов'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.МатериалыВРаботеУСотрудников, "ОстаткиМатериаловССебестоимостью");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения остатков материалов с себестоимостью, которые были выданы сотрудникам для лечения пациентов'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.МатериалыВРаботеУСотрудников, "ВедомостьМатериаловСебестоимость");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных материалов с себестоимостью, которые были выданы сотрудникам для лечения пациентов'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.НаправлениеПервичныхПациентовКСмежнымВрачам, "НаправлениеПервичныхПациентовКСмежнымВрачам");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для анализа первичных и всех последующих приемов врача, если пациент после первичного врача посетил другого врача, то считается что первичный врач направил пациента к смежному'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.НарядЗаказы, "НарядЗаказы");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для анализа наряд-заказов'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.НормыСписанияМатериалов, "НормыСписанияМатериалов");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных о нормах списания материалов при лечении'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ОборотноСальдоваяВедомость, "ОСВ");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных для каждого счета об остатках на начало и конец периода и оборотах по дебету и кредиту за период'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ОказанныеИОплаченныеУслуги, "ОказанныеИОплаченныеУслуги");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных об оказанных или оплаченных услугах'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ОказанныеУслугиПоАссистенту, "ОказанныеУслуги");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных об оказанных услугах по ассистенту'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ОказанныеУслугиПоВрачу, "ОказанныеУслуги");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных об оказанных услугах по врачу'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ОплатаПриемов, "ОплатаПриемов");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных об оплате пациентами произведенного лечения'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ОплатаПриемов, "ОплатаПриемов_БЕЗ_ДЕТАЛИЗАЦИИ_ПО_СОТРУДНИКАМ");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных об оплате пациентами произведенного лечения с детализацией по врачам'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ОплатаПриемовПоВидамОплат, "Основной");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных об оплате пациентами произведенного лечения по видам оплат'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ОплатыПоВрачу, "Основной");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных об оплате пациентами произведенного лечения по врачу'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ОстаткиТоваров, "Основной");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных об остстках запасов в количественном выражении'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ОстаткиТоваровНаСкладахВСтоимостномВыражении, "ОстаткиНаСкладахВСтоимостномВыражении");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных об остатках запасов в стоимостном выражении по выбранному типу цен'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ОтменыПредварительнойЗаписи, "Основной");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных о произведенных отменах предварительных записей'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ОтчетПоВыручке, "Основной");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных обо всех движениях денежных средств по выбранной кассе в разрезе сотрудников'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ОтчетПоВыручке, "Основной_БЕЗ_ДЕТАЛИЗАЦИИ_ПО_СОТРУДНИКАМ");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных обо всех движениях денежных средств по выбранной кассе'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ОтчетПоКлиентам, "ОтчетПоКлиентам");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения персональных данных по всем пациентам'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ДниРождения, "ДниРождения");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных о днях рождения пациентов'");
		
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ОтчетПоКлиентам, "НовыеКлиенты");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных о новых пациентах'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПациентыПосетившиеКлиникуЗаПериод, "ПациентыПосетившиеКлиникуЗаПериод");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных о пациентах,  посетивщих клинику за определенный период времени'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПервичныеПациенты, "Основной");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения списка первичных приемов за период'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПланируемыеОплаты, "Основной");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных о неоплаченных утвержденных планах-лечения и наряд-заказах'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПланФактныйАнализОтработанногоВремени, "Основной");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения времени, которые сотрудники должны были отработать по плану и о времени, которое было фактически отработано'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПланФактныйАнализРасходованияМатериалов, "ПланФакт");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения  информации о плановом и фактическом расходе материалов списания (расходных материалов), а так же о расхождении между плановым расходом и фактическим списанием'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПланыЛечения, "Основной");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения информации в различных разрезах по документам Планы лечения, выводит сумму плана лечения и внесенные по нему авансы'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПолисыМедицинскогоСтрахования, "ПолисыМедицинскогоСтрахования");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения информации о всех зарегистрированных в программе страховых полисах, их лимитах, сумме уже оказанных по ним услуг, а также отражает оплату оказанных услуг страховой компанией'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ДействующиеПолисыМедицинскогоСтрахования, "ПолисыМедицинскогоСтрахования");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения информации о всех зарегистрированных в программе и действующих страховых полисах'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПредоставленныеСкидки, "ПредоставленныеСкидки");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения информации обо всех скидках, которые были предоставлены пациентам'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПрибылиИУбытки, "ПрибылиИУбытки");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения информации о прибылях и убытках организации с детализацией по статьям доходов и расходов'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПрибылиИУбытки, "ПрибылиИУбыткиПоВрачам");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения информации о прибылях и убытках организации с детализацией по врачам'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПрибылиИУбытки, "ПрибылиИУбыткиПоСпециализациям");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения информации о прибылях и убытках организации с детализацией по специализациям'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.Прибыль, "Прибыль");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения информации о прибыли, которая определяется как разность между ценой продажи номенклатуры и ее себестоимостью'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.Прибыль, "Прибыль по сотрудникам");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения информации о прибыли клиники в разрезе осуществивших продажу сотрудников'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.Прибыль, "Прибыль по клиентам");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения информации о прибыли организации в разрезе клиник, номенклатуры, а также пациентов, которым был продан товар или оказаны услуги'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.Продажи, "ПродажиПоКлиентам");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных по продажам организации в разрезе покупателей и проданной номенклатуры'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.Продажи, "ПродажиПоСотрудникам");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных по продажам организации в разрезе сотрудников и проданной номенклатуры'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.Продажи, "Продажи");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных по продажам организации в разрезе номенклатуры'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РассылкаСМС, "SMS-Рассылки");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных о текущем статусе SMS-рассылок, с детализацией статусов доставки сообщений'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РасчетыПоЭквайрингу, "РасчетыПоЭквайрингу");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных по эквайринговым расчетам'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РасчетыСПерсоналом, "Расчеты с персоналом");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных всех взаиморасчетов с персоналом клиники'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РасчетыСПодотчетниками, "Взаиморасчеты с подотчетниками");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных состояния и изменения задолженностей, возникающих при расчетах с подотчетными лицами'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РасширенныйОтчетПоЗарплате, "Основной");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных по текущим действующим начислениям и удержаниям персонала, начислениях и взаиморасчетами с сотрудниками'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РасширенныйОтчетПоЗарплате, "ОсновнойПоВрачу");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных начисления зарплаты и выплат по сотрудникам'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РасшифровкаНачисленийИУдержаний, "Основной");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения детальной расшифровки всех начислений и удержаний сотрудников'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РейтингСотрудников, "РейтингСотрудников");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения сведений о показателях продаж всех сотрудников организации, а также позволяет определить сотрудников, имеющих самые лучшие показатели продаж'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.Рекламации, "Основной");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных рекламаций по приемам в различных разрезах, например, по клиенту, врачу или номенклатуре'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СводныйОтчетПоЗарплатеВрача, "Основной");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных по текущим действующим начислениям и удержаниям сотрудников, начислениях и взаиморасчетах с персоналом'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СерийныеНомераСертификатов, "Основной");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных серий подарочных сертификатов'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СтатистикаПосещений, "Статистика посещений клиники");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения сводной информации по посещениям пациентами клиники'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СтатистикаПредварительнойЗаписи, "СтатистикаПредварительнойЗаписи");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для отображения данных о произведенных предварительных записях пациентов'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ШахматнаяВедомость, "ШахматнаяВедомость");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для формирования шахматной ведомости по всем счетам (субсчетам)'");
		
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ДвиженияПоБонуснымСчетам, "ДвиженияПоБонуснымСчетам");
	Вариант.Описание = НСтр("ru = 'Отчет позволяет получить информацию о зачислениях на бонусные счета, списаниях и конечных остатках'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.Задачи, "ОтчетПоЗадачам");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для мониторинга списка всех задач сотрудников'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.Задачи, "ОтчетПоЗадачамДетально");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для мониторинга списка всех задач по количеству выполненных в срок и просроченных задач у исполнителей'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПерейтиЛицевыеСчета, "Основной");
	Вариант.Описание = НСтр("ru = 'Отчет предназначен для получения данных о текущем состоянии лицевого счета пациента'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ТоварныйОтчетТОРГ29, "ОстаткиНаСкладе");
	Вариант.Описание = НСтр("ru = 'Данный отчет представляет собой унифицированный товарный отчет ТОРГ-29, который применяется для учета товарных документов в организациях'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СтатистикаОказанныхУслугСтраховымКомпаниям, "СтатистикаОказанныхУслугСтраховымКомпаниям");
	Вариант.Описание = НСтр("ru = 'Содержит в себе такие показатели как сумма оказаных услуг, кол-во обратившихся, средняя выплата на обратившегося, количество приемов, количество приемов на обратившегося, средняя выплата на прием, кол-во оказаных услуг, кол-во оказанных услуг на прием'");
	
	ВыделитьОсновныеОтчеты(Настройки);
	ВыделитьВторостепенныеОтчеты(Настройки);
				
КонецПроцедуры

// Регистрирует изменения в именах вариантов отчетов.
// Используется при обновлении в целях сохранения ссылочной целостности,
// в частности для сохранения пользовательских настроек и настроек рассылок отчетов.
// Старое имя варианта резервируется и не может быть использовано в дальнейшем.
// Если изменений было несколько, то каждое изменение необходимо зарегистрировать,
// указывая в актуальном имени варианта последнее (текущее) имя варианта отчета.
// Поскольку имена вариантов отчетов не выводятся в пользовательском интерфейсе,
// то рекомендуется задавать их таким образом, что бы затем не менять.
// В Изменения необходимо добавить описания изменений имен вариантов
// отчетов, подключенных к подсистеме.
//
// Параметры:
//   Изменения - ТаблицаЗначений - таблица изменений имен вариантов. Колонки:
//       * Отчет - ОбъектМетаданных - метаданные отчета, в схеме которого изменилось имя варианта.
//       * СтароеИмяВарианта - Строка - старое имя варианта, до изменения.
//       * АктуальноеИмяВарианта - Строка - текущее (последнее актуальное) имя варианта.
//
// Пример:
//	Изменение = Изменения.Добавить();
//	Изменение.Отчет = Метаданные.Отчеты.<ИмяОтчета>;
//	Изменение.СтароеИмяВарианта = "<СтароеИмяВарианта>";
//	Изменение.АктуальноеИмяВарианта = "<АктуальноеИмяВарианта>";
//
Процедура ЗарегистрироватьИзмененияКлючейВариантовОтчетов(Изменения) Экспорт
	
КонецПроцедуры

// Функция должна вернуть список значений с описанием виртуальных подсистем
// Пример кода:
//
//	Функция ОписаниеВиртуальныхПодсистем() Экспорт
//		СписокПодсистем = Новый СписокЗначений;
//		СписокПодсистем.Добавить("Маркетинг\АнализКлиентов", "Работа с клиентами")
//		Возврат СписокПодсистем;
//	КонецФункции
//
Функция ОписаниеВиртуальныхПодсистем() Экспорт
	
	СписокПодсистем = Новый СписокЗначений;
		
	Возврат СписокПодсистем;
	
КонецФункции

// Убирает часть отчетов в раздел "СмТакже"
//
// Параметры:
//   Настройки (ДеревоЗначений) Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//
Процедура ВыделитьВторостепенныеОтчеты(Настройки)
	
		
КонецПроцедуры // ВыделитьВторостепенныеОтчеты()

// Процедура - Выделить основные отчеты
//
// Параметры:
//  Настройки	 - 	 - 
//
Процедура ВыделитьОсновныеОтчеты(Настройки)
			
КонецПроцедуры

// Перемещает указанные варианты указанного отчета в СмТакже
//
// Параметры
//   Настройки (ДеревоЗначений) Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//
//  ИмяОтчета  - Строка - Имя отчета который необходимо переместить в СмТакже
//
//  Варианты  - Строка - Варианты отчета, перечисленные через запятую,
//                 которые необходимо переместить в СмТакже
//
Процедура СделатьВторостепенным(Настройки,ИмяОтчета, ВариантыСтрокой)

	МассивВариантов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВариантыСтрокой);
	
	Для каждого ИмяВарианта Из МассивВариантов Цикл
	
		Попытка
			Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты[ИмяОтчета], ИмяВарианта);
		Исключение
			Продолжить;
		КонецПопытки;
		
		Для каждого РазмещениеВПодстистеме Из Вариант.Размещение Цикл
		
			Вариант.Размещение.Вставить(РазмещениеВПодстистеме.Ключ,"СмТакже");
		
		КонецЦикла; 
	
	КонецЦикла;

КонецПроцедуры // СделатьВторостепенным()

// Процедура - Сделать основным
//
// Параметры:
//  Настройки		 - 	 - 
//  ИмяОтчета		 - 	 - 
//  ВариантыСтрокой	 - 	 - 
//
Процедура СделатьОсновным(Настройки, ИмяОтчета, ВариантыСтрокой)

	МассивВариантов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВариантыСтрокой);
	
	Для каждого ИмяВарианта Из МассивВариантов Цикл
	
		Попытка
			Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты[ИмяОтчета], ИмяВарианта);
		Исключение
			Продолжить;
		КонецПопытки;
		
		Для каждого РазмещениеВПодстистеме Из Вариант.Размещение Цикл
		
			Вариант.Размещение.Вставить(РазмещениеВПодстистеме.Ключ, "Важный");
		
		КонецЦикла; 
	
	КонецЦикла;

КонецПроцедуры // СделатьВторостепенным()

#КонецОбласти

#Область НастройкиКомандОтчетов

// Определяет объекты конфигурации, в модулях менеджеров которых предусмотрена процедура ДобавитьКомандыОтчетов,
// описывающая команды открытия контекстных отчетов.
// Синтаксис процедуры ДобавитьКомандыОтчетов см. в документации.
//
// Параметры:
//  Объекты - Массив - объекты метаданных (ОбъектМетаданных) с командами отчетов.
//
Процедура ОпределитьОбъектыСКомандамиОтчетов(Объекты) Экспорт
	//// _Демо начало примера
	//Объекты.Добавить(Метаданные.Справочники._ДемоОрганизации);
	//Объекты.Добавить(Метаданные.Справочники._ДемоКонтрагенты);
	//Объекты.Добавить(Метаданные.Справочники._ДемоМестаХранения);
	//Объекты.Добавить(Метаданные.Документы._ДемоПоступлениеТоваров);
	//Объекты.Добавить(Метаданные.Документы._ДемоРеализацияТоваров);
	//// _Демо конец примера
КонецПроцедуры

// Определение списка глобальных команд отчетов.
// Событие возникает в процессе вызова модуля повторного использования.
//
// Параметры:
//  КомандыОтчетов - ТаблицаЗначений - таблица команд для вывода в подменю, где:
//   * Идентификатор - Строка   - идентификатор команды.
//   * Представление - Строка   - представление команды в форме.
//   * Важность      - Строка   - суффикс группы в подменю, в которой следует вывести эту команду.
//                                Допустимо использовать: "Важное", "Обычное" и "СмТакже".
//   * Порядок       - Число    - порядок размещения команды в группе. Используется для настройки под конкретное
//                                рабочее место.
//   * Картинка      - Картинка - картинка команды.
//   * СочетаниеКлавиш - СочетаниеКлавиш - сочетание клавиш для быстрого вызова команды.
//   * ТипПараметра - ОписаниеТипов - типы объектов, для которых предназначена эта команда.
//   * ВидимостьВФормах    - Строка - имена форм через запятую, в которых должна отображаться команда.
//                                    Используется когда состав команд отличается для различных форм.
//   * ФункциональныеОпции - Строка - имена функциональных опций через запятую, определяющих видимость команды.
//   * УсловияВидимости    - Массив - определяет видимость команды в зависимости от контекста.
//                                    Для регистрации условий следует использовать процедуру
//                                    ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды().
//                                    Условия объединяются по "И".
//   * ИзменяетВыбранныеОбъекты - Булево - определяет доступность команды в ситуации,
//                                         когда у пользователя нет прав на изменение объекта.
//                                         Если Истина, то в описанной выше ситуации кнопка будет недоступна.
//                                         Необязательный. Значение по умолчанию: Ложь.
//   * МножественныйВыбор - Булево, Неопределено - если Истина, то команда поддерживает множественный выбор.
//                                                 В этом случае в параметре выполнения будет передан список ссылок.
//                                                 Необязательный. Значение по умолчанию: Истина.
//   * РежимЗаписи - Строка - действия, связанные с записью объекта, которые выполняются перед обработчиком команды, где:
//                 "НеЗаписывать" - объект не записывается, а в параметрах обработчика вместо ссылок передается
//                                  вся форма. В этом режиме рекомендуется работать напрямую с формой,
//                                  которая передается в структуре 2 параметра обработчика команды.
//                 "ЗаписыватьТолькоНовые" - записывать новые объекты.
//                 "Записывать"            - записывать новые и модифицированные объекты.
//                 "Проводить"             - проводить документы.
//                 Перед записью и проведением у пользователя запрашивается подтверждение.
//                 Необязательный. Значение по умолчанию: "Записывать".
//   * ТребуетсяРаботаСФайлами - Булево - если Истина, то в веб-клиенте предлагается
//                                        установить расширение для работы с 1С:Предприятием.
//                                        Необязательный. Значение по умолчанию: Ложь.
//   * Менеджер - Строка - полное имя объекта метаданных, отвечающего за выполнение команды.
//                         Например, "Отчет._ДемоКнигаПокупок".
//   * ИмяФормы - Строка - имя формы, которую требуется открыть или получить для выполнения команды.
//                         Если Обработчик не указан, то у формы вызывается метод "Открыть".
//   * КлючВарианта - Строка - имя варианта отчета, открываемого при выполнении команды.
//   * ИмяПараметраФормы - Строка - имя параметра формы, в который следует передать ссылку или массив ссылок.
//   * ПараметрыФормы - Неопределено, Структура - параметры формы, указанной в ИмяФормы.
//   * Обработчик - Строка - описание процедуры, обрабатывающей основное действие команды.
//                  Формат "<ИмяОбщегоМодуля>.<ИмяПроцедуры>" используется когда процедура размещена в общем модуле.
//                  Формат "<ИмяПроцедуры>" используется в следующих случаях:
//                  1) если ИмяФормы заполнено то в модуле указанной формы ожидается клиентская процедура,
//                  2) если ИмяФормы не заполнено то в модуле менеджера этого объекта ожидается серверная процедура.
//   * ДополнительныеПараметры - Структура - параметры обработчика, указанного в Обработчик.
//
//  Параметры - Структура - сведения о контексте исполнения, где:
//   * ИмяФормы - Строка - полное имя формы.
//   
//  СтандартнаяОбработка - Булево - если установить в Ложь, то событие "ДобавитьКомандыОтчетов" менеджера объекта не
//                                  будет вызвано.
//
Процедура ПередДобавлениемКомандОтчетов(КомандыОтчетов, Параметры, СтандартнаяОбработка) Экспорт
	//// _Демо начало примера
	//Отчеты.МестаИспользованияСсылок.ДобавитьКомандуМестаИспользования(КомандыОтчетов);
	//// _Демо конец примера
КонецПроцедуры

#КонецОбласти

#КонецОбласти
