
#Область СлужебныеПроцедурыИФункции

// Функция - Получить последнюю запись о ключе клиента
//
// Параметры:
//  ВнешняяСистема	 - 	 - 
//  НомерТелефона	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПоследнююЗаписьОКлючеКлиента(ВнешняяСистема, НомерТелефона) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КлючиВнешнихСистем.ВнешняяСистема КАК ВнешняяСистема,
	|	КлючиВнешнихСистем.НомерТелефона КАК НомерТелефона,
	|	КлючиВнешнихСистем.Клиент КАК Клиент,
	|	КлючиВнешнихСистем.КлючКлиента КАК КлючКлиента,
	|	КлючиВнешнихСистем.КодПодтверждения КАК КодПодтверждения,
	|	КлючиВнешнихСистем.Статус КАК Статус,
	|	КлючиВнешнихСистем.КодДействителенДо КАК КодДействителенДо
	|ИЗ
	|	РегистрСведений.КлючиВнешнихСистем КАК КлючиВнешнихСистем
	|ГДЕ
	|	КлючиВнешнихСистем.ВнешняяСистема = &ВнешняяСистема
	|	И КлючиВнешнихСистем.НомерТелефона = &НомерТелефона");
	
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	Запрос.УстановитьПараметр("НомерТелефона" , НомерТелефона);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка, Неопределено);
	
КонецФункции

// Функция - Получить клиента по ключу
//
// Параметры:
//  КлючКлиента	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКлиентаПоКлючу(КлючКлиента) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлючиВнешнихСистем.Клиент КАК Клиент
	|ИЗ
	|	РегистрСведений.КлючиВнешнихСистем КАК КлючиВнешнихСистем
	|ГДЕ
	|	КлючиВнешнихСистем.КлючКлиента = &КлючКлиента
	|	И КлючиВнешнихСистем.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКлючейВнешнихСистем.Подтвержден)");
	
	Запрос.УстановитьПараметр("КлючКлиента", КлючКлиента);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Результат.Следующий(), Результат.Клиент, Неопределено);
	
КонецФункции

// Функция - Получить данные ключа внешней системы
//
// Параметры:
//  КлючКлиента	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеКлючаВнешнейСистемы(КлючКлиента) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КлючиВнешнихСистем.Клиент КАК Клиент,
	|	КлючиВнешнихСистем.НомерТелефона КАК НомерТелефона,
	|	КлючиВнешнихСистем.Пароль КАК Пароль
	|ИЗ
	|	РегистрСведений.КлючиВнешнихСистем КАК КлючиВнешнихСистем
	|ГДЕ
	|	КлючиВнешнихСистем.КлючКлиента = &КлючКлиента
	|	И КлючиВнешнихСистем.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКлючейВнешнихСистем.Подтвержден)");
	
	Запрос.УстановитьПараметр("КлючКлиента", КлючКлиента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка, Неопределено);
	
КонецФункции

// Функция - Сотрудник зарегистрирован для внешней системы
//
// Параметры:
//  Сотрудник			 - 	 - 
//  ТолькоИспользующийся - 	 - 
//  ВнешняяСистема		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СотрудникЗарегистрированДляВнешнейСистемы(Сотрудник, ТолькоИспользующийся = Ложь, ВнешняяСистема = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлючиВнешнихСистем.ВнешняяСистема КАК ВнешняяСистема
	|ИЗ
	|	РегистрСведений.КлючиВнешнихСистем КАК КлючиВнешнихСистем
	|ГДЕ
	|	КлючиВнешнихСистем.Клиент = &Сотрудник
	|	И ВЫБОР
	|			КОГДА &ТолькоИспользующийся
	|				ТОГДА КлючиВнешнихСистем.Использовать
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ВнешняяСистема <> НЕОПРЕДЕЛЕНО
	|				ТОГДА КлючиВнешнихСистем.ВнешняяСистема = &ВнешняяСистема
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И КлючиВнешнихСистем.ВнешняяСистема.Используется");
	
	Запрос.УстановитьПараметр("Сотрудник"           , Сотрудник);
	Запрос.УстановитьПараметр("ВнешняяСистема"      , ВнешняяСистема);
	Запрос.УстановитьПараметр("ТолькоИспользующийся", ТолькоИспользующийся);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Процедура - Записать сотрудника внешней системы
//
// Параметры:
//  ВнешняяСистема	 - 	 - 
//  ДанныеСотрудника - 	 - 
//  Использовать	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
//
Процедура ЗаписатьСотрудникаВнешнейСистемы(ВнешняяСистема, ДанныеСотрудника, Использовать, ОписаниеОшибки = Неопределено) Экспорт
  
  МенеджерЗаписи = РегистрыСведений.КлючиВнешнихСистем.СоздатьМенеджерЗаписи();
  МенеджерЗаписи.ВнешняяСистема = ВнешняяСистема;
  МенеджерЗаписи.НомерТелефона  = ДанныеСотрудника.НомерТелефона;
  
  МенеджерЗаписи.Прочитать();
  
  Если МенеджерЗаписи.Выбран() Тогда
	  
	  Если МенеджерЗаписи.Клиент <> ДанныеСотрудника.Сотрудник Тогда
			ОписаниеОшибки = "Сотрудник с таким номером уже существует!";
			Возврат;
	  КонецЕсли;
	  
	  МенеджерЗаписи.Использовать   = Использовать;
	  МенеджерЗаписи.НомерТелефона  = ДанныеСотрудника.НомерТелефона;
	  
  Иначе
	  
	  МенеджерЗаписи.Использовать   = Использовать;
	  МенеджерЗаписи.Статус         = Перечисления.СтатусыКлючейВнешнихСистем.Подтвержден;
	  МенеджерЗаписи.ВнешняяСистема = ВнешняяСистема;
	  МенеджерЗаписи.НомерТелефона  = ДанныеСотрудника.НомерТелефона;
	  МенеджерЗаписи.Клиент         = ДанныеСотрудника.Сотрудник;
	  МенеджерЗаписи.КлючКлиента    = Строка(Новый УникальныйИдентификатор);
	  
  КонецЕсли;
  
  МенеджерЗаписи.Записать();
    
КонецПроцедуры

// Функция - Получить сотрудников внешней системы и места работы
//
// Параметры:
//  ВнешняяСистема		 - 	 - 
//  Сотрудник			 - 	 - 
//  ТолькоИспользующийся - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСотрудниковВнешнейСистемыИМестаРаботы(ВнешняяСистема, Сотрудник = Неопределено, ТолькоИспользующийся = Истина) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиСотрудников.Сотрудник КАК Сотрудник,
	|	НастройкиСотрудников.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НастройкиСотрудников.ДатаУвольнения КАК ДатаУвольнения
	|ПОМЕСТИТЬ ТаблицаДатыУвольнения
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НастройкиСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
	|	И НастройкиСотрудников.ДатаУвольнения <= &ТекущаяДата
	|	И ВЫБОР
	|			КОГДА &Сотрудник <> НЕОПРЕДЕЛЕНО
	|				ТОГДА НастройкиСотрудников.Сотрудник = &Сотрудник
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СотрудникиДоступныеСтруктурныеЕдиницы.Ссылка КАК Сотрудник,
	|	СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница.Наименование КАК Наименование
	|ПОМЕСТИТЬ втМестаРаботыСотрудников
	|ИЗ
	|	Справочник.Сотрудники.ДоступныеСтруктурныеЕдиницы КАК СотрудникиДоступныеСтруктурныеЕдиницы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДатыУвольнения КАК ТаблицаДатыУвольнения
	|		ПО СотрудникиДоступныеСтруктурныеЕдиницы.Ссылка = ТаблицаДатыУвольнения.Сотрудник
	|			И СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница = ТаблицаДатыУвольнения.СтруктурнаяЕдиница
	|ГДЕ
	|	СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница.ПометкаУдаления = ЛОЖЬ
	|	И СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница.ЭтоГруппа = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &Сотрудник <> НЕОПРЕДЕЛЕНО
	|				ТОГДА СотрудникиДоступныеСтруктурныеЕдиницы.Ссылка = &Сотрудник
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ТаблицаДатыУвольнения.ДатаУвольнения ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РеквизитыОбъектов.СтруктурнаяЕдиница,
	|	РеквизитыОбъектов.Объект,
	|	РеквизитыОбъектов.СтруктурнаяЕдиница.Наименование
	|ИЗ
	|	РегистрСведений.РеквизитыОбъектов КАК РеквизитыОбъектов
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Сотрудник <> НЕОПРЕДЕЛЕНО
	|				ТОГДА РеквизитыОбъектов.Объект = &Сотрудник
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И РеквизитыОбъектов.Реквизит = ""ОнлайнЗаписьСотрудник""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КлючиВнешнихСистем.НомерТелефона КАК НомерТелефона,
	|	КлючиВнешнихСистем.Клиент КАК Сотрудник,
	|	КлючиВнешнихСистем.КлючКлиента КАК КлючКлиента,
	|	КлючиВнешнихСистем.Использовать КАК Использовать,
	|	втМестаРаботыСотрудников.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	втМестаРаботыСотрудников.Наименование КАК СтруктурнаяЕдиницаНаименование
	|ИЗ
	|	РегистрСведений.КлючиВнешнихСистем КАК КлючиВнешнихСистем
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втМестаРаботыСотрудников КАК втМестаРаботыСотрудников
	|		ПО КлючиВнешнихСистем.Клиент = втМестаРаботыСотрудников.Сотрудник
	|ГДЕ
	|	КлючиВнешнихСистем.ВнешняяСистема = &ВнешняяСистема
	|	И ВЫБОР
	|			КОГДА &ТолькоИспользующийся
	|				ТОГДА КлючиВнешнихСистем.Использовать
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &Сотрудник <> НЕОПРЕДЕЛЕНО
	|				ТОГДА КлючиВнешнихСистем.Клиент = &Сотрудник
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ"); 
		
	Запрос.УстановитьПараметр("ВнешняяСистема"      , ВнешняяСистема);
	Запрос.УстановитьПараметр("Сотрудник"			, Сотрудник);
	Запрос.УстановитьПараметр("ТолькоИспользующийся", ТолькоИспользующийся); 
	Запрос.УстановитьПараметр("ТекущаяДата"			, ТекущаяДатаСеанса());

    Возврат Запрос.Выполнить().Выгрузить(); 
			
КонецФункции

// Функция - Получить параметры сотрудника
//
// Параметры:
//  ВнешняяСистема	 - 	 - 
//  Сотрудник		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПараметрыСотрудника(ВнешняяСистема, Сотрудник) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КлючиВнешнихСистем.ВнешняяСистема КАК ВнешняяСистема,
	|	КлючиВнешнихСистем.НомерТелефона КАК НомерТелефона,
	|	КлючиВнешнихСистем.КлючКлиента КАК КлючКлиента,
	|	КлючиВнешнихСистем.Статус КАК Статус,
	|	КлючиВнешнихСистем.Использовать КАК Использовать
	|ИЗ
	|	РегистрСведений.КлючиВнешнихСистем КАК КлючиВнешнихСистем
	|ГДЕ
	|	КлючиВнешнихСистем.Клиент = &Сотрудник
	|	И КлючиВнешнихСистем.ВнешняяСистема = &ВнешняяСистема
	|	И НЕ КлючиВнешнихСистем.ВнешняяСистема.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("Сотрудник"     , Сотрудник);
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	
	СтруктураДанных = Новый Структура("ВнешняяСистема,НомерТелефона,КлючКлиента,Статус,Использовать");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
		Возврат СтруктураДанных;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить сотрудника по номеру телефона
//
// Параметры:
//  НомерТелефона	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСотрудникаПоНомеруТелефона(НомерТелефона) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КлючиВнешнихСистем.Клиент КАК Клиент
	|ИЗ
	|	РегистрСведений.КлючиВнешнихСистем КАК КлючиВнешнихСистем
	|ГДЕ
	|	КлючиВнешнихСистем.НомерТелефона ПОДОБНО &НомерТелефона
	|	И КлючиВнешнихСистем.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКлючейВнешнихСистем.Подтвержден)");
	
	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Результат.Следующий(), Результат.Клиент, Неопределено);
	
КонецФункции

// Процедура - Обновить данные сотрудника внешней системы
//
// Параметры:
//  ВнешняяСистема	 - 	 - 
//  Сотрудник		 - 	 - 
//  ДанныеОбновления - 	 - 
//
Процедура ОбновитьДанныеСотрудникаВнешнейСистемы(ВнешняяСистема, Сотрудник, ДанныеОбновления) Экспорт
	
	ПараметрыСотрудника = ПолучитьПараметрыСотрудника(ВнешняяСистема, Сотрудник);
	
	Если ПараметрыСотрудника <> Неопределено Тогда
		
		МенеджерЗаписи = РегистрыСведений.КлючиВнешнихСистем.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыСотрудника);
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.НомерТелефона = ?(ДанныеОбновления.Свойство("НомерТелефона"), ДанныеОбновления.НомерТелефона, МенеджерЗаписи.НомерТелефона);
		МенеджерЗаписи.Использовать  = ?(ДанныеОбновления.Свойство("Использовать") , ДанныеОбновления.Использовать , МенеджерЗаписи.Использовать);
		МенеджерЗаписи.Записать();
		
	Иначе
		ВызватьИсключение "Не удалось обнаружить запись в регистре КлючиВнешнихСистем.";
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Удалить данные о ключе внешней системы
//
// Параметры:
//  ВнешняяСистема	 - 	 - 
//  Объект			 - 	 - 
//
Процедура УдалитьДанныеОКлючеВнешнейСистемы(ВнешняяСистема, Объект) Экспорт
	
	ПараметрыМастера = ПолучитьПараметрыСотрудника(ВнешняяСистема, Объект);
	
	Если ПараметрыМастера <> Неопределено Тогда
		
		МенеджерЗаписи = РегистрыСведений.КлючиВнешнихСистем.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыМастера);
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.Удалить();
		
	Иначе
		ВызватьИсключение "Не удалось обнаружить запись в регистре КлючиВнешнихСистем.";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти