
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =			
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	НарядЗаказ.Ссылка КАК ДокументАванса,
	|	НарядЗаказ.Дата КАК Период,
	|	НарядЗаказ.Контрагент КАК Контрагент,
	|	НарядЗаказ.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА НарядЗаказ.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяССылка)
	|			ТОГДА НарядЗаказ.СтруктурнаяЕдиница.Организация
	|		ИНАЧЕ НарядЗаказ.Организация
	|	КОНЕЦ КАК Организация,
	|	НарядЗаказ.СуммаПродажи КАК Сумма,
	|	НарядЗаказ.Договор КАК Договор
	|ПОМЕСТИТЬ ВременнаяТаблицаВзаиморасчетыКонтрагентов
	|ИЗ
	|	Документ.НарядЗаказ КАК НарядЗаказ,
	|	Константа.НарядЗаказУвеличиваетЗадолженность КАК НарядЗаказУвеличиваетЗадолженность,
	|	Константа.УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов КАК УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов
	|ГДЕ
	|	НарядЗаказ.Ссылка = &Ссылка
	|	И НарядЗаказУвеличиваетЗадолженность.Значение
	|	И УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов.Значение = ИСТИНА
	|	И НарядЗаказ.СуммаПродажи <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НарядЗаказЗапасы.Ссылка.Дата КАК Период,
	|	НарядЗаказЗапасы.Номенклатура КАК Номенклатура,
	|	НарядЗаказЗапасы.Цена КАК Цена,
	|	НарядЗаказЗапасы.Упаковка КАК Упаковка,
	|	НарядЗаказЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НарядЗаказЗапасы.ВидЦен КАК ВидЦен
	|ПОМЕСТИТЬ ТаблицаУстановкаЦен
	|ИЗ
	|	Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
	|ГДЕ
	|	НарядЗаказЗапасы.Ссылка = &Ссылка
	|	И НарядЗаказЗапасы.Цена > 0
	|	И НЕ НарядЗаказЗапасы.ВидЦен = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НарядЗаказЗапасы.Ссылка.Дата,
	|	НарядЗаказЗапасы.Номенклатура,
	|	НарядЗаказЗапасы.ЦенаПродажи,
	|	НарядЗаказЗапасы.Упаковка,
	|	НарядЗаказЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	НарядЗаказЗапасы.ВидЦенПродажи
	|ИЗ
	|	Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
	|ГДЕ
	|	НарядЗаказЗапасы.Ссылка = &Ссылка
	|	И НарядЗаказЗапасы.Цена > 0
	|	И НЕ НарядЗаказЗапасы.ВидЦенПродажи = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	НарядЗаказЗапасы.КлючСтроки КАК КлючСтроки,
	|	НарядЗаказЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НарядЗаказЗапасы.Зуб КАК НомерЗуба,
	|	НарядЗаказЗапасы.Номенклатура КАК Номенклатура,
	|	НарядЗаказЗапасы.Лаборатория КАК Лаборатория,
	|	НарядЗаказЗапасы.Ссылка.Контрагент КАК Контрагент,
	|	НарядЗаказЗапасы.Ссылка КАК НарядЗаказ,
	|	НарядЗаказЗапасы.НомерЗаказа КАК НомерЗаказа,
	|	НарядЗаказЗапасы.Ссылка.Дата КАК Период,
	|	НарядЗаказЗапасы.Количество КАК Количество
	|ПОМЕСТИТЬ ТаблицаНарядЗаказы
	|ИЗ
	|	Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
	|ГДЕ
	|	НарядЗаказЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	НарядЗаказЗапасы.ПланЛечения КАК ПланЛечения,
	|	НарядЗаказЗапасы.КлючСтроки КАК КлючСтроки,
	|	НарядЗаказЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НарядЗаказЗапасы.Ссылка.Контрагент КАК Контрагент,
	|	НарядЗаказЗапасы.Зуб КАК Зуб,
	|	НарядЗаказЗапасы.Номенклатура КАК Номенклатура,
	|	СУММА(НарядЗаказЗапасы.Количество) КАК Количество,
	|	СУММА(НарядЗаказЗапасы.СуммаПродажи) КАК Сумма,
	|	НарядЗаказЗапасы.Ссылка.Дата КАК Период,
	|	НарядЗаказЗапасы.НомерПриема КАК НомерПриема
	|ПОМЕСТИТЬ ВременнаяТаблицаПланЛечения
	|ИЗ
	|	Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
	|ГДЕ
	|	НарядЗаказЗапасы.Ссылка = &Ссылка
	|	И НарядЗаказЗапасы.ПланЛечения ССЫЛКА Документ.ПланЛечения
	|	И НЕ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.ПланЛечения.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	НарядЗаказЗапасы.Номенклатура,
	|	НарядЗаказЗапасы.КлючСтроки,
	|	НарядЗаказЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	НарядЗаказЗапасы.Ссылка.Контрагент,
	|	НарядЗаказЗапасы.Ссылка.Дата,
	|	НарядЗаказЗапасы.Зуб,
	|	НарядЗаказЗапасы.ПланЛечения,
	|	НарядЗаказЗапасы.НомерПриема";
			        	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.ВыполнитьПакет();
	
	СформироватьТаблицаВзаиморасчетыСКонтрагентами(СтруктураДополнительныеСвойства);	
	СформироватьТаблицаУстановкаЦен(СтруктураДополнительныеСвойства);
	СформироватьТаблицаНарядЗаказов(СтруктураДополнительныеСвойства);
	СформироватьТаблицаПланЛечения(СтруктураДополнительныеСвойства);	
    
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыСКонтрагентами(СтруктураДополнительныеСвойства)
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаВзаиморасчетыСКонтрагентами.ВидДвижения КАК ВидДвижения,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Период КАК Период,
	|	ТаблицаВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Контрагент КАК Контрагент,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Организация КАК Организация,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ДокументАванса КАК ДокументАванса,
	|	СУММА(ТаблицаВзаиморасчетыСКонтрагентами.Сумма) КАК Сумма,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Договор КАК Договор
	|ИЗ
	|	ВременнаяТаблицаВзаиморасчетыКонтрагентов КАК ТаблицаВзаиморасчетыСКонтрагентами
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаВзаиморасчетыСКонтрагентами.ВидДвижения,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Период,
	|	ТаблицаВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Контрагент,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Организация,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ДокументАванса,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Договор";
	
	РезультатЗапроса = Запрос.Выполнить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыСКонтрагентами", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры	
	
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУстановкаЦен(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ   РАЗРЕШЕННЫЕ
	|	ТаблицаУстановкаЦен.Период КАК Период,
	|	ТаблицаУстановкаЦен.Номенклатура КАК Номенклатура,
	|	ТаблицаУстановкаЦен.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаУстановкаЦен.ВидЦен КАК ВидЦен,
	|	ТаблицаУстановкаЦен.Упаковка КАК Упаковка,
	|	ТаблицаУстановкаЦен.Цена КАК Цена,
	|	ИСТИНА КАК Актуальность
	|ИЗ
	|	ТаблицаУстановкаЦен КАК ТаблицаУстановкаЦен
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУстановкаЦен.Период,
	|	ТаблицаУстановкаЦен.Номенклатура,
	|	ТаблицаУстановкаЦен.СтруктурнаяЕдиница,
	|	ТаблицаУстановкаЦен.ВидЦен,
	|	ТаблицаУстановкаЦен.Упаковка,
	|	ТаблицаУстановкаЦен.Цена";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУстановкаЦен", РезультатЗапроса.Выгрузить());		

КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаНарядЗаказов(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НарядЗаказЗапасы.ВидДвижения,
	|	НарядЗаказЗапасы.КлючСтроки,
	|	НарядЗаказЗапасы.СтруктурнаяЕдиница,
	|	НарядЗаказЗапасы.НомерЗуба,
	|	НарядЗаказЗапасы.Номенклатура,
	|	НарядЗаказЗапасы.Лаборатория,
	|	НарядЗаказЗапасы.Контрагент,
	|	НарядЗаказЗапасы.НарядЗаказ,
	|	НарядЗаказЗапасы.НомерЗаказа,
	|	НарядЗаказЗапасы.Период,
	|	НарядЗаказЗапасы.Количество
	|ИЗ
	|	ТаблицаНарядЗаказы КАК НарядЗаказЗапасы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНарядЗаказы", РезультатЗапроса.Выгрузить());		

КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПланЛечения(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВременнаяТаблицаПланЛечения.ВидДвижения,
	|	ВременнаяТаблицаПланЛечения.КлючСтроки,
	|	ВременнаяТаблицаПланЛечения.НомерПриема,
	|	ВременнаяТаблицаПланЛечения.Период,
	|	ВременнаяТаблицаПланЛечения.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаПланЛечения.Контрагент,
	|	ВременнаяТаблицаПланЛечения.Зуб,
	|	ВременнаяТаблицаПланЛечения.Номенклатура,
	|	ВременнаяТаблицаПланЛечения.ПланЛечения,
	|	ВременнаяТаблицаПланЛечения.Количество,
	|	ВременнаяТаблицаПланЛечения.Сумма
	|ИЗ
	|	ВременнаяТаблицаПланЛечения КАК ВременнаяТаблицаПланЛечения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПланыЛечения", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры	

#КонецОбласти

#Область ПроцедурыФункцииПечати

// Функция формирует печатную форму документа.
//
// Параметры:
// Тип - Строка - тип печатной формы: ЗаказПоставщику или ЗаказПоставщикуПоДаннымПоставщика
// МассивОбъектов - Массив - массив документов для печати
// ОбъектыПечати - СписокЗначений
//
// Возвращаемое значение:
// ТабличныйДокумент
//
Функция СформироватьПечатнуюФормуЗаказНаряд(Тип, МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПФ_MXL_НарядЗаказ";
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		ЭтоСтоматологическиеУслуги = ОбщегоНазначенияСтоматология.ПолучитьПризнакОказанияСтоматологическихУслуг(ТекущийДокумент.Сотрудник); 
		НомерСтрокиНачало          = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НарядЗаказ.Номер КАК Номер,
		|	НарядЗаказ.Дата КАК Дата,
		|	НарядЗаказ.СтруктурнаяЕдиница.Организация КАК Заказчик,
		|	НарядЗаказ.Лаборатория КАК Исполнитель,
		|	НарядЗаказ.Контрагент КАК Пациент,
		|	НарядЗаказ.Сотрудник КАК Врач
		|ИЗ
		|	Документ.НарядЗаказ КАК НарядЗаказ
		|ГДЕ
		|	НарядЗаказ.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НарядЗаказЗапасы.Зуб КАК Зуб,
		|	НарядЗаказЗапасы.Номенклатура.Код КАК Код,
		|	НарядЗаказЗапасы.Номенклатура КАК Услуга,
		|	НарядЗаказЗапасы.Номенклатура.Артикул КАК Артикул,
		|	НарядЗаказЗапасы.КоличествоУпаковок КАК Количество,
		|	НарядЗаказЗапасы.Цена КАК Цена,
		|	НарядЗаказЗапасы.Сумма КАК Сумма
		|ИЗ
		|	Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
		|ГДЕ
		|	НарядЗаказЗапасы.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НарядЗаказЗапасы.Номенклатура.Наименование";
		
		Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
		ПакетЗапросов 		= Запрос.ВыполнитьПакет();
		
		ЗаказНаряд_Шапка 	= ПакетЗапросов[0].Выбрать();
		ТаблицаЗапасы	 	= ПакетЗапросов[1].Выгрузить();
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НарядЗаказ.ПФ_MXL_НарядЗаказ");

		                                           
		//==============================================================ЗАПОЛНЕНИЕ ШАПКИ====================================================================
		ЗаказНаряд_Шапка.Следующий();		
		
		ОбластьМакета                          = Макет.ПолучитьОбласть("Заголовок");
		ТекстЗаголовка                         = "Наряд-заказ № " + ФормированиеПечатныхФорм.ПолучитьНомерНаПечатьПосле2011г(ЗаказНаряд_Шапка.Номер, Истина, Истина) + " от " +Формат(ЗаказНаряд_Шапка.Дата, "ДЛФ=DD");
		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                    = Макет.ПолучитьОбласть("Организация");
		ПредставлениеЗаказчика                           = ?(ЗначениеЗаполнено(ЗаказНаряд_Шапка.Заказчик.ПолноеНаименование), ЗаказНаряд_Шапка.Заказчик.ПолноеНаименование, ЗаказНаряд_Шапка.Заказчик.Наименование);
		
		КонтактнаяИнформация = ЗаказНаряд_Шапка.Заказчик.КонтактнаяИнформация;
		МассивАдресов = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
		Если МассивАдресов.Количество() > 0 Тогда   
			ПредставлениеЗаказчика = ПредставлениеЗаказчика + ", " + МассивАдресов[0].Представление;
		КонецЕсли;			
		
		ОбластьМакета.Параметры.ПредставлениеОрганизации = ПредставлениеЗаказчика;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                    = Макет.ПолучитьОбласть("Исполнитель");
		ОбластьМакета.Параметры.ПредставлениеИсполнителя = ЗаказНаряд_Шапка.Исполнитель;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                 = Макет.ПолучитьОбласть("Пациент");
		ОбластьМакета.Параметры.ПредставлениеПациента = ЗаказНаряд_Шапка.Пациент;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                              = Макет.ПолучитьОбласть("Врач");
		ОбластьМакета.Параметры.ПредставлениеВрача = ЗаказНаряд_Шапка.Врач;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		//=============================================================ЗАПОЛНЕНИЕ ТАБЛИЦЫ===================================================================		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьСтроки = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьИтог   = Макет.ПолучитьОбласть("Подвал_Итого");
		Если НЕ ЭтоСтоматологическиеУслуги Тогда
			ОбластьКолонкаЗуб = ОбластьМакета.Область("R1C3:R2C5");
			ОбластьМакета.Удалитьобласть(ОбластьКолонкаЗуб,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			ОбластьКолонкаЗуб = ОбластьСтроки.Область("R1C3:R1C5");
			ОбластьСтроки.Удалитьобласть(ОбластьКолонкаЗуб,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			ОбластьКолонкаЗуб = ОбластьИтог.Область("R1C3:R1C5");
			ОбластьИтог.Удалитьобласть(ОбластьКолонкаЗуб,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьМакета);
					
		НомерСтроки = 0;		
		Для Каждого СтрокаТабличнойЧасти Из ТаблицаЗапасы Цикл			
			НомерСтроки                        = НомерСтроки + 1;			
			ОбластьСтроки.Параметры.Заполнить(СтрокаТабличнойЧасти);
			ОбластьСтроки.Параметры.Услуга      = СтрокаТабличнойЧасти.Услуга.НаименованиеПолное;
			ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;
			ТабличныйДокумент.Вывести(ОбластьСтроки);			
		КонецЦикла;
		
		ОбластьИтог.Параметры.ОбщееИтого = ТаблицаЗапасы.Итог("Сумма");
		ТабличныйДокумент.Вывести(ОбластьИтог);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");		
		ТабличныйДокумент.Вывести(ОбластьМакета);			
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент; 
	
КонецФункции // СформироватьПечатнуюФорму() 

// Функция формирует печатную форму документа.
//
// Параметры:
// Тип - Строка - тип печатной формы: ЗаказПоставщику или ЗаказПоставщикуПоДаннымПоставщика
// МассивОбъектов - Массив - массив документов для печати
// ОбъектыПечати - СписокЗначений
//
// Возвращаемое значение:
// ТабличныйДокумент
//
Функция СформироватьПечатнуюФормуЗаказНарядПациент(Тип, МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПФ_MXL_НарядЗаказПациент";
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		ЭтоСтоматологическиеУслуги = ОбщегоНазначенияСтоматология.ПолучитьПризнакОказанияСтоматологическихУслуг(ТекущийДокумент.Сотрудник); 
		НомерСтрокиНачало          = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НарядЗаказ.Номер КАК Номер,
		|	НарядЗаказ.Дата КАК Дата,
		|	НарядЗаказ.СтруктурнаяЕдиница.Организация КАК Заказчик,
		|	НарядЗаказ.Лаборатория КАК Исполнитель,
		|	НарядЗаказ.Контрагент КАК Пациент,
		|	НарядЗаказ.Сотрудник КАК Врач
		|ИЗ
		|	Документ.НарядЗаказ КАК НарядЗаказ
		|ГДЕ
		|	НарядЗаказ.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НарядЗаказЗапасы.Зуб КАК Зуб,
		|	НарядЗаказЗапасы.Номенклатура.Код КАК Код,
		|	НарядЗаказЗапасы.Номенклатура КАК Услуга,
		|	НарядЗаказЗапасы.Номенклатура.Артикул КАК Артикул,
		|	НарядЗаказЗапасы.КоличествоУпаковок КАК Количество,
		|	НарядЗаказЗапасы.ЦенаПродажи КАК Цена,
		|	НарядЗаказЗапасы.СуммаПродажи КАК Сумма,
		|	НарядЗаказЗапасы.ПроцентСкидкиНаценки КАК Скидка
		|ИЗ
		|	Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
		|ГДЕ
		|	НарядЗаказЗапасы.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НарядЗаказЗапасы.Номенклатура.Наименование";
		
		Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
		ПакетЗапросов 		= Запрос.ВыполнитьПакет();
		
		ЗаказНаряд_Шапка 	= ПакетЗапросов[0].Выбрать();
		ТаблицаЗапасы	 	= ПакетЗапросов[1].Выгрузить();
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НарядЗаказ.ПФ_MXL_НарядЗаказПациент");  
		
		//==============================================================ЗАПОЛНЕНИЕ ШАПКИ====================================================================
		ЗаказНаряд_Шапка.Следующий();		
		
		ОбластьМакета                          = Макет.ПолучитьОбласть("Заголовок");
		ТекстЗаголовка                         = "Наряд-заказ № " + ФормированиеПечатныхФорм.ПолучитьНомерНаПечатьПосле2011г(ЗаказНаряд_Шапка.Номер, Истина, Истина) + " от " +Формат(ЗаказНаряд_Шапка.Дата, "ДЛФ=DD");
		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                    = Макет.ПолучитьОбласть("Организация");
		ПредставлениеЗаказчика                           = ?(ЗначениеЗаполнено(ЗаказНаряд_Шапка.Заказчик.ПолноеНаименование), ЗаказНаряд_Шапка.Заказчик.ПолноеНаименование, ЗаказНаряд_Шапка.Заказчик.Наименование);
		
		КонтактнаяИнформация = ЗаказНаряд_Шапка.Заказчик.КонтактнаяИнформация;
		МассивАдресов = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
		Если МассивАдресов.Количество() > 0 Тогда   
			ПредставлениеЗаказчика = ПредставлениеЗаказчика + ", " + МассивАдресов[0].Представление;
		КонецЕсли;			
		
		ОбластьМакета.Параметры.ПредставлениеОрганизации = ПредставлениеЗаказчика;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                    = Макет.ПолучитьОбласть("Исполнитель");
		ОбластьМакета.Параметры.ПредставлениеИсполнителя = ЗаказНаряд_Шапка.Исполнитель;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                 = Макет.ПолучитьОбласть("Пациент");
		ОбластьМакета.Параметры.ПредставлениеПациента = ЗаказНаряд_Шапка.Пациент;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                              = Макет.ПолучитьОбласть("Врач");
		ОбластьМакета.Параметры.ПредставлениеВрача = ЗаказНаряд_Шапка.Врач;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		//=============================================================ЗАПОЛНЕНИЕ ТАБЛИЦЫ===================================================================		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьСтроки = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьИтог   = Макет.ПолучитьОбласть("Подвал_Итого");
		Если НЕ ЭтоСтоматологическиеУслуги Тогда
			ОбластьКолонкаЗуб = ОбластьМакета.Область("R1C3:R2C5");
			ОбластьМакета.Удалитьобласть(ОбластьКолонкаЗуб,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			ОбластьКолонкаЗуб = ОбластьСтроки.Область("R1C3:R1C5");
			ОбластьСтроки.Удалитьобласть(ОбластьКолонкаЗуб,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			ОбластьКолонкаЗуб = ОбластьИтог.Область("R1C3:R1C5");
			ОбластьИтог.Удалитьобласть(ОбластьКолонкаЗуб,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьМакета);
					
		НомерСтроки = 0;		
		Для Каждого СтрокаТабличнойЧасти Из ТаблицаЗапасы Цикл			
			НомерСтроки                         = НомерСтроки + 1;			
			ОбластьСтроки.Параметры.Заполнить(СтрокаТабличнойЧасти);
			ОбластьСтроки.Параметры.Услуга      = СтрокаТабличнойЧасти.Услуга.НаименованиеПолное;
			ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;
			ТабличныйДокумент.Вывести(ОбластьСтроки);			
		КонецЦикла;
		
		ОбластьИтог.Параметры.ОбщееИтого = ТаблицаЗапасы.Итог("Сумма");
		ТабличныйДокумент.Вывести(ОбластьИтог);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");		
		ТабличныйДокумент.Вывести(ОбластьМакета);			
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент; 
	
КонецФункции // СформироватьПечатнуюФорму()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_НарядЗаказ") Тогда
		
		Если ПараметрыПечати.Свойство("Тип") = Ложь Тогда
			ПараметрыПечати.Вставить("Тип", "НарядЗаказ");			
		КонецЕсли;
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_НарядЗаказ", "Заказ-наряд", СформироватьПечатнуюФормуЗаказНаряд(ПараметрыПечати["Тип"], МассивОбъектов, ОбъектыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_НарядЗаказПациент") Тогда
		
		Если ПараметрыПечати.Свойство("Тип") = Ложь Тогда
			ПараметрыПечати.Вставить("Тип", "НарядЗаказ");			
		КонецЕсли;
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_НарядЗаказПациент", "Заказ-наряд пациенту", СформироватьПечатнуюФормуЗаказНарядПациент(ПараметрыПечати["Тип"], МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры // Печать()

// Функция получения списка печатных форм.
//
Функция ПолучитьСписокПечатныхФорм() Экспорт
	
	Список = Новый СписокЗначений;
	Список.Добавить("ПФ_MXL_НарядЗаказ", "Наряд заказ", , БиблиотекаКартинок.Документ);  
	Список.Добавить("ПФ_MXL_НарядЗаказПациент", "Наряд заказ (пациенту)", , БиблиотекаКартинок.Документ);
	Список.Добавить("ПФ_MXL_ГарантийныйТалон", "Гарантийный талон", , БиблиотекаКартинок.Документ);
	Список.Добавить("ПФ_MXL_Квитанция", "Квитанция об оплате", , БиблиотекаКартинок.Документ); 	
	
	Возврат Список;
	
КонецФункции

#КонецОбласти

#Область ДополнительныеПроцедурыФункции

// Функция вернет остатки по выполненным заказам документа
//
Функция ПолучитьОстаткиПоВыполненнымСтрокамНарядЗаказа(НарядЗаказ,Период = Неопределено) Экспорт
	
	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НарядЗаказыОстатки.Номенклатура,
	|	НарядЗаказыОстатки.КоличествоОстаток КАК Количество,
	|	НарядЗаказЗапасы.ЦенаПродажи КАК Цена,
	|	НарядЗаказЗапасы.СуммаПродажи КАК Сумма,
	|	НарядЗаказЗапасы.ВсегоПродажи КАК Всего,
	|	НарядЗаказЗапасы.Зуб,
	|	НарядЗаказЗапасы.Партия,
	|	НарядЗаказЗапасы.СтавкаНДС,
	|	НарядЗаказЗапасы.СуммаНДС,
	|	НарядЗаказЗапасы.Упаковка,
	|	НарядЗаказЗапасы.НомерЗаказа,
	|	НарядЗаказЗапасы.ВидЦен
	|ИЗ
	|	РегистрНакопления.НарядЗаказы.Остатки(&Период, НарядЗаказ = &НарядЗаказ) КАК НарядЗаказыОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
	|		ПО НарядЗаказыОстатки.НарядЗаказ = НарядЗаказЗапасы.Ссылка
	|			И НарядЗаказыОстатки.Номенклатура = НарядЗаказЗапасы.Номенклатура
	|			И НарядЗаказыОстатки.НомерЗаказа = НарядЗаказЗапасы.НомерЗаказа
	|ГДЕ
	|	НарядЗаказЗапасы.Ссылка = &НарядЗаказ";
	Запрос.УстановитьПараметр("Период"    ,?(Период = Неопределено,КонецДня(ТекущаяДата()),Период));
    Запрос.УстановитьПараметр("НарядЗаказ",НарядЗаказ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
