
#Область ОписаниеПеременных

Перем Перем_РежимЗаписи;

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Заполнение реквизитов документа по умолчанию
	Дата               	= ТекущаяДата();
	АвторДокумента	   	= ПараметрыСеанса.ТекущийПользователь;
	СтруктурнаяЕдиница 	= ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	ВидЦен 				= Справочники.ВидыЦен.Закупочная;
	
	ЗначениеНастройки   = ПользователиСтоматология.ПолучитьЗначениеПоУмолчаниюПользователя(ПараметрыСеанса.ТекущийПользователь, "ОсновнаяКасса", СтруктурнаяЕдиница);
	
	Касса 		        = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, СтруктурнаяЕдиница.ОсновнаяКасса);

	Если ДанныеЗаполнения <> Неопределено Тогда
		// Заполнение на основании документа "Прием"
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Прием") Тогда
			Контрагент 		  = ДанныеЗаполнения.Контрагент;
			Сотрудник 		  = ДанныеЗаполнения.Сотрудник;
			Склад 			  = ДанныеЗаполнения.Склад;
			ДокументОснование = ДанныеЗаполнения.Ссылка;
			//// -----------------------Заполнение табличной части---------------------------
			// Если ДанныеЗаполнения.Лечение.Количество() <> 0 Тогда 
			//	Для Каждого СтрокаЛечение Из ДанныеЗаполнения.Лечение Цикл 
			//		Если СтрокаЛечение.Номенклатура.Лаборатория Тогда 
			//			НоваяСтрокаЗапасы = Запасы.Добавить();
			//			НоваяСтрокаЗапасы.Зуб 					= СтрокаЛечение.Зуб;
			//			НоваяСтрокаЗапасы.Номенклатура 			= СтрокаЛечение.Номенклатура;
			//			НоваяСтрокаЗапасы.Количество 			= СтрокаЛечение.КоличествоУпаковок;
			//			НоваяСтрокаЗапасы.КоличествоУпаковок 	= СтрокаЛечение.КоличествоУпаковок;
			//			НоваяСтрокаЗапасы.Упаковка = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(НоваяСтрокаЗапасы.Номенклатура, "УпаковкаПоумолчанию");	
			//			СтруктураДанные = Новый Структура();
			//			СтруктураДанные.Вставить("СтруктурнаяЕдиница",  СтруктурнаяЕдиница);
			//			СтруктураДанные.Вставить("ДатаОбработки",	 	Дата);
			//			СтруктураДанные.Вставить("ВидЦен", 				ВидЦен);
			//			СтруктураДанные.Вставить("Номенклатура", 		НоваяСтрокаЗапасы.Номенклатура);
			//			СтруктураДанные.Вставить("Упаковка", 			НоваяСтрокаЗапасы.Упаковка);						
			//			СтруктураДанные = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);						
			//			// НоваяСтрокаЗапасы.Упаковка = СтруктураДанные.Упаковка;
			//			НоваяСтрокаЗапасы.Цена = СтруктураДанные.Цена;
			//			НоваяСтрокаЗапасы.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
			//			НоваяСтрокаЗапасы.Сумма = НоваяСтрокаЗапасы.Цена * НоваяСтрокаЗапасы.Количество;
			//			ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуНДСТабЧасти(НоваяСтрокаЗапасы);
			//			ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуВКолонкеВсегоТабЧасти(НоваяСтрокаЗапасы);						
			//		КонецЕсли;
			//	КонецЦикла;
			// КонецЕсли;
			//
			// Если ДанныеЗаполнения.Запасы.Количество() <> 0 Тогда 
			//	Для Каждого СтрокаЗапасы Из ДанныеЗаполнения.Запасы Цикл 
			//		Если СтрокаЗапасы.Номенклатура.Лаборатория Тогда 
			//			НоваяСтрокаЗапасы = Запасы.Добавить();						
			//			НоваяСтрокаЗапасы.Зуб = Перечисления.Зубы.ВсяПолость;
			//			НоваяСтрокаЗапасы.Номенклатура 			= СтрокаЗапасы.Номенклатура;
			//			НоваяСтрокаЗапасы.Партия 				= СтрокаЗапасы.Партия;
			//			НоваяСтрокаЗапасы.КоличествоУпаковок 	= СтрокаЗапасы.КоличествоУпаковок;
			//			НоваяСтрокаЗапасы.Упаковка 				= СтрокаЗапасы.Упаковка;
			//			СтруктураДанные = Новый Структура();
			//			СтруктураДанные.Вставить("СтруктурнаяЕдиница",  СтруктурнаяЕдиница);
			//			СтруктураДанные.Вставить("ДатаОбработки",	 	Дата);
			//			СтруктураДанные.Вставить("ВидЦен", 				ВидЦен);
			//			СтруктураДанные.Вставить("Номенклатура", 		НоваяСтрокаЗапасы.Номенклатура);
			//			СтруктураДанные.Вставить("Упаковка", 			НоваяСтрокаЗапасы.Упаковка);						
			//			СтруктураДанные = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
			//			// НоваяСтрокаЗапасы.Упаковка = СтруктураДанные.Упаковка;
			//			НоваяСтрокаЗапасы.Цена = СтруктураДанные.Цена;
			//			НоваяСтрокаЗапасы.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
			//			НоваяСтрокаЗапасы.Сумма = НоваяСтрокаЗапасы.Цена * НоваяСтрокаЗапасы.КоличествоУпаковок;
			//			ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуНДСТабЧасти(НоваяСтрокаЗапасы);
			//			ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуВКолонкеВсегоТабЧасти(НоваяСтрокаЗапасы);						
			//		КонецЕсли;
			//	КонецЦикла;
			// КонецЕсли;
			// Запасы.Сортировать("Номенклатура");
			// -----------------------------------------------------------------------------
			
		// Заполнение на основании документа "Предварительной записи"
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Событие") Тогда
			Контрагент 		  = ДанныеЗаполнения.Контрагент;
			Сотрудник 		  = ?(ДанныеЗаполнения.Услуги.Количество() > 0, ДанныеЗаполнения.Услуги[0].Сотрудник, Справочники.Сотрудники.ПустаяСсылка());
			Склад             = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.ОсновнойСклад;
			ДокументОснование = ДанныеЗаполнения.Ссылка;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПланЛечения") Тогда
			Контрагент 		  = ДанныеЗаполнения.Контрагент;
			Сотрудник 		  = ДанныеЗаполнения.Сотрудник;
			Склад 			  = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.ОсновнойСклад;
			ДокументОснование = ДанныеЗаполнения.Ссылка;			
		КонецЕсли;
	КонецЕсли;
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура, обработчик события "ПриКопировании"
//
Процедура ПриКопировании(ОбъектКопирования)

	ЭтотОбъект.Статус 		= Ложь;
	ЭтотОбъект.СуммаПродажи = 0;
	Для Каждого СтрокаТЧ Из ЭтотОбъект.Запасы Цикл
		СтрокаТЧ.НомерЗаказа 	= "";
		СтрокаТЧ.Статус 		= Перечисления.СтатусыНарядЗаказа.Заказано;
		СтрокаТЧ.ДатаЗаказа 	= Неопределено;
		СтрокаТЧ.ДатаВыполнения = Неопределено;
		СтрокаТЧ.Прием 			= Документы.Прием.ПустаяСсылка();
		СтрокаТЧ.ПланЛечения 	= Неопределено;		
	КонецЦикла;
	ЭтотОбъект.Договор = Неопределено;
	СуммаОплаченоПродажи = 0;
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

// Обработчик проведения документа
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	 // Инициализация дополнительных свойств для проведения документа.
	ДвиженияДокументовСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);	
    // Инициализация данных документа.	
	Документы.НарядЗаказ.УстановитьНачальныеДанныеДокумента(Ссылка, ДополнительныеСвойства);	
    // Движения по регистрам		
	ДвиженияДокументовСервер.ВзаиморасчетыСКонтрагентами(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.УстановкаЦен(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.НарядЗаказы(ДополнительныеСвойства, Движения, Отказ); 
	ДвиженияДокументовСервер.ПланыЛечения(ДополнительныеСвойства, Движения, Отказ);   		
	// Запись наборов записей.                                                     	
	ДвиженияДокументовСервер.ДобавитьНаборыЗаписей(ЭтотОбъект);		

КонецПроцедуры

// Обработчик перед записью документа
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = Запасы.Итог("Всего");
	СуммаПродажи   = Запасы.Итог("ВсегоПродажи");
	
	// ПостОбработка Планов лечения
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		ПостОбработкаДокументовАванса(РежимЗаписи, Отказ);
	КонецЕсли;
	
	Перем_РежимЗаписи = РежимЗаписи;
	
КонецПроцедуры

// Процедура, обработчик события "ПриЗаписи"
//
Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	МаксИдентификаторСтроки = 0;
	Перезаписать = Ложь;
	Для Каждого СтрокаТЧ из Запасы Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.НомерЗаказа) Тогда
			Ключ = Сред(СтрокаТЧ.НомерЗаказа, Найти(СтрокаТЧ.НомерЗаказа, "-")+1);			
			Если Число(Ключ) > МаксИдентификаторСтроки Тогда
				МаксИдентификаторСтроки = Число(Ключ);
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	Для Каждого СтрокаТЧ из Запасы Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.НомерЗаказа) или Найти(СтрокаТЧ.НомерЗаказа, "-") = 1 Тогда
			МаксИдентификаторСтроки = МаксИдентификаторСтроки + 1;
			СтрокаТЧ.НомерЗаказа = СтрЗаменить(ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Номер, "", Ложь),"-","") + "-"+ МаксИдентификаторСтроки;
			Перезаписать = Истина;
		КонецЕсли;
	КонецЦикла;  
	
	Если Перезаписать Тогда
		Если Перем_РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
			ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
			Перем_РежимЗаписи = РежимЗаписиДокумента.Проведение
		Иначе
			ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;	
	КонецЕсли;
	
	// Пост-обработка документов аванса
	ПостОбработкаДокументовАванса(, Отказ);
	
	// Автоматическая генерация/синхронизация документов Поступления
	Создать_Синхронизировать_ДокументыПоступления();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Удаляем цены из регистра по документу
	ДвиженияДокументовСервер.УдалениеЦен(Ссылка, Движения, Отказ);
	
КонецПроцедуры

// Процедура, обработчик события "ОбработкаПроверкиЗаполнения"
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка табличной части на разрешения по значениям 
	Если ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьНулевуюСумму, Ложь) Тогда
		УдаляемыйЭлемент = ПроверяемыеРеквизиты.Найти("Запасы.Сумма");
	
		Если УдаляемыйЭлемент <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(УдаляемыйЭлемент);
		КонецЕсли;
	КонецЕсли;
	
	// 1. Определяем вид налога если он не заполнен, для старых документов.	
	Если Запасы.Количество() > 0 Тогда
		ВидНалога    = Справочники.Номенклатура.ПолучитьВидНалогаНоменклатуры(Запасы[0].Номенклатура, СтруктурнаяЕдиница);// Запасы[0].Номенклатура.ВидНалога;
		Номенклатура = Запасы[0].Номенклатура;
	Иначе
		Возврат;
	КонецЕсли;
	
	ЕстьРазличия = Ложь;
	Для Каждого СтрокаТЧ Из Запасы Цикл
		Если НЕ Справочники.Номенклатура.ПолучитьВидНалогаНоменклатуры(СтрокаТЧ.Номенклатура, СтруктурнаяЕдиница) = ВидНалога Тогда
			ЕстьРазличия = Истина;	
			мНоменклатура = СтрокаТЧ.Номенклатура;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьРазличия Тогда
		Отказ = Истина;
		ТекстСообщения = "В одном документе, пробиваемом в ККТ с передачей данных, может пробиваться номенклатура, использующая один режим налогообложения. Номенклатура '%1' и '%2' используют разные режимы налогообложения";
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Номенклатура, мНоменклатура);	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область АВТОМАТИЧЕСКАЯ_ГЕНЕРАЦИЯ_СИНХРОНИЗАЦИЯ_ДОКУМЕНТОВ_ПОСТУПЛЕНИЯ


// Автоматическое создание документов Поступление
//
Процедура Создать_Синхронизировать_ДокументыПоступления()
	       
	УстановитьПривилегированныйРежим(Истина);
	Если Константы.АвтоматическиСоздаватьПоступлениеПриВыполненииНарядЗаказа.Получить() Тогда	
		
		// Получим структуру таблиц со строками, ранее попавшими в Поступления
		СтруктураТаблиц = ВернутьЗапасыИУслугиИзДокументовПоступления(Ссылка);
		
		// Если режим записи "ОтменаПроведения", отменим проведение у ранее созданных документов Поступления
		Если Перем_РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
			Для Каждого Документ_Поступление Из СтруктураТаблиц.МассивПоступлений Цикл
				Документ_Поступление_Объект = Документ_Поступление.Ссылка.ПолучитьОбъект();				
				Если Ссылка.ПометкаУдаления Тогда
					Документ_Поступление_Объект.УстановитьПометкуУдаления(Истина); 
					Документ_Поступление_Объект.Записать();
				Иначе
					Документ_Поступление_Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;				
			КонецЦикла;
			
		// Если режим записи "Запись"
		ИначеЕсли Перем_РежимЗаписи = РежимЗаписиДокумента.Запись Тогда	
			Для Каждого Документ_Поступление Из СтруктураТаблиц.МассивПоступлений Цикл
				Если Ссылка.ПометкаУдаления Тогда
					Если НЕ Документ_Поступление.Ссылка.ПометкаУдаления Тогда 
						Документ_Поступление_Объект = Документ_Поступление.Ссылка.ПолучитьОбъект();				
						Документ_Поступление_Объект.УстановитьПометкуУдаления(Истина);
						Документ_Поступление_Объект.Записать();
					КонецЕсли;
				Иначе 
					Если Документ_Поступление.Ссылка.ПометкаУдаления Тогда 
						Документ_Поступление_Объект = Документ_Поступление.Ссылка.ПолучитьОбъект();				
						Документ_Поступление_Объект.УстановитьПометкуУдаления(Ложь);
						Документ_Поступление_Объект.Записать();
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;						
			
		// Если режим записи "Проведение", сгенерируем документы Поступления и синхронизируем строки в ранее созданных
		ИначеЕсли Перем_РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
			
			// Выгрузим из Наряд-заказа все строки со статусом "Выполнено"
			ТаблицаВыполненныхЗаказов 	= Запасы.Выгрузить(Новый Структура("Статус", Перечисления.СтатусыНарядЗаказа.Выполнено));
			
			// Разделим таблицу на услуги и все остальное
			ТаблицаВыполненныхЗаказов_Запас 	= ТаблицаВыполненныхЗаказов.СкопироватьКолонки();
			ТаблицаВыполненныхЗаказов_Услуги 	= ТаблицаВыполненныхЗаказов.СкопироватьКолонки();		
			Для Каждого ВыполненныйЗаказ Из ТаблицаВыполненныхЗаказов Цикл 
				Если ВыполненныйЗаказ.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда 
					СтрокаТаблицы = ТаблицаВыполненныхЗаказов_Услуги.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыполненныйЗаказ);
				Иначе 
					СтрокаТаблицы = ТаблицаВыполненныхЗаказов_Запас.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыполненныйЗаказ);	
				КонецЕсли;
			КонецЦикла;
			
			// Вычислим строки Наряд-заказа, не вошедшие в документы Поступления
			ТаблицаСтрокНеВошедшихВПоступление = ВернутьСтрокиНарядЗаказаНеВошедшиеВПоступление(СтруктураТаблиц, ТаблицаВыполненныхЗаказов);			
			
			
			// Произведем анализ для последующей синхронизации строк в Наряд-заказе и Поступлении
			МассивУдаленныхСтрок_Запасы 		= Новый Массив;
			МассивУдаленныхСтрок_Услуги 		= Новый Массив;
			МассивМодифицированныхСтрок_Запасы 	= Новый Массив;
			МассивМодифицированныхСтрок_Услуги 	= Новый Массив;
			МассивСтрокСИзмененнойЛабораторией 	= Новый Массив;
			
			Если СтруктураТаблиц.МассивПоступлений.Количество() > 0 Тогда 
				Для Каждого Поступление Из СтруктураТаблиц.МассивПоступлений Цикл
					
					МассивУдаленныхСтрок_Запасы.Очистить();
					МассивУдаленныхСтрок_Услуги.Очистить();
					МассивМодифицированныхСтрок_Запасы.Очистить();
					МассивМодифицированныхСтрок_Услуги.Очистить();					
					МассивСтрокСИзмененнойЛабораторией.Очистить();
					
					ПометитьПоступлениеНаУдаление = Ложь;
					
					МассивСтрок = СтруктураТаблиц.ТаблицаЗапасов.НайтиСтроки(Новый Структура("Ссылка", Поступление.Ссылка));
					Для Каждого СтрокаМассива Из МассивСтрок Цикл 
						СтрокаНарядЗаказа = ТаблицаВыполненныхЗаказов_Запас.Найти(СтрокаМассива.КлючСтроки, "КлючСтроки");
						Если СтрокаНарядЗаказа <> Неопределено Тогда 
							Если СтрокаНарядЗаказа.Номенклатура 		<> СтрокаМассива.Номенклатура 		ИЛИ 
								СтрокаНарядЗаказа.Упаковка 				<> СтрокаМассива.Упаковка 			ИЛИ
								СтрокаНарядЗаказа.КоличествоУпаковок 	<> СтрокаМассива.КоличествоУпаковок ИЛИ
								СтрокаНарядЗаказа.Цена 					<> СтрокаМассива.Цена 				ИЛИ
								СтрокаНарядЗаказа.Всего 				<> СтрокаМассива.Всего 				Тогда
								ЗаполнитьЗначенияСвойств(СтрокаМассива, СтрокаНарядЗаказа);
								МассивМодифицированныхСтрок_Запасы.Добавить(СтрокаМассива);
							КонецЕсли;
							Если СтрокаНарядЗаказа.Лаборатория <> Поступление.Ссылка.Контрагент Тогда 
								МассивСтрокСИзмененнойЛабораторией.Добавить(СтрокаНарядЗаказа);						
							КонецЕсли;							
						Иначе 
							МассивУдаленныхСтрок_Запасы.Добавить(СтрокаМассива);						 
						КонецЕсли;	
					КонецЦикла;
					
					МассивСтрок = СтруктураТаблиц.ТаблицаУслуг.НайтиСтроки(Новый Структура("Ссылка", Поступление.Ссылка));
					Для Каждого СтрокаМассива Из МассивСтрок Цикл 
						СтрокаНарядЗаказа = ТаблицаВыполненныхЗаказов_Услуги.Найти(СтрокаМассива.КлючСтроки, "КлючСтроки");
						Если СтрокаНарядЗаказа <> Неопределено Тогда 
							Если СтрокаНарядЗаказа.Номенклатура 		<> СтрокаМассива.Номенклатура 		ИЛИ 
								СтрокаНарядЗаказа.Упаковка 				<> СтрокаМассива.Упаковка 			ИЛИ
								СтрокаНарядЗаказа.КоличествоУпаковок 	<> СтрокаМассива.КоличествоУпаковок ИЛИ
								СтрокаНарядЗаказа.Цена 					<> СтрокаМассива.Цена 				ИЛИ
								СтрокаНарядЗаказа.Всего 				<> СтрокаМассива.Всего 				ИЛИ
								Ссылка.Сотрудник 						<> СтрокаМассива.Сотрудник 			Тогда
								ЗаполнитьЗначенияСвойств(СтрокаМассива, СтрокаНарядЗаказа);								
								МассивМодифицированныхСтрок_Услуги.Добавить(СтрокаМассива);
							КонецЕсли;
							Если СтрокаНарядЗаказа.Лаборатория <> Поступление.Ссылка.Контрагент Тогда 
								МассивСтрокСИзмененнойЛабораторией.Добавить(СтрокаНарядЗаказа);						
							КонецЕсли;						
						Иначе 
							МассивУдаленныхСтрок_Услуги.Добавить(СтрокаМассива);						 
						КонецЕсли;	
					КонецЦикла;
					
					// Синхронизируем строки
					Поступление_Объект = Неопределено;
					Если МассивУдаленныхСтрок_Запасы.Количество()		 	<> 0 ИЛИ
					 	 МассивУдаленныхСтрок_Услуги.Количество()		 	<> 0 ИЛИ
						 МассивМодифицированныхСтрок_Запасы.Количество() 	<> 0 ИЛИ
						 МассивМодифицированныхСтрок_Услуги.Количество()	<> 0 ИЛИ
						 МассивСтрокСИзмененнойЛабораторией.Количество() 	<> 0 Тогда
						
						Поступление_Объект = Поступление.Ссылка.ПолучитьОбъект();
						// Работа с модифицированными строками
						Для Каждого СтрокаМассива Из МассивМодифицированныхСтрок_Запасы Цикл 
							СтрокаПоступления = Поступление_Объект.Запасы.Найти(СтрокаМассива.КлючСтроки, "КлючСтроки");
							Если СтрокаПоступления <> Неопределено Тогда 
								ЗаполнитьЗначенияСвойств(СтрокаПоступления, СтрокаМассива);
							КонецЕсли;
						КонецЦикла;	
						
						Для Каждого СтрокаМассива Из МассивМодифицированныхСтрок_Услуги Цикл 
							СтрокаПоступления = Поступление_Объект.Расходы.Найти(СтрокаМассива.КлючСтроки, "КлючСтроки");
							Если СтрокаПоступления <> Неопределено Тогда 
								ЗаполнитьЗначенияСвойств(СтрокаПоступления, СтрокаМассива);
								СтрокаПоступления.Сотрудник = Ссылка.Сотрудник;
								СтрокаПоступления.Специализация = ?(ЗначениеЗаполнено(СтрокаПоступления.Сотрудник), ?(СтрокаПоступления.Сотрудник.СпецилазацииСотрудника.Найти(Истина, "Основная") <> Неопределено, СтрокаПоступления.Сотрудник.СпецилазацииСотрудника.Найти(Истина, "Основная").Специализация, Справочники.Специализации.ПустаяСсылка()), Справочники.Специализации.ПустаяСсылка());								
							КонецЕсли;
						КонецЦикла;
						
						// Работа с удаляемыми строками
						Для Каждого СтрокаМассива Из МассивУдаленныхСтрок_Запасы Цикл 
							СтрокаПоступления = Поступление_Объект.Запасы.Найти(СтрокаМассива.КлючСтроки, "КлючСтроки");
							Если СтрокаПоступления <> Неопределено Тогда 
								Поступление_Объект.Запасы.Удалить(СтрокаПоступления);
							КонецЕсли;
						КонецЦикла;
						
						Для Каждого СтрокаМассива Из МассивУдаленныхСтрок_Услуги Цикл 
							СтрокаПоступления = Поступление_Объект.Расходы.Найти(СтрокаМассива.КлючСтроки, "КлючСтроки");
							Если СтрокаПоступления <> Неопределено Тогда 
								Поступление_Объект.Расходы.Удалить(СтрокаПоступления);
							КонецЕсли;
						КонецЦикла;
						
						// Работа со строками с измененной лабораторией
  				    	Для Каждого СтрокаСИзмененнойЛабораторией Из МассивСтрокСИзмененнойЛабораторией Цикл 
							СтрокаПоступления = Поступление_Объект.Запасы.Найти(СтрокаСИзмененнойЛабораторией.КлючСтроки, "КлючСтроки");
							Если СтрокаПоступления <> Неопределено Тогда
								МассивУдаленныхСтрок_Запасы.Добавить(СтрокаПоступления);
								Поступление_Объект.Запасы.Удалить(СтрокаПоступления);
								НоваяСтрокаТаблицы = ТаблицаСтрокНеВошедшихВПоступление.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, СтрокаСИзмененнойЛабораторией);
							КонецЕсли;
							СтрокаПоступления = Поступление_Объект.Расходы.Найти(СтрокаСИзмененнойЛабораторией.КлючСтроки, "КлючСтроки");
							Если СтрокаПоступления <> Неопределено Тогда
								МассивУдаленныхСтрок_Услуги.Добавить(СтрокаПоступления);
								Поступление_Объект.Расходы.Удалить(СтрокаПоступления);
								НоваяСтрокаТаблицы = ТаблицаСтрокНеВошедшихВПоступление.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, СтрокаСИзмененнойЛабораторией);
							КонецЕсли;							
						КонецЦикла;
						
						//// Проставим флаг в истину если Наряд-Заказе удалены все строки
						// Если МассивУдаленныхСтрок_Услуги.Количество() = СтруктураТаблиц.ТаблицаУслуг.Количество() И
						//	МассивУдаленныхСтрок_Запасы.Количество() = СтруктураТаблиц.ТаблицаЗапасов.Количество() И 
						//	ТаблицаСтрокНеВошедшихВПоступление.Количество() = 0 Тогда 
						//	ПометитьПоступлениеНаУдаление = Истина;
						// КонецЕсли;						
					КонецЕсли;
					
					
					// Допишем новые строки в документ Поступление 
					МассивСтрок = ТаблицаСтрокНеВошедшихВПоступление.НайтиСтроки(Новый Структура("Лаборатория", Поступление.Ссылка.Контрагент));
					Если МассивСтрок.Количество() > 0 Тогда 
						Если Поступление_Объект = Неопределено Тогда
							Поступление_Объект = Поступление.Ссылка.ПолучитьОбъект();
						КонецЕсли;	
						Для Каждого СтрокаМассива Из МассивСтрок Цикл 
							Если СтрокаМассива.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда 
								СтрокаУслуги = Поступление_Объект.Расходы.Добавить();
							    ЗаполнитьЗначенияСвойств(СтрокаУслуги, СтрокаМассива);
								СтрокаУслуги.СтавкаНДС 			= Перечисления.СтавкиНДС.БезНдс;
								СтрокаУслуги.Сотрудник 			= Ссылка.Сотрудник;
								СтрокаУслуги.Специализация 		= ?(ЗначениеЗаполнено(Ссылка.Сотрудник), ?(Ссылка.Сотрудник.СпецилазацииСотрудника.Найти(Истина, "Основная") <> Неопределено, Ссылка.Сотрудник.СпецилазацииСотрудника.Найти(Истина, "Основная").Специализация, Справочники.Специализации.ПустаяСсылка()), Справочники.Специализации.ПустаяСсылка());
								СтрокаУслуги.СтатьяРасходов 	= Справочники.СтатьиДоходовИРасходов.Лаборатория;
								СтрокаУслуги.ДокументОснования 	= Ссылка;
							Иначе
								СтрокаУслуги = Поступление_Объект.Запасы.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаУслуги, СтрокаМассива);
								СтрокаУслуги.СтавкаНДС 			= Перечисления.СтавкиНДС.БезНдс;
								СтрокаУслуги.ДокументОснования 	= Ссылка;								
							КонецЕсли;
							ТаблицаСтрокНеВошедшихВПоступление.Удалить(СтрокаМассива);
						КонецЦикла;
					Иначе
						МассивСтрок_Из_ТаблицыЗапасов 	= СтруктураТаблиц.ТаблицаЗапасов.НайтиСтроки(Новый Структура("Ссылка", Поступление.Ссылка));
						МассивСтрок_Из_ТаблицыУслуг 	= СтруктураТаблиц.ТаблицаУслуг.НайтиСтроки(Новый Структура("Ссылка", Поступление.Ссылка));
						Если МассивУдаленныхСтрок_Услуги.Количество() = МассивСтрок_Из_ТаблицыУслуг.Количество() И
							МассивУдаленныхСтрок_Запасы.Количество() = МассивСтрок_Из_ТаблицыЗапасов.Количество() Тогда
							// Проставим флаг в истину если Наряд-Заказе удалены все строки
							ПометитьПоступлениеНаУдаление = Истина;
						КонецЕсли;	
					КонецЕсли;
					
					ПараметрыСеанса.ОбменДаннымиВключен = Истина;
					Если Поступление_Объект <> Неопределено Тогда						
						Если Поступление_Объект.ПометкаУдаления Тогда
							Если ПометитьПоступлениеНаУдаление Тогда 
								Поступление_Объект.Записать();
							Иначе
								Поступление_Объект.Записать();
								Поступление_Объект.УстановитьПометкуУдаления(Ложь);
								Поступление_Объект.Записать(РежимЗаписиДокумента.Проведение);
							КонецЕсли;	
						ИначеЕсли ПометитьПоступлениеНаУдаление Тогда
							Поступление_Объект.Записать();
							Поступление_Объект.УстановитьПометкуУдаления(Истина);
							Поступление_Объект.Записать();
						Иначе 
							Поступление_Объект.Записать(РежимЗаписиДокумента.Проведение);
						КонецЕсли;												
					ИначеЕсли Поступление_Объект = Неопределено И Перем_РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
						Поступление_Объект = Поступление.Ссылка.ПолучитьОбъект();
						Если Поступление_Объект.ПометкаУдаления Тогда 
							Поступление_Объект.УстановитьПометкуУдаления(Ложь);
						КонецЕсли;
						Поступление_Объект.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;
					ПараметрыСеанса.ОбменДаннымиВключен = Ложь;
				КонецЦикла;		
			КонецЕсли;
			
			// Создадим документы Поступления для оставшихся строк
			Таблица_Лабораторий = ТаблицаСтрокНеВошедшихВПоступление.Скопировать();
			Таблица_Лабораторий.Свернуть("Лаборатория");
			Для Каждого Строка_Лаборатория Из Таблица_Лабораторий Цикл 
				МассивСтрок = ТаблицаСтрокНеВошедшихВПоступление.НайтиСтроки(Новый Структура("Лаборатория", Строка_Лаборатория.Лаборатория));
				МассивКлючей = ВернутьМассивКлючей(МассивСтрок);
				Поступление_Объект = Документы.Поступление.СоздатьДокумент();
				Поступление_Объект.Заполнить(Новый Структура("Документ, Лаборатория, Фильтр, МассивКлючей, Договор", Ссылка, Строка_Лаборатория.Лаборатория, Истина, МассивКлючей, Договор));
				Поступление_Объект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЦикла;
			
		КонецЕсли;	
		
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

//
//
Функция ВернутьЗапасыИУслугиИзДокументовПоступления(НарядЗаказСсылка)
	              
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас) КАК ТипНоменклатуры,
	               |	ПоступлениеЗапасы.Ссылка,
	               |	ПоступлениеЗапасы.Номенклатура,
	               |	ПоступлениеЗапасы.Упаковка,
	               |	ПоступлениеЗапасы.Количество,
	               |	ПоступлениеЗапасы.КоличествоУпаковок,
	               |	ПоступлениеЗапасы.Цена,
	               |	ПоступлениеЗапасы.Сумма,
	               |	ПоступлениеЗапасы.Всего,
	               |	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
	               |	ПоступлениеЗапасы.ДокументОснования,
	               |	ПоступлениеЗапасы.КлючСтроки
	               |ИЗ
	               |	Документ.Поступление.Запасы КАК ПоступлениеЗапасы
	               |ГДЕ
	               |	ПоступлениеЗапасы.ДокументОснования = &НарядЗаказСсылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга),
	               |	ПоступлениеРасходы.Ссылка,
	               |	ПоступлениеРасходы.Номенклатура,
	               |	ПоступлениеРасходы.Упаковка,
	               |	ПоступлениеРасходы.Количество,
	               |	ПоступлениеРасходы.КоличествоУпаковок,
	               |	ПоступлениеРасходы.Цена,
	               |	ПоступлениеРасходы.Сумма,
	               |	ПоступлениеРасходы.Всего,
	               |	ПоступлениеРасходы.Сотрудник,
	               |	ПоступлениеРасходы.ДокументОснования,
	               |	ПоступлениеРасходы.КлючСтроки
	               |ИЗ
	               |	Документ.Поступление.Расходы КАК ПоступлениеРасходы
	               |ГДЕ
	               |	ПоступлениеРасходы.ДокументОснования = &НарядЗаказСсылка";
				   
	Запрос.УстановитьПараметр("НарядЗаказСсылка", НарядЗаказСсылка);
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	// Разделим таблицу на запасы и услуги
	ТаблицаЗапасов 	= ТаблицаРезультат.СкопироватьКолонки();
	ТаблицаУслуг 	= ТаблицаРезультат.СкопироватьКолонки();		
	Для Каждого СтрокаТаблицыРезультат Из ТаблицаРезультат Цикл 
		Если СтрокаТаблицыРезультат.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда 
			СтрокаТаблицы = ТаблицаЗапасов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаТаблицыРезультат);
		ИначеЕсли СтрокаТаблицыРезультат.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда 
			СтрокаТаблицы = ТаблицаУслуг.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаТаблицыРезультат);	
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаПоступление = ТаблицаРезультат.Скопировать();
	ТаблицаПоступление.Свернуть("Ссылка");
	МассивПоступлений = ТаблицаПоступление.ВыгрузитьКолонку("Ссылка");
	
	// Создадим структуру, состоящую, из полученных нами таблиц
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("МассивПоступлений",	МассивПоступлений);
	СтруктураТаблиц.Вставить("ТаблицаЗапасов",		ТаблицаЗапасов);
	СтруктураТаблиц.Вставить("ТаблицаУслуг",		ТаблицаУслуг);
	
	Возврат СтруктураТаблиц;			   
	
КонецФункции

//
//
Функция ВернутьСтрокиНарядЗаказаНеВошедшиеВПоступление(СтруктураТаблиц, ТаблицаВыполненныхЗаказов)
	
	ТаблицаСтрокНеВошедшихВПоступление = ТаблицаВыполненныхЗаказов.СкопироватьКолонки();
	Для Каждого ВыполненныйЗаказ Из ТаблицаВыполненныхЗаказов Цикл
		СтрокаТаблицыЗапасов = СтруктураТаблиц.ТаблицаЗапасов.Найти(ВыполненныйЗаказ.КлючСтроки, "КлючСтроки");
		СтрокаТаблицыУслуг	 = СтруктураТаблиц.ТаблицаУслуг.Найти(ВыполненныйЗаказ.КлючСтроки, "КлючСтроки");
		Если СтрокаТаблицыЗапасов = Неопределено И СтрокаТаблицыУслуг = Неопределено Тогда 
			НоваяСтрока = ТаблицаСтрокНеВошедшихВПоступление.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыполненныйЗаказ);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ТаблицаСтрокНеВошедшихВПоступление;
			
КонецФункции

//
//
Функция ВернутьМассивКлючей(МассивСтрок)
	
	МассивКлючей = Новый Массив;
	Для Каждого СтрокаМассива Из МассивСтрок Цикл 
		МассивКлючей.Добавить(СтрокаМассива.КлючСтроки);
	КонецЦикла;
	
	Возврат МассивКлючей;		
		
КонецФункции


#КонецОбласти

#Область ПОСТОБРАБОТКА_ДОКУМЕНТОВ_АВАНСА

//
//
Процедура ПостОбработкаДокументовАванса(РежимЗаписиНарядЗаказа = Неопределено, Отказ)	
	
	Если Проведен Тогда
		МассивПлановЛечения = Новый Массив;
		МассивПриемов = Новый Массив;
		// табличная часть Запасы
		Для Каждого СтрокаТЧ Из Запасы Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.ПланЛечения) Тогда 
				Если ТипЗнч(СтрокаТЧ.ПланЛечения) = Тип("ДокументСсылка.ПланЛечения") Тогда	
					Если МассивПлановЛечения.Найти(СтрокаТЧ.ПланЛечения) = Неопределено Тогда  
						МассивПлановЛечения.Добавить(СтрокаТЧ.ПланЛечения);
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТЧ.Прием) Тогда
					Если МассивПриемов.Найти(СтрокаТЧ.Прием) = Неопределено Тогда  
						МассивПриемов.Добавить(СтрокаТЧ.Прием);
					КонецЕсли;
			КонецЕсли;		
		КонецЦикла;
		// Дополним массивы	документами, содержавшимися в строках, которые мы удалили	
		Если ДополнительныеСвойства.Свойство("ТаблицаУдаленныхСтрок") Тогда 
			ТаблицаУдаляемыхСтрок = ДополнительныеСвойства.ТаблицаУдаленныхСтрок.Выгрузить();
			ТаблицаУдаляемыхСтрок.Свернуть("КлючСтроки, ДокументАванса");
			Если ДополнительныеСвойства.ТаблицаУдаленныхСтрок.Количество() > 0 Тогда			
				ТаблицаДокументовАванса = ДополнительныеСвойства.ТаблицаУдаленныхСтрок.Выгрузить(, "ДокументАванса");			
				ТаблицаДокументовАванса.Свернуть("ДокументАванса");
				
				Для Каждого ДокументАванса Из ТаблицаДокументовАванса Цикл 
					Если ТипЗнч(ДокументАванса.ДокументАванса) = Тип("ДокументСсылка.ПланЛечения") Тогда	
						Если МассивПлановЛечения.Найти(ДокументАванса.ДокументАванса) = Неопределено Тогда  
							МассивПлановЛечения.Добавить(ДокументАванса.ДокументАванса);
						КонецЕсли;
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;	
		Иначе 
			ТаблицаУдаляемыхСтрок = Неопределено;
		КонецЕсли;
		
		ЗаполнитьРеквизитПриемВПланеЛечения____И____ПроставитьСоответствующиеСтатусы(МассивПлановЛечения, ТаблицаУдаляемыхСтрок, РежимЗаписиНарядЗаказа);	
		ЗаполнитьРеквизитДокументАвансаВПрием(МассивПриемов, РежимЗаписиНарядЗаказа, Отказ);
		// ЭтотОбъект.Прочитать();
	КонецЕсли;

КонецПроцедуры

//
//
Процедура ЗаполнитьРеквизитПриемВПланеЛечения____И____ПроставитьСоответствующиеСтатусы(МассивПлановЛечения, ТаблицаУдаляемыхСтрок, РежимЗаписиНарядЗаказа)		
	               
	Для Каждого ПланЛечения Из МассивПлановЛечения Цикл 
		МассивНайденныхСтрок = Запасы.НайтиСтроки(Новый Структура("ПланЛечения", ПланЛечения));
		МассивУдаляемыхСтрок = ?(ТаблицаУдаляемыхСтрок = Неопределено, Новый Массив, ТаблицаУдаляемыхСтрок.НайтиСтроки(Новый Структура("ДокументАванса", ПланЛечения)));		
		Если МассивНайденныхСтрок.Количество() > 0 ИЛИ МассивУдаляемыхСтрок.Количество() > 0 Тогда
			Выполнен = Истина;
			ПланЛеченияОбъект = ПланЛечения.ПолучитьОбъект();
			
			Для Каждого УдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл 
				СтрокаТЧЛечение_План = ПланЛеченияОбъект.Лечение.Найти(УдаляемаяСтрока.КлючСтроки, "КлючСтроки");
				Если СтрокаТЧЛечение_План <> Неопределено Тогда				
					СтрокаТЧЛечение_План.Прием = Документы.НарядЗаказ.ПустаяСсылка();		
				КонецЕсли;
				Выполнен = Ложь;
			КонецЦикла;
			
			Для Каждого НайденнаяСтрока Из МассивНайденныхСтрок Цикл 
				СтрокаТЧЛечение_План = ПланЛеченияОбъект.Лечение.Найти(НайденнаяСтрока.КлючСтроки, "КлючСтроки");
				Если СтрокаТЧЛечение_План <> Неопределено Тогда				
					Если РежимЗаписиНарядЗаказа = РежимЗаписиДокумента.ОтменаПроведения Тогда
						СтрокаТЧЛечение_План.Прием = Документы.НарядЗаказ.ПустаяСсылка();
					Иначе
						// Пишем Ссылку
						СтрокаТЧЛечение_План.Прием = Ссылка;
					КонецЕсли;	
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(НайденнаяСтрока.Прием) Тогда 
					Выполнен = Ложь;						
				КонецЕсли;				
			КонецЦикла;
			
			// Дополнительная проверка ПланаЛечения
			Если Выполнен Тогда 
				Для Каждого СтрокаТч Из ПланЛечения.Лечение Цикл 
					Если ЗначениеЗаполнено(СтрокаТЧ.Прием) Тогда 
						Если ТипЗнч(СтрокаТЧ.Прием) = Тип("ДокументСсылка.НарядЗаказ") Тогда 
							Если СтрокаТЧ.Прием <> Ссылка Тогда 
								МассивНайденныхСтрокВ_НЗ = СтрокаТЧ.Прием.Запасы.НайтиСтроки(Новый Структура("ПланЛечения", ПланЛечения));
								Для Каждого НайденнаяСтрокаВ_НЗ Из МассивНайденныхСтрокВ_НЗ Цикл 
									Если НЕ ЗначениеЗаполнено(НайденнаяСтрокаВ_НЗ.Прием) Тогда 
										Выполнен = Ложь;
										Прервать;
									КонецЕсли;	
								КонецЦикла;							
							КонецЕсли;	
						КонецЕсли;		
					Иначе 
						Выполнен = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Если Выполнен Тогда 
				Если ПланЛечения.Статус <> Перечисления.СтатусыПланЛечения.Закрыт Тогда 
					ПланЛеченияОбъект.Статус = Перечисления.СтатусыПланЛечения.Закрыт;
				КонецЕсли;
			Иначе 	
				Если ПланЛечения.Статус = Перечисления.СтатусыПланЛечения.Закрыт Тогда 
					ПланЛеченияОбъект.Статус = Перечисления.СтатусыПланЛечения.Принят;
				КонецЕсли;	
			КонецЕсли;
			ПланЛеченияОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЦикла;
	
	#Область __________________________________________________СтарыйМеханизм____________________________________________________________

	
	
		// Для Каждого СтрокаЛ Из Запасы Цикл
		//	Если ЗначениеЗаполнено(СтрокаЛ.ПланЛечения) И ТипЗнч(СтрокаЛ.ПланЛечения) = Тип("ДокументСсылка.ПланЛечения") Тогда 
		//		Выполнен = Истина;
		//		ПланЛеченияОбъект = СтрокаЛ.ПланЛечения.ПолучитьОбъект();
		//		Для Каждого СтрокаТЧ Из ПланЛеченияОбъект.Лечение Цикл 
		//			Для Каждого СтрокаТЗ Из Запасы Цикл 
		//				Если СтрокаЛ.ПланЛечения 	= СтрокаТЗ.ПланЛечения	 		И
		//					СтрокаТЧ.Зуб 			= СтрокаТЗ.Зуб 					И 
		//					СтрокаТЧ.Номенклатура 	= СтрокаТЗ.Номенклатура 		И 
		//					СтрокаТЧ.Упаковка 		= СтрокаТЗ.Упаковка 			И 
		//					СтрокаТЧ.Количество	    = СтрокаТЗ.КоличествоУпаковок 	Тогда // И
		//					// СтрокаТЧ.Сумма 		= СтрокаТЗ.Сумма 				Тогда
		//					Если РежимЗаписиПриема = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		//						СтрокаТЧ.Прием         = Документы.НарядЗаказ.ПустаяСсылка();
		//						СтрокаТЧ.ПризнакВыбора = Истина;
		//					Иначе  
		//						СтрокаТЧ.Прием         = Ссылка;
		//						СтрокаТЧ.ПризнакВыбора = Ложь;
		//					КонецЕсли;
		//				КонецЕсли;	 
		//			КонецЦикла;
		//			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Прием) Тогда 
		//				Выполнен = Ложь;
		//			КонецЕсли;	
		//		КонецЦикла;
		//		Если Выполнен Тогда 
		//			ПланЛеченияОбъект.Статус = Перечисления.СтатусыПланЛечения.Закрыт;
		//		ИначеЕсли РежимЗаписиПриема = РежимЗаписиДокумента.ОтменаПроведения Тогда
		//			ПланЛеченияОбъект.Статус = Перечисления.СтатусыПланЛечения.Принят;
		//		КонецЕсли;	
		//		ПланЛеченияОбъект.Записать(РежимЗаписиДокумента.Запись);
		//	КонецЕсли;
		// КонецЦикла;
		
	#КонецОбласти
	
КонецПроцедуры

//
//
Процедура ЗаполнитьРеквизитДокументАвансаВПрием(МассивПриемов, РежимЗаписиНарядЗаказа, Отказ)		
	
	ПараметрыСеанса.ОбменДаннымиВключен = Истина;
	Для Каждого Прием Из МассивПриемов Цикл 
		МассивНайденныхСтрок = Запасы.НайтиСтроки(Новый Структура("Прием", Прием));
		Если МассивНайденныхСтрок.Количество() > 0 Тогда
			ПриемОбъект = Прием.ПолучитьОбъект();
			
			Для Каждого НайденнаяСтрока Из МассивНайденныхСтрок Цикл 
				СтрокаТЧЛечение_Прием = ПриемОбъект.Лечение.Найти(НайденнаяСтрока.КлючСтроки, "КлючСтроки");
				Если СтрокаТЧЛечение_Прием <> Неопределено Тогда				
					Если РежимЗаписиНарядЗаказа = РежимЗаписиДокумента.ОтменаПроведения Тогда
						СтрокаТЧЛечение_Прием.ДокументАванса = Документы.НарядЗаказ.ПустаяСсылка();
						НайденнаяСтрока.Прием = Документы.Прием.ПустаяСсылка();
					Иначе
						Если ЗначениеЗаполнено(СтрокаТЧЛечение_Прием.ДокументАванса) И НЕ СтрокаТЧЛечение_Прием.ДокументАванса = Ссылка Тогда 
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Наряд-заказ не может быть проведен, так как данные услуги уже проведенны в " + Строка(СтрокаТЧЛечение_Прием.ДокументАванса) + " ! ");
							Отказ = Истина;
							Возврат;
						Иначе						
							// Пишем Ссылку
							СтрокаТЧЛечение_Прием.ДокументАванса = Ссылка;
						КонецЕсли;
					КонецЕсли;	
				КонецЕсли;
				СтрокаТЧЗапасы_Прием = ПриемОбъект.Запасы.Найти(НайденнаяСтрока.КлючСтроки, "КлючСтроки");
				Если СтрокаТЧЗапасы_Прием <> Неопределено Тогда				
					Если РежимЗаписиНарядЗаказа = РежимЗаписиДокумента.ОтменаПроведения Тогда
						СтрокаТЧЗапасы_Прием.ДокументАванса = Документы.НарядЗаказ.ПустаяСсылка();
					Иначе
						Если ЗначениеЗаполнено(СтрокаТЧЗапасы_Прием.ДокументАванса) И НЕ СтрокаТЧЗапасы_Прием.ДокументАванса = Ссылка Тогда 
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Наряд-заказ не может быть проведен, так как данные услуги уже проведенны в " + Строка(СтрокаТЧЗапасы_Прием.ДокументАванса) + " ! ");
							Отказ = Истина;
							Возврат;
						Иначе						
							// Пишем Ссылку
							СтрокаТЧЗапасы_Прием.ДокументАванса = Ссылка;
						КонецЕсли;
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;
			ПриемОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЦикла;
	ПараметрыСеанса.ОбменДаннымиВключен = Ложь;	
	
КонецПроцедуры


#КонецОбласти

#КонецОбласти