
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

 	Список.Параметры.УстановитьЗначениеПараметра("Контрагент", ?(Параметры.Свойство("Контрагент"), Параметры.Контрагент, Справочники.Контрагенты.ПустаяСсылка()));
	Элементы.HTMLДокумент.Видимость = Ложь;
	Если ОбщегоНазначенияСтоматология.ПолучитьПризнакОказанияСтоматологическихУслуг() Тогда   
		
		ТипЗубнойФормулы = ?(Параметры.Свойство("Контрагент"), ?(ЗначениеЗаполнено(Параметры.Контрагент), Параметры.Контрагент.ТипЗубнойФормулы, 0), 0);		
		Элементы.HTMLДокумент.Видимость = Истина;
		HTML 					= ПолучитьОбщийМакет("HTMLДокумент").ПолучитьТекст();
		УстановитьЗубнуюФормулу();		
		SVGМассивСтатусовЗубов 	= "var status = ''";
		SVGМассивОбластей 		= "var ColorStatus = ''";
		Если ТипЗубнойФормулы = 1 Тогда
			ЗубнаяФормулаSVG = ПолучитьОбщийМакет("SVGЗаголовокДФ").ПолучитьТекст();
		Иначе
			ЗубнаяФормулаSVG = ПолучитьОбщийМакет("SVGЗаголовок").ПолучитьТекст();
		КонецЕсли;		
		ЗубнаяФормулаSVG = СтрЗаменить(ЗубнаяФормулаSVG, "var ReadOnly = false;", "var ReadOnly = true;");
	Иначе 
		Элементы.HTMLДокумент.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить тип зубной формулы
//
// Параметры:
//  Прием	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТипЗубнойФормулы(Прием) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗубнаяФормулаСрезПоследних.ТипЗубнойФормулы КАК ТипЗубнойФормулы
	|ИЗ
	|	РегистрСведений.ЗубнаяФормула.СрезПоследних(, Прием = &Прием) КАК ЗубнаяФормулаСрезПоследних"; 
	Запрос.УстановитьПараметр("Прием", Прием); 	
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда
		ТипЗубнойФормулы = Выборка.ТипЗубнойФормулы;  
	Иначе
		ТипЗубнойФормулы = Прием.Контрагент.ТипЗубнойФормулы;  
	КонецЕсли;
	Возврат ТипЗубнойФормулы;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик события "ПриАктивизацииСтроки"
//
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.HTMLДокумент.Видимость Тогда 
		Если Не Элемент.ТекущиеДанные = Неопределено Тогда
			СтруктураДанных = ЗагрузитьСтатусыЗубов(Элемент.ТекущиеДанные.Ссылка);
			СтатусыЗубов.Очистить();
			СостоянияЗубов.Очистить();
			Для Каждого СтрокаТЧ из СтруктураДанных.Статусы Цикл
				НоваяСтрока = СтатусыЗубов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			КонецЦикла;
			Для Каждого СтрокаТЧ из СтруктураДанных.Состояния Цикл
				НоваяСтрока = СостоянияЗубов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			КонецЦикла;
			ТипЗубнойФормулыВПриеме = ПолучитьТипЗубнойФормулы(Элемент.ТекущиеДанные.Ссылка); 
			Если ТипЗубнойФормулыВПриеме <> ТипЗубнойФормулы Тогда 
				ТипЗубнойФормулы = ТипЗубнойФормулыВПриеме; 
				ПолучитьМакетНаСервере();
			КонецЕсли;
			ОбновитьДокумент();
		Иначе 
			СтатусыЗубов.Очистить();
			СостоянияЗубов.Очистить(); 
			
			ЗначениеПараметраКД = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Контрагент"));	
			Если ЗначениеПараметраКД <> Неопределено И ЗначениеЗаполнено(ЗначениеПараметраКД.Значение) Тогда
				СтруктураДанных = ЗагрузитьСтатусыЗубов(Новый Структура("Контрагент, Дата",ЗначениеПараметраКД.Значение, ТекущаяДата()));
				Для Каждого СтрокаТЧ из СтруктураДанных.Статусы Цикл
					НоваяСтрока = СтатусыЗубов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				КонецЦикла;
				Для Каждого СтрокаТЧ из СтруктураДанных.Состояния Цикл
					НоваяСтрока = СостоянияЗубов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				КонецЦикла;	
			КонецЕсли;	
		
			ОбновитьДокумент();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, выполняет загрузку данных зубной формулы
//
Функция ЗагрузитьСтатусыЗубов(Прием)
	
	СостояниеЗубнойФормулы = Новый Структура();
	
	Если ЗначениеЗаполнено(Прием.Контрагент) Тогда
		Запрос = Новый запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                      |	ЗубнаяФормулаСрезПоследних.Зуб КАК Зуб,
		                      |	ВЫБОР
		                      |		КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Свой)
		                      |			ТОГДА ""0""
		                      |		ИНАЧЕ ВЫБОР
		                      |				КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Удален)
		                      |					ТОГДА ""1""
		                      |				ИНАЧЕ ВЫБОР
		                      |						КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Штифт)
		                      |							ТОГДА ""2""
		                      |						ИНАЧЕ ВЫБОР
		                      |								КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Абатмент)
		                      |									ТОГДА ""3""
		                      |								ИНАЧЕ ""4""
		                      |							КОНЕЦ
		                      |					КОНЕЦ
		                      |			КОНЕЦ
		                      |	КОНЕЦ КАК СтатусЗуба
		                      |ИЗ
		                      |	РегистрСведений.ЗубнаяФормула.СрезПоследних(&Дата, Контрагент = &Контрагент) КАК ЗубнаяФормулаСрезПоследних
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ЗубнаяФормулаСрезПоследних.Зуб,
		                      |	ВЫБОР
		                      |		КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Свой)
		                      |			ТОГДА ""0""
		                      |		ИНАЧЕ ВЫБОР
		                      |				КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Удален)
		                      |					ТОГДА ""1""
		                      |				ИНАЧЕ ВЫБОР
		                      |						КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Штифт)
		                      |							ТОГДА ""2""
		                      |						ИНАЧЕ ВЫБОР
		                      |								КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Абатмент)
		                      |									ТОГДА ""3""
		                      |								ИНАЧЕ ""4""
		                      |							КОНЕЦ
		                      |					КОНЕЦ
		                      |			КОНЕЦ
		                      |	КОНЕЦ");
		Запрос.УстановитьПараметр("Контрагент", Прием.Контрагент); 	
		Запрос.УстановитьПараметр("Дата",  Прием.Дата);
		Результат = Запрос.Выполнить().Выгрузить();		
		МассивСтатусов = Новый Массив;
		Для Каждого СтрокаТЧ из Результат Цикл
			МассивСтатусов.Добавить(Новый Структура("Зуб, СтатусЗуба", СтрокаТЧ.Зуб, СтрокаТЧ.СтатусЗуба));			
		КонецЦикла;
		СостояниеЗубнойФормулы.Вставить("Статусы", МассивСтатусов);
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                      |	ЗубнаяФормулаСрезПоследних.Зуб КАК Зуб,
		                      |	ЗубнаяФормулаСрезПоследних.СостояниеЗубнойФормулы КАК Состояние,
		                      |	ЗубнаяФормулаСрезПоследних.СостояниеЗубнойФормулы.Цвет КАК Цвет,
		                      |	ЗубнаяФормулаСрезПоследних.Область КАК Область,
		                      |	ВЫБОР
		                      |		КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Свой)
		                      |			ТОГДА ""0""
		                      |		ИНАЧЕ ВЫБОР
		                      |				КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Удален)
		                      |					ТОГДА ""1""
		                      |				ИНАЧЕ ВЫБОР
		                      |						КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Штифт)
		                      |							ТОГДА ""2""
		                      |						ИНАЧЕ ВЫБОР
		                      |								КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Абатмент)
		                      |									ТОГДА ""3""
		                      |								ИНАЧЕ ""4""
		                      |							КОНЕЦ
		                      |					КОНЕЦ
		                      |			КОНЕЦ
		                      |	КОНЕЦ КАК СтатусЗуба
		                      |ИЗ
		                      |	РегистрСведений.ЗубнаяФормула.СрезПоследних(&Дата, Контрагент = &Контрагент) КАК ЗубнаяФормулаСрезПоследних
		                      |ГДЕ
		                      |	НЕ ЗубнаяФормулаСрезПоследних.СостояниеЗубнойФормулы = ЗНАЧЕНИЕ(Справочник.СостояниеЗубнойФормулы.ПустаяСсылка)
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ЗубнаяФормулаСрезПоследних.Зуб,
		                      |	ЗубнаяФормулаСрезПоследних.СостояниеЗубнойФормулы,
		                      |	ЗубнаяФормулаСрезПоследних.СостояниеЗубнойФормулы.Цвет,
		                      |	ЗубнаяФормулаСрезПоследних.Область,
		                      |	ВЫБОР
		                      |		КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Свой)
		                      |			ТОГДА ""0""
		                      |		ИНАЧЕ ВЫБОР
		                      |				КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Удален)
		                      |					ТОГДА ""1""
		                      |				ИНАЧЕ ВЫБОР
		                      |						КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Штифт)
		                      |							ТОГДА ""2""
		                      |						ИНАЧЕ ВЫБОР
		                      |								КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Абатмент)
		                      |									ТОГДА ""3""
		                      |								ИНАЧЕ ""4""
		                      |							КОНЕЦ
		                      |					КОНЕЦ
		                      |			КОНЕЦ
		                      |	КОНЕЦ");
		Запрос.УстановитьПараметр("Контрагент", Прием.Контрагент);					
		Запрос.УстановитьПараметр("Дата", Прием.Дата);
        Результат = Запрос.Выполнить().Выгрузить();
		МассивСостояний = Новый Массив;
		Для Каждого СтрокаТЧ из Результат Цикл
			МассивСостояний.Добавить(Новый Структура("Зуб, Состояние, Цвет, Область,  СтатусЗуба", СтрокаТЧ.Зуб, СтрокаТЧ.Состояние, СтрокаТЧ.Цвет, СтрокаТЧ.Область, СтрокаТЧ.СтатусЗуба));			
		КонецЦикла;
		СостояниеЗубнойФормулы.Вставить("Состояния", МассивСостояний);

	КонецЕсли;
	
	Возврат СостояниеЗубнойФормулы;
	
КонецФункции

// Функция - Получить макет на сервере
// 
// Возвращаемое значение:
//   - 
//
&НаСервере
Функция ПолучитьМакетНаСервере()
	
	Если ТипЗубнойФормулы = 1 Тогда
		ЗубнаяФормулаSVG = ПолучитьОбщийМакет("SVGЗаголовокДФ").ПолучитьТекст();
	Иначе
		ЗубнаяФормулаSVG = ПолучитьОбщийМакет("SVGЗаголовок").ПолучитьТекст();
	КонецЕсли;		
	ЗубнаяФормулаSVG = СтрЗаменить(ЗубнаяФормулаSVG, "var ReadOnly = false;", "var ReadOnly = true;");
		
КонецФункции

&НаКлиенте
// Процедура, обновляет картинку подбора зубов
//
Процедура ОбновитьДокумент()
	
	ЗубнаяФормулаSVGBody = ФормированиеSVGКлиентСервер.СформироватьЗубнуюФормулу(СтатусыЗубов, ?(ТипЗубнойФормулы = 1, Истина, Ложь));
		
	мМассивСтатусовЗубов = "var  status = '";
	Для Каждого СтокаТЧ из СтатусыЗубов Цикл
		Если СтокаТЧ.СтатусЗуба <> "0" Тогда
			мМассивСтатусовЗубов = мМассивСтатусовЗубов + "Об" + СтокаТЧ.Зуб + "|"+СтокаТЧ.СтатусЗуба+"|";									
		КонецЕсли;
	КонецЦикла;		
	
	Если СтрДлина(мМассивСтатусовЗубов) > 15 Тогда
		мМассивСтатусовЗубов = Сред(мМассивСтатусовЗубов, 1, СтрДлина(мМассивСтатусовЗубов)-1);
	КонецЕсли;
	мМассивСтатусовЗубов = мМассивСтатусовЗубов + "';";
	
	мМассивОбластей = "var ColorStatus = '";
	Для Каждого СтрокаТЧ из СостоянияЗубов Цикл
		Если мМассивОбластей <> "var ColorStatus = '" Тогда
			мМассивОбластей = мМассивОбластей + "|Об" + Строка(СтрокаТЧ.Зуб) + СтрокаТЧ.Область + "|"+ СтрокаТЧ.Цвет + "|" + СтрокаТЧ.Состояние;				
		Иначе
			мМассивОбластей = мМассивОбластей + "Об" + Строка(СтрокаТЧ.Зуб) + СтрокаТЧ.Область + "|"+ СтрокаТЧ.Цвет + "|" + СтрокаТЧ.Состояние;
		КонецЕсли;
	КонецЦикла;
	мМассивОбластей 		= мМассивОбластей + "'";
	ЗубнаяФормулаSVG 		= СтрЗаменить(ЗубнаяФормулаSVG, SVGМассивОбластей, мМассивОбластей);
	SVGМассивОбластей 		= мМассивОбластей;

	
	ЗубнаяФормулаSVG 		= СтрЗаменить(ЗубнаяФормулаSVG, SVGМассивСтатусовЗубов, мМассивСтатусовЗубов);
	SVGМассивСтатусовЗубов 	= мМассивСтатусовЗубов;
	
	mSVG 					= СтрЗаменить(HTML, "SVGElement", ЗубнаяФормулаSVG + ЗубнаяФормулаSVGBody);
	HTMLДокумент 			= mSVG;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриЗакрытии"
//
Процедура ПриЗакрытии()
	
	Если Элементы.HTMLДокумент.Видимость Тогда
		#Если НЕ ВебКлиент Тогда
			
			Каталог = КаталогВременныхФайлов();
			МассивУдаляемыхФайлов = Новый Массив;
			МассивУдаляемыхФайлов.Добавить(Каталог+ИмяФайла+".svg");
			МассивУдаляемыхФайлов.Добавить(Каталог+ИмяФайла+"1.svg");
			МассивУдаляемыхФайлов.Добавить(Каталог+ИмяHTMLФайла+".html");
			МассивУдаляемыхФайлов.Добавить(Каталог+ИмяHTMLФайла+"1.html");
			
			Для Каждого СтрокаТЧ из МассивУдаляемыхФайлов Цикл
				Файл = Новый Файл(СтрокаТЧ);
				Если Файл.Существует() Тогда
					УдалитьФайлы(СтрокаТЧ);
				КонецЕсли;  	
			КонецЦикла;
			
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
// Процедура, обработчик события "Выбор" поля "Список".
//
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет получение макета ЗФ
//
Процедура УстановитьЗубнуюФормулу()
	
	Если ТипЗубнойФормулы = 1 Тогда
		mSvg  = ПолучитьОбщийМакет("SVGПодборДетский").ПолучитьТекст();
	Иначе
		mSvg  = ПолучитьОбщийМакет("SVGПодборВзрослый").ПолучитьТекст();
	КонецЕсли;
	mHTML = ПолучитьОбщийМакет("HTMLДокумент").ПолучитьТекст();
	Svg = СтрЗаменить(mHTML, "SVGElement", mSvg); 
	Svg = СтрЗаменить(Svg, "document.getElementById('Layer_1').setAttributeNS(null, 'height', window.innerHeight+'px')", "document.getElementById('Layer_1').setAttributeNS(null, 'height', (window.innerHeight - 15)+'px')");
	
КонецПроцедуры

#КонецОбласти



