
#Область ___________________________ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ___________________________

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущийПользователь 		= ПараметрыСеанса.ТекущийСотрудник;
	ТекущаяСтруктурнаяЕдиница 	= ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	ТекущаяВалюта				= Справочники.СтруктурныеЕдиницы.ВернутьРегиональныеНастройки(ТекущаяСтруктурнаяЕдиница).ВалютаУчета;
	
	// Инициализируем настройки при первом открытии формы
	Если ХранилищеСистемныхНастроек.Загрузить("Обработка.РабочийСтол.Форма.ФормаМониторПриемов/ТекущиеДанные") = Неопределено Тогда
		Настройки = Новый Соответствие;
		ХранилищеСистемныхНастроек.Сохранить("Обработка.РабочийСтол.Форма.ФормаМониторПриемов/ТекущиеДанные", ,Настройки);
	КонецЕсли;
	     
	УстановитьПривилегированныйРежим(Ложь);
	
	Элементы.СоздатьСделку.Видимость = ПравоДоступа("Добавление", Метаданные.Справочники.Сделки); 
	
КонецПроцедуры

&НаСервере
// Процедура - При загрузке данных из настроек на сервере
//
// Параметры:
//  Настройки	 - 	 - 
//
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	// Если ПараметрыСеанса.ТекущийПользователь.Служебный Тогда 
	//	УстановитьПривилегированныйРежим(Истина);
	// КонецЕсли;
	
	ИнициализироватьНастройкиМонитора();
	
	// Обновление (подсчет) общих сведений
	ОбновитьОбщиеСведения();
	
	// Генерация элементов этапов по каждому виду сделки
	ОтобразитьВсеВидыСделок();
	
	// Восстановим историю поиска
	СпискиВыбораКлиентСервер.Загрузить("Обработка.РабочийСтол.Форма.ФормаМониторПриемов/ИсторияПоиска", Элементы.ПоискКлиента.СписокВыбора, Истина);
	
	// Отключаем знакомство при первом запуске
	ПоказатьВидеоРоликПриПервомЗапуске = Ложь;
	
	ЭтаФорма.Заголовок = ?(ПоказатьВидеоРоликПриПервомЗапуске, Нстр("ru='Новая CRM-система. Что изменилось?';en='New CRM-system. What changed?'"), Нстр("ru='Монитор приемов';en='Monitor of sales'"));
	Элементы.ОсновнаяПанель.Видимость 								= НЕ ПоказатьВидеоРоликПриПервомЗапуске;
	Элементы.ГруппаПросмотраВидеоРоликаПриПервомЗапуске.Видимость 	= ПоказатьВидеоРоликПриПервомЗапуске;	
	Если ПоказатьВидеоРоликПриПервомЗапуске Тогда 
		ИнициироватьВидеоРоликПриПервомЗапуске();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - При открытии
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ПоказатьВидеоРоликПриПервомЗапуске Тогда
		Если АвтоматическоеАвтообновление Тогда 
			ПодключитьОбработчикОжидания("ОбновитьМониторПродаж", ПериодАвтообновления, Ложь);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка оповещения
//
// Параметры:
//  ИмяСобытия	 - 	 - 
//  Параметр	 - 	 - 
//  Источник	 - 	 - 
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОБНОВИТЬ_СВЕДЕНИЯ_ПО_СДЕЛКАМ" Тогда 
		ОбновитьВсеСведенияПоСделкам();
	ИначеЕсли ИмяСобытия = "ОБНОВИТЬ_ВИДЫ_И_ЭТАПЫ_СДЕЛОК" Тогда
		ОтобразитьВсеВидыСделок();		
	ИначеЕсли ИмяСобытия = "КЛЮЧЕВОЙ_ПОКАЗАТЕЛЬ_ЗАПИСАН" ИЛИ ИмяСобытия = "ОБНОВЛЕН_СОСТАВ_СОТРУДНИКОВ_КЛЮЧЕВОГО_ПОКАЗАТЕЛЯ" Тогда
		// ПоказатьОповещениеПользователя(Нстр("ru='Виджеты KPI обновлены';en='KPI widgets updated'"), , Нстр("ru='Применение настроек...';en='Application of settings...'"), БиблиотекаКартинок.ТерминалНастройки, СтатусОповещенияПользователя.Информация);
	ИначеЕсли ИмяСобытия = "ОповещениеОНовыхЗаявках" Тогда
		ОбновитьСведенияПоЗаявкам();
	КонецЕсли;
	
	// Работа с внешним оборудованием
	Если Источник = "ВнешнееОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "TracksData" Тогда
			
			ДанныеКарты = МенеджерОборудованияКлиент.ОбработатьДанныеМагнитнойКарты(Параметр);		   		   
			Если ЗначениеЗаполнено(ДанныеКарты.ТипДанных) Тогда
				ОбработатьДанныеСВнешнегоУстройстваСчитывания(ДанныеКарты);
			Иначе
				ПоказатьПредупреждение(, Нстр("ru='Данная карта/штрихкод не зарегистрированы в системе! Код: ';en='This card barcode is not registered in the system! Code:'") + ДанныеКарты.КодШифра);			   
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Источник = "ВнешнееОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			
			ДанныеШтрихКода = МенеджерОборудованияКлиент.ОбработатьДанныеШтрихКода(Параметр);	
			Если ЗначениеЗаполнено(ДанныеШтрихКода.ТипДанных) Тогда			
				ОбработатьДанныеСВнешнегоУстройстваСчитывания(ДанныеШтрихКода);		
			Иначе
				ПоказатьПредупреждение(, Нстр("ru='Данная карта/штрихкод не зарегистрированы в системе! Код: ';en='This card barcode is not registered in the system! Code:'") + ДанныеШтрихКода.КодШифра);			   
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
// Функция обрабатывает код карты, полученный от внешнего оборудования
//
Процедура ОбработатьДанныеСВнешнегоУстройстваСчитывания(СтруктураДанных) 
	
	Если СтруктураДанных.ТипДанных = "КАРТА_КЛИЕНТА" Тогда		
		
		СтандартнаяОбработка = Истина;
		
		КлиентОбработкаВыбора(Элементы.ПоискКлиента, СтруктураДанных.Клиент, СтандартнаяОбработка);
		Если СтандартнаяОбработка Тогда 			
			ЭтаФорма.ПоискКлиента = СтруктураДанных.Клиент;
		КонецЕсли; 	
		
	КонецЕсли;  
	
КонецПроцедуры 

&НаКлиенте
// Процедура - Перед закрытием
//
// Параметры:
//  Отказ				 - 	 - 
//  ЗавершениеРаботы	 - 	 - 
//  ТекстПредупреждения	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ДатаПросмотраИсторииСобытий = ТекущаяДата();
	
	Если ЗавершениеРаботы = Ложь Тогда
		ЗаписатьНастройкиПользователя();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ______________________ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ______________________

&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора"
//
Процедура КлиентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, ВыбранноеЗначение);
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		// Обновляем историю поиска
		СпискиВыбораКлиентСервер.ОбновитьСписокВыбора(Элементы.ПоискКлиента.СписокВыбора, ВыбранноеЗначение, 10, Истина);
		СпискиВыбораКлиентСервер.Сохранить("Обработка.РабочийСтол.Форма.ФормаМониторПриемов/ИсторияПоиска", Элементы.ПоискКлиента.СписокВыбора);
	КонецЕсли;
	Если ЗначениеЗаполнено(Элементы.ПоискКлиента.ТекстРедактирования) Тогда
		// Обновляем историю поиска
		СпискиВыбораКлиентСервер.ОбновитьСписокВыбора(СписокВводимыхЗначений, Элементы.ПоискКлиента.ТекстРедактирования, 10, Истина);
		СпискиВыбораКлиентСервер.Сохранить("Обработка.РабочийСтол.Форма.ФормаМониторПриемов/ИсторияВводаПоиска", СписокВводимыхЗначений);
	КонецЕсли;		
	ВыбранноеЗначение = Неопределено;
	ПоискКлиента = Неопределено;
	Элемент.ОбновитьТекстРедактирования(); 

КонецПроцедуры

&НаКлиенте
// Процедура - Поиск клиента авто подбор
//
// Параметры:
//  Элемент					 - 	 - 
//  Текст					 - 	 - 
//  ДанныеВыбора			 - 	 - 
//  ПараметрыПолученияДанных - 	 - 
//  Ожидание				 - 	 - 
//  СтандартнаяОбработка	 - 	 - 
//
Процедура ПоискКлиентаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ПараметрыПолученияДанных.Отбор.Вставить("ИскатьВЗавяках", Истина);	
	ПараметрыПолученияДанных.Отбор.Вставить("ИскатьВСделках", Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура - История событий при нажатии
//
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеСобытия		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ИсторияСобытийПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ПорцияСобытий = ПорцияСобытий + 10;
	ОбсужденияКлиент.ОбработатьНажатие(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Декорация настройки нажатие
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ДекорацияНастройкиНажатие(Элемент)

	Элементы.ГруппаНастройкиФормы.Показать();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Период автообновления при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ПериодАвтообновленияПриИзменении(Элемент)
	
	Элементы.ДекорацияСекунды.Заголовок = СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу("Секунд", ПериодАвтообновления); // подготовить к переводу
	ОтключитьОбработчикОжидания("ОбновитьМониторПродаж");
	ПодключитьОбработчикОжидания("ОбновитьМониторПродаж", ПериодАвтообновления, Ложь);
	
	ЗаписатьЗначениеНастройкиПользователяНаСервере("МониторПродаж_ПериодАвтообновления", ПериодАвтообновления);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Таблица сортировки показателей KPIПри изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ТаблицаСортировкиПоказателейKPIПриИзменении(Элемент)
	
	Счетчик = 0;
	Для Каждого СтрокаПоказательKPI Из ЭтаФорма[Элемент.Имя] Цикл
		Счетчик = Счетчик + 1;
		СтрокаПоказательKPI.Порядок = Счетчик;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Таблица сортировки показателей KPIВыбор
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбраннаяСтрока		 - 	 - 
//  Поле				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ТаблицаСортировкиПоказателейKPIВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда 
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ПоказательЭффективности) Тогда 
			Возврат;
			// ОткрытьФорму("Справочник.КлючевыеПоказателиЭффективности.ФормаОбъекта", Новый Структура("Ключ", Элемент.ТекущиеДанные.ПоказательЭффективности));
	    КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Декорация добавить KPIНажатие
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ДекорацияДобавитьKPIНажатие(Элемент)
	
	// ОткрытьФорму("Справочник.КлючевыеПоказателиЭффективности.ФормаОбъекта");
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#Область ___________________________ОБРАБОТЧИКИ_КОМАНД_ФОРМЫ____________________________

&НаКлиенте
// Процедура - Более не показывать мне эту кромолу
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура БолееНеПоказыватьМнеЭтуКромолу(Команда)
	
	ПоказатьВидеоРоликПриПервомЗапуске 								= Ложь;
	ЭтаФорма.Заголовок = ?(ПоказатьВидеоРоликПриПервомЗапуске, Нстр("ru='Новая CRM-система. Что изменилось?';en='New CRM-system. What changed?'"), Нстр("ru='Монитор приемов';en='Receive Monitor'"));		
	Элементы.ОсновнаяПанель.Видимость 								= Истина;
	Элементы.ГруппаПросмотраВидеоРоликаПриПервомЗапуске.Видимость 	= Ложь;
	СтраницаВидеоРолика = "";
	Если АвтоматическоеАвтообновление Тогда 
		ПодключитьОбработчикОжидания("ОбновитьМониторПродаж", ПериодАвтообновления, Ложь);
	КонецЕсли;
	
	ЗаписатьЗначениеНастройкиПользователяНаСервере("МониторПродаж_ПоказатьВидеоРоликПриПервомЗапуске", ПоказатьВидеоРоликПриПервомЗапуске);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Посмотрю позже
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПосмотрюПозже(Команда)
	
	ПоказатьВидеоРоликПриПервомЗапуске 								= Истина;
	ЭтаФорма.Заголовок												= Нстр("ru='Монитор приемов';en='Monitor of sales'");		
	Элементы.ОсновнаяПанель.Видимость 								= Истина;
	Элементы.ГруппаПросмотраВидеоРоликаПриПервомЗапуске.Видимость 	= Ложь;
	СтраницаВидеоРолика = "";
	Если АвтоматическоеАвтообновление Тогда 	
		ПодключитьОбработчикОжидания("ОбновитьМониторПродаж", ПериодАвтообновления, Ложь);
	КонецЕсли;
	
	ЗаписатьЗначениеНастройкиПользователяНаСервере("МониторПродаж_ПоказатьВидеоРоликПриПервомЗапуске", ПоказатьВидеоРоликПриПервомЗапуске);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Создать потенциального клиента
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СоздатьПотенциальногоКлиента(Команда)
	
	МассивВидовСделок = ПолучитьМассивВсехВидовСделокПоПродажамНаСервере(, ОтборСтруктурнаяЕдиница, ТекущийПользователь);
	СписокВариантовСоздания = Новый СписокЗначений;
	СписокВариантовСоздания.ЗагрузитьЗначения(МассивВидовСделок);
	
	Для Каждого ЭлементСписка Из СписокВариантовСоздания Цикл			
		ЭлементСписка.Представление = Нстр("ru = 'Потенциальный пациент + '; en = 'Potential patient + '") + ЭлементСписка.Значение; 
	КонецЦикла;
	
	Если СписокВариантовСоздания.Количество() = 0 Тогда 
		ОбработкаВыбораВариантаСоздания(Новый Структура("Значение", ПредопределенноеЗначение("Справочник.ВидыСделок.ПустаяСсылка")), Новый Структура("ЭтоСозданиеКлиента", Истина));
	Иначе 	
		СписокВариантовСоздания.Добавить(ПредопределенноеЗначение("Справочник.ВидыСделок.ПустаяСсылка"), Нстр("ru = 'Потенциальный пациент'; en = 'Potential patient'"));
		
		Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораВариантаСоздания", ЭтотОбъект, Новый Структура("ЭтоСозданиеКлиента", Истина));
		ПоказатьВыборИзМеню(Оповещение, СписокВариантовСоздания, Элементы.КомандаНовыйПЧК);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Создать сделку1
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ИнициализироватьФормуСозданияСделки(Команда)
	
	МассивВидовСделок = ПолучитьМассивВсехВидовСделокПоПродажамНаСервере(, ОтборСтруктурнаяЕдиница, ТекущийПользователь);
	СписокВариантовСоздания = Новый СписокЗначений;
	СписокВариантовСоздания.ЗагрузитьЗначения(МассивВидовСделок);
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораВариантаСоздания", ЭтотОбъект, Новый Структура("ЭтоСозданиеКлиента", Ложь));
	ПоказатьВыборИзМеню(Оповещение, СписокВариантовСоздания, Элементы.СоздатьСделку);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка выбора варианта создания
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ОбработкаВыбораВариантаСоздания(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(РезультатВыбора.Значение) Тогда
		ДанныеЗаполнения = Новый Структура();
		ДанныеЗаполнения.Вставить("ЗначенияЗаполнения", Новый Структура("СтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница));		
		ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", ДанныеЗаполнения, , Истина);
	ИначеЕсли ТипЗнч(РезультатВыбора.Значение) = Тип("СправочникСсылка.ВидыСделок") И ЗначениеЗаполнено(РезультатВыбора.Значение) Тогда
		Если ДополнительныеПараметры.ЭтоСозданиеКлиента Тогда 
			Сделка = СоздатьСделку(РезультатВыбора.Значение, ОтборСтруктурнаяЕдиница);
			
			ДанныеЗаполнения = Новый Структура();
			ДанныеЗаполнения.Вставить("Сделка", Сделка);
			ДанныеЗаполнения.Вставить("ЗначенияЗаполнения", Новый Структура("СтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница));					
			ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", ДанныеЗаполнения);
		Иначе
			ПерыйЭтап 	= ПолучитьСтартовыйЭтапВидаСделкиНаСервере(РезультатВыбора.Значение);
			ДанныеЗаполнения = Новый Структура();
			ДанныеЗаполнения.Вставить("ВидСделки"				, РезультатВыбора.Значение);
			ДанныеЗаполнения.Вставить("ЭтапСделки"				, ПерыйЭтап);
			ДанныеЗаполнения.Вставить("СформироватьНаименование", Истина);
			ДанныеЗаполнения.Вставить("СтруктурнаяЕдиница"		, ОтборСтруктурнаяЕдиница);					
			ОткрытьФорму("Справочник.Сделки.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения), , Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обновить монитор продаж вручную
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОбновитьМониторПродажВручную(Команда)

	ОбновитьМониторПродажНаСервере();
	ПоказатьОповещениеПользователя(Нстр("ru='Монитор приемов обновлен';en='Monitor of sales updated'"), , Нстр("ru='Применение настроек...';en='Application of settings...'"), БиблиотекаКартинок.Успех32, СтатусОповещенияПользователя.Информация);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Автоматическое автообновление при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура АвтоматическоеАвтообновлениеПриИзменении(Элемент)
	
	Если АвтоматическоеАвтообновление = Истина Тогда 
		ОтключитьОбработчикОжидания("ОбновитьМониторПродаж");
		ПодключитьОбработчикОжидания("ОбновитьМониторПродаж", ПериодАвтообновления, Ложь);
	Иначе 
		ОтключитьОбработчикОжидания("ОбновитьМониторПродаж");
	КонецЕсли;
	
	ЗаписатьЗначениеНастройкиПользователяНаСервере("МониторПродаж_АвтоматическоеАвтообновление", АвтоматическоеАвтообновление);
	
	ОбновитьТумблерАвтообновленияМонитораПродаж();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Включить автоматическое автообновление
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВключитьАвтоматическоеАвтообновление(Команда)

	АвтоматическоеАвтообновление = Истина;
	ОбновитьТумблерАвтообновленияМонитораПродаж();
	ОтключитьОбработчикОжидания("ОбновитьМониторПродаж");
	ПодключитьОбработчикОжидания("ОбновитьМониторПродаж", ПериодАвтообновления, Ложь);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выключить автоматическое автообновление
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВыключитьАвтоматическоеАвтообновление(Команда)
	
	АвтоматическоеАвтообновление = Ложь;
	ОбновитьТумблерАвтообновленияМонитораПродаж();
	ОтключитьОбработчикОжидания("ОбновитьМониторПродаж");
	
КонецПроцедуры

&НаКлиенте
// Процедура - Установить режим вывода KPI
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура УстановитьРежимВыводаKPI(Команда)
	
	Если СтрНайти(Команда.Имя, "KPI") = 0 Тогда 
		КоличествоКолонокДляВыводимыхВиджетов = Число(СтрСоединить(СтрРазделить(Команда.Имя, СтрСоединить(СтрРазделить(Команда.Имя, "0123456789")))));
		УстановитьСвойстваКнопкамТаблицыСортировкиKPI("ТаблицаСортировкиПоказателейВиджетовГруппаКнопок");
		ЗаписатьЗначениеНастройкиПользователяНаСервере("МониторПродаж_КоличествоКолонокДляВыводимыхВиджетов", КоличествоКолонокДляВыводимыхВиджетов);
	Иначе 	
		КоличествоКолонокДляВыводимыхВиджетовKPI = Число(СтрСоединить(СтрРазделить(Команда.Имя, СтрСоединить(СтрРазделить(Команда.Имя, "0123456789")))));
		УстановитьСвойстваКнопкамТаблицыСортировкиKPI("ТаблицаСортировкиПоказателейKPIГруппаКнопок");		
		ЗаписатьЗначениеНастройкиПользователяНаСервере("МониторПродаж_КоличествоКолонокДляВыводимыхВиджетовKPI", КоличествоКолонокДляВыводимыхВиджетовKPI);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Применить настройки формы
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПрименитьНастройкиФормы(Команда)
	
	Элементы.ГруппаНастройкиФормы.Скрыть();
	// ПоказатьОповещениеПользователя(Нстр("ru='Виджеты KPI обновлены';en='KPI widgets updated'"), , Нстр("ru='Применение настроек...';en='Application of settings...'"), БиблиотекаКартинок.ТерминалНастройки, СтатусОповещенияПользователя.Информация);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить массив всех видов сделок на сервере
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивВсехВидовСделокПоПродажамНаСервере(ДляОтбора = Ложь, ОтборСтруктурнаяЕдиница, ТекущийПользователь)
	
	Если ПравоДоступа("Добавление", Метаданные.Справочники.Сделки) ИЛИ ДляОтбора Тогда 
		Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда
			МассивДоступныхВидовСделок 	= Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(Перечисления.ТипыСделок.Продажа, ОтборСтруктурнаяЕдиница);
		Иначе
			МассивСтруктурныхЕдиниц 	= Справочники.Сотрудники.ПолучитьМестаРаботыСотрудника(ТекущийПользователь, "Массив");		
			МассивДоступныхВидовСделок 	= Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(Перечисления.ТипыСделок.Продажа, МассивСтруктурныхЕдиниц);
		КонецЕсли;	
		Возврат МассивДоступныхВидовСделок;
	Иначе 	
		Возврат Новый Массив;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить стартовый этап вида сделки на сервере
//
// Параметры:
//  ВидСделки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтартовыйЭтапВидаСделкиНаСервере(ВидСделки)
	
	Возврат Справочники.ВидыСделок.ПолучитьСтартовыйЭтапВидаСделки(ВидСделки);
	
КонецФункции

&НаКлиенте
// Процедура - Показать историю событий
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПоказатьИсториюСобытий(Команда)
	
	Элементы.ГруппаИсторияСобытий.Показать();
	
КонецПроцедуры

#Область ________________УСТАНОВКА_ОТБОРА_ПО_СТРУКТУРНОЙ_ЕДИНИЦЕ_________________

&НаКлиенте
// Процедура - Выбрать структурную единицу
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВыбратьСтруктурнуюЕдиницу(Команда)
	
	СписокСтруктурныхЕдиниц = ПолучитьМестаРаботыСотрудника(ТекущийПользователь, , ОтборСтруктурнаяЕдиница);	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборСтруктурнойЕдиницы", ЭтотОбъект);
	ЭтаФорма.ПоказатьВыборИзМеню(ОписаниеОповещения, СписокСтруктурныхЕдиниц, Элементы.ВыбратьСтруктурнуюЕдиницу);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор структурной единицы
//
// Параметры:
//  ВыбранныйЭлемент		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВыборСтруктурнойЕдиницы(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда 
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(ВыбранныйЭлемент.Значение) ИЛИ ВыбранныйЭлемент.Значение = ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ПустаяСсылка") Тогда
		ОтборСтруктурнаяЕдиница = ВыбранныйЭлемент.Значение;
		УстановитьОтборПоСтруктурнойЕдинице(, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область _____________________УСТАНОВКА_ОТБОРА_ПО_АДРЕСАТУ_______________________

&НаКлиенте
// Процедура - Установить тип адресата сведений
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура УстановитьТипАдресатаСведений(Команда)
	
	УстановитьТипАдресатаСведенийНаСервере(Команда.Имя, Истина);
	
КонецПроцедуры	

&НаСервере
// Процедура - Установить тип адресата сведений на сервере
//
// Параметры:
//  КомандаТипаАдресата	 - 	 - 
//  ОбновитьДанные		 - 	 - 
//
Процедура УстановитьТипАдресатаСведенийНаСервере(Знач КомандаТипаАдресата = Неопределено, ОбновитьДанные = Ложь, СброситьОтборы = Истина)
	
	ОтборСотрудники = Неопределено;
	Если КомандаТипаАдресата = Неопределено И ЗначениеЗаполнено(ОтборАдресатСведенийТип) Тогда 
		// При открытии формы на сервере
	Иначе
		Если КомандаТипаАдресата = "ПоказатьСведенияДляВсехСотрудников" ИЛИ КомандаТипаАдресата = "Все" Тогда 
			Если ОтборАдресатСведенийТип = "ИзСписка" И СброситьОтборы Тогда 
				ПриИзмененииОтборовСервер("ДекорацияУдалитьЗначение_ME_МенюОтборСотрудники");
			КонецЕсли;	
			ОтборАдресатСведенийТип = "Все";
		ИначеЕсли КомандаТипаАдресата = "ПоказатьСведенияМои" ИЛИ КомандаТипаАдресата = "Мои" Тогда	
			Если ОтборАдресатСведенийТип = "ИзСписка" И СброситьОтборы Тогда 
				ПриИзмененииОтборовСервер("ДекорацияУдалитьЗначение_ME_МенюОтборСотрудники");
			КонецЕсли;				
			ОтборАдресатСведенийТип = "Мои";
		Иначе
			Если КомандаТипаАдресата = "КомандаСкрыть_ME_ПодчиненноеМенюОтборСотрудники" ИЛИ КомандаТипаАдресата = "ДекорацияУдалитьЗначение_ME_МенюОтборСотрудники" ИЛИ КомандаТипаАдресата = "КомандаПрименить_ME_ПодчиненноеМенюОтборСотрудники" ИЛИ СтрНайти(КомандаТипаАдресата, "МенюОтборСотрудники_Тип_ПереключательСотрудник") > 0 Тогда 
				ОтборСотрудники = УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники");
				Если ОтборСотрудники.Количество() = 0 Тогда 
					ОтборАдресатСведенийТип = ?(ОтборАдресатСведенийТип <> "ИзСписка", ОтборАдресатСведенийТип, "Мои");
					ЭлементФормы        = УправлениеИнтерфейсамиСервер.ЭлементФормыПоИмениЭлемента(ЭтаФорма, "ДекорацияУдалитьЗначение_ME_МенюОтборСотрудники");
					ИмяЭлемента         = ЭлементФормы.Имя;
					ОбновитьПланировщик = УправлениеИнтерфейсамиСервер.ОбработчикЭлементаДинамическогоМенюПриНажатии(ЭтаФорма, ИмяЭлемента);
				Иначе 
					ОтборАдресатСведенийТип = "ИзСписка";
				КонецЕсли;
			ИначеЕсли СтрНайти(КомандаТипаАдресата, "МенюОтборСотрудники_Тип_ПереключательСотрудник") > 0 ИЛИ СтрНайти(КомандаТипаАдресата, "КомандаОтбор_ME_ПодчиненноеМенюОтборСотрудники_Тип") > 0 Тогда 

			Иначе 
				ОтборАдресатСведенийТип = "ИзСписка";
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;

	УстановитьСвойстваОтображенияЭлементовАдресата();

	Если ОбновитьДанные Тогда
		АктуализироватьТаблицуСортировкиПоказателейKPI(, , ОтборСотрудники);		
		ОбновитьОбщиеСведения();
		ОбновитьСведенияПоСделкам();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства отображения элементов адресата
//
Процедура УстановитьСвойстваОтображенияЭлементовАдресата()
	
	// Управление свойствами элементов-переключателей устанавливающих отбор по адресату
	Для Каждого ЭлементГруппаПереключатель Из Элементы.ГруппаМоиВсе.ПодчиненныеЭлементы Цикл 
		ЭлементГруппаПереключатель.ЦветФона = Новый Цвет();
		Если ТипЗнч(ЭлементГруппаПереключатель) = Тип("ГруппаФормы") Тогда 
			Для Каждого ЭлементКнопкаПереключатель Из ЭлементГруппаПереключатель.ПодчиненныеЭлементы Цикл
				ЭлементКнопкаПереключатель.ЦветТекста = Новый Цвет();
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
	
	Если ОтборАдресатСведенийТип = "Все" Тогда
		Элементы.ГруппаКнопкиПоказатьСведенияДляВсех.ЦветФона 	= Новый Цвет(242, 242, 242);		
		// Элементы.УстановитьПериодДень.ЦветТекста 				= Новый Цвет();
	ИначеЕсли ОтборАдресатСведенийТип = "Мои" Тогда
		Элементы.ГруппаКнопкиПоказатьСведенияМои.ЦветФона 		= Новый Цвет(242, 242, 242);		
		// Элементы.УстановитьПериодНеделя.ЦветТекста 			= Новый Цвет();
	ИначеЕсли ОтборАдресатСведенийТип = "ИзСписка" Тогда

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область _____________________УСТАНОВКА_ОТБОРА_ПО_ПЕРИОДУ________________________

&НаКлиенте
// Процедура - Установить период агрегирования информации
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура УстановитьПериодАгрегированияИнформации(Команда)

	ОбновитьДанные 							= Истина;
	СдвинутьВременнойИнтервал 				= Ложь;
	НаправлениеДвиженияВременногоИнтервала 	= "";
	
	Если Команда.Имя = "УстановитьПериодПроизвольный" Тогда	
		Диалог = Новый ДиалогРедактированияСтандартногоПериода();
		Диалог.Период = ОтборПериодЗначение;
		Диалог.Показать(Новый ОписаниеОповещения("ОтборПериодаПланированииПриИзменении", ЭтаФорма)); 
		ОбновитьДанные = Ложь;
	ИначеЕсли Команда.Имя = "ПериодВперед" Тогда
		СдвинутьВременнойИнтервал 				= Истина;
		НаправлениеДвиженияВременногоИнтервала 	= "Вперед";
	ИначеЕсли Команда.Имя = "ПериодНазад" Тогда
		СдвинутьВременнойИнтервал 				= Истина;
		НаправлениеДвиженияВременногоИнтервала 	= "Назад";		
	КонецЕсли;
	
	Если ОбновитьДанные Тогда 
		УстановитьПериодАгрегированияИнформацииНаСервере(Команда.Имя, СдвинутьВременнойИнтервал, НаправлениеДвиженияВременногоИнтервала, ОбновитьДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Отбор периода планировании при изменении
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ОтборПериодаПланированииПриИзменении(Результат, ДополнительныеПараметры) Экспорт 
	
	Если НЕ Результат = Неопределено Тогда
		ОтборПериодТип 		= ПредопределенноеЗначение("Перечисление.Периодичность.Час");
		ОтборПериодЗначение = Результат;
		УстановитьПериодАгрегированияИнформацииНаСервере(, , , Истина);	
	Иначе 
		УстановитьФокусЭлементаСервер();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить период агрегирования информации на сервере
//
// Параметры:
//  КомандаПериода							 - 	 - 
//  СдвинутьВременнойИнтервал				 - 	 - 
//  НаправлениеДвиженияВременногоИнтервала	 - 	 - 
//  ОбновитьДанные							 - 	 - 
//
Процедура УстановитьПериодАгрегированияИнформацииНаСервере(Знач КомандаПериода = Неопределено, Знач СдвинутьВременнойИнтервал = Ложь, Знач НаправлениеДвиженияВременногоИнтервала = "", ОбновитьДанные = Ложь)
	
	Если КомандаПериода = Неопределено И ЗначениеЗаполнено(ОтборПериодТип) Тогда 
		// При открытии формы на сервере
	Иначе 
		Если КомандаПериода = "УстановитьПериодДень" Тогда 
			ОтборПериодТип = Перечисления.Периодичность.День;
		ИначеЕсли КомандаПериода = "УстановитьПериодНеделя" Тогда	
			ОтборПериодТип = Перечисления.Периодичность.Неделя;
		ИначеЕсли КомандаПериода = "УстановитьПериодМесяц" Тогда	
			ОтборПериодТип = Перечисления.Периодичность.Месяц;
		ИначеЕсли КомандаПериода = "УстановитьПериодПроизвольный" Тогда	
			ОтборПериодТип = Перечисления.Периодичность.Час;			
		ИначеЕсли НЕ СдвинутьВременнойИнтервал Тогда  
			ОтборПериодТип = Перечисления.Периодичность.День;
		КонецЕсли;
	КонецЕсли;

	СформироватьЗначениеПериодаОтбора(СдвинутьВременнойИнтервал, НаправлениеДвиженияВременногоИнтервала);
	
	УстановитьСвойстваОтображенияЭлементовПериода();

	ОбновитьДинамическоеМенюОтборСотрудники();
	Если ОтборАдресатСведенийТип = "ИзСписка" Тогда
		ОтборСотрудники = УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники");
		ОтборСотрудники = ?(ЗначениеЗаполнено(ОтборСотрудники), ОтборСотрудники, Неопределено); // УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники", Истина));		
	ИначеЕсли ОтборАдресатСведенийТип = "Мои" Тогда 
		ОтборСотрудники = Новый Массив();
		ОтборСотрудники.Добавить(ТекущийПользователь);
	Иначе 
		ОтборСотрудники = Неопределено; // УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники", Истина);
	КонецЕсли;
	
	// АктуализироватьТаблицуСортировкиПоказателейKPI(, , ОтборСотрудники);
	
	Если ОбновитьДанные Тогда 
		ОбновитьОбщиеСведения(ОтборСотрудники);
		ОбновитьСведенияПоСделкам(ОтборСотрудники);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
// Процедура - Сформировать значение периода отбора
//
Процедура СформироватьЗначениеПериодаОтбора(СдвинутьВременнойИнтервал = Ложь, НаправлениеДвиженияВременногоИнтервала = "")
	
	Если СдвинутьВременнойИнтервал Тогда 
		Если НаправлениеДвиженияВременногоИнтервала = "Вперед" Тогда 
			Если ОтборПериодТип = Перечисления.Периодичность.День Тогда
				ОтборПериодЗначение.ДатаНачала 		= НачалоДня(ОтборПериодЗначение.ДатаНачала + 60*60*24);
				ОтборПериодЗначение.ДатаОкончания 	= КонецДня(ОтборПериодЗначение.ДатаНачала);
			ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Неделя Тогда
				ОтборПериодЗначение.ДатаНачала 		= НачалоНедели(ОтборПериодЗначение.ДатаНачала + 60*60*24*7);
				ОтборПериодЗначение.ДатаОкончания 	= КонецНедели(ОтборПериодЗначение.ДатаНачала);
			ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Месяц Тогда
				ОтборПериодЗначение.ДатаНачала 		= НачалоМесяца(ДобавитьМесяц(ОтборПериодЗначение.ДатаНачала, 1));
				ОтборПериодЗначение.ДатаОкончания 	= КонецМесяца(ОтборПериодЗначение.ДатаНачала);
			ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Час Тогда
				Если НачалоМесяца(ОтборПериодЗначение.ДатаНачала) = ОтборПериодЗначение.ДатаНачала И КонецМесяца(ОтборПериодЗначение.ДатаОкончания) = ОтборПериодЗначение.ДатаОкончания Тогда 
					ОтборПериодЗначение.ДатаНачала 		= НачалоМесяца(ДобавитьМесяц(ОтборПериодЗначение.ДатаНачала, 1));
					ОтборПериодЗначение.ДатаОкончания 	= КонецМесяца(ОтборПериодЗначение.ДатаНачала);
				Иначе 					
					ПериодВСекундах 					= ОтборПериодЗначение.ДатаОкончания - ОтборПериодЗначение.ДатаНачала;
					ОтборПериодЗначение.ДатаНачала 		= ОтборПериодЗначение.ДатаОкончания + 1;
					ОтборПериодЗначение.ДатаОкончания 	= ОтборПериодЗначение.ДатаНачала + ПериодВСекундах;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли НаправлениеДвиженияВременногоИнтервала = "Назад" Тогда	
			Если ОтборПериодТип = Перечисления.Периодичность.День Тогда
				ОтборПериодЗначение.ДатаНачала 		= НачалоДня(ОтборПериодЗначение.ДатаНачала - 60*60*24);
				ОтборПериодЗначение.ДатаОкончания 	= КонецДня(ОтборПериодЗначение.ДатаНачала);
			ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Неделя Тогда
				ОтборПериодЗначение.ДатаНачала 		= НачалоНедели(ОтборПериодЗначение.ДатаНачала - 60*60*24*7);
				ОтборПериодЗначение.ДатаОкончания 	= КонецНедели(ОтборПериодЗначение.ДатаНачала);
			ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Месяц Тогда 
				ОтборПериодЗначение.ДатаНачала 		= НачалоМесяца(ДобавитьМесяц(ОтборПериодЗначение.ДатаНачала, -1));
				ОтборПериодЗначение.ДатаОкончания 	= КонецМесяца(ОтборПериодЗначение.ДатаНачала);
			ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Час Тогда
				Если НачалоМесяца(ОтборПериодЗначение.ДатаНачала) = ОтборПериодЗначение.ДатаНачала И КонецМесяца(ОтборПериодЗначение.ДатаОкончания) = ОтборПериодЗначение.ДатаОкончания Тогда 
					ОтборПериодЗначение.ДатаНачала 		= НачалоМесяца(ДобавитьМесяц(ОтборПериодЗначение.ДатаНачала, -1));
					ОтборПериодЗначение.ДатаОкончания 	= КонецМесяца(ОтборПериодЗначение.ДатаНачала);
				Иначе 	
					ПериодВСекундах 					= ОтборПериодЗначение.ДатаОкончания - ОтборПериодЗначение.ДатаНачала;
					ОтборПериодЗначение.ДатаОкончания 	= ОтборПериодЗначение.ДатаНачала - 1;
					ОтборПериодЗначение.ДатаНачала 		= ОтборПериодЗначение.ДатаОкончания - ПериодВСекундах;				
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе 	
		Если ОтборПериодТип = Перечисления.Периодичность.День Тогда 
			ОтборПериодЗначение.Вариант 			= ВариантСтандартногоПериода.Сегодня; 
		ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Неделя Тогда
			ОтборПериодЗначение.Вариант 			= ВариантСтандартногоПериода.ЭтаНеделя;
		ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Месяц Тогда
			ОтборПериодЗначение.Вариант 			= ВариантСтандартногоПериода.ЭтотМесяц;
		ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Час Тогда
			// формируется в асинхронном вызове
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура - Установить видимость элементов
//
Процедура УстановитьСвойстваОтображенияЭлементовПериода()
	
	// Управление свойствами элементов-переключателей устанавливающих отбор по периоду
	Для Каждого ЭлементГруппаПереключательПериода Из Элементы.ГруппаОтборПоПериоду.ПодчиненныеЭлементы Цикл 
		ЭлементГруппаПереключательПериода.ЦветФона = Новый Цвет();
		Если ТипЗнч(ЭлементГруппаПереключательПериода) = Тип("ГруппаФормы") Тогда 
			Для Каждого ЭлементКнопкаПереключательПериода Из ЭлементГруппаПереключательПериода.ПодчиненныеЭлементы Цикл
				Если ТипЗнч(ЭлементКнопкаПереключательПериода) = Тип("КнопкаФормы") Тогда
					Если НЕ ЭлементКнопкаПереключательПериода.Имя = "УстановитьПериодПроизвольный" Тогда 
						ЭлементКнопкаПереключательПериода.ЦветТекста = Новый Цвет(127, 127, 127);
					КонецЕсли;	
				ИначеЕсли ТипЗнч(ЭлементКнопкаПереключательПериода) = Тип("ДекорацияФормы") Тогда
					ЭлементКнопкаПереключательПериода.ЦветФона = Новый Цвет(242, 242, 242);
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
	
	Если ОтборПериодТип = Перечисления.Периодичность.День Тогда
		// Элементы.ГруппаКнопкиУстановитьПериодДень.ЦветФона 			= Новый Цвет(242, 242, 242);		
		Элементы.УстановитьПериодДень.ЦветТекста 						= Новый Цвет();
		Элементы.ДекорацияУказательВыбранныеПериодДень.ЦветФона 		= Новый Цвет(100, 177, 230); 
	ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Неделя Тогда
		// Элементы.ГруппаКнопкиУстановитьПериодНеделя.ЦветФона 			= Новый Цвет(242, 242, 242);		
		Элементы.УстановитьПериодНеделя.ЦветТекста 						= Новый Цвет();
		Элементы.ДекорацияУказательВыбранныеПериодНеделя.ЦветФона 		= Новый Цвет(100, 177, 230); 
	ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Месяц Тогда
		// Элементы.ГруппаКнопкиУстановитьПериодМесяц.ЦветФона 			= Новый Цвет(242, 242, 242);		
		Элементы.УстановитьПериодМесяц.ЦветТекста 						= Новый Цвет();
		Элементы.ДекорацияУказательВыбранныеПериодМесяц.ЦветФона 		= Новый Цвет(100, 177, 230); 
	ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Час Тогда
		// Элементы.ГруппаКнопкиУстановитьПериодПроизвольный.ЦветФона 	= Новый Цвет(242, 242, 242);		
		Элементы.УстановитьПериодПроизвольный.ЦветТекста 				= Новый Цвет();
		Элементы.ДекорацияУказательВыбранныеПериодПроизвольный.ЦветФона = Новый Цвет(100, 177, 230); 
	КонецЕсли;
	
	// Формируем текст периода
	КомандаВыбораПроизвольногоПериода = ЭтаФорма.Команды.Найти("УстановитьПериодПроизвольный");
	Если ОтборПериодЗначение.ДатаНачала = Дата(1,1,1) И ОтборПериодЗначение.ДатаОкончания = Дата(1,1,1) Тогда 
		Элементы.УстановитьПериодПроизвольный.Заголовок = Нстр("ru='< не указан >';en='< not specified >'");
		Если НЕ КомандаВыбораПроизвольногоПериода = Неопределено Тогда 
			КомандаВыбораПроизвольногоПериода.Подсказка = Нстр("ru='Щелкните для выбора произвольного периода';en='Click for of choice arbitrary period'");
		КонецЕсли;	
	Иначе
		Если ОтборПериодТип = Перечисления.Периодичность.День Тогда 
			Элементы.УстановитьПериодПроизвольный.Заголовок = Формат(ОтборПериодЗначение.ДатаНачала, "ДФ='д ММММ гггг'");
		ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Неделя Тогда	
			Элементы.УстановитьПериодПроизвольный.Заголовок = Формат(ОтборПериодЗначение.ДатаНачала, "ДФ=d.MM.yy") + " - " + Формат(ОтборПериодЗначение.ДатаОкончания, "ДФ=dd.MM.yy");
		ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Месяц Тогда	
			Элементы.УстановитьПериодПроизвольный.Заголовок = Формат(ОтборПериодЗначение.ДатаНачала, "ДФ='ММММ гггг'");
		ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Час Тогда  // Произвольный
			Если ЗначениеЗаполнено(ОтборПериодЗначение.ДатаНачала) И ЗначениеЗаполнено(ОтборПериодЗначение.ДатаОкончания) Тогда
				Если НачалоДня(ОтборПериодЗначение.ДатаНачала) = ОтборПериодЗначение.ДатаНачала И КонецДня(ОтборПериодЗначение.ДатаОкончания) = ОтборПериодЗначение.ДатаОкончания И КонецДня(ОтборПериодЗначение.ДатаНачала) = ОтборПериодЗначение.ДатаОкончания Тогда 
					Элементы.УстановитьПериодПроизвольный.Заголовок = Формат(ОтборПериодЗначение.ДатаНачала, "ДФ='д ММММ гггг'");				
				ИначеЕсли НачалоМесяца(ОтборПериодЗначение.ДатаНачала) = ОтборПериодЗначение.ДатаНачала И КонецМесяца(ОтборПериодЗначение.ДатаОкончания) = ОтборПериодЗначение.ДатаОкончания И КонецМесяца(ОтборПериодЗначение.ДатаНачала) = ОтборПериодЗначение.ДатаОкончания Тогда 
					Элементы.УстановитьПериодПроизвольный.Заголовок = Формат(ОтборПериодЗначение.ДатаНачала, "ДФ='ММММ гггг'");
				Иначе 	
					Элементы.УстановитьПериодПроизвольный.Заголовок = Формат(ОтборПериодЗначение.ДатаНачала, "ДФ=d.MM.yy") + " - " + Формат(ОтборПериодЗначение.ДатаОкончания, "ДФ=dd.MM.yy");			
				КонецЕсли;	
			Иначе 
				Если НЕ ЗначениеЗаполнено(ОтборПериодЗначение.ДатаНачала) Тогда 
					Элементы.УстановитьПериодПроизвольный.Заголовок = Нстр("ru='по ';en='to '") + Формат(ОтборПериодЗначение.ДатаОкончания, "ДФ=d.MM.yy");			
				ИначеЕсли НЕ ЗначениеЗаполнено(ОтборПериодЗначение.ДатаОкончания) Тогда 	
					Элементы.УстановитьПериодПроизвольный.Заголовок = Нстр("ru='с ';en='from '") + Формат(ОтборПериодЗначение.ДатаНачала, "ДФ=d.MM.yy");			
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли; 	
		Если НЕ КомандаВыбораПроизвольногоПериода = Неопределено Тогда 
			КомандаВыбораПроизвольногоПериода.Подсказка = Элементы.УстановитьПериодПроизвольный.Заголовок;
		КонецЕсли;			
	КонецЕсли;	
	
	УстановитьФокусЭлементаСервер();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
// Процедура - Перейти заявки все
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПерейтиЗаявкиВсе(Команда)
	
	// Формируем параметры
	ПараметрыОтбора = Новый Структура();
	МассивСтруктурныхЕдиниц = Новый Массив;
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда 
		МассивСтруктурныхЕдиниц.Добавить(ОтборСтруктурнаяЕдиница);
	КонецЕсли;	
	ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);
	Если ОтборАдресатСведенийТип = "Мои" Тогда 
		ОтборСотрудники = Новый Массив;
		ОтборСотрудники.Добавить(ТекущийПользователь);
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);		
	ИначеЕсли ОтборАдресатСведенийТип = "Все" Тогда
		// ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(Истина);
		// ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);								
	ИначеЕсли ОтборАдресатСведенийТип = "ИзСписка" Тогда	
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(, Истина);
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);				
	КонецЕсли;
	ПараметрыОтбора.Вставить("ОчиститьВсеОтборы", Ложь);
	
	// Ищем открытую форму
	ПараметрыФормы = НайтиОткрытуюФорму("Справочник.Заявки.Форма.ФормаСписка", Нстр("ru = 'Заявки'; en = 'Applications'"));
	Если ПараметрыФормы.Открыта Тогда
		ПараметрыОтбора.Вставить("ОчиститьВсеОтборы", Истина);		
	    Оповестить("ОБНОВИТЬ_ОТБОРЫ_СПИСКА_ЗАЯВОК", Новый Структура("Отбор", ПараметрыОтбора), ЭтаФорма);
		ПараметрыФормы.ОкноПриложения.Активизировать();
		Возврат;
	КонецЕсли;
	
	// Форму не нашли - открываем
	ОткрытьФорму("Справочник.Заявки.ФормаСписка", Новый Структура("Отбор", ПараметрыОтбора), ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перейти заявки новые
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПерейтиЗаявкиНовые(Команда)
	
	// Формируем параметры
	МассивСтатусов = Новый Массив();
	МассивСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.НеОбработана"));
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("МассивСтатусов", МассивСтатусов);
	МассивСтруктурныхЕдиниц = Новый Массив;
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда 
		МассивСтруктурныхЕдиниц.Добавить(ОтборСтруктурнаяЕдиница);
	КонецЕсли;	
	ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);	
	Если ОтборАдресатСведенийТип = "Мои" Тогда 
		ОтборСотрудники = Новый Массив;
		ОтборСотрудники.Добавить(ТекущийПользователь);
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);		
	ИначеЕсли ОтборАдресатСведенийТип = "Все" Тогда
		// ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(Истина);
		// ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);								
	ИначеЕсли ОтборАдресатСведенийТип = "ИзСписка" Тогда	
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(, Истина);
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);				
	КонецЕсли;
	Если ПараметрыОтбора.Свойство("МассивМенеджеров") Тогда 
		Если ПараметрыОтбора.МассивМенеджеров.Найти(ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка")) = Неопределено Тогда 
			ПараметрыОтбора.МассивМенеджеров.Добавить(ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка"));
		КонецЕсли;
	КонецЕсли;
	ПараметрыОтбора.Вставить("ОчиститьВсеОтборы", Ложь);
	
	// Ищем открытую форму
	ПараметрыФормы = НайтиОткрытуюФорму("Справочник.Заявки.Форма.ФормаСписка", Нстр("ru = 'Заявки'; en = 'Applications'"));
	Если ПараметрыФормы.Открыта Тогда
		ПараметрыОтбора.Вставить("ОчиститьВсеОтборы", Истина);		
	    Оповестить("ОБНОВИТЬ_ОТБОРЫ_СПИСКА_ЗАЯВОК", Новый Структура("Отбор", ПараметрыОтбора), ЭтаФорма);
		ПараметрыФормы.ОкноПриложения.Активизировать();
		Возврат;
	КонецЕсли;
	
	// Форму не нашли - открываем
	ОткрытьФорму("Справочник.Заявки.ФормаСписка", Новый Структура("Отбор", ПараметрыОтбора), ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перейти заявки не обработанные
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПерейтиЗаявкиНеОбработанные(Команда)
	
	// Формируем параметры	
	МассивСтатусов = Новый Массив();
	МассивСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ПропущенныйЗвонок"));
	МассивСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ОтвеченныйДиалог"));
	МассивСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ОтвеченныйЗвонок"));
	МассивСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Перезвонить"));
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("МассивСтатусов", МассивСтатусов);
	МассивСтруктурныхЕдиниц = Новый Массив;
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда 
		МассивСтруктурныхЕдиниц.Добавить(ОтборСтруктурнаяЕдиница);
	КонецЕсли;	
	ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);	
	Если ОтборАдресатСведенийТип = "Мои" Тогда 
		ОтборСотрудники = Новый Массив;
		ОтборСотрудники.Добавить(ТекущийПользователь);
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);		
	ИначеЕсли ОтборАдресатСведенийТип = "Все" Тогда
		// ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(Истина);
		// ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);								
	ИначеЕсли ОтборАдресатСведенийТип = "ИзСписка" Тогда	
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(, Истина);
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);				
	КонецЕсли;
	ПараметрыОтбора.Вставить("ОчиститьВсеОтборы", Ложь);
	
	// Ищем открытую форму
	ПараметрыФормы = НайтиОткрытуюФорму("Справочник.Заявки.Форма.ФормаСписка", Нстр("ru = 'Заявки'; en = 'Applications'"));
	Если ПараметрыФормы.Открыта Тогда
		ПараметрыОтбора.Вставить("ОчиститьВсеОтборы", Истина);
	    Оповестить("ОБНОВИТЬ_ОТБОРЫ_СПИСКА_ЗАЯВОК", Новый Структура("Отбор", ПараметрыОтбора), ЭтаФорма);
		ПараметрыФормы.ОкноПриложения.Активизировать();
		Возврат;
	КонецЕсли;
	
	// Форму не нашли - открываем
	ОткрытьФорму("Справочник.Заявки.ФормаСписка", Новый Структура("Отбор", ПараметрыОтбора), ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перейти клиенты потенциальные все
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПерейтиКлиентыПотенциальныеВсе(Команда)
	
	// Формируем параметры		
	ПараметрыОтбора = Новый Структура();
	СписокСтатусовКлиентов = Новый СписокЗначений;
	СписокСтатусовКлиентов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКонтрагентов.Потенциальный"), , Истина);
	ПараметрыОтбора.Вставить("КоллекцияСтатусовКлиента", СписокСтатусовКлиентов);
	МассивСтруктурныхЕдиниц = Новый Массив;
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда 
		МассивСтруктурныхЕдиниц.Добавить(ОтборСтруктурнаяЕдиница);
	КонецЕсли;	
	ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);		
	Если ОтборАдресатСведенийТип = "Мои" Тогда 
		ОтборСотрудники = Новый Массив;
		ОтборСотрудники.Добавить(ТекущийПользователь);
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);		
	ИначеЕсли ОтборАдресатСведенийТип = "Все" Тогда
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(Истина);
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);								
	ИначеЕсли ОтборАдресатСведенийТип = "ИзСписка" Тогда	
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(, Истина);
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);				
	КонецЕсли;
	ПараметрыОтбора.Вставить("ОчиститьВсеОтборы"	, Ложь);
	
	// Ищем открытую форму
	ПараметрыФормы = НайтиОткрытуюФорму("Справочник.Контрагенты.Форма.ФормаСпискаПотенциальныеКлиенты", Нстр("ru = 'Потенциальные клиенты'; en = 'Potential clients'"));
	Если ПараметрыФормы.Открыта Тогда
		ПараметрыОтбора.Вставить("ОчиститьВсеОтборы", Истина);
	    Оповестить("ОБНОВИТЬ_ОТБОРЫ_СПИСКА_ПОТЕНЦИАЛЬНЫХ_КЛИЕНТОВ", Новый Структура("Отбор", ПараметрыОтбора), ЭтаФорма);
		ПараметрыФормы.ОкноПриложения.Активизировать();
		Возврат;
	КонецЕсли;
	
	// Форму не нашли - открываем
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаСпискаПотенциальныеКлиенты", Новый Структура("Отбор", ПараметрыОтбора));	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перейти клиенты ожидающие активности
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПерейтиКлиентыОжидающиеАктивности(Команда)
	
	// Формируем параметры		
	ПараметрыОтбора = Новый Структура();
	СписокСтатусовКлиентов = Новый СписокЗначений;
	СписокСтатусовКлиентов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКонтрагентов.Потенциальный"), , Истина);
	ПараметрыОтбора.Вставить("КоллекцияСтатусовКлиента", СписокСтатусовКлиентов);
	МассивСтруктурныхЕдиниц = Новый Массив;
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда 
		МассивСтруктурныхЕдиниц.Добавить(ОтборСтруктурнаяЕдиница);
	КонецЕсли;	
	ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);		
	СписокСтатусовНаличияЗадач = Новый СписокЗначений;
	СписокСтатусовНаличияЗадач.Добавить(Ложь, , Ложь);
	ПараметрыОтбора.Вставить("МассивСтатусовНаличияЗадач", СписокСтатусовНаличияЗадач);
	Если ОтборАдресатСведенийТип = "Мои" Тогда 
		ОтборСотрудники = Новый Массив;
		ОтборСотрудники.Добавить(ТекущийПользователь);
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);		
	ИначеЕсли ОтборАдресатСведенийТип = "Все" Тогда
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(Истина);
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);								
	ИначеЕсли ОтборАдресатСведенийТип = "ИзСписка" Тогда	
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(, Истина);
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);				
	КонецЕсли;
	ПараметрыОтбора.Вставить("ПериодПланирования"	, ОтборПериодЗначение);				
	ПараметрыОтбора.Вставить("ОчиститьВсеОтборы"	, Ложь);
	
	// Ищем открытую форму
	ПараметрыФормы = НайтиОткрытуюФорму("Справочник.Контрагенты.Форма.ФормаСпискаПотенциальныеКлиенты", Нстр("ru = 'Потенциальные клиенты'; en = 'Potential clients'"));
	Если ПараметрыФормы.Открыта Тогда
		ПараметрыОтбора.Вставить("ОчиститьВсеОтборы", Истина);
	    Оповестить("ОБНОВИТЬ_ОТБОРЫ_СПИСКА_ПОТЕНЦИАЛЬНЫХ_КЛИЕНТОВ", Новый Структура("Отбор", ПараметрыОтбора), ЭтаФорма);
		ПараметрыФормы.ОкноПриложения.Активизировать();
		Возврат;
	КонецЕсли;
	
	// Форму не нашли - открываем
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаСпискаПотенциальныеКлиенты", Новый Структура("Отбор", ПараметрыОтбора));	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перейти клиенты без запланированной активности
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПерейтиКлиентыБезЗадач(Команда)
	
	// Формируем параметры			
	ПараметрыОтбора = Новый Структура();
	СписокСтатусовКлиентов = Новый СписокЗначений;
	СписокСтатусовКлиентов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКонтрагентов.Потенциальный"), , Истина);
	ПараметрыОтбора.Вставить("КоллекцияСтатусовКлиента", СписокСтатусовКлиентов);
	МассивСтруктурныхЕдиниц = Новый Массив;
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда 
		МассивСтруктурныхЕдиниц.Добавить(ОтборСтруктурнаяЕдиница);
	КонецЕсли;	
	ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);		
	СписокСтатусовНаличияЗадач = Новый СписокЗначений;
	СписокСтатусовНаличияЗадач.Добавить(Ложь, , Истина);
	ПараметрыОтбора.Вставить("МассивСтатусовНаличияЗадач", СписокСтатусовНаличияЗадач);
	Если ОтборАдресатСведенийТип = "Мои" Тогда 
		ОтборСотрудники = Новый Массив;
		ОтборСотрудники.Добавить(ТекущийПользователь);
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);		
	ИначеЕсли ОтборАдресатСведенийТип = "Все" Тогда
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(Истина);
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);								
	ИначеЕсли ОтборАдресатСведенийТип = "ИзСписка" Тогда	
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(, Истина);
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);				
	КонецЕсли;
	ПараметрыОтбора.Вставить("ОчиститьВсеОтборы", Ложь);
	
	// Ищем открытую форму
	ПараметрыФормы = НайтиОткрытуюФорму("Справочник.Контрагенты.Форма.ФормаСпискаПотенциальныеКлиенты", Нстр("ru = 'Потенциальные клиенты'; en = 'Potential clients'"));
	Если ПараметрыФормы.Открыта Тогда
		ПараметрыОтбора.Вставить("ОчиститьВсеОтборы", Истина);
	    Оповестить("ОБНОВИТЬ_ОТБОРЫ_СПИСКА_ПОТЕНЦИАЛЬНЫХ_КЛИЕНТОВ", Новый Структура("Отбор", ПараметрыОтбора), ЭтаФорма);
		ПараметрыФормы.ОкноПриложения.Активизировать();
		Возврат;
	КонецЕсли;
	
	// Форму не нашли - открываем	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаСпискаПотенциальныеКлиенты", Новый Структура("Отбор", ПараметрыОтбора));	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перейти клиенты без сделок
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПерейтиКлиентыБезСделок(Команда)
	
	// Формируем параметры			
	ПараметрыОтбора = Новый Структура();
	СписокСтатусовКлиентов = Новый СписокЗначений;
	СписокСтатусовКлиентов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКонтрагентов.Потенциальный"), , Истина);
	ПараметрыОтбора.Вставить("КоллекцияСтатусовКлиента", СписокСтатусовКлиентов);
	МассивСтруктурныхЕдиниц = Новый Массив;
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда 
		МассивСтруктурныхЕдиниц.Добавить(ОтборСтруктурнаяЕдиница);
	КонецЕсли;	
	ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);		
	МассивСтатусовНаличияСделок = Новый Массив();
	МассивСтатусовНаличияСделок.Добавить("Нет сделок");
	ПараметрыОтбора.Вставить("МассивСтатусовНаличияСделок", МассивСтатусовНаличияСделок);				
	Если ОтборАдресатСведенийТип = "Мои" Тогда 
		ОтборСотрудники = Новый Массив;
		ОтборСотрудники.Добавить(ТекущийПользователь);
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);		
	ИначеЕсли ОтборАдресатСведенийТип = "Все" Тогда
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(Истина);
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);								
	ИначеЕсли ОтборАдресатСведенийТип = "ИзСписка" Тогда	
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(, Истина);
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);				
	КонецЕсли;
	ПараметрыОтбора.Вставить("ОчиститьВсеОтборы", Ложь);
	
	// Ищем открытую форму
	ПараметрыФормы = НайтиОткрытуюФорму("Справочник.Контрагенты.Форма.ФормаСпискаПотенциальныеКлиенты", Нстр("ru = 'Потенциальные клиенты'; en = 'Potential clients'"));
	Если ПараметрыФормы.Открыта Тогда
		ПараметрыОтбора.Вставить("ОчиститьВсеОтборы", Истина);
	    Оповестить("ОБНОВИТЬ_ОТБОРЫ_СПИСКА_ПОТЕНЦИАЛЬНЫХ_КЛИЕНТОВ", Новый Структура("Отбор", ПараметрыОтбора), ЭтаФорма);
		ПараметрыФормы.ОкноПриложения.Активизировать();
		Возврат;
	КонецЕсли;
	
	// Форму не нашли - открываем	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаСпискаПотенциальныеКлиенты", Новый Структура("Отбор", ПараметрыОтбора));	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перейти сделки все
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПерейтиСделкиВсе(Команда)
	
	// Формируем параметры		
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("МассивВидовСделок"	, ПолучитьМассивВсехВидовСделокПоПродажамНаСервере(, ОтборСтруктурнаяЕдиница, ТекущийПользователь));
	МассивСтруктурныхЕдиниц = Новый Массив;
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда 
		МассивСтруктурныхЕдиниц.Добавить(ОтборСтруктурнаяЕдиница);
	КонецЕсли;	
	ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);
	МассивСтатусовСделок = Новый Массив;
	МассивСтатусовСделок.Добавить("Нет");
	ПараметрыОтбора.Вставить("МассивСтатусовСделок", МассивСтатусовСделок);
	Если ОтборАдресатСведенийТип = "Мои" Тогда 
		ОтборСотрудники = Новый Массив;
		ОтборСотрудники.Добавить(ТекущийПользователь);
		ОтборСотрудники.Добавить(ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка"));
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);		
	ИначеЕсли ОтборАдресатСведенийТип = "Все" Тогда
		// ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(Истина);
		// ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);								
	ИначеЕсли ОтборАдресатСведенийТип = "ИзСписка" Тогда	
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников();
		Если ЗначениеЗаполнено(ОтборСотрудники) Тогда 												
			ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);				
		КонецЕсли;	
	КонецЕсли;
	ПараметрыОтбора.Вставить("ОчиститьВсеОтборы"		, Ложь);
	ПараметрыОтбора.Вставить("ОчиститьОтборПоСтатусу"	, Истина);
	
	// Ищем открытую форму
	ПараметрыФормы = НайтиОткрытуюФорму("Справочник.Сделки.Форма.ФормаСпискаНовая", Нстр("ru = 'Сделки'; en = 'Deals'"));
	Если ПараметрыФормы.Открыта Тогда
		ПараметрыОтбора.Вставить("ОчиститьВсеОтборы", Истина);
	    Оповестить("ОБНОВИТЬ_ОТБОРЫ_СПИСКА_СДЕЛОК", Новый Структура("Отбор", ПараметрыОтбора), ЭтаФорма);
		ПараметрыФормы.ОкноПриложения.Активизировать();
		Возврат;
	КонецЕсли;
	
	// Форму не нашли - открываем
	ОткрытьФорму("Справочник.Сделки.Форма.ФормаСпискаНовая", Новый Структура("Отбор", ПараметрыОтбора));		
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перейти сделки ожидающие активности
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПерейтиСделкиОжидающиеАктивности(Команда)

	// Формируем параметры		
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("МассивВидовСделок"	, ПолучитьМассивВсехВидовСделокПоПродажамНаСервере(, ОтборСтруктурнаяЕдиница, ТекущийПользователь));
	МассивСтруктурныхЕдиниц = Новый Массив;
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда 
		МассивСтруктурныхЕдиниц.Добавить(ОтборСтруктурнаяЕдиница);
	КонецЕсли;	
	ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);
	
	// МассивСтатусовНаличияПредварительнойЗаписи = Новый Массив();
	// МассивСтатусовНаличияПредварительнойЗаписи.Добавить("Нет назначенного приема");
	// ПараметрыОтбора.Вставить("МассивСтатусовНаличияПредварительнойЗаписи", МассивСтатусовНаличияПредварительнойЗаписи);
	
	СписокСтатусовНаличияПредварительнойЗаписи = Новый СписокЗначений;
	СписокСтатусовНаличияПредварительнойЗаписи.Добавить(Ложь, , Ложь);
	ПараметрыОтбора.Вставить("СписокСтатусовНаличияПредварительнойЗаписи", СписокСтатусовНаличияПредварительнойЗаписи);
	
	МассивСтатусовСделок = Новый Массив;
	МассивСтатусовСделок.Добавить("Нет");
	ПараметрыОтбора.Вставить("МассивСтатусовСделок", МассивСтатусовСделок);	
	Если ОтборАдресатСведенийТип = "Мои" Тогда 
		ОтборСотрудники = Новый Массив;
		ОтборСотрудники.Добавить(ТекущийПользователь);
		ОтборСотрудники.Добавить(ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка"));		
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);		
	ИначеЕсли ОтборАдресатСведенийТип = "Все" Тогда
		// ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(Истина);
		// ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);								
	ИначеЕсли ОтборАдресатСведенийТип = "ИзСписка" Тогда	
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников();
		Если ЗначениеЗаполнено(ОтборСотрудники) Тогда 														
			ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);
		КонецЕсли;	
	КонецЕсли;
	ПараметрыОтбора.Вставить("ПериодПланирования"		, ОтборПериодЗначение);					
	ПараметрыОтбора.Вставить("ОчиститьВсеОтборы"		, Ложь);
	ПараметрыОтбора.Вставить("ОчиститьОтборПоСтатусу"	, Истина);
	
	// Ищем открытую форму
	ПараметрыФормы = НайтиОткрытуюФорму("Справочник.Сделки.Форма.ФормаСпискаНовая", Нстр("ru = 'Сделки'; en = 'Deals'"));
	Если ПараметрыФормы.Открыта Тогда
		ПараметрыОтбора.Вставить("ОчиститьВсеОтборы", Истина);
	    Оповестить("ОБНОВИТЬ_ОТБОРЫ_СПИСКА_СДЕЛОК", Новый Структура("Отбор", ПараметрыОтбора), ЭтаФорма);
		ПараметрыФормы.ОкноПриложения.Активизировать();
		Возврат;
	КонецЕсли;
	
	// Форму не нашли - открываем
	ОткрытьФорму("Справочник.Сделки.Форма.ФормаСпискаНовая", Новый Структура("Отбор", ПараметрыОтбора));		
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перейти сделки без задач
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПерейтиСделкиБезЗадач(Команда)
	
	// Формируем параметры			
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("МассивВидовСделок"	, ПолучитьМассивВсехВидовСделокПоПродажамНаСервере(, ОтборСтруктурнаяЕдиница, ТекущийПользователь));
	МассивСтруктурныхЕдиниц = Новый Массив;
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда 
		МассивСтруктурныхЕдиниц.Добавить(ОтборСтруктурнаяЕдиница);
	КонецЕсли;	
	ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);
	МассивСтатусовНаличияПредварительнойЗаписи = Новый Массив();
	МассивСтатусовНаличияПредварительнойЗаписи.Добавить("Нет назначенного приема");
	ПараметрыОтбора.Вставить("МассивСтатусовНаличияПредварительнойЗаписи", МассивСтатусовНаличияПредварительнойЗаписи);	
	МассивСтатусовНаличияЗадач = Новый Массив();
	МассивСтатусовНаличияЗадач.Добавить("Нет задач");
	ПараметрыОтбора.Вставить("МассивСтатусовНаличияЗадач", МассивСтатусовНаличияЗадач);
	МассивСтатусовСделок = Новый Массив;
	МассивСтатусовСделок.Добавить("Нет");
	ПараметрыОтбора.Вставить("МассивСтатусовСделок", МассивСтатусовСделок);		
	Если ОтборАдресатСведенийТип = "Мои" Тогда 
		ОтборСотрудники = Новый Массив;
		ОтборСотрудники.Добавить(ТекущийПользователь);
		ОтборСотрудники.Добавить(ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка"));		
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);		
	ИначеЕсли ОтборАдресатСведенийТип = "Все" Тогда
		// ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(Истина);
		// ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);								
	ИначеЕсли ОтборАдресатСведенийТип = "ИзСписка" Тогда	
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников();
		Если ЗначениеЗаполнено(ОтборСотрудники) Тогда 														
			ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);
		КонецЕсли;	
	КонецЕсли;
	ПараметрыОтбора.Вставить("ОчиститьВсеОтборы"		, Ложь);
	ПараметрыОтбора.Вставить("ОчиститьОтборПоСтатусу"	, Истина);
	
	// Ищем открытую форму
	ПараметрыФормы = НайтиОткрытуюФорму("Справочник.Сделки.Форма.ФормаСпискаНовая", Нстр("ru = 'Сделки'; en = 'Deals'"));
	Если ПараметрыФормы.Открыта Тогда
		ПараметрыОтбора.Вставить("ОчиститьВсеОтборы", Истина);
	    Оповестить("ОБНОВИТЬ_ОТБОРЫ_СПИСКА_СДЕЛОК", Новый Структура("Отбор", ПараметрыОтбора), ЭтаФорма);
		ПараметрыФормы.ОкноПриложения.Активизировать();
		Возврат;
	КонецЕсли;
	
	// Форму не нашли - открываем
	ОткрытьФорму("Справочник.Сделки.Форма.ФормаСпискаНовая", Новый Структура("Отбор", ПараметрыОтбора));		
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перейти задачи все
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПерейтиЗадачиВсе(Команда)
	
	// Формируем параметры			
	ПараметрыОтбора = Новый Структура();
	МассивСтатусовЗадач = Новый Массив();
	МассивСтатусовЗадач.Добавить("Не выполнена");
	ПараметрыОтбора.Вставить("МассивСтатусовЗадач", МассивСтатусовЗадач);
	МассивВидовСделок = ПолучитьМассивВсехВидовСделокПоПродажамНаСервере(Истина, ОтборСтруктурнаяЕдиница, ТекущийПользователь);
	МассивВидовСделок.Добавить(ПредопределенноеЗначение("Справочник.ВидыСделок.ПустаяСсылка"));	
	ПараметрыОтбора.Вставить("МассивВидовСделок", МассивВидовСделок);
	МассивСтруктурныхЕдиниц = Новый Массив;
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда 
		МассивСтруктурныхЕдиниц.Добавить(ОтборСтруктурнаяЕдиница);
	КонецЕсли;	
	ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);	
	Если ОтборАдресатСведенийТип = "Мои" Тогда 
		ОтборСотрудники = Новый Массив;
		ОтборСотрудники.Добавить(ТекущийПользователь);
		ПараметрыОтбора.Вставить("МассивИсполнителей"	, ОтборСотрудники);		
	ИначеЕсли ОтборАдресатСведенийТип = "Все" Тогда
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(Истина);
		ПараметрыОтбора.Вставить("МассивИсполнителей"	, ОтборСотрудники);								
	ИначеЕсли ОтборАдресатСведенийТип = "ИзСписка" Тогда	
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(, Истина);
		ПараметрыОтбора.Вставить("МассивИсполнителей"	, ОтборСотрудники);				
	КонецЕсли;
	ПараметрыОтбора.Вставить("ОтборПериодТип"		, ОтборПериодТип);						
	ПараметрыОтбора.Вставить("ОтборПериодЗначение"	, ОтборПериодЗначение);					
	ПараметрыОтбора.Вставить("ОчиститьВсеОтборы"	, Ложь);
	
	// Ищем открытую форму
	ПараметрыФормы = НайтиОткрытуюФорму("Задача.Взаимодействие.Форма.ФормаСпискаНовая", Нстр("ru = 'Задачи'; en = 'Tasks'"));
	Если ПараметрыФормы.Открыта Тогда
		ПараметрыОтбора.Вставить("ОчиститьВсеОтборы", Истина);
	    Оповестить("ОБНОВИТЬ_ОТБОРЫ_СПИСКА_ВЗАИМОДЕЙСТВИЙ", Новый Структура("Отбор", ПараметрыОтбора), ЭтаФорма);
		ПараметрыФормы.ОкноПриложения.Активизировать();
		Возврат;
	КонецЕсли;
	
	// Форму не нашли - открываем	
	ОткрытьФорму("Задача.Взаимодействие.Форма.ФормаСпискаНовая", Новый Структура("Отбор", ПараметрыОтбора));	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перейти задачи новые
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПерейтиЗадачиНовые(Команда)
	
	// Формируем параметры			
	ПараметрыОтбора = Новый Структура();
	МассивСтатусовЗадач = Новый Массив();
	МассивСтатусовЗадач.Добавить("Не выполнена");
	ПараметрыОтбора.Вставить("МассивСтатусовЗадач", МассивСтатусовЗадач);
	МассивВидовСделок = ПолучитьМассивВсехВидовСделокПоПродажамНаСервере(Истина, ОтборСтруктурнаяЕдиница, ТекущийПользователь);
	МассивВидовСделок.Добавить(ПредопределенноеЗначение("Справочник.ВидыСделок.ПустаяСсылка"));	
	ПараметрыОтбора.Вставить("МассивВидовСделок", МассивВидовСделок);
	МассивСтруктурныхЕдиниц = Новый Массив;
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда 
		МассивСтруктурныхЕдиниц.Добавить(ОтборСтруктурнаяЕдиница);
	КонецЕсли;	
	ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);	
	Если ОтборАдресатСведенийТип = "Мои" Тогда 
		ОтборСотрудники = Новый Массив;
		ОтборСотрудники.Добавить(ТекущийПользователь);
		ПараметрыОтбора.Вставить("МассивИсполнителей"	, ОтборСотрудники);		
	ИначеЕсли ОтборАдресатСведенийТип = "Все" Тогда
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(Истина);
		ПараметрыОтбора.Вставить("МассивИсполнителей"	, ОтборСотрудники);								
	ИначеЕсли ОтборАдресатСведенийТип = "ИзСписка" Тогда	
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(, Истина);
		ПараметрыОтбора.Вставить("МассивИсполнителей"	, ОтборСотрудники);				
	КонецЕсли;
	ПараметрыОтбора.Вставить("ОтборПериодТип"		, ОтборПериодТип);						
	ПараметрыОтбора.Вставить("ОтборПериодЗначение"	, ОтборПериодЗначение);					
	ПараметрыОтбора.Вставить("ОчиститьВсеОтборы"	, Ложь);
	
	// Ищем открытую форму
	ПараметрыФормы = НайтиОткрытуюФорму("Задача.Взаимодействие.Форма.ФормаСпискаНовая", Нстр("ru = 'Задачи'; en = 'Tasks'"));
	Если ПараметрыФормы.Открыта Тогда
		ПараметрыОтбора.Вставить("ОчиститьВсеОтборы", Истина);
	    Оповестить("ОБНОВИТЬ_ОТБОРЫ_СПИСКА_ВЗАИМОДЕЙСТВИЙ", Новый Структура("Отбор", ПараметрыОтбора), ЭтаФорма);
		ПараметрыФормы.ОкноПриложения.Активизировать();
		Возврат;
	КонецЕсли;
	
	// Форму не нашли - открываем	
	ОткрытьФорму("Задача.Взаимодействие.Форма.ФормаСпискаНовая", Новый Структура("Отбор", ПараметрыОтбора));	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перейти задачи просроченные
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПерейтиЗадачиПросроченные(Команда)
	
	// Формируем параметры			
	ПараметрыОтбора = Новый Структура();
	МассивСтатусовЗадач = Новый Массив();
	МассивСтатусовЗадач.Добавить("Просрочена");
	ПараметрыОтбора.Вставить("МассивСтатусовЗадач", МассивСтатусовЗадач);
	МассивВидовСделок = ПолучитьМассивВсехВидовСделокПоПродажамНаСервере(Истина, ОтборСтруктурнаяЕдиница, ТекущийПользователь);
	МассивВидовСделок.Добавить(ПредопределенноеЗначение("Справочник.ВидыСделок.ПустаяСсылка"));	
	ПараметрыОтбора.Вставить("МассивВидовСделок", МассивВидовСделок);
	МассивСтруктурныхЕдиниц = Новый Массив;
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда 
		МассивСтруктурныхЕдиниц.Добавить(ОтборСтруктурнаяЕдиница);
	КонецЕсли;	
	ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);	
	Если ОтборАдресатСведенийТип = "Мои" Тогда 
		ОтборСотрудники = Новый Массив;
		ОтборСотрудники.Добавить(ТекущийПользователь);
		ПараметрыОтбора.Вставить("МассивИсполнителей"	, ОтборСотрудники);		
	ИначеЕсли ОтборАдресатСведенийТип = "Все" Тогда
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(Истина);
		ПараметрыОтбора.Вставить("МассивИсполнителей"	, ОтборСотрудники);								
	ИначеЕсли ОтборАдресатСведенийТип = "ИзСписка" Тогда	
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(, Истина);
		ПараметрыОтбора.Вставить("МассивИсполнителей"	, ОтборСотрудники);				
	КонецЕсли;
	ПараметрыОтбора.Вставить("ОчиститьВсеОтборы"	, Ложь);
	
	// Ищем открытую форму
	ПараметрыФормы = НайтиОткрытуюФорму("Задача.Взаимодействие.Форма.ФормаСпискаНовая", Нстр("ru = 'Задачи'; en = 'Tasks'"));
	Если ПараметрыФормы.Открыта Тогда
		ПараметрыОтбора.Вставить("ОчиститьВсеОтборы", Истина);
	    Оповестить("ОБНОВИТЬ_ОТБОРЫ_СПИСКА_ВЗАИМОДЕЙСТВИЙ", Новый Структура("Отбор", ПараметрыОтбора), ЭтаФорма);
		ПараметрыФормы.ОкноПриложения.Активизировать();
		Возврат;
	КонецЕсли;
	
	// Форму не нашли - открываем		
	ОткрытьФорму("Задача.Взаимодействие.Форма.ФормаСпискаНовая", Новый Структура("Отбор", ПараметрыОтбора));	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый перейти сделки этап выполнить команду
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Подключаемый_ПерейтиСделкиЭтапКоличество_ВыполнитьКоманду(Команда) Экспорт

	ПозицияПричины = СтрНайти(Команда.Имя, "_ОтказПричина_");
	Если ПозицияПричины = 0 Тогда
		ИндексПричины 		= Неопределено;
		ИндексСтроки		= Число(Сред(Команда.Имя, СтрДлина("ПерейтиСделкиЭтапКоличество_Индекс_") + 1));
	Иначе 
		ИндексПричины 		= Число(Сред(Команда.Имя, (ПозицияПричины + СтрДлина("_ОтказПричина_")))); 
		ИндексСтроки 		= Число(Сред(Лев(Команда.Имя, СтрДлина(Лев(Команда.Имя, ПозицияПричины - 1))), СтрДлина("ПерейтиСделкиЭтапКоличество_Индекс_") + 1));
	КонецЕсли;	
	ДанныеЭлемента 			= ТаблицаВидовСделок[ИндексСтроки];
	
	Если ДанныеЭлемента = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	// Формируем параметры			
	ПараметрыОтбора = Новый Структура();
	МассивВидовСделок = Новый Массив;
	МассивВидовСделок.Добавить(ДанныеЭлемента.ВидСделки);
	ПараметрыОтбора.Вставить("МассивВидовСделок"	, МассивВидовСделок);
	МассивСтруктурныхЕдиниц = Новый Массив;
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда 
		МассивСтруктурныхЕдиниц.Добавить(ОтборСтруктурнаяЕдиница);
	КонецЕсли;	
	ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);
	МассивСтатусовСделок = Новый Массив;
	Если ДанныеЭлемента.ЭтапСделки = ПредопределенноеЗначение("Справочник.ЭтапыСделок.Успех") ИЛИ ДанныеЭлемента.ЭтапСделки = ПредопределенноеЗначение("Справочник.ЭтапыСделок.Отказ") Тогда 
		МассивСтатусовСделок.Добавить("Да");
	Иначе 	
		МассивСтатусовСделок.Добавить("Нет");
	КонецЕсли;	
	ПараметрыОтбора.Вставить("МассивСтатусовСделок", МассивСтатусовСделок);		
	Если ОтборАдресатСведенийТип = "Мои" Тогда 
		ОтборСотрудники = Новый Массив;
		ОтборСотрудники.Добавить(ТекущийПользователь);
		ОтборСотрудники.Добавить(ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка"));		
		ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);		
	ИначеЕсли ОтборАдресатСведенийТип = "Все" Тогда
		// ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников(Истина);
		// ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);								
	ИначеЕсли ОтборАдресатСведенийТип = "ИзСписка" Тогда	
		ОтборСотрудники = ПолучитьМассивОтобранныхСотрудников();
		Если ЗначениеЗаполнено(ОтборСотрудники) Тогда 
			ПараметрыОтбора.Вставить("МассивМенеджеров"	, ОтборСотрудники);				
		КонецЕсли;	
	КонецЕсли;
	МассивЭтапов = Новый Массив;
	МассивЭтапов.Добавить(ДанныеЭлемента.ЭтапСделки);
	ПараметрыОтбора.Вставить("МассивЭтапов"			, МассивЭтапов);
	Если ДанныеЭлемента.ЭтапСделки = ПредопределенноеЗначение("Справочник.ЭтапыСделок.Успех") ИЛИ ДанныеЭлемента.ЭтапСделки = ПредопределенноеЗначение("Справочник.ЭтапыСделок.Отказ") Тогда  
		ПараметрыОтбора.Вставить("ПериодСделки"		, ОтборПериодЗначение);				
	КонецЕсли;
	МассивПричинОтказов = Новый Массив;	
	Если НЕ ИндексПричины = Неопределено И ДанныеЭлемента.ЭтапСделки = ПредопределенноеЗначение("Справочник.ЭтапыСделок.Отказ") И ЗначениеЗаполнено(ДанныеЭлемента.ТаблицаПричинОтказов) Тогда 
		МассивПричинОтказов.Добавить(ДанныеЭлемента.ТаблицаПричинОтказов[ИндексПричины].ПричинаОтказа);
	КонецЕсли;	
	ПараметрыОтбора.Вставить("МассивПричинОтказов", МассивПричинОтказов);
		
	ПараметрыОтбора.Вставить("ОчиститьВсеОтборы"		, Ложь);
	ПараметрыОтбора.Вставить("ОчиститьОтборПоСтатусу"	, Истина);
	
	// Ищем открытую форму
	ПараметрыФормы = НайтиОткрытуюФорму("Справочник.Сделки.Форма.ФормаСпискаНовая", Нстр("ru = 'Сделки'; en = 'Funnels'"));
	Если ПараметрыФормы.Открыта Тогда
		ПараметрыОтбора.Вставить("ОчиститьВсеОтборы", Истина);
	    Оповестить("ОБНОВИТЬ_ОТБОРЫ_СПИСКА_СДЕЛОК", Новый Структура("Отбор", ПараметрыОтбора), ЭтаФорма);
		ПараметрыФормы.ОкноПриложения.Активизировать();
		Возврат;
	КонецЕсли;
	
	// Форму не нашли - открываем		
	ОткрытьФорму("Справочник.Сделки.Форма.ФормаСпискаНовая", Новый Структура("Отбор", ПараметрыОтбора));	
	
КонецПроцедуры

#КонецОбласти

#Область _________________________СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ_________________________

#Область ________________ОБРАБОТЧИКИ_НАЖАТИЯ_СПИСКА_ДИНАМИЧЕСКОГО_МЕНЮ__________________

&НаСервере
// Процедура - Обновить динамическое меню отбор сотрудники
//
// Параметры:
//  ОтборСотрудник	 - 	 - 
//
Процедура ОбновитьДинамическоеМенюОтборСотрудники(ОтборСотрудник = Неопределено)
	
	// УстановитьПривилегированныйРежим(Истина);
	
	// Подготовка массива сотрудников                                              
	МассивСтруктурСотрудников 		= Новый Массив;
	ТаблицаСотрудниковИзСегмента 	= Неопределено;
	
	ТаблицаСотрудниковИзСегмента = ПолучитьВсехМенеджеровОтделаПродаж();
	// Если ТекущийПользователь.РольПользователя = Перечисления.РольПользователя.РуководительОтделаПродаж Тогда 
	//	// Получаем всех менеджеров
	//	ТаблицаСотрудниковИзСегмента = ПолучитьМенеджеровОтделаПродаж();
	// Иначе 
	//	СегментСотрудников = Пользователи.ПолучитьЗначениеПоУмолчаниюПользователя(ТекущийПользователь, "ПросмотрЗадачСотрудников", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	//	Если ЗначениеЗаполнено(СегментСотрудников) Тогда
	//		ТаблицаСотрудниковИзСегмента = РегистрыСведений.СоставСегментов.ВернутьСоставСегментаСотрудниковТаблицей(СегментСотрудников);
	//	КонецЕсли;	
	// КонецЕсли;	
	
	Если ТаблицаСотрудниковИзСегмента.Количество() <> 0 Тогда
		Если ЗначениеЗаполнено(ТекущийПользователь) Тогда 
			Если ТаблицаСотрудниковИзСегмента.Найти(ТекущийПользователь, "Сотрудник") = Неопределено Тогда
				СтрокаТаблицы 				= ТаблицаСотрудниковИзСегмента.Добавить();
				СтрокаТаблицы.Сотрудник 	= ТекущийПользователь;
				СтрокаТаблицы.Представление	= ТекущийПользователь.НаименованиеСокращенное;
				// СтрокаТаблицы.Отчество 		= ТекущийПользователь.Отчество;
				// СтрокаТаблицы.Фамилия 		= ТекущийПользователь.Фамилия;
				// СтрокаТаблицы.Наименование 	= ТекущийПользователь.Наименование;
				ТаблицаСотрудниковИзСегмента.Сортировать("Представление");
			КонецЕсли;
		КонецЕсли;
		Элементы.ГруппаОтборСотрудники.Видимость = Истина;
		Для Каждого СтрокаТаблицы ИЗ ТаблицаСотрудниковИзСегмента Цикл
			МассивСтруктурСотрудников.Добавить(Новый Структура("Значение, Представление, Выбор, Код", СтрокаТаблицы.Сотрудник, ?(ЗначениеЗаполнено(СтрокаТаблицы.Сотрудник), ?(ЗначениеЗаполнено(СокрЛП(СтрокаТаблицы.Представление)), СокрЛП(СтрокаТаблицы.Представление), СокрЛП(Строка(СтрокаТаблицы.Сотрудник))), Нстр("ru = 'Без сотрудника'; en = 'No employee'")), Ложь, XMLСтрока(СтрокаТаблицы.Сотрудник)));
		КонецЦикла;
		Элементы.ГруппаКнопкиПоказатьСведенияДляВсех.Видимость = Истина;
		Элементы.ГруппаКнопкиПоказатьСведенияМои.Доступность = Истина;				
		УстановитьТипАдресатаСведенийНаСервере(ОтборАдресатСведенийТип, , Ложь);		
		МассивОтбораДляПоляДопВвода = ТаблицаСотрудниковИзСегмента.ВыгрузитьКолонку("Сотрудник");		
	ИначеЕсли ЗначениеЗаполнено(ТекущийПользователь) Тогда 
		МассивСтруктурСотрудников.Добавить(Новый Структура("Значение, Представление, Выбор, Код", ТекущийПользователь, ?(ЗначениеЗаполнено(ТекущийПользователь), ?(ЗначениеЗаполнено(СокрЛП(ТекущийПользователь.НаименованиеСокращенное)), СокрЛП(ТекущийПользователь.НаименованиеСокращенное), СокрЛП(Строка(ТекущийПользователь))), Нстр("ru = 'Без сотрудника'; en = 'No employee'")), Ложь, XMLСтрока(ТекущийПользователь)));		
		МассивОтбораДляПоляДопВвода = Новый Массив;
		МассивОтбораДляПоляДопВвода.Добавить(ТекущийПользователь);
		УстановитьТипАдресатаСведенийНаСервере("Мои", , Ложь);
		Элементы.ГруппаОтборСотрудники.Видимость = Ложь;
		Элементы.ГруппаКнопкиПоказатьСведенияДляВсех.Видимость = Ложь;
		Элементы.ПоказатьСведенияМои.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
		// Элементы.ДекорацияУказательВыбранныеМоиСведения.Видимость = Истина;
		Элементы.ГруппаКнопкиПоказатьСведенияМои.ЦветФона = Новый Цвет();
		Элементы.ГруппаКнопкиПоказатьСведенияМои.Доступность = Ложь;		
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("Значение"				, Нстр("ru = 'Сотрудник'; en = 'Employee'"));
	СтруктураОтбора.Вставить("Представление"		, "ПереключательСотрудник");
	СтруктураОтбора.Вставить("ИмяПодчиненногоМеню"	, "ПодчиненноеМенюОтборСотрудники");
	СтруктураОтбора.Вставить("МассивЗначений"		, МассивСтруктурСотрудников);
	
	Если МассивСтруктурСотрудников.Количество() > 10 Тогда
		СтруктураОтбора.Вставить("МассивЗначений"	, Новый Массив);		
		СтруктураОтбора.Вставить("ПолеДопВвода"		, Истина);
		СтруктураОтбора.Вставить("ПараметрыВыбора"	, Новый Структура("Ссылка", Новый ФиксированныйМассив(МассивОтбораДляПоляДопВвода)));
	КонецЕсли;
	
	МассивДанных = Новый Массив;
	МассивДанных.Добавить(СтруктураОтбора);
	
	УправлениеИнтерфейсамиСервер.СоздатьДинамическоеМенюФормыРасписанияЗанятий(
	"МенюОтборСотрудники", 
	ЭтаФорма, 
	Элементы.ГруппаОтборСотрудники, 
	МассивДанных,
	"ОбработчикНажатияЭлементаДинамическогоМеню",,,
	Истина,
	Тип("СправочникСсылка.Сотрудники"),,
	15,,,
	"Отбор");

КонецПроцедуры

&НаСервере
// При изменении состава отборов
//
Процедура ПриИзмененииОтборовСервер(Знач ИмяКоманды)
	
	Если СтрНайти(ИмяКоманды, "КомандаОтбор") = 0 
		И СтрНайти(ИмяКоманды, "ПолеОтбор") = 0 Тогда
		
		УстановитьФокусЭлементаСервер();
	КонецЕсли;
	
	ИмяМеню = Неопределено;
	
	ЭлементФормы        = УправлениеИнтерфейсамиСервер.ЭлементФормыПоИмениЭлемента(ЭтаФорма, ИмяКоманды);
	ИмяЭлемента         = ЭлементФормы.Имя;
	ОбновитьПланировщик = УправлениеИнтерфейсамиСервер.ОбработчикЭлементаДинамическогоМенюПриНажатии(ЭтаФорма, ИмяЭлемента);
	 
	// Селектирование страниц филтров в зависимости от переключателей
	Если УправлениеИнтерфейсамиСервер.ЭтоЭлементБыстрогоВыбора(ИмяЭлемента) Тогда
		
		ИмяМеню = УправлениеИнтерфейсамиСервер.ИмяДинамическогоМенюФормыИзЭлемента(ИмяЭлемента);
		
		// Если сменился период отображения, необходимо обновить меню отборов 
		Если СтрНайти(ИмяЭлемента,"КнопкаПрименить") > 0 
			ИЛИ СтрНайти(ИмяЭлемента,"УдалитьЗначение") > 0 Тогда
			
			Если СтрНайти(ИмяМеню, "МенюОтборСотрудники") > 0 Тогда
				
				// ОбновитьДинамическиеМенюОтборов("Отборы");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьТипАдресатаСведенийНаСервере(ИмяКоманды);

	// Обновить планировщик
	Если ОбновитьПланировщик Тогда 
		ОбновитьОбщиеСведения();
		ОбновитьСведенияПоСделкам();		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик нажатия элемента динамического меню
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОбработчикНажатияЭлементаДинамическогоМеню(Команда) Экспорт		
			
	// Если это элнмент открытия Списка
	Если СтрНайти(Команда.Имя, "ОткрытьСписок") > 0 Тогда
		
		// Открываем список значений
		ОбработчикНажатияСпискаДинамическогоМеню(Команда.Имя);			
		Возврат;
		
	КонецЕсли;
	                             
	ПриИзмененииОтборовСервер(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик нажатия списка динамического меню
//
// Параметры:
//  Форма					 - 	 - 
//  СписокЗначений			 - 	 - 
//  ИмяКнопкиПредставления	 - 	 - 
//
Процедура ОбработчикНажатияСпискаДинамическогоМеню(ИмяКоманды)
	
	// Получаем привязанные данные и доп значения
	СтруктураДанных = ОбработчикНажатияСпискаДинамическогоМенюСервер(ИмяКоманды);  
	
	Если СтруктураДанных = Неопределено Тогда
		ОбновитьОбщиеСведения();
		Возврат;
	КонецЕсли;	
	
	// Выбор значения из выпадающего меню
	Оповещение = Новый ОписаниеОповещения("ОбработчикОткрытияСпискаДинамическогоМенюЗавершение", ЭтотОбъект, СтруктураДанных);
	ПоказатьВыборИзМеню(Оповещение, СтруктураДанных.ПривязанныеДанные.СписокЗначений, ЭтаФорма.Элементы[СтруктураДанных.ИмяКнопкиПредставления]);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик открытия списка динамического меню завершение 
//
// Параметры:
//  Результат	 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура ОбработчикОткрытияСпискаДинамическогоМенюЗавершение(Результат, ДопПараметры) Экспорт
	
 	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.План;

	// Обрабатываем результат выбора
	Если Результат <> Неопределено  Тогда
		
		ДопПараметры.Вставить("РезультатЗначение", Результат.Значение);
		ДопПараметры.Вставить("РезультатПредставление", Результат.Представление);
		
		ОбработчикНажатияСпискаДинамическогоМенюСерверЗавершение(ДопПараметры)	 				
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Функция - Обработчик нажатия списка динамического меню сервер 
//
// Параметры:
//  КомандаИмя		 - 	 - 
//  КомандаИмяРод	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОбработчикНажатияСпискаДинамическогоМенюСервер(КомандаИмя)
	
	Возврат УправлениеИнтерфейсамиСервер.ОбработчикНажатияСпискаДинамическогоМеню(ЭтаФорма, КомандаИмя);
	
КонецФункции

&НаСервере
// Процедура - Обработчик нажатия списка динамического меню сервер завершение 
//
// Параметры:
//  СтруктДанных - 	 - 
//
Процедура ОбработчикНажатияСпискаДинамическогоМенюСерверЗавершение(СтруктДанных)
	
	// Обработка выбранного значения
	УправлениеИнтерфейсамиСервер.ОбработчикНажатияСпискаДинамическогоМенюЗавершение(ЭтаФорма, СтруктДанных);
	
	ПриИзмененииОтборовСервер(ЭтаФорма.Элементы[СтруктДанных.ИмяКнопкиПредставления].ИмяКоманды);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
// Процедура - Инициализировать настройки монитора
//
Процедура ИнициализироватьНастройкиМонитора()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаНастроек = РегистрыСведений.НастройкиИнтерфейсов.ПолучитьНастройкиМонитораПродаж();	
	Для Каждого СтрокаТаблицыНастроек Из ТаблицаНастроек Цикл
		ИмяРеквизитаФормы = СтрЗаменить(СтрокаТаблицыНастроек.ИмяПредопределенныхДанных, "МониторПродаж_", "");
		Если ИмяРеквизитаФормы = "ПериодАвтообновления" Тогда 
			ЭтотОбъект[ИмяРеквизитаФормы] = ?(СтрокаТаблицыНастроек.Значение < 10, 10, СтрокаТаблицыНастроек.Значение); 
		ИначеЕсли ИмяРеквизитаФормы = "ДатаПросмотраИсторииСобытий" Тогда
			ЭтотОбъект[ИмяРеквизитаФормы] = ?(СтрокаТаблицыНастроек.Значение < ТекущаяДатаСеанса() - 86400*3, ТекущаяДатаСеанса() - 86400*3, СтрокаТаблицыНастроек.Значение); 
		ИначеЕсли ИмяРеквизитаФормы = "КоличествоКолонокДляВыводимыхВиджетов" Тогда
			ЭтотОбъект[ИмяРеквизитаФормы] = ?(СтрокаТаблицыНастроек.Значение = 0, 3, СтрокаТаблицыНастроек.Значение); 
		ИначеЕсли ИмяРеквизитаФормы = "КоличествоКолонокДляВыводимыхВиджетовKPI" Тогда
			ЭтотОбъект[ИмяРеквизитаФормы] = ?(СтрокаТаблицыНастроек.Значение = 0, 3, СтрокаТаблицыНастроек.Значение); 
		ИначеЕсли ИмяРеквизитаФормы = "ОтборПериодТип" Тогда
			ЭтотОбъект[ИмяРеквизитаФормы] = ?(СтрокаТаблицыНастроек.Значение = Перечисления.Периодичность.Час, Перечисления.Периодичность.День, СтрокаТаблицыНастроек.Значение); 
		ИначеЕсли ИмяРеквизитаФормы = "ОтборАдресатСведенийТип" Тогда
			ЭтотОбъект[ИмяРеквизитаФормы] = ?(ЗначениеЗаполнено(СтрокаТаблицыНастроек.Значение), ?(СтрокаТаблицыНастроек.Значение = "ИзСписка", "Все", СтрокаТаблицыНастроек.Значение), "Все"); 
		Иначе 
			ЭтотОбъект[ИмяРеквизитаФормы] = СтрокаТаблицыНастроек.Значение;
		КонецЕсли;
	КонецЦикла;	
	
	УстановитьОтборПоСтруктурнойЕдинице();
	ОбновитьТумблерАвтообновленияМонитораПродаж();
	УстановитьСвойстваЭлементамПомощи();
	
	// ОбсужденияВызовСервера.ОбсужденияПоОбъектамМенеджера(ИсторияСобытий, ТекущийПользователь, ДатаПросмотраИсторииСобытий, КоличествоСобытий);
	//// ОбсужденияВызовСервера.ОбсужденияПоОбъектамМенеджера(ИсторияСобытий, Справочники.Сотрудники.НайтиПоКоду("000000009"), Дата('2019.09.23 10:45:25'), КоличествоСобытий);
	
	// Элементы.КнопкаПокаВасНеБыло.Заголовок = Нстр("ru='Пока Вас не было (';en='While you were gone ('") + Формат(КоличествоСобытий, "ЧН=0") + ")"; 
	Элементы.КнопкаПокаВасНеБыло.Видимость = Ложь;
	
	УстановитьСвойстваКнопкамТаблицыСортировкиKPI("ТаблицаСортировкиПоказателейВиджетовГруппаКнопок");	
	УстановитьСвойстваКнопкамТаблицыСортировкиKPI("ТаблицаСортировкиПоказателейKPIГруппаКнопок");
	
	УстановитьПериодАгрегированияИнформацииНаСервере();
	
	Элементы.ДекорацияСекунды.Заголовок = СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу("Секунд", ПериодАвтообновления); // подготовить к переводу	
	
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить места работы сотрудника
//
// Параметры:
//  Сотрудник				 - 	 - 
//  ТипВозвращаемыхДанных	 - 	 - 
//  СтруктурнаяЕдиница		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМестаРаботыСотрудника(Сотрудник, ТипВозвращаемыхДанных = "Список", СтруктурнаяЕдиница = Неопределено)
	
	СписокСтруктурныхЕдиниц = Справочники.Сотрудники.ПолучитьМестаРаботыСотрудника(Сотрудник, ТипВозвращаемыхДанных, СтруктурнаяЕдиница);
	РольТекущегоПользователя = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Сотрудник, "Роль");
	Если РольТекущегоПользователя = Перечисления.РольПользователя.Врач
		ИЛИ РольТекущегоПользователя = Перечисления.РольПользователя.Руководитель
		ИЛИ РольТекущегоПользователя = Перечисления.РольПользователя.АдминистраторБазыДанных
		ИЛИ РольТекущегоПользователя = Перечисления.РольПользователя.Регистратура
		ИЛИ РольТекущегоПользователя = Перечисления.РольПользователя.ГлавныйВрач
		ИЛИ РольТекущегоПользователя = Перечисления.РольПользователя.Управляющий ИЛИ РольДоступна("ПолныеПрава") Тогда 
		
		СписокСтруктурныхЕдиниц.Вставить(0, Справочники.СтруктурныеЕдиницы.ПустаяСсылка(), "Все клиники", СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка(), ?(СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка(), БиблиотекаКартинок.ЧекБоксПолный, БиблиотекаКартинок.Пустая));
		
	КонецЕсли;
	
	Возврат СписокСтруктурныхЕдиниц;
	
КонецФункции

&НаСервере
// Процедура - Установить отбор по структурной единице
//
// Параметры:
//  ОбновитьСвойстваКнопки	 - 	 - 
//  ОбновитьДанные			 - 	 - 
//
Процедура УстановитьОтборПоСтруктурнойЕдинице(ОбновитьСвойстваКнопки = Истина, ОбновитьДанные = Ложь)
	
	Если НЕ ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) И НЕ ОтборСтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка() Тогда 
		ОтборСтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	УстановитьСвойстваОтображенияЭлементовСтруктутрнойЕдиницы();

	ОбновитьДинамическоеМенюОтборСотрудники();
	Если ОтборАдресатСведенийТип = "ИзСписка" Тогда
		ОтборСотрудники = УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники");
		ОтборСотрудники = ?(ЗначениеЗаполнено(ОтборСотрудники), ОтборСотрудники, Неопределено); // УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники", Истина));		
	ИначеЕсли ОтборАдресатСведенийТип = "Мои" Тогда 
		ОтборСотрудники = Новый Массив();
		ОтборСотрудники.Добавить(ТекущийПользователь);
	Иначе 
		ОтборСотрудники = Неопределено; // УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники", Истина);
	КонецЕсли;
	
	// АктуализироватьТаблицуСортировкиПоказателейKPI(, , ОтборСотрудники);
	
	Если ОбновитьДанные Тогда 
		ОбновитьОбщиеСведения();
		ОбновитьСведенияПоСделкам();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства отображения элементов структутрной единицы
//
Процедура УстановитьСвойстваОтображенияЭлементовСтруктутрнойЕдиницы()
	
	Если ПолучитьМестаРаботыСотрудника(ТекущийПользователь, , ОтборСтруктурнаяЕдиница).Количество() < 2 Тогда 
		Элементы.ГруппаКнопкиВыбораСтруктурнойЕдиницы.Видимость = Ложь;
	Иначе 
		Элементы.ГруппаКнопкиВыбораСтруктурнойЕдиницы.Видимость = Истина;
		Элементы.ВыбратьСтруктурнуюЕдиницу.Заголовок = ?(ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница), СокрЛП(Строка(ОтборСтруктурнаяЕдиница)), "Все клиники");
		КоличествоСимволов = СтрДлина(Элементы.ВыбратьСтруктурнуюЕдиницу.Заголовок);
		Если КоличествоСимволов <= 15 Тогда 
			Элементы.ВыбратьСтруктурнуюЕдиницу.МаксимальнаяШирина = Цел(КоличествоСимволов*1.15);
		ИначеЕсли КоличествоСимволов > 15 И КоличествоСимволов <= 20 Тогда
			Элементы.ВыбратьСтруктурнуюЕдиницу.МаксимальнаяШирина = Цел(КоличествоСимволов*1.1);
		ИначеЕсли КоличествоСимволов > 20 И КоличествоСимволов <= 30 Тогда 
			Элементы.ВыбратьСтруктурнуюЕдиницу.МаксимальнаяШирина = Цел(КоличествоСимволов*0.95);
		ИначеЕсли КоличествоСимволов > 30 И КоличествоСимволов <= 40 Тогда 
			Элементы.ВыбратьСтруктурнуюЕдиницу.МаксимальнаяШирина = Цел(КоличествоСимволов*0.75);
		Иначе 
			Элементы.ВыбратьСтруктурнуюЕдиницу.МаксимальнаяШирина = 35;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - Записать значение настройки пользователя на сервере
//
// Параметры:
//  ИмяНастройки		 - 	 - 
//  ЗначениеНастройки	 - 	 - 
//
Процедура ЗаписатьЗначениеНастройкиПользователяНаСервере(ИмяНастройки, ЗначениеНастройки)
	
	РегистрыСведений.НастройкиИнтерфейсов.ЗаписатьЗначениеНастройкиПользователя(ИмяНастройки, ЗначениеНастройки);	
	
КонецПроцедуры

&НаСервере
// Процедура - Записать настройки пользователя
//
Процедура ЗаписатьНастройкиПользователя()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтруктураРеквизитовФормы"		, ПолучитьСтруктуруРеквизитовФормы());
	СтруктураПараметров.Вставить("ИмяГруппыНастроекПользователя", "ИнтерфейсМонитораПродаж");
	СтруктураПараметров.Вставить("ПрефиксНастроекПользователя"	, "МониторПродаж_");		
	ПараметрыДлительнойОперации = ЗагрузкаПроведениеДокументов.НачатьСохранениеНастроекПользователя(Строка(Новый УникальныйИдентификатор()), СтруктураПараметров);
	
КонецПроцедуры

&НаСервере
// Функция - Получить структуру реквизитов формы
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтруктуруРеквизитовФормы() Экспорт
	
	СтруктураРеквизитов = Новый Структура();
	
	РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты();
	
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл 
		Если РеквизитФормы.Имя = "Объект" Тогда 
			Продолжить;
		ИначеЕсли РеквизитФормы.ТипЗначения.СодержитТип(Тип("ДинамическийСписок")) Тогда 
			Продолжить;
		ИначеЕсли РеквизитФормы.ТипЗначения.СодержитТип(Тип("ТаблицаЗначений")) Тогда	
			Продолжить;
		Иначе 
			СтруктураРеквизитов.Вставить(РеквизитФормы.Имя, ЭтаФорма[РеквизитФормы.Имя]);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаСервере
// Процедура - Обновить тумблер автообновления монитора продаж
//
Процедура ОбновитьТумблерАвтообновленияМонитораПродаж()
	
	Элементы.ГруппаКнопкиВключить.ЦветФона 						= ?(АвтоматическоеАвтообновление	, Новый Цвет(25, 116, 206)	, Новый Цвет(237, 237, 237));
	Элементы.ГруппаКнопкиВыключить.ЦветФона 					= ?(НЕ АвтоматическоеАвтообновление	, Новый Цвет(25, 116, 206)	, Новый Цвет(237, 237, 237));
	Элементы.ВключитьАвтоматическоеАвтообновление.ЦветТекста 	= ?(АвтоматическоеАвтообновление	, Новый Цвет(255, 255, 255)	, Новый Цвет(77, 77, 77));
	Элементы.ВыключитьАвтоматическоеАвтообновление.ЦветТекста 	= ?(НЕ АвтоматическоеАвтообновление	, Новый Цвет(255, 255, 255)	, Новый Цвет(77, 77, 77));
	Элементы.ПериодАвтообновления.Доступность 					= АвтоматическоеАвтообновление;
	Элементы.ДекорацияСекунды.Доступность 						= АвтоматическоеАвтообновление;
	
КонецПроцедуры

&НаСервере
// Процедура - Инициировать видео ролик при первом запуске
//
Процедура ИнициироватьВидеоРоликПриПервомЗапуске()
	
	СтраницаВидеоРолика = "<!doctype html>
							|<html lang=""en"">
							|<head>
							|
							|	<meta charset=""utf-8"">
							|	<meta http-equiv=""X-UA-Compatible"" content=""IE=edge"">
							|</head>
							|
							|<body >
							|<iframe width=100% height=""800"" src=""https://www.youtube.com/caMc2WhV0xc"" frameborder=""0"" allow=""accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture"" allowfullscreen></iframe>
							|
							|</body>
							|</html>";
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обновить монитор продаж
//
Процедура ОбновитьМониторПродаж()
	
	ОбновитьМониторПродажНаСервере();
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить монитор продаж на сервере
//
Процедура ОбновитьМониторПродажНаСервере(ЗНАЧ ОтборСотрудники = Неопределено)
	
	Если ОтборСотрудники = Неопределено Тогда 	
		Если ОтборАдресатСведенийТип = "ИзСписка" Тогда
			ОтборСотрудники = УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники");
			ОтборСотрудники = ?(ЗначениеЗаполнено(ОтборСотрудники), ОтборСотрудники, Неопределено); // УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники", Истина));		
		ИначеЕсли ОтборАдресатСведенийТип = "Мои" Тогда 
			ОтборСотрудники = Новый Массив();
			ОтборСотрудники.Добавить(ТекущийПользователь);
		Иначе 
			ОтборСотрудники = Неопределено;// УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники", Истина);
		КонецЕсли;
	КонецЕсли;
	
	// Обновление (подсчет) общих сведений
	ОбновитьОбщиеСведения(ОтборСотрудники);
	ОбновитьСведенияПоСделкам(ОтборСотрудники);
	
КонецПроцедуры

&НаСервере
// Процедура - Установить свойства элементам помощи
//
Процедура УстановитьСвойстваЭлементамПомощи()
	
	Элементы.Декорация3аявкиЗаглушка.Видимость 				= Ложь; // ОтображатьИнструкциюПоЗаявкам;
	Элементы.ДекорацияКлиентыЗаглушка.Видимость 			= Ложь; // ОтображатьИнструкциюПоКлиентам;
	Элементы.ДекорацияСделкиЗаглушка.Видимость 				= Ложь; // ОтображатьИнструкциюПоСделкам;
	Элементы.ДекорацияЗадачиЗаглушка.Видимость 				= Ложь; // ОтображатьИнструкциюПоЗадачам;
	Элементы.ГруппаНовоеИнформацияПоЗаявкам.Видимость 		= Ложь; // ОтображатьИнструкциюПоЗаявкам;
	Элементы.ГруппаНовоеИнформацияПоКлиентам.Видимость 		= Ложь; // ОтображатьИнструкциюПоКлиентам;
	Элементы.ГруппаНовоеИнформацияПоСделкам.Видимость 		= Ложь; // ОтображатьИнструкциюПоСделкам;
	Элементы.ГруппаНовоеИнформацияПоЗадачам.Видимость 		= Ложь; // ОтображатьИнструкциюПоЗадачам;
	Элементы.ГруппаНовоеИнформацияПоKPI.Видимость 			= Ложь; // ОтображатьИнструкциюПоKPI;	
	
	// Если ОтображатьИнструкциюПоKPI И НЕ ЗначениеЗаполнено(ИнформацияKPI) Тогда 
	//	ИнформацияKPI 					= Обработки.РабочийСтол.ПолучитьМакет("ИнформацияKPI").ПолучитьТекст();
	// КонецЕсли;
	Если ОтображатьИнструкциюПоЗадачам И НЕ ЗначениеЗаполнено(ИнформацияЗадачи) Тогда 
		ИнформацияЗадачи 				= Обработки.РабочийСтол.ПолучитьМакет("ИнформацияЗадачи").ПолучитьТекст();
	КонецЕсли;
	Если ОтображатьИнструкциюПоЗаявкам И НЕ ЗначениеЗаполнено(ИнформацияЗаявки) Тогда 
		ИнформацияЗаявки				= Обработки.РабочийСтол.ПолучитьМакет("ИнформацияЗаявки").ПолучитьТекст();
	КонецЕсли;
	Если ОтображатьИнструкциюПоКлиентам И НЕ ЗначениеЗаполнено(ИнформацияПотенциальныеКлиенты) Тогда 
		ИнформацияПотенциальныеКлиенты	= Обработки.РабочийСтол.ПолучитьМакет("ИнформацияПотенциальныеКлиенты").ПолучитьТекст();
	КонецЕсли;
	Если ОтображатьИнструкциюПоСделкам И НЕ ЗначениеЗаполнено(ИнформацияСделки) Тогда 
		ИнформацияСделки				= Обработки.РабочийСтол.ПолучитьМакет("ИнформацияСделки").ПолучитьТекст();
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура - Установить свойства кнопкам таблицы сортировки KPI
//
Процедура УстановитьСвойстваКнопкамТаблицыСортировкиKPI(ИмяГруппаРодитель)
	
	Для Каждого ПодчиненныйЭлемент Из Элементы[ИмяГруппаРодитель].ПодчиненныеЭлементы Цикл 
		Если ТипЗнч(ПодчиненныйЭлемент) = Тип("КнопкаФормы") Тогда 
			Если СтрНайти(ПодчиненныйЭлемент.ИмяКоманды, "РежимВывода") <> 0 Тогда
				ПодчиненныйЭлемент.Пометка = СтрСоединить(СтрРазделить(ПодчиненныйЭлемент.ИмяКоманды, СтрСоединить(СтрРазделить(ПодчиненныйЭлемент.ИмяКоманды, "0123456789")))) = ?(ИмяГруппаРодитель = "ТаблицаСортировкиПоказателейВиджетовГруппаКнопок", Строка(КоличествоКолонокДляВыводимыхВиджетов), Строка(КоличествоКолонокДляВыводимыхВиджетовKPI));
				ПодчиненныйЭлемент.ЦветТекста = ?(ПодчиненныйЭлемент.Пометка, Новый Цвет(0, 150, 70), Новый Цвет(77, 77, 77));
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
// Процедура - Актуализировать таблицу сортировки показателей KPI
//
Процедура АктуализироватьТаблицуСортировкиПоказателейKPI(ТолькоФлагИспользуется = Ложь, ТаблицаПлановыхПоказателей = Неопределено, ОтборСотрудники = Неопределено)
	
	// Если ТолькоФлагИспользуется И НЕ ТаблицаПлановыхПоказателей = Неопределено Тогда 
	//	Для Каждого СтрокаПоказательKPI Из ТаблицаСортировкиПоказателейKPI Цикл
	//		СтрокаПоказательKPI.Используется = ТаблицаПлановыхПоказателей.НайтиСтроки(Новый Структура("ПоказательЭффективности", СтрокаПоказательKPI.ПоказательЭффективности)).Количество() <> 0;
	//	КонецЦикла;	
	// Иначе 
	//	Если ОтборСотрудники = Неопределено Тогда 
	//		Если ОтборАдресатСведенийТип = "ИзСписка" Тогда
	//			ОтборСотрудники = УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники");
	//			ОтборСотрудники = ?(ЗначениеЗаполнено(ОтборСотрудники), ОтборСотрудники, СписокМенеджеровПоПродажам.ВыгрузитьЗначения());		
	//		ИначеЕсли ОтборАдресатСведенийТип = "Мои" Тогда 
	//			ОтборСотрудники = Новый Массив();
	//			ОтборСотрудники.Добавить(ТекущийПользователь);
	//		Иначе 
	//			ОтборСотрудники = СписокМенеджеровДляKPI.ВыгрузитьЗначения();
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	ТаблицаСортированныхПоказателейKPI = ТаблицаСортировкиПоказателейKPI.Выгрузить();
	//	Запрос = Новый Запрос;
	//	Запрос.УстановитьПараметр("МассивСотрудников", ОтборСотрудники);
	//	Запрос.МенеджерВременныхТаблиц 	= УправлениеЗапасамиПартионныйУчет.ВыбратьТЗВВременнуюТаблицу(ТаблицаСортированныхПоказателейKPI, "ТаблицаПоказателейKPI");
	//	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	               |	КлючевыеПоказателиЭффективностиСотрудников.ПоказательЭффективности КАК ПоказательЭффективности
	//	               |ПОМЕСТИТЬ ТаблицаПоказателейДляМассиваСотрудников
	//	               |ИЗ
	//	               |	РегистрСведений.КлючевыеПоказателиЭффективностиСотрудников КАК КлючевыеПоказателиЭффективностиСотрудников
	//	               |ГДЕ
	//	               |	КлючевыеПоказателиЭффективностиСотрудников.Сотрудник В(&МассивСотрудников)
	//	               |
	//	               |СГРУППИРОВАТЬ ПО
	//	               |	КлючевыеПоказателиЭффективностиСотрудников.ПоказательЭффективности
	//	               |;
	//	               |
	//	               |////////////////////////////////////////////////////////////////////////////////
	//	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//	               |	КлючевыеПоказателиЭффективности.ПоказательЭффективности КАК ПоказательЭффективности,
	//	               |	ЕСТЬNULL(ТаблицаПоказателейKPI.Порядок, 100) КАК Порядок,
	//	               |	ЕСТЬNULL(ТаблицаПоказателейKPI.Используется, ЛОЖЬ) КАК Используется,
	//	               |	ЕСТЬNULL(ТаблицаПоказателейKPI.Отображать, ИСТИНА) КАК Отображать
	//	               |ИЗ
	//	               |	ТаблицаПоказателейДляМассиваСотрудников КАК КлючевыеПоказателиЭффективности
	//	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПоказателейKPI КАК ТаблицаПоказателейKPI
	//	               |		ПО КлючевыеПоказателиЭффективности.ПоказательЭффективности = ТаблицаПоказателейKPI.ПоказательЭффективности
	//	               |ГДЕ
	//	               |	КлючевыеПоказателиЭффективности.ПоказательЭффективности.ПометкаУдаления = ЛОЖЬ
	//	               |
	//	               |УПОРЯДОЧИТЬ ПО
	//	               |	Порядок";
	//	
	//	ТаблицаСортированныхПоказателейKPI = Запрос.Выполнить().Выгрузить();
	//	ТаблицаСортировкиПоказателейKPI.Очистить(); Счетчик = 0;
	//	Для Каждого СтрокаПоказательKPI Из ТаблицаСортированныхПоказателейKPI Цикл
	//		Счетчик = Счетчик + 1;
	//		НоваяСтрока = ТаблицаСортировкиПоказателейKPI.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПоказательKPI);
	//		Если СтрокаПоказательKPI.Порядок = 100 Тогда 
	//			НоваяСтрока.Порядок = Счетчик;
	//		КонецЕсли;
	//	КонецЦикла;	
	// КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура - Установить фокус элемента на сервере.
//
Процедура УстановитьФокусЭлементаСервер()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ПоказатьСведенияМои;
	
КонецПроцедуры

#Область _________________________ГЕНЕРАЦИЯ_ЭЛЕМЕНТОВ_ФОРМЫ__________________________

&НаСервере
// Процедура - Отобразить все виды сделок
//
// Параметры:
//  НаполнитьДанными - 	 - 
//
Процедура ОтобразитьВсеВидыСделок(НаполнитьДанными = Истина)
	
	ЗаполнитьТаблицуВидовСделок();
	
	// Определяем родительские группы
	ГруппаСделки 								= Элементы.Найти("ГруппаСделки");
	ГруппаСделки_Шаблон_ 						= Элементы.Найти("ГруппаСделки_Шаблон_");
	
	// Обновим текущие взаимодействия
	Если ГруппаСделки = Неопределено Тогда
		Возврат;
	КонецЕсли;	
		
	// Очищаем родительские группы					
	УдалитьЭлементыГруппы(ГруппаСделки);
	// Создаем элементы
	ОбновитьЭлементыНаФормеСогласноШаблона(ГруппаСделки, ГруппаСделки_Шаблон_);
	ГруппаСделки_Шаблон_.Видимость 				= Ложь;
	
	Если НаполнитьДанными Тогда 
		ОбновитьСведенияПоСделкам();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить таблицу видов сделок
//
Процедура ЗаполнитьТаблицуВидовСделок()
	
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда
		МассивДоступныхВидовСделок 	= Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(Перечисления.ТипыСделок.Продажа, ОтборСтруктурнаяЕдиница);
	Иначе
		МассивСтруктурныхЕдиниц 	= Справочники.Сотрудники.ПолучитьМестаРаботыСотрудника(ТекущийПользователь, "Массив");		
		МассивДоступныхВидовСделок 	= Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(Перечисления.ТипыСделок.Продажа, МассивСтруктурныхЕдиниц);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДоступныхВидовСделок", МассивДоступныхВидовСделок);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыСделок.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТаблицаВидовСделок
	|ИЗ
	|	Справочник.ВидыСделок КАК ВидыСделок
	|ГДЕ
	|	ВидыСделок.Ссылка В(&МассивДоступныхВидовСделок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭтапыСделок.ВидСделки КАК ВидСделки,
	|	ЭтапыСделок.Ссылка КАК ЭтапСделки,
	|	ЭтапыСделок.ВидСделки.Наименование КАК ВидСделкиНаименование,
	|	ЭтапыСделок.Наименование КАК ЭтапСделкиНаименование,
	|	ЭтапыСделок.НомерЭтапа КАК НомерЭтапа,
	|	ЭтапыСделок.ЦветЭтапа КАК ЦветЭтапа,
	|	ВЫБОР
	|		КОГДА ЭтапыСделок.ВидСделки.Предопределенный
	|			ТОГДА ВЫБОР
	|					КОГДА ЭтапыСделок.ВидСделки.ИмяПредопределенныхДанных = ""НовыеПациенты""
	|						ТОГДА 1
	|					КОГДА ЭтапыСделок.ВидСделки.ИмяПредопределенныхДанных = ""ПостоянныеПациенты""
	|						ТОГДА 2
	|					ИНАЧЕ 99
	|				КОНЕЦ
	|		ИНАЧЕ 99
	|	КОНЕЦ КАК Порядок
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.Предопределенный = ЛОЖЬ
	|	И ЭтапыСделок.ПометкаУдаления = ЛОЖЬ
	|	И ЭтапыСделок.ВидСделки В
	|			(ВЫБРАТЬ
	|				ТаблицаВидовСделок.Ссылка
	|			ИЗ
	|				ТаблицаВидовСделок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыСделок.Ссылка,
	|	ЭтапыСделок.Ссылка,
	|	ВидыСделок.Наименование,
	|	ВЫБОР
	|		КОГДА ЭтапыСделок.Ссылка = ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.Успех)
	|			ТОГДА ВидыСделок.НаименованиеЭтапаУспех
	|		ИНАЧЕ ВидыСделок.НаименованиеЭтапаОтказ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЭтапыСделок.Ссылка = ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.Успех)
	|			ТОГДА 100
	|		ИНАЧЕ 101
	|	КОНЕЦ,
	|	ЭтапыСделок.ЦветЭтапа,
	|	ВЫБОР
	|		КОГДА ВидыСделок.Предопределенный
	|			ТОГДА ВЫБОР
	|					КОГДА ВидыСделок.ИмяПредопределенныхДанных = ""НовыеПациенты""
	|						ТОГДА 1
	|					КОГДА ВидыСделок.ИмяПредопределенныхДанных = ""ПостоянныеПациенты""
	|						ТОГДА 2
	|					ИНАЧЕ 99
	|				КОНЕЦ
	|		ИНАЧЕ 99
	|	КОНЕЦ
	|ИЗ
	|	Справочник.ВидыСделок КАК ВидыСделок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыСделок КАК ЭтапыСделок
	|		ПО ВидыСделок.Ссылка <> ЭтапыСделок.ВидСделки
	|ГДЕ
	|	ЭтапыСделок.Предопределенный = ИСТИНА
	|	И ВидыСделок.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаВидовСделок.Ссылка
	|			ИЗ
	|				ТаблицаВидовСделок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	ВидСделкиНаименование,
	|	ВидСделки,
	|	НомерЭтапа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыСделокПричиныОтказов.Ссылка КАК ВидСделки,
	|	ВидыСделокПричиныОтказов.ПричинаОтказа КАК ПричинаОтказа,
	|	ВидыСделокПричиныОтказов.ПричинаОтказа.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВидыСделок.ПричиныОтказов КАК ВидыСделокПричиныОтказов
	|ГДЕ
	|	ВидыСделокПричиныОтказов.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаВидовСделок.Ссылка
	|			ИЗ
	|				ТаблицаВидовСделок)";
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница);
	
	РезультатПакетногоЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаПричинОтказов = РезультатПакетногоЗапроса[2].Выгрузить();
	ТаблицаВидовСделок.Загрузить(РезультатПакетногоЗапроса[1].Выгрузить());
	Для Каждого СтрокаЭтап Из ТаблицаВидовСделок Цикл 
		Если СтрокаЭтап.ЭтапСделки = Справочники.ЭтапыСделок.Отказ Тогда
			ТаблицаПричинОтказовДляВида = ТаблицаПричинОтказов.Скопировать(Новый Структура("ВидСделки", СтрокаЭтап.ВидСделки));
			Для Каждого СтрокаТаблицы Из ТаблицаПричинОтказовДляВида Цикл 
				ЗаполнитьЗначенияСвойств(СтрокаЭтап.ТаблицаПричинОтказов.Добавить(), СтрокаТаблицы);
			КонецЦикла;	
	    КонецЕсли;
	КонецЦикла;
	
	// ТаблицаВидовСделок.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
// Процедура - Удалить элементы группы
//
// Параметры:
//  Форма				 - 	 - 
//  РодительскаяГруппа	 - 	 - 
//
Процедура УдалитьЭлементыГруппы(РодительскаяГруппа)
	
	УдаляемыеЭлементы = Новый Массив;
	
	Для Каждого ГруппаЭлементов Из Элементы[РодительскаяГруппа.Имя].ПодчиненныеЭлементы Цикл
		УдаляемыеЭлементы.Добавить(ГруппаЭлементов);
	КонецЦикла;
	
	Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
		Если СтрНайти(УдаляемыйЭлемент.Имя, "ЗаголовокВсплывающейГруппыГистограмм") <> 0 Тогда 
			Продолжить;
		Иначе 
			Элементы.Удалить(УдаляемыйЭлемент);
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить элементы на форме согласно шаблона
//
// Параметры:
//  Форма				 - 	 - 
//  ГруппаДляРазмещения	 - 	 - 
//  ГруппаШаблон		 - 	 - 
//  БизнесПроцессСсылка	 - 	 - 
//  ИндексСтроки		 - 	 - 
//  СтрокаТаблицы		 - 	 - 
//
Процедура ОбновитьЭлементыНаФормеСогласноШаблона(ГруппаДляРазмещения, ГруппаШаблон)
	
	ТаблицаВидовСделок_Группировка 	= ТаблицаВидовСделок.Выгрузить(, "ВидСделки, ВидСделкиНаименование");
	ТаблицаВидовСделок_Группировка.Свернуть("ВидСделки, ВидСделкиНаименование");
	
	Для Каждого СтрокаВидСделки Из ТаблицаВидовСделок_Группировка Цикл 
		ИндексСтроки = ТаблицаВидовСделок_Группировка.Индекс(СтрокаВидСделки);
		СрисоватьСШаблона(ГруппаДляРазмещения, ГруппаШаблон, ИндексСтроки, СтрокаВидСделки);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура - Срисовать с шаблона
//
// Параметры:
//  Форма				 - 	 - 
//  ГруппаДляРазмещения	 - 	 - 
//  ГруппаШаблон		 - 	 - 
//  БизнесПроцессСсылка	 - 	 - 
//  ИндексСтроки		 - 	 - 
//  СтрокаТаблицы		 - 	 - 
//
Процедура СрисоватьСШаблона(Знач ГруппаДляРазмещения
							, Знач ГруппаШаблон
							, Знач ИндексСтроки = Неопределено
							, Знач СтрокаТаблицыВидовСделок = Неопределено
							, Знач ИндексСтрокиПричины = Неопределено)
	
	Для Каждого ЭлементФормы Из ГруппаШаблон.ПодчиненныеЭлементы Цикл
		ИндексСтрокой = ?(ИндексСтроки = Неопределено, "", "_Индекс_" + Строка(ИндексСтроки));
		Если НЕ ИндексСтрокиПричины = Неопределено Тогда 
			ИндексСтрокой = ИндексСтрокой + "_ОтказПричина_" + Строка(ИндексСтрокиПричины);
		КонецЕсли;	
		Если ТипЗнч(ЭлементФормы) = Тип("ГруппаФормы") Тогда
			НовыйЭлемент = Элементы.Добавить(СтрЗаменить(ЭлементФормы.Имя, "_Шаблон_", "") + ИндексСтрокой, Тип("ГруппаФормы"), ГруппаДляРазмещения);
			НовыйЭлемент.Вид = ЭлементФормы.Вид;
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементФормы, , ПолучитьСписокИсключенныхСвойств(ЭлементФормы.Вид));
			МодифицироватьЭлементДляЧастногоСлучая(НовыйЭлемент, , ИндексСтроки, СтрокаТаблицыВидовСделок, ИндексСтрокиПричины);
			// Отображаем этапы для вида сделки
			Если ЭлементФормы.Имя = "ГруппаЭтапыСделки_Шаблон_" Тогда 
				МассивСтрокЭтапов = ТаблицаВидовСделок.НайтиСтроки(Новый Структура("ВидСделки", СтрокаТаблицыВидовСделок.ВидСделки));
				Для Каждого СтрокаТаблицыЭтапов Из МассивСтрокЭтапов Цикл
					ИндексСтроки = ТаблицаВидовСделок.Индекс(СтрокаТаблицыЭтапов);
					Если СтрокаТаблицыЭтапов.ЭтапСделки = Справочники.ЭтапыСделок.Отказ И ЗначениеЗаполнено(СтрокаТаблицыЭтапов.ТаблицаПричинОтказов) Тогда 
						Для Каждого СтрокаПричинаОтказа Из СтрокаТаблицыЭтапов.ТаблицаПричинОтказов Цикл
							ИндексСтрокиПричины = СтрокаТаблицыЭтапов.ТаблицаПричинОтказов.Индекс(СтрокаПричинаОтказа);							
							СрисоватьСШаблона(НовыйЭлемент, ЭлементФормы, ИндексСтроки, СтрокаТаблицыЭтапов, ИндексСтрокиПричины);					
						КонецЦикла;	
					Иначе 	
						СрисоватьСШаблона(НовыйЭлемент, ЭлементФормы, ИндексСтроки, СтрокаТаблицыЭтапов);					
					КонецЕсли;	
				КонецЦикла;
			Иначе 
				СрисоватьСШаблона(НовыйЭлемент, ЭлементФормы, ИндексСтроки, СтрокаТаблицыВидовСделок, ИндексСтрокиПричины);					
			КонецЕсли;	
		ИначеЕсли ТипЗнч(ЭлементФормы) = Тип("ДекорацияФормы") Тогда 
			НовыйЭлемент = Элементы.Добавить(СтрЗаменить(ЭлементФормы.Имя, "_Шаблон_", "") + ИндексСтрокой, Тип("ДекорацияФормы"), ГруппаДляРазмещения);
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементФормы);
            МодифицироватьЭлементДляЧастногоСлучая(НовыйЭлемент, , ИндексСтроки, СтрокаТаблицыВидовСделок, ИндексСтрокиПричины);
			УстановитьДействияДляЭлемента(НовыйЭлемент, ЭлементФормы, Тип("ДекорацияФормы"));
			Если ЭлементФормы.Имя = "ДекорацияСуммаСделокНаЭтапе_Шаблон_" Тогда
				Если СтрокаТаблицыВидовСделок.ЭтапСделки = Справочники.ЭтапыСделок.Отказ И НЕ ИндексСтрокиПричины = Неопределено Тогда
					СтрокаТаблицыВидовСделок.ТаблицаПричинОтказов[ИндексСтрокиПричины].ЭлементСуммаСделок = НовыйЭлемент.Имя;
				Иначе 					
					СтрокаТаблицыВидовСделок.ЭлементСуммаСделок = НовыйЭлемент.Имя;
				КонецЕсли; 	
			КонецЕсли;	
		ИначеЕсли ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") Тогда  
			НовыйЭлемент = Элементы.Добавить(СтрЗаменить(ЭлементФормы.Имя, "_Шаблон_", "") + ИндексСтрокой, Тип("ПолеФормы"), ГруппаДляРазмещения);
			НовыйЭлемент.Вид = ЭлементФормы.Вид;
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементФормы, , ПолучитьСписокИсключенныхСвойств(ЭлементФормы.Вид));
			МодифицироватьЭлементДляЧастногоСлучая(НовыйЭлемент, , ИндексСтроки, СтрокаТаблицыВидовСделок, ИндексСтрокиПричины);
			УстановитьДействияДляЭлемента(НовыйЭлемент, ЭлементФормы, Тип("ПолеФормы"));			
		ИначеЕсли ТипЗнч(ЭлементФормы) = Тип("КнопкаФормы") Тогда  
			НовыйЭлемент = Элементы.Добавить(СтрЗаменить(ЭлементФормы.Имя, "_Шаблон_", "") + ИндексСтрокой, Тип("КнопкаФормы"), ГруппаДляРазмещения);
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементФормы);				
			НоваяКоманда = Команды.Найти(СтрЗаменить(НовыйЭлемент.ИмяКоманды, "_Шаблон_", "") + ?(ЗначениеЗаполнено(ИндексСтрокой), ИндексСтрокой, ""));
			ШаблонКоманда = Команды.Найти(НовыйЭлемент.ИмяКоманды);
			Если НоваяКоманда = Неопределено Тогда 
				НоваяКоманда = Команды.Добавить(СтрЗаменить(НовыйЭлемент.ИмяКоманды, "_Шаблон_", "") + ИндексСтрокой);
				ЗаполнитьЗначенияСвойств(НоваяКоманда, ШаблонКоманда);
				НоваяКоманда.Действие = "Подключаемый_" + СтрЗаменить(НовыйЭлемент.ИмяКоманды, "_Шаблон_", "") + "_ВыполнитьКоманду";				
				МодифицироватьЭлементДляЧастногоСлучая(НовыйЭлемент, НоваяКоманда, ИндексСтроки, СтрокаТаблицыВидовСделок, ИндексСтрокиПричины);				
			КонецЕсли;
			НовыйЭлемент.ИмяКоманды = НоваяКоманда.Имя;
			МодифицироватьЭлементДляЧастногоСлучая(НовыйЭлемент, НоваяКоманда, ИндексСтроки, СтрокаТаблицыВидовСделок, ИндексСтрокиПричины);
			// Запоминаем имена кнопок для обновления данных 
			Если ЭлементФормы.Имя = "ПерейтиСделкиЭтапКоличество_Шаблон_" Тогда
				Если СтрокаТаблицыВидовСделок.ЭтапСделки = Справочники.ЭтапыСделок.Отказ И НЕ ИндексСтрокиПричины = Неопределено Тогда
					СтрокаТаблицыВидовСделок.ТаблицаПричинОтказов[ИндексСтрокиПричины].ЭлементКоличествоСделок = НовыйЭлемент.Имя;
				Иначе 	
					СтрокаТаблицыВидовСделок.ЭлементКоличествоСделок = НовыйЭлемент.Имя;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Функция - Получить список исключенных свойств
//
// Параметры:
//  ВидЭлемента	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСписокИсключенныхСвойств(ВидЭлемента)
	
	СписокСвойств = "";
	
	Если ВидЭлемента = ВидПоляФормы.ПолеФлажка Тогда 
		СписокСвойств = "ПутьКДанным";
	ИначеЕсли ВидЭлемента = ВидПоляФормы.ПолеВвода Тогда 
		СписокСвойств = "ВыделенныйТекст, ПутьКДанным";
	ИначеЕсли ВидЭлемента = ВидГруппыФормы.ОбычнаяГруппа Тогда	
		СписокСвойств = "ПутьКДаннымЗаголовка";
	КонецЕсли;
	
	Возврат СписокСвойств;
	
КонецФункции

&НаСервере
// Процедура - Модифицировать элемент для частного случая
//
// Параметры:
//  Элемент			 - 	 - 
//  Команда			 - 	 - 
//  ИндексСтроки	 - 	 - 
//  СтрокаТаблицы	 - 	 - 
//
Процедура МодифицироватьЭлементДляЧастногоСлучая(Элемент
												, Команда = Неопределено
												, ИндексСтроки
												, СтрокаТаблицы
												, ИндексСтрокиПричины = Неопределено)
	
	ПроверяемыйЭлемент = ?(Команда = Неопределено, Элемент, Команда);	
	Если НЕ ЗначениеЗаполнено(ПроверяемыйЭлемент.Подсказка) ИЛИ СтрНайти(ПроверяемыйЭлемент.Подсказка, "Процедура_") = 0 Тогда 
      	Возврат;
	КонецЕсли;
	
	ИмяОбработчика = СокрЛП(ПроверяемыйЭлемент.Подсказка);
	
	Если ИмяОбработчика = "Процедура_ОбработкаДекорации_ЗаголовокВидаСделки" Тогда 
		Процедура_ОбработкаДекорации_ЗаголовокВидаСделки(Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ИндексСтрокиПричины);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПодсказкиКоманды_КоличествоСделок" Тогда 
		Процедура_ОбработкаПодсказкиКоманды_КоличествоСделок(Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ИндексСтрокиПричины);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаДекорацииШтрих_ЗаголовокЭтапа" Тогда 
		Процедура_ОбработкаДекорацииШтрих_ЗаголовокЭтапа(Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ИндексСтрокиПричины);		
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаГруппы_ЗаголовокЭтапа" Тогда 
		Процедура_ОбработкаГруппы_ЗаголовокЭтапа(Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ИндексСтрокиПричины);				
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаКоманды_Перейти_Сделки_Этап" Тогда 
		Процедура_ОбработкаКоманды_Перейти_Сделки_Этап(Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ИндексСтрокиПричины);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаДекорации_ЗаголовокЭтапа" Тогда 
		Процедура_ОбработкаДекорации_ЗаголовокЭтапа(Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ИндексСтрокиПричины);		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
// Процедура - Процедура обработка декорации заголовок вида сделки
//
// Параметры:
//  Элемент			 - 	 - 
//  Команда			 - 	 - 
//  ИндексСтроки	 - 	 - 
//  СтрокаТаблицы	 - 	 - 
//
Процедура Процедура_ОбработкаДекорации_ЗаголовокВидаСделки(Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ИндексСтрокиПричины = Неопределено)
	
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		Элемент.Подсказка 	= "";		
		Элемент.Заголовок 	= СокрЛП(СтрокаТаблицы.ВидСделкиНаименование);
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура - Процедура обработка подсказки команды количество сделок
//
// Параметры:
//  Элемент			 - 	 - 
//  Команда			 - 	 - 
//  ИндексСтроки	 - 	 - 
//  СтрокаТаблицы	 - 	 - 
//
Процедура Процедура_ОбработкаПодсказкиКоманды_КоличествоСделок(Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ИндексСтрокиПричины = Неопределено)
	
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		Если СтрокаТаблицы.ЭтапСделки = Справочники.ЭтапыСделок.Успех Тогда 
			Команда.Подсказка = Нстр("ru = 'Перейти к успешным сделкам'; en = 'Go to succesful deals'");
		ИначеЕсли СтрокаТаблицы.ЭтапСделки = Справочники.ЭтапыСделок.Отказ Тогда
			Команда.Подсказка = Нстр("ru = 'Перейти к проигранным сделкам'; en = 'Go to lost deals'");
		Иначе 	
			Команда.Подсказка = Нстр("ru = 'Перейти к сделкам на этапе ""'; en = 'Go to deals on stage ""'") + СтрокаТаблицы.ЭтапСделкиНаименование + """";
		КонецЕсли;
	Иначе 
		Команда.Подсказка = "";
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура - Процедура обработка группы заголовок этапа
//
// Параметры:
//  Элемент			 - 	 - 
//  Команда			 - 	 - 
//  ИндексСтроки	 - 	 - 
//  СтрокаТаблицы	 - 	 - 
//
Процедура Процедура_ОбработкаДекорацииШтрих_ЗаголовокЭтапа(Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ИндексСтрокиПричины = Неопределено)
	
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		Элемент.Подсказка 		= "";
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЦветЭтапа) Тогда 
			Элемент.ЦветФона 	= ЗначениеИзСтрокиВнутр(СтрокаТаблицы.ЦветЭтапа);
		ИначеЕсли СтрокаТаблицы.ЭтапСделки = Справочники.ЭтапыСделок.Успех Тогда 
			Элемент.ЦветФона 	= Новый Цвет(83, 177, 83);
		ИначеЕсли СтрокаТаблицы.ЭтапСделки = Справочники.ЭтапыСделок.Отказ Тогда
			Элемент.ЦветФона 	= Новый Цвет(255, 83, 83);
		Иначе 
			Элемент.ЦветФона 	= Новый Цвет(232, 232, 232);
		КонецЕсли;
		Если Элемент.ЦветФона = Новый Цвет() Тогда 
			Элемент.ЦветФона 	= Новый Цвет(232, 232, 232);
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура - Процедура обработка группы заголовок этапа
//
// Параметры:
//  Элемент			 - 	 - 
//  Команда			 - 	 - 
//  ИндексСтроки	 - 	 - 
//  СтрокаТаблицы	 - 	 - 
//
Процедура Процедура_ОбработкаГруппы_ЗаголовокЭтапа(Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ИндексСтрокиПричины = Неопределено)
	
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		// Элемент.Подсказка 		= "";
		// Если ЗначениеЗаполнено(СтрокаТаблицы.ЦветЭтапа) Тогда 
		//	Элемент.ЦветФона 	= ЗначениеИзСтрокиВнутр(СтрокаТаблицы.ЦветЭтапа);
		// ИначеЕсли СтрокаТаблицы.ЭтапСделки = Справочники.ЭтапыСделок.Успех Тогда 
		//	Элемент.ЦветФона 	= Новый Цвет(83, 177, 83);
		// ИначеЕсли СтрокаТаблицы.ЭтапСделки = Справочники.ЭтапыСделок.Отказ Тогда
		//	Элемент.ЦветФона 	= Новый Цвет(255, 83, 83);
		// Иначе 
			Элемент.ЦветФона 	= Новый Цвет(242, 242, 242);
		// КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура - Процедура обработка команды перейти сделки этап
//
// Параметры:
//  Элемент			 - 	 - 
//  Команда			 - 	 - 
//  ИндексСтроки	 - 	 - 
//  СтрокаТаблицы	 - 	 - 
//
Процедура Процедура_ОбработкаКоманды_Перейти_Сделки_Этап(Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ИндексСтрокиПричины = Неопределено)
	
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		Элемент.Заголовок = СокрЛП(СтрокаТаблицы.ЭтапСделкиНаименование);
	КонецЕсли;
	
	Команда.Подсказка = "";		
	
КонецПроцедуры

&НаСервере
// Процедура - Процедура обработка декорации заголовок этапа
//
// Параметры:
//  Элемент			 - 	 - 
//  Команда			 - 	 - 
//  ИндексСтроки	 - 	 - 
//  СтрокаТаблицы	 - 	 - 
//
Процедура Процедура_ОбработкаДекорации_ЗаголовокЭтапа(Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ИндексСтрокиПричины = Неопределено)
	
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		Если СтрокаТаблицы.ЭтапСделки = Справочники.ЭтапыСделок.Отказ И НЕ ИндексСтрокиПричины = Неопределено Тогда 
			Элемент.Заголовок = СтрокаТаблицы.ТаблицаПричинОтказов[ИндексСтрокиПричины].Наименование;
		Иначе 	
			Элемент.Заголовок = СокрЛП(СтрокаТаблицы.ЭтапСделкиНаименование);
		КонецЕсли;	
	КонецЕсли;
	
	Элемент.Подсказка = "";		
	
КонецПроцедуры

&НаСервере
// Процедура - Установить действия для элемента
//
// Параметры:
//  НовыйЭлемент - 	 - 
//  ЭлементФормы - 	 - 
//  ТипЭлемента	 - 	 - 
//
Процедура УстановитьДействияДляЭлемента(НовыйЭлемент, ЭлементФормы, ТипЭлемента)
	
	Если ТипЭлемента = Тип("ДекорацияФормы") Тогда
		ИмяОбработчикаСобытия = ЭлементФормы.ПолучитьДействие("Нажатие");
		Если НЕ ИмяОбработчикаСобытия = "" Тогда 
			НовыйЭлемент.УстановитьДействие("Нажатие", ИмяОбработчикаСобытия);	
		КонецЕсли;
	ИначеЕсли ТипЭлемента = Тип("ПолеФормы") Тогда	
		ИмяОбработчикаСобытия = ЭлементФормы.ПолучитьДействие("ПриИзменении");
		Если НЕ ИмяОбработчикаСобытия = "" Тогда 
			НовыйЭлемент.УстановитьДействие("ПриИзменении", ИмяОбработчикаСобытия);	
		КонецЕсли;
		ИмяОбработчикаСобытия = ЭлементФормы.ПолучитьДействие("НачалоВыбора");
		Если НЕ ИмяОбработчикаСобытия = "" Тогда 
			НовыйЭлемент.УстановитьДействие("НачалоВыбора", ИмяОбработчикаСобытия);	
		КонецЕсли;
		ИмяОбработчикаСобытия = ЭлементФормы.ПолучитьДействие("НачалоВыбораИзСписка");
		Если НЕ ИмяОбработчикаСобытия = "" Тогда 
			НовыйЭлемент.УстановитьДействие("НачалоВыбораИзСписка", ИмяОбработчикаСобытия);	
		КонецЕсли;		
		ИмяОбработчикаСобытия = ЭлементФормы.ПолучитьДействие("Очистка");
		Если НЕ ИмяОбработчикаСобытия = "" Тогда 
			НовыйЭлемент.УстановитьДействие("Очистка", ИмяОбработчикаСобытия);	
		КонецЕсли;
		ИмяОбработчикаСобытия = ЭлементФормы.ПолучитьДействие("Открытие");
		Если НЕ ИмяОбработчикаСобытия = "" Тогда 
			НовыйЭлемент.УстановитьДействие("Открытие", ИмяОбработчикаСобытия);	
		КонецЕсли;		
		ИмяОбработчикаСобытия = ЭлементФормы.ПолучитьДействие("ОбработкаВыбора");
		Если НЕ ИмяОбработчикаСобытия = "" Тогда 
			НовыйЭлемент.УстановитьДействие("ОбработкаВыбора", ИмяОбработчикаСобытия);	
		КонецЕсли;		
		ИмяОбработчикаСобытия = ЭлементФормы.ПолучитьДействие("ОбработкаВыбора");
		Если НЕ ИмяОбработчикаСобытия = "" Тогда 
			НовыйЭлемент.УстановитьДействие("ОбработкаВыбора", ИмяОбработчикаСобытия);	
		КонецЕсли;		
	КонецЕсли;
	        
КонецПроцедуры

#КонецОбласти

&НаСервере
// Процедура - Обновить общие сведения
//
// Параметры:
//  ОбновитьЗаявки	 - 	 - 
//  ОбновитьКлиентов - 	 - 
//  ОбновитьЗадачи	 - 	 - 
//  ОтборСотрудники	 - 	 - 
//
Процедура ОбновитьОбщиеСведения(ЗНАЧ ОтборСотрудники = Неопределено, ОбновитьЗаявки = Истина, ОбновитьКлиентов = Истина, ОбновитьОбщиеПоСделкам = Истина, ОбновитьЗадачи = Истина)
	
	Если ОтборСотрудники = Неопределено ИЛИ ОтборАдресатСведенийТип = "Все" Тогда 	
		Если ОтборАдресатСведенийТип = "ИзСписка" Тогда
			ОтборСотрудники = УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники");
			ОтборСотрудники = ?(ЗначениеЗаполнено(ОтборСотрудники), ОтборСотрудники, Неопределено); // УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники", Истина));		
		ИначеЕсли ОтборАдресатСведенийТип = "Мои" Тогда 
			ОтборСотрудники = Новый Массив();
			ОтборСотрудники.Добавить(ТекущийПользователь);
		Иначе 
			ОтборСотрудники = Неопределено;// УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники", Истина);
		КонецЕсли;
	КонецЕсли;

	Если ОбновитьЗаявки = Истина Тогда 
		ОбновитьСведенияПоЗаявкам(ОтборСотрудники);
	КонецЕсли;
	
	Если ОбновитьКлиентов = Истина Тогда 
    	ОбновитьСведенияПоКлиентам(ОтборСотрудники);
	КонецЕсли;
	
	Если ОбновитьОбщиеПоСделкам = Истина Тогда 
		ОбновитьОбщиеСведенияПоСделкам(ОтборСотрудники);
	КонецЕсли;

	Если ОбновитьЗадачи = Истина Тогда 
		ОбновитьСведенияПоЗадачам(ОтборСотрудники);
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура - Обновить сведения по заявкам
//
// Параметры:
//  ОтборСотрудники	 - 	 - 
//
Процедура ОбновитьСведенияПоЗаявкам(ЗНАЧ ОтборСотрудники = Неопределено)
	
	Запрос = Новый Запрос;	
	Если ОтборСотрудники = Неопределено Тогда
		Если ОтборАдресатСведенийТип = "Мои" Тогда 
			ОтборСотрудники = Новый Массив;
			ОтборСотрудники.Добавить(ТекущийПользователь);
		ИначеЕсли ОтборАдресатСведенийТип = "Все" Тогда
			ОтборСотрудники = УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники", Истина);
		Иначе 	
			ОтборСотрудники = УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники");
			ОтборСотрудники = ?(ЗначениеЗаполнено(ОтборСотрудники), ОтборСотрудники, СписокМенеджеровПоПродажам.ВыгрузитьЗначения()); // УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники", Истина));		
		КонецЕсли;
	КонецЕсли;	
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Сотрудники.Ссылка КАК Исполнитель
	               |ПОМЕСТИТЬ ТаблицаИсполнителей
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |ГДЕ
	               |	Сотрудники.Ссылка В(&МассивСотрудников)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Заявки.Ссылка) КАК КоличествоНовыхЗаявок
	               |ИЗ
	               |	Справочник.Заявки КАК Заявки
	               |ГДЕ
	               |	Заявки.ПометкаУдаления = ЛОЖЬ
	               |	И Заявки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.НеОбработана)
	               |	И Заявки.ОсновнойМенеджер В
	               |			(ВЫБРАТЬ
	               |				ТаблицаИсполнителей.Исполнитель
	               |			ИЗ
	               |				ТаблицаИсполнителей)
	               |	И Заявки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Заявки.Ссылка) КАК КоличествоЗаявокВРаботе
	               |ИЗ
	               |	Справочник.Заявки КАК Заявки
	               |ГДЕ
	               |	Заявки.ПометкаУдаления = ЛОЖЬ
	               |	И Заявки.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.Перезвонить), ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.ОтвеченныйЗвонок), ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.ОтвеченныйДиалог), ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.ПропущенныйЗвонок))
	               |	И Заявки.ОсновнойМенеджер В
	               |			(ВЫБРАТЬ
	               |				ТаблицаИсполнителей.Исполнитель
	               |			ИЗ
	               |				ТаблицаИсполнителей)
	               |	И Заявки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница";
	
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда 
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Заявки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "ИСТИНА");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборСотрудники) Тогда 
		Запрос.УстановитьПараметр("МассивСотрудников", ОтборСотрудники);
		РезультатЗапроса 						= Запрос.ВыполнитьПакет();
		ВыборкаКоличестваНовыхЗаявок 			= РезультатЗапроса[1].Выбрать();
		ВыборкаКоличестваЗаявокВРаботе 			= РезультатЗапроса[2].Выбрать();
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Сотрудники.Ссылка КАК Исполнитель
	               |ПОМЕСТИТЬ ТаблицаИсполнителей
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |ГДЕ
	               |	Сотрудники.Ссылка В(&МассивСотрудников)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Заявки.ОсновнойМенеджер В
	               |			(ВЫБРАТЬ
	               |				ТаблицаИсполнителей.Исполнитель
	               |			ИЗ
	               |				ТаблицаИсполнителей)", "ИСТИНА");
		
		РезультатЗапроса 						= Запрос.ВыполнитьПакет();
		ВыборкаКоличестваНовыхЗаявок 			= РезультатЗапроса[0].Выбрать();
		ВыборкаКоличестваЗаявокВРаботе 			= РезультатЗапроса[1].Выбрать();
		
	КонецЕсли;	
	
	Если ВыборкаКоличестваНовыхЗаявок.Следующий() Тогда
		КоличествоНовыхЗаявок = ВыборкаКоличестваНовыхЗаявок.КоличествоНовыхЗаявок;
	Иначе
		КоличествоНовыхЗаявок = 0;
	КонецЕсли;	
	Элементы.ПерейтиНовыеЗаявки.Заголовок	= ?(КоличествоНовыхЗаявок > 0, Строка(КоличествоНовыхЗаявок) + " " + СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу("Новая", КоличествоНовыхЗаявок), Нстр("ru='нет новых заявок';en='not new applications'")); // подготовить к переводу
	Элементы.ПерейтиНовыеЗаявки.Доступность = КоличествоНовыхЗаявок > 0;				
	// Элементы.ПерейтиНовыеЗаявки.ЦветТекста 				= ?(КоличествоНовыхЗаявок > 0, Новый Цвет(), Новый Цвет(242, 242, 242));					
	
	Если ВыборкаКоличестваЗаявокВРаботе.Следующий() Тогда
		КоличествоЗаявокВРаботе = ВыборкаКоличестваЗаявокВРаботе.КоличествоЗаявокВРаботе;
	Иначе 	
		КоличествоЗаявокВРаботе = 0;		
	КонецЕсли;
	Элементы.ПерейтиНеОбработанныеЗаявки.Заголовок 	 = Строка(КоличествоЗаявокВРаботе) + Нстр("ru=' в работе';en=' at work'");	
	Элементы.ПерейтиНеОбработанныеЗаявки.Доступность = КоличествоЗаявокВРаботе > 0;					
	Элементы.ПерейтиНеОбработанныеЗаявки.ЦветТекста  = ?(КоличествоЗаявокВРаботе > 0, Новый Цвет(255, 0, 0), Новый Цвет(242, 242, 242));					
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить сведения по клиентам
//
// Параметры:
//  ОтборСотрудники	 - 	 - 
//
Процедура ОбновитьСведенияПоКлиентам(ЗНАЧ ОтборСотрудники = Неопределено)
	
	Если ОтборСотрудники = Неопределено Тогда
		Если ОтборАдресатСведенийТип = "Мои" Тогда 
			ОтборСотрудники = Новый Массив;
			ОтборСотрудники.Добавить(ТекущийПользователь);
		ИначеЕсли ОтборАдресатСведенийТип = "Все" Тогда
			ОтборСотрудники = СписокМенеджеровПоПродажам.ВыгрузитьЗначения();
		Иначе 	
			ОтборСотрудники = УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники");
			ОтборСотрудники = ?(ЗначениеЗаполнено(ОтборСотрудники), ОтборСотрудники, СписокМенеджеровПоПродажам.ВыгрузитьЗначения()); // УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники", Истина));		
		КонецЕсли;
	КонецЕсли;	
	
	Запрос 			= Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.Текст 	= "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	             	  |	СотрудникиМестаРаботы.Сотрудник КАК Сотрудник
	             	  |ПОМЕСТИТЬ ТаблицаСотрудников
	             	  |ИЗ
	             	  |	РегистрСведений.НастройкиСотрудников КАК СотрудникиМестаРаботы
	             	  |ГДЕ
	             	  |	СотрудникиМестаРаботы.Сотрудник В(&МассивМенеджеров)
	             	  |	И ВЫБОР
	             	  |			КОГДА СотрудникиМестаРаботы.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
	             	  |				ТОГДА ИСТИНА
	             	  |			ИНАЧЕ СотрудникиМестаРаботы.ДатаУвольнения > &ТекущаяДата
	             	  |		КОНЕЦ
	             	  |	И СотрудникиМестаРаботы.Сотрудник.ПометкаУдаления = ЛОЖЬ
	             	  |	И СотрудникиМестаРаботы.Сотрудник.ЭтоГруппа = ЛОЖЬ
	             	  |	И СотрудникиМестаРаботы.СтруктурнаяЕдиница.ПометкаУдаления = ЛОЖЬ
	             	  |	И СотрудникиМестаРаботы.СтруктурнаяЕдиница.ЭтоГруппа = ЛОЖЬ
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             	  |	КонтрагентыСведенияДляСписка.Контрагент КАК Контрагент,
	             	  |	КонтрагентыСведенияДляСписка.СледующаяЗадача КАК СледующаяЗадача,
	             	  |	КонтрагентыСведенияДляСписка.ТекущаяСделка КАК ТекущаяСделка
	             	  |ПОМЕСТИТЬ ТаблицаКлиентыДляСписка
	             	  |ИЗ
	             	  |	РегистрСведений.КонтрагентыСведенияДляСписка КАК КонтрагентыСведенияДляСписка
	             	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСотрудников КАК ТаблицаСотрудников
	             	  |		ПО КонтрагентыСведенияДляСписка.Контрагент.Куратор = ТаблицаСотрудников.Сотрудник
	             	  |ГДЕ
	             	  |	КонтрагентыСведенияДляСписка.Контрагент.ПометкаУдаления = ЛОЖЬ
	             	  |	И КонтрагентыСведенияДляСписка.Контрагент.ЭтоГруппа = ЛОЖЬ
	             	  |	И КонтрагентыСведенияДляСписка.Контрагент.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	             	  |	И КонтрагентыСведенияДляСписка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Потенциальный)
	             	  |
	             	  |СГРУППИРОВАТЬ ПО
	             	  |	КонтрагентыСведенияДляСписка.Контрагент,
	             	  |	КонтрагентыСведенияДляСписка.СледующаяЗадача,
	             	  |	КонтрагентыСведенияДляСписка.ТекущаяСделка
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             	  |	Взаимодействие.Ссылка КАК Ссылка
	             	  |ПОМЕСТИТЬ ТаблицаЗадач
	             	  |ИЗ
	             	  |	Задача.Взаимодействие КАК Взаимодействие
	             	  |ГДЕ
	             	  |	Взаимодействие.Ссылка В
	             	  |			(ВЫБРАТЬ
	             	  |				ТаблицаКлиентыДляСписка.СледующаяЗадача
	             	  |			ИЗ
	             	  |				ТаблицаКлиентыДляСписка
	             	  |			ГДЕ
	             	  |				ТаблицаКлиентыДляСписка.СледующаяЗадача <> ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка))
	             	  |	И Взаимодействие.ПометкаУдаления = ЛОЖЬ
	             	  |	И Взаимодействие.Выполнена = ЛОЖЬ
	             	  |	И Взаимодействие.ЗадачаНазначеннаяДатаНачало = ДАТАВРЕМЯ(1, 1, 1)
	             	  |	И Взаимодействие.ЗадачаНазначеннаяДата МЕЖДУ &ДатаНачалаПериода И &ДатаОкончаниеПериода
	             	  |
	             	  |СГРУППИРОВАТЬ ПО
	             	  |	Взаимодействие.Ссылка
	             	  |
	             	  |ОБЪЕДИНИТЬ ВСЕ
	             	  |
	             	  |ВЫБРАТЬ
	             	  |	Взаимодействие.Ссылка
	             	  |ИЗ
	             	  |	Задача.Взаимодействие КАК Взаимодействие
	             	  |ГДЕ
	             	  |	Взаимодействие.Ссылка В
	             	  |			(ВЫБРАТЬ
	             	  |				ТаблицаКлиентыДляСписка.СледующаяЗадача
	             	  |			ИЗ
	             	  |				ТаблицаКлиентыДляСписка
	             	  |			ГДЕ
	             	  |				ТаблицаКлиентыДляСписка.СледующаяЗадача <> ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка))
	             	  |	И Взаимодействие.ПометкаУдаления = ЛОЖЬ
	             	  |	И Взаимодействие.Выполнена = ЛОЖЬ
	             	  |	И Взаимодействие.ЗадачаНазначеннаяДатаНачало <> ДАТАВРЕМЯ(1, 1, 1)
	             	  |	И (Взаимодействие.ЗадачаНазначеннаяДатаНачало МЕЖДУ &ДатаНачалаПериода И &ДатаОкончаниеПериода
	             	  |			ИЛИ Взаимодействие.ЗадачаНазначеннаяДата МЕЖДУ &ДатаНачалаПериода И &ДатаОкончаниеПериода
	             	  |			ИЛИ &ДатаНачалаПериода >= Взаимодействие.ЗадачаНазначеннаяДатаНачало
	             	  |				И &ДатаОкончаниеПериода <= Взаимодействие.ЗадачаНазначеннаяДата)
	             	  |
	             	  |СГРУППИРОВАТЬ ПО
	             	  |	Взаимодействие.Ссылка
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             	  |	ТаблицаКлиентыДляСписка.Контрагент КАК Контрагент
	             	  |ПОМЕСТИТЬ ТаблицаКлиентыОжидаютАктивности
	             	  |ИЗ
	             	  |	ТаблицаКлиентыДляСписка КАК ТаблицаКлиентыДляСписка
	             	  |ГДЕ
	             	  |	ТаблицаКлиентыДляСписка.СледующаяЗадача В
	             	  |			(ВЫБРАТЬ
	             	  |				ТаблицаЗадач.Ссылка
	             	  |			ИЗ
	             	  |				ТаблицаЗадач)
	             	  |
	             	  |СГРУППИРОВАТЬ ПО
	             	  |	ТаблицаКлиентыДляСписка.Контрагент
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             	  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаКлиентыДляСписка.Контрагент) КАК КоличествоБезЗадач
	             	  |ИЗ
	             	  |	ТаблицаКлиентыДляСписка КАК ТаблицаКлиентыДляСписка
	             	  |ГДЕ
	             	  |	ТаблицаКлиентыДляСписка.СледующаяЗадача = ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             	  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаКлиентыДляСписка.Контрагент) КАК КоличествоБезСделок
	             	  |ИЗ
	             	  |	ТаблицаКлиентыДляСписка КАК ТаблицаКлиентыДляСписка
	             	  |ГДЕ
	             	  |	ТаблицаКлиентыДляСписка.ТекущаяСделка = ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаКлиентыОжидаютАктивности.Контрагент) КАК КоличествоОжидающихАктивности
	             	  |ИЗ
	             	  |	ТаблицаКлиентыОжидаютАктивности КАК ТаблицаКлиентыОжидаютАктивности";
	
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда 
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, ОтборСтруктурнаяЕдиница);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КонтрагентыСведенияДляСписка.Контрагент.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "ИСТИНА");
	КонецЕсли;	
	Запрос.УстановитьПараметр("ТекущаяДата"			, ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ДатаНачалаПериода"	, НачалоДня(ОтборПериодЗначение.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончаниеПериода", КонецДня(ОтборПериодЗначение.ДатаОкончания));
	Запрос.УстановитьПараметр("МассивМенеджеров"	, ОтборСотрудники);
	
	РезультатЗапроса 								= Запрос.ВыполнитьПакет();
	ВыборкаКоличестваБезЗадач 						= РезультатЗапроса[4].Выбрать();
	ВыборкаКоличестваБезСделок 						= РезультатЗапроса[5].Выбрать();	
	ВыборкаКоличестваОжидающихАктивности 			= РезультатЗапроса[6].Выбрать();
	
	Если ВыборкаКоличестваОжидающихАктивности.Следующий() Тогда
		КоличествоОжидающихАктивности = ВыборкаКоличестваОжидающихАктивности.КоличествоОжидающихАктивности;
	Иначе 
		КоличествоОжидающихАктивности = 0;		
	КонецЕсли;
	Элементы.ПерейтиКлиентыОжидающиеАктивности.Заголовок 	= ?(КоличествоОжидающихАктивности > 0, Строка(КоличествоОжидающихАктивности) + " " + СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу("Ожидает", КоличествоОжидающихАктивности) + Нстр("ru = ' активности'; en = ' activity'"), Нстр("ru='нет пациентов с запланированной активностью';en='no patients with planned activity'")); // подготовить к переводу
	Элементы.ПерейтиКлиентыОжидающиеАктивности.Доступность	= КоличествоОжидающихАктивности > 0;				
	// Элементы.ПерейтиКлиентыОжидающиеАктивности.ЦветТекста = ?(КоличествоОжидающихАктивности > 0, Новый Цвет(), Новый Цвет(242, 242, 242));					
		
	Если ВыборкаКоличестваБезЗадач.Следующий() Тогда
		КоличествоБезЗадач 							= ВыборкаКоличестваБезЗадач.КоличествоБезЗадач;		
	Иначе 	
		КоличествоБезЗадач 							= 0;		
	КонецЕсли;	
	Элементы.ПерейтиКлиентыБезЗадач.Заголовок 		= Строка(КоличествоБезЗадач) + Нстр("ru=' без задач';en=' without tasks'");
	Элементы.ПерейтиКлиентыБезЗадач.Доступность 	= КоличествоБезЗадач > 0;					
	Элементы.ПерейтиКлиентыБезЗадач.ЦветТекста 		= ?(КоличествоБезЗадач > 0, Новый Цвет(255, 0, 0), Новый Цвет(242, 242, 242));					
	
	Если ВыборкаКоличестваБезСделок.Следующий() Тогда
		КоличествоБезСделок 						= ВыборкаКоличестваБезСделок.КоличествоБезСделок;		
	Иначе 	
		КоличествоБезСделок 						= 0;		
	КонецЕсли;	
	Элементы.ПерейтиКлиентыБезСделок.Заголовок 		= Строка(КоличествоБезСделок) + Нстр("ru=' без сделок';en=' without deals'");
	Элементы.ПерейтиКлиентыБезСделок.Доступность 	= КоличествоБезСделок > 0;					
	Элементы.ПерейтиКлиентыБезСделок.ЦветТекста 	= ?(КоличествоБезСделок > 0, Новый Цвет(255, 0, 0), Новый Цвет(242, 242, 242));					
	
	Элементы.ПерейтиКлиентыБезЗадач.Видимость 		= КоличествоБезЗадач > 0 ИЛИ КоличествоБезСделок = 0;
	Элементы.ПерейтиКлиентыБезСделок.Видимость 		= КоличествоБезСделок > 0 ИЛИ КоличествоБезЗадач = 0;
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить сведения по клиентам
//
// Параметры:
//  ОтборСотрудники	 - 	 - 
//
Процедура ОбновитьОбщиеСведенияПоСделкам(ЗНАЧ ОтборСотрудники = Неопределено)
	
	Если ОтборСотрудники = Неопределено Тогда
		Если ОтборАдресатСведенийТип = "Мои" Тогда 
			ОтборСотрудники = Новый Массив;
			ОтборСотрудники.Добавить(ТекущийПользователь);
		ИначеЕсли ОтборАдресатСведенийТип = "Все" Тогда
			ОтборСотрудники = УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники", Истина);
		Иначе 	
			ОтборСотрудники = УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники");
			ОтборСотрудники = ?(ЗначениеЗаполнено(ОтборСотрудники), ОтборСотрудники, Неопределено); // УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники", Истина));		
		КонецЕсли;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда
		МассивДоступныхВидовСделок 	= Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(Перечисления.ТипыСделок.Продажа, ОтборСтруктурнаяЕдиница);
	Иначе
		МассивСтруктурныхЕдиниц 	= РегистрыСведений.НастройкиСотрудников.ПолучитьМестаРаботыСотрудника(ТекущийПользователь, "Массив");		
		МассивДоступныхВидовСделок 	= Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(Перечисления.ТипыСделок.Продажа, МассивСтруктурныхЕдиниц);
	КонецЕсли;	
		
	Запрос 			= Новый Запрос;
	Запрос.УстановитьПараметр("МассивДоступныхВидовСделок", МассивДоступныхВидовСделок);
	Запрос.Текст 	= "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             	  |	Сделки.ЭтапСделки КАК ЭтапСделки
	             	  |ПОМЕСТИТЬ ТаблицаЭтапов
	             	  |ИЗ
	             	  |	Справочник.Сделки КАК Сделки
	             	  |
	             	  |СГРУППИРОВАТЬ ПО
	             	  |	Сделки.ЭтапСделки
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	             	  |	ЭтапыСделок.Ссылка КАК Ссылка
	             	  |ПОМЕСТИТЬ ТаблицаЭтаповАктуальных
	             	  |ИЗ
	             	  |	Справочник.ЭтапыСделок КАК ЭтапыСделок
	             	  |ГДЕ
	             	  |	ЭтапыСделок.Ссылка В
	             	  |			(ВЫБРАТЬ
	             	  |				ТаблицаЭтапов.ЭтапСделки
	             	  |			ИЗ
	             	  |				ТаблицаЭтапов)
	             	  |	И ЭтапыСделок.Ссылка <> ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.ПустаяСсылка)
	             	  |	И ЭтапыСделок.ПометкаУдаления = ЛОЖЬ
	             	  |	И ЭтапыСделок.ВидСделки В(&МассивДоступныхВидовСделок)
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             	  |	ВидыСделок.Ссылка КАК ВидСделки
	             	  |ПОМЕСТИТЬ ТаблицаВидовСделокДляПродажи
	             	  |ИЗ
	             	  |	Справочник.ВидыСделок КАК ВидыСделок
	             	  |ГДЕ
	             	  |	ВидыСделок.Ссылка В(&МассивДоступныхВидовСделок)
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             	  |	Сделки.Ссылка КАК Ссылка
	             	  |ПОМЕСТИТЬ ТаблицаСделок
	             	  |ИЗ
	             	  |	Справочник.Сделки КАК Сделки
	             	  |ГДЕ
	             	  |	Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	             	  |	И Сделки.ВидСделки В
	             	  |			(ВЫБРАТЬ
	             	  |				ТаблицаВидовСделокДляПродажи.ВидСделки
	             	  |			ИЗ
	             	  |				ТаблицаВидовСделокДляПродажи)
	             	  |	И Сделки.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
	             	  |	И &УсловиеМенеджер					  
	             	  |	И Сделки.ПометкаУдаления = ЛОЖЬ
	             	  |	И Сделки.ЭтапСделки В
	             	  |			(ВЫБРАТЬ
	             	  |				ТаблицаЭтаповАктуальных.Ссылка
	             	  |			ИЗ
	             	  |				ТаблицаЭтаповАктуальных)
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             	  |	СделкиСведенияДляСписка.Сделка КАК Сделка
	             	  |ПОМЕСТИТЬ ТаблицаСделкиОжидаютАктивности
	             	  |ИЗ
	             	  |	РегистрСведений.СделкиСведенияДляСписка КАК СделкиСведенияДляСписка
	             	  |ГДЕ
	             	  |	СделкиСведенияДляСписка.Сделка В
	             	  |			(ВЫБРАТЬ
	             	  |				ТаблицаСделок.Ссылка
	             	  |			ИЗ
	             	  |				ТаблицаСделок)
	             	  |	И НЕ СделкиСведенияДляСписка.ЗапланированнаяЗадача = ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)
	             	  |	И СделкиСведенияДляСписка.ЗапланированнаяЗадача.ПометкаУдаления = ЛОЖЬ
	             	  |	И СделкиСведенияДляСписка.ЗапланированнаяЗадача.Выполнена = ЛОЖЬ
	             	  |	И СделкиСведенияДляСписка.ЗапланированнаяЗадача.ЗадачаНазначеннаяДатаНачало = ДАТАВРЕМЯ(1, 1, 1)
	             	  |	И СделкиСведенияДляСписка.ЗапланированнаяЗадача.ЗадачаНазначеннаяДата МЕЖДУ &ДатаНачалаПериода И &ДатаОкончаниеПериода
	             	  |
	             	  |СГРУППИРОВАТЬ ПО
	             	  |	СделкиСведенияДляСписка.Сделка
	             	  |
	             	  |ОБЪЕДИНИТЬ ВСЕ
	             	  |
	             	  |ВЫБРАТЬ
	             	  |	СделкиСведенияДляСписка.Сделка
	             	  |ИЗ
	             	  |	РегистрСведений.СделкиСведенияДляСписка КАК СделкиСведенияДляСписка
	             	  |ГДЕ
	             	  |	СделкиСведенияДляСписка.Сделка В
	             	  |			(ВЫБРАТЬ
	             	  |				ТаблицаСделок.Ссылка
	             	  |			ИЗ
	             	  |				ТаблицаСделок)
	             	  |	И НЕ СделкиСведенияДляСписка.ЗапланированнаяЗадача = ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)
	             	  |	И СделкиСведенияДляСписка.ЗапланированнаяЗадача.ПометкаУдаления = ЛОЖЬ
	             	  |	И СделкиСведенияДляСписка.ЗапланированнаяЗадача.Выполнена = ЛОЖЬ
	             	  |	И СделкиСведенияДляСписка.ЗапланированнаяЗадача.ЗадачаНазначеннаяДатаНачало <> ДАТАВРЕМЯ(1, 1, 1)
	             	  |	И СделкиСведенияДляСписка.ЗапланированнаяЗадача.ЗадачаНазначеннаяДатаНачало >= &ДатаНачалаПериода
	             	  |	И СделкиСведенияДляСписка.ЗапланированнаяЗадача.ЗадачаНазначеннаяДата <= &ДатаОкончаниеПериода
	             	  |
	             	  |СГРУППИРОВАТЬ ПО
	             	  |	СделкиСведенияДляСписка.Сделка
	             	  |
	             	  |ОБЪЕДИНИТЬ ВСЕ
	             	  |
	             	  |ВЫБРАТЬ
	             	  |	СделкиСведенияДляСписка.Сделка
	             	  |ИЗ
	             	  |	РегистрСведений.СделкиСведенияДляСписка КАК СделкиСведенияДляСписка
	             	  |ГДЕ
	             	  |	СделкиСведенияДляСписка.Сделка В
	             	  |			(ВЫБРАТЬ
	             	  |				ТаблицаСделок.Ссылка
	             	  |			ИЗ
	             	  |				ТаблицаСделок)
	             	  |	И НЕ СделкиСведенияДляСписка.ЗапланированнаяПредварительнаяЗапись = ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка)
	             	  |
	             	  |СГРУППИРОВАТЬ ПО
	             	  |	СделкиСведенияДляСписка.Сделка					  
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             	  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СделкиСведенияДляСписка.Сделка) КАК КоличествоБезАктивности
	             	  |ИЗ
	             	  |	РегистрСведений.СделкиСведенияДляСписка КАК СделкиСведенияДляСписка
	             	  |ГДЕ
	             	  |	СделкиСведенияДляСписка.Сделка В
	             	  |			(ВЫБРАТЬ
	             	  |				ТаблицаСделок.Ссылка
	             	  |			ИЗ
	             	  |				ТаблицаСделок)
	             	  |	И СделкиСведенияДляСписка.ЗапланированнаяПредварительнаяЗапись = ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка)
	             	  |	И СделкиСведенияДляСписка.ЗапланированнаяЗадача = ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             	  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаСделкиОжидаютАктивности.Сделка) КАК КоличествоОжидающихАктивности
	             	  |ИЗ
	             	  |	ТаблицаСделкиОжидаютАктивности КАК ТаблицаСделкиОжидаютАктивности";
	
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда 
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, ОтборСтруктурнаяЕдиница);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "(ВидыСделок.СтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	             	  |					ИЛИ ВидыСделок.СтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "(ВидыСделок.СтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	             	  |			ИЛИ ВидыСделок.СтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)
	             	  |	И ", "");
		Если МассивСтруктурныхЕдиниц.Найти(Справочники.СтруктурныеЕдиницы.ПустаяСсылка()) = Неопределено Тогда 
			МассивСтруктурныхЕдиниц.Добавить(Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
		КонецЕсли;		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "Сделки.СтруктурнаяЕдиница В(&СтруктурнаяЕдиница)");
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", МассивСтруктурныхЕдиниц);
		
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "ИСТИНА");
	КонецЕсли;	
	Запрос.УстановитьПараметр("ТекущаяДата"			, ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ДатаНачалаПериода"	, НачалоДня(ОтборПериодЗначение.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончаниеПериода", КонецДня(ОтборПериодЗначение.ДатаОкончания));
	Если ЗначениеЗаполнено(ОтборСотрудники) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеМенеджер", "(Сделки.Менеджер В(&МассивМенеджеров) ИЛИ Сделки.Менеджер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))");
		Запрос.УстановитьПараметр("МассивМенеджеров", ОтборСотрудники);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеМенеджер", "ИСТИНА");
	КонецЕсли;	
	
	РезультатЗапроса 								= Запрос.ВыполнитьПакет();
	ВыборкаКоличестваБезАктивности					= РезультатЗапроса[5].Выбрать();
	ВыборкаКоличестваОжидающихАктивности 			= РезультатЗапроса[6].Выбрать();
	
	Если ВыборкаКоличестваОжидающихАктивности.Следующий() Тогда
		КоличествоОжидающихАктивности = ВыборкаКоличестваОжидающихАктивности.КоличествоОжидающихАктивности;
	Иначе 
		КоличествоОжидающихАктивности = 0;		
	КонецЕсли;
	Элементы.ПерейтиСделкиОжидающиеАктивности.Заголовок 	= ?(КоличествоОжидающихАктивности > 0, Строка(КоличествоОжидающихАктивности) + " " + СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу("Ожидает", КоличествоОжидающихАктивности) + Нстр("ru = ' активности'; en = ' activity'"), Нстр("ru='нет сделок с запланированной активностью';en='no deals with planned activity'")); // подготовить к переводу
	Элементы.ПерейтиСделкиОжидающиеАктивности.Доступность	= КоличествоОжидающихАктивности > 0;				
	// Элементы.ПерейтиКлиентыОжидающиеАктивности.ЦветТекста = ?(КоличествоОжидающихАктивности > 0, Новый Цвет(), Новый Цвет(242, 242, 242));					
		
	Если ВыборкаКоличестваБезАктивности.Следующий() Тогда
		КоличествоБезАктивности 							= ВыборкаКоличестваБезАктивности.КоличествоБезАктивности;		
	Иначе 	
		КоличествоБезАктивности 							= 0;		
	КонецЕсли;	
	Элементы.ПерейтиСделкиБезЗадач.Заголовок 		= Строка(КоличествоБезАктивности) + Нстр("ru=' без активности';en=' no activity'");
	Элементы.ПерейтиСделкиБезЗадач.Доступность 		= КоличествоБезАктивности > 0;					
	Элементы.ПерейтиСделкиБезЗадач.ЦветТекста 		= ?(КоличествоБезАктивности > 0, Новый Цвет(255, 0, 0), Новый Цвет(242, 242, 242));					
	// Элементы.ПерейтиСделкиБезЗадач.Видимость 		= КоличествоБезЗадач > 0;
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить сведения по задачам
//
// Параметры:
//  ОтборСотрудники	 - 	 - 
//
Процедура ОбновитьСведенияПоЗадачам(ЗНАЧ ОтборСотрудники = Неопределено)
	
	Если ОтборСотрудники = Неопределено Тогда
		Если ОтборАдресатСведенийТип = "Мои" Тогда 
			ОтборСотрудники = Новый Массив;
			ОтборСотрудники.Добавить(ТекущийПользователь);
		ИначеЕсли ОтборАдресатСведенийТип = "Все" Тогда
			ОтборСотрудники = СписокМенеджеровДляЗадач.ВыгрузитьЗначения();
		Иначе 	
			ОтборСотрудники = УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники");
			ОтборСотрудники = ?(ЗначениеЗаполнено(ОтборСотрудники), ОтборСотрудники, СписокМенеджеровПоПродажам.ВыгрузитьЗначения()); // УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники", Истина));		
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда
		МассивДоступныхВидовСделок 	= Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(Перечисления.ТипыСделок.Продажа, ОтборСтруктурнаяЕдиница);
	Иначе
		МассивСтруктурныхЕдиниц 	= РегистрыСведений.НастройкиСотрудников.ПолучитьМестаРаботыСотрудника(ТекущийПользователь, "Массив");		
		МассивДоступныхВидовСделок 	= Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(Перечисления.ТипыСделок.Продажа, МассивСтруктурныхЕдиниц);
	КонецЕсли;	
		
	Запрос 			= Новый Запрос;
	Запрос.УстановитьПараметр("МассивДоступныхВидовСделок"	, МассивДоступныхВидовСделок);
	Запрос.УстановитьПараметр("МассивСотрудников"			, ОтборСотрудники);	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	Сотрудники.Ссылка КАК Исполнитель
	               |ПОМЕСТИТЬ ТаблицаИсполнителей
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |ГДЕ
	               |	Сотрудники.Ссылка В(&МассивСотрудников)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВидыСделок.Ссылка КАК ВидСделки
	               |ПОМЕСТИТЬ ТаблицаВидовСделок
	               |ИЗ
	               |	Справочник.ВидыСделок КАК ВидыСделок
	               |ГДЕ
	               |	ВидыСделок.Ссылка В(&МассивДоступныхВидовСделок)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	Взаимодействие.Ссылка КАК Взаимодействие,
	               |	Взаимодействие.Сделка КАК Сделка
	               |ПОМЕСТИТЬ ТаблицаЗадачиЗапланированные
	               |ИЗ
	               |	Задача.Взаимодействие КАК Взаимодействие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаИсполнителей КАК ТаблицаИсполнителей
	               |		ПО Взаимодействие.Исполнитель = ТаблицаИсполнителей.Исполнитель
	               |ГДЕ
	               |	Взаимодействие.ПометкаУдаления = ЛОЖЬ
	               |	И Взаимодействие.Выполнена = ЛОЖЬ
	               |	И Взаимодействие.СтруктурнаяЕдиница = &ТекущаяСтруктурнаяЕдиница
	               |	И Взаимодействие.ЗадачаНазначеннаяДатаНачало = ДАТАВРЕМЯ(1, 1, 1)
	               |	И Взаимодействие.ЗадачаНазначеннаяДата МЕЖДУ &ДатаНачалаПериода И &ДатаОкончаниеПериода
	               |	И Взаимодействие.Исполнитель <> НЕОПРЕДЕЛЕНО
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Взаимодействие.Ссылка,
	               |	Взаимодействие.Сделка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Взаимодействие.Ссылка,
	               |	Взаимодействие.Сделка
	               |ИЗ
	               |	Задача.Взаимодействие КАК Взаимодействие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаИсполнителей КАК ТаблицаИсполнителей
	               |		ПО Взаимодействие.Исполнитель = ТаблицаИсполнителей.Исполнитель
	               |ГДЕ
	               |	Взаимодействие.ПометкаУдаления = ЛОЖЬ
	               |	И Взаимодействие.Выполнена = ЛОЖЬ
	               |	И Взаимодействие.СтруктурнаяЕдиница = &ТекущаяСтруктурнаяЕдиница
	               |	И Взаимодействие.ЗадачаНазначеннаяДатаНачало <> ДАТАВРЕМЯ(1, 1, 1)
	               |	И (Взаимодействие.ЗадачаНазначеннаяДатаНачало МЕЖДУ &ДатаНачалаПериода И &ДатаОкончаниеПериода
	               |			ИЛИ Взаимодействие.ЗадачаНазначеннаяДата МЕЖДУ &ДатаНачалаПериода И &ДатаОкончаниеПериода
	               |			ИЛИ &ДатаНачалаПериода >= Взаимодействие.ЗадачаНазначеннаяДатаНачало
	               |				И &ДатаОкончаниеПериода <= Взаимодействие.ЗадачаНазначеннаяДата)
	               |	И Взаимодействие.Исполнитель <> НЕОПРЕДЕЛЕНО
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Взаимодействие.Ссылка,
	               |	Взаимодействие.Сделка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Взаимодействие.Ссылка КАК Взаимодействие,
	               |	Взаимодействие.Сделка КАК Сделка
	               |ПОМЕСТИТЬ ТаблицаЗадачиПросроченные
	               |ИЗ
	               |	Задача.Взаимодействие КАК Взаимодействие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаИсполнителей КАК ТаблицаИсполнителей
	               |		ПО Взаимодействие.Исполнитель = ТаблицаИсполнителей.Исполнитель
	               |ГДЕ
	               |	Взаимодействие.ПометкаУдаления = ЛОЖЬ
	               |	И Взаимодействие.Выполнена = ЛОЖЬ
	               |	И Взаимодействие.СтруктурнаяЕдиница = &ТекущаяСтруктурнаяЕдиница
	               |	И Взаимодействие.ЗадачаНазначеннаяДата < &ТекущаяДата
	               |	И Взаимодействие.Исполнитель <> НЕОПРЕДЕЛЕНО
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Взаимодействие.Ссылка,
	               |	Взаимодействие.Сделка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.Взаимодействие) КАК КоличествоНовыхЗадач
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТаблицаЗадачиЗапланированные.Взаимодействие КАК Взаимодействие
	               |	ИЗ
	               |		ТаблицаЗадачиЗапланированные КАК ТаблицаЗадачиЗапланированные
	               |	ГДЕ
	               |		ТаблицаЗадачиЗапланированные.Сделка <> ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
	               |		И ТаблицаЗадачиЗапланированные.Сделка.ВидСделки В
	               |				(ВЫБРАТЬ
	               |					ТаблицаВидовСделок.ВидСделки
	               |				ИЗ
	               |					ТаблицаВидовСделок)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ТаблицаЗадачиЗапланированные.Взаимодействие
	               |	ИЗ
	               |		ТаблицаЗадачиЗапланированные КАК ТаблицаЗадачиЗапланированные
	               |	ГДЕ
	               |		ТаблицаЗадачиЗапланированные.Сделка = ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)) КАК ВложенныйЗапрос
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.Взаимодействие) КАК КоличествоПросроченныхЗадач
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТаблицаЗадачиПросроченные.Взаимодействие КАК Взаимодействие
	               |	ИЗ
	               |		ТаблицаЗадачиПросроченные КАК ТаблицаЗадачиПросроченные
	               |	ГДЕ
	               |		ТаблицаЗадачиПросроченные.Сделка <> ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
	               |		И ТаблицаЗадачиПросроченные.Сделка.ВидСделки В
	               |				(ВЫБРАТЬ
	               |					ТаблицаВидовСделок.ВидСделки
	               |				ИЗ
	               |					ТаблицаВидовСделок)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ТаблицаЗадачиПросроченные.Взаимодействие
	               |	ИЗ
	               |		ТаблицаЗадачиПросроченные КАК ТаблицаЗадачиПросроченные
	               |	ГДЕ
	               |		ТаблицаЗадачиПросроченные.Сделка = ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)) КАК ВложенныйЗапрос";
	
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда 
		Запрос.УстановитьПараметр("ТекущаяСтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Взаимодействие.СтруктурнаяЕдиница = &ТекущаяСтруктурнаяЕдиница", "ИСТИНА");
	КонецЕсли;		
	Запрос.УстановитьПараметр("МассивСотрудников"			, ОтборСотрудники);		
	Запрос.УстановитьПараметр("ТекущаяДата"					, НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ДатаНачалаПериода"			, НачалоДня(ОтборПериодЗначение.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончаниеПериода"		, КонецДня(ОтборПериодЗначение.ДатаОкончания));
		
	РезультатЗапроса 							= Запрос.ВыполнитьПакет();
	ВыборкаКоличестваНовыхЗадач 				= РезультатЗапроса[4].Выбрать();
	ВыборкаКоличестваПросроченныхЗадач 			= РезультатЗапроса[5].Выбрать();
	
	Если ВыборкаКоличестваНовыхЗадач.Следующий() Тогда
		КоличествоНовыхЗадач = ВыборкаКоличестваНовыхЗадач.КоличествоНовыхЗадач;
	Иначе 
		КоличествоНовыхЗадач = 0;		
	КонецЕсли;
	Элементы.ПерейтиЗадачиНовые.Заголовок   = ?(КоличествоНовыхЗадач > 0, Строка(КоличествоНовыхЗадач) + " " + СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу("Новая", КоличествоНовыхЗадач) + " " + СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу("Задача", КоличествоНовыхЗадач), Нстр("ru='нет новых задач';en='not new tasks'")); // подготовить к переводу
	Элементы.ПерейтиЗадачиНовые.Доступность	= КоличествоНовыхЗадач > 0;				
	// Элементы.ПерейтиЗадачиНовые.ЦветТекста 			= ?(КоличествоНовыхЗадач > 0, Новый Цвет(), Новый Цвет(242, 242, 242));					
		
	Если ВыборкаКоличестваПросроченныхЗадач.Следующий() Тогда
		КоличествоПросроченныхЗадач = ВыборкаКоличестваПросроченныхЗадач.КоличествоПросроченныхЗадач;		
	Иначе 	
		КоличествоПросроченныхЗадач = 0;		
	КонецЕсли;	
	Элементы.ПерейтиЗадачиПросроченные.Заголовок 	= Строка(КоличествоПросроченныхЗадач) + " " + СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу("Просроченная", КоличествоПросроченныхЗадач); // подготовить к переводу
	Элементы.ПерейтиЗадачиПросроченные.Доступность 	= КоличествоПросроченныхЗадач > 0;					
	Элементы.ПерейтиЗадачиПросроченные.ЦветТекста 	= ?(КоличествоПросроченныхЗадач > 0, Новый Цвет(255, 0, 0), Новый Цвет(242, 242, 242));					
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить сведения по сделкам
//
// Параметры:
//  ОтборСотрудники	 - 	 - 
//
Процедура ОбновитьСведенияПоСделкам(ЗНАЧ ОтборСотрудники = Неопределено)
	
	Если ОтборСотрудники = Неопределено ИЛИ ОтборАдресатСведенийТип = "Все" Тогда
		Если ОтборАдресатСведенийТип = "Мои" Тогда 
			ОтборСотрудники = Новый Массив;
			ОтборСотрудники.Добавить(ТекущийПользователь);
		ИначеЕсли ОтборАдресатСведенийТип = "Все" Тогда
			ОтборСотрудники = УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники", Истина);				
		Иначе 	
			ОтборСотрудники = УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники");
			ОтборСотрудники = ?(ЗначениеЗаполнено(ОтборСотрудники), ОтборСотрудники, Неопределено); // УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники", Истина));		
		КонецЕсли;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда
		МассивДоступныхВидовСделок 	= Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(Перечисления.ТипыСделок.Продажа, ОтборСтруктурнаяЕдиница);
	Иначе
		МассивСтруктурныхЕдиниц 	= РегистрыСведений.НастройкиСотрудников.ПолучитьМестаРаботыСотрудника(ТекущийПользователь, "Массив");		
		МассивДоступныхВидовСделок 	= Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(Перечисления.ТипыСделок.Продажа, МассивСтруктурныхЕдиниц);
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДоступныхВидовСделок", МассивДоступныхВидовСделок);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыСделок.Ссылка КАК ВидСделки
	|ПОМЕСТИТЬ ТаблицаВидовСделокДляПродажи
	|ИЗ
	|	Справочник.ВидыСделок КАК ВидыСделок
	|ГДЕ
	|	ВидыСделок.Ссылка В(&МассивДоступныхВидовСделок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Сделки.Ссылка) КАК КоличествоСделок,
	|	Сделки.ВидСделки КАК ВидСделки,
	|	Сделки.ЭтапСделки КАК ЭтапСделки,
	|	ЗНАЧЕНИЕ(Справочник.ПричиныОтказов.ПустаяСсылка) КАК ПричинаОтказа,
	|	СУММА(Сделки.СуммаСделки) КАК СуммаСделки
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.ПометкаУдаления = ЛОЖЬ
	|	И Сделки.ВидСделки В
	|			(ВЫБРАТЬ
	|				ТаблицаВидовСделокДляПродажи.ВидСделки
	|			ИЗ
	|				ТаблицаВидовСделокДляПродажи)
	|	И НЕ Сделки.ЭтапСделки В (ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.Успех), ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.Отказ), ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.ПустаяСсылка))
	|	И &УсловиеМенеджер
	|	И Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Сделки.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Сделки.ВидСделки,
	|	Сделки.ЭтапСделки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Сделки.Ссылка),
	|	Сделки.ВидСделки,
	|	Сделки.ЭтапСделки,
	|	ЕСТЬNULL(ВидыСделокПричиныОтказов.ПричинаОтказа, ЗНАЧЕНИЕ(Справочник.ПричиныОтказов.ПустаяСсылка)),
	|	СУММА(Сделки.СуммаСделки)
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыСделок.ПричиныОтказов КАК ВидыСделокПричиныОтказов
	|		ПО (Сделки.ЭтапСделки = ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.Отказ))
	|			И Сделки.ВидСделки = ВидыСделокПричиныОтказов.Ссылка
	|			И Сделки.ПричинаОтказа = ВидыСделокПричиныОтказов.ПричинаОтказа
	|ГДЕ
	|	Сделки.ПометкаУдаления = ЛОЖЬ
	|	И Сделки.ВидСделки В
	|			(ВЫБРАТЬ
	|				ТаблицаВидовСделокДляПродажи.ВидСделки
	|			ИЗ
	|				ТаблицаВидовСделокДляПродажи)
	|	И НЕ Сделки.ЭтапСделки = ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.ПустаяСсылка)
	|	И Сделки.ЭтапСделки В (ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.Успех), ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.Отказ))
	|	И Сделки.ДатаЗавершенияСделки МЕЖДУ &ДатаНачалаПериода И &ДатаОкончаниеПериода
	|	И &УсловиеМенеджер
	|	И Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И НЕ Сделки.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Сделки.ВидСделки,
	|	Сделки.ЭтапСделки,
	|	ЕСТЬNULL(ВидыСделокПричиныОтказов.ПричинаОтказа, ЗНАЧЕНИЕ(Справочник.ПричиныОтказов.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сделки.Ссылка КАК Сделка,
	|	Сделки.Менеджер КАК Менеджер,
	|	Сделки.Прием КАК Реализация
	|ПОМЕСТИТЬ ТаблицаУспешныхСделок
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.ПометкаУдаления = ЛОЖЬ
	|	И Сделки.ВидСделки В
	|			(ВЫБРАТЬ
	|				ТаблицаВидовСделокДляПродажи.ВидСделки
	|			ИЗ
	|				ТаблицаВидовСделокДляПродажи)
	|	И Сделки.ЭтапСделки = ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.Успех)
	|	И Сделки.ДатаЗавершенияСделки МЕЖДУ &ДатаНачалаПериода И &ДатаОкончаниеПериода
	|	И &УсловиеМенеджер
	|	И Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Сделки.Прием <> ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Сделки.Ссылка,
	|	Сделки.Менеджер,
	|	Сделки.Прием
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Реализация.Сделка КАК Сделка,
	|	Реализация.Сделка.ВидСделки КАК ВидСделки,
	|	СУММА(Реализация.СуммаДокумента) КАК СуммаПродаж
	|ПОМЕСТИТЬ ТаблицаРеализацийПоСделкам
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.Сделка В
	|			(ВЫБРАТЬ
	|				ТаблицаУспешныхСделок.Сделка
	|			ИЗ
	|				ТаблицаУспешныхСделок)
	|
	|СГРУППИРОВАТЬ ПО
	|	Реализация.Сделка,
	|	Реализация.Сделка.ВидСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.ВидСделки КАК ВидСделки,
	|	СУММА(ВложенныйЗапрос.СуммаПродаж) КАК СуммаПродаж
	|ИЗ
	|	(ВЫБРАТЬ
	|		РеализацийПоСделкам.ВидСделки КАК ВидСделки,
	|		СУММА(РеализацийПоСделкам.СуммаПродаж) КАК СуммаПродаж
	|	ИЗ
	|		ТаблицаРеализацийПоСделкам КАК РеализацийПоСделкам
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РеализацийПоСделкам.ВидСделки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаУспешныхСделок.Сделка.ВидСделки,
	|		СУММА(ТаблицаУспешныхСделок.Реализация.СуммаДокумента)
	|	ИЗ
	|		ТаблицаУспешныхСделок КАК ТаблицаУспешныхСделок
	|	ГДЕ
	|		НЕ ТаблицаУспешныхСделок.Сделка В
	|					(ВЫБРАТЬ
	|						ТаблицаРеализацийПоСделкам.Сделка
	|					ИЗ
	|						ТаблицаРеализацийПоСделкам)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаУспешныхСделок.Сделка.ВидСделки) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ВидСделки";
	
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда 
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, ОтборСтруктурнаяЕдиница);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "(ВидыСделок.СтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	             	  |			ИЛИ ВидыСделок.СтруктурныеЕдиницыПрименения.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)
	             	  |	И ", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "ИСТИНА");
	КонецЕсли;		
	Запрос.УстановитьПараметр("ДатаНачалаПериода"	, НачалоДня(ОтборПериодЗначение.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончаниеПериода", КонецДня(ОтборПериодЗначение.ДатаОкончания));
	Если ЗначениеЗаполнено(ОтборСотрудники) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеМенеджер", "(Сделки.Менеджер В(&МассивМенеджеров) ИЛИ Сделки.Менеджер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))");
		Запрос.УстановитьПараметр("МассивМенеджеров", ОтборСотрудники);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеМенеджер", "ИСТИНА");
	КонецЕсли;	
	
	РезультатПакетаЗапросов 	= Запрос.ВыполнитьПакет();
	
	ТаблицаСведенийПоСделкам 	= РезультатПакетаЗапросов[1].Выгрузить();	
	ТаблицаПродажПоСделкам 		= РезультатПакетаЗапросов[4].Выгрузить();	
	
	СимвольныйКодЦелойчастиВалюты = ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодЦелойчастиВалюты(ТекущаяВалюта);
	Для Каждого СтрокаЭтапСделки Из ТаблицаВидовСделок Цикл 
		Если СтрокаЭтапСделки.ЭтапСделки = Справочники.ЭтапыСделок.Отказ И ЗначениеЗаполнено(СтрокаЭтапСделки.ТаблицаПричинОтказов) Тогда
			Для Каждого СтрокаПричина Из СтрокаЭтапСделки.ТаблицаПричинОтказов Цикл 
				МассивСтрок = ТаблицаСведенийПоСделкам.НайтиСтроки(Новый Структура("ВидСделки, ЭтапСделки, ПричинаОтказа", СтрокаЭтапСделки.ВидСделки, СтрокаЭтапСделки.ЭтапСделки, СтрокаПричина.ПричинаОтказа)); 
				ЭлементКоличествоСделок = СтрокаПричина.ЭлементКоличествоСделок;
				ЭлементСуммаСделок 		= СтрокаПричина.ЭлементСуммаСделок;
				ОбновитьСвойстваЭлементовЭтапаВоронки(СтрокаЭтапСделки, МассивСтрок, ТаблицаПродажПоСделкам, СимвольныйКодЦелойчастиВалюты, ЭлементКоличествоСделок, ЭлементСуммаСделок);
			КонецЦикла;	
		Иначе 
			МассивСтрок = ТаблицаСведенийПоСделкам.НайтиСтроки(Новый Структура("ВидСделки, ЭтапСделки", СтрокаЭтапСделки.ВидСделки, СтрокаЭтапСделки.ЭтапСделки)); 
			ЭлементКоличествоСделок 	= СтрокаЭтапСделки.ЭлементКоличествоСделок;
			ЭлементСуммаСделок 			= СтрокаЭтапСделки.ЭлементСуммаСделок;			
			ОбновитьСвойстваЭлементовЭтапаВоронки(СтрокаЭтапСделки, МассивСтрок, ТаблицаПродажПоСделкам, СимвольныйКодЦелойчастиВалюты, ЭлементКоличествоСделок, ЭлементСуммаСделок);
		КонецЕсли;
	КонецЦикла;	
		
КонецПроцедуры	

&НаСервере
// Процедура - Обновить свойства элементов этапа сделки
//
// Параметры:
//  СтрокаЭтапСделки				 - 	 - 
//  МассивСтрок						 - 	 - 
//  ТаблицаПродажПоСделкам			 - 	 - 
//  СимвольныйКодЦелойчастиВалюты	 - 	 - 
//  ЭлементКоличествоСделок			 - 	 - 
//  ЭлементСуммаСделок				 - 	 - 
//
Процедура ОбновитьСвойстваЭлементовЭтапаВоронки(СтрокаЭтапСделки, МассивСтрок, ТаблицаПродажПоСделкам, СимвольныйКодЦелойчастиВалюты, ЭлементКоличествоСделок, ЭлементСуммаСделок)

	Если МассивСтрок.Количество() = 0 Тогда 
		Элементы[ЭлементКоличествоСделок].Заголовок 	= Формат(0, "ЧН=0");// + " " + СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу("Сделка", 0);// подготовить к переводу
		Элементы[ЭлементКоличествоСделок].Доступность 	= Ложь;
		Элементы[ЭлементКоличествоСделок].ЦветТекста 	= Новый Цвет(239, 239, 239);			
		Элементы[ЭлементСуммаСделок].Заголовок 		= "0,00" + " " + СимвольныйКодЦелойчастиВалюты;
		Элементы[ЭлементСуммаСделок].Доступность 		= Ложь;			
	Иначе 
		Элементы[ЭлементКоличествоСделок].Заголовок 	= Формат(МассивСтрок[0].КоличествоСделок, "ЧДЦ=0; ЧН=0");// + " " + СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу("Сделка", МассивСтрок[0].КоличествоСделок); // подготовить к переводу
		Элементы[ЭлементКоличествоСделок].ЦветТекста 	= ?(МассивСтрок[0].КоличествоСделок > 0, Новый Цвет(), Новый Цвет(242, 242, 242));			
		Элементы[ЭлементКоличествоСделок].Доступность 	= ?(МассивСтрок[0].КоличествоСделок > 0, Истина, Ложь);
		Если СтрокаЭтапСделки.ЭтапСделки = Справочники.ЭтапыСделок.Успех Тогда 
			СуммаПродаж = 0;				
			СтрокаСуммаПродаж = ТаблицаПродажПоСделкам.Найти(СтрокаЭтапСделки.ВидСделки, "ВидСделки");
			Если СтрокаСуммаПродаж <> Неопределено Тогда 
				СуммаПродаж = ?(ЗначениеЗаполнено(СтрокаСуммаПродаж.СуммаПродаж), СтрокаСуммаПродаж.СуммаПродаж, 0);
			КонецЕсли;	
		Иначе
			СуммаПродаж = МассивСтрок[0].СуммаСделки;								
		КонецЕсли;	
		Элементы[ЭлементСуммаСделок].Заголовок 		= ?(СуммаПродаж > 0, Формат(СуммаПродаж, "ЧДЦ=1; ЧН=0"), "0,00") + " " + СимвольныйКодЦелойчастиВалюты;			
		Элементы[ЭлементСуммаСделок].Доступность 		= Ложь;									
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Обновить все сведения по сделкам
//
// Параметры:
//  ОтборСотрудники	 - 	 - 
//
Процедура ОбновитьВсеСведенияПоСделкам(ЗНАЧ ОтборСотрудники = Неопределено)
	
	ОбновитьОбщиеСведенияПоСделкам(ОтборСотрудники);
	ОбновитьСведенияПоСделкам(ОтборСотрудники);
	
КонецПроцедуры

&НаСервере
// Функция - Получить менеджеров отдела продаж
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьВсехМенеджеровОтделаПродаж()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата"			, ТекущаяДатаСеанса());	
	Запрос.УстановитьПараметр("ДатаНачало"			, НачалоДня(ОтборПериодЗначение.ДатаНачала));    
	Запрос.УстановитьПараметр("ДатаОкончание"		, КонецДня(ОтборПериодЗначение.ДатаОкончания));
		
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	СотрудникиМестаРаботы.Сотрудник КАК Сотрудник,
	               |	ИСТИНА КАК МенеджеровОтделаПродаж,
	               |	ЛОЖЬ КАК ИсполнителиЗадач
	               |ПОМЕСТИТЬ ТаблицаСотрудников
	               |ИЗ
	               |	РегистрСведений.НастройкиСотрудников КАК СотрудникиМестаРаботы
	               |ГДЕ
	               |	СотрудникиМестаРаботы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |	И ВЫБОР
	               |			КОГДА СотрудникиМестаРаботы.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ СотрудникиМестаРаботы.ДатаУвольнения > &ТекущаяДата
	               |		КОНЕЦ
	               |	И СотрудникиМестаРаботы.Сотрудник.ПометкаУдаления = ЛОЖЬ
	               |	И СотрудникиМестаРаботы.Сотрудник.ЭтоГруппа = ЛОЖЬ
	               |	И СотрудникиМестаРаботы.Сотрудник.Роль В (ЗНАЧЕНИЕ(Перечисление.РольПользователя.Регистратура), ЗНАЧЕНИЕ(Перечисление.РольПользователя.ГлавныйВрач), ЗНАЧЕНИЕ(Перечисление.РольПользователя.Врач), ЗНАЧЕНИЕ(Перечисление.РольПользователя.Управляющий))
	               |	И СотрудникиМестаРаботы.СтруктурнаяЕдиница.ПометкаУдаления = ЛОЖЬ
	               |	И СотрудникиМестаРаботы.СтруктурнаяЕдиница.ЭтоГруппа = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТаблицаСотрудников.Сотрудник КАК Сотрудник,
	               |	ТаблицаСотрудников.Сотрудник.НаименованиеСокращенное КАК Представление
	               |ИЗ
	               |	ТаблицаСотрудников КАК ТаблицаСотрудников
	               |ГДЕ
	               |	ТаблицаСотрудников.МенеджеровОтделаПродаж = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Представление
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТаблицаСотрудников.Сотрудник КАК Сотрудник,
	               |	ТаблицаСотрудников.Сотрудник.НаименованиеСокращенное КАК Представление
	               |ИЗ
	               |	ТаблицаСотрудников КАК ТаблицаСотрудников
	               |ГДЕ
	               |	ТаблицаСотрудников.ИсполнителиЗадач = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Представление
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТаблицаСотрудников.Сотрудник КАК Сотрудник,
	               |	ТаблицаСотрудников.Сотрудник.НаименованиеСокращенное КАК Представление
	               |ИЗ
	               |	ТаблицаСотрудников КАК ТаблицаСотрудников
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Представление";
	
	Если ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница) Тогда 
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, ОтборСтруктурнаяЕдиница);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СотрудникиМестаРаботы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "ИСТИНА");
	КонецЕсли; 
	
	ПакетТаблицМенеджеров 			= Запрос.ВыполнитьПакет();
	ТаблицаМенеджеровПродаж			= ПакетТаблицМенеджеров[1].Выгрузить();
	ТаблицаИсполнителейЗадач 		= ПакетТаблицМенеджеров[2].Выгрузить();
	ТаблицаМенеджеров 				= ПакетТаблицМенеджеров[3].Выгрузить();
	
	СписокМенеджеровПоПродажам.ЗагрузитьЗначения(ТаблицаМенеджеровПродаж.ВыгрузитьКолонку("Сотрудник"));
	СписокМенеджеровДляЗадач.ЗагрузитьЗначения(ТаблицаИсполнителейЗадач.ВыгрузитьКолонку("Сотрудник"));
	
	Если СписокМенеджеровПоПродажам.НайтиПоЗначению(ТекущийПользователь) = Неопределено Тогда
		СписокМенеджеровПоПродажам.Добавить(ТекущийПользователь);
	КонецЕсли;
	
	Если СписокМенеджеровДляЗадач.Количество() = 0 Тогда 
		СписокМенеджеровДляЗадач.ЗагрузитьЗначения(ТаблицаМенеджеровПродаж.ВыгрузитьКолонку("Сотрудник"));
	КонецЕсли;	
	
	Если СписокМенеджеровДляЗадач.НайтиПоЗначению(ТекущийПользователь) = Неопределено Тогда
		СписокМенеджеровДляЗадач.Добавить(ТекущийПользователь);
	КонецЕсли;
	
	Возврат ТаблицаМенеджеровПродаж;
	
КонецФункции	

&НаСервере
// Функция - Получить массив отобранных сотрудников
//
// Параметры:
//  ВсеВозможные - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивОтобранныхСотрудников(ВсеВозможные = Ложь, ВсеПриОтсутствииВыбранных = Ложь)

	Если ВсеВозможные Тогда 
		ОтборСотрудники = СписокМенеджеровПоПродажам.ВыгрузитьЗначения(); // УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники", Истина);
	Иначе 
		ОтборСотрудники = УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники");
		ОтборСотрудники = ?(ЗначениеЗаполнено(ОтборСотрудники), ОтборСотрудники, ?(ВсеПриОтсутствииВыбранных, СписокМенеджеровПоПродажам.ВыгрузитьЗначения(), Неопределено)); // УправлениеИнтерфейсамиСервер.ВсеЗначенияВыбораДинамическогоМеню(ЭтаФорма, "МенюОтборСотрудники", Истина));		
	КонецЕсли;
	
	Возврат ОтборСотрудники;
	
КонецФункции

&НаКлиенте
// Функция - Найти открытую форму
//
// Параметры:
//  ИмяФормы	 - 	 - 
//  Заголовок	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция НайтиОткрытуюФорму(ИмяФормы, Заголовок)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Открыта", Ложь); 
	
	// Получение всех открытых окон приложения
	ОкнаПриложения = ПолучитьОкна();
	Для Каждого ОкноПриложения Из ОкнаПриложения Цикл
		// Анализ заголовка окна
		Если ОкноПриложения.Заголовок = Заголовок Тогда
			// Получение формы
			НайденнаяФорма = ОкноПриложения.Содержимое[0];
			// Анализ реквизита формы
			Если НайденнаяФорма.ИмяФормы = ИмяФормы Тогда
				ПараметрыФормы.Вставить("Открыта"		, Истина);
				ПараметрыФормы.Вставить("ОкноПриложения", ОкноПриложения); 				
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, создает новую сделку клиенту.
//
Функция СоздатьСделку(ВидСделки, ОтборСтруктурнаяЕдиница = Неопределено)
			
	НоваяСделка = Справочники.Сделки.СоздатьЭлемент();		
	ПерыйЭтап 	= ПолучитьСтартовыйЭтапВидаСделкиНаСервере(ВидСделки);
	
	ДанныеЗаполнения = Новый Структура();
	ДанныеЗаполнения.Вставить("ВидСделки",          ВидСделки);
	ДанныеЗаполнения.Вставить("ЭтапСделки",         ПерыйЭтап);
	ДанныеЗаполнения.Вставить("ДатаСделки",         ТекущаяДатаСеанса());
	ДанныеЗаполнения.Вставить("СтруктурнаяЕдиница", ?(ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница), ОтборСтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница));
	
	НоваяСделка.Заполнить(ДанныеЗаполнения);
	
	Попытка
		
		НоваяСделка.Записать();
		Возврат НоваяСделка.Ссылка;
		
	Исключение		
	    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Не удалось создать сделку: ';en='Not succeeded create deal:'") + ОписаниеОшибки());	
	КонецПопытки;
		
КонецФункции

&НаКлиенте
Процедура ПоказатьИсториюВвода(Команда)
	
	// Восстановим историю поиска
	СпискиВыбораКлиентСервер.Загрузить("Обработка.РабочийСтол.Форма.ФормаМониторПриемов/ИсторияВводаПоиска", СписокВводимыхЗначений, Истина);
	Оповещение = Новый ОписаниеОповещения("ВыборРанееВводимогоЗначения", ЭтотОбъект,);
	ПоказатьВыборИзМеню(Оповещение, СписокВводимыхЗначений, Элементы.ПоказатьИсториюВвода);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборРанееВводимогоЗначения(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатВыбора.Значение) Тогда
		Элементы.ПоискКлиента.ОбновитьТекстРедактирования(); 
		Элементы.ПоискКлиента.ВыделенныйТекст = РезультатВыбора.Значение;
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти
