
#Область СлужебныеПроцедурыИФункции

// Функция - Найти создать документ справка в налоговую
//
// Параметры:
//  Прием			 - 	 - 
//  МассивПриемов	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция НайтиСоздатьДокументСправкаВНалоговую(Прием, МассивПриемов) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СправкаВНалоговуюПриемы.Ссылка КАК Справка
	|ИЗ
	|	Документ.СправкаВНалоговую.Приемы КАК СправкаВНалоговуюПриемы
	|ГДЕ
	|	СправкаВНалоговуюПриемы.Прием В(&Приемы)
	|	И СправкаВНалоговуюПриемы.Ссылка.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Справка");
	
	Запрос.УстановитьПараметр("Приемы", МассивПриемов);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Справка;
	Иначе
		
		ДанныеЗаполнения = Новый Структура("Прием, МассивПриемов", Прием[0], МассивПриемов);
		
		СправкаВНалоговую = Документы.СправкаВНалоговую.СоздатьДокумент();
		СправкаВНалоговую.Заполнить(ДанныеЗаполнения);
		СправкаВНалоговую.Записать(РежимЗаписиДокумента.Проведение);
		
		Возврат СправкаВНалоговую.Ссылка;
		
	КонецЕсли;
	
КонецФункции

&НаСервере       
// Функция получения медкарты по приему
Функция ПолучитьМедКартыКлиентаПоПриему(Прием, ВидМедкарты = Неопределено) Экспорт
	
	МассивМедКарт = Новый Массив;
	МассивМедКарт = Справочники.МедицинскиеКарты.ПолучитьМедКартыКлиента(Прием[0].Контрагент);
	Если МассивМедКарт.Количество() = 1 Тогда
		КартаКлиента = МассивМедКарт[0].Ссылка;
		Если Не ЗначениеЗаполнено(КартаКлиента.ВидМедицинскойКарты.ПечатнаяФорма) Тогда
			ВидМедКартыОбъект = КартаКлиента.ВидМедицинскойКарты.ПолучитьОбъект();
			ВидМедКартыОбъект.ПечатнаяФорма = Перечисления.ПечатныеФормыМедицинскихКарт.АмбулаторнаяКарта_043_У_А4;
			ВидМедКартыОбъект.Записать();	
		КонецЕсли;
	КонецЕсли; 
	
	Если ВидМедкарты <> Неопределено и ВидМедкарты = "МедицинскаяКартаОртодонтическогоПациента" И ЗначениеЗаполнено(МассивМедКарт) Тогда
		МассивМедКартОртодонт = Новый Массив;
		Для Каждого	Медкарта Из МассивМедКарт Цикл			
			Если Медкарта.ВидМедицинскойКарты = Справочники.ВидыМедицинскихКарт.МедКартаОртодонтическогоПациента Тогда				
				
				МассивМедКартОртодонт.Добавить(Медкарта);
			КонецЕсли;
		КонецЦикла;		
		МассивМедКарт = МассивМедКартОртодонт;		
	КонецЕсли;
	
	Возврат МассивМедКарт;	
	
КонецФункции

&НаСервере   
// Процедура создания медкарты.
//
Процедура СоздатьМедКарту(ДокСсылка, ВидМедкарты = Неопределено) Экспорт
	
	Прием = ДокСсылка[0].ПолучитьОбъект();	
	МедКартаОбъект = Справочники.МедицинскиеКарты.СоздатьЭлемент();
	
	Если ВидМедкарты = Неопределено Тогда
		МедКартаОбъект.ВидМедицинскойКарты = Справочники.ВидыМедицинскихКарт.ОсновнойВидМедицинскойКарты;	
	ИначеЕсли ВидМедкарты = "МедицинскаяКартаОртодонтическогоПациента" Тогда
		МедКартаОбъект.ВидМедицинскойКарты = Справочники.ВидыМедицинскихКарт.МедКартаОртодонтическогоПациента;
	КонецЕсли;                                                                                
	МедКартаОбъект.ДополнительныеСвойства.Вставить("ВладелецКартыНаименование", Прием.Контрагент);
	МедКартаОбъект.ВладелецКарты = Прием.Контрагент;
	МедКартаОбъект.Записать();
	Справочники.МедицинскиеКарты.УстановитьМестоположениеМедицинскойКарты(МедКартаОбъект.Ссылка, Справочники.Местоположения.ВКлинике);	
	Контрагент = Прием.Контрагент.ПолучитьОбъект();
	Контрагент.ТекущаяМедицинскаяКарта = МедКартаОбъект.Ссылка;
	Контрагент.Записать();  
	
КонецПроцедуры

#КонецОбласти

