
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ВСWallet", ЭтотОбъект.ВСWallet);
	
	Если Не ЗначениеЗаполнено(ВСWallet) Тогда
		ЭтотОбъект.ВСWallet = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.Wallet);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_команд_формы

&НаКлиенте
// Процедура, обработчик команды "Создать".
//
Процедура Создать(Команда)
	
	ОчиститьСообщения();
	
	Если ПроверитьЗаполнениеПереопределяемый() Тогда
		РезультатСоздания = СоздатьНумераторНаСервере();
		Если РезультатСоздания.Успешно Тогда
			ЭтаФорма.Закрыть();
			Оповестить("ОбновитьНумераторы");
		Иначе		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатСоздания.ОписаниеОшибки);	
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаСервере
// Функция, создает нумератор.
//
Функция СоздатьНумераторНаСервере()
	
	Возврат Справочники.Карты.СоздатьНумератор(ЭтотОбъект.ВСWallet, ЭтотОбъект.Название, ЭтотОбъект.Префикс, ЭтотОбъект.СтартовыйНомер, ЭтотОбъект.Формат);
	
КонецФункции

&НаКлиенте
// Функция, проверяет заполнение.
//
Функция ПроверитьЗаполнениеПереопределяемый()
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Название) Тогда
		ОписаниеОшибки = "Не заполнено наименование";
	ИначеЕсли Не ЗначениеЗаполнено(ЭтотОбъект.СтартовыйНомер) Тогда
		ОписаниеОшибки = "Не заполнен стартовый номер";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);	
	КонецЕсли;
	
	Возврат Не ЗначениеЗаполнено(ОписаниеОшибки);
	
КонецФункции

#КонецОбласти
