
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик создания формы на сервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;

	Если Объект.Ссылка.Пустая() Тогда 
		Элементы.ГруппаВыравнивание.ТолькоПросмотр = Ложь;
		Если НЕ ЗначениеЗаполнено(Объект.ВладелецБонусногоСчета) Тогда 
			Если Объект.Именной Тогда 
				Объект.ВладелецБонусногоСчета = Справочники.Контрагенты.ПустаяСсылка();
			Иначе 
				Объект.ВладелецБонусногоСчета = Справочники.Карты.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ДекорацияСрокДействияНеОграничен = НСтр("ru='Не ограничен';en='Not limited'");
	
	//// Создаем элемент существующих строк состава услуг
	// СоздатьЭлементыФормыСоставПакетаУслуг();
	
	ПостроитьТаблицуИсторииОбъекта2();
	
	УстановитьВидимостьЭлементов();
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаСервере
// Процедура, устанавливает видимость элементов формы.
//
// Параметры:
//  Нет.
//
Процедура УстановитьЗаголовокЭлементов()
	
	// Элементы.ГруппаШапка.Заголовок = Объект.Наименование;
	
	// -----------------------Настройка заголовка процента списания-----------------------
	ЗаголовокЭлемента = "";
	Если Объект.НеОграниченПроцентомСписания Тогда		
		ЗаголовокЭлемента = ЗаголовокЭлемента + НСтр("ru= 'Списание с бонусного счета не ограничено';en ='Withdrawal from a bonus account is not limited'");
	Иначе		
		ЗаголовокЭлемента = ?(Объект.ОграничениеСписанияПроцент = 0,
								ЗаголовокЭлемента + НСтр("ru= 'Списание с бонусного счета не ограничено';en ='Withdrawal from a bonus account is not limited'"),
								ЗаголовокЭлемента + НСтр("ru= 'Списание с бонусного счета ограничено ';en ='Withdrawal from a bonus account is limited '") + Строка(Объект.ОграничениеСписанияПроцент) + " %");		
	КонецЕсли;	
	Элементы.ГруппаОграничениеСписания.Заголовок = ЗаголовокЭлемента;
	
	// --------------------Настройка заголовка состава услуг вида ЛС---------------------
	ЗаголовокЭлемента = "";
	Если Объект.Предопределенный Тогда 
		ЗаголовокЭлемента = НСтр("ru= 'Не ограничен услугами';en ='Not limited to services'");
	КонецЕсли;

	// ------------------Настройка заголовка срок действия БС------------------
	
	ЗаголовокЭлемента = "";	
	Если Объект.СрокДействияНачало = Дата(1,1,1) И Объект.СрокДействияКонец = Дата(1,1,1) Тогда
		ЗаголовокЭлемента = ЗаголовокЭлемента + НСтр("ru= 'Срок действия бонусного счета не ограничен';en ='Validity of the bonus account is not limited'");
	Иначе 
		ЗаголовокЭлемента = ЗаголовокЭлемента + СтрШаблон(НСтр("ru = 'Бонусный счет действует с %1 по %2 ';en= 'Bonus account is valid from %1 to %2 '"), 
		                                                  Формат(Объект.СрокДействияНачало, СтрШаблон("ДФ=dd.MM.yyyy; ДП='%1'", НСтр("ru='(не заполнено)'; en='(not completed)'"))), 
		                                                  Формат(Объект.СрокДействияКонец, СтрШаблон("ДФ=dd.MM.yyyy; ДП='%1'", НСтр("ru='(не заполнено)'; en='(not completed)'"))));
	КонецЕсли;
													  
	Элементы.Группа_СрокДействияВидаБонусногоСчета.Заголовок = ЗаголовокЭлемента;

	ЗаголовокЭлемента = "";
	Если Объект.Закрыт Тогда 
		ЗаголовокЭлемента = ЗаголовокЭлемента + НСтр("ru= 'Срок действия бонусного счета истек. Счет деактивирован.';en ='The bonus account has expired. Account deactivated.'");
		Элементы.Группа_СрокДействияВидаБонусногоСчета.ЦветТекстаЗаголовка = Новый Цвет(255,0,0);
		Элементы.Группа_СрокДействияВидаБонусногоСчета.Заголовок = ЗаголовокЭлемента;	
	КонецЕсли;	
	
	// ------------------Настройка заголовка срок действия начислений вида БС------------------
	ЗаголовокЭлемента = "";
	Если Объект.ОграничениеНачисленийПоСрокуДействия = Перечисления.ТипыОграниченийСрокаДействия.Бессрочный Тогда
		ЗаголовокЭлемента = ЗаголовокЭлемента + НСтр("ru= 'Срок действия начислений не ограничен';en ='The term of the accruals is unlimited'");
	ИначеЕсли Объект.ОграничениеНачисленийПоСрокуДействия = Перечисления.ТипыОграниченийСрокаДействия.СрокОграниченПериодом Тогда
		ЗаголовокЭлемента = ЗаголовокЭлемента + НСтр("ru= 'Срок действия начислений - ';en ='Duration of accruals - '") + Объект.СрокДействияНачислений + " " + ВернутьСловоСклоненноеПоЧислу(Строка(Объект.СрокДействияНачисленийТип), Объект.СрокДействияНачислений);
	КонецЕсли;
	Элементы.ГруппаСрокДействияНачислений_ВертикальнаяЧерта.Заголовок = ЗаголовокЭлемента;
	
КонецПроцедуры

&НаСервере
// Процедура, устанавливает видимость элементов формы.
//
// Параметры:
//  Нет.
//
Процедура УстановитьВидимостьЭлементов()
	
	Если Объект.ВидБонусногоСчета.Именной = Истина Тогда
		
		Элементы.ДекорацияТипВладельца.Картинка  = БиблиотекаКартинок.ПерейтиКПользователю;
		Элементы.ДекорацияТипВладельца.Подсказка = НСтр("ru= 'Именной счет';en ='Personal account'");
		
	Иначе 
		
		Элементы.ДекорацияТипВладельца.Картинка  = БиблиотекаКартинок.ПластиковаяКартаОбновление;
		Элементы.ДекорацияТипВладельца.Подсказка = НСтр("ru= 'На предъявителя';en ='Bearer'");

	КонецЕсли;
	
	Если Объект.НеОграниченПроцентомСписания Тогда		
		Элементы.ОграничениеСписанияПроцент.Видимость 	= Ложь;
		Элементы.ДекорацияПроцент.Видимость 			= Ложь;		
	Иначе		
		Элементы.ОграничениеСписанияПроцент.Видимость 	= Истина;
		Элементы.ДекорацияПроцент.Видимость 			= Истина;		
	КонецЕсли;	
	
	// Бессрочный
	Если Объект.ОграничениеНачисленийПоСрокуДействия = Перечисления.ТипыОграниченийСрокаДействия.Бессрочный  Тогда 
		
		Элементы.ГруппаПараметрыСрокаДействияНачислений.Видимость = Ложь;
		
	// Срок ограничен периодом	
	ИначеЕсли Объект.ОграничениеНачисленийПоСрокуДействия = Перечисления.ТипыОграниченийСрокаДействия.СрокОграниченПериодом Тогда
		
		Элементы.ГруппаПараметрыСрокаДействияНачислений.Видимость = Истина;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СрокДействияНачало)
		ИЛИ ЗначениеЗаполнено(Объект.СрокДействияКонец) Тогда
		
		Элементы.СрокДействияНачало.Видимость = Истина;
		Элементы.СрокДействияКонец.Видимость  = Истина;
		Элементы.ДекорацияСрокДействияНеОграничен.Видимость = Ложь;
		
	Иначе
		
		Элементы.СрокДействияНачало.Видимость = Ложь;
		Элементы.СрокДействияКонец.Видимость  = Ложь;
		Элементы.ДекорацияСрокДействияНеОграничен.Видимость = Истина;

	КонецЕсли;

	УстановитьЗаголовокЭлементов();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура УстановитьЗаголовокЭлементовПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
	УстановитьЗаголовокЭлементов();	
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поля "Код".
//
Процедура КодПриИзменении(Элемент)
	Объект.Наименование = СформироватьНаименование(Объект.Код, Объект.ВидБонусногоСчета, Объект.ВладелецБонусногоСчета);
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ВидБонусногоСчетаПриИзменении".
//
Процедура ВидБонусногоСчетаПриИзменении(Элемент)
	
	ЗаполнитьНастройкиБСПоВидуБС();
	ЗаполнитьСрокДействияБСНаСеревере(Объект.ВидБонусногоСчета, Объект.ДатаОткрытия, Объект.СрокДействияНачало, Объект.СрокДействияКонец);	
	
	Объект.Наименование = СформироватьНаименование(Объект.Код, Объект.ВидБонусногоСчета, Объект.ВладелецБонусногоСчета);	
	
	ПерезаполнитьТаблицуСоставУслуг();
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ДатаОткрытияПриИзменении".
//
Процедура ДатаОткрытияПриИзменении(Элемент)

	ЗаполнитьСрокДействияБСНаСеревере(Объект.ВидБонусногоСчета, Объект.ДатаОткрытия, Объект.СрокДействияНачало, Объект.СрокДействияКонец);	
	УстановитьЗаголовокЭлементовПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ВладелецПриИзменении".
//
Процедура ВладелецПриИзменении(Элемент)
	
	Объект.Наименование = СформироватьНаименование(Объект.Код, Объект.ВидБонусногоСчета, Объект.ВладелецБонусногоСчета);	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ВладелецНачалоВыбора".
//
Процедура ВладелецНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВыбораВладельца", ЭтаФорма, Элемент);
	ФормаВыбора = ?(ТипЗнч(Объект.ВладелецБонусногоСчета) = Тип("СправочникСсылка.Контрагенты"), "Справочник.Контрагенты.ФормаВыбора", "Справочник.Карты.ФормаВыбора"); 
	ОткрытьФорму(ФормаВыбора, ,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ЗавершениеВыбораВладельца" подключаемый.
//
Процедура ЗавершениеВыбораВладельца(Результат, Параметры) Экспорт 
	
	Если ЗначениеЗаполнено(Результат) Тогда 
		Если НЕ Объект.ВладелецБонусногоСчета = Результат Тогда 
			Объект.ВладелецБонусногоСчета = Результат;
		КонецЕсли;
	КонецЕсли;
	
	ВладелецПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ОграничениеПоСрокуДействияПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура СрокДествияПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД_ФОРМы

// Процедура - Скрыть показать дополнительно
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура СкрытьПоказатьДополнительно(Команда)
	Элементы.ГруппаДополнительно.Видимость =  НЕ Элементы.ГруппаДополнительно.Видимость;
КонецПроцедуры

#КонецОбласти

#Область ИсторияОбъекта

&НаСервере
// Процедура - Построить таблицу истории объекта
//
Процедура ПостроитьТаблицуИсторииОбъекта()
	
	РезультатЗапроса    = Справочники.БонусныеСчета.ИсторияБонусногоСчета(Объект.Ссылка);				
	
	РезЗапросаВерхнийУр = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОстатокПоБс         = РегистрыНакопления.БонусныеСчета.ПолучитьОстатокНаБонусномСчетеВладельца(Объект.Ссылка);	
	
	Декорация                          = Элементы.Добавить("ДекорацияИсторияЗаголовокПериод", Тип("ДекорацияФормы"),  Элементы.ГруппаКнопки);
	Декорация.Заголовок                = НСтр("ru= 'Остаток';en ='Balance'");
	Декорация.Шрифт                    = Новый Шрифт(Декорация.Шрифт,,11);
	Декорация.ЦветТекста               = Новый Цвет(0,150,70);
	Декорация.АвтоМаксимальнаяШирина   = Ложь;
	Декорация.МаксимальнаяШирина       = 43;
	Декорация.РастягиватьПоГоризонтали = Истина;
	
	Декорация                           = Элементы.Вставить("ДекорацияИсторияЗаголовокСумма", Тип("ДекорацияФормы"),  Элементы.ГруппаСуммы);
	Декорация.Заголовок                 = Формат(ОстатокПоБс, "ЧЦ=15; ЧДЦ=2; ЧН=0,00");
	Декорация.Шрифт                     = Новый Шрифт(Декорация.Шрифт,,11);
	Декорация.ЦветТекста                = Новый Цвет(0,150,70);
	Декорация.Ширина                    = 8;
	Декорация.ГоризонтальноеПоложение   = ГоризонтальноеПоложениеЭлемента.Право;
	
	ИндексВерхУр = 0;
	Пока РезЗапросаВерхнийУр.Следующий() Цикл
			
		Декорация                          = Элементы.Вставить("ДекорацияИсторияДокНачисления_" + Формат(ИндексВерхУр, "ЧГ="), Тип("ДекорацияФормы"), Элементы.ГруппаКнопки);
		Декорация.Заголовок                = НаименованиеВерхнегоУзлаИстории(РезЗапросаВерхнийУр);
		Декорация.АвтоМаксимальнаяШирина   = Ложь;
		Декорация.МаксимальнаяШирина       = 25;
	
		Декорация                           = Элементы.Вставить("ДекорацияИсторияДокНачисленияСумма_" + Формат(ИндексВерхУр, "ЧГ="), Тип("ДекорацияФормы"), Элементы.ГруппаСуммы);
		Декорация.Заголовок                 = Формат(РезЗапросаВерхнийУр.Сумма, "ЧЦ=15; ЧДЦ=2; ЧН=0,00");
		Декорация.Ширина                    = 8;
		Декорация.ГоризонтальноеПоложение   = ГоризонтальноеПоложениеЭлемента.Право;
	
		РезЗапросаНижнийУр = РезЗапросаВерхнийУр.Выбрать();
		
		ИндексНижнУровня = 0;
		
		Пока РезЗапросаНижнийУр.Следующий() Цикл	
					
			СтрокаТ = ЭтотОбъект.ТаблицаИсторииОбъекта.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТ, РезЗапросаНижнийУр);

			ИдЭлементов = СтрЗаменить(Строка(СтрокаТ.ПолучитьИдентификатор()), Символы.НПП, "");
			
			ПодгруппаГруппаКнопки = Элементы.Добавить("ПодгруппаГруппаКнопки_" + ИдЭлементов, Тип("ГруппаФормы"),Элементы.ГруппаКнопки);
			ПодгруппаГруппаКнопки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ПодгруппаГруппаКнопки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			ПодгруппаГруппаКнопки.ОтображатьЗаголовок = Ложь;
			
			Декорация                          = Элементы.Вставить("ДекорацияИсторияСмещение_" + ИдЭлементов, Тип("ДекорацияФормы"), ПодгруппаГруппаКнопки);
			Декорация.Заголовок                = " ";
			Декорация.Ширина                   = 2;
						
			КомандаФормы          = ЭтаФорма.Команды.Добавить("КнопкаИсторияПериод_" + ИдЭлементов);
			КомандаФормы.Действие = "ОбработчикНажатияПоОперацииИстории";
			
			Кнопка                   = Элементы.Добавить("КнопкаИсторияПериод_" + ИдЭлементов, Тип("КнопкаФормы"),ПодгруппаГруппаКнопки);	
			Кнопка.Заголовок         = НаименованиеНижнегоУзлаИстории(РезЗапросаНижнийУр);
			Кнопка.ИмяКоманды        = КомандаФормы.Имя;	
			Кнопка.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет; 
			
			Декорация                           = Элементы.Вставить("ДекорацияИсторияСумма_" + ИдЭлементов, Тип("ДекорацияФормы"), Элементы.ГруппаСуммы);
			Декорация.Заголовок                 = Формат(РезЗапросаНижнийУр.Сумма, "ЧЦ=15; ЧДЦ=2; ЧН=-");
		    Декорация.Ширина                    = 8;
		    Декорация.ГоризонтальноеПоложение   = ГоризонтальноеПоложениеЭлемента.Право;
				
			ИндексНижнУровня = ИндексНижнУровня + 1;
			
		КонецЦикла;
		
		ИндексВерхУр = ИндексВерхУр + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура - Построить таблицу истории объекта
//
Процедура ПостроитьТаблицуИсторииОбъекта2()
	
	РезультатЗапроса    = Справочники.БонусныеСчета.ИсторияБонусногоСчета(Объект.Ссылка, Ложь);				
	ЭтотОбъект.ТаблицаИсторииОбъекта.Загрузить(РезультатЗапроса.Выгрузить());
	
	ОстатокПоБс         = РегистрыНакопления.БонусныеСчета.ПолучитьОстатокНаБонусномСчетеВладельца(Объект.Ссылка);	
	
	Группа_Строки_История = Элементы.Добавить("ГруппаКнопки_Строки_История", Тип("ГруппаФормы"), Элементы.ГруппаИстория);
	Группа_Строки_История.Вид 												= ВидГруппыФормы.ОбычнаяГруппа;
	Группа_Строки_История.Заголовок 										= Группа_Строки_История.Имя;
	Группа_Строки_История.Отображение 										= ОтображениеОбычнойГруппы.Нет;
	Группа_Строки_История.Группировка 										= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа_Строки_История.ОтображатьЗаголовок 								= Ложь;		
	Группа_Строки_История.ЦветФона 											= Новый Цвет(254,254,254);
	Группа_Строки_История.РастягиватьПоГоризонтали 							= Истина;
	// Группа_Строки_История.Высота 											= 1;
	// Группа_Строки_История.РастягиватьПоВертикали 							= Ложь;	
	Группа_Строки_История.ВертикальноеПоложениеПодчиненных					= ВертикальноеПоложениеЭлемента.Центр;
	Группа_Строки_История.ГоризонтальныйИнтервал 							= ИнтервалМеждуЭлементамиФормы.Нет;
	
	// Декорация                          			= Элементы.Добавить("ДекорацияИсторияЗаголовокПериод", Тип("ДекорацияФормы"),  Элементы.ГруппаКнопки);
	Декорация                          				= Элементы.Добавить("ДекорацияИсторияЗаголовокПериод", Тип("ДекорацияФормы"),  Группа_Строки_История);	
	Декорация.Заголовок                				= НСтр("ru= 'Остаток';en ='Balance'");
	Декорация.Шрифт                    				= Новый Шрифт(Декорация.Шрифт,,11);
	Декорация.ЦветТекста               				= Новый Цвет(25,116,206);
	Декорация.АвтоМаксимальнаяШирина   				= Ложь;
	Декорация.МаксимальнаяШирина       				= 0;
	Декорация.РастягиватьПоГоризонтали 				= Истина;
	Декорация.ГоризонтальноеПоложениеВГруппе 		= ГоризонтальноеПоложениеЭлемента.Лево;
	Декорация.ГоризонтальноеПоложение 				= ГоризонтальноеПоложениеЭлемента.Лево;
	Декорация.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
	Декорация.ВертикальноеПоложение 				= ВертикальноеПоложениеЭлемента.Центр;
	
	// Декорация                           			= Элементы.Вставить("ДекорацияИсторияЗаголовокСумма", Тип("ДекорацияФормы"),  Элементы.ГруппаСуммы);
	Декорация                           			= Элементы.Вставить("ДекорацияИсторияЗаголовокСумма", Тип("ДекорацияФормы"),  Группа_Строки_История);	
	Декорация.Заголовок                 			= Формат(ОстатокПоБс, "ЧЦ=15; ЧДЦ=2; ЧН=0,00");
	Декорация.Шрифт                     			= Новый Шрифт(Декорация.Шрифт,,11);
	Декорация.ЦветТекста                			= Новый Цвет(25,116,206);
	Декорация.Ширина                    			= 8;
	Декорация.ГоризонтальноеПоложениеВГруппе 		= ГоризонтальноеПоложениеЭлемента.Право;
	Декорация.ГоризонтальноеПоложение 				= ГоризонтальноеПоложениеЭлемента.Право;
	Декорация.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
	Декорация.ВертикальноеПоложение 				= ВертикальноеПоложениеЭлемента.Центр;
	
	// Декорация черта
	ДекорацияЧерта                           		= Элементы.Вставить("Декорация_Черта", Тип("ДекорацияФормы"), Элементы.ГруппаИстория);		
	ДекорацияЧерта.Заголовок                 		= "";
	ДекорацияЧерта.Шрифт                 			= Новый Шрифт(ДекорацияЧерта.Шрифт,,1);
	ДекорацияЧерта.Рамка                            = Новый Рамка(ТипРамкиЭлементаУправления.ЧертаСверху);
	ДекорацияЧерта.АвтоМаксимальнаяШирина 			= Ложь;
	ДекорацияЧерта.МаксимальнаяШирина       		= 0;
	ДекорацияЧерта.РастягиватьПоГоризонтали 		= Истина;
	
	Четная = Ложь;
	Для Каждого СтрокаТ ИЗ ЭтотОбъект.ТаблицаИсторииОбъекта Цикл
		Четная = НЕ Четная;
		ИдЭлементов = СтрЗаменить(Строка(СтрокаТ.ПолучитьИдентификатор()), Символы.НПП, "");
		
		Группа_Строки_История = Элементы.Добавить("Группа_Строки_История_" + ИдЭлементов, Тип("ГруппаФормы"), Элементы.ГруппаИстория);
		Группа_Строки_История.Вид 												= ВидГруппыФормы.ОбычнаяГруппа;
		Группа_Строки_История.Заголовок 										= Группа_Строки_История.Имя;
		Группа_Строки_История.Отображение 										= ОтображениеОбычнойГруппы.Нет;
		Группа_Строки_История.Группировка 										= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		Группа_Строки_История.ОтображатьЗаголовок 								= Ложь;		
		Группа_Строки_История.ЦветФона 											= ?(Четная, Новый Цвет(240,240,240), Новый Цвет(254,254,254));
		Группа_Строки_История.РастягиватьПоГоризонтали 							= Истина;
		// Группа_Строки_История.Высота 											= 1;
		// Группа_Строки_История.РастягиватьПоВертикали 							= Ложь;
		Группа_Строки_История.ВертикальноеПоложениеПодчиненных 					= ВертикальноеПоложениеЭлемента.Центр;
		Группа_Строки_История.ГоризонтальныйИнтервал 							= ИнтервалМеждуЭлементамиФормы.Нет;
		
		КомандаФормы          = ЭтаФорма.Команды.Добавить("КнопкаИсторияПериод_" + ИдЭлементов);
		КомандаФормы.Действие = "ОбработчикНажатияПоОперацииИстории";
		
		// Кнопка                  					= Элементы.Добавить("КнопкаИсторияПериод_" + ИдЭлементов, Тип("КнопкаФормы"), Элементы.ГруппаКнопки);
		Кнопка                   					= Элементы.Добавить("КнопкаИсторияПериод_" + ИдЭлементов, Тип("КнопкаФормы"), Группа_Строки_История);			
		Кнопка.Заголовок         					= НаименованиеЗаголовкаОперации(СтрокаТ);
		Кнопка.ИмяКоманды        					= КомандаФормы.Имя;	
		Кнопка.ОтображениеФигуры 					= ОтображениеФигурыКнопки.Нет;
		Кнопка.ГоризонтальноеПоложениеВГруппе 		= ГоризонтальноеПоложениеЭлемента.Лево;
		Кнопка.ВертикальноеПоложениеВГруппе 		= ВертикальноеПоложениеЭлемента.Центр;
		
		// Декорация                           		= Элементы.Вставить("ДекорацияИсторияСумма_" + ИдЭлементов, Тип("ДекорацияФормы"), Элементы.ГруппаСуммы);
		Декорация                           		= Элементы.Вставить("ДекорацияИсторияСумма_" + ИдЭлементов, Тип("ДекорацияФормы"), Группа_Строки_История);		
		Декорация.Заголовок                 		= Формат(СтрокаТ.Сумма, "ЧЦ=15; ЧДЦ=2; ЧН=-");
		Декорация.Ширина                    		= 8;
		// Декорация.Высота 							= 2;
		Декорация.ГоризонтальноеПоложениеВГруппе 	= ГоризонтальноеПоложениеЭлемента.Право;
		Декорация.ГоризонтальноеПоложение 			= ГоризонтальноеПоложениеЭлемента.Право;
		Декорация.ВертикальноеПоложениеВГруппе 		= ВертикальноеПоложениеЭлемента.Центр;
		Декорация.ВертикальноеПоложение 			= ВертикальноеПоложениеЭлемента.Центр;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция НаименованиеВерхнегоУзлаИстории(СтрокаИстории)

   Возврат "" + Формат(СтрокаИстории.СуммаНачисления, "ЧЦ=15; ЧДЦ=2; ЧН=0,00") +
		ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти() +
  		 ?(ЗначениеЗаполнено(СтрокаИстории.ДокументНачисления), НСтр("ru= ' от ';en= ' from '") + Формат(СтрокаИстории.ДокументНачисления.Дата,"ДФ=dd.MM.yyyy"), "");	

КонецФункции

&НаСервере
// Функция - Наименование заголовка операции
//
// Параметры:
//  СтрокаИстории	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция НаименованиеНижнегоУзлаИстории(СтрокаИстории)
	
	Возврат Формат(СтрокаИстории.Период,"ДФ=dd.MM.yyyy") + " "  + СтрокаИстории.Операция;	
	
КонецФункции

&НаСервере
// Функция - Наименование заголовка операции
//
// Параметры:
//  СтрокаИстории	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция НаименованиеЗаголовкаОперации(СтрокаИстории)
	
	Возврат Формат(СтрокаИстории.Период, "ДФ='dd.MM.yyyy  :  HH:mm'") + "       "  + СтрокаИстории.Операция;	
	
КонецФункции

&НаКлиенте
// Процедура, обработчик события нажатия кнопок.
//
Процедура ОбработчикНажатияПоОперацииИстории(Элемент)
	
	Идентификатор = ИдентификаторСтрокиДанныхПоИмениЭлемента(Элемент.Имя);
	ПоказатьЗначение(, ЭтотОбъект.ТаблицаИсторииОбъекта.НайтиПоИдентификатору(Идентификатор).Регистратор);
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
// Функция вернет идентификатор строки данных по имени элемента
//
Функция ИдентификаторСтрокиДанныхПоИмениЭлемента(ИмяЭлемента)
	
	НомерСимвола = Найти(ИмяЭлемента,"_");
	Возврат Число(Прав(ИмяЭлемента,СтрДлина(ИмяЭлемента) - НомерСимвола)); 
	
КонецФункции

&НаКлиенте
// Процедура, заполняет срок действия ЛС.
//
Процедура ЗаполнитьНастройкиБСПоВидуБС()
	
	СтруктураНастроекБС = Новый Структура;
	ПолучитьСтруктуруНастроекВидаБонусногоСчетаНаСервере(Объект.ВидБонусногоСчета, СтруктураНастроекБС);	
	ЗаполнитьЗначенияСвойств(Объект, СтруктураНастроекБС);
	Если Объект.Именной Тогда 
		Объект.ВладелецБонусногоСчета = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	Иначе 
		Объект.ВладелецБонусногоСчета = ПредопределенноеЗначение("Справочник.Карты.ПустаяСсылка");
	КонецЕсли;	
	// ЗаполнитьСрокДействияБСНаСеревере(Объект.ВидБонусногоСчета, Объект.ДатаОткрытия, Объект.СрокДействияНачало, Объект.СрокДействияКонец)

КонецПроцедуры

&НаСервере
// Процедура, возвращает ТЗ.
//
Процедура  ПерезаполнитьТаблицуСоставУслуг()
	
	Объект.Удалить_ПакетУслугСоставУслуг.Загрузить(Объект.ВидБонусногоСчета.ПакетУслугСоставУслуг.Выгрузить());
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, заполняет срок действия ЛС.
//
Процедура ПолучитьСтруктуруНастроекВидаБонусногоСчетаНаСервере(Знач ВидБонусногоСчета, СтруктураНастроекБС)
	
	Справочники.ВидыБонусныхСчетов.ПолучитьСтруктуруНастроекВидаБонусногоСчета(ВидБонусногоСчета, СтруктураНастроекБС);
	 
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, заполняет срок действия ЛС.
//
Процедура ЗаполнитьСрокДействияБСНаСеревере(Знач ВидБонусногоСчета, Знач ДатаОткрытия, СрокДействияНачало, СрокДействияКонец)
	
	Справочники.БонусныеСчета.ЗаполнитьСрокДействияБонусногоСчета(ВидБонусногоСчета, ДатаОткрытия, СрокДействияНачало, СрокДействияКонец);
	 
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, заполняет наименование ЛС.
//
функция СформироватьНаименование(Знач Код, Знач ВидБонусногоСчета, Знач ВладелецБонусногоСчета)
	
	Возврат Справочники.БонусныеСчета.СформироватьНаименование(Код, ВидБонусногоСчета, ВладелецБонусногоСчета);
	
КонецФункции

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура УстановитьВидимостьЭлементовПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
	УстановитьВидимостьЭлементов();	
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает текстовое представления графикаработы салона
//
Функция ВернутьСловоСклоненноеПоЧислу(Слово, Число) 
	
	Если Ост(Число, 10) = 1 И Ост(Число, 100) <> 11 Тогда
		ИндексСклоненияПоЧислу = 1;
	ИначеЕсли Ост(Число, 10) >= 2 И Ост(Число, 10) <= 4 Тогда
		ИндексСклоненияПоЧислу = 2;
	Иначе
		ИндексСклоненияПоЧислу = 5;
	КонецЕсли;
	
	СоответствиеПоЧислам = Новый Соответствие;
	Если Слово = "День" Тогда
		СоответствиеПоЧислам.Вставить(1, НСтр("ru= 'день';en ='day'"));
		СоответствиеПоЧислам.Вставить(2, НСтр("ru= 'дня';en ='days'"));
		СоответствиеПоЧислам.Вставить(5, НСтр("ru= 'дней';en ='days'"));
	ИначеЕсли Слово = "Месяц" Тогда
		СоответствиеПоЧислам.Вставить(1, НСтр("ru= 'месяц';en ='month'"));
		СоответствиеПоЧислам.Вставить(2, НСтр("ru= 'месяца';en ='months'"));
		СоответствиеПоЧислам.Вставить(5, НСтр("ru= 'месяцев';en ='months'"));
	ИначеЕсли Слово = "Год" Тогда
		СоответствиеПоЧислам.Вставить(1, НСтр("ru= 'год';en ='year'"));
		СоответствиеПоЧислам.Вставить(2, НСтр("ru= 'года';en ='years'"));
		СоответствиеПоЧислам.Вставить(5, НСтр("ru= 'лет';en ='years'"));		
	ИначеЕсли Слово = "Услуга" Тогда
		СоответствиеПоЧислам.Вставить(1, НСтр("ru= 'услуга';en ='service'"));
		СоответствиеПоЧислам.Вставить(2, НСтр("ru= 'услуги';en ='services'"));
		СоответствиеПоЧислам.Вставить(5, НСтр("ru= 'услуг';en ='services'"));
	ИначеЕсли Слово = "Минут" Тогда
		СоответствиеПоЧислам.Вставить(1, НСтр("ru= 'минута';en ='minute'"));
		СоответствиеПоЧислам.Вставить(2, НСтр("ru= 'минуты';en ='minutes'"));
		СоответствиеПоЧислам.Вставить(5, НСтр("ru= 'минут';en ='minutes'"));		
	ИначеЕсли Слово = "Раз" Тогда
		СоответствиеПоЧислам.Вставить(1, НСтр("ru= 'раз';en ='once'"));
		СоответствиеПоЧислам.Вставить(2, НСтр("ru= 'раза';en ='times'"));
		СоответствиеПоЧислам.Вставить(5, НСтр("ru= 'раз';en ='times'"));
	ИначеЕсли Слово = "Посещение" Тогда
		СоответствиеПоЧислам.Вставить(1, НСтр("ru= 'посещение';en ='visit'"));
		СоответствиеПоЧислам.Вставить(2, НСтр("ru= 'посещения';en ='visits'"));
		СоответствиеПоЧислам.Вставить(5, НСтр("ru= 'посещений';en ='visits'"));
	КонецЕсли;
		
	Возврат Строка(СоответствиеПоЧислам.Получить(ИндексСклоненияПоЧислу));
	
КонецФункции

#КонецОбласти
