
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("МассивДокументов") Тогда
		МассивДокументовНаВыделение = Параметры.МассивДокументов;	
	КонецЕсли;
	
	ЭтотОбъект.ТолькоПроведенныеДокументы = ?(Параметры.Свойство("ТолькоПроведенныеДокументы"), Параметры.ТолькоПроведенныеДокументы, Ложь);  //?((Параметры.Свойство("ТолькоПроведенныеДокументы") = Истина), Истина, Ложь);
	
	Если Параметры.Свойство("Контрагент") Тогда
		ЭтотОбъект.Пациент = Параметры.Контрагент;
		ЭтаФорма.Заголовок = "Выбор документов приема, пациент: " + ЭтотОбъект.Пациент;
		ЗаполнитьТаблицуСПриемами(ЭтотОбъект.Пациент, МассивДокументовНаВыделение, ЭтотОбъект.ТолькоПроведенныеДокументы);
	Иначе
		Элементы.ГруппаШапка.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - Пациент при изменении
//
Процедура ПациентПриИзменении(Элемент)
	
	ЗаполнитьТаблицуСПриемами(ЭтотОбъект.Пациент, Неопределено, ЭтотОбъект.ТолькоПроведенныеДокументы); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПациентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ДанныеВыбора = ОбщегоНазначенияСтоматология.НайтиКонтрагентовПоСтроке(Текст, , Истина, Истина,,,,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПациентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		ЭтотОбъект.Пациент = ВыбранноеЗначение;
	    ЗаполнитьТаблицуСПриемами(ЭтотОбъект.Пациент, Неопределено, ЭтотОбъект.ТолькоПроведенныеДокументы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПациентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИскомыйКлиент = Текст;	
	ДанныеВыбора = ОбщегоНазначенияСтоматология.НайтиКонтрагентовПоСтроке(Текст, 10, Истина, Истина,,,,, Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Выбрать документы для печати
//
Процедура ВыбратьДокументы(Команда)
	
	ВыбранныеСтроки = СписокПриемов.НайтиСтроки(Новый Структура("ПризнакВыбора", Истина));	
	
	Если ВыбранныеСтроки.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	Если СписокПриемов.Количество() = ВыбранныеСтроки.Количество() Тогда
		МассивВыбранныхДокументов = ВыгрузитьКолонкуСПриемами();
	Иначе
		
		МассивВыбранныхДокументов = Новый Массив;
		Для каждого ДокПрием Из ВыбранныеСтроки Цикл
			МассивВыбранныхДокументов.Добавить(ДокПрием.ПриемСсылка);		
		КонецЦикла;
		
	КонецЕсли;
	
	Закрыть(МассивВыбранныхДокументов);
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Установить/Снять галочки со всех элементов таблицы
//
Процедура ГалочкиУстановитьСнятьВсе(Команда)
	
	СостояниеВыбора = ?(ТекущийЭлемент.Имя = "СписокСнятьГалочкиВсе", Ложь, Истина);
	
	Для Каждого ЭлементТаблицы Из СписокПриемов Цикл
		ЭлементТаблицы.ПризнакВыбора = СостояниеВыбора;		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Функция - Выгрузить колонку с приемами
// 
// Возвращаемое значение: Массив, содержащий приемы пациента
//   - 
//
Функция ВыгрузитьКолонкуСПриемами()
	
	ТЗ_СписокПриемов = РеквизитФормыВЗначение("СписокПриемов");
	Возврат( ТЗ_СписокПриемов.ВыгрузитьКолонку("ПриемСсылка") );
	
КонецФункции

&НаСервере
// Процедура - Заполнить таблицу с приемами
//
Процедура ЗаполнитьТаблицуСПриемами(Контрагент, МассивОбъектовНаВыделение, ТолькоПроведенные)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Прием.Ссылка КАК Ссылка,
		|	Прием.Дата КАК Дата
		|ИЗ
		|	Документ.Прием КАК Прием
		|ГДЕ
		|	НЕ Прием.ПометкаУдаления
		|	И &УсловиеТолькоПроведенные
		|	И Прием.Контрагент = &Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	УсловиеТолькоПроведенные	= ?(ТолькоПроведенные, "И Прием.Проведен", "");
	Запрос.Текст				= СтрЗаменить(Запрос.Текст, "И &УсловиеТолькоПроведенные", УсловиеТолькоПроведенные);
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ИскатьВМассиве = ?(ЗначениеЗаполнено(МассивОбъектовНаВыделение), Истина, Ложь);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ЭтотОбъект.СписокПриемов.Добавить();
		НоваяСтрока.ПриемСсылка = ВыборкаДетальныеЗаписи.Ссылка;
		
		Если ИскатьВМассиве Тогда
			РезультатПоискаСсылкиВМассиве = МассивОбъектовНаВыделение.Найти(ВыборкаДетальныеЗаписи.Ссылка);
			Если НЕ РезультатПоискаСсылкиВМассиве = Неопределено Тогда
				НоваяСтрока.ПризнакВыбора = Истина;			
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
