
#Область ОбработчикиСобытийФормы 

&НаКлиенте
// Процедура, обработчик события "ПередНачаломДобавления"
//
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля СтрЕдиницаОтбор
//
Процедура СтрЕдиницаОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтрЕдиницаОтбор, ЗначениеЗаполнено(СтрЕдиницаОтбор));
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля СкладОтбор
//
Процедура СкладОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Склад", СкладОтбор, ЗначениеЗаполнено(СкладОтбор));
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля КонтрагентОтбор
//
Процедура КонтрагентОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", КонтрагентОтбор, ЗначениеЗаполнено(КонтрагентОтбор));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрЕдиницаОтбор = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтрЕдиницаОтбор, ЗначениеЗаполнено(СтрЕдиницаОтбор));
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды "ВозвратОплаты".
//
Процедура ВозвратОплаты(Команда)
		
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;	
	Если НЕ ТекущиеДанные = Неопределено Тогда		
		Если ТекущиеДанные.Проведен Тогда
			
			Если ЗначениеЗаполнено(ТекущиеДанные.НомерЧекаККМ) Тогда
				ПоказатьПредупреждение(, "Документ уже пробит на фискальном регистраторе! Номер чека:" + ТекущиеДанные.НомерЧекаККМ);
				Возврат;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ТекущиеДанные.Касса) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена касса!");
				Возврат;
			КонецЕсли;
				
			ПараметрыОплаты = Новый Структура;
			ПараметрыОплаты.Вставить("СтруктурнаяЕдиница"                , ТекущиеДанные.СтруктурнаяЕдиница);
			ПараметрыОплаты.Вставить("Касса"                             , ТекущиеДанные.Касса);
			ПараметрыОплаты.Вставить("ДатаПродажи"                       , ТекущиеДанные.Дата);
			ПараметрыОплаты.Вставить("ВидОперации"                       , ПредопределенноеЗначение("Перечисление.ВидыОпераций.Возврат"));
			ПараметрыОплаты.Вставить("Контрагент"                        , ТекущиеДанные.Контрагент);
			ПараметрыОплаты.Вставить("ДокументыПродажи"                  , ТекущиеДанные.Ссылка);
			ПараметрыОплаты.Вставить("ЗакрытьФормуАвтоматически"         , Истина);
			
			ОткрытьФорму("Обработка.ПомощникПроведенияОплаты.Форма.ФормаОплаты", ПараметрыОплаты,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
			
		Иначе
			ПоказатьПредупреждение(,"Предварительно необходимо провести документ!");
		КонецЕсли;		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти