
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Дата = ТекущаяДата();
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	
	СуммаОплачено = 0;
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

// Обработчик после записи объекта
//
Процедура ПриЗаписи(Отказ)	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Синхронизация суммы оплачено с суммой док. поступления
	ДокПоступления = Документы.Поступление.ПолучитьДокПоступленияПоДокЗаказа(Ссылка);
	Если ЗначениеЗаполнено(ДокПоступления) И ДокПоступления.СуммаОплачено <> СуммаОплачено Тогда
		ДокОбъект               = ДокПоступления.ПолучитьОбъект();
		ДокОбъект.СуммаОплачено = СуммаОплачено;
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;		
КонецПроцедуры

//
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка табличной части на разрешения по значениям 
	Если ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьНулевуюСумму, Ложь) Тогда
		УдаляемыйЭлемент = ПроверяемыеРеквизиты.Найти("Запасы.Сумма");
		Если УдаляемыйЭлемент <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(УдаляемыйЭлемент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

