
#Область СлужебныйПрограммныйИнтерфейс

// Процедура рассчитывает скидки в документе.
//
// Параметры:
//  ДокументОбъект             - документ, для которого рассчитываем скидки,
//  ТабличнаяЧастьНоменклатуры - табличная часть номенклатуры документа,
//  ТабличнаяЧастьСкидки       - табличная часть скидок,
//  СтруктураПараметров        - структура, содержащая дополнительные параметря, необходимые для расчета скидок.
//
Процедура РассчитатьСкидкиПриПродаже(
	ДокументОбъект,
	ИмяТабличнойЧастиЗапасы			= Неопределено, 
	ИмяТабличнойЧастиЛечение		= Неопределено, 
	ИмяТабличнойЧастиУслуги			= Неопределено, 
	ИмяТЧСкидки,
	ИмяТЧПодарки,
	ТаблицаОплатыБонусами			= Неопределено, 
	ТаблицаПредыдщееСостояниеСкидок = Неопределено,
	СтруктураПараметров) Экспорт

	Перем ДатаСкидок;
	Перем ТаблицаСкидокЗаменяемая;
	
	Если СтруктураПараметров = Неопределено Тогда
		СтруктураПараметров = Новый Структура;
	КонецЕсли;
	
	ЭтоНарядЗаказ = СтруктураПараметров.Свойство("ЭтоНарядЗаказ");
	
	Если Не ЗначениеЗаполнено(ИмяТабличнойЧастиЗапасы)
		И Не ЗначениеЗаполнено(ИмяТабличнойЧастиЛечение)
		И Не ЗначениеЗаполнено(ИмяТабличнойЧастиУслуги) Тогда
		
		Возврат;
	КонецЕсли;	

	// не пересчитываем автоматические скидки в документах, которые были ранее оплачены
	Если НЕ СтруктураПараметров.Свойство("ОплатаБонуснымСчетом")
		И ДокументОбъект.Метаданные().Реквизиты.Найти("СуммаОплачено") <> Неопределено
		И ДокументОбъект.СуммаОплачено <> 0 Тогда 
		
		// Возврат;
	КонецЕсли;
		
	// Подготовка дополнительных параметров
	Если СтруктураПараметров.Свойство("ДатаСкидок") = Ложь Тогда
		Если ЗначениеЗаполнено(ДокументОбъект.Дата) Тогда
			СтруктураПараметров.Вставить("ДатаСкидок", ДокументОбъект.Дата);
		Иначе
			СтруктураПараметров.Вставить("ДатаСкидок", ТекущаяДатаСеанса());
		КонецЕсли;
	КонецЕсли;    
	
	Если СтруктураПараметров.Свойство("ДатаСкидок") 
		И СтруктураПараметров.ДатаСкидок > ДокументОбъект.Дата Тогда
		
		СтруктураПараметров.ДатаСкидок = ДокументОбъект.Дата;
		
	КонецЕсли;
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	Если ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("СтруктурнаяЕдиница", МетаданныеДокумента) Тогда
		СтруктурнаяЕдиница = ДокументОбъект.СтруктурнаяЕдиница;
	ИначеЕсли ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("Касса", МетаданныеДокумента) Тогда
		СтруктурнаяЕдиница = ДокументОбъект.Касса.СтруктурнаяЕдиница;
	ИначеЕсли ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("Склад", МетаданныеДокумента) Тогда
		СтруктурнаяЕдиница = ДокументОбъект.Склад.СтруктурнаяЕдиница;
	КонецЕсли;

	СтруктураПараметров.Вставить("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);	
	СтруктураПараметров.Вставить("Организация"			, Справочники.Организации.ПустаяСсылка());
	
	МассивНеИспользуемыхСкидок = Новый Массив;
	Если ИмяТЧСкидки <> "" Тогда
		Для Каждого СтрокаТЧ Из ДокументОбъект[ИмяТЧСкидки] Цикл 
			Если СтрокаТЧ.Использование = Ложь Тогда 
				МассивНеИспользуемыхСкидок.Добавить(СтрокаТЧ.СкидкаНаценка);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
	СтруктураПараметров.Вставить("МассивНеиспользуемыхСкидок", МассивНеИспользуемыхСкидок);

	// Подготовка ТЧ объекта
	Если ИмяТЧСкидки <> "" Тогда
		ДокументОбъект[ИмяТЧСкидки].Очистить();
	КонецЕсли;
	
	Если ИмяТЧПодарки <> "" Тогда
		ДокументОбъект[ИмяТЧПодарки].Очистить();
	КонецЕсли;

	Если ТаблицаПредыдщееСостояниеСкидок = Неопределено Тогда
		ТаблицаПредыдщееСостояниеСкидок = Новый ТаблицаЗначений;
		ТаблицаПредыдщееСостояниеСкидок.Колонки.Добавить("КлючСтроки"	, Новый ОписаниеТипов("УникальныйИдентификатор"));
		ТаблицаПредыдщееСостояниеСкидок.Колонки.Добавить("Использование", Новый ОписаниеТипов("Булево"));
		ТаблицаПредыдщееСостояниеСкидок.Колонки.Добавить("СкидкаНаценка", Новый ОписаниеТипов("СправочникСсылка.СкидкиНаценки"));
		ТаблицаПредыдщееСостояниеСкидок.Колонки.Добавить("Номенклатура" , Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	КонецЕсли;

	Если ЗначениеЗаполнено(ИмяТабличнойЧастиЗапасы) Тогда
		Для Каждого СтрокаТЧ Из ДокументОбъект[ИмяТабличнойЧастиЗапасы] Цикл
			
			СтрокаТЧ.ПроцентСкидкиНаценки				= 0;
			СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки	= 0;
			СтрокаТЧ.Сумма								= СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок;
			СтрокаТЧ.Всего								= СтрокаТЧ.Сумма; 
			
			Если ЭтоНарядЗаказ = Истина Тогда
				СтрокаТЧ.СуммаПродажи					= СтрокаТЧ.ЦенаПродажи * СтрокаТЧ.КоличествоУпаковок;
				СтрокаТЧ.ВсегоПродажи					= СтрокаТЧ.СуммаПродажи; 	
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяТабличнойЧастиЛечение) Тогда
		ЕстьКоличествоУпаковокВТЧЛечение = ДокументОбъект.Ссылка.Метаданные().ТабличныеЧасти.Лечение.Реквизиты.Найти("КоличествоУпаковок") <> Неопределено;
		Для Каждого СтрокаТЧ Из ДокументОбъект[ИмяТабличнойЧастиЛечение] Цикл
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТЧ, "Рекламация") 
				И ЗначениеЗаполнено(СтрокаТЧ.Рекламация) Тогда
				Продолжить;
			КонецЕсли; 
			
			СтрокаТЧ.ПроцентСкидкиНаценки				= 0;
			СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки	= 0;
			СтрокаТЧ.Сумма								= СтрокаТЧ.Цена * ?(ЕстьКоличествоУпаковокВТЧЛечение = Истина, СтрокаТЧ.КоличествоУпаковок, СтрокаТЧ.Количество);
			СтрокаТЧ.Всего								= СтрокаТЧ.Сумма;
		КонецЦикла;
	КонецЕсли;

	Если ЗначениеЗаполнено(ИмяТабличнойЧастиУслуги) Тогда
		Для Каждого СтрокаТЧ Из ДокументОбъект[ИмяТабличнойЧастиУслуги] Цикл
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТЧ, "Рекламация") 
				И ЗначениеЗаполнено(СтрокаТЧ.Рекламация) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТЧ.ПроцентСкидкиНаценки				= 0;
			СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки	= 0;
			СтрокаТЧ.Сумма								= СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок;
			СтрокаТЧ.Всего								= СтрокаТЧ.Сумма;
		КонецЦикла;
	КонецЕсли;
	
	РазрешитьСкидки = ВернутьПризнакДоступностиСкидок(ДокументОбъект);
	Если РазрешитьСкидки = Ложь Тогда 	
		Если ИмяТЧСкидки <> "" Тогда
			ДокументОбъект[ИмяТЧСкидки].Очистить();
		КонецЕсли;
		Возврат;
	КонецЕсли;

	// Получаем действующие применяемые скидки
	ТаблицаСкидок = ЗапросПоСкидкам(
			ДокументОбъект,
			?(ЗначениеЗаполнено(ИмяТабличнойЧастиЗапасы) , ДокументОбъект[ИмяТабличнойЧастиЗапасы] , Неопределено),
			?(ЗначениеЗаполнено(ИмяТабличнойЧастиЛечение), ДокументОбъект[ИмяТабличнойЧастиЛечение], Неопределено),
			?(ЗначениеЗаполнено(ИмяТабличнойЧастиУслуги) , ДокументОбъект[ИмяТабличнойЧастиУслуги] , Неопределено),
			СтруктураПараметров,
			ТаблицаОплатыБонусами);
			
	// Расчитываем сумму скидки и заполняем нову цену по номенклатуре
	РасчитатьСуммуСкидкиИНовыеЦеныНоменклатурыНаСкидкиПоВидуЦен(ТаблицаСкидок, СтруктураПараметров);
	
	// Высчитываем сумму скидки назначенну суммой или процентом (!!! ориентировочно, далее вытеснением сумма может измениться если вид умножение или превышенна граница скидки)
	РаспределитьСкидкуСуммойПроцентомПоНоменклатуре(ТаблицаСкидок, СтруктураПараметров);

	// Высчитываем сумму скидки на документ по позиции номенклатуры
	РаспределитьСкидкуНаДокументПоНоменклатуре(
		ТаблицаСкидок, 
		?(ЗначениеЗаполнено(ИмяТабличнойЧастиЗапасы) , ДокументОбъект[ИмяТабличнойЧастиЗапасы] , Неопределено),
		?(ЗначениеЗаполнено(ИмяТабличнойЧастиЛечение), ДокументОбъект[ИмяТабличнойЧастиЛечение], Неопределено),
		?(ЗначениеЗаполнено(ИмяТабличнойЧастиУслуги) , ДокументОбъект[ИмяТабличнойЧастиУслуги] , Неопределено),
		СтруктураПараметров);

	// Высчитываем количество подарков, их стоимость и удаляем те, на которых комплект не полный.
	ОпределитьКоличествоСтоимостьПодарков(
		ТаблицаСкидок, 
		?(ЗначениеЗаполнено(ИмяТабличнойЧастиЗапасы) , ДокументОбъект[ИмяТабличнойЧастиЗапасы] , Неопределено),
		?(ЗначениеЗаполнено(ИмяТабличнойЧастиЛечение), ДокументОбъект[ИмяТабличнойЧастиЛечение], Неопределено),
		?(ЗначениеЗаполнено(ИмяТабличнойЧастиУслуги) , ДокументОбъект[ИмяТабличнойЧастиУслуги] , Неопределено),
		СтруктураПараметров,
		ДокументОбъект);	

	// Высчитываем количество выдачи карт, их стоимость и удаляем те, на которых комплект не полный.
	ОпределитьКоличествоВыдачиКарт(ТаблицаСкидок, СтруктураПараметров);	
	
	// Дополняем массив неиспользуемых скидок, которые по умолчанию отключены
	Если ИмяТЧСкидки <> "" Тогда
		Для каждого СтрокаТЗСкидок Из ТаблицаСкидок Цикл
			
			Если СтрокаТЗСкидок.СкидкаНаценка.ПризнакИспользованиеНаУсмотрение = Истина Тогда // Значит могут быть выклчены или не вклчены
				
				Если ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() > 0 // Эта скидка была раньше, значит берем ее состояние, если использование = ложь, пропускаем
					И ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, Использование, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, Ложь, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() > 0
					ИЛИ ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() = 0
					И СтрокаТЗСкидок.СкидкаНаценка.ПризнакИспользованиеВыклПоУмолчанию = Истина Тогда // Ранее не использовалась, 
					
					СтрокаТЗСкидок.ПредыдщееСостояниеИспользование = Ложь;
				Иначе
					СтрокаТЗСкидок.ПредыдщееСостояниеИспользование = Истина;
					
					Если СтруктураПараметров.МассивНеиспользуемыхСкидок.Найти(СтрокаТЗСкидок.СкидкаНаценка) = Неопределено Тогда 
						СтруктураПараметров.МассивНеиспользуемыхСкидок.Добавить(СтрокаТЗСкидок.СкидкаНаценка);
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				СтрокаТЗСкидок.ПредыдщееСостояниеИспользование = Истина;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;

	// Расчет скидок и применяем вытеснение скидок по группам (автоматические скидки, согласно маркетинговым акциям)
	РасчитатьПрименитьВытеснениСложныхСкидокПоГруппам(ТаблицаСкидок, СтруктураПараметров, "ТолькоСкидки");

	// Добавляем погашение суммы бонусами и пересчитываем сумму бонусов.
	Если ТаблицаОплатыБонусами <> Неопределено Тогда
		
		ТаблицаСкидокВрем = ТаблицаСкидок.СкопироватьКолонки("НомерСтроки, КлючСтроки, СкидкаНаценка, Номенклатура, БонусныйСчет, ПризнакОплатыБонусом, СуммаСкидки, Контрагент");
		ТаблицаСкидокВрем.Колонки.Номенклатура.Имя	= "НоменклатураСкидки";
		ТаблицаСкидокВрем.Колонки.СуммаСкидки.Имя	= "Сумма";
		Для Каждого СтрокаТЗСкидок Из ТаблицаСкидок Цикл
			Если СтрокаТЗСкидок.ПредыдщееСостояниеИспользование	= Истина 
				И СтрокаТЗСкидок.Использовать = Истина 
				И СтрокаТЗСкидок.НачислениеБонусами = Ложь 
				И СтрокаТЗСкидок.ПризнакОплатыБонусом = Ложь 
				И Не СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Подарок Тогда
				
				НоваяСтрока = ТаблицаСкидокВрем.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗСкидок);
				НоваяСтрока.НоменклатураСкидки = СтрокаТЗСкидок.Номенклатура;
				НоваяСтрока.Сумма			   = СтрокаТЗСкидок.СуммаСкидки;
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаВозможнаяОплатаТоваровБонусами = ЗапросПоОплатеБонусами(
													ДокументОбъект, 
													?(ЗначениеЗаполнено(ИмяТабличнойЧастиЗапасы) , ДокументОбъект[ИмяТабличнойЧастиЗапасы].Выгрузить() , Неопределено),
													?(ЗначениеЗаполнено(ИмяТабличнойЧастиЛечение), ДокументОбъект[ИмяТабличнойЧастиЛечение].Выгрузить(), Неопределено),
													?(ЗначениеЗаполнено(ИмяТабличнойЧастиУслуги) , ДокументОбъект[ИмяТабличнойЧастиУслуги].Выгрузить() , Неопределено),
													ТаблицаСкидокВрем);		
													
		СтруктураПараметров.Вставить("ТаблицаВозможныхОплатБонусами", ТаблицаВозможнаяОплатаТоваровБонусами);
		
		// Расчитываем бонусы.
		РасчитатьПрименитьОплатуБонусами(ТаблицаСкидок, ТаблицаВозможнаяОплатаТоваровБонусами, ТаблицаОплатыБонусами);
		
		// Оплата бонусами.
		Если ИмяТабличнойЧастиЗапасы <> Неопределено Тогда
			Для Каждого СтрокаТЧ Из ДокументОбъект[ИмяТабличнойЧастиЗапасы] Цикл
				СуммаОплатыБонусами = 0;
				
				ТаблицаСкидокПоСтроке = ТаблицаСкидок.НайтиСтроки(Новый Структура("КлючСтроки, ПризнакОплатыБонусом, Использовать", СтрокаТЧ.КлючСтроки, Истина, Истина));
				Для Каждого СтрокаТЗСкидок Из ТаблицаСкидокПоСтроке Цикл
					СуммаОплатыБонусами = СуммаОплатыБонусами + СтрокаТЗСкидок.СуммаСкидки;
				КонецЦикла;
					
				ТаблицаСкидокПоСтроке = ТаблицаСкидок.НайтиСтроки(Новый Структура("КлючСтроки, НачислениеБонусами, Использовать", СтрокаТЧ.КлючСтроки, Истина, Истина));
				Для каждого СтрокаТЗСкидок Из ТаблицаСкидокПоСтроке Цикл
					СтрокаТЗСкидок.Сумма = СтрокаТЗСкидок.Сумма - СуммаОплатыБонусами;
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
		Если ИмяТабличнойЧастиЛечение <> Неопределено Тогда
			Для Каждого СтрокаТЧ Из ДокументОбъект[ИмяТабличнойЧастиЛечение] Цикл
				СуммаОплатыБонусами = 0;
				
				ТаблицаСкидокПоСтроке = ТаблицаСкидок.НайтиСтроки(Новый Структура("КлючСтроки, ПризнакОплатыБонусом, Использовать", СтрокаТЧ.КлючСтроки, Истина, Истина));
				Для Каждого СтрокаТЗСкидок Из ТаблицаСкидокПоСтроке Цикл
					СуммаОплатыБонусами = СуммаОплатыБонусами + СтрокаТЗСкидок.СуммаСкидки;
				КонецЦикла;
				
				ТаблицаСкидокПоСтроке = ТаблицаСкидок.НайтиСтроки(Новый Структура("КлючСтроки, НачислениеБонусами, Использовать", СтрокаТЧ.КлючСтроки, Истина, Истина));
				Для каждого СтрокаТЗСкидок Из ТаблицаСкидокПоСтроке Цикл
					СтрокаТЗСкидок.Сумма = СтрокаТЗСкидок.Сумма - СуммаОплатыБонусами;
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
		Если ИмяТабличнойЧастиУслуги <> Неопределено Тогда
			Для Каждого СтрокаТЧ Из ДокументОбъект[ИмяТабличнойЧастиУслуги] Цикл
				СуммаОплатыБонусами = 0;
				
				ТаблицаСкидокПоСтроке = ТаблицаСкидок.НайтиСтроки(Новый Структура("КлючСтроки, ПризнакОплатыБонусом, Использовать", СтрокаТЧ.КлючСтроки, Истина, Истина));
				Для Каждого СтрокаТЗСкидок Из ТаблицаСкидокПоСтроке Цикл
					СуммаОплатыБонусами = СуммаОплатыБонусами + СтрокаТЗСкидок.СуммаСкидки;
				КонецЦикла;
				
				ТаблицаСкидокПоСтроке = ТаблицаСкидок.НайтиСтроки(Новый Структура("КлючСтроки, НачислениеБонусами, Использовать", СтрокаТЧ.КлючСтроки, Истина, Истина));
				Для каждого СтрокаТЗСкидок Из ТаблицаСкидокПоСтроке Цикл
					СтрокаТЗСкидок.Сумма = СтрокаТЗСкидок.Сумма - СуммаОплатыБонусами;
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;      
		
	КонецЕсли;
	
	// до обработки "групп" удаляем бонусы не применяемые при наличиии скидки.
	МассивБонусовНеНачисляемыхПриНаличииСкидки	= Новый Массив;
	Если ЕстьБонусыНеНачисляемыеПриНаличииСкидки(ТаблицаСкидок) Тогда
		ТаблицаСкидокВременная						= ТаблицаСкидок.Скопировать();	
		ТабличнаяЧастьЗапасыДокументаВременная		= ?(ИмяТабличнойЧастиЗапасы <> Неопределено	, ДокументОбъект[ИмяТабличнойЧастиЗапасы].Выгрузить(), Неопределено);
		ТабличнаяЧастьЛечениеДокументаВременная		= ?(ИмяТабличнойЧастиЛечение <> Неопределено, ДокументОбъект[ИмяТабличнойЧастиЛечение].Выгрузить(), Неопределено);
		ТабличнаяЧастьУслугиДокументаВременная		= ?(ИмяТабличнойЧастиУслуги <> Неопределено	, ДокументОбъект[ИмяТабличнойЧастиУслуги].Выгрузить(), Неопределено);
					
		ПредварительноПрименитьСкидкиВТаблицеТоваров(
				ТаблицаСкидокВременная,
				ТабличнаяЧастьЗапасыДокументаВременная, 
				ТабличнаяЧастьЛечениеДокументаВременная,
				ТабличнаяЧастьУслугиДокументаВременная,
				ТаблицаПредыдщееСостояниеСкидок);
				
		Если ИмяТЧСкидки <> "" Тогда
			ТабличнаяЧастьСкидкиНаценкиДокументаВременная = ДокументОбъект[ИмяТЧСкидки].Выгрузить();
			РасчитатьПрименитьВытеснениСложныхСкидокПоГруппам(ТаблицаСкидокВременная, СтруктураПараметров, "ТолькоБонусы");
			ПрименитьСкидкиВТаблицеТоваров(
							ТаблицаСкидокВременная,
							ТабличнаяЧастьЗапасыДокументаВременная,
							ТабличнаяЧастьЛечениеДокументаВременная,
							ТабличнаяЧастьУслугиДокументаВременная,
							ТаблицаПредыдщееСостояниеСкидок,
							ДокументОбъект);
			ЗаполнитьТЧСкидокНаценок(ТаблицаСкидокВременная, ТабличнаяЧастьСкидкиНаценкиДокументаВременная, ТаблицаПредыдщееСостояниеСкидок);
			МассивБонусовНеНачисляемыхПриНаличииСкидки = ПолучитьМассивБонусовНеНачисляемыхПриНаличииСкидки(ТабличнаяЧастьСкидкиНаценкиДокументаВременная, ТабличнаяЧастьЗапасыДокументаВременная, ТабличнаяЧастьЛечениеДокументаВременная);	
		КонецЕсли;	
	КонецЕсли;
	
	 // Перерасчет бонусов и применяем вытеснение скидок по группам (автоматические скидки, согласно маркетинговым акциям)
	 // так же удаляются бонусы не начисляемые при скидке
	РасчитатьПрименитьВытеснениСложныхСкидокПоГруппам(ТаблицаСкидок, СтруктураПараметров, "ТолькоБонусы", МассивБонусовНеНачисляемыхПриНаличииСкидки);
	
	// Применяем скидку в строках ТЧ номенклатуры
		ПрименитьСкидкиВТаблицеТоваров(
		ТаблицаСкидок, 
		?(ЗначениеЗаполнено(ИмяТабличнойЧастиЗапасы) , ДокументОбъект[ИмяТабличнойЧастиЗапасы] , Неопределено),
		?(ЗначениеЗаполнено(ИмяТабличнойЧастиЛечение), ДокументОбъект[ИмяТабличнойЧастиЛечение], Неопределено),
		?(ЗначениеЗаполнено(ИмяТабличнойЧастиУслуги) , ДокументОбъект[ИмяТабличнойЧастиУслуги] , Неопределено),
		ТаблицаПредыдщееСостояниеСкидок,
		ДокументОбъект);
		
	ПересчитатьСуммуНачислениеБонусами(
		ТаблицаСкидок, 
		?(ЗначениеЗаполнено(ИмяТабличнойЧастиЗапасы) , ДокументОбъект[ИмяТабличнойЧастиЗапасы] , Неопределено),
		?(ЗначениеЗаполнено(ИмяТабличнойЧастиЛечение), ДокументОбъект[ИмяТабличнойЧастиЛечение], Неопределено),
		?(ЗначениеЗаполнено(ИмяТабличнойЧастиУслуги) , ДокументОбъект[ИмяТабличнойЧастиУслуги] , Неопределено),
		ДокументОбъект);

	// Заполнение скидок в ТЧ скидки наценки
	Если ИмяТЧСкидки <> "" Тогда
		ЗаполнитьТЧСкидокНаценок(ТаблицаСкидок, ДокументОбъект[ИмяТЧСкидки], ТаблицаПредыдщееСостояниеСкидок);
		// удаляются ранее
		// УдалитьБонусыНеНачисляемыеПриНаличииСкидки(ДокументОбъект[ИмяТЧСкидки], ДокументОбъект[ИмяТЧНоменклатуры], ТаблицаОплатыБонусами);	
		// удаляются в запросе получения скидок
		// УдалитьБонусыНеНачисляемыеПриОплатеБонусами(ДокументОбъект[ИмяТЧСкидки], ТаблицаОплатыБонусами, СтруктураПараметров);		
	КонецЕсли;	
	
	// Заполнение скидок в ТЧ подарки
	Если ИмяТЧПодарки <> "" Тогда
		ЗаполнитьТЧПодарков(ТаблицаСкидок, ДокументОбъект[ИмяТЧПодарки], ТаблицаПредыдщееСостояниеСкидок);
	КонецЕсли;	 

КонецПроцедуры // РассчитатьСкидкиПриПродаже()

// Процедура - Выполнить начисление скидки на лицевой счет после оплаты
//
// Параметры:
//  ДокументРеализации	 - 	 - 
//
Процедура УстановитьБонусныйСчетНачисленияВСкидках(
	ДокументОбъект,
	ИмяТЧСкидки,
	Контрагент,
	КартаКонтрагента, 
	Отказ) Экспорт  
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтрокаТЧ ИЗ ДокументОбъект[ИмяТЧСкидки] Цикл
		
		Промокод = СтрокаТЧ.СкидкаНаценка.Промокод;
		Если СтрокаТЧ.Сумма <> 0 Тогда
			ИспользуемыйКонтрагент = ?(ЗначениеЗаполнено(СтрокаТЧ.Контрагент), СтрокаТЧ.Контрагент, Контрагент);
			
			Если ЗначениеЗаполнено(СтрокаТЧ.СкидкаНаценка)
				И СтрокаТЧ.СкидкаНаценка.НачислениеБонусами = ИСТИНА
				И ЗначениеЗаполнено(СтрокаТЧ.БонусныйСчет.ВладелецБонусногоСчета) 
				И СтрокаТЧ.БонусныйСчет.ВладелецБонусногоСчета <> ?(СтрокаТЧ.БонусныйСчет.Именной, Контрагент, КартаКонтрагента) ТОГДА
				
				СтрокаТЧ.БонусныйСчет = Неопределено;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.СкидкаНаценка)
				И СтрокаТЧ.СкидкаНаценка.НачислениеБонусами = Истина
				И (НЕ ЗначениеЗаполнено(СтрокаТЧ.БонусныйСчет)       
				ИЛИ (СтрокаТЧ.СкидкаНаценка.УсловиеПредоставленияСкидки = Перечисления.УсловияПредоставленияСкидки.БонусРефералу И ЗначениеЗаполнено(Промокод)))
				И СтрокаТЧ.Использование = Истина Тогда
				
				Если СтрокаТЧ.СкидкаНаценка.УсловиеПредоставленияСкидки = Перечисления.УсловияПредоставленияСкидки.БонусРефералу И ЗначениеЗаполнено(Промокод) Тогда
					Реферал = РегистрыСведений.Промокоды.ПолучитьРефералаПоПромокоду(ДокументОбъект.Промокод);
					ИспользуемыйКонтрагент 		 = ?(ЗначениеЗаполнено(Реферал), Реферал, Контрагент);
					КартаКонтрагента = ПолучитьКарту(ИспользуемыйКонтрагент);      
				КонецЕсли;
			
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("ТекущаяДата"			, ?(НЕ ЗначениеЗаполнено(ДокументОбъект.Дата) ИЛИ НачалоДня(ДокументОбъект.Дата) = НачалоДня(ТекущаяДата()), ТекущаяДата(), ДокументОбъект.Дата));
				Запрос.УстановитьПараметр("Контрагент"			, ИспользуемыйКонтрагент);
				Запрос.УстановитьПараметр("КартаКонтрагента"	, КартаКонтрагента);
				Запрос.УстановитьПараметр("ВидБонусногоСчета"	, СтрокаТЧ.СкидкаНаценка.ЗначениеСкидкиНаценкиОбъектом);
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БонусныеСчета.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.БонусныеСчета КАК БонусныеСчета
				|ГДЕ
				|	БонусныеСчета.ПометкаУдаления = ЛОЖЬ
				|	И БонусныеСчета.Закрыт = ЛОЖЬ
				|	И БонусныеСчета.ВидБонусногоСчета = &ВидБонусногоСчета
				|	И ВЫБОР
				|			КОГДА БонусныеСчета.Именной = ИСТИНА
				|				ТОГДА БонусныеСчета.ВладелецБонусногоСчета = &Контрагент
				|			ИНАЧЕ БонусныеСчета.ВладелецБонусногоСчета = &КартаКонтрагента
				|		КОНЕЦ
				|	И (&ТекущаяДата МЕЖДУ БонусныеСчета.СрокДействияНачало И КОНЕЦПЕРИОДА(БонусныеСчета.СрокДействияКонец, ДЕНЬ)
				|			ИЛИ &ТекущаяДата >= БонусныеСчета.СрокДействияНачало
				|				И БонусныеСчета.СрокДействияКонец = ДАТАВРЕМЯ(1, 1, 1))
				|
				|УПОРЯДОЧИТЬ ПО
				|	БонусныеСчета.СрокДействияКонец УБЫВ";
				ВыборкаБонусныеСчета = Запрос.Выполнить().Выбрать();
				
				Если ВыборкаБонусныеСчета.Следующий() Тогда
					СтрокаТЧ.БонусныйСчет = ВыборкаБонусныеСчета.Ссылка;
				Иначе
					
					БонусныйСчетОбъект = Справочники.БонусныеСчета.СоздатьЭлемент();
					БонусныйСчетОбъект.Заполнить(СтрокаТЧ.СкидкаНаценка.ЗначениеСкидкиНаценкиОбъектом);
					ЗаполнитьЗначенияСвойств(БонусныйСчетОбъект, СтрокаТЧ.СкидкаНаценка.ЗначениеСкидкиНаценкиОбъектом, "НеОграниченПроцентомСписания");
					БонусныйСчетОбъект.ВладелецБонусногоСчета	= ?(БонусныйСчетОбъект.Именной, ИспользуемыйКонтрагент, КартаКонтрагента);
					БонусныйСчетОбъект.Наименование				= Справочники.БонусныеСчета.СформироватьНаименование(БонусныйСчетОбъект.Код, БонусныйСчетОбъект.Именной, БонусныйСчетОбъект.ВладелецБонусногоСчета);
					БонусныйСчетОбъект.Записать();
					СтрокаТЧ.БонусныйСчет = БонусныйСчетОбъект.Ссылка;
					
					Если БонусныйСчетОбъект.Именной = Ложь И НЕ ЗначениеЗаполнено(КартаКонтрагента) Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'При начислении бонуса на неименной бонусный счет, необходимо указание дисконтной карты!'; en = 'When crediting a bonus to an unnamed bonus account, you must specify a discount card!'"));
						Отказ = Истина;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли; 
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

// Функция, возвращает сумму, доступную для оплаты бонусным счетом в массиве реализаций/приемов.
//
Функция ПолучитьСуммуДоступнуюДляОплатыБонуснымСчетомВМассивеРеализацийПриемов(МассивДокументов, БонусныйСчет) Экспорт
	
	СуммаОстатокПоРег = ПолучитьОстатокНаБонусномСчете(БонусныйСчет);
	ОбщаяСумма   	  = 0;
	
	Для Каждого ДокументСсылка Из МассивДокументов Цикл
		
		СуммаДостПоВизиту = ПолучитьСуммуДоступнуюДляОплатыБонуснымСчетомВРеализацииПриеме(
								ДокументСсылка, 
								БонусныйСчет,
								СуммаОстатокПоРег);
		
		Если ОбщаяСумма + СуммаДостПоВизиту > СуммаОстатокПоРег Тогда
			Возврат СуммаОстатокПоРег;
		КонецЕсли;
		
		ОбщаяСумма = ОбщаяСумма + СуммаДостПоВизиту;
		
	КонецЦикла;
	
	Возврат ОбщаяСумма;
	
КонецФункции

// Функция, возвращает сумму, доступную для оплаты бонусным счетом.
//
Функция ПолучитьСуммуДоступнуюДляОплатыБонуснымСчетомВРеализацииПриеме(
	ДокументСсылка, 
	БонусныйСчет, 
	СуммаОстатокПоРег = Неопределено) Экспорт
	
	СуммаСОграничением = ПолучитьСуммуДоступнуюДляОплатыСчетом(ДокументСсылка, БонусныйСчет);
	
	Если СуммаОстатокПоРег = Неопределено Тогда
		СуммаОстатокПоРег = ПолучитьОстатокНаБонусномСчете(БонусныйСчет);
	КонецЕсли;
	
	Если СуммаСОграничением > СуммаОстатокПоРег Тогда
		СуммаСОграничением = СуммаОстатокПоРег;
	КонецЕсли;
	
	// Из Api в эту функцию передается объект реализации, который ещё не записан.
	// На этот случай делаю проверку, чтобы на этой функции косяк не вылетал. Баст.
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Реализация")
		Или ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Прием") Тогда
		СуммаНачисленияНаБонусныйСчет = РегистрыНакопления.БонусныеСчета.ПолучитьНачисленнуюСуммуБонусногоСчетаПоРеализации(ДокументСсылка, БонусныйСчет);
	Иначе
		СуммаНачисленияНаБонусныйСчет = 0;
	КонецЕсли;
	
	СуммаСОграничением = ?(СуммаСОграничением - СуммаНачисленияНаБонусныйСчет > 0, СуммаСОграничением - СуммаНачисленияНаБонусныйСчет, 0);
	
	Возврат СуммаСОграничением;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция - Получить сумму доступную для оплаты счетом.
//
// Параметры:
//  РеализацияСсылка - 	 - 
//  ЛицевойСчет		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСуммуДоступнуюДляОплатыСчетом(ДокументСсылка, БонусныйСчет) Экспорт
	
	Если ТипЗнч(БонусныйСчет) = Тип("СправочникСсылка.БонусныеСчета") Тогда
		ПакетУслугСоставУслуг = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(БонусныйСчет, "ВидБонусногоСчета").ПакетУслугСоставУслуг;
	Иначе
		ПакетУслугСоставУслуг = БонусныйСчет.ПакетУслугСоставУслуг;
	КонецЕсли;                  	
	
	НайденныеСкидкиНаценки = ДокументСсылка.СкидкиНаценки.НайтиСтроки(Новый Структура("ПризнакОплатыБонусом", Истина));
	
	ОплаченоБонусом		= 0;
	СуммаСОграничением	= 0;
	Для Каждого СтрокаСкидкиНаценки Из НайденныеСкидкиНаценки Цикл
		Если СтрокаСкидкиНаценки.БонусныйСчет = БонусныйСчет Тогда
			ОплаченоБонусом = ОплаченоБонусом + СтрокаСкидкиНаценки.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Если ПакетУслугСоставУслуг.Количество() > 0 Тогда
		
		Для Каждого СтрокаИзВидаБС Из ПакетУслугСоставУслуг Цикл
			
			НайденныеСтрокиЗапасов = Новый Массив;
			НайденныеСтроки = Новый Массив;

			Если ТипЗнч(СтрокаИзВидаБС.УслугаСегмент) = Тип("СправочникСсылка.Номенклатура") Тогда
				
				Если ЗначениеЗаполнено(СтрокаИзВидаБС.ВидЦены) Тогда
					СтруктураПоиска = Новый Структура("Номенклатура, ВидЦен", СтрокаИзВидаБС.УслугаСегмент, СтрокаИзВидаБС.ВидЦены); 
				Иначе
					СтруктураПоиска = Новый Структура("Номенклатура", СтрокаИзВидаБС.УслугаСегмент);
				КонецЕсли;
				Если ОбщегоНазначенияСтоматология.ЕстьТабличнаяЧастьДокумента("Запасы", ДокументСсылка.Метаданные()) = Истина Тогда
					ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
						НайденныеСтроки, 
						ДокументСсылка.Запасы.НайтиСтроки(СтруктураПоиска));
				КонецЕсли;
				Если ОбщегоНазначенияСтоматология.ЕстьТабличнаяЧастьДокумента("Лечение", ДокументСсылка.Метаданные()) = Истина Тогда
					ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
						НайденныеСтроки,
						ДокументСсылка.Лечение.НайтиСтроки(СтруктураПоиска));
				КонецЕсли; 
				Если ОбщегоНазначенияСтоматология.ЕстьТабличнаяЧастьДокумента("Услуги", ДокументСсылка.Метаданные()) = Истина Тогда
					ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
						НайденныеСтроки, 
						ДокументСсылка.Услуги.НайтиСтроки(СтруктураПоиска));
				КонецЕсли;    			
				
			ИначеЕсли ТипЗнч(СтрокаИзВидаБС.УслугаСегмент) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
				Если ОбщегоНазначенияСтоматология.ЕстьТабличнаяЧастьДокумента("Запасы", ДокументСсылка.Метаданные()) = Истина Тогда
					Для Каждого СтрокаИзЗапасов ИЗ ДокументСсылка.Запасы Цикл
						Если РегистрыСведений.НоменклатураСегмента.СегментСодержитОбъект(СтрокаИзВидаБС.УслугаСегмент, СтрокаИзЗапасов.Номенклатура) = Истина
							И (СтрокаИзЗапасов.ВидЦен = СтрокаИзВидаБС.ВидЦены
							ИЛИ НЕ ЗначениеЗаполнено(СтрокаИзВидаБС.ВидЦены)) Тогда
							
							НайденныеСтроки.Добавить(СтрокаИзЗапасов);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				Если ОбщегоНазначенияСтоматология.ЕстьТабличнаяЧастьДокумента("Лечение", ДокументСсылка.Метаданные()) = Истина Тогда
					Для Каждого СтрокаИзЛечение ИЗ ДокументСсылка.Лечение Цикл
						Если РегистрыСведений.НоменклатураСегмента.СегментСодержитОбъект(СтрокаИзВидаБС.УслугаСегмент, СтрокаИзЛечение.Номенклатура) = Истина
							И (СтрокаИзЛечение.ВидЦен = СтрокаИзВидаБС.ВидЦены
							ИЛИ НЕ ЗначениеЗаполнено(СтрокаИзВидаБС.ВидЦены)) Тогда
							
							НайденныеСтроки.Добавить(СтрокаИзЛечение);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				Если ОбщегоНазначенияСтоматология.ЕстьТабличнаяЧастьДокумента("Услуги", ДокументСсылка.Метаданные()) = Истина Тогда
					Для Каждого СтрокаИзУслуги ИЗ ДокументСсылка.Услуги Цикл
						Если РегистрыСведений.НоменклатураСегмента.СегментСодержитОбъект(СтрокаИзВидаБС.УслугаСегмент, СтрокаИзУслуги.Номенклатура) = Истина
							И (СтрокаИзУслуги.ВидЦен = СтрокаИзВидаБС.ВидЦены
							ИЛИ НЕ ЗначениеЗаполнено(СтрокаИзВидаБС.ВидЦены)) Тогда
							
							НайденныеСтроки.Добавить(СтрокаИзУслуги);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;			
			
			ОграничениеПоНоменклатуре = 0;
			Для Каждого СтрокаДокумента Из НайденныеСтроки Цикл
				
				Если СтрокаИзВидаБС.ПроцентСписания > 0 Тогда
					ОграничениеПоНоменклатуре = СтрокаДокумента.Всего / 100 * СтрокаИзВидаБС.ПроцентСписания;
				Иначе   					
					Если Не БонусныйСчет.ВидБонусногоСчета.НеОграниченПроцентомСписания
						И БонусныйСчет.ВидБонусногоСчета.ОграничениеСписанияПроцент > 0 Тогда
						ОграничениеПоНоменклатуре = СтрокаДокумента.Всего / 100 * БонусныйСчет.ВидБонусногоСчета.ОграничениеСписанияПроцент;
					Иначе
						ОграничениеПоНоменклатуре = СтрокаДокумента.Всего;
					КонецЕсли;
				КонецЕсли;
				
				СуммаСОграничением = СуммаСОграничением + ОграничениеПоНоменклатуре;
			КонецЦикла;
			
		КонецЦикла;
		
	Иначе
		ВидБонусногоСчета = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(БонусныйСчет, "ВидБонусногоСчета");
		СтруктураДанныхВидаБонусногоСчета = ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(ВидБонусногоСчета, "НеОграниченПроцентомСписания, ОграничениеСписанияПроцент");
		НеОграниченПроцентомСписания = СтруктураДанныхВидаБонусногоСчета.НеОграниченПроцентомСписания;
		ОграничениеСписанияПроцент   = СтруктураДанныхВидаБонусногоСчета.ОграничениеСписанияПроцент;
		
		СуммаСОграничением = 0;
		Если ОбщегоНазначенияСтоматология.ЕстьТабличнаяЧастьДокумента("Запасы", ДокументСсылка.Метаданные()) = Истина Тогда
			СуммаСОграничением = СуммаСОграничением + ДокументСсылка.Запасы.Итог("Всего");
		КонецЕсли;
		Если ОбщегоНазначенияСтоматология.ЕстьТабличнаяЧастьДокумента("Лечение", ДокументСсылка.Метаданные()) = Истина Тогда
			СуммаСОграничением = СуммаСОграничением + ДокументСсылка.Лечение.Итог("Всего");
		КонецЕсли;
		Если ОбщегоНазначенияСтоматология.ЕстьТабличнаяЧастьДокумента("Услуги", ДокументСсылка.Метаданные()) = Истина Тогда
			СуммаСОграничением = СуммаСОграничением + ДокументСсылка.Услуги.Итог("Всего");
		КонецЕсли;  
		
		Если НЕ НеОграниченПроцентомСписания = Истина Тогда
			СуммаСОграничением = СуммаСОграничением / 100 * ОграничениеСписанияПроцент;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СуммаСОграничением - ОплаченоБонусом;
	
КонецФункции

// Функция, возвращает остаток на бонусном счете.
//
Функция ПолучитьОстатокНаБонусномСчете(БонусныйСчет)
	
	Возврат РегистрыНакопления.БонусныеСчета.ПолучитьОстатокНаБонусномСчетеВладельца(БонусныйСчет, ТекущаяДатаСеанса());
	
КонецФункции

// Процедура получает ближайший день рождения для расчета скидок
//
// Параметры:
//  Получатель - физическое лицо получатель скидки
//
// Возвращаемое значение:
//  ДатаРождения - ближайшая дата Дня рождения получателя.
//
Функция ПолучитьБлижайшийДеньРождения(Получатель)
	
	Перем ДатаРождения;
	ДатаРождения = Дата('00010101000000');
	
	мТекущаяДата = ТекущаяДатаСеанса();
	
	Если ТипЗнч(Получатель) = Тип("СправочникСсылка.Контрагенты") Тогда
		Если ЗначениеЗаполнено(Получатель.ДатаРожденияКлиента) Тогда
		
			Если Не (Месяц(Получатель.ДатаРожденияКлиента) = 2 И День(Получатель.ДатаРожденияКлиента) = 29) Тогда
				ДатаТекущегоГода= Дата(Год(мТекущаяДата), Месяц(Получатель.ДатаРожденияКлиента), День(Получатель.ДатаРожденияКлиента));
			Иначе
				ДатаТекущегоГода= Дата(Год(мТекущаяДата), 3, 1);
			КонецЕсли;
			ДатаПредыдущегоГода = ДобавитьМесяц(ДатаТекущегоГода, -12);
			ДатаСледующегоГода  = ДобавитьМесяц(ДатаТекущегоГода, 12);
			
			Если мТекущаяДата < ДатаТекущегоГода Тогда
				Разность = ДатаТекущегоГода - мТекущаяДата;
			Иначе
				Разность = мТекущаяДата - ДатаТекущегоГода;
			КонецЕсли;
			
			Если Разность > (мТекущаяДата - ДатаПредыдущегоГода) Тогда
				ДатаРождения = ДатаПредыдущегоГода
			ИначеЕсли Разность > (ДатаСледующегоГода - мТекущаяДата) Тогда
				ДатаРождения = ДатаСледующегоГода;
			Иначе
				ДатаРождения = ДатаТекущегоГода;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДатаРождения;
	
КонецФункции // ПолучитьБлижайшийДеньРождения()

// Возвращает массив получателей скидки 
//
// Параметры
//  Получатель  - Контрагент или физическое лицо
//
// Возвращаемое значение:
//   Массив
//
Функция ПолучитьМассивСегментовПолучателя(Получатель)

	СегментовПолучателя = Новый Массив;
	
	Если ЗначениеЗаполнено(Получатель) Тогда
		
		// Добавляем все сегменты, в которые входит контрагент
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	КонтрагентыСегмента.Сегмент КАК Сегмент
			|ИЗ
			|	РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
			|ГДЕ
			|	КонтрагентыСегмента.Контрагент = &Контрагент";
		Запрос.УстановитьПараметр("Контрагент", Получатель);
		Для Каждого ЭлементМассива Из Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сегмент") Цикл
			СегментовПолучателя.Добавить(ЭлементМассива);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СегментовПолучателя;

КонецФункции

// Функция возвращает дерево значений, выгруженное из результата запроса по скидкам.
//
// Параметры:
//  ДокументОбъект - Документ в котором рассчитываем автоматические скидки
//  ТаблицаТоваров - Таблица значений в которую выгружена таблица товаров из документа
//  ДатаСкидок - дата, на которую необходимо рассчитать скидки.
//  СтруктураПараметров - Параметры для расчета
//  СтруктурнаяЕдиница - СтруктурнаяЕдиница, в котором рассчитываем скидки
//  ЕстьТЧПодарки - булево, определяет необходимость расчета скидок подарков
//
// Возвращаемое значение:
//  ДеревоЗначений.
//
Функция ЗапросПоСкидкам(
	ДокументОбъект,
	ТаблицаЗапасов			= Неопределено,
	ТаблицаЛечения			= Неопределено,
	ТаблицаУслуг 			= Неопределено,  
	СтруктураПараметров, 
	ТаблицаОплатыБонусами)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	СоздатьЗапросМенеджераВременныхТаблиц(
					Запрос,
					СтруктураПараметров,
					ТаблицаЗапасов,
					ТаблицаЛечения,
					ТаблицаУслуг,
					ДокументОбъект);    
					
	Результат = Запрос.Выполнить(); 
	
	КонтрагентИРодственники = Новый Массив;
	Если ЗначениеЗаполнено(СтруктураПараметров.Получатель) Тогда
		РодственникиКлиентаТЧ	= РегистрыСведений.РодственныеСвязи.РодственникиКлиента(СтруктураПараметров.Получатель,, Истина);
		РодственникиКлиента		= РодственникиКлиентаТЧ.ВыгрузитьКолонку("Родственник");
		РодственникиКлиента.Добавить(СтруктураПараметров.Получатель);  
		КонтрагентИРодственники = КонтрагентИРодственники(СтруктураПараметров.Получатель);

	Иначе
		РодственникиКлиента = Новый Массив;
	КонецЕсли;                                                  
	
	МоментВремениПредыдущегоПриема = ?(ДокументОбъект.Ссылка.Пустая(), СтруктураПараметров.ДатаСкидок, Новый Граница(ДокументОбъект.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	
	Запрос.УстановитьПараметр("ДокументСсылка"       		, ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("ДатаСкидок"           		, СтруктураПараметров.ДатаСкидок);
	Запрос.УстановитьПараметр("ДатаСкидокВремя"      		, Дата(1, 1, 1) + (СтруктураПараметров.ДатаСкидок - НачалоДня(СтруктураПараметров.ДатаСкидок)));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"   		, СтруктураПараметров.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ДеньРождения"         		, ПолучитьБлижайшийДеньРождения(СтруктураПараметров.Получатель));
	Запрос.УстановитьПараметр("Получатель"           		, СтруктураПараметров.Получатель);
	Запрос.УстановитьПараметр("КартаКонтрагента"     		, СтруктураПараметров.Карта);
	Запрос.УстановитьПараметр("КлиентРекламныйИсточник"		, Ложь);
	Запрос.УстановитьПараметр("Организация"					, СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("РодственникиКлиента"			, РодственникиКлиента);
    Запрос.УстановитьПараметр("МассивКонтрагентов"			, КонтрагентИРодственники);
	Запрос.УстановитьПараметр("ПромокодыИспользуются"		, ?(ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.Прием") ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.Реализация"), ЗначениеЗаполнено(ДокументОбъект.Промокод), Ложь));
	Запрос.УстановитьПараметр("ВидПромокода"				, ?(ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.Прием") ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.Реализация"), РегистрыСведений.Промокоды.ПолучитьВидПромокода(ДокументОбъект.Промокод), Неопределено));	
	Запрос.УстановитьПараметр("МоментВремени"               , МоментВремениПредыдущегоПриема);
	Запрос.Текст = ПолучитьТекстЗапросаСкидок();	
	
	Если КонтрагентИРодственники.Количество() > 1 Тогда  
		УсловиеПолучателя = ?(ЗначениеЗаполнено(СтруктураПараметров.Получатель), "Контрагент В(&МассивКонтрагентов)", "КартаКонтрагента = &КартаКонтрагента");	
	Иначе
		УсловиеПолучателя = ?(ЗначениеЗаполнено(СтруктураПараметров.Получатель), "Контрагент = &Получатель", "КартаКонтрагента = &КартаКонтрагента");
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПолучателя", УсловиеПолучателя);
	
	МассивВидовБонусныхСчетовНеНачисляемыхПриОплате = ПолучитьМассивВидовБонусныхСчетовНеНачисляемыхПриОплатеБонусами(ТаблицаОплатыБонусами);
	УсловиеБонусныеСчетаНеНачисляемыеПриОплате = ?(Не ЗначениеЗаполнено(МассивВидовБонусныхСчетовНеНачисляемыхПриОплате),
	"",
	"
	|И	ВЫБОР
	|		КОГДА ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.НачислениеБонусами = ИСТИНА
	|			И ТИПЗНАЧЕНИЯ(ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ЗначениеСкидкиНаценкиОбъектом) = ТИП(Справочник.ВидыБонусныхСчетов)
	|			И ВЫРАЗИТЬ(ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ЗначениеСкидкиНаценкиОбъектом КАК Справочник.ВидыБонусныхСчетов).НеНачислятьПриОплатеБонусами = ИСТИНА
	|		ТОГДА НЕ ВЫРАЗИТЬ(ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ЗначениеСкидкиНаценкиОбъектом КАК Справочник.ВидыБонусныхСчетов) В (&МассивВидовБонусныхСчетовНеНачисляемыхПриОплате)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ"
	);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеБонусныеСчетаНеНачисляемыеПриОплате", УсловиеБонусныеСчетаНеНачисляемыеПриОплате);
	Запрос.УстановитьПараметр("МассивВидовБонусныхСчетовНеНачисляемыхПриОплате", МассивВидовБонусныхСчетовНеНачисляемыхПриОплате);	
	
	ТаблицаСкидок = Запрос.Выполнить().Выгрузить();     	
	                 
	ТаблицаСкидок.Колонки.Добавить("СуммаСкидки" , Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15,2)));
	ТаблицаСкидок.Колонки.Добавить("Использовать", Новый ОписаниеТипов("Булево"));
	ТаблицаСкидок.Колонки.Добавить("ПредыдщееСостояниеИспользование", Новый ОписаниеТипов("Булево"));
		
		Возврат ТаблицаСкидок; 	
	
КонецФункции // ЗапросПоСкидкам()

// Процедура создает запрос менеджер временных таблиц.
//
Процедура СоздатьЗапросМенеджераВременныхТаблиц(
	Запрос, 
	СтруктураПараметров,
	ТаблицаЗапасов		= Неопределено,
	ТаблицаЛечения		= Неопределено,
	ТаблицаУслуг 		= Неопределено,  
	ДокументОбъект) 
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	Если ТаблицаЗапасов <> Неопределено Тогда Запрос.УстановитьПараметр("ТаблицаЗапасы"	, ТаблицаЗапасов) КонецЕсли;
	Если ТаблицаЛечения <> Неопределено Тогда Запрос.УстановитьПараметр("ТаблицаЛечения", ТаблицаЛечения) КонецЕсли;
	Если ТаблицаУслуг   <> Неопределено	Тогда Запрос.УстановитьПараметр("ТаблицаУслуг"	, ТаблицаУслуг)	  КонецЕсли;
	
	ЕстьКолонкаКоличествоУпаковокТЧЛечение = Ложь;
	Если ТаблицаЛечения <> Неопределено Тогда 
		ЕстьКолонкаКоличествоУпаковокТЧЛечение = ДокументОбъект.Ссылка.Метаданные().ТабличныеЧасти.Лечение.Реквизиты.Найти("КоличествоУпаковок") <> Неопределено;
	КонецЕсли;
	
	ЭтоНарядЗаказ = СтруктураПараметров.Свойство("ЭтоНарядЗаказ");

	СтрокаОбъединение = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|";	
	
	СтрокаРазделение = "
	|
	|;
	|///////////////////////////////////////////
	|";   	
	
	СтрокаПоместить = "	
	|ПОМЕСТИТЬ ТаблицаТовары
	|";	 
	
	МассивТекст = Новый Массив;
	
	// добавляем во временные таблицы. 	
	Если ТаблицаЗапасов <> Неопределено Тогда
		Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЗапасы.НомерСтроки,
		|	ТаблицаЗапасы.КлючСтроки,
		|	ТаблицаЗапасы.Номенклатура,
		|	ТаблицаЗапасы.КоличествоУпаковок,
		|	ТаблицаЗапасы.Упаковка,
		|	ТаблицаЗапасы.Количество,
		|	ТаблицаЗапасы.ВидЦен,"
		+ ?(ЭтоНарядЗаказ = Истина, 
			" ТаблицаЗапасы.ЦенаПродажи КАК Цена,", 
			" ТаблицаЗапасы.Цена КАК Цена,")	
		+ ?(ЭтоНарядЗаказ = Истина, 
			" ТаблицаЗапасы.СуммаПродажи КАК Сумма", 
			" ТаблицаЗапасы.Сумма КАК Сумма")	
		+ "
		|ПОМЕСТИТЬ ТаблицаЗапасы
		|ИЗ
		|	&ТаблицаЗапасы КАК ТаблицаЗапасы";	
		
		МассивТекст.Добавить(Текст);
	КонецЕсли;
	
	Если ТаблицаЛечения <> Неопределено Тогда
		
		Если ТаблицаЗапасов <> Неопределено Тогда
			МассивТекст.Добавить(СтрокаРазделение);
		КонецЕсли;             		
		
		Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	ТаблицаЛечения.НомерСтроки,
		|	ТаблицаЛечения.КлючСтроки,
		|	ТаблицаЛечения.Номенклатура,"
		+ ?(ЕстьКолонкаКоличествоУпаковокТЧЛечение = Истина, 
			" ТаблицаЛечения.КоличествоУпаковок КАК КоличествоУпаковок,", 
			" ТаблицаЛечения.Количество КАК КоличествоУпаковок,")	
		+ "
		|	ТаблицаЛечения.Упаковка,
		|	ТаблицаЛечения.Количество,
		|	ТаблицаЛечения.ВидЦен,
		|	ТаблицаЛечения.Цена,
		|	ТаблицаЛечения.Сумма 
		|ПОМЕСТИТЬ ТаблицаЛечения
		|ИЗ
		|	&ТаблицаЛечения КАК ТаблицаЛечения
		|&СтрокаУсловие";
		
		Если ДокументОбъект.Ссылка.Метаданные().ТабличныеЧасти.Лечение.Реквизиты.Найти("ДокументАванса") <> Неопределено Тогда
						
			Текст = СтрЗаменить(Текст, "&СтрокаУсловие", "Где
			| Выбор Когда &ПрименятьСкидкиПоПланамЛечения = Истина Тогда ТаблицаЛечения.ДокументАванса = Неопределено Иначе Истина Конец");
			Запрос.УстановитьПараметр("ПрименятьСкидкиПоПланамЛечения", ОбщегоНазначенияСтоматология.ПолучитьЗначениеКонстанты("ПрименятьСкидкиПоПланамЛечения"));
		Иначе
			Текст = СтрЗаменить(Текст, "&СтрокаУсловие", "");
		КонецЕсли;
		
		МассивТекст.Добавить(Текст); 
	КонецЕсли;
	
	Если ТаблицаУслуг <> Неопределено Тогда
		
		Если ТаблицаЗапасов <> Неопределено 
			Или ТаблицаЛечения <> Неопределено Тогда
			
			МассивТекст.Добавить(СтрокаРазделение);
		КонецЕсли;     
		
		Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаУслуг.НомерСтроки,
		|	ТаблицаУслуг.КлючСтроки,
		|	ТаблицаУслуг.Номенклатура,
		|	ТаблицаУслуг.КоличествоУпаковок,
		|	ТаблицаУслуг.Упаковка,
		|	ТаблицаУслуг.Количество,
		|	ТаблицаУслуг.ВидЦен,
		|	ТаблицаУслуг.Цена,
		|	ТаблицаУслуг.Сумма
		|ПОМЕСТИТЬ ТаблицаУслуг
		|ИЗ
		|	&ТаблицаУслуг КАК ТаблицаУслуг";
		
		МассивТекст.Добавить(Текст); 
	КонецЕсли;   
	
	// формируем запрос "объединение".
	МассивТекст.Добавить(СтрокаРазделение);
	Если ТаблицаЗапасов <> Неопределено Тогда
		Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЗапасы.НомерСтроки,
		|	ТаблицаЗапасы.КлючСтроки,
		|	ТаблицаЗапасы.Номенклатура,
		|	ТаблицаЗапасы.КоличествоУпаковок,
		|	ТаблицаЗапасы.Упаковка,
		|	ТаблицаЗапасы.Количество,
		|	ТаблицаЗапасы.ВидЦен,
		|	ТаблицаЗапасы.Цена,
		|	ТаблицаЗапасы.Сумма
		|ПОМЕСТИТЬ ТаблицаТовары
		|ИЗ
		|	ТаблицаЗапасы КАК ТаблицаЗапасы";
		
		МассивТекст.Добавить(Текст);
	КонецЕсли;
	   	
	Если ТаблицаЛечения <> Неопределено Тогда
		
		Если ТаблицаЗапасов <> Неопределено Тогда
			МассивТекст.Добавить(СтрокаОбъединение);
		КонецЕсли;  
		
		Текст =
		"ВЫБРАТЬ " + ?(ТаблицаЗапасов = Неопределено, "РАЗРЕШЕННЫЕ", "") + " 
		|	ТаблицаЛечения.НомерСтроки,
		|	ТаблицаЛечения.КлючСтроки,
		|	ТаблицаЛечения.Номенклатура,
		|	ТаблицаЛечения.КоличествоУпаковок,
		|	ТаблицаЛечения.Упаковка,
		|	ТаблицаЛечения.Количество,
		|	ТаблицаЛечения.ВидЦен,
		|	ТаблицаЛечения.Цена,
		|	ТаблицаЛечения.Сумма"  
		+ ?(ТаблицаЗапасов = Неопределено, СтрокаПоместить, "")	
		+ "
		|ИЗ
		|	ТаблицаЛечения КАК ТаблицаЛечения";
		
		МассивТекст.Добавить(Текст); 
	КонецЕсли;
	
	Если ТаблицаУслуг <> Неопределено Тогда
		
		Если ТаблицаЗапасов <> Неопределено 
			Или ТаблицаЛечения <> Неопределено Тогда
			МассивТекст.Добавить(СтрокаОбъединение);
		КонецЕсли;  
		
		Текст =
		"ВЫБРАТЬ " + ?(ТаблицаЗапасов = Неопределено И ТаблицаЛечения = Неопределено, "РАЗРЕШЕННЫЕ", "") + " 
		|	ТаблицаУслуг.НомерСтроки,
		|	ТаблицаУслуг.КлючСтроки,
		|	ТаблицаУслуг.Номенклатура,
		|	ТаблицаУслуг.КоличествоУпаковок,
		|	ТаблицаУслуг.Упаковка,
		|	ТаблицаУслуг.Количество,
		|	ТаблицаУслуг.ВидЦен,
		|	ТаблицаУслуг.Цена,
		|	ТаблицаУслуг.Сумма"   
		+ ?(ТаблицаЗапасов = Неопределено И ТаблицаЛечения = Неопределено, СтрокаПоместить, "")	
		+ "
		|ИЗ
		|	ТаблицаУслуг КАК ТаблицаУслуг";
		
		МассивТекст.Добавить(Текст); 
	КонецЕсли;   	
	
	Текст = "
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ первые 1 * 
	|ПОМЕСТИТЬ ТаблицаТоварыПерваяСтрока
	|	ИЗ ТаблицаТовары
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ * ИЗ ТаблицаТовары";	
	
	МассивТекст.Добавить(Текст);
	
	Запрос.Текст = СтрСоединить(МассивТекст, Символы.ПС);
	
КонецПроцедуры

// Функция возвращает текст запроса получения скидок.
//
Функция ПолучитьТекстЗапросаСкидок()
	
Возврат
"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка КАК СкидкаНаценка,
|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ПорядокПрименения КАК ПорядокПрименения,
|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.УсловиеПредоставленияСкидки КАК УсловиеПредоставленияСкидки,
|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ВидСравненияУсловия КАК ВидСравненияУсловия,
|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ЗначениеУсловия КАК ЗначениеУсловия,
|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.СпособПредоставленияСкидки КАК СпособПредоставленияСкидки,
|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ЗначениеСкидкиНаценки КАК ЗначениеСкидкиНаценки,
|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ЗначениеСкидкиНаценкиОбъектом КАК ЗначениеСкидкиНаценкиОбъектом,
|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.НачислениеБонусами КАК НачислениеБонусами,
|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.СегментБазыРасчетаСкидки КАК СегментБазыРасчетаСкидки,
|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.СегментНоменклатуры КАК СегментНоменклатуры,
|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ОбъектСкидки КАК ОбъектСкидки,
|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ОбъектНакопления КАК ОбъектНакопления,
|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ПериодНакопления КАК ПериодНакопления,
|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ПериодНакопленияТип КАК ПериодНакопленияТип,
|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.СкидкаНаЕдиныйКомплект КАК СкидкаНаЕдиныйКомплект,
|	ДействиеСкидокНаценокСрезПоследних.КоличествоПрименений КАК КоличествоПрименений,
|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ВидЛицевогоСчета КАК ВидЛицевогоСчета,
|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.НеСуммироватьЛицевыеСчетаРодственников КАК НеСуммироватьЛицевыеСчетаРодственников
|ПОМЕСТИТЬ ДействующиеСкидки
|ИЗ
|	РегистрСведений.ДействиеСкидокНаценок.СрезПоследних(
|			&ДатаСкидок,
|			СтруктурнаяЕдиница В (&СтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
|				И СкидкаНаценка.ПометкаУдаления = ЛОЖЬ
|				И (НАЧАЛОПЕРИОДА(ДатаНачала, ДЕНЬ) <= &ДатаСкидок
|					ИЛИ ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
|				И (КОНЕЦПЕРИОДА(ДатаОкончания, ДЕНЬ) >= &ДатаСкидок
|					ИЛИ ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК ДействиеСкидокНаценокСрезПоследних
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СкидкиНаценки.Получатели КАК СкидкиНаценкиПолучатели
|		ПО ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка = СкидкиНаценкиПолучатели.Ссылка
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СкидкиНаценки.ВремяПоДнямНедели КАК СкидкиНаценкиВремяПоДнямНедели
|		ПО ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка = СкидкиНаценкиВремяПоДнямНедели.Ссылка
|			И (СкидкиНаценкиВремяПоДнямНедели.Выбран = ИСТИНА)
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтрагентыСегмента КАК СоставСегментов
|		ПО (СкидкиНаценкиПолучатели.Получатель = СоставСегментов.Сегмент)
|			И (СоставСегментов.Контрагент = &Получатель)
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Карты КАК Карты
|		ПО (СкидкиНаценкиПолучатели.Получатель = Карты.ВидКарты)
|			И (Карты.Ссылка = &КартаКонтрагента)
|			И (Карты.Заблокирована = ЛОЖЬ)
|ГДЕ
|	ДействиеСкидокНаценокСрезПоследних.Актуальность = ИСТИНА
|	И (СкидкиНаценкиВремяПоДнямНедели.ДеньНедели ЕСТЬ NULL
|			ИЛИ СкидкиНаценкиВремяПоДнямНедели.Выбран
|				И ДЕНЬНЕДЕЛИ(СкидкиНаценкиВремяПоДнямНедели.ДеньНедели) = ДЕНЬНЕДЕЛИ(&ДатаСкидок)
|				И (&ДатаСкидокВремя >= СкидкиНаценкиВремяПоДнямНедели.ВремяНачала
|					ИЛИ СкидкиНаценкиВремяПоДнямНедели.ВремяНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
|				И (&ДатаСкидокВремя <= СкидкиНаценкиВремяПоДнямНедели.ВремяОкончания
|					ИЛИ СкидкиНаценкиВремяПоДнямНедели.ВремяОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)))
|	И ВЫБОР
|			КОГДА НЕ &КлиентРекламныйИсточник
|					И ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ТипПолучателя = ЗНАЧЕНИЕ(Перечисление.ТипыПолучателейСкидкиНаценки.ПустаяСсылка)
|				ТОГДА ИСТИНА
|			КОГДА НЕ &КлиентРекламныйИсточник
|					И ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ТипПолучателя = ЗНАЧЕНИЕ(Перечисление.ТипыПолучателейСкидкиНаценки.ОграниченоСпискомКлиентов)
|				ТОГДА СкидкиНаценкиПолучатели.Получатель = &Получатель
|			КОГДА НЕ &КлиентРекламныйИсточник
|					И ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ТипПолучателя = ЗНАЧЕНИЕ(Перечисление.ТипыПолучателейСкидкиНаценки.ОграниченоСегментомКлиентов)
|				ТОГДА СоставСегментов.Контрагент = &Получатель
|			КОГДА НЕ &КлиентРекламныйИсточник
|					И ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ТипПолучателя = ЗНАЧЕНИЕ(Перечисление.ТипыПолучателейСкидкиНаценки.ОграниченоВидамиДисконтныхКарт)
|				ТОГДА Карты.ВладелецКарты = &Получатель
|			КОГДА &КлиентРекламныйИсточник
|					И ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ТипПолучателя = ЗНАЧЕНИЕ(Перечисление.ТипыПолучателейСкидкиНаценки.КлиентРекламныйИсточник)
|				ТОГДА ИСТИНА
|		КОНЕЦ
|	И ВЫБОР
|			КОГДА ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.СпособПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.СпособПредоставленияСкидки.ВыдачаКарты)
|				ТОГДА НЕ (&Получатель, ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ЗначениеСкидкиНаценкиОбъектом) В
|							(ВЫБРАТЬ
|								ДисконтныеКарты.ВладелецКарты,
|								ДисконтныеКарты.ВидКарты
|							ИЗ
|								Справочник.Карты КАК ДисконтныеКарты
|							ГДЕ
|								ДисконтныеКарты.ВладелецКарты = &Получатель
|								И ДисконтныеКарты.Заблокирована = ЛОЖЬ
|								И ДисконтныеКарты.ПометкаУдаления = ЛОЖЬ)
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ
|	И &УсловиеБонусныеСчетаНеНачисляемыеПриОплате
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка
|ПОМЕСТИТЬ ДействующиеСкидкиПоУсловиюВсегда
|ИЗ
|	ДействующиеСкидки КАК ДействующиеСкидки
|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка,
|			СУММА(ТаблицаТовары.Количество) КАК Количество,
|			СУММА(ТаблицаТовары.Сумма) КАК Сумма
|		ИЗ
|			ДействующиеСкидки КАК ДействующиеСкидки
|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК ТаблицаТовары
|				ПО (ИСТИНА)
|		
|		СГРУППИРОВАТЬ ПО
|			ДействующиеСкидки.СкидкаНаценка) КАК ТоварыПоСегменту
|		ПО (ТоварыПоСегменту.СкидкаНаценка = ДействующиеСкидки.СкидкаНаценка)
|ГДЕ
|	ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Всегда)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка,
|	ДействующиеСкидки.СкидкаНаценка.СегментНоменклатуры КАК СегментНоменклатуры,
|	ПродажиСебестоимость.ДокументПродажи КАК ДокументПродажи
|ПОМЕСТИТЬ ВТДокументПродажи
|ИЗ
|	ДействующиеСкидки КАК ДействующиеСкидки
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
|			ПродажиСебестоимостьОбороты.ДокументПродажи КАК ДокументПродажи
|		ИЗ
|			РегистрНакопления.ПродажиСебестоимость.Обороты(
|					,
|					&МоментВремени,
|					,
|					Контрагент = &Получатель
|						И ДокументПродажи ССЫЛКА Документ.Прием) КАК ПродажиСебестоимостьОбороты) КАК ПродажиСебестоимость
|		ПО (ИСТИНА)
|ГДЕ
|	ДействующиеСкидки.СкидкаНаценка.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ПредыдущийПрием)
|	И ДействующиеСкидки.СкидкаНаценка.СегментНоменклатуры <> ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ВТДокументПродажи.СкидкаНаценка КАК СкидкаНаценка
|ПОМЕСТИТЬ ДействующиеСкидкиПоУсловиюПредыдущийПрием
|ИЗ
|	ВТДокументПродажи КАК ВТДокументПродажи
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиСебестоимость.Обороты(
|				,
|				&МоментВремени,
|				,
|				Контрагент = &Получатель
|					И ДокументПродажи ССЫЛКА Документ.Прием) КАК ПродажиСебестоимость
|		ПО ВТДокументПродажи.ДокументПродажи = ПродажиСебестоимость.ДокументПродажи
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
|		ПО ВТДокументПродажи.СегментНоменклатуры = НоменклатураСегмента.Сегмент
|			И (ПродажиСебестоимость.Номенклатура = НоменклатураСегмента.Номенклатура)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка
|ПОМЕСТИТЬ ДействующиеСкидкиПоУсловиюСумма
|ИЗ
|	ДействующиеСкидки КАК ДействующиеСкидки
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка,
|			СУММА(ТаблицаТовары.Количество) КАК Количество,
|			СУММА(ТаблицаТовары.Сумма) КАК Сумма
|		ИЗ
|			ДействующиеСкидки КАК ДействующиеСкидки
|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК СоставСегментов
|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК ТаблицаТовары
|					ПО СоставСегментов.Номенклатура = ТаблицаТовары.Номенклатура
|				ПО ДействующиеСкидки.СегментНоменклатуры = СоставСегментов.Сегмент
|		ГДЕ
|			ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Сумма)
|			И ДействующиеСкидки.ОбъектСкидки = ЗНАЧЕНИЕ(Перечисление.ОбъектСкидок.НаДокумент)
|			И НЕ ДействующиеСкидки.СкидкаНаценка.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|			И НЕ ТаблицаТовары.Номенклатура ЕСТЬ NULL
|		
|		СГРУППИРОВАТЬ ПО
|			ДействующиеСкидки.СкидкаНаценка
|		
|		ОБЪЕДИНИТЬ ВСЕ
|		
|		ВЫБРАТЬ
|			ДействующиеСкидки.СкидкаНаценка,
|			СУММА(ТаблицаТовары.Количество),
|			СУММА(ТаблицаТовары.Сумма)
|		ИЗ
|			ДействующиеСкидки КАК ДействующиеСкидки,
|			ТаблицаТовары КАК ТаблицаТовары
|		ГДЕ
|			ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Сумма)
|			И ДействующиеСкидки.ОбъектСкидки = ЗНАЧЕНИЕ(Перечисление.ОбъектСкидок.НаДокумент)
|			И ДействующиеСкидки.СкидкаНаценка.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|		
|		СГРУППИРОВАТЬ ПО
|			ДействующиеСкидки.СкидкаНаценка) КАК ТоварыПоСегменту
|		ПО (ТоварыПоСегменту.СкидкаНаценка = ДействующиеСкидки.СкидкаНаценка)
|ГДЕ
|	ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Сумма)
|	И ДействующиеСкидки.ОбъектСкидки = ЗНАЧЕНИЕ(Перечисление.ОбъектСкидок.НаДокумент)
|	И (ДействующиеСкидки.СкидкаНаценка.ВидСравненияУсловия = ИСТИНА
|				И ДействующиеСкидки.СкидкаНаценка.ЗначениеУсловия <= ТоварыПоСегменту.Сумма
|			ИЛИ ДействующиеСкидки.СкидкаНаценка.ВидСравненияУсловия = ЛОЖЬ
|				И ДействующиеСкидки.СкидкаНаценка.ЗначениеУсловия >= ТоварыПоСегменту.Сумма)
|
|СГРУППИРОВАТЬ ПО
|	ДействующиеСкидки.СкидкаНаценка
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка
|ПОМЕСТИТЬ ДействующиеСкидкиПоУсловиюПромокод
|ИЗ
|	ДействующиеСкидки КАК ДействующиеСкидки
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка,
|			СУММА(ТаблицаТовары.Количество) КАК Количество,
|			СУММА(ТаблицаТовары.Сумма) КАК Сумма
|		ИЗ
|			ДействующиеСкидки КАК ДействующиеСкидки
|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК ТаблицаТовары
|					ПО НоменклатураСегмента.Номенклатура = ТаблицаТовары.Номенклатура
|				ПО ДействующиеСкидки.СегментНоменклатуры = НоменклатураСегмента.Сегмент
|		ГДЕ
|			(ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Промокод)
|					ИЛИ ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.БонусРефералу))
|			И НЕ ДействующиеСкидки.СкидкаНаценка.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|			И НЕ ТаблицаТовары.Номенклатура ЕСТЬ NULL
|		
|		СГРУППИРОВАТЬ ПО
|			ДействующиеСкидки.СкидкаНаценка
|		
|		ОБЪЕДИНИТЬ ВСЕ
|		
|		ВЫБРАТЬ
|			ДействующиеСкидки.СкидкаНаценка,
|			СУММА(ТаблицаТовары.Количество),
|			СУММА(ТаблицаТовары.Сумма)
|		ИЗ
|			ДействующиеСкидки КАК ДействующиеСкидки,
|			ТаблицаТовары КАК ТаблицаТовары
|		ГДЕ
|			(ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Промокод)
|					ИЛИ ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.БонусРефералу))
|			И ДействующиеСкидки.СкидкаНаценка.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|		
|		СГРУППИРОВАТЬ ПО
|			ДействующиеСкидки.СкидкаНаценка) КАК ТоварыПоСегменту
|		ПО (ТоварыПоСегменту.СкидкаНаценка = ДействующиеСкидки.СкидкаНаценка)
|ГДЕ
|	(ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Промокод)
|			ИЛИ ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.БонусРефералу))
|	И ДействующиеСкидки.СкидкаНаценка.Промокод = &ВидПромокода
|	И &ПромокодыИспользуются
|
|СГРУППИРОВАТЬ ПО
|	ДействующиеСкидки.СкидкаНаценка
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка
|ПОМЕСТИТЬ ДействующиеСкидкиПоУсловиюКоличества
|ИЗ
|	ДействующиеСкидки КАК ДействующиеСкидки
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка,
|			СУММА(ТаблицаТовары.Количество) КАК Количество,
|			СУММА(ТаблицаТовары.Сумма) КАК Сумма
|		ИЗ
|			ДействующиеСкидки КАК ДействующиеСкидки
|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК СоставСегментов
|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК ТаблицаТовары
|					ПО СоставСегментов.Номенклатура = ТаблицаТовары.Номенклатура
|				ПО ДействующиеСкидки.СегментНоменклатуры = СоставСегментов.Сегмент
|		ГДЕ
|			ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Количество)
|			И ДействующиеСкидки.ОбъектСкидки = ЗНАЧЕНИЕ(Перечисление.ОбъектСкидок.НаДокумент)
|			И НЕ ДействующиеСкидки.СкидкаНаценка.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|			И НЕ ТаблицаТовары.Номенклатура ЕСТЬ NULL
|		
|		СГРУППИРОВАТЬ ПО
|			ДействующиеСкидки.СкидкаНаценка
|		
|		ОБЪЕДИНИТЬ ВСЕ
|		
|		ВЫБРАТЬ
|			ДействующиеСкидки.СкидкаНаценка,
|			СУММА(ТаблицаТовары.Количество),
|			СУММА(ТаблицаТовары.Сумма)
|		ИЗ
|			ДействующиеСкидки КАК ДействующиеСкидки,
|			ТаблицаТовары КАК ТаблицаТовары
|		ГДЕ
|			ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Количество)
|			И ДействующиеСкидки.ОбъектСкидки = ЗНАЧЕНИЕ(Перечисление.ОбъектСкидок.НаДокумент)
|			И ДействующиеСкидки.СкидкаНаценка.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|		
|		СГРУППИРОВАТЬ ПО
|			ДействующиеСкидки.СкидкаНаценка) КАК ТоварыПоСегменту
|		ПО (ТоварыПоСегменту.СкидкаНаценка = ДействующиеСкидки.СкидкаНаценка)
|ГДЕ
|	ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Количество)
|	И ДействующиеСкидки.ОбъектСкидки = ЗНАЧЕНИЕ(Перечисление.ОбъектСкидок.НаДокумент)
|	И (ДействующиеСкидки.СкидкаНаценка.ВидСравненияУсловия = ИСТИНА
|				И ДействующиеСкидки.СкидкаНаценка.ЗначениеУсловия <= ТоварыПоСегменту.Количество
|			ИЛИ ДействующиеСкидки.СкидкаНаценка.ВидСравненияУсловия = ЛОЖЬ
|				И ДействующиеСкидки.СкидкаНаценка.ЗначениеУсловия >= ТоварыПоСегменту.Количество)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ДействующиеСкидкиПоНомерПокупки.СкидкаНаценка КАК СкидкаНаценка,
|	СУММА(ДействующиеСкидкиПоНомерПокупки.КоличествоНомерПокупки) КАК КоличествоНомерПокупки
|ПОМЕСТИТЬ ДействующиеСкидкиПоУсловиюНомерПокупкиВременная
|ИЗ
|	(ВЫБРАТЬ
|		ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка,
|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажиПоКонтрагенту.ДокументПродажи) КАК КоличествоНомерПокупки
|	ИЗ
|		ДействующиеСкидки КАК ДействующиеСкидки
|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК СоставСегментов
|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(
|						,
|						&ДатаСкидок,
|						Авто,
|						Контрагент = &Получатель
|							ИЛИ КартаКонтрагента = &КартаКонтрагента) КАК ПродажиПоКонтрагенту
|				ПО СоставСегментов.Номенклатура = ПродажиПоКонтрагенту.Номенклатура
|			ПО ДействующиеСкидки.СегментНоменклатуры = СоставСегментов.Сегмент
|	ГДЕ
|		ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.НомерПокупки)
|		И ВЫБОР
|				КОГДА ДействующиеСкидки.ПериодНакопленияТип = ЗНАЧЕНИЕ(Перечисление.Периодичность.ДЕНЬ)
|					ТОГДА ПродажиПоКонтрагенту.ПериодДень МЕЖДУ ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаСкидок, ДЕНЬ), СЕКУНДА, 1), ДЕНЬ, -1 * ДействующиеСкидки.ПериодНакопления) И &ДатаСкидок
|				КОГДА ДействующиеСкидки.ПериодНакопленияТип = ЗНАЧЕНИЕ(Перечисление.Периодичность.МЕСЯЦ)
|					ТОГДА ПродажиПоКонтрагенту.ПериодДень МЕЖДУ ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаСкидок, ДЕНЬ), СЕКУНДА, 1), МЕСЯЦ, -1 * ДействующиеСкидки.ПериодНакопления) И &ДатаСкидок
|				КОГДА ДействующиеСкидки.ПериодНакопленияТип = ЗНАЧЕНИЕ(Перечисление.Периодичность.ГОД)
|					ТОГДА ПродажиПоКонтрагенту.ПериодДень МЕЖДУ ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаСкидок, ДЕНЬ), СЕКУНДА, 1), ГОД, -1 * ДействующиеСкидки.ПериодНакопления) И &ДатаСкидок
|				ИНАЧЕ ИСТИНА
|			КОНЕЦ
|		И ВЫБОР
|				КОГДА ДействующиеСкидки.ОбъектНакопления В (ЗНАЧЕНИЕ(Перечисление.ОбъектНакопления.ПоКлиенту), ЗНАЧЕНИЕ(Перечисление.ОбъектНакопления.ПустаяСсылка))
|					ТОГДА ПродажиПоКонтрагенту.Контрагент = &Получатель
|				КОГДА ДействующиеСкидки.ОбъектНакопления = ЗНАЧЕНИЕ(Перечисление.ОбъектНакопления.ПоКарте)
|					ТОГДА ПродажиПоКонтрагенту.КартаКонтрагента = &КартаКонтрагента
|							И ПродажиПоКонтрагенту.КартаКонтрагента <> ЗНАЧЕНИЕ(Справочник.Карты.ПустаяСсылка)
|			КОНЕЦ
|		И ПродажиПоКонтрагенту.Регистратор <> &ДокументСсылка
|		И НЕ ДействующиеСкидки.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|		И НЕ ПродажиПоКонтрагенту.Номенклатура ЕСТЬ NULL
|	
|	СГРУППИРОВАТЬ ПО
|		ДействующиеСкидки.СкидкаНаценка
|	
|	ОБЪЕДИНИТЬ ВСЕ
|	
|	ВЫБРАТЬ
|		ДействующиеСкидки.СкидкаНаценка,
|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажиПоКонтрагенту.ДокументПродажи)
|	ИЗ
|		ДействующиеСкидки КАК ДействующиеСкидки,
|		РегистрНакопления.Продажи.Обороты(
|				,
|				&ДатаСкидок,
|				Авто,
|				Контрагент = &Получатель
|					ИЛИ КартаКонтрагента = &КартаКонтрагента) КАК ПродажиПоКонтрагенту
|	ГДЕ
|		ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.НомерПокупки)
|		И ВЫБОР
|				КОГДА ДействующиеСкидки.ПериодНакопленияТип = ЗНАЧЕНИЕ(Перечисление.Периодичность.ДЕНЬ)
|					ТОГДА ПродажиПоКонтрагенту.ПериодДень МЕЖДУ ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаСкидок, ДЕНЬ), СЕКУНДА, 1), ДЕНЬ, -1 * ДействующиеСкидки.ПериодНакопления) И &ДатаСкидок
|				КОГДА ДействующиеСкидки.ПериодНакопленияТип = ЗНАЧЕНИЕ(Перечисление.Периодичность.МЕСЯЦ)
|					ТОГДА ПродажиПоКонтрагенту.ПериодДень МЕЖДУ ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаСкидок, ДЕНЬ), СЕКУНДА, 1), МЕСЯЦ, -1 * ДействующиеСкидки.ПериодНакопления) И &ДатаСкидок
|				КОГДА ДействующиеСкидки.ПериодНакопленияТип = ЗНАЧЕНИЕ(Перечисление.Периодичность.ГОД)
|					ТОГДА ПродажиПоКонтрагенту.ПериодДень МЕЖДУ ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаСкидок, ДЕНЬ), СЕКУНДА, 1), ГОД, -1 * ДействующиеСкидки.ПериодНакопления) И &ДатаСкидок
|				ИНАЧЕ ИСТИНА
|			КОНЕЦ
|		И ВЫБОР
|				КОГДА ДействующиеСкидки.ОбъектНакопления В (ЗНАЧЕНИЕ(Перечисление.ОбъектНакопления.ПоКлиенту), ЗНАЧЕНИЕ(Перечисление.ОбъектНакопления.Пустаяссылка))
|					ТОГДА ПродажиПоКонтрагенту.Контрагент = &Получатель
|				КОГДА ДействующиеСкидки.ОбъектНакопления = ЗНАЧЕНИЕ(Перечисление.ОбъектНакопления.ПоКарте)
|					ТОГДА ПродажиПоКонтрагенту.КартаКонтрагента = &КартаКонтрагента
|							И ПродажиПоКонтрагенту.КартаКонтрагента <> ЗНАЧЕНИЕ(Справочник.Карты.ПустаяСсылка)
|			КОНЕЦ
|		И ПродажиПоКонтрагенту.Регистратор <> &ДокументСсылка
|		И ДействующиеСкидки.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|	
|	СГРУППИРОВАТЬ ПО
|		ДействующиеСкидки.СкидкаНаценка
|	
|	ОБЪЕДИНИТЬ ВСЕ
|	
|	ВЫБРАТЬ
|		ДействующиеСкидки.СкидкаНаценка,
|		0
|	ИЗ
|		ДействующиеСкидки КАК ДействующиеСкидки
|	ГДЕ
|		ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.НомерПокупки)) КАК ДействующиеСкидкиПоНомерПокупки
|ГДЕ
|	ДействующиеСкидкиПоНомерПокупки.СкидкаНаценка.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.НомерПокупки)
|	И ДействующиеСкидкиПоНомерПокупки.СкидкаНаценка.ЗначениеУсловия > 0
|
|СГРУППИРОВАТЬ ПО
|	ДействующиеСкидкиПоНомерПокупки.СкидкаНаценка
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ДействующиеСкидкиПоУсловиюНомерПокупкиВременная.СкидкаНаценка КАК СкидкаНаценка
|ПОМЕСТИТЬ ДействующиеСкидкиПоУсловиюНомерПокупки
|ИЗ
|	ДействующиеСкидкиПоУсловиюНомерПокупкиВременная КАК ДействующиеСкидкиПоУсловиюНомерПокупкиВременная
|ГДЕ
|	ВЫБОР
|			КОГДА ДействующиеСкидкиПоУсловиюНомерПокупкиВременная.СкидкаНаценка.ЗначениеУсловия = 1
|				ТОГДА ЕСТЬNULL(ДействующиеСкидкиПоУсловиюНомерПокупкиВременная.КоличествоНомерПокупки, 0) = 0
|			ИНАЧЕ (ЕСТЬNULL(ДействующиеСкидкиПоУсловиюНомерПокупкиВременная.КоличествоНомерПокупки, 0) + 1) / ДействующиеСкидкиПоУсловиюНомерПокупкиВременная.СкидкаНаценка.ЗначениеУсловия = (ВЫРАЗИТЬ((ЕСТЬNULL(ДействующиеСкидкиПоУсловиюНомерПокупкиВременная.КоличествоНомерПокупки, 0) + 1) / ДействующиеСкидкиПоУсловиюНомерПокупкиВременная.СкидкаНаценка.ЗначениеУсловия - 0.499 КАК ЧИСЛО(15, 0)))
|		КОНЕЦ
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка
|ПОМЕСТИТЬ ДействующиеСкидкиПоУсловиюДняРождения
|ИЗ
|	ДействующиеСкидки КАК ДействующиеСкидки
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка
|		ИЗ
|			ДействующиеСкидки КАК ДействующиеСкидки
|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК СоставСегментов
|					ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТовары КАК ТаблицаТовары
|					ПО СоставСегментов.Номенклатура = ТаблицаТовары.Номенклатура
|				ПО ДействующиеСкидки.СегментНоменклатуры = СоставСегментов.Сегмент
|		ГДЕ
|			НЕ ДействующиеСкидки.СкидкаНаценка.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|			И НЕ ТаблицаТовары.Номенклатура ЕСТЬ NULL
|			И ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ДеньРождения)
|		
|		ОБЪЕДИНИТЬ
|		
|		ВЫБРАТЬ
|			ДействующиеСкидки.СкидкаНаценка
|		ИЗ
|			ДействующиеСкидки КАК ДействующиеСкидки,
|			ТаблицаТовары КАК ТаблицаТовары
|		ГДЕ
|			ДействующиеСкидки.СкидкаНаценка.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|			И ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ДеньРождения)) КАК ТоварыПоСегменту
|		ПО (ТоварыПоСегменту.СкидкаНаценка = ДействующиеСкидки.СкидкаНаценка)
|ГДЕ
|	ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ДеньРождения)
|	И &ДеньРождения МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаСкидок, ДЕНЬ, -ДействующиеСкидки.СкидкаНаценка.ЗначениеУсловия2), ДЕНЬ) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаСкидок, ДЕНЬ, ДействующиеСкидки.СкидкаНаценка.ЗначениеУсловия), ДЕНЬ)
|	И ВЫБОР
|			КОГДА ДействующиеСкидки.СегментНоменклатуры <> ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|				ТОГДА ТоварыПоСегменту.СкидкаНаценка <> ЗНАЧЕНИЕ(Справочник.СкидкиНаценки.ПустаяСсылка)
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка,
|	ПродажиПоКонтрагенту.Контрагент КАК Контрагент,
|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажиПоКонтрагенту.ДокументПродажи) КАК КоличествоОборот,
|	СУММА(ПродажиПоКонтрагенту.СтоимостьОборот) КАК СтоимостьОборот
|ПОМЕСТИТЬ ДействующиеНакопительныеСкидкиВрем
|ИЗ
|	ДействующиеСкидки КАК ДействующиеСкидки
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(, &ДатаСкидок, Авто, Контрагент В (&МассивКонтрагентов)) КАК ПродажиПоКонтрагенту
|		ПО (ВЫБОР
|				КОГДА ДействующиеСкидки.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.сегментыноменклатуры.пустаяссылка)
|					ТОГДА ИСТИНА
|				ИНАЧЕ (ПродажиПоКонтрагенту.Номенклатура, ДействующиеСкидки.СегментНоменклатуры) В
|						(ВЫБРАТЬ
|							СоставСегментов.Номенклатура,
|							СоставСегментов.Сегмент
|						ИЗ
|							РегистрСведений.НоменклатураСегмента КАК СоставСегментов)
|			КОНЕЦ)
|ГДЕ
|	ДействующиеСкидки.УсловиеПредоставленияСкидки В (ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Сумма), ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Количество))
|	И ДействующиеСкидки.ОбъектСкидки = ЗНАЧЕНИЕ(Перечисление.ОбъектСкидок.ПоПродажам)
|	И ВЫБОР
|			КОГДА НЕ ПродажиПоКонтрагенту.Контрагент ЕСТЬ NULL
|				ТОГДА ПродажиПоКонтрагенту.ПериодДень МЕЖДУ ВЫБОР
|						КОГДА ДействующиеСкидки.ПериодНакопленияТип = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
|							ТОГДА ДОБАВИТЬКДАТЕ(&ДатаСкидок, МЕСЯЦ, -1 * ДействующиеСкидки.ПериодНакопления)
|						ИНАЧЕ ДОБАВИТЬКДАТЕ(&ДатаСкидок, ДЕНЬ, -1 * ДействующиеСкидки.ПериодНакопления)
|					КОНЕЦ И &ДатаСкидок
|						И ВЫБОР
|							КОГДА ДействующиеСкидки.ОбъектНакопления В (ЗНАЧЕНИЕ(Перечисление.ОбъектНакопления.ПоКлиенту), ЗНАЧЕНИЕ(Перечисление.ОбъектНакопления.Пустаяссылка))
|								ТОГДА ПродажиПоКонтрагенту.Контрагент В (&МассивКонтрагентов)
|							КОГДА ДействующиеСкидки.ОбъектНакопления = ЗНАЧЕНИЕ(Перечисление.ОбъектНакопления.ПоКарте)
|								ТОГДА ПродажиПоКонтрагенту.КартаКонтрагента = &КартаКонтрагента
|										И ПродажиПоКонтрагенту.КартаКонтрагента <> ЗНАЧЕНИЕ(Справочник.Карты.ПустаяСсылка)
|						КОНЕЦ
|						И ПродажиПоКонтрагенту.Регистратор <> &ДокументСсылка
|			ИНАЧЕ ВЫБОР
|					КОГДА ДействующиеСкидки.ВидСравненияУсловия = ЛОЖЬ
|						ТОГДА ИСТИНА
|					ИНАЧЕ ЛОЖЬ
|				КОНЕЦ
|		КОНЕЦ
|
|СГРУППИРОВАТЬ ПО
|	ДействующиеСкидки.СкидкаНаценка,
|	ПродажиПоКонтрагенту.Контрагент
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
|	ДействующиеНакопительныеСкидки.СкидкаНаценка КАК СкидкаНаценка
|ПОМЕСТИТЬ ДействующиеНакопительныеСкидки
|ИЗ
|	ДействующиеНакопительныеСкидкиВрем КАК ДействующиеНакопительныеСкидки
|ГДЕ
|	ДействующиеНакопительныеСкидки.СкидкаНаценка.УсловиеПредоставленияСкидки В (ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Сумма), ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Количество))
|	И ДействующиеНакопительныеСкидки.СкидкаНаценка.ОбъектСкидки = ЗНАЧЕНИЕ(Перечисление.ОбъектСкидок.ПоПродажам)
|	И ВЫБОР
|			КОГДА ДействующиеНакопительныеСкидки.СкидкаНаценка.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Количество)
|				ТОГДА ДействующиеНакопительныеСкидки.СкидкаНаценка.ВидСравненияУсловия = ИСТИНА
|							И ЕСТЬNULL(ДействующиеНакопительныеСкидки.СкидкаНаценка.ЗначениеУсловия, 0) <= ЕСТЬNULL(ДействующиеНакопительныеСкидки.КоличествоОборот, 0)
|						ИЛИ ДействующиеНакопительныеСкидки.СкидкаНаценка.ВидСравненияУсловия = ЛОЖЬ
|							И ЕСТЬNULL(ДействующиеНакопительныеСкидки.СкидкаНаценка.ЗначениеУсловия, 0) >= ЕСТЬNULL(ДействующиеНакопительныеСкидки.КоличествоОборот, 0)
|			ИНАЧЕ ВЫБОР
|					КОГДА ДействующиеНакопительныеСкидки.СкидкаНаценка.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Сумма)
|						ТОГДА ДействующиеНакопительныеСкидки.СкидкаНаценка.ВидСравненияУсловия = ИСТИНА
|									И ЕСТЬNULL(ДействующиеНакопительныеСкидки.СкидкаНаценка.ЗначениеУсловия, 0) <= ЕСТЬNULL(ДействующиеНакопительныеСкидки.СтоимостьОборот, 0)
|								ИЛИ ДействующиеНакопительныеСкидки.СкидкаНаценка.ВидСравненияУсловия = ЛОЖЬ
|									И ЕСТЬNULL(ДействующиеНакопительныеСкидки.СкидкаНаценка.ЗначениеУсловия, 0) >= ЕСТЬNULL(ДействующиеНакопительныеСкидки.СтоимостьОборот, 0)
|					ИНАЧЕ ИСТИНА
|				КОНЕЦ
|		КОНЕЦ
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка
|ПОМЕСТИТЬ ДействующиеСкидкиПоУсловиюОстатокНаЛицевомСчете
|ИЗ
|	ДействующиеСкидки КАК ДействующиеСкидки
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка
|		ИЗ
|			ДействующиеСкидки КАК ДействующиеСкидки
|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК СоставСегментов
|					ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТовары КАК ТаблицаТовары
|					ПО СоставСегментов.Номенклатура = ТаблицаТовары.Номенклатура
|				ПО ДействующиеСкидки.СегментНоменклатуры = СоставСегментов.Сегмент
|		ГДЕ
|			НЕ ДействующиеСкидки.СкидкаНаценка.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|			И НЕ ТаблицаТовары.Номенклатура ЕСТЬ NULL
|			И ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ОстатокНаЛицевомСчете)
|		
|		ОБЪЕДИНИТЬ
|		
|		ВЫБРАТЬ
|			ДействующиеСкидки.СкидкаНаценка
|		ИЗ
|			ДействующиеСкидки КАК ДействующиеСкидки,
|			ТаблицаТовары КАК ТаблицаТовары
|		ГДЕ
|			ДействующиеСкидки.СкидкаНаценка.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|			И ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ОстатокНаЛицевомСчете)) КАК ТоварыПоСегменту
|		ПО (ТоварыПоСегменту.СкидкаНаценка = ДействующиеСкидки.СкидкаНаценка)
|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			РасчетыСПокупателямиОстатки.ВидСчета КАК ВидЛицевогоСчета,
|			СУММА(РасчетыСПокупателямиОстатки.СуммаОстаток) КАК СуммаОстаток
|		ИЗ
|			РегистрНакопления.ДенежныеСредстваНаЛицевыхСчетах.Остатки(&ДатаСкидок, Контрагент В (&МассивКонтрагентов)) КАК РасчетыСПокупателямиОстатки
|		
|		СГРУППИРОВАТЬ ПО
|			РасчетыСПокупателямиОстатки.ВидСчета) КАК ОстатокНаЛицевомСчете
|		ПО ДействующиеСкидки.ВидЛицевогоСчета = ОстатокНаЛицевомСчете.ВидЛицевогоСчета
|ГДЕ
|	ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ОстатокНаЛицевомСчете)
|	И (ДействующиеСкидки.СкидкаНаценка.ВидСравненияУсловия = ИСТИНА
|				И ДействующиеСкидки.СкидкаНаценка.ЗначениеУсловия <= ЕСТЬNULL(ОстатокНаЛицевомСчете.СуммаОстаток, 0)
|			ИЛИ ДействующиеСкидки.СкидкаНаценка.ВидСравненияУсловия = ЛОЖЬ
|				И ДействующиеСкидки.СкидкаНаценка.ЗначениеУсловия >= ЕСТЬNULL(ОстатокНаЛицевомСчете.СуммаОстаток, 0))
|	И ВЫБОР
|			КОГДА ДействующиеСкидки.СегментНоменклатуры <> ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|				ТОГДА ТоварыПоСегменту.СкидкаНаценка <> ЗНАЧЕНИЕ(Справочник.СкидкиНаценки.ПустаяСсылка)
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ
|	И ДействующиеСкидки.ВидЛицевогоСчета <> ЗНАЧЕНИЕ(Справочник.ВидыЛицевыхСчетов.ПустаяСсылка)
|	И ДействующиеСкидки.НеСуммироватьЛицевыеСчетаРодственников = ЛОЖЬ
|
|СГРУППИРОВАТЬ ПО
|	ДействующиеСкидки.СкидкаНаценка
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ДействующиеСкидки.СкидкаНаценка
|ИЗ
|	ДействующиеСкидки КАК ДействующиеСкидки
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка
|		ИЗ
|			ДействующиеСкидки КАК ДействующиеСкидки
|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК СоставСегментов
|					ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТовары КАК ТаблицаТовары
|					ПО СоставСегментов.Номенклатура = ТаблицаТовары.Номенклатура
|				ПО ДействующиеСкидки.СегментНоменклатуры = СоставСегментов.Сегмент
|		ГДЕ
|			НЕ ДействующиеСкидки.СкидкаНаценка.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|			И НЕ ТаблицаТовары.Номенклатура ЕСТЬ NULL
|			И ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ОстатокНаЛицевомСчете)
|		
|		ОБЪЕДИНИТЬ
|		
|		ВЫБРАТЬ
|			ДействующиеСкидки.СкидкаНаценка
|		ИЗ
|			ДействующиеСкидки КАК ДействующиеСкидки,
|			ТаблицаТовары КАК ТаблицаТовары
|		ГДЕ
|			ДействующиеСкидки.СкидкаНаценка.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|			И ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ОстатокНаЛицевомСчете)) КАК ТоварыПоСегменту
|		ПО (ТоварыПоСегменту.СкидкаНаценка = ДействующиеСкидки.СкидкаНаценка)
|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			СУММА(РасчетыСПокупателямиОстатки.СуммаОстаток) КАК СуммаОстаток
|		ИЗ
|			РегистрНакопления.ДенежныеСредстваНаЛицевыхСчетах.Остатки(&ДатаСкидок, Контрагент В (&МассивКонтрагентов)) КАК РасчетыСПокупателямиОстатки) КАК ОстаткиНаЛицевыхСчетах
|		ПО (ИСТИНА)
|ГДЕ
|	ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ОстатокНаЛицевомСчете)
|	И (ДействующиеСкидки.СкидкаНаценка.ВидСравненияУсловия = ИСТИНА
|				И ДействующиеСкидки.СкидкаНаценка.ЗначениеУсловия <= ЕСТЬNULL(ОстаткиНаЛицевыхСчетах.СуммаОстаток, 0)
|			ИЛИ ДействующиеСкидки.СкидкаНаценка.ВидСравненияУсловия = ЛОЖЬ
|				И ДействующиеСкидки.СкидкаНаценка.ЗначениеУсловия >= ЕСТЬNULL(ОстаткиНаЛицевыхСчетах.СуммаОстаток, 0))
|	И ВЫБОР
|			КОГДА ДействующиеСкидки.СегментНоменклатуры <> ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|				ТОГДА ТоварыПоСегменту.СкидкаНаценка <> ЗНАЧЕНИЕ(Справочник.СкидкиНаценки.ПустаяСсылка)
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ
|	И ДействующиеСкидки.ВидЛицевогоСчета = ЗНАЧЕНИЕ(Справочник.ВидыЛицевыхСчетов.ПустаяСсылка)
|	И ДействующиеСкидки.НеСуммироватьЛицевыеСчетаРодственников = ЛОЖЬ
|
|СГРУППИРОВАТЬ ПО
|	ДействующиеСкидки.СкидкаНаценка
|
|ОБЪЕДИНИТЬ
|
|ВЫБРАТЬ
|	ДействующиеСкидки.СкидкаНаценка
|ИЗ
|	ДействующиеСкидки КАК ДействующиеСкидки
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка
|		ИЗ
|			ДействующиеСкидки КАК ДействующиеСкидки
|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК СоставСегментов
|					ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТовары КАК ТаблицаТовары
|					ПО СоставСегментов.Номенклатура = ТаблицаТовары.Номенклатура
|				ПО ДействующиеСкидки.СегментНоменклатуры = СоставСегментов.Сегмент
|		ГДЕ
|			НЕ ДействующиеСкидки.СкидкаНаценка.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|			И НЕ ТаблицаТовары.Номенклатура ЕСТЬ NULL
|			И ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ОстатокНаЛицевомСчете)
|		
|		ОБЪЕДИНИТЬ
|		
|		ВЫБРАТЬ
|			ДействующиеСкидки.СкидкаНаценка
|		ИЗ
|			ДействующиеСкидки КАК ДействующиеСкидки,
|			ТаблицаТовары КАК ТаблицаТовары
|		ГДЕ
|			ДействующиеСкидки.СкидкаНаценка.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|			И ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ОстатокНаЛицевомСчете)) КАК ТоварыПоСегменту
|		ПО (ТоварыПоСегменту.СкидкаНаценка = ДействующиеСкидки.СкидкаНаценка)
|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			РасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
|			РасчетыСПокупателямиОстатки.ВидСчета КАК ВидЛицевогоСчета,
|			СУММА(РасчетыСПокупателямиОстатки.СуммаОстаток) КАК СуммаОстаток
|		ИЗ
|			РегистрНакопления.ДенежныеСредстваНаЛицевыхСчетах.Остатки(&ДатаСкидок, Контрагент В (&РодственникиКлиента)) КАК РасчетыСПокупателямиОстатки
|		
|		СГРУППИРОВАТЬ ПО
|			РасчетыСПокупателямиОстатки.ВидСчета,
|			РасчетыСПокупателямиОстатки.Контрагент) КАК ОстатокНаЛицевомСчете
|		ПО ДействующиеСкидки.ВидЛицевогоСчета = ОстатокНаЛицевомСчете.ВидЛицевогоСчета
|ГДЕ
|	ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ОстатокНаЛицевомСчете)
|	И (ДействующиеСкидки.СкидкаНаценка.ВидСравненияУсловия = ИСТИНА
|				И ДействующиеСкидки.СкидкаНаценка.ЗначениеУсловия <= ЕСТЬNULL(ОстатокНаЛицевомСчете.СуммаОстаток, 0)
|			ИЛИ ДействующиеСкидки.СкидкаНаценка.ВидСравненияУсловия = ЛОЖЬ
|				И ДействующиеСкидки.СкидкаНаценка.ЗначениеУсловия >= ЕСТЬNULL(ОстатокНаЛицевомСчете.СуммаОстаток, 0))
|	И ВЫБОР
|			КОГДА ДействующиеСкидки.СегментНоменклатуры <> ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|				ТОГДА ТоварыПоСегменту.СкидкаНаценка <> ЗНАЧЕНИЕ(Справочник.СкидкиНаценки.ПустаяСсылка)
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ
|	И ДействующиеСкидки.ВидЛицевогоСчета <> ЗНАЧЕНИЕ(Справочник.ВидыЛицевыхСчетов.ПустаяСсылка)
|	И ДействующиеСкидки.НеСуммироватьЛицевыеСчетаРодственников = ИСТИНА
|
|СГРУППИРОВАТЬ ПО
|	ДействующиеСкидки.СкидкаНаценка
|
|ОБЪЕДИНИТЬ
|
|ВЫБРАТЬ
|	ДействующиеСкидки.СкидкаНаценка
|ИЗ
|	ДействующиеСкидки КАК ДействующиеСкидки
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка
|		ИЗ
|			ДействующиеСкидки КАК ДействующиеСкидки
|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК СоставСегментов
|					ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТовары КАК ТаблицаТовары
|					ПО СоставСегментов.Номенклатура = ТаблицаТовары.Номенклатура
|				ПО ДействующиеСкидки.СегментНоменклатуры = СоставСегментов.Сегмент
|		ГДЕ
|			НЕ ДействующиеСкидки.СкидкаНаценка.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|			И НЕ ТаблицаТовары.Номенклатура ЕСТЬ NULL
|			И ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ОстатокНаЛицевомСчете)
|		
|		ОБЪЕДИНИТЬ
|		
|		ВЫБРАТЬ
|			ДействующиеСкидки.СкидкаНаценка
|		ИЗ
|			ДействующиеСкидки КАК ДействующиеСкидки,
|			ТаблицаТовары КАК ТаблицаТовары
|		ГДЕ
|			ДействующиеСкидки.СкидкаНаценка.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|			И ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ОстатокНаЛицевомСчете)) КАК ТоварыПоСегменту
|		ПО (ТоварыПоСегменту.СкидкаНаценка = ДействующиеСкидки.СкидкаНаценка)
|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			СУММА(РасчетыСПокупателямиОстатки.СуммаОстаток) КАК СуммаОстаток,
|			РасчетыСПокупателямиОстатки.Контрагент КАК Контрагент
|		ИЗ
|			РегистрНакопления.ДенежныеСредстваНаЛицевыхСчетах.Остатки(&ДатаСкидок, Контрагент В (&РодственникиКлиента)) КАК РасчетыСПокупателямиОстатки
|		
|		СГРУППИРОВАТЬ ПО
|			РасчетыСПокупателямиОстатки.Контрагент) КАК ОстаткиНаЛицевыхСчетах
|		ПО (ИСТИНА)
|ГДЕ
|	ДействующиеСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ОстатокНаЛицевомСчете)
|	И (ДействующиеСкидки.СкидкаНаценка.ВидСравненияУсловия = ИСТИНА
|				И ДействующиеСкидки.СкидкаНаценка.ЗначениеУсловия <= ЕСТЬNULL(ОстаткиНаЛицевыхСчетах.СуммаОстаток, 0)
|			ИЛИ ДействующиеСкидки.СкидкаНаценка.ВидСравненияУсловия = ЛОЖЬ
|				И ДействующиеСкидки.СкидкаНаценка.ЗначениеУсловия >= ЕСТЬNULL(ОстаткиНаЛицевыхСчетах.СуммаОстаток, 0))
|	И ВЫБОР
|			КОГДА ДействующиеСкидки.СегментНоменклатуры <> ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|				ТОГДА ТоварыПоСегменту.СкидкаНаценка <> ЗНАЧЕНИЕ(Справочник.СкидкиНаценки.ПустаяСсылка)
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ
|	И ДействующиеСкидки.ВидЛицевогоСчета = ЗНАЧЕНИЕ(Справочник.ВидыЛицевыхСчетов.ПустаяСсылка)
|	И ДействующиеСкидки.НеСуммироватьЛицевыеСчетаРодственников = ИСТИНА
|
|СГРУППИРОВАТЬ ПО
|	ДействующиеСкидки.СкидкаНаценка
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ДействующиеОграниченныеКоличествомПримененийСкидки.СкидкаНаценка КАК СкидкаНаценка,
|	ДействующиеОграниченныеКоличествомПримененийСкидки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
|	ДействующиеОграниченныеКоличествомПримененийСкидки.КоличествоПрименений КАК КоличествоПрименений,
|	ДействующиеОграниченныеКоличествомПримененийСкидки.КоличествоПримененийФактическое КАК КоличествоПримененийФактическое
|ПОМЕСТИТЬ ДействующиеОграниченныеКоличествомПримененийСкидки
|ИЗ
|	(ВЫБРАТЬ
|		ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка,
|		ДействующиеСкидки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
|		ДействующиеСкидки.ДатаНачала КАК ДатаНачала,
|		ДействующиеСкидки.ДатаОкончания КАК ДатаОкончания,
|		ДействующиеСкидки.КоличествоПрименений КАК КоличествоПрименений,
|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПредоставленныеСкидки.ДокументПродажи) КАК КоличествоПримененийФактическое
|	ИЗ
|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
|			ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка,
|			ДействиеСкидокНаценок.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
|			ДействиеСкидокНаценок.ДатаНачала КАК ДатаНачала,
|			ДействиеСкидокНаценок.ДатаОкончания КАК ДатаОкончания,
|			ДействиеСкидокНаценок.КоличествоПрименений КАК КоличествоПрименений,
|			ДействиеСкидокНаценок.КоличествоПримененийПоКлиенту КАК КоличествоПримененийПоКлиенту
|		ИЗ
|			ДействующиеСкидки КАК ДействующиеСкидки
|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
|				ПО (ДействиеСкидокНаценок.СкидкаНаценка = ДействующиеСкидки.СкидкаНаценка)) КАК ДействующиеСкидки
|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПредоставленныеСкидки КАК ПредоставленныеСкидки
|			ПО (ПредоставленныеСкидки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)
|				И (ПредоставленныеСкидки.Период <= &ДатаСкидок)
|				И (ТИПЗНАЧЕНИЯ(ПредоставленныеСкидки.Регистратор) В (ТИП(Документ.Прием), ТИП(Документ.Реализация)))
|				И (ПредоставленныеСкидки.Регистратор <> &ДокументСсылка)
|				И (ПредоставленныеСкидки.СтруктурнаяЕдиница = ДействующиеСкидки.СтруктурнаяЕдиница)
|				И (ПредоставленныеСкидки.СкидкаНаценка = ДействующиеСкидки.СкидкаНаценка)
|				И (ПредоставленныеСкидки.Период >= ДействующиеСкидки.ДатаНачала
|					ИЛИ ДействующиеСкидки.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
|				И (ПредоставленныеСкидки.Период <= ДействующиеСкидки.ДатаОкончания
|					ИЛИ ДействующиеСкидки.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
|				И (ВЫБОР
|					КОГДА ДействующиеСкидки.КоличествоПримененийПоКлиенту
|						ТОГДА ПредоставленныеСкидки.Контрагент = &Получатель
|					ИНАЧЕ ИСТИНА
|				КОНЕЦ)
|	
|	СГРУППИРОВАТЬ ПО
|		ДействующиеСкидки.СкидкаНаценка,
|		ДействующиеСкидки.СтруктурнаяЕдиница,
|		ДействующиеСкидки.ДатаНачала,
|		ДействующиеСкидки.ДатаОкончания,
|		ДействующиеСкидки.КоличествоПрименений) КАК ДействующиеОграниченныеКоличествомПримененийСкидки
|ГДЕ
|	ДействующиеОграниченныеКоличествомПримененийСкидки.КоличествоПрименений > 0
|	И ДействующиеОграниченныеКоличествомПримененийСкидки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
|	И ДействующиеОграниченныеКоличествомПримененийСкидки.КоличествоПрименений > ДействующиеОграниченныеКоличествомПримененийСкидки.КоличествоПримененийФактическое
|	И (ДействующиеОграниченныеКоличествомПримененийСкидки.ДатаНачала <= &ДатаСкидок
|			ИЛИ ДействующиеОграниченныеКоличествомПримененийСкидки.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
|	И (ДействующиеОграниченныеКоличествомПримененийСкидки.ДатаОкончания >= &ДатаСкидок
|			ИЛИ ДействующиеОграниченныеКоличествомПримененийСкидки.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ТаблицаТоварыСкидки.СкидкаНаценка КАК СкидкаНаценка,
|	ТаблицаТоварыСкидки.Номенклатура КАК Номенклатура,
|	ТаблицаТоварыСкидки.КоличествоУпаковок КАК КоличествоУпаковок,
|	ТаблицаТоварыСкидки.Упаковка КАК Упаковка,
|	ТаблицаТоварыСкидки.Количество КАК Количество,
|	ТаблицаТоварыСкидки.Цена КАК Цена,
|	ТаблицаТоварыСкидки.Сумма КАК Сумма,
|	ТаблицаТоварыСкидки.НомерСтроки КАК НомерСтроки,
|	ТаблицаТоварыСкидки.КлючСтроки КАК КлючСтроки,
|	ТаблицаТоварыСкидки.ЗначениеСкидкиНаценки КАК ЗначениеСкидкиНаценки,
|	ТаблицаТоварыСкидки.ЗначениеСкидкиНаценкиОбъектом КАК ЗначениеСкидкиНаценкиОбъектом,
|	ТаблицаТоварыСкидки.НачислениеБонусами КАК НачислениеБонусами,
|	ТаблицаТоварыСкидки.СпособПредоставленияСкидки КАК СпособПредоставленияСкидки,
|	ТаблицаТоварыСкидки.СегментБазыРасчетаСкидки КАК СегментБазыРасчетаСкидки,
|	ТаблицаТоварыСкидки.СегментНоменклатуры КАК СегментНоменклатуры,
|	ТаблицаТоварыСкидки.ОбъектСкидки КАК ОбъектСкидки,
|	ТаблицаТоварыСкидки.СкидкаНаЕдиныйКомплект КАК СкидкаНаЕдиныйКомплект,
|	ТаблицаТоварыСкидки.ЗначениеУсловия КАК ЗначениеУсловия,
|	ТаблицаТоварыСкидки.ПорядокПрименения КАК ПорядокПрименения,
|	ТаблицаТоварыСкидки.УсловиеПредоставленияСкидки КАК УсловиеПредоставленияСкидки,
|	ТаблицаТоварыСкидки.КоличествоПрименений КАК КоличествоПрименений
|ПОМЕСТИТЬ ТаблицаТоварыСкидки
|ИЗ
|	(ВЫБРАТЬ
|		ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка,
|		ТаблицаТовары.Номенклатура КАК Номенклатура,
|		ТаблицаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
|		ТаблицаТовары.Упаковка КАК Упаковка,
|		ТаблицаТовары.Количество КАК Количество,
|		ТаблицаТовары.Цена КАК Цена,
|		ТаблицаТовары.Сумма КАК Сумма,
|		ТаблицаТовары.НомерСтроки КАК НомерСтроки,
|		ТаблицаТовары.КлючСтроки КАК КлючСтроки,
|		ДействующиеСкидки.ПорядокПрименения КАК ПорядокПрименения,
|		ДействующиеСкидки.УсловиеПредоставленияСкидки КАК УсловиеПредоставленияСкидки,
|		ДействующиеСкидки.ЗначениеУсловия КАК ЗначениеУсловия,
|		ДействующиеСкидки.СпособПредоставленияСкидки КАК СпособПредоставленияСкидки,
|		ДействующиеСкидки.ЗначениеСкидкиНаценки КАК ЗначениеСкидкиНаценки,
|		ДействующиеСкидки.ЗначениеСкидкиНаценкиОбъектом КАК ЗначениеСкидкиНаценкиОбъектом,
|		ДействующиеСкидки.НачислениеБонусами КАК НачислениеБонусами,
|		ДействующиеСкидки.СегментБазыРасчетаСкидки КАК СегментБазыРасчетаСкидки,
|		ДействующиеСкидки.СегментНоменклатуры КАК СегментНоменклатуры,
|		ДействующиеСкидки.ОбъектСкидки КАК ОбъектСкидки,
|		ДействующиеСкидки.СкидкаНаЕдиныйКомплект КАК СкидкаНаЕдиныйКомплект,
|		ДействующиеСкидки.КоличествоПрименений КАК КоличествоПрименений
|	ИЗ
|		ДействующиеСкидки КАК ДействующиеСкидки,
|		ТаблицаТовары КАК ТаблицаТовары
|	ГДЕ
|		ДействующиеСкидки.СкидкаНаценка.СегментБазыРасчетаСкидки = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|	
|	ОБЪЕДИНИТЬ ВСЕ
|	
|	ВЫБРАТЬ
|		НоменклатураСкидки.СкидкаНаценка,
|		НоменклатураСкидки.Номенклатура,
|		НоменклатураСкидки.КоличествоУпаковок,
|		НоменклатураСкидки.Упаковка,
|		НоменклатураСкидки.Количество,
|		НоменклатураСкидки.Цена,
|		НоменклатураСкидки.Сумма,
|		НоменклатураСкидки.НомерСтроки,
|		НоменклатураСкидки.КлючСтроки,
|		НоменклатураСкидки.ПорядокПрименения,
|		НоменклатураСкидки.УсловиеПредоставленияСкидки,
|		НоменклатураСкидки.ЗначениеУсловия,
|		НоменклатураСкидки.СпособПредоставленияСкидки,
|		НоменклатураСкидки.ЗначениеСкидкиНаценки,
|		НоменклатураСкидки.ЗначениеСкидкиНаценкиОбъектом,
|		НоменклатураСкидки.НачислениеБонусами,
|		НоменклатураСкидки.СегментБазыРасчетаСкидки,
|		НоменклатураСкидки.СегментНоменклатуры,
|		НоменклатураСкидки.ОбъектСкидки,
|		НоменклатураСкидки.СкидкаНаЕдиныйКомплект,
|		НоменклатураСкидки.КоличествоПрименений
|	ИЗ
|		(ВЫБРАТЬ
|			ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка,
|			ТаблицаТовары.Номенклатура КАК Номенклатура,
|			ТаблицаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
|			ТаблицаТовары.Упаковка КАК Упаковка,
|			ТаблицаТовары.Количество КАК Количество,
|			ТаблицаТовары.Цена КАК Цена,
|			ТаблицаТовары.Сумма КАК Сумма,
|			ТаблицаТовары.НомерСтроки КАК НомерСтроки,
|			ТаблицаТовары.КлючСтроки КАК КлючСтроки,
|			ДействующиеСкидки.ПорядокПрименения КАК ПорядокПрименения,
|			ДействующиеСкидки.УсловиеПредоставленияСкидки КАК УсловиеПредоставленияСкидки,
|			ДействующиеСкидки.ЗначениеУсловия КАК ЗначениеУсловия,
|			ДействующиеСкидки.СпособПредоставленияСкидки КАК СпособПредоставленияСкидки,
|			ДействующиеСкидки.ЗначениеСкидкиНаценки КАК ЗначениеСкидкиНаценки,
|			ДействующиеСкидки.ЗначениеСкидкиНаценкиОбъектом КАК ЗначениеСкидкиНаценкиОбъектом,
|			ДействующиеСкидки.НачислениеБонусами КАК НачислениеБонусами,
|			ДействующиеСкидки.СегментБазыРасчетаСкидки КАК СегментБазыРасчетаСкидки,
|			ДействующиеСкидки.СегментНоменклатуры КАК СегментНоменклатуры,
|			ДействующиеСкидки.ОбъектСкидки КАК ОбъектСкидки,
|			ДействующиеСкидки.СкидкаНаЕдиныйКомплект КАК СкидкаНаЕдиныйКомплект,
|			ДействующиеСкидки.КоличествоПрименений КАК КоличествоПрименений
|		ИЗ
|			ДействующиеСкидки КАК ДействующиеСкидки,
|			ТаблицаТовары КАК ТаблицаТовары
|		ГДЕ
|			ДействующиеСкидки.СкидкаНаценка.СегментБазыРасчетаСкидки <> ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)) КАК НоменклатураСкидки
|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК СоставСегментов
|			ПО НоменклатураСкидки.СегментБазыРасчетаСкидки = СоставСегментов.Сегмент
|				И НоменклатураСкидки.Номенклатура = СоставСегментов.Номенклатура
|	ГДЕ
|		НЕ СоставСегментов.Сегмент ЕСТЬ NULL) КАК ТаблицаТоварыСкидки
|		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеСкидкиПоУсловиюВсегда КАК ДействующиеСкидкиПоУсловиюВсегда
|		ПО ТаблицаТоварыСкидки.СкидкаНаценка = ДействующиеСкидкиПоУсловиюВсегда.СкидкаНаценка
|		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеСкидкиПоУсловиюСумма КАК ДействующиеСкидкиПоУсловиюСумма
|		ПО ТаблицаТоварыСкидки.СкидкаНаценка = ДействующиеСкидкиПоУсловиюСумма.СкидкаНаценка
|		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеСкидкиПоУсловиюКоличества КАК ДействующиеСкидкиПоУсловиюКоличества
|		ПО ТаблицаТоварыСкидки.СкидкаНаценка = ДействующиеСкидкиПоУсловиюКоличества.СкидкаНаценка
|		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеСкидкиПоУсловиюДняРождения КАК ДействующиеСкидкиПоУсловиюДняРождения
|		ПО ТаблицаТоварыСкидки.СкидкаНаценка = ДействующиеСкидкиПоУсловиюДняРождения.СкидкаНаценка
|		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеСкидкиПоУсловиюНомерПокупки КАК ДействующиеСкидкиПоУсловиюНомерПокупки
|		ПО ТаблицаТоварыСкидки.СкидкаНаценка = ДействующиеСкидкиПоУсловиюНомерПокупки.СкидкаНаценка
|		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеНакопительныеСкидки КАК ДействующиеНакопительныеСкидки
|		ПО ТаблицаТоварыСкидки.СкидкаНаценка = ДействующиеНакопительныеСкидки.СкидкаНаценка
|		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеОграниченныеКоличествомПримененийСкидки КАК ДействующиеОграниченныеКоличествомПримененийСкидки
|		ПО ТаблицаТоварыСкидки.СкидкаНаценка = ДействующиеОграниченныеКоличествомПримененийСкидки.СкидкаНаценка
|		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеСкидкиПоУсловиюОстатокНаЛицевомСчете КАК ДействующиеСкидкиПоУсловиюОстатокНаЛицевомСчете
|		ПО ТаблицаТоварыСкидки.СкидкаНаценка = ДействующиеСкидкиПоУсловиюОстатокНаЛицевомСчете.СкидкаНаценка
|		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеСкидкиПоУсловиюПредыдущийПрием КАК ДействующиеСкидкиПоУсловиюПредыдущийПрием
|		ПО ТаблицаТоварыСкидки.СкидкаНаценка = ДействующиеСкидкиПоУсловиюПредыдущийПрием.СкидкаНаценка
|		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеСкидкиПоУсловиюПромокод КАК ДействующиеСкидкиПоУсловиюПромокод
|		ПО ТаблицаТоварыСкидки.СкидкаНаценка = ДействующиеСкидкиПоУсловиюПромокод.СкидкаНаценка
|ГДЕ
|	ВЫБОР
|			КОГДА ТаблицаТоварыСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Сумма)
|					И ТаблицаТоварыСкидки.ОбъектСкидки = ЗНАЧЕНИЕ(Перечисление.ОбъектСкидок.НаДокумент)
|				ТОГДА НЕ ДействующиеСкидкиПоУсловиюСумма.СкидкаНаценка ЕСТЬ NULL
|			КОГДА ТаблицаТоварыСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Количество)
|					И ТаблицаТоварыСкидки.ОбъектСкидки = ЗНАЧЕНИЕ(Перечисление.ОбъектСкидок.НаДокумент)
|				ТОГДА НЕ ДействующиеСкидкиПоУсловиюКоличества.СкидкаНаценка ЕСТЬ NULL
|			КОГДА ТаблицаТоварыСкидки.УсловиеПредоставленияСкидки В (ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Сумма), ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Количество))
|					И ТаблицаТоварыСкидки.ОбъектСкидки = ЗНАЧЕНИЕ(Перечисление.ОбъектСкидок.ПоПродажам)
|				ТОГДА НЕ ДействующиеНакопительныеСкидки.СкидкаНаценка ЕСТЬ NULL
|			КОГДА ТаблицаТоварыСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.НомерПокупки)
|				ТОГДА НЕ ДействующиеСкидкиПоУсловиюНомерПокупки.СкидкаНаценка ЕСТЬ NULL
|			КОГДА ТаблицаТоварыСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ДеньРождения)
|				ТОГДА НЕ ДействующиеСкидкиПоУсловиюДняРождения.СкидкаНаценка ЕСТЬ NULL
|			КОГДА ТаблицаТоварыСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ОстатокНаЛицевомСчете)
|				ТОГДА НЕ ДействующиеСкидкиПоУсловиюОстатокНаЛицевомСчете.СкидкаНаценка ЕСТЬ NULL
|			КОГДА ТаблицаТоварыСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ПредыдущийПрием)
|				ТОГДА НЕ ДействующиеСкидкиПоУсловиюПредыдущийПрием.СкидкаНаценка ЕСТЬ NULL
|			КОГДА ТаблицаТоварыСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Промокод)
|					ИЛИ ТаблицаТоварыСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.БонусРефералу)
|				ТОГДА НЕ ДействующиеСкидкиПоУсловиюПромокод.СкидкаНаценка ЕСТЬ NULL
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ
|	И ТаблицаТоварыСкидки.СпособПредоставленияСкидки <> ЗНАЧЕНИЕ(Перечисление.СпособПредоставленияСкидки.Подарок)
|	И ВЫБОР
|			КОГДА ТаблицаТоварыСкидки.КоличествоПрименений > 0
|				ТОГДА НЕ ДействующиеОграниченныеКоличествомПримененийСкидки.СкидкаНаценка ЕСТЬ NULL
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ТаблицаТоварыСкидки.СкидкаНаценка КАК СкидкаНаценка,
|	ТаблицаТоварыСкидки.Номенклатура КАК Номенклатура,
|	ТаблицаТоварыСкидки.КоличествоУпаковок КАК КоличествоУпаковок,
|	ТаблицаТоварыСкидки.Упаковка КАК Упаковка,
|	ТаблицаТоварыСкидки.Количество КАК Количество,
|	ТаблицаТоварыСкидки.Цена КАК Цена,
|	ТаблицаТоварыСкидки.Сумма КАК Сумма,
|	ТаблицаТоварыСкидки.НомерСтроки КАК НомерСтроки,
|	ТаблицаТоварыСкидки.КлючСтроки КАК КлючСтроки,
|	ТаблицаТоварыСкидки.ЗначениеСкидкиНаценки КАК ЗначениеСкидкиНаценки,
|	ТаблицаТоварыСкидки.ЗначениеСкидкиНаценкиОбъектом КАК ЗначениеСкидкиНаценкиОбъектом,
|	ТаблицаТоварыСкидки.НачислениеБонусами КАК НачислениеБонусами,
|	ТаблицаТоварыСкидки.СпособПредоставленияСкидки КАК СпособПредоставленияСкидки,
|	ТаблицаТоварыСкидки.СегментБазыРасчетаСкидки КАК СегментБазыРасчетаСкидки,
|	ТаблицаТоварыСкидки.СегментНоменклатуры КАК СегментНоменклатуры,
|	ТаблицаТоварыСкидки.ОбъектСкидки КАК ОбъектСкидки,
|	ТаблицаТоварыСкидки.СкидкаНаЕдиныйКомплект КАК СкидкаНаЕдиныйКомплект,
|	ТаблицаТоварыСкидки.ЗначениеУсловия КАК ЗначениеУсловия,
|	ТаблицаТоварыСкидки.ПорядокПрименения КАК ПорядокПрименения,
|	ТаблицаТоварыСкидки.УсловиеПредоставленияСкидки КАК УсловиеПредоставленияСкидки,
|	ТаблицаТоварыСкидки.КоличествоПрименений КАК КоличествоПрименений
|ПОМЕСТИТЬ ТаблицаТоварыПодарки
|ИЗ
|	(ВЫБРАТЬ
|		ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка,
|		ТаблицаТоварыПерваяСтрока.Номенклатура КАК Номенклатура,
|		ТаблицаТоварыПерваяСтрока.КоличествоУпаковок КАК КоличествоУпаковок,
|		ТаблицаТоварыПерваяСтрока.Упаковка КАК Упаковка,
|		ТаблицаТоварыПерваяСтрока.Количество КАК Количество,
|		ТаблицаТоварыПерваяСтрока.Цена КАК Цена,
|		ТаблицаТоварыПерваяСтрока.Сумма КАК Сумма,
|		ТаблицаТоварыПерваяСтрока.НомерСтроки КАК НомерСтроки,
|		ТаблицаТоварыПерваяСтрока.КлючСтроки КАК КлючСтроки,
|		ДействующиеСкидки.ПорядокПрименения КАК ПорядокПрименения,
|		ДействующиеСкидки.УсловиеПредоставленияСкидки КАК УсловиеПредоставленияСкидки,
|		ДействующиеСкидки.ЗначениеУсловия КАК ЗначениеУсловия,
|		ДействующиеСкидки.СпособПредоставленияСкидки КАК СпособПредоставленияСкидки,
|		ДействующиеСкидки.ЗначениеСкидкиНаценки КАК ЗначениеСкидкиНаценки,
|		ДействующиеСкидки.ЗначениеСкидкиНаценкиОбъектом КАК ЗначениеСкидкиНаценкиОбъектом,
|		ДействующиеСкидки.НачислениеБонусами КАК НачислениеБонусами,
|		ДействующиеСкидки.СегментБазыРасчетаСкидки КАК СегментБазыРасчетаСкидки,
|		ДействующиеСкидки.СегментНоменклатуры КАК СегментНоменклатуры,
|		ДействующиеСкидки.ОбъектСкидки КАК ОбъектСкидки,
|		ДействующиеСкидки.СкидкаНаЕдиныйКомплект КАК СкидкаНаЕдиныйКомплект,
|		ДействующиеСкидки.КоличествоПрименений КАК КоличествоПрименений
|	ИЗ
|		ДействующиеСкидки КАК ДействующиеСкидки,
|		ТаблицаТоварыПерваяСтрока КАК ТаблицаТоварыПерваяСтрока
|	ГДЕ
|		ДействующиеСкидки.СкидкаНаценка.СегментБазыРасчетаСкидки = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
|	
|	ОБЪЕДИНИТЬ ВСЕ
|	
|	ВЫБРАТЬ
|		НоменклатураСкидки.СкидкаНаценка,
|		НоменклатураСкидки.Номенклатура,
|		НоменклатураСкидки.КоличествоУпаковок,
|		НоменклатураСкидки.Упаковка,
|		НоменклатураСкидки.Количество,
|		НоменклатураСкидки.Цена,
|		НоменклатураСкидки.Сумма,
|		НоменклатураСкидки.НомерСтроки,
|		НоменклатураСкидки.КлючСтроки,
|		НоменклатураСкидки.ПорядокПрименения,
|		НоменклатураСкидки.УсловиеПредоставленияСкидки,
|		НоменклатураСкидки.ЗначениеУсловия,
|		НоменклатураСкидки.СпособПредоставленияСкидки,
|		НоменклатураСкидки.ЗначениеСкидкиНаценки,
|		НоменклатураСкидки.ЗначениеСкидкиНаценкиОбъектом,
|		НоменклатураСкидки.НачислениеБонусами,
|		НоменклатураСкидки.СегментБазыРасчетаСкидки,
|		НоменклатураСкидки.СегментНоменклатуры,
|		НоменклатураСкидки.ОбъектСкидки,
|		НоменклатураСкидки.СкидкаНаЕдиныйКомплект,
|		НоменклатураСкидки.КоличествоПрименений
|	ИЗ
|		(ВЫБРАТЬ
|			ДействующиеСкидки.СкидкаНаценка КАК СкидкаНаценка,
|			ТаблицаТоварыПерваяСтрока.Номенклатура КАК Номенклатура,
|			ТаблицаТоварыПерваяСтрока.КоличествоУпаковок КАК КоличествоУпаковок,
|			ТаблицаТоварыПерваяСтрока.Упаковка КАК Упаковка,
|			ТаблицаТоварыПерваяСтрока.Количество КАК Количество,
|			ТаблицаТоварыПерваяСтрока.Цена КАК Цена,
|			ТаблицаТоварыПерваяСтрока.Сумма КАК Сумма,
|			ТаблицаТоварыПерваяСтрока.НомерСтроки КАК НомерСтроки,
|			ТаблицаТоварыПерваяСтрока.КлючСтроки КАК КлючСтроки,
|			ДействующиеСкидки.ПорядокПрименения КАК ПорядокПрименения,
|			ДействующиеСкидки.УсловиеПредоставленияСкидки КАК УсловиеПредоставленияСкидки,
|			ДействующиеСкидки.ЗначениеУсловия КАК ЗначениеУсловия,
|			ДействующиеСкидки.СпособПредоставленияСкидки КАК СпособПредоставленияСкидки,
|			ДействующиеСкидки.ЗначениеСкидкиНаценки КАК ЗначениеСкидкиНаценки,
|			ДействующиеСкидки.ЗначениеСкидкиНаценкиОбъектом КАК ЗначениеСкидкиНаценкиОбъектом,
|			ДействующиеСкидки.НачислениеБонусами КАК НачислениеБонусами,
|			ДействующиеСкидки.СегментБазыРасчетаСкидки КАК СегментБазыРасчетаСкидки,
|			ДействующиеСкидки.СегментНоменклатуры КАК СегментНоменклатуры,
|			ДействующиеСкидки.ОбъектСкидки КАК ОбъектСкидки,
|			ДействующиеСкидки.СкидкаНаЕдиныйКомплект КАК СкидкаНаЕдиныйКомплект,
|			ДействующиеСкидки.КоличествоПрименений КАК КоличествоПрименений
|		ИЗ
|			ДействующиеСкидки КАК ДействующиеСкидки,
|			ТаблицаТоварыПерваяСтрока КАК ТаблицаТоварыПерваяСтрока
|		ГДЕ
|			ДействующиеСкидки.СкидкаНаценка.СегментБазыРасчетаСкидки <> ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)) КАК НоменклатураСкидки
|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК СоставСегментов
|			ПО НоменклатураСкидки.СегментБазыРасчетаСкидки = СоставСегментов.Сегмент
|				И НоменклатураСкидки.Номенклатура = СоставСегментов.Номенклатура
|	ГДЕ
|		НЕ СоставСегментов.Сегмент ЕСТЬ NULL) КАК ТаблицаТоварыСкидки
|		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеСкидкиПоУсловиюВсегда КАК ДействующиеСкидкиПоУсловиюВсегда
|		ПО ТаблицаТоварыСкидки.СкидкаНаценка = ДействующиеСкидкиПоУсловиюВсегда.СкидкаНаценка
|		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеСкидкиПоУсловиюКоличества КАК ДействующиеСкидкиПоУсловиюКоличества
|		ПО ТаблицаТоварыСкидки.СкидкаНаценка = ДействующиеСкидкиПоУсловиюКоличества.СкидкаНаценка
|		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеСкидкиПоУсловиюСумма КАК ДействующиеСкидкиПоУсловиюСумма
|		ПО ТаблицаТоварыСкидки.СкидкаНаценка = ДействующиеСкидкиПоУсловиюСумма.СкидкаНаценка
|		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеСкидкиПоУсловиюНомерПокупки КАК ДействующиеСкидкиПоУсловиюНомерПокупки
|		ПО ТаблицаТоварыСкидки.СкидкаНаценка = ДействующиеСкидкиПоУсловиюНомерПокупки.СкидкаНаценка
|		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеСкидкиПоУсловиюДняРождения КАК ДействующиеСкидкиПоУсловиюДняРождения
|		ПО ТаблицаТоварыСкидки.СкидкаНаценка = ДействующиеСкидкиПоУсловиюДняРождения.СкидкаНаценка
|		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеНакопительныеСкидки КАК ДействующиеНакопительныеСкидки
|		ПО ТаблицаТоварыСкидки.СкидкаНаценка = ДействующиеНакопительныеСкидки.СкидкаНаценка
|		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеОграниченныеКоличествомПримененийСкидки КАК ДействующиеОграниченныеКоличествомПримененийСкидки
|		ПО ТаблицаТоварыСкидки.СкидкаНаценка = ДействующиеОграниченныеКоличествомПримененийСкидки.СкидкаНаценка
|		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеСкидкиПоУсловиюОстатокНаЛицевомСчете КАК ДействующиеСкидкиПоУсловиюОстатокНаЛицевомСчете
|		ПО ТаблицаТоварыСкидки.СкидкаНаценка = ДействующиеСкидкиПоУсловиюОстатокНаЛицевомСчете.СкидкаНаценка
|ГДЕ
|	ВЫБОР
|			КОГДА ТаблицаТоварыСкидки.КоличествоПрименений > 0
|				ТОГДА НЕ ДействующиеОграниченныеКоличествомПримененийСкидки.СкидкаНаценка ЕСТЬ NULL
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ
|	И ВЫБОР
|			КОГДА ТаблицаТоварыСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Сумма)
|					И ТаблицаТоварыСкидки.ОбъектСкидки = ЗНАЧЕНИЕ(Перечисление.ОбъектСкидок.НаДокумент)
|				ТОГДА НЕ ДействующиеСкидкиПоУсловиюСумма.СкидкаНаценка ЕСТЬ NULL
|			КОГДА ТаблицаТоварыСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Количество)
|					И ТаблицаТоварыСкидки.ОбъектСкидки = ЗНАЧЕНИЕ(Перечисление.ОбъектСкидок.НаДокумент)
|				ТОГДА НЕ ДействующиеСкидкиПоУсловиюКоличества.СкидкаНаценка ЕСТЬ NULL
|			КОГДА ТаблицаТоварыСкидки.УсловиеПредоставленияСкидки В (ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Сумма), ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.Количество))
|					И ТаблицаТоварыСкидки.ОбъектСкидки = ЗНАЧЕНИЕ(Перечисление.ОбъектСкидок.ПоПродажам)
|				ТОГДА НЕ ДействующиеНакопительныеСкидки.СкидкаНаценка ЕСТЬ NULL
|			КОГДА ТаблицаТоварыСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.НомерПокупки)
|				ТОГДА НЕ ДействующиеСкидкиПоУсловиюНомерПокупки.СкидкаНаценка ЕСТЬ NULL
|			КОГДА ТаблицаТоварыСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ДеньРождения)
|				ТОГДА НЕ ДействующиеСкидкиПоУсловиюДняРождения.СкидкаНаценка ЕСТЬ NULL
|			КОГДА ТаблицаТоварыСкидки.УсловиеПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидки.ОстатокНаЛицевомСчете)
|				ТОГДА НЕ ДействующиеСкидкиПоУсловиюОстатокНаЛицевомСчете.СкидкаНаценка ЕСТЬ NULL
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ
|	И ТаблицаТоварыСкидки.СпособПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.СпособПредоставленияСкидки.Подарок)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ТаблицаТоварыСкидки.СкидкаНаценка КАК СкидкаНаценка,
|	ТаблицаТоварыСкидки.Номенклатура КАК Номенклатура,
|	ТаблицаТоварыСкидки.КоличествоУпаковок КАК КоличествоУпаковок,
|	ТаблицаТоварыСкидки.Упаковка КАК Упаковка,
|	ТаблицаТоварыСкидки.Количество КАК Количество,
|	ТаблицаТоварыСкидки.Цена КАК Цена,
|	ТаблицаТоварыСкидки.Сумма КАК Сумма,
|	ТаблицаТоварыСкидки.НомерСтроки КАК НомерСтроки,
|	ТаблицаТоварыСкидки.КлючСтроки КАК КлючСтроки,
|	ТаблицаТоварыСкидки.ЗначениеСкидкиНаценки КАК ЗначениеСкидкиНаценки,
|	ТаблицаТоварыСкидки.ЗначениеСкидкиНаценкиОбъектом КАК ЗначениеСкидкиНаценкиОбъектом,
|	ТаблицаТоварыСкидки.НачислениеБонусами КАК НачислениеБонусами,
|	ТаблицаТоварыСкидки.СпособПредоставленияСкидки КАК СпособПредоставленияСкидки,
|	ТаблицаТоварыСкидки.СегментБазыРасчетаСкидки КАК СегментБазыРасчетаСкидки,
|	ТаблицаТоварыСкидки.СегментНоменклатуры КАК СегментНоменклатуры,
|	ТаблицаТоварыСкидки.ОбъектСкидки КАК ОбъектСкидки,
|	ТаблицаТоварыСкидки.СкидкаНаЕдиныйКомплект КАК СкидкаНаЕдиныйКомплект,
|	ТаблицаТоварыСкидки.ЗначениеУсловия КАК ЗначениеУсловия,
|	ТаблицаТоварыСкидки.ПорядокПрименения КАК ПорядокПрименения,
|	ТаблицаТоварыСкидки.УсловиеПредоставленияСкидки КАК УсловиеПредоставленияСкидки,
|	ТаблицаТоварыСкидки.КоличествоПрименений КАК КоличествоПрименений,
|	&Получатель КАК Контрагент,
|	ЛОЖЬ КАК ПризнакОплатыБонусом,
|	ЗНАЧЕНИЕ(Справочник.БонусныеСчета.ПустаяСсылка) КАК БонусныйСчет
|ИЗ
|	ТаблицаТоварыСкидки КАК ТаблицаТоварыСкидки
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ТаблицаТоварыПодарки.СкидкаНаценка,
|	ТаблицаТоварыПодарки.Номенклатура,
|	ТаблицаТоварыПодарки.КоличествоУпаковок,
|	ТаблицаТоварыПодарки.Упаковка,
|	ТаблицаТоварыПодарки.Количество,
|	ТаблицаТоварыПодарки.Цена,
|	ТаблицаТоварыПодарки.Сумма,
|	ТаблицаТоварыПодарки.НомерСтроки,
|	ТаблицаТоварыПодарки.КлючСтроки,
|	ТаблицаТоварыПодарки.ЗначениеСкидкиНаценки,
|	ТаблицаТоварыПодарки.ЗначениеСкидкиНаценкиОбъектом,
|	ТаблицаТоварыПодарки.НачислениеБонусами,
|	ТаблицаТоварыПодарки.СпособПредоставленияСкидки,
|	ТаблицаТоварыПодарки.СегментБазыРасчетаСкидки,
|	ТаблицаТоварыПодарки.СегментНоменклатуры,
|	ТаблицаТоварыПодарки.ОбъектСкидки,
|	ТаблицаТоварыПодарки.СкидкаНаЕдиныйКомплект,
|	ТаблицаТоварыПодарки.ЗначениеУсловия,
|	ТаблицаТоварыПодарки.ПорядокПрименения,
|	ТаблицаТоварыПодарки.УсловиеПредоставленияСкидки,
|	ТаблицаТоварыПодарки.КоличествоПрименений,
|	&Получатель,
|	ЛОЖЬ,
|	ЗНАЧЕНИЕ(Справочник.БонусныеСчета.ПустаяСсылка)
|ИЗ
|	ТаблицаТоварыПодарки КАК ТаблицаТоварыПодарки";
	
КонецФункции

// Функция получает массиов видов бонусных счетов, не начисляемых при оплате бонусами
//
Функция ПолучитьМассивВидовБонусныхСчетовНеНачисляемыхПриОплатеБонусами(ТаблицаОплатыБонусами)
	
	МассивВидовБонусныхСчетов = Новый Массив;
	
	Если ТаблицаОплатыБонусами = Неопределено Тогда
		Возврат МассивВидовБонусныхСчетов;
	КонецЕсли;  
		
	Для Каждого СтрокаОплатыБонусами Из ТаблицаОплатыБонусами Цикл
		Если СтрокаОплатыБонусами.Сумма > 0 
			И ЗначениеЗаполнено(СтрокаОплатыБонусами.БонусныйСчет)
			И СтрокаОплатыБонусами.БонусныйСчет.НеНачислятьПриОплатеБонусами Тогда 				
			
			МассивВидовБонусныхСчетов.Добавить(СтрокаОплатыБонусами.БонусныйСчет.ВидБонусногоСчета);
			
		КонецЕсли;    		
	КонецЦикла;  
	
	Возврат МассивВидовБонусныхСчетов;
	
КонецФункции          

// Рассчитывает сумму скидки суммой или процентом
//
// Параметры
//  МассивСкидок  - Массив скидок, по которым выполнилось условие
//  СтрокаТоваров - Строка таблицы значений с данными из документа
//  СтруктурнаяЕдиница - СтруктурнаяЕдиница в котором рассчитывается скидка
//  ДатаДокумента - Дата документа необходима для расчета скидки по цене
//
// Возвращаемое значение:
//  Сумма скидки
//
Процедура РасчитатьСуммуСкидкиИНовыеЦеныНоменклатурыНаСкидкиПоВидуЦен(ТаблицаСкидок, СтруктураПараметров)
	
	Для Каждого СтрокаТаблицыСкидок Из ТаблицаСкидок Цикл
		
		Если СтрокаТаблицыСкидок.СпособПредоставленияСкидки <> Перечисления.СпособПредоставленияСкидки.ВидЦен Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПолученияЦены = Новый Структура();
		СтруктураПолученияЦены.Вставить("СтруктурнаяЕдиница",		СтруктураПараметров.СтруктурнаяЕдиница);
		СтруктураПолученияЦены.Вставить("Номенклатура", 			СтрокаТаблицыСкидок.Номенклатура);
		СтруктураПолученияЦены.Вставить("Упаковка",					СтрокаТаблицыСкидок.Упаковка);
		СтруктураПолученияЦены.Вставить("ДатаОбработки",			СтруктураПараметров.ДатаСкидок);
		СтруктураПолученияЦены.Вставить("ВидЦен", 					?(СтруктураПараметров.Свойство("ВидЦен"), СтруктураПараметров.ВидЦен, Справочники.ВидыЦен.Розничная));
		ЦенаНоменклатурыПоВидуЦенШапки = Ценообразование.ПолучитьЦенуНоменклатуры(СтруктураПолученияЦены);
		
		СтруктураПолученияЦены.Вставить("ВидЦен", 					СтрокаТаблицыСкидок.ЗначениеСкидкиНаценкиОбъектом);
		ЦенаНоменклатурыПоНовомуВидуЦенСкидки = Ценообразование.ПолучитьЦенуНоменклатуры(СтруктураПолученияЦены);
		
		СтрокаТаблицыСкидок.Цена		= ЦенаНоменклатурыПоНовомуВидуЦенСкидки;
		СтрокаТаблицыСкидок.Сумма		= ЦенаНоменклатурыПоНовомуВидуЦенСкидки * СтрокаТаблицыСкидок.КоличествоУпаковок;
		СтрокаТаблицыСкидок.СуммаСкидки = (ЦенаНоменклатурыПоВидуЦенШапки - ЦенаНоменклатурыПоНовомуВидуЦенСкидки);
		
	КонецЦикла; 
	
КонецПроцедуры

// Рассчитывает сумму скидки суммой или процентом
//
// Параметры
//  МассивСкидок  - Массив скидок, по которым выполнилось условие
//  СтрокаТоваров - Строка таблицы значений с данными из документа
//  СтруктурнаяЕдиница - СтруктурнаяЕдиница в котором рассчитывается скидка
//  ДатаДокумента - Дата документа необходима для расчета скидки по цене
//
// Возвращаемое значение:
//  Сумма скидки
//
Процедура РаспределитьСкидкуСуммойПроцентомПоНоменклатуре(ТаблицаСкидок, СтруктураПараметров)
	
	Для каждого СтрокаТаблицыСкидок Из ТаблицаСкидок Цикл
		
		Если СтрокаТаблицыСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Сумма Тогда
			СтрокаТаблицыСкидок.СуммаСкидки = СтрокаТаблицыСкидок.ЗначениеСкидкиНаценки;
		ИначеЕсли СтрокаТаблицыСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент Тогда
			СтрокаТаблицыСкидок.СуммаСкидки = СтрокаТаблицыСкидок.Сумма * СтрокаТаблицыСкидок.ЗначениеСкидкиНаценки / 100;
		КонецЕсли;
		
		Если СтрокаТаблицыСкидок.Сумма < СтрокаТаблицыСкидок.СуммаСкидки
			И СтрокаТаблицыСкидок.НачислениеБонусами = Ложь Тогда
			
			СтрокаТаблицыСкидок.СуммаСкидки = СтрокаТаблицыСкидок.Сумма;
		КонецЕсли;			
		
	КонецЦикла; 
	
КонецПроцедуры

// Разбивает сумму скидки на документ по позициям номенклатуры
//
// Параметры
//  МассивСкидок  - Массив скидок, по которым выполнилось условие
//  СтрокаТоваров - Строка таблицы значений с данными из документа
//  СтруктурнаяЕдиница - СтруктурнаяЕдиница в котором рассчитывается скидка
//  ДатаДокумента - Дата документа необходима для расчета скидки по цене
//
// Возвращаемое значение:
//  Сумма скидки
//
Процедура РаспределитьСкидкуНаДокументПоНоменклатуре(
	ТаблицаСкидок, 
	ТаблицаЗапасы	= Неопределено, 
	ТаблицаЛечение	= Неопределено, 
	ТаблицаУслуги	= Неопределено,
	СтруктураПараметров)
	
	МассивУникальныхСкидокНаДокумент = Новый Массив;
	Для каждого СтрокаТЧСкидки Из ТаблицаСкидок Цикл
		Если СтрокаТЧСкидки.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.СуммаНаДокумент
			И МассивУникальныхСкидокНаДокумент.Найти(СтрокаТЧСкидки.СкидкаНаценка) = Неопределено Тогда
			
			МассивУникальныхСкидокНаДокумент.Добавить(СтрокаТЧСкидки.СкидкаНаценка);
		КонецЕсли; 
	КонецЦикла;
	
	Для Каждого ЭлементСкидки Из МассивУникальныхСкидокНаДокумент Цикл
		
		СуммаСтрокСкидкиНаДокумент = 0;
		Для Каждого СтрокаТЧ Из ТаблицаСкидок.НайтиСтроки(Новый Структура("СкидкаНаценка", ЭлементСкидки)) Цикл
			СуммаСтрокСкидкиНаДокумент = СуммаСтрокСкидкиНаДокумент + СтрокаТЧ.Сумма;
		КонецЦикла;
		
		СуммаРаспределения = ЭлементСкидки.ЗначениеСкидкиНаценки;
		СуммаФактическогоРаспределения = 0;
		Если СуммаСтрокСкидкиНаДокумент < СуммаРаспределения Тогда
			СуммаРаспределения = СуммаСтрокСкидкиНаДокумент;
		КонецЕсли;	
		
		КоэффициентРаспределения = ?(СуммаСтрокСкидкиНаДокумент <> 0, 1 - СуммаРаспределения / СуммаСтрокСкидкиНаДокумент, 0);
		
		Если ТаблицаЗапасы <> Неопределено Тогда 
			Для Каждого СтрокаСкидки Из ТаблицаСкидок.НайтиСтроки(Новый Структура("СкидкаНаценка", ЭлементСкидки)) Цикл
				ИскомаСтрока = ТаблицаЗапасы.Найти(СтрокаСкидки.КлючСтроки, "КлючСтроки");
				Если ИскомаСтрока = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				СуммаНоменклатуры = ИскомаСтрока.Сумма;
				СтрокаСкидки.СуммаСкидки = Окр(СуммаНоменклатуры - СуммаНоменклатуры * КоэффициентРаспределения, 2, 1);
				СуммаФактическогоРаспределения = СуммаФактическогоРаспределения + СтрокаСкидки.СуммаСкидки;
			КонецЦикла;
		КонецЕсли;
		
		Если ТаблицаЛечение <> Неопределено Тогда 
			Для Каждого СтрокаСкидки Из ТаблицаСкидок.НайтиСтроки(Новый Структура("СкидкаНаценка", ЭлементСкидки)) Цикл
				ИскомаСтрока = ТаблицаЛечение.Найти(СтрокаСкидки.КлючСтроки, "КлючСтроки");
				Если ИскомаСтрока = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				СуммаНоменклатуры = ИскомаСтрока.Сумма;
				СтрокаСкидки.СуммаСкидки = Окр(СуммаНоменклатуры - СуммаНоменклатуры * КоэффициентРаспределения, 2, 1);
				СуммаФактическогоРаспределения = СуммаФактическогоРаспределения + СтрокаСкидки.СуммаСкидки;
			КонецЦикла;
		КонецЕсли;

		Если ТаблицаУслуги <> Неопределено Тогда 
			Для Каждого СтрокаСкидки Из ТаблицаСкидок.НайтиСтроки(Новый Структура("СкидкаНаценка", ЭлементСкидки)) Цикл
				ИскомаСтрока = ТаблицаУслуги.Найти(СтрокаСкидки.КлючСтроки, "КлючСтроки");
				Если ИскомаСтрока = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				СуммаНоменклатуры = ИскомаСтрока.Сумма;
				СтрокаСкидки.СуммаСкидки = Окр(СуммаНоменклатуры - СуммаНоменклатуры * КоэффициентРаспределения, 2, 1);
				СуммаФактическогоРаспределения = СуммаФактическогоРаспределения + СтрокаСкидки.СуммаСкидки;
			КонецЦикла;
		КонецЕсли;
		
		ОшибкаОкругления = СуммаРаспределения - СуммаФактическогоРаспределения;
		Если ОшибкаОкругления <> 0 Тогда
			МассивСтрокСкидок = ТаблицаСкидок.НайтиСтроки(Новый Структура("СкидкаНаценка", ЭлементСкидки));
			МассивСтрокСкидок[0].СуммаСкидки = МассивСтрокСкидок[0].СуммаСкидки + ОшибкаОкругления;
		КонецЕсли;		
		
	КонецЦикла; 
	
КонецПроцедуры

// Определяет по таблице скидок подарков количество подарков
//
// Параметры:
//  ТаблицаСкидок - Таблица значений скидки подарки
//  ТаблицаТоваров - Таблица значений, в которую выгружена таблица товаров из документа
//  СтруктурнаяЕдиница - СтруктурнаяЕдиница, в котором рассчитываем скидки
//  ТаблицаНеПрименяемыхПодарков - Таблица значений, служит для возврата не используемых подарков
//
Процедура ОпределитьКоличествоСтоимостьПодарков(
	ТаблицаСкидок, 
	ТаблицаЗапасов,
	ТаблицаЛечения,
	ТаблицаУслуг, 
	СтруктураПараметров,
	ДокументОбъект)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Если ТаблицаЗапасов <> Неопределено Тогда Запрос.УстановитьПараметр("ТаблицаЗапасы"	, ТаблицаЗапасов) КонецЕсли;
	Если ТаблицаЛечения <> Неопределено Тогда Запрос.УстановитьПараметр("ТаблицаЛечения", ТаблицаЛечения) КонецЕсли;
	Если ТаблицаУслуг   <> Неопределено	Тогда Запрос.УстановитьПараметр("ТаблицаУслуг"	, ТаблицаУслуг)	  КонецЕсли;
	
	ЕстьКолонкаКоличествоУпаковокТЧЛечение = Ложь;
	Если ТаблицаЛечения <> Неопределено Тогда 
		ЕстьКолонкаКоличествоУпаковокТЧЛечение = ДокументОбъект.Ссылка.Метаданные().ТабличныеЧасти.Лечение.Реквизиты.Найти("КоличествоУпаковок") <> Неопределено;
	КонецЕсли;
	
	ЭтоНарядЗаказ = ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.НарядЗаказ");

	СтрокаОбъединение = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|";	
	
	СтрокаРазделение = "
	|
	|;
	|///////////////////////////////////////////
	|";   	
	
	СтрокаПоместить = "	
	|ПОМЕСТИТЬ ТаблицаТовары
	|";	 
	
	МассивТекст = Новый Массив;
	
	// добавляем во временные таблицы. 	
	Если ТаблицаЗапасов <> Неопределено Тогда
		Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЗапасы.НомерСтроки,
		|	ТаблицаЗапасы.Номенклатура,
		|	ТаблицаЗапасы.КоличествоУпаковок,
		|	ТаблицаЗапасы.Упаковка,
		|	ТаблицаЗапасы.Количество,
		|	ТаблицаЗапасы.ВидЦен,"
		+ ?(ЭтоНарядЗаказ = Истина, 
			" ТаблицаЗапасы.ЦенаПродажи КАК Цена,", 
			" ТаблицаЗапасы.Цена КАК Цена,")	
		+ ?(ЭтоНарядЗаказ = Истина, 
			" ТаблицаЗапасы.СуммаПродажи КАК Сумма", 
			" ТаблицаЗапасы.Сумма КАК Сумма")	
		+ "
		|ПОМЕСТИТЬ ТаблицаЗапасы
		|ИЗ
		|	&ТаблицаЗапасы КАК ТаблицаЗапасы";	
		
		МассивТекст.Добавить(Текст);
	КонецЕсли;
	
	Если ТаблицаЛечения <> Неопределено Тогда
		
		Если ТаблицаЗапасов <> Неопределено Тогда
			МассивТекст.Добавить(СтрокаРазделение);
		КонецЕсли;             		
		
		Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	ТаблицаЛечения.НомерСтроки,
		|	ТаблицаЛечения.Номенклатура,"
		+ ?(ЕстьКолонкаКоличествоУпаковокТЧЛечение = Истина, 
			" ТаблицаЛечения.КоличествоУпаковок КАК КоличествоУпаковок,", 
			" ТаблицаЛечения.Количество КАК КоличествоУпаковок,")	
		+ "
		|	ТаблицаЛечения.Упаковка,
		|	ТаблицаЛечения.Количество,
		|	ТаблицаЛечения.ВидЦен,
		|	ТаблицаЛечения.Цена,
		|	ТаблицаЛечения.Сумма 
		|ПОМЕСТИТЬ ТаблицаЛечения
		|ИЗ
		|	&ТаблицаЛечения КАК ТаблицаЛечения";
		
		МассивТекст.Добавить(Текст); 
	КонецЕсли;
	
	Если ТаблицаУслуг <> Неопределено Тогда
		
		Если ТаблицаЗапасов <> Неопределено 
			Или ТаблицаЛечения <> Неопределено Тогда
			
			МассивТекст.Добавить(СтрокаРазделение);
		КонецЕсли;     
		
		Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаУслуг.НомерСтроки,
		|	ТаблицаУслуг.Номенклатура,
		|	ТаблицаУслуг.КоличествоУпаковок,
		|	ТаблицаУслуг.Упаковка,
		|	ТаблицаУслуг.Количество,
		|	ТаблицаУслуг.ВидЦен,
		|	ТаблицаУслуг.Цена,
		|	ТаблицаУслуг.Сумма
		|ПОМЕСТИТЬ ТаблицаУслуг
		|ИЗ
		|	&ТаблицаУслуг КАК ТаблицаУслуг";
		
		МассивТекст.Добавить(Текст); 
	КонецЕсли;   
	
	// формируем запрос "объединение".
	МассивТекст.Добавить(СтрокаРазделение);
	Если ТаблицаЗапасов <> Неопределено Тогда
		Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЗапасы.НомерСтроки,
		|	ТаблицаЗапасы.Номенклатура,
		|	ТаблицаЗапасы.КоличествоУпаковок,
		|	ТаблицаЗапасы.Упаковка,
		|	ТаблицаЗапасы.Количество,
		|	ТаблицаЗапасы.ВидЦен,
		|	ТаблицаЗапасы.Цена,
		|	ТаблицаЗапасы.Сумма
		|ПОМЕСТИТЬ ТаблицаТовары
		|ИЗ
		|	ТаблицаЗапасы КАК ТаблицаЗапасы";
		
		МассивТекст.Добавить(Текст);
	КонецЕсли;
	   	
	Если ТаблицаЛечения <> Неопределено Тогда
		
		Если ТаблицаЗапасов <> Неопределено Тогда
			МассивТекст.Добавить(СтрокаОбъединение);
		КонецЕсли;  
		
		Текст =
		"ВЫБРАТЬ " + ?(ТаблицаЗапасов = Неопределено, "РАЗРЕШЕННЫЕ", "") + " 
		|	ТаблицаЛечения.НомерСтроки,
		|	ТаблицаЛечения.Номенклатура,
		|	ТаблицаЛечения.КоличествоУпаковок,
		|	ТаблицаЛечения.Упаковка,
		|	ТаблицаЛечения.Количество,
		|	ТаблицаЛечения.ВидЦен,
		|	ТаблицаЛечения.Цена,
		|	ТаблицаЛечения.Сумма"  
		+ ?(ТаблицаЗапасов = Неопределено, СтрокаПоместить, "")	
		+ "
		|ИЗ
		|	ТаблицаЛечения КАК ТаблицаЛечения";
		
		МассивТекст.Добавить(Текст); 
	КонецЕсли;
	
	Если ТаблицаУслуг <> Неопределено Тогда
		
		Если ТаблицаЗапасов <> Неопределено 
			Или ТаблицаЛечения <> Неопределено Тогда
			МассивТекст.Добавить(СтрокаОбъединение);
		КонецЕсли;  
		
		Текст =
		"ВЫБРАТЬ " + ?(ТаблицаЗапасов = Неопределено Или ТаблицаЛечения <> Неопределено, "РАЗРЕШЕННЫЕ", "") + " 
		|	ТаблицаУслуг.НомерСтроки,
		|	ТаблицаУслуг.Номенклатура,
		|	ТаблицаУслуг.КоличествоУпаковок,
		|	ТаблицаУслуг.Упаковка,
		|	ТаблицаУслуг.Количество,
		|	ТаблицаУслуг.ВидЦен,
		|	ТаблицаУслуг.Цена,
		|	ТаблицаУслуг.Сумма"   
		+ ?(ТаблицаЗапасов = Неопределено Или ТаблицаЛечения <> Неопределено, СтрокаПоместить, "")	
		+ "
		|ИЗ
		|	ТаблицаУслуг КАК ТаблицаУслуг";
		
		МассивТекст.Добавить(Текст); 
	КонецЕсли;   	
	
	Запрос.Текст = СтрСоединить(МассивТекст, Символы.ПС);
	Запрос.Выполнить();
		  	
	// Заполняем стоимость подарка
	Для каждого СтрокаТЧСкидки Из ТаблицаСкидок Цикл
		Если СтрокаТЧСкидки.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Подарок Тогда
			СтрокаТЧСкидки.СуммаСкидки = 0;
			Для каждого СтрокаНаборПодарков Из СтрокаТЧСкидки.СкидкаНаценка.НаборПодарков Цикл
				СтруктураПолученияЦены = Новый Структура();
				СтруктураПолученияЦены.Вставить("СтруктурнаяЕдиница",		СтруктураПараметров.СтруктурнаяЕдиница);
				СтруктураПолученияЦены.Вставить("ВидЦен", 					?(СтруктураПараметров.Свойство("ВидЦен"), СтруктураПараметров.ВидЦен, Справочники.ВидыЦен.Розничная));
				СтруктураПолученияЦены.Вставить("Номенклатура", 			СтрокаНаборПодарков.Номенклатура);
				СтруктураПолученияЦены.Вставить("Упаковка",					СтрокаНаборПодарков.Упаковка);
				СтруктураПолученияЦены.Вставить("ДатаОбработки",			СтруктураПараметров.ДатаСкидок);
				ЦенаНоменклатурыПодарка = Ценообразование.ПолучитьЦенуНоменклатуры(СтруктураПолученияЦены);
				СтрокаТЧСкидки.СуммаСкидки = СтрокаТЧСкидки.СуммаСкидки + ЦенаНоменклатурыПодарка * СтрокаНаборПодарков.КоличествоУпаковок;
			КонецЦикла;
		КонецЕсли; 
	КонецЦикла;
	
	// Расчитываем кол-во и стоимость подарков	
	// ТаблицаПодарков = ТаблицаСкидок.НайтиСтроки(Новый Структура("СпособПредоставленияСкидки", Перечисления.СпособПредоставленияСкидки.Подарок));
	// ТаблицаПодарков.Свернуть("СкидкаНаценка, Количество");  
	
	Для Каждого СтрокаТЧСкидки Из ТаблицаСкидок Цикл
		
		Если СтрокаТЧСкидки.СпособПредоставленияСкидки <> Перечисления.СпособПредоставленияСкидки.Подарок Тогда
			Продолжить;
		КонецЕсли; 
		
		// Заполняем количество
		Если СтрокаТЧСкидки.СкидкаНаценка.СкидкаНаЕдиныйКомплект = Истина
				И СтрокаТЧСкидки.СкидкаНаценка.НаборПокупкиДляПолученияПодарков.Количество() > 0 Тогда
				
			Запрос.УстановитьПараметр("Ссылка" , СтрокаТЧСкидки.СкидкаНаценка);
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НаборПокупкиДляПолученияПодарков.Скидка КАК Скидка,
			|	МИНИМУМ(ВЫБОР
			|			КОГДА НаборПокупкиДляПолученияПодарков.Количество = 0
			|				ТОГДА 0
			|			КОГДА ЕСТЬNULL(ТаблицаТоваров.Количество, 0) = 0
			|				ТОГДА 0
			|			ИНАЧЕ ТаблицаТоваров.Количество / НаборПокупкиДляПолученияПодарков.Количество
			|		КОНЕЦ) КАК Количество
			|ИЗ
			|	(ВЫБРАТЬ
			|		СкидкиНаценкиНаборПокупкиДляПолученияПодарков.Ссылка КАК Скидка,
			|		СкидкиНаценкиНаборПокупкиДляПолученияПодарков.Номенклатура КАК Номенклатура,
			|		СУММА(СкидкиНаценкиНаборПокупкиДляПолученияПодарков.Количество) КАК Количество
			|	ИЗ
			|		Справочник.СкидкиНаценки.НаборПокупкиДляПолученияПодарков КАК СкидкиНаценкиНаборПокупкиДляПолученияПодарков
			|	ГДЕ
			|		СкидкиНаценкиНаборПокупкиДляПолученияПодарков.Ссылка = &Ссылка
			|	
			|	СГРУППИРОВАТЬ ПО
			|		СкидкиНаценкиНаборПокупкиДляПолученияПодарков.Ссылка,
			|		СкидкиНаценкиНаборПокупкиДляПолученияПодарков.Номенклатура) КАК НаборПокупкиДляПолученияПодарков
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТовары КАК ТаблицаТоваров
			|		ПО НаборПокупкиДляПолученияПодарков.Номенклатура = ТаблицаТоваров.Номенклатура
			|
			|СГРУППИРОВАТЬ ПО
			|	НаборПокупкиДляПолученияПодарков.Скидка";
			
			СтрокаТЧСкидки.ЗначениеСкидкиНаценки = 0;
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				СтрокаТЧСкидки.ЗначениеСкидкиНаценки = Цел(Выборка.Количество);
			КонецЕсли;
		ИначеЕсли СтрокаТЧСкидки.СкидкаНаценка.СкидкаНаЕдиныйКомплект = Истина
				И СтрокаТЧСкидки.СкидкаНаценка.НаборПокупкиДляПолученияПодарков.Количество() = 0 Тогда
			СтрокаТЧСкидки.ЗначениеСкидкиНаценки = СтрокаТЧСкидки.Количество;
		Иначе
			СтрокаТЧСкидки.ЗначениеСкидкиНаценки = 1;
		КонецЕсли;
		СтрокаТЧСкидки.СуммаСкидки = СтрокаТЧСкидки.СуммаСкидки * СтрокаТЧСкидки.ЗначениеСкидкиНаценки;
	КонецЦикла;
	
	//// Разбиваем кол-во и сумму по позициям номенклатуры
	// Для каждого ЭлементСкидки Из МассивУникальныхСкидок Цикл
	//	
	//	СуммаТоваровСтрокСкидки = 0;
	//	Для каждого СтрокаТЧ Из ТаблицаСкидок.НайтиСтроки(Новый Структура("СкидкаНаценка", ЭлементСкидки)) Цикл
	//		СуммаТоваровСтрокСкидки = СуммаТоваровСтрокСкидки + СтрокаТЧ.Сумма;
	//	КонецЦикла;
	//	
	//	СуммаРаспределения = ТаблицаСкидок.Найти(ЭлементСкидки, "СкидкаНаценка").СуммаСкидки;
	//	КоличествоРаспределения = ТаблицаСкидок.Найти(ЭлементСкидки, "СкидкаНаценка").ЗначениеСкидкиНаценки;
	//	
	//	СуммаФактическогоРаспределения = 0;
	//	КоличествоФактическогоРаспределения = 0;
	//	Для каждого СтрокаСкидки Из ТаблицаСкидок.НайтиСтроки(Новый Структура("СкидкаНаценка", ЭлементСкидки)) Цикл
	//		СтрокаСкидки.СуммаСкидки = ?(СуммаТоваровСтрокСкидки <> 0, Окр(СтрокаСкидки.Сумма * СуммаРаспределения / СуммаТоваровСтрокСкидки, 2, 1), 0);
	//		СтрокаСкидки.ЗначениеСкидкиНаценки = ?(СуммаТоваровСтрокСкидки <> 0, Окр(СтрокаСкидки.Сумма * КоличествоРаспределения / СуммаТоваровСтрокСкидки, 2, 1), 0);
	//		СуммаФактическогоРаспределения = СуммаФактическогоРаспределения + СтрокаСкидки.СуммаСкидки;
	//		КоличествоФактическогоРаспределения = КоличествоФактическогоРаспределения + СтрокаСкидки.ЗначениеСкидкиНаценки;			
	//	КонецЦикла;
	//	
	//	Если (СуммаРаспределения - СуммаФактическогоРаспределения) <> 0 Тогда
	//		МассивСтрокСкидок = ТаблицаСкидок.НайтиСтроки(Новый Структура("СкидкаНаценка", ЭлементСкидки));
	//		МассивСтрокСкидок[0].СуммаСкидки = МассивСтрокСкидок[0].СуммаСкидки + (СуммаРаспределения - СуммаФактическогоРаспределения);
	//	КонецЕсли;		
	//	Если (КоличествоРаспределения - КоличествоФактическогоРаспределения) <> 0 Тогда
	//		МассивСтрокСкидок = ТаблицаСкидок.НайтиСтроки(Новый Структура("СкидкаНаценка", ЭлементСкидки));
	//		МассивСтрокСкидок[0].ЗначениеСкидкиНаценки = МассивСтрокСкидок[0].ЗначениеСкидкиНаценки + (КоличествоРаспределения - КоличествоФактическогоРаспределения);
	//	КонецЕсли;		
	//	
	// КонецЦикла; 	
	
	// Удаляем избыток подарков, которые не подошли по комплекту
	КоличествоСтрок = ТаблицаСкидок.Количество() - 1;
	Для а = 0 По КоличествоСтрок Цикл
		Если ТаблицаСкидок[КоличествоСтрок-а].СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Подарок
			И ТаблицаСкидок[КоличествоСтрок-а].ЗначениеСкидкиНаценки <= 0 Тогда
			
			ТаблицаСкидок.Удалить(ТаблицаСкидок[КоличествоСтрок-а]);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

// Определяет по таблице скидок подарков количество подарков
//
// Параметры:
//  ТаблицаСкидок - Таблица значений скидки подарки
//  ТаблицаТоваров - Таблица значений, в которую выгружена таблица товаров из документа
//  СтруктурнаяЕдиница - СтруктурнаяЕдиница, в котором рассчитываем скидки
//  ТаблицаНеПрименяемыхПодарков - Таблица значений, служит для возврата не используемых подарков
//
Процедура ОпределитьКоличествоВыдачиКарт(ТаблицаСкидок, СтруктураПараметров)

	МассивСтрокТЗСкидокДляУдаления = Новый Массив;
	ТаблицаОбработанныхСкидокВыдачиКарт = ТаблицаСкидок.СкопироватьКолонки();	
	
	// Расчитываем кол-во и стоимость подарков
	Для каждого СтрокаТЧСкидки Из ТаблицаСкидок Цикл
		Если СтрокаТЧСкидки.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.ВыдачаКарты Тогда
			Если ТаблицаОбработанныхСкидокВыдачиКарт.НайтиСтроки(Новый Структура("СкидкаНаценка, ЗначениеСкидкиНаценкиОбъектом", СтрокаТЧСкидки.СкидкаНаценка, СтрокаТЧСкидки.ЗначениеСкидкиНаценкиОбъектом)).Количество() = 0 Тогда
				СтрокаТЧСкидки.Использовать				= Истина;
				СтрокаТЧСкидки.ЗначениеСкидкиНаценки	= 1;
				СтрокаТЧСкидки.Номенклатура				= Неопределено;
				СтрокаТЧСкидки.КлючСтроки				= Неопределено;
				НоваяСтрока = ТаблицаОбработанныхСкидокВыдачиКарт.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧСкидки);
			Иначе
				МассивСтрокТЗСкидокДляУдаления.Добавить(СтрокаТЧСкидки);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	Для каждого СтрокаТЧСкидки Из МассивСтрокТЗСкидокДляУдаления Цикл
		ТаблицаСкидок.Удалить(СтрокаТЧСкидки); 
	КонецЦикла;
			
КонецПроцедуры

// Применяем скидку в строках ТЧ номенклатуры
//
// Параметры:
//  ТаблицаСкидок - Таблица значений скидки подарки
//  ТаблицаТоваров - Таблица значений, в которую выгружена таблица товаров из документа
//  ТабличнаяЧастьСкидки       - табличная часть скидок,
//  ТабличнаяЧастьПодарки - табличная часть "Подарки" документа.
//  СтруктурнаяЕдиница - СтруктурнаяЕдиница, в котором рассчитываем скидки
//
Процедура ПрименитьСкидкиВТаблицеТоваров(
	ТаблицаСкидок,
	ТаблицаЗапасов,
	ТаблицаЛечения,
	ТаблицаУслуг, 
	ТаблицаПредыдщееСостояниеСкидок,
	ДокументОбъект)
	
	ЭтоНарядЗаказ = ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.НарядЗаказ");
    ЭтоПланЛечения = ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ПланЛечения");
	
	Если ТаблицаЗапасов <> Неопределено Тогда
		Для Каждого СтрокаТЧ Из ТаблицаЗапасов Цикл
			
			СтрокаТЧ.ПроцентСкидкиНаценки				= 0;
			СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки	= 0;
			
			ТаблицаСкидокПоСтроке = ТаблицаСкидок.НайтиСтроки(Новый Структура("КлючСтроки, ПризнакОплатыБонусом, НачислениеБонусами, Использовать", СтрокаТЧ.КлючСтроки, Ложь, Ложь, Истина));
			Для каждого СтрокаТЗСкидок Из ТаблицаСкидокПоСтроке Цикл
				
				Если СтрокаТЗСкидок.СкидкаНаценка.ПризнакИспользованиеНаУсмотрение = Истина Тогда // Значит могут быть выклчены или не вклчены
					
					Если ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() > 0 // Эта скидка была раньше, значит берем ее состояние, если использование = ложь, пропускаем
						И ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, Использование, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, Ложь, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() > 0
						
						ИЛИ ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() = 0
						И СтрокаТЗСкидок.СкидкаНаценка.ПризнакИспользованиеВыклПоУмолчанию = Истина Тогда // Ранее не использовалась, 
						
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
				Если (СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Сумма
					ИЛИ СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.СуммаНаДокумент
					ИЛИ СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент) Тогда
					
					СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки = СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки + СтрокаТЗСкидок.СуммаСкидки;
				ИначеЕсли СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.ВидЦен Тогда
					СтрокаТЧ.Цена	= СтрокаТЗСкидок.Цена;
					СтрокаТЧ.Сумма	= СтрокаТЗСкидок.Сумма;
					СтрокаТЧ.ВидЦен = СтрокаТЗСкидок.ЗначениеСкидкиНаценкиОбъектом;				
				КонецЕсли; 
				
			КонецЦикла;  
			
			// 279041. Если меняется клиент и скидка по нему не считалась, то может быть заполнен некорректный вид цен.
	//		Если НЕ ЗначениеЗаполнено(ТаблицаСкидокПоСтроке) И СтрокаТЧ.ВидЦен <> ДокументОбъект.ВидЦен Тогда
	//			СтрокаТЧ.ВидЦен = ДокументОбъект.ВидЦен;
	//			
	//			СтруктураДанные = Новый Структура();
	//			СтруктураДанные.Вставить("СтруктурнаяЕдиница", ДокументОбъект.СтруктурнаяЕдиница);
	//			СтруктураДанные.Вставить("Номенклатура", 	   СтрокаТЧ.Номенклатура);
	//			СтруктураДанные.Вставить("Упаковка",		   СтрокаТЧ.Упаковка);
	//			СтруктураДанные.Вставить("ДатаОбработки",	   ДокументОбъект.Дата);
	//			СтруктураДанные.Вставить("ВидЦен", 			   СтрокаТЧ.ВидЦен);
	//			СтрокаТЧ.Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СтруктураДанные);
	//
	//		КонецЕсли;
			
			// Оплата бонусами
			ТаблицаСкидокПоСтроке = ТаблицаСкидок.НайтиСтроки(Новый Структура("КлючСтроки, ПризнакОплатыБонусом, Использовать", СтрокаТЧ.КлючСтроки, Истина, Истина));
			Для каждого СтрокаТЗСкидок Из ТаблицаСкидокПоСтроке Цикл
				СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки = СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки 
																+ СтрокаТЗСкидок.СуммаСкидки;
			КонецЦикла;
			
			// Пересчитываем общий процент скидки
			СтрокаТЧ.ПроцентСкидкиНаценки = ?(СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок > 0, (СтрокаТЧ.СуммаРучнойСкидки + СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки) / (СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок) * 100, 0);
			
			// ограничиваем процент скидки 100%. приоритет отдан автоматическим скидкам.
			Если СтрокаТЧ.ПроцентСкидкиНаценки > 100 Тогда
				
				ПроцентРучнойСкидкиДО		= ?(СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок > 0, (СтрокаТЧ.СуммаРучнойСкидки) / (СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок) * 100, 0);
				СуммаРучнойСкидкиДО			= СтрокаТЧ.СуммаРучнойСкидки;
				СтрокаТЧ.СуммаРучнойСкидки	= ?(СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок - СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки > 0, СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок - СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки, 0); 
				ПроцентРучнойСкидки			= ?(СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок > 0, (СтрокаТЧ.СуммаРучнойСкидки) / (СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок) * 100, 0);
				
				ИспользуемаяВалюта = ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Для строки № %1 процент ручной скидки уменьшен с %2 до %3, сумма ручной скидки уменьшена с %4 %5 до %6 %5'; en = 'For line №%1, the percentage of manual discounts is reduced from %2 to %3, the amount of manual discounts is reduced from %4 %5 to %6 %5'"), 
				СтрокаТЧ.НомерСтроки, 
				"" + ПроцентРучнойСкидкиДО + "% ", 
				"" + ПроцентРучнойСкидки + "% ", 
				СуммаРучнойСкидкиДО, 
				ИспользуемаяВалюта, 
				СтрокаТЧ.СуммаРучнойСкидки));
				
				СтрокаТЧ.ПроцентСкидкиНаценки = ?(СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок > 0, (СтрокаТЧ.СуммаРучнойСкидки + СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки) / (СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок) * 100, 0);
				
			КонецЕсли;		
			
		КонецЦикла;	
	КонецЕсли;
	
	Если ТаблицаЛечения <> Неопределено Тогда
		ПрименятьСкидкиПоПланамЛечения = ОбщегоНазначенияСтоматология.ПолучитьЗначениеКонстанты("ПрименятьСкидкиПоПланамЛечения");
		ЕстьКолонкаКоличествоУпаковокТЧЛечение = ДокументОбъект.Ссылка.Метаданные().ТабличныеЧасти.Лечение.Реквизиты.Найти("КоличествоУпаковок") <> Неопределено;
		ЕслиКолонкаДокументАвансаТЧЛечение = ДокументОбъект.Ссылка.Метаданные().ТабличныеЧасти.Лечение.Реквизиты.Найти("ДокументАванса") <> Неопределено;
		Для Каждого СтрокаТЧ Из ТаблицаЛечения Цикл			 			
				
			СтрокаТЧ.ПроцентСкидкиНаценки				= 0;
			СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки	= 0;			
			
			// Александра. Добавлена константа. Если она вкл,то скидки заполняем строго по документу аванса.
			Если ЕслиКолонкаДокументАвансаТЧЛечение = Истина Тогда
				Если ПрименятьСкидкиПоПланамЛечения = Истина И ЗначениеЗаполнено(СтрокаТЧ.ДокументАванса) Тогда
					
					СкидкиНаценкиДокументАванса = СтрокаТЧ.ДокументАванса.СкидкиНаценки.Выгрузить();    					
					ТЧСкидкиНаценкиПланаЛечения = СкидкиНаценкиДокументАванса.НайтиСтроки(Новый Структура("НоменклатураСкидки, КлючСтроки", СтрокаТЧ.Номенклатура, СтрокаТЧ.КлючСтроки));
					Если ЗначениеЗаполнено(ТЧСкидкиНаценкиПланаЛечения) Тогда						
						Для Каждого СтрокаТЧСкидкиНаценкиПланаЛечения Из ТЧСкидкиНаценкиПланаЛечения Цикл
							НоваяСтрока = ТаблицаСкидок.Добавить(); 
							НоваяСтрока.СкидкаНаценка = СтрокаТЧСкидкиНаценкиПланаЛечения.СкидкаНаценка;
							НоваяСтрока.Номенклатура = СтрокаТЧСкидкиНаценкиПланаЛечения.НоменклатураСкидки;
							НоваяСтрока.СуммаСкидки = СтрокаТЧСкидкиНаценкиПланаЛечения.Сумма;
							НоваяСтрока.ПризнакОплатыБонусом = СтрокаТЧСкидкиНаценкиПланаЛечения.ПризнакОплатыБонусом;
							НоваяСтрока.БонусныйСчет = СтрокаТЧСкидкиНаценкиПланаЛечения.БонусныйСчет;
							НоваяСтрока.Контрагент = СтрокаТЧСкидкиНаценкиПланаЛечения.Контрагент;
							НоваяСтрока.КлючСтроки = СтрокаТЧСкидкиНаценкиПланаЛечения.КлючСтроки;
							НоваяСтрока.Использовать = Истина;
							НоваяСтрока.НачислениеБонусами = ?(ЗначениеЗаполнено(СтрокаТЧСкидкиНаценкиПланаЛечения.БонусныйСчет), Истина, Ложь);							
							
							Если НЕ ЗначениеЗаполнено(НоваяСтрока.СпособПредоставленияСкидки) Тогда
								НоваяСтрока.СпособПредоставленияСкидки = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(НоваяСтрока.СкидкаНаценка, "СпособПредоставленияСкидки");		
							КонецЕсли;
							
							Если НЕ ЗначениеЗаполнено(НоваяСтрока.ЗначениеСкидкиНаценки) Тогда
								НоваяСтрока.ЗначениеСкидкиНаценки = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(НоваяСтрока.СкидкаНаценка, "ЗначениеСкидкиНаценки");		
							КонецЕсли;
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли; 
			// КонецДобавленного
			
			ТаблицаСкидокПоСтроке = ТаблицаСкидок.НайтиСтроки(Новый Структура("КлючСтроки, ПризнакОплатыБонусом, НачислениеБонусами, Использовать", СтрокаТЧ.КлючСтроки, Ложь, Ложь, Истина));			
			
			Для каждого СтрокаТЗСкидок Из ТаблицаСкидокПоСтроке Цикл
				
				Если СтрокаТЗСкидок.СкидкаНаценка.ПризнакИспользованиеНаУсмотрение = Истина Тогда // Значит могут быть выклчены или не вклчены
					
					Если ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() > 0 // Эта скидка была раньше, значит берем ее состояние, если использование = ложь, пропускаем
						И ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, Использование, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, Ложь, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() > 0
						
						ИЛИ ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() = 0
						И СтрокаТЗСкидок.СкидкаНаценка.ПризнакИспользованиеВыклПоУмолчанию = Истина Тогда // Ранее не использовалась, 
						
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;                   												
				
				Если (СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Сумма
					ИЛИ СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.СуммаНаДокумент
					ИЛИ СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент) Тогда
					
					// Александра. Добавлена константа. Если она вкл,то скидки заполняем строго по документу аванса.
					// если не меняем(применяем) скидки по плану лечения
					Если  (ЕслиКолонкаДокументАвансаТЧЛечение = Истина
						И ПрименятьСкидкиПоПланамЛечения = Истина И ЗначениеЗаполнено(СтрокаТЧ.ДокументАванса)) Тогда
						
						СтрокаТЧ.СуммаРучнойСкидки = 0;
						Если ТипЗнч(СтрокаТЧ.ДокументАванса) = Тип("ДокументСсылка.ПланЛечения") Тогда
							ТЧЛеченияДокументаАванса = СтрокаТЧ.ДокументАванса.Лечение.Выгрузить(); 
						ИначеЕсли ТипЗнч(СтрокаТЧ.ДокументАванса) = Тип("ДокументСсылка.НарядЗаказ") Тогда
							ТЧЛеченияДокументаАванса = СтрокаТЧ.ДокументАванса.Запасы.Выгрузить();
						КонецЕсли;							
						СтрокаРучнойСкидкиДокументаАванса = ТЧЛеченияДокументаАванса.НайтиСтроки(Новый Структура("КлючСтроки, Номенклатура",СтрокаТЧ.КлючСтроки, СтрокаТЧ.Номенклатура));
						Если ЗначениеЗаполнено(СтрокаРучнойСкидкиДокументаАванса) Тогда
							СтрокаТЧ.СуммаРучнойСкидки = СтрокаРучнойСкидкиДокументаАванса[0].СуммаРучнойСкидки;
						КонецЕсли; 
						
						СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки = СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки + СтрокаТЗСкидок.СуммаСкидки;						
						
					КонецЕсли;
					
					// если меняем скидки по плану лечения					
					Если ПрименятьСкидкиПоПланамЛечения = Ложь 
						ИЛИ (ПрименятьСкидкиПоПланамЛечения = Истина 
							И ЭтоПланЛечения ИЛИ (ЕслиКолонкаДокументАвансаТЧЛечение = Истина
							И НЕ ЗначениеЗаполнено(СтрокаТЧ.ДокументАванса))) Тогда
						
						СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки = СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки + СтрокаТЗСкидок.СуммаСкидки; 
						
					КонецЕсли;     									
					
					
				ИначеЕсли СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.ВидЦен Тогда
					СтрокаТЧ.Цена	= СтрокаТЗСкидок.Цена;
					СтрокаТЧ.Сумма	= СтрокаТЗСкидок.Сумма;
					СтрокаТЧ.ВидЦен = СтрокаТЗСкидок.ЗначениеСкидкиНаценкиОбъектом;				
				КонецЕсли; 	
				
			КонецЦикла;	   
			
			// 279041. Если меняется клиент и скидка по нему не считалась, то может быть заполнен некорректный вид цен.
	//		Если НЕ ЗначениеЗаполнено(ТаблицаСкидокПоСтроке) И СтрокаТЧ.ВидЦен <> ДокументОбъект.ВидЦен Тогда
	//			СтрокаТЧ.ВидЦен = ДокументОбъект.ВидЦен;
	//			
	//			СтруктураДанные = Новый Структура();
	//			СтруктураДанные.Вставить("СтруктурнаяЕдиница", ДокументОбъект.СтруктурнаяЕдиница);
	//			СтруктураДанные.Вставить("Номенклатура", 	   СтрокаТЧ.Номенклатура);
	//			СтруктураДанные.Вставить("Упаковка",		   СтрокаТЧ.Упаковка);
	//			СтруктураДанные.Вставить("ДатаОбработки",	   ДокументОбъект.Дата);
	//			СтруктураДанные.Вставить("ВидЦен", 			   СтрокаТЧ.ВидЦен);
	//			СтрокаТЧ.Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СтруктураДанные);
	//
	//		КонецЕсли;                		
						
			// Оплата бонусами
			ТаблицаСкидокПоСтроке = ТаблицаСкидок.НайтиСтроки(Новый Структура("КлючСтроки, ПризнакОплатыБонусом, Использовать", СтрокаТЧ.КлючСтроки, Истина, Истина));
			Для каждого СтрокаТЗСкидок Из ТаблицаСкидокПоСтроке Цикл
				СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки = СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки + СтрокаТЗСкидок.СуммаСкидки;
			КонецЦикла;
			
			// Пересчитываем общий процент скидки
			СтрокаТЧ_КоличествоУпаковок = ?(ЕстьКолонкаКоличествоУпаковокТЧЛечение, СтрокаТЧ.КоличествоУпаковок, СтрокаТЧ.Количество); 
			СтрокаТЧ.ПроцентСкидкиНаценки = ?(СтрокаТЧ.Цена * СтрокаТЧ_КоличествоУпаковок > 0, 
													(СтрокаТЧ.СуммаРучнойСкидки + СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки) / (СтрокаТЧ.Цена * СтрокаТЧ_КоличествоУпаковок) * 100, 0);
		
			// ограничиваем процент скидки 100%. приоритет отдан автоматическим скидкам.
			Если СтрокаТЧ.ПроцентСкидкиНаценки > 100 Тогда
				
				ПроцентРучнойСкидкиДО		= ?(СтрокаТЧ.Цена * СтрокаТЧ_КоличествоУпаковок > 0, (СтрокаТЧ.СуммаРучнойСкидки) / (СтрокаТЧ.Цена * СтрокаТЧ_КоличествоУпаковок) * 100, 0);
				СуммаРучнойСкидкиДО			= СтрокаТЧ.СуммаРучнойСкидки;
				СтрокаТЧ.СуммаРучнойСкидки	= ?(СтрокаТЧ.Цена * СтрокаТЧ_КоличествоУпаковок - СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки > 0, СтрокаТЧ.Цена * СтрокаТЧ_КоличествоУпаковок - СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки, 0); 
				ПроцентРучнойСкидки			= ?(СтрокаТЧ.Цена * СтрокаТЧ_КоличествоУпаковок > 0, (СтрокаТЧ.СуммаРучнойСкидки) / (СтрокаТЧ.Цена * СтрокаТЧ_КоличествоУпаковок) * 100, 0);
				
				ИспользуемаяВалюта = ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Для строки № %1 процент ручной скидки уменьшен с %2 до %3, сумма ручной скидки уменьшена с %4 %5 до %6 %5'; en = 'For line №%1, the percentage of manual discounts is reduced from %2 to %3, the amount of manual discounts is reduced from %4 %5 to %6 %5'"), 
				СтрокаТЧ.НомерСтроки, 
				"" + ПроцентРучнойСкидкиДО + "% ", 
				"" + ПроцентРучнойСкидки + "% ", 
				СуммаРучнойСкидкиДО, 
				ИспользуемаяВалюта, 
				СтрокаТЧ.СуммаРучнойСкидки));
				
				СтрокаТЧ.ПроцентСкидкиНаценки = ?(СтрокаТЧ.Цена * СтрокаТЧ_КоличествоУпаковок > 0, (СтрокаТЧ.СуммаРучнойСкидки + СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки) / (СтрокаТЧ.Цена * СтрокаТЧ_КоличествоУпаковок) * 100, 0);
				
			КонецЕсли;	
			
			
			
		КонецЦикла;	
	КонецЕсли;
	
	Если ТаблицаУслуг <> Неопределено Тогда
		Для Каждого СтрокаТЧ Из ТаблицаУслуг Цикл
			
			СтрокаТЧ.ПроцентСкидкиНаценки				= 0;
			СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки	= 0;
			
			// Скидки , Диана ранее был номер строки
			ТаблицаСкидокПоСтроке = ТаблицаСкидок.НайтиСтроки(Новый Структура("КлючСтроки, ПризнакОплатыБонусом, НачислениеБонусами, Использовать", СтрокаТЧ.КлючСтроки, Ложь, Ложь, Истина));
			Для каждого СтрокаТЗСкидок Из ТаблицаСкидокПоСтроке Цикл
				
				Если СтрокаТЗСкидок.СкидкаНаценка.ПризнакИспользованиеНаУсмотрение = Истина Тогда // Значит могут быть выклчены или не вклчены
					
					Если ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() > 0 // Эта скидка была раньше, значит берем ее состояние, если использование = ложь, пропускаем
						И ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, Использование, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, Ложь, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() > 0
						
						ИЛИ ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() = 0
						И СтрокаТЗСкидок.СкидкаНаценка.ПризнакИспользованиеВыклПоУмолчанию = Истина Тогда // Ранее не использовалась, 
						
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
				Если (СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Сумма
					ИЛИ СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.СуммаНаДокумент
					ИЛИ СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент) Тогда
					
					СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки = СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки + СтрокаТЗСкидок.СуммаСкидки;
				ИначеЕсли СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.ВидЦен Тогда
					СтрокаТЧ.Цена	= СтрокаТЗСкидок.Цена;
					СтрокаТЧ.Сумма	= СтрокаТЗСкидок.Сумма;
					СтрокаТЧ.ВидЦен = СтрокаТЗСкидок.ЗначениеСкидкиНаценкиОбъектом;				
				КонецЕсли; 
				
			КонецЦикла;  
			
			// 279041. Если меняется клиент и скидка по нему не считалась, то может быть заполнен некорректный вид цен.
			Если НЕ ЗначениеЗаполнено(ТаблицаСкидокПоСтроке) И СтрокаТЧ.ВидЦен <> ДокументОбъект.ВидЦен Тогда
				СтрокаТЧ.ВидЦен = ДокументОбъект.ВидЦен;
				
				СтруктураДанные = Новый Структура();
				СтруктураДанные.Вставить("СтруктурнаяЕдиница", ДокументОбъект.СтруктурнаяЕдиница);
				СтруктураДанные.Вставить("Номенклатура", 	   СтрокаТЧ.Номенклатура);
				СтруктураДанные.Вставить("Упаковка",		   СтрокаТЧ.Упаковка);
				СтруктураДанные.Вставить("ДатаОбработки",	   ДокументОбъект.Дата);
				СтруктураДанные.Вставить("ВидЦен", 			   СтрокаТЧ.ВидЦен);
				СтрокаТЧ.Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СтруктураДанные);
	
			КонецЕсли;
			
			// Оплата бонусами
			ТаблицаСкидокПоСтроке = ТаблицаСкидок.НайтиСтроки(Новый Структура("КлючСтроки, ПризнакОплатыБонусом, Использовать", СтрокаТЧ.КлючСтроки, Истина, Истина));
			Для каждого СтрокаТЗСкидок Из ТаблицаСкидокПоСтроке Цикл
				СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки = СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки + СтрокаТЗСкидок.СуммаСкидки;
			КонецЦикла;
			
			// Пересчитываем общий процент скидки
			СтрокаТЧ.ПроцентСкидкиНаценки = ?(СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок > 0, (СтрокаТЧ.СуммаРучнойСкидки + СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки) / (СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок) * 100, 0);
			
			// ограничиваем процент скидки 100%. приоритет отдан автоматическим скидкам.
			Если СтрокаТЧ.ПроцентСкидкиНаценки > 100 Тогда
				
				ПроцентРучнойСкидкиДО		= ?(СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок > 0, (СтрокаТЧ.СуммаРучнойСкидки) / (СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок) * 100, 0);
				СуммаРучнойСкидкиДО			= СтрокаТЧ.СуммаРучнойСкидки;
				СтрокаТЧ.СуммаРучнойСкидки	= ?(СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок - СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки > 0, СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок - СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки, 0); 
				ПроцентРучнойСкидки			= ?(СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок > 0, (СтрокаТЧ.СуммаРучнойСкидки) / (СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок) * 100, 0);
				
				ИспользуемаяВалюта = ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Для строки № %1 процент ручной скидки уменьшен с %2 до %3, сумма ручной скидки уменьшена с %4 %5 до %6 %5'; en = 'For line №%1, the percentage of manual discounts is reduced from %2 to %3, the amount of manual discounts is reduced from %4 %5 to %6 %5'"), 
				СтрокаТЧ.НомерСтроки, 
				"" + ПроцентРучнойСкидкиДО + "% ", 
				"" + ПроцентРучнойСкидки + "% ", 
				СуммаРучнойСкидкиДО, 
				ИспользуемаяВалюта, 
				СтрокаТЧ.СуммаРучнойСкидки));
				
				СтрокаТЧ.ПроцентСкидкиНаценки = ?(СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок > 0, (СтрокаТЧ.СуммаРучнойСкидки + СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки) / (СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок) * 100, 0);
				
			КонецЕсли;				
			
		КонецЦикла;	
	КонецЕсли;

КонецПроцедуры

// Заполняет таблицу подарки по скидкам
//
// Параметры:
//  ТаблицаСкидок - Таблица значений скидки подарки
//  ТаблицаТоваров - Таблица значений, в которую выгружена таблица товаров из документа
//  ТабличнаяЧастьСкидки       - табличная часть скидок,
//  ТабличнаяЧастьПодарки - табличная часть "Подарки" документа.
//  СтруктурнаяЕдиница - СтруктурнаяЕдиница, в котором рассчитываем скидки
//
Процедура ЗаполнитьТЧСкидокНаценок(ТаблицаСкидок, ТабличнаяЧастьСкидкиНаценки, ТаблицаПредыдщееСостояниеСкидок)

	// заполняем ТЧ скидок наценок
	Для Каждого СтрокаТЗСкидок Из ТаблицаСкидок Цикл
		
		Если СтрокаТЗСкидок.Использовать = Ложь Тогда
			Продолжить;
		КонецЕсли; 
		
		Если СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент
				ИЛИ СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Сумма
				ИЛИ СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.СуммаНаДокумент Тогда
				
			Если СтрокаТЗСкидок.СуммаСкидки = 0 Тогда
				Продолжить;
			КонецЕсли;
				
			НоваяСтрока = ТабличнаяЧастьСкидкиНаценки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗСкидок);
			НоваяСтрока.НоменклатураСкидки	= СтрокаТЗСкидок.Номенклатура;
			НоваяСтрока.Сумма				= СтрокаТЗСкидок.СуммаСкидки;
			НоваяСтрока.Использование		= Истина;
			Если СтрокаТЗСкидок.СкидкаНаценка.ПризнакИспользованиеНаУсмотрение = Истина Тогда // Значит могут быть выклчены или не вклчены
				Если ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() > 0 // Эта скидка была раньше, значит берем ее состояние, если использование = ложь, пропускаем
							И ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, Использование, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, Ложь, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() > 0
						ИЛИ ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() = 0
							И СтрокаТЗСкидок.СкидкаНаценка.ПризнакИспользованиеВыклПоУмолчанию = Истина Тогда // Ранее не использовалась, 
					НоваяСтрока.Использование = Ложь;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.ВидЦен Тогда 
			
			НоваяСтрока = ТабличнаяЧастьСкидкиНаценки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗСкидок);
			НоваяСтрока.НоменклатураСкидки = СтрокаТЗСкидок.Номенклатура;
			// НоваяСтрока.ПриминениеСкидки = 2;
			НоваяСтрока.Сумма = 0;
			НоваяСтрока.Использование = Истина;
						
		ИначеЕсли СтрокаТЗСкидок.ПризнакОплатыБонусом = Истина Тогда
			
			НоваяСтрока = ТабличнаяЧастьСкидкиНаценки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗСкидок);
			НоваяСтрока.НоменклатураСкидки	= СтрокаТЗСкидок.Номенклатура;
			НоваяСтрока.Сумма				= СтрокаТЗСкидок.СуммаСкидки;
			НоваяСтрока.Использование		= Истина;
			
		КонецЕсли; 
			
	КонецЦикла;
		
КонецПроцедуры

// Заполняет таблицу подарки по скидкам
//
// Параметры:
//  ТаблицаСкидок - Таблица значений скидки подарки
//  ТаблицаТоваров - Таблица значений, в которую выгружена таблица товаров из документа
//  ТабличнаяЧастьСкидки       - табличная часть скидок,
//  ТабличнаяЧастьПодарки - табличная часть "Подарки" документа.
//  СтруктурнаяЕдиница - СтруктурнаяЕдиница, в котором рассчитываем скидки
//
Процедура ЗаполнитьТЧПодарков(ТаблицаСкидок, ТабличнаяЧастьПодарки, ТаблицаПредыдщееСостояниеСкидок)

	ТаблицаСкидокПодарков = ТаблицаСкидок.Скопировать();
	ТаблицаСкидокПодарков.Свернуть("КлючСтроки, СкидкаНаценка, СпособПредоставленияСкидки, Использовать, Контрагент", "ЗначениеСкидкиНаценки");
	
	// Раскрываем и заполняем ТЧ подарков
	Для Каждого СтрокаТЗСкидок Из ТаблицаСкидокПодарков Цикл
		
		Если СтрокаТЗСкидок.Использовать = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Подарок Тогда
			
			ТаблицаПодарков = СтрокаТЗСкидок.СкидкаНаценка.НаборПодарков.Выгрузить();
			ТаблицаПодарков.Колонки.Добавить("СкидкаНаценка");
			ТаблицаПодарков.Колонки.Добавить("КлючСтроки");
			ТаблицаПодарков.Колонки.Добавить("Использование");
			// ТаблицаПодарков.Колонки.Добавить("НоменклатураДополнительная");
			// ТаблицаПодарков.Колонки.Добавить("СертификатТип");
			ТаблицаПодарков.Колонки.Добавить("Контрагент");
			
			Для Каждого СтрокаТаблицыПодарки Из ТаблицаПодарков Цикл
				
				СтрокаТаблицыПодарки.КлючСтроки					= СтрокаТЗСкидок.КлючСтроки;
				СтрокаТаблицыПодарки.СкидкаНаценка				= СтрокаТЗСкидок.СкидкаНаценка;
				СтрокаТаблицыПодарки.КоличествоУпаковок 		= СтрокаТаблицыПодарки.КоличествоУпаковок * СтрокаТЗСкидок.ЗначениеСкидкиНаценки;
				СтрокаТаблицыПодарки.Количество					= СтрокаТаблицыПодарки.Количество * СтрокаТЗСкидок.ЗначениеСкидкиНаценки;
				СтрокаТаблицыПодарки.Использование				= Истина;
				СтрокаТаблицыПодарки.Контрагент					= СтрокаТЗСкидок.Контрагент;
				
				// СтруктураПараметровНоменклатуры = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(СтрокаТаблицыПодарки.Номенклатура, 
				//													"СертификатВидРеализацииПакета, СертификатТип, СертификатПакетУслуг");
				//
				// Если СтруктураПараметровНоменклатуры.СертификатТип = Перечисления.ТипыПодарочныхСертификатов.НаПакетУслуг
				//	и СтруктураПараметровНоменклатуры.СертификатВидРеализацииПакета = Перечисления.ТипыНоминаловПодарочныхСертификатов.Фиксированный Тогда  
				//	СтрокаТаблицыПодарки.НоменклатураДополнительная = СтруктураПараметровНоменклатуры.СертификатПакетУслуг;
				// Иначе
				//	СтрокаТаблицыПодарки.НоменклатураДополнительная = Неопределено;
				// КонецЕсли;
				
				Если СтрокаТЗСкидок.СкидкаНаценка.ПризнакИспользованиеНаУсмотрение = Истина Тогда // Значит могут быть выклчены или не вклчены
					Если ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, СтрокаТаблицыПодарки.СкидкаНаценка, СтрокаТаблицыПодарки.Номенклатура)).Количество() > 0 // Эта скидка была раньше, значит берем ее состояние, если использование = ложь, пропускаем
								И ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, Использование, СкидкаНаценка, Номенклатура", СтрокаТаблицыПодарки.КлючСтроки, Ложь, СтрокаТаблицыПодарки.СкидкаНаценка, СтрокаТаблицыПодарки.Номенклатура)).Количество() > 0
							ИЛИ ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, СкидкаНаценка, Номенклатура", СтрокаТаблицыПодарки.КлючСтроки, СтрокаТаблицыПодарки.СкидкаНаценка, СтрокаТаблицыПодарки.Номенклатура)).Количество() = 0
								И СтрокаТЗСкидок.СкидкаНаценка.ПризнакИспользованиеВыклПоУмолчанию = Истина Тогда // Ранее не использовалась, 
						СтрокаТаблицыПодарки.Использование = Ложь;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			ОбщегоНазначенияКлиентСерверСтоматология.ЗагрузитьВТаблицуЗначений(ТаблицаПодарков, ТабличнаяЧастьПодарки);

		ИначеЕсли СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.ВыдачаКарты Тогда
			
			НоваяСтрока = ТабличнаяЧастьПодарки.Добавить();
			НоваяСтрока.СкидкаНаценка		= СтрокаТЗСкидок.СкидкаНаценка;
			НоваяСтрока.Количество			= СтрокаТЗСкидок.ЗначениеСкидкиНаценки;
			НоваяСтрока.КоличествоУпаковок	= СтрокаТЗСкидок.ЗначениеСкидкиНаценки;			
			
		КонецЕсли; 
					
	КонецЦикла;
			
КонецПроцедуры

// Рассчитывает значение сложной скидки
//
// Параметры
//  МассивСкидок  - Массив скидок, по которым выполнилось условие
//  СтрокаТоваров - Строка таблицы значений с данными из документа
//  СтруктурнаяЕдиница - СтруктурнаяЕдиница в котором рассчитывается скидка
//  ДатаДокумента - Дата документа необходима для расчета скидки по цене
//
// Возвращаемое значение:
//  Сумма скидки
//
Процедура РасчитатьПрименитьВытеснениСложныхСкидокПоГруппам(ТаблицаСкидок, СтруктураПараметров, ТипНачисленияСкидкаБонус = "Все", МассивБонусовНеНачисляемыхПриНаличииСкидки = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаСкидок"								, ТаблицаСкидок);
	Запрос.УстановитьПараметр("ТипНачисленияСкидкаБонус"					, ТипНачисленияСкидкаБонус);
	Запрос.УстановитьПараметр("МассивБонусовНеНачисляемыхПриНаличииСкидки"	, ?(Не ЗначениеЗаполнено(МассивБонусовНеНачисляемыхПриНаличииСкидки), NULL, МассивБонусовНеНачисляемыхПриНаличииСкидки));

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСкидок.СкидкаНаценка КАК СкидкаНаценка,
	|	ТаблицаСкидок.НачислениеБонусами КАК НачислениеБонусами,
	|	ТаблицаСкидок.ПорядокПрименения КАК ПорядокПрименения,
	|	ТаблицаСкидок.СпособПредоставленияСкидки КАК СпособПредоставленияСкидки,
	|	ТаблицаСкидок.Сумма КАК Сумма,
	|	ТаблицаСкидок.ЗначениеСкидкиНаценки КАК ЗначениеСкидкиНаценки,
	|	ТаблицаСкидок.ЗначениеСкидкиНаценкиОбъектом КАК ЗначениеСкидкиНаценкиОбъектом,
	|	ТаблицаСкидок.Использовать КАК Использовать,
	|	ТаблицаСкидок.СуммаСкидки КАК СуммаСкидки
	|ПОМЕСТИТЬ ТаблицаСкидок
	|ИЗ
	|	&ТаблицаСкидок КАК ТаблицаСкидок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСкидок.СкидкаНаценка КАК СкидкаНаценка,
	|	ТаблицаСкидок.НачислениеБонусами КАК НачислениеБонусами,
	|	ТаблицаСкидок.ПорядокПрименения КАК ПорядокПрименения,
	|	ТаблицаСкидок.СпособПредоставленияСкидки КАК СпособПредоставленияСкидки,
	|	ТаблицаСкидок.Сумма КАК Сумма,
	|	ВЫРАЗИТЬ(ТаблицаСкидок.ЗначениеСкидкиНаценки КАК ЧИСЛО(15, 6)) КАК ЗначениеСкидкиНаценки,
	|	ТаблицаСкидок.ЗначениеСкидкиНаценкиОбъектом КАК ЗначениеСкидкиНаценкиОбъектом,
	|	ТаблицаСкидок.Использовать КАК Использовать,
	|	ТаблицаСкидок.СуммаСкидки КАК СуммаСкидки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаСкидок.СкидкаНаценка КАК СкидкаНаценка,
	|		МИНИМУМ(ТаблицаСкидок.НачислениеБонусами) КАК НачислениеБонусами,
	|		МИНИМУМ(ВЫБОР
	|				КОГДА ТаблицаСкидок.СпособПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.СпособПредоставленияСкидки.ВидЦен)
	|					ТОГДА -1
	|				ИНАЧЕ ТаблицаСкидок.ПорядокПрименения
	|			КОНЕЦ) КАК ПорядокПрименения,
	|		МИНИМУМ(ТаблицаСкидок.СпособПредоставленияСкидки) КАК СпособПредоставленияСкидки,
	|		СУММА(ТаблицаСкидок.Сумма) КАК Сумма,
	|		МИНИМУМ(ТаблицаСкидок.ЗначениеСкидкиНаценки) КАК ЗначениеСкидкиНаценки,
	|		МИНИМУМ(ТаблицаСкидок.ЗначениеСкидкиНаценкиОбъектом) КАК ЗначениеСкидкиНаценкиОбъектом,
	|		МИНИМУМ(ТаблицаСкидок.Использовать) КАК Использовать,
	|		СУММА(ТаблицаСкидок.СуммаСкидки) КАК СуммаСкидки
	|	ИЗ
	|		ТаблицаСкидок КАК ТаблицаСкидок
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА &ТипНачисленияСкидкаБонус = ""ТолькоСкидки""
	|					ТОГДА ТаблицаСкидок.НачислениеБонусами = ЛОЖЬ
	|				КОГДА &ТипНачисленияСкидкаБонус = ""ТолькоБонусы""
	|					ТОГДА ТаблицаСкидок.НачислениеБонусами = ИСТИНА
	|							И ВЫБОР
	|								КОГДА НЕ &МассивБонусовНеНачисляемыхПриНаличииСкидки ЕСТЬ NULL
	|									ТОГДА НЕ ТаблицаСкидок.СкидкаНаценка В (&МассивБонусовНеНачисляемыхПриНаличииСкидки)
	|								ИНАЧЕ ИСТИНА
	|							КОНЕЦ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаСкидок.СкидкаНаценка) КАК ТаблицаСкидок
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаСкидок.НачислениеБонусами,
	|	ТаблицаСкидок.ПорядокПрименения
	|ИТОГИ ПО
	|	СкидкаНаценка ТОЛЬКО ИЕРАРХИЯ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Высчитываем точну скидку, применяем вытеснение
	ДеревоПримененияСкидок = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	// Избавляемся от первой пустой строчки иерархии с пустым родителем
	ДеревоПримененияСкидокВрем = ДеревоПримененияСкидок.Скопировать();
	ДеревоПримененияСкидок.Строки.Очистить();
	Для Каждого СтрокаТЗ Из ДеревоПримененияСкидокВрем.Строки Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.СкидкаНаценка) Тогда
			Для Каждого СтрокаТЗВторогоУровня Из СтрокаТЗ.Строки Цикл
				СкопироватьСтрокуДереваЗначений(ДеревоПримененияСкидокВрем, СтрокаТЗВторогоУровня, ДеревоПримененияСкидок);
			КонецЦикла;
		Иначе
			СкопироватьСтрокуДереваЗначений(ДеревоПримененияСкидокВрем, СтрокаТЗ, ДеревоПримененияСкидок);
		КонецЕсли; 
	КонецЦикла;
	
	РассчитатьПрименитьВытеснениеСкидокВДереве(ТаблицаСкидок, ДеревоПримененияСкидок, Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Сложение, СтруктураПараметров);
	
	// Переносим результат применения скидок и уточненну сумму в таблицу скидок
	ТаблицаПримененияСкидок = ВыгрузитьДеревоЗначенийВТаблицу(ДеревоПримененияСкидок, Ложь);
	Для Каждого СтрокаПримененияСкидки Из ТаблицаПримененияСкидок Цикл
		
		СтрокиТаблицыСкидок = ТаблицаСкидок.НайтиСтроки(Новый Структура("СкидкаНаценка", СтрокаПримененияСкидки.СкидкаНаценка));
		Если СтрокиТаблицыСкидок.Количество() = 0
				ИЛИ СтрокаПримененияСкидки.СкидкаНаценка.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.ВыдачаКарты Тогда			
			Продолжить;
		КонецЕсли; 
		
		// Пропорционально разбиваем сумму
		СуммаСкидкиВТаблицеСкидок = ИтогоВМассивеСтрок(СтрокиТаблицыСкидок, "СуммаСкидки");
		Для Каждого СтрокаТаблицыСкидки Из СтрокиТаблицыСкидок Цикл
			СтрокаТаблицыСкидки.Использовать = СтрокаПримененияСкидки.Использовать;
			СтрокаТаблицыСкидки.СуммаСкидки  = СтрокаПримененияСкидки.СуммаСкидки * ((СтрокаТаблицыСкидки.СуммаСкидки * ?(СуммаСкидкиВТаблицеСкидок <> 0, 100 / СуммаСкидкиВТаблицеСкидок, 0)) / 100);
		КонецЦикла;
		
		// Раскидываем потерявшиеся копейки
		СуммаСкидкиВТаблицеСкидок = ИтогоВМассивеСтрок(СтрокиТаблицыСкидок, "СуммаСкидки");
		Если СтрокаПримененияСкидки.СуммаСкидки <> СуммаСкидкиВТаблицеСкидок Тогда
			СтрокиТаблицыСкидок[0].СуммаСкидки = СтрокиТаблицыСкидок[0].СуммаСкидки + (СтрокаПримененияСкидки.СуммаСкидки - СуммаСкидкиВТаблицеСкидок);
		КонецЕсли; 
		
	КонецЦикла;
	
	// исправить!!!
	
	// Корректируем сумму скидки если скидка больше суммы товара
	Если ТипНачисленияСкидкаБонус <> "ТолькоБонусы" Тогда
		РазличныеСтрокиНоменклатуры = ТаблицаСкидок.Скопировать();
		РазличныеСтрокиНоменклатуры.Свернуть("КлючСтроки, Номенклатура");
		Для Каждого СтрокаТЗ Из РазличныеСтрокиНоменклатуры Цикл
			
			СуммаАвтоматическойСкидки = 0;
			СтрокиТаблицыСкидок = ТаблицаСкидок.НайтиСтроки(Новый Структура("КлючСтроки, Использовать", СтрокаТЗ.КлючСтроки, Истина));
			Для каждого СтрокаПримененияСкидки Из СтрокиТаблицыСкидок Цикл
				
				// Округляем скидки
				Если СтруктураПараметров.Свойство("ВидЦен") Тогда
					СтрокаПримененияСкидки.СуммаСкидки = ОбщегоНазначенияКлиентСервер.ОкруглитьЦену(
																						СтрокаПримененияСкидки.СуммаСкидки,
																						СтруктураПараметров.ВидЦен.ПорядокОкругления,
																						СтруктураПараметров.ВидЦен.ОкруглятьВБольшуюСторону);
				КонецЕсли;			
				
				// Корректируем сумму скидки если скидка больше суммы товара			
				Если СтрокаПримененияСкидки.СпособПредоставленияСкидки <> Перечисления.СпособПредоставленияСкидки.Подарок 
					И СтрокаПримененияСкидки.СпособПредоставленияСкидки <> Перечисления.СпособПредоставленияСкидки.ВидЦен
					И СтрокаПримененияСкидки.НачислениеБонусами <> Истина Тогда
					
					Если СтрокаПримененияСкидки.ПредыдщееСостояниеИспользование = Истина Тогда
						
						Если СтрокаПримененияСкидки.Цена * СтрокаПримененияСкидки.КоличествоУпаковок < СтрокаПримененияСкидки.СуммаСкидки + СуммаАвтоматическойСкидки Тогда
							СтрокаПримененияСкидки.СуммаСкидки = (СтрокаПримененияСкидки.Цена * СтрокаПримененияСкидки.КоличествоУпаковок - СуммаАвтоматическойСкидки);
						КонецЕсли;
						СуммаАвтоматическойСкидки = СуммаАвтоматическойСкидки + СтрокаПримененияСкидки.СуммаСкидки;	
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Рекурсивно обходит дерево и рассчитывает скидки
//
// Параметры:
//  СтрокиДерева  - Массив скидок, по которым выполнилось условие
//  ВариантСовместногоПримененияСкидокНаценок - Вариант совместного применения
//  СтрокаТоваров - Строка таблицы значений с данными из документа
//
// Возвращаемое значение:
//  Сумма скидки
//
Процедура РассчитатьПрименитьВытеснениеСкидокВДереве(
	ТаблицаСкидок, 
	СкидкиДеревомВИерархии, 
	ВариантСовместногоПримененияСкидокНаценок,
	СтруктураПараметров							= Неопределено, 
	Знач ОграничениеПоГруппе					= 0,
	ТаблицаОграниченийПоГруппам 				= Неопределено)
	
	Если СтруктураПараметров <> Неопределено И ТипЗнч(СтруктураПараметров) = Тип("Структура") И НЕ СтруктураПараметров.Свойство("ТаблицаСкидок") Тогда 
		СтруктураПараметров.Вставить("ТаблицаСкидок", ТаблицаСкидок);
	КонецЕсли;
	
	ВремСуммаДляВариантаУсноженияСкидок = 0;
	
	// Расчитываем значение скидок рекрсивно
	Для каждого СтрокаСкидкиДерева Из СкидкиДеревомВИерархии.Строки Цикл
		Если СтрокаСкидкиДерева.СкидкаНаценка.ЭтоГруппа Тогда                 // группа
			Если ТаблицаОграниченийПоГруппам = Неопределено Тогда 
				ТаблицаОграниченийПоГруппам = СоздатьТаблицуОграниченийПоГруппам();
			КонецЕсли;
			ДобавитьВТаблицуГруппуОграничений(ТаблицаОграниченийПоГруппам, СтрокаСкидкиДерева.СкидкаНаценка);
			ОграничениеПоГруппе = ?(ОграничениеПоГруппе = 0,
									СтрокаСкидкиДерева.СкидкаНаценка.ЗначениеСкидкиНаценки,
									?(СтрокаСкидкиДерева.СкидкаНаценка.ЗначениеСкидкиНаценки = 0, 
											ОграничениеПоГруппе,
											Мин(ОграничениеПоГруппе, СтрокаСкидкиДерева.СкидкаНаценка.ЗначениеСкидкиНаценки)));
											
			РассчитатьПрименитьВытеснениеСкидокВДереве(
						ТаблицаСкидок,
						СтрокаСкидкиДерева, 
						СтрокаСкидкиДерева.СкидкаНаценка.ВариантСовместногоПримененияСкидокНаценок,
						СтруктураПараметров, 
						ОграничениеПоГруппе, 
						ТаблицаОграниченийПоГруппам);
		Иначе
			Если СтрокаСкидкиДерева.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент Тогда
				ПрименитьОграничениеСкидкиНаценки(СтрокаСкидкиДерева.СкидкаНаценка, ТаблицаОграниченийПоГруппам, СтрокаСкидкиДерева, СтруктураПараметров);
						СтрокаСкидкиДерева.СуммаСкидки = ?(ВариантСовместногоПримененияСкидокНаценок = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Умножение,
										(СтрокаСкидкиДерева.Сумма - ВремСуммаДляВариантаУсноженияСкидок) * СтрокаСкидкиДерева.ЗначениеСкидкиНаценки / 100,
										СтрокаСкидкиДерева.Сумма * СтрокаСкидкиДерева.ЗначениеСкидкиНаценки / 100);
			Иначе // Расчет их уже был
				ПрименитьОграничениеСкидкиНаценки(СтрокаСкидкиДерева.СкидкаНаценка, ТаблицаОграниченийПоГруппам, СтрокаСкидкиДерева, СтруктураПараметров);
				СтрокаСкидкиДерева.СуммаСкидки = СтрокаСкидкиДерева.СуммаСкидки;				
			КонецЕсли;
		КонецЕсли;
		ВремСуммаДляВариантаУсноженияСкидок = ВремСуммаДляВариантаУсноженияСкидок + СтрокаСкидкиДерева.СуммаСкидки;
	КонецЦикла;
	
	Если ТипЗнч(СкидкиДеревомВИерархии) = Тип("СтрокаДереваЗначений") Тогда
		СкидкиДеревомВИерархии.СуммаСкидки = 0;
	КонецЕсли;			
	
	СуммаНачисленияГруппой = 0;
	МассивОбработанныхНоменклатур = Новый Массив;
	Для каждого СтрокаДерева Из СкидкиДеревомВИерархии.Строки Цикл
		Для каждого СтрокаТЗ Из ТаблицаСкидок.НайтиСтроки(Новый Структура("СкидкаНаценка", СтрокаДерева.СкидкаНаценка)) Цикл
			Если МассивОбработанныхНоменклатур.Найти(СтрокаТЗ.КлючСтроки) = Неопределено Тогда
				МассивОбработанныхНоменклатур.Добавить(СтрокаТЗ.КлючСтроки);
				СуммаНачисленияГруппой = СуммаНачисленияГруппой + СтрокаТЗ.Сумма;
			КонецЕсли; 
		КонецЦикла;
	КонецЦикла;
	
	// Применяем совместное применение скидок - устанавливаем использование/неиспользование в звисимости от применения, устанавливаем итогову сумму скидки для группы	
	Если ВариантСовместногоПримененияСкидокНаценок = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Минимум
			ИЛИ ВариантСовместногоПримененияСкидокНаценок = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Максимум Тогда
		СкидкиДеревомВИерархии.Строки.Сортировать("СуммаСкидки " + ?(ВариантСовместногоПримененияСкидокНаценок = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Минимум, "Возр", "Убыв"));
		Для каждого СтрокаДерева Из СкидкиДеревомВИерархии.Строки Цикл
			Если СтрокаДерева = СкидкиДеревомВИерархии.Строки[0] Тогда
				УстановитьЗначениеДерева(СтрокаДерева, "Использовать", Истина, Ложь);
				Если ТипЗнч(СкидкиДеревомВИерархии) = Тип("СтрокаДереваЗначений") Тогда
					Если НЕ ОграничениеПоГруппе = 0 И СуммаНачисленияГруппой * ОграничениеПоГруппе / 100 < СтрокаДерева.СуммаСкидки Тогда
						СтрокаДерева.СуммаСкидки = СуммаНачисленияГруппой * ОграничениеПоГруппе / 100;						
					ИначеЕсли ЗначениеЗаполнено(СкидкиДеревомВИерархии.СкидкаНаценка) И СкидкиДеревомВИерархии.СкидкаНаценка.ЗначениеСкидкиНаценки > 0
							И СуммаНачисленияГруппой * СкидкиДеревомВИерархии.СкидкаНаценка.ЗначениеСкидкиНаценки / 100 < СтрокаДерева.СуммаСкидки Тогда
						СтрокаДерева.СуммаСкидки = СуммаНачисленияГруппой * СкидкиДеревомВИерархии.СкидкаНаценка.ЗначениеСкидкиНаценки / 100;
					КонецЕсли;
					СкидкиДеревомВИерархии.СуммаСкидки = СтрокаДерева.СуммаСкидки;
				КонецЕсли;				
			Иначе
				УстановитьЗначениеДерева(СтрокаДерева, "Использовать", Ложь, Истина);
			КонецЕсли; 
		КонецЦикла; 
	ИначеЕсли ВариантСовместногоПримененияСкидокНаценок = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Сложение
				ИЛИ ВариантСовместногоПримененияСкидокНаценок = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Умножение
				ИЛИ ВариантСовместногоПримененияСкидокНаценок = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.ПустаяСсылка() Тогда
		Для каждого СтрокаДерева Из СкидкиДеревомВИерархии.Строки Цикл
			УстановитьЗначениеДерева(СтрокаДерева, "Использовать", Истина, Ложь);
			Если ТипЗнч(СкидкиДеревомВИерархии) = Тип("СтрокаДереваЗначений") Тогда
				
				Если НЕ ОграничениеПоГруппе = 0 И СуммаНачисленияГруппой * ОграничениеПоГруппе / 100 < (СкидкиДеревомВИерархии.СуммаСкидки + СтрокаДерева.СуммаСкидки) Тогда
					СтрокаДерева.СуммаСкидки = СуммаНачисленияГруппой * ОграничениеПоГруппе / 100 - СкидкиДеревомВИерархии.СуммаСкидки;
				ИначеЕсли ЗначениеЗаполнено(СкидкиДеревомВИерархии.СкидкаНаценка) И СкидкиДеревомВИерархии.СкидкаНаценка.ЗначениеСкидкиНаценки > 0
						И СуммаНачисленияГруппой * СкидкиДеревомВИерархии.СкидкаНаценка.ЗначениеСкидкиНаценки / 100 < (СкидкиДеревомВИерархии.СуммаСкидки + СтрокаДерева.СуммаСкидки) Тогда
					СтрокаДерева.СуммаСкидки = СуммаНачисленияГруппой * СкидкиДеревомВИерархии.СкидкаНаценка.ЗначениеСкидкиНаценки / 100 - СкидкиДеревомВИерархии.СуммаСкидки;
				КонецЕсли;
				
				СкидкиДеревомВИерархии.СуммаСкидки = СкидкиДеревомВИерархии.СуммаСкидки + СтрокаДерева.СуммаСкидки;
				
			КонецЕсли;			
		КонецЦикла; 		
	КонецЕсли;
	
КонецПроцедуры

// Функция - Создать таблицу ограничений по группам
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьТаблицуОграниченийПоГруппам()
	
	ТаблицаОграниченийПоГруппам = Новый ТаблицаЗначений;
	ТаблицаОграниченийПоГруппам.Колонки.Добавить("СкидкаНаценка"						, Новый ОписаниеТипов("СправочникСсылка.СкидкиНаценки"));
	ТаблицаОграниченийПоГруппам.Колонки.Добавить("ВариантыСовместногоПрименения"		, Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыСовместногоПримененияСкидокНаценок"));
	ТаблицаОграниченийПоГруппам.Колонки.Добавить("МаксимальноеЗначениеСкидкиНаценки"	, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 4)));
	ТаблицаОграниченийПоГруппам.Колонки.Добавить("НакапливаемоеЗначениеСкидкиНаценки"	, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 4)));
	ТаблицаОграниченийПоГруппам.Колонки.Добавить("ОптимальнаяСкидкаНаценка"				, Новый ОписаниеТипов("СправочникСсылка.СкидкиНаценки"));
	
	Возврат ТаблицаОграниченийПоГруппам;
	
КонецФункции

// Процедура - Добавить в таблицу группу ограничений
//
// Параметры:
//  ТаблицаОграниченийПоГруппам	 - 	 - 
//  ГруппаСкидкиНаценки			 - 	 - 
//
Процедура ДобавитьВТаблицуГруппуОграничений(ТаблицаОграниченийПоГруппам, Знач ГруппаСкидкиНаценки)
	
	Если ТаблицаОграниченийПоГруппам.Найти(ГруппаСкидкиНаценки, "СкидкаНаценка") = Неопределено Тогда 
		НоваяСтрокаТаблицы 										= ТаблицаОграниченийПоГруппам.Добавить();
		НоваяСтрокаТаблицы.СкидкаНаценка 						= ГруппаСкидкиНаценки;
		НоваяСтрокаТаблицы.ВариантыСовместногоПрименения 		= ГруппаСкидкиНаценки.ВариантСовместногоПримененияСкидокНаценок;
		НоваяСтрокаТаблицы.МаксимальноеЗначениеСкидкиНаценки	= ГруппаСкидкиНаценки.ЗначениеСкидкиНаценки;
	КонецЕсли;

КонецПроцедуры

// Процедура - Применить ограничение скидки наценки
//
// Параметры:
//  СкидкаНаценка				 - 	 - 
//  ТаблицаОграниченийПоГруппам	 - 	 - 
//  СтрокаСкидкиДерева			 - 	 - 
//
Процедура ПрименитьОграничениеСкидкиНаценки(Знач СкидкаНаценка, ТаблицаОграниченийПоГруппам, СтрокаСкидкиДерева, СтруктураПараметров)
	
	СтрокаРодитель = Неопределено;
	
	Если ЗначениеЗаполнено(ТаблицаОграниченийПоГруппам) Тогда  
		СтрокаРодитель = ТаблицаОграниченийПоГруппам.Найти(СкидкаНаценка.Родитель, "СкидкаНаценка");		
	КонецЕсли;
	
	Если СтрокаРодитель = Неопределено Тогда 
		Возврат;
	Иначе
		Если СтруктураПараметров <> Неопределено И СтруктураПараметров.Свойство("МассивНеиспользуемыхСкидок") Тогда 
			МассивНеиспользуемыхСкидок = СтруктураПараметров.МассивНеиспользуемыхСкидок;
		Иначе 
			МассивНеиспользуемыхСкидок = Новый Массив;
		КонецЕсли;
		
		Если СтрокаРодитель.МаксимальноеЗначениеСкидкиНаценки = 0 
			И НЕ (СтрокаРодитель.ВариантыСовместногоПрименения = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Максимум
			ИЛИ СтрокаРодитель.ВариантыСовместногоПрименения = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Минимум) Тогда 
			
			ПрименитьОграничениеСкидкиНаценки(СтрокаРодитель.СкидкаНаценка, ТаблицаОграниченийПоГруппам, СтрокаСкидкиДерева, СтруктураПараметров);
		Иначе
			ОбследоватьДеревоВыше = Истина;
			Если СтрокаСкидкиДерева.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент Тогда 
				ЗначениеСкидкиНаценкиПроцент = СтрокаСкидкиДерева.ЗначениеСкидкиНаценки;
			Иначе 
				ЗначениеСкидкиНаценкиПроцент = СтрокаСкидкиДерева.СуммаСкидки / (?(СтрокаСкидкиДерева.Сумма = 0, 1, СтрокаСкидкиДерева.Сумма) / 100);
				// ЗначениеСкидкиНаценкиПроцент = ?(Цел(ЗначениеСкидкиНаценкиПроцент) <> ЗначениеСкидкиНаценкиПроцент, Цел(ЗначениеСкидкиНаценкиПроцент) + 1, ЗначениеСкидкиНаценкиПроцент);
				// Разрядность = 2;
				// РежимОкругленияЧисла = РежимОкругления.Окр15как20;
				// ЗначениеСкидкиНаценкиПроцент = ?(НЕ (Окр(ЗначениеСкидкиНаценкиПроцент, Разрядность) = ЗначениеСкидкиНаценкиПроцент),?(ЗначениеСкидкиНаценкиПроцент < 0, (Окр(ЗначениеСкидкиНаценкиПроцент-(0.5/pow(10, Разрядность)) , Разрядность, РежимОкругленияЧисла)),(Окр(ЗначениеСкидкиНаценкиПроцент+(0.5/pow(10, Разрядность)), Разрядность, РежимОкругленияЧисла))), ЗначениеСкидкиНаценкиПроцент);
			КонецЕсли;
			
			// ВАРИАНТ ГРУППОВОГО ПРИМЕНЕНИЯ: МАКСИМУМ
			Если СтрокаРодитель.ВариантыСовместногоПрименения = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Максимум Тогда 
				Если ЗначениеСкидкиНаценкиПроцент > СтрокаРодитель.МаксимальноеЗначениеСкидкиНаценки И СтрокаРодитель.МаксимальноеЗначениеСкидкиНаценки <> 0 Тогда 
					УстановитьЗначениеДерева(СтрокаСкидкиДерева, "Использовать", Ложь, Ложь);
					ОбследоватьДеревоВыше = Ложь;
				Иначе
					Если МассивНеиспользуемыхСкидок.Найти(СтрокаСкидкиДерева.СкидкаНаценка) = Неопределено Тогда
						// Определим максимальная ли это скидка в группе
						МаксимальнаяСкидка 							= СтрокаСкидкиДерева.СкидкаНаценка;
						ЗначениеМаксимальнойСкидкиНаценкиПроцент 	= ЗначениеСкидкиНаценкиПроцент;
						Для Каждого СтрокаТаблицыСкидок Из СтруктураПараметров.ТаблицаСкидок Цикл
							Если ЗначениеЗаполнено(СтрокаТаблицыСкидок.СкидкаНаценка) Тогда
								Если ТаблицаОграниченийПоГруппам.НайтиСтроки(Новый Структура("СкидкаНаценка", СтрокаТаблицыСкидок.СкидкаНаценка.Родитель)).Количество() = 0 И СтрокаТаблицыСкидок.СкидкаНаценка.Родитель.ВариантСовместногоПримененияСкидокНаценок = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Максимум И СтрокаТаблицыСкидок.СкидкаНаценка.Родитель.Родитель = СтрокаРодитель.СкидкаНаценка Тогда 
									ОбследоватьДеревоВыше = Ложь;
								КонецЕсли;	
								Если СтрокаТаблицыСкидок.СкидкаНаценка = СтрокаСкидкиДерева.СкидкаНаценка ИЛИ СтрокаТаблицыСкидок.СкидкаНаценка.Родитель <> СтрокаСкидкиДерева.СкидкаНаценка.Родитель ИЛИ СтрокаТаблицыСкидок.СкидкаНаценка.ЭтоГруппа Тогда 
									Продолжить;
								Иначе
									Если СтрокаТаблицыСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент Тогда 
										ЗначениеСкидкиНаценкиПроцент2 = СтрокаТаблицыСкидок.ЗначениеСкидкиНаценки;
									Иначе 
										ЗначениеСкидкиНаценкиПроцент2 = СтрокаТаблицыСкидок.СуммаСкидки / (?(СтрокаТаблицыСкидок.Сумма = 0, 1, СтрокаТаблицыСкидок.Сумма) / 100);
									КонецЕсли;	
									Если ЗначениеСкидкиНаценкиПроцент2 > ЗначениеМаксимальнойСкидкиНаценкиПроцент Тогда 
										МаксимальнаяСкидка 							= СтрокаТаблицыСкидок.СкидкаНаценка;
										ЗначениеМаксимальнойСкидкиНаценкиПроцент 	= ЗначениеСкидкиНаценкиПроцент2;
									КонецЕсли;	
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
						Для Каждого СтрокаТаблицыОграниченийПоГруппам Из ТаблицаОграниченийПоГруппам Цикл 
							Если СтрокаТаблицыОграниченийПоГруппам.СкидкаНаценка.Родитель = СтрокаРодитель.СкидкаНаценка И СтрокаТаблицыОграниченийПоГруппам.ВариантыСовместногоПрименения = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Максимум Тогда 
								Если СтрокаТаблицыОграниченийПоГруппам.НакапливаемоеЗначениеСкидкиНаценки >= ЗначениеМаксимальнойСкидкиНаценкиПроцент Тогда 
									МаксимальнаяСкидка 							= СтрокаТаблицыОграниченийПоГруппам.ОптимальнаяСкидкаНаценка;
									ЗначениеМаксимальнойСкидкиНаценкиПроцент 	= СтрокаТаблицыОграниченийПоГруппам.НакапливаемоеЗначениеСкидкиНаценки;
								КонецЕсли;	
							КонецЕсли;	
						КонецЦикла;
						
						СтрокаРодитель.ОптимальнаяСкидкаНаценка 				= МаксимальнаяСкидка;
						СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки 		= ЗначениеМаксимальнойСкидкиНаценкиПроцент; // Макс(СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки, ЗначениеСкидкиНаценкиПроцент);
						Если МаксимальнаяСкидка <> СтрокаСкидкиДерева.СкидкаНаценка Тогда 
							ОбследоватьДеревоВыше = Ложь;
						КонецЕсли;
					Иначе 
						ОбследоватьДеревоВыше = Ложь;
					КонецЕсли;	
				КонецЕсли;
				
			// ВАРИАНТ ГРУППОВОГО ПРИМЕНЕНИЯ: МИНИМУМ				
			ИначеЕсли СтрокаРодитель.ВариантыСовместногоПрименения = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Минимум Тогда
				Если ЗначениеСкидкиНаценкиПроцент > СтрокаРодитель.МаксимальноеЗначениеСкидкиНаценки И СтрокаРодитель.МаксимальноеЗначениеСкидкиНаценки <> 0 Тогда 
					УстановитьЗначениеДерева(СтрокаСкидкиДерева, "Использовать", Ложь, Ложь);					
					ОбследоватьДеревоВыше = Ложь;
				Иначе
					Если МассивНеиспользуемыхСкидок.Найти(СтрокаСкидкиДерева.СкидкаНаценка) = Неопределено Тогда 					
						// Определим минимальная ли это скидка в группе
						МинимальнаяСкидка 							= СтрокаСкидкиДерева.СкидкаНаценка;
						ЗначениеМинимальнойСкидкиНаценкиПроцент 	= ЗначениеСкидкиНаценкиПроцент;
						Для Каждого СтрокаТаблицыСкидок Из СтруктураПараметров.ТаблицаСкидок Цикл 
							Если ЗначениеЗаполнено(СтрокаТаблицыСкидок.СкидкаНаценка) Тогда
								Если ТаблицаОграниченийПоГруппам.НайтиСтроки(Новый Структура("СкидкаНаценка", СтрокаТаблицыСкидок.СкидкаНаценка.Родитель)).Количество() = 0 И СтрокаТаблицыСкидок.СкидкаНаценка.Родитель.ВариантСовместногоПримененияСкидокНаценок = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Максимум И СтрокаТаблицыСкидок.СкидкаНаценка.Родитель.Родитель = СтрокаРодитель.СкидкаНаценка Тогда 
									ОбследоватьДеревоВыше = Ложь;
								КонецЕсли;								
								Если СтрокаТаблицыСкидок.СкидкаНаценка = СтрокаСкидкиДерева.СкидкаНаценка ИЛИ СтрокаТаблицыСкидок.СкидкаНаценка.ЭтоГруппа Тогда 
									Продолжить;
								Иначе
									Если СтрокаТаблицыСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент Тогда 
										ЗначениеСкидкиНаценкиПроцент2 = СтрокаТаблицыСкидок.ЗначениеСкидкиНаценки;
									Иначе 
										ЗначениеСкидкиНаценкиПроцент2 = СтрокаТаблицыСкидок.СуммаСкидки / (?(СтрокаТаблицыСкидок.Сумма = 0, 1, СтрокаТаблицыСкидок.Сумма) / 100);
									КонецЕсли;	
									Если ЗначениеСкидкиНаценкиПроцент2 < ЗначениеМинимальнойСкидкиНаценкиПроцент Тогда 
										МинимальнаяСкидка 							= СтрокаТаблицыСкидок.СкидкаНаценка;
										ЗначениеМинимальнойСкидкиНаценкиПроцент 	= ЗначениеСкидкиНаценкиПроцент2;
									КонецЕсли;	
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
						Для Каждого СтрокаТаблицыОграниченийПоГруппам Из ТаблицаОграниченийПоГруппам Цикл 
							Если СтрокаТаблицыОграниченийПоГруппам.СкидкаНаценка.Родитель = СтрокаРодитель.СкидкаНаценка И СтрокаТаблицыОграниченийПоГруппам.ВариантыСовместногоПрименения = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Минимум Тогда 
								Если СтрокаТаблицыОграниченийПоГруппам.НакапливаемоеЗначениеСкидкиНаценки <= ЗначениеМаксимальнойСкидкиНаценкиПроцент Тогда 
									МинимальнаяСкидка 							= СтрокаТаблицыОграниченийПоГруппам.ОптимальнаяСкидкаНаценка;
									ЗначениеМинимальнойСкидкиНаценкиПроцент 	= СтрокаТаблицыОграниченийПоГруппам.НакапливаемоеЗначениеСкидкиНаценки;
								КонецЕсли;	
							КонецЕсли;	
						КонецЦикла;
						
						СтрокаРодитель.ОптимальнаяСкидкаНаценка 				= МинимальнаяСкидка;						
						СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки 		= ЗначениеМинимальнойСкидкиНаценкиПроцент; // Мин(СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки, ЗначениеСкидкиНаценкиПроцент);
						Если МинимальнаяСкидка <> СтрокаСкидкиДерева.СкидкаНаценка Тогда 
							ОбследоватьДеревоВыше = Ложь;
						КонецЕсли;
					Иначе 
						ОбследоватьДеревоВыше = Ложь;
					КонецЕсли;	
				КонецЕсли;
				
			// ВАРИАНТ ГРУППОВОГО ПРИМЕНЕНИЯ: СЛОЖЕНИЕ								
			ИначеЕсли СтрокаРодитель.ВариантыСовместногоПрименения = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Сложение Тогда	
				Если ЗначениеСкидкиНаценкиПроцент > СтрокаРодитель.МаксимальноеЗначениеСкидкиНаценки И СтрокаРодитель.МаксимальноеЗначениеСкидкиНаценки <> 0 Тогда
					УстановитьЗначениеДерева(СтрокаСкидкиДерева, "Использовать", Ложь, Ложь);					
					ОбследоватьДеревоВыше = Ложь;
				ИначеЕсли ЗначениеСкидкиНаценкиПроцент + СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки > СтрокаРодитель.МаксимальноеЗначениеСкидкиНаценки И СтрокаРодитель.МаксимальноеЗначениеСкидкиНаценки <> 0 Тогда
					Если СтрокаСкидкиДерева.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент Тогда 
						СтрокаСкидкиДерева.ЗначениеСкидкиНаценки = ЗначениеСкидкиНаценкиПроцент - (ЗначениеСкидкиНаценкиПроцент + СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки - СтрокаРодитель.МаксимальноеЗначениеСкидкиНаценки);
						СтрокаСкидкиДерева.ЗначениеСкидкиНаценки = ?(СтрокаСкидкиДерева.ЗначениеСкидкиНаценки < 0, 0, СтрокаСкидкиДерева.ЗначениеСкидкиНаценки);
						СтрокаСкидкиДерева.СуммаСкидки 			 = ?(СтрокаСкидкиДерева.Сумма * СтрокаСкидкиДерева.ЗначениеСкидкиНаценки / 100 <> Цел(СтрокаСкидкиДерева.Сумма * СтрокаСкидкиДерева.ЗначениеСкидкиНаценки / 100), Цел(СтрокаСкидкиДерева.Сумма * СтрокаСкидкиДерева.ЗначениеСкидкиНаценки / 100), СтрокаСкидкиДерева.Сумма * СтрокаСкидкиДерева.ЗначениеСкидкиНаценки / 100);
						СтрокаСкидкиДерева.ЗначениеСкидкиНаценки = СтрокаСкидкиДерева.СуммаСкидки / ?(СтрокаСкидкиДерева.Сумма / 100 <> 0, СтрокаСкидкиДерева.Сумма / 100, 1);
						
						Если СтрокаСкидкиДерева.ЗначениеСкидкиНаценки = 0 Тогда 
							УстановитьЗначениеДерева(СтрокаСкидкиДерева, "Использовать", Ложь, Ложь);
							ОбследоватьДеревоВыше = Ложь;
						Иначе
							Если МассивНеиспользуемыхСкидок.Найти(СтрокаСкидкиДерева.СкидкаНаценка) = Неопределено Тогда 
								СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки 	= СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки + СтрокаСкидкиДерева.ЗначениеСкидкиНаценки;
							КонецЕсли;	
						КонецЕсли;
						
					Иначе 
						ЗначениеСкидкиНаценкиПроцент 							= ЗначениеСкидкиНаценкиПроцент - (ЗначениеСкидкиНаценкиПроцент + СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки - СтрокаРодитель.МаксимальноеЗначениеСкидкиНаценки);
						СтрокаСкидкиДерева.СуммаСкидки 							= ЗначениеСкидкиНаценкиПроцент * СтрокаСкидкиДерева.Сумма / 100;
						СтрокаСкидкиДерева.СуммаСкидки 							= ?(СтрокаСкидкиДерева.СуммаСкидки < 0, 0, СтрокаСкидкиДерева.СуммаСкидки);						
						Если СтрокаСкидкиДерева.СуммаСкидки = 0 Тогда 
							УстановитьЗначениеДерева(СтрокаСкидкиДерева, "Использовать", Ложь, Ложь);
							ОбследоватьДеревоВыше = Ложь;
						Иначе
							Если МассивНеиспользуемыхСкидок.Найти(СтрокаСкидкиДерева.СкидкаНаценка) = Неопределено Тогда 
								СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки 	= СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки + ЗначениеСкидкиНаценкиПроцент;
							КонецЕсли;	
						КонецЕсли;						
					КонецЕсли;
				Иначе
					Если МассивНеиспользуемыхСкидок.Найти(СтрокаСкидкиДерева.СкидкаНаценка) = Неопределено Тогда 					
						СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки 		= СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки + ЗначениеСкидкиНаценкиПроцент;
					КонецЕсли;	
				КонецЕсли;
				
			// ВАРИАНТ ГРУППОВОГО ПРИМЕНЕНИЯ: УМНОЖЕНИЕ								
			ИначеЕсли СтрокаРодитель.ВариантыСовместногоПрименения = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Умножение Тогда	
				Если ЗначениеСкидкиНаценкиПроцент > СтрокаРодитель.МаксимальноеЗначениеСкидкиНаценки И СтрокаРодитель.МаксимальноеЗначениеСкидкиНаценки <> 0 Тогда
					УстановитьЗначениеДерева(СтрокаСкидкиДерева, "Использовать", Ложь, Ложь);					
					ОбследоватьДеревоВыше = Ложь;
				ИначеЕсли ЗначениеСкидкиНаценкиПроцент * СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки > СтрокаРодитель.МаксимальноеЗначениеСкидкиНаценки И СтрокаРодитель.МаксимальноеЗначениеСкидкиНаценки <> 0 Тогда 
					Если СтрокаСкидкиДерева.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент Тогда 					
						СтрокаСкидкиДерева.ЗначениеСкидкиНаценки 				= ЗначениеСкидкиНаценкиПроцент - (ЗначениеСкидкиНаценкиПроцент * СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки - СтрокаРодитель.МаксимальноеЗначениеСкидкиНаценки);
						СтрокаСкидкиДерева.ЗначениеСкидкиНаценки 				= ?(СтрокаСкидкиДерева.ЗначениеСкидкиНаценки < 0, 0, СтрокаСкидкиДерева.ЗначениеСкидкиНаценки);
						Если СтрокаСкидкиДерева.ЗначениеСкидкиНаценки = 0 Тогда 
							УстановитьЗначениеДерева(СтрокаСкидкиДерева, "Использовать", Ложь, Ложь);
							ОбследоватьДеревоВыше = Ложь;
						Иначе
							Если МассивНеиспользуемыхСкидок.Найти(СтрокаСкидкиДерева.СкидкаНаценка) = Неопределено Тогда 						
								СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки 	= СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки * СтрокаСкидкиДерева.ЗначениеСкидкиНаценки;
							КонецЕсли;	
						КонецЕсли;
					Иначе 
						ЗначениеСкидкиНаценкиПроцент 							= ЗначениеСкидкиНаценкиПроцент - (ЗначениеСкидкиНаценкиПроцент * СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки - СтрокаРодитель.МаксимальноеЗначениеСкидкиНаценки);
						СтрокаСкидкиДерева.СуммаСкидки 							= ЗначениеСкидкиНаценкиПроцент * СтрокаСкидкиДерева.Сумма / 100;
						СтрокаСкидкиДерева.СуммаСкидки 							= ?(СтрокаСкидкиДерева.СуммаСкидки < 0, 0, СтрокаСкидкиДерева.СуммаСкидки);						
						Если СтрокаСкидкиДерева.СуммаСкидки = 0 Тогда 
							УстановитьЗначениеДерева(СтрокаСкидкиДерева, "Использовать", Ложь, Ложь);
							ОбследоватьДеревоВыше = Ложь;
						Иначе
							Если МассивНеиспользуемыхСкидок.Найти(СтрокаСкидкиДерева.СкидкаНаценка) = Неопределено Тогда 
								СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки 	= СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки * ЗначениеСкидкиНаценкиПроцент;
							КонецЕсли;	
						КонецЕсли;						
					КонецЕсли;
				Иначе
					Если МассивНеиспользуемыхСкидок.Найти(СтрокаСкидкиДерева.СкидкаНаценка) = Неопределено Тогда 					
						СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки 		= СтрокаРодитель.НакапливаемоеЗначениеСкидкиНаценки * ЗначениеСкидкиНаценкиПроцент;
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			Если ОбследоватьДеревоВыше Тогда 
				ПрименитьОграничениеСкидкиНаценки(СтрокаРодитель.СкидкаНаценка, ТаблицаОграниченийПоГруппам, СтрокаСкидкиДерева, СтруктураПараметров);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Функция проверяет наличие бонусов не начисляемых при наличии скидок.
//
Функция ЕстьБонусыНеНачисляемыеПриНаличииСкидки(ТаблицаСкидок)
	
	Для Каждого СтрокаТЗ Из ТаблицаСкидок Цикл
		Если ЗначениеЗаполнено(СтрокаТЗ.СкидкаНаценка)
			И НЕ СтрокаТЗ.СкидкаНаценка.ЭтоГруппа
			И СтрокаТЗ.СкидкаНаценка.НачислениеБонусами
			И СтрокаТЗ.СкидкаНаценка.НеНачислятьБонусПриНаличииСкидки Тогда
			
			Возврат Истина;
		КонецЕсли;		
	КонецЦикла;
	
	Возврат Ложь;  	
		
КонецФункции

// Предварительно применяем скидку в строках ТЧ номенклатуры.
//
Процедура ПредварительноПрименитьСкидкиВТаблицеТоваров(
	ТаблицаСкидокВременная,
	ТаблицаЗапасы, 
	ТаблицаЛечение,
	ТаблицаУслуги,
	ТаблицаПредыдщееСостояниеСкидок)
	
	Если ТаблицаЗапасы <> Неопределено Тогда
		// Применяем скидку в строках ТЧ номенклатуры
		Для Каждого СтрокаТЧ Из ТаблицаЗапасы Цикл
			
			СтрокаТЧ.ПроцентСкидкиНаценки				= 0;
			СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки	= 0;
			
			// Скидки
			ТаблицаСкидокВременнаяПоСтроке = ТаблицаСкидокВременная.НайтиСтроки(Новый Структура("КлючСтроки, ПризнакОплатыБонусом, НачислениеБонусами, Использовать", СтрокаТЧ.КлючСтроки, Ложь, Ложь, Истина));
			Для каждого СтрокаТЗСкидок Из ТаблицаСкидокВременнаяПоСтроке Цикл
				СтрокаТЧ.ПроцентСкидкиНаценки				= 0;
				СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки	= 0;
				
				Если СтрокаТЗСкидок.СкидкаНаценка.ПризнакИспользованиеНаУсмотрение = Истина Тогда // Значит могут быть выклчены или не вклчены
					
					Если ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() > 0 // Эта скидка была раньше, значит берем ее состояние, если использование = ложь, пропускаем
						И ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, Использование, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, Ложь, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() > 0
						
						ИЛИ ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() = 0
						И СтрокаТЗСкидок.СкидкаНаценка.ПризнакИспользованиеВыклПоУмолчанию = Истина Тогда // Ранее не использовалась, 
						
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
				Если (СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Сумма
					ИЛИ СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.СуммаНаДокумент
					ИЛИ СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент) Тогда
					
					СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки = СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки + СтрокаТЗСкидок.СуммаСкидки;
					
				ИначеЕсли СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.ВидЦен Тогда
					СтрокаТЧ.Цена	= СтрокаТЗСкидок.Цена;
					СтрокаТЧ.Сумма	= СтрокаТЗСкидок.Сумма;
					СтрокаТЧ.ВидЦен = СтрокаТЗСкидок.ЗначениеСкидкиНаценкиОбъектом;				
				КонецЕсли; 
				
			КонецЦикла;
			
			// Оплата бонусами
			ТаблицаСкидокВременнаяПоСтроке = ТаблицаСкидокВременная.НайтиСтроки(Новый Структура("КлючСтроки, ПризнакОплатыБонусом, Использовать", СтрокаТЧ.КлючСтроки, Истина, Истина));
			Для каждого СтрокаТЗСкидок Из ТаблицаСкидокВременнаяПоСтроке Цикл
				СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки = СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки + СтрокаТЗСкидок.СуммаСкидки;
			КонецЦикла;
			
		КонецЦикла;	
	КонецЕсли;
	
	Если ТаблицаЛечение <> Неопределено Тогда
		// Применяем скидку в строках ТЧ номенклатуры
		Для Каждого СтрокаТЧ Из ТаблицаЛечение Цикл
			
			СтрокаТЧ.ПроцентСкидкиНаценки				= 0;
			СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки	= 0;
			
			// Скидки
			ТаблицаСкидокВременнаяПоСтроке = ТаблицаСкидокВременная.НайтиСтроки(Новый Структура("КлючСтроки, ПризнакОплатыБонусом, НачислениеБонусами, Использовать", СтрокаТЧ.КлючСтроки, Ложь, Ложь, Истина));
			Для каждого СтрокаТЗСкидок Из ТаблицаСкидокВременнаяПоСтроке Цикл
				СтрокаТЧ.ПроцентСкидкиНаценки				= 0;
				СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки	= 0;
				
				Если СтрокаТЗСкидок.СкидкаНаценка.ПризнакИспользованиеНаУсмотрение = Истина Тогда // Значит могут быть выклчены или не вклчены
					
					Если ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() > 0 // Эта скидка была раньше, значит берем ее состояние, если использование = ложь, пропускаем
						И ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, Использование, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, Ложь, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() > 0
						
						ИЛИ ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() = 0
						И СтрокаТЗСкидок.СкидкаНаценка.ПризнакИспользованиеВыклПоУмолчанию = Истина Тогда // Ранее не использовалась, 
						
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
				Если (СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Сумма
					ИЛИ СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.СуммаНаДокумент
					ИЛИ СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент) Тогда
					
					СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки = СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки + СтрокаТЗСкидок.СуммаСкидки;
					
				ИначеЕсли СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.ВидЦен Тогда
					СтрокаТЧ.Цена	= СтрокаТЗСкидок.Цена;
					СтрокаТЧ.Сумма	= СтрокаТЗСкидок.Сумма;
					СтрокаТЧ.ВидЦен = СтрокаТЗСкидок.ЗначениеСкидкиНаценкиОбъектом;				
				КонецЕсли; 
				
			КонецЦикла;
			
			// Оплата бонусами
			ТаблицаСкидокВременнаяПоСтроке = ТаблицаСкидокВременная.НайтиСтроки(Новый Структура("КлючСтроки, ПризнакОплатыБонусом, Использовать", СтрокаТЧ.КлючСтроки, Истина, Истина));
			Для каждого СтрокаТЗСкидок Из ТаблицаСкидокВременнаяПоСтроке Цикл
				СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки = СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки + СтрокаТЗСкидок.СуммаСкидки;
			КонецЦикла;
			
		КонецЦикла;	
	КонецЕсли;
	
	Если ТаблицаУслуги <> Неопределено Тогда
		// Применяем скидку в строках ТЧ номенклатуры
		Для Каждого СтрокаТЧ Из ТаблицаУслуги Цикл
			
			СтрокаТЧ.ПроцентСкидкиНаценки				= 0;
			СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки	= 0;
			
			// Скидки
			ТаблицаСкидокВременнаяПоСтроке = ТаблицаСкидокВременная.НайтиСтроки(Новый Структура("КлючСтроки, ПризнакОплатыБонусом, НачислениеБонусами, Использовать", СтрокаТЧ.КлючСтроки, Ложь, Ложь, Истина));
			Для каждого СтрокаТЗСкидок Из ТаблицаСкидокВременнаяПоСтроке Цикл
				СтрокаТЧ.ПроцентСкидкиНаценки				= 0;
				СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки	= 0;
				
				Если СтрокаТЗСкидок.СкидкаНаценка.ПризнакИспользованиеНаУсмотрение = Истина Тогда // Значит могут быть выклчены или не вклчены
					
					Если ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() > 0 // Эта скидка была раньше, значит берем ее состояние, если использование = ложь, пропускаем
						И ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, Использование, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, Ложь, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() > 0
						
						ИЛИ ТаблицаПредыдщееСостояниеСкидок.НайтиСтроки(Новый Структура("КлючСтроки, СкидкаНаценка, Номенклатура", СтрокаТЗСкидок.КлючСтроки, СтрокаТЗСкидок.СкидкаНаценка, СтрокаТЗСкидок.Номенклатура)).Количество() = 0
						И СтрокаТЗСкидок.СкидкаНаценка.ПризнакИспользованиеВыклПоУмолчанию = Истина Тогда // Ранее не использовалась, 
						
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
				Если (СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Сумма
					ИЛИ СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.СуммаНаДокумент
					ИЛИ СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент) Тогда
					
					СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки = СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки + СтрокаТЗСкидок.СуммаСкидки;
					
				ИначеЕсли СтрокаТЗСкидок.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.ВидЦен Тогда
					СтрокаТЧ.Цена	= СтрокаТЗСкидок.Цена;
					СтрокаТЧ.Сумма	= СтрокаТЗСкидок.Сумма;
					СтрокаТЧ.ВидЦен = СтрокаТЗСкидок.ЗначениеСкидкиНаценкиОбъектом;				
				КонецЕсли; 
				
			КонецЦикла;
			
			// Оплата бонусами
			ТаблицаСкидокВременнаяПоСтроке = ТаблицаСкидокВременная.НайтиСтроки(Новый Структура("КлючСтроки, ПризнакОплатыБонусом, Использовать", СтрокаТЧ.КлючСтроки, Истина, Истина));
			Для каждого СтрокаТЗСкидок Из ТаблицаСкидокВременнаяПоСтроке Цикл
				СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки = СтрокаТЧ.СуммаАвтоматическойСкидкиНаценки + СтрокаТЗСкидок.СуммаСкидки;
			КонецЦикла;
			
		КонецЦикла;	
	КонецЕсли;

КонецПроцедуры

// Процедура удаляет бонусы, не начисляемые при наличии скидок.
//
Функция ПолучитьМассивБонусовНеНачисляемыхПриНаличииСкидки(ТаблицаСкидок, ТабличнаяЧастьНоменклатурыЗапасы, ТабличнаяЧастьНоменклатурыЛечение)
	
	МассивУдаляемыхСтрок = Новый Массив;
	
	Если ЗначениеЗаполнено(ТабличнаяЧастьНоменклатурыЗапасы) Тогда	
		ТабличнаяЧастьНоменклатура = ТабличнаяЧастьНоменклатурыЗапасы;
	ИначеЕсли  ЗначениеЗаполнено(ТабличнаяЧастьНоменклатурыЛечение) Тогда
		ТабличнаяЧастьНоменклатура = ТабличнаяЧастьНоменклатурыЛечение;
	Иначе
		Возврат МассивУдаляемыхСтрок;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ТаблицаСкидок Цикл
		
		Если ЗначениеЗаполнено(СтрокаТЧ.СкидкаНаценка) 
			И НЕ СтрокаТЧ.СкидкаНаценка.ЭтоГруппа
			И СтрокаТЧ.СкидкаНаценка.НачислениеБонусами  
			И СтрокаТЧ.СкидкаНаценка.НеНачислятьБонусПриНаличииСкидки Тогда
			
			НайденныеСтроки = ТабличнаяЧастьНоменклатура.НайтиСтроки(Новый Структура("КлючСтроки", СтрокаТЧ.КлючСтроки));
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				СуммаОплатыБонусами = 0;
				МассивСтрокОплатыБонусами = ТаблицаСкидок.НайтиСтроки(Новый Структура("ПризнакОплатыБонусом, КлючСтроки", Истина, СтрокаТЧ.КлючСтроки));
				Для Каждого ЭлементМ Из МассивСтрокОплатыБонусами Цикл
					СуммаОплатыБонусами = СуммаОплатыБонусами + ЭлементМ.Сумма; 
				КонецЦикла;
				
				// Разделяем оплату бонусами и ручную скидку.
				Если НайденнаяСтрока.СуммаРучнойСкидки > 0 ИЛИ НайденнаяСтрока.СуммаАвтоматическойСкидкиНаценки > СуммаОплатыБонусами Тогда
					МассивУдаляемыхСтрок.Добавить(СтрокаТЧ.СкидкаНаценка);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат МассивУдаляемыхСтрок;
	
КонецФункции     

// Процедура - Пересчитать сумму начисление бонусами
//
// Параметры:
//  ТаблицаСкидок		 - 	 - 
//  ТабличнаяЧастьТовары - 	 - 
//
Процедура ПересчитатьСуммуНачислениеБонусами(
	ТаблицаСкидок, 
	ТабличнаяЧастьЗапасы,
	ТабличнаяЧастьЛечение,
	ТабличнаяЧастьУслуги,
	ДокументОбъект)
	
	Для Каждого СтрокаТЧ Из ТаблицаСкидок Цикл
		
		Если СтрокаТЧ.НачислениеБонусами = Истина Тогда    			
			
			Если ТабличнаяЧастьЗапасы <> Неопределено Тогда
				ЭтоНарядЗаказ = ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.НарядЗаказ");
				НайденныеСтроки = ТабличнаяЧастьЗапасы.НайтиСтроки(Новый Структура("КлючСтроки", СтрокаТЧ.КлючСтроки)); 				
				Если НайденныеСтроки.Количество() <> 0 Тогда
					НайденнаяСтрока = НайденныеСтроки[0];        
					Если СтрокаТЧ.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент Тогда
						СтрокаТЧ.СуммаСкидки = (?(ЭтоНарядЗаказ, НайденнаяСтрока.СуммаПродажи, НайденнаяСтрока.Сумма)
												- НайденнаяСтрока.СуммаРучнойСкидки
												- НайденнаяСтрока.СуммаАвтоматическойСкидкиНаценки) * СтрокаТЧ.ЗначениеСкидкиНаценки / 100;
												
						СтрокаТЧ.СуммаСкидки = ?(СтрокаТЧ.СуммаСкидки < 0, 0, СтрокаТЧ.СуммаСкидки);
					ИначеЕсли СтрокаТЧ.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Сумма Тогда
						СтрокаТЧ.СуммаСкидки = СтрокаТЧ.ЗначениеСкидкиНаценки;					
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ТабличнаяЧастьЛечение <> Неопределено Тогда
				НайденныеСтроки = ТабличнаяЧастьЛечение.НайтиСтроки(Новый Структура("КлючСтроки", СтрокаТЧ.КлючСтроки)); 				
				Если НайденныеСтроки.Количество() <> 0 Тогда
					НайденнаяСтрока = НайденныеСтроки[0];        
					Если СтрокаТЧ.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент Тогда
						СтрокаТЧ.СуммаСкидки = (НайденнаяСтрока.Сумма - НайденнаяСтрока.СуммаРучнойСкидки - НайденнаяСтрока.СуммаАвтоматическойСкидкиНаценки) * СтрокаТЧ.ЗначениеСкидкиНаценки / 100;
						СтрокаТЧ.СуммаСкидки = ?(СтрокаТЧ.СуммаСкидки < 0, 0, СтрокаТЧ.СуммаСкидки);
					ИначеЕсли СтрокаТЧ.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Сумма Тогда
						СтрокаТЧ.СуммаСкидки = СтрокаТЧ.ЗначениеСкидкиНаценки;					
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ТабличнаяЧастьУслуги <> Неопределено Тогда
				НайденныеСтроки = ТабличнаяЧастьУслуги.НайтиСтроки(Новый Структура("КлючСтроки", СтрокаТЧ.КлючСтроки)); 				
				Если НайденныеСтроки.Количество() <> 0 Тогда
					НайденнаяСтрока = НайденныеСтроки[0];        
					Если СтрокаТЧ.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент Тогда
						СтрокаТЧ.СуммаСкидки = (НайденнаяСтрока.Сумма - НайденнаяСтрока.СуммаРучнойСкидки - НайденнаяСтрока.СуммаАвтоматическойСкидкиНаценки) * СтрокаТЧ.ЗначениеСкидкиНаценки / 100;
						СтрокаТЧ.СуммаСкидки = ?(СтрокаТЧ.СуммаСкидки < 0, 0, СтрокаТЧ.СуммаСкидки);
					ИначеЕсли СтрокаТЧ.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Сумма Тогда
						СтрокаТЧ.СуммаСкидки = СтрокаТЧ.ЗначениеСкидкиНаценки;					
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;   
			
		КонецЕсли;	
	
    КонецЦикла;

КонецПроцедуры

// Функция, возвращает таблицу возможных оплат бонусами.
//
Функция ЗапросПоОплатеБонусами(
	ДокументОбъект, 
	Знач ТабличнаяЧастьЗапасы,
	Знач ТабличнаяЧастьЛечение,
	Знач ТабличнаяЧастьУслуги,
	Знач ТабличнаяЧастьСкидкиНаценки, 
	СтруктураПараметров = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТабличнаяЧастьЗапасы <> Неопределено Тогда
		ТабличнаяЧастьЗапасы.Колонки.Добавить("КлючСтрокиСтрокой", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
		Для Каждого СтрокаТЗ Из ТабличнаяЧастьЗапасы Цикл
			СтрокаТЗ.КлючСтрокиСтрокой = Строка(СтрокаТЗ.КлючСтроки);
		КонецЦикла;
	КонецЕсли;
	Если ТабличнаяЧастьЛечение <> Неопределено Тогда
		ТабличнаяЧастьЛечение.Колонки.Добавить("КлючСтрокиСтрокой", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
		Для Каждого СтрокаТЗ Из ТабличнаяЧастьЛечение Цикл
			СтрокаТЗ.КлючСтрокиСтрокой = Строка(СтрокаТЗ.КлючСтроки);
		КонецЦикла;
	КонецЕсли;
	Если ТабличнаяЧастьУслуги <> Неопределено Тогда
		ТабличнаяЧастьУслуги.Колонки.Добавить("КлючСтрокиСтрокой", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
		Для Каждого СтрокаТЗ Из ТабличнаяЧастьУслуги Цикл
			СтрокаТЗ.КлючСтрокиСтрокой = Строка(СтрокаТЗ.КлючСтроки);
		КонецЦикла;
	КонецЕсли;   
	
	Если ТабличнаяЧастьСкидкиНаценки.Колонки.Найти("КлючСтрокиСтрокой") = Неопределено Тогда
		ТабличнаяЧастьСкидкиНаценки.Колонки.Добавить("КлючСтрокиСтрокой", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	КонецЕсли;
	Для Каждого СтрокаТЗ Из ТабличнаяЧастьСкидкиНаценки Цикл
		СтрокаТЗ.КлючСтрокиСтрокой = Строка(СтрокаТЗ.КлючСтроки);
	КонецЦикла;
	
	Если СтруктураПараметров <> Неопределено Тогда
		Дата 		   = СтруктураПараметров.Дата;
		ДокументСсылка = СтруктураПараметров.ДокументСсылка;
	Иначе
		Дата 		   = ?(ДокументОбъект.Ссылка.Пустая() = Истина, ТекущаяДатаСеанса(), ДокументОбъект.Дата);
		ДокументСсылка = ДокументОбъект.Ссылка;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если ТабличнаяЧастьЗапасы  <> Неопределено Тогда Запрос.УстановитьПараметр("ТаблицаЗапасы"	, ТабличнаяЧастьЗапасы)  КонецЕсли;
	Если ТабличнаяЧастьЛечение <> Неопределено Тогда Запрос.УстановитьПараметр("ТаблицаЛечения" , ТабличнаяЧастьЛечение) КонецЕсли;
	Если ТабличнаяЧастьУслуги  <> Неопределено Тогда Запрос.УстановитьПараметр("ТаблицаУслуг"	, ТабличнаяЧастьУслуги)  КонецЕсли;

	ЕстьКолонкаКоличествоУпаковокТЧЛечение = Ложь;
	Если ТабличнаяЧастьЛечение <> Неопределено Тогда 
		Если ДокументОбъект.Ссылка.Метаданные().ТабличныеЧасти.Найти("Лечение") <> Неопределено Тогда
			ЕстьКолонкаКоличествоУпаковокТЧЛечение = ДокументОбъект.Ссылка.Метаданные().ТабличныеЧасти.Лечение.Реквизиты.Найти("КоличествоУпаковок") <> Неопределено;
		КонецЕсли;
	КонецЕсли;
		
	СтрокаОбъединение = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|";	
	
	СтрокаРазделение = "
	|
	|;
	|///////////////////////////////////////////
	|";   	
	
	СтрокаПоместить = "	
	|ПОМЕСТИТЬ ТаблицаТовары
	|";	 
	
	МассивТекст = Новый Массив;
	
	// добавляем во временные таблицы. 	
	Если ТабличнаяЧастьЗапасы <> Неопределено Тогда
		Текст = 	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЗапасы.КлючСтрокиСтрокой КАК КлючСтрокиСтрокой,
		|	ТаблицаЗапасы.НомерСтроки КАК НомерСтроки,
		|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
		|	ТаблицаЗапасы.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТаблицаЗапасы.Упаковка КАК Упаковка,
		|	ТаблицаЗапасы.Количество КАК Количество,
		|	ТаблицаЗапасы.ВидЦен КАК ВидЦен,
		|	ТаблицаЗапасы.Цена КАК Цена,
		|	ТаблицаЗапасы.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	ТаблицаЗапасы.Сумма КАК Сумма				
		|ПОМЕСТИТЬ ТаблицаЗапасы
		|ИЗ
		|	&ТаблицаЗапасы КАК ТаблицаЗапасы";	
		
		МассивТекст.Добавить(Текст);
	КонецЕсли;
	
	Если ТабличнаяЧастьЛечение <> Неопределено Тогда
		
		Если ТабличнаяЧастьЗапасы <> Неопределено Тогда
			МассивТекст.Добавить(СтрокаРазделение);
		КонецЕсли;             		
		
		Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЛечения.КлючСтрокиСтрокой КАК КлючСтрокиСтрокой,
		|	ТаблицаЛечения.НомерСтроки КАК НомерСтроки,
		|	ТаблицаЛечения.Номенклатура КАК Номенклатура,"
		+ ?(ЕстьКолонкаКоличествоУпаковокТЧЛечение = Истина, 
			" ТаблицаЛечения.КоличествоУпаковок КАК КоличествоУпаковок,", 
			" ТаблицаЛечения.Количество КАК КоличествоУпаковок,")	
		+ "
		|	ТаблицаЛечения.Упаковка КАК Упаковка,
		|	ТаблицаЛечения.Количество КАК Количество,
		|	ТаблицаЛечения.ВидЦен КАК ВидЦен,
		|	ТаблицаЛечения.Цена КАК Цена,
		|	ТаблицаЛечения.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	ТаблицаЛечения.Сумма КАК Сумма
		|ПОМЕСТИТЬ ТаблицаЛечения
		|ИЗ
		|	&ТаблицаЛечения КАК ТаблицаЛечения";
		
		МассивТекст.Добавить(Текст); 
	КонецЕсли;
	
	Если ТабличнаяЧастьУслуги <> Неопределено Тогда
		
		Если ТабличнаяЧастьЗапасы <> Неопределено 
			Или ТабличнаяЧастьЛечение <> Неопределено Тогда
			
			МассивТекст.Добавить(СтрокаРазделение);
		КонецЕсли;     
		
		Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаУслуг.КлючСтрокиСтрокой КАК КлючСтрокиСтрокой,
		|	ТаблицаУслуг.НомерСтроки КАК НомерСтроки,
		|	ТаблицаУслуг.Номенклатура КАК Номенклатура,
		|	ТаблицаУслуг.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТаблицаУслуг.Упаковка КАК Упаковка,
		|	ТаблицаУслуг.Количество КАК Количество,
		|	ТаблицаУслуг.ВидЦен КАК ВидЦен,
		|	ТаблицаУслуг.Цена КАК Цена,
		|	ТаблицаУслуг.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	ТаблицаУслуг.Сумма КАК Сумма
		|ПОМЕСТИТЬ ТаблицаУслуг
		|ИЗ
		|	&ТаблицаУслуг КАК ТаблицаУслуг";
		
		МассивТекст.Добавить(Текст); 
	КонецЕсли;   
	
	// формируем запрос "объединение".
	МассивТекст.Добавить(СтрокаРазделение);
	Если ТабличнаяЧастьЗапасы <> Неопределено Тогда
		Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЗапасы.КлючСтрокиСтрокой КАК КлючСтрокиСтрокой,
		|	ТаблицаЗапасы.НомерСтроки КАК НомерСтроки,
		|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
		|	ТаблицаЗапасы.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТаблицаЗапасы.Упаковка КАК Упаковка,
		|	ТаблицаЗапасы.Количество КАК Количество,
		|	ТаблицаЗапасы.ВидЦен КАК ВидЦен,
		|	ТаблицаЗапасы.Цена КАК Цена,
		|	ТаблицаЗапасы.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	ТаблицаЗапасы.Сумма КАК Сумма		
		|ПОМЕСТИТЬ ТаблицаТовары
		|ИЗ
		|	ТаблицаЗапасы КАК ТаблицаЗапасы";
		
		МассивТекст.Добавить(Текст);
	КонецЕсли;
	   	
	Если ТабличнаяЧастьЛечение <> Неопределено Тогда
		
		Если ТабличнаяЧастьЗапасы <> Неопределено Тогда
			МассивТекст.Добавить(СтрокаОбъединение);
		КонецЕсли;  
		
		Текст =
		"ВЫБРАТЬ " + ?(ТабличнаяЧастьЗапасы = Неопределено, "РАЗРЕШЕННЫЕ", "") + " 
		|	ТаблицаЛечения.КлючСтрокиСтрокой КАК КлючСтрокиСтрокой,
		|	ТаблицаЛечения.НомерСтроки КАК НомерСтроки,
		|	ТаблицаЛечения.Номенклатура КАК Номенклатура,
		|	ТаблицаЛечения.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТаблицаЛечения.Упаковка КАК Упаковка,
		|	ТаблицаЛечения.Количество КАК Количество,
		|	ТаблицаЛечения.ВидЦен КАК ВидЦен,
		|	ТаблицаЛечения.Цена КАК Цена,
		|	ТаблицаЛечения.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	ТаблицаЛечения.Сумма КАК Сумма"
		+ ?(ТабличнаяЧастьЗапасы = Неопределено, СтрокаПоместить, "")	
		+ "
		|ИЗ
		|	ТаблицаЛечения КАК ТаблицаЛечения";
		
		МассивТекст.Добавить(Текст); 
	КонецЕсли;
	
	Если ТабличнаяЧастьУслуги <> Неопределено Тогда
		
		Если ТабличнаяЧастьЗапасы <> Неопределено 
			Или ТабличнаяЧастьЛечение <> Неопределено Тогда
			МассивТекст.Добавить(СтрокаОбъединение);
		КонецЕсли;  
		
		Текст =
		"ВЫБРАТЬ " + ?(ТабличнаяЧастьЗапасы = Неопределено и ТабличнаяЧастьЛечение = Неопределено, "РАЗРЕШЕННЫЕ", "") + " 
		|	ТаблицаУслуг.КлючСтрокиСтрокой КАК КлючСтрокиСтрокой,
		|	ТаблицаУслуг.НомерСтроки КАК НомерСтроки,
		|	ТаблицаУслуг.Номенклатура КАК Номенклатура,
		|	ТаблицаУслуг.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТаблицаУслуг.Упаковка КАК Упаковка,
		|	ТаблицаУслуг.Количество КАК Количество,
		|	ТаблицаУслуг.ВидЦен КАК ВидЦен,
		|	ТаблицаУслуг.Цена КАК Цена,
		|	ТаблицаУслуг.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	ТаблицаУслуг.Сумма КАК Сумма"   
		+ ?(ТабличнаяЧастьЗапасы = Неопределено И ТабличнаяЧастьЛечение = Неопределено, СтрокаПоместить, "")	
		+ "
		|ИЗ
		|	ТаблицаУслуг КАК ТаблицаУслуг";
		
		МассивТекст.Добавить(Текст); 
	КонецЕсли;   	
	
	ТекстЗапроса = СтрСоединить(МассивТекст, Символы.ПС);	
	
	Запрос.Текст = ТекстЗапроса + СтрокаРазделение +
	// "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ТаблицаТовары.КлючСтрокиСтрокой КАК КлючСтрокиСтрокой,
	//|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	//|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	//|	ТаблицаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	//|	ТаблицаТовары.Упаковка КАК Упаковка,
	//|	ТаблицаТовары.Количество КАК Количество,
	//|	ТаблицаТовары.ВидЦен КАК ВидЦен,
	//|	ТаблицаТовары.Цена КАК Цена,
	//|	ТаблицаТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	//|	ТаблицаТовары.Сумма КАК Сумма
	//|ПОМЕСТИТЬ ТаблицаТовары
	//|ИЗ
	//|	&ТаблицаТовары КАК ТаблицаТовары
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаСкидкиНаценки.КлючСтрокиСтрокой КАК КлючСтрокиСтрокой,
	|	ТаблицаСкидкиНаценки.НомерСтроки КАК НомерСтроки,
	|	ТаблицаСкидкиНаценки.СкидкаНаценка КАК СкидкаНаценка,
	|	ТаблицаСкидкиНаценки.ПризнакОплатыБонусом КАК ПризнакОплатыБонусом,
	|	ТаблицаСкидкиНаценки.Сумма КАК Сумма
	|ПОМЕСТИТЬ ТаблицаСкидкиНаценки
	|ИЗ
	|	&ТаблицаСкидкиНаценки КАК ТаблицаСкидкиНаценки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Получатель КАК Получатель
	|ПОМЕСТИТЬ ТаблицаВладельцевБонусногоСчета
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&КартаКонтрагента
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РодственныеСвязи.Родственник
	|ИЗ
	|	РегистрСведений.РодственныеСвязи КАК РодственныеСвязи
	|ГДЕ
	|	РодственныеСвязи.Контрагент = &Получатель
	|	И РодственныеСвязи.ОбщийБонусныйСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Получатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БонусныеСчетаОстатки.БонусныйСчет КАК БонусныйСчет,
	|	БонусныеСчетаОстатки.БонусныйСчет.НеОграниченПроцентомСписания КАК НеОграниченПроцентомСписания,
	|	БонусныеСчетаОстатки.БонусныйСчет.ОграничениеСписанияПроцент КАК ОграничениеСписанияПроцент,
	|	СУММА(БонусныеСчетаОстатки.СуммаОборот) КАК СуммаОстаток
	|ПОМЕСТИТЬ ТаблицаБонусныеСчетаОстатки
	|ИЗ
	|	РегистрНакопления.БонусныеСчета.ОстаткиИОбороты(
	|			,
	|			&Дата,
	|			Авто,
	|			,
	|			БонусныйСчет.ВладелецБонусногоСчета В
	|				(ВЫБРАТЬ
	|					ТаблицаВладельцевБонусногоСчета.Получатель
	|				ИЗ
	|					ТаблицаВладельцевБонусногоСчета)) КАК БонусныеСчетаОстатки
	|ГДЕ
	|	БонусныеСчетаОстатки.Регистратор <> &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	БонусныеСчетаОстатки.БонусныйСчет,
	|	БонусныеСчетаОстатки.БонусныйСчет.НеОграниченПроцентомСписания,
	|	БонусныеСчетаОстатки.БонусныйСчет.ОграничениеСписанияПроцент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БонусныеСчетаТоварыОстатки.НомерСтроки КАК НомерСтроки,
	|	БонусныеСчетаТоварыОстатки.КлючСтрокиСтрокой КАК КлючСтрокиСтрокой,
	|	БонусныеСчетаТоварыОстатки.НоменклатураСкидки КАК НоменклатураСкидки,
	|	БонусныеСчетаТоварыОстатки.КоличествоУпаковок КАК КоличествоУпаковок,
	|	БонусныеСчетаТоварыОстатки.Упаковка КАК Упаковка,
	|	БонусныеСчетаТоварыОстатки.Количество КАК Количество,
	|	БонусныеСчетаТоварыОстатки.ВидЦен КАК ВидЦен,
	|	БонусныеСчетаТоварыОстатки.Цена КАК Цена,
	|	БонусныеСчетаТоварыОстатки.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА БонусныеСчетаТоварыОстатки.СуммаДляРасчетаБонусов < 0
	|			ТОГДА 0
	|		ИНАЧЕ БонусныеСчетаТоварыОстатки.СуммаДляРасчетаБонусов
	|	КОНЕЦ КАК СуммаДляРасчетаБонусов,
	|	БонусныеСчетаТоварыОстатки.БонусныйСчет КАК БонусныйСчет,
	|	БонусныеСчетаТоварыОстатки.НеОграниченПроцентомСписания КАК НеОграниченПроцентомСписания,
	|	БонусныеСчетаТоварыОстатки.ОграничениеСписанияПроцент КАК ОграничениеСписанияПроцент,
	|	БонусныеСчетаТоварыОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ВЫБОР
	|		КОГДА БонусныеСчетаТоварыОстатки.СуммаОстаток <= БонусныеСчетаТоварыОстатки.МаксимальнаяСуммаОплаты
	|			ТОГДА БонусныеСчетаТоварыОстатки.СуммаОстаток
	|		ИНАЧЕ ЕСТЬNULL(БонусныеСчетаТоварыОстатки.МаксимальнаяСуммаОплаты, 0)
	|	КОНЕЦ КАК МаксимальнаяСуммаОплаты
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|		ТаблицаТовары.КлючСтрокиСтрокой КАК КлючСтрокиСтрокой,
	|		ТаблицаТовары.Номенклатура КАК НоменклатураСкидки,
	|		ТаблицаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|		ТаблицаТовары.Упаковка КАК Упаковка,
	|		ТаблицаТовары.Количество КАК Количество,
	|		ТаблицаТовары.ВидЦен КАК ВидЦен,
	|		ТаблицаТовары.Цена КАК Цена,
	|		ТаблицаТовары.Сумма КАК Сумма,
	|		ТаблицаТовары.КоличествоУпаковок * ТаблицаТовары.Цена - ЕСТЬNULL(ТаблицаСкидкиНаценки.СуммаСкидки, 0) - ТаблицаТовары.СуммаРучнойСкидки КАК СуммаДляРасчетаБонусов,
	|		БонусныеСчетаОстатки.БонусныйСчет КАК БонусныйСчет,
	|		БонусныеСчетаОстатки.БонусныйСчет.НеОграниченПроцентомСписания КАК НеОграниченПроцентомСписания,
	|		БонусныеСчетаОстатки.БонусныйСчет.ОграничениеСписанияПроцент КАК ОграничениеСписанияПроцент,
	|		БонусныеСчетаОстатки.СуммаОстаток КАК СуммаОстаток,
	|		ВЫБОР
	|			КОГДА ТаблицаТовары.КоличествоУпаковок * ТаблицаТовары.Цена - ЕСТЬNULL(ТаблицаСкидкиНаценки.СуммаСкидки, 0) - ЕСТЬNULL(ТаблицаТовары.СуммаРучнойСкидки, 0) < 0
	|				ТОГДА 0
	|			ИНАЧЕ ТаблицаТовары.КоличествоУпаковок * ТаблицаТовары.Цена - ЕСТЬNULL(ТаблицаСкидкиНаценки.СуммаСкидки, 0) - ЕСТЬNULL(ТаблицаТовары.СуммаРучнойСкидки, 0)
	|		КОНЕЦ * ВЫБОР
	|			КОГДА БонусныеСчетаОстатки.БонусныйСчет.ВидБонусногоСчета.НеОграниченПроцентомСписания = ИСТИНА
	|				ТОГДА 1
	|			ИНАЧЕ БонусныеСчетаОстатки.БонусныйСчет.ВидБонусногоСчета.ОграничениеСписанияПроцент / 100
	|		КОНЕЦ КАК МаксимальнаяСуммаОплаты
	|	ИЗ
	|		ТаблицаТовары КАК ТаблицаТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ТаблицаСкидкиНаценки.КлючСтрокиСтрокой КАК КлючСтрокиСтрокой,
	|				СУММА(ТаблицаСкидкиНаценки.Сумма) КАК СуммаСкидки
	|			ИЗ
	|				ТаблицаСкидкиНаценки КАК ТаблицаСкидкиНаценки
	|			ГДЕ
	|				ТаблицаСкидкиНаценки.ПризнакОплатыБонусом = ЛОЖЬ
	|				И ВЫРАЗИТЬ(ТаблицаСкидкиНаценки.СкидкаНаценка КАК Справочник.СкидкиНаценки).СпособПредоставленияСкидки <> ЗНАЧЕНИЕ(Перечисление.СпособПредоставленияСкидки.ВидЦен)
	|				И ВЫРАЗИТЬ(ТаблицаСкидкиНаценки.СкидкаНаценка КАК Справочник.СкидкиНаценки).НачислениеБонусами = ЛОЖЬ
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ТаблицаСкидкиНаценки.КлючСтрокиСтрокой) КАК ТаблицаСкидкиНаценки
	|			ПО (ТаблицаСкидкиНаценки.КлючСтрокиСтрокой = ТаблицаТовары.КлючСтрокиСтрокой)
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаБонусныеСчетаОстатки КАК БонусныеСчетаОстатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыБонусныхСчетов.ПакетУслугСоставУслуг КАК ОграничениеПоУслугамСегментамБонусныеСчета
	|				ПО (ОграничениеПоУслугамСегментамБонусныеСчета.Ссылка = БонусныеСчетаОстатки.БонусныйСчет.ВидБонусногоСчета)
	|			ПО (БонусныеСчетаОстатки.СуммаОстаток >= 0)
	|				И (ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(ОграничениеПоУслугамСегментамБонусныеСчета.УслугаСегмент) = ТИП(Справочник.Номенклатура)
	|						ТОГДА ТаблицаТовары.Номенклатура = ОграничениеПоУслугамСегментамБонусныеСчета.УслугаСегмент
	|					КОГДА ТИПЗНАЧЕНИЯ(ОграничениеПоУслугамСегментамБонусныеСчета.УслугаСегмент) = ТИП(Справочник.СегментыНоменклатуры)
	|						ТОГДА (ТаблицаТовары.Номенклатура, ОграничениеПоУслугамСегментамБонусныеСчета.УслугаСегмент) В
	|								(ВЫБРАТЬ
	|									СоставСегментов.Номенклатура,
	|									СоставСегментов.Сегмент
	|								ИЗ
	|									РегистрСведений.НоменклатураСегмента КАК СоставСегментов)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ)
	|				И (ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(ОграничениеПоУслугамСегментамБонусныеСчета.ВидЦены) = ТИП(Справочник.ВидыЦен)
	|							И ОграничениеПоУслугамСегментамБонусныеСчета.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|						ТОГДА ТаблицаТовары.ВидЦен = ОграничениеПоУслугамСегментамБонусныеСчета.ВидЦены
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ)) КАК БонусныеСчетаТоварыОстатки";
	
	Запрос.УстановитьПараметр("Дата"				, Дата);
	Запрос.УстановитьПараметр("ДокументСсылка"		, ДокументСсылка);
	Запрос.УстановитьПараметр("Получатель"			, ДокументОбъект.Контрагент);
	Запрос.УстановитьПараметр("КартаКонтрагента"	, ДокументОбъект.КартаКонтрагента);
	Запрос.УстановитьПараметр("ТаблицаТовары"		, ТабличнаяЧастьЗапасы);
	Запрос.УстановитьПараметр("ТаблицаСкидкиНаценки", ТабличнаяЧастьСкидкиНаценки.Скопировать(Новый Структура("Контрагент", ДокументОбъект.Контрагент)));
		
	ТаблицаОплатаБонусами = Запрос.Выполнить().Выгрузить();
	
	ТаблицаОплатаБонусами.Колонки.Добавить("КлючСтроки", Новый ОписаниеТипов("УникальныйИдентификатор"));
	Для Каждого СтрокаТЗ Из ТаблицаОплатаБонусами Цикл
		// НайденнаяСтрока = ТабличнаяЧастьЗапасы.Найти(СтрокаТЗ.НомерСтроки, "НомерСтроки"); 
		НайденнаяСтрока = Неопределено;
		Если ТабличнаяЧастьЗапасы <> Неопределено Тогда
			НайденнаяСтрока = ТабличнаяЧастьЗапасы.Найти(СтрокаТЗ.КлючСтрокиСтрокой, "КлючСтрокиСтрокой"); 
		КонецЕсли;
		Если НайденнаяСтрока = Неопределено И ТабличнаяЧастьЛечение <> Неопределено Тогда
			НайденнаяСтрока = ТабличнаяЧастьЛечение.Найти(СтрокаТЗ.КлючСтрокиСтрокой, "КлючСтрокиСтрокой"); 	
		КонецЕсли;
		Если НайденнаяСтрока = Неопределено И ТабличнаяЧастьУслуги <> Неопределено Тогда
			НайденнаяСтрока = ТабличнаяЧастьУслуги.Найти(СтрокаТЗ.КлючСтрокиСтрокой, "КлючСтрокиСтрокой"); 	
		КонецЕсли;     

		Если НайденнаяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;       		
		СтрокаТЗ.КлючСтроки = Новый УникальныйИдентификатор(НайденнаяСтрока.КлючСтрокиСтрокой);
		Если ЗначениеЗаполнено(СтрокаТЗ.ВидЦен) Тогда
			ПараметрыОкругления					= ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(СтрокаТЗ.ВидЦен, 
														"ПорядокОкругления, ОкруглятьВБольшуюСторону");
			СтрокаТЗ.МаксимальнаяСуммаОплаты	= ОбщегоНазначенияКлиентСерверСтоматология.ОкруглитьЦену(
														СтрокаТЗ.МаксимальнаяСуммаОплаты, 
														ПараметрыОкругления.ПорядокОкругления, 
														ПараметрыОкругления.ОкруглятьВБольшуюСторону);
		КонецЕсли;
	КонецЦикла; 
	
	Возврат ТаблицаОплатаБонусами;
	
КонецФункции

// Заполняет таблицу подарки по скидкам
//
// Параметры:
//  ТаблицаСкидок - Таблица значений скидки подарки
//  ТаблицаТоваров - Таблица значений, в которую выгружена таблица товаров из документа
//  ТабличнаяЧастьСкидки       - табличная часть скидок,
//  ТабличнаяЧастьПодарки - табличная часть "Подарки" документа.
//  СтруктурнаяЕдиница - СтруктурнаяЕдиница, в котором рассчитываем скидки
//
Процедура РасчитатьПрименитьОплатуБонусами(ТаблицаСкидок, ТаблицаВозможнаяОплатаТоваровБонусами, ТаблицаОплатыБонусами)

	Если ТаблицаСкидок.Колонки.Найти("КлючСтрокиСтрокой") = Неопределено Тогда
		ТаблицаСкидок.Колонки.Добавить("КлючСтрокиСтрокой", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(50)));
	КонецЕсли;
		
	Для Каждого СтрокаОплатыБонусом Из ТаблицаОплатыБонусами Цикл
		
		// Надо в случае нескольких бонусных счетов, для учета оплаты другими бонусными счетами.
		ТаблицаПримененныхБонусныхСчетов = ТаблицаСкидок.Скопировать(Новый Структура("ПризнакОплатыБонусом, Использовать", Истина, Истина));
		СуммаОплаченнаяБонуснымиСчетами  = ТаблицаПримененныхБонусныхСчетов.Итог("СуммаСкидки");
		
		// в ТаблицаВозможнаяОплатаТоваровБонусами отнимаем бонусы примененные ранее.
		Если СуммаОплаченнаяБонуснымиСчетами > 0 Тогда
			Для Каждого СтрокаТЗ Из ТаблицаВозможнаяОплатаТоваровБонусами.НайтиСтроки(Новый Структура("БонусныйСчет", СтрокаОплатыБонусом.БонусныйСчет)) Цикл
				МассивСтрокПримененныхБонусныхСчетов = ТаблицаПримененныхБонусныхСчетов.НайтиСтроки(Новый Структура("КлючСтрокиСтрокой, ПризнакОплатыБонусом, Использовать", СтрокаТЗ.КлючСтрокиСтрокой, Истина, Истина));
				Для Каждого СтрокаМ Из МассивСтрокПримененныхБонусныхСчетов Цикл
					 СтрокаТЗ.СуммаДляРасчетаБонусов = СтрокаТЗ.СуммаДляРасчетаБонусов - СтрокаМ.СуммаСкидки;					
				КонецЦикла;			
			КонецЦикла;
		КонецЕсли; 
		
		ОплатаТоваровПоБонусномуСчету = ТаблицаВозможнаяОплатаТоваровБонусами.НайтиСтроки(Новый Структура("БонусныйСчет", СтрокаОплатыБонусом.БонусныйСчет));
		
		СуммаВсегоТоваровПоБонусномуСчету = 0;
		СуммаРаспределенная				  = 0;
		Для Каждого СтрокаРаспределенияБонусовПоТоварам Из ОплатаТоваровПоБонусномуСчету Цикл
			СуммаВсегоТоваровПоБонусномуСчету = СуммаВсегоТоваровПоБонусномуСчету + СтрокаРаспределенияБонусовПоТоварам.СуммаДляРасчетаБонусов;
		КонецЦикла;
		
		СуммаВсегоТоваровПоБонусномуСчету = СуммаВсегоТоваровПоБонусномуСчету;
			
		Если СуммаВсегоТоваровПоБонусномуСчету > 0 Тогда
			Для Каждого СтрокаРаспределенияБонусовПоТоварам Из ОплатаТоваровПоБонусномуСчету Цикл
				
				СуммаОплаты = СтрокаОплатыБонусом.Сумма * СтрокаРаспределенияБонусовПоТоварам.СуммаДляРасчетаБонусов / СуммаВсегоТоваровПоБонусномуСчету;				
				
				СуммаОплаты = ОбщегоНазначенияКлиентСерверСтоматология.ОкруглитьЦену(СуммаОплаты, СтрокаРаспределенияБонусовПоТоварам.ВидЦен.ПорядокОкругления, СтрокаРаспределенияБонусовПоТоварам.ВидЦен.ОкруглятьВБольшуюСторону);
				    				
				// устраняем погрешности округления.
				Если СтрокаРаспределенияБонусовПоТоварам = ОплатаТоваровПоБонусномуСчету[ОплатаТоваровПоБонусномуСчету.Количество()-1] 
						И (СуммаРаспределенная + СуммаОплаты) <> СтрокаОплатыБонусом.Сумма Тогда
						
					ПогрешностьРаспределения	= СтрокаОплатыБонусом.Сумма - (СуммаРаспределенная + СуммаОплаты);
					СуммаОплаты					= СуммаОплаты + ПогрешностьРаспределения; 
				КонецЕсли;
			
				Если СуммаОплаты > 0 Тогда
					НоваяСтрока = ТаблицаСкидок.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспределенияБонусовПоТоварам);
					НоваяСтрока.Номенклатура			= СтрокаРаспределенияБонусовПоТоварам.НоменклатураСкидки;
					НоваяСтрока.НачислениеБонусами		= Ложь;
					НоваяСтрока.ПризнакОплатыБонусом	= Истина;
					НоваяСтрока.Использовать			= Истина;
					НоваяСтрока.СуммаСкидки				= СуммаОплаты;
				
					СуммаРаспределенная					= СуммаРаспределенная + СуммаОплаты;
					СтрокаОплатыБонусом.СуммаОстаток	= СтрокаОплатыБонусом.СуммаОстаток - СуммаОплаты;
					
					НоваяСтрока.КлючСтрокиСтрокой		= Строка(НоваяСтрока.КлючСтроки);
				КонецЕсли;
			
			КонецЦикла;
		КонецЕсли;
			
	КонецЦикла;	
	
	ТаблицаСкидок.Колонки.Удалить("КлючСтрокиСтрокой");
	
КонецПроцедуры
                
// Функция рассчиттывает значение скидки по строке
//
// Параметры:
//  СтрокаСкидки - Строка информации о скидке
//  СтрокаТоваров - Строка табличной части Товары
//  СтруктурнаяЕдиница - СтруктурнаяЕдиница в котором рассчитывается скидка
//  ДатаДокумента - Дата документа необходима для расчета скидки по цене
//  СуммаБезСкидки - Число, сумма от которой рассчитавается скидка;
//
// Возвращаемое значение:
//  Скидка - сумма скидки
//
Функция РассчитатьЗначениеСкидки(СтрокаСкидки, СтрокаТоваров, СтруктурнаяЕдиница, ДатаДокумента, СуммаБезСкидки)

	Скидка = 0;
	Если СтрокаСкидки.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент Тогда
		Скидка = СуммаБезСкидки * СтрокаСкидки.ЗначениеСкидкиНаценки/100;
	ИначеЕсли СтрокаСкидки.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Сумма Тогда
		Скидка = Мин(СуммаБезСкидки,СтрокаСкидки.ЗначениеСкидкиНаценки);
	КонецЕсли;
	               
	Возврат Скидка;

КонецФункции // РассчитатьЗначениеСкидки()

// Рекурсивно обходит дерево и рассчитывает скидки
//
// Параметры:
//  СтрокиДерева  - Массив скидок, по которым выполнилось условие
//  ВариантСовместногоПримененияСкидокНаценок - Вариант совместного применения
//  Корень - Булево. Признак верхнего уровня
//  СтрокаТоваров - Строка таблицы значений с данными из документа
//  СтруктурнаяЕдиница - СтруктурнаяЕдиница в котором рассчитывается скидка
//  ДатаДокумента - Дата документа необходима для расчета скидки по цене
//
// Возвращаемое значение:
//  Сумма скидки
//
Функция ПолучитьРассчитатьСкидкиВДереве(СтрокиДерева, ВариантСовместногоПримененияСкидокНаценок, Корень, СтрокаТоваров, СтруктурнаяЕдиница, ДатаДокумента)
	
	Скидка = 0;
	
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		Если СтрокаДерева.ЭтоГруппа Тогда
			СтрокаДерева.Значение = ПолучитьРассчитатьСкидкиВДереве(СтрокаДерева.Строки, СтрокаДерева.ВариантСовместногоПримененияСкидокНаценок, Ложь, СтрокаТоваров, СтруктурнаяЕдиница, ДатаДокумента)
		Иначе
			Если ВариантСовместногоПримененияСкидокНаценок = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Умножение 
				И СтрокаДерева.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент Тогда
				СтрокаДерева.Значение = 0;
			Иначе
				СтрокаДерева.Значение = РассчитатьЗначениеСкидки(СтрокаДерева, СтрокаТоваров, СтруктурнаяЕдиница, ДатаДокумента, 
							?(СтрокаДерева.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Сумма, СтрокаДерева.ЗначениеСкидкиНаценки, СтрокаТоваров.СуммаБезСкидки));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ВариантСовместногоПримененияСкидокНаценок = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Минимум Тогда
		СтрокиДерева.Сортировать("ЗначениеСкидкиНаценкиОбщаяСумма Возр, Значение Возр");
		Скидка = СтрокиДерева[0].Значение;
		СтрокиДерева[0].Использование = Истина;
	ИначеЕсли ВариантСовместногоПримененияСкидокНаценок = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Максимум Тогда
		СтрокиДерева.Сортировать("ЗначениеСкидкиНаценкиОбщаяСумма Убыв, Значение Убыв");
		Скидка = СтрокиДерева[0].Значение;
		СтрокиДерева[0].Использование = Истина; 
	ИначеЕсли ВариантСовместногоПримененияСкидокНаценок = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Сложение Тогда
		Скидка = СтрокиДерева.Итог("Значение");
		Для каждого СтрокаДерева Из СтрокиДерева Цикл
			СтрокаДерева.Использование = Истина;
		КонецЦикла;
	ИначеЕсли ВариантСовместногоПримененияСкидокНаценок = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Умножение Тогда
		СтрокиДерева.Сортировать("ПорядокПрименения Возр");
		ИндексСтроки = 0;
		Для каждого СтрокаДерева Из СтрокиДерева Цикл
			Если СтрокаДерева.ЭтоГруппа Тогда
				Скидка = Скидка + СтрокаДерева.Значение;
			ИначеЕсли СтрокаДерева.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент Тогда
				СтрокаДерева.Значение = РассчитатьЗначениеСкидки(СтрокаДерева, СтрокаТоваров, СтруктурнаяЕдиница, ДатаДокумента, СтрокаТоваров.СуммаБезСкидки-Скидка);
				Скидка = Скидка + СтрокаДерева.Значение;
			ИначеЕсли СтрокаДерева.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Сумма Тогда
				Скидка = Скидка + СтрокаДерева.Значение;
			КонецЕсли;
			СтрокаДерева.Использование = Истина;
			ИндексСтроки = ИндексСтроки + 1;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Скидка;
	
КонецФункции // ПолучитьРассчитатьСкидкиВДереве()

// Заполняет таблицу, примененных скидок по дереву значений
//
// Параметры:
//  СтрокиДерева  - Массив скидок, по которым выполнилось условие
//  ТаблицаПримененныхСкидок - таблица, в которую помещаем примененные скидки
//
Процедура ЗаполнитьТаблицуПримененныхСкидок(СтрокиДерева, ТаблицаПримененныхСкидок, ТолькоПримененные = Истина)
	
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		Если ТолькоПримененные = Ложь ИЛИ СтрокаДерева.Использование = Истина Тогда
			Если СтрокаДерева.ЭтоГруппа Тогда
				ЗаполнитьТаблицуПримененныхСкидок(СтрокаДерева.Строки, ТаблицаПримененныхСкидок, ТолькоПримененные)
			Иначе
				СтрокаПримененнойСкидки = ТаблицаПримененныхСкидок.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПримененнойСкидки, СтрокаДерева);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПримененныеСкидки()

// Рассчитывает значение сложной скидки
//
// Параметры
//  МассивСкидок  - Массив скидок, по которым выполнилось условие
//  СтрокаТоваров - Строка таблицы значений с данными из документа
//  СтруктурнаяЕдиница - СтруктурнаяЕдиница в котором рассчитывается скидка
//  ДатаДокумента - Дата документа необходима для расчета скидки по цене
//
// Возвращаемое значение:
//  Сумма скидки
//
Функция РассчитатьЗначениеСложнойСкидки(ТаблицаСкидок, СтрокаТоваров, СтруктурнаяЕдиница, ДатаДокумента, ТаблицаПримененныхСкидок, ТаблицаРассчитанныхСкидок = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СкидкиНаценки.Ссылка КАК СкидкаНаценка,
	|	СкидкиНаценки.ВариантСовместногоПримененияСкидокНаценок,
	|	СкидкиНаценки.ПорядокПрименения,
	|	СкидкиНаценки.СпособПредоставленияСкидки,
	|	СкидкиНаценки.ЗначениеСкидкиНаценки,
	|	СкидкиНаценки.НачислениеНаЛицевойСчетУдалить,
	|	СкидкиНаценки.ЭтоГруппа,
	|	СкидкиНаценки.СегментНоменклатуры,
	|	0 КАК Значение,
	|	ЛОЖЬ КАК Использование,
	|	ЛОЖЬ КАК СкидкаНаЕдиныйКомплект,
	|	СкидкиНаценки.СегментБазыРасчетаСкидки,
	|	0 КАК ЗначениеСкидкиНаценкиОбщаяСумма
	|ИЗ
	|	Справочник.СкидкиНаценки КАК СкидкиНаценки
	|ГДЕ
	|	СкидкиНаценки.Ссылка В(&МассивСкидок)
	|ИТОГИ ПО
	|	СкидкаНаценка ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("МассивСкидок", ТаблицаСкидок.ВыгрузитьКолонку("СкидкаНаценка"));
	
	Результат = Запрос.Выполнить();
	ДеревоПримененныхСкидок = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Если Результат.Пустой() Тогда
		Значение = 0
	Иначе
		Значение = ПолучитьРассчитатьСкидкиВДереве(ДеревоПримененныхСкидок.Строки, Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Сложение, Истина, СтрокаТоваров, СтруктурнаяЕдиница, ДатаДокумента);
		Если Значение <> 0 Тогда
			ЗаполнитьТаблицуПримененныхСкидок(ДеревоПримененныхСкидок.Строки, ТаблицаПримененныхСкидок, Истина);
			Если ТаблицаРассчитанныхСкидок <> Неопределено Тогда
				ЗаполнитьТаблицуПримененныхСкидок(ДеревоПримененныхСкидок.Строки, ТаблицаРассчитанныхСкидок, Ложь);
			КонецЕсли;
			Если ТаблицаПримененныхСкидок.Количество() > 0 
				И ТаблицаПримененныхСкидок.Итог("Значение") <> Значение И ТаблицаПримененныхСкидок.Итог("Значение") <> 0 Тогда
				
				НомерМаксимальнойСтроки  = 0;
				МаксимальнаяСумма        = 0;
				
				СуммаТабличнойЧастиДоРаспределения = ТаблицаПримененныхСкидок.Итог("Значение");
				КоэффициентРаспределения = Значение / СуммаТабличнойЧастиДоРаспределения;
				
				Для каждого СтрокаТаблицыДокумента Из ТаблицаПримененныхСкидок Цикл
				
					Если МаксимальнаяСумма < СтрокаТаблицыДокумента.Сумма Тогда
						НомерМаксимальнойСтроки  = СтрокаТаблицыДокумента.НомерСтроки;
						МаксимальнаяСумма        = СтрокаТаблицыДокумента.Значение;
					КонецЕсли;
					
					СтрокаТаблицыДокумента.Значение = СтрокаТаблицыДокумента.Значение * КоэффициентРаспределения;
					
				КонецЦикла;
				
				СуммаТабличнойЧастиПослеРаспределения = ТаблицаПримененныхСкидок.Итог("Значение");
				
				ОшибкаОкругления = Значение - (СуммаТабличнойЧастиДоРаспределения - СуммаТабличнойЧастиПослеРаспределения);
				
				Если Не ОшибкаОкругления = 0 И НомерМаксимальнойСтроки >0 Тогда
					СтрокаТабличнойЧастиНоменклатуры          = ТаблицаПримененныхСкидок[НомерМаксимальнойСтроки - 1];
					СтрокаТабличнойЧастиНоменклатуры.Значение = СтрокаТабличнойЧастиНоменклатуры.Значение - ОшибкаОкругления;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции // РассчитатьЗначениеСложнойСкидки()

// Заполняет данными таблицы, табличнуб часть скидки
//
// Параметры
//  ТаблицаПримененныхСкидок - таблица, в которое находятся данные о примененных скидках
//  ТабличнаяЧастьСкидки       - табличная часть скидок,
//
Процедура ЗаполнитьТабличнуюЧастьСкидкиПоПроценту(ТаблицаПримененныхСкидок, ТабличнаяЧастьСкидки, КлючСтрокиТоваров, НоменклатураСтрокиТоваров)

	пТаблицаПримененныхСкидок = ТаблицаПримененныхСкидок.Скопировать();
	пТаблицаПримененныхСкидок.Колонки.Значение.Имя = "Сумма";
	пТаблицаПримененныхСкидок.Колонки.Добавить("КлючСтроки");
	пТаблицаПримененныхСкидок.ЗаполнитьЗначения(КлючСтрокиТоваров,"КлючСтроки");
	пТаблицаПримененныхСкидок.Колонки.Добавить("НоменклатураСкидки");
	пТаблицаПримененныхСкидок.ЗаполнитьЗначения(НоменклатураСтрокиТоваров,"НоменклатураСкидки");	
	
	ОбщегоНазначенияКлиентСерверСтоматология.ЗагрузитьВТаблицуЗначений(пТаблицаПримененныхСкидок, ТабличнаяЧастьСкидки);
	
КонецПроцедуры // ЗаполнитьТабличнуюЧастьСкидкиПоПроценту()

// Из общей таблицы возвращает таблицу подарков или скидок сумм на чек
//
// Параметры:
//  ТаблицаСкидок - таблица всех скидок
//  СкидкиПодарки - Булево, флга возврата или подарков или сумм на чек
//
// Возвращаемое значение:
//  Таблица значений
//
Функция НайтиВТаблицеПоСтруктуре(Таблица, СтруктураПоиска)

	ТаблицаРезультат	= Таблица.СкопироватьКолонки();
	
	МассивНайденныхСтрок = Таблица.НайтиСтроки(СтруктураПоиска);
	Для каждого ЭлементМассива Из МассивНайденныхСтрок Цикл
		НоваяСтрока = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
	КонецЦикла;
	
	Возврат ТаблицаРезультат;

КонецФункции // ОпределитьТаблицуПодарков()

// Удаляет скидку из таблицы
//
// Параметры
//  ТаблицаСкидок - таблица всех скидок
//  СкидкаНаценка - удаляемая скидка
//  Номенклатура - для скидок по строке удаляется только эта номенклатура
//
Процедура УдалитьСкидкуИзТаблицы(ТаблицаСкидок, СкидкаНаценка, Номенклатура = Неопределено)

	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("СкидкаНаценка", СкидкаНаценка);
	
	Если Не Номенклатура = Неопределено Тогда
		СтруктураПоиска.Вставить("Номенклатура", Номенклатура);
	КонецЕсли;
	
	СтрокиТаблицыСкидок = ТаблицаСкидок.НайтиСтроки(СтруктураПоиска);
	Для каждого СтрокаТаблицыСкидок Из СтрокиТаблицыСкидок Цикл
		ТаблицаСкидок.Удалить(СтрокаТаблицыСкидок);
	КонецЦикла;

КонецПроцедуры // УдалитьСкидкуИзТаблицы()

// Вытесняет строки в таблице скидок
//
// Параметры
//  ТаблицаСкидок - Таблица скидок, применяющихся скидок
//  СтрокиДерева  - Массив скидок, по которым выполнилось условие
//  ВариантСовместногоПримененияСкидокНаценок - Вариант совместного применения
//
Процедура ПрименитьВытеснениеВДереве(ТаблицаСкидок, СтрокиДерева, УдаляемВсеСтроки)
	
	ПерваяСтрока = Истина;
	
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		Если УдаляемВсеСтроки Тогда
			Если СтрокаДерева.ЭтоГруппа Тогда
				ПрименитьВытеснениеВДереве(ТаблицаСкидок, СтрокаДерева.Строки, Истина)
			ИначеЕсли СтрокаДерева.Строки[0].СкидкаНаГруппуСтрок Тогда
				УдалитьСкидкуИзТаблицы(ТаблицаСкидок, СтрокаДерева.СкидкаНаценка)
			Иначе
				// Скидка на строку
				УдалитьСкидкуИзТаблицы(ТаблицаСкидок, СтрокаДерева.СкидкаНаценка, СтрокаДерева.Строки[0].Номенклатура)
			КонецЕсли;
		Иначе
			ПерваяСтрока = Ложь;
			Если СтрокаДерева.ЭтоГруппа Тогда
				ПрименитьВытеснениеВДереве(ТаблицаСкидок, СтрокаДерева.Строки, УдаляемВсеСтроки)
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПрименитьВытеснениеВДереве()

// Вытесняет скидки по правилам пересечения
//
// Параметры
//  ТаблицаСкидок - Таблица скидок, применяющихся скидок
//  ТаблицаНеПрименяемыхПодарков - Таблица подарков не прошедших условия.
//
Процедура ВытеснитьСкидкиНаСегментНоменклатуры(ТаблицаСкидок, ТаблицаНеПрименяемыхПодарков)

	// Удаляем не нужные скидки
	
	Для каждого СтрокаТаблицы Из ТаблицаНеПрименяемыхПодарков Цикл
		УдалитьСкидкуИзТаблицы(ТаблицаСкидок, СтрокаТаблицы.СкидкаНаценка)
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаСкидок.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТаблицаСкидок.СкидкаНаценка КАК Справочник.СкидкиНаценки) КАК СкидкаНаценка,
	|	ТаблицаСкидок.СкидкаСуммойНаЧек,
	|	ТаблицаСкидок.ЭтоПодарок
	|ПОМЕСТИТЬ ТаблицаСкидок
	|ИЗ
	|	&ТаблицаСкидок КАК ТаблицаСкидок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаСкидок.Номенклатура КАК Номенклатура
	|ИЗ
	|	ТаблицаСкидок КАК ТаблицаСкидок";
	
	Запрос.УстановитьПараметр("ТаблицаСкидок", ТаблицаСкидок);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Результат = Запрос.Выполнить();
	ТаблицаНоменклатуры = Результат.Выгрузить();
	Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
	
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаСкидок.Номенклатура КАК Номенклатура,
		|	ТаблицаСкидок.СкидкаНаценка КАК СкидкаНаценка,
		|	ТаблицаСкидок.СкидкаНаценка.ЭтоГруппа КАК ЭтоГруппа,
		|	ВЫБОР
		|		КОГДА ТаблицаСкидок.СкидкаСуммойНаЧек
		|				ИЛИ ТаблицаСкидок.ЭтоПодарок
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СкидкаНаГруппуСтрок,
		|	ТаблицаСкидок.СкидкаНаценка.ВариантСовместногоПримененияСкидокНаценок КАК ВариантСовместногоПримененияСкидокНаценок
		|ИЗ
		|	ТаблицаСкидок КАК ТаблицаСкидок
		|ГДЕ
		|	ТаблицаСкидок.Номенклатура = &Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаСкидок.СкидкаНаценка.ПорядокПрименения
		|ИТОГИ ПО
		|	СкидкаНаценка ИЕРАРХИЯ";
		
		Запрос.УстановитьПараметр("Номенклатура", СтрокаТаблицы.Номенклатура);
		
		Результат = Запрос.Выполнить();
		ДеревоВытеснения = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		ПрименитьВытеснениеВДереве(ТаблицаСкидок, ДеревоВытеснения.Строки, Ложь)
	КонецЦикла;

КонецПроцедуры // ВытеснитьСкидкиНаСегментНоменклатуры()

// Рекурсивно обходит дерево и вытесянет скидки подарки
//
// Параметры:
//  СтрокиДерева  - Массив скидок, по которым выполнилось условие
//  ВариантСовместногоПримененияСкидокНаценок - Вариант совместного применения
//  Таблица скидок - Таблица значений скидки подарки
//
Процедура ПрименитьПравилаВытеснениеСкидокПодарковВДереве(СтрокиДерева, ВариантСовместногоПримененияСкидокНаценок, ТаблицаСкидок)

	Если ТаблицаСкидок.Количество()<= 1 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаВозможныхСкидок = Новый ТаблицаЗначений;
	ТаблицаВозможныхСкидок.Колонки.Добавить("ЭтоГруппа");
	ТаблицаВозможныхСкидок.Колонки.Добавить("СкидкаНаценка");
	ТаблицаВозможныхСкидок.Колонки.Добавить("ПорядокПрименения");
	
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		Если СтрокаДерева.ЭтоГруппа Тогда
			ПрименитьПравилаВытеснениеСкидокПодарковВДереве(СтрокаДерева.Строки, СтрокаДерева.ВариантСовместногоПримененияСкидокНаценок, ТаблицаСкидок);
		КонецЕсли;
		СтрокаТаблицыВозможныхСкидок = ТаблицаВозможныхСкидок.Добавить();
		СтрокаТаблицыВозможныхСкидок.ЭтоГруппа               = СтрокаДерева.ЭтоГруппа;
		СтрокаТаблицыВозможныхСкидок.СкидкаНаценка           = СтрокаДерева.СкидкаНаценка;
		СтрокаТаблицыВозможныхСкидок.ПорядокПрименения       = СтрокаДерева.ПорядокПрименения;
	КонецЦикла;
	
	Если ТаблицаВозможныхСкидок.Количество() > 1 Тогда
		Если ВариантСовместногоПримененияСкидокНаценок = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Минимум
			ИЛИ ВариантСовместногоПримененияСкидокНаценок = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Максимум Тогда
			ТаблицаВозможныхСкидок.Сортировать("ПорядокПрименения Возр");
			
			МассивСкидок = ТаблицаВозможныхСкидок.ВыгрузитьКолонку("СкидкаНаценка");
			МассивСкидок.Удалить(0);
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаСкидок.СкидкаНаценка,
			|	ТаблицаСкидок.УсловиеПредоставленияСкидки,
			|	ТаблицаСкидок.ЗначениеУсловия,
			|	ТаблицаСкидок.СегментНоменклатуры,
			|	ТаблицаСкидок.СкидкаНаЕдиныйКомплект,
			|	ТаблицаСкидок.ОбъектСкидки
			|ПОМЕСТИТЬ ТаблицаСкидок
			|ИЗ
			|	&ТаблицаСкидок КАК ТаблицаСкидок
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаСкидок.СкидкаНаценка,
			|	ТаблицаСкидок.УсловиеПредоставленияСкидки,
			|	ТаблицаСкидок.ЗначениеУсловия,
			|	ТаблицаСкидок.СегментНоменклатуры,
			|	ТаблицаСкидок.СкидкаНаЕдиныйКомплект,
			|	ТаблицаСкидок.ОбъектСкидки
			|ИЗ
			|	ТаблицаСкидок КАК ТаблицаСкидок
			|ГДЕ
			|	(НЕ ТаблицаСкидок.СкидкаНаценка В ИЕРАРХИИ (&МассивСкидок))";
			
			Запрос.УстановитьПараметр("МассивСкидок" , МассивСкидок);
			Запрос.УстановитьПараметр("ТаблицаСкидок", ТаблицаСкидок);
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			
			Результат = Запрос.Выполнить();
			
			ТаблицаСкидок = Результат.Выгрузить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПрименитьПравилаВытеснениеСкидокПодарковВДереве()

// Определяет по таблице скидок подарков количество подарков
//
// Параметры:
//  ТаблицаСкидок - Таблица значений скидки подарки
//  ТаблицаТоваров - Таблица значений, в которую выгружена таблица товаров из документа
//  СтруктурнаяЕдиница - СтруктурнаяЕдиница, в котором рассчитываем скидки
//  ТаблицаНеПрименяемыхПодарков - Таблица значений, служит для возврата не используемых подарков
//
Процедура ОпределитьКоличествоПодарков(ТаблицаСкидок, ТаблицаТоваров, СтруктурнаяЕдиница, ТаблицаНеПрименяемыхПодарков = Неопределено)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Количество,
	|	ТаблицаТоваров.Сумма,
	|	ТаблицаТоваров.НомерСтроки
	|ПОМЕСТИТЬ ТаблицаВЗапросе
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров";
	
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Результат = Запрос.Выполнить();
	
	ТаблицаСкидок.Колонки.Добавить("КоличествоПодарков", Новый ОписаниеТипов("Число"));
	
	ТаблицаПозиционныхСкидокПоКоличеству = ТаблицаСкидок.СкопироватьКолонки();
	Для каждого СтрокаТаблицыСкидок Из ТаблицаСкидок Цикл
		Если СтрокаТаблицыСкидок.СкидкаНаЕдиныйКомплект Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МИНИМУМ(ВЫБОР
			|			КОГДА ЕСТЬNULL(ТаблицаВЗапросе.Количество, 0) = 0
			|					ИЛИ ТребуемыйКомплект.Количество = 0
			|				ТОГДА 0
			|			ИНАЧЕ ТаблицаВЗапросе.Количество / ТребуемыйКомплект.Количество 
			|		КОНЕЦ) КАК Количество
			|ИЗ
			|	(ВЫБРАТЬ
			|		СкидкиНаценкиНаборПокупкиДляПолученияПодарков.Номенклатура КАК Номенклатура,
			|		СУММА(СкидкиНаценкиНаборПокупкиДляПолученияПодарков.Количество) КАК Количество
			|	ИЗ
			|		Справочник.СкидкиНаценки.НаборПокупкиДляПолученияПодарков КАК СкидкиНаценкиНаборПокупкиДляПолученияПодарков
			|	ГДЕ
			|		СкидкиНаценкиНаборПокупкиДляПолученияПодарков.Ссылка = &Ссылка
			|	
			|	СГРУППИРОВАТЬ ПО
			|		СкидкиНаценкиНаборПокупкиДляПолученияПодарков.Номенклатура) КАК ТребуемыйКомплект
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВЗапросе КАК ТаблицаВЗапросе
			|		ПО ТребуемыйКомплект.Номенклатура = ТаблицаВЗапросе.Номенклатура";
			
			Запрос.УстановитьПараметр("Ссылка" , СтрокаТаблицыСкидок.СкидкаНаценка);
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			
			Если Выборка.Следующий() Тогда
				СтрокаТаблицыСкидок.КоличествоПодарков = Цел(Выборка.Количество);
			КонецЕсли;

		Иначе
			СтрокаТаблицыСкидок.КоличествоПодарков = 1;
		КонецЕсли;
	КонецЦикла;

	ОбщегоНазначенияКлиентСерверСтоматология.ЗагрузитьВТаблицуЗначений(ТаблицаПозиционныхСкидокПоКоличеству, ТаблицаСкидок);
	
	КолвоЭлементовКоллекции = ТаблицаСкидок.Количество();
	ТаблицаНеПрименяемыхПодарков = Новый ТаблицаЗначений;
	ТаблицаНеПрименяемыхПодарков.Колонки.Добавить("СкидкаНаценка");
	Для ОбратныйИндекс = 1 По КолвоЭлементовКоллекции Цикл
		ЭлементКоллекции = ТаблицаСкидок[КолвоЭлементовКоллекции - ОбратныйИндекс];
		
		Если ЭлементКоллекции.КоличествоПодарков <= 0  Тогда
			Если ТаблицаПозиционныхСкидокПоКоличеству.Найти(ЭлементКоллекции.СкидкаНаценка, "СкидкаНаценка") = Неопределено Тогда
				СтрокаТаблицы = ТаблицаНеПрименяемыхПодарков.Добавить();
				СтрокаТаблицы.СкидкаНаценка = ЭлементКоллекции.СкидкаНаценка;
			КонецЕсли; 
			ТаблицаСкидок.Удалить(ЭлементКоллекции);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ОпределитьКоличествоПодарков()

// Заполняет таблицу подарки по скидкам
//
// Параметры:
//  ТаблицаСкидок - Таблица значений скидки подарки
//  ТаблицаТоваров - Таблица значений, в которую выгружена таблица товаров из документа
//  ТабличнаяЧастьСкидки       - табличная часть скидок,
//  ТабличнаяЧастьПодарки - табличная часть "Подарки" документа.
//  СтруктурнаяЕдиница - СтруктурнаяЕдиница, в котором рассчитываем скидки
//
Процедура ЗаполнитьТаблицуПодарков(ТаблицаСкидок, ТабличнаяЧастьПодарки, СтруктурнаяЕдиница)

	Для каждого СтрокаТаблицыСкидок Из ТаблицаСкидок Цикл
		
		ТаблицаПодарков = СтрокаТаблицыСкидок.СкидкаНаценка.НаборПодарков.Выгрузить();
		ТаблицаПодарков.Колонки.Добавить("СкидкаНаценка");
		ТаблицаПодарков.ЗаполнитьЗначения(СтрокаТаблицыСкидок.СкидкаНаценка, "СкидкаНаценка");
			
		Для каждого СтрокаТаблицыПодарки Из ТаблицаПодарков Цикл
			
			СтрокаТаблицыПодарки.КоличествоУпаковок = СтрокаТаблицыПодарки.КоличествоУпаковок * СтрокаТаблицыСкидок.КоличествоПодарков;
			СтрокаТаблицыПодарки.Количество = СтрокаТаблицыПодарки.Количество * СтрокаТаблицыСкидок.КоличествоПодарков;
			
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСерверСтоматология.ЗагрузитьВТаблицуЗначений(ТаблицаПодарков, ТабличнаяЧастьПодарки);
		
	КонецЦикла;

КонецПроцедуры // ЗаполнитьТаблицуПодарки()

// Функция распределяет сумму скидки по строкам товаров
//
// Параметры
//  ТабличнаяЧастьНоменклатуры - табличная часть номенклатуры документа,
//  ТабличнаяЧастьСкидки       - табличная часть скидок,
//  СтруктурнаяЕдиница - СтруктурнаяЕдиница в котором совершается продажа
//  СтрокаРаспределяемойСкидки - строка таблицы значений или выборка, с данными по скидке
//  СуммаРаспределения - Распределяемая сумма 
//
// Возвращаемое значение
//  Булево - если смогли распределить
//
Функция РаспределитьСуммуСкидкиПоСтрокамТоваров(ТабличнаяЧастьНоменклатуры, ТабличнаяЧастьСкидки, СтруктурнаяЕдиница, СтрокаРаспределяемойСкидки, СуммаРаспределения)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаТоваров.НомерСтроки,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТаблицаТоваров.Количество,
	|	ТаблицаТоваров.Сумма
	|ПОМЕСТИТЬ ТаблицаВЗапросе
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Количество,
	|	ВложенныйЗапрос.Сумма,
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	|	ВложенныйЗапрос.Цена
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаВЗапросе.Номенклатура КАК Номенклатура,
	|		ТаблицаВЗапросе.Количество КАК Количество,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА &СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
	|						ИЛИ НоменклатураСегмента.Сегмент = &СегментНоменклатуры
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ) КАК УсловиеПоНоменклатуре,
	|		ТаблицаВЗапросе.Сумма КАК Сумма,
	|		ТаблицаВЗапросе.НомерСтроки КАК НомерСтроки,
	|		ВЫБОР
	|			КОГДА ТаблицаВЗапросе.Количество = 0
	|				ТОГДА 0
	|			ИНАЧЕ ТаблицаВЗапросе.Сумма / ТаблицаВЗапросе.Количество
	|		КОНЕЦ КАК Цена,
	|		ВЫБОР
	|			КОГДА (НЕ &СкидкаНаКомплект)
	|					ИЛИ (НЕ СкидкиНаКомплект.Номенклатура ЕСТЬ NULL )
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК УсловиеКомплекта
	|	ИЗ
	|		ТаблицаВЗапросе КАК ТаблицаВЗапросе
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|			ПО ТаблицаВЗапросе.Номенклатура = НоменклатураСегмента.Номенклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				СкидкиНаценкиНаборПокупкиДляПолученияПодарков.Ссылка КАК Ссылка,
	|				СкидкиНаценкиНаборПокупкиДляПолученияПодарков.НомерСтроки КАК НомерСтроки,
	|				СкидкиНаценкиНаборПокупкиДляПолученияПодарков.Номенклатура КАК Номенклатура,
	|				СкидкиНаценкиНаборПокупкиДляПолученияПодарков.Упаковка КАК Упаковка,
	|				СкидкиНаценкиНаборПокупкиДляПолученияПодарков.Количество КАК Количество
	|			ИЗ
	|				Справочник.СкидкиНаценки.НаборПокупкиДляПолученияПодарков КАК СкидкиНаценкиНаборПокупкиДляПолученияПодарков
	|			ГДЕ
	|				СкидкиНаценкиНаборПокупкиДляПолученияПодарков.Ссылка = &СкидкаНаценка) КАК СкидкиНаКомплект
	|			ПО ТаблицаВЗапросе.Номенклатура = СкидкиНаКомплект.Номенклатура
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаВЗапросе.Номенклатура,
	|		ТаблицаВЗапросе.Количество,
	|		ТаблицаВЗапросе.Сумма,
	|		ТаблицаВЗапросе.НомерСтроки,
	|		ВЫБОР
	|			КОГДА (НЕ &СкидкаНаКомплект)
	|					ИЛИ (НЕ СкидкиНаКомплект.Номенклатура ЕСТЬ NULL )
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.УсловиеПоНоменклатуре
	|	И ВложенныйЗапрос.УсловиеКомплекта
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТабличнаяЧастьНоменклатуры);
	Запрос.УстановитьПараметр("СкидкаНаценка" , СтрокаРаспределяемойСкидки.СкидкаНаценка);
	Запрос.УстановитьПараметр("СегментНоменклатуры", СтрокаРаспределяемойСкидки.СегментБазыРасчетаСкидки);
	Если ЗначениеЗаполнено(СтрокаРаспределяемойСкидки.СкидкаНаценка) И СтрокаРаспределяемойСкидки.СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Подарок Тогда
		Запрос.УстановитьПараметр("СкидкаНаКомплект", СтрокаРаспределяемойСкидки.СкидкаНаЕдиныйКомплект);
	Иначе
		Запрос.УстановитьПараметр("СкидкаНаКомплект", Ложь);
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Результат = Запрос.Выполнить();
	
	ТаблицаСтрокДокумента = Результат.Выгрузить();
	
	Если ТаблицаСтрокДокумента.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СуммаСегмента = ТаблицаСтрокДокумента.Итог("Сумма");
	
	Если СуммаСегмента = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СуммаСегмента < СуммаРаспределения Тогда
		СуммаРаспределения = СуммаСегмента;
	КонецЕсли;	
	
	КоэффициентРаспределения = (1 - СуммаРаспределения / СуммаСегмента);
	НомерМаксимальнойСтроки  = 0;
	МаксимальнаяСумма        = 0;
	
	СуммаТабличнойЧастиТоварыДоРаспределения = ТабличнаяЧастьНоменклатуры.Итог("Сумма");
	
	Для каждого СтрокаТаблицыДокумента Из ТаблицаСтрокДокумента Цикл
	
		Если МаксимальнаяСумма < СтрокаТаблицыДокумента.Сумма Тогда
			НомерМаксимальнойСтроки  = СтрокаТаблицыДокумента.НомерСтроки;
			МаксимальнаяСумма        = СтрокаТаблицыДокумента.Сумма;
		КонецЕсли;
		
		СтрокаТабличнойЧастиНоменклатуры       = ТабличнаяЧастьНоменклатуры[СтрокаТаблицыДокумента.НомерСтроки - 1];
		Скидка = Окр(СтрокаТабличнойЧастиНоменклатуры.Сумма - СтрокаТабличнойЧастиНоменклатуры.Сумма * КоэффициентРаспределения,2,1);
		Если НЕ Скидка = 0 Тогда
			СтрокаТабличнойЧастиНоменклатуры.Сумма = СтрокаТабличнойЧастиНоменклатуры.Сумма - Скидка;
			
			СтрокаТЧСкидки = ТабличнаяЧастьСкидки.Добавить();
			СтрокаТЧСкидки.КлючСтроки    	= СтрокаТабличнойЧастиНоменклатуры.КлючСтроки;
			СтрокаТЧСкидки.НоменклатураСкидки = СтрокаТабличнойЧастиНоменклатуры.Номенклатура;
			СтрокаТЧСкидки.СкидкаНаценка 	= СтрокаРаспределяемойСкидки.СкидкаНаценка;
			СтрокаТЧСкидки.Сумма         	= Скидка;
			СтрокаТЧСкидки.НачислениеНаЛицевойСчетУдалить	= СтрокаРаспределяемойСкидки.НачислениеНаЛицевойСчетУдалить;
			// СтрокаТЧСкидки.ПрименениеСкидки = ПрименениеСкидки;
		КонецЕсли;
	КонецЦикла;
	
	СуммаТабличнойЧастиТоварыПослеРаспределения = ТабличнаяЧастьНоменклатуры.Итог("Сумма");
	
	ОшибкаОкругления = СуммаРаспределения - (СуммаТабличнойЧастиТоварыДоРаспределения - СуммаТабличнойЧастиТоварыПослеРаспределения);
	
	Если Не ОшибкаОкругления = 0 И НомерМаксимальнойСтроки >0 Тогда
		СтрокаТабличнойЧастиНоменклатуры       = ТабличнаяЧастьНоменклатуры[НомерМаксимальнойСтроки - 1];
		СтрокаТабличнойЧастиНоменклатуры.Сумма = СтрокаТабличнойЧастиНоменклатуры.Сумма - ОшибкаОкругления;
		
		СтрокаТЧСкидки = ТабличнаяЧастьСкидки.Добавить();
		СтрокаТЧСкидки.КлючСтроки    = СтрокаТабличнойЧастиНоменклатуры.КлючСтроки;
		СтрокаТЧСкидки.НоменклатураСкидки = СтрокаТабличнойЧастиНоменклатуры.Номенклатура;
		СтрокаТЧСкидки.СкидкаНаценка = СтрокаРаспределяемойСкидки.СкидкаНаценка;
		СтрокаТЧСкидки.Сумма         = ОшибкаОкругления;
		СтрокаТЧСкидки.НачислениеНаЛицевойСчетУдалить	= СтрокаРаспределяемойСкидки.НачислениеНаЛицевойСчетУдалить;
		// СтрокаТЧСкидки.ПрименениеСкидки = ПрименениеСкидки;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции // РаспределитьСуммуСкидкиПоСтрокамТоваров()

// Дополняет информацию в заголовке по периоду акции и отбору по акции
//
// Параметры:
//  Результат - Табличный документв котором содержиться заполненный отчет
//  КомпоновщикНастроек - компоновщик настроек отчета
//  МаркетинговаяАкция - маркетинговая акция
//
Процедура ДополнитьЗаголовокОтчета(Результат, КомпоновщикНастроек, МаркетинговаяАкция) Экспорт

	ТекстОтбора = Результат.Область("R2C1:R2C1").Текст;
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ТекстОтбора);
	
	// Период
	ЗначениеПараметраПериод = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	ЗначениеПараметраНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодНачалаАкции"));
	ЗначениеПараметраКонецПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОкончанияАкции"));
	ОписаниеПериода = "";
	
	Если ЗначениеПараметраНачалоПериода <> Неопределено 
	   И ЗначениеПараметраКонецПериода <> Неопределено Тогда
		НачалоПериода = ?(ТипЗнч(ЗначениеПараметраНачалоПериода.Значение) = Тип("СтандартнаяДатаНачала"), ЗначениеПараметраНачалоПериода.Значение.Дата, ЗначениеПараметраНачалоПериода.Значение);
		КонецПериода = ?(ТипЗнч(ЗначениеПараметраКонецПериода.Значение) = Тип("СтандартнаяДатаНачала"), ЗначениеПараметраКонецПериода.Значение.Дата, ЗначениеПараметраКонецПериода.Значение);
		Если НачалоПериода = '00010101' И КонецПериода = '00010101' Тогда
			ОписаниеПериода = НСтр("ru='Период не установлен'");
		ИначеЕсли НачалоПериода = '00010101' ИЛИ КонецПериода = '00010101' Тогда
			ОписаниеПериода = Формат(НачалоПериода, "ДФ = дд.ММ.гггг; ДП = ...") + " - " + Формат(КонецПериода, "ДФ = дд.ММ.гггг; ДП = ...");
		ИначеЕсли НачалоПериода <= КонецПериода Тогда
			ОписаниеПериода = ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода), "ФП = Истина");
		Иначе
			ОписаниеПериода = НСтр("ru='Неправильно задан период!'");
		КонецЕсли;
	ИначеЕсли ЗначениеПараметраПериод <> Неопределено Тогда
		Период = ЗначениеПараметраПериод.Значение;
		Если Период = '00010101' Тогда
			ОписаниеПериода = НСтр("ru='на '") + Формат(ТекущаяДата(), "ДП = ...");
		Иначе
			ОписаниеПериода = НСтр("ru='на конец дня '") + Формат(Период, "ДФ = дд.ММ.гггг; ДП = ...");
		КонецЕсли;
	Иначе
		ОписаниеПериода = "";
	КонецЕсли;
	Если Не ПустаяСтрока(ОПисаниеПериода) Тогда
		ОписаниеПериода = "Период акции: " + ОписаниеПериода;
	КонецЕсли;
	
	ТекстовыйДокумент.ВставитьСтроку(2,ОписаниеПериода);
	
	Если ЗначениеЗаполнено(МаркетинговаяАкция)  Тогда
		ОписаниеАкции = "Отбор заполнен по акции: "+МаркетинговаяАкция.НаименованиеАкции + " ("+МаркетинговаяАкция+").";
		ТекстовыйДокумент.ДобавитьСтроку(ОписаниеАкции);
	КонецЕсли;
	
	Результат.Область("R2C1:R2C1").Текст = ТекстовыйДокумент.ПолучитьТекст();
	
КонецПроцедуры // ДополнитьЗаголовокОтчета()

// Функция возвращает признак доступности скидок для клиентов
//
Функция ВернутьПризнакДоступностиСкидок(ДокументОбъект)
	
	РазрешитьСкидки = Истина;
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПланЛечения") 
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.Прием") 
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.НарядЗаказ") Тогда 
		Если НЕ ДокументОбъект.ПолисМедСтрахования.Пустая() Тогда 
	    	РазрешитьСкидки = Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.Реализация") Тогда 	
		// Если ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда 
		//	МассивПолисов = Справочники.ПолисыМедицинскогоСтрахования.ПолучитьАктивныеПолисыКонтрагента(ДокументОбъект.Контрагент);
		//	Если МассивПолисов.Количество() > 0 Тогда 
		//		РазрешитьСкидки = Ложь;
		//	КонецЕсли;	
		// КонецЕсли;	
	КонецЕсли;
	
	Возврат РазрешитьСкидки;
	
	КонецФункции
	
// Функция получает Контрагента и его родственников
Функция КонтрагентИРодственники(Получатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РодственныеСвязи.Родственник КАК Родственник
	|ИЗ
	|	РегистрСведений.РодственныеСвязи КАК РодственныеСвязи
	|ГДЕ
	|	РодственныеСвязи.Контрагент = &Получатель
	|	И РодственныеСвязи.ОбщийНакопительныйСчет";

	Запрос.УстановитьПараметр("Получатель", Получатель);
	МассивКонтрагентов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Родственник");
	МассивКонтрагентов.Добавить(Получатель);
	Возврат МассивКонтрагентов;
	
КонецФункции

// Функция получает карту по контрагенту.
//
Функция ПолучитьКарту(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Карты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Карты КАК Карты
	|ГДЕ
	|	Карты.ВладелецКарты = &ВладелецКарты
	|	И Карты.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ВладелецКарты", Контрагент);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Если Результат.Количество() <> 0 Тогда
		Возврат Результат[0];
	Иначе
		Возврат Справочники.Карты.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти
