
&НаКлиенте
Перем ФормироватьНаименованиеПолноеАвтоматически; // надо ли формировать автоматически НаименованиеПолное или нет

&НаКлиенте
Перем ЗаписатьИндексСортировкиНоменклатуры;

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Элементы.Код.Видимость = ОтображниеКода;
	Элементы.Код.ПоложениеЗаголовка = ?(ОтображниеКода, ПоложениеЗаголовкаЭлементаФормы.Авто, ПоложениеЗаголовкаЭлементаФормы.Нет);
	
	// Обработчик механизма "Свойства".
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, Объект, "СтраницаДополнительныеРеквизиты");	
	
	ЭтоУслуга = (Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга);
	СоздатьДеревоСтруктурныхЕдиниц();
	ЭтотОбъект.ОнлайнЗапись = (Объект.НормаВремени <> 0 ИЛИ Не ЭтоУслуга) И НоменклатураДоступнаДляОнлайнЗаписи();  
	
	Если ЭтотОбъект.ОнлайнЗапись Тогда
		ЗаполнитьДеревоУслуг();
	КонецЕсли;
	
	// установим видимость ставки НДС
	УстановитьВидимостьЭлементов();
	//Элементы.НормыСписанияМатериалов.Видимость = ?((ЗначениеЗаполнено(Объект.ТипНоменклатуры) и ЭтоУслуга),Истина, Ложь);
	
	УстановкаВидимостиПолейСертификата();
	НовыйЭлемент = Объект.Ссылка.Пустая();
	Если Не НовыйЭлемент Тогда 
		СерийныйНомер.Параметры.УстановитьЗначениеПараметра("Номенклатура", Объект.Ссылка);  
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ЕдиницаИзмерения) Тогда
		Объект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.шт;
	КонецЕсли;
	
	// Создаем элемент существующих строк состав набора
	Для Каждого СтрокаТЗ ИЗ Объект.СоставНабора Цикл
		ДобавитьЭлементыФормыСоставНабора(СтрокаТЗ.ПолучитьИдентификатор());
	КонецЦикла;
	
	Элементы.ГруппаСертификаты.Видимость = ?((ЗначениеЗаполнено(Объект.ТипНоменклатуры) И Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат), Истина, Ложь);			
	ЗаполнитьДеревоСостояний();
	
	СоставУслугиОнЛайнКаталога = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Объект.ОбменССайтомСоответствиеУслуги, "||");
	Если СоставУслугиОнЛайнКаталога.Количество() = 2 Тогда
		ОбменССайтомСоответствиеУслуги_Код = СоставУслугиОнЛайнКаталога[0];
		ОбменССайтомСоответствиеУслуги_Наименование = СоставУслугиОнЛайнКаталога[1];
	КонецЕсли;	
	
	Если ЭтоУслуга И НовыйЭлемент Тогда
		Объект.НормаВремени = ?(Объект.НормаВремени <> 0, Объект.НормаВремени, 30);
	ИначеЕсли ЭтоУслуга Тогда
		ЭтотОбъект.НормаВремени = Объект.НормаВремени;
	КонецЕсли;	
	
	Если Не НовыйЭлемент Тогда
		ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Номенклатура", Объект.Ссылка));
	Иначе
		ЭтаФорма.ТекущийЭлемент = Элементы.Наименование;
	КонецЕсли; 

	СформироватьБлокЦен();
	ОбновитьСтатусНоменклатуры(); 
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии"
Процедура ПриОткрытии(Отказ)
	
	УстановитьФлагФормироватьНаименованиеПолноеАвтоматически();
	
	Если НовыйЭлемент Тогда 		
		ТипНоменклатурыПриИзменении(Неопределено); 
		НаименованиеПриИзменении(Неопределено)
	КонецЕсли;
		 	
КонецПроцедуры

&НаКлиенте       
// Процедура Обработчик события формы - ПередЗаписью.
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Для каждого СтрокаТЧ Из Объект.СоставНабора Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СННоменклатура) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Элемент не записан. В составе набора услуг пустая строка.';en='The item is not written. As part of the service set, an empty string.'"));
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;          
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПередЗаписьюНаСервере"
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	// ЗаполнитьОбластиЗубнойФормулы(ТекущийОбъект);
	
	МассивВыбранныхСтруктурныхЕдиниц = Новый Массив;
	ОбработкаТабличныхЧастейКлиент.ЗаполнитьМассивВыбранныхСтруктурныхЕдиниц(
		ЭтотОбъект.ПодборСтруктурныеЕдиницы.ПолучитьЭлементы(), 
		МассивВыбранныхСтруктурныхЕдиниц);
	
	// Обработчик механизма "Свойства".
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);      
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	// ЗапретРедактированияРеквизитовОбъектов.ПередЗаписью(ЭтаФорма, ТекущийОбъект, Отказ);
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПриЗаписиНаСервере"
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	МассивВыбранныхСтруктурныхЕдиниц = Новый Массив;
	ОбработкаТабличныхЧастейКлиент.ЗаполнитьМассивВыбранныхСтруктурныхЕдиниц(
		ЭтотОбъект.ПодборСтруктурныеЕдиницы.ПолучитьЭлементы(), 
		МассивВыбранныхСтруктурныхЕдиниц);
	
	РегистрыСведений.РеквизитыОбъектов.СоздатьЗаписиВРегистреРеквизитыОбъектов(ТекущийОбъект.Ссылка, 
		МассивВыбранныхСтруктурныхЕдиниц, "ОнлайнЗапись", Истина);

КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПослеЗаписиНаСервере".
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	// ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма, Элементы.ГруппаРедактированияРеквизитовОбъекта);
	
	// Синхронизация реквизитов с регистрами сведений.
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	УстановитьСтатусПродажиНоменклатуры(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница, Объект.Ссылка, ТекущаяДата(), ЭтаФорма.СтатусПродажиНоменклатуры);
	
	Элементы.НеобходимоЗаписатьДокумент.Видимость = Не ЗначениеЗаполнено(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаОповещения"
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Обработчик механизма "Свойства".
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьДополнительныеРеквизиты();
	КонецЕсли;
	  
	Если ИмяСобытия = "ЗаписатьОбластиЗубнойФормулы" Тогда 
		ЗаполнитьОбластиЗубнойФормулы(Параметр);
	ИначеЕсли ИмяСобытия = "ВставитьУпаковку" Тогда
		
		Если ЭтаФорма.ТекущийЭлемент <> Неопределено И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтаФорма.ТекущийЭлемент, "Имя") Тогда
			
			МассивЭлементов = СтрРазделить("УпаковкаПоУмолчанию,УпаковкаПоУмолчаниюМатериал,УпаковкаПоУмолчаниюИмущество", ",");
			
			Если ЭтаФорма.ТекущийЭлемент.Имя = "УпаковкаДляОтчета" Тогда
				Объект.УпаковкаДляОтчета = Параметр;
			ИначеЕсли МассивЭлементов.Найти(ЭтаФорма.ТекущийЭлемент.Имя) <> Неопределено Тогда			
				Объект.УпаковкаПоУмолчанию = Параметр;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриЗакрытии"
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗаписатьИндексСортировкиНоменклатуры = Истина
		И ЗначениеЗаполнено(Объект.Ссылка)
		И Объект.ИндексСортировки <> ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.Ссылка, "ИндексСортировки")
		И (Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга")
				И Объект.ГруппаОнлайнЗаписи = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.Ссылка, "ГруппаОнлайнЗаписи")) Тогда
		
		ИндексСортировки = Объект.ИндексСортировки;
		
		ЭтаФорма.Прочитать();
		Объект.ИндексСортировки = ИндексСортировки;
		ЭтаФорма.Записать();
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеЗаписи"
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗаписатьИндексСортировкиНоменклатуры = Ложь;

КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПриЧтенииНаСервере"
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
КонецПроцедуры

#КонецОбласти  

#Область ОБРАБОТЧИКИ_РЕКВИЗИТОВ_ШАПКИ

&НаКлиенте
// Процедура, обработчик события "Нажатие".
//
Процедура ИсторияИзмененияСтатусаНажатие(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Элемент не записан. Открыть историю статусов незаписанного элемента невозможно.';en='Element not recorded by. Open unwritten element status history impossible.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Отбор, Видимость", Новый Структура("Номенклатура", Объект.Ссылка), Ложь);	
	ОткрытьФорму("РегистрСведений.СтатусыНоменклатуры.ФормаСписка", ПараметрыФормы,,,,, Новый ОписаниеОповещения("ИсторияИзмененияСтатусаНажатиеЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

&НаКлиенте
// Процедура - История изменения цены нажатие завершение
// Завершение немодального открытия окна формы - Регистр сведений Цены номенклатуры - ФормаСписка
// Параметры:
//  Результат	 - 	 Результат Оповещения 
//  Параметры	 - 	 Параметры Оповещения 
//
Процедура ИсторияИзмененияСтатусаНажатиеЗавершение(Результат, Параметры) Экспорт
	
	ОбновитьСтатусНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ТипНоменклатурыПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	УстановкаВидимостиПолейСертификата();	
	
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		Объект.НормаВремени = ?(Объект.НормаВремени <> 0, Объект.НормаВремени, 30);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Тип номенклатуры обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ТипНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандратнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение <> ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") 
		И Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") И Не Объект.Ссылка.Пустая() Тогда
		
		Если НормыСписанияСуществуют(Объект.Ссылка) Тогда 
			
			ТекстВопроса = "Нормы списания материалов для данной услуги будут удалены. Продолжить?";
			ОписаниеОповещения = Новый ОписаниеОповещения("ТипНоменклатурыОбработкаВыбораЗавершение"
														  , ЭтотОбъект
														  , Новый Структура("ВыбранныйТипНоменклатуры", ВыбранноеЗначение));
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса,РежимДиалогаВопрос.ДаНет);
			Возврат;
			
		КонецЕсли;
	
		
	КонецЕсли;
	
	Если Не ВыбранноеЗначение = Объект.ТипНоменклатуры Тогда
		ТипНоменклатурыПриИзменении(Неопределено);           
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
// Функция - Нормы списания существуют
// 
// Возвращаемое значение:
//   - 
//
Функция НормыСписанияСуществуют(Номенклатура)
	
	Возврат РегистрыСведений.НормыСписанияМатериалов.ЗаписиВРегистреДляНоменклатурыСуществуют(Номенклатура);
	
КонецФункции

&НаКлиенте
// Процедура - Тип номенклатуры обработка выбора завершение
//
// Параметры:
//  РезультатВопроса - 	 - 
//  ДопПараметры	 - 	 - 
//
Процедура ТипНоменклатурыОбработкаВыбораЗавершение(РезультатВопроса, ДопПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		УдалитьНормыСписанияМатериаловПоНоменклатуре(Объект.Ссылка);
		Объект.ТипНоменклатуры = ДопПараметры.ВыбранныйТипНоменклатуры;
		ТипНоменклатурыПриИзменении(Неопределено);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - Удалить нормы списания материалов по номенклатуре
//
Процедура УдалитьНормыСписанияМатериаловПоНоменклатуре(Номенклатура)
	
	НаборЗаписей = РегистрыСведений.НормыСписанияМатериалов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении", элемент "НаименованиеПолное"
//
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ФормироватьНаименованиеПолноеАвтоматически Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// При изменении выбора специализации
//
Процедура СпециализацияПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
// Процедура, устанавливает видимость элементов формы.
//
// Параметры:
//  Нет.
//
Процедура УстановитьВидимостьЭлементов()
	
	ТекСтруктурнаяЕд = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;    	
	Если ЗначениеЗаполнено(ТекСтруктурнаяЕд) Тогда
		Элементы.СтавкаНДС.Видимость = ?(ТекСтруктурнаяЕд.Организация.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая, Истина, Ложь);
		Если ЗначениеЗаполнено(ТекСтруктурнаяЕд.Организация)
			И Объект.Ссылка = Справочники.Номенклатура.ПустаяСсылка() Тогда
			
			Если ТекСтруктурнаяЕд.Организация.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая Тогда
				Объект.СтавкаНДС =  ТекСтруктурнаяЕд.Организация.СтавкаНДС;
			Иначе
				Объект.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Элементы.СтавкаНДС.Видимость = Ложь;
	КонецЕсли;
	
	// Для типа подарочный сертификат	
	ЗаполнитьСписокВыбораСрокДействияСертификата();
	ЗаполнитьСписокВыбораВидаНоминалаСертификата();		
	
	ТипНоменклатурыЗапас     = (Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас);
	ТипНоменклатурыМатериал  = (Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал);
	ТипНоменклатурыИмущество = (Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Имущество);
	ТипНоменклатурыУслуга    = (Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга);
	ТипНоменклатурыНабор     = (Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор);
	
	Элементы.ГруппаХарактеристики.Видимость	= (НЕ ЗначениеЗаполнено(Объект.ТипНоменклатуры)) ИЛИ ТипНоменклатурыЗапас ИЛИ ТипНоменклатурыМатериал ИЛИ ТипНоменклатурыИмущество;
	Элементы.УпаковкаДляОтчета.Видимость 	= (ТипНоменклатурыЗапас ИЛИ ТипНоменклатурыМатериал ИЛИ ТипНоменклатурыИмущество);
	Элементы.УпаковкаПоУмолчанию.Видимость 	= (ТипНоменклатурыЗапас ИЛИ ТипНоменклатурыМатериал ИЛИ ТипНоменклатурыИмущество);
	Элементы.НормаВремени.Видимость 	    = ТипНоменклатурыУслуга;
	Элементы.Гарантия.Видимость 			= ТипНоменклатурыУслуга;	
	Элементы.GTIN.Видимость 			    = ТипНоменклатурыЗапас;
	Элементы.ГруппаКодУслуги.Видимость      = ТипНоменклатурыУслуга;
	
	Если Константы.ИспользоватьУЕТ.Получить() = Истина И ТипНоменклатурыУслуга Тогда
		Элементы.УЕТ.Видимость       		    = Истина;  
	Иначе 
		Элементы.УЕТ.Видимость       		    = Ложь; 
	КонецЕсли;
	
	Элементы.МатериалХарактеристики.Видимость       = Объект.ИспользоватьПартии;     	
	Элементы.НормыСписанияМатериалов.Видимость 		 = ТипНоменклатурыУслуга;
	Элементы.ОбязательноУказаниеАссистента.Видимость = ТипНоменклатурыУслуга;
	Элементы.ОбластиЗуубнойФормулы.Видимость    	 = ТипНоменклатурыУслуга;
	Элементы.СкидкиЗапрещены.Видимость          	 = НЕ ТипНоменклатурыИмущество;
    Элементы.ИнформацияОЦенах.Видимость         	 = НЕ ТипНоменклатурыИмущество;
    Элементы.Специализация.Видимость            	 = НЕ ТипНоменклатурыИмущество;
	// Элементы.СоставНабора.Видимость                  = ТипНоменклатурыНабор;  	
		
	Если НЕ ПравоДоступа("Изменение", Метаданные.Справочники.Номенклатура) Тогда
		Элементы.ОбластиЗуубнойФормулы.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Элементы.ОбластиЗуубнойФормулы.ТолькоПросмотр Тогда
		Элементы.ДеревоСостоянийВыделитьВсе.Доступность = Ложь;
		Элементы.ДеревоСостоянийСнятьВсе.Доступность    = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Специализация) Тогда
		Элементы.ОбластиЗуубнойФормулы.Видимость = Объект.Специализация.СтоматологическиеУслуги;
	Иначе
		Элементы.ОбластиЗуубнойФормулы.Видимость = ОбщегоНазначенияСтоматология.ПолучитьПризнакОказанияСтоматологическихУслуг();
	КонецЕсли;
	
	
	Элементы.ОбластиЗуубнойФормулы.Видимость 	 = НЕ ТипНоменклатурыНабор;
	// Элементы.ГруппаПраваяКолонкаШапки.Видимость  = НЕ ТипНоменклатурыНабор;
	Элементы.ГруппаСоставНабора.Видимость        = ТипНоменклатурыНабор;
	Элементы.Группа_Лаборатория_Скидки.Видимость = НЕ ТипНоменклатурыНабор;
	Элементы.ЕдиницаИзмерения.Видимость 	     = НЕ ТипНоменклатурыНабор И НЕ ТипНоменклатурыУслуга;
	Элементы.СтавкаНДС.Видимость 				 = НЕ ТипНоменклатурыНабор;
	Элементы.ИнформацияОЦенах.Видимость 		 = НЕ ТипНоменклатурыНабор;
	Элементы.Специализация.Видимость 			 = НЕ ТипНоменклатурыНабор;	
	
	Элементы.ГруппаНастройкаОнлайнЗаписи.Видимость = ЭтотОбъект.ОнлайнЗапись И ВернутьМассивСтруктурныхЕдиниц().Количество() > 1;
	Элементы.ГруппаОнлайнЗапись.Видимость          = ТипНоменклатурыУслуга;
	Элементы.ГруппаОнлайнЗаписи.Видимость		   = ЭтотОбъект.ОнлайнЗапись;
	Элементы.НеобходимоЗаписатьДокумент.Видимость  = Не ЗначениеЗаполнено(Объект.Ссылка);
	Элементы.ОткрытьГруппуСДеревомУслуг.Видимость  = ЭтотОбъект.ОнлайнЗапись;
	Элементы.ОписаниеДляОнлайнЗаписи.Видимость	   = ЭтотОбъект.ОнлайнЗапись;
		
	ЭтотОбъект.Элементы.ГруппаНормыСписанияМатериалов.Видимость = Ложь;
	
	ВывестиСсылкуНаТоварИЛИУслугу();
	
КонецПроцедуры

// Процедура - Вывести ссылку на товар ИЛИУслугу
//
Процедура ВывестиСсылкуНаТоварИЛИУслугу()
	
	ЭтоУслуга = Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга;
	
	Элементы.СсылкаНаТоварУслугу.Заголовок = "";
	Если ЭтотОбъект.ОнлайнЗапись = Истина И ЭтоУслуга Тогда		
		
		СтруктурнаяЕдиница = ПолучитьСтруктурнуюЕдиницуВиджета();		
		Если ЗначениеЗаполнено(СтруктурнаяЕдиница) И Не Объект.Ссылка.Пустая() Тогда		
			
			УИДСалона = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтруктурнаяЕдиница, "УникальныйИдентификаторСтруктурнойЕдиницы");
			Если УИДСалона = "" Тогда
				УИДСалона = Строка(СтруктурнаяЕдиница.УникальныйИдентификатор()); 
			КонецЕсли;
			
			Элементы.СсылкаНаТоварУслугу.Заголовок = "https://reservi.ru/stoma1c/" + УИДСалона + "/?service=" + Строка(Объект.Ссылка.УникальныйИдентификатор());	
			ВидимостьЭлемента = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	Элементы.ГруппаСсылкаНаТовар.Видимость = ЗначениеЗаполнено(Элементы.СсылкаНаТоварУслугу.Заголовок);	
	
КонецПроцедуры

// Функция - Получить структурную единицу онлайн магазина ИЛИВиджета
//
// Параметры:
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтруктурнуюЕдиницуВиджета()
	
	ТекущаяСтруктурнаяЕдиница	= ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;	
	ВнешняяСистема				= Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.ВиджетОнлайнЗаписи);
	
	Если ЗначениеЗаполнено(ВнешняяСистема) Тогда		
		
		ПараметрыВнешнейСистемы = ВнешняяСистема.Параметры.Получить();			
		
		Если ПараметрыВнешнейСистемы <> Неопределено И ПараметрыВнешнейСистемы.Свойство("ИспользуемыеСтруктурныеЕдиницы") Тогда			
			Для Каждого СтруктурнаяЕдиница Из ПараметрыВнешнейСистемы.ИспользуемыеСтруктурныеЕдиницы Цикл
				Если ТекущаяСтруктурнаяЕдиница = СтруктурнаяЕдиница Тогда
					Возврат СтруктурнаяЕдиница;
				КонецЕсли;								
			КонецЦикла;			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Справочники.СтруктурныеЕдиницы.ПустаяСсылка();

КонецФункции

&НаКлиенте
// Процедура обработчик события Выполнить команды РедактироватьСоставСвойств.
//
Процедура Подключаемый_СвойстваВыполнитьКоманду(Команда)
	
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры // РедактироватьСоставСвойств()

&НаСервере
// Процедура, выполняет заполнение дерева состояний зубной формулы
//
Процедура ЗаполнитьДеревоСостояний()
	
	Запрос = Новый Запрос();
	Запрос.Текст = ПолучитьТекстЗапроса();
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИтоги.Следующий() Цикл
		
		Родитель           = ДеревоСостояний.ПолучитьЭлементы().Добавить();
		Родитель.Состояние = ВыборкаИтоги.ОбластьЗубнойФормулы;
		Родитель.Картинка  = БиблиотекаКартинок.Папка;
		Выборка = ВыборкаИтоги.Выбрать();
		Количество = 0;
		КоличествоВыбранных = 0;
		Пока Выборка.Следующий() Цикл
			
			 НоваяСтрока = Родитель.ПолучитьЭлементы().Добавить();
			 НоваяСтрока.Состояние = Выборка.Состояние;
			 НоваяСтрока.Картинка = БиблиотекаКартинок.Картинка_Реквизит;
			 Количество = Количество + 1;
			 
			 Если Выборка.Флаг Тогда
				 НоваяСтрока.Принадлежит = Истина;
				 КоличествоВыбранных = КоличествоВыбранных + 1;
				 // Родитель.Принадлежит = Истина;
			 КонецЕсли;
		 КонецЦикла;
		 
		 Если Количество <> 0 и КоличествоВыбранных = Количество Тогда
			 Родитель.Принадлежит = Истина;
		 ИначеЕсли КоличествоВыбранных <> 0 и КоличествоВыбранных < Количество Тогда
			 Родитель.Принадлежит =  2;
		 КонецЕсли;
		  
	КонецЦикла;                                        	
	
КонецПроцедуры

&НаСервере
// Функция, вовзащает текст запроса
//
Функция ПолучитьТекстЗапроса()
	
	Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	ВЫБОР
	        |		КОГДА Состояние.ОбластьЗубнойФормулы = ЗНАЧЕНИЕ(Перечисление.ОбластиЗубнойФормулы.ПоверхностьЦентр)
	        |			ТОГДА ""Поверхность""
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА Состояние.ОбластьЗубнойФормулы = ЗНАЧЕНИЕ(Перечисление.ОбластиЗубнойФормулы.Корень1)
	        |					ТОГДА ""Корень""
	        |				ИНАЧЕ ВЫБОР
	        |						КОГДА Состояние.ОбластьЗубнойФормулы = ЗНАЧЕНИЕ(Перечисление.ОбластиЗубнойФормулы.Канал1)
	        |							ТОГДА ""Канал""
	        |						ИНАЧЕ ВЫБОР
	        |								КОГДА Состояние.ОбластьЗубнойФормулы = ЗНАЧЕНИЕ(Перечисление.ОбластиЗубнойФормулы.Десна)
	        |									ТОГДА ""Десна""
	        |								ИНАЧЕ ВЫБОР
	        |										КОГДА Состояние.ОбластьЗубнойФормулы = ЗНАЧЕНИЕ(Перечисление.ОбластиЗубнойФормулы.Кость)
	        |											ТОГДА ""Кость""
	        |										ИНАЧЕ ВЫБОР
	        |												КОГДА Состояние.ОбластьЗубнойФормулы = ЗНАЧЕНИЕ(Перечисление.ОбластиЗубнойФормулы.КоронкаЗУб)
	        |													ТОГДА ""Коронка (зуб)""
	        |												ИНАЧЕ ВЫБОР
	        |														КОГДА Состояние.ОбластьЗубнойФормулы = ЗНАЧЕНИЕ(Перечисление.ОбластиЗубнойФормулы.КоронкаПротез)
	        |															ТОГДА ""Коронка (Протез)""
	        |														ИНАЧЕ ВЫБОР
	        |																КОГДА Состояние.ОбластьЗубнойФормулы = ЗНАЧЕНИЕ(Перечисление.ОбластиЗубнойФормулы.Штифт)
	        |																	ТОГДА ""Штифт""
	        |																ИНАЧЕ ВЫБОР
	        |																		КОГДА Состояние.ОбластьЗубнойФормулы = ЗНАЧЕНИЕ(Перечисление.ОбластиЗубнойФормулы.Абатмент)
	        |																			ТОГДА ""Абатмент""
	        |																	КОНЕЦ
	        |															КОНЕЦ
	        |													КОНЕЦ
	        |											КОНЕЦ
	        |									КОНЕЦ
	        |							КОНЕЦ
	        |					КОНЕЦ
	        |			КОНЕЦ
	        |	КОНЕЦ КАК ОбластьЗубнойФормулы,
	        |	Состояние.Ссылка КАК Состояние,
	        |	ВЫБОР
	        |		КОГДА Таблица.СостояниеЗубнойФормулы ЕСТЬ NULL 
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК Флаг
	        |ИЗ
	        |	Справочник.СостояниеЗубнойФормулы КАК Состояние
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			НоменклатураОбластиЗубнойФормулы.СостояниеЗубнойФормулы КАК СостояниеЗубнойФормулы
	        |		ИЗ
	        |			Справочник.Номенклатура.ОбластиЗубнойФормулы КАК НоменклатураОбластиЗубнойФормулы
	        |		ГДЕ
	        |			НоменклатураОбластиЗубнойФормулы.Ссылка = &Ссылка) КАК Таблица
	        |		ПО Состояние.Ссылка = Таблица.СостояниеЗубнойФормулы
	        |ГДЕ
	        |	НЕ Состояние.ПометкаУдаления
	        |ИТОГИ ПО
	        |	ОбластьЗубнойФормулы";
		Возврат Текст;
	
КонецФункции
        
&НаСервере
// Процедура обновляет элементы дополнительных реквизитов.
//
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры // ОбновитьЭлементыДополнительныхРеквизитов()

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура УпаковкаДляОтчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		СтандартнаяОбработка = Ложь;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Элемент справочника еще не записан!'");
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет выбор упаковки номенклатуры.
//  Параметры:
//   ДанныеВыбора - структура выбора;
//   СтандартнаяОбработка - признак выполнения стандартной обработки выбора.
//   ТекущаяСтрока - текущая строка табличной части, в которой осуществляется выбор значения.
Процедура ВыбратьУпаковкуНоменклатуры(ДанныеВыбора, СтандартнаяОбработка, ТекущаяСтрока)

	СтандартнаяОбработка = Ложь;

	Если ЗначениеЗаполнено(ТекущаяСтрока.НСМНоменклатура) Тогда
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.УпаковкиНоменклатуры.ПустаяСсылка"), "<без упаковки>");

		Если Не ОбщегоНазначенияСтоматология.ПроверитьИспользованиеУпаковокИПолучитьСписокДляВыбора(ТекущаяСтрока.НСМНоменклатура, ДанныеВыбора) Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'Для данной номенклатуры нет упаковок.'"));
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура - Обновить статус номенклатуры
//
Процедура ОбновитьСтатусНоменклатуры()
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		СтатусПродажиСтруктура = РегистрыСведений.СтатусыНоменклатуры.ПолучитьСтатусПродажиНоменклатуры(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница, Объект.Ссылка, ТекущаяДата());
		СтатусПродажиНоменклатуры = СтатусПродажиСтруктура.ВПродаже;
		// Если СтатусПродажиНоменклатуры = Ложь Тогда
		//	Элементы.СтатусПродажиНоменклатуры.ФорматРедактирования = "Л=ru; БЛ='Снят с продаж с " + Формат(СтатусПродажиСтруктура.ДатаСтатуса,"ДЛФ=D") + "'; БИ='В продаже'";
		//	Элементы.ДекорацияВПродаже.МаксимальнаяШирина = 22;// 9;
		// Иначе
		//	Элементы.СтатусПродажиНоменклатуры.ФорматРедактирования = "Л=ru; БЛ='Снят с продаж'; БИ='В продаже'";
		//	Элементы.ДекорацияВПродаже.МаксимальнаяШирина = 38;// 25;
		// КонецЕсли;
	Иначе
		СтатусПродажиНоменклатуры = Истина;	
	КонецЕсли;
	
КонецПроцедуры	

&НаСервереБезКонтекста
// Процедура - Установить статус продажи номенклатуры
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  Номенклатура		 - 	 - 
//  ДатаСтатуса			 - 	 - 
//  СтатусПродажи		 - 	 - 
//
Процедура УстановитьСтатусПродажиНоменклатуры(СтруктурнаяЕдиница, Номенклатура, ДатаСтатуса, СтатусПродажи)
	
	РегистрыСведений.СтатусыНоменклатуры.УстановитьСтатусПродажиНоменклатуры(СтруктурнаяЕдиница, Номенклатура, ДатаСтатуса, СтатусПродажи);   
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураМедицинскихУслугПриИзменении(Элемент)
	
	Объект.КодНоменклатурыМедицинскиУслуг = "";
	Если ЗначениеЗаполнено(Объект.НоменклатураМедицинскихУслуг) Тогда
		Объект.КодНоменклатурыМедицинскиУслуг = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.НоменклатураМедицинскихУслуг, "Код");
		Объект.УЕТ = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.НоменклатураМедицинскихУслуг, "УЕТ");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_ВКЛАДКИ_ОБЛАСТИ_ЗУБНОЙ_ФОРМУЛЫ

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ДеревоСостоянийПриИзменении(Элемент)
	
	СтрокаРодитель = Элемент.ТекущиеДанные; 	
	Если СтрокаРодитель.Принадлежит = 2 Тогда
		СтрокаРодитель.Принадлежит = 0;
	КонецЕсли;

	Если Не СтрокаРодитель = Неопределено Тогда
		Если ТипЗнч(СтрокаРодитель.Состояние) = Тип("Строка") Тогда			
			Для Каждого СтрокаТЧ из СтрокаРодитель.ПолучитьЭлементы() Цикл
				СтрокаТЧ.Принадлежит = СтрокаРодитель.Принадлежит;
			КонецЦикла;
		Иначе 			
			Родитель = СтрокаРодитель.ПолучитьРодителя();
			СтрокиДерева = Родитель.ПолучитьЭлементы(); 			
			ЕстьВыбранные = Ложь;
			Количество = 0;
			КоличествоНевыбранных = 0;
			Для Каждого СтрокаТЧ из СтрокиДерева Цикл
				Если НЕ СтрокаТЧ.Принадлежит Тогда
					КоличествоНевыбранных = КоличествоНевыбранных + 1;						
				КонецЕсли;
				Количество = Количество + 1;
			КонецЦикла;
			Если Количество = КоличествоНевыбранных Тогда
				Родитель.Принадлежит = Ложь;
			ИначеЕсли Количество > КоличествоНевыбранных и КоличествоНевыбранных <> 0 Тогда
				Родитель.Принадлежит = 2;
			ИначеЕсли КоличествоНевыбранных = 0 Тогда
				Родитель.Принадлежит = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет установку всех флагов в "Истину"
//
Процедура ВыделитьВсе(Команда)
	
	Для Каждого СтрокаТЧ из ДеревоСостояний.ПолучитьЭлементы() Цикл
		СтрокаТЧ.Принадлежит = Истина;
		Для Каждого СтрокаДерева из СтрокаТЧ.ПолучитьЭлементы() Цикл
			СтрокаДерева.Принадлежит = Истина;
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет снятие флагов
//
Процедура СнятьВсе(Команда)
	
	Для Каждого СтрокаТЧ из ДеревоСостояний.ПолучитьЭлементы() Цикл
		СтрокаТЧ.Принадлежит = Ложь;
		Для Каждого СтрокаДерева из СтрокаТЧ.ПолучитьЭлементы() Цикл
			СтрокаДерева.Принадлежит = Ложь;
		КонецЦикла;		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обарботчик события команды "Свернуть"
//
Процедура Свернуть(Команда)	
		
	Для а = 0 По ДеревоСостояний.ПолучитьЭлементы().Количество() - 1 Цикл
		Элементы.ДеревоСостояний.Свернуть(ДеревоСостояний.ПолучитьЭлементы()[а].ПолучитьИдентификатор());
	КонецЦикла;     
	
КонецПроцедуры

&НаКлиенте
// Процедура, обарботчик события команды "Развернуть"
//
Процедура Развернуть(Команда)
	
	Для а = 0 По ДеревоСостояний.ПолучитьЭлементы().Количество() - 1 Цикл
		Элементы.ДеревоСостояний.Развернуть(ДеревоСостояний.ПолучитьЭлементы()[а].ПолучитьИдентификатор());
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
// Процедура, выполняет заполнение табличной части
//
Процедура ЗаполнитьОбластиЗубнойФормулы(ДеревоСостояний)
	ТекущийОбъект = Объект.Ссылка.ПолучитьОбъект(); 
	ТекущийОбъект.ОбластиЗубнойФормулы.Очистить();
	Для Каждого СтрокаТЧ из ДеревоСостояний.ПолучитьЭлементы() Цикл		
		Если СтрокаТЧ.Принадлежит Тогда
			Для Каждого СтрокаДерева из СтрокаТЧ.ПолучитьЭлементы() Цикл
				Если СтрокаДерева.Принадлежит Тогда
					НоваяСтрока = ТекущийОбъект.ОбластиЗубнойФормулы.Добавить();
					НоваяСтрока.СостояниеЗубнойФормулы = СтрокаДерева.Состояние;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
	КонецЦикла;
	ТекущийОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_ВКЛАДКИ_МАТЕРИАЛЫ

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ТаблицаНормыСписанияМатериаловНСМНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметры     = Новый Структура();	
	МассивРазрешенныхТипов = Новый Массив;
	МассивРазрешенныхТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Материал"));
	
	СтруктураПараметры.Вставить("ОтборМассивРазрешенныхТипов", МассивРазрешенныхТипов); 
	СтруктураПараметры.Вставить("Заголовок"                  , "Выберите материал");	   
	СтруктураПараметры.Вставить("ВыбранныеЗначения"          , Элементы.ТаблицаНормыСписанияМатериалов.ТекущиеДанные.НСМНоменклатура);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаПодбораНоменклатуры",
	СтруктураПараметры,,,,,
	Новый ОписаниеОповещения("ТаблицаНормыСписанияМатериаловНСМНоменклатураНачалоВыбораЗавершение", ЭтотОбъект), 
	РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После выбора банковского счета
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ТаблицаНормыСписанияМатериаловНСМНоменклатураНачалоВыбораЗавершение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда
		Элементы.ТаблицаНормыСписанияМатериалов.ТекущиеДанные.НСМНоменклатура = РезультатВыбора.Номенклаутра;
		Элементы.ТаблицаНормыСписанияМатериалов.ТекущиеДанные.НСМУпаковка = Неопределено;
		Элементы.ТаблицаНормыСписанияМатериалов.ТекущиеДанные.ХарактеристикиИспользуются = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(РезультатВыбора, "ИспользоватьПартии");
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора" поле ввода "Упаковка"
//
Процедура ТаблицаНормыСписанияМатериаловНСМУпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыбратьУпаковкуНоменклатуры(ДанныеВыбора, СтандартнаяОбработка, Элементы.ТаблицаНормыСписанияМатериалов.ТекущиеДанные);

КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_ВКЛАДКИ_СЕРТИФИКАТ

&НаКлиенте
// При смене выбора типа номинала
Процедура ВидНоминалаПриИзменении(Элемент)
	Элементы.Номинал.Доступность = НЕ Объект.ВидНоминала;
	Объект.Номинал               = ?(Объект.ВидНоминала,0,Объект.Номинал);
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура СрокДействияПриИзменении(Элемент)
		
    УстановкаВидимостиПолейСертификата();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ВестиСерийныеНомераПриИзменении(Элемент)
	
	ЗаполнитьСписокВыбораСрокДействияСертификата();
	ЗаполнитьСписокВыбораВидаНоминалаСертификата();
	
	Элементы.СертификатМногоразовоеИспользование.Доступность = (Объект.ИспользоватьПартии = Истина);
	Элементы.ПерейтиНаСерииСертификатов.Видимость = Объект.ИспользоватьПартии;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "Нажатие"
//
Процедура Декорация1Нажатие(Элемент)
	
	Если Модифицированность Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ДекорацияНажатиеЗавершение", ЭтотОбъект), "Для выполнения данной операции необходимо записать элемент. Записать?", РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	ОткрытьСписоркПартийПоВладельцу(Объект.Ссылка);	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Декорация нажатие завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ДекорацияНажатиеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	Иначе
		Записать();
	КонецЕсли;

	ОткрытьСписоркПартийПоВладельцу(Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
// Процедура - Открыть списорк партий по владельцу
//
// Параметры:
//  Владелец - 	 - 
//
Процедура ОткрытьСписоркПартийПоВладельцу(Владелец)
	
	ПараметрыОткрытия = Новый Структура("Отбор", Новый Структура("Владелец",Владелец));
	ОткрытьФорму("Справочник.ПартииНоменклатуры.ФормаСписка", ПараметрыОткрытия, ,, Окно);
	
КонецПроцедуры

&НаСервере
// Процедура - Установка видимости полей сертификата
//
Процедура УстановкаВидимостиПолейСертификата()
	
	Если Объект.ТипСрокаДействия = Перечисления.СрокДействияПодарочныхСертификатов.БезОграниченияСрока ИЛИ НЕ ЗначениеЗаполнено(Объект.ТипСрокаДействия) Тогда
		Элементы.СтраницаСОграничениемНаДату.Видимость = Ложь;
		Элементы.СтраницаПериодПослеПродажи.Видимость = Ложь;
	ИначеЕсли Объект.ТипСрокаДействия = Перечисления.СрокДействияПодарочныхСертификатов.СОграничениемНаДату Тогда
		Элементы.СтраницаСОграничениемНаДату.Видимость = Истина;
		Элементы.СтраницаПериодПослеПродажи.Видимость = Ложь;
	ИначеЕсли Объект.ТипСрокаДействия = Перечисления.СрокДействияПодарочныхСертификатов.ПериодПослеПродажи Тогда
		Элементы.СтраницаСОграничениемНаДату.Видимость = Ложь;
		Элементы.СтраницаПериодПослеПродажи.Видимость = Истина;
	КонецЕсли;
	
	// Элементы.СтраницыСрокДействияСертификатов.Видимость = (Объект.ТипСрокаДействия = Перечисления.СрокДействияПодарочныхСертификатов.СОграничениемНаДату ИЛИ Объект.ТипСрокаДействия = Перечисления.СрокДействияПодарочныхСертификатов.ПериодПослеПродажи);
	Элементы.ПерейтиНаСерииСертификатов.Видимость = Объект.ИспользоватьПартии;	
	Элементы.СертификатМногоразовоеИспользование.Доступность = (Объект.ИспользоватьПартии = Истина);
	Элементы.Номинал.Доступность = НЕ Объект.ВидНоминала;
	
	Элементы.ГруппаСертификаты.Видимость = ?((ЗначениеЗаполнено(Объект.ТипНоменклатуры) и Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат), Истина, Ложь);			
	
КонецПроцедуры

&НаСервере
// Заполнить список выбора вида номинала сертификата
Процедура ЗаполнитьСписокВыбораВидаНоминалаСертификата()
	
	Элементы.ВидНоминала.СписокВыбора.Очистить();
	Элементы.ВидНоминала.СписокВыбора.Добавить(Ложь, "Фиксированный");
	Если Элементы.ВестиСерийныеНомера.Видимость И Объект.ИспользоватьПартии Тогда
		Элементы.ВидНоминала.СписокВыбора.Добавить(Истина, "Определяется при продаже");
	Иначе
		Объект.ВидНоминала = Ложь;
	КонецЕсли;
	Элементы.ВидНоминала.ОбновитьТекстРедактирования();
	Элементы.Номинал.Доступность = НЕ Объект.ВидНоминала;
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить список выбора срок действия сертификата
//
Процедура ЗаполнитьСписокВыбораСрокДействияСертификата()
	
	Элементы.СрокДействия.СписокВыбора.Очистить();
	Элементы.СрокДействия.СписокВыбора.Добавить(Перечисления.СрокДействияПодарочныхСертификатов.БезОграниченияСрока, "Без ограничения срока");
	Элементы.СрокДействия.СписокВыбора.Добавить(Перечисления.СрокДействияПодарочныхСертификатов.СОграничениемНаДату, "С ограничением на дату");
	Если Объект.ИспользоватьПартии Тогда
		Элементы.СрокДействия.СписокВыбора.Добавить(Перечисления.СрокДействияПодарочныхСертификатов.ПериодПослеПродажи, "Период после продажи");		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Таблица нормы списания материалов НСМПартия начало выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеВыбора		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ТаблицаНормыСписанияМатериаловНСМПартияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.ТаблицаНормыСписанияМатериалов.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.НСМНоменклатура) Тогда
		
		мПараметрыВыбора = Новый Структура;
		мПараметрыВыбора.Вставить("Владелец"          , СтрокаТабличнойЧасти.НСМНоменклатура);			
		мПараметрыВыбора.Вставить("Дата"              , ТекущаяДата());
	    мПараметрыВыбора.Вставить("МножественныйВыбор", Истина);

		ОписаниеОповещения = Новый ОписаниеОповещения("ТаблицаНормыСписанияМатериаловНСМПартияПослеВыбора", ЭтотОбъект, Новый Структура("СтрокаТабличнойЧасти", СтрокаТабличнойЧасти));
		ОткрытьФорму("Справочник.ПартииНоменклатуры.ФормаВыбора", мПараметрыВыбора,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Таблица нормы списания материалов НСМПартия после выбора
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ТаблицаНормыСписанияМатериаловНСМПартияПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	СтрокаТабличнойЧасти = ДополнительныеПараметры.СтрокаТабличнойЧасти;

	Если НЕ Результат = Неопределено Тогда
		СтрокаТабличнойЧасти.НСМПартия = Результат[0];
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события Нажатие реквизита История
//
Процедура ИсторияИзмененияЦеныНажатие(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(,"Элемент не записан. Открыть историю цен незаписанного элемента не возможно.", 20, "Невозможно открыть историю цен");
		Возврат;
	КонецЕсли;
	
	СтрокаДаных = ТаблицаЦенНоменклатуры.НайтиПоИдентификатору(Сред(Элемент.Имя, 13));
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Номенклатура"  , Объект.Ссылка);
	СтруктураПараметров.Вставить("ВидЦен"        , СтрокаДаных.ВидЦен);
	СтруктураПараметров.Вставить("Упаковка"      , СтрокаДаных.Упаковка);
	СтруктураПараметров.Вставить("ДеньНедели"    , СтрокаДаных.ДеньНедели);
	СтруктураПараметров.Вставить("ВремяНачала"   , СтрокаДаных.ВремяНачала);
	СтруктураПараметров.Вставить("ВремяОкончания", СтрокаДаных.ВремяОкончания);
	
	ПараметрыФормы = Новый Структура("Отбор, Видимость", СтруктураПараметров, Ложь);	
	ОткрытьФорму("РегистрСведений.ЦеныНоменклатуры.ФормаСписка", ПараметрыФормы,,,,, Новый ОписаниеОповещения("ИсторияИзмененияЦеныНажатиеЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры // ИсторияНажатие()

&НаКлиенте
// Процедура - История изменения цены нажатие завершение
// Завершение немодального открытия окна формы - Регистр сведений Цены номенклатуры - ФормаСписка
// Параметры:
//  Результат	 - 	 Результат Оповещения 
//  Параметры	 - 	 Параметры Оповещения 
//
Процедура ИсторияИзмененияЦеныНажатиеЗавершение(Результат, Параметры) Экспорт
	
	СформироватьБлокЦен();

КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить цену номенклатуры
//
// Параметры:
//  Номенклатура		 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЦенуНоменклатуры(Номенклатура, СтруктурнаяЕдиница = Неопределено)
	
	СтруктурнаяЕдиница = ?(СтруктурнаяЕдиница <> Неопределено, СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	СтруктураДанные = Новый Структура("ДатаОбработки, СтруктурнаяЕдиница, ВидЦен, СтавкаНДС, Упаковка, Номенклатура", 
		ТекущаяДата(), СтруктурнаяЕдиница, Справочники.ВидыЦен.Розничная, Номенклатура.СтавкаНДС, Справочники.УпаковкиНоменклатуры.ПустаяСсылка(), Номенклатура);
	
	Возврат Ценообразование.ПолучитьЦенуНоменклатуры(СтруктураДанные);
	
КонецФункции

&НаКлиенте
// Процедура проверяет, совпадало ли ранее полное наименование с наименованием,
// и присваивает соответствующее значение переменной мФормироватьНаименованиеПолноеАвтоматически.
//
// Параметры:
//  Нет.
//
Процедура УстановитьФлагФормироватьНаименованиеПолноеАвтоматически()
	ФормироватьНаименованиеПолноеАвтоматически = ?(Не ЗначениеЗаполнено(Объект.НаименованиеПолное) ИЛИ Объект.НаименованиеПолное = Объект.Наименование, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
// Процедура - Скрыть показать дополнительно
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СкрытьПоказатьДополнительно(Команда)
	Элементы.ГруппаДополнительно.Видимость = Не Элементы.ГруппаДополнительно.Видимость;
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить цену номенклатуры
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ДобавитьЦенуНоменклатуры(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда		
		Оповещение = Новый ОписаниеОповещения("ЦеныВопросОНеобходимостиЗаписатьОбъектЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, Нстр("ru='Предварительно необходимо записать номенклатуру. Продолжить ?'"), РежимДиалогаВопрос.ДаНет);		
		Возврат;                     		
	КонецЕсли;                       	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьЦенуЗавершение", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.ЦеныНоменклатуры.Форма.ФормаЗаписиИзменениеЦены", Новый Структура("ЗначенияЗаполнения", 
	Новый Структура("Номенклатура, ВидЦен", Объект.Ссылка, ПредопределенноеЗначение("Справочник.ВидыЦен.Розничная"))), ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
// Процедура - Вопрос о необходимости записать объект завершение
//
// Параметры:
//  Результат	 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура ЦеныВопросОНеобходимостиЗаписатьОбъектЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда		
		Если ЭтаФорма.Записать() = Истина Тогда 		
			ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьЦенуЗавершение", ЭтотОбъект);
			ОткрытьФорму("РегистрСведений.ЦеныНоменклатуры.Форма.ФормаЗаписиИзменениеЦены", Новый Структура("ЗначенияЗаполнения", 
			Новый Структура("Номенклатура, ВидЦен", Объект.Ссылка, ПредопределенноеЗначение("Справочник.ВидыЦен.Розничная"))), ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли;			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завршения добавления цены.
//
Процедура ДобавитьЦенуЗавершение(Результат, Параметры) Экспорт
	
	СформироватьБлокЦен();	
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет формирование блока цен.
//
Процедура СформироватьБлокЦен()	
		
	// . Удаляем элементы ранее созданные.
	Для Каждого СтрокаДанных из ТаблицаЦенНоменклатуры Цикл
		ИДСтрокиДанных = СтрокаДанных.ПолучитьИдентификатор();
		
		ЗаголовокЦены = Элементы.Найти("_ЗаголовокЦены_" + ИДСтрокиДанных);
		Если Не ЗаголовокЦены = Неопределено Тогда
			Элементы.Удалить(ЗаголовокЦены);			
		КонецЕсли;
		
		Элементы.Удалить(Элементы["_ВидЦен_"     + ИДСтрокиДанных]);
		Элементы.Удалить(Элементы["_Цена_"       + ИДСтрокиДанных]);
		Элементы.Удалить(Элементы["_ИсторияЦен_" + ИДСтрокиДанных]);
		
	КонецЦикла;		
	
	// Добавлено для БЕСПЛАТНО
	Элементы.ГруппаБесплатно.ЦветФона = ?(Объект.Бесплатно, Новый Цвет(135,206,250), Новый Цвет());
	Элементы.ГруппаПриПродаже.Видимость = НЕ Объект.Бесплатно;
	Элементы.ГруппаЦеныДобавить.Видимость = НЕ Объект.Бесплатно;      
		
	ТаблицаЦенНоменклатуры.Очистить();
	
	// Если услуга бесплатная, то мы не выводим блок цен.
	Если Объект.Бесплатно Тогда
		Возврат;
	КонецЕсли;  
	
	ТаблицаЦенНоменклатуры.Загрузить(РегистрыСведений.ЦеныНоменклатуры.ПолучитьЦеныНомеклатуры(Объект.Ссылка,,,ТекущаяДата(),, Ложь));
	
	НомерСтроки = 0;
	ЗаголовокЦены = ""; 
	Для Каждого СтрокаДанных из ТаблицаЦенНоменклатуры Цикл
		ИДСтрокиДанных = СтрокаДанных.ПолучитьИдентификатор();  		
		ГруппаНовыхЭл = Элементы.Найти("_ГруппаСтрокаЦены_" + ИДСтрокиДанных);
		Если ГруппаНовыхЭл = Неопределено Тогда		
			ГруппаНовыхЭл                      = Элементы.Вставить("_ГруппаСтрокаЦены_" + ИДСтрокиДанных, Тип("ГруппаФормы"), Элементы.Группа_Лаборатория_Скидки, Элементы.ГруппаЦеныДобавить);
			ГруппаНовыхЭл.Вид                  = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаНовыхЭл.Группировка          = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			ГруппаНовыхЭл.Отображение          = ОтображениеОбычнойГруппы.Нет;
			ГруппаНовыхЭл.ОтображатьЗаголовок  = Ложь;
		КонецЕсли;		
		
		ПолеНовогоЭлемента                          = Элементы.Добавить("_ВидЦен_" + ИДСтрокиДанных, Тип("ДекорацияФормы"), ГруппаНовыхЭл);
		ПолеНовогоЭлемента.Заголовок            = "" + СтрокаДанных.ВидЦен + ?(ЗначениеЗаполнено(СтрокаДанных.Упаковка), " (" + СтрокаДанных.Упаковка + ")", "");
		
		ПолеНовогоЭлемента.АвтоМаксимальнаяШирина   = Ложь;
		ПолеНовогоЭлемента.РастягиватьПоГоризонтали = Истина;
		ПолеНовогоЭлемента.МаксимальнаяШирина 	    = 39;		
		
		ПолеНовогоЭлемента                          = Элементы.Добавить("_Цена_" + ИДСтрокиДанных, Тип("ПолеФормы"), ГруппаНовыхЭл);													 
		ПолеНовогоЭлемента.Вид                      = ВидПоляФормы.ПолеВвода;
		ПолеНовогоЭлемента.ПоложениеЗаголовка       = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеНовогоЭлемента.Ширина                   = 9;
		ПолеНовогоЭлемента.КнопкаВыбора             = Ложь;
		ПолеНовогоЭлемента.РастягиватьПоГоризонтали = Ложь;
		ПолеНовогоЭлемента.ПутьКДанным              = "ТаблицаЦенНоменклатуры[" + НомерСтроки +"].Цена";
		ПолеНовогоЭлемента.УстановитьДействие("ПриИзменении", "ЦенаПриИзменении");
		
		ПолеНовогоЭлемента                          = Элементы.Добавить("_ИсторияЦен_" + ИДСтрокиДанных, Тип("ДекорацияФормы"), ГруппаНовыхЭл);
		ПолеНовогоЭлемента.Заголовок                = Нстр("ru = 'История'; en = 'History'");
		ПолеНовогоЭлемента.Гиперссылка              = Истина;
		ПолеНовогоЭлемента.УстановитьДействие("Нажатие", "ИсторияИзмененияЦеныНажатие");
		
		НомерСтроки = НомерСтроки + 1;      
				
	КонецЦикла;  	
			
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ЦенаПриИзменении(Элемент)
	 
	СтрокаДанных = ТаблицаЦенНоменклатуры.НайтиПоИдентификатору(Сред(Элемент.Имя,7));
	ВременноеЦенообразование = Новый Структура;
	ВременноеЦенообразование.Вставить("ДеньНедели", СтрокаДанных.ДеньНедели);
	ВременноеЦенообразование.Вставить("ВремяНачала", СтрокаДанных.ВремяНачала);
	ВременноеЦенообразование.Вставить("ВремяОкончания", СтрокаДанных.ВремяОкончания);
	ИзменитьЦенуПродажи(Объект.Ссылка, СтрокаДанных.ВидЦен, СтрокаДанных.Упаковка, СтрокаДанных.Цена, ВременноеЦенообразование);
	
КонецПроцедуры

&НаСервереБезКонтекста
// При изменении цены продажи на форме элемента установим ее.
//
Процедура ИзменитьЦенуПродажи(Номенклатура, ВидЦен, Упаковка, Цена, ВременноеЦенообразование)
		
	Справочники.Номенклатура.УстановитьЦенуНоменклатуры(Номенклатура, ВидЦен, Упаковка, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница, Цена, ВременноеЦенообразование);	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Материал характеристики нажатие
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура МатериалХарактеристикиНажатие(Элемент)
	
	Если Объект.Ссылка.Пустая() Тогда	
		
		Оповещение = Новый ОписаниеОповещения("ХарактеристикиВопросОНеобходимостиЗаписатьОбъектЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Предварительно необходимо записать номенклатуру. Продолжить ?", РежимДиалогаВопрос.ДаНет);		
		Возврат;    
		
	ИначеЕсли Модифицированность Тогда 
		Записать();
	КонецЕсли;	
	
	ПараметрыОткрытия  = Новый Структура("Отбор", Новый Структура("Владелец", Объект.Ссылка));
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьЗаголовокСерий", ЭтотОбъект);
	ОткрытьФорму("Справочник.ПартииНоменклатуры.ФормаСписка", ПараметрыОткрытия,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура, вопрос о необходимости записать объект завершение.
// 
// Параметры:
//  Результат	 - 	 - 
//  ДопПараметры - 	 - 
// 
Процедура ХарактеристикиВопросОНеобходимостиЗаписатьОбъектЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда		
		
		Если ЭтаФорма.Записать() Тогда
			
			ПараметрыОткрытия  = Новый Структура("Отбор", Новый Структура("Владелец", Объект.Ссылка));
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьЗаголовокСерий", ЭтотОбъект);
			ОткрытьФорму("Справочник.ПартииНоменклатуры.ФормаСписка", ПараметрыОткрытия,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Использовать партии при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ИспользоватьПартииПриИзменении(Элемент)
	Модифицированность = Истина;
	Элементы.МатериалХарактеристики.Видимость = Объект.ИспользоватьПартии;
КонецПроцедуры

&НаСервере
// Процедура, устанавливает заголовок.
// 
Процедура УстановитьЗаголовокСпискаСерий()
	
//	Элементы.СписокСерийныхНомеров.Заголовок = "Создать бланки";
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПартииНоменклатуры.Ссылка) КАК КоличествоСерий
		|ИЗ
		|	Справочник.ПартииНоменклатуры КАК ПартииНоменклатуры
		|ГДЕ
		|	ПартииНоменклатуры.Владелец = &Владелец");
		
		Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Выборка.Следующий();
		Если Выборка.КоличествоСерий > 0 Тогда
			// Элементы.СписокСерийныхНомеров.Заголовок   = "Всего "+Выборка.КоличествоСерий+" бланков сертификата";
			// Элементы.ЗапасХарактеристики.Заголовок	   = "Характеристики ("+Выборка.КоличествоСерий+")";
			Элементы.МатериалХарактеристики.Заголовок  = "Характеристики ("+Выборка.КоличествоСерий+")";
			// Элементы.ИмуществоХарактеристики.Заголовок = "Характеристики ("+Выборка.КоличествоСерий+")";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет завершение вызова формы.
// 
Процедура ОбновитьЗаголовокСерий(ДанныеВыбора, Элемент) Экспорт
	
	УстановитьЗаголовокСпискаСерий();	 	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуНабора(Команда)
	ДобавитьЭлементыФормыСоставНабора();
КонецПроцедуры

&НаСервере
// Процедура, добавляет элементы формы, для новой строки НС.
// 
Процедура ДобавитьЭлементыФормыСоставНабора(ИДСтрокиДанных = Неопределено)
	
	// Если это добавление элементов формы для новой строки данных
	СтрокаДанных = Неопределено;
	Если ИДСтрокиДанных <> Неопределено Тогда		
		СтрокаДанных  	= Объект.СоставНабора.НайтиПоИдентификатору(ИДСтрокиДанных);
	Иначе
		СтрокаДанных    = Объект.СоставНабора.Добавить();
		СтрокаДанных.СНКоличество = 1;		
		ИДСтрокиДанных  = СтрокаДанных.ПолучитьИдентификатор();
	КонецЕсли;
	
	ПерваяСтрока = ИДСтрокиДанных = 0;	
	
	ГруппаНовыхЭл = Неопределено;
	Если Элементы.Найти("ГруппаСтрокаСН_" + ИДСтрокиДанных) <> Неопределено Тогда		
		ГруппаНовыхЭл = Элементы.Найти("ГруппаСтрокаСН_" + ИДСтрокиДанных);
	Иначе
		ГруппаНовыхЭл                                   = Элементы.Вставить("ГруппаСтрокаСН_" + ИДСтрокиДанных, Тип("ГруппаФормы"), Элементы.ГруппаСоставНабора);// , Элементы.ГруппаДобавитьСтрокуНабора);
		ГруппаНовыхЭл.Вид                               = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаНовыхЭл.Группировка                       = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ГруппаНовыхЭл.Отображение                       = ОтображениеОбычнойГруппы.Нет;
		ГруппаНовыхЭл.ОтображатьЗаголовок               = Ложь;
	КонецЕсли;
	
	// Добавляем поле номенклатура
	ПолеНовогоЭлемента                      = Элементы.Добавить("НоменклатураСН_" + ИДСтрокиДанных, Тип("ПолеФормы"), ГруппаНовыхЭл);
	ПолеНовогоЭлемента.Заголовок            = "Услуга";
	ПолеНовогоЭлемента.Вид                  = ВидПоляФормы.ПолеВвода;
	ПолеНовогоЭлемента.ПутьКДанным          = "Объект.СоставНабора[" + (СтрокаДанных.НомерСтроки-1) +"].СННоменклатура";
	ПолеНовогоЭлемента.ПоложениеЗаголовка   = ?(ПерваяСтрока, ПоложениеЗаголовкаЭлементаФормы.Верх, ПоложениеЗаголовкаЭлементаФормы.Нет);
	ПолеНовогоЭлемента.КнопкаВыпадающегосписка = Ложь;
	ПолеНовогоЭлемента.КнопкаВыбора			= Истина;
	ПолеНовогоЭлемента.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	ПолеНовогоЭлемента.ВыбиратьТип        	= Ложь;
	ПолеНовогоЭлемента.РастягиватьПоГоризонтали = Истина;
	ПолеНовогоЭлемента.АвтоОтметкаНезаполненного = Истина;
	ПолеНовогоЭлемента.ШрифтЗаголовка = Новый Шрифт("Arial",10,,Истина);
	ПолеНовогоЭлемента.АвтоМаксимальнаяШирина = Ложь;
	ПолеНовогоЭлемента.МаксимальнаяШирина 	= 36;	
	ПолеНовогоЭлемента.УстановитьДействие("НачалоВыбора", "СННоменклатураНачалоВыбора_Подключаемый");		
	
	// Добавляем поле количество
	ПолеНовогоЭлемента                      = Элементы.Добавить("КоличествоСН_" + ИДСтрокиДанных, Тип("ПолеФормы"), ГруппаНовыхЭл);
	ПолеНовогоЭлемента.Вид                  = ВидПоляФормы.ПолеВвода;
	ПолеНовогоЭлемента.ПутьКДанным          = "Объект.СоставНабора[" + (СтрокаДанных.НомерСтроки-1) +"].СНКоличество";
	ПолеНовогоЭлемента.ПоложениеЗаголовка   = ?(ПерваяСтрока, ПоложениеЗаголовкаЭлементаФормы.Верх, ПоложениеЗаголовкаЭлементаФормы.Нет);
	ПолеНовогоЭлемента.КнопкаВыпадающегосписка = Ложь;
	ПолеНовогоЭлемента.Заголовок               = "Кол-во";
	ПолеНовогоЭлемента.КнопкаВыбора			   = Ложь;
	ПолеНовогоЭлемента.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.Авто;
	ПолеНовогоЭлемента.ВыбиратьТип        	= Ложь;
	ПолеНовогоЭлемента.РастягиватьПоГоризонтали = Ложь;
	ПолеНовогоЭлемента.Ширина = 6;
	ПолеНовогоЭлемента.АвтоОтметкаНезаполненного = Истина;	
	ПолеНовогоЭлемента.ШрифтЗаголовка = Новый Шрифт("Arial",10,,Истина);
	ПолеНовогоЭлемента.Формат = "ЧДЦ=0";
	ПолеНовогоЭлемента.ФорматРедактирования = "ЧДЦ=0";
	
	ГруппаКомандыУдалить = Неопределено;
	Если Элементы.Найти("ГруппаКомандаУдалитьСН_" + ИДСтрокиДанных) <> Неопределено Тогда		
		ГруппаКомандыУдалить = Элементы.Найти("ГруппаКомандаУдалитьСН_" + ИДСтрокиДанных);
	Иначе
		ГруппаКомандыУдалить                                   = Элементы.Вставить("ГруппаКомандаУдалитьСН_" + ИДСтрокиДанных, Тип("ГруппаФормы"), ГруппаНовыхЭл);
		ГруппаКомандыУдалить.Вид                               = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаКомандыУдалить.Группировка                       = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаКомандыУдалить.Отображение                       = ОтображениеОбычнойГруппы.Нет;
		ГруппаКомандыУдалить.ОтображатьЗаголовок               = Ложь;
	КонецЕсли;
	
	Если ПерваяСтрока Тогда
		ПолеНовогоЭлемента = Элементы.Добавить("ЗаглушкаУдалитьСН", Тип("ДекорацияФормы"), ГруппаКомандыУдалить);
	КонецЕсли;
	
	// Кнопка удаления строки занятия	
	КнопкаУдаленияВремениПроведения                 = Элементы.Добавить("УдалитьСН_" + ИДСтрокиДанных, Тип("КнопкаФормы"), ГруппаКомандыУдалить);
	КнопкаУдаленияВремениПроведения.Отображение     = ОтображениеКнопки.Картинка;
	КнопкаУдаленияВремениПроведения.ОтображениеФигуры 	= ОтображениеФигурыКнопки.Нет;
	КнопкаУдаленияВремениПроведения.ИмяКоманды      = "УдалитьСтрокуНабора";	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора".
// 
Процедура СННоменклатураНачалоВыбора_Подключаемый(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметры     = Новый Структура();	
	МассивРазрешенныхТипов = Новый Массив;
	МассивРазрешенныхТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"));
	
	ИДСтрокиДанных = ИдентификаторСтрокиДанныхПоИмениЭлемента(Элемент.Имя);	
	ТекущиеДанные = Объект.СоставНабора.НайтиПоИдентификатору(ИДСтрокиДанных);
	
	СтруктураПараметры.Вставить("ОтборМассивРазрешенныхТипов", МассивРазрешенныхТипов); 
	СтруктураПараметры.Вставить("Заголовок"                  , "Выберите услугу");	   
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НоменклатураНачалоВыбораЗавершение", ЭтаФорма, Элемент);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаПодбораНоменклатуры", СтруктураПараметры,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры
&НаКлиенте
// Процедура, выполняет завершение выбора номенклатуры. 
// 
Процедура НоменклатураНачалоВыбораЗавершение(ДанныеВыбора, Элемент) Экспорт
	
	Если ЗначениеЗаполнено(ДанныеВыбора) Тогда
		ИДСтрокиДанных = ИдентификаторСтрокиДанныхПоИмениЭлемента(Элемент.Имя);	
		ТекущиеДанные = Объект.СоставНабора.НайтиПоИдентификатору(ИДСтрокиДанных);
		ТекущиеДанные.СННоменклатура = ДанныеВыбора.Номенклатура;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Удалить строку набора
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура УдалитьСтрокуНабора(Команда)
	
	ИДСтрокиДанных = ИдентификаторСтрокиДанныхПоИмениЭлемента(ЭтаФорма.ТекущийЭлемент.Имя);	
	УдалитьЭлементыФормыСоставНабора(ИДСтрокиДанных);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает идентификатор строки данных по имени элемента.
// 
Функция ИдентификаторСтрокиДанныхПоИмениЭлемента(ИмяЭлемента)
	
	НомерСимвола = Найти(ИмяЭлемента,"_");
	Возврат Число(Прав(ИмяЭлемента,СтрДлина(ИмяЭлемента) - НомерСимвола)); 
	
КонецФункции

&НаСервере
// Процедура, удаляет элементы формы связанные с нормами списания.
// 
Процедура УдалитьЭлементыФормыСоставНабора(ИДСтрокиДанных)
	
	// Ищем строку в данных по ИД
	СтрокаДанных = Объект.СоставНабора.НайтиПоИдентификатору(ИДСтрокиДанных);	
	Если СтрокаДанных <> Неопределено Тогда
		
		// Удаляем элементы
		Для Каждого СтрокаТЗ Из Объект.СоставНабора Цикл
			Элементы.Удалить(Элементы["НоменклатураСН_" + СтрокаТЗ.ПолучитьИдентификатор()]);
			Элементы.Удалить(Элементы["КоличествоСН_" + СтрокаТЗ.ПолучитьИдентификатор()]);			
			Элементы.Удалить(Элементы["УдалитьСН_" + СтрокаТЗ.ПолучитьИдентификатор()]);
			Элементы.Удалить(Элементы["ГруппаКомандаУдалитьСН_" + СтрокаТЗ.ПолучитьИдентификатор()]);
			Элементы.Удалить(Элементы["ГруппаСтрокаСН_" + СтрокаТЗ.ПолучитьИдентификатор()]);
		КонецЦикла;
		
		// Удалить строку из данных
		Объект.СоставНабора.Удалить(СтрокаДанных);
		
		// Создаем элементы взамен удаленных на пред. этапе	  
		Для Каждого СтрокаТЗ Из Объект.СоставНабора Цикл
			ДобавитьЭлементыФормыСоставНабора(СтрокаТЗ.ПолучитьИдентификатор());				
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Бесплатно(Команда)
	Объект.Бесплатно = НЕ Объект.Бесплатно;
	СформироватьБлокЦен();
	ЭтаФорма.Модифицированность = Истина;		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - Открыть группу с деревом услуг
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура ОткрытьГруппуСДеревомУслуг(Команда)
	
	Элементы.ГруппаДеревоУслуг.Показать();

КонецПроцедуры

// Процедура - Удалить описание
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура УдалитьОписание(Команда)
	Объект.ОписаниеДляОнлайнЗаписи = Неопределено;
КонецПроцедуры

// Процедура - Редактировать состав свойств
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура РедактироватьСоставСвойств(Команда)
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, выполянет создание дерева структурных единиц.
// 
Процедура СоздатьДеревоСтруктурныхЕдиниц(УстановитьФлагиВИстину = Неопределено)
	
	ОбработкаТабличныхЧастейКлиент.СоздатьДеревоСтруктурныхЕдиниц(ЭтаФорма, "ОнлайнЗапись", Объект.Ссылка, УстановитьФлагиВИстину,,,,, Истина);

КонецПроцедуры

&НаСервере
// Функция, определяет, доступна ли номенклатура для онлайн записи.
// 
Функция НоменклатураДоступнаДляОнлайнЗаписи()
	
	Возврат Справочники.Номенклатура.НоменклатураДоступнаДляОнлайнЗаписи(ЭтотОбъект.ПодборСтруктурныеЕдиницы);
	
КонецФункции

&НаСервере
// Процедура, заполняет дерево услуг.
// 
Процедура ЗаполнитьДеревоУслуг(НеобходимоЗаписатьОбъектВРегистр = Ложь)
	
	Если НеобходимоЗаписатьОбъектВРегистр Тогда
		МассивСтруктурныхЕдиниц = Новый Массив;
		МассивСтруктурныхЕдиниц.Добавить(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
		РегистрыСведений.РеквизитыОбъектов.СоздатьЗаписиВРегистреРеквизитыОбъектов(
			Объект.Ссылка, МассивСтруктурныхЕдиниц, "ОнлайнЗапись", Истина);
	КонецЕсли;
	
	Справочники.Номенклатура.ЗаполнитьДеревоНоменклатур(Объект, ЭтотОбъект.ДеревоУслуг);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает массив структурных единиц.
// 
Функция ВернутьМассивСтруктурныхЕдиниц()
	
	Возврат Справочники.СтруктурныеЕдиницы.ВернутьМассивСтруктурныхЕдиниц();
	
КонецФункции

#Область ОбработчикиИзмененияНастроекОнлайнЗаписи

&НаКлиенте
Процедура ОнлайнЗаписьПриИзменении(Элемент)
	
	ОнлайнЗаписьПриИзмененииНаСервере();
	ЭтаФорма.Модифицированность = Истина;

КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПриИзменении" на сервере.
// 
Процедура ОнлайнЗаписьПриИзмененииНаСервере()
	
	ЭтоУслуга = (Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга);
	
	Элементы.ГруппаНастройкаОнлайнЗаписи.Видимость    = ЭтотОбъект.ОнлайнЗапись И ВернутьМассивСтруктурныхЕдиниц().Количество() > 1;
	Элементы.ГруппаНастройкиОнлайнЗаписи.Видимость    = ЭтотОбъект.ОнлайнЗапись;
	Элементы.ОписаниеДляОнлайнЗаписи.Видимость        = ЭтотОбъект.ОнлайнЗапись;
	Элементы.ГруппаОнлайнЗаписиИДеревоУслуг.Видимость = ЭтотОбъект.ОнлайнЗапись;
    Элементы.ГруппаОнлайнЗаписи.Видимость		   	  = ЭтотОбъект.ОнлайнЗапись;
	Если ЭтотОбъект.ОнлайнЗапись Тогда
		СоздатьДеревоСтруктурныхЕдиниц(Истина);
		ЗаполнитьДеревоУслуг();
	Иначе
		ОбработкаТабличныхЧастейКлиент.УстановитьНачальноеСостояниеФлагов(
			ЭтотОбъект.ПодборСтруктурныеЕдиницы.ПолучитьЭлементы(), 
			Неопределено, Неопределено, Ложь);
	КонецЕсли;
	ВывестиСсылкуНаТоварИЛИУслугу();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "Выбор".
// 
Процедура ДеревоУслугВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоУслуг.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ПереместитьВверх = (Поле = Элементы.ПереместитьВверх);
		ПереместитьВниз  = (Поле = Элементы.ПереместитьВниз);
		
		Если ПереместитьВверх ИЛИ ПереместитьВниз Тогда
			
			СтрокаРодитель = Неопределено;
			
			Если ЗначениеЗаполнено(ТекущиеДанные.Родитель) Тогда	
				
				ПолучитьСтрокуРодительРекурсивно(ТекущиеДанные.Родитель, ДеревоУслуг, СтрокаРодитель);
				Если СтрокаРодитель = Неопределено Тогда
					Возврат;
				КонецЕсли;
				
			Иначе
				СтрокаРодитель = ЭтотОбъект.ДеревоУслуг;
			КонецЕсли;
			
			ЭлементыРодителя = СтрокаРодитель.ПолучитьЭлементы();
			ТекущийИндекс    = ЭлементыРодителя.Индекс(ТекущиеДанные);
			
			Если ТекущийИндекс = 0 И ПереместитьВверх ИЛИ ТекущийИндекс = ЭлементыРодителя.Количество() - 1 И ПереместитьВниз Тогда
				Возврат;
			КонецЕсли;
			
			ПоследнийИндекс = ?(ЭлементыРодителя.Количество() - 1 >= ТекущийИндекс + 1, ТекущийИндекс + 1, ТекущийИндекс);
			
			Для Индекс = 0 По ПоследнийИндекс Цикл
				
				Если Индекс = ТекущийИндекс Тогда
					
					Услуга 				  = ЭлементыРодителя[Индекс].Услуга;
					НовыйИндексСортировки = ?(ПереместитьВверх, Индекс - 1, Индекс + 1) + 1;
					ЭлементыРодителя[Индекс].ИндексСортировки = НовыйИндексСортировки;
					
					ЭлементыРодителя.Сдвинуть(ТекущийИндекс, ?(ПереместитьВверх, -1, 1));
					
					ДобавитьЗаписьИзменений(Услуга, НовыйИндексСортировки);
					
				ИначеЕсли ПереместитьВверх И Индекс = ТекущийИндекс - 1 Тогда
					
					ЭлементыРодителя[Индекс].ИндексСортировки = ЭлементыРодителя[Индекс].ИндексСортировки + 1;
					ДобавитьЗаписьИзменений(ЭлементыРодителя[Индекс].Услуга, ЭлементыРодителя[Индекс].ИндексСортировки);
					
				ИначеЕсли ПереместитьВниз И Индекс = ТекущийИндекс + 1 Тогда
					
					ЭлементыРодителя[Индекс - 1].ИндексСортировки = ЭлементыРодителя[Индекс].ИндексСортировки - 1;
					ДобавитьЗаписьИзменений(ЭлементыРодителя[Индекс - 1].Услуга, ЭлементыРодителя[Индекс - 1].ИндексСортировки);
					
				ИначеЕсли ЭлементыРодителя[Индекс].ИндексСортировки <> Индекс + 1 Тогда
					
					ЭлементыРодителя[Индекс].ИндексСортировки = Индекс + 1;
					ДобавитьЗаписьИзменений(ЭлементыРодителя[Индекс].Услуга, Индекс + 1);
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЭтотОбъект.ТаблицаИзменяемыхНоменклатур.Количество() > 0 Тогда
				ЗаписатьИзмененияСпискаНоменклатурДляОнлайнЗаписи();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, добавляет в таблицу записи с индексами сотрировки.
// 
Процедура ДобавитьЗаписьИзменений(Услуга, ИндексСортировки)
	
	Если Объект.Ссылка = Услуга Тогда
		Объект.ИндексСортировки 			 = ИндексСортировки;
		ЗаписатьИндексСортировкиНоменклатуры = Истина;
	Иначе
		
		МассивСтрок = ЭтотОбъект.ТаблицаИзменяемыхНоменклатур.НайтиСтроки(Новый Структура("Услуга", Услуга));
		
		СтрокаТаблицы = ?(МассивСтрок.Количество() > 0, МассивСтрок[0], ЭтотОбъект.ТаблицаИзменяемыхНоменклатур.Добавить());
		СтрокаТаблицы.Услуга 		   = Услуга;
		СтрокаТаблицы.ИндексСортировки = ИндексСортировки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Функция - Получить строку родитель рекурсивно
//
// Параметры:
//  ТекущиеДанныеРодитель	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Процедура ПолучитьСтрокуРодительРекурсивно(ТекущиеДанныеРодитель, ДеревоУслугНом, СтрокаДереваНом)
	
	Для Каждого СтрокаДерева Из ДеревоУслугНом.ПолучитьЭлементы() Цикл				
				
		Если СтрокаДерева.ЭтоГруппа Тогда
			ПолучитьСтрокуРодительРекурсивно(ТекущиеДанныеРодитель, СтрокаДерева, СтрокаДереваНом);
		Иначе
			Прервать;
		КонецЕсли;
		
		Если СтрокаДереваНом <> Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Если СтрокаДерева.Услуга = ТекущиеДанныеРодитель Тогда
			СтрокаДереваНом = СтрокаДерева;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
// Процедура, записывает в номенклатуры индексы сортировки.
// 
Процедура ЗаписатьИзмененияСпискаНоменклатурДляОнлайнЗаписи()
	
	Для Каждого СтрокаТЧ Из ЭтотОбъект.ТаблицаИзменяемыхНоменклатур Цикл
		
		Попытка
			УслугаОбъект = СтрокаТЧ.Услуга.ПолучитьОбъект();
			УслугаОбъект.ИндексСортировки = СтрокаТЧ.ИндексСортировки;
			УслугаОбъект.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОнлайнЗаписиПриИзменении(Элемент)
	
	Объект.ИндексСортировки = 0;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И ЭтотОбъект.ОнлайнЗапись Тогда
		ЗаполнитьДеревоУслуг(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Скопировать в буфер
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СкопироватьВБуфер(Команда)
	ОбщегоНазначенияКлиент.УстановитьТекстВБуферОбмена(Элементы.СсылкаНаТоварУслугу.Заголовок);
КонецПроцедуры

&НаКлиенте
// Процедура - Ссылка на сотрудника нажатие
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура СсылкаНаТоварНажатие(Элемент)
	ПерейтиПоНавигационнойСсылке(Элементы.СсылкаНаТоварУслугу.Заголовок);
КонецПроцедуры

&НаКлиенте 
// Процедура - обработчик события "НачалоВыбора"
//
Процедура НоменклатураМедицинскихУслугНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("НоменклатураМедицинскихУслугНачалоВыбораЗавершение", ЭтаФорма);
	ОткрытьФорму("Справочник.КлассификаторНоменклатурыМедицинскихУслуг.Форма.ФормаВыбора",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "НачалоВыбораЗавершение"
//
Процедура НоменклатураМедицинскихУслугНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.НоменклатураМедицинскихУслуг = Результат;
	Если ЗначениеЗаполнено(Объект.НоменклатураМедицинскихУслуг) Тогда
		Объект.КодНоменклатурыМедицинскиУслуг = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.НоменклатураМедицинскихУслуг, "Код");
		Объект.УЕТ = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.НоменклатураМедицинскихУслуг, "УЕТ");
	КонецЕсли;
    ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
// 
Процедура НормаВремениПриИзменении(Элемент)
	
	Число = 0;
	Если НЕ ЭтотОбъект.НормаВремени = "0" Тогда
		
		Попытка
			Если ЗначениеЗаполнено(ЭтотОбъект.НормаВремени) Тогда
				Число = Число(ЭтотОбъект.НормаВремени);
			Иначе
				Число = 0;
			КонецЕсли;
			
		Исключение
			ЭтотОбъект.НормаВремени = "0";
		КонецПопытки;
		
	КонецЕсли;
	
	Объект.НормаВремени = Число;

	Модифицированность = Истина;
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Упаковка по умолчанию создание
//
// Параметры:
//  Элемент				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура УпаковкаПоУмолчаниюСоздание(Элемент, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		СтандартнаяОбработка = Ложь;
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаписатьОбъект", ЭтотОбъект, "Упаковка");
		ПоказатьВопрос(ОписаниеОповещения, 
					   "Номенклатура не записана." + Символы.ПС + "Выбор упаковки возможен после записи данных."+ Символы.ПС + "Записать?",
					   РежимДиалогаВопрос.ОКОтмена); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Записать объект
//
// Параметры:
//  РезультатВопроса - 	 - 
//  Параметры		 - 	 - 
//
Процедура ЗаписатьОбъект(РезультатВопроса, Параметры)  Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.ОК  Тогда
		Если ЭтаФорма.Записать() Тогда
			Если Параметры = "Упаковка" Тогда 
				
				СтруктураЗаполнения = Новый Структура;
				СтруктураЗаполнения.Вставить("ЗначенияЗаполнения",  Новый Структура("Владелец", Объект.Ссылка));
				
				ОткрытьФорму("Справочник.УпаковкиНоменклатуры.Форма.ФормаЭлемента", 
							 СтруктураЗаполнения, 
							 ЭтаФорма); 
				
			КонецЕсли; 
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
// Процедура, обновляет элементы дополнительных реквизитов.
//
Процедура ОбновитьДополнительныеРеквизиты()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры // ОбновитьЭлементыДополнительныхРеквизитов()

#КонецОбласти
