
#Область ОбработчикиСобытийФормы

&НаСервере 
// Процедура, Обработчик события "ПриСозданииНаСервере" 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПроцентСкидки") Тогда
		ПроцентСкидкиИзДокумента = Параметры.ПроцентСкидки;
		ИзФормыДокумента = Истина;
	КонецЕсли; 
	
	Если Параметры.Свойство("МаксимальнаяРучнаяСкидка") Тогда
		МаксимальнаяРучнаяСкидка = Параметры.МаксимальнаяРучнаяСкидка;
		
	КонецЕсли;
		
КонецПроцедуры   

&НаКлиенте
// Процедура, Обработчик события "ПриОткрытии" 
//
Процедура ПриОткрытии(Отказ)
	
	Если ИзФормыДокумента Тогда 	
		ПроцентСкидки = ПроцентСкидкиИзДокумента;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды "Ввести"
//
Процедура Ввести(Команда)

	Если МаксимальнаяРучнаяСкидка <> 0 И ПроцентСкидки > МаксимальнаяРучнаяСкидка Тогда	
		
		ОбщегоНазначения.СообщитьПользователю("Максимальная ручная скидка составляет " + МаксимальнаяРучнаяСкидка + " %");
		Возврат;
	КонецЕсли;
		
	СтруктураЗаполненияСкидки = Новый Структура();
	СтруктураЗаполненияСкидки.Вставить("ПроцентСкидки", ПроцентСкидки);
	СтруктураЗаполненияСкидки.Вставить("ЗаполнитьВсеСтроки", Настройка_ЗаполнитьВсеСтроки);
	
	ОповеститьОВыборе(СтруктураЗаполненияСкидки);
	
КонецПроцедуры  

#КонецОбласти






