#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик создания фрмы на сервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	  
	
	ИдентификаторПоля = Параметры.ИдентификаторПоля;
	СписокИсторииВвода = СохранениеВводимыхЗначений.ПолучитьСписокЗначенийИсторииВвода(ИдентификаторПоля);
	Если СписокИсторииВвода <> Неопределено Тогда		
		Для Каждого ЭлементСпискаИсторииВыбора Из СписокИсторииВвода Цикл			
			НоваяСтрока        = Кэш.Добавить();
			НоваяСтрока.Строка = ЭлементСпискаИсторииВыбора.Значение;			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Обработчик перед удалением значения
Процедура КэшПередУдалением(Элемент, Отказ)	
	СохранениеВводимыхЗначений.УдалаитьЗначениеИзИсторииввода(ИдентификаторПоля,Элементы.Кэш.ТекущиеДанные.Строка);	
КонецПроцедуры

&НаКлиенте
// Обработчик добавления строки
Процедура КэшПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)	  
	
	Если НоваяСтрока И ЗначениеЗаполнено(Элементы.Кэш.ТекущиеДанные.Строка) Тогда			
		СохранениеВводимыхЗначений.ДобавитьЗначениеВИсториюВвода(ИдентификаторПоля,Элементы.Кэш.ТекущиеДанные.Строка);	 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КэшВыборЗначения(Элемент, Значение, СтандартнаяОбработка)    
	
   СтандартнаяОбработка = Ложь;
   
КонецПроцедуры

&НаКлиенте
Процедура КэшВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
  СтандартнаяОбработка = Ложь;
  Закрыть(Элемент.ТекущиеДанные.Строка);    

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьИЗакрыть(Команда)    
	
	Если Элементы.Кэш.ТекущиеДанные <> Неопределено Тогда
		Закрыть(Элементы.Кэш.ТекущиеДанные.Строка);
	КонецЕсли;   
	
КонецПроцедуры

#КонецОбласти


