
#Область СлужебныеПроцедурыИФункции

// Функция осуществляет закрытие ранее открытого чека.
//
Функция ЗакрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаОплат, ВыходныеПараметры) Экспорт
	
	Результат = Истина;
	СтрокаЛога = "";
	
	СуммаНаличнойОплаты     = 0;
	СуммаБезналичнойОплаты1 = 0;
	СуммаБезналичнойОплаты2 = 0;
	
	Для ИндексОплаты = 0 По ТаблицаОплат.Количество() - 1 Цикл
		Если ТаблицаОплат[ИндексОплаты][0].Значение = 0 Тогда
			СуммаНаличнойОплаты = СуммаНаличнойОплаты + ТаблицаОплат[ИндексОплаты][1].Значение;
		ИначеЕсли ТаблицаОплат[ИндексОплаты][0].Значение = 1 Тогда
			СуммаБезналичнойОплаты1 = СуммаБезналичнойОплаты1 + ТаблицаОплат[ИндексОплаты][1].Значение;
		Иначе
			СуммаБезналичнойОплаты2 = СуммаБезналичнойОплаты2 + ТаблицаОплат[ИндексОплаты][1].Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ПараметрыПодключения.ЧекОткрыт Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Чек не был открыт'"));
		Результат = Ложь;
	Иначе
		Если ПараметрыПодключения.ФискальныйЧек Тогда
			СтрокаЛога = СтрокаЛога + НСтр("ru='ИТОГО'") + ": " + Формат(ПараметрыПодключения.ИтогЧека, "ЧЦ=15; ЧДЦ=2; ЧН=0; ЧГ=0") + Символы.ПС;
			СтрокаЛога = СтрокаЛога + НСтр("ru='Оплачено наличными'") + ": "      + СуммаНаличнойОплаты + Символы.ПС;
			СтрокаЛога = СтрокаЛога + НСтр("ru='Оплачено безналичными 1'") + ": " + СуммаБезналичнойОплаты1 + Символы.ПС;
			СтрокаЛога = СтрокаЛога + НСтр("ru='Оплачено безналичными 2'") + ": " + СуммаБезналичнойОплаты2 + Символы.ПС;
			СтрокаЛога = СтрокаЛога + НСтр("ru='Сдача'") + ": "
			+ Строка(СуммаНаличнойОплаты
			+ СуммаБезналичнойОплаты1
			+ СуммаБезналичнойОплаты2
			- ПараметрыПодключения.ИтогЧека) + Символы.ПС;
		КонецЕсли;
		СтрокаЛога = СтрокаЛога + "===== "
		+ ?(ПараметрыПодключения.ФискальныйЧек,
		НСтр("ru='Закрытие фискального чека'"),
		НСтр("ru='Закрытие нефискального чека'"))
		+ " =====" + Символы.ПС;
		ПараметрыПодключения.ЧекОткрыт = Ложь;
		
		ТабДок = Параметры.ТабличныйДокумент;
		Макет  = Параметры.Макет;
		ОблИтого         = Макет.ПолучитьОбласть("ИнформацияИтого");
		ОблПодвал        = Макет.ПолучитьОбласть("Подвал");
		
		ОблИтого.Параметры.Всего = Формат(ПараметрыПодключения.ИтогЧека, "ЧЦ=15; ЧДЦ=2; ЧН=0; ЧГ=0");
		ОблИтого.Параметры.ОплатаНал    = СуммаНаличнойОплаты + СуммаБезналичнойОплаты1 + СуммаБезналичнойОплаты2;
		// ОблИтого.Параметры.ОплатаБезНал = СуммаБезналичнойОплаты1;
		ОблИтого.Параметры.СуммаСдачи = СуммаНаличнойОплаты + СуммаБезналичнойОплаты1 + СуммаБезналичнойОплаты2 - ПараметрыПодключения.ИтогЧека;
		ТабДок.Вывести(ОблИтого);
		
		Для Каждого СтрокаПодвала Из Параметры.ТаблицаПодвалЧека Цикл
			ОблПодвал.Параметры.ТекстПодвала = СокрЛП(СтрокаПодвала);
			ТабДок.Вывести(ОблПодвал);
		КонецЦикла;
		
		ТабДок.ПолеСверху = 0.5;
		ТабДок.ПолеСнизу  = 0.5;
		ТабДок.ПолеСлева  = 0.1;
		ТабДок.ПолеСправа = 0.1;
		ТабДок.РазмерКолонтитулаСверху = 0.5;
		ТабДок.РазмерКолонтитулаСнизу = 0.5;	
		
	КонецЕсли;
	
	ПараметрыПодключения.СтрокаЛога = ПараметрыПодключения.СтрокаЛога + СтрокаЛога;
	Возврат Результат;
	
КонецФункции

// Функция осуществляет печать фискальной строки.
//
Функция НапечататьФискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения,
	Наименование, Количество, Цена, ПроцентСкидки, Сумма,
	НомерСекции, СтавкаНДС, ВыходныеПараметры)  Экспорт
	
	Результат = Истина;
	СтрокаЛога = "";
	
	Если Не ПараметрыПодключения.ЧекОткрыт Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Чек не был открыт'"));
		Результат = Ложь;
	Иначе
		
		ТабДок = Параметры.ТабличныйДокумент;
		Макет  = Параметры.Макет;
		
		ОблТовара        = Макет.ПолучитьОбласть("ИнформацияОТоваре");
		ОблСумма         = Макет.ПолучитьОбласть("ИнформацияПоСумме");
		ОблСкидка        = Макет.ПолучитьОбласть("ИнформацияПоСкидке");
		
		
		// Печать строки чека
		СтрокаЛога = ".............................." + Символы.ПС;
		СтрокаЛога = СтрокаЛога + Наименование + Символы.ПС;
		СтрокаЛога = СтрокаЛога + Строка(Количество) + " * " + Строка(Цена) + " = " + Формат(Количество*Цена, "ЧЦ=15; ЧДЦ=2; ЧН=0; ЧГ=0") + Символы.ПС;
		
		СкидкаНаценка = Сумма - Цена*Количество;
		
		ПроцентСкидки = Окр(СкидкаНаценка * -1/(Цена*Количество) * 100, 2, РежимОкругления.Окр15как20);		
		Если СкидкаНаценка < 0 Тогда		
			СтрокаЛога = СтрокаЛога + НСтр("ru='Скидка'") + ": " + Формат(-СкидкаНаценка, "ЧЦ=15; ЧДЦ=2; ЧН=0; ЧГ=0")
			+ " (" + ПроцентСкидки + "%)" + Символы.ПС;
		ИначеЕсли СкидкаНаценка > 0 Тогда			   
			СтрокаЛога = СтрокаЛога + НСтр("ru='Наценка'") + ": " + Формат(СкидкаНаценка, "ЧЦ=15; ЧДЦ=2; ЧН=0; ЧГ=0")
			+ " (" + ПроцентСкидки + "%)" + Символы.ПС;
		КонецЕсли;
		СтрокаЛога = СтрокаЛога + НСтр("ru='Отдел'") + ": №" + НомерСекции + Символы.ПС;
		Если СтавкаНДС > 0 Тогда
			СтрокаЛога = СтрокаЛога + НСтр("ru='НДС'") + ": " + СтавкаНДС + "%" + Символы.ПС;
		КонецЕсли;
		СтрокаЛога = СтрокаЛога + ".............................." + Символы.ПС;
		ПараметрыПодключения.ИтогЧека = ПараметрыПодключения.ИтогЧека + Сумма;
		
		//////////////////////////////////////
		ОблТовара.Параметры.Товар = СокрЛП(Наименование);
		ТабДок.Вывести(ОблТовара);
		ОблСумма.Параметры.ТекстСуммы = Строка(Количество) + " * " + Формат(Цена, "ЧЦ=12; ЧДЦ=2; ЧН=0; ЧГ=0") + " = " + Формат(Количество*Цена, "ЧЦ=15; ЧДЦ=2; ЧН=0; ЧГ=0");
		ТабДок.Вывести(ОблСумма);
		
		// СкидкаНаценка = Цена*Количество / СкидкаНаценка  * -1;
		
		
		Если СкидкаНаценка < 0 Тогда
			ОблСкидка.Параметры.ТекстСкидки  = НСтр("ru='Скидка'") + ": " + Формат(-СкидкаНаценка, "ЧЦ=15; ЧДЦ=2; ЧН=0; ЧГ=0")
			+ " (" + ПроцентСкидки + "%)" + Символы.ПС;
			ТабДок.Вывести(ОблСкидка);
		ИначеЕсли СкидкаНаценка > 0 Тогда
			ОблСкидка.Параметры.ТекстСкидки = НСтр("ru='Наценка'") + ": " + Формат(СкидкаНаценка, "ЧЦ=15; ЧДЦ=2; ЧН=0; ЧГ=0")
			+ " (" + ПроцентСкидки + "%)" + Символы.ПС;
			ТабДок.Вывести(ОблСкидка);
		КонецЕсли;
		
		Если СтавкаНДС > 0 Тогда
			ОблСумма.Параметры.ТекстСуммы = НСтр("ru='НДС'") + ": " + СтавкаНДС + "%" + Символы.ПС;
			ТабДок.Вывести(ОблСумма);
		КонецЕсли;
		
		
	КонецЕсли;
	
	ПараметрыПодключения.СтрокаЛога = ПараметрыПодключения.СтрокаЛога + СтрокаЛога;
	Возврат Результат;
	
КонецФункции

// Функция осуществляет открытие нового чека.
//
Функция ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ЧекВозврата, ФискальныйЧек, ВыходныеПараметры) Экспорт
	
	Результат  = Истина;
	СтрокаЛога = "";
	
	мНомерСмены = 1;
	мНомерЧека  = ПолучитьНомерЧека();
	
	ТабДок	= Новый ТабличныйДокумент;
	Макет	=  Справочники.ПодключаемоеОборудование.ПолучитьМакет("ЧекWinPrint");
	
	// ОблРазделение = МенеджерОборудованияСервер.ПолучитьОбластьМакета("Разделение");
	
	ОблРазделение    = Макет.ПолучитьОбласть("Разделение");
	ОблЗаголовка     =  Макет.ПолучитьОбласть("Заголовок");
	ОблДопИнформации =  Макет.ПолучитьОбласть("ДопИнформация");   	
	
	СтрокаЛога = СтрокаЛога + "===== " + ?(ЧекВозврата, НСтр("ru='Открытие чека возврата'"), НСтр("ru='Открытие чека продажи'")) + " =====" + Символы.ПС;
	
	СтрокаЛога = СтрокаЛога + "=====" + ?(ФискальныйЧек, "== " + НСтр("ru='Фискальный режим'"), " " + НСтр("ru='Нефискальный режим'")) + "=====" + Символы.ПС;
	
	СтрокаЛога = СтрокаЛога + НСтр("ru=Кассир")   + ": " + ОбщегоНазначенияСтоматология.ТекущийПользователь() + Символы.ПС; 
	
	СтрокаЛога = СтрокаЛога + НСтр("ru='№ чека'")   + ": " + Формат(мНомерЧека,  "ЧЦ=8; ЧН=0; ЧВН=")
	+ "    "
	+ НСтр("ru='№ смены'") + ": " + Формат(мНомерСмены, "ЧЦ=4; ЧН=0; ЧВН=") + Символы.ПС;
	
	НомерСмены = мНомерСмены;
	НомерЧека  = мНомерЧека;
	
	// Заполнение выходных параметров
	ВыходныеПараметры.Добавить(НомерСмены);
	ВыходныеПараметры.Добавить(НомерЧека);
	ВыходныеПараметры.Добавить(0);
	ВыходныеПараметры.Добавить(ТекущаяДата());
	
	ПараметрыПодключения.Вставить("ФискальныйЧек", ФискальныйЧек);
	ПараметрыПодключения.Вставить("ЧекОткрыт"    , Истина);
	ПараметрыПодключения.Вставить("ИтогЧека"     , 0);
	
	ПараметрыПодключения.СтрокаЛога = ПараметрыПодключения.СтрокаЛога + СтрокаЛога;
	
	// заполняем шапку таблицы
	Для Каждого СтрокаШапки Из Параметры.ТаблицаШапкаЧека Цикл
		ОблЗаголовка.Параметры.ТекстЗаголовка = СокрЛП(СтрокаШапки);
		ТабДок.Вывести(ОблЗаголовка);
	КонецЦикла;
	ОблДопИнформации.Параметры.ТекстДопИнформации = НСтр("ru=Кассир")   + ": " + ОбщегоНазначенияСтоматология.ТекущийПользователь();
	ТабДок.Вывести(ОблДопИнформации);
	
	ОблДопИнформации.Параметры.ТекстДопИнформации = "Чек №: " + Формат(мНомерЧека, "ЧЦ=8; ЧВН=; ЧГ=0");
	// ОблДопИнформации.Параметры.ТекстДопИнформации = "Чек №: " + Формат(НомерЧека, "ЧЦ=11; ЧВН=; ЧГ=0");
	ТабДок.Вывести(ОблДопИнформации);
	
	ОблДопИнформации.Параметры.ТекстДопИнформации = Формат(ТекущаяДата(),"ДЛФ=DT");
	ТабДок.Вывести(ОблДопИнформации);
	ТабДок.Вывести(ОблРазделение);
	
	Параметры.Вставить("ТабличныйДокумент", ТабДок);
	Параметры.Вставить("Макет", Макет);
	
	Возврат Результат;
	
КонецФункции

// Функция, возвращает номер последнего чека
//
Функция ПолучитьНомерЧека()
	
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		                      |	ВложенныйЗапрос.НомерЧекаККМ КАК НомерЧекаККМ
		                      |ИЗ
		                      |	(ВЫБРАТЬ
		                      |		МАКСИМУМ(ЕСТЬNULL(ПоступлениеДенежныхСредств.НомерЧекаККМ, 0)) КАК НомерЧекаККМ
		                      |	ИЗ
		                      |		Документ.ПоступлениеДенежныхСредств КАК ПоступлениеДенежныхСредств
		                      |	ГДЕ
		                      |		ПоступлениеДенежныхСредств.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		                      |	
		                      |	ОБЪЕДИНИТЬ ВСЕ
		                      |	
		                      |	ВЫБРАТЬ
		                      |		МАКСИМУМ(ЕСТЬNULL(СписаниеДенежныхСредств.НомерЧекаККМ, 0))
		                      |	ИЗ
		                      |		Документ.СписаниеДенежныхСредств КАК СписаниеДенежныхСредств
		                      |	ГДЕ
		                      |		СписаниеДенежныхСредств.СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ВложенныйЗапрос
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	НомерЧекаККМ УБЫВ");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0].НомерЧекаККМ + 1;
	Иначе
		Возврат 1;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

