#Область СлужебныйПрограммныйИнтерфейс

#Область ИнтеграцияССмсСервисами

// Функция - Фоновое задание запустить
//
// Параметры:
//  ПланОбмена					 - 	 - 
//  УникальныйИдентификаторФормы - 	 - 
// Возвращаемое значение:
//   - 
Функция ПроверитьБалансСмсСервисаИПредложитьПополнение() Экспорт
		
	Если ТекущийПользовательИмеетПравоНаРаботуССмсСервисами() = Ложь Тогда		
		Возврат Неопределено;
	КонецЕсли;
	
	ИдентификаторЗадания = Новый УникальныйИдентификатор; 
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, ИдентификаторЗадания);
	
	Результат = Новый Структура;
	Результат.Вставить("Статус"                      , Неопределено);
	Результат.Вставить("ИдентификаторЗадания"        , ИдентификаторЗадания);
	Результат.Вставить("АдресРезультата"             , АдресРезультата);
	Результат.Вставить("КраткоеПредставлениеОшибки"  , "");
	Результат.Вставить("ПодробноеПредставлениеОшибки", "");

	Попытка			
		ПроверитьБалансСмсСервисаДлительнаяОперация(Новый Структура, АдресРезультата);
		Результат.Статус = "Выполнено";			
	Исключение	   	
		Результат.Статус = "Ошибка";
		Результат.КраткоеПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Результат.ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Возврат Результат;
		
КонецФункции

// Процедура - Проверить необходимость предложения пополнения баланса смс сервиса helix
//
// Параметры:
//  СтруктураПараметров		 - 	 - 
//  АдресХранилищаРезультата - 	 - 
//
Процедура ПроверитьБалансСмсСервисаДлительнаяОперация(СтруктураПараметров, АдресХранилищаРезультата = Неопределено) Экспорт
	
	СервисСмс = Константы.СервисSMSРассылкиПоУмолчанию.Получить();     
	
	Если ЗначениеЗаполнено(СервисСмс) 
		И СервисСмс.ИмяОбработки = "СервисHelixSMS" Тогда
		
		Баланс = Неопределено;
		
		Попытка
			Баланс = Справочники.СервисыРассылки.ПолучитьБалансАккаунтаSMS(СервисСмс);
		Исключение			
			ЗаписатьОшибкуВЖурналРегистрации(ИнформацияОбОшибке());			
		КонецПопытки;
		
		Если Баланс <> Неопределено
			И ЗначениеЗаполнено(Баланс.Баланс) Тогда
			
			РезультатаОперции = ПолучитьПредложениеДляПополенияБалансаСмсСервиса(СервисСмс);							
			МинимальныйБаланс = 1000;
			
			Если РезультатаОперции.ВыполненоУспешно = Истина Тогда
				
				Если РезультатаОперции.ПараметрыРезультата <> Неопределено Тогда
					
					РезультатаОперции.ПараметрыРезультата.Вставить("ТекущийБаланс",Баланс.Баланс);		
					МинимальныйБаланс = РезультатаОперции.ПараметрыРезультата.min_balance;
					
				КонецЕсли;
				
				ПоместитьВоВременноеХранилище(РезультатаОперции.ПараметрыРезультата, АдресХранилищаРезультата);  
				
			КонецЕсли;		
			
			// Если это проверка пополнения баланса
			Если СтруктураПараметров = Неопределено
				ИЛИ Не СтруктураПараметров.Свойство("НеКонтролироватьДатаПоследнегоСчета")
				ИЛИ СтруктураПараметров.НеКонтролироватьДатаПоследнегоСчета = Ложь Тогда
								
				Если Баланс.Баланс <= МинимальныйБаланс Тогда  
					
					ДанныеСервиса = ПолучитьДанныеСмсСервиса();
					
					Если ДанныеСервиса <> Неопределено
						И ДанныеСервиса.Свойство("ДатаПоследнейВыпискиСчетаПоплненияСмсБаланса")
						И ЗначениеЗаполнено(ДанныеСервиса.ДатаПоследнейВыпискиСчетаПоплненияСмсБаланса) Тогда
						
						Период = (НачалоДня(ТекущаяДата()) - НачалоДня(ДанныеСервиса.ДатаПоследнейВыпискиСчетаПоплненияСмсБаланса)) / 86400;
						
						Если Период < 3 Тогда
							
							ПоместитьВоВременноеХранилище(Неопределено, АдресХранилищаРезультата);
							Возврат;	
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					ПоместитьВоВременноеХранилище(Неопределено, АдресХранилищаРезультата);
					Возврат;
				КонецЕсли;
				
			КонецЕсли;
									
		КонецЕсли;
		
	Иначе	
		ПоместитьВоВременноеХранилище(Неопределено, АдресХранилищаРезультата);
	КонецЕсли;
	
КонецПроцедуры

// Функция - Текущий пользователь имеет право на работу с смс сервисами
// 
// Возвращаемое значение:
//   - 
//
Функция ТекущийПользовательИмеетПравоНаРаботуССмсСервисами()
	
	РольПользователя = ПараметрыСеанса.ТекущийПользователь.РольПользователя;
	
	Если РольПользователя = Перечисления.РольПользователя.Руководитель
		ИЛИ РольПользователя = Перечисления.РольПользователя.Управляющий 
		ИЛИ РольДоступна("Администрирование") 
		ИЛИ РольДоступна("ПолныеПрава")            
		ИЛИ РольДоступна("ДобавлениеИзменениеSMSРассылки") Тогда           
		
		Возврат Истина;
	КонецЕсли;
		
	Возврат Ложь;

КонецФункции

// Процедура - Записать ошибку в журнал регистрации
//
// Параметры:
//  ДанныеОшибки - 	 - 
//
Процедура ЗаписатьОшибкуВЖурналРегистрации(ДанныеОшибки)
	
	Описание = "Описание: " + ДанныеОшибки.Описание + "
	|ИмяМодуля: " + ДанныеОшибки.ИмяМодуля + "
	|НомерСтроки: " + ДанныеОшибки.НомерСтроки + "
	|ИсходнаяСтрока: " + ДанныеОшибки.ИсходнаяСтрока + "
	|Причина: " + ДанныеОшибки.Причина;
	
	ЗаписьЖурналаРегистрации(
	"API CRM",
	УровеньЖурналаРегистрации.Ошибка,,,
	Описание);
	
КонецПроцедуры

// Функция вернет структуру данных смс сервиса 
Функция ПолучитьДанныеСмсСервиса() Экспорт
	
	СсылкаНаХранилище = Константы.ДанныеСмсСервисаХранилищеДанных.Получить();
	
	Если СсылкаНаХранилище <> Неопределено Тогда
		
		Возврат СсылкаНаХранилище.Получить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Процедура запишит структуру данных смс сервиса
// в хранилище данных
Процедура ЗаписатьДанныеСмсСервиса(СтруктураДанных) Экспорт
	
	Константы.ДанныеСмсСервисаХранилищеДанных.Установить(Новый ХранилищеЗначения(СтруктураДанных));
	
КонецПроцедуры

// Получить структуру данных хранения смс сервиса на клиенте
Функция ПолучитьПустуюСтруктуруДанныхСмсСервисаДляХраненияНаКлиенте() Экспорт
	
	ДанныеСервиса = Новый Структура("ДатаПоследнейВыпискиСчетаПоплненияСмсБаланса" ,Неопределено);
	
	Возврат ДанныеСервиса; 
	
КонецФункции

#КонецОбласти

#Область Sms_service 

// Функция - Получить предложение для пополения баланса смс сервиса
//
// Параметры:
//  СмсСервис	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПредложениеДляПополенияБалансаСмсСервиса(СмсСервис) Экспорт
	
	РезультатаОперции = Неопределено;
	
	Попытка 
		
		ЗаголовкиHTTP = Новый Соответствие;	
		ЗаголовкиHTTP.Вставить("smsservicelogin", СмсСервис.Пользователь);		
		
		РезультатЗапроса  = ВыполнитьGETЗапрос("sms_service/recommendable_payment", ЗаголовкиHTTP);	
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

// Функция - Выставить счет на пополнение смс сервиса
//
// Параметры:
//  СмсСервис	 - 	 - 
//  СуммаСчета	 - 	 - 
//  ЭлПота		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВыставитьСчетНаПополнениеСмсСервиса(СмсСервис,СуммаСчета, ЭлектроннаяПочта) Экспорт
	
	РезультатаОперции = Неопределено;
	
	Попытка 
		
		ПарамтерыЗапроса = Новый Структура("sms_service_login,amount_payment,email_for_invoice",
		СмсСервис.Пользователь,
		СуммаСчета,
		ЭлектроннаяПочта);
				
		ТекстЗапроса = СобратьJson(ПарамтерыЗапроса);
		
		РезультатЗапроса  = ВыполнитьPOSTЗапрос("sms_service/invoice", ТекстЗапроса);
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;
			
КонецФункции

// Функция - Изменить значение критического баланса смс сервиса
//
// Параметры:
//  МинимальныйБаланс	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИзменитьЗначениеКритическогоБалансаСмсСервиса(СмсСервис, МинимальныйБаланс) Экспорт
	
	РезультатаОперции = Неопределено;
	
	Попытка 
		
		ПарамтерыЗапроса = Новый Структура("sms_service_login,update_min_balance,product_name", 
		СмсСервис.Пользователь, 
		МинимальныйБаланс, 
		Метаданные.Имя);		
		
		ТекстЗапроса = СобратьJson(ПарамтерыЗапроса);
		
		РезультатЗапроса  = ВыполнитьPUTЗапрос("sms_service/min_balance", ТекстЗапроса);    
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;

КонецФункции

// Функция - Выполнить POSTЗапрос
//
// Параметры:
//  Метод		 - 	 - 
//  ТекстЗапроса - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВыполнитьPOSTЗапрос(Метод, ТекстЗапроса, ДопЗаголовки = Неопределено, Параметры = Неопределено)
	
	Если Параметры = Неопределено Тогда
		Параметры = ПараметрыПодклчюенияК_API_CRM();
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(
	Параметры.АдресСервера,, 
	Параметры.Пользователь,
	Параметры.Пароль);
		
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language", "ru");	
	
	Если ДопЗаголовки <> Неопределено Тогда
		
		Для Каждого Заголовок ИЗ ДопЗаголовки Цикл		
			ЗаголовкиHTTP.Вставить(Заголовок.Ключ, Заголовок.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	/// CRM/hs/api/v1/
	HTTPЗапрос = Новый HTTPЗапрос(Параметры.АдресПубликации + Метод, ЗаголовкиHTTP);		
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);		
		
    ВозвращаемыйРезультат = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Возврат РазобратьJson(ВозвращаемыйРезультат);
	
КонецФункции

// Функция - Выполнить PUTЗапрос
//
// Параметры:
//  Метод		 - 	 - 
//  ТекстЗапроса - 	 - 
//  ДопЗаголовки - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВыполнитьPUTЗапрос(Метод, ТекстЗапроса, ДопЗаголовки = Неопределено, Параметры = Неопределено)
	
	Если Параметры = Неопределено Тогда
		Параметры = ПараметрыПодклчюенияК_API_CRM();
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(
	Параметры.АдресСервера,, 
	Параметры.Пользователь,
	Параметры.Пароль);
		
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language", "ru");	
	
	Если ДопЗаголовки <> Неопределено Тогда
		
		Для Каждого Заголовок ИЗ ДопЗаголовки Цикл		
			ЗаголовкиHTTP.Вставить(Заголовок.Ключ, Заголовок.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	/// CRM/hs/api/v1/
	HTTPЗапрос = Новый HTTPЗапрос(Параметры.АдресПубликации + Метод, ЗаголовкиHTTP);		
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);		

    ВозвращаемыйРезультат = Соединение.ВызватьHTTPМетод("PUT", HTTPЗапрос);
	
	Возврат РазобратьJson(ВозвращаемыйРезультат);
		
КонецФункции

// Функция - Выполнить GETЗапрос
//
// Параметры:
//  Метод		 - 	 - 
//  ДопЗаголовки - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВыполнитьGETЗапрос(Метод, ДопЗаголовки = Неопределено, Параметры = Неопределено)
	
	Если Параметры = Неопределено Тогда
		Параметры = ПараметрыПодклчюенияК_API_CRM();
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(
	Параметры.АдресСервера,, 
	Параметры.Пользователь,
	Параметры.Пароль);
		
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language", "ru");	
	
	Если ДопЗаголовки <> Неопределено Тогда
		
		Для Каждого Заголовок ИЗ ДопЗаголовки Цикл		
			ЗаголовкиHTTP.Вставить(Заголовок.Ключ, Заголовок.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	/// CRM/hs/api/v1/
	HTTPЗапрос = Новый HTTPЗапрос(Параметры.АдресПубликации + Метод, ЗаголовкиHTTP);				
	
	ВозвращаемыйРезультат = Соединение.Получить(HTTPЗапрос);	
	
	Возврат РазобратьJson(ВозвращаемыйРезультат);
	
КонецФункции

// Функция - Обработать стандартный результат HTTPЗапроса
//
// Параметры:
//  РезультатЗапроса - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса)
	
	РезультатаОперции                     = СтруктураСтандартынхПараметровРезОперации();	
	РезультатаОперции.ПараметрыРезультата = РезультатЗапроса.parameters;
	
	Если РезультатЗапроса.parameters.result = Истина Тогда
		
		Если ЗначениеЗаполнено(РезультатЗапроса.parameters) Тогда
			РезультатаОперции.ВыполненоУспешно = РезультатЗапроса.parameters.result;
		КонецЕсли;
		
	Иначе
		
		РезультатаОперции.КодОшибки       = РезультатЗапроса.errors.code;
		РезультатаОперции.ОписаниеОшибки  = РезультатЗапроса.errors.message;
		
		ДанныеИсключения = Новый Структура("Описание,ИмяМодуля,НомерСтроки,ИсходнаяСтрока,Причина",
		РезультатЗапроса.errors.message,
		"МодульОбщегоНазначения.ЛичныйКабинет");	
		
		ЗаписатьОшибкуВЖурналРегистрации(ДанныеИсключения);

	КонецЕсли;

	Возврат РезультатаОперции;
	
КонецФункции

// Функция - Обработать исключение при выполнении HTTPЗапроса
//
// Параметры:
//  ДанныеИсключения - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОбработатьИсключениеПриВыполненииHTTPЗапроса(ДанныеИсключения)
	
	РезультатаОперции = СтруктураСтандартынхПараметровРезОперации();		
	
	Описание = "Описание: " + ДанныеИсключения.Описание + "
	|ИмяМодуля: " + ДанныеИсключения.ИмяМодуля + "
	|НомерСтроки: " + ДанныеИсключения.НомерСтроки + "
	|ИсходнаяСтрока: " + ДанныеИсключения.ИсходнаяСтрока + "
	|Причина: " + ДанныеИсключения.Причина;
		
	РезультатаОперции.КодОшибки       = 400;
	РезультатаОперции.ОписаниеОшибки  = Описание;
	
	ЗаписатьОшибкуВЖурналРегистрации(ДанныеИсключения);
			
	Возврат РезультатаОперции;
		
КонецФункции

// Функция - Параметры подклчюения к API CRM 
// 
// Возвращаемое значение:
//   - 
//
Функция ПараметрыПодклчюенияК_API_CRM()
	
	// Тестовый сервер                          
	// СтрПараметров = Новый Структура();
	// СтрПараметров.Вставить("АдресСервера"   ,"localhost");    
	// СтрПараметров.Вставить("АдресПубликации","/CRM/hs/api/v1/");
	// СтрПараметров.Вставить("Пользователь"   ,"wsdl");
	// СтрПараметров.Вставить("Пароль"         ,"wsdl");

	// Боевой сервер
	СтрПараметров = Новый Структура();
	СтрПараметров.Вставить("АдресСервера"   ,"app.1c.fitness");
	СтрПараметров.Вставить("АдресПубликации","/mediator/hs/api/v1/");
	СтрПараметров.Вставить("Пользователь"   ,Неопределено);
	СтрПараметров.Вставить("Пароль"         ,Неопределено);
	
	Возврат СтрПараметров;
	
КонецФункции

// Функция - Разобрать json
//
// Параметры:
//  Запрос	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция РазобратьJson(Запрос)
	
	ТекстJSON = Запрос.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	
	Возврат ПрочитатьJSON(ЧтениеJSON);
	
КонецФункции

// Функция - Собрать json
//
// Параметры:
//  СтруктураДанных	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СобратьJson(СтруктураДанных)
	
	ЗаписьJSON      = Новый ЗаписьJSON;
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто);
	
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);	
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
	
	Возврат ЗаписьJSON.Закрыть();

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция - Структура стандартынх параметров рез операции
// 
// Возвращаемое значение:
//   - 
//
Функция СтруктураСтандартынхПараметровРезОперации()
	
	 Возврат Новый Структура("ВыполненоУспешно,ПараметрыРезультата,КодОшибки,ОписаниеОшибки",
	 Ложь,
	 Неопределено,
	 Неопределено, 
	 Неопределено);
	
 КонецФункции
 
#КонецОбласти
