
#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура - Записать согласования страховых услуг.
//
Процедура ЗаписатьСогласованияСтраховыхУслуг(ДокументСсылка, ТаблицаСогласованийУслуг) Экспорт

	Если НЕ ЗначениеЗаполнено(ДокументСсылка)
		ИЛИ НЕ ЗначениеЗаполнено(ТаблицаСогласованийУслуг) Тогда
		
		Возврат;
	КонецЕсли;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаСогласованийУслуг.КлючСтроки КАК КлючСтроки,
	|	ТаблицаСогласованийУслуг.ДатаОтправки КАК ДатаОтправки,
	|	ТаблицаСогласованийУслуг.СтатусСогласования КАК СтатусСогласования,
	|	ТаблицаСогласованийУслуг.ДатаСогласования КАК ДатаСогласования,
	|	ТаблицаСогласованийУслуг.Согласователь КАК Согласователь,
	|	ТаблицаСогласованийУслуг.КомментарийСогласования КАК Комментарий
	|ПОМЕСТИТЬ ВТ_ТаблицаСогласованийУслуг
	|ИЗ
	|	&ТаблицаСогласованийУслуг КАК ТаблицаСогласованийУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Прием.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Прием.Ссылка КАК Прием,
	|	Прием.ПолисМедСтрахования.Договор КАК Договор,
	|	Прием.ПолисМедСтрахования.СтраховаяКомпания КАК СтраховаяКомпания,
	|	Прием.Контрагент КАК Контрагент,
	|	Прием.Сотрудник КАК Ответственный,
	|	ПриемЛечение.Номенклатура КАК Номенклатура,
	|	ПриемЛечение.КлючСтроки КАК ИдентификаторСтроки,
	|	ПриемЛечение.Зуб КАК Зуб,
	|	ВТ_ТаблицаСогласованийУслуг.СтатусСогласования КАК СтатусСогласования,
	|	ВТ_ТаблицаСогласованийУслуг.ДатаСогласования КАК ДатаСогласования,
	|	ВТ_ТаблицаСогласованийУслуг.Согласователь КАК Согласователь,
	|	ВТ_ТаблицаСогласованийУслуг.ДатаОтправки КАК ДатаОтправки,
	|	ВТ_ТаблицаСогласованийУслуг.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.Прием КАК Прием
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Прием.Лечение КАК ПриемЛечение
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаСогласованийУслуг КАК ВТ_ТаблицаСогласованийУслуг
	|			ПО ПриемЛечение.КлючСтроки = ВТ_ТаблицаСогласованийУслуг.КлючСтроки
	|		ПО Прием.Ссылка = ПриемЛечение.Ссылка
	|ГДЕ
	|	Прием.Ссылка = &ДокументСсылка
	|	И ВТ_ТаблицаСогласованийУслуг.СтатусСогласования <> ЗНАЧЕНИЕ(Перечисление.СтатусыСогласованияСтраховыхУслуг.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ТаблицаСогласованийУслуг", ТаблицаСогласованийУслуг);
	ТаблицаНоменклатур = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей = РегистрыСведений.СогласованияСтраховыхУслуг.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Прием.Установить(ДокументСсылка);	
	НаборЗаписей.Прочитать();                           
	
	НаборЗаписей.Загрузить(ТаблицаНоменклатур);
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Запись регистра СогласованияСтраховыхУслуг",
		УровеньЖурналаРегистрации.Ошибка,,ДокументСсылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти