
#Область СлужебныйПрограммныйИнтерфейс

// См. ПодсистемыКонфигурацииПереопределяемый.ПриДобавленииПодсистем.
// 
// Параметры:
//  МодулиПодсистем - см. ПодсистемыКонфигурацииПереопределяемый.ПриДобавленииПодсистем.МодулиПодсистем
//
Процедура ПриДобавленииПодсистем(МодулиПодсистем) Экспорт
	
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыСтоматология");
	
КонецПроцедуры

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                  Обработчики обновления таких библиотек должны быть вызваны ранее
//                                  обработчиков обновления данной библиотеки.
//                                  При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                  порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                  в процедуре ПриДобавленииПодсистем общего модуля ПодсистемыКонфигурацииПереопределяемый.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя    = "Стоматология";
	Описание.Версия = "2.1.2.1";
	Описание.ИдентификаторИнтернетПоддержки = "stomatology";
	
	// Требуется библиотека стандартных подсистем.
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
		
КонецПроцедуры

// Доопределяет события, к которым можно будет добавить обработчики
// через процедуру ПриДобавленииОбработчиковСлужебныхСобытий.
// 
// Параметры:
//  КлиентскиеСобытия – Массив, где значения типа Строка - полное имя события.
//  СерверныеСобытия  – Массив, где значения типа Строка - полное имя события.
// 
// Для упрощения поддержки, рекомендуется делать вызов такой же
// процедуры в общем модуле библиотеки.
// 
// Пример использования в общем модуле библиотеки:
// 
// 	// Переопределяет стандартное предупреждение открытием произвольной формы активных пользователей.
// 	// 
// 	// Параметры:
// 	//  ИмяФормы - Строка (возвращаемое значение).
// 	// 
// 	// Синтаксис:
// 	// Процедура ПриОткрытииФормыАктивныхПользователей(ИмяФормы) Экспорт
// 	// 
// 	СерверныеСобытия.Добавить(
// 		"СтандартныеПодсистемы.БазоваяФункциональность\ПриОпределенииФормыАктивныхПользователей");
// 
// Комментарий можно копировать при создании нового обработчика.
// Раздел "Синтаксис:" используется для создания новой процедуры обработчика.
// 
Процедура ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия) Экспорт
	
	//// Опциональные подсистемы
	// Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Пользователи") Тогда
	//	МодульПользователи = ОбщегоНазначения.ОбщийМодуль("ПользователиСтоматология");
	//	МодульПользователи.ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия);
	// КонецЕсли;
	
КонецПроцедуры

// См. описание этой же процедуры в модуле СтандартныеПодсистемыСервер.
//
Процедура ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики) Экспорт
	
	// СЕРВЕРНЫЕ ОБРАБОТЧИКИ.
	
	// ТехнологияСервиса.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	
	// Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Пользователи") Тогда
	//	МодульПользователи = ОбщегоНазначения.ОбщийМодуль("ПользователиСтоматология");
	//	МодульПользователи.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	// КонецЕсли;
	
КонецПроцедуры

// Процедура - При добавлении обработчиков обновления
//
// Параметры:
//  Обработчики	 - 	 - 
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.0.1";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ПервоначальноеЗаполнениеИБ";
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "*";
	Обработчик.РежимВыполнения 	= "Отложенно";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ОбновитьОтчеты";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор("c5952fe8-273d-46c6-8acd-67e519a58eb8");
	Обработчик.Комментарий 		= НСтр("ru = 'Обновление настроек вариантов отчетов.'");
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 	 		= "2.1.1.4";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьРегистрСвободныеИнтервалыСотрудников";
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 	 		= "2.1.1.4";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьТипыКонтрагентов";

	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 	 		= "2.1.1.5";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ПереходНаНовуюСистемуНалогообложения";
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 	 		= "2.1.1.5";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнениеСправочникаЭквайринговыеТерминалы";
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.РежимВыполнения 	= "Отложенно";
	Обработчик.Версия 	 		= "2.1.1.6";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьСокращенноеНаименованиеСотрудников";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 	 		= "2.1.1.6";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ПереносТекущихМаркетинговыхАкцийВГруппуСкидки";   
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 	 		= "2.1.1.6";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ДобавитьВидОплатыБонусныйСчетВКассы";
	
	// Обработчик 					= Обработчики.Добавить();
	// Обработчик.Версия 			= "2.1.1.6";
	// Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.УстановитьСвойстваПредопределенныхВидовКонтактнойИнформации";
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.6";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ОбновитьПредопределнныеВидыСделок";
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.6";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьСправочникВидыВзаимодействий";
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.РежимВыполнения 	= "Отложенно";	
	Обработчик.Версия 			= "2.1.1.6";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ПерезаполнитьСведенияДляСпискаКонтрагентов";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();	
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.РежимВыполнения 	= "Отложенно";	
	Обработчик.Версия 			= "2.1.1.6";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ОбновитьРегистрСделкиСведенияДляСписка";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.7";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ОбновитьПредопределенныеГруппыМаркетинговыхАкций";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();	
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.9";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьСправочникКлассификаторСоциальныхГрупп";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();

	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.9";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьСправочникКлассификаторСоциальныхСтатусов";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();

	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.9";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьСправочникВидыВзаимодействий";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.РежимВыполнения 	= "Отложенно";
	Обработчик.Версия 			= "2.1.1.9";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ОбновитьКонтактнуюИнформацию";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.9";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ОбновлениеНоменклатуры";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();

	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.10";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ПеренестиРеквизитыВДоговорыКонтрагентов";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.10";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьСправочникКлассификаторДолжностей";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();

	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.10";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьСправочникКлассификаторСпециальностей";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();

	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.10";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьСправочникКлассификаторСоциальныхСтатусов";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.12";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.УдалитьПредопределенныйДрайверПростыеЗвонки";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();

	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.14";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьКлассификаторУслуг";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.14";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ПеренестиПрисоединенныеФайлыКлиентов";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	Обработчик.РежимВыполнения  = "Отложенно";

	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.15";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьКонстантуОбязательныеПоляСобытие";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();

	Обработчик 					= Обработчики.Добавить();
	Обработчик.РежимВыполнения 	= "Отложенно";
	Обработчик.Версия 			= "2.1.1.16";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ОбновитьПредопределенныеВидыКИ";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.17";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьДанныеДиалогов";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик					= Обработчики.Добавить();
	Обработчик.Версия			= "2.1.1.17";
	Обработчик.Процедура		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьДоговорыСоСтраховымиКомпаниями";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	 Обработчик = Обработчики.Добавить();
	 Обработчик.РежимВыполнения 	= "Отложенно";		
	 Обработчик.Версия 	 		= "2.1.1.18";
	 Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.СжатьКартинкиВИнформационнойБазе";
	 Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	 Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();
	 Приоритет = Обработчик.ПриоритетыВыполнения.Добавить();
	 Приоритет.Процедура = "РегистрыСведений.ДвоичныеДанныеФайлов.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	 Приоритет.Порядок = "После";
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.18";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьСправочникВидыВзаимодействий";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();  
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.19";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ОбработатьВерсииФайлов";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();

    Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Отложенно";	
	Обработчик.Версия          = "2.1.1.21";
	Обработчик.Процедура       = "ОбновлениеИнформационнойБазыСтоматология.ПереходНаНовуюСистемуРассылкиСообщений";
	Обработчик.Идентификатор   = Новый УникальныйИдентификатор();
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Отложенно";	
	Обработчик.Версия          = "2.1.1.21";
	Обработчик.Процедура       = "ОбновлениеИнформационнойБазыСтоматология.ИсправлениеВидовКИПациентов";
	Обработчик.Идентификатор   = Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.21";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ПереносРолиИспользованиеМессенджераИзРасширения";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.21";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьКлассификаторУслуг";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();  
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.22";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ПрописатьВидыОперацийПредопределеннымСтатьям";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор(); 
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.22";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ДобавитьПользователямВрачИГлавныйВрачРольДобавлениеИзменениеКлиентов";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор(); 
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.22";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ИнициализацияПредопределенныхСценариевЧатБота";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();  
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.23";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ДобавитьЗаписиВРегистрНастройкиПользователей";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор(); 
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.23";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ПеренестиЭлементыСправочникаДиагнозы";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();    
	
	Обработчик                 = Обработчики.Добавить();
	Обработчик.Версия          = "2.1.1.23";
	Обработчик.Процедура       = "ОбновлениеИнформационнойБазыСтоматология.ОбновитьЗаписиРегистраКонтрагентыСведенияДляСписка";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор   = Новый УникальныйИдентификатор(); 
	Обработчик.Комментарий     = НСтр("ru = 'Обновить записи регистра ""Контрагенты сведения для списка.""'");
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.27";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ПеренестиНастройкиЭтаповСценариевВХранилищеЗначений";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();   
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.29";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ПереименоватьНаименованияПараметровШаблоновСообщений";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();  
	
	Обработчик                 = Обработчики.Добавить();
	Обработчик.Версия          = "2.1.1.30";
	Обработчик.Процедура       = "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьОрганизациюВАктахОказанияУслуг";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор   = Новый УникальныйИдентификатор(); 
	Обработчик.Комментарий     = НСтр("ru = 'Заполнение организации в документе ""Акт оказания услуг.""'"); 
	
	Обработчик                 = Обработчики.Добавить();
	Обработчик.Версия          = "2.1.1.30";
	Обработчик.Процедура       = "ОбновлениеИнформационнойБазыСтоматология.ПерезаписьНастроекЦветовСтруктурнойЕдиницы";
	Обработчик.Идентификатор   = Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.31";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ОбновитьПредопределенныеВариантыОтчетов";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик                  = Обработчики.Добавить();
    Обработчик.Версия 			= "2.1.1.31";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ОбновитьТекстОтправкиСообщенияОНовойКарте";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.32";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ИнициализацияПредопределенныхСценариевЧатБота";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.32";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаменитьИспользованиеКонстантПоздравленияСДРПациентовТриггером";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.32";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаменитьДиагнозыНаНовыйСправочник";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик                 = Обработчики.Добавить();
	Обработчик.Версия          = "2.1.1.32";
	Обработчик.Процедура       = "ОбновлениеИнформационнойБазыСтоматология.ОбновлениеПараметровВнешнихСистемWhatsApp";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор   = Новый УникальныйИдентификатор(); 
	Обработчик.Комментарий     = НСтр("ru = 'Обновление параметров внешних систем WhatsApp'");
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.33";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ОбновитьБиблиотекуОтветов";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.34";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ИнициализацияПредопределенныхСценариевЧатБота";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.34";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнениеИдентификаторовПоследнихДиалогов";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.34";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнениеДополнительныхПолейДетализацииЧатов";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.35";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьКлассификаторУслуг";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.35";
	Обработчик.РежимВыполнения  = "Оперативно";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ПеренестиОбщиеНастройкиОповещенийВТриггернуюСистему"; 
		
	Обработчик 						= Обработчики.Добавить();
	Обработчик.РежимВыполнения 		= "Отложенно";
	Обработчик.Версия 				= "2.1.1.35";
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ПеренестиСтатусыКонтрагентовНаНовыйРегистр"; 
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор();
    Обработчик.ЧитаемыеОбъекты    	= "РегистрСведений.СтатусыКонтрагентов";
	Обработчик.ИзменяемыеОбъекты  	= "РегистрСведений.СтатусыКонтрагентов";
	Обработчик.БлокируемыеОбъекты 	= "РегистрСведений.СтатусыКонтрагентов";
	Обработчик.ПроцедураПроверки  	= "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
    Обработчик.Комментарий 			= НСтр("ru = 'Обновление статусов пациентов.
		|До завершения обработки, информация о статусах пациентов в ряде случаев будут отображаться некорректно.'");
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.35";
	Обработчик.РежимВыполнения  = "Оперативно";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ИсправитьСохраненныйHTMLКодМедКартыОртодонтическогоПациента";
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.36";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьРезультатПриемаВТриггерныхСобытиях";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	Обработчик.РежимВыполнения  = "Оперативно";	
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.36";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ИнициализироватьМеханизмРекомендаций";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	Обработчик.РежимВыполнения  = "Оперативно";	
	
    Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.36";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.УстановитьСвойстваПредопределенныхВидовКонтактнойИнформации";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.37";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьКурсыЛеченияВПриемах";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	Обработчик.РежимВыполнения  = "Отложенно";
    Обработчик.Комментарий      = НСтр("ru = 'Заполнение курсов лечения'"); 
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.38";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьСправочникСпециализации";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.38";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ПрисвоитьСпециализацииВрачам";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.38";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.СконвертироватьПредопределенныеСделки";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();  
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.38";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ПерезаписатьЗначениеЗначенияПараметровОбследований";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.Версия 			= "2.1.1.38";
	Обработчик.ПРоцедура 		= "ОбновлениеИнформационнойБазыСтоматология.УстановкаВидимостиСменыКлиники";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	
	Обработчик 					= Обработчики.Добавить();
	Обработчик.РежимВыполнения 	= "Отложенно";
	Обработчик.Версия 			= "2.1.1.38";
	Обработчик.Процедура 		= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьСтатусыПациентовВСобытии"; 
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор();
	Обработчик.Комментарий 		= НСтр("ru = 'Обновление документов предварительной записи.");
		
	Обработчик 					    = Обработчики.Добавить();
	Обработчик.Версия 			    = "2.1.1.40";
	Обработчик.Процедура 		    = "ОбновлениеИнформационнойБазыСтоматология.ДобавитьРольИспользованиеМонитораРуководителя";
	Обработчик.Идентификатор 	    = Новый УникальныйИдентификатор();
	Обработчик.РежимВыполнения      = "Отложенно";
	
	Обработчик 					    = Обработчики.Добавить();
	Обработчик.Версия 			    = "2.1.1.40";
	Обработчик.Процедура 		    = "ОбновлениеИнформационнойБазыСтоматология.ОбновитьПользовательскиеНастройкиСпискаКлиентов";
	Обработчик.Идентификатор 	    = Новый УникальныйИдентификатор();
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.РежимВыполнения 		= "Отложенно";
	Обработчик.Версия 				= "2.1.1.41";
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ОбновитьСтатусыПациентовВРегистреКонтрагентыСведенияДляСписка"; 
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор();
    Обработчик.ЧитаемыеОбъекты    	= "РегистрСведений.КонтрагентыСведенияДляСписка";
	Обработчик.ИзменяемыеОбъекты  	= "РегистрСведений.КонтрагентыСведенияДляСписка";
	Обработчик.БлокируемыеОбъекты 	= "РегистрСведений.КонтрагентыСведенияДляСписка";
	Обработчик.ПроцедураПроверки  	= "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
    Обработчик.Комментарий 			= НСтр("ru = 'Обновление статусов пациентов в регистре КонтрагентыСведенияДляСписка.
		|До завершения обработки, информация о статусах пациентов в ряде случаев будут отображаться некорректно.'");
	
	Обработчик 					    = Обработчики.Добавить();
	Обработчик.Версия 			    = "2.1.1.41";
	Обработчик.Процедура 		    = "ОбновлениеИнформационнойБазыСтоматология.ОбновитьПредопределенныеВидСделкиИПричиныОтказов";
	Обработчик.Идентификатор 	    = Новый УникальныйИдентификатор(); 
	
	Обработчик 					    = Обработчики.Добавить();
	Обработчик.Версия 			    = "2.1.1.41";
	Обработчик.Процедура 		    = "ОбновлениеИнформационнойБазыСтоматология.ПерезаписатьКодНоменклатурыМедицинскихУслуг";
	Обработчик.Идентификатор 	    = Новый УникальныйИдентификатор();
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.41";         	
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ОбновитьПредопределенныеВариантыОтчетов";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор();
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.41";         	
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.АктуализироватьРасписаниеОбновленияСтатусовСобытий";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор(); 
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.41";         	
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ДобавитьРольВыводНаПринтерФайлБуферОбмена";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор();
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.41";
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьУникальныйИдентификаторСтруктурнойЕдиницы"; 
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор();
	Обработчик.Комментарий 			= НСтр("ru = 'Заполнить уникальный идентификатор структурной единицы."); 
	
	Обработчик 					    = Обработчики.Добавить();
	Обработчик.Версия 			    = "2.1.1.42";
	Обработчик.Процедура 		    = "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьДоступныеКассыПользователей";
	Обработчик.Идентификатор 	    = Новый УникальныйИдентификатор();
	Обработчик.РежимВыполнения      = "Отложенно";
	
	Обработчик						= Обработчики.Добавить();
	Обработчик.Версия				= "2.1.1.42";
	Обработчик.Процедура 		    = "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьСтатьиДвиженияДокументаПоступлениеДенежныхСредств";
	Обработчик.Идентификатор 	    = Новый УникальныйИдентификатор(); 
	Обработчик.РежимВыполнения		= "Отложенно";  
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.43";         	
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьАлгоритмВычисленияПредопределенныхПараметровОбследований";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор(); 
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.44";         	
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьНастройкиОтправкиСообщений";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор(); 
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.44";         	
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ОчиститьКонстантуЗаголовокСистемы";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор();
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.44";
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьДатыОкончанияСобытий";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор(); 
	Обработчик.РежимВыполнения 		= "Отложенно";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.44";         	
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ОбновитьПредопределенныеВариантыОтчетов";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор(); 
		
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.44";
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ЗакрытиеМесяцаСоздатьЗаПрошлыеПериоды";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор(); 
	Обработчик.РежимВыполнения 		= "Отложенно";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.45";
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьРеквизитУИДВБудущихСобытиях";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор(); 
	Обработчик.РежимВыполнения 		= "Отложенно";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.45";
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.АктуализироватьАватарыСотрудников";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор(); 
	Обработчик.РежимВыполнения 		= "Отложенно";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.45";
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ОбновитьИДозаполнитьВнешниеСистемыIPТелефонииВCRM";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор(); 
	Обработчик.РежимВыполнения 		= "Отложенно";   
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.46";
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ПерезаписатьЗначенияДиагнозовВПараметрахОбследований";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор(); 
	Обработчик.РежимВыполнения 		= "Отложенно";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.46";         	
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ОбновлениеПараметровЗакрытияДиалоговВнешнихСистемМессенджеров";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор();
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.47";
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнениеРеквизитаДляКассы";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор(); 
	Обработчик.РежимВыполнения 		= "Отложенно"; 
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.47";
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ОбновитьНастройкиДатПриемаИУвольненияСотрудников";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор(); 
	Обработчик.РежимВыполнения 		= "Отложенно";
	
	Обработчик						= Обработчики.Добавить();
	Обработчик.Версия				= "2.1.1.47";
	Обработчик.Процедура			= "ОбновлениеИнформационнойБазыСтоматология.ПеренестиДанныеИзТЧВРегистрСведенийНормыСписанияМатериалов";
	Обработчик.Идентификатор		= Новый УникальныйИдентификатор();
	Обработчик.РежимВыполнения		= "Отложенно";
	
	Обработчик						= Обработчики.Добавить();
	Обработчик.Версия				= "2.1.1.47";
	Обработчик.Процедура			= "ОбновлениеИнформационнойБазыСтоматология.СинхронизироватьСтруктурныеЕдиницыЗадач";
	Обработчик.Идентификатор		= Новый УникальныйИдентификатор();
	Обработчик.РежимВыполнения		= "Отложенно";
	
	Обработчик						= Обработчики.Добавить();
	Обработчик.Версия				= "2.1.1.47";
	Обработчик.Процедура			= "ОбновлениеИнформационнойБазыСтоматология.ОбновитьЭквайрингиИКассы";
	Обработчик.Идентификатор		= Новый УникальныйИдентификатор();
	
	Обработчик						= Обработчики.Добавить();
	Обработчик.Версия				= "2.1.1.47";
	Обработчик.Процедура			= "ОбновлениеИнформационнойБазыСтоматология.ОбновитьСодержаниеШаблоновСообщенийМессенджера";
	Обработчик.Идентификатор		= Новый УникальныйИдентификатор(); 
	
	Обработчик						= Обработчики.Добавить();
	Обработчик.Версия				= "2.1.1.47";
	Обработчик.Процедура			= "ОбновлениеИнформационнойБазыСтоматология.ИспарвитьЗаписиРегистраСведенийДокументыФизическихЛиц";
	Обработчик.Идентификатор		= Новый УникальныйИдентификатор();
	Обработчик.РежимВыполнения		= "Отложенно";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.49";
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьРегистрСтатусыСообщений";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор(); 
	Обработчик.РежимВыполнения 		= "Отложенно";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.49";
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ПеренестиДанныеТабличныхЧастейПользователяСотруднику";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор(); 
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.49";
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ОбновитьДанныеПриПереходеСоСтаройВерсииНаНовую";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор(); 
	Обработчик.РежимВыполнения 		= "Отложенно";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.49";
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ОбновитьИспользованиеСправочникаПрограммыСтрахования";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор(); 
	Обработчик.РежимВыполнения 		= "Отложенно";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.50";
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ПеренестиОчередьНаЗаписьВЛистОжидания";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор(); 
	Обработчик.РежимВыполнения 		= "Отложенно";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.50";         	
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьВремяОтправкиСообщенийЧатБота";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор();   
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.50";         	
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.УдалитьПредопределенныеДрайверыОборудования";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор(); 
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.50";         	
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ОбновитьРеквизитСуммаОплаченоВДокументах";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор();
	Обработчик.РежимВыполнения 		= "Отложенно";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.50";
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьНаименованиеАТСДляIPТелефонииItoolabsВCRM";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор(); 
	Обработчик.РежимВыполнения 		= "Отложенно";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.1.50";
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ЗаполнениеСодержанияPushУведомленийШаблоновСообщений";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор(); 
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.1.2.1";
	Обработчик.Процедура 			= "ОбновлениеИнформационнойБазыСтоматология.ДобавитьРольДобавлениеИзменениеЗаявокРегистратуре";
	Обработчик.Идентификатор 		= Новый УникальныйИдентификатор()
	
КонецПроцедуры
 
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры
 
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
 											Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
 
КонецПроцедуры
 
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
КонецПроцедуры
 
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры
 
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
КонецПроцедуры

// Возвращает список процедур-обработчиков обновления ИБ для всех поддерживаемых версий ИБ.
//
// Пример добавления процедуры-обработчика в список:
//    Обработчик = Обработчики.Добавить();
//    Обработчик.Версия = "1.0.0.0";
//    Обработчик.Процедура = "ОбновлениеИБ.ПерейтиНаВерсию_1_0_0_0";
//
// Вызывается перед началом обновления данных ИБ.
//
Функция ОбработчикиОбновления() Экспорт
	
	Обработчики = ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления();
	
	// Обработчик = Обработчики.Добавить();
	// Обработчик.Версия = "2.1.1.3";
	// Обработчик.Процедура = "ОбновлениеИнформационнойБазыСтоматология.ОбновитьКонтактнуюИнформацию";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.1.1.3";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСтоматология.УстановитьПредопределеннымВидамМедКартПечатнуюФорму";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.1.1.3";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСтоматология.УстановитьДатуПервогоВходаВСистему";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.1.1.3";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСтоматология.ОчиститьРСНастройкиСотрудниковОтДублей";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.1.1.3";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСтоматология.ПерезаполнитьСведенияДляСпискаКонтрагентов";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.1.1.7";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСтоматология.ПроставитьСимвольноеПредставлениеВалют";
	
	Возврат Обработчики;
	
КонецФункции

// Вызывается после завершении обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсияИБ     - Строка - версия ИБ до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсияИБ        - Строка - версия ИБ после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков
//                                             обновления, сгруппированных по номеру версии.
//  Итерирование по выполненным обработчикам:
//		Для Каждого Версия Из ВыполненныеОбработчики.Строки Цикл
//	
//			Если Версия.Версия = "*" Тогда
//				группа обработчиков, которые выполняются всегда
//			Иначе
//				группа обработчиков, которые выполняются для определенной версии 
//			КонецЕсли;
//	
//			Для Каждого Обработчик Из Версия.Строки Цикл
//				...
//			КонецЦикла;
//	
//		КонецЦикла;
//
//   ВыводитьОписаниеОбновлений - Булево -	если Истина, то выводить форму с описанием 
//											обновлений.
// 
Процедура ПослеОбновления(Знач ПредыдущаяВерсияИБ, Знач ТекущаяВерсияИБ, 
	Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений) Экспорт
	
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений системы.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновлений.
//   
// См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры	

// Если нет ни одного пользователя со свойством показывать в списке выбора, создает пользователя с полными провами.
//
Процедура СоздатьПриНеобходимостиПользователяСПолнымиПравами() Экспорт
	
	Для Каждого ПользовательИБ Из ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл
		Если ПользовательИБ.ПоказыватьВСпискеВыбора = Истина И ПользовательИБ.Имя <> "Администратор (полные права)" Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ПользовательИБ = Справочники.Пользователи.НайтиПоНаименованию("Администратор (полные права)");
	Если ПользовательИБ.Пустая() Тогда
		ПользовательИБ = Справочники.Пользователи.СоздатьЭлемент();
		ПользовательИБ.Наименование = "Администратор (полные права)";
		ПользовательИБСуществует = Ложь;
	Иначе
		ПользовательИБ = ПользовательИБ.ПолучитьОбъект();
		ПользовательИБСуществует = Истина;
	КонецЕсли;
	
	НовыеСвойства = Неопределено;
	ПользователиСтоматология.ПрочитатьПользователяИБ(ПользовательИБ.ИдентификаторПользователяИБ, НовыеСвойства);
	НовыеСвойства.ПользовательИнфБазыИмя                       = ПользовательИБ.Наименование;
	НовыеСвойства.ПользовательИнфБазыПолноеИмя                 = ПользовательИБ.Наименование;
	НовыеСвойства.ПользовательИнфБазыПароль                    = Неопределено;
	НовыеСвойства.ПользовательИнфБазыАутентификацияСтандартная = Истина;
	НовыеСвойства.ПользовательИнфБазыПоказыватьВСпискеВыбора   = Истина;
	НовыеСвойства.ПользовательИнфБазыЯзык                      = "Русский";
	
	НовыеРоли = Новый Массив;  	
	НовыеРоли.Добавить("ПолныеПрава");
	НовыеРоли.Добавить("АдминистраторСистемы");
		
	ОписаниеОшибки = "";
	ПользователиСтоматология.ЗаписатьПользователяИБ(ПользовательИБ.ИдентификаторПользователяИБ, НовыеСвойства, НовыеРоли, НЕ ПользовательИБСуществует, ОписаниеОшибки);
	ПользовательИБ.ИдентификаторПользователяИБ = НовыеСвойства.ПользовательИнфБазыУникальныйИдентификатор;
	ПользовательИБ.Записать();
	
	Если ОписаниеОшибки <> "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

// Процедура - Обновить расширение мессенджера
//
Процедура ОбновитьРасширениеМессенджера() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РасширениеМессенджера = ПолучитьРасширениеМесседжера();
		
	Если РасширениеМессенджера = Неопределено Тогда
		// Расширение мессенджера не установлено, обновление не требуется.
		Возврат;
	КонецЕсли;
	
	МетаданныеМакета = Метаданные.ОбщиеМакеты.Найти("РасширениеМессенджера");
	
	Если МетаданныеМакета = Неопределено Тогда
		// Макет удален из конфигурации.
		Возврат;
	КонецЕсли;
	
	ДанныеРасширения = ПолучитьОбщийМакет(МетаданныеМакета);
	МетаданныеПоставляемогоРасширения = Новый ОбъектМетаданныхКонфигурация(ДанныеРасширения);
	
	РасширениеАктивно = РасширениеМессенджера.Активно;
	
	Если ТребуетсяОбновлениеПоставляемогоРасширения(РасширениеМессенджера, МетаданныеПоставляемогоРасширения) = Истина Тогда
		
		Попытка
			
			РасширениеМессенджера.Удалить();
			
		Исключение
			
			КомментарийОшибки = "Не удалось обновить расширение мессенджера." + Символы.ПС + ОписаниеОшибки();
			
			ЗаписьЖурналаРегистрации("УстановкаРасширенияМессенджера", УровеньЖурналаРегистрации.Ошибка,,, КомментарийОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КомментарийОшибки);
			
			Возврат;
			
		КонецПопытки;
		
		ЗащитаОтОпасныхДействий = Новый ОписаниеЗащитыОтОпасныхДействий();
		ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
		
		НовоеРасширениеМессенджера = РасширенияКонфигурации.Создать();
		
		НовоеРасширениеМессенджера.Активно										 = РасширениеАктивно;
		НовоеРасширениеМессенджера.БезопасныйРежим								 = Ложь;
		НовоеРасширениеМессенджера.ЗащитаОтОпасныхДействий						 = ЗащитаОтОпасныхДействий;
		НовоеРасширениеМессенджера.ИспользоватьОсновныеРолиДляВсехПользователей	 = Ложь;
		
		НовоеРасширениеМессенджера.Записать(ДанныеРасширения);
		
	КонецЕсли;
	
КонецПроцедуры

// Функция - Получить расширение месседжера
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьРасширениеМесседжера() Экспорт
	
	РасширениеМессенджера = Неопределено;
	
	Для Каждого Расширение Из РасширенияКонфигурации.Получить(Новый Структура("Имя", "Mессенджер"), ИсточникРасширенийКонфигурации.БазаДанных) Цикл
		РасширениеМессенджера = Расширение;
		Прервать;
	КонецЦикла;
	
	Если РасширениеМессенджера = Неопределено Тогда
		// Это разные имена, сделано ради возможности подключения защищенного и обычного расширений одновременно.
		Для Каждого Расширение Из РасширенияКонфигурации.Получить(Новый Структура("Имя", "Мессенджер"), ИсточникРасширенийКонфигурации.БазаДанных) Цикл
			РасширениеМессенджера = Расширение;
			Прервать;
		КонецЦикла;
	КонецЕсли;
	
	Если РасширениеМессенджера = Неопределено Тогда
		// Ищем расширения, содержащие слово "Мессенджер".
		Для Каждого Расширение Из РасширенияКонфигурации.Получить(,ИсточникРасширенийКонфигурации.БазаДанных) Цикл
			Если СтрНайти(НРег(Расширение.Имя), "мессенджер") Тогда
				РасширениеМессенджера = Расширение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат РасширениеМессенджера;
	
КонецФункции

// Функция - Требуется обновление поставляемого расширения
//
// Параметры:
//  УстановленноеРасширение				 - 	 - 
//  КонфигурацияПоставляемогоРасширения	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ТребуетсяОбновлениеПоставляемогоРасширения(УстановленноеРасширение, КонфигурацияПоставляемогоРасширения) Экспорт
	
	Если УстановленноеРасширение.БезопасныйРежим
		Или УстановленноеРасширение.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях
		Или УстановленноеРасширение.ИспользоватьОсновныеРолиДляВсехПользователей Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(УстановленноеРасширение.Версия) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ВерсияУстановленногоРасширения = СтрРазделить(УстановленноеРасширение.Версия, ".");
	ВерсияПоставляемогоРасширения = СтрРазделить(КонфигурацияПоставляемогоРасширения.Версия, ".");
	
	Если ВерсияУстановленногоРасширения.Количество() > ВерсияПоставляемогоРасширения.Количество() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Индекс = 0 По ВерсияПоставляемогоРасширения.Количество() - 1 Цикл
		
		Результат = Число(ВерсияПоставляемогоРасширения[Индекс]) - Число(ВерсияУстановленногоРасширения[Индекс]);
		
		Если Результат > 0 Тогда
			Возврат Истина;
			
		ИначеЕсли Результат < 0 Тогда
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Очистка пользовательских настроек именных отчетов.
Процедура ОчиститьПользовательскиеНастройкиВзаиморасчетыСПациентами() Экспорт
	
	ХранилищеСистемныхНастроек.Удалить("Отчет.ВзаиморасчетыСПациентами/Основной/ТекущиеПользовательскиеНастройки",,Неопределено);
	ХранилищеСистемныхНастроек.Удалить("Отчет.ВзаиморасчетыСПациентами/Основной_БЕЗ_ДЕТАЛИЗАЦИИ_ПО_СОТРУДНИКАМ/ТекущиеПользовательскиеНастройки",,Неопределено);
	ХранилищеСистемныхНастроек.Удалить("Отчет.ПерейтиВзаиморасчеты/Основной/ТекущиеПользовательскиеНастройки",,Неопределено);
	// ХранилищеВариантовОтчетов.Удалить("Отчет.ВзаиморасчетыСПациентами/Основной/ТекущиеПользовательскиеНастройки",,Неопределено);
	// ХранилищеВариантовОтчетов.Удалить("Отчет.ВзаиморасчетыСПациентами/Основной_БЕЗ_ДЕТАЛИЗАЦИИ_ПО_СОТРУДНИКАМ/ТекущиеПользовательскиеНастройки",,Неопределено);
	// ХранилищеВариантовОтчетов.Удалить("Отчет.ПерейтиВзаиморасчеты/Основной/ТекущиеПользовательскиеНастройки",,Неопределено);
	
КонецПроцедуры

// Вызывается при первоначальном заполнении базы.
//
Процедура ПервоначальноеЗаполнениеИБ() Экспорт
	
	Если Справочники.СтруктурныеЕдиницы.Выбрать().Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	// Обновляем список сервисов СМС рассылки
	Справочники.СервисыРассылки.УстановитьСервисSMSПоУмолчанию();
	
	// Шаблоны СМС
	Справочники.ШаблоныСообщений.ЗаполнитьПредопределенныеШаблоныSMS();
	
	// Создадим структуру папок Контрагентов
	Справочники.Контрагенты.ЗаполнитьПоУмолчанию(); 
	
	// Создадим структуру папок Сотрудников
	Справочники.Сотрудники.ЗаполнитьПоУмолчанию();
	
	// Создадим структуру папок Номенклатуры
	СоздатьПредопределенныеГруппыНоменклатуры();
	
	// Виды сделок
	ОбновитьПредопределнныеВидыСделок(); 
	
	//// Заполнение статей затрат.
	// ПрописатьВидыОперацийПредопределеннымСтатьям();
	
	// Создаем виды взаимодействий по умолчанию
	Справочники.ВидыВзаимодействий.ЗаполнитьСправочникВидыВзаимодействий();	
	
	// Заполняем предопределенные "ВидыЦен"
	ЗаполнитьПредопределенныеЭлементыВидовЦен();
	
	// Валюты
	СоздатьПредопределенныеЭлементыВалюты();
	// Создаем элемент в справочнике "Валюты"

	Если Константы.ВалютаУчета.Получить().Пустая() Тогда
		Константы.ВалютаУчета.Установить(Справочники.Валюты.НайтиПоКоду(643));
	Конецесли;

	Стр = Справочники.СтраныМира.НайтиПоНаименованию("БЕЛАРУСЬ");
	Если Стр.Пустая() Тогда
		Стр = Справочники.СтраныМира.СоздатьЭлемент();
		Стр.Наименование = "БЕЛАРУСЬ";
		Стр.Код = "112";
		Стр.КодАльфа2 = "BY";
		Стр.КодАльфа3 = "BLR";
		Стр.НаименованиеПолное = "Республика Беларусь";
		// Стр.ТелефонныйКод = "+375";
		// Стр.ВалютаУчета = Справочники.Валюты.НайтиПоКоду(974);
		Стр.Записать();
	КонецЕсли;	
	
	Стр = Справочники.СтраныМира.НайтиПоНаименованию("КАЗАХСТАН");
	Если Стр.Пустая() Тогда
		Стр = Справочники.СтраныМира.СоздатьЭлемент();
		Стр.Наименование = "КАЗАХСТАН";
		Стр.Код = "398";
		Стр.КодАльфа2 = "KZ";
		Стр.КодАльфа3 = "KAZ";
		Стр.НаименованиеПолное = "Республика Казахстан";
		// Стр.ТелефонныйКод = "+7";
		// Стр.ВалютаУчета = Справочники.Валюты.НайтиПоКоду(398);
		Стр.Записать();
	КонецЕсли;	
	
	Стр = Справочники.СтраныМира.НайтиПоНаименованию("УКРАИНА");
	Если Стр.Пустая() Тогда
		Стр = Справочники.СтраныМира.СоздатьЭлемент();
		Стр.Наименование = "УКРАИНА";
		Стр.Код = "804";
		Стр.КодАльфа2 = "UA";
		Стр.КодАльфа3 = "UKR";
		Стр.НаименованиеПолное = "Украина";
		// Стр.ТелефонныйКод = "+38";
		// Стр.ВалютаУчета = Справочники.Валюты.НайтиПоКоду(980);
		Стр.Записать();
	КонецЕсли;
	
	Стр = Справочники.СтраныМира.НайтиПоНаименованию("Россия");
	СтрОбъект = Стр.ПолучитьОбъект();
	// СтрОбъект.ТелефонныйКод = "+7";
	// СтрОбъект.ВалютаУчета = Справочники.Валюты.НайтиПоКоду(643);
	СтрОбъект.Записать();

	// Прописываем в константу Истина, для дальнейшего запуска Помощника Первоначального Заполнения
	Константы.ОткрыватьПомощникПервоначальногоЗаполненияПриЗапуске.Установить(Истина);
	
	// Прописываем в константу Истина, для дальнейшего использования
	Константы.ИспользоватьДополнительныеРеквизитыИСведения.Установить(Истина);
	
	// Прописываем в константу значение "ЕдинаяСеть"
	Константы.РежимРаботыСетиСтоматологий.Установить(Перечисления.РежимРаботыСетиСтоматологий.ЕдинаяСеть);
	
	// Прописываем стратегию списания товаров
	Константы.СпособОценкиМПЗ.Установить(Перечисления.СпособОценки.ФИФО);
	
	// Активизируем механизм автоматической синхронизации/создания документов поступления
	Константы.АвтоматическиСоздаватьПоступлениеПриВыполненииНарядЗаказа.Установить(Истина);
	
	Если Не ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		// Заполняем справочник диагнозов из классификатора
		Справочники.Диагнозы.ДобавитьДиагнозыИзКлассификатора();
		
		// Заполняем справочник КлассификаторДолжностей из классификатора
		Справочники.КлассификаторДолжностей.СоздатьЗначенияПоУмолчанию();
		// Заполняем справочник КлассификаторСоциальныхГрупп из классификатора
		Справочники.КлассификаторСоциальныхГрупп.СоздатьЗначенияПоУмолчанию();
		// Заполняем справочник КлассификаторСоциальныхСтатусов из классификатора
		Справочники.КлассификаторСоциальныхСтатусов.СоздатьЗначенияПоУмолчанию();
		// Заполняем справочник КлассификаторСпециальностей из классификатора
		Справочники.КлассификаторСпециальностей.СоздатьЗначенияПоУмолчанию();
	Конецесли;
	
	// Заполняем справчник "Метки" значениями по умолчанию.
	ОбщегоНазначенияСтоматология.ЗаполнитьМеткиПЗИКлиентовПоУмолчанию();	
	
	// Заполняем справочник "СостоянияЗубнойФормулы" по умолчанию.
	Справочники.СостояниеЗубнойФормулы.ЗаполнитьОбластиЗубнойФормулы();
	
	// Установить значение константы интервала перед профпросмотром после окончания лечения
	Константы.ИнтервалПередПрофОсмотром.Установить(6);
	
	// Установить значение константы период поиска невернувшихся клиентов
	Константы.ПериодПоискаНеВернувшихсяКлиентов.Установить(365);
	
	// Создаем значения по умолчанию справочника "ПричиныЗаписи"
	Справочники.ПричиныЗаписи.СоздатьЗначенияПоУмолчанию(); 
	
	// Создаем значения по умолчанию справочника "Специализации"
	Справочники.Специализации.СоздатьЗначенияПоУмолчанию(); 
	
	// Создаем значения по умолчанию справочника "Должности"
	Справочники.Должности.СоздатьЗначенияПоУмолчанию(); 
	
	// Заполнить виды контактной информации
	УстановитьСвойстваПредопределенныхВидовКонтактнойИнформации();
	
	// Заполняет справочник Степени родства
	ПрописатьОбратныеСтепениРодства();
	
	// Заполняем справочник классификатор услуг
	//Если Не ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Справочники.КлассификаторНоменклатурыМедицинскихУслуг.ЗаполнитьКлассификаторУслуг();
	//КонецЕсли;
	
	// Инициализируем предопределенный вид сделки
	Справочники.ВидыСделок.ИнициализироватьПредопределенныйВид_ПервичныйПовторныйПациент();

	//// Инициализируем предопределенные сценарии чат-бота, если подключено расширение
	//ИнициализацияПредопределенныхСценариевЧатБота();
	//
	//// Инициализируем триггеры по рекомендациям
	//ИнициализироватьМеханизмРекомендаций();

КонецПроцедуры

// Создание предопределенных групп Номенклатуры по умолчанию.
//
Процедура СоздатьПредопределенныеГруппыНоменклатуры() Экспорт
	
	// Создаем группы элементов в справочнике "Номенклатура"
	ЭлементСправочника = Справочники.Номенклатура.СоздатьГруппу();
	ЭлементСправочника.Наименование = "Товары";
	ЭлементСправочника.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас;
	ЭлементСправочника.Записать();
	
	ЭлементСправочника = Справочники.Номенклатура.СоздатьГруппу();
	ЭлементСправочника.Наименование = "Материалы";
	ЭлементСправочника.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал;
	ЭлементСправочника.Записать();
	
	ЭлементСправочника = Справочники.Номенклатура.СоздатьГруппу();
	ЭлементСправочника.Наименование = "Услуги";
	ЭлементСправочника.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга;
    ЭлементСправочника.Записать();
	
	
КонецПроцедуры

// Заполнение предопределенных Видов цен.	
//
Процедура ЗаполнитьПредопределенныеЭлементыВидовЦен() Экспорт
	
	// Заполняем предопределенные элементы справочника "ВидыЦен"
	ВидЦен = Справочники.ВидыЦен.Закупочная.ПолучитьОбъект();
	ВидЦен.ЦенаВключаетНДС = Истина;
	ВидЦен.ОкруглятьВБольшуюСторону = Истина;
	ВидЦен.ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр0_01;
	ВидЦен.Записать();
	
	ВидЦен = Справочники.ВидыЦен.Розничная.ПолучитьОбъект();
	ВидЦен.ЦенаВключаетНДС = Истина;
	ВидЦен.ОкруглятьВБольшуюСторону = Истина;
	ВидЦен.ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр0_01;
	ВидЦен.Записать();
	
	
КонецПроцедуры

// Процедура устанавливает номер версии конфигурации.
//
Процедура НомерВерсии() Экспорт
	
	НомерВерсии =  "2.1.1.1";
	
КонецПроцедуры

// Процедура - Обновить отчеты
// 
// Параметры:
//  Параметры	 - 	 - 
// 
Процедура ОбновитьОтчеты(Параметры = Неопределено) Экспорт
	
	ОтчетыСервер.Обновить();
	
КонецПроцедуры

// Процедура, заполняет регистр СвободныеИнтервалыСотрудников.
// 
Процедура ЗаполнитьРегистрСвободныеИнтервалыСотрудников() Экспорт
	
	НаборЗаписей = РегистрыСведений.СвободныеИнтервалыСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	МассивСтруктуррныхЕдиниц = Справочники.СтруктурныеЕдиницы.ВернутьМассивСтруктурныхЕдиниц();
	
	Для Каждого СтруктурнаяЕдиница Из МассивСтруктуррныхЕдиниц Цикл
		РегистрыСведений.СвободныеИнтервалыСотрудников.СформироватьИнтервалыПоСотрудникам(СтруктурнаяЕдиница);
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполняет значение константы "РежимРаботыСетиСтоматологий".
//
Процедура УстановитьРежимРаботыСетиСтоматологий() Экспорт
	
	ТипРежимаРаботы = Константы.РежимРаботыСетиСтоматологий.Получить();
	Если Не ЗначениеЗаполнено(ТипРежимаРаботы) Тогда 
		Константы.РежимРаботыСетиСтоматологий.Установить(Перечисления.РежимРаботыСетиСтоматологий.ЕдинаяСеть);
	КонецЕсли;
	
КонецПроцедуры

// Процедура перепроводит документы в исторической последовательности.
//
Процедура ПерепровестиИсторическиДокументыРеализацииСклада() Экспорт
	
	// Пересохраняем документы
	СписокИменДокументов = Новый Структура("ИнвентаризацияЗапасов, ПоступлениеДенежныхСредств"
				+ ",ОприходованиеЗапасов, ПеремещениеЗапасов, Поступление"
				+ ",ВозвратОтПокупателя, ВозвратПоставщику"
				+ ", Реализация, СписаниеЗапасов, СписаниеМатериалов");
	ПОПЫТКА	
		// Сообщить("Пересохраняются документы", СтатусСообщения.Информация);
		Для Каждого ИмяДокумента Из СписокИменДокументов Цикл
			ВыборкаДокумента = Документы[ИмяДокумента.Ключ].Выбрать();
			Пока ВыборкаДокумента.Следующий() Цикл
				ДокументОбъект = ВыборкаДокумента.ПолучитьОбъект();
				Если ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("Склад", ДокументОбъект.Ссылка.Метаданные()) 
					И ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("СтруктурнаяЕдиница", ДокументОбъект.Ссылка.Метаданные()) Тогда
					ДокументОбъект.СтруктурнаяЕдиница = ?(ТипЗнч(ДокументОбъект.Склад) = Тип("СправочникСсылка.Склады"), ДокументОбъект.Склад.СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
				КонецЕсли;
				Если ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("СкладПолучатель", ДокументОбъект.Ссылка.Метаданные()) 
					И ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("СтруктурнаяЕдиницаПолучатель", ДокументОбъект.Ссылка.Метаданные()) Тогда
					ДокументОбъект.СтруктурнаяЕдиницаПолучатель = ?(ТипЗнч(ДокументОбъект.СкладПолучатель) = Тип("СправочникСсылка.Склады"), ДокументОбъект.СкладПолучатель.СтруктурнаяЕдиница, ДокументОбъект.СтруктурнаяЕдиница);
				КонецЕсли;
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЦикла;
		КонецЦикла;
	ИСКЛЮЧЕНИЕ
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При пересохранении документов произошла ошибка.");
		Возврат;
	КОНЕЦПОПЫТКИ;		
	
	
	// Перепроводим документы прихода
	СписокИменДокументов = Новый Структура("ИнвентаризацияЗапасов, ПоступлениеДенежныхСредств"
				+ ",ОприходованиеЗапасов, ПеремещениеЗапасов, Поступление");
	ПОПЫТКА
		// Сообщить("Перепроводятся документы прихода", СтатусСообщения.Информация);
		ОбщегоНазначения.ПерепровестиИсторическиДокументы(СписокИменДокументов, Ложь);
	ИСКЛЮЧЕНИЕ
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При перепроведении документов прихода произошла ошибка. Перепроведите документы вручную!");
		Возврат;
	КОНЕЦПОПЫТКИ;
	
	// Перепроводим документы расхода
	СписокИменДокументов = Новый Структура("ВозвратОтПокупателя, ВозвратПоставщику"
				+ ", Реализация, СписаниеЗапасов, СписаниеМатериалов");
	ПОПЫТКА
		// Сообщить("Перепроводятся документы расхода", СтатусСообщения.Информация);
		ОбщегоНазначения.ПерепровестиИсторическиДокументы(СписокИменДокументов, Ложь);
	ИСКЛЮЧЕНИЕ
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При перепроведении документов расхода произошла ошибка. Перепроведите документы вручную!");		
		Возврат;
	КОНЕЦПОПЫТКИ;
		
КонецПроцедуры

// Процедура перепроводит документы в исторической последовательности.
//
Процедура ОбновитьСервисыСМС() Экспорт
	
	Справочники.СервисыРассылки.ОбновитьСервисыSMS();
	
	Если Константы.СервисSMSРассылкиПоУмолчанию.Получить().Пустая() Тогда
		СервисПоУмолчанию = Справочники.СервисыРассылки.НайтиПоРеквизиту("ИмяОбработки", "СервисHelixSMS");
		Константы.СервисSMSРассылкиПоУмолчанию.Установить(СервисПоУмолчанию);
	КонецЕсли;
		
КонецПроцедуры

// Процедура, устанавливает Структурную единицу существующим элемантам справочника.
//
Процедура ДобавитьСтруктурнуюЕдиницуВВидыНачислений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиСотрудников.Сотрудник,
		|	НастройкиСотрудников.СтруктурнаяЕдиница
		|ИЗ
		|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников";
	ТаблицаНастройкиСотрудников = Запрос.Выполнить().Выгрузить();

	ВыборкаЭлементов = Справочники.НачисленияИУдержанияСотрудников.Выбрать();
	Пока ВыборкаЭлементов.Следующий() Цикл
		Если ТаблицаНастройкиСотрудников.Найти(ВыборкаЭлементов.Владелец, "Сотрудник") <> Неопределено и НЕ ВыборкаЭлементов.ЭтоГруппа Тогда
			ЭлементОбъект = ВыборкаЭлементов.ПолучитьОбъект();
			ЭлементОбъект.СтруктурнаяЕдиница = ТаблицаНастройкиСотрудников.Найти(ВыборкаЭлементов.Владелец, "Сотрудник").СтруктурнаяЕдиница;
			ЭлементОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура осуществляет обновление вариантов отчетов.
//
Процедура ОбновитьВсеОтчеты() Экспорт
	
	ВариантыОтчетов.ОбновлениеВариантовОтчетов();
	
КонецПроцедуры

// Процедура переносит значения ресурса УпаковкаУдалить в измерение Упаковка регистра сведений.
// КритическиеОстатки и очищаяет данный ресурс.
Процедура ПереносУпаковкиВРегистреКритическиеОстатки() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                      |	КритическиеОстатки.Номенклатура,
	                      |	КритическиеОстатки.Склад,
						  | ЕСТЬNULL(КритическиеОстатки.Склад.СтруктурнаяЕдиница, &ТекущаяСтруктурнаяЕдиница) КАК СтруктурнаяЕдиница,
	                      |	ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка) КАК УпаковкаУдалить,
	                      |	МАКСИМУМ(КритическиеОстатки.Количество) КАК Количество,
	                      |	МАКСИМУМ(КритическиеОстатки.УпаковкаУдалить) КАК Упаковка
	                      |ИЗ
	                      |	РегистрСведений.КритическиеОстатки КАК КритическиеОстатки
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	КритическиеОстатки.Номенклатура,
	                      |	КритическиеОстатки.Склад,
	                      |	ЕСТЬNULL(КритическиеОстатки.Склад.СтруктурнаяЕдиница, &ТекущаяСтруктурнаяЕдиница),
	                      |	ЕСТЬNULL(КритическиеОстатки.Склад.СтруктурнаяЕдиница, &ТекущаяСтруктурнаяЕдиница)");
						  
	Запрос.УстановитьПараметр("ТекущаяСтруктурнаяЕдиница",ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	Результат = Запрос.Выполнить().Выгрузить();
	
	ТаблицаРегистра = РегистрыСведений.КритическиеОстатки.СоздатьНаборЗаписей();
	ТаблицаРегистра.Загрузить(Результат);
	ТаблицаРегистра.Записать(Истина);
	
КонецПроцедуры

// Процедура выбирает все записи по регситру профосмотры и проставляет измерение Вид осмотра.
//
Процедура ПрописатьВидыОсмотровВРегистрПрфосомотры() Экспорт	
	Попытка 
		НаборЗаписейПерезаписи = РегистрыСведений.Профосмотры.СоздатьНаборЗаписей();
		НаборЗаписейПерезаписи.Отбор.ВидОсмотра.Значение = Перечисления.ВидыОсмотров.ПустаяСсылка();
		НаборЗаписейПерезаписи.Отбор.ВидОсмотра.Использование = Истина;
		НаборЗаписейПерезаписи.Прочитать();
		
		НаборЗаписейУдаления = РегистрыСведений.Профосмотры.СоздатьНаборЗаписей();
		НаборЗаписейУдаления.Отбор.ВидОсмотра.Значение = Перечисления.ВидыОсмотров.ПустаяСсылка();
		НаборЗаписейУдаления.Отбор.ВидОсмотра.Использование = Истина;	
		НаборЗаписейУдаления.Записать(Истина);
		
		Для Каждого ЭлементН ИЗ НаборЗаписейПерезаписи Цикл
			ЭлементН.ВидОсмотра = Перечисления.ВидыОсмотров.Профосмотр;		
		КонецЦикла;
		НаборЗаписейПерезаписи.Отбор.ВидОсмотра.Значение = Перечисления.ВидыОсмотров.Профосмотр;
		НаборЗаписейПерезаписи.Отбор.ВидОсмотра.Использование = Истина;
		НаборЗаписейПерезаписи.Записать(Истина);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось выполнить процедуру ПрописатьВидыОсмотровВРегистрПрофсомотры");
	КонецПопытки;
КонецПроцедуры

// Процедура выбирает все записи по регситру профосмотры и проставляет измерение СЕ.
//
Процедура ПрописатьОбратныеСтепениРодства() Экспорт
	
	СтепеньРодстваОбъект = Справочники.СтепеньРодства.Отец.ПолучитьОбъект();
	СтепеньРодстваОбъект.ОбратнаяСвязьМуж = Справочники.СтепеньРодства.Сын;
	СтепеньРодстваОбъект.ОбратнаяСвязьЖен = Справочники.СтепеньРодства.Дочь;
	СтепеньРодстваОбъект.КемПриходится = "Отцом";
	СтепеньРодстваОбъект.Записать();
	
	СтепеньРодстваОбъект = Справочники.СтепеньРодства.Мать.ПолучитьОбъект();
	СтепеньРодстваОбъект.ОбратнаяСвязьМуж = Справочники.СтепеньРодства.Сын;
	СтепеньРодстваОбъект.ОбратнаяСвязьЖен = Справочники.СтепеньРодства.Дочь;
	СтепеньРодстваОбъект.КемПриходится = "Матерью";
	СтепеньРодстваОбъект.Записать();
	
	СтепеньРодстваОбъект = Справочники.СтепеньРодства.Сын.ПолучитьОбъект();
	СтепеньРодстваОбъект.ОбратнаяСвязьМуж = Справочники.СтепеньРодства.Отец;
	СтепеньРодстваОбъект.ОбратнаяСвязьЖен = Справочники.СтепеньРодства.Мать;
	СтепеньРодстваОбъект.КемПриходится = "Сыном";
	СтепеньРодстваОбъект.Записать();
	
	СтепеньРодстваОбъект = Справочники.СтепеньРодства.Дочь.ПолучитьОбъект();
	СтепеньРодстваОбъект.ОбратнаяСвязьМуж = Справочники.СтепеньРодства.Отец;
	СтепеньРодстваОбъект.ОбратнаяСвязьЖен = Справочники.СтепеньРодства.Мать;
	СтепеньРодстваОбъект.КемПриходится = "Дочкой";
	СтепеньРодстваОбъект.Записать();
	
	СтепеньРодстваОбъект = Справочники.СтепеньРодства.Брат.ПолучитьОбъект();
	СтепеньРодстваОбъект.ОбратнаяСвязьМуж = Справочники.СтепеньРодства.Брат;
	СтепеньРодстваОбъект.ОбратнаяСвязьЖен = Справочники.СтепеньРодства.Сестра;
	СтепеньРодстваОбъект.КемПриходится = "Братом";
	СтепеньРодстваОбъект.Записать();
	
	СтепеньРодстваОбъект = Справочники.СтепеньРодства.Сестра.ПолучитьОбъект();
	СтепеньРодстваОбъект.ОбратнаяСвязьМуж = Справочники.СтепеньРодства.Брат;
	СтепеньРодстваОбъект.ОбратнаяСвязьЖен = Справочники.СтепеньРодства.Сестра;
	СтепеньРодстваОбъект.КемПриходится = "Сестрой";
	СтепеньРодстваОбъект.Записать();
	
	СтепеньРодстваОбъект = Справочники.СтепеньРодства.Дедушка.ПолучитьОбъект();
	СтепеньРодстваОбъект.ОбратнаяСвязьМуж = Справочники.СтепеньРодства.Внук;
	СтепеньРодстваОбъект.ОбратнаяСвязьЖен = Справочники.СтепеньРодства.Внучка;
	СтепеньРодстваОбъект.КемПриходится = "Дедушкой";
	СтепеньРодстваОбъект.Записать();
	
	СтепеньРодстваОбъект = Справочники.СтепеньРодства.Бабушка.ПолучитьОбъект();
	СтепеньРодстваОбъект.ОбратнаяСвязьМуж = Справочники.СтепеньРодства.Внук;
	СтепеньРодстваОбъект.ОбратнаяСвязьЖен = Справочники.СтепеньРодства.Внучка;
	СтепеньРодстваОбъект.КемПриходится = "Бабушкой";
	СтепеньРодстваОбъект.Записать();
	
	СтепеньРодстваОбъект = Справочники.СтепеньРодства.Внук.ПолучитьОбъект();
	СтепеньРодстваОбъект.ОбратнаяСвязьМуж = Справочники.СтепеньРодства.Дедушка;
	СтепеньРодстваОбъект.ОбратнаяСвязьЖен = Справочники.СтепеньРодства.Бабушка;
	СтепеньРодстваОбъект.КемПриходится = "Внуком";
	СтепеньРодстваОбъект.Записать();
	
	СтепеньРодстваОбъект = Справочники.СтепеньРодства.Внучка.ПолучитьОбъект();
	СтепеньРодстваОбъект.ОбратнаяСвязьМуж = Справочники.СтепеньРодства.Дедушка;
	СтепеньРодстваОбъект.ОбратнаяСвязьЖен = Справочники.СтепеньРодства.Бабушка;
	СтепеньРодстваОбъект.КемПриходится = "Внучкой";
	СтепеньРодстваОбъект.Записать();
	
	СтепеньРодстваОбъект = Справочники.СтепеньРодства.Дядя.ПолучитьОбъект();
	СтепеньРодстваОбъект.ОбратнаяСвязьМуж = Справочники.СтепеньРодства.Племянник;
	СтепеньРодстваОбъект.ОбратнаяСвязьЖен = Справочники.СтепеньРодства.Племянница;
	СтепеньРодстваОбъект.КемПриходится = "Дядей";
	СтепеньРодстваОбъект.Записать();
	
	СтепеньРодстваОбъект = Справочники.СтепеньРодства.Тетя.ПолучитьОбъект();
	СтепеньРодстваОбъект.ОбратнаяСвязьМуж = Справочники.СтепеньРодства.Племянник;
	СтепеньРодстваОбъект.ОбратнаяСвязьЖен = Справочники.СтепеньРодства.Племянница;
	СтепеньРодстваОбъект.КемПриходится = "Тётей";
	СтепеньРодстваОбъект.Записать();
	
	СтепеньРодстваОбъект = Справочники.СтепеньРодства.Племянник.ПолучитьОбъект();
	СтепеньРодстваОбъект.ОбратнаяСвязьМуж = Справочники.СтепеньРодства.Дядя;
	СтепеньРодстваОбъект.ОбратнаяСвязьЖен = Справочники.СтепеньРодства.Тетя;
	СтепеньРодстваОбъект.КемПриходится = "Племянником";
	СтепеньРодстваОбъект.Записать();
	
	СтепеньРодстваОбъект = Справочники.СтепеньРодства.Племянница.ПолучитьОбъект();
	СтепеньРодстваОбъект.ОбратнаяСвязьМуж = Справочники.СтепеньРодства.Дядя;
	СтепеньРодстваОбъект.ОбратнаяСвязьЖен = Справочники.СтепеньРодства.Тетя;
	СтепеньРодстваОбъект.КемПриходится = "Племянницей";
	СтепеньРодстваОбъект.Записать();
	
	СтепеньРодстваОбъект = Справочники.СтепеньРодства.Муж.ПолучитьОбъект();
	СтепеньРодстваОбъект.ОбратнаяСвязьМуж = Справочники.СтепеньРодства.Жена;
	СтепеньРодстваОбъект.ОбратнаяСвязьЖен = Справочники.СтепеньРодства.Жена;
	СтепеньРодстваОбъект.КемПриходится = "Мужем";
	СтепеньРодстваОбъект.Записать();
	
	СтепеньРодстваОбъект = Справочники.СтепеньРодства.Жена.ПолучитьОбъект();
	СтепеньРодстваОбъект.ОбратнаяСвязьМуж = Справочники.СтепеньРодства.Муж;
	СтепеньРодстваОбъект.ОбратнаяСвязьЖен = Справочники.СтепеньРодства.Муж;
	СтепеньРодстваОбъект.КемПриходится = "Женой";
	СтепеньРодстваОбъект.Записать();

	
КонецПроцедуры

// Процедура устанавливает печатную форму предопределенному виду медицинской карты "ОсновнойВидМедицинскойКарты".
//
Процедура УстановитьПредопределеннымВидамМедКартПечатнуюФорму() Экспорт
	
	ПредопределенныйВидМедКарты = Справочники.ВидыМедицинскихКарт.НайтиПоКоду("000000001");
	Если ПредопределенныйВидМедКарты <> Неопределено Тогда 
		Если ПредопределенныйВидМедКарты <> Справочники.ВидыМедицинскихКарт.ПустаяСсылка() Тогда
			ВидМедКартыОбъект = ПредопределенныйВидМедКарты.ПолучитьОбъект();
			ВидМедКартыОбъект.ПечатнаяФорма = Перечисления.ПечатныеФормыМедицинскихКарт.АмбулаторнаяКарта_043_У_А4;
			ВидМедКартыОбъект.Записать();
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

// Процедура устанавливает медкартам пациентов код без лидирующих нулей.
//
Процедура УстановитьМедКартамКодБезЛидирующихНулей() Экспорт
	
	ВыборкаМедКарт = Справочники.МедицинскиеКарты.Выбрать();
	Пока ВыборкаМедКарт.Следующий() Цикл 
		МедКартаОбъект = ВыборкаМедКарт.Ссылка.ПолучитьОбъект();
		МедКартаОбъект.КодБезНулей = ФормированиеПечатныхФорм.УдалитьЛидирующиеНулиИзНомераОбъекта(МедКартаОбъект.Код);
		Попытка		
        	МедКартаОбъект.Записать();
		Исключение
			
		КонецПопытки;	
	КонецЦикла;	
	
КонецПроцедуры
                                         
// Заполнить страну учета если не заполнена 
//
Процедура УстановитьСтрануУчетаПоУмолчанию() Экспорт
	
	Если Константы.СтранаУчета.Получить().Пустая() Тогда 
		РФ = Справочники.СтраныМира.НайтиПоКоду("643");
		Если ЗначениеЗаполнено(РФ) Тогда 
			Константы.СтранаУчета.Установить(РФ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Обновление системы шаблонов смотров. Создание новых шаблонов. 
Процедура ОбновлениеПодсистемыШаблоновОсмотров() Экспорт
	
	// Заполнение первичного приема	
	ПервичныйСтоматологическийОсмотр               = Справочники.ШаблоныОбследований.ПервичныйСтоматологическийОсмотр.ПолучитьОбъект();
	ПервичныйСтоматологическийОсмотр.Наименование  = "Первичный стоматологический осмотр";
	ПервичныйСтоматологическийОсмотр.Специализация = Справочники.Специализации.Стоматология;
	ПервичныйСтоматологическийОсмотр.HTMLШаблон    = 
	"|<html><HEAD>
	 |<META content=""text/html; charset=utf-8"" http-equiv=Content-Type>
	 |<STYLE type=text/css>.no_border_doc {
	 |	HEIGHT: 29cm; WIDTH: 21cm
	 |}
	 |.border {
	 |	BORDER-TOP: #cccccc 1px solid; HEIGHT: 29cm; BORDER-RIGHT: #cccccc 1px solid; BORDER-BOTTOM: #cccccc 1px solid; TEXT-ALIGN: left; BORDER-LEFT: #cccccc 1px solid; WIDTH: 21cm
	 |}
	 |.element {
	 |	COLOR: #ad7e0d; PADDING-BOTTOM: 1px; PADDING-TOP: 1px; PADDING-LEFT: 1px; PADDING-RIGHT: 1px
	 |}
	 |.element A {
	 |	COLOR: #000000; TEXT-DECORATION: none
	 |}
	 |.add_element A {
	 |	COLOR: #1834a1; TEXT-DECORATION: none
	 |}
	 |.add_element A:hover {
	 |	COLOR: #0b78b9
	 | }
	 |.element A:hover {
	 |	COLOR: #918f89
	 |}
	 |.add_element {
	 |	COLOR: #ad7e0d
	 |}
	 |BR {
	 |	MARGIN: 0px
	 |}
	 |P {
	 |	MARGIN-BOTTOM: 4px; MARGIN-TOP: 0px
	 |}
	 |TABLE {
	 |	MARGIN-BOTTOM: 4px; BORDER-TOP: 0px solid; BORDER-RIGHT: 0px solid; BORDER-BOTTOM: 0px solid; BORDER-LEFT: 0px solid; MARGIN-TOP: 0px
	 |}
	 |DIV {
	 |	MARGIN-BOTTOM: 4px; MARGIN-TOP: 0px
	 |}
	 |H1 {
	 |	FONT-SIZE: 14pt; TEXT-ALIGN: center
	 |}
	 |</STYLE></HEAD>
	 |<BODY contentEditable=true>
	 |<DIV align=center>
	 |<DIV class=border>
	 |<DIV class=FORMAT align=center><FONT size=4><STRONG>Титульный лист</STRONG></FONT></DIV>
	 |<DIV class=FORMAT align=left>&nbsp;</DIV>
	 |<TABLE class=element>
	 |<TBODY>
	 |<TR>
	 |<TD>Диагноз:</TD>
	 |<TD class=add_element><A id=[Диагноз],Addition title=0 href=""about:"">&lt;добавить...&gt;</A></TD></TR></TBODY></TABLE>
	 |<DIV class=add_element>&nbsp;Жалобы: <A id=[Жалобы] title=1 href=""about:"">&lt;выбрать...&gt;</A></DIV>
	 |<DIV class=add_element>&nbsp;Перенесенные и сопутствующие заболевания: <A id=[ПеренесенныеИСопутствующиеЗаболевания] title=2 href=""about:"">&lt;выбрать...&gt;</A></DIV>
	 |<DIV class=add_element>&nbsp;Развитие настоящего заболевания: <A id=[РазвитиеНастоящегоЗаболевания] title=3 href=""about:"">&lt;выбрать...&gt;</A></DIV>
	 |<TABLE class=element>
	 |<TBODY>
	 |<TR>
	 |<TD>Данные объективного исследования:</TD>
	 |<TD class=add_element><A id=[ДанныеОбъективногоИсследования],Addition title=4 href=""about:"">&lt;добавить...&gt;</A></TD></TR></TBODY></TABLE>
	 |<DIV class=add_element>&nbsp;Прикус: <A id=[Прикус] title=5 href=""about:"">&lt;выбрать...&gt;</A></DIV>
	 |<DIV class=add_element>&nbsp;Состояние слизистой оболочки полости рта: <A id=[СостояниеСлизистойОболочкиПолостиРта] title=6 href=""about:"">&lt;выбрать...&gt;</A></DIV>
	 |<DIV class=add_element>&nbsp;Данные рентгеновских, лабораторных исследований: <A id=[ДанныеРентгеновскихЛабораторныхИсследований] title=7 href=""about:"">&lt;выбрать...&gt;</A></DIV>
	 |<DIV class=add_element>&nbsp;</DIV>
	 |<DIV class=add_element align=center><FONT color=#272727 size=4><STRONG>Дневник лечения</STRONG></FONT></DIV>
	 |<DIV class=add_element align=left><STRONG><FONT color=#272727 size=4></FONT></STRONG>&nbsp;</DIV>
	 |<TABLE class=element>
	 |<TBODY>
	 |<TR>
	 |<TD>План лечения:</TD>
	 |<TD class=add_element><A id=[ПланЛечения],Addition title=8 href=""about:"">&lt;добавить...&gt;</A></TD></TR></TBODY></TABLE>
	 |<TABLE class=element>
	 |<TBODY>
	 |<TR>
	 |<TD>Лечение:</TD>
	 |<TD class=add_element><A id=[Лечение],Addition title=9 href=""about:"">&lt;добавить...&gt;</A></TD></TR></TBODY></TABLE>
	 |<DIV class=add_element>&nbsp;Наставления: <A id=[Наставления] title=10 href=""about:"">&lt;выбрать...&gt;</A></DIV>
	 |<TABLE class=element>
	 |<TBODY>
	 |<TR>
	 |<TD>Эпикриз:</TD>
	 |<TD class=add_element><A id=[Эпикриз],Addition title=11 href=""about:"">&lt;добавить...&gt;</A></TD></TR></TBODY></TABLE></DIV></DIV></BODY></html>";	
	 
	 // Установка идентификаторов параметров шаблона
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[Диагноз]", ПланыВидовХарактеристик.ПараметрыОбследований.Диагноз.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[Жалобы]", ПланыВидовХарактеристик.ПараметрыОбследований.Жалобы.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[ПеренесенныеИСопутствующиеЗаболевания]", ПланыВидовХарактеристик.ПараметрыОбследований.ПеренесенныеИСопутствующиеЗаболевания.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[РазвитиеНастоящегоЗаболевания]", ПланыВидовХарактеристик.ПараметрыОбследований.РазвитиеНастоящегоЗаболевания.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[ДанныеОбъективногоИсследования]", ПланыВидовХарактеристик.ПараметрыОбследований.ДанныеОбъективногоИсследования.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[Прикус]", ПланыВидовХарактеристик.ПараметрыОбследований.Прикус.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[СостояниеСлизистойОболочкиПолостиРта]", ПланыВидовХарактеристик.ПараметрыОбследований.СостояниеСлизистойОболочкиПолостиРта.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[ДанныеРентгеновскихЛабораторныхИсследований]", ПланыВидовХарактеристик.ПараметрыОбследований.ДанныеРентгеновскихЛабораторныхИсследований.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[ПланЛечения]", ПланыВидовХарактеристик.ПараметрыОбследований.ПланЛечения.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[Лечение]", ПланыВидовХарактеристик.ПараметрыОбследований.Лечение.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[Наставления]", ПланыВидовХарактеристик.ПараметрыОбследований.Наставления.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[Эпикриз]", ПланыВидовХарактеристик.ПараметрыОбследований.Эпикриз.УникальныйИдентификатор());

	// Добавдение строк в таблицу соответсвий парамтеров
	ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Очистить();
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Диагноз;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Жалобы;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.ПеренесенныеИСопутствующиеЗаболевания;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.РазвитиеНастоящегоЗаболевания;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.ДанныеОбъективногоИсследования;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Прикус;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.СостояниеСлизистойОболочкиПолостиРта;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.ДанныеРентгеновскихЛабораторныхИсследований;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.ПланЛечения;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Лечение;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Наставления;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Эпикриз;
	
	ПервичныйСтоматологическийОсмотр.Записать();

	
	// Заполнение повторного приема	
	ПовторныйСтоматологическийОсмотр               = Справочники.ШаблоныОбследований.ПовторныйСтоматологическийОсмотр.ПолучитьОбъект();
	ПовторныйСтоматологическийОсмотр.Наименование  = "Повторный стоматологический осмотр";
	ПовторныйСтоматологическийОсмотр.Специализация = Справочники.Специализации.Стоматология;
	ПовторныйСтоматологическийОсмотр.HTMLШаблон    = 
	"<html><HEAD>
	|<META content=""text/html; charset=utf-8"" http-equiv=Content-Type>
	|<STYLE type=text/css>.no_border_doc {
	|	HEIGHT: 29cm; WIDTH: 21cm
	|}
	|.border {
	|	BORDER-TOP: #cccccc 1px solid; HEIGHT: 29cm; BORDER-RIGHT: #cccccc 1px solid; BORDER-BOTTOM: #cccccc 1px solid; TEXT-ALIGN: left; BORDER-LEFT: #cccccc 1px solid; WIDTH: 21cm
	|}
	|.element {
	|	COLOR: #ad7e0d; PADDING-BOTTOM: 1px; PADDING-TOP: 1px; PADDING-LEFT: 1px; PADDING-RIGHT: 1px
	|}
	|.element A {
	|	COLOR: #000000; TEXT-DECORATION: none
	|}
	|.add_element A {
	|	COLOR: #1834a1; TEXT-DECORATION: none
	|}
	|.add_element A:hover {
	|	COLOR: #0b78b9
	|}
	|.element A:hover {
	|	COLOR: #918f89
	|}
	|.add_element {
	|	COLOR: #ad7e0d
	|}
	|BR {
	|	MARGIN: 0px
	|}
	|P {
	|	MARGIN-BOTTOM: 4px; MARGIN-TOP: 0px
	|}
	|TABLE {
	|	MARGIN-BOTTOM: 4px; BORDER-TOP: 0px solid; BORDER-RIGHT: 0px solid; BORDER-BOTTOM: 0px solid; BORDER-LEFT: 0px solid; MARGIN-TOP: 0px
	|}
	|DIV {
	|	MARGIN-BOTTOM: 4px; MARGIN-TOP: 0px
	|}
	|H1 {
	|	FONT-SIZE: 14pt; TEXT-ALIGN: center
	|}
	|</STYLE></HEAD>
	|<BODY contentEditable=true>
	|<DIV align=center>
	|<DIV class=border>
	|<DIV class=FORMAT align=center><FONT size=4><STRONG>Дневник лечения</STRONG></FONT>&nbsp;</DIV>
	|<DIV class=FORMAT align=left>&nbsp;</DIV>
	|<DIV class=add_element>&nbsp;Развитие настоящего заболевания: <A id=[РазвитиеНастоящегоЗаболевания] title=0 href=""about:"">&lt;выбрать...&gt;</A></DIV>
	|<DIV class=add_element>&nbsp;Жалобы: <A id=[Жалобы] title=1 href=""about:"">&lt;выбрать...&gt;</A></DIV>
	|<TABLE class=element>
	|<TBODY>
	|<TR>
	|<TD>Данные объективного исследования:</TD>
	|<TD class=add_element><A id=[ДанныеОбъективногоИсследования],Addition title=2 href=""about:"">&lt;добавить...&gt;</A></TD></TR></TBODY></TABLE>
	|<DIV class=add_element>&nbsp;Данные рентгеновских, лабораторных исследований: <A id=[ДанныеРентгеновскихЛабораторныхИсследований] title=3 href=""about:"">&lt;выбрать...&gt;</A></DIV>
	|<TABLE class=element>
	|<TBODY>
	|<TR>
	|<TD>Диагноз:</TD>
	|<TD class=add_element><A id=[Диагноз],Addition title=4 href=""about:"">&lt;добавить...&gt;</A></TD></TR></TBODY></TABLE>
	|<TABLE class=element>
	|<TBODY>
	|<TR>
	|<TD>План лечения:</TD>
	|<TD class=add_element><A id=[ПланЛечения],Addition title=5 href=""about:"">&lt;добавить...&gt;</A></TD></TR></TBODY></TABLE>
	|<TABLE class=element>
	|<TBODY>
	|<TR>
	|<TD>Лечение:</TD>
	|<TD class=add_element><A id=[Лечение],Addition title=6 href=""about:"">&lt;добавить...&gt;</A></TD></TR></TBODY></TABLE>
	|<DIV class=add_element>&nbsp;Наставления: <A id=[Наставления] title=7 href=""about:"">&lt;выбрать...&gt;</A></DIV>
	|<TABLE class=element>
	|<TBODY>
	|<TR>
	|<TD>Эпикриз:</TD>
	|<TD class=add_element><A id=[Эпикриз],Addition title=8 href=""about:"">&lt;добавить...&gt;</A></TD></TR></TBODY></TABLE></DIV></DIV></BODY></html>";	

		 // Установка идентификаторов параметров шаблона
	ПовторныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПовторныйСтоматологическийОсмотр.HTMLШаблон,"[РазвитиеНастоящегоЗаболевания]", ПланыВидовХарактеристик.ПараметрыОбследований.РазвитиеНастоящегоЗаболевания.УникальныйИдентификатор());
	ПовторныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПовторныйСтоматологическийОсмотр.HTMLШаблон,"[Жалобы]", ПланыВидовХарактеристик.ПараметрыОбследований.Жалобы.УникальныйИдентификатор());
	ПовторныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПовторныйСтоматологическийОсмотр.HTMLШаблон,"[ДанныеОбъективногоИсследования]", ПланыВидовХарактеристик.ПараметрыОбследований.ДанныеОбъективногоИсследования.УникальныйИдентификатор());
	ПовторныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПовторныйСтоматологическийОсмотр.HTMLШаблон,"[ДанныеРентгеновскихЛабораторныхИсследований]", ПланыВидовХарактеристик.ПараметрыОбследований.ДанныеРентгеновскихЛабораторныхИсследований.УникальныйИдентификатор());
	ПовторныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПовторныйСтоматологическийОсмотр.HTMLШаблон,"[Диагноз]", ПланыВидовХарактеристик.ПараметрыОбследований.Диагноз.УникальныйИдентификатор());
	ПовторныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПовторныйСтоматологическийОсмотр.HTMLШаблон,"[ПланЛечения]", ПланыВидовХарактеристик.ПараметрыОбследований.ПланЛечения.УникальныйИдентификатор());
	ПовторныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПовторныйСтоматологическийОсмотр.HTMLШаблон,"[Лечение]", ПланыВидовХарактеристик.ПараметрыОбследований.Лечение.УникальныйИдентификатор());
	ПовторныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПовторныйСтоматологическийОсмотр.HTMLШаблон,"[Наставления]", ПланыВидовХарактеристик.ПараметрыОбследований.Наставления.УникальныйИдентификатор());
	ПовторныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПовторныйСтоматологическийОсмотр.HTMLШаблон,"[Эпикриз]", ПланыВидовХарактеристик.ПараметрыОбследований.Эпикриз.УникальныйИдентификатор());

	// Добавдение строк в таблицу соответсвий парамтеров
	ПовторныйСтоматологическийОсмотр.СоответствияПараметрам.Очистить();
	НоваяСтрока          = ПовторныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.РазвитиеНастоящегоЗаболевания;
	НоваяСтрока          = ПовторныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Жалобы;
	НоваяСтрока          = ПовторныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.ДанныеОбъективногоИсследования;
	НоваяСтрока          = ПовторныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.ДанныеРентгеновскихЛабораторныхИсследований;
	НоваяСтрока          = ПовторныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Диагноз;
	НоваяСтрока          = ПовторныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.ПланЛечения;
	НоваяСтрока          = ПовторныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Лечение;
	НоваяСтрока          = ПовторныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Наставления;
	НоваяСтрока          = ПовторныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Эпикриз;
	
	ПовторныйСтоматологическийОсмотр.Записать();

КонецПроцедуры

// Процедура устанавливает режим списания материалов
//
Процедура ПроизводитьСписаниеМатериаловПриЗакрытииКассовойСмены() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.СписыватьМатериалыПриЗакрытииКассовойСмены.Установить(Истина);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры используемые при обмене данными

// Процедура является обработчиком события ПриОтправкеДанныхПодчиненному.
//
// Параметры:
// см. описание обработчика события ПриОтправкеДанныхПодчиненному() в синтаксис-помощнике.
// 
Процедура ПриОтправкеВерсийПодсистем(ЭлементДанных, ОтправкаЭлемента, Знач СозданиеНачальногоОбраза = Ложь) Экспорт
	
	Если ОтправкаЭлемента = ОтправкаЭлементаДанных.Удалить
		ИЛИ ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать Тогда
		
		// Стандартную обработку не переопределяем
		
	ИначеЕсли ТипЗнч(ЭлементДанных) = Тип("РегистрСведенийНаборЗаписей.ВерсииПодсистем") Тогда
		
		Если СозданиеНачальногоОбраза Тогда
			
			Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
				
				Если ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
					
					Для Каждого СтрокаНабора Из ЭлементДанных Цикл
						
						ТекстЗапроса =
						"ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	ВерсииПодсистемОбластейДанных.Версия КАК Версия
						|ИЗ
						|	РегистрСведений.ВерсииПодсистемОбластейДанных КАК ВерсииПодсистемОбластейДанных
						|ГДЕ
						|	ВерсииПодсистемОбластейДанных.ИмяПодсистемы = &ИмяПодсистемы";
						
						Запрос = Новый Запрос;
						Запрос.УстановитьПараметр("ИмяПодсистемы", СтрокаНабора.ИмяПодсистемы);
						Запрос.Текст = ТекстЗапроса;
						
						Выборка = Запрос.Выполнить().Выбрать();
						
						Если Выборка.Следующий() Тогда
							
							СтрокаНабора.Версия = Выборка.Версия;
							
						Иначе
							
							СтрокаНабора.Версия = "";
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			Иначе
				
				// При создании начального образа с отключенным разделением
				// выгрузку регистра выполняем без дополнительной обработки.
				
			КонецЕсли;
			
		Иначе
			
			// Выгрузку регистра выполняем только при создании начального образа
			ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура обновляет/дозаполняет предопределнные виды КИ
//
// Для справочников:
// - Контрагент
// - Физ. лица
// - Контактные лица
// 
// Справочник "Организации" обновляется/дозаполняется механизмами БСП.
//
Процедура ОбновитьПредопределенныеВидыКонтактнойИнформации() Экспорт
	
	// Обновить виды КИ	
	КонтактнаяИнформацияСервер.УстановитьСвойстваПредопределенныхВидовКонтактнойИнформации();
	
КонецПроцедуры

// Процедура обновляет значения контактной информации
//
Процедура ОбновитьКонтактнуюИнформацию(Параметры = Неопределено) Экспорт 

	УстановитьПривилегированныйРежим(Истина);
		
	КонтактнаяИнформацияСервер.УстановитьСвойстваПредопределенныхВидовКонтактнойИнформации();
	// Обновляем клиентов
	УИДТелКлиенты = Справочники.ВидыКонтактнойИнформации.ТелефонКлиента.УникальныйИдентификатор();
	УИДАдрКлиенты = Справочники.ВидыКонтактнойИнформации.АдресКлиента.УникальныйИдентификатор();
	УИДЭлПКлиенты = Справочники.ВидыКонтактнойИнформации.EmailКлиента.УникальныйИдентификатор();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.ТипКонтрагента КАК ТипКонтрагента,
	|	Контрагенты.Родитель КАК Родитель
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ЭтоГруппа = ЛОЖЬ
	|	И Контрагенты.Ссылка.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты)
	|	И Контрагенты.ПометкаУдаления = ЛОЖЬ");
	                                                                     
	Выборка = Запрос.Выполнить().Выбрать();                          
												
	Пока Выборка.Следующий() Цикл
		
		СсылкаНаЭлемент = Выборка.Ссылка.ПолучитьОбъект();
		КонтИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаЭлемент,,,Ложь);
		СсылкаНаЭлемент.КонтактнаяИнформация.Очистить();
		Для Каждого Элемент Из КонтИнформация Цикл
			Если Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
				Элемент.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКлиента;
				СписокПолей = Новый СписокЗначений;
				УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(Элемент.Представление, СписокПолей);
				Элемент.ЗначенияПолей = КонтактнаяИнформацияВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(Элемент.Представление, Элемент.Вид);
				Если Элемент.Значение <> "" Тогда
					СтруктураJSON = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(Элемент.Значение);
					Если Не СтруктураJSON.Свойство("value") Тогда
						СтруктураJSON.Вставить("value");
					КонецЕсли;
					СтруктураJSON.value = Элемент.Представление;
					Элемент.Значение = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(СтруктураJSON);
				КонецЕсли;
				// Элемент.НеУчаствоватьВРассылке = ;
			ИначеЕсли Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда	
				Элемент.Вид = Справочники.ВидыКонтактнойИнформации.EmailКлиента;
				Элемент.ЗначенияПолей = КонтактнаяИнформацияВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(Элемент.Представление, Элемент.Вид);
				УправлениеКонтактнойИнформациейСтоматология.ЗаписатьКонтактнуюИнформацию(СсылкаНаЭлемент, Элемент.ЗначенияПолей, Элемент.Вид, Элемент.Тип,,,СсылкаНаЭлемент.НеУчаствоватьВРассылкеEmail);
				Продолжить;
			ИначеЕсли Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
				Элемент.Вид = Справочники.ВидыКонтактнойИнформации.АдресКлиента;
				Если СтрЧислоСтрок (Элемент.Представление) > 1 Тогда
					Элемент.Представление = УправлениеКонтактнойИнформациейСлужебныйСтоматология.ПредставлениеКонтактнойИнформации(Элемент.ЗначенияПолей, Элемент.Вид);					
				КонецЕсли;
				Если Элемент.Значение <> "" Тогда
					СтруктураJSON = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(Элемент.Значение);
					Если Не СтруктураJSON.Свойство("value") Тогда
						СтруктураJSON.Вставить("value");
					КонецЕсли;
					СтруктураJSON.value = Элемент.Представление;
					Элемент.Значение = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(СтруктураJSON);
					Элемент.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(Элемент.Значение, Элемент.Представление, Элемент.Тип);
				Иначе
					Элемент.ЗначенияПолей = КонтактнаяИнформацияВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(Элемент.Представление, Элемент.Вид);
				КонецЕсли;

			КонецЕсли;
			
			УправлениеКонтактнойИнформациейСтоматология.ЗаписатьКонтактнуюИнформацию(СсылкаНаЭлемент, Элемент.ЗначенияПолей, Элемент.Вид, Элемент.Тип,,,СсылкаНаЭлемент.НеУчаствоватьВРассылкеEmail);
			
		КонецЦикла;
	 	СсылкаНаЭлемент.Записать();
	КонецЦикла;

	
	// Обновляем сотрудников
	УИДТелСотрудники = Справочники.ВидыКонтактнойИнформации.ТелефонСотрудника.УникальныйИдентификатор();
	УИДАдрСотрудники = Справочники.ВидыКонтактнойИнформации.EmailСотрудника.УникальныйИдентификатор();
	УИДЭлПСотрудники = Справочники.ВидыКонтактнойИнформации.АдресСотрудника.УникальныйИдентификатор();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ЭтоГруппа = ЛОЖЬ
	|	И Сотрудники.ПометкаУдаления = ЛОЖЬ");
	                                                                     
	Выборка = Запрос.Выполнить().Выбрать();                          
												
	Пока Выборка.Следующий() Цикл
		
		СсылкаНаЭлемент = Выборка.Ссылка.ПолучитьОбъект();
		КонтИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаЭлемент,,,Ложь);
		СсылкаНаЭлемент.КонтактнаяИнформация.Очистить();
		Для Каждого Элемент Из КонтИнформация Цикл
			Если Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
				Элемент.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотрудника;
				СписокПолей = Новый СписокЗначений;
				УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(Элемент.Представление, СписокПолей);
				Элемент.ЗначенияПолей = КонтактнаяИнформацияВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(Элемент.Представление, Элемент.Вид);
				Если Элемент.Значение <> "" Тогда
					СтруктураJSON = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(Элемент.Значение);
					Если Не СтруктураJSON.Свойство("value") Тогда
						СтруктураJSON.Вставить("value");
					КонецЕсли;
					СтруктураJSON.value = Элемент.Представление;
					Элемент.Значение = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(СтруктураJSON);
				КонецЕсли;
			ИначеЕсли Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда	
				Элемент.Вид = Справочники.ВидыКонтактнойИнформации.EmailСотрудника;
				Элемент.ЗначенияПолей = КонтактнаяИнформацияВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(Элемент.Представление, Элемент.Вид);
				УправлениеКонтактнойИнформациейСтоматология.ЗаписатьКонтактнуюИнформацию(СсылкаНаЭлемент, Элемент.ЗначенияПолей, Элемент.Вид, Элемент.Тип);
				Продолжить;
			ИначеЕсли Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
				Элемент.Вид = Справочники.ВидыКонтактнойИнформации.АдресСотрудника;
				Если СтрЧислоСтрок (Элемент.Представление) > 1 Тогда
					Элемент.Представление = УправлениеКонтактнойИнформациейСлужебныйСтоматология.ПредставлениеКонтактнойИнформации(Элемент.ЗначенияПолей, Элемент.Вид);					
				КонецЕсли;
				Если Элемент.Значение <> "" Тогда
					СтруктураJSON = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(Элемент.Значение);
					Если Не СтруктураJSON.Свойство("value") Тогда
						СтруктураJSON.Вставить("value");
					КонецЕсли;
					СтруктураJSON.value = Элемент.Представление;
					Элемент.Значение = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(СтруктураJSON);
					Элемент.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(Элемент.Значение, Элемент.Представление, Элемент.Тип);
				Иначе
					Элемент.ЗначенияПолей = КонтактнаяИнформацияВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(Элемент.Представление, Элемент.Вид);
				КонецЕсли;
			КонецЕсли;
			
			УправлениеКонтактнойИнформациейСтоматология.ЗаписатьКонтактнуюИнформацию(СсылкаНаЭлемент, Элемент.ЗначенияПолей, Элемент.Вид, Элемент.Тип);
			
		КонецЦикла;
	 	СсылкаНаЭлемент.Записать();
	КонецЦикла;

	// Обновляем организации
	УИДТелОрганизации 		= Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации.УникальныйИдентификатор();
	УИДЮрАдрОрганизации 	= Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации.УникальныйИдентификатор();
	УИДЭлПОрганизации 		= Справочники.ВидыКонтактнойИнформации.EmailОрганизации.УникальныйИдентификатор();
	УИДФаксОрганизации 		= Справочники.ВидыКонтактнойИнформации.ФаксОрганизации.УникальныйИдентификатор();
	УИДФактАдрОрганизации 	= Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации.УникальныйИдентификатор();
	УИДПочтАдрОрганизации 	= Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации.УникальныйИдентификатор();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ЭтоГруппа = ЛОЖЬ
	|	И Организации.ПометкаУдаления = ЛОЖЬ");
	                                                                     
	Выборка = Запрос.Выполнить().Выбрать();                          
												
	Пока Выборка.Следующий() Цикл
		
		СсылкаНаЭлемент = Выборка.Ссылка.ПолучитьОбъект();
		КонтИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаЭлемент,,,Ложь);
		СсылкаНаЭлемент.КонтактнаяИнформация.Очистить();
		Для Каждого Элемент Из КонтИнформация Цикл
			Если Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
				Элемент.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации;
				СписокПолей = Новый СписокЗначений;
				УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(Элемент.Представление, СписокПолей);
				Элемент.ЗначенияПолей = КонтактнаяИнформацияВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(Элемент.Представление, Элемент.Вид);
				Если Элемент.Значение <> "" Тогда
					СтруктураJSON = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(Элемент.Значение);
					Если Не СтруктураJSON.Свойство("value") Тогда
						СтруктураJSON.Вставить("value");
					КонецЕсли;
					СтруктураJSON.value = Элемент.Представление;
					Элемент.Значение = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(СтруктураJSON);
				КонецЕсли;
			ИначеЕсли Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда	
				Элемент.Вид = Справочники.ВидыКонтактнойИнформации.EmailОрганизации;
				Элемент.ЗначенияПолей = КонтактнаяИнформацияВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(Элемент.Представление, Элемент.Вид);
				УправлениеКонтактнойИнформациейСтоматология.ЗаписатьКонтактнуюИнформацию(СсылкаНаЭлемент, Элемент.ЗначенияПолей, Элемент.Вид, Элемент.Тип);
				Продолжить;
			ИначеЕсли Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Факс Тогда
				Элемент.Вид = Справочники.ВидыКонтактнойИнформации.ФаксОрганизации;
				СписокПолей = Новый СписокЗначений;
				УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(Элемент.Представление, СписокПолей);
				Элемент.ЗначенияПолей = КонтактнаяИнформацияВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(Элемент.Представление, Элемент.Вид);
				Если Элемент.Значение <> "" Тогда
					СтруктураJSON = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(Элемент.Значение);
					Если Не СтруктураJSON.Свойство("value") Тогда
						СтруктураJSON.Вставить("value");
					КонецЕсли;
					СтруктураJSON.value = Элемент.Представление;
					Элемент.Значение = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(СтруктураJSON);
				КонецЕсли;
			ИначеЕсли Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
				Если Элемент.Вид.Наименование = "Юридический адрес" Тогда
					Элемент.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации	
				ИначеЕсли Элемент.Вид.Наименование = "Фактический адрес" Тогда
					Элемент.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации
				ИначеЕсли Элемент.Вид.Наименование = "Почтовый адрес" Тогда
					Элемент.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации
				КонецЕсли;
				Если СтрЧислоСтрок (Элемент.Представление) > 1 Тогда
					Элемент.Представление = УправлениеКонтактнойИнформациейСлужебныйСтоматология.ПредставлениеКонтактнойИнформации(Элемент.ЗначенияПолей, Элемент.Вид);					
				КонецЕсли;
				Если Элемент.Значение <> "" Тогда
					СтруктураJSON = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(Элемент.Значение);
					Если Не СтруктураJSON.Свойство("value") Тогда
						СтруктураJSON.Вставить("value");
					КонецЕсли;
					СтруктураJSON.value = Элемент.Представление;
					Элемент.Значение = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(СтруктураJSON);
					Элемент.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(Элемент.Значение, Элемент.Представление, Элемент.Тип);
				Иначе
					Элемент.ЗначенияПолей = КонтактнаяИнформацияВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(Элемент.Представление, Элемент.Вид);
				КонецЕсли;
			КонецЕсли;
		
			УправлениеКонтактнойИнформациейСтоматология.ЗаписатьКонтактнуюИнформацию(СсылкаНаЭлемент, Элемент.ЗначенияПолей, Элемент.Вид, Элемент.Тип);
			
		КонецЦикла;
	 	СсылкаНаЭлемент.Записать();
	КонецЦикла;

	// Обновляем структурные еденицы
	УИДТелСЕ = Справочники.ВидыКонтактнойИнформации.ТелефонСтруктурнойЕдиницы.УникальныйИдентификатор();
	УИДАдрСЕ = Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы.УникальныйИдентификатор();
	УИДЭлПСЕ = Справочники.ВидыКонтактнойИнформации.EmailСтруктурнойЕдиницы.УникальныйИдентификатор();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	СтруктурныеЕдиницы.ЭтоГруппа = ЛОЖЬ
	|	И СтруктурныеЕдиницы.ПометкаУдаления = ЛОЖЬ");
	                                                                     
	Выборка = Запрос.Выполнить().Выбрать();                          
												
	Пока Выборка.Следующий() Цикл
		
		СсылкаНаЭлемент = Выборка.Ссылка.ПолучитьОбъект();
		КонтИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаЭлемент,,,Ложь);
		СсылкаНаЭлемент.КонтактнаяИнформация.Очистить();
		Для Каждого Элемент Из КонтИнформация Цикл
			Если Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
				Элемент.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСтруктурнойЕдиницы;
				СписокПолей = Новый СписокЗначений;
				УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(Элемент.Представление, СписокПолей);
				Элемент.ЗначенияПолей = КонтактнаяИнформацияВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(Элемент.Представление, Элемент.Вид);
				Если Элемент.Значение <> "" Тогда
					СтруктураJSON = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(Элемент.Значение);
					Если Не СтруктураJSON.Свойство("value") Тогда
						СтруктураJSON.Вставить("value");
					КонецЕсли;
					СтруктураJSON.value = Элемент.Представление;
					Элемент.Значение = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(СтруктураJSON);
				КонецЕсли;
			ИначеЕсли Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда	
				Элемент.Вид = Справочники.ВидыКонтактнойИнформации.EmailСтруктурнойЕдиницы;
				Элемент.ЗначенияПолей = КонтактнаяИнформацияВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(Элемент.Представление, Элемент.Вид);
				УправлениеКонтактнойИнформациейСтоматология.ЗаписатьКонтактнуюИнформацию(СсылкаНаЭлемент, Элемент.ЗначенияПолей, Элемент.Вид, Элемент.Тип);
				Продолжить;
			ИначеЕсли Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда

				Элемент.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы;
				Если СтрЧислоСтрок (Элемент.Представление) > 1 Тогда
					Элемент.Представление = УправлениеКонтактнойИнформациейСлужебныйСтоматология.ПредставлениеКонтактнойИнформации(Элемент.ЗначенияПолей, Элемент.Вид);					
				КонецЕсли;
				Если Элемент.Значение <> "" Тогда
					СтруктураJSON = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(Элемент.Значение);
					Если Не СтруктураJSON.Свойство("value") Тогда
						СтруктураJSON.Вставить("value");
					КонецЕсли;
					СтруктураJSON.value = Элемент.Представление;
					Элемент.Значение = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(СтруктураJSON);
					Элемент.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(Элемент.Значение, Элемент.Представление, Элемент.Тип);
				Иначе
					Элемент.ЗначенияПолей = КонтактнаяИнформацияВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(Элемент.Представление, Элемент.Вид);
				КонецЕсли;
			КонецЕсли;
			
			УправлениеКонтактнойИнформациейСтоматология.ЗаписатьКонтактнуюИнформацию(СсылкаНаЭлемент, Элемент.ЗначенияПолей, Элемент.Вид, Элемент.Тип);
			
		КонецЦикла;
	 	СсылкаНаЭлемент.Записать();
	КонецЦикла;

	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;

КонецПроцедуры

// Процедура устанавливает дату первого входа в систему
//
// Для справочников:
// - Контрагент
// - Физ. лица
// - Контактные лица
// 
// Справочник "Организации" обновляется/дозаполняется механизмами БСП.
//
Процедура УстановитьДатуПервогоВходаВСистему() 
	
	Константы.ДатаПервогоВходаВСистему.Установить(НачалоМесяца(ТекущаяДата()));
	
КонецПроцедуры

// Процедура очищает в регистре сведений строки с пустой структурной еденицей
//
// Для справочников:
// - Контрагент
// - Физ. лица
// - Контактные лица
// 
// Справочник "Организации" обновляется/дозаполняется механизмами БСП.
//
Процедура ОчиститьРСНастройкиСотрудниковОтДублей() 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Сотрудники.СегментыНоменклатуры КАК СегментыНоменклатуры,
	|	Сотрудники.ВидЦен КАК ВидЦен,
	|	Сотрудники.ДатаПриема КАК ДатаПриема,
	|	Сотрудники.ДатаУвольнения КАК ДатаУвольнения,
	|	Сотрудники.РазрешитьПриемНесколькихПациентов КАК РазрешитьПриемНесколькихПациентов,
	|	Сотрудники.ОсновнойШаблонОбследований КАК ОсновнойШаблонОбследований
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК Сотрудники");	
	
	ТаблицаНастроекСотрудника = Запрос.Выполнить().Выгрузить();
	
	НоваяТаблица = ТаблицаНастроекСотрудника.СкопироватьКолонки();
	Запомним = Неопределено;
	Проверка = Ложь;
	Для Каждого СтрокаТЗ Из ТаблицаНастроекСотрудника Цикл

		Если ЗначениеЗаполнено(СтрокаТЗ.СтруктурнаяЕдиница) Тогда
			Если Проверка Тогда
				НоваяСтрока = НоваяТаблица.Добавить();
				НоваяСтрока.Сотрудник = Запомним.Сотрудник;
				НоваяСтрока.СегментыНоменклатуры = Запомним.СегментыНоменклатуры;
				НоваяСтрока.ВидЦен = Запомним.ВидЦен;
				НоваяСтрока.ДатаПриема = Запомним.ДатаПриема;
				НоваяСтрока.ДатаУвольнения = Запомним.ДатаУвольнения;
				НоваяСтрока.РазрешитьПриемНесколькихПациентов = Запомним.РазрешитьПриемНесколькихПациентов;
				НоваяСтрока.ОсновнойШаблонОбследований = Запомним.ОсновнойШаблонОбследований;
				Проверка = Ложь;
			Иначе
				НоваяСтрока = НоваяТаблица.Добавить();
				НоваяСтрока.Сотрудник = СтрокаТЗ.Сотрудник;
				НоваяСтрока.СегментыНоменклатуры = СтрокаТЗ.СегментыНоменклатуры;
				НоваяСтрока.ВидЦен = СтрокаТЗ.ВидЦен;
				НоваяСтрока.ДатаПриема = СтрокаТЗ.ДатаПриема;
				НоваяСтрока.ДатаУвольнения = СтрокаТЗ.ДатаУвольнения;
				НоваяСтрока.РазрешитьПриемНесколькихПациентов = СтрокаТЗ.РазрешитьПриемНесколькихПациентов;
				НоваяСтрока.ОсновнойШаблонОбследований = СтрокаТЗ.ОсновнойШаблонОбследований;
			КонецЕсли;
			НоваяСтрока.СтруктурнаяЕдиница = СтрокаТЗ.СтруктурнаяЕдиница;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТЗ.СтруктурнаяЕдиница) Тогда
			Запомним = СтрокаТЗ;
			Проверка = Истина;
		КонецЕсли;

	КонецЦикла; 
		
	Рег = РегистрыСведений.НастройкиСотрудников;
	НаборНастройкиСотрудников = Рег.СоздатьНаборЗаписей();
	НаборНастройкиСотрудников.Загрузить(НоваяТаблица);
	НаборНастройкиСотрудников.Записать();
	
КонецПроцедуры

// Процедура, заполняет сведения для списка контрагенов.
// 
Процедура ПерезаполнитьСведенияДляСпискаКонтрагентов(Параметры = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	Попытка
		РегистрыСведений.КонтрагентыСведенияДляСписка.ОбновитьРегистрКонтрагентыСведенияДляСписка();                          	
	Исключение
		ЗаписьЖурналаРегистрации("ОбновлениеИБ", УровеньЖурналаРегистрации.Ошибка,,,"Перезаполнение списка клиентов: " + ОписаниеОшибки());
	КонецПопытки;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;	
	
КонецПроцедуры 

// Процедура, заполняет типы контрагенов.
// 
Процедура ЗаполнитьТипыКонтрагентов() Экспорт
	
	// При переходе на новую систему не всегда существуют папки Пациенты и Поставщики, если их нет, то создаем.
	Справочники.Контрагенты.ЗаполнитьПоУмолчанию();

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.ТипКонтрагента КАК ТипКонтрагента,
	|	Контрагенты.Родитель КАК Родитель
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ЭтоГруппа = ЛОЖЬ
	|	И Контрагенты.ТипКонтрагента = Значение(Перечисление.ТипыКонтрагентов.ПустаяСсылка)");
	                                                                     
	Выборка = Запрос.Выполнить().Выбрать();                          
												
	Пока Выборка.Следующий() Цикл
		
		СсылкаНаЭлемент = Выборка.Ссылка.ПолучитьОбъект();
		
		Если СсылкаНаЭлемент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо
			ИЛИ (Не ЗначениеЗаполнено(СсылкаНаЭлемент.Родитель)
			И ЗначениеЗаполнено(СсылкаНаЭлемент.КлиентыУдалить)
			И Не СсылкаНаЭлемент.КлиентыУдалить) Тогда
			СсылкаНаЭлемент.Родитель = Справочники.Контрагенты.НайтиПоНаименованию("Поставщики", Истина, Справочники.Контрагенты.ПустаяСсылка());	
		Иначе
			СсылкаНаЭлемент.Родитель = Справочники.Контрагенты.НайтиПоНаименованию("Пациенты", Истина, Справочники.Контрагенты.ПустаяСсылка());
		КонецЕсли;
		
		Если Строка(СсылкаНаЭлемент.Родитель) = "Клиенты" Или Строка(СсылкаНаЭлемент.Родитель) = "Пациенты" Тогда
			СсылкаНаЭлемент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты;
		ИначеЕсли Строка(СсылкаНаЭлемент.Родитель) = "Поставщики" Тогда
			СсылкаНаЭлемент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Поставщик;
		ИначеЕсли Строка(СсылкаНаЭлемент.Родитель) = "Страховые Компании" Тогда
			СсылкаНаЭлемент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.СтраховаяКомпания;
		КонецЕсли;
		
		СсылкаНаЭлемент.Записать();
		
	КонецЦикла;
	
КонецПроцедуры 

// Процедура - Заполнение реквизитов стран
// 
Процедура ЗаполнениеРеквизитовСтран() Экспорт
	
	// Страна = Справочники.СтраныМира.НайтиПоНаименованию("Россия");
	// Если ЗначениеЗаполнено(Страна) Тогда
	//	ТелефонныйКод = "+7";
	//	СтранаОбъект = Страна.ПолучитьОбъект();
	//	СтранаОбъект.ТелефонныйКод = ТелефонныйКод;
	//	СтранаОбъект.ВалютаУчета = Справочники.Валюты.НайтиПоКоду(643);
	//	СтранаОбъект.Записать();
	// КонецЕсли;
	
КонецПроцедуры

// Создание предопределенной валюты. 
// 
Процедура СоздатьПредопределенныеЭлементыВалюты() Экспорт
	
	// Российский рубль
	Валюта = Справочники.Валюты.НайтиПоКоду(643);
	Если Не ЗначениеЗаполнено(Валюта) Тогда 
		Валюта = Справочники.Валюты.СоздатьЭлемент();
		Валюта.Код = 643;
		Валюта.Наименование = "RUR";
		Валюта.НаименованиеПолное = "Российский рубль";
		Валюта.ПараметрыПрописи = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2, руб., коп.";
		Валюта.Записать();
	КонецЕсли;	
	
	// Гривна
	Валюта = Справочники.Валюты.НайтиПоКоду(980);
	Если Не ЗначениеЗаполнено(Валюта) Тогда 
		Валюта = Справочники.Валюты.СоздатьЭлемент();
		Валюта.Код = 980;
		Валюта.Наименование = "UAH";
		Валюта.НаименованиеПолное = "Гривна";
		Валюта.ПараметрыПрописи = "гривна, гривны, гривен, ж, копейка, копейки, копеек, ж, 2, грн., коп.";
		Валюта.Записать();
	КонецЕсли;	
	
	// Белорусский рубль
	Валюта = Справочники.Валюты.НайтиПоКоду(974);
	Если Не ЗначениеЗаполнено(Валюта) Тогда 
		Валюта = Справочники.Валюты.СоздатьЭлемент();
		Валюта.Код = 974;
		Валюта.Наименование = "BYR";
		Валюта.НаименованиеПолное = "Белорусский рубль";
		Валюта.ПараметрыПрописи = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2, руб., коп.";
		Валюта.Записать();
	КонецЕсли;	
	
	// Тенге
	Валюта = Справочники.Валюты.НайтиПоКоду(398);
	Если Не ЗначениеЗаполнено(Валюта) Тогда 
		Валюта = Справочники.Валюты.СоздатьЭлемент();
		Валюта.Код = 398;
		Валюта.Наименование = "KZT";
		Валюта.НаименованиеПолное = "Тенге";
		Валюта.Записать();
	КонецЕсли;	
	
КонецПроцедуры

// Процедура, выполняет переход на новую систему налогообложения.
//
Процедура ПереходНаНовуюСистемуНалогообложения() Экспорт
	
	ПривелигированныйРежимДо = ПривилегированныйРежим();
	Если Не ПривелигированныйРежимДо Тогда	
		УстановитьПривилегированныйРежим(Истина);	
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.СистемаНалогообложенияДляТоваров = ЗНАЧЕНИЕ(Перечисление.ТипыСистемНалогообложенияККТ.ПустаяСсылка)");	
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТЗ Из Результат Цикл
		Попытка
			ОрганизацияОбъект = СтрокаТЗ.Организация.ПолучитьОбъект();		
			ОрганизацияОбъект.СистемаНалогообложенияДляТоваров	= ПолучитьСистемуНалогообложения(ОрганизацияОбъект);
			ОрганизацияОбъект.СПриоритетомНоменклатуры			= Истина;
			ОрганизацияОбъект.Записать();     			
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Ошибка установки системы налогообложения для организации %1. Описание ошибки: %2.'"), СтрокаТЗ.Организация, ОписаниеОшибки));      
		КонецПопытки;
	КонецЦикла;
	
	Если Не ПривелигированныйРежимДо Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры 

// Конфигурирование статей затрат
//
Процедура ПрописатьВидыОперацийПредопределеннымСтатьям() Экспорт
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВводОстатков.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВводОстатков; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВзносАвансаОтКлиента.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВзносНалицевойСчет.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВозвратАвансаКлиенту.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВозвратОплатыКлиенту; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВозвратНалога.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВозвратНалога; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВозвратОплатыКлиенту.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВозвратОплатыКлиенту; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВозвратОшибочнойОплатыКлиенту.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВозвратОшибочнойОплатыКлиенту; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВозвратОплатыСтраховойКомпании.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВозвратОплатыСтраховойКомпании; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВозвратОтПодотчетника.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВозвратОтПодотчетника; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВозвратОплатыОтПоставщика.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВозвратОплатыОтПоставщика; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВозвратСЛицевогоСчета.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВозвратСЛицевогоСчета; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВыдачаПодотчетнику.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВыдачаПодотчетнику; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВыплатаЗаработнойПлаты.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВыплатаЗаработнойПлаты; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ОплатаНалога.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ОплатаНалога; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ОплатаОтКлиента.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ОплатаОтСтраховойКомпании.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ОплатаОтСтраховойКомпании; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ОплатаПоставщику.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ОплатаПоставщику; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВыбытиеВкассу.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВыбытиеВКассу; 
	СтатьяОбъект.Записать();

	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ПоступлениеИзБанка.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ПоступлениеИзБанка; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ПоступлениеОтЭквайера.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ПоступлениеОтЭквайера; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.СдачаНаличныхВБанк.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.СдачаНаличныхВБанк; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ПоступлениеИзКассы.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ПоступлениеИзКассы; 
	СтатьяОбъект.Записать();
	
	// СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.СдачаРозничнойВыручкиВКассуПредприятия.ПолучитьОбъект();
	// СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.СдачаРозничнойВыручкиВКассуПредприятия; 
	// СтатьяОбъект.Записать();

	// СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходовПоступлениеРозничнойВыручкиИзОперационнойКассы.ПолучитьОбъект();
	// СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ПоступлениеРозничнойВыручкиИзОперационнойКассы; 
	// СтатьяОбъект.Записать();

	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВыбытиеВкассу.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВыбытиеВКассу; 
	СтатьяОбъект.Записать();

	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ПоступлениеИзКассы.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ПоступлениеИзКассы; 
	СтатьяОбъект.Записать();

	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВозвратЗаработнойПлаты.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВозвратЗаработнойПлаты; 
	СтатьяОбъект.Записать(); 
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВыдачаВозвратЗайма.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВыдачаЗайма; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВозвратВыдачаЗайма.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВозвратЗайма; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВзносУчредителя.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВзносУчредителя; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВыплатаДивидендовУчредителю.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВыплатаДивидендовУчредителю; 
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ПрочееНачисление.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ПрочееПоступление; 
	СтатьяОбъект.Записать();
     	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВводОстатков.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВводОстатков; 
	СтатьяОбъект.Записать();
	
    СтатьяОбъект                           = Справочники.СтатьиДоходовИРасходов.ЗарплатаВПроцентахОтВыручки.ПолучитьОбъект();
	СтатьяОбъект.ВидСтатьиДоходовИРасходов = Перечисления.ВидыСтатейДоходовИРасходов.Расход;
	СтатьяОбъект.ВидРаспределенияРасходов  = Перечисления.ВидыРаспределенияРасходов.ПоВыручке;
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                           = Справочники.СтатьиДоходовИРасходов.ИзлишкиЗапасов.ПолучитьОбъект();
	СтатьяОбъект.ВидСтатьиДоходовИРасходов = Перечисления.ВидыСтатейДоходовИРасходов.Доход;
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                           = Справочники.СтатьиДоходовИРасходов.Материалы.ПолучитьОбъект();
	СтатьяОбъект.ВидСтатьиДоходовИРасходов = Перечисления.ВидыСтатейДоходовИРасходов.Расход;
	СтатьяОбъект.ВидРаспределенияРасходов  = Перечисления.ВидыРаспределенияРасходов.ПоВыручке;
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                           = Справочники.СтатьиДоходовИРасходов.НедостачиЗапасов.ПолучитьОбъект();
	СтатьяОбъект.ВидСтатьиДоходовИРасходов = Перечисления.ВидыСтатейДоходовИРасходов.Расход;
	СтатьяОбъект.ВидРаспределенияРасходов  = Перечисления.ВидыРаспределенияРасходов.ПоВыручке;
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                           = Справочники.СтатьиДоходовИРасходов.Оклад.ПолучитьОбъект();
	СтатьяОбъект.ВидСтатьиДоходовИРасходов = Перечисления.ВидыСтатейДоходовИРасходов.Расход;
	СтатьяОбъект.ВидРаспределенияРасходов  = Перечисления.ВидыРаспределенияРасходов.ПоВыручке;
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                           = Справочники.СтатьиДоходовИРасходов.ПрочееНачисление.ПолучитьОбъект();
	СтатьяОбъект.ВидСтатьиДоходовИРасходов = Перечисления.ВидыСтатейДоходовИРасходов.Расход;
	СтатьяОбъект.ВидРаспределенияРасходов  = Перечисления.ВидыРаспределенияРасходов.ПоВыручке;
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                           = Справочники.СтатьиДоходовИРасходов.ПрочееУдержание.ПолучитьОбъект();
	СтатьяОбъект.ВидСтатьиДоходовИРасходов = Перечисления.ВидыСтатейДоходовИРасходов.Расход;
	СтатьяОбъект.ВидРаспределенияРасходов  = Перечисления.ВидыРаспределенияРасходов.ПоВыручке;
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                           = Справочники.СтатьиДоходовИРасходов.СебестоимостьТоваров.ПолучитьОбъект();
	СтатьяОбъект.ВидСтатьиДоходовИРасходов = Перечисления.ВидыСтатейДоходовИРасходов.Расход;
	СтатьяОбъект.ВидРаспределенияРасходов  = Перечисления.ВидыРаспределенияРасходов.ПоВыручке;
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                           = Справочники.СтатьиДоходовИРасходов.СписаниеЗадолженностиКлиента.ПолучитьОбъект();
	СтатьяОбъект.ВидСтатьиДоходовИРасходов = Перечисления.ВидыСтатейДоходовИРасходов.Расход;
	СтатьяОбъект.ВидРаспределенияРасходов  = Перечисления.ВидыРаспределенияРасходов.ПоВыручке;
	СтатьяОбъект.Записать();

    СтатьяОбъект                           = Справочники.СтатьиДоходовИРасходов.Тариф.ПолучитьОбъект();
	СтатьяОбъект.ВидСтатьиДоходовИРасходов = Перечисления.ВидыСтатейДоходовИРасходов.Расход;
	СтатьяОбъект.ВидРаспределенияРасходов  = Перечисления.ВидыРаспределенияРасходов.ПоВыручке;
	СтатьяОбъект.Записать();
	
	// СтатьяОбъект                           = Справочники.СтатьиДоходовИРасходов.ВнереализационныйДоход.ПолучитьОбъект();
	// СтатьяОбъект.ВидСтатьиДоходовИРасходов = Перечисления.ВидыСтатейДоходовИРасходов.Доход;
	// СтатьяОбъект.Записать();

КонецПроцедуры

// Функция получает систему налогообложения.
//
Функция ПолучитьСистемуНалогообложения(Организация)
	
	Если Организация.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая Тогда
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
	ИначеЕсли Организация.ОбъектНалогообложения = Перечисления.ОбъектыНалогообложенияПоУСН.Доходы Тогда
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход;
	Иначе
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход;
	КонецЕсли;	
		
КонецФункции  

// Процедура заполняет справочник эквайринговых терминалов.
//
Процедура ЗаполнениеСправочникаЭквайринговыеТерминалы() Экспорт

	// ПривелигированныйРежимДо = ПривилегированныйРежим();
	// Если Не ПривелигированныйРежимДо Тогда	
	//	УстановитьПривилегированныйРежим(Истина);	
	// КонецЕсли;
	//
	// Запрос = Новый Запрос(
	// "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	// |	ЭквайринговыеТерминалы.Ссылка КАК Ссылка,
	// |	ЭквайринговыеТерминалы.Владелец.Контрагент КАК Эквайер,
	// |	ЭквайринговыеТерминалы.Владелец.БанковскийСчет КАК БанковскийСчет,
	// |	ЭквайринговыеТерминалы.Владелец.ПроцентКомиссии КАК ПроцентКомиссии
	// |ИЗ
	// |	Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы"); 
	//
	// Результат = Запрос.Выполнить().Выгрузить();
	//
	// Для Каждого СтрокаТЗ Из Результат Цикл
	//	Попытка
	//		ТекОбъект = СтрокаТЗ.Ссылка.ПолучитьОбъект();
	//		
	//		ТекОбъект.Эквайер			= СтрокаТЗ.Эквайер;
	//		ТекОбъект.БанковскийСчет	= СтрокаТЗ.БанковскийСчет;
	//		ТекОбъект.ПроцентКомиссии	= СтрокаТЗ.ПроцентКомиссии;

	//		ТекОбъект.Записать();
	//	Исключение
	//		ТекстСообщения = СтрШаблон("Ошибка записи %1. Описание ошибки: %2.",
	// СтрокаТЗ.Ссылка, ОписаниеОшибки());
	//		ЗаписьЖурналаРегистрации("ЗаполнениеСправочникаЭквайринговыеТерминалы", 
	//  УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
	//	КонецПопытки; 		
	// КонецЦикла; 	
	//
	// Если Не ПривелигированныйРежимДо Тогда
	//	УстановитьПривилегированныйРежим(Ложь);
	// КонецЕсли;
	
КонецПроцедуры  

// Процедура переносит текущие маркетинговыен акции в предопределенную группу "Скидки".
//
Процедура ПереносТекущихМаркетинговыхАкцийВГруппуСкидки() Экспорт 
	
	ПривелигированныйРежимДо = ПривилегированныйРежим();
	Если Не ПривелигированныйРежимДо Тогда	
		УстановитьПривилегированныйРежим(Истина);	
	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СкидкиНаценки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СкидкиНаценки КАК СкидкиНаценки");
	
	ТаблицаСкидок = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТЗ Из ТаблицаСкидок Цикл 
		Попытка
			ТекОбъект = СтрокаТЗ.Ссылка.ПолучитьОбъект();
			ТекОбъект.Родитель = Справочники.СкидкиНаценки.Скидки;
			ТекОбъект.Записать();
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Ошибка переноса %1 в группу ""Скидки"". Описание ошибки: %2.'"), СтрокаТЗ.Ссылка, ОписаниеОшибки));      
		КонецПопытки;    		
	КонецЦикла;
	
	Если Не ПривелигированныйРежимДо Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;     	
	
КонецПроцедуры       

// Процедура добавляет вид оплаты "Бонусынй счет" в справочник "Кассы".
//
Процедура ДобавитьВидОплатыБонусныйСчетВКассы() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый ЗАпрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Кассы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	НЕ Кассы.ВидыОплат.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БонусныйСчет)");
	
	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТЗ Из Результат Цикл 
		Попытка
			ТекОбъект = СтрокаТЗ.Ссылка.ПолучитьОбъект();
			Если ТекОбъект.ВидыОплат.Найти(Перечисления.ТипыДенежныхСредств.БонусныйСчет, "ВидОплаты") = Неопределено Тогда
				НоваяСтрока = ТекОбъект.ВидыОплат.Добавить();
				НоваяСтрока.ВидОплаты = Перечисления.ТипыДенежныхСредств.БонусныйСчет;
			КонецЕсли;
			ТекОбъект.Записать();
		Исключение	
			ОписаниеОшибки = ОписаниеОшибки();
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка добавления %1 в группу ""Скидки"". Описание ошибки: %2.'"), СтрокаТЗ.Ссылка, ОписаниеОшибки);
			ЗаписьЖурналаРегистрации("ДобавлениеВидОплатыБонусныйСчетВКасса", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);      
		КонецПопытки; 		
	КонецЦикла;    	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Процедура - Установить свойства предопределенных видов контактной информации
//
Процедура УстановитьСвойстваПредопределенныхВидовКонтактнойИнформации() Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	УправлениеКонтактнойИнформациейСлужебныйСтоматология.УстановитьСвойстваПредопределенныхВидовКонтактнойИнформации();

КонецПроцедуры

// Процедура - Обновить предопределнные виды сделок
//
Процедура ОбновитьПредопределнныеВидыСделок() Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Справочники.ВидыСделок.ОбновитьПредопределнныеВидыСделок();

КонецПроцедуры

// Процедура - Заполнить справочник виды взаимодействий на сервере
//
Процедура ЗаполнитьСправочникВидыВзаимодействий() Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	// Создаем виды взаимодействий по умолчанию
	Справочники.ВидыВзаимодействий.ЗаполнитьСправочникВидыВзаимодействий();	
	
КонецПроцедуры

// Процедура - Заполнить сокращенное наименование сотрудников
//
// Параметры:
//  Параметры	 - 	 - 
//
Процедура ЗаполнитьСокращенноеНаименованиеСотрудников(Параметры = Неопределено) Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сотрудники.Ссылка КАК Ссылка,
	               |	Сотрудники.Наименование КАК Наименование,
	               |	Сотрудники.Фамилия КАК Фамилия,
	               |	Сотрудники.Имя КАК Имя,
	               |	Сотрудники.Отчество КАК Отчество
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |ГДЕ
	               |	Сотрудники.ЭтоГруппа = ЛОЖЬ
	               |	И Сотрудники.Служебный = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование";
	
	ТаблицаСотрудников = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаСотрудник Из ТаблицаСотрудников Цикл 
		Сотрудник_Объект 							= СтрокаСотрудник.Ссылка.ПолучитьОбъект();
		Сотрудник_Объект.НаименованиеСокращенное 	= Справочники.Сотрудники.ПолучитьСокращенноеНаименованиеСотрудника(Новый Структура("Фамилия, Имя, Отчество, Наименование", СтрокаСотрудник.Фамилия, СтрокаСотрудник.Имя, СтрокаСотрудник.Отчество, СтрокаСотрудник.Наименование));
		Сотрудник_Объект.ОбменДанными.Загрузка 		= Истина;
		Попытка
			Сотрудник_Объект.Записать();
		Исключение
			
		КонецПопытки;	
	КонецЦикла;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;	
	
КонецПроцедуры

// Процедура, добавляет информацию в регистр сведений СделкиСведенияДляСписка.
//
Процедура ОбновитьРегистрСделкиСведенияДляСписка(Параметры = Неопределено) Экспорт
	
	РегистрыСведений.СделкиСведенияДляСписка.ОбновитьРегистрСделкиСведенияДляСписка();	
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Проставить символьное представление валют
//
Процедура ПроставитьСимвольноеПредставлениеВалют() Экспорт
	Попытка 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Валюты.Ссылка КАК Ссылка,
		|	Валюты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Валюты КАК Валюты";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		
		Пока Выборка.Следующий() Цикл
			Если Найти(Выборка.Наименование, "EUR") > 0 Тогда
				ВалютаОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ВалютаОбъект.СимвольноеПредставление = "€";
				ВалютаОбъект.Записать();
			КонецЕсли;
			
			Если Найти(Выборка.Наименование, "USD") > 0 Тогда
				ВалютаОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ВалютаОбъект.СимвольноеПредставление = "$";
				ВалютаОбъект.Записать();
			КонецЕсли;
			
			Если Найти(Выборка.Наименование, "RUR") > 0 ИЛИ Найти(Выборка.Наименование, "руб") > 0 Тогда
				ВалютаОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ВалютаОбъект.СимвольноеПредставление = "₽";
				ВалютаОбъект.Записать();
			КонецЕсли;  
			
			Если Найти(Выборка.Наименование, "UAH") > 0 Тогда
				ВалютаОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ВалютаОбъект.СимвольноеПредставление = "₴";
				ВалютаОбъект.Записать();
			КонецЕсли;
			
			Если Найти(Выборка.Наименование, "BYN") > 0 Тогда
				ВалютаОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ВалютаОбъект.СимвольноеПредставление = "Br";
				ВалютаОбъект.Записать();
			КонецЕсли;
			
		КонецЦикла;	
	Исключение
	КонецПопытки;
	
КонецПроцедуры

// Процедура - Заполнить договоры со страховыми компаниями
//
Процедура ЗаполнитьДоговорыСоСтраховымиКомпаниями() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	                      |	ДоговорыКонтрагентов.УслугиБезСогласования КАК УслугиБезСогласования,
	                      |	ДоговорыКонтрагентов.УслугиПоСогласованию КАК УслугиПоСогласованию
	                      |ИЗ
	                      |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                      |ГДЕ
	                      |	ДоговорыКонтрагентов.Контрагент.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.СтраховаяКомпания)
	                      |	И НЕ ДоговорыКонтрагентов.ПометкаУдаления");
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
		СоставСегментаПоСогласованию = Неопределено;	
		МассивСегменты = Новый Массив;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.УслугиПоСогласованию) Тогда
			МассивСегменты.Добавить(ВыборкаДетальныеЗаписи.УслугиПоСогласованию);
			СоставСегментаПоСогласованию = ВыборкаДетальныеЗаписи.УслугиПоСогласованию;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.УслугиБезСогласования) Тогда
			МассивСегменты.Добавить(ВыборкаДетальныеЗаписи.УслугиБезСогласования);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(МассивСегменты) Тогда
			
			СправочникОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			
			ЗапросСегмент = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	НоменклатураСегмента.Номенклатура КАК Номенклатура,
				|	ВЫБОР
				|		КОГДА НоменклатураСегмента.Сегмент = &СоставСегментаПоСогласованию
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК Согласование
				|ИЗ
				|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
				|ГДЕ
				|	НоменклатураСегмента.Сегмент В(&Сегмент)");
			
			ЗапросСегмент.УстановитьПараметр("Сегмент", МассивСегменты);
			ЗапросСегмент.УстановитьПараметр("СоставСегментаПоСогласованию", СоставСегментаПоСогласованию);
			
			РезультатЗапросаСегмент = ЗапросСегмент.Выполнить();		
			ВыборкаДетальныеЗаписиСегмент = РезультатЗапросаСегмент.Выбрать();
			
			Пока ВыборкаДетальныеЗаписиСегмент.Следующий() Цикл
				НоваяСтрока = СправочникОбъект.УслугиПоДоговору.Добавить();
				НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписиСегмент.Номенклатура;
				НоваяСтрока.Количество = 0;
				НоваяСтрока.Согласование = ?(ВыборкаДетальныеЗаписиСегмент.Согласование, Перечисления.ТипыСогласованийУслугСтраховойКомпании.Всегда,
																						 Перечисления.ТипыСогласованийУслугСтраховойКомпании.НеТребуется);
			КонецЦикла;
			
			Попытка
				СправочникОбъект.Записать();
			Исключение
				
				СписокСобытий = Новый СписокЗначений;
				СписокСобытий.Добавить(Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий, ДатаСобытия",
														"ОбновлениеИнформационнойБазыСтоматология.ЗаполнитьДоговорыСоСтраховымиКомпаниями",
														"Ошибка",
														ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
														ТекущаяДатаСеанса()));	
				ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СписокСобытий);
				
			КонецПопытки;
		
	     КонецЕсли;
		
	КонецЦикла;

	
КонецПроцедуры

// Процедура - Обновить предопределенные группы маркетинговых акций
//
Процедура ОбновитьПредопределенныеГруппыМаркетинговыхАкций() Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Группа_Бонусы = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.СкидкиНаценки.Бонусы");

	Если НЕ ЗначениеЗаполнено(Группа_Бонусы) Тогда 
		Возврат;
	КонецЕсли;
	
	Группа_Бонусы_Объект = Группа_Бонусы.ПолучитьОбъект();
	Группа_Бонусы_Объект.Родитель = Справочники.СкидкиНаценки.ПустаяСсылка();
	Попытка
		Группа_Бонусы_Объект.ОбменДанными.Загрузка = Истина;
		Группа_Бонусы_Объект.Записать();
	Исключение
		МетаданныеСправочника 		= Метаданные.Справочники.СкидкиНаценки;
		ПредставлениеСправочника 	= МетаданныеСправочника.Представление();
		
		// Сформируем комментарий			
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать группу ""Бонусы""
		|по причине: %1'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонКомментария,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		// Запишем в журнал
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Инициализация групп маркетинговых акций'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,
		МетаданныеСправочника,,
		Комментарий);
	КонецПопытки;	
	
КонецПроцедуры

// Процедура - Заполнить справочник Классификатор социальных групп на сервере
//
Процедура ЗаполнитьСправочникКлассификаторСоциальныхГрупп() Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Справочники.КлассификаторСоциальныхГрупп.СоздатьЗначенияПоУмолчанию();

КонецПроцедуры

// Процедура - Заполнить справочник Классификатор социальных статусов на сервере
//
Процедура ЗаполнитьСправочникКлассификаторСоциальныхСтатусов() Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Справочники.КлассификаторСоциальныхСтатусов.СоздатьЗначенияПоУмолчанию();

КонецПроцедуры

// Процедура - Перенести реквизиты в договоры контрагентов
//
Процедура ПеренестиРеквизитыВДоговорыКонтрагентов() Экспорт 

	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Контрагент,
		|	Контрагенты.ДатаДоговора_Удалить КАК ДатаДоговора,
		|	Контрагенты.НомерДоговора_Удалить КАК НомерДоговора,
		|	Контрагенты.СтраховаяКоманияСегментУслугПоСогласованию_Удалить КАК СтраховаяКоманияСегментУслугПоСогласованию,
		|	Контрагенты.СегментНоменклатуры_Удалить КАК СегментНоменклатуры,
		|	Контрагенты.ВидЦен_Удалить КАК ВидЦен
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ТипКонтрагента <> ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты)
		|	И НЕ Контрагенты.ЭтоГруппа
		|	И НЕ Контрагенты.ПометкаУдаления";

	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		Договор 					  = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		Договор.Контрагент 			  = Выборка.Контрагент;
		Договор.НомерДоговора 		  = Выборка.НомерДоговора;
		Договор.ДатаДоговора 		  = ?(ЗначениеЗаполнено(Выборка.ДатаДоговора), Выборка.ДатаДоговора, ТекущаяДатаСеанса());
		Договор.УслугиПоСогласованию  = Выборка.СтраховаяКоманияСегментУслугПоСогласованию;
		Договор.УслугиБезСогласования = Выборка.СегментНоменклатуры;
		Договор.ВидЦен 				  = Выборка.ВидЦен;
		Договор.НомерДоговора         = "1";
		
		ТекстНаименования = НСтр("ru = 'Основной Договор № %НомерДоговора% от %ДатаДоговора% c %Контрагент%'");   
		ТекстНаименования = СтрЗаменить(ТекстНаименования, "%НомерДоговора%", СокрЛП(Договор.НомерДоговора));
		ТекстНаименования = СтрЗаменить(ТекстНаименования, "%ДатаДоговора%", ?(ЗначениеЗаполнено(Договор.ДатаДоговора), 
		СокрЛП(Строка(Формат(Договор.ДатаДоговора, "ДФ=dd.MM.yyyy"))), ""));
		ТекстНаименования = СтрЗаменить(ТекстНаименования, "%Контрагент%", СокрЛП(Договор.Контрагент));
		
		Договор.Наименование = ТекстНаименования;
		
		Договор.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Заполнить справочник Классификатор должностей на сервере
//
Процедура ЗаполнитьСправочникКлассификаторДолжностей() Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Справочники.КлассификаторДолжностей.СоздатьЗначенияПоУмолчанию();

КонецПроцедуры

// Процедура - Заполнить справочник Классификатор специальностей на сервере
//
Процедура ЗаполнитьСправочникКлассификаторСпециальностей() Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Справочники.КлассификаторСпециальностей.СоздатьЗначенияПоУмолчанию();

КонецПроцедуры

// Процедура - заполняет признаки ЭтоЗапас, ЭтоУслуга и т.д.
//
Процедура ОбновлениеНоменклатуры() Экспорт
	
	Выборка = Справочники.Номенклатура.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбъектНоменклатура = Выборка.ПолучитьОбъект();
		
		Если Не ОбъектНоменклатура.ЭтоГруппа И НЕ (ОбъектНоменклатура.ЭтоЗапас ИЛИ ОбъектНоменклатура.ЭтоИмущество
			ИЛИ ОбъектНоменклатура.ЭтоПакетУслуг ИЛИ ОбъектНоменклатура.ЭтоПодарочныйСертификат ИЛИ ОбъектНоменклатура.ЭтоУслуга) Тогда
			
			Если ОбъектНоменклатура.ТипНоменклатуры		= Перечисления.ТипыНоменклатуры.Запас
				Или ОбъектНоменклатура.ТипНоменклатуры	= Перечисления.ТипыНоменклатуры.Материал Тогда 
				ОбъектНоменклатура.ЭтоЗапас             = Истина;
			КонецЕсли;
			
			ОбъектНоменклатура.ЭтоИмущество        	   = ОбъектНоменклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Имущество;
			ОбъектНоменклатура.ЭтоПакетУслуг           = ОбъектНоменклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор;
			ОбъектНоменклатура.ЭтоПодарочныйСертификат = ОбъектНоменклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат;
			ОбъектНоменклатура.ЭтоУслуга               = ОбъектНоменклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга;
			
			Попытка
				ОбъектНоменклатура.Записать();
			Исключение
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - удаляет драйвер Простые звонки.
//
Процедура УдалитьПредопределенныйДрайверПростыеЗвонки() Экспорт
	
НайденыйДрайвер = Справочники.ДрайверыОборудования.НайтиПоНаименованию("IP-Телефония: Простые звонки");

Если ЗначениеЗаполнено(НайденыйДрайвер) Тогда

	Попытка
		ДрайверОбъект = НайденыйДрайвер.ПолучитьОбъект();
		ДрайверОбъект.ИмяПредопределенныхДанных = "";
		ДрайверОбъект.Записать();	
		ДрайверОбъект.Удалить();
	Исключение
	
	КонецПопытки;
	
КонецЕсли;
	
КонецПроцедуры
     
// Процедура - Заполнить Классификатор услуг
//
Процедура ЗаполнитьКлассификаторУслуг() Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	// Заполняем справочник классификатор услуг
	Справочники.КлассификаторНоменклатурыМедицинскихУслуг.ЗаполнитьКлассификаторУслуг();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И НЕ Номенклатура.КодНоменклатурыМедицинскиУслуг = """" ");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		СсылкаТек = Выборка.Ссылка;
		Если ЗначениеЗаполнено(СсылкаТек.КодНоменклатурыМедицинскиУслуг) Тогда
			
			КодУслуги = СсылкаТек.КодНоменклатурыМедицинскиУслуг;
			ОбъектТек = СсылкаТек.ПолучитьОбъект();
			
			ОбъектТек.НоменклатураМедицинскихУслуг = Справочники.КлассификаторНоменклатурыМедицинскихУслуг.НайтиПоКоду(КодУслуги);
			Если Не ЗначениеЗаполнено(ОбъектТек.НоменклатураМедицинскихУслуг) Тогда
				// Заменяем кирилицу на латиницу
				Если Лев(КодУслуги, 1) = "А" Тогда
					КодУслуги =	СтрЗаменить(КодУслуги, "А", "A"); 
				ИначеЕсли Лев(КодУслуги, 1) = "В" Тогда
					КодУслуги =	СтрЗаменить(КодУслуги, "В", "B"); 		
				КонецЕсли;
				ОбъектТек.НоменклатураМедицинскихУслуг = Справочники.КлассификаторНоменклатурыМедицинскихУслуг.НайтиПоКоду(КодУслуги);
			КонецЕсли;

			ОбъектТек.УЕТ = ОбъектТек.НоменклатураМедицинскихУслуг.УЕТ;
			
			Попытка
				ОбъектТек.Записать();
			Исключение
				
			КонецПопытки;
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Процедура обновляет предопределенные виды контактной информации
//
Процедура ОбновитьПредопределенныеВидыКИ(Параметры = Неопределено) Экспорт 

	УстановитьПривилегированныйРежим(Истина);
		
	КонтактнаяИнформацияСервер.УстановитьСвойстваПредопределенныхВидовКонтактнойИнформации();

	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;

КонецПроцедуры

// Процедура, выполняет первоначальное заполнение регистра сведений "Диалоги".
//
Процедура ЗаполнитьДанныеДиалогов() Экспорт

	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ЖурналСообщений.Период) КАК Период,
	|	ЖурналСообщений.ВнешняяСистема КАК ВнешняяСистема,
	|	ЖурналСообщений.ИдКлиента КАК ИдКлиента
	|ПОМЕСТИТЬ ДатыПоследнихСообщений
	|ИЗ
	|	РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналСообщений КАК ЖурналСообщений
	|		ПО КонтактыМессенджеров.ВнешняяСистема = ЖурналСообщений.ВнешняяСистема
	|			И КонтактыМессенджеров.Идентификатор = ЖурналСообщений.ИдКлиента
	|ГДЕ
	|	ЖурналСообщений.ОператорСообщения <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ЖурналСообщений.ОжиданиеСообщения
	|	И НЕ ЖурналСообщений.СлужебноеСообщение
	|	И НЕ ЖурналСообщений.Триггер
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналСообщений.ВнешняяСистема,
	|	ЖурналСообщений.ИдКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЖурналСообщений.Период КАК Период,
	|	ЖурналСообщений.ВнешняяСистема КАК ВнешняяСистема,
	|	ЖурналСообщений.ИдКлиента КАК ИдКлиента,
	|	МАКСИМУМ(ЖурналСообщений.ИдСообщения) КАК ИдСообщения
	|ПОМЕСТИТЬ ИдентификаторыСообщений
	|ИЗ
	|	ДатыПоследнихСообщений КАК ДатыПоследнихСообщений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналСообщений КАК ЖурналСообщений
	|		ПО ДатыПоследнихСообщений.Период = ЖурналСообщений.Период
	|			И ДатыПоследнихСообщений.ВнешняяСистема = ЖурналСообщений.ВнешняяСистема
	|			И ДатыПоследнихСообщений.ИдКлиента = ЖурналСообщений.ИдКлиента
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналСообщений.Период,
	|	ЖурналСообщений.ВнешняяСистема,
	|	ЖурналСообщений.ИдКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЖурналСообщений.ВнешняяСистема КАК ВнешняяСистема,
	|	ЖурналСообщений.ИдКлиента КАК ИдКлиента,
	|	ЖурналСообщений.ОператорСообщения КАК ОператорСообщения
	|ПОМЕСТИТЬ ОператорыКонтактов
	|ИЗ
	|	ИдентификаторыСообщений КАК ИдентификаторыСообщений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналСообщений КАК ЖурналСообщений
	|		ПО ИдентификаторыСообщений.ВнешняяСистема = ЖурналСообщений.ВнешняяСистема
	|			И ИдентификаторыСообщений.ИдКлиента = ЖурналСообщений.ИдКлиента
	|			И ИдентификаторыСообщений.ИдСообщения = ЖурналСообщений.ИдСообщения
	|			И ИдентификаторыСообщений.Период = ЖурналСообщений.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактыМессенджеров.ВнешняяСистема КАК ВнешняяСистема,
	|	КонтактыМессенджеров.Идентификатор КАК ИдКлиента,
	|	ЕСТЬNULL(ОператорыКонтактов.ОператорСообщения, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Оператор
	|ИЗ
	|	РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОператорыКонтактов КАК ОператорыКонтактов
	|		ПО КонтактыМессенджеров.ВнешняяСистема = ОператорыКонтактов.ВнешняяСистема
	|			И КонтактыМессенджеров.Идентификатор = ОператорыКонтактов.ИдКлиента");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.Диалоги.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИдДиалога		 = Новый УникальныйИдентификатор;
		МенеджерЗаписи.ИдКлиента		 = Выборка.ИдКлиента;
		МенеджерЗаписи.ВнешняяСистема	 = Выборка.ВнешняяСистема;
		МенеджерЗаписи.Оператор			 = Выборка.Оператор;
		МенеджерЗаписи.Начало			 = Дата(2021, 1, 1);
		МенеджерЗаписи.Окончание		 = Дата(2021, 1, 1);
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура, восстанавливает версии файлов.
// 
Процедура ОбработатьВерсииФайлов(Параметры = Неопределено) Экспорт
	
    Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВерсииФайлов.Ссылка КАК Ссылка,
	|	ВерсииФайлов.ФайлХранилище КАК ФайлХранилищеВерсий
	|ИЗ
	|	Справочник.ВерсииФайлов КАК ВерсииФайлов
	|ГДЕ
	|	ВерсииФайлов.ТипХраненияФайла = ЗНАЧЕНИЕ(Перечисление.ТипыХраненияФайлов.ВИнформационнойБазе)";
	
	
	Выборка = Запрос.Выполнить().Выбрать();	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			ДвоичныеДанные = Выборка.ФайлХранилищеВерсий.Получить();
			Если Не ЗначениеЗаполнено(ДвоичныеДанные) Тогда
				Продолжить;                                    
			КонецЕсли;
			НачатьТранзакцию();
			
			НаборЗаписей = РегистрыСведений.ДвоичныеДанныеФайлов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Файл.Установить(Выборка.Ссылка);
			
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаписьНабора.Файл = Выборка.Ссылка;
			ЗаписьНабора.ДвоичныеДанныеФайла = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина);
			
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
		Исключение
			Если ТранзакцияАктивна()Тогда
				ОтменитьТранзакцию();        
			КонецЕсли;
			// Если не удалось обработать какой-либо документ, повторяем попытку снова.
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось обработать версию файла: %1 по причине:
			|%2'"), 
			Выборка.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
			Выборка.Ссылка.Метаданные(), Выборка.Ссылка, ТекстСообщения);
		КонецПопытки;    
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура, обновляет документы рассылки сообщений.
//
Процедура ПереходНаНовуюСистемуРассылкиСообщений(Параметры = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	Попытка
		
		// Обновление регламентного задания.
		НайденныеРегламентныеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.ОбработкаSMSСообщений));
		
		Если НайденныеРегламентныеЗадания.Количество() > 0 Тогда
			
			РегламентноеЗадание = НайденныеРегламентныеЗадания[0];
			РегламентноеЗадание.Наименование = "Отправка сообщений и проверка статусов";
			РегламентноеЗадание.Расписание.ПериодПовтораВТечениеДня = 60;
			РегламентноеЗадание.Записать();
			
		КонецЕсли;
		
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка при переходе на новую систему рассылки сообщений. Обновление регламентного задания.", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());	
	КонецПопытки;

	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура, сжимаект картинки
//
Процедура СжатьКартинкиВИнформационнойБазе(Параметры = Неопределено) Экспорт
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура, исправляет виды КИ пациентов.
//
Процедура ИсправлениеВидовКИПациентов(Параметры = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидРодителяКонтрагенты", "%" + "Контрагенты" + "%");
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТаблицаГруппКлиентов
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ЭтоГруппа = ИСТИНА
	|	И Контрагенты.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка КАК ВидКИ
	|ПОМЕСТИТЬ ТаблицаВидовКИ
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.Предопределенный = ЛОЖЬ
	|	И ВидыКонтактнойИнформации.Родитель.Наименование ПОДОБНО &ВидРодителяКонтрагенты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Пациент
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаВидовКИ КАК ТаблицаВидовКИ
	|		ПО КонтрагентыКонтактнаяИнформация.Вид = ТаблицаВидовКИ.ВидКИ
	|ГДЕ
	|	(КонтрагентыКонтактнаяИнформация.Ссылка.Родитель В
	|				(ВЫБРАТЬ
	|					ТаблицаГруппКлиентов.Ссылка
	|				ИЗ
	|					ТаблицаГруппКлиентов)
	|			ИЛИ КонтрагентыКонтактнаяИнформация.Ссылка.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВидовКИ.ВидКИ КАК ВидКИ
	|ИЗ
	|	ТаблицаВидовКИ КАК ТаблицаВидовКИ";
	
	ПакетЗапросов 		= Запрос.ВыполнитьПакет();
	МассивПациентов 	= ПакетЗапросов[2].Выгрузить().ВыгрузитьКолонку("Пациент");
	МассивБитыхВидовКИ 	= ПакетЗапросов[3].Выгрузить().ВыгрузитьКолонку("ВидКИ");
	
	ВидКИ__ТелефонКлиента 				= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонКлиента");
	ВидКИ__МобильноеПриложениеКлиента 	= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.МобильноеПриложениеКлиента");
	ВидКИ__ТелефонКлиентаДополнительный = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонКлиентаДополнительный");
	ВидКИ__EmailКлиента 				= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EmailКлиента");
	ВидКИ__SkypeКлиента 				= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.SkypeКлиента");
	ВидКИ__АдресКлиента 				= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.АдресКлиента");
	ВидКИ__СоциальнаяСетьКлиента 		= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.СоциальнаяСетьКлиента");

	МетаданныеСправочника 		= Метаданные.Справочники.Контрагенты;
	ПредставлениеСправочника 	= МетаданныеСправочника.Представление();

	Для Каждого Пациент Из МассивПациентов Цикл 
		ПациентОбъект = Пациент.ПолучитьОбъект();
		Если ПациентОбъект = Неопределено Тогда 
			Продолжить;
		КонецЕсли;	
		Для Каждого СтрокаКИ Из ПациентОбъект.КонтактнаяИнформация Цикл 
			Если ЗначениеЗаполнено(СтрокаКИ.Тип) И НЕ МассивБитыхВидовКИ.Найти(СтрокаКИ.Вид) = Неопределено Тогда
				Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И ЗначениеЗаполнено(ВидКИ__ТелефонКлиента) Тогда 
					СтрокаКИ.Вид = ВидКИ__ТелефонКлиента;
				ИначеЕсли СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.МобильноеПриложение И ЗначениеЗаполнено(ВидКИ__МобильноеПриложениеКлиента) Тогда	
					СтрокаКИ.Вид = ВидКИ__МобильноеПриложениеКлиента;
				ИначеЕсли СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Факс И ЗначениеЗаполнено(ВидКИ__ТелефонКлиентаДополнительный) Тогда	
					СтрокаКИ.Вид = ВидКИ__ТелефонКлиентаДополнительный;
				ИначеЕсли СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты И ЗначениеЗаполнено(ВидКИ__EmailКлиента) Тогда	
					СтрокаКИ.Вид = ВидКИ__EmailКлиента;
				ИначеЕсли СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Skype И ЗначениеЗаполнено(ВидКИ__SkypeКлиента) Тогда	
					СтрокаКИ.Вид = ВидКИ__SkypeКлиента;
				ИначеЕсли СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес И ЗначениеЗаполнено(ВидКИ__АдресКлиента) Тогда	
					СтрокаКИ.Вид = ВидКИ__АдресКлиента;
				ИначеЕсли СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница ИЛИ СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.СоциальнаяСеть И ЗначениеЗаполнено(ВидКИ__СоциальнаяСетьКлиента) Тогда	
					СтрокаКИ.Вид = ВидКИ__СоциальнаяСетьКлиента;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПациентОбъект);
		Исключение
			ШаблонКомментария = НСтр("ru = 'Не удалось исправить вид контактной информации у пациента: ""%1"", Описание ошибки: ""%2""' ");
			
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонКомментария,
			Пациент,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение,
			МетаданныеСправочника,,
			Комментарий);
			
			ВызватьИсключение;
		КонецПопытки;	
	КонецЦикла;	

	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура, переносит роль Использование мессенджера из расширения
//
Процедура ПереносРолиИспользованиеМессенджераИзРасширения() Экспорт

	Если Не ОбщегоНазначенияСтоматология.ИспользуетсяРасширение("Мессенджер") Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	МетаданныеСправочника 		= Метаданные.Справочники.Пользователи;
	ПредставлениеСправочника 	= МетаданныеСправочника.Представление();

	Для Каждого ПользовательИБ Из ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл
		Если Метаданные.Роли.Найти("Мессенджер_ИспользоватьМессенджер") <> Неопределено
			И ПользовательИБ.Роли.Содержит(Метаданные.Роли.Мессенджер_ИспользоватьМессенджер) Тогда
			
			Попытка  
				
				НовыеРоли = Неопределено;
				НовыеСвойства = Неопределено;
				ПользователиСтоматология.ПрочитатьПользователяИБ(ПользовательИБ.УникальныйИдентификатор, НовыеСвойства, НовыеРоли);
				НовыеРоли.Добавить("ИспользованиеМессенджера");
				Индекс = НовыеРоли.Найти("Мессенджер_ИспользоватьМессенджер");
 				НовыеРоли.Удалить(Индекс); 
	  			ОписаниеОшибки = "";
				ПользователиСтоматология.ЗаписатьПользователяИБ(ПользовательИБ.УникальныйИдентификатор, НовыеСвойства, НовыеРоли, , ОписаниеОшибки);
				
			Исключение
				ШаблонКомментария = НСтр("ru = 'Не удалось добавить роль: Использование мессенджера, пользователю: ""%1"". Добавьте эту роль через карточку сотрудника.'");
				
				Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонКомментария,
				ПользовательИБ);
				
				ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				МетаданныеСправочника,,
				Комментарий);
				
				ВызватьИсключение;
			КонецПопытки;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура, устанавливает значение константы ОбязательныеПоляСобытие
//
Процедура ЗаполнитьКонстантуОбязательныеПоляСобытие() Экспорт

	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	СтруктураОбязательныеПоля = Новый Структура;
		
	СтруктураОбязательныеПоля.Вставить("Контрагент", Истина);	
	СтруктураОбязательныеПоля.Вставить("Комментарий", Ложь);	
 	СтруктураОбязательныеПоля.Вставить("УслугиПричинаЗаписиПолем", Ложь);	
	СтруктураОбязательныеПоля.Вставить("УслугиСотрудникПолем", Ложь);	
	СтруктураОбязательныеПоля.Вставить("УслугиПомещениеПолем", Ложь);	
	
	Хранилище = Новый ХранилищеЗначения(СтруктураОбязательныеПоля);
	
	Константы.ОбязательныеПоляСобытие.Установить(Хранилище);
	
КонецПроцедуры

// Процедура, устанавливает значение константы ОбязательныеПоляСобытие
//
Процедура ДобавитьПользователямВрачИГлавныйВрачРольДобавлениеИзменениеКлиентов() Экспорт

	#Если Не ВнешнееСоединение Тогда
		
		Если НЕ ПривилегированныйРежим() Тогда 
			УстановитьПривилегированныйРежим(Истина);
		КонецЕсли;
		
		МетаданныеСправочника 		= Метаданные.Справочники.Пользователи;
		ПредставлениеСправочника 	= МетаданныеСправочника.Представление();
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка,
		|	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ПометкаУдаления = ЛОЖЬ
		|	И Пользователи.РольПользователя В (ЗНАЧЕНИЕ(Перечисление.РольПользователя.Врач), ЗНАЧЕНИЕ(Перечисление.РольПользователя.ГлавныйВрач))");
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.ИдентификаторПользователяИБ) Тогда
				
				ПользовательИБ = ПользователиСтоматология.ПолучитьПользователяПоУникальномуИдентификатору(Выборка.ИдентификаторПользователяИБ);
				
				Попытка
					
					Если ПользовательИБ.Роли.Содержит(Метаданные.Роли.ДобавлениеИзменениеКлиентов) = Ложь 
						Или ПользовательИБ.Роли.Содержит(Метаданные.Роли.ЧтениеКлиентов) = Ложь
						Или ПользовательИБ.Роли.Содержит(Метаданные.Роли.ЧтениеКонтрагентов) = Ложь Тогда
						
						Если ПользовательИБ.Роли.Содержит(Метаданные.Роли.ДобавлениеИзменениеКлиентов) = Ложь Тогда
							ПользовательИБ.Роли.Добавить(Метаданные.Роли.ДобавлениеИзменениеКлиентов);                 
						КонецЕсли;
						
						Если ПользовательИБ.Роли.Содержит(Метаданные.Роли.ЧтениеКлиентов) = Ложь Тогда
							ПользовательИБ.Роли.Добавить(Метаданные.Роли.ЧтениеКлиентов);                 
						КонецЕсли;
						
						Если ПользовательИБ.Роли.Содержит(Метаданные.Роли.ЧтениеКонтрагентов) = Ложь Тогда
							ПользовательИБ.Роли.Добавить(Метаданные.Роли.ЧтениеКонтрагентов);                 
						КонецЕсли;
						
						ПользовательИБ.Записать();
						
					КонецЕсли;
					
				Исключение
					
					ШаблонКомментария = НСтр("ru = 'Не удалось добавить роль: ДобавлениеИзменениеКлиентов, пользователю: ""%1"". Добавьте эту роль через карточку сотрудника.'");
					
					Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонКомментария,
					ПользовательИБ);
					
					ЗаписьЖурналаРегистрации(
					ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Предупреждение,
					МетаданныеСправочника,,
					Комментарий);
					
					ВызватьИсключение;
					
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЦикла;
	#КонецЕсли
	
КонецПроцедуры

// Процедура - Инициализация предопределенных сценариев чат бота
//
Процедура ИнициализацияПредопределенныхСценариевЧатБота(ОбновитьМессенджер = Истина, ТаблицаСервисовSMS = Неопределено) Экспорт

	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	Если ОбновитьМессенджер Тогда 
		Если НЕ ОбщегоНазначенияСтоматология.ИспользуетсяРасширение("Мессенджер") Тогда 
			Возврат;
		КонецЕсли;
		
		РасширениеМессенджера = ПолучитьРасширениеМесседжера();
		
		Если РасширениеМессенджера = Неопределено Тогда
			// Расширение мессенджера не установлено, обновление не требуется.
			Возврат;
		КонецЕсли;
		
		МетаданныеМакета = Метаданные.ОбщиеМакеты.Найти("РасширениеМессенджера");
		
		Если МетаданныеМакета = Неопределено Тогда
			// Макет удален из конфигурации.
			Возврат;
		КонецЕсли;
		
		ДанныеРасширения = ПолучитьОбщийМакет(МетаданныеМакета);
		МетаданныеПоставляемогоРасширения = Новый ОбъектМетаданныхКонфигурация(ДанныеРасширения);
		
		Если ТребуетсяОбновлениеПоставляемогоРасширения(РасширениеМессенджера, МетаданныеПоставляемогоРасширения) = Истина Тогда
			// Обновление месседжера выше не произведено. Отменяем обновление данных.
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СценарииЧатБотов.Ссылка КАК СценарийЧатБота,
	|	СценарииЧатБотов.Используется КАК ИспользуетсяСценарий,
	|	СценарииЧатБотов.ИмяМакетаПредопределенногоСценария КАК ИмяМакетаПредопределенногоСценария,
	|	ЕСТЬNULL(ТриггерныеСобытияДействия.Ссылка, ЗНАЧЕНИЕ(Справочник.ТриггерныеСобытия.ПустаяСсылка)) КАК Триггер,
	|	ЕСТЬNULL(ТриггерныеСобытияДействия.Ссылка.Активно, ЛОЖЬ) КАК ТриггерАктивно,
	|	ЕСТЬNULL(ТриггерныеСобытияДействия.Использование, ЛОЖЬ) КАК ИспользованиеДействияТриггера
	|ИЗ
	|	Справочник.СценарииЧатБотов КАК СценарииЧатБотов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТриггерныеСобытия.Действия КАК ТриггерныеСобытияДействия
	|		ПО (ТриггерныеСобытияДействия.ВидДействия = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота))
	|			И СценарииЧатБотов.Ссылка = ТриггерныеСобытияДействия.СценарийЧатБота
	|			И (ТриггерныеСобытияДействия.Ссылка.ПометкаУдаления = ЛОЖЬ)
	|			И (ТриггерныеСобытияДействия.Ссылка.ЭтоГруппа = ЛОЖЬ)
	|			И (ТриггерныеСобытияДействия.Удалено = ЛОЖЬ)
	|ГДЕ
	|	СценарииЧатБотов.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СценарииЧатБотовСвойстваЭтаповСценария.Ссылка КАК СценарийЧатБота,
	|	СценарииЧатБотовСвойстваЭтаповСценария.Ссылка.ИмяМакетаПредопределенногоСценария КАК ИмяМакетаПредопределенногоСценария,
	|	СценарииЧатБотовСвойстваЭтаповСценария.НаименованиеЭтапа КАК НаименованиеЭтапа,
	|	СценарииЧатБотовСвойстваЭтаповСценария.ФормироватьСообщениеПоШаблону КАК ФормироватьСообщениеПоШаблону,
	|	СценарииЧатБотовСвойстваЭтаповСценария.СообщениеБота КАК СообщениеБота,
	|	СценарииЧатБотовСвойстваЭтаповСценария.ШаблонСообщения КАК ШаблонСообщения
	|ИЗ
	|	Справочник.СценарииЧатБотов.СвойстваЭтаповСценария КАК СценарииЧатБотовСвойстваЭтаповСценария
	|ГДЕ
	|	СценарииЧатБотовСвойстваЭтаповСценария.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И СценарииЧатБотовСвойстваЭтаповСценария.ТипЭтапа В (5, 6)";
	
	РезультатПакетногоЗапроса 		= Запрос.ВыполнитьПакет();
	ТаблицаТриггеровИСценариев 		= РезультатПакетногоЗапроса[0].Выгрузить();
	ТаблицаСвойствЭтаповСценариев 	= РезультатПакетногоЗапроса[1].Выгрузить();
	
	ТаблицаСценариев 				= ТаблицаТриггеровИСценариев.Скопировать(, "СценарийЧатБота, ИспользуетсяСценарий, ИмяМакетаПредопределенногоСценария");
	ТаблицаСценариев.Свернуть("СценарийЧатБота, ИспользуетсяСценарий, ИмяМакетаПредопределенногоСценария");
	
	// ---------------------------------------------------------------------------------------------------------------------------	
	МассивСтрокСценариев = ТаблицаСценариев.НайтиСтроки(Новый Структура("ИмяМакетаПредопределенногоСценария", "ЗаписьНаПрофосмотр"));
	Для Каждого СтрокаСценарий Из МассивСтрокСценариев Цикл 
		Сценарий_Объект = СтрокаСценарий.СценарийЧатБота.ПолучитьОбъект();
		Сценарий_Объект.ПометкаУдаления = Истина;
		Сценарий_Объект.ОбменДанными.Загрузка = Истина;
		Попытка
			Сценарий_Объект.Записать();
		Исключение
			
		КонецПопытки;	
	КонецЦикла;	
	Сценарий_ЗаписьНаПрофосмотр = Справочники.СценарииЧатБотов.ИнициализироватьСценарий("ЗаписьНаПрофосмотр");
	Если ЗначениеЗаполнено(Сценарий_ЗаписьНаПрофосмотр) Тогда
		ЕстьТриггер = Ложь;
		Для Каждого СтрокаТаблицы Из ТаблицаТриггеровИСценариев Цикл 
			Если СтрокаТаблицы.ИмяМакетаПредопределенногоСценария = "ЗаписьНаПрофосмотр" И ЗначениеЗаполнено(СтрокаТаблицы.Триггер) Тогда
				Триггер_Объект = СтрокаТаблицы.Триггер.ПолучитьОбъект();
				МассивСтрокТЧ_Действия = Триггер_Объект.Действия.НайтиСтроки(Новый Структура("ВидДействия, СценарийЧатБота, Удалено", Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота, СтрокаТаблицы.СценарийЧатБота, Ложь));
				Для Каждого СтрокаТЧМассива Из МассивСтрокТЧ_Действия Цикл 
					СтрокаТЧМассива.СценарийЧатБота = Сценарий_ЗаписьНаПрофосмотр;
				КонецЦикла;	
				Триггер_Объект.ОбменДанными.Загрузка = Истина;
				Попытка
					Триггер_Объект.Записать();
					ЕстьТриггер = Истина;					
				Исключение
					
				КонецПопытки;	
			КонецЕсли;	
		КонецЦикла;
		Если НЕ ЕстьТриггер Тогда 
			ПараметрыТриггерногоСобытия = Новый Структура;
			ПараметрыТриггерногоСобытия.Вставить("Наименование" 	, "Чат-Бот: Запись на профилактический осмотр");
			ПараметрыТриггерногоСобытия.Вставить("Активно"			, Истина);
			ПараметрыТриггерногоСобытия.Вставить("УсловиеСобытия"	, Перечисления.ВариантыУсловийТриггерныхСобытий.ЛистОжиданияПрофосмотр);
			ПараметрыТриггерногоСобытия.Вставить("МоментСобытия"	, Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия);
			ПараметрыТриггерногоСобытия.Вставить("ПериодСобытия"	, 7);
			ПараметрыТриггерногоСобытия.Вставить("ПериодСобытияВид"	, Перечисления.Периодичность.День);
			ПараметрыТриггерногоСобытия.Вставить("ВремяСобытия"		, Дата('0001.01.01 12:30:00'));
			ПараметрыТриггерногоСобытия.Вставить("СтатусЗаписи"		, Перечисления.СтатусыСобытия.НеПодтверждена);
			ПараметрыТриггерногоСобытия.Вставить("ПараметрыДействия"
			, Новый Структура("Использование, ВидДействия, ВидАдресата, СценарийЧатБота, Описание", Истина, Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота, Перечисления.ВидыАдресатов.КонтрагентСобытия, Сценарий_ЗаписьНаПрофосмотр, НСтр("ru = 'Запустить сценарий: ""Запись на проф. осмотр""';en= 'Registration for prof. inspection'")));
			
			ТриггерноеСобытие = Справочники.ТриггерныеСобытия.ИнициализироватьТриггерноеСобытие(ПараметрыТриггерногоСобытия, , ТаблицаСервисовSMS);
		КонецЕсли;
	КонецЕсли;
	
	// ---------------------------------------------------------ПереносЗаписиНаПрием------------------------------------------------------------------	
	МассивСтрокСценариев = ТаблицаСценариев.НайтиСтроки(Новый Структура("ИмяМакетаПредопределенногоСценария", "ПереносЗаписиНаПрием"));
	Для Каждого СтрокаСценарий Из МассивСтрокСценариев Цикл 
		Сценарий_Объект = СтрокаСценарий.СценарийЧатБота.ПолучитьОбъект();
		Сценарий_Объект.ПометкаУдаления = Истина;
		Сценарий_Объект.ОбменДанными.Загрузка = Истина;
		Попытка
			Сценарий_Объект.Записать();
		Исключение
			
		КонецПопытки;	
	КонецЦикла;	
	Сценарий_ПереносЗаписиНаПрием = Справочники.СценарииЧатБотов.ИнициализироватьСценарий("ПереносЗаписиНаПрием");

	// ----------------------------------------------------------ПодтверждениеЗаписиНаПрием-----------------------------------------------------------------
	МассивСтрокСценариев = ТаблицаСценариев.НайтиСтроки(Новый Структура("ИмяМакетаПредопределенногоСценария", "ПодтверждениеЗаписиНаПрием"));
	Для Каждого СтрокаСценарий Из МассивСтрокСценариев Цикл 
		Сценарий_Объект = СтрокаСценарий.СценарийЧатБота.ПолучитьОбъект();
		Сценарий_Объект.ПометкаУдаления = Истина;
		Сценарий_Объект.ОбменДанными.Загрузка = Истина;
		Попытка
			Сценарий_Объект.Записать();
		Исключение
			
		КонецПопытки;	
	КонецЦикла;		
	Сценарий_ПодтверждениеЗаписиНаПрием = Справочники.СценарииЧатБотов.ИнициализироватьСценарий("ПодтверждениеЗаписиНаПрием");
	Если ЗначениеЗаполнено(Сценарий_ПодтверждениеЗаписиНаПрием) Тогда
		ЕстьТриггер = Ложь;
		Для Каждого СтрокаТаблицы Из ТаблицаТриггеровИСценариев Цикл 
			Если СтрокаТаблицы.ИмяМакетаПредопределенногоСценария = "ПодтверждениеЗаписиНаПрием" И ЗначениеЗаполнено(СтрокаТаблицы.Триггер) Тогда
				Триггер_Объект = СтрокаТаблицы.Триггер.ПолучитьОбъект();
				МассивСтрокТЧ_Действия = Триггер_Объект.Действия.НайтиСтроки(Новый Структура("ВидДействия, СценарийЧатБота, Удалено", Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота, СтрокаТаблицы.СценарийЧатБота, Ложь));
				Для Каждого СтрокаТЧМассива Из МассивСтрокТЧ_Действия Цикл 
					СтрокаТЧМассива.СценарийЧатБота = Сценарий_ПодтверждениеЗаписиНаПрием;
				КонецЦикла;	
				Триггер_Объект.ОбменДанными.Загрузка = Истина;
				Попытка
					Триггер_Объект.Записать();
					ЕстьТриггер = Истина;					
				Исключение
					
				КонецПопытки;	
			КонецЕсли;	
		КонецЦикла;
		Если НЕ ЕстьТриггер Тогда 		
			ПараметрыТриггерногоСобытия = Новый Структура;
			ПараметрыТриггерногоСобытия.Вставить("Наименование" 	, "Чат-Бот: Подтверждение записи на приём");
			ПараметрыТриггерногоСобытия.Вставить("Активно"			, Истина);
			ПараметрыТриггерногоСобытия.Вставить("УсловиеСобытия"	, Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема);
			ПараметрыТриггерногоСобытия.Вставить("МоментСобытия"	, Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия);
			ПараметрыТриггерногоСобытия.Вставить("ПериодСобытия"	, 1);
			ПараметрыТриггерногоСобытия.Вставить("ПериодСобытияВид"	, Перечисления.Периодичность.День);
			ПараметрыТриггерногоСобытия.Вставить("ВремяСобытия"		, Дата('0001.01.01 10:00:00'));
			ПараметрыТриггерногоСобытия.Вставить("СтатусЗаписи"		, Перечисления.СтатусыСобытия.НеПодтверждена);
			ПараметрыТриггерногоСобытия.Вставить("ПараметрыДействия"
			, Новый Структура("Использование, ВидДействия, ВидАдресата, СценарийЧатБота, Описание", Истина, Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота, Перечисления.ВидыАдресатов.КонтрагентСобытия, Сценарий_ПодтверждениеЗаписиНаПрием, НСтр("ru = 'Запустить сценарий: ""Подтверждение записи на приём""';en= 'Activate chatbot script'")));
			
			ТриггерноеСобытие = Справочники.ТриггерныеСобытия.ИнициализироватьТриггерноеСобытие(ПараметрыТриггерногоСобытия, , ТаблицаСервисовSMS);
		КонецЕсли;
	КонецЕсли;
	
	// ----------------------------------------------------------СборОтзывовОРаботеВрача-----------------------------------------------------------------
	МассивСтрокСценариев = ТаблицаСценариев.НайтиСтроки(Новый Структура("ИмяМакетаПредопределенногоСценария", "СборОтзывовОРаботеВрача"));
	Для Каждого СтрокаСценарий Из МассивСтрокСценариев Цикл 
		Сценарий_Объект = СтрокаСценарий.СценарийЧатБота.ПолучитьОбъект();
		Сценарий_Объект.ПометкаУдаления = Истина;
		Сценарий_Объект.ОбменДанными.Загрузка = Истина;
		Попытка
			Сценарий_Объект.Записать();
		Исключение
			
		КонецПопытки;	
	КонецЦикла;		
	Сценарий_СборОтзывовОРаботеВрача = Справочники.СценарииЧатБотов.ИнициализироватьСценарий("СборОтзывовОРаботеВрача");
	Если ЗначениеЗаполнено(Сценарий_СборОтзывовОРаботеВрача) Тогда
		ЕстьТриггер = Ложь;
		Для Каждого СтрокаТаблицы Из ТаблицаТриггеровИСценариев Цикл 
			Если СтрокаТаблицы.ИмяМакетаПредопределенногоСценария = "СборОтзывовОРаботеВрача" И ЗначениеЗаполнено(СтрокаТаблицы.Триггер) Тогда
				Триггер_Объект = СтрокаТаблицы.Триггер.ПолучитьОбъект();
				МассивСтрокТЧ_Действия = Триггер_Объект.Действия.НайтиСтроки(Новый Структура("ВидДействия, СценарийЧатБота, Удалено", Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота, СтрокаТаблицы.СценарийЧатБота, Ложь));
				Для Каждого СтрокаТЧМассива Из МассивСтрокТЧ_Действия Цикл 
					СтрокаТЧМассива.СценарийЧатБота = Сценарий_СборОтзывовОРаботеВрача;
				КонецЦикла;	
				Триггер_Объект.ОбменДанными.Загрузка = Истина;
				Попытка
					Триггер_Объект.Записать();
					ЕстьТриггер = Истина;					
				Исключение
					
				КонецПопытки;	
			КонецЕсли;	
		КонецЦикла;
		Если НЕ ЕстьТриггер Тогда 		
			ПараметрыТриггерногоСобытия = Новый Структура;
			ПараметрыТриггерногоСобытия.Вставить("Наименование" 	, "Чат-Бот: Сбор отзывов о работе врача");
			ПараметрыТриггерногоСобытия.Вставить("Активно"			, Истина);
			ПараметрыТриггерногоСобытия.Вставить("УсловиеСобытия"	, Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершен);
			ПараметрыТриггерногоСобытия.Вставить("РезультатПриема"	, 1);
			ПараметрыТриггерногоСобытия.Вставить("МоментСобытия"	, Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия);
			ПараметрыТриггерногоСобытия.Вставить("ПериодСобытия"	, 1);
			ПараметрыТриггерногоСобытия.Вставить("ПериодСобытияВид"	, Перечисления.Периодичность.Час);
			ПараметрыТриггерногоСобытия.Вставить("ВремяСобытия"		, Дата('0001.01.01 10:00:00'));
			ПараметрыТриггерногоСобытия.Вставить("ПараметрыДействия"
			, Новый Структура("Использование, ВидДействия, ВидАдресата, СценарийЧатБота, Описание", Истина, Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота, Перечисления.ВидыАдресатов.КонтрагентСобытия, Сценарий_СборОтзывовОРаботеВрача, НСтр("ru = 'Запустить сценарий: ""Сбор отзывов о работе врача""';en= 'Activate chatbot script'")));
			
			ТриггерноеСобытие = Справочники.ТриггерныеСобытия.ИнициализироватьТриггерноеСобытие(ПараметрыТриггерногоСобытия, Истина, ТаблицаСервисовSMS);
		КонецЕсли;
	КонецЕсли;
	
	Справочники.ВариантыОтветов.ОбновитьБиблиотекуОтветов();
	
КонецПроцедуры  

// Процедура, Добавляет записи в регистр настройки пользователей
//
Процедура ДобавитьЗаписиВРегистрНастройкиПользователей() Экспорт  
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиСотрудников.Сотрудник КАК Сотрудник,
	|	НастройкиСотрудников.ДатаПриема КАК ДатаПриема,
	|	НастройкиСотрудников.ДатаУвольнения КАК ДатаУвольнения,
	|	НастройкиСотрудников.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НЕ НастройкиСотрудников.Сотрудник.ПометкаУдаления
	|	И НЕ НастройкиСотрудников.Сотрудник.ЭтоГруппа 
	|   И НастройкиСотрудников.Сотрудник.Ссылка <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И (НастройкиСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ НастройкиСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1))
	|ИТОГИ ПО
	|	НастройкиСотрудников.СтруктурнаяЕдиница");
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл 		
		ВыборкаСотрудников = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаСотрудников.Следующий() Цикл  
			Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ВыборкаСотрудников.Сотрудник.ИдентификаторПользователяИБ);
			НаборЗаписей = РегистрыСведений.НастройкиПользователей.СоздатьМенеджерЗаписи(); 
			НаборЗаписей.СтруктурнаяЕдиница = ВыборкаСотрудников.СтруктурнаяЕдиница;
			НаборЗаписей.Пользователь = ?(Пользователь.ЭтоПользовательИБ , Пользователь, ВыборкаСотрудников.Сотрудник);
			Если ВыборкаСотрудников.ДатаПриема <> ДАТА(1, 1, 1) Тогда
				НаборЗаписей.Настройка = ПланыВидовХарактеристик.НастройкиПользователей.ДатаПриема;
				НаборЗаписей.Значение = ВыборкаСотрудников.ДатаПриема;				
			КонецЕсли;
			Если ВыборкаСотрудников.ДатаУвольнения <> Дата(1, 1, 1) Тогда 
				Если НаборЗаписей.Значение = Неопределено Тогда	
					НаборЗаписей.Настройка = ПланыВидовХарактеристик.НастройкиПользователей.ДатаУвольнения;
					НаборЗаписей.Значение = ВыборкаСотрудников.ДатаУвольнения; 
				Иначе  
					НовыйНаборЗаписей = РегистрыСведений.НастройкиПользователей.СоздатьМенеджерЗаписи();
					НовыйНаборЗаписей.СтруктурнаяЕдиница = ВыборкаСотрудников.СтруктурнаяЕдиница;
					НовыйНаборЗаписей.Пользователь = ?(Пользователь.ЭтоПользовательИБ ,Пользователь, ВыборкаСотрудников.Сотрудник);
					НовыйНаборЗаписей.Настройка = ПланыВидовХарактеристик.НастройкиПользователей.ДатаУвольнения;
					НовыйНаборЗаписей.Значение = ВыборкаСотрудников.ДатаУвольнения;
					НовыйНаборЗаписей.Записать();
				КонецЕсли;
			КонецЕсли;
			НаборЗаписей.Записать();
		КонецЦикла;	
	КонецЦикла;	
	
КонецПроцедуры	

// Процедура - Перенести элементы справочника диагнозы
//
Процедура ПеренестиЭлементыСправочникаДиагнозы() Экспорт
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДиагнозыУдалить.Родитель КАК Родитель,
		|	ДиагнозыУдалить.ЭтоГруппа КАК ЭтоГруппа,
		|	ДиагнозыУдалить.Код КАК Код,
		|	ДиагнозыУдалить.Наименование КАК Наименование,
		|	ДиагнозыУдалить.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДиагнозыУдалить КАК ДиагнозыУдалить
		|ГДЕ
		|	НЕ ДиагнозыУдалить.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Код) Тогда		
			Диагноз = Справочники.Диагнозы.НайтиПоКоду(Выборка.Код);
			Если ЗначениеЗаполнено(Диагноз)
				И Диагноз.Наименование = Выборка.Наименование Тогда
				Продолжить;  				
			КонецЕсли;
		КонецЕсли;
		
		Если Выборка.ЭтоГруппа Тогда
			НовыйОбъект = Справочники.Диагнозы.СоздатьГруппу();
		Иначе
			НовыйОбъект = Справочники.Диагнозы.СоздатьЭлемент();
		КонецЕсли;
		НовыйОбъект.Код			 = Выборка.Код;
		НовыйОбъект.Наименование = Выборка.Наименование; 
		НовыйОбъект.Родитель	 = Выборка.Родитель;
		
		Попытка	
			НовыйОбъект.Записать();
		Исключение  
			ОписаниеОшибки = "Не перенесен диагноз " + Выборка.Наименование + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());  
			ЗаписьЖурналаРегистрации("ПеренестиЭлементыСправочникаДиагнозы", УровеньЖурналаРегистрации.Ошибка, 
				Метаданные.Справочники.ДиагнозыУдалить, Выборка.Ссылка, ОписаниеОшибки);			
		КонецПопытки;
		
	КонецЦикла;
		
КонецПроцедуры

// Процедура - Обновить записи регистра "Контрагенты сведения для списка".
//
Процедура ОбновитьЗаписиРегистраКонтрагентыСведенияДляСписка(Параметры = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		Запрос       = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтрагентыСведенияДляСписка.Контрагент.Ссылка КАК КонтрагентСсылка
		|ИЗ
		|	РегистрСведений.КонтрагентыСведенияДляСписка КАК КонтрагентыСведенияДляСписка
		|ГДЕ
		|	НЕ КонтрагентыСведенияДляСписка.Контрагент.ПометкаУдаления";   
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			РегистрыСведений.КонтрагентыСведенияДляСписка.АктуализироватьСведенияДляСписка(Выборка.КонтрагентСсылка);
		КонецЦикла;		
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Заполнение регистра сведений контрагенты сведения для списка", 
		УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		
	КонецПопытки;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Перенести настройки этапов сценариев в хранилище значений
//
Процедура ПеренестиНастройкиЭтаповСценариевВХранилищеЗначений() Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если НЕ ОбщегоНазначенияСтоматология.ИспользуетсяРасширение("Мессенджер") Тогда 
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СценарииЧатБотов.Ссылка КАК СценарииЧатБота,
	|	СценарииЧатБотов.НастройкиЭтапов КАК НастройкиЭтапов,
	|	СценарииЧатБотов.ИмяМакетаПредопределенногоСценария КАК ИмяМакетаПредопределенногоСценария
	|ИЗ
	|	Справочник.СценарииЧатБотов КАК СценарииЧатБотов
	|ГДЕ
	|	СценарииЧатБотов.ПометкаУдаления = ЛОЖЬ";
	
	ТаблицаСценариев = Запрос.Выполнить().Выгрузить();
	
	МетаданныеСправочника 		= Метаданные.Справочники.СценарииЧатБотов;
	ПредставлениеСправочника 	= МетаданныеСправочника.Представление();
	
	Для Каждого СтрокаСценарий Из ТаблицаСценариев Цикл 
		НастройкиЭтапов = Справочники.СценарииЧатБотов.ИнициализироватьТаблицуНастроекЭтапов(СтрокаСценарий.НастройкиЭтапов);
		Если ЗначениеЗаполнено(НастройкиЭтапов) Тогда 
			Продолжить;
		КонецЕсли;
		Сценарий_Объект = СтрокаСценарий.СценарииЧатБота.ПолучитьОбъект();
		Для Каждого СтрокаСвойство Из Сценарий_Объект.СвойстваЭтаповСценария Цикл 
			ЗаполнитьЗначенияСвойств(НастройкиЭтапов.Добавить(), СтрокаСвойство);
		КонецЦикла;
		Сценарий_Объект.НастройкиЭтапов 		= Новый ХранилищеЗначения(НастройкиЭтапов);
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Сценарий_Объект);
		Исключение
			ШаблонКомментария = НСтр("ru = 'Не удалось перенести настройки этапов сценария ""%1"" в хранилище значений, по причине: ""%2""' ");
			
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонКомментария,
			Сценарий_Объект.Ссылка,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение,
			МетаданныеСправочника,,
			Комментарий);
		КонецПопытки;	
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Переименовать наименования параметров шаблонов сообщений.
//
Процедура ПереименоватьНаименованияПараметровШаблоновСообщений() Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	Справочники.ШаблоныСообщений.ПереименоватьПараметрыШаблоновСообщений();
	
КонецПроцедуры	

// Процедура - Заполнить организацию в актах оказания услуг.
//
Процедура ЗаполнитьОрганизациюВАктахОказанияУслуг(Параметры = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос       = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АктОказанияУслуг.Ссылка КАК Ссылка,
	|	АктОказанияУслуг.СтруктурнаяЕдиница.Организация КАК ОрганизацияСЕ
	|ИЗ
	|	Документ.АктОказанияУслуг КАК АктОказанияУслуг
	|ГДЕ
	|	АктОказанияУслуг.Проведен = ИСТИНА
	|	И АктОказанияУслуг.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)";   
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		
		ОбъектАкт = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектАкт.Организация = Выборка.ОрганизацияСЕ;
		 
		Попытка	
			ОбъектАкт.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			
			ЗаписьЖурналаРегистрации("Заполнение организации в актах оказания услуг.", 
			УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
			
		КонецПопытки;

	КонецЦикла;	
			
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Перезаписать настройки цветов для структурной единицы.
//
Процедура ПерезаписьНастроекЦветовСтруктурнойЕдиницы() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	СписокНастроек = Новый Массив();
	СписокНастроек.Добавить(ПланыВидовХарактеристик.НастройкиПользователей["ЦветСобытияЗапланировано"]);
	СписокНастроек.Добавить(ПланыВидовХарактеристик.НастройкиПользователей["ЦветСобытияНеПодтверждено"]);
	СписокНастроек.Добавить(ПланыВидовХарактеристик.НастройкиПользователей["ЦветСобытияПриемНеСостоялся"]);
	СписокНастроек.Добавить(ПланыВидовХарактеристик.НастройкиПользователей["ЦветСобытияПациентОжидает"]);
	СписокНастроек.Добавить(ПланыВидовХарактеристик.НастройкиПользователей["ЦветСобытияПриемОкончен"]);
	СписокНастроек.Добавить(ПланыВидовХарактеристик.НастройкиПользователей["ЦветСобытияПациентВКресле"]);
	
	// Выборка текущих записей цветов пользователя. 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиПользователей.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НастройкиПользователей.Настройка КАК Настройка,
	|	МАКСИМУМ(НастройкиПользователей.Значение) КАК Значение,
	|	МАКСИМУМ(НастройкиПользователей.Пользователь) КАК Пользователь
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Настройка В(&Настройка)
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкиПользователей.СтруктурнаяЕдиница,
	|	НастройкиПользователей.Настройка";
	
	Запрос.УстановитьПараметр("Настройка" , СписокНастроек);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Удаление старых записей цветов пользователя из регистра.
	
	Набор = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей(); 
	Для Каждого Настройка Из СписокНастроек Цикл
		
		Набор.Отбор.Настройка.Установить(Настройка); 
		
		Попытка
			Набор.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("ПерезаписьНастроекЦветовСтруктурнойЕдиницы", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
		КонецПопытки; 
		
	КонецЦикла;
	
	// Запись новых цветов в регистр.
	
	Пока Выборка.Следующий() Цикл 
		
		ЗаписьРегистра 						= РегистрыСведений.НастройкиПользователей.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Пользователь 		= Выборка.Пользователь;
		ЗаписьРегистра.Настройка 			= Выборка.Настройка;
		ЗаписьРегистра.СтруктурнаяЕдиница 	= Выборка.СтруктурнаяЕдиница;
		ЗаписьРегистра.Значение 			= Выборка.Значение;
		
		Попытка
			ЗаписьРегистра.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("ПерезаписьНастроекЦветовСтруктурнойЕдиницы", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;	
	
КонецПроцедуры

// Процедура - Обновить предопределенные отчеты.
//
Процедура ОбновитьПредопределенныеВариантыОтчетов() Экспорт

	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Попытка
		
		ВариантыОтчетов.Обновить();
		ОтчетыСервер.Обновить();
		
	Исключение
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Обновление предопределенных вариантов отчетов"
																, УровеньЖурналаРегистрации.Ошибка,,
																, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
КонецПроцедуры 

// Процедура - Обновить текст отправки сообщения о новой карте
//
Процедура ОбновитьТекстОтправкиСообщенияОНовойКарте() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ШаблоныСообщений.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|ГДЕ
	|	ШаблоныСообщений.ИмяПредопределенныхДанных = ""СозданиеКарты""
	|	И ШаблоныСообщений.ЭтоГруппа = ЛОЖЬ
	|	И ШаблоныСообщений.ПометкаУдаления = ЛОЖЬ
	|	И ШаблоныСообщений.Содержание ПОДОБНО """"");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ШаблонСообщения = Выборка.Ссылка.ПолучитьОбъект();
		ШаблонСообщения.Содержание = "Ваша электронная карта №{Номер} {Ссылка}"; 
		
		Попытка
			ШаблонСообщения.Записать()
		Исключение
			ЗаписьЖурналаРегистрации("ЗаполнениеШалонаДляОтправкиКартWallet", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());	
		КонецПопытки; 
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Заменить использование констант триггером.
//
Процедура ЗаменитьИспользованиеКонстантПоздравленияСДРПациентовТриггером() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		
		ПоздравлятьПациентаПоСМС 	= Ложь;
		ПоздравлятьПациентаПоEmail 	= Ложь;
		ВремяОтправки				= Дата(1,1,1) + 60*60*10; 
		ШаблонСообщения				= Неопределено;
		
		РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ПоздравлятьКлиента);
		РегламентноеЗадание.Использование = Ложь;
		РегламентноеЗадание.Записать();
				
		Если (ПоздравлятьПациентаПоСМС = Ложь И ПоздравлятьПациентаПоEmail = Ложь) Или Не ЗначениеЗаполнено(ШаблонСообщения)Тогда	
			Возврат;		
		КонецЕсли;
		
		// Проверяем есть ли уже триггер с поздравлениями пациентов.
		Запрос = Новый Запрос( 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТриггерныеСобытия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТриггерныеСобытия КАК ТриггерныеСобытия
		|ГДЕ
		|	ТриггерныеСобытия.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ПациентДеньРождения)
		|	И ТриггерныеСобытия.ПометкаУдаления = ЛОЖЬ
		|	И ТриггерныеСобытия.Активно = ИСТИНА");
		
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		// Создаем триггер.
		СправочникТриггерноеСобытиеОбъект = Справочники.ТриггерныеСобытия.СоздатьЭлемент();
		
		СправочникТриггерноеСобытиеОбъект.Наименование      = "День рождения пациента.";
		СправочникТриггерноеСобытиеОбъект.Активно 			= Истина;
		СправочникТриггерноеСобытиеОбъект.ВремяСобытия 		= ВремяОтправки;
		СправочникТриггерноеСобытиеОбъект.УсловиеСобытия 	= Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентДеньРождения;
		СправочникТриггерноеСобытиеОбъект.ПараметрСобытия 	= 0;
		СправочникТриггерноеСобытиеОбъект.ПериодСобытия 	= 0;
		СправочникТриггерноеСобытиеОбъект.ПериодСобытияВид	= Перечисления.Периодичность.День; 
		СправочникТриггерноеСобытиеОбъект.Описание			= "Создано автоматически при обновлении конфигурации на версию 2.1.1.32";
		СправочникТриггерноеСобытиеОбъект.МоментСобытия		= Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия;	
		
		Если ПоздравлятьПациентаПоСМС = Истина Тогда 
			
			СервисСМСРассылки = Константы.СервисSMSРассылкиПоУмолчанию.Получить();
			
			Если ЗначениеЗаполнено(СервисСМСРассылки) = Ложь Тогда	
				СервисыСМСРассылки = Справочники.СервисыРассылки.ПолучитьСервисыSMSрассылки();
				СервисСМСРассылки = ?(СервисыСМСРассылки.Количество() <> 0, СервисыСМСРассылки[0].Ссылка, СервисСМСРассылки);
			КонецЕсли; 
			
			НоваяСтрокаДействие = СправочникТриггерноеСобытиеОбъект.Действия.Добавить();
			НоваяСтрокаДействие.ИдентификаторДействия 	= Новый УникальныйИдентификатор;
			НоваяСтрокаДействие.ВидДействия 			= Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение;
			НоваяСтрокаДействие.ВидАдресата 			= Перечисления.ВидыАдресатов.КонтрагентСобытия; 
			НоваяСтрокаДействие.ШаблонСообщения			= ШаблонСообщения;
			НоваяСтрокаДействие.Описание				= "Отправить пациенту сообщение";
			НоваяСтрокаДействие.Использование			= Истина;
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	СтруктурныеЕдиницы.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
			|ГДЕ
			|	СтруктурныеЕдиницы.ПометкаУдаления = ЛОЖЬ
			|	И СтруктурныеЕдиницы.ЭтоГруппа = ЛОЖЬ");	
			
			СтруктурныеЕдиницы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");;
			
			Для Каждого СтруктурнаяЕдиница Из СтруктурныеЕдиницы Цикл
				
				НоваяСтрокаНастройкиКаналов = СправочникТриггерноеСобытиеОбъект.НастройкиКаналовУведомлений.Добавить(); 
				
				НоваяСтрокаНастройкиКаналов.ИдентификаторДействия 		= НоваяСтрокаДействие.ИдентификаторДействия;
				НоваяСтрокаНастройкиКаналов.СтруктурнаяЕдиница			= СтруктурнаяЕдиница;
				НоваяСтрокаНастройкиКаналов.ОтправкаSMS					= Истина;
				НоваяСтрокаНастройкиКаналов.АккаунтСервисаРассылкиSMS	= СервисСМСРассылки;	
			КонецЦикла;
			
		КонецЕсли;
		
		Если ПоздравлятьПациентаПоEmail = Истина Тогда 
			
			СервисEmailРассылки = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты; 
			
			НоваяСтрокаДействие = СправочникТриггерноеСобытиеОбъект.Действия.Добавить();
			НоваяСтрокаДействие.ИдентификаторДействия 	= Новый УникальныйИдентификатор;
			НоваяСтрокаДействие.ВидДействия 			= Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо;
			НоваяСтрокаДействие.ВидАдресата 			= Перечисления.ВидыАдресатов.КонтрагентСобытия;
			НоваяСтрокаДействие.АккаунтEmail 			= СервисEmailРассылки; 
			НоваяСтрокаДействие.ШаблонСообщения			= ШаблонСообщения;
			НоваяСтрокаДействие.Описание				= "Отправить пациенту электронное письмо";
			НоваяСтрокаДействие.Использование			= Истина;
		КонецЕсли;
		
		СправочникТриггерноеСобытиеОбъект.Записать();
		
	Исключение 
		ЗаписьЖурналаРегистрации("ТриггерныеСобытияОбновлениеИнформационнойБазыСтоматология", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());	
	КонецПопытки;
	
КонецПроцедуры

// Процедура - Заменить диагнозы на новый справочник
//
Процедура ЗаменитьДиагнозыНаНовыйСправочник() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);  
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияПараметровОбследований.Документ КАК Документ,
		|	ЗначенияПараметровОбследований.ШаблонОбследования КАК ШаблонОбследования,
		|	ЗначенияПараметровОбследований.Параметр КАК Параметр,
		|	ЗначенияПараметровОбследований.Зуб КАК Зуб,
		|	ЗначенияПараметровОбследований.ЗначениеСтрокой КАК ЗначениеСтрокой
		|ИЗ
		|	РегистрСведений.ЗначенияПараметровОбследований КАК ЗначенияПараметровОбследований
		|ГДЕ
		|	ЗначенияПараметровОбследований.Параметр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПараметрыОбследований.Диагноз)
		|	И (ЗначенияПараметровОбследований.Значение = ЗНАЧЕНИЕ(Справочник.Диагнозы.ПустаяСсылка)
		|			ИЛИ ЗначенияПараметровОбследований.Значение = ЗНАЧЕНИЕ(Справочник.ДиагнозыУдалить.ПустаяСсылка))
		|	И (ВЫРАЗИТЬ(ЗначенияПараметровОбследований.ЗначениеСтрокой КАК СТРОКА(300))) <> """"";	
		Выборка = Запрос.Выполнить().Выбрать();	
		Пока Выборка.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.ЗначенияПараметровОбследований.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(Выборка.Документ);	
			НаборЗаписей.Отбор.ШаблонОбследования.Установить(Выборка.ШаблонОбследования);  
			НаборЗаписей.Отбор.Параметр.Установить(Выборка.Параметр);
			НаборЗаписей.Отбор.Зуб.Установить(Выборка.Зуб);
			
			НаборЗаписей.Прочитать();	
			
			Для Каждого Запись Из НаборЗаписей Цикл
				
				ДиагнозНовыйСправочник = Справочники.Диагнозы.НайтиПоНаименованию(Выборка.ЗначениеСтрокой);
				Если ЗначениеЗаполнено(ДиагнозНовыйСправочник) Тогда
					Запись.Значение = ДиагнозНовыйСправочник;
				КонецЕсли;
				
			КонецЦикла;
			
			НаборЗаписей.Записать();
		КонецЦикла;
		
	Исключение 
		ЗаписьЖурналаРегистрации("ЗаменитьДиагнозыНаНовыйСправочникОбновлениеИнформационнойБазыСтоматология", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());	
	КонецПопытки;
	
КонецПроцедуры

// Процедура, обновляет параметры внешних систем WhatsApp.
//
Процедура ОбновлениеПараметровВнешнихСистемWhatsApp(Параметры = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбщегоНазначения.РазделениеВключено() = Ложь Тогда
		
		Расширения = РасширенияКонфигурации.Получить();
		
		Для Каждого Расширение Из Расширения Цикл
			
			Если Расширение.Имя = "WhatsApp_GA" Тогда
				
				Попытка
					Расширение.Удалить();
					
				Исключение
					ЗаписьЖурналаРегистрации(
						"ОбновлениеПараметровВнешнихСистемWhatsApp",
						УровеньЖурналаРегистрации.Ошибка,,,
						НСтр("ru = 'Не удалось удалить неактуальное расширение ""WhatsApp_GA"", необходимо удалить расширение вручную'")
					);
					
				КонецПопытки;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВнешниеСистемы.Ссылка КАК Ссылка,
	|	ВнешниеСистемы.КлючПриложения КАК КлючПриложения,
	|	ВнешниеСистемы.Параметры КАК Параметры
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.GreenApi)
	|	И ВнешниеСистемы.Используется
	|	И НЕ ВнешниеСистемы.ПометкаУдаления");
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Если Параметры <> Неопределено Тогда
			Параметры.ОбработкаЗавершена = Истина;
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	ПараметрыAPIЦрм = ЛичныйКабинет.ПараметрыПодклчюенияК_API_CRM();
	Метод = "/update_whatsapp_instance";
	
	Попытка
		HTTPСоединение = Новый HTTPСоединение(ПараметрыAPIЦрм.АдресСервера,, ПараметрыAPIЦрм.Пользователь, ПараметрыAPIЦрм.Пароль,, 10); 	
		
	Исключение
		
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(
			"ОбновлениеПараметровВнешнихСистемWhatsApp",
			УровеньЖурналаРегистрации.Ошибка,,,
			НСтр("ru = 'Не удалось установить соединение с CRM'") + ОписаниеОшибки
		);
		
		Если Параметры <> Неопределено Тогда
			Параметры.ОбработкаЗавершена = Истина;
		КонецЕсли;
		
		Возврат;
		
	КонецПопытки;
		
	НомерОбласти 		= ЛичныйКабинет.ПолучитьНомерОбласти();
	РегНомерПродукта 	= ЛичныйКабинет.ПолучитьРегистрационныйНомерПродукта(); 
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыВнешнейСистемы = Выборка.Параметры.Получить();
		
		Если ТипЗнч(ПараметрыВнешнейСистемы) = Тип("Структура")
			И ПараметрыВнешнейСистемы.Свойство("UrlApi")
			И СтрНайти(ПараметрыВнешнейСистемы.UrlApi, "chat-api")
			И ПараметрыВнешнейСистемы.Свойство("Подписка")
			И ТипЗнч(ПараметрыВнешнейСистемы.Подписка) = Тип("Структура")
			И ПараметрыВнешнейСистемы.Подписка.Свойство("ПодпискаУИД")
			И ЗначениеЗаполнено(ПараметрыВнешнейСистемы.Подписка.ПодпискаУИД)
			И ПараметрыВнешнейСистемы.Подписка.Свойство("ДатаДо")
			И ?(ТипЗнч(ПараметрыВнешнейСистемы.Подписка.ДатаДо) = Тип("Дата"), ПараметрыВнешнейСистемы.Подписка.ДатаДо > ТекущаяДата, Истина) Тогда
			
			ЗаголовкиHTTP  = Новый Соответствие; 
			ЗаголовкиHTTP.Вставить("Content-Type", "application/json");
			
			Если НомерОбласти <> 0 Тогда
				ЗаголовкиHTTP.Вставить("areanumber" , НомерОбласти);
			КонецЕсли; 
			
			ЗаголовкиHTTP.Вставить("registrationnumber"	, РегНомерПродукта); 
			ЗаголовкиHTTP.Вставить("subscription-uid"	, ПараметрыВнешнейСистемы.Подписка.ПодпискаУИД);
			ЗаголовкиHTTP.Вставить("application-key"	, Выборка.КлючПриложения);
			ЗаголовкиHTTP.Вставить("integrationtype"	, "GeneralGreenApiAccount");
	
			HTTPЗапрос = Новый HTTPЗапрос(ПараметрыAPIЦрм.АдресПубликации + Метод, ЗаголовкиHTTP);				
			
			Попытка
				Запрос = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
				
				ТекстJSON  = Запрос.ПолучитьТелоКакСтроку(); 
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(ТекстJSON);
				ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);	
				
				Если ПараметрыJSON.Свойство("result") И ПараметрыJSON.result = Истина
					И ПараметрыJSON.Свойство("settings") И ЗначениеЗаполнено(ПараметрыJSON.settings) Тогда
					
					ПараметрыВнешнейСистемы.Вставить("ApiToken"	, ПараметрыJSON.settings.ApiToken);
					ПараметрыВнешнейСистемы.Вставить("ChannelId", ПараметрыJSON.settings.ChannelId);
					ПараметрыВнешнейСистемы.Вставить("UrlApi"	, ПараметрыJSON.settings.UrlApi);
					
					ВнешняяСистемаОбъект = Выборка.Ссылка.ПолучитьОбъект();
					ВнешняяСистемаОбъект.Параметры = Новый ХранилищеЗначения(ПараметрыВнешнейСистемы);
					
					ВнешняяСистемаОбъект.Записать();
					
				Иначе
					ЗаписьЖурналаРегистрации(
						"ОбновлениеПараметровВнешнихСистемWhatsApp",
						УровеньЖурналаРегистрации.Ошибка,
						Метаданные.Справочники.ВнешниеСистемы,
						Выборка.Ссылка,
						НСтр("ru = 'Не удалось получить данные для обновления внешней системы WhatsApp.'")
					);
				КонецЕсли;
				
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ЗаписьЖурналаРегистрации(
					"ОбновлениеПараметровВнешнихСистемWhatsApp",
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Справочники.ВнешниеСистемы,
					Выборка.Ссылка,
					НСтр("ru = 'Не удалось обновить параметры внешней системы WhatsApp. Текст ошибки: '") + ОписаниеОшибки
				);
				
			КонецПопытки;
				
		КонецЕсли;
		
	КонецЦикла;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Обновить библиотеку ответов
//
Процедура ОбновитьБиблиотекуОтветов() Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если НЕ ОбщегоНазначенияСтоматология.ИспользуетсяРасширение("Мессенджер") Тогда 
		Возврат;
	КонецЕсли;
	
	// РасширениеМессенджера = ПолучитьРасширениеМесседжера();
	//	
	// Если РасширениеМессенджера = Неопределено Тогда
	//	// Расширение мессенджера не установлено, обновление не требуется.
	//	Возврат;
	// КонецЕсли;
	//
	// ДанныеРасширения = ПолучитьОбщийМакет(Метаданные.ОбщиеМакеты.РасширениеМессенджера);
	// МетаданныеПоставляемогоРасширения = Новый ОбъектМетаданныхКонфигурация(ДанныеРасширения);
	//
	// Если ТребуетсяОбновлениеПоставляемогоРасширения(РасширениеМессенджера, МетаданныеПоставляемогоРасширения) = Истина Тогда
	//	// Обновление месседжера выше не произведено. Отменяем обновление данных.
	//	Возврат;
	// КонецЕсли;
	
	Справочники.ВариантыОтветов.ОбновитьБиблиотекуОтветов();
	
КонецПроцедуры

// Процедура - Перенести общие настройки оповещений в триггерную систему
//
Процедура ПеренестиОбщиеНастройкиОповещенийВТриггернуюСистему() Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ТаблицаСервисовSMS = Справочники.СтруктурныеЕдиницы.ПолучитьТаблицуСервисовРассылокДляСтруктурныхЕдиниц();	
	
	// Актуализируем триггерное событие для информирования об окончании страхового полиса
	Справочники.ТриггерныеСобытия.ИнициализироватьТриггерноеСобытие_ПациентОкончаниеСрокаДействияСтраховогоПолиса(ТаблицаСервисовSMS);
	
	// Актуализируем триггерное событие для информирования пациента о подтверждении он-лайн записи
	Справочники.ТриггерныеСобытия.ИнициализироватьТриггерноеСобытие_ЗаписьСменаСтатусаСотрудникомКлиники(ТаблицаСервисовSMS);
	
	// Актуализируем триггерное событие "ЗаписьНачалоПриема" для напоминания пациентам о записи (константа отключается внутри)
	Справочники.ТриггерныеСобытия.ИнициализироватьТриггерноеСобытие_ЗаписьНачалоПриема(ТаблицаСервисовSMS);
	
	// Актуализируем триггерные события для работы с ЛС
	Справочники.ТриггерныеСобытия.ИнициализироватьТриггерноеСобытие_ЛицевойСчетВзнос(ТаблицаСервисовSMS);
	Справочники.ТриггерныеСобытия.ИнициализироватьТриггерноеСобытие_ЛицевойСчетСписание(ТаблицаСервисовSMS);
	
	//// Актуализируем триггерное событие "День рождения клиента" (константа отключается внутри)
	// Справочники.ТриггерныеСобытия.ИнициализироватьТриггерноеСобытие_КлиентДеньРождения(ТаблицаСервисовSMS);
	
КонецПроцедуры

// Процедура, заполняет ресурс "ИдПоследнегоДиалога" в регистре сведений "КонтактыМессенджеров".
//
Процедура ЗаполнениеИдентификаторовПоследнихДиалогов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(Диалоги.Начало) КАК Начало,
	|	Диалоги.ИдКлиента КАК ИдКлиента,
	|	Диалоги.ВнешняяСистема КАК ВнешняяСистема
	|ПОМЕСТИТЬ ДатыПоследнихДиалогов
	|ИЗ
	|	РегистрСведений.Диалоги КАК Диалоги
	|ГДЕ
	|	НЕ Диалоги.ВнешняяСистема.ПометкаУдаления
	|	И Диалоги.ВнешняяСистема.Используется
	|
	|СГРУППИРОВАТЬ ПО
	|	Диалоги.ИдКлиента,
	|	Диалоги.ВнешняяСистема
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(Диалоги.ИдДиалога) КАК ИдДиалога,
	|	ДатыПоследнихДиалогов.ИдКлиента КАК ИдКлиента,
	|	ДатыПоследнихДиалогов.ВнешняяСистема КАК ВнешняяСистема
	|ИЗ
	|	РегистрСведений.Диалоги КАК Диалоги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыПоследнихДиалогов КАК ДатыПоследнихДиалогов
	|		ПО Диалоги.ИдКлиента = ДатыПоследнихДиалогов.ИдКлиента
	|			И Диалоги.ВнешняяСистема = ДатыПоследнихДиалогов.ВнешняяСистема
	|			И Диалоги.Начало = ДатыПоследнихДиалогов.Начало
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыПоследнихДиалогов.ИдКлиента,
	|	ДатыПоследнихДиалогов.ВнешняяСистема");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.КонтактыМессенджеров.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Идентификатор = Выборка.ИдКлиента;
		МенеджерЗаписи.ВнешняяСистема = Выборка.ВнешняяСистема;
		
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			
			МенеджерЗаписи.ИдПоследнегоДиалога = Выборка.ИдДиалога;
			Попытка
				МенеджерЗаписи.Записать();
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура, заполняет дополнительные поля в регистре сведений "Диалоги".
//
Процедура ЗаполнениеДополнительныхПолейДетализацииЧатов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(Диалоги.Начало) КАК Начало,
	|	Диалоги.ИдКлиента КАК ИдКлиента,
	|	Диалоги.ВнешняяСистема КАК ВнешняяСистема
	|ПОМЕСТИТЬ ДатыПоследнихДиалогов
	|ИЗ
	|	РегистрСведений.Диалоги КАК Диалоги
	|ГДЕ
	|	НЕ Диалоги.ВнешняяСистема.ПометкаУдаления
	|	И Диалоги.ВнешняяСистема.Используется
	|
	|СГРУППИРОВАТЬ ПО
	|	Диалоги.ИдКлиента,
	|	Диалоги.ВнешняяСистема
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(Диалоги.ИдДиалога) КАК ИдДиалога,
	|	ДатыПоследнихДиалогов.ИдКлиента КАК ИдКлиента,
	|	ДатыПоследнихДиалогов.ВнешняяСистема КАК ВнешняяСистема
	|ПОМЕСТИТЬ ИдентификаторыПоследнихДиалогов
	|ИЗ
	|	РегистрСведений.Диалоги КАК Диалоги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыПоследнихДиалогов КАК ДатыПоследнихДиалогов
	|		ПО Диалоги.ИдКлиента = ДатыПоследнихДиалогов.ИдКлиента
	|			И Диалоги.ВнешняяСистема = ДатыПоследнихДиалогов.ВнешняяСистема
	|			И Диалоги.Начало = ДатыПоследнихДиалогов.Начало
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыПоследнихДиалогов.ИдКлиента,
	|	ДатыПоследнихДиалогов.ВнешняяСистема
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЖурналСообщений.ИдДиалога КАК ИдДиалога,
	|	ЖурналСообщений.СлужебноеСообщение,
	|	ЖурналСообщений.ОператорСообщения,
	|	ЖурналСообщений.Период КАК Период,
	|	ЖурналСообщений.СообщениеОтКлиента КАК СообщениеОтКлиента
	|ИЗ
	|	ИдентификаторыПоследнихДиалогов КАК ИдентификаторыПоследнихДиалогов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналСообщений КАК ЖурналСообщений
	|		ПО ИдентификаторыПоследнихДиалогов.ИдДиалога = ЖурналСообщений.ИдДиалога
	|ГДЕ
	|	НЕ ЖурналСообщений.ОжиданиеСообщения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|ИТОГИ ПО
	|	ИдДиалога");
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи			 = РегистрыСведений.Диалоги.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИдДиалога = Выборка.ИдДиалога;
		
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			
			ВыборкаПоДиалогу = Выборка.Выбрать();
			
			ДанныеИзменены = Ложь;
			ПервоеСообщение = Истина;
			
			ИнициированКлиентом			 = Ложь;
			ПоследнееСообщениеОтКлиента	 = Ложь;
			ДатаПоследнегоСообщения		 = Дата(1, 1, 1);
			КоличествоСообщений			 = 0;
			ВремяДоПервогоОтвета		 = Дата(1, 1, 1);
			ОбщееВремяОтветов			 = Дата(1, 1, 1);
			МаксимальноеВремяОтвета		 = Дата(1, 1, 1);
			КоличествоОтветов			 = 0;
			ДатаНачальногоСообщенияСерии = Дата(1, 1, 1);
			
			Пока ВыборкаПоДиалогу.Следующий() Цикл
				
				Если ПервоеСообщение Тогда
					
					ИнициированКлиентом = ?(
						ВыборкаПоДиалогу.СлужебноеСообщение,
						Не ЗначениеЗаполнено(ВыборкаПоДиалогу.ОператорСообщения),
						ВыборкаПоДиалогу.СообщениеОтКлиента
					);
					ПервоеСообщение = Ложь;
					
				КонецЕсли;
				
				Если ВыборкаПоДиалогу.СлужебноеСообщение Тогда
					Продолжить;
					
				ИначеЕсли Не ДанныеИзменены Тогда
					ДанныеИзменены = Истина;
					
				КонецЕсли;
				
				ЭтоОтвет = ПоследнееСообщениеОтКлиента И Не ВыборкаПоДиалогу.СообщениеОтКлиента;
				
				Если ЭтоОтвет Тогда
					
					ВремяОтвета		 = ВыборкаПоДиалогу.Период - ДатаНачальногоСообщенияСерии;
					ВремяОтветаДатой = Дата(1, 1, 1) + ВремяОтвета;
					
					ВремяДоПервогоОтвета	 = ?(ИнициированКлиентом И Не ЗначениеЗаполнено(ВремяДоПервогоОтвета), ВремяОтветаДатой, ВремяДоПервогоОтвета);
					КоличествоОтветов		 = КоличествоОтветов + 1;
					ОбщееВремяОтветов		 = ОбщееВремяОтветов + ВремяОтвета;
					МаксимальноеВремяОтвета	 = ?(ВремяОтветаДатой > МаксимальноеВремяОтвета, ВремяОтветаДатой, МаксимальноеВремяОтвета);
					
				КонецЕсли;
				
				ПоследнееСообщениеОтКлиента	 = ВыборкаПоДиалогу.СообщениеОтКлиента;
				ДатаПоследнегоСообщения		 = ВыборкаПоДиалогу.Период;
				КоличествоСообщений			 = КоличествоСообщений + 1;
			
				ДатаНачальногоСообщенияСерии = ?(
					ВыборкаПоДиалогу.СообщениеОтКлиента,
					?(ЗначениеЗаполнено(ДатаНачальногоСообщенияСерии), ДатаНачальногоСообщенияСерии, ВыборкаПоДиалогу.Период),
					Дата(1, 1, 1)
				);
				
			КонецЦикла;
			
			Если ДанныеИзменены Тогда
				
				МенеджерЗаписи.ИнициированКлиентом			 = ИнициированКлиентом;
				МенеджерЗаписи.ПоследнееСообщениеОтКлиента	 = ПоследнееСообщениеОтКлиента;
				МенеджерЗаписи.ДатаПоследнегоСообщения		 = ДатаПоследнегоСообщения;
				МенеджерЗаписи.КоличествоСообщений			 = КоличествоСообщений;
				МенеджерЗаписи.ВремяДоПервогоОтвета			 = ВремяДоПервогоОтвета;
				МенеджерЗаписи.ОбщееВремяОтветов			 = ОбщееВремяОтветов;
				МенеджерЗаписи.МаксимальноеВремяОтвета		 = МаксимальноеВремяОтвета;
				МенеджерЗаписи.КоличествоОтветов			 = КоличествоОтветов;
				МенеджерЗаписи.ДатаНачальногоСообщенияСерии	 = ДатаНачальногоСообщенияСерии;
				
				Попытка
					МенеджерЗаписи.Записать();
				Исключение
					ОписаниеОшибки = ОписаниеОшибки();
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Перенести статусы контрагентов на новый регистр
//
Процедура ПеренестиСтатусыКонтрагентовНаНовыйРегистр(Параметры = Неопределено) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина); 
	
	#Область ПерезаполнениеСтруктурныхЕдиницКлиентов
	
	СтруктурныеЕдиницы = Справочники.СтруктурныеЕдиницы.ВернутьМассивСтруктурныхЕдиниц(); 
	
	Если ЗначениеЗаполнено(СтруктурныеЕдиницы) И СтруктурныеЕдиницы.Количество() > 0 Тогда
		
		Запрос = Новый Запрос();
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Контрагент
		|ПОМЕСТИТЬ ВТКлентыСПустойСтруктурнойЕдиницей
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты)
		|	И Контрагенты.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.Пустаяссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(Прием.Дата) КАК Дата,
		|	ВТКлентыСПустойСтруктурнойЕдиницей.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ ВТПоследнийПрием
		|ИЗ
		|	ВТКлентыСПустойСтруктурнойЕдиницей КАК ВТКлентыСПустойСтруктурнойЕдиницей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Прием КАК Прием
		|		ПО ВТКлентыСПустойСтруктурнойЕдиницей.Контрагент = Прием.Контрагент
		|ГДЕ
		|	Прием.Проведен = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТКлентыСПустойСтруктурнойЕдиницей.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПоследнийПрием.Контрагент КАК Контрагент,
		|	Прием.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|ПОМЕСТИТЬ СтруктурныеЕдиницыПоследнихПриемов
		|ИЗ
		|	ВТПоследнийПрием КАК ВТПоследнийПрием
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Прием КАК Прием
		|		ПО ВТПоследнийПрием.Контрагент = Прием.Контрагент
		|			И ВТПоследнийПрием.Дата = Прием.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТКлентыСПустойСтруктурнойЕдиницей.Контрагент КАК Контрагент,
		|	ВЫБОР
		|		КОГДА СтруктурныеЕдиницыПоследнихПриемов.СтруктурнаяЕдиница ЕСТЬ NULL
		|			ТОГДА &СтруктурнаяЕдиницаПоУмолчанию
		|		ИНАЧЕ СтруктурныеЕдиницыПоследнихПриемов.СтруктурнаяЕдиница
		|	КОНЕЦ КАК СтруктурнаяЕдиница
		|ИЗ
		|	ВТКлентыСПустойСтруктурнойЕдиницей КАК ВТКлентыСПустойСтруктурнойЕдиницей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтруктурныеЕдиницыПоследнихПриемов КАК СтруктурныеЕдиницыПоследнихПриемов
		|		ПО ВТКлентыСПустойСтруктурнойЕдиницей.Контрагент = СтруктурныеЕдиницыПоследнихПриемов.Контрагент";
		
		
		Запрос.УстановитьПараметр("СтруктурнаяЕдиницаПоУмолчанию", СтруктурныеЕдиницы[0]);
		
		Выборка = Запрос.Выполнить().Выбрать(); 
		
		Пока Выборка.Следующий() Цикл 	
			
			Попытка
				ОбъектКонтрагент = Выборка.Контрагент.ПолучитьОбъект();	
				ОбъектКонтрагент.СтруктурнаяЕдиница = Выборка.СтруктурнаяЕдиница;	
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектКонтрагент);
			Исключение
				
			КонецПопытки; 
			
		КонецЦикла;
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ПотенциальныеКлиенты
	
	// Заполним потенциальных клиентов
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	Контрагенты.ДатаРегистрации КАК ДатаРегистрации
	|ПОМЕСТИТЬ КонтрагентыСДатойРегистрации
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ДатаРегистрации <> ДАТАВРЕМЯ(1, 1, 1)
	|	И Контрагенты.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Обсуждения.Объект КАК Справочник.Контрагенты) КАК Контрагент,
	|	МИНИМУМ(Обсуждения.МоментВремени) КАК Дата
	|ИЗ
	|	РегистрСведений.Обсуждения КАК Обсуждения
	|ГДЕ
	|	Обсуждения.Объект ССЫЛКА Справочник.Контрагенты
	|	И НЕ Обсуждения.Объект В
	|				(ВЫБРАТЬ
	|					КонтрагентыСДатойРегистрации.Контрагент КАК Контрагент
	|				ИЗ
	|					КонтрагентыСДатойРегистрации КАК КонтрагентыСДатойРегистрации)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(Обсуждения.Объект КАК Справочник.Контрагенты)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтрагентыСДатойРегистрации.Контрагент,
	|	КонтрагентыСДатойРегистрации.ДатаРегистрации
	|ИЗ
	|	КонтрагентыСДатойРегистрации КАК КонтрагентыСДатойРегистрации";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Попытка 	
		
		Пока Выборка.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.СтатусыКонтрагентов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Контрагент.Установить(Выборка.Контрагент);
			НаборЗаписей.Отбор.Период.Установить(Выборка.Дата);
			
			ЗаписьНабора = НаборЗаписей.Добавить();
			
			ЗаписьНабора.Контрагент = Выборка.Контрагент;
			ЗаписьНабора.Период 	= Выборка.Дата;
			ЗаписьНабора.Статус 	= Перечисления.СтатусыКонтрагентов.Потенциальный;
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина);
			
		КонецЦикла;	
		
	Исключение
		
	КонецПопытки; 
	
	#КонецОбласти  
	
	#Область НовыеНеВернувшиесяИПостоянныеКонтрагенты 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Прием.Контрагент КАК Контрагент,
	|	Прием.Дата КАК Дата
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Проведен = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	Прием.Контрагент,
	|	Прием.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Дата)
	|ПО
	|	Контрагент";
	
	ДниПоискаНеВернувшихсяКлиентов = Константы.ПериодПоискаНеВернувшихсяКлиентов.Получить(); 
	
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Пока ВыборкаИтоги.Следующий() Цикл
		
		ДатаПредыдущегоПриема 			= Дата(1,1,1);
		ДатаСтатусаНеВернувшийся 		= Дата(1,1,1); 
		ПоследнийСтатусКонтрагента 		= Неопределено; 
		
		Контрагент = ВыборкаИтоги.Контрагент;
		
		Выборка = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.Прямой);
		
		Пока Выборка.Следующий() Цикл
			
			// Статус НОВЫЙ.
			Если ДатаПредыдущегоПриема = Дата(1,1,1) Или ДатаПредыдущегоПриема = Выборка.Дата Тогда // Это первый прием.
				
				Попытка
					
					НаборЗаписей = РегистрыСведений.СтатусыКонтрагентов.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Контрагент.Установить(Контрагент); 
					НаборЗаписей.Отбор.Период.Установить(Выборка.Дата); 
					
					ЗаписьНабора = НаборЗаписей.Добавить();
					ЗаписьНабора.Контрагент = Контрагент;
					ЗаписьНабора.Период 	= Выборка.Дата;
					ЗаписьНабора.Статус 	= Перечисления.СтатусыКонтрагентов.Первичный;
					
					ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина);
					
				Исключение 
					
				КонецПопытки;
				
				ПоследнийСтатусКонтрагента = Перечисления.СтатусыКонтрагентов.Первичный;
				
				// Статус ПОСТОЯННЫЙ.		
			ИначеЕсли ПоследнийСтатусКонтрагента <> Перечисления.СтатусыКонтрагентов.Постоянный Тогда
				
				Попытка
					
					НаборЗаписей = РегистрыСведений.СтатусыКонтрагентов.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Контрагент.Установить(Контрагент);
					НаборЗаписей.Отбор.Период.Установить(Выборка.Дата);
					
					ЗаписьНабора = НаборЗаписей.Добавить();
					
					ЗаписьНабора.Контрагент = Контрагент;
					ЗаписьНабора.Период 	= Выборка.Дата;
					ЗаписьНабора.Статус 	= Перечисления.СтатусыКонтрагентов.Постоянный;
					
					ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина);
					
				Исключение 
					
				КонецПопытки;
				
				ПоследнийСтатусКонтрагента = Перечисления.СтатусыКонтрагентов.Постоянный;
				
			КонецЕсли;
			
			КоличествоДнейМеждуПриемами = (НачалоДня(Выборка.Дата) - НачалоДня(ДатаПредыдущегоПриема))/(60*60*24);
			КоличествоДнейМеждуПриемами = ?(КоличествоДнейМеждуПриемами >= 0, КоличествоДнейМеждуПриемами, -КоличествоДнейМеждуПриемами); 
			
			// Статус НЕВЕРНУВШИЙСЯ.
			Если ДатаПредыдущегоПриема <> Дата(1,1,1) 
				И КоличествоДнейМеждуПриемами >= ДниПоискаНеВернувшихсяКлиентов Тогда
				
				ДатаСтатусаНеВернувшийся = КонецДня(ДатаПредыдущегоПриема + ДниПоискаНеВернувшихсяКлиентов *60*60*24) + 1;
				
				Попытка
					
					НаборЗаписей = РегистрыСведений.СтатусыКонтрагентов.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Контрагент.Установить(Контрагент);
					НаборЗаписей.Отбор.Период.Установить(ДатаСтатусаНеВернувшийся);
					
					ЗаписьНабора = НаборЗаписей.Добавить();
					
					ЗаписьНабора.Контрагент = Контрагент;
					ЗаписьНабора.Период 	= ДатаСтатусаНеВернувшийся;
					ЗаписьНабора.Статус 	= Перечисления.СтатусыКонтрагентов.НеВернувшийся;
					
					ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина);	
					
				Исключение
					
				КонецПопытки; 
				
				ПоследнийСтатусКонтрагента	= Перечисления.СтатусыКонтрагентов.НеВернувшийся;
				
			КонецЕсли;
			
			ДатаПредыдущегоПриема 			= Выборка.Дата; 
			
		КонецЦикла;
		
		// Сравним с текущей датой. И Проставим статус "НЕВУРНУВШИЙСЯ" 
		Если ДатаСтатусаНеВернувшийся < ДатаПредыдущегоПриема Тогда	// После установленного статуса был еще прием или были приемы и еще статус не вернувшегося не установлен.  
			
			КоличествоДнейПослеПоследнегоПриема = (НачалоДня(ТекущаяДатаСеанса()) - НачалоДня(ДатаПредыдущегоПриема))/(60*60*24); 
			КоличествоДнейПослеПоследнегоПриема = ?(КоличествоДнейПослеПоследнегоПриема >= 0, КоличествоДнейПослеПоследнегоПриема, -КоличествоДнейПослеПоследнегоПриема);
			
			Если КоличествоДнейПослеПоследнегоПриема >= ДниПоискаНеВернувшихсяКлиентов Тогда
				
				ДатаСтатусаНеВернувшийся = КонецДня(ДатаПредыдущегоПриема + ДниПоискаНеВернувшихсяКлиентов *60*60*24) + 1;
				
				Попытка 
					НаборЗаписей = РегистрыСведений.СтатусыКонтрагентов.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Контрагент.Установить(Контрагент);
					НаборЗаписей.Отбор.Период.Установить (ДатаСтатусаНеВернувшийся);  					
					ЗаписьНабора = НаборЗаписей.Добавить();
					
					ЗаписьНабора.Контрагент = Контрагент;
					ЗаписьНабора.Период 	= ДатаСтатусаНеВернувшийся;
					ЗаписьНабора.Статус 	= Перечисления.СтатусыКонтрагентов.НеВернувшийся;
					
					ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина);
				Исключение
					
				КонецПопытки
				
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	#КонецОбласти 
	
	#Область КонтрагентыСОтказом
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусыКонтрагентов.Контрагент КАК Контрагент,
	|	МИНИМУМ(СтатусыКонтрагентов.Период) КАК Период
	|ПОМЕСТИТЬ ВТКонтрагентыБезПотенциальныхИОтказов
	|ИЗ
	|	РегистрСведений.СтатусыКонтрагентов КАК СтатусыКонтрагентов
	|ГДЕ
	|	НЕ СтатусыКонтрагентов.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Потенциальный), ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Отказ))
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусыКонтрагентов.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сделки.Контрагент КАК Контрагент,
	|	Сделки.ДатаЗавершенияСделки КАК ДатаЗавершенияСделки
	|ПОМЕСТИТЬ СделкиСОтказом
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.ПометкаУдаления = ЛОЖЬ
	|	И Сделки.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.Отказ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкиСОтказом.Контрагент КАК Контрагент,
	|	МАКСИМУМ(СделкиСОтказом.ДатаЗавершенияСделки) КАК ДатаЗавершенияСделки
	|ПОМЕСТИТЬ ВТОтказыСПоследующимиДругимиСтатусами
	|ИЗ
	|	СделкиСОтказом КАК СделкиСОтказом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКонтрагентыБезПотенциальныхИОтказов КАК ВТКонтрагентыБезПотенциальныхИОтказов
	|		ПО СделкиСОтказом.Контрагент = ВТКонтрагентыБезПотенциальныхИОтказов.Контрагент
	|			И СделкиСОтказом.ДатаЗавершенияСделки < ВТКонтрагентыБезПотенциальныхИОтказов.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	СделкиСОтказом.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкиСОтказом.Контрагент КАК Контрагент,
	|	МАКСИМУМ(СделкиСОтказом.ДатаЗавершенияСделки) КАК Дата
	|ИЗ
	|	СделкиСОтказом КАК СделкиСОтказом
	|ГДЕ
	|	НЕ СделкиСОтказом.Контрагент В
	|				(ВЫБРАТЬ
	|					ВТКонтрагентыБезПотенциальныхИОтказов.Контрагент КАК Контрагент
	|				ИЗ
	|					ВТКонтрагентыБезПотенциальныхИОтказов КАК ВТКонтрагентыБезПотенциальныхИОтказов)
	|
	|СГРУППИРОВАТЬ ПО
	|	СделкиСОтказом.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТОтказыСПоследующимиДругимиСтатусами.Контрагент,
	|	ВТОтказыСПоследующимиДругимиСтатусами.ДатаЗавершенияСделки
	|ИЗ
	|	ВТОтказыСПоследующимиДругимиСтатусами КАК ВТОтказыСПоследующимиДругимиСтатусами";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			НаборЗаписей = РегистрыСведений.СтатусыКонтрагентов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Контрагент.Установить(Выборка.Контрагент); 
			НаборЗаписей.Отбор.Период.Установить(Выборка.Дата);
			
			ЗаписьНабора = НаборЗаписей.Добавить();
			
			ЗаписьНабора.Контрагент = Выборка.Контрагент;
			ЗаписьНабора.Период 	= Выборка.Дата;
			ЗаписьНабора.Статус 	= Перечисления.СтатусыКонтрагентов.Отказ;
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина);
			
		Исключение 
			
		КонецПопытки;
		
	КонецЦикла;
	
	#КонецОбласти 	
	
КонецПроцедуры

// Процедура - Исправить сохраненный HTML код мед карты ортодонтического пациента.
//
Процедура ИсправитьСохраненныйHTMLКодМедКартыОртодонтическогоПациента() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МедицинскиеКарты.Ссылка КАК Ссылка,
	|	МедицинскиеКарты.ПечатнаяФорма КАК ПечатнаяФорма
	|ИЗ
	|	Справочник.МедицинскиеКарты КАК МедицинскиеКарты
	|ГДЕ
	|	НЕ МедицинскиеКарты.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПолеТекстHTML = ВыборкаДетальныеЗаписи.ПечатнаяФорма.Получить();
		
		Если ТипЗнч(ПолеТекстHTML) = Тип("Строка") И ЗначениеЗаполнено(ПолеТекстHTML) Тогда

			ОшибкиИсправлены = Ложь;
			
			// Должна быть только одна ячейка с зубом №47.
			ПозицияДублирующейЯчейки47 = СтрНайти(ПолеТекстHTML, "<td><b>47</b></td>",,, 2);	
			Если НЕ ПозицияДублирующейЯчейки47 = 0 Тогда
				
				ЛеваяЧасть = Сред(ПолеТекстHTML, 1, ПозицияДублирующейЯчейки47 - 1); 
				ПолеТекстHTML = ЛеваяЧасть + "<td><b>46</b></td>" + Сред(ПолеТекстHTML, ПозицияДублирующейЯчейки47 + 18);		
				
				// Если выше верхней челюсти два блока "- положения *".
				ПозицияЯчейкиСПоложением = СтрНайти(ПолеТекстHTML, "<td>- положения *</td>",,, 2);
				Если ПозицияЯчейкиСПоложением < ПозицияДублирующейЯчейки47 Тогда
					
					ЛеваяЧасть = Сред(ПолеТекстHTML, 1, ПозицияЯчейкиСПоложением - 1); 
					ПолеТекстHTML = ЛеваяЧасть + "<td>- сроков прорез. **</td>" + Сред(ПолеТекстHTML, ПозицияЯчейкиСПоложением + 22);		
					
				КонецЕсли;
				
				ОшибкиИсправлены = Истина;
				
			КонецЕсли;
			
			Если ОшибкиИсправлены Тогда
				
				МедКартаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				
				МедКартаОбъект.ПечатнаяФорма = Новый ХранилищеЗначения(ПолеТекстHTML);
				
				Попытка 
					МедКартаОбъект.Записать();
				Исключение
					ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Исправление реквизита ""ПечатнаяФорма"" в мед. картах."
					, УровеньЖурналаРегистрации.Ошибка,,
					, ОписаниеОшибки());					
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;	

КонецПроцедуры

// Процедура - Заполнить результат приема в триггерных событиях
//
Процедура ЗаполнитьРезультатПриемаВТриггерныхСобытиях() Экспорт

	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТриггерныеСобытия.Ссылка КАК Триггер,
	|	ТриггерныеСобытия.УсловиеСобытия КАК УсловиеСобытия,
	|	ТриггерныеСобытия.РезультатПриема КАК РезультатПриема,
	|	ТриггерныеСобытия.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ТриггерныеСобытия КАК ТриггерныеСобытия
	|ГДЕ
	|	ТриггерныеСобытия.ЭтоГруппа = ЛОЖЬ
	|	И ТриггерныеСобытия.УсловиеСобытия В (ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ПриемЗавершен), ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ПриемЗавершенПродолжаетЛечение))";
	
	ТаблицаТриггерныхСобытий = Запрос.Выполнить().Выгрузить();
	
	МетаданныеСправочника = Метаданные.Справочники.ТриггерныеСобытия;		
	
	Для Каждого СтрокаТаблицы Из ТаблицаТриггерныхСобытий Цикл
		Триггер_Объект = Неопределено;
		Если СтрокаТаблицы.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершенПродолжаетЛечение Тогда 
			Триггер_Объект 					= СтрокаТаблицы.Триггер.ПолучитьОбъект();
		    Триггер_Объект.УсловиеСобытия 	= Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершен;
			Триггер_Объект.РезультатПриема 	= 2;
		ИначеЕсли СтрокаТаблицы.РезультатПриема = 0 Тогда 
			Триггер_Объект 					= СтрокаТаблицы.Триггер.ПолучитьОбъект();
			Триггер_Объект.РезультатПриема 	= 1;
		КонецЕсли;
		Если НЕ Триггер_Объект = Неопределено Тогда
			Попытка
				// Сохраняем триггер
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Триггер_Объект);
			Исключение
				ШаблонКомментария = НСтр("ru = 'Не удалось заполнить результат приёма в триггерном событие ""%1"" 
				|по причине: %2'");
				
				Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																					, СтрокаТаблицы.Наименование
																					, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				МетаданныеСправочника,,
				Комментарий);
			КонецПопытки;	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Инициализация стандартного набора триггеров
//
// Параметры:
//  ТаблицаСервисовSMS	 - 	 - 
//
Процедура ИнициализацияСтандартногоНабораТриггеров(ТаблицаСервисовSMS = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	МассивДанныхТриггеров = Новый Массив;
	
	МассивДанныхТриггеров.Добавить(Новый Структура("НаименованиеТриггера, ЗаголовокШаблона, УсловиеСобытия, МоментСобытия, ПериодСобытия, ПериодСобытияВид, ВремяСобытия, НаименованиеСегмента"
	, "Уведомление о записи на прием"	
	, "Создание предварительной записи"
	, Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСозданиеЗаписиНаПрием
	, Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия
	, 1
	, Перечисления.Периодичность.День
	, Дата('0001.01.01 12:00:00')
	, ""));

	МассивДанныхТриггеров.Добавить(Новый Структура("НаименованиеТриггера, ЗаголовокШаблона, УсловиеСобытия, МоментСобытия, ПериодСобытия, ПериодСобытияВид, ВремяСобытия, НаименованиеСегмента"
	, "Напоминание о записи за 2 часа"	
	, "Напоминание о записи за 2 часа"
	, Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема
	, Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия
	, 2
	, Перечисления.Периодичность.Час
	, Дата('0001.01.01 12:00:00')
	, ""));	
	
	МассивДанныхТриггеров.Добавить(Новый Структура("НаименованиеТриггера, ЗаголовокШаблона, УсловиеСобытия, МоментСобытия, ПериодСобытия, ПериодСобытияВид, ВремяСобытия, НаименованиеСегмента"
	, "Самочувствие после операции"	
	, "Как ваше самочувствие после операции?"
	, Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершен
	, Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия
	, 1
	, Перечисления.Периодичность.День
	, Дата('0001.01.01 12:00:00')
	, "Услуги удаления и имплантации (A16.07.054, A16.07.001, A16.07.024)"));		
	
	// Инициализируем таблицу внешних систем
	Если НЕ ЗначениеЗаполнено(ТаблицаСервисовSMS) Тогда 
		ТаблицаСервисовSMS = Справочники.СтруктурныеЕдиницы.ПолучитьТаблицуСервисовРассылокДляСтруктурныхЕдиниц();	
	КонецЕсли;	
	АктивностьТриггера = ЗначениеЗаполнено(ТаблицаСервисовSMS);

	Для Каждого ЭлементКоллекции Из МассивДанныхТриггеров Цикл 
		
		// Инициализируем сегмент услуг
		СегментУслуг 	= Справочники.СегментыНоменклатуры.ИнициализироватьСегментНоменклатуры(ЭлементКоллекции.НаименованиеСегмента);
		// Инициализируем шаблон рекомендаций
		ШаблонСообщения = Справочники.ШаблоныСообщений.ИнициализироватьШаблонСообщения(ЭлементКоллекции.ЗаголовокШаблона);
		
		Если НЕ ЗначениеЗаполнено(ШаблонСообщения) Тогда 
			Продолжить;
		КонецЕсли;
		
		ПараметрыТриггерногоСобытия = Новый Структура;
		ПараметрыТриггерногоСобытия.Вставить("Наименование" 	, ЭлементКоллекции.НаименованиеТриггера);
		ПараметрыТриггерногоСобытия.Вставить("Активно"			, АктивностьТриггера);
		ПараметрыТриггерногоСобытия.Вставить("УсловиеСобытия"	, ЭлементКоллекции.УсловиеСобытия);
		ПараметрыТриггерногоСобытия.Вставить("МоментСобытия"	, ЭлементКоллекции.МоментСобытия);
		ПараметрыТриггерногоСобытия.Вставить("ПериодСобытия"	, ЭлементКоллекции.ПериодСобытия);
		ПараметрыТриггерногоСобытия.Вставить("ПериодСобытияВид"	, ЭлементКоллекции.ПериодСобытияВид);
		ПараметрыТриггерногоСобытия.Вставить("ВремяСобытия"		, ЭлементКоллекции.ВремяСобытия);
		ПараметрыТриггерногоСобытия.Вставить("СегментУслуг"		, СегментУслуг);
		ПараметрыТриггерногоСобытия.Вставить("ПараметрыДействия"
		, Новый Структура("Использование, ВидДействия, ВидАдресата, ШаблонСообщения, Описание"
		, Истина, Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение, Перечисления.ВидыАдресатов.КонтрагентСобытия, ШаблонСообщения, НСтр("ru = 'Отправить пациенту сообщение';en= 'Send a message to the patient'")));
		
		ТриггерноеСобытие = Справочники.ТриггерныеСобытия.ИнициализироватьТриггерноеСобытие(ПараметрыТриггерногоСобытия, Истина, ТаблицаСервисовSMS);
		
	КонецЦикла;
	
	
КонецПроцедуры

// Процедура - Инициализировать механизм рекомендаций
//
Процедура ИнициализироватьМеханизмРекомендаций(ТаблицаСервисовSMS = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	МассивРекомендаций = Новый Массив;
	
	МассивРекомендаций.Добавить(Новый Структура("НаименованиеТриггера, ЗаголовокРекомендации, УсловиеСобытия, МоментСобытия, НаименованиеСегмента"
	, "Рекомендации после установки временной пломбы"	
	, "Рекомендации после установки временной пломбы"
	, Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершен, Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия
	, "Услуги установки временной пломбы (A16.07.002.009)"));
	
	МассивРекомендаций.Добавить(Новый Структура("НаименованиеТриггера, ЗаголовокРекомендации, УсловиеСобытия, МоментСобытия, НаименованиеСегмента"
	, "Рекомендации после установки постоянной пломбы"	
	, "Рекомендации после установки постоянной пломбы"
	, Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершен, Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия
	, "Услуги установки постоянной пломбы (A16.07.002.001 - A16.07.002.012)"));
	
	МассивРекомендаций.Добавить(Новый Структура("НаименованиеТриггера, ЗаголовокРекомендации, УсловиеСобытия, МоментСобытия, НаименованиеСегмента"
	, "Рекомендации после гигиены"	
	, "Рекомендации после гигиены"
	, Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершен, Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия
	, "Услуги гигиены (A16.07.051)"));
	
	МассивРекомендаций.Добавить(Новый Структура("НаименованиеТриггера, ЗаголовокРекомендации, УсловиеСобытия, МоментСобытия, НаименованиеСегмента"
	, "Рекомендации после отбеливания"	
	, "Рекомендации после отбеливания"
	, Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершен, Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия
	, "Услуги отбеливания (A16.07.050)"));
	
	МассивРекомендаций.Добавить(Новый Структура("НаименованиеТриггера, ЗаголовокРекомендации, УсловиеСобытия, МоментСобытия, НаименованиеСегмента"
	, "Рекомендации после удаления зуба"	
	, "Рекомендации после удаления зуба"
	, Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершен, Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия
	, "Услуги удаления зуба (A16.07.001, A16.07.024)"));

	МассивРекомендаций.Добавить(Новый Структура("НаименованиеТриггера, ЗаголовокРекомендации, УсловиеСобытия, МоментСобытия, НаименованиеСегмента"
	, "Рекомендации после Синус-лифтинг"	
	, "Рекомендации после Синус-лифтинг"
	, Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершен, Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия
	, "Услуги Синус-лифтинг (A16.07.055)"));
	
	МассивРекомендаций.Добавить(Новый Структура("НаименованиеТриггера, ЗаголовокРекомендации, УсловиеСобытия, МоментСобытия, НаименованиеСегмента"
	, "Рекомендация после имплантации"	
	, "Рекомендация после имплантации"
	, Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершен, Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия
	, "Услуги имплантации (A16.07.054)"));
	
	МассивРекомендаций.Добавить(Новый Структура("НаименованиеТриггера, ЗаголовокРекомендации, УсловиеСобытия, МоментСобытия, НаименованиеСегмента"
	, "Рекомендации по уходу за брекет системой"	
	, "Рекомендации по уходу за брекет системой"
	, Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершен, Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия
	, "Услуги установки брекет системы (А16.07.048)"));

	МассивРекомендаций.Добавить(Новый Структура("НаименованиеТриггера, ЗаголовокРекомендации, УсловиеСобытия, МоментСобытия, НаименованиеСегмента"
	, "Рекомендации по уходу за элайнерами"	
	, "Рекомендации по уходу за элайнерами"
	, Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершен, Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия
	, "Услуги установки элайнеров (А16.07.028, А16.07.048)"));	
	
	// Инициализируем таблицу внешних систем
	Если НЕ ЗначениеЗаполнено(ТаблицаСервисовSMS) Тогда 
		ТаблицаСервисовSMS = Справочники.СтруктурныеЕдиницы.ПолучитьТаблицуСервисовРассылокДляСтруктурныхЕдиниц();	
	КонецЕсли;	
	АктивностьТриггера = ЗначениеЗаполнено(ТаблицаСервисовSMS);

	Для Каждого ЭлементКоллекции Из МассивРекомендаций Цикл 
		
		// Инициализируем сегмент услуг
		СегментУслуг 	= Справочники.СегментыНоменклатуры.ИнициализироватьСегментНоменклатуры(ЭлементКоллекции.НаименованиеСегмента, "Сегменты медицинских услуг (Рекомендации)");
		// Инициализируем шаблон рекомендаций
		ШаблонСообщения = Справочники.ШаблоныСообщений.ИнициализироватьШаблонСообщения(ЭлементКоллекции.ЗаголовокРекомендации, "Рекомендации");
		
		Если НЕ ЗначениеЗаполнено(СегментУслуг) ИЛИ НЕ ЗначениеЗаполнено(ШаблонСообщения) Тогда 
			Продолжить;
		КонецЕсли;
		
		ПараметрыТриггерногоСобытия = Новый Структура;
		ПараметрыТриггерногоСобытия.Вставить("Наименование" 	, ЭлементКоллекции.НаименованиеТриггера);
		ПараметрыТриггерногоСобытия.Вставить("Активно"			, АктивностьТриггера);
		ПараметрыТриггерногоСобытия.Вставить("УсловиеСобытия"	, ЭлементКоллекции.УсловиеСобытия);
		ПараметрыТриггерногоСобытия.Вставить("МоментСобытия"	, ЭлементКоллекции.МоментСобытия);
		ПараметрыТриггерногоСобытия.Вставить("ПериодСобытия"	, 1);
		ПараметрыТриггерногоСобытия.Вставить("ПериодСобытияВид"	, Перечисления.Периодичность.День);
		ПараметрыТриггерногоСобытия.Вставить("ВремяСобытия"		, Дата('0001.01.01 10:00:00'));
		ПараметрыТриггерногоСобытия.Вставить("СегментУслуг"		, СегментУслуг);
		ПараметрыТриггерногоСобытия.Вставить("ПараметрыДействия"
		, Новый Структура("Использование, ВидДействия, ВидАдресата, ШаблонСообщения, Описание"
		, Истина, Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение, Перечисления.ВидыАдресатов.КонтрагентСобытия, ШаблонСообщения, НСтр("ru = 'Отправить пациенту сообщение';en= 'Send a message to the patient'")));
		
		ТриггерноеСобытие = Справочники.ТриггерныеСобытия.ИнициализироватьТриггерноеСобытие(ПараметрыТриггерногоСобытия, Истина, ТаблицаСервисовSMS, Истина);
		
	КонецЦикла;
	
	
КонецПроцедуры

// Процедура - Заполнить курсы лечения в приемах
//
Процедура ЗаполнитьКурсыЛеченияВПриемах(Параметры = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидСделкиНовыйПациент"		, ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты"));
	Запрос.УстановитьПараметр("ВидСделкиПостоянныйПациент"	, ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.ПостоянныеПациенты"));	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Прием.Ссылка КАК Ссылка,
		|	Прием.Дата КАК Дата,
		|	Прием.Сотрудник КАК Сотрудник,
		|	Прием.Контрагент КАК Контрагент,
		|	Прием.РезультатПриема КАК РезультатПриема,
		|	Прием.ВремяНачалаПриема КАК ВремяНачалаПриема,
		|	Прием.ВремяОкончанияПриема КАК ВремяОкончанияПриема,
		|	Прием.СтатусПациента КАК СтатусПациента,
		|	Прием.СуммаДокумента КАК СуммаДокумента,
		|	Прием.Представление КАК Представление
		|ИЗ
		|	Документ.Прием КАК Прием
		|ГДЕ
		|	Прием.Сделка <> ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
		|	И (Прием.Сделка.ВидСделки = &ВидСделкиНовыйПациент
		|			ИЛИ Прием.Сделка.ВидСделки = &ВидСделкиПостоянныйПациент)
		|	И Прием.Проведен
		|	И Прием.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	ВремяНачалаПриема,
		|	Сотрудник";

	Таблица = Запрос.Выполнить().Выгрузить();
	Таблица.Колонки.Добавить("ЗакрытьКурс", Новый ОписаниеТипов("Булево"));  
		
	Копия = Новый ТаблицаЗначений;
	Копия = Таблица.Скопировать();
	Копия.Свернуть("Контрагент");
	Для Каждого СтрокаТЧ Из Копия Цикл
			
		СоздатьНовыйКурсИЗакрытьПредыдущий = Истина;
		Контрагент = СтрокаТЧ.Контрагент;
		НайденныеСтроки = Таблица.НайтиСтроки(Новый Структура("Контрагент", Контрагент));
		НомерСтроки = 1;
		Для Каждого Строка Из НайденныеСтроки Цикл
				
			Если Строка.РезультатПриема = 1 Тогда 
				Если НайденныеСтроки.Количество() = 1 Или НомерСтроки = НайденныеСтроки.Количество() Тогда 
					Строка.ЗакрытьКурс = Истина;  
				ИначеЕсли НомерСтроки < НайденныеСтроки.Количество() 
					И ДобавитьМесяц(Строка.Дата, 1) <= НайденныеСтроки[НомерСтроки].Дата Тогда
					Строка.ЗакрытьКурс = Истина; 
				КонецЕсли;
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		
		НомерСтроки = 1;
		Для Каждого Строка Из НайденныеСтроки Цикл
			
			Попытка
				
				// 1. Создание курса лечения
				Если СоздатьНовыйКурсИЗакрытьПредыдущий = Истина Тогда
					КурсЛеченияОбъект                = Справочники.КурсыЛечения.СоздатьЭлемент();
					КурсЛеченияОбъект.Контрагент     = Контрагент; 
					КурсЛеченияОбъект.ДатаНачала     = Строка.ВремяНачалаПриема;
					КурсЛеченияОбъект.СтатусПациента = Строка.СтатусПациента; 
					СуммаКурса                       = 0;
					Попытка
						КурсЛеченияОбъект.Записать(); 
					Исключение  
						ОписаниеОшибки = "Ошибка при записи курса лечения по приему " + Строка.Представление + " " + ОписаниеОшибки();
						ЗаписьЖурналаРегистрации("ЗаполнитьКурсыЛеченияВПриемах", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
					КонецПопытки;
					
					ТаблицаЛечений = Новый ТаблицаЗначений;
					ТаблицаЛечений.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
					ТаблицаЛечений.Колонки.Добавить("Лечение"  , Новый ОписаниеТипов("СправочникСсылка.Лечения"));
					ТаблицаЛечений.Колонки.Добавить("Закрыт"   , Новый ОписаниеТипов("Булево"));  
					
				КонецЕсли; 
				
				// 2. Создать лечение по врачу
				Если ЗначениеЗаполнено(Строка.Сотрудник) Тогда 
					НайденныеСтрокиСотрудник = ТаблицаЛечений.НайтиСтроки(Новый Структура("Сотрудник", Строка.Сотрудник)); 
					Если НайденныеСтрокиСотрудник.Количество() = 0 Тогда
						
						ЛечениеВрачаОбъект               = Справочники.Лечения.СоздатьЭлемент();
						ЛечениеВрачаОбъект.ДатаНачала    = Строка.ВремяНачалаПриема; 
						ЛечениеВрачаОбъект.Контрагент    = Контрагент;
						ЛечениеВрачаОбъект.Сотрудник     = Строка.Сотрудник;
						ЛечениеВрачаОбъект.СуммаЛечения  = Строка.СуммаДокумента;     
						ЛечениеВрачаОбъект.КурсЛечения   = КурсЛеченияОбъект.Ссылка; 
						
						// Лечение закрывать, когда следующий прием больше 30 дней или следующий рием по этому сотруднику больше 30 дней?
						// Пока сделать  когда следующий прием больше 30 дней
						Если Строка.РезультатПриема = 1 Тогда 
							Если НайденныеСтроки.Количество() = 1 Или НомерСтроки = НайденныеСтроки.Количество() Тогда 
								ЛечениеВрачаОбъект.ДатаОкончания = Строка.Дата;  
							ИначеЕсли НомерСтроки < НайденныеСтроки.Количество() 
								И ДобавитьМесяц(Строка.Дата, 1) <= НайденныеСтроки[НомерСтроки].Дата Тогда
								ЛечениеВрачаОбъект.ДатаОкончания = Строка.Дата;
							КонецЕсли;
						КонецЕсли;
							
						Попытка
							ЛечениеВрачаОбъект.Записать(); 	
							ЛечениеВрача = ЛечениеВрачаОбъект.Ссылка;
							НоваяСтрока           = ТаблицаЛечений.Добавить();						
							НоваяСтрока.Сотрудник = Строка.Сотрудник;
							НоваяСтрока.Лечение   = ЛечениеВрачаОбъект.Ссылка;
							НоваяСтрока.Закрыт    = ЗначениеЗаполнено(ЛечениеВрачаОбъект.ДатаОкончания);
							
						Исключение
							ОписаниеОшибки = "Ошибка при записи лечения по приему " + Строка.Представление + " " + ОписаниеОшибки();
							ЗаписьЖурналаРегистрации("ЗаполнитьКурсыЛеченияВПриемах", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
						КонецПопытки;
						
					Иначе
						ЛечениеВрача = НайденныеСтрокиСотрудник[0].Лечение;
					КонецЕсли;
				КонецЕсли; 				
				
				// 3. Добавление курса и лечения в прием
				ПриемОбъект              = Строка.Ссылка.ПолучитьОбъект();
				ПриемОбъект.КурсЛечения  = КурсЛеченияОбъект.Ссылка;
				ПриемОбъект.ЛечениеВрача = ЛечениеВрача; 
				ПриемОбъект.ОбменДанными.Загрузка = Истина;
				Попытка
					ПриемОбъект.Записать();
				Исключение  
					ОписаниеОшибки = "Ошибка при записи приема " + Строка.Представление + " " + ОписаниеОшибки();
					ЗаписьЖурналаРегистрации("ЗаполнитьКурсыЛеченияВПриемах", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
				КонецПопытки;
				
                // 4. Закрыть курс
				Если Строка.ЗакрытьКурс = Истина Тогда
					
					Если ТаблицаЛечений.Количество() = 0 Тогда
						СоздатьНовыйКурсИЗакрытьПредыдущий = Истина; 
					Иначе
						
						НайденныеСтрокиПоСотруднику = ТаблицаЛечений.НайтиСтроки(Новый Структура("Сотрудник, Закрыт", Строка.Сотрудник, Ложь));  
						Для Каждого НайденнаяСтрока Из НайденныеСтрокиПоСотруднику Цикл
							ЛечениеОбъект = НайденнаяСтрока.Лечение.ПолучитьОбъект(); 
						    ЛечениеОбъект.ДатаОкончания = Строка.Дата;
							ЛечениеОбъект.Записать(); 
							НайденнаяСтрока.Закрыт = Истина;
						КонецЦикла;
						НайденныеСтроки = ТаблицаЛечений.НайтиСтроки(Новый Структура("Закрыт", Ложь)); 					
						СоздатьНовыйКурсИЗакрытьПредыдущий = (НайденныеСтроки.Количество() = 0);
							
					КонецЕсли;		
				Иначе
					СоздатьНовыйКурсИЗакрытьПредыдущий = Ложь;
				КонецЕсли;
				СуммаКурса = СуммаКурса + Строка.СуммаДокумента;
					
				Если СоздатьНовыйКурсИЗакрытьПредыдущий = Истина Тогда
					Попытка 
						КурсЛеченияОбъект.СуммаКурса    = СуммаКурса;
						КурсЛеченияОбъект.ДатаОкончания = Строка.Дата; 
						КурсЛеченияОбъект.Записать();
					Исключение  
						ОписаниеОшибки = "Ошибка при записи курса лечения по приему " + Строка.Представление + " " + ОписаниеОшибки();
						ЗаписьЖурналаРегистрации("ЗаполнитьКурсыЛеченияВПриемах", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
					КонецПопытки;
				КонецЕсли; 

			Исключение  
				ОписаниеОшибки = "Ошибка при записи курса лечения по приему " + Строка.Представление + " " + ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("ЗаполнитьКурсыЛеченияВПриемах", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
			КонецПопытки;
			
			НомерСтроки = НомерСтроки + 1;

		КонецЦикла;
		
		Если СуммаКурса <> 0 И КурсЛеченияОбъект.СуммаКурса = 0 Тогда
			Попытка 
				КурсЛеченияОбъект.СуммаКурса = СуммаКурса;
				КурсЛеченияОбъект.Записать();
			Исключение  
				ОписаниеОшибки = "Ошибка при записи курса лечения по контрагенту " + Контрагент + " " + ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("ЗаполнитьКурсыЛеченияВПриемах", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
			КонецПопытки;	
		КонецЕсли;

	КонецЦикла;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - установка видимости смены СЕ.
//
Процедура УстановкаВидимостиСменыКлиники() Экспорт
	
	ОбщегоНазначения.ЭтоСеть();
	
КонецПроцедуры

// Процедура - Заполнить справочник Классификатор должностей на сервере
//
Процедура ЗаполнитьСправочникСпециализации() Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Справочники.Специализации.СоздатьЗначенияПоУмолчанию();

КонецПроцедуры 

// Процедура - Присвоить специализации врачам
//
Процедура ПрисвоитьСпециализацииВрачам() Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос(	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	ВложенныйЗапрос.Наименование КАК ДолжностьНаименование
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Должности.Наименование КАК Наименование,
	|			Должности.Ссылка КАК Ссылка
	|		ИЗ
	|			Справочник.Должности КАК Должности
	|		ГДЕ
	|			НЕ Должности.ПометкаУдаления) КАК ВложенныйЗапрос
	|		ПО Сотрудники.Должность = ВложенныйЗапрос.Ссылка
	|ГДЕ
	|	НЕ Сотрудники.ПометкаУдаления
	|	И НЕ Сотрудники.ЭтоГруппа
	|	И Сотрудники.Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.Врач)
	|	И (ВложенныйЗапрос.Наименование ПОДОБНО ""%ортодонт%""
	|			ИЛИ ВложенныйЗапрос.Наименование ПОДОБНО ""%гигиен%""
	|			ИЛИ ВложенныйЗапрос.Наименование ПОДОБНО ""%хирург%""
	|			ИЛИ ВложенныйЗапрос.Наименование ПОДОБНО ""%ортопед%""
	|			ИЛИ ВложенныйЗапрос.Наименование ПОДОБНО ""%терапев%""
	|			ИЛИ ВложенныйЗапрос.Наименование ПОДОБНО ""%парадонт%"")");
	
	Выборка = Запрос.Выполнить().Выбрать();                                       
	Пока Выборка.Следующий() Цикл
		Если Найти(НРег(Выборка.ДолжностьНаименование), "ортодонт") > 0 Тогда 
			Специализация = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Специализации.Ортодонтия");
		ИначеЕсли Найти(НРег(Выборка.ДолжностьНаименование), "гигиен") > 0 Тогда 
			Специализация = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Специализации.Гигиена");
		ИначеЕсли Найти(НРег(Выборка.ДолжностьНаименование), "хирург") > 0 Тогда  
			Специализация = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Специализации.Хирургия");  
		ИначеЕсли Найти(НРег(Выборка.ДолжностьНаименование), "ортопед") > 0 Тогда  
			Специализация = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Специализации.Ортопедия"); 
		ИначеЕсли Найти(НРег(Выборка.ДолжностьНаименование), "терапев") > 0 Тогда	 
			Специализация = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Специализации.Терапия"); 
		ИначеЕсли Найти(НРег(Выборка.ДолжностьНаименование), "парадонт") > 0 Тогда 
			Специализация = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Специализации.Парадонтология"); 			
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(Выборка.Сотрудник.СпецилазацииСотрудника) 
			ИЛИ Не ЗначениеЗаполнено(Выборка.Сотрудник.СпецилазацииСотрудника.НайтиСтроки(Новый Структура("Специализация", Специализация))) Тогда 
			Сотрудник              = Выборка.Сотрудник.ПолучитьОбъект();
			СтрокаТЧ               = Сотрудник.СпецилазацииСотрудника.Добавить();
			СтрокаТЧ.Специализация = Специализация;
			СтрокаТЧ.Основная      = Выборка.Сотрудник.СпецилазацииСотрудника.Количество() = 0;  
			Попытка
				Сотрудник.Записать(); 
			Исключение  
				ЗаписьЖурналаРегистрации("Добавление специализации сотруднику (" + Строка(Сотрудник) + ")", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
            КонецПопытки;
		КонецЕсли;	
	КонецЦикла;	

КонецПроцедуры

// Процедура - Сконвертировать предопределенные сделки
//
Процедура СконвертироватьПредопределенныеСделки() Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ВидСделки 	= Неопределено;
	Отказ 		= Ложь;

	Справочники.ВидыСделок.ИнициализироватьПредопределенныйВид_ПервичныйПовторныйПациент(ВидСделки, Отказ);
	
	Справочники.Сделки.КонвертацияСделокНовыйПациент(Отказ);
	Справочники.Сделки.КонвертацияСделокПостоянныйПациент(Отказ);	
	
КонецПроцедуры

// Процедура, Перезаписать значение регистра сведений "ЗначенияПараметровОбследований".
//
Процедура ПерезаписатьЗначениеЗначенияПараметровОбследований() Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗначенияПараметровОбследований.Документ КАК Документ,
	|	ЗначенияПараметровОбследований.ШаблонОбследования КАК ШаблонОбследования,
	|	ЗначенияПараметровОбследований.Параметр КАК Параметр,
	|	ЗначенияПараметровОбследований.Зуб КАК Зуб,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗначенияПараметровОбследований.ЗначениеУдалить) = ТИП(СТРОКА)
	|			ТОГДА ВЫРАЗИТЬ(ЗначенияПараметровОбследований.ЗначениеУдалить КАК СТРОКА(400))
	|		ИНАЧЕ ЗначенияПараметровОбследований.ЗначениеУдалить
	|	КОНЕЦ КАК Значение,
	|	ЗначенияПараметровОбследований.ЗначениеУдалить КАК ЗначениеУдалить,
	|	ЗначенияПараметровОбследований.ПорядковыйНомер КАК ПорядковыйНомер,
	|	ЗначенияПараметровОбследований.ЗначениеСтрокой КАК ЗначениеСтрокой
	|ИЗ
	|	РегистрСведений.ЗначенияПараметровОбследований КАК ЗначенияПараметровОбследований"); 
	ТаблицаЗаписейРегистра = Запрос.Выполнить().Выгрузить();
	Попытка 		
		НаборЗаписей = РегистрыСведений.ЗначенияПараметровОбследований.СоздатьНаборЗаписей();
		НаборЗаписей.Загрузить(ТаблицаЗаписейРегистра);
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	Исключение
		ЗаписьЖурналаРегистрации("Перезаписать регистр сведений значения параметров обследований" , УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
	КонецПопытки; 
	
КонецПроцедуры	

// Процедура - Заполнить статусы пациентов в событии.
//
Процедура ЗаполнитьСтатусыПациентовВСобытии(Параметры = Неопределено) Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Событие.Ссылка КАК Ссылка,
	|	Событие.СсылкаНаПрием.СтатусПациента КАК СтатусПациента,
	|	Событие.СсылкаНаПрием КАК СсылкаНаПрием
	|ПОМЕСТИТЬ ВтСобытияСПриемами
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.СсылкаНаПрием <> ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
	|	И Событие.СсылкаНаПрием.СтатусПациента <> ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)
	|	И Событие.СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)
	|	И Событие.Проведен = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Событие.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.Контрагент ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Первичный)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Постоянный)
	|	КОНЕЦ КАК СтатусПациента
	|ИЗ
	|	Документ.Событие КАК Событие
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПродажиОбороты.Контрагент КАК Контрагент,
	|			ПродажиОбороты.Период КАК Период
	|		ИЗ
	|			РегистрНакопления.Продажи.Обороты(
	|					,
	|					,
	|					Регистратор,
	|					НЕ ДокументПродажи В
	|							(ВЫБРАТЬ
	|								Т.СсылкаНаПрием
	|							ИЗ
	|								ВтСобытияСПриемами КАК Т)) КАК ПродажиОбороты
	|		ГДЕ
	|			ПродажиОбороты.Регистратор ССЫЛКА Документ.Прием) КАК ВложенныйЗапрос
	|		ПО (Событие.Дата > ВложенныйЗапрос.Период
	|				И Событие.Контрагент = ВложенныйЗапрос.Контрагент)
	|ГДЕ
	|	НЕ Событие.Ссылка В
	|				(ВЫБРАТЬ
	|					ВтСобытияСПриемами.Ссылка
	|				ИЗ
	|					ВтСобытияСПриемами КАК ВтСобытияСПриемами)
	|	И Событие.Проведен = ИСТИНА
	|	И Событие.СтатусПациента <> ВЫБОР
	|			КОГДА ВложенныйЗапрос.Контрагент ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Первичный)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Постоянный)
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВтСобытияСПриемами.Ссылка,
	|	ВтСобытияСПриемами.СтатусПациента
	|ИЗ
	|	ВтСобытияСПриемами КАК ВтСобытияСПриемами";
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		
		СобытиеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Если СобытиеОбъект <> Неопределено Тогда		
			
			СобытиеОбъект.СтатусПациента = Выборка.СтатусПациента;	
			
			Попытка
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СобытиеОбъект);
			Исключение	
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
Конецпроцедуры

// Процедура - Заполнить уникальный идентификатор структурной единицы
//
Процедура ЗаполнитьУникальныйИдентификаторСтруктурнойЕдиницы() Экспорт
	
	// Заполнить реквизит УникальныйИдентификаторСтруктурнойЕдиницы 
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	НЕ СтруктурныеЕдиницы.ЭтоГруппа
	|	И СтруктурныеЕдиницы.УникальныйИдентификаторСтруктурнойЕдиницы = """"";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктурнаяЕдиницаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СтруктурнаяЕдиницаОбъект.УникальныйИдентификаторСтруктурнойЕдиницы = Строка(Новый УникальныйИдентификатор());
		Попытка
			СтруктурнаяЕдиницаОбъект.Записать(); 
		Исключение
			ЗаписьЖурналаРегистрации("Заполнить уникальный идентификатор структурной единицы", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	// Выгрузить в личный кабинет
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВнешниеСистемы.Ссылка КАК Ссылка,
	|	ВнешниеСистемы.Параметры КАК Параметры,
	|	ВнешниеСистемы.КлючПриложения КАК КлючПриложения
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	НЕ ВнешниеСистемы.ПометкаУдаления
	|	И ВнешниеСистемы.УправлениеВЛичномКабинете
	|	И ВнешниеСистемы.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.ВиджетОнлайнЗаписи)
	|	И ВнешниеСистемы.Используется = ИСТИНА");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ПараметрыВнешнейСистемы = Выборка.Параметры.Получить();
		ИспользуемыеСтруктурныеЕдиницы = Новый Массив;
		Если ПараметрыВнешнейСистемы <> Неопределено И ПараметрыВнешнейСистемы.Свойство("ИспользуемыеСтруктурныеЕдиницы") 
			И ПараметрыВнешнейСистемы.ИспользуемыеСтруктурныеЕдиницы.Количество() > 0 Тогда
			ИспользуемыеСтруктурныеЕдиницы = ПараметрыВнешнейСистемы.ИспользуемыеСтруктурныеЕдиницы;  
			Попытка 
				Организация = ПолучитьОрганизацию();  
				Если Не ЗначениеЗаполнено(Организация) Тогда
					Продолжить;
				КонецЕсли;
				Результат = ЛичныйКабинет.УдалитьРегистрациюВиджета(Организация, ИспользуемыеСтруктурныеЕдиницы, Истина);
				Если Результат.ВыполненоУспешно Тогда
					Результат = ЛичныйКабинет.ЗарегистироватьВиджет(Организация, Выборка.КлючПриложения, ИспользуемыеСтруктурныеЕдиницы);
				КонецЕсли;
				
				Результат = ЛичныйКабинет.РегистрацияОрганизацииВиджета(Организация, Выборка.КлючПриложения);	
				Если Результат.ВыполненоУспешно Тогда
					ЛичныйКабинет.РегистрацияСтруктурныхЕдиницВиджета(ИспользуемыеСтруктурныеЕдиницы); 
				КонецЕсли;
			Исключение  
				ОписаниеОшибки = "Ошибка при регистрации виджета, для обновления id структурной единицы в reservi" + Символы.ПС + ОписаниеОшибки(); 
				ЗаписьЖурналаРегистрации("Заполнить уникальный идентификатор структурной единицы", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция - Получить организацию
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьОрганизацию()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления
	|	И НЕ Организации.ЭтоГруппа");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

// Процедура - Добавить роль использование монитора руководителя.
//
// Параметры:
//  Параметры	 - 	 - 
//
Процедура ДобавитьРольИспользованиеМонитораРуководителя(Параметры = Неопределено) Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ПометкаУдаления = ЛОЖЬ
	|	И (Пользователи.РольПользователя = ЗНАЧЕНИЕ(Перечисление.РольПользователя.Управляющий)
	|			ИЛИ Пользователи.РольПользователя = ЗНАЧЕНИЕ(Перечисление.РольПользователя.Руководитель))";
		
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторПользователяИБ);		
		
		Если ПользовательИБ <> Неопределено 		
			И ПользовательИБ.Роли.Содержит(Метаданные.Роли.ИспользоватьРабочийСтолМониторРуководителя) = Ложь Тогда
			
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ИспользоватьРабочийСтолМониторРуководителя);
			
			Попытка 
				ПользовательИБ.Записать();
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
Конецпроцедуры

// Процедура, обновляет пользовательские настройки списка клиентов после ухода от реквизита "Клиенты".
//
Процедура ОбновитьПользовательскиеНастройкиСпискаКлиентов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Отбор = Новый Структура("КлючОбъекта", "Справочник.Контрагенты.Форма.ФормаСпискаКлиенты.Список/ТекущиеПользовательскиеНастройки");
	НастройкиВыборка = ХранилищеСистемныхНастроек.Выбрать(Отбор);
	
	Пока НастройкиВыборка.Следующий() Цикл
		
		НастройкаИзменена = Ложь;
		Для Каждого ЭлементНастройки Из НастройкиВыборка.Настройки.Элементы Цикл
			
			Если ТипЗнч(ЭлементНастройки) <> Тип("УсловноеОформлениеКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого ЭлементУсловногоОформления Из ЭлементНастройки.Элементы Цикл
				
				Если ЭлементУсловногоОформления.Представление = "ФильтрСкрытияНеподходящихГрупп" Тогда
					
					// Возможна ситуация, когда недействительное поле компоновки удаляется платформой.
					Если ЭлементУсловногоОформления.Отбор.Элементы.Количество() = 1
						И ЭлементУсловногоОформления.Отбор.Элементы[0].ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоГруппа") Тогда
						
						НовыйЭлементОтбора					 = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
						НовыйЭлементОтбора.ЛевоеЗначение	 = Новый ПолеКомпоновкиДанных("ТипКонтрагента");
						НовыйЭлементОтбора.ПравоеЗначение	 = Перечисления.ТипыКонтрагентов.Клиенты;
						НовыйЭлементОтбора.ВидСравнения		 = ВидСравненияКомпоновкиДанных.НеРавно;
						НовыйЭлементОтбора.Использование	 = ЭлементУсловногоОформления.Отбор.Элементы[0].Использование;
						
						НастройкаИзменена = Истина;
						
					Иначе
						// Заменяем отбор по полю "Клиенты" на отбор по типу контрагента.
						Для Каждого ЭлементОтбораУсловногоОформления Из ЭлементУсловногоОформления.Отбор.Элементы Цикл
							
							Если ЭлементОтбораУсловногоОформления.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Клиенты") Тогда
								
								НовыйЭлементОтбора					 = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
								НовыйЭлементОтбора.ЛевоеЗначение	 = Новый ПолеКомпоновкиДанных("ТипКонтрагента");
								НовыйЭлементОтбора.ПравоеЗначение	 = Перечисления.ТипыКонтрагентов.Клиенты;
								НовыйЭлементОтбора.ВидСравнения		 = ВидСравненияКомпоновкиДанных.НеРавно;
								НовыйЭлементОтбора.Использование	 = ЭлементОтбораУсловногоОформления.Использование;
								
								ЭлементУсловногоОформления.Отбор.Элементы.Удалить(ЭлементОтбораУсловногоОформления);
								
								НастройкаИзменена = Истина;
								Прервать;
								
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЕсли;
					
					
				КонецЕсли;
				
				Если НастройкаИзменена Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если НастройкаИзменена Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НастройкаИзменена Тогда
			ХранилищеСистемныхНастроек.Сохранить(
				НастройкиВыборка.КлючОбъекта,
				НастройкиВыборка.КлючНастроек,
				НастройкиВыборка.Настройки,,
				НастройкиВыборка.Пользователь
			); 
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура, обновляет статусы пациентов в регистре КонтрагентыСведенияДляСписка.
//
Процедура ОбновитьСтатусыПациентовВРегистреКонтрагентыСведенияДляСписка(Параметры = Неопределено) Экспорт

	Если НЕ ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.ЭтоГруппа
	|	И Контрагенты.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты)");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			ПоследняяЗадача = Неопределено;
			ПоследняяЗадачаПредставление = Неопределено;
			СледующаяЗадача = Неопределено;
			СледующаяЗадачаПредставление = Неопределено;
			ТекущаяСделка 		= Неопределено;
			ТекущийЭтапСделки   = Неопределено;
			СуммаСделки         = Неопределено;
			ЗапланированнаяПредварительнаяЗапись = Неопределено;
			ДатаСледующегоПриема = Дата(1,1,1);
			
			Запрос = Новый Запрос(			
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Событие.Ссылка КАК Ссылка,
			|	Событие.Дата КАК ДатаСледующегоПриема
			|ИЗ
			|	Документ.Событие КАК Событие
			|ГДЕ
			|	Событие.Проведен
			|	И Событие.Контрагент = &Контрагент
			|	И Событие.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.НеПодтверждена), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.Подтверждена), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПациентОжидает))
			|	И Событие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Событие.Дата УБЫВ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Прием.ВремяНачалаПриема КАК ДатаПервогоПриема
			|ИЗ
			|	Документ.Прием КАК Прием
			|ГДЕ
			|	Прием.Контрагент = &Контрагент
			|	И Прием.Проведен
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаПервогоПриема
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Прием.ВремяНачалаПриема КАК ДатаПоследнегоПриема
			|ИЗ
			|	Документ.Прием КАК Прием
			|ГДЕ
			|	Прием.Контрагент = &Контрагент
			|	И Прием.Проведен
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаПоследнегоПриема УБЫВ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КОЛИЧЕСТВО(Прием.Ссылка) КАК Количество
			|ИЗ
			|	Документ.Прием КАК Прием
			|ГДЕ
			|	Прием.Контрагент = &Контрагент
			|	И Прием.Проведен
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Сделки.Ссылка КАК ТекущаяСделка,
			|	Сделки.ЭтапСделки КАК ЭтапСделки,
			|	Сделки.СуммаСделки КАК СуммаСделки
			|ИЗ
			|	Справочник.Сделки КАК Сделки
			|ГДЕ
			|	Сделки.Контрагент = &Контрагент
			|	И Сделки.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
			|	И НЕ Сделки.ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	Сделки.ДатаСделки УБЫВ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	СтатусыКонтрагентовСрезПоследних.Статус КАК Статус
			|ИЗ
			|	РегистрСведений.СтатусыКонтрагентов.СрезПоследних(, Контрагент = &Контрагент) КАК СтатусыКонтрагентовСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
			|ИЗ
			|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
			|ГДЕ
			|	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
			|	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКлиента)
			|	И КонтрагентыКонтактнаяИнформация.НомерТелефона <> """"
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КонтрагентыКонтактнаяИнформация.АдресЭП КАК АдресЭП
			|ИЗ
			|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
			|ГДЕ
			|	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
			|	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКлиента)
			|	И КонтрагентыКонтактнаяИнформация.АдресЭП <> """"
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Взаимодействие.Ссылка КАК ПоследняяЗадача,
			|	Взаимодействие.ЗадачаТема КАК ЗадачаТема,
			|	Взаимодействие.ЗадачаОписание КАК ЗадачаОписание,
			|	Взаимодействие.ДатаИсполнения КАК ДатаИсполнения
			|ИЗ
			|	Задача.Взаимодействие КАК Взаимодействие
			|ГДЕ
			|	Взаимодействие.Выполнена
			|	И Взаимодействие.Контрагент = &Контрагент
			|	И НЕ Взаимодействие.ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	Взаимодействие.ЗадачаНазначеннаяДата УБЫВ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Взаимодействие.Ссылка КАК СледующаяЗадача,
			|	Взаимодействие.ЗадачаТема КАК ЗадачаТема,
			|	Взаимодействие.ЗадачаОписание КАК ЗадачаОписание,
			|	Взаимодействие.ЗадачаНазначеннаяДата КАК ЗадачаНазначеннаяДата
			|ИЗ
			|	Задача.Взаимодействие КАК Взаимодействие
			|ГДЕ
			|	НЕ Взаимодействие.Выполнена
			|	И Взаимодействие.Контрагент = &Контрагент
			|	И НЕ Взаимодействие.ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	Взаимодействие.ЗадачаНазначеннаяДата УБЫВ");
			
			Запрос.УстановитьПараметр("Контрагент", Выборка.Контрагент);
			
			Результат								= Запрос.ВыполнитьПакет();
			
			ТаблицаЗапланированнаяПЗ				= Результат[0].Выгрузить();	
			ТаблицаПервыйПрием						= Результат[1].Выгрузить();
			ТаблицаПоследнийПрием					= Результат[2].Выгрузить();
			ТаблицаКоличествоПриемов				= Результат[3].Выгрузить(); 	
			ТаблицаТекущаяСделка					= Результат[4].Выгрузить();
			ТаблицаТекущийСтатус					= Результат[5].Выгрузить();
			
			ДатаПоследнегоПриема = ?(ТаблицаПоследнийПрием.Количество() > 0, ТаблицаПоследнийПрием[0].ДатаПоследнегоПриема, Дата(1,1,1));
			
			Если ТаблицаЗапланированнаяПЗ.Количество() > 0 Тогда
				ЗапланированнаяПредварительнаяЗапись = ТаблицаЗапланированнаяПЗ[0].Ссылка;
				ДатаСледующегоПриема = ?(ДатаПоследнегоПриема <= ТаблицаЗапланированнаяПЗ[0].ДатаСледующегоПриема, ТаблицаЗапланированнаяПЗ[0].ДатаСледующегоПриема, Дата(1,1,1));	
			КонецЕсли;
			
			Если ТаблицаТекущаяСделка.Количество() > 0 Тогда
				ТекущаяСделка 		= ТаблицаТекущаяСделка[0].ТекущаяСделка;
				ТекущийЭтапСделки   = ТаблицаТекущаяСделка[0].ЭтапСделки;
				СуммаСделки         = ТаблицаТекущаяСделка[0].СуммаСделки;
			КонецЕсли;
			
			МассивТелефоны 			= Результат[6].Выгрузить().ВыгрузитьКолонку("НомерТелефона");
			ТелефоныСтрокой			= СтроковыеФункцииКлиентСерверСтоматология.ПолучитьСтрокуИзМассиваПодстрок(МассивТелефоны, ", ");
			
			МассивEmail 			= Результат[7].Выгрузить().ВыгрузитьКолонку("АдресЭП");
			АдресаЭПСтрокой			= СтроковыеФункцииКлиентСерверСтоматология.ПолучитьСтрокуИзМассиваПодстрок(МассивEmail, ", ");
			
			ТаблицаПоследняяЗадача	= Результат[8].Выгрузить();
			ТаблицаСледующаяЗадача	= Результат[9].Выгрузить();
			
			Если ТаблицаПоследняяЗадача.Количество() > 0 Тогда
				
				ПоследняяЗадача = ТаблицаПоследняяЗадача[0].ПоследняяЗадача;
				
				ПоследняяЗадачаТема = СокрЛП(ТаблицаПоследняяЗадача[0].ЗадачаТема);
				ПоследняяЗадачаОписание = СокрЛП(ТаблицаПоследняяЗадача[0].ЗадачаОписание);
				
				ПоследняяЗадачаПредставление = "" + ТаблицаПоследняяЗадача[0].ДатаИсполнения
												+ ?(ЗначениеЗаполнено(ПоследняяЗадачаТема), " " + ПоследняяЗадачаТема, "") 
												+ ?(ЗначениеЗаполнено(ПоследняяЗадачаОписание), " " + ПоследняяЗадачаОписание, "");
				
			КонецЕсли;
			
			Если ТаблицаСледующаяЗадача.Количество() > 0 Тогда
				
				СледующаяЗадача = ТаблицаСледующаяЗадача[0].СледующаяЗадача;
				
				СледующаяЗадачаТема = СокрЛП(ТаблицаСледующаяЗадача[0].ЗадачаТема);
				СледующаяЗадачаОписание = СокрЛП(ТаблицаСледующаяЗадача[0].ЗадачаОписание);
				
				СледующаяЗадачаПредставление = "" + ТаблицаСледующаяЗадача[0].ЗадачаНазначеннаяДата 
												+ ?(ЗначениеЗаполнено(СледующаяЗадачаТема), " " + СледующаяЗадачаТема, "") 
												+ ?(ЗначениеЗаполнено(СледующаяЗадачаОписание), " " + СледующаяЗадачаОписание, "");
				
			КонецЕсли;			
			
			ОбновляемыеДанные = Новый Структура;
			ОбновляемыеДанные.Вставить("Контрагент"		, Выборка.Контрагент);
			
			ОбновляемыеДанные.Вставить("Статус", ?(ТаблицаТекущийСтатус.Количество() > 0, ТаблицаТекущийСтатус[0].Статус, Неопределено));	
			ОбновляемыеДанные.Вставить("ДатаПервогоПриема", ?(ТаблицаПервыйПрием.Количество() > 0, ТаблицаПервыйПрием[0].ДатаПервогоПриема, Дата(1,1,1))); 
			ОбновляемыеДанные.Вставить("ДатаПоследнегоПриема", ДатаПоследнегоПриема);	
			ОбновляемыеДанные.Вставить("КоличествоПриемов", ?(ТаблицаКоличествоПриемов.Количество() > 0, ТаблицаКоличествоПриемов[0].Количество, 0));
			
			ОбновляемыеДанные.Вставить("ЗапланированнаяПредварительнаяЗапись", ЗапланированнаяПредварительнаяЗапись);
			ОбновляемыеДанные.Вставить("ДатаСледующегоПриема", ДатаСледующегоПриема);
			ОбновляемыеДанные.Вставить("ТекущаяСделка", ТекущаяСделка);
			ОбновляемыеДанные.Вставить("ТекущийЭтапСделки", ТекущийЭтапСделки);
			ОбновляемыеДанные.Вставить("СуммаСделки", СуммаСделки);
			
			ОбновляемыеДанные.Вставить("Телефон", ТелефоныСтрокой);
			ОбновляемыеДанные.Вставить("АдресЭП", АдресаЭПСтрокой);
			
			ОбновляемыеДанные.Вставить("ПоследняяЗадача", ПоследняяЗадача);
			ОбновляемыеДанные.Вставить("ПоследняяЗадачаПредставление", ПоследняяЗадачаПредставление);
			ОбновляемыеДанные.Вставить("СледующаяЗадача", СледующаяЗадача);
			ОбновляемыеДанные.Вставить("СледующаяЗадачаПредставление", СледующаяЗадачаПредставление);
		
			РегистрыСведений.КонтрагентыСведенияДляСписка.АктуализироватьНеобходимыеДанныеВСведенияхДляСписка(Выборка.Контрагент, ОбновляемыеДанные);
				
		Исключение
			ЗаписьЖурналаРегистрации("Актуализация данных в регистре сведений КонтрагентыСведенияДляСписка"
									, УровеньЖурналаРегистрации.Ошибка,,
									, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));
		КонецПопытки;
		
	КонецЦикла;
	
	Если НЕ Параметры = Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура, обновляет предопределенные элементы видов сделок и причин отказа.
//
Процедура ОбновитьПредопределенныеВидСделкиИПричиныОтказов() Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;  
	
	КлиентНеПришел  = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПричиныОтказов.КлиентНеПришел"); 
	КлиентОтказался = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПричиныОтказов.КлиентОтказался"); 
	Если КлиентНеПришел <> Неопределено Тогда
		ТекЭлемент = КлиентНеПришел.ПолучитьОбъект();
		ТекЭлемент.Наименование = "Пациент не пришел"; 
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ТекЭлемент);
		Исключение 
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
				                         , УровеньЖурналаРегистрации.Ошибка
				                         ,				                         ,
				                         , "Не удалось записать предопределенный элемент ""КлиентНеПришел"" справочника Причины отказов");
		КонецПопытки; 	
	КонецЕсли; 
	
	Если КлиентОтказался <> Неопределено Тогда
		ТекЭлемент = КлиентОтказался.ПолучитьОбъект();
		ТекЭлемент.Наименование = "Пациент отказался";
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ТекЭлемент); 
		Исключение  
			 	ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
				                         , УровеньЖурналаРегистрации.Ошибка
				                         ,				                         ,
				                         , "Не удалось записать предопределенный элемент ""КлиентОтказался"" справочника Причины отказов");
		КонецПопытки;
	КонецЕсли;
	
	ВидСделкиНовыеПациенты = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты");   
	Если Не ЗначениеЗаполнено(ВидСделкиНовыеПациенты) Тогда 
		Возврат;
	КонецЕсли;			
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЭтапыСделок.Ссылка КАК Ссылка,
	|	ЭтапыСделок.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.ВидСделки = &ВидСделки
	|	И НЕ ЭтапыСделок.ПометкаУдаления"); 
	Запрос.УстановитьПараметр("ВидСделки", ВидСделкиНовыеПациенты); 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если СтрНайти(Выборка.Наименование, "Клиент") > 0 Или СтрНайти(Выборка.Наименование, "прием") > 0 Тогда
			ЭтапСделкиОбъект = Выборка.Ссылка.ПолучитьОбъект(); 
			Если СтрНайти(Выборка.Наименование, "Клиент") Тогда
				ЭтапСделкиОбъект.Наименование = СтрЗаменить(ЭтапСделкиОбъект.Наименование, "Клиент", "Пациент");  
			Иначе
				ЭтапСделкиОбъект.Наименование = СтрЗаменить(ЭтапСделкиОбъект.Наименование, "прием", "приём");
			КонецЕсли;
			Попытка
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ЭтапСделкиОбъект);   
			Исключение 
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
				                         , УровеньЖурналаРегистрации.Ошибка
				                         ,				                         ,
				                         , "Не удалось записать этап сделки" + Выборка.Наименование + " справочника этапы сделок");
			КонецПопытки; 
		КонецЕсли;						 
	КонецЦикла;		
	
	ВидСделкиОбъект = ВидСделкиНовыеПациенты.ПолучитьОбъект();
	ВидСделкиОбъект.НаименованиеЭтапаУспех = СтрЗаменить(ВидСделкиОбъект.НаименованиеЭтапаУспех, "Клиент", "Пациент");
	ВидСделкиОбъект.НаименованиеЭтапаОтказ = СтрЗаменить(ВидСделкиОбъект.НаименованиеЭтапаОтказ, "Клиент", "Пациент"); 
	Попытка 
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ВидСделкиОбъект);	 
	Исключение 
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
		                         , УровеньЖурналаРегистрации.Ошибка
		                         ,				                         ,
		                         , "Не удалось записать вид сделки" + ВидСделкиОбъект.Наименование + " справочника виды сделок");
		
	КонецПопытки;
	
КонецПроцедуры  

// Процедура, перезаписывает код номенклатуры медицинских услуг если он начинался с кириллицы. 
//
Процедура ПерезаписатьКодНоменклатурыМедицинскихУслуг() Экспорт

	Если НЕ ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли; 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КлассификаторНоменклатурыМедицинскихУслуг.Ссылка КАК Ссылка,
	|	КлассификаторНоменклатурыМедицинскихУслуг.Код КАК Код,
	|	КлассификаторНоменклатурыМедицинскихУслуг.Представление КАК Представление
	|ИЗ
	|	Справочник.КлассификаторНоменклатурыМедицинскихУслуг КАК КлассификаторНоменклатурыМедицинскихУслуг
	|ГДЕ
	|	НЕ КлассификаторНоменклатурыМедицинскихУслуг.ЭтоГруппа"); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	МетаданныеСправочника = Метаданные.Справочники.КлассификаторНоменклатурыМедицинскихУслуг;		
	Пока Выборка.Следующий() Цикл  	
		КодНМУ = Выборка.Код;
		Справочники.КлассификаторНоменклатурыМедицинскихУслуг.ПривестиКодКЛатинскомуВарианту(КодНМУ);
		Если СокрЛП(КодНМУ) <> СокрЛП(Выборка.Код) Тогда
			ОбъектНМУ     = Выборка.Ссылка.ПолучитьОбъект();	
			ОбъектНМУ.Код = КодНМУ;
			Попытка
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектНМУ);
			Исключение
				ШаблонКомментария = НСтр("ru = 'Не удалось записать %1 по причине: %2'");		
				Комментарий       = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
				                                                                            , Выборка.Представление
				                                                                            , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 	
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
				                         , УровеньЖурналаРегистрации.Ошибка
				                         , МетаданныеСправочника
				                         ,
				                         , Комментарий);				
			КонецПопытки; 
		КонецЕсли;
	КонецЦикла;	
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.НоменклатураМедицинскихУслуг.Код КАК КодКлассификатора,
	|	Номенклатура.КодНоменклатурыМедицинскиУслуг КАК КодНМУ,
	|	Номенклатура.НоменклатураМедицинскихУслуг КАК НоменклатураМУ,
	|	Номенклатура.Представление КАК Представление
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)");
	
	Выборка = Запрос.Выполнить().Выбрать();
	МетаданныеСправочника = Метаданные.Справочники.Номенклатура;	
	Пока Выборка.Следующий() Цикл 
		
		Если Не ЗначениеЗаполнено(Выборка.НоменклатураМУ) Тогда
			КодКлассификатора = "";
		Иначе
			КодКлассификатора = Выборка.КодКлассификатора; 
		КонецЕсли;  
			
		Если СокрЛП(Выборка.КодНМУ) <> СокрЛП(КодКлассификатора) Тогда			
			ОбъектНоменклатура = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектНоменклатура.КодНоменклатурыМедицинскиУслуг = КодКлассификатора;
			Попытка
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектНоменклатура);
			Исключение  
				
				ШаблонКомментария = НСтр("ru = 'Не удалось записать %1 по причине: %2'");		
				Комментарий       = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
				                                                                            , Выборка.Представление
				                                                                            , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
				
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
				                         , УровеньЖурналаРегистрации.Ошибка
				                         , МетаданныеСправочника
				                         ,
				                         , Комментарий);	
			КонецПопытки; 
		КонецЕсли; 
		
	КонецЦикла;	
	
КонецПроцедуры	

// Процедура - Актуализировать расписание обновления статусов событий
//
Процедура АктуализироватьРасписаниеОбновленияСтатусовСобытий() Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;  

	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;

	ЗаданиеНашли = Истина;	
	// Ищем задание по наименованию.
	Отбор = Новый Структура();
	Отбор.Вставить("Метаданные", "ОбновлениеСтатусовСобытий");
	Задания = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	
	// Проверяем, что задание найдено.
	Если Задания.Количество() <> 1 Тогда
		// Запись в журнал ошибки опущена.
		ЗаданиеНашли = Ложь;
	КонецЕсли;
	
	Если ЗаданиеНашли = Истина Тогда 	
		// Актуализируем задание.
		НашеЗадание 					= Задания[0];
		ПараметрыЗадания 				= Новый Структура();
		
		Расписание 						= Новый РасписаниеРегламентногоЗадания;
		Расписание.ПериодПовтораДней 	= 1;
		Расписание.ПериодНедель		 	= 1;
		МассивДней 						= Новый Массив; Для К = 1 По 7 Цикл МассивДней.Добавить(К); КонецЦикла; 
		МассивМесяцев 					= Новый Массив; Для К = 1 По 12 Цикл МассивМесяцев.Добавить(К); КонецЦикла;  
		
		Расписание.ДниНедели 			= МассивДней;
		Расписание.Месяцы				= МассивМесяцев;
		
		Расписание.ВремяНачала 			= Дата(1,1,1) + 60*60*3;
		
		ПараметрыЗадания.Вставить("Использование"	, Истина); 
		ПараметрыЗадания.Вставить("Расписание"		, Расписание);
		Попытка
			РегламентныеЗаданияСервер.ИзменитьЗадание(НашеЗадание.УникальныйИдентификатор, ПараметрыЗадания);
		Исключение
			
			МетаданныеЗадания 			= Метаданные.РегламентныеЗадания.ОбновлениеСтатусовСобытий;		
			ШаблонКомментария 			= НСтр("ru = 'Ошибка изменения расписания регламентного задания ""Обновление статусов событий""! 
			|по причине: %1'");
		
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																				, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
									, УровеньЖурналаРегистрации.Ошибка
									, МетаданныеЗадания
									,
									, Комментарий);
		КонецПопытки;	
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Добавляет роль пользователям ИБ "ВыводНаПринтерФайлБуферОбмена"
//
Процедура ДобавитьРольВыводНаПринтерФайлБуферОбмена() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	НЕ Сотрудники.ЭтоГруппа
	|	И НЕ Сотрудники.Служебный";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.ИдентификаторПользователяИБ = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор() Тогда
			
			НайденныйПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторПользователяИБ); 
			
			Если НайденныйПользовательИБ <> Неопределено И НЕ НайденныйПользовательИБ.Роли.Содержит(Метаданные.Роли.ВыводНаПринтерФайлБуферОбмена) Тогда
				
				НайденныйПользовательИБ.Роли.Добавить(Метаданные.Роли.ВыводНаПринтерФайлБуферОбмена);
				
				Попытка
					
					НайденныйПользовательИБ.Записать();
					
				Исключение 
					
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

// Процедура - Заполнить доступные кассы пользователям.
//
Процедура ЗаполнитьДоступныеКассыПользователей(Параметры = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПользователиДоступныеСтруктурныеЕдиницы.Ссылка КАК Пользователь,
	|	ПользователиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ МестаРаботыПользователей
	|ИЗ
	|	Справочник.Пользователи.ДоступныеСтруктурныеЕдиницы_Удалить КАК ПользователиДоступныеСтруктурныеЕдиницы
	|ГДЕ
	|	ПользователиДоступныеСтруктурныеЕдиницы.Ссылка.ИдентификаторПользователяИБ <> &ПустойИдентификатор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиПользователей.Пользователь КАК Пользователь,
	|	НастройкиПользователей.Значение КАК Касса
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МестаРаботыПользователей КАК МестаРаботыПользователей
	|		ПО НастройкиПользователей.Пользователь = МестаРаботыПользователей.Пользователь
	|			И НастройкиПользователей.СтруктурнаяЕдиница = МестаРаботыПользователей.СтруктурнаяЕдиница
	|ГДЕ
	|	НастройкиПользователей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяКасса)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПользователиДоступныеСтруктурныеЕдиницы.Ссылка КАК Пользователь,
	|	Кассы.Ссылка КАК Касса,
	|	ПользователиДоступныеСтруктурныеЕдиницы.Ссылка.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
	|ИЗ
	|	Справочник.Пользователи.ДоступныеСтруктурныеЕдиницы_Удалить КАК ПользователиДоступныеСтруктурныеЕдиницы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Кассы КАК Кассы
	|		ПО ПользователиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница = Кассы.СтруктурнаяЕдиница
	|ГДЕ
	|	НЕ Кассы.Ссылка ЕСТЬ NULL
	|	И ПользователиДоступныеСтруктурныеЕдиницы.Ссылка.ИдентификаторПользователяИБ <> &ПустойИдентификатор
	|ИТОГИ ПО
	|	Пользователь";             
	
	Запрос.УстановитьПараметр("ПустойИдентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
		
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаОсновныеКассыПользователей = МассивРезультатов[1].Выгрузить(); 
	
	Выборка = МассивРезультатов[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	Пока Выборка.Следующий() Цикл
		ОсновнаяКассаДобавлена 		= Ложь;
		
		СтрокаТаблицы = ТаблицаОсновныеКассыПользователей.Найти(Выборка.Пользователь, "Пользователь");
		ОсновнаяКассаПользователя 	= ?(СтрокаТаблицы <> Неопределено, СтрокаТаблицы.Касса, СтрокаТаблицы); 
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторПользователяИБ);
				
		Если ПользовательИБ <> Неопределено 		
			И НЕ (ПользовательИБ.Роли.Содержит(Метаданные.Роли.ДобавлениеИзменениеДокументовПоОплате) = Истина 
			Или ПользовательИБ.Роли.Содержит(Метаданные.Роли.ДобавлениеИзменениеДокументовПоФинансам) = Истина
			Или ПользовательИБ.Роли.Содержит(Метаданные.Роли.ПолныеПрава) = Истина) Тогда
			
			Продолжить;
		КонецЕсли;;
		
		ПользовательОбъект = Выборка.Пользователь.ПолучитьОбъект();
		
		Если ПользовательОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПользовательОбъект.ДоступныеКассы_Удалить.Очистить();
		
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяСтрока = ПользовательОбъект.ДоступныеКассы_Удалить.Добавить();
			НоваяСтрока.Касса = ВыборкаДетальныеЗаписи.Касса;
			
			Если ОсновнаяКассаПользователя = ВыборкаДетальныеЗаписи.Касса И ОсновнаяКассаДобавлена = Ложь Тогда
				НоваяСтрока.Основная = Истина;
				ОсновнаяКассаДобавлена = Истина;
			КонецЕсли;
			
		КонецЦикла; 
		
		Если ОсновнаяКассаДобавлена = Ложь И ПользовательОбъект.ДоступныеКассы_Удалить.Количество() > 0 Тогда
			ПользовательОбъект.ДоступныеКассы_Удалить[0].Основная = Истина;
		КонецЕсли;
		
		Попытка	
			ПользовательОбъект.Записать();
		Исключение 
		КонецПопытки;
				
	КонецЦикла;
	
КонецПроцедуры   

// Процедура - Заполнить статьи доходов документа поступление денежных средств
//
Процедура ЗаполнитьСтатьиДвиженияДокументаПоступлениеДенежныхСредств(Параметры = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Справочники.СтатьиДоходовИРасходов.ОплатаОтКлиента.ПоУмолчаниюДляОперации.Пустая() Тогда
		
		СправочникОбъект 						= Справочники.СтатьиДоходовИРасходов.ОплатаОтКлиента.ПолучитьОбъект();
		СправочникОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента;
		
		Попытка	
			СправочникОбъект.Записать();
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПоступлениеДенежныхСредств.Ссылка КАК Ссылка,
	|	ПоступлениеДенежныхСредств.Проведен КАК Проведен
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств КАК ПоступлениеДенежныхСредств
	|ГДЕ
	|	ПоступлениеДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтКлиента)
	|	И ПоступлениеДенежныхСредств.Статья = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРАсходов.ПустаяСсылка)
	|	И НЕ ПоступлениеДенежныхСредств.ПометкаУдаления");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Статья = Справочники.СтатьиДоходовИРасходов.ОплатаОтКлиента;
	
	Пока Выборка.Следующий() Цикл 
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Если ДокументОбъект = Неопределено Тогда 	
			Продолжить;	
		КонецЕсли;
		
		ДокументОбъект.Статья = Статья;
		
		Попытка       
			
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			Если Выборка.Проведен Тогда
				
				НаборЗаписей = РегистрыНакопления.ДенежныеСредства.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Значение = Выборка.Ссылка;
				
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Выбран() Тогда
					
					Для Каждого Запись Из НаборЗаписей Цикл
						Если Не ЗначениеЗаполнено(Запись.Статья) И Запись.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
							Запись.Статья = Статья;	
						КонецЕсли;
					КонецЦикла;
					
					НаборЗаписей.Записать();
					
				КонецЕсли;			
				
			КонецЕсли;
			
		Исключение 			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());						
		КонецПопытки;
		
	КонецЦикла;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура, обновляет предопределенные элементы плана видов характеристик "ПараметрыОбследований".
//
Процедура ЗаполнитьАлгоритмВычисленияПредопределенныхПараметровОбследований() Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;  
	
	ВрачФИО1            = ОбщегоНазначения.ПредопределенныйЭлемент("ПланВидовХарактеристик.ПараметрыОбследований.ВрачФИО1"); 
	ВрачФИО2            = ОбщегоНазначения.ПредопределенныйЭлемент("ПланВидовХарактеристик.ПараметрыОбследований.ВрачФИО2"); 
	ДатаДокумента       = ОбщегоНазначения.ПредопределенныйЭлемент("ПланВидовХарактеристик.ПараметрыОбследований.ДатаДокумента");
	ДатаИВремяДокумента = ОбщегоНазначения.ПредопределенныйЭлемент("ПланВидовХарактеристик.ПараметрыОбследований.ДатаИВремяДокумента");  
	КлиентФИО1          = ОбщегоНазначения.ПредопределенныйЭлемент("ПланВидовХарактеристик.ПараметрыОбследований.КлиентФИО1");
	КлиентФИО2          = ОбщегоНазначения.ПредопределенныйЭлемент("ПланВидовХарактеристик.ПараметрыОбследований.КлиентФИО2"); 
	
	МетаданныеХарактеристики = Метаданные.ПланыВидовХарактеристик.ПараметрыОбследований; 
	ШаблонКомментария        = НСтр("ru = 'Не удалось записать %1 по причине: %2'");
	Если ВрачФИО1 <> Неопределено Тогда 
		ОбъектДанных                   = ВрачФИО1.ПолучитьОбъект();
		ОбъектДанных.ТипПараметра      = Перечисления.ТипыПараметровШаблоновОбследований.Динамический;
		ОбъектДанных.АлгоритВычисления = "Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		|Фамилия = СокрЛП(Объект.Сотрудник.Фамилия);
		|Имя = Лев(СокрЛП(Объект.Сотрудник.Имя), 1);
		| Отчество = Лев(СокрЛП(Объект.Сотрудник.Отчество), 1);
		| Результат = Фамилия  +"" ""+ Имя + "". "" + Отчество+""."";
		|Иначе
		|     Результат = """";
		|КонецЕсли;";
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектДанных);
		Исключение 
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
				                                                                  , ОбъектДанных.Наименование
				                                                                  , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 

			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
				                     , УровеньЖурналаРегистрации.Ошибка
				                     , МетаданныеХарактеристики			                         
				                     ,
									 , Комментарий);
		КонецПопытки; 	
	КонецЕсли;
	
	Если ВрачФИО2 <> Неопределено Тогда
		ОбъектДанных                   = ВрачФИО2.ПолучитьОбъект();
		ОбъектДанных.ТипПараметра      = Перечисления.ТипыПараметровШаблоновОбследований.Динамический;
		ОбъектДанных.АлгоритВычисления = "Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		|Фамилия = СокрЛП(Объект.Сотрудник.Фамилия);
		|Имя = СокрЛП(Объект.Сотрудник.Имя);
		|Отчество = СокрЛП(Объект.Сотрудник.Отчество);
		|Результат = Фамилия  +"" ""+ Имя + "" "" + Отчество;
		|Иначе
		|     Результат = """";
		|КонецЕсли;";	
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектДанных);
		Исключение 
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
			                                                                      , ОбъектДанных.Наименование
			                                                                      , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
			                         , УровеньЖурналаРегистрации.Ошибка
			                         , МетаданныеХарактеристики			                         
			                         ,
			                         , Комментарий);
		КонецПопытки; 
	КонецЕсли;
	
	Если ДатаДокумента <> Неопределено Тогда
		ОбъектДанных                   = ДатаДокумента.ПолучитьОбъект();
		ОбъектДанных.ТипПараметра      = Перечисления.ТипыПараметровШаблоновОбследований.Динамический;
		ОбъектДанных.АлгоритВычисления = "Результат = Формат(Объект.Дата, ""ДЛФ=Д"")";	
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектДанных);
		Исключение 
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
			                                                                      , ОбъектДанных.Наименование
			                                                                      , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
			                         , УровеньЖурналаРегистрации.Ошибка
			                         , МетаданныеХарактеристики			                         
			                         ,
			                         , Комментарий);
		КонецПопытки; 
	КонецЕсли;
	
	Если ДатаИВремяДокумента <> Неопределено Тогда 	
		ОбъектДанных                   = ДатаИВремяДокумента.ПолучитьОбъект();
		ОбъектДанных.ТипПараметра      = Перечисления.ТипыПараметровШаблоновОбследований.Динамический;
		ОбъектДанных.АлгоритВычисления = "Результат = Формат(Объект.Дата, ""dd.MM.yyyy HH:mm"")";	
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектДанных);
		Исключение 
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
			                                                                      , ОбъектДанных.Наименование
			                                                                      , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
			                         , УровеньЖурналаРегистрации.Ошибка
			                         , МетаданныеХарактеристики			                         
			                         ,
			                         , Комментарий);
		КонецПопытки; 
	КонецЕсли; 
	
	Если КлиентФИО1 <> Неопределено Тогда
		ОбъектДанных                   = КлиентФИО1.ПолучитьОбъект();
		ОбъектДанных.ТипПараметра      = Перечисления.ТипыПараметровШаблоновОбследований.Динамический;
		ОбъектДанных.АлгоритВычисления = "Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		|Фамилия = СокрЛП(Объект.Контрагент.Фамилия);
		|Имя = Лев(СокрЛП(Объект.Контрагент.Имя), 1);
		|Отчество = Лев(СокрЛП(Объект.Контрагент.Отчество), 1);
		|Результат = Фамилия  +"" ""+ Имя + "". "" + Отчество+""."";
		|Иначе
		|    Результат = """";
		|КонецЕсли;";	
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектДанных);
		Исключение 
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
			                                                                      , ОбъектДанных.Наименование
			                                                                      , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
			                         , УровеньЖурналаРегистрации.Ошибка
			                         , МетаданныеХарактеристики			                         
			                         ,
			                         , Комментарий);
		КонецПопытки; 
	КонецЕсли;   
	
	Если КлиентФИО2 <> Неопределено Тогда		
		ОбъектДанных                   = КлиентФИО2.ПолучитьОбъект();
		ОбъектДанных.ТипПараметра      = Перечисления.ТипыПараметровШаблоновОбследований.Динамический;
		ОбъектДанных.АлгоритВычисления = "Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		|Фамилия = СокрЛП(Объект.Контрагент.Фамилия);
		|Имя = СокрЛП(Объект.Контрагент.Имя);
		|Отчество = СокрЛП(Объект.Контрагент.Отчество);
		|Результат = Фамилия  +"" ""+ Имя + "" "" + Отчество;
		|Иначе
		|    Результат = """";
		|КонецЕсли;";	
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектДанных);
		Исключение 
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
			                                                                      , ОбъектДанных.Наименование
			                                                                      , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
			                         , УровеньЖурналаРегистрации.Ошибка
			                         , МетаданныеХарактеристики			                         
			                         ,
			                         , Комментарий);
		КонецПопытки; 
	КонецЕсли; 
	
КонецПроцедуры  

// Процедура - Заполнить настройки отправки сообщений
//
Процедура ЗаполнитьНастройкиОтправкиСообщений() Экспорт
	
	//НастройкиОтправки = Новый Структура;
	//НастройкиОтправки.Вставить("ВремяОтправкиСообщенийС"	, Дата(01,01,01,08,00,00));
	//НастройкиОтправки.Вставить("ВремяОтправкиСообщенийПо"	, Дата(01,01,01,22,00,00)); 
	//
	//Константы.Удалить_НастройкиОтправкиСообщений.УстановитьНастройкиОтправкиСообщений(НастройкиОтправки);	
	
КонецПроцедуры  

// Процедура - Перенести присоединенные файлы клиентов
//
// Параметры:
//  Параметры	 - 	 - 
//
Процедура ПеренестиПрисоединенныеФайлыКлиентов(Параметры = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Порция = 50; //файлы могут быть неприлиных размеров и при выполнении запроса не хватает памяти для получения результата запроса
	
	Пока Порция > 0 Цикл  
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ " + Порция + "
		|	ПрисоединенныеФайлы.ПрисоединенныйФайл КАК ПрисоединенныйФайл,
		|	ПрисоединенныеФайлы.ХранимыйФайл КАК ХранимыйФайл
		|ИЗ
		|	РегистрСведений.ПрисоединенныеФайлы КАК ПрисоединенныеФайлы";
		
		ТаблицаПрисоединенныхФайловКлиентов = Запрос.Выполнить().Выгрузить();
		
		Порция = ТаблицаПрисоединенныхФайловКлиентов.Количество();
		
		Для Каждого СтрокаТЗ Из ТаблицаПрисоединенныхФайловКлиентов Цикл 
			Если ЗначениеЗаполнено(СтрокаТЗ.ПрисоединенныйФайл) Тогда 
				ДвоичныеДанные = СтрокаТЗ.ХранимыйФайл.Получить();
				
				НаборЗаписей = РегистрыСведений.ДвоичныеДанныеФайлов.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Файл.Установить(СтрокаТЗ.ПрисоединенныйФайл);
				
				ЗаписьНабора = НаборЗаписей.Добавить();
				ЗаписьНабора.Файл = СтрокаТЗ.ПрисоединенныйФайл;
				ЗаписьНабора.ДвоичныеДанныеФайла = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
				
				//ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина);
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				
				СтарыйНаборЗаписей = РегистрыСведений.ПрисоединенныеФайлы.СоздатьНаборЗаписей();
				СтарыйНаборЗаписей.Отбор.ПрисоединенныйФайл.Установить(СтрокаТЗ.ПрисоединенныйФайл);
				СтарыйНаборЗаписей.ОбменДанными.Загрузка = Истина;
				
				НачатьТранзакцию();
				Попытка
					НаборЗаписей.Записать();
					СтарыйНаборЗаписей.Записать();
					ЗафиксироватьТранзакцию();
				Исключение
					ОтменитьТранзакцию();
					Порция = Порция - 1;
				КонецПопытки;	
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;

	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Очистить константу заголовок системы
//
Процедура ОчиститьКонстантуЗаголовокСистемы() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Константы.ЗаголовокСистемы.Установить("");
	
КонецПроцедуры

// Процедура, заполняет реквизит "ДатаОкончания" в документах "Событие".
//
Процедура ЗаполнитьДатыОкончанияСобытий(Параметры = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытиеУслуги.Ссылка КАК Ссылка,
	|	МАКСИМУМ(СобытиеУслуги.ДатаОкончания) КАК ДатаОкончания
	|ИЗ
	|	Документ.Событие.Услуги КАК СобытиеУслуги
	|ГДЕ
	|	СобытиеУслуги.ДатаНачала > &ДатаНачала
	|	И НЕ СобытиеУслуги.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытиеУслуги.Ссылка");
	
	Запрос.УстановитьПараметр("ДатаНачала", ТекущаяДатаСеанса() - 3600 * 24 * 365);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			СобытиеОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			Если Не ЗначениеЗаполнено(СобытиеОбъект.ДатаОкончания) Тогда
				СобытиеОбъект.ДатаОкончания	 = Выборка.ДатаОкончания;
				СобытиеОбъект.Записать();
			КонецЕсли;
			
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Создает документ "Закрытие месяца" за прошлые период
//
Процедура ЗакрытиеМесяцаСоздатьЗаПрошлыеПериоды(Параметры = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	#Область ТекстЗапроса
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Прием.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НАЧАЛОПЕРИОДА(МИНИМУМ(Прием.Дата), МЕСЯЦ) КАК ДатаНачала,
	|	КОНЕЦПЕРИОДА(&ТекущаяДата, МЕСЯЦ) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ПериодСЕ
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Проведен = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	Прием.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ВТ_ПериодСЕ.ДатаНачала) КАК ДатаНачала,
	|	МАКСИМУМ(ВТ_ПериодСЕ.ДатаОкончания) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_Период
	|ИЗ
	|	ВТ_ПериодСЕ КАК ВТ_ПериодСЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК Цифра
	|ПОМЕСТИТЬ ТабЦифр
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	2
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	3
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	4
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	5
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	6
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	7
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	8
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	9
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(ВТ_Период.ДатаНачала, МЕСЯЦ, ТабЦифр1.Цифра + 10 * ТабЦифр2.Цифра + 100 * ТабЦифр3.Цифра + 1000 * ТабЦифр4.Цифра) КАК День
	|ПОМЕСТИТЬ ТабДней
	|ИЗ
	|	ТабЦифр КАК ТабЦифр1,
	|	ТабЦифр КАК ТабЦифр2,
	|	ТабЦифр КАК ТабЦифр3,
	|	ТабЦифр КАК ТабЦифр4,
	|	ВТ_Период КАК ВТ_Период
	|ГДЕ
	|	ДОБАВИТЬКДАТЕ(ВТ_Период.ДатаНачала, МЕСЯЦ, ТабЦифр1.Цифра + 10 * ТабЦифр2.Цифра + 100 * ТабЦифр3.Цифра + 1000 * ТабЦифр4.Цифра) <= ВТ_Период.ДатаОкончания
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	День
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабДней.День КАК День,
	|	ВТ_ПериодСЕ.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ СЕТабДней
	|ИЗ
	|	ВТ_ПериодСЕ КАК ВТ_ПериодСЕ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабДней КАК ТабДней
	|		ПО (ТабДней.День >= ВТ_ПериодСЕ.ДатаНачала)
	|			И (ТабДней.День <= ВТ_ПериодСЕ.ДатаОкончания)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЕТабДней.День КАК День,
	|	СЕТабДней.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ИЗ
	|	СЕТабДней КАК СЕТабДней
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
	|		ПО СЕТабДней.День = ЗакрытиеМесяца.МесяцРаспределения
	|			И СЕТабДней.СтруктурнаяЕдиница = ЗакрытиеМесяца.СтруктурнаяЕдиница
	|ГДЕ
	|	ЗакрытиеМесяца.Ссылка ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	День";
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл  
			
			ЗакрытиеМесяцаОбъект = Документы.ЗакрытиеМесяца.СоздатьДокумент();
			
			ЗакрытиеМесяцаОбъект.СтруктурнаяЕдиница = Выборка.СтруктурнаяЕдиница;
			ЗакрытиеМесяцаОбъект.Дата               = Выборка.День;
			ЗакрытиеМесяцаОбъект.МесяцРаспределения = Выборка.день;
			
			Попытка
				ЗакрытиеМесяцаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
				,УровеньЖурналаРегистрации.Ошибка
				,
				,
				,СтрШаблон("Документ ""Закрытие месяца"" за %1, клиника %2, не удалось провести: ", Формат(Выборка.День, "ДФ='ММММ гггг'"), Выборка.СтруктурнаяЕдиница) + ОписаниеОшибки());						
			КонецПопытки;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;	
	
КонецПроцедуры 

// Процедура - Заполняет реквизит УИД в событиях с датой больше текущей.
//
Процедура ЗаполнитьРеквизитУИДВБудущихСобытиях(Параметры = Неопределено) Экспорт

	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Событие.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.Дата > &Дата");
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			СобытиеОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			Если НЕ СобытиеОбъект = Неопределено Тогда
				
				СобытиеОбъект.УИД = "" + Выборка.Ссылка.УникальныйИдентификатор();	
				
				СобытиеОбъект.ДополнительныеСвойства.Вставить("ОбменДаннымиЗагрузка", Истина);			
				СобытиеОбъект.Записать(РежимЗаписиДокумента.Запись);
				
			КонецЕсли;
			
		Исключение 
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Заполнение реквизита УИД в будущих событиях."
																	, УровеньЖурналаРегистрации.Ошибка, 
																	, Выборка.Ссылка
																	, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		КонецПопытки;
				
	КонецЦикла;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура, заполняет аватары сотрудников в регистре "АктивныеПользователиМессенджер".
//
Процедура АктуализироватьАватарыСотрудников(Параметры = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.ФайлКартинки КАК ФайлКартинки
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ФайлКартинки <> ЗНАЧЕНИЕ(Справочник.Файлы.ПустаяСсылка)
	|	И НЕ Сотрудники.ПометкаУдаления
	|	И НЕ Сотрудники.Служебный
	|	И НЕ Сотрудники.ЭтоГруппа");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		РегистрыСведений.АктивныеПользователиМессенджер.ОбновитьАватарСотрудника(Выборка.Ссылка, Выборка.ФайлКартинки);
	КонецЦикла;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура, Обновляет внешнюю систему IP-Телефонии в CRM, дозаписывая Оператора IP-телефонии (Для статистики).
//
Процедура ОбновитьИДозаполнитьВнешниеСистемыIPТелефонииВCRM(Параметры = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Попытка
	
		МассивИсключаемыхДрайверов = Новый Массив;
		МассивИсключаемыхДрайверов.Добавить(Справочники.ДрайверыОборудования.ДрайверВедисофтПростыеЗвонки);
		МассивИсключаемыхДрайверов.Добавить(Справочники.ДрайверыОборудования.ДрайверХеликсOKTELL);
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВнешниеСистемы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
		|ГДЕ
		|	НЕ ВнешниеСистемы.ПометкаУдаления
		|	И ВнешниеСистемы.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.IPТелефония)
		|	И ВнешниеСистемы.Используется
		|	И ВнешниеСистемы.Синхронизирована
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПодключаемоеОборудование.ДрайверОборудования.ИмяПредопределенныхДанных КАК НаименованиеДрайвера
		|ИЗ
		|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|ГДЕ
		|	НЕ ПодключаемоеОборудование.ПометкаУдаления
		|	И ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.IPТелефония)
		|	И ПодключаемоеОборудование.УстройствоИспользуется		
		|	И НЕ ПодключаемоеОборудование.ДрайверОборудования В (&МассивИсключаемыхДрайверов)");
		
		Запрос.УстановитьПараметр("МассивИсключаемыхДрайверов", МассивИсключаемыхДрайверов);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();	
		ВыборкаВС = РезультатЗапроса[0].Выбрать();
		ВыборкаОборудование = РезультатЗапроса[1].Выгрузить(); 
		
		ОператорIPТелефонии = "";
		
		Если ЗначениеЗаполнено(ВыборкаОборудование) Тогда
			
			НаименованиеДрайвера = ВыборкаОборудование[0].НаименованиеДрайвера;			
			ОператорIPТелефонии = СтрЗаменить(НаименованиеДрайвера, "ДрайверХеликс", "");
			
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(ОператорIPТелефонии) Тогда
			Возврат;
		КонецЕсли;
		
		УИДТекущейСессии = ЛичныйКабинет.УидТекущейСессии();
		
		ДопПараметры = Новый Структура("operator_IP_telephony", ОператорIPТелефонии); 
		
		Пока ВыборкаВС.Следующий() Цикл			
			ЛичныйКабинет.ОбновитьДанныеПубликацииВнешнейСистемы(ВыборкаВС.Ссылка, Истина, УИДТекущейСессии, ДопПараметры);	
		КонецЦикла;
	
	Исключение
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Обновление внешней системы IP-Телефонии в CRM."
															    , УровеньЖурналаРегистрации.Предупреждение
																,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры  

// Процедура, Перезаписывает значения диагнозов строкового типа.
//
Процедура ПерезаписатьЗначенияДиагнозовВПараметрахОбследований(Параметры = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗначенияПараметровОбследований.Значение КАК Значение,
	|	ЗначенияПараметровОбследований.Документ КАК Документ,
	|	ЗначенияПараметровОбследований.Зуб КАК Зуб,
	|	ЗначенияПараметровОбследований.ШаблонОбследования КАК ШаблонОбследования,
	|	ЗначенияПараметровОбследований.Параметр КАК Параметр
	|ИЗ
	|	РегистрСведений.ЗначенияПараметровОбследований КАК ЗначенияПараметровОбследований
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ЗначенияПараметровОбследований.Значение) <> ТИП(Справочник.Диагнозы)
	|	И ЗначенияПараметровОбследований.Значение В
	|			(ВЫБРАТЬ
	|				Диагнозы.Наименование КАК Наименование
	|			ИЗ
	|				Справочник.Диагнозы КАК Диагнозы)
	|	И ЗначенияПараметровОбследований.Параметр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПараметрыОбследований.Диагноз)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ"); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НаборЗаписей = РегистрыСведений.ЗначенияПараметровОбследований.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Параметр.Значение                = Выборка.Параметр;
		НаборЗаписей.Отбор.Параметр.Использование           = Истина; 
		НаборЗаписей.Отбор.Документ.Значение                = Выборка.Документ;
		НаборЗаписей.Отбор.Документ.Использование           = Истина;
		НаборЗаписей.Отбор.Зуб.Значение                     = Выборка.Зуб;
		НаборЗаписей.Отбор.Зуб.Использование                = Истина;
		НаборЗаписей.Отбор.ШаблонОбследования.Значение      = Выборка.ШаблонОбследования;
		НаборЗаписей.Отбор.ШаблонОбследования.Использование = Истина; 
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0 Тогда
			Диагноз                  = Справочники.Диагнозы.НайтиПоНаименованию(Выборка.Значение);
			НаборЗаписей[0].Значение = ?(ЗначениеЗаполнено(Диагноз), Диагноз, Выборка.Значение); 		
			Попытка 
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			Исключение 
				ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Не удалось перезаписать значение параметра обследования " + 
				                                                         Выборка.Значение + " документа " + Строка(Выборка.Документ)    
															             , УровеньЖурналаРегистрации.Ошибка
																         ,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

			КонецПопытки;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Обновление параметров закрытия диалогов внешних систем мессенджеров
//
Процедура ОбновлениеПараметровЗакрытияДиалоговВнешнихСистемМессенджеров() Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВнешниеСистемы.Ссылка КАК Ссылка,
	|	ВнешниеСистемы.Параметры КАК Параметры
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы В (ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.GreenApi), ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Telegram), ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Viber))");
	
	ВыборкаМессенджеров = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаМессенджеров.Следующий() Цикл
		ПараметрыВнешнейСистемы = ВыборкаМессенджеров.Параметры.Получить();
		Если НЕ ЗначениеЗаполнено(ПараметрыВнешнейСистемы) ИЛИ НЕ ТипЗнч(ПараметрыВнешнейСистемы) = Тип("Структура") Тогда 
			Продолжить;
		КонецЕсли;
		ВремяЗакрытияОткрытогоДиалога = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВнешнейСистемы, "ВремяЗакрытияОткрытогоДиалога", 0);	
		ВремяЗакрытияОтложенногоДиалога = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВнешнейСистемы, "ВремяЗакрытияОтложенногоДиалога", 0);
		НеобходимоЗаписать = Истина;
		Если ВремяЗакрытияОткрытогоДиалога = 0 Тогда 
			ПараметрыВнешнейСистемы.Вставить("ВремяЗакрытияОткрытогоДиалога", 4*60*60);
		ИначеЕсли ВремяЗакрытияОткрытогоДиалога < (2*60*60) Тогда
			ПараметрыВнешнейСистемы.Вставить("ВремяЗакрытияОткрытогоДиалога", (2*60*60));
		ИначеЕсли ВремяЗакрытияОткрытогоДиалога > (4*60*60) Тогда
			ПараметрыВнешнейСистемы.Вставить("ВремяЗакрытияОткрытогоДиалога", (4*60*60));
		Иначе 
			НеобходимоЗаписать = Ложь;
		КонецЕсли;	
		Если ВремяЗакрытияОтложенногоДиалога = 0 Тогда 
			ПараметрыВнешнейСистемы.Вставить("ВремяЗакрытияОтложенногоДиалога", 24*60*60);
		ИначеЕсли ВремяЗакрытияОтложенногоДиалога < (2*60*60) Тогда
			ПараметрыВнешнейСистемы.Вставить("ВремяЗакрытияОтложенногоДиалога", (2*60*60));
		ИначеЕсли ВремяЗакрытияОтложенногоДиалога > (24*60*60) Тогда
			ПараметрыВнешнейСистемы.Вставить("ВремяЗакрытияОтложенногоДиалога", (24*60*60));
		Иначе 
			НеобходимоЗаписать = ?(НеобходимоЗаписать, НеобходимоЗаписать, Ложь);
		КонецЕсли;	

		Если НЕ НеобходимоЗаписать Тогда 
			Продолжить;
		КонецЕсли;
		
		ВнешняяСистемаОбъект = ВыборкаМессенджеров.Ссылка.ПолучитьОбъект();
		ВнешняяСистемаОбъект.Параметры = Новый ХранилищеЗначения(ПараметрыВнешнейСистемы);
		Попытка		
			ВнешняяСистемаОбъект.Записать();
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(
			"ОбновлениеПараметровВнешнихСистемWhatsApp",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.ВнешниеСистемы,
			ВыборкаМессенджеров.Ссылка,
			НСтр("ru = 'Не удалось обновить параметры внешней системы WhatsApp. Текст ошибки: '") + ОписаниеОшибки
			);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Процедура - заполнение реквизита для кассы.
//
Процедура ЗаполнениеРеквизитаДляКассы(Параметры = Неопределено) Экспорт
	
	// Были добавлены 4 вида операции и 4 вида статей доходов и расходов,
	// для каждого из них необходимо прописать соответствие.

	Если НЕ ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ВыбытиеВОперационнуюКассу.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ВыбытиеВОперационнуюКассу;                          	
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.СдачаРозничнойВыручкиВКассуПредприятия.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.СдачаРозничнойВыручкиВКассуПредприятия;	
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ПоступлениеИзКассыПредприятия.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ПоступлениеИзКассыПредприятия;
	СтатьяОбъект.Записать();
	
	СтатьяОбъект                        = Справочники.СтатьиДоходовИРасходов.ПоступлениеРозничнойВыручкиИзОперационнойКассы.ПолучитьОбъект();
	СтатьяОбъект.ПоУмолчаниюДляОперации = Перечисления.ВидыОпераций.ПоступлениеРозничнойВыручкиИзОперационнойКассы;
	СтатьяОбъект.Записать();           
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Кассы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	НЕ Кассы.ЭтоГруппа
	|	И НЕ Кассы.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл   
		
		КассаСсылка = Выборка.Ссылка.ПолучитьОбъект();
		КассаСсылка.ВыемкаИзКассы = Перечисления.ВидыОпераций.СдачаНаличныхВБанк;
		КассаСсылка.ТипКассы = Перечисления.ТипыКасс.ОперационнаяКасса;
		
		Попытка 
			КассаСсылка.Записать();
		Исключение   
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Заполнение реквизита для кассы."
																	, УровеньЖурналаРегистрации.Ошибка, 
																	, Выборка.Ссылка
																	, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;


КонецПроцедуры               

// Процедура - Обновить настройки дат приема и увольнения сотрудников.
//
// Параметры:
//  Параметры	 - 	 - 
//
Процедура ОбновитьНастройкиДатПриемаИУвольненияСотрудников(Параметры = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПользователей.Пользователь КАК Пользователь,
	|	НастройкиПользователей.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА НастройкиПользователей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ДатаПриема)
	|			ТОГДА НастройкиПользователей.Значение
	|	КОНЕЦ КАК ДатаПриема,
	|	ВЫБОР
	|		КОГДА НастройкиПользователей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ДатаУвольнения)
	|			ТОГДА НастройкиПользователей.Значение
	|	КОНЕЦ КАК ДатаУвольнения
	|ПОМЕСТИТЬ ВТДатыПриемаИУвольнений
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Настройка В (ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ДатаПриема), ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ДатаУвольнения))
	|	И НастройкиПользователей.Значение <> ДАТАВРЕМЯ(1, 1, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТДатыПриемаИУвольнений.Пользователь ССЫЛКА Справочник.Сотрудники
	|			ТОГДА ВТДатыПриемаИУвольнений.Пользователь
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВЫРАЗИТЬ(ВТДатыПриемаИУвольнений.Пользователь КАК Справочник.Пользователи).Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|					ТОГДА ВЫРАЗИТЬ(ВТДатыПриемаИУвольнений.Пользователь КАК Справочник.Пользователи).Сотрудник
	|			КОНЕЦ
	|	КОНЕЦ КАК Сотрудник,
	|	ВТДатыПриемаИУвольнений.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	МАКСИМУМ(ВТДатыПриемаИУвольнений.ДатаПриема) КАК ДатаПриема,
	|	МАКСИМУМ(ВТДатыПриемаИУвольнений.ДатаУвольнения) КАК ДатаУвольнения
	|ИЗ
	|	ВТДатыПриемаИУвольнений КАК ВТДатыПриемаИУвольнений
	|ГДЕ
	|	НЕ ВЫБОР
	|				КОГДА ВТДатыПриемаИУвольнений.Пользователь ССЫЛКА Справочник.Сотрудники
	|					ТОГДА ВТДатыПриемаИУвольнений.Пользователь
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВЫРАЗИТЬ(ВТДатыПриемаИУвольнений.Пользователь КАК Справочник.Пользователи).Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|							ТОГДА ВЫРАЗИТЬ(ВТДатыПриемаИУвольнений.Пользователь КАК Справочник.Пользователи).Сотрудник
	|					КОНЕЦ
	|			КОНЕЦ ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ВТДатыПриемаИУвольнений.Пользователь ССЫЛКА Справочник.Сотрудники
	|			ТОГДА ВТДатыПриемаИУвольнений.Пользователь
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВЫРАЗИТЬ(ВТДатыПриемаИУвольнений.Пользователь КАК Справочник.Пользователи).Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|					ТОГДА ВЫРАЗИТЬ(ВТДатыПриемаИУвольнений.Пользователь КАК Справочник.Пользователи).Сотрудник
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВТДатыПриемаИУвольнений.СтруктурнаяЕдиница";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.НастройкиСотрудников.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Сотрудник = Выборка.Сотрудник; 
		МенеджерЗаписи.СтруктурнаяЕдиница = Выборка.СтруктурнаяЕдиница;
		
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			
			МенеджерЗаписи.ДатаПриема 		= Выборка.ДатаПриема;
			МенеджерЗаписи.ДатаУвольнения 	= Выборка.ДатаУвольнения;
				
		Иначе 
			
			МенеджерЗаписи = РегистрыСведений.НастройкиСотрудников.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка); 			
		КонецЕсли;
		
		Попытка 
			МенеджерЗаписи.Записать();
		Исключение     	
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Обновление настроек сотрудников."
			, УровеньЖурналаРегистрации.Ошибка, 
			, Выборка.Ссылка
			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Перенести данные из ТЧВРегистр сведений нормы списания материалов
//
Процедура ПеренестиДанныеИзТЧВРегистрСведенийНормыСписанияМатериалов(Параметры = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) КАК СтруктурнаяЕдиница,
		|	НоменклатураНормыСписанияМатериалов_Удалить.Ссылка КАК Номенклатура,
		|	НоменклатураНормыСписанияМатериалов_Удалить.НСМНоменклатура КАК Материал,
		|	НоменклатураНормыСписанияМатериалов_Удалить.НСМПартия КАК Партия,
		|	ЛОЖЬ КАК НормыСписанияНеИспользуются,
		|	НоменклатураНормыСписанияМатериалов_Удалить.НСМВключатьВСтоимость КАК ВключатьВСтоимостьУслуги,
		|	ИСТИНА КАК НеЗависитОтКоличестваУслуг,
		|	НЕОПРЕДЕЛЕНО КАК СкладСписания,
		|	НоменклатураНормыСписанияМатериалов_Удалить.НСМВидЦен КАК ВидЦен,
		|	НоменклатураНормыСписанияМатериалов_Удалить.НСМУпаковка КАК Упаковка,
		|	СУММА(НоменклатураНормыСписанияМатериалов_Удалить.НСМКоличество) КАК Количество
		|ИЗ
		|	Справочник.Номенклатура.НормыСписанияМатериалов_Удалить КАК НоменклатураНормыСписанияМатериалов_Удалить
		|
		|СГРУППИРОВАТЬ ПО
		|	НоменклатураНормыСписанияМатериалов_Удалить.НСМВключатьВСтоимость,
		|	НоменклатураНормыСписанияМатериалов_Удалить.НСМНоменклатура,
		|	НоменклатураНормыСписанияМатериалов_Удалить.НСМПартия,
		|	НоменклатураНормыСписанияМатериалов_Удалить.НСМВидЦен,
		|	НоменклатураНормыСписанияМатериалов_Удалить.Ссылка,
		|	НоменклатураНормыСписанияМатериалов_Удалить.НСМУпаковка";
	
	// Для корректного перехода со старой версии на новую.
	// Добавлено на всякий случай!
	Если НЕ Метаданные.Справочники.Номенклатура.ТабличныеЧасти.НормыСписанияМатериалов_Удалить.Реквизиты.Найти("НСМВидЦен_OLD") = Неопределено Тогда
		
		ПодстрокаЗамены = "ЕСТЬNULL(НоменклатураНормыСписанияМатериалов_Удалить.НСМВидЦен_OLD.Ссылка, НоменклатураНормыСписанияМатериалов_Удалить.НСМВидЦен)";		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НоменклатураНормыСписанияМатериалов_Удалить.НСМВидЦен", ПодстрокаЗамены);
		
	КонецЕсли;
		
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей = РегистрыСведений.НормыСписанияМатериалов.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(РезультатЗапроса);                                                  
	
	Попытка
		
		НаборЗаписей.Записать();
		
	Исключение
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Обновление настроек сотрудников."
																 , УровеньЖурналаРегистрации.Ошибка, ,
																 , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура, синхронизирует структурные единицы задач.
//
Процедура СинхронизироватьСтруктурныеЕдиницыЗадач(Параметры = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Взаимодействие.Ссылка КАК Задача,
	|	Взаимодействие.Сделка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ИЗ
	|	Задача.Взаимодействие КАК Взаимодействие
	|ГДЕ
	|	Взаимодействие.СтруктурнаяЕдиница <> Взаимодействие.Сделка.СтруктурнаяЕдиница
	|	И НЕ Взаимодействие.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Взаимодействие.Ссылка,
	|	Взаимодействие.ЗадачаПредмет.СтруктурнаяЕдиница
	|ИЗ
	|	Задача.Взаимодействие КАК Взаимодействие
	|ГДЕ
	|	Взаимодействие.ЗадачаПредмет ССЫЛКА Справочник.Заявки
	|	И Взаимодействие.СтруктурнаяЕдиница <> ВЫРАЗИТЬ(Взаимодействие.ЗадачаПредмет КАК Справочник.Заявки).СтруктурнаяЕдиница
	|	И Взаимодействие.Сделка = ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
	|	И НЕ Взаимодействие.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Взаимодействие.Ссылка,
	|	Взаимодействие.ЗадачаПредмет.СтруктурнаяЕдиница
	|ИЗ
	|	Задача.Взаимодействие КАК Взаимодействие
	|ГДЕ
	|	Взаимодействие.ЗадачаПредмет ССЫЛКА Документ.Реализация
	|	И Взаимодействие.СтруктурнаяЕдиница <> ВЫРАЗИТЬ(Взаимодействие.ЗадачаПредмет КАК Документ.Реализация).СтруктурнаяЕдиница
	|	И Взаимодействие.Сделка = ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
	|	И НЕ Взаимодействие.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Взаимодействие.Ссылка,
	|	Взаимодействие.ЗадачаПредмет.СтруктурнаяЕдиница
	|ИЗ
	|	Задача.Взаимодействие КАК Взаимодействие
	|ГДЕ
	|	Взаимодействие.ЗадачаПредмет ССЫЛКА Документ.Прием
	|	И Взаимодействие.СтруктурнаяЕдиница <> ВЫРАЗИТЬ(Взаимодействие.ЗадачаПредмет КАК Документ.Прием).СтруктурнаяЕдиница
	|	И Взаимодействие.Сделка = ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
	|	И НЕ Взаимодействие.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Взаимодействие.Ссылка,
	|	Взаимодействие.ЗадачаПредмет.СтруктурнаяЕдиница
	|ИЗ
	|	Задача.Взаимодействие КАК Взаимодействие
	|ГДЕ
	|	Взаимодействие.ЗадачаПредмет ССЫЛКА Документ.ПланЛечения
	|	И Взаимодействие.СтруктурнаяЕдиница <> ВЫРАЗИТЬ(Взаимодействие.ЗадачаПредмет КАК Документ.ПланЛечения).СтруктурнаяЕдиница
	|	И Взаимодействие.Сделка = ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
	|	И НЕ Взаимодействие.ПометкаУдаления");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			ЗадачаОбъект					 = Выборка.Задача.ПолучитьОбъект();
			ЗадачаОбъект.СтруктурнаяЕдиница	 = Выборка.СтруктурнаяЕдиница;
			ЗадачаОбъект.ДополнительныеСвойства.Вставить("НеСинхронизироватьСтруктурнуюЕдиницу", Истина);
			ЗадачаОбъект.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Обновить эквайринги и кассы
//
Процедура ОбновитьЭквайрингиИКассы() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(                              
	"ВЫБРАТЬ
	|	Кассы.Ссылка КАК Ссылка,
	|	Кассы.СтруктурнаяЕдиница.Организация КАК Организация
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	Кассы.ПометкаУдаления = ЛОЖЬ");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Организация) Тогда
			
			ОбъектКасса = Выборка.Ссылка.ПолучитьОбъект(); 
			
			Если ОбъектКасса <> Неопределено Тогда
				
				ОбъектКасса.Организация = Выборка.Организация;
				
				Попытка
					ОбъектКасса.Записать();
				Исключение
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	МенеджерОборудованияВызовСервераПереопределяемый.ОбновитьПоставляемыеДрайвера();
			
	Запрос = Новый Запрос(                              
	"ВЫБРАТЬ
	|	Кассы.Ссылка КАК СсылкаКасса,
	|	Кассы.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	Кассы.ПометкаУдаления = ЛОЖЬ
	|	И Кассы.ЭквайринговыйТерминал <> ЗНАЧЕНИЕ(Справочник.ЭквайринговыеТерминалы.ПустаяСсылка)");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		КассаОбъект = Выборка.СсылкаКасса.ПолучитьОбъект();
		
		КассаОбъект.ЭквайринговыеТерминалы.Очистить();
		
		НоваяСтрока							= КассаОбъект.ЭквайринговыеТерминалы.Добавить();
		НоваяСтрока.ЭквайринговыйТерминал	= Выборка.ЭквайринговыйТерминал;
		НоваяСтрока.Основной				= Истина;
		
		Попытка	
			КассаОбъект.Записать();			
		Исключение 
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());			
		КонецПопытки;
		
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЭквайринговыеТерминалы.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ЭквайринговыеТерминалы.ТипБанка <> ЗНАЧЕНИЕ(Перечисление.ПлатежныеШлюзы.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЭквайринговыхТерминалов.Онлайн)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЭквайринговыхТерминалов.Торговый)
	|	КОНЕЦ КАК ТипЭквайринга
	|ИЗ
	|	Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы");
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТЗ Из РезультатЗапроса Цикл
		
		ОбъектЭТ				= СтрокаТЗ.Ссылка.ПолучитьОбъект();
		ОбъектЭТ.ТипЭквайринга	= СтрокаТЗ.ТипЭквайринга;
		
		ЭтоОнлайн	= ОбъектЭТ.ТипЭквайринга = ПредопределенноеЗначение("Перечисление.ТипыЭквайринговыхТерминалов.Онлайн");
		ЭтоТорговый	= ОбъектЭТ.ТипЭквайринга = ПредопределенноеЗначение("Перечисление.ТипыЭквайринговыхТерминалов.Торговый"); 
		
		Если ОбъектЭТ.ТипЭквайринга = Перечисления.ТипыЭквайринговыхТерминалов.Онлайн Тогда
			ОбъектЭТ.ПодключаемоеОборудование				= Неопределено;	
		    ОбъектЭТ.ИспользоватьБезПодключенияОборудования = Истина;      
		Иначе
			ОбъектЭТ.ТипФискализации			= Перечисления.ТипыФискализации.НеФискализировать;
			ОбъектЭТ.ТипБанка					= Неопределено;
			ОбъектЭТ.ИспользоватьОплатуПоСсылке = Ложь;
			ОбъектЭТ.КассовыйСервер				= Неопределено;
		КонецЕсли;

		Попытка
			ОбъектЭТ.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура, обновляет содержание шаблонов сообщений для мессенджера.
//
Процедура ОбновитьСодержаниеШаблоновСообщенийМессенджера() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ШаблоныСообщений.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|ГДЕ
	|	НЕ ШаблоныСообщений.ПометкаУдаления
	|	И НЕ ШаблоныСообщений.ЭтоГруппа");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			ШаблонОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ШаблонОбъект.ДополнительныеСвойства.Вставить("ОбновитьСодержаниеМессенджер", Истина);
			ШаблонОбъект.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура, обновляет предопределенные элементы плана видов характеристик "ПараметрыОбследований".
//
Процедура ИспарвитьЗаписиРегистраСведенийДокументыФизическихЛиц(Параметры = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли; 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДокументыФизическихЛиц.Физлицо КАК Физлицо,
	|	ДокументыФизическихЛиц.ВидДокумента КАК ВидДокумента,
	|	ДокументыФизическихЛиц.Серия КАК Серия,
	|	ДокументыФизическихЛиц.Номер КАК Номер,
	|	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачи,
	|	ДокументыФизическихЛиц.СрокДействия КАК СрокДействия,
	|	ДокументыФизическихЛиц.КемВыдан КАК КемВыдан,
	|	ДокументыФизическихЛиц.КодПодразделения КАК КодПодразделения,
	|	ДокументыФизическихЛиц.ЯвляетсяДокументомУдостоверяющимЛичность КАК ЯвляетсяДокументомУдостоверяющимЛичность,
	|	ДокументыФизическихЛиц.Представление КАК Представление,
	|	ДокументыФизическихЛиц.УдалитьВидДокумента КАК УдалитьВидДокумента
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	|ГДЕ
	|	НЕ ДокументыФизическихЛиц.ЯвляетсяДокументомУдостоверяющимЛичность
	|	И (ДокументыФизическихЛиц.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
	|			ИЛИ ДокументыФизическихЛиц.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.СНИЛС))");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи              = РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Физлицо      = Выборка.Физлицо; 
		МенеджерЗаписи.ВидДокумента = Выборка.ВидДокумента;		
		МенеджерЗаписи.Прочитать();		
		
		Если МенеджерЗаписи.Выбран() Тогда 		
			
			МенеджерЗаписи.ЯвляетсяДокументомУдостоверяющимЛичность	= Истина;		
			
			Попытка
				МенеджерЗаписи.Записать();
			Исключение	
				ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Не удалось перезаписать значение регистра сведений ""Документы физических лиц""", УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
			КонецПопытки;
																	 
		КонецЕсли;
		
	КонецЦикла;	
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
		
КонецПроцедуры  

// Процедура, заполняет регистр СтатусыСообщений на основе регистра СтатусыСообщений_Удалить.
//
Процедура ЗаполнитьРегистрСтатусыСообщений(Параметры = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтатусыСообщений_УДАЛИТЬ.КлючСтроки КАК КлючСтроки,
	|	СтатусыСообщений_УДАЛИТЬ.РассылкаСообщений КАК РассылкаСообщений,
	|	СтатусыСообщений_УДАЛИТЬ.СтатусДействия КАК СтатусДействия,
	|	СтатусыСообщений_УДАЛИТЬ.СтатусСообщения КАК СтатусСообщения,
	|	СтатусыСообщений_УДАЛИТЬ.ТекстСообщения КАК ТекстСообщения,
	|	СтатусыСообщений_УДАЛИТЬ.СтадияДоставки КАК СтадияДоставки,
	|	СтатусыСообщений_УДАЛИТЬ.СервисРассылки КАК СервисРассылки,
	|	СтатусыСообщений_УДАЛИТЬ.ДатаУстановкиСтатуса КАК ДатаУстановкиСтатуса,
	|	СтатусыСообщений_УДАЛИТЬ.ДатаОтправки КАК ДатаОтправки,
	|	СтатусыСообщений_УДАЛИТЬ.IDСообщения КАК IDСообщения,
	|	СтатусыСообщений_УДАЛИТЬ.НомерТелефона КАК НомерТелефона,
	|	СтатусыСообщений_УДАЛИТЬ.Получатель КАК Получатель
	|ИЗ
	|	РегистрСведений.СтатусыСообщений_УДАЛИТЬ.СрезПоследних(, НЕ РассылкаСообщений.Ссылка ЕСТЬ NULL) КАК СтатусыСообщений_УДАЛИТЬ");
		
	Попытка
		
		ИтоговаяТЗ = Запрос.Выполнить().Выгрузить();
		
		Если ЗначениеЗаполнено(ИтоговаяТЗ) Тогда
			
			НаборЗаписей = РегистрыСведений.СтатусыСообщений.СоздатьНаборЗаписей();						
			НаборЗаписей.Загрузить(ИтоговаяТЗ);
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
			
		КонецЕсли;
		
	Исключение
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
		"Заполнение регистра СтатусыСообщений из регистра СтатусыСообщий_Удалить"
		, УровеньЖурналаРегистрации.Ошибка
		,,, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));
		
	КонецПопытки;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;

КонецПроцедуры

// Процедура, осуществляет копирование данных из реквизитов и объектов с префиксом "_OLD" в аналогичные без префикса.
//
Процедура ОбновитьДанныеПриПереходеСоСтаройВерсииНаНовую(Параметры = Неопределено) Экспорт 

	// При обновлении часть реквизитов и объектов в старой стоматологии
	// не сопоставляются с объектами новой стоматологии.
	// Для этого были скопированы проблемные реквизиты и объекты и помечены префиксом "_OLD".
	// Так же некоторые объекты сопоставляются неправильно.
	// Для решения проблемы эти объекты были скопированы, а прежние помечены префиксом "_УДАЛИТЬ".
	
	Если НЕ ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

#Область Обработка_Ролей

	// Выравнивание.
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка,
	|	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И Пользователи.ЭтоПользовательИБ
	|	И НЕ Пользователи.Служебный");
		
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.ИдентификаторПользователяИБ) Тогда
			Продолжить;
		КонецЕсли;
		
		СвойстваПользователя = Пользователи.СвойстваПользователяИБ(Выборка.ИдентификаторПользователяИБ);		
		
		ВозвращенаСтруктура = (ТипЗнч(СвойстваПользователя) = Тип("Структура"));
		Если НЕ ВозвращенаСтруктура ИЛИ (ВозвращенаСтруктура И НЕ СвойстваПользователя.Свойство("Роли")) Тогда
			Продолжить;	
		КонецЕсли;
		
		ЭтоПользовательИБ = (НЕ СвойстваПользователя.Роли.Найти("БазовыеПрава") = Неопределено
							И НЕ СвойстваПользователя.Роли.Найти("БазовыеПраваБСП") = Неопределено);
		
		ЭтоАдминБД  = (НЕ СвойстваПользователя.Роли.Найти("Администрирование") = Неопределено 
					  И НЕ СвойстваПользователя.Роли.Найти("ПолныеПрава") = Неопределено);
					  
		Если ЭтоПользовательИБ ИЛИ ЭтоАдминБД Тогда
			
			ПользовательОбъект = Выборка.Ссылка.ПолучитьОбъект();						
			
			СвойстваПользователя.Вставить("ВходВПрограммуРазрешен", ИСТИНА);		
			
			Если ЭтоПользовательИБ Тогда
				СвойстваПользователя.Роли.Добавить("БазовыеПрава");
			Иначе
				СвойстваПользователя.Роли.Добавить("АдминистраторСистемы");	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.ИдентификаторПользователяИБ) Тогда
				СвойстваПользователя.Вставить("УникальныйИдентификатор", Выборка.ИдентификаторПользователяИБ);
			КонецЕсли;
			СвойстваПользователя.Вставить("Действие", "Записать");
			
			ПользовательОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", СвойстваПользователя);
			
			Попытка			
				ПользовательОбъект.Записать();				
			Исключение
				ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
				"Обновление данных при переходе с версии 1.0 на 2.1, обработка ролей пользователей"
				, УровеньЖурналаРегистрации.Ошибка
				,, Выборка.Ссылка, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));		
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЦикла;
	
#КонецОбласти	
		
#Область Обработка_Констант

	// Выравнивание.
	
	Если ЗначениеЗаполнено(Константы.ВерсияКлассификатораБанковРФ_OLD.Получить())
		И НЕ ЗначениеЗаполнено(Константы.ВерсияКлассификатораБанков.Получить().Получить()) Тогда
		
		СведенияОКлассификаторе = Новый Структура;
		СведенияОКлассификаторе.Вставить("ДатаМодификации", ТекущаяУниверсальнаяДата());
		СведенияОКлассификаторе.Вставить("ДатаЗагрузки", ТекущаяДатаСеанса());
		
		Попытка
			Константы.ВерсияКлассификатораБанков.Установить(Новый ХранилищеЗначения(СведенияОКлассификаторе));
		Исключение
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"Обновление данных при переходе с версии 1.0 на 2.1, обработка константы ВерсияКлассификатораБанковРФ_OLD"
			, УровеньЖурналаРегистрации.Ошибка
			,, Выборка.Ссылка, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));	
		КонецПопытки;
		
	КонецЕсли;

#КонецОбласти

#Область Обработка_Справочников

	// Выравнивание.
	
	Запрос = Новый Запрос( 
	"ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	(ВидыКонтактнойИнформации.ХранитьИсториюИзменений_OLD = ИСТИНА
	|			ИЛИ ВидыКонтактнойИнформации.ТолькоНациональныйАдрес_OLD = ИСТИНА
	|			ИЛИ ВидыКонтактнойИнформации.ПроверятьКорректность_OLD = ИСТИНА
	|			ИЛИ ВидыКонтактнойИнформации.ВключатьСтрануВПредставление_OLD = ИСТИНА
	|			ИЛИ ВидыКонтактнойИнформации.ВидРедактирования_OLD <> """")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Кассы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	НЕ Кассы.ФорматТелефонногоНомераДляОтправкиЭлектронныхЧековККМ_OLD = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	(НЕ Организации.СистемаНалогообложенияДляАвансов_OLD = ЗНАЧЕНИЕ(Перечисление.ТипыСистемНалогообложенияККТ.ПустаяСсылка)
	|			ИЛИ НЕ Организации.СистемаНалогообложенияДляТоваров_OLD = ЗНАЧЕНИЕ(Перечисление.ТипыСистемНалогообложенияККТ.ПустаяСсылка)
	|			ИЛИ НЕ Организации.СтавкаНДСДляАвансов_OLD = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Специализации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Специализации КАК Специализации
	|ГДЕ
	|	Специализации.СтоматологическиеУслуги_OLD = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраныМира.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтраныМира КАК СтраныМира
	|ГДЕ
	|	(СтраныМира.УчастникЕАЭС_OLD = ИСТИНА
	|			ИЛИ СтраныМира.МеждународноеНаименование_OLD <> """")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодключаемоеОборудование.Ссылка КАК Ссылка,
	|	ПодключаемоеОборудование.УстройствоОтключено КАК УстройствоОтключено,
	|	ПодключаемоеОборудование.ОбработчикДрайвера_Удалить КАК ОбработчикДрайвера_Удалить,
	|	ЕСТЬNULL(ПодключаемоеОборудование.ТипОборудования, ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ПустаяСсылка)) КАК ТипОборудования,
	|	ПодключаемоеОборудование.ОбработчикДрайвера_Удалить.Порядок КАК ОбработчикДрайвера_УдалитьПорядок
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.ДрайверОборудования.Ссылка ЕСТЬ NULL
	|	И НЕ ПодключаемоеОборудование.ОбработчикДрайвера_Удалить = ЗНАЧЕНИЕ(Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыМедицинскихКарт.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыМедицинскихКарт КАК ВидыМедицинскихКарт
	|ГДЕ
	|	(ВидыМедицинскихКарт.ПечатнаяФорма = ЗНАЧЕНИЕ(Перечисление.ПечатныеФормыМедицинскихКарт.АмбулаторнаяКарта_043_У_СССР_А4_OLD)
	|			ИЛИ ВидыМедицинскихКарт.ПечатнаяФорма = ЗНАЧЕНИЕ(Перечисление.ПечатныеФормыМедицинскихКарт.АмбулаторнаяКарта_043_У_СССР_А5_OLD)
	|			ИЛИ ВидыМедицинскихКарт.ПечатнаяФорма = ЗНАЧЕНИЕ(Перечисление.ПечатныеФормыМедицинскихКарт.АмбулаторнаяКарта_043_У_СССР_А4_ДОИ_OLD)
	|			ИЛИ ВидыМедицинскихКарт.ПечатнаяФорма = ЗНАЧЕНИЕ(Перечисление.ПечатныеФормыМедицинскихКарт.АмбулаторнаяКарта_043_У_СССР_А5_ДОИ_OLD))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СкидкиНаценки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СкидкиНаценки КАК СкидкиНаценки
	|ГДЕ
	|	НЕ СкидкиНаценки.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШаблоныТекстаРеквизитовОбследований.Ссылка КАК Ссылка,
	|	Диагнозы.Ссылка КАК Диагноз
	|ИЗ
	|	Справочник.ШаблоныТекстаРеквизитовОбследований КАК ШаблоныТекстаРеквизитовОбследований
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Диагнозы КАК Диагнозы
	|		ПО ШаблоныТекстаРеквизитовОбследований.ПодчиненДиагнозу_УДАЛИТЬ.Наименование = Диагнозы.Наименование
	|			И ШаблоныТекстаРеквизитовОбследований.ПодчиненДиагнозу_УДАЛИТЬ.Код = Диагнозы.Код
	|ГДЕ
	|	НЕ ШаблоныТекстаРеквизитовОбследований.ПодчиненДиагнозу_УДАЛИТЬ.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыОтчетов.Ссылка КАК Ссылка,
	|	ВариантыОтчетов.Администратор.Сотрудник КАК АдминистраторСотрудник
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|ГДЕ
	|	НЕ ВариантыОтчетов.ПометкаУдаления
	|	И ВариантыОтчетов.Автор.Ссылка ЕСТЬ NULL
	|	И ВариантыОтчетов.Администратор ССЫЛКА Справочник.Пользователи
	|	И НЕ ВариантыОтчетов.Администратор.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрофилиГруппДоступаРоли.Ссылка КАК Ссылка,
	|	ПрофилиГруппДоступаРоли.Роль КАК Роль
	|ИЗ
	|	Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ПрофилиГруппДоступаРоли.Роль) = ТИП(СТРОКА)
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.ЭтоГруппа
	|	И (Контрагенты.СоциальныйСтатус.Ссылка ЕСТЬ NULL
	|		И НЕ Контрагенты.СоциальныйСтатус_Удалить.Ссылка ЕСТЬ NULL)");
	
	//| (Контрагенты.ГруппаКрови = ЗНАЧЕНИЕ(Перечисление.ГруппыКрови.ПустаяСсылка)
	//|		И НЕ ДЛИНАСТРОКИ(Контрагенты.ГруппаКрови_Удалить) = 0) ИЛИ
		
	РезультатыЗапроса = Запрос.ВыполнитьПакет();

	// Спр. ВидыКонтактнойИнформации	
	ВыборкаВидыКИ = РезультатыЗапроса[0].Выбрать();
	Пока ВыборкаВидыКИ.Следующий() Цикл
		
		ВидКИОбъект = ВыборкаВидыКИ.Ссылка.ПолучитьОбъект();	
		
		Если ВидКИОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		// В ТолькоНациональныйАдрес (новой стомы) попадает информация из реквизита АдресТолькоРоссийский (старой стомы).
		// Чтоб не создавать еще один реквизит и перегонять данные сделаем по другому.
		// Реквизит ТолькоНациональныйАдрес мы всеравно перезапишем ниже!
		
		ВидКИОбъект.АдресТолькоРоссийский = ВидКИОбъект.ТолькоНациональныйАдрес;
		
		ВидКИОбъект.ХранитьИсториюИзменений = ВидКИОбъект.ХранитьИсториюИзменений_OLD;
		ВидКИОбъект.ТолькоНациональныйАдрес = ВидКИОбъект.ТолькоНациональныйАдрес_OLD;
		ВидКИОбъект.ПроверятьКорректность = ВидКИОбъект.ПроверятьКорректность_OLD;
		ВидКИОбъект.ВключатьСтрануВПредставление =  ВидКИОбъект.ВключатьСтрануВПредставление_OLD;
		ВидКИОбъект.ВидРедактирования = ВидКИОбъект.ВидРедактирования_OLD;
		
		ВидКИОбъект.ОбменДанными.Загрузка = Истина;
		
		Попытка			
			ВидКИОбъект.Записать();				
		Исключение
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"Обновление данных при переходе с версии 1.0 на 2.1, обработка Справочника ВидыКонтактнойИнформации."
			, УровеньЖурналаРегистрации.Ошибка
			,, ВидКИОбъект, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));		
		КонецПопытки;
	
	КонецЦикла;
	
	// Спр. Кассы	
	ВыборкаКассы = РезультатыЗапроса[1].Выбрать();
	Пока ВыборкаКассы.Следующий() Цикл
		
		КассаОбъект = ВыборкаКассы.Ссылка.ПолучитьОбъект();	
		
		Если КассаОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		КассаОбъект.ФорматТелефонногоНомераДляОтправкиЭлектронныхЧековККМ = КассаОбъект.ФорматТелефонногоНомераДляОтправкиЭлектронныхЧековККМ_OLD;
		
		КассаОбъект.ОбменДанными.Загрузка = Истина;
		
		Попытка			
			КассаОбъект.Записать();				
		Исключение
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"Обновление данных при переходе с версии 1.0 на 2.1, обработка Справочника Кассы."
			, УровеньЖурналаРегистрации.Ошибка
			,, КассаОбъект, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));		
		КонецПопытки;
	
	КонецЦикла;
	
	// Спр. Организации	
	ВыборкаОрганизации = РезультатыЗапроса[2].Выбрать();
	Пока ВыборкаОрганизации.Следующий() Цикл
		
		ОрганизацияОбъект = ВыборкаОрганизации.Ссылка.ПолучитьОбъект();	
		
		Если ОрганизацияОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		ОрганизацияОбъект.СистемаНалогообложенияДляАвансов = ОрганизацияОбъект.СистемаНалогообложенияДляАвансов_OLD;
		ОрганизацияОбъект.СистемаНалогообложенияДляТоваров = ОрганизацияОбъект.СистемаНалогообложенияДляТоваров_OLD;
		ОрганизацияОбъект.СПриоритетомНоменклатуры = ОрганизацияОбъект.СПриоритетомНоменклатуры_OLD;
		ОрганизацияОбъект.СтавкаНДСДляАвансов = ОрганизацияОбъект.СтавкаНДСДляАвансов_OLD;
		
		ОрганизацияОбъект.ОбменДанными.Загрузка = Истина;
		
		Попытка			
			ОрганизацияОбъект.Записать();				
		Исключение
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"Обновление данных при переходе с версии 1.0 на 2.1, обработка Справочника Организации."
			, УровеньЖурналаРегистрации.Ошибка
			,, ОрганизацияОбъект, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));		
		КонецПопытки;
	
	КонецЦикла;
	
	// Спр. Специализации	
	ВыборкаСпециализации = РезультатыЗапроса[3].Выбрать();
	Пока ВыборкаСпециализации.Следующий() Цикл
		
		СпециализацияОбъект = ВыборкаСпециализации.Ссылка.ПолучитьОбъект();	
		
		Если СпециализацияОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		СпециализацияОбъект.СтоматологическиеУслуги = СпециализацияОбъект.СтоматологическиеУслуги_OLD;
		
		СпециализацияОбъект.ОбменДанными.Загрузка = Истина;
		
		Попытка			
			СпециализацияОбъект.Записать();				
		Исключение
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"Обновление данных при переходе с версии 1.0 на 2.1, обработка Справочника Специализации."
			, УровеньЖурналаРегистрации.Ошибка
			,, СпециализацияОбъект, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));		
		КонецПопытки;
	
	КонецЦикла;
		
	// Спр. СтраныМира	
	ВыборкаСтраныМира = РезультатыЗапроса[4].Выбрать();
	Пока ВыборкаСтраныМира.Следующий() Цикл
		
		СтранаМираОбъект = ВыборкаСтраныМира.Ссылка.ПолучитьОбъект();	
		
		Если СтранаМираОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		СтранаМираОбъект.УчастникЕАЭС = СтранаМираОбъект.УчастникЕАЭС_OLD;
		СтранаМираОбъект.МеждународноеНаименование = СтранаМираОбъект.МеждународноеНаименование_OLD;
		
		СтранаМираОбъект.ОбменДанными.Загрузка = Истина;
		
		Попытка			
			СтранаМираОбъект.Записать();				
		Исключение
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"Обновление данных при переходе с версии 1.0 на 2.1, обработка Справочника СтраныМира."
			, УровеньЖурналаРегистрации.Ошибка
			,, СтранаМираОбъект, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));		
		КонецПопытки;
	
	КонецЦикла;
	
	// Спр. ПодключаемоеОборудование
	МассивДрайверов = Метаданные.Справочники.ДрайверыОборудования.ПолучитьИменаПредопределенных();
	КоллекцияЗначенийПеречисления = Метаданные.Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ЗначенияПеречисления;	
	
	ВыборкаПодклОборудование = РезультатыЗапроса[5].Выбрать();
	Пока ВыборкаПодклОборудование.Следующий() Цикл
		
		ПодклОборудованиеОбъект = ВыборкаПодклОборудование.Ссылка.ПолучитьОбъект();	
		
		Если ПодклОборудованиеОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		//ТипОборудования.Телефония -> ТипОборудования.IPТелефония
		Если ВыборкаПодклОборудование.ОбработчикДрайвера_Удалить = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсСофтФон
			И ВыборкаПодклОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ПустаяСсылка() Тогда
			
			ПодклОборудованиеОбъект.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.IPТелефония;			
		КонецЕсли;
		
		// избавляемся от значений OLD.
		Если ПодклОборудованиеОбъект.ОбработчикДрайвера_Удалить = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикГексагонСканерыШтрихкода_OLD Тогда
			ПодклОборудованиеОбъект.ОбработчикДрайвера_Удалить = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикГексагонСканерыШтрихкода;	
		ИначеЕсли ВыборкаПодклОборудование.ОбработчикДрайвера_Удалить = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикИнкотексККТ54ФЗ_OLD Тогда	
			ПодклОборудованиеОбъект.ОбработчикДрайвера_Удалить = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикИнкотексККТ54ФЗ;	
		КонецЕсли;
				
		Попытка
			
			ИмяЗначенияПеречисления = КоллекцияЗначенийПеречисления.Получить(ВыборкаПодклОборудование.ОбработчикДрайвера_УдалитьПорядок).Имя;
			НаименованиеДрайвера = "Драйвер" + СтрЗаменить(ИмяЗначенияПеречисления, "Обработчик", "");						
			НаименованиеДрайвера = СтрЗаменить(НаименованиеДрайвера, "_OLD", "");
			ИндексВМассивеДрайверов = МассивДрайверов.Найти(НаименованиеДрайвера);		
			
			Если НЕ ИндексВМассивеДрайверов = Неопределено Тогда
				ПодклОборудованиеОбъект.ДрайверОборудования = Справочники.ДрайверыОборудования[МассивДрайверов[ИндексВМассивеДрайверов]];			
			КонецЕсли;	
			
			ПодклОборудованиеОбъект.УстройствоИспользуется = ЗначениеЗаполнено(ПодклОборудованиеОбъект.ДрайверОборудования)
															 И НЕ ВыборкаПодклОборудование.УстройствоОтключено;
			
			ПодклОборудованиеОбъект.ОбменДанными.Загрузка = Истина;
			ПодклОборудованиеОбъект.Записать();
			
		Исключение
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"Обновление данных при переходе с версии 1.0 на 2.1, обработка Справочника ПодключаемоеОборудование."
			, УровеньЖурналаРегистрации.Ошибка
			,, ПодклОборудованиеОбъект, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));		
		КонецПопытки;
		
	КонецЦикла;
	
	// Спр. ВидыМедицинскихКарт	
	ВыборкаВидыМедКарт = РезультатыЗапроса[6].Выбрать();
	Пока ВыборкаВидыМедКарт.Следующий() Цикл
		
		ВидМКОбъект = ВыборкаВидыМедКарт.Ссылка.ПолучитьОбъект();	
		
		Если ВидМКОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		Если ВидМКОбъект.ПечатнаяФорма = Перечисления.ПечатныеФормыМедицинскихКарт.АмбулаторнаяКарта_043_У_СССР_А4_OLD
			ИЛИ ВидМКОбъект.ПечатнаяФорма = Перечисления.ПечатныеФормыМедицинскихКарт.АмбулаторнаяКарта_043_У_СССР_А4_ДОИ_OLD Тогда
			
			ВидМКОбъект.ПечатнаяФорма = Перечисления.ПечатныеФормыМедицинскихКарт.АмбулаторнаяКарта_043_У_СССР_А4;		
			
		ИначеЕсли ВидМКОбъект.ПечатнаяФорма = Перечисления.ПечатныеФормыМедицинскихКарт.АмбулаторнаяКарта_043_У_СССР_А5_OLD
			ИЛИ ВидМКОбъект.ПечатнаяФорма = Перечисления.ПечатныеФормыМедицинскихКарт.АмбулаторнаяКарта_043_У_СССР_А5_ДОИ_OLD Тогда
			
			ВидМКОбъект.ПечатнаяФорма = Перечисления.ПечатныеФормыМедицинскихКарт.АмбулаторнаяКарта_043_У_СССР_А5;
			
		КонецЕсли;
		
		ВидМКОбъект.ОбменДанными.Загрузка = Истина;
		
		Попытка			
			ВидМКОбъект.Записать();				
		Исключение
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"Обновление данных при переходе с версии 1.0 на 2.1, обработка Справочника ВидыМедицинскихКарт."
			, УровеньЖурналаРегистрации.Ошибка
			,, ВидМКОбъект, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));		
		КонецПопытки;
	
	КонецЦикла;
	
	// Спр. СкидкиНаценки	
	ВыборкаСкидкиНаценки = РезультатыЗапроса[7].Выбрать();
	Пока ВыборкаСкидкиНаценки.Следующий() Цикл
		
		СкидкаНаценкаОбъект = ВыборкаСкидкиНаценки.Ссылка.ПолучитьОбъект();	
		
		Если СкидкаНаценкаОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		Если ТипЗнч(СкидкаНаценкаОбъект.ПериодНакопления_УДАЛИТЬ) = Тип("Число") Тогда
			СкидкаНаценкаОбъект.ПериодНакопления = СкидкаНаценкаОбъект.ПериодНакопления_УДАЛИТЬ;		
		ИначеЕсли ТипЗнч(СкидкаНаценкаОбъект.ПериодНакопления_УДАЛИТЬ) = Тип("ПеречислениеСсылка.ПериодичностьНакопленияСкидки") Тогда
			
			СкидкаНаценкаОбъект.ПериодНакопленияТип = Перечисления.Периодичность.Месяц;
			
			Если СкидкаНаценкаОбъект.ПериодНакопления_УДАЛИТЬ = Перечисления.ПериодичностьНакопленияСкидки.Месяц Тогда
				СкидкаНаценкаОбъект.ПериодНакопления = 1;
			ИначеЕсли СкидкаНаценкаОбъект.ПериодНакопления_УДАЛИТЬ = Перечисления.ПериодичностьНакопленияСкидки.ДваМесяца Тогда	
				СкидкаНаценкаОбъект.ПериодНакопления = 2;
			ИначеЕсли СкидкаНаценкаОбъект.ПериодНакопления_УДАЛИТЬ = Перечисления.ПериодичностьНакопленияСкидки.ТриМесяца Тогда	
				СкидкаНаценкаОбъект.ПериодНакопления = 3;
			ИначеЕсли СкидкаНаценкаОбъект.ПериодНакопления_УДАЛИТЬ = Перечисления.ПериодичностьНакопленияСкидки.Полугодие Тогда	
				СкидкаНаценкаОбъект.ПериодНакопления = 6;
			ИначеЕсли СкидкаНаценкаОбъект.ПериодНакопления_УДАЛИТЬ = Перечисления.ПериодичностьНакопленияСкидки.Год Тогда	
				СкидкаНаценкаОбъект.ПериодНакопления = 12;
			Иначе
				СкидкаНаценкаОбъект.ПериодНакопления = 0; // ВТечениеВсегоПериода.
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипЗнч(СкидкаНаценкаОбъект.ТипПолучателя_УДАЛИТЬ) = Тип("ПеречислениеСсылка.ТипыПолучателейСкидкиНаценки") Тогда
			СкидкаНаценкаОбъект.ТипПолучателя = СкидкаНаценкаОбъект.ТипПолучателя_УДАЛИТЬ;		
		ИначеЕсли ТипЗнч(СкидкаНаценкаОбъект.ТипПолучателя_УДАЛИТЬ) = Тип("Число") Тогда
			
			Если СкидкаНаценкаОбъект.ТипПолучателя_УДАЛИТЬ = 1 Тогда	
				СкидкаНаценкаОбъект.ТипПолучателя = Перечисления.ТипыПолучателейСкидкиНаценки.ОграниченоСегментомКлиентов;
            ИначеЕсли СкидкаНаценкаОбъект.ТипПолучателя_УДАЛИТЬ = 2 Тогда	
				СкидкаНаценкаОбъект.ТипПолучателя = Перечисления.ТипыПолучателейСкидкиНаценки.ОграниченоСпискомКлиентов;
			ИначеЕсли СкидкаНаценкаОбъект.ТипПолучателя_УДАЛИТЬ = 3 Тогда	
				СкидкаНаценкаОбъект.ТипПолучателя = Перечисления.ТипыПолучателейСкидкиНаценки.ОграниченоВидамиДисконтныхКарт;		
			Иначе
				СкидкаНаценкаОбъект.ТипПолучателя = Перечисления.ТипыПолучателейСкидкиНаценки.ПустаяСсылка(); // Без ограничений.
			КонецЕсли;
			
		КонецЕсли;
		
		СкидкаНаценкаОбъект.ОбменДанными.Загрузка = Истина;
		
		Попытка			
			СкидкаНаценкаОбъект.Записать();				
		Исключение
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"Обновление данных при переходе с версии 1.0 на 2.1, обработка Справочника СкидкиНаценки"
			, УровеньЖурналаРегистрации.Ошибка
			,, СкидкаНаценкаОбъект, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));		
		КонецПопытки;
	
	КонецЦикла;
	
	// Спр. ШаблоныТекстаРеквизитовОбследований	
	ВыборкаШаблоныТекста = РезультатыЗапроса[8].Выбрать();
	Пока ВыборкаШаблоныТекста.Следующий() Цикл
		
		ШаблонТекстаОбъект = ВыборкаШаблоныТекста.Ссылка.ПолучитьОбъект();	
		
		Если ШаблонТекстаОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		Если ТипЗнч(ШаблонТекстаОбъект.ПодчиненДиагнозу_УДАЛИТЬ) = Тип("СправочникСсылка.Диагнозы") Тогда
			ШаблонТекстаОбъект.ПодчиненДиагнозу	= ШаблонТекстаОбъект.ПодчиненДиагнозу_УДАЛИТЬ;	
		Иначе
			ШаблонТекстаОбъект.ПодчиненДиагнозу	= ВыборкаШаблоныТекста.Диагноз;		
		КонецЕсли;
		
		ШаблонТекстаОбъект.ОбменДанными.Загрузка = Истина;
		
		Попытка			
			ШаблонТекстаОбъект.Записать();				
		Исключение
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"Обновление данных при переходе с версии 1.0 на 2.1, обработка Справочника ШаблоныТекстаРеквизитовОбследований"
			, УровеньЖурналаРегистрации.Ошибка
			,, ШаблонТекстаОбъект, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));		
		КонецПопытки;
	
	КонецЦикла;
	
	// Спр. ВариантыОтчетов
	ВыборкаВариантыОтчетов = РезультатыЗапроса[9].Выбрать();
	Пока ВыборкаВариантыОтчетов.Следующий() Цикл
		
		ВариантОтчетаОбъект = ВыборкаВариантыОтчетов.Ссылка.ПолучитьОбъект();	
		
		Если ВариантОтчетаОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		ВариантОтчетаОбъект.Автор = ВыборкаВариантыОтчетов.АдминистраторСотрудник;
		
		ВариантОтчетаОбъект.ОбменДанными.Загрузка = Истина;
		
		Попытка			
			ВариантОтчетаОбъект.Записать();				
		Исключение
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"Обновление данных при переходе с версии 1.0 на 2.1, обработка Справочника ВариантыОтчетов"
			, УровеньЖурналаРегистрации.Ошибка
			,, ВариантОтчетаОбъект, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));		
		КонецПопытки;
		
	КонецЦикла;
	
	// Спр. ПрофилиГруппДоступа
	ВыборкаПрофилиГруппДоступа = РезультатыЗапроса[10].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПрофилиГруппДоступа.Следующий() Цикл
		
		ПрофилиГруппДоступаОбъект = ВыборкаПрофилиГруппДоступа.Ссылка.ПолучитьОбъект();	
		
		Если ПрофилиГруппДоступаОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		ПрофилиГруппДоступаОбъект.Роли.Очистить();
		
		ВыборкаРоли = ВыборкаПрофилиГруппДоступа.Выбрать();	
		Попытка	
			
			Пока ВыборкаРоли.Следующий() Цикл
				НаименованиеРоли = СтрЗаменить(ВыборкаРоли.Роль, " ", "");
				НаименованиеРоли = "Роль." + СтрЗаменить(НаименованиеРоли, "-", "");
				ПрофилиГруппДоступаОбъект.Роли.Добавить().Роль = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(НаименованиеРоли);		
			КонецЦикла;
			
			ПрофилиГруппДоступаОбъект.ОбменДанными.Загрузка = Истина;
			
			ПрофилиГруппДоступаОбъект.Записать();
			
		Исключение
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"Обновление данных при переходе с версии 1.0 на 2.1, обработка Справочника ПрофилиГруппДоступа"
			, УровеньЖурналаРегистрации.Ошибка
			,, ПрофилиГруппДоступаОбъект, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));		
		КонецПопытки;
		
	КонецЦикла;
	
	// Спр. Контрагенты
	ВыборкаКонтрагенты = РезультатыЗапроса[11].Выбрать();
	Пока ВыборкаКонтрагенты.Следующий() Цикл
		
		КонтрагентОбъект = ВыборкаКонтрагенты.Ссылка.ПолучитьОбъект();	
		
		Если КонтрагентОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(КонтрагентОбъект.СоциальныйСтатус) Тогда
			КонтрагентОбъект.СоциальныйСтатус = КонтрагентОбъект.СоциальныйСтатус_Удалить;		
		КонецЕсли;
		
		//Если НЕ ЗначениеЗаполнено(КонтрагентОбъект.ГруппаКрови) Тогда
		//	
		//	Если КонтрагентОбъект.ГруппаКрови_Удалить = "1+" Тогда
		//		КонтрагентОбъект.ГруппаКрови = Перечисления.ГруппыКрови.ПерваяПоложительная;	
		//	
		//	ИначеЕсли КонтрагентОбъект.ГруппаКрови_Удалить = "1-"
		//		ИЛИ КонтрагентОбъект.ГруппаКрови_Удалить = "O(I) Rh−"
		//		ИЛИ (СтрЧислоВхождений(КонтрагентОбъект.ГруппаКрови_Удалить, "(I)") > 0
		//			И СтрЧислоВхождений(КонтрагентОбъект.ГруппаКрови_Удалить, "-") > 0) Тогда
		//		КонтрагентОбъект.ГруппаКрови = Перечисления.ГруппыКрови.ПерваяОтрицательная;	
		//		
		//	ИначеЕсли КонтрагентОбъект.ГруппаКрови_Удалить = "2+" Тогда
		//		КонтрагентОбъект.ГруппаКрови = Перечисления.ГруппыКрови.ВтораяПоложительная;	
		//	ИначеЕсли КонтрагентОбъект.ГруппаКрови_Удалить = "2-" Тогда
		//		КонтрагентОбъект.ГруппаКрови = Перечисления.ГруппыКрови.ВтораяОтрицательная;	
		//	ИначеЕсли КонтрагентОбъект.ГруппаКрови_Удалить = "3+" Тогда
		//		КонтрагентОбъект.ГруппаКрови = Перечисления.ГруппыКрови.ТретьяПоложительная;	
		//	ИначеЕсли КонтрагентОбъект.ГруппаКрови_Удалить = "3-" Тогда
		//		КонтрагентОбъект.ГруппаКрови = Перечисления.ГруппыКрови.ТретьяОтрицательная;	
		//	ИначеЕсли КонтрагентОбъект.ГруппаКрови_Удалить = "4+" Тогда
		//		КонтрагентОбъект.ГруппаКрови = Перечисления.ГруппыКрови.ЧетвертаяПоложительная;	
		//	ИначеЕсли КонтрагентОбъект.ГруппаКрови_Удалить = "4-" Тогда
		//		КонтрагентОбъект.ГруппаКрови = Перечисления.ГруппыКрови.ЧетвертаяОтрицательная;	
		//	Иначе
		//		КонтрагентОбъект.ГруппаКрови = Перечисления.ГруппыКрови.ПустаяСсылка();	
		//	КонецЕсли;
		//	
		//КонецЕсли;
			
		
		КонтрагентОбъект.ОбменДанными.Загрузка = Истина;
		
		Попытка			
			КонтрагентОбъект.Записать();				
		Исключение
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"Обновление данных при переходе с версии 1.0 на 2.1, обработка Справочника Контрагенты"
			, УровеньЖурналаРегистрации.Ошибка
			,, КонтрагентОбъект, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));		
		КонецПопытки;
		
	КонецЦикла;
		
	// Спр. Номенклатура
	
	// НормыСписанияМатериалов перегоняли из ТЧ в Регистр в 47 релизе.
	// Сейчас нет смысла дозаполнять ТЧ, а потом еще раз регистр.
	// Изменил поле в процедуре обновления ПеренестиДанныеИзТЧВРегистрСведенийНормыСписанияМатериалов,
	// откуда берется информация по несовпадающему реквизиту
	
#КонецОбласти

#Область Обработка_Документов

	// Выравнивание.

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПланЛеченияЛечение.Ссылка КАК Ссылка,
	|	ПланЛеченияЛечение.КлючСтроки КАК КлючСтроки,
	|	ПланЛеченияЛечение.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.ПланЛечения.Лечение КАК ПланЛеченияЛечение
	|ГДЕ
	|	НЕ ПланЛеченияЛечение.СуммаРучнойСкидки_OLD = 0
	|
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриемМатериалы.Ссылка КАК Ссылка,
	|	ПриемМатериалы.ВключатьВСтоимость_OLD КАК ВключатьВСтоимость_OLD,
	|	ПриемМатериалы.ВидЦен_OLD КАК ВидЦен_OLD,
	|	ПриемМатериалы.КлючСтроки КАК КлючСтроки,
	|	ПриемМатериалы.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.Прием.Материалы КАК ПриемМатериалы
	|ГДЕ
	|	НЕ ПриемМатериалы.ВидЦен_OLD.Ссылка ЕСТЬ NULL
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписаниеДенежныхСредств.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СписаниеДенежныхСредств КАК СписаниеДенежныхСредств
	|ГДЕ
	|	НЕ СписаниеДенежныхСредств.Выгодоприобретатель_OLD.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекКоррекции_OLD.Ссылка КАК Ссылка,
	|	ЧекКоррекции_OLD.ВерсияДанных КАК ВерсияДанных,
	|	ЧекКоррекции_OLD.ПометкаУдаления КАК ПометкаУдаления,
	|	ЧекКоррекции_OLD.Номер КАК Номер,
	|	ЧекКоррекции_OLD.Дата КАК Дата,
	|	ЧекКоррекции_OLD.Проведен КАК Проведен,
	|	ЧекКоррекции_OLD.АвторДокумента КАК АвторДокумента,
	|	ЧекКоррекции_OLD.ВидОперации КАК ВидОперации,
	|	ЧекКоррекции_OLD.ДатаКоррекции КАК ДатаКоррекции,
	|	ЧекКоррекции_OLD.ДокументРасчетов КАК ДокументРасчетов,
	|	ЧекКоррекции_OLD.ДополнительныйРеквизит КАК ДополнительныйРеквизит,
	|	ЧекКоррекции_OLD.Касса КАК Касса,
	|	ЧекКоррекции_OLD.Кассир КАК Кассир,
	|	ЧекКоррекции_OLD.КассирИНН КАК КассирИНН,
	|	ЧекКоррекции_OLD.КассоваяСмена КАК КассоваяСмена,
	|	ЧекКоррекции_OLD.Комментарий КАК Комментарий,
	|	ЧекКоррекции_OLD.НеприменениеККТ КАК НеприменениеККТ,
	|	ЧекКоррекции_OLD.НомерПредписания КАК НомерПредписания,
	|	ЧекКоррекции_OLD.НомерСмены КАК НомерСмены,
	|	ЧекКоррекции_OLD.НомерЧекаККМ КАК НомерЧекаККМ,
	|	ЧекКоррекции_OLD.ОписаниеКоррекции КАК ОписаниеКоррекции,
	|	ЧекКоррекции_OLD.Организация КАК Организация,
	|	ЧекКоррекции_OLD.Покупатель КАК Покупатель,
	|	ЧекКоррекции_OLD.ПокупательEmail КАК ПокупательEmail,
	|	ЧекКоррекции_OLD.ПокупательИНН КАК ПокупательИНН,
	|	ЧекКоррекции_OLD.ПокупательНомер КАК ПокупательНомер,
	|	ЧекКоррекции_OLD.ПризнакАгента КАК ПризнакАгента,
	|	ЧекКоррекции_OLD.ПробитЧек КАК ПробитЧек,
	|	ЧекКоррекции_OLD.СистемаНалогообложения КАК СистемаНалогообложения,
	|	ЧекКоррекции_OLD.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЧекКоррекции_OLD.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ЧекКоррекции_OLD.ТипКоррекции КАК ТипКоррекции,
	|	ЕСТЬNULL(ЧекКоррекции_OLD.ТипРасчета.Порядок, НЕОПРЕДЕЛЕНО) КАК ТипРасчетаПорядок,
	|	ЧекКоррекции_OLD.ЭтоСторно КАК ЭтоСторно,
	|	ЧекКоррекции_OLD.Оплата.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Сумма КАК Сумма,
	|		ТипОплаты КАК ТипОплаты
	|	) КАК Оплата,
	|	ЧекКоррекции_OLD.ПозицииЧека.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ДанныеПоставщикаИНН КАК ДанныеПоставщикаИНН,
	|		ДанныеПоставщикаНаименование КАК ДанныеПоставщикаНаименование,
	|		ДанныеПоставщикаТелефон КАК ДанныеПоставщикаТелефон,
	|		Количество КАК Количество,
	|		НаименованиеПредметаРасчета КАК НаименованиеПредметаРасчета,
	|		НомерСекции КАК НомерСекции,
	|		ПризнакАгентаПоПредметуРасчета КАК ПризнакАгентаПоПредметуРасчета,
	|		ПризнакПредметаРасчета КАК ПризнакПредметаРасчета,
	|		ПризнакСпособаРасчета КАК ПризнакСпособаРасчета,
	|		СтавкаНДС КАК СтавкаНДС,
	|		СуммаНДС КАК СуммаНДС,
	|		СуммаСкидок КАК СуммаСкидок,
	|		СуммаСоСкидками КАК СуммаСоСкидками,
	|		ЦенаСоСкидками КАК ЦенаСоСкидками,
	|		Штрихкод КАК Штрихкод
	|	) КАК ПозицииЧека,
	|	ЧекКоррекции_OLD.ТаблицаОснований.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ДокументОснование КАК ДокументОснование
	|	) КАК ТаблицаОснований,
	|	ЕСТЬNULL(ФискальныеОперацииДокументы_OLD.ИдентификаторЗаписи, НЕОПРЕДЕЛЕНО) КАК ИдентификаторФискальнойЗаписи
	|ИЗ
	|	Документ.ЧекКоррекции_OLD КАК ЧекКоррекции_OLD
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФискальныеОперацииДокументы_OLD КАК ФискальныеОперацииДокументы_OLD
	|		ПО ЧекКоррекции_OLD.Ссылка = ФискальныеОперацииДокументы_OLD.ДокументОснование
	|ГДЕ
	|	ЧекКоррекции_OLD.Проведен");
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
	// Документ ПланЛечения	
	ВыборкаПланЛечения = РезультатыЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПланЛечения.Следующий() Цикл
		
		ПланЛеченияОбъект = ВыборкаПланЛечения.Ссылка.ПолучитьОбъект();	
		
		Если ПланЛеченияОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТабличнаяЧастьЛечение = ПланЛеченияОбъект.Лечение;		
		ВыборкаТЧДокумента = ВыборкаПланЛечения.Выбрать();
		
		Пока ВыборкаТЧДокумента.Следующий() Цикл
			ИзменяемаяСтрока = ТабличнаяЧастьЛечение[ВыборкаТЧДокумента.НомерСтроки-1];
			Если ИзменяемаяСтрока.КлючСтроки = ВыборкаТЧДокумента.КлючСтроки Тогда
				ИзменяемаяСтрока.СуммаРучнойСкидки = ИзменяемаяСтрока.СуммаРучнойСкидки_OLD;
			КонецЕсли;
		КонецЦикла;
		
		Попытка			
			ПланЛеченияОбъект.Записать(РежимЗаписиДокумента.Запись);				
		Исключение
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"Обновление данных при переходе с версии 1.0 на 2.1, обработка документов ПланЛечения."
			, УровеньЖурналаРегистрации.Ошибка
			,, ПланЛеченияОбъект, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));		
		КонецПопытки;
			
	КонецЦикла;
	
	// Документ Прием	
	ВыборкаПрием = РезультатыЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПрием.Следующий() Цикл
		
		ПриемОбъект = ВыборкаПрием.Ссылка.ПолучитьОбъект();	
		
		Если ПриемОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТабличнаяЧастьМатериалы = ПриемОбъект.Материалы;		
		ВыборкаТЧДокумента = ВыборкаПрием.Выбрать();
		
		Пока ВыборкаТЧДокумента.Следующий() Цикл
			ИзменяемаяСтрока = ТабличнаяЧастьМатериалы[ВыборкаТЧДокумента.НомерСтроки-1];
			Если ИзменяемаяСтрока.КлючСтроки = ВыборкаТЧДокумента.КлючСтроки Тогда				
				ИзменяемаяСтрока.ВключатьВСтоимость = ИзменяемаяСтрока.ВключатьВСтоимость_OLD;
				ИзменяемаяСтрока.ВидЦен = ИзменяемаяСтрока.ВидЦен_OLD;
			КонецЕсли;
		КонецЦикла;
		
		Попытка			
			ПриемОбъект.Записать(РежимЗаписиДокумента.Запись);				
		Исключение
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"Обновление данных при переходе с версии 1.0 на 2.1, обработка документов Прием."
			, УровеньЖурналаРегистрации.Ошибка
			,, ПриемОбъект, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));		
		КонецПопытки;
			
	КонецЦикла;
	
	// Документ СписаниеДенежныхСредств	
	ВыборкаСписаниеДенежныхСредств = РезультатыЗапроса[2].Выбрать();
	Пока ВыборкаСписаниеДенежныхСредств.Следующий() Цикл
		
		СписаниеДСОбъект = ВыборкаСписаниеДенежныхСредств.Ссылка.ПолучитьОбъект();	
		
		Если СписаниеДСОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СписаниеДСОбъект.Выгодоприобретатель = СписаниеДСОбъект.Выгодоприобретатель_OLD;
		
		Попытка			
			СписаниеДСОбъект.Записать(РежимЗаписиДокумента.Запись);				
		Исключение
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"Обновление данных при переходе с версии 1.0 на 2.1, обработка документов СписаниеДенежныхСредств."
			, УровеньЖурналаРегистрации.Ошибка
			,, СписаниеДСОбъект, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));		
		КонецПопытки;
			
	КонецЦикла;	
	
	// Документ ЧекКоррекции	
	ВыборкаЧекКоррекции = РезультатыЗапроса[3].Выбрать();
	Пока ВыборкаЧекКоррекции.Следующий() Цикл
		
		ЧекКоррекцииОбъект = Документы.ЧекКоррекции.СоздатьДокумент();		
		ЗаполнитьЗначенияСвойств(ЧекКоррекцииОбъект, ВыборкаЧекКоррекции);
		
		Если ЗначениеЗаполнено(ВыборкаЧекКоррекции.ТипРасчетаПорядок) Тогда
			ЧекКоррекцииОбъект.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами[ВыборкаЧекКоррекции.ТипРасчетаПорядок];
		КонецЕсли;	
		ЧекКоррекцииОбъект.Номер = "00" + ВыборкаЧекКоррекции.Номер;		
		ЧекКоррекцииОбъект.Оплата.Загрузить(ВыборкаЧекКоррекции.Оплата.Выгрузить());
		ЧекКоррекцииОбъект.ПозицииЧека.Загрузить(ВыборкаЧекКоррекции.ПозицииЧека.Выгрузить());
		ЧекКоррекцииОбъект.ТаблицаОснований.Загрузить(ВыборкаЧекКоррекции.ТаблицаОснований.Выгрузить());
		
		ОбновитьЗаписьВРегистреФискальныеОперацииДокументы = Ложь;
		ОбновитьЗаписьВРегистреФискальныеОперацииКорДокументы = Ложь;
		Если ЗначениеЗаполнено(ВыборкаЧекКоррекции.ИдентификаторФискальнойЗаписи) Тогда
						
			СсылкаНового = Документы.ЧекКоррекции.ПолучитьСсылку();
			ЧекКоррекцииОбъект.УстановитьСсылкуНового(СсылкаНового);
			
			МенеджерЗаписиФискОперацииДокументы = РегистрыСведений.ФискальныеОперацииДокументы_OLD.СоздатьМенеджерЗаписи();
			МенеджерЗаписиФискОперацииДокументы.ИдентификаторЗаписи = ВыборкаЧекКоррекции.ИдентификаторФискальнойЗаписи;
			МенеджерЗаписиФискОперацииДокументы.ДокументОснование = ВыборкаЧекКоррекции.Ссылка;
			МенеджерЗаписиФискОперацииДокументы.Прочитать();
			Если МенеджерЗаписиФискОперацииДокументы.Выбран() Тогда
				ОбновитьЗаписьВРегистреФискальныеОперацииДокументы = Истина;
				МенеджерЗаписиФискОперацииДокументы.ДокументОснование = СсылкаНового;						
			КонецЕсли; 
			
			МенеджерЗаписиФискОперацииКорДокументы = РегистрыСведений.ФискальныеОперацииКорректируемыеДокументы_OLD.СоздатьМенеджерЗаписи();
			МенеджерЗаписиФискОперацииКорДокументы.ИдентификаторЗаписи = ВыборкаЧекКоррекции.ИдентификаторФискальнойЗаписи;
			МенеджерЗаписиФискОперацииКорДокументы.ДокументОснование = ВыборкаЧекКоррекции.Ссылка;
			МенеджерЗаписиФискОперацииКорДокументы.Прочитать();
			Если МенеджерЗаписиФискОперацииКорДокументы.Выбран() Тогда
				ОбновитьЗаписьВРегистреФискальныеОперацииКорДокументы = Истина;
				МенеджерЗаписиФискОперацииКорДокументы.ДокументОснование = СсылкаНового;						
			КонецЕсли;
			
		КонецЕсли;
				
		ЧекКоррекцииОбъект.ОбменДанными.Загрузка = Истина;
		
		Попытка			
			ЧекКоррекцииОбъект.Записать();
			
			Если ОбновитьЗаписьВРегистреФискальныеОперацииДокументы Тогда
				МенеджерЗаписиФискОперацииДокументы.Записать(Истина);					
			КонецЕсли;
			Если ОбновитьЗаписьВРегистреФискальныеОперацииКорДокументы Тогда
				МенеджерЗаписиФискОперацииКорДокументы.Записать(Истина);					
			КонецЕсли;
	
		Исключение
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"Обновление данных при переходе с версии 1.0 на 2.1, обработка документов Чеки коррекции."
			, УровеньЖурналаРегистрации.Ошибка
			,, ВыборкаЧекКоррекции.Ссылка, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));		
		КонецПопытки;
			
	КонецЦикла;
				
#КонецОбласти

#Область Обработка_РегистровСведений	

	// Выравнивание.

	МассивОбрабатываемыхРегистров = Новый Массив;
	МассивОбрабатываемыхРегистров.Добавить(Новый Структура("Приемник, Источник", "ФискальныеОперацииДокументы", "ФискальныеОперацииДокументы_OLD"));
	МассивОбрабатываемыхРегистров.Добавить(Новый Структура("Приемник, Источник", "ФискальныеОперацииКорректируемыеДокументы", "ФискальныеОперацииКорректируемыеДокументы_OLD"));
	МассивОбрабатываемыхРегистров.Добавить(Новый Структура("Приемник, Источник", "АдресныеОбъекты", "АдресныеОбъекты_OLD"));
	МассивОбрабатываемыхРегистров.Добавить(Новый Структура("Приемник, Источник", "БезопасноеХранилищеДанных", "БезопасноеХранилищеДанных_OLD"));
	МассивОбрабатываемыхРегистров.Добавить(Новый Структура("Приемник, Источник", "ЗагруженныеВерсииАдресныхСведений", "ЗагруженныеВерсииАдресныхСведений_OLD"));
	
	Запрос = Новый Запрос;
	
	Для Каждого ОбрабатываемыеРегистр ИЗ МассивОбрабатываемыхРегистров Цикл
		
		Запрос.Текст = Запрос.Текст +   
		"ВЫБРАТЬ 
		|	*	
		|ИЗ
		|	РегистрСведений."+ ОбрабатываемыеРегистр.Источник +" КАК "+ ОбрабатываемыеРегистр.Источник+ "
		|;
		|
		|";
		
	КонецЦикла;
	
    Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	ЗначенияПараметровОбследований.Документ КАК Документ,
	|	ЗначенияПараметровОбследований.ШаблонОбследования КАК ШаблонОбследования,
	|	ЗначенияПараметровОбследований.Параметр КАК Параметр,
	|	ЗначенияПараметровОбследований.Зуб КАК Зуб,
	|	ЗначенияПараметровОбследований.Значение КАК Значение,
	|	ЗначенияПараметровОбследований.ЗначениеУдалить КАК ЗначениеУдалить,
	|	ЗначенияПараметровОбследований.ПорядковыйНомер КАК ПорядковыйНомер,
	|	ЗначенияПараметровОбследований.ЗначениеСтрокой_OLD КАК ЗначениеСтрокой
	|ИЗ
	|	РегистрСведений.ЗначенияПараметровОбследований КАК ЗначенияПараметровОбследований
	|ГДЕ
	|	(ВЫРАЗИТЬ(ЗначенияПараметровОбследований.ЗначениеСтрокой_OLD КАК СТРОКА(10))) <> """"
	|;
	|
	|";
	
	МассивОбрабатываемыхРегистров.Добавить(Новый Структура("Приемник, Источник", "ЗначенияПараметровОбследований", "ЗначенияПараметровОбследований"));
		
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	ГруппыЗначенийДоступа.ЗначениеДоступа КАК ЗначениеДоступа,
	|	ГруппыЗначенийДоступа.ГруппаДоступа_OLD КАК ГруппаЗначенийДоступа,
	|	ГруппыЗначенийДоступа.ГруппаДанных КАК ГруппаДанных,
	|	ГруппыЗначенийДоступа.НаследоватьПраваРодителей КАК НаследоватьПраваРодителей,
	|	ГруппыЗначенийДоступа.СвязьСРодителем КАК СвязьСРодителем,
	|	ГруппыЗначенийДоступа.ИспользоватьПраваСсылки КАК ИспользоватьПраваСсылки
	|ИЗ
	|	РегистрСведений.ГруппыЗначенийДоступа КАК ГруппыЗначенийДоступа
	|ГДЕ
	|	НЕ ГруппаДоступа_OLD.Ссылка ЕСТЬ NULL
	|;
	|
	|";
	
	МассивОбрабатываемыхРегистров.Добавить(Новый Структура("Приемник, Источник", "ГруппыЗначенийДоступа", "ГруппыЗначенийДоступа"));
	 	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	СтатусыСообщений_УДАЛИТЬ.КлючСтроки КАК КлючСтроки,
	|	ЕСТЬNULL(РассылкаСообщенийПолучатели.Ссылка, ЗНАЧЕНИЕ(Документ.РассылкаСообщений.ПустаяСсылка)) КАК РассылкаСообщений,
	|	СтатусыСообщений_УДАЛИТЬ.СтатусДействия КАК СтатусДействия,
	|	СтатусыСообщений_УДАЛИТЬ.СтатусСообщения КАК СтатусСообщения,
	|	ЕСТЬNULL(РассылкаСообщенийПолучатели.Ссылка.Содержание, """") КАК ТекстСообщения,
	|	 ЗНАЧЕНИЕ(Перечисление.СтадииДоставкиSMSСообщений.ПустаяСсылка) КАК СтадияДоставки,
	|	ЕСТЬNULL(РассылкаСообщенийПолучатели.Ссылка.СервисSMSРассылки, ЗНАЧЕНИЕ(Справочник.СервисыРассылки.ПустаяСсылка)) КАК СервисРассылки,
	|	ЕСТЬNULL(РассылкаСообщенийПолучатели.Ссылка.ДатаОтправки, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаУстановкиСтатуса,
	|	ЕСТЬNULL(РассылкаСообщенийПолучатели.Ссылка.ДатаОтправки, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОтправки,
	|	СтатусыСообщений_УДАЛИТЬ.IDСообщения КАК IDСообщения,
	|	СтатусыСообщений_УДАЛИТЬ.НомерТелефона КАК НомерТелефона,
	|	ЕСТЬNULL(РассылкаСообщенийПолучатели.Получатель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Получатель
	|ИЗ
	|	РегистрСведений.СтатусыСообщений_УДАЛИТЬ.СрезПоследних(, РассылкаСообщений.Ссылка ЕСТЬ NULL) КАК СтатусыСообщений_УДАЛИТЬ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РассылкаСообщений.Получатели КАК РассылкаСообщенийПолучатели
	|		ПО СтатусыСообщений_УДАЛИТЬ.КлючСтроки = РассылкаСообщенийПолучатели.КлючСтроки
	|			И СтатусыСообщений_УДАЛИТЬ.НомерТелефона = РассылкаСообщенийПолучатели.НомерТелефона
	|;
	|
	|";
	
	МассивОбрабатываемыхРегистров.Добавить(Новый Структура("Приемник, Источник", "СтатусыСообщений", "СтатусыСообщений_УДАЛИТЬ"));
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	ДействиеСкидокНаценокСрезПоследних.Период КАК Период,
	|	ДействиеСкидокНаценокСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка КАК СкидкаНаценка,
	|	НЕ ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ПометкаУдаления КАК Актуальность,
	|	ДействиеСкидокНаценокСрезПоследних.КоличествоПрименений КАК КоличествоПрименений,
	|	ДействиеСкидокНаценокСрезПоследних.КоличествоПримененийПоКлиенту КАК КоличествоПримененийПоКлиенту,
	|	ДействиеСкидокНаценокСрезПоследних.ДатаНачалаУдалить КАК ДатаНачала,
	|	ДействиеСкидокНаценокСрезПоследних.ДатаОкончанияУдалить КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.ДействиеСкидокНаценок.СрезПоследних(
	|			,
	|			Актуальность = ЛОЖЬ
	|					И (ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|						И НЕ ДатаНачалаУдалить = ДАТАВРЕМЯ(1, 1, 1))
	|				ИЛИ ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|					И НЕ ДатаОкончанияУдалить = ДАТАВРЕМЯ(1, 1, 1)) КАК ДействиеСкидокНаценокСрезПоследних 
	|;
	|
	|";
	
	МассивОбрабатываемыхРегистров.Добавить(Новый Структура("Приемник, Источник", "ДействиеСкидокНаценок", "ДействиеСкидокНаценок"));
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	ФискальныеОперации_OLD.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	|	ФискальныеОперации_OLD.Дата КАК Дата,
	|	ФискальныеОперации_OLD.Организация КАК Организация,
	|	ФискальныеОперации_OLD.ТорговыйОбъект КАК ТорговыйОбъект,
	|	ЕСТЬNULL(ТипыФискальныхДокументовККТ.Ссылка, ЗНАЧЕНИЕ(Перечисление.ТипыФискальныхДокументовККТ.ПустаяСсылка)) КАК ТипДокумента,
	|	ЕСТЬNULL(ТипыРасчетаДенежнымиСредствами.Ссылка, ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПустаяСсылка)) КАК ТипРасчета,
	|	ФискальныеОперации_OLD.НомерЧекаККМ КАК НомерЧекаККМ,
	|	ФискальныеОперации_OLD.НомерСменыККМ КАК НомерСменыККМ,
	|	ФискальныеОперации_OLD.ФискальныйПризнак КАК ФискальныйПризнак,
	|	ФискальныеОперации_OLD.Сумма КАК Сумма,
	|	ФискальныеОперации_OLD.ОплатаНаличные КАК ОплатаНаличные,
	|	ФискальныеОперации_OLD.ОплатаЭлектронно КАК ОплатаЭлектронно,
	|	ФискальныеОперации_OLD.ОплатаПостоплата КАК ОплатаПостоплата,
	|	ФискальныеОперации_OLD.ОплатаПредоплата КАК ОплатаПредоплата,
	|	ФискальныеОперации_OLD.ОплатаВстречноеПредоставление КАК ОплатаВстречноеПредоставление,
	|	ФискальныеОперации_OLD.АдресСайтаПроверки КАК АдресСайтаПроверки,
	|	ФискальныеОперации_OLD.ЗаводскойНомерФН КАК ЗаводскойНомерФН,
	|	ФискальныеОперации_OLD.РегистрационныйНомерККТ КАК РегистрационныйНомерККТ,
	|	ФискальныеОперации_OLD.ДополнительныйРеквизит КАК ДополнительныйРеквизит,
	|	ФискальныеОперации_OLD.ДанныеXML КАК ДанныеXML,
	|	ФискальныеОперации_OLD.СубъектПерсональныхДанных КАК СубъектПерсональныхДанных
	|ИЗ
	|	РегистрСведений.ФискальныеОперации_OLD КАК ФискальныеОперации_OLD
	|		ЛЕВОЕ СОЕДИНЕНИЕ Перечисление.ТипыФискальныхДокументовККТ КАК ТипыФискальныхДокументовККТ
	|		ПО ФискальныеОперации_OLD.ТипДокумента.Порядок = ТипыФискальныхДокументовККТ.Порядок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Перечисление.ТипыРасчетаДенежнымиСредствами КАК ТипыРасчетаДенежнымиСредствами
	|		ПО ФискальныеОперации_OLD.ТипРасчета.Порядок = ТипыРасчетаДенежнымиСредствами.Порядок
	|;
	|
	|";
	
	МассивОбрабатываемыхРегистров.Добавить(Новый Структура("Приемник, Источник", "ФискальныеОперации", "ФискальныеОперации_OLD"));

	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Для Итератор = 0 ПО МассивОбрабатываемыхРегистров.ВГраница() Цикл
		
		ТЗДанныеРегистра = РезультатыЗапроса[Итератор].Выгрузить();
		
		Если НЕ ЗначениеЗаполнено(ТЗДанныеРегистра) Тогда
        	Продолжить;
		КонецЕсли;
		
		ЭлементМассива = МассивОбрабатываемыхРегистров[Итератор];
		
		Попытка
						
			ОбрабатываемыйРегистр = Метаданные.РегистрыСведений[ЭлементМассива.Приемник];
			
			Если ОбрабатываемыйРегистр = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений[ЭлементМассива.Приемник].СоздатьНаборЗаписей();			
			НаборЗаписей.Загрузить(ТЗДанныеРегистра);
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();		
		
		Исключение
			
			ЗаголовокЖР = СтрШаблон("Обновление данных при переходе с версии 1.0 на 2.1, обработка регистров сведений. Источник - %1, Приемник - %2",
									МассивОбрабатываемыхРегистров[Итератор].Источник,
									МассивОбрабатываемыхРегистров[Итератор].Приемник);
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			ЗаголовокЖР, УровеньЖурналаРегистрации.Ошибка
			, ОбрабатываемыйРегистр
			,, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));
			
		КонецПопытки;
		
	КонецЦикла;
	
	//Выборка = РезультатыЗапросов[Итератор].Выбрать();	
	//Пока Выборка.Следующий() Цикл								
	//	НоваяСтрока = НаборЗаписей.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);				
	//КонецЦикла;			
	//Если НаборЗаписей.Количество() > 0 Тогда
	//	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	//	НаборЗаписей.Записать();
	//КонецЕсли;
	
	// РС НастройкиТранспортаОбмена (старая стоматология) -> НастройкиТранспортаОбменаДанными (новая стоматология).
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОбменДанными") = Истина Тогда
		
		ЗапросОбменДанными = Новый Запрос(		
		"ВЫБРАТЬ
		|	НастройкиТранспортаОбмена_OLD.Узел КАК Корреспондент,
		|	НастройкиТранспортаОбмена_OLD.COMАутентификацияОперационнойСистемы КАК COMАутентификацияОперационнойСистемы,
		|	НастройкиТранспортаОбмена_OLD.COMВариантРаботыИнформационнойБазы КАК COMВариантРаботыИнформационнойБазы,
		|	НастройкиТранспортаОбмена_OLD.COMИмяИнформационнойБазыНаСервере1СПредприятия КАК COMИмяИнформационнойБазыНаСервере1СПредприятия,
		|	НастройкиТранспортаОбмена_OLD.COMИмяПользователя КАК COMИмяПользователя,
		|	НастройкиТранспортаОбмена_OLD.COMИмяСервера1СПредприятия КАК COMИмяСервера1СПредприятия,
		|	НастройкиТранспортаОбмена_OLD.COMКаталогИнформационнойБазы КАК COMКаталогИнформационнойБазы,
		|	НастройкиТранспортаОбмена_OLD.EMAILМаксимальныйДопустимыйРазмерСообщения КАК EMAILМаксимальныйДопустимыйРазмерСообщения,
		|	НастройкиТранспортаОбмена_OLD.EMAILСжиматьФайлИсходящегоСообщения КАК EMAILСжиматьФайлИсходящегоСообщения,
		|	НастройкиТранспортаОбмена_OLD.EMAILУчетнаяЗапись КАК EMAILУчетнаяЗапись,
		|	НастройкиТранспортаОбмена_OLD.FILEКаталогОбменаИнформацией КАК FILEКаталогОбменаИнформацией,
		|	НастройкиТранспортаОбмена_OLD.FILEСжиматьФайлИсходящегоСообщения КАК FILEСжиматьФайлИсходящегоСообщения,
		|	НастройкиТранспортаОбмена_OLD.FTPСжиматьФайлИсходящегоСообщения КАК FTPСжиматьФайлИсходящегоСообщения,
		|	НастройкиТранспортаОбмена_OLD.FTPСоединениеМаксимальныйДопустимыйРазмерСообщения КАК FTPСоединениеМаксимальныйДопустимыйРазмерСообщения,	
		|	НастройкиТранспортаОбмена_OLD.FTPСоединениеПассивноеСоединение КАК FTPСоединениеПассивноеСоединение,
		|	НастройкиТранспортаОбмена_OLD.FTPСоединениеПользователь КАК FTPСоединениеПользователь,
		|	НастройкиТранспортаОбмена_OLD.FTPСоединениеПорт КАК FTPСоединениеПорт,
		|	НастройкиТранспортаОбмена_OLD.FTPСоединениеПуть КАК FTPСоединениеПуть, 		
		|	НастройкиТранспортаОбмена_OLD.WSURLВебСервиса КАК WSURLВебСервиса,
		|	НастройкиТранспортаОбмена_OLD.WSЗапомнитьПароль КАК WSЗапомнитьПароль,
		|	НастройкиТранспортаОбмена_OLD.WSИмяПользователя КАК WSИмяПользователя,
		|	НастройкиТранспортаОбмена_OLD.WSИспользоватьПередачуБольшогоОбъемаДанных КАК WSИспользоватьПередачуБольшогоОбъемаДанных,
		|	НастройкиТранспортаОбмена_OLD.ВидТранспортаСообщенийОбменаПоУмолчанию КАК ВидТранспортаСообщенийОбменаПоУмолчанию,
		|	НастройкиТранспортаОбмена_OLD.КоличествоЭлементовВТранзакцииВыгрузкиДанных КАК КоличествоЭлементовВТранзакцииВыгрузкиДанных,
		|	НастройкиТранспортаОбмена_OLD.КоличествоЭлементовВТранзакцииЗагрузкиДанных КАК КоличествоЭлементовВТранзакцииЗагрузкиДанных,
		|	НастройкиТранспортаОбмена_OLD.WSПароль КАК WSПароль,
		|	НастройкиТранспортаОбмена_OLD.COMПарольПользователя КАК COMПарольПользователя,
		|	НастройкиТранспортаОбмена_OLD.FTPСоединениеПароль КАК FTPСоединениеПароль,
		|	НастройкиТранспортаОбмена_OLD.ПарольАрхиваСообщенияОбмена КАК ПарольАрхиваСообщенияОбмена
		|ИЗ
		|	РегистрСведений.НастройкиТранспортаОбмена_OLD КАК НастройкиТранспортаОбмена_OLD");
		
		ТаблицаНастроекОбменаДанными = ЗапросОбменДанными.Выполнить().Выгрузить();
		
		Для Каждого СтрокаТаблицы Из ТаблицаНастроекОбменаДанными Цикл
			
			Попытка 
				СтруктураЗаписи = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицы);
				РегистрыСведений.НастройкиТранспортаОбменаДанными.ДобавитьЗапись(СтруктураЗаписи);
			Исключение
				ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
				"Обновление данных при переходе с версии 1.0 на 2.1, обработка регистра сведений НастройкиТранспортаОбменаДанными."
				, УровеньЖурналаРегистрации.Ошибка
				,,, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));
		
			КонецПопытки;
			
		КонецЦикла;
				
	КонецЕсли;
	
#КонецОбласти	

	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;

КонецПроцедуры

// Процедура, осуществляет перенос данных ТЧ ДоступныеСЕ, ДоступныеСЕЖурналаЗаписи, ДоступныеКассы из пользователя в сотрудника.
//
Процедура ПеренестиДанныеТабличныхЧастейПользователяСотруднику() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	#Область ДоступныеСтруктурныеЕдиницы
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сотрудники.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.Сотрудник.Наименование КАК СотрудникНаименование
	|ПОМЕСТИТЬ втМестаРаботы
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК Сотрудники
	|ГДЕ
	|	НЕ Сотрудники.СтруктурнаяЕдиница.ПометкаУдаления
	|	И НЕ Сотрудники.СтруктурнаяЕдиница.ЭтоГруппа
	|	И Сотрудники.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПользователиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница,
	|	ПользователиДоступныеСтруктурныеЕдиницы.Ссылка.Сотрудник,
	|	ПользователиДоступныеСтруктурныеЕдиницы.Ссылка.Сотрудник.Наименование
	|ИЗ
	|	Справочник.Пользователи.ДоступныеСтруктурныеЕдиницы_Удалить КАК ПользователиДоступныеСтруктурныеЕдиницы
	|ГДЕ
	|	ПользователиДоступныеСтруктурныеЕдиницы.Ссылка.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	втМестаРаботы.Сотрудник КАК Сотрудник,
	|	втМестаРаботы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	втМестаРаботы.СотрудникНаименование КАК СотрудникНаименование
	|ИЗ
	|	втМестаРаботы КАК втМестаРаботы
	|ИТОГИ
	|	МАКСИМУМ(СотрудникНаименование)
	|ПО
	|	Сотрудник");
	
	ВыборкаСотрудник = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСотрудник.Следующий() Цикл
		
			Если НЕ ЗначениеЗаполнено(ВыборкаСотрудник.Сотрудник) Тогда
				Продолжить;
			КонецЕсли;
			
			СотрудникОбъект = ВыборкаСотрудник.Сотрудник.ПолучитьОбъект();
			
			Если СотрудникОбъект = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СотрудникОбъект.ДоступныеСтруктурныеЕдиницы.Очистить();
			ВыборкаСтруктурки = ВыборкаСотрудник.Выбрать();
			
			Пока ВыборкаСтруктурки.Следующий() Цикл
				СтрокаТЧ = СотрудникОбъект.ДоступныеСтруктурныеЕдиницы.Добавить();	
				СтрокаТЧ.СтруктурнаяЕдиница = ВыборкаСтруктурки.СтруктурнаяЕдиница;
			КонецЦикла;
			
			Попытка
				СотрудникОбъект.Записать();		
			Исключение
				ЗаписьЖурналаРегистрации("Перенос доступных структурных единиц в ТЧ справочника ""Сотрудники"". 
				|Сотрудник: """ + ВыборкаСотрудник.СотрудникНаименование + """", 
				УровеньЖурналаРегистрации.Ошибка,Метаданные.Справочники.Сотрудники, , ОписаниеОшибки());	
			КонецПопытки;
		
	КонецЦикла;	
	
	#КонецОбласти
	
	#Область ДоступныеКассы
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПользователиДоступныеКассы.Ссылка.Сотрудник КАК Сотрудник,
	|	ПользователиДоступныеКассы.Касса КАК Касса,
	|	ПользователиДоступныеКассы.Основная КАК Основная,
	|	ПользователиДоступныеКассы.Ссылка.Сотрудник.Наименование КАК СотрудникНаименование
	|ИЗ
	|	Справочник.Пользователи.ДоступныеКассы_Удалить КАК ПользователиДоступныеКассы
	|ГДЕ
	|	ПользователиДоступныеКассы.Ссылка.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|ИТОГИ
	|	МАКСИМУМ(СотрудникНаименование)
	|ПО
	|	Сотрудник");
	
	ВыборкаСотрудник = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСотрудник.Следующий() Цикл
		
			Если НЕ ЗначениеЗаполнено(ВыборкаСотрудник.Сотрудник) Тогда
				Продолжить;
			КонецЕсли;	
			
			СотрудникОбъект = ВыборкаСотрудник.Сотрудник.ПолучитьОбъект(); 
			
			Если СотрудникОбъект = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СотрудникОбъект.ДоступныеКассы.Очистить();
			ВыборкаСтруктурки = ВыборкаСотрудник.Выбрать();
			
			Пока ВыборкаСтруктурки.Следующий() Цикл
				СтрокаТЧ = СотрудникОбъект.ДоступныеКассы.Добавить();	
				СтрокаТЧ.Касса = ВыборкаСтруктурки.Касса;
				СтрокаТЧ.Основная = ВыборкаСтруктурки.Основная;
			КонецЦикла;  
			
			Попытка		
				СотрудникОбъект.Записать();
			Исключение
				ЗаписьЖурналаРегистрации("Перенос доступных касс в ТЧ справочника ""Сотрудники"". 
				|Сотрудник: """ + ВыборкаСотрудник.СотрудникНаименование + """",
				УровеньЖурналаРегистрации.Ошибка,Метаданные.Справочники.Сотрудники,, ОписаниеОшибки());	
			КонецПопытки;
			
	КонецЦикла;
	
	#КонецОбласти
	
	#Область ДоступныеСтруктурныеЕдиницыЖурналаЗаписи
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПользователиДоступныеСтруктурныеЕдиницыЖурналаЗаписи.Ссылка.Сотрудник КАК Сотрудник,
	|	ПользователиДоступныеСтруктурныеЕдиницыЖурналаЗаписи.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПользователиДоступныеСтруктурныеЕдиницыЖурналаЗаписи.Ссылка.Сотрудник.Наименование КАК СотрудникНаименование
	|ИЗ
	|	Справочник.Пользователи.ДоступныеСтруктурныеЕдиницыЖурналаЗаписи_Удалить КАК ПользователиДоступныеСтруктурныеЕдиницыЖурналаЗаписи
	|ГДЕ
	|	ПользователиДоступныеСтруктурныеЕдиницыЖурналаЗаписи.Ссылка.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|ИТОГИ
	|	МАКСИМУМ(СотрудникНаименование)
	|ПО
	|	Сотрудник");
	
	
	ВыборкаСотрудник =Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСотрудник.Следующий() Цикл
			
		Если НЕ ЗначениеЗаполнено(ВыборкаСотрудник.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		
		СотрудникОбъект = ВыборкаСотрудник.Сотрудник.ПолучитьОбъект();
		
		Если СотрудникОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		СотрудникОбъект.ДоступныеСтруктурныеЕдиницыЖурналаЗаписи.Очистить();
		ВыборкаСтруктурки = ВыборкаСотрудник.Выбрать();
		
		Пока ВыборкаСтруктурки.Следующий() Цикл
			СтрокаТЧ = СотрудникОбъект.ДоступныеСтруктурныеЕдиницыЖурналаЗаписи.Добавить();	
			СтрокаТЧ.СтруктурнаяЕдиница = ВыборкаСтруктурки.СтруктурнаяЕдиница;
		КонецЦикла;
		
		Попытка	
			СотрудникОбъект.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("Перенос доступных структурных единиц журнала записи в ТЧ справочника ""Сотрудники"".
			|Сотрудник: """ + ВыборкаСотрудник.СотрудникНаименование + """", 
			УровеньЖурналаРегистрации.Ошибка,Метаданные.Справочники.Сотрудники, , ОписаниеОшибки());	
		КонецПопытки;
		
	КонецЦикла; 
	
	#КонецОбласти
	
КонецПроцедуры	

// Процедура - Обновить использование справочника программы страхования.
//
// Параметры:
//  Параметры	 - 	 - 
//
Процедура ОбновитьИспользованиеСправочникаПрограммыСтрахования(Параметры = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрограммыСтрахования.Ссылка КАК Ссылка,
	|	ПрограммыСтрахования.ВидДоговора КАК ВидДоговора,
	|	ПрограммыСтрахования.Владелец КАК Владелец
	|ПОМЕСТИТЬ СозданныеПрграммыСтрахования
	|ИЗ
	|	Справочник.ПрограммыСтрахования КАК ПрограммыСтрахования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.ВидДоговора_Удалить КАК ВидДоговора_Удалить,
	|	ДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	СозданныеПрграммыСтрахования.Ссылка КАК ПрограммаСтрахования
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ СозданныеПрграммыСтрахования КАК СозданныеПрграммыСтрахования
	|		ПО ДоговорыКонтрагентов.Контрагент = СозданныеПрграммыСтрахования.Владелец
	|			И ДоговорыКонтрагентов.ВидДоговора_Удалить = СозданныеПрграммыСтрахования.ВидДоговора
	|ГДЕ
	|	ДоговорыКонтрагентов.ПрограммаСтрахования = ЗНАЧЕНИЕ(Справочник.ПрограммыСтрахования.ПустаяСсылка)
	|	И ДоговорыКонтрагентов.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяССылка)";

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ВидДоговора = ?(Не ЗначениеЗаполнено(Выборка.ВидДоговора_Удалить), Перечисления.ВидыСтраховыхДоговоров.Фактовый, Выборка.ВидДоговора_Удалить);
		
		ПрограммыСтрахования = Справочники.ПрограммыСтрахования.ПолучитьПрограммыСтрахованияПоВладельцу(Выборка.Контрагент, ВидДоговора, 1);
		
		Если ПрограммыСтрахования.Количество() > 0 Тогда
			ПрограммаСтрахования = ПрограммыСтрахования[0]; 
		Иначе
			ТекстОшибки = "";
			ПрограммаСтрахования = СоздатьСправочникПрограммаСтрахования(ВидДоговора, Выборка.Контрагент, ТекстОшибки);
			
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда 
				
				ЗаписьЖурналаРегистрации("ОбновлениеСправочникаПрограммыСтрахования", УровеньЖурналаРегистрации.Ошибка,, ТекстОшибки);	
				
				Продолжить;	
			КонецЕсли;
		КонецЕсли;
				
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		СправочникОбъект.ПрограммаСтрахования = ПрограммаСтрахования;
		
		Попытка 
			
			СправочникОбъект.Записать(); 
			
		Исключение
			
			ЗаписьЖурналаРегистрации("ОбновлениеПредопределенныхЭлементовСправочникаПрограммыСтрахования", УровеньЖурналаРегистрации.Ошибка,, ОписаниеОшибки());	

		КонецПопытки;
			
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Создать справочник программа страхования.
//
Функция СоздатьСправочникПрограммаСтрахования(ВидДоговора, Владелец, ТекстОшибки)
	
	НовыйСправочник = Справочники.ПрограммыСтрахования.СоздатьЭлемент();
	
	Если ВидДоговора = Перечисления.ВидыСтраховыхДоговоров.Фактовый Тогда
		ЦветФона 		= Новый Цвет(25, 116, 206);                                  
		Если ЗначениеЗаполнено(Владелец) Тогда
			Наименование = СтрШаблон("%1 %2", Владелец.Наименование, "(Фактовый)");
		Иначе
			Наименование 	= "Фактовый";
		КонецЕсли;
		НаименованиеКратко = "Факт";
	Иначе
		ЦветФона 		= Новый Цвет(209, 9, 78);
		Если ЗначениеЗаполнено(Владелец) Тогда
			Наименование = СтрШаблон("%1 %2", Владелец.Наименование, "(Предоплата)");
		Иначе
			Наименование 	= "Предоплата";
		КонецЕсли;
		НаименованиеКратко = "Пред";	
	КонецЕсли;

	НовыйСправочник.Наименование 				= Наименование;
	НовыйСправочник.НаименованиеКратко 			= НаименованиеКратко;
	НовыйСправочник.ЦветФона 					= ЗначениеВСтрокуВнутр(ЦветФона);
	НовыйСправочник.Владелец					= Владелец;
	НовыйСправочник.ВидДоговора					= ВидДоговора;
	// Цвет текста белый заполнится при записи объекта.
	
	Попытка
		НовыйСправочник.Записать();
		СправочникПрограммыСтрахованияФактовый = НовыйСправочник.Ссылка; 
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки; 
	
	Возврат НовыйСправочник.Ссылка;
	
КонецФункции

// Процедура, переносит записи с видом осмотра ОчередьНаЗапись из регистра Профосмотры 
// в регистр ИнтервалыЛистаОжиания.
//
Процедура ПеренестиОчередьНаЗаписьВЛистОжидания(Параметры = Неопределено) Экспорт

	Если НЕ ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрофосмотрыСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПрофосмотрыСрезПоследних.Контрагент КАК Контрагент,
	|	ПрофосмотрыСрезПоследних.Сотрудник КАК Сотрудник,
	|	ПрофосмотрыСрезПоследних.ДатаЗапланированная КАК Дата,
	|	ЗНАЧЕНИЕ(Перечисление.ПериодыДня.ВесьДень) КАК ПериодДня,
	|	ПрофосмотрыСрезПоследних.Период КАК ДатаЗаписи,
	|	ПрофосмотрыСрезПоследних.Комментарий КАК Комментарий,
	|	ЗНАЧЕНИЕ(Перечисление.ПериодыДня.ВесьДень) КАК ПериодДняСтрокой
	|ИЗ
	|	РегистрСведений.Профосмотры.СрезПоследних(
	|			,
	|			ДатаЗапланированная >= &ТекущаяДата
	|				И ВидОсмотра = ЗНАЧЕНИЕ(Перечисление.ВидыОсмотров.ОчередьНаЗапись)
	|				И Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.Запланирован)) КАК ПрофосмотрыСрезПоследних";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		
		Попытка
						
			НаборЗаписей = РегистрыСведений.ИнтервалыЛистаОжидания.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(Выборка.СтруктурнаяЕдиница); 
			НаборЗаписей.Отбор.Контрагент.Установить(Выборка.Контрагент);
			НаборЗаписей.Отбор.Сотрудник.Установить(Выборка.Сотрудник);
			
			ОбрабатываемаяДата = Выборка.Дата;
			
			Для Итератор = 0 По 31 Цикл
				
				НоваяЗапись = НаборЗаписей.Добавить(); 
				ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
				НоваяЗапись.Дата =  ОбрабатываемаяДата + (Итератор * (60*60*24));
				
			КонецЦикла;
			
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
			
		Исключение	
		КонецПопытки;
		
	КонецЦикла;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Заполнить время отправки сообщений чат бота
//
Процедура ЗаполнитьВремяОтправкиСообщенийЧатБота() Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СценарииЧатБотов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СценарииЧатБотов КАК СценарииЧатБотов
	|ГДЕ
	|	СценарииЧатБотов.ПометкаУдаления = ЛОЖЬ
	|	И (СценарииЧатБотов.ВремяОтправкиСообщенийС = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ СценарииЧатБотов.ВремяОтправкиСообщенийПо = ДАТАВРЕМЯ(1, 1, 1))";
	
	ВыборкаСценариев = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаСценариев.Следующий() Цикл 
		СценарийОбъект = ВыборкаСценариев.Ссылка.ПолучитьОбъект();
		Если СценарийОбъект = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		СценарийОбъект.ВремяОтправкиСообщенийС 	= Дата(01,01,01,08,00,00);
		СценарийОбъект.ВремяОтправкиСообщенийПо = Дата(01,01,01,20,00,00);
		СценарийОбъект.ОбменДанными.Загрузка 	= Истина;
		Попытка
			СценарийОбъект.Записать();
		Исключение
			МетаданныеСправочника 				= Метаданные.Справочники.СценарииЧатБотов;		
			ШаблонКомментария = НСтр("ru = 'Не удалось заполнить время отправки сообщений чат-бота для сценария ""%1"" 
			|по причине: %2'");
		
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, СценарийОбъект.Наименование
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
								, УровеньЖурналаРегистрации.Ошибка
								, МетаданныеСправочника
								,
								, Комментарий);
		КонецПопытки;	
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Удалить предопределенные драйверы оборудования
//
Процедура УдалитьПредопределенныеДрайверыОборудования() Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли; 
	
	МетаданныеСправочника = Метаданные.Справочники.ДрайверыОборудования;
	ШаблонКомментария = НСтр("ru = 'Не удалось удалить драйвер оборудования ""%1"" 
			|по причине: %2'");		
			
	ДрайверYarus = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ДрайверыОборудования.ДрайверШтрихМПлатежныйТерминалYarus");
	
	Если ЗначениеЗаполнено(ДрайверYarus) Тогда
		
		Попытка
			ДрайверОбъект = ДрайверYarus.ПолучитьОбъект();
			ДрайверОбъект.ИмяПредопределенныхДанных = "";
			ДрайверОбъект.Записать();	
			ДрайверОбъект.Удалить();
		Исключение
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, ДрайверYarus.Наименование
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
								, УровеньЖурналаРегистрации.Ошибка
								, МетаданныеСправочника
								,
								, Комментарий);
																
		КонецПопытки;
		
	КонецЕсли;
	
	ДрайверПриват = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ДрайверыОборудования.ДрайверПриватбанкЭквайринговыеТерминалы");
	Если ЗначениеЗаполнено(ДрайверПриват) Тогда
		
		Попытка
			ДрайверОбъект = ДрайверПриват.ПолучитьОбъект();
			ДрайверОбъект.ИмяПредопределенныхДанных = "";
			ДрайверОбъект.Записать();	
			ДрайверОбъект.Удалить();
		Исключение
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, ДрайверПриват.Наименование
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
								, УровеньЖурналаРегистрации.Ошибка
								, МетаданныеСправочника
								,
								, Комментарий);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры	

// Процедура, обновляет реквизит "СуммаОплачено" в документах Поступление, Возврат и заказ поставщику, Возрат от покупателя.
//
Процедура ОбновитьРеквизитСуммаОплаченоВДокументах(Параметры = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка КАК ДокументОплаты
	|ИЗ
	|	Документ.СписаниеДенежныхСредств.РасшифровкаПлатежа КАК СписаниеДенежныхСредствРасшифровкаПлатежа
	|ГДЕ
	|	СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
	|	И СписаниеДенежныхСредствРасшифровкаПлатежа.ДокументОснования.СуммаОплачено = 0
	|	И (СписаниеДенежныхСредствРасшифровкаПлатежа.ДокументОснования.Ссылка ССЫЛКА Документ.Поступление
	|			ИЛИ СписаниеДенежныхСредствРасшифровкаПлатежа.ДокументОснования.Ссылка ССЫЛКА Документ.ВозвратОтПокупателя
	|			ИЛИ СписаниеДенежныхСредствРасшифровкаПлатежа.ДокументОснования.Ссылка ССЫЛКА Документ.ЗаказПоставщику)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеДенежныхСредствРасшифровкаПлатежа
	|ГДЕ
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
	|	И ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументОснования.СуммаОплачено = 0
	|	И ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументОснования.Ссылка ССЫЛКА Документ.ВозвратПоставщику");
	
	//|	И (СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаПоставщику)
	//|			ИЛИ СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыКлиенту))
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			ДенежныеСредстваСервер.ЗаполнитьРеквизитыОплатыДокументаОснования(Выборка.ДокументОплаты);
		Исключение			
		КонецПопытки;
		
	КонецЦикла;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура, Обновляет внешнюю систему IP-Телефонии ITOOLABS в CRM, дописывая наименование АТС (Для статистики).
//
Процедура ЗаполнитьНаименованиеАТСДляIPТелефонииItoolabsВCRM(Параметры = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Попытка
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВнешниеСистемы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
		|ГДЕ
		|	НЕ ВнешниеСистемы.ПометкаУдаления
		|	И ВнешниеСистемы.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.IPТелефония)
		|	И ВнешниеСистемы.Используется
		|	И ВнешниеСистемы.Синхронизирована
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПодключаемоеОборудование.Ссылка КАК ПодключаемоеОборудование,
		|	ПодключаемоеОборудование.Параметры КАК Параметры
		|ИЗ
		|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|ГДЕ
		|	НЕ ПодключаемоеОборудование.ПометкаУдаления
		|	И ПодключаемоеОборудование.УстройствоИспользуется
		|	И ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.IPТелефония)
		|	И ПодключаемоеОборудование.ДрайверОборудования = ЗНАЧЕНИЕ(Справочник.ДрайверыОборудования.ДрайверХеликсITOOLABS)");
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();	
		ВыборкаВС = РезультатЗапроса[0].Выбрать();
		ВыборкаОборудование = РезультатЗапроса[1].Выгрузить(); 
		
		Если ЗначениеЗаполнено(ВыборкаОборудование) Тогда
			
			name_ATS = "";
			
			ПараметрыВС = ВыборкаОборудование[0].Параметры.Получить();		
			Если ТипЗнч(ПараметрыВС) = Тип("Структура") И ПараметрыВС.Свойство("ВыбранныйОператор")
				И ТипЗнч(ПараметрыВС.ВыбранныйОператор) = Тип("Структура") Тогда
				
				ПараметрыВС.ВыбранныйОператор.Свойство("Представление", name_ATS);
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(name_ATS) Тогда
				
				УИДТекущейСессии = ЛичныйКабинет.УидТекущейСессии();
				
				ДопПараметры = Новый Структура("operator_IP_telephony, name_ATS", "ITOOLABS", name_ATS); 
				
				Пока ВыборкаВС.Следующий() Цикл			
					ЛичныйКабинет.ОбновитьДанныеПубликацииВнешнейСистемы(ВыборкаВС.Ссылка, Истина, УИДТекущейСессии, ДопПараметры);	
				КонецЦикла;

			КонецЕсли;
			
		КонецЕсли; 
		
	Исключение
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Обновление внешней системы IP-Телефонии в CRM."
		, УровеньЖурналаРегистрации.Ошибка
		,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры  

// Процедура, заполняет реквизит "СодержаниеPush" в шаблонах сообщений.
//
Процедура ЗаполнениеСодержанияPushУведомленийШаблоновСообщений() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ШаблоныСообщений.Ссылка КАК Ссылка,
	|	ШаблоныСообщений.Содержание КАК Содержание
	|ИЗ
	|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|ГДЕ
	|	НЕ ШаблоныСообщений.ЭтоГруппа
	|	И НЕ ШаблоныСообщений.ПометкаУдаления
	|	И НЕ ШаблоныСообщений.Содержание ПОДОБНО """"");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			ШаблонОбъект				 = Выборка.Ссылка.ПолучитьОбъект();
			ШаблонОбъект.СодержаниеPush	 = Выборка.Содержание;
			ШаблонОбъект.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры  

// Процедура - Добавить роль добавление изменение заявок регистратуре
//
Процедура ДобавитьРольДобавлениеИзменениеЗаявокРегистратуре() Экспорт

	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ПометкаУдаления = ЛОЖЬ
	|	И Пользователи.РольПользователя = ЗНАЧЕНИЕ(Перечисление.РольПользователя.Регистратура)";
		
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторПользователяИБ);		
		
		Если ПользовательИБ <> Неопределено 		
			И ПользовательИБ.Роли.Содержит(Метаданные.Роли.ДобавлениеИзменениеЗаявокВсех) = Ложь Тогда
			
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ДобавлениеИзменениеЗаявокВсех);
			
			Попытка 
				ПользовательИБ.Записать();
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
