
#Область СлужебныйПрограммныйИнтерфейс

// Процедура создает значения по умолчанию справочника "КлассификаторСоциальныхГрупп"
//
Процедура СоздатьЗначенияПоУмолчанию() Экспорт
	
	Если НЕ ЗначениеЗаполнено(Справочники.КлассификаторСоциальныхГрупп.НайтиПоКоду("000000001")) Тогда
		ЭлементСправочника = Справочники.КлассификаторСоциальныхГрупп.СоздатьЭлемент();
		ЭлементСправочника.Наименование = "Работающее население";
		ЭлементСправочника.Значение = "Работающее население";
		ЭлементСправочника.КодОИД = "1";
		ЭлементСправочника.Записать();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Справочники.КлассификаторСоциальныхГрупп.НайтиПоКоду("000000002")) Тогда
		ЭлементСправочника = Справочники.КлассификаторСоциальныхГрупп.СоздатьЭлемент();
		ЭлементСправочника.Наименование = "Неработающее население";
		ЭлементСправочника.Значение = "Неработающее население";
		ЭлементСправочника.КодОИД = "2";
		ЭлементСправочника.Записать();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Справочники.КлассификаторСоциальныхГрупп.НайтиПоКоду("000000003")) Тогда
		ЭлементСправочника = Справочники.КлассификаторСоциальныхГрупп.СоздатьЭлемент();
		ЭлементСправочника.Наименование = "Инвалиды";
		ЭлементСправочника.Значение = "Инвалиды Великой Отечественной войны, лица, награжденные знаком ""Жителю блокадного Ленинграда"" и признанные инвалидами вследствие общего заболевания, трудового увечья и других причин (кроме лиц, инвалидность которых наступила вследствие их противоправных действий)";
		ЭлементСправочника.КодОИД = "3";
		ЭлементСправочника.Записать();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Справочники.КлассификаторСоциальныхГрупп.НайтиПоКоду("000000004")) Тогда
		ЭлементСправочника = Справочники.КлассификаторСоциальныхГрупп.СоздатьЭлемент();
		ЭлементСправочника.Наименование = "Обучающиеся в образовательных организациях по очной форме";
		ЭлементСправочника.Значение = "Обучающиеся в образовательных организациях по очной форме";
		ЭлементСправочника.КодОИД = "4";
		ЭлементСправочника.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Процедура создает значения из справочника oid:1.2.643.2.69.1.1.1.4 ИЭМК "КлассификаторСоциальныхГрупп"
//
Процедура ЗаполнитьСправочникКлассификаторСоциальныхГрупп(Параметры) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	Для Каждого Элемент Из Параметры Цикл
		
		КодЭлемента = Формат(Число(Элемент.code), "ЧЦ=9; ЧВН=; ЧГ=0");
		Если ЗначениеЗаполнено(Справочники.КлассификаторСоциальныхГрупп.НайтиПоКоду(КодЭлемента)) Тогда
			Если Элемент.display <> НРег(Справочники.КлассификаторСоциальныхГрупп.НайтиПоКоду(КодЭлемента).Значение) Тогда
				ЭлементСправочника = Справочники.КлассификаторСоциальныхГрупп.НайтиПоКоду(КодЭлемента).ПолучитьОбъект();
				ЭлементСправочника.Наименование = Лев(Врег(Лев(Элемент.display,1))+ Нрег(Сред(Элемент.display,2)), 100);
				Если Лев(ЭлементСправочника.Наименование, 8) = "Инвалиды" Тогда
					ЭлементСправочника.Наименование = "Инвалиды";
				КонецЕсли;
				ЭлементСправочника.Значение = Врег(Лев(Элемент.display,1))+ Нрег(Сред(Элемент.display,2));
				ЭлементСправочника.КодОИД = Элемент.code;
				ЭлементСправочника.Записать();
			КонецЕсли;
		Иначе
			ЭлементСправочника = Справочники.КлассификаторСоциальныхГрупп.СоздатьЭлемент();
			ЭлементСправочника.Наименование = Лев(Врег(Лев(Элемент.display,1))+ Нрег(Сред(Элемент.display,2)), 100);
			Если Лев(ЭлементСправочника.Наименование, 8) = "Инвалиды" Тогда
				ЭлементСправочника.Наименование = "Инвалиды";
			КонецЕсли;
			ЭлементСправочника.Значение = Врег(Лев(Элемент.display,1))+ Нрег(Сред(Элемент.display,2));
			ЭлементСправочника.КодОИД = Элемент.code;
			ЭлементСправочника.Код = КодЭлемента;
			ЭлементСправочника.Записать();
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти