
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ПриемТовары.Ссылка КАК Документ,
	|	ПриемТовары.Ссылка.Дата КАК Период,
	|	ПриемТовары.Ссылка.Склад КАК Склад,
	|	ПриемТовары.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПриемТовары.Ссылка.Контрагент КАК Контрагент,
	|	ПриемТовары.НомерСтроки КАК НомерСтроки,
	|	ПриемТовары.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ПриемТовары.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	ПриемТовары.Количество КАК Количество,
	|	ПриемТовары.СтавкаНДС КАК СтавкаНДС,
	|	ПриемТовары.Сумма КАК Сумма
	|ПОМЕСТИТЬ ТаблицаЗапасыНаСкладах
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПриемЗапасы.Ссылка КАК Ссылка,
	|		ПриемЗапасы.НомерСтроки КАК НомерСтроки,
	|		ПриемЗапасы.Номенклатура КАК Номенклатура,
	|		ПриемЗапасы.Партия КАК Партия,
	|		ПриемЗапасы.Количество КАК Количество,
	|		ПриемЗапасы.СтавкаНДС КАК СтавкаНДС,
	|		ПриемЗапасы.Всего КАК Сумма
	|	ИЗ
	|		Документ.Прием.Запасы КАК ПриемЗапасы
	|	ГДЕ
	|		ПриемЗапасы.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПриемПодарки.Ссылка,
	|		ПриемПодарки.НомерСтроки,
	|		ПриемПодарки.Номенклатура,
	|		NULL,
	|		ПриемПодарки.Количество,
	|		ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС),
	|		0
	|	ИЗ
	|		Документ.Прием.Подарки КАК ПриемПодарки
	|	ГДЕ
	|		ПриемПодарки.Ссылка = &Ссылка
	|		И ПриемПодарки.Использование = ИСТИНА) КАК ПриемТовары
	|ГДЕ
	|	ПриемТовары.Ссылка = &Ссылка
	|	И ПриемТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПриемСкидкиНаценки.Ссылка.Дата КАК Период,
	|	ПриемСкидкиНаценки.БонусныйСчет КАК БонусныйСчет,
	|	ПриемСкидкиНаценки.Ссылка КАК ДокументНачисления,
	|	ВЫБОР
	|		КОГДА &СуммаОплачено < ПриемСкидкиНаценки.Ссылка.СуммаДокумента
	|				И ПриемСкидкиНаценки.Ссылка.СуммаДокумента > 0
	|			ТОГДА ПриемСкидкиНаценки.Сумма * &СуммаОплачено / ПриемСкидкиНаценки.Ссылка.СуммаДокумента
	|		ИНАЧЕ ПриемСкидкиНаценки.Сумма
	|	КОНЕЦ КАК Сумма
	|ПОМЕСТИТЬ ВременнаяТаблицаНачислениеБонусов
	|ИЗ
	|	Документ.Прием.СкидкиНаценки КАК ПриемСкидкиНаценки
	|ГДЕ
	|	ПриемСкидкиНаценки.Ссылка = &Ссылка
	|	И ПриемСкидкиНаценки.Использование = ИСТИНА
	|	И ПриемСкидкиНаценки.ПризнакОплатыБонусом = ЛОЖЬ
	|	И ПриемСкидкиНаценки.СкидкаНаценка.НачислениеБонусами = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ПриемСкидкиНаценки.Ссылка.Дата КАК Период,
	|	ПриемСкидкиНаценки.БонусныйСчет КАК БонусныйСчет,
	|	NULL КАК ДокументНачисления,
	|	ПриемСкидкиНаценки.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВременнаяТаблицаСписаниеБонусов
	|ИЗ
	|	Документ.Прием.СкидкиНаценки КАК ПриемСкидкиНаценки
	|ГДЕ
	|	ПриемСкидкиНаценки.Ссылка = &Ссылка
	|	И ПриемСкидкиНаценки.Использование = ИСТИНА
	|	И ПриемСкидкиНаценки.ПризнакОплатыБонусом = ИСТИНА
	|	И ПриемСкидкиНаценки.Сумма > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриемПродажи.Ссылка КАК ДокументПродажи,
	|	ПриемПродажи.Дата КАК Период,
	|	ПриемПродажи.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПриемПродажи.Сотрудник КАК Сотрудник,
	|	ПриемПродажи.Ассистент КАК Ассистент,
	|	ПриемПродажи.ЗубнойТехник КАК ЗубнойТехник,
	|	ПриемПродажи.Ссылка.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ПриемПродажи.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|		ИНАЧЕ ПриемПродажи.Ссылка.Склад
	|	КОНЕЦ КАК Склад,
	|	ПриемПродажи.НомерСтроки КАК НомерСтроки,
	|	ПриемПродажи.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ПриемПродажи.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	ПриемПродажи.Количество КАК Количество,
	|	ПриемПродажи.СтоимостьБезСкидки КАК СтоимостьБезСкидки,
	|	ПриемПродажи.Стоимость КАК Стоимость,
	|	ВЫБОР
	|		КОГДА НЕ ПриемПродажи.Ссылка.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА ПриемПродажи.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ПриемПродажи.Ссылка.Контрагент
	|	КОНЕЦ КАК КонтрагентПлательщик,
	|	ПриемПродажи.НомерЗуба КАК НомерЗуба,
	|	ПриемПродажи.УЕТ КАК КоличествоУЕТ,
	|	ПриемПродажи.Ссылка.КартаКонтрагента КАК КартаКонтрагента
	|ПОМЕСТИТЬ ВременнаяТаблицаПродажи
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПриемЗапасы.Ссылка.Дата КАК Дата,
	|		ПриемЗапасы.Ссылка КАК Ссылка,
	|		ПриемЗапасы.Ссылка.Сотрудник КАК Сотрудник,
	|		ПриемЗапасы.НомерСтроки КАК НомерСтроки,
	|		ПриемЗапасы.Номенклатура КАК Номенклатура,
	|		ПриемЗапасы.Партия КАК Партия,
	|		ПриемЗапасы.Количество КАК Количество,
	|		ПриемЗапасы.Цена * ПриемЗапасы.КоличествоУпаковок КАК СтоимостьБезСкидки,
	|		ПриемЗапасы.Сумма КАК Стоимость,
	|		NULL КАК НомерЗуба,
	|		ПриемЗапасы.Ссылка.Ассистент КАК Ассистент,
	|		ПриемЗапасы.ЗубнойТехник КАК ЗубнойТехник,
	|		NULL КАК УЕТ
	|	ИЗ
	|		Документ.Прием.Запасы КАК ПриемЗапасы
	|	ГДЕ
	|		ПриемЗапасы.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПриемЛечение.Ссылка.Дата,
	|		ПриемЛечение.Ссылка,
	|		ВЫБОР
	|			КОГДА НЕ НесколькоВрачейВОдномПриеме.Значение
	|					ИЛИ ПриемЛечение.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|				ТОГДА ПриемЛечение.Ссылка.Сотрудник
	|			ИНАЧЕ ПриемЛечение.Сотрудник
	|		КОНЕЦ,
	|		ПриемЛечение.НомерСтроки,
	|		ПриемЛечение.Номенклатура,
	|		NULL,
	|		ПриемЛечение.Количество,
	|		ПриемЛечение.Цена * ПриемЛечение.КоличествоУпаковок,
	|		ПриемЛечение.Сумма,
	|		ПриемЛечение.Зуб,
	|		ПриемЛечение.Ссылка.Ассистент,
	|		ПриемЛечение.ЗубнойТехник,
	|		ПриемЛечение.УЕТ
	|	ИЗ
	|		Документ.Прием.Лечение КАК ПриемЛечение,
	|		Константа.НесколькоВрачейВОдномПриеме КАК НесколькоВрачейВОдномПриеме
	|	ГДЕ
	|		ПриемЛечение.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПриемЛечение.Ссылка.Дата,
	|		ПриемЛечение.Рекламация.Ссылка,
	|		ПриемЛечение.Рекламация.Сотрудник,
	|		ПриемЛечение.НомерСтроки,
	|		ПриемЛечение.Номенклатура,
	|		NULL,
	|		ПриемЛечение.Количество * -1,
	|		ПриемЛечение.Цена * ПриемЛечение.КоличествоУпаковок * -1,
	|		ПриемЛечение.Сумма * -1,
	|		ПриемЛечение.Зуб,
	|		ПриемЛечение.Ссылка.Ассистент,
	|		ПриемЛечение.ЗубнойТехник,
	|		ПриемЛечение.УЕТ
	|	ИЗ
	|		Документ.Прием.Лечение КАК ПриемЛечение
	|	ГДЕ
	|		ПриемЛечение.Ссылка = &Ссылка
	|		И ПриемЛечение.Рекламация <> ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПриемПодарки.Ссылка.Дата,
	|		ПриемПодарки.Ссылка,
	|		ПриемПодарки.Ссылка.Сотрудник,
	|		ПриемПодарки.НомерСтроки,
	|		ПриемПодарки.Номенклатура,
	|		NULL,
	|		ПриемПодарки.КоличествоУпаковок,
	|		0,
	|		0,
	|		NULL,
	|		ПриемПодарки.Ссылка.Ассистент,
	|		NULL,
	|		NULL
	|	ИЗ
	|		Документ.Прием.Подарки КАК ПриемПодарки
	|	ГДЕ
	|		ПриемПодарки.Ссылка = &Ссылка
	|		И ПриемПодарки.Использование = ИСТИНА) КАК ПриемПродажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	СторнированиеДокументовАванса.Ссылка.Дата КАК Период,
	|	ВЫБОР
	|		КОГДА НЕ СторнированиеДокументовАванса.Ссылка.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА СторнированиеДокументовАванса.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ СторнированиеДокументовАванса.Ссылка.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	СторнированиеДокументовАванса.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА СторнированиеДокументовАванса.Ссылка.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяССылка)
	|			ТОГДА СторнированиеДокументовАванса.Ссылка.СтруктурнаяЕдиница.Организация
	|		ИНАЧЕ СторнированиеДокументовАванса.Ссылка.Организация
	|	КОНЕЦ КАК Организация,
	|	NULL КАК Ссылка,
	|	СторнированиеДокументовАванса.ДокументАванса КАК ДокументАванса,
	|	-СУММА(СторнированиеДокументовАванса.Сумма) КАК Сумма,
	|	NULL КАК ЭтоАванс,
	|	СторнированиеДокументовАванса.Ссылка.ПолисМедСтрахования.Договор КАК Договор
	|ПОМЕСТИТЬ ВременнаяТаблицаВзаиморасчетыКонтрагентов
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(ПриемЛечение.Сумма) КАК Сумма,
	|		ПриемЛечение.ДокументАванса КАК ДокументАванса,
	|		ПриемЛечение.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.Прием.Лечение КАК ПриемЛечение,
	|		Константа.НарядЗаказУвеличиваетЗадолженность КАК НарядЗаказУвеличиваетЗадолженность,
	|		Константа.УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов КАК УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов
	|	ГДЕ
	|		ПриемЛечение.Ссылка = &Ссылка
	|		И ПриемЛечение.ДокументАванса В(&ДокументыАвансов)
	|		И ПриемЛечение.ДокументАванса ССЫЛКА Документ.НарядЗаказ
	|		И НарядЗаказУвеличиваетЗадолженность.Значение = ИСТИНА
	|		И (ПриемЛечение.Рекламация = НЕОПРЕДЕЛЕНО
	|				ИЛИ ПриемЛечение.Рекламация = ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка))
	|		И УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов.Значение = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПриемЛечение.ДокументАванса,
	|		ПриемЛечение.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(ПриемЗапасы.Сумма),
	|		ПриемЗапасы.ДокументАванса,
	|		ПриемЗапасы.Ссылка
	|	ИЗ
	|		Документ.Прием.Запасы КАК ПриемЗапасы,
	|		Константа.НарядЗаказУвеличиваетЗадолженность КАК НарядЗаказУвеличиваетЗадолженность,
	|		Константа.УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов КАК УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов
	|	ГДЕ
	|		ПриемЗапасы.Ссылка = &Ссылка
	|		И ПриемЗапасы.ДокументАванса В(&ДокументыАвансов)
	|		И ПриемЗапасы.ДокументАванса ССЫЛКА Документ.НарядЗаказ
	|		И НарядЗаказУвеличиваетЗадолженность.Значение = ИСТИНА
	|		И УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов.Значение = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПриемЗапасы.ДокументАванса,
	|		ПриемЗапасы.Ссылка) КАК СторнированиеДокументовАванса
	|ГДЕ
	|	СторнированиеДокументовАванса.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СторнированиеДокументовАванса.ДокументАванса,
	|	СторнированиеДокументовАванса.Ссылка.Дата,
	|	СторнированиеДокументовАванса.Ссылка.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА СторнированиеДокументовАванса.Ссылка.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяССылка)
	|			ТОГДА СторнированиеДокументовАванса.Ссылка.СтруктурнаяЕдиница.Организация
	|		ИНАЧЕ СторнированиеДокументовАванса.Ссылка.Организация
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ СторнированиеДокументовАванса.Ссылка.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА СторнированиеДокументовАванса.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ СторнированиеДокументовАванса.Ссылка.Контрагент
	|	КОНЕЦ,
	|	СторнированиеДокументовАванса.Ссылка.ПолисМедСтрахования.Договор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ЗадолженностьНаОснованииАванса.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА НЕ ЗадолженностьНаОснованииАванса.Ссылка.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА ЗадолженностьНаОснованииАванса.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ЗадолженностьНаОснованииАванса.Ссылка.Контрагент
	|	КОНЕЦ,
	|	ЗадолженностьНаОснованииАванса.Ссылка.СтруктурнаяЕдиница,
	|	ЗадолженностьНаОснованииАванса.Ссылка.СтруктурнаяЕдиница.Организация,
	|	ЗадолженностьНаОснованииАванса.Ссылка,
	|	ВЫБОР
	|		КОГДА УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов.Значение = ИСТИНА
	|			ТОГДА ЗадолженностьНаОснованииАванса.ДокументАванса
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ЗадолженностьНаОснованииАванса.Сумма),
	|	NULL,
	|	ЗадолженностьНаОснованииАванса.Ссылка.ПолисМедСтрахования.Договор
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(ПриемЛечение.Сумма) КАК Сумма,
	|		ВЫБОР
	|			КОГДА НарядЗаказЗапасы.ПланЛечения ЕСТЬ NULL
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = НЕОПРЕДЕЛЕНО
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.ПланЛечения.ПустаяСсылка)
	|				ТОГДА ПриемЛечение.ДокументАванса
	|			ИНАЧЕ НарядЗаказЗапасы.ПланЛечения
	|		КОНЕЦ КАК ДокументАванса,
	|		ПриемЛечение.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.Прием.Лечение КАК ПриемЛечение
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
	|			ПО ПриемЛечение.ДокументАванса = НарядЗаказЗапасы.Ссылка
	|				И ПриемЛечение.НомерЗаказа = НарядЗаказЗапасы.НомерЗаказа
	|	ГДЕ
	|		ПриемЛечение.Ссылка = &Ссылка
	|		И ПриемЛечение.ДокументАванса В(&ДокументыАвансов)
	|		И (ПриемЛечение.Рекламация = НЕОПРЕДЕЛЕНО
	|				ИЛИ ПриемЛечение.Рекламация = ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПриемЛечение.Ссылка,
	|		ВЫБОР
	|			КОГДА НарядЗаказЗапасы.ПланЛечения ЕСТЬ NULL
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = НЕОПРЕДЕЛЕНО
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.ПланЛечения.ПустаяСсылка)
	|				ТОГДА ПриемЛечение.ДокументАванса
	|			ИНАЧЕ НарядЗаказЗапасы.ПланЛечения
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(ПриемЗапасы.Сумма),
	|		ВЫБОР
	|			КОГДА НарядЗаказЗапасы.ПланЛечения ЕСТЬ NULL
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = НЕОПРЕДЕЛЕНО
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.ПланЛечения.ПустаяСсылка)
	|				ТОГДА ПриемЗапасы.ДокументАванса
	|			ИНАЧЕ НарядЗаказЗапасы.ПланЛечения
	|		КОНЕЦ,
	|		ПриемЗапасы.Ссылка
	|	ИЗ
	|		Документ.Прием.Запасы КАК ПриемЗапасы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
	|			ПО ПриемЗапасы.ДокументАванса = НарядЗаказЗапасы.Ссылка
	|				И ПриемЗапасы.НомерЗаказа = НарядЗаказЗапасы.НомерЗаказа
	|	ГДЕ
	|		ПриемЗапасы.Ссылка = &Ссылка
	|		И ПриемЗапасы.ДокументАванса В(&ДокументыАвансов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПриемЗапасы.Ссылка,
	|		ВЫБОР
	|			КОГДА НарядЗаказЗапасы.ПланЛечения ЕСТЬ NULL
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = НЕОПРЕДЕЛЕНО
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.ПланЛечения.ПустаяСсылка)
	|				ТОГДА ПриемЗапасы.ДокументАванса
	|			ИНАЧЕ НарядЗаказЗапасы.ПланЛечения
	|		КОНЕЦ) КАК ЗадолженностьНаОснованииАванса,
	|	Константа.УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов КАК УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов
	|ГДЕ
	|	ЗадолженностьНаОснованииАванса.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗадолженностьНаОснованииАванса.Ссылка.Дата,
	|	ЗадолженностьНаОснованииАванса.Ссылка.СтруктурнаяЕдиница,
	|	ЗадолженностьНаОснованииАванса.Ссылка.СтруктурнаяЕдиница.Организация,
	|	ВЫБОР
	|		КОГДА НЕ ЗадолженностьНаОснованииАванса.Ссылка.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА ЗадолженностьНаОснованииАванса.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ЗадолженностьНаОснованииАванса.Ссылка.Контрагент
	|	КОНЕЦ,
	|	ЗадолженностьНаОснованииАванса.Ссылка,
	|	ВЫБОР
	|		КОГДА УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов.Значение = ИСТИНА
	|			ТОГДА ЗадолженностьНаОснованииАванса.ДокументАванса
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ЗадолженностьНаОснованииАванса.Ссылка.ПолисМедСтрахования.Договор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ЗадолженностьБезОснованияАванса.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА НЕ ЗадолженностьБезОснованияАванса.Ссылка.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА ЗадолженностьБезОснованияАванса.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ЗадолженностьБезОснованияАванса.Ссылка.Контрагент
	|	КОНЕЦ,
	|	ЗадолженностьБезОснованияАванса.Ссылка.СтруктурнаяЕдиница,
	|	ЗадолженностьБезОснованияАванса.Ссылка.СтруктурнаяЕдиница.Организация,
	|	ЗадолженностьБезОснованияАванса.Ссылка,
	|	NULL,
	|	СУММА(ЗадолженностьБезОснованияАванса.Сумма),
	|	NULL,
	|	ЗадолженностьБезОснованияАванса.Ссылка.ПолисМедСтрахования.Договор
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПриемЛечение.Ссылка КАК Ссылка,
	|		СУММА(ПриемЛечение.Сумма) КАК Сумма
	|	ИЗ
	|		Документ.Прием.Лечение КАК ПриемЛечение
	|	ГДЕ
	|		ПриемЛечение.Ссылка = &Ссылка
	|		И НЕ ПриемЛечение.ДокументАванса В (&ДокументыАвансов)
	|		И (ПриемЛечение.Рекламация = НЕОПРЕДЕЛЕНО
	|				ИЛИ ПриемЛечение.Рекламация = ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПриемЛечение.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПриемЗапасы.Ссылка,
	|		СУММА(ПриемЗапасы.Сумма)
	|	ИЗ
	|		Документ.Прием.Запасы КАК ПриемЗапасы
	|	ГДЕ
	|		ПриемЗапасы.Ссылка = &Ссылка
	|		И НЕ ПриемЗапасы.ДокументАванса В (&ДокументыАвансов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПриемЗапасы.Ссылка) КАК ЗадолженностьБезОснованияАванса
	|ГДЕ
	|	ЗадолженностьБезОснованияАванса.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗадолженностьБезОснованияАванса.Ссылка.Дата,
	|	ЗадолженностьБезОснованияАванса.Ссылка.СтруктурнаяЕдиница,
	|	ЗадолженностьБезОснованияАванса.Ссылка.СтруктурнаяЕдиница.Организация,
	|	ЗадолженностьБезОснованияАванса.Ссылка,
	|	ВЫБОР
	|		КОГДА НЕ ЗадолженностьБезОснованияАванса.Ссылка.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА ЗадолженностьБезОснованияАванса.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ЗадолженностьБезОснованияАванса.Ссылка.Контрагент
	|	КОНЕЦ,
	|	ЗадолженностьБезОснованияАванса.Ссылка.ПолисМедСтрахования.Договор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ПриемУчтенныеАвансы.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА НЕ ПриемУчтенныеАвансы.Ссылка.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА ПриемУчтенныеАвансы.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ПриемУчтенныеАвансы.Ссылка.Контрагент
	|	КОНЕЦ,
	|	ПриемУчтенныеАвансы.Ссылка.СтруктурнаяЕдиница,
	|	ПриемУчтенныеАвансы.Ссылка.СтруктурнаяЕдиница.Организация,
	|	NULL,
	|	ВЫБОР
	|		КОГДА УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов.Значение = ИСТИНА
	|			ТОГДА ПриемУчтенныеАвансы.ДокументАванса
	|	КОНЕЦ,
	|	СУММА(-ПриемУчтенныеАвансы.СуммаАванса),
	|	ИСТИНА,
	|	ПриемУчтенныеАвансы.Ссылка.ПолисМедСтрахования.Договор
	|ИЗ
	|	Документ.Прием.УчтенныеАвансы КАК ПриемУчтенныеАвансы,
	|	Константа.УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов КАК УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов
	|ГДЕ
	|	ПриемУчтенныеАвансы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриемУчтенныеАвансы.Ссылка.Дата,
	|	ПриемУчтенныеАвансы.Ссылка.СтруктурнаяЕдиница,
	|	ПриемУчтенныеАвансы.Ссылка.СтруктурнаяЕдиница.Организация,
	|	ВЫБОР
	|		КОГДА НЕ ПриемУчтенныеАвансы.Ссылка.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА ПриемУчтенныеАвансы.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ПриемУчтенныеАвансы.Ссылка.Контрагент
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов.Значение = ИСТИНА
	|			ТОГДА ПриемУчтенныеАвансы.ДокументАванса
	|	КОНЕЦ,
	|	ПриемУчтенныеАвансы.Ссылка.ПолисМедСтрахования.Договор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ПриемУчтенныеАвансы.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА НЕ ПриемУчтенныеАвансы.Ссылка.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА ПриемУчтенныеАвансы.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ПриемУчтенныеАвансы.Ссылка.Контрагент
	|	КОНЕЦ,
	|	ПриемУчтенныеАвансы.Ссылка.СтруктурнаяЕдиница,
	|	ПриемУчтенныеАвансы.Ссылка.СтруктурнаяЕдиница.Организация,
	|	ПриемУчтенныеАвансы.Ссылка,
	|	ВЫБОР
	|		КОГДА ПриемУчтенныеАвансы.ДокументАвансаДляРегистра <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ПриемУчтенныеАвансы.ДокументАвансаДляРегистра
	|		ИНАЧЕ ПриемУчтенныеАвансы.ДокументАванса
	|	КОНЕЦ,
	|	СУММА(ПриемУчтенныеАвансы.СуммаАванса),
	|	NULL,
	|	ПриемУчтенныеАвансы.Ссылка.ПолисМедСтрахования.Договор
	|ИЗ
	|	Документ.Прием.УчтенныеАвансы КАК ПриемУчтенныеАвансы
	|ГДЕ
	|	ПриемУчтенныеАвансы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриемУчтенныеАвансы.Ссылка.Дата,
	|	ПриемУчтенныеАвансы.Ссылка.СтруктурнаяЕдиница,
	|	ПриемУчтенныеАвансы.Ссылка.СтруктурнаяЕдиница.Организация,
	|	ПриемУчтенныеАвансы.Ссылка,
	|	ВЫБОР
	|		КОГДА ПриемУчтенныеАвансы.ДокументАвансаДляРегистра <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ПриемУчтенныеАвансы.ДокументАвансаДляРегистра
	|		ИНАЧЕ ПриемУчтенныеАвансы.ДокументАванса
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ПриемУчтенныеАвансы.Ссылка.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА ПриемУчтенныеАвансы.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ПриемУчтенныеАвансы.Ссылка.Контрагент
	|	КОНЕЦ,
	|	ПриемУчтенныеАвансы.Ссылка.ПолисМедСтрахования.Договор
	|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВложенныйЗапрос.НомерСтроки,
	//|	ВложенныйЗапрос.ВидДвижения,
	//|	ВложенныйЗапрос.Период,
	//|	ВложенныйЗапрос.Контрагент,
	//|	ВложенныйЗапрос.СтруктурнаяЕдиница,
	//|	ВложенныйЗапрос.Организация,
	//|	NULL,
	//|	NULL,
	//|	ВложенныйЗапрос.Сумма,
	//|	NULL,
	//|	ВложенныйЗапрос.Договор
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		6 КАК НомерСтроки,
	//|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	//|		ПриемСкидкиНаценки.Ссылка.Дата КАК Период,
	//|		ПриемСкидкиНаценки.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|		ПриемСкидкиНаценки.Ссылка.Контрагент КАК Контрагент,
	//|		СУММА(ВЫБОР
	//|				КОГДА ПриемСкидкиНаценки.Ссылка.СуммаОплачено < ПриемСкидкиНаценки.Ссылка.СуммаДокумента
	//|					ТОГДА ПриемСкидкиНаценки.Сумма * ПриемСкидкиНаценки.Ссылка.СуммаОплачено / ПриемСкидкиНаценки.Ссылка.СуммаДокумента
	//|				ИНАЧЕ ПриемСкидкиНаценки.Сумма
	//|			КОНЕЦ) КАК Сумма,
	//|		ПриемСкидкиНаценки.Ссылка.СтруктурнаяЕдиница.Организация КАК Организация,
	//|		ПриемСкидкиНаценки.Ссылка.ПолисМедСтрахования.Договор КАК Договор
	//|	ИЗ
	//|		Документ.Прием.СкидкиНаценки КАК ПриемСкидкиНаценки
	//|	ГДЕ
	//|		ПриемСкидкиНаценки.Ссылка = &Ссылка
	//|		И ПриемСкидкиНаценки.НачислениеНаЛицевойСчетУдалить = ИСТИНА
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		ПриемСкидкиНаценки.Ссылка.СтруктурнаяЕдиница,
	//|		ПриемСкидкиНаценки.Ссылка,
	//|		ПриемСкидкиНаценки.Ссылка.Контрагент,
	//|		ПриемСкидкиНаценки.Ссылка.Дата,
	//|		ПриемСкидкиНаценки.Ссылка.СтруктурнаяЕдиница.Организация,
	//|		ПриемСкидкиНаценки.Ссылка.ПолисМедСтрахования.Договор) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриемСкидкиНаценки.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПриемСкидкиНаценки.Ссылка.Ссылка КАК ДокументПродажи,
	|	ПриемСкидкиНаценки.Ссылка.Дата КАК Период,
	|	ВЫБОР
	|		КОГДА ПриемСкидкиНаценки.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПриемСкидкиНаценки.Контрагент
	|		ИНАЧЕ ПриемСкидкиНаценки.Ссылка.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ПриемСкидкиНаценки.Ссылка.Сотрудник КАК Сотрудник,
	|	ПриемСкидкиНаценки.НоменклатураСкидки КАК Номенклатура,
	|	NULL КАК НоменклатураПодарок,
	|	ЕСТЬNULL(ПриемСкидкиНаценки.СкидкаНаценка, ЗНАЧЕНИЕ(Справочник.СкидкиНаценки.ПустаяСсылка)) КАК СкидкаНаценка,
	|	ПриемСкидкиНаценки.СкидкаНаценка.НачислениеБонусами КАК НаБонусныйСчет,
	|	ВЫБОР
	|		КОГДА ПриемСкидкиНаценки.СкидкаНаценка.СпособПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.СпособПредоставленияСкидки.Сумма)
	|				ИЛИ ПриемСкидкиНаценки.СкидкаНаценка.СпособПредоставленияСкидки = ЗНАЧЕНИЕ(Перечисление.СпособПредоставленияСкидки.СуммаНаДокумент)
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ПриемЗапасы.КлючСтроки ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ПриемЗапасы.Количество * ПриемЗапасы.Цена > 0
	|									ТОГДА ПриемСкидкиНаценки.Сумма / (ПриемЗапасы.Количество * ПриемЗапасы.Цена) * 100
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					КОГДА НЕ ПриемЛечение.КлючСтроки ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ПриемЛечение.Количество * ПриемЛечение.Цена > 0
	|									ТОГДА ПриемСкидкиНаценки.Сумма / (ПриемЛечение.Количество * ПриемЛечение.Цена) * 100
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ПриемСкидкиНаценки.СкидкаНаценка.ЗначениеСкидкиНаценки
	|	КОНЕЦ КАК ПроцентСкидкиНаценки,
	|	ПриемСкидкиНаценки.Сумма КАК СуммаСкидки,
	|	ВЫБОР
	|		КОГДА НЕ ПриемЗапасы.КлючСтроки ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ПриемЗапасы.Количество, 0) * ЕСТЬNULL(ПриемЗапасы.Цена, 0)
	|		КОГДА НЕ ПриемЛечение.КлючСтроки ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ПриемЛечение.Количество, 0) * ЕСТЬNULL(ПриемЛечение.Цена, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПродажи
	|ПОМЕСТИТЬ ТаблицаПредоставленныеСкидки
	|ИЗ
	|	Документ.Прием.СкидкиНаценки КАК ПриемСкидкиНаценки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Прием.Запасы КАК ПриемЗапасы
	|		ПО ПриемСкидкиНаценки.Ссылка.Ссылка = ПриемЗапасы.Ссылка
	|			И ПриемСкидкиНаценки.КлючСтроки = ПриемЗапасы.КлючСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Прием.Лечение КАК ПриемЛечение
	|		ПО ПриемСкидкиНаценки.Ссылка.Ссылка = ПриемЛечение.Ссылка
	|			И ПриемСкидкиНаценки.КлючСтроки = ПриемЛечение.КлючСтроки
	|ГДЕ
	|	ПриемСкидкиНаценки.Ссылка = &Ссылка
	|	И ЕСТЬNULL(ПриемСкидкиНаценки.Сумма, 0) <> 0
	|	И ПриемСкидкиНаценки.Использование = ИСТИНА
	|	И ПриемСкидкиНаценки.ПризнакОплатыБонусом = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	ПриемЗапасы.Ссылка,
	|	ПриемЗапасы.Ссылка.Дата,
	|	ПриемЗапасы.Ссылка.Контрагент,
	|	ПриемЗапасы.Ссылка.Сотрудник,
	|	ПриемЗапасы.Номенклатура,
	|	NULL,
	|	ЗНАЧЕНИЕ(Справочник.СкидкиНаценки.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА ПриемЗапасы.Цена * ПриемЗапасы.КоличествоУпаковок > 0
	|			ТОГДА ПриемЗапасы.СуммаРучнойСкидки / (ПриемЗапасы.Цена * ПриемЗапасы.КоличествоУпаковок) * 100
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ПриемЗапасы.СуммаРучнойСкидки,
	|	ПриемЗапасы.Цена * ПриемЗапасы.КоличествоУпаковок
	|ИЗ
	|	Документ.Прием.Запасы КАК ПриемЗапасы
	|ГДЕ
	|	ПриемЗапасы.Ссылка = &Ссылка
	|	И ПриемЗапасы.СуммаРучнойСкидки > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемЛечение.Ссылка.СтруктурнаяЕдиница,
	|	ПриемЛечение.Ссылка,
	|	ПриемЛечение.Ссылка.Дата,
	|	ПриемЛечение.Ссылка.Контрагент,
	|	ВЫБОР
	|		КОГДА НЕ НесколькоВрачейВОдномПриеме.Значение
	|				ИЛИ ПриемЛечение.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ПриемЛечение.Ссылка.Сотрудник
	|		ИНАЧЕ ПриемЛечение.Сотрудник
	|	КОНЕЦ,
	|	ПриемЛечение.Номенклатура,
	|	NULL,
	|	ЗНАЧЕНИЕ(Справочник.СкидкиНаценки.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА ПриемЛечение.Цена * ПриемЛечение.КоличествоУпаковок > 0
	|			ТОГДА ПриемЛечение.СуммаРучнойСкидки / (ПриемЛечение.Цена * ПриемЛечение.КоличествоУпаковок) * 100
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ПриемЛечение.Количество * ПриемЛечение.Цена * ПриемЛечение.ПроцентСкидкиНаценки * 0.01,
	|	ПриемЛечение.Цена * ПриемЛечение.КоличествоУпаковок
	|ИЗ
	|	Документ.Прием.Лечение КАК ПриемЛечение,
	|	Константа.НесколькоВрачейВОдномПриеме КАК НесколькоВрачейВОдномПриеме
	|ГДЕ
	|	ПриемЛечение.Ссылка = &Ссылка
	|	И ПриемЛечение.СуммаРучнойСкидки > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемСкидкиНаценкиПодарки.Ссылка.СтруктурнаяЕдиница,
	|	ПриемСкидкиНаценкиПодарки.Ссылка,
	|	ПриемСкидкиНаценкиПодарки.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА ПриемСкидкиНаценкиПодарки.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПриемСкидкиНаценкиПодарки.Контрагент
	|		ИНАЧЕ ПриемСкидкиНаценкиПодарки.Ссылка.Контрагент
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ПриемЗапасы.КлючСтроки ЕСТЬ NULL
	|			ТОГДА ПриемЗапасы.Ссылка.Сотрудник
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ НесколькоВрачейВОдномПриеме.Значение
	|						ИЛИ ПриемЛечение.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|					ТОГДА ПриемЛечение.Ссылка.Сотрудник
	|				ИНАЧЕ ПриемЛечение.Сотрудник
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ПриемЗапасы.КлючСтроки ЕСТЬ NULL
	|			ТОГДА ПриемЗапасы.Номенклатура
	|		КОГДА НЕ ПриемЛечение.КлючСтроки ЕСТЬ NULL
	|			ТОГДА ПриемЛечение.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ПриемСкидкиНаценкиПодарки.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.СкидкиНаценки.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ПриемСкидкиНаценкиПодарки.Количество,
	|	0,
	|	0
	|ИЗ
	|	Документ.Прием.Подарки КАК ПриемСкидкиНаценкиПодарки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Прием.Запасы КАК ПриемЗапасы
	|		ПО (ПриемЗапасы.Ссылка = ПриемСкидкиНаценкиПодарки.Ссылка)
	|			И (ПриемЗапасы.КлючСтроки = ПриемСкидкиНаценкиПодарки.КлючСтроки)
	|			И (ПриемСкидкиНаценкиПодарки.КлючСтроки <> &ПустойУникальныйИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Прием.Лечение КАК ПриемЛечение
	|		ПО (ПриемЛечение.Ссылка = ПриемСкидкиНаценкиПодарки.Ссылка)
	|			И (ПриемЛечение.КлючСтроки = ПриемСкидкиНаценкиПодарки.КлючСтроки)
	|			И (ПриемСкидкиНаценкиПодарки.КлючСтроки <> &ПустойУникальныйИдентификатор),
	|	Константа.НесколькоВрачейВОдномПриеме КАК НесколькоВрачейВОдномПриеме
	|ГДЕ
	|	ПриемСкидкиНаценкиПодарки.Ссылка = &Ссылка
	|	И ПриемСкидкиНаценкиПодарки.Использование = ИСТИНА
	|;
	|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	//|	ПриемСкидкиНаценки.Ссылка.Дата КАК Период,
	//|	ПриемСкидкиНаценки.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|	ПриемСкидкиНаценки.Ссылка.Контрагент КАК Контрагент,
	//|	ВЫБОР
	//|		КОГДА ПриемСкидкиНаценки.СкидкаНаценка.ВидЛицевогоСчета = ЗНАЧЕНИЕ(Справочник.ВидыЛицевыхСчетов.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЛицевыхСчетов.ОсновнойЛицевойСчет)
	//|		ИНАЧЕ ПриемСкидкиНаценки.СкидкаНаценка.ВидЛицевогоСчета
	//|	КОНЕЦ КАК ВидСчета,
	//|	СУММА(ВЫБОР
	//|			КОГДА ПриемСкидкиНаценки.Ссылка.СуммаОплачено < ПриемСкидкиНаценки.Ссылка.СуммаДокумента
	//|				ТОГДА ПриемСкидкиНаценки.Сумма * ПриемСкидкиНаценки.Ссылка.СуммаОплачено / ПриемСкидкиНаценки.Ссылка.СуммаДокумента
	//|			ИНАЧЕ ПриемСкидкиНаценки.Сумма
	//|		КОНЕЦ) КАК Сумма
	//|ПОМЕСТИТЬ ТаблицаДенежныеСредстваНаЛицевыхСчетах
	//|ИЗ
	//|	Документ.Прием.СкидкиНаценки КАК ПриемСкидкиНаценки
	//|ГДЕ
	//|	ПриемСкидкиНаценки.Ссылка = &Ссылка
	//|	И ПриемСкидкиНаценки.НачислениеНаЛицевойСчетУдалить = ИСТИНА
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПриемСкидкиНаценки.Ссылка.СтруктурнаяЕдиница,
	//|	ПриемСкидкиНаценки.Ссылка,
	//|	ПриемСкидкиНаценки.Ссылка.Контрагент,
	//|	ПриемСкидкиНаценки.Ссылка.Дата,
	//|	ВЫБОР
	//|		КОГДА ПриемСкидкиНаценки.СкидкаНаценка.ВидЛицевогоСчета = ЗНАЧЕНИЕ(Справочник.ВидыЛицевыхСчетов.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЛицевыхСчетов.ОсновнойЛицевойСчет)
	//|		ИНАЧЕ ПриемСкидкиНаценки.СкидкаНаценка.ВидЛицевогоСчета
	//|	КОНЕЦ
	//|
	//|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПриемЗапасы.Ссылка.Дата КАК Период,
	|	ПриемЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПриемЗапасы.Номенклатура КАК Сертификат,
	|	ПриемЗапасы.Партия КАК СерийныйНомер,
	|	ВЫБОР
	|		КОГДА ПриемЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|				И НЕ ПриемЗапасы.Номенклатура.ВидНоминала
	|			ТОГДА ПриемЗапасы.Номенклатура.Номинал
	|		ИНАЧЕ ПриемЗапасы.Цена
	|	КОНЕЦ КАК Сумма,
	|	ПриемЗапасы.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ПриемЗапасы.Номенклатура.ЭтоИменнойСертификат
	|			ТОГДА ПриемЗапасы.Ссылка.Контрагент
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Контрагент
	|ПОМЕСТИТЬ ВременнаяТаблицаСертификаты
	|ИЗ
	|	Документ.Прием.Запасы КАК ПриемЗапасы
	|ГДЕ
	|	ПриемЗапасы.Ссылка = &Ссылка
	|	И ПриемЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ПриемПодарки.Ссылка.Дата,
	|	ПриемПодарки.Ссылка.СтруктурнаяЕдиница,
	|	ПриемПодарки.Номенклатура,
	|	ПриемПодарки.Партия,
	|	ВЫБОР
	|		КОГДА ПриемПодарки.Номенклатура.ВидНоминала = ИСТИНА
	|			ТОГДА ПриемПодарки.СуммаПодарочногоСертификата
	|		ИНАЧЕ ПриемПодарки.Номенклатура.Номинал
	|	КОНЕЦ,
	|	ПриемПодарки.Количество,
	|	ПриемПодарки.Контрагент
	|ИЗ
	|	Документ.Прием.Подарки КАК ПриемПодарки
	|ГДЕ
	|	ПриемПодарки.Ссылка = &Ссылка
	|	И ПриемПодарки.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|	И ПриемПодарки.Использование = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ПриемЛечение.ДокументАванса КАК ПланЛечения,
	|	ПриемЛечение.КлючСтроки КАК КлючСтроки,
	|	ПриемЛечение.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПриемЛечение.Ссылка.Контрагент КАК Контрагент,
	|	ПриемЛечение.Зуб КАК Зуб,
	|	ПриемЛечение.Номенклатура КАК Номенклатура,
	|	СУММА(ПриемЛечение.Количество) КАК Количество,
	|	СУММА(ПриемЛечение.Сумма) КАК Сумма,
	|	ПриемЛечение.Ссылка.Дата КАК Период,
	|	ПриемЛечение.НомерЗаказа КАК НомерПриема
	|ПОМЕСТИТЬ ВременнаяТаблицаПланЛечения
	|ИЗ
	|	Документ.Прием.Лечение КАК ПриемЛечение
	|ГДЕ
	|	ПриемЛечение.Ссылка = &Ссылка
	|	И ПриемЛечение.ДокументАванса ССЫЛКА Документ.ПланЛечения
	|	И НЕ ПриемЛечение.ДокументАванса = ЗНАЧЕНИЕ(Документ.ПланЛечения.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриемЛечение.Номенклатура,
	|	ПриемЛечение.КлючСтроки,
	|	ПриемЛечение.Ссылка.СтруктурнаяЕдиница,
	|	ПриемЛечение.Ссылка.Контрагент,
	|	ПриемЛечение.Ссылка.Дата,
	|	ПриемЛечение.Зуб,
	|	ПриемЛечение.ДокументАванса,
	|	ПриемЛечение.НомерЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриемЛечение.Ссылка.Контрагент КАК Клиент,
	|	ВЫБОР
	|		КОГДА НЕ НесколькоВрачейВОдномПриеме.Значение
	|				ИЛИ ПриемЛечение.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ПриемЛечение.Ссылка.Сотрудник
	|		ИНАЧЕ ПриемЛечение.Сотрудник
	|	КОНЕЦ КАК Врач,
	|	ПриемЛечение.Зуб КАК Зуб,
	|	ПриемЛечение.Номенклатура КАК Услуга,
	|	ПриемЛечение.Ссылка.Дата КАК Дата,
	|	ПриемЛечение.Гарантия КАК Гарантия
	|ПОМЕСТИТЬ ВременнаяТаблицаГарантия
	|ИЗ
	|	Документ.Прием.Лечение КАК ПриемЛечение,
	|	Константа.НесколькоВрачейВОдномПриеме КАК НесколькоВрачейВОдномПриеме
	|ГДЕ
	|	ПриемЛечение.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриемМатериалы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПриемМатериалы.Ссылка.Дата КАК Период,
	|	ПриемМатериалы.Ссылка КАК ДокументПродажи,
	|	ПриемМатериалы.Услуга КАК Услуга,
	|	ПриемМатериалы.Материал КАК Материал,
	|	ПриемМатериалы.Количество КАК Количество,
	|	ПриемМатериалы.Партия КАК Партия,
	|	ПриемМатериалы.Упаковка КАК Упаковка,
	|	ПриемМатериалы.Сотрудник КАК Сотрудник,
	|	ПриемМатериалы.Склад КАК Склад,
	|	ПриемМатериалы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПриемМатериалы.Ссылка.Контрагент КАК Клиент,
	|	СписыватьМатериалыПриЗакрытииКассовойСмены.Значение КАК СписыватьМатериалыПриЗакрытииКассовойСмены
	|ПОМЕСТИТЬ ВременнаяТаблицаМатериалыКСписанию
	|ИЗ
	|	Документ.Прием.Материалы КАК ПриемМатериалы,
	|	Константа.СписыватьМатериалыПриЗакрытииКассовойСмены КАК СписыватьМатериалыПриЗакрытииКассовойСмены
	|ГДЕ
	|	ПриемМатериалы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ПриемЛечение.КлючСтроки КАК КлючСтроки,
	|	ПриемЛечение.Ссылка.Дата КАК Период,
	|	ПриемЛечение.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПриемЛечение.Зуб КАК НомерЗуба,
	|	ПриемЛечение.Номенклатура КАК Номенклатура,
	|	НарядЗаказЗапасы.Лаборатория КАК Лаборатория,
	|	ПриемЛечение.Ссылка.Контрагент КАК Контрагент,
	|	ПриемЛечение.ДокументАванса КАК НарядЗаказ,
	|	ПриемЛечение.НомерЗаказа КАК НомерЗаказа,
	|	ПриемЛечение.Количество КАК Количество
	|ПОМЕСТИТЬ ВременнаяТаблицаНарядЗаказы
	|ИЗ
	|	Документ.Прием.Лечение КАК ПриемЛечение
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
	|		ПО ПриемЛечение.ДокументАванса = НарядЗаказЗапасы.Ссылка
	|			И ПриемЛечение.НомерЗаказа = НарядЗаказЗапасы.НомерЗаказа
	|ГДЕ
	|	ПриемЛечение.Ссылка = &Ссылка
	|	И ПриемЛечение.ДокументАванса В(&ДокументыАвансов)
	|	И ПриемЛечение.ДокументАванса ССЫЛКА Документ.НарядЗаказ
	|	И НарядЗаказЗапасы.Ссылка В(&ДокументыАвансов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ПриемЗапасы.КлючСтроки,
	|	ПриемЗапасы.Ссылка.Дата,
	|	ПриемЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	НарядЗаказЗапасы.Зуб,
	|	ПриемЗапасы.Номенклатура,
	|	НарядЗаказЗапасы.Лаборатория,
	|	ПриемЗапасы.Ссылка.Контрагент,
	|	ПриемЗапасы.ДокументАванса,
	|	ПриемЗапасы.НомерЗаказа,
	|	ПриемЗапасы.Количество
	|ИЗ
	|	Документ.Прием.Запасы КАК ПриемЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
	|		ПО ПриемЗапасы.ДокументАванса = НарядЗаказЗапасы.Ссылка
	|			И ПриемЗапасы.НомерЗаказа = НарядЗаказЗапасы.НомерЗаказа
	|ГДЕ
	|	ПриемЗапасы.Ссылка = &Ссылка
	|	И ПриемЗапасы.ДокументАванса В(&ДокументыАвансов)
	|	И НарядЗаказЗапасы.Ссылка В(&ДокументыАвансов)
	|	И ПриемЗапасы.ДокументАванса ССЫЛКА Документ.НарядЗаказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(1) КАК НомерСтроки,
	|	ПриемЛечение.Ссылка.Дата КАК Период,
	|	ПриемЛечение.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели) КАК СчетДт,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ДоходыВыручка) КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ПриемЛечение.Ссылка.ПолисМедСтрахования <> ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяССылка)
	|			ТОГДА ПриемЛечение.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ПриемЛечение.Ссылка.Контрагент
	|	КОНЕЦ КАК СубконтоДт1,
	|	NULL КАК СубконтоДт2,
	|	NULL КАК СубконтоДт3,
	|	NULL КАК СубконтоДт4,
	|	ПриемЛечение.Номенклатура.Специализация КАК СубконтоКт1,
	|	ПриемЛечение.Номенклатура КАК СубконтоКт2,
	|	ВЫБОР
	|		КОГДА НЕ НесколькоВрачейВОдномПриеме.Значение
	|				ИЛИ ПриемЛечение.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ПриемЛечение.Ссылка.Сотрудник
	|		ИНАЧЕ ПриемЛечение.Сотрудник
	|	КОНЕЦ КАК СубконтоКт3,
	|	ВЫБОР
	|		КОГДА ПриемЛечение.Ссылка.ПолисМедСтрахования <> ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяССылка)
	|			ТОГДА ПриемЛечение.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ПриемЛечение.Ссылка.Контрагент
	|	КОНЕЦ КАК СубконтоКт4,
	|	СУММА(ПриемЛечение.Сумма) КАК Сумма,
	|	СУММА(ПриемЛечение.Количество) КАК Количество,
	|	""Проведение приема(Лечение)"" КАК Содержание
	|ПОМЕСТИТЬ ВременнаяТаблицаУправленческий
	|ИЗ
	|	Документ.Прием.Лечение КАК ПриемЛечение,
	|	Константа.НесколькоВрачейВОдномПриеме КАК НесколькоВрачейВОдномПриеме
	|ГДЕ
	|	ПриемЛечение.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриемЛечение.Ссылка.Дата,
	|	ПриемЛечение.Ссылка.СтруктурнаяЕдиница,
	|	ПриемЛечение.Номенклатура,
	|	ПриемЛечение.Номенклатура.Специализация,
	|	ВЫБОР
	|		КОГДА НЕ НесколькоВрачейВОдномПриеме.Значение
	|				ИЛИ ПриемЛечение.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ПриемЛечение.Ссылка.Сотрудник
	|		ИНАЧЕ ПриемЛечение.Сотрудник
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПриемЛечение.Ссылка.ПолисМедСтрахования <> ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяССылка)
	|			ТОГДА ПриемЛечение.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ПриемЛечение.Ссылка.Контрагент
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПриемЛечение.Ссылка.ПолисМедСтрахования <> ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяССылка)
	|			ТОГДА ПриемЛечение.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ПриемЛечение.Ссылка.Контрагент
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(2),
	|	ПриемЗапасы.Ссылка.Дата,
	|	ПриемЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ДоходыВыручка),
	|	ВЫБОР
	|		КОГДА ПриемЗапасы.Ссылка.ПолисМедСтрахования <> ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяССылка)
	|			ТОГДА ПриемЗапасы.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ПриемЗапасы.Ссылка.Контрагент
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ПриемЗапасы.Номенклатура.Специализация,
	|	ПриемЗапасы.Номенклатура,
	|	ПриемЗапасы.Ссылка.Сотрудник,
	|	ВЫБОР
	|		КОГДА ПриемЗапасы.Ссылка.ПолисМедСтрахования <> ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяССылка)
	|			ТОГДА ПриемЗапасы.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ПриемЗапасы.Ссылка.Контрагент
	|	КОНЕЦ,
	|	СУММА(ПриемЗапасы.Сумма),
	|	СУММА(ПриемЗапасы.Количество),
	|	""Проведение приема(Запасы)""
	|ИЗ
	|	Документ.Прием.Запасы КАК ПриемЗапасы
	|ГДЕ
	|	ПриемЗапасы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриемЗапасы.Ссылка.Дата,
	|	ПриемЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	ПриемЗапасы.Номенклатура,
	|	ПриемЗапасы.Номенклатура.Специализация,
	|	ПриемЗапасы.Ссылка.Сотрудник,
	|	ВЫБОР
	|		КОГДА ПриемЗапасы.Ссылка.ПолисМедСтрахования <> ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяССылка)
	|			ТОГДА ПриемЗапасы.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ПриемЗапасы.Ссылка.Контрагент
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПриемЗапасы.Ссылка.ПолисМедСтрахования <> ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяССылка)
	|			ТОГДА ПриемЗапасы.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ПриемЗапасы.Ссылка.Контрагент
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(3),
	|	ПриемУчтенныеАвансы.Ссылка.Дата,
	|	ПриемУчтенныеАвансы.Ссылка.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПокупателиПоАвансам),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели),
	|	ПриемУчтенныеАвансы.Ссылка.Контрагент,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ПриемУчтенныеАвансы.Ссылка.Контрагент,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СУММА(ПриемУчтенныеАвансы.СуммаАванса),
	|	0,
	|	""Проведение приема(Авансы)""
	|ИЗ
	|	Документ.Прием.УчтенныеАвансы КАК ПриемУчтенныеАвансы
	|ГДЕ
	|	ПриемУчтенныеАвансы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриемУчтенныеАвансы.Ссылка.Дата,
	|	ПриемУчтенныеАвансы.Ссылка.СтруктурнаяЕдиница,
	|	ПриемУчтенныеАвансы.Ссылка.Контрагент,
	|	ПриемУчтенныеАвансы.Ссылка.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(4),
	|	ПриемМатериалы.Ссылка.Дата,
	|	ПриемМатериалы.Ссылка.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.РасходыСебестоимость),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Запасы),
	|	ПриемМатериалы.Услуга.Специализация,
	|	ВЫБОР
	|		КОГДА ПриемМатериалы.Ссылка.ПолисМедСтрахования <> ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяССылка)
	|			ТОГДА ПриемМатериалы.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ПриемМатериалы.Ссылка.Контрагент
	|	КОНЕЦ,
	|	ПриемМатериалы.Сотрудник,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.Материалы),
	|	ПриемМатериалы.Материал,
	|	ПриемМатериалы.Склад,
	|	NULL,
	|	NULL,
	|	0,
	|	СУММА(ПриемМатериалы.Количество),
	|	""Проведение приема(Материалы списание)""
	|ИЗ
	|	Документ.Прием.Материалы КАК ПриемМатериалы,
	|	Константа.СписыватьМатериалыПриЗакрытииКассовойСмены КАК СписыватьМатериалыПриЗакрытииКассовойСмены
	|ГДЕ
	|	СписыватьМатериалыПриЗакрытииКассовойСмены.Значение = ЛОЖЬ
	|	И ПриемМатериалы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриемМатериалы.Ссылка.Дата,
	|	ПриемМатериалы.Ссылка.СтруктурнаяЕдиница,
	|	ПриемМатериалы.Материал,
	|	ПриемМатериалы.Склад,
	|	ПриемМатериалы.Сотрудник,
	|	ПриемМатериалы.Услуга.Специализация,
	|	ВЫБОР
	|		КОГДА ПриемМатериалы.Ссылка.ПолисМедСтрахования <> ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяССылка)
	|			ТОГДА ПриемМатериалы.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ПриемМатериалы.Ссылка.Контрагент
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Ссылка"            	,ДокументСсылка);
	Запрос.УстановитьПараметр("Контрагент"          ,СтруктураДополнительныеСвойства.ДляПроведения.Контрагент);		
	Запрос.УстановитьПараметр("ИспользоватьПартии"	,СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);	
	Запрос.УстановитьПараметр("ДокументыАвансов"	,ПолучитьДокументыАвансаИзПриема(ДокументСсылка));	
	Запрос.УстановитьПараметр("СуммаОплачено"		,СтруктураДополнительныеСвойства.ДляПроведения.СуммаОплачено);
 	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", Новый УникальныйИдентификатор);

	Запрос.ВыполнитьПакет();
	
	СформироватьТаблицаЗапасыНаСкладах(СтруктураДополнительныеСвойства);
	СформироватьТаблицаВзаиморасчетыСКонтрагентами(СтруктураДополнительныеСвойства);	
	СформироватьТаблицаПродажи(СтруктураДополнительныеСвойства);	
//	СформироватьТаблицаДенежныеСредстваНаЛицевыхСчетах(СтруктураДополнительныеСвойства);
	СформироватьТаблицаСертификаты(СтруктураДополнительныеСвойства);
	СформироватьТаблицаПредоставленныеСкидки(СтруктураДополнительныеСвойства);
	СформироватьТаблицаПланЛечения(СтруктураДополнительныеСвойства);
	СформироватьТаблицаМатериалыКСписанию(СтруктураДополнительныеСвойства);
	СформироватьТаблицаГарантия(СтруктураДополнительныеСвойства);
	СформироватьТаблицаНарядЗаказов(СтруктураДополнительныеСвойства);
	СформироватьТаблицаБонусныеСчета(ДокументСсылка, СтруктураДополнительныеСвойства);	
	СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства);	
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыСКонтрагентами(СтруктураДополнительныеСвойства)
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаВзаиморасчетыСКонтрагентами.НомерСтроки КАК НомерСтроки,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ВидДвижения КАК ВидДвижения,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Период КАК Период,
	|	ТаблицаВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Контрагент КАК Контрагент,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Организация КАК Организация,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Ссылка КАК ДокументРеализации,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ДокументАванса КАК ДокументАванса,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ЭтоАванс КАК ЭтоАванс,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Сумма КАК Сумма,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Договор КАК Договор
	|ИЗ
	|	ВременнаяТаблицаВзаиморасчетыКонтрагентов КАК ТаблицаВзаиморасчетыСКонтрагентами
	|ГДЕ
	|	ТаблицаВзаиморасчетыСКонтрагентами.Сумма <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыСКонтрагентами", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры	

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
Процедура СформироватьТаблицаЗапасыНаСкладах(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ТаблицаЗапасыНаСкладах.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасыНаСкладах.Период КАК Период,
	|	ТаблицаЗапасыНаСкладах.Склад КАК Склад,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Партия КАК Партия,
	|	СУММА(ТаблицаЗапасыНаСкладах.Количество) КАК Количество
	|ИЗ
	|	ТаблицаЗапасыНаСкладах КАК ТаблицаЗапасыНаСкладах
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыНаСкладах.Период,
	|	ТаблицаЗапасыНаСкладах.Склад,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Партия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МИНИМУМ(МатериалыКСписанию.НомерСтроки),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	МатериалыКСписанию.Период,
	|	МатериалыКСписанию.Склад,
	|	МатериалыКСписанию.СтруктурнаяЕдиница,
	|	МатериалыКСписанию.Материал,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА МатериалыКСписанию.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	СУММА(МатериалыКСписанию.Количество)
	|ИЗ
	|	ВременнаяТаблицаМатериалыКСписанию КАК МатериалыКСписанию
	|ГДЕ
	|	НЕ МатериалыКСписанию.СписыватьМатериалыПриЗакрытииКассовойСмены
	|
	|СГРУППИРОВАТЬ ПО
	|	МатериалыКСписанию.Период,
	|	МатериалыКСписанию.ВидДвижения,
	|	МатериалыКСписанию.Склад,
	|	МатериалыКСписанию.СтруктурнаяЕдиница,
	|	МатериалыКСписанию.Материал,
	|	МатериалыКСписанию.Партия";
	
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасыНаСкладах()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПродажи(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ТаблицаПродажи.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаПродажи.Период КАК Период,
	|	ТаблицаПродажи.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаПродажи.Склад КАК Склад,
	|	ТаблицаПродажи.Номенклатура КАК Номенклатура,
	|	ТаблицаПродажи.Партия КАК Партия,
	|	ТаблицаПродажи.ДокументПродажи КАК ДокументПродажи,
	|	ТаблицаПродажи.Сотрудник КАК Сотрудник,
	|	ТаблицаПродажи.Ассистент КАК Ассистент,
	|	ТаблицаПродажи.ЗубнойТехник КАК ЗубнойТехник,
	|	ТаблицаПродажи.Контрагент КАК Контрагент,
	|	ТаблицаПродажи.КонтрагентПлательщик КАК КонтрагентПлательщик,
	|	ТаблицаПродажи.НомерЗуба КАК НомерЗуба,
	|	СУММА(ТаблицаПродажи.Количество) КАК Количество,
	|	СУММА(ТаблицаПродажи.СтоимостьБезСкидки) КАК СтоимостьБезСкидки,
	|	СУММА(ТаблицаПродажи.Стоимость) КАК Стоимость,
	|	СУММА(ТаблицаПродажи.КоличествоУЕТ) КАК КоличествоУЕТ,
	|	ТаблицаПродажи.КартаКонтрагента КАК КартаКонтрагента
	|ИЗ
	|	ВременнаяТаблицаПродажи КАК ТаблицаПродажи
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродажи.Период,
	|	ТаблицаПродажи.СтруктурнаяЕдиница,
	|	ТаблицаПродажи.Номенклатура,
	|	ТаблицаПродажи.Склад,
	|	ТаблицаПродажи.Партия,
	|	ТаблицаПродажи.ДокументПродажи,
	|	ТаблицаПродажи.Сотрудник,
	|	ТаблицаПродажи.Ассистент,
	|	ТаблицаПродажи.ЗубнойТехник,
	|	ТаблицаПродажи.Контрагент,
	|	ТаблицаПродажи.КонтрагентПлательщик,
	|	ТаблицаПродажи.НомерЗуба,
	|	ТаблицаПродажи.КартаКонтрагента";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажи", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСертификаты(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаПродажи.ВидДвижения,
	|	ТаблицаПродажи.Период,
	|	ТаблицаПродажи.СтруктурнаяЕдиница,
	|	ТаблицаПродажи.Сертификат,
	|	ТаблицаПродажи.СерийныйНомер,
	|	СУММА(ТаблицаПродажи.Количество) КАК Количество,
	|	СУММА(ТаблицаПродажи.Сумма) КАК Сумма,
	|	ТаблицаПродажи.Контрагент
	|ИЗ
	|	ВременнаяТаблицаСертификаты КАК ТаблицаПродажи
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродажи.ВидДвижения,
	|	ТаблицаПродажи.Период,
	|	ТаблицаПродажи.СтруктурнаяЕдиница,
	|	ТаблицаПродажи.Сертификат,
	|	ТаблицаПродажи.СерийныйНомер,
	|	ТаблицаПродажи.Контрагент";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСертификаты", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДенежныеСредстваНаЛицевыхСчетах(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДенежныеСредстваНаЛицевыхСчетах.ВидДвижения,
	|	ДенежныеСредстваНаЛицевыхСчетах.Период,
	|	ДенежныеСредстваНаЛицевыхСчетах.СтруктурнаяЕдиница,
	|	ДенежныеСредстваНаЛицевыхСчетах.Контрагент,
	|	ДенежныеСредстваНаЛицевыхСчетах.ВидСчета,
	|	СУММА(ДенежныеСредстваНаЛицевыхСчетах.Сумма) КАК Сумма
	|ИЗ
	|	ТаблицаДенежныеСредстваНаЛицевыхСчетах КАК ДенежныеСредстваНаЛицевыхСчетах
	|ГДЕ
	|	ДенежныеСредстваНаЛицевыхСчетах.Сумма > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ДенежныеСредстваНаЛицевыхСчетах.ВидДвижения,
	|	ДенежныеСредстваНаЛицевыхСчетах.Период,
	|	ДенежныеСредстваНаЛицевыхСчетах.СтруктурнаяЕдиница,
	|	ДенежныеСредстваНаЛицевыхСчетах.Контрагент,
	|	ДенежныеСредстваНаЛицевыхСчетах.ВидСчета";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредстваНаЛицевыхСчетах", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПредоставленныеСкидки(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаПредоставленныеСкидки.Период КАК Период,
	|	ТаблицаПредоставленныеСкидки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаПредоставленныеСкидки.ДокументПродажи КАК ДокументПродажи,
	|	ТаблицаПредоставленныеСкидки.Контрагент КАК Контрагент,
	|	ТаблицаПредоставленныеСкидки.Сотрудник КАК Сотрудник,
	|	ТаблицаПредоставленныеСкидки.Номенклатура КАК Номенклатура,
	|	ТаблицаПредоставленныеСкидки.СкидкаНаценка КАК СкидкаНаценка,
	|	СУММА(ТаблицаПредоставленныеСкидки.СуммаСкидки) КАК СуммаСкидки,
	|	СУММА(ТаблицаПредоставленныеСкидки.СуммаПродажи) КАК СуммаПродажи,	
	|	ТаблицаПредоставленныеСкидки.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ТаблицаПредоставленныеСкидки.НоменклатураПодарок КАК НоменклатураПодарок,
	|	ТаблицаПредоставленныеСкидки.НаБонусныйСчет КАК НаБонусныйСчет
	|ИЗ
	|	ТаблицаПредоставленныеСкидки КАК ТаблицаПредоставленныеСкидки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПредоставленныеСкидки.Период,
	|	ТаблицаПредоставленныеСкидки.СтруктурнаяЕдиница,
	|	ТаблицаПредоставленныеСкидки.ДокументПродажи,
	|	ТаблицаПредоставленныеСкидки.Контрагент,
	|	ТаблицаПредоставленныеСкидки.Сотрудник,
	|	ТаблицаПредоставленныеСкидки.Номенклатура,
	|	ТаблицаПредоставленныеСкидки.СкидкаНаценка,
	|	ТаблицаПредоставленныеСкидки.ПроцентСкидкиНаценки,
	|	ТаблицаПредоставленныеСкидки.НоменклатураПодарок,
	|	ТаблицаПредоставленныеСкидки.НаБонусныйСчет";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПредоставленныеСкидки", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПланЛечения(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВременнаяТаблицаПланЛечения.ВидДвижения,
	|	ВременнаяТаблицаПланЛечения.КлючСтроки,
	|	ВременнаяТаблицаПланЛечения.НомерПриема,
	|	ВременнаяТаблицаПланЛечения.Период,
	|	ВременнаяТаблицаПланЛечения.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаПланЛечения.Контрагент,
	|	ВременнаяТаблицаПланЛечения.Зуб,
	|	ВременнаяТаблицаПланЛечения.Номенклатура,
	|	ВременнаяТаблицаПланЛечения.ПланЛечения,
	|	ВременнаяТаблицаПланЛечения.Количество,
	|	ВременнаяТаблицаПланЛечения.Сумма
	|ИЗ
	|	ВременнаяТаблицаПланЛечения КАК ВременнаяТаблицаПланЛечения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПланыЛечения", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры	

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаГарантия(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВременнаяТаблицаГарантия.Клиент,
	|	ВременнаяТаблицаГарантия.Врач,
	|	ВременнаяТаблицаГарантия.Зуб,
	|	ВременнаяТаблицаГарантия.Услуга,
	|	ВременнаяТаблицаГарантия.Дата,
	|	ВременнаяТаблицаГарантия.Гарантия
	|ИЗ
	|	ВременнаяТаблицаГарантия КАК ВременнаяТаблицаГарантия
	|ГДЕ
	|	ВременнаяТаблицаГарантия.Гарантия > 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаГарантияНаУслуги", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры	

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
// 
Процедура СформироватьТаблицаМатериалыКСписанию(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	МатериалыКСписанию.Период,
	|	МатериалыКСписанию.Склад,
	|	МатериалыКСписанию.Материал,
	|	МатериалыКСписанию.Услуга,
	|	МатериалыКСписанию.Сотрудник,
	|	МатериалыКСписанию.Клиент,
	|	МатериалыКСписанию.ДокументПродажи,
	|	МатериалыКСписанию.СтруктурнаяЕдиница,
	|	МатериалыКСписанию.Партия,
	|	СУММА(МатериалыКСписанию.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаМатериалыКСписанию КАК МатериалыКСписанию
	|ГДЕ
	|	МатериалыКСписанию.СписыватьМатериалыПриЗакрытииКассовойСмены
	|
	|СГРУППИРОВАТЬ ПО
	|	МатериалыКСписанию.ВидДвижения,
	|	МатериалыКСписанию.Период,
	|	МатериалыКСписанию.Склад,
	|	МатериалыКСписанию.Материал,
	|	МатериалыКСписанию.Партия,
	|	МатериалыКСписанию.Сотрудник,
	|	МатериалыКСписанию.Клиент,
	|	МатериалыКСписанию.ДокументПродажи,
	|	МатериалыКСписанию.СтруктурнаяЕдиница,
	|	МатериалыКСписанию.Услуга";	
	РезультатЗапроса = Запрос.Выполнить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаМатериалыКСписанию", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаНарядЗаказов(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НарядЗаказЗапасы.ВидДвижения,
	|	НарядЗаказЗапасы.КлючСтроки,
	|	НарядЗаказЗапасы.Период,
	|	НарядЗаказЗапасы.СтруктурнаяЕдиница,
	|	НарядЗаказЗапасы.НомерЗуба,
	|	НарядЗаказЗапасы.Номенклатура,
	|	НарядЗаказЗапасы.Лаборатория,
	|	НарядЗаказЗапасы.Контрагент,
	|	НарядЗаказЗапасы.НарядЗаказ,
	|	НарядЗаказЗапасы.НомерЗаказа,
	|	НарядЗаказЗапасы.Количество
	|ИЗ
	|	ВременнаяТаблицаНарядЗаказы КАК НарядЗаказЗапасы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНарядЗаказы", РезультатЗапроса.Выгрузить());		
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВременнаяТаблицаУправленческий.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ВременнаяТаблицаУправленческий.СубконтоДт1,
	|	ВременнаяТаблицаУправленческий.СубконтоДт2,
	|	ВременнаяТаблицаУправленческий.СубконтоДт3,
	|	ВременнаяТаблицаУправленческий.СубконтоДт4,
	|	ВременнаяТаблицаУправленческий.СубконтоКт1,
	|	ВременнаяТаблицаУправленческий.СубконтоКт2,
	|	ВременнаяТаблицаУправленческий.СубконтоКт3,
	|	ВременнаяТаблицаУправленческий.СубконтоКт4,
	|	ВременнаяТаблицаУправленческий.Сумма,
	|	ВременнаяТаблицаУправленческий.Количество,
	|	ВременнаяТаблицаУправленческий.Содержание КАК Содержание
	|ИЗ
	|	ВременнаяТаблицаУправленческий КАК ВременнаяТаблицаУправленческий
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаУправленческий.НомерСтроки,
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ЗНАЧЕНИЕ(Справочник.Специализации.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
	|	NULL,
	|	NULL,
	|	ВременнаяТаблицаУправленческий.Сумма,
	|	ВременнаяТаблицаУправленческий.Количество,
	|	ВременнаяТаблицаУправленческий.Содержание
	|ИЗ
	|	ВременнаяТаблицаУправленческий КАК ВременнаяТаблицаУправленческий
	|ГДЕ
	|	ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	// ВНИМАНИЕ!!! ДОП. ОБЪНДИНЕНИЕ НЕОБХОДИМО ДЛЯ ПРОСТАВЛЕНИЯ НЕОБХОДИМЫХ ТИПОВ В КОЛОНКИ
	
	РезультатЗапроса = Запрос.Выполнить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Процедура, формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаБонусныеСчета(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	РегистрыНакопления.БонусныеСчета.СформироватьТаблицуБонусныеСчета(СтруктураДополнительныеСвойства);
	
	// Запрос = Новый Запрос;
	// Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	// Запрос.Текст =
	// "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ТаблицаБонусныеСчета.Период КАК Период,
	//|	ТаблицаБонусныеСчета.ВидДвижения КАК ВидДвижения,
	//|	ТаблицаБонусныеСчета.БонусныйСчет КАК БонусныйСчет,
	//|	ТаблицаБонусныеСчета.ДокументНачисления КАК ДокументНачисления,
	//|	СУММА(ТаблицаБонусныеСчета.Сумма) КАК Сумма
	//|ИЗ
	//|	ТаблицаБонусныеСчета КАК ТаблицаБонусныеСчета
	//|ГДЕ
	//|	ТаблицаБонусныеСчета.Сумма > 0
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТаблицаБонусныеСчета.Период,
	//|	ТаблицаБонусныеСчета.ВидДвижения,
	//|	ТаблицаБонусныеСчета.БонусныйСчет,
	//|	ТаблицаБонусныеСчета.ДокументНачисления
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ ПЕРВЫЕ 0
	//|	ДАТАВРЕМЯ(1, 1, 1),
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	//|	ЗНАЧЕНИЕ(Справочник.БонусныеСчета.ПустаяСсылка),
	//|	ОперацияПоБонусномуСчету.Ссылка,
	//|	0
	//|ИЗ
	//|	Документ.ОперацияПоБонусномуСчету КАК ОперацияПоБонусномуСчету
	//|ГДЕ
	//|	ЛОЖЬ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ ПЕРВЫЕ 0
	//|	ДАТАВРЕМЯ(1, 1, 1),
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	//|	ЗНАЧЕНИЕ(Справочник.БонусныеСчета.ПустаяСсылка),
	//|	Посещение.Ссылка,
	//|	0
	//|ИЗ
	//|	Документ.Посещение КАК Посещение
	//|ГДЕ
	//|	ЛОЖЬ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ ПЕРВЫЕ 0
	//|	ДАТАВРЕМЯ(1, 1, 1),
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	//|	ЗНАЧЕНИЕ(Справочник.БонусныеСчета.ПустаяСсылка),
	//|	ПоступлениеДенежныхСредств.Ссылка,
	//|	0
	//|ИЗ
	//|	Документ.ПоступлениеДенежныхСредств КАК ПоступлениеДенежныхСредств
	//|ГДЕ
	//|	ЛОЖЬ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ ПЕРВЫЕ 0
	//|	ДАТАВРЕМЯ(1, 1, 1),
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	//|	ЗНАЧЕНИЕ(Справочник.БонусныеСчета.ПустаяСсылка),
	//|	ВводНачальныхОстатков.Ссылка,
	//|	0
	//|ИЗ
	//|	Документ.ВводНачальныхОстатков КАК ВводНачальныхОстатков
	//|ГДЕ
	//|	ЛОЖЬ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ТаблицаОплатаБонуснымиСчетами.Период КАК Период,
	//|	ТаблицаОплатаБонуснымиСчетами.ВидДвижения КАК ВидДвижения,
	//|	ТаблицаОплатаБонуснымиСчетами.БонусныйСчет КАК БонусныйСчет,
	//|	СУММА(ТаблицаОплатаБонуснымиСчетами.Сумма) КАК Сумма
	//|ИЗ
	//|	ТаблицаОплатаБонуснымиСчетами КАК ТаблицаОплатаБонуснымиСчетами
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТаблицаОплатаБонуснымиСчетами.Период,
	//|	ТаблицаОплатаБонуснымиСчетами.ВидДвижения,
	//|	ТаблицаОплатаБонуснымиСчетами.БонусныйСчет
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	БонусныеСчетаОстатки.БонусныйСчет КАК БонусныйСчет,
	//|	БонусныеСчетаОстатки.ДокументНачисления КАК ДокументНачисления,
	//|	БонусныеСчетаОстатки.СуммаОстаток КАК СуммаОстаток
	//|ИЗ
	//|	РегистрНакопления.БонусныеСчета.Остатки(
	//|			&ПериодОстатков,
	//|			БонусныйСчет В
	//|				(ВЫБРАТЬ
	//|					ТаблицаОплатаБонуснымиСчетами.БонусныйСчет
	//|				ИЗ
	//|					ТаблицаОплатаБонуснымиСчетами)) КАК БонусныеСчетаОстатки
	//|ГДЕ
	//|	БонусныеСчетаОстатки.СуммаОстаток > 0
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	БонусныеСчетаОстатки.ДокументНачисления.Дата";
	//
	// Если СтруктураДополнительныеСвойства.Свойство("ДатаРасчетаОстатковНаБонусныхСчетах") 
	//	И ЗначениеЗаполнено(СтруктураДополнительныеСвойства.ДатаРасчетаОстатковНаБонусныхСчетах) Тогда 
	//	Запрос.УстановитьПараметр("ПериодОстатков", СтруктураДополнительныеСвойства.ДатаРасчетаОстатковНаБонусныхСчетах);
	// Иначе
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПериодОстатков", "");
	// КонецЕсли;         
	//
	// РезультатЗапроса     = Запрос.ВыполнитьПакет();
	// ТаблицаБонусныеСчета = РезультатЗапроса[0].Выгрузить();
	//
	// ТаблицаОплатаБонуснымиСчетами = РезультатЗапроса[1].Выгрузить();
	// ОстатокНаБонусныхСчетах       = РезультатЗапроса[2].Выгрузить();
	//
	// Для Каждого СтрокаТЗОплата Из ТаблицаОплатаБонуснымиСчетами Цикл
	//	
	//	ОстатокНаБонусномСчете = ОстатокНаБонусныхСчетах.НайтиСтроки(Новый Структура("БонусныйСчет", СтрокаТЗОплата.БонусныйСчет));
	//	Для Каждого СтрокаТЗОстаток Из ОстатокНаБонусномСчете Цикл
	//		
	//		СуммаОплатаБонусамиПоПартии     = ?(СтрокаТЗОстаток.СуммаОстаток > СтрокаТЗОплата.Сумма, СтрокаТЗОплата.Сумма, СтрокаТЗОстаток.СуммаОстаток);
	//		НоваяСтрока                     = ТаблицаБонусныеСчета.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗОплата);
	//		
	//		НоваяСтрока.ДокументНачисления = СтрокаТЗОстаток.ДокументНачисления;
	//		НоваяСтрока.Сумма              = СуммаОплатаБонусамиПоПартии;
	//		СтрокаТЗОплата.Сумма           = СтрокаТЗОплата.Сумма - СуммаОплатаБонусамиПоПартии;
	//		СтрокаТЗОстаток.СуммаОстаток   = СтрокаТЗОстаток.СуммаОстаток - СуммаОплатаБонусамиПоПартии;			
	//		
	//		Если СтрокаТЗОплата.Сумма = 0 Тогда
	//			Прервать;
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	// КонецЦикла;
	//
	//// если что-то есть не списанное по партиям, списать без документа основания.
	// Если ТаблицаОплатаБонуснымиСчетами.Итог("Сумма") > 0 Тогда
	//	Для Каждого СтрокаТЗОплата Из ТаблицаОплатаБонуснымиСчетами Цикл
	//		Если СтрокаТЗОплата.Сумма = 0 Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		ЗаполнитьЗначенияСвойств(ТаблицаБонусныеСчета.Добавить(), СтрокаТЗОплата);
	//	КонецЦикла;
	// КонецЕсли;   	
	//
	// СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаБонусныеСчета", ТаблицаБонусныеСчета);	
	
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ФОРМИРОВАНИЯ_ПЕЧАТНЫХ_ФОРМ

// Функция генерации печатной формы "РасходнаяНакладная"
//
Функция СформироватьПечатнуюФорму_Квитанция(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПФ_MXL_Квитанция";
	
	// МассивОбъектов = ОтСортироватьМассивДокументов(МассивОбъектов);
	УстановитьПривилегированныйРежим(Истина);
	
	НесколькоВрачейВОдномПриеме = Константы.НесколькоВрачейВОдномПриеме.Получить();	
	
	КоличествоОбъектов = МассивОбъектов.Количество();
	ИндексОбъекта	   = 0;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		ЭтоСтоматологическиеУслуги = ОбщегоНазначенияСтоматология.ПолучитьПризнакОказанияСтоматологическихУслуг(ТекущийДокумент.Сотрудник); 
		НомерСтрокиНачало          = ТабличныйДокумент.ВысотаТаблицы + 1;
		ПакетЗапросов              = ПолучитьРезультатЗапроса(ТекущийДокумент);
		
		Прием 				= ПакетЗапросов[0].Выбрать();
		ТаблицаОплаты		= ПакетЗапросов[2+1].Выгрузить();
		ВыборкаЗаписи    	= ПакетЗапросов[3+1].Выбрать();
		ВыборкаПоУслугам 	= ПакетЗапросов[4+1].Выбрать();
		ТаблицаАвансов 		= ПакетЗапросов[5+1].Выгрузить();
		ТаблицаЛицевыеСчета = ПакетЗапросов[6+1].Выгрузить();   
		ТаблицаВозврата		= ПакетЗапросов[8].Выгрузить();
				
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Прием.ПФ_MXL_Квитанция");
		
		//==============================================================ЗАПОЛНЕНИЕ ШАПКИ====================================================================
		Прием.Следующий();
		
		Область_Заголовок 	= Макет.ПолучитьОбласть("Заголовок");
		Область_Организация = Макет.ПолучитьОбласть("Организация");
		Область_Врач 		= Макет.ПолучитьОбласть("Врач");
		Область_Пациент 	= Макет.ПолучитьОбласть("Пациент");                                     
		Область_Диагноз 	= Макет.ПолучитьОбласть("Диагноз");
		Область_Заказчик    = Макет.ПолучитьОбласть("Заказчик");
		
		НомерИДатаДокумента = "№ " + ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Прием.Номер, Прием.Организация.Префикс) + " от " + Формат(Прием.Дата, "ДЛФ=DD");
		ВыводитьЗаказчика   = Ложь;
		
		Если ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.Прием") Тогда
			Область_Заголовок.Параметры.ТекстЗаголовка			= "Квитанция об оплате приема " + НомерИДатаДокумента;
		ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.ПланЛечения") Тогда
			Область_Заголовок.Параметры.ТекстЗаголовка			= "Квитанция об оплате плана лечения " + НомерИДатаДокумента;
		ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.НарядЗаказ") Тогда
			Область_Заголовок.Параметры.ТекстЗаголовка			= "Квитанция об оплате наряд-заказа " + НомерИДатаДокумента;
		ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.Реализация") Тогда
			Область_Заголовок.Параметры.ТекстЗаголовка			= "Квитанция об оплате реализации " + НомерИДатаДокумента;
		КонецЕсли;
		
		Область_Организация.Параметры.ПредставлениеОрганизации 	= ?(ЗначениеЗаполнено(Прием.Организация.ПолноеНаименование), Прием.Организация.ПолноеНаименование, Прием.Организация.Наименование);
		Область_Врач.Параметры.ПредставлениеВрача 				= Прием.Врач;
		
		Если ЗначениеЗаполнено(Прием.Диагноз) Тогда
			
			Если ТипЗнч(Прием.Диагноз) = Тип("СправочникСсылка.Диагнозы")
				И ЗначениеЗаполнено(Прием.Диагноз.Наименование) Тогда
				Область_Диагноз.Параметры.Диагноз = Прием.Диагноз.Наименование;
			Иначе
				Область_Диагноз.Параметры.Диагноз = Строка(Прием.Диагноз);		
			КонецЕсли;
			
		Иначе
			Область_Диагноз.Параметры.Диагноз = "";		
		КонецЕсли;
		
		Область_Пациент.Параметры.ПредставлениеПациента 		= СокрЛП(Прием.Пациент) + ?(ЗначениеЗаполнено(Прием.Пациент.ДатаРожденияКлиента),", дата рождения: " + Формат(Прием.Пациент.ДатаРожденияКлиента, "ДФ=dd.MM.yyyy"), "") + ?(ЗначениеЗаполнено(Прием.Пациент.Телефон), ", тел. " + Прием.Пациент.Телефон, "");
		Если ЗначениеЗаполнено(Прием.Пациент.ДатаРожденияКлиента) И ЗначениеЗаполнено(Прием.Пациент.ЗаконныйПредставитель)
			И Справочники.Контрагенты.ПолучитьВидимостьЗаконногоПредставителя(Прием.Пациент.ДатаРожденияКлиента, Прием.Пациент.НедееспособныйГражданин) Тогда
			ВыводитьЗаказчика = Истина;
			Область_Заказчик.Параметры.ПредставлениеЗаказчика = Строка(Прием.Пациент.ЗаконныйПредставитель) + ?(ЗначениеЗаполнено(Прием.Пациент.ЗаконныйПредставитель.Телефон), ", тел. " + Прием.Пациент.ЗаконныйПредставитель.Телефон, "");
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Область_Заголовок);
		ТабличныйДокумент.Вывести(Область_Организация);
		Если НЕ НесколькоВрачейВОдномПриеме Тогда 
			ТабличныйДокумент.Вывести(Область_Врач);
		КонецЕсли;
		ТабличныйДокумент.Вывести(Область_Пациент);
		Если ВыводитьЗаказчика = Истина Тогда
			ТабличныйДокумент.Вывести(Область_Заказчик);
		КонецЕсли;
		Если ЗначениеЗаполнено(Прием.Диагноз) Тогда
			ТабличныйДокумент.Вывести(Область_Диагноз);
		КонецЕсли;
		
		//=============================================================ЗАПОЛНЕНИЕ ТАБЛИЦЫ===================================================================
		ОбластьЗаголовка = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьСтрока    = ?(НЕ НесколькоВрачейВОдномПриеме, Макет.ПолучитьОбласть("СтрокаТаблицы"), Макет.ПолучитьОбласть("СтрокаТаблицы2"));
		ОбластьИтого     = Макет.ПолучитьОбласть("Подвал_Итого");
		ОбластьСкидка    = Макет.ПолучитьОбласть("Подвал_Итого_Скидка");
		ОбластьКОплате   = Макет.ПолучитьОбласть("Подвал_КОплате");
		
		Если НЕ ЭтоСтоматологическиеУслуги Тогда
			ОбластьКолонкаЗуб = ОбластьЗаголовка.Область("R1C3:R2C3");
			ОбластьЗаголовка.Удалитьобласть(ОбластьКолонкаЗуб,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			ОбластьКолонкаЗуб = ОбластьСтрока.Область("R1C3:R2C3");
			ОбластьСтрока.Удалитьобласть(ОбластьКолонкаЗуб,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			ОбластьКолонкаЗуб = ОбластьИтого.Область("R1C3:R2C3");
			ОбластьИтого.Удалитьобласть(ОбластьКолонкаЗуб,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		КонецЕсли;
		
		Если НесколькоВрачейВОдномПриеме Тогда
			НашаОбласть = ОбластьЗаголовка.НайтиТекст("Наименование работ", , , , Истина, , Истина);
			Если НашаОбласть <> Неопределено Тогда 
				НашаОбласть.Текст = "Наименование работ / Врач";
			КонецЕсли;	
		КонецЕсли;		
		ТабличныйДокумент.Вывести(ОбластьЗаголовка);
		
		НомерСтроки 		= 0;
		ОбщаяСуммаСкидки 	= 0;
		
		Пока ВыборкаПоУслугам.Следующий() Цикл
			
			Если ТипЗнч(ВыборкаПоУслугам.Услуга) = Тип("СправочникСсылка.Номенклатура") Тогда
				
				НомерСтроки                                  = НомерСтроки + 1;
				Цена										 = ВыборкаПоУслугам.Сумма / ?(ВыборкаПоУслугам.Количество = 0, 1, ВыборкаПоУслугам.Количество);
				СуммаСкидки									 = ВыборкаПоУслугам.Сумма - ВыборкаПоУслугам.СуммаСоСкидкой;
				ОбластьСтрока.Параметры.Заполнить(ВыборкаПоУслугам);
				ОбластьСтрока.Параметры.НомерСтроки          = НомерСтроки; 
				ОбластьСтрока.Параметры.Услуга               = ВыборкаПоУслугам.Услуга.НаименованиеПолное;
				Если ВыборкаПоУслугам.Услуга.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
					ОбластьСтрока.Параметры.Артикул          = ВыборкаПоУслугам.Артикул;
				Иначе
					ОбластьСтрока.Параметры.Артикул          = ВыборкаПоУслугам.Услуга.Артикул;
				КонецЕсли;
				ОбластьСтрока.Параметры.Цена                 = Цена;
				ОбластьСтрока.Параметры.СуммаСкидки          = СуммаСкидки;
				ОбластьСтрока.Параметры.ПроцентСкидки		 = ?(ВыборкаПоУслугам.ПроцентСкидки > 0, Формат(ВыборкаПоУслугам.ПроцентСкидки, "ЧДЦ=2") + "%", "");
				// ВыборкаПоЗубам                               = ВыборкаПоУслугам.Зуб;
				
				СтрокаЗуб = "";
				Если ЗначениеЗаполнено(ВыборкаПоУслугам.Зуб) Тогда
					Если СтрокаЗуб = "" Тогда
						СтрокаЗуб = Строка(ВыборкаПоУслугам.Зуб);
					Иначе 
						СтрокаЗуб = СтрокаЗуб + ?(ЗначениеЗаполнено(ВыборкаПоУслугам.Зуб), ", ", "") + Строка(ВыборкаПоУслугам.Зуб);
					КонецЕсли;
					
					СтрокаВрач = "";
					// ВыборкаПоВрачам = ВыборкаПоЗубам.Выбрать();
					Если ЗначениеЗаполнено(ВыборкаПоУслугам.Врач) Тогда						
						Если СтрокаВрач = "" Тогда
							СтрокаВрач = Строка(ВыборкаПоУслугам.Врач);
						Иначе 
							СтрокаВрач = СтрокаВрач + ?(ЗначениеЗаполнено(ВыборкаПоУслугам.Врач), ", ", "") + Строка(ВыборкаПоУслугам.Врач);
						КонецЕсли;						
					КонецЕсли;			
				КонецЕсли;
				
				Если НесколькоВрачейВОдномПриеме Тогда
					ОбластьСтрока.Параметры.Врач = СтрокаВрач;
				КонецЕсли;
				Если ЭтоСтоматологическиеУслуги Тогда
					ОбластьСтрока.Параметры.Зуб = СтрокаЗуб;
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				
				ОбщаяСуммаСкидки = ОбщаяСуммаСкидки + (ВыборкаПоУслугам.Сумма - ВыборкаПоУслугам.СуммаСоСкидкой);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьИтого.Параметры.ОбщееИтогоБезСкидкой 	= Прием.ОбщееИтогоСоСкидкой + ОбщаяСуммаСкидки - ТаблицаВозврата.Итог("Сумма") + ТаблицаВозврата.Итог("СуммаСкидки");
		ОбластьСкидка.Параметры.Скидка 					= ОбщаяСуммаСкидки ;
		ОбластьКОплате.Параметры.ОбщееИтогоСоСкидкой 	= Прием.ОбщееИтогоСоСкидкой - ТаблицаВозврата.Итог("Сумма")+ ТаблицаВозврата.Итог("СуммаСкидки");
		
		ТабличныйДокумент.Вывести(ОбластьИтого);
		Если ОбщаяСуммаСкидки > 0 Тогда 
			ТабличныйДокумент.Вывести(ОбластьСкидка);
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьКОплате);
		
		// Выводим виды оплат
		ТипыОплаты = ТаблицаОплаты.Скопировать();
		ТипыОплаты.Свернуть("ДатаПроведения,ТипДенежныхСредств","Сумма");	
		Если ТипыОплаты.Количество() > 0 Тогда		
			ТекОбласть = Макет.ПолучитьОбласть("ШапкаВидыОплат");
			ТабличныйДокумент.Вывести(ТекОбласть);
			
			Для Каждого Строка из ТипыОплаты Цикл
				ТекОбласть                       = Макет.ПолучитьОбласть("ВидОплаты");
				ТекОбласть.Параметры.ДатаОплаты  = Строка.ДатаПроведения;
				ТекОбласть.Параметры.ВидОплаты   = Строка.ТипДенежныхСредств;
				ТекОбласть.Параметры.СуммаОплаты = Строка.Сумма;
				ТабличныйДокумент.Вывести(ТекОбласть);			
			КонецЦикла;			
			ТекОбласть = Макет.ПолучитьОбласть("Подвал_ИтогоОплачено");
			ТекОбласть.Параметры.ИтогоОплачено = ТипыОплаты.Итог("Сумма");
			ТабличныйДокумент.Вывести(ТекОбласть);			
		КонецЕсли;
		
		ЧтоОплачено = ТаблицаОплаты.Скопировать();
		ЧтоОплачено.Свернуть("ДокументОснования, ВидОперации","Сумма");
		ЧтоОплачено.Сортировать("ДокументОснования УБЫВ");
		Если ЧтоОплачено.Количество() > 1 Тогда
			
			ТекОбласть = Макет.ПолучитьОбласть("Подвал_ИзНих");
			ТабличныйДокумент.Вывести(ТекОбласть);			
			Для Каждого Строка из ЧтоОплачено Цикл				
				ТекОбласть = Макет.ПолучитьОбласть("Подвал_ЧтоОплачено");
				Если ЗначениеЗаполнено(Строка.ДокументОснования) И Строка.ДокументОснования = ТекущийДокумент Тогда					
					ТекОбласть.Параметры.ЧтоОплачено = "Текущий прием:";					
				ИначеЕсли ЗначениеЗаполнено(Строка.ДокументОснования) И Строка.ДокументОснования <> ТекущийДокумент  Тогда										
					ТекОбласть.Параметры.ЧтоОплачено = "" + ТипЗнч(Строка.ДокументОснования) + " №" + Формат(ФормированиеПечатныхФорм.ПолучитьНомерНаПечатьПосле2011г(Строка.ДокументОснования.Номер, Истина, Истина),"ЧГ=0") + " от " + Формат(Строка.ДокументОснования.Дата,"ДФ=dd.MM.yyyy") + ", вр. " + Строка.ДокументОснования.Сотрудник.Фамилия + " " + Лев(Строка.ДокументОснования.Сотрудник.Имя,1) + ". " + Лев(Строка.ДокументОснования.Сотрудник.Отчество,1) + ".";										
				ИначеЕсли НЕ ЗначениеЗаполнено(Строка.ДокументОснования) И Строка.ВидОперации = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет Тогда					
					ТекОбласть.Параметры.ЧтоОплачено = "Зачислено на лицевой счет:";					
				КонецЕсли;			
				ТекОбласть.Параметры.СуммаОплаты = Строка.Сумма;
				ТабличныйДокумент.Вывести(ТекОбласть);				
			КонецЦикла;
		КонецЕсли;
		
		//=============================================================ЗАПОЛНЕНИЕ ДОЛГОВ===================================================================			
		ДатаПолученияЗадолженности = ТаблицаОплаты.Скопировать();
		ДатаПолученияЗадолженности.Свернуть("ДатаПроведения","");
		ДатаПолученияЗадолженности.Сортировать("ДатаПроведения УБЫВ");
		
		Если ДатаПолученияЗадолженности.Количество() > 0 Тогда
			ДатаЗадолженности = КонецДня(ДатаПолученияЗадолженности[0].ДатаПроведения);				 
		Иначе
			ДатаЗадолженности = КонецДня(ТекущийДокумент.Дата);
		КонецЕсли;
		
		ЗапросПоДолгам = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВзаиморасчетыСКонтрагентамиОстатки.ДокументРеализации КАК ДокументЗадолженности,
		|	-ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
		|			&Дата,
		|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И Контрагент = &Контрагент
		|				И ДокументРеализации <> НЕОПРЕДЕЛЕНО
		|				И ДокументРеализации <> ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
		|				И ДокументРеализации <> &ТекущийДокумент) КАК ВзаиморасчетыСКонтрагентамиОстатки
		|ГДЕ
		|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток < 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВзаиморасчетыСКонтрагентамиОстатки.ДокументАванса,
		|	-ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
		|			&Дата,
		|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И Контрагент = &Контрагент
		|				И ДокументРеализации = НЕОПРЕДЕЛЕНО
		|				И ДокументРеализации <> ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)) КАК ВзаиморасчетыСКонтрагентамиОстатки
		|ГДЕ
		|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток < 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВзаиморасчетыСКонтрагентамиОстатки.ДокументРеализации,
		|	-ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
		|			,
		|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И Контрагент = &Контрагент
		|				И ДокументРеализации = &ТекущийДокумент) КАК ВзаиморасчетыСКонтрагентамиОстатки
		|ГДЕ
		|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток < 0");
		
		ЗапросПоДолгам.УстановитьПараметр("СтруктурнаяЕдиница", ТекущийДокумент.СтруктурнаяЕдиница);
		ЗапросПоДолгам.УстановитьПараметр("Контрагент"		  , ТекущийДокумент.Контрагент);
		ЗапросПоДолгам.УстановитьПараметр("Дата"			  , ДатаЗадолженности + 1);
		ЗапросПоДолгам.УстановитьПараметр("ТекущийДокумент"	  , ТекущийДокумент);
		
		ТаблицаДолгов = ЗапросПоДолгам.Выполнить().Выгрузить();
		
		Если ТаблицаДолгов.Количество() > 0 Тогда
			
			ТекОбласть = Макет.ПолучитьОбласть("ШапкаДолга");
			ТабличныйДокумент.Вывести(ТекОбласть);			
			Для Каждого Строка ИЗ ТаблицаДолгов Цикл				
				ТекОбласть = Макет.ПолучитьОбласть("СтрокаДолга");
				ТекОбласть.Параметры.ДатаДолга = ?(ЗначениеЗаполнено(Строка.ДокументЗадолженности), Формат(Строка.ДокументЗадолженности.Дата, "ДФ=dd.MM.yyyy"), "NULL");
				ТекОбласть.Параметры.ДокументДолга = ?(ЗначениеЗаполнено(Строка.ДокументЗадолженности), "" + ТипЗнч(Строка.ДокументЗадолженности) + " №" + Формат(ФормированиеПечатныхФорм.ПолучитьНомерНаПечатьПосле2011г(Строка.ДокументЗадолженности.Номер, Истина, Истина), "ЧГ=0") + ", вр. " + Строка.ДокументЗадолженности.Сотрудник.Фамилия + " " + Лев(Строка.ДокументЗадолженности.Сотрудник.Имя,1) + ". " + Лев(Строка.ДокументЗадолженности.Сотрудник.Отчество, 1) + ".", "NULL");
				ТекОбласть.Параметры.СуммаДолга = Строка.Сумма;                                                                                   
				ТабличныйДокумент.Вывести(ТекОбласть);			
			КонецЦикла;		
			ТекОбласть = Макет.ПолучитьОбласть("ПодвалДолга");
			ТекОбласть.Параметры.СуммаДолга = ТаблицаДолгов.Итог("Сумма");
			ТабличныйДокумент.Вывести(ТекОбласть);		
		КонецЕсли;
		
		Если КоличествоОбъектов > 1
			И ИндексОбъекта < КоличествоОбъектов - 1 Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("Комментарий");
			ОбластьМакета.Параметры.Комментарий = ТекущийДокумент.Комментарий;
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		
		ИндексОбъекта = ИндексОбъекта + 1;
		
	КонецЦикла;
	
	//=============================================================ЗАПОЛНЕНИЕ АВАНСОВ===================================================================	
	Если ТаблицаАвансов.Количество() > 0 Тогда
		
		ТекОбласть = Макет.ПолучитьОбласть("ШапкаАванса");
		ТабличныйДокумент.Вывести(ТекОбласть);			
		Для Каждого Строка ИЗ ТаблицаАвансов Цикл				
			ТекОбласть = Макет.ПолучитьОбласть("СтрокаАванса");
			ТекОбласть.Параметры.ДатаАванса = ?(ЗначениеЗаполнено(Строка.ДокументАванса), Формат(Строка.ДокументАванса.Дата, "ДФ=dd.MM.yyyy"), "NULL");
			ТекОбласть.Параметры.ДокументАванса = ?(ЗначениеЗаполнено(Строка.ДокументАванса), "" + ТипЗнч(Строка.ДокументАванса) + " №" + Формат(ФормированиеПечатныхФорм.ПолучитьНомерНаПечатьПосле2011г(Строка.ДокументАванса.Номер, Истина, Истина), "ЧГ=0") + ", вр. " + Строка.ДокументАванса.Сотрудник.Фамилия + " " + Лев(Строка.ДокументАванса.Сотрудник.Имя, 1) + ". " + Лев(Строка.ДокументАванса.Сотрудник.Отчество, 1) + ".", "NULL");
			ТекОбласть.Параметры.СуммаАванса = Строка.СуммаОстаток;                                                                                   
			ТабличныйДокумент.Вывести(ТекОбласть);			
		КонецЦикла;		
		ТекОбласть = Макет.ПолучитьОбласть("ПодвалАванса");
		ТекОбласть.Параметры.СуммаАванса = ТаблицаАвансов.Итог("СуммаОстаток");
		ТабличныйДокумент.Вывести(ТекОбласть);		
	КонецЕсли;	
	
	//=========================================================ЗАПОЛНЕНИЕ ЛИЦЕВЫХ СЧЕТОВ=================================================================	 
	Если ТаблицаЛицевыеСчета.Количество() > 0 Тогда
		
		ТекОбласть = Макет.ПолучитьОбласть("ШапкаЛицевыСчета");
		ТабличныйДокумент.Вывести(ТекОбласть);			
		Для Каждого Строка ИЗ ТаблицаЛицевыеСчета Цикл				
			ТекОбласть = Макет.ПолучитьОбласть("СтрокаЛицевыСчета");
			ТекОбласть.Параметры.ЛицевойСчет 			= Строка.ВидСчета;
			ТекОбласть.Параметры.СуммаНаЛицевомСчету 	= Строка.СуммаОстаток;                                                                                   
			ТабличныйДокумент.Вывести(ТекОбласть);			
		КонецЦикла;		
		ТекОбласть = Макет.ПолучитьОбласть("ПодвалЛицевыСчета");
		ТекОбласть.Параметры.СуммаНаЛицевомСчету = ТаблицаЛицевыеСчета.Итог("СуммаОстаток");
		ТабличныйДокумент.Вывести(ТекОбласть);		
	КонецЕсли;	
	
	//===================================================================================================================================================
	Пока ВыборкаЗаписи.Следующий() Цикл
		Если ВыборкаЗаписи.Ссылка.Услуги.Количество() <> 0 Тогда
			Область_ПредварительнаяЗапись                                 = Макет.ПолучитьОбласть("ПредварительнаяЗапись");
			СтрокаТЧУслуги                                                = ВыборкаЗаписи.Ссылка.Услуги[0];
			ДатаПриема                                                    = СтрокаТЧУслуги.ДатаНачала;
			Сотрудник                                                     = СтрокаТЧУслуги.Сотрудник;
			Область_ПредварительнаяЗапись.Параметры.ПредварительнаяЗапись = "Вы записаны на прием: " + Формат(ДатаПриема, "ДФ='ддд дд ММММ ""в"" ЧЧ:мм'") + ", к " + Сотрудник;			
			ТабличныйДокумент.Вывести(Область_ПредварительнаяЗапись);
		КонецЕсли;
	КонецЦикла;
	
	//=============================================================ЗАПОЛНЕНИЕ ГАРАНТИИ===================================================================
	ОбластьШапка  = Макет.ПолучитьОбласть("ШапкаГарантия");
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаГарантия");
	Если НЕ ЭтоСтоматологическиеУслуги Тогда
		ОбластьКолонкаЗуб = ОбластьШапка.Область("R1C3:R2C5");
		ОбластьШапка.Удалитьобласть(ОбластьКолонкаЗуб,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		ОбластьКолонкаЗуб = ОбластьСтрока.Область("R1C3:R1C5");
		ОбластьСтрока.Удалитьобласть(ОбластьКолонкаЗуб,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	//
	ВыборкаПоУслугам.Сбросить();
	НомерСтроки = 0;
	Пока ВыборкаПоУслугам.Следующий() Цикл				
		Если ТипЗнч(ВыборкаПоУслугам.Услуга) = Тип("СправочникСсылка.Номенклатура") И ВыборкаПоУслугам.Гарантия <> NULL И ВыборкаПоУслугам.Гарантия > 0 Тогда
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки = 1 Тогда
				ТабличныйДокумент.Вывести(ОбластьШапка);	
			КонецЕсли;				
			ОбластьСтрока.Параметры.Заполнить(ВыборкаПоУслугам);
			ОбластьСтрока.Параметры.Услуга        = ВыборкаПоУслугам.Услуга.НаименованиеПолное;
			ОбластьСтрока.Параметры.НомерСтроки   = НомерСтроки;
			ОбластьСтрока.Параметры.ГарантияДо    = ДобавитьМесяц(Прием.Дата,ВыборкаПоУслугам.Гарантия);
			ТабличныйДокумент.Вывести(ОбластьСтрока);						
		КонецЕсли;					
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если КоличествоОбъектов > 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Комментарий");
		ОбластьМакета.Параметры.Комментарий = ?(ЗначениеЗаполнено(ТекущийДокумент), ТекущийДокумент.Комментарий, "");
		ТабличныйДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	
	Область_Подписи = Макет.ПолучитьОбласть("Подписи");
	ТабличныйДокумент.Вывести(Область_Подписи);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Функция генерации печатной формы "АктОВыполненныхРаботах"
//
Функция СформироватьПечатнуюФорму_АктОВыполненныхРаботах(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПФ_MXL_АктОВыполненныхРаботах";
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если ТипЗнч(ТекущийДокумент) <> Тип("ДокументСсылка.Прием") Тогда
			Продолжить;
		КонецЕсли;
			
		ЭтоСтоматологическиеУслуги = ОбщегоНазначенияСтоматология.ПолучитьПризнакОказанияСтоматологическихУслуг(ТекущийДокумент.Сотрудник); 
		НомерСтрокиНачало          = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Прием.Номер КАК Номер,
		|	Прием.Дата КАК Дата,
		|	Прием.СтруктурнаяЕдиница.Организация КАК Организация,
		|	Прием.Контрагент КАК Пациент,
		|	Прием.Сотрудник КАК Врач,
		|	Прием.СуммаДокумента КАК ОбщееИтогоСоСкидкой,
		|	Прием.СуммаОплачено КАК ИтогоОплачено,
		|	Прием.ПредварительнаяЗаписьНаСледующийПрием КАК ПредварительнаяЗапись,
		|	Прием.СтруктурнаяЕдиница.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств КАК Валюта,
		|	ЕСТЬNULL(Прием.Контрагент.ТекущаяМедицинскаяКарта.КодБезНулей, 0) КАК ТекущаяМедицинскаяКарта,
		|	Прием.ПолисМедСтрахования КАК ПолисМедСтрахования
		|ИЗ
		|	Документ.Прием КАК Прием
		|ГДЕ
		|	Прием.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВозвратОтПокупателяЛечение.Зуб КАК Зуб,
		|	ВозвратОтПокупателяЛечение.Номенклатура КАК Номенклатура,
		|	ВозвратОтПокупателяЛечение.КоличествоУпаковок КАК Количество,
		|	ВозвратОтПокупателяЛечение.Цена КАК Цена,
		|	ВозвратОтПокупателяЛечение.Цена * ЕСТЬNULL(ВозвратОтПокупателяЛечение.КоличествоУпаковок, 1) КАК СуммаБезСкидки,
		|	ВозвратОтПокупателяЛечение.Сумма КАК Сумма,
		|	ВозвратОтПокупателяЛечение.Ссылка КАК Ссылка,
		|	ВозвратОтПокупателяЛечение.Номенклатура.НоменклатураМедицинскихУслуг.Код КАК НоменклатураКод,
		|	ВозвратОтПокупателяЛечение.Упаковка КАК Упаковка,
		|	ВозвратОтПокупателяЛечение.СтавкаНДС КАК СтавкаНДС,
		|	ВозвратОтПокупателяЛечение.СуммаНДС КАК СуммаНДС,
		|	ВозвратОтПокупателяЛечение.Номенклатура.Артикул КАК НоменклатураАртикул
		|ПОМЕСТИТЬ ВозвращенныеУслуги
		|ИЗ
		|	Документ.ВозвратОтПокупателя.Лечение КАК ВозвратОтПокупателяЛечение
		|ГДЕ
		|	ВозвратОтПокупателяЛечение.Ссылка.ДокументОснования = &Ссылка
		|	И ВозвратОтПокупателяЛечение.Ссылка.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПриемЛечение.Зуб КАК Зуб,
		|	ПриемЛечение.Номенклатура КАК Номенклатура,
		|	СУММА(ПриемЛечение.КоличествоУпаковок - ЕСТЬNULL(ВозвращенныеУслуги.Количество, 0)) КАК Количество,
		|	МАКСИМУМ(ПриемЛечение.Цена) КАК Цена,
		|	СУММА(ПриемЛечение.Цена * ЕСТЬNULL(ПриемЛечение.КоличествоУпаковок, 1) - ЕСТЬNULL(ВозвращенныеУслуги.СуммаБезСкидки, 0)) КАК СуммаБезСкидки,
		|	СУММА(ПриемЛечение.Сумма - ЕСТЬNULL(ВозвращенныеУслуги.Сумма, 0)) КАК Сумма,
		|	ПриемЛечение.Ссылка КАК Ссылка,
		|	ПриемЛечение.Номенклатура.НоменклатураМедицинскихУслуг.Код КАК НоменклатураКод,
		|	ЕСТЬNULL(ПриемЛечение.Гарантия, 0) КАК Гарантия,
		|	ПриемЛечение.НомерСтроки КАК НомерСтроки,
		|	ПриемЛечение.Рекламация КАК Рекламация,
		|	ПриемЛечение.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(ПриемЛечение.СуммаНДС) КАК СуммаНДС,
		|	ВЫРАЗИТЬ(ПриемЛечение.Номенклатура.НаименованиеПолное КАК СТРОКА(200)) КАК Услуга,
		|	ПриемЛечение.Номенклатура.Артикул КАК НоменклатураАртикул
		|ИЗ
		|	Документ.Прием.Лечение КАК ПриемЛечение
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВозвращенныеУслуги КАК ВозвращенныеУслуги
		|		ПО ПриемЛечение.Номенклатура = ВозвращенныеУслуги.Номенклатура
		|			И ПриемЛечение.Упаковка = ВозвращенныеУслуги.Упаковка
		|ГДЕ
		|	ПриемЛечение.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриемЛечение.Номенклатура,
		|	ПриемЛечение.Зуб,
		|	ПриемЛечение.Ссылка,
		|	ПриемЛечение.НомерСтроки,
		|	ПриемЛечение.Рекламация,
		|	ПриемЛечение.СтавкаНДС,
		|	ВЫРАЗИТЬ(ПриемЛечение.Номенклатура.НаименованиеПолное КАК СТРОКА(200)),
		|	ЕСТЬNULL(ПриемЛечение.Гарантия, 0),
		|	ПриемЛечение.Номенклатура.НоменклатураМедицинскихУслуг.Код
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ПриемЛечение.КоличествоУпаковок - ЕСТЬNULL(ВозвращенныеУслуги.Количество, 0)) > 0
		|		ИЛИ СУММА(ПриемЛечение.Сумма - ЕСТЬNULL(ВозвращенныеУслуги.Сумма, 0)) > 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|ИТОГИ
		|	СУММА(Количество),
		|	МАКСИМУМ(Цена),
		|	СУММА(СуммаБезСкидки),
		|	СУММА(Сумма),
		|	МАКСИМУМ(Гарантия),
		|	СУММА(СуммаНДС)
		|ПО
		|	Номенклатура,
		|	Зуб";
		
		Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
		ПакетЗапросов 		= Запрос.ВыполнитьПакет();
		
		Прием_Шапка 		= ПакетЗапросов[0].Выбрать();
		ВыборкаУслуги       = ПакетЗапросов[1+1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ТаблицаУслуги	 	= ПакетЗапросов[1+1].Выгрузить();
		
		УказанПолис = ЗначениеЗаполнено(ТекущийДокумент.ПолисМедСтрахования);
		
		Если  УказанПолис Тогда 
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Прием.ПФ_MXL_АктОВыполненныхРаботахЕстьПолис");	
		Иначе
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Прием.ПФ_MXL_АктОВыполненныхРаботах");
		КонецЕсли;
		//==============================================================ЗАПОЛНЕНИЕ ШАПКИ====================================================================
		Прием_Шапка.Следующий();		
		
		ОбластьМакета                          = Макет.ПолучитьОбласть("Заголовок");
		ТекстЗаголовка                         = "Акт № " + ФормированиеПечатныхФорм.ПолучитьНомерНаПечатьПосле2011г(Прием_Шапка.Номер, Истина, Истина) + " от " +Формат(Прием_Шапка.Дата, "ДЛФ=DD");
		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ТабличныйДокумент.Вывести(ОбластьМакета);		
		
		ОбластьМакета                                    = Макет.ПолучитьОбласть("Поставщик");
		ПредставлениеПоставщика  = ?(ЗначениеЗаполнено(Прием_Шапка.Организация.ПолноеНаименование), Прием_Шапка.Организация.ПолноеНаименование, Прием_Шапка.Организация.Наименование);		
		ЮрАдрес 										 = Прием_Шапка.Организация.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, "Вид");
		
		Если ЮрАдрес <> Неопределено Тогда
			ПредставлениеПоставщика = ПредставлениеПоставщика + ", Адрес: " + ЮрАдрес.Представление;
		КонецЕсли;
		Если Прием_Шапка.Организация.ИНН <> "" Тогда 
			ПредставлениеПоставщика = ПредставлениеПоставщика + ", ИНН: " + Прием_Шапка.Организация.ИНН;
		КонецЕсли; 	
		
		ОбластьМакета.Параметры.ПредставлениеПоставщика  = ПредставлениеПоставщика;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                    = Макет.ПолучитьОбласть("Врач");
		ОбластьМакета.Параметры.ПредставлениеВрача		 = Прием_Шапка.Врач;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                   = Макет.ПолучитьОбласть("Покупатель");
		ОбластьМакета.Параметры.ПредставлениеПолучателя = Строка(Прием_Шапка.Пациент) + ?(Прием_Шапка.ТекущаяМедицинскаяКарта <> 0, ", мед. карта № " + Строка(Прием_Шапка.ТекущаяМедицинскаяКарта), "");
		
		Если ЗначениеЗаполнено(Прием_Шапка.Пациент.ДатаРожденияКлиента) И ЗначениеЗаполнено(Прием_Шапка.Пациент.ЗаконныйПредставитель)
			И Справочники.Контрагенты.ПолучитьВидимостьЗаконногоПредставителя(Прием_Шапка.Пациент.ДатаРожденияКлиента, Прием_Шапка.Пациент.НедееспособныйГражданин) Тогда
			ОбластьМакета.Параметры.Пациент = "Пациент: ";
			ОбластьМакета.Параметры.ПредставлениеПолучателя = Строка(Прием_Шапка.Пациент.ЗаконныйПредставитель);
			ОбластьМакета.Параметры.ПредставлениеПациента = Строка(Прием_Шапка.Пациент) + ?(Прием_Шапка.ТекущаяМедицинскаяКарта <> 0, ", мед. карта № " + Строка(Прием_Шапка.ТекущаяМедицинскаяКарта), "");
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьМакета); 
		
		Если УказанПолис Тогда 
			
			ОбластьМакета                                    = Макет.ПолучитьОбласть("Полис");
			ПолисНаименование 								 = Прием_Шапка.ПолисМедСтрахования.СтраховаяКомпания.Наименование + " №" + Прием_Шапка.ПолисМедСтрахования.НомерПолиса + " с " + Формат(Прием_Шапка.ПолисМедСтрахования.ДанаНачала, "ДФ =дд.ММ.гггг") + " по " + Формат(Прием_Шапка.ПолисМедСтрахования.ДатаОкончания, "ДФ =дд.ММ.гггг");  
			// ОбластьМакета.Параметры.ПредставлениеПолиса		 = Строка(Прием_Шапка.ПолисМедСтрахования);
			ОбластьМакета.Параметры.ПредставлениеПолиса		 = ПолисНаименование;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			НомерСтроки = 0;
			//=============================================================ЗАПОЛНЕНИЕ ТАБЛИЦЫ===================================================================		
			ОбластьЗаголовок = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ОбластьСтроки    = Макет.ПолучитьОбласть("Строка");
			ОбластьПодписи   = Макет.ПолучитьОбласть("Подписи");
			
			// Удалить колонки зуб если это не стом. прием
			Если НЕ ЭтоСтоматологическиеУслуги Тогда
				ОбластьКолонкаЗуб = ОбластьЗаголовок.Область("R1C4:R2C7");
				ОбластьЗаголовок.Удалитьобласть(ОбластьКолонкаЗуб,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
				ОбластьКолонкаЗуб = ОбластьСтроки.Область("R1C4:R1C7");
				ОбластьСтроки.Удалитьобласть(ОбластьКолонкаЗуб,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			КонецЕсли; 
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
			Пока ВыборкаУслуги.Следующий() Цикл
				ОбластьСтроки.Параметры.Заполнить(ВыборкаУслуги);
				ОбластьСтроки.Параметры.Услуга = ВыборкаУслуги.Номенклатура.НаименованиеПолное;
				СтрокаЗуб = "";			
				ОбластьСтроки.Параметры.Количество =  ?(ВыборкаУслуги.Количество = 0, 1, ВыборкаУслуги.Количество);			 
				
				НомерСтроки                         = НомерСтроки + 1;
				ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;
				ОбластьСтроки.Параметры.Сумма		= ВыборкаУслуги.Сумма;
				
				ВыборкаПоЗубам = ВыборкаУслуги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"");
				Пока ВыборкаПоЗубам.Следующий() Цикл 
					
					Если ЗначениеЗаполнено(ВыборкаПоЗубам.Зуб) и СтрНайти(СтрокаЗуб, ВыборкаПоЗубам.Зуб) = 0 Тогда
						Если СтрокаЗуб = "" Тогда
							СтрокаЗуб = Строка(ВыборкаПоЗубам.Зуб);
						Иначе 
							СтрокаЗуб = СтрокаЗуб + ?(ЗначениеЗаполнено(ВыборкаПоЗубам.Зуб), ", ", "") + Строка(ВыборкаПоЗубам.Зуб);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Если ЭтоСтоматологическиеУслуги Тогда
					ОбластьСтроки.Параметры.Зуб = СтрокаЗуб;
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьСтроки);
				
			КонецЦикла; 		
			
			ТабличныйДокумент.Вывести(ОбластьПодписи); 	
			
		Иначе
			//=============================================================ЗАПОЛНЕНИЕ ТАБЛИЦЫ===================================================================		
			ЕстьСкидки = ТаблицаУслуги.Итог("СуммаБезСкидки") - ТаблицаУслуги.Итог("Сумма") <> 0;
			Если ЕстьСкидки  Тогда
				ОбластьЗаголовок = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой");
				ОбластьСтроки    = Макет.ПолучитьОбласть("СтрокаСоСкидкой");
			Иначе
				ОбластьЗаголовок = Макет.ПолучитьОбласть("ШапкаТаблицы");
				ОбластьСтроки    = Макет.ПолучитьОбласть("Строка");
			КонецЕсли;
			ОбластьИтог          = Макет.ПолучитьОбласть("Итого");
			ОбластьСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
			ОбластьПодписи       = Макет.ПолучитьОбласть("Подписи");	
			// Удалить колонки зуб если это не стом. прием
			Если НЕ ЭтоСтоматологическиеУслуги Тогда
				ОбластьКолонкаЗуб = ОбластьЗаголовок.Область("R1C4:R2C7");
				ОбластьЗаголовок.Удалитьобласть(ОбластьКолонкаЗуб,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
				ОбластьКолонкаЗуб = ОбластьСтроки.Область("R1C4:R1C7");
				ОбластьСтроки.Удалитьобласть(ОбластьКолонкаЗуб,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
				ОбластьКолонкаЗуб = ОбластьИтог.Область("R1C4:R2C7");
				ОбластьИтог.Удалитьобласть(ОбластьКолонкаЗуб,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			КонецЕсли; 
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			НомерСтроки = 0;
			ОбщееИтого  = 0;
			ОбщееСуммаНДС = 0;
			
			Пока ВыборкаУслуги.Следующий() Цикл
				ОбластьСтроки.Параметры.Заполнить(ВыборкаУслуги);
				СтрокаЗуб = "";			
				Если Не ЗначениеЗаполнено(ВыборкаУслуги.Рекламация) Тогда
					ОбластьСтроки.Параметры.Цена = ВыборкаУслуги.СуммаБезСкидки / ?(ВыборкаУслуги.Количество = 0, 1, ВыборкаУслуги.Количество);			 
					Если ВыборкаУслуги.СуммаБезСкидки <> 0 и  ЕстьСкидки Тогда
						ОбластьСтроки.Параметры.СуммаСкидки = ВыборкаУслуги.СуммаБезСкидки - ВыборкаУслуги.Сумма;
					КонецЕсли;
					ОбластьСтроки.Параметры.Сумма = ВыборкаУслуги.Сумма;
				Иначе
					ОбластьСтроки.Параметры.Цена        = 0;
					ОбластьСтроки.Параметры.СуммаСкидки = 0;
					ОбластьСтроки.Параметры.Сумма       = 0;
				КонецЕсли;
				
				НомерСтроки                         = НомерСтроки + 1;
				ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;
				
				ВыборкаПоЗубам = ВыборкаУслуги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"");
				Пока ВыборкаПоЗубам.Следующий() Цикл 
					Если Не ЗначениеЗаполнено(ОбластьСтроки.Параметры.СтавкаНДС) Тогда
						ОбластьСтроки.Параметры.СтавкаНДС = ВыборкаПоЗубам.СтавкаНДС;		
					КонецЕсли;
					Если ЗначениеЗаполнено(ВыборкаПоЗубам.Зуб) и СтрНайти(СтрокаЗуб, ВыборкаПоЗубам.Зуб) = 0 Тогда
						Если СтрокаЗуб = "" Тогда
							СтрокаЗуб = Строка(ВыборкаПоЗубам.Зуб);
						Иначе 
							СтрокаЗуб = СтрокаЗуб + ?(ЗначениеЗаполнено(ВыборкаПоЗубам.Зуб), ", ", "") + Строка(ВыборкаПоЗубам.Зуб);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Если ЭтоСтоматологическиеУслуги Тогда
					ОбластьСтроки.Параметры.Зуб = СтрокаЗуб;
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьСтроки);
				ОбщееИтого    = ОбщееИтого + ОбластьСтроки.Параметры.Сумма;
				ОбщееСуммаНДС = ОбщееСуммаНДС + ОбластьСтроки.Параметры.СуммаНДС;
				
			КонецЦикла;
			
			ОбластьИтог.Параметры.Всего = ОбщееИтого;
			ОбластьИтог.Параметры.ВсегоНДС = ОбщееСуммаНДС;
			ТабличныйДокумент.Вывести(ОбластьИтог);
			
			ОбластьСуммаПрописью.Параметры.ИтоговаяСтрока     = "Всего оказано услуг " + НомерСтроки + ", на сумму: " + ФормированиеПечатныхФорм.СуммаРубКоп(ОбщееИтого,,);// ФормированиеПечатныхФорм.СуммаРубКоп(Прием_Шапка.ОбщееИтогоСоСкидкой, ,);// Формат(ТаблицаУслуги.Итог("Сумма"), "ЧЦ=15; ЧДЦ=2; ЧН=") + " руб." ;
			ОбластьСуммаПрописью.Параметры.СуммаПрописью      = ФормированиеПечатныхФорм.СформироватьСуммуПрописью(ОбщееИтого); // Прием_Шапка.ОбщееИтогоСоСкидкой
			ТабличныйДокумент.Вывести(ОбластьСуммаПрописью);
			
			ТабличныйДокумент.Вывести(ОбластьПодписи);
		КонецЕсли;	
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент; 	
	
КонецФункции     

// Функция генерации печатной формы "АктОВыполненныхРаботах"
//
Функция СформироватьПечатнуюФорму_АктОВыполненныхРаботахБезСумм(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПФ_MXL_АктОВыполненныхРаботахБезСумм";
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если ТипЗнч(ТекущийДокумент) <> Тип("ДокументСсылка.Прием") Тогда
			Продолжить;
		КонецЕсли;
			
		ЭтоСтоматологическиеУслуги = ОбщегоНазначенияСтоматология.ПолучитьПризнакОказанияСтоматологическихУслуг(ТекущийДокумент.Сотрудник); 
		НомерСтрокиНачало          = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Прием.Номер КАК Номер,
		|	Прием.Дата КАК Дата,
		|	Прием.СтруктурнаяЕдиница.Организация КАК Организация,
		|	Прием.Контрагент КАК Пациент,
		|	Прием.Сотрудник КАК Врач,
		|	Прием.ПредварительнаяЗаписьНаСледующийПрием КАК ПредварительнаяЗапись,
		|	Прием.СтруктурнаяЕдиница.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств КАК Валюта,
		|	ЕСТЬNULL(Прием.Контрагент.ТекущаяМедицинскаяКарта.КодБезНулей, 0) КАК ТекущаяМедицинскаяКарта,
		|	Прием.ПолисМедСтрахования КАК ПолисМедСтрахования
		|ИЗ
		|	Документ.Прием КАК Прием
		|ГДЕ
		|	Прием.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВозвратОтПокупателяЛечение.Зуб КАК Зуб,
		|	ВозвратОтПокупателяЛечение.Номенклатура КАК Номенклатура,
		|	ВозвратОтПокупателяЛечение.КоличествоУпаковок КАК Количество,
		|	ВозвратОтПокупателяЛечение.Ссылка КАК Ссылка,
		|	ВозвратОтПокупателяЛечение.Номенклатура.НоменклатураМедицинскихУслуг.Код КАК НоменклатураКод,
		|	ВозвратОтПокупателяЛечение.Упаковка КАК Упаковка,
		|	ВозвратОтПокупателяЛечение.Номенклатура.Артикул КАК НоменклатураАртикул
		|ПОМЕСТИТЬ ВозвращенныеУслуги
		|ИЗ
		|	Документ.ВозвратОтПокупателя.Лечение КАК ВозвратОтПокупателяЛечение
		|ГДЕ
		|	ВозвратОтПокупателяЛечение.Ссылка.ДокументОснования = &Ссылка
		|	И ВозвратОтПокупателяЛечение.Ссылка.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПриемЛечение.Зуб КАК Зуб,
		|	ПриемЛечение.Номенклатура КАК Номенклатура,
		|	СУММА(ПриемЛечение.КоличествоУпаковок - ЕСТЬNULL(ВозвращенныеУслуги.Количество, 0)) КАК Количество,
		|	ПриемЛечение.Ссылка КАК Ссылка,
		|	ПриемЛечение.Номенклатура.НоменклатураМедицинскихУслуг.Код КАК НоменклатураКод,
		|	ЕСТЬNULL(ПриемЛечение.Гарантия, 0) КАК Гарантия,
		|	ПриемЛечение.НомерСтроки КАК НомерСтроки,
		|	ПриемЛечение.Рекламация КАК Рекламация,
		|	ВЫРАЗИТЬ(ПриемЛечение.Номенклатура.НаименованиеПолное КАК СТРОКА(200)) КАК Услуга,
		|	ПриемЛечение.Номенклатура.Артикул КАК НоменклатураАртикул
		|ИЗ
		|	Документ.Прием.Лечение КАК ПриемЛечение
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВозвращенныеУслуги КАК ВозвращенныеУслуги
		|		ПО ПриемЛечение.Номенклатура = ВозвращенныеУслуги.Номенклатура
		|			И ПриемЛечение.Упаковка = ВозвращенныеУслуги.Упаковка
		|ГДЕ
		|	ПриемЛечение.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриемЛечение.Номенклатура,
		|	ПриемЛечение.Зуб,
		|	ПриемЛечение.Ссылка,
		|	ПриемЛечение.НомерСтроки,
		|	ПриемЛечение.Рекламация,
		|	ВЫРАЗИТЬ(ПриемЛечение.Номенклатура.НаименованиеПолное КАК СТРОКА(200)),
		|	ЕСТЬNULL(ПриемЛечение.Гарантия, 0),
		|	ПриемЛечение.Номенклатура.НоменклатураМедицинскихУслуг.Код
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|ИТОГИ
		|	СУММА(Количество),
		|	МАКСИМУМ(Гарантия)
		|ПО
		|	Номенклатура,
		|	Зуб";
		
		Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
		ПакетЗапросов 		= Запрос.ВыполнитьПакет();
		
		Прием_Шапка 		= ПакетЗапросов[0].Выбрать();
		ВыборкаУслуги       = ПакетЗапросов[1+1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ТаблицаУслуги	 	= ПакетЗапросов[1+1].Выгрузить();
		
		УказанПолис = ЗначениеЗаполнено(ТекущийДокумент.ПолисМедСтрахования);
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Прием.ПФ_MXL_АктОВыполненныхРаботахБезСумм");
		
		//==============================================================ЗАПОЛНЕНИЕ ШАПКИ====================================================================
		Прием_Шапка.Следующий();		
		
		ОбластьМакета                          = Макет.ПолучитьОбласть("Заголовок");
		ТекстЗаголовка                         = "Акт № " + ФормированиеПечатныхФорм.ПолучитьНомерНаПечатьПосле2011г(Прием_Шапка.Номер, Истина, Истина) + " от " +Формат(Прием_Шапка.Дата, "ДЛФ=DD");
		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ТабличныйДокумент.Вывести(ОбластьМакета);		
		
		ОбластьМакета                                    = Макет.ПолучитьОбласть("Поставщик");
		ПредставлениеПоставщика  = ?(ЗначениеЗаполнено(Прием_Шапка.Организация.ПолноеНаименование), Прием_Шапка.Организация.ПолноеНаименование, Прием_Шапка.Организация.Наименование);		
		ЮрАдрес 										 = Прием_Шапка.Организация.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, "Вид");
		
		Если ЮрАдрес <> Неопределено Тогда
			ПредставлениеПоставщика = ПредставлениеПоставщика + ", Адрес: " + ЮрАдрес.Представление;
		КонецЕсли;
		Если Прием_Шапка.Организация.ИНН <> "" Тогда 
			ПредставлениеПоставщика = ПредставлениеПоставщика + ", ИНН: " + Прием_Шапка.Организация.ИНН;
		КонецЕсли; 	
		
		ОбластьМакета.Параметры.ПредставлениеПоставщика  = ПредставлениеПоставщика;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                    = Макет.ПолучитьОбласть("Врач");
		ОбластьМакета.Параметры.ПредставлениеВрача		 = Прием_Шапка.Врач;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                   = Макет.ПолучитьОбласть("Покупатель");
		ОбластьМакета.Параметры.ПредставлениеПолучателя = Строка(Прием_Шапка.Пациент) + ?(Прием_Шапка.ТекущаяМедицинскаяКарта <> 0, ", мед. карта № " + Строка(Прием_Шапка.ТекущаяМедицинскаяКарта), "");
		
		Если ЗначениеЗаполнено(Прием_Шапка.Пациент.ДатаРожденияКлиента) И ЗначениеЗаполнено(Прием_Шапка.Пациент.ЗаконныйПредставитель)
			И Справочники.Контрагенты.ПолучитьВидимостьЗаконногоПредставителя(Прием_Шапка.Пациент.ДатаРожденияКлиента, Прием_Шапка.Пациент.НедееспособныйГражданин) Тогда
			ОбластьМакета.Параметры.Пациент = "Пациент: ";
			ОбластьМакета.Параметры.ПредставлениеПолучателя = Строка(Прием_Шапка.Пациент.ЗаконныйПредставитель);
			ОбластьМакета.Параметры.ПредставлениеПациента = Строка(Прием_Шапка.Пациент) + ?(Прием_Шапка.ТекущаяМедицинскаяКарта <> 0, ", мед. карта № " + Строка(Прием_Шапка.ТекущаяМедицинскаяКарта), "");
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьМакета); 		
		
		Если УказанПолис Тогда
			ОбластьМакета                                    = Макет.ПолучитьОбласть("Полис");
			ПолисНаименование 								 = Прием_Шапка.ПолисМедСтрахования.СтраховаяКомпания.Наименование + " №" + Прием_Шапка.ПолисМедСтрахования.НомерПолиса + " с " + Формат(Прием_Шапка.ПолисМедСтрахования.ДанаНачала, "ДФ =дд.ММ.гггг") + " по " + Формат(Прием_Шапка.ПолисМедСтрахования.ДатаОкончания, "ДФ =дд.ММ.гггг");  
			ОбластьМакета.Параметры.ПредставлениеПолиса		 = ПолисНаименование;
			ТабличныйДокумент.Вывести(ОбластьМакета); 
		КонецЕсли;
		НомерСтроки = 0;
		//=============================================================ЗАПОЛНЕНИЕ ТАБЛИЦЫ===================================================================		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьСтроки    = Макет.ПолучитьОбласть("Строка");
		ОбластьПодписи   = Макет.ПолучитьОбласть("Подписи");
		
		// Удалить колонки зуб если это не стом. прием
		Если НЕ ЭтоСтоматологическиеУслуги Тогда
			ОбластьКолонкаЗуб = ОбластьЗаголовок.Область("R1C4:R2C7");
			ОбластьЗаголовок.Удалитьобласть(ОбластьКолонкаЗуб,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			ОбластьКолонкаЗуб = ОбластьСтроки.Область("R1C4:R1C7");
			ОбластьСтроки.Удалитьобласть(ОбластьКолонкаЗуб,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		КонецЕсли; 
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		Пока ВыборкаУслуги.Следующий() Цикл
			ОбластьСтроки.Параметры.Заполнить(ВыборкаУслуги);
			ОбластьСтроки.Параметры.Услуга = ВыборкаУслуги.Номенклатура.НаименованиеПолное;
			СтрокаЗуб = "";			
			ОбластьСтроки.Параметры.Количество =  ?(ВыборкаУслуги.Количество = 0, 1, ВыборкаУслуги.Количество);			 
			
			НомерСтроки                         = НомерСтроки + 1;
			ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;
			
			ВыборкаПоЗубам = ВыборкаУслуги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"");
			Пока ВыборкаПоЗубам.Следующий() Цикл 
				
				Если ЗначениеЗаполнено(ВыборкаПоЗубам.Зуб) и СтрНайти(СтрокаЗуб, ВыборкаПоЗубам.Зуб) = 0 Тогда
					Если СтрокаЗуб = "" Тогда
						СтрокаЗуб = Строка(ВыборкаПоЗубам.Зуб);
					Иначе 
						СтрокаЗуб = СтрокаЗуб + ?(ЗначениеЗаполнено(ВыборкаПоЗубам.Зуб), ", ", "") + Строка(ВыборкаПоЗубам.Зуб);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если ЭтоСтоматологическиеУслуги Тогда
				ОбластьСтроки.Параметры.Зуб = СтрокаЗуб;
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьСтроки);
			
		КонецЦикла; 		
		
		ТабличныйДокумент.Вывести(ОбластьПодписи); 			
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент; 	
	
КонецФункции 

// Функция генерации печатной формы "СправкаВНалоговую"
//
Функция СформироватьПечатнуюФорму_СправкаВНалоговую(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПФ_MXL_Справка";
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратОтПокупателяЛечение.Номенклатура КАК Номенклатура,
	|	ВозвратОтПокупателяЛечение.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВозвратОтПокупателяЛечение.Всего КАК Всего
	|ПОМЕСТИТЬ ВозвращенныеУслуги
	|ИЗ
	|	Документ.ВозвратОтПокупателя.Лечение КАК ВозвратОтПокупателяЛечение
	|ГДЕ
	|	ВозвратОтПокупателяЛечение.Ссылка.ДокументОснования В(&МассивДокументов)
	|	И ВозвратОтПокупателяЛечение.Ссылка.Проведен = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриемУчтенныеАвансы.ДокументАванса КАК ДокументАванса
	|ПОМЕСТИТЬ ВТАвансы
	|ИЗ
	|	Документ.Прием.УчтенныеАвансы КАК ПриемУчтенныеАвансы
	|ГДЕ
	|	ПриемУчтенныеАвансы.Ссылка В (&МассивДокументов)
	|	И ((ВЫРАЗИТЬ(ПриемУчтенныеАвансы.ДокументАванса КАК Документ.ПланЛечения)) <> ЗНАЧЕНИЕ(Документ.ПланЛечения.ПустаяСсылка)
	|			ИЛИ (ВЫРАЗИТЬ(ПриемУчтенныеАвансы.ДокументАванса КАК Документ.НарядЗаказ)) <> ЗНАЧЕНИЕ(Документ.НарядЗаказ.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ПриемЛечение.КоличествоУпаковок - ЕСТЬNULL(ВозвращенныеУслуги.КоличествоУпаковок, 0)) КАК Количество,
	|	ВЫБОР
	|		КОГДА ПриемЛечение.КодУслуги = 0
	|			ТОГДА ПриемЛечение.Номенклатура.КодУслуги
	|		ИНАЧЕ ПриемЛечение.КодУслуги
	|	КОНЕЦ КАК КодУслуги,
	|	ПриемЛечение.Номенклатура КАК Номенклатура,
	|	СУММА(ПриемЛечение.Всего - ЕСТЬNULL(ВозвращенныеУслуги.Всего, 0)) КАК Всего
	|ПОМЕСТИТЬ ОказанныеУсулгиСУчетомВозвращенных
	|ИЗ
	|	Документ.Прием.Лечение КАК ПриемЛечение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВозвращенныеУслуги КАК ВозвращенныеУслуги
	|		ПО ПриемЛечение.Номенклатура = ВозвращенныеУслуги.Номенклатура
	|ГДЕ
	|	ПриемЛечение.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриемЛечение.Номенклатура,
	|	ВЫБОР
	|		КОГДА ПриемЛечение.КодУслуги = 0
	|			ТОГДА ПриемЛечение.Номенклатура.КодУслуги
	|		ИНАЧЕ ПриемЛечение.КодУслуги
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(ПриемЛечение.КоличествоУпаковок - ЕСТЬNULL(ВозвращенныеУслуги.КоличествоУпаковок, 0)) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Прием.Ссылка КАК Ссылка,
	|	Прием.Номер КАК Номер,
	|	Прием.Дата КАК ДатаОплаты,
	|	Прием.Контрагент КАК ФИО_Пациента,
	|	Прием.Контрагент.ТекущаяМедицинскаяКарта.Код КАК КодПациента,
	|	Прием.Сотрудник.Наименование КАК ФИО_Налогоплательщика,
	|	Прием.СтруктурнаяЕдиница.Организация.ПолноеНаименование КАК НаименованиеОрганизации,
	|	Прием.СтруктурнаяЕдиница.Организация.ИНН КАК ИНН_Организации,
	|	Прием.СтруктурнаяЕдиница.Организация.СерияНомер КАК СерияНомер,
	|	Прием.СтруктурнаяЕдиница.Организация.ДатаВыдачиЛицензии КАК ДатаВыдачиЛицензии,
	|	Прием.СтруктурнаяЕдиница.Организация.СрокДействияЛицензии КАК СрокДействияЛицензии,
	|	Прием.СтруктурнаяЕдиница.Организация.КемВыданаЛицензия КАК КемВыданаЛицензия
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОплаты УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(Прием.СуммаДокумента) КАК СуммаДокумента,
	|	СУММА(Прием.СуммаОплачено) КАК СуммаОплачено
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Ссылка В(&МассивДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОрганизацииКонтактнаяИнформация.Тип КАК Тип,
	|	ОрганизацииКонтактнаяИнформация.Вид КАК Вид,
	|	ОрганизацииКонтактнаяИнформация.Ссылка КАК Ссылка,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|ГДЕ
	|	ОрганизацииКонтактнаяИнформация.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтветственныеЛицаСрезПоследних.Сотрудник КАК ФИО_Сотрудника,
	|	ОтветственныеЛицаСрезПоследних.Должность КАК Должность
	|ИЗ
	|	РегистрСведений.ОтветственныеЛица.СрезПоследних КАК ОтветственныеЛицаСрезПоследних
	|ГДЕ
	|	ОтветственныеЛицаСрезПоследних.Организация = &Ссылка
	|	И ОтветственныеЛицаСрезПоследних.ТипОтветственногоЛица = &Бухгалтер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ВЫБОР
	|			КОГДА ОказанныеУсулгиСУчетомВозвращенных.КодУслуги = 1
	|				ТОГДА ОказанныеУсулгиСУчетомВозвращенных.Всего
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаКодУслуги1,
	|	СУММА(ВЫБОР
	|			КОГДА ОказанныеУсулгиСУчетомВозвращенных.КодУслуги = 2
	|				ТОГДА ОказанныеУсулгиСУчетомВозвращенных.Всего
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаКодУслуги2
	|ИЗ
	|	ОказанныеУсулгиСУчетомВозвращенных КАК ОказанныеУсулгиСУчетомВозвращенных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Контрагент КАК ФИО_Налогоплательщика,
	|	ВложенныйЗапрос.КонтрагентИНН КАК ИНН_Налогоплательщика
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		ВЫБОР
	|			КОГДА ПоступлениеДенежныхСредств.Контрагент.ЗаконныйПредставитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ПоступлениеДенежныхСредств.Контрагент.ЗаконныйПредставитель
	|			ИНАЧЕ ПоступлениеДенежныхСредств.Контрагент
	|		КОНЕЦ КАК Контрагент,
	|		ВЫБОР
	|			КОГДА ПоступлениеДенежныхСредств.Контрагент.ЗаконныйПредставитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ПоступлениеДенежныхСредств.Контрагент.ЗаконныйПредставитель.ИНН
	|			ИНАЧЕ ПоступлениеДенежныхСредств.Контрагент.ИНН
	|		КОНЕЦ КАК КонтрагентИНН
	|	ИЗ
	|		Документ.ПоступлениеДенежныхСредств КАК ПоступлениеДенежныхСредств
	|	ГДЕ
	|		ПоступлениеДенежныхСредств.РасшифровкаПлатежа.ДокументОснования В(&МассивДокументов)
	|		И ПоступлениеДенежныхСредств.Проведен = ИСТИНА
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ ПЕРВЫЕ 1
	|		СписаниеДенежныхСредств.Контрагент,
	|		СписаниеДенежныхСредств.Контрагент.ИНН
	|	ИЗ
	|		Документ.СписаниеДенежныхСредств КАК СписаниеДенежныхСредств
	|	ГДЕ
	|		СписаниеДенежныхСредств.РасшифровкаПлатежа.ДокументОснования В(&МассивДокументов)
	|		И СписаниеДенежныхСредств.Проведен = ИСТИНА
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ПоступлениеДенежныхСредств.Контрагент.ЗаконныйПредставитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ПоступлениеДенежныхСредств.Контрагент.ЗаконныйПредставитель
	|			ИНАЧЕ ПоступлениеДенежныхСредств.Контрагент
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ПоступлениеДенежныхСредств.Контрагент.ЗаконныйПредставитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ПоступлениеДенежныхСредств.Контрагент.ЗаконныйПредставитель.ИНН
	|			ИНАЧЕ ПоступлениеДенежныхСредств.Контрагент.ИНН
	|		КОНЕЦ
	|	ИЗ
	|		Документ.ПоступлениеДенежныхСредств КАК ПоступлениеДенежныхСредств
	|	ГДЕ
	|		ПоступлениеДенежныхСредств.Проведен
	|		И ПоступлениеДенежныхСредств.РасшифровкаПлатежа.ДокументАванса В
	|				(ВЫБРАТЬ
	|					ВТАвансы.ДокументАванса КАК ДокументАванса
	|				ИЗ
	|					ВТАвансы КАК ВТАвансы)) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Дата КАК Дата
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ПоступлениеДенежныхСредств.Дата, ДЕНЬ) КАК Дата
	|	ИЗ
	|		Документ.ПоступлениеДенежныхСредств КАК ПоступлениеДенежныхСредств
	|	ГДЕ
	|		ПоступлениеДенежныхСредств.РасшифровкаПлатежа.ДокументОснования В(&МассивДокументов)
	|		И ПоступлениеДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтКлиента)
	|		И ПоступлениеДенежныхСредств.Проведен = ИСТИНА
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(СписаниеДенежныхСредств.Дата, ДЕНЬ)
	|	ИЗ
	|		Документ.СписаниеДенежныхСредств КАК СписаниеДенежныхСредств
	|	ГДЕ
	|		СписаниеДенежныхСредств.РасшифровкаПлатежа.ДокументОснования В(&МассивДокументов)
	|		И СписаниеДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтКлиента)
	|		И СписаниеДенежныхСредств.Проведен = ИСТИНА
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ПоступлениеДенежныхСредств.Дата, ДЕНЬ)
	|	ИЗ
	|		Документ.ПоступлениеДенежныхСредств КАК ПоступлениеДенежныхСредств
	|	ГДЕ
	|		ПоступлениеДенежныхСредств.Проведен
	|		И ПоступлениеДенежныхСредств.РасшифровкаПлатежа.ДокументАванса В
	|				(ВЫБРАТЬ
	|					ВТАвансы.ДокументАванса КАК ДокументАванса
	|				ИЗ
	|					ВТАвансы КАК ВТАвансы)) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата");
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	Запрос.УстановитьПараметр("Ссылка"			, МассивОбъектов[0].СтруктурнаяЕдиница.Организация);
	Запрос.УстановитьПараметр("Бухгалтер"	    , Перечисления.ТипыОтветственныхЛиц.ГлавныйБухгалтер);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	Результат 	  	= ПакетЗапросов[0+3].Выбрать();
	ТЗ 		  	  	= ПакетЗапросов[1+3].Выгрузить();
	КИ 		  	 	= ПакетЗапросов[2+3].Выгрузить();
	Бухгалтер  		= ПакетЗапросов[3+3].Выбрать();
	СуммаКодУслуг	= ПакетЗапросов[4+3].Выбрать();
	ДанныеПациента	= ПакетЗапросов[5+3].Выбрать();
	ДанныеОплат     = ПакетЗапросов[6+3].Выгрузить();
	
	Для Каждого Док Из МассивОбъектов Цикл
		
		Если ТипЗнч(Док) = Тип("ДокументСсылка.СправкаВНалоговую") Тогда
			НомерДок = Док.Номер;
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.Следующий();
	ДанныеПациента.Следующий();
	ОбластьМакета = УправлениеПечатью.МакетПечатнойФормы("Документ.Прием.ПФ_MXL_Справка").ПолучитьОбласть("ОбластьМакета");
	ОбластьМакета.Параметры.Заполнить(Результат);
	ОбластьМакета.Параметры.Заполнить(ДанныеПациента);
	
	СуммаВсехКодовУслуг = 0;
	Если СуммаКодУслуг.Следующий() Тогда
		ОбластьМакета.Параметры.СуммаКодУслуги1 = Формат(СуммаКодУслуг.СуммаКодУслуги1, "ЧЦ=15; ЧДЦ=2; ЧН=0,00") + " руб.";
		ОбластьМакета.Параметры.СуммаКодУслуги2 = Формат(СуммаКодУслуг.СуммаКодУслуги2, "ЧЦ=15; ЧДЦ=2; ЧН=0,00") + " руб.";
		СуммаВсехКодовУслуг = ?(ТипЗнч(СуммаКодУслуг.СуммаКодУслуги1) = Тип("Число"), СуммаВсехКодовУслуг + СуммаКодУслуг.СуммаКодУслуги1, СуммаВсехКодовУслуг);
		СуммаВсехКодовУслуг = ?(ТипЗнч(СуммаКодУслуг.СуммаКодУслуги2) = Тип("Число"), СуммаВсехКодовУслуг + СуммаКодУслуг.СуммаКодУслуги2, СуммаВсехКодовУслуг); 
	КонецЕсли;
	    	
	СуммаПрописью = ФормированиеПечатныхФорм.СформироватьСуммуПрописью(СуммаВсехКодовУслуг);// ТЗ[0].СуммаДокумента);
	
	ОбластьМакета.Параметры.СтоимостьУслуг 		= СуммаПрописью;// Формат(ТЗ[0].СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧН=0,00") + " руб.";
	ДатаОплаты = СформироватьДатуОплаты(ДанныеОплат);
	ОбластьМакета.Параметры.ДатаОплаты			= ДатаОплаты;
	ОбластьМакета.Параметры.ДатаТекущая 	   	= Формат(ТекущаяДата(), "ДЛФ=DD");
	ОбластьМакета.Параметры.Номер 			   	= ФормированиеПечатныхФорм.ПолучитьНомерНаПечатьПосле2011г(НомерДок, Истина, Истина);
	ОбластьМакета.Параметры.СуммаПрописью 	   	= СуммаПрописью;
	ОбластьМакета.Параметры.ДатаВыдачиЛицензии 	= Формат(Результат.ДатаВыдачиЛицензии, "ДЛФ=DD");
	
	Если Бухгалтер.Следующий() Тогда
		
		ОбластьМакета.Параметры.ФИО_Сотрудника = Бухгалтер.ФИО_Сотрудника;
		ОбластьМакета.Параметры.Должность = Бухгалтер.Должность;
		
	КонецЕсли;
	
	// Если СуммаКодУслуг.Следующий() Тогда
	//	ОбластьМакета.Параметры.СуммаКодУслуги1 = Формат(СуммаКодУслуг.СуммаКодУслуги1, "ЧЦ=15; ЧДЦ=2; ЧН=0,00") + " руб.";
	//	ОбластьМакета.Параметры.СуммаКодУслуги2 = Формат(СуммаКодУслуг.СуммаКодУслуги2, "ЧЦ=15; ЧДЦ=2; ЧН=0,00") + " руб.";
	// КонецЕсли;
	
	Для Каждого Элемент Из КИ Цикл
		
		Если Элемент.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации Тогда
			ОбластьМакета.Параметры.НомерТелефона = Элемент.Представление;
		КонецЕсли;
		
		Если Элемент.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации Тогда
			ОбластьМакета.Параметры.АдресОрганизации = Элемент.Представление;
		КонецЕсли;
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция генерации печатной формы "ТалонАмбулаторногоПациента"
//
Функция СформироватьПечатнуюФорму_ТалонАмбулаторногоПациента(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати	= "ПараметрыПечати_ТалонАмбулаторногоПациента";
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ОтображатьСетку		= Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки	= Ложь;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Прием.ПФ_MXL_ТалонАмбулаторногоПациента");
	
	МассивДокументовПечати = Новый Массив;	
	Если ТипЗнч(МассивОбъектов) <> Тип("Массив") Тогда
		МассивДокументовПечати.Добавить(МассивОбъектов);
	Иначе
		МассивДокументовПечати = МассивОбъектов;
	Конецесли; 
	
	ПервыйДокумент = Истина;
	ДанныеПациента = Новый Структура;
	
	Для Каждого Документ Из МассивДокументовПечати Цикл
		
		Если Не ПервыйДокумент Тогда
			// Документы нужно выводить на разных страницах
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе 
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ДанныеДокумента = ПолучитьДанныеДокумента(Документ);
		Макет.Параметры.Заполнить(ДанныеДокумента);
		
		ВыделитьЯчейку("ВидОплаты"			, ДанныеДокумента.ВидОплаты			, Макет);
		ВыделитьЯчейку("ЦельОбращения"		, ДанныеДокумента.ЦельОбращения		, Макет);
		ВыделитьЯчейку("РезультатОбращения"	, ДанныеДокумента.РезультатОбращения, Макет);
		ВыделитьЯчейку("ЦельПосещения"		, ДанныеДокумента.ЦельПосещения		, Макет);
		ВыделитьЯчейку("Пол"				, ДанныеДокумента.Пол				, Макет);
		ВыделитьЯчейку("Занятость"			, ДанныеДокумента.Занятость			, Макет);
		ВыделитьЯчейку("ЗаконченныйСлучай"	, ДанныеДокумента.ЗаконченныйСлучай	, Макет);
		ВыделитьЯчейку("ВидОбращения"		, ДанныеДокумента.ВидОбращения		, Макет);
		
		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ЛицеваяСторона"));
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ОборотнаяСторона1"));
		ТабЛечение = ПолучитьСписокОказанныхУслугСУчетомВозвращенных(Документ); // Документ.Лечение;
		МедицинскаяУслуга1 = "";
		Если ТабЛечение.Количество() <> 0 Тогда
			МедицинскаяУслуга1 			= ТабЛечение[0].Номенклатура;
			Макет.Параметры.КодУслуги1  = МедицинскаяУслуга1.Артикул;
		КонецЕсли;	
		Макет.Параметры.МедицинскаяУслуга1 = МедицинскаяУслуга1;
		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("СтрокаУслуга1"));
		
		Если ТабЛечение.Количество() > 1 Тогда
			Для Ном = 1 По ТабЛечение.Количество() - 1 Цикл
				МедицинскаяУслуга2					= ТабЛечение[Ном].Номенклатура; 
				Макет.Параметры.МедицинскаяУслуга2  = МедицинскаяУслуга2;
				Макет.Параметры.КодУслуги2  		= МедицинскаяУслуга2.Артикул;
				ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("СтрокаУслуга2"));
			КонецЦикла;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ОборотнаяСторона2"));
		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("Рецепты"));
		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ОбратнаяСторонаПродолжение"));
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
		ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ.Ссылка
		);
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция генерации печатной формы "ГарантийныйТалон"
//
Функция СформироватьПечатнуюФорму_ГарантийныйТалон(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПФ_MXL_ГарантийныйТалон";
	
	// МассивОбъектов = ОтСортироватьМассивДокументов(МассивОбъектов);
	УстановитьПривилегированныйРежим(Истина);
	
	НесколькоВрачейВОдномПриеме = Константы.НесколькоВрачейВОдномПриеме.Получить();	
	
	КоличествоОбъектов = МассивОбъектов.Количество();
	ИндексОбъекта	   = 0;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		ЭтоСтоматологическиеУслуги = ОбщегоНазначенияСтоматология.ПолучитьПризнакОказанияСтоматологическихУслуг(ТекущийДокумент.Сотрудник); 
		НомерСтрокиНачало          = ТабличныйДокумент.ВысотаТаблицы + 1;
		ПакетЗапросов              = ПолучитьРезультатЗапроса(ТекущийДокумент);
		
		Прием 				= ПакетЗапросов[0].Выбрать();
		ТаблицаОплаты		= ПакетЗапросов[2+1].Выгрузить();
		ВыборкаЗаписи    	= ПакетЗапросов[3+1].Выбрать();
		ВыборкаПоУслугам 	= ПакетЗапросов[4+1].Выбрать();
		ТаблицаАвансов 		= ПакетЗапросов[5+1].Выгрузить();
		ТаблицаЛицевыеСчета = ПакетЗапросов[6+1].Выгрузить();   
		ТаблицаВозврата		= ПакетЗапросов[8].Выгрузить();
				
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Прием.ПФ_MXL_ГарантийныйТалон");
		
		//==============================================================ЗАПОЛНЕНИЕ ШАПКИ====================================================================
		Прием.Следующий();
		
		Область_Заголовок 	= Макет.ПолучитьОбласть("Заголовок");
		Область_Организация = Макет.ПолучитьОбласть("Организация");
		Область_Врач 		= Макет.ПолучитьОбласть("Врач");
		Область_Пациент 	= Макет.ПолучитьОбласть("Пациент");                                     
		Область_Диагноз 	= Макет.ПолучитьОбласть("Диагноз");
		
		НомерИДатаДокумента = "№ " + ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Прием.Номер, Прием.Организация.Префикс) + " от " + Формат(Прием.Дата, "ДЛФ=DD");
		
		Если ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.Прием") Тогда
			Область_Заголовок.Параметры.ТекстЗаголовка			= "Гарантийный талон приема " + НомерИДатаДокумента;
		ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.ПланЛечения") Тогда
			Область_Заголовок.Параметры.ТекстЗаголовка			= "Гарантийный талон плана лечения " + НомерИДатаДокумента;
		ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.НарядЗаказ") Тогда
			Область_Заголовок.Параметры.ТекстЗаголовка			= "Гарантийный талон наряд-заказа " + НомерИДатаДокумента;
		ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.Реализация") Тогда
			Область_Заголовок.Параметры.ТекстЗаголовка			= "Гарантийный талон реализации " + НомерИДатаДокумента;
		КонецЕсли;
		
		Область_Организация.Параметры.ПредставлениеОрганизации 	= ?(ЗначениеЗаполнено(Прием.Организация.ПолноеНаименование), Прием.Организация.ПолноеНаименование, Прием.Организация.Наименование);
		Область_Врач.Параметры.ПредставлениеВрача 				= Прием.Врач;
		Область_Пациент.Параметры.ПредставлениеПациента 		= СокрЛП(Прием.Пациент) + ?(ЗначениеЗаполнено(Прием.Пациент.ДатаРожденияКлиента),", дата рождения: " + Формат(Прием.Пациент.ДатаРожденияКлиента, "ДФ=dd.MM.yyyy"), "") + ?(ЗначениеЗаполнено(Прием.Пациент.Телефон), ", тел. " + Прием.Пациент.Телефон, "");
		
		Если ЗначениеЗаполнено(Прием.Диагноз) Тогда
			
			Если ТипЗнч(Прием.Диагноз) = Тип("СправочникСсылка.Диагнозы")
				И ЗначениеЗаполнено(Прием.Диагноз.Наименование) Тогда
				Область_Диагноз.Параметры.Диагноз = Прием.Диагноз.Наименование;
			Иначе
				Область_Диагноз.Параметры.Диагноз = Строка(Прием.Диагноз);		
			КонецЕсли;
			
		Иначе
			Область_Диагноз.Параметры.Диагноз = "";		
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Область_Заголовок);
		ТабличныйДокумент.Вывести(Область_Организация);
		Если НЕ НесколькоВрачейВОдномПриеме Тогда 
			ТабличныйДокумент.Вывести(Область_Врач);
		КонецЕсли;
		ТабличныйДокумент.Вывести(Область_Пациент);
		Если ЗначениеЗаполнено(Прием.Диагноз) Тогда
			ТабличныйДокумент.Вывести(Область_Диагноз);
		КонецЕсли;
	КонецЦикла;
	
	//=============================================================ЗАПОЛНЕНИЕ ГАРАНТИИ===================================================================
	ОбластьШапка  = Макет.ПолучитьОбласть("ШапкаГарантия");
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаГарантия");
	Если НЕ ЭтоСтоматологическиеУслуги Тогда
		ОбластьКолонкаЗуб = ОбластьШапка.Область("R1C3:R2C5");
		ОбластьШапка.Удалитьобласть(ОбластьКолонкаЗуб,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		ОбластьКолонкаЗуб = ОбластьСтрока.Область("R1C3:R1C5");
		ОбластьСтрока.Удалитьобласть(ОбластьКолонкаЗуб,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	//
	ВыборкаПоУслугам.Сбросить();
	НомерСтроки = 0;
	Пока ВыборкаПоУслугам.Следующий() Цикл				
		Если ТипЗнч(ВыборкаПоУслугам.Услуга) = Тип("СправочникСсылка.Номенклатура") И ВыборкаПоУслугам.Гарантия <> NULL И ВыборкаПоУслугам.Гарантия > 0 Тогда
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки = 1 Тогда
				ТабличныйДокумент.Вывести(ОбластьШапка);	
			КонецЕсли;				
			ОбластьСтрока.Параметры.Заполнить(ВыборкаПоУслугам);
			ОбластьСтрока.Параметры.Услуга        = ВыборкаПоУслугам.Услуга.НаименованиеПолное;
			ОбластьСтрока.Параметры.НомерСтроки   = НомерСтроки;
			ОбластьСтрока.Параметры.ГарантияС     = Прием.Дата;
			ОбластьСтрока.Параметры.ГарантияДо    = ДобавитьМесяц(Прием.Дата, ВыборкаПоУслугам.Гарантия);
			ТабличныйДокумент.Вывести(ОбластьСтрока);						
		КонецЕсли;					
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если КоличествоОбъектов > 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Комментарий");
		ОбластьМакета.Параметры.Комментарий = ?(ЗначениеЗаполнено(ТекущийДокумент), ТекущийДокумент.Комментарий, "");
		ТабличныйДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	
	Область_Подписи = Макет.ПолучитьОбласть("Подписи");
	ТабличныйДокумент.Вывести(Область_Подписи);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;

КонецФункции // ПечатнаяФорма()

// Функция генерации печатной формы "КонсультацияВрача"
//
Функция СформироватьПечатнуюФорму_КонсультацияВрача(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент                      = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПФ_MXL_КонсультацияВрача";
	ТабличныйДокумент.РазмерСтраницы       = "A4";
	
	ПервыйДокумент = Истина;
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			// Документы нужно выводить на разных страницах
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе 
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Прием.Дата КАК Дата,
		|	Прием.Контрагент.Наименование КАК КонтрагентНаименование,
		|	ЕСТЬNULL(Прием.Контрагент.ТекущаяМедицинскаяКарта.КодБезНулей, 0) КАК КодМедКартыБезНулей,
		|	Прием.Сотрудник.Наименование КАК СотрудникНаименование,
		|	Прием.Сотрудник.Должность КАК СотрудникДолжность
		|ИЗ
		|	Документ.Прием КАК Прием
		|ГДЕ
		|	Прием.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА Профосмотры.Специализация.Наименование = ""Ортодонтия""
		|			ТОГДА ""Ортодонт:""
		|		КОГДА Профосмотры.Специализация.Наименование = ""Гигиена""
		|			ТОГДА ""Гигиенист:""
		|		КОГДА Профосмотры.Специализация.Наименование = ""Терапия""
		|			ТОГДА ""Терапевт:""
		|		КОГДА Профосмотры.Специализация.Наименование = ""Хирургия""
		|			ТОГДА ""Хирург:""
		|		КОГДА Профосмотры.Специализация.Наименование = ""Ортопедия""
		|			ТОГДА ""Ортопед:""
		|		КОГДА Профосмотры.Специализация.Наименование = ""Парадонтология""
		|			ТОГДА ""Пародонтолог:""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Специализация,
		|	Профосмотры.Сотрудник.Наименование КАК Сотрудник
		|ИЗ
		|	РегистрСведений.Профосмотры КАК Профосмотры
		|ГДЕ
		|	Профосмотры.Прием = &Ссылка
		|	И Профосмотры.ВидОсмотра = ЗНАЧЕНИЕ(Перечисление.ВидыОсмотров.Направление)
		|	И Профосмотры.Специализация <> ЗНАЧЕНИЕ(Справочник.Специализации.ПустаяСсылка)
		|	И Профосмотры.Сотрудник.Ссылка <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Профосмотры.Специализация.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПриемЛечение.Зуб КАК НомерЗуба,
		|	ПриемЛечение.Количество КАК Количество,
		|	ПриемЛечение.Номенклатура.Представление КАК Услуга,
		|	ПриемЛечение.Номенклатура.КодНоменклатурыМедицинскиУслуг КАК КодУслуги,
		|	ПриемЛечение.Сумма КАК Стоимость
		|ИЗ
		|	Документ.Прием.Лечение КАК ПриемЛечение
		|ГДЕ
		|	ПриемЛечение.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриемЛечение.Зуб,
		|	ПриемЛечение.Количество,
		|	ПриемЛечение.Номенклатура.Представление,
		|	ПриемЛечение.Номенклатура.КодНоменклатурыМедицинскиУслуг,
		|	ПриемЛечение.Сумма"); 
		
		Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);  
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		ШапкаПечатнойФормы = РезультатЗапроса[0].Выбрать(); 		 
		Лечение = РезультатЗапроса[2].Выбрать();
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Прием.ПФ_MXL_КонсультацияВрача");
		ШапкаПечатнойФормы.Следующий();
		ОбластьМакета = Макет.ПолучитьОбласть("Пациент"); 
		ОбластьМакета.Параметры.Пациент = ШапкаПечатнойФормы.КонтрагентНаименование;
		ОбластьМакета.Параметры.ДатаПриема = Формат(ШапкаПечатнойФормы.Дата, "ДФ=dd.MM.yyyy"); 
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Врач"); 
		ОбластьМакета.Параметры.Врач = ШапкаПечатнойФормы.СотрудникНаименование; 
		ОбластьМакета.Параметры.НомерКарты = ШапкаПечатнойФормы.КодМедКартыБезНулей;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ТаблицаОбследований = РегистрыСведений.ЗначенияПараметровОбследований.ПолучитьМенеджераВременнойТаблицыОбследованияСтоматолога(ТекущийДокумент.Контрагент, ТекущийДокумент,, Истина);
		Если ЗначениеЗаполнено(ТаблицаОбследований) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаОбследования");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("Обследование");
			Для Каждого СтрокаТ Из ТаблицаОбследований Цикл 			
				// Используются только реквизиты дневника
				//Если Не СтрокаТ.ЭтоТитульныйРеквизит = Истина Тогда
				//	Продолжить;
				//КонецЕсли;
				ОбластьМакета.Параметры.ТекстИмяРеквизита = СтрокаТ.РеквизитНаименование; 			            
				ОбластьМакета.Параметры.ТекстЗначениеРеквизита = СтрокаТ.РеквизитЗначение; 
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
		КонецЕсли; 
		
		Если Не РезультатЗапроса[1].Пустой() Тогда
			Направления = РезультатЗапроса[1].Выбрать();
			ОбластьМакета = Макет.ПолучитьОбласть("НаправленияЗаголовок");
			ТабличныйДокумент.Вывести(ОбластьМакета); 
			ОбластьМакета = Макет.ПолучитьОбласть("Направления");
			Пока Направления.Следующий() Цикл 
				ОбластьМакета.Параметры.Специализация = Направления.Специализация;
				ОбластьМакета.Параметры.ПредставлениеНаправления = Направления.Сотрудник;
				ТабличныйДокумент.Вывести(ОбластьМакета);				
			КонецЦикла;	
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"); 			
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицы");
	
		Пока Лечение.Следующий() Цикл 
			ОбластьМакета.Параметры.Заполнить(Лечение); 
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;         
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подпись"); 
		ОбластьМакета.Параметры.ПодписьВрача = Строка(ШапкаПечатнойФормы.СотрудникДолжность) + " " + ШапкаПечатнойФормы.СотрудникНаименование;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		//ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла; 
	
	ТабличныйДокумент.АвтоМасштаб = Истина;	
	Возврат ТабличныйДокумент;
	
КонецФункции 

// Функция получения списка оказанынх услуг с учетом возвращённых.
//
Функция ПолучитьСписокОказанныхУслугСУчетомВозвращенных(Документ)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратОтПокупателяЛечение.Номенклатура,
	|	ВозвратОтПокупателяЛечение.КоличествоУпаковок
	|ПОМЕСТИТЬ ВозвращенныеУслуги
	|ИЗ
	|	Документ.ВозвратОтПокупателя.Лечение КАК ВозвратОтПокупателяЛечение
	|ГДЕ
	|	ВозвратОтПокупателяЛечение.Ссылка.ДокументОснования = &Ссылка
	|	И ВозвратОтПокупателяЛечение.Ссылка.Проведен = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриемЛечение.Номенклатура,
	|	СУММА(ПриемЛечение.КоличествоУпаковок - ЕСТЬNULL(ВозвращенныеУслуги.КоличествоУпаковок, 0)) КАК КоличествоУпаковок,
	|	ПриемЛечение.КодУслуги,
	|	ПриемЛечение.Номенклатура.Артикул КАК Артикул
	|ИЗ
	|	Документ.Прием.Лечение КАК ПриемЛечение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВозвращенныеУслуги КАК ВозвращенныеУслуги
	|		ПО ПриемЛечение.Номенклатура = ВозвращенныеУслуги.Номенклатура
	|ГДЕ
	|	ПриемЛечение.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриемЛечение.Номенклатура,
	|	ПриемЛечение.КодУслуги,
	|	ПриемЛечение.Номенклатура.Артикул
	|
	|ИМЕЮЩИЕ
	|	СУММА(ПриемЛечение.КоличествоУпаковок - ЕСТЬNULL(ВозвращенныеУслуги.КоличествоУпаковок, 0)) > 0");
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция получения списка печатных форм.
//
Функция ПолучитьСписокПечатныхФорм() Экспорт
	
	Список = Новый СписокЗначений;
	Список.Добавить("ПечатьМедКарты", "Медицинская карта", , БиблиотекаКартинок.Документ);
	Список.Добавить("ПечатьВкладышаКарты", "Вкладыш медицинской карты", , БиблиотекаКартинок.Документ); 
	Список.Добавить("ВкладышМедКартыДляСтраховой", "Вкладыш медицинской карты с услугами", , БиблиотекаКартинок.Документ);
	Список.Добавить("ПФ_MXL_АктОВыполненныхРаботах", "Акт о выполненных работах", , БиблиотекаКартинок.Документ); 
	Список.Добавить("ПФ_MXL_АктОВыполненныхРаботахБезСумм", "Акт о выполненных работах (без сумм)", , БиблиотекаКартинок.Документ);
	Список.Добавить("ПФ_MXL_Квитанция", "Квитанция об оплате", , БиблиотекаКартинок.Документ);
	Список.Добавить("ПФ_MXL_Справка", "Справка в налоговую", , БиблиотекаКартинок.Документ);
	Список.Добавить("ПФ_MXL_ГарантийныйТалон", "Гарантийный талон", , БиблиотекаКартинок.Документ);
	Список.Добавить("ПФ_MXL_ТалонАмбулаторногоПациента", "Талон амбулаторного пациента", , БиблиотекаКартинок.Документ);	
	Список.Добавить("ЛистУчетаДозовыхНагрузок", "Лист учета дозовых нагрузок пациента", , БиблиотекаКартинок.Документ); 
	Список.Добавить("ПФ_MXL_КонсультацияВрача", "Консультация врача", , БиблиотекаКартинок.Документ);
	
	Возврат Список;
	
КонецФункции

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Ложь;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Квитанция") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_Квитанция", "Квитанция", СформироватьПечатнуюФорму_Квитанция(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_Квитанция"));
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктОВыполненныхРаботах") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_АктОВыполненныхРаботах", "Акт о выполненных работах", СформироватьПечатнуюФорму_АктОВыполненныхРаботах(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_АктОВыполненныхРаботах"));
	КонецЕсли; 
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктОВыполненныхРаботахБезСумм") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_АктОВыполненныхРаботахБезСумм", "Акт о выполненных работах (без сумм)", СформироватьПечатнуюФорму_АктОВыполненныхРаботахБезСумм(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_АктОВыполненныхРаботах"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Справка") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_Справка", "Справка", СформироватьПечатнуюФорму_СправкаВНалоговую(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_Справка"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ТалонАмбулаторногоПациента") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ТалонАмбулаторногоПациента", "Талон амбулаторного пациента", СформироватьПечатнуюФорму_ТалонАмбулаторногоПациента(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ТалонАмбулаторногоПациента"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ГарантийныйТалон") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ГарантийныйТалон", "Гарантийный талон", СформироватьПечатнуюФорму_ГарантийныйТалон(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ГарантийныйТалон"));
	КонецЕсли; 
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_КонсультацияВрача") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_КонсультацияВрача", "Консультация врача", СформироватьПечатнуюФорму_КонсультацияВрача(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_КонсультацияВрача"));
	КонецЕсли;
	
КонецПроцедуры // Печать()

// Функция - Получить результат запроса
//
// Параметры:
//  ТекущийДокумент	 - 	 Текущий документ 
// 
Функция ПолучитьРезультатЗапроса(ТекущийДокумент)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Прием.Номер КАК Номер,
	|	Прием.Дата КАК Дата,
	|	Прием.СтруктурнаяЕдиница.Организация КАК Организация,
	|	Прием.Контрагент КАК Пациент,
	|	Прием.Сотрудник КАК Врач,
	|	Прием.СуммаДокумента КАК ОбщееИтогоСоСкидкой,
	|	Прием.СуммаОплачено КАК ИтогоОплачено,
	|	Прием.ПредварительнаяЗаписьНаСледующийПрием КАК ПредварительнаяЗапись,
	|	ВложенныйЗапрос.Диагноз КАК Диагноз
	|ИЗ
	|	Документ.Прием КАК Прием
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗначенияПараметровОбследований.Документ КАК Документ,
	|			ЗначенияПараметровОбследований.Значение КАК Диагноз
	|		ИЗ
	|			РегистрСведений.ЗначенияПараметровОбследований КАК ЗначенияПараметровОбследований
	|		ГДЕ
	|			ЗначенияПараметровОбследований.Параметр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПараметрыОбследований.Диагноз)) КАК ВложенныйЗапрос
	|		ПО Прием.Ссылка = ВложенныйЗапрос.Документ
	|ГДЕ
	|	Прием.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НарядЗаказ.Номер,
	|	НарядЗаказ.Дата,
	|	НарядЗаказ.СтруктурнаяЕдиница.Организация,
	|	НарядЗаказ.Контрагент,
	|	НарядЗаказ.Сотрудник,
	|	НарядЗаказ.СуммаПродажи,
	|	НарядЗаказ.СуммаОплаченоПродажи,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.НарядЗаказ КАК НарядЗаказ
	|ГДЕ
	|	НарядЗаказ.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПланЛечения.Номер,
	|	ПланЛечения.Дата,
	|	ПланЛечения.СтруктурнаяЕдиница.Организация,
	|	ПланЛечения.Контрагент,
	|	ПланЛечения.Сотрудник,
	|	ПланЛечения.СуммаДокумента,
	|	ПланЛечения.СуммаОплачено,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.ПланЛечения КАК ПланЛечения
	|ГДЕ
	|	ПланЛечения.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Реализация.Номер,
	|	Реализация.Дата,
	|	Реализация.СтруктурнаяЕдиница.Организация,
	|	Реализация.Контрагент,
	|	Реализация.Сотрудник,
	|	Реализация.СуммаДокумента,
	|	Реализация.СуммаОплачено,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ПриемЛечение.НомерСтроки) КАК НомерСтроки,
	|	ПриемЛечение.Номенклатура КАК Услуга,
	|	СУММА(ПриемЛечение.КоличествоУпаковок) КАК Количество,
	|	МАКСИМУМ(ПриемЛечение.Цена) КАК Цена,
	|	СУММА(ПриемЛечение.Цена * ЕСТЬNULL(ПриемЛечение.КоличествоУпаковок, 1)) КАК Сумма,
	|	СУММА(ПриемЛечение.Цена * ПриемЛечение.КоличествоУпаковок / 100 * ПриемЛечение.ПроцентСкидкиНаценки + ПриемЛечение.СуммаАвтоматическойСкидкиНаценки) КАК СуммаСкидки,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПриемЛечение.КоличествоУпаковок * ПриемЛечение.Цена - ПриемЛечение.Сумма = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПриемЛечение.КоличествоУпаковок * ПриемЛечение.Цена / 100 <> 0
	|						ТОГДА (ПриемЛечение.КоличествоУпаковок * ПриемЛечение.Цена - ПриемЛечение.Сумма) / (ПриемЛечение.КоличествоУпаковок * ПриемЛечение.Цена / 100)
	|				КОНЕЦ
	|		КОНЕЦ) КАК ПроцентСкидки,
	|	СУММА(ПриемЛечение.Сумма) КАК СуммаСоСкидкой,
	|	ПриемЛечение.Зуб КАК Зуб,
	|	ПриемЛечение.Гарантия КАК Гарантия,
	|	ВЫБОР
	|		КОГДА ПриемЛечение.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ПриемЛечение.Ссылка.Сотрудник
	|		ИНАЧЕ ПриемЛечение.Сотрудник
	|	КОНЕЦ КАК Врач,
	|	ПриемЛечение.Ссылка КАК Ссылка,
	|	ПриемЛечение.Номенклатура.НоменклатураМедицинскихУслуг.Код КАК Артикул
	|ПОМЕСТИТЬ ГруппировкаПоУслуге
	|ИЗ
	|	Документ.Прием.Лечение КАК ПриемЛечение
	|ГДЕ
	|	ПриемЛечение.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриемЛечение.Номенклатура,
	|	ПриемЛечение.Гарантия,
	|	ВЫБОР
	|		КОГДА ПриемЛечение.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ПриемЛечение.Ссылка.Сотрудник
	|		ИНАЧЕ ПриемЛечение.Сотрудник
	|	КОНЕЦ,
	|	ПриемЛечение.Ссылка,
	|	ПриемЛечение.Номенклатура.НоменклатураМедицинскихУслуг.Код,
	|	ПриемЛечение.Зуб
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемЗапасы.НомерСтроки,
	|	ПриемЗапасы.Номенклатура,
	|	ПриемЗапасы.КоличествоУпаковок,
	|	ПриемЗапасы.Цена,
	|	ПриемЗапасы.Цена * ЕСТЬNULL(ПриемЗапасы.КоличествоУпаковок, 1),
	|	ПриемЗапасы.Цена * ПриемЗапасы.КоличествоУпаковок / 100 * ПриемЗапасы.ПроцентСкидкиНаценки + ПриемЗапасы.СуммаАвтоматическойСкидкиНаценки,
	|	ВЫБОР
	|		КОГДА ПриемЗапасы.КоличествоУпаковок * ПриемЗапасы.Цена - ПриемЗапасы.Сумма = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПриемЗапасы.КоличествоУпаковок * ПриемЗапасы.Цена / 100 <> 0
	|					ТОГДА (ПриемЗапасы.КоличествоУпаковок * ПриемЗапасы.Цена - ПриемЗапасы.Сумма) / (ПриемЗапасы.КоличествоУпаковок * ПриемЗапасы.Цена / 100)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ПриемЗапасы.Сумма,
	|	"""",
	|	0,
	|	ПриемЗапасы.Ссылка.Сотрудник,
	|	ПриемЗапасы.Ссылка,
	|	ПриемЗапасы.Номенклатура.НоменклатураМедицинскихУслуг.Код
	|ИЗ
	|	Документ.Прием.Запасы КАК ПриемЗапасы
	|ГДЕ
	|	ПриемЗапасы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НарядЗаказЗапасы.НомерСтроки,
	|	НарядЗаказЗапасы.Номенклатура,
	|	НарядЗаказЗапасы.КоличествоУпаковок,
	|	НарядЗаказЗапасы.ЦенаПродажи,
	|	НарядЗаказЗапасы.ЦенаПродажи * ЕСТЬNULL(НарядЗаказЗапасы.КоличествоУпаковок, 1),
	|	0,
	|	0,
	|	НарядЗаказЗапасы.СуммаПродажи,
	|	НарядЗаказЗапасы.Зуб,
	|	0,
	|	НарядЗаказЗапасы.Ссылка.Сотрудник,
	|	НарядЗаказЗапасы.Ссылка,
	|	НарядЗаказЗапасы.Номенклатура.НоменклатураМедицинскихУслуг.Код
	|ИЗ
	|	Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
	|ГДЕ
	|	НарядЗаказЗапасы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ПланЛеченияЛечение.НомерСтроки),
	|	ПланЛеченияЛечение.Номенклатура,
	|	СУММА(ПланЛеченияЛечение.Количество),
	|	МАКСИМУМ(ПланЛеченияЛечение.Цена),
	|	СУММА(ПланЛеченияЛечение.Цена * ЕСТЬNULL(ПланЛеченияЛечение.Количество, 1)),
	|	СУММА(ПланЛеченияЛечение.Цена * ПланЛеченияЛечение.Количество / 100 * ПланЛеченияЛечение.ПроцентСкидкиНаценки + ПланЛеченияЛечение.СуммаАвтоматическойСкидкиНаценки),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПланЛеченияЛечение.Количество * ПланЛеченияЛечение.Цена - ПланЛеченияЛечение.Сумма = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПланЛеченияЛечение.Количество * ПланЛеченияЛечение.Цена / 100 <> 0
	|						ТОГДА (ПланЛеченияЛечение.Количество * ПланЛеченияЛечение.Цена - ПланЛеченияЛечение.Сумма) / (ПланЛеченияЛечение.Количество * ПланЛеченияЛечение.Цена / 100)
	|				КОНЕЦ
	|		КОНЕЦ),
	|	СУММА(ПланЛеченияЛечение.Сумма),
	|	ПланЛеченияЛечение.Зуб,
	|	0,
	|	ПланЛеченияЛечение.Ссылка.Сотрудник,
	|	ПланЛеченияЛечение.Ссылка,
	|	ПланЛеченияЛечение.Номенклатура.НоменклатураМедицинскихУслуг.Код
	|ИЗ
	|	Документ.ПланЛечения.Лечение КАК ПланЛеченияЛечение
	|ГДЕ
	|	ПланЛеченияЛечение.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланЛеченияЛечение.Номенклатура,
	|	ПланЛеченияЛечение.Зуб,
	|	ПланЛеченияЛечение.Ссылка.Сотрудник,
	|	ПланЛеченияЛечение.Ссылка,
	|	ПланЛеченияЛечение.Номенклатура.НоменклатураМедицинскихУслуг.Код
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияЗапасы.НомерСтроки,
	|	РеализацияЗапасы.Номенклатура,
	|	РеализацияЗапасы.КоличествоУпаковок,
	|	РеализацияЗапасы.Цена,
	|	РеализацияЗапасы.Цена * ЕСТЬNULL(РеализацияЗапасы.КоличествоУпаковок, 1),
	|	РеализацияЗапасы.Цена * РеализацияЗапасы.КоличествоУпаковок / 100 * РеализацияЗапасы.ПроцентСкидкиНаценки + РеализацияЗапасы.СуммаАвтоматическойСкидкиНаценки,
	|	ВЫБОР
	|		КОГДА РеализацияЗапасы.КоличествоУпаковок * РеализацияЗапасы.Цена - РеализацияЗапасы.Сумма = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РеализацияЗапасы.КоличествоУпаковок * РеализацияЗапасы.Цена / 100 <> 0
	|					ТОГДА (РеализацияЗапасы.КоличествоУпаковок * РеализацияЗапасы.Цена - РеализацияЗапасы.Сумма) / (РеализацияЗапасы.КоличествоУпаковок * РеализацияЗапасы.Цена / 100)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	РеализацияЗапасы.Сумма,
	|	"""",
	|	0,
	|	РеализацияЗапасы.Ссылка.Сотрудник,
	|	РеализацияЗапасы.Ссылка,
	|	РеализацияЗапасы.Номенклатура.НоменклатураМедицинскихУслуг.Код
	|ИЗ
	|	Документ.Реализация.Запасы КАК РеализацияЗапасы
	|ГДЕ
	|	РеализацияЗапасы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(РеализацияУслуги.НомерСтроки),
	|	РеализацияУслуги.Номенклатура,
	|	СУММА(РеализацияУслуги.Количество),
	|	МАКСИМУМ(РеализацияУслуги.Цена),
	|	СУММА(РеализацияУслуги.Цена * ЕСТЬNULL(РеализацияУслуги.КоличествоУпаковок, 1)),
	|	СУММА(РеализацияУслуги.Цена * РеализацияУслуги.КоличествоУпаковок / 100 * РеализацияУслуги.ПроцентСкидкиНаценки + РеализацияУслуги.СуммаАвтоматическойСкидкиНаценки),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА РеализацияУслуги.Количество * РеализацияУслуги.Цена - РеализацияУслуги.Сумма = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РеализацияУслуги.Количество * РеализацияУслуги.Цена / 100 <> 0
	|						ТОГДА (РеализацияУслуги.Количество * РеализацияУслуги.Цена - РеализацияУслуги.Сумма) / (РеализацияУслуги.Количество * РеализацияУслуги.Цена / 100)
	|				КОНЕЦ
	|		КОНЕЦ),
	|	СУММА(РеализацияУслуги.Сумма),
	|	"""",
	|	0,
	|	РеализацияУслуги.Ссылка.Сотрудник,
	|	РеализацияУслуги.Ссылка,
	|	РеализацияУслуги.Номенклатура.НоменклатураМедицинскихУслуг.Код
	|ИЗ
	|	Документ.Реализация.Услуги КАК РеализацияУслуги
	|ГДЕ
	|	РеализацияУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияУслуги.Ссылка,
	|	РеализацияУслуги.Номенклатура,
	|	РеализацияУслуги.Номенклатура.НоменклатураМедицинскихУслуг.Код,
	|	РеализацияУслуги.Ссылка.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратОтПокупателяЛечение.Номенклатура КАК Услуга,
	|	СУММА(ВозвратОтПокупателяЛечение.КоличествоУпаковок) КАК Количество,
	|	МАКСИМУМ(ВозвратОтПокупателяЛечение.Цена) КАК Цена,
	|	СУММА(ВозвратОтПокупателяЛечение.Цена * ЕСТЬNULL(ВозвратОтПокупателяЛечение.КоличествоУпаковок, 1)) КАК Сумма,
	|	СУММА(ВозвратОтПокупателяЛечение.Цена * ВозвратОтПокупателяЛечение.КоличествоУпаковок / 100 * ВозвратОтПокупателяЛечение.ПроцентСкидкиНаценки + ВозвратОтПокупателяЛечение.СуммаАвтоматическойСкидкиНаценки) КАК СуммаСкидки,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВозвратОтПокупателяЛечение.КоличествоУпаковок * ВозвратОтПокупателяЛечение.Цена - ВозвратОтПокупателяЛечение.Сумма = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВозвратОтПокупателяЛечение.КоличествоУпаковок * ВозвратОтПокупателяЛечение.Цена / 100 <> 0
	|						ТОГДА (ВозвратОтПокупателяЛечение.КоличествоУпаковок * ВозвратОтПокупателяЛечение.Цена - ВозвратОтПокупателяЛечение.Сумма) / (ВозвратОтПокупателяЛечение.КоличествоУпаковок * ВозвратОтПокупателяЛечение.Цена / 100)
	|				КОНЕЦ
	|		КОНЕЦ) КАК ПроцентСкидки,
	|	СУММА(ВозвратОтПокупателяЛечение.Сумма) КАК СуммаСоСкидкой,
	|	ВозвратОтПокупателяЛечение.Зуб КАК Зуб,
	|	ВозвратОтПокупателяЛечение.Номенклатура.НоменклатураМедицинскихУслуг.Код КАК Артикул
	|ПОМЕСТИТЬ ВозвратОтПокупателя
	|ИЗ
	|	Документ.ВозвратОтПокупателя.Лечение КАК ВозвратОтПокупателяЛечение
	|ГДЕ
	|	ВозвратОтПокупателяЛечение.Ссылка.ДокументОснования = &Ссылка
	|	И ВозвратОтПокупателяЛечение.Ссылка.Проведен = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратОтПокупателяЛечение.Номенклатура,
	|	ВозвратОтПокупателяЛечение.Номенклатура.НоменклатураМедицинскихУслуг.Код,
	|	ВозвратОтПокупателяЛечение.Зуб
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратОтПокупателяЗапасы.Номенклатура,
	|	СУММА(ВозвратОтПокупателяЗапасы.КоличествоУпаковок),
	|	МАКСИМУМ(ВозвратОтПокупателяЗапасы.Цена),
	|	СУММА(ВозвратОтПокупателяЗапасы.Цена * ЕСТЬNULL(ВозвратОтПокупателяЗапасы.КоличествоУпаковок, 1)),
	|	СУММА(ВозвратОтПокупателяЗапасы.Цена * ВозвратОтПокупателяЗапасы.КоличествоУпаковок / 100 * ВозвратОтПокупателяЗапасы.ПроцентСкидкиНаценки + ВозвратОтПокупателяЗапасы.СуммаАвтоматическойСкидкиНаценки),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВозвратОтПокупателяЗапасы.КоличествоУпаковок * ВозвратОтПокупателяЗапасы.Цена - ВозвратОтПокупателяЗапасы.Сумма = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВозвратОтПокупателяЗапасы.КоличествоУпаковок * ВозвратОтПокупателяЗапасы.Цена / 100 <> 0
	|						ТОГДА (ВозвратОтПокупателяЗапасы.КоличествоУпаковок * ВозвратОтПокупателяЗапасы.Цена - ВозвратОтПокупателяЗапасы.Сумма) / (ВозвратОтПокупателяЗапасы.КоличествоУпаковок * ВозвратОтПокупателяЗапасы.Цена / 100)
	|				КОНЕЦ
	|		КОНЕЦ),
	|	СУММА(ВозвратОтПокупателяЗапасы.Сумма),
	|	NULL,
	|	ВозвратОтПокупателяЗапасы.Номенклатура.НоменклатураМедицинскихУслуг.Код
	|ИЗ
	|	Документ.ВозвратОтПокупателя.Запасы КАК ВозвратОтПокупателяЗапасы
	|ГДЕ
	|	ВозвратОтПокупателяЗапасы.Ссылка.ДокументОснования = &Ссылка
	|	И ВозвратОтПокупателяЗапасы.Ссылка.Проведен = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратОтПокупателяЗапасы.Номенклатура,
	|	ВозвратОтПокупателяЗапасы.Номенклатура.НоменклатураМедицинскихУслуг.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации КАК ВидОперации,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата КАК ДатаПроведения,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	СУММА(ПоступлениеДенежныхСредствРасшифровкаПлатежа.Сумма) КАК Сумма,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументОснования КАК ДокументОснования
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеДенежныхСредствРасшифровкаПлатежа
	|ГДЕ
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ID_Транзакции В
	|			(ВЫБРАТЬ
	|				ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ID_Транзакции КАК ID_Транзакции
	|			ИЗ
	|				Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеДенежныхСредствРасшифровкаПлатежа
	|			ГДЕ
	|				(ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	|						И ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументОснования = &Ссылка
	|					ИЛИ ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументОснования = НЕОПРЕДЕЛЕНО
	|						И ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументАванса = &Ссылка)
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.ID_Транзакции
	|			ИЗ
	|				Документ.СписаниеДенежныхСредств.РасшифровкаПлатежа КАК СписаниеДенежныхСредствРасшифровкаПлатежа
	|			ГДЕ
	|				(СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	|						И СписаниеДенежныхСредствРасшифровкаПлатежа.ДокументОснования = &Ссылка
	|					ИЛИ СписаниеДенежныхСредствРасшифровкаПлатежа.ДокументОснования = НЕОПРЕДЕЛЕНО
	|						И СписаниеДенежныхСредствРасшифровкаПлатежа.ДокументАванса = &Ссылка))
	|	И ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	|	И ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ID_Транзакции <> &ПустойУникальныйИдентификатор
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипДенежныхСредств,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументОснования,
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации,
	|	СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата,
	|	СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипДенежныхСредств,
	|	СписаниеДенежныхСредствРасшифровкаПлатежа.Сумма,
	|	СписаниеДенежныхСредствРасшифровкаПлатежа.ДокументОснования
	|ИЗ
	|	Документ.СписаниеДенежныхСредств.РасшифровкаПлатежа КАК СписаниеДенежныхСредствРасшифровкаПлатежа
	|ГДЕ
	|	СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.ID_Транзакции В
	|			(ВЫБРАТЬ
	|				ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ID_Транзакции КАК ID_Транзакции
	|			ИЗ
	|				Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеДенежныхСредствРасшифровкаПлатежа
	|			ГДЕ
	|				(ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	|						И ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументОснования = &Ссылка
	|					ИЛИ ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументОснования = НЕОПРЕДЕЛЕНО
	|						И ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументАванса = &Ссылка)
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.ID_Транзакции
	|			ИЗ
	|				Документ.СписаниеДенежныхСредств.РасшифровкаПлатежа КАК СписаниеДенежныхСредствРасшифровкаПлатежа
	|			ГДЕ
	|				(СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	|						И СписаниеДенежныхСредствРасшифровкаПлатежа.ДокументОснования = &Ссылка
	|					ИЛИ СписаниеДенежныхСредствРасшифровкаПлатежа.ДокументОснования = НЕОПРЕДЕЛЕНО
	|						И СписаниеДенежныхСредствРасшифровкаПлатежа.ДокументАванса = &Ссылка))
	|	И СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	|	И СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.ID_Транзакции <> &ПустойУникальныйИдентификатор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтКлиента),
	|	ПриемУчтенныеАвансы.Ссылка.Дата,
	|	""Зачтен ранее внесенный аванс"",
	|	ПриемУчтенныеАвансы.СуммаАванса,
	|	ПриемУчтенныеАвансы.Ссылка
	|ИЗ
	|	Документ.Прием.УчтенныеАвансы КАК ПриемУчтенныеАвансы
	|ГДЕ
	|	ПриемУчтенныеАвансы.Ссылка.Проведен
	|	И ПриемУчтенныеАвансы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументОснования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытиеУслуги.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Событие.Услуги КАК СобытиеУслуги
	|ГДЕ
	|	СобытиеУслуги.Ссылка.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.Подтверждена), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.НеПодтверждена))
	|	И СобытиеУслуги.ДатаНачала >= &Дата
	|	И СобытиеУслуги.Ссылка.Контрагент = &Контрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытиеУслуги.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГруппировкаПоУслуге.Зуб КАК Зуб,
	|	ГруппировкаПоУслуге.НомерСтроки КАК НомерСтроки,
	|	ГруппировкаПоУслуге.Услуга КАК Услуга,
	|	ГруппировкаПоУслуге.Количество - ЕСТЬNULL(ВозвратОтПокупателя.Количество, 0) КАК Количество,
	|	ГруппировкаПоУслуге.Цена КАК Цена,
	|	ГруппировкаПоУслуге.Сумма - ЕСТЬNULL(ВозвратОтПокупателя.Сумма, 0) КАК Сумма,
	|	ГруппировкаПоУслуге.СуммаСкидки - ЕСТЬNULL(ВозвратОтПокупателя.СуммаСкидки, 0) КАК СуммаСкидки,
	|	ГруппировкаПоУслуге.ПроцентСкидки КАК ПроцентСкидки,
	|	ГруппировкаПоУслуге.СуммаСоСкидкой - ЕСТЬNULL(ВозвратОтПокупателя.СуммаСоСкидкой, 0) КАК СуммаСоСкидкой,
	|	ГруппировкаПоУслуге.Врач КАК Врач,
	|	ГруппировкаПоУслуге.Ссылка КАК Ссылка,
	|	ГруппировкаПоУслуге.Артикул КАК Артикул,
	|	ГруппировкаПоУслуге.Гарантия КАК Гарантия
	|ИЗ
	|	ГруппировкаПоУслуге КАК ГруппировкаПоУслуге
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВозвратОтПокупателя КАК ВозвратОтПокупателя
	|		ПО ГруппировкаПоУслуге.Услуга = ВозвратОтПокупателя.Услуга
	|			И ГруппировкаПоУслуге.Цена = ВозвратОтПокупателя.Цена
	|ГДЕ
	|	(ГруппировкаПоУслуге.Количество - ЕСТЬNULL(ВозвратОтПокупателя.Количество, 0) > 0
	|			ИЛИ ГруппировкаПоУслуге.Сумма - ЕСТЬNULL(ВозвратОтПокупателя.Сумма, 0) > 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.ДокументАванса КАК ДокументАванса,
	|	СУММА(ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	|			,
	|			Контрагент = &Контрагент
	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И ВЫБОР
	|					КОГДА ДокументАванса ССЫЛКА Документ.ПланЛечения
	|						ТОГДА ДокументАванса <> ЗНАЧЕНИЕ(Документ.ПланЛечения.ПустаяСсылка)
	|					КОГДА ДокументАванса ССЫЛКА Документ.НарядЗаказ
	|						ТОГДА ДокументАванса <> ЗНАЧЕНИЕ(Документ.НарядЗаказ.ПустаяСсылка)
	|				КОНЕЦ
	|				И (ДокументРеализации = НЕОПРЕДЕЛЕНО
	|					ИЛИ ДокументРеализации = ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
	|					ИЛИ ДокументРеализации = ЗНАЧЕНИЕ(Документ.Реализация.ПустаяСсылка)
	|					ИЛИ ДокументРеализации = ЗНАЧЕНИЕ(Документ.Поступление.ПустаяСсылка)
	|					ИЛИ ДокументРеализации = ЗНАЧЕНИЕ(Документ.ВводНачальныхОстатков.ПустаяСсылка))) КАК ВзаиморасчетыСКонтрагентамиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыСКонтрагентамиОстатки.ДокументАванса
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВзаиморасчетыСКонтрагентамиОстатки.ДокументАванса.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДенежныеСредстваНаЛицевыхСчетахОстатки.ВидСчета КАК ВидСчета,
	|	СУММА(ЕСТЬNULL(ДенежныеСредстваНаЛицевыхСчетахОстатки.СуммаОстаток, 0)) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаЛицевыхСчетах.Остатки(
	|			,
	|			Контрагент = &Контрагент
	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ДенежныеСредстваНаЛицевыхСчетахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ДенежныеСредстваНаЛицевыхСчетахОстатки.ВидСчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДенежныеСредстваНаЛицевыхСчетахОстатки.ВидСчета.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ВозвратОтПокупателя.Сумма) КАК Сумма,
	|	СУММА(ВозвратОтПокупателя.СуммаСкидки) КАК СуммаСкидки
	|ИЗ
	|	ВозвратОтПокупателя КАК ВозвратОтПокупателя";
	
	Запрос.УстановитьПараметр("Ссылка"                       , ТекущийДокумент);
	Запрос.УстановитьПараметр("Контрагент"                   , ТекущийДокумент.Контрагент);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"           , ТекущийДокумент.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Дата"                         , НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

// Функция - Получить данные документа
//
// Параметры:
//  Документ - 	 Документ 
// 
Функция ПолучитьДанныеДокумента(Документ)
	
	ДанныеДокумента = 
	Новый Структура("Дата, ДатаТалонаЧисло, ДатаТалонаМесяц, ДатаТалонаГод, " +
	"ЦельПосещения, ЦельОбращения, Врач2Специальность, Врач2ФИО, НаименованиеОрганизации, АдресОрганизации, " +
	"РезультатОбращения, ЗаконченныйСлучай, ВидОбращения, ВидОплаты, Врач1Специальность, Врач1ФИО, " +
	"Пациент, ОМССерияПолиса, ОМСНомерПолиса, СМО, Фамилия, Имя, Отчество, Пол, ДатаРожденияЧисло, ДатаРожденияМесяц, " +
	"ДатаРожденияГод, Занятость, МестоРаботыЧасть1, НомерКарты, ДокументВид, ДокументСерия, ДокументНомер");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Прием.Дата,
	|	Прием.Дата КАК Дата,
	|	1 КАК ЦельОбращения,
	|	ВЫБОР
	|		КОГДА Прием.РезультатПриема = 1
	|			ТОГДА 1
	|		КОГДА Прием.РезультатПриема = 2
	|			ТОГДА 10
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РезультатОбращения,
	|	ВЫБОР
	|		КОГДА Прием.РезультатПриема = 1
	|			ТОГДА 1
	|		КОГДА Прием.РезультатПриема = 2
	|			ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЗаконченныйСлучай,
	|	ВЫБОР
	|		КОГДА Прием.СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Первичный)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ВидОбращения,
	|	ВЫБОР
	|		КОГДА Прием.ПолисМедСтрахования <> ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|				  	КОГДА Прием.ПолисМедСтрахования.ТипПолиса = ЗНАЧЕНИЕ(Перечисление.ТипыПолиса.ДобровольноеМедицинскоеСтрахование)
	|						ТОГДА 4
	|					ИНАЧЕ 1
	|				  КОНЕЦ
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ВидОплаты,
	|	Прием.Сотрудник.Должность КАК Врач1Специальность,
	|	Прием.Сотрудник.Представление КАК Врач1ФИО,
	|	Прием.Ассистент.Должность КАК Врач2Специальность,
	|	Прием.Ассистент.Представление КАК Врач2ФИО,
	|	Прием.Контрагент КАК Пациент,
	|	Прием.ПолисМедСтрахования.СерияПолиса КАК ОМССерияПолиса,
	|	Прием.ПолисМедСтрахования.НомерПолиса КАК ОМСНомерПолиса,
	|	Прием.ПолисМедСтрахования.СтраховаяКомпания КАК СМО,
	|	Прием.Контрагент.Фамилия КАК Фамилия,
	|	Прием.Контрагент.Имя КАК Имя,
	|	Прием.Контрагент.Отчество КАК Отчество,
	|	ВЫБОР
	|		КОГДА Прием.Контрагент.ПолКлиента = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской)
	|			ТОГДА 1
	|		КОГДА Прием.Контрагент.ПолКлиента = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский)
	|			ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Пол,
	|	ВЫБОР
	|		КОГДА Прием.Контрагент.СоциальныйСтатус = ЗНАЧЕНИЕ(Справочник.СоциальныеСтатусыКонтрагентов.Работающий)
	|			ТОГДА 1
	|		КОГДА Прием.Контрагент.СоциальныйСтатус = ЗНАЧЕНИЕ(Справочник.СоциальныеСтатусыКонтрагентов.Военнослужащий)
	|			ТОГДА 2
	|		КОГДА Прием.Контрагент.СоциальныйСтатус = ЗНАЧЕНИЕ(Справочник.СоциальныеСтатусыКонтрагентов.Пенсионер)
	|			ТОГДА 3
	|		КОГДА Прием.Контрагент.СоциальныйСтатус = ЗНАЧЕНИЕ(Справочник.СоциальныеСтатусыКонтрагентов.Учащийся)
	|			ТОГДА 4
	|		КОГДА Прием.Контрагент.СоциальныйСтатус = ЗНАЧЕНИЕ(Справочник.СоциальныеСтатусыКонтрагентов.Неработающий)
	|			ТОГДА 5
	|		ИНАЧЕ 6
	|	КОНЕЦ КАК Занятость,
	|	Прием.Контрагент.Организация КАК МестоРаботыЧасть1,
	|	Прием.Контрагент.ТекущаяМедицинскаяКарта.КодБезНулей КАК НомерКарты,
	|	Прием.Контрагент.ДатаРожденияКлиента КАК ДатаРождения,
	|	Прием.СтруктурнаяЕдиница.Организация КАК Организация
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеДокумента, Выборка);
		
		Если ЗначениеЗаполнено(Выборка.Дата) Тогда
			ДанныеДокумента.ДатаТалонаЧисло = Формат(Выборка.Дата, "ДФ=dd");
			ДанныеДокумента.ДатаТалонаМесяц = Формат(Выборка.Дата, "ДФ=MM");
			ДанныеДокумента.ДатаТалонаГод   = Формат(Выборка.Дата, "ДФ=yyyy");
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ДатаРождения) Тогда
			ДанныеДокумента.ДатаРожденияЧисло = Формат(Выборка.ДатаРождения, "ДФ=dd");
			ДанныеДокумента.ДатаРожденияМесяц = Формат(Выборка.ДатаРождения, "ДФ=MM");
			ДанныеДокумента.ДатаРожденияГод   = Формат(Выборка.ДатаРождения, "ДФ=yyyy");
		КонецЕсли;
		Организация = Выборка.Организация;
		НаименованиеОрганизации = Выборка.Организация.ПолноеНаименование;
		АдресОрганизации = Организация.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, "Вид");
		Если АдресОрганизации <> Неопределено Тогда
			АдресОрганизации = АдресОрганизации.Представление;
		Иначе
			АдресОрганизации = "";
		КонецЕсли;
		ДанныеДокумента.НаименованиеОрганизации = НаименованиеОрганизации;
		ДанныеДокумента.АдресОрганизации = АдресОрганизации;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументыФизическихЛиц.ВидДокумента.Наименование КАК ДокументВид,
		|	ДокументыФизическихЛиц.Серия КАК ДокументСерия,
		|	ДокументыФизическихЛиц.Номер КАК ДокументНомер
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
		|ГДЕ
		|	ДокументыФизическихЛиц.Физлицо = &Физлицо";
		Запрос.УстановитьПараметр("Физлицо", Выборка.Пациент);
		ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
		Для Каждого Стр Из ТаблицаРезультат Цикл
			ДанныеДокумента.ДокументВид = Стр.ДокументВид;
			ДанныеДокумента.ДокументСерия = Стр.ДокументСерия;
			ДанныеДокумента.ДокументНомер = Стр.ДокументНомер;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ДанныеДокумента;
	
КонецФункции

// Процедура: ВыделитьЯчейку
//   Задает шрифт (жирный, подчеркнутый) для ячейки.
//
// Параметры:
//   ОбщееИмяЯчеек {Строка}
//     Начальная часть имени ячейки, для которой нужно изменить шрифт.
//   НомерЯчейки {Число}
//     Конечная часть имени ячейки, для которой нужно изменить шрифт.
//   Макет.
//     Макет, в котором находится ячейка.
///
Процедура ВыделитьЯчейку(ОбщееИмяЯчеек, НомерЯчейки, Макет)
	Если Не ЗначениеЗаполнено(НомерЯчейки) Тогда
		Возврат;
	КонецЕсли;
	ИмяЯчейки = ОбщееИмяЯчеек + НомерЯчейки;
	ОбластьЯчеек = Макет.Область(ИмяЯчейки);
	ОбластьЯчеек.Шрифт = Новый Шрифт(ОбластьЯчеек.Шрифт, , 10, Истина, , Истина);
	Если Макет.Области.Найти(ИмяЯчейки + "_") <> Неопределено Тогда
		ОбластьЯчеек = Макет.Область(ИмяЯчейки + "_");
		ОбластьЯчеек.Шрифт = Новый Шрифт(ОбластьЯчеек.Шрифт, , 10, Истина, , Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПредставленияДанных

// Процедура - Обработка получения полей представления
// 
// Параметры:
//  Поля				 - 	 - 
//  СтандартнаяОбработка - 	 - 
// 
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Ссылка");
	Поля.Добавить("ВремяНачалаПриема");
	Поля.Добавить("ВремяОкончанияПриема");
	Поля.Добавить("Номер");
	Поля.Добавить("Проведен");
	Поля.Добавить("ПометкаУдаления");
	Поля.Добавить("ТипЗаписи");
	Поля.Добавить("Продажа");
	Поля.Добавить("РезультатПриема");
    Поля.Добавить("ПометкаУдаления");

КонецПроцедуры

// Процедура - Обработка получения представления
// 
// Параметры:
//  Данные				 - 	 - 
//  Представление		 - 	 - 
//  СтандартнаяОбработка - 	 - 
// 
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Представление = "";
	
	Если Данные.Номер = Null ИЛИ НЕ ЗначениеЗаполнено(Данные.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	Номер = Данные.Номер;
	СтандартнаяОбработка = Ложь;
	
	Состояние = "";
	Если Данные.ПометкаУдаления Тогда
		Состояние = НСтр("ru='(удален)'");
	ИначеЕсли НЕ Данные.Проведен Тогда
		Состояние = НСтр("ru='(не проведен)'");
	КонецЕсли;
   	Если Данные.РезультатПриема <> 0 Тогда
		Статус = "окончен";
		ДатаДокумента = "в " + Формат(Данные.ВремяОкончанияПриема, "ДФ=HH:мм")+ ", " +  Формат(Данные.ВремяОкончанияПриема, "ДЛФ=DD");  
	Иначе
		Статус = "начат";
		ДатаДокумента = "в " + Формат(Данные.ВремяНачалаПриема, "ДФ=HH:мм") + ", " +  Формат(Данные.ВремяНачалаПриема, "ДЛФ=DD");
	КонецЕсли;
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru='%1%2 %3 %4 %5'"),
	"Прием № ",
	Номер,
	Статус,
	ДатаДокумента,
	Состояние
	);
	
КонецПроцедуры

#КонецОбласти

#Область ДОПОЛНИТЕЛЬНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

// Процедура производит запись номинала партии сертификата.
//
Процедура ЗаписатьНоминалСертификатаПриПродаже(ДокументСсылкаПрием) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриемЗапасы.Партия,
	|	ПриемЗапасы.Цена
	|ИЗ
	|	Документ.Прием.Запасы КАК ПриемЗапасы
	|ГДЕ
	|	ПриемЗапасы.Ссылка = &Ссылка
	|	И ПриемЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|	И ПриемЗапасы.Номенклатура.ВидНоминала
	|	И ПриемЗапасы.Ссылка.Проведен");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПрием);
	СписокЗапасов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаЗапасов Из СписокЗапасов Цикл
		Если ЗначениеЗаполнено(СтрокаЗапасов.Партия) Тогда
			Партия = СтрокаЗапасов.Партия.ПолучитьОбъект();
			Партия.Номинал = СтрокаЗапасов.Цена;
			Партия.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Получить массив обязательных для заполнения реквизитов реквизитов
//
Процедура ПолучитьМассивыОбязательныхРеквизитов(ДокументОбъект,МассивОбязательныхРеквизитов) Экспорт
	
	МассивОбязательныхРеквизитов.Добавить("Контрагент");
	МассивОбязательныхРеквизитов.Добавить("СтруктурнаяЕдиница");
	МассивОбязательныхРеквизитов.Добавить("Касса");
	МассивОбязательныхРеквизитов.Добавить("Склад");
	МассивОбязательныхРеквизитов.Добавить("Сотрудник");
	МассивОбязательныхРеквизитов.Добавить("Запасы.Номенклатура");
	МассивОбязательныхРеквизитов.Добавить("Запасы.КоличествоУпаковок");
	МассивОбязательныхРеквизитов.Добавить("Запасы.Цена");
	МассивОбязательныхРеквизитов.Добавить("Лечение.Номенклатура");
	МассивОбязательныхРеквизитов.Добавить("Лечение.Зуб");
	МассивОбязательныхРеквизитов.Добавить("Лечение.КоличествоУпаковок");
	МассивОбязательныхРеквизитов.Добавить("Лечение.Цена");
	
	Если НЕ ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьНулевуюСумму, Ложь) Тогда
		МассивОбязательныхРеквизитов.Добавить("СуммаДокумента");
	КонецЕсли;	
	Если ДокументОбъект.Лечение.Количество() > 0 Тогда
		МассивОбязательныхРеквизитов.Добавить("РезультатПриема");
	КонецЕсли;
	
КонецПроцедуры

// Функция вернет массив не повторяющихся ссылок на документы аванса из указанного приема
//
Функция ПолучитьДокументыАвансаИзПриема(ПриемСсылка) Экспорт
	
	МассивВозврата  = Новый Массив;
	Для Каждого СтрокаТЧ ИЗ ПриемСсылка.Лечение Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ДокументАванса) И МассивВозврата.Найти(СтрокаТЧ.ДокументАванса) = Неопределено Тогда
			МассивВозврата.Добавить(СтрокаТЧ.ДокументАванса);	
		КонецЕсли;
	КонецЦикла;
	Для Каждого  СтрокаТЧ ИЗ ПриемСсылка.Запасы Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ДокументАванса) И МассивВозврата.Найти(СтрокаТЧ.ДокументАванса) = Неопределено Тогда
			МассивВозврата.Добавить(СтрокаТЧ.ДокументАванса);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат  МассивВозврата;
КонецФункции

//
//
Функция СформироватьДатуОплаты(МассивОбъектов)
	
	Результат = "";
	Для каждого ОбъектДокумента Из МассивОбъектов Цикл
		
		Результат = Результат + ?(Результат = "", "", ", ") + Формат(ОбъектДокумента.Дата, "ДФ=dd.MM.yy");
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция, возвращает приемы и предварительные записи сотрудников.
//
Функция ПолучитьПриемыИЗаписиСотрудников(
		СтруктурнаяЕдиница,
		МассивСотрудников,
		ДатаСреза = Неопределено,
		НачалоПериода = Неопределено,
		КонецПериода = Неопределено,
		МассивРолей = Неопределено) Экспорт
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	|	ВложенныйЗапрос.ДатаНачала КАК ДатаНачала,
	|	ВложенныйЗапрос.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПриемЛечение.Ссылка КАК Ссылка,
	|		ПриемЛечение.Ссылка.Сотрудник КАК Сотрудник,
	|		НАЧАЛОПЕРИОДА(ПриемЛечение.Ссылка.ВремяНачалаПриема, МИНУТА) КАК ДатаНачала,
	|		НАЧАЛОПЕРИОДА(ПриемЛечение.Ссылка.ВремяОкончанияПриема, МИНУТА) КАК ДатаОкончания
	|	ИЗ
	|		Документ.Прием.Лечение КАК ПриемЛечение
	|	ГДЕ
	|		ПриемЛечение.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|		И ПриемЛечение.Сотрудник В(&МассивСотрудников)
	|		И ПриемЛечение.Ссылка.Проведен = ИСТИНА
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		СобытиеУслуги.Ссылка,
	|		СобытиеУслуги.Сотрудник,
	|		СобытиеУслуги.ДатаНачала,
	|		СобытиеУслуги.ДатаОкончания
	|	ИЗ
	|		Документ.Событие.Услуги КАК СобытиеУслуги
	|	ГДЕ
	|		СобытиеУслуги.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|		И СобытиеУслуги.Сотрудник В(&МассивСотрудников)
	|		И СобытиеУслуги.Ссылка.Проведен = ИСТИНА
	|		И СобытиеУслуги.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемНеСостоялся)
	|		И СобытиеУслуги.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)) КАК ВложенныйЗапрос
	|ГДЕ
	|	&УсловиеВремяПриема
	|	И &УсловиеРолиСотрудника
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачала,
	|	ДатаОкончания");
	
	Запрос.УстановитьПараметр("МассивСотрудников" , МассивСотрудников);
	Запрос.УстановитьПараметр("ДатаСреза"  		  , ?(ЗначениеЗаполнено(ДатаСреза), ДатаСреза, ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("НачалоПериода"     , НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода"	  , КонецПериода);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("РолиСотрудника"	  , МассивРолей);

	Если ЗначениеЗаполнено(НачалоПериода)
		И ЗначениеЗаполнено(КонецПериода) Тогда
			
		УсловиеВремяПриема = " ((ВложенныйЗапрос.ДатаНачала >= &НачалоПериода
						     |И ВложенныйЗапрос.ДатаНачала < &КонецПериода)
							 |ИЛИ (ВложенныйЗапрос.ДатаОкончания > &НачалоПериода
							 |И ВложенныйЗапрос.ДатаОкончания <= &КонецПериода)
							 |ИЛИ (ВложенныйЗапрос.ДатаОкончания <= &НачалоПериода
							 |И ВложенныйЗапрос.ДатаОкончания >= &КонецПериода))";
	Иначе
		
		УсловиеВремяПриема = ?(ЗначениеЗаполнено(ДатаСреза), "(ВложенныйЗапрос.ДатаНачала >= &ДатаСреза
														 |ИЛИ ВложенныйЗапрос.ДатаОкончания > &ДатаСреза)
														 |И НАЧАЛОПЕРИОДА(ВложенныйЗапрос.ДатаНачала, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаСреза, ДЕНЬ)", "ВложенныйЗапрос.ДатаОкончания > &ДатаСреза");
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВремяПриема", УсловиеВремяПриема);
	УсловиеРолиСотрудника = ?(ЗначениеЗаполнено(МассивРолей), "И ВложенныйЗапрос.Сотрудник.Роль В (&РолиСотрудника)", "");
	Запрос.Текст 		  = СтрЗаменить(Запрос.Текст, "И &УсловиеРолиСотрудника", УсловиеРолиСотрудника);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция - Получить последний прием по сделке
//
// Параметры:
//  Сделка	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПоследнийПриемПоСделке(Сделка) Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Прием.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Проведен
	|	И Прием.Сделка = &Сделка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Прием.Дата УБЫВ";
	
	ВыборкаПриема = Запрос.Выполнить().Выбрать();
	
	Возврат ?(ВыборкаПриема.Следующий(), ВыборкаПриема.Ссылка, Неопределено);
	
КонецФункции

// Функция - Результат приема изменен
//
// Параметры:
//  Прием					 - 	 - 
//  ТекущийРезультатПриема	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция РезультатПриемаИзменен(Прием, ТекущийРезультатПриема) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Прием) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Прием"					, Прием);
	Запрос.УстановитьПараметр("ТекущийРезультатПриема"	, ТекущийРезультатПриема);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументПрием.Ссылка КАК Прием
	|ИЗ
	|	Документ.Прием КАК ДокументПрием
	|ГДЕ
	|	ДокументПрием.Ссылка = &Прием
	|	И ДокументПрием.РезультатПриема = &ТекущийРезультатПриема";
	
	Возврат Запрос.Выполнить().Пустой();	
	
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

// Процедура - Актуализировать данные курса и лечения
//
// Параметры:
//  Прием		 - 	 - 
//  КурсЛечения	 - 	 - 
//  ЛечениеВрача - 	 - 
//
Процедура АктуализироватьДанныеКурсаИЛечения(Прием, КурсЛечения, ЛечениеВрача) Экспорт
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////   
	// ЛечениеВрача 
	Если ЗначениеЗаполнено(ЛечениеВрача) Тогда
		
		ЛечениеВрачаОбъект = ЛечениеВрача.ПолучитьОбъект();	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Прием.Ссылка КАК Ссылка,
		|	Прием.ВремяОкончанияПриема КАК ВремяОкончанияПриема,
		|	Прием.ВремяНачалаПриема КАК ВремяНачалаПриема,
		|	Прием.РезультатПриема КАК РезультатПриема,
		|	Прием.Номер КАК Номер,
		|	Прием.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.Прием КАК Прием
		|ГДЕ
		|	Прием.ЛечениеВрача = &ЛечениеВрача
		|	И Прием.Проведен
		|	И Прием.ВремяОкончанияПриема <> ДАТАВРЕМЯ(1, 1, 1)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВремяОкончанияПриема,
		|	РезультатПриема,
		|	Ссылка,
		|	Номер";
		
		Запрос.УстановитьПараметр("ЛечениеВрача", ЛечениеВрача);   
		Результат         = Запрос.Выполнить().Выгрузить();  
		ЗаписатьЛечение   = Ложь;
		КоличествоПриемов = Результат.Количество(); 
		ДатаОкончания     = Неопределено;
		Если КоличествоПриемов <= 1 Тогда 
			// 1. Если удаляют единственный прием по лечению, то удалять лечение
			ЛечениеВрачаОбъект.ДатаНачала      = Дата(1,1,1); 
			ЛечениеВрачаОбъект.ПометкаУдаления = Истина; 
			ДатаОкончания                      = Дата(1,1,1); 
			ЗаписатьЛечение = Истина;
		ИначеЕсли Результат[0].Ссылка = Прием Тогда
			// 2. Если удаляется первый прием по данному лечению, то дата начала лечения должна сдвигаться на дату следующего приема. 
			ЛечениеВрачаОбъект.ДатаНачала = Результат[1].ВремяНачалаПриема;
			ЗаписатьЛечение = Истина;
		ИначеЕсли Результат[КоличествоПриемов - 1].Ссылка = Прием Тогда 
			// 3. Если удаляется последний прием, то найти дату пред последнего приема для закрытия лечения
			Если Результат[КоличествоПриемов - 2].РезультатПриема = 1 И ЛечениеВрачаОбъект.ДатаОкончания <> Результат[КоличествоПриемов - 2].ВремяОкончанияПриема Тогда
				ДатаОкончания = Результат[КоличествоПриемов - 2].ВремяОкончанияПриема;
			ИначеЕсли Результат[КоличествоПриемов - 2].РезультатПриема = 2 Тогда
				ДатаОкончания = Дата(1,1,1);
			КонецЕсли; 
			ЗаписатьЛечение = (ДатаОкончания <> Неопределено); 
		ИначеЕсли Результат[КоличествоПриемов - 1].Ссылка <> Прием Тогда 
			// 4. Если удаляется НЕ последний прием, то найти дату последнего приема для закрытия лечения
			Если Результат[КоличествоПриемов - 1].РезультатПриема = 1 
				И ЛечениеВрачаОбъект.ДатаОкончания <> Результат[КоличествоПриемов - 1].ВремяОкончанияПриема Тогда
				ДатаОкончания = Результат[КоличествоПриемов - 1].ВремяОкончанияПриема;
			ИначеЕсли Результат[КоличествоПриемов - 1].РезультатПриема = 2
				И ЛечениеВрачаОбъект.ДатаОкончания <> Дата(1,1,1) Тогда
				ДатаОкончания = Дата(1,1,1);
			КонецЕсли;
			ЗаписатьЛечение = (ДатаОкончания <> Неопределено);
		КонецЕсли;
		
		Если ЗаписатьЛечение Тогда 
			ИтогСуммаПриемов = Результат.Итог("СуммаДокумента");
			ЛечениеВрачаОбъект.ДатаОкончания = ДатаОкончания; 
			ЛечениеВрачаОбъект.СуммаЛечения  = ИтогСуммаПриемов;
			Попытка
				ЛечениеВрачаОбъект.Записать(); 
			Исключение
				ОписаниеОшибки = "Ошибка при изменении даты окончания лечения по приему " + Строка(Прием) + " " + ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
				ЗаписьЖурналаРегистрации("ИзменениеЛеченияПриУдаленииПриема", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки); 
			КонецПопытки;
		КонецЕсли;		
		
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////   
	// КурсЛечения 
	Если ЗначениеЗаполнено(КурсЛечения) Тогда 
		
		КурсЛеченияОбъект = КурсЛечения.ПолучитьОбъект();	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Лечения.Ссылка КАК Ссылка,
		|	Лечения.ДатаНачала КАК ДатаНачала,
		|	Лечения.ДатаОкончания КАК ДатаОкончания,
		|	Лечения.СуммаЛечения КАК СуммаЛечения
		|ИЗ
		|	Справочник.Лечения КАК Лечения
		|ГДЕ
		|	Лечения.КурсЛечения = &КурсЛечения
		|	И НЕ Лечения.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОкончания УБЫВ,
		|	ДатаНачала УБЫВ,
		|	Ссылка УБЫВ";
	
		Запрос.УстановитьПараметр("КурсЛечения", КурсЛечения);
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда 
			КурсЛеченияОбъект.ДатаОкончания   = Дата(1,1,1);  
			КурсЛеченияОбъект.ДатаНачала      = Дата(1,1,1);
			КурсЛеченияОбъект.ПометкаУдаления = Истина;
			Попытка
				КурсЛеченияОбъект.Записать(); 
			Исключение
				ОписаниеОшибки = "Ошибка при изменении даты окончания курса лечения по приему " + Строка(Прием) + " " + ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
				ЗаписьЖурналаРегистрации("ИзменениеКурсаПриУдаленииПриема", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки); 
			КонецПопытки;
		КонецЕсли;  
		
		Если КурсЛеченияОбъект.ПометкаУдаления = Истина Тогда
			Возврат;	
		КонецЕсли;
		
		РезультатТЧ = Результат.Выгрузить();
		ДатаОкончания = Неопределено;
		ЛечениеВрачаОбъект = ЛечениеВрача.ПолучитьОбъект();
		Если ЛечениеВрачаОбъект.ДатаОкончания = Дата(1,1,1) Тогда
			ДатаОкончания = Дата(1,1,1);  
		Иначе 
			НайденныеСтроки            = РезультатТЧ.НайтиСтроки(Новый Структура("ДатаОкончания", Дата(1,1,1)));
			ЕстьОткрытыеЛеченияПоКурсу = (НайденныеСтроки.Количество() <> 0);
			Если Не ЕстьОткрытыеЛеченияПоКурсу Тогда
				Для Каждого СтрокаТЧ Из РезультатТЧ Цикл 
					Если СтрокаТЧ.ДатаОкончания <> Дата(1,1,1) Тогда 
						ДатаОкончания = СтрокаТЧ.ДатаОкончания;
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		РезультатТЧ.Сортировать("ДатаНачала");		
		ДатаНачала = РезультатТЧ[0].ДатаНачала;
		
		ЗаписыватьКурс = (ДатаОкончания <> Неопределено И КурсЛеченияОбъект.ДатаОкончания <> ДатаОкончания)
			Или (ДатаНачала <> Неопределено И КурсЛеченияОбъект.ДатаНачала <> ДатаНачала);
		Если ЗаписыватьКурс Тогда  
			Если ДатаОкончания <> Неопределено И КурсЛеченияОбъект.ДатаОкончания <> ДатаОкончания Тогда
				КурсЛеченияОбъект.ДатаОкончания = ДатаОкончания; 
			КонецЕсли;
			Если ДатаНачала <> Неопределено И КурсЛеченияОбъект.ДатаНачала <> ДатаНачала Тогда
				КурсЛеченияОбъект.ДатаНачала = ДатаНачала;
			КонецЕсли; 
			ИтогСуммаЛечений = РезультатТЧ.Итог("СуммаЛечения");
			Попытка
				КурсЛеченияОбъект.СуммаКурса = ИтогСуммаЛечений;
				КурсЛеченияОбъект.Записать(); 
			Исключение
				ОписаниеОшибки = "Ошибка при изменении даты окончания курса лечения по приему " + Строка(Прием) + " " + ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
				ЗаписьЖурналаРегистрации("ИзменениеКурсаПриУдаленииПриема", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки); 
			КонецПопытки;
		КонецЕсли;				
	КонецЕсли;
	
КонецПроцедуры

// Функция - Возвращает булево - был ли документ пробит по ФР.
//
Функция ДокументПробитПоФР(Прием) Экспорт

	Если НЕ ЗначениеЗаполнено(Прием) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПриемУчтенныеАвансы.ДокументАванса КАК ДокументАванса
	|ИЗ
	|	Документ.Прием.УчтенныеАвансы КАК ПриемУчтенныеАвансы
	|ГДЕ
	|	ПриемУчтенныеАвансы.Ссылка = &Ссылка
	|	И ПриемУчтенныеАвансы.НомерЧекаККМ > 0");
	
	Запрос.УстановитьПараметр("Ссылка", Прием);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ДокументПробитПоФР
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеДенежныхСредствРасшифровкаПлатежа
	|ГДЕ
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументОснования = &ДокументОснования
	|	И ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.НомерЧекаККМ > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	Документ.СписаниеДенежныхСредств.РасшифровкаПлатежа КАК СписаниеДенежныхСредствРасшифровкаПлатежа
	|ГДЕ
	|	СписаниеДенежныхСредствРасшифровкаПлатежа.ДокументОснования = &ДокументОснования
	|	И СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.НомерЧекаККМ > 0");
	
	Запрос.УстановитьПараметр("ДокументОснования", Прием);
	
	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

// Функция, возвращает структуру данных по приему.
//
Функция ПолучитьИнформациюИзТекущегоПриема(Прием) Экспорт
	
	ИнформацияПоПриему = Новый Структура(); 
	УстановитьПривилегированныйРежим(Истина);  
	
	Если ЗначениеЗаполнено(Прием.Контрагент) Тогда
		
#Область _______________________________________________________ЗУБНАЯ_фОРМУЛА___________________________________________________	
		
		Запрос = Новый запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗубнаяФормулаСрезПоследних.Зуб КАК Зуб,
		|	ВЫБОР
		|		КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Свой)
		|			ТОГДА ""0""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Удален)
		|					ТОГДА ""1""
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Штифт)
		|							ТОГДА ""2""
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Абатмент)
		|									ТОГДА ""3""
		|								ИНАЧЕ ""4""
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК СтатусЗуба
		|ИЗ
		|	РегистрСведений.ЗубнаяФормула.СрезПоследних(&Дата, Контрагент = &Контрагент) КАК ЗубнаяФормулаСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗубнаяФормулаСрезПоследних.Зуб,
		|	ВЫБОР
		|		КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Свой)
		|			ТОГДА ""0""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Удален)
		|					ТОГДА ""1""
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Штифт)
		|							ТОГДА ""2""
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Абатмент)
		|									ТОГДА ""3""
		|								ИНАЧЕ ""4""
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ");
		Запрос.УстановитьПараметр("Контрагент", Прием.Контрагент); 	
		Запрос.УстановитьПараметр("Дата",  Прием.Дата); 		
		Результат = Запрос.Выполнить().Выгрузить();			
		МассивСтатусов = Новый Массив;
		Для Каждого СтрокаТЧ из Результат Цикл
			МассивСтатусов.Добавить(Новый Структура("Зуб, СтатусЗуба", СтрокаТЧ.Зуб, СтрокаТЧ.СтатусЗуба));			
		КонецЦикла;
		ИнформацияПоПриему.Вставить("Статусы", МассивСтатусов);
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗубнаяФормулаСрезПоследних.Зуб КАК Зуб,
		|	ЗубнаяФормулаСрезПоследних.СостояниеЗубнойФормулы КАК Состояние,
		|	ЗубнаяФормулаСрезПоследних.СостояниеЗубнойФормулы.Цвет КАК Цвет,
		|	ЗубнаяФормулаСрезПоследних.Область КАК Область,
		|	ВЫБОР
		|		КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Свой)
		|			ТОГДА ""0""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Удален)
		|					ТОГДА ""1""
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Штифт)
		|							ТОГДА ""2""
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Абатмент)
		|									ТОГДА ""3""
		|								ИНАЧЕ ""4""
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК СтатусЗуба
		|ИЗ
		|	РегистрСведений.ЗубнаяФормула.СрезПоследних(&Дата, Контрагент = &Контрагент) КАК ЗубнаяФормулаСрезПоследних
		|ГДЕ
		|	НЕ ЗубнаяФормулаСрезПоследних.СостояниеЗубнойФормулы = ЗНАЧЕНИЕ(Справочник.СостояниеЗубнойФормулы.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗубнаяФормулаСрезПоследних.Зуб,
		|	ЗубнаяФормулаСрезПоследних.СостояниеЗубнойФормулы,
		|	ЗубнаяФормулаСрезПоследних.СостояниеЗубнойФормулы.Цвет,
		|	ЗубнаяФормулаСрезПоследних.Область,
		|	ВЫБОР
		|		КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Свой)
		|			ТОГДА ""0""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Удален)
		|					ТОГДА ""1""
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Штифт)
		|							ТОГДА ""2""
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ЗубнаяФормулаСрезПоследних.СостояниеЗуба = ЗНАЧЕНИЕ(Перечисление.СостояниеЗуба.Абатмент)
		|									ТОГДА ""3""
		|								ИНАЧЕ ""4""
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ");
		Запрос.УстановитьПараметр("Контрагент", Прием.Контрагент);					
		Запрос.УстановитьПараметр("Дата", Прием.Дата);
		Результат = Запрос.Выполнить().Выгрузить(); 
		МассивСостояний = Новый Массив;
		Для Каждого СтрокаТЧ из Результат Цикл
			МассивСостояний.Добавить(Новый Структура("Зуб, Состояние, Цвет, Область, СтатусЗуба", СтрокаТЧ.Зуб, СтрокаТЧ.Состояние, СтрокаТЧ.Цвет, СтрокаТЧ.Область, СтрокаТЧ.СтатусЗуба));			
		КонецЦикла;
		ИнформацияПоПриему.Вставить("Состояния", МассивСостояний);
		
#КонецОбласти	
		
#Область _______________________________________________________ТАБЛИЦА_УСЛУГИ___________________________________________________
		
		Если ТипЗнч(Прием) = Тип("ДокументСсылка.Прием") Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПриемЛечение.Номенклатура КАК Номенклатура,
			|	ПриемЛечение.Зуб КАК Зуб,
			|	ПриемЛечение.Количество КАК Количество,
			|	ПриемЛечение.Номенклатура.КодНоменклатурыМедицинскиУслуг КАК КодУслуги,
			|	ПриемЛечение.Номенклатура.Наименование КАК НоменклатураНаименование
			|ИЗ
			|	Документ.Прием.Лечение КАК ПриемЛечение
			|ГДЕ
			|	ПриемЛечение.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка", Прием); 
			Выборка = Запрос.Выполнить().Выгрузить(); 
			МассивУслуг = Новый Массив;
			Для Каждого СтрокаТЧ Из Выборка Цикл
				МассивУслуг.Добавить(Новый Структура("Номенклатура, Зуб, КодУслуги, Количество, НоменклатураНаименование", СтрокаТЧ.Номенклатура, СтрокаТЧ.Зуб, СтрокаТЧ.КодУслуги, СтрокаТЧ.Количество, СтрокаТЧ.НоменклатураНаименование));
			КонецЦикла;	
			ИнформацияПоПриему.Вставить("МассивУслуг", МассивУслуг);
			
#КонецОбласти	 
			
#Область _____________________________________________________ТИП_ЗУБНОЙ_ФОРМУЛЫ_________________________________________________
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗубнаяФормулаСрезПоследних.ТипЗубнойФормулы КАК ТипЗубнойФормулы
			|ИЗ
			|	РегистрСведений.ЗубнаяФормула.СрезПоследних(, Прием = &Прием) КАК ЗубнаяФормулаСрезПоследних"; 
			Запрос.УстановитьПараметр("Прием", Прием);
			Выборка = Запрос.Выполнить().Выбрать(); 
			Если Выборка.Следующий() Тогда
				ТипЗубнойФормулы = Выборка.ТипЗубнойФормулы;  
			Иначе
				ТипЗубнойФормулы = Прием.Контрагент.ТипЗубнойФормулы;  
			КонецЕсли;  
			
			ИнформацияПоПриему.Вставить("ТипЗубнойФормулы", ТипЗубнойФормулы); 
			
#КонецОбласти
			
#Область _____________________________________________________ТЕКСТ_ОБСЛЕДОВАНИЯ_________________________________________________
			
			ТаблицаОбследований = РегистрыСведений.ЗначенияПараметровОбследований.ПолучитьМенеджераВременнойТаблицыОбследованияСтоматолога(Прием.Контрагент, Прием,, Истина);
			
			МассивОбследований = Новый Массив;
			Для Каждого СтрокаТ Из ТаблицаОбследований Цикл 
				МассивОбследований.Добавить(Новый Структура("РеквизитНаименование, РеквизитЗначение", СтрокаТ.РеквизитНаименование, СтрокаТ.РеквизитЗначение));  
			КонецЦикла; 
			
			ИнформацияПоПриему.Вставить("МассивОбследований", МассивОбследований);  
			
#КонецОбласти 
			
		КонецЕсли;
		
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь); 
	
	Возврат ИнформацияПоПриему;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
