
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция, выполняет создание элемента справончика.
//
Функция СоздатьИсточникЗаписей(ВнешняяСистема, Наименование = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВнешняяСистема) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Наименование = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ВнешняяСистема, "Наименование");		
	КонецЕсли;
	
	СправочникОбъект 						= Справочники.ИсточникиЗаписей.СоздатьЭлемент();
	СправочникОбъект.Наименование   		= Наименование;
	СправочникОбъект.ВнешняяСистема 		= ВнешняяСистема;
	СправочникОбъект.ОбменДанными.Загрузка 	= Истина;
	
	Попытка
		СправочникОбъект.Записать();
		Возврат СправочникОбъект.Ссылка;
	Исключение
		Возврат Неопределено;
	КонецПопытки; 	
	
КонецФункции      

// Процедура - Обработка получения представления.
//
// Параметры:
//  Данные				 - 	 - 
//  Представление		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ПользователиСлужебныйПовтИсп.ЯзыкИнтерфейсаАнглийский() Тогда
		
		Если Данные.Ссылка = Справочники.ИсточникиЗаписей.Администратор Тогда
			Представление = "Administrator";	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли