
#Область СлужебныеПроцедурыИФункции

// Функция вернет массив мед. полисов контрагента активных на данные переданный период 
//
Функция ПолучитьАктивныеПолисыКонтрагента(Контрагент, Период = Неопределено, ТипПолиса = Неопределено, ПустаяДата = Истина, ВернутьРезультатЗапроса = Ложь) Экспорт
	
	ЗапросВыборка = Новый Запрос;
	ЗапросВыборка.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПолисыМедицинскогоСтрахования.Ссылка КАК Ссылка,
	|	ПолисыМедицинскогоСтрахования.Представление КАК Представление
	|ИЗ
	|	Справочник.ПолисыМедицинскогоСтрахования КАК ПолисыМедицинскогоСтрахования
	|ГДЕ
	|	ПолисыМедицинскогоСтрахования.Контрагент = &Контрагент
	|	И ПолисыМедицинскогоСтрахования.ПометкаУдаления = ЛОЖЬ
	|	И (ПолисыМедицинскогоСтрахования.ТипПолиса = &ТипПолиса
	|			ИЛИ &ТипПолиса = НЕОПРЕДЕЛЕНО)
	|	И ПолисыМедицинскогоСтрахования.ДанаНачала <= &Период
	|	И (ПолисыМедицинскогоСтрахования.ДатаОкончания >= &Период
	|			ИЛИ ПолисыМедицинскогоСтрахования.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|				И &ПустаяДата)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПолисыМедицинскогоСтрахования.ДатаОкончания УБЫВ";
	
	 ЗапросВыборка.УстановитьПараметр("Контрагент",Контрагент);
	 ЗапросВыборка.УстановитьПараметр("ТипПолиса" ,ТипПолиса);  
	 ЗапросВыборка.УстановитьПараметр("ПустаяДата",ПустаяДата);
	 ЗапросВыборка.УстановитьПараметр("Период"    ,?(ЗначениеЗаполнено(Период), НачалоДня(Период), НачалоДня(ТекущаяДата())));
	 
	 Если ВернутьРезультатЗапроса = Истина Тогда
		Возврат ЗапросВыборка.Выполнить().Выгрузить(); 	 
	 Иначе		 
		 Возврат ЗапросВыборка.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	 КонецЕсли; 
	 
КонецФункции

// Функция возвращает аббревиатуру типа полиса
//
Функция ПолучитьАббревиатуруТипаПолиса(ТипПолиса) Экспорт 
	
	ТипПолиса_Строка = Строка(ТипПолиса);
	Аббревиатура_ТипПолиса = Лев(ТипПолиса_Строка, 3);
	Возврат Аббревиатура_ТипПолиса;	
	
КонецФункции

// Функция, возвращает сумму оплат по полису.
//
Функция ПолучитьСуммуОплатыПоПолису(Полис, ДатаОкончания = Неопределено) Экспорт
	
	Если ДатаОкончания = Неопределено Тогда
		ДатаОкончания = ТекущаяДатаСеанса();
	КонецЕсли;                              
	
	Запрос = Новый Запрос;                  
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(ВзаиморасчетыСКонтрагентамиОбороты.СуммаРасход), 0) КАК СуммаОплачено
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(, &ДатаОкончания, Авто, ВЫРАЗИТЬ(ДокументРеализации КАК Документ.Прием).ПолисМедСтрахования = &ПолисМедСтрахования) КАК ВзаиморасчетыСКонтрагентамиОбороты";
	Запрос.УстановитьПараметр("ПолисМедСтрахования", Полис);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		Возврат ВыборкаЗапроса.СуммаОплачено;
	КонецЦикла;
	
КонецФункции

// Функция - Получить историю списания полиса.
//
Функция ПолучитьИсториюСписанияПолиса(Полис) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПродажиОбороты.Период КАК Период,
	|	ПродажиОбороты.ДокументПродажи КАК Регистратор,
	|	ЕСТЬNULL(ПродажиОбороты.СтоимостьОборот, 0) КАК Сумма,
	|	ВЫРАЗИТЬ(ПродажиОбороты.ДокументПродажи КАК Документ.Прием).Представление КАК Операция
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			,
	|			&Дата,
	|			Регистратор,
	|			ДокументПродажи ССЫЛКА Документ.Прием
	|				И ВЫРАЗИТЬ(ДокументПродажи КАК Документ.Прием).ПолисМедСтрахования = &ПолисМедСтрахования) КАК ПродажиОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	Запрос.УстановитьПараметр("ПолисМедСтрахования", Полис);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти