  
#Область ОбработчикиСобытий
  
// Процедура - Обработка заполнения
//
// Параметры:
//  ДанныеЗаполнения	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ДанныеЗаполнения = Неопределено Тогда		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			 ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - При копировании
//
// Параметры:
//  ОбъектКопирования	 - 	 - 
//
Процедура ПриКопировании(ОбъектКопирования)
	КодСинхронизации = "";
КонецПроцедуры

// Процедура - Перед записью
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Наименование = СформироватьНаименование();
	КонецЕсли;	
		
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция вернет стандартное наименование элемента справочника
//
Функция СформироватьНаименование() Экспорт
	
	Возврат Строка(СтраховаяКомпания) + " №"+ НомерПолиса + " с "+ Формат(ДанаНачала,"ДФ=dd.MM.yyyy") + " по " + Формат(ДатаОкончания,"ДФ=dd.MM.yyyy");
	
КонецФункции

#КонецОбласти
