
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Создает 2 чека коррекции: сторно и корректный чек.
//
// Параметры:
//  Контекст - Структура - данные обработки Создание чеков коррекции.
// 
// Возвращаемое значение:
//   Структура - содержит свойства:
//     * ЧекКоррекцииСторно - ДокументСсылка.ЧекКоррекции - чек коррекции сторно.
//     * ЧекКоррекции - ДокументСсылка.ЧекКоррекции - чек коррекции.
//
Функция СоздатьЧекиКоррекции(Контекст) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ЧекКоррекцииСторно");
	Результат.Вставить("ЧекКоррекцииСторноПроведен");
	Результат.Вставить("ЧекСкорректированный");
	Результат.Вставить("ЧекСкорректированныйПроведен");
	
	Если НЕ ЗначениеЗаполнено(Контекст.ЧекСторно) Тогда
		РезультатЧекСторно = ЧекКоррекцииСторно(Контекст);
		Если РезультатЧекСторно <> Неопределено Тогда
			Результат.ЧекКоррекцииСторно 			= РезультатЧекСторно.ЧекКоррекцииСторно;
			Результат.ЧекКоррекцииСторноПроведен 	= РезультатЧекСторно.ЧекПроведен;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Контекст.ЧекСкорректированный) Тогда
		РезультатЧек = ЧекКоррекции(Контекст);
		Если РезультатЧек <> Неопределено Тогда
			Результат.ЧекСкорректированный 			= РезультатЧек.ЧекСкорректированный;
			Результат.ЧекСкорректированныйПроведен 	= РезультатЧек.ЧекПроведен;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция получает ставку НДС по значению ставки.
//
Функция ПолучитьСтавкуНДСПоЗначениюСтавки(ЗначениеСтавкиНДС) Экспорт
	
	Если ЗначениеСтавкиНДС = Неопределено Тогда
		Возврат Перечисления.СтавкиНДС.БезНДС;
	Иначе
		
		Попытка
			ЗначениеСтавкиНДС = Число(ЗначениеСтавкиНДС);
		Исключение
			Возврат  Перечисления.СтавкиНДС.БезНДС;			
		КонецПопытки;    		
			
		СоответствиеСтавокНДС = Новый Соответствие;
		СоответствиеСтавокНДС.Вставить(0	, Перечисления.СтавкиНДС.НДС0);
		СоответствиеСтавокНДС.Вставить(10	, Перечисления.СтавкиНДС.НДС10);
		СоответствиеСтавокНДС.Вставить(18	, Перечисления.СтавкиНДС.НДС18);
		СоответствиеСтавокНДС.Вставить(20	, Перечисления.СтавкиНДС.НДС20);
		
		Результат = СоответствиеСтавокНДС.Получить(ЗначениеСтавкиНДС);
		Если Результат = Неопределено Тогда
			Возврат Перечисления.СтавкиНДС.БезНДС;
		Иначе
			Возврат Результат;
		КонецЕсли;     		                                       
	КонецЕсли;   	
	
	Возврат Перечисления.СтавкиНДС.БезНДС;
	
КонецФункции       

&НаСервере
// Заполняет чек коррекции на основании.
//
// Параметры:
//  Основание - ДокументСсылка - документ основание для создания чека коррекции.
//  Отказ - Булево - признак отказа от выполнения операции.
//
Функция ПолучитьДанныеЧекаКоррекцииНаОсновеФискальнойОперации(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Параметры) <> Тип("Структура")
		Или (ТипЗнч(Параметры) = Тип("Структура")
		И (Не Параметры.Свойство("Касса")
		Или Не Параметры.Свойство("ТипКоррекции")
		Или Не Параметры.Свойство("НомерПредписания") 
		Или Не Параметры.Свойство("ОписаниеКоррекции")
		Или Не Параметры.Свойство("Комментарий"))) Тогда
		
		Возврат Неопределено;
	КонецЕсли;
			
	ФискальнаяОперация = Результат.ДанныеФискальнойОперации;
	
	Если ФискальнаяОперация = Неопределено Тогда
		
		ТекстСообщения = НСтр("ru = 'Нет сохраненной фискальной операции для документа'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		// Отказ = Истина;
		Возврат Неопределено;
		
	ИначеЕсли ФискальнаяОперация.ЕстьКорректирующийДокумент Тогда
		
		ТекстСообщения = НСтр("ru = 'По данному документу ранее была создана корректировка документом %1. 
		|Создание повторной корректировки не возможно.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
		ФискальнаяОперация.ЧекКоррекции);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		// Отказ = Истина;
		Возврат Неопределено;
		
	КонецЕсли;
	
	Объект = ПолучитьСтруктуруДанных();
	
	Основание = ФискальнаяОперация.ДокументОснование;

	ЗаполнитьЗначенияСвойств(Объект, ФискальнаяОперация);
	
	Для Каждого ЭлементМ Из ФискальнаяОперация.МассивОснований Цикл
		НоваяСтрока = ПолучитьСтруктуруТаблицаОснований();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМ);
		Объект.ТаблицаОснований.Добавить(НоваяСтрока);
		Если ТипЗнч(НоваяСтрока.ДокументОснование) = Тип("ДокументСсылка.Реализация")
			Или ТипЗнч(НоваяСтрока.ДокументОснование) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
			
			Если ФискальнаяОперация.МассивУчтенныеАвансы.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ФискальнаяОперация.МассивУчтенныеАвансы[0]);
				НоваяСтрока.ИдентификаторФискальнойЗаписи = ФискальнаяОперация.МассивУчтенныеАвансы[0].ИдентификаторЗаписи;  
				Для Индекс = 1 По ФискальнаяОперация.МассивУчтенныеАвансы.Количество() - 1 Цикл
					// НоваяСтрока = Объект.ТаблицаОснований.Добавить();
					НоваяСтрока = ПолучитьСтруктуруТаблицаОснований();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМ);
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ФискальнаяОперация.МассивУчтенныеАвансы[Индекс]); 
					НоваяСтрока.ИдентификаторФискальнойЗаписи = ФискальнаяОперация.МассивУчтенныеАвансы[Индекс].ИдентификаторЗаписи;
					Объект.ТаблицаОснований.Добавить(НоваяСтрока);
				КонецЦикла; 				
			КонецЕсли;	
			
		КонецЕсли;		
	КонецЦикла;
		
	Объект.Дата								= ТекущаяДатаСеанса();
	Объект.АвторДокумента 					= ОбщегоНазначенияСтоматология.ТекущийПользователь();
	Объект.ДатаКоррекции 					= ФискальнаяОперация.ДатаРасчета;
	Объект.ДополнительныйРеквизит 			= ФискальнаяОперация.ФискальныйПризнак;
	Объект.ДанныеXMLКорректируемогоЧека		= ФискальнаяОперация.ДанныеXML.Получить();
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств")
		Или ТипЗнч(Основание) = Тип("ДокументСсылка.СписаниеДенежныхСредств") Тогда
		Объект.ВидОперации = Основание.ВидОперации;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.Реализация") Тогда
		Объект.ВидОперации = Перечисления.ВидыОпераций.Продажа;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
		Объект.ВидОперации = Перечисления.ВидыОпераций.Возврат;
	КонецЕсли;
	
	ОбщиеПараметры = МенеджерОборудованияВызовСервера.ЗагрузитьДанныеФискализацииИзXML(Объект.ДанныеXMLКорректируемогоЧека);
	
	ЗаполнитьЗначенияСвойств(Объект, ОбщиеПараметры, "СистемаНалогообложения, ТипРасчета, Кассир, КассирИНН");
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЧекКоррекции") Тогда
		Объект.Контрагент		= Основание.Покупатель;
		Объект.КонтрагентИНН	= Основание.ПокупательИНН;
	Иначе
		Объект.Контрагент		= ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Основание			, "Контрагент");
		Объект.КонтрагентИНН	= ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.Контрагент	, "ИНН");
	КонецЕсли;
			
	Объект.СНОКорректируемогоДокумента = ОбщиеПараметры.СистемаНалогообложения;
	Объект.ПризнакАгента 			   = ОбщиеПараметры.ПризнакАгента;
	
	Обработки.СозданиеЧековКоррекции.ПолучитьДанныеДляПробитияЧекаККМ(ФискальнаяОперация.ДокументОснование, ОбщиеПараметры);
	ЗаполнитьПозицииЧекаПоОбщимПараметрамСНоменклатурой(Объект, ОбщиеПараметры);
	
	// Оплаты
	Для Каждого СтрокаОплаты Из ОбщиеПараметры.ТаблицаОплат Цикл
		НоваяСтрока = ПолучитьСтруктуруОплаты();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОплаты);//,, "ТипОплаты"
		Объект.Оплата.Добавить(НоваяСтрока);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры, "Касса, ТипКоррекции, НомерПредписания, ОписаниеКоррекции, Комментарий");
	
	Возврат Объект;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

// Процедура получает данные позиций чека.
//
Процедура ПолучитьДанныеДляПробитияЧекаККМ(ДокументОснование, ОбщиеПараметры = Неопределено) Экспорт
	
	ТаблицаТоваровОснования = Неопределено;
	
	// Из документа только пытаемся получить номенлкатру. сумму и цены берем с чека.
	// Т.к. в случае частичной оплаты 
	// Цена и сумма распределяются согласно оплате (оплата кредита)
	//
	// Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств") Тогда
	//	
	//	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Основание КАК Основание
	//	|ПОМЕСТИТЬ ВТОснования
	//	|ИЗ
	//	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеДенежныхСредствРасшифровкаПлатежа
	//	|ГДЕ
	//	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка = &ДокументОснование
	//	|	И ПоступлениеДенежныхСредствРасшифровкаПлатежа.Основание <> НЕОПРЕДЕЛЕНО
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	//	|	ВЫБОР
	//	|		КОГДА (ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК СТРОКА(50))) <> """"
	//	|			ТОГДА ВложенныйЗапрос.Номенклатура.НаименованиеПолное
	//	|		ИНАЧЕ ВложенныйЗапрос.Номенклатура.Наименование
	//	|	КОНЕЦ КАК Наименование
	//	|ИЗ
	//	|	(ВЫБРАТЬ
	//	|		РеализацияЗапасы.Номенклатура КАК Номенклатура
	//	|	ИЗ
	//	|		Документ.Реализация.Запасы КАК РеализацияЗапасы
	//	|	ГДЕ
	//	|		РеализацияЗапасы.Ссылка В
	//	|				(ВЫБРАТЬ
	//	|					ВТОснования.Основание
	//	|				ИЗ
	//	|					ВТОснования)
	//	|	
	//	|	ОБЪЕДИНИТЬ ВСЕ
	//	|	
	//	|	ВЫБРАТЬ
	//	|		ВводНачальныхОстатковПродажи.Номенклатура
	//	|	ИЗ
	//	|		Документ.ВводНачальныхОстатков.Продажи КАК ВводНачальныхОстатковПродажи
	//	|	ГДЕ
	//	|		ВводНачальныхОстатковПродажи.Ссылка В
	//	|				(ВЫБРАТЬ
	//	|					ВТОснования.Основание
	//	|				ИЗ
	//	|					ВТОснования)
	//	|	
	//	|	ОБЪЕДИНИТЬ ВСЕ
	//	|	
	//	|	ВЫБРАТЬ
	//	|		ВводНачальныхОстатковЧленстваПакетыУслуг.Номенклатура
	//	|	ИЗ
	//	|		Документ.ВводНачальныхОстатков.ЧленстваПакетыУслуг КАК ВводНачальныхОстатковЧленстваПакетыУслуг
	//	|	ГДЕ
	//	|		ВводНачальныхОстатковЧленстваПакетыУслуг.Ссылка В
	//	|				(ВЫБРАТЬ
	//	|					ВТОснования.Основание
	//	|				ИЗ
	//	|					ВТОснования)) КАК ВложенныйЗапрос");
	//	
	//	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	//	ТаблицаТоваровОснования = Запрос.Выполнить().Выгрузить();
	//	
	// ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Реализация") Тогда
	//	
	//	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	РеализацияЗапасы.Номенклатура КАК Номенклатура,
	//	|	ВЫБОР
	//	|		КОГДА (ВЫРАЗИТЬ(РеализацияЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(50))) <> """"
	//	|			ТОГДА РеализацияЗапасы.Номенклатура.НаименованиеПолное
	//	|		ИНАЧЕ РеализацияЗапасы.Номенклатура.Наименование
	//	|	КОНЕЦ КАК Наименование
	//	|ИЗ
	//	|	Документ.Реализация.Запасы КАК РеализацияЗапасы
	//	|ГДЕ
	//	|	РеализацияЗапасы.Ссылка = &ДокументОснование"
	//	);
	//	
	//	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	//	ТаблицаТоваровОснования = Запрос.Выполнить().Выгрузить();
	//	
	// ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
	//	
	//	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	ВозвратОтПокупателяЗапасы.Номенклатура КАК Номенклатура,
	//	|	ВЫБОР
	//	|		КОГДА (ВЫРАЗИТЬ(ВозвратОтПокупателяЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(50))) <> """"
	//	|			ТОГДА ВозвратОтПокупателяЗапасы.Номенклатура.НаименованиеПолное
	//	|		ИНАЧЕ ВозвратОтПокупателяЗапасы.Номенклатура.Наименование
	//	|	КОНЕЦ КАК Наименование
	//	|ИЗ
	//	|	Документ.ВозвратОтПокупателя.Запасы КАК ВозвратОтПокупателяЗапасы
	//	|ГДЕ
	//	|	ВозвратОтПокупателяЗапасы.Ссылка = &ДокументОснование"
	//	);
	//	
	//	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	//	ТаблицаТоваровОснования = Запрос.Выполнить().Выгрузить();
	//	
	// ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СписаниеДенежныхСредств") Тогда
	//	
	//	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	СписаниеДенежныхСредствРасшифровкаПлатежа.Основание КАК Основание
	//	|ПОМЕСТИТЬ ВТОснования
	//	|ИЗ
	//	|	Документ.СписаниеДенежныхСредств.РасшифровкаПлатежа КАК СписаниеДенежныхСредствРасшифровкаПлатежа
	//	|ГДЕ
	//	|	СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка = &ДокументОснование
	//	|	И СписаниеДенежныхСредствРасшифровкаПлатежа.Основание <> НЕОПРЕДЕЛЕНО
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	//	|	ВЫБОР
	//	|		КОГДА (ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК СТРОКА(50))) <> """"
	//	|			ТОГДА ВложенныйЗапрос.Номенклатура.НаименованиеПолное
	//	|		ИНАЧЕ ВложенныйЗапрос.Номенклатура.Наименование
	//	|	КОНЕЦ КАК Наименование
	//	|ИЗ
	//	|	(ВЫБРАТЬ
	//	|		РеализацияЗапасы.Номенклатура КАК Номенклатура
	//	|	ИЗ
	//	|		Документ.Реализация.Запасы КАК РеализацияЗапасы
	//	|	ГДЕ
	//	|		РеализацияЗапасы.Ссылка В
	//	|				(ВЫБРАТЬ
	//	|					ВТОснования.Основание
	//	|				ИЗ
	//	|					ВТОснования)) КАК ВложенныйЗапрос");
	//	
	//	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	//	ТаблицаТоваровОснования = Запрос.Выполнить().Выгрузить(); 
	//	
	// ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЧекКоррекции") Тогда
	//	
	//	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	ЧекКоррекцииПозицииЧека.НаименованиеПредметаРасчета КАК Номенклатура,
	//	|	ВЫБОР
	//	|		КОГДА ТИПЗНАЧЕНИЯ(ЧекКоррекцииПозицииЧека.НаименованиеПредметаРасчета) = ТИП(Справочник.Номенклатура)
	//	|			ТОГДА ВЫБОР
	//	|					КОГДА (ВЫРАЗИТЬ(ЧекКоррекцииПозицииЧека.НаименованиеПредметаРасчета.НаименованиеПолное КАК СТРОКА(150))) <> """"
	//	|						ТОГДА ВЫРАЗИТЬ(ЧекКоррекцииПозицииЧека.НаименованиеПредметаРасчета.НаименованиеПолное КАК СТРОКА(150))
	//	|					ИНАЧЕ ЧекКоррекцииПозицииЧека.НаименованиеПредметаРасчета.Наименование
	//	|				КОНЕЦ
	//	|		ИНАЧЕ ЧекКоррекцииПозицииЧека.НаименованиеПредметаРасчета
	//	|	КОНЕЦ КАК Наименование
	//	|ИЗ
	//	|	Документ.ЧекКоррекции.ПозицииЧека КАК ЧекКоррекцииПозицииЧека
	//	|ГДЕ
	//	|	ЧекКоррекцииПозицииЧека.Ссылка = &ДокументОснование"
	//	);
	//	
	//	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	//	ТаблицаТоваровОснования = Запрос.Выполнить().Выгрузить();
	//	
	// КонецЕсли;
	//
	
	Если ТаблицаТоваровОснования <> Неопределено Тогда
		Для Каждого СтрокаОбщиеПараметры Из ОбщиеПараметры.ПозицииЧека Цикл		
			СтрокаОбщиеПараметры.Вставить("Номенклатура"); 		 
			МассивСтрок = ТаблицаТоваровОснования.НайтиСтроки(Новый Структура("Наименование", СтрокаОбщиеПараметры.Наименование));
			Если МассивСтрок.Количество() = 1 Тогда
				СтрокаОбщиеПараметры.Номенклатура = МассивСтрок[0].Номенклатура;
			// Иначе // попытка найти по истории изменения Полного наименования
			//	Запрос = Новый Запрос(
			//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			//	|	Обсуждения.Объект КАК Объект
			//	|ИЗ
			//	|	РегистрСведений.Обсуждения КАК Обсуждения
			//	|ГДЕ
			//	|	Обсуждения.Объект В(&Объект)
			//	|	И Обсуждения.Комментарий ПОДОБНО &Комментарий");
			//	
			//	Запрос.УстановитьПараметр("Объект"		, ТаблицаТоваровОснования.ВыгрузитьКолонку("Номенклатура"));
			// 	Запрос.УстановитьПараметр("Комментарий"	, "%Полное наименование%" + СтрокаОбщиеПараметры.Наименование + "%");
			//	
			//	Результат = Запрос.Выполнить().Выгрузить();
			//	Если Результат.Количество() > 0 Тогда
			//		СтрокаОбщиеПараметры.Номенклатура = Результат[0].Объект;
			//	КонецЕсли;			  
			КонецЕсли;  
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

// Функция - возвращает массив фискальных операций документа основания.
//
Функция ПолучитьДанныеФискальныхОпераций_old(ДокументОснование) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФискальныеОперацииДокументы.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	|	ФискальныеОперацииДокументы.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВременнаяТаблицаИдентификаторФискальнойОперации
	|ИЗ
	|	РегистрСведений.ФискальныеОперацииДокументы КАК ФискальныеОперацииДокументы
	|ГДЕ
	|	ФискальныеОперацииДокументы.ДокументОснование = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФискальныеОперацииДокументы.ДокументОснование КАК ДокументОснование,
	|	ФискальныеОперацииДокументы.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	|	ФискальныеОперации.ОплатаНаличные КАК ОплатаНаличные,
	|	ФискальныеОперации.ОплатаЭлектронно КАК ОплатаЭлектронно,
	|	ФискальныеОперации.ОплатаПостоплата КАК ОплатаПостоплата,
	|	ФискальныеОперации.ОплатаПредоплата КАК ОплатаПредоплата,
	|	ФискальныеОперации.ОплатаВстречноеПредоставление КАК ОплатаВстречноеПредоставление,
	|	ФискальныеОперации.ТипРасчета КАК ТипРасчета,
	|	ФискальныеОперации.Дата
	|ПОМЕСТИТЬ ВТДокументыФискальнойОперации
	|ИЗ
	|	РегистрСведений.ФискальныеОперацииДокументы КАК ФискальныеОперацииДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	|		ПО (ФискальныеОперации.ИдентификаторЗаписи = ФискальныеОперацииДокументы.ИдентификаторЗаписи)
	|ГДЕ
	|	ФискальныеОперацииДокументы.ИдентификаторЗаписи В
	|			(ВЫБРАТЬ
	|				ВременнаяТаблицаИдентификаторФискальнойОперации.ИдентификаторЗаписи
	|			ИЗ
	|				ВременнаяТаблицаИдентификаторФискальнойОперации)
	|	И ФискальныеОперации.ИдентификаторЗаписи В
	|			(ВЫБРАТЬ
	|				ВременнаяТаблицаИдентификаторФискальнойОперации.ИдентификаторЗаписи
	|			ИЗ
	|				ВременнаяТаблицаИдентификаторФискальнойОперации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧекКоррекцииТаблицаОснований.Ссылка КАК ЧекКоррекции,
	|	ВТДокументыФискальнойОперации.ДокументОснование КАК ДокументОснование,
	|	ВТДокументыФискальнойОперации.ТипРасчета КАК ТипРасчета,
	|	ВТДокументыФискальнойОперации.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	|	ВТДокументыФискальнойОперации.Дата
	|ПОМЕСТИТЬ ВременнаяТаблицаЧекКоррекции
	|ИЗ
	|	ВТДокументыФискальнойОперации КАК ВТДокументыФискальнойОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекКоррекции.ТаблицаОснований КАК ЧекКоррекцииТаблицаОснований
	|		ПО ВТДокументыФискальнойОперации.ТипРасчета = ЧекКоррекцииТаблицаОснований.Ссылка.ТипРасчета
	|			И (ЧекКоррекцииТаблицаОснований.Ссылка.Проведен = ИСТИНА)
	|			И (ЧекКоррекцииТаблицаОснований.Ссылка.ПробитЧек = ИСТИНА)
	|			И ВТДокументыФискальнойОперации.ДокументОснование = ЧекКоррекцииТаблицаОснований.ДокументОснование
	|ГДЕ
	|	НЕ ЧекКоррекцииТаблицаОснований.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧекКоррекцииТаблицаОснований.Ссылка КАК ЧекКоррекции,
	|	ВТДокументыФискальнойОперации.ДокументОснование КАК ДокументОснование,
	|	ВТДокументыФискальнойОперации.ТипРасчета КАК ТипРасчета,
	|	ВТДокументыФискальнойОперации.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	|	ВТДокументыФискальнойОперации.Дата
	|ПОМЕСТИТЬ ВременнаяТаблицаЧекКоррекцииСторно
	|ИЗ
	|	ВТДокументыФискальнойОперации КАК ВТДокументыФискальнойОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекКоррекции.ТаблицаОснований КАК ЧекКоррекцииТаблицаОснований
	|		ПО (ЧекКоррекцииТаблицаОснований.Ссылка.Проведен = ИСТИНА)
	|			И (ЧекКоррекцииТаблицаОснований.Ссылка.ПробитЧек = ИСТИНА)
	|			И ВТДокументыФискальнойОперации.ДокументОснование = ЧекКоррекцииТаблицаОснований.ДокументОснование
	|ГДЕ
	|	ЧекКоррекцииТаблицаОснований.Ссылка.ЭтоСторно = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДокументыФискальнойОперации.ДокументОснование,
	|	ВТДокументыФискальнойОперации.ИдентификаторЗаписи,
	|	ВТДокументыФискальнойОперации.ОплатаНаличные,
	|	ВТДокументыФискальнойОперации.ОплатаЭлектронно,
	|	ВТДокументыФискальнойОперации.ОплатаПостоплата,
	|	ВТДокументыФискальнойОперации.ОплатаПредоплата,
	|	ВТДокументыФискальнойОперации.ОплатаВстречноеПредоставление,
	|	ВТДокументыФискальнойОперации.ТипРасчета,
	|	ВТДокументыФискальнойОперации.Дата,
	|	ВременнаяТаблицаЧекКоррекции.ЧекКоррекции
	|ПОМЕСТИТЬ ВТРезультат
	|ИЗ
	|	ВТДокументыФискальнойОперации КАК ВТДокументыФискальнойОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаЧекКоррекции КАК ВременнаяТаблицаЧекКоррекции
	|		ПО ВТДокументыФискальнойОперации.ИдентификаторЗаписи = ВременнаяТаблицаЧекКоррекции.ИдентификаторЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаЧекКоррекции.ИдентификаторЗаписи,
	|	ВременнаяТаблицаЧекКоррекции.ЧекКоррекции,
	|	ВременнаяТаблицаЧекКоррекции.ЧекКоррекции.НомерЧекаККМ,
	|	ВременнаяТаблицаЧекКоррекции.ЧекКоррекции.ПробитЧек
	|ПОМЕСТИТЬ ВременнаяТаблицаЧекКоррекцииИдентификаторЗаписи
	|ИЗ
	|	ВременнаяТаблицаЧекКоррекции КАК ВременнаяТаблицаЧекКоррекции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаЧекКоррекцииСторно.ИдентификаторЗаписи,
	|	ВременнаяТаблицаЧекКоррекцииСторно.ЧекКоррекции,
	|	ВременнаяТаблицаЧекКоррекцииСторно.ЧекКоррекции.НомерЧекаККМ,
	|	ВременнаяТаблицаЧекКоррекцииСторно.ЧекКоррекции.ПробитЧек
	|ПОМЕСТИТЬ ВременнаяТаблицаЧекКоррекцииСторноИдентификаторЗаписи
	|ИЗ
	|	ВременнаяТаблицаЧекКоррекцииСторно КАК ВременнаяТаблицаЧекКоррекцииСторно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТРезультат.ИдентификаторЗаписи
	|ИЗ
	|	ВТРезультат КАК ВТРезультат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРезультат.ЧекКоррекции,
	|	ВТРезультат.ИдентификаторЗаписи,
	|	ВТРезультат.ОплатаНаличные,
	|	ВТРезультат.ОплатаЭлектронно,
	|	ВТРезультат.ОплатаПостоплата,
	|	ВТРезультат.ОплатаПредоплата,
	|	ВТРезультат.ОплатаВстречноеПредоставление,
	|	ВТРезультат.ДокументОснование
	|ИЗ
	|	ВТРезультат КАК ВТРезультат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФискальныеОперации.Дата,
	|	ФискальныеОперации.ФискальныйПризнак,
	|	ФискальныеОперации.ТипРасчета,
	|	ФискальныеОперации.ДанныеXML,
	|	ВременнаяТаблицаИдентификаторФискальнойОперации.ДокументОснование,
	|	ФискальныеОперации.ИдентификаторЗаписи,
	|	ФискальныеОперации.ОплатаНаличные,
	|	ФискальныеОперации.ОплатаЭлектронно,
	|	ФискальныеОперации.ОплатаПостоплата,
	|	ФискальныеОперации.ОплатаПредоплата,
	|	ФискальныеОперации.ОплатаВстречноеПредоставление,
	|	ФискальныеОперации.НомерЧекаККМ,
	|	ФискальныеОперации.Сумма,
	|	ВременнаяТаблицаЧекКоррекцииИдентификаторЗаписи.ЧекКоррекции,
	|	НЕ ВременнаяТаблицаЧекКоррекцииИдентификаторЗаписи.ЧекКоррекции ЕСТЬ NULL КАК ЕстьКорректирующийДокумент,
	|	ВременнаяТаблицаЧекКоррекцииИдентификаторЗаписи.ЧекКоррекции.ПробитЧек,
	|	ВременнаяТаблицаЧекКоррекцииИдентификаторЗаписи.ЧекКоррекции.НомерЧекаККМ,
	|	ВременнаяТаблицаЧекКоррекцииСторноИдентификаторЗаписи.ЧекКоррекции КАК ЧекКоррекцииСторно,
	|	ВременнаяТаблицаЧекКоррекцииСторноИдентификаторЗаписи.ЧекКоррекцииНомерЧекаККМ КАК ЧекКоррекцииСторноНомерЧекаККМ,
	|	ВременнаяТаблицаЧекКоррекцииСторноИдентификаторЗаписи.ЧекКоррекцииПробитЧек КАК ЧекКоррекцииСторноПробитЧек,
	|	ФискальныеОперации.Организация
	|ИЗ
	|	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаЧекКоррекцииИдентификаторЗаписи КАК ВременнаяТаблицаЧекКоррекцииИдентификаторЗаписи
	|		ПО ФискальныеОперации.ИдентификаторЗаписи = ВременнаяТаблицаЧекКоррекцииИдентификаторЗаписи.ИдентификаторЗаписи
	|			И ФискальныеОперации.ИдентификаторЗаписи = ВременнаяТаблицаЧекКоррекцииИдентификаторЗаписи.ИдентификаторЗаписи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаЧекКоррекцииСторноИдентификаторЗаписи КАК ВременнаяТаблицаЧекКоррекцииСторноИдентификаторЗаписи
	|		ПО ФискальныеОперации.ИдентификаторЗаписи = ВременнаяТаблицаЧекКоррекцииСторноИдентификаторЗаписи.ИдентификаторЗаписи,
	|	ВременнаяТаблицаИдентификаторФискальнойОперации КАК ВременнаяТаблицаИдентификаторФискальнойОперации
	|ГДЕ
	|	ФискальныеОперации.ИдентификаторЗаписи В
	|			(ВЫБРАТЬ
	|				ВременнаяТаблицаИдентификаторФискальнойОперации.ИдентификаторЗаписи
	|			ИЗ
	|				ВременнаяТаблицаИдентификаторФискальнойОперации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФискальныеОперации.Дата КАК ДатаРасчетов,
	|	ФискальныеОперации.ИдентификаторЗаписи КАК ИдентификаторЗаписи
	|ИЗ
	|	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	|ГДЕ
	|	ФискальныеОперации.ИдентификаторЗаписи В
	|			(ВЫБРАТЬ
	|				ВременнаяТаблицаИдентификаторФискальнойОперации.ИдентификаторЗаписи
	|			ИЗ
	|				ВременнаяТаблицаИдентификаторФискальнойОперации)");
	
	Запрос.УстановитьПараметр("ДокументОснование"		, ДокументОснование);
	ПакетЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаИдентификаторов			= ПакетЗапроса[7].Выгрузить();
	ТаблицаДанных					= ПакетЗапроса[8].Выгрузить();
	ТаблицаДанныеФискальныхОпераций	= ПакетЗапроса[9].Выгрузить();
	ТаблицаДатаРасчетов 			= ПакетЗапроса[10].Выгрузить();
	
	Результат = Новый Массив;	
	
	Для Каждого СтрокаИдентификатор Из ТаблицаИдентификаторов Цикл
		МассивСтрокТаблицыДанных = ТаблицаДанных.НайтиСтроки(Новый Структура("ИдентификаторЗаписи", СтрокаИдентификатор.ИдентификаторЗаписи));
		
		СтруктураРезультата = Новый Структура;
		СтруктураРезультата.Вставить("ИдентификаторЗаписи"		, СтрокаИдентификатор.ИдентификаторЗаписи);
		
		ТаблицаДанныеФискальныхОперацийВременная = ТаблицаДанныеФискальныхОпераций.НайтиСтроки(Новый Структура("ИдентификаторЗаписи", СтрокаИдентификатор.ИдентификаторЗаписи));
		
		ФискальнаяОперация = Неопределено;
		
		Если ТаблицаДанныеФискальныхОперацийВременная.Количество() > 0 Тогда
			
			Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЧекКоррекции") Тогда
				РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "НеприменениеККТ, ДокументРасчетов"); 			
				Если РеквизитыОснования.НеприменениеККТ Тогда
					ДокументРасчетов = ДокументОснование;
				Иначе
					ДокументРасчетов = РеквизитыОснования.ДокументРасчетов;
				КонецЕсли;    			
			Иначе          			
				ДокументРасчетов = ДокументОснование; 			
			КонецЕсли;    
			
			ФискальнаяОперация = Новый Структура;
			ФискальнаяОперация.Вставить("ФискальныйПризнак");
			ФискальнаяОперация.Вставить("Организация");
			ФискальнаяОперация.Вставить("ДокументОснование");
			ФискальнаяОперация.Вставить("СтруктурнаяЕдиница");
			ФискальнаяОперация.Вставить("ТипРасчета");
			ФискальнаяОперация.Вставить("ДанныеXML");
			ФискальнаяОперация.Вставить("ЕстьКорректирующийДокумент");
			
			ФискальнаяОперация.Вставить("ЧекКоррекции");   	
			ФискальнаяОперация.Вставить("ЧекКоррекцииПробитЧек");   	
			ФискальнаяОперация.Вставить("ЧекКоррекцииНомерЧекаККМ"); 
			
			ФискальнаяОперация.Вставить("ЧекКоррекцииСторно");   	
			ФискальнаяОперация.Вставить("ЧекКоррекцииСторноНомерЧекаККМ");   	
			ФискальнаяОперация.Вставить("ЧекКоррекцииСторноПробитЧек");   	
			
			ФискальнаяОперация.Вставить("ОплатаПредоплата");
			ФискальнаяОперация.Вставить("ОплатаНаличные");
			ФискальнаяОперация.Вставить("ОплатаЭлектронно");
			ФискальнаяОперация.Вставить("ОплатаПостоплата"); 
			ФискальнаяОперация.Вставить("ОплатаВстречноеПредоставление");   
			ФискальнаяОперация.Вставить("Сумма");            
			ФискальнаяОперация.Вставить("НомерЧекаККМ");    
			// ФискальнаяОперация.Вставить("ПолнаяПостоплата");
			
			ЗаполнитьЗначенияСвойств(ФискальнаяОперация, ТаблицаДанныеФискальныхОперацийВременная[0]);
			// ФискальнаяОперация.ПолнаяПостоплата = Истина;
			
			СписокРеквизитов = "";
			Если ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("Организация", ФискальнаяОперация.ДокументОснование.Метаданные()) Тогда
				СписокРеквизитов = СписокРеквизитов + "Организация";
			КонецЕсли;
			Если ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("СтруктурнаяЕдиница", ФискальнаяОперация.ДокументОснование.Метаданные()) Тогда
				СписокРеквизитов = СписокРеквизитов + ?(ЗначениеЗаполнено(СписокРеквизитов), ", ", "") + "СтруктурнаяЕдиница";
			КонецЕсли;        
			
			РеквизитыДокументаОснования = ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(ФискальнаяОперация.ДокументОснование, СписокРеквизитов);
			ЗаполнитьЗначенияСвойств(ФискальнаяОперация, РеквизитыДокументаОснования, СписокРеквизитов);
			       			
			ТаблицаДатаРасчетовВременная = ТаблицаДатаРасчетов.НайтиСтроки(Новый Структура("ИдентификаторЗаписи", СтрокаИдентификатор.ИдентификаторЗаписи));
			ФискальнаяОперация.Вставить("ДатаРасчета"		, ?(ТаблицаДатаРасчетовВременная.Количество() > 0, ТаблицаДатаРасчетовВременная[0].ДатаРасчетов, Неопределено));
			ФискальнаяОперация.Вставить("ДокументРасчетов"	, ДокументРасчетов);
			
			ФискальнаяОперация.Вставить("МассивОснований");
			МассивОснований = Новый Массив;
			Для Каждого ЭлементМ Из МассивСтрокТаблицыДанных Цикл
				СтруктураДанных = Новый Структура;
				СтруктураДанных.Вставить("ДокументОснование", ЭлементМ.ДокументОснование);
				// СтруктураДанных.Вставить("ПолнаяПостоплата"	, ЭлементМ.ПолнаяПостоплата);
				МассивОснований.Добавить(СтруктураДанных);
			КонецЦикла;  			
			ФискальнаяОперация.МассивОснований = МассивОснований;
			
			//// учтенные авансы
			// МассивУчтенныеАвансы = Новый Массив;			
			// МассивСтрокУчтенныеАвансы = ТаблицаУчтенныеАвансы.НайтиСтроки(Новый Структура("ИдентификаторЗаписи", СтрокаИдентификатор.ИдентификаторЗаписи));
			// Для Каждого ЭлементМ Из МассивСтрокУчтенныеАвансы Цикл
			//	СтруктураДанных = Новый Структура("Аванс, ДатаПлатежа, СуммаАванса, ИдентификаторЗаписи");
			//	ЗаполнитьЗначенияСвойств(СтруктураДанных, ЭлементМ);
			//	МассивУчтенныеАвансы.Добавить(СтруктураДанных);	
			// КонецЦикла;
			// ФискальнаяОперация.Вставить("МассивУчтенныеАвансы", МассивУчтенныеАвансы);			
			
		КонецЕсли;    
		
		СтруктураРезультата.Вставить("ДанныеФискальнойОперации", ФискальнаяОперация);
		
		Результат.Добавить(СтруктураРезультата);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция - возвращает массив фискальных операций документа основания.
//
Функция ПолучитьДанныеФискальныхОпераций(ДокументОснование) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФискальныеОперацииДокументы.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	|	ФискальныеОперацииДокументы.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВременнаяТаблицаИдентификаторФискальнойОперации
	|ИЗ
	|	РегистрСведений.ФискальныеОперацииДокументы КАК ФискальныеОперацииДокументы
	|ГДЕ
	|	ФискальныеОперацииДокументы.ДокументОснование = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФискальныеОперацииДокументы.ДокументОснование КАК ДокументОснование,
	|	ФискальныеОперацииДокументы.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	|	ФискальныеОперации.ОплатаНаличные КАК ОплатаНаличные,
	|	ФискальныеОперации.ОплатаЭлектронно КАК ОплатаЭлектронно,
	|	ФискальныеОперации.ОплатаПостоплата КАК ОплатаПостоплата,
	|	ФискальныеОперации.ОплатаПредоплата КАК ОплатаПредоплата,
	|	ФискальныеОперации.ОплатаВстречноеПредоставление КАК ОплатаВстречноеПредоставление,
	|	ФискальныеОперации.ТипРасчета КАК ТипРасчета
	|ПОМЕСТИТЬ ВТДокументыФискальнойОперации
	|ИЗ
	|	РегистрСведений.ФискальныеОперацииДокументы КАК ФискальныеОперацииДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	|		ПО (ФискальныеОперации.ИдентификаторЗаписи = ФискальныеОперацииДокументы.ИдентификаторЗаписи)
	|ГДЕ
	|	ФискальныеОперацииДокументы.ИдентификаторЗаписи В
	|			(ВЫБРАТЬ
	|				ВременнаяТаблицаИдентификаторФискальнойОперации.ИдентификаторЗаписи
	|			ИЗ
	|				ВременнаяТаблицаИдентификаторФискальнойОперации)
	|	И ФискальныеОперации.ИдентификаторЗаписи В
	|			(ВЫБРАТЬ
	|				ВременнаяТаблицаИдентификаторФискальнойОперации.ИдентификаторЗаписи
	|			ИЗ
	|				ВременнаяТаблицаИдентификаторФискальнойОперации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТДокументыФискальнойОперации.ДокументОснование КАК ДокументОснование,
	|	ВТДокументыФискальнойОперации.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	|	ВТДокументыФискальнойОперации.ОплатаНаличные КАК ОплатаНаличные,
	|	ВТДокументыФискальнойОперации.ОплатаЭлектронно КАК ОплатаЭлектронно,
	|	ВТДокументыФискальнойОперации.ОплатаПостоплата КАК ОплатаПостоплата,
	|	ВТДокументыФискальнойОперации.ОплатаПредоплата КАК ОплатаПредоплата,
	|	ВТДокументыФискальнойОперации.ТипРасчета КАК ТипРасчета,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(&ДокументОснование) = ТИП(Документ.Реализация)
	|			ТОГДА ВТДокументыФискальнойОперации.ОплатаПостоплата <> 0
	|					И ВТДокументыФискальнойОперации.ОплатаНаличные = 0
	|					И ВТДокументыФискальнойОперации.ОплатаЭлектронно = 0
	|					И ВТДокументыФискальнойОперации.ОплатаПредоплата = 0
	|					И ВТДокументыФискальнойОперации.ОплатаПостоплата = &ДокументОснованиеСумма
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПолнаяПостоплата
	|ПОМЕСТИТЬ ВТРезультатПредварительно
	|ИЗ
	|	ВТДокументыФискальнойОперации КАК ВТДокументыФискальнойОперации
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(&ДокументОснование) = ТИП(Документ.ПоступлениеДенежныхСредств)
	|					ИЛИ ТИПЗНАЧЕНИЯ(&ДокументОснование) = ТИП(Документ.СписаниеДенежныхСредств)
	|				ТОГДА ВЫБОР
	|						КОГДА ВТДокументыФискальнойОперации.ДокументОснование ССЫЛКА Документ.ВозвратОтПокупателя
	|							ТОГДА ВТДокументыФискальнойОперации.ОплатаПредоплата <> 0
	|						КОГДА ВТДокументыФискальнойОперации.ДокументОснование ССЫЛКА Документ.Реализация
	|							ТОГДА ВТДокументыФискальнойОперации.ОплатаПостоплата <> 0
	|									И ВТДокументыФискальнойОперации.ОплатаНаличные = 0
	|									И ВТДокументыФискальнойОперации.ОплатаЭлектронно = 0
	|									И ВТДокументыФискальнойОперации.ОплатаПредоплата = 0
	|									И ВТДокументыФискальнойОперации.ОплатаПостоплата = &ДокументОснованиеСумма
	|						КОГДА ВТДокументыФискальнойОперации.ДокументОснование ССЫЛКА Документ.Прием
	|							ТОГДА ВТДокументыФискальнойОперации.ОплатаПредоплата <> 0
	|									И ВТДокументыФискальнойОперации.ОплатаНаличные = 0
	|									И ВТДокументыФискальнойОперации.ОплатаЭлектронно = 0
	|									И ВТДокументыФискальнойОперации.ОплатаПредоплата = 0
	|									И ВТДокументыФискальнойОперации.ОплатаПостоплата = &ДокументОснованиеСумма
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|			КОГДА ТИПЗНАЧЕНИЯ(&ДокументОснование) = ТИП(Документ.ВозвратОтПокупателя)
	|				ТОГДА ВТДокументыФискальнойОперации.ОплатаПредоплата <> 0
	|			КОГДА ТИПЗНАЧЕНИЯ(&ДокументОснование) = ТИП(Документ.Реализация)
	|				ТОГДА ВТДокументыФискальнойОперации.ОплатаПостоплата <> 0
	|							И ВТДокументыФискальнойОперации.ОплатаНаличные = 0
	|							И ВТДокументыФискальнойОперации.ОплатаЭлектронно = 0
	|							И ВТДокументыФискальнойОперации.ОплатаПредоплата = 0
	|							И ВТДокументыФискальнойОперации.ОплатаПостоплата = &ДокументОснованиеСумма
	|						ИЛИ ВТДокументыФискальнойОперации.ОплатаПредоплата <> 0
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(РеализацияУчтенныеАвансы.ДокументАванса, НЕОПРЕДЕЛЕНО) КАК Аванс,
	|	РеализацияУчтенныеАвансы.СуммаАванса КАК СуммаАванса,
	|	РеализацияУчтенныеАвансы.ДатаПлатежа КАК ДатаПлатежа,
	|	РеализацияУчтенныеАвансы.Ссылка КАК Ссылка,
	|	РеализацияУчтенныеАвансы.ИдентификаторФискальнойЗаписи КАК ИдентификаторЗаписи
	|ПОМЕСТИТЬ ВременнаяТаблицаУчтенныеАвансы
	|ИЗ
	|	Документ.Прием.УчтенныеАвансы КАК РеализацияУчтенныеАвансы
	|ГДЕ
	|	РеализацияУчтенныеАвансы.Ссылка.Проведен = ИСТИНА
	|	И РеализацияУчтенныеАвансы.ИдентификаторФискальнойЗаписи В
	|			(ВЫБРАТЬ
	|				ВТРезультатПредварительно.ИдентификаторЗаписи
	|			ИЗ
	|				ВТРезультатПредварительно)
	|	И РеализацияУчтенныеАвансы.ИдентификаторФискальнойЗаписи <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВозвратОтПокупателяВозвращенныеАвансы.ДокументАванса, НЕОПРЕДЕЛЕНО),
	|	ВозвратОтПокупателяВозвращенныеАвансы.СуммаАванса,
	|	ВозвратОтПокупателяВозвращенныеАвансы.ДатаПлатежа,
	|	ВозвратОтПокупателяВозвращенныеАвансы.Ссылка,
	|	ВозвратОтПокупателяВозвращенныеАвансы.ИдентификаторФискальнойЗаписи
	|ИЗ
	|	Документ.ВозвратОтПокупателя.УчтенныеАвансы КАК ВозвратОтПокупателяВозвращенныеАвансы
	|ГДЕ
	|	ВозвратОтПокупателяВозвращенныеАвансы.Ссылка.Проведен = ИСТИНА
	|	И ВозвратОтПокупателяВозвращенныеАвансы.ИдентификаторФискальнойЗаписи В
	|			(ВЫБРАТЬ
	|				ВТРезультатПредварительно.ИдентификаторЗаписи
	|			ИЗ
	|				ВТРезультатПредварительно)
	|	И ВозвратОтПокупателяВозвращенныеАвансы.ИдентификаторФискальнойЗаписи <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТРезультатПредварительно.ДокументОснование КАК ДокументОснование,
	|	ВТРезультатПредварительно.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	|	ВТРезультатПредварительно.ТипРасчета КАК ТипРасчета,
	|	ЕСТЬNULL(ВременнаяТаблицаУчтенныеАвансы.Аванс, НЕОПРЕДЕЛЕНО) КАК Аванс,
	|	ЕСТЬNULL(ВременнаяТаблицаУчтенныеАвансы.СуммаАванса, 0) КАК СуммаАванса,
	|	ЕСТЬNULL(ВременнаяТаблицаУчтенныеАвансы.ДатаПлатежа, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПлатежа,
	|	ВТРезультатПредварительно.ОплатаНаличные КАК ОплатаНаличные,
	|	ВТРезультатПредварительно.ОплатаЭлектронно КАК ОплатаЭлектронно,
	|	ВТРезультатПредварительно.ОплатаПостоплата КАК ОплатаПостоплата,
	|	ВТРезультатПредварительно.ОплатаПредоплата КАК ОплатаПредоплата,
	|	ВТРезультатПредварительно.ПолнаяПостоплата КАК ПолнаяПостоплата
	|ПОМЕСТИТЬ ВТРезультатСУчетомАвансов
	|ИЗ
	|	ВТРезультатПредварительно КАК ВТРезультатПредварительно
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаУчтенныеАвансы КАК ВременнаяТаблицаУчтенныеАвансы
	|		ПО (ВЫБОР
	|				КОГДА ВТРезультатПредварительно.ДокументОснование ССЫЛКА Документ.ВозвратОтПокупателя
	|						ИЛИ ВТРезультатПредварительно.ДокументОснование ССЫЛКА Документ.Прием
	|					ТОГДА ВременнаяТаблицаУчтенныеАвансы.ИдентификаторЗаписи = ВТРезультатПредварительно.ИдентификаторЗаписи
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТРезультатПредварительно.ДокументОснование ССЫЛКА Документ.Прием
	|					ИЛИ ВТРезультатПредварительно.ДокументОснование ССЫЛКА Документ.ВозвратОтПокупателя
	|				ТОГДА ВТРезультатПредварительно.ИдентификаторЗаписи В
	|							(ВЫБРАТЬ
	|								ВременнаяТаблицаУчтенныеАвансы.ИдентификаторЗаписи
	|							ИЗ
	|								ВременнаяТаблицаУчтенныеАвансы)
	|						ИЛИ ИСТИНА
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧекКоррекцииТаблицаОснований.Ссылка КАК ЧекКоррекции,
	|	ВТРезультатСУчетомАвансов.ДокументОснование КАК ДокументОснование,
	|	ВТРезультатСУчетомАвансов.ТипРасчета КАК ТипРасчета,
	|	ВТРезультатСУчетомАвансов.Аванс КАК Аванс,
	|	ВТРезультатСУчетомАвансов.СуммаАванса КАК СуммаАванса,
	|	ВТРезультатСУчетомАвансов.ДатаПлатежа КАК ДатаПлатежа,
	|	ВТРезультатСУчетомАвансов.ИдентификаторЗаписи КАК ИдентификаторЗаписи
	|ПОМЕСТИТЬ ВременнаяТаблицаЧекКоррекции
	|ИЗ
	|	ВТРезультатСУчетомАвансов КАК ВТРезультатСУчетомАвансов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекКоррекции.ТаблицаОснований КАК ЧекКоррекцииТаблицаОснований
	|		ПО ВТРезультатСУчетомАвансов.ТипРасчета = ЧекКоррекцииТаблицаОснований.Ссылка.ТипРасчета
	|			И (ЧекКоррекцииТаблицаОснований.Ссылка.Проведен = ИСТИНА)
	|			И (ЧекКоррекцииТаблицаОснований.Ссылка.ПробитЧек = ИСТИНА)
	|			И ВТРезультатСУчетомАвансов.ДокументОснование = ЧекКоррекцииТаблицаОснований.ДокументОснование
	|			И ВТРезультатСУчетомАвансов.Аванс = ЧекКоррекцииТаблицаОснований.Аванс
	|			И (ВЫБОР
	|				КОГДА ВТРезультатСУчетомАвансов.ДокументОснование ССЫЛКА Документ.ВозвратОтПокупателя
	|					ТОГДА ВТРезультатСУчетомАвансов.ИдентификаторЗаписи = ЧекКоррекцииТаблицаОснований.ИдентификаторФискальнойЗаписи
	|				КОГДА ВТРезультатСУчетомАвансов.ДокументОснование ССЫЛКА Документ.Прием
	|					ТОГДА ВТРезультатСУчетомАвансов.ИдентификаторЗаписи = ЧекКоррекцииТаблицаОснований.ИдентификаторФискальнойЗаписи
	|				КОГДА ВТРезультатСУчетомАвансов.ДокументОснование ССЫЛКА Документ.Реализация
	|					ТОГДА ВТРезультатСУчетомАвансов.ПолнаяПостоплата = ИСТИНА
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧекКоррекцииТаблицаОснований.Ссылка КАК ЧекКоррекции,
	|	ВТРезультатСУчетомАвансов.ДокументОснование КАК ДокументОснование,
	|	ВТРезультатСУчетомАвансов.ТипРасчета КАК ТипРасчета,
	|	ВТРезультатСУчетомАвансов.Аванс КАК Аванс,
	|	ВТРезультатСУчетомАвансов.СуммаАванса КАК СуммаАванса,
	|	ВТРезультатСУчетомАвансов.ДатаПлатежа КАК ДатаПлатежа,
	|	ВТРезультатСУчетомАвансов.ИдентификаторЗаписи КАК ИдентификаторЗаписи
	|ПОМЕСТИТЬ ВременнаяТаблицаЧекКоррекцииСторно
	|ИЗ
	|	ВТРезультатСУчетомАвансов КАК ВТРезультатСУчетомАвансов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекКоррекции.ТаблицаОснований КАК ЧекКоррекцииТаблицаОснований
	|		ПО (ЧекКоррекцииТаблицаОснований.Ссылка.Проведен = ИСТИНА)
	|			И (ЧекКоррекцииТаблицаОснований.Ссылка.ПробитЧек = ИСТИНА)
	|			И ВТРезультатСУчетомАвансов.ДокументОснование = ЧекКоррекцииТаблицаОснований.ДокументОснование
	|			И ВТРезультатСУчетомАвансов.Аванс = ЧекКоррекцииТаблицаОснований.Аванс
	|			И (ВЫБОР
	|				КОГДА ВТРезультатСУчетомАвансов.ДокументОснование ССЫЛКА Документ.ВозвратОтПокупателя
	|					ТОГДА ВТРезультатСУчетомАвансов.ИдентификаторЗаписи = ЧекКоррекцииТаблицаОснований.ИдентификаторФискальнойЗаписи
	|				КОГДА ВТРезультатСУчетомАвансов.ДокументОснование ССЫЛКА Документ.Прием
	|					ТОГДА ВТРезультатСУчетомАвансов.ИдентификаторЗаписи = ЧекКоррекцииТаблицаОснований.ИдентификаторФискальнойЗаписи
	|				КОГДА ВТРезультатСУчетомАвансов.ДокументОснование ССЫЛКА Документ.Реализация
	|					ТОГДА ВТРезультатСУчетомАвансов.ПолнаяПостоплата = ИСТИНА
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|ГДЕ
	|	ЧекКоррекцииТаблицаОснований.Ссылка.ЭтоСторно = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВременнаяТаблицаЧекКоррекции.ЧекКоррекции КАК ЧекКоррекции,
	|	ВТРезультатПредварительно.ДокументОснование КАК ДокументОснование,
	|	ВТРезультатПредварительно.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	|	ВТРезультатПредварительно.ОплатаНаличные КАК ОплатаНаличные,
	|	ВТРезультатПредварительно.ОплатаЭлектронно КАК ОплатаЭлектронно,
	|	ВТРезультатПредварительно.ОплатаПостоплата КАК ОплатаПостоплата,
	|	ВТРезультатПредварительно.ОплатаПредоплата КАК ОплатаПредоплата,
	|	ВТРезультатПредварительно.ПолнаяПостоплата КАК ПолнаяПостоплата
	|ПОМЕСТИТЬ ВТРезультат
	|ИЗ
	|	ВТРезультатПредварительно КАК ВТРезультатПредварительно
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаЧекКоррекции КАК ВременнаяТаблицаЧекКоррекции
	|		ПО ВТРезультатПредварительно.ДокументОснование = ВременнаяТаблицаЧекКоррекции.ДокументОснование
	|			И (ВЫБОР
	|				КОГДА ВТРезультатПредварительно.ДокументОснование ССЫЛКА Документ.Прием
	|						ИЛИ ВТРезультатПредварительно.ДокументОснование ССЫЛКА Документ.ВозвратОтПокупателя
	|					ТОГДА ВТРезультатПредварительно.ИдентификаторЗаписи = ВременнаяТаблицаЧекКоррекции.ИдентификаторЗаписи
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТРезультатПредварительно.ДокументОснование ССЫЛКА Документ.ВозвратОтПокупателя
	|				ТОГДА ВТРезультатПредварительно.ИдентификаторЗаписи В
	|							(ВЫБРАТЬ
	|								ВременнаяТаблицаУчтенныеАвансы.ИдентификаторЗаписи
	|							ИЗ
	|								ВременнаяТаблицаУчтенныеАвансы)
	|						ИЛИ ИСТИНА
	|			КОГДА ВТРезультатПредварительно.ДокументОснование ССЫЛКА Документ.Прием
	|				ТОГДА ВТРезультатПредварительно.ИдентификаторЗаписи В
	|						(ВЫБРАТЬ
	|							ВременнаяТаблицаУчтенныеАвансы.ИдентификаторЗаписи
	|						ИЗ
	|							ВременнаяТаблицаУчтенныеАвансы)
	|			КОГДА ВТРезультатПредварительно.ДокументОснование ССЫЛКА Документ.Реализация
	|				ТОГДА ВТРезультатПредварительно.ПолнаяПостоплата = ИСТИНА
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВременнаяТаблицаЧекКоррекции.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	|	ВременнаяТаблицаЧекКоррекции.ЧекКоррекции КАК ЧекКоррекции,
	|	ВременнаяТаблицаЧекКоррекции.ЧекКоррекции.НомерЧекаККМ КАК ЧекКоррекцииНомерЧекаККМ,
	|	ВременнаяТаблицаЧекКоррекции.ЧекКоррекции.ПробитЧек КАК ЧекКоррекцииПробитЧек
	|ПОМЕСТИТЬ ВременнаяТаблицаЧекКоррекцииИдентификаторЗаписи
	|ИЗ
	|	ВременнаяТаблицаЧекКоррекции КАК ВременнаяТаблицаЧекКоррекции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВременнаяТаблицаЧекКоррекцииСторно.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	|	ВременнаяТаблицаЧекКоррекцииСторно.ЧекКоррекции КАК ЧекКоррекции,
	|	ВременнаяТаблицаЧекКоррекцииСторно.ЧекКоррекции.НомерЧекаККМ КАК ЧекКоррекцииНомерЧекаККМ,
	|	ВременнаяТаблицаЧекКоррекцииСторно.ЧекКоррекции.ПробитЧек КАК ЧекКоррекцииПробитЧек
	|ПОМЕСТИТЬ ВременнаяТаблицаЧекКоррекцииСторноИдентификаторЗаписи
	|ИЗ
	|	ВременнаяТаблицаЧекКоррекцииСторно КАК ВременнаяТаблицаЧекКоррекцииСторно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТРезультат.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	|	ВТРезультат.ПолнаяПостоплата КАК ПолнаяПостоплата
	|ИЗ
	|	ВТРезультат КАК ВТРезультат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТРезультат.ЧекКоррекции КАК ЧекКоррекции,
	|	ВТРезультат.ДокументОснование КАК ДокументОснование,
	|	ВТРезультат.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	|	ВТРезультат.ОплатаНаличные КАК ОплатаНаличные,
	|	ВТРезультат.ОплатаЭлектронно КАК ОплатаЭлектронно,
	|	ВТРезультат.ОплатаПостоплата КАК ОплатаПостоплата,
	|	ВТРезультат.ОплатаПредоплата КАК ОплатаПредоплата,
	|	ВТРезультат.ПолнаяПостоплата КАК ПолнаяПостоплата
	|ИЗ
	|	ВТРезультат КАК ВТРезультат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФискальныеОперации.Дата КАК Дата,
	|	ФискальныеОперации.ФискальныйПризнак КАК ФискальныйПризнак,
	|	ФискальныеОперации.ТипРасчета КАК ТипРасчета,
	|	ФискальныеОперации.ДанныеXML КАК ДанныеXML,
	|	ВременнаяТаблицаИдентификаторФискальнойОперации.ДокументОснование КАК ДокументОснование,
	|	ФискальныеОперации.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	|	ФискальныеОперации.ОплатаНаличные КАК ОплатаНаличные,
	|	ФискальныеОперации.ОплатаЭлектронно КАК ОплатаЭлектронно,
	|	ФискальныеОперации.ОплатаПостоплата КАК ОплатаПостоплата,
	|	ФискальныеОперации.ОплатаПредоплата КАК ОплатаПредоплата,
	|	ФискальныеОперации.ОплатаВстречноеПредоставление КАК ОплатаВстречноеПредоставление,
	|	ФискальныеОперации.НомерЧекаККМ КАК НомерЧекаККМ,
	|	ФискальныеОперации.Сумма КАК Сумма,
	|	ВременнаяТаблицаЧекКоррекцииИдентификаторЗаписи.ЧекКоррекции КАК ЧекКоррекции,
	|	НЕ ВременнаяТаблицаЧекКоррекцииИдентификаторЗаписи.ЧекКоррекции ЕСТЬ NULL КАК ЕстьКорректирующийДокумент,
	|	ВременнаяТаблицаЧекКоррекцииИдентификаторЗаписи.ЧекКоррекции.ПробитЧек КАК ЧекКоррекцииПробитЧек,
	|	ВременнаяТаблицаЧекКоррекцииИдентификаторЗаписи.ЧекКоррекции.НомерЧекаККМ КАК ЧекКоррекцииНомерЧекаККМ,
	|	ВременнаяТаблицаЧекКоррекцииСторноИдентификаторЗаписи.ЧекКоррекции КАК ЧекКоррекцииСторно,
	|	ВременнаяТаблицаЧекКоррекцииСторноИдентификаторЗаписи.ЧекКоррекцииНомерЧекаККМ КАК ЧекКоррекцииСторноНомерЧекаККМ,
	|	ВременнаяТаблицаЧекКоррекцииСторноИдентификаторЗаписи.ЧекКоррекцииПробитЧек КАК ЧекКоррекцииСторноПробитЧек
	|ИЗ
	|	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаИдентификаторФискальнойОперации КАК ВременнаяТаблицаИдентификаторФискальнойОперации
	|		ПО ФискальныеОперации.ИдентификаторЗаписи = ВременнаяТаблицаИдентификаторФискальнойОперации.ИдентификаторЗаписи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаЧекКоррекцииИдентификаторЗаписи КАК ВременнаяТаблицаЧекКоррекцииИдентификаторЗаписи
	|		ПО ФискальныеОперации.ИдентификаторЗаписи = ВременнаяТаблицаЧекКоррекцииИдентификаторЗаписи.ИдентификаторЗаписи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаЧекКоррекцииСторноИдентификаторЗаписи КАК ВременнаяТаблицаЧекКоррекцииСторноИдентификаторЗаписи
	|		ПО ФискальныеОперации.ИдентификаторЗаписи = ВременнаяТаблицаЧекКоррекцииСторноИдентификаторЗаписи.ИдентификаторЗаписи
	|ГДЕ
	|	ФискальныеОперации.ИдентификаторЗаписи В
	|			(ВЫБРАТЬ
	|				ВременнаяТаблицаИдентификаторФискальнойОперации.ИдентификаторЗаписи
	|			ИЗ
	|				ВременнаяТаблицаИдентификаторФискальнойОперации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФискальныеОперации.Дата КАК ДатаРасчетов,
	|	ФискальныеОперации.ИдентификаторЗаписи КАК ИдентификаторЗаписи
	|ИЗ
	|	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	|ГДЕ
	|	ФискальныеОперации.ИдентификаторЗаписи В
	|			(ВЫБРАТЬ
	|				ВременнаяТаблицаИдентификаторФискальнойОперации.ИдентификаторЗаписи
	|			ИЗ
	|				ВременнаяТаблицаИдентификаторФискальнойОперации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВременнаяТаблицаУчтенныеАвансы.Аванс КАК Аванс,
	|	ВременнаяТаблицаУчтенныеАвансы.СуммаАванса КАК СуммаАванса,
	|	ВременнаяТаблицаУчтенныеАвансы.ДатаПлатежа КАК ДатаПлатежа,
	|	ВременнаяТаблицаУчтенныеАвансы.Ссылка КАК Ссылка,
	|	ВременнаяТаблицаУчтенныеАвансы.ИдентификаторЗаписи КАК ИдентификаторЗаписи
	|ИЗ
	|	ВременнаяТаблицаУчтенныеАвансы КАК ВременнаяТаблицаУчтенныеАвансы");
	
	Запрос.УстановитьПараметр("ДокументОснование"		, ДокументОснование);
	Запрос.УстановитьПараметр("ДокументОснованиеСумма"	, ?(ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Реализация"),
																ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ДокументОснование, "СуммаДокумента"), 0));
	ПакетЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаИдентификаторов			= ПакетЗапроса[8 + 2].Выгрузить();
	ТаблицаДанных					= ПакетЗапроса[9 + 2].Выгрузить();
	ТаблицаДанныеФискальныхОпераций	= ПакетЗапроса[10 + 2].Выгрузить();
	ТаблицаДатаРасчетов 			= ПакетЗапроса[11 + 2].Выгрузить();
	ТаблицаУчтенныеАвансы 			= ПакетЗапроса[12 + 2].Выгрузить();
	
	Результат = Новый Массив;	
	
	Для Каждого СтрокаИдентификатор Из ТаблицаИдентификаторов Цикл
		МассивСтрокТаблицыДанных = ТаблицаДанных.НайтиСтроки(Новый Структура("ИдентификаторЗаписи", СтрокаИдентификатор.ИдентификаторЗаписи));
		
		СтруктураРезультата = Новый Структура;
		СтруктураРезультата.Вставить("ИдентификаторЗаписи"		, СтрокаИдентификатор.ИдентификаторЗаписи);
		
		ТаблицаДанныеФискальныхОперацийВременная = ТаблицаДанныеФискальныхОпераций.НайтиСтроки(Новый Структура("ИдентификаторЗаписи", СтрокаИдентификатор.ИдентификаторЗаписи));
		
		ФискальнаяОперация = Неопределено;
		
		Если ТаблицаДанныеФискальныхОперацийВременная.Количество() > 0 Тогда
			
			Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЧекКоррекции") Тогда
				РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "НеприменениеККТ, ДокументРасчетов"); 			
				Если РеквизитыОснования.НеприменениеККТ Тогда
					ДокументРасчетов = ДокументОснование;
				Иначе
					ДокументРасчетов = РеквизитыОснования.ДокументРасчетов;
				КонецЕсли;    			
			Иначе          			
				ДокументРасчетов = ДокументОснование; 			
			КонецЕсли;    
			
			ФискальнаяОперация = Новый Структура;
			ФискальнаяОперация.Вставить("ФискальныйПризнак");
			ФискальнаяОперация.Вставить("Организация");
			ФискальнаяОперация.Вставить("ДокументОснование");
			ФискальнаяОперация.Вставить("СтруктурнаяЕдиница");
			ФискальнаяОперация.Вставить("ТипРасчета");
			ФискальнаяОперация.Вставить("ДанныеXML");
			ФискальнаяОперация.Вставить("ЕстьКорректирующийДокумент");
			
			ФискальнаяОперация.Вставить("ЧекКоррекции");   	
			ФискальнаяОперация.Вставить("ЧекКоррекцииПробитЧек");   	
			ФискальнаяОперация.Вставить("ЧекКоррекцииНомерЧекаККМ"); 
			
			ФискальнаяОперация.Вставить("ЧекКоррекцииСторно");   	
			ФискальнаяОперация.Вставить("ЧекКоррекцииСторноНомерЧекаККМ");   	
			ФискальнаяОперация.Вставить("ЧекКоррекцииСторноПробитЧек");   	
			
			ФискальнаяОперация.Вставить("ОплатаПредоплата");
			ФискальнаяОперация.Вставить("ОплатаНаличные");
			ФискальнаяОперация.Вставить("ОплатаЭлектронно");
			ФискальнаяОперация.Вставить("ОплатаПостоплата"); 
			ФискальнаяОперация.Вставить("ОплатаВстречноеПредоставление");   
			ФискальнаяОперация.Вставить("Сумма");            
			ФискальнаяОперация.Вставить("НомерЧекаККМ");    
			ФискальнаяОперация.Вставить("ПолнаяПостоплата");
			
			ЗаполнитьЗначенияСвойств(ФискальнаяОперация, ТаблицаДанныеФискальныхОперацийВременная[0]);
			ФискальнаяОперация.ПолнаяПостоплата = Истина;
			
			РеквизитыДокументаОснования = ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(ФискальнаяОперация.ДокументОснование, "СтруктурнаяЕдиница");
			РеквизитыДокументаОснования.Вставить("Организация", РеквизитыДокументаОснования.СтруктурнаяЕдиница.Организация);
			ЗаполнитьЗначенияСвойств(ФискальнаяОперация, РеквизитыДокументаОснования);
			
			ТаблицаДатаРасчетовВременная = ТаблицаДатаРасчетов.НайтиСтроки(Новый Структура("ИдентификаторЗаписи", СтрокаИдентификатор.ИдентификаторЗаписи));
			ФискальнаяОперация.Вставить("ДатаРасчета"		, ?(ТаблицаДатаРасчетовВременная.Количество() > 0, ТаблицаДатаРасчетовВременная[0].ДатаРасчетов, Неопределено));
			ФискальнаяОперация.Вставить("ДокументРасчетов"	, ДокументРасчетов);
			
			ФискальнаяОперация.Вставить("МассивОснований");
			МассивОснований = Новый Массив;
			Для Каждого ЭлементМ Из МассивСтрокТаблицыДанных Цикл
				СтруктураДанных = Новый Структура;
				СтруктураДанных.Вставить("ДокументОснование", ЭлементМ.ДокументОснование);
				СтруктураДанных.Вставить("ПолнаяПостоплата"	, ЭлементМ.ПолнаяПостоплата);
				МассивОснований.Добавить(СтруктураДанных);
			КонецЦикла;  			
			ФискальнаяОперация.МассивОснований = МассивОснований;
			
			// учтенные авансы
			МассивУчтенныеАвансы = Новый Массив;			
			МассивСтрокУчтенныеАвансы = ТаблицаУчтенныеАвансы.НайтиСтроки(Новый Структура("ИдентификаторЗаписи", СтрокаИдентификатор.ИдентификаторЗаписи));
			Для Каждого ЭлементМ Из МассивСтрокУчтенныеАвансы Цикл
				СтруктураДанных = Новый Структура("Аванс, ДатаПлатежа, СуммаАванса, ИдентификаторЗаписи");
				ЗаполнитьЗначенияСвойств(СтруктураДанных, ЭлементМ);
				МассивУчтенныеАвансы.Добавить(СтруктураДанных);	
			КонецЦикла;
			ФискальнаяОперация.Вставить("МассивУчтенныеАвансы", МассивУчтенныеАвансы);			
			
		КонецЕсли;    
		
		СтруктураРезультата.Вставить("ДанныеФискальнойОперации", ФискальнаяОперация);
		
		Результат.Добавить(СтруктураРезультата);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция создает чек коррекции сторно.
//
Функция ЧекКоррекцииСторно(Контекст)
	
	Результат = Новый Структура("ЧекКоррекцииСторно, ЧекПроведен");
	
	ЧекОбъект 	= Документы.ЧекКоррекции.СоздатьДокумент();
	ЧекПроведен = Ложь;
	
	ОбщиеПараметры = МенеджерОборудованияВызовСервера.ЗагрузитьДанныеФискализацииИзXML(Контекст.ДанныеXMLКорректируемогоЧека);
	
	ЗаполнитьЗначенияСвойств(ЧекОбъект, Контекст, "Дата,
												 | ДатаКоррекции,
												 | ДокументРасчетов, 
												 | ДополнительныйРеквизит,
												 | Касса,
												 | НомерПредписания,
												 | ОписаниеКоррекции,
												 | Организация,
												 | СтруктурнаяЕдиница,
												 | АвторДокумента,
												 | ТипКоррекции,
												 | Комментарий,
												 | Кассир,
												 | КассирИНН");
	
	ЗаполнитьЗначенияСвойств(ЧекОбъект, ОбщиеПараметры, "
													   | ПокупательEmail,
													   | ПокупательНомер,
													   | ПризнакАгента,
													   | СистемаНалогообложения");
	
	Для Каждого СтрокаТЗ Из Контекст.ТаблицаОснований Цикл
		ЗаполнитьЗначенияСвойств(ЧекОбъект.ТаблицаОснований.Добавить(), СтрокаТЗ);
	КонецЦикла;

	ЧекОбъект.ЭтоСторно		= Истина;
	ЧекОбъект.Покупатель 	= Контекст.Контрагент;
	Если ТипЗнч(Контекст.Контрагент) = Тип("СправочникСсылка.Контрагенты")
		И ЗначениеЗаполнено(Контекст.Контрагент) Тогда
		ЧекОбъект.ПокупательИНН = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Контекст.Контрагент, "ИНН");
	КонецЕсли;
	ЧекОбъект.ТипРасчета 	= ТипРасчетаСторно(ОбщиеПараметры.ТипРасчета);
	Если ЧекОбъект.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств Или 
		ЧекОбъект.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств Тогда
		ЧекОбъект.ВидОперации = "Возврат"; // Перечисления.ВидыОперацийЧекККМ.Возврат;
	Иначе
		ЧекОбъект.ВидОперации = "Продажа"; // Перечисления.ВидыОперацийЧекККМ.Продажа;
	КонецЕсли;
	
	// Основание = Контекст.ДокументОснование;
	
	ЗаполнитьПозицииЧекаПоОбщимПараметрам(ЧекОбъект, ОбщиеПараметры.ПозицииЧека);
	
	// Оплаты
	Для Каждого СтрокаОплаты Из ОбщиеПараметры.ТаблицаОплат Цикл
		ЗаполнитьЗначенияСвойств(ЧекОбъект.Оплата.Добавить(), СтрокаОплаты); 
	КонецЦикла;
	
	// Запись чека
	Попытка
		ЧекОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		СтрокаОшибки = НСтр("ru = 'Не удалось записать чек коррекции сторно по причине:'") + Символы.ПС + ОписаниеОшибки;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаОшибки);
		Возврат Неопределено;
	КонецПопытки;
	
	// Потом чек проводится
	Попытка
		Если ЧекОбъект.ПроверитьЗаполнение() Тогда
			ЧекОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			ЧекПроведен = Истина;
		Иначе
			СтрокаОшибки = НСтр("ru = 'Не удалось провести чек коррекции сторно по причине проверки заполнения'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаОшибки);
		КонецЕсли;
	Исключение
		СтрокаОшибки = НСтр("ru = 'Не удалось провести чек коррекции сторно по причине:'") + Символы.ПС + ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаОшибки);
	КонецПопытки;
	
	Результат.ЧекКоррекцииСторно 	= ЧекОбъект.Ссылка;
	Результат.ЧекПроведен 			= ЧекПроведен;
	
	Возврат Результат;
	
КонецФункции

// Функция создает чек коррекции.
//
Функция ЧекКоррекции(Контекст)
	
	Результат = Новый Структура("ЧекСкорректированный, ЧекПроведен");
	
	ЧекОбъект 	= Документы.ЧекКоррекции.СоздатьДокумент();
	ЧекПроведен = Ложь;
	
	ЗаполнитьЗначенияСвойств(ЧекОбъект, Контекст);
		
	ЧекОбъект.Покупатель 	= Контекст.Контрагент;
	ЧекОбъект.ПокупательИНН = Контекст.КонтрагентИНН;
	
	Если ЧекОбъект.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств
		ИЛИ ЧекОбъект.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств Тогда
		ЧекОбъект.ВидОперации = "Возврат";// Перечисления.ВидыОперацийЧекККМ.Возврат;
	Иначе
		ЧекОбъект.ВидОперации = "Продажа";// Перечисления.ВидыОперацийЧекККМ.Продажа;
	КонецЕсли;
	
	// основания
	Для Каждого СтрокаТЗ Из Контекст.ТаблицаОснований Цикл
		ЗаполнитьЗначенияСвойств(ЧекОбъект.ТаблицаОснований.Добавить(), СтрокаТЗ);
	КонецЦикла;
	
	// Позиции чека
	Для Каждого ПозицияЧека Из Контекст.ПозицииЧека Цикл  		
		ЗаполнитьЗначенияСвойств(ЧекОбъект.ПозицииЧека.Добавить(), ПозицияЧека);		
	КонецЦикла;
		
	// Оплаты
	Для Каждого СтрокаОплаты Из Контекст.Оплата Цикл      		
		ЗаполнитьЗначенияСвойств(ЧекОбъект.Оплата.Добавить(), СтрокаОплаты);   		
	КонецЦикла;
	
	// Запись чека
	Попытка
		ЧекОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		ОписаниеОшибки	= ОписаниеОшибки();
		СтрокаОшибки	= НСтр("ru = 'Не удалось записать чек коррекции сторно по причине:'") + Символы.ПС + ОписаниеОшибки;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаОшибки);
		Возврат Неопределено;
	КонецПопытки;
	
	// Потом чек проводится
	Попытка
		Если ЧекОбъект.ПроверитьЗаполнение() Тогда
			ЧекОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			ЧекПроведен = Истина;
		Иначе
			СтрокаОшибки = НСтр("ru = 'Не удалось провести чек коррекции по причине проверки заполнения'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаОшибки);
		КонецЕсли;
	Исключение
		СтрокаОшибки = НСтр("ru = 'Не удалось провести чек коррекции по причине:'") + Символы.ПС + ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаОшибки);
	КонецПопытки;
	
	Результат.ЧекСкорректированный 	= ЧекОбъект.Ссылка;
	Результат.ЧекПроведен 			= ЧекПроведен;
	
	Возврат Результат;
	
КонецФункции

// Функция - возвращает тип расчета сторно.
//
Функция ТипРасчетаСторно(ТипРасчета)
	
	Если ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств Тогда
		Возврат Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств
	ИначеЕсли ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств Тогда
		Возврат Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств
	ИначеЕсли ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств Тогда
		Возврат Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств
	ИначеЕсли ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств Тогда
		Возврат Перечисления.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств
	КонецЕсли;
	
КонецФункции

// Процедура заполняет позиции чека согласно общим параметрам.
//
Процедура ЗаполнитьПозицииЧекаПоОбщимПараметрам(ЧекОбъект, ОбщиеПараметрыПозицииЧека)
	
	Для Каждого СтрокаПозицииЧека Из ОбщиеПараметрыПозицииЧека Цикл    		
		НоваяСтрока = ЧекОбъект.ПозицииЧека.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПозицииЧека);
		
		НоваяСтрока.ДанныеПоставщикаИНН				= СтрокаПозицииЧека.ДанныеПоставщика.ИНН;
		НоваяСтрока.ДанныеПоставщикаНаименование	= СтрокаПозицииЧека.ДанныеПоставщика.Наименование;
		НоваяСтрока.ДанныеПоставщикаТелефон			= СтрокаПозицииЧека.ДанныеПоставщика.Телефон;
		
		НоваяСтрока.НаименованиеПредметаРасчета		= СтрокаПозицииЧека.Наименование;
		НоваяСтрока.СуммаСоСкидками					= СтрокаПозицииЧека.Сумма;
		НоваяСтрока.СтавкаНДС						= ПолучитьСтавкуНДСПоЗначениюСтавки(СтрокаПозицииЧека.СтавкаНДС);   		
	КонецЦикла;
	
КонецПроцедуры     

// Функция получает структуру данных.
//
Функция ПолучитьСтруктуруДанных()
	
	Структура = Новый Структура;
	Структура.Вставить("АвторДокумента");
	Структура.Вставить("АдресЭП");
	Структура.Вставить("ДанныеXMLКорректируемогоЧека");
	Структура.Вставить("Дата");
	Структура.Вставить("ДатаКоррекции");
	Структура.Вставить("ДокументРасчетов");
	Структура.Вставить("ДополнительныйРеквизит");
	Структура.Вставить("Касса");
	Структура.Вставить("Кассир");
	Структура.Вставить("КассирИНН");
	Структура.Вставить("Комментарий");
	Структура.Вставить("Контрагент");
	Структура.Вставить("КонтрагентИНН");
	Структура.Вставить("НомерПредписания");
	Структура.Вставить("ОписаниеКоррекции");
	Структура.Вставить("Организация");
	Структура.Вставить("ПризнакАгента");
	Структура.Вставить("СистемаНалогообложения");
	Структура.Вставить("СНОКорректируемогоДокумента");
	Структура.Вставить("СтруктурнаяЕдиница");
	Структура.Вставить("СуммаВключаетНДС");
	Структура.Вставить("Телефон");
	Структура.Вставить("ТипКоррекции");
	Структура.Вставить("ТипРасчета");
	Структура.Вставить("ЧекСкорректированный");
	Структура.Вставить("ЧекСкорректированныйПроведен");
	Структура.Вставить("ЧекСторно");
	Структура.Вставить("ЧекСторноПроведен");
	Структура.Вставить("ВидОперации");

	Структура.Вставить("Оплата"				, Новый Массив);
	Структура.Вставить("ПозицииЧека"		, Новый Массив);
	Структура.Вставить("ТаблицаОснований"	, Новый Массив); 	
	
	Возврат Структура;
	
КонецФункции

// Функция получает структуру оплаты.
//
Функция ПолучитьСтруктуруОплаты()
	
	Структура = Новый Структура;
	Структура.Вставить("Сумма");
	Структура.Вставить("ТипОплаты");
	
	Возврат Структура;
	
КонецФункции

// Функция получает структуру таблицы оснований.
//
Функция ПолучитьСтруктуруТаблицаОснований()
	
	Структура = Новый Структура;
	// Структура.Вставить("Аванс");
	// Структура.Вставить("ДатаПлатежа");
	Структура.Вставить("ДокументОснование");
	// Структура.Вставить("ИдентификаторФискальнойЗаписи");
	// Структура.Вставить("СуммаАванса");
	// Структура.Вставить("ПолнаяПостоплата");
			
	Возврат Структура;
	
КонецФункции

// Функция получает структуру позиции чека.
//
Функция ПолучитьСтруктуруПозицииЧека()
	
	Структура = Новый Структура;
	Структура.Вставить("ДанныеПоставщикаИНН");
	Структура.Вставить("ДанныеПоставщикаНаименование");
	Структура.Вставить("ДанныеПоставщикаТелефон");
	Структура.Вставить("Количество");
	Структура.Вставить("НаименованиеПредметаРасчета");
	Структура.Вставить("НомерСекции");
	Структура.Вставить("ПризнакАгентаПоПредметуРасчета");
	Структура.Вставить("ПризнакПредметаРасчета");
	Структура.Вставить("ПризнакСпособаРасчета");
	Структура.Вставить("СтавкаНДС");
	Структура.Вставить("СуммаНДС");
	Структура.Вставить("СуммаСкидок");
	Структура.Вставить("СуммаСоСкидками");
	Структура.Вставить("ЦенаСоСкидками");
	Структура.Вставить("Штрихкод");
	
	Возврат Структура;
	
КонецФункции

// Процедура заполняет позиции чека по общим параметрам.
//
Процедура ЗаполнитьПозицииЧекаПоОбщимПараметрамСНоменклатурой(Объект, ОбщиеПараметры)
	
	Для Каждого ПозицияЧека Из ОбщиеПараметры.ПозицииЧека Цикл
		
		НоваяСтрока = ПолучитьСтруктуруПозицииЧека(); // Объект.ПозицииЧека.Добавить();
		НоваяСтрока.Вставить("Номенклатура");
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПозицияЧека);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПозицияЧека.ДанныеКодаТоварнойНоменклатуры);
		
		НоваяСтрока.ДанныеПоставщикаИНН 			= ПозицияЧека.ДанныеПоставщика.ИНН;
		НоваяСтрока.ДанныеПоставщикаНаименование 	= ПозицияЧека.ДанныеПоставщика.Наименование;
		НоваяСтрока.ДанныеПоставщикаТелефон 		= ПозицияЧека.ДанныеПоставщика.Телефон;
		
		НоваяСтрока.НаименованиеПредметаРасчета		= ?(ПозицияЧека.Свойство("Номенклатура") И ЗначениеЗаполнено(ПозицияЧека.Номенклатура), 
																						ПозицияЧека.Номенклатура, ПозицияЧека.Наименование);
		НоваяСтрока.СуммаСоСкидками					= ПозицияЧека.Сумма;	
		НоваяСтрока.СтавкаНДС						= Обработки.СозданиеЧековКоррекции.ПолучитьСтавкуНДСПоЗначениюСтавки(ПозицияЧека.СтавкаНДС);
		
		Объект.ПозицииЧека.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
