
#Область СлужебныеПроцедурыИФункции

// Описание дополнитльеных настроек отчета
//  В данной процедуре можно задать описания варинатов отчетов, опредлить дополнительные варианты,
//  определить дополнительные разделы варианта отчета
//
// Параметры:
//  Настройки	 - 	 - 
//
Процедура НастройкиОтчета(Настройки) Экспорт
	
	// Описание вариантов отчетов
	ВариантыОтчетов.УстановитьОписаниеВариантаВДопНастройках(Настройки, "ДниРождения", "");
		
	СписокВариантов = Новый СписокЗначений;
	СписокВариантов.Добавить("ДниРождения",,Истина);
		
	ВариантыОтчетов.УстановитьОсновныеВариантыОтчета("Отчет.ДниРождения", СписокВариантов);
	
КонецПроцедуры

#КонецОбласти
