
#Область СлужебныеПроцедурыИФункции

//  Процедура - При создании при чтении на сервере
// 
//  Параметры:
//   Форма			 - УправляемаяФорма	 - 
//   ВладелецКИ		 - ЛюбаяСсылка	 - владелец контактной информации
//   ШиринаПоляВида	 - число	 - 
// 
Процедура ОтображениеДополнительнойИнформации(Форма, Знач ВладелецСсылка = Неопределено, Знач МассивРодителей = Неопределено) Экспорт
	
	Если МассивРодителей = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ВладелецСсылка = Неопределено Тогда
		ВладелецСсылка = Форма.Объект.Ссылка;
	ИначеЕсли ТипЗнч(ВладелецСсылка) <> Тип("ДанныеФормыСтруктура")
		И ТипЗнч(ВладелецСсылка) <> Тип("ФормаКлиентскогоПриложения")
		И Не ЗначениеЗаполнено(ВладелецСсылка) Тогда
		
		Возврат;
	КонецЕсли;
	
	ЕстьРеквизитОплаченоПоРегистру = Ложь;
	
	//  Создание таблиц-реквизитов формы, если отсутствуют
	ДобавитьРеквизитыФормыДополнительнойИнформации(Форма, МассивРодителей, ЕстьРеквизитОплаченоПоРегистру);
	
	//  Чтение имеющейся информации объекта в созданную таблицу для отображения
	ЗаполнитьТаблицыДополнительнойИнформации(Форма, ВладелецСсылка, МассивРодителей);
	
	//  Пересоздание элементов формы по информации из таблицы для отображения
	ОбновитьЭлементыДополнительнойИнформации(Форма, ВладелецСсылка, МассивРодителей, ЕстьРеквизитОплаченоПоРегистру);
	
КонецПроцедуры

//  Процедура - Добавить реквизиты формы дополнительной информации
// 
//  Параметры:
//   Форма	 - 	 - 
// 
Процедура ДобавитьРеквизитыФормыДополнительнойИнформации(Форма, МассивРодителей, ЕстьРеквизитОплаченоПоРегистру)
	
	//  Вычисляем существующие реквизиты
	СписокРеквизитовФормы = Форма.ПолучитьРеквизиты();
	
	СоздатьТаблицуУдостоверенияЛичностиСуществующие = Истина;
	СоздатьТаблицуПолисыСуществующие 				= Истина;
	СоздатьТаблицуСкидки                            = Истина;
	СоздатьТаблицуЛицевыхБонусныхСчетов             = Истина;
	СоздатьТаблицуРодственникиСуществующие 			= Истина;
	СоздатьТаблицуПользователиИБСуществующие 		= Истина;
	СоздатьТаблицуКабинетыСуществующие              = Истина;
	СоздатьТаблицуИнформацияПоОплате 				= Истина;
	СоздатьТаблицуДолгиСуществующие					= Истина;
	СоздатьТаблицуКартыСуществующие 				= Истина;
    СоздатьТаблицуБудущиеСобытия 					= Истина;
	СоздатьТаблицуПромокоды							= Истина;
	
	Для Каждого Реквизит Из СписокРеквизитовФормы Цикл
		Если Реквизит.Имя 		= "СуммаОплаченоПоРегистру" 	Тогда 			
			ЕстьРеквизитОплаченоПоРегистру 					= Истина;
		КонецЕсли;		
		Если Реквизит.Имя 		= "УдостоверенияЛичностиСуществующие"	Тогда
			СоздатьТаблицуУдостоверенияЛичностиСуществующие = Ложь;
		ИначеЕсли Реквизит.Имя 	= "ПолисыСуществующие"					Тогда
			СоздатьТаблицуПолисыСуществующие 				= Ложь;
		ИначеЕсли Реквизит.Имя 	= "СкидкиСуществующие"					Тогда
			СоздатьТаблицуСкидки 		            		= Ложь;	
		ИначеЕсли Реквизит.Имя  = "ТаблицаЛицевыхБонусныхСчетов"		Тогда
			СоздатьТаблицуЛицевыхБонусныхСчетов 			= Ложь;
		ИначеЕсли Реквизит.Имя 	= "РодственникиСуществующие"			Тогда	
			СоздатьТаблицуРодственникиСуществующие 			= Ложь;
		ИначеЕсли Реквизит.Имя 	= "ПользователиИБСуществующие"			Тогда	
			СоздатьТаблицуПользователиИБСуществующие 		= Ложь;
		ИначеЕсли Реквизит.Имя 	= "КабинетыСуществующие"				Тогда	
			СоздатьТаблицуКабинетыСуществующие 				= Ложь;
		ИначеЕсли Реквизит.Имя 	= "Информация_По_Оплате"				Тогда
			СоздатьТаблицуИнформацияПоОплате 				= Ложь;
		ИначеЕсли Реквизит.Имя 	= "ДолгиСуществующие"					Тогда
			СоздатьТаблицуДолгиСуществующие 				= Ложь;	
		ИначеЕсли Реквизит.Имя 	= "КартыСуществующие"					Тогда
			СоздатьТаблицуКартыСуществующие 				= Ложь;	
		ИначеЕсли Реквизит.Имя 	= "БудущиеСобытия"						Тогда
			СоздатьТаблицуБудущиеСобытия 					= Ложь;
		ИначеЕсли Реквизит.Имя  = "ПромокодыСуществующие" 				Тогда
			СоздатьТаблицуПромокоды							= Ложь;
		КонецЕсли;    		
		
	КонецЦикла;
	
	//  Создаем реквизиты формы
	МассивДобавляемыхРеквизитов = Новый Массив;
	ОписаниеСтрока 				= Новый ОписаниеТипов("Строка");
	ОписаниеБулево 				= Новый ОписаниеТипов("Булево");
	
	Для Каждого ЭлементРодитель Из МассивРодителей Цикл 
		
		Если ЭлементРодитель = "ГруппаУдостоверенияЛичностиСуществующие" И СоздатьТаблицуУдостоверенияЛичностиСуществующие Тогда 
			
			ИмяТаблицы = "УдостоверенияЛичностиСуществующие";
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы		, Новый ОписаниеТипов("ТаблицаЗначений"), , , Истина));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Период"		, Новый ОписаниеТипов("Дата"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВидДокумента"	, Новый ОписаниеТипов("СправочникСсылка.ВидыДокументовФизическихЛиц"), ИмяТаблицы));
			СписокТипов = Новый Массив;
			СписокТипов.Добавить("СправочникСсылка.Сотрудники");
			СписокТипов.Добавить("СправочникСсылка.Контрагенты");
			ОписаниеСоставногоТипа = Новый ОписаниеТипов(СписокТипов);			
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Физлицо"		, ОписаниеСоставногоТипа, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Серия"		, Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(Метаданные.РегистрыСведений.ДокументыФизическихЛиц.Ресурсы.Серия.Тип.КвалификаторыСтроки.Длина)), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Номер"		, Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(Метаданные.РегистрыСведений.ДокументыФизическихЛиц.Ресурсы.Номер.Тип.КвалификаторыСтроки.Длина)), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ДатаВыдачи"	, Новый ОписаниеТипов("Дата"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("КемВыдан"		, Новый ОписаниеТипов("Строка"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ДатаОкончания", Новый ОписаниеТипов("Дата"), ИмяТаблицы));
			
		ИначеЕсли ЭлементРодитель = "ГруппаСкидкиСуществующие" И СоздатьТаблицуСкидки Тогда	
			
			ИмяТаблицы = "СкидкиСуществующие";
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы				    , Новый ОписаниеТипов("ТаблицаЗначений"), , , Истина));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Скидка"		    	    , Новый ОписаниеТипов("СправочникСсылка.СкидкиНаценки"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Представление"			, ОписаниеСтрока, ИмяТаблицы));			
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЗначениеСкидкиНаценки"	, Новый ОписаниеТипов("Число"), ИмяТаблицы)); 
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("СпособПредоставления"	    , Новый ОписаниеТипов("ПеречислениеСсылка.СпособПредоставленияСкидки"), ИмяТаблицы)); 
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ТипСкидки"    			, ОписаниеСтрока, ИмяТаблицы));
			
		ИначеЕсли ЭлементРодитель = "ГруппаПолисыСуществующие" И СоздатьТаблицуПолисыСуществующие Тогда	
			
			ИмяТаблицы = "ПолисыСуществующие";
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы				    , Новый ОписаниеТипов("ТаблицаЗначений"), , , Истина));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Полис"		    		, Новый ОписаниеТипов("СправочникСсылка.ПолисыМедицинскогоСтрахования"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ТипПолиса"		    	, Новый ОписаниеТипов("ПеречислениеСсылка.ТипыПолиса"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Представление"			, ОписаниеСтрока, ИмяТаблицы));			
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("СтраховаяКомпания"		, Новый ОписаниеТипов("СправочникСсылка.Контрагенты"), ИмяТаблицы)); 
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("СерияПолиса"	   			, ОписаниеСтрока, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("НомерПолиса"    			, Новый ОписаниеТипов("Число"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ДатаНачала"    			, Новый ОписаниеТипов("Дата"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ДатаОкончания"    		, Новый ОписаниеТипов("Дата"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЛимитПолиса"    			, Новый ОписаниеТипов("Число"), ИмяТаблицы));
			
		ИначеЕсли ЭлементРодитель = "ГруппаЛицевыеБонусныеСчетаСуществующие" И СоздатьТаблицуЛицевыхБонусныхСчетов Тогда
			
			ИмяТаблицы = "ТаблицаЛицевыхБонусныхСчетов";
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы					, Новый ОписаниеТипов("ТаблицаЗначений"), , , Истина));
			СписокТипов = Новый Массив;
			СписокТипов.Добавить(Тип("СправочникСсылка.ВидыЛицевыхСчетов"));
			СписокТипов.Добавить(Тип("СправочникСсылка.БонусныеСчета"));
			ОписаниеСоставногоТипа = Новый ОписаниеТипов(СписокТипов);			
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЛицевойБонусныйСчет"		, ОписаниеСоставногоТипа, ИмяТаблицы));			
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Представление"			, ОписаниеСтрока, ИмяТаблицы));			
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("СуммаОстаток"				, Новый ОписаниеТипов("Число"), ИмяТаблицы)); 
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("СтепеньРодства"			, Новый ОписаниеТипов("СправочникСсылка.СтепеньРодства"), ИмяТаблицы));

		ИначеЕсли ЭлементРодитель = "ГруппаРодственникиСуществующие" И СоздатьТаблицуРодственникиСуществующие Тогда	
			
			ИмяТаблицы = "РодственникиСуществующие";
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы					, Новый ОписаниеТипов("ТаблицаЗначений"), , , Истина));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Контрагент"				, Новый ОписаниеТипов("СправочникСсылка.Контрагенты"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Родственник"				, Новый ОписаниеТипов("СправочникСсылка.Контрагенты"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("СтепеньРодства"			, Новый ОписаниеТипов("СправочникСсылка.СтепеньРодства"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ОбщийЛицевойСчет"			, ОписаниеБулево, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ОбщийНакопительныйСчет"	, ОписаниеБулево, ИмяТаблицы));
			// МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ОбщийБонусныйСчет"	    , ОписаниеБулево, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЗаконныйПредставитель"	, ОписаниеБулево, ИмяТаблицы));
			
		ИначеЕсли ЭлементРодитель = "ГруппаПользовательИБСуществующий" И СоздатьТаблицуПользователиИБСуществующие Тогда	
			
			ИмяТаблицы = "ПользователиИБСуществующие";
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы					, Новый ОписаниеТипов("ТаблицаЗначений"), , , Истина));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Пользователь"				, Новый ОписаниеТипов("СправочникСсылка.Пользователи"), ИмяТаблицы));
			
		ИначеЕсли ЭлементРодитель = "ГруппаКабинетыСуществующие" И СоздатьТаблицуКабинетыСуществующие Тогда 
			
			ИмяТаблицы = "КабинетыСуществующие";
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений"), , , Истина));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Помещение" , Новый ОписаниеТипов("СправочникСсылка.Помещения"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Сотрудник" , Новый ОписаниеТипов("СправочникСсылка.Сотрудники"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Основное" , ОписаниеБулево, ИмяТаблицы));
			
		ИначеЕсли ЭлементРодитель = "ГруппаИнформацияПоОплатеПодробно" И СоздатьТаблицуИнформацияПоОплате Тогда
			
			ИмяТаблицы = "Информация_По_Оплате";
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы					, Новый ОписаниеТипов("ТаблицаЗначений"), , , Истина));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ДатаПлатежа"				, Новый ОписаниеТипов("Дата"), ИмяТаблицы));
			СписокТипов = Новый Массив;
			// СписокТипов.Добавить("СправочникСсылка.ЛицевыеСчета");
			СписокТипов.Добавить("СправочникСсылка.Номенклатура");
			СписокТипов.Добавить("СправочникСсылка.БонусныеСчета");
			СписокТипов.Добавить("ДокументСсылка.ПоступлениеДенежныхСредств");
			СписокТипов.Добавить("ДокументСсылка.СписаниеДенежныхСредств");
			СписокТипов.Добавить("ДокументСсылка.ПланЛечения");
			СписокТипов.Добавить("ДокументСсылка.НарядЗаказ");
			
			ОписаниеСоставногоТипа = Новый ОписаниеТипов(СписокТипов);		
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ДокументОплаты"			, ОписаниеСоставногоТипа, ИмяТаблицы));
			
			МассивТипов = Новый Массив;
			МассивТипов.Добавить("ПеречислениеСсылка.ТипыДенежныхСредств");
			МассивТипов.Добавить("Строка");
			ОписаниеТипа = Новый ОписаниеТипов(МассивТипов,,,, Новый КвалификаторыСтроки(30));			
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ТипДенежныхСредств"		, ОписаниеТипа, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВладелецАванса"			, Новый ОписаниеТипов("СправочникСсылка.ПартииНоменклатуры"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("СуммаОплачено"			, Новый ОписаниеТипов("Число"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ИдСтроки"					, Новый ОписаниеТипов("Число"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПолеСортировки"			, Новый ОписаниеТипов("Число"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("БонусныйСчет"				, Новый ОписаниеТипов("СправочникСсылка.БонусныеСчета"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ОплатаПоСсылке"			, Новый ОписаниеТипов("ПеречислениеСсылка.ПлатежныеШлюзы"), ИмяТаблицы));
			
		ИначеЕсли ЭлементРодитель = "ГруппаДолгиКонтрагентаСуществующие" И СоздатьТаблицуДолгиСуществующие Тогда	
			
			ИмяТаблицы = "ДолгиСуществующие";
			СписокТипов = Новый Массив;
			СписокТипов.Добавить("ДокументСсылка.Реализация");
			СписокТипов.Добавить("ДокументСсылка.ВводНачальныхОстатков");
			СписокТипов.Добавить("ДокументСсылка.Прием");
			СписокТипов.Добавить("ДокументСсылка.Поступление");
			ОписаниеСоставногоТипа = Новый ОписаниеТипов(СписокТипов);	
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы					, Новый ОписаниеТипов("ТаблицаЗначений"), , , Истина));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Основание"	        	, ОписаниеСоставногоТипа, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Сумма"					, Новый ОписаниеТипов("Число"), ИмяТаблицы));
			// МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ТипРасчета"               , Новый ОписаниеТипов("ПеречислениеСсылка.ТипыРасчетов"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Дата"              		, Новый ОписаниеТипов("Дата"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Контрагент"               , Новый ОписаниеТипов("СправочникСсылка.Контрагенты"), ИмяТаблицы));
			
		ИначеЕсли ЭлементРодитель = "ГруппаКартыСуществующие" И СоздатьТаблицуКартыСуществующие Тогда	
			
			ИмяТаблицы = "КартыСуществующие";
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы				, Новый ОписаниеТипов("ТаблицаЗначений"), , , Истина));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("КартаСсылка"			, Новый ОписаниеТипов("СправочникСсылка.Карты"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ТипКода"				, Новый ОписаниеТипов("ПеречислениеСсылка.ВидыКарт"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВидКарты"				, Новый ОписаниеТипов("СправочникСсылка.ВидыКарт"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("КодКарты"				, Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(200)), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВнутреннийКодКарты"	, Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)), ИмяТаблицы));	
			
		ИначеЕсли ЭлементРодитель = "ГруппаБудущиеСобытияКлиента" И СоздатьТаблицуБудущиеСобытия Тогда	
			
			ИмяТаблицы = "БудущиеСобытия";
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы					, Новый ОписаниеТипов("ТаблицаЗначений"), , , Истина));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Событие"	        		, Новый ОписаниеТипов("ДокументСсылка.Событие"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ДатаСобытия"              , Новый ОписаниеТипов("Дата"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Сотрудник"				, Новый ОписаниеТипов("СправочникСсылка.Сотрудники"), ИмяТаблицы));
			
		ИначеЕсли ЭлементРодитель = "ГруппаПромокодыСуществующие" И СоздатьТаблицуПромокоды Тогда	
			
			ИмяТаблицы = "ПромокодыСуществующие";
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы					, Новый ОписаниеТипов("ТаблицаЗначений"), , , Истина));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПромокодСсылка"			, Новый ОписаниеТипов("СправочникСсылка.Промокоды"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Промокод"					, ОписаниеСтрока, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Активен"					, ОписаниеБулево, ИмяТаблицы));
					
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивДобавляемыхРеквизитов.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	КонецЕсли;
	
КонецПроцедуры

//  Процедура - Заполнить таблицы дополнительной информации
// 
//  Параметры:
//   Форма			 - 	 - 
//   ВладелецСсылка	 - 	 - 
//   МассивРодителей	 - 	 - 
// 
Процедура ЗаполнитьТаблицыДополнительнойИнформации(Форма, ВладелецСсылка, МассивРодителей)
	
	Для Каждого ЭлементРодитель Из МассивРодителей Цикл		
		
		Если ЭлементРодитель = "ГруппаУдостоверенияЛичностиСуществующие" Тогда 
			
			#Область ЗАПОЛНЕНИЕ_ТАБЛИЦЫ_УДОСТОВЕРЕНИЯМИ_ЛИЧНОСТИ
			
			Форма.УдостоверенияЛичностиСуществующие.Очистить();
			
			Если НЕ ЗначениеЗаполнено(ВладелецСсылка) Тогда 
				Продолжить;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДокументыФизическихЛиц.ВидДокумента КАК ВидДокумента,
			|	ДокументыФизическихЛиц.Физлицо КАК Физлицо,
			|	ДокументыФизическихЛиц.Серия КАК Серия,
			|	ДокументыФизическихЛиц.Номер КАК Номер,
			|	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачи,
			|	ДокументыФизическихЛиц.КемВыдан КАК КемВыдан,
			|	ДокументыФизическихЛиц.СрокДействия КАК СрокДействия
			|ИЗ
			|	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
			|ГДЕ
			|	ДокументыФизическихЛиц.Физлицо = &Контрагент";
			
			Запрос.УстановитьПараметр("Контрагент",	ВладелецСсылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Форма.УдостоверенияЛичностиСуществующие.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЦикла;
			
			#КонецОбласти
			
		ИначеЕсли ЭлементРодитель = "ГруппаПолисыСуществующие" Тогда 
			
			#Область ЗАПОЛНЕНИЕ_ТАБЛИЦЫ_ПОЛИСАМИ_МЕДИЦИНСКОГО_СТРАХОВАНИЯ
			
			Форма.ПолисыСуществующие.Очистить();
			
			Если НЕ ЗначениеЗаполнено(ВладелецСсылка) Тогда 
				Продолжить;
			КонецЕсли;
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПолисыМедицинскогоСтрахования.Наименование КАК Представление,
			|	ПолисыМедицинскогоСтрахования.ТипПолиса КАК ТипПолиса,
			|	ПолисыМедицинскогоСтрахования.СтраховаяКомпания КАК СтраховаяКомпания,
			|	ПолисыМедицинскогоСтрахования.СерияПолиса КАК СерияПолиса,
			|	ПолисыМедицинскогоСтрахования.НомерПолиса КАК НомерПолиса,
			|	ПолисыМедицинскогоСтрахования.ЛимитПолиса КАК ЛимитПолиса,
			|	ПолисыМедицинскогоСтрахования.ДанаНачала КАК ДатаНачала,
			|	ПолисыМедицинскогоСтрахования.ДатаОкончания КАК ДатаОкончания,
			|	ПолисыМедицинскогоСтрахования.Ссылка КАК Полис
			|ИЗ
			|	Справочник.ПолисыМедицинскогоСтрахования КАК ПолисыМедицинскогоСтрахования
			|ГДЕ
			|	ПолисыМедицинскогоСтрахования.Контрагент = &Контрагент
			|	И НЕ ПолисыМедицинскогоСтрахования.ПометкаУдаления
			|	И ПолисыМедицинскогоСтрахования.ДатаОкончания >= &Период
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаНачала");
			
			Запрос.УстановитьПараметр("Период"    , НачалоДня(ТекущаяДатаСеанса()));
			Запрос.УстановитьПараметр("Контрагент",	ВладелецСсылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Форма.ПолисыСуществующие.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЦикла;
			
			#КонецОбласти
			
		ИначеЕсли ЭлементРодитель = "ГруппаСкидкиСуществующие" Тогда	
			
			#Область ЗАПОЛНЕНИЕ_ТАБЛИЦЫ_СКИДКАМИ
			
			Форма.СкидкиСуществующие.Очистить();
			
			Если НЕ ЗначениеЗаполнено(ВладелецСсылка) Тогда 
				Продолжить;
			КонецЕсли;
			
			ТаблицаСкидкиДоступныеДляКлиента = Справочники.СкидкиНаценки.ПолучитьСкидкиДоступныеДляКлиента(ВладелецСсылка);
			
			Для Каждого СтрокаТЧ Из ТаблицаСкидкиДоступныеДляКлиента Цикл
				НоваяСтрока = Форма.СкидкиСуществующие.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			КонецЦикла;
			
			#КонецОбласти
			
		ИначеЕсли ЭлементРодитель = "ГруппаЛицевыеБонусныеСчетаСуществующие" Тогда
			
			#Область ЗАПОЛНЕНИЕ_ТАБЛИЦЫ_ЛИЦЕВЫМИ_БОНУСНЫМИ_СЧЕТАМИ_И_АВАНСАМИ
			
			УстановитьПривилегированныйРежим(Истина);
			
			Форма.ТаблицаЛицевыхБонусныхСчетов.Очистить();
			
			Если НЕ ЗначениеЗаполнено(ВладелецСсылка) Тогда 
				Продолжить;
			КонецЕсли;
			
			// Отбор родственников с общим лицевым счетом.
			ТаблицаРодственников = РегистрыСведений.РодственныеСвязи.РодственникиКлиента(ВладелецСсылка,, Истина);			
			МассивКонтрагентов = ТаблицаРодственников.ВыгрузитьКолонку("Родственник");
			МассивКонтрагентов.Добавить(ВладелецСсылка);
			
			ТаблицаРодственников = РегистрыСведений.РодственныеСвязи.РодственникиКлиента(ВладелецСсылка,,,, Истина);  		
			МассивКонтрагентовБС = Новый Массив;			
			Для Каждого СтрокаТЗ Из ТаблицаРодственников Цикл				
				МассивКонтрагентовБС.Добавить(СтрокаТЗ.Родственник);				
			КонецЦикла;			
			МассивКонтрагентовБС.Добавить(ВладелецСсылка);

			ПериодОтбора = ТекущаяДатаСеанса() + 10;
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДенежныеСредстваНаЛицевыхСчетахОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаОстаток,
			|	ДенежныеСредстваНаЛицевыхСчетахОстаткиИОбороты.СуммаРасход КАК СуммаРасход,
			|	ДенежныеСредстваНаЛицевыхСчетахОстаткиИОбороты.ВидСчета КАК ВидСчета,
			|	ДенежныеСредстваНаЛицевыхСчетахОстаткиИОбороты.Контрагент КАК Контрагент
			|ИЗ
			|	РегистрНакопления.ДенежныеСредстваНаЛицевыхСчетах.ОстаткиИОбороты(, &Период, , , Контрагент В (&МассивКонтрагентов)) КАК ДенежныеСредстваНаЛицевыхСчетахОстаткиИОбороты
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВложенныйЗапрос.БонусныйСчет КАК БонусныйСчет,
			|	СУММА(ВложенныйЗапрос.СуммаОстаток) КАК СуммаОстаток,
			|	СУММА(ВложенныйЗапрос.СуммаРасход) КАК СуммаРасход,
			|	ВложенныйЗапрос.ВладелецБонусногоСчета КАК Контрагент
			|ИЗ
			|	(ВЫБРАТЬ
			|		БонусныеСчетаОбороты.БонусныйСчет КАК БонусныйСчет,
			|		БонусныеСчетаОбороты.СуммаОборот КАК СуммаОстаток,
			|		БонусныеСчетаОбороты.СуммаРасход КАК СуммаРасход,
			|		БонусныеСчетаОбороты.БонусныйСчет.ВладелецБонусногоСчета КАК ВладелецБонусногоСчета
			|	ИЗ
			|		РегистрНакопления.БонусныеСчета.Обороты(
			|				,
			|				&Период,
			|				,
			|				БонусныйСчет.ВладелецБонусногоСчета В (&МассивКонтрагентовБС)
			|					И ВЫБОР
			|						КОГДА БонусныйСчет.СрокДействияНачало <> ДАТАВРЕМЯ(1, 1, 1)
			|								И БонусныйСчет.СрокДействияКонец <> ДАТАВРЕМЯ(1, 1, 1)
			|							ТОГДА БонусныйСчет.СрокДействияНачало <= &Период
			|									И БонусныйСчет.СрокДействияКонец >= &Период
			|						ИНАЧЕ ИСТИНА
			|					КОНЕЦ
			|					И НЕ БонусныйСчет.ПометкаУдаления
			|					И НЕ БонусныйСчет.Закрыт) КАК БонусныеСчетаОбороты
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		БонусныеСчета.Ссылка,
			|		0,
			|		0,
			|		БонусныеСчета.ВладелецБонусногоСчета
			|	ИЗ
			|		Справочник.БонусныеСчета КАК БонусныеСчета
			|	ГДЕ
			|		БонусныеСчета.ВладелецБонусногоСчета В(&МассивКонтрагентовБС)
			|		И ВЫБОР
			|				КОГДА БонусныеСчета.СрокДействияНачало <> ДАТАВРЕМЯ(1, 1, 1)
			|						И БонусныеСчета.СрокДействияКонец <> ДАТАВРЕМЯ(1, 1, 1)
			|					ТОГДА БонусныеСчета.СрокДействияНачало <= &Период
			|							И БонусныеСчета.СрокДействияКонец >= &Период
			|				ИНАЧЕ ИСТИНА
			|			КОНЕЦ
			|		И НЕ БонусныеСчета.ПометкаУдаления
			|		И НЕ БонусныеСчета.Закрыт) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.БонусныйСчет,
			|	ВложенныйЗапрос.ВладелецБонусногоСчета");
			
			Запрос.УстановитьПараметр("Период"              , ПериодОтбора);
			Запрос.УстановитьПараметр("МассивКонтрагентов"  , МассивКонтрагентов);
			Запрос.УстановитьПараметр("Контрагент"		  	, ВладелецСсылка);
            Запрос.УстановитьПараметр("МассивКонтрагентовБС", МассивКонтрагентовБС);

			ОбщийРезультатВыполненияПакета = Запрос.ВыполнитьПакет();
			
			СимвольныйКод = ОбщегоНазначенияСтоматология.ПолучитьСимвольноеПредставлениеВалюты();
			ФормаКлиента  = Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлементаКлиенты";

			//  Лицевые счета
			ТаблицаЛицевыеСчета	  = ОбщийРезультатВыполненияПакета[0].Выгрузить();
			ЛицевыеСчетаВладельца = ТаблицаЛицевыеСчета.НайтиСтроки(Новый Структура("Контрагент", ВладелецСсылка));
			
			Для Каждого СтрокаТЗ Из ЛицевыеСчетаВладельца Цикл
				
				НоваяСтрока 					= Форма.ТаблицаЛицевыхБонусныхСчетов.Добавить();
				НоваяСтрока.ЛицевойБонусныйСчет = СтрокаТЗ.ВидСчета;
				НоваяСтрока.Представление 		= СтрокаТЗ.ВидСчета.Наименование + СтрШаблон(" (Общий расход: %1 %2) ", Формат(СтрокаТЗ.СуммаРасход, "ЧЦ=15; ЧДЦ=2; ЧН="), СокрЛП(СимвольныйКод));
				НоваяСтрока.СуммаОстаток  		= СтрокаТЗ.СуммаОстаток;
				
			КонецЦикла;	
			// Лицевые счета родственников
			Для Каждого СтрокаТЗ Из ТаблицаЛицевыеСчета Цикл
				
				Если ЛицевыеСчетаВладельца.Найти(СтрокаТЗ) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока 					= Форма.ТаблицаЛицевыхБонусныхСчетов.Добавить();
				НоваяСтрока.ЛицевойБонусныйСчет = СтрокаТЗ.ВидСчета;
				НоваяСтрока.Представление 		= ?(ФормаКлиента,
													СтрокаТЗ.ВидСчета.Наименование + СтрШаблон(" (Общий расход: %1 %2) ", Формат(СтрокаТЗ.СуммаРасход, "ЧЦ=15; ЧДЦ=2; ЧН="), СимвольныйКод), 
													СтрокаТЗ.ВидСчета.Наименование);				
				НоваяСтрока.СуммаОстаток  		= СтрокаТЗ.СуммаОстаток;				
				МассивСтрокРодственников = ТаблицаРодственников.НайтиСтроки(Новый Структура("Родственник", СтрокаТЗ.Контрагент));				
				Если МассивСтрокРодственников.Количество() > 0 Тогда
					НоваяСтрока.СтепеньРодства  = МассивСтрокРодственников[0].СтепеньРодства;
				КонецЕсли;				
			КонецЦикла;   

			// Бонусные счета
			ТаблицаБонусныеСчета = ОбщийРезультатВыполненияПакета[1].Выгрузить();  
			БонусныеСчетаВладельца = ТаблицаБонусныеСчета.НайтиСтроки(Новый Структура("Контрагент", ВладелецСсылка));
			Для Каждого СтрокаТЗ Из БонусныеСчетаВладельца Цикл
				НоваяСтрока 					= Форма.ТаблицаЛицевыхБонусныхСчетов.Добавить();
				НоваяСтрока.ЛицевойБонусныйСчет = СтрокаТЗ.БонусныйСчет;
				НоваяСтрока.Представление 		= ?(ФормаКлиента, 
													Справочники.БонусныеСчета.ПолучитьПредставлениеБонусногоСчета(СтрокаТЗ.БонусныйСчет)
													+ СтрШаблон(Нстр("ru = ' (Общий расход: %1 %2) '; en = ' (Total expense: %1 %2) '"), Формат(СтрокаТЗ.СуммаРасход, "ЧЦ=15; ЧДЦ=2; ЧН="), СимвольныйКод), 
													Справочники.БонусныеСчета.ПолучитьПредставлениеБонусногоСчета(СтрокаТЗ.БонусныйСчет));
				
				НоваяСтрока.СуммаОстаток  		= СтрокаТЗ.СуммаОстаток;
			КонецЦикла;
			// Бонусные счета родственников
			Для Каждого СтрокаТЗ Из ТаблицаБонусныеСчета Цикл
				
				Если СтрокаТЗ.СуммаОстаток > 0 Тогда					
					Если БонусныеСчетаВладельца.Найти(СтрокаТЗ) <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					НоваяСтрока 					= Форма.ТаблицаЛицевыхБонусныхСчетов.Добавить();
					НоваяСтрока.ЛицевойБонусныйСчет = СтрокаТЗ.БонусныйСчет;
					НоваяСтрока.Представление 		= Справочники.БонусныеСчета.ПолучитьПредставлениеБонусногоСчета(СтрокаТЗ.БонусныйСчет) + СтрШаблон(" (Общий расход: %1 %2) ", Формат(СтрокаТЗ.СуммаРасход, "ЧЦ=15; ЧДЦ=2; ЧН="), СокрЛП(СимвольныйКод));
					НоваяСтрока.СуммаОстаток  		= СтрокаТЗ.СуммаОстаток;					
					МассивСтрокРодственников = ТаблицаРодственников.НайтиСтроки(Новый Структура("Родственник", СтрокаТЗ.Контрагент));					
					Если МассивСтрокРодственников.Количество() > 0 Тогда
						НоваяСтрока.СтепеньРодства  = МассивСтрокРодственников[0].СтепеньРодства;
					КонецЕсли;
					
				КонецЕсли;				
			КонецЦикла;
			
			УстановитьПривилегированныйРежим(Ложь);
			
			#КонецОбласти
			
		ИначеЕсли ЭлементРодитель = "ГруппаРодственникиСуществующие" Тогда 
			
			#Область ЗАПОЛНЕНИЕ_ТАБЛИЦЫ_РОДСТВЕННИКАМИ
			
			Форма.РодственникиСуществующие.Очистить();
			
			Если НЕ ЗначениеЗаполнено(ВладелецСсылка) Тогда 
				Продолжить;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РодственныеСвязи.Контрагент КАК Контрагент,
			|	РодственныеСвязи.Родственник КАК Родственник,
			|	РодственныеСвязи.СтепеньРодства КАК СтепеньРодства,
			|	РодственныеСвязи.ОбщийЛицевойСчет КАК ОбщийЛицевойСчет,
			|	РодственныеСвязи.ОбщийНакопительныйСчет КАК ОбщийНакопительныйСчет,
			|	РодственныеСвязи.ЗаконныйПредставитель КАК ЗаконныйПредставитель
			|ИЗ
			|	РегистрСведений.РодственныеСвязи КАК РодственныеСвязи
			|ГДЕ
			|	РодственныеСвязи.Контрагент = &Контрагент";
			
			Запрос.УстановитьПараметр("Контрагент",	ВладелецСсылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Форма.РодственникиСуществующие.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЦикла;
			
			#КонецОбласти
			
		ИначеЕсли ЭлементРодитель = "ГруппаПользовательИБСуществующий" Тогда 
			
			#Область ЗАПОЛНЕНИЕ_ТАБЛИЦЫ_ПОЛЬЗОВАТЕЛЯМИИБ
			
			Форма.ПользователиИБСуществующие.Очистить();
			
			Если НЕ ЗначениеЗаполнено(ВладелецСсылка) Тогда 
				Продолжить;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Пользователи.Ссылка КАК Пользователь
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи
			|ГДЕ
			|	Пользователи.Сотрудник = &Контрагент
			|	И НЕ Пользователи.ПометкаУдаления";
			
			Запрос.УстановитьПараметр("Контрагент",	ВладелецСсылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Форма.ПользователиИБСуществующие.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЦикла;
			
			#КонецОбласти
			
		ИначеЕсли ЭлементРодитель = "ГруппаКабинетыСуществующие" Тогда 
			
			#Область ЗАПОЛНЕНИЕ_ТАБЛИЦЫ_КАБИНЕТЫ_СУЩЕСТВУЮЩИЕ
			
			Форма.КабинетыСуществующие.Очистить();
			
			Если НЕ ЗначениеЗаполнено(ВладелецСсылка) Тогда 
				Продолжить;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СвязкаПомещениеСотрудник.Основное КАК Основное,
			|	СвязкаПомещениеСотрудник.Помещение КАК Помещение,
			|	СвязкаПомещениеСотрудник.Сотрудник КАК Сотрудник
			|ИЗ
			|	РегистрСведений.СвязкаПомещениеСотрудник КАК СвязкаПомещениеСотрудник
			|ГДЕ
			|	СвязкаПомещениеСотрудник.Сотрудник = &Контрагент";
			
			Запрос.УстановитьПараметр("Контрагент",	ВладелецСсылка);
			
			ТаблицаКабинетов = Запрос.Выполнить().Выгрузить();
			
			Форма.КабинетыСуществующие.Загрузить(ТаблицаКабинетов);
			
			#КонецОбласти
			
		ИначеЕсли ЭлементРодитель = "ГруппаИнформацияПоОплатеПодробно" Тогда 
			
			#Область ЗАПОЛНЕНИЕ_ТАБЛИЦЫ_ИНФОРМАЦИИ_ПО_ОПЛАТЕ
			
			Форма.Информация_По_Оплате.Очистить();
			
			Если ТипЗнч(ВладелецСсылка) <> Тип("ДанныеФормыСтруктура")
				И ТипЗнч(ВладелецСсылка) <> Тип("ФормаКлиентскогоПриложения")
				И Не ЗначениеЗаполнено(ВладелецСсылка) Тогда 
				Продолжить;
			КонецЕсли;
			
			СхемаОплат = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ВернутьСтруктуруОплатыПоДокументу(ВладелецСсылка.Ссылка);
			
			Для Каждого СтрокаОплаты Из СхемаОплат Цикл 
				
				НоваяСтрока = Форма.Информация_По_Оплате.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОплаты);
				
				ТипДенежныхСредств = СтрокаОплаты.ТипДенежныхСредств;
				
				Если ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда
					НоваяСтрока.ПолеСортировки = 1;
				ИначеЕсли ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта Тогда
					НоваяСтрока.ПолеСортировки = 2;
				ИначеЕсли ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ЛицевойСчет Тогда
					НоваяСтрока.ПолеСортировки = 3;
				ИначеЕсли ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Аванс Тогда
					НоваяСтрока.ПолеСортировки = 4;
				ИначеЕсли ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат Тогда
					НоваяСтрока.ПолеСортировки = 5;
				Иначе
					НоваяСтрока.ПолеСортировки = 6;
				КонецЕсли;
				
			КонецЦикла;
			
			// сворачиваем по бонусному счету
			ТаблицаОплатыБонусами = ВладелецСсылка.СкидкиНаценки.Выгрузить(Новый Структура("ПризнакОплатыБонусом", Истина));
			ТаблицаОплатыБонусами.Свернуть("БонусныйСчет", "Сумма");
			
			Для Каждого СтрокаТЧ Из ТаблицаОплатыБонусами Цикл // ВладелецСсылка.СкидкиНаценки.НайтиСтроки(Новый Структура("ПризнакОплатыБонусом", Истина)) Цикл
				
				НоваяСтрока = Форма.Информация_По_Оплате.Добавить();
				НоваяСтрока.БонусныйСчет       = СтрокаТЧ.БонусныйСчет;
				НоваяСтрока.СуммаОплачено      = СтрокаТЧ.Сумма;
				НоваяСтрока.ПолеСортировки 	   = 7;
				НоваяСтрока.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.БонусныйСчет;
			КонецЦикла;
			
			Форма.Информация_По_Оплате.Сортировать("ПолеСортировки");
			
			#КонецОбласти
			
		ИначеЕсли ЭлементРодитель = "ГруппаДолгиКонтрагентаСуществующие" Тогда
			
			#Область ЗАПОЛНЕНИЕ_ДОЛГОВ_КОНТРАГЕНТА
			
			МассивКлиентов = Новый Массив;
			МассивКлиентов.Добавить(ВладелецСсылка);
			
			// Родственники   = РегистрыСведений.РодственныеСвязи.РодственникиКлиента(ВладелецСсылка);
			// Если Родственники.Количество() > 0 Тогда
			//	
			//	МассивРодственников = Родственники.ВыгрузитьКолонку("Родственник");
			//	ОбщегоНазначения.ДобавитьВМассив(МассивКлиентов, МассивРодственников);
			//	
			// КонецЕсли;
			
			// ВсеОрганизации = Справочники.Сотрудники.ПолучитьВсеОрганизацииДляСотрудника(ПараметрыСеанса.ТекущийПользователь);
			
			ЗапросПоДолгам = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВзаиморасчетыСКонтрагентамиОстатки.ДокументРеализации КАК Основание,
			|	-ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток КАК Сумма,
			|	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент КАК Контрагент
			|ПОМЕСТИТЬ ВТ_ДолгиОснование
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
			|			,
			|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
			|				И Контрагент = &Контрагент
			|				И ДокументРеализации <> НЕОПРЕДЕЛЕНО
			|				И ДокументРеализации <> ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)) КАК ВзаиморасчетыСКонтрагентамиОстатки
			|ГДЕ
			|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток < 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВзаиморасчетыСКонтрагентамиОстатки.ДокументАванса,
			|	-ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток,
			|	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
			|			,
			|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
			|				И Контрагент = &Контрагент
			|				И ДокументРеализации = НЕОПРЕДЕЛЕНО
			|				И ДокументАванса <> НЕОПРЕДЕЛЕНО
			|				И ДокументРеализации <> ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)) КАК ВзаиморасчетыСКонтрагентамиОстатки
			|ГДЕ
			|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток < 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МИНИМУМ(ВзаиморасчетыСКонтрагентами.Регистратор.Дата) КАК Дата,
			|	ВзаиморасчетыСКонтрагентами.Регистратор КАК Основание
			|ПОМЕСТИТЬ ВТ_ДолгиДата
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыСКонтрагентами КАК ВзаиморасчетыСКонтрагентами
			|ГДЕ
			|	ВзаиморасчетыСКонтрагентами.Регистратор В
			|			(ВЫБРАТЬ
			|				ВТ_ДолгиОснование.Основание
			|			ИЗ
			|				ВТ_ДолгиОснование КАК ВТ_ДолгиОснование)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВзаиморасчетыСКонтрагентами.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ДолгиОснование.Основание КАК Основание,
			|	ВТ_ДолгиОснование.Сумма КАК Сумма,
			|	ВТ_ДолгиОснование.Контрагент КАК Контрагент,
			|	ВТ_ДолгиДата.Дата КАК Дата
			|ИЗ
			|	ВТ_ДолгиОснование КАК ВТ_ДолгиОснование
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДолгиДата КАК ВТ_ДолгиДата
			|		ПО ВТ_ДолгиОснование.Основание = ВТ_ДолгиДата.Основание
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата");
			
			ЗапросПоДолгам.УстановитьПараметр("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
			ЗапросПоДолгам.УстановитьПараметр("Контрагент"		  , ВладелецСсылка);
			// Запрос.УстановитьПараметр("Период"        , КонецДня(ТекущаяДатаСеанса()));
			// ТаблицаДолгов = ЗапросПоДолгам.Выполнить().Выгрузить();
									
			Форма.ДолгиСуществующие.Загрузить(ЗапросПоДолгам.Выполнить().Выгрузить());		
			
			#КонецОбласти 
			
		ИначеЕсли ЭлементРодитель = "ГруппаКартыСуществующие" Тогда	
			
			#Область ЗАПОЛНЕНИЕ_ТАБЛИЦЫ_КАРТАМИ
			
			Форма.КартыСуществующие.Очистить();
			
			Если НЕ ЗначениеЗаполнено(ВладелецСсылка) Тогда 
				Продолжить;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Карты.Ссылка КАК КартаСсылка,
			|	Карты.ТипКода КАК ТипКода,
			|	Карты.ВидКарты КАК ВидКарты,
			|	Карты.КодКарты КАК КодКарты,
			|	Карты.ВнутреннийКодКарты КАК ВнутреннийКодКарты
			|ИЗ
			|	Справочник.Карты КАК Карты
			|ГДЕ
			|	Карты.ВладелецКарты = &ВладелецКарты
			|	И НЕ Карты.ПометкаУдаления";
			
			Запрос.УстановитьПараметр("ВладелецКарты",	ВладелецСсылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Форма.КартыСуществующие.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЦикла;
			
			#КонецОбласти    
			
		ИначеЕсли ЭлементРодитель = "ГруппаБудущиеСобытияКлиента" Тогда
			
			#Область ЗАПОЛНЕНИЕ_БУДУЩИХ_СОБЫТИЙ_КОНТРАГЕНТА
			
			// НУЖНЫ УСЛОВИЯ НА ДРУГИЕ СТАТУСЫ ????
			
			МассивКлиентов = Новый Массив;
			МассивКлиентов.Добавить(ВладелецСсылка);
						
			ЗапросПоБудущимСобытиям = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Услуги.Ссылка КАК Событие
			|ПОМЕСТИТЬ ВТСобытий
			|ИЗ
			|	Документ.Событие.Услуги КАК Услуги
			|ГДЕ
			|	Услуги.Ссылка.Проведен
			|	И НЕ Услуги.Ссылка.ПометкаУдаления
			|	И НЕ Услуги.Ссылка.Статус.Ссылка В (ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОкончен))
			|	И Услуги.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
			|	И НЕ Услуги.Ссылка = &ИсключаемоеСобытие
			|	И Услуги.Ссылка.Контрагент = &Контрагент
			|	И Услуги.ДатаНачала > &ТекущаяДата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СобытиеУслуги.Ссылка КАК Событие,
			|	МИНИМУМ(СобытиеУслуги.ДатаНачала) КАК ДатаСобытия,
			|	СобытиеУслуги.Ссылка.Врач КАК Сотрудник
			|ИЗ
			|	ВТСобытий КАК ВТСобытий
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Событие.Услуги КАК СобытиеУслуги
			|		ПО ВТСобытий.Событие = СобытиеУслуги.Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	СобытиеУслуги.Ссылка,
			|	СобытиеУслуги.Ссылка.Врач
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаСобытия");
					
			ЗапросПоБудущимСобытиям.УстановитьПараметр("СтруктурнаяЕдиница"	, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
			ЗапросПоБудущимСобытиям.УстановитьПараметр("Контрагент"			, ВладелецСсылка);
			ЗапросПоБудущимСобытиям.УстановитьПараметр("ТекущаяДата"		, ТекущаяДатаСервера());
			ЗапросПоБудущимСобытиям.УстановитьПараметр("ИсключаемоеСобытие"	, Форма.Объект.Ссылка);
			
			Форма.БудущиеСобытия.Загрузить(ЗапросПоБудущимСобытиям.Выполнить().Выгрузить());		
			
			#КонецОбласти		
			
		ИначеЕсли ЭлементРодитель = "ГруппаПромокодыСуществующие" Тогда 
			
			#Область ЗАПОЛНЕНИЕ_ТАБЛИЦЫ_ПРОМОКОДОМ             
			
			Форма.ПромокодыСуществующие.Очистить();
			
			Если НЕ ЗначениеЗаполнено(ВладелецСсылка) Тогда
				Продолжить;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Промокоды.Промокод КАК Промокод,
			|	Промокоды.Вид.Ссылка КАК ПромокодСсылка,
			|	Промокоды.Активен КАК Активен
			|ИЗ
			|	РегистрСведений.Промокоды КАК Промокоды
			|ГДЕ
			|	Промокоды.Владелец = &Владелец";
			
			Запрос.УстановитьПараметр("Владелец", ВладелецСсылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Форма.ПромокодыСуществующие.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЦикла;
			
			#КонецОбласти 

		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//  Процедура - Обновить элементы дополнительной информации
// 
//  Параметры:
//   Форма			 - 	 - 
//   МассивРодителей	 - 	 - 
// 
Процедура ОбновитьЭлементыДополнительнойИнформации(Форма, ВладелецСсылка, МассивРодителей, ЕстьРеквизитОплаченоПоРегистру) Экспорт
	
	Элементы = Форма.Элементы;
	ЭтоФормаСотрудника = Форма.ИмяФормы = "Справочник.Сотрудники.Форма.ФормаЭлемента";
	
	Если ТипЗнч(ВладелецСсылка) = Тип("СправочникСсылка.Сотрудники")Тогда
		ОтступОтЛевогоКрая = 9;
	Иначе
		ОтступОтЛевогоКрая = 1;
	КонецЕсли;
	ШиринаПредставления = ?(Не ЭтоФормаСотрудника, 29, 46);
	
	//	ЭтоМобильныйКлиент = ОбщегоНазначенияКлиентСервер.ЭтоМобильныйКлиент();
	
	Для Каждого ЭлементРодитель Из МассивРодителей Цикл
		
		ГруппаРодитель = Элементы.Найти(ЭлементРодитель);
		Если ГруппаРодитель = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОчиститьГруппуОтСозданныхЭлементов(Элементы, ГруппаРодитель);
		 		
		Если ЭлементРодитель = "ГруппаУдостоверенияЛичностиСуществующие" Тогда 
			
			#Область СОЗДАНИЕ_ЭЛЕМЕНТОВ_УДОСТОВЕРЕНИЯ_ЛИЧНОСТИ
			
			Для Каждого СтрокаТЗ Из Форма.УдостоверенияЛичностиСуществующие Цикл
				
				ИДСтроки = СтрокаТЗ.ПолучитьИдентификатор();
				
				//  Создаем группу
				// --------------------------------------------------------------------------------------------		
				ГруппаУдостоверенияЛичности = Элементы.Добавить("ГруппаУдостоверенияЛичностиСуществующие_" + ИДСтроки, Тип("ГруппаФормы"), ГруппаРодитель);
				ГруппаУдостоверенияЛичности.Вид 				= ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаУдостоверенияЛичности.Заголовок 			= ГруппаУдостоверенияЛичности.Имя;
				ГруппаУдостоверенияЛичности.Отображение 		= ОтображениеОбычнойГруппы.Нет;
				ГруппаУдостоверенияЛичности.Группировка 		= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
				ГруппаУдостоверенияЛичности.ОтображатьЗаголовок = Ложь;				
				// ГруппаУдостоверенияЛичности.ВертикальноеПоложениеПодчиненных 	= ВертикальноеПоложениеЭлемента.Центр;
				
				ДекорацияФормы_Заглушка = Элементы.Добавить("УдостоверенияЛичностиЗаглушка_" + ИДСтроки, Тип("ДекорацияФормы"), ГруппаУдостоверенияЛичности);
				ДекорацияФормы_Заглушка.Вид 						= ВидДекорацииФормы.Надпись;
				ДекорацияФормы_Заглушка.Заголовок 					= "";
				ДекорацияФормы_Заглушка.Гиперссылка 				= Истина;
				ДекорацияФормы_Заглушка.ЦветТекста 					= Новый Цвет(100, 100, 100);
				ДекорацияФормы_Заглушка.АвтоМаксимальнаяШирина    	= Ложь;
				ДекорацияФормы_Заглушка.Ширина 						= ОтступОтЛевогоКрая;
				ДекорацияФормы_Заглушка.МаксимальнаяШирина       	= ОтступОтЛевогоКрая;
				ДекорацияФормы_Заглушка.ГоризонтальноеПоложение   	= ГоризонтальноеПоложениеЭлемента.Лево;
				ДекорацияФормы_Заглушка.РастягиватьПоГоризонтали  	= Истина;
				ДекорацияФормы_Заглушка.Гиперссылка				  	= Ложь;
				
				//  Создаем представление
				// --------------------------------------------------------------------------------------------		
				ДекорацияФормы_Представление = Элементы.Добавить("УдостоверенияЛичностиСуществующие_" + ИДСтроки, Тип("ДекорацияФормы"), ГруппаУдостоверенияЛичности);
				ДекорацияФормы_Представление.Вид 						= ВидДекорацииФормы.Надпись;
				ДекорацияФормы_Представление.Заголовок                  = СформироватьПредставлениеЭлемента(Форма, СтрокаТЗ, ЭлементРодитель);
				ДекорацияФормы_Представление.Гиперссылка 				= Истина;
				ДекорацияФормы_Представление.ЦветТекста 				= Новый Цвет(100, 100, 100);
				// ДекорацияФормы_Представление.Шрифт 						= Новый Шрифт("Verdana" , 8, , Истина);
				ДекорацияФормы_Представление.АвтоМаксимальнаяШирина    	= Ложь;
				ДекорацияФормы_Представление.МаксимальнаяШирина        	= 55;
				ДекорацияФормы_Представление.ГоризонтальноеПоложение   	= ГоризонтальноеПоложениеЭлемента.Лево;
				ДекорацияФормы_Представление.РастягиватьПоГоризонтали  	= Истина;
				
				ДекорацияФормы_Представление.УстановитьДействие("Нажатие", "Подключаемый_ДекорацияФормы_Представление_Нажатие");
				
			КонецЦикла;
			
			#КонецОбласти
			
		ИначеЕсли ЭлементРодитель = "ГруппаПолисыСуществующие" Тогда 
			
			#Область СОЗДАНИЕ_ЭЛЕМЕНТОВ_ПОЛИСЫ_МЕДИЦИНСКОГО_СТРАХОВАНИЯ
			
			Для Каждого СтрокаТЗ Из Форма.ПолисыСуществующие Цикл
				
				ИДСтроки = СтрокаТЗ.ПолучитьИдентификатор();
				
				//  Создаем группу
				// --------------------------------------------------------------------------------------------		
				ГруппаПолисыКонтрагента = Элементы.Добавить("ГруппаПолисКонтрагента_" + ИДСтроки, Тип("ГруппаФормы"), ГруппаРодитель);
				ГруппаПолисыКонтрагента.Вид 								= ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаПолисыКонтрагента.Отображение 						= ОтображениеОбычнойГруппы.Нет;
				ГруппаПолисыКонтрагента.Группировка 						= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
				ГруппаПолисыКонтрагента.ОтображатьЗаголовок 				= Ложь;	
				
				//  Создаем заглушку
				// --------------------------------------------------------------------------------------------					
				ДекорацияФормы_Заглушка = Элементы.Добавить("ПолисКонтрагентаЗаглушка_" + ИДСтроки, Тип("ДекорацияФормы"), ГруппаПолисыКонтрагента);
				ДекорацияФормы_Заглушка.Вид 						= ВидДекорацииФормы.Надпись;
				ДекорацияФормы_Заглушка.Заголовок 					= "";
				ДекорацияФормы_Заглушка.ЦветТекста 					= Новый Цвет(100, 100, 100);
				ДекорацияФормы_Заглушка.АвтоМаксимальнаяШирина    	= Ложь;
				ДекорацияФормы_Заглушка.МаксимальнаяШирина       	= ОтступОтЛевогоКрая;
				ДекорацияФормы_Заглушка.ГоризонтальноеПоложение   	= ГоризонтальноеПоложениеЭлемента.Лево;
				ДекорацияФормы_Заглушка.РастягиватьПоГоризонтали  	= Истина;
				ДекорацияФормы_Заглушка.Гиперссылка				  	= Ложь;

				//  Создаем метки при необходимости
				// --------------------------------------------------------------------------------------------		
				
				ГруппаМеткиПолисов = Элементы.Добавить("ГруппаМеткиПолисов_" + ИДСтроки, Тип("ГруппаФормы"), ГруппаПолисыКонтрагента);
				ГруппаМеткиПолисов.Вид 								= ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаМеткиПолисов.Отображение 						= ОтображениеОбычнойГруппы.Нет;
				ГруппаМеткиПолисов.Группировка 						= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
				ГруппаМеткиПолисов.ОтображатьЗаголовок 				= Ложь;
				ГруппаМеткиПолисов.ГоризонтальныйИнтервал			= ИнтервалМеждуЭлементамиФормы.Нет;

				Если ЗначениеЗаполнено(СтрокаТЗ.СтраховаяКомпания) И ЗначениеЗаполнено(СтрокаТЗ.СтраховаяКомпания.КраткоеНаименование) Тогда
					
					ГруппаАльфа = Элементы.Добавить("ГруппаАльфа_" + ИДСтроки, Тип("ГруппаФормы"), ГруппаМеткиПолисов);
					ГруппаАльфа.Вид 								= ВидГруппыФормы.ОбычнаяГруппа;
					ГруппаАльфа.Отображение 						= ОтображениеОбычнойГруппы.Нет;
					ГруппаАльфа.Группировка 						= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
					ГруппаАльфа.ОтображатьЗаголовок 				= Ложь;	

					ФонМетки = ?(ЗначениеЗаполнено(СтрокаТЗ.СтраховаяКомпания.ЦветФонаМетки), ЗначениеИзСтрокиВнутр(СтрокаТЗ.СтраховаяКомпания.ЦветФонаМетки), WebЦвета.СеребристоСерый); 
					ГруппаАльфа.ЦветФона  = ФонМетки; 

					ДекорацияФормы_Альфа = Элементы.Добавить("ПолисАльфа_" + ИДСтроки, Тип("ДекорацияФормы"), ГруппаАльфа);
					ДекорацияФормы_Альфа.Вид 						= ВидДекорацииФормы.Надпись;
					ДекорацияФормы_Альфа.ГоризонтальноеПоложение   	= ГоризонтальноеПоложениеЭлемента.Лево;
					ДекорацияФормы_Альфа.Гиперссылка			  	= Ложь;
 					ДекорацияФормы_Альфа.ЦветТекста  				= ?(СтрокаТЗ.СтраховаяКомпания.ЦветТекстаБелый, Новый Цвет(255,255,255), Новый Цвет(77,77,77));
					ДекорацияФормы_Альфа.Заголовок					= СтрокаТЗ.СтраховаяКомпания.КраткоеНаименование;

				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаТЗ.Полис.Договор.ПрограммаСтрахования) Тогда

					ПрограммаСтрахования = СтрокаТЗ.Полис.Договор.ПрограммаСтрахования;
					
					ГруппаВидДоговора = Элементы.Добавить("ГруппаВидДоговора_" + ИДСтроки, Тип("ГруппаФормы"), ГруппаМеткиПолисов);
					ГруппаВидДоговора.Вид 								= ВидГруппыФормы.ОбычнаяГруппа;
					ГруппаВидДоговора.Отображение 						= ОтображениеОбычнойГруппы.Нет;
					ГруппаВидДоговора.Группировка 						= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
					ГруппаВидДоговора.ОтображатьЗаголовок 				= Ложь;
					
					ДанныеПрограммыСтрахования = Справочники.ПрограммыСтрахования.ПолучитьТекстЦветФонаИТекста(ПрограммаСтрахования); 

					ГруппаВидДоговора.ЦветФона  = ДанныеПрограммыСтрахования.ЦветФОна; 

					ДекорацияФормы_ВидДоговора = Элементы.Добавить("ВидДоговора_" + ИДСтроки, Тип("ДекорацияФормы"), ГруппаВидДоговора);
					ДекорацияФормы_ВидДоговора.Вид 						= ВидДекорацииФормы.Надпись;
					ДекорацияФормы_ВидДоговора.ГоризонтальноеПоложение  = ГоризонтальноеПоложениеЭлемента.Лево;
					ДекорацияФормы_ВидДоговора.Гиперссылка			  	= Ложь;
 					ДекорацияФормы_ВидДоговора.ЦветТекста  				= ДанныеПрограммыСтрахования.ЦветТекста;
					ДекорацияФормы_ВидДоговора.Заголовок				= ДанныеПрограммыСтрахования.Текст;

				КонецЕсли;
				//  Создаем представление
				// --------------------------------------------------------------------------------------------		
				ДекорацияФормы_Представление = Элементы.Добавить("ПолисКонтрагента_" + ИДСтроки, Тип("ДекорацияФормы"), ГруппаПолисыКонтрагента);
				ДекорацияФормы_Представление.Вид 						= ВидДекорацииФормы.Надпись;
				ДекорацияФормы_Представление.Заголовок                  = СформироватьПредставлениеЭлемента(Форма, СтрокаТЗ, ЭлементРодитель);
				ДекорацияФормы_Представление.Гиперссылка 				= Истина;
				ДекорацияФормы_Представление.ЦветТекста 				= Новый Цвет(100, 100, 100);
				ДекорацияФормы_Представление.АвтоМаксимальнаяШирина    	= Ложь;
				ДекорацияФормы_Представление.МаксимальнаяШирина        	= 55;
				ДекорацияФормы_Представление.ГоризонтальноеПоложение   	= ГоризонтальноеПоложениеЭлемента.Лево;
				ДекорацияФормы_Представление.РастягиватьПоГоризонтали  	= Истина;				
				
				ДекорацияФормы_Представление.УстановитьДействие("Нажатие", "Подключаемый_ДекорацияФормы_Представление_Нажатие");
				
			КонецЦикла;
			
			#КонецОбласти
			
		ИначеЕсли ЭлементРодитель = "ГруппаСкидкиСуществующие" Тогда	
			
			#Область СОЗДАНИЕ_ЭЛЕМЕНТОВ_СКИДКИ
			
			СимвольныйКод = ОбщегоНазначенияСтоматология.ПолучитьСимвольноеПредставлениеВалюты();
			Для Каждого СтрокаТЗ Из Форма.СкидкиСуществующие Цикл
				
				ИДСтроки = СтрокаТЗ.ПолучитьИдентификатор();
				
				//  Создаем группу
				// --------------------------------------------------------------------------------------------		
				ГруппаСкидкиСуществующие = Элементы.Добавить("ГруппаСкидкиСуществующие_" + ИДСтроки, Тип("ГруппаФормы"), ГруппаРодитель);
				ГруппаСкидкиСуществующие.Вид 				= ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаСкидкиСуществующие.Заголовок 			= ГруппаСкидкиСуществующие.Имя;
				ГруппаСкидкиСуществующие.Отображение 		= ОтображениеОбычнойГруппы.Нет;
				ГруппаСкидкиСуществующие.Группировка 		= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
				ГруппаСкидкиСуществующие.ОтображатьЗаголовок = Ложь;				
				
				ДекорацияФормы_Заглушка = Элементы.Добавить("СкидкиЗаглушка_" + ИДСтроки, Тип("ДекорацияФормы"), ГруппаСкидкиСуществующие);
				ДекорацияФормы_Заглушка.Вид 						= ВидДекорацииФормы.Надпись;
				ДекорацияФормы_Заглушка.Заголовок 					= "";
				ДекорацияФормы_Заглушка.ЦветТекста 					= Новый Цвет(100, 100, 100);
				ДекорацияФормы_Заглушка.АвтоМаксимальнаяШирина    	= Ложь;
				ДекорацияФормы_Заглушка.Ширина 						= ОтступОтЛевогоКрая;
				ДекорацияФормы_Заглушка.МаксимальнаяШирина       	= ОтступОтЛевогоКрая;
				ДекорацияФормы_Заглушка.ГоризонтальноеПоложение   	= ГоризонтальноеПоложениеЭлемента.Лево;
				ДекорацияФормы_Заглушка.РастягиватьПоГоризонтали  	= Истина;
				ДекорацияФормы_Заглушка.Гиперссылка				  	= Ложь;
				
				//  Создаем тип скидки
				// --------------------------------------------------------------------------------------------		
				ДекорацияФормы_ТипСкидки = Элементы.Добавить("СкидкиТипСкидки_" + ИДСтроки, Тип("ДекорацияФормы"), ГруппаСкидкиСуществующие);
				ДекорацияФормы_ТипСкидки.Вид 						 = ВидДекорацииФормы.Надпись;
				ДекорацияФормы_ТипСкидки.Заголовок                   = СтрокаТЗ.ТипСкидки;
				ДекорацияФормы_ТипСкидки.ЦветТекста 				 = Новый Цвет(100, 100, 100);
				ДекорацияФормы_ТипСкидки.АвтоМаксимальнаяШирина      = Ложь;
				ДекорацияФормы_ТипСкидки.Ширина 					 = 9;
				ДекорацияФормы_ТипСкидки.МаксимальнаяШирина        	 = 9;
				ДекорацияФормы_ТипСкидки.ГоризонтальноеПоложение     = ГоризонтальноеПоложениеЭлемента.Лево;
				ДекорацияФормы_ТипСкидки.РастягиватьПоГоризонтали    = Истина;
				
				//  Создаем декорация выравнивание элементов
				// --------------------------------------------------------------------------------------------
				ДекорацияФормы_Заглушка = Элементы.Добавить("СкидкиВыравнивание_" + ИДСтроки, Тип("ДекорацияФормы"), ГруппаСкидкиСуществующие);
				ДекорацияФормы_Заглушка.Вид 						 = ВидДекорацииФормы.Надпись;
				ДекорацияФормы_Заглушка.Заголовок 					 = "";
				ДекорацияФормы_Заглушка.ЦветТекста 					 = Новый Цвет(100, 100, 100);
				ДекорацияФормы_Заглушка.АвтоМаксимальнаяШирина    	 = Ложь;
				ДекорацияФормы_Заглушка.Ширина 						 = 5;
				ДекорацияФормы_Заглушка.МаксимальнаяШирина       	 = 5;
				ДекорацияФормы_Заглушка.ГоризонтальноеПоложение   	 = ГоризонтальноеПоложениеЭлемента.Лево;
				ДекорацияФормы_Заглушка.РастягиватьПоГоризонтали  	 = Истина;
				ДекорацияФормы_Заглушка.Гиперссылка				  	 = Ложь;
				
				//  Создаем представление
				// --------------------------------------------------------------------------------------------		
				ДекорацияФормы_Представление = Элементы.Добавить("СкидкиСуществующие_" + ИДСтроки, Тип("ДекорацияФормы"), ГруппаСкидкиСуществующие);
				ДекорацияФормы_Представление.Вид 						= ВидДекорацииФормы.Надпись;
				ДекорацияФормы_Представление.Заголовок                  = СтрокаТЗ.Представление;
				ДекорацияФормы_Представление.Гиперссылка 				= Истина;
				ДекорацияФормы_Представление.ЦветТекста 				= Новый Цвет(100, 100, 100);
				ДекорацияФормы_Представление.АвтоМаксимальнаяШирина    	= Ложь;
				ДекорацияФормы_Представление.МаксимальнаяШирина        	= 35;
				ДекорацияФормы_Представление.ГоризонтальноеПоложение   	= ГоризонтальноеПоложениеЭлемента.Лево;
				ДекорацияФормы_Представление.РастягиватьПоГоризонтали  	= Истина;
				
				ДекорацияФормы_Представление.УстановитьДействие("Нажатие", "Подключаемый_ДекорацияФормы_Представление_Нажатие");
				
				//  Создаем представление значения
				// --------------------------------------------------------------------------------------------		
				Если СтрокаТЗ.ЗначениеСкидкиНаценки <> 0 Тогда  				
					
					ДекорацияФормы_ПредставлениеОстатка = Элементы.Добавить("ДекорацияФормыПредставлениеЗначение_" + ИДСтроки, Тип("ДекорацияФормы"), ГруппаСкидкиСуществующие);
					ДекорацияФормы_ПредставлениеОстатка.Вид 							= ВидДекорацииФормы.Надпись;
					ДекорацияФормы_ПредставлениеОстатка.Заголовок                  		= Формат(СтрокаТЗ.ЗначениеСкидкиНаценки, "ЧЦ=15; ЧДЦ=2") + " " + ?(СтрокаТЗ.СпособПредоставления = Перечисления.СпособПредоставленияСкидки.Сумма, СимвольныйКод, "%");
					ДекорацияФормы_ПредставлениеОстатка.Ширина 							= 9;
					ДекорацияФормы_ПредставлениеОстатка.Высота 							= 1;
					ДекорацияФормы_ПредставлениеОстатка.ЦветТекста 						= Новый Цвет(100, 100, 100);				
					ДекорацияФормы_ПредставлениеОстатка.ГоризонтальноеПоложение			= ГоризонтальноеПоложениеЭлемента.Право;				
					ДекорацияФормы_ПредставлениеОстатка.ГоризонтальноеПоложениеВГруппе 	= ГоризонтальноеПоложениеЭлемента.Право;
					ДекорацияФормы_ПредставлениеОстатка.РастягиватьПоВертикали 			= Ложь;
					ДекорацияФормы_ПредставлениеОстатка.РастягиватьПоГоризонтали		= ?(СтрокаТЗ.ТипСкидки = "Общая", Истина, Ложь);
					
				КонецЕсли;
				
				Если СтрокаТЗ.ТипСкидки = "Персональная" Тогда
					
					КнопкаУдаленияСкидки                     = Элементы.Добавить("УдалитьСкидку_" + ИДСтроки, Тип("КнопкаФормы"), ГруппаСкидкиСуществующие);
					КнопкаУдаленияСкидки.Отображение         = ОтображениеКнопки.Картинка;
					КнопкаУдаленияСкидки.ОтображениеФигуры 	 = ОтображениеФигурыКнопки.Нет;
					КнопкаУдаленияСкидки.ИмяКоманды          = "УдалитьСтрокуСкидка";
					
				КонецЕсли;
				
			КонецЦикла;
			
			#КонецОбласти
			
		ИначеЕсли ЭлементРодитель = "ГруппаЛицевыеБонусныеСчетаСуществующие" Тогда 
			
			#Область СОЗДАНИЕ_ЭЛЕМЕНТОВ_ЛИЦЕВЫХ_БОНУСНЫХ_СЧЕТОВ_И_АВАНСОВ
			
			СимвольныйКод = ОбщегоНазначенияСтоматология.ПолучитьСимвольноеПредставлениеВалюты();
						
			Для Каждого СтрокаТЗ Из Форма.ТаблицаЛицевыхБонусныхСчетов Цикл
				
				ИндексСтроки = Форма.ТаблицаЛицевыхБонусныхСчетов.Индекс(СтрокаТЗ);
				
				//  Создаем группу
				// --------------------------------------------------------------------------------------------		
				ГруппаЛицевойБонусныйСчет = Элементы.Добавить("Группа_Лицевой_Бонусный_Счет_Контрагента_" + ИндексСтроки, Тип("ГруппаФормы"), ГруппаРодитель);
				ГруппаЛицевойБонусныйСчет.Вид 								= ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаЛицевойБонусныйСчет.Заголовок 						= ГруппаЛицевойБонусныйСчет.Имя;
				ГруппаЛицевойБонусныйСчет.Отображение 						= ОтображениеОбычнойГруппы.Нет;
				ГруппаЛицевойБонусныйСчет.Группировка 						= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
				ГруппаЛицевойБонусныйСчет.ОтображатьЗаголовок 				= Ложь;	
				// ГруппаЛицевойБонусныйСчет.Ширина 							= 45;
				// ГруппаЛицевойБонусныйСчет.РастягиватьПоГоризонтали 			= Ложь;
				
				//  Создаем заглушку
				// --------------------------------------------------------------------------------------------					
				ДекорацияФормы_Заглушка = Элементы.Добавить("Лицевой_Бонусный_Счет_Контрагента_Заглушка_" + ИндексСтроки, Тип("ДекорацияФормы"), ГруппаЛицевойБонусныйСчет);
				ДекорацияФормы_Заглушка.Вид 						= ВидДекорацииФормы.Надпись;
				ДекорацияФормы_Заглушка.Заголовок 					= "";
				ДекорацияФормы_Заглушка.Гиперссылка 				= Истина;
				ДекорацияФормы_Заглушка.ЦветТекста 					= Новый Цвет(100, 100, 100);
				ДекорацияФормы_Заглушка.АвтоМаксимальнаяШирина    	= Ложь;
				ДекорацияФормы_Заглушка.Ширина 						= ОтступОтЛевогоКрая;
				ДекорацияФормы_Заглушка.МаксимальнаяШирина       	= ОтступОтЛевогоКрая;
				ДекорацияФормы_Заглушка.ГоризонтальноеПоложение   	= ГоризонтальноеПоложениеЭлемента.Лево;
				ДекорацияФормы_Заглушка.РастягиватьПоГоризонтали  	= Истина;
				ДекорацияФормы_Заглушка.Гиперссылка				  	= Ложь;
				
				//  Создаем представление
				// --------------------------------------------------------------------------------------------		
				ДекорацияФормы_Представление = Элементы.Добавить("Лицевой_Бонусный_Счет_Контрагента_" + ИндексСтроки, Тип("ДекорацияФормы"), ГруппаЛицевойБонусныйСчет);
				ДекорацияФормы_Представление.Вид 						= ВидДекорацииФормы.Надпись;
				ДекорацияФормы_Представление.Заголовок                  = СтрокаТЗ.Представление + ?(ЗначениеЗаполнено(СтрокаТЗ.СтепеньРодства), "(" + СокрЛП(Строка(СтрокаТЗ.СтепеньРодства)) + ")", "");
				ДекорацияФормы_Представление.Гиперссылка 				= Истина;
				ДекорацияФормы_Представление.ЦветТекста 				= Новый Цвет(100, 100, 100);
				ДекорацияФормы_Представление.АвтоМаксимальнаяШирина    	= Ложь;
				ДекорацияФормы_Представление.Ширина 					= 35;
				ДекорацияФормы_Представление.МаксимальнаяШирина        	= 51;
				ДекорацияФормы_Представление.ГоризонтальноеПоложение   	= ГоризонтальноеПоложениеЭлемента.Лево;
				ДекорацияФормы_Представление.РастягиватьПоГоризонтали  	= Истина;
				
				ДекорацияФормы_Представление.УстановитьДействие("Нажатие", "Подключаемый_ДекорацияФормы_Представление_Нажатие");
				
				//  Создаем представление остатка
				// --------------------------------------------------------------------------------------------		
				ДекорацияФормы_ПредставлениеОстатка = Элементы.Добавить("ДекорацияФормы_Представление_Остатка_" + ИндексСтроки, Тип("ДекорацияФормы"), ГруппаЛицевойБонусныйСчет);
				ДекорацияФормы_ПредставлениеОстатка.Вид 							= ВидДекорацииФормы.Надпись;
				ДекорацияФормы_ПредставлениеОстатка.Заголовок                  		= Формат(СтрокаТЗ.СуммаОстаток, "ЧЦ=15; ЧДЦ=2") + " " + СимвольныйКод;
				ДекорацияФормы_ПредставлениеОстатка.Ширина 							= 11;
				ДекорацияФормы_ПредставлениеОстатка.Высота 							= 1;
				ДекорацияФормы_ПредставлениеОстатка.ЦветТекста 						= Новый Цвет(100, 100, 100);
				ДекорацияФормы_ПредставлениеОстатка.ГоризонтальноеПоложение			= ГоризонтальноеПоложениеЭлемента.Право;				
				ДекорацияФормы_ПредставлениеОстатка.ГоризонтальноеПоложениеВГруппе 	= ГоризонтальноеПоложениеЭлемента.Право;
				ДекорацияФормы_ПредставлениеОстатка.РастягиватьПоВертикали 			= Ложь;
				ДекорацияФормы_ПредставлениеОстатка.РастягиватьПоГоризонтали		= Ложь;
				
			КонецЦикла;
			
			#КонецОбласти  			
			
		ИначеЕсли ЭлементРодитель = "ГруппаРодственникиСуществующие" Тогда 
			
			#Область СОЗДАНИЕ_ЭЛЕМЕНТОВ_РОДСТВЕННИКИ
			
			Для Каждого СтрокаТЗ Из Форма.РодственникиСуществующие Цикл
				
				ИндексСтроки = Формат(Форма.РодственникиСуществующие.Индекс(СтрокаТЗ), "ЧН=; ЧГ=0");
				
				// Создаем группу
				// --------------------------------------------------------------------------------------------		
				ГруппаРодственникиСуществующие = Элементы.Добавить("ГруппаРодственникиСуществующие" + ИндексСтроки, Тип("ГруппаФормы"), ГруппаРодитель);
				ГруппаРодственникиСуществующие.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаРодственникиСуществующие.Заголовок 			= ГруппаРодственникиСуществующие.Имя;
				ГруппаРодственникиСуществующие.Отображение 			= ОтображениеОбычнойГруппы.Нет;
				ГруппаРодственникиСуществующие.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
				ГруппаРодственникиСуществующие.ОтображатьЗаголовок 	= Ложь;
				
				ДекорацияФормы_Заглушка = Элементы.Добавить("РодственникиЗаглушка_" + ИндексСтроки, Тип("ДекорацияФормы"), ГруппаРодственникиСуществующие);
				ДекорацияФормы_Заглушка.Вид 						= ВидДекорацииФормы.Надпись;
				ДекорацияФормы_Заглушка.Заголовок 					= "";
				ДекорацияФормы_Заглушка.Гиперссылка 				= Ложь;
				ДекорацияФормы_Заглушка.ЦветТекста 					= ЦветаСтиля.ТекстВторостепеннойНадписи;
				ДекорацияФормы_Заглушка.АвтоМаксимальнаяШирина    	= Ложь;
				ДекорацияФормы_Заглушка.Ширина 						= ОтступОтЛевогоКрая;
				ДекорацияФормы_Заглушка.МаксимальнаяШирина       	= ОтступОтЛевогоКрая;
				ДекорацияФормы_Заглушка.ГоризонтальноеПоложение   	= ГоризонтальноеПоложениеЭлемента.Лево;
				ДекорацияФормы_Заглушка.РастягиватьПоГоризонтали  	= Истина;
				
				КомпонентыПредставленияРодственника = Новый Массив;
				КомпонентыПредставленияРодственника.Добавить(Новый ФорматированнаяСтрока(СформироватьПредставлениеЭлемента(Форма, СтрокаТЗ, ЭлементРодитель) + " ", Новый Шрифт(,,,,Истина), Новый Цвет(95, 95, 95), , "ОткрытиеРодственникаИД_" + Строка(ИндексСтроки)));
				// Если НЕ ЭтоФормаИнтерфейсаРецепциониста И НЕ ЭтоФормаИнтерфейсаКассира И НЕ ЭтоФормаВыбораКонтрагентаТерминала Тогда 
				//	КомпонентыПредставленияРодственника.Добавить(Новый ФорматированнаяСтрока(БиблиотекаКартинок.Редактировать_16х16, , , , "РедактированиеРодственныхСвязейИД_" + Строка(ИндексСтроки)));
				// КонецЕсли;
				
				// Создаем представление
				// --------------------------------------------------------------------------------------------		
				ДекорацияФормы_Представление = Элементы.Добавить("РодственникиСуществующие_" + ИндексСтроки, Тип("ДекорацияФормы"), ГруппаРодственникиСуществующие);
				ДекорацияФормы_Представление.Вид 						= ВидДекорацииФормы.Надпись;
				ДекорацияФормы_Представление.Заголовок                  = Новый ФорматированнаяСтрока(КомпонентыПредставленияРодственника);
				ДекорацияФормы_Представление.АвтоМаксимальнаяШирина    	= Ложь;
				ДекорацияФормы_Представление.Ширина 					= ШиринаПредставления;//?(ЭтоФормаИнтерфейсаРецепциониста, 28, ШиринаПредставления);
				ДекорацияФормы_Представление.МаксимальнаяШирина        	= ШиринаПредставления;//?(ЭтоФормаИнтерфейсаРецепциониста, 28, ШиринаПредставления);
				ДекорацияФормы_Представление.ГоризонтальноеПоложение   	= ГоризонтальноеПоложениеЭлемента.Лево;
				ДекорацияФормы_Представление.РастягиватьПоГоризонтали  	= Истина;
				
				// ДекорацияФормы_Представление.УстановитьДействие("Нажатие"						, "Подключаемый_ДекорацияФормы_Представление_Нажатие");
				ДекорацияФормы_Представление.УстановитьДействие("ОбработкаНавигационнойСсылки"	, "Подключаемый_ДекорацияФормы_Представление_ОбработкаНавигационнойСсылки");
				
			КонецЦикла;
			
			#КонецОбласти
			
		ИначеЕсли ЭлементРодитель = "ГруппаПользовательИБСуществующий" Тогда 
			
			#Область СОЗДАНИЕ_ЭЛЕМЕНТОВ_РОДСТВЕННИКИ
			
			Для Каждого СтрокаТЗ Из Форма.ПользователиИБСуществующие Цикл
				
				ИндексСтроки = Формат(Форма.ПользователиИБСуществующие.Индекс(СтрокаТЗ), "ЧН=; ЧГ=0");
				
				// Создаем группу
				// --------------------------------------------------------------------------------------------		
				ГруппаПользователиИБСуществующие = Элементы.Добавить("ГруппаПользователиИБСуществующие" + ИндексСтроки, Тип("ГруппаФормы"), ГруппаРодитель);
				ГруппаПользователиИБСуществующие.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаПользователиИБСуществующие.Заголовок 				= ГруппаПользователиИБСуществующие.Имя;
				ГруппаПользователиИБСуществующие.Отображение 			= ОтображениеОбычнойГруппы.Нет;
				ГруппаПользователиИБСуществующие.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
				ГруппаПользователиИБСуществующие.ОтображатьЗаголовок 	= Ложь;
				
				ДекорацияФормы_Заглушка = Элементы.Добавить("ПользователиИБЗаглушка_" + ИндексСтроки, Тип("ДекорацияФормы"), ГруппаПользователиИБСуществующие);
				ДекорацияФормы_Заглушка.Вид 						= ВидДекорацииФормы.Надпись;
				ДекорацияФормы_Заглушка.Заголовок 					= "";
				ДекорацияФормы_Заглушка.Гиперссылка 				= Ложь;
				ДекорацияФормы_Заглушка.ЦветТекста 					= ЦветаСтиля.ТекстВторостепеннойНадписи;
				ДекорацияФормы_Заглушка.АвтоМаксимальнаяШирина    	= Ложь;
				ДекорацияФормы_Заглушка.Ширина 						= ОтступОтЛевогоКрая;
				ДекорацияФормы_Заглушка.МаксимальнаяШирина       	= ОтступОтЛевогоКрая;
				ДекорацияФормы_Заглушка.ГоризонтальноеПоложение   	= ГоризонтальноеПоложениеЭлемента.Лево;
				ДекорацияФормы_Заглушка.РастягиватьПоГоризонтали  	= Истина;
				
				КомпонентыПредставленияПользователяИБ = Новый Массив;
				КомпонентыПредставленияПользователяИБ.Добавить(Новый ФорматированнаяСтрока(СформироватьПредставлениеЭлемента(Форма, СтрокаТЗ, ЭлементРодитель) + " ", Новый Шрифт(,,,,Истина), Новый Цвет(95, 95, 95), , "ОткрытиеПользователяИБИД_" + Строка(ИндексСтроки)));
				
				
				// Создаем представление
				// --------------------------------------------------------------------------------------------		
				ДекорацияФормы_Представление = Элементы.Добавить("ПользователиИБСуществующие_" + ИндексСтроки, Тип("ДекорацияФормы"), ГруппаПользователиИБСуществующие);
				ДекорацияФормы_Представление.Вид 						= ВидДекорацииФормы.Надпись;
				ДекорацияФормы_Представление.Заголовок                  = Новый ФорматированнаяСтрока(КомпонентыПредставленияПользователяИБ);
				ДекорацияФормы_Представление.АвтоМаксимальнаяШирина    	= Ложь;
				ДекорацияФормы_Представление.Ширина 					= 20;//?(ЭтоФормаИнтерфейсаРецепциониста, 28, ШиринаПредставления);
				ДекорацияФормы_Представление.МаксимальнаяШирина        	= 20;//?(ЭтоФормаИнтерфейсаРецепциониста, 28, ШиринаПредставления);
				ДекорацияФормы_Представление.ГоризонтальноеПоложение   	= ГоризонтальноеПоложениеЭлемента.Лево;
				ДекорацияФормы_Представление.РастягиватьПоГоризонтали  	= Истина;
				ДекорацияФормы_Представление.Гиперссылка 				= Истина;
				
				
				// ДекорацияФормы_Представление.УстановитьДействие("ОбработкаНавигационнойСсылки"	, "Подключаемый_ДекорацияФормы_Представление_ОбработкаНавигационнойСсылки");
				ДекорацияФормы_Представление.УстановитьДействие("Нажатие", "Подключаемый_ДекорацияФормы_Представление_Нажатие");
				
			КонецЦикла;
			
			#КонецОбласти
			
		ИначеЕсли ЭлементРодитель = "ГруппаКабинетыСуществующие" Тогда 
			
			#Область СОЗДАНИЕ_ЭЛЕМЕНТОВ_КАБИНЕТЫ
			
			Для Каждого СтрокаТЗ Из Форма.КабинетыСуществующие Цикл
				
				УИДСтроки = СтрокаТЗ.ПОлучитьИдентификатор();
				
				СкопироватьЭлементФормыРекурсивно(Элементы.ГруппаКабинетыСуществующие_Шаблон, Элементы.ГруппаКабинетыСуществующие, УидСтроки, Форма); 
	
				Элементы["КабинетыПредставление_" + УидСтроки].Заголовок = ?(СтрокаТЗ.Основное, СокрП(Строка(СтрокаТЗ.Помещение)) + " (Основной)", СокрП(Строка(СтрокаТЗ.Помещение)));
				
			КонецЦикла;
			
			#КонецОбласти
			
		ИначеЕсли ЭлементРодитель = "ГруппаИнформацияПоОплатеПодробно" Тогда
		
		#Область СОЗДАНИЕ_ЭЛЕМЕНТОВ_ИНФОРМАЦИИ_ПО_ОПЛАТЕ
		
		ВсегоОплат 		= Форма.Информация_По_Оплате.Количество();
		ВсегоСтрок 		= ?(ВсегоОплат = 0, 0, ОбщегоНазначенияКлиентСерверСтоматология.ОкруглитьЧислоВверх(ВсегоОплат, 4) - 1);
		СтрокаЗаполнена = Истина;
		 		
		Для СчетчикСтрок = 0 По ВсегоСтрок Цикл
			
			Группа_Кнопки_ТипОплаты_Строка = СоздатьГруппуДляКнопокТипОплаты(Форма, ГруппаРодитель, СчетчикСтрок);
			
			Для Счетчик = 0 По ?(ВсегоОплат > 4, 3, ВсегоОплат - 1) Цикл
				
				Индекс = СчетчикСтрок * 4 + Счетчик;
				Если Индекс > ВсегоОплат - 1 Тогда
					СтрокаЗаполнена = Ложь;
					Прервать;
				КонецЕсли;
				
				СтрокаТЗ = Форма.Информация_По_Оплате[Индекс];
				Индекс   = Формат(Индекс, "ЧН=; ЧГ=0");
				
				// Создаем группу для кнопки --------------------------------------------------------------------------------------------		
				Группа_Кнопки_ТипОплаты = СоздатьГруппуФормы(Форма, "Группа_Кнопки_ТипОплаты_" + Индекс, Группа_Кнопки_ТипОплаты_Строка);
				Группа_Кнопки_ТипОплаты.ЦветФона = ?(ТипЗнч(СтрокаТЗ.ДокументОплаты) = Тип("ДокументСсылка.СписаниеДенежныхСредств") И СтрокаТЗ.ДокументОплаты.ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыКлиенту, Новый Цвет(250, 201, 188), Новый Цвет(208, 235, 194));
											
				Если Форма.Команды.Найти("Подключаемый_Открыть_Субъект_Оплаты_" + Индекс) = Неопределено Тогда
					Команда 			= Форма.Команды.Добавить("Подключаемый_Открыть_Субъект_Оплаты_" + Индекс);
					Команда.Заголовок 	= СформироватьПредставлениеЭлемента(Форма, СтрокаТЗ, ЭлементРодитель);
					Команда.Подсказка 	= Команда.Заголовок;
					Команда.Действие 	= "Подключаемый_ДекорацияФормы_Представление_Нажатие";
				КонецЕсли;
				
				Кнопка = Форма.Элементы.Добавить("Кнопка_Открыть_Субъект_Оплаты_" + Индекс, Тип("КнопкаФормы"), Группа_Кнопки_ТипОплаты);
				Кнопка.ИмяКоманды 				= "Подключаемый_Открыть_Субъект_Оплаты_" + Индекс;
				Кнопка.Заголовок 				= СформироватьПредставлениеЭлемента(Форма, СтрокаТЗ, ЭлементРодитель);;
				Кнопка.ОтображениеФигуры    	= ОтображениеФигурыКнопки.Нет;
				Кнопка.ЦветТекста 				= ЦветаСтиля.ТекстВторостепеннойНадписи;
				Кнопка.Шрифт 					= ШрифтыСтиля.ШрифтПодваловДокументов;
				Кнопка.Картинка					= ?(ОбщегоНазначенияСтоматология.ЕстьРеквизитФормы(СтрокаТЗ, "ОплатаПоСсылке"), ПолучитьКартинкуПШ(СтрокаТЗ.ОплатаПоСсылке), Кнопка.Картинка);
				Кнопка.Отображение				= ОтображениеКнопки.КартинкаИТекст;
				
				Если СтрокаТЗ.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.БонусныйСчет Тогда
					
					Группа_Кнопки_ТипОплаты.ЦветФона = Новый Цвет(237,237,237);
					
					КомандаУдалить = Форма.Команды.Найти("Подключаемый_УдалитьОплатуБонусом");
					
					Если КомандаУдалить = Неопределено Тогда
						КомандаУдалить 							 = Форма.Команды.Добавить("Подключаемый_УдалитьОплатуБонусом");
						КомандаУдалить.Заголовок 				 = Нстр("ru = 'Удалить оплату бонусом'; en = 'Delete bonus payment'");
						КомандаУдалить.Подсказка 				 = КомандаУдалить.Заголовок;
						КомандаУдалить.Действие					 = "Подключаемый_УдалитьОплатуБонусом";
						КомандаУдалить.ИзменяетСохраняемыеДанные = Истина;
					КонецЕсли;
					
					КнопкаУдалить = Форма.Элементы.Добавить("КнопкаУдалитьОплатуБонусом_" + Индекс, Тип("КнопкаФормы"), Группа_Кнопки_ТипОплаты);
					КнопкаУдалить.ИмяКоманды 		= КомандаУдалить.Имя;
					КнопкаУдалить.Заголовок 		= Нстр("ru = 'Удалить оплату бонусом'; en = 'Delete bonus payment'");
					КнопкаУдалить.Отображение		= ОтображениеКнопки.Картинка;
					КнопкаУдалить.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
					КнопкаУдалить.Картинка			= БиблиотекаКартинок.УдалениеДанных16;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если СтрокаЗаполнена И ВсегоОплат >= 4 Тогда // создаем новую строку
			ВсегоСтрок = ВсегоСтрок + 1;
			Группа_Кнопки_ТипОплаты_Строка = СоздатьГруппуДляКнопокТипОплаты(Форма, ГруппаРодитель, ВсегоСтрок);
		КонецЕсли;
		
		// Создаем группу для кнопки оплатить
		// ГруппаРодительДляКнопкиОплатить = Элементы.Найти("Группа_Кнопки_ТипОплаты_Строка" + ВсегоСтрок);
		// Группа_Кнопки_Оплатить 			= СоздатьГруппуФормы(Форма, "ГруппаДляКнопкиОплатить", ГруппаРодительДляКнопкиОплатить);
		// Группа_Кнопки_Оплатить.ЦветФона = Новый Цвет(244, 232, 159);
		// 				
		// Кнопка = Форма.Элементы.Добавить("КнопкаОплатитьРеализацию", Тип("КнопкаФормы"), Группа_Кнопки_Оплатить);
		// Кнопка.ИмяКоманды 				= "Оплатить";
		// Кнопка.Заголовок 				= НСтр("ru= 'Оплатить';en= 'Pay'");
		// Кнопка.ОтображениеФигуры    	= ОтображениеФигурыКнопки.Нет;
		// Кнопка.ЦветТекста 				= ЦветаСтиля.ТекстВторостепеннойНадписи;
		// Кнопка.Шрифт 					= Новый Шрифт(ШрифтыСтиля.ШрифтПодваловДокументов, 11);
		// Кнопка.Ширина						  = 11;
		//
		//// Управление видимостью кнопок оплатить
		// Если ТипЗнч(ВладелецСсылка) = Тип("ДокументСсылка.Реализация")
		//	ИЛИ ТипЗнч(ВладелецСсылка) = Тип("ДокументСсылка.Прием")
		//	ИЛИ ТипЗнч(ВладелецСсылка) = Тип("ДанныеФормыСтруктура")
		//	ИЛИ ТипЗнч(ВладелецСсылка) = Тип("ФормаКлиентскогоПриложения") Тогда
		//	
		//	Если ЕстьРеквизитОплаченоПоРегистру Тогда
		//		СуммаОплаченоПоРегистру = Форма.СуммаОплаченоПоРегистру;
		//	Иначе
		//		СуммаОплаченоПоРегистру = ?(Не ЗначениеЗаполнено(ВладелецСсылка.Ссылка), 0, РегистрыНакопления.Оплаты.ПолучитьСуммуОплатыПоДокументу(ВладелецСсылка.Ссылка));
		//	КонецЕсли;
		//	
		//	СкрытьКнопкуОплаты = ВладелецСсылка.Проведен И (СуммаОплаченоПоРегистру >= ВладелецСсылка.СуммаДокумента ИЛИ ВладелецСсылка.СуммаДокумента = 0);
		//	
		//	Элементы.ГруппаДляКнопкиОплатить.Видимость = Не СкрытьКнопкуОплаты;
		//	
		//	КнопкаОплатитьВПанелиЗадач = Элементы.Найти("ФормаОплатить");
		//	Если КнопкаОплатитьВПанелиЗадач <> Неопределено Тогда
		//		КнопкаОплатитьВПанелиЗадач.Видимость = Не СкрытьКнопкуОплаты;
		//	КонецЕсли;
		//	
		// КонецЕсли;
		#Область СОЗДАНИЕ_ЭЛЕМЕНТОВ_ПО_ПРОМОКОДУ       		
		
		Объект = Форма.Объект;
		Если (ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.Прием") ИЛИ ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.Реализация"))  И Объект.Промокод <> "" Тогда
			// Использован промокод  
			
			Группа_Кнопки_Промокод = Форма.Элементы.Добавить("Группа_Кнопки_Промокод", Тип("ГруппаФормы"), ГруппаРодитель);
			Группа_Кнопки_Промокод.Вид 				   = ВидГруппыФормы.ОбычнаяГруппа;
			Группа_Кнопки_Промокод.Заголовок 		   = Группа_Кнопки_Промокод.Имя;
			Группа_Кнопки_Промокод.Отображение 		   = ОтображениеОбычнойГруппы.Нет;
			Группа_Кнопки_Промокод.Группировка 		   = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			Группа_Кнопки_Промокод.ОтображатьЗаголовок = Ложь;
			Группа_Кнопки_Промокод.ЦветФона 		   = Новый Цвет(208, 235, 194);
			
			Если Форма.Элементы.Найти("Информация_По_Оплате") = Неопределено Тогда
				ИндексСтроки = 0;
			Иначе
				КоличествоОплат = Форма.Информация_По_Оплате.Количество();
				ИндексСтроки = ?(КоличествоОплат > 0, КоличествоОплат, ИндексСтроки); 
			КонецЕсли;
			
			Если Форма.Команды.Найти("Подключаемый_Открыть_Субъект_Промокода_" + ИндексСтроки) = Неопределено Тогда
				Команда 			= Форма.Команды.Добавить("Подключаемый_Открыть_Субъект_Промокода_" + ИндексСтроки);
				Команда.Заголовок 	= "Промокод: " + Объект.Промокод;					
				Команда.Действие 	= "Подключаемый_ДекорацияФормы_Представление_Нажатие_Промокода";
			КонецЕсли;
			
			Кнопка = Форма.Элементы.Добавить("Подключаемый_Открыть_Субъект_Промокода_" + ИндексСтроки, Тип("КнопкаФормы"), Группа_Кнопки_Промокод);
			Кнопка.ИмяКоманды 				= "Подключаемый_Открыть_Субъект_Промокода_" + ИндексСтроки;
			Кнопка.Заголовок 				= "Промокод: " + Объект.Промокод;
			Кнопка.ОтображениеФигуры    	= ОтображениеФигурыКнопки.Нет;				
			
			Если (РольДоступна("ПолныеПрава") Или РольДоступна("ДобавлениеИзменениеДокументовПродажи")) Тогда
				КнопкаУдалить = Форма.Элементы.Добавить("Кнопка_Удалить_Промокод_" + ИндексСтроки, Тип("КнопкаФормы"), Группа_Кнопки_Промокод);
				Если Форма.Команды.Найти("Подключаемый_Удалить_Промокод_" + ИндексСтроки) = Неопределено Тогда
					КомандаУдалить 				= Форма.Команды.Добавить("Подключаемый_Удалить_Промокод_" + ИндексСтроки);
					КомандаУдалить.Заголовок 	= "Удалить промокод";
					КомандаУдалить.Подсказка 	= КомандаУдалить.Заголовок;					   
					КомандаУдалить.Действие		= "Подключаемый_Удалить_Промокод_Нажатие";
					КомандаУдалить.ИзменяетСохраняемыеДанные = Истина;
				КонецЕсли;
				КнопкаУдалить.ИмяКоманды 				= "Подключаемый_Удалить_Промокод_" + ИндексСтроки;
				КнопкаУдалить.Заголовок 				= "Удалить промокод";
				КнопкаУдалить.Отображение				= ОтображениеКнопки.Картинка;
				КнопкаУдалить.ОтображениеФигуры    		= ОтображениеФигурыКнопки.Нет;
				КнопкаУдалить.Картинка					= БиблиотекаКартинок.УдалениеДанных16; 
			КонецЕсли;
			
		КонецЕсли;
		
		#КонецОбласти
		
		#КонецОбласти
		
		ИначеЕсли ЭлементРодитель = "ГруппаДолгиКонтрагентаСуществующие" Тогда
			
			#Область СОЗДАНИЕ_ЭЛЕМЕНТОВ_ЗАДОЛЖЕННОСТИ
						
			Форма.Элементы.Найти("ГруппаДолгиКонтрагента").Видимость = ?(Форма.ДолгиСуществующие.Количество() = 0, Ложь, Истина);

			// ИтоговаяСуммаЗадолженности = 0;    
			// ЗадолженностьПоРассрочке   = 0;      
			// ЕстьПросрочкаПоРассрочке   = Ложь;
			// УКлиентаЕстьЗадолженность  = Ложь;
			
			Для Каждого СтрокаТЗ Из Форма.ДолгиСуществующие Цикл
								
				ИндексСтроки = Формат(Форма.ДолгиСуществующие.Индекс(СтрокаТЗ), "ЧН=; ЧГ=0");			
				СтруктураЗадолженности = СформироватьПредставлениеЭлемента(Форма, СтрокаТЗ, ЭлементРодитель); //, ВладелецСсылка
				
				Если Не ЗначениеЗаполнено(СтруктураЗадолженности) Тогда
					Продолжить;	
				КонецЕсли;
				
				
				// НомерТекущегоДокумента = ФормированиеПечатныхФорм.ПолучитьНомерНаПечатьПосле2011г(СтрокаТЗ.РегистраторНомер, Истина, Истина);
				
				// Создаем группу
				// --------------------------------------------------------------------------------------------		
				ГруппаДолгиСуществующие = Элементы.Добавить("ГруппаДолгиСуществующие_" + ИндексСтроки, Тип("ГруппаФормы"), ГруппаРодитель);
				ГруппаДолгиСуществующие.Вид 				 = ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаДолгиСуществующие.Отображение 		 = ОтображениеОбычнойГруппы.Нет;
				ГруппаДолгиСуществующие.Группировка 		 = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
				ГруппаДолгиСуществующие.ОтображатьЗаголовок  = Ложь;
				ГруппаДолгиСуществующие.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
				ГруппаДолгиСуществующие.Высота				   = 1;
				
				// Создаем представление
				// --------------------------------------------------------------------------------------------		
				
				// ДекорацияФормы_Представление = Элементы.Добавить("ДолгиСуществующие_" + ИндексСтроки, Тип("ДекорацияФормы"), ГруппаДолгиСуществующие);
				// ДекорацияФормы_Представление.Вид 						= ВидДекорацииФормы.Надпись;
				// ДекорацияФормы_Представление.Заголовок                  = Формат(СтрокаТЗ.Дата, "ДЛФ=DD")+", "+СтруктураЗадолженности.ЗадолженностьПредставление;
				// ДекорацияФормы_Представление.Гиперссылка 				= Истина;
				// ДекорацияФормы_Представление.ЦветТекста 				= ЦветаСтиля.ТекстВторостепеннойНадписи;
				// ДекорацияФормы_Представление.ГоризонтальноеПоложение   	= ГоризонтальноеПоложениеЭлемента.Лево;
				// ДекорацияФормы_Представление.Ширина 					= 43;
				// ДекорацияФормы_Представление.МаксимальнаяШирина        	= 43;
				// ДекорацияФормы_Представление.РастягиватьПоГоризонтали  	= Истина;
				// ДекорацияФормы_Представление.Высота						= 1;
				// ДекорацияФормы_Представление.АвтоМаксимальнаяШирина    	= Ложь;
				// ДекорацияФормы_Представление.УстановитьДействие("Нажатие", "Подключаемый_ДекорацияФормы_Представление_Нажатие");
				
				ГруппаПредставлениеДолга = Элементы.Добавить("ГруппаПредставлениеДолга_" + ИндексСтроки, Тип("ГруппаФормы"), ГруппаДолгиСуществующие);
				ГруппаПредставлениеДолга.Вид						= ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаПредставлениеДолга.Отображение				= ОтображениеОбычнойГруппы.Нет;
				ГруппаПредставлениеДолга.Группировка				= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
				ГруппаПредставлениеДолга.ОтображатьЗаголовок		= Ложь;
				ГруппаПредставлениеДолга.Высота						= 1;
				ГруппаПредставлениеДолга.Ширина						= 50;
				ГруппаПредставлениеДолга.РастягиватьПоГоризонтали  	= Ложь;
				// ГруппаПредставлениеДолга.ЦветФона = Новый Цвет(246, 255, 208);
	
				ПредставлениеДолга = Формат(СтрокаТЗ.Дата, "ДЛФ=DD")+", "+СтруктураЗадолженности.ЗадолженностьПредставление;
				// ШиринаПредставленияДолга  = Цел(СтрДлина(ПредставлениеДолга) / 1.5);
				
				ДекорацияФормы_Представление = Элементы.Добавить("ДолгиСуществующие_" + ИндексСтроки, Тип("КнопкаФормы"), ГруппаПредставлениеДолга);
				ДекорацияФормы_Представление.Заголовок                  = Формат(СтрокаТЗ.Дата, "ДЛФ=DD")+", "+СтруктураЗадолженности.ЗадолженностьПредставление;
				ДекорацияФормы_Представление.Отображение       			= ОтображениеКнопки.Текст;
				ДекорацияФормы_Представление.ОтображениеФигуры			= ОтображениеФигурыКнопки.Нет;
				ДекорацияФормы_Представление.ИмяКоманды					= "ОткрытьЗадолженность";
				// ДекорацияФормы_Представление.Ширина						= ?(ШиринаПредставленияДолга > 43, 43, ШиринаПредставленияДолга);
				ДекорацияФормы_Представление.Высота						= 1;
				ДекорацияФормы_Представление.ГоризонтальноеПоложениеВГруппе   	= ГоризонтальноеПоложениеЭлемента.Лево;
				ДекорацияФормы_Представление.РастягиватьПоГоризонтали  	= Ложь;
				ДекорацияФормы_Представление.ЦветТекста 				= ЦветаСтиля.ТекстВторостепеннойНадписи;
				ДекорацияФормы_Представление.ЦветФона 					= ЦветаСтиля.ЦветФонаФормы;

								
				// Создаем представление остатка
				// --------------------------------------------------------------------------------------------
				ГруппаПредставлениеОстатка = Элементы.Добавить("ГруппаПредставлениеОстатка_" + ИндексСтроки, Тип("ГруппаФормы"), ГруппаДолгиСуществующие);
				ГруппаПредставлениеОстатка.Вид							= ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаПредставлениеОстатка.Отображение					= ОтображениеОбычнойГруппы.Нет;
				ГруппаПредставлениеОстатка.Группировка					= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
				ГруппаПредставлениеОстатка.ОтображатьЗаголовок			= Ложь;
				ГруппаПредставлениеОстатка.Высота						= 1;
				// ГруппаПредставлениеОстатка.Ширина						= 13;
				ГруппаПредставлениеОстатка.РастягиватьПоГоризонтали  	= Ложь;
				// ГруппаПредставлениеОстатка.ЦветФона = Новый Цвет(215, 251, 255);
				
				ДекорацияФормы_ПредставлениеОстатка = Элементы.Добавить("ДолгиСумма_" + ИндексСтроки, Тип("ДекорацияФормы"), ГруппаПредставлениеОстатка);
				ДекорацияФормы_ПредставлениеОстатка.Вид 							= ВидДекорацииФормы.Надпись;
				ДекорацияФормы_ПредставлениеОстатка.Заголовок                  		= СтруктураЗадолженности.СуммаПредставление;
				ДекорацияФормы_ПредставлениеОстатка.Ширина 							= 11;
				ДекорацияФормы_ПредставлениеОстатка.Высота 							= 1;
				ДекорацияФормы_ПредставлениеОстатка.ЦветТекста 						= ЦветаСтиля.ТекстВторостепеннойНадписи;
				ДекорацияФормы_ПредставлениеОстатка.ГоризонтальноеПоложение			= ГоризонтальноеПоложениеЭлемента.Право;				
				ДекорацияФормы_ПредставлениеОстатка.ГоризонтальноеПоложениеВГруппе 	= ГоризонтальноеПоложениеЭлемента.Право;
				ДекорацияФормы_ПредставлениеОстатка.РастягиватьПоВертикали 			= Ложь;
				ДекорацияФормы_ПредставлениеОстатка.РастягиватьПоГоризонтали		= Ложь;
				
			КонецЦикла;
			
			#Конецобласти  		
			
		ИначеЕсли ЭлементРодитель = "ГруппаКартыСуществующие" Тогда	
			
			#Область СОЗДАНИЕ_ЭЛЕМЕНТОВ_КАРТЫ
			
			Для Каждого СтрокаТЗ Из Форма.КартыСуществующие Цикл
				
				ИндексСтроки = Форма.КартыСуществующие.Индекс(СтрокаТЗ);
				
				//  Создаем группу
				// --------------------------------------------------------------------------------------------		
				ГруппаКартыСуществующие = Элементы.Добавить("ГруппаКартыСуществующие_" + ИндексСтроки, Тип("ГруппаФормы"), ГруппаРодитель);
				ГруппаКартыСуществующие.Вид 				= ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаКартыСуществующие.Заголовок 			= ГруппаКартыСуществующие.Имя;
				ГруппаКартыСуществующие.Отображение 		= ОтображениеОбычнойГруппы.Нет;
				ГруппаКартыСуществующие.Группировка 		= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
				ГруппаКартыСуществующие.ОтображатьЗаголовок = Ложь;				
				// ГруппаКартыСуществующие.ВертикальноеПоложениеПодчиненных 	= ВертикальноеПоложениеЭлемента.Центр;
				
				ДекорацияФормы_Заглушка = Элементы.Добавить("КартыЗаглушка_" + ИндексСтроки, Тип("ДекорацияФормы"), ГруппаКартыСуществующие);
				ДекорацияФормы_Заглушка.Вид 						= ВидДекорацииФормы.Надпись;
				ДекорацияФормы_Заглушка.Заголовок 					= "";
				ДекорацияФормы_Заглушка.Гиперссылка 				= Истина;
				ДекорацияФормы_Заглушка.ЦветТекста 					= Новый Цвет(100, 100, 100);
				ДекорацияФормы_Заглушка.АвтоМаксимальнаяШирина    	= Ложь;
				ДекорацияФормы_Заглушка.Ширина 						= ОтступОтЛевогоКрая;
				ДекорацияФормы_Заглушка.МаксимальнаяШирина       	= ОтступОтЛевогоКрая;
				ДекорацияФормы_Заглушка.ГоризонтальноеПоложение   	= ГоризонтальноеПоложениеЭлемента.Лево;
				ДекорацияФормы_Заглушка.РастягиватьПоГоризонтали  	= Истина;
				ДекорацияФормы_Заглушка.Гиперссылка				  	= Ложь;

				// Выводим картинку
				ДекорацияФормы_Картинка = Элементы.Добавить("КартыКартинка_" + ИндексСтроки, Тип("ДекорацияФормы"), ГруппаКартыСуществующие);
				ДекорацияФормы_Картинка.Вид      = ВидДекорацииФормы.Картинка;
				ДекорацияФормы_Картинка.Картинка = ?(СтрокаТЗ.ТипКода = Перечисления.ВидыКарт.Wallet, БиблиотекаКартинок.КартаWallet24, ?(СтрокаТЗ.ТипКода = Перечисления.ВидыКарт.Магнитная, БиблиотекаКартинок.КартаМагнитная, БиблиотекаКартинок.КартаШтриховая));
				ДекорацияФормы_Картинка.Ширина	 = 3;
				ДекорацияФормы_Картинка.Высота	 = 1;
				ДекорацияФормы_Картинка.РазмерКартинки = РазмерКартинки.АвтоРазмерБезУчетаМасштаба;
				
				//  Создаем представление
				// --------------------------------------------------------------------------------------------		
				ДекорацияФормы_Представление = Элементы.Добавить("КартыСуществующие_" + ИндексСтроки, Тип("ДекорацияФормы"), ГруппаКартыСуществующие);
				ДекорацияФормы_Представление.Вид 						= ВидДекорацииФормы.Надпись;
				ДекорацияФормы_Представление.Заголовок                  = СформироватьПредставлениеЭлемента(Форма, СтрокаТЗ, ЭлементРодитель);
				ДекорацияФормы_Представление.Гиперссылка 				= Истина;
				ДекорацияФормы_Представление.ЦветТекста 				= Новый Цвет(100, 100, 100);
				// ДекорацияФормы_Представление.Шрифт 						= Новый Шрифт("Verdana" , 8, , Истина);				
				ДекорацияФормы_Представление.АвтоМаксимальнаяШирина    	= Ложь;
				ДекорацияФормы_Представление.Ширина 					= ШиринаПредставления;
				ДекорацияФормы_Представление.МаксимальнаяШирина        	= ШиринаПредставления;
				ДекорацияФормы_Представление.ГоризонтальноеПоложение   	= ГоризонтальноеПоложениеЭлемента.Лево;
				ДекорацияФормы_Представление.РастягиватьПоГоризонтали  	= Истина; 		
				
				ДекорацияФормы_Представление.УстановитьДействие("Нажатие", "Подключаемый_ДекорацияФормы_Представление_Нажатие");
				
				Если СтрокаТЗ.КартаСсылка.Заблокирована Тогда
					Шрифт = Новый Шрифт(,,,,,Истина);
					ДекорацияФормы_Представление.Шрифт = Шрифт;
					ДекорацияФормы_Представление.ЦветТекста  = WebЦвета.СеребристоСерый; 					
				КонецЕсли; 			
			КонецЦикла;
			
			#КонецОбласти   	

		ИначеЕсли ЭлементРодитель = "ГруппаБудущиеСобытияКлиента" Тогда
			
			#Область СОЗДАНИЕ_ЭЛЕМЕНТОВ_ГРУППЫ_БУДУЩИЕ_СОБЫТИЯ
			
			Форма.Элементы.Найти("ГруппаБудущиеСобытия").Видимость = ?(Форма.БудущиеСобытия.Количество() = 0, Ложь, Истина);
						
			Если Форма.Команды.Найти("ОткрытьПредварительнуюЗапись") = Неопределено Тогда
				
				НоваяКоманда = Форма.Команды.Добавить("ОткрытьПредварительнуюЗапись");
				НоваяКоманда.Заголовок = " ";
				НоваяКоманда.Подсказка = " ";
				НоваяКоманда.Действие = "Подключаемый_ОткрытьПредварительнуюЗапись"; 		
				
			КонецЕсли;
			
			Если Форма.БудущиеСобытия.Количество() > 1 Тогда
				
				ЭлементЗаглушкаВыравнивание = Форма.Элементы.Найти("ДекорацияБлокСобытиеЗаглушка");
				Если НЕ ЭлементЗаглушкаВыравнивание = Неопределено Тогда
					ЭлементЗаглушкаВыравнивание.Видимость = Истина;							
				КонецЕсли;
				
			КонецЕсли;
				
			Для Каждого СтрокаТЗ Из Форма.БудущиеСобытия Цикл
				
				ИндексСтроки = Формат(Форма.БудущиеСобытия.Индекс(СтрокаТЗ), "ЧН=; ЧГ=0");			
				
				ГруппаБудущееСобытие = Элементы.Добавить("ГруппаПредставлениеБудущегоСобытия_" + ИндексСтроки, Тип("ГруппаФормы"), ГруппаРодитель);
				ГруппаБудущееСобытие.Вид						= ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаБудущееСобытие.Отображение				= ОтображениеОбычнойГруппы.Нет;
				ГруппаБудущееСобытие.Группировка				= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
				ГруппаБудущееСобытие.ОтображатьЗаголовок		= Ложь;
				ГруппаБудущееСобытие.Высота						= 1;
				//ГруппаБудущееСобытие.Ширина						= 56;
				ГруппаБудущееСобытие.РастягиватьПоГоризонтали  	= Истина;
				ГруппаБудущееСобытие.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Право;
				ГруппаБудущееСобытие.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
				ГруппаБудущееСобытие.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Верх;
				
				
				ДекорацияФормы_Представление = Элементы.Добавить("БудущееСобытие_" + ИндексСтроки, Тип("КнопкаФормы"), ГруппаБудущееСобытие);
				ДекорацияФормы_Представление.Заголовок                  = Формат(СтрокаТЗ.ДатаСобытия, "ДФ='дд ММММ ЧЧ:мм'") + " врач " + СтрокаТЗ.Сотрудник;
				ДекорацияФормы_Представление.Отображение       			= ОтображениеКнопки.Текст;
				ДекорацияФормы_Представление.ОтображениеФигуры			= ОтображениеФигурыКнопки.Нет;
				ДекорацияФормы_Представление.ИмяКоманды					= "ОткрытьПредварительнуюЗапись";
				ДекорацияФормы_Представление.Высота						= 1;
				ДекорацияФормы_Представление.РастягиватьПоГоризонтали  	= Ложь;	
				ДекорацияФормы_Представление.ЦветТекста 				= ЦветаСтиля.ТекстВторостепеннойНадписи;
				ДекорацияФормы_Представление.ЦветФона 					= ЦветаСтиля.ЦветФонаФормы;
				ДекорацияФормы_Представление.ГоризонтальноеПоложениеВГруппе   	= ГоризонтальноеПоложениеЭлемента.Лево;
				ДекорацияФормы_Представление.ВертикальноеПоложениеВГруппе   	= ВертикальноеПоложениеЭлемента.Верх;
				
				Если ИндексСтроки = "0" Тогда
										
					Если ЗначениеЗаполнено(ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ВладелецСсылка, "Телефон")) Тогда					
						
						ГруппаНапомнитьПациенту = Элементы.Добавить("ГруппаНапомнитьПациентуОБудущихСобытиях", Тип("ГруппаФормы"), ГруппаБудущееСобытие);
						ГруппаНапомнитьПациенту.Вид							= ВидГруппыФормы.ОбычнаяГруппа;
						ГруппаНапомнитьПациенту.Отображение					= ОтображениеОбычнойГруппы.Нет;
						ГруппаНапомнитьПациенту.Группировка					= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
						ГруппаНапомнитьПациенту.ОтображатьЗаголовок			= Ложь;
						ГруппаНапомнитьПациенту.Высота						= 1;
						ГруппаНапомнитьПациенту.Ширина						= 0;
						ГруппаНапомнитьПациенту.РастягиватьПоГоризонтали	= Ложь;
						ГруппаНапомнитьПациенту.ЦветФона					= Новый Цвет(242, 242, 242);
						ГруппаНапомнитьПациенту.ГоризонтальноеПоложениеВГруппе	= ГоризонтальноеПоложениеЭлемента.Право;
						ГруппаНапомнитьПациенту.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Право;
						
						КнопкаНапомнитьПациенту = Элементы.Добавить("НапомнитьПациентуОБудущихСобытиях", Тип("КнопкаФормы"), ГруппаНапомнитьПациенту);
						КнопкаНапомнитьПациенту.Заголовок					= "Отправить";
						КнопкаНапомнитьПациенту.Отображение					= ОтображениеКнопки.Текст;
						КнопкаНапомнитьПациенту.ОтображениеФигуры			= ОтображениеФигурыКнопки.Нет;
						КнопкаНапомнитьПациенту.ИмяКоманды					= "НапомнитьПациентуОБудущихСобытиях";
						КнопкаНапомнитьПациенту.Высота						= 1;
						КнопкаНапомнитьПациенту.РастягиватьПоГоризонтали  	= Ложь; 
												
						Декорация_НапомнитьПациенту_Заглушка = Элементы.Добавить("НапомнитьПациентуОБудущихСобытиях_Декорация", Тип("ДекорацияФормы"), ГруппаБудущееСобытие);
						Декорация_НапомнитьПациенту_Заглушка.Вид 							    = ВидДекорацииФормы.Надпись;
						Декорация_НапомнитьПациенту_Заглушка.Заголовок                  		= " ";
						Декорация_НапомнитьПациенту_Заглушка.Ширина 							= 0;
						Декорация_НапомнитьПациенту_Заглушка.Высота 							= 1;
						Декорация_НапомнитьПациенту_Заглушка.ГоризонтальноеПоложение			= ГоризонтальноеПоложениеЭлемента.Право;				
						Декорация_НапомнитьПациенту_Заглушка.ГоризонтальноеПоложениеВГруппе 	= ГоризонтальноеПоложениеЭлемента.Право;
						Декорация_НапомнитьПациенту_Заглушка.РастягиватьПоГоризонтали			= Ложь;
						
					КонецЕсли;
				
				КонецЕсли;
				
			КонецЦикла;
			
			#Конецобласти 			
			
		ИначеЕсли ЭлементРодитель = "ГруппаПромокодыСуществующие" Тогда	
			
			#Область СОЗДАНИЕ_ЭЛЕМЕНТОВ_ПРОМОКОДА
						
			Для Каждого СтрокаТЗ Из Форма.ПромокодыСуществующие Цикл
				
				ИндексСтроки = Формат(Форма.ПромокодыСуществующие.Индекс(СтрокаТЗ), "ЧН=; ЧГ=0");
				
				// Создаем группу
				// --------------------------------------------------------------------------------------------
				ГруппаПромокодыСуществующие = Элементы.Добавить("ГруппаПромокодыСуществующие_" + ИндексСтроки, Тип("ГруппаФормы"), ГруппаРодитель);
				ГруппаПромокодыСуществующие.Вид 				= ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаПромокодыСуществующие.Заголовок 			= ГруппаПромокодыСуществующие.Имя;
				ГруппаПромокодыСуществующие.Отображение 		= ОтображениеОбычнойГруппы.Нет;
				ГруппаПромокодыСуществующие.Группировка 		= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
				ГруппаПромокодыСуществующие.ОтображатьЗаголовок = Ложь;
				
				ДекорацияФормы_Заглушка = Элементы.Добавить("ПромокодыЗаглушка_" + ИндексСтроки, Тип("ДекорацияФормы"), ГруппаПромокодыСуществующие);
				ДекорацияФормы_Заглушка.Вид 						= ВидДекорацииФормы.Надпись;
				ДекорацияФормы_Заглушка.Заголовок 					= "";
				ДекорацияФормы_Заглушка.Гиперссылка 				= Ложь;
				ДекорацияФормы_Заглушка.ЦветТекста 					= ЦветаСтиля.ТекстВторостепеннойНадписи;
				ДекорацияФормы_Заглушка.АвтоМаксимальнаяШирина    	= Ложь;
				ДекорацияФормы_Заглушка.Ширина 						= ОтступОтЛевогоКрая;
				ДекорацияФормы_Заглушка.МаксимальнаяШирина       	= ОтступОтЛевогоКрая;
				ДекорацияФормы_Заглушка.ГоризонтальноеПоложение   	= ГоризонтальноеПоложениеЭлемента.Лево;
				ДекорацияФормы_Заглушка.РастягиватьПоГоризонтали  	= Истина;
				
				// Создаем представление
				// --------------------------------------------------------------------------------------------		
				ДекорацияФормы_Представление = Элементы.Добавить("ПромокодыСуществующие_" + ИндексСтроки, Тип("ДекорацияФормы"), ГруппаПромокодыСуществующие);
				ДекорацияФормы_Представление.Вид 						= ВидДекорацииФормы.Надпись;
				ДекорацияФормы_Представление.Заголовок                  = СформироватьПредставлениеЭлемента(Форма, СтрокаТЗ, ЭлементРодитель);
				ДекорацияФормы_Представление.Гиперссылка 				= Истина;
				ДекорацияФормы_Представление.ЦветТекста 				= ЦветаСтиля.ТекстВторостепеннойНадписи;
				ДекорацияФормы_Представление.АвтоМаксимальнаяШирина    	= Ложь;
				ДекорацияФормы_Представление.Ширина 					= 33;
				ДекорацияФормы_Представление.МаксимальнаяШирина        	= 33;
				ДекорацияФормы_Представление.ГоризонтальноеПоложение   	= ГоризонтальноеПоложениеЭлемента.Лево;
				ДекорацияФормы_Представление.РастягиватьПоГоризонтали  	= Истина;
				
				ДекорацияФормы_Представление.УстановитьДействие("Нажатие", "Подключаемый_ДекорацияФормы_Представление_Нажатие");								
				
			КонецЦикла;
			
			#КонецОбласти

		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьГруппуФормы(Форма, Наименование, Родитель, ЦветФона = Неопределено)
	
	ГруппаФормы = Форма.Элементы.Добавить(Наименование, Тип("ГруппаФормы"), Родитель);
	ГруппаФормы.Вид 							 = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаФормы.Отображение 					 = ОтображениеОбычнойГруппы.Нет;
	ГруппаФормы.Группировка 					 = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	ГруппаФормы.ОтображатьЗаголовок 			 = Ложь;
	ГруппаФормы.ВертикальноеПоложениеВГруппе 	 = ВертикальноеПоложениеЭлемента.Центр;
	ГруппаФормы.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
	
	Если ЦветФона <> Неопределено Тогда
		ГруппаФормы.ЦветФона                     = ЦветФона;
	КонецЕсли;
	
	Возврат ГруппаФормы;
	
КонецФункции

// Функция создает группу для кнопок типы оплаты.
//
Функция СоздатьГруппуДляКнопокТипОплаты(Форма, ГруппаРодитель, Индекс)
	
	Группа_Кнопки_ТипОплаты_Строка = Форма.Элементы.Добавить("Группа_Кнопки_ТипОплаты_Строка" + Индекс, Тип("ГруппаФормы"), ГруппаРодитель);
	Группа_Кнопки_ТипОплаты_Строка.Вид 				   = ВидГруппыФормы.ОбычнаяГруппа;
	Группа_Кнопки_ТипОплаты_Строка.Отображение 		   = ОтображениеОбычнойГруппы.Нет;
	Группа_Кнопки_ТипОплаты_Строка.Группировка 		   = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	Группа_Кнопки_ТипОплаты_Строка.ОтображатьЗаголовок = Ложь;
	  		
	Возврат Группа_Кнопки_ТипОплаты_Строка;
	
КонецФункции

//  Процедура - Очистить группу от созданных элементов
// 
//  Параметры:
//   Элементы		 - 	 - 
//   ЭлементРодитель	 - 	 - 
// 
Процедура ОчиститьГруппуОтСозданныхЭлементов(Элементы, Знач ГруппаРодитель)
	
	УдаляемыеЭлементы = Новый Массив;		
	Для Каждого ГруппаЭлементов Из ГруппаРодитель.ПодчиненныеЭлементы Цикл
		Если СтрНайти(ГруппаЭлементов.Имя, "Шаблон") = 0 Тогда
			УдаляемыеЭлементы.Добавить(ГруппаЭлементов);                           
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
	
КонецПроцедуры

//  Процедура - Сформировать представление элемента
// 
//  Параметры:
//   СтрокаТЗ		 - 	 - 
//   ЭлементРодитель	 - 	 - 
// 
Функция СформироватьПредставлениеЭлемента(Форма, Знач СтрокаТЗ, Знач ЭлементРодитель) Экспорт
	
	ПолучатьДанныеИзФормы = Ложь;
		  
	Валюта = ОбщегоНазначенияСтоматология.ПолучитьСимвольноеПредставлениеВалюты();
	Если ЭлементРодитель = "ГруппаУдостоверенияЛичностиСуществующие" Тогда
		
		Возврат СокрП(Строка(СтрокаТЗ.ВидДокумента)) + ?(ЗначениеЗаполнено(СтрокаТЗ.Серия), ", " + Строка(СтрокаТЗ.Серия), "") + " " + Строка(СтрокаТЗ.Номер) 
		+ ?(ЗначениеЗаполнено(СтрокаТЗ.ДатаВыдачи), ", выдан "+ Формат(СтрокаТЗ.ДатаВыдачи, "ДФ='dd.MM.yyyy'") + " г. ", "")	
		+ Строка(СтрокаТЗ.КемВыдан) 
		+ ?(ЗначениеЗаполнено(СтрокаТЗ.ДатаОкончания), " до " + Формат(СтрокаТЗ.ДатаОкончания, "ДФ='dd.MM.yyyy'") + " г. ", "");
		
	ИначеЕсли ЭлементРодитель = "ГруппаПолисыСуществующие" Тогда
		
		Возврат "" + СокрП(СтрокаТЗ.ТипПолиса) + ", " + 
		СтрокаТЗ.СтраховаяКомпания + 
		?(ЗначениеЗаполнено(СтрокаТЗ.СерияПолиса), ", " + Строка(СтрокаТЗ.СерияПолиса) + " ", "") +
		?(ЗначениеЗаполнено(СтрокаТЗ.НомерПолиса), "№" + Строка(СтрокаТЗ.НомерПолиса) + " ", "") +
		?(ЗначениеЗаполнено(СтрокаТЗ.ДатаНачала), ", с "+ Формат(СтрокаТЗ.ДатаНачала, "ДФ='dd.MM.yyyy'") + " г. ", "") +	
		?(ЗначениеЗаполнено(СтрокаТЗ.ДатаОкончания), " по " + Формат(СтрокаТЗ.ДатаОкончания, "ДФ='dd.MM.yyyy'") + " г. ", "");
		
	ИначеЕсли ЭлементРодитель = "ГруппаРодственникиСуществующие" Тогда
		Возврат Строка(СтрокаТЗ.Родственник) + " (" + СокрЛП(Строка(СтрокаТЗ.СтепеньРодства)) + ")" + ?(ЗначениеЗаполнено(СтрокаТЗ.Родственник.Телефон), " "+ СтрокаТЗ.Родственник.Телефон, "");
		
	ИначеЕсли ЭлементРодитель = "ГруппаПользовательИБСуществующий" Тогда
		Возврат Строка(СтрокаТЗ.Пользователь);

	ИначеЕсли ЭлементРодитель = "ГруппаИнформацияПоОплатеПодробно" Тогда
		
		СтроковоеПредставление = "";
		
		Если СтрокаТЗ.Свойство("СуммаОплачено") Тогда 
			СуммаОплаты = СтрокаТЗ.СуммаОплачено;
			СуммаОплаты = ?(СуммаОплаты = Цел(СуммаОплаты), Формат(СуммаОплаты, "ЧДЦ=2"), СуммаОплаты);	
		КонецЕсли;
		
		Если ТипЗнч(СтрокаТЗ.ДокументОплаты) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
			
			СуммаВозврата = СтрокаТЗ.ДокументОплаты.СуммаДляВозврата;
			СуммаВозврата = ?(СуммаВозврата = Цел(СуммаВозврата), Формат(СуммаВозврата, "ЧДЦ=2"), СуммаВозврата);
			
			Если СтрокаТЗ.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда 
				СтроковоеПредставление = Нстр("ru = 'Возврат наличными: '; en = 'Cash refund: '") + СуммаВозврата + " " + Валюта; // СтрокаТЗ.ДокументОплаты.СуммаДляВозврата
			ИначеЕсли СтрокаТЗ.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта Тогда 
				СтроковоеПредставление = Нстр("ru = 'Возврат на платежную карту: '; en = 'Payment card refund: '") + СуммаВозврата + " " + Валюта;
			ИначеЕсли СтрокаТЗ.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ЛицевойСчет Тогда 
				СтроковоеПредставление = Нстр("ru = 'Возврат на лицевой счет: '; en = 'Personal account refund: '") + СуммаВозврата + " " + Валюта;
			Иначе 
				СтроковоеПредставление = Нстр("ru = 'Возврат '; en = 'Refund '") + Строка(СтрокаТЗ.ТипДенежныхСредств) + ": " + СуммаВозврата + " " + Валюта;
			КонецЕсли;
		ИначеЕсли СтрокаТЗ.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПодарочныйСертификат Тогда 
			СтроковоеПредставление = Нстр("ru = 'Сертификат № '; en = 'Certificate: '") + Строка(СтрокаТЗ.ДокументОплаты.СертификатСерийныйНомер) + ": " + СуммаОплаты + " " + Валюта;  // СтрокаТЗ.СуммаОплачено
		ИначеЕсли СтрокаТЗ.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта Тогда
			СтроковоеПредставление = Нстр("ru = 'Карта: '; en = 'Card: '") + СуммаОплаты + " " + Валюта;
		Иначе 
			СтроковоеПредставление = Строка(СтрокаТЗ.ТипДенежныхСредств) + ": " + СуммаОплаты + " " + Валюта;
		КонецЕсли;

		Если ЗначениеЗаполнено(СтроковоеПредставление)
			И ?(ПолучатьДанныеИзФормы, НачалоДня(Форма.Дата), НачалоДня(Форма.Объект.Дата)) <> НачалоДня(СтрокаТЗ.ДатаПлатежа) Тогда
			
			СтроковоеПредставление = СтроковоеПредставление + Формат(СтрокаТЗ.ДатаПлатежа, "ДФ=' (dd.MM.yyyy)'");
		КонецЕсли;
		
		Возврат СтроковоеПредставление;	
		
	ИначеЕсли ЭлементРодитель = "ГруппаДолгиКонтрагентаСуществующие" Тогда
			
		Если СтрокаТЗ.Сумма <> 0 Тогда
			СуммаПредставление = "" + Формат(СтрокаТЗ.Сумма,"ЧЦ=15; ЧДЦ=2") + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольноеПредставлениеВалюты();
		Иначе
			СуммаПредставление = Нстр("ru = 'Нет цены'; eb = 'No price'");
		КонецЕсли;
		
		ЗадолженностьПредставление = ПредставлениеЗадолженностиПоДокументу(СтрокаТЗ.Основание);
		// ТекущийДокумент = СтрРазделить(СтрокаТЗ.Основание, " ", Ложь)[0];
		
		ВозвращаемаяСтруктура = Новый Структура;
		ВозвращаемаяСтруктура.Вставить("ЗадолженностьПредставление", ЗадолженностьПредставление);
		ВозвращаемаяСтруктура.Вставить("СуммаПредставление"		   , СуммаПредставление);
		// ВозвращаемаяСтруктура.Вставить("ТекущийДокумент"		   , ТекущийДокумент);		

		Возврат ВозвращаемаяСтруктура;	
		
	ИначеЕсли ЭлементРодитель = "ГруппаКартыСуществующие" Тогда	
		
		ЭтоКартаWallet = ЗначениеЗаполнено(СтрокаТЗ.ВидКарты.ИдентификаторПроекта);
		
		Возврат "Карта №" + ?(ЗначениеЗаполнено(СтрокаТЗ.ВнутреннийКодКарты) И Не ЭтоКартаWallet, Строка(СтрокаТЗ.ВнутреннийКодКарты), Строка(СтрокаТЗ.КодКарты));	
		
	ИначеЕсли ЭлементРодитель = "ГруппаПромокодыСуществующие" Тогда
		
		СтроковоеПредставление = СтрокаТЗ.ПромокодСсылка.Наименование + ?(СтрокаТЗ.ПромокодСсылка.ПометкаУдаления, НСтр("ru = ' (удален)'; en = ' (deleted)'"), "") + ": " + СтрокаТЗ.Промокод;
		Возврат СтроковоеПредставление;
		
	КонецЕсли;
	
КонецФункции

// Функция создает представление задолженности пациента
//
Функция ПредставлениеЗадолженностиПоДокументу(Основание)
	
	// Справочно:
	// Док. Прием 		= ТЧ Лечение и ТЧ Запасы
	// Док. Реализация 	= ТЧ Услуги и ТЧ Запасы
	
	УстановитьПривилегированныйРежим(Истина); // 234696.
	
	Представление = "";
	
	МассивНоменклатуры = Новый Массив;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Прием") Тогда 
		МассивНоменклатуры.Добавить(Основание.Лечение.ВыгрузитьКолонку("Номенклатура"));
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Реализация") Тогда
		МассивНоменклатуры.Добавить(Основание.Услуги.ВыгрузитьКолонку("Номенклатура"));	
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Прием") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.Реализация") Тогда		
		МассивНоменклатуры.Добавить(Основание.Запасы.ВыгрузитьКолонку("Номенклатура"));	
	КонецЕсли;
	
	Для Каждого ЭлементМассиваТЧ Из МассивНоменклатуры Цикл
		Для Каждого ЭлементМассиваНоменклатура Из ЭлементМассиваТЧ Цикл
			Представление = Представление + ЭлементМассиваНоменклатура.Наименование + ", ";	
		КонецЦикла;
	КонецЦикла;
		
	// Убираем лишнюю запятую
	Если СтрДлина(Представление) > 2 Тогда 
		Представление = Лев(Представление,СтрДлина(Представление) - 2); 
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

//  Процедура - Обновить отображение табличных частей
// 
//  Параметры:
//   Форма			 - 	 - 
//   ВладелецСсылка	 - 	 - 
//   МассивПараметров - 	 - 
// 
Процедура ОбновитьОтображениеТабличныхЧастей(Форма, Знач ВладелецСсылка = Неопределено, Знач МассивТабличныхЧастей = Неопределено) Экспорт
	
	//  Выходим если параметры не переданы
	Если МассивТабличныхЧастей = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	//  Определяем владельца формы
	Если ВладелецСсылка = Неопределено Тогда
		ВладелецСсылка = Форма.Объект.Ссылка;
	ИначеЕсли НЕ ЗначениеЗаполнено(ВладелецСсылка) Тогда  
		Возврат;
	КонецЕсли;
	
	//  Создание таблиц-реквизитов формы, если отсутствуют	
	ДобавитьРеквизитыФормы(Форма);
	
	//  Пересоздание элементов формы по информации из таблицы для отображения
	ОбновитьДинамическиеЭлементыТабличныхЧастей(Форма, ВладелецСсылка, МассивТабличныхЧастей);
	
	//// Выводим шкалу с длительностью. Если она уже создана, не создаем второй раз
	// Если Форма.Элементы.Найти("ГруппаВыводаКнопокДлительности_5") = Неопределено Тогда 
	//	НовыйЭлементШкалыДлительности = Неопределено;
	//	ЗаполнитьШкалуДлительностиПриема(Форма, МассивТабличныхЧастей, НовыйЭлементШкалыДлительности);
	// КонецЕсли;

КонецПроцедуры

//  Процедура - Добавить реквизиты формы
// 
//  Параметры:
//   Форма	 - 	 - 
// 
Процедура ДобавитьРеквизитыФормы(Форма)
	
	//  Вычисляем существующие реквизиты
	СписокРеквизитовФормы = Форма.ПолучитьРеквизиты();
	
	СоздатьТаблицуВремениОжидания = Истина;
	
	Для Каждого Реквизит Из СписокРеквизитовФормы Цикл
		Если Реквизит.Имя = "Таблица_ВремениОжидания" 	Тогда
			СоздатьТаблицуВремениОжидания = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	//  Создаем реквизиты формы
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	Если СоздатьТаблицуВремениОжидания Тогда 
		
		ИмяТаблицы = "Таблица_ВремениОжидания";
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы					, Новый ОписаниеТипов("ТаблицаЗначений"), , , Истина));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("КлючСтроки"				, Новый ОписаниеТипов("УникальныйИдентификатор"), ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВремяОжидания"			, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4, 0, ДопустимыйЗнак.Неотрицательный)), ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Надпись"	            	, Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(10)), ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВремяОжидания_Текст"		, Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)), ИмяТаблицы));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ДатаНачалаОжидания"		, Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(10)), ИмяТаблицы));
	Иначе 
		Форма.Таблица_ВремениОжидания.Очистить();
	КонецЕсли;
	
	Если МассивДобавляемыхРеквизитов.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	КонецЕсли;
	
КонецПроцедуры

//  Процедура, перестраивает динамические элементы в визите.
// 
Процедура ОбновитьДинамическиеЭлементыТабличныхЧастей(Форма, ВладелецСсылка, МассивТабличныхЧастей)
	
	Элементы 	   = Форма.Элементы; 
	ДокументЗакрыт = ?(Форма.ИмяФормы = "Документ.Событие.Форма.ФормаДокумента", Ложь, Форма.ДокументЗакрыт);
	НесколькоВрачейВОдномПриеме = Константы.НесколькоВрачейВОдномПриеме.Получить();
	
	Для Каждого ПараметрыТабличнойЧасти Из МассивТабличныхЧастей Цикл 
		
		ГруппаРодительТабличнойЧасти = Элементы.Найти(ПараметрыТабличнойЧасти.ГруппаДляРазмещения);
		
		//  Пропускаем если нет группы для размещения или нет указанной табличной части
		Если ГруппаРодительТабличнойЧасти = Неопределено
			ИЛИ ВладелецСсылка.Метаданные().ТабличныеЧасти.Найти(ПараметрыТабличнойЧасти.ТабличнаяЧасть) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		//  Удалим элементы
		УдаляемыеЭлементы = Новый Массив;
		Для Каждого ГруппаЭлементов Из ГруппаРодительТабличнойЧасти.ПодчиненныеЭлементы Цикл
			
			Если ГруппаЭлементов.Имя <> "ГруппаОтменаВизитаПредварительнаяСтоимость" Тогда 
				УдаляемыеЭлементы.Добавить(ГруппаЭлементов);
			КонецЕсли;	
			
		КонецЦикла;
		
		Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
			Элементы.Удалить(УдаляемыйЭлемент);
		КонецЦикла;
		
		//  Выводим элементы
		ПредыдущаяСтрока = Неопределено;	
		КоличествоСтрокТаблицы = Форма.Объект[ПараметрыТабличнойЧасти.ТабличнаяЧасть].Количество();
		Для Каждого СтрокаТЧ Из Форма.Объект[ПараметрыТабличнойЧасти.ТабличнаяЧасть] Цикл 
			
			Номенклатура = СтрокаТЧ.Номенклатура;
			ПроверкаБесплатность = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТЧ.Номенклатура, "Бесплатно");
			// Если ЗначениеЗаполнено(Номенклатура) 
			//	И (Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга 
			//	ИЛИ СтрокаТЧ.НормаВремени = 0) Тогда 
			//	
			//	Продолжить;
			// КонецЕсли;
			
			ТолькоПросмотрПоля = Ложь;// ЗначениеЗаполнено(СтрокаТЧ.Курс);
			
			ИндексСтрокиТЧ        = Форма.Объект[ПараметрыТабличнойЧасти.ТабличнаяЧасть].Индекс(СтрокаТЧ);
			НоменклатураЗаполнена = ЗначениеЗаполнено(Номенклатура) ИЛИ ИндексСтрокиТЧ = 0;
			
			ВремяОжидания = 0;
			ИспользоватьФункционалSPA = Ложь;// ПолучитьФункциональнуюОпцию("ИспользоватьФункционалSPA");
			ИспользоватьАссистентов   = Ложь;// ПолучитьФункциональнуюОпцию("ИспользоватьАссистентов");
			ИспользоватьРесурсы    	  = Ложь;// ПолучитьФункциональнуюОпцию("ИспользоватьРесурсы");
			
			Если НЕ ПредыдущаяСтрока = Неопределено И ПредыдущаяСтрока.ДатаОкончания <> Дата(1,1,1) И СтрокаТЧ.ДатаНачала  <> Дата(1,1,1) Тогда 
				Если ПредыдущаяСтрока.ДатаОкончания > СтрокаТЧ.ДатаНачала Тогда 
					ВремяОжидания = Цел(((ПредыдущаяСтрока.ДатаНачала - СтрокаТЧ.ДатаОкончания) / 60));					
				ИначеЕсли ПредыдущаяСтрока.ДатаОкончания < СтрокаТЧ.ДатаНачала Тогда 
					ВремяОжидания = Цел(((СтрокаТЧ.ДатаНачала - ПредыдущаяСтрока.ДатаОкончания) / 60));					
				КонецЕсли;	
			КонецЕсли;
			
			Если ВремяОжидания > 0 Тогда
				ДатаНачалаОжидания = Формат(ПредыдущаяСтрока.ДатаНачала + ПредыдущаяСтрока.НормаВремени * 60, "ДФ=HH:мм"); 
				ВывестиВремяОжидания(Форма, ГруппаРодительТабличнойЧасти, ПараметрыТабличнойЧасти, ВремяОжидания, ДатаНачалаОжидания, ИндексСтрокиТЧ);
			КонецЕсли;
			
			ПредставлениеТЧ = ПараметрыТабличнойЧасти.ТабличнаяЧасть + "_" + ИндексСтрокиТЧ;
			
			//  Создаем общую группу для строки ТЧ
			ГруппаСтрокиТабличнойЧасти = Элементы.Добавить("Группа_СтрокаТЧ_" + ПредставлениеТЧ, Тип("ГруппаФормы"), ГруппаРодительТабличнойЧасти);
			ГруппаСтрокиТабличнойЧасти.Вид 												= ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаСтрокиТабличнойЧасти.Заголовок 										= ГруппаСтрокиТабличнойЧасти.Имя;
			ГруппаСтрокиТабличнойЧасти.Отображение 										= ОтображениеОбычнойГруппы.Нет;
			ГруппаСтрокиТабличнойЧасти.Группировка 										= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			ГруппаСтрокиТабличнойЧасти.ОтображатьЗаголовок 								= Ложь;
			ГруппаСтрокиТабличнойЧасти.ГоризонтальноеПоложениеПодчиненных 				= ГоризонтальноеПоложениеЭлемента.Лево;
			ГруппаСтрокиТабличнойЧасти.ГоризонтальныйИнтервал 							= ИнтервалМеждуЭлементамиФормы.Одинарный;
			ГруппаСтрокиТабличнойЧасти.Ширина											= ?(НесколькоВрачейВОдномПриеме, ?(Не НоменклатураЗаполнена, 57, 56), 58);
			ГруппаСтрокиТабличнойЧасти.РастягиватьПоГоризонтали							= Ложь;

			// Если Не НоменклатураЗаполнена Тогда
			//	
			//	Группа_Заглушка_НоваяСтрока = Элементы.Добавить("Группа_Заглушка_НоваяСтрока" + ПредставлениеТЧ, Тип("ГруппаФормы"), ГруппаСтрокиТабличнойЧасти);
			//	Группа_Заглушка_НоваяСтрока.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			//	Группа_Заглушка_НоваяСтрока.Отображение = ОтображениеОбычнойГруппы.Нет;
			//	Группа_Заглушка_НоваяСтрока.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			//	Группа_Заглушка_НоваяСтрока.ОтображатьЗаголовок = Ложь;
			//	Группа_Заглушка_НоваяСтрока.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
			//	
			//	ДекорацияФормы_Заглушка_НоваяСтрока = Форма.Элементы.Добавить("ДекорацияФормы_Заглушка1_НоваяСтрока_ТЧ_" + ПредставлениеТЧ, Тип("ДекорацияФормы"), Группа_Заглушка_НоваяСтрока);
			//	ДекорацияФормы_Заглушка_НоваяСтрока.Вид = ВидДекорацииФормы.Надпись;
			//	ДекорацияФормы_Заглушка_НоваяСтрока.Заголовок = "";
			//	ДекорацияФормы_Заглушка_НоваяСтрока.Ширина = 13; // 13
			//	
			//	ДекорацияФормы_Заглушка_НоваяСтрока = Форма.Элементы.Добавить("ДекорацияФормы_Заглушка2_НоваяСтрока_ТЧ_" + ПредставлениеТЧ, Тип("ДекорацияФормы"), Группа_Заглушка_НоваяСтрока);
			//	ДекорацияФормы_Заглушка_НоваяСтрока.Вид = ВидДекорацииФормы.Надпись;
			//	ДекорацияФормы_Заглушка_НоваяСтрока.Заголовок = "";
			//	ДекорацияФормы_Заглушка_НоваяСтрока.Ширина = 1; // 1
			//					
			// КонецЕсли;			
			
			
			
			Группа_Заглушка_Время = Элементы.Добавить("Группа_Заглушка_Время" + ПредставлениеТЧ, Тип("ГруппаФормы"), ГруппаСтрокиТабличнойЧасти);
			Группа_Заглушка_Время.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			Группа_Заглушка_Время.Отображение = ОтображениеОбычнойГруппы.Нет;
			Группа_Заглушка_Время.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			Группа_Заглушка_Время.ОтображатьЗаголовок = Ложь;
			Группа_Заглушка_Время.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;			
			
			//// Создаем поле времени начала.
			// ПолеФормы_ВремяНачала = Элементы.Добавить("ПолеФормы_ВремяНачала_ТЧ_" + ПредставлениеТЧ, Тип("ПолеФормы"), Группа_Заглушка_Время);
			// ПолеФормы_ВремяНачала.Вид 								   = ВидПоляФормы.ПолеВвода;
			// ПолеФормы_ВремяНачала.ПутьКДанным 						   = "Объект." + ПараметрыТабличнойЧасти.ТабличнаяЧасть + "["+ Строка(ИндексСтрокиТЧ) + "]" + ".ДатаНачала";
			// ПолеФормы_ВремяНачала.Заголовок 						   = "С";
			// ПолеФормы_ВремяНачала.Подсказка							   = "Время начала";
			// ПолеФормы_ВремяНачала.ПоложениеЗаголовка 				   = ПоложениеЗаголовкаЭлементаФормы.Нет; //?(ИндексСтрокиТЧ = 0, ПоложениеЗаголовкаЭлементаФормы.Верх, ПоложениеЗаголовкаЭлементаФормы.Нет)
			// ПолеФормы_ВремяНачала.КнопкаОткрытия 					   = Ложь;
			// ПолеФормы_ВремяНачала.КнопкаВыбора				    	   = Ложь;
			// ПолеФормы_ВремяНачала.КнопкаВыпадающегоСписка 			   = Истина;
			// ПолеФормы_ВремяНачала.РежимВыбораИзСписка                  = Истина;
			// ПолеФормы_ВремяНачала.АвтоМаксимальнаяШирина 			   = Ложь;
			// ПолеФормы_ВремяНачала.МаксимальнаяШирина 				   = 6;
			// ПолеФормы_ВремяНачала.ШиринаВыпадающегоСписка 			   = 7;
			// ПолеФормы_ВремяНачала.АвтоОтметкаНезаполненного 		   = Истина;
			// ПолеФормы_ВремяНачала.Видимость                            = НоменклатураЗаполнена;
			//
			// ПолеФормы_ВремяНачала.УстановитьДействие("ПриИзменении"	  , "ЗапасыДатаНачалаПриИзменении");
			// ПолеФормы_ВремяНачала.УстановитьДействие("НачалоВыбора"	  , "ЗапасыДатаНачалаНачалоВыбора");
			// ПолеФормы_ВремяНачала.УстановитьДействие("ОбработкаВыбора", "ЗапасыДатаНачалаОбработкаВыбора");
			
			// Форма.ЗаполнитьСписокВремениНачалаУслуг(ПолеФормы_ВремяНачала, СтрокаТЧ);
			
			// Создаем поле времени окончания.
			// ПолеФормы_ВремяОкончания = Элементы.Добавить("ПолеФормы_ВремяОкончания_ТЧ_" + ПредставлениеТЧ, Тип("ПолеФормы"), ГруппаСтрокиТабличнойЧасти);
			// ПолеФормы_ВремяОкончания.Вид 								   = ВидПоляФормы.ПолеВвода;
			// ПолеФормы_ВремяОкончания.ПутьКДанным 						   = "Объект." + ПараметрыТабличнойЧасти.ТабличнаяЧасть + "["+ Строка(ИндексСтрокиТЧ) + "]" + ".ДатаОкончания";
			// ПолеФормы_ВремяОкончания.Заголовок 						   	   = "По";
			// ПолеФормы_ВремяОкончания.Подсказка							   = "Время окончания";
			// ПолеФормы_ВремяОкончания.ПоложениеЗаголовка 				   = ?(ИндексСтрокиТЧ = 0, ПоложениеЗаголовкаЭлементаФормы.Верх, ПоложениеЗаголовкаЭлементаФормы.Нет);
			// ПолеФормы_ВремяОкончания.КнопкаОткрытия 					   = Ложь;
			// ПолеФормы_ВремяОкончания.КнопкаВыбора				    	   = Ложь;
			// ПолеФормы_ВремяОкончания.КнопкаВыпадающегоСписка 			   = Истина;
			// ПолеФормы_ВремяОкончания.РежимВыбораИзСписка                   = Истина;
			// ПолеФормы_ВремяОкончания.АвтоМаксимальнаяШирина 			   = Ложь;
			// ПолеФормы_ВремяОкончания.МаксимальнаяШирина 				   = 6;
			// ПолеФормы_ВремяОкончания.ШиринаВыпадающегоСписка 			   = 7;
			// ПолеФормы_ВремяОкончания.АвтоОтметкаНезаполненного 		       = Истина;
			// ПолеФормы_ВремяОкончания.Видимость                             = НоменклатураЗаполнена;
			//
			// ПолеФормы_ВремяОкончания.УстановитьДействие("ПриИзменении"	  , "ЗапасыДатаНачалаПриИзменении");
			//
			// Форма.ЗаполнитьСписокВремениНачалаУслуг(ПолеФормы_ВремяОкончания, СтрокаТЧ);
			
			// ПолеФормы_НормаВремени = Элементы.Добавить("ПолеФормы_НормаВремени_ТЧ_" + ПредставлениеТЧ, Тип("ПолеФормы"), Группа_Заглушка_Время);
			// ПолеФормы_НормаВремени.Вид 													= ВидПоляФормы.ПолеВвода;
			// ПолеФормы_НормаВремени.ПутьКДанным 											= "Объект." + ПараметрыТабличнойЧасти.ТабличнаяЧасть + "["+ Строка(ИндексСтрокиТЧ) + "]" + ".НормаВремени";
			// ПолеФормы_НормаВремени.Заголовок 											= "Мин.";
			// ПолеФормы_НормаВремени.ПоложениеЗаголовка 									= ПоложениеЗаголовкаЭлементаФормы.Нет; //?(ИндексСтрокиТЧ = 0, ПоложениеЗаголовкаЭлементаФормы.Верх, ПоложениеЗаголовкаЭлементаФормы.Нет)
			// ПолеФормы_НормаВремени.КнопкаОткрытия 										= Ложь;
			//// ПолеФормы_НормаВремени.КнопкаВыпадающегоСписка 								= Истина;
			// ПолеФормы_НормаВремени.АвтоМаксимальнаяШирина 								= Ложь;
			//// ПолеФормы_НормаВремени.РежимВыбораИзСписка                                  = Истина;			
			// ПолеФормы_НормаВремени.Ширина 												= 4;
			// ПолеФормы_НормаВремени.Видимость                                            = НоменклатураЗаполнена;
			//
			// ПолеФормы_НормаВремени.УстановитьДействие("ПриИзменении"		, "ЗапасыНормаВремениПриИзменении");
			// ПолеФормы_НормаВремени.УстановитьДействие("ОбработкаВыбора"		, "ЗапасыНормаВремениОбработкаВыбора");			
			
			// Форма.ЗаполнитьСписокВыбораПродолжительности(ПолеФормы_НормаВремени, СтрокаТЧ);
			
			
			ГруппаНоменклатуры =  Элементы.Добавить("Группа_Номенклатура_" + ИндексСтрокиТЧ, Тип("ГруппаФормы"), ГруппаСтрокиТабличнойЧасти);
			ГруппаНоменклатуры.Вид 												= ВидГруппыФормы.ОбычнаяГруппа;			
			ГруппаНоменклатуры.Отображение 										= ОтображениеОбычнойГруппы.Нет;
			ГруппаНоменклатуры.Группировка 										= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаНоменклатуры.ОтображатьЗаголовок 								= Ложь;
			
			ПолеФормы_Номенклатура = Элементы.Добавить("ПолеФормы_Номенклатура_ТЧ_" + ПредставлениеТЧ, Тип("ПолеФормы"), ГруппаНоменклатуры);
			ПолеФормы_Номенклатура.Вид 											= ВидПоляФормы.ПолеВвода;
			ПолеФормы_Номенклатура.ПутьКДанным 									= "Объект." + ПараметрыТабличнойЧасти.ТабличнаяЧасть + "["+ Строка(ИндексСтрокиТЧ) + "]" + ".Номенклатура";
			ПолеФормы_Номенклатура.Заголовок 								    = "Услуга";			
			ПолеФормы_Номенклатура.ПоложениеЗаголовка 							= ПоложениеЗаголовкаЭлементаФормы.Нет; //?(ИндексСтрокиТЧ = 0, ПоложениеЗаголовкаЭлементаФормы.Верх, ПоложениеЗаголовкаЭлементаФормы.Нет)
			ПолеФормы_Номенклатура.АвтоМаксимальнаяШирина 						= Ложь;
			
			// Если ИспользоватьРесурсы = Истина И ИспользоватьАссистентов = Истина Тогда
			//	МаксимальнаяШирина = 22;
			// ИначеЕсли ИспользоватьРесурсы = Истина ИЛИ ИспользоватьАссистентов = Истина Тогда
			//	МаксимальнаяШирина = 30;
			// Иначе
			//	МаксимальнаяШирина = 50;
			// КонецЕсли;
			
			// МаксимальнаяШирина = ?(НесколькоВрачейВОдномПриеме, 37, ?( КоличествоСтрокТаблицы > 1, 73, 86));
			МаксимальнаяШирина = ?(НесколькоВрачейВОдномПриеме, 42, ?( КоличествоСтрокТаблицы > 1, 54, 54));

			
			ПолеФормы_Номенклатура.МаксимальнаяШирина 							= МаксимальнаяШирина;
			ПолеФормы_Номенклатура.ПодсказкаВвода 								= "Найти";
			ПолеФормы_Номенклатура.АвтоОтметкаНезаполненного 					= Ложь;
			ПолеФормы_Номенклатура.БыстрыйВыбор                                 = Ложь;
			ПолеФормы_Номенклатура.ИсторияВыбораПриВводе                        = ИсторияВыбораПриВводе.НеИспользовать;
			ПолеФормы_Номенклатура.РежимВыбораИзСписка                          = Ложь;
			ПолеФормы_Номенклатура.КнопкаВыбора                                 = Истина;
			ПолеФормы_Номенклатура.КнопкаВыпадающегоСписка                      = Ложь;
			ПолеФормы_Номенклатура.ОтображениеКнопкиВыбора                      = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
			ПолеФормы_Номенклатура.ВыборГруппИЭлементов                         = ГруппыИЭлементы.Элементы;
			ПолеФормы_Номенклатура.КнопкаСоздания                               = Ложь;
			ПолеФормы_Номенклатура.ТолькоПросмотр                               = ТолькоПросмотрПоля;
			ПолеФормы_Номенклатура.Подсказка	                                = "Услуга";
			
			Если Не НоменклатураЗаполнена Тогда
				Форма.ТекущийЭлемент = ПолеФормы_Номенклатура;
			КонецЕсли;
			ПолеФормы_Номенклатура.УстановитьДействие("ПриИзменении"	    , "ЗапасыНоменклатураПриИзменении");
			ПолеФормы_Номенклатура.УстановитьДействие("НачалоВыбора"	    , "ЗапасыНоменклатураНачалоВыбора");
			ПолеФормы_Номенклатура.УстановитьДействие("АвтоПодбор"	        , "ЗапасыНоменклатураАвтоПодбор");
			ПолеФормы_Номенклатура.УстановитьДействие("ОкончаниеВводаТекста", "ЗапасыНоменклатураОкончаниеВводаТекста");
			
			УстановитьПараметрыВыбораНоменклатуры(ПолеФормы_Номенклатура, СтрокаТЧ);
			
			ВидимостьПоляПакета = Ложь;
			
			Если ИспользоватьФункционалSPA = Истина Тогда
				
				ГруппаПакетУслуг = Элементы.Добавить("Группа_ПакетУслуг_" + ИндексСтрокиТЧ, Тип("ГруппаФормы"), ГруппаНоменклатуры);
				ГруппаПакетУслуг.Вид 				 = ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаПакетУслуг.Отображение 		 = ОтображениеОбычнойГруппы.Нет;
				ГруппаПакетУслуг.Группировка 		 = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
				ГруппаПакетУслуг.ОтображатьЗаголовок = Ложь;
				
				//  Выводим пакет услуг.
				ПолеФормы_ПакетУслуг = Элементы.Добавить("УслугиПакетУслуг_" + ИндексСтрокиТЧ, Тип("КнопкаФормы"), ГруппаПакетУслуг);
				ПолеФормы_ПакетУслуг.Отображение        	  = ОтображениеКнопки.Текст;
				ПолеФормы_ПакетУслуг.ОтображениеФигуры 		  = ОтображениеФигурыКнопки.Нет;
				ПолеФормы_ПакетУслуг.ИмяКоманды      		  = "ОткрытьПакетУслуг";
				ПолеФормы_ПакетУслуг.Видимость          	  = ЗначениеЗаполнено(СтрокаТЧ.Основание);
				ПолеФормы_ПакетУслуг.Заголовок          	  = СтрокаТЧ.ПакетУслугПредставление;
				ПолеФормы_ПакетУслуг.МаксимальнаяШирина       = МаксимальнаяШирина - 2;
				ПолеФормы_ПакетУслуг.АвтоМаксимальнаяШирина   = Ложь;
				ПолеФормы_ПакетУслуг.РастягиватьПоГоризонтали = Ложь;
				ПолеФормы_ПакетУслуг.Ширина                   = МаксимальнаяШирина - 2;
				
				//  Добавить кнопку удалить пакет услуг.
				КнопкаФормы_ПакетУслуг_Удалить = Элементы.Добавить("УслугиПакетУслугУдалить_" + ИндексСтрокиТЧ, Тип("КнопкаФормы"), ГруппаПакетУслуг);
				КнопкаФормы_ПакетУслуг_Удалить.Отображение       = ОтображениеКнопки.Картинка;
				КнопкаФормы_ПакетУслуг_Удалить.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
				КнопкаФормы_ПакетУслуг_Удалить.ИмяКоманды        = "УдалитьПакетУслуг";
				КнопкаФормы_ПакетУслуг_Удалить.Видимость         = ЗначениеЗаполнено(СтрокаТЧ.Основание);
				КнопкаФормы_ПакетУслуг_Удалить.Доступность       = ДокументЗакрыт = Ложь;
				
				ПолеФормы_ПакетУслуг_Выбрать = Элементы.Добавить("УслугиПакетУслугВыбрать_" + ИндексСтрокиТЧ, Тип("КнопкаФормы"), ГруппаПакетУслуг);
				ПолеФормы_ПакетУслуг_Выбрать.Отображение        = ОтображениеКнопки.Текст;
				ПолеФормы_ПакетУслуг_Выбрать.ОтображениеФигуры 	= ОтображениеФигурыКнопки.Нет;
				ПолеФормы_ПакетУслуг_Выбрать.ИмяКоманды      	= "ВыбратьПакетУслуг";
				ПолеФормы_ПакетУслуг_Выбрать.Видимость          = НЕ ЗначениеЗаполнено(СтрокаТЧ.Основание) И ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) И ЕстьДоступныйПакетУслугПоУслуге(СтрокаТЧ.Номенклатура, СтрокаТЧ.ВидЦен, Форма.ТаблицаОстатковПакетов);
				ПолеФормы_ПакетУслуг_Выбрать.Заголовок          = "Выберите пакет услуг";
				ПолеФормы_ПакетУслуг_Выбрать.Доступность        = ДокументЗакрыт = Ложь;
				
				ВидимостьПоляПакета = ПолеФормы_ПакетУслуг.Видимость ИЛИ ПолеФормы_ПакетУслуг_Выбрать.Видимость;
				
			КонецЕсли;
			
			
			Если НесколькоВрачейВОдномПриеме Тогда
				
				// Сотрудник.
				ПолеФормы_Сотрудник = Элементы.Добавить("ПолеФормы_Сотрудник_ТЧ_" + ПредставлениеТЧ, Тип("ПолеФормы"), ГруппаСтрокиТабличнойЧасти);
				
				ЗаполнитьСвойстваПоляСотрудника(ПолеФормы_Сотрудник, ИндексСтрокиТЧ = 0);
				
				ПолеФормы_Сотрудник.ПутьКДанным 		= "Объект." + ПараметрыТабличнойЧасти.ТабличнаяЧасть + "["+ Строка(ИндексСтрокиТЧ) + "]" + ".Сотрудник";
				ПолеФормы_Сотрудник.Заголовок 			= "Врач";
				ПолеФормы_Сотрудник.ПоложениеЗаголовка 	= ПоложениеЗаголовкаЭлементаФормы.Нет;
				ПолеФормы_Сотрудник.ПодсказкаВвода 		= "Выберите сотрудника";
				
				// Если ИспользоватьРесурсы = Истина И ИспользоватьАссистентов = Истина Тогда
				//	ПолеФормы_Сотрудник.МаксимальнаяШирина = 25;
				// ИначеЕсли ИспользоватьРесурсы = Истина ИЛИ ИспользоватьАссистентов = Истина Тогда
				//	ПолеФормы_Сотрудник.МаксимальнаяШирина = 29;
				// Иначе
				//	ПолеФормы_Сотрудник.МаксимальнаяШирина = 41;
				// КонецЕсли;
				
				// ПолеФормы_Сотрудник.МаксимальнаяШирина = 38;
				ПолеФормы_Сотрудник.АвтоМаксимальнаяШирина = Истина;
				ПолеФормы_Сотрудник.Ширина = 15;
				
				ПолеФормы_Сотрудник.УстановитьДействие("ПриИзменении"		 , "ЗапасыСотрудникПриИзменении");
				ПолеФормы_Сотрудник.УстановитьДействие("НачалоВыбора"		 , "ЗапасыСотрудникНачалоВыбора");
				ПолеФормы_Сотрудник.УстановитьДействие("ОбработкаВыбора"	 , "ЗапасыСотрудникОбработкаВыбора");				
				ПолеФормы_Сотрудник.УстановитьДействие("АвтоПодбор"			 , "ЗапасыСотрудникАвтоПодбор");
				ПолеФормы_Сотрудник.УстановитьДействие("ОкончаниеВводаТекста", "ЗапасыСотрудникОкончаниеВводаТекста");
				
				
				// Кабинет.
				ПолеФормы_Кабинет = Элементы.Добавить("ПолеФормы_Кабинет_ТЧ_" + ПредставлениеТЧ, Тип("ПолеФормы"), ГруппаСтрокиТабличнойЧасти);			
				ЗаполнитьСвойстваПоляСотрудника(ПолеФормы_Кабинет, ИндексСтрокиТЧ = 0);			
				ПолеФормы_Кабинет.ПутьКДанным = "Объект." + ПараметрыТабличнойЧасти.ТабличнаяЧасть + "["+ Строка(ИндексСтрокиТЧ) + "]" + ".Помещение";
				ПолеФормы_Кабинет.Заголовок = "Кабинет";
				ПолеФормы_Кабинет.ПоложениеЗаголовка 			= ПоложениеЗаголовкаЭлементаФормы.Нет;
				ПолеФормы_Кабинет.ПодсказкаВвода = "Выберите кабинет";				
				ПолеФормы_Кабинет.МаксимальнаяШирина = 13; // 38	
				ПолеФормы_Кабинет.АвтоМаксимальнаяШирина = Ложь;
				
				ПолеФормы_Кабинет.УстановитьДействие("НачалоВыбора", "УслугиКабинетНачалоВыбора");
				
			КонецЕсли;			
			
			Если ИспользоватьФункционалSPA = Истина Тогда
				
				//  Ассистент
				Если ИспользоватьАссистентов = Истина Тогда
					
					ПолеФормы_Ассистент = Элементы.Добавить("ПолеФормы_Ассистент_ТЧ_" + ПредставлениеТЧ, Тип("ПолеФормы"), ГруппаСтрокиТабличнойЧасти);
					
					ЗаполнитьСвойстваПоляСотрудника(ПолеФормы_Ассистент, ИндексСтрокиТЧ = 0);
					
					ПолеФормы_Ассистент.ПутьКДанным 	   = "Объект." + ПараметрыТабличнойЧасти.ТабличнаяЧасть + "["+ Строка(ИндексСтрокиТЧ) + "]" + ".Ассистент";
					ПолеФормы_Ассистент.Заголовок 		   = "Ассистент";
					ПолеФормы_Ассистент.МаксимальнаяШирина = ?(ИспользоватьРесурсы, 21, 30);
					ПолеФормы_Ассистент.ПодсказкаВвода 	   = "Выберите ассистента";
					ПолеФормы_Ассистент.ТолькоПросмотр     = Не ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) ИЛИ Не СтрокаТЧ.Номенклатура.ИспользоватьАссистента;
					ПолеФормы_Ассистент.Видимость          = НоменклатураЗаполнена;
					
					ПолеФормы_Ассистент.УстановитьДействие("НачалоВыбора"		 , "ЗапасыАссистентНачалоВыбора");
					ПолеФормы_Ассистент.УстановитьДействие("АвтоПодбор"	 		 , "ЗапасыАссистентАвтоПодбор");
					ПолеФормы_Ассистент.УстановитьДействие("ОкончаниеВводаТекста", "ЗапасыАссистентОкончаниеВводаТекста");
					
				КонецЕсли;
				
				//  Помещение
				Если ИспользоватьРесурсы = Истина Тогда 
					
					ПолеФормы_Ресурс = Элементы.Добавить("ПолеФормы_Помещение_ТЧ_" + ПредставлениеТЧ, Тип("ПолеФормы"), ГруппаСтрокиТабличнойЧасти);
					
					ЗаполнитьСвойстваПоляСотрудника(ПолеФормы_Ресурс, ИндексСтрокиТЧ = 0);
					
					ПолеФормы_Ресурс.ПутьКДанным 		= "Объект." + ПараметрыТабличнойЧасти.ТабличнаяЧасть + "["+ Строка(ИндексСтрокиТЧ) + "]" + ".Помещение";
					ПолеФормы_Ресурс.Заголовок 			= "Ресурс";
					ПолеФормы_Ресурс.МаксимальнаяШирина = ?(ИспользоватьАссистентов, 18, 30);
					ПолеФормы_Ресурс.Видимость          = НоменклатураЗаполнена;
					ПолеФормы_Ресурс.ПодсказкаВвода 	= "Выберите ресурс";
					
					ПолеФормы_Ресурс.УстановитьДействие("ПриИзменении", "ЗапасыРесурсПриИзменении");
					ПолеФормы_Ресурс.УстановитьДействие("НачалоВыбора", "ЗапасыРесурсНачалоВыбора");
					ПолеФормы_Ресурс.УстановитьДействие("АвтоПодбор"  , "ЗапасыРесурсАвтоПодбор");
					
					УстановитьПараметрыВыбораПомещения(ВладелецСсылка, ПолеФормы_Ресурс, СтрокаТЧ);
					
				КонецЕсли;
				
				
				
			КонецЕсли;
			
			// ПолеФормы_Количество = Элементы.Добавить("ПолеФормы_Количество_ТЧ_" + ПредставлениеТЧ, Тип("ПолеФормы"), ГруппаСтрокиТабличнойЧасти);
			// ПолеФормы_Количество.Вид 													= ВидПоляФормы.ПолеВвода;
			// ПолеФормы_Количество.ПутьКДанным 											= "Объект." + ПараметрыТабличнойЧасти.ТабличнаяЧасть + "["+ Строка(ИндексСтрокиТЧ) + "]" + ".КоличествоУпаковок";
			// ПолеФормы_Количество.Заголовок 											    = "Кол-во";
			// ПолеФормы_Количество.ПоложениеЗаголовка 									= ?(ИндексСтрокиТЧ = 0, ПоложениеЗаголовкаЭлементаФормы.Верх, ПоложениеЗаголовкаЭлементаФормы.Нет);
			// ПолеФормы_Количество.КнопкаОткрытия 										= Ложь;
			// ПолеФормы_Количество.КнопкаВыбора				    						= Ложь;
			// ПолеФормы_Количество.КнопкаВыпадающегоСписка 								= Ложь;
			// ПолеФормы_Количество.АвтоМаксимальнаяШирина 								= Ложь;
			// ПолеФормы_Количество.РежимВыбораИзСписка                                    = Ложь;			
			// ПолеФормы_Количество.МаксимальнаяШирина 									= 4;
			// ПолеФормы_Количество.АвтоОтметкаНезаполненного 						     	= Истина;
			// ПолеФормы_Количество.Формат                                                 = "ЧДЦ=2";
			// ПолеФормы_Количество.ФорматРедактирования                                   = "ЧДЦ=2";
			// ПолеФормы_Количество.Подсказка                                              = "Количество";
			// ПолеФормы_Количество.Видимость                                              = НоменклатураЗаполнена;
			// ПолеФормы_Количество.ТолькоПросмотр                                         = ТолькоПросмотрПоля;
			// ПолеФормы_Количество.УстановитьДействие("ПриИзменении"		  , "ЗапасыКоличествоПриИзменении");
			// ПолеФормы_Количество.УстановитьДействие("ОкончаниеВводаТекста", "ЗапасыКоличествоОкончаниеВводаТекста");
			Если ПроверкаБесплатность = Ложь Тогда
				ПолеФормы_Цена = Элементы.Добавить("ПолеФормы_Цена_ТЧ_" + ПредставлениеТЧ, Тип("ПолеФормы"), ГруппаСтрокиТабличнойЧасти);
				ПолеФормы_Цена.Вид 						= ВидПоляФормы.ПолеВвода;
				ПолеФормы_Цена.ПутьКДанным 				= "Объект." + ПараметрыТабличнойЧасти.ТабличнаяЧасть + "["+ Строка(ИндексСтрокиТЧ) + "]" + ".Цена";
				ПолеФормы_Цена.Заголовок 				= "Цена";
				ПолеФормы_Цена.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет; //?(ИндексСтрокиТЧ = 0, ПоложениеЗаголовкаЭлементаФормы.Верх, ПоложениеЗаголовкаЭлементаФормы.Нет)
				ПолеФормы_Цена.КнопкаОткрытия 			= Ложь;
				// ПолеФормы_Цена.КнопкаВыпадающегоСписка 	= Ложь;
				ПолеФормы_Цена.АвтоМаксимальнаяШирина 	= Ложь;
				// ПолеФормы_Цена.РежимВыбораИзСписка      = Истина;			
				ПолеФормы_Цена.МаксимальнаяШирина 		= 8;
				ПолеФормы_Цена.Видимость                = НоменклатураЗаполнена;	
				
				// Если услуга бесплатная, на форме вместо цены выводится декорация "Бесплатно"				
				Иначе Если ПроверкаБесплатность = истина Тогда
					ГруппаДекорацииБесплатно = Элементы.Добавить("Группа_Бесплатно_" + ПредставлениеТЧ, Тип("ГруппаФормы"), ГруппаСтрокиТабличнойЧасти);		
					
					ГруппаДекорацииБесплатно.Вид 											= ВидГруппыФормы.ОбычнаяГруппа;
					ГруппаДекорацииБесплатно.Заголовок 										= ГруппаДекорацииБесплатно.Имя;
					ГруппаДекорацииБесплатно.Отображение 									= ОтображениеОбычнойГруппы.Нет;
					ГруппаДекорацииБесплатно.Группировка 									= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
					ГруппаДекорацииБесплатно.ОтображатьЗаголовок 							= Ложь;
					ГруппаДекорацииБесплатно.РастягиватьПоГоризонтали 						= Ложь; // Истина					
					ГруппаДекорацииБесплатно.Ширина 										= 9;
					ГруппаДекорацииБесплатно.Высота											= 0;
					ГруппаДекорацииБесплатно.ГоризонтальноеПоложениеВГруппе 				= ГоризонтальноеПоложениеЭлемента.Центр;
					ГруппаДекорацииБесплатно.ГоризонтальноеПоложениеПодчиненных 			= ГоризонтальноеПоложениеЭлемента.Центр;
					ГруппаДекорацииБесплатно.ВертикальноеПоложениеВГруппе 					= ВертикальноеПоложениеЭлемента.Центр;
					ГруппаДекорацииБесплатно.ВертикальноеПоложениеПодчиненных 				= ВертикальноеПоложениеЭлемента.Центр;
					// ГруппаДекорацииБесплатно.ЦветФона 										= ЦветаСтиля.ЦветВажного;	// ЦветаСтиля.ЦветФонаФормы
					
					ДекорацияФормы_Заглушка_Бесплатно = Форма.Элементы.Добавить("ДекорацияФормы_Заглушка_Бесплатно_ТЧ" + ПредставлениеТЧ, Тип("ДекорацияФормы"), ГруппаДекорацииБесплатно); // ГруппаДекорацииБесплатно
					ДекорацияФормы_Заглушка_Бесплатно.Вид 									= ВидДекорацииФормы.Надпись;
					ДекорацияФормы_Заглушка_Бесплатно.Заголовок 							= "Бесплатно"; // " Бесплатно"										
					ДекорацияФормы_Заглушка_Бесплатно.АвтомаксимальнаяШирина				= Ложь;
					ДекорацияФормы_Заглушка_Бесплатно.АвтомаксимальнаяВысота				= Ложь;
					ДекорацияФормы_Заглушка_Бесплатно.Ширина 								= 8; // 12
					ДекорацияФормы_Заглушка_Бесплатно.МаксимальнаяВысота                    = 0;  
					ДекорацияФормы_Заглушка_Бесплатно.РастягиватьПоГоризонтали 				= Истина;
					ДекорацияФормы_Заглушка_Бесплатно.ГоризонтальноеПоложение				= ГоризонтальноеПоложениеЭлемента.Центр;
					ДекорацияФормы_Заглушка_Бесплатно.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
					ДекорацияФормы_Заглушка_Бесплатно.Шрифт 		                        = Новый Шрифт("Arial", 11); 
					ДекорацияФормы_Заглушка_Бесплатно.ЦветФона 								= ЦветаСтиля.ЦветВажного;
					ДекорацияФормы_Заглушка_Бесплатно.ЦветТекста							= Новый Цвет(255, 255, 255);
				КонецЕсли;			
			КонецЕсли;
			
			//  Создаем группу для декорации удаления строки ТЧ
			ГруппаДекорацииУдаленияСтрокиТабличнойЧасти = Элементы.Добавить("Группа_Удаления_СтрокаТЧ_" + ПредставлениеТЧ, Тип("ГруппаФормы"), ГруппаСтрокиТабличнойЧасти);
			ГруппаДекорацииУдаленияСтрокиТабличнойЧасти.Вид 								= ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДекорацииУдаленияСтрокиТабличнойЧасти.Заголовок 							= ГруппаДекорацииУдаленияСтрокиТабличнойЧасти.Имя;
			ГруппаДекорацииУдаленияСтрокиТабличнойЧасти.Отображение 						= ОтображениеОбычнойГруппы.Нет;
			ГруппаДекорацииУдаленияСтрокиТабличнойЧасти.Группировка 						= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаДекорацииУдаленияСтрокиТабличнойЧасти.ОтображатьЗаголовок 				= Ложь;
			ГруппаДекорацииУдаленияСтрокиТабличнойЧасти.РастягиватьПоГоризонтали 			= Ложь;
			ГруппаДекорацииУдаленияСтрокиТабличнойЧасти.Ширина 								= 2;
			ГруппаДекорацииУдаленияСтрокиТабличнойЧасти.ГоризонтальноеПоложениеВГруппе 		= ГоризонтальноеПоложениеЭлемента.Центр;
			ГруппаДекорацииУдаленияСтрокиТабличнойЧасти.ГоризонтальноеПоложениеПодчиненных 	= ГоризонтальноеПоложениеЭлемента.Центр;
			ГруппаДекорацииУдаленияСтрокиТабличнойЧасти.ВертикальноеПоложениеВГруппе 		= ВертикальноеПоложениеЭлемента.Центр;
			ГруппаДекорацииУдаленияСтрокиТабличнойЧасти.ВертикальноеПоложениеПодчиненных 	= ВертикальноеПоложениеЭлемента.Центр;

			
			// Если ИндексСтрокиТЧ = 0 Тогда 
			//	ДекорацияФормы_Заглушка_УдалитьСтроку = Форма.Элементы.Добавить("ДекорацияФормы_Заглушка_УдалитьСтроку_ТЧ_" + ПредставлениеТЧ, Тип("ДекорацияФормы"), ГруппаДекорацииУдаленияСтрокиТабличнойЧасти);
			//	ДекорацияФормы_Заглушка_УдалитьСтроку.Вид 									= ВидДекорацииФормы.Надпись;
			//	ДекорацияФормы_Заглушка_УдалитьСтроку.Заголовок 							= "";
			//	ДекорацияФормы_Заглушка_УдалитьСтроку.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Верх;
			//	ДекорацияФормы_Заглушка_УдалитьСтроку.Шрифт 								= Новый Шрифт("Arial", 5);
			//	ДекорацияФормы_Заглушка_УдалитьСтроку.УстановитьДействие("Нажатие"	, "Подключаемый_УдалитьСтрокуТабличнойЧасти");
			// КонецЕсли;
			
			ДекорацияФормы_Картинка_УдалитьСтроку = Форма.Элементы.Добавить("ДекорацияФормы_Картинка_УдалитьСтроку_ТЧ_" + ПредставлениеТЧ, Тип("ДекорацияФормы"), ГруппаДекорацииУдаленияСтрокиТабличнойЧасти);
			ДекорацияФормы_Картинка_УдалитьСтроку.Вид 									= ВидДекорацииФормы.Картинка;
			ДекорацияФормы_Картинка_УдалитьСтроку.Заголовок 							= "";
			ДекорацияФормы_Картинка_УдалитьСтроку.Картинка 								= БиблиотекаКартинок.ОчиститьДанные;//?(ИндексСтрокиТЧ = 0, БиблиотекаКартинок.ОчиститьДанные, БиблиотекаКартинок.ОчиститьДанные_Ровная);
			ДекорацияФормы_Картинка_УдалитьСтроку.Гиперссылка 							= Истина;
			ДекорацияФормы_Картинка_УдалитьСтроку.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
			ДекорацияФормы_Картинка_УдалитьСтроку.УстановитьДействие("Нажатие"	, "Подключаемый_УдалитьСтрокуТабличнойЧасти");
			ДекорацияФормы_Картинка_УдалитьСтроку.Видимость = НоменклатураЗаполнена;
			
			ДекорацияФормы_Заглушка_ВместоЗамка = Форма.Элементы.Добавить("ДекорацияФормы_Заглушка_ВместоЗамка_ТЧ_" + ПредставлениеТЧ, Тип("ДекорацияФормы"), ГруппаСтрокиТабличнойЧасти);
			ДекорацияФормы_Заглушка_ВместоЗамка.Вид 									= ВидДекорацииФормы.Надпись;
			ДекорацияФормы_Заглушка_ВместоЗамка.Заголовок 								= "";
			ДекорацияФормы_Заглушка_ВместоЗамка.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
			ДекорацияФормы_Заглушка_ВместоЗамка.Ширина									= 2;

			
			// Заглушка окончание.
			Если Не НоменклатураЗаполнена 
				И НесколькоВрачейВОдномПриеме Тогда
				
				ДекорацияФормы_Заглушка_Окончание = Форма.Элементы.Добавить("ДекорацияФормы_Заглушка_Окончание" + ПредставлениеТЧ, Тип("ДекорацияФормы"), ГруппаСтрокиТабличнойЧасти);
				ДекорацияФормы_Заглушка_Окончание.Вид = ВидДекорацииФормы.Надпись;
				ДекорацияФормы_Заглушка_Окончание.Заголовок = "";
				ДекорацияФормы_Заглушка_Окончание.Ширина = 15;
								
			КонецЕсли;	
			
			Если ВидимостьПоляПакета Тогда
				ДекорацияФормы_Заглушка_УдалитьСтроку = Форма.Элементы.Добавить("ДекорацияФормы_Заглушка_УдалитьСтроку2_ТЧ_" + ПредставлениеТЧ, Тип("ДекорацияФормы"), ГруппаДекорацииУдаленияСтрокиТабличнойЧасти);
				ДекорацияФормы_Заглушка_УдалитьСтроку.Вид 									= ВидДекорацииФормы.Надпись;
				ДекорацияФормы_Заглушка_УдалитьСтроку.Заголовок 							= "";
				ДекорацияФормы_Заглушка_УдалитьСтроку.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
				ДекорацияФормы_Заглушка_УдалитьСтроку.Шрифт 								= Новый Шрифт("Arial", 12);
			КонецЕсли;
			
				//  Создаем поле признака блокировки строки ТЧ.
			// ГруппаПоляБлокировкиСтрокиТабличнойЧасти = Элементы.Добавить("Группа_Блокировки_СтрокаТЧ_" + ПредставлениеТЧ, Тип("ГруппаФормы"), ГруппаСтрокиТабличнойЧасти);
			// ГруппаПоляБлокировкиСтрокиТабличнойЧасти.Вид 								= ВидГруппыФормы.ОбычнаяГруппа;
			// ГруппаПоляБлокировкиСтрокиТабличнойЧасти.Заголовок 							= ГруппаПоляБлокировкиСтрокиТабличнойЧасти.Имя;
			// ГруппаПоляБлокировкиСтрокиТабличнойЧасти.Отображение 						= ОтображениеОбычнойГруппы.Нет;
			// ГруппаПоляБлокировкиСтрокиТабличнойЧасти.Группировка 						= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			// ГруппаПоляБлокировкиСтрокиТабличнойЧасти.ОтображатьЗаголовок 				= Ложь;
			// ГруппаПоляБлокировкиСтрокиТабличнойЧасти.РастягиватьПоГоризонтали 			= Ложь;
			// ГруппаПоляБлокировкиСтрокиТабличнойЧасти.Ширина                             = 2;
			// ГруппаПоляБлокировкиСтрокиТабличнойЧасти.ВертикальныйИнтервал               = ИнтервалМеждуЭлементамиФормы.Полуторный;
			// ГруппаПоляБлокировкиСтрокиТабличнойЧасти.ГоризонтальноеПоложениеВГруппе     = ГоризонтальноеПоложениеЭлемента.Центр;
			// ГруппаПоляБлокировкиСтрокиТабличнойЧасти.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
			//
			// Если ИндексСтрокиТЧ = 0 Тогда 
			//	ДекорацияФормы_Заглушка_БлокироватьСтроку = Форма.Элементы.Добавить("ДекорацияФормы_Заглушка_Блокировать_ТЧ_" + ПредставлениеТЧ, Тип("ДекорацияФормы"), ГруппаПоляБлокировкиСтрокиТабличнойЧасти);
			//	ДекорацияФормы_Заглушка_БлокироватьСтроку.Вид       = ВидДекорацииФормы.Надпись;
			//	ДекорацияФормы_Заглушка_БлокироватьСтроку.Заголовок = "";
			//	ДекорацияФормы_Заглушка_БлокироватьСтроку.Шрифт     = Новый Шрифт("Arial", 5); 
			// КонецЕсли;
			//
			// Если НоменклатураЗаполнена Тогда
			//	
			//	ПолеФормы_БлокироватьСтроку = Элементы.Добавить("ПолеФормы_БлокироватьСтроку_ТЧ_" + ПредставлениеТЧ, Тип("ПолеФормы"), ГруппаПоляБлокировкиСтрокиТабличнойЧасти);
			//	ПолеФормы_БлокироватьСтроку.Вид                            = ВидПоляФормы.ПолеКартинки;
			//	ПолеФормы_БлокироватьСтроку.ПутьКДанным                    = "Объект." + ПараметрыТабличнойЧасти.ТабличнаяЧасть + "["+ Строка(ИндексСтрокиТЧ) + "]" + ".ПризнакЗаблокированно";
			//	ПолеФормы_БлокироватьСтроку.ПоложениеЗаголовка             = ПоложениеЗаголовкаЭлементаФормы.Нет;
			//	ПолеФормы_БлокироватьСтроку.КартинкаЗначений               = БиблиотекаКартинок.КоллекцияКартинокБлокировкаНовая;
			//	ПолеФормы_БлокироватьСтроку.Гиперссылка                    = Истина;
			//	ПолеФормы_БлокироватьСтроку.Ширина                         = 2;
			//	ПолеФормы_БлокироватьСтроку.Рамка                          = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
			//	ПолеФормы_БлокироватьСтроку.РастягиватьПоГоризонтали       = Ложь;
			//	ПолеФормы_БлокироватьСтроку.РастягиватьПоВертикали         = Ложь;
			//	ПолеФормы_БлокироватьСтроку.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
			//	
			//	ПолеФормы_БлокироватьСтроку.УстановитьДействие("Нажатие", "Подключаемый_БлокироватьСтрокуТабличнойЧасти");
			//	
			// КонецЕсли;
			
			
			ПредыдущаяСтрока = СтрокаТЧ;
			
		КонецЦикла;
		
		//  Создаем декорацию "Услуги отсутствуют"
		Если ГруппаРодительТабличнойЧасти.ПодчиненныеЭлементы.Количество() = 0 Тогда 
			
			ДекорацияФормы_Услуги_Отсутствуют = Форма.Элементы.Добавить("ДекорацияФормы_Услуги_Отсутствуют_ТЧ_" + ПараметрыТабличнойЧасти.ТабличнаяЧасть, Тип("ДекорацияФормы"), ГруппаРодительТабличнойЧасти);
			ДекорацияФормы_Услуги_Отсутствуют.Вид 									= ВидДекорацииФормы.Надпись;
			ДекорацияФормы_Услуги_Отсутствуют.Заголовок 							= "Услуги отсутствуют";
			ДекорацияФормы_Услуги_Отсутствуют.РастягиватьПоГоризонтали 				= Истина;
			ДекорацияФормы_Услуги_Отсутствуют.АвтоМаксимальнаяШирина 				= Ложь;
			ДекорацияФормы_Услуги_Отсутствуют.МаксимальнаяШирина 					= 55; // 127
			ДекорацияФормы_Услуги_Отсутствуют.ГоризонтальноеПоложение 				= ГоризонтальноеПоложениеЭлемента.Центр;
			ДекорацияФормы_Услуги_Отсутствуют.ВертикальноеПоложение 				= ВертикальноеПоложениеЭлемента.Центр;			
			ДекорацияФормы_Услуги_Отсутствуют.ГоризонтальноеПоложениеВГруппе 		= ГоризонтальноеПоложениеЭлемента.Центр;
			ДекорацияФормы_Услуги_Отсутствуют.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
			ДекорацияФормы_Услуги_Отсутствуют.Шрифт 								= Новый Шрифт("Arial", 11); 
			// ДекорацияФормы_Услуги_Отсутствуют.ЦветФона 								= ЦветаСтиля.ЦветФонаЗадач;
			
		КонецЕсли;
			
	КонецЦикла;

		
	//	Форма.ОтобразитьНовуюСтроку();
	
КонецПроцедуры

// Процедура - Заполнить шкалу длительности приема
//
// Параметры:
//  Форма				 - 	 ЭтаФорма 
//  ГруппаВыводаКнопок	 - 	 Тип строка, название группы для вывода кнопок длительности 
//  МассивДлительностей	 - 	 Длительности, которые необходимо вывести.
//							 Если Неопределено - длительности берутся из регистра длительностей.
//							 Не учитывается, если передать НовыйЭлемент!							 
//  НовыйЭлемент		 - 	 Длительность, которую необходимо добавить. Если передать этот параметр, будет  только отрисован этот элемент 
//  ВозможностьУдалять	 - 	 Истина = Выводить кнопки удаления возле каждой длительности. Истина - только для формы настроек планировщика. 
//
Процедура ЗаполнитьШкалуДлительностиПриема(Форма, ГруппаВыводаКнопок, МассивДлительностей, НовыйЭлемент, ВозможностьУдалять = Ложь, РасширениеПланировщикаАктивно = Истина) Экспорт
	
	Массив_Длительности = Новый Массив;

	Если НЕ ЗначениеЗаполнено(ГруппаВыводаКнопок) Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьКнопкиДлительности = Ложь;
	
	Если ЗначениеЗаполнено(НовыйЭлемент) ИЛИ НовыйЭлемент = 0 Тогда	
		
		// Использовалась кнопка N'
		Если НЕ ТипЗнч(НовыйЭлемент) = Тип("Массив") Тогда
			Массив_Длительности.Добавить(НовыйЭлемент);
		Иначе
			Массив_Длительности = НовыйЭлемент;
		КонецЕсли;	
		
		// КоличествоКнопокДлительности = РегистрыСведений.ДлительностиПриемов.ПолучитьКоличествоКнопокДлительности() + Массив_Длительности.Количество();
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(МассивДлительностей) Тогда
			Массив_Длительности = РегистрыСведений.ДлительностиПриемов.ВернутьДлительностиПриемов(Истина);
		КонецЕсли;
		УдалитьКнопкиДлительности = Истина;
		
		Массив_Длительности.Добавить("N");
		
		// КоличествоКнопокДлительности = Массив_Длительности.Количество();
		
	КонецЕсли;
	
	КоличествоЭлементовВГруппе = ?(ВозможностьУдалять, ?(РасширениеПланировщикаАктивно, 9, 8), 11);
	
	ГруппаДляРазмещенияДлительности = Форма.Элементы.Найти(ГруппаВыводаКнопок);	

	Если НЕ ГруппаДляРазмещенияДлительности = Неопределено Тогда
				
		// Удаляем созданные группы с длительностями
		Если УдалитьКнопкиДлительности Тогда
			
			МассивУдаляемыхГрупп = Новый Массив;		
			Для Каждого УдаляемаяОбщаяГруппа Из ГруппаДляРазмещенияДлительности.ПодчиненныеЭлементы Цикл
				МассивУдаляемыхГрупп.Добавить(УдаляемаяОбщаяГруппа);				
			КонецЦикла;		
			Для Каждого УдаляемыйЭлемент Из МассивУдаляемыхГрупп Цикл
				Форма.Элементы.Удалить(УдаляемыйЭлемент);
			КонецЦикла;
			
		КонецЕсли;
				
		Если ВозможностьУдалять Тогда
			
			Если Форма.Команды.Найти("УстановитьВремяДлительности") = Неопределено Тогда
				КомандаУстановитьВремяДлительности				= Форма.Команды.Добавить("УстановитьВремяДлительности");
				КомандаУстановитьВремяДлительности.Заголовок	= "Элемент длительности приема";
				КомандаУстановитьВремяДлительности.Действие		= "Подключаемый_УстановитьВремяДлительности";
			КонецЕсли;
			
			ЭтоВебКлиент = ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент();
			
		Иначе
			ЭтоВебКлиент = Форма.ЗапускВэбКлиент;
		КонецЕсли;
		
		КешИндексГруппы = 1;
		ГруппаДляРазмещенияДлительностиОбщая = Неопределено;
		
		Для НомерСоздаваемойКнопки = 0 По Массив_Длительности.ВГраница() Цикл	
			
			// Создание групп-контейнеров по рядам
			
			Если НовыйЭлемент = Неопределено Тогда
				
				ТекущийИндексГруппы = Цел(НомерСоздаваемойКнопки / (КоличествоЭлементовВГруппе));
				
				Если КешИндексГруппы = ТекущийИндексГруппы Тогда
					
					Если ГруппаДляРазмещенияДлительностиОбщая = Неопределено Тогда					
						ГруппаДляРазмещенияДлительностиОбщая = Форма.Элементы.Найти(ГруппаДляРазмещенияДлительности.Имя + "_Общая_"+ТекущийИндексГруппы);						
					КонецЕсли;
					
				Иначе
					
					ГруппаДляРазмещенияДлительностиОбщая = Форма.Элементы.Добавить(ГруппаДляРазмещенияДлительности.Имя + "_Общая_"+ТекущийИндексГруппы, Тип("ГруппаФормы"), ГруппаДляРазмещенияДлительности);
					ГруппаДляРазмещенияДлительностиОбщая.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
					ГруппаДляРазмещенияДлительностиОбщая.Заголовок 				= ГруппаДляРазмещенияДлительности.Имя;
					ГруппаДляРазмещенияДлительностиОбщая.Отображение 			= ОтображениеОбычнойГруппы.Нет;
					ГруппаДляРазмещенияДлительностиОбщая.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
					ГруппаДляРазмещенияДлительностиОбщая.ОтображатьЗаголовок 	= Ложь;
					ГруппаДляРазмещенияДлительностиОбщая.ГоризонтальныйИнтервал	= ИнтервалМеждуЭлементамиФормы.Одинарный;
					
					Если ВозможностьУдалять Тогда
						ГруппаДляРазмещенияДлительностиОбщая.ВертикальныйИнтервал	= ИнтервалМеждуЭлементамиФормы.Половинный;							
					КонецЕсли;
					
					КешИндексГруппы = ТекущийИндексГруппы;
					
				КонецЕсли;
			Иначе
				
				КоличествоГруппыДлительностиНаФорме = ГруппаДляРазмещенияДлительности.ПодчиненныеЭлементы.Количество();	
				
				Если ЗначениеЗаполнено(КоличествоГруппыДлительностиНаФорме) Тогда 
					ГруппаДляРазмещенияДлительностиОбщая = ГруппаДляРазмещенияДлительности.ПодчиненныеЭлементы[КоличествоГруппыДлительностиНаФорме-1];
				Иначе
					ГруппаДляРазмещенияДлительностиОбщая = ГруппаДляРазмещенияДлительности;
				КонецЕсли;
								
			КонецЕсли;
			
			// Создание кнопок длительности
			
			ЭлементДлительность = Массив_Длительности[НомерСоздаваемойКнопки];
			
			Если НЕ Форма.Элементы.Найти(ГруппаДляРазмещенияДлительности.Имя + "_" + ЭлементДлительность) = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			Если ВозможностьУдалять Тогда 	
				
				ГруппаВыравниваниеЭлементаДлительности = Форма.Элементы.Добавить("Выравнивание"+ГруппаДляРазмещенияДлительности.Имя + "_" + ЭлементДлительность, Тип("ГруппаФормы"), ГруппаДляРазмещенияДлительностиОбщая);
				ГруппаВыравниваниеЭлементаДлительности.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаВыравниваниеЭлементаДлительности.Заголовок 			= ГруппаВыравниваниеЭлементаДлительности.Имя;
				ГруппаВыравниваниеЭлементаДлительности.Отображение 			= ОтображениеОбычнойГруппы.Нет;
				ГруппаВыравниваниеЭлементаДлительности.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
				ГруппаВыравниваниеЭлементаДлительности.ОтображатьЗаголовок 	= Ложь;
				ГруппаВыравниваниеЭлементаДлительности.ГоризонтальныйИнтервал	= ИнтервалМеждуЭлементамиФормы.Нет;	
				
			КонецЕсли;
			
			ГруппаЭлементаДлительности = Форма.Элементы.Добавить(ГруппаДляРазмещенияДлительности.Имя + "_" + ЭлементДлительность, Тип("ГруппаФормы"), ?(ВозможностьУдалять, ГруппаВыравниваниеЭлементаДлительности, ГруппаДляРазмещенияДлительностиОбщая));
			ГруппаЭлементаДлительности.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаЭлементаДлительности.Заголовок 			= ?(ЭлементДлительность = "N", "", ГруппаЭлементаДлительности.Имя);
			ГруппаЭлементаДлительности.Отображение 			= ОтображениеОбычнойГруппы.Нет;
			ГруппаЭлементаДлительности.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			ГруппаЭлементаДлительности.ОтображатьЗаголовок 	= Ложь;
			ГруппаЭлементаДлительности.ЦветФона				= Новый Цвет(242, 242, 242);
			
			КнопкаИмяКоманды = ?(ЭлементДлительность = "N" И ВозможностьУдалять, "ДлительностьПриемаДобавить", 
															?(НовыйЭлемент = Неопределено И НЕ ЭлементДлительность = "N", "УстановитьВремяДлительности", "ИзменитьДлительностьПриема"));
			
			КнопкаЭлементаДлительности = Форма.Элементы.Добавить("КнопкаДлительности_" + ЭлементДлительность, Тип("КнопкаФормы"), ГруппаЭлементаДлительности);
			КнопкаЭлементаДлительности.Отображение       	= ОтображениеКнопки.Текст;
			КнопкаЭлементаДлительности.ОтображениеФигуры 	= ОтображениеФигурыКнопки.Нет;
			КнопкаЭлементаДлительности.ИмяКоманды        	= КнопкаИмяКоманды;
			
			ДлительностьКолвоСимволов = СтрДлина(Строка(ЭлементДлительность));
			Если ЭтоВебКлиент Тогда
				ШиринаКнопки = ?(ДлительностьКолвоСимволов <= 1, 2, 3);
			Иначе
				ШиринаКнопки = ?(ДлительностьКолвоСимволов <= 2, 3, 4);
			КонецЕсли;	
			
			КнопкаЭлементаДлительности.Ширина			    = ШиринаКнопки;
			КнопкаЭлементаДлительности.Заголовок		    = "" + ЭлементДлительность + "'";
			КнопкаЭлементаДлительности.ОтображениеПодсказки = ОтображениеПодсказки.Авто;		
					
			Если ВозможностьУдалять И НЕ ЭлементДлительность = "N" Тогда
				
				КнопкаУдаленияДлительности = Форма.Элементы.Добавить("КнопкаУдаленияДлительности_" + ЭлементДлительность, Тип("КнопкаФормы"), ГруппаВыравниваниеЭлементаДлительности);
				КнопкаУдаленияДлительности.Отображение       	= ОтображениеКнопки.Картинка;
				КнопкаУдаленияДлительности.ОтображениеФигуры 	= ОтображениеФигурыКнопки.Нет;
				КнопкаУдаленияДлительности.Картинка 			= БиблиотекаКартинок.ОтменаОчиститьДанныеНовая;
				КнопкаУдаленияДлительности.ИмяКоманды        	= "ДлительностьПриемаУдалить";			
				КнопкаУдаленияДлительности.Заголовок		    = "";
				КнопкаУдаленияДлительности.ОтображениеПодсказки = ОтображениеПодсказки.Авто;
				КнопкаУдаленияДлительности.Ширина				= 2;
				КнопкаУдаленияДлительности.Высота				= 0;
				
			КонецЕсли;
			
			// Создание интерфейса добавления длительности
			
			Если ЭлементДлительность = "N" Тогда
				
				ПолеВводаДлительности 							= Форма.Элементы.Добавить("НовыйЭлементДлительностиПриема", Тип("ПолеФормы"), ГруппаЭлементаДлительности);
				ПолеВводаДлительности.Вид 						= ВидПоляФормы.ПолеВвода;
				ПолеВводаДлительности.Заголовок 				= "";
				ПолеВводаДлительности.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;
				ПолеВводаДлительности.ПутьКДанным 				= "НовыйЭлементДлительностиПриема";
				ПолеВводаДлительности.Видимость 				= Ложь;
				ПолеВводаДлительности.АвтоМаксимальнаяШирина	= Ложь;
				ПолеВводаДлительности.Ширина					= 0;
				ПолеВводаДлительности.МаксимальнаяШирина		= 4;
				ПолеВводаДлительности.УстановитьДействие("ПриИзменении", "Подключаемый_НовыйЭлементДлительностиПриемаПриИзменении");
				
				КнопкаЭлементаДлительности = Форма.Элементы.Добавить("СохранитьЭлементДлительностиПриема", Тип("КнопкаФормы"), ?(ВозможностьУдалять, ГруппаВыравниваниеЭлементаДлительности, ГруппаДляРазмещенияДлительностиОбщая)); //);
				КнопкаЭлементаДлительности.Отображение       	= ОтображениеКнопки.Картинка;
				КнопкаЭлементаДлительности.ОтображениеФигуры 	= ОтображениеФигурыКнопки.Нет;
				КнопкаЭлементаДлительности.Картинка				= БиблиотекаКартинок.ГалочкаОкейНовая;
				КнопкаЭлементаДлительности.ИмяКоманды        	= "ДлительностьПриемаСохранить";
				КнопкаЭлементаДлительности.ОтображениеПодсказки = ОтображениеПодсказки.Авто;	
				КнопкаЭлементаДлительности.Видимость 			= Ложь;				
				
			КонецЕсли;			
			
			Если ЭлементДлительность = "N" ИЛИ НЕ НовыйЭлемент = Неопределено Тогда
				
				КнопкаУдаленияНаФорме = Форма.Элементы.Найти("УдалитьЭлементДлительностиПриема"); 
				
				Если НЕ КнопкаУдаленияНаФорме = Неопределено Тогда
					Форма.Элементы.Удалить(КнопкаУдаленияНаФорме);					
				КонецЕсли;
												
				КнопкаЭлементаДлительности = Форма.Элементы.Добавить("УдалитьЭлементДлительностиПриема", Тип("КнопкаФормы"), ?(ВозможностьУдалять, ГруппаВыравниваниеЭлементаДлительности, ГруппаДляРазмещенияДлительностиОбщая)); //);
				КнопкаЭлементаДлительности.Отображение       	= ОтображениеКнопки.Картинка;
				КнопкаЭлементаДлительности.ОтображениеФигуры 	= ОтображениеФигурыКнопки.Нет;
				КнопкаЭлементаДлительности.Картинка				= БиблиотекаКартинок.ОтменаОчиститьДанныеНовая;
				КнопкаЭлементаДлительности.ИмяКоманды        	= "ДлительностьПриемаУдалить";
				КнопкаЭлементаДлительности.ОтображениеПодсказки = ОтображениеПодсказки.Авто;	
				КнопкаЭлементаДлительности.Видимость 			= Ложь;
			
			КонецЕсли;			
			
		КонецЦикла;		
		
	КонецЕсли;
	
КонецПроцедуры

//  Процедура, заполняет свойства поля сотрудника.
// 
Процедура ЗаполнитьСвойстваПоляСотрудника(ПолеФормы_Сотрудник, ОтображатьЗаголовок)
	
	ПолеФормы_Сотрудник.Вид 					  = ВидПоляФормы.ПолеВвода;
	ПолеФормы_Сотрудник.ПоложениеЗаголовка 		  = ?(ОтображатьЗаголовок, ПоложениеЗаголовкаЭлементаФормы.Верх, ПоложениеЗаголовкаЭлементаФормы.Нет);
	ПолеФормы_Сотрудник.ОтображениеКнопкиВыбора   = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	ПолеФормы_Сотрудник.КнопкаВыбора			  = Истина;
	ПолеФормы_Сотрудник.КнопкаВыпадающегоСписка   = Ложь;
	ПолеФормы_Сотрудник.КнопкаСоздания      	  = Ложь;
	ПолеФормы_Сотрудник.АвтоМаксимальнаяШирина 	  = Ложь;
	ПолеФормы_Сотрудник.ВыборГруппИЭлементов      = ГруппыИЭлементы.Элементы;
	ПолеФормы_Сотрудник.ИсторияВыбораПриВводе	  = ИсторияВыбораПриВводе.НеИспользовать;
	ПолеФормы_Сотрудник.АвтоОтметкаНезаполненного = Ложь;
	
КонецПроцедуры

//  Процедура - Вывести время ожидания
// 
//  Параметры:
//   Форма						 - 	 - 
//   ГруппаРодительТабличнойЧасти - 	 - 
//   ВремяОжидания				 - 	 - 
// 
Процедура ВывестиВремяОжидания(Форма, ГруппаРодительТабличнойЧасти, ПараметрыТабличнойЧасти, ВремяОжидания, ДатаНачалаОжидания, ИндексСтрокиТЧ)
	
	НоваяСтрока 					= Форма.Таблица_ВремениОжидания.Добавить();
	// НоваяСтрока.КлючСтроки 			= КлючСтроки;
	НоваяСтрока.ВремяОжидания 		= ВремяОжидания;
	Часов  							= Цел(ВремяОжидания / 60);
	Минут 							= ВремяОжидания - (Часов * 60);
	НоваяСтрока.Надпись             = "Ожидание";
	НоваяСтрока.ВремяОжидания_Текст = СокрЛП(?(Часов > 0 ,"" + Часов + ?(Часов = 1, " час ", " часа "), "") + ?(Минут > 0 ,"" + Минут + " мин.", ""));
	НоваяСтрока.ДатаНачалаОжидания  = ДатаНачалаОжидания;
	
	ИндексСтроки 					= Форма.Таблица_ВремениОжидания.Индекс(НоваяСтрока);
	
	ГруппаСтрокиОжидания = Форма.Элементы.Добавить("Группа_Строка_Ожидания_" + ПараметрыТабличнойЧасти.ТабличнаяЧасть + "_" + ИндексСтроки, Тип("ГруппаФормы"), ГруппаРодительТабличнойЧасти);		
	ГруппаСтрокиОжидания.Вид                                = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСтрокиОжидания.Заголовок                          = ГруппаСтрокиОжидания.Имя;
	ГруппаСтрокиОжидания.Отображение                        = ОтображениеОбычнойГруппы.Нет;
	ГруппаСтрокиОжидания.Группировка                        = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	ГруппаСтрокиОжидания.ОтображатьЗаголовок                = Ложь;
	ГруппаСтрокиОжидания.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Лево;
	ГруппаСтрокиОжидания.ГоризонтальныйИнтервал             = ИнтервалМеждуЭлементамиФормы.Одинарный;
	
	// ДекорацияФормы_Заглушка_СтрокаОжидания = Форма.Элементы.Добавить("ДекорацияФормы_Заглушка_Строка_Ожидания_" + ПараметрыТабличнойЧасти.ТабличнаяЧасть + "_" + ИндексСтроки, Тип("ДекорацияФормы"), ГруппаСтрокиОжидания);
	// ДекорацияФормы_Заглушка_СтрокаОжидания.Вид                    = ВидДекорацииФормы.Надпись;
	// ДекорацияФормы_Заглушка_СтрокаОжидания.Заголовок              = "";
	// ДекорацияФормы_Заглушка_СтрокаОжидания.АвтоМаксимальнаяШирина = Ложь;
	// ДекорацияФормы_Заглушка_СтрокаОжидания.МаксимальнаяШирина     = 0; // 2
	// ДекорацияФормы_Заглушка_СтрокаОжидания.Ширина                 = 0; // 2
	
	ПолеФормы_ВремяНачала = Форма.Элементы.Добавить("ПолеФормы_ДатаНачалаОжидания_" + ПараметрыТабличнойЧасти.ТабличнаяЧасть + "_" + ИндексСтроки, Тип("ПолеФормы"), ГруппаСтрокиОжидания);
	ПолеФормы_ВремяНачала.Вид                            = ВидПоляФормы.ПолеВвода;
	ПолеФормы_ВремяНачала.ПутьКДанным                    = "Таблица_ВремениОжидания[" + Строка(ИндексСтроки) + "]" + ".ДатаНачалаОжидания";
	ПолеФормы_ВремяНачала.ПоложениеЗаголовка             = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеФормы_ВремяНачала.КнопкаВыбора                   = Ложь;
	ПолеФормы_ВремяНачала.КнопкаВыпадающегоСписка        = Ложь;
	ПолеФормы_ВремяНачала.КнопкаОчистки                  = Ложь;
	ПолеФормы_ВремяНачала.КнопкаРегулирования            = Ложь;
	ПолеФормы_ВремяНачала.КнопкаОткрытия                 = Ложь;
	ПолеФормы_ВремяНачала.КнопкаСоздания                 = Ложь;
	ПолеФормы_ВремяНачала.РастягиватьПоГоризонтали       = Ложь;
	ПолеФормы_ВремяНачала.АвтоМаксимальнаяШирина         = Ложь;
	ПолеФормы_ВремяНачала.МаксимальнаяШирина             = 5;
	ПолеФормы_ВремяНачала.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
	ПолеФормы_ВремяНачала.ВертикальноеПоложениеВГруппе   = ВертикальноеПоложениеЭлемента.Центр;
	ПолеФормы_ВремяНачала.ГоризонтальноеПоложение        = ГоризонтальноеПоложениеЭлемента.Лево;
	ПолеФормы_ВремяНачала.ТолькоПросмотр                 = Истина;
	
	ПолеФормы_Надпись = Форма.Элементы.Добавить("ПолеФормы_Надпись_" + ПараметрыТабличнойЧасти.ТабличнаяЧасть + "_" + ИндексСтроки, Тип("ПолеФормы"), ГруппаСтрокиОжидания);
	ПолеФормы_Надпись.Вид                            = ВидПоляФормы.ПолеВвода;
	ПолеФормы_Надпись.ПутьКДанным                    = "Таблица_ВремениОжидания[" + Строка(ИндексСтроки) + "]" + ".Надпись";
	ПолеФормы_Надпись.ПоложениеЗаголовка             = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеФормы_Надпись.КнопкаВыбора                   = Ложь;
	ПолеФормы_Надпись.КнопкаВыпадающегоСписка        = Ложь;
	ПолеФормы_Надпись.КнопкаОчистки                  = Ложь;
	ПолеФормы_Надпись.КнопкаРегулирования            = Ложь;
	ПолеФормы_Надпись.КнопкаОткрытия                 = Ложь;
	ПолеФормы_Надпись.КнопкаСоздания                 = Ложь;
	ПолеФормы_Надпись.РастягиватьПоГоризонтали       = Ложь;
	ПолеФормы_Надпись.АвтоМаксимальнаяШирина         = Ложь;
	ПолеФормы_Надпись.МаксимальнаяШирина             = 36; // 99
	ПолеФормы_Надпись.Ширина             			 = 36; // 91
	ПолеФормы_Надпись.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
	ПолеФормы_Надпись.ВертикальноеПоложениеВГруппе   = ВертикальноеПоложениеЭлемента.Центр;
	ПолеФормы_Надпись.ГоризонтальноеПоложение        = ГоризонтальноеПоложениеЭлемента.Лево;
	ПолеФормы_Надпись.ТолькоПросмотр                 = Истина;
	
	ПолеФормы_Ожидание = Форма.Элементы.Добавить("ПолеФормы_ВремяОжидания_Текст_" + ПараметрыТабличнойЧасти.ТабличнаяЧасть + "_" + ИндексСтроки, Тип("ПолеФормы"), ГруппаСтрокиОжидания);
	ПолеФормы_Ожидание.Вид                            = ВидПоляФормы.ПолеВвода;
	ПолеФормы_Ожидание.ПутьКДанным                    = "Таблица_ВремениОжидания[" + Строка(ИндексСтроки) + "]" + ".ВремяОжидания_Текст";
	ПолеФормы_Ожидание.ПоложениеЗаголовка             = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеФормы_Ожидание.КнопкаВыбора                   = Ложь;
	ПолеФормы_Ожидание.КнопкаВыпадающегоСписка        = Ложь;
	ПолеФормы_Ожидание.КнопкаОчистки                  = Ложь;
	ПолеФормы_Ожидание.КнопкаРегулирования            = Ложь;
	ПолеФормы_Ожидание.КнопкаОткрытия                 = Ложь;
	ПолеФормы_Ожидание.КнопкаСоздания                 = Ложь;
	ПолеФормы_Ожидание.РастягиватьПоГоризонтали       = Ложь;
	ПолеФормы_Ожидание.АвтоМаксимальнаяШирина         = Ложь;    
	ПолеФормы_Ожидание.МаксимальнаяШирина             = 6;
	ПолеФормы_Ожидание.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	ПолеФормы_Ожидание.ВертикальноеПоложениеВГруппе   = ВертикальноеПоложениеЭлемента.Центр;
	ПолеФормы_Ожидание.ГоризонтальноеПоложение        = ГоризонтальноеПоложениеЭлемента.Право;
	ПолеФормы_Ожидание.ТолькоПросмотр                 = Истина;
	
	ДекорацияФормы_Картинка_УдалитьСтроку = Форма.Элементы.Добавить("ДекорацияФормы_КартинкаОжидание_УдалитьСтроку_ТЧ_" + ПараметрыТабличнойЧасти.ТабличнаяЧасть + "_" + ИндексСтрокиТЧ, Тип("ДекорацияФормы"), ГруппаСтрокиОжидания);
	ДекорацияФормы_Картинка_УдалитьСтроку.Вид 						   = ВидДекорацииФормы.Картинка;
	ДекорацияФормы_Картинка_УдалитьСтроку.Заголовок 				   = "";
	ДекорацияФормы_Картинка_УдалитьСтроку.Картинка 					   = БиблиотекаКартинок.ОчиститьДанные;
	ДекорацияФормы_Картинка_УдалитьСтроку.Гиперссылка                  = Истина;
	ДекорацияФормы_Картинка_УдалитьСтроку.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	ДекорацияФормы_Картинка_УдалитьСтроку.УстановитьДействие("Нажатие", "Подключаемый_УдалитьСтрокуТабличнойЧастиОжидание");
	
КонецПроцедуры

Функция ЕстьДоступныйПакетУслугПоУслуге(Номенклатура, ВидЦен, ТаблицаОстатковПакетов)
	
	Для Каждого СтрокаТОП Из ТаблицаОстатковПакетов Цикл
		
		Если СтрокаТОП.Используется
			И СтрокаТОП.Количество > 0 
			И СтрокаТОП.КатегорияЦен = ВидЦен  						
			И ((ТипЗнч(СтрокаТОП.УслугаСегмент) = Тип("СправочникСсылка.СегментыНоменклатуры") 
			И РегистрыСведений.СоставСегментов.СегментСодержитОбъект(СтрокаТОП.УслугаСегмент, Номенклатура))
			ИЛИ СтрокаТОП.УслугаСегмент = Номенклатура) Тогда
			
			Возврат Истина;
			
		КонецЕсли;		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

//  Процедура - Установить параметры выбора номенклатуры
// 
//  Параметры:
//   Элемент	 - 	 - 
//   СтрокаТЧ - 	 - 
// 
Процедура УстановитьПараметрыВыбораНоменклатуры(Элемент, СтрокаТЧ)
	
	МассивПараметров 		= Новый Массив;
	
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Услуга));
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры

//  Процедура - Установить параметры выбора помещения
// 
//  Параметры:
//   ВладелецСсылка	 - 	 - 
//   Элемент			 - 	 - 
//   СтрокаТЧ		 - 	 - 
// 
Процедура УстановитьПараметрыВыбораПомещения(ВладелецСсылка, Элемент, СтрокаТЧ)
	
	МассивПараметров 		= Новый Массив;
	
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.СтруктурнаяЕдиница", ?(ЗначениеЗаполнено(ВладелецСсылка.СтруктурнаяЕдиница), ВладелецСсылка.СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница)));
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры

// Функция возвращает интервалы времени
// 
//  Параметры
//   МассивПериодов - структура, периоды, между которыми необходимо возвратить интервалы
//   Интервал - число, интервал в минутах
//   Формат - строка, представление интервала
//
// Возвращаемое значение:
//   СписокЗначений, список времени с интервалом.
//
Функция ВернутьСписокВремениНаСервере(МассивПериодов, ДатаНачала, Интервал = 15, Формат = "ДФ=ЧЧ:мм") Экспорт
	
	СписокВремени = Новый СписокЗначений;
	
	Для Каждого Период Из МассивПериодов Цикл
		Если ДатаНачала Тогда
			Счетчик = 0;
		Иначе
			Счетчик = 1;
		КонецЕсли;
		Период.ДатаНачала = НачалоЧаса(Период.ДатаНачала) + Цел (Минута(Период.ДатаНачала) / 15) * 15 * 60;
		Пока Период.ДатаНачала + Интервал * 60 * Счетчик <= Период.ДатаОкончания Цикл
			Время = Период.ДатаНачала + Интервал * 60 * Счетчик;
			Если СписокВремени.НайтиПоЗначению(Время) = Неопределено Тогда
				Если не ЗначениеЗаполнено(Время) Тогда
					СписокВремени.Добавить(Время, "00:00");
				Иначе
					СписокВремени.Добавить(Время, Формат(Время, Формат));
				КонецЕсли;
			КонецЕсли;			
			Счетчик = Счетчик + 1;
		КонецЦикла;
		Если Период.ДатаОкончания = Дата(01,01,01,23,59,59) и не ДатаНачала Тогда
			СписокВремени.Добавить(Период.ДатаНачала + Интервал * 60 * Счетчик, "24:00");
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокВремени; 
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция, создает копию кнопки формы.
//
Функция КопироватьКнопкуФормы(Форма, КнопкаИсточник, ПрефиксИмениНовойКнопки, Родитель,знач ОбработчикНажатия = Неопределено,знач НовыйЗаголовок = Неопределено) Экспорт
	
	ИмяИсточника     = КнопкаИсточник.Имя;  
	КомандаИсточника = Форма.Команды.Найти(КнопкаИсточник.ИмяКоманды);
	
	Если НЕ ЗначениеЗаполнено(ОбработчикНажатия) Тогда    
		ОбработчикНажатия   = КомандаИсточника.Действие  
	КонецЕсли;
	
	Если СтрНайти(ИмяИсточника, "_") > 0 Тогда    
		ИмяИсточника = Лев(ИмяИсточника, СтрНайти(ИмяИсточника, "_"));       
	КонецЕсли;
	
	ИмяНовойКнопки = ИмяИсточника + ПрефиксИмениНовойКнопки;
	
	Если Форма.Команды.Найти(ИмяНовойКнопки) = Неопределено Тогда  
		
		КомандаФормы            = Форма.Команды.Добавить(ИмяНовойКнопки);
		КомандаФормы.Действие   = ОбработчикНажатия;
		КомандаФормы.Заголовок  = КомандаИсточника.Заголовок; 
		КомандаФормы.Подсказка  = КомандаИсточника.Подсказка; 
		
	КонецЕсли;
	
	НоваяКнопка                        = Форма.Элементы.Добавить(ИмяНовойКнопки, Тип("КнопкаФормы"), Родитель);
	
	НоваяКнопка.Заголовок              = ?(ЗначениеЗаполнено(НовыйЗаголовок), НовыйЗаголовок, КнопкаИсточник.Заголовок);
	НоваяКнопка.ИмяКоманды             = ИмяНовойКнопки;
	НоваяКнопка.ОтображениеФигуры      = КнопкаИсточник.ОтображениеФигуры;
	НоваяКнопка.ОтображениеПодсказки   = КнопкаИсточник.ОтображениеПодсказки;
	НоваяКнопка.Видимость              = КнопкаИсточник.Видимость;
	НоваяКнопка.ЦветТекста             = КнопкаИсточник.ЦветТекста;  
	НоваяКнопка.Шрифт                  = КнопкаИсточник.Шрифт; 
	НоваяКнопка.Картинка               = КнопкаИсточник.Картинка;
	НоваяКнопка.АвтоМаксимальнаяШирина = КнопкаИсточник.АвтоМаксимальнаяШирина;
	НоваяКнопка.МаксимальнаяШирина     = КнопкаИсточник.МаксимальнаяШирина;
	НоваяКнопка.Ширина                 = КнопкаИсточник.Ширина;
	НоваяКнопка.РастягиватьПоГоризонтали = КнопкаИсточник.РастягиватьПоГоризонтали;
	НоваяКнопка.Отображение            = КнопкаИсточник.Отображение;
	НоваяКнопка.ПоложениеКартинки     = КнопкаИсточник.ПоложениеКартинки;
	НоваяКнопка.ГоризонтальноеПоложениеВГруппе = КнопкаИсточник.ГоризонтальноеПоложениеВГруппе;
	НоваяКнопка.Вид = КнопкаИсточник.Вид;
	
	Возврат НоваяКнопка;
	
КонецФункции

// Функция, создает копию группы формы.
//
Функция КопироватьГруппуФормы(Форма, ГруппаИсточник, ПрефиксИмениНовойГруппы, Родитель) Экспорт
	
	ИмяИсточника = ГруппаИсточник.Имя;
	
	Если СтрНайти(ИмяИсточника, "_") > 0 Тогда    
		ИмяИсточника = Лев(ИмяИсточника, СтрНайти(ИмяИсточника, "_"));       
	КонецЕсли;
	
	ИмяНовойГруппы = ИмяИсточника + Строка(ПрефиксИмениНовойГруппы);
	
	НоваяГруппа                     = Форма.Элементы.Добавить(ИмяНовойГруппы, Тип("ГруппаФормы"), Родитель);
	
	НоваяГруппа.Вид                 = ГруппаИсточник.Вид;
	НоваяГруппа.Группировка         = ГруппаИсточник.Группировка;
	НоваяГруппа.Отображение         = ГруппаИсточник.Отображение;
	НоваяГруппа.ОтображатьЗаголовок = ГруппаИсточник.ОтображатьЗаголовок;
	НоваяГруппа.Ширина              = ГруппаИсточник.Ширина;
	НоваяГруппа.Высота              = ГруппаИсточник.Высота;
	НоваяГруппа.Заголовок           = ГруппаИсточник.Заголовок;
	НоваяГруппа.ЦветФона            = ГруппаИсточник.ЦветФона;
	
	НоваяГруппа.ВертикальныйИнтервал                = ГруппаИсточник.ВертикальныйИнтервал;
	НоваяГруппа.ГоризонтальныйИнтервал         		= ГруппаИсточник.ГоризонтальныйИнтервал;
	НоваяГруппа.ГоризонтальноеПоложениеПодчиненных  = ГруппаИсточник.ГоризонтальноеПоложениеПодчиненных;
	НоваяГруппа.ВертикальноеПоложениеПодчиненных    = ГруппаИсточник.ВертикальноеПоложениеПодчиненных;
	НоваяГруппа.РастягиватьПоГоризонтали            = ГруппаИсточник.РастягиватьПоГоризонтали;
	НоваяГруппа.РастягиватьПоВертикали              = ГруппаИсточник.РастягиватьПоВертикали;
	НоваяГруппа.ГоризонтальноеПоложениеВГруппе      = ГруппаИсточник.ГоризонтальноеПоложениеВГруппе;
	НоваяГруппа.ВертикальноеПоложениеВГруппе        = ГруппаИсточник.ВертикальноеПоложениеВГруппе;
	
	Если ГруппаИсточник.Поведение = ПоведениеОбычнойГруппы.Всплывающая Тогда
		
		НоваяГруппа.Поведение           = ГруппаИсточник.Поведение;
		НоваяГруппа.Видимость           = Истина;
		НоваяГруппа.ЦветТекстаЗаголовка = ГруппаИсточник.ЦветТекстаЗаголовка;
		НоваяГруппа.ШрифтЗаголовка      = ГруппаИсточник.ШрифтЗаголовка;
		
	КонецЕсли;
	
	Возврат НоваяГруппа;
	
КонецФункции

// Функция, создает копию элемента формы.
//
Функция КопироватьЭлементФормы(Форма, ЭлементИсточник, ПрефиксИмениНовогоЭлемента, ТипЭлемента = Неопределено, Родитель, ПутьКДанным = Неопределено, ПолучитьПутьКДанным = Ложь, Видимость = Ложь) Экспорт
	
	ИмяИсточника = ЭлементИсточник.Имя;
	
	Если СтрНайти(ИмяИсточника, "_") > 0 Тогда    
		ИмяИсточника = Лев(ИмяИсточника, СтрНайти(ИмяИсточника, "_"));
	КонецЕсли;
	
	Если ТипЭлемента = Неопределено Тогда
		ТипЭлемента = ТипЗнч(ЭлементИсточник);
	КонецЕсли;
	
	НовыйЭлемент     = Форма.Элементы.Добавить(ИмяИсточника + Формат(ПрефиксИмениНовогоЭлемента, "ЧН=; ЧГ="), ТипЭлемента, Родитель);   
	НовыйЭлемент.Вид = ЭлементИсточник.Вид;
	
	Если ТипЭлемента = Тип("ПолеФормы") Тогда
		
		Если ЭлементИсточник.Вид = ВидПоляФормы.ПолеВвода Тогда
			
			НовыйЭлемент.КнопкаВыбора              = ЭлементИсточник.КнопкаВыбора;
			НовыйЭлемент.КнопкаОткрытия            = ЭлементИсточник.КнопкаОткрытия;
			НовыйЭлемент.КнопкаОчистки             = ЭлементИсточник.КнопкаОчистки;
			НовыйЭлемент.КнопкаРегулирования       = ЭлементИсточник.КнопкаРегулирования;
			НовыйЭлемент.РедактированиеТекста      = ЭлементИсточник.РедактированиеТекста;
			НовыйЭлемент.КнопкаСпискаВыбора        = ЭлементИсточник.КнопкаСпискаВыбора;
			НовыйЭлемент.ШиринаВыпадающегоСписка   = ЭлементИсточник.ШиринаВыпадающегоСписка;
			НовыйЭлемент.ПодсказкаВвода            = ЭлементИсточник.ПодсказкаВвода;
			НовыйЭлемент.ПараметрыВыбора           = ЭлементИсточник.ПараметрыВыбора;
			НовыйЭлемент.ФормаВыбора               = ЭлементИсточник.ФормаВыбора;
			НовыйЭлемент.РежимВыбораИзСписка       = ЭлементИсточник.РежимВыбораИзСписка;
			НовыйЭлемент.КнопкаВыпадающегоСписка   = ЭлементИсточник.КнопкаВыпадающегоСписка;
			НовыйЭлемент.ОтображениеКнопкиВыбора   = ЭлементИсточник.ОтображениеКнопкиВыбора;
			НовыйЭлемент.АвтоОтметкаНезаполненного = ЭлементИсточник.АвтоОтметкаНезаполненного;
			НовыйЭлемент.ИсторияВыбораПриВводе     = ЭлементИсточник.ИсторияВыбораПриВводе;
			НовыйЭлемент.ТолькоПросмотр            = ЭлементИсточник.ТолькоПросмотр;
			
			Если ЗначениеЗаполнено(ЭлементИсточник.Подсказка) Тогда 
				НовыйЭлемент.Подсказка            = ЭлементИсточник.Подсказка;
				НовыйЭлемент.ОтображениеПодсказки = ЭлементИсточник.ОтображениеПодсказки;
			КонецЕсли;
			
			Если ЭлементИсточник.СписокВыбора.Количество() > 0 Тогда 
				
				Для Каждого ЭлементС Из ЭлементИсточник.СписокВыбора Цикл
					НовыйЭлемент.СписокВыбора.Добавить(ЭлементС.Значение, ЭлементС.Представление);    
				КонецЦикла;
				
			КонецЕсли;  
			
		ИначеЕсли ЭлементИсточник.Вид = ВидПоляФормы.ПолеКартинки Тогда
			
			НовыйЭлемент.Рамка             = ЭлементИсточник.Рамка;
			НовыйЭлемент.КартинкаЗначений     = ЭлементИсточник.КартинкаЗначений;
			НовыйЭлемент.Гиперссылка          = ЭлементИсточник.Гиперссылка;
			НовыйЭлемент.РастягиватьПоВертикали = ЭлементИсточник.РастягиватьПоВертикали;
			
			УстановитьДействиеДляЭлемента(ЭлементИсточник, НовыйЭлемент, "Нажатие");
			
		КонецЕсли;
		
		Если ЭлементИсточник.Вид = ВидПоляФормы.ПолеВвода
			ИЛИ ЭлементИсточник.Вид = ВидПоляФормы.ПолеНадписи
			ИЛИ ЭлементИсточник.Вид = ВидПоляФормы.ПолеКартинки Тогда
			
			НовыйЭлемент.ПоложениеЗаголовка       = ЭлементИсточник.ПоложениеЗаголовка;
			НовыйЭлемент.АвтоМаксимальнаяШирина   = ЭлементИсточник.АвтоМаксимальнаяШирина;
			НовыйЭлемент.АвтоМаксимальнаяВысота   = ЭлементИсточник.АвтоМаксимальнаяВысота;
			НовыйЭлемент.МаксимальнаяШирина       = ЭлементИсточник.МаксимальнаяШирина;
			НовыйЭлемент.МаксимальнаяВысота       = ЭлементИсточник.МаксимальнаяВысота;
			НовыйЭлемент.Шрифт                    = ЭлементИсточник.Шрифт;
			НовыйЭлемент.Ширина           = ЭлементИсточник.Ширина;
			НовыйЭлемент.Высота                   = ЭлементИсточник.Высота;
			НовыйЭлемент.РастягиватьПоГоризонтали = ЭлементИсточник.РастягиватьПоГоризонтали;
			
		КонецЕсли;
		
		Если ЭлементИсточник.Вид = ВидПоляФормы.ПолеВвода
			ИЛИ ЭлементИсточник.Вид = ВидПоляФормы.ПолеНадписи
			ИЛИ ЭлементИсточник.Вид = ВидПоляФормы.ПолеФлажка Тогда
			
			НовыйЭлемент.ПоложениеЗаголовка       = ЭлементИсточник.ПоложениеЗаголовка;
			
		КонецЕсли;
		
		// Копирование обработчиков
		Если ЭлементИсточник.Вид = ВидПоляФормы.ПолеВвода
			ИЛИ ЭлементИсточник.Вид = ВидПоляФормы.ПолеФлажка Тогда
			
			УстановитьДействиеДляЭлемента(ЭлементИсточник, НовыйЭлемент, "ПриИзменении");
			УстановитьДействиеДляЭлемента(ЭлементИсточник, НовыйЭлемент, "ОбработкаВыбора");
			УстановитьДействиеДляЭлемента(ЭлементИсточник, НовыйЭлемент, "НачалоВыбора");
			УстановитьДействиеДляЭлемента(ЭлементИсточник, НовыйЭлемент, "АвтоПодбор");
			
			Если ЭлементИсточник.Вид = ВидПоляФормы.ПолеВвода Тогда
				УстановитьДействиеДляЭлемента(ЭлементИсточник, НовыйЭлемент, "Открытие");
				УстановитьДействиеДляЭлемента(ЭлементИсточник, НовыйЭлемент, "ОкончаниеВводаТекста");
			КонецЕсли;
			
			Попытка
				НовыйЭлемент.ФорматРедактирования = ЭлементИсточник.ФорматРедактирования;
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
		Если ЭлементИсточник.Вид = ВидПоляФормы.ПолеФлажка Тогда
			
			НовыйЭлемент.ШиринаЭлемента       = ЭлементИсточник.ШиринаЭлемента;
			НовыйЭлемент.ВидФлажка            = ЭлементИсточник.ВидФлажка;
			
		КонецЕсли;
		
	ИначеЕсли ТипЭлемента = Тип("ДекорацияФормы") Тогда
		
		НовыйЭлемент.Шрифт                    = ЭлементИсточник.Шрифт;
		НовыйЭлемент.АвтоМаксимальнаяШирина   = ЭлементИсточник.АвтоМаксимальнаяШирина;
		НовыйЭлемент.АвтоМаксимальнаяВысота   = ЭлементИсточник.АвтоМаксимальнаяВысота;
		НовыйЭлемент.Ширина                   = ЭлементИсточник.Ширина;
		НовыйЭлемент.Высота                   = ЭлементИсточник.Высота;
		НовыйЭлемент.РастягиватьПоГоризонтали = ЭлементИсточник.РастягиватьПоГоризонтали;
		НовыйЭлемент.РастягиватьПоВертикали   = ЭлементИсточник.РастягиватьПоВертикали;
		НовыйЭлемент.МаксимальнаяШирина       = ЭлементИсточник.МаксимальнаяШирина;
		НовыйЭлемент.МаксимальнаяВысота       = ЭлементИсточник.МаксимальнаяВысота;  
		НовыйЭлемент.Гиперссылка              = ЭлементИсточник.Гиперссылка;    
		НовыйЭлемент.Подсказка                = ЭлементИсточник.Подсказка;    
		НовыйЭлемент.Рамка                    = ЭлементИсточник.Рамка;
		НовыйЭлемент.ЦветРамки                 = ЭлементИсточник.ЦветРамки;
		
		Если ЭлементИсточник.Вид = ВидДекорацииФормы.Картинка Тогда
			НовыйЭлемент.Вид      = ЭлементИсточник.Вид;
			НовыйЭлемент.Картинка = ЭлементИсточник.Картинка;
			НовыйЭлемент.РазмерКартинки = ЭлементИсточник.РазмерКартинки;
		КонецЕсли;  
		
		УстановитьДействиеДляЭлемента(ЭлементИсточник, НовыйЭлемент, "Нажатие");
		УстановитьДействиеДляЭлемента(ЭлементИсточник, НовыйЭлемент, "ОбработкаНавигационнойСсылки");
		
	КонецЕсли;
	
	Если ЭлементИсточник.Вид <> ВидДекорацииФормы.Картинка Тогда
		
		НовыйЭлемент.ГоризонтальноеПоложение = ЭлементИсточник.ГоризонтальноеПоложение;
		Если ЭлементИсточник.Вид <> ВидПоляФормы.ПолеКартинки Тогда
			НовыйЭлемент.ЦветФона            = ЭлементИсточник.ЦветФона;
		КонецЕсли;
		
	КонецЕсли;
	
	НовыйЭлемент.Заголовок             = ЭлементИсточник.Заголовок;
	НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ЭлементИсточник.ГоризонтальноеПоложениеВГруппе;
	НовыйЭлемент.ВертикальноеПоложениеВГруппе   = ЭлементИсточник.ВертикальноеПоложениеВГруппе;
	НовыйЭлемент.ЦветТекста                     = ЭлементИсточник.ЦветТекста;
	НовыйЭлемент.Видимость             = ?(Видимость, Истина, ЭлементИсточник.Видимость);
	
	Если ПолучитьПутьКДанным Тогда
		ПутьКДанным = ВернутьПутьКДанным(ЭлементИсточник, ПрефиксИмениНовогоЭлемента);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПутьКДанным) Тогда
		НовыйЭлемент.ПутьКДанным = СтрЗаменить(ПутьКДанным, Символы.НПП, "");
	КонецЕсли;
	
	Возврат НовыйЭлемент;
	
КонецФункции

// Процедура, устанавилвает действие для элемента формы.
//
Процедура УстановитьДействиеДляЭлемента(ЭлементИсточник, НовыйЭлемент, ИмяДействия)
	
	Действие = ЭлементИсточник.ПолучитьДействие(ИмяДействия);
	
	Если ЗначениеЗаполнено(Действие) Тогда
		НовыйЭлемент.УстановитьДействие(ИмяДействия, Действие);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Скопировать элемент формы рекурсивно
//
// Параметры:
//  Источник -    - 
//  Родитель -    - 
//  Счетчик   -    - 
//
Процедура СкопироватьЭлементФормыРекурсивно(Источник, Родитель, Счетчик, Форма)
	
	Если ТипЗнч(Источник) = Тип("ГруппаФормы") Тогда
		
		ГруппаРодитель = КопироватьГруппуФормы(Форма, Источник, Счетчик, Родитель);
		
		Для Каждого Элемент Из Источник.ПодчиненныеЭлементы Цикл
			СкопироватьЭлементФормыРекурсивно(Элемент, ГруппаРодитель, Счетчик, Форма);  
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("КнопкаФормы") Тогда     
		КопироватьКнопкуФормы(Форма, Источник, Счетчик, Родитель);    
	ИначеЕсли ТипЗнч(Источник) = Тип("ДекорацияФормы") Тогда      
		КопироватьЭлементФормы(Форма, Источник, Счетчик, Тип("ДекорацияФормы"), Родитель);        
	Иначе    
		КопироватьЭлементФормы(Форма, Источник, Счетчик, Тип("ПолеФормы"), Родитель, ВернутьПутьКДанным(Источник, Счетчик));          
	КонецЕсли;
	
КонецПроцедуры

// Функция - Вернуть путь к данным
//
// Параметры:
//  ИмяЭлемента   -    - 
//  Счетчик     -    - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьПутьКДанным(Источник, Счетчик)
	
	ИмяЭлемента = Источник.Имя;  
	Если СтрНайти(ИмяЭлемента, "Документ") > 0 Тогда   
		ПутьКДанным = Источник.ПутьКДанным;
	Иначе             
		
		Если СтрНайти(Источник.ПутьКДанным, "[") <> 0 Тогда
			
			НачИндекс = СтрНайти(Источник.ПутьКДанным, "[");
			КонИндекс = СтрНайти(Источник.ПутьКДанным, "]");
			
			ИскомыйСимвол = Сред(Источник.ПутьКДанным, НачИндекс + 1, КонИндекс - НачИндекс -1);
			
			ПутьКДанным = СтрЗаменить(Источник.ПутьКДанным, ИскомыйСимвол, Счетчик);
			
		Иначе			
			ПутьКДанным = СтрЗаменить(Источник.ПутьКДанным, "Шаблон", Счетчик); 
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПутьКДанным;
	
КонецФункции

// Обновить отображаемые данные на форме объекта со свойствами
Процедура ОбновитьЭлементыДополнительныхРеквизитов(Форма, Объект) Экспорт
	Если НЕ Форма.__Свойства_ИспользоватьСвойства Тогда
		Возврат;
	КонецЕсли;
	НаборСвойствОбъекта = ПолучитьДоступныеНаборыСвойств(Объект);
	Форма.__Свойства_ОсновнойНабор = НаборСвойствОбъекта;
	
	// Перенесем значения доп.реквизитов из реквизитов форм в объект
	ПеренестиЗначенияСвойствИзРеквизитовФормы(Форма, Объект);
	
	// Создадим реквизиты и разместим их на форме
	ЗаполнитьДополнительныеРеквизитыНаФорме(Форма, Объект, НаборСвойствОбъекта)
	
КонецПроцедуры

// Перенести значения свойств из реквизитов формы в табличную часть объекта
Процедура ПеренестиЗначенияСвойствИзРеквизитовФормы(Форма, Объект)
	
	Объект.ДополнительныеРеквизиты.Очистить();
	
	Для Каждого Стр Из Форма.__Свойства_ОписаниеДополнительныхРеквизитов Цикл
		Значение = Форма[Стр.ИмяРеквизитаЗначение];
		Если ЗначениеЗаполнено(Значение) Тогда
			Если ТипЗнч(Значение) = Тип("Булево") И Значение = Ложь Тогда
				Продолжить;
			КонецЕсли;
			
			новСтр = Объект.ДополнительныеРеквизиты.Добавить();
			новСтр.Свойство = Стр.Свойство;
			новСтр.Значение = Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Создадим реквизиты с значениями свойств и разместить их на форме
Процедура ЗаполнитьДополнительныеРеквизитыНаФорме(Форма, Объект, НаборСвойствОбъекта)
	
	Если НаборСвойствОбъекта = Неопределено Тогда
		Набор = Форма.__Свойства_ОсновнойНабор;
	Иначе
		Набор = НаборСвойствОбъекта;
	КонецЕсли;
	
	Таблица = ПолучитьТаблицуЗначенийСвойств(Объект.ДополнительныеРеквизиты.Выгрузить(), Набор, Ложь);
	Таблица.Колонки.Добавить("ИмяРеквизитаЗначение");
	Таблица.Колонки.Добавить("ИмяРеквизитаСвойство");
	Таблица.Колонки.Добавить("Булево");
	
	УдалитьСтарыеРеквизиты(Форма);
	Форма.__Свойства_ОписаниеДополнительныхРеквизитов.Очистить();
	
	// Создадим реквизиты
	Номер = 0;
	ДобавляемыеРеквизиты = Новый Массив();
	Для Каждого СтрРеквизит Из Таблица Цикл
		
		Номер = Номер + 1;
		ТипЗначенияСвойства = СтрРеквизит.ТипЗначения;
		
		СтрРеквизит.ИмяРеквизитаЗначение = "ДополнительныйРеквизитЗначение" + Формат(Номер, "ЧГ=0");
		Реквизит = Новый РеквизитФормы(СтрРеквизит.ИмяРеквизитаЗначение, ТипЗначенияСвойства, , СтрРеквизит.Наименование, Истина);
		ДобавляемыеРеквизиты.Добавить(Реквизит);
		
		СтрРеквизит.ИмяРеквизитаСвойство = "";
		Если ТипЗначенияСодержитЗначенияСвойств(ТипЗначенияСвойства) Тогда
			СтрРеквизит.ИмяРеквизитаСвойство = "ДополнительныйРеквизитСвойство" + Формат(Номер, "ЧГ=0");
			Реквизит = Новый РеквизитФормы(СтрРеквизит.ИмяРеквизитаСвойство, Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"), , , Истина);
			ДобавляемыеРеквизиты.Добавить(Реквизит);
		КонецЕсли;
		
		СтрРеквизит.Булево = ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ТипЗначенияСвойства, Тип("Булево"));
		
	КонецЦикла;
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Создадим элементы формы
	Для Каждого СтрРеквизит Из Таблица Цикл
		
		новСтр = Форма.__Свойства_ОписаниеДополнительныхРеквизитов.Добавить();
		новСтр.ИмяРеквизитаЗначение = СтрРеквизит.ИмяРеквизитаЗначение;
		новСтр.ИмяРеквизитаСвойство = СтрРеквизит.ИмяРеквизитаСвойство;
		новСтр.Свойство             = СтрРеквизит.Свойство;
		
		Форма[СтрРеквизит.ИмяРеквизитаЗначение] = СтрРеквизит.Значение;
		
		ИмяЭлементаДляРазмещения = Форма.__Свойства_ИмяЭлементаДляРазмещения;
		Родитель = ?(ИмяЭлементаДляРазмещения = "", Неопределено, Форма.Элементы[ИмяЭлементаДляРазмещения]);
		Элемент = Форма.Элементы.Добавить(СтрРеквизит.ИмяРеквизитаЗначение, Тип("ПолеФормы"), Родитель);
		Элемент.Вид = ?(СтрРеквизит.Булево, ВидПоляФормы.ПолеФлажка, ВидПоляФормы.ПолеВвода);
		Элемент.ПутьКДанным = СтрРеквизит.ИмяРеквизитаЗначение;
		
		Если СтрРеквизит.Удалено Тогда
			Элемент.ЦветТекстаЗаголовка = ЦветаСтиля.УдаленныйДополнительныйРеквизитЦвет;
			Элемент.ШрифтЗаголовка = ШрифтыСтиля.УдаленныйДополнительныйРеквизитШрифт;
		КонецЕсли;
		
		Если СтрРеквизит.ИмяРеквизитаСвойство <> "" Тогда
			Связь = Новый СвязьПараметраВыбора("Отбор.Владелец", СтрРеквизит.ИмяРеквизитаСвойство);
			масСвязи = Новый Массив;
			масСвязи.Добавить(Связь);
			Элемент.СвязиПараметровВыбора = Новый ФиксированныйМассив(масСвязи);
			Форма[СтрРеквизит.ИмяРеквизитаСвойство] = СтрРеквизит.Свойство;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// По объекту или ссылке на объект получить набор или список наборов доступных ему свойств
// Параметры:
//	ВладелецСвойств - ссылка на объект или сам объект
Функция ПолучитьДоступныеНаборыСвойств(ВладелецСвойств) Экспорт
	
	Возврат ПолучитьОсновнойНаборСвойствДляОбъекта(ВладелецСвойств);
	
КонецФункции

// По объекту или по ссылке на объект и по имени реквизита, содержащего вид объекта
// получает основной набор свойств.
// Для ссылки на справочник "Сущности" функция вернет
// предопределенный элемент справочника НаборыСвойств "Справочник_Сущности".
// Если передан параметр ВидОбъектаИмяРеквизита, функция вернет ссылку на 
// набор свойств, содержащийся в Ссылка.<ВидОбъектаИмяРеквизита>
//
Функция ПолучитьОсновнойНаборСвойствДляОбъекта(ВладелецСвойств) Экспорт
	
	МетаданныеОбъекта = ВладелецСвойств.Метаданные();
	ИмяОбъекта = МетаданныеОбъекта.Имя;
	
	ПереданОбъект = Ложь;
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(ВладелецСвойств) Тогда
		Ссылка = ВладелецСвойств;
	Иначе
		ПереданОбъект = Истина;
		Ссылка = ВладелецСвойств.Ссылка;
	КонецЕсли;
	
	ВидОбъекта = ОбщегоНазначения.ВидОбъектаПоСсылке(Ссылка);
	ВидОбъектаИмяРеквизита = "";
	Если ВидОбъектаИмяРеквизита = "" Тогда
		Если ВидОбъекта = "Справочник" или ВидОбъекта = "ПланВидовХарактеристик" Тогда
			Если ОбъектЯвляетсяГруппой(ВладелецСвойств) Тогда
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		ИмяЭлемента = ВидОбъекта + "_" + ИмяОбъекта;
		Возврат Справочники.НаборыСвойств[ИмяЭлемента];
		
	Иначе
		Если ПереданОбъект = Истина Тогда
			Возврат ОбщегоНазначения.ПолучитьЗначениеРеквизита(ВладелецСвойств[ВидОбъектаИмяРеквизита], "НаборСвойств");
			
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОбъектВладелецСвойств." + ВидОбъектаИмяРеквизита + ".НаборСвойств КАК Набор
			|ИЗ
			|	" + ВидОбъекта + "." + ИмяОбъекта + " КАК ОбъектВладелецСвойств
			|ГДЕ
			|	ОбъектВладелецСвойств.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Результат = Запрос.Выполнить();
			
			Если НЕ Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				Если ЗначениеЗаполнено(Выборка.Набор) Тогда
					Возврат Выборка.Набор;
				Иначе
					Возврат Справочники.НаборыСвойств.ПустаяСсылка();
				КонецЕсли;
			Иначе
				Возврат Справочники.НаборыСвойств.ПустаяСсылка();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

// Получить заполненную таблицу значений свойств объекта
Функция ПолучитьТаблицуЗначенийСвойств(ДополнительныеСвойстваОбъекта, Набор, ЭтоДополнительноеСведение) Экспорт
	
	масСвойств = ДополнительныеСвойстваОбъекта.ВыгрузитьКолонку("Свойство");
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НаборыСвойствДополнительныеРеквизиты.Свойство КАК Свойство,
	|	МИНИМУМ(НаборыСвойствДополнительныеРеквизиты.НомерСтроки) КАК Порядок
	|ПОМЕСТИТЬ ВсеСвойстваНабора
	|ИЗ
	|	Справочник.НаборыСвойств.ДополнительныеРеквизиты КАК НаборыСвойствДополнительныеРеквизиты
	|ГДЕ
	|	НаборыСвойствДополнительныеРеквизиты.Ссылка В(&Набор)
	|	И (НЕ НаборыСвойствДополнительныеРеквизиты.Ссылка.ПометкаУдаления)
	|	И (НЕ НаборыСвойствДополнительныеРеквизиты.Ссылка.ЭтоГруппа)
	|	И (НЕ &ЭтоДополнительноеСведение)
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборыСвойствДополнительныеРеквизиты.Свойство
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НаборыСвойствДополнительныеСведения.Свойство,
	|	МИНИМУМ(НаборыСвойствДополнительныеСведения.НомерСтроки)
	|ИЗ
	|	Справочник.НаборыСвойств.ДополнительныеСведения КАК НаборыСвойствДополнительныеСведения
	|ГДЕ
	|	НаборыСвойствДополнительныеСведения.Ссылка В(&Набор)
	|	И (НЕ НаборыСвойствДополнительныеСведения.Ссылка.ПометкаУдаления)
	|	И (НЕ НаборыСвойствДополнительныеСведения.Ссылка.ЭтоГруппа)
	|	И &ЭтоДополнительноеСведение
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборыСвойствДополнительныеСведения.Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Свойство
	|ПОМЕСТИТЬ ЗаполненныеСвойства
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Ссылка В(&масСвойств)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВсеСвойстваНабора.Свойство,
	|	ВсеСвойстваНабора.Порядок,
	|	ЛОЖЬ КАК Удалено
	|ПОМЕСТИТЬ ВсеСвойства
	|ИЗ
	|	ВсеСвойстваНабора КАК ВсеСвойстваНабора
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаполненныеСвойства.Свойство,
	|	0,
	|	ИСТИНА
	|ИЗ
	|	ЗаполненныеСвойства КАК ЗаполненныеСвойства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеСвойстваНабора КАК ВсеСвойстваНабора
	|		ПО ЗаполненныеСвойства.Свойство = ВсеСвойстваНабора.Свойство
	|ГДЕ
	|	ВсеСвойстваНабора.Свойство ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	ВсеСвойства.Свойство,
	|	ДополнительныеРеквизитыИСведения.Наименование,
	|	ДополнительныеРеквизитыИСведения.ТипЗначения,
	|	ВсеСвойства.Удалено КАК Удалено
	|ИЗ
	|	ВсеСвойства КАК ВсеСвойства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|		ПО ВсеСвойства.Свойство = ДополнительныеРеквизитыИСведения.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Удалено,
	|	ВсеСвойства.Порядок";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ЭтоДополнительноеСведение", ЭтоДополнительноеСведение);
	Запрос.УстановитьПараметр("масСвойств", масСвойств);
	Запрос.УстановитьПараметр("Набор", Набор);
	
	ТабСвойства = Запрос.Выполнить().Выгрузить();
	ТабСвойства.Индексы.Добавить("Свойство");
	ТабСвойства.Колонки.Добавить("Значение");
	
	Для Каждого Стр Из ДополнительныеСвойстваОбъекта Цикл
		СтрСвойства = ТабСвойства.Найти(Стр.Свойство, "Свойство");
		Если СтрСвойства <> Неопределено Тогда
			СтрСвойства.Значение = Стр.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабСвойства;
	
КонецФункции

// Удалить старые реквизиты и элементы формы
Процедура УдалитьСтарыеРеквизиты(Форма)
	
	// Удалим старые реквизиты и элементы
	масУдалять = Новый Массив;
	Для Каждого СтрРеквизит Из Форма.__Свойства_ОписаниеДополнительныхРеквизитов Цикл
		
		масУдалять.Добавить(СтрРеквизит.ИмяРеквизитаЗначение);
		Если Не ПустаяСтрока(СтрРеквизит.ИмяРеквизитаСвойство) Тогда
			масУдалять.Добавить(СтрРеквизит.ИмяРеквизитаСвойство);
		КонецЕсли;
		
		Форма.Элементы.Удалить(Форма.Элементы[СтрРеквизит.ИмяРеквизитаЗначение]);
		
	КонецЦикла;
	
	Если масУдалять.Количество() Тогда
		Форма.ИзменитьРеквизиты(, масУдалять);
	КонецЕсли;
	
КонецПроцедуры

// Проверить, что тип значения свойства содержит ссылку на справочник ЗначенияСвойствОбъектов
Функция ТипЗначенияСодержитЗначенияСвойств(ТипЗначения) Экспорт
	
	Возврат ТипЗначения.Типы().Найти(Тип("СправочникСсылка.ЗначенияСвойствОбъектов")) <> Неопределено;
	
КонецФункции

// Является ли объект группой
// В качестве параметра может принимать только справочник или ПВХ
Функция ОбъектЯвляетсяГруппой(Объект)
	МетаданныеОбъекта = Объект.Метаданные();
	Если НЕ (МетаданныеОбъекта.Иерархический И МетаданныеОбъекта.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(Объект) Тогда
		Возврат Объект.ЭтоГруппа;
	КонецЕсли;
	
	Ссылка = Объект.Ссылка;
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Ссылка, "ЭтоГруппа");
	
КонецФункции

// Функция - Получить картинку ПШ
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКартинкуПШ(ТипШлюза) Экспорт
			
	Если ТипШлюза = Перечисления.ПлатежныеШлюзы.Сбербанк 
		ИЛИ ТипШлюза = Перечисления.ПлатежныеШлюзы.СбербанкПлатиQR Тогда		
		КартинкаПлатёжногоШлюза = БиблиотекаКартинок.СсылкиНаОплату_СберБанк_16;			
	ИначеЕсли ТипШлюза = Перечисления.ПлатежныеШлюзы.СБПАльфаБанк 
		ИЛИ ТипШлюза = Перечисления.ПлатежныеШлюзы.СБПРайффайзенБанк
		ИЛИ ТипШлюза = Перечисления.ПлатежныеШлюзы.СБПСбербанк
		ИЛИ ТипШлюза = Перечисления.ПлатежныеШлюзы.СБПТинькофф 
		ИЛИ ТипШлюза = Перечисления.ПлатежныеШлюзы.СБПСДМ Тогда		
		КартинкаПлатёжногоШлюза = БиблиотекаКартинок.СсылкиНаОплату_СБП_16;		
	Иначе
		КартинкаПлатёжногоШлюза = Новый Картинка;
	КонецЕсли;
	
	Возврат КартинкаПлатёжногоШлюза;
	
КонецФункции

#КонецОбласти
