
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик события "при создании на сервере" формы
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодОтбор = НачалоМесяца(ТекущаяДата());
	ПериодОтборПредставление = Формат(ПериодОтбор, "ДФ='MMMM yyyy'");
	
	// *** Костыль
	// Поскольку в версии платформы 8.3.4 отборы, установленные в конфигураторе (не путать с программной установкой), потом нифига не видны,
	// приходится их задавать программно при инициализации формы
	ИзменитьЭлементОтбораСписка(Дерево, "НачалоПериодаНачалоМесяца", ПериодОтбор, ЗначениеЗаполнено(ПериодОтбор), ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);	
	ГруппаИЛИ = УстановитьГруппуЭлементовОтбора(Дерево.Отбор.Элементы);
	УстановитьЭлементОтбораКоллекции(ГруппаИЛИ.Элементы, "КонецПериодаКонецМесяца", ПериодОтбор, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	УстановитьЭлементОтбораКоллекции(ГруппаИЛИ.Элементы, "КонецПериода", Дата("00010101"));
	// *** КонецКостыля
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		ИсходныйСотрудник = Параметры.Отбор.Владелец;
	КонецЕсли;


КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодОтборПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(ПериодОтбор = Дата('00010101'), ТекущаяДата(), ПериодОтбор));
	ОткрытьФорму("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров,,,,,Новый ОписаниеОповещения("ПериодОтборПредставлениеЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПериодОтборПредставлениеЗавершение"
//
Процедура ПериодОтборПредставлениеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПериодОтбор = КонецДня(Результат);
	
	ПериодОтборПредставлениеПриИзменении(Результат);

КонецПроцедуры

&НаКлиенте
Процедура ПериодОтборПредставлениеПриИзменении(Элемент)
	
	ПериодОтбор = НачалоМесяца(ПериодОтбор);
	ПериодОтборПредставление = Формат(ПериодОтбор, "ДФ='MMMM yyyy'");
	
	Дерево.Отбор.Элементы.Получить(0).ПравоеЗначение = ПериодОтбор;
	Дерево.Отбор.Элементы.Получить(0).Использование = ЗначениеЗаполнено(ПериодОтбор);
	Дерево.Отбор.Элементы.Получить(1).Элементы.Получить(0).ПравоеЗначение = ПериодОтбор;
	Дерево.Отбор.Элементы.Получить(1).Элементы.Получить(0).Использование = ЗначениеЗаполнено(ПериодОтбор);
	Элементы.Дерево.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтборПредставлениеРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ПериодОтбор) Тогда
		ПериодОтбор = ТекущаяДата();
	КонецЕсли;
	
	ПериодОтбор = ДобавитьМесяц(ПериодОтбор, Направление);
	ПериодОтборПредставлениеПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтборПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	
	ПериодОтбор = Дата("00010101");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура представляет возможность выбрать сотрудника
//
Процедура ДобавитьНачисленияСотрудника(Команда)
	
	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаВыбора", Новый Структура("ВыборГруппПользователей, РежимВыбора, БезОтбораПоРолям", Истина, Истина, Истина),,,,,Новый ОписаниеОповещения("ДобавитьНачисленияСотрудникаЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ДобавитьНачисленияСотрудникаЗавершение"
//
Процедура ДобавитьНачисленияСотрудникаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда		
		ЕстьНачисленияИУдержания = ПроверитьЗаполнениеДереваЗначений(Результат);
		Если ЕстьНачисленияИУдержания Тогда			
			Если Результат = ИсходныйСотрудник Тогда
				Режим = РежимДиалогаВопрос.ДаНет;
				ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьНачисленияПослеВопросаПоСотруднику", ЭтотОбъект, Новый Структура("Результат", Результат)), 
				"Вы выбрали того же сотрудника, т.е. вы пытаетесь добавить сотруднику его же начисления и удержания.
				|Продолжить выполнение операции?", РежимДиалогаВопрос.ДаНет, 0,,"Предупреждение!"); 	
			Иначе
				СкопироватьНачисленияСотрудника(Результат);
				Элементы.Дерево.Обновить();
				ПоказатьПредупреждение(,"Начисления и удержания сотрудника """ + Строка(Результат) + """ успешно добавлены """ + ИсходныйСотрудник + """!", 0); 
			КонецЕсли;
		Иначе
			Оповещение = Новый ОписаниеОповещения("ПослеПредупреждения", ЭтотОбъект);
			ПоказатьПредупреждение(Оповещение, "У сотрудника """ + Строка(Результат) + """ нет начислений и удержаний!", 0);
		КонецЕсли;			
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
// Процедура, Обработчик события "ПослеПредупреждения"
//
Процедура ПослеПредупреждения(Результат) Экспорт

	ДобавитьНачисленияСотрудника(Неопределено);
	
КонецПроцедуры

&НаКлиенте 
// Процедура, Обработчик события "ДобавитьНачисленияПослеВопросаПоСотруднику" 
//
Процедура ДобавитьНачисленияПослеВопросаПоСотруднику(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Результат = ДополнительныеПараметры.Результат;
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда 
		ДобавитьНачисленияСотрудника(Неопределено); 
		Возврат;
	Иначе					
		СкопироватьНачисленияСотрудника(Результат);
		Элементы.Дерево.Обновить();
		ПоказатьПредупреждение(,"Начисления и удержания сотрудника """ + Строка(Результат) + """ успешно добавлены """ + ИсходныйСотрудник + """!", 0);
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Функция возвращает значение Истина если
// у выбранного сотрудника есть хотя бы одно начисление
Функция ПроверитьЗаполнениеДереваЗначений(ВыбранныйСотрудник)
	
	ЗапросПоВыбранномуСотруднику = Новый Запрос;
	ЗапросПоВыбранномуСотруднику.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                                     |	НачисленияИУдержанияСотрудников.Ссылка КАК Ссылка
	                                     |ИЗ
	                                     |	Справочник.НачисленияИУдержанияСотрудников КАК НачисленияИУдержанияСотрудников
	                                     |ГДЕ
	                                     |	НачисленияИУдержанияСотрудников.Владелец = &Владелец
	                                     |	И НЕ НачисленияИУдержанияСотрудников.ПометкаУдаления";
		
 	ЗапросПоВыбранномуСотруднику.УстановитьПараметр("Владелец", ВыбранныйСотрудник); 				
	НачисленияИУдержанияСотрудника = ЗапросПоВыбранномуСотруднику.Выполнить().Выгрузить();
	
	ЕстьНачисленияИУдержания = Ложь;
	Если НачисленияИУдержанияСотрудника.Количество() <> 0 Тогда 
		ЕстьНачисленияИУдержания = Истина;
		Возврат ЕстьНачисленияИУдержания;
	КонецЕсли;
	
	Возврат ЕстьНачисленияИУдержания;
	
КонецФункции

&НаСервере 
// Процедура копирует начисления выбранного сотрудника текущему
//
Процедура СкопироватьНачисленияСотрудника(ВыбранныйСотрудник)
	
	ЗапросПоВыбранномуСотруднику = Новый Запрос;
	ЗапросПоВыбранномуСотруднику.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НачисленияИУдержанияСотрудников.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.НачисленияИУдержанияСотрудников КАК НачисленияИУдержанияСотрудников
	               |ГДЕ
	               |	НачисленияИУдержанияСотрудников.Владелец = &Владелец
	               |	И НЕ НачисленияИУдержанияСотрудников.ПометкаУдаления
	               |ИТОГИ ПО
	               |	Ссылка ТОЛЬКО ИЕРАРХИЯ";
		
 	ЗапросПоВыбранномуСотруднику.УстановитьПараметр("Владелец", ВыбранныйСотрудник); 				
	НачисленияИУдержанияВыбранногоСотрудника = ЗапросПоВыбранномуСотруднику.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для Каждого Строка Из НачисленияИУдержанияВыбранногоСотрудника.Строки Цикл
		Если Строка.Ссылка.ЭтоГруппа Тогда
			НоваяГруппа = Справочники.НачисленияИУдержанияСотрудников.СоздатьГруппу();
			НоваяГруппа = Строка.Ссылка.Скопировать();
			НоваяГруппа.Владелец = ИсходныйСотрудник;
			НоваяГруппа.Записать();
			Для Каждого СтрокаТЧ из Строка.Строки Цикл
				Если НЕ СтрокаТЧ.Ссылка.ЭтоГруппа Тогда
					НовоеУдержание = Справочники.НачисленияИУдержанияСотрудников.СоздатьЭлемент();
					НовоеУдержание = СтрокаТЧ.Ссылка.Скопировать();
					НовоеУдержание.Владелец = ИсходныйСотрудник;
					НовоеУдержание.Родитель = НоваяГруппа.Ссылка;
					НовоеУдержание.СкопированноУСотрудника = ВыбранныйСотрудник;
					НовоеУдержание.Записать();            
				КонецЕсли;
			КонецЦикла;                                			
		Иначе
			Для Каждого СтрокаТЧ из Строка.Строки Цикл
				Если СтрокаТЧ.Ссылка.ЭтоГруппа Тогда
					НоваяГруппа = Справочники.НачисленияИУдержанияСотрудников.СоздатьГруппу();
					НоваяГруппа = СтрокаТЧ.Ссылка.Скопировать();
					НоваяГруппа.Владелец = ИсходныйСотрудник;
					НоваяГруппа.Записать();
				Иначе			
					НовоеУдержание = Справочники.НачисленияИУдержанияСотрудников.СоздатьЭлемент();
					НовоеУдержание = СтрокаТЧ.Ссылка.Скопировать();
					НовоеУдержание.Владелец = ИсходныйСотрудник;
					НовоеУдержание.СкопированноУСотрудника = ВыбранныйСотрудник;
					НовоеУдержание.Записать();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;  
		
	КонецЦикла;
 	
КонецПроцедуры


/////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ УСТАНОВКИ ОТБОРОВ

// Изменяет элемент отбора динамического списка
//
// Параметры:
// Список         - обрабатываемый динамический список,
// ИмяПоля        - имя поля компоновки, отбор по которому нужно установить,
// ВидСравнения   - вид сравнения отбора, по умолчанию - Равно,
// ПравоеЗначение - значение отбора,
// Установить     - признак необходимости установить отбор
//
Процедура ИзменитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение = Неопределено, Установить = Ложь, ВидСравнения = Неопределено)
	
	УдалитьЭлементОтбораКоллекции(Список.Отбор.Элементы, ИмяПоля);
	
	Если Установить Тогда
		УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения);
	КонецЕсли;
	
КонецПроцедуры // ИзменитьЭлементОтбораСписка()

// Устанавливает элемент отбор динамического списка
//
// Параметры:
// Список			- обрабатываемый динамический список,
// ИмяПоля			- имя поля компоновки, отбор по которому нужно установить,
// ВидСравнения		- вид сравнения отбора, по умолчанию - Равно,
// ПравоеЗначение 	- значение отбора
//
Процедура УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения = Неопределено)   
	
	УстановитьЭлементОтбораКоллекции(Список.Отбор.Элементы, ИмяПоля, ПравоеЗначение, ВидСравнения);
	
КонецПроцедуры // УстановитьЭлементОтбораСписка()

// Процедура выполняет установку элемента отбора коллекции
//
Процедура УстановитьЭлементОтбораКоллекции(КоллекцияЭлементов, ИмяПоля, ПравоеЗначение, ВидСравнения = Неопределено)
	
	ЭлементОтбора = КоллекцияЭлементов.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ВидСравнения     = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
	ЭлементОтбора.Использование    = Истина;
	ЭлементОтбора.ПравоеЗначение   = ПравоеЗначение;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры // УстановитьЭлементОтбораСписка()

// Функция выполняет установку элемента группировки коллекции
//
Функция УстановитьГруппуЭлементовОтбора(КоллекцияЭлементов,
					ТипГруппы = Неопределено,
					Родитель = Неопределено)

	ЭлементОтбора = КоллекцияЭлементов.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ЭлементОтбора.ТипГруппы 		= ?(ТипГруппы = Неопределено, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли, ТипГруппы);
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.Применение 		= ТипПримененияОтбораКомпоновкиДанных.Элементы;
	
	Возврат ЭлементОтбора;

КонецФункции // УстановитьЭлементГруппыКоллекции()

// Процедура выполняет удаление элемента отбора коллекции
//
Процедура УдалитьЭлементОтбораКоллекции(КоллекцияЭлементов, ИмяПоля)
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для Каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			КоллекцияЭлементов.Удалить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // УдалитьЭлементОтбораСписка()

#КонецОбласти
